{"word":"lab","summary":{"en":"“Lab” most commonly means a laboratory; it can also mean a practical class period or, informally, a Labrador retriever.","zh":"“lab”最常见指“实验室”；也可指“实验课/上机课”，口语中还可指“拉布拉多犬”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A laboratory: a room or building where people do scientific tests, research, or experiments.","zh":"实验室：进行科学测试、研究或实验的房间或建筑。"},"examples":[{"en":"We did the experiment in the chemistry lab.","zh":"我们在化学实验室做了这个实验。"},{"en":"She works in a medical lab analyzing blood samples.","zh":"她在医学实验室工作，分析血液样本。"}]},{"partOfSpeech":"n.","definition":{"en":"A class period for practical work (often in science or computing), where students practice and do hands-on tasks.","zh":"（课程）实验课/上机课：学生进行动手练习与操作的课时（常见于理科或计算机）。"},"examples":[{"en":"We have biology lab on Friday afternoons.","zh":"我们周五下午有生物实验课。"},{"en":"In computer lab, we learned how to use spreadsheets.","zh":"在电脑课上，我们学习了如何使用电子表格。"}]},{"partOfSpeech":"n.","definition":{"en":"A Labrador retriever (informal).","zh":"拉布拉多犬（非正式说法）。"},"examples":[{"en":"Their lab is very friendly with kids.","zh":"他们家的拉布拉多对孩子很友好。"}]}],"synonyms":["laboratory","science lab","computer lab"],"phonetic":"/læb/","extraExplanation":["“lab”最常见是“laboratory”的缩写，在口语、校园和工作场景里非常常用；正式写作中一般用“laboratory”。","常见搭配：lab coat（实验服/白大褂）、lab report（实验报告）、lab technician（实验室技术员）、language lab（语音室/语言实验室）、computer lab（电脑教室/机房）。"]}
{"word":"labaara","summary":{"en":"“Labaara” is not a common dictionary word in English; it’s likely a name or a misspelling.","zh":"“labaara”不是常见的英语词典词汇；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a personal name, a place name, or a misspelling/variant spelling of another word (for example, “labour/labor,” “Labrador,” etc.).","zh":"不是标准英语词汇。它更常见于人名、地名，或作为其他词的误拼/变体拼写（例如“labour/labor（劳动）”、“Labrador（拉布拉多）”等）。"},"examples":[{"en":"I couldn’t find “labaara” in a standard English dictionary—where did you see it?","zh":"我在标准英语词典里找不到“labaara”——你是在哪里看到它的？"},{"en":"Labaara is my username online.","zh":"Labaara 是我的网名。"}]}],"phonetic":"/ləˈbɑːrə/","extraExplanation":["“labaara”看起来更像是来自其他语言的词、专有名词（人名/地名/账号名），或某个英语词的拼写错误。为了给你准确释义，请把它出现的句子贴出来，或告诉我你想查的是不是以下之一：\n1) labor/labour（美/英：劳动；努力；分娩）\n2) Labrador（拉布拉多：狗或地区名）\n3) 其他语言中的词（请告知语言/来源）"]}
{"word":"labadist","summary":{"en":"A Labadist is a member of (or relating to) a 17th‑century Christian group founded by Jean de Labadie.","zh":"Labadist 指拉巴迪派成员，或与该派（17世纪让·德·拉巴迪创立的基督教团体）相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Labadists, a small Christian religious group (a pietistic community) founded by Jean de Labadie in the 1600s","zh":"拉巴迪派（Labadists）成员；17世纪由让·德·拉巴迪创立的一支小型基督教宗教团体（偏重虔敬主义的社群）"},"examples":[{"en":"A few Labadists settled in North America in the late 1600s.","zh":"17世纪末，一些拉巴迪派成员在北美定居。"},{"en":"The museum has documents written by Labadists in colonial times.","zh":"博物馆收藏了殖民时期拉巴迪派成员写下的文献。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Labadists or their beliefs and way of life","zh":"与拉巴迪派及其信仰、生活方式有关的"},"examples":[{"en":"The author describes a Labadist community that shared property and lived simply.","zh":"作者描写了一个拉巴迪派社群：他们共有财产，生活朴素。"}]}],"synonyms":["follower of Jean de Labadie","member of the Labadists"],"phonetic":"/ˈlæbəˌdɪst/","extraExplanation":["“Labadist”来自创立者 Jean de Labadie（让·德·拉巴迪）的姓氏。该团体强调虔敬生活、严格的道德实践与群体共同生活；在英语史料中多见于宗教史、殖民史语境（尤其与17世纪末北美早期定居点相关）。"]}
{"word":"laban","summary":{"en":"“Laban” can refer to a Bible character (Jacob’s uncle/father-in-law) or a Middle Eastern fermented milk drink.","zh":"“Laban”既可指《圣经》人物拉班（雅各的舅舅/岳父），也可指中东常见的发酵乳饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A man in the Hebrew Bible (Old Testament), Jacob’s uncle and later father-in-law, known in the story of Jacob, Leah, and Rachel.","zh":"（专有名词）《希伯来圣经/旧约》中的人物：雅各的舅舅，后来成为他的岳父；与雅各、利亚和拉结的故事有关。"},"examples":[{"en":"In Genesis, Laban agrees to let Jacob marry Rachel after years of work.","zh":"在《创世记》中，拉班同意雅各辛苦工作多年后娶拉结。"},{"en":"The story of Jacob and Laban is often read as a lesson about family and fairness.","zh":"雅各与拉班的故事常被解读为关于家庭与公平的教训。"}]},{"partOfSpeech":"n.","definition":{"en":"A fermented milk drink (similar to yogurt or buttermilk), common in Middle Eastern and North African cuisines.","zh":"一种发酵乳饮料（类似酸奶或酪乳），常见于中东和北非饮食文化中。"},"examples":[{"en":"He ordered laban to cool down on a hot day.","zh":"他点了一杯拉班发酵乳饮料，在炎热的天气里解暑。"},{"en":"Laban is often served chilled and can be slightly salty.","zh":"拉班通常冷饮，味道可能带一点咸味。"}]}],"synonyms":["(Bible)","(drink) yogurt drink","buttermilk (similar)","kefir (similar)"],"phonetic":"/ˈlɑːbən/","extraExplanation":["“Laban”在英语里最常见的两种用法是：圣经人物名（专名）和中东饮食中的发酵乳饮料名。遇到文章语境出现Genesis（《创世记》）、Jacob（雅各）等词，几乎一定指圣经中的拉班。","饮料/食物的“laban”一词在不同地区拼写可能略有变化（如 labneh 指更浓稠的发酵乳制品），点餐或看食谱时可通过质地与用途区分。"]}
{"word":"labara","summary":{"en":"“Labara” is most often the plural of “labarum,” meaning ancient Roman military standards linked to Constantine; it can also appear as a rare proper name.","zh":"“labara”多为“labarum”的复数，指与君士坦丁相关的古罗马军旗/军标；也可能是少见的专有名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of labarum: military standards (banners) used in the late Roman Empire, especially associated with Emperor Constantine and the Christian Chi-Rho symbol","zh":"labarum（君士坦丁时期著名的罗马军旗/军标，常带有基督教“基罗”符号）的复数：指多面这种军旗/军标"},"examples":[{"en":"Ancient writers describe labara carried at the front of the army.","zh":"古代作家记载，军队前方会举着多面 labara（军旗/军标）。"},{"en":"In the museum, you can see images of labara with Christian symbols.","zh":"在博物馆里，你能看到带有基督教符号的 labara 图像。"}]},{"partOfSpeech":"other","definition":{"en":"a rare proper name (e.g., a surname or place name) seen in some contexts; meaning depends on the specific reference","zh":"较少见的专有名词（如姓氏或地名）；具体含义取决于所指对象"},"examples":[{"en":"I found “Labara” listed as a family name in the records.","zh":"我在档案里看到“Labara”被列为一个姓氏。"}]}],"synonyms":["standards","banners","ensigns"],"phonetic":"/ləˈbɑːrə/","extraExplanation":["“labara”在现代英语里非常罕见，最常见的情况是把拉丁词“labarum”的复数写作“labara”。“labarum”与罗马皇帝君士坦丁相关，常被用来指带有基督教标志（如 Chi-Rho）的军旗/军标。","如果你其实想查的是更常用的词（例如“Labrador”“labour/labor”“labradorite”等），告诉我你想表达的语境或一句例句，我可以帮你定位正确拼写与含义。"]}
{"word":"labaria","summary":{"en":"*Labaria* is a rare historical Latin plural meaning “banners/standards,” related to *labarum*.","zh":"*Labaria* 是罕见的历史用语，源自拉丁语复数，意为“军旗/旗帜”，与 *labarum* 相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare; historical) A Latin plural form meaning “standards/banners,” especially referring to imperial or military flags; sometimes used in English writing when discussing Roman/Byzantine history (related to the singular *labarum*).","zh":"（罕见；历史语境）拉丁语复数形式，意为“军旗/旗帜/旌旗”，常见于讨论罗马或拜占庭历史的英文写作中；与单数 *labarum*（皇帝军旗）相关。"},"examples":[{"en":"Some historians use the Latin term *labaria* to refer to multiple imperial standards.","zh":"一些历史学家会用拉丁语术语 *labaria* 来指多面皇帝军旗。"},{"en":"The procession displayed crosses and *labaria* alongside other symbols of authority.","zh":"游行队伍展示了十字架和多面 *labaria*，以及其他权威象征。"}]}],"synonyms":["banners","standards","flags"],"phonetic":"/ləˈbɛriə/","extraExplanation":["*Labaria* 并不是现代英语里的常用词，更常见的是单数形式 *labarum*（与罗马皇帝君士坦丁相关的“基督字母”军旗）。在英文史学写作中偶尔会保留拉丁语复数来营造历史语感。","如果你是在词典、游戏、小说或名字里看到 *Labaria*，也可能是专有名词（人名/地名/作品名）的拼写；提供上下文我可以更准确判断。"]}
{"word":"labarum","summary":{"en":"A historical banner, especially Constantine’s Roman standard with a Christian symbol.","zh":"历史上的军旗；尤指君士坦丁的、带基督教标志的罗马军旗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic military standard (banner), especially the banner of the Roman emperor Constantine that bore a Christian symbol (often the Chi-Rho).","zh":"（历史）军旗、军用旗帜；尤指罗马皇帝君士坦丁使用、带有基督教标志（常见为“基督圣号”Chi-Rho）的军旗。"},"examples":[{"en":"In many history books, the labarum is shown with the Chi-Rho symbol at the top.","zh":"在许多历史书里，labarum 常被画成顶部带有 Chi-Rho 标志的军旗。"},{"en":"The museum displayed a reconstruction of the labarum used by Constantine’s army.","zh":"博物馆展出了一面据说用于君士坦丁军队的 labarum 复原旗。"}]}],"synonyms":["standard","banner","ensign","war flag"],"phonetic":"/ˈlæbərəm/","extraExplanation":["“Labarum”常出现在罗马史与基督教史的语境中。它与君士坦丁大帝（Constantine the Great）联系最紧密：据后世记载，他在关键战役前采用带有基督教符号的军旗，使其成为基督教在罗马帝国逐渐取得合法地位与影响力的象征之一。","发音与拼写：该词源自拉丁语，英语中属于较学术/历史用词，日常交流里不常见，更多见于历史写作、博物馆说明、宗教艺术与古代钱币/徽章讨论。"]}
{"word":"labarums","summary":{"en":"“Labarum” is an ancient Roman/Byzantine imperial military banner, often marked with the Christian Chi-Rho symbol.","zh":"“labarum”指古罗马/拜占庭皇帝使用的军旗，常带基督教“基罗”符号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a military standard (banner) used by the Roman emperor Constantine and later Byzantine emperors, typically bearing the Christian Chi-Rho symbol (☧).","zh":"（罗马皇帝君士坦丁及后来的拜占庭皇帝使用的）军旗/军标，常带有基督教的“基罗”（☧）符号。"},"examples":[{"en":"In the fourth century, Constantine marched under the labarum as a sign of Christian authority.","zh":"在四世纪，君士坦丁在“拉巴鲁姆军旗”之下行军，把它作为基督教权威的象征。"},{"en":"The museum displays a replica of a labarum with the Chi-Rho emblem.","zh":"博物馆展出了一面带有基罗标志的“拉巴鲁姆军旗”复制品。"}]}],"synonyms":["standard","banner","ensign"],"phonetic":"/ˈlæbərəm/","extraExplanation":["“labarum”来自拉丁语，常与君士坦丁大帝的故事连在一起：据传他在一场战役前看见异象/标记，随后把基督教符号放到军旗上，用作军队的号令与象征。","复数在学术写作里常见为“labara”，但现代英语里也有人用规则复数“labarums”。"]}
{"word":"labba","summary":{"en":"“labba” is not a standard English word; it’s usually a misspelling or a name/handle.","zh":"“labba”不是标准英语词；通常是拼写错误或名字/网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling or a name/handle (e.g., a username or brand). If you meant a different word, common possibilities are “lab” (laboratory), “Laba” (a name/place), or “labba” as an invented/baby-talk spelling of “labber”/“blabber.”","zh":"不是标准英语单词。最常见的情况是拼写错误，或作为名字/网名/品牌出现。如果你想查的是别的词，常见可能是 lab（实验室）、Laba（人名/地名），或把 blabber（喋喋不休）写成了类似“labba”的造词/口语拼法。"},"examples":[{"en":"I searched for “labba,” but it doesn’t appear in standard English dictionaries.","zh":"我查了“labba”，但它不在标准英语词典里。"},{"en":"Did you mean “lab” (short for laboratory)?","zh":"你是不是想说“lab”（laboratory 的缩写，实验室）？"}]}],"phonetic":"/ˈlæbə/","extraExplanation":["“labba”本身缺乏公认的英语词义与用法，所以需要上下文才能判断你想表达什么。","如果你是在聊天里看到的“labba”，它可能是：① 人名/昵称；② 品牌或产品名；③ 把某个词（如 blabber：喋喋不休）按发音随意拼出来的写法。","你可以把完整句子发我，或告诉我它出现的语境（比如社交媒体、歌曲、游戏、某种语言的借词），我就能更准确地解释。"]}
{"word":"labbella","summary":{"en":"“labbella” is usually a misspelling/variant of Italian “la bella” (“the beautiful woman”) or a proper name/brand.","zh":"“labbella”多为意大利语“la bella”（“美丽的女子”）的连写/误拼，或用作专有名称/品牌。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Not a standard English word. Most often it refers to the Italian phrase “la bella,” meaning “the beautiful (woman/girl),” and it may also appear as a name/brand (e.g., La Bella).","zh":"不是标准英语单词。最常见的是指意大利语短语“la bella”，意思是“美丽的女子/女孩”；也可能作为人名或品牌名出现（如 La Bella）。"},"examples":[{"en":"In the song title, “La Bella” means “the beautiful woman” in Italian.","zh":"在这首歌名里，“La Bella”在意大利语中意思是“美丽的女子”。"},{"en":"She bought La Bella guitar strings online.","zh":"她在网上买了 La Bella 的吉他弦。"}]}],"synonyms":["beautiful woman (meaning)","the beauty (meaning)"],"phonetic":"/lə ˈbɛlə/","extraExplanation":["“labbella”常见于把意大利语“la bella”连写或拼写误差；在英文语境里通常会分开写并大写为“La Bella”（尤其是作为标题、姓名或品牌）。","意大利语里“la”是阴性单数定冠词（相当于英文 the），“bella”是“美丽的”（阴性形式）。如果指男性，常见说法是“il bello”。"]}
{"word":"labber","summary":{"en":"A dialect word meaning thick mud, or to make something muddy.","zh":"方言词：指厚泥/烂泥；也可表示把东西弄得泥泞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, especially Scottish/Northern English) thick mud or sticky mire.","zh":"（方言，尤指苏格兰/英格兰北部）厚泥、烂泥、黏稠的泥浆。"},"examples":[{"en":"After the storm, the path was covered in labber.","zh":"暴风雨过后，小路上全是烂泥。"},{"en":"He wiped the labber off his boots at the door.","zh":"他在门口把靴子上的烂泥蹭掉。"}]},{"partOfSpeech":"v.","definition":{"en":"(dialect) to make something muddy; to splash or smear with mud.","zh":"（方言）把……弄得满是泥；用泥浆溅/抹脏。"},"examples":[{"en":"The cart wheels labbered the road as they passed.","zh":"马车轮子经过时把路面弄得泥泞不堪。"},{"en":"Try not to labber your clothes when you step off the trail.","zh":"你离开小路时尽量别把衣服弄得满是泥。"}]}],"synonyms":["mud","mire","sludge","splash","smear"],"phonetic":"/ˈlæbɚ/","extraExplanation":["“labber”在现代标准美式英语中非常少见，更多见于苏格兰或英格兰北部的方言/文学描写（常用来营造乡野、潮湿泥地的氛围）。","学习时要注意别和更常见的“blabber”（喋喋不休地说）混淆：两者拼写相近，但含义完全不同。","如果你本来想表达“实验室里的人”，标准说法通常是“lab worker / lab technician / researcher”；如果想说“劳动者”，用“laborer”。"]}
{"word":"labby","summary":{"en":"“Labby” most often means a Labrador retriever (informal). In some Scottish/Irish dialect use, it can also mean “thick-lipped.”","zh":"“labby”最常见指（非正式）拉布拉多犬。在部分苏格兰/爱尔兰方言中也可指“嘴唇厚的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A Labrador retriever; a “Lab.”","zh":"（非正式）拉布拉多寻回犬；“拉布拉多（Lab）”的昵称。"},"examples":[{"en":"Their labby loves swimming and fetching sticks.","zh":"他们家的拉布拉多特别爱游泳、爱叼树枝回来。"},{"en":"We’re thinking of adopting a labby because they’re usually friendly.","zh":"我们在考虑领养一只拉布拉多，因为它们通常很友好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scottish/Irish English, dialect) Having thick or prominent lips; thick-lipped.","zh":"（苏格兰/爱尔兰英语方言）嘴唇厚的；厚唇的。"},"examples":[{"en":"In old stories, he’s described as a labby lad with a loud laugh.","zh":"在一些老故事里，他被形容成一个厚嘴唇、笑声很响的小伙子。"},{"en":"The dialect word “labby” can mean “thick-lipped.”","zh":"方言词“labby”可以表示“嘴唇厚的”。"}]}],"synonyms":["Lab (for the dog)","Labrador","Labrador retriever"],"phonetic":"/ˈlæbi/","extraExplanation":["“labby”作为“拉布拉多犬”的说法，常见于口语，来自“Labrador（Lab）+ -y（昵称后缀）”，语气更亲昵、随意。","在苏格兰方言里，lab/labbe 可指“嘴唇”，因此 labby 有“厚唇的”这层意思；这种用法更偏地区性，在现代日常英语里不如“Labrador”的意思常见。"]}
{"word":"labdacism","summary":{"en":"Lambdacism is difficulty or abnormality in pronouncing the “L” sound.","zh":"Lambdacism 指对“L”音（/l/）的发音困难或异常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a speech disorder or difficulty involving the /l/ sound (for example, substituting another sound for “l,” or being unable to pronounce “l” clearly).","zh":"“L”音（/l/）发音方面的言语障碍或困难（例如把“l”读成别的音，或无法清晰发出“l”音）。"},"examples":[{"en":"The speech therapist noted lambdacism when the child tried to say words like “light” and “yellow.”","zh":"言语治疗师注意到孩子在读“light”“yellow”等词时出现了 lambdacism（/l/音发音困难）。"},{"en":"With practice, her lambdacism became much less noticeable.","zh":"经过练习，她的 lambdacism 变得不那么明显了。"}]}],"synonyms":["L-sound articulation disorder","difficulty pronouncing /l/"],"phonetic":"/ˈlæmdəˌsɪzəm/","extraExplanation":["这个词来自希腊字母 lambda（Λ/λ），因为它对应拉丁字母 L。lambdacism 常见于语音学、医学或语言治疗领域的书面语中，日常英语里更常说 “trouble pronouncing the L sound” 或 “an L sound articulation problem”。","有时也会被更宽泛地用来指“过度使用 L 音/含 L 的表达”，但现代用法里最常见的还是指 /l/ 的发音问题。"]}
{"word":"labdacismus","summary":{"en":"Labdacismus is difficulty producing the /l/ sound correctly.","zh":"Labdacismus 指“l”音发音困难或发不准的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a speech articulation issue in which the sound /l/ (the “l” sound) is produced incorrectly or replaced by another sound.","zh":"一种发音（构音）问题：/l/（英语字母“l”的音）发得不正确，或被其他音替代。"},"examples":[{"en":"The child showed labdacismus and often replaced /l/ with /w/ in words like “light.”","zh":"这个孩子有 labdacismus，常把“light”里的 /l/ 发成 /w/。"},{"en":"A speech-language therapist can assess labdacismus and design practice for clearer /l/ pronunciation.","zh":"语言治疗师可以评估 labdacismus，并设计练习来改善 /l/ 的发音清晰度。"}]}],"synonyms":["lambdacism","misarticulation of /l/","speech sound disorder (contextual)"],"phonetic":"/læbˈdæsɪzməs/","extraExplanation":["这个词源自希腊字母 lambda（Λ, λ），因为它对应的就是“l”音；在语言学/语音学与言语治疗的语境中更常见的拼写是 **lambdacism**（含 m）。","它通常用于较正式或专业的场合（如语音学、言语治疗、医学/语言学写作）；日常英语更常说“trouble pronouncing the /l/ sound（发不好 l 音）”。"]}
{"word":"labdanum","summary":{"en":"Labdanum is a fragrant resin from rockrose plants, widely used in perfumery and incense.","zh":"Labdanum 指岩蔷薇植物的芳香树脂，常用于香水与熏香。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant resin from certain rockrose (Cistus) plants, used in perfumes, incense, and sometimes traditional medicine","zh":"（岩蔷薇属植物分泌的）劳丹脂／岩蔷薇树脂；一种芳香树脂，用于香水、熏香，有时也用于传统草药"},"examples":[{"en":"Labdanum is a key note in many amber-style perfumes.","zh":"劳丹脂是许多琥珀调香水中的关键香调之一。"},{"en":"The candle has a warm, resinous smell—partly from labdanum.","zh":"这支蜡烛有温暖的树脂香，其中一部分来自劳丹脂。"}]}],"synonyms":["rockrose resin","gum labdanum"],"phonetic":"/ˈlæbdənəm/","extraExplanation":["“Labdanum”常出现在香水描述里，常被形容为温暖、树脂感、微甜、带一点皮革/烟熏感；它常用于构建“amber（琥珀调）”“oriental（东方调）”的厚实底香。","历史上在地中海地区（如西班牙、法国南部、北非）较常见；传统采集方式之一是用梳具或皮带从岩蔷薇叶片上刮取黏稠树脂。","不要与“laudanum（鸦片酊）”混淆：两者拼写相近但完全不同；labdanum是香料树脂，laudanum是历史上的含鸦片药剂。"]}
{"word":"labdanums","summary":{"en":"Labdanums = plural of labdanum: a fragrant resin from rockrose used mainly in perfumery and incense.","zh":"labdanums 是 labdanum 的复数：来自岩蔷薇的芳香树脂，主要用于香水与熏香。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Labdanums are aromatic, sticky resins (plural of labdanum) taken from rockrose plants (Cistus). They are used in perfumes, incense, and sometimes traditional remedies.","zh":"labdanums 是 labdanum 的复数，指从岩蔷薇（Cistus 属）植物上采集的芳香黏稠树脂。常用于香水、熏香，也见于一些传统疗法。"},"examples":[{"en":"The perfumer added labdanums to give the fragrance a warm, amber-like depth.","zh":"调香师加入 labdanums，让香气更温暖、更有琥珀般的厚度。"},{"en":"In old incense recipes, labdanums were valued for their rich, resinous smell.","zh":"在古老的熏香配方里，人们很看重 labdanums 那种浓郁的树脂香。"}]}],"synonyms":["labdanum","rockrose resin","gum labdanum"],"phonetic":"/ˈlæbdənəm/","extraExplanation":["labdanum（单数）多来自地中海地区的岩蔷薇。传统上可通过梳理山羊/绵羊毛（动物在灌木间穿行会沾到树脂）或直接刮取植物分泌物来收集，因此在香水里常带有“树脂感、琥珀感、皮革感”的联想。","词形提示：你输入的 labdanums 是复数形式；在香水原料表或配方讨论中，常用复数泛指“这类原料/多批次的劳丹脂”。"]}
{"word":"labefact","summary":{"en":"Labefact means to weaken or undermine something so it becomes unstable or less effective.","zh":"Labefact 指“使某物变弱或被削弱”，从而变得不稳定或不再有效。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to weaken, damage, or undermine (something), so it becomes less stable or effective","zh":"使（某物）变弱、受损或被削弱；动摇、破坏（稳定性或效力）"},"examples":[{"en":"The scandal labefacted public trust in the institution.","zh":"这起丑闻动摇了公众对该机构的信任。"},{"en":"Years of neglect labefacted the old bridge until it became unsafe.","zh":"多年的疏于维护使那座老桥逐渐受损，直到变得不安全。"},{"en":"Constant criticism can labefact a person’s confidence.","zh":"持续的批评可能会削弱一个人的自信。"}]}],"synonyms":["weaken","undermine","impair","shake","erode","sap"],"phonetic":"/ˌlæbəˈfækt/","extraExplanation":["这个词比较少见、偏书面/文艺（有时也被视为古体）。常见于严肃写作，表示“使动摇、使衰弱”。","词源来自拉丁语 *labefacere*：*labi*（滑倒、摇晃）+ *facere*（使、做），核心意象是“让某物开始摇晃、站不稳”。"]}
{"word":"labefactation","summary":{"en":"Labefactation means weakening or gradual collapse, especially in formal writing.","zh":"labefactation 指“衰弱或逐渐崩溃”，多用于正式/学术写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a weakening or gradual collapse; a state of becoming unstable or less strong (often used in formal or academic writing).","zh":"（力量、结构、制度等的）衰弱、松动或逐渐崩溃；变得不稳固的状态（多用于正式/学术语境）。"},"examples":[{"en":"The report warned of the labefactation of public trust after repeated scandals.","zh":"报告警告称，连续的丑闻会导致公众信任的衰弱。"},{"en":"Years of neglect led to the labefactation of the old bridge’s supports.","zh":"多年的疏于维护导致老桥支撑结构逐渐松动。"}]}],"synonyms":["weakening","deterioration","decline","destabilization","collapse"],"phonetic":"/ˌlæbəfækˈteɪʃən/","extraExplanation":["这个词非常少见，更常见的近义词是 weakening, deterioration, collapse。写作中若想显得更“学术”，可能会用到，但日常英语里几乎不用。","词源上来自拉丁语：labefacere（使……摇动、使……变弱），由 labare（摇晃）+ facere（做、使）构成。","相关词：labefaction（更常见的名词形式），labefy（动词：使衰弱/使动摇）。"]}
{"word":"labefaction","summary":{"en":"Labefaction means a gradual weakening or decline toward instability or collapse.","zh":"Labefaction 指逐渐变弱、走向不稳或崩溃的衰败过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of becoming weak, unstable, or close to collapse; gradual decay or decline","zh":"变得虚弱、不稳定或接近崩溃的过程；逐渐的衰败、衰落"},"examples":[{"en":"Years of neglect led to the labefaction of the old bridge.","zh":"多年的疏于维护导致那座老桥逐渐变得不稳。"},{"en":"The scandal caused the labefaction of public trust in the institution.","zh":"这场丑闻导致公众对该机构的信任逐渐瓦解。"}]}],"synonyms":["weakening","deterioration","decline","decay","disintegration"],"phonetic":"/ˌlæbəˈfækʃən/","extraExplanation":["这是一个较少见、偏书面/学术的词，常用于描述“结构或局势逐步失稳、走向崩塌”的过程（如建筑、制度、信任、经济等）。","词源来自拉丁语 labefacere（使摇晃、使动摇），由 labi（滑倒/摇晃）+ facere（做/使）构成，因此带有“被动摇、被削弱”的画面感。"]}
{"word":"labefied","summary":{"en":"“Labefied” means “became unstable or weakened,” often in a literary style.","zh":"“labefied”意为“变得不稳或衰弱（常见于文学/书面语）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Literary) became unstable, weakened, or likely to collapse; fell into ruin.","zh":"（文学用语）变得不稳定、衰弱或濒临崩溃；走向衰败。"},"examples":[{"en":"After years of corruption, the government had labefied and could no longer control the provinces.","zh":"多年腐败之后，政府已走向衰败，无法再控制各省。"},{"en":"Her confidence labefied when she kept hearing the same criticism.","zh":"当她不断听到同样的批评时，她的自信开始动摇。"}]},{"partOfSpeech":"v.","definition":{"en":"(Of a physical object or structure) became loose, shaky, or unsteady.","zh":"（指物体或结构）变得松动、摇晃、不牢固。"},"examples":[{"en":"The old bridge had labefied under constant floods and heavy traffic.","zh":"这座老桥在反复洪水和繁重车流下变得摇摇欲坠。"},{"en":"The ground seemed to labefy beneath their feet after the quake.","zh":"地震后，他们脚下的地面似乎变得松动不稳。"}]}],"synonyms":["weakened","collapsed","crumbled","deteriorated","fell apart"],"phonetic":"/ləˈbiːfaɪd/","extraExplanation":["“labefied”是动词“labefy”的过去式/过去分词，属于较少见的书面词，更常见的替换说法有：collapse, weaken, crumble, fall apart。","词源来自拉丁语词根，和“摇晃、失稳”有关，因此既可形容“政权/信心”等抽象事物的动摇，也可形容桥梁、地基等实体结构的松动。"]}
{"word":"labefy","summary":{"en":"“Labefy” is not a standard English word; it is likely a misspelling (often of “label”).","zh":"“labefy”不是标准英语单词；很可能是拼写错误（常见想写的是“label”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “label” (to tag or name something) or “labify” (rare; to turn something into a lab-style setting).","zh":"不是标准英语单词，更可能是拼写错误。常见可能是想写“label”（给……贴标签/命名），或少见的“labify”（把……变成类似实验室的形式/风格）。"},"examples":[{"en":"I can’t find “labefy” in a dictionary—did you mean “label” this file?","zh":"我在词典里找不到“labefy”——你是不是想说给这个文件“label（贴标签）”？"},{"en":"Please label the jars so we know what’s inside.","zh":"请把这些罐子贴上标签，这样我们就知道里面是什么。"}]}],"extraExplanation":["“labefy”本身没有公认的词源或固定用法，因此最好的做法是确认你想表达的意思或提供句子语境。","如果你想表达“给……贴标签/标注/命名”，标准用词是“label”。如果你想表达“把……实验室化/用实验室方式处理”，可以改写为“set up a lab for… / make it more like a lab”，因为“labify”非常少见。"]}
{"word":"labefying","summary":{"en":"“Labefying” means weakening or destabilizing something so it may fail or collapse (often figuratively).","zh":"“labefying”指使某事物变得不稳或被削弱，甚至可能崩溃（常用于比喻）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “labefy”) causing something to become unstable, weak, or likely to collapse; undermining.","zh":"（“labefy”的现在分词）使……变得不稳、脆弱、可能崩溃；削弱、动摇。"},"examples":[{"en":"Years of corruption were labefying the public’s trust in the government.","zh":"多年的腐败正在动摇公众对政府的信任。"},{"en":"The repeated shocks were labefying the old bridge’s structure.","zh":"反复的冲击正在削弱那座老桥的结构。"},{"en":"Rumors can be labefying to a team’s confidence.","zh":"谣言会削弱团队的信心。"}]}],"synonyms":["destabilizing","undermining","weakening","shaking","unsettling"],"phonetic":"/ləˈbɛf.aɪ.ɪŋ/","extraExplanation":["“labefying / labefy”是比较罕见、偏书面甚至略带古典色彩的词，常见于正式写作或文学语境，多用于比喻（如“动摇信念、削弱权威”）。","词源来自拉丁语 *labefacere*（使摇晃、使倒塌）。","注意拼写：很多人看到“labefying”会以为是“liquefying（使液化）”。如果你想表达“融化/液化”，更常用的是 **liquefying**。"]}
{"word":"label","summary":{"en":"Label means a tag or sticker with information, or a descriptive name/category; it can also mean to attach such a tag or to categorize someone.","zh":"label 指（信息）标签/标识，也指对人或事物的“称呼/分类（贴标签）”；作动词可表示贴标签或给人定性归类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of paper, tag, or sticker attached to something to show its name, contents, owner, price, or instructions.","zh":"（贴在物品上的）标签；标牌；（写明名称、内容、归属、价格或说明的）标识。"},"examples":[{"en":"Please read the label before you use the medicine.","zh":"用药前请先阅读标签说明。"},{"en":"The label on the box says “Fragile.”","zh":"盒子上的标签写着“易碎”。"},{"en":"She wrote her name on a label and stuck it on the folder.","zh":"她把名字写在标签上，然后贴到文件夹上。"}]},{"partOfSpeech":"n.","definition":{"en":"A word or phrase used to describe a person, group, or thing, especially in a way that categorizes them (sometimes unfairly).","zh":"（用于给人或事物分类的）称呼；标签（有时带有刻板印象或不公平）。"},"examples":[{"en":"Don’t put a label on people too quickly.","zh":"不要太快给别人贴标签。"},{"en":"He disliked the label “troublemaker.”","zh":"他不喜欢“麻烦制造者”这个标签。"}]},{"partOfSpeech":"vt.","definition":{"en":"To attach a label to something; to write or stick a name or information on it.","zh":"给……贴标签；给……标注名称或信息。"},"examples":[{"en":"Label the jars so you know what’s inside.","zh":"把罐子贴上标签，这样你就知道里面是什么。"},{"en":"All the files are labeled by date.","zh":"所有文件都按日期标注好了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To describe someone or something in a particular way, often simplifying them into a category.","zh":"（常带“贴标签”的意味）把……归类；给……定性（可能过于简化）。"},"examples":[{"en":"It’s unfair to label him as lazy based on one bad day.","zh":"只因为一天状态不好就给他贴“懒”的标签是不公平的。"}]}],"synonyms":["tag","sticker","mark","brand","classify","categorize"],"phonetic":"/ˈleɪbəl/","extraExplanation":["“label”既可以指实物的“标签/标牌”，也常用于社会语境中表示“给人贴标签”。后者在英语里常带有“把人简化成某种类别、可能不够公正”的语气，所以在正式或敏感话题中要注意使用场合。","常见搭配：nutrition label（营养成分表）、price label（价签）、shipping label（快递/运单标签）、label maker（标签机）、label someone as...（把某人说成/定性为……）。"]}
{"word":"labeled","summary":{"en":"“Labeled” means “marked with a label,” and it’s also the past form of “label,” meaning “to put a label on” or “to categorize/describe (sometimes unfairly).”","zh":"“labeled”既表示“贴有标签的/已标注的”，也可作动词“label”的过去式，意为“贴标签”或“给……下定义/归类（有时不公）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Marked with a label (a tag or sticker) that gives information such as a name, contents, price, or instructions.","zh":"贴有标签的；已标注的（标签可提供名称、内容、价格或说明等信息）。"},"examples":[{"en":"Make sure every bottle is clearly labeled with the date.","zh":"确保每个瓶子都清楚地标上日期。"},{"en":"The labeled boxes make packing and unpacking much easier.","zh":"标好标签的箱子让打包和拆箱容易得多。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “label”: to attach a label to something or to describe/categorize someone or something (often in a simplified or unfair way).","zh":"“label”的过去式/过去分词：给某物贴标签；或给某人/某事下定义、归类（有时过于简单甚至不公平）。"},"examples":[{"en":"The chef labeled each jar before putting it on the shelf.","zh":"厨师把每个罐子贴好标签后才放到架子上。"},{"en":"She was quickly labeled as “difficult,” even though she just asked questions.","zh":"尽管她只是提问，她却很快被贴上“难搞”的标签。"},{"en":"The report labeled the behavior as a safety risk.","zh":"报告将这种行为定性为安全风险。"}]}],"synonyms":["tagged","marked","identified","classified","branded"],"phonetic":"/ˈleɪbəld/","extraExplanation":["在谈论人时，“be labeled (as) …”常带有主观色彩，暗示别人给你贴标签（可能不公正）。更中性的说法可以用“be described as … / be considered …”。"]}
{"word":"labeler","summary":{"en":"A labeler is someone or something that puts labels on items, or assigns categories/names (including data labeling).","zh":"labeler 指给物品贴标签的人或设备，也可指给人事物定性分类（包括数据标注）的人员或工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or device that puts labels on things","zh":"给物品贴标签的人；贴标机（贴标签的设备）"},"examples":[{"en":"The labeler prints and sticks a barcode on each box.","zh":"贴标机会在每个箱子上打印并贴上条形码。"},{"en":"We hired a labeler to tag all the files in the archive.","zh":"我们雇了一位人员给档案库里的所有文件贴上标签。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or tool that assigns names or categories to people or things (often in a judgmental way)","zh":"给人或事物“贴标签”的人或工具（常带评价、定性甚至偏见）"},"examples":[{"en":"Try not to be a labeler—listen to people before you judge them.","zh":"尽量别当“贴标签的人”——在评判别人之前先倾听。"},{"en":"Online comments can turn anyone into a quick labeler.","zh":"网络评论容易让人变成快速给别人贴标签的人。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who marks or annotates data with categories (e.g., for machine learning)","zh":"数据标注员（给数据打标签、做分类标注的人，例如用于机器学习）"},"examples":[{"en":"The dataset was created by trained labelers.","zh":"这套数据集由受过训练的数据标注员制作。"},{"en":"Each labeler checks the images and selects the correct category.","zh":"每位标注员查看图片并选择正确的类别。"}]}],"synonyms":["tagger","marker","labeling machine","annotator"],"phonetic":"/ˈleɪbəlɚ/","extraExplanation":["拼写提示：美式英语常写作 labeler；英式英语更常见 labeller。两者发音与含义相同。","在机器学习语境中，labeler 常指“数据标注员/标注工具”，与 label（标签）、labeling（标注/贴标签）一起高频出现。"]}
{"word":"labelers","summary":{"en":"“Labelers” usually means people who attach/print labels, or machines that make/apply labels.","zh":"“Labelers”通常指贴/印标签的工作人员，或制作/贴附标签的机器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to attach or print labels on items (for example, in a factory, warehouse, or lab).","zh":"贴标签的人；负责给物品贴/印标签的工作人员（如工厂、仓库或实验室）。"},"examples":[{"en":"The labelers checked every box before it went onto the truck.","zh":"贴标员在箱子装上卡车前会逐一检查。"},{"en":"In the food plant, labelers must follow strict safety rules.","zh":"在食品工厂里，贴标员必须遵守严格的安全规定。"}]},{"partOfSpeech":"n.","definition":{"en":"Machines or tools that make or apply labels (often called label makers or labeling machines).","zh":"打标签/贴标签的机器或工具（常见说法：label maker / labeling machine）。"},"examples":[{"en":"We bought new labelers to print barcode labels faster.","zh":"我们买了新的贴标机来更快打印条形码标签。"},{"en":"Handheld labelers are useful for organizing cables and drawers.","zh":"手持式标签机很适合整理电线和抽屉。"}]}],"synonyms":["labeling staff","taggers","label makers","labeling machines"],"phonetic":"/ˈleɪbəlɚz/","extraExplanation":["“labeler”是美式常见拼写；英式有时写作“labeller”。两者意思相同。","在职场语境里，“labelers”既可能指“贴标员工”，也可能指“贴标设备”；通常要靠上下文判断（如提到bought/installed多半是设备，提到trained/checked多半是人员）。"]}
{"word":"labeling","summary":{"en":"Labeling means putting labels on things for identification, or (more critically) categorizing people/things in a simplified way.","zh":"Labeling 指给事物做标注以便识别；也可指（常带批评意味地）用简化方式给人或事物归类、贴标签。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of attaching a label (a name, title, or tag) to something for identification, description, or organization.","zh":"给某物贴标签（名称、标题或标记）的行为或过程，用于识别、描述或整理。"},"examples":[{"en":"Clear labeling helps customers find the right product quickly.","zh":"清晰的标签标注能帮助顾客更快找到合适的产品。"},{"en":"The lab requires proper labeling of all chemical containers.","zh":"实验室要求对所有化学容器进行正确标注。"}]},{"partOfSpeech":"n.","definition":{"en":"The practice of classifying people or things by giving them a simplified name or category, often in a way that can be unfair or inaccurate.","zh":"用简化的称呼或类别给人或事物归类的做法，常常可能不公平或不准确。"},"examples":[{"en":"Avoid labeling others based on stereotypes.","zh":"避免根据刻板印象给别人贴标签。"},{"en":"Labeling a student as “lazy” can harm their confidence.","zh":"把学生贴上“懒惰”的标签会伤害他们的自信。"}]}],"synonyms":["tagging","marking","identifying","classification","categorizing"],"phonetic":"/ˈleɪbəlɪŋ/","extraExplanation":["“labeling”既可以指中性的“标注/贴标签”（如商品、文件、化学品），也常用于社会语境里的“给人贴标签”。后者通常带有负面含义，强调过度简化、忽视个体差异。","相关搭配：food labeling（食品标签/成分标注）、clear labeling（清晰标注）、mislabeling（贴错标签/误标）、label someone as...（把某人称为/贴上……的标签）。"]}
{"word":"labella","summary":{"en":"Labella is the plural of labellum, most commonly referring to the lip-like petal of an orchid.","zh":"labella 是 labellum 的复数，最常指兰花的唇瓣（唇状花瓣）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The lip-like petal of an orchid (plural form of “labellum”); the showy part that often attracts pollinators.","zh":"兰花的“唇瓣/唇瓣状花瓣”（为 labellum 的复数）；通常最显眼，用来吸引传粉者的部分。"},"examples":[{"en":"Many orchids have brightly colored labella that guide insects to the flower’s center.","zh":"许多兰花有颜色鲜艳的唇瓣，引导昆虫到花的中心。"},{"en":"The labella of this species are long and narrow compared with its other petals.","zh":"这种兰花的唇瓣比其他花瓣更长、更窄。"}]},{"partOfSpeech":"n.","definition":{"en":"Lip-like structures in biology/anatomy (plural of “labellum”), used for naming small “little-lip” parts in some organisms.","zh":"生物学/解剖学中“唇状小结构”（为 labellum 的复数），用来指某些生物体上类似“小唇”的部位。"},"examples":[{"en":"Under the microscope, the researchers compared the shapes of the labella across samples.","zh":"在显微镜下，研究人员比较了不同样本中这些唇状结构的形状。"}]}],"synonyms":["labellum","orchid lip","lip (of an orchid)"],"phonetic":"/ləˈbɛlə/","extraExplanation":["“labella”源自拉丁语“labellum”（意为“小嘴唇/小唇”），在植物学里最常见于兰科花的结构名称。很多入门资料会直接把它解释为“orchid lip（兰花的唇瓣）”。","在英语里它通常被当作“labellum”的复数使用；如果你想表达单数，一般写“labellum”。","大小写也会影响含义：如果你指人名/品牌名（如 La Bella 等），那就不是这个生物学词义了。"]}
{"word":"labellate","summary":{"en":"Labellate means “having a lip-like part (a labellum),” mainly used in botany, especially for orchids.","zh":"labellate 指“具唇瓣/唇状结构的”，主要用于植物学（尤其描述兰花）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a labellum (a lip-like part), especially describing an orchid flower with a prominent “lip.”","zh":"（植物学）具唇瓣的；尤指兰花等花朵具有明显“唇”（唇瓣）结构的。"},"examples":[{"en":"Many orchids are labellate, with a large lip that helps attract pollinators.","zh":"许多兰花是具唇瓣的，它们宽大的“唇”有助于吸引传粉者。"},{"en":"The diagram shows a labellate flower, highlighting the lip-like petal.","zh":"这张示意图展示了具唇瓣的花，并标出了像嘴唇一样的花瓣部分。"}]}],"synonyms":["lipped (botany)","labellum-bearing"],"phonetic":"/ləˈbɛl.eɪt/","extraExplanation":["“labellate”主要出现在植物学/园艺语境中，来自拉丁语 labellum（“小唇、小标签”之意），在兰科植物里指“唇瓣/唇形结构”。日常英语里很少用它。","注意不要和常见动词/名词“label（贴标签；标签）”混淆：两者拼写相近，但“labellate”通常不是“给……贴标签”的意思。若你想表达“贴标签”，更自然的词是 label (v.)."]}
{"word":"labelled","summary":{"en":"“Labelled” means “marked with a label” or “described/classified (often unfairly)”; it’s the British spelling of “labeled.”","zh":"“labelled”意为“贴有标签的/被标注的”，也可指“（常带偏见地）给……贴标签、归类”；是美式“labeled”的英式拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “label”) to attach a label to something, or to describe/classify someone or something in a particular way.","zh":"（“label”的过去式/过去分词）给……贴标签；（比喻）把……归类/称作……"},"examples":[{"en":"The boxes were labelled “Fragile.”","zh":"这些箱子被贴上了“易碎”的标签。"},{"en":"He was wrongly labelled as lazy.","zh":"他被错误地贴上了“懒惰”的标签。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a label; marked with a name, tag, or information.","zh":"有标签的；贴有标识/名称/信息的"},"examples":[{"en":"Keep all labelled containers out of children’s reach.","zh":"把所有贴了标签的容器放在孩子够不到的地方。"},{"en":"The labelled diagram makes the process easier to understand.","zh":"带标注的图示让这个过程更容易理解。"}]}],"synonyms":["tagged","marked","named","classified","branded"],"phonetic":"/ˈleɪbəld/","extraExplanation":["“labelled”是英式拼写；美式拼写更常见的是“labeled”。两者意思相同。","在比喻用法中，“labelled”常带有评价色彩，可能暗示刻板印象或不公平的归类（如：label someone as…）。"]}
{"word":"labeller","summary":{"en":"A labeller is a person or a machine that puts labels on items.","zh":"labeller指给物品贴标签的人或贴标设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to put labels on things, or a machine/tool that attaches or prints labels","zh":"给物品贴标签的人；或贴/打标签的机器、工具"},"examples":[{"en":"The labeller checks each bottle before it goes into the box.","zh":"贴标员会在每个瓶子装箱前检查一遍。"},{"en":"We bought an automatic labeller for the new packaging line.","zh":"我们为新的包装生产线买了一台自动贴标机。"}]}],"synonyms":["labeler","tagger","labeling machine","label printer"],"phonetic":"/ˈleɪbəlɚ/","extraExplanation":["“labeller”是英式拼写；美式更常写作“labeler”。两者意思相同，发音也基本一致。","在制造业语境中，labeller常指“贴标机/贴标设备”；在日常语境中更常指“贴标签的人”。"]}
{"word":"labellers","summary":{"en":"“Labellers” means people who label things; it can also mean data annotators who label information for AI or research.","zh":"“labellers”指给物品贴标签的人；也可指为 AI 或研究进行数据标注的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who attach labels (tags) to items, such as products, files, or containers.","zh":"给物品贴标签/加标记的人（如商品、文件或容器）。"},"examples":[{"en":"The labellers put price stickers on every box before shipping.","zh":"贴标员在发货前给每个箱子都贴上价格标签。"},{"en":"We hired temporary labellers to organize the archive.","zh":"我们雇了临时贴标人员来整理档案。"}]},{"partOfSpeech":"n.","definition":{"en":"People who add labels to data (for example, marking photos or text) so that a computer system can learn from it.","zh":"数据标注人员（例如给图片或文本加标签，供计算机系统学习使用）。"},"examples":[{"en":"The company trained labellers to tag images for the AI model.","zh":"公司培训标注员为 AI 模型给图片打标签。"},{"en":"Good labellers follow clear rules to keep the labels consistent.","zh":"优秀的标注员会遵循清晰的规则，让标签保持一致。"}]}],"synonyms":["labelers","taggers","annotators","data labelers"],"phonetic":"/ˈleɪbəlɚz/","extraExplanation":["“labellers”是英式/加式拼写；美式更常写作“labelers”。两者意思相同，只是拼写习惯不同。"]}
{"word":"labelling","summary":{"en":"Labelling means putting labels on things or categorizing people/things by a name—sometimes unfairly.","zh":"Labelling 指给物品贴标签，或用某种称呼给人/事归类（有时带不公平的“贴标签”意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of putting labels on something (for example, products, files, or samples)","zh":"贴标签；给……加标签的行为或过程（如商品、文件或样本）"},"examples":[{"en":"Clear labelling helps customers find the right product quickly.","zh":"清晰的标签能帮助顾客更快找到合适的商品。"},{"en":"The labelling on this bottle includes allergy information.","zh":"这个瓶子上的标签包含过敏信息。"},{"en":"We improved labelling in the lab to avoid mixing up samples.","zh":"我们改进了实验室的标记方式，以避免样本混淆。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “label”) giving something a name or category, often in a judging way","zh":"（label 的现在分词）给某人/某事贴上某种称呼或归类，常带评判意味"},"examples":[{"en":"Avoid labelling people as “lazy” based on one mistake.","zh":"不要因为一次错误就给人贴上“懒惰”的标签。"},{"en":"The media kept labelling him a hero, but he disagreed.","zh":"媒体不断给他贴“英雄”的标签，但他并不认同。"}]}],"synonyms":["labeling","tagging","marking","classification","categorizing"],"phonetic":"/ˈleɪbəlɪŋ/","extraExplanation":["“labelling”是英式拼写；美式更常写作“labeling”。两者意思相同。","在商业与法规语境中，labelling 常指包装信息（成分、过敏原、产地、使用方法等）的标注；在社会语境中也常指“给人贴标签”的行为，可能带有刻板印象或不公平判断。"]}
{"word":"labelloid","summary":{"en":"Labelloid means “labellum-like,” used mainly in botanical descriptions (especially orchids).","zh":"Labelloid 意为“唇瓣状/类似唇瓣的”，主要用于植物学（尤指兰花）形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In botany (especially orchid descriptions), resembling a labellum (the specialized “lip” petal) in shape or appearance.","zh":"（植物学，尤指兰花形态描述中）呈“唇瓣”（labellum，特化的“唇”状花瓣）形的；类似唇瓣的。"},"examples":[{"en":"The orchid has a labelloid petal that guides insects toward the nectar.","zh":"这种兰花有一片唇瓣状的花瓣，引导昆虫靠近花蜜。"},{"en":"Under the microscope, the structure looks labelloid rather than leaf-like.","zh":"在显微镜下，这个结构看起来更像唇瓣状，而不是叶片状。"}]}],"synonyms":["labellum-like","lip-like (in botanical context)"],"phonetic":"/ləˈbɛlɔɪd/","extraExplanation":["该词较为少见，多见于植物分类或形态学描述。labellum 指兰科花中最显著的“唇瓣”（常用于吸引/引导传粉者），-oid 表示“……状/类似……”。因此 labelloid 通常表示“像唇瓣那样的形状或外观”。"]}
{"word":"labellum","summary":{"en":"A labellum is a lip-like structure, most commonly the specialized “lip” petal of an orchid.","zh":"labellum 指“唇状结构”，最常见的是兰花的特化花瓣——唇瓣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) The specialized petal of an orchid (the “lip”), often shaped and colored to attract pollinators.","zh":"（植物学）兰花的特化花瓣（“唇瓣”），常因形状与颜色而吸引传粉者。"},"examples":[{"en":"In many orchids, the labellum is the most colorful part of the flower.","zh":"在许多兰花中，唇瓣是花朵里最鲜艳的部分。"},{"en":"The bee landed on the labellum and brushed against the pollen.","zh":"蜜蜂落在唇瓣上，并擦到花粉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology) A lip- or tongue-like structure in some animals (especially insects), used in feeding or guiding food.","zh":"（动物学）某些动物（尤指昆虫）的唇状或舌状结构，用于取食或引导食物。"},"examples":[{"en":"Under a microscope, the insect’s labellum looks like a soft pad for feeding.","zh":"在显微镜下，这种昆虫的唇状结构看起来像柔软的取食垫。"}]}],"synonyms":["lip (orchid)","orchid lip","labium (related term)"],"phonetic":"/ləˈbɛləm/","extraExplanation":["词源：来自拉丁语 *labellum*，是 *labrum*（“嘴唇”）的指小形式，字面意思可理解为“（小）嘴唇”。因此在植物学里指像“唇”一样的花瓣，在动物学里也指类似“唇/舌”的结构。","使用场景提示：这个词多见于植物学、昆虫学等学术或科普语境；日常英语里更常说 *orchid lip*（兰花的“唇”）。"]}
{"word":"labels","summary":{"en":"Labels can mean physical tags with information, the descriptive words used for people/things, or the act of tagging/marking (sometimes unfairly).","zh":"labels 可指实物标签及其文字信息，也可指对人/事的称谓“标签”，或“贴标签/标注”（有时带不公平的简化意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pieces of paper, stickers, or tags that show information such as a name, category, or instructions; also the words on them.","zh":"（纸、贴纸或吊牌等）标签；也指标签上的文字信息（如名称、分类、说明等）。"},"examples":[{"en":"Please read the label on the bottle before you use it.","zh":"使用前请先读一下瓶子上的标签。"},{"en":"The labels on these files help me find things quickly.","zh":"这些文件上的标签能帮我快速找到需要的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"A word or phrase used to describe someone or something, often in a quick or simplified way.","zh":"（对人或事物的）称谓；标签化的说法（常带简化甚至偏见的意味）。"},"examples":[{"en":"Don’t put labels on people without knowing their story.","zh":"不了解别人的经历，就不要随便给人贴标签。"},{"en":"He dislikes the label of “genius” because it creates pressure.","zh":"他不喜欢“天才”这个标签，因为会带来压力。"}]},{"partOfSpeech":"vt.","definition":{"en":"To attach a label to something; to mark it with information or a name.","zh":"给……贴标签；给……标注信息或名称。"},"examples":[{"en":"Label each box with its contents before you move.","zh":"搬家前把每个箱子的内容都标注清楚。"},{"en":"The teacher labeled the diagrams clearly.","zh":"老师把图示标注得很清楚。"}]},{"partOfSpeech":"vt.","definition":{"en":"To describe someone or something in a certain way, especially unfairly or too simply.","zh":"（尤指不公平或过于简单地）给……贴标签；把……定性。"},"examples":[{"en":"It’s not fair to label her as “lazy” after one bad day.","zh":"只因为一天状态不好就给她贴上“懒”的标签，这不公平。"},{"en":"The media sometimes labels groups in harmful ways.","zh":"媒体有时会用有害的方式给群体贴标签。"}]}],"synonyms":["tags","stickers","name tags","markings","categories"],"phonetic":"/ˈleɪbəlz/","extraExplanation":["“Label”既可以指实物标签（食品配料表、药品说明等），也常用于社会语境中的“贴标签”。后者在中文里常说“标签化”，强调用一个词把复杂的人简化，可能带来偏见。","常见搭配：nutrition label（营养标签）、shipping label（快递面单）、warning label（警示标签）、name label（姓名贴）、label maker（标签机）、label someone as…（把某人称为……/贴上……标签）。","文化语境中，“labels”有时也指身份或类别（如性别、音乐风格、政治立场）。在较敏感话题里，英语里常出现“no labels”来表达“不想被归类/不想被定义”。"]}
{"word":"labia","summary":{"en":"Labia are the folds of skin around the opening of the vulva; it’s also the plural of labium in anatomy.","zh":"Labia 指女性外阴阴道口周围的皮肤褶皱（阴唇）；也可作解剖学术语 labium 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the two folds of skin around the opening of the vulva (female external genital area); usually refers to the labia majora and labia minora","zh":"（女性外阴）阴唇：围绕阴道口的两层皮肤褶皱，通常指大阴唇和小阴唇"},"examples":[{"en":"During the exam, the doctor checked the labia for swelling or irritation.","zh":"在检查中，医生查看阴唇是否有肿胀或刺激。"},{"en":"The labia vary in size and shape from person to person, which is normal.","zh":"阴唇的大小和形状因人而异，这是正常的。"}]},{"partOfSpeech":"n.","definition":{"en":"plural form of labium (a lip-like structure in anatomy, including in insects and plants)","zh":"labium 的复数：指解剖学中“唇状结构”（也可用于昆虫或植物等语境）"},"examples":[{"en":"In insects, the labia help form the mouthparts.","zh":"在昆虫中，labia（唇状结构）有助于构成口器。"},{"en":"The diagram labels the labium and other parts of the insect’s head.","zh":"图示标出了 labium 以及昆虫头部的其他结构。"}]}],"synonyms":["labium (singular)","labia majora","labia minora"],"phonetic":"/ˈleɪbiə/","extraExplanation":["“Labia”是拉丁语来源的复数形式，单数是“labium”。在日常英语里，“labia”最常用于医学/健康教育语境，指外阴的阴唇。","在正式写作或医疗沟通中，用“labia majora（大阴唇）/ labia minora（小阴唇）”更具体；口语里也有人说“lips”，但在医疗场合通常用“labia”更准确、也更中性。"]}
{"word":"labial","summary":{"en":"Labial means “related to the lips,” and in linguistics it describes sounds made with the lips; in medicine it can also refer to the labia.","zh":"labial 表示“与嘴唇有关的”；在语言学中指“用嘴唇发音的唇音”；在医学中也可指“与阴唇有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the lips.","zh":"与嘴唇有关的；唇部的。"},"examples":[{"en":"Lipstick is applied to the labial area.","zh":"口红涂在唇部区域。"},{"en":"Some cold sores appear on the labial skin.","zh":"有些唇疱疹会出现在唇部皮肤上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Made with the lips; describing sounds such as /p/, /b/, and /m/.","zh":"（语言学）用嘴唇发音的；指/p/、/b/、/m/等唇音。"},"examples":[{"en":"English /p/ and /b/ are labial sounds.","zh":"英语里的/p/和/b/是唇音。"},{"en":"Try to close your lips to produce a labial consonant.","zh":"试着合上嘴唇来发出一个唇辅音。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Of or relating to the labia (the folds of skin around the vaginal opening).","zh":"（解剖/医学）与阴唇有关的。"},"examples":[{"en":"The doctor asked about labial discomfort.","zh":"医生询问是否有阴唇不适。"},{"en":"Labial swelling can have different causes.","zh":"阴唇肿胀可能有不同原因。"}]}],"synonyms":["lip-related","labial (speech: bilabial, labiodental)"],"phonetic":"/ˈleɪbiəl/","extraExplanation":["在语言学里，labial 常出现在“发音部位（place of articulation）”的讨论中。更细的分类还有 bilabial（双唇音，如 /p b m/）和 labiodental（唇齿音，如 /f v/，下唇接触上齿）。","在医学语境中，labial 可能指“唇部”也可能指“阴唇相关”，具体要看上下文；正式或就医交流中使用较中性、常见。"]}
{"word":"labialisation","summary":{"en":"Labialisation is the process of adding lip rounding to a sound in speech.","zh":"Labialisation 指在发音时给某个音添加圆唇等唇部特征的过程（唇化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In linguistics/phonetics, the addition of lip rounding (a “labial” quality) to a sound, often as a secondary articulation.","zh":"（语言学/语音学）给某个语音增加圆唇等“唇音化（labial）”特征的过程，常见为一种次要调音。"},"examples":[{"en":"In some languages, labialisation changes how a consonant sounds by adding lip rounding.","zh":"在一些语言中，唇化会通过增加圆唇让辅音的听感发生变化。"},{"en":"The /k/ in certain contexts may show labialisation, sounding closer to /kʷ/.","zh":"在某些语境里，/k/ 可能出现唇化，听起来更接近 /kʷ/。"}]}],"synonyms":["labialization","lip rounding"],"phonetic":"/ˌleɪbiələˈzeɪʃən/","extraExplanation":["拼写提示：labialisation 是英式拼写；美式更常写作 labialization，但含义相同。","常见记号：语音学里常用上标“ʷ”表示唇化，如 kʷ、tʷ（表示在主要发音之外还带有圆唇）。","它与“labial（双唇音/唇的）”相关，但唇化不一定把声音变成真正的双唇音；更多是“加上圆唇这层特征”。"]}
{"word":"labialise","summary":{"en":"Labialise means to make a speech sound produced with lip rounding or added lip action (a ‘w-like’ quality).","zh":"labialise 指让某个语音在发音时带有圆唇或更多用唇的动作（常呈“w”般的色彩）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Phonetics) To pronounce a sound with the lips rounded or with added lip involvement, often making the sound “w-like.”","zh":"（语音学）使某个音带有唇化特征；即在发音时加入圆唇或更多用唇的动作，常带有类似“w”的色彩。"},"examples":[{"en":"In some languages, /k/ can be labialised, sounding closer to /kw/.","zh":"在一些语言里，/k/ 可能会发生唇化，听起来更接近 /kw/。"},{"en":"The teacher asked students to labialise the consonant slightly by rounding the lips.","zh":"老师让学生稍微把这个辅音唇化一下，也就是把嘴唇圆起来。"}]}],"synonyms":["labialize","round (in phonetics)"],"phonetic":"/ˈleɪbiəˌlaɪz/","extraExplanation":["“labialise”是英式拼写；美式更常见的是“labialize”。两者意思相同。","唇化常用于描述一些辅音（如[k], [g]）在某些语境中带有“圆唇/带[w]色彩”的变化；在国际音标（IPA）里常用上标小[w]来表示，如[kʷ]。"]}
{"word":"labialised","summary":{"en":"Labialised means a sound is produced with added lip rounding; it is also the past form of “labialize.”","zh":"labialised 指语音发出时带有圆唇/唇化；也可作 labialize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Pronounced with lip rounding or with the lips brought closer together while making a sound.","zh":"（语音学）发音时伴随“圆唇/唇化”，即在发音同时把嘴唇变圆或收拢。"},"examples":[{"en":"In some accents, the /w/ sound is strongly labialised, with clear lip rounding.","zh":"在一些口音中，/w/ 的唇化很明显，会有清楚的圆唇动作。"},{"en":"The consonant may be labialised before back vowels like /u/.","zh":"这个辅音在 /u/ 这类后元音前可能会出现唇化。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of labialize: to add lip rounding to a speech sound (or to make something more ‘labial’).","zh":"labialize 的过去式/过去分词：使某个语音带上圆唇（或使之更具“唇音”特征）。"},"examples":[{"en":"The speaker labialised the consonant slightly during rapid speech.","zh":"说话者在快速讲话时让这个辅音略微唇化了。"},{"en":"Over time, the sound became labialised in that dialect.","zh":"随着时间推移，这个音在那种方言里变成了唇化音。"}]}],"synonyms":["labialized","rounded (phonetics)","with lip rounding"],"phonetic":"ˈleɪbiəˌlaɪzd","extraExplanation":["“labialised”是英式拼写；美式更常写作“labialized”。两者意思相同。","语音学里常用符号表示唇化，例如 [kʷ] 表示“带唇化的 k 音”，意思是发 [k] 的同时有一点像 [w] 那样的圆唇动作。"]}
{"word":"labialising","summary":{"en":"Labialising means adding lip rounding to a speech sound (or describing a sound with that rounded-lip quality).","zh":"Labialising 指给语音加上圆唇特征（或形容某个音带圆唇色彩/唇化）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(linguistics/phonetics) Adding lip rounding to a speech sound; making a consonant or vowel pronounced with rounded lips.","zh":"（语言学/语音学）给语音加上“圆唇”特征；使某个辅音或元音在发音时带有嘴唇圆拢。"},"examples":[{"en":"In some accents, speakers may be labialising the /k/ sound before back vowels.","zh":"在某些口音中，说话者可能会在后元音前把 /k/ 发成带圆唇色彩的音（进行唇化）。"},{"en":"The transcription shows a labialising effect, marked with a small superscript “w”.","zh":"这个音标转写显示了唇化效果，用一个小的上标“w”来标记。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a sound or articulation that involves lip rounding (labialisation).","zh":"（形容语音/发音方式）带有圆唇特征的；唇化的。"},"examples":[{"en":"The consonant has a labialising quality in this context.","zh":"这个辅音在这种语境下带有唇化的性质。"}]}],"synonyms":["lip-rounding","rounding"],"phonetic":"ˈleɪbiəˌlaɪzɪŋ","extraExplanation":["“labialising”是英式拼写；美式常写作“labializing”。两者意思相同。","在语音学里，“唇化/圆唇化”常用上标符号 [ʷ] 表示，例如 [kʷ]；意思是发这个辅音时嘴唇会同时做出圆唇动作。","它常被用来描述“辅音的次要发音（secondary articulation）”，可以与“腭化（palatalisation）”“咽化”等现象对比理解。"]}
{"word":"labialism","summary":{"en":"Labialism is the tendency to use or emphasize lip-made (labial) sounds in speech; less commonly, it refers to excessive lip involvement that affects pronunciation.","zh":"Labialism 指说话中对唇音的偏重或突出；较少见的用法是指嘴唇参与过强而影响发音的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics/phonetics) The use or prominence of lip-made sounds (labial sounds such as /p b m f v w/) in a language, accent, or a person’s speech.","zh":"（语言学/语音学）指在一种语言、口音或个人发音中，唇音（用嘴唇发出的音，如 /p b m f v w/）的使用或突出现象。"},"examples":[{"en":"Some learners show labialism at first, relying heavily on /p/ and /b/ while other sounds are still difficult.","zh":"有些学习者一开始会出现“唇音偏重”，因为其他音还难发，就更依赖 /p/ 和 /b/。"},{"en":"The researcher noted labialism in the dialect’s consonant system, with many words favoring lip sounds.","zh":"研究者指出该方言的辅音系统存在唇音偏重，许多词更偏好使用唇部发音。"}]},{"partOfSpeech":"n.","definition":{"en":"(Speech/clinical use, less common) A speech characteristic or error where sounds are produced with excessive lip involvement, or non-labial sounds shift toward labial ones.","zh":"（言语/临床用法，较少见）指发音时嘴唇参与过多，或把非唇音发得更像唇音的一种言语特征或错误。"},"examples":[{"en":"The therapist worked on reducing the child’s labialism so /t/ and /d/ stayed clear and not “lip-like.”","zh":"治疗师帮助孩子减少“唇化倾向”，让 /t/ 和 /d/ 保持清晰，不要发得像“唇音”。"},{"en":"In fast speech, his labialism made certain consonants sound closer to /b/ or /m/.","zh":"在快速语流中，他的唇化倾向让某些辅音听起来更接近 /b/ 或 /m/。"}]}],"synonyms":["labial tendency","lip articulation (contextual)","labial prominence (contextual)"],"phonetic":"/ˈleɪbiəˌlɪzəm/","extraExplanation":["词源：来自拉丁语 labium（“嘴唇”）+ -ism（表示“现象/倾向”）。在语音学里，labial 指“唇音/唇部发音”，所以 labialism 多用于描述“唇音突出或唇部参与过强”的现象。","相关概念：labial（唇音的/唇部的），labialization（唇化：发音时带上圆唇等唇部特征），bilabial（双唇音，如 /p b m/），labiodental（唇齿音，如 /f v/）。"]}
{"word":"labialismus","summary":{"en":"Labialismus is a rare term for involuntary lip spasm or tight lip closure.","zh":"Labialismus 是一个罕见术语，指嘴唇不自主痉挛或紧闭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare medical term meaning an involuntary spasm or abnormal tight closing of the lips, which may make speaking or opening the mouth difficult.","zh":"（罕见医学用语）指嘴唇不自主痉挛或异常紧闭，可能导致说话或张口困难。"},"examples":[{"en":"After the facial nerve injury, the patient developed labialismus and struggled to speak clearly.","zh":"面神经受伤后，患者出现了 labialismus（唇部痉挛/紧闭），说话变得不清楚。"},{"en":"The doctor noted labialismus along with other signs of orofacial dystonia.","zh":"医生记录到患者有 labialismus，并伴随其他口面部肌张力障碍的表现。"}]}],"synonyms":["lip spasm","spasm of the lips","orofacial dystonia (related)"],"phonetic":"/ˌleɪbiəˈlɪzməs/","extraExplanation":["这个词在现代英语医学文献中非常少见，更多时候会用更常见的表达，如“lip spasm（嘴唇痉挛）”“orofacial dystonia（口面部肌张力障碍）”“spasm of the orbicularis oris（口轮匝肌痉挛）”。","词源上可拆成 labial-（唇的）+ -ismus（表示一种状态/病症），含义类似于 trismus（牙关紧闭），但部位更偏“嘴唇”。"]}
{"word":"labiality","summary":{"en":"Labiality is a phonetics term meaning a sound involves the lips (including lip rounding).","zh":"labiality 是语音学术语，指发音涉及嘴唇（也包括圆唇特征）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being produced with the lips, especially in speech sounds (for example /p/, /b/, /m/, /w/); also, the presence of lip rounding in a sound","zh":"（语音学）唇音性：发音时使用嘴唇的特征（如 /p/、/b/、/m/、/w/）；也可指发音时“圆唇”的特征"},"examples":[{"en":"In English, /p/ and /b/ show labiality because they are made with the lips.","zh":"在英语中，/p/ 和 /b/ 体现唇音性，因为它们是用嘴唇发出来的。"},{"en":"The vowel sound in “too” has labiality because your lips are rounded.","zh":"“too” 里的元音带有唇音性，因为发音时嘴唇会圆起来。"}]}],"synonyms":["lip rounding","labial feature"],"phonetic":"/ˌleɪbiˈæləti/","extraExplanation":["这是一个偏学术的术语，常见于语音学（phonetics）和音系学（phonology）的讨论中。它通常对应两类现象：①辅音“用唇”发音（如双唇音 bilabial）；②元音“圆唇”这一特征（如 /u/ 常为圆唇元音）。","相关常见词：labial（唇的/唇音的）, bilabial（双唇音）, labiodental（唇齿音，如 /f/、/v/）, rounding（圆唇）。"]}
{"word":"labialization","summary":{"en":"Labialization is the addition of lip rounding to a sound (often a consonant), sometimes also referring to a long-term sound change involving this feature.","zh":"Labialization（唇化）指发音时给某个音（常为辅音）加上圆唇这一伴随特征；也可指带圆唇特征的历时音变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In linguistics, the addition of lip rounding (a “w”-like quality) to a sound, usually a consonant, as a secondary articulation.","zh":"（语言学）在发音时给某个音（通常是辅音）额外加上“圆唇/像 w 的唇形”这一伴随特征，属于次要调音。"},"examples":[{"en":"In English, the /k/ sound in “queen” is often described as labialized because the lips round slightly.","zh":"在英语中，“queen”里的 /k/ 常被描述为带有唇化，因为发 /k/ 时嘴唇会略微圆起。"},{"en":"The teacher explained that labialization can change how a consonant sounds without changing its main place of articulation.","zh":"老师解释说，唇化会改变辅音的听感，但不一定改变它主要的发音部位。"}]},{"partOfSpeech":"n.","definition":{"en":"A historical sound change in which sounds become pronounced with lip rounding over time in a language or dialect.","zh":"（历史语音学）一种历时音变：某些音在语言或方言的发展过程中逐渐带上圆唇特征。"},"examples":[{"en":"Researchers discussed labialization as one factor in the sound changes of the dialect.","zh":"研究者把唇化作为该方言语音变化的一个因素来讨论。"}]}],"synonyms":["lip rounding","rounding","labial secondary articulation"],"phonetic":"/ˌleɪbiələˈzeɪʃən/","extraExplanation":["“唇化（labialization）”常见于国际音标（IPA）的转写：例如把辅音写成 /kʷ/，其中上标的 ʷ 表示“带圆唇”。它通常是“次要调音（secondary articulation）”，也就是在主要发音动作之外，嘴唇同时做出圆唇动作。","不要把唇化和 /w/ 这个音直接等同：唇化只是“带一点 w 的味道”，但不一定真的出现一个独立的 /w/ 音。不同语言里唇化可能是可有可无的发音习惯，也可能用来区分词义（具有区别意义）。"]}
{"word":"labialize","summary":{"en":"Labialize means to make a sound involve the lips (especially adding lip-rounding); less commonly, to make something lip-shaped in biology/medicine.","zh":"Labialize 指（语言学）使语音带有唇部参与/圆唇特征；较少见时指（生物/医学）使某物呈唇状。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To pronounce a speech sound with the lips involved, or to add lip-rounding to a sound (a phonetic change).","zh":"（语言学）使某个语音带有唇部参与的发音方式，或给语音加上“唇化/圆唇”的特征（一次语音变化）。"},"examples":[{"en":"Some languages labialize certain consonants before a back vowel.","zh":"有些语言在后元音前会把某些辅音唇化。"},{"en":"In careful speech, the speaker may labialize the sound slightly, making it more rounded.","zh":"在更谨慎的发音中，说话者可能会轻微唇化这个音，让它听起来更圆唇。"}]},{"partOfSpeech":"vt.","definition":{"en":"To form or shape something into a lip-like structure (used in biology/medicine, less common).","zh":"（生物/医学，用法较少）使某物形成或变成类似“唇”的结构。"},"examples":[{"en":"During development, the tissue can labialize and form a lip-like edge.","zh":"在发育过程中，这些组织可能会唇状化，形成类似唇缘的边缘。"}]}],"synonyms":["round (a sound)","add lip-rounding","labialize (phonetics)","shape into a lip"],"phonetic":"/ləˈbaɪəlaɪz/","extraExplanation":["“labialize”来自拉丁语词根 labium（嘴唇）。在语音学里，它常指“加上圆唇/唇音特征”，例如把一个辅音说得更像带有 [w]-式的圆唇色彩。你也可能在教材里看到相关名词：labialization（唇化）。","不要和“vocalize（发声/使发声）”混淆；两者拼写相似，但含义不同。"]}
{"word":"labialized","summary":{"en":"Labialized describes a sound pronounced with added lip rounding, common in phonetics/linguistics.","zh":"labialized 指“唇化的”，即发音时额外加入嘴唇圆拢（撮唇）的特征，常用于语音学/语言学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Pronounced with lip rounding, as an added feature to another sound.","zh":"（语言学）带唇化的；发音时在主要音的基础上加入嘴唇圆拢（撮唇）的特征。"},"examples":[{"en":"In some languages, /k/ can be labialized, sounding like /kʷ/.","zh":"在一些语言里，/k/ 可以唇化，听起来像 /kʷ/。"},{"en":"The teacher asked us to compare a plain consonant with a labialized one.","zh":"老师让我们比较普通辅音和唇化辅音的差别。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made into a form that uses lip rounding (often describing a consonant or its pronunciation).","zh":"（常指辅音或其发音）被唇化的；被处理成带圆唇特征的。"},"examples":[{"en":"In this dialect, the consonant is labialized before back vowels.","zh":"在这种方言中，这个辅音在后元音前会被唇化。"}]}],"synonyms":["rounded (in some contexts)","with lip rounding","labiovelar (related term, not identical)"],"phonetic":"/ˈleɪbiəlaɪzd/","extraExplanation":["“labial-”来自拉丁语 labium（“嘴唇”），-ized 表示“……化/使成为……”。所以 labialized 字面意思就是“唇化的”。","在国际音标（IPA）里，唇化通常用上标的小 ʷ 表示，例如 /kʷ/、/tʷ/。它常见于描述辅音的“次要发音（secondary articulation）”。","注意区分：labialized（唇化）通常是“在发辅音时额外撮唇”，而 rounded（圆唇）更常用来描述元音本身是否圆唇。"]}
{"word":"labializing","summary":{"en":"Labializing means adding lip rounding to a sound, giving it a slight “w-like” quality.","zh":"Labializing 指在发音时加入圆唇，使语音带一点类似“w”的色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics/phonetics) Causing a sound—especially a consonant—to be produced with lip rounding (adding a “w-like” quality).","zh":"（语言学/语音学）使某个语音（尤其是辅音）在发音时伴随圆唇（带一点类似“w”的音色/特征）。"},"examples":[{"en":"In some languages, a consonant can become labializing before a back vowel like /u/.","zh":"在一些语言里，辅音在像 /u/ 这样的后元音前可能会出现唇化（圆唇化）现象。"},{"en":"The teacher described the speaker’s labializing of /k/ as a [kʷ]-like sound.","zh":"老师把说话者对 /k/ 的唇化描述为类似 [kʷ] 的声音。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of labialize: to make (a sound) labialized; to add lip rounding in pronunciation.","zh":"labialize 的现在分词：使（某个语音）唇化；在发音中加入圆唇动作。"},"examples":[{"en":"The environment is labializing the consonant, so it sounds slightly rounded.","zh":"语音环境正在使该辅音唇化，所以听起来会有一点圆唇的感觉。"},{"en":"When speaking quickly, some people end up labializing sounds without noticing.","zh":"说得很快时，有些人会不自觉地把某些音唇化。"}]}],"synonyms":["lip-rounding","rounding","labializing (a sound)","labializing process"],"phonetic":"/ˈleɪbiəˌlaɪzɪŋ/","extraExplanation":["“labial-” 来自拉丁语 labium（“嘴唇”）。在语音学里，labialization（唇化）常用上标小 w 表示：例如 [kʷ] 表示发 /k/ 的同时嘴唇有圆唇动作，听感接近带一点 /w/ 的色彩。","需要注意：唇化（labialization）不是把辅音变成 /w/，而是给辅音“加上”圆唇这个附加特征。很多语言（如高加索地区的一些语言）会把“是否唇化”当作重要的音位区别。"]}
{"word":"labially","summary":{"en":"Labially means “in a way involving the lips,” especially in pronunciation or medical/anatomical description.","zh":"labially 指“以与嘴唇有关的方式”，常用于发音（语言学）或医学/解剖描述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves the lips (especially in speech sounds).","zh":"以嘴唇的方式；与嘴唇有关地（尤指发音时）。"},"examples":[{"en":"The sound /p/ is produced labially, by closing the lips and releasing air.","zh":"/p/ 这个音是用双唇发出来的：先闭合嘴唇，再放出气流。"},{"en":"Some speakers pronounce this consonant more labially than others.","zh":"有些人把这个辅音发得更“唇化”，比其他人更依赖嘴唇。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is related to the lips in anatomy or medicine.","zh":"在解剖或医学意义上，与唇部相关地。"},"examples":[{"en":"The incision was made labially to avoid damaging nearby tissue.","zh":"切口从唇侧进行，以避免损伤附近组织。"}]}],"synonyms":["with the lips","lip-related (in a … way)","orally (broader)"],"phonetic":"/ˈleɪbiəli/","extraExplanation":["“labially”来自拉丁语词根 lab-（唇）。在语言学里，它常用来描述“用嘴唇参与的发音方式”，例如 bilabial（双唇音，如 /p b m/）和 labiodental（唇齿音，如 /f v/）。","日常英语里更常说 “with the lips” 或 “using the lips”；“labially”多见于语言学、牙科、医学等较正式的语境。"]}
{"word":"labials","summary":{"en":"“Labials” are speech sounds made with the lips, or things related to the lips.","zh":"“Labials”指用嘴唇发出的语音（唇音），或与嘴唇有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Speech sounds made mainly with the lips (sometimes with the lips and teeth).","zh":"（语音学）用嘴唇为主要发音部位发出的音（有时也包括唇齿）。"},"examples":[{"en":"In English, /p/, /b/, and /m/ are labials.","zh":"在英语里，/p/、/b/、/m/ 都是唇音（labials）。"},{"en":"Some learners confuse labials like /p/ and /b/ because they look similar on the lips.","zh":"一些学习者会把 /p/ 和 /b/ 这样的唇音混淆，因为它们在口型上看起来很像。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the lips.","zh":"与嘴唇有关的；唇的。"},"examples":[{"en":"The doctor checked the patient’s labial movement while speaking.","zh":"医生检查了病人说话时嘴唇（labial）的运动。"},{"en":"Labial sounds require clear lip closure.","zh":"唇音需要清晰的闭唇动作。"}]}],"synonyms":["bilabials","labiodentals","lip sounds"],"phonetic":"/ˈleɪbiəlz/","extraExplanation":["“labials”通常是复数名词，用在语音学里表示“唇音”。更具体地说：\n- bilabials（双唇音）：/p/ /b/ /m/（两片嘴唇参与）\n- labiodentals（唇齿音）：/f/ /v/（下唇接近或接触上齿）\n在语言学习里，区分 /p/ 与 /b/ 时，除了口型，还要注意送气与否、以及声带是否振动。"]}
{"word":"labiatae","summary":{"en":"Labiatae is an older name for the mint family of plants, now usually called Lamiaceae.","zh":"Labiatae 是唇形科的旧称，现代多用 Lamiaceae。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the mint family of plants (now usually called Lamiaceae), including herbs such as mint, basil, rosemary, sage, and lavender","zh":"唇形科（现在更常用名称为 Lamiaceae），包括薄荷、罗勒（九层塔）、迷迭香、鼠尾草、薰衣草等植物"},"examples":[{"en":"Mint and basil are both in the Labiatae (mint) family.","zh":"薄荷和罗勒都属于唇形科（薄荷科）。"},{"en":"Many Labiatae plants are aromatic and used in cooking and medicine.","zh":"许多唇形科植物有香味，常用于烹饪和药用。"}]}],"synonyms":["Lamiaceae","mint family"],"phonetic":"/ˌleɪbiˈeɪtiː/","extraExplanation":["“Labiatae”是较旧的科名，来源于拉丁语 labium（“嘴唇”），因为这类植物的花常呈明显的“上下唇”形（双唇形花冠）。","现代植物分类中更常用“Lamiaceae”（唇形科）这一名称；在较新的教材、论文或植物志里通常会写作“Lamiaceae (formerly Labiatae)”。"]}
{"word":"labiate","summary":{"en":"Labiate means “having lips” or “lip-shaped,” and in botany it commonly describes flowers with two lips (upper and lower).","zh":"labiate 意为“有唇的/唇形的”，在植物学中常指具有上下两唇结构的花。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having lips; shaped like lips","zh":"有唇的；像嘴唇形状的"},"examples":[{"en":"Some flowers have labiate petals that look like an open mouth.","zh":"有些花的花瓣呈唇形，看起来像张开的嘴。"},{"en":"The labiate edge of the statue’s carving makes the face look more lifelike.","zh":"雕刻里唇状的边缘让这张脸看起来更逼真。"}]},{"partOfSpeech":"adj.","definition":{"en":"(biology, especially botany) describing a flower with two “lips,” typically an upper and lower part","zh":"（生物学，尤指植物学）指两唇形花冠的；常有上唇和下唇"},"examples":[{"en":"Mint and sage are in a group known for labiate flowers.","zh":"薄荷和鼠尾草属于以唇形花著称的一类植物。"},{"en":"Bees can land easily on the lower lip of a labiate flower.","zh":"蜜蜂可以很容易停在唇形花的下唇上。"},{"en":"In the garden guide, the plant is described as having small, purple, labiate blossoms.","zh":"在园艺指南里，这种植物被描述为开小而紫的唇形花。"}]}],"synonyms":["lip-shaped","bilabiate"],"phonetic":"/ˈleɪbiˌeɪt/","extraExplanation":["词源上来自拉丁语 labium（“嘴唇”）。在植物学里，labiate 常与 bilabiate（“二唇形的”）一起出现，帮助你记住“像嘴唇/分成上下两唇”的形状特征。","在分类学中你可能会看到旧称 Labiate（“唇形科”），现在更常用的科名是 Lamiaceae（薄荷科）。"]}
{"word":"labiated","summary":{"en":"Labiated means “lip-shaped,” most often describing two-lipped flowers (especially in the mint family).","zh":"labiated 意为“唇形的”，最常指二唇形花（薄荷科常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a lip-like shape, especially a flower with a two-lipped (upper and lower) corolla.","zh":"（植物）呈“唇形”的；尤指花冠上下分成两“唇”（二唇形）的。"},"examples":[{"en":"Many mint-family plants have labiated flowers that attract bees.","zh":"许多薄荷科植物的花是唇形的，能吸引蜜蜂。"},{"en":"The description notes a labiated corolla with a broad lower lip.","zh":"描述中提到花冠为唇形，下唇较宽。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Having lips or lip-like parts; having labia.","zh":"（解剖/医学）有“唇”或唇状结构的；有（阴）唇的。"},"examples":[{"en":"Some anatomy texts use “labiated” to describe structures with a clear lip-like edge.","zh":"一些解剖学资料用“labiated”来形容边缘明显呈唇状的结构。"}]}],"synonyms":["labiate","bilabiate","lip-shaped"],"phonetic":"/ˈleɪbiˌeɪtɪd/","extraExplanation":["“labiated”来自拉丁语 labium（“嘴唇”）。在植物学里最常见，常用来描述薄荷科（mint family）的“二唇形花”（bilabiate）：上唇像“帽子”，下唇像“平台”，方便昆虫停落并取蜜。","容易混淆的词：labial（唇的/与唇相关的，常用于语音学如“唇音”），labiate（同义但更常见），labialized（语音学“唇化”，更常用这个词而不是 labiated）。"]}
{"word":"labiates","summary":{"en":"“Labiates” usually means plants in the mint family; “labiate” can also describe lip-shaped (often two-lipped) flowers.","zh":"“labiates”通常指唇形科植物；“labiate”也可形容唇状（常见为二唇形）的花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Plants in the mint family (Lamiaceae), such as mint, basil, rosemary, sage, and lavender.","zh":"（复数名词）唇形科植物（Lamiaceae），如薄荷、罗勒、迷迭香、鼠尾草、薰衣草等。"},"examples":[{"en":"Many labiates have a strong smell because they contain aromatic oils.","zh":"许多唇形科植物气味很浓，因为它们含有芳香精油。"},{"en":"Basil and mint are labiates often used in cooking.","zh":"罗勒和薄荷都是常用于烹饪的唇形科植物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Having “lip-shaped” parts, especially a flower with two lips (an upper and a lower lip).","zh":"（形容词）具有“唇状”结构的；尤指花冠呈二唇形（上唇与下唇）的。"},"examples":[{"en":"The plant has labiate flowers that guide insects toward the nectar.","zh":"这种植物的二唇形花能引导昆虫找到花蜜。"},{"en":"Sage is known for its labiate blossoms.","zh":"鼠尾草以其二唇形花朵而闻名。"}]}],"synonyms":["mint family","Lamiaceae","labiate (adj.)","bilabiate"],"phonetic":"/ˈleɪbiˌeɪts/","extraExplanation":["“labiates”在较老的植物学书里常用来指“唇形科（Lamiaceae）”，现代更常直接用“mint family / Lamiaceae”。","“labiate”来自拉丁语 labium（嘴唇）。在花的结构上，“二唇形（bilabiate）”是唇形科常见特征，常与昆虫传粉有关。"]}
{"word":"labiatiflorous","summary":{"en":"A botanical adjective meaning “having lip-shaped (often two-lipped) flowers.”","zh":"植物学形容词，指“具有唇形（常为二唇状）花”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having labiate (lip-shaped), usually two-lipped flowers.","zh":"（植物学）具唇形花的；（通常）具二唇状花冠的。"},"examples":[{"en":"Many mints have labiatiﬂorous blossoms that attract bees.","zh":"许多薄荷属植物开唇形花，能吸引蜜蜂。"},{"en":"The plant was described as labiatiﬂorous, suggesting a two-lipped corolla.","zh":"这株植物被描述为“具唇形花”，暗示它的花冠呈二唇状。"}]}],"synonyms":["labiate","bilabiate","lipped"],"phonetic":"/ˌleɪbiˌeɪtɪˈflɔrəs/","extraExplanation":["这是一个较少见的植物学形容词，常用于分类学或形态学描述。","词源可拆为拉丁语根：labiati-（“唇状的”，来自 labium“嘴唇”）+ -florous（“开……花的/具……花的”，与 flora“植物群/花”同源）。","常见相关术语：labiate/bilabiate（唇形/二唇形），常用于描述唇形科（Lamiaceae，如薄荷、鼠尾草等）花冠结构。"]}
{"word":"labibia","summary":{"en":"“Labibia” is not standard English; it is likely a misspelling of “labia,” meaning the folds of skin of the female external genital area.","zh":"“labibia”不是标准英文，可能是“labia”的拼写错误；“labia”指女性外阴部位的皮肤褶皱（阴唇）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely a misspelling) Not a standard English word. People often mean “labia.”","zh":"（可能是拼写错误）“labibia”不是标准英文单词。人们通常想写的是“labia（阴唇）”。"},"examples":[{"en":"I couldn’t find “labibia” in the dictionary—did you mean “labia”?","zh":"我在词典里找不到“labibia”——你是不是想写“labia”？"}]},{"partOfSpeech":"n.","definition":{"en":"Labia: the outer parts of the female genital area (the folds of skin around the vaginal opening).","zh":"Labia：女性外阴的外部结构（阴道口周围的皮肤褶皱），通常译为“阴唇”。"},"examples":[{"en":"The doctor explained that the labia can vary a lot in size and shape.","zh":"医生解释说，阴唇的大小和形状差异很大。"},{"en":"If you feel pain or swelling in the labia, talk to a healthcare professional.","zh":"如果你感到阴唇疼痛或肿胀，建议咨询专业医护人员。"}]}],"synonyms":["vulva (broader term)","labia majora","labia minora"],"phonetic":"/ˈleɪbiə/","extraExplanation":["“labia”是拉丁语来源，意思是“嘴唇/唇”，所以英语里用来指“像嘴唇一样的褶皱”。在医学语境中很常见、较正式；日常对话里人们可能会用更委婉的说法。"]}
{"word":"labidometer","summary":{"en":"A rare word meaning an instrument for measuring lips or labia in anatomy/medicine.","zh":"罕见词：指用于测量嘴唇或外阴唇等唇状结构的解剖/医学测量器具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very rare term for an instrument used to measure the lips or labia (lip-like parts) in anatomical or medical contexts","zh":"（非常罕见的术语）用于测量嘴唇或外阴唇等“唇状”结构的测量仪器，见于解剖/医学语境"},"examples":[{"en":"The paper mentioned a labidometer for taking standardized measurements of the labia.","zh":"论文提到用 labidometer 对外阴唇进行标准化测量。"},{"en":"In modern practice, clinicians usually use calipers instead of a labidometer.","zh":"在现代实践中，临床通常用卡尺代替 labidometer。"}]}],"synonyms":["calipers","measuring instrument","measuring device"],"phonetic":"/læbɪˈdɑːmɪtər/","extraExplanation":["这个词在现代英语中几乎不使用，多半出现在少量旧式或专业文献里；日常和大多数医学写作更常用 calipers（卡尺）、measuring device（测量工具）等更通用的说法。","构词上通常可理解为 labi-（与“唇”有关，来自拉丁语 labium）+ -meter（测量器）。如果你是在特定文章里看到它，也可能是罕见拼写或排版误差；可以对照上下文或原文来源确认。"]}
{"word":"labidophorous","summary":{"en":"Labidophorous means “bearing forceps/pincer-like structures,” used mainly in technical zoological descriptions.","zh":"labidophorous 指“带有钳状/镊状结构的”，主要用于动物学等专业描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having or bearing forceps- or pincer-like structures; forceps-bearing.","zh":"（罕见；专业）具有或带有钳状/镊状结构的；“带钳的”。"},"examples":[{"en":"Some descriptions of insects mention a labidophorous abdomen with pincer-like appendages.","zh":"一些昆虫的描述会提到“labidophorous”的腹部，末端带有钳状附肢。"},{"en":"The species was noted as labidophorous, with paired clasping structures near the tail.","zh":"该物种被记为 labidophorous，在尾部附近有成对的夹持结构。"}]}],"synonyms":["forceps-bearing","pincer-like","forceps-like"],"phonetic":"/ˌlæbɪˈdɑːfərəs/","extraExplanation":["这个词非常少见，多见于旧式或高度专业的动物学/昆虫学描述中。","词源上可拆解为 labid-（来自希腊语 *labis*，意为“镊子/钳子”）+ -phorous（“携带/具有……的”）。因此字面意思就是“带钳的”。","现代写作中更常用的表达往往是：*forceps-like*, *pincer-like*, *bearing forceps*。如果你是在论文或标本描述中遇到它，通常是在强调某个部位的“钳状附器/夹持结构”。"]}
{"word":"labidura","summary":{"en":"“labidura” is not recognized as a standard English word; it likely needs context or corrected spelling.","zh":"“labidura”不是标准英语单词；很可能需要语境或更正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language (e.g., Spanish/Portuguese/Tagalog). Please share the sentence or the correct spelling so I can help.","zh":"不是标准英语单词。可能是拼写错误、人名，或来自其他语言（例如西班牙语/葡萄牙语/他加禄语等）。请提供包含它的句子或确认正确拼写，我才能更准确地解释。"},"examples":[{"en":"I found the word “labidura” in a message—what does it mean?","zh":"我在一条信息里看到“labidura”——它是什么意思？"},{"en":"Could you confirm the spelling of “labidura,” or share the full sentence?","zh":"你能确认“labidura”的拼写，或把完整句子发我吗？"}]}],"extraExplanation":["目前在常见英语词典与语料中找不到“labidura”作为英语词条。它更像是：\n1）拼写接近的英语词（例如 *labrador*、*labour*、*lavender* 等）；\n2）专有名词（人名、地名、品牌名）；\n3）其他语言的词。 \n如果你告诉我它出现的语境（哪种语言、来自哪里、前后句），我可以帮你判断来源与含义。"]}
{"word":"labiduridae","summary":{"en":"Labiduridae is the scientific name for a family of earwigs.","zh":"Labiduridae 是“蠼螋（耳夹虫）的一科”的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of earwigs (in the order Dermaptera), including species such as the striped earwig (Labidura riparia).","zh":"蠼螋（耳夹虫）的一科（属革翅目），包含如条纹蠼螋（Labidura riparia）等物种。"},"examples":[{"en":"Labiduridae are earwigs often found in warm regions, sometimes living under stones or leaf litter.","zh":"Labiduridae 这一科的蠼螋常见于温暖地区，有时栖息在石块下或落叶层中。"},{"en":"In a field guide, you might see Labiduridae listed as one of the main earwig families.","zh":"在野外图鉴中，你可能会看到 Labiduridae 被列为蠼螋的主要科之一。"}]}],"synonyms":["earwig family (general description)"],"phonetic":"/ˌlæbɪˈdʊrɪdiː/","extraExplanation":["这是一个拉丁化的科学分类名称（“科”名），通常首字母大写（Labiduridae），不需要加冠词时也常直接使用。","发音在英语中并不完全固定；在课堂或科普场景中，常按拉丁词根分节读即可。","写作时常与更具体的分类层级搭配使用：order（目）Dermaptera，family（科）Labiduridae，genus（属）Labidura，species（种）Labidura riparia。"]}
{"word":"labiella","summary":{"en":"“Labiella” is not a common English vocabulary word; it’s likely a misspelling or a proper name.","zh":"“labiella”不是常见英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling, a proper name (surname/brand), or a term from another language.","zh":"不是常见英语词典里的标准词；更可能是拼写错误、专有名词（姓氏/品牌），或来自其他语言的词。"},"examples":[{"en":"I couldn’t find a clear English definition for “labiella”—could you share the sentence you saw it in?","zh":"我找不到“labiella”明确的英文释义——你能把它出现的句子发我看看吗？"},{"en":"If you meant “labia,” that word is used in anatomy.","zh":"如果你想写的是“labia”，这个词用于解剖学语境。"}]}],"phonetic":"/ˌlæbiˈɛlə/","extraExplanation":["“labiella”在英语里非常少见，常见情况是：\n1）把 **labia**（解剖学：阴唇/唇状结构）拼错了；\n2）把 **labella / La Bella**（人名/品牌/外语拼写）拼成了labiella；\n3）某个小众领域的专有名词。\n\n如果你把来源（截图/句子/上下文领域，比如医学、美妆、拉丁语/西语等）发来，我可以更准确地判断它应该是什么词以及如何理解。"]}
{"word":"labile","summary":{"en":"“Labile” means unstable or likely to change quickly; in science it can mean easily broken down or reactive.","zh":"“Labile”指“易变的、不稳定的”；在理化/生物语境中也可指“易分解、反应性强的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely to change quickly; not stable or steady (often about emotions, situations, or values).","zh":"易变的；不稳定的（常指情绪、局势或数值等起伏很快）。"},"examples":[{"en":"After the news, his mood became labile and hard to predict.","zh":"听到消息后，他的情绪变得很易变，让人难以预测。"},{"en":"In some patients, blood pressure can be labile during surgery.","zh":"在一些病人身上，手术过程中血压可能会波动很大。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/Biology) Easily broken down, transformed, or replaced; readily reactive.","zh":"（化学/生物）易分解的；易转化的；（成分）易被替换的；反应性强的。"},"examples":[{"en":"Labile compounds can decompose if they are exposed to heat.","zh":"不稳定（易分解）的化合物受热时可能会分解。"},{"en":"The body stores some nutrients in more labile forms that change quickly.","zh":"人体会以更“易变”的形式储存一些营养物质，这些形式变化很快。"}]}],"synonyms":["unstable","changeable","volatile","variable","reactive"],"phonetic":"/ˈleɪbaɪl/","extraExplanation":["“labile”常见于学术或医学语境，比“changeable”更正式；在心理/医学中常搭配：labile mood（情绪不稳）、emotional lability（情绪易波动）、labile blood pressure（血压波动）。","词源来自拉丁语 *labilis*，意为“容易滑倒/不稳”，所以核心感觉是“站不稳→容易变化”。","易混淆：*liable*（易于……的；有责任的）拼写很像，但意思不同；*labile*强调“容易改变/不稳定”。"]}
{"word":"labilities","summary":{"en":"Liabilities are responsibilities or debts you must pay or handle; in accounting, they are a company’s debts shown on the balance sheet.","zh":"Liabilities 指需要承担的责任或债务；在会计中指公司在资产负债表上列示的各项负债。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) A legal or financial responsibility; something you are obligated to pay or deal with.","zh":"（通常用复数）法律或财务上的责任/义务；你必须支付或处理的事情。"},"examples":[{"en":"If you cause an accident, you may have legal liabilities.","zh":"如果你造成事故，你可能要承担法律责任。"},{"en":"Her main liabilities are student loans and credit-card debt.","zh":"她主要的负债是学生贷款和信用卡欠款。"}]},{"partOfSpeech":"n.","definition":{"en":"(accounting, plural) The debts and obligations a company owes, shown on the balance sheet (e.g., loans, accounts payable).","zh":"（会计，复数）公司在资产负债表上列出的负债与应付款项（如贷款、应付账款）。"},"examples":[{"en":"The company reduced its liabilities by paying off short-term loans.","zh":"公司通过偿还短期贷款减少了负债。"},{"en":"Current liabilities must be paid within a year.","zh":"流动负债必须在一年内偿还。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that causes problems or puts others at a disadvantage; a burden.","zh":"带来麻烦或使他人处于不利境地的人或事物；累赘。"},"examples":[{"en":"With his constant lateness, he became a liability to the team.","zh":"他总是迟到，成了团队的累赘。"},{"en":"Heavy debt can be a liability in tough economic times.","zh":"在经济困难时期，沉重的债务会成为负担。"}]}],"synonyms":["debts","obligations","responsibilities","burdens"],"phonetic":"/ˌlaɪ.əˈbɪl.ə.tiz/","extraExplanation":["你输入的“labilities”常见是拼写错误，正确拼法通常是 **liabilities**（复数），单数是 **liability**。","词根上来自“liable（有责任的）+ -ity（名词后缀）”，核心含义是“需要承担的责任/义务”，在会计语境中特指“负债”。"]}
{"word":"lability","summary":{"en":"Lability means a tendency to change easily—often used for emotional instability, and also for chemicals that react or break down easily.","zh":"Lability 指“易变性/不稳定性”，常用于描述情绪不稳定，也可指化学物质或键“易反应/易分解”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency to change easily; instability or variability (especially in feelings, behavior, or conditions)","zh":"易变性；不稳定性（尤指情绪、行为或状态容易波动）"},"examples":[{"en":"Mood lability can make someone feel happy one moment and upset the next.","zh":"情绪易变可能让一个人上一刻开心、下一刻就难过。"},{"en":"The patient showed emotional lability during the interview.","zh":"这位患者在访谈中表现出情绪不稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"in chemistry/biology, the tendency of a substance or chemical bond to break down or react easily","zh":"（化学/生物）不稳定性；易反应性（指物质或化学键容易分解或发生反应）"},"examples":[{"en":"The lability of the compound increases at higher temperatures.","zh":"在较高温度下，这种化合物的易反应性会增加。"},{"en":"Some metal–ligand bonds show lability in solution.","zh":"一些金属—配体键在溶液中表现出易变性。"}]}],"synonyms":["instability","variability","volatility","fluctuation","reactivity"],"phonetic":"/ləˈbɪləti/","extraExplanation":["“lability”常见于医学与心理学语境，如“emotional lability（情绪易变）”，描述情绪起伏较大、转换较快的现象；它不等同于“mood swings（情绪波动）”，但在日常表达中有时会被当作相近概念使用。更口语的说法常用“emotional instability（情绪不稳定）”或“rapid mood changes（情绪变化很快）”。","词源来自拉丁语“labilis”，有“容易滑倒/不稳”的意思，因此引申为“容易改变、不稳定”。在化学里则强调“容易反应/容易断裂”的性质。"]}
{"word":"labilization","summary":{"en":"Labilization means making something less stable and more reactive or easier to change, mainly used in scientific contexts.","zh":"Labilization 指“使某物更不稳定、更易反应或更易变化”的过程，主要用于科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something more labile (less stable and more likely to change, react, or break apart), especially in chemistry and biochemistry","zh":"使某物变得更“易变/不稳定”（更容易变化、反应或分解）的过程，尤用于化学与生物化学"},"examples":[{"en":"The ligand caused labilization of the metal complex, making substitution reactions faster.","zh":"该配体使金属配合物发生“易变化”（labilization），从而让取代反应更快。"},{"en":"In enzyme studies, labilization of a bond can increase the reaction rate.","zh":"在酶学研究中，使某个键变得更易断裂（labilization）可以提高反应速率。"}]}],"synonyms":["destabilization"],"phonetic":"/ˌleɪbəlaɪˈzeɪʃən/","extraExplanation":["这是一个较偏学术/技术的名词，常见于化学配位化学与生物化学文献中。一般英语日常交流里很少用。","词根来自“labile（易变的/不稳定的）+ -ization（……化/……过程）”。含义与“stabilization（稳定化）”相对。","常见搭配：labilization of a complex/bond/site（配合物/键/位点的易变化）。相关词：labile（adj. 易变的）、labilize（v. 使易变）、stabilize（v. 使稳定）。"]}
{"word":"labilize","summary":{"en":"Labilize means to make a chemical bond or compound more easily changed or reactive (more labile).","zh":"labilize 指（在化学中）使键或化合物更易发生变化/交换/反应，即使其更“labile（易变、易反应）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To make something more labile—easier to break apart, replace, exchange, or react.","zh":"（化学）使……变得更“易变/易反应”（更容易断裂、被取代、发生交换或反应）。"},"examples":[{"en":"Adding a catalyst can labilize the metal–ligand bond and speed up the reaction.","zh":"加入催化剂可以使金属—配体键更易断裂，从而加快反应。"},{"en":"The new substituent labilized the complex, making ligand exchange faster.","zh":"新的取代基使该配合物更不稳定（更易交换），从而让配体交换更快。"}]}],"synonyms":["make labile","activate (in some contexts)","sensitize (sometimes)","destabilize (close but not always exact)"],"phonetic":"/ˈleɪbəˌlaɪz/","extraExplanation":["“labilize”是学术/专业用词，常见于配位化学、生物化学与材料化学等语境。核心来自形容词“labile”（易变的、易反应的），与“stabilize（稳定化）”在概念上相对。","在化学语境中，“labilize”通常不等同于一般英语里的“destabilize（使不稳定）”；它更强调“让某个键/基团更容易发生交换或反应”的具体反应性变化。"]}
{"word":"labilized","summary":{"en":"Labilized means “made more labile (less stable, more easily changed),” most often in scientific writing; it is also the past form of labilize.","zh":"labilized 指“被变得更易变/更不稳定、更容易改变”，多用于科研语境；也可作动词 labilize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/biology) Made labile—able to change, break apart, or react more easily; less stable.","zh":"（化学/生物）被“易变（不稳定）化”的；变得更容易变化、分解或反应的。"},"examples":[{"en":"Heating can labilize a compound, so the labilized form decomposes faster.","zh":"加热可能会使某种化合物变得更易变，因此“labilized”的形式分解得更快。"},{"en":"The mutation created a labilized protein that unfolds more easily.","zh":"这个突变产生了一种更易变的蛋白质，更容易展开（失去结构）。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of labilize: to make something more labile (less stable, more easily changed).","zh":"labilize 的过去式/过去分词：使某物更“易变”（更不稳定、更容易改变）。"},"examples":[{"en":"The catalyst labilized the bond, allowing the reaction to proceed.","zh":"该催化剂使这个键更易变，从而让反应得以进行。"},{"en":"By adding a reagent, they labilized the complex before the next step.","zh":"通过加入试剂，他们在下一步之前先让该配合物更易变。"}]}],"synonyms":["destabilized","made labile","rendered labile"],"phonetic":"/ˈleɪbəlaɪzd/","extraExplanation":["“labilized”在一般英语里不常见，多出现在化学、生物化学、药物化学等学术语境中。它来自“labile”（易变的、不稳定的）。","容易拼错或被误读为“labialized”（/ˈleɪbiəlaɪzd/，语音学术语，指“唇音化/圆唇化”，如某些辅音发音时带有圆唇特征）。如果你的语境与语言学/发音有关，你可能想查的是“labialized”。"]}
{"word":"labilizing","summary":{"en":"“Labilizing” means making something more unstable or easier to change, especially in scientific (often chemical) contexts.","zh":"“labilizing”指使某物更不稳定或更容易改变，尤其常用于科学（常见于化学）语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something more unstable or easier to change; destabilizing (often used in scientific or technical contexts).","zh":"使某物变得更不稳定或更容易改变；使之不稳定化（常用于科学或技术语境）。"},"examples":[{"en":"High heat is labilizing the compound, so it breaks down quickly.","zh":"高温正在使该化合物不稳定化，因此它会很快分解。"},{"en":"In this reaction, the solvent is labilizing the intermediate and speeding up the next step.","zh":"在这个反应中，溶剂使中间体不稳定化，从而加快了下一步。"}]},{"partOfSpeech":"v.","definition":{"en":"(chemistry) making a ligand or group more easily replaced in a complex; increasing lability.","zh":"（化学）使配合物中的配体或基团更容易被取代；提高“易变性/可置换性”。"},"examples":[{"en":"Adding water can be labilizing the chloride ligand, allowing substitution.","zh":"加入水可能会使氯配体更易被取代，从而发生取代反应。"},{"en":"The metal center has an effect on labilizing certain bonds.","zh":"金属中心会影响某些键的易变性，使其更容易发生交换。"}]}],"synonyms":["destabilizing","making labile","rendering unstable","activating (context-dependent)"],"phonetic":"/ˈleɪbəˌlaɪzɪŋ/","extraExplanation":["“labilizing”来自动词 labilize（使……变得 labile）。Labile 在英语里常指“容易变化/不稳定”，在配位化学中特指“配体容易被替换”。因此它通常不是日常口语词，更常出现在论文、实验记录和技术说明中。","与 stabilizing（稳定化）相对；在一般语境里也可近似理解为 destabilizing（使不稳定），但在化学语境下 labilize 更强调“更容易发生交换/取代”这一点。"]}
{"word":"labio","summary":{"en":"“labio-” is a form used in technical words to mean “lip.”","zh":"“labio-”是用于专业词汇中的构词成分，表示“唇（嘴唇）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “lip,” used in medical and anatomical terms","zh":"（构词成分）表示“唇、嘴唇”，常用于医学和解剖学术语中"},"examples":[{"en":"The term “labioplasty” refers to surgery involving the labia (lips) of the vulva.","zh":"“labioplasty（阴唇整形术）”指与外阴阴唇（“唇”状结构）相关的手术。"},{"en":"“Labiovelar” describes a sound made with the lips and the soft palate.","zh":"“labiovelar（唇—软腭音）”描述用嘴唇和软腭共同发出的语音。"}]}],"synonyms":["lip","labial"],"phonetic":"/ˈleɪbioʊ/","extraExplanation":["“labio-”多见于较正式/专业的词汇里（医学、语言学）。在日常英语中，一般直接说 lip（嘴唇）。","相关形容词常用 labial（唇的；与唇有关的）。在解剖语境中，labia 是 “lip” 的复数形式，也特指外阴的阴唇（anatomical term）。"]}
{"word":"labioalveolar","summary":{"en":"Labioalveolar describes a sound made using both the lips and the alveolar ridge.","zh":"Labioalveolar 指同时用双唇和齿龈（嵴）参与发出的语音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Made with both the lips and the alveolar ridge (the bony ridge behind the upper front teeth).","zh":"（语音学）同时用到双唇和齿龈（上门牙后方的齿龈嵴）发出的。"},"examples":[{"en":"In some analyses, English /f/ and /v/ are described as labioalveolar fricatives.","zh":"在一些分析中，英语的 /f/ 和 /v/ 被描述为唇—齿龈摩擦音（labioalveolar fricatives）。"},{"en":"The textbook mentions a labioalveolar articulation used in certain languages.","zh":"教材提到某些语言中存在唇—齿龈的发音部位（labioalveolar articulation）。"}]}],"synonyms":["(no exact common synonym; related: labial, alveolar, labiodental)"],"phonetic":"/ˌleɪbioʊˌælviˈoʊlər/","extraExplanation":["这个词主要出现在语音学/语言学里：labio- 表示“唇”，alveolar 表示“齿龈（嵴）”。严格来说，英语 /f v/ 更常被称为“唇齿音（labiodental）”，但有些研究会根据更细的发音动作，把它们或类似音描述为涉及齿龈区域的“labioalveolar”。","相关术语：labial（唇音的）、alveolar（齿龈音的）、labiodental（唇齿音的）。"]}
{"word":"labiocervical","summary":{"en":"A medical adjective meaning “related to both the labia and the cervix.”","zh":"医学形容词，表示“与阴唇和宫颈两者相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the lips (labia) and the cervix, especially in gynecology or anatomy.","zh":"（医学/妇科）与阴唇（labia）和宫颈（cervix）两者都有关的；唇-宫颈的。"},"examples":[{"en":"The report described labiocervical inflammation and recommended follow-up testing.","zh":"报告描述了唇-宫颈部位的炎症，并建议进行复查。"},{"en":"The clinician examined the labiocervical region for signs of irritation.","zh":"临床医生检查了唇-宫颈区域是否有刺激或不适的迹象。"}]}],"synonyms":["labial and cervical","vulvocervical (related term)"],"phonetic":"ˌleɪbioʊˈsɝvɪkəl","extraExplanation":["这是一个相对少见的医学形容词，多用于专业语境（如妇科检查记录、解剖学描述、医学论文）。日常英语中更常见的表达会直接说“labia and cervix（阴唇和宫颈）”。","词素拆解：labio- 表示“唇/阴唇”，cervical 表示“宫颈的”。在医学英语里，常用这种组合词来精确指代涉及多个解剖结构的情况。"]}
{"word":"labiodendal","summary":{"en":"Labiodental refers to speech sounds made with the lower lip against the upper teeth, such as /f/ and /v/.","zh":"Labiodental 指用下唇接触上齿发出的唇齿音，如 /f/ 和 /v/。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to sounds made with the lower lip touching the upper teeth (like /f/ and /v/).","zh":"（语音）唇齿音的；指下唇接触上齿发出的语音（如 /f/、/v/）。"},"examples":[{"en":"In English, /f/ and /v/ are labiodental consonants.","zh":"在英语里，/f/ 和 /v/ 是唇齿辅音。"},{"en":"Try making a labiodental sound by lightly touching your upper teeth with your lower lip.","zh":"练习唇齿音时，让下唇轻轻碰到上齿即可发音。"}]},{"partOfSpeech":"n.","definition":{"en":"A labiodental sound (a consonant produced with the lower lip and upper teeth).","zh":"唇齿音；用下唇和上齿发出的辅音。"},"examples":[{"en":"/f/ is a labiodental.","zh":"/f/ 是一个唇齿音。"}]}],"synonyms":["lip-to-teeth (informal)","labiodental consonant (for the noun sense)"],"phonetic":"/ˌleɪbioʊˈdɛntəl/","extraExplanation":["你输入的拼写“labiodendal”常见的正确拼写是 **labiodental**。词源上，*labio-* 来自拉丁语表示“嘴唇”，*dental* 表示“牙齿”，合起来就是“唇—齿”。"]}
{"word":"labiodental","summary":{"en":"“Labiodental” describes sounds made with the lower lip against the upper teeth, such as /f/ and /v/.","zh":"“Labiodental” 指下唇接触上齿发出的语音（唇齿音），如 /f/、/v/。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In phonetics) made with the lower lip touching the upper teeth, like the sounds /f/ and /v/.","zh":"（语音学）用下唇接触上齿发出的（唇齿音），如 /f/、/v/。"},"examples":[{"en":"English /f/ in “fine” is a labiodental sound.","zh":"英语单词 fine 里的 /f/ 是唇齿音。"},{"en":"Many learners confuse labiodental /v/ with /w/ at first.","zh":"很多学习者一开始会把唇齿音 /v/ 和 /w/ 混淆。"}]}],"synonyms":["lip-to-teeth (descriptive)"],"phonetic":"/ˌleɪbi.oʊˈdɛn.təl/","extraExplanation":["发音小技巧：先把上齿轻轻放在下唇内侧边缘，气流从齿与唇的缝隙通过。/f/ 是清音（声带不振动），/v/ 是浊音（声带振动）。","常见对比：\n- /f/ vs /p/：/p/ 是双唇音（两片嘴唇闭合后爆破），/f/ 是唇齿摩擦音（持续摩擦）。\n- /v/ vs /w/：/w/ 主要是双唇圆唇加舌位变化，不需要上齿接触下唇。"]}
{"word":"labioglossal","summary":{"en":"Labioglossal means “involving the lips and the tongue,” usually in phonetics or anatomy.","zh":"labioglossal 指“与嘴唇和舌头相关/共同参与的”，多用于语音学或解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the lips and the tongue, especially in speech sounds or anatomy.","zh":"与嘴唇和舌头有关的，尤指语音（发音）或解剖学方面。"},"examples":[{"en":"Some consonants require labioglossal coordination between the lips and the tongue.","zh":"有些辅音需要嘴唇和舌头之间的唇舌协调。"},{"en":"The therapist focused on improving the patient’s labioglossal movement for clearer speech.","zh":"治疗师着重训练患者的唇舌运动，以让发音更清晰。"}]}],"synonyms":["labial-and-lingual","labio-lingual","orolabial (related)","lingual (related)"],"phonetic":"/ˌleɪbioʊˈɡlɑsəl/","extraExplanation":["这是一个较专业的术语，常见于语音学、语言治疗或解剖学语境。","词形可拆解为：labio-（唇）+ glosso-（舌）+ -al（……的）。理解词根有助于记忆同类词，如 labial（唇的）、glossal（舌的）。"]}
{"word":"labioglossolaryngeal","summary":{"en":"A rare technical adjective meaning “involving the lips, tongue, and larynx.”","zh":"一个少见的专业形容词，意为“涉及嘴唇、舌头和喉（喉头/声箱）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"involving the lips, the tongue, and the larynx (voice box), especially in anatomy, speech production, or medical descriptions","zh":"（尤用于解剖学、发音或医学描述中）涉及嘴唇、舌头和喉（喉头/声箱）的"},"examples":[{"en":"The doctor noted weakness of the labioglossolaryngeal muscles affecting speech and swallowing.","zh":"医生注意到唇-舌-喉相关肌群无力，影响了说话和吞咽。"},{"en":"In severe cases, labioglossolaryngeal control can be reduced, making pronunciation unclear.","zh":"在严重情况下，唇-舌-喉的控制能力会下降，导致发音不清。"}]}],"synonyms":["labio-glosso-laryngeal","labio-glosso-laryngeal (hyphenated form)","oropharyngeal (broader, not exact)","bulbar (related, broader)"],"phonetic":"/ˌleɪbi.oʊˌɡlɑːsoʊləˈrɪndʒiəl/","extraExplanation":["这是一个非常少见、偏专业的复合形容词，常见于医学（神经科/耳鼻喉科/语言治疗）语境，而不是日常英语。","构词可拆解理解：labio-（唇）+ glosso-（舌）+ laryngeal（喉/喉头）。看到这种长词时，抓住这些词根就能快速推断大意。","写作中更常见的形式是加连字符：labio-glosso-laryngeal。某些文献也会用更常见的上位词来概括相关问题，例如 bulbar（与延髓/球部相关的），但含义范围可能更宽。"]}
{"word":"labioglossopharyngeal","summary":{"en":"A rare adjective meaning “involving the lips, tongue, and pharynx,” used mainly in speech/medical contexts.","zh":"一个很少见的形容词，指“涉及嘴唇、舌头和咽部”，主要用于语音或医学相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the lips, tongue, and pharynx (throat), especially describing how these parts work together in speech or swallowing.","zh":"与嘴唇、舌头和咽（喉咙）有关的；尤指在发音或吞咽时这些部位协同作用。"},"examples":[{"en":"Some consonants require complex labioglossopharyngeal coordination.","zh":"有些辅音需要复杂的“唇—舌—咽”协同配合。"},{"en":"In speech therapy, clinicians may observe labioglossopharyngeal movement during swallowing tests.","zh":"在言语治疗中，临床人员可能会在吞咽测试时观察唇、舌与咽部的运动。"}]}],"synonyms":["oropharyngeal (related, broader)","articulatory (broader)"],"phonetic":"ˌleɪbioʊˌɡlɑsoʊfəˈrɪndʒiəl","extraExplanation":["这个词非常罕见，更多见于专业语境（语音学、解剖学、吞咽与言语治疗等），日常英语几乎不用。","词由三个构词成分组合而来：labio-（唇）、glosso-（舌）、pharyngeal（咽部的）。看到长词时，可以先按“器官/部位前缀 + 形容词后缀”去拆解理解。"]}
{"word":"labiograph","summary":{"en":"A labiograph is an instrument that records lip movements, mainly for speech or physiology research.","zh":"labiograph 指记录嘴唇运动的仪器，主要用于语音学或生理学研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to record or trace movements of the lips, especially in speech or physiological research","zh":"唇动记录仪；用于记录或描绘嘴唇运动的装置（常见于语音学或生理学研究）"},"examples":[{"en":"In the speech lab, researchers used a labiograph to measure how the lips move during /p/ and /b/.","zh":"在语音实验室里，研究人员用唇动记录仪测量发 /p/ 和 /b/ 时嘴唇的运动。"},{"en":"The old paper chart from the labiograph showed a clear change in lip pressure over time.","zh":"那张旧的唇动记录图表显示嘴唇压力随时间有明显变化。"}]}],"synonyms":["lip-movement recorder","lip-motion recorder","labial movement recorder"],"phonetic":"/ˈleɪbioʊˌɡræf/","extraExplanation":["这个词由 labio-（“嘴唇的”，源自拉丁语 labium）+ -graph（“记录/描画的装置”）构成，属于学术/技术用词，日常英语中很少见。","在语音学里，它可用于研究双唇音（如 /p/、/b/、/m/）或唇形变化；现代研究更常用摄像、运动捕捉或电磁发音仪等工具。"]}
{"word":"labiogression","summary":{"en":"“Labiogression” is not standard English; it’s likely a misspelling or rare coined term.","zh":"“labiogression”不是标准英语词，更可能是拼写错误或极少见的自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a coined/very rare term. If intended literally from parts, it could mean “a movement/process involving the lips (labio-) + a step/advance (-gression),” but this meaning is not established in normal usage.","zh":"不是常见词典里的标准英语词；更可能是拼写错误或自造/极少见用词。若按词根直译，可能表示“与嘴唇（labio-）有关的移动/过程（-gression）”，但这种含义并非英语中固定用法。"},"examples":[{"en":"I couldn’t find “labiogression” in a dictionary—can you share the sentence where you saw it?","zh":"我在词典里找不到“labiogression”——你能把看到它的句子发我吗？"},{"en":"Maybe you meant “labial” (related to the lips) or “aggression” (hostile behavior).","zh":"你可能想写的是“labial”（与嘴唇有关的）或“aggression”（攻击性/侵略行为）。"}]}],"phonetic":"/ˌleɪbioʊˈɡrɛʃən/","extraExplanation":["这个词很像由词根拼出来的“技术词”，但英语里并没有被广泛承认的固定用法。常见的相关前缀是 labio-（与嘴唇有关），而 -gression 常见于 progression（进展）、aggression（侵略/攻击）。\n\n如果你是在医学/语言学/牙科材料里看到的，可能是某个领域内部的术语、品牌名，或 OCR/输入法导致的拼写错误。把原句贴出来，我可以帮你判断最可能的正确词。"]}
{"word":"labioguttural","summary":{"en":"Labioguttural describes a speech sound produced with both the lips and the back of the tongue (a double articulation).","zh":"labioguttural 指一种“双重发音”的语音：同时用双唇和舌后部发出。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a speech sound) made with both the lips (labial) and the back of the tongue in the throat/velum area (guttural).","zh":"（指语音）同时用双唇（唇音）和舌后部在咽喉/软腭附近（喉音/后部）发出的。"},"examples":[{"en":"In some descriptions, /w/ is called a labioguttural sound because it uses lip rounding and a back-of-the-tongue gesture.","zh":"在一些描述中，/w/ 被称为“唇-喉音（labioguttural）”，因为它既有圆唇，又有舌后部的动作。"},{"en":"The teacher explained that certain consonants involve two places of articulation and may be described as labioguttural.","zh":"老师解释说，有些辅音涉及两个发音部位，因此可能被描述为“唇-喉音”。"}]}],"synonyms":["labial-velar","labiovelar","double-articulated"],"phonetic":"/ˌleɪbioʊˈɡʌtʃərəl/","extraExplanation":["这是语音学/历史语言学里较少见、偏旧的术语：labio-（唇）+ guttural（传统上指“喉部/舌后部”的音）。现代教材更常用更精确的说法，如 labiovelar（唇-软腭音）来描述类似 /w/ 或带圆唇的软腭辅音（如 kʷ、gʷ）。","guttural 在日常英语里有时泛指“喉音很重/粗哑”的声音，但在语言学术语中用它要结合具体语境理解。"]}
{"word":"labiolingual","summary":{"en":"Labiolingual means involving both the lips and the tongue, especially in speech articulation.","zh":"labiolingual 指与嘴唇和舌头都有关（常用于语音发音与构音描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the lips (labio-) and the tongue (lingual), especially in speech sounds or articulation.","zh":"（尤指语音发音）与嘴唇（labio-）和舌头（lingual）都有关的；唇-舌的。"},"examples":[{"en":"In phonetics class, we learned that some sounds involve labiolingual contact.","zh":"在语音学课上，我们学到有些音会涉及唇舌接触。"},{"en":"The therapist observed a labiolingual movement pattern during the child’s speech practice.","zh":"治疗师在孩子的发音练习中观察到一种唇舌联动的运动模式。"}]}],"synonyms":["labio-lingual","involving the lips and the tongue","lip-and-tongue (informal)"],"phonetic":"/ˌleɪbioʊˈlɪŋɡwəl/","extraExplanation":["这是一个相对少见、偏专业的术语，常见于语音学（phonetics）、言语治疗（speech therapy）等领域。它由前缀 labio-（“唇的”）和 lingual（“舌的”）组合而成，用来描述与“嘴唇+舌头”共同参与的发音动作或接触方式。日常英语里更常说“involving the lips and the tongue”。"]}
{"word":"labiomancy","summary":{"en":"Labiomancy means fortune-telling by observing a person’s lips.","zh":"Labiomancy 指通过观察嘴唇来进行占卜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Divination or fortune-telling by observing the lips (their shape, movement, or appearance).","zh":"通过观察嘴唇（形状、动作或外观）来进行占卜或预测命运。"},"examples":[{"en":"In an old book of occult practices, labiomancy was listed alongside palm reading and tea-leaf reading.","zh":"在一本关于神秘学的旧书里，labiomancy（观唇占卜）和看手相、茶叶占卜一起被列出。"},{"en":"The story mentions a seer who claims to practice labiomancy to predict a traveler’s future.","zh":"故事里提到一位先知声称会用观唇占卜来预测旅人的未来。"}]}],"synonyms":["divination","fortune-telling","mancy (suffix-related term)"],"phonetic":"/ˌleɪbiˈoʊmænsi/","extraExplanation":["这是一个非常罕见、偏“术语式”的词，日常英语里几乎不会用到；更多出现在讨论神秘学、占卜法分类的语境中。","词源结构很透明：labio- 表示“唇”（来自拉丁语 labium），-mancy 表示“占卜/预言”（常见于 chiromancy 看手相、necromancy 亡灵术 等词）。"]}
{"word":"labiomental","summary":{"en":"Labiomental means ‘involving the lips and the chin,’ used mainly in phonetics and speech/medical contexts.","zh":"labiomental 指“与嘴唇和下巴（颏部）相关”，多用于语音学及言语/医学等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to both the lips (labio-) and the chin (mental); in phonetics, describing speech sounds or articulation involving the lower lip and the chin/jaw area.","zh":"与“唇（labio-）”和“颏/下巴（mental）”都有关的；在语音学中，指与下唇及下巴/下颌区域相关的发音或发音动作。"},"examples":[{"en":"The therapist noted a labiomental posture during speech.","zh":"治疗师注意到他说话时有一种唇—颏部位相关的口部姿势。"},{"en":"In some descriptions, labiomental contact can occur when the lower lip is pulled tightly against the chin area.","zh":"在一些描述中，当下唇被紧紧拉向下巴区域时，可能出现唇—颏接触。"}]}],"synonyms":["labio-mental","chin-related (contextual)","orofacial (broader)"],"phonetic":"/ˌleɪbi.oʊˈmɛn.təl/","extraExplanation":["这是一个比较专业的术语，常见于语音学、言语治疗、解剖学或牙科/正畸相关语境中。它由两部分组成：labio-（唇）+ mental（颏、下巴；这里的 mental 不是“心理的”）。","在语音学里更常见的相关术语是 labiodental（唇齿音，如英语 /f/、/v/），而 labiomental 用得相对少，通常用于描述口面部肌肉/姿势或非常具体的发音接触部位。"]}
{"word":"labionasal","summary":{"en":"A phonetics term meaning a sound made using the lower lip and upper teeth (often used where ‘labiodental’ is intended).","zh":"语音学术语，指用下唇和上齿参与的发音（很多情况下实际想表达的是更常见的 labiodental“唇齿音”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In phonetics) involving both the lower lip and the upper teeth; describing a speech sound made with this contact (like /f/ or /v/ in English).","zh":"（语音学）唇齿音的；指用下唇接触上齿来发出的语音（如英语中的 /f/、/v/）。"},"examples":[{"en":"The sounds /f/ and /v/ are labionasal in the sense that they use the lower lip and upper teeth.","zh":"/f/ 和 /v/ 这些音在发音时会用到下唇和上齿，可称为唇齿相关的发音。"},{"en":"Some learners substitute a different sound because they are not used to making a labionasal contact.","zh":"有些学习者会用别的音来替代，因为他们不习惯用下唇和上齿接触来发音。"}]}],"synonyms":["labiodental","lip-tooth"],"phonetic":"/ˌleɪbioʊˈneɪzəl/","extraExplanation":["更常见、标准的术语是 **labiodental（唇齿音）**，而不是 labionasal。**nasal（鼻音）** 指气流主要从鼻腔出来（如 /m/、/n/），通常不和“下唇＋上齿”这一部位组合在一起。你可能是想查 **labiodental**。","如果你是在看某些语言学资料，labionasal 也可能被用作“与唇相关并带鼻化/鼻音特征”的描述，但这不是英语语音学里最常用的分类名称；建议结合原文语境确认作者的用法。"]}
{"word":"labiopalatal","summary":{"en":"Labiopalatal describes a sound made with lip rounding and a palatal tongue position at the same time.","zh":"labiopalatal 指一种发音：同时圆唇并把舌面抬向硬腭。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Made with two actions at the same time: rounding the lips (labio-) while raising the tongue toward the hard palate (palatal).","zh":"（语音学）同时用两种发音动作形成：嘴唇圆唇/唇化（labio-）并且舌面抬向硬腭（palatal）。"},"examples":[{"en":"French has a labiopalatal sound [ɥ] in the word huit (“eight”).","zh":"法语里有一个唇-腭音 [ɥ]，比如在单词 huit（“八”）中。"},{"en":"The glide [ɥ] is often described as a labiopalatal approximant.","zh":"滑音 [ɥ] 常被描述为“唇-腭近音（labiopalatal approximant）”。"}]}],"synonyms":["labio-palatal","labial-palatal"],"phonetic":"/ˌleɪbioʊˈpælət̬əl/","extraExplanation":["这个词主要出现在语言学/语音学教材或论文中，日常英语很少用。","常见写法包括 labiopalatal、labio-palatal，有时也会看到同义的 labial-palatal。","与一般的“palatal（腭音）”相比，labiopalatal 强调还带有明显的圆唇动作；可以把它理解为“带圆唇的腭音”。"]}
{"word":"labiopalatalize","summary":{"en":"“Labiopalatalize” is a technical linguistics verb meaning to make a sound both labial (with lip rounding) and palatal (with a tongue gesture toward the hard palate).","zh":"“labiopalatalize”是一个语言学术语动词，指使语音同时具有唇化（圆唇）与腭化（靠近硬腭的舌势）特征。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Linguistics) To change a sound so it is pronounced with both lip rounding (labial) and a tongue position near the hard palate (palatal), often creating a “labial‑palatal” quality.","zh":"（语言学）使某个语音在发音时同时带有“唇化”（圆唇/用唇参与）和“腭化”（舌头靠近硬腭）的特征，从而形成“唇-腭化”的音质。"},"examples":[{"en":"In some analyses, a consonant may be described as being labiopalatalized if it involves both rounding and a palatal tongue gesture.","zh":"在某些分析中，如果一个辅音同时包含圆唇和腭部舌势，就可能被描述为发生了唇-腭化。"},{"en":"The researcher used the term “labiopalatalize” to explain why the sound shifted toward a /w/‑like and /j/‑like quality.","zh":"研究者用“labiopalatalize（唇-腭化）”来解释为什么这个音的音质同时向类似 /w/ 和 /j/ 的方向变化。"}]}],"synonyms":["palatalize","labialize","labialize"],"phonetic":"/ˌleɪbioʊˈpælətəˌlaɪz/","extraExplanation":["这个词非常偏专业，在一般英语语境中很少见；更多时候会用更常见的术语来拆开说，比如“labialize（唇化）”和“palatalize（腭化）”。","理解要点：labio- 表示“唇”，palatal 表示“腭”，-ize 表示“使……化/使……成为……”。它描述的是发音方式的变化，而不是拼写变化。"]}
{"word":"labiopalatine","summary":{"en":"An adjective meaning “related to the lips and the palate.”","zh":"形容词：指“与嘴唇和腭（上颚）都有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the lips (labio-) and the palate (palatine), especially in anatomy, dentistry, or speech science.","zh":"与嘴唇（labio-）和腭/上颚（palatine）两者都有关的，常用于解剖学、牙科或语音学等语境。"},"examples":[{"en":"The dentist examined the patient’s labiopalatine area.","zh":"牙医检查了患者的唇-腭相关部位。"},{"en":"The report mentioned a possible labiopalatine abnormality.","zh":"报告提到可能存在唇-腭相关的异常。"}]}],"synonyms":["labio-palatal","labial-palatine (less common)"],"phonetic":"/ˌleɪbioʊˈpælətɪn/","extraExplanation":["这个词是医学/专业词汇，由前缀 labio-（唇）+ palatine（腭的）构成，常见于讨论“唇腭裂（cleft lip and palate）”等先天结构问题或相关手术/评估时。","也可写作 labio-palatal（带连字符），意义相同；在不同学科或期刊中拼写可能略有差异。"]}
{"word":"labiopharyngeal","summary":{"en":"A rare medical adjective meaning “related to the lips and the pharynx.”","zh":"一个罕见的医学形容词，表示“与嘴唇和咽部有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the lips (labio-) and the pharynx (pharyngeal); involving these two areas.","zh":"与嘴唇（labio-）和咽部/咽腔（pharyngeal）都有关的；涉及这两个部位的。"},"examples":[{"en":"The doctor checked for any labiopharyngeal irritation after the procedure.","zh":"手术后，医生检查是否有任何唇—咽部的刺激或不适。"},{"en":"Researchers described a rare labiopharyngeal abnormality affecting swallowing.","zh":"研究人员描述了一种影响吞咽的罕见唇—咽部异常。"}]}],"synonyms":["labial and pharyngeal","oropharyngeal (sometimes related, but not the same)"],"phonetic":"/ˌleɪbioʊfəˈrɪndʒiəl/","extraExplanation":["这是一个非常少见、偏医学/解剖学用语的复合词：labio- 表示“唇”，pharyngeal 表示“咽部”。多见于医学报告或学术写作，不是日常英语。","在语音学里更常见的相关术语是 labio-（唇部发音）与 pharyngeal（咽部发音）分别讨论；把两者合在一起的说法并不常用，通常用于描述同时涉及这两个部位的结构或问题。"]}
{"word":"labioplasty","summary":{"en":"Labioplasty is surgery to alter the labia, for comfort/medical reasons or cosmetic reasons.","zh":"Labioplasty 指通过手术改变阴唇形态，可能出于舒适/医疗需求或外观考虑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure that changes the size or shape of the labia (the folds of skin around the vaginal opening), usually for medical comfort or cosmetic reasons","zh":"阴唇整形术：一种改变阴唇（阴道口周围皮肤皱襞）大小或形状的外科手术，常见原因包括不适的医疗需求或外观方面的考虑"},"examples":[{"en":"She talked with a gynecologist to understand the risks and benefits of labioplasty.","zh":"她和妇科医生沟通，了解阴唇整形术的风险与益处。"},{"en":"Some people consider labioplasty because enlarged labia can cause discomfort during exercise.","zh":"有些人会考虑阴唇整形术，因为阴唇较大可能在运动时造成不适。"}]}],"synonyms":["labia reduction","labial reduction","vulvar surgery"],"phonetic":"/ˌleɪbiəˈplæsti/","extraExplanation":["这是一个医学与私密健康相关的词，日常对话中相对少见，多出现在医疗咨询、健康科普或整形外科语境中。","语境上常与 informed consent（知情同意）、risks and complications（风险与并发症）、recovery time（恢复期）、gynecologist（妇科医生）等搭配。","涉及身体与隐私话题时，不同文化对“是否谈论、如何谈论”敏感度不同；用词保持中性、尊重（例如用 medical/comfort 等词）通常更合适。"]}
{"word":"labiose","summary":{"en":"Labiose means “lipped” or “lip-shaped,” mainly in scientific descriptions.","zh":"Labiose 指“具唇状结构的/呈唇形的”，主要用于科学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) having lips; shaped like lips; “lipped” (often used in biology/botany to describe parts that look like lips).","zh":"（罕见，偏专业）有“唇”的；呈唇形的；“具唇状结构的”（常用于生物/植物学，形容看起来像嘴唇的部位）。"},"examples":[{"en":"Some orchids have labiose petals that look like a little mouth.","zh":"有些兰花的花瓣呈唇形，看起来像一个小嘴。"},{"en":"In older descriptions, the flower was called labiose because its lower part forms a lip.","zh":"在较早的描述中，这种花被称为 labiose，因为它的下部形成一个“唇”。"}]}],"synonyms":["labial","labiate","lipped"],"phonetic":"/ˈleɪbiˌoʊs/","extraExplanation":["这个词在现代日常英语中几乎不用，多见于较老的科学描述或形态学（形状特征）描写里。","词源上与拉丁语 labium（“唇”）有关，近义表达更常见的是 labial（唇的/唇状的）或 labiate（具唇状结构的，尤用于植物学）。"]}
{"word":"labiotenaculum","summary":{"en":"A rare medical term for a tenaculum used to hold the lip or labial tissue during a procedure.","zh":"一个较少见的医学名词，指用于夹持固定唇部或唇状组织的牵引钳（tenaculum）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical instrument (a kind of tenaculum/forceps) used to grasp and hold a lip or labial tissue (such as the lip of the mouth, or other “labial” tissues) during a procedure.","zh":"一种医疗器械（类似带钩的夹持钳/牵引钳 tenaculum），用于在手术或操作中夹持并固定“唇部/唇状（labial）”组织（如口唇等）。"},"examples":[{"en":"The surgeon used a labiotenaculum to gently hold the lip while placing sutures.","zh":"外科医生用唇牵引钳轻轻固定嘴唇，以便缝合。"},{"en":"In older surgical notes, a labiotenaculum may be listed among the basic grasping instruments.","zh":"在较早的手术记录里，唇牵引钳可能会被列为常用的夹持器械之一。"}]}],"synonyms":["tenaculum","tissue forceps","grasping forceps"],"phonetic":"/ˌleɪbioʊtəˈnækjələm/","extraExplanation":["这个词非常少见，多见于专业医学/器械目录或旧式文献中。构词上可拆为 labio-（与“唇/唇状组织”有关）+ tenaculum（拉丁语来源，意为“抓住/钩住的器具”，常指带钩的夹持牵引器）。在现代临床中，更常见的写法与分类是直接用 tenaculum 并注明具体部位或用途。"]}
{"word":"labiovelar","summary":{"en":"Labiovelar describes (or names) a sound made with both the lips and the velum (soft palate) at the same time, such as /w/ or /kʷ/.","zh":"labiovelar 指（或指称）一种同时用到嘴唇和软腭构音的语音，如 /w/ 或 /kʷ/。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Made with two simultaneous constrictions: one with the lips (labial) and one with the back of the tongue near the soft palate/velum (velar).","zh":"（语音学）“唇-软腭”的：发音时同时用到嘴唇（唇音）和舌后部靠近软腭/舌根（软腭音）的双重构音。"},"examples":[{"en":"In many West African languages, /kʷ/ and /gʷ/ are described as labiovelar consonants.","zh":"在许多西非语言中，/kʷ/ 和 /gʷ/ 常被描述为唇-软腭辅音。"},{"en":"English /w/ is often analyzed as a labiovelar approximant.","zh":"英语中的 /w/ 常被分析为唇-软腭近音。"}]},{"partOfSpeech":"n.","definition":{"en":"A labiovelar sound (a consonant) produced with labial and velar articulation at the same time.","zh":"唇-软腭音（指一种辅音）：通过唇部与软腭部位同时构音产生的语音。"},"examples":[{"en":"Some descriptions treat /w/ as a labiovelar.","zh":"有些描述会把 /w/ 视为一种唇-软腭音。"}]}],"synonyms":["labial-velar","labialized (related)"],"phonetic":"/ˌleɪbioʊˈviːlər/","extraExplanation":["在国际音标（IPA）里，“唇化”的软腭音常写作 kʷ、gʷ（右上角的 ʷ 表示唇化，即发音时嘴唇同时圆拢）。严格说，“labiovelar（唇-软腭）”常指两处都形成明显构音的音，而“labialized（唇化）”更常用来表示“在原本的辅音上加上圆唇的伴随动作”。不同教材对 /w/ 是否算“真正的唇-软腭音”也可能有差异。"]}
{"word":"labiovelarisation","summary":{"en":"Labiovelarisation is a linguistic feature where a sound is produced with both lip rounding and a velar (soft-palate) component.","zh":"labiovelarisation 指一种语音特征：发音时同时出现圆唇（唇化）与软腭成分（舌后部靠近软腭）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) the process or feature of pronouncing a sound with simultaneous lip rounding (labial) and a velar (“soft palate”) articulation; also called labiovelarization.","zh":"（语言学）唇-软腭化：发音时同时带有“唇化”（圆唇）和“软腭”（舌后部靠近软腭）成分的过程或语音特征；也常写作 labiovelarization。"},"examples":[{"en":"In some accents, /r/ may show labiovelarisation, sounding slightly rounded and backed.","zh":"在某些口音里，/r/ 可能出现唇-软腭化，听起来会有点圆唇并且舌位更靠后。"},{"en":"The teacher explained that labiovelarisation can change the “color” of a consonant without creating a new phoneme.","zh":"老师解释说，唇-软腭化会改变辅音的“音色”，但不一定形成新的音位。"}]}],"synonyms":["labiovelarization","labialization (in some contexts)","rounding (in some contexts)"],"phonetic":"ˌleɪbioʊˌviːləraɪˈzeɪʃən","extraExplanation":["这是一个较专业的语音学/音系学术语。常见的相关符号是上标小“w”（如 [kʷ]、[tʷ]），表示辅音带有圆唇的“次要调音”。","labiovelarisation（英式拼写）与 labiovelarization（美式拼写）意义相同；学术文章中两种拼写都可能出现。"]}
{"word":"labiovelarise","summary":{"en":"A phonetics term meaning “to add both lip rounding and velar (back-of-tongue) articulation to a sound.”","zh":"语音学术语：指“让一个音同时带圆唇和软腭（舌后部）发音特征”，常有类似[w]的伴随音色。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Phonetics) To pronounce a sound with both lip rounding (labial) and a “back-of-the-tongue” articulation near the velum (velar), adding a co-articulated [w]-like quality.","zh":"（语音学）使某个音带有“唇音化 + 软腭化”的双重特征发音：嘴唇圆唇（唇部参与）同时舌后部靠近软腭发音，听起来常带一点类似[w]的伴随音色。"},"examples":[{"en":"In some languages, speakers may labiovelarise a consonant before a back rounded vowel.","zh":"在一些语言中，说话者可能会在圆唇后元音前把辅音做唇软腭化。"},{"en":"The teacher asked students to labiovelarise the sound to match the target accent.","zh":"老师让学生把这个音做唇软腭化，以更贴近目标口音。"}]}],"synonyms":["labiovelarize","labialize (broader)","add labial-velar coarticulation"],"phonetic":"/ˌleɪbioʊˈviːləˌraɪz/","extraExplanation":["这是一个比较专业的语音学动词，常见于音系学/田野语言学描述中。更常见的拼写是美式/通用写法 **labiovelarize**（-ize），英式写法常用 **labiovelarise**（-ise）。","“labiovelar-”指“唇（labio-）+ 软腭（velar）”。典型例子是很多语言里的**唇软腭塞音** /k͡p/、/ɡ͡b/，或把某些辅音加上[w]样的圆唇伴随特征。","相关术语：**labialization**（唇音化，常指加圆唇特征）、**velarization**（软腭化，常指“暗l”那种舌后抬高的音色）、**coarticulation**（协同发音）。"]}
{"word":"labiovelarised","summary":{"en":"A linguistic term meaning “pronounced with lip-rounding as an added articulation,” often noted as [ʷ] (like [kʷ]).","zh":"语言学术语：指发音时额外带有圆唇的次要发音动作，常用 [ʷ] 标记（如 [kʷ]）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(linguistics) Pronounced with lip-rounding (a secondary “w-like” articulation) while the main sound is made elsewhere in the mouth, often at the velum (soft palate).","zh":"（语言学）发音时同时伴随圆唇（类似 /w/ 的次要发音动作），而主要发音部位在口腔其他位置；常见于软腭（velum）附近的辅音。"},"examples":[{"en":"In some accents, the /k/ in “cool” is labiovelarised, so it sounds slightly like /kw/.","zh":"在某些口音里，“cool” 里的 /k/ 会唇—软腭化（labiovelarised），听起来有点像 /kw/。"},{"en":"A labiovelarised consonant can be written with a small “w”, for example [kʷ].","zh":"唇—软腭化的辅音有时用一个小写的 “w” 标出来，比如 [kʷ]。"}]}],"synonyms":["labiovelarized","labialized","with lip-rounding","rounded"],"phonetic":"/ˌleɪbioʊˈviːləraɪzd/","extraExplanation":["这是一个偏专业的语音学/音系学术语，常见写法还有 **labiovelarized**（美式拼写）和 **labialized**（更常用、更宽泛：泛指“圆唇的次要发音”）。","“labiovelarised” 通常强调：圆唇动作与“软腭/舌后部”的主要发音同时发生，因此常见于像 [kʷ], [gʷ] 这类音标。并不是所有“圆唇”都一定算 labiovelarised；有时只称为 labialized 更合适。"]}
{"word":"labiovelarising","summary":{"en":"“Labiovelarising” is a phonetics term meaning adding lip rounding and a w-like (velar) quality to a sound, or the process of doing so.","zh":"“labiovelarising”是语音学术语，指给某个音增加圆唇与类似 /w/ 的（软腭）特征，或指这种变化过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Phonetics) adding lip rounding and a “w”-like (velar) quality to a sound; causing a sound to be pronounced with both the lips and the back of the tongue involved.","zh":"（语音学）使某个音带有圆唇并带有类似 /w/ 的（软腭）特征；即在发音时同时使用嘴唇与舌后部的动作。"},"examples":[{"en":"In some accents, a consonant can become labiovelarising before a back rounded vowel.","zh":"在一些口音中，辅音在圆唇后元音前可能出现唇-软腭化（labiovelarising）。"},{"en":"The speaker’s pronunciation shows a labiovelarising effect that makes the sound slightly more “w”-like.","zh":"这位说话者的发音表现出唇-软腭化效应，使该音听起来更偏“w”的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of making a sound labiovelar; labial-velar coarticulation (often discussed as a type of secondary articulation).","zh":"使某个音变成唇-软腭音的过程；唇部与软腭部位的协同发音（常被视为一种“次要调音”现象）。"},"examples":[{"en":"Labiovelarising can be described as a kind of secondary articulation in phonetic analysis.","zh":"在语音分析中，唇-软腭化可以被描述为一种次要调音。"},{"en":"Researchers measured labiovelarising by tracking lip rounding during consonant production.","zh":"研究者通过追踪辅音发音时的圆唇程度来测量唇-软腭化。"}]}],"synonyms":["labiovelarizing","labial-velar coarticulation","labiovelarization"],"phonetic":"/ˌleɪbioʊˈviːləraɪzɪŋ/","extraExplanation":["“labiovelarising”多见于语音学/音系学写作，属于相对专业的术语。常见相关概念：\n- labialization（唇化）：主要强调圆唇；\n- velarization（软腭化）：强调舌后部靠近软腭（常见例子是英语“dark L” /ɫ/ 的感觉）；\n- labiovelar（唇-软腭音）：像英语 /w/ 这类同时涉及圆唇与舌后部抬起的音。\n在实际听感上，“labiovelarising”往往意味着某个音更接近 /w/ 或更“圆”“厚”。"]}
{"word":"labiovelarization","summary":{"en":"Labiovelarization is a phonetic feature where a sound is pronounced with added lip rounding and a velar (w-like) quality, often marked as ʷ in IPA.","zh":"Labiovelarization（唇软腭化）是指发音时附加圆唇并带软腭（类似[w]）色彩的语音特征，IPA常用ʷ标记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In phonetics/phonology, the addition or strengthening of lip-rounding (labial) and a simultaneous “back-of-the-tongue” (velar) quality in the pronunciation of a sound, often noted with a small raised “w” (ʷ) in the IPA.","zh":"（语音学/音系学）指在发音时增加或加强“圆唇”（唇音特征）并同时带有“舌后部靠近软腭”（软腭化/近似[w]的）色彩的现象，国际音标中常用上标小“w”（ʷ）标记。"},"examples":[{"en":"In some languages, a consonant may show labiovelarization, written in IPA as ʷ, as in [kʷ].","zh":"在一些语言中，辅音可能出现唇软腭化（labiovelarization），在国际音标中写作上标ʷ，例如[kʷ]。"},{"en":"English often has slight labiovelarization before /u/ in words like “cool,” because the lips round early.","zh":"英语里在/u/之前常会有轻微的唇软腭化，比如“cool”，因为圆唇动作会提前出现。"}]}],"synonyms":["labialization (related)","secondary articulation (broader term)"],"phonetic":"/ˌleɪbioʊˌvɛləraɪˈzeɪʃən/","extraExplanation":["“labiovelarization”可以理解为两种动作叠加：嘴唇更圆（像要发[w]那样）+舌后部更靠近软腭（带一点“后、暗”的音色）。因此它常被看作一种“次要调音（secondary articulation）”。","IPA里常用的标记是上标ʷ，例如[kʷ]、[tʷ]。学习时可把它与“labialization（唇化）”区分：后者强调圆唇；而“labiovelarization”通常暗示更接近[w]的整体效果。"]}
{"word":"labiovelarize","summary":{"en":"“Labiovelarize” means to pronounce a sound with both lip rounding and a secondary velar (back-of-tongue) articulation.","zh":"“labiovelarize”指把某个音发成同时带“唇圆化”和“软腭化（舌后部抬起）”的发音方式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Phonetics) To pronounce a sound with added lip rounding and a secondary articulation made by raising the back of the tongue toward the soft palate (the velum).","zh":"（语音学）使某个音在发音时加入“唇圆化”，并同时把舌后部抬向软腭（velum）形成次要的软腭化（唇-软腭化）。"},"examples":[{"en":"In some languages, speakers labiovelarize certain consonants before back vowels.","zh":"在一些语言中，说话者会在后元音前把某些辅音唇-软腭化。"},{"en":"If you labiovelarize the consonant, your lips round slightly while the back of your tongue moves upward.","zh":"如果你把这个辅音唇-软腭化，你的嘴唇会略微圆起来，同时舌后部会向上抬。"}]}],"synonyms":["labialize","velarize","round (a consonant)"],"phonetic":"ˌleɪbioʊˈwɛləraɪz","extraExplanation":["“labiovelarize”主要用于语音学/语言学写作中，日常英语很少用。它描述的是一种“共时发音”（secondary articulation）：在发一个主要辅音的同时，叠加类似[w]那样的唇圆与软腭动作。","相关概念：labialize（唇化，强调嘴唇动作）、velarize（软腭化，强调舌后部动作）；labiovelarize = 两者同时发生。"]}
{"word":"labiovelarized","summary":{"en":"Labiovelarized describes a sound made with lip rounding plus a velar (back-of-the-tongue) quality, often like adding a slight “w” sound.","zh":"labiovelarized 指发音时同时圆唇并带软腭（舌后部）性质的音，常听起来像在辅音后轻微加了“w”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Pronounced with simultaneous lip rounding (labialization) and a velar (back-of-the-tongue) constriction; having added “w-like” lip rounding plus a velar quality.","zh":"（语音学）带有唇化并同时具有软腭（舌后部）收缩特征的发音；也可理解为带“w”式圆唇并伴随软腭性质的音。"},"examples":[{"en":"In some languages, a consonant may be labiovelarized, so it sounds slightly like it has a “w” after it.","zh":"在一些语言中，辅音可能会出现唇-软腭化，因此听起来像后面带了一点“w”的感觉。"},{"en":"The transcription often uses a superscript w to show a labiovelarized consonant, like [kʷ].","zh":"音标转写常用上标 w 表示唇-软腭化的辅音，例如 [kʷ]。"}]}],"synonyms":["labialized (often used more broadly in phonetics)","with lip-rounding (contextual paraphrase)"],"phonetic":"/ˌleɪbioʊˈwiːləraɪzd/","extraExplanation":["“labiovelarized”主要用于语音学/音系学描述，不是日常词汇。它强调两个动作“叠加”：一是嘴唇圆起（类似发 [w] 的唇形），二是舌后部靠近软腭形成辅音的主要阻碍（如 [k]、[g] 的部位）。","注意区分：labiovelarized（唇-软腭化）是一种“附加的发音特征/次要调音”；而“labiovelar consonant（唇软腭辅音）”常指把唇与软腭作为主要发音部位的辅音（例如 [w] 或某些语言中的 [k͡p] 这类音）。"]}
{"word":"labiovelarizing","summary":{"en":"Labiovelarizing means adding both lip-rounding and a velar (back-of-tongue) quality to a sound, making it labiovelar.","zh":"Labiovelarizing 指给语音同时加入圆唇与软腭（舌后部）特征，使其成为唇软腭化的发音。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(phonetics/linguistics) Adding a simultaneous lip-rounding (“labial”) and back-of-the-tongue (“velar”) quality to a sound; the process of making a sound labiovelar.","zh":"（语音学/语言学）给一个语音同时加上“唇化（圆唇）”和“软腭化（舌后部靠近软腭）”的特征；使该语音变成唇软腭化（labiovelar）的过程。"},"examples":[{"en":"In careful speech, some speakers may be labiovelarizing the consonant slightly, making it sound more like [kʷ].","zh":"在较为谨慎的发音中，有些说话者可能会把这个辅音轻微地唇软腭化，使它听起来更像[kʷ]。"},{"en":"The analysis suggests the language is labiovelarizing velar stops before back vowels.","zh":"分析显示，这种语言在后元音前会把软腭塞音进行唇软腭化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a sound or articulation that involves labiovelarization (often used as a participle modifier).","zh":"用于描述带有唇软腭化特征的语音或发音动作（常作分词形容词用）。"},"examples":[{"en":"A labiovelarizing gesture can make the consonant sound more rounded.","zh":"唇软腭化的发音动作会让这个辅音听起来更“圆唇”。"},{"en":"Some transcriptions mark this as a labiovelarizing secondary articulation.","zh":"有些转写会把它标作一种唇软腭化的次要调音。"}]}],"synonyms":["labiovelarizing (secondary articulation)","adding lip-rounding and velarization","rounding with velar articulation"],"phonetic":"/ˌleɪbioʊˈwiːləraɪzɪŋ/","extraExplanation":["“labiovelarizing”来自动词“labiovelarize”（唇+软腭+使……化）。在国际音标（IPA）里，常用上标ʷ表示唇化，如[kʷ]；这表示主要调音在软腭部位，同时伴随圆唇。","英语里的[w]常被称为“唇软腭近音”（labiovelar approximant），因为它通常同时涉及圆唇和舌后部抬起。不同语言对唇软腭化的强弱与分布规则可能不同。"]}
{"word":"labioversion","summary":{"en":"A dental term meaning a tooth is displaced or tilted toward the lips.","zh":"牙科术语：指牙齿向嘴唇一侧发生偏移或倾斜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dentistry) the position or movement of a tooth toward the lips (the labial side), often describing a tooth that tilts or is displaced outward.","zh":"（牙科）牙齿朝向嘴唇一侧（唇侧）的偏移或倾斜，常指牙齿向外突出的位移。"},"examples":[{"en":"The dentist noted a slight labioversion of the upper front tooth.","zh":"牙医注意到上门牙有轻微的唇向倾斜（唇侧偏移）。"},{"en":"Braces can help correct crowding and reduce labioversion.","zh":"牙套可以帮助矫正拥挤，并减轻牙齿的唇向偏移。"}]}],"synonyms":["labial displacement","labial tipping"],"phonetic":"/ˌleɪbioʊˈvɝʒən/","extraExplanation":["词源上，labio- 表示“嘴唇/唇侧”，-version 表示“转向/偏转”。在牙科记录里，它通常用来描述牙齿相对牙弓的方向性偏移（朝唇侧），与“舌向/腭向偏移”等方向术语相对。","日常英语里很少用到这个词，更多出现在牙科病历、正畸报告或学术写作中。"]}
{"word":"labis","summary":{"en":"“Labis” is not standard English; it’s a Tagalog/Filipino word meaning “too much” or “excess/surplus.”","zh":"“labis”不是标准英语词，源自菲律宾语，意思是“太多/过量”或“多余/剩余”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Borrowed from Tagalog/Filipino) excess; too much; an amount beyond what is needed.","zh":"（源自他加禄语/菲律宾语）过量；过多；超出所需的数量。"},"examples":[{"en":"In Filipino, “labis” means “too much” or “excess.”","zh":"在菲律宾语里，“labis”表示“太多/过量”。"},{"en":"Try not to add labis sugar to your coffee.","zh":"咖啡里尽量别加过量的糖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Borrowed from Tagalog/Filipino) an excess; surplus; something extra beyond the normal amount.","zh":"（源自他加禄语/菲律宾语）剩余；多出来的部分；额外的量。"},"examples":[{"en":"They donated the labis food to neighbors.","zh":"他们把多出来的食物捐给了邻居。"},{"en":"There was labis after the party, so we saved it for tomorrow.","zh":"聚会后还有剩余，所以我们留到明天。"}]}],"synonyms":["excess","too much","surplus","extra","overabundance"],"phonetic":"/ˈlɑbɪs/","extraExplanation":["“labis”不是标准英语词汇，更常见于菲律宾语语境或菲律宾英语（Philippine English）中，表示“过量/多余”。在正式英语写作里，通常用“excess / too much / surplus / extra”来表达相同意思。"]}
{"word":"labite","summary":{"en":"“Labite” is not standard English; it’s usually a typo or a name, and sometimes refers to the French vulgar phrase “la bite.”","zh":"“labite” 不是标准英语词，多为拼写错误或专有名词；有时也指法语粗俗短语 “la bite”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling (e.g., “a bite,” “rabbit,” “labite” as a name) or as the French phrase “la bite” (vulgar slang).","zh":"不是标准英语单词。常见情况是拼写错误（如把 “a bite”“rabbit” 写成 labite，或作为姓名/姓氏），也可能是法语短语 “la bite”（粗俗俚语）。"},"examples":[{"en":"I couldn’t find “labite” in standard English dictionaries—did you mean “a bite” or “rabbit”?","zh":"在常见英语词典里找不到 “labite”——你是不是想写 “a bite” 或 “rabbit”？"},{"en":"If you meant the French “la bite,” note that it’s very offensive slang and shouldn’t be used in polite conversation.","zh":"如果你指的是法语 “la bite”，要注意它是非常粗俗、冒犯性的俚语，不适合在礼貌场合使用。"}]}],"phonetic":"/lə baɪt/","extraExplanation":["如果你告诉我你是在什么句子、哪本书/哪条评论里看到 “labite”，我可以帮你判断它到底是拼写错误、专有名词（人名/地名/品牌），还是法语用法。","从学习英语角度，最可能的目标词是：\n- a bite（咬一口/被咬）：I took a bite of the sandwich.\n- rabbit（兔子）：A rabbit ran across the road."]}
{"word":"labium","summary":{"en":"Labium means a lip or lip-like structure in anatomy, especially the labia of the vulva; in insects, it refers to the “lower lip” mouthpart.","zh":"Labium 指解剖学中的“唇”或唇状结构，尤指外阴的阴唇；在昆虫学中指口器的“下唇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In anatomy) One of the “lips” or lip-like folds of tissue, especially the lips of the vulva (labia).","zh":"（解剖学）“唇”或类似嘴唇的组织褶皱，尤指外阴的阴唇（labia）。"},"examples":[{"en":"In human anatomy, the labium is a lip-like fold of tissue, such as the labia of the vulva.","zh":"在人类解剖学中，labium 指唇状的组织褶皱，例如外阴的阴唇。"},{"en":"The doctor explained that swelling can occur on the labium due to irritation or infection.","zh":"医生解释说，刺激或感染可能导致阴唇部位（labium）肿胀。"}]},{"partOfSpeech":"n.","definition":{"en":"(In zoology/insect anatomy) A mouthpart in insects often called the “lower lip.”","zh":"（动物学/昆虫解剖）昆虫的口器之一，常被称为“下唇”。"},"examples":[{"en":"Many insects use the labium to help handle food.","zh":"许多昆虫用 labium（下唇）来帮助处理食物。"},{"en":"Under the microscope, the labium and other mouthparts are easier to identify.","zh":"在显微镜下，labium 和其他口器更容易辨认。"}]}],"synonyms":["lip","labia"],"phonetic":"/ˈleɪbiəm/","extraExplanation":["词源提示：labium 来自拉丁语，意思是“嘴唇”。在医学英语里更常见的是复数形式 labia（阴唇），单数 labium 有时用于更专业或更具体的描述。","使用提醒：这是解剖与生物学术语，日常对话中不常用；在医疗语境下建议配合更明确的结构名称（如 labia majora/minora：大/小阴唇）以避免歧义。"]}
{"word":"lablab","summary":{"en":"“lablab” is informal slang, usually a cute way to say “love/my love,” or a playful misspelling of “lab.”","zh":"“lablab”多为非正式用语：常见为“love / my love”的可爱写法，也可能只是“lab”的玩笑式拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, internet slang) A playful or baby-talk way to say “love” or “my love,” used to show affection.","zh":"（非正式/网络用语）“love / my love”的撒娇式写法，用来表达亲昵、喜欢或爱意。"},"examples":[{"en":"Good night, lablab.","zh":"晚安，lablab（亲爱的/宝贝）。"},{"en":"Miss you, lablab!","zh":"想你啦，lablab！"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling or stylized repetition of “lab” (short for laboratory), sometimes used jokingly or in usernames.","zh":"“lab”（实验室/实验）的拼写变体或重复写法，有时用于玩笑、网名或随手输入。"},"examples":[{"en":"I’ll be in the lablab all afternoon working on experiments.","zh":"我整个下午都在“lablab”（实验室）做实验。"}]}],"synonyms":["love (slang use)","my love","babe","baby","lab (if meaning laboratory)"],"phonetic":"/ˈlæb.læb/","extraExplanation":["“lablab”并不是标准英语词典里的常见词，更常见于聊天、昵称或社交媒体。很多时候它是把“love”用更可爱/黏人的方式写出来（类似中文的“爱爱/宝贝”语气），具体含义要看语境和说话人的习惯。"]}
{"word":"labo","summary":{"en":"“labo” is an informal or name-style form meaning “lab/laboratory,” sometimes also referring to a research group.","zh":"“labo”多指“实验室/ lab”的非正式或命名式写法，也可指研究团队（研究室）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A lab; a laboratory (often used in speech, brand names, or as a shortened form).","zh":"（非正式）实验室；“lab / laboratory”的口语缩写（常见于口头表达、品牌名或简称）。"},"examples":[{"en":"I’ll be in the labo all afternoon running tests.","zh":"我整个下午都会在实验室里做测试。"},{"en":"Our school’s robotics labo is open after class.","zh":"我们学校的机器人实验室下课后开放。"},{"en":"The sample is stored in the labo fridge.","zh":"样品放在实验室的冰箱里。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in names) A research group or lab team (short for “laboratory”), common in some universities and companies.","zh":"（尤用于名称）研究室／研究团队（“laboratory”的简称），在一些大学或公司里常见。"},"examples":[{"en":"She joined the Tanaka Labo to study materials science.","zh":"她加入了田中研究室来学习材料科学。"},{"en":"Their Labo publishes a paper every semester.","zh":"他们的研究团队每学期都会发表论文。"}]}],"synonyms":["lab","laboratory","research lab"],"phonetic":"/ˈleɪboʊ/","extraExplanation":["“labo”在英语里不是最标准的拼写，更常见的是“lab”。但在一些语境（尤其是日本/东亚高校的“研究室”文化、或品牌与社团命名）里，“Labo”会被当作“Laboratory/研究室”的固定写法。正式写作（论文、报告）建议用“lab/laboratory”。"]}
{"word":"labor","summary":{"en":"Labor most commonly means work/effort or the workforce; it can also mean the process of giving birth, and as a verb it means to work with difficulty.","zh":"labor 最常指“劳动/劳动力”，也可指“分娩”；作动词时表示“费力地工作/努力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Work, especially physical work or work that takes effort; also the workers as a group.","zh":"劳动；（尤指）体力劳动、费力的工作；也可指劳工群体（统称“劳动者”）。"},"examples":[{"en":"Farm labor is hard work, especially in summer.","zh":"农场劳动很辛苦，尤其在夏天。"},{"en":"The company depends on skilled labor to build its products.","zh":"这家公司依靠熟练劳动力来生产产品。"}]},{"partOfSpeech":"v.","definition":{"en":"To work hard; to make a great effort over time (often + over/under).","zh":"努力工作；费力地做某事（常与 over / under 搭配）。"},"examples":[{"en":"They labored over the report for weeks.","zh":"他们为这份报告辛苦忙了好几个星期。"},{"en":"She labored under the stress of constant deadlines.","zh":"她在持续的截止期限压力下苦撑着。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of giving birth; the time when a baby is being born.","zh":"分娩；临产过程。"},"examples":[{"en":"She went into labor late at night.","zh":"她深夜开始阵痛临产。"},{"en":"Her labor lasted twelve hours.","zh":"她的产程持续了十二个小时。"}]}],"synonyms":["work","effort","toil","workforce"],"phonetic":"/ˈleɪbɚ/","extraExplanation":["在美国英语里，labor（劳动/劳工）也常出现在社会与政治语境中，比如 “labor union（工会）”“organized labor（有组织的劳工力量）”。","拼写差异：美式多写作 labor，而英式常见 labour（含同义），例如 “labour party（工党）” 是英式政治语境里常见说法。","作为动词时，labor 常带有“费力、艰难”的语气，比 work 更强调辛苦与持续努力。"]}
{"word":"laborability","summary":{"en":"Laborability is a rare noun meaning the capacity to work or the practical workability of something.","zh":"Laborability 是一个罕见名词，表示能劳动/能工作的能力，或某事在现实中是否可行、可操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The ability or capacity to do work or to be used for labor; practical workability.","zh":"（不常用）可劳动性；能够从事劳动/完成工作的能力；可操作性（能否用于实际工作）。"},"examples":[{"en":"The manager questioned the laborability of the new schedule because it left no time for training.","zh":"经理质疑新排班的可劳动性，因为它完全没有留出培训时间。"},{"en":"In older writing, laborability sometimes refers to whether a plan is workable in real conditions.","zh":"在较早的写法里，laborability 有时指一个计划在现实条件下是否“行得通”。"}]}],"synonyms":["workability","feasibility","capacity for work","employability"],"phonetic":"/ˌleɪbərəˈbɪləti/","extraExplanation":["这个词在现代英语里非常少见，很多母语者也不常用。写作或正式表达中通常会改用更常见、更清晰的词：\n- 强调“可被雇用/就业能力”：employability\n- 强调“是否行得通/可操作”：workability / feasibility\n- 强调“有工作能力/能干活”：ability to work / capacity for work\n另外，英式拼写可能出现 labourability，但同样罕见。"]}
{"word":"laborable","summary":{"en":"Laborable means workable/manageable, and sometimes (of land) able to be cultivated; it is rare in modern English.","zh":"Laborable 指“可做的/可处理的”，有时也指（土地）“可耕作的”；在现代英语中较少用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Able to be worked on with effort; workable or manageable.","zh":"（较少用）可以通过努力来完成的；可处理的；可做的。"},"examples":[{"en":"The plan sounded ambitious, but it was laborable with enough time and help.","zh":"这个计划听起来很宏大，但只要有足够的时间和帮助，是可以完成的。"},{"en":"We need a laborable schedule, not one that burns everyone out.","zh":"我们需要一个可执行的时间表，而不是把大家都累垮的那种。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, especially about land) Able to be worked or cultivated; suitable for farming.","zh":"（较少用，尤指土地）可耕作的；适合耕种的。"},"examples":[{"en":"Only a small part of the island is laborable because the soil is thin and rocky.","zh":"由于土层薄且多石，这座岛只有一小部分土地可耕作。"},{"en":"They searched for laborable land near a water source.","zh":"他们在水源附近寻找可耕作的土地。"}]}],"synonyms":["workable","feasible","manageable","arable","cultivable"],"phonetic":"/ˈleɪbərəbəl/","extraExplanation":["“laborable”在现代英语中比较罕见，日常表达里更常用“workable / feasible”（指计划、方案可行）或“arable / cultivable”（指土地可耕作）。","词形来自“labor（劳动）+ -able（能够……的）”，含义直观，但因为“workable/arable”更常用，所以它多见于较正式或较老的文本中。"]}
{"word":"laborage","summary":{"en":"Laborage (more commonly spelled laborage) is a rare word meaning “labor/effort,” and in maritime English it can mean the allowed time for loading or unloading a ship.","zh":"Laborage（更常见拼作 laborage）是个罕见词，可指“劳动/辛劳”；在航运英语中也可指船舶装卸所允许的时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) work; the act of laboring; effort spent on doing a task.","zh":"（罕见/古用）劳动；做事的辛劳与付出。"},"examples":[{"en":"The garden looked beautiful after months of careful laborage.","zh":"经过数月细心的辛劳打理，这座花园看起来很美。"},{"en":"In older writings, laborage can simply mean hard work.","zh":"在较早的文字里，laborage 有时就指“辛苦的工作”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Technical, maritime) the time allowed for loading or unloading a ship (similar to laytime).","zh":"（航运术语）装卸船舶所允许的时间（类似 laytime“允许装卸时间”）。"},"examples":[{"en":"The contract specified the laborage for unloading at the port.","zh":"合同规定了在港口卸货的允许装卸时间。"},{"en":"If the laborage is exceeded, the charterer may pay extra fees.","zh":"如果超过允许装卸时间，承租方可能需要支付额外费用。"}]}],"synonyms":["labor","work","effort","laytime (maritime)"],"phonetic":"/ˈleɪbərɪdʒ/","extraExplanation":["“Laborage”在现代英语中非常少见，更常见的拼法是“laborage”，而且多见于较老的文本或特定行业（如航运合同）。日常表达“劳动/辛苦”通常用 work, labor, effort；航运语境里常用 laytime（允许装卸时间）以及 demurrage（滞期费）。","如果你是在作业、文章或合同里看到这个词，建议把原句发来，我可以帮你判断它到底是“古用的劳动”还是“航运装卸时间”的意思。"]}
{"word":"laborant","summary":{"en":"A laborant is a laboratory assistant or technician.","zh":"laborant 指实验室助理/化验员/实验室技术员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a laboratory assistant or technician who helps run experiments, prepare materials, and handle basic lab tasks (more common in European/academic contexts than in everyday American English).","zh":"（实验室）助理；化验员；实验室技术员（在欧洲/学术语境更常见，美式日常英语里较少用）。"},"examples":[{"en":"The laborant prepared the samples before the researcher started the experiment.","zh":"实验室助理在研究人员开始实验前准备好了样品。"},{"en":"In the university lab, a laborant is responsible for cleaning glassware and organizing chemicals.","zh":"在大学实验室里，化验员负责清洗玻璃器皿并整理化学品。"},{"en":"She worked as a laborant in a hospital laboratory, assisting with routine tests.","zh":"她在医院检验科当化验员，协助完成常规检测。"}]}],"synonyms":["lab assistant","lab technician","laboratory assistant","technician"],"phonetic":"/ˈlæbərənt/","extraExplanation":["“laborant”在美式英语里不算常用，更常见的对应说法是“lab assistant”“lab technician”或在医院里说“medical laboratory technician/technologist”。","词源上与“laboratory（实验室）”同根，但不要与“laborer（体力劳动者）”混淆：两者拼写相近、意义不同。"]}
{"word":"laborare","summary":{"en":"“Laborare” is a Latin verb meaning “to work/toil,” and sometimes “to suffer or struggle.”","zh":"“laborare”是拉丁语动词，主要意为“劳动/辛勤工作”，也可引申为“受苦、挣扎”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin, infinitive) to work; to labor; to toil.","zh":"（拉丁语，不定式）工作；劳动；辛勤劳作。"},"examples":[{"en":"In Latin, “laborare” means “to work.”","zh":"在拉丁语里，“laborare”意思是“工作/劳动”。"},{"en":"Monks often quoted: “Laborare est orare.” (To work is to pray.)","zh":"修道院传统中常引用：“Laborare est orare。”（劳动即祈祷。）"},{"en":"Farmers had to laborare all day to finish the harvest.","zh":"农人不得不整天辛勤劳作，才能完成收割。"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin) to suffer; to undergo hardship (because work and difficulty are closely linked).","zh":"（拉丁语）受苦；经历艰难（因为“劳动”和“困苦”在语义上常相连）。"},"examples":[{"en":"He seemed to laborare under many worries.","zh":"他似乎在许多忧虑之下受苦。"},{"en":"In poetry, “laborare” can suggest struggling through pain.","zh":"在诗歌语境中，“laborare”可暗示在痛苦中挣扎前行。"}]}],"synonyms":["work","labor","toil","strive","struggle"],"phonetic":"/ˌlæbəˈrɑːreɪ/","extraExplanation":["“laborare”是拉丁语动词不定式，和英语的 labor（劳动）、laborious（费力的）、elaborate（精心制作/详尽阐述，原义也含“费力做出来”）同源。","古罗马与后来的基督教传统中，劳动常被视为一种德行，所以会出现“Laborare est orare”（劳动即祈祷）这类格言。另一个常见拉丁语格言是“Labor omnia vincit”（劳动/努力战胜一切，出自维吉尔《牧歌》）。"]}
{"word":"laboratorial","summary":{"en":"Formal adjective meaning “related to a laboratory; done in a lab.”","zh":"较正式的形容词，表示“与实验室有关；在实验室中进行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a laboratory or to work done in a laboratory (especially in science or medicine).","zh":"（尤指科学或医学）与实验室有关的；在实验室中进行的。"},"examples":[{"en":"The samples were sent for laboratorial analysis.","zh":"这些样本被送去做实验室分析。"},{"en":"Laboratorial results confirmed the infection.","zh":"实验室结果证实了感染。"}]}],"synonyms":["laboratory","lab","experimental"],"phonetic":"/ˌlæbəɹəˈtɔɹiəl/","extraExplanation":["“laboratorial”是比较正式、偏学术的用词，日常英语里更常用“laboratory”（作形容词用，如 laboratory tests / laboratory conditions）或“lab”（更口语，如 lab work）。","常见搭配：laboratorial analysis（实验室分析）、laboratorial tests/results（实验室检测/结果）、laboratorial conditions（实验室条件）。","拼写上与英式用法更常见的“laboratory”相关；“laboratorial”在不同地区、不同学科的写作中出现频率不高，但含义清晰。"]}
{"word":"laboratorially","summary":{"en":"“Laboratorially” means “in a laboratory way or under lab conditions.”","zh":"“laboratorially”表示“以实验室方式进行；在实验室条件下”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a laboratory; under laboratory conditions.","zh":"以实验室的方式；在实验室条件下。"},"examples":[{"en":"The drug was tested laboratorially before any human trials began.","zh":"这种药物在开始任何人体试验之前，先在实验室条件下进行了测试。"},{"en":"Laboratorially, the results looked promising, but real-world performance was weaker.","zh":"从实验室角度看，这些结果很有希望，但在现实环境中的表现较弱。"}]}],"synonyms":["in the laboratory","under laboratory conditions","in a lab","in vitro"],"phonetic":"/ˌlæbrəˈtɔriəli/","extraExplanation":["“laboratorially”在日常英语中很少见，学术写作里偶尔出现。更自然、更常用的表达通常是：\n- “in the laboratory”/“in a lab”（在实验室里）\n- “under laboratory conditions”（在实验室条件下）\n- “in vitro”（体外实验，常用于生物医学语境）"]}
{"word":"laboratorian","summary":{"en":"A trained person who works in a lab doing scientific or medical testing and analysis.","zh":"在实验室从事科学或医学检测与分析的专业人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works in a laboratory, especially someone trained to do scientific tests, experiments, or medical analyses.","zh":"在实验室工作的人，尤指受过训练、负责进行科学检测、实验或医学检验的人。"},"examples":[{"en":"The laboratorian prepared the samples before the tests began.","zh":"检验人员在检测开始前准备好了样本。"},{"en":"In the hospital, a laboratorian helps doctors by analyzing blood and tissue.","zh":"在医院里，检验人员通过分析血液和组织来帮助医生。"}]}],"synonyms":["laboratory technician","lab technician","medical laboratory scientist","clinical laboratory scientist"],"phonetic":"/ˌlæbəɹəˈtɔɹiən/","extraExplanation":["“laboratorian”在美式英语中常见于医疗与临床语境（如 clinical laboratorian），指医学检验相关从业者。日常口语里也常用更宽泛的“lab technician（实验室技师）”或“lab scientist（实验室科学家）”。","词根来自“laboratory（实验室）”，后缀“-ian”常表示“从事某领域的人”（如 musician 音乐家、librarian 图书管理员）。"]}
{"word":"laboratories","summary":{"en":"“Laboratories” means more than one laboratory—places where experiments, testing, or research are done.","zh":"“laboratories”是“laboratory”的复数，指多个进行实验、检测或研究的实验室。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place (often in a school, university, hospital, or company) where scientific tests, experiments, or research are done.","zh":"实验室：进行科学测试、实验或研究的地方（常见于学校、大学、医院或公司）。"},"examples":[{"en":"The students worked in the chemistry laboratory all afternoon.","zh":"学生们整个下午都在化学实验室里做实验。"},{"en":"The hospital laboratory tests blood samples every day.","zh":"医院的实验室每天检测血液样本。"},{"en":"She works in a research laboratory developing new medicines.","zh":"她在研究实验室工作，开发新药。"}]},{"partOfSpeech":"other","definition":{"en":"The plural form of “laboratory.”","zh":"“laboratory”的复数形式。"},"examples":[{"en":"Our university has several laboratories for biology and engineering.","zh":"我们大学有好几间生物和工程实验室。"},{"en":"The new building includes computer laboratories and study rooms.","zh":"新大楼里有计算机实验室和自习室。"}]}],"synonyms":["labs","research facilities","testing facilities"],"phonetic":"/ˈlæbrəˌtɔri/","extraExplanation":["在美式英语里，常说 lab（实验室）作为口语缩写：chem lab（化学实验室）、computer lab（电脑机房/计算机实验室）。","发音小提示：美式英语里 laboratory 常读作 /ˈlæbrəˌtɔri/（重音在第一个音节）。英式读法有时不同，但这里提供的是常见的美式读音。"]}
{"word":"laboratorium","summary":{"en":"“Laboratorium” is a rare/older form of “laboratory,” meaning a place for experiments and research.","zh":"“laboratorium”是较少见/较旧的“laboratory（实验室）”形式，指进行实验和研究的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare in modern English) A laboratory; a place equipped for scientific research, experiments, or technical work.","zh":"（现代英语中较少用）实验室；进行科学研究、实验或技术工作的场所。"},"examples":[{"en":"The university built a new laboratorium for chemistry and materials research.","zh":"这所大学新建了一座用于化学与材料研究的实验室。"},{"en":"In older academic writing, you may see “laboratorium” where today we would simply write “laboratory.”","zh":"在较早的学术写作中，你可能会看到用“laboratorium”，而如今通常直接写“laboratory（实验室）”。"}]}],"synonyms":["laboratory","lab"],"phonetic":"/ˌlæbəˈtɔriəm/","extraExplanation":["“laboratorium”源自拉丁语，意思与“laboratory”相同。在现代英语里它非常少见，多出现在历史文献、拉丁化的学术语境，或受其他语言影响的英语文本中（例如某些欧洲地区的机构名称）。","如果你是在学习现代日常英语，通常用“laboratory”或更口语的“lab”。"]}
{"word":"laboratory","summary":{"en":"A laboratory is a place where experiments and scientific work are done; it can also mean a “testing ground” in a figurative sense.","zh":"laboratory 指进行实验与科研工作的“实验室”；也可比喻为“试验场”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A room or building where scientific tests, experiments, and research are done, often using special equipment.","zh":"（科学）实验室；进行测试、实验和研究的房间或建筑，通常配有专门设备。"},"examples":[{"en":"The samples were analyzed in the laboratory.","zh":"样本是在实验室里分析的。"},{"en":"She works in a medical laboratory at the hospital.","zh":"她在医院的医学实验室工作。"},{"en":"Safety rules are strict in the laboratory.","zh":"实验室里的安全规定很严格。"}]},{"partOfSpeech":"n.","definition":{"en":"A place for careful testing and development of ideas, methods, or products (often used figuratively).","zh":"（比喻）试验场；用来检验和发展想法、方法或产品的地方。"},"examples":[{"en":"The city became a laboratory for new transportation policies.","zh":"这座城市成了新交通政策的试验场。"},{"en":"The classroom is a laboratory for learning and trying new skills.","zh":"教室是学习与尝试新技能的“实验室”。"}]}],"synonyms":["lab","research lab","testing facility","workshop (figurative)","testing ground (figurative)"],"phonetic":"/ˈlæbrəˌtɔri/","extraExplanation":["“laboratory”常见缩写是“lab”。在英式英语中，“laboratory”有时读作 /ləˈbɒrət(ə)ri/（重音与元音可能不同），美式常见读法是本条给出的 /ˈlæbrəˌtɔri/。","词源上与拉丁语“labor”（劳动、工作）有关，强调在这里进行“工作性/研究性”的操作与实验。"]}
{"word":"labordom","summary":{"en":"Labordom means the world or collective group of workers (organized labor); more rarely, the state of being a laborer.","zh":"labordom 指“劳工界/工人阶层（整体）”，较少也可指“作为劳动者的状态或生活”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the group or world of workers and working people (laborers) as a whole; organized labor","zh":"（总称）工人阶层；劳动者群体；工会/劳工界"},"examples":[{"en":"Politicians often promise policies that will help labordom.","zh":"政治家常常承诺会出台有利于劳工界的政策。"},{"en":"The strike drew support from labordom across the country.","zh":"这次罢工得到了全国各地劳工界的支持。"}]},{"partOfSpeech":"n.","definition":{"en":"the state or condition of being a laborer; working-class life (rare)","zh":"（较少用）劳动者的身份或生活状态；工人生活"},"examples":[{"en":"He wrote about the hardships of labordom during the Great Depression.","zh":"他写到了大萧条时期工人生活的艰辛。"}]}],"synonyms":["the working class","workers","labor","organized labor","trade unions"],"phonetic":"/ˈleɪbərdəm/","extraExplanation":["“labordom”并不算常见词，更多出现在政治、历史或新闻语境里，用来概括“劳工界/工人阶层”。","后缀“-dom”表示“领域、状态或群体”（如：kingdom 王国，freedom 自由，officialdom 官僚机构）。因此“labordom”字面上就是“劳动者的领域/群体”。","更日常的表达通常用：the working class（工人阶级），workers（工人/劳动者），organized labor（有组织的劳工/工会）。"]}
{"word":"labored","summary":{"en":"Labored means ‘done with great effort’ or ‘(breathing) difficult and heavy.’","zh":"labored 表示“费力的、艰难的”，也可指“（呼吸）困难沉重的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done with a lot of effort and difficulty; not smooth or easy.","zh":"费力的；艰难的；不顺畅的。"},"examples":[{"en":"He spoke in a labored voice after the long run.","zh":"长跑之后，他说话声音很费力。"},{"en":"Her writing felt labored and unnatural.","zh":"她的写作读起来有些生硬、不自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of breathing) slow, heavy, and difficult, often because of illness, stress, or exhaustion.","zh":"（呼吸）沉重而困难的，常因疾病、压力或疲劳导致。"},"examples":[{"en":"The nurse noticed his breathing was labored.","zh":"护士注意到他的呼吸很困难。"},{"en":"After climbing the stairs, my breathing became labored.","zh":"爬完楼梯后，我的呼吸变得很费力。"}]}],"synonyms":["strained","effortful","forced","heavy","difficult"],"phonetic":"/ˈleɪbɚd/","extraExplanation":["“labored”常用来形容“表达/写作/动作”显得刻意、用力过猛（不够自然），也常用于医学或新闻语境描述“呼吸困难”（labored breathing）。","词根来自“labor（劳动）”，所以核心感觉是“像在劳动一样费劲”。在写作点评里，labored 往往带一点负面评价：不是“认真”，而是“太用力而不流畅”。"]}
{"word":"laboredly","summary":{"en":"Laboredly means “with great effort” or “in a forced, unnatural way,” depending on context.","zh":"laboredly 表示“费力地、吃力地”，也可指“表达生硬、牵强（用力过猛）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow, difficult, and effortful way, as if it takes a lot of energy or is hard to do.","zh":"费力地；吃力地；艰难地（以缓慢、困难、需要很大努力的方式）"},"examples":[{"en":"He climbed the hill laboredly, stopping every few steps to catch his breath.","zh":"他吃力地爬上山坡，每走几步就停下来喘口气。"},{"en":"She spoke laboredly after the long run, her voice tight with fatigue.","zh":"长跑之后她费力地说话，声音因疲惫而紧绷。"},{"en":"The old engine started laboredly, coughing and rattling.","zh":"那台旧发动机费力地启动，咳嗽般地抖动作响。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that feels forced, overworked, or unnatural (often used about writing, speech, or humor).","zh":"生硬地；牵强地（常用于形容文章、表达或幽默显得用力过猛、不自然）"},"examples":[{"en":"The essay moves laboredly from point to point, with few clear transitions.","zh":"这篇文章从一个观点转到另一个观点显得很生硬，几乎没有清晰的过渡。"},{"en":"He laughed laboredly at the joke, as if he didn’t really find it funny.","zh":"他对那个笑话笑得很勉强，仿佛并不觉得好笑。"}]}],"synonyms":["with difficulty","painfully","ardously","heavily","awkwardly"],"phonetic":"ˈleɪbɚdli","extraExplanation":["“laboredly”来自形容词“labored”（费力的；也可指“雕琢过度的、显得做作的”）。因此它既能描述身体上的吃力（呼吸、攀爬、机器运转），也能描述表达方式“用力过猛”的感觉。","近义词使用上有细微差别：表示“费力地”时常用 **with difficulty / painfully / arduously**；表示“生硬、做作地”时可用 **awkwardly / heavily / forcedly**（后者较少见）。"]}
{"word":"laboredness","summary":{"en":"Laboredness means a strained, effortful quality—either in physical actions (like breathing) or in expression (writing/speech that feels forced).","zh":"Laboredness 指“费力、紧绷”的特质，可描述身体动作（如呼吸吃力）或表达方式（写作/讲话显得刻意、用力过猛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of feeling slow, difficult, or requiring a lot of effort; heaviness or strain in doing something","zh":"费力、吃力的状态；做某事时显得沉重或紧绷的感觉"},"examples":[{"en":"After the long climb, there was a laboredness in his breathing.","zh":"长时间爬坡后，他的呼吸显得很吃力。"},{"en":"You could hear the laboredness in her voice as she tried to stay calm.","zh":"当她努力保持冷静时，你能听出她声音里的吃力与紧绷。"}]},{"partOfSpeech":"n.","definition":{"en":"in writing, speech, or art: an unnatural, forced, or overworked quality (as if too much effort is showing)","zh":"（写作、讲话或艺术作品中）刻意、做作、过于用力的感觉（让人感觉“太用力了”）"},"examples":[{"en":"The essay’s laboredness made the argument feel less natural.","zh":"这篇文章的刻意感让论证显得不够自然。"},{"en":"He tried to be funny, but the jokes had a laboredness that fell flat.","zh":"他想搞笑，但笑话太做作，结果冷场了。"}]}],"synonyms":["strain","effortfulness","heaviness","awkwardness","forcedness"],"phonetic":"/ˈleɪbərdnəs/","extraExplanation":["“laboredness”来自形容词“labored”（费力的；刻意的）+ 名词后缀“-ness”。它在日常口语中不算特别常用，更常见的替换说法有：\n- 身体/呼吸方面：“labored breathing”（费力呼吸）、“strain”（紧绷/吃力）\n- 文风/表达方面： “awkwardness”（别扭）、“forced tone”（刻意的语气）、“overwriting”（过度修饰的写法）\n\n在描述写作时，“laboredness”通常带有轻微负面评价：表示作者努力过头，反而不自然。"]}
{"word":"laborem","summary":{"en":"*laborem* is Latin for “work/toil” (or “hardship”), in the accusative form used as an object.","zh":"*laborem* 是拉丁语中“劳动/辛劳”（也可指“艰难/困苦”）的宾格形式，常用作宾语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin, accusative singular of *labor*) “work,” “toil,” or “effort” as the direct object of a verb.","zh":"（拉丁语，*labor* 的宾格单数）“劳动/工作”“辛劳”“努力”，常作动词的宾语。"},"examples":[{"en":"*Laborem* tolero. (I endure hard work.)","zh":"*Laborem* tolero.（我忍受辛劳/艰苦的工作。）"},{"en":"He studied Latin and learned that *laborem* is the object form of *labor* (“work”).","zh":"他学拉丁语时了解到 *laborem* 是 *labor*（劳动/工作）的宾格形式。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension in Latin texts: “hardship,” “trouble,” or “suffering” (something difficult you undergo).","zh":"在拉丁语文本中可引申为“艰难/困苦”“麻烦”“痛苦”（经历的艰辛）。"},"examples":[{"en":"They faced *laborem* on the journey. (They faced hardship on the journey.)","zh":"他们在旅途中遭遇 *laborem*。（他们在旅途中遭遇艰难/困苦。）"}]}],"synonyms":["(Latin) opus","(Latin) labor","(Latin) fatīgātiō"],"phonetic":"/ləˈbɔrɛm/","extraExplanation":["*laborem* 常见于“Lorem ipsum”占位文本中（如“dolorem ipsum…”一类片段）。这里的 *dolorem*（痛苦）和 *laborem*（辛劳）都是拉丁语的宾格形式，原本来自古典拉丁语句子，被打乱后用于排版示例。","拉丁语里名词会因句法功能变化词尾：*labor*（主格：作为主语）→ *laborem*（宾格：作为宾语）。这就是为什么你会在句子里看到它而不是 *labor*。"]}
{"word":"laborer","summary":{"en":"A laborer is someone who does mainly physical work, often in jobs like construction or farming.","zh":"laborer 指主要从事体力劳动的工人，常见于建筑、农场等岗位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does physical work, especially work that does not require special training or a skilled trade.","zh":"（通常指不需要专业技能的）体力劳动者；普工。"},"examples":[{"en":"The construction company hired several laborers to move bricks and clean the site.","zh":"这家建筑公司雇了几名普工搬砖并清理工地。"},{"en":"He worked as a day laborer during the summer to earn extra money.","zh":"他夏天做日结工来赚点外快。"}]}],"synonyms":["worker","manual laborer","hand","workman","day laborer"],"phonetic":"/ˈleɪbərər/","extraExplanation":["在美式英语里，laborer 常指“从事体力劳动的工人”，带有“非技术工种/基础岗位”的含义；如果要表达更中性、更广义的“劳动者”，有时也会用 worker。","拼写上是 laborer（美式），英式常见 labourer。","文化语境中，laborer 常与 construction laborer（建筑工/工地普工）、farm laborer（农场雇工）、day laborer（日结工）等搭配使用。"]}
{"word":"laborers","summary":{"en":"“Laborers” means people who do manual, physical work, often paid by wages; it can also refer to workers as a group in discussions of labor rights.","zh":"“Laborers”指从事体力劳动的工人/劳工，也可在讨论劳工权益时指某一群体的雇佣劳动者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who do hard physical work, especially jobs that require strength rather than specialized training.","zh":"（通常指）从事体力劳动的人；工人（多指靠体力而非专业技能工作的劳动者）。"},"examples":[{"en":"The construction site hired more laborers to finish the road on time.","zh":"为按时完工，建筑工地雇了更多体力工人来修路。"},{"en":"Many laborers start work early and spend long hours outdoors.","zh":"许多体力劳动者很早开工，并在户外工作很长时间。"}]},{"partOfSpeech":"n.","definition":{"en":"People who work for wages, especially in manual or industrial work (often used when talking about working conditions or labor rights).","zh":"雇佣劳动者；劳工（常用于讨论工作条件、劳工权益等语境）。"},"examples":[{"en":"The law was designed to protect laborers from unsafe workplaces.","zh":"这项法律旨在保护劳工免受不安全工作环境的伤害。"},{"en":"The union negotiated better pay for the laborers.","zh":"工会为劳工谈判争取了更高的薪资。"}]}],"synonyms":["workers","manual workers","hands","workmen","labor force"],"phonetic":"/ˈleɪbərərz/","extraExplanation":["“laborers”是“laborer”的复数。美式英语里更常用拼写“laborer”，英式英语常见“labourer”。","语体上，“laborers”偏中性/正式；日常口语里也常说“workers”。但“laborers”更强调体力劳动或在政策、法律、工会语境中的“劳工群体”。"]}
{"word":"labores","summary":{"en":"“Labores” is not a standard English spelling; in English it’s usually “labors” (US) or “labours” (UK), meaning efforts/work, and sometimes childbirth processes in plural contexts.","zh":"“labores”不是常见标准英文拼写；英文通常写作“labors”（美式）或“labours”（英式），主要指“劳动/付出”，在特定语境也可指多个“分娩过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “labor”) work that requires effort; tasks or activities done to achieve something.","zh":"（“labor”的复数）劳动；需要付出努力的工作/任务。"},"examples":[{"en":"After months of labors, the team finally finished the project.","zh":"经过几个月的辛勤工作，团队终于完成了项目。"},{"en":"We honored the volunteers for their labors in the community.","zh":"我们表彰了志愿者们为社区付出的劳动。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of “labor”) the process of giving birth (common in medical contexts, usually uncountable as “labor,” but plural can appear when talking about multiple cases).","zh":"（“labor”的复数）分娩；临产（医学语境中常用“labor”作不可数；谈到多个病例时可用复数）。"},"examples":[{"en":"The study compared labors that began naturally with those that were induced.","zh":"这项研究比较了自然临产与引产的分娩过程。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of the verb “labor”: to work hard; to make a great effort (often used with “over,” “under,” or “to”).","zh":"动词“labor”的第三人称单数：努力工作；费力地做（常与 over/under/to 搭配）。"},"examples":[{"en":"She labors over every sentence to make the meaning clear.","zh":"她为每一句话都反复推敲，以确保意思清楚。"},{"en":"He labors to support his family.","zh":"他辛苦工作来养家。"}]}],"synonyms":["work","effort","toil","exertion","hard work"],"phonetic":"ˈleɪbɚ","extraExplanation":["“labores”本身不是常见的标准英文拼写。英文里通常写作 **labors**（美式）或 **labours**（英式）。如果你是在西班牙语里看到 **labores**，它常指“家务/杂务”或“针线活、手工活”等，需要看具体语境。","词源上 **labor** 来自拉丁语 *labor*（辛劳、劳动）。在文学或较正式的英文里，你会看到复数 **labors** 用来强调“长期艰辛的付出”，如 “the fruits of one’s labors”（劳动成果）。"]}
{"word":"laboress","summary":{"en":"A rare, old-fashioned word meaning a female laborer (a woman doing manual work).","zh":"一个罕见且较旧的词，意思是“女工/女性体力劳动者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, old-fashioned) A woman who works as a laborer, especially doing heavy or manual work.","zh":"（罕见/旧式用法）女工；女性体力劳动者（尤指从事繁重或体力劳动的人）。"},"examples":[{"en":"In the old record, she is listed as a labouress on a nearby farm.","zh":"在那份旧档案里，她被登记为附近农场的女工。"},{"en":"The museum exhibit describes the lives of miners and labouresses in the 1800s.","zh":"博物馆展览讲述了19世纪矿工与女工的生活。"}]}],"synonyms":["laborer","worker","manual worker","farmworker"],"phonetic":"/ˈleɪbərəs/","extraExplanation":["“laboress”更常见的拼写是英式英语“labouress”。在现代英语里，这种按性别区分的职业名词较少使用，通常直接说“laborer/worker”（工人、劳动者），更自然也更中性。","有时学习者把“laboress”误写成“laborious”（费力的、艰苦的，形容词）。如果你想表达“工作很费力”，更可能需要的是“laborious”。"]}
{"word":"laborhood","summary":{"en":"Laborhood is a rare word meaning a worker-centered community or, figuratively, the identity of being part of the labor force.","zh":"Laborhood 是较少见的词，指以劳动者为中心的社区，也可比喻指“作为劳动者/劳动力一员的身份”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A community, district, or social environment associated with working people and labor life; a “worker neighborhood.”","zh":"（较少见）以工人、劳动生活为特征的社区/区域；可理解为“工人社区/劳动者街区”。"},"examples":[{"en":"The factory’s closure changed the laborhood more than anyone expected.","zh":"工厂关闭对这个工人社区的影响比任何人预想的都大。"},{"en":"Writers sometimes use “laborhood” to highlight working-class identity in a place.","zh":"作者有时用“laborhood”来突出某个地方的工人阶级身份。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, figurative) The condition or identity of being part of the labor force; workerhood.","zh":"（较少见，比喻）作为劳动者/劳动力一员的身份或状态；“劳动者身份”。"},"examples":[{"en":"She spoke about dignity in laborhood and the pride of skilled work.","zh":"她谈到劳动者身份的尊严，以及对熟练工作的自豪感。"}]}],"synonyms":["working-class neighborhood","labor community","workers' community","workerhood"],"phonetic":"/ˈleɪbərˌhʊd/","extraExplanation":["“laborhood”不是常见标准词，更像是仿造“neighborhood（街区）/brotherhood（兄弟情谊）”这类结构的创造性用法，用来强调“劳动者的共同体/工人阶级的生活圈”。","在正式写作中，更常见的表达是“working-class neighborhood（工人阶级社区）”“labor community（劳工群体/社区）”或“the labor movement（劳工运动）”。","英式拼写常见“labour”，若看到“labourhood”，多半也是同样的创造性用法，而非固定词条。"]}
{"word":"laborieux","summary":{"en":"“laborieux” is a French word meaning “laborious” (requiring much effort) and sometimes “hardworking.” In English, use “laborious.”","zh":"“laborieux”是法语词，意思相当于“laborious”（费力的、艰苦的），有时也指“勤奋的”。英语中更建议用“laborious”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from French) hard and requiring a lot of effort, time, or careful work; laborious.","zh":"（源自法语）费力的；需要花很多时间或精力的；艰苦的。"},"examples":[{"en":"Translating old handwriting can be a laborieux process.","zh":"翻译老手稿的字迹可能是一个很费力的过程。"},{"en":"She made a laborieux climb up the steep hill.","zh":"她艰难地爬上了陡坡。"},{"en":"The team finished the laborieux task step by step.","zh":"团队一步一步完成了这项费力的任务。"}]},{"partOfSpeech":"adj.","definition":{"en":"(French usage) hardworking; industrious.","zh":"（法语用法）勤奋的；用功的。"},"examples":[{"en":"He is described in French as laborieux and reliable.","zh":"在法语里，他被形容为“laborieux”（勤奋可靠）。"},{"en":"A laborieux student reviews every day.","zh":"一个勤奋的学生每天复习。"}]}],"synonyms":["laborious","arduous","toilsome","hard","demanding","industrious"],"phonetic":"/ləˈbɔriəs/","extraExplanation":["“laborieux”是法语形容词，英语里更常用对应词“laborious”。在英语学习或写作中，如果你看到“laborieux”，通常是作者借用法语来营造正式、文学或学术语气。","发音与英语“laborious”不同；若在英语语境中交流，建议改用“laborious /ləˈbɔriəs/”，更自然也更容易被理解。"]}
{"word":"laboring","summary":{"en":"“Laboring” means working very hard, or something happening with great effort; it can also describe a woman in childbirth.","zh":"“laboring”表示辛苦工作、费力进行，也可指产妇正在分娩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"working hard; doing physical or difficult work (present participle of “labor”).","zh":"辛苦地工作；从事体力或艰苦的工作（“labor”的现在分词）。"},"examples":[{"en":"She is laboring all day in the heat.","zh":"她在炎热中辛苦地干了一整天。"},{"en":"They were laboring to finish the project on time.","zh":"他们努力赶工，以按时完成项目。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of breathing, movement, or speech) slow and difficult; showing great effort.","zh":"（呼吸、动作或讲话）费力的；缓慢而吃力的。"},"examples":[{"en":"After the long run, his breathing was laboring.","zh":"长跑之后，他的呼吸很费力。"},{"en":"The old engine made a laboring noise as it climbed the hill.","zh":"发动机爬坡时发出吃力的声音。"}]},{"partOfSpeech":"adj.","definition":{"en":"(especially in childbirth) in the process of giving birth; having labor contractions.","zh":"（尤指分娩）正在生产；正在宫缩阵痛中。"},"examples":[{"en":"She was laboring for hours before the baby arrived.","zh":"婴儿出生前，她阵痛了好几个小时。"},{"en":"The nurse stayed with the laboring mother.","zh":"护士陪在正在生产的产妇身边。"}]}],"synonyms":["working hard","toiling","struggling","strenuous","effortful"],"phonetic":"/ˈleɪbərɪŋ/","extraExplanation":["“labor”比“work”更强调辛苦、耗体力或长时间的努力；因此“laboring”常带有“很吃力/很费劲”的感觉。","常见搭配：laboring under + 名词（表示“受……困扰/在……误解下挣扎”），如 laboring under a misconception（一直受误解影响）。"]}
{"word":"laboringly","summary":{"en":"“Laboringly” means doing something slowly and with a lot of effort because it is difficult.","zh":"“laboringly”表示做某事很费力、很吃力，往往还伴随进展缓慢。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow, difficult, and effortful way; with a lot of hard work and little ease.","zh":"费力地；吃力地；艰难缓慢地（带着很多努力、缺乏轻松感）。"},"examples":[{"en":"He laboringly carried the heavy boxes up the stairs.","zh":"他费力地把沉重的箱子搬上楼。"},{"en":"She laboringly typed the report with one hand because her other arm hurt.","zh":"因为另一只胳膊疼，她只能用一只手吃力地把报告打出来。"},{"en":"The old engine started laboringly, making loud, uneven noises.","zh":"旧发动机启动得很吃力，发出很大、忽快忽慢的噪音。"}]}],"synonyms":["with difficulty","with great effort","strenuously","painfully","slowly (sometimes)"],"phonetic":"/ˈleɪbərɪŋli/","extraExplanation":["“laboringly”来自“labor”（劳动；苦干），语气上常带有“过程辛苦、进展慢、不顺畅”的感觉。写作中它比较正式，不如“with difficulty / with great effort / slowly”常见。","常见搭配：laboringly carry / walk / climb / breathe / type / make one’s way（费力地搬/走/爬/呼吸/打字/前行）。","近义表达对比：\n- with difficulty：强调“很难”，中性常用。\n- with great effort：强调“用了很大力气”。\n- slowly：只强调“慢”，不一定辛苦。\n“laboringly”通常同时暗示“慢 + 辛苦”。"]}
{"word":"laborings","summary":{"en":"“Laborings” usually means hard work or sustained efforts (formal/literary). It can also relate to “laboring,” the act of working hard.","zh":"“laborings”通常指辛劳的工作或长期努力（偏正式/文学）。也可关联到“laboring”，表示正在辛勤工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) hard work or sustained effort; the things you do with a lot of effort.","zh":"（通常用复数）辛劳、苦干；指费力做的事情或长期的努力。"},"examples":[{"en":"After years of laborings, she finally finished her book.","zh":"经过多年的辛劳，她终于完成了那本书。"},{"en":"The villagers benefited from the laborings of many volunteers.","zh":"村民们受益于许多志愿者的辛苦付出。"},{"en":"His laborings in the workshop left him exhausted.","zh":"他在工坊里的辛苦劳作让他筋疲力尽。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “labor”: working hard, especially doing physical work (used in progressive tenses).","zh":"“labor”的现在分词：辛勤工作（尤指体力劳动，用于进行时）。"},"examples":[{"en":"They are laboring all day in the heat.","zh":"他们在炎热中一整天都在辛苦干活。"},{"en":"She was laboring to meet the deadline.","zh":"她在拼命赶截止日期。"}]}],"synonyms":["hard work","toil","efforts","exertions","drudgery"],"phonetic":"/ˈleɪbərɪŋ/","extraExplanation":["“laborings”常见于较正式、文学化或宗教语境里，带有“长期、艰辛付出”的感觉，比如“the fruits of one’s laborings（辛劳的成果）”。","美式拼写是 labor；英式拼写是 labour。对应的复数可写作 laborings / labourings。"]}
{"word":"laboriosus","summary":{"en":"Laboriosus is a Latin adjective meaning “laborious” or “hardworking,” mostly seen in scholarly writing and scientific names.","zh":"laboriosus 是拉丁语形容词，意为“费力的/勤勉的”，多见于学术语境或生物学名中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English mainly in scholarly or scientific contexts) laborious; hardworking; involving much effort.","zh":"（拉丁语；在英语中多用于学术或科学语境）费力的；勤勉的；需要付出很多努力的。"},"examples":[{"en":"In a Latin inscription, laboriosus describes someone known for hard work.","zh":"在拉丁碑文中，laboriosus 用来形容一个以勤劳著称的人。"},{"en":"The editor called the reconstruction of the text a laboriosus task.","zh":"编辑称这项文本复原工作是一项费力的任务。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, as a Latin species epithet) indicating an organism associated with industrious behavior or strenuous activity.","zh":"（生物学；作拉丁语种加词）表示某种生物“勤劳的/辛勤的”，或与高强度活动、费力行为有关。"},"examples":[{"en":"In scientific names, a species epithet like laboriosus often highlights a notable trait.","zh":"在学名中，像 laboriosus 这样的种加词常用来突出某个显著特征。"},{"en":"The label “laboriosus” in a species name can suggest the animal is especially industrious.","zh":"学名中的“laboriosus”可能暗示该动物特别“勤奋”。"}]}],"synonyms":["laborious","hardworking","industrious","diligent","toilsome"],"phonetic":"/ləˌbɔːriˈoʊsəs/","extraExplanation":["laboriosus 是拉丁语形容词，来自 labor（劳作、劳动）。在现代英语里它不算常用词，更多出现在古典文献、学术写作，或作为生物分类学中的拉丁化命名（种加词）。","发音在英语中通常按“拉丁化英语读法”处理，因此不同地区或学科可能略有差异；学习时更重要的是理解它≈ laborious / hardworking 的意思。"]}
{"word":"laborious","summary":{"en":"Laborious means requiring a lot of time and effort; it can also describe writing or speech that feels heavy and not fluent.","zh":"laborious 指“费力、耗时耗精力的”；也可形容文字或表达“冗长笨重、不够流畅”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Requiring a lot of effort and time; difficult and tiring to do.","zh":"费力的；需要大量时间和精力的；辛苦的。"},"examples":[{"en":"Cleaning the old house was a laborious task that took the whole weekend.","zh":"打扫那栋老房子是一项很费力的任务，花了整整一个周末。"},{"en":"She made a laborious effort to learn English pronunciation.","zh":"她为了学好英语发音付出了艰苦的努力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of writing, speech, or style) Too slow, heavy, or overly detailed; not fluent or lively.","zh":"（指文字、讲话或风格）冗长笨重的；不够流畅生动的。"},"examples":[{"en":"The report felt laborious, with many unnecessary details.","zh":"这份报告显得很冗长，有很多不必要的细节。"}]}],"synonyms":["hard","difficult","arduous","toilsome","time-consuming","tedious"],"phonetic":"/ləˈbɔriəs/","extraExplanation":["词源：laborious 来自拉丁语 labor（“劳动、辛苦、努力”）。同根词包括 labor（n./v. 劳动；努力）和 laboratory（实验室，原意与“工作场所”有关）。","用法提示：laborious 强调“过程很辛苦、很耗时耗力”。如果想强调“复杂/棘手”，也常用 difficult / challenging；如果强调“无聊、繁琐”，可用 tedious。","文学/正式语境：laborious 常见于较正式的写作，比如 “a laborious process”（艰难的过程）或 “laborious research”（辛苦的研究）。"]}
{"word":"laboriously","summary":{"en":"“Laboriously” means doing something with great effort and time, often slowly and with difficulty.","zh":"“laboriously”表示做事很费力、很耗时，常带有缓慢且困难的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that takes a lot of effort and time; with difficulty and careful, hard work.","zh":"费力地；辛苦地；（花很多时间与精力）艰难地、细致地。"},"examples":[{"en":"He laboriously climbed the steep stairs with a heavy box.","zh":"他抱着一个沉重的箱子，费力地爬上陡峭的楼梯。"},{"en":"She laboriously copied the notes by hand to avoid mistakes.","zh":"她辛苦地手抄笔记，以避免出错。"},{"en":"The team laboriously gathered data from hundreds of surveys.","zh":"团队辛苦地从数百份问卷中收集数据。"}]}],"synonyms":["with difficulty","painstakingly","strenuously","toilsomely","arduously"],"phonetic":"/ləˈbɔriəsli/","extraExplanation":["“laboriously”来自“labor”（劳动、辛劳）+ 副词后缀“-iously”。语气通常强调过程很耗时、很费劲，常用于描述体力或脑力上的“慢慢做、艰难做”。","近义词对比：\n- “with difficulty”更中性，只说“有困难”。\n- “painstakingly”强调“极其细心、煞费苦心”，未必体力累。\n- “strenuously”强调“用力、强度大”，不一定慢。"]}
{"word":"laboriousness","summary":{"en":"Laboriousness means the quality of being hard, time-consuming, and effortful.","zh":"Laboriousness 指“费力、耗时、需要大量精力”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being laborious: requiring a lot of effort, time, or careful work; being difficult and tiring.","zh":"费力；艰辛：指需要大量精力、时间或细致工作的特质；过程困难且让人疲惫。"},"examples":[{"en":"The laboriousness of the research process surprised the new students.","zh":"研究过程的艰辛程度让新生们很意外。"},{"en":"He respected the laboriousness of her craft—every detail was done by hand.","zh":"他很敬重她手艺的辛苦——每个细节都是手工完成的。"},{"en":"They underestimated the laboriousness of moving the office without professional help.","zh":"他们低估了在没有专业协助下搬办公室会有多费力。"}]}],"synonyms":["difficulty","hard work","toil","effort","tediousness"],"phonetic":"/ləˈbɔriəsnəs/","extraExplanation":["“laboriousness”来自形容词“laborious（费力的）”+ 名词后缀“-ness（……的性质/状态）”。写作中它偏正式，日常口语更常用“how hard/tiring it is（有多辛苦）”或“the effort involved（所需的努力）”。","“laborious”与“labor（劳动）”同源，但“laboriousness”强调“过程很费劲/很耗时”，不一定和体力劳动有关，也可以指写作、计算、整理数据等脑力工作。"]}
{"word":"laborism","summary":{"en":"Laborism is a belief or political approach centered on workers’ interests and the labor movement.","zh":"Laborism（劳动主义）是一种以劳动者利益与工人运动为中心的思想或政治取向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political or social belief system that emphasizes the interests, rights, and value of workers (labor), often linked to the labor movement or labor-based political parties.","zh":"一种强调劳动者（工人）利益、权利与劳动价值的政治或社会思想体系，常与工人运动或以劳工为基础的政党相关。"},"examples":[{"en":"Some critics say laborism focuses mainly on workers’ demands rather than broader social reforms.","zh":"一些批评者认为，劳动主义主要关注工人的诉求，而不是更广泛的社会改革。"},{"en":"In the early 20th century, laborism influenced debates about wages, working hours, and unions.","zh":"在20世纪初，劳动主义影响了关于工资、工时与工会的讨论。"}]}],"synonyms":["labourism","labor movement politics","worker-centered politics","trade-union politics"],"phonetic":"/ˈleɪbərˌɪzəm/","extraExplanation":["“laborism”在英语语境中比较偏学术或历史讨论，常用来指与工人阶级政治、工会力量、劳工政党相关的思想取向。英式拼写常见为“labourism”，在英国政治史里有时特指与英国工党传统相关、以工会与劳工代表为核心的政治路线。","不同作者对该词带有的评价色彩不一：有人把它视为维护劳动者权益的正面传统，也有人用它批评某种“只代表特定阶层、缺乏更广泛社会愿景”的政治倾向。"]}
{"word":"laborist","summary":{"en":"A laborist is a supporter of workers’ rights, trade unions, or labor-oriented politics.","zh":"laborist 指支持工人权益、工会或劳工政治立场的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports the labor movement (workers’ rights, trade unions) or labor-oriented politics (such as the Labour Party in the UK)","zh":"支持劳工运动（工人权益、工会）或偏向劳工的政治立场（如英国工党）的人"},"examples":[{"en":"Some laborists argued for stronger laws to protect workers’ safety.","zh":"一些劳工主义者主张制定更强的法律来保护工人的安全。"},{"en":"He describes himself as a laborist and often speaks at union events.","zh":"他自称是劳工主义者，并经常在工会活动上发言。"}]}],"synonyms":["trade unionist","labor supporter","Labour supporter","union member"],"phonetic":"/ˈleɪbərɪst/","extraExplanation":["“laborist”在现代英语中不算常用词，更常见的说法是“labor supporter / labour supporter（劳工支持者）”“trade unionist（工会人士）”“Labour Party supporter（工党支持者，英式拼写Labour）”。","在英国语境里，它有时带有政党色彩，指倾向或支持工党（Labour Party）的人；在更广泛语境中则可泛指支持劳工运动与工会的人。"]}
{"word":"laboristic","summary":{"en":"“Laboristic” means relating to labor or workers, often with a pro-labor emphasis.","zh":"“laboristic”指与劳动或工人有关，常带有偏向劳工/亲劳工的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to labor (work) or to workers, especially in political or economic discussion; emphasizing the interests of labor.","zh":"与劳动（工作）或工人有关的，尤指在政治或经济讨论中；强调劳动者利益的。"},"examples":[{"en":"The article takes a laboristic view, focusing on wages and working conditions.","zh":"这篇文章采取偏劳工的观点，重点讨论工资和工作条件。"},{"en":"Some critics said the proposal sounded too laboristic and ignored small businesses.","zh":"一些批评者说该提案过于偏向劳工，忽视了小企业。"}]}],"synonyms":["pro-labor","labor-oriented","worker-centered","labor-related"],"phonetic":"/ˌlæbəˈrɪstɪk/","extraExplanation":["“laboristic”在现代英语中比较少见，更常见的表达是“pro-labor”（亲劳工的）或“labor-oriented / worker-centered”（以劳工/工人为中心的）。","它有时出现在政治语境里，用来描述政策、观点或写作立场与劳工权益更一致。","拼写上也可能见到英式变体“labouristic”。"]}
{"word":"laborite","summary":{"en":"Laborite (more commonly Labourite) means a supporter/member of the British Labour Party, or something relating to Labour politics.","zh":"Laborite（更常见拼写为 Labourite）指英国工党的支持者/党员，或与工党政治相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supporter or member of the British Labour Party; someone with Labour Party politics","zh":"（英）工党支持者或党员；持工党政治立场的人"},"examples":[{"en":"Her grandfather was a lifelong Labourite who always voted Labour.","zh":"她的祖父是一位终身的工党支持者，始终投票给工党。"},{"en":"The town has been Labourite for decades, especially among working-class voters.","zh":"这个城镇几十年来一直偏向工党，尤其是在工人阶级选民中。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the British Labour Party or its political views","zh":"与（英国）工党或其政治观点有关的"},"examples":[{"en":"They criticized the proposal as too Labourite in tone.","zh":"他们批评该提案的语气太“工党式”了。"},{"en":"The newspaper used to have a strongly Labourite editorial line.","zh":"这家报纸过去的社论立场非常偏向工党。"}]}],"synonyms":["Labour supporter","Labour Party member","Labourite (variant spelling)"],"phonetic":"/ˈleɪbərˌaɪt/","extraExplanation":["“Labourite”更常见于英式拼写；“Laborite”偶尔出现，多被视为变体或拼写差异（类似 labour/labor）。在美国语境里也可能让人误解为“labor（劳动）相关”，但这里通常特指英国工党。","语域提示：在新闻与政治评论中常见；有时带一点立场色彩（可能中性，也可能带褒贬，取决于上下文）。"]}
{"word":"laborites","summary":{"en":"“Laborites” means supporters or members of the Labour Party (often the UK Labour Party).","zh":"“laborites”指工党（常指英国工党）的支持者或成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or belongs to the Labour Party (especially in the UK); plural form: Laborites / Labourites","zh":"（尤指英国）工党支持者或工党成员；复数：Laborites / Labourites（英式常拼作 Labourites）"},"examples":[{"en":"Many Laborites supported expanding public healthcare.","zh":"许多工党支持者支持扩大公共医疗服务。"},{"en":"She grew up in a Laborite household and later joined local party politics.","zh":"她在一个工党家庭中长大，后来加入了地方党务活动。"}]}],"synonyms":["Labour Party supporters","Labour members","Labour voters"],"phonetic":"ˈleɪbəˌraɪt","extraExplanation":["“Laborite / Labourite”通常用于指认政治立场或党派归属，最常见语境是英国工党（the Labour Party）。在美国英语里更常说 “Labour Party supporter” 或直接说 “Labour (Party) member”，而 “Laborite” 相对少见。","拼写差异：英式多用 labour（含 u），美式多用 labor（不含 u）。因此你看到的 “laborites” 多为美式拼写，但在涉及英国政治时也可能只是拼写变体。"]}
{"word":"laborius","summary":{"en":"Laborious means requiring a lot of effort and time; difficult and tiring.","zh":"Laborious 指费时费力、困难而辛苦的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Requiring a lot of time, effort, and careful work; hard and tiring to do.","zh":"费时费力的；需要大量努力和细致工作的；辛苦的。"},"examples":[{"en":"Writing the report was a laborious process, but it helped us understand the problem clearly.","zh":"写这份报告是个费时费力的过程，但它帮助我们更清楚地理解了问题。"},{"en":"The workers did the laborious task of carrying stones up the hill.","zh":"工人们做了把石头搬上山的辛苦工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving or working slowly and with difficulty; not quick or easy.","zh":"（动作/过程）缓慢而吃力的；不轻松的。"},"examples":[{"en":"After the long hike, her steps became slow and laborious.","zh":"长途徒步后，她的脚步变得缓慢而吃力。"},{"en":"He gave a laborious explanation that was hard to follow.","zh":"他做了一个冗长费劲的解释，让人不太好理解。"}]}],"synonyms":["difficult","hard","time-consuming","arduous","toilsome"],"phonetic":"/ləˈbɔriəs/","extraExplanation":["“laborius”常见于拼写错误；标准拼写是 **laborious**。词根来自拉丁语 *labor*（劳动、辛劳），因此常用来形容“需要很多努力/很辛苦”的事情。"]}
{"word":"laborless","summary":{"en":"“Laborless” means ‘without work or effort.’","zh":"“laborless”表示“无需劳动的／不费力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without labor or work; requiring no effort or physical work.","zh":"不需要劳动的；无需费力的；不用做工的。"},"examples":[{"en":"They dreamed of a laborless life with plenty of money.","zh":"他们梦想过一种不用劳动、却很富足的生活。"},{"en":"The advertisement promised a laborless way to lose weight.","zh":"广告宣称有一种不费力的减肥方法。"}]}],"synonyms":["effortless","work-free","unworked","labor-saving"],"phonetic":"/ˈleɪbərləs/","extraExplanation":["“laborless”是由“labor（劳动）+ -less（无……的）”构成的形容词，意思很直观，但在现代日常英语里不算常用，更常见的表达有“effortless（毫不费力的）”“work-free（不用工作的）”“labor-saving（省力的）”。","在文学或较正式的语境中，“laborless”有时带一点理想化或讽刺意味：例如描写人们向往“无需劳动”的生活，或批评某些承诺“轻松成功”的说法。"]}
{"word":"laborous","summary":{"en":"Laborious means taking a lot of time and effort; the common spelling is laborious (not laborous).","zh":"Laborious 指“费时费力的”；常见正确拼写是 laborious（不是 laborous）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Correct spelling: laborious) Requiring a lot of time, effort, and hard work.","zh":"（正确拼写：laborious）费时费力的；需要付出大量努力的。"},"examples":[{"en":"Cleaning the old house was a laborious task that took the whole weekend.","zh":"打扫那栋老房子是一项费时费力的工作，花了整个周末。"},{"en":"She made a laborious effort to learn English pronunciation.","zh":"她为学习英语发音付出了很大的努力。"}]}],"synonyms":["hard","difficult","time-consuming","strenuous","arduous"],"phonetic":"/ləˈbɔriəs/","extraExplanation":["“laborious”来自“labor（劳动）”，语气比“hard”更正式，强调过程漫长、步骤多、需要持续投入。","常见拼写错误是“laborous”。如果你想表达“勤劳的”，更常用“hardworking / diligent”，而不是“laborious”。"]}
{"word":"laborously","summary":{"en":"“Laboriously” means doing something with great effort and often slowly.","zh":"“Laboriously”表示做某事很费力、很辛苦，往往也比较慢。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that takes a lot of time and effort; slowly and with hard work.","zh":"费力地；辛苦地；（花很多时间和精力）缓慢地。"},"examples":[{"en":"She laboriously copied the notes by hand.","zh":"她费力地把笔记用手抄了一遍。"},{"en":"The team laboriously climbed the steep trail.","zh":"团队艰难地爬上陡峭的小路。"},{"en":"He laboriously searched through old files to find the document.","zh":"他费力地翻查旧文件来找那份资料。"}]}],"synonyms":["with difficulty","painstakingly","slowly","strenuously","with great effort"],"phonetic":"/ləˈbɔriəsli/","extraExplanation":["你输入的 **laborously** 通常被视为拼写错误；正确拼写是 **laboriously**。","英式拼写常见为 **labouriously**（多了一个 u），意思相同；美式常用 **laboriously**。"]}
{"word":"laborousness","summary":{"en":"“Laboriousness” means the quality of being very hard and time-consuming.","zh":"“Laboriousness”指“费力、耗时、艰苦”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “laboriousness”) The quality of requiring a lot of hard work, time, and effort.","zh":"（通常拼作 laboriousness）费力、耗时、需要大量努力的特质；艰苦程度。"},"examples":[{"en":"The laboriousness of writing a thesis surprised her.","zh":"写论文的艰辛程度让她很意外。"},{"en":"They underestimated the laboriousness of restoring the old house.","zh":"他们低估了修复那栋老房子有多费力。"},{"en":"He respected the quiet laboriousness behind great research.","zh":"他敬佩优秀研究背后那种默默的辛劳。"}]}],"synonyms":["difficulty","hard work","toil","effortfulness","arduousness"],"phonetic":"/ləˈbɔriəsnəs/","extraExplanation":["你写的 **laborousness** 常被视为拼写错误；更标准、常见的拼法是 **laboriousness**（来自形容词 *laborious* “费力的、艰苦的” + 名词后缀 *-ness* “……的状态/性质”）。在正式写作中建议使用 **laboriousness**。"]}
{"word":"labors","summary":{"en":"“Labors” most commonly means “hard work or efforts” (plural noun). It can also be the verb form meaning “works with difficulty.”","zh":"“Labors”最常见意思是“辛苦的工作/努力”（名词复数）；也可作动词，表示“费力地做、艰难进行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hard work or effort (plural of “labor”).","zh":"辛苦的工作；努力（labor 的复数）。"},"examples":[{"en":"After years of labors, they finally finished the bridge.","zh":"经过多年的辛勤努力，他们终于建成了那座桥。"},{"en":"The labors of caregiving are often invisible but important.","zh":"照护工作的辛劳常常看不见，但非常重要。"}]},{"partOfSpeech":"v.","definition":{"en":"Works with great effort; does something slowly or with difficulty (third-person singular of the verb “labor”).","zh":"费力地做；艰难地进行（动词 labor 的第三人称单数）。"},"examples":[{"en":"He labors to support his family.","zh":"他辛苦工作来养家。"},{"en":"The old engine labors up the hill.","zh":"那台旧发动机爬坡时运转得很吃力。"}]}],"synonyms":["work","effort","toil","hard work","struggle"],"phonetic":"/ˈleɪbɚz/","extraExplanation":["在美式英语中常写作 **labor**（labors），英式英语更常见拼写 **labour**（labours）。两者意思相同。","在较正式或文学语境中，**the labors of ...** 常用来强调“长期、艰辛的付出”。你也可能见到典故 **the Labors of Hercules**（赫拉克勒斯的十二功绩），用来比喻极其艰巨的任务。"]}
{"word":"laborsaving","summary":{"en":"“Labor-saving” describes something that reduces human work or time needed for a task.","zh":"“Labor-saving”指能减少人工劳力或节省时间的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce the amount of human effort or time needed to do a task; making work easier or faster.","zh":"省力的；节省劳力或时间的；让工作更轻松或更快的。"},"examples":[{"en":"A dishwasher is a labor-saving device for busy families.","zh":"洗碗机对忙碌的家庭来说是一种省力的设备。"},{"en":"The new software is a labor-saving tool that cuts paperwork in half.","zh":"这款新软件是省力工具，把文书工作减少了一半。"},{"en":"Farmers adopted labor-saving machines to harvest crops more quickly.","zh":"农民采用省力机械来更快地收割作物。"}]}],"synonyms":["time-saving","effort-saving","efficient","labor-reducing"],"phonetic":"/ˈleɪbɚ ˌseɪvɪŋ/","extraExplanation":["常见写法是 **labor-saving**（带连字符），也可写作 **laborsaving**（较少见）。在美式英语里 **labor** 用 -or 拼写；英式英语常见 **labour-saving**。常搭配名词：labor-saving **device / technology / method / measure**。"]}
{"word":"laborsome","summary":{"en":"“Laborsome” means requiring a lot of hard work and effort.","zh":"“laborsome”表示“费力的、辛苦的”，指需要大量努力与劳动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Requiring a lot of hard work, time, or effort; difficult and tiring.","zh":"需要大量辛苦、时间或精力的；费力而累人的。"},"examples":[{"en":"Cleaning the whole house by yourself is a laborsome job.","zh":"一个人把整栋房子都打扫干净是件很费力的事。"},{"en":"They took a laborsome route up the mountain, but the view was worth it.","zh":"他们走了一条上山很辛苦的路线，但风景很值得。"},{"en":"Writing the report was laborsome because it required checking every detail.","zh":"写这份报告很费力，因为需要核对每一个细节。"}]}],"synonyms":["laborious","arduous","toilsome","backbreaking","demanding","time-consuming"],"phonetic":"/ˈleɪbərsəm/","extraExplanation":["“laborsome”由“labor（劳动）+ -some（带有……性质的）”构成，含义直观但在现代英语中不算常用；更常见的近义词是“laborious”“arduous”“time-consuming”。","在语感上，它强调“做起来很辛苦/很费劲”，而不只是“花时间”；正式写作里常用“laborious”来替换。"]}
{"word":"laborsomely","summary":{"en":"Laborsomely means “with great effort and difficulty,” and it can also criticize something (especially writing) as heavy, awkward, or over-detailed.","zh":"laborsomely 意为“费力地、吃力而缓慢地”；也可用来批评表达（尤其写作）“冗长笨拙、过分堆砌”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that takes a lot of effort and time; with difficulty and slowness.","zh":"费力地；吃力而缓慢地（需要很多努力和时间）。"},"examples":[{"en":"She laborsomely carried the heavy boxes up the stairs.","zh":"她费力地把沉重的箱子搬上楼。"},{"en":"The team laborsomely rebuilt the bridge after the storm.","zh":"暴风雨过后，团队吃力而缓慢地重建了那座桥。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an over-detailed, awkward, or heavy way (often used to criticize writing or speaking).","zh":"（常用于批评）冗长而笨拙地；用力过猛、过分堆砌地（尤指写作或表达）。"},"examples":[{"en":"The report laborsomely explains simple ideas in too many words.","zh":"这份报告用冗长笨拙的方式把简单的想法讲得太复杂。"},{"en":"He laborsomely tried to sound formal, but the message became unclear.","zh":"他费力地想让语气显得正式，结果意思反而不清楚了。"}]}],"synonyms":["with difficulty","laboriously","with great effort","slowly","painstakingly"],"phonetic":"/ˈleɪbərsəmli/","extraExplanation":["“laborsomely”来自形容词“laborsome”（费力的、辛苦的）+ 副词后缀“-ly”。日常口语里更常用“with difficulty / slowly / with great effort”。","在写作评论中，第二个含义常带负面评价：不是“努力”本身不好，而是指表达方式显得沉重、绕、读起来不顺。"]}
{"word":"laborsomeness","summary":{"en":"Laborsomeness means the quality of being laborious—hard, time-consuming, or tiring work.","zh":"Laborsomeness 指“费力/辛苦”的特质，即做某事很耗时、耗力或令人疲惫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being laborious: requiring a lot of effort, time, or hard work (often suggesting something feels slow or tiring).","zh":"费力；辛苦；吃力（指需要很多时间与精力的特质，常带有过程缓慢或令人疲惫的感觉）。"},"examples":[{"en":"The laborsomeness of writing a thesis surprised him—it took months of careful work.","zh":"写论文的费力程度让他很意外——需要几个月的细致工作。"},{"en":"They reduced the laborsomeness of the task by using better tools and planning.","zh":"他们通过更好的工具和规划降低了这项工作的辛苦程度。"}]}],"synonyms":["laboriousness","difficulty","hardship","toil","tediousness","effort"],"phonetic":"/ˈleɪbərsəmnəs/","extraExplanation":["“laborsomeness”由形容词“laborsome”（费力的、辛苦的）+ 名词后缀“-ness”构成，表示“具有某种性质的状态/特质”。","这个词在现代英语里相对少见、偏正式；日常表达更常用“difficulty / hardship / effort / tediousness”。例如：the tediousness of paperwork（文书工作的繁琐）或 the effort required（所需的努力）。"]}
{"word":"laboulbenia","summary":{"en":"Laboulbenia: a genus of microscopic parasitic fungi that live on insects’ bodies.","zh":"Laboulbenia：一种附生在昆虫体表的微小寄生真菌属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tiny parasitic fungi (order Laboulbeniales) that live on the outside of insects, especially beetles, often without quickly killing the host","zh":"【生物】虫生寄生真菌的一属（Laboulbenia，隶属虫生真菌目 Laboulbeniales），多附生在昆虫体表（尤以甲虫常见），通常不会迅速致死宿主"},"examples":[{"en":"Researchers found Laboulbenia growing on the legs of ground beetles.","zh":"研究人员在步甲的足部发现了 Laboulbenia 的生长。"},{"en":"Laboulbenia infections can spread when insects come into close contact.","zh":"当昆虫彼此密切接触时，Laboulbenia 的感染可能传播。"}]}],"synonyms":["Laboulbenia (genus)","laboulbenialean fungus"],"phonetic":"/ˌlæbʊlˈbiːniə/","extraExplanation":["Laboulbenia 通常指“属名”，在学术写作里常用斜体（Laboulbenia）。个体非常微小，常以显微镜观察；它们多在昆虫交配或聚集时传播。","名称来自 Laboulbeniales（虫生真菌目），这类真菌常专一寄生在特定昆虫类群体表，属于研究“宿主—寄生关系”和昆虫生态的重要材料。"]}
{"word":"laboulbeniaceae","summary":{"en":"Laboulbeniaceae: a family of tiny parasitic fungi found on the outer surface of insects and other arthropods.","zh":"Laboulbeniaceae：寄生在昆虫等节肢动物体表的一科微小真菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tiny parasitic fungi (in the order Laboulbeniales) that live on the outside of insects and other arthropods.","zh":"虫生外寄生真菌的一科（隶属 Laboulbeniales 目），通常寄生在昆虫等节肢动物体表。"},"examples":[{"en":"Scientists recorded several Laboulbeniaceae species on beetles collected in the forest.","zh":"科学家在森林里采集到的甲虫体表记录到多种 Laboulbeniaceae 的成员。"},{"en":"Because these fungi grow on the insect’s surface, Laboulbeniaceae are studied in insect–fungus interactions.","zh":"由于这类真菌生长在昆虫体表，Laboulbeniaceae 常用于研究昆虫—真菌相互作用。"}]}],"synonyms":["laboulbenialean fungi","insect-associated fungi"],"phonetic":"/ləˌbuːlˌbɛniˈeɪsi.i/","extraExplanation":["这是一个拉丁学名（生物分类名），在英语里常被当作单数或复数统称使用：可指“该科（the family Laboulbeniaceae）”，也可泛指“该科的成员”。","它们通常形成非常小的“子实体/菌体”，附着在宿主外骨骼上；与常见的“使昆虫生病的真菌”不同，很多 Laboulbeniaceae 更像是长期共生或弱寄生，是否显著伤害宿主需视物种与宿主而定。","拼写提醒：该词较少见，常见相关词还有“Laboulbeniales（目名）”“Laboulbenia（属名）”。"]}
{"word":"laboulbeniaceous","summary":{"en":"A scientific adjective meaning “of or relating to the insect-associated fungal family Laboulbeniaceae.”","zh":"科学用语形容词，表示“与虫寄生菌科（Laboulbeniaceae）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the fungal family Laboulbeniaceae (tiny fungi that live on the outside of insects and other arthropods).","zh":"与虫寄生外生真菌家族“Laboulbeniaceae（虫寄生菌科）”有关的；虫寄生菌科的。"},"examples":[{"en":"Some beetles carry laboulbeniaceous fungi on their legs and wing covers.","zh":"有些甲虫的足和鞘翅上会携带虫寄生菌科（laboulbeniaceous）的真菌。"},{"en":"The paper describes a laboulbeniaceous parasite found on ants.","zh":"这篇论文描述了一种发现于蚂蚁体表的虫寄生菌科（laboulbeniaceous）寄生真菌。"}]}],"synonyms":["Laboulbeniaceae-related","of Laboulbeniaceae"],"phonetic":"/ləˌbuːlbəˈniːəʃəs/","extraExplanation":["“laboulbeniaceous”来自真菌家族名 Laboulbeniaceae；在生物学写作里属于非常专业的形容词，常见于分类学、昆虫学与真菌学论文。","这些真菌通常附着在昆虫体表（如甲虫、蚂蚁、蝇类），一般不会像常见霉菌那样形成大片菌丝，而是形成微小、结构复杂的“子实体”样结构；是否显著危害宿主依物种而定。","拼写提示：常见名词是 Laboulbeniaceae（虫寄生菌科）；形容词写作 laboulbeniaceous。"]}
{"word":"laboulbeniales","summary":{"en":"Laboulbeniales: an order of microscopic fungi that parasitize the outer surface of insects and other arthropods.","zh":"Laboulbeniales（虫菌目）：寄生在昆虫等节肢动物体表的微小真菌类群（一个“目”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of tiny parasitic fungi (class Laboulbeniomyces) that live on the outside of insects and other arthropods","zh":"（真菌分类）虫菌目：一类极微小的寄生真菌（隶属 Laboulbeniomyces 纲），通常生长在昆虫等节肢动物体表"},"examples":[{"en":"Laboulbeniales are often found on beetles and flies.","zh":"虫菌目真菌常见于甲虫和蝇类身上。"},{"en":"Under a microscope, the Laboulbeniales thalli look like tiny, complex structures attached to the insect’s cuticle.","zh":"在显微镜下，虫菌目的菌体看起来像附着在昆虫表皮上的微小而复杂的结构。"}]}],"synonyms":["laboulbenialean fungi","insect-ectoparasitic fungi"],"phonetic":"/ˌlæbuːlˌbɛniˈeɪliːz/","extraExplanation":["“Laboulbeniales”通常在学术语境中出现（昆虫学、真菌学、寄生关系研究）。它们多为“外寄生”——长在宿主体表而非体内，常通过宿主接触传播（如交配或群聚）。","词形上为复数形式（-ales 常见于生物分类“目”的拉丁化后缀）；单数谈某一成员时，通常说“a laboulbenialean fungus”（一株虫菌目真菌）。"]}
{"word":"labour","summary":{"en":"“Labour” most commonly means work (or the workforce) and can also mean the act of working hard; in British English it can mean childbirth.","zh":"“labour”最常见指“劳动/劳动力”，也可作动词表示“辛苦努力”；在英式英语里还可指“分娩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Work, especially physical work, done to produce or achieve something; also, workers as a group.","zh":"劳动；（尤指）体力劳动；也可指“劳工、劳动者群体”。"},"examples":[{"en":"Farm labour is hard, especially during the harvest.","zh":"农活很辛苦，尤其是在收获季。"},{"en":"The project succeeded because of skilled labour.","zh":"这个项目成功是因为有熟练的劳动力。"}]},{"partOfSpeech":"v.","definition":{"en":"To work hard; to make a sustained effort (often followed by “over” or “to”).","zh":"辛勤工作；努力（常与 over / to 连用）。"},"examples":[{"en":"They laboured over the report all night.","zh":"他们通宵努力完成那份报告。"},{"en":"She laboured to explain the idea clearly.","zh":"她费力地把这个想法解释清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of giving birth (used especially in British English).","zh":"分娩过程（尤用于英式英语）。"},"examples":[{"en":"She went into labour early in the morning.","zh":"她一大早开始阵痛并进入产程。"}]}],"synonyms":["work","toil","effort","workforce","labor"],"phonetic":"/ˈleɪbər/","extraExplanation":["拼写与用法提示：labour 是英式拼写；美式英语通常写作 labor。发音基本相同。"]}
{"word":"labourage","summary":{"en":"“Labourage” means farm work or the cultivation of land, mainly in archaic or literary English.","zh":"“labourage”指耕作或农事劳动，主要用于古体或文学英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the work of farming or cultivating land; agricultural labor (often archaic or literary).","zh":"耕作；农事劳动（多为古体或文学用语）。"},"examples":[{"en":"The old poem praises honest labourage and the rhythm of the seasons.","zh":"那首古诗赞美朴实的耕作以及四季的节律。"},{"en":"After years of labourage, the fields finally yielded a good harvest.","zh":"多年耕作之后，田地终于迎来丰收。"}]}],"synonyms":["farming","farm work","agricultural labor","cultivation","tillage"],"phonetic":"/ˈlæbərɪdʒ/","extraExplanation":["“labourage”现在很少用于日常英语，更多见于古英语/中古英语风格的文本或文学写作里。现代英语更常用的对应表达是“farm work / farming / agricultural work”。","拼写上也容易与“laborage / labourage（英式拼写）”混淆；在当代语境中，如果你想表达“劳动/辛劳”，通常直接用“labor/labour”。"]}
{"word":"laboured","summary":{"en":"“Laboured” usually means “done with too much effort; forced,” and it can also be the past form of “labour/labor” meaning “worked hard/struggled.”","zh":"“Laboured”常指“费力而显得刻意、不自然”，也可作“labour/labor”的过去式/过去分词，表示“辛苦工作/艰难进行（也可指分娩阵痛）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done with a lot of effort, and often sounding or looking forced rather than natural (especially of writing, speech, humor, or style).","zh":"费力的；（尤指文字、讲话、幽默或风格）刻意的、不自然的。"},"examples":[{"en":"The essay feels laboured, as if every sentence was rewritten ten times.","zh":"这篇文章读起来很刻意，好像每句话都改了十遍。"},{"en":"His jokes were laboured and didn’t get many laughs.","zh":"他的笑话很生硬，没怎么逗笑大家。"},{"en":"The dialogue sounds laboured, not like real conversation.","zh":"这段对话听起来很不自然，不像真实的交流。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense or past participle of “labour/labor”: worked hard; struggled to do something (also used for a woman in childbirth).","zh":"“labour/labor”的过去式或过去分词：辛苦工作；艰难地做某事（也可指分娩时阵痛、用力）。"},"examples":[{"en":"They laboured all day to finish the roof before the rain.","zh":"他们辛苦干了一整天，想在下雨前把屋顶完工。"},{"en":"She laboured over the details until the report was finally clear.","zh":"她反复推敲细节，直到报告终于清晰明了。"},{"en":"She laboured for hours before the baby was born.","zh":"孩子出生前，她阵痛并用力了好几个小时。"}]}],"synonyms":["forced","strained","overworked","effortful","toiled"],"phonetic":"/ˈleɪbɚd/","extraExplanation":["拼写与地域：英式常写 labour / laboured；美式常写 labor / labored。含义基本相同，但在美式里更常见的是拼写 labored。","语感提示：形容写作或表达时，laboured 往往带有批评意味，暗示“用力过猛、显得做作”。"]}
{"word":"labouredly","summary":{"en":"Labouredly means ‘with great effort’ or ‘in a slow, heavy, unnatural way,’ especially about movement or speech/writing.","zh":"labouredly 表示“费力地、吃力地”，也可指“缓慢沉重/不自然地”（常用于动作或言语、写作表达）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"With a lot of effort; in a way that feels difficult or tiring.","zh":"费力地；吃力地（做某事很困难或很累）。"},"examples":[{"en":"He climbed the hill labouredly, stopping every few steps to catch his breath.","zh":"他吃力地爬上山坡，每走几步就停下来喘口气。"},{"en":"After the long flight, she walked labouredly through the airport.","zh":"长途飞行后，她在机场里走得很吃力。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a slow, heavy, or unnatural way (often about speech, writing, or style).","zh":"缓慢而生硬地；不自然地（常指说话、写作或表达风格）。"},"examples":[{"en":"He explained the idea labouredly, as if reading from a script.","zh":"他生硬地解释这个想法，像是在照稿子念。"},{"en":"The essay moves labouredly from one point to the next.","zh":"这篇文章从一个观点转到下一个观点显得很拖沓。"}]}],"synonyms":["laboriously","with difficulty","with effort","heavily","awkwardly"],"phonetic":"/ˈleɪbərdli/","extraExplanation":["“labouredly”在英式拼写中常见（labour）；美式对应常写作“laboriously”。在现代英语里，“labouredly”多见于书面语，尤其用来批评表达“费力但不流畅/不自然”。","在文学描写中，它常用来营造沉重或疲惫的节奏感，比如描写角色艰难行走、呼吸沉重，或语言表达拗口。"]}
{"word":"labouredness","summary":{"en":"Labouredness means an unnatural heaviness or “too much effort,” especially in style or expression; it can also describe physically strained effort (like laboured breathing).","zh":"Labouredness 指表达或风格上过于费力、刻意而显得笨重不自然；也可指身体上的吃力（如呼吸费劲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being done with too much visible effort, making it feel heavy, slow, or not natural (often used to criticize writing, jokes, speeches, or art)","zh":"（常用于批评文章、笑话、演讲或艺术等）过于费力、刻意，显得笨重、迟缓或不自然的特质"},"examples":[{"en":"The essay’s labouredness makes the argument harder to follow.","zh":"这篇文章的刻意与笨重让论证更难理解。"},{"en":"Some viewers felt the dialogue had a labouredness that didn’t match the characters.","zh":"一些观众觉得对白过于刻意，和人物不太贴合。"},{"en":"He tried to sound funny, but the labouredness of the joke ruined the moment.","zh":"他想显得幽默，但笑话太刻意，反而破坏了气氛。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being difficult or strained in a physical way (for example, breathing or movement)","zh":"（身体层面）吃力、费劲或紧张（如呼吸、动作）的状态"},"examples":[{"en":"The doctor noted the labouredness of her breathing.","zh":"医生注意到她呼吸很吃力。"},{"en":"After the long climb, there was labouredness in his steps.","zh":"长时间攀爬后，他走起路来显得很费劲。"}]}],"synonyms":["awkwardness","heaviness","forcedness","strain","effortfulness"],"phonetic":"ˈleɪbərdnəs","extraExplanation":["“labouredness”来自形容词“laboured”（费力的、刻意的），常见于文学/写作评论：当表达显得“用力过猛”、不够自然时会用这个词来指出问题。","拼写上“laboured”更偏英式（美式常写作“labored”），但名词“labouredness/laboredness”都能见到；在美式语境里更常用更直接的说法如“awkwardness”“heaviness”“forcedness”。"]}
{"word":"labourer","summary":{"en":"A labourer is a person who does mainly physical work, often in jobs that don’t require special skills or training.","zh":"labourer 指主要从事体力劳动的工人，常见于不要求特殊技能或训练的工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does hard physical work, especially a job that does not require special training (for example, on a farm or construction site).","zh":"体力劳动者；（尤指）不需要特殊技能或训练的工人（如农场或建筑工地上的工人）。"},"examples":[{"en":"He worked as a labourer on a building site.","zh":"他在建筑工地当体力工。"},{"en":"The company hired local labourers to dig the foundations.","zh":"公司雇了当地工人来挖地基。"}]},{"partOfSpeech":"n.","definition":{"en":"A worker who is not skilled or not officially trained for a specific trade (often used in job descriptions).","zh":"普通工；非技术工（常用于职位或用工描述中）。"},"examples":[{"en":"They advertised for a general labourer with a valid driver’s license.","zh":"他们招聘一名普通工，要求有有效驾照。"}]}],"synonyms":["manual worker","worker","construction worker","farmhand","day laborer"],"phonetic":"/ˈleɪbərər/","extraExplanation":["拼写与用法提示：labourer 是英式拼写（British English），美式英语更常写作 laborer。两者意思相同。","语域与文化：labourer 通常指“以体力为主、非技术工种”的岗位；在正式语境（招聘、合同、统计）中很常见。日常口语里，人们也可能说 construction worker（建筑工人）、manual worker（体力劳动者）等更具体或更中性的表达。"]}
{"word":"labourers","summary":{"en":"“Labourers” means workers who do mainly physical work; it can also refer more generally to wage workers, often in less skilled jobs.","zh":"“labourers”指主要从事体力劳动的工人；也可泛指领取工资的劳动者，常与较低技能岗位相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who do heavy physical work, especially jobs that require strength rather than special training (plural of “labourer”).","zh":"做体力劳动的人；（尤指）主要靠体力而非专业技能工作的工人（“labourer”的复数）。"},"examples":[{"en":"The builders hired extra labourers to finish the road on time.","zh":"建筑队多雇了一些体力工人，以便按时修完这条路。"},{"en":"In the hot sun, the labourers carried stones all day.","zh":"在烈日下，这些工人整天搬运石头。"}]},{"partOfSpeech":"n.","definition":{"en":"People who work for wages, especially in lower-paid or less skilled jobs (a general social/economic meaning).","zh":"劳动者、雇工（较泛指的社会/经济含义，常指工资较低或技能要求不高的工作者）。"},"examples":[{"en":"The factory depended on migrant labourers during the busy season.","zh":"旺季时，这家工厂依赖外来务工人员。"}]}],"synonyms":["manual workers","workmen","day laborers","workers","hands"],"phonetic":"/ˈleɪbərərz/","extraExplanation":["“labourers”是英式拼写（labour）。美式通常写作“laborers”，读音相同。两者意思一样，只是拼写因地区不同而不同。","在一些历史或社会语境中，labourers常与“工人阶级”“体力劳动者”相关；使用时注意语气中性与尊重，避免把人简单标签化。"]}
{"word":"labouress","summary":{"en":"“Labouress” means a female laborer; it’s an old-fashioned word and is uncommon today.","zh":"“Labouress”指“女工/女性劳动者”，属于较旧且如今不常用的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who does manual or physical work; a female laborer (an older/less common word).","zh":"从事体力劳动的女性；女工（较旧、较少见的用法）。"},"examples":[{"en":"In the 1800s, many labouresses worked long hours in mills and farms.","zh":"在19世纪，许多女工在工厂和农场里长时间工作。"},{"en":"The novel describes her as a labouress who supports her family with hard work.","zh":"小说把她描写成一位靠辛苦劳动养家糊口的女工。"}]}],"synonyms":["female laborer","woman worker","labourer","laborer"],"phonetic":"/ˈleɪbərəs/","extraExplanation":["“labouress”是由“labour/labor（劳动者）+ -ess（表示女性的后缀）”构成的词。现代英语中更常用性别中性的“laborer/labourer”，因此“labouress”带有明显的时代感，常见于历史语境、旧文学或档案材料中。","英式拼写常见“labour-”，美式更常见“labor-”。你输入的“labouress”也可能是把复数“labourers（劳动者们）”拼错了；如果你想表达复数，一般写“labourers/laborers”。"]}
{"word":"labourful","summary":{"en":"Labourful means “laborious”—something that takes a lot of effort and is tiring (rare in modern English).","zh":"Labourful 表示“费力的、艰苦的”，指需要大量努力且令人疲惫的事（现代英语中较少用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Requiring a lot of work or effort; laborious; difficult and tiring.","zh":"（罕见）需要大量工作或努力的；费力的；艰苦的。"},"examples":[{"en":"Cleaning the old house was a labourful job that took all weekend.","zh":"打扫那栋老房子是一项费力的工作，花了整个周末。"},{"en":"They made slow progress through the labourful process of rebuilding after the storm.","zh":"他们在暴风雨后的重建过程中缓慢推进，那是个艰苦的过程。"}]}],"synonyms":["laborious","arduous","strenuous","toilsome","hard"],"phonetic":"ˈleɪbɚfəl","extraExplanation":["“labourful”在现代英语里非常少见，更常用的词是“laborious”（费力的）或“hard/strenuous”（艰难的/费劲的）。","拼写上“labour-”更偏英式（BrE），美式通常写作“labor-”。不过即使在英式英语里，“labourful”也不常见。"]}
{"word":"labouring","summary":{"en":"“Labouring” means working hard or struggling to do something; it’s also the present participle of “labour.”","zh":"“labouring”指辛苦工作或费力挣扎去做某事；也是“labour”的现在分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"working hard for a long time; doing physically or mentally difficult work","zh":"辛苦工作的；费力劳作的"},"examples":[{"en":"The labouring workers carried heavy bricks all day.","zh":"那些辛苦劳作的工人整天搬运沉重的砖块。"},{"en":"She gave a labouring effort to finish the report before midnight.","zh":"她费了很大力气在午夜前完成报告。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “labour” (to work hard; to try with difficulty)","zh":"“labour”的现在分词：辛苦工作；（做某事时）费力、吃力"},"examples":[{"en":"He is labouring in the fields from sunrise to sunset.","zh":"他从日出干到日落，在田里辛苦劳作。"},{"en":"I was labouring to understand the instructions.","zh":"我费力地想理解这些说明。"},{"en":"The company is labouring under heavy debt.","zh":"这家公司背负着沉重的债务（因此发展艰难）。"}]}],"synonyms":["working","toiling","struggling","grinding","slogging"],"phonetic":"/ˈleɪbərɪŋ/","extraExplanation":["“labouring”是英式拼写；美式通常写作“laboring”。发音基本一样。","常见搭配：labour under + 名词，表示“背负/受……所困而难以顺利进行”（如labour under pressure / debt / a misunderstanding）。","在文学或较正式的语境里，“labour”常带有“艰辛、吃力”的语气，比中性的“work”更强调辛苦或困难。"]}
{"word":"labouringly","summary":{"en":"“Labouringly” means doing something slowly and with great effort; it’s an uncommon form similar to “laboriously.”","zh":"“labouringly”表示“费力地、吃力地、艰难缓慢地”，较少见，意思接近“laboriously”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow, difficult, and tiring way; with a lot of effort (same meaning as “laboriously”).","zh":"费力地；吃力地；艰难缓慢地（与 laboriously 同义）。"},"examples":[{"en":"She climbed the hill labouringly, stopping every few steps to catch her breath.","zh":"她费力地爬上山坡，每走几步就停下来喘口气。"},{"en":"The old printer worked labouringly through the night to finish the posters.","zh":"那位老印刷工通宵吃力地干活，赶着把海报印完。"},{"en":"He spoke labouringly, searching for the right words.","zh":"他说得很吃力，努力寻找合适的措辞。"}]}],"synonyms":["laboriously","with difficulty","with great effort","strenuously","painstakingly"],"phonetic":"/ˈleɪbərɪŋli/","extraExplanation":["“labouringly”较少见，更常用的拼写与表达是美式英语的“laboriously”，英式英语也常用“laboriously”。“labour-”是英式拼写（labour），美式通常写作“labor”。","语感上，“labouringly”强调“动作慢、过程艰难、很耗体力/脑力”。若你想更自然口语一些，也可以用：with difficulty / with great effort / painfully slowly（根据语境选择）。"]}
{"word":"labourism","summary":{"en":"Labourism is a worker- and union-centered political ideology or movement, often associated with labor parties.","zh":"Labourism 指以工人和工会为中心的政治思想或运动，常与工党等劳工政党相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political view or movement that emphasizes the interests and goals of workers and organized labor (trade unions), often linked to labor parties and worker-centered policies.","zh":"一种强调工人阶级与有组织劳工（工会）利益与目标的政治观点或运动，常与工党或以劳工为中心的政策相关。"},"examples":[{"en":"Some critics argue that labourism focuses too narrowly on trade-union demands instead of broader social change.","zh":"一些批评者认为，labourism 过于狭隘地关注工会诉求，而不是更广泛的社会变革。"},{"en":"In early twentieth-century Britain, labourism helped shape the rise of the Labour Party.","zh":"在20世纪初的英国，labourism 促成了工党的崛起并影响了其发展。"}]}],"synonyms":["laborism","trade unionism","labor politics"],"phonetic":"/ˈleɪbərɪzəm/","extraExplanation":["“labourism”是英式拼写；美式拼写常见为“laborism”。在学术与政治讨论中，它常用来指一种以工会与工人经济利益为核心的政治取向，有时也被用来与更强调整体制度变革的“社会主义/马克思主义”作对比。"]}
{"word":"labourist","summary":{"en":"A Labourist is a supporter or member of the UK Labour Party, or someone who supports labor/worker causes.","zh":"Labourist 指（尤指英国）工党的支持者或成员，也可泛指支持劳工与工人权益的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supporter or member of the Labour Party (especially in the UK); more generally, someone who supports workers’ rights and labor movements","zh":"（尤指英国）工党支持者或成员；更广义地指支持劳工权益与工人运动的人"},"examples":[{"en":"Her grandfather was a lifelong Labourist who campaigned for better housing and wages.","zh":"她祖父一辈子都是工党支持者，曾为更好的住房和工资而奔走。"},{"en":"In the debate, a Labourist argued that public services should be protected from budget cuts.","zh":"在辩论中，一位工党人士主张应保护公共服务，避免预算削减。"},{"en":"Some Labourists emphasize strong unions and workplace protections.","zh":"一些工党支持者强调强大的工会和职场保护。"}]}],"synonyms":["Labour supporter","Labour Party member","Labour politician","labor advocate"],"phonetic":"/ˈleɪbərɪst/","extraExplanation":["“Labourist”在英语里带有明显的政治语境，最常见是指英国工党（Labour Party）相关的人（成员或支持者）。日常新闻中更常见的说法是“Labour supporter / Labour Party member / Labour politician”，而“Labourist”略显书面或带立场色彩。","英美拼写差异：英式拼写常见“labour-”，美式多写“labor-”。因此你也可能看到“laborist”，意思相近。"]}
{"word":"labourite","summary":{"en":"A Labourite is someone who supports or belongs to the UK Labour Party.","zh":"Labourite 指英国工党的成员或支持者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member or supporter of the UK Labour Party (a major political party generally associated with center-left politics).","zh":"（英国）工党党员；工党支持者（通常与中左翼政治立场相关）。"},"examples":[{"en":"Her parents are lifelong Labourites who vote in every election.","zh":"她的父母是终身的工党支持者，每次选举都会投票。"},{"en":"Some Labourites argued for higher public spending on schools and hospitals.","zh":"一些工党人士主张增加对学校和医院的公共开支。"}]}],"synonyms":["Labour Party supporter","Labour Party member","Labour voter"],"phonetic":"/ˈleɪbərˌaɪt/","extraExplanation":["“Labourite”主要在英国语境中使用，指“工党的人”。在美国英语里更常见的表达是“a Labour Party supporter/member”，而不是用“Labourite”。","拼写上的“labour-”是英式拼法（美式通常写作“labor”），但这个词几乎只与英国工党相关。"]}
{"word":"labourless","summary":{"en":"“Labourless” means effortless or done without work, and it is mostly literary/formal.","zh":"“labourless”表示“不费力的/无需劳动的”，多用于文学或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary or formal) done without work, effort, or toil; effortless.","zh":"（文学或正式用语）不费力的；无需劳动的；轻而易举的。"},"examples":[{"en":"The poem describes a labourless summer breeze moving through the trees.","zh":"这首诗描写了夏日微风轻轻拂过树梢，仿佛不费力。"},{"en":"He spoke with a labourless confidence that made the audience relax.","zh":"他说话带着一种毫不费力的自信，让观众放松下来。"},{"en":"She wished for a labourless way to solve the problem, but it still took practice.","zh":"她希望有一种不费力的办法解决问题，但最终还是需要练习。"}]}],"synonyms":["effortless","easy","unlabored","smooth","light"],"phonetic":"/ˈleɪbərləs/","extraExplanation":["“labourless”由 labour（劳动、辛苦）+ -less（没有……的）构成，语气偏文学/书面，常用来营造“轻盈、自然、毫不费力”的感觉。日常口语里更常说 effortless / easy / without effort。","在文学描写中，它常形容自然界的动作（风、光、水流）或人的姿态/谈吐显得“从容不吃力”。注意它通常不表示“懒惰”，而是强调“看起来不费劲”。"]}
{"word":"labours","summary":{"en":"“Labours” means hard work/efforts (plural noun), or “works hard” (third-person singular verb).","zh":"“labours”表示“辛勤劳动/付出”（复数名词），也可作动词第三人称单数，意为“努力工作”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Hard work, effort, or tasks that require time and energy.","zh":"（复数名词）辛勤的工作；付出的努力；需要时间和精力的任务。"},"examples":[{"en":"After months of labours, the project was finally finished.","zh":"经过几个月的辛勤劳动，这个项目终于完成了。"},{"en":"We want to honor the labours of the people who built this community.","zh":"我们想致敬那些建设这个社区的人们的付出。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) Works hard; makes a strong effort, often for a long time.","zh":"（动词第三人称单数）努力工作；长期用力付出。"},"examples":[{"en":"She labours day and night to support her family.","zh":"她日夜辛劳来养家。"},{"en":"He labours over every sentence in his essay.","zh":"他在文章的每一句上都反复推敲。"}]}],"synonyms":["work","effort","toil","hard work","struggle"],"phonetic":"/ˈleɪbɚz/","extraExplanation":["“labours”常见于英式拼写与语境；美式英语更常写作“labors”。在较正式或文学语体中，“labours”也更常用来表达“辛勤付出、艰苦努力”的感觉。","固定搭配：labour over（反复推敲、费力做）；labour under（在……困扰/压力下，如 labour under a misconception）。"]}
{"word":"laboursaving","summary":{"en":"Labour-saving describes something that reduces the amount of work people need to do.","zh":"Labour-saving 指能减少人们劳动量、让工作更省力的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to reduce the amount of human work needed; making a task quicker or easier (often by using machines or technology).","zh":"（常指借助机器或科技）用来减少人力劳动的；省力的；使工作更快更容易的。"},"examples":[{"en":"A dishwasher is a labour-saving device in many homes.","zh":"洗碗机在很多家庭里都是一种省力装置。"},{"en":"They invested in labour-saving technology to speed up production.","zh":"他们投资省力技术来加快生产。"},{"en":"Online forms are labour-saving compared with filling out paper documents by hand.","zh":"与手写纸质文件相比，在线表格更省力。"}]}],"synonyms":["labor-saving","time-saving","work-saving","efficient"],"phonetic":"/ˈleɪbɚ ˌseɪvɪŋ/","extraExplanation":["“labour-saving”是英式拼写；美式更常写作“labor-saving”。两者意思相同。","常见搭配：labour-saving device（省力装置）、labour-saving technology（省力技术）、labour-saving machinery（省力机械）。","写法上常见带连字符（labour-saving），也可写作不带连字符（labour saving），但作定语时带连字符更清晰：a labour-saving method。"]}
{"word":"laboursome","summary":{"en":"Laboursome means requiring a lot of hard work, or (of style) heavy and tedious.","zh":"Laboursome 指“费力的、辛苦的”，也可指（文风/表达）“沉重拖沓、乏味难读的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Requiring a lot of hard work; difficult and tiring (often describing tasks, writing, or a process).","zh":"费力的；需要大量辛苦劳动的（常形容工作、写作或过程）。"},"examples":[{"en":"Cleaning the entire basement was a laboursome job that took all weekend.","zh":"打扫整个地下室是一项很费力的工作，花了整整一个周末。"},{"en":"He made a laboursome effort to finish the report before the deadline.","zh":"他很吃力地努力赶在截止日期前完成报告。"}]},{"partOfSpeech":"adj.","definition":{"en":"Slow and heavy in style; tedious to read or listen to (especially about speech or writing).","zh":"文风或表达沉重拖沓的；读/听起来乏味费劲的（尤指讲话或写作）。"},"examples":[{"en":"The essay’s laboursome sentences made the main idea hard to follow.","zh":"这篇文章的句子冗长拖沓，让主旨很难跟上。"},{"en":"His laboursome explanation confused the audience instead of helping them.","zh":"他拖沓费劲的解释不但没帮助，反而把听众弄糊涂了。"}]}],"synonyms":["laborious","arduous","toilsome","strenuous","time-consuming","tedious"],"phonetic":"/ləˈbɔɹsəm/","extraExplanation":["“Laboursome”来自“labour（劳动/辛劳）+ -some（表示“充满……的、易于……的”）”。意思接近“laborious”，但在现代英语中更常见的是“laborious”；“laboursome”带有更旧式或文学化的感觉。","英式拼写常见“labour-”，美式多写作“labor-”。因此你也会看到对应的“laborious（更常用）”。在正式写作里，用“laborious”通常更自然；口语里也常用“hard / tiring / time-consuming”。"]}
{"word":"laboursomely","summary":{"en":"“Laboursomely” means doing something with difficulty and a lot of effort, often slowly.","zh":"“laboursomely”表示做事很吃力、很费劲，常常还带有缓慢艰难的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow, difficult, and tiring way; with a lot of effort.","zh":"吃力地；费力地；缓慢而艰难地（需要付出很多努力）。"},"examples":[{"en":"He laboursomely climbed the hill, stopping often to catch his breath.","zh":"他费力地爬上山坡，经常停下来喘口气。"},{"en":"The old machine laboursomely produced a few pages before it jammed again.","zh":"那台旧机器吃力地打印了几页，随后又卡住了。"},{"en":"She laboursomely copied the text by hand in the dim light.","zh":"在昏暗的灯光下，她吃力地用手把文字抄下来。"}]}],"synonyms":["laboriously","with difficulty","with great effort","toilsomely"],"phonetic":"/ˈleɪbərsəmli/","extraExplanation":["“laboursomely”比较少见，更常见的表达是“with difficulty / with great effort / laboriously”。","拼写上，“laboursomely”是英式拼写（labour）；美式通常写作“laboriously”（labor）。","它常带有“进展缓慢、过程笨重”的感觉，既可形容体力劳动（爬、搬、推），也可形容机器或工作流程运行不顺。"]}
{"word":"labra","summary":{"en":"“Labra” is a technical plural noun meaning “lips” or “lip-like edges,” especially in anatomy and biology.","zh":"“labra”是专业用语的复数名词，常指“嘴唇”或“唇状边缘”，多见于解剖与生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/Biology) the plural of “labrum”; the lips or lip-like edges of a structure (for example, the rim of a cup-shaped part, or an insect’s upper lip).","zh":"（解剖/生物）“labrum”的复数；指某结构的“唇”或类似唇的边缘（例如杯状结构的边缘，或昆虫的上唇）。"},"examples":[{"en":"In insect anatomy, the labra help cover and protect the mouthparts.","zh":"在昆虫解剖中，labra（上唇）有助于覆盖并保护口器。"},{"en":"The diagram labels the labra as the lip-like margins of the structure.","zh":"图示把 labra 标注为该结构类似“唇”的边缘部分。"}]}],"synonyms":["lips","rims","margins","edges"],"phonetic":"/ˈleɪbrə/","extraExplanation":["“labra”来自拉丁语，意思是“嘴唇”（单数为 labrum）。在英语里它多出现在医学、解剖学、生物学（尤其是昆虫学）等专业语境中。","相关词：labrum（单数，“唇/边缘”）、labial（adj. 唇的/唇状的）。"]}
{"word":"labrador","summary":{"en":"“Labrador” most commonly means a Labrador Retriever (a friendly, trainable dog). It can also refer to the Labrador region of Canada or something/someone from there.","zh":"“labrador”最常指拉布拉多寻回犬（性格友善、易训练的犬种）；也可指加拿大的拉布拉多地区，或来自/与该地区有关的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, friendly breed of dog (Labrador Retriever), often kept as a family pet and widely trained as a guide or service dog","zh":"一种大型、性格友善的犬种（拉布拉多寻回犬），常作为家庭宠物，也常被训练为导盲犬或服务犬"},"examples":[{"en":"Labradors are known for being gentle and good with children.","zh":"拉布拉多以温顺、对孩子友好而闻名。"},{"en":"She adopted a yellow Labrador from a local shelter.","zh":"她从当地收容所领养了一只黄色拉布拉多。"},{"en":"A Labrador can be trained to help people with disabilities.","zh":"拉布拉多可以被训练来帮助残障人士。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing from Labrador, a region in eastern Canada","zh":"来自拉布拉多（加拿大东部地区）的人或事物"},"examples":[{"en":"He is a Labrador who grew up near the coast.","zh":"他是拉布拉多人，在海岸附近长大。"},{"en":"The museum has art by several Labrador artists.","zh":"这家博物馆收藏了几位拉布拉多艺术家的作品。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Labrador, a region in eastern Canada","zh":"与拉布拉多（加拿大东部地区）有关的"},"examples":[{"en":"They studied Labrador history and culture.","zh":"他们研究拉布拉多的历史与文化。"},{"en":"The ship sailed through Labrador waters.","zh":"这艘船航行经过拉布拉多海域。"}]}],"synonyms":["Labrador Retriever","Lab"],"phonetic":"/ˈlæbrəˌdɔr/","extraExplanation":["日常英语里单独说“a Labrador”通常指“拉布拉多犬”（Labrador Retriever）。如果是在地理语境中（如加拿大、纽芬兰与拉布拉多省），才更可能指“拉布拉多地区/拉布拉多人/拉布拉多的”。","“Labrador Retriever”中的 retriever 指“寻回犬”，最初常用于协助猎人把打下来的鸟类从水里或草丛中叼回。拉布拉多因性格稳定、易训练，常见于导盲、搜救、辅助治疗等工作。"]}
{"word":"labradorean","summary":{"en":"“Labradorean” means “from Labrador” or “a person from Labrador,” but it’s an uncommon spelling; “Labradorian” is more standard.","zh":"“Labradorean”可指“来自拉布拉多地区的/拉布拉多人”，但拼写不常见；更标准的是“Labradorian”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Labrador (a region in eastern Canada) or to the people, culture, or things from there; also sometimes used to mean “relating to a Labrador Retriever,” though that use is uncommon.","zh":"与拉布拉多（加拿大东部地区）有关的；也可指来自那里的人、文化或事物；有时也被用来表示“与拉布拉多犬（拉布拉多寻回犬）有关”，但这种用法不常见。"},"examples":[{"en":"She studied Labradorean history and local traditions in northern Canada.","zh":"她研究了加拿大北部的拉布拉多地区历史和当地传统。"},{"en":"The museum displayed Labradorean artifacts from coastal communities.","zh":"博物馆展出了来自沿海社区的拉布拉多地区文物。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Labrador; a resident of Labrador.","zh":"拉布拉多地区的人；拉布拉多居民。"},"examples":[{"en":"As a Labradorean, he grew up with long winters and a strong fishing culture.","zh":"作为拉布拉多人，他在漫长的冬天和浓厚的渔业文化中长大。"}]}],"synonyms":["Labradorian","from Labrador"],"phonetic":"/ˌlæbrəˈdɔriən/","extraExplanation":["“Labradorean”并不是最常见的拼写；更常见的是“Labradorian”（指拉布拉多地区的人/事物）或“Labrador”（作形容词或名词）。如果你想表达“拉布拉多犬”，英语里通常直接说“Labrador (dog)”或“Labrador Retriever”，而不常用“Labradorean”。","地名 Labrador 常指加拿大纽芬兰与拉布拉多省（Newfoundland and Labrador）中的拉布拉多区域。写作或正式场合建议使用更常见的“Labradorian”，以避免被认为是拼写错误。"]}
{"word":"labradorite","summary":{"en":"Labradorite is a feldspar gemstone known for its colorful shimmering “flash,” often used in jewelry.","zh":"Labradorite（拉长石）是一种长石类宝石，以多彩的闪光/变彩效果闻名，常用于首饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gray-to-dark feldspar gemstone that shows a colorful, shimmering effect (often blue, green, or gold) when light hits it; used in jewelry and decoration","zh":"一种灰色到深色的长石类宝石，在光照下会呈现蓝、绿、金等彩虹般的闪光（常称“变彩/虹彩效应”），常用于首饰与装饰品"},"examples":[{"en":"She wore a labradorite pendant that flashed blue when it moved.","zh":"她戴着一枚拉长石吊坠，晃动时会闪出蓝光。"},{"en":"The artist chose labradorite for its natural, shifting colors.","zh":"艺术家选择拉长石，是因为它自然且会变化的色彩。"}]}],"synonyms":["feldspar (general)"],"phonetic":"/ləˈbrædəˌraɪt/","extraExplanation":["“Labradorite”因最早在加拿大拉布拉多地区被系统发现而得名。它著名的闪彩现象常被称为“labradorescence（拉长石变彩）”，并不是表面涂层，而是矿物内部层状结构对光的干涉与散射造成的视觉效果。","在日常英语里，它更多出现在珠宝、收藏、矿物学语境中；购买或描述时常搭配的词有：flash（闪光）、shimmer（微光）、iridescent（虹彩的）、gemstone（宝石）。"]}
{"word":"labradoritic","summary":{"en":"An adjective meaning “related to labradorite,” often implying its characteristic shimmering colors.","zh":"形容词，意为“与拉长石有关的”，常暗示其典型的变彩闪光。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the mineral labradorite, especially showing the blue-green shimmering effect (labradorescence) often seen in it.","zh":"与“拉长石”（labradorite）这种矿物有关的；尤指呈现其常见的蓝绿变彩/闪光效应（拉长石光彩、变彩现象）的。"},"examples":[{"en":"The sculptor chose a labradoritic stone because it flashes blue under light.","zh":"雕塑家选择了带拉长石光彩的石料，因为它在光线下会泛出蓝色闪光。"},{"en":"Geologists described the rock as labradoritic in composition.","zh":"地质学家描述这块岩石的成分具有拉长石特征。"}]}],"synonyms":["labradorite-bearing","iridescent (in appearance)","opalescent (in appearance)"],"phonetic":"/ˌlæbrəˈdɔrɪtɪk/","extraExplanation":["“labradoritic”多见于地质/矿物学语境，指“含拉长石的、呈拉长石特征的”，也可强调其典型的“变彩（labradorescence）”视觉效果。","词源上与加拿大拉布拉多（Labrador）有关：拉长石因早期在拉布拉多地区被记录而得名。"]}
{"word":"labral","summary":{"en":"“Labral” means relating to the labrum, a ring of cartilage in joints like the shoulder or hip.","zh":"“Labral”表示“与盂唇有关的”，盂唇是肩或髋等关节里的一圈软骨组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a labrum (a ring of cartilage in a joint, especially the shoulder or hip)","zh":"（解剖）与盂唇有关的；盂唇的（盂唇是关节中的一圈软骨，尤指肩关节或髋关节）"},"examples":[{"en":"The MRI showed a labral tear in his right shoulder.","zh":"核磁共振显示他右肩有盂唇撕裂。"},{"en":"She started physical therapy after labral surgery on her hip.","zh":"她髋关节做了盂唇手术后开始进行物理治疗。"}]}],"synonyms":["of the labrum","labrum-related"],"phonetic":"/ˈlæbrəl/","extraExplanation":["“Labral”来自名词“labrum”（盂唇/关节盂唇）。在医疗语境里最常见的搭配是：labral tear（盂唇撕裂）、labral repair（盂唇修复）、acetabular labrum（髋臼盂唇）、glenoid labrum（肩盂盂唇）。","日常英语中很少单独说“labral”，通常出现在医学检查、诊断或运动损伤相关的表达中。"]}
{"word":"labras","summary":{"en":"“Labras” is not a common English vocabulary word; it’s usually a typo for “labors” or a proper name.","zh":"“labras”不是常见英语词汇；多半是把“labors”拼错了，或是专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In English text, “labras” is most often a typo for “labors” (plural of labor) or a proper name (a surname/place name).","zh":"不是标准英语单词。在英语文本中，“labras”最常见是把“labors”（labor 的复数）打错了，或是作为专有名词（姓氏/地名）。"},"examples":[{"en":"I think you meant “labors”: The labors of the workers deserve respect.","zh":"你可能想写的是“labors”：工人的辛劳值得尊重。"},{"en":"If “Labras” is a name: Ms. Labras will join the meeting tomorrow.","zh":"如果“Labras”是名字：Labras 女士明天会参加会议。"}]}],"phonetic":"/ˈlæbrəz/","extraExplanation":["“labors”在英语里常见于较正式的表达（例如 *the labors of love* 表示“甘之如饴的付出/爱之劳作”）。","如果你是在学西班牙语：*labras* 是动词 *labrar* 的变位之一（“你耕作/你雕刻/你打造”等含义，视语境而定），但这不是英语用法。","你希望我解释的是“labors”、还是某个专有名词“Labras”？告诉我一句原句/上下文，我可以给出最准确的释义。"]}
{"word":"labredt","summary":{"en":"“labredt” isn’t a recognized English word; it’s likely a typo. Share the context and I’ll help identify the intended word.","zh":"“labredt”不是常见英语单词，可能是拼写错误。提供语境我可以帮你确定原本想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username.","zh":"不是标准英语单词，可能是拼写错误，或是人名/用户名。"},"examples":[{"en":"I can’t find “labredt” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“labredt”——你能检查一下拼写吗？"},{"en":"Did you mean “labeled” (marked with a label) or “Labrador” (a dog breed / a region in Canada)?","zh":"你是想说“labeled”（贴了标签的/被标注的）还是“Labrador”（拉布拉多犬/加拿大的拉布拉多地区）？"}]}],"extraExplanation":["“labredt”看起来像是键盘误按或拼写颠倒导致的错误拼写。你可以告诉我：\n1）你是在什么句子/语境里看到它的？\n2）你想表达的中文意思是什么？\n我就能更准确地帮你找到对应的英文单词（例如 labeled / Labrador / labored 等）。"]}
{"word":"labret","summary":{"en":"A labret is a piercing or ornament worn just below the lower lip, especially in body piercing or in certain cultural traditions.","zh":"labret 指下唇正下方的穿孔或佩戴的饰品；也可指某些文化传统中的下唇唇饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piercing or piece of jewelry worn in the labret (the area just below the lower lip).","zh":"唇下钉；下唇正下方（唇沟/下唇下方皮肤）处的穿孔或佩戴的饰品。"},"examples":[{"en":"She got a labret piercing and chose a small silver stud.","zh":"她打了唇下钉，选了一颗小小的银色耳钉式饰品。"},{"en":"The labret jewelry rubbed against his teeth at first.","zh":"一开始，唇下钉的饰品会摩擦到他的牙齿。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of ornament or plug traditionally worn in a pierced lower lip in some cultures.","zh":"（某些文化中）穿过下唇佩戴的传统唇饰（如唇塞、唇钉等）。"},"examples":[{"en":"In some communities, a labret can signal identity or social status.","zh":"在一些群体中，传统唇饰可能象征身份或社会地位。"},{"en":"The museum displayed historical photos of people wearing labrets.","zh":"博物馆展出了人们佩戴传统唇饰的历史照片。"}]}],"synonyms":["lip piercing","labret piercing","lip stud","lip ornament"],"phonetic":"/ləˈbrɛt/","extraExplanation":["“Labret”来自拉丁语 labrum（“嘴唇”）。现代英语里最常见的用法是指“下唇正下方的穿孔/饰品”（labret piercing）。","文化语境：在因纽特人（Inuit）与部分阿拉斯加原住民等群体中，唇饰在不同地区可能有不同含义（如成年礼、身份标记等）。谈论这类传统时，使用尊重、具体的表达更合适。","相关词：lip piercing（唇部穿孔）、stud（耳钉/钉状饰品）、ring（环）、plug（塞状饰品）、vertical labret（垂直唇下穿孔）。"]}
{"word":"labretifery","summary":{"en":"“Labretifery” is not a recognized English word; it is likely a misspelling. You may mean “labret” (a type of lip piercing/jewelry).","zh":"“labretifery”不是常见/规范的英语单词，可能是拼写错误。你可能想表达“labret”（一种唇钉穿孔/饰品）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It does not appear in major dictionaries and is likely a misspelling or an invented/rare form.","zh":"不是标准英语单词。在主流词典中通常查不到，可能是拼写错误或自造/极少见的形式。"},"examples":[{"en":"I couldn’t find “labretifery” in a dictionary—did you mean “labret piercing” or “labret jewelry”?","zh":"我在词典里找不到“labretifery”——你是不是想写“labret piercing（唇钉穿孔）”或“labret jewelry（唇钉饰品）”？"},{"en":"If you’re talking about a lip piercing, the common word is “labret.”","zh":"如果你说的是嘴唇穿孔，常用的词是“labret（唇钉/下唇饰钉）”。"}]}],"extraExplanation":["“labret”是一个真实存在的英语词，指一种（常见于下唇附近的）唇部穿孔/饰钉，也可指某些文化中的唇饰。你输入的“labretifery”看起来像把“labret”和某种后缀混在一起的拼写，但英语里并没有固定用法。","如果你告诉我它出现的句子或你想表达的意思（例如：唇钉穿孔的过程？某种饰品？某个品牌/用户名？），我可以帮你推测最可能的正确拼写，并给出准确释义。"]}
{"word":"labrets","summary":{"en":"Labrets are the plural of “labret,” most commonly meaning a lower-lip piercing or the stud worn there.","zh":"Labrets 是 labret 的复数，最常指下唇（或唇下）穿孔或佩戴在那里的唇钉饰品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of body piercing or the jewelry worn through the lower lip (or the area just below it); “labrets” is the plural form of “labret.”","zh":"一种唇钉/唇部穿孔（通常在下唇或下唇下方的位置），也可指穿孔处佩戴的饰品；“labrets”为“labret”的复数。"},"examples":[{"en":"She replaced her labret with a smaller stud for work.","zh":"她把唇钉换成了更小的钉式饰品以适应工作场合。"},{"en":"The shop sells titanium labrets in different lengths.","zh":"这家店卖不同长度的钛合金唇钉。"},{"en":"Some people choose labrets instead of a lip ring because they feel more comfortable.","zh":"有些人会选择唇钉而不是唇环，因为他们觉得更舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology) a small, lip-like flap or structure near the mouth in some animals.","zh":"（动物学）某些动物口部附近的小型“唇状”结构或皮瓣。"},"examples":[{"en":"In some species, the labret helps guide food toward the mouth.","zh":"在某些物种中，这种唇状结构有助于把食物引向口部。"}]}],"synonyms":["lip stud","lip piercing","labret stud","lower-lip piercing"],"phonetic":"/ˈlæbrət/","extraExplanation":["“labret”来自拉丁语 labrum（“嘴唇”）。在现代英语里最常见的用法与身体穿孔文化有关：既可以指穿孔位置（下唇/唇下），也常用来指那种“平底圆盘+柱杆”的饰品本体。购买时常会看到长度（post length）与材质（如钛、医用钢）等规格。"]}
{"word":"labrid","summary":{"en":"A labrid is a wrasse-family fish (family Labridae).","zh":"labrid 指隆头鱼科（Labridae）的鱼类成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish of the wrasse family (Labridae), common on coral reefs and rocky coasts","zh":"隆头鱼科（Labridae）的鱼；常见于珊瑚礁或岩礁海岸的“海猪鱼/隆头鱼（wrasse）”一类"},"examples":[{"en":"Many labrids live on coral reefs and help keep the ecosystem healthy.","zh":"许多隆头鱼科鱼类生活在珊瑚礁上，并帮助维持生态系统健康。"},{"en":"A cleaner labrid picks parasites off larger fish.","zh":"一种“清洁鱼”的隆头鱼会从大型鱼身上啄食寄生虫。"}]}],"synonyms":["wrasse (common name)"],"phonetic":"/ˈlæbrɪd/","extraExplanation":["“labrid”是生物学/海洋学里的分类学用词，指“隆头鱼科”的成员；日常英语更常说“wrasse（隆头鱼）”。","词源来自该科的拉丁学名 Labridae；因此它更像“学术写法”，在科普文章、论文或鱼类图鉴里更常见。","如果你本来想查的是拼写相近的词：labroid（adj./n.，与隆头鱼科有关的）也可能是你要的。"]}
{"word":"labridae","summary":{"en":"Labridae is the scientific family name for wrasses—often colorful marine fishes found around reefs and rocky coasts.","zh":"Labridae 是“隆头鱼科”的学名，指一类常色彩鲜艳、常见于珊瑚礁与岩礁海岸的海水鱼（wrasses）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mostly marine fishes called wrasses, known for bright colors and living around coral reefs and rocky coasts","zh":"隆头鱼科：一种主要生活在海洋中的鱼类科，俗称“隆头鱼/唇鱼（wrasses）”，常色彩鲜艳，多栖息于珊瑚礁与岩礁海岸"},"examples":[{"en":"Many Labridae species live in coral reefs and help keep the reef healthy.","zh":"许多隆头鱼科（Labridae）的物种生活在珊瑚礁中，并帮助维持珊瑚礁的健康。"},{"en":"The fish guide lists the cleaner wrasse under the family Labridae.","zh":"这本鱼类图鉴把清洁隆头鱼归在隆头鱼科（Labridae）下。"}]}],"synonyms":["wrasse family"],"phonetic":"/ˈlæbrɪdiː/","extraExplanation":["“Labridae”是拉丁化的科学分类名称（科名），在学术写作中常首字母大写并用斜体表示（*Labridae*）。日常英文里更常说“wrasse(s)”或“the wrasse family”。","隆头鱼科里有一些很有名的行为：例如“清洁鱼（cleaner wrasse）”会替其他鱼清除寄生虫；还有一些种类会在成长过程中改变性别（性转现象在该科较常见）。"]}
{"word":"labroid","summary":{"en":"Labroid means “related to wrasses (Labridae)” and can also refer to a wrasse-like fish.","zh":"Labroid 指“与隆头鱼（隆头鱼科）有关的”，也可指一条隆头鱼类（隆头鱼或类似的鱼）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) relating to wrasses (fish of the family Labridae), or to the wrasse-like group of fishes.","zh":"（形容词）与隆头鱼（隆头鱼科 Labridae）有关的；隆头鱼类的。"},"examples":[{"en":"Many labroid fishes are brightly colored and live on coral reefs.","zh":"许多隆头鱼类色彩鲜艳，生活在珊瑚礁上。"},{"en":"The aquarium guide describes labroid species that help clean parasites from other fish.","zh":"水族指南介绍了一些隆头鱼类物种，它们会帮其他鱼清除寄生虫。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) a labroid fish; a wrasse or a related fish.","zh":"（名词）隆头鱼类；隆头鱼或与之相关的鱼。"},"examples":[{"en":"Wrasses are common labroids in tropical seas.","zh":"隆头鱼是在热带海域很常见的隆头鱼类。"},{"en":"This labroid uses its strong jaws to crush small shellfish.","zh":"这条隆头鱼类用强有力的颌骨咬碎小型贝类。"}]}],"synonyms":["wrasse (common word)","labrid (technical, for the family Labridae)","wrasse-like"],"phonetic":"/ˈlæ.brɔɪd/","extraExplanation":["“labroid”常见于动物学/鱼类学语境，日常英语里不常用；更常见的说法是“wrasse（隆头鱼）”或“the wrasse family (Labridae)”。","词源来自拉丁化的科名 *Labridae*，再加上“-oid”（表示“……样的/类似的”），因此可理解为“像隆头鱼的、与隆头鱼有关的”。","隆头鱼（wrasse）在海洋生态中很有名的一点是“清洁鱼（cleaner fish）”行为：有些种类会啄食其他鱼身上的寄生虫，形成互利关系。"]}
{"word":"labroidea","summary":{"en":"Labroidea is a scientific name for a superfamily of marine fishes, especially wrasses and close relatives.","zh":"Labroidea是鱼类分类学名，指以隆头鱼及其近缘类群为代表的一支海水鱼总科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific taxonomic name for a group (superfamily) of marine fishes that includes wrasses and their close relatives (in some classifications, also including parrotfishes).","zh":"鱼类分类学名（总科）：指包含隆头鱼（wrasses）及其近缘类群的一组海水鱼（在某些分类体系中也可能包含鹦嘴鱼等）。"},"examples":[{"en":"Many colorful reef fishes, such as wrasses, are placed in the superfamily Labroidea in some taxonomies.","zh":"在某些分类体系中，许多色彩鲜艳的珊瑚礁鱼类（如隆头鱼）被归入Labroidea（隆头鱼总科）。"},{"en":"The paper discusses evolutionary relationships within Labroidea using DNA data.","zh":"这篇论文使用DNA数据讨论Labroidea（隆头鱼总科）内部的进化关系。"}]}],"synonyms":["wrasse superfamily","taxonomic superfamily"],"phonetic":"/læˈbrɔɪdiə/","extraExplanation":["Labroidea是拉丁化的科学名称，常见于生物学论文与鱼类分类资料中；不同学者/数据库对其范围（是否包含某些科，如鹦嘴鱼相关类群）可能有差异，因此阅读时要留意所采用的分类体系。","词根常被解释为与拉丁语labrum（“嘴唇”）有关，呼应隆头鱼类常见的“厚唇/突出的嘴部”外形特征。"]}
{"word":"labroids","summary":{"en":"“Labroids” refers to labroid fishes (Labroidei), including wrasses and related reef fish.","zh":"“labroids”指唇鱼类（Labroidei），包括隆头鱼等珊瑚礁相关鱼类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"fish in the group Labroidei (labroid fishes), such as wrasses and their relatives; often reef fish with strong jaws and noticeable lips.","zh":"唇鱼类（Labroidei）的一类鱼，如隆头鱼（wrasse）及其近亲；常见于珊瑚礁，颌部有力、嘴唇较明显。"},"examples":[{"en":"Many labroids live on coral reefs and help control small invertebrates.","zh":"许多唇鱼类生活在珊瑚礁上，能帮助控制小型无脊椎动物的数量。"},{"en":"Wrasses are labroids and are known for cleaning parasites off other fish.","zh":"隆头鱼属于唇鱼类，因会为其他鱼清除寄生虫而出名。"}]}],"synonyms":["labroid fishes","wrasses (as a common example)"],"phonetic":"/ˈlæb.rɔɪdz/","extraExplanation":["“Labroids”是复数名词，单数可写作“labroid”（指唇鱼类的个体或“唇鱼类的”）。在一般英语里不算常用词，更常见的说法是“labroid fishes”或直接说“wrasses（隆头鱼）”。","词源上与拉丁语/新拉丁语“labrum（嘴唇）”有关，因为这类鱼的嘴唇常较明显。"]}
{"word":"labrosaurid","summary":{"en":"A labrosaurid is an (older/now often outdated) term for a theropod dinosaur placed in the group Labrosauridae.","zh":"labrosaurid 指被归入“拉布罗龙科”的兽脚类恐龙成员；该分类在现代研究中多被视为较旧或不确定的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the (historically used) dinosaur group Labrosauridae—carnivorous theropod dinosaurs once thought to be a distinct family, but now usually treated as an outdated or uncertain classification.","zh":"“Labrosauridae（拉布罗龙科）”的成员：一种过去使用的恐龙分类，指被认为属于独立一科的食肉兽脚类恐龙；但在现代研究中多被视为过时或分类地位不确定的名称。"},"examples":[{"en":"Some older books describe certain theropods as labrosaurids, but newer studies often avoid the term.","zh":"一些较早的书会把某些兽脚类称为“labrosaurids（拉布罗龙科成员）”，但较新的研究往往避免使用这个词。"},{"en":"The fossil was once labeled a labrosaurid, though later it was reclassified more broadly as a theropod.","zh":"这块化石曾被标注为“labrosaurid”，但后来被更宽泛地重新归为兽脚类。"}]}],"synonyms":["theropod (general term)","carnivorous dinosaur (general term)"],"phonetic":"/ˌlæbrəˈsɔrɪd/","extraExplanation":["这个词来自属名 Labrosaurus（拉布罗龙），再加上表示“……类/……科相关”的后缀 -id（常见于生物分类与非正式群体称呼，如 hominid）。","在古生物学文献中，“Labrosauridae”曾被用来容纳一些大型食肉恐龙，但随着发现更多化石与改进分类方法，该“科”常被认为缺乏明确诊断特征，因此在现代用法中较少见。阅读旧资料时遇到该词，通常可按“某类早期被这样称呼的兽脚类食肉恐龙”来理解。"]}
{"word":"labrosauroid","summary":{"en":"“Labrosauroid” means “Labrosaurus-like,” a rare term mostly found in older dinosaur/paleontology writing.","zh":"“Labrosauroid”意为“类似 Labrosaurus 的”，很少见，多见于较早的恐龙/古生物学资料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling or relating to Labrosaurus (a genus name historically used for a meat‑eating dinosaur); more generally, “labrosaur‑like.”","zh":"类似或与 Labrosaurus（早期用于指代一种食肉恐龙的属名）有关；更广义为“类 Labrosaurus 的／类似 labrosaur 的”。"},"examples":[{"en":"The report described the fragment as labrosauroid, but the identification was uncertain.","zh":"报告把那块化石碎片描述为“类 Labrosaurus 的”，但鉴定并不确定。"},{"en":"Some older books used labrosauroid to group certain theropod dinosaurs by general shape.","zh":"一些较旧的书会用 labrosauroid 按大致外形把某些兽脚类恐龙归为一类。"}]}],"synonyms":["labrosaur-like","-oid (as a pattern in words meaning “-like”)"],"phonetic":"/ˌlæbrəˈsɔːrɔɪd/","extraExplanation":["这个词非常少见，多出现在较早的古生物学文献或收藏品说明里。它由专名 Labrosaurus + 后缀 -oid（“……般的／类似……的”）构成。","需要注意：Labrosaurus 本身在分类史上曾经被反复讨论，有些材料里它被视为“疑难属”（分类地位不够清楚）。因此 labrosauroid 往往表示“看起来像/被认为像”，而不一定是严格的现代分类。"]}
{"word":"labrosaurus","summary":{"en":"Labrosaurus is an old, often doubtful dinosaur genus name based on incomplete fossils.","zh":"Labrosaurus 是一个较早提出、常被认为存疑的恐龙属名，依据的化石材料不完整。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Labrosaurus: a genus name given to a large meat-eating dinosaur (a theropod), known from fragmentary fossils and often treated as doubtful or obsolete in modern classification.","zh":"Labrosaurus（拉布罗龙）：一个曾被用来命名大型食肉恐龙（兽脚类）的属名。由于化石材料零碎，现代分类中常被认为存疑或已不再使用。"},"examples":[{"en":"Some older dinosaur books mention Labrosaurus, but many newer sources do not use the name.","zh":"一些较早的恐龙书会提到 Labrosaurus，但很多较新的资料并不使用这个名称。"},{"en":"The fossil remains labeled “Labrosaurus” are too incomplete to define a clear, separate genus.","zh":"被标为“Labrosaurus”的化石遗骸过于零散，难以明确界定为一个独立的属。"}]}],"synonyms":["(no exact synonym; sometimes treated as a dubious/obsolete genus name)"],"phonetic":"/ˌlæbrəˈsɔrəs/","extraExplanation":["词源：来自希腊语，-saurus 表示“蜥蜴/恐龙”，前半部分 labro- 常被解释为与“贪食/大口”相关的含义，因此有时会被译作与“贪食蜥蜴/大口蜥蜴”相近的意思。","分类背景：Labrosaurus 是19世纪提出的属名之一，但因标本不完整、特征不够明确，后来常被视为“可疑属”（dubious genus），其材料有时被重新归入其他兽脚类恐龙。"]}
{"word":"labrose","summary":{"en":"“Labrose” is usually a surname (a proper name), not a common English dictionary word.","zh":"“Labrose”通常是姓氏（专有名词），不是常见的英语词典词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). “LaBrose/Labrose” is not a common standard English vocabulary word; it most often appears as a personal or family name (sometimes from French spelling such as “La Brose” or “La Brosse”).","zh":"一个姓氏（家族名字）。“LaBrose/Labrose”不是常见的标准英语词汇；它更常见于人名或姓氏（有时源自法语拼写，如“La Brose”或“La Brosse”）。"},"examples":[{"en":"Ms. Labrose will speak at the meeting today.","zh":"Labrose 女士今天将在会议上发言。"},{"en":"I found the email under the name LaBrose.","zh":"我在 LaBrose 这个名字下找到了那封邮件。"}]}],"phonetic":"/ləˈbroʊz/","extraExplanation":["“Labrose/LaBrose”在英语里通常作为专有名词使用（姓名/姓氏）。如果你是在阅读、作业或歌曲/小说里遇到它，给我一句原文上下文，我可以判断它是不是人名、地名，还是你想查的其实是别的单词（比如 rose, bros, 或法语的 brosse 等）。"]}
{"word":"labrum","summary":{"en":"Labrum: the cartilage “lip” that lines and supports socket joints like the shoulder and hip.","zh":"Labrum：位于肩或髋等关节窝边缘、起支撑与稳定作用的软骨“唇”（盂唇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ring of strong cartilage around the rim of a socket joint (especially the shoulder or hip) that helps deepen the socket and stabilize the joint.","zh":"关节窝边缘的一圈软骨（尤其是肩关节或髋关节的盂唇），用来加深关节窝并增强关节稳定性。"},"examples":[{"en":"The MRI showed a tear in the shoulder labrum.","zh":"核磁共振显示肩关节盂唇有撕裂。"},{"en":"Physical therapy can help some people recover from a mild hip labrum injury.","zh":"物理治疗可以帮助一些人从轻度髋关节盂唇损伤中恢复。"}]}],"synonyms":["labral cartilage","cartilage rim"],"phonetic":"/ˈleɪbrəm/","extraExplanation":["“Labrum”来自拉丁语，原意是“边缘、唇”。在解剖学里它常译作“盂唇”，最常见的搭配是 shoulder labrum（肩盂唇）和 hip labrum（髋臼唇/髋盂唇）。","常见相关表达：labral tear（盂唇撕裂）、SLAP tear（肩部一种特定的上盂唇撕裂类型，常见于投掷运动员）。日常英语里多用于医学/运动损伤语境。"]}
{"word":"labrums","summary":{"en":"“Labrums” is the plural of “labrum,” most commonly meaning cartilage rims in the shoulder or hip that help stabilize the joint; it can also mean insect upper lips in biology.","zh":"“Labrums”是“labrum”的复数，最常指肩或髋关节中稳定关节的软骨边缘（盂唇）；在生物学中也可指昆虫口器的上唇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The plural of labrum: rings or rims of cartilage that deepen and stabilize a joint socket, especially in the hip (acetabular labrum) or shoulder (glenoid labrum).","zh":"（解剖）labrum 的复数：环状或边缘状的软骨组织，用来加深并稳定关节窝，常见于髋关节（髋臼盂唇）或肩关节（肩盂盂唇）。"},"examples":[{"en":"The MRI showed tears in both shoulder labrums.","zh":"核磁共振显示两侧肩关节的盂唇都有撕裂。"},{"en":"Rehab exercises can help after a hip labrums injury.","zh":"髋关节盂唇受伤后，康复训练可能会有帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) The plural of labrum: a lip-like structure, especially the upper lip of an insect’s mouthparts.","zh":"（生物）labrum 的复数：唇状结构，尤指昆虫口器的上唇。"},"examples":[{"en":"Under the microscope, the insect’s labrums looked like small plates.","zh":"在显微镜下，这只昆虫的上唇看起来像小薄片。"}]}],"synonyms":["cartilage rim","joint rim (cartilage)","glenoid labrum","acetabular labrum"],"phonetic":"/ˈlæbrəm/","extraExplanation":["“Labrums”是可数名词复数，单数是“labrum”。在医学语境里更常见的是具体说法：shoulder/hip labrum（肩/髋盂唇）。","常见搭配：labrum tear（盂唇撕裂）、labrum repair（盂唇修复手术）、glenoid labrum（肩盂盂唇）、acetabular labrum（髋臼盂唇）。"]}
{"word":"labrus","summary":{"en":"Labrus is a scientific genus name for certain wrasses (marine fish).","zh":"Labrus 是某些隆头鱼（海水鱼）的属名（科学分类名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for some wrasses (brightly colored marine fish) found in the Atlantic and Mediterranean","zh":"（生物）隆头鱼属：一些生活在大西洋与地中海的隆头鱼（色彩鲜艳的海水鱼）的属名"},"examples":[{"en":"Labrus is a genus of wrasses commonly seen in rocky coastal waters.","zh":"Labrus（隆头鱼属）是隆头鱼的一类，常见于多岩石的近海水域。"},{"en":"In field guides, you may see species names that begin with Labrus.","zh":"在鱼类图鉴中，你可能会看到以 Labrus 开头的物种学名。"}]}],"synonyms":["wrasse (general term)"],"phonetic":"/ˈlæbrəs/","extraExplanation":["“Labrus”是拉丁化的学名（属名），通常在英文里以大写开头并用斜体书写（Labrus）。在日常英语中更常用的词是“wrasse”（隆头鱼）。","如果你是在阅读学术文章或自然纪录片字幕中遇到它，它多半不是普通词汇，而是分类学名称，用来指代某一类鱼的“属”。"]}
{"word":"labrusca","summary":{"en":"Labrusca is a North American grape species (Vitis labrusca), associated with Concord-type grapes and a distinctive aroma.","zh":"Labrusca 指北美的美洲葡萄品种（Vitis labrusca），常与康科德类葡萄及其独特香气相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American grape species (Vitis labrusca), often called the fox grape, used to make Concord-style grapes, juices, and some wines.","zh":"一种北美葡萄品种（Vitis labrusca，美洲葡萄/狐狸葡萄），常用于康科德（Concord）等葡萄、葡萄汁及部分葡萄酒的生产。"},"examples":[{"en":"Concord grapes are a type of labrusca grape commonly used for juice and jelly.","zh":"康科德葡萄属于一种常见的 labrusca 葡萄，常用来做果汁和果酱。"},{"en":"Some people describe labrusca-based wines as having a strong, distinctive aroma.","zh":"有些人形容以 labrusca 为主的葡萄酒带有强烈而独特的香气。"}]}],"synonyms":["Vitis labrusca","fox grape"],"phonetic":"/ləˈbrʌskə/","extraExplanation":["“Labrusca”常作为葡萄学/酿酒语境中的分类词使用，指“美洲葡萄（Vitis labrusca）系”的风格或血统。它与常见的欧洲葡萄 Vitis vinifera（用于大多数传统葡萄酒）相对。","在英文品鉴里常会提到“foxy（狐狸味）”来形容 labrusca 葡萄特有的香气（有些人觉得像麝香、葡萄汽水或果香很冲）；这是文化与品味偏好相关的描述，并不一定是贬义。"]}
{"word":"labrys","summary":{"en":"A labrys is a double‑headed axe, especially associated with ancient Minoan Crete as a symbolic object.","zh":"labrys 指“双头斧/双刃斧”，尤与古代克里特岛的米诺斯文明有关，常被视为象征物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a double‑headed axe (an axe with two blades), especially known as a symbol in ancient Minoan culture","zh":"（双刃）双头斧；（尤指）与古代克里特岛米诺斯文化相关的象征物"},"examples":[{"en":"The museum displayed a bronze labrys from ancient Crete.","zh":"博物馆展出了一把来自古代克里特岛的青铜双头斧。"},{"en":"In Minoan art, the labrys often appears as a religious or ceremonial symbol.","zh":"在米诺斯艺术中，双头斧常作为宗教或仪式性的象征出现。"}]}],"synonyms":["double-headed axe","double-bitted axe"],"phonetic":"/ˈlæb.rɪs/","extraExplanation":["“labrys”常出现在考古、古文明与艺术史语境中，和“Minos / Minoan（米诺斯/米诺斯文明）”“Crete（克里特岛）”一起出现的概率很高。","除了作为武器/工具的“斧”，它也常被当作“象征符号”来讨论（例如宗教仪式、权力或身份象征）。具体含义会因时代与研究观点而不同。","现代语境里，这个符号有时也会被一些社群拿来作为标志使用；阅读相关内容时可以留意具体来源与语境，避免把古代含义与现代用法混为一谈。"]}
{"word":"labs","summary":{"en":"“Labs” most commonly means multiple laboratories; it can also mean Labrador retrievers (dogs).","zh":"“labs”最常指多个实验室；也可指拉布拉多寻回犬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) places where scientific, medical, or technical experiments and tests are done; short for “laboratories.”","zh":"（复数）进行科学、医学或技术实验与检测的地方；“laboratory（实验室）”的简称。"},"examples":[{"en":"The students worked in the labs after class.","zh":"学生们课后在实验室里做实验。"},{"en":"Our hospital has several labs for blood tests.","zh":"我们医院有好几个做血液检测的实验室。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural) Labrador retrievers (a popular dog breed); often written “Labs.”","zh":"（复数）拉布拉多寻回犬（一种很受欢迎的犬种）；常写作“Labs”。"},"examples":[{"en":"Two Labs live next door, and they’re very friendly.","zh":"隔壁住着两只拉布拉多，它们很友好。"},{"en":"Labs are often used as guide dogs.","zh":"拉布拉多常被用作导盲犬。"}]}],"synonyms":["laboratories","research labs","testing labs","Labrador retrievers"],"phonetic":"/læbz/","extraExplanation":["“lab”是“laboratory”的常见口语缩写；写作“labs”时通常指“多个实验室”。在学术环境里也可能指“实验课/实验课教室”（例如：computer labs 电脑机房）。","指狗时，“Lab/Labs”一般大写，来源于犬种名“Labrador retriever（拉布拉多寻回犬）”。根据语境（学校/医院 vs. 宠物/犬种）判断含义最自然。"]}
{"word":"laburnum","summary":{"en":"Laburnum is a small ornamental tree known for its drooping clusters of bright yellow flowers.","zh":"Laburnum 指金链花（树），以成串下垂的亮黄色花而闻名，常用于观赏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tree with hanging clusters of bright yellow flowers, often grown in gardens","zh":"金链花（树）；一种小乔木，开成串下垂的亮黄色花，常见于园林栽培"},"examples":[{"en":"The laburnum in our yard blooms in late spring with long yellow flower chains.","zh":"我们院子里的金链花树在春末开花，垂下长长的黄色“花链”。"},{"en":"Many people plant laburnum for its showy flowers, but the seeds are poisonous.","zh":"很多人种金链花是因为它的花很醒目，但它的种子有毒。"}]}],"synonyms":["golden chain tree","golden chain"],"phonetic":"/ləˈbɝːnəm/","extraExplanation":["“Laburnum”常指“金链花属”的植物，最常见的是Common laburnum（Laburnum anagyroides）。它的花序像一串串金色项链，因此中文常译为“金链花”。","文化与提示：在英国等地，金链花常用于花园观赏；但其种子、叶等部位含有毒性成分（尤其对儿童和宠物危险），园艺上会特别提醒避免误食。"]}
{"word":"laburnums","summary":{"en":"Laburnums are golden chain trees—ornamental trees with long, hanging clusters of yellow flowers.","zh":"Laburnums 指金链花（树），一种开黄色下垂花串的观赏树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of laburnum: a small ornamental tree with long hanging clusters of bright yellow flowers (often called the golden chain tree).","zh":"laburnum 的复数：金链花（或金链树），一种观赏小乔木，开下垂成串的亮黄色花。"},"examples":[{"en":"The laburnums were in bloom, turning the street bright yellow.","zh":"金链花盛开时，把整条街都染成了亮黄色。"},{"en":"In late spring, many gardens look spectacular when the laburnums flower.","zh":"春末时，许多花园在金链花开花时看起来格外壮观。"}]}],"synonyms":["golden chain (tree)","laburnum trees"],"phonetic":"/ləˈbɝnəmz/","extraExplanation":["“Laburnum”在英式园艺语境中很常见，常用来形容春末初夏那种“像金色瀑布一样下垂”的花序，因此也常见别名“golden chain (tree)”。","需要注意：金链花的种子、叶子等部位有毒（含金雀花碱等生物碱），园艺环境中通常会提醒儿童和宠物不要误食。"]}
{"word":"labyrinth","summary":{"en":"A labyrinth is a maze or anything so complex that it’s hard to find your way through (literally or figuratively).","zh":"labyrinth 指“迷宫”，也常比喻“复杂到难以理清或走出”的局面或体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A complicated network of paths or passages that is difficult to find your way through; a maze.","zh":"错综复杂、很难找到出口的通道网络；迷宫。"},"examples":[{"en":"The old palace has a labyrinth of narrow hallways.","zh":"那座老宫殿里有一条条狭窄走廊组成的迷宫。"},{"en":"We got lost in the hedge labyrinth for almost an hour.","zh":"我们在树篱迷宫里迷路了将近一小时。"}]},{"partOfSpeech":"n.","definition":{"en":"Any complex situation, system, or set of rules that is hard to understand or navigate.","zh":"（比喻）复杂难懂、难以理清或应付的局面/体系/规则。"},"examples":[{"en":"Getting a visa can feel like a labyrinth of paperwork.","zh":"办理签证常常像在文书迷宫里打转。"},{"en":"She tried to navigate the labyrinth of office politics.","zh":"她试着在复杂的办公室政治中周旋。"}]}],"synonyms":["maze","tangle","complexity","network"],"phonetic":"/ˈlæbəˌrɪnθ/","extraExplanation":["“Labyrinth”常与希腊神话相关：克里特岛的迷宫（Labyrinth of Crete）由工匠代达罗斯（Daedalus）建造，用来囚禁弥诺陶洛斯（Minotaur）。因此它在文学与文化里常象征“困住人、让人迷失的复杂结构”。","与“maze”相比：日常英语里两者常可互换；但在一些语境中“labyrinth”更带有“巨大、古老、带神秘/象征意味”的感觉，也更常用于比喻抽象复杂性。"]}
{"word":"labyrinthal","summary":{"en":"“Labyrinthal” means maze-like—very complex, winding, or difficult to follow; similar to “labyrinthine.”","zh":"“labyrinthal”意为“迷宫般的”——非常复杂、曲折或难以理解；与“labyrinthine”意思相近。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a labyrinth; very complex, winding, or hard to understand.","zh":"像迷宫一样的；错综复杂的、曲折的、难以理解的。"},"examples":[{"en":"The old city has labyrinthal streets that are easy to get lost in.","zh":"这座老城的街道像迷宫一样错综复杂，很容易迷路。"},{"en":"She found the legal process labyrinthal and confusing.","zh":"她觉得法律程序像迷宫一样复杂又令人困惑。"}]}],"synonyms":["labyrinthine","maze-like","intricate","complex","winding"],"phonetic":"/ˌlæbəˈrɪnθəl/","extraExplanation":["“Labyrinthal”来自“labyrinth（迷宫）”。在现代英语里更常见的形容词是“labyrinthine”，含义相近，尤其常用来形容“路线/街道很曲折”或“制度/流程很复杂”。","在文学与文化中，“labyrinth”常让人联想到希腊神话中克里特岛的迷宫（Minotaur 的故事），因此“labyrinthal”也常带有一种神秘、曲折、难以脱身的意象。"]}
{"word":"labyrinthally","summary":{"en":"“Labyrinthally” means “in a maze-like, complex, winding way.” It’s rare and mostly used in literary or formal writing.","zh":"“labyrinthally”意为“以迷宫般、复杂曲折的方式”。该词较少见，多用于文学或正式写作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a maze-like, complex, or winding way; in a manner that is difficult to follow.","zh":"以迷宫般的、错综复杂或曲折的方式；让人难以理清地。"},"examples":[{"en":"The story unfolds labyrinthally, moving through memories and side plots before reaching the main point.","zh":"故事以迷宫般的方式展开，在到达主线之前穿梭于回忆与支线情节。"},{"en":"The old city is built labyrinthally, with narrow alleys that twist and reconnect.","zh":"这座老城的布局像迷宫一样，狭窄的小巷蜿蜒曲折、又彼此相连。"}]}],"synonyms":["in a labyrinthine way","intricately","complexly","tortuously","circuitously"],"phonetic":"ˌlæbəˈrɪnθəli","extraExplanation":["这个词非常少见，多见于文学性或学术性写作。日常英语里更常用 labyrinthine（形容词，“迷宫般的、复杂的”）来表达：e.g., “a labyrinthine system/plot”。","词形来源：labyrinth（迷宫）+ -ally（表示“以……方式”）。虽然形式上可理解，但因为不常用，写作时可用更自然的表达替换，如 “in a labyrinthine way / in a complex, winding way”。"]}
{"word":"labyrinthed","summary":{"en":"“Labyrinthed” is a rare, literary word meaning “labyrinth-like; very complex and hard to navigate.”","zh":"“labyrinthed”是较少见的文学用词，意为“迷宫般的；非常复杂、难以理清或穿行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Like a labyrinth; very complex, winding, or hard to navigate (physically or mentally).","zh":"（文学用法）像迷宫一样的；错综复杂、曲折难行（指道路、结构或思路等）。"},"examples":[{"en":"We wandered through the labyrinthed streets of the old city and kept getting lost.","zh":"我们在老城迷宫般的街道里穿行，不断迷路。"},{"en":"Her labyrinthed argument confused the audience more than it persuaded them.","zh":"她那套错综复杂的论证让听众更困惑，而不是被说服。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) Past participle of a little-used verb “to labyrinth,” meaning to make something maze-like or tangled.","zh":"（罕见）作不常用动词“to labyrinth”的过去分词，意为“使……像迷宫一样复杂/纠结”。"},"examples":[{"en":"The designer labyrinthed the garden paths to create a sense of discovery.","zh":"设计师把花园小径设计得像迷宫一样，以营造探索感。"}]}],"synonyms":["labyrinthine","mazelike","winding","intricate","complex","tangled"],"phonetic":"/ˈlæbəˌrɪnθt/","extraExplanation":["“labyrinthed”比较少见，更常用的是形容词“labyrinthine”（迷宫般的、复杂的）。在文学写作里，用“labyrinthed”有一种更具画面感、带点古风的效果。","词根来自“labyrinth（迷宫）”，常让人联想到希腊神话中克里特岛的迷宫（关着牛头怪弥诺陶洛斯）。因此它常被用来比喻“难以理清的结构、城市街巷、情节或心理状态”。"]}
{"word":"labyrinthian","summary":{"en":"Labyrinthian means maze-like—very complex and hard to follow.","zh":"Labyrinthian 指“像迷宫一样”——非常复杂、难以理清。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Complicated and confusing, like a maze; full of winding paths or complex details.","zh":"迷宫般的；错综复杂、令人困惑的。"},"examples":[{"en":"The old city's labyrinthian streets made it easy to get lost.","zh":"这座古城迷宫般的街道让人很容易迷路。"},{"en":"She struggled with the labyrinthian rules of the application process.","zh":"她为申请流程那套错综复杂的规定感到头疼。"},{"en":"The novel follows a labyrinthian plot with many characters and secrets.","zh":"这部小说的情节错综复杂，人物众多、秘密不断。"}]}],"synonyms":["labyrinthine","maze-like","complex","intricate","convoluted"],"phonetic":"/ˌlæbəˈrɪnθiən/","extraExplanation":["“labyrinthian”来自“labyrinth（迷宫）”。英语里它既可指真实空间像迷宫一样曲折，也常用来形容“信息/制度/关系/情节”复杂到让人难以理清。","常见近义词区分：complex（复杂但不一定令人困惑）偏中性；intricate（精细复杂、结构严密）常带“精巧”；maze-like / labyrinthine（像迷宫一样）强调“容易迷路/难以理清”。","文学与文化联想：常让人想到希腊神话中的克里特迷宫（Minotaur 的迷宫），因此在描写古老城镇、地下通道、官僚体系或悬疑剧情时很常见。"]}
{"word":"labyrinthibranch","summary":{"en":"Labyrinthibranch describes (or refers to) a fish that can breathe air using a labyrinth organ, such as bettas and gouramis.","zh":"Labyrinthibranch 指（或指代）具迷鳃器官、能到水面呼吸空气的鱼类，如斗鱼和丝足鲈。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a fish) having a labyrinth organ that lets it breathe air at the water’s surface; related to fishes such as gouramis and bettas.","zh":"（鱼类）具“迷鳃器官”（迷宫状呼吸器官），可在水面直接吸入空气；常见于如丝足鲈、斗鱼等鱼类。"},"examples":[{"en":"Bettas are labyrinthibranch fish, so they can gulp air when the water is low in oxygen.","zh":"斗鱼是迷鳃鱼类，所以当水中含氧量低时，它们可以到水面吞咽空气。"},{"en":"Because it is labyrinthibranch, this species can survive in warm, still ponds better than many other fish.","zh":"由于具有迷鳃特性，这个物种比许多其他鱼更能在温暖、静止的池塘中生存。"}]},{"partOfSpeech":"n.","definition":{"en":"a fish that has a labyrinth organ and can breathe air (often used to describe anabantoid fishes).","zh":"迷鳃鱼；具有迷鳃器官、能呼吸空气的鱼（常指攀鲈亚目等鱼类）。"},"examples":[{"en":"Some aquarium keepers enjoy raising labyrinthibranchs like gouramis.","zh":"一些水族爱好者喜欢饲养丝足鲈等迷鳃鱼。"},{"en":"Labyrinthibranchs often need access to the surface to breathe properly.","zh":"迷鳃鱼通常需要能接触水面，才能正常呼吸。"}]}],"synonyms":["labyrinth fish","anabantoid","air-breathing fish"],"phonetic":"/ˌlæbəˈrɪnθɪˌbræŋk/","extraExplanation":["“Labyrinthibranch”较少见于日常英语，更多出现在较旧的动物学/水族资料中；现代更常见的相关说法是“labyrinth fish”或更专业的“anabantoid”。","词源上可拆为：labyrinth（迷宫）+ branch（与“鳃/鳃部”相关的词根用法），强调这种器官内部结构像迷宫一样褶皱。","迷鳃器官并不等于“用肺呼吸”；它是由鳃上方的骨板与血管丰富的组织构成，用来从空气中吸收氧气，所以这类鱼需要能到水面换气。"]}
{"word":"labyrinthibranchiate","summary":{"en":"Labyrinthibranchiate describes fish that have a labyrinth organ and can breathe air.","zh":"labyrinthibranchiate 指具有迷宫器官、能直接呼吸空气的鱼类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having a “labyrinth organ” (a complex, maze-like breathing structure) that allows a fish to breathe air in addition to using gills.","zh":"（动物学）具“迷宫器官”的（鱼类）；这种复杂如迷宫的呼吸结构使鱼除了用鳃呼吸外，还能直接呼吸空气。"},"examples":[{"en":"Bettas and gouramis are labyrinthibranchiate fishes that can gulp air at the surface.","zh":"斗鱼和丝足鱼属于迷鳃鱼类（具迷宫器官），能到水面吞咽空气。"},{"en":"Because it is labyrinthibranchiate, the fish can survive in low-oxygen water for short periods.","zh":"由于这种鱼具迷宫器官，它能在低溶氧的水中短时间存活。"}]}],"synonyms":["labyrinthine-gilled","air-breathing (fish)","labyrinth fish (common term)"],"phonetic":"/ˌlæbəˌrɪnθəˈbræŋkiˌeɪt/","extraExplanation":["这个词由 labyrinth（迷宫）+ branchiate（与鳃有关的）构成，强调“像迷宫一样的鳃上呼吸结构”。在科普或水族资料里，更常见的说法是 labyrinth fish（迷宫鱼）或 labyrinth organ（迷宫器官）；labyrinthibranchiate 属于比较书面、偏专业的用词。"]}
{"word":"labyrinthibranchii","summary":{"en":"Labyrinthibranchii is an older scientific term for “labyrinth fish,” freshwater fish that can breathe air using a labyrinth organ.","zh":"Labyrinthibranchii 是较旧的科学术语，指具有迷宫器官、能直接呼吸空气的“迷鳃鱼/迷宫鱼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific group name for certain freshwater fish (often called “labyrinth fish”) that can breathe air using a special “labyrinth organ” (e.g., gouramis and bettas).","zh":"（旧的科学分类名）指某些淡水鱼类（常称“迷鳃鱼/迷宫鱼”），它们有“迷宫器官（labyrinth organ）”，能直接呼吸空气（如丝足鲈/丽鱼类中的某些种、斗鱼等）。"},"examples":[{"en":"Bettas are often described as labyrinth fish because they can gulp air at the water’s surface.","zh":"斗鱼常被称为迷鳃鱼（迷宫鱼），因为它们能在水面吞咽空气来呼吸。"},{"en":"In older books, you may see the term Labyrinthibranchii used for gouramis and their relatives.","zh":"在较旧的书籍里，你可能会看到用 Labyrinthibranchii 这个词来指丝足鲈及其近亲。"}]}],"synonyms":["labyrinth fish","anabantoids"],"phonetic":"/ˌlæbəˌrɪnθɪˈbræŋkiˌaɪ/","extraExplanation":["这是一个较旧的分类用语（现在更常用 Anabantoidei / Anabantiformes 等较新的分类框架），所以在现代教材或论文中不一定常见。","词源上可拆为 labyrinth（迷宫）+ branchiae/branchia（鳃）：强调这种鱼的“迷宫器官”位于鳃腔附近，能在缺氧水体中帮助它们利用空气中的氧气。","拼写提示：多见首字母大写 Labyrinthibranchii（像拉丁学名/分类名那样）；不同书籍可能出现近似拼法或不同层级的分类称呼。"]}
{"word":"labyrinthic","summary":{"en":"Labyrinthic means very complex and maze-like, with many confusing twists and turns.","zh":"labyrinthic 指非常复杂、像迷宫一样曲折难懂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many complicated twists, turns, or layers; maze-like and hard to follow.","zh":"错综复杂的；如迷宫般曲折难懂的。"},"examples":[{"en":"The old city has labyrinthic streets that tourists often get lost in.","zh":"这座古城的街道错综复杂，游客常常会迷路。"},{"en":"She explained the labyrinthic rules of the system in a simple way.","zh":"她用简单的方式解释了这个系统复杂繁琐的规则。"},{"en":"The plot becomes labyrinthic, with secrets inside secrets.","zh":"情节变得像迷宫一样复杂，秘密套着秘密。"}]}],"synonyms":["maze-like","complex","intricate","convoluted","tortuous"],"phonetic":"/ˌlæbəˈrɪnθɪk/","extraExplanation":["“labyrinthic”来自“labyrinth（迷宫）”。在英语里它常用来形容道路、建筑布局、故事结构、官僚流程或思想/论证“绕、复杂、不好理清”。","小区别：labyrinth 原本偏“单一路径、曲折但通向中心”的概念；maze 更强调“有岔路、容易走错”。现代日常英语里两者常被混用。","相关文化背景：labyrinth 常让人联想到希腊神话中克里特岛的迷宫（关押弥诺陶洛斯）。这种联想也让该词带有“神秘、复杂、令人迷失”的文学色彩。"]}
{"word":"labyrinthical","summary":{"en":"An adjective meaning maze-like—highly complex and confusing.","zh":"形容词：像迷宫一样，极其复杂、令人困惑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a labyrinth (maze): very complicated, with many confusing turns or parts; hard to understand or find your way through.","zh":"像迷宫一样的；错综复杂的、曲折难懂的；让人难以理清或找到方向的。"},"examples":[{"en":"The old city has labyrinthical streets that are easy to get lost in.","zh":"这座老城的街道像迷宫一样，很容易迷路。"},{"en":"She struggled with the labyrinthical rules of the insurance system.","zh":"她被保险体系错综复杂的规则弄得很吃力。"}]}],"synonyms":["labyrinthine","maze-like","complex","intricate","tortuous"],"phonetic":"/ˌlæbəˈrɪnθɪkəl/","extraExplanation":["“labyrinthical”是“labyrinth（迷宫）+ -ical（……的）”构成的形容词，比常见的“labyrinthine”更少见，但意思很接近。","常见搭配：labyrinthical streets/corridors/passages（迷宫般的街道/走廊/通道），labyrinthical system/bureaucracy/plot（复杂的体系/官僚程序/情节）。","在文学里常用来描写空间（城堡、地下通道）或抽象事物（制度、思绪、情节）的“让人找不到出口”的复杂感。"]}
{"word":"labyrinthically","summary":{"en":"“Labyrinthically” means “in a maze-like, complex, winding way.”","zh":"“labyrinthically”意为“以迷宫般复杂、曲折的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a complex, winding, or confusing way, like a labyrinth (maze).","zh":"以迷宫般复杂、曲折或令人困惑的方式。"},"examples":[{"en":"The old city’s streets twist labyrinthically, so it’s easy to get lost.","zh":"这座老城的街道像迷宫一样曲折，很容易迷路。"},{"en":"The plot moves labyrinthically through secrets and false clues.","zh":"剧情在秘密与假线索之间迷宫般推进。"}]}],"synonyms":["maze-like","intricately","complexly","tortuously"],"phonetic":"/ˌlæbəˈrɪnθɪkli/","extraExplanation":["“labyrinthically”来自“labyrinth”（迷宫），常用于描述路线、叙事结构、官僚流程或思路“复杂到像迷宫”。","语气多偏书面或文学化，比“confusingly / in a complicated way”更形象、更强调“曲折、绕来绕去”的感觉。","相关词：labyrinthine（adj. 迷宫般复杂的）更常见；labyrinthically 是其副词形式。"]}
{"word":"labyrinthici","summary":{"en":"A rare Latin/scientific form meaning “relating to the labyrinth,” especially the inner ear; English usually uses labyrinthine/labyrinthic.","zh":"罕见的拉丁语/科学用语，意为“与迷路有关（尤指内耳）”；英语通常用 labyrinthine/labyrinthic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; usually Latin/scientific form) “Labyrinthici” means “of or relating to the labyrinth,” especially the inner-ear labyrinth; in general writing, English more often uses labyrinthine or labyrinthic. Examples: EN: The report mentioned “nervi labyrinthici” (labyrinthine nerves). ZH: 报告提到了“nervi labyrinthici”（迷路神经）。 EN: Damage to labyrinthici structures can affect balance. ZH: 迷路相关结构受损会影响平衡。","zh":"（罕见；多为拉丁语/科学用语）“labyrinthici”意为“迷路的；与迷宫/迷路有关的”，尤其指内耳的“迷路”结构；普通英语中更常用 labyrinthine 或 labyrinthic。例：EN: The report mentioned “nervi labyrinthici” (labyrinthine nerves). ZH: 报告提到了“nervi labyrinthici”（迷路神经）。 EN: Damage to labyrinthici structures can affect balance. ZH: 迷路相关结构受损会影响平衡。"},"examples":[{"en":"The anatomy text used the term “nervi labyrinthici.”","zh":"那本解剖学教材使用了“nervi labyrinthici”这个术语。"},{"en":"Researchers studied labyrinthici tissues in the inner ear.","zh":"研究人员研究了内耳的迷路组织。"}]}],"synonyms":["labyrinthine","labyrinthic","mazelike","intricate"],"phonetic":"/ˌlæbəˈrɪnθɪkaɪ/","extraExplanation":["“labyrinthici”看起来像拉丁语形态（复数形式），常见于医学/解剖学命名里；在一般英语写作中，想表达“像迷宫一样复杂”通常用 labyrinthine（如 a labyrinthine city）。","如果你本来想查的是英语常用词，可能是拼写成了 labyrinthine（迷宫般复杂的）或 labyrinthic（迷宫的/复杂的）。"]}
{"word":"labyrinthiform","summary":{"en":"Labyrinthiform means “maze-like” or “having the form of a labyrinth,” often used in descriptive writing or biology/medicine.","zh":"Labyrinthiform 指“迷宫状的、像迷宫一样复杂的”，常见于描写性文字或生物/医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form, pattern, or complexity of a labyrinth; maze-like, with many winding paths or confusing parts.","zh":"迷宫状的；像迷宫一样复杂、曲折的。"},"examples":[{"en":"The old city has labyrinthiform streets that are easy to get lost in.","zh":"这座古城的街道呈迷宫状，很容易迷路。"},{"en":"She drew a labyrinthiform design with twisting lines and hidden turns.","zh":"她画了一个迷宫状的图案，线条扭曲并暗藏转折。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Shaped like the inner ear’s labyrinth, or resembling labyrinth-like structures in anatomy.","zh":"（生物/医学）呈内耳“迷路”结构形状的；或类似解剖学中迷宫样结构的。"},"examples":[{"en":"The report described labyrinthiform structures in the specimen under the microscope.","zh":"报告描述了在显微镜下标本中的迷宫状结构。"},{"en":"Some medical texts use “labyrinthiform” when discussing inner-ear anatomy.","zh":"一些医学文本在讨论内耳解剖时会用到“labyrinthiform”。"}]}],"synonyms":["maze-like","labyrinthine","tortuous","winding","intricate"],"phonetic":"/ˌlæbəˈrɪnθəˌfɔrm/","extraExplanation":["“labyrinthiform”较少用于日常口语，更常见于文学描写或学术语境（如解剖学、植物学、动物学）。如果你想用更常用的词，可以用“maze-like / labyrinthine”。","词源上可拆为“labyrinth（迷宫）+ -iform（……形状的）”。“-iform”常见于描述“形状像……的”词汇，如“ovaliform（卵形的）”“cruciform（十字形的）”。"]}
{"word":"labyrinthine","summary":{"en":"“Labyrinthine” means maze-like—full of twists and turns—or, more generally, very complicated and hard to navigate or understand.","zh":"“labyrinthine”意为“迷宫般的、曲折复杂的”，也可泛指“非常复杂、难以理清或应对的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Complicated and difficult to understand or find your way through, like a maze.","zh":"错综复杂的；像迷宫一样难以理解或穿行的。"},"examples":[{"en":"The old city’s labyrinthine streets made it easy for tourists to get lost.","zh":"这座古城迷宫般的街道让游客很容易迷路。"},{"en":"The instructions were so labyrinthine that I had to read them three times.","zh":"说明太复杂了，我不得不读了三遍。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having many twisting passages; maze-like in physical shape.","zh":"（结构上）曲折迂回、通道繁多的；迷宫式的。"},"examples":[{"en":"We explored the labyrinthine tunnels under the castle.","zh":"我们探访了城堡地下迷宫般的隧道。"},{"en":"The museum has a labyrinthine layout, so grab a map at the entrance.","zh":"博物馆的布局像迷宫一样，进门最好拿一张地图。"}]}],"synonyms":["maze-like","winding","tortuous","intricate","complex"],"phonetic":"/ˌlæbəˈrɪnθaɪn/","extraExplanation":["“labyrinthine”来自“labyrinth（迷宫）”。在西方文化里，最有名的典故是希腊神话中的克里特迷宫（Labyrinth of Crete），用来关住牛头怪弥诺陶洛斯（Minotaur）。因此这个词常带有“曲折、绕、难脱身”的联想，既可形容真实的空间，也常比喻“程序/系统/叙述很复杂”。","语感提示：比起单纯的“complex（复杂的）”，“labyrinthine”更强调“弯弯绕绕、容易迷失方向”的复杂。常见搭配：labyrinthine streets/corridors/tunnels；labyrinthine bureaucracy（盘根错节的官僚体系）；labyrinthine plot（曲折的情节）。"]}
{"word":"labyrinthitis","summary":{"en":"Labyrinthitis is an inner-ear inflammation that can cause vertigo and balance problems.","zh":"迷路炎是内耳迷路的炎症，常导致眩晕与平衡问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an inflammation (swelling/irritation) of the inner ear’s labyrinth that can cause strong dizziness (vertigo), nausea, and balance problems","zh":"（医学）迷路炎：内耳“迷路”发生炎症，常引起眩晕（天旋地转）、恶心与平衡障碍"},"examples":[{"en":"The doctor said her sudden vertigo was caused by labyrinthitis.","zh":"医生说她突然出现的眩晕是由迷路炎引起的。"},{"en":"Labyrinthitis can make it hard to walk straight because it affects balance.","zh":"迷路炎会影响平衡，让人很难走直线。"},{"en":"If you have severe dizziness with hearing changes, seek medical care to rule out labyrinthitis.","zh":"如果你严重头晕并伴随听力变化，应尽快就医，以排除迷路炎等问题。"}]}],"synonyms":["inner-ear inflammation","vestibular disorder","vertigo (symptom)"],"phonetic":"/ˌlæbəˌrɪnˈθaɪtɪs/","extraExplanation":["“labyrinth”在这里指内耳的迷路结构（负责平衡与部分听觉），“-itis”是英语中常见的医学后缀，表示“炎症”（如 bronchitis 支气管炎、tonsillitis 扁桃体炎）。","迷路炎常与“vestibular neuritis（前庭神经炎）”一起被提到：两者都可引起眩晕；但迷路炎更可能伴随听力变化（如听力下降、耳鸣），因为它影响内耳结构。具体诊断需要医生评估。","日常表达里，人们可能只说“a bad bout of vertigo（严重眩晕发作）”，但在医疗语境（就医、检查报告、科普文章）中常用“labyrinthitis”。"]}
{"word":"labyrinthodon","summary":{"en":"Labyrinthodon is an outdated paleontology term for certain prehistoric amphibians, now generally referred to as labyrinthodonts.","zh":"Labyrinthodon 是古生物学中的旧称，曾指某些史前两栖动物，现代一般改称迷齿类（labyrinthodonts）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Paleontology) An old/obsolete scientific name once used for certain large prehistoric amphibians, later grouped under “labyrinthodonts.”","zh":"（古生物学）一个较早、现已较少使用的学名，曾用来指某些大型史前两栖动物，后来通常归入“迷齿类（labyrinthodonts）”的范围。"},"examples":[{"en":"In older books, you may see “Labyrinthodon” used for large amphibians from the Triassic period.","zh":"在较早的书中，你可能会看到“Labyrinthodon”用来指三叠纪时期的大型两栖动物。"},{"en":"Modern sources usually discuss these animals as labyrinthodonts rather than Labyrinthodon.","zh":"现代资料通常用“labyrinthodonts（迷齿类）”来讨论这些动物，而不是用“Labyrinthodon”。"}]}],"synonyms":["labyrinthodont","labyrinthodont amphibian"],"phonetic":"/ləˈbɪrɪnθəˌdɑn/","extraExplanation":["“Labyrinthodon”源自希腊语：labyrinth-（迷宫）+ odon（牙齿）。之所以这样命名，是因为这类动物的牙齿横切面呈现复杂的“迷宫状”褶皱结构，这也是“labyrinthodont（迷齿类）”一词的核心特征。","在现代分类学中，Labyrinthodon多被视为历史用法或旧分类；阅读古典古生物文献时可能会遇到，但写作与检索时更常用“labyrinthodont”或更具体的属/科名。"]}
{"word":"labyrinthodont","summary":{"en":"A prehistoric amphibian group, famous for maze-like folded teeth.","zh":"一种史前两栖动物类群，以“迷宫状褶皱”的牙齿结构而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prehistoric amphibian (especially from the Paleozoic–early Mesozoic) known for having complex, folded tooth structure","zh":"迷齿类动物；一种史前两栖动物（多见于古生代至中生代早期），其牙齿内部结构呈复杂的迷宫状褶皱"},"examples":[{"en":"Fossils of labyrinthodonts have been found in ancient river and swamp deposits.","zh":"迷齿类化石常见于古代河流与沼泽沉积层中。"},{"en":"The museum display compares a labyrinthodont skull with modern amphibians.","zh":"博物馆展览把迷齿类的头骨与现代两栖动物作对比。"}]}],"synonyms":["labyrinthodont amphibian","Labyrinthodontia"],"phonetic":"/ˌlæbəˈrɪnθəˌdɑnt/","extraExplanation":["词源提示：labyrinthodont 来自 labyrinth（迷宫）+ -odont（牙、齿，常见于生物学术语），字面意思是“迷宫牙”。这个名字指它们牙齿横切面像迷宫一样的褶皱结构。","使用场景：这个词主要出现在古生物学、地质学和博物馆科普材料中；在日常英语里很少用。","相关概念：现代分类里，“Labyrinthodontia（迷齿类）”常被视为一种历史性的（传统的）分类称呼，很多文献会用更细的类群名称来替代，但在科普语境仍常见。"]}
{"word":"labyrinthodonta","summary":{"en":"Labyrinthodonta refers to an extinct group of early amphibians, famous for their maze-like tooth structure.","zh":"Labyrinthodonta 指一类已灭绝的早期两栖动物，以牙齿呈迷宫状结构而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct group (order/subclass) of early amphibians known for complex, maze-like folding (“labyrinth”) in the enamel and dentine of their teeth; they lived mainly from the Devonian to the Triassic periods","zh":"（古生物）迷齿类：一类已灭绝的早期两栖动物类群（常作目/亚纲等分类层级），其牙齿的釉质与牙本质呈复杂的迷宫状褶皱；主要生存于泥盆纪至三叠纪"},"examples":[{"en":"Labyrinthodonta are often discussed in books about the early evolution of amphibians.","zh":"在介绍两栖动物早期演化的书中，经常会提到迷齿类。"},{"en":"Fossils of Labyrinthodonta show large skulls and teeth with a labyrinth-like structure.","zh":"迷齿类化石常显示较大的头骨，以及具有迷宫状结构的牙齿。"}]}],"synonyms":["labyrinthodonts","Labyrinthodontia (related term)"],"phonetic":"/ˌlæbəˌrɪnθəˈdɑntə/","extraExplanation":["“Labyrinthodonta”来自拉丁化的希腊词根：labyrinth-（迷宫）+ odont-（牙）。它强调的是牙齿内部层状结构的特征，而不是生活习性。","该词在现代系统分类中有时被视为“历史性的/传统用语”，不同教材或论文可能采用不同的分类框架（例如将其中一些成员归入更细的类群）。阅读学术资料时可留意作者使用的分类体系。"]}
{"word":"labyrinthodontian","summary":{"en":"Labyrinthodontian refers to (or is) an extinct early amphibian group characterized by maze-like tooth structure.","zh":"labyrinthodontian 指（或指的是）一类已灭绝的早期两栖动物（迷齿类），以牙齿呈迷宫状结构为特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Relating to Labyrinthodontia, an extinct group of early amphibians known for complex, maze-like tooth structure.","zh":"（形容词）与迷齿类（Labyrinthodontia，一类已灭绝的早期两栖动物）有关的；其典型特征是牙齿内部呈迷宫状的复杂结构。"},"examples":[{"en":"Scientists described a new labyrinthodontian skull found in a coal deposit.","zh":"科学家描述了在煤层沉积中发现的一具新的迷齿类头骨。"},{"en":"The fossil shows labyrinthodontian features, especially in the teeth and palate.","zh":"这块化石显示出迷齿类特征，尤其体现在牙齿和上腭部位。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A member of the extinct amphibian group Labyrinthodontia.","zh":"（名词）迷齿类动物（已灭绝的两栖动物类群）的一员。"},"examples":[{"en":"A labyrinthodontian may have hunted fish in shallow swamps.","zh":"迷齿类动物可能在浅水沼泽中捕食鱼类。"},{"en":"Museum displays often compare a labyrinthodontian with modern amphibians.","zh":"博物馆展览常把迷齿类动物与现代两栖动物作对比。"}]}],"synonyms":["labyrinthodont","Labyrinthodontia (related term)"],"phonetic":"/ˌlæb(ə)rɪnˌθɑnˈdɔʊniən/","extraExplanation":["“labyrinthodontian”来自“labyrinth（迷宫）+ odon/odont（牙齿）”，指这些动物牙齿切面里复杂的褶皱结构，看起来像迷宫。","迷齿类常见于古生代晚期到中生代早期的地层（如石炭纪、二叠纪、三叠纪），多与湿地、沼泽环境相关。","在现代分类学中，“Labyrinthodontia”常被视为较旧或较宽泛的用法；研究中更常按更精细的演化支系来讨论这些早期四足动物。"]}
{"word":"labyrinthodontid","summary":{"en":"An extinct early amphibian (or relating to it) noted for maze-like tooth structure.","zh":"指一种（或与之相关的）已灭绝的早期两栖动物，以迷宫状牙齿结构为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of extinct early amphibian (often large and crocodile-like) known for complex, maze-like tooth structure; a member of the group Labyrinthodontia (older classification).","zh":"一种已灭绝的早期两栖动物（常体型较大、外形有点像鳄鱼），以其牙齿内部复杂的“迷宫状”结构而闻名；指“迷齿类/迷齿亚纲”（较旧的分类）中的成员。"},"examples":[{"en":"Fossils of a labyrinthodontid were found in Triassic rock layers.","zh":"在三叠纪岩层中发现了一种迷齿类两栖动物的化石。"},{"en":"The museum display compares a labyrinthodontid skull with a modern salamander’s skull.","zh":"博物馆展览将迷齿类动物的头骨与现代蝾螈的头骨作比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of labyrinthodontids, especially their tooth structure.","zh":"与迷齿类动物有关的；（尤指）具有迷齿类特征的，如迷宫状牙齿结构。"},"examples":[{"en":"The paper describes labyrinthodontid features in the jaw and teeth.","zh":"论文描述了下颌与牙齿中的迷齿类特征。"},{"en":"Researchers debated whether the specimen shows truly labyrinthodontid dentition.","zh":"研究人员讨论该标本是否具有真正的迷齿类齿列特征。"}]}],"synonyms":["labyrinthodont (older term)","temnospondyl (often used in modern contexts, depending on classification)"],"phonetic":"/ˌlæbəˌrɪnθəˈdɑn(t)ɪd/","extraExplanation":["词源：labyrinth（迷宫）+ odont（牙，源自希腊语 odous/odont-）+ -id（表示“某类成员”）+ -id（形容词用法也常见）。核心含义就是“牙齿像迷宫一样复杂”。","分类提示：Labyrinthodontia 是历史上常用的“传统分类”（grade），现代系统发育研究中对其范围与成员归属有调整；因此在严谨学术语境中，作者往往会说明具体的科/属或改用更现代的类群名。","语域：这是古生物学/比较解剖学里的专业词，日常英语几乎不用；阅读科普或学术文章时出现更常见。"]}
{"word":"labyrinthodontoid","summary":{"en":"Labyrinthodontoid means ‘labyrinthodont-like,’ especially describing fossils (often teeth) with maze-like internal structure.","zh":"labyrinthodontoid 意为“迷齿类式的、类似迷齿类的”，常用于描述化石特征（尤其牙齿）具有迷宫状的内部结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an early amphibian or its features) related to or resembling labyrinthodonts—extinct amphibians known for their complex, maze-like tooth structure.","zh":"（指早期两栖动物或其特征）与“迷齿类”（已灭绝的古代两栖动物）有关，或类似迷齿类的；尤指其牙齿具有迷宫状的复杂结构。"},"examples":[{"en":"The fossil jaw shows labyrinthodontoid teeth with intricate internal folds.","zh":"这块化石下颌显示出迷齿类式的牙齿，内部褶皱结构非常复杂。"},{"en":"Some Triassic amphibians have a labyrinthodontoid skull shape in older classifications.","zh":"在较早的分类体系中，一些三叠纪两栖动物被认为具有迷齿类式的颅骨形态。"}]},{"partOfSpeech":"n.","definition":{"en":"something (especially a fossil trait) that is labyrinthodont-like.","zh":"（尤指化石特征）类似迷齿类的事物或特征。"},"examples":[{"en":"The author calls the tooth pattern a labyrinthodontoid, suggesting an amphibian affinity.","zh":"作者把这种牙齿纹理称为“迷齿类式特征”，暗示它可能与两栖动物有关。"}]}],"synonyms":["labyrinthodont-like","labyrinthodont","-toothed (context-dependent)"],"phonetic":"/ˌlæbəˌrɪnθəˈdɑn.tɔɪd/","extraExplanation":["“labyrinthodontoid”较少见，主要出现在古生物学/比较解剖学的论文或较旧的分类讨论中。词根来自：labyrinth-（迷宫）+ odont（牙）+ -oid（类似……的），核心信息通常是“牙齿内部有迷宫般的褶皱”。","“迷齿类（Labyrinthodontia）”作为传统分类在现代系统发育研究中多已不再作为严格的自然类群使用，但“labyrinthodont-like / labyrinthodontoid”仍可用来描述某些形态特征（尤其是牙齿结构）。"]}
{"word":"labyrinths","summary":{"en":"“Labyrinths” is the plural of “labyrinth,” meaning mazes or complex, confusing systems; it can also refer to inner-ear structures related to balance.","zh":"“labyrinths” 是 “labyrinth”的复数，指迷宫或（比喻）复杂难解的体系；也可指与平衡相关的内耳结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A complex network of paths or passages that is difficult to find your way through; a maze.","zh":"错综复杂、让人难以找到方向的道路或通道系统；迷宫。"},"examples":[{"en":"The old castle had underground labyrinths that tourists could explore.","zh":"那座古堡有地下迷宫，游客可以进去探索。"},{"en":"We got lost in the labyrinths of narrow streets in the old town.","zh":"我们在老城区狭窄街道的迷宫般巷弄里迷路了。"}]},{"partOfSpeech":"n.","definition":{"en":"A confusing or complicated system, situation, or process that is hard to understand or manage.","zh":"（比喻）复杂难解、让人困惑的体系、处境或过程。"},"examples":[{"en":"The paperwork felt like a labyrinths of rules and forms.","zh":"这些文件手续就像规则与表格的迷宫一样复杂。"},{"en":"She tried to navigate the labyrinths of office politics.","zh":"她试着在办公室政治的迷宫中周旋。"}]},{"partOfSpeech":"n.","definition":{"en":"The inner ear structure that helps with balance (the labyrinth).","zh":"（解剖）内耳中与平衡有关的结构（迷路）。"},"examples":[{"en":"An infection can affect the labyrinths and cause dizziness.","zh":"感染可能影响内耳迷路并导致头晕。"}]}],"synonyms":["mazes","warrens","networks","complexities"],"phonetic":"/ˈlæbəˌrɪnθs/","extraExplanation":["“labyrinth”既可指“迷宫”，也常用于比喻“复杂难解的局面”。注意：单数是 labyrinth，复数是 labyrinths（你输入的就是复数）。","文化背景：在希腊神话中，克里特岛有一个由工匠代达罗斯（Daedalus）建造的迷宫，用来囚禁牛头人弥诺陶洛斯（Minotaur）。因此在文学作品里，labyrinth 常带有“神秘、危险、考验与寻找出路”的意象。","用法区分：maze 常指为娱乐而建的“迷宫”（如公园的树篱迷宫）；labyrinth 更常强调“结构复杂、令人迷失方向”，也更常用于比喻。"]}
{"word":"labyrinthula","summary":{"en":"Labyrinthula is a genus of marine slime‑net microbes, sometimes known for causing seagrass disease.","zh":"Labyrinthula 是一种海洋黏网微生物属，因部分种类会导致海草病害而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of marine, slime‑net microorganisms (Labyrinthulomycetes) that live on algae and seagrasses; some species can cause disease in seagrass beds.","zh":"一种海洋“黏网”微生物属（迷路菌类/迷宫菌类，Labyrinthulomycetes），常见于藻类与海草表面；其中一些种会引发海草疾病。"},"examples":[{"en":"Scientists linked Labyrinthula to a major seagrass die‑off.","zh":"科学家将一次大规模海草死亡与 Labyrinthula 联系起来。"},{"en":"Labyrinthula organisms move within a slimy network, which helps them spread across plant tissue.","zh":"Labyrinthula 会在黏液网络中移动，这有助于它们在植物组织上扩散。"}]}],"synonyms":["Labyrinthula (genus name)","slime‑net microorganism (general description)"],"phonetic":"/ˌlæbəˈrɪnθjʊlə/","extraExplanation":["“Labyrinthula”这个名字来自“labyrinth（迷宫）+ -ula（小的）”，指它们会分泌黏液形成像迷宫一样的网状通道（slime net）。","在生态学中它常与“海草衰败病/浪费病（seagrass wasting disease）”一起出现，尤其与大叶海草（eelgrass）病害研究有关。"]}
{"word":"labyrinthulidae","summary":{"en":"Labyrinthulidae: a family of marine, fungus-like protists often associated with seagrasses and decaying plant material.","zh":"迷路藻科：一类海洋中类似真菌的原生生物科群，常与海草及腐烂植物残体相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine, fungus-like protists (labyrinthulids) that often live on decaying plant material (especially seagrasses and algae) and can sometimes act as pathogens in marine organisms.","zh":"迷路藻科：一类生活在海洋中的、类似真菌的原生生物（迷路藻类）家族，常见于腐烂的植物残体（尤其是海草与藻类）上，有时也会作为海洋生物的病原体。"},"examples":[{"en":"Labyrinthulidae are commonly found in coastal environments with seagrass beds.","zh":"迷路藻科生物常见于有海草床的沿海环境。"},{"en":"Some members of Labyrinthulidae are studied because they can cause disease in marine plants or animals.","zh":"迷路藻科的一些成员会被研究，是因为它们可能引起海洋植物或动物的疾病。"}]}],"synonyms":["labyrinthulids"],"phonetic":"/ˌlæbəˌrɪnθ(j)əˈlɪdi/","extraExplanation":["“Labyrinthulidae”是生物分类学里的“科”（family）级名称，词尾“-idae”表示“某某科”。\n\n词源上与“labyrinth（迷宫）”有关，指这类生物会形成复杂的黏液网络或“轨道”，细胞可以在其中滑行移动，因此得名。","在学术写作中它通常作为拉丁化的分类名使用，首字母大写（Labyrinthulidae）；口语或科普中也常用更直观的“labyrinthulids（迷路藻类）”来指这一类生物。"]}
