{"word":"lad","summary":{"en":"“Lad” mainly means a boy or young man in informal British-style usage; it can also mean a male worker in older contexts.","zh":"“lad”主要指“男孩/小伙子”（偏英式、口语）；在较旧语境中也可指“男工/男仆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a boy or young man (often informal)","zh":"男孩；小伙子（常为非正式用法）"},"examples":[{"en":"He’s a nice lad from our neighborhood.","zh":"他是我们社区里一个不错的小伙子。"},{"en":"The lads are playing soccer in the park.","zh":"小伙子们正在公园踢足球。"}]},{"partOfSpeech":"n.","definition":{"en":"a male servant or worker (now less common; often in older or regional British English)","zh":"男仆；男工（较少见；多见于较旧或英式地区用法）"},"examples":[{"en":"A stable lad looked after the horses.","zh":"马厩的男工照看马匹。"}]}],"synonyms":["boy","young man","guy","fellow"],"phonetic":"/læd/","extraExplanation":["“lad”在英国英语里很常见，语气通常友好、随意，类似于“boy/young man”。在某些语境中也可泛指一群男性朋友（如“the lads”=“哥们儿/兄弟们”）。","在文学与民歌或较旧文本里，“lad”常用于塑造朴实、年轻的男性形象，例如“a lad of sixteen”（十六岁的少年）这类表达。"]}
{"word":"ladakhi","summary":{"en":"Ladakhi means “from Ladakh,” a person from Ladakh, or the language spoken there.","zh":"Ladakhi 指“拉达克的”，也可指“拉达克人”或“拉达克语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ladakh (a region in northern India), its people, or its culture.","zh":"拉达克的；与拉达克（印度北部地区）及其人民或文化有关的。"},"examples":[{"en":"Ladakhi culture includes distinctive music, clothing, and festivals.","zh":"拉达克文化包括独特的音乐、服饰和节日。"},{"en":"We tried Ladakhi food like thukpa after the hike.","zh":"徒步后我们尝了拉达克的食物，比如图克帕（thukpa，汤面）。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Ladakh.","zh":"拉达克人；来自拉达克的人。"},"examples":[{"en":"She is a Ladakhi who grew up near Leh.","zh":"她是拉达克人，在列城（Leh）附近长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Tibetic language spoken in Ladakh (also called Ladakhi or Ladakhi Tibetan).","zh":"拉达克语（拉达克地区使用的藏语支语言，也常称“拉达克藏语”）。"},"examples":[{"en":"He is learning Ladakhi to speak with his grandparents.","zh":"他在学拉达克语，好和祖父母交流。"},{"en":"Some signs are written in English, Hindi, and Ladakhi.","zh":"有些标牌用英语、印地语和拉达克语写。"}]}],"synonyms":["from Ladakh","Ladakh-origin","Ladakhi Tibetan"],"phonetic":"/ləˈdɑːki/","extraExplanation":["“Ladakhi”来自地名“Ladakh”。拉达克位于喜马拉雅地区，常被称为“高山荒漠”，主要城镇包括列城（Leh）。","语言方面，“Ladakhi”通常指藏语族（Tibetic）的一种方言/语言；在不同语境下也可能泛指拉达克地区的语言与方言。","拼写要注意：Ladakhi（拉达克的/拉达克人/拉达克语）与Ladakh（拉达克，地名）不同。"]}
{"word":"ladakin","summary":{"en":"“Ladakin” is an uncommon variant spelling of “Ladakhi,” meaning a person from Ladakh or something related to Ladakh.","zh":"“Ladakin”多为不常见的拼写变体，通常等同于“Ladakhi”，指拉达克人或与拉达克有关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a rare or nonstandard spelling of “Ladakhi” (a person from Ladakh, or something relating to Ladakh, a region in northern India)","zh":"“Ladakhi（拉达克人／拉达克的）”的罕见或非标准拼写：指来自拉达克的人，或与拉达克有关的事物（拉达克位于印度北部）"},"examples":[{"en":"She bought a Ladakin scarf while traveling in the Himalayas.","zh":"她在喜马拉雅旅行时买了一条拉达克风格的围巾。"},{"en":"The article describes Ladakin culture and local festivals.","zh":"这篇文章介绍了拉达克的文化和当地节日。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Ladakh (variant of “Ladakhi”)","zh":"拉达克人（“Ladakhi”的变体写法）"},"examples":[{"en":"He is a Ladakin who speaks Ladakhi and Hindi.","zh":"他是拉达克人，会说拉达克语和印地语。"}]}],"synonyms":["Ladakhi","Ladakh (as an attributive noun)"],"phonetic":"/ləˈdɑːkɪn/","extraExplanation":["“Ladakin”在常见英语词典中并不常见；更标准、更常用的形式通常是“Ladakhi”。如果你是在书名、家谱、小说设定或旧译名里看到“Ladakin”，多半属于拼写变体或特定语境用法。","拉达克（Ladakh）位于印度北部喜马拉雅地区，文化上与藏传佛教、喜马拉雅山地生活方式联系紧密；“Ladakhi”既可指当地人，也可指当地语言与文化。"]}
{"word":"ladan","summary":{"en":"“Ladan” is most commonly a personal name; rarely, it can refer to a spelling variant of “labdanum,” a perfume resin.","zh":"“Ladan”最常见是人名；较少情况下可指 “labdanum（劳丹脂）” 的一种拼写变体，即用于香水的树脂。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually feminine), used in several cultures; in English it’s most often seen as a personal name rather than a common vocabulary word","zh":"人名（多为女性名），用于多种文化中；在英语里通常作为姓名出现，而不是常用词汇"},"examples":[{"en":"Ladan introduced herself to the class on the first day.","zh":"Ladan 在第一天向全班做了自我介绍。"},{"en":"I met Ladan at a conference in New York.","zh":"我在纽约的一次会议上认识了 Ladan。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common spelling related to “labdanum,” a fragrant resin used in perfume (rare in everyday English)","zh":"较少见的拼写形式，和 “labdanum（劳丹脂）”有关：一种用于香水的芳香树脂（在日常英语中很少用）"},"examples":[{"en":"Some perfumes use labdanum (sometimes spelled ladan) for a warm, resinous note.","zh":"有些香水会用 labdanum（有时也拼作 ladan）来增加温暖的树脂香调。"}]}],"synonyms":["labdanum (in the resin sense)"],"phonetic":"/ləˈdæn/","extraExplanation":["“Ladan/拉丹”常见于伊朗等地区的人名（波斯语背景中较常见），在英语语境里通常被当作专有名词使用，不需要翻译，只需按音译或保留原拼写。","作为香料/树脂的用法在英语里更标准的拼写是 **labdanum**；如果你是在香水、精油、香料配方里看到 “ladan”，多半与此相关。"]}
{"word":"ladang","summary":{"en":"A ladang is a Southeast Asian dry-farming field, often a shifting (slash-and-burn) cultivation plot.","zh":"ladang 指东南亚的旱作农田，常见于轮耕式（刀耕火种/烧垦）耕作地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Southeast Asia) a field used for dry farming—often a shifting cultivation (slash-and-burn) plot for crops like rice, cassava, or maize.","zh":"（东南亚）旱作农田；常指轮耕式（刀耕火种/烧垦）的耕地，可种植旱稻、木薯、玉米等。"},"examples":[{"en":"The family cleared a small ladang to grow dry rice for the season.","zh":"这家人开垦了一小块ladang（旱作地）来种一季旱稻。"},{"en":"After a few years, they left the ladang fallow and moved to a new plot.","zh":"几年后，他们让这块ladang休耕，再换到新的地块。"}]}],"synonyms":["swidden","shifting cultivation field","dry field (regional)"],"phonetic":"/ləˈdɑŋ/","extraExplanation":["“ladang”是马来语/印尼语借词，在英语里多见于人类学、地理学与东南亚研究语境，常用来描述婆罗洲、苏门答腊等地的旱地耕作与轮耕制度。","它常与“paddy”（水田/稻田）形成对比：paddy通常指有灌溉、蓄水的水稻田；ladang更偏向无灌溉的旱作地或烧垦后的临时耕地。"]}
{"word":"ladanigerous","summary":{"en":"“Ladanigerous” is not standard; it likely means “ladaniferous,” describing something that produces labdanum resin.","zh":"“ladanigerous”不是标准用词；多半是“ladaniferous”的误拼，指“会产生劳丹脂树脂的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “ladaniferous,” meaning producing labdanum (a fragrant resin).","zh":"这不是标准英语单词。很可能是“ladaniferous”的拼写错误，意思是“产生劳丹脂（labdanum，一种芳香树脂）的”。"},"examples":[{"en":"This plant name is probably intended to be “ladaniferous,” describing shrubs that produce labdanum resin.","zh":"这个植物相关词很可能本意是“ladaniferous”，用来描述会分泌劳丹脂树脂的灌木。"}]},{"partOfSpeech":"adj.","definition":{"en":"ladaniferous: producing or yielding labdanum (a sticky, aromatic resin used in perfumery and incense).","zh":"ladaniferous：产生/分泌劳丹脂（labdanum，一种黏稠且有香味的树脂，用于香水与熏香）。"},"examples":[{"en":"Perfumers value ladaniferous shrubs for their warm, resinous scent.","zh":"调香师很看重会分泌劳丹脂的灌木，因为它们有温暖的树脂香气。"},{"en":"The hills were covered with ladaniferous plants that released fragrance in the heat.","zh":"山坡上长满了会分泌劳丹脂的植物，热气一上来就散发出香味。"}]}],"synonyms":["resinous","aromatic"],"phonetic":"/ˌlæd(ə)ˈnɪf(ə)rəs/","extraExplanation":["“ladaniferous”可拆解为 ladanum/labdanum（劳丹脂）+ -ferous（“携带/产生……的”，常见于 oxygeniferous 等词）。它常出现在植物学与香料/香水语境中，尤其与岩玫瑰属（Cistus, rockrose）相关。","如果你是在阅读植物或香水资料时看到“ladanigerous”，很可能是OCR识别错误或打字误差；可以回看原文是否为“ladaniferous”。"]}
{"word":"ladanum","summary":{"en":"Ladanum (more commonly spelled labdanum) is a fragrant sticky resin from rockrose, used mainly in perfumery.","zh":"Ladanum（更常写作labdanum）是岩蔷薇分泌的芳香黏性树脂，主要用于香水等香料用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sticky, fragrant resin from the leaves of the rockrose plant (especially in the Mediterranean), used in perfume and sometimes in incense or traditional remedies","zh":"（岩蔷薇等植物叶片分泌的）劳丹脂／岩蔷薇树脂；一种黏稠芳香的树脂（多见于地中海地区），常用于香水，也可用于熏香或传统疗法"},"examples":[{"en":"Some classic perfumes use labdanum to add a warm, amber-like depth.","zh":"一些经典香水会用劳丹脂来增加温暖、琥珀般的厚度。"},{"en":"The incense had a sweet, resinous scent, similar to labdanum.","zh":"这种熏香带着甜甜的树脂香，类似劳丹脂的气味。"}]}],"synonyms":["labdanum","rockrose resin"],"phonetic":"/ˈlæbdənəm/","extraExplanation":["“Ladanum”更常见的拼写是“labdanum”，两者指同一种树脂。","在香水语境里，labdanum常被归入“amber（琥珀香调）”或“resinous（树脂调）”，用来营造温暖、甜润、略带皮革/烟熏感的底香。"]}
{"word":"ladanums","summary":{"en":"Laudanum(s) means an old opium-and-alcohol medicine once used for pain and sleep, now rare and controlled due to addiction risk.","zh":"Laudanum(s) 指一种旧时的“鸦片+酒精”药物（鸦片酊），曾用于止痛与助眠，如今因成瘾风险而罕用并受严格管制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine made from opium mixed with alcohol (an opium tincture), used historically as a strong painkiller and sedative; now rare and strictly controlled because it is addictive","zh":"（历史上）由鸦片与酒精混合制成的药物（鸦片酊），曾用作强力止痛与镇静药；因易成瘾，如今很少使用且管制严格"},"examples":[{"en":"In the 1800s, doctors often prescribed laudanum for pain and insomnia.","zh":"在19世纪，医生常用鸦片酊来治疗疼痛和失眠。"},{"en":"The novel mentions a character becoming dependent on laudanum.","zh":"小说中提到某个角色对鸦片酊产生了依赖。"}]}],"synonyms":["opium tincture","tincture of opium"],"phonetic":"/ˈlɔdənəm/","extraExplanation":["你输入的“ladanums”更常见的拼写是 **laudanums**，它是 **laudanum** 的复数形式。","Laudanum 在18—19世纪的西方很常见，常出现在文学作品里，用来表现“止痛/镇静”与“成瘾/逃避现实”的主题（例如维多利亚时代背景的小说中）。","现代医学中较少使用这个词；在当代语境里提到 laudanum 往往带有“旧时药物、含鸦片、危险且受管制”的历史意味。"]}
{"word":"ladde","summary":{"en":"“Ladde” isn’t a standard English word; it’s usually a typo for “ladder” or “ladle.”","zh":"“ladde” 不是标准英文单词；通常是 “ladder” 或 “ladle” 的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling: “ladde” is not a common English word. It is usually a misspelling of “ladder” (a thing you climb) or “ladle” (a big spoon for serving soup).","zh":"非标准拼写：“ladde” 不是常见英文单词。它通常是 “ladder”（梯子）或 “ladle”（长柄勺/汤勺）的拼写错误。"},"examples":[{"en":"Did you mean “ladder” (to climb) or “ladle” (to serve soup)?","zh":"你想写的是 “ladder”（用来爬的梯子）还是 “ladle”（用来舀汤的长柄勺）？"},{"en":"I typed “ladde” by mistake—I meant “ladder.”","zh":"我把 “ladde” 打错了——我想写的是 “ladder”。"}]}],"synonyms":["ladder","ladle"],"phonetic":"/ˈlædɚ/","extraExplanation":["在英语里，拼写差一个字母往往就是完全不同的词：\n- ladder：结尾是 -der，常见发音像“拉-德尔”，指“梯子/阶梯”。\n- ladle：结尾是 -dle，常见发音像“莱-德尔”，指“汤勺/长柄勺”。\n如果你告诉我你想表达的中文意思（梯子还是汤勺，或句子上下文），我可以给你更准确的词条和用法。"]}
{"word":"ladder","summary":{"en":"A ladder is a climbing tool with rungs, and it can also mean a step-by-step path to higher status or success.","zh":"ladder 指“梯子”，也可比喻“逐步上升的阶梯/晋升路径”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece of equipment with steps (rungs) used for climbing up or down, often to reach high places","zh":"梯子；有横档（梯级）的攀爬工具，用来上下或够到高处"},"examples":[{"en":"He climbed the ladder to clean the roof.","zh":"他爬上梯子去清理屋顶。"},{"en":"Please hold the ladder steady.","zh":"请把梯子扶稳。"}]},{"partOfSpeech":"n.","definition":{"en":"a series of stages that people can move up through (often for success, status, or a career)","zh":"（比喻）阶梯；晋升途径（常指事业、地位或成功的层级）"},"examples":[{"en":"She worked her way up the corporate ladder.","zh":"她一步步在公司晋升。"},{"en":"Education can be a ladder out of poverty.","zh":"教育可以成为摆脱贫困的阶梯。"}]},{"partOfSpeech":"v.","definition":{"en":"to move upward step by step, or to place/arrange something in a rising pattern (less common)","zh":"（较少用）逐步上升；使呈阶梯状排列"},"examples":[{"en":"The price increases were laddered over three years.","zh":"价格上涨分三年逐步进行（阶梯式调整）。"}]}],"synonyms":["stairway (figurative)","steps (figurative)","career path (figurative)","promotion ladder (figurative)"],"phonetic":"/ˈlædɚ/","extraExplanation":["常见搭配：step ladder（人字梯/折叠梯），extension ladder（伸缩梯），ladder rung（梯级/横档）。","比喻用法里很常见：the career/corporate ladder（职业/公司晋升阶梯）。也常出现在固定表达里：pull up the ladder（自己爬上去后把梯子收走，比喻不让后来者受益）。","文学与文化：在《雅各的天梯》（Jacob’s ladder，圣经意象）中，“梯子/天梯”象征通往天界或精神提升的通道；现代英语里也借此表达“通往更高层次”的概念。"]}
{"word":"ladderback","summary":{"en":"Ladderback refers to a chair (or chair style) with a back made of horizontal slats like a ladder.","zh":"ladderback 指（或形容）一种椅背由多条横木组成、外形像梯子的“梯背椅”及其款式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chair with a back made of several horizontal slats (rungs), resembling a ladder; a ladder-back chair","zh":"（椅背由多条横木组成、像梯子一样的）梯背椅；梯形靠背椅"},"examples":[{"en":"They bought a set of ladderback chairs for the kitchen.","zh":"他们买了一套梯背椅放在厨房里。"},{"en":"The old ladderback chair creaked when I sat down.","zh":"我坐下时，那把旧梯背椅吱呀作响。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a ladder-like back made of horizontal slats (used to describe chairs)","zh":"（形容椅子）梯背式的；靠背像梯子一样由横木条组成的"},"examples":[{"en":"A ladderback dining chair is simple and sturdy.","zh":"梯背式餐椅简洁又结实。"},{"en":"The room was furnished with ladderback seats and a farmhouse table.","zh":"房间里摆着梯背椅和一张乡村风格的餐桌。"}]}],"synonyms":["ladder-back chair","slat-back chair"],"phonetic":"/ˈlædərˌbæk/","extraExplanation":["“ladderback / ladder-back”多用于美式家居语境，常见于乡村风（farmhouse）、殖民地风（colonial）或手工木作家具。其椅背的“横档”常被称为 slats 或 rungs。"]}
{"word":"laddered","summary":{"en":"Laddered means “with ladders,” “ladder-like in pattern (including a run in stockings),” or “arranged in stages (especially in finance).”","zh":"laddered 可指“带梯子的/装有梯子的”，也可指“呈梯状纹理（含丝袜抽丝）”，还可指“分段配置的（尤指金融中的梯式安排）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having one or more ladders; fitted or arranged with ladders","zh":"带梯子（的）；装有或设置了梯子（的）"},"examples":[{"en":"The workers climbed the laddered scaffold to paint the wall.","zh":"工人们爬上带梯子的脚手架去刷墙。"},{"en":"Some fire trucks carry laddered platforms for rescue work.","zh":"一些消防车配有带梯子的升降平台用于救援。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing long, parallel lines or a pattern like the rungs of a ladder (often describing a “laddered” run in stockings/tights)","zh":"呈梯子状纹理的；（尤指丝袜/连裤袜）出现“抽丝”般的纵向痕迹的"},"examples":[{"en":"Her tights got snagged, and a laddered line ran down the leg.","zh":"她的连裤袜被勾住了，腿上出现了一道抽丝的纵向痕迹。"},{"en":"The old paint had a laddered texture from repeated scraping.","zh":"旧漆因反复刮除留下了梯状纹理。"}]},{"partOfSpeech":"adj.","definition":{"en":"arranged in stages at different times or levels (especially in finance: a “laddered” investment or bond portfolio)","zh":"分段配置的；（尤指金融）“梯式”安排的（如分期到期的债券/投资组合）"},"examples":[{"en":"They built a laddered bond portfolio so some bonds mature each year.","zh":"他们建立了梯式债券组合，让每年都有一部分债券到期。"},{"en":"A laddered schedule can spread risk over time.","zh":"梯式安排可以把风险分散到不同时间段。"}]}],"synonyms":["runged","ladder-like","staged","tiered","graduated"],"phonetic":"/ˈlædərd/","extraExplanation":["“laddered”来自名词 ladder（梯子）。在英式英语里，丝袜“抽丝”常说 a ladder / laddered；美式英语更常说 a run / run in stockings，但 laddered 也能理解。","金融里的“laddered（梯式）”常见搭配：laddered CDs（梯式存单）、laddered bonds（梯式债券），意思是把到期日错开，增加流动性并分散利率风险。"]}
{"word":"laddering","summary":{"en":"Laddering most often means using a “ladder” structure—either spreading investments across different dates, or asking step-by-step questions to reach deeper reasons; it can also mean a run in stockings.","zh":"Laddering 常指“梯式结构”：要么是把投资分散到不同到期日，要么是阶梯式追问以挖掘深层原因；也可指丝袜等织物的跑丝/脱线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the strategy of spreading investments (such as CDs or bonds) across different maturity dates so money becomes available at regular times","zh":"（投资）“梯式配置/梯形投资”：把定存、债券等分散到不同到期日，让资金分批、定期回流"},"examples":[{"en":"She uses CD laddering so some of her savings becomes available every six months.","zh":"她用定存梯式配置，让一部分存款每六个月就能到期取用。"},{"en":"Bond laddering can reduce the risk of locking all your money in one interest rate.","zh":"债券梯式配置可以降低把钱全锁在同一个利率水平上的风险。"}]},{"partOfSpeech":"n.","definition":{"en":"a questioning/marketing method that asks “why is that important?” step by step to uncover deeper reasons, values, or benefits","zh":"（访谈/营销）“阶梯式追问法”：一步步追问“为什么重要？”，挖掘更深层的动机、价值或利益点"},"examples":[{"en":"In user research, laddering helps connect a feature to what users truly care about.","zh":"在用户研究中，阶梯式追问能把“功能”连接到用户真正关心的东西。"},{"en":"The coach used laddering questions to help him clarify his goals.","zh":"教练用阶梯式追问帮助他理清目标。"}]},{"partOfSpeech":"n.","definition":{"en":"a run in knitted fabric (especially stockings), where threads drop and create a long “ladder”-like line","zh":"（织物）“抽丝/脱线跑丝”：线圈脱落，形成像梯子一样的长条裂纹（常见于丝袜）"},"examples":[{"en":"Her tights got laddering after they snagged on a nail.","zh":"她的连裤袜被钉子勾到后就开始跑丝了。"},{"en":"This fabric is designed to resist laddering.","zh":"这种面料设计成更不容易跑丝。"}]}],"synonyms":["staggering (maturities)","tiering","bond ladder strategy","probing (questions)","step-by-step questioning","run (in stockings)"],"phonetic":"/ˈlædərɪŋ/","extraExplanation":["“Laddering”来自“ladder（梯子）”。在金融里像“搭梯子”一样把到期日一格一格排开；在访谈/营销里则是用一连串“为什么/所以呢？”把答案往更抽象的价值层级“爬上去”。","英式英语里讲丝袜“脱线”更常见的说法是“a ladder in your tights/stockings”；美式英语常说“a run”。"]}
{"word":"ladderless","summary":{"en":"“Ladderless” means without a ladder; it can also (rarely) mean lacking a clear way to advance.","zh":"“ladderless”指“没有梯子”；也可（较少见）比喻“缺少上升/晋升途径”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a ladder; not having a ladder available or attached.","zh":"没有梯子；不配（带）梯子。"},"examples":[{"en":"The workers couldn’t reach the roof because the job site was ladderless.","zh":"工地没有梯子，工人们够不到屋顶。"},{"en":"It’s dangerous to clean those high windows when you’re ladderless.","zh":"没有梯子去擦那些高窗户很危险。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, rare) Lacking a way to climb or advance; having no easy means to progress.","zh":"（比喻，较少见）缺少上升或前进的途径；难以进步。"},"examples":[{"en":"Without training or support, she felt ladderless in her career.","zh":"没有培训或支持，她觉得自己的职业发展没有“上升通道”。"},{"en":"In a ladderless system, moving up can be slow and uncertain.","zh":"在一个缺少晋升阶梯的体系里，向上发展可能缓慢且不确定。"}]}],"synonyms":["without a ladder","ladder-free","unassisted"],"phonetic":"/ˈlædɚləs/","extraExplanation":["“ladderless”由名词 ladder（梯子）+ 后缀 -less（“没有……的”）构成，意思直观，但在日常英语中不算常见。更常见的表达是 “without a ladder” 或 “there is no ladder available”。","比喻用法常借“career ladder（职业晋升阶梯）”来理解：ladderless 表示缺少清晰的晋升路径或机会。"]}
{"word":"ladderlike","summary":{"en":"“Ladderlike” means having a ladder-shaped, runged, or step-like structure.","zh":"“ladderlike”表示外形或结构呈梯状、像梯子一样（有横档或台阶状）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a ladder in shape or structure (with rungs or step-like parts).","zh":"像梯子一样的；呈梯状结构的（有横档或台阶状部分）。"},"examples":[{"en":"The ladderlike pattern on the fabric looks like small rungs.","zh":"这块布料上的梯状图案看起来像一格格小横档。"},{"en":"A ladderlike staircase connects the two levels.","zh":"一段梯子般的楼梯连接着上下两层。"}]}],"synonyms":["ladder-shaped","runged","step-like"],"phonetic":"/ˈlædɚˌlaɪk/","extraExplanation":["这个词是由 ladder（梯子）+ -like（像……一样的）构成的形容词，常用于描述“外形/结构像梯子”的事物。","在写作中它多用于具体形状（图案、楼梯、骨架、结构），也可用于比喻性的描述，但不如 step-by-step、hierarchical 等词常见。"]}
{"word":"ladderman","summary":{"en":"A ladderman is usually a firefighter assigned to a ladder truck, or more generally a worker who uses and handles ladders as part of the job.","zh":"ladderman通常指云梯车（梯队）的消防员；也可泛指工作中需要架设和使用梯子的作业人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a firefighter who works on a ladder truck (a “ladder company”), using ladders for rescues, ventilation, and access to upper floors","zh":"（消防）云梯车/登高车上的消防员（隶属“云梯中队/梯队”），负责用梯子实施救援、破拆通风、进入高层等任务"},"examples":[{"en":"A ladderman climbed to the third-floor window to help the family escape.","zh":"一名梯队消防员爬到三楼窗户，帮助那家人撤离。"},{"en":"In older reports, the ladderman and the engine crew arrived at the same time.","zh":"在较早的报道中，梯队消防员和水罐车（泵车）小组同时到达现场。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job involves setting up, carrying, or working from ladders (for example in construction or maintenance)","zh":"以搬运、架设或在梯子上作业为主要工作的人员（如建筑或维护行业）"},"examples":[{"en":"They hired a ladderman to reach the roof safely and inspect the gutters.","zh":"他们雇了一位“梯子工”安全地上到屋顶检查排水槽。"},{"en":"The ladderman steadied the ladder while the painter worked.","zh":"梯子工扶稳梯子，油漆工在上面作业。"}]}],"synonyms":["ladder company firefighter","ladder truck firefighter","firefighter","ladder operator","worker"],"phonetic":"/ˈlædərmən/","extraExplanation":["“ladderman”在现代日常英语里不算常见，更常见的说法有：在消防领域用“firefighter on a ladder company / ladder truck firefighter”；在施工领域用“worker / installer / technician”并说明具体工种。","词尾“-man”有时会被认为偏男性化；一些场合会用更中性的表达（如“ladder firefighter”“ladder operator”），但是否使用取决于行业习惯与当地用语。"]}
{"word":"laddermen","summary":{"en":"Laddermen are usually firefighters on a ladder company who operate ladder trucks and perform high-access rescues; less commonly, workers who use ladders for their job.","zh":"laddermen 通常指云梯/登高车分队的消防员；较少见时可泛指需要用梯子进行高处作业的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Firefighters who work on a ladder company (a fire department team that operates a ladder truck), trained for rescuing people, ventilating roofs/windows, and giving access to high places.","zh":"（消防队的）云梯/登高车分队消防员；负责操作云梯车、人员救援、破拆与通风等登高任务的消防员。"},"examples":[{"en":"The laddermen raised the aerial ladder to reach the apartment on the fifth floor.","zh":"云梯分队的消防员升起云梯，抵达五楼的公寓。"},{"en":"Police cleared the street while the laddermen prepared for a roof rescue.","zh":"警察疏散街道时，云梯分队的消防员在准备屋顶救援。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, workers whose job involves using ladders, especially for work at height (less common).","zh":"（更广义、较少见）需要经常使用梯子进行高处作业的工人。"},"examples":[{"en":"The laddermen inspected the exterior lights along the building.","zh":"高处作业工人检查了楼外的照明灯。"}]}],"synonyms":["ladder firefighters","ladder crew","truck company firefighters","firefighters"],"phonetic":"/ˈlædərmən/","extraExplanation":["“laddermen”在美式英语里最常见于消防语境，通常指“ladder company/ladder crew”的成员，而不是单纯“拿梯子的人”。不同城市的消防编制不一样，也可能用“ladder firefighters”“truck company”来表达相近概念。"]}
{"word":"ladders","summary":{"en":"“Ladders” usually means more than one ladder; it can also mean a series of levels you can move up in life or work.","zh":"“ladders”通常指多把梯子；也可比喻人生或职场中可逐级上升的等级/阶梯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ladder: a piece of equipment with steps (rungs) used for climbing up or down.","zh":"梯子：带横档（梯级）的器具，用来向上或向下攀爬。"},"examples":[{"en":"He climbed a ladder to fix the roof.","zh":"他爬梯子去修屋顶。"},{"en":"Please hold the ladder steady.","zh":"请把梯子扶稳。"}]},{"partOfSpeech":"n.","definition":{"en":"A series of levels or stages that people can move up through (often about jobs or social status).","zh":"（职位/地位等的）阶梯、等级体系：人们可以逐级上升的一系列层级。"},"examples":[{"en":"She worked her way up the corporate ladder.","zh":"她一步步升上公司的职业阶梯。"},{"en":"Education can help people climb the social ladder.","zh":"教育能帮助人们提升社会阶梯。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “ladder.”","zh":"“ladder”的复数形式。"},"examples":[{"en":"The store sells ladders in different sizes.","zh":"这家店卖不同尺寸的梯子。"}]}],"synonyms":["steps","rungs","stairway","hierarchy","career ladder"],"phonetic":"/ˈlædɚz/","extraExplanation":["“climb the ladder”常用于比喻“往上爬、晋升”。在职场语境里，常见搭配是“corporate ladder（公司/职场晋升阶梯）”。","注意拼写与发音：ladder /ˈlædɚ/（美式中间的t/d常听起来像轻微的d音），复数 ladders /ˈlædɚz/。"]}
{"word":"ladderway","summary":{"en":"A ship’s stairway/ladder used to go between decks.","zh":"船上用于上下不同甲板的梯道（舱梯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stairway or ladder-like set of steps on a ship (or in an industrial setting) used to move between decks/levels.","zh":"（尤指船上或工业场所的）梯道；舱梯；用于在不同甲板/楼层之间上下的梯子或阶梯通道。"},"examples":[{"en":"The crew hurried up the ladderway to the main deck when the alarm sounded.","zh":"警报响起时，船员们迅速沿着舱梯跑到主甲板。"},{"en":"Hold the handrail while you’re on the ladderway—it's steep.","zh":"走梯道时要扶好扶手——坡度很陡。"},{"en":"Cargo was moved down the ladderway in small loads for safety.","zh":"为安全起见，货物被分成小批量沿梯道搬下去。"}]}],"synonyms":["ship’s ladder","stairway (on a ship)","companionway (related term)"],"phonetic":"/ˈlædərˌweɪ/","extraExplanation":["“ladderway”多见于航海/船舶英语（nautical English），比日常英语更专业。日常场景里更常说“stairs / stairway / ladder”。在船上也常见相关词：\n- ladder（梯子，通常更垂直）\n- stairway（楼梯，更像建筑里的楼梯）\n- gangway（舷梯/通道，连接船与码头或船与船的通道）"]}
{"word":"ladderwise","summary":{"en":"“Ladderwise” means “in a ladder-like, step-by-step arrangement or movement.”","zh":"“ladderwise”表示“像梯子一样、呈阶梯式地排列或移动”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the manner of a ladder; arranged or moving in step-like stages (like rungs).","zh":"以梯子状的方式；呈阶梯式（像梯级一样）排列或移动。"},"examples":[{"en":"The shelves were set ladderwise along the wall, each one slightly higher than the last.","zh":"这些架子沿墙呈阶梯式摆放，每一层都比上一层略高。"},{"en":"The hikers climbed ladderwise up the rocky slope, pausing at each ledge.","zh":"徒步者们沿着岩石斜坡阶梯式地向上攀登，在每个岩架处停一下。"}]}],"synonyms":["stepwise","in steps","stair-step","tier by tier"],"phonetic":"ˈlædərˌwaɪz","extraExplanation":["“ladderwise”较少见，多用于描写物体的排列方式（如书架、座位、台阶）或动作的分段上升/推进，语气偏书面或描写性。"]}
{"word":"laddery","summary":{"en":"Laddery means “ladder-like” or “having many ladder features.”","zh":"laddery 指“像梯子一样的”或“带有许多梯状特征/梯子的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a ladder; having a pattern or structure like the rungs and sides of a ladder.","zh":"像梯子一样的；呈梯级/梯形结构的。"},"examples":[{"en":"The plant has laddery leaves, with evenly spaced veins that look like rungs.","zh":"这种植物的叶子呈“梯状”，叶脉间距均匀，看起来像梯子的横档。"},{"en":"In the diagram, the laddery shape shows repeated steps of the process.","zh":"在图中，这种“梯级状”的形状表示流程的重复步骤。"}]},{"partOfSpeech":"adj.","definition":{"en":"Containing or full of ladders; equipped with ladder-like parts.","zh":"带有许多梯子（或梯状部件）的；装有梯形结构的。"},"examples":[{"en":"The fire truck has a laddery rear section designed for quick climbing.","zh":"这辆消防车的后部装有许多梯状结构，便于快速攀爬。"},{"en":"The old ship looked laddery with all its narrow steps and vertical rails.","zh":"那艘旧船看起来“梯子很多”，到处是狭窄的台阶和竖直的扶栏。"}]}],"synonyms":["ladder-like","runged","step-like"],"phonetic":"/ˈlædəri/","extraExplanation":["“laddery”并不是特别常见的日常词，更常见的表达有：ladder-like（像梯子一样的）、with a ladder（带梯子的）。","后缀 -y 常用来表示“具有……特征的/带有……的”（如 rocky 多岩石的、messy 凌乱的）。因此 ladder + y → laddery，表示“梯子状的/带梯子的”。"]}
{"word":"laddess","summary":{"en":"“Laddess” is a rare dialect/old-fashioned word meaning a girl or young woman.","zh":"“laddess”是罕见的方言/旧式用语，意思是“女孩、年轻女性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic, dialect) a girl or young woman; a female equivalent of “lad.”","zh":"（罕见/古旧、方言）女孩；年轻女性；相当于“lad（男孩）”的女性说法。"},"examples":[{"en":"In some older Scottish writing, you may see “laddess” used to mean a young girl.","zh":"在一些较早的苏格兰作品里，你可能会看到用“laddess”表示“年轻女孩”。"},{"en":"The story spoke of a laddess who worked hard to support her family.","zh":"故事讲到一位努力工作来养家糊口的年轻女孩。"}]}],"synonyms":["girl","young woman","lass"],"phonetic":"/ˈlædəs/","extraExplanation":["“laddess”非常不常见，多见于较旧的文本或苏格兰/英式方言语境。现代英语里更常用“girl / young woman / lass”。","如果你是想拼“ladies（女士们）”或“ladder（梯子）”，可以告诉我上下文句子，我可以帮你确认正确词和用法。"]}
{"word":"laddie","summary":{"en":"“Laddie” means a boy or young man, often used as a warm, informal way to address someone; it’s especially common in Scottish/Irish-flavored English.","zh":"“laddie”指男孩或小伙子，常作亲切的非正式称呼；在带有苏格兰/爱尔兰色彩的英语中更常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A boy or young man (often used as a friendly, informal form of address).","zh":"男孩；小伙子（常用作亲切、非正式的称呼）。"},"examples":[{"en":"Good job, laddie—keep it up!","zh":"干得好，小伙子——继续加油！"},{"en":"When I was a laddie, I helped my father on the farm.","zh":"我还是个小男孩的时候，就在农场帮父亲干活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish/Irish English) A man or male friend; “mate,” “lad.”","zh":"（苏格兰/爱尔兰英语）男人；男性朋友；哥们儿（类似“mate / lad”）。"},"examples":[{"en":"He’s a good laddie—always ready to help.","zh":"他是个不错的哥们儿——总是乐于帮忙。"},{"en":"The old laddies in the pub were telling stories all night.","zh":"酒吧里的老哥们儿整晚都在讲故事。"}]}],"synonyms":["lad","boy","kid","young man","buddy"],"phonetic":"/ˈlædi/","extraExplanation":["“laddie”是“lad”（男孩/小伙子）的指小形式，语气更亲昵，有点像英语里对小孩说的“kiddo”。","在现代日常美式英语里不算常用；你更常听到“kid / boy / young man / buddy”。在英国（尤其苏格兰）语境、文学作品或口语模仿中更常见。","文学与文化中常用来营造地方口音或年代感，例如苏格兰或航海、乡村题材的叙事里，角色会用“laddie”来称呼年轻人。"]}
{"word":"laddies","summary":{"en":"“Laddies” means young boys/men, often in Scottish or Northern British English, and can be a friendly way to address a group.","zh":"“laddies”指男孩或年轻男子，常见于苏格兰或英格兰北部英语，也可作对一群人的友好称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “laddie”: young boys or young men (often used in Scottish or Northern British English), sometimes as a friendly form of address.","zh":"“laddie”的复数：男孩或年轻男子（常见于苏格兰或英格兰北部英语），有时也用作友好的称呼。"},"examples":[{"en":"The laddies ran down to the river after school.","zh":"那些男孩放学后跑到河边去了。"},{"en":"Come on, laddies—let’s get to work.","zh":"来吧，小伙子们——咱们开始干活。"},{"en":"In the story, the old sailor calls the young men “laddies.”","zh":"在故事里，那位老水手把年轻人称作“laddies”。"}]}],"synonyms":["lads","boys","young men","guys","fellas"],"phonetic":"/ˈlædiz/","extraExplanation":["“laddie”带有明显的地域与口语色彩，常让人联想到苏格兰口音或传统叙事（如民谣、航海故事、乡村题材）。在现代日常英语里更常用“lads / boys / guys”。","作为称呼时语气通常友好，但也可能带一点“长辈对晚辈/上级对下属”的口吻；在正式场合不太常见。"]}
{"word":"laddikie","summary":{"en":"“Laddikie” is a Scottish informal word meaning a little boy or young lad.","zh":"“laddikie”是苏格兰英语中的非正式说法，意思是“小男孩/小伙子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, informal) A little boy; a young lad.","zh":"（苏格兰英语，非正式）小男孩；小伙子。"},"examples":[{"en":"The old man called the child a “wee laddikie.”","zh":"那位老人把那孩子叫作“wee laddikie（小小男孩）”。"},{"en":"When he was a laddikie, he loved running by the sea.","zh":"他还是个小男孩时，就喜欢在海边奔跑。"}]}],"synonyms":["lad","boy","wee lad","laddie"],"phonetic":"/ˈlædɪki/","extraExplanation":["“laddikie”多见于苏格兰方言/苏格兰英语（Scots）。词根是“lad（男孩/小伙子）”，后缀“-ie/-kie”常用来表示昵称或小称（有“更小、更亲昵”的感觉），类似于“dog → doggie”。","在现代日常美式英语中几乎不用；如果你在小说、民谣、苏格兰题材作品里看到它，通常用来营造地方色彩或亲昵的口吻。"]}
{"word":"laddish","summary":{"en":"“Laddish” describes a stereotypically young-male style of behavior—loud, groupy, and often disrespectful; it’s usually critical.","zh":"“laddish”指一种刻板的年轻男性式作风：吵闹、爱起哄、常不够尊重他人；多带批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Behaving in a loud, confident, and sometimes rude or sexist way that is stereotypically associated with young men (often in groups).","zh":"（多指年轻男性群体）表现得吵闹、自信甚至有点粗鲁或带性别歧视色彩的，“哥们式/小伙子式”的作风。"},"examples":[{"en":"The office has a laddish culture where people make jokes that can feel uncomfortable.","zh":"这家公司有种“哥们文化”，大家开一些可能让人不舒服的玩笑。"},{"en":"His laddish behavior got him in trouble at the bar.","zh":"他那种“哥们式”的闹腾举止让他在酒吧惹了麻烦。"},{"en":"The film critic said the comedy relies too much on laddish humor.","zh":"影评人说这部喜剧太依赖“哥们式”的低俗/男孩气幽默。"}]}],"synonyms":["macho","boorish","rowdy","juvenile"],"phonetic":"/ˈlædɪʃ/","extraExplanation":["“laddish”源自英式英语里的“lad”（小伙子、哥们）。它常见于媒体或社会评论，用来批评一种以男性群体为中心的社交风格：爱起哄、拼酒、讲荤段子、贬低女性或把冒犯当玩笑。语气通常偏负面。","在英国文化语境中，“laddish culture/behavior”常与大学社团、酒吧夜生活、某些体育圈或职场氛围相关。也有人会用得更轻一点，仅表示“很男孩气、爱闹”。","常见搭配：laddish humor（哥们式幽默）、laddish banter（哥们间互损式玩笑）、a laddish atmosphere/culture（哥们氛围/文化）。近义表达（语气相近）包括：macho（大男子气概/逞强的）、boorish（粗鲁的）、rowdy（喧闹的）。"]}
{"word":"laddock","summary":{"en":"Laddock is a rare, old Scots dialect word meaning “a young boy/lad,” and it can also appear as a surname or place-name.","zh":"laddock 是一个罕见、较旧的苏格兰方言词，意思是“男孩/小伙子”，也可能作为姓氏或地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect, old-fashioned) A young boy; a lad.","zh":"（苏格兰方言，较旧用法）男孩；小伙子。"},"examples":[{"en":"The old story begins with a poor laddock leaving home to find work.","zh":"这个老故事以一个贫穷的小伙子离家找工作开场。"},{"en":"He was just a laddock when he first went out to sea.","zh":"他第一次出海时还只是个小男孩。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare surname or place-name (used as a proper noun).","zh":"罕见的姓氏或地名（作专有名词使用）。"},"examples":[{"en":"Ms. Laddock will speak at the meeting tomorrow.","zh":"拉多克女士将于明天在会议上发言。"}]}],"synonyms":["lad","boy","youngster","youth"],"phonetic":"/ˈlædək/","extraExplanation":["“laddock”在现代标准英语里非常少见，多被视为苏格兰方言中“lad（男孩、小伙子）”的变体或带有小称意味的说法。阅读古老故事、民谣或方言写作时偶尔会遇到。","学习中常见的混淆是把它看成“haddock（黑线鳕，一种鱼）”的拼写错误；如果语境谈到食物或鱼类，更可能是“haddock”。"]}
{"word":"lade","summary":{"en":"“Lade” means to load something with goods; in literary use, it can also mean to burden or weigh down.","zh":"“lade”意为“装载（货物）”；在文学语境中也可表示“使负担沉重”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to load a vehicle, ship, or container with goods; to put a load onto something","zh":"装载；把货物装上（车辆、船只或容器）"},"examples":[{"en":"They laded the truck with boxes of fruit.","zh":"他们把一箱箱水果装上了卡车。"},{"en":"The ship was laded with timber for export.","zh":"这艘船装载着用于出口的木材。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literary) to burden or weigh down (a person or thing)","zh":"（文学用法）使负担沉重；压得喘不过气"},"examples":[{"en":"He felt laded with worries he could not share.","zh":"他感到被无法诉说的忧虑压得喘不过气。"},{"en":"The old cart, laded with stones, moved slowly up the hill.","zh":"那辆旧车装满石头，慢慢爬上山坡。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a load or cargo","zh":"（罕见）载货；货物"},"examples":[{"en":"The barge carried a lade of grain downriver.","zh":"驳船载着一船谷物顺流而下。"}]}],"synonyms":["load","fill","pack","burden","weigh down"],"phonetic":"/leɪd/","extraExplanation":["“lade”在现代英语里较少见，更常用的同义表达是“load”。在文学或较正式的语境中，你可能会看到“lade…with…”。","它的过去式常见为“laded”，过去分词既可用“laded”，也可见较传统的“laden”（如“laden with gifts/meaning”，这种“laden”在现代更常见且常作形容词使用）。"]}
{"word":"laded","summary":{"en":"“Laded” means “loaded,” especially with cargo; it’s the past form of the verb “lade.”","zh":"“laded”意为“装载了”，尤指装货；是动词“lade”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “lade”: to load (usually a ship, truck, or other vehicle) with cargo or goods.","zh":"“lade”的过去式和过去分词：装载（通常指给船、卡车等装货）。"},"examples":[{"en":"They laded the ship with grain before the storm arrived.","zh":"暴风雨来临前，他们把谷物装上了船。"},{"en":"The wagon was laded with firewood for the winter.","zh":"马车上装满了过冬用的柴火。"}]}],"synonyms":["loaded","freighted","packed","filled"],"phonetic":"/ˈleɪdɪd/","extraExplanation":["“laded”属于较偏文学/正式的用法，在现代英语里更常用“loaded”。更常见的形容词形式是“laden”（如：a truck laden with boxes 装满箱子的卡车）。在航运、贸易或古典/圣经风格的文本中更容易看到“lade/laded”。"]}
{"word":"lademan","summary":{"en":"“Lademan” is uncommon in modern English; it may mean a loader (rare) or be used as a surname.","zh":"“lademan”在现代英语中不常见；可能指（罕见的）装货工，或作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) A person whose job is to load goods or cargo; a loader.","zh":"（罕见/非标准用法）装货工；负责装载货物的人。"},"examples":[{"en":"The dock hired a lademan to load the crates onto the truck.","zh":"码头雇了一个装货工把木箱装上卡车。"},{"en":"Ask the lademan where the shipment was placed.","zh":"问装货工货物被放在哪里了。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Ms. Lademan will lead today’s meeting.","zh":"Lademan女士将主持今天的会议。"}]}],"synonyms":["loader","dockworker","stevedore"],"phonetic":"/ˈleɪdmən/","extraExplanation":["“lademan”在现代英语里非常少见，很多时候可能是拼写误差或专有名词（如姓氏）。如果你想查的是常见词，可能是：\n- **ladyman**（Ladyman，常见为姓氏，或“lady + man”的拼写组合）\n- **loader / dockworker**（装卸工，更常用）\n- **ladderman**（梯子工/负责梯子的人员，语境特定）\n如果你能提供一句原文或使用场景，我可以帮你确认最可能的词与意思。"]}
{"word":"laden","summary":{"en":"“Laden” means heavily loaded or filled, and it’s often used in the pattern “be laden with …” for both literal and figurative ‘burdens.’","zh":"“Laden”指“满载/装满/负担沉重”，常用结构是“be laden with …”，既可字面装载也可比喻压力或情绪。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Heavily loaded or filled; carrying a lot of something.","zh":"满载的；装满的；负荷沉重的。"},"examples":[{"en":"The truck was laden with boxes.","zh":"卡车装满了箱子。"},{"en":"Trees were laden with fruit after the summer rains.","zh":"夏季雨后，树上结满了果实。"}]},{"partOfSpeech":"vt.","definition":{"en":"To load or burden someone or something (often used in the passive: “be laden with”).","zh":"装载；使负担（常用被动：be laden with）。"},"examples":[{"en":"The donkey was laden with supplies for the hike.","zh":"驴子驮着徒步旅行的补给品。"},{"en":"She felt laden with responsibilities at work.","zh":"她觉得工作责任压得她喘不过气。"}]}],"synonyms":["loaded","burdened","weighed down","packed","full"],"phonetic":"/ˈleɪdən/","extraExplanation":["“laden”是动词“lade”的过去分词/过去式形式（现代英语里“lade”本身较少单独使用），所以常见结构是“be laden with + 名词”，意思是“满载/充满/背负”。","除了字面“装载”，它也常用作比喻：表示情绪或处境“沉重、压力很大”，如“laden with guilt（充满愧疚）”。","文学和固定搭配里常见：例如“snow-laden branches（积雪压枝）”“gift-laden visitors（带着很多礼物的访客）”，带有画面感。"]}
{"word":"ladened","summary":{"en":"“Ladened” is nonstandard/rare; use “laden” or “loaded.” It may appear as an archaic form meaning “loaded.”","zh":"“ladened”多为非标准/少见用法；通常应写“laden”或“loaded”。它也可能是古旧形式，意为“装载了/装满了”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or very rare form; usually a mistaken spelling of “laden” or “loaded.” In modern English, people normally say “laden” (adj./past participle) or “loaded.”","zh":"非标准或非常少见的形式；多半是把“laden”（充满/负载的）或“loaded”（装满的）拼错了。现代英语通常用“laden”或“loaded”。"},"examples":[{"en":"The truck was loaded with sand. (More natural than “ladened.”)","zh":"卡车装满了沙子。（比“ladened”自然。）"},{"en":"She walked in with arms laden with gifts.","zh":"她抱着一堆礼物走了进来。"}]},{"partOfSpeech":"v.","definition":{"en":"(Archaic) Past tense/past participle of “lade” meaning “to load.”","zh":"（古旧用法）动词“lade”（装载、装货）的过去式/过去分词，意思是“装载”。"},"examples":[{"en":"(Archaic) The ship was ladened with supplies for the voyage.","zh":"（古旧）船上装载了航行所需的补给。"}]}],"synonyms":["loaded","laden","burdened","freighted"],"phonetic":"/ˈleɪdənd/","extraExplanation":["“laden”更常见：既可作形容词（arms laden with gifts），也常作为过去分词（a ship laden with cargo）。日常写作里几乎不用“ladened”。如果你想表达“装满/负载”，最安全的是用“loaded”；如果想表达“带着很多（常带一点文学感）”，用“laden (with)”。"]}
{"word":"ladening","summary":{"en":"“Ladening” means loading something, or burdening someone/something; it’s a less common, more old-fashioned form.","zh":"“ladening”表示“装载”或“加重负担”，用法较少见，偏旧式/文学表达。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “laden/lade”) putting a load onto something; loading (often used in older or literary style).","zh":"（“laden/lade”的现在分词）把货物装到……上；装载（较常见于较旧或文学语体）。"},"examples":[{"en":"Workers were ladening the truck with boxes.","zh":"工人们正把箱子装上卡车。"},{"en":"Boats were ladening at the dock before sunrise.","zh":"天亮前，船只在码头装货。"}]},{"partOfSpeech":"v.","definition":{"en":"making someone or something carry too much; burdening.","zh":"使……负担过重；加重……的负担。"},"examples":[{"en":"He avoided ladening his team with extra tasks at the last minute.","zh":"他避免在最后一刻给团队额外加任务、加重负担。"},{"en":"Try not to keep ladening yourself with guilt.","zh":"尽量别一直用内疚来压垮自己。"}]}],"synonyms":["loading","packing","filling","burdening","weighing down"],"phonetic":"/ˈleɪdnɪŋ/","extraExplanation":["“ladening”来自较旧的动词“lade”（装载），现代英语里更常用“loading”。因此你在日常写作中用“loading”会更自然。","注意别与“lading”混淆：在航运语境中，“bill of lading”（提单）里的“lading”表示“货物/装货”这一概念，而不是动词进行时。"]}
{"word":"ladens","summary":{"en":"“ladens” means “loads heavily” (he/she/it ladens). It can also mean “burdens” in a figurative sense.","zh":"“ladens”意为“（给……）装载很多”，是“laden”的第三人称单数；也可比喻为“使……背负（压力/情绪等）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “laden”) to load or fill something heavily; to put a lot of goods or weight onto something.","zh":"（“laden”的第三人称单数）给……装载很多；把大量货物/重量放到……上。"},"examples":[{"en":"The worker ladens the truck with boxes every morning.","zh":"工人每天早上把一箱箱的东西装到卡车上。"},{"en":"Heavy rain ladens the branches with water.","zh":"大雨把树枝压得满是水分。"}]},{"partOfSpeech":"vt.","definition":{"en":"to burden someone/something with a strong feeling or problem (often in a figurative, literary style).","zh":"（多为比喻或文学用法）使……背负沉重的情绪、压力或问题。"},"examples":[{"en":"The news ladens her heart with worry.","zh":"这个消息让她心里充满担忧。"},{"en":"Years of debt ladens the family with stress.","zh":"多年的债务让这家人背负巨大压力。"}]}],"synonyms":["loads","fills","packs","burdens","weighs down"],"phonetic":"ˈleɪdənz","extraExplanation":["“ladens”是动词“laden”的第三人称单数形式（he/she/it ladens）。更常见的形式是形容词“laden”（意为“满载的、负担沉重的”），例如：snow-laden mountains（积雪覆盖的群山）。","动词“laden”在现代英语里偏书面/文学感，日常更常用“load”：He loads the truck."]}
{"word":"lader","summary":{"en":"“Ladder” means a climbing tool with rungs, and it can also mean a path of levels (like a career ladder).","zh":"“ladder”指“梯子”，也可比喻“阶梯/晋升路径”（如职业阶梯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of steps (rungs) fixed between two side pieces, used for climbing up or down","zh":"梯子；（有横档的）攀爬工具"},"examples":[{"en":"He climbed the ladder to fix the roof.","zh":"他爬上梯子去修屋顶。"},{"en":"Please hold the ladder steady.","zh":"请把梯子扶稳。"}]},{"partOfSpeech":"n.","definition":{"en":"a series of levels you can move up through, especially in a job or social system","zh":"（职场/社会中的）等级阶梯；晋升路径"},"examples":[{"en":"She moved quickly up the career ladder.","zh":"她在职业阶梯上升得很快。"},{"en":"Education can help you climb the social ladder.","zh":"教育可以帮助你向上攀升社会阶梯。"}]},{"partOfSpeech":"v.","definition":{"en":"to move upward in a series of steps or levels (especially prices, ranks, or progress)","zh":"（以阶段性方式）上升；逐步推进（多指价格、级别或进展）"},"examples":[{"en":"Prices laddered upward over the year.","zh":"价格在一年中逐步上涨。"},{"en":"The team laddered their training to build strength safely.","zh":"团队把训练分阶段安排，以更安全地增强力量。"}]}],"synonyms":["steps","stairway","career path","hierarchy"],"phonetic":"/ˈlædɚ/","extraExplanation":["你输入的“lader”在英语里通常不是标准拼写；最常见的目标词是“ladder（梯子）”。如果你想表达“食品储藏室”，可能是“larder”。如果你告诉我上下文句子，我可以帮你确定正确词。"]}
{"word":"laders","summary":{"en":"“Laders” is most likely a misspelling of “ladders,” the plural of “ladder” (a climbing tool or a metaphor for progress).","zh":"“laders”多半是“ladders”的拼写错误；“ladders”是“ladder”的复数，指梯子，也可比喻进步/晋升的阶梯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of steps (rungs) fixed between two side bars, used for climbing up or down.","zh":"梯子；由两侧支架和横档组成，用于上下攀爬。"},"examples":[{"en":"He climbed the ladder to fix the roof.","zh":"他爬上梯子去修屋顶。"},{"en":"Please hold the ladder steady.","zh":"请把梯子扶稳。"}]},{"partOfSpeech":"n.","definition":{"en":"A way to describe levels of progress or status in a system (for example, in a job).","zh":"（比喻）阶梯；等级体系中的上升路径（如职业晋升）。"},"examples":[{"en":"She worked her way up the career ladder.","zh":"她一步步在职业阶梯上往上走。"},{"en":"Education can be a ladder out of poverty.","zh":"教育可以成为摆脱贫困的阶梯。"}]},{"partOfSpeech":"v.","definition":{"en":"To move upward step by step, especially in a sequence of increasing levels or positions.","zh":"（比喻）逐级上升；一步步提升（在等级或序列中）。"},"examples":[{"en":"Over time, the team laddered up to the top division.","zh":"随着时间推移，这支队伍逐级升到了最高级别。"}]}],"synonyms":["steps","stairway","ranking","hierarchy"],"phonetic":"/ˈlædɚ/","extraExplanation":["“laders”通常是拼写错误，更常见的拼法是 **ladders**（ladder 的复数）。如果你想查的是人名/姓氏 **Lader(s)**，也可能成立，但在日常英语里最常用的是“ladder/ ladders”。"]}
{"word":"lades","summary":{"en":"“Lades” is an uncommon modern form meaning “loads” (puts cargo or a burden onto something).","zh":"“lades”是较少见的现代用法，相当于“loads”，意思是“装载/使负担沉重”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “lade”) to load or put cargo, goods, or a burden onto something (especially a ship, truck, or person).","zh":"（动词 lade 的第三人称单数）装载；把货物/重物装上（尤指船、卡车或某人身上）。"},"examples":[{"en":"The workers lades the truck with boxes before dawn. (More common: “load” or “loads.”)","zh":"工人们天没亮就把箱子装上卡车。（更常用：load 或 loads。）"},{"en":"She lades the boat with supplies for the trip. (Often replaced by “loads.”)","zh":"她把旅行用品装上船。（常用 loads 替代。）"}]},{"partOfSpeech":"v.","definition":{"en":"To heap or burden someone with something (often used in the passive: “be laden with”).","zh":"使（某人）负担沉重；使充满/堆满（常见于被动：be laden with）。"},"examples":[{"en":"The branches are laden with fruit. (Related form; “lades” is rare in modern use.)","zh":"树枝上挂满了果实。（相关形式；lades 在现代英语中很少用。）"},{"en":"He feels laden with responsibility at work.","zh":"他觉得工作责任压得他喘不过气。"}]}],"synonyms":["loads","puts","stows","packs","burdens"],"phonetic":"/leɪdz/","extraExplanation":["“lades”在现代英语里很少见，通常会用更常用的“load/loads”。你更可能在较旧的文学作品或正式描写航运、装货的语境里看到它。","容易和“ladies”（女士们）混淆：ladies 的发音是 /ˈleɪdiz/，而 lades 是 /leɪdz/。如果你想表达“女士们”，正确拼写是 ladies。"]}
{"word":"ladhood","summary":{"en":"Ladhood means the time or state of being a lad—a boy’s youth or early adolescence.","zh":"Ladhood 指“作为少年/男孩的时期或状态”，相当于“少年时代、男孩的青春早期”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a lad; boyhood (often emphasizing youthful energy, play, or early adolescence)","zh":"少年时期；男孩时代（常强调年轻的活力、顽皮或早期青春期）"},"examples":[{"en":"He spent his ladhood in a small fishing town by the sea.","zh":"他的少年时代是在海边一个小渔镇度过的。"},{"en":"Stories from his ladhood were full of adventures and minor troubles.","zh":"他少年时期的故事充满了冒险和小麻烦。"}]}],"synonyms":["boyhood","childhood","youth","adolescence"],"phonetic":"ˈlædˌhʊd","extraExplanation":["“ladhood”由“lad（少年/小伙子）+ -hood（……的状态/时期）”构成，和“childhood（童年）”“boyhood（少年期）”结构相同。它在现代英语中不算常用，写作里更常见的是“boyhood”或“childhood”。","语气上，“ladhood”可能带一点英式或文学色彩，有时也会让人联想到更朴素、民间的“少年/小伙子”形象（如乡村、工人阶层语境）。"]}
{"word":"Ladies","summary":{"en":"“Ladies” means women, often in a polite or formal way; it can also be used to address a group of women or to mean the women’s restroom.","zh":"“Ladies”指“女士们/女性”，多用于礼貌或正式场合；也可用来称呼一群女性，或指“女洗手间”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women (plural of “lady”), often used in a polite or respectful way.","zh":"女士们；女性（“lady”的复数），常用于礼貌或尊重的表达。"},"examples":[{"en":"The event is open to ladies of all ages.","zh":"这个活动对各年龄段的女士开放。"},{"en":"Several ladies from the neighborhood volunteered to help.","zh":"社区里有几位女士自愿来帮忙。"}]},{"partOfSpeech":"n.","definition":{"en":"A polite way to address a group of women, often used in formal speaking (e.g., “Ladies and gentlemen…”).","zh":"对一群女性的礼貌称呼，常用于正式发言（如“Ladies and gentlemen…”）。"},"examples":[{"en":"Ladies, please take your seats.","zh":"女士们，请就座。"},{"en":"Ladies and gentlemen, welcome to the show.","zh":"女士们、先生们，欢迎来到演出现场。"}]},{"partOfSpeech":"n.","definition":{"en":"A public sign meaning the women’s restroom.","zh":"公共标识：女洗手间（女厕）。"},"examples":[{"en":"The ladies is down the hall on the left.","zh":"女洗手间在走廊尽头左边。"},{"en":"Excuse me—where are the ladies?","zh":"不好意思，请问女洗手间在哪儿？"}]}],"synonyms":["women","ladies (formal address)","female adults (more formal/neutral)"],"phonetic":"/ˈleɪdiz/","extraExplanation":["“ladies”通常比“women”更显得礼貌、正式或带有尊称意味，但在某些语境下也可能显得刻意或有点“端着”。在需要更中性、客观的表达（如研究、统计、新闻）里，“women”更常用。","“Ladies and gentlemen”是典型的正式开场白；在更现代、更包容的场合，也可能听到“everyone / folks / distinguished guests”等替代说法。"]}
{"word":"ladies","summary":{"en":"“Ladies” is the plural of “lady,” used for adult women, for polite address, and in set phrases like “ladies’ room.”","zh":"“Ladies”是“lady”的复数，可指成年女性、作为礼貌称呼，也常用于固定搭配如“ladies’ room（女洗手间）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “lady”: adult women; also a polite way to refer to women in general.","zh":"“lady”的复数：成年女性；也可作礼貌用法，泛指女性。"},"examples":[{"en":"Ladies and gentlemen, the show is about to begin.","zh":"女士们、先生们，演出马上开始。"},{"en":"The ladies in my family love cooking together on holidays.","zh":"我家里的女士们喜欢在节日一起做饭。"}]},{"partOfSpeech":"n.","definition":{"en":"A polite form of address used to get women’s attention, especially in service or public situations.","zh":"对女性的礼貌称呼，用于引起注意，常见于服务场景或公共场合。"},"examples":[{"en":"Ladies, this way please.","zh":"女士们，请走这边。"},{"en":"Excuse me, ladies—could you please keep your voices down?","zh":"打扰一下，女士们——可以请你们小声一点吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective in set phrases related to women (e.g., “ladies’ room,” “ladies’ shoes”).","zh":"作形容词用于固定搭配，表示“女性的/女士用的”（如“ladies’ room 女洗手间”“ladies’ shoes 女鞋”）。"},"examples":[{"en":"The ladies’ room is down the hall on the left.","zh":"女洗手间在走廊尽头左侧。"},{"en":"This store sells ladies’ coats and bags.","zh":"这家店卖女式外套和包。"}]}],"synonyms":["women","females (more scientific/impersonal)","ladies and gentlemen (fixed phrase)"],"phonetic":"/ˈleɪdiz/","extraExplanation":["“ladies”常被认为比“women”更礼貌、更正式，但在一些语境里也可能显得过于传统、带有“淑女/端庄”的期待。比较中性、直接的表达通常用“women”。","公共标识里“Ladies”常指“女洗手间”，但在北美也越来越常见更中性的标识，如“Restroom”“All-gender restroom”。"]}
{"word":"ladified","summary":{"en":"“Ladified” means made more like a lad—more boyish or casually masculine; it’s a rare word and can also be the past form of “ladify.”","zh":"“ladified”指变得更像“小伙子/男孩”（更男孩气或更随意男性风格）；较少见，也可作“ladify”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made more like a lad (boyish, youthful, or casually masculine in style); turned into a “lad.”","zh":"变得更像“小伙子/男孩”的；带有更男孩子气、更随意男性风格的。"},"examples":[{"en":"The magazine’s new photo shoot felt a bit ladified—more sneakers, less formalwear.","zh":"这本杂志的新写真有点“男孩化”——更多运动鞋，更少正装。"},{"en":"He joked that moving in with his roommates had ladified his habits.","zh":"他开玩笑说，和室友合住让他的生活习惯变得更“男生式”。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “ladify” (to make someone or something more like a lad).","zh":"“ladify”的过去式/过去分词：使某人或某物更像小伙子（更男孩气）。"},"examples":[{"en":"The director ladified the character by giving him a rougher accent and simpler clothes.","zh":"导演通过更粗犷的口音和更朴素的衣服，让这个角色更“男孩化”。"}]}],"synonyms":["more boyish","lad-like","more masculine","youthful","rough-and-ready"],"phonetic":"/ˈlædɪˌfaɪd/","extraExplanation":["“ladified”比较少见，更常见的表达会用：made more boyish / more lad-ish / more masculine / more like a young guy 等。","注意不要和“ladyfied”（变得更像淑女的、更女性化的）混淆；两者只差一个字母，但意思相反。","在英式英语语境里，lad 常带有“年轻、爱玩、随意甚至有点粗线条”的文化色彩（如 lad culture）。"]}
{"word":"ladify","summary":{"en":"“Ladify” means to make someone or something more “ladylike,” often with a humorous or critical tone.","zh":"“Ladify”指把某人或某物变得更“淑女化/更淑女风”，常带幽默或批评语气。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something more like a lady, especially by teaching polite manners or encouraging refined behavior","zh":"使（某人/某物）更像淑女（尤指通过礼仪教育或要求举止更文雅）"},"examples":[{"en":"They tried to ladify her with etiquette lessons and formal speech.","zh":"他们试图用礼仪课和更正式的说话方式把她“淑女化”。"},{"en":"The finishing school promised to ladify young women for high society.","zh":"那所女子礼仪学校承诺把年轻女性“培养成上流社会的淑女”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something seem more elegant, feminine, or “ladylike” (often used humorously or critically)","zh":"使某物看起来更优雅、更女性化或更“淑女风”（常带调侃或批评意味）"},"examples":[{"en":"She ladified the room with lace curtains and pastel colors.","zh":"她用蕾丝窗帘和粉彩色调把房间装点得更“淑女风”。"},{"en":"The marketing team tried to ladify the product to attract a new audience.","zh":"市场团队试图把产品包装得更“女性向”，以吸引新的受众。"}]}],"synonyms":["feminize","refine","polish","gentrify (sometimes, context-dependent)"],"phonetic":"/ˈlædɪˌfaɪ/","extraExplanation":["“ladify”不算常用词，更多见于幽默、讽刺或评论性语境。使用时要注意语气：可能暗示对“女性/淑女应当怎样”的刻板期待。","词尾“-ify”表示“使变成……/使具有……特征”（如 beautify 美化、simplify 简化）。因此 ladify = “使变得像 lady（淑女）一样”。"]}
{"word":"ladifying","summary":{"en":"“Ladifying” means making something more “lad-like” or becoming associated with “lad culture.”","zh":"“Ladifying”指让某物更“像小伙子/兄弟帮风格”，或逐渐带有“lad文化”的色彩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “ladify”) to make something or someone more like a “lad” (a young man), especially in a stereotypically masculine, rowdy, or “bro” style.","zh":"（“ladify”的现在分词）使某人/某事更“像小伙子（lad）”，尤其带有刻板印象中的男性化、爱闹腾、兄弟帮（bro）风格。"},"examples":[{"en":"The ads are ladifying the product by using sports, beer jokes, and macho slogans.","zh":"这些广告用运动、啤酒段子和硬汉口号，把产品包装得更“直男/兄弟风”。"},{"en":"Some fans worry the club is ladifying its image instead of staying family-friendly.","zh":"一些球迷担心俱乐部在“兄弟化”形象，而不是保持家庭友好。"}]},{"partOfSpeech":"adj.","definition":{"en":"acting in a “lad-like” way; becoming more associated with “lad culture.”","zh":"表现得很“lad”；越来越带有“兄弟文化/直男闹腾文化”的色彩。"},"examples":[{"en":"His social media posts have been getting more ladifying—lots of late-night selfies and drinking jokes.","zh":"他的社交媒体越来越“lad化”——一堆深夜自拍和喝酒梗。"},{"en":"The movie starts thoughtful but turns ladifying in the second half.","zh":"电影开头很走心，但后半段变得更“兄弟闹腾”。"}]}],"synonyms":["masculinizing","bro-ifying","frat-ifying","macho-izing"],"phonetic":"/ˈlædɪˌfaɪɪŋ/","extraExplanation":["“ladifying / ladify”并不是非常常见的标准词，更像是新闻评论、文化评论里为了表达“变得更像lad（小伙子/兄弟帮）”而临时造出来的词。","在英式英语语境里，lad culture 常指一种强调兄弟结伴、喝酒、玩笑（有时带点冒犯）、体育、追求“硬汉感”的青年男性文化。用“ladifying”时往往带有批评或调侃的语气，表示某个品牌、组织或内容在迎合这种风格。"]}
{"word":"ladik","summary":{"en":"“Ladik” is usually a proper noun referring to a town/district (and lake) in northern Turkey.","zh":"“Ladik”通常是专有名词，指土耳其北部的一个城镇/行政区（以及同名湖泊）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name (proper noun): Ladik, a town and district in Samsun Province, northern Turkey (also used for nearby Lake Ladik).","zh":"专有名词（地名）：Ladik，土耳其北部萨姆松省的一个城镇与行政区（也可指附近的Ladik湖）。"},"examples":[{"en":"Ladik is a district in Samsun Province, Turkey.","zh":"Ladik 是土耳其萨姆松省的一个行政区。"},{"en":"They stopped by Lake Ladik during their trip in northern Turkey.","zh":"他们在土耳其北部旅行时顺道去了 Ladik 湖。"}]}],"phonetic":"/ˈlɑːdɪk/","extraExplanation":["“ladik”在英语里通常不是常见词汇，更常见的是作为土耳其地名的拼写（Ladik）。如果你本来想查的是英语单词，可能是拼写接近的：lad（小伙子）、laddie（男孩/小伙子，较口语/苏格兰用法）等。你可以告诉我你看到它的句子或语境，我可以帮你确认。"]}
{"word":"ladin","summary":{"en":"Ladin is a Romance language (and the people) from the Dolomites in northern Italy.","zh":"Ladin 指意大利北部多洛米蒂山区的罗曼语（以及使用这种语言的族群/相关事物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Romance language spoken mainly in the Dolomite mountains of northern Italy","zh":"拉丁语族的一种罗曼语，主要在意大利北部多洛米蒂山区使用"},"examples":[{"en":"Some road signs in South Tyrol appear in Italian, German, and Ladin.","zh":"南蒂罗尔的一些路牌会同时使用意大利语、德语和拉丁语（Ladin）。"},{"en":"She is learning Ladin to talk with her grandparents.","zh":"她在学拉丁语（Ladin），好和祖父母交流。"}]},{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Ladin-speaking communities of northern Italy","zh":"拉丁语（Ladin）使用者社群的一员；拉丁人（指意大利北部相关族群）"},"examples":[{"en":"He is a Ladin from the Val Gardena area.","zh":"他来自加尔代纳山谷一带，是拉丁人（Ladin）。"},{"en":"Local Ladins work to preserve their traditions and language.","zh":"当地拉丁人（Ladins）努力保护他们的传统与语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ladin language or Ladin people","zh":"与拉丁语（Ladin）或拉丁人（Ladin族群）有关的"},"examples":[{"en":"They attended a Ladin cultural festival.","zh":"他们参加了一个拉丁文化节。"},{"en":"The school offers Ladin language classes.","zh":"这所学校开设拉丁语（Ladin）课程。"}]}],"synonyms":["Ladin language","Dolomite Ladin"],"phonetic":"/ləˈdin/","extraExplanation":["注意不要把 **Ladin** 和 **Latin（拉丁语）** 混淆：Ladin 是意大利北部的地方罗曼语；Latin 通常指古罗马的拉丁语。","在意大利语中常写作 **ladino**（复数 **ladini**）；英语里常用拼写 **Ladin**（人或语言）。"]}
{"word":"lading","summary":{"en":"Lading means the cargo or goods being carried, especially in shipping and trade.","zh":"Lading 指运输中的货物，尤其常用于航运与贸易等正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the cargo (goods) carried on a ship, truck, or other vehicle, especially in shipping and trade","zh":"（尤指航运与贸易中的）货物；装载物（如船上的货物）"},"examples":[{"en":"The ship’s lading included coffee, textiles, and machinery.","zh":"这艘船装载的货物包括咖啡、纺织品和机械。"},{"en":"The crew checked the lading before leaving the port.","zh":"离港前，船员核对了装载的货物。"}]}],"synonyms":["cargo","freight","shipment","load"],"phonetic":"/ˈleɪdɪŋ/","extraExplanation":["“lading”来自动词“lade”（装载），在现代英语里更常见于正式/法律/航运语境。","常见搭配是“bill of lading”（提单）：一种重要的航运单据，用来证明货物已装船/已收货，并写明货物信息与运输条款；在国际贸易中非常关键。日常口语里更常用“cargo”“shipment”。"]}
{"word":"ladings","summary":{"en":"“Ladings” means goods/cargo being transported, especially in shipping and formal contexts.","zh":"“Ladings”指运输中的货物（较正式、常见于航运/物流语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"goods or cargo carried on a ship, plane, or truck (plural of “lading”).","zh":"（lading 的复数）装载的货物；船/飞机/卡车所载的货物。"},"examples":[{"en":"The ship arrived with ladings of grain and timber.","zh":"那艘船带着一批批谷物和木材的货物抵达了。"},{"en":"Customs officers checked the ladings against the paperwork.","zh":"海关人员把货物与文件进行核对。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of loading goods for transport (less common; plural use is rare).","zh":"（较少用）装货的行为或过程；装载过程。"},"examples":[{"en":"Delays during the ladings caused the shipment to miss its deadline.","zh":"装货过程中的延误导致这批货错过了截止时间。"}]}],"synonyms":["cargo","freight","shipment","goods"],"phonetic":"/ˈleɪdɪŋz/","extraExplanation":["“lading/ladings”多见于航运、物流、法律或较正式的书面语中，日常英语更常说 cargo / goods / shipment。","常见搭配：bill of lading（提单）= 运输合同与收货凭证，用来说明货物种类、数量、发货人、收货人等信息。","词源上与动词 load（装载）同源；在文学或历史语境里，常用来描写船舶“满载而归”的货物。"]}
{"word":"ladino","summary":{"en":"Ladino most commonly refers to Judeo-Spanish (a Sephardic Jewish variety of Spanish). In Central America, it can also mean a Spanish-speaking, non-Indigenous person; rarely, it can mean “sly.”","zh":"Ladino最常见指“拉迪诺语”（塞法迪犹太人使用的犹太-西班牙语）。在中美洲语境中也可指讲西班牙语、非原住民（或文化上西化）的人；少见时可作“狡黠的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variety of Spanish traditionally spoken by Sephardic Jews (also called Judeo-Spanish or Judezmo).","zh":"拉迪诺语：塞法迪犹太人传统使用的一种西班牙语变体（也称“犹太-西班牙语 / Judeo-Spanish”或“Judezmo”）。"},"examples":[{"en":"My professor studies Ladino songs passed down in Sephardic families.","zh":"我的教授研究在塞法迪家族中代代相传的拉迪诺语歌曲。"},{"en":"Some older speakers can still read prayers in Ladino.","zh":"一些年长的使用者仍然能用拉迪诺语阅读祷文。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in Guatemala and nearby regions) a person who is not Indigenous, or who is culturally Spanish-speaking/Westernized; often used as an ethnic or social label.","zh":"（尤指危地马拉及周边地区）拉迪诺人：指非原住民，或在文化上讲西班牙语、接受西式生活方式的人；常作族群或社会身份标签使用。"},"examples":[{"en":"In Guatemala, “Ladino” can describe people who identify with Spanish-speaking culture rather than Indigenous communities.","zh":"在危地马拉，“Ladino”可用来指认同西班牙语文化、而非原住民社群的人。"},{"en":"The census categories sometimes separate Indigenous groups and Ladino populations.","zh":"人口普查的分类有时会将原住民群体与拉迪诺人群分开统计。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare in English, from Spanish) clever in a slightly dishonest or slippery way; sly.","zh":"（英语中较少见，源自西班牙语）狡黠的；有点不诚实、圆滑的。"},"examples":[{"en":"In older translations, a character may be described as ladino—charming but sly.","zh":"在一些较早的译本里，某个角色可能被写成ladino——迷人但狡黠。"}]}],"synonyms":["Judeo-Spanish","Judezmo","Judaeo-Spanish"],"phonetic":"/ləˈdiːnoʊ/","extraExplanation":["“Ladino（拉迪诺语）”与塞法迪犹太人历史密切相关：1492年西班牙驱逐犹太人后，许多塞法迪社群迁徙到奥斯曼帝国、巴尔干和北非等地，保留并发展了这种带有古西班牙语特点、又吸收希伯来语与多种当地语言成分的语言。","在拉丁美洲语境里，“Ladino（拉迪诺人）”可能涉及族群与阶层身份，使用时要注意地区差异与当事人偏好；在一些场合它是中性社会分类，在另一些场合可能带有历史与政治敏感性。"]}
{"word":"ladinos","summary":{"en":"“Ladinos” most often refers either to Spanish-speaking non-Indigenous/mainstream people in Guatemala and nearby regions, or to Sephardic Jews connected with the Ladino (Judeo-Spanish) language and culture.","zh":"“Ladinos”最常见有两种含义：一是危地马拉等地讲西班牙语、非原住民/已西语化融入主流社会的人群；二是与拉迪诺语（犹太西班牙语）及塞法迪犹太文化相关的人群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Central America, especially Guatemala) People who are not Indigenous, or Indigenous people who have adopted Spanish language and culture; often described as mixed-heritage or Spanish-speaking mainstream society.","zh":"（中美洲，尤指危地马拉）指“非原住民族”或“已西语化/融入西班牙文化的原住民”；常用来描述讲西班牙语、较主流社会的一群人，常与混血/西语文化相关。"},"examples":[{"en":"In Guatemala, Ladinos and Indigenous communities often have different languages and traditions.","zh":"在危地马拉，Ladinos 与原住民族群往往有不同的语言和传统。"},{"en":"The museum explains how Ladinos and Maya peoples shaped the country’s history.","zh":"这座博物馆介绍了 Ladinos 与玛雅人民如何共同塑造国家历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sephardic culture) Sephardic Jews or people connected to the Ladino (Judeo-Spanish) language and tradition.","zh":"（塞法迪文化）指塞法迪犹太人，或与拉迪诺语（犹太西班牙语）及其传统相关的人群。"},"examples":[{"en":"Some Ladinos still sing traditional songs in Ladino (Judeo-Spanish).","zh":"一些 Ladinos 仍会用拉迪诺语（犹太西班牙语）演唱传统歌曲。"},{"en":"The festival celebrates Ladinos, their food, and their music.","zh":"这个节庆庆祝 Ladinos 及其饮食与音乐文化。"}]}],"synonyms":["Spanish-speaking mainstream people (Guatemala context)","non-Indigenous Guatemalans (contextual)","Sephardic Jews (contextual)","Judeo-Spanish speakers (contextual)"],"phonetic":"/ləˈdiːnoʊz/","extraExplanation":["“Ladinos”有两大常见文化语境：1）危地马拉等地的族群分类；2）塞法迪犹太文化/拉迪诺语社群。阅读或写作时最好根据国家、历史与语言线索判断指的是哪一类。","在中美洲语境里，“Ladino”涉及族群与身份认同，可能带有社会阶层与历史背景色彩；表达时建议尊重当事人自称，并避免把它简单等同于“混血=某种性格/优劣”的刻板印象。"]}
{"word":"ladkin","summary":{"en":"“Ladkin” is an old-fashioned word meaning a little lad or young boy.","zh":"“Ladkin”是一个古旧用法，意思是“小伙子/小男孩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or dialect) a little lad; a young boy (a diminutive form of “lad”).","zh":"（古旧或方言）小伙子；小男孩（“lad”的指小形式）。"},"examples":[{"en":"The old song mentions a ladkin who wanders far from home.","zh":"那首老歌里提到一个小伙子远走他乡。"},{"en":"In some older stories, a “ladkin” is simply a young boy.","zh":"在一些较早的故事里，“ladkin”就是指小男孩。"}]}],"synonyms":["little lad","boy","young lad"],"phonetic":"/ˈlædkɪn/","extraExplanation":["“ladkin”现在非常少见，带有古风、民谣或地区方言色彩；现代英语更常说“boy”“young lad”“little boy”。","后缀“-kin”在英语中常用来表示“小”“亲昵”或“指小形式”（类似“napkin（原义与布有关的指小词）”等词中的历史用法），因此“lad + -kin”可理解为“年纪更小/更亲昵的lad”。"]}
{"word":"ladle","summary":{"en":"A ladle is a deep, long-handled spoon for serving liquids; it can also mean to serve food with one.","zh":"ladle 指“长柄汤勺”，也可作动词表示“用汤勺舀/盛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A deep-bowled spoon with a long handle, used for serving soup, stew, or sauce.","zh":"长柄勺；汤勺（用于舀汤、炖菜或酱汁等）。"},"examples":[{"en":"Could you pass me the ladle for the soup?","zh":"你能把汤勺递给我吗？"},{"en":"He used a ladle to pour the sauce over the pasta.","zh":"他用长柄勺把酱汁浇在意大利面上。"}]},{"partOfSpeech":"v.","definition":{"en":"To serve or pour a liquid or semi-liquid food with a ladle.","zh":"用汤勺舀（或盛、浇）液体或半流质食物。"},"examples":[{"en":"She ladled soup into each bowl.","zh":"她把汤一勺勺舀进每个碗里。"},{"en":"Ladle the stew over rice and serve hot.","zh":"把炖菜舀在米饭上，趁热吃。"}]}],"synonyms":["scoop","dipper","spoon (general)"],"phonetic":"/ˈleɪdəl/","extraExplanation":["“ladle”也常出现在固定搭配中：\n- “ladle out” 表示“（把食物）舀出来分给大家”，例如：She ladled out portions for the kids.（她把份量舀出来分给孩子们。）\n\n名词“ladle”在英美家庭用餐、食堂打饭、以及自助餐场景里很常见；它的深勺面适合盛汤或酱汁，和较浅的“spoon”用途不同。"]}
{"word":"ladled","summary":{"en":"“Ladled” means liquid food was served or poured with a ladle (past tense/participle of “ladle”).","zh":"“ladled”表示用汤勺把汤、酱汁等舀出或盛/浇上，是“ladle”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “ladle”: to serve, pour, or transfer liquid or semi-liquid food with a ladle (a deep-bowled spoon).","zh":"“ladle”的过去式/过去分词：用长柄勺（汤勺）舀取、盛出或倒出液体或半流质食物。"},"examples":[{"en":"She ladled soup into each bowl.","zh":"她把汤舀进每个碗里。"},{"en":"He ladled sauce over the pasta.","zh":"他把酱汁舀在意大利面上。"},{"en":"The cook ladled the stew from the pot.","zh":"厨师从锅里把炖菜舀出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often in passive form) served or poured with a ladle; having been spooned out in large amounts.","zh":"（常用于被动）用汤勺盛出/浇上；（常暗示）一大勺一大勺地给。"},"examples":[{"en":"Hot gravy was ladled onto the mashed potatoes.","zh":"热肉汁被一勺勺浇在土豆泥上。"},{"en":"The punch was ladled into cups at the party.","zh":"聚会上把果酒一勺勺舀进杯子里。"}]}],"synonyms":["served","spooned","scooped","poured"],"phonetic":"ˈleɪd(ə)ld","extraExplanation":["“ladle”既是名词（汤勺），也是动词（用汤勺舀）。在菜单或食谱里常见被动结构：“be ladled into/onto…（被舀进/浇在……上）”。","语气上，“ladle out”有时带一点“给得很多、分配（往外舀）”的感觉，比如：The teacher ladled out praise（老师大把夸奖）。"]}
{"word":"ladleful","summary":{"en":"A ladleful is the amount a ladle holds—one scoop of soup, sauce, etc.","zh":"ladleful 指“用汤勺舀起的一勺的量”，常用于汤、酱汁等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The amount of liquid or food that a ladle can hold (a ladle-shaped scoop).","zh":"一勺（用长柄汤勺舀起的量）；一勺的分量。"},"examples":[{"en":"Add a ladleful of soup to each bowl.","zh":"每个碗里加一勺汤。"},{"en":"He poured in one ladleful of sauce, then tasted it.","zh":"他倒入一勺酱汁，然后尝了尝。"},{"en":"With every ladleful, the pot grew emptier.","zh":"每舀一勺，锅就更空一点。"}]}],"synonyms":["scoop","serving","portion","spoonful (similar idea)"],"phonetic":"/ˈleɪdəlˌfʊl/","extraExplanation":["“ladleful”由“ladle（汤勺）+ -ful（表示‘装满……的量’）”构成，类似的还有“spoonful（一匙）”“cupful（一杯的量）”。","它通常表示“大致的量”，不是精确单位；在菜谱或日常口语里很常见。"]}
{"word":"ladlefuls","summary":{"en":"“Ladlefuls” means several ladle-sized portions of liquid or food.","zh":"“ladlefuls”指好几勺（大汤勺大小）的份量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Amounts that fill a ladle; spoonful-like portions served or poured with a ladle (plural of “ladleful”).","zh":"一勺（大汤勺）量；用勺舀起的一份量（“ladleful”的复数）。"},"examples":[{"en":"She added two ladlefuls of soup to each bowl.","zh":"她给每个碗里加了两勺汤。"},{"en":"The recipe calls for three ladlefuls of broth.","zh":"这个食谱要求加入三勺高汤。"},{"en":"He poured ladlefuls of gravy over the rice.","zh":"他把一勺勺肉汁浇在米饭上。"}]}],"synonyms":["scoopfuls","spoonfuls","servings","portions"],"phonetic":"ˈleɪd(ə)lˌfʊlz","extraExplanation":["“ladleful”= ladle（长柄大勺）+ -ful（“……的量”，如 spoonful, cupful）。在日常英语里它不是严格的计量单位，更偏向“看起来一勺那么多”的大概份量。"]}
{"word":"ladler","summary":{"en":"“Ladler” usually means a person who serves or pours soup (or other liquids) with a ladle; it’s an uncommon word compared with “ladle.”","zh":"“Ladler”通常指用汤勺舀汤/分盛液体食物的人；相比之下更常用的词是“ladle（汤勺；舀）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who ladles (serves or pours liquid food, such as soup) with a ladle","zh":"用长柄勺（汤勺）舀取、分盛液体食物（如汤）的人"},"examples":[{"en":"The ladler filled each bowl with hot soup.","zh":"盛汤的人把热汤一碗碗舀好。"},{"en":"At the community dinner, one volunteer was the ladler and another served bread.","zh":"在社区晚餐上，一名志愿者负责舀汤，另一名负责分发面包。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool or machine part that scoops or pours like a ladle (less common)","zh":"形状或功能类似汤勺的工具或机器部件（较少见）"},"examples":[{"en":"The recipe mentions using a ladler to portion the sauce evenly.","zh":"食谱提到用一种“舀取器”把酱汁均匀分份。"}]}],"synonyms":["server","soup server","ladle (more common)"],"phonetic":"/ˈleɪd(ə)lər/","extraExplanation":["“ladler”比较少见，更常用的是“ladle”（名词：汤勺；动词：用汤勺舀）。如果你想表达“舀汤的人”，可以用“a person serving soup”或“server”，正式一点也可以说“ladler”。","拼写提示：ladle + -r → ladler（表示“做某事的人/物”的后缀 -er 的变体），但实际使用频率不高。"]}
{"word":"ladlers","summary":{"en":"“Ladlers” means people or tools that serve liquids/food with a ladle; it’s not as common as “ladles.”","zh":"“ladlers”指用大勺盛取分装食物/液体的人或器具；日常更常见的是“ladles”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ladler: a person or tool that serves food or liquid using a ladle (a big deep spoon).","zh":"ladler 的复数：用长柄大勺（ladle）盛取并分装食物或液体的人，或用于舀取/分装的器具。"},"examples":[{"en":"In the soup kitchen, ladlers served hot soup to everyone in line.","zh":"在施粥所里，分汤的人用大勺把热汤盛给排队的每个人。"},{"en":"We need two ladlers so the sauce and the soup don’t mix.","zh":"我们需要两把分装用的大勺/工具，这样酱汁和汤就不会混在一起。"}]}],"synonyms":["servers","scoopers","portioners"],"phonetic":"/ˈleɪdlɚ/","extraExplanation":["“ladlers”在日常英语里不算特别常见；更常见的说法是直接用“ladles”（大勺/长柄汤勺的复数）或说“people who ladle soup”（盛汤的人）。如果你本来想写的是“ladles”，那它指的通常就是“长柄汤勺/大勺”。"]}
{"word":"ladles","summary":{"en":"“Ladles” means either multiple ladles (serving spoons) or the verb form meaning “serves/pours with a ladle.”","zh":"“ladles”既可表示“多把汤勺（长柄深勺）”，也可表示动词形式“用汤勺舀出/盛出”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long-handled spoon with a deep bowl, used for serving soups, stews, sauces, or punch.","zh":"长柄勺（汤勺）；用于舀汤、炖菜、酱汁或饮料（如宾治）的深勺。"},"examples":[{"en":"She used a ladle to serve soup into each bowl.","zh":"她用汤勺把汤舀到每个碗里。"},{"en":"Add two ladles of sauce over the rice.","zh":"在米饭上浇两勺酱汁。"}]},{"partOfSpeech":"v.","definition":{"en":"To serve or pour something using a ladle; to scoop out and distribute.","zh":"用汤勺舀出并分给（或盛出）；用勺子舀着倒。"},"examples":[{"en":"He ladled the stew into plates for everyone.","zh":"他把炖菜一勺勺舀到每个人的盘子里。"},{"en":"Workers ladled hot metal into the mold.","zh":"工人把熔融金属用勺斗舀入模具中。"}]}],"synonyms":["scoop","dipper","serve"],"phonetic":"/ˈleɪdəlz/","extraExplanation":["“ladles”可以是名词复数（two ladles 两把汤勺），也可以是动词第三人称单数（He ladles the soup. 他舀汤）。","在工业语境中，ladle 也常指“钢包/浇包”（大型容器或勺斗），用于盛装与浇注熔融金属。"]}
{"word":"ladlewood","summary":{"en":"Ladlewood is an uncommon word that can mean wood used to carve ladles/spoons, or a regional name for a plant (often mountain laurel) whose wood was used that way.","zh":"Ladlewood 是个不常见的词，可指用来雕刻汤勺/木勺的木材，也可作某些地区对一种植物（常指山月桂）的俗称，因为它的木材曾用于做勺具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialectal) Wood traditionally used for making ladles or spoons; by extension, a plant or shrub whose tough wood was used for that purpose.","zh":"（方言）传统上用来制作长柄勺、汤勺或木勺的木材；也可引申指因木质坚韧、适合做勺具而得名的某种灌木/植物。"},"examples":[{"en":"In older rural communities, people sometimes carved simple kitchen tools from ladlewood.","zh":"在较早的乡村社区里，人们有时会用“ladlewood”来雕刻简单的厨房用具。"},{"en":"The handle was made from a piece of ladlewood because it was hard and durable.","zh":"这个手柄用一段“ladlewood”制成，因为它坚硬耐用。"}]},{"partOfSpeech":"n.","definition":{"en":"A regional common name for a shrub/tree (often referring to mountain laurel, Kalmia latifolia) known for dense wood once used to carve spoons and ladles.","zh":"某些地区对一种灌木/树的俗称（常指北美月桂/山月桂，Kalmia latifolia），其木质致密，过去常被用来雕刻木勺、汤勺。"},"examples":[{"en":"Mountain laurel is sometimes called ladlewood in local speech.","zh":"在一些地方口语中，山月桂有时被叫作“ladlewood”。"},{"en":"They warned us not to burn ladlewood indoors because some parts of the plant can be toxic.","zh":"他们提醒我们不要在室内烧“ladlewood”，因为这种植物的某些部位可能有毒。"}]}],"synonyms":["spoonwood","mountain laurel","laurel"],"phonetic":"/ˈlædəlˌwʊd/","extraExplanation":["“ladlewood”并不是现代英语里的常用词，更常见的说法是“spoonwood”（勺木）或直接用植物学/常用名（如 mountain laurel）。不同地区对“ladlewood”具体指哪一种植物可能不完全一致，读到时可以结合上下文（是在说木材、木制品，还是在说植物）。","如果你是在地名、人名或品牌名里看到 Ladlewood，它也可能是专有名词（首字母大写），含义未必与“勺子/木材”直接相关。"]}
{"word":"ladling","summary":{"en":"“Ladling” means serving or pouring liquid food with a ladle, or the act of doing so.","zh":"“Ladling”指用汤勺分盛或倒出液体食物，或指这种舀取分盛的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of serving or pouring liquid food with a ladle","zh":"用长柄勺（汤勺）舀取并分盛（液体食物）的动作"},"examples":[{"en":"The ladling of soup went quickly once everyone lined up.","zh":"大家排好队后，分汤的过程进行得很快。"},{"en":"She watched the careful ladling of sauce onto each plate.","zh":"她看着他小心地把酱汁舀到每个盘子里。"}]},{"partOfSpeech":"v.","definition":{"en":"serving or pouring (liquid) with a ladle; scooping and pouring out","zh":"用汤勺舀起并倒出（液体）的；用勺分盛的"},"examples":[{"en":"He was ladling broth into bowls for the guests.","zh":"他在给客人把高汤舀进碗里。"},{"en":"A worker stood by the pot, ladling stew all afternoon.","zh":"一个工作人员站在锅旁，整个下午都在舀炖菜。"}]}],"synonyms":["scooping","serving","pouring (out)","dishing out"],"phonetic":"/ˈleɪd(ə)lɪŋ/","extraExplanation":["“ladling”来自名词“ladle”（长柄勺/汤勺）。在口语里，常说“ladle out (soup)”表示“舀出来分给别人”。","在比喻用法中，英语里有时会说“ladle out praise/criticism”，意思是“（大量地）给出表扬/批评”，强调像舀汤一样一勺一勺地“往外给”。"]}
{"word":"ladner","summary":{"en":"“Ladner” is most often a place name in Delta, British Columbia, Canada, and it can also be a surname.","zh":"“Ladner”最常见是加拿大不列颠哥伦比亚省Delta市的地名，也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a neighborhood in Delta, British Columbia, Canada (part of Metro Vancouver)","zh":"加拿大不列颠哥伦比亚省（三角洲市 Delta）内的一个社区（属大温哥华地区）"},"examples":[{"en":"I grew up in Ladner, south of Vancouver.","zh":"我在拉德纳长大，它在温哥华以南。"},{"en":"The farmer’s market in Ladner is popular on weekends.","zh":"拉德纳的农夫市场在周末很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（人名）"},"examples":[{"en":"Ms. Ladner will lead the meeting today.","zh":"拉德纳女士今天将主持会议。"},{"en":"The book was written by Ladner.","zh":"这本书由拉德纳所著。"}]}],"synonyms":["(place)","(surname)"],"phonetic":"/ˈlædnər/","extraExplanation":["“Ladner”在日常英语中最常见的是地名（加拿大BC省Delta市的一个社区），也常见作姓氏。","发音通常重音在第一个音节：LAD-ner。"]}
{"word":"ladron","summary":{"en":"“ladron” (Spanish: ladrón) means “thief/robber.”","zh":"“ladron”（西语：ladrón）意思是“小偷/强盗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a thief; a robber.","zh":"（西班牙语）小偷；强盗。"},"examples":[{"en":"In Spanish, “ladrón” means “thief.”","zh":"在西班牙语里，“ladrón”的意思是“thief（小偷）”。"},{"en":"The police caught the ladrón who stole the wallet.","zh":"警察抓到了偷钱包的那个小偷。"}]}],"synonyms":["thief","robber","crook","burglar"],"phonetic":"/ləˈdroʊn/","extraExplanation":["“ladrón”在西班牙语里常写作带重音符号的 **ladrón**（ó）。这个重音符号表示重读在最后一个音节：la-**DRÓN**。在英语语境中有时会省略重音写成“ladron”。","英语里也有借用表达，如 **ladronism**（指偷窃/盗窃行为，较少见、偏正式）。"]}
{"word":"ladrone","summary":{"en":"A “ladrone” is a robber or thief, especially in old-fashioned or literary contexts.","zh":"“ladrone”指强盗或小偷，尤其常见于较旧或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a robber or thief; a bandit (often used in older or literary writing).","zh":"强盗；小偷；土匪（多见于较旧或文学性用法）。"},"examples":[{"en":"Travelers feared meeting ladrones on the mountain road.","zh":"旅人害怕在山路上遇到强盗。"},{"en":"In the novel, the hero is captured by a gang of ladrones.","zh":"在小说里，主人公被一伙土匪抓住了。"},{"en":"The newspaper used the old-fashioned word “ladrone” to mean “thief.”","zh":"报纸用较旧的词“ladrone”来表示“小偷”。"}]}],"synonyms":["thief","robber","bandit","brigand"],"phonetic":"/ləˈdroʊn/","extraExplanation":["“ladrone”来自意大利语 ladro（意为“贼”）。在英语里它带有一点“旧式/书面/文学”的感觉，常用来描写旅行记、历史故事里在乡间或山路上抢劫的“匪徒/山贼”。日常英语里更常说 thief（小偷）、robber（抢劫犯）、bandit（土匪/强盗）。"]}
{"word":"ladrones","summary":{"en":"“Ladrones” is Spanish for “thieves” (plural).","zh":"“ladrones”是西班牙语，意思是“盗贼/小偷们”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Spanish plural noun meaning “thieves” (plural of ladrón). In English, it may appear in Spanish names, titles, or quoted speech.","zh":"西班牙语复数名词，意思是“盗贼／小偷”（ladrón 的复数）。在英语中常见于西语地名、人名、书影音标题或引用的西语表达中。"},"examples":[{"en":"The sign said “Cuidado con los ladrones” (Beware of thieves).","zh":"牌子上写着 “Cuidado con los ladrones”（小心小偷）。"},{"en":"In the film, the police chase the ladrones through the market.","zh":"电影里，警察在市场里追捕那些“ladrones”（盗贼们）。"}]}],"synonyms":["thieves","robbers","bandits"],"phonetic":"/lɑˈdɹoʊneɪz/","extraExplanation":["“Ladrones”是西班牙语名词复数：单数是“ladrón”（小偷/盗贼），复数加 -es 变成“ladrones”。","西班牙语里的重音在“dro”音节附近；英语语境中常见的是借用/引用用法，发音会因英语母语者而有明显英文化。","在英语写作中，如果不是刻意保留西语风格，一般直接用英文“thieves”更自然。"]}
{"word":"ladronism","summary":{"en":"Ladronism means stealing or the practice of thievery.","zh":"ladronism 指“盗窃、偷窃行为（或风气）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of stealing; thievery","zh":"偷窃行为；盗窃习惯；盗贼行径"},"examples":[{"en":"The report described a pattern of ladronism in the local market.","zh":"报告描述了当地市场里一种持续发生的盗窃现象。"},{"en":"He was dismissed for ladronism after money went missing from the register.","zh":"收银机里的钱不见后，他因盗窃被解雇。"}]}],"synonyms":["theft","thievery","larceny","pilfering","stealing"],"phonetic":"/ˈlædrəˌnɪzəm/","extraExplanation":["“ladronism”是较少见的英语词，来源于西班牙语 *ladrón*（“小偷/盗贼”），因此带有“盗贼行为、偷窃风气”的意味。正式写作里更常用 *theft*、*larceny* 或 *thievery*。"]}
{"word":"ladronize","summary":{"en":"“Ladronize” is a rare verb meaning “to steal” or “to behave like a thief.”","zh":"“ladronize”是个很少见的动词，意思是“偷窃”或“像小偷一样行事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To steal; to act like a thief.","zh":"（罕见）偷窃；像小偷一样行事。"},"examples":[{"en":"Someone has been ladronizing in the office—my phone charger is gone.","zh":"办公室里有人在偷东西——我的手机充电器不见了。"},{"en":"The author uses “ladronize” to paint the character as a petty thief.","zh":"作者用“ladronize”来描写这个角色是个小偷小摸的人。"}]}],"synonyms":["steal","pilfer","thieve","shoplift","embezzle"],"phonetic":"/ləˈdrɑːn.aɪz/","extraExplanation":["“ladronize”非常少见，多为文学/修辞或临时造词（nonce word），日常英语更常用：steal（偷）、pilfer（小偷小摸）、shoplift（商店行窃）、embezzle（侵吞公款）。","词根来自西班牙语“ladrón”（小偷），加上英语动词后缀“-ize”（使成为/做……），字面意思就是“做小偷/进行偷窃”。"]}
{"word":"ladrons","summary":{"en":"**Ladrons** means “thieves/robbers” (plural), and it can also appear as a Southwestern U.S. place name from Spanish.","zh":"**ladrons** 指“盗贼/小偷”（复数），也可作为源自西班牙语的美国西南部地名用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"thieves or robbers (plural of **ladron**; often used to give a Spanish or Southwestern U.S. flavor).","zh":"小偷；盗贼（**ladron** 的复数；常用于带有西班牙语/美国西南部语感的语境）。"},"examples":[{"en":"The travelers were warned about **ladrons** along the remote road.","zh":"旅人被提醒，那条偏僻道路上可能有**盗贼**出没。"},{"en":"In old stories, the hero outsmarts the **ladrons** and escapes.","zh":"在一些旧故事里，英雄智胜**盗贼**并成功脱身。"}]},{"partOfSpeech":"n.","definition":{"en":"a plural place name in the U.S. Southwest (e.g., mountains or regions called “Ladrons”), based on the Spanish word for “thieves.”","zh":"（美国西南部的）复数地名用法，如名为 “Ladrons” 的山脉或地区；源自西班牙语“盗贼”之意。"},"examples":[{"en":"They hiked near the **Ladrons** before heading back to town.","zh":"他们在**拉德龙山一带**徒步后返回城里。"},{"en":"The map marks a rugged ridge labeled **Ladrons**.","zh":"地图上标着一条崎岖的山脊，名称是 **Ladrons**。"}]}],"synonyms":["thieves","robbers","bandits","muggers"],"phonetic":"/ləˈdroʊnz/","extraExplanation":["“Ladron(s)”来自西班牙语 **ladrón**（小偷、盗贼）。在英语里不算高频日常词，更常见于带有西语背景的叙述、历史/冒险故事，或美国西南部的地名（如山名）。","拼写上英语常写作 **ladron / ladrons**（不一定保留西班牙语重音符号 ó）。"]}
{"word":"lads","summary":{"en":"“Lads” means boys or young men, often a friendly, casual way to refer to a group of male friends (especially in UK/Irish English).","zh":"“lads”指男孩或年轻男性，常作对一群男性朋友的随口、友好称呼（英式/爱尔兰英语更常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A casual word for boys or young men, often used in the plural to mean a group of male friends.","zh":"（口语）男孩；小伙子们（常用复数，指一群男性朋友）。"},"examples":[{"en":"The lads are meeting at the park after school.","zh":"小伙子们放学后在公园见。"},{"en":"Come on, lads—let’s get going.","zh":"走吧，小伙子们——我们出发。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK/Irish English) A casual way to refer to male coworkers, teammates, or men in a group; sometimes used as a friendly form of address.","zh":"（英式/爱尔兰英语）对一群男人、同事或队友的随口称呼；也可作友好的招呼用语。"},"examples":[{"en":"The lads at work helped me move the boxes.","zh":"公司里的那帮哥们帮我搬了箱子。"},{"en":"Good luck today, lads!","zh":"今天好运，兄弟们！"}]}],"synonyms":["boys","young men","guys","fellows"],"phonetic":"/lædz/","extraExplanation":["“lad(s)”语气比较随意、口语化，在英式英语里很常见；在美式英语里也能听到，但更常说“guys”。\n\n注意语境：在某些场合（比如“the lads’ night out”）可能带有“兄弟局/一群男生出去玩”的文化暗示；但在正式写作或正式场合，用“boys/young men/men/guys”会更稳妥。\n\n相关搭配：one of the lads（自己人/兄弟之一），lads and lasses（男孩和女孩；较传统/英式）。"]}
{"word":"lady","summary":{"en":"“Lady” most commonly means a polite/formal word for a woman; it can also be a British title for a noblewoman, and “lady” can describe refined, polite behavior.","zh":"“lady”最常见表示对“女性/女士”的礼貌称呼；也可指英国贵族头衔“夫人/女士”，还可作形容词表示举止文雅、有礼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman (often used as a polite or formal word for “woman”)","zh":"女士；女性（常作礼貌或较正式的说法）"},"examples":[{"en":"There’s a lady at the front desk who can help you.","zh":"前台有一位女士可以帮你。"},{"en":"An elderly lady offered me her seat on the bus.","zh":"一位年长的女士在公交车上把座位让给了我。"}]},{"partOfSpeech":"n.","definition":{"en":"a woman of high social rank in traditional British society (the female form of “lord,” used as a title)","zh":"（传统英国社会中）贵族夫人；（Lady + 姓/名的头衔）"},"examples":[{"en":"Lady Catherine appears in Jane Austen’s novels as a powerful aristocrat.","zh":"“凯瑟琳夫人（Lady Catherine）”在简·奥斯汀的小说中以强势贵族形象出现。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing polite, refined behavior; well-mannered (sometimes old-fashioned)","zh":"（举止）文雅的；有礼貌的（有时略显老派）"},"examples":[{"en":"He gave her a very ladylike bow.","zh":"他以非常“绅士/淑女式”的方式向她鞠躬。"}]}],"synonyms":["woman","miss","madam","gentlewoman"],"phonetic":"/ˈleɪdi/","extraExplanation":["在现代英语里，把成年女性称为 “lady” 通常是出于礼貌（如 “ladies and gentlemen”）。但在某些语境中，用 “lady” 直接指代某个女性（例如 “that lady”）可能听起来有点疏离、居高临下或带情绪，是否合适取决于语气和场合。更中性、直接的说法通常是 “woman”。","“Lady + 姓/名” 作为头衔主要见于英国贵族体系或文学作品中；在日常生活中不常用。"]}
{"word":"lady-killer","summary":{"en":"A “lady-killer” is usually a charming man who is very attractive to women; rarely, it can mean someone who literally kills women.","zh":"“lady-killer”通常指很有魅力、很受女性欢迎的男人；少数情况下也可指字面上的“杀害女性的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who is very charming and attractive to women, often someone who dates many women (sometimes with a slightly critical tone).","zh":"（常指）很有魅力、很受女性欢迎的男人；风流人物（有时带一点贬义或调侃）"},"examples":[{"en":"He’s a real lady-killer—everyone notices him when he walks into a room.","zh":"他真是个“女性杀手”——一走进房间大家都会注意到他。"},{"en":"She warned her friend not to fall for that lady-killer too quickly.","zh":"她提醒朋友别太快迷上那个“风流男”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, literal) A person who kills women.","zh":"（较少见，字面义）杀害女性的人"},"examples":[{"en":"In the crime report, “lady-killer” was used in its literal sense.","zh":"在那份犯罪报道中，“lady-killer”用的是字面意思。"}]}],"synonyms":["heartbreaker","womanizer","Casanova","Don Juan","charmer"],"phonetic":"/ˈleɪdi ˌkɪlər/","extraExplanation":["“lady-killer”是口语、带比喻色彩的说法，常用来形容“很会撩、很受女性欢迎的男人”。语气可能是夸赞、开玩笑，也可能含有“花心、爱拈花惹草”的轻微批评，要看语境。","拼写上常见带连字符 lady-killer，也有人写作 lady killer。正式写作里不太常用。","由于字面上也可能被理解为“杀害女性的人”，在严肃或可能引起误解的场合（如新闻、安全话题）建议避免使用或改用更明确的表达，如 “womanizer”（玩弄女性者，偏贬）或 “very popular with women”（很受女性欢迎，中性）。"]}
{"word":"ladybird","summary":{"en":"A ladybird is a small spotted beetle (ladybug) that often helps gardens by eating pests.","zh":"ladybird 指瓢虫（即 ladybug），常吃害虫，对花园有益。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, round beetle (often red or orange with black spots) that is helpful because it eats plant pests like aphids.","zh":"瓢虫（常为红色或橙色、带黑点的小甲虫），对植物有益，因为会吃蚜虫等害虫。"},"examples":[{"en":"There’s a ladybird on the leaf.","zh":"叶子上有一只瓢虫。"},{"en":"Gardeners like ladybirds because they eat aphids.","zh":"园丁喜欢瓢虫，因为它们会吃蚜虫。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK English) A child-friendly name for a ladybug.","zh":"（英式英语）“ladybug”的儿童用说法。"},"examples":[{"en":"My little sister calls it a ladybird, not a ladybug.","zh":"我妹妹叫它“ladybird”，不叫“ladybug”。"}]}],"synonyms":["ladybug","lady beetle"],"phonetic":"/ˈleɪdiˌbɝːd/","extraExplanation":["“ladybird”和“ladybug”指的是同一种昆虫：美式英语更常说 ladybug，英式英语更常说 ladybird。","名字里的“lady”常被认为和基督教里的“圣母玛利亚（Our Lady）”有关；这种昆虫在欧洲民间被视为吉祥、能保护农作物。","常见相关表达：ladybird/ladybug book（瓢虫图案的小童书或卡片书）、ladybird spot(s)（瓢虫的斑点）。"]}
{"word":"ladybirds","summary":{"en":"“Ladybirds” are ladybugs/lady beetles—small spotted beetles that help gardens by eating pests.","zh":"“Ladybirds”指瓢虫（美式多说 ladybugs / lady beetles），是会吃害虫、对花园有益的小甲虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, round beetles (often red or orange with black spots) that are helpful in gardens because they eat aphids and other plant pests; plural of “ladybird.”","zh":"瓢虫（常见为红/橙色带黑点的小甲虫），对花园有益，因为会吃蚜虫等害虫；“ladybird”的复数。"},"examples":[{"en":"Ladybirds can protect roses by eating aphids.","zh":"瓢虫会吃蚜虫，能保护玫瑰。"},{"en":"We saw ladybirds on the leaves after the rain.","zh":"雨后我们在叶子上看到了瓢虫。"},{"en":"Some people call them ladybugs, especially in the U.S.","zh":"在美国，人们尤其常把它们叫作 ladybugs（瓢虫）。"}]}],"synonyms":["ladybugs","lady beetles","ladybird beetles"],"phonetic":"/ˈleɪdiˌbɝdz/","extraExplanation":["“ladybird”主要是英式英语；美式英语更常说“ladybug”。科学上也常用更中性的说法“lady beetle”。","名字里的“lady”传统上与“圣母玛利亚（Our Lady）”有关：在中世纪欧洲，人们把这种益虫视为带来好运、保护农作物的象征，因此得名。"]}
{"word":"ladybug","summary":{"en":"A ladybug is a small spotted beetle, often red, that is helpful in gardens because it eats pests.","zh":"ladybug 指瓢虫，一种常见带斑点的小甲虫，常被视为益虫，因为会吃害虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, usually round beetle with a red or orange shell and black spots; often considered helpful because it eats garden pests like aphids.","zh":"瓢虫（甲虫的一种），通常圆圆的，红色或橙色外壳带黑点；常被认为是益虫，因为会吃蚜虫等害虫。"},"examples":[{"en":"A ladybug landed on my sleeve while I was watering the plants.","zh":"我给植物浇水时，一只瓢虫落在了我的袖子上。"},{"en":"Gardeners like ladybugs because they help control aphids naturally.","zh":"园丁喜欢瓢虫，因为它们能天然地控制蚜虫。"}]}],"synonyms":["ladybird","lady beetle","ladybird beetle"],"phonetic":"/ˈleɪdiˌbʌɡ/","extraExplanation":["在英式英语中更常说 ladybird；美式英语更常用 ladybug。两者指同一种昆虫。","在一些文化里，瓢虫被视为“幸运”的象征，所以也常出现在童谣、儿歌和儿童故事中。"]}
{"word":"ladybugs","summary":{"en":"Ladybugs are small beetles, often red with black spots, known for eating garden pests like aphids.","zh":"Ladybugs 指瓢虫，常见为红色带黑点的小甲虫，以吃蚜虫等园艺害虫而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, round beetles (often red with black spots) that many gardeners like because they eat plant pests such as aphids.","zh":"瓢虫（常见为红色带黑点的小甲虫），园艺中很受欢迎，因为它们会吃蚜虫等害虫。"},"examples":[{"en":"Ladybugs help protect our roses by eating aphids.","zh":"瓢虫会吃蚜虫，帮助保护我们的玫瑰。"},{"en":"We found a ladybug on the window and gently let it outside.","zh":"我们在窗户上发现一只瓢虫，轻轻把它放到室外。"}]}],"synonyms":["ladybird","lady beetle"],"phonetic":"/ˈleɪdiˌbʌɡz/","extraExplanation":["“ladybug”在美式英语里很常见；英式英语也常说“ladybird”。两者指的都是同一种昆虫。","虽然日常会叫“bug（虫子）”，但瓢虫其实是甲虫（beetle）的一种。","“lady”来自基督教传统里对圣母玛利亚（Our Lady）的称呼，所以这个名字带有历史文化色彩。"]}
{"word":"ladyclock","summary":{"en":"“ladyclock” usually means a women’s clock/watch, and it may also be used as a brand or model name.","zh":"“ladyclock”通常指女士钟/女士手表；也可能是某个品牌或型号名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a clock (or watch) designed or marketed for women; a “ladies’ clock.”","zh":"为女性设计或面向女性销售的钟（或手表）；“女士钟/女表”。"},"examples":[{"en":"She bought a small ladyclock to match her jewelry.","zh":"她买了一只小巧的女士钟来搭配她的首饰。"},{"en":"The catalog lists a ladyclock with a thinner strap and a smaller face.","zh":"目录里列出一款女士表：表带更细、表盘更小。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a product or brand name used for certain women’s clocks/watches.","zh":"（常大写）某些女士钟/女士表所用的产品名或品牌名。"},"examples":[{"en":"The box says “Ladyclock,” so it may be the model name.","zh":"盒子上写着“Ladyclock”，所以它可能是型号名。"},{"en":"Try searching the maker’s website for Ladyclock parts.","zh":"可以到制造商网站上搜索 Ladyclock 的配件。"}]}],"synonyms":["ladies' clock","women's watch","ladies' watch","dress watch (for women)"],"phonetic":"/ˈleɪdiˌklɑk/","extraExplanation":["“ladyclock”不是现代英语里非常常见的通用词，更常见的表达是 ladies’ clock（女士钟）或 women’s watch（女表）。如果你是在说明书、旧广告或商品盒上看到的，它很可能是一个型号/商标，因此可能需要首字母大写：Ladyclock。","在日常表达中，英语里更自然的说法通常是：a ladies’ watch / a women’s watch（女士手表），a ladies’ clock（女士钟）。"]}
{"word":"ladydom","summary":{"en":"“Ladydom” is slang for female (lady) domination, often used in BDSM/role-play or adult-content contexts.","zh":"“ladydom”是“女性主导/女王主导”的俚语，常见于 BDSM/角色扮演或成人内容语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slang term for “lady domination”: a BDSM or role-play context in which a woman takes the dominant role over a partner (also written as LadyDom).","zh":"俚语，指“女性主导/女王主导”：在 BDSM 或角色扮演语境中，由女性担任支配（主导）角色（也常写作 LadyDom）。"},"examples":[{"en":"Some forums have sections for LadyDom, femdom, and other relationship dynamics.","zh":"一些论坛会把 LadyDom、femdom 等关系/互动模式分区讨论。"},{"en":"They said they were interested in LadyDom role-play and wanted to discuss boundaries first.","zh":"他们说对 LadyDom 角色扮演感兴趣，并想先讨论界限。"}]},{"partOfSpeech":"adj.","definition":{"en":"of or relating to lady domination or female-dominant dynamics.","zh":"（作定语）与女性主导/女王主导相关的；女性主导风格的。"},"examples":[{"en":"He writes LadyDom stories for adult audiences.","zh":"他为成人读者写 LadyDom 题材的故事。"},{"en":"She’s looking for LadyDom communities that focus on consent and communication.","zh":"她在寻找强调同意与沟通的 LadyDom 社群。"}]}],"synonyms":["femdom","female domination","female-led relationship (FLR)"],"phonetic":"/ˈleɪdiˌdɑm/","extraExplanation":["“ladydom”多见于网络社群与成人视频/成人文学标签中，属于非正式用语；更常见、也更通用的说法是“femdom（female domination）”。","涉及 BDSM/权力交换话题时，英语语境里常强调“consent（自愿同意）”“boundaries（界限）”“safe word（安全词）”等沟通原则；在不熟悉语境时，使用更中性、尊重的表达会更合适。"]}
{"word":"ladyfern","summary":{"en":"Ladyfern is a delicate-looking fern commonly found in damp, shady areas and used in gardens.","zh":"Ladyfern 指一种叶片纤细羽状的蕨类植物，常见于阴湿环境，也常用于园艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fern (a non-flowering plant) with delicate, feathery leaves; often found in moist, shady places and grown as a garden plant","zh":"（一种）蕨类植物；叶片细致、羽状，常生长在阴湿处，也常作为园艺观赏植物栽培"},"examples":[{"en":"Ladyfern grows well in shady gardens with moist soil.","zh":"荚果蕨（ladyfern）在土壤湿润的阴凉花园里长得很好。"},{"en":"We saw ladyfern along the forest stream.","zh":"我们在森林的小溪边看到了荚果蕨。"}]}],"synonyms":["lady fern","Athyrium filix-femina","fern"],"phonetic":"/ˈleɪdiˌfɝn/","extraExplanation":["“Ladyfern”通常指学名 *Athyrium filix-femina* 的一种常见蕨类。名字里的“lady-”带有“纤细、柔美”的联想，用来形容它的叶片外观，并不涉及性别。","英语里很多植物名是合成词（lady + fern）。在自然写作或园艺语境中常见；在更正式的科普或学术语境里也会直接用拉丁学名。"]}
{"word":"ladyfinger","summary":{"en":"Ladyfinger most commonly means a finger-shaped sponge cookie used in desserts; in some English varieties it can also mean okra.","zh":"Ladyfinger 最常指用于甜点的手指饼干；在一些英语变体中也可指秋葵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light, sweet, finger-shaped sponge cookie (often used in desserts like tiramisu and charlottes); also called a sponge finger","zh":"手指饼干；一种轻甜、手指形的海绵蛋糕饼干（常用于提拉米苏等甜点），也叫海绵手指饼"},"examples":[{"en":"This tiramisu is made with ladyfingers soaked in coffee.","zh":"这份提拉米苏用浸过咖啡的手指饼干制作。"},{"en":"Line the bowl with ladyfingers before adding the cream.","zh":"先用手指饼干把碗壁铺好，再加入奶油馅。"},{"en":"I bought a pack of ladyfingers for the dessert.","zh":"我买了一包手指饼干来做甜点。"}]},{"partOfSpeech":"n.","definition":{"en":"okra (the green, ridged vegetable), especially in Indian English and some other varieties of English; often plural: ladyfingers","zh":"秋葵（绿色、有棱的蔬菜）；在印度英语等用法中常称为 ladyfinger(s)，多用复数"},"examples":[{"en":"She cooked ladyfingers with onions and spices.","zh":"她把秋葵和洋葱、香料一起炒了。"},{"en":"Add sliced ladyfingers to the curry.","zh":"把切片的秋葵加入咖喱里。"}]}],"synonyms":["sponge finger","savoiardi","okra (for the vegetable sense)"],"phonetic":"/ˈleɪdiˌfɪŋɡɚ/","extraExplanation":["“ladyfinger(s)”在美式英语里最常见的意思是甜点用的手指饼干；而在印度英语等语境中更常指“秋葵”。在餐馆菜单或食谱里看到时，可以根据上下文（甜点/咖喱蔬菜）判断。","复数形式常见：dessert 语境里也会说 “ladyfingers”；蔬菜义项几乎总是用复数（ladyfingers）。"]}
{"word":"ladyfingers","summary":{"en":"“Ladyfingers” most commonly means finger-shaped sponge cookies used in desserts; it can also mean okra in some regional usage.","zh":"「ladyfingers」最常指做甜點用的手指餅乾／手指形海綿蛋糕；在某些地區也可指秋葵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small, light sponge cookies (or pieces of sponge cake) shaped like fingers, often used in desserts such as tiramisu or trifles","zh":"手指餅乾；（手指形的）海綿蛋糕，常用於提拉米蘇、英式水果布丁等甜點"},"examples":[{"en":"This tiramisu recipe calls for ladyfingers soaked in coffee.","zh":"這個提拉米蘇食譜需要把手指餅乾泡在咖啡裡。"},{"en":"She layered ladyfingers, fruit, and cream to make a trifle.","zh":"她把手指餅乾、水果和奶油分層做成英式水果布丁。"}]},{"partOfSpeech":"n.","definition":{"en":"okra (a green vegetable with long seed pods), especially in some varieties or regional usage","zh":"秋葵（某些品種或地區也稱為 ladyfingers）"},"examples":[{"en":"In some places, people call okra “ladyfingers.”","zh":"在某些地方，人們把秋葵叫作「ladyfingers」。"},{"en":"He added sliced ladyfingers to the stew to thicken it slightly.","zh":"他把切片的秋葵加進燉菜裡，讓湯汁稍微變稠。"}]}],"synonyms":["savoiardi","sponge fingers","okra"],"phonetic":"/ˈleɪdiˌfɪŋɡɚz/","extraExplanation":["在甜點語境中，ladyfingers 常指義大利語 savoiardi（乾爽的手指餅乾）；在英語國家購買時也可能看到包裝寫作 “ladyfingers” 或 “savoiardi”。","在食物以外的語境很少用這個詞；日常對話中更常直接說 okra（秋葵）。"]}
{"word":"ladyfish","summary":{"en":"A ladyfish is a slender, silvery coastal saltwater fish, popular in sport fishing but very bony to eat.","zh":"ladyfish 指一种细长银色的近海海鱼，常用于运动钓鱼，但小刺多、食用价值相对一般。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, silvery, fast-swimming saltwater fish found in warm coastal waters, often caught for sport but not usually considered a top eating fish because it has many small bones.","zh":"一种生活在温暖近海海域的细长银色海鱼，游速快，常用于运动钓鱼；因小刺多，通常不算上等食用鱼。"},"examples":[{"en":"We caught a ladyfish off the pier, but we released it because it’s bony.","zh":"我们在码头边钓到一条ladyfish，但因为刺多就放生了。"},{"en":"Ladyfish are common in Florida’s coastal waters in summer.","zh":"夏天在佛罗里达近海水域常见ladyfish。"}]}],"synonyms":["skipjack (regional)","tenpounder (regional)"],"phonetic":"/ˈleɪdiˌfɪʃ/","extraExplanation":["“Ladyfish”是常见俗名，不同地区可能还会把它叫作“skipjack”（注意：这也可能指其他鱼类或金枪鱼的一种俗称，需结合语境）。","常见学名属类包括Elops（如大西洋ladyfish常见为Elops saurus）。在钓鱼语境里，它常被当作“baitfish”（饵鱼）或练手的对象鱼。"]}
{"word":"ladyfishes","summary":{"en":"“Ladyfishes” means more than one ladyfish, a slender silver coastal fish common in warm waters.","zh":"“Ladyfishes”表示不止一条 ladyfish（女鱼/海岸银色细长鱼类），多见于温暖海域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ladyfish: a type of long, silver, fast-swimming coastal fish found in warm seas, often used as bait and sometimes eaten (though it has many small bones).","zh":"ladyfish 的复数：一种细长、银色、游得很快的暖海近岸鱼类，常被用作饵鱼，有时也会被食用（但小刺较多）。"},"examples":[{"en":"Ladyfishes often school near the shore in warm coastal waters.","zh":"Ladyfish 常在温暖的近岸海域成群活动。"},{"en":"The anglers used ladyfishes as bait for bigger fish.","zh":"钓鱼的人用 ladyfish（复数 ladyfishes）作饵来钓更大的鱼。"}]}],"synonyms":["ladyfish (plural sometimes used the same)","baitfish (general category)","silver fish (informal/general)"],"phonetic":"/ˈleɪdiˌfɪʃɪz/","extraExplanation":["“ladyfishes”是名词复数，更常见的单数形式是“ladyfish”。在日常写作里，人们也可能把单复数都写成“ladyfish”，但“ladyfishes”在语法上完全正确。","这种鱼在不同地区可能指不同的近似种类；在美国常指大西洋/墨西哥湾一带的 ladyfish（如 Elops saurus），中文里有时也会被归到“海鲢/似海鲢类”的说法里。"]}
{"word":"ladyflies","summary":{"en":"“Ladyflies” is a rare word most often meaning “ladybugs,” though it can also jokingly mean “female flies.”","zh":"“Ladyflies”是较罕见的说法，通常指“瓢虫”（更常用 ladybug/ladybird），也可能是玩笑式地指“母苍蝇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) Ladybugs; small round beetles with bright colors (often red with black spots) that help by eating plant pests like aphids.","zh":"（罕用）瓢虫；一种圆形、颜色鲜艳（常见红底黑点）的甲虫，常吃蚜虫等害虫，对植物有益。"},"examples":[{"en":"Ladyflies are helpful in gardens because they eat aphids.","zh":"瓢虫对花园很有帮助，因为它们会吃蚜虫。"},{"en":"We found several ladyflies on the roses after the rain.","zh":"雨后我们在玫瑰上发现了几只瓢虫。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, uncommon) Female flies (used jokingly or playfully).","zh":"（非正式，不常见）母苍蝇（多为开玩笑或俏皮的说法）。"},"examples":[{"en":"He joked that the ladyflies were the ones buzzing around the fruit bowl.","zh":"他开玩笑说，围着果盘嗡嗡转的是“母苍蝇”。"}]}],"synonyms":["ladybugs","ladybirds","lady beetles"],"phonetic":"/ˈleɪdiˌflaɪz/","extraExplanation":["“ladyflies”并不是非常常见或标准的日常用词。英语里更常说 ladybugs（美式）或 ladybirds（英式）来指“瓢虫”。如果你是在儿歌、童话、或某个作品里看到 ladyflies，通常是在用更童趣的说法来指瓢虫，或者是在拟人化（把昆虫称作“lady-”）。"]}
{"word":"ladyfly","summary":{"en":"“Ladyfly” is not a standard English word; you probably mean “ladybug/ladybird.”","zh":"“ladyfly”不是标准英语词；你很可能想说“ladybug/ladybird（瓢虫）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare/Nonstandard) A word that is not commonly used in modern English; people usually mean “ladybug/ladybird” (a small red beetle with black spots) or they may be confusing it with another insect name.","zh":"（罕见/非标准）现代英语中几乎不用的词；人们通常想说的是“ladybug/ladybird”（瓢虫，红色带黑点的小甲虫），或把它和其他昆虫名称混淆了。"},"examples":[{"en":"I couldn’t find “ladyfly” in most dictionaries—did you mean “ladybug”?","zh":"我在大多数词典里找不到“ladyfly”——你是不是想说“ladybug（瓢虫）”？"},{"en":"A ladybug is a beetle, not a fly.","zh":"瓢虫是甲虫，不是苍蝇。"}]}],"synonyms":["ladybug","ladybird"],"phonetic":"ˈleɪdiˌflaɪ","extraExplanation":["“Ladybug”（美式常用）/“ladybird”（英式常用）是正确且最常见的说法；因为它会飞，有些学习者会误写成“ladyfly”，但英语里并不这样构词。","如果你要表达“蜻蜓”，应说“dragonfly”；表达“萤火虫”，常说“firefly”。这些才是常见的“X + fly”昆虫词。"]}
{"word":"ladyfy","summary":{"en":"Ladyfy means to make someone seem like a “lady,” often by teaching or forcing refined manners; it’s rare and can sound ironic.","zh":"ladyfy 指把某人塑造成“淑女”（让举止更文雅），用法很少见，常带一点讽刺意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone (especially a woman) into a “lady,” or to treat/present someone in a way thought suitable for a lady; to refine or “gentrify” manners","zh":"把某人（尤指女性）塑造成“淑女”；以被认为符合淑女身份的方式对待或包装；使举止更文雅"},"examples":[{"en":"The finishing school promised to ladyfy its students through etiquette and posture lessons.","zh":"那所礼仪学校声称会通过礼仪和仪态课程把学生“淑女化”。"},{"en":"The movie shows how society tries to ladyfy the heroine to fit into high society.","zh":"这部电影展示了社会如何试图把女主角“淑女化”，好让她融入上流社会。"}]}],"synonyms":["refine","polish","gentrify","civilize","teach manners"],"phonetic":"/ˈleɪdiˌfaɪ/","extraExplanation":["“ladyfy”非常少见，带有旧式或带讽刺的语气。更常见的表达是：make someone into a lady、teach someone manners、refine someone、gentrify (someone’s) behavior。","词形来自 lady + -fy（表示“使……化/使变成……”的后缀），类似：beautify（美化）、simplify（简化）。","在现代语境中，这个词可能暗含对性别刻板印象或阶层标准的批评：把“像淑女”当作必须遵守的规范。"]}
{"word":"ladyhood","summary":{"en":"Ladyhood means the state of being a lady or the traditional “lady-like” qualities expected of a lady.","zh":"Ladyhood 指“淑女/女士”的身份状态，或传统上被期待的“淑女气质/淑女风范”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of being a lady; the social role, status, or identity associated with a “lady.”","zh":"淑女身份；作为“女士/淑女”的状态或社会角色、地位与身份。"},"examples":[{"en":"In the novel, she is taught that ladyhood requires perfect manners and self-control.","zh":"在小说里，她被教导“淑女身份”意味着完美的礼仪与自制力。"},{"en":"They argued about whether real ladyhood comes from birth or from behavior.","zh":"他们争论真正的“淑女气质”到底来自出身还是来自行为。"}]},{"partOfSpeech":"n.","definition":{"en":"Lady-like qualities such as politeness, modesty, and refined behavior (often used in an old-fashioned or critical way).","zh":"（常带旧式或批评意味的）“淑女气质/淑女风范”，如礼貌、含蓄、举止文雅等特质。"},"examples":[{"en":"He praised her for her calmness, calling it true ladyhood.","zh":"他称赞她的沉着，称那是真正的“淑女风范”。"},{"en":"She rejected the idea that silence is a measure of ladyhood.","zh":"她拒绝“沉默等于淑女气质”的观念。"}]}],"synonyms":["ladylike behavior","femininity","womanhood (broader)","gentility"],"phonetic":"/ˈleɪdiˌhʊd/","extraExplanation":["“ladyhood”在现代英语中不算常用，常见于文学、历史语境或讨论性别规范（gender norms）的文章里，带一点“传统观念”的色彩。日常表达里更常说“being a lady / ladylike behavior / womanhood”。","与“womanhood（女性身份/成年女性状态）”相比，“ladyhood”更强调社会期待的“体面、文雅、上流/中产阶层礼仪”等形象，因此有时会被用来质疑或讽刺这些标准是否公平。"]}
{"word":"ladyhoods","summary":{"en":"“Ladyhoods” is the plural of “ladyhood,” meaning the state or ideal of being a lady (a rare, old-fashioned word).","zh":"“Ladyhoods”是“ladyhood”的复数，表示“淑女身份/淑女理想与规范”（较少用、偏旧式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, qualities, or social role of being a lady; womanhood in the sense of “ladylike” status (rare/old-fashioned)","zh":"淑女（lady）的身份、特质或社会角色；强调“淑女气质/淑女身份”的女性身份（较少用、偏旧式）"},"examples":[{"en":"In the novel, she is taught music and manners as part of her ladyhood.","zh":"在小说里，她学习音乐和礼仪，被当作培养“淑女身份”的一部分。"},{"en":"She rejected the strict rules of ladyhood expected in her community.","zh":"她拒绝了社区对“淑女身份”所要求的严格规矩。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “ladyhood” (more than one instance or type of ladyhood)","zh":"“ladyhood”的复数形式；指多种/多次出现的“淑女身份（或其规范）”"},"examples":[{"en":"Different cultures have different ideas of ladyhoods and proper behavior.","zh":"不同文化对“淑女身份/规范”与得体行为有不同看法。"}]}],"synonyms":["womanhood","ladylike behavior","being a lady","femininity"],"phonetic":"/ˈleɪdiˌhʊdz/","extraExplanation":["“-hood”是英语常见后缀，表示“……的状态/身份/时期/群体”，如 childhood（童年）、neighborhood（社区）、brotherhood（兄弟情谊/兄弟会）。因此 ladyhood=“作为lady的状态/身份”。这个词在现代英语里不常见，常见替代说法有 womanhood（女性身份/成年女性阶段）、ladylike behavior（淑女式举止）、being a lady（做个淑女/成为淑女）。"]}
{"word":"ladyish","summary":{"en":"“Ladyish” means “ladylike”—polite and refined; it can also mean “a bit affected or overly proper.”","zh":"“ladyish”意为“像淑女的、文雅得体的”；有时也指“过分装淑女、显得做作”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a (well-mannered) lady; polite, refined, and gentle in behavior or appearance.","zh":"像淑女的；举止得体、文雅温和的（多指行为或外表）。"},"examples":[{"en":"She spoke in a ladyish way, even when she was angry.","zh":"即使生气，她说话也很淑女、很有礼貌。"},{"en":"He tried to keep his voice ladyish and calm in front of the guests.","zh":"在客人面前，他努力让自己的声音保持文雅而平静。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes negative) Too concerned with being “ladylike,” in a way that feels affected, old-fashioned, or not natural.","zh":"（有时带贬义）过分讲究“淑女样”，显得做作、老派或不自然。"},"examples":[{"en":"The manners class felt a bit ladyish to her.","zh":"那种礼仪课让她觉得有点“太淑女”、有些做作。"},{"en":"Stop being so ladyish—just tell us what you really think.","zh":"别这么装淑女了——直接说你真正的想法吧。"}]}],"synonyms":["ladylike","refined","polite","proper","dainty","prim"],"phonetic":"/ˈleɪdiɪʃ/","extraExplanation":["“ladyish”是由“lady + -ish”构成，-ish 表示“有点像……、带有……特征”。它不如 “ladylike” 常见，语气更口语化。","使用时要注意语境：它可能是称赞“优雅得体”，也可能暗示“刻意装出来的淑女范儿”。在更正式或更中性的表达中，常用：polite / refined / ladylike。"]}
{"word":"ladyishly","summary":{"en":"“Ladyishly” means behaving in a traditionally ‘ladylike’ way—polite, modest, and refined (often old-fashioned).","zh":"“Ladyishly”指以传统“淑女式”的方式行事——礼貌、端庄、克制（常显得过时）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a manner considered suitable for a lady; politely, modestly, or with refined manners (often old-fashioned).","zh":"以“淑女般”的方式；举止得体、礼貌、端庄（常带有过时的语感）。"},"examples":[{"en":"She sat ladyishly with her hands folded in her lap.","zh":"她很淑女地坐着，把双手叠放在腿上。"},{"en":"He spoke softly and ladyishly, trying not to offend anyone.","zh":"他讲话轻声细语、很“淑女式”地小心避免冒犯任何人。"}]}],"synonyms":["politely","gracefully","demurely","with good manners"],"phonetic":"ˈleɪdiˌlaɪʃli","extraExplanation":["“ladyishly”带有明显的性别与时代色彩：它把某些行为（端庄、克制、温柔）标记为“女性应有的样子”。在现代英语中，这种表达可能显得刻板或带评判意味，因此更常用中性说法，如“politely / gracefully / with good manners”。在文学或描写场景中使用时，往往带一点讽刺或复古的味道。"]}
{"word":"ladyishness","summary":{"en":"Ladyishness means the quality of being “ladyish,” i.e., having manners or a style seen as suitable for a lady, often in a traditional way.","zh":"Ladyishness 指“像淑女一样”的特质：被认为符合淑女形象的举止或风格，常带有传统意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being ladyish; behavior, manners, or appearance considered appropriate for a “lady” (often implying being polite, refined, or traditionally feminine)","zh":"“像淑女一样”的特质；被认为符合“淑女”形象的举止、礼仪或外表（常带有礼貌、优雅或传统女性气质的含义）"},"examples":[{"en":"Her family praised her for her ladyishness at formal dinners.","zh":"她家人称赞她在正式晚宴上的淑女风范。"},{"en":"He spoke approvingly about her ladyishness, meaning her calm manners and careful speech.","zh":"他称赞她的“淑女气质”，指的是她沉稳的举止和谨慎的措辞。"},{"en":"The novel gently questions whether “ladyishness” is a real virtue or just a social rule.","zh":"这部小说温和地质疑：“淑女气质”究竟是真正的美德，还是只是社会规训。"}]}],"synonyms":["ladylike manners","refinement","polish","femininity"],"phonetic":"/ˈleɪdiɪʃnəs/","extraExplanation":["“ladyishness”属于比较少见、带一点旧时代味道的词。它常出现在评价女性“该不该像淑女”的语境里，因此可能隐含对性别角色的刻板期待。现代英语里更常用“ladylike”或更中性的表达（如“politeness”“good manners”）来避免性别偏见。"]}
{"word":"ladyism","summary":{"en":"Ladyism means traditional “lady-like” expectations or behavior, often mentioned critically.","zh":"ladyism 指“像淑女一样”的传统规范或期待，常在批评语境中使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The attitudes, behavior, or social expectations traditionally associated with being a “lady,” often emphasizing politeness, modesty, refinement, and conventional femininity (sometimes used critically).","zh":"“淑女/贵妇风范”的观念、行为或社会期待，通常强调礼貌、端庄、优雅和传统女性气质（有时带批评意味）。"},"examples":[{"en":"She rejected the strict ladyism her school tried to enforce.","zh":"她拒绝了学校试图强加的那套严格“淑女规范”。"},{"en":"His comments were full of old-fashioned ladyism about how women should behave.","zh":"他的言论充满了过时的“淑女主义”观念，规定女性该怎么表现。"}]}],"synonyms":["conventional femininity","ladylike behavior","propriety","gender norms"],"phonetic":"/ˈleɪdiˌɪzəm/","extraExplanation":["“ladyism”并不是非常常见的现代英语词汇，更多见于批评或讨论性别规范的语境中，用来指一套“要像淑女那样”的规则与期待。","语气上常带有讽刺或批判色彩，暗示这种“优雅/端庄”的要求可能限制女性的自由与表达。若想更中性地表达，可用“ladylike manners（淑女式礼仪）”“traditional femininity（传统女性气质）”。"]}
{"word":"ladykiller","summary":{"en":"A slang noun meaning a man who strongly attracts women, often implying he dates many women.","zh":"俚语名词：指很会吸引女性、常被认为桃花很多的男人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who is very attractive to women and/or who pursues many romantic or sexual relationships (often used with a humorous or slightly disapproving tone).","zh":"（俚语）很受女性欢迎、并且常常追求很多恋爱或性关系的男人（常带调侃或略带贬义）。"},"examples":[{"en":"Everyone thought he was a real ladykiller, but he was actually shy.","zh":"大家都以为他是个“情场高手”，其实他很害羞。"},{"en":"She warned her friend not to fall for that ladykiller at the bar.","zh":"她提醒朋友别被酒吧里的那个“花花公子”迷住。"},{"en":"In old movies, the ladykiller often wears a suit and charms everyone with smooth talk.","zh":"在老电影里，“情场杀手”常穿西装，用甜言蜜语迷倒众人。"}]}],"synonyms":["ladies' man","womanizer","player","Casanova"],"phonetic":"/ˈleɪdiˌkɪlər/","extraExplanation":["这是由 lady + killer 组成的合成词，killer 在这里是比喻用法，意思不是“真的杀人”，而是“极具魅力、能把人迷倒”。","语气通常偏口语、带玩笑或轻微批评；正式写作中更常用 womanizer（偏贬义）或 ladies' man（更中性/偏正面）。","也可写作 lady-killer（带连字符），两种写法都能见到。"]}
{"word":"ladykin","summary":{"en":"“Ladykin” is an archaic noun meaning a little/young lady, used as an affectionate or playful diminutive of “lady.”","zh":"“Ladykin”是古语名词，意为“小淑女/年轻女士”，是对“lady”的亲昵或带玩笑意味的指小说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A little lady; a young or small lady, often used as a playful or affectionate diminutive of “lady.”","zh":"（古语）小淑女；年幼或娇小的女士，对“lady”的亲昵称呼或带玩笑意味的指小形式。"},"examples":[{"en":"The old poem speaks of a “ladykin” walking in the garden.","zh":"那首古诗写到一位“ladykin”在花园里散步。"},{"en":"He addressed his daughter as his “ladykin,” half teasing and half proud.","zh":"他称女儿为“ladykin”，半是逗趣，半是自豪。"}]}],"synonyms":["little lady","young lady","lass (dialect/old-fashioned)"],"phonetic":"/ˈleɪdikɪn/","extraExplanation":["“ladykin”里的后缀“-kin”在中古和近代早期英语里常用来表示“指小/亲昵”（类似“小……”“……宝”），也能带一点俏皮或轻微的调侃语气。现代英语中这种构词法不常见了，所以“ladykin”多见于古文本、诗歌或仿古写作。","在文学语境中，这类词常用来营造古典、柔和或戏谑的语气；读到时可以把它理解为对女性的亲昵称呼，但要注意时代语感，避免在现代正式场合使用以免显得不合时宜。"]}
{"word":"ladykind","summary":{"en":"“Ladykind” is an old-fashioned word meaning women as a group.","zh":"“ladykind”是较古老的词，意思是“女性整体/女界”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"women considered as a group; the female sex (archaic or literary).","zh":"（古语/文学用法）女性整体；女界；女性这一性别。"},"examples":[{"en":"In older writings, “ladykind” is sometimes used to mean all women.","zh":"在较早的文字中，“ladykind”有时用来指所有女性。"},{"en":"The author praised the courage of ladykind during difficult times.","zh":"作者赞扬女性在艰难时期的勇气。"}]}],"synonyms":["women","womanhood","the female sex","females (context-dependent)"],"phonetic":"/ˈleɪdiˌkaɪnd/","extraExplanation":["“ladykind”带有明显的时代感，现代英语里很少使用，更多见于较老的文章、戏仿（模仿旧文体）或带幽默/调侃色彩的表达。","结构上可理解为“lady（女士/女性）+ kind（种类/类群）”，类似于“mankind（人类）”。但在当代语境中，如果想表达“女性整体”，更常用 women / womanhood / the female sex。"]}
{"word":"ladykins","summary":{"en":"An archaic affectionate nickname meaning “dear little lady.”","zh":"一个古语的亲昵称呼，意思相当于“亲爱的/小小的女士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A small or dear “lady”; a term of affection or playful address, often used in older literature.","zh":"（古语）“小夫人/小小姐/亲爱的女士”：带亲昵或打趣语气的称呼，常见于旧文学作品中。"},"examples":[{"en":"In old plays, a man might call his sweetheart “ladykins.”","zh":"在旧戏剧里，男子可能会把心上人称作“ladykins”。"},{"en":"The poet addressed his daughter as “my ladykins” in a teasing, tender way.","zh":"诗人用一种逗趣又温柔的口吻称女儿为“my ladykins”。"}]}],"synonyms":["dear lady","sweetheart","my dear","lass (informal)","miss (old-fashioned in this use)"],"phonetic":"/ˈleɪdikɪnz/","extraExplanation":["“ladykins”由 lady + 后缀 -kins 组成。-kins 在中古到早期近代英语里常用作指小词/昵称（有“可爱的小……”或“亲昵的……”之意），类似于“dear little …”。","这个词带明显的时代感，现代日常英语几乎不用；更常见于莎士比亚时代及之后的文学、戏剧中，用来营造古雅、亲昵或轻松调侃的语气。"]}
{"word":"ladyless","summary":{"en":"“Ladyless” means ‘without women or ladies present; lacking women.’","zh":"“Ladyless”意为“没有女性在场的；缺少女性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without women or ladies present; lacking women (in a place, group, or situation)","zh":"（在某处、某群体或某种情境中）没有女性在场的；缺少女性的"},"examples":[{"en":"It was a ladyless gathering—just the men from the office having drinks after work.","zh":"那是个没有女性参加的聚会——只是办公室里的男同事下班后去喝一杯。"},{"en":"The club used to be almost ladyless, but it has become more welcoming in recent years.","zh":"这个俱乐部过去几乎没有女性成员，但近几年变得更欢迎女性了。"}]}],"synonyms":["all-male","male-only","without women","women-free","single-sex (male)"],"phonetic":"ˈleɪdiləs","extraExplanation":["“ladyless”不是常见词，更常用的表达是“all-male / male-only（全男性的）”、“women-free（没有女性的）”或“without women”。","在现代英语里，“lady”有时带有礼貌、阶层或性别刻板印象的色彩；在正式或更中性的语境中，常用“women”来替代“ladies”。"]}
{"word":"ladylike","summary":{"en":"Ladylike means polite and graceful in a traditionally “proper” feminine way, but it can also sound old-fashioned or judgmental.","zh":"Ladylike 指传统观念里“淑女式”的得体优雅，但有时也显得过时或带评判意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a woman or girl) Polite, graceful, and traditionally considered proper or refined in behavior or appearance.","zh":"（指女性或女孩）举止得体、优雅，符合传统观念中“端庄/淑女”的样子。"},"examples":[{"en":"She spoke in a quiet, ladylike way during the meeting.","zh":"她在会议上说话轻声细语，很有淑女风范。"},{"en":"His grandmother praised her for her ladylike manners.","zh":"他的祖母称赞她举止很端庄。"},{"en":"The school expected students to look neat and ladylike.","zh":"学校希望学生看起来整洁、端庄。"}]},{"partOfSpeech":"adj.","definition":{"en":"(sometimes) Used as a social judgment meaning “how a woman should behave,” which can feel old-fashioned or limiting.","zh":"（有时带评价意味）用来要求女性“应该怎么做”，可能显得过时或带限制性。"},"examples":[{"en":"Some people think the word “ladylike” puts unfair rules on women.","zh":"有些人认为“ladylike”给女性加了不公平的规矩。"},{"en":"She doesn’t worry about being ladylike—she just wants to be herself.","zh":"她不在意要不要“淑女”，只想做自己。"}]}],"synonyms":["graceful","polite","refined","well-mannered","proper"],"phonetic":"/ˈleɪdiˌlaɪk/","extraExplanation":["“ladylike”由“lady（女士/淑女）+ -like（像……一样）”构成，常见于对礼仪、穿着、姿态的评价。现代语境中，它既可以是称赞（优雅得体），也可能暗含性别刻板印象，因此在正式写作或多元文化场合，常用更中性的词如“polite（礼貌的）”“graceful（优雅的）”“well-mannered（有礼貌的）”来表达。"]}
{"word":"ladylikely","summary":{"en":"Ladylikely means “ladylike,” often with a slightly old-fashioned or affected tone.","zh":"ladylikely 表示“淑女气的”，多为古旧/文学用法，有时带一点“做作”的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) Like a lady in appearance or manners; ladylike, often implying an affected or overly refined style.","zh":"（古旧或文学用语）像淑女一样的；淑女气的（常带有“过分矜持、做作地装淑女”的含义）。"},"examples":[{"en":"She spoke in a lady-likely voice that sounded a little forced.","zh":"她用一种很“淑女”的声音说话，但听起来有点刻意。"},{"en":"The novel describes her as lady-likely, graceful, and carefully polite.","zh":"小说把她描写成“淑女气”、优雅而且礼貌得无可挑剔。"}]}],"synonyms":["ladylike","refined","proper","dainty","prim"],"phonetic":"/ˈleɪdiˌlaɪkli/","extraExplanation":["“ladylikely”多见于较老的英语或文学写作，现代日常英语里更常用“ladylike”。有时写作“lady-likely”（带连字符）。","语感上它不只是“像淑女”，还可能暗示“装得很淑女/太做作地讲究礼仪”，具体褒贬要看上下文。"]}
{"word":"ladylikeness","summary":{"en":"Ladylikeness means traditionally “proper” feminine manners and behavior—often associated with being polite, gentle, and refined, but sometimes criticized as a gender stereotype.","zh":"ladylikeness 指传统观念里的“淑女气质/端庄得体的女性举止”，常与礼貌温柔、优雅含蓄相关，也可能被视为性别刻板印象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Behavior, manners, and appearance that are traditionally considered appropriate for a woman, especially in a polite, gentle, and refined way.","zh":"（传统观念中）女性应有的举止、礼仪与外表气质；指被认为“端庄、温柔、得体、优雅”的女性风范。"},"examples":[{"en":"Her parents praised her for her ladylikeness at formal dinners.","zh":"她的父母称赞她在正式晚宴上举止端庄得体。"},{"en":"The school once taught “ladylikeness,” such as sitting properly and speaking softly.","zh":"这所学校曾教授所谓的“淑女风范”，比如坐姿端正、说话轻声细语。"},{"en":"She rejected the idea that ladylikeness should define how women behave.","zh":"她反对用“淑女气质”来规定女性该如何行为。"}]}],"synonyms":["ladylike behavior","femininity (in a traditional sense)","grace","poise","refinement"],"phonetic":"/ˈleɪdiˌlaɪknəs/","extraExplanation":["“ladylikeness”由 lady（女士、淑女）+ -like（像……一样）+ -ness（名词后缀，表示性质/状态）构成，字面是“像淑女一样的状态/特质”。","这个词常带有强烈的文化与时代色彩：它反映了对女性“应当如何举止”的传统期待。在现代语境中，有时会被中性使用（称赞优雅得体），也常被批判为带有性别刻板印象或限制女性表达。","近义表达可按语气区分：偏褒义可用 grace, poise, elegance（优雅/沉稳）；若强调“规训/刻板期待”，可说 gender norms（性别规范）或 the idea of being “ladylike”（要“像淑女”那样的观念）。"]}
{"word":"ladyling","summary":{"en":"“Ladyling” is an archaic word meaning “a little/young lady,” used mainly in literary or old-fashioned contexts.","zh":"“Ladyling”是较古旧的词，意为“小淑女/年轻女子”，多见于文学或旧式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a little lady; a young or small woman, often used as an affectionate or slightly playful term.","zh":"（古语）小淑女；年轻或娇小的女子，常带亲昵或略带调侃的语气。"},"examples":[{"en":"The poet called her a “ladyling,” meaning a young, delicate lady.","zh":"诗人称她为“ladyling”，意思是年轻而柔美的淑女。"},{"en":"In old stories, a nobleman might address his daughter as a ladyling.","zh":"在古老故事里，贵族可能会称女儿为“ladyling”。"}]}],"synonyms":["(archaic) young lady","(archaic) little lady","maiden","lass"],"phonetic":"/ˈleɪdiˌlɪŋ/","extraExplanation":["“ladyling”在现代英语里非常少见，带有明显的古风/文学色彩。","词尾“-ling”常有“小/年轻/较弱小”的意思（有时也可能带轻微贬义），类似的构词还有“duckling（小鸭）”。因此“ladyling”直译就是“小女士/小淑女”。","如果你想表达现代英语常用的“淑女的、很有淑女风度的”，更常见的词是“ladylike”。"]}
{"word":"ladylintywhite","summary":{"en":"“Lady in white” means a woman dressed in white, and it can also refer to a ghostly figure in folklore/horror stories.","zh":"“lady in white”既可指穿白衣的女士，也可指民间传说/恐怖故事里的“白衣女子（幽灵）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Likely intended: “lady in white”) A woman dressed in white clothing.","zh":"（可能想表达：lady in white）穿白色衣服的女士。"},"examples":[{"en":"At the wedding, a lady in white stood near the flowers.","zh":"在婚礼上，一位穿白色衣服的女士站在花旁边。"},{"en":"He noticed a lady in white walking across the street.","zh":"他注意到一位穿白色衣服的女士走过马路。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Folklore/horror) A ghostly female figure said to appear wearing a white dress; a common legend in many cultures.","zh":"（民间传说/恐怖故事）“白衣女鬼/白衣女子”的幽灵形象；在许多文化中都很常见的都市传说角色。"},"examples":[{"en":"The movie is about a lady in white who haunts an old road at night.","zh":"这部电影讲的是一位“白衣女子”在夜里徘徊在一条旧路上。"},{"en":"In local stories, people say they’ve seen a lady in white near the river.","zh":"在当地传说里，人们说他们在河边见过“白衣女子”。"}]}],"synonyms":["woman in white","white-clad lady","ghost in white","white lady"],"phonetic":"/ˈleɪdi ɪn waɪt/","extraExplanation":["你输入的“ladylintywhite”不是常见英语单词或固定短语，看起来像把几个词连在一起或拼写有误。最接近、最常见的表达是“lady in white”。","“Lady in White / 白衣女子”在英语恐怖片、都市传说里很常见，通常象征神秘、哀伤或未解的冤屈；不同地区会有各自版本。","如果你原本想查的是别的（例如人名、用户名、歌词/小说标题），可以把上下文或正确拼写发我，我可以按实际用法解释。"]}
{"word":"ladylove","summary":{"en":"“Ladylove” means a man’s loved woman—his sweetheart or romantic partner—often with an old-fashioned, poetic tone.","zh":"“Ladylove”指男性所爱之人（心上人/恋人），语气常偏老派、诗意，有时略带玩笑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a romantic term for a woman someone loves, especially a girlfriend, wife, or sweetheart (often old-fashioned or slightly humorous today)","zh":"对心爱的女性的浪漫称呼，尤指女友、妻子或“心上人”（如今多带点老派或略幽默的感觉）"},"examples":[{"en":"He brought flowers home for his ladylove.","zh":"他带花回家送给他的心上人。"},{"en":"In the song, the hero rides back to his ladylove.","zh":"在那首歌里，英雄骑马回到他的爱人身边。"},{"en":"“My ladylove,” he joked, “will you join me for dinner?”","zh":"他开玩笑说：“我的宝贝儿，今晚一起吃饭吗？”"}]}],"synonyms":["sweetheart","beloved","girlfriend","wife","darling"],"phonetic":"/ˈleɪdiˌlʌv/","extraExplanation":["“ladylove”常见于诗歌、歌曲或较浪漫的叙述中；在日常对话里听起来比较复古，可能带点调侃或戏谑。更中性的说法通常是“girlfriend / wife / partner / sweetheart / beloved”。"]}
{"word":"ladyloves","summary":{"en":"“Ladylove(s)” means a woman someone loves romantically, often in an old-fashioned or playful style.","zh":"“ladylove(s)”指男性所爱的女性情人/心上人，语气常较老派或带点俏皮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who is loved or admired romantically; a sweetheart (often used in a slightly old-fashioned or playful way)","zh":"情人；心上人（指女性；常带有稍显老派或俏皮的语气）"},"examples":[{"en":"He introduced her as his ladylove at the party.","zh":"在派对上，他把她介绍为自己的心上人。"},{"en":"In the old song, the sailor promises to return to his ladylove.","zh":"在那首老歌里，水手承诺会回到他的爱人身边。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) women who are loved or pursued romantically","zh":"（复数）恋人们；被追求的女性"},"examples":[{"en":"The novel is full of jealous rivals and forgotten ladyloves.","zh":"这部小说里充满了嫉妒的情敌和被遗忘的旧情人。"}]}],"synonyms":["sweetheart","beloved","girlfriend","love","darling"],"phonetic":"/ˈleɪdiˌlʌv/","extraExplanation":["“ladylove”在现代英语里不算常用，更多见于诗歌、老电影/老歌曲、或带点戏谑的表达。语感上比“girlfriend/partner”更浪漫、更复古。","注意它通常用来指“女性恋人”。若想更中性，可以用“love”“partner”“significant other”。"]}
{"word":"ladyly","summary":{"en":"Ladylike means behaving politely and gracefully in a traditionally “lady” way; it can also sound old-fashioned or sexist in modern contexts.","zh":"Ladylike 指传统观念中的“淑女式”端庄礼貌；在现代语境中有时会显得过时或带性别刻板印象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly written as “ladylike”) behaving in a way that is traditionally considered polite, gentle, and appropriate for a woman.","zh":"（常写作“ladylike”）举止端庄、礼貌温和，传统观念中被认为“像淑女”的行为举止。"},"examples":[{"en":"She spoke in a calm, ladylike way, even when she was angry.","zh":"即使生气，她说话也很平静，很有淑女风度。"},{"en":"My grandmother taught me to sit up straight and look ladylike at the table.","zh":"我奶奶教我吃饭时要坐直，看起来要端庄。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often used critically) following old-fashioned gender expectations about how women “should” act.","zh":"（常带批评意味）遵循过时的性别期待，指女性“应该”怎样表现。"},"examples":[{"en":"He told her to be more ladylike, which sounded unfair and outdated.","zh":"他叫她更“像淑女一点”，听起来既不公平又很过时。"},{"en":"She dislikes rules about what is or isn’t ladylike.","zh":"她不喜欢那些规定什么算不算“淑女”的规则。"}]}],"synonyms":["polite","well-mannered","graceful","refined","proper"],"phonetic":"/ˈleɪdiˌlaɪk/","extraExplanation":["“ladyly”比较少见，现代英语里更常用、也更标准的拼写是“ladylike”。","“ladylike”在当代语境中有时会被认为带有刻板印象：它把“得体/优雅”与“女性应当如此”绑定在一起。描述礼貌得体时可以用更中性的词，如“polite / well-mannered / graceful”。"]}
{"word":"ladypalm","summary":{"en":"Lady palm is a popular indoor palm plant (Rhapis excelsa).","zh":"Lady palm 指常见的室内棕榈植物“观音棕”（Rhapis excelsa）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small palm plant (Rhapis excelsa) often grown indoors; also called a fan palm or bamboo palm","zh":"观音棕（Rhapis excelsa），一种常见的室内观叶棕榈植物，也常被称为扇叶棕/竹棕"},"examples":[{"en":"We put a lady palm near the window because it handles low light well.","zh":"我们把一盆观音棕放在窗边，因为它比较耐阴。"},{"en":"The office lobby looks calmer with a few lady palms in large pots.","zh":"大厅里摆几盆观音棕，氛围看起来更宁静。"}]}],"synonyms":["Rhapis excelsa","fan palm","bamboo palm"],"phonetic":"/ˈleɪdi pɑːm/","extraExplanation":["“lady palm”在园艺语境中很常见，指一种耐阴、较耐旱、适合室内养护的棕榈科植物（学名 Rhapis excelsa）。在不同地区也可能被叫作“bamboo palm（竹棕）”或“fan palm（扇叶棕）”，但注意：有时“bamboo palm”也会被用来指另一种常见室内植物 Chamaedorea seifrizii（袖珍椰子属），购买时可看学名避免混淆。","书面或文学作品中，植物名多用于营造环境氛围：如“lobby lined with lady palms（大厅两侧摆着观音棕）”常给人一种安静、整洁、略带热带感的画面。"]}
{"word":"ladypalms","summary":{"en":"Lady palms are small fan-leaf palms commonly grown as indoor plants.","zh":"Lady palms 指常见的室内观叶植物“观音棕/棕竹”，叶片呈扇形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of small palm tree (Rhapis excelsa) with fan-shaped leaves, often grown as an indoor or patio plant","zh":"观音棕／棕竹（Rhapis excelsa），一种叶片呈扇形、常作为室内或庭院盆栽的矮生棕榈"},"examples":[{"en":"We put lady palms in the lobby because they can handle low light.","zh":"我们在大厅摆了观音棕，因为它们比较耐低光。"},{"en":"Lady palms are popular houseplants in offices and apartments.","zh":"观音棕在办公室和公寓里很受欢迎，是常见的室内植物。"}]}],"synonyms":["lady palm","Rhapis excelsa","bamboo palm"],"phonetic":"/ˈleɪdi pɑːmz/","extraExplanation":["“lady palm”常见于园艺与室内植物语境；写作时更常用单数指“这种植物”（lady palm），复数 lady palms 指“多盆/多株”。","学名 Rhapis excelsa，原产东亚（常被认为与中国有关），英文里也有人叫它 “bamboo palm”（竹棕/竹棕榈）是因为茎干像竹节。"]}
{"word":"ladysfinger","summary":{"en":"“Lady’s finger” most commonly means okra, but in some places it can also mean a ladyfinger-style cookie used in desserts.","zh":"“lady’s finger”最常指秋葵；在某些地区也可指用于甜点的手指饼/蛋糕条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"okra; a long, green seed pod used as a vegetable, especially in Southern U.S., African, Middle Eastern, and Indian cooking.","zh":"秋葵；一种细长的绿色荚果类蔬菜，常见于美国南方、非洲、中东和印度等地的料理。"},"examples":[{"en":"She added sliced lady’s fingers to the stew to make it thicker.","zh":"她把切片的秋葵放进炖菜里，让汤汁更浓稠。"},{"en":"Fried lady’s finger is a popular side dish in the American South.","zh":"炸秋葵是美国南方很受欢迎的配菜。"},{"en":"In some recipes, lady’s finger is cooked with tomatoes and spices.","zh":"在一些食谱里，秋葵会和番茄、香料一起烹调。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a long, thin cookie or sponge-cake finger, similar to a “ladyfinger,” often used in desserts.","zh":"（南亚英语）指细长的手指饼/海绵蛋糕条，类似“ladyfinger”，常用于甜点。"},"examples":[{"en":"For the dessert, they layered cream with lady’s fingers.","zh":"做甜点时，他们把奶油和手指饼分层铺好。"},{"en":"You can dip lady’s fingers in coffee before using them in a trifle.","zh":"做甜品杯时，可以先把手指饼蘸一下咖啡。"}]}],"synonyms":["okra","ladyfinger (cookie)","savoiardi"],"phonetic":"/ˈleɪdiz ˌfɪŋɡɚ/","extraExplanation":["“lady’s finger”在不同地区指代可能不同：在美式/英式很多语境里更常指秋葵（okra）；而在甜点语境里，人们更常用拼写“ladyfinger(s)”来指手指饼。","秋葵烹调时会产生黏液，这是它能让汤羹变稠的原因；在美国路易斯安那州的秋葵汤（gumbo）里尤其常见。"]}
{"word":"ladyship","summary":{"en":"Ladyship is a formal title/address for a high-ranking woman (especially British nobility) and can also mean the rank/status of being a lady.","zh":"Ladyship 是对高阶层女性（尤指英国贵族女性）的正式称呼，也可指“夫人/女士”的头衔或身份地位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Title/form of address) used when speaking to or about a woman who holds a high rank (especially in the British nobility), equivalent to “Your Ladyship” or “Her Ladyship.”","zh":"（称号/敬称）用于称呼或提及具有高贵身份的女性（尤指英国贵族），相当于“您的夫人/爵位夫人”“她的夫人/爵位夫人”。"},"examples":[{"en":"Your Ladyship, the carriage is ready.","zh":"夫人，马车已经备好了。"},{"en":"Her Ladyship will receive guests at four o’clock.","zh":"她（夫人）将于四点接见客人。"}]},{"partOfSpeech":"n.","definition":{"en":"The status, rank, or position of being a lady; “being a lady,” especially as a social title or honor.","zh":"“夫人/女士”的身份、地位或头衔；尤指作为社会称号或荣衔的“夫人身份”。"},"examples":[{"en":"She gained ladyship through marriage into the nobility.","zh":"她因嫁入贵族而获得夫人身份（头衔）。"},{"en":"The documents refer to his wife’s ladyship and privileges.","zh":"文件提到他妻子的夫人身份及其特权。"}]}],"synonyms":["Your Ladyship","Her Ladyship","title","rank"],"phonetic":"/ˈleɪdiˌʃɪp/","extraExplanation":["“Ladyship”多见于英式语境与较正式/历史题材（如小说、戏剧、古装影视）中。现代日常英语里很少用来称呼一般女性；更常见的是礼貌用语“ma’am”。","常见搭配：Your Ladyship（当面称呼）、Her Ladyship（第三人称提及）。复数可用“their ladyships”。","在文学与影视中，它常用来营造阶级与礼仪氛围（例如仆人对女主人、法庭/官署对贵妇的称呼）。"]}
{"word":"ladyships","summary":{"en":"“Ladyships” is the plural of “ladyship,” meaning either the status of being a titled lady or a formal way to address women titled “Lady,” especially in British contexts.","zh":"“ladyships”是“ladyship”的复数，可指贵族女士的身份/地位，也可作对拥有“Lady”头衔女性的正式尊称（多见于英式语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the rank, status, or dignity of being a lady (or a woman of high social position); plural form of “ladyship.”","zh":"“ladyship”的复数：女士（多指贵族或上层女性）的身份、地位或尊称。"},"examples":[{"en":"In old novels, characters sometimes talk about their ladyships as a sign of social rank.","zh":"在一些旧小说里，人物有时会谈到“她们的ladyships”，用来表示社会地位。"},{"en":"The committee included several ladyships from influential families.","zh":"委员会里包括几位出身显赫的贵族女士。"}]},{"partOfSpeech":"n.","definition":{"en":"a polite form used to address or refer to women with the title “Lady,” especially in British English (e.g., “Your Ladyship”); plural form.","zh":"对拥有“Lady”头衔的女性的礼貌称呼（尤用于英式英语，如“Your Ladyship 您夫人/阁下”）；其复数形式。"},"examples":[{"en":"The clerk said, “This way, your ladyships, please.”","zh":"办事员说：“这边请，各位夫人/阁下。”"},{"en":"They were introduced as “their ladyships” at the formal dinner.","zh":"在正式晚宴上，她们被介绍为“their ladyships（几位夫人/阁下）”。"}]}],"synonyms":["titled ladies","their ladyships","Your Ladyship (singular form of address)","ladies (more general, not titled)"],"phonetic":"/ˈleɪdiˌʃɪps/","extraExplanation":["“Ladyship”多见于英国社会与传统礼仪语境：既可以指“贵族女士的身份/地位”，也可以作为对“Lady”的尊称（类似中文里较正式的“夫人/阁下”）。在现代日常英语中不常用，更多出现在历史题材、文学作品、正式典礼或带有英式风格的场景。","写作时要注意：如果只是表示“女士们”，通常用“ladies”；“ladyships”带有“头衔/身份/礼仪称呼”的色彩。"]}
{"word":"ladyslipper","summary":{"en":"A lady’s slipper is an orchid with a pouch-shaped flower that looks like a slipper.","zh":"lady’s slipper 指一种花朵像“拖鞋”的兰花（兜兰/拖鞋兰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild orchid with a pouch-shaped flower, resembling a slipper; also called a slipper orchid (genus Cypripedium and related genera).","zh":"一种野生兰花，花朵呈“鞋袋”状，像拖鞋一样；也称“兜兰 / 拖鞋兰”（常指兜兰属 Cypripedium 及相关属）。"},"examples":[{"en":"We saw a lady’s slipper orchid blooming near the forest trail.","zh":"我们在森林小径附近看到了一株正在开花的兜兰（拖鞋兰）。"},{"en":"Some species of lady’s slipper are protected because they are rare.","zh":"有些兜兰（拖鞋兰）品种因为稀有而受到保护。"}]}],"synonyms":["slipper orchid","Cypripedium"],"phonetic":"/ˈleɪdiz ˌslɪpɚ/","extraExplanation":["“lady’s slipper”（也常写作 lady slipper）这个名字来自花朵中间鼓起的“袋状唇瓣”，看起来像一只小拖鞋。","在北美语境中，它常指野生的兜兰属（Cypripedium），例如“pink lady’s slipper（粉红兜兰）”，是一些地区很有代表性的野花。野外采挖会破坏种群，因此不少地区禁止采摘或移植。"]}
{"word":"ladysnow","summary":{"en":"LadySnow is usually a name/nickname meaning “Lady Snow,” often used poetically or stylistically to suggest wintery elegance.","zh":"LadySnow 通常是名字/昵称，意为“雪之女士”，多用于诗意或风格化表达，带有冬日清冷与优雅的感觉。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a name or nickname that combines “Lady” (a polite title for a woman) with “Snow”; often used as a poetic or elegant way to refer to a woman associated with snow, winter, or a “cold/icy” aesthetic","zh":"由“Lady（女士/夫人，礼貌称呼）”和“Snow（雪）”组成的名字或昵称；常用作带有诗意、优雅气质的称呼，指与雪、冬天或“清冷/冰雪风”形象有关的女性"},"examples":[{"en":"Online, she goes by the name LadySnow.","zh":"在网上，她用 LadySnow 这个名字。"},{"en":"In the poem, the narrator calls winter ‘Lady Snow’ to personify the season.","zh":"在那首诗里，叙述者把冬天称作“Lady Snow（雪之女士）”，用拟人手法来写季节。"},{"en":"The costume design gives her a ‘Lady Snow’ look—white silk, silver details, and a calm expression.","zh":"服装设计让她呈现“Lady Snow”的风格——白色丝绸、银色细节，以及冷静的表情。"}]}],"synonyms":["Snow Queen","Snow Maiden","Lady of Snow"],"phonetic":"/ˈleɪdi snoʊ/","extraExplanation":["“Lady + 名词”在英文里常用于塑造一种拟人化或带贵族气质的形象（如 Lady Luck 幸运女神、Lady Justice 正义女神）。因此“Lady Snow”也常带有文学/审美色彩，而不一定是固定词条。","如果你想表达“雪姑娘/雪女”的民间或神话感觉，更常见的说法有 Snow Maiden（雪姑娘）或 Snow Queen（冰雪女王）。"]}
{"word":"ladytide","summary":{"en":"Ladytide is a rare, poetic term usually used as a fanciful name/title connected to the sea and tides, not a common standard word.","zh":"Ladytide 是罕见的诗意用语，多作为与海潮相关的拟人化名字/称号使用，并非常见标准词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/poetic) A “lady” imagined as being linked to the sea or its tides; sometimes used as a fanciful title or name (e.g., for a character, a ship, a poem, or a username).","zh":"（罕见/诗意用法）与海潮有关、被想象为“潮汐之女/潮之女士”的形象；也常作为人物、船只、诗作或网名等的拟称/名字。"},"examples":[{"en":"In the poem, the Ladytide rises with the moon and quiets the harbor.","zh":"在诗里，“Ladytide（潮汐之女）”随月而起，又让港湾归于宁静。"},{"en":"They named the sailboat Ladytide to honor her love of the ocean.","zh":"他们把帆船命名为 Ladytide，以纪念她对海洋的热爱。"}]}],"synonyms":["(as a poetic idea) sea goddess","(as a name/title) ocean lady","tide maiden"],"phonetic":"/ˈleɪdi taɪd/","extraExplanation":["“ladytide”不是常见的标准英语词汇，更常见的是写成两个词（lady tide）或作为专有名词使用（书名、船名、角色名、ID等）。","从构词感觉上，它有点像“Christmastide / eventide”里 -tide 的用法（表示“时节/时期”），但现代英语中把“lady+tide”固定成一个通用词并不普遍，所以读者通常会把它理解为一种诗化的拟人称呼或自造词。"]}

