{"word":"lae","summary":{"en":"“lae” is a Scots dialect word meaning “left/remaining; the rest.”","zh":"“lae”是苏格兰方言词，意思是“剩下的；其余的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots, dialect) Left; remaining; the rest of something after part has been taken or used.","zh":"（苏格兰方言）剩下的；其余的；留下的。"},"examples":[{"en":"I’ve eaten two biscuits—keep the lae for later.","zh":"我吃了两块饼干——把剩下的留到以后。"},{"en":"The lae of the money went to the children.","zh":"剩下的钱给了孩子们。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) The remainder; what is left over.","zh":"（苏格兰方言）剩余部分；余下的东西。"},"examples":[{"en":"We shared the food and saved the lae.","zh":"我们分着吃了食物，把剩下的留了下来。"},{"en":"Take the lae home with you.","zh":"把剩下的带回家吧。"}]}],"synonyms":["the rest","remainder","leftover(s)","remaining"],"phonetic":"/leɪ/","extraExplanation":["“lae”主要见于苏格兰英语/苏格兰语（Scots）与方言文学中，相当于标准英语里的“left/remaining/the rest”。在现代日常标准英语里不常用，更多用于表现地域口音、人物身份或诗歌韵律。","和“lae”意思很接近的苏格兰词还有“lave”（意为“其余的人/物”），在罗伯特·彭斯（Robert Burns）等苏格兰诗歌中更常见。"]}
{"word":"laedere","summary":{"en":"Laedere is a Latin verb meaning “to harm/injure” or “to offend/wrong.”","zh":"Laedere 是拉丁语动词，意思是“伤害/使受伤”或“冒犯/亏待”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to hurt, injure, or damage; to cause physical harm.","zh":"（拉丁语）伤害、使受伤、损坏；造成身体上的伤害。"},"examples":[{"en":"The surgeon tried not to laedere (injure) the surrounding tissue.","zh":"外科医生尽量不去 laedere（伤害）周围组织。"},{"en":"In war, weapons are designed to laedere the enemy.","zh":"在战争中，武器被设计用来 laedere（伤害）敌人。"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin) to offend, wrong, or harm someone’s feelings or reputation.","zh":"（拉丁语）冒犯、亏待；伤害某人的感情或名誉。"},"examples":[{"en":"Harsh words can laedere a friend even without physical violence.","zh":"刻薄的话即使没有肢体冲突，也会 laedere（伤害）朋友。"},{"en":"Roman writers warned that pride can laedere one’s honor.","zh":"罗马作家提醒：傲慢会 laedere（损害）一个人的名誉。"}]}],"synonyms":["harm","injure","wound","damage","offend","wrong"],"phonetic":"/ˈlaɪ.də.reɪ/","extraExplanation":["laedere 是拉丁语不定式，常见于法律与伦理语境，例如格言 “neminem laedere”（不伤害任何人），常被理解为一种基本的道德/法律原则。","它也与一些英语词源有关：拉丁语过去分词相关形式 *laesus*（被伤害的）影响了英语中的医学/法律词汇，如 *lesion*（病灶、损伤）与 *lesion* 所体现的“受损”含义。"]}
{"word":"laelia","summary":{"en":"Laelia is mainly the name of a genus of ornamental orchids; it can also be a rare female given name.","zh":"Laelia主要指香兰属（观赏兰花的一属）；也可作较少见的女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical orchids, known for showy flowers and commonly grown as ornamental plants (often linked with cattleya-type orchids in horticulture).","zh":"（植物）香兰属：一种热带兰花属，花朵华丽，常被当作观赏植物栽培（园艺上常与卡特兰类型兰花相关）。"},"examples":[{"en":"Laelia orchids need bright light to bloom well.","zh":"香兰属兰花需要较强的光照才能开得好。"},{"en":"The greenhouse has several Laelia hybrids with purple flowers.","zh":"温室里有几株香兰属的杂交品种，开紫色花。"}]},{"partOfSpeech":"n.","definition":{"en":"a feminine given name (rare), sometimes inspired by the orchid or by classical-sounding Latin names.","zh":"（人名）莱莉娅/拉埃莉娅：较少见的女性名字，有时受兰花名或古典拉丁风格名字启发。"},"examples":[{"en":"Laelia introduced herself to the class on the first day.","zh":"第一天上课时，莱莉娅向全班做了自我介绍。"}]}],"synonyms":["orchid","Laelia orchid"],"phonetic":"/leɪˈliːə/","extraExplanation":["“Laelia”作为兰花属名，多被认为来自拉丁化的古罗马女性名“Laelia”。在园艺语境里，你也可能看到它与 Cattleya（卡特兰属）一起被提到，因为两者亲缘较近，杂交也很常见。"]}
{"word":"laemodipod","summary":{"en":"“Laemodipod” isn’t a standard English word; it’s likely a typo or a name.","zh":"“laemodipod”不是标准英语词，可能是拼写错误或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, or a made-up term, so it doesn’t have an established dictionary meaning.","zh":"不是标准英语单词。它可能是拼写错误、用户名或自造词，因此没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “laemodipod” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“laemodipod”——你是不是想写另一个词？"},{"en":"If “laemodipod” is a brand name or a game term, please share the sentence where you saw it.","zh":"如果“laemodipod”是品牌名或游戏术语，请把你看到它的句子发我看看。"}]}],"phonetic":"/ˌleɪmoʊˈdaɪpɑd/","extraExplanation":["“laemodipod”看起来像由几段拼写拼在一起的词（例如末尾的“pod”会让人联想到 iPod/Pods 这类词），但英语里并没有常见词条对应它。","如果你告诉我：①它出现的句子/上下文；②你想表达的中文意思；或③你怀疑的正确拼写（比如接近的单词/发音），我就能帮你锁定真正的词并给出准确释义与用法。"]}
{"word":"laemodipoda","summary":{"en":"Laemodipoda is an older zoological name for certain amphipod crustaceans, especially caprellids (“skeleton shrimps”).","zh":"Laemodipoda 是一个较旧的动物学名称，指某些端足目甲壳动物，尤其是海马虾类（“骨架虾”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A former or less common taxonomic group used for certain amphipod crustaceans, especially the caprellids (often called “skeleton shrimps”).","zh":"（动物学）一个较旧或不太常用的分类名称，用来指某些端足目甲壳动物，尤其是海蟑螂科/海马虾类（常被称为“骨架虾”）。"},"examples":[{"en":"In older zoology books, some caprellid amphipods were placed in Laemodipoda.","zh":"在较早的动物学书籍里，一些海马虾类端足目动物曾被归入 Laemodipoda。"},{"en":"The term Laemodipoda is largely historical; modern sources usually classify these animals within Amphipoda.","zh":"Laemodipoda 这个词主要具有历史意义；现代资料通常把这些动物归入端足目（Amphipoda）。"}]}],"synonyms":["caprellids","skeleton shrimp","amphipods"],"phonetic":"ˌliːməˈdɪpədə","extraExplanation":["Laemodipoda 多见于旧式分类或历史文献中，常与“caprellids（骨架虾/海马虾类）”相关；如今更常用的上位分类是 Amphipoda（端足目），具体到某些群则用 Caprellidea/Caprellidae 等名称（不同资料体系可能略有差异）。","如果你是在论文或数据库里看到 laemodipoda，也可能是拼写/转写差异导致的变体；建议同时检索关键词：caprellid, skeleton shrimp, Amphipoda。"]}
{"word":"laemodipodan","summary":{"en":"“laemodipodan” isn’t a recognized English word; it likely refers to “amlodipine,” a medicine for high blood pressure and angina.","zh":"“laemodipodan”不是标准英语词；很可能指“amlodipine（氨氯地平）”，用于治疗高血压和心绞痛的药物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This term is not a standard English word. It is likely a misspelling or a non-English/brand name. A very close and common match is “amlodipine,” a medicine used to treat high blood pressure and some heart conditions.","zh":"这个词不是标准英语词汇，可能是拼写错误或非英语/商品名。一个非常接近且常见的可能是“amlodipine（氨氯地平）”，一种用于治疗高血压和部分心脏疾病的药物。"},"examples":[{"en":"I couldn’t find “laemodipodan” in an English dictionary—did you mean “amlodipine”?","zh":"我在英语词典里找不到“laemodipodan”——你是不是想写“amlodipine”？"},{"en":"Amlodipine is often prescribed to help lower blood pressure.","zh":"氨氯地平常用于帮助降低血压。"}]},{"partOfSpeech":"n.","definition":{"en":"amlodipine: a prescription drug (a calcium channel blocker) that relaxes blood vessels, used for high blood pressure and chest pain (angina).","zh":"amlodipine（氨氯地平）：一种处方药（钙通道阻滞剂），通过放松血管来发挥作用，用于治疗高血压和胸痛（心绞痛）。"},"examples":[{"en":"The doctor started him on amlodipine for hypertension.","zh":"医生给他开了氨氯地平来治疗高血压。"},{"en":"She takes amlodipine once a day, as directed.","zh":"她按医嘱每天服用一次氨氯地平。"}]}],"phonetic":"/æmˈloʊdəˌpiːn/","extraExplanation":["“laemodipodan”看起来不像常见英语单词，更像是把“amlodipine（氨氯地平）”拼错了（例如多/少了字母或顺序颠倒）。如果你能提供：①它出现的句子；②是否来自药盒/处方/说明书；③你想查的是英文还是其他语言，我可以更准确地确认。","如果你指的是药物：请以药盒或处方上的拼写为准；用药问题务必咨询医生/药师，我可以帮助你理解说明书上的英文内容（剂量、用法、注意事项等）。"]}
{"word":"laemodipodiform","summary":{"en":"“laemodipodiform” is not a recognized English word; it’s likely a misspelling or an invented/scientific-looking form.","zh":"“laemodipodiform”不是公认的英语词，可能是拼写错误或人为造出的拟术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It appears to be a misspelling or a made-up/scientific-looking form, so it doesn’t have an established dictionary meaning.","zh":"不是标准英语单词。看起来像拼写错误或人为造出的“科学感”词形，因此没有公认的词典释义。"},"examples":[{"en":"I searched for “laemodipodiform,” but it doesn’t appear in major English dictionaries.","zh":"我查了“laemodipodiform”，但它不在主流英语词典中。"},{"en":"If you meant a biology term, please share the sentence or the correct spelling.","zh":"如果你想表达生物学术语，请提供句子或正确拼写。"}]}],"phonetic":"/ˌleɪmoʊˈdɪpəˌdɔɹfɪm/","extraExplanation":["这个词很像由词根拼出来的“拟术语”。结尾 -form 通常表示“……形的/……状的”。如果你是在科学语境里看到它，可能是拼写误读或OCR识别错误。","你可能想写的是：\n- podiform（= pod-shaped，豆荚形/结核状；常见于地质/矿床语境）\n- amphipodiform（= amphipod-shaped，端足类外形的；生物学用）\n把原句贴出来，我可以据上下文帮你锁定正确词并解释。"]}
{"word":"laemodipodous","summary":{"en":"“Laemodipodous” is not a recognized standard English word; it is likely a misspelling or a rare/nonce form built from Greek-like roots.","zh":"“laemodipodous”不是常见标准英语词；更可能是拼写错误或由希腊语词根拼出来的罕见/临时造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a very rare/nonce formation. It appears to combine parts that resemble Greek-based roots (like “di-” = two and “-podous” = foot), but the full form is not recognized in modern dictionaries.","zh":"不是标准英语词；更可能是拼写错误或极罕见/临时造词。它看起来像由希腊语词根拼合而成（如“di-”=“二”，“-podous”=“足/脚”），但整体形式在现代词典中不常见。"},"examples":[{"en":"I couldn’t find “laemodipodous” in a dictionary—do you mean “dipodous” (two-footed) or “bipedal”?","zh":"我在词典里找不到“laemodipodous”——你是不是想写“dipodous”（两足的）或“bipedal”（两足行走的）？"},{"en":"If you can share the sentence where you saw it, I can help identify the intended word.","zh":"如果你能把看到它的句子发给我，我可以帮你判断原本想表达的词。"}]}],"synonyms":["(possible intended) dipodous","(possible intended) bipedal","two-footed"],"phonetic":"ˌleɪmoʊˈdaɪpədəs","extraExplanation":["这个词很像“拼合出来的学术风格词”（用希腊/拉丁词根组合），其中“-podous / -pous”常见于生物学或描述“足/脚”的词里：\n- dipodous：两足的（di- = 二，-podous = 足）\n- quadruped：四足动物（quadru- = 四，-ped = 足）\n如果你是从某本书、论文、游戏或手写笔记里看到的，可能是：\n1）拼写误读/误打；2）作者自造词；3）扫描/OCR 识别错误。\n把原句或来源贴出来，我可以据上下文推断更可能的正确词。"]}
{"word":"laemoparalysis","summary":{"en":"“Laemoparalysis” is not a standard English word; it likely refers to “hemiparalysis,” paralysis of one side of the body.","zh":"“laemoparalysis”不是标准英语词；很可能指“hemiparalysis（偏瘫）”，即身体一侧的瘫痪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) This spelling is not common in English dictionaries; it is likely a misspelling of “hemiparalysis,” meaning paralysis affecting one side of the body.","zh":"（非标准/罕见）这种拼写在英语词典中不常见；很可能是“hemiparalysis”的误拼，指身体一侧的瘫痪。"},"examples":[{"en":"The report likely meant hemiparalysis (paralysis on one side of the body), not “laemoparalysis.”","zh":"报告里很可能想写的是 hemiparalysis（身体一侧瘫痪），而不是“laemoparalysis”。"},{"en":"After the stroke, she experienced hemiparalysis and needed rehabilitation.","zh":"中风后，她出现了偏瘫（hemiparalysis），需要康复治疗。"}]}],"synonyms":["hemiplegia","one-sided paralysis"],"phonetic":"/ˌhɛmɪpəˈræləsɪs/","extraExplanation":["“hemiparalysis”由 hemi-（半、单侧）+ paralysis（瘫痪）组成，常见于医学语境。你也可能会看到更常用的词“hemiplegia（偏瘫）”，在临床中很常互换使用，但“hemiplegia”更常见、更正式。","如果你能提供这个词出现的句子或原文截图/链接，我可以更准确判断它是否是特定学科里的术语、OCR识别错误，或某种变体拼写。"]}
{"word":"laemostenosis","summary":{"en":"A medical term meaning narrowing of the inside space (lumen) of a vessel or tube in the body.","zh":"医学术语，指血管或管状结构内部通道（管腔）变窄。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(medical) Narrowing of the lumen (the inner open space) of a blood vessel, airway, or other tube-shaped structure in the body.","zh":"（医学）管腔狭窄：血管、气道或其他管状结构的“管腔”（内部通道）变窄。"},"examples":[{"en":"The scan showed lumen stenosis in the carotid artery, which can reduce blood flow to the brain.","zh":"扫描显示颈动脉出现管腔狭窄，可能会减少流向大脑的血流。"},{"en":"Doctors monitor the degree of lumen stenosis to decide whether treatment is needed.","zh":"医生会监测管腔狭窄的程度，以决定是否需要治疗。"}]}],"synonyms":["narrowing","stricture","constriction"],"phonetic":"/ˈluːmən stəˈnoʊsɪs/","extraExplanation":["你输入的“laemostenosis”不是常见英语拼写；医学语境中更常见的是 **lumen stenosis**（管腔狭窄）。也可能有人想写的是更具体的类型，例如 **aortic stenosis**（主动脉瓣狭窄）或 **spinal stenosis**（椎管狭窄），但它们与“lumen”不同。","词源提示：**stenosis** 源自希腊语，意为“变窄”；在医学报告里常与具体部位搭配（如 carotid/arterial/airway + stenosis）。"]}
{"word":"laen","summary":{"en":"“Lean” means to tilt or rest against something, or to prefer something; as an adjective, it means thin/low-fat or not abundant.","zh":"“Lean”可表示（身体）倾斜、倚靠，或表示偏向/倾向；作形容词时指精瘦/低脂，或指不宽裕、数量不多。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move your body so it is not upright; to rest against something for support","zh":"（身体）倾斜；倚靠（某物）以获得支撑"},"examples":[{"en":"She leaned forward to hear better.","zh":"她身体前倾，以便听得更清楚。"},{"en":"Don’t lean on the door—it might open.","zh":"别倚着门——它可能会打开。"}]},{"partOfSpeech":"v.","definition":{"en":"to prefer or tend toward one side, opinion, or choice","zh":"倾向于；偏向（某种观点或选择）"},"examples":[{"en":"I lean toward taking the train instead of driving.","zh":"我更倾向于坐火车而不是开车。"},{"en":"The judge leaned in favor of the smaller company.","zh":"法官更偏向那家小公司。"}]},{"partOfSpeech":"adj.","definition":{"en":"thin and fit, with little body fat","zh":"精瘦的；脂肪少的"},"examples":[{"en":"He has a lean build from swimming every day.","zh":"他每天游泳，所以体型很精瘦。"},{"en":"Choose lean meat if you want less fat.","zh":"如果你想少脂肪，就选瘦肉。"}]},{"partOfSpeech":"adj.","definition":{"en":"small in amount; not having much extra","zh":"（数量）少的；不宽裕的"},"examples":[{"en":"We had a lean year, so we saved money.","zh":"那一年收入不多，所以我们省着花。"}]}],"synonyms":["tilt","incline","rest (against)","tend","prefer","slim","low-fat"],"phonetic":"/lin/","extraExplanation":["你输入的“laen”在英语里不常见，最可能是拼写错误，常见目标词是 **lean**（倾斜/倚靠；精瘦的）。\n也可能是 **lane**（小路/车道）或 **loan**（贷款/借出），如果你想查的是其中一个，告诉我我可以改成对应词条。"]}
{"word":"laender","summary":{"en":"Laender (Länder) means the German federal states; it’s the plural of Land.","zh":"Laender（Länder）指德国的联邦州，是德语Land（州/国家）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Germany, Austria, Switzerland) the federal states; in German, the plural of Land (“state/country”). In English writing, it usually refers to Germany’s states (e.g., Bavaria, Saxony).","zh":"（德语）联邦州；Land（“州/国家”）的复数。在英文语境中多指德国的各个联邦州（如巴伐利亚、萨克森）。"},"examples":[{"en":"Germany is made up of 16 Länder, each with its own government.","zh":"德国由16个联邦州（Länder）组成，每个州都有自己的政府。"},{"en":"Education policy is mainly decided by the Länder, not the federal government.","zh":"教育政策主要由各联邦州（Länder）决定，而不是联邦政府。"}]}],"synonyms":["German states","federal states (of Germany)"],"phonetic":"/ˈlɛndɚ/","extraExplanation":["“Laender”是把德语字母“ä”用“ae”替代的写法，常见于不方便输入变音符号（umlaut）的场景；标准拼写是“Länder”。","在英语新闻与学术写作里，“the Länder”常作为专有概念使用，指德国的州一级行政区，类似于美国的states，但权力分配与历史背景不同。"]}
{"word":"laeotropic","summary":{"en":"Laeotropic describes an organism’s tendency to turn or grow to the left in response to a stimulus.","zh":"Laeotropic 指生物体在刺激作用下呈现“向左转/向左生长”的倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Turning or bending to the left in response to a stimulus (such as light, gravity, touch, or chemicals).","zh":"（受光、重力、触碰、化学物质等刺激影响而）向左转向或弯曲的。"},"examples":[{"en":"In this experiment, the roots showed a laeotropic response, curving slightly to the left of the vertical line.","zh":"在这个实验中，根表现出向左的向性反应，稍微偏离垂直线向左弯曲。"},{"en":"The researcher recorded whether the plant’s growth was laeotropic or dextrotropic under the same conditions.","zh":"研究人员记录了在相同条件下植物的生长是向左转（laeotropic）还是向右转（dextrotropic）。"}]}],"synonyms":["left-turning","leftward-bending","levotropic (in some contexts)"],"phonetic":"/ˌliːoʊˈtrɑːpɪk/","extraExplanation":["“laeo-”来自拉丁语 laevus（意为“左”），“-tropic”来自希腊语 tropos（意为“转向、方向”）。因此 laeotropic 字面意思就是“向左转的”。","这是一个相当专业、偏生物学/植物学的词，日常英语中很少用。更常见的相关表达是 *leftward bending/turning*（向左弯/转）。","常与反义词 **dextrotropic**（向右转向的）成对出现；在一些学科里也可能看到 **levotropic/levotropism** 这类“向左”的近义构词，但具体用法会随领域而异。"]}
{"word":"laeotropism","summary":{"en":"Laeotropism means growth or turning toward the left in response to a stimulus.","zh":"laeotropism 指生物（尤指植物）对刺激产生的“向左”生长或转向的向性反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a growth movement in a plant (or other organism) that turns or grows toward the left side, usually in response to a stimulus such as gravity or touch","zh":"（植物等对刺激的）向左转向/向左生长的向性反应（常由重力、触碰等刺激引起）"},"examples":[{"en":"Some climbing vines show laeotropism as their shoots twist in a leftward direction.","zh":"一些攀援藤本植物会表现出向左性，嫩梢会向左方向缠绕生长。"},{"en":"In this experiment, the seedlings displayed laeotropism when the stimulus was applied from one side.","zh":"在这个实验中，当刺激从一侧施加时，幼苗表现出向左性反应。"}]}],"synonyms":["laevotropism","levotropism","leftward tropism"],"phonetic":"/ˌliːoʊˈtroʊpɪzəm/","extraExplanation":["“laeo- / laevo-”源自拉丁语，表示“左”；“tropism（向性）”指生物对外界刺激产生的定向生长或转向反应。","该词在日常英语中很少使用，生物学写作里更常见的拼写是 **laevotropism**，也可见到 **levotropism**（同义）。"]}
{"word":"laeotropous","summary":{"en":"Laeotropous describes left-turning (counterclockwise) twisting or growth, mainly in botanical contexts.","zh":"laeotropous 指“向左（逆时针）旋转/扭转的”，主要用于植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Turning or spiraling to the left (counterclockwise), especially describing the direction of twisting or growth in plants.","zh":"向左（逆时针）扭转或旋转的；尤用于描述植物生长或器官扭曲的方向。"},"examples":[{"en":"The vine showed a laeotropous twist as it climbed the support.","zh":"这株藤蔓沿着支架攀爬时呈现出向左（逆时针）的缠绕。"},{"en":"Some plant structures may be described as laeotropous or dextrotropous depending on the spiral direction.","zh":"某些植物结构会根据螺旋方向被描述为向左旋（laeotropous）或向右旋（dextrotropous）。"}]}],"synonyms":["left-twisting","sinistral"],"phonetic":"/ˌliːəˈtroʊpəs/","extraExplanation":["词源提示：laeo- 来自拉丁语 laevus（“左”），-tropous 与“转向/转动”有关（可联想 tropism“向性”）。因此 laeotropous 字面意思就是“向左转的”。","使用场景：这是偏专业的植物学/形态学用词，多用于描述缠绕、扭曲或螺旋生长的“方向”，日常英语中很少见。"]}
{"word":"laertes","summary":{"en":"Laertes is a major character in Shakespeare’s Hamlet: Polonius’s son and Ophelia’s brother, who seeks revenge.","zh":"Laertes（雷欧提斯）是莎士比亚《哈姆雷特》中的重要角色：波洛涅斯之子、奥菲莉娅之兄，因复仇而推动关键情节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Shakespeare’s Hamlet) the son of Polonius and brother of Ophelia; a young nobleman who seeks revenge for his father’s death.","zh":"（莎士比亚《哈姆雷特》中）波洛涅斯之子、奥菲莉娅之兄；一位年轻贵族，为父亲之死寻求复仇。"},"examples":[{"en":"In Hamlet, Laertes returns from France furious about Polonius’s death.","zh":"在《哈姆雷特》中，雷欧提斯从法国归来，因为波洛涅斯之死而怒不可遏。"},{"en":"Laertes challenges Hamlet to a duel, which becomes a key turning point in the tragedy.","zh":"雷欧提斯向哈姆雷特发起决斗，这成为悲剧的重要转折点。"}]}],"synonyms":["a character in Hamlet","Polonius’s son","Ophelia’s brother"],"phonetic":"/leɪˈɝːtiːz/","extraExplanation":["“Laertes”是专有名词，通常不翻译含义，而是音译为“雷欧提斯/莱尔提斯”等；不同译本拼写与译名可能略有差异。","人物关系与剧情要点：他是波洛涅斯与奥菲莉娅的亲人，起初强调“荣誉/家族”，后来在复仇情绪下被国王克劳狄斯利用，参与“下毒剑/下毒酒”的阴谋，最终在结局中与哈姆雷特共同走向悲剧。","理解这个名字有助于抓住《哈姆雷特》中“复仇与操控”的主题：他与哈姆雷特都失去父亲并想复仇，但处理方式更冲动，形成对照。"]}
{"word":"laestrygones","summary":{"en":"Laestrygones are mythical cannibal giants from Homer’s *Odyssey*.","zh":"Laestrygones 指荷马《奥德赛》中出现的食人巨人族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Greek mythology) The Laestrygones: a race of cannibal giants in Homer’s *Odyssey* who attack Odysseus and destroy most of his ships.","zh":"（希腊神话）拉厄斯特律戈涅斯族：荷马《奥德赛》中出现的一群食人巨人，袭击奥德修斯并毁掉他的大部分船只。"},"examples":[{"en":"In Homer’s *Odyssey*, the Laestrygones ambush Odysseus’s fleet and smash the ships with rocks.","zh":"在荷马《奥德赛》中，拉厄斯特律戈涅斯族伏击奥德修斯的船队，用巨石砸毁船只。"},{"en":"The novel uses “Laestrygones” as a symbol of brutal, inhuman violence.","zh":"这部小说用“拉厄斯特律戈涅斯族”来象征残酷、非人性的暴力。"}]}],"synonyms":["Laestrygonians","cannibal giants (mythic)"],"phonetic":"/lɪˈstrɪɡoʊniːz/","extraExplanation":["该词常见于文学与文化引用：它原本是《奥德赛》第十卷中一段著名冒险的“怪物部族”名称。英语里也常用更常见的形式 **Laestrygonians** 指同一族群。","现代文学中也偶尔借用这一名称作隐喻，表示“吞噬性/掠夺性的人群或力量”（例如用来形容战争、暴民、或极端残暴的压迫者）。"]}
{"word":"laet","summary":{"en":"Laet is a rare/dialect spelling of “let,” meaning “allow/permit.”","zh":"laet 是较少见的方言/古拼写，通常等同于 let，表示“允许/准许”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots, Northern English, or archaic spelling) “let”: to allow or permit something; to not prevent it.","zh":"（苏格兰英语/英格兰北部方言或古拼写）相当于 let：允许；准许；不阻止某事发生。"},"examples":[{"en":"In some Scots writing, you may see “laet” where modern English uses “let.”","zh":"在一些苏格兰英语的写作中，你可能会看到用“laet”来表示现代英语的“let”。"},{"en":"Laet the children play outside for a while.","zh":"让孩子们在外面玩一会儿。"},{"en":"Please laet me know if you need help.","zh":"如果你需要帮助，请告诉我。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) to release or let out; to allow something to go free.","zh":"（较少见）放开；释放；放出。"},"examples":[{"en":"He laet the bird go from his hands.","zh":"他把鸟从手中放飞了。"}]}],"synonyms":["let","allow","permit"],"phonetic":"/leɪt/","extraExplanation":["“laet”在当代标准英语里不常用，多见于苏格兰英语（Scots）或较旧的文本中，通常就是“let”的另一种拼写。写正式英语时一般用“let”。","很多学习者会把“laet”和“late（迟到的/晚的）”混淆；两者发音可能相近，但意思完全不同：laet≈let（允许），late（晚/迟到）。"]}
{"word":"laetation","summary":{"en":"Lactation is the process (and time period) of producing milk for breastfeeding after giving birth.","zh":"Lactation 指产后分泌乳汁并进行母乳喂养的过程，也可指哺乳期这段时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the production of milk by a mother’s body after childbirth (or in mammals after giving birth)","zh":"（人或哺乳动物）产后分泌乳汁、哺乳期"},"examples":[{"en":"Many new mothers need support during lactation, especially in the first weeks.","zh":"许多新手妈妈在哺乳期，尤其是最初几周，需要支持。"},{"en":"Stress and lack of sleep can sometimes affect lactation.","zh":"压力和睡眠不足有时会影响泌乳。"}]},{"partOfSpeech":"n.","definition":{"en":"the period of time when a mother is breastfeeding and producing milk","zh":"哺乳期（指正在产奶、喂奶的那段时间）"},"examples":[{"en":"During lactation, she drank more water to stay hydrated.","zh":"在哺乳期，她喝更多水来保持身体水分。"},{"en":"Cows have a high milk yield during peak lactation.","zh":"奶牛在泌乳高峰期产奶量很高。"}]}],"synonyms":["milk production","breastfeeding (related)","nursing (related)"],"phonetic":"/lækˈteɪʃən/","extraExplanation":["你输入的 **laetation** 通常被认为是拼写错误；标准拼写是 **lactation**。","词源来自拉丁语 *lac*（牛奶）相关词根，因此你也会在 **lactose**（乳糖）、**lactic acid**（乳酸）等词里看到相似的拼写。","常见搭配：**breastfeeding and lactation**（母乳喂养与泌乳）、**lactation consultant**（哺乳顾问）、**increase/maintain lactation**（增加/维持泌乳）。"]}
{"word":"laeti","summary":{"en":"Laeti most commonly refers to non-Roman groups settled in the Roman Empire in exchange for military service; it can also be Latin for “happy/joyful” (plural).","zh":"Laeti 最常指罗马帝国境内以服兵役换取定居的外来社群；它也可能是拉丁语中“快乐的/欢欣的”（复数形式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman history) Groups of non-Roman peoples settled within the Roman Empire under an agreement to provide military service (plural noun).","zh":"（罗马史）“拉埃提”（Laeti）：被安置在罗马帝国内、以提供兵役为条件换取居住与土地的外来族群/社群（复数名词）。"},"examples":[{"en":"The Roman army sometimes recruited soldiers from the laeti living inside imperial borders.","zh":"罗马军队有时会从居住在帝国境内的拉埃提中征募士兵。"},{"en":"Some historians discuss the laeti as part of Rome’s changing border policy.","zh":"一些历史学者把拉埃提视为罗马边境政策变化的一部分来讨论。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Latin) A plural form meaning “happy, joyful,” used in Latin texts (not a common modern English word).","zh":"（拉丁语）复数形式，意为“快乐的、欢欣的”，见于拉丁文本（现代英语中不常用）。"},"examples":[{"en":"In Latin, laeti can describe people who are joyful after good news.","zh":"在拉丁语里，laeti 可用来形容听到好消息后欢欣的人们。"},{"en":"You may see laeti in older mottos or inscriptions written in Latin.","zh":"你可能会在较古老的格言或铭文（拉丁文）里看到 laeti。"}]}],"synonyms":["foederati (related term)","settler-recruits (explanatory)"],"phonetic":"ˈleɪtaɪ","extraExplanation":["在英语史学写作中，Laeti 往往以大写出现（作为专门历史术语），其概念常与“foederati（盟军/同盟部落）”一起被比较：两者都涉及“以军事义务换取定居”，但具体法律地位与安排在不同地区与时期可能不一样。","如果你是在读古典文献或看到铭文中的 laeti，它更可能是拉丁语形容词 laetus（快乐的）的复数形式；而在读罗马史（特别是晚期帝国军制、边防与移民安置）时，则更可能是历史术语 Laeti。"]}
{"word":"laetic","summary":{"en":"Laetic is a rare adjective meaning “joyful” or “glad.”","zh":"laetic 是一个罕见的形容词，意思是“快乐的、喜悦的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) joyful; showing happiness or gladness.","zh":"（罕见/古旧）快乐的；喜悦的；显得高兴的。"},"examples":[{"en":"Her laetic smile made everyone feel welcome.","zh":"她那喜悦的微笑让每个人都感到受欢迎。"},{"en":"The poem ends on a laetic note, turning sorrow into hope.","zh":"这首诗以欢欣的基调收尾，把悲伤转化为希望。"}]}],"synonyms":["joyful","glad","happy","elated","gleeful"],"phonetic":"/liːˈɛtɪk/","extraExplanation":["“laetic”很少见，多出现在较古旧或文学化的语境里，来源与拉丁语词根 *laet-*（意为“快乐、喜悦”）有关（也见于 *laetitia* “喜悦/欢乐”）。","注意不要和常见词 **lactic**（“乳酸的”）混淆：*lactic acid* = “乳酸”。如果你原本想查的是 **lactic**，告诉我，我可以给你那一条的详细释义与例句。"]}
{"word":"laetig","summary":{"en":"“Laetig” is not a standard English word; it is likely a misspelling (often of “lactic” or “latex”).","zh":"“laetig”不是标准英语词，更可能是拼写错误（常见可能是“lactic/乳酸的”或“latex/乳胶”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of another word (commonly “lactic” or “latex,” depending on context).","zh":"不是标准英语单词，更可能是其他单词的拼写错误（常见可能是 “lactic / 乳酸的” 或 “latex / 乳胶”，取决于语境）。"},"examples":[{"en":"I couldn’t find “laetig” in an English dictionary—did you mean “lactic”?","zh":"我在英语词典里找不到 “laetig”——你是不是想写 “lactic（乳酸的）”？"},{"en":"If you’re talking about gloves or paint, you may mean “latex,” not “laetig.”","zh":"如果你在说手套或涂料，你可能想写的是 “latex（乳胶）”，而不是 “laetig”。"}]}],"phonetic":"N/A","extraExplanation":["“laetig”在英语中不常见，也不是通用拼写。你可以告诉我它出现的句子或领域（例如：生物/化学/医学/材料/人名/地名），我就能更准确判断你想查的词。","常见的相近目标词：\n- lactic（乳酸的）：常见于“lactic acid（乳酸）”“lactic fermentation（乳酸发酵）”。\n- latex（乳胶）：常见于“latex gloves（乳胶手套）”“latex paint（乳胶漆）”。","如果这是来自德语/其他语言的词（比如人名或品牌），也可能需要按原语言来解释与发音。"]}
{"word":"laetrile","summary":{"en":"Laetrile is a disputed alternative cancer remedy derived from amygdalin, lacking proven benefit and carrying a risk of cyanide poisoning.","zh":"Laetrile 是一种源自苦杏仁苷的争议性替代抗癌疗法，疗效缺乏证据且可能导致氰化物中毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a controversial alternative “cancer treatment” made from amygdalin (a compound found in apricot kernels and some other fruit seeds), not proven effective and potentially dangerous because it can produce cyanide in the body","zh":"一种有争议的替代“抗癌疗法”，来源于苦杏仁苷（存在于杏核及部分水果种子中的化合物）；疗效未被证实，且可能在体内产生氰化物而有危险"},"examples":[{"en":"Laetrile was promoted as a natural cure for cancer, but major medical studies did not support it.","zh":"Laetrile 曾被宣传为“天然抗癌疗法”，但主要医学研究并不支持其疗效。"},{"en":"Doctors warned that laetrile can cause cyanide poisoning, especially when taken by mouth.","zh":"医生警告说，laetrile 可能导致氰化物中毒，尤其是口服时风险更高。"}]}],"synonyms":["amygdalin (often discussed as related, though not identical in all contexts)","so-called “vitamin B17” (marketing term)"],"phonetic":"/ˈleɪtrəl/","extraExplanation":["Laetrile 常出现在 20 世纪美国“替代疗法/自然疗法”相关讨论中，社会争议点主要在于：宣称抗癌效果但缺乏可靠临床证据，以及潜在毒性风险。","它与 amygdalin（苦杏仁苷）关系密切；不少宣传会把它与“维生素 B17”混用，但“B17”并不是被医学界承认的维生素名称。","不同国家和地区对其销售与使用的监管差异较大；在阅读英文资料时，注意区分‘marketing claims（营销宣称）’与‘clinical evidence（临床证据）’。"]}
{"word":"laevigate","summary":{"en":"Laevigate means to grind something into a very fine, smooth powder/paste, or to make a surface smooth by rubbing.","zh":"Laevigate 指把物质研磨得非常细、细匀（常成粉末或糊），也可指通过摩擦使表面光滑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(especially in pharmacy) to grind a substance into a very fine powder, often by rubbing it with a liquid to make a smooth paste.","zh":"（尤指药学中）把物质研磨成极细的粉末；常指加少量液体研磨，使其成为细腻均匀的糊状物。"},"examples":[{"en":"The pharmacist laevigated the ointment ingredients to remove any gritty texture.","zh":"药剂师把软膏成分仔细研磨，使其不再有颗粒感。"},{"en":"Laevigate the pigment with a little oil before adding it to the paint.","zh":"先用少量油把颜料研磨细匀，再加入涂料里。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something smooth by gentle rubbing or polishing.","zh":"通过轻柔摩擦或抛光使某物变得光滑。"},"examples":[{"en":"The stone surface was laevigated by years of water flow.","zh":"石头表面因多年流水冲刷而变得光滑。"}]}],"synonyms":["grind","pulverize","triturate","smooth","polish"],"phonetic":"/ˈlɛvəˌɡeɪt/","extraExplanation":["该词较少见，多用于药学/化学或较正式的书面语。词源来自拉丁语“laevis”（光滑的），因此既可指“研磨得很细”，也可引申为“使表面光滑”。在现代英语中，更常见的同义表达是“grind (into a fine powder)”“triturate”（更偏专业）或“smooth/polish”。"]}
{"word":"laevigrada","summary":{"en":"Laevigrada means “left-spiraling/left-handed,” mainly used in biological descriptions (often written as laevigrade).","zh":"Laevigrada 指“向左螺旋/左旋”，主要用于生物学描述（更常写作 laevigrade）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, taxonomy) Twisting or spiraling to the left; left-handed (the reverse of dextrigrade).","zh":"（生物学/分类学）向左扭转或螺旋生长的；左旋的（与右旋 dextrigrade 相对）。"},"examples":[{"en":"A laevigrada shell coils to the left when you look at it from the apex.","zh":"从壳顶看，laevigrada（左旋）贝壳会向左盘旋。"},{"en":"Some snails show laevigrada coiling, which is rarer than right-handed coiling.","zh":"有些蜗牛呈现 laevigrada（左旋）盘旋，这比右旋更少见。"},{"en":"The vine was described as laevigrada, wrapping counterclockwise around the support.","zh":"这株藤被描述为 laevigrada（左旋），它逆时针缠绕在支架上。"}]}],"synonyms":["sinistral","left-handed","laevigrade"],"phonetic":"/ˌliːvɪˈɡreɪdə/","extraExplanation":["“laevigrada”常见于较旧或较偏拉丁化的分类学描述中；现代英文文献里更常写作 **laevigrade**。","词源来自拉丁语 **laevus**（左）+ **-grade/-grada**（行走/方向、倾向），用来表示“朝左的旋向/倾向”。","在软体动物（如蜗牛、贝类）的壳形描述中，左旋常与 **sinistral** 同义；对应的右旋是 **dextral / dextrigrade**。"]}
{"word":"laevo","summary":{"en":"Laevo is a rare, technical word/root meaning “left” or “toward the left,” mainly used in anatomy and chemistry.","zh":"Laevo 是一个较罕见的技术性词/词根，意为“左（侧）/向左”，主要见于解剖学与化学术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; mainly scientific/anatomical) Left; relating to the left side.","zh":"（罕见；主要用于科学/解剖语境）左边的；与左侧有关的。"},"examples":[{"en":"The laevo atrium is another term sometimes used for the left atrium of the heart.","zh":"“laevo atrium”有时被用来指心脏的左心房。"},{"en":"The report describes a laevo rotation of the structure, meaning it turns to the left.","zh":"报告描述该结构发生了“laevo rotation”（左旋），意思是向左转动。"}]},{"partOfSpeech":"other","definition":{"en":"A combining form meaning “to the left,” seen in technical terms (e.g., laevorotation/laevo-).","zh":"表示“向左”的构词成分，常见于技术术语中（如 laevorotation/laevo-）。"},"examples":[{"en":"Laevorotation (laevo- + rotation) means turning to the left.","zh":"Laevorotation（laevo- + rotation）表示向左旋转。"},{"en":"In chemistry, laevo- may describe a substance that rotates polarized light to the left.","zh":"在化学中，laevo-可用来描述使偏振光向左旋转的物质。"}]}],"synonyms":["left","sinistral","levorotatory"],"phonetic":"/ˈliːvoʊ/","extraExplanation":["“laevo- / laev-”来自拉丁语 laevus（左边的）。现代英语更常用 left；在医学与化学里才会看到这种拉丁词根（如 levorotatory/levorotation）。","有时你会看到拼写差异：laevo- 与 levo- 多为同源变体；日常英语基本不用“laevo”单独成词。"]}
{"word":"laevoduction","summary":{"en":"Laevoduction means movement of the eye(s) to the left (leftward gaze).","zh":"Laevoduction 指眼球（或双眼）向左转动，即左向注视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine, especially ophthalmology) Movement of the eye(s) to the left; leftward gaze.","zh":"（医学，尤指眼科）眼球（或双眼）向左转动；左向注视。"},"examples":[{"en":"The patient showed limited laevoduction, suggesting weakness of the muscles that move the eyes leftward.","zh":"病人的左向注视（laevoduction）受限，提示负责向左转动眼球的肌肉可能无力。"},{"en":"During the exam, the doctor asked her to perform laevoduction and dextroduction.","zh":"检查时，医生让她做向左看（laevoduction）和向右看（dextroduction）。"}]}],"synonyms":["leftward gaze","left gaze","levoversion","laevoversion"],"phonetic":"/ˌliːvoʊˈdʌkʃən/","extraExplanation":["这个词比较少见，多见于眼科或神经系统查体记录。词根来自拉丁语：laevo- 表示“左”，-duction 表示“引导/移动”。临床上也常用更常见的说法如 left gaze（左向凝视）或 levoversion（左向共同转动）。"]}
{"word":"laevogyrate","summary":{"en":"Laevogyrate describes a substance that rotates polarized light to the left (counterclockwise).","zh":"Laevogyrate 指能使偏振光向左（逆时针）旋转的物质，即“左旋的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance, especially in chemistry) able to rotate plane‑polarized light to the left (counterclockwise) when viewed toward the light source; levorotatory.","zh":"（尤指化学中的物质）能使平面偏振光向左（逆时针）旋转的；左旋的。"},"examples":[{"en":"This sugar solution is laevogyrate, so it rotates polarized light to the left.","zh":"这种糖溶液是左旋的，所以会使偏振光向左旋转。"},{"en":"The laevogyrate form and the dextrorotate form are mirror images called enantiomers.","zh":"左旋形式与右旋形式互为镜像，被称为对映体（对映异构体）。"}]}],"synonyms":["levorotatory","left-rotating"],"phonetic":"/ˌliːvoʊˈdʒaɪreɪt/","extraExplanation":["词源：来自拉丁语 laevus（左）+ gyrate（旋转）。在实验中常用旋光仪（polarimeter）测量旋光方向与旋光度。注意：laevogyrate 描述的是“光学旋转方向”，不一定等同于分子构型的 D/L 或 R/S 标记。"]}
{"word":"laevogyre","summary":{"en":"Laevogyre means “left-rotating,” especially a substance that turns polarized light to the left (levorotatory).","zh":"laevogyre 指“左旋的”，尤指能使偏振光向左旋转的物质（左旋光学活性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chemistry/physics) Rotating the plane of polarized light to the left (counterclockwise when viewed toward the light source); levorotatory.","zh":"（化学/物理）使偏振光的偏振面向左旋转（从观察者朝光源方向看为逆时针）；左旋的。"},"examples":[{"en":"Fructose is laevogyre, so it rotates polarized light to the left.","zh":"果糖是左旋的，因此会使偏振光向左旋转。"},{"en":"The sample was described as laevogyre after its optical rotation was measured.","zh":"测得其旋光度后，该样品被描述为左旋的。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance that is laevogyre (one that rotates polarized light to the left).","zh":"左旋物质；能使偏振光向左旋转的物质。"},"examples":[{"en":"The mixture contained both laevogyres and dextrogyres.","zh":"该混合物同时含有左旋物质和右旋物质。"}]}],"synonyms":["levogyre","levorotatory","left-rotating","sinistral"],"phonetic":"/ˌlivəˈdʒaɪr/","extraExplanation":["“laevogyre”也常拼作“levogyre”。词源来自拉丁语 *laevus*（左）+ *-gyre*（旋转）。\n在化学里，这个词常与“optical rotation / 旋光度”一起出现：若把偏振光从你所在位置“朝光源方向”看过去，偏振面向逆时针方向转动，就称为 laevogyre（左旋、左旋光学活性）。\n注意它描述的是“旋光方向”，不一定等同于分子的绝对构型（如 R/S），两者不能简单一一对应。"]}
{"word":"laevogyrous","summary":{"en":"Laevogyrous means left-turning or counterclockwise; in science it can describe substances that rotate polarized light to the left.","zh":"Laevogyrous 指“向左旋/逆时针”；在科学语境中也可指使偏振光向左旋转的物质（左旋性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Turning or spiraling to the left; counterclockwise (as viewed from the observer’s perspective).","zh":"向左旋转的；逆时针方向的（以观察者视角为准）。"},"examples":[{"en":"The vine grows in a laevogyrous spiral as it climbs the pole.","zh":"这株藤蔓沿着杆子向上攀爬时呈现左旋（逆时针）的螺旋生长。"},{"en":"In the diagram, the arrow shows a laevogyrous rotation of the gear.","zh":"在图示中，箭头表示齿轮做左旋（逆时针）转动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/physics) Rotating plane-polarized light to the left; levorotatory.","zh":"（化学/物理）使偏振光的偏振面向左旋转的；左旋光学活性的（即左旋性、左旋转）。"},"examples":[{"en":"This solution is laevogyrous, so it rotates polarized light to the left.","zh":"这种溶液具有左旋性，会使偏振光向左旋转。"},{"en":"Laevogyrous substances are often labeled with a minus sign (−) for optical rotation.","zh":"左旋物质的旋光度常用负号（−）标注。"}]}],"synonyms":["counterclockwise","anticlockwise","left-turning","levorotatory"],"phonetic":"/ˌliːvəˈdʒaɪrəs/","extraExplanation":["词源上由 laevo-（“左”）+ -gyrous（“旋转的”）构成，多见于较正式或专业语境，如生物形态（螺旋、贝壳）与光学旋光（相当于 levorotatory）。","方向判断可能因视角不同而混淆：在科学描述里通常会说明“从观察者看去”或用更明确的“counterclockwise/anticlockwise”。"]}
{"word":"laevolactic","summary":{"en":"A chemistry term meaning the left-rotating (levo-) form of lactic acid; often referring to L-lactic acid in older usage.","zh":"化学术语，指乳酸的左旋（levo-）形式；旧用法中常指 L-乳酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the left-rotating (levorotatory) form of lactic acid; another way to refer to the L-form of lactic acid in chemistry.","zh":"（化学）指乳酸的左旋（使偏振光向左旋转）形式；也常用来指乳酸的 L-型（构型）。"},"examples":[{"en":"In some older textbooks, you may see “laevolactic acid” used for the L-form of lactic acid.","zh":"在一些较旧的教材里，你可能会看到用“laevolactic acid”来指乳酸的 L-型。"},{"en":"The lab report compared laevolactic and dextralactic forms by measuring optical rotation.","zh":"实验报告通过测量旋光度来比较左旋乳酸与右旋乳酸两种形式。"}]}],"synonyms":["levolactic","levorotatory (in context)","L-lactic (in context)"],"phonetic":"/ˌliːvoʊˈlæk.tɪk/","extraExplanation":["“laevo-”是较旧或偏英式的拼写，对应更常见的“levo-”。两者都表示“左旋/左向”。","在现代生物化学语境中，更常见的说法是“L-lactic acid（L-乳酸）”。但要注意：L/D（构型）与 levo/dextro（旋光方向，+/−）是不同的概念，虽然在某些物质上会对应，但不能一概而论。","“laevolactic”本身较少单独出现，更多见于“laevolactic acid（左旋乳酸）”这种搭配。"]}
{"word":"laevorotation","summary":{"en":"Laevorotation means leftward rotation, especially describing the heart’s orientation in medical contexts.","zh":"Laevorotation 指向左旋转，常用于医学语境中描述心脏等器官的朝向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a leftward (counterclockwise) rotation of an organ or body part, especially the heart’s position or axis","zh":"（器官或身体部位的）左旋、向左旋转；尤指心脏位置或心轴的左向旋转"},"examples":[{"en":"The chest X-ray suggested laevorotation of the heart.","zh":"胸部X光提示心脏可能存在左旋。"},{"en":"The report describes mild laevorotation without other major abnormalities.","zh":"报告描述为轻度左旋，未见其他明显异常。"}]}],"synonyms":["levorotation","leftward rotation","counterclockwise rotation"],"phonetic":"/ˌlivəroʊˈteɪʃən/","extraExplanation":["“laevorotation”多见于英式/医学写法，也常写作“levorotation”（更常见于美式拼写）。词根来源于拉丁语：laevus/lev-（左）+ rotation（旋转）。","在医学影像或体格描述中，它通常是“方向性描述”，不一定代表疾病本身；需要结合症状、体检与其他检查综合判断。"]}
{"word":"laevorotatory","summary":{"en":"Laevorotatory describes something that rotates polarized light to the left (counterclockwise).","zh":"laevorotatory 指能使偏振光向左（逆时针）旋转的“左旋的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance) causing the plane of polarized light to rotate to the left (counterclockwise) as it passes through the substance.","zh":"（指物质）使偏振光的偏振面向左（逆时针）旋转的；左旋的。"},"examples":[{"en":"This sugar solution is laevorotatory, so it rotates polarized light to the left.","zh":"这种糖溶液是左旋的，因此会使偏振光向左旋转。"},{"en":"The laevorotatory form and the dextrorotatory form can have different biological effects.","zh":"左旋体和右旋体可能具有不同的生物学效应。"}]},{"partOfSpeech":"n.","definition":{"en":"a laevorotatory substance or form (one that rotates polarized light to the left).","zh":"左旋物质；左旋体（使偏振光向左旋转的物质或形式）。"},"examples":[{"en":"The lab compared a laevorotatory with its mirror-image counterpart.","zh":"实验室将一种左旋体与它的镜像对应体进行了比较。"}]}],"synonyms":["levorotatory","left-rotating"],"phonetic":"/ˌliːvoʊˈroʊtəˌtɔːri/","extraExplanation":["“laevo-”来自拉丁语 laevus（左），在较旧或英式科学写法中常见（也常拼作 levorotatory）。对应词是 “dextrorotatory”（右旋）。\n注意：左/右旋描述的是对偏振光的旋光方向，不一定与分子构型（如 R/S 或 D/L 命名）直接等同。"]}
{"word":"laevotartaric","summary":{"en":"Laevotartaric means the left-rotating (levorotatory) form of tartaric acid in chemistry.","zh":"laevotartaric 指化学中酒石酸的左旋（左旋光学活性）形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to the levorotatory (left-rotating) form of tartaric acid; specifically, the stereoisomer that rotates plane-polarized light to the left (often called L-(+)-tartaric acid or naturally occurring tartaric acid in grapes).","zh":"（化学）指酒石酸的左旋（使偏振光向左旋转）形式；特指能使平面偏振光向左旋转的酒石酸立体异构体（常与天然存在于葡萄中的酒石酸相关）。"},"examples":[{"en":"In the lab, we compared laevotartaric acid with its mirror-image isomer.","zh":"在实验室里，我们比较了左旋酒石酸和它的镜像异构体。"},{"en":"Some textbooks describe laevotartaric acid as the naturally occurring form found in grapes and wine.","zh":"一些教材把左旋酒石酸描述为葡萄和葡萄酒中天然存在的形式。"}]}],"synonyms":["levotartaric","(−)-tartaric","laevo-tartaric"],"phonetic":"/ˌliːvoʊ tɑrˈtɛrɪk/","extraExplanation":["“laevo-”来自拉丁语，表示“左”。“laevotartaric”是较旧或较少见的写法/术语，现代更常见的说法是“levotartaric acid”或直接写“(−)-tartaric acid”（用“−”表示使偏振光左旋）。","注意：左旋/右旋（levorotatory/dextrorotatory）描述的是“旋光方向”，不一定与“L/D”构型标记一一对应；不同体系（旋光符号±、R/S、D/L）含义不同，阅读化学资料时要看清采用的是哪种标记。"]}
{"word":"laevoversion","summary":{"en":"Laevoversion means leftward turning or twisting, used mainly in technical/scientific contexts.","zh":"Laevoversion 指“向左转动/扭转（左旋）”，主要见于技术或科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, technical) A turning or twisting to the left; leftward rotation or spiral direction.","zh":"（少见，技术用语）向左的转动或扭转；左旋方向。"},"examples":[{"en":"The vine showed laevoversion as it climbed the pole, twisting counterclockwise.","zh":"这株藤蔓沿着杆子攀爬时呈现左旋，逆时针方向缠绕。"},{"en":"In the lab notes, the sample was described as having laevoversion under polarized light.","zh":"在实验记录中，该样品被描述为在偏振光下呈左旋。"}]}],"synonyms":["leftward rotation","left-handed twist","counterclockwise twist","levorotation (related)"],"phonetic":"/ˌliːvoʊˈvɝːʒən/","extraExplanation":["词源上可拆为 laevo-（拉丁语“左”）+ version（“转向/旋转”）。在科学语境里，它常被用来泛指“向左旋转/左手性”的现象。","相关但更常见的词：levorotation（左旋光性，尤指使偏振光向左旋转）；dextral/right-handed（右旋/右手性）与其相对。"]}
{"word":"laevulin","summary":{"en":"Laevulin is an uncommon spelling of levulin, usually referring to levulinic acid or related chemicals.","zh":"Laevulin 是 levulin 的少见拼写，通常指乙酰丙酸（levulinic acid）或相关化学物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chemistry) A less common spelling of **levulin**; usually refers to **levulinic acid** or substances derived from it.","zh":"（化学）**levulin** 的较少见拼写；通常指**乙酰丙酸（levulinic acid）**或其衍生物。"},"examples":[{"en":"Levulinic acid is sometimes called **laevulinic acid** in older texts.","zh":"在较早的文献里，levulinic acid 有时会写作 **laevulinic acid**。"},{"en":"The paper discusses a catalyst that converts biomass into levulin/laevulin compounds.","zh":"这篇论文讨论了一种把生物质转化为 levulin/laevulin 化合物的催化剂。"}]}],"synonyms":["levulin","levulinic acid"],"phonetic":"/ˈlɛvjʊlɪn/","extraExplanation":["拼写 **laev-** 来自拉丁语 *laevus*（“左”），早期英语里常用来表示“左旋/向左”的概念（类似 *laevo-*）。现代科学写作中更常见的是 **levulin**（不带 *ae*）。","**levulinic acid（乙酰丙酸）**常见于生物质（如纤维素）转化与绿色化工语境，因此你更可能在化学/材料/能源相关论文中看到这个词。"]}
{"word":"laevulose","summary":{"en":"Laevulose is an old, less common term for fructose (fruit sugar).","zh":"Laevulose 是果糖（fructose，果糖/水果糖）的旧称，现较少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older (now uncommon) name for fructose, a naturally occurring sugar found in fruits and honey","zh":"“果糖”的旧称（现在较少用），一种天然存在于水果和蜂蜜中的糖"},"examples":[{"en":"Laevulose is another name for fructose in older chemistry texts.","zh":"在较早的化学教材里，laevulose 是 fructose（果糖）的另一种叫法。"},{"en":"Fruits contain laevulose (fructose), which tastes sweeter than glucose.","zh":"水果含有 laevulose（果糖），其甜度通常比葡萄糖更高。"}]}],"synonyms":["fructose","fruit sugar","levulose"],"phonetic":"/ˈliːvjʊˌloʊs/","extraExplanation":["“Laevulose/levulose” 这个名称来自它的旋光性：它能使偏振光向左旋转（laevo- = left）。不过要注意：左旋/右旋（旋光方向）不一定等同于分子构型里的 D/L 标记。","现代营养学与食品标签中一般用更常见的名称 “fructose（果糖）”，所以在阅读新资料时几乎不会看到 laevulose；它更常出现在旧文献或历史性的化学写法里。"]}
{"word":"laewe","summary":{"en":"“Leave” most commonly means to go away/depart, or to let something stay; as a noun, it can mean official time off.","zh":"“Leave” 最常见意思是“离开/走开”，也可表示“留下（不带走）”；作名词时可指“准假/休假”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to go away from a place; to depart","zh":"离开；出发"},"examples":[{"en":"I have to leave now because it’s getting late.","zh":"我现在得走了，因为太晚了。"},{"en":"She left the office at 6 p.m.","zh":"她下午六点离开了办公室。"}]},{"partOfSpeech":"v.","definition":{"en":"to allow something to remain; not take it with you","zh":"留下；不带走"},"examples":[{"en":"Please leave your shoes by the door.","zh":"请把鞋子放在门口。"},{"en":"Don’t leave your phone on the table.","zh":"别把手机落在桌上。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop doing or using something; to quit","zh":"停止；戒掉；退出"},"examples":[{"en":"He decided to leave his job and study full-time.","zh":"他决定辞职，全职学习。"},{"en":"She’s trying to leave sugar out of her diet.","zh":"她正努力在饮食中戒糖。"}]},{"partOfSpeech":"n.","definition":{"en":"permission to be absent from work or duty","zh":"准假；休假许可"},"examples":[{"en":"The soldier was granted two weeks of leave.","zh":"这名士兵获准休假两周。"},{"en":"I need to apply for parental leave.","zh":"我需要申请育儿假。"}]}],"synonyms":["depart","go","exit","quit","let","allow","remain"],"phonetic":"/liv/","extraExplanation":["“laewe” 不是常见的英文单词拼写；最可能是把 **leave** 拼错了。若你想查的是别的词（比如人名、地名或其他语言的词），可以告诉我上下文（句子/领域），我可以更准确地解释。"]}
{"word":"laewig","summary":{"en":"“Laewig” is not a common English vocabulary word; it’s most likely a surname or a spelling variant.","zh":"“Laewig”不是常见英语词汇；更可能是姓氏或拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often seen as a proper name (a surname) or as a misspelling/variant in names.","zh":"不是标准英语单词。最常见的用法是作为专有名词（姓氏），或在姓名中出现的拼写变体/拼写错误。"},"examples":[{"en":"I couldn’t find “laewig” in an English dictionary; it may be someone’s last name.","zh":"我在英语词典里找不到“laewig”；它可能是某个人的姓。"},{"en":"Could you check the spelling of Laewig on the official document?","zh":"你能在官方文件上核对一下 Laewig 的拼写吗？"}]}],"synonyms":["(proper name; no true synonyms)"],"phonetic":"/ˈleɪwɪɡ/","extraExplanation":["“laewig”看起来更像姓名（姓氏）或打字/拼写错误，而不是英语词汇。如果你想查的是词汇含义，可能你想输入的是：\n- leeward（背风的）\n- Ludwig（常见人名）\n- law-abiding（守法的）\n把你想表达的句子发我，我可以帮你确认最可能的正确拼写与含义。"]}

