{"word":"lafayette","summary":{"en":"Lafayette most commonly refers to the Marquis de Lafayette, a French hero of the American Revolution; it is also a common U.S. place name honoring him.","zh":"Lafayette最常指拉法耶特侯爵（美国独立战争时期的法国英雄）；也常用作美国多地地名，以纪念他。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Marie-Joseph Paul Yves Roch Gilbert du Motier, Marquis de Lafayette (1757–1834): a French nobleman and military officer who helped the American colonists during the American Revolutionary War and later supported liberal reforms in France.","zh":"拉法耶特侯爵（1757–1834）：法国贵族与军官，曾在美国独立战争中支援殖民地军队，后来也支持法国的自由主义改革。"},"examples":[{"en":"Lafayette fought alongside Washington during the American Revolution.","zh":"拉法耶特在美国独立战争中与华盛顿并肩作战。"},{"en":"Many Americans remember Lafayette as a symbol of French support for U.S. independence.","zh":"许多美国人将拉法耶特视为法国支持美国独立的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used in the United States for several cities and areas (e.g., Lafayette, Louisiana; Lafayette, Indiana), often named in honor of Marquis de Lafayette.","zh":"（美国）多个城市和地区的地名（如路易斯安那州拉法叶市、印第安纳州拉法叶市等），多以拉法耶特侯爵命名。"},"examples":[{"en":"She moved to Lafayette, Louisiana for a new job.","zh":"她为了新工作搬到了路易斯安那州的拉法叶市。"},{"en":"Lafayette Square is a well-known park near the White House in Washington, D.C.","zh":"拉法叶广场是华盛顿特区白宫附近著名的公园。"}]}],"synonyms":["Marquis de Lafayette","General Lafayette"],"phonetic":"/ˌlæfiˈɛt/","extraExplanation":["“Lafayette”在英语里通常读作 /ˌlæfiˈɛt/，结尾的 -ette 不像法语那样明显发音成“特”，而更接近“耶特/艾特”的感觉。","拉法耶特侯爵在美国历史叙述中常被称为“America’s favorite fighting Frenchman”（美国人最喜爱的法国战士），体现他在独立战争中的人气与象征意义。"]}
{"word":"Lafayetteism","summary":{"en":"a moderate, constitutional liberal political tendency linked to Lafayette","zh":"与拉法耶特相关的温和宪政自由派倾向"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the political ideas, style, or movement associated with the Marquis de Lafayette, especially moderate constitutional liberalism and support for civil liberties","zh":"与拉法耶特侯爵相关的政治理念、风格或派别，常指温和的宪政自由主义与对公民自由的支持"},"examples":[{"en":"In the early 1800s, some French liberals were described as leaning toward Lafayetteism rather than radical revolution.","zh":"在19世纪初，一些法国自由派被形容为更倾向“拉法耶特主义”，而不是激进革命。"},{"en":"The newspaper criticized Lafayetteism as idealistic but impractical in a time of unrest.","zh":"那家报纸批评“拉法耶特主义”在动荡时期过于理想化、不够务实。"}]}],"synonyms":["constitutionalism","liberalism","moderate reformism"],"phonetic":"/ˌlɑːfiˈɛtɪzəm/","extraExplanation":["拉法耶特（Marquis de Lafayette）在美国独立战争与法国政治中都很有名，常被视为“支持自由与宪政、反对专制但又反对过度激进”的象征。因此 Lafayetteism 往往带有“温和自由派、宪政派”的语感。","这是较少见的历史/政治词，常出现在讨论19世纪法国政治、革命与复辟、以及“温和派 vs. 激进派”的语境中。"],"etymology":"由人名 Lafayette（拉法耶特，法裔贵族与政治人物）+ 后缀 -ism（表示“主义/思潮/倾向”）构成，用来指与其政治立场或追随者相关的思想与作风。","mnemonic":["记 -ism = “主义”：Lafayette + ism → “拉法耶特的那套主义/路线”。","把 Lafayette 联想到“自由、宪政、温和改革”，看到 Lafayetteism 就往“温和自由主义倾向”去记。"]}
{"word":"lafite","summary":{"en":"Lafite refers to the famous Bordeaux wine estate Château Lafite Rothschild and its premium wine.","zh":"Lafite 指法国波尔多名庄“拉菲（Château Lafite Rothschild）”及其高端葡萄酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous French Bordeaux wine estate (Château Lafite Rothschild) and, by extension, its wine; often used as a shorthand for a very high-end bottle of red wine.","zh":"法国波尔多著名酒庄“拉菲（Château Lafite Rothschild）”及其出产的葡萄酒；也常用来指代非常高端、昂贵的红酒。"},"examples":[{"en":"He ordered a bottle of Lafite to celebrate the promotion.","zh":"他点了一瓶拉菲来庆祝升职。"},{"en":"Lafite is often associated with luxury and collecting.","zh":"拉菲常常与奢华和收藏联系在一起。"}]}],"synonyms":["Château Lafite Rothschild"],"phonetic":"/ləˈfiːt/","extraExplanation":["“Lafite”本来是酒庄名称的一部分，完整常见写法是“Château Lafite Rothschild”。日常口语里人们常直接说“Lafite”来指这家酒庄的酒。","读音上英语里常读作“luh-FEET”，重音在后面；中文常译为“拉菲”。","在文化语境中，“拉菲”经常被当作“顶级名酒/身份象征”的代表词使用（尤其在商务宴请、礼品、收藏讨论中）。"]}
{"word":"laft","summary":{"en":"“Laft” is not standard English; it usually means “laughed” (informal), or it may be a typo for “left.”","zh":"“laft”不是标准英语；通常是“laughed（笑了）”的非正式写法，或是把“left”拼错了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/Informal spelling) Past tense of “laugh”; means “laughed.”","zh":"（非标准/非正式拼写）“laugh”的过去式，意思是“笑了/大笑了”。"},"examples":[{"en":"I laft so hard at that video.","zh":"我看那个视频笑到不行。"},{"en":"He laft when he heard the joke.","zh":"他听到笑话就笑了。"}]},{"partOfSpeech":"other","definition":{"en":"(Common typo) Sometimes “laft” is a misspelling of “left” (past tense of “leave,” or the opposite of “right”).","zh":"（常见拼写错误）有时“laft”是把“left”拼错了（“leave”的过去式，或“右”的反义词“左”）。"},"examples":[{"en":"I laft my keys at home. (better: I left my keys at home.)","zh":"我把钥匙落在家里了。（更好：I left my keys at home.）"},{"en":"Turn laft at the corner. (better: Turn left at the corner.)","zh":"在拐角处左转。（更好：Turn left at the corner.）"}]}],"synonyms":["laughed","left"],"phonetic":"/læft/","extraExplanation":["“laft”常见于短信、网络发言或方言化（eye dialect）的写法，用来把口语发音写出来；正式写作中建议用标准拼写“laughed”或“left”。","如果你想查的是“laugh / laughed”还是“left”，告诉我句子语境，我可以帮你确认更准确的词和用法。"]}

