{"word":"lag","summary":{"en":"“Lag” means to fall behind or to experience a delay/slow response (especially in technology).","zh":"“lag”表示“落后/跟不上”，也可指（尤其在科技中）“延迟、卡顿、反应慢”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to be late or fall behind in progress, speed, or development","zh":"落后；滞后；进度或速度跟不上"},"examples":[{"en":"If the Wi‑Fi is weak, the video may lag behind the audio.","zh":"如果无线网络很弱，视频可能会比音频慢半拍。"},{"en":"He missed a week of class and started to lag in math.","zh":"他缺课一周后，数学开始跟不上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something move or happen more slowly than expected; to delay","zh":"使变慢；拖延（使某事落后）"},"examples":[{"en":"Heavy traffic lagged our schedule by nearly an hour.","zh":"拥堵的交通让我们的行程晚了将近一小时。"},{"en":"Don’t let fear lag your decisions.","zh":"别让恐惧拖慢你的决定。"}]},{"partOfSpeech":"n.","definition":{"en":"a delay; a slow response or time gap between actions and results","zh":"延迟；反应慢；时间差（如画面卡顿、输入延迟）"},"examples":[{"en":"There’s a slight lag when I type on this tablet.","zh":"我在这台平板上打字会有一点延迟。"},{"en":"The economy often shows a lag after policy changes.","zh":"政策变化后，经济表现常常会有滞后。"}]}],"synonyms":["fall behind","trail","be behind","delay","slow down","latency"],"phonetic":"/læɡ/","extraExplanation":["在科技语境里，lag 常指“卡顿/延迟”，例如 game lag（游戏延迟/掉帧卡顿）、input lag（输入延迟）、network lag（网络延迟）。在学习或工作语境里，lag behind 更常见，表示“跟不上/落后于”。注意区别：delay 更偏“人为或安排上的推迟”，lag 更强调“反应慢或滞后造成的落后”。"]}
{"word":"lagan","summary":{"en":"Lagan means cargo thrown into the sea but marked to be recovered later.","zh":"Lagan 指被抛入海中但做了标记、准备日后回收的货物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Goods or cargo thrown from a ship into the sea but marked or tied to something (such as a buoy) so they can be found and recovered later.","zh":"（海事用语）从船上抛入海中、但做了标记或系上浮标以便日后打捞回收的货物。"},"examples":[{"en":"The crew threw the barrels overboard as lagan, hoping to recover them after the storm.","zh":"船员把桶抛入海中作为“lagan”，希望风暴过后再打捞回来。"},{"en":"Under maritime law, lagan is different from ordinary shipwreck debris because it is intentionally marked for recovery.","zh":"按海事法来说，lagan 与普通的沉船残骸不同，因为它是故意做了回收标记的。"}]}],"synonyms":["marked jetsam","recoverable cargo (maritime)"],"phonetic":"/ˈlæɡən/","extraExplanation":["这个词主要出现在航海、海事法或历史语境里，日常英语不常用。它常与 flotsam（漂浮物，通常指未刻意标记的漂浮残骸）、jetsam（为减轻船重而抛弃且不打算回收的物品）一起出现，用来区分不同类型的“落海货物/残骸”。"]}
{"word":"lagans","summary":{"en":"“Lagans” is the plural of “lagan”: marked goods thrown overboard to be recovered later.","zh":"“Lagans”是“lagan”的复数：指抛入海中并做标记、打算日后打捞回收的货物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Goods thrown overboard from a ship but marked (often with a buoy) so they can be found and recovered later.","zh":"（海事/海商法）从船上抛入海中但做了标记（常用浮标）以便日后打捞回收的货物。"},"examples":[{"en":"In maritime law, lagan can still belong to the original owner if it is meant to be recovered.","zh":"在海事法律中，如果货物被抛海是为了日后打捞回收，lagan 仍可能归原所有人所有。"},{"en":"The crew tied a buoy to the crates before casting them into the sea, turning them into lagan.","zh":"船员在把箱子抛入海中前先系上浮标，使它们成为 lagan。"}]}],"synonyms":["salvage (context-dependent)","recoverable cargo","marked jetsam (informal/explanatory)"],"phonetic":"/ˈlæɡən/","extraExplanation":["“lagan”的复数是“lagans”。它常与 flotsam（漂浮残骸）、jetsam（为减轻船重而抛弃且通常不打算回收的货物）并列出现，构成海事语境中经典的三分法：flotsam / jetsam / lagan。","词源可追溯到法语（与“放下、搁置”相关的含义），因此它多出现在法律、航海史或文学性描写海难与打捞的语境中。"]}
{"word":"lagarto","summary":{"en":"“Lagarto” is a Spanish word most commonly meaning “lizard,” and in some Latin American slang it can mean a scheming flatterer.","zh":"“Lagarto”是西语，最常见意思是“蜥蜴”；在部分拉美俚语中也可指“爱拍马屁、爱钻营的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a lizard; sometimes used broadly for a reptile like an alligator (context-dependent).","zh":"（西语）蜥蜴；有时也可泛指类似短吻鳄/鳄鱼的爬行动物（取决于语境）。"},"examples":[{"en":"In Spanish, “lagarto” usually means “lizard.”","zh":"在西语里，“lagarto”通常表示“蜥蜴”。"},{"en":"We saw a lagarto sunning itself on a rock.","zh":"我们看到一只蜥蜴（lagarto）在岩石上晒太阳。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin American slang) a person who is overly flattering or scheming to get an advantage; a “brown-noser.”","zh":"（拉美俚语）爱拍马屁、爱钻营以谋取好处的人；“马屁精/钻营者”。"},"examples":[{"en":"He’s such a lagarto—always praising the boss to get ahead.","zh":"他真是个马屁精（lagarto）——总是夸老板来上位。"},{"en":"Don’t be a lagarto; let your work speak for itself.","zh":"别当钻营者（lagarto）；让成果自己说话。"}]}],"synonyms":["lizard","reptile","brown-noser","flatterer","schemer"],"phonetic":"/lɑˈɡɑrtoʊ/","extraExplanation":["“Lagarto”是西班牙语词，在不同国家含义可能会扩展：在多数语境里就是“蜥蜴”；但在部分拉丁美洲地区也可作俚语，形容“爱巴结、爱钻营的人”。如果你是在英文对话或阅读中看到它，通常是借用西语来营造地域/文化氛围（例如描写拉美场景）。"]}
{"word":"lagen","summary":{"en":"“Lagen” is a rare maritime term meaning recoverable cargo intentionally thrown overboard (often marked with a buoy).","zh":"“lagen”是罕见的海事用语，指被有意抛入海中并通常可凭浮标等标记打捞回收的货物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Goods or cargo thrown overboard (usually tied to a buoy) so they can be recovered later; also the legal right to claim such recoverable goods.","zh":"（海事）为减轻船只负担而抛入海中、通常系在浮标上以便日后打捞的货物；也可指对这类可回收漂货的（法律）认领权。"},"examples":[{"en":"In the storm, the crew jettisoned some cargo as lagen so they could retrieve it after the ship was safe.","zh":"暴风雨中，船员把一部分货物作为 lagen 抛入海中，以便船只安全后再打捞。"},{"en":"Under maritime law, the finder must report lagen instead of keeping it.","zh":"按海事法，发现 lagen 的人必须上报，而不能私自占有。"}]}],"synonyms":["lagan","jetsam (related)","flotsam (related)"],"phonetic":"/ˈlæɡən/","extraExplanation":["“lagen”常被视为“lagan”的另一种拼写，属于较少见的海事用语，多出现在航海史、海商法或海难记录中。与之相关的词还有：jetsam（被抛弃且通常不打算回收的漂货）和 flotsam（自然漂浮的残骸/漂浮物）。","词源上来自古法语/中世纪拉丁语体系，和“to lie（躺）”无关；在现代日常英语中很少使用。"]}
{"word":"lagena","summary":{"en":"Lagena is a rare word meaning a flask or bottle, and it can also refer to a bottle-shaped structure in biology (including a part of the inner ear in birds/reptiles).","zh":"Lagena 是个较少见的词，意思是“细颈瓶/酒瓶”；在生物学中也可指“瓶状结构”，包括鸟类/部分爬行动物内耳中的 lagena。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flask or bottle (especially an ancient Roman/Latin term for a wine bottle or container).","zh":"（尤指古罗马语境中的）瓶、细颈瓶、酒瓶。"},"examples":[{"en":"Archaeologists found a small lagena used to store wine.","zh":"考古学家发现了一个用来储存葡萄酒的小细颈瓶（lagena）。"},{"en":"In Latin texts, “lagena” often refers to a bottle rather than a cup.","zh":"在拉丁文文本中，lagena 常常指“瓶”，而不是“杯”。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) a pouch- or bottle-shaped structure; especially a part of the inner ear in birds and some reptiles, or the name of certain microorganisms (e.g., a genus of foraminifera).","zh":"（生物）袋状或瓶状的结构；尤指鸟类及部分爬行动物内耳的“壶腹/瓶状部”（lagena），也可作某些微生物的属名（如有孔虫属）。"},"examples":[{"en":"Some birds have a lagena in the inner ear that supports hearing and balance.","zh":"一些鸟类的内耳中有 lagena 结构，有助于听觉与平衡。"},{"en":"Under the microscope, Lagena species show a smooth, bottle-like shell.","zh":"在显微镜下，Lagena 属的物种呈现光滑、像小瓶子的外壳。"}]}],"synonyms":["flask","bottle","container"],"phonetic":"/ləˈdʒiːnə/","extraExplanation":["这个词在现代英语里比较少见，更常出现在考古/古典学或生物学语境。","词源来自拉丁语 lagēna（瓶），与希腊语 lágynos（酒瓶/罐）有关；因此它常带有“古代容器”的文化色彩。"]}
{"word":"lagenae","summary":{"en":"Lagenae is the plural form of lagena, meaning either ancient flask-shaped vessels or (in biology) organisms in the genus Lagena.","zh":"Lagenae 是 lagena 的复数，可指古代的细颈瓶/小瓶状容器，也可指生物分类中 Lagena 属的个体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of lagena: small flasks or bottle-shaped vessels (especially in ancient Roman contexts), often with a narrow neck.","zh":"lagena 的复数：小瓶、细颈瓶（尤指古罗马时期常见的瓶状容器）。"},"examples":[{"en":"Archaeologists found several glass lagenae placed beside the burial offerings.","zh":"考古学家在随葬品旁发现了几只玻璃细颈小瓶（lagenae）。"},{"en":"The museum label notes that these lagenae were used to hold oils or perfumes.","zh":"博物馆说明牌写道，这些细颈小瓶（lagenae）用于盛放油或香料。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology, taxonomy) plural of Lagena: members of the genus Lagena (single-celled organisms, especially foraminifera), often described as flask-shaped.","zh":"（生物分类）Lagena 的复数：Lagena 属的生物个体（常见于有孔虫等单细胞生物），形状常被描述为“瓶状/烧瓶状”。"},"examples":[{"en":"Under the microscope, the student compared different lagenae by shell shape.","zh":"在显微镜下，学生通过壳体形状比较不同的 Lagena 个体（lagenae）。"},{"en":"Some lagenae have smoother shells, while others show fine surface texture.","zh":"有些 Lagena 个体（lagenae）壳体更光滑，另一些则带有细微表面纹理。"}]}],"synonyms":["flasks","small bottles","vessels","(taxonomy) Lagena specimens"],"phonetic":"/ləˈdʒiːniː/","extraExplanation":["“lagenae”来自拉丁语复数形式（单数 lagena）。在英文写作中多见于考古/古典学语境，或作为生物分类学名（属名 Lagena）的复数。","读音在英语里常按“拉丁化/学术英语”习惯读作 /ləˈdʒiːniː/（类似“luh-JEE-nee”）。不同学科或地区也可能出现轻微差异。"]}
{"word":"lagenaria","summary":{"en":"Lagenaria is a botanical genus of gourds, especially the bottle gourd.","zh":"Lagenaria 指葫芦属的植物学属名，尤指常见的葫芦/瓠瓜（bottle gourd）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the gourd family (Cucurbitaceae), best known for the bottle gourd, whose fruits can be eaten when young or dried and used as containers or musical instruments.","zh":"葫芦属（葫芦科）的植物属名；最著名的是葫芦/瓠瓜（bottle gourd），果实幼嫩时可食用，成熟后可干燥用作容器或乐器。"},"examples":[{"en":"Bottle gourd belongs to the genus Lagenaria.","zh":"葫芦（瓠瓜）属于葫芦属（Lagenaria）。"},{"en":"In some cultures, dried Lagenaria gourds are used as water containers.","zh":"在一些文化中，干燥的葫芦属瓜果会被用作盛水的容器。"},{"en":"Researchers study Lagenaria to understand how gourds were domesticated and spread around the world.","zh":"研究人员研究葫芦属（Lagenaria），以了解葫芦类植物如何被驯化并传播到世界各地。"}]}],"synonyms":["bottle gourd (common name)","calabash (common name in some contexts)","gourd (general)"],"phonetic":"/ˌlædʒəˈnɛəriə/","extraExplanation":["“Lagenaria”是拉丁化的学名，常见于植物学/园艺语境；日常英语里更常说具体物种名“bottle gourd（葫芦/瓠瓜）”或“calabash（葫芦制容器/葫芦）”。","葫芦属植物的果壳成熟变硬后，可制作水壶、饭勺、容器，甚至乐器（例如某些文化中的葫芦琴、打击乐器）；这也是它在世界多地被人类长期栽培的重要原因。"]}
{"word":"lagend","summary":{"en":"Legend means a traditional story, a very famous person, or the key/guide to symbols on a map or chart.","zh":"Legend 可指（1）传统传说故事，（2）传奇人物/名人，（3）地图或图表的图例（符号说明）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional story (often not fully true) passed down over time, usually about heroes, great events, or mysterious places","zh":"（民间）传说；传奇故事（常含夸张或未必真实）"},"examples":[{"en":"According to legend, a dragon once lived in these mountains.","zh":"根据传说，这些山里曾经住着一条龙。"},{"en":"The legend of King Arthur is still popular today.","zh":"亚瑟王的传说今天仍然很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"a very famous and admired person, especially in sports, music, or film","zh":"传奇人物；（备受敬仰的）名人，尤其指体育、音乐或影视界的人"},"examples":[{"en":"Serena Williams is a tennis legend.","zh":"塞雷娜·威廉姆斯是网坛传奇。"},{"en":"My grandfather is a legend in our town because he helped so many people.","zh":"我爷爷在我们镇上是个传奇人物，因为他帮助了很多人。"}]},{"partOfSpeech":"n.","definition":{"en":"the words or symbols that explain the signs on a map, chart, or diagram (also called a “key”)","zh":"（地图/图表的）图例；符号说明（也叫 key）"},"examples":[{"en":"Check the map legend to see what the colors mean.","zh":"看看地图的图例，了解颜色代表什么。"}]}],"synonyms":["myth","folklore","tale","icon","superstar","key"],"phonetic":"/ˈlɛdʒənd/","extraExplanation":["你输入的 **lagend** 通常是 **legend** 的常见拼写错误。正确拼写是 **legend**。"]}
{"word":"lagends","summary":{"en":"“Legend” means a traditional story, a famous admired person, or the key on a map/chart. “Legends” is the plural form.","zh":"“legend”可指传说故事、传奇人物，也可指地图/图表的图例；“legends”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional story (often old) that people tell about a place or person; it may mix history and imagination.","zh":"传说；传奇故事（常与某地或某人有关，可能夹杂历史与想象）。"},"examples":[{"en":"There are legends about a dragon living in the lake.","zh":"有传说说湖里住着一条龙。"},{"en":"According to local legend, the town was founded by sailors.","zh":"根据当地传说，这座小镇是由水手建立的。"}]},{"partOfSpeech":"n.","definition":{"en":"A very famous and admired person, especially in sports, music, or culture.","zh":"传奇人物；名人（尤指体育、音乐或文化领域中极受敬仰的人）。"},"examples":[{"en":"Michael Jordan is a basketball legend.","zh":"迈克尔·乔丹是篮球界的传奇人物。"},{"en":"She became a legend in her field for her groundbreaking work.","zh":"她因开创性的工作成为她所在领域的传奇人物。"}]},{"partOfSpeech":"n.","definition":{"en":"The explanatory text (labels) on a map, chart, or diagram that explains symbols and colors.","zh":"（地图/图表的）图例；图注（用来解释符号、颜色等）。"},"examples":[{"en":"Check the map legend to understand the symbols.","zh":"看看地图的图例来理解这些符号。"},{"en":"The chart legend shows which color matches each group.","zh":"图表的图例说明每种颜色对应哪个组。"}]}],"synonyms":["myth","folklore","tale","icon","superstar","key"],"phonetic":"/ˈlɛdʒənd/","extraExplanation":["你输入的“lagends”常见是拼写错误，最可能想写的是“legends”（legend 的复数）。拼写提示：le-gend（中间是“ge”，不是“ga”）。","在文学与流行文化中，legend 常用来营造神秘与历史感；例如亚瑟王（King Arthur）相关故事常被称为“Arthurian legends”。"]}
{"word":"lagenian","summary":{"en":"Lagenian means “related to the lagena (an inner-ear structure)” or, less commonly, “related to Lagena/Lagenidae (bottle-shaped foraminifera).”","zh":"lagenian 意为“与内耳的耳蜗小囊（lagena）有关的”，较少见的用法是“与拉吉纳属/拉吉纳科有孔虫有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the **lagena**, a small sac in the inner ear of many animals (especially birds, reptiles, and some fish) involved in hearing and balance.","zh":"与**耳蜗小囊（lagena）**有关的；指许多动物（尤指鸟类、爬行动物及部分鱼类）内耳中的一个小囊结构，参与听觉与平衡。"},"examples":[{"en":"Researchers compared **lagenian** hair cells in birds and mammals to understand how hearing evolved.","zh":"研究人员比较了鸟类和哺乳动物的**耳蜗小囊相关**毛细胞，以了解听觉如何演化。"},{"en":"Damage to **lagenian** structures can affect an animal’s ability to sense vibrations.","zh":"**耳蜗小囊相关**结构受损会影响动物感知振动的能力。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to **Lagena** (or the **Lagenidae**), a group of microscopic organisms (foraminifera) with often flask- or bottle-shaped shells.","zh":"与**Lagena（拉吉纳属）**或**Lagenidae（拉吉纳科）**有关的；指一类微小的有孔虫，外壳常呈瓶状或壶状。"},"examples":[{"en":"The sediment sample contained several **lagenian** foraminifera.","zh":"沉积物样本中含有若干**拉吉纳科相关**有孔虫。"},{"en":"In the microscope image, the **lagenian** shell looks like a tiny flask.","zh":"在显微镜图像中，这种**拉吉纳属相关**外壳看起来像一个小小的瓶子。"}]}],"synonyms":["lagenal","lagena-related"],"phonetic":"/ləˈdʒiːniən/","extraExplanation":["“lagenian”是较少见的科学用词，主要出现在动物学（内耳的lagena）或古生物/海洋地质（有孔虫分类）等语境中。","词根来自拉丁语 *lagena*（“瓶、壶”），因此在描述形态时常带有“瓶状/壶状”的联想，但日常英语里不会用它来形容普通物品。"]}
{"word":"lageniform","summary":{"en":"Lageniform means flask- or bottle-shaped, often used in scientific descriptions.","zh":"Lageniform 意为“瓶形/烧瓶状的”，多用于科学与生物学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in biology) shaped like a flask or bottle: a rounded base with a narrower neck.","zh":"（尤用于生物学）瓶形的；烧瓶状的：底部较圆大、上部较细长如瓶颈。"},"examples":[{"en":"Under the microscope, the cells looked lageniform, with a swollen base and a thin neck.","zh":"在显微镜下，这些细胞呈瓶形：底部膨大，顶部细长。"},{"en":"The botanist described a lageniform gland on the leaf surface.","zh":"植物学家描述了叶片表面有一个瓶形腺体。"}]}],"synonyms":["bottle-shaped","flask-shaped","ampulliform"],"phonetic":"/ləˈdʒɛnɪˌfɔrm/","extraExplanation":["词源：来自拉丁语 *lagena*（“瓶子、酒瓶”）+ *-form*（“……形状的”）。因此它常见于形态学描述（如细胞、腺体、器官或结构的外形）。","使用提示：*lageniform* 多用于学术/技术语境；日常英语更常用 *bottle-shaped* 或 *flask-shaped*。"]}
{"word":"lageniporm","summary":{"en":"“lageniporm” is not recognized as a standard English word; it’s likely a misspelling.","zh":"“lageniporm”不是标准英语单词；很可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a made-up string, so it does not have an established meaning in dictionaries.","zh":"不是标准英语单词。它可能是拼写错误或自造词，因此在词典中没有公认含义。"},"examples":[{"en":"I searched for “lageniporm,” but I couldn’t find a dictionary definition.","zh":"我查了“lageniporm”，但找不到词典释义。"},{"en":"If you meant a different word, please check the spelling and try again.","zh":"如果你想输入的是别的词，请检查拼写后再试。"}]}],"phonetic":"N/A","extraExplanation":["“lageniporm”看起来像拼写混合或误打字。比较接近的英语词有：\n1) lagniappe（/ˈlæɡniæp/）：常指“额外赠品、买一送一式的小惊喜”，多见于美国路易斯安那等地的文化语境。\n2) “-form”结尾常用于表示“形式/表格/形态”（form），但“lageniporm”并不是常见组合。\n如果你告诉我它出现的句子/场景（例如一段话、游戏名、用户名、医学/生物术语等），我可以更准确地推测你想要的词。"]}
{"word":"lager","summary":{"en":"Lager is a cold-fermented beer style; it can also mean to cold-store/mature beer.","zh":"lager 指低温发酵并熟成的拉格啤酒；也可作动词表示让啤酒低温储存熟成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of beer that is fermented and matured at cool temperatures, usually light, crisp, and refreshing","zh":"（一种）拉格啤酒：在较低温度下发酵并熟成的啤酒，通常口感清爽、干净、易入口"},"examples":[{"en":"I’ll have a lager, please.","zh":"请给我来一杯拉格啤酒。"},{"en":"Lagers are often served cold and taste clean and crisp.","zh":"拉格通常冷饮，风味干净清爽。"},{"en":"This brewery is known for its pale lager.","zh":"这家酒厂以淡色拉格闻名。"}]},{"partOfSpeech":"vt.","definition":{"en":"to store or mature (beer) in a cold place for a period of time","zh":"（使啤酒）冷藏熟成：把（啤酒）在低温环境中储存一段时间以成熟风味"},"examples":[{"en":"The beer is lagered for several weeks before bottling.","zh":"这种啤酒在装瓶前要冷藏熟成数周。"},{"en":"They lager the brew at near-freezing temperatures.","zh":"他们在接近冰点的温度下让啤酒冷藏熟成。"}]}],"synonyms":["pilsner (a type of lager)","beer (general)"],"phonetic":"/ˈlɑːɡɚ/","extraExplanation":["“lager”源自德语“lagern”（储存、存放）。拉格与“ale（艾尔）”常被并列比较：拉格通常使用“下发酵”酵母并在低温条件下成熟；艾尔多为“上发酵”，发酵温度较高，风味更偏果香或酯香。","在酒吧点酒时，“lager”在口语里常指“淡色、清爽型啤酒”的大类；但实际上也有“dark lager（黑拉格）”“bock（博克）”等更浓郁的拉格风格。"]}
{"word":"lagered","summary":{"en":"“Lagered” describes beer that has been aged cold to mature and smooth its flavor; it is also the past form of “lager” (to cold-age beer).","zh":"“lagered”指啤酒经过低温贮藏熟成，使风味更顺口；也可作动词 lager 的过去式/过去分词，表示“把啤酒低温熟成”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"stored and matured at low temperatures (especially beer), to make the flavor cleaner and smoother","zh":"（尤指啤酒）在低温下贮藏并熟成的；经“冷藏熟成”处理的（使风味更干净、更顺口）"},"examples":[{"en":"This beer is cold-lagered for six weeks to smooth out the flavor.","zh":"这款啤酒会低温熟成六周，让口感更顺滑。"},{"en":"We preferred the lagered version because it tasted cleaner.","zh":"我们更喜欢经过熟成的版本，因为味道更干净。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of lager) to store beer at low temperatures for a period of time to mature it","zh":"（lager 的过去式/过去分词）把啤酒在低温下贮藏一段时间，使其熟成"},"examples":[{"en":"After fermentation, the brewer lagered the beer until it became crisp and clear.","zh":"发酵后，酿酒师把啤酒低温贮藏熟成，直到口感清爽、酒体清澈。"},{"en":"The batch was lagered longer this time for a drier finish.","zh":"这一批次这次熟成时间更长，收口更干一些。"}]}],"synonyms":["cold-aged","matured","conditioned"],"phonetic":"/ˈlɑːɡɚd/","extraExplanation":["“lagered”常见于精酿啤酒/酿造语境，来自德语词根：lager 意为“储藏”。“lagering（冷藏熟成）”指在接近冰点的低温下存放数周到数月，让杂味沉淀、口感更“干净（clean）”、更“脆（crisp）”。","日常英语里它多用于描述工艺或风味（如 cold-lagered, long-lagered），不常用于非啤酒场景。"]}
{"word":"lagering","summary":{"en":"Lagering is the cold conditioning/storage stage that helps beer become clearer, smoother, and more stable.","zh":"Lagering 指啤酒在低温下进行的熟成与储存阶段，使其更清澈、顺滑且风味更稳定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of conditioning and storing beer at low temperatures for a period of time so it becomes clearer, smoother, and more stable in flavor","zh":"（啤酒）拉格熟成：将啤酒在低温下储存与熟成一段时间，使酒体更清澈、口感更顺滑、风味更稳定的过程"},"examples":[{"en":"After fermentation, the brewer moved the beer to a tank for lagering.","zh":"发酵结束后，酿酒师把啤酒转移到罐中进行拉格熟成。"},{"en":"Longer lagering can reduce harsh flavors and improve clarity.","zh":"更长时间的拉格熟成可以减少生硬味道并提升清澈度。"},{"en":"This pilsner spends four weeks lagering at near-freezing temperatures.","zh":"这款皮尔森在接近冰点的温度下拉格熟成四周。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of lagering beer; allowing it to rest and mature cold (present participle/gerund of “lager”)","zh":"进行拉格熟成的动作；让啤酒在低温下静置成熟（“lager”的现在分词/动名词用法）"},"examples":[{"en":"They are lagering the batch in a bright tank before packaging.","zh":"他们在灌装前把这一批酒放在清酒罐中进行拉格熟成。"},{"en":"Proper sanitation matters just as much while lagering.","zh":"在拉格熟成阶段，良好的卫生管理同样重要。"}]}],"synonyms":["cold conditioning","cold maturation","conditioning","cold storage","aging"],"phonetic":"/ˈlɑːɡərɪŋ/","extraExplanation":["“Lagering”来自德语 Lager（意为“储存/仓储”）。早期的拉格啤酒常在寒冷的洞穴或地窖中低温储存，从而形成更干净、清爽的风格。","拉格熟成不同于“发酵”：发酵主要产酒精和二氧化碳；熟成更像“冷藏静置”，有助于酵母和蛋白质沉降（更清澈），并让风味变得更圆润。"]}
{"word":"lagers","summary":{"en":"“Lagers” means more than one lager, a crisp beer fermented and conditioned at low temperatures.","zh":"“lagers”指不止一杯/一款拉格啤酒（lager），一种低温发酵并冷藏熟成、口感清爽的啤酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “lager”: a type of beer that is fermented and stored at low temperatures, usually with a clean, crisp taste.","zh":"“lager”的复数：一种在较低温度下发酵并冷藏熟成的啤酒，口感通常较清爽、干净。"},"examples":[{"en":"They ordered two lagers with dinner.","zh":"他们晚餐时点了两杯拉格啤酒。"},{"en":"Light lagers are common at sporting events in the U.S.","zh":"在美国的体育赛事上，清淡型拉格啤酒很常见。"},{"en":"This bar has several German lagers on tap.","zh":"这家酒吧有好几款德国拉格生啤。"}]}],"synonyms":["beers","pilsners","light beers"],"phonetic":"/ˈlɑɡər/","extraExplanation":["“Lager”源自德语，和“储藏/贮存”有关：传统上会在低温环境中放一段时间让酒变得更清澈、味道更圆润。","拉格通常使用“底部发酵”（bottom-fermenting）的酵母，并在较低温发酵；常见类型包括 pilsner（皮尔森）、Helles（浅色拉格）等。"]}
{"word":"lagerspetze","summary":{"en":"“lagerspetze” is not standard English; it’s likely the German name/word “Lagerspitze,” referring to a mountain peak (a place name).","zh":"“lagerspetze”不是标准英语；很可能是德语“Lagerspitze”，指山峰（常作地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or variant of the German word/name “Lagerspitze.” In German, it can refer to a mountain “peak” (a place name), and it may also appear in hiking/alpine contexts as the name of a summit.","zh":"不是标准英语词；很可能是德语“Lagerspitze”的拼写错误或变体。在德语里它可指“山峰/峰顶”（常作为地名），多见于徒步、阿尔卑斯山相关语境中。"},"examples":[{"en":"We planned a hike near Lagerspitze this weekend.","zh":"我们计划这周末去 Lagerspitze 附近徒步。"},{"en":"I couldn’t find “lagerspetze” in an English dictionary—maybe it’s a German place name.","zh":"我在英语词典里找不到“lagerspetze”——它可能是德语地名。"}]}],"phonetic":"ˈlɑɡɚˌʃpɪtsə","extraExplanation":["“Spitze”在德语里常见含义是“尖端/山峰”，很多阿尔卑斯山区的山名都会以 -spitze 结尾（相当于英文的 “peak”）。","如果你本来想查的是“lager”（啤酒中的“拉格”）或“lagered”（熟成的/贮藏的），那是另一个英语词源与拼写体系；请告诉我上下文句子，我可以帮你确认。"]}
{"word":"lagerstroemia","summary":{"en":"Lagerstroemia is the plant genus that includes crape/crepe myrtles (e.g., Lagerstroemia indica).","zh":"Lagerstroemia 指“紫薇属”，包括常见的紫薇/百日红（如 Lagerstroemia indica）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering trees and shrubs (family Lythraceae), best known for species commonly called crape/crepe myrtles, valued for showy summer flowers and smooth, peeling bark","zh":"紫薇属（千屈菜科）的一属开花乔木或灌木，其中一些物种常被称为“紫薇/百日红”（英美常见名为 crape/crepe myrtle），以夏季繁花和光滑、会剥落的树皮著称"},"examples":[{"en":"Lagerstroemia indica is often planted along streets for its long-lasting blooms.","zh":"紫薇（Lagerstroemia indica）常被种在街道旁，因为花期很长。"},{"en":"In late summer, the park’s lagerstroemia trees turned bright with pink and purple flowers.","zh":"夏末时，公园里的紫薇属树木开出粉色和紫色的花，十分醒目。"}]}],"synonyms":["crape myrtle","crepe myrtle"],"phonetic":"/ˌlæɡərˈstriːmiə/","extraExplanation":["“Lagerstroemia”是植物学拉丁名，来自瑞典商人/赞助者 Magnus von Lagerström 的姓氏；“-stroemia”是以人名构词的常见方式。","英语里更常见、好记的俗名是 crape myrtle（也拼作 crepe myrtle），其中 crape/crepe 指花瓣像绉纱（皱皱的布料）一样的质感，myrtle 则是因外形让人联想到“香桃木”而得名，但并不一定是同一种植物。"]}
{"word":"lagetta","summary":{"en":"Lagetta usually refers to the Caribbean lacebark tree (Lagetta lagetto) or its lace-like inner bark used for crafts.","zh":"Lagetta 通常指加勒比海的“蕾丝树”（Lagetta lagetto）或其可用于工艺品的蕾丝状内树皮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical Caribbean tree (Lagetta lagetto), also called the lacebark tree, known for its inner bark that separates into delicate, lace-like sheets","zh":"一种加勒比海热带树木（学名 Lagetta lagetto），又称“蕾丝树/蕾丝树皮树”，其内树皮可剥离成细致如蕾丝的薄片"},"examples":[{"en":"In Jamaica, lagetta is famous for its lace-like inner bark.","zh":"在牙买加，lagetta 因其像蕾丝一样的内树皮而出名。"},{"en":"The museum displayed small crafts made from lagetta bark.","zh":"博物馆展出了用 lagetta 树皮制作的小工艺品。"}]},{"partOfSpeech":"n.","definition":{"en":"the lace-like inner bark (fiber) of the lagetta tree, used to make small textiles or decorative items","zh":"lagetta 树的蕾丝状内树皮（纤维），可用来制作小型织物或装饰品"},"examples":[{"en":"She bought a handmade lace piece made of lagetta.","zh":"她买了一块用 lagetta 手工制作的蕾丝饰品。"},{"en":"Historically, lagetta was sometimes used as a natural substitute for lace fabric.","zh":"历史上，lagetta 有时被当作天然的蕾丝布料替代品。"}]}],"synonyms":["lacebark","lacebark tree","Lagetta lagetto"],"phonetic":"/ləˈdʒɛtə/","extraExplanation":["Lagetta 与牙买加文化有一定关联：这种树的内皮可自然分层，形成网状“蕾丝”，过去曾被用来制作头饰、手套、装饰花边等小物件，因此也常被称为 lacebark。","它属于较少见的词，多出现在植物学、博物馆展品说明或加勒比地区的文化介绍中。日常英语里更常用 lacebark tree 来称呼。"]}
{"word":"lagetto","summary":{"en":"Lagetto (often spelled laghetto) means a small lake or pond.","zh":"lagetto（更常写作 laghetto）指“小湖/池塘”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small lake or pond (an Italian word sometimes used in English, especially in place names or travel writing).","zh":"小湖；池塘（意大利语词，有时在英语中用于地名或旅行描写）"},"examples":[{"en":"There’s a quiet laghetto behind the village, perfect for an evening walk.","zh":"村子后面有一处安静的小湖，很适合傍晚散步。"},{"en":"The hotel overlooks a laghetto with ducks and water lilies.","zh":"酒店俯瞰着一个有鸭子和睡莲的小池塘。"}]}],"synonyms":["pond","small lake"],"phonetic":"/lɑˈɡɛtoʊ/","extraExplanation":["“Laghetto”是意大利语里“lago（湖）”的指小形式，意思是“较小的湖/池塘”。你输入的“lagetto”常见为拼写变体或误拼；在意大利语标准拼写通常是“laghetto”（双写 h 用来保持 g 的硬音，读起来更像“g”而不是“j”音）。","在英语语境中，它多出现在意大利地名（如景点名、度假村名）或带有意式风格的描写中，而不是日常通用词。日常英语更常说“pond / small lake”。"]}
{"word":"lagga","summary":{"en":"“lagga” is Nordic-style internet slang meaning “to lag” (slow, delayed, glitchy online).","zh":"“lagga”是北欧网络俚语，意思是“卡/延迟”（网络或性能导致反应慢、掉帧）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(internet/gaming slang, from Swedish and other Nordic usage) to lag; to run or respond slowly because of a weak connection or low performance.","zh":"（网络/游戏俚语，源自瑞典语等北欧用法）卡顿；延迟；因为网络或性能问题而反应很慢。"},"examples":[{"en":"My game is lagging—everything freezes for a second.","zh":"我的游戏在卡——画面会卡住一秒。"},{"en":"Sorry, I’m lagga/lagging because my Wi‑Fi is bad.","zh":"抱歉我有点卡（延迟），因为我家 Wi‑Fi 不太好。"},{"en":"When the server is busy, the video call starts to lagga/lag.","zh":"服务器很忙时，视频通话就会开始卡顿。"}]}],"synonyms":["lag","freeze","stutter","delay"],"phonetic":"ˈlɑɡə","extraExplanation":["“lagga”常见于瑞典语口语/网络语境，相当于英语里的“to lag”。在英语聊天中偶尔会被北欧玩家直接用作外来词，但更标准的英语说法是“lag/lagging”。","如果你是在某个特定社群里看到“lagga”，它也可能是人名、昵称或拼写变体；给我一句原文我可以帮你判断具体含义。"]}
{"word":"laggar","summary":{"en":"“Lagger” means a person/thing that falls behind; in informal UK/Australian English it can also mean a criminal.","zh":"“lagger”指落后者；在英/澳非正式用法中也可指（尤指惯犯的）罪犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that moves or progresses more slowly than others; someone who falls behind.","zh":"落后者；慢于他人的人（或事物）。"},"examples":[{"en":"In group projects, a lagger can slow everyone down.","zh":"在小组项目中，落后者可能会拖慢大家的进度。"},{"en":"The laggers arrived ten minutes after the first runners.","zh":"落后的人在第一批跑者之后十分钟才到。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK/Australia, informal) A criminal, especially someone known for repeated offenses.","zh":"（英/澳，非正式）罪犯；尤指惯犯。"},"examples":[{"en":"In old British TV dramas, the police often talk about catching “the lag.”","zh":"在一些老英剧里，警察常说要抓住“the lag”（罪犯）。"}]}],"synonyms":["straggler","slowpoke","latecomer","underperformer"],"phonetic":"/ˈlæɡər/","extraExplanation":["“laggar”本身不常见，更多时候是把 **lagger** 拼错了（lag + -er = 落后的人）。","俚语“lag”（罪犯）在英式用法里较常见，带点旧式、社会阶层色彩；在正式场合更常用 “criminal / offender”。"]}
{"word":"laggard","summary":{"en":"A “laggard” is someone (or something) that falls behind and is slow to act or progress.","zh":"“laggard”指（人或事物）行动或进步缓慢、落后于他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is slow to move, act, or make progress; someone who falls behind others","zh":"落后者；行动或进步缓慢的人"},"examples":[{"en":"In group projects, one laggard can slow down the whole team.","zh":"在小组项目中，一个拖后腿的人就能拖慢整个团队。"},{"en":"The coach encouraged the laggards to keep running and not give up.","zh":"教练鼓励落后的人继续跑，不要放弃。"}]},{"partOfSpeech":"adj.","definition":{"en":"slow and falling behind; not keeping up with others","zh":"缓慢落后的；跟不上进度的"},"examples":[{"en":"Our laggard internet connection made video meetings difficult.","zh":"我们缓慢的网络连接让视频会议很困难。"},{"en":"The company is a laggard in adopting new technology.","zh":"这家公司在采用新技术方面比较落后。"}]}],"synonyms":["straggler","slowpoke","latecomer","trailer","behind-the-times"],"phonetic":"/ˈlæɡərd/","extraExplanation":["“laggard”语气通常带有批评或不耐烦的感觉，比中性的“slow”更强调“落后、拖进度”。在商业和科技语境中很常见，如“industry/market laggard（行业落后者）”、“technology laggard（技术落后者）”。","词源上与动词“lag（落后、滞后）”有关，后缀“-ard”常用来构成人物名词，有时带轻微贬义（类似 drunkard）。"]}
{"word":"laggardism","summary":{"en":"Laggardism means a tendency or habit of being slow or falling behind, especially in adopting change.","zh":"laggardism 指一种习惯性迟缓或落后、跟不上变化的倾向（常带批评意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or habit of being slow to act, move, or adopt changes; the quality of being a laggard","zh":"落后（或行动迟缓）的状态或习性；拖拉、跟不上变化的倾向"},"examples":[{"en":"In fast-changing industries, laggardism can cause a company to lose customers.","zh":"在快速变化的行业里，落后主义会让公司失去客户。"},{"en":"The report criticized the government’s laggardism on climate policy.","zh":"这份报告批评政府在气候政策上的迟缓与落后。"},{"en":"His laggardism in responding to emails made teamwork harder.","zh":"他回复邮件总是拖拖拉拉，让团队协作更困难。"}]}],"synonyms":["slowness","tardiness","foot-dragging","resistance to change","backwardness"],"phonetic":"/ˈlæɡərˌdɪzəm/","extraExplanation":["“laggardism”由“laggard（落后者、慢吞吞的人）+ -ism（……主义/倾向）”构成，常用于较正式的写作或评论（如经济、政策、科技创新语境），强调“落后/迟缓”是一种系统性的倾向，而不只是一次性的慢。","日常口语里更常用“slowness”“being slow to adapt”“falling behind”等表达；“laggardism”带有更强的批评意味。"]}
{"word":"laggardly","summary":{"en":"Laggardly means slow, sluggish, or behind in pace—used for people, actions, or progress.","zh":"laggardly 表示“缓慢、迟缓、落后”，可形容人或事物的行动与进展。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Moving, working, or developing slowly; lacking energy or speed.","zh":"缓慢的；拖沓的；行动或进展迟缓的。"},"examples":[{"en":"The project showed laggardly progress after the holiday break.","zh":"假期过后，这个项目的进展显得很缓慢。"},{"en":"The laggardly response from the support team frustrated customers.","zh":"客服团队迟缓的回应让顾客很沮丧。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a slow or sluggish way.","zh":"缓慢地；拖拖拉拉地。"},"examples":[{"en":"She moved laggardly through the last mile of the race.","zh":"她在比赛最后一英里跑得很慢。"},{"en":"The old computer starts up laggardly on cold mornings.","zh":"这台旧电脑在寒冷的早晨启动得很慢。"}]}],"synonyms":["slow","sluggish","behind","lethargic","tardy"],"phonetic":"/ˈlæɡ.ɚd.li/","extraExplanation":["“laggardly”来自“laggard”（落后者、慢吞吞的人）+ “-ly”。它既可作形容词（laggardly progress），也可作副词（move laggardly）。在现代英语里更常见的表达是“slow / sluggish / behind schedule”，而“laggardly”更偏正式、书面语。"]}
{"word":"laggardness","summary":{"en":"Laggardness means slowness or the quality of falling behind in action or progress.","zh":"laggardness 指行动或进展缓慢、落后于人/趋势的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being slow to move, act, or make progress; sluggishness","zh":"落后、迟缓的特质；行动或进展缓慢"},"examples":[{"en":"The project failed because of the team’s laggardness in responding to problems.","zh":"项目失败是因为团队应对问题太迟缓。"},{"en":"Her laggardness in adopting new technology put the company at a disadvantage.","zh":"她在采用新技术方面的落后让公司处于不利地位。"},{"en":"The policy was criticized for laggardness compared with other countries’ faster reforms.","zh":"这项政策因相比其他国家更快的改革显得迟缓而受到批评。"}]}],"synonyms":["sluggishness","tardiness","inertia","delay","backwardness"],"phonetic":"/ˈlæɡərdnəs/","extraExplanation":["“laggardness”来自形容词“laggard”（落后的、慢吞吞的）加名词后缀“-ness”，表示“……的状态/特质”。常用于较正式的书面语，尤其在商业、政策、科技采纳等语境中，强调“落后于他人/趋势”的慢。"]}
{"word":"laggardnesses","summary":{"en":"*Laggardnesses* means multiple instances or types of slowness or being behind.","zh":"*Laggardnesses* 指多种/多处的迟缓或落后情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being slow to act, move, or make progress; slowness or delay (plural of *laggardness*)","zh":"落后、迟缓的状态或性质；行动或进展缓慢（*laggardness* 的复数）"},"examples":[{"en":"The report blamed the project’s laggardnesses on poor planning and unclear leadership.","zh":"报告将项目的多处迟缓归咎于规划不周和领导不明确。"},{"en":"Teachers noticed different laggardnesses in reading development among students.","zh":"老师注意到学生在阅读发展上存在不同程度的迟缓。"}]}],"synonyms":["slownesses","delays","tardinesses","backwardnesses","lags"],"phonetic":"/ˈlæɡɚdnəsɪz/","extraExplanation":["“laggardness”来自形容词/名词“laggard”（落后的人/落后的），再加名词后缀“-ness”（表示“……的状态/性质”）。复数“laggardnesses”比较少见，通常在讨论“多种/多处的迟缓表现”时才用；更常见的表达是用不可数名词“laggardness”或直接说“delays / slowness”。","在写作中，“laggardness”语气偏正式，常见于商业、教育、社会议题等语境，用来强调“落后于他人或标准”的感觉，而不仅是一般的“慢”。"]}
{"word":"laggards","summary":{"en":"“Laggards” are people who fall behind because they are slow to act or progress.","zh":"“Laggards”指行动或进展慢、因此落后于他人的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are slow to move, act, or make progress; those who fall behind others.","zh":"行动、反应或进步缓慢的人；落后于他人的人。"},"examples":[{"en":"The fastest runners finished first, and the laggards arrived minutes later.","zh":"跑得最快的人最先到达，落后的人几分钟后才到。"},{"en":"In the market, small companies can be laggards if they don’t innovate.","zh":"在市场上，小公司如果不创新就可能成为落后者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Slow and falling behind others (used before a noun).","zh":"落后的；进展缓慢的（作定语，放在名词前）。"},"examples":[{"en":"The government announced new support for laggard regions.","zh":"政府宣布为落后地区提供新的支持。"},{"en":"Teachers often give extra help to laggard students.","zh":"老师常常会给进度落后的学生额外帮助。"}]}],"synonyms":["slowpokes","stragglers","latecomers","underperformers","also-rans"],"phonetic":"/ˈlæɡərd/","extraExplanation":["“laggards”是复数形式，单数是“laggard”。常见于商业与科技语境：比如“technology laggards（技术落后者）”，用来对比“leaders（领先者）”。","语气上通常带一点批评或强调差距的感觉；如果想更中性，可以用“those who are behind / slower learners（落后的人/进度慢的学习者）”。"]}
{"word":"lagged","summary":{"en":"“Lagged” means (1) fell behind or moved/progressed more slowly (past of “lag”), or (2) delayed/behind schedule.","zh":"“Lagged”表示（1）落后/进展更慢（lag 的过去式），或（2）延迟的、滞后的。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “lag”: to fall behind, move more slowly, or develop later than others.","zh":"“lag”的过去式和过去分词：落后；走/进展得更慢；比别人发展得晚。"},"examples":[{"en":"Our team lagged behind in the first half, but we caught up later.","zh":"我们队在上半场落后了，但后来追上来了。"},{"en":"Sales lagged last month because fewer people were shopping.","zh":"由于购物的人变少了，上个月的销量下滑（落后于预期）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Delayed or behind schedule; not keeping up (often used about progress, work, or data).","zh":"延迟的；落后的；跟不上的（常指进度、工作或数据）。"},"examples":[{"en":"The project is lagged by two weeks due to supply problems.","zh":"由于供应问题，这个项目延误了两周。"},{"en":"The numbers on the dashboard are lagged, so they don’t show real-time results.","zh":"仪表盘上的数据有延迟，所以不是实时结果。"}]}],"synonyms":["fell behind","trailed","was delayed","behind schedule","late","delayed"],"phonetic":"/læɡd/","extraExplanation":["在科技语境里，lag 常指“卡顿/延迟”，例如 video lag（视频延迟）、input lag（输入延迟）。说数据是 lagged data，通常表示“滞后数据/延后更新的数据”，常见于统计、金融和数据分析。"]}
{"word":"laggen","summary":{"en":"“Laggen” is not standard English; it’s usually a misspelling of “lagging,” meaning slow/behind or (in tech) delayed and choppy.","zh":"“laggen”不是标准英语，通常是“lagging”的误拼，表示变慢/落后，或（科技语境）延迟卡顿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) “lagging” — moving or happening more slowly than expected, or falling behind; in tech, responding slowly (often because of a weak connection).","zh":"（非标准拼写）“lagging”——比预期更慢、落后；在科技语境中指反应卡顿/延迟（常因网络不佳）。"},"examples":[{"en":"My video call is lagging, so I can’t hear you clearly.","zh":"我的视频通话在卡顿/有延迟，所以听不清你说什么。"},{"en":"We’re lagging behind schedule, so we need to work faster.","zh":"我们的进度落后于计划，所以得加快速度。"}]},{"partOfSpeech":"v.","definition":{"en":"(Nonstandard spelling) Present participle of “lag” — to be slow or late, or to fall behind.","zh":"（非标准拼写）动词“lag”的现在分词——变慢、延迟，或落后。"},"examples":[{"en":"The app is lagging when I open the map.","zh":"我打开地图时，这个应用会卡。"},{"en":"She’s lagging in math this term.","zh":"这学期她的数学有点跟不上。"}]}],"synonyms":["slow","delayed","behind","falling behind"],"phonetic":"/ˈlæɡɪŋ/","extraExplanation":["“laggen”在标准英语里不常见，很多时候是把“lagging”拼错了，或是网络聊天/游戏里用的随意拼写（类似把lagging写成laggin/lagg）。","常见搭配：lag behind（落后于……）、lagging connection（延迟的网络连接）、input lag（输入延迟，指按键/鼠标到画面反应之间的延迟）。"]}
{"word":"lagger","summary":{"en":"A lagger is someone or something that falls behind; in British informal use, it can also mean a criminal or ex-prisoner.","zh":"lagger 指落后者或较慢的人/事物；在英式非正式用法中也可指罪犯或坐过牢的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that moves more slowly than others or falls behind in progress","zh":"落后者；慢人（或慢物）；进度跟不上者"},"examples":[{"en":"In a long race, there are always a few laggers at the back.","zh":"长跑比赛中，后面总会有几个落后者。"},{"en":"Our old computer is a lagger compared with the new ones.","zh":"和新电脑比起来，我们这台旧电脑明显更慢。"}]},{"partOfSpeech":"n.","definition":{"en":"(British informal) a criminal, especially someone who has been in prison","zh":"（英式非正式）罪犯；（尤指）坐过牢的人"},"examples":[{"en":"He was known as an old lagger in the neighborhood.","zh":"在那个街区，他被认为是个“老罪犯”。"}]}],"synonyms":["straggler","slowpoke","latecomer"],"phonetic":"/ˈlæɡɚ/","extraExplanation":["“lagger”来自动词“lag（落后、慢下来）”。第2个含义主要见于英式口语/俚语，语气往往带有贬义；在正式写作中更常用“criminal”“ex-con（前科犯）”。"]}
{"word":"laggers","summary":{"en":"“Laggers” means people or things that fall behind; in older British slang it can mean prisoners/criminals.","zh":"“Laggers”指落后的人或事物；在较旧的英式俚语中也可指囚犯/罪犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or things that move, progress, or develop more slowly than others; those who fall behind","zh":"落后的人（或事物）；进度较慢、跟不上大部队的人"},"examples":[{"en":"In group projects, laggers can slow down the whole team.","zh":"在小组项目里，跟不上的人可能会拖慢整个团队。"},{"en":"The teacher offered extra help to laggers who were struggling with reading.","zh":"老师为阅读有困难、进度落后的学生提供了额外帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"(British, informal, dated) criminals; people in prison","zh":"（英式非正式、较旧）罪犯；坐牢的人"},"examples":[{"en":"In older British novels, you may see “laggers” used to mean prisoners.","zh":"在较老的英国小说里，你可能会看到“laggers”用来指囚犯。"}]}],"synonyms":["stragglers","slowpokes","latecomers","people who fall behind"],"phonetic":"/ˈlæɡɚz/","extraExplanation":["“laggers”是“lagger”的复数。日常学习或工作语境里通常指“进度落后的人”。","英式俚语里“lagger=囚犯/罪犯”带有年代感，现代英语中更常见的是“criminal”“inmate”“prisoner”。阅读老电影或老小说时遇到这种用法更常见。"]}
{"word":"laggin","summary":{"en":"“Laggin” is an informal spelling of “lagging,” meaning falling behind or experiencing delay (especially online).","zh":"“laggin”是“lagging”的非正式拼写，表示落后、变慢，或（尤其网络/游戏中）发生延迟、卡顿。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(informal spelling of “lagging”) moving more slowly than others; falling behind in progress or speed.","zh":"（“lagging”的非正式拼写）比别人更慢；落后于进度或速度。"},"examples":[{"en":"I’m laggin behind the group—wait up!","zh":"我落在队伍后面了——等我一下！"},{"en":"Sales have been laggin this month.","zh":"这个月的销量一直在走低（进度落后）。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal, especially in gaming/online use) experiencing a delay between an action and what appears on the screen.","zh":"（非正式，尤指游戏/网络语境）出现延迟；操作与画面反应不同步。"},"examples":[{"en":"My game is laggin—everything freezes for a second.","zh":"我游戏在卡——所有东西会突然停一秒。"},{"en":"The video call keeps laggin, so I can’t hear you clearly.","zh":"视频通话一直延迟，所以我听不清你说什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) slow or not keeping up; behind schedule.","zh":"（非正式）慢的；跟不上；落后于计划。"},"examples":[{"en":"We’re laggin on the project, so we need to work faster.","zh":"这个项目我们进度落后了，所以得加快速度。"}]}],"synonyms":["fall behind","trail","be behind","slow down","delay","buffer (internet)","freeze (screen)"],"phonetic":"/ˈlæɡɪn/","extraExplanation":["“laggin”是口语/短信里把“lagging”末尾的 -ing 写成 -in 的形式（类似 goin’ = going）。正式写作、作业或简历里建议用“lagging”。","网络/游戏语境里，“lag”通常特指网络延迟（latency）造成的卡顿；而一般语境里多指进度或速度“落后”。"]}
{"word":"lagging","summary":{"en":"Lagging usually means being slow or behind; it can also refer to insulation around pipes in technical contexts.","zh":"lagging 通常表示“落后、滞后”；在技术语境中也可指管道等外部的保温材料/保温层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"slow or delayed; behind others in progress, speed, or performance","zh":"落后的；滞后的；进度或速度比别人慢的"},"examples":[{"en":"Our sales are lagging behind last year’s numbers.","zh":"我们的销量落后于去年的数据。"},{"en":"If you’re lagging in class, ask the teacher for help early.","zh":"如果你在课堂上跟不上，尽早向老师求助。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “lag”: moving slowly or falling behind","zh":"“lag”的现在分词：走得慢；落后；跟不上"},"examples":[{"en":"She’s lagging a few steps behind the group.","zh":"她落后队伍几步。"},{"en":"The project is lagging because we don’t have enough staff.","zh":"项目进度滞后，因为人手不够。"}]},{"partOfSpeech":"n.","definition":{"en":"material used to cover pipes/boilers to reduce heat loss (insulation), especially in British or technical use","zh":"（尤指英式或技术用法）用于包覆管道/锅炉以减少热量散失的保温材料"},"examples":[{"en":"The engineer checked the lagging around the steam pipes.","zh":"工程师检查了蒸汽管道外的保温层。"}]}],"synonyms":["behind","slow","delayed","falling behind","outdated"],"phonetic":"/ˈlæɡɪŋ/","extraExplanation":["日常口语里更常用“be lagging (behind)”表示“落后/进度慢”。在电脑或网络语境中，“lag”常指“延迟、卡顿”，例如：The video is lagging（视频有延迟/卡顿）。而名词“lagging”指“保温层/保温材料”多见于工程或英式表达。"]}
{"word":"laggingly","summary":{"en":"“Laggingly” means “slowly or with delay, falling behind.”","zh":"“laggingly”表示“缓慢或有延迟地，处于落后状态”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow, delayed, or hesitant way; falling behind the expected pace.","zh":"缓慢地；拖延地；落后地（指进度或反应比预期慢）。"},"examples":[{"en":"The team responded laggingly to the sudden change in the plan.","zh":"团队对计划的突然变化反应很慢。"},{"en":"Sales grew laggingly compared with last year.","zh":"与去年相比，销售增长缓慢。"}]}],"synonyms":["slowly","belatedly","behind","tardily"],"phonetic":"/ˈlæɡɪŋli/","extraExplanation":["“laggingly”来自动词 lag（落后、滞后）+ 副词后缀 -ly。它并不算非常常用；更自然的表达往往是 slowly（慢慢地）、late（迟到地/晚地）、with a delay（有延迟地）、behind schedule（落后于进度）等。","常见搭配语境：react/respond laggingly（反应慢）、recover laggingly（复苏缓慢）、grow laggingly（增长乏力）、follow laggingly（跟得慢/拖拖拉拉）。"]}
{"word":"laggings","summary":{"en":"“Laggings” most often means insulation coverings for pipes or machinery; it can also mean instances of delay or falling behind.","zh":"“Laggings”最常指管道或机器的保温包覆层；也可指多次延误或落后的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"materials (often strips of insulation or wooden/metal casing) used to cover pipes, boilers, or machinery to reduce heat loss, protect surfaces, or improve safety; plural form of “lagging.”","zh":"（常指保温材料或木/金属护板）用于包裹管道、锅炉或机器以减少热量散失、保护表面或提升安全性的覆盖物；为“lagging”的复数形式。"},"examples":[{"en":"The workers replaced the old pipe laggings to improve the building’s energy efficiency.","zh":"工人更换了旧的管道保温层，以提高大楼的能效。"},{"en":"Damaged laggings can expose hot surfaces and create a safety risk.","zh":"破损的保温外层可能会暴露高温表面，造成安全隐患。"}]},{"partOfSpeech":"n.","definition":{"en":"delays or slow progress; times when someone or something falls behind; plural form of “lagging.”","zh":"延误或进度缓慢；落后、跟不上的情况；为“lagging”的复数形式。"},"examples":[{"en":"Several laggings in the supply chain caused the project to finish late.","zh":"供应链的多次延误导致项目晚完工。"},{"en":"The coach noticed laggings in the team’s fitness during the second half.","zh":"教练注意到球队在下半场体能出现下滑、跟不上节奏。"}]}],"synonyms":["insulation","cladding","coverings","delays","slowdowns","setbacks"],"phonetic":"/ˈlæɡɪŋz/","extraExplanation":["“laggings”更常见于工程/建筑语境（管道保温、锅炉包覆等）；日常英语里说“延误”通常用 delays / setbacks / slowdowns，更自然。"]}
{"word":"laggins","summary":{"en":"“Laggins” is usually a misspelling of “leggings,” meaning tight-fitting pants that cover the legs.","zh":"“laggins”通常是“leggings”的拼写错误，意思是覆盖腿部的紧身裤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"leggings: tight-fitting pants (often stretchy) that cover the legs, usually worn for exercise, comfort, or as part of an outfit.","zh":"紧身裤（多为弹力材质），覆盖腿部，常用于运动、休闲或搭配穿着。"},"examples":[{"en":"She wore black leggings to the gym.","zh":"她穿着黑色紧身裤去健身房。"},{"en":"Leggings are comfortable for traveling.","zh":"紧身裤很适合旅行时穿，舒服方便。"},{"en":"He bought thermal leggings for winter.","zh":"他买了保暖紧身裤过冬。"}]}],"synonyms":["tights","stretch pants","athletic leggings"],"phonetic":"/ˈlɛɡɪŋz/","extraExplanation":["“laggins”通常是“leggings”的拼写错误。正确拼法是 leggings（复数形式更常见）。\n\n文化小提示：在北美，leggings 很常见，但在不同场合的穿搭接受度不同；正式场合一般会搭配较长的上衣、外套或裙子，让整体更得体。"]}
{"word":"laglast","summary":{"en":"“Laglast” is not a standard English word; you probably mean “lag” or “last,” depending on context.","zh":"“laglast”不是标准英文单词；你可能想写“lag”或“last”，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or a combination of two words (for example, “lag” + “last”).","zh":"不是标准英文单词，可能是拼写错误或把两个词（例如“lag”和“last”）连在一起写了。"},"examples":[{"en":"I can’t find “laglast” in a dictionary—did you mean “lag” (to be slow/behind)?","zh":"词典里找不到“laglast”——你是不是想写“lag”（变慢/落后）？"},{"en":"Maybe you meant “last” (the final one) instead of “laglast.”","zh":"你可能想写“last”（最后的）而不是“laglast”。"}]}],"phonetic":"/læɡ/","extraExplanation":["“lag”常见意思：\n- 动词：进度落后、变慢（The video lags. 视频卡顿/延迟。）\n- 名词：延迟（There is a lag between sound and image. 声音和画面有延迟。）","“last”常见意思：\n- 形容词：最后的（the last page 最后一页）\n- 动词：持续（The meeting lasted two hours. 会议持续了两小时。）","如果你告诉我你想表达的句子或上下文（比如是在说网络卡顿、学习进度落后，还是“最后一次/最后一个”），我可以给出最准确的词条和用法。"]}
{"word":"lagly","summary":{"en":"“Lagly” is not standard; it’s usually a misspelling of “laggy” (slow or delayed response, especially in tech).","zh":"“lagly”不是标准用法；通常是把“laggy”（反应慢/有延迟，常见于科技语境）拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) A misspelling of “laggy,” meaning slow or delayed in response, especially for computers, games, or internet connections.","zh":"（非标准拼写）“laggy”的常见拼写错误，指反应慢、延迟，尤用于电脑、游戏或网络连接。"},"examples":[{"en":"My phone feels laggy today—apps take a long time to open.","zh":"我手机今天有点卡——打开应用要很久。"},{"en":"The video call got laggy, so I couldn’t hear you clearly.","zh":"视频通话变得很延迟，所以我听不清你说话。"}]}],"synonyms":["laggy","slow","delayed","glitchy"],"phonetic":"/ˈlæɡi/","extraExplanation":["“lagly”在现代英语里不是常见的标准单词。日常中如果你想表达“很卡/有延迟”，通常用“laggy”。\n\n小提示：\n- lag（v./n.）= 延迟、落后\n- laggy（adj.）= 有延迟的、很卡的（更口语、常用于科技场景）\n- lately（adv.）= 最近（有些学习者会把它和“lag-”混淆）"]}
{"word":"lagna","summary":{"en":"Lagna means the ascendant (rising sign) in Vedic/Indian astrology.","zh":"Lagna 指印度/吠陀占星中的上升点（上升星座）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Vedic/Indian astrology) the ascendant: the zodiac sign rising on the eastern horizon at the moment of a person’s birth; used as a key starting point for interpreting a birth chart.","zh":"（印度/吠陀占星中）上升点/上升星座：一个人出生时东方地平线上正在升起的黄道星座；常作为解读命盘的重要起点。"},"examples":[{"en":"In Vedic astrology, the lagna is one of the first things an astrologer checks.","zh":"在吠陀占星里，lagna 是占星师最先查看的要素之一。"},{"en":"Her chart shows a Leo lagna, so she’s said to appear confident and expressive.","zh":"她的命盘显示狮子座 lagna，因此常被说给人的感觉自信、外向。"},{"en":"The lagna changes roughly every two hours, so an accurate birth time matters.","zh":"lagna 大约每两小时变化一次，所以准确的出生时间很重要。"}]}],"synonyms":["ascendant","rising sign","rising"],"phonetic":"/ˈlʌɡnə/","extraExplanation":["“Lagna”来自梵语，字面含义与“贴附、固定、开始/依附点”相关；在占星语境里指命盘的“起点”——上升点（ascendant）。","在英语里它多出现在与印度文化相关的语境中，如“Vedic astrology / Jyotish（印度占星）”、“lagna chart（上升盘/本命盘）”、“lagna lord（上升主星）”。日常英语更常说 ascendant 或 rising sign。"]}
{"word":"lagnappe","summary":{"en":"Lagniappe means a small extra gift or bonus—something added for free beyond what you expected.","zh":"lagniappe 指“额外赠送的添头/小福利”，即在原本应得之外免费多给的一点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small extra gift or bonus given to a customer, beyond what was paid for (often in shops or markets)","zh":"商家额外送给顾客的小赠品或“添头”，不另收费"},"examples":[{"en":"The baker gave us a cookie as lagniappe when we bought a loaf of bread.","zh":"我们买了一条面包，面包师又额外送了我们一块饼干当作“添头”。"},{"en":"As a little lagniappe, the hotel offered free late checkout.","zh":"作为一个小小的额外福利，酒店提供了免费延迟退房。"}]},{"partOfSpeech":"n.","definition":{"en":"an unexpected extra advantage or pleasant addition","zh":"意外得到的额外好处；锦上添花的补充"},"examples":[{"en":"The quiet view from our room was lagniappe—we didn’t ask for it.","zh":"房间的安静景观算是意外之喜——我们并没有特意要求。"}]}],"synonyms":["bonus","freebie","extra","perk","something extra"],"phonetic":"/ˈlænjæp/","extraExplanation":["这个词在美国南部（尤其是路易斯安那州的新奥尔良一带）更常见，带有当地法语/克里奥尔文化色彩。它来自路易斯安那法语 lagniappe，进一步可追溯到西班牙语 la ñapa（“额外的一点”），也有人认为更早与安第斯地区的克丘亚语 yapa（“加一点”）有关。","语气通常是正面的：强调“商家/对方好心多给一点”。在正式写作中也能用，但更偏口语或具有地域文化风味的表达。"]}
{"word":"lagnappes","summary":{"en":"Lagniappe means a small free extra gift or bonus—something extra added on top of what you paid for.","zh":"Lagniappe 指商家免费额外赠送的小礼物或加量，就是“多给一点”的添头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small extra gift or bonus that a shopkeeper or seller adds for free; “something extra” given as a pleasant surprise","zh":"商家额外赠送的小礼物/加量；免费附送的“额外一点”"},"examples":[{"en":"The baker gave us a lagniappe—two extra cookies for free.","zh":"面包师给了我们一份 lagniappe——免费多送了两块饼干。"},{"en":"If you buy two, I’ll throw in a little lagniappe.","zh":"你买两件的话，我再额外送你一点小赠品。"},{"en":"The restaurant offered a lagniappe at the end of the meal: a tiny cup of sweet tea.","zh":"餐厅在餐后送了一份 lagniappe：一小杯甜茶。"}]}],"synonyms":["bonus","freebie","extra","perk","something extra"],"phonetic":"/ˈlæɡniˌæp/","extraExplanation":["“Lagniappe”常见于美国路易斯安那州（尤其新奥尔良一带）的英语中，带有浓厚的当地文化色彩。","词源通常认为来自西班牙语 *la ñapa*（意为“额外赠品/添头”），也受到法语与克里奥尔语环境影响，因此它在路易斯安那法语文化圈里特别常见。","你输入的“lagnappes”更像是复数拼写；标准复数一般写作 **lagniappes**，单数是 **lagniappe**。"]}
{"word":"lagniappe","summary":{"en":"Lagniappe means a small free extra given in addition to what you buy or receive.","zh":"Lagniappe 指在购买或接受服务时额外附送的小礼物/添头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small extra gift or bonus given to a customer in addition to what they paid for; “a little something extra.”","zh":"（买东西时）商家额外赠送给顾客的小礼物/小优惠；“额外的小惊喜”。"},"examples":[{"en":"The baker gave us a lagniappe—two free cookies with our bread.","zh":"面包店给了我们一个 lagniappe——买面包还送了两块饼干。"},{"en":"As a lagniappe, the hotel upgraded our room at no extra cost.","zh":"作为一个 lagniappe，酒店免费给我们升级了房间。"}]}],"synonyms":["freebie","bonus","extra","perk","something extra"],"phonetic":"/ˈlæniˌæp/","extraExplanation":["这个词在美国最常见于路易斯安那州（尤其是新奥尔良），带有当地法语/克里奥尔文化色彩。它来自路易斯安那法语 lagniappe，而更早可追溯到西班牙语 la ñapa（意为“赠品/添头”），再往前与南美原住民语言有关。","语感上它通常指“商家或服务方出于好意给的额外赠送”，比 generic 的 bonus 更口语、更有地方特色。你也会在随笔或杂志文章里看到用它来当作“文章末尾的小彩蛋/附赠内容”。"]}
{"word":"lagniappes","summary":{"en":"“Lagniappes” means small free extras or bonuses given as a friendly add-on.","zh":"“lagniappes”指商家额外赠送的免费小赠品/小优惠，也可泛指“额外的惊喜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “lagniappe”) small extra gifts or bonuses given to a customer, or any little “something extra” added for free.","zh":"（“lagniappe”的复数）商家额外赠送给顾客的小礼物/小优惠；泛指免费附加的“额外好处”。"},"examples":[{"en":"The shopkeeper tossed in a couple of stickers as lagniappes.","zh":"店主额外送了几张贴纸当作小赠品。"},{"en":"Free dessert was a lagniappe at the end of the meal.","zh":"饭后免费的甜点算是一份额外的惊喜。"},{"en":"These small lagniappes make customers feel appreciated.","zh":"这些小赠品会让顾客觉得被重视。"}]}],"synonyms":["freebie","bonus","extra","perk","something extra","giveaway"],"phonetic":"/ˈlænjæp/","extraExplanation":["这个词在美国路易斯安那州（尤其是新奥尔良）一带很常见，带有当地文化色彩，常用于零售、餐饮场景。","词源通常追溯到路易斯安那法语（lagniappe），更早可能来自西班牙语 *la ñapa*（“额外给一点”）以及安第斯地区的克丘亚语。","在正式书面语中不算高频，但在描写地方风情、旅行、美食或商家服务时很地道。"]}
{"word":"lagomorph","summary":{"en":"A lagomorph is a rabbit-like mammal such as a rabbit, hare, or pika.","zh":"lagomorph 指兔形目动物，如兔、野兔或鼠兔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mammal in the group Lagomorpha, such as a rabbit, hare, or pika","zh":"兔形目动物（如兔、野兔或鼠兔）"},"examples":[{"en":"Rabbits and hares are lagomorphs, not rodents.","zh":"兔和野兔是兔形目动物，不是啮齿动物。"},{"en":"The museum exhibit compared a lagomorph skull with a rodent skull.","zh":"博物馆展览把兔形目动物的头骨与啮齿动物的头骨作了比较。"}]}],"synonyms":["rabbit (common name)","hare (common name)","pika (common name)"],"phonetic":"/ˈlæɡəˌmɔrʌf/","extraExplanation":["“Lagomorph”是科学分类用词，日常英语里更常直接说 rabbit（兔子）、hare（野兔）、pika（鼠兔）。","兔形目与啮齿目（rodents）常被混淆：一个简单区分点是兔形目上颌有两对门齿（前面一对后面还有一对“小门齿”），而啮齿目通常只有一对上门齿。"]}
{"word":"lagomorpha","summary":{"en":"Lagomorpha is the scientific order of mammals that includes rabbits, hares, and pikas.","zh":"Lagomorpha（兔形目）是包含兔、野兔和鼠兔的哺乳动物分类“目”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the mammal order that includes rabbits, hares, and pikas (small plant-eating mammals).","zh":"兔形目：一种哺乳动物的“目”，包括兔、野兔和鼠兔（以植物为食的小型哺乳动物）。"},"examples":[{"en":"Rabbits and pikas are both in the order Lagomorpha.","zh":"兔和鼠兔都属于兔形目（Lagomorpha）。"},{"en":"In zoology class, we compared Lagomorpha with rodents like mice and squirrels.","zh":"在动物学课上，我们把兔形目和老鼠、松鼠等啮齿目动物作比较。"}]}],"synonyms":["the rabbit order"],"phonetic":"/ˌlæɡəˈmɔrfə/","extraExplanation":["“Lagomorpha”是生物分类学术语，层级是“目（order）”。它常与“Rodentia（啮齿目）”一起被提到，因为外形相似，但兔形目通常有“两对上门齿”（前面一对大门齿后面还有一对小门齿），而啮齿目通常只有“一对上门齿”。","词源来自希腊语：lagos（野兔）+ morphē（形态/外形），字面意思接近“像野兔的形态”。"]}
{"word":"lagomorphic","summary":{"en":"“Lagomorphic” means rabbit- or hare-like, or related to the group Lagomorpha.","zh":"“lagomorphic”指“像兔/野兔的”或“与兔形目（兔、野兔、鼠兔）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling rabbits, hares, or pikas (the mammal group called Lagomorpha).","zh":"与兔、野兔或鼠兔（兔形目）有关的；像兔形动物的。"},"examples":[{"en":"Rabbits are lagomorphic mammals known for their long ears and strong hind legs.","zh":"兔子是兔形目的哺乳动物，以长耳朵和强壮的后腿而闻名。"},{"en":"The fossil shows lagomorphic features, suggesting it may be related to early rabbits.","zh":"这块化石显示出兔形动物的特征，暗示它可能与早期兔类有关。"}]}],"synonyms":["rabbit-like","hare-like","lagomorph-related"],"phonetic":"/ˌlæɡəˈmɔrfɪk/","extraExplanation":["词源：来自希腊语 lagōs（野兔）+ morphē（形状、形态），字面意思是“像野兔的形态”。","用法提示：这是生物学/动物学里的正式词，更常见的说法是“rabbit-like（像兔子的）”或直接说“lagomorph（兔形目动物）”。"]}
{"word":"lagomorphous","summary":{"en":"Lagomorphous means relating to or resembling rabbits, hares, and pikas (lagomorphs).","zh":"lagomorphous 指“与兔形目动物有关的；像兔形目动物的”（如兔、野兔、鼠兔）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling lagomorphs (the group of mammals that includes rabbits, hares, and pikas).","zh":"与兔形目动物（包括兔、野兔、鼠兔等）有关的；像兔形目动物的。"},"examples":[{"en":"Scientists studied lagomorphous mammals such as rabbits and pikas to understand their habitats.","zh":"科学家研究了兔和鼠兔等兔形目哺乳动物，以了解它们的栖息地。"},{"en":"The fossil’s teeth suggested it came from a lagomorphous ancestor.","zh":"这块化石的牙齿特征表明它可能来自兔形目祖先。"}]}],"synonyms":["lagomorph","leporine","rabbitlike"],"phonetic":"/ˌlæɡəˈmɔɹfəs/","extraExplanation":["“lagomorphous”多见于动物学/学术写作，日常英语更常说“lagomorph”（兔形目动物）或直接说“rabbits and hares”。","词形上，lago- 来自希腊语，意为“野兔”；-morphous 表示“……形状的/……形态的”（如 amorphous 无定形的）。因此 lagomorphous 字面含义就是“像野兔形态的/与兔形目相关的”。","生物分类上，“兔形目（Lagomorpha）”与“啮齿目（Rodentia，鼠类等）”不同；一个常见区分点是兔形目上颌有两对门齿（前面一对大门齿后还有一对小门齿），而啮齿目通常只有一对。"]}
{"word":"lagomrph","summary":{"en":"A lagomorph is a rabbit-, hare-, or pika-like mammal.","zh":"lagomorph 指“兔形目动物”，包括兔、野兔和鼠兔等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mammal in the group that includes rabbits, hares, and pikas (known for long incisors and plant-eating habits)","zh":"兔形目动物（包括兔、野兔和鼠兔等；以门齿发达、主要食草为特征）"},"examples":[{"en":"Rabbits and hares are lagomorphs, not rodents.","zh":"兔和野兔属于兔形目，不是啮齿目。"},{"en":"Scientists study lagomorph populations to understand changes in grassland ecosystems.","zh":"科学家研究兔形目动物的种群数量，以了解草原生态系统的变化。"}]}],"synonyms":["rabbit (informal, not exact)","hare (informal, not exact)","pika (a type of lagomorph)"],"phonetic":"/ˈlæɡəˌmɔrf/","extraExplanation":["你输入的“lagomrph”很像拼写错误；最常见的正确拼法是 **lagomorph**。","词源提示：**lago-** 来自希腊语，意为“野兔”，**-morph** 意为“形态/形状”。","学习点：日常英语里这个词多用于科普、生物学或动物学语境；日常对话更常直接说 *rabbit*（兔子）或 *hare*（野兔）。"]}
{"word":"lagomyidae","summary":{"en":"Lagomyidae is an older zoological family name for pikas; modern sources usually use Ochotonidae.","zh":"Lagomyidae 是较旧的“鼠兔科”科名；现代资料通常使用 Ochotonidae。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a zoological family name (often used in older sources) referring to pikas—small, rabbit-like mammals; in modern classification this group is usually called Ochotonidae.","zh":"（动物学）鼠兔科的一个科名（常见于较旧文献）；指鼠兔这类小型、类似兔的哺乳动物。现代分类中更常用 Ochotonidae（鼠兔科）。"},"examples":[{"en":"Some older field guides list pikas under the family Lagomyidae.","zh":"一些较旧的野外指南会把鼠兔列在 Lagomyidae 这个科下面。"},{"en":"In modern textbooks, Lagomyidae is usually replaced by the family name Ochotonidae.","zh":"在现代教材中，Lagomyidae 通常被 Ochotonidae 这个科名取代。"}]}],"synonyms":["Ochotonidae","pika family"],"phonetic":"/ˌlæɡoʊˈmaɪ.ə.diː/","extraExplanation":["这个词主要出现在动物分类学（taxonomy）的历史语境中：过去有人用 Lagomyidae 来指“鼠兔科”，但现在主流更常用 Ochotonidae。阅读老文献或旧版百科/图鉴时更可能遇到 Lagomyidae。","词源上常被解释为与希腊语里表示“兔/野兔”的词根有关（用于动物学命名），因此它带有“像兔的小型动物”这一传统命名思路。"]}
{"word":"lagonite","summary":{"en":"“Lagonite” is not a common, standard English word; it’s likely a proper name or a misspelling.","zh":"“lagonite”不是常见的标准英语词；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard word in modern English; it does not appear in major learner dictionaries and is most often seen as a possible misspelling or a proper name (e.g., a brand, username, place, or fictional term).","zh":"一个在现代英语中非常罕见或不规范的词；在主流学习词典中通常查不到，更常见的情况是拼写错误或专有名词（如品牌名、用户名、地名或虚构词）。"},"examples":[{"en":"I can’t find “lagonite” in standard dictionaries—could you share a sentence where you saw it?","zh":"我在常见词典里找不到“lagonite”——你能把它出现的句子发我看看吗？"},{"en":"It might be a misspelling; did you mean “lagoon” or another similar-looking word?","zh":"它可能是拼写错误；你是不是想写“lagoon”（泻湖）或其他长得很像的词？"}]}],"phonetic":"/ˈlæɡəˌnaɪt/","extraExplanation":["“lagonite”很可能不是通用英语词汇。为了更准确地帮你：\n1）请提供上下文句子或来源（书名/网页/截图）。\n2）也可能是拼写接近的词：例如 lagoon（泻湖）, lagomorph（兔形目动物）, Lagrangian（拉格朗日的，物理/数学术语）等。\n3）如果它是专有名词（品牌/人名/地名/游戏道具），含义通常取决于作者或产品设定。"]}
{"word":"lagoon","summary":{"en":"A lagoon is a shallow body of water, usually seawater, separated from the ocean by sand or reefs; it can also mean a shallow coastal lake.","zh":"lagoon 指与外海被沙洲或珊瑚礁等隔开的浅水海域（泻湖/潟湖），也可指近海的浅湖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shallow area of sea water separated from the ocean by a sandbar, coral reef, or a line of islands.","zh":"（通常指）与外海被沙洲、珊瑚礁或岛链隔开的浅海水域（潟湖/泻湖）。"},"examples":[{"en":"We swam in the warm lagoon behind the reef.","zh":"我们在珊瑚礁后面温暖的泻湖里游泳。"},{"en":"The resort has rooms facing a turquoise lagoon.","zh":"这家度假村有面向碧绿泻湖的房间。"},{"en":"Small fish hide in the lagoon where the waves are calm.","zh":"小鱼躲在泻湖里，那里海浪很平静。"}]},{"partOfSpeech":"n.","definition":{"en":"A shallow lake or pond, especially one near the sea or formed by a river.","zh":"浅湖/浅水池（尤指靠近海边或由河流形成的潟湖）。"},"examples":[{"en":"Birds gather around the coastal lagoon in winter.","zh":"冬天鸟类会聚集在海岸边的潟湖周围。"},{"en":"After heavy rain, the lowland became a temporary lagoon.","zh":"大雨过后，低洼地带变成了临时的浅水洼（潟湖）。"}]}],"synonyms":["shallows","inlet","coastal lake"],"phonetic":"/ləˈɡuːn/","extraExplanation":["“lagoon”常见于热带海岛语境（如马尔代夫、塔希提），与“reef（珊瑚礁）”一起出现：reef在外侧挡浪，lagoon在内侧水更浅更平静。","词源来自意大利语“laguna”（如威尼斯潟湖 Venice Lagoon），因此在地理与旅游文章里很常见。","易混词：bay（海湾）通常更开阔、与外海连通更直接；lagoon更“被隔开”、更浅、更平静。"]}
{"word":"lagoonal","summary":{"en":"An adjective meaning “connected with a lagoon.”","zh":"形容词：表示“与潟湖有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a lagoon (a shallow body of seawater separated from the ocean by a sandbar, coral reef, or barrier island).","zh":"与潟湖有关的；潟湖的（潟湖是与外海被沙洲、珊瑚礁或屏障岛部分隔开的浅海水域）。"},"examples":[{"en":"Lagoonal waters are usually calmer than the open ocean.","zh":"潟湖水域通常比外海更平静。"},{"en":"Scientists studied lagoonal sediment to understand past storms.","zh":"科学家研究潟湖沉积物以了解过去的风暴。"}]}],"synonyms":["lagoon-related","of a lagoon","lagoon"],"phonetic":"/ləˈɡuːnəl/","extraExplanation":["“lagoonal”多用于学术与专业语境，尤其是海洋学、地质学、生态学与环境科学中，如：lagoonal sediment（潟湖沉积物）、lagoonal environment（潟湖环境）。日常英语里更常说“in/near the lagoon（在潟湖里/附近）”。"]}
{"word":"lagoons","summary":{"en":"“Lagoons” means more than one lagoon—shallow coastal waters partly separated from the sea by sand or reefs.","zh":"“Lagoons”是lagoon的复数，指多个浅水水域，常被沙洲或珊瑚礁与外海部分隔开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of lagoon: shallow bodies of water separated from a larger sea (or lake) by sandbars, reefs, or islands; sometimes used for shallow coastal water areas in general.","zh":"lagoon（潟湖、泻湖、环礁湖）的复数：被沙洲、珊瑚礁或岛屿与大海（或大湖）部分隔开的浅水水域；有时也泛指沿海浅水区。"},"examples":[{"en":"The island is surrounded by clear blue lagoons.","zh":"这座岛屿周围环绕着清澈湛蓝的泻湖。"},{"en":"Many birds feed in the lagoons during the winter.","zh":"冬天有许多鸟类在这些潟湖里觅食。"},{"en":"They kayaked through quiet lagoons near the reef.","zh":"他们在珊瑚礁附近宁静的环礁湖里划皮艇。"}]}],"synonyms":["coastal lagoons","shallow inlets","backwaters"],"phonetic":"/ləˈɡun/","extraExplanation":["“lagoon”常用于地理、旅游和自然纪录片语境：如“coral lagoon（珊瑚礁湖/环礁湖）”“coastal lagoon（海岸潟湖）”。注意它通常指“浅、与外海有隔离或半隔离”的水域，不等同于一般的“lake（湖）”。"]}
{"word":"lagoonside","summary":{"en":"“Lagoonside” means next to a lagoon, either as a place (the shore area) or as an adjective describing something located there.","zh":"“Lagoonside”指“潟湖边/潟湖岸边”，既可作名词表示地点，也可作形容词描述“位于潟湖边的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the area next to a lagoon; the shore or land beside a lagoon","zh":"潟湖边；紧邻潟湖的岸边或陆地"},"examples":[{"en":"We walked along the lagoonside at sunset and watched the birds.","zh":"我们在日落时沿着潟湖边散步，看鸟儿。"},{"en":"The resort has small villas on the lagoonside, away from the open sea.","zh":"度假村在潟湖边有一些小别墅，远离外海。"}]},{"partOfSpeech":"adj.","definition":{"en":"located next to a lagoon; facing or bordering a lagoon","zh":"位于潟湖边的；面向潟湖的；与潟湖接壤的"},"examples":[{"en":"Our room had a lagoonside view.","zh":"我们的房间是潟湖景观。"},{"en":"They built a small walkway along the lagoonside path.","zh":"他们沿着潟湖边的小路修了一条栈道。"}]}],"synonyms":["lagoon-side","by the lagoon","lagoonfront","shoreline (of a lagoon)"],"phonetic":"/ləˈɡunˌsaɪd/","extraExplanation":["“lagoonside”是由 lagoon（潟湖）+ side（边/侧）组成的复合词，常见于旅游介绍、房产广告、地理描述中。更常见的写法也可以是“lagoon-side”或用短语“by the lagoon / on the lagoon side”。"]}
{"word":"lagophthalmos","summary":{"en":"Lagophthalmos is the medical term for not being able to fully close the eyelids.","zh":"Lagophthalmos 是“眼睑无法完全闭合（闭不严）”的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition where the eyelids cannot close completely, often causing dry, irritated eyes (especially during sleep).","zh":"一种眼睑无法完全闭合的状况，常导致眼睛干涩、刺激感（尤其在睡觉时）。"},"examples":[{"en":"After the facial nerve injury, he developed lagophthalmos and needed eye drops at night.","zh":"面神经受伤后，他出现了眼睑闭合不全（lagophthalmos），晚上需要滴眼药水。"},{"en":"People with lagophthalmos may wake up with red, painful eyes because the surface dries out.","zh":"有眼睑闭合不全的人可能会因为角膜表面变干而醒来时眼睛发红、疼痛。"}]}],"synonyms":["incomplete eyelid closure","inability to close the eyelids completely"],"phonetic":"/ˌlæɡəfˈθælmoʊs/","extraExplanation":["词源提示：lago- 来自希腊语，和“兔子”有关；-phthalmos 来自希腊语 ophthalmos，意为“眼睛”。因为兔子睡觉时眼睑常不完全闭合，所以用来比喻这种“闭不上眼”的医学现象。","常见原因包括面神经麻痹/贝尔麻痹（Bell’s palsy）、眼睑外伤或手术后、甲状腺相关眼病导致眼球突出等。临床上会关注角膜干燥与角膜损伤风险。","日常表达中更常说 “incomplete eyelid closure”（眼睑闭合不全）或 “can’t fully close the eye”（眼睛闭不严）。"]}
{"word":"lagophthalmus","summary":{"en":"Lagophthalmus is the inability to close the eyelids completely, which can expose and dry the eye.","zh":"Lagophthalmus（兔眼）指眼睑不能完全闭合，可能使眼睛暴露并变得干涩受损。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which a person cannot fully close one or both eyelids, leaving part of the eye exposed","zh":"（医学）兔眼：指一侧或双侧眼睑无法完全闭合，导致眼球部分暴露在外的情况"},"examples":[{"en":"After the facial nerve injury, the patient developed lagophthalmus and needed eye lubrication.","zh":"面神经受伤后，患者出现兔眼，需要使用润滑眼药。"},{"en":"Lagophthalmus can cause dry, irritated eyes, especially during sleep.","zh":"兔眼可能导致眼睛干涩、刺痛，尤其在睡觉时更明显。"},{"en":"The doctor recommended taping the eyelid at night to protect the cornea from lagophthalmus.","zh":"医生建议夜间贴眼睑以保护角膜，减少兔眼带来的伤害。"}]}],"synonyms":["lagophthalmos","incomplete eyelid closure","inability to close the eyelids"],"phonetic":"/ˌlæɡəfˈθælməs/","extraExplanation":["“lagophthalmus”在临床中常见的标准拼写是 **lagophthalmos**；你输入的形式可能是变体或拼写差异。两者通常都指“眼睑不能完全闭合”。","词源来自希腊语：**lagos**（野兔）+ **ophthalmos**（眼睛）。因为野兔睡觉时眼睛似乎不完全闭合，所以用来比喻这种症状。","常见诱因包括面神经麻痹（如贝尔麻痹 Bell’s palsy）、眼睑外伤/手术后、甲状腺相关眼病等；护理重点常是防止角膜干燥与受损（如人工泪液、眼膏、夜间遮盖）。"]}
{"word":"lagopode","summary":{"en":"Lagopode is a rare zoological word meaning a ptarmigan (Lagopus) or “hare-footed,” describing animals with hare-like, often feathered feet.","zh":"Lagopode 是较少见的动物学词，可指雷鸟（Lagopus 雷鸟属），也可作形容词表示“兔足的”（脚像野兔一样、常有浓密羽毛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(zoology) A ptarmigan; a bird in the genus Lagopus (a grouse adapted to cold regions).","zh":"（动物学）雷鸟；雷鸟属（Lagopus）的一种鸟类，适应寒冷地区的松鸡类。"},"examples":[{"en":"The lagopode changes from brown in summer to white in winter for camouflage.","zh":"雷鸟夏天是褐色，冬天会变白来伪装。"},{"en":"We spotted a lagopode near the snowy ridge.","zh":"我们在积雪的山脊附近看见了一只雷鸟。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hare-footed; having feet like a hare, especially with dense feathers or hair covering them (often describing cold-climate birds).","zh":"兔足的；脚像野兔一样（尤指脚上有浓密羽毛/毛覆盖，常用来形容寒带鸟类）。"},"examples":[{"en":"Ptarmigans are lagopode birds with feathered feet that help them walk on snow.","zh":"雷鸟是“兔足”的鸟，脚上有羽毛，帮助它们在雪地上行走。"},{"en":"The text describes the species as lagopode, adapted to icy ground.","zh":"文章把这种物种描述为“兔足的”，适应冰冷的地面。"}]}],"synonyms":["ptarmigan","Lagopus","hare-footed"],"phonetic":"/ˈlæɡəˌpoʊd/","extraExplanation":["“lagopode”较少见，多用于动物学/博物学语境。更常见的相关词是“ptarmigan（雷鸟）”或“Lagopus（雷鸟属）”。","词源来自希腊语：lagos（野兔）+ pous/pod-（脚），字面意思是“兔脚的”，强调脚部覆盖浓密羽毛以适应雪地环境。"]}
{"word":"lagopodous","summary":{"en":"Lagopodous means “hare-footed,” describing something with feet (or a foot-like shape) resembling a hare’s.","zh":"lagopodous 指“像兔足的/兔脚的”，形容脚或形状像野兔脚一样的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having feet like a hare; “hare-footed.” (A rare, formal word used in scientific or descriptive writing.)","zh":"有“兔足”的；像野兔脚一样的。（较罕见、较正式，多见于科学或描写性文字）"},"examples":[{"en":"Some older zoology books describe certain animals as lagopodous because of their hare-like feet.","zh":"一些较早的动物学书籍会用 lagopodous 来形容某些动物，因为它们的脚像野兔的脚。"},{"en":"In botanical descriptions, a structure may be called lagopodous if it looks like a rabbit’s foot.","zh":"在植物学描写中，如果某个结构看起来像“兔脚”，也可能被称为 lagopodous。"}]}],"synonyms":["hare-footed","rabbit-footed"],"phonetic":"/ləˈɡɑpədəs/","extraExplanation":["词源：来自希腊语 lago-（野兔）+ -podous（足、脚），字面意思就是“兔脚的”。","这是非常少见的词。日常英语更常用 hare-footed 或 rabbit-footed 来表达类似意思。","注意不要和 Lagopus（雷鸟属/松鸡类的一属，学名）混淆；Lagopus 也来自同一词根（“兔足”暗示其冬季长羽的脚）。"]}
{"word":"lagopous","summary":{"en":"Lagopus is the scientific genus name for ptarmigans, cold-region birds that often change color with the seasons.","zh":"Lagopus 是雷鸟属的学名，指生活在寒冷地区、常随季节变色的鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genus name for ptarmigans—small, grouse-like birds that live in cold northern regions and often change color (brown/gray in summer, white in winter) for camouflage.","zh":"雷鸟属（学名）：一种生活在寒冷北方地区的鸡形鸟类，外形像松鸡，常随季节换羽色（夏季偏褐/灰，冬季变白）以便伪装。"},"examples":[{"en":"Lagopus species are well adapted to Arctic and alpine environments.","zh":"雷鸟属的物种非常适应北极和高山环境。"},{"en":"In winter, many Lagopus birds turn white to blend in with snow.","zh":"冬天，许多雷鸟属的鸟会变白，以融入雪地。"}]}],"synonyms":["ptarmigan","grouse (general family term)"],"phonetic":"/ləˈɡoʊpəs/","extraExplanation":["你输入的“lagopous”很可能是拼写错误，常见正确拼写是 **Lagopus**（雷鸟属）。","Lagopus 来自希腊语词根：**lago-**（野兔）+ **-pus**（脚），意思接近“像兔子脚的”，指它们冬季脚趾周围长出羽毛，帮助保暖并在雪地上行走。"]}
{"word":"lagopus","summary":{"en":"Lagopus is the scientific genus name for ptarmigans—cold-region grouse with feathered feet and seasonal plumage changes.","zh":"Lagopus 是雷鸟的属名（学名），指生活在寒冷地区、脚部覆羽并会随季节换羽的松鸡类鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Arctic and sub-Arctic grouse, including the ptarmigans, known for seasonal plumage changes and feathered feet","zh":"松鸡科中的一个属（雷鸟属），生活在北极及亚北极地区，包括雷鸟等，以季节性换羽（如冬季变白）和脚部覆羽而著名"},"examples":[{"en":"Scientists study Lagopus to understand how birds adapt to extreme cold.","zh":"科学家研究雷鸟属（Lagopus），以了解鸟类如何适应极端寒冷。"},{"en":"The rock ptarmigan is classified in the genus Lagopus.","zh":"岩雷鸟被归入雷鸟属（Lagopus）。"}]}],"synonyms":["ptarmigan (genus name)"],"phonetic":"/ləˈɡoʊpəs/","extraExplanation":["词源来自希腊语：lagōs（野兔）+ pous/pod-（脚），字面意思是“兔子脚”，指雷鸟脚部密生羽毛，看起来像兔子的脚，有助于保暖并在雪地行走。","这是学名（属名），日常英语更常用的是 ptarmigan（雷鸟）。在科普或学术写作中更常见 Lagopus。"]}
{"word":"lagorchestes","summary":{"en":"Lagorchestes is the scientific genus name for hare-wallabies—small, rabbit-like wallabies native to Australia.","zh":"Lagorchestes 是兔袋鼠属的学名，指原产澳大利亚、体型较小且外形有点像兔子的袋鼠类动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small Australian marsupials known as hare-wallabies (family Macropodidae)","zh":"（袋鼠科）兔袋鼠属：澳大利亚的一属小型有袋动物，英文常称“hare-wallabies（兔袋鼠）”"},"examples":[{"en":"The banded hare-wallaby belongs to the genus Lagorchestes.","zh":"条纹兔袋鼠属于兔袋鼠属（Lagorchestes）。"},{"en":"Lagorchestes species were once more widespread in Australia than they are today.","zh":"兔袋鼠属（Lagorchestes）的物种过去在澳大利亚的分布比今天更广。"}]}],"synonyms":["hare-wallaby (genus)","Lagorchestes (scientific genus)"],"phonetic":"/ˌlæɡɔrˈkɛstiːz/","extraExplanation":["“Lagorchestes”是拉丁化的动物学属名：lago- 与“野兔/兔子”相关，-orchestes 源自希腊语中与“跳跃、舞者”有关的词根，整体含义可理解为“像兔子一样跳跃的动物”，贴合其体型小、跳跃敏捷的特点。","该属包含数种兔袋鼠，其中一些因栖息地改变与外来捕食者等因素数量下降，常出现在澳大利亚的保育与生态研究语境中。"]}
{"word":"lagostoma","summary":{"en":"Lagostoma is an old term meaning “cleft lip.”","zh":"lagostoma 是表示“唇裂”的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a congenital split in the upper lip; cleft lip (an older, less common term).","zh":"（先天性）上唇裂；唇裂（较旧、较少用的说法）。"},"examples":[{"en":"The doctor explained that lagostoma is an older term for a cleft lip.","zh":"医生解释说，lagostoma 是“唇裂”的较旧说法。"},{"en":"Surgery can often repair a lagostoma in early childhood.","zh":"在儿童早期，手术通常可以修复唇裂（lagostoma）。"}]}],"synonyms":["cleft lip","harelip (dated)"],"phonetic":"/ˌlæɡəˈstoʊmə/","extraExplanation":["词源来自希腊语：lagos（野兔）+ stoma（口）。过去有人用“harelip（兔唇）”来形容唇裂，因此出现了 lagostoma 这种构词。现代医学与日常表达更推荐使用更中性、准确的 cleft lip（唇裂），而避免 harelip 这类可能让人不适的旧称。"]}
{"word":"lagostomus","summary":{"en":"Lagostomus: the scientific genus name for viscachas, burrowing South American rodents related to chinchillas.","zh":"Lagostomus：维斯卡恰等南美洲穴居啮齿动物的科学属名，与龙猫有亲缘关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American rodents (the viscachas), in the chinchilla family, known for living in burrows and having long ears and a rabbit-like look","zh":"（动物学）南美洲啮齿动物的一属（维斯卡恰/大黍鼠一类），属龙猫科，常穴居，长耳，外形有点像兔子"},"examples":[{"en":"Lagostomus maximus is the best-known species in the genus Lagostomus.","zh":"Lagostomus maximus（大维斯卡恰）是 Lagostomus 属中最为人熟知的物种。"},{"en":"In grasslands of Argentina, Lagostomus animals often dig large burrow systems.","zh":"在阿根廷的草原上，Lagostomus 属的动物常挖掘庞大的地下洞穴系统。"}]}],"synonyms":["viscacha (common name)"],"phonetic":"/ˌlæɡəˈstoʊməs/","extraExplanation":["“Lagostomus”是拉丁化的动物学属名，通常在正式写作中斜体书写（Lagostomus），首字母大写；指“属”而不是单一物种。若指具体物种，会用“属名 + 种加词”，如 Lagostomus maximus。","常见英文名是“viscacha”（维斯卡恰），中文在不同资料里也可能译作“维斯卡查”“大黍鼠”等，具体取决于所指物种与译名体系。"]}
{"word":"lagothrix","summary":{"en":"Lagothrix is the scientific genus name for woolly monkeys from the Amazon region.","zh":"Lagothrix 是绒毛猴的属名（科学分类用语），主要指分布在亚马孙地区的绒毛猴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American primates known as woolly monkeys, found mainly in the Amazon rainforest","zh":"绒毛猴属（南美灵长类的一属动物），主要分布在亚马孙雨林"},"examples":[{"en":"Lagothrix species live in groups high in the rainforest canopy.","zh":"绒毛猴属（Lagothrix）的物种常在雨林树冠层的高处群居生活。"},{"en":"The woolly monkey (Lagothrix) has thick, soft fur that helps it in humid forests.","zh":"绒毛猴属（Lagothrix）的猴子有浓密柔软的毛发，有助于适应潮湿的森林环境。"}]}],"synonyms":["woolly monkey"],"phonetic":"/ləˈɡoʊθrɪks/","extraExplanation":["词源上来自希腊语：lagos（野兔）+ thrix（毛发），大意是“像兔毛一样的毛”，指它们蓬松浓密的皮毛。","在日常英语里更常见的说法是 woolly monkey（绒毛猴）；Lagothrix 多用于动物学、生态学或学术写作中。"]}
{"word":"lagrangian","summary":{"en":"A key function (L = T − V) used to derive motion in physics, or an adjective for Lagrange-based methods.","zh":"指用于推导运动规律的关键函数（L = T − V，拉格朗日量），或形容与拉格朗日及其方法相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Physics/Math) A function that summarizes a system’s dynamics, usually written as kinetic energy minus potential energy (L = T − V). It is used to derive the equations of motion.","zh":"（物理/数学）拉格朗日量：用来概括系统动力学的函数，通常写作动能减去势能（L = T − V），可用来推导运动方程。"},"examples":[{"en":"In classical mechanics, the Lagrangian often equals kinetic energy minus potential energy.","zh":"在经典力学中，拉格朗日量通常等于动能减去势能。"},{"en":"Once you know the Lagrangian, you can use the Euler–Lagrange equation to find the system’s motion.","zh":"一旦知道拉格朗日量，就可以用欧拉—拉格朗日方程求出系统的运动。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Joseph-Louis Lagrange or to methods based on the Lagrangian approach (especially in mechanics and optimization).","zh":"（形容词）与拉格朗日（Joseph-Louis Lagrange）或基于拉格朗日方法的思想有关的（尤指力学与优化）。"},"examples":[{"en":"They used a Lagrangian method to handle the constraint in the optimization problem.","zh":"他们用拉格朗日方法来处理优化问题中的约束条件。"},{"en":"Lagrangian mechanics can be more convenient than Newton’s laws for complex systems.","zh":"对复杂系统来说，拉格朗日力学有时比牛顿定律更方便。"}]}],"synonyms":["action-based (physics)","variational (method)","Lagrange-based"],"phonetic":"/ləˈɡrændʒiən/","extraExplanation":["“Lagrangian”来自法国数学家/物理学家约瑟夫-路易·拉格朗日（Joseph-Louis Lagrange）。在物理里，它是“最小（或驻）作用量原理”的核心：不是直接用力去写方程，而是通过能量形式的函数L来推导运动规律。","常见相关词：Euler–Lagrange equation（欧拉—拉格朗日方程）、Lagrange multipliers（拉格朗日乘子，用于带约束的优化）、Lagrangian density（拉格朗日密度，用于场论）。"]}
{"word":"lags","summary":{"en":"“Lags” most commonly means “falls behind” (he/she/it lags) or “delays” (plural noun). In British slang, it can also mean “prisoners.”","zh":"“lags”最常见意思是“落后”（他/她/它 lags）或“延迟/滞后”（名词复数）。在英式俚语中还可指“囚犯”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “lag”) to move or progress more slowly than others; to fall behind.","zh":"（动词，为“lag”的第三人称单数）走得更慢或进展更慢；落后。"},"examples":[{"en":"He always lags behind when we walk uphill.","zh":"我们上坡走路时，他总是落在后面。"},{"en":"Sales lag in the winter, but they pick up in spring.","zh":"冬天销量会滞后，但春天会回升。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural of “lag”) periods of delay between an action and its result; delays.","zh":"（名词，为“lag”的复数）行动与结果之间的时间差；延迟；滞后。"},"examples":[{"en":"There can be lags between policy changes and real-world effects.","zh":"政策变化与现实影响之间可能存在滞后。"},{"en":"Internet lags made the video call choppy.","zh":"网络延迟让视频通话断断续续。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, mainly British slang, plural) prisoners; people in prison.","zh":"（名词，主要英式俚语，复数）囚犯；服刑人员。"},"examples":[{"en":"In old British crime stories, “lags” can mean prisoners.","zh":"在一些老式英式犯罪故事里，“lags”可以指囚犯。"}]}],"synonyms":["falls behind","trails","is behind","delays","latencies"],"phonetic":"/læɡ/","extraExplanation":["“lag”常见搭配：lag behind（落后于……）；a lag in data/reporting（数据/报告的滞后）；time lag（时间滞后）。","“lags”指“囚犯”属于英式俚语，带有时代感与语域限制；正式场合更常用“prisoners”或“inmates”（美式）。"]}
{"word":"lagthing","summary":{"en":"Lagthing (more commonly spelled Lagting) refers to a Scandinavian “law assembly,” and historically a division of Norway’s parliament.","zh":"Lagthing（更常见拼写为 Lagting）指斯堪的纳维亚的“法律集会/民会”，也可指挪威议会历史上的一个组成部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scandinavian legislative or judicial assembly; especially (historically) a regional law court or parliament in Norway and nearby areas","zh":"斯堪的纳维亚地区的立法或司法集会；尤指（历史上）挪威等地的地区性议会/法庭式“民会”（处理法律与公共事务）"},"examples":[{"en":"In medieval Norway, people brought legal disputes to the Lagting.","zh":"在中世纪的挪威，人们会把法律纠纷带到 Lagting 这样的民会去裁决。"},{"en":"The term Lagting appears in texts about Scandinavian political history.","zh":"在讨论斯堪的纳维亚政治史的文章里，经常会看到 Lagting 这个词。"}]},{"partOfSpeech":"n.","definition":{"en":"the former upper division of the Norwegian parliament (Storting) (used historically; the system was ended in 2009)","zh":"（历史用法）挪威议会（Storting）的前“上院/上院部门”名称（该体制已于2009年结束）"},"examples":[{"en":"Before 2009, the Storting was divided into the Odelsting and the Lagting.","zh":"在2009年之前，挪威议会曾分为 Odelsting 和 Lagting 两个部分。"}]}],"synonyms":["assembly","law court (historical)","parliament (historical)"],"phonetic":"/ˈlɑːɡtɪŋ/","extraExplanation":["你输入的 “lagthing” 并不是现代英语里常见的拼写；更常见的形式是 **Lagting**，源自古北欧语/挪威语传统：**lag**（法律/法）+ **thing**（集会；古日耳曼语里指民众议事会，如冰岛的 Althing）。因此它常出现在北欧历史、政治制度或法律史的语境中。","如果你本来想表达的是日常英语里的“卡顿/延迟”，通常用 **lag**（延迟）或 **lagging**（变慢、落后），而不是 lagthing。"]}
{"word":"lagting","summary":{"en":"The Løgting is the parliament of the Faroe Islands.","zh":"Løgting 指法罗群岛的议会（立法机构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the parliament (legislature) of the Faroe Islands; a political body that makes laws and debates public issues","zh":"（法罗群岛的）议会；立法机构，负责制定法律并讨论公共事务"},"examples":[{"en":"The Løgting passes laws that affect daily life in the Faroe Islands.","zh":"Løgting（法罗群岛议会）通过的法律会影响当地人的日常生活。"},{"en":"A new proposal was introduced in the Løgting this week.","zh":"本周有一项新提案提交到法罗群岛议会讨论。"}]}],"synonyms":["Faroese parliament","legislature (of the Faroe Islands)"],"phonetic":"/ˈlɔɡtɪŋ/","extraExplanation":["“Løgting”常见于法罗群岛与北欧政治语境中；英文新闻里有时也会直接用该专名，不翻译。","词源上与古北欧/斯堪的纳维亚地区的“thing/ting”（集会、议事会）有关，类似概念也见于冰岛议会名“Althing”。","拼写里常见的“ø”是北欧字母（在丹麦语、挪威语等中使用）；有些英文文本会写作“Logting”作为不带变音符号的替代拼法。"]}
{"word":"lagu","summary":{"en":"Lagu means “song” in Malay/Indonesian; it may appear in casual multilingual English but is not standard English.","zh":"Lagu 在马来语/印尼语中意为“歌曲”；在随意的多语英语中可能出现，但不属于标准英语用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Malay/Indonesian) a song; a tune.","zh":"（马来语/印尼语）歌曲；曲调。"},"examples":[{"en":"This is my favorite lagu—I listen to it every morning.","zh":"这是我最喜欢的 lagu（歌曲）——我每天早上都会听。"},{"en":"Can you recommend a calm lagu for studying?","zh":"你能推荐一首适合学习时听的舒缓 lagu 吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, in casual multilingual speech) music or a particular track someone is playing.","zh":"（引申，用于口语的多语混用）音乐；正在播放的一首歌/一段音乐。"},"examples":[{"en":"Turn up the lagu a bit—this beat is great.","zh":"把 lagu（音乐）开大一点——这个节奏很棒。"},{"en":"What lagu is playing right now?","zh":"现在在放什么 lagu（歌）？"}]}],"synonyms":["song","track","tune"],"phonetic":"/ˈlɑːɡuː/","extraExplanation":["“Lagu”在马来语和印尼语里就是“歌/歌曲”的常用词；在英语环境中它不是标准英语词汇，但在东南亚或多语社群的日常对话里常会夹用。","如果你在写正式英文，更自然的说法是用“song / track / tune”。"]}
{"word":"laguna","summary":{"en":"Laguna means “lagoon” and is also commonly used as a place name in Spanish-influenced regions.","zh":"Laguna 指“潟湖/泻湖”，也常作为受西语影响地区的地名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lagoon; a shallow body of water separated from the ocean or a larger lake by sandbars, reefs, or barrier islands","zh":"（西语借词）潟湖；与海洋或大湖由沙洲、珊瑚礁或屏障岛隔开的浅水水域"},"examples":[{"en":"The fishermen crossed the laguna at sunrise.","zh":"渔民在日出时穿过那片潟湖。"},{"en":"Mangroves often grow around a warm-water laguna.","zh":"红树林常生长在温暖水域的潟湖周围。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for towns, regions, and natural features, especially in Spanish-speaking areas (often meaning “lagoon” in origin)","zh":"地名用法：常见于西语地区的城镇、地区或自然地貌名称（词源多与“潟湖”有关）"},"examples":[{"en":"She grew up in Laguna, a coastal town.","zh":"她在一个叫 Laguna 的海滨小镇长大。"},{"en":"Their road trip included stops in Laguna Beach and other seaside towns.","zh":"他们的自驾行程包括在拉古纳海滩等海边小镇停留。"}]}],"synonyms":["lagoon","inlet","bay (sometimes)","place name"],"phonetic":"/ləˈɡuːnə/","extraExplanation":["“Laguna”来自西班牙语，字面意思就是“潟湖/泻湖”。在英语里更常用的普通名词是“lagoon”，而“Laguna”常见于地名（如 Laguna Beach）或在谈到拉丁美洲/西语文化语境时使用。"]}
{"word":"lagunas","summary":{"en":"“Lagunas” usually means small lakes or lagoons (plural of “laguna”); it can also be a Spanish place name or surname.","zh":"“Lagunas”通常指“小湖泊/泻湖”（laguna 的复数）；也可能是西语地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of laguna) Small lakes or lagoons, especially in Spanish-speaking regions or the U.S. Southwest; sometimes refers to freshwater ponds behind coastal dunes.","zh":"（laguna 的复数）“泻湖/小湖泊”，常指西班牙语地区或美国西南部的湖泊或潟湖；有时也指海岸沙丘后方的淡水湖泊。"},"examples":[{"en":"After the storm, several lagunas formed in the low-lying fields.","zh":"暴风雨过后，低洼的田地里形成了几个小湖泊（lagunas）。"},{"en":"Birdwatchers visit the lagunas to see herons and migratory ducks.","zh":"观鸟者会去这些泻湖（lagunas）看苍鹭和迁徙的野鸭。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name or family name: “Lagunas” can refer to towns, regions, or a surname in Spanish-speaking contexts.","zh":"地名或姓氏：“Lagunas”在西班牙语语境中也可指城镇/地区名称或作为姓氏使用。"},"examples":[{"en":"They drove through Lagunas on the way to the coast.","zh":"他们去海边的路上开车经过了拉古纳斯（Lagunas）。"},{"en":"Ms. Lagunas will present the final report today.","zh":"拉古纳斯女士（Ms. Lagunas）今天将作最终报告。"}]}],"synonyms":["lagoons","small lakes","ponds"],"phonetic":"/ləˈɡuːnəz/","extraExplanation":["“Laguna”来自西班牙语，意思是“湖/池塘/潟湖”。在英语里多用于描述带有拉丁美洲或美国西南部地理文化色彩的水域，因此在旅行写作、地理介绍中更常见。","如果你是在英文文章里看到 lagunas，它通常是普通名词复数；如果首字母大写（Lagunas），更可能是地名或姓氏。"]}
{"word":"laguncularia","summary":{"en":"Laguncularia is a scientific genus name for mangrove plants, especially the white mangrove.","zh":"Laguncularia 是红树林植物的属名，尤其常指白红树相关分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mangrove plants; it is best known for the species Laguncularia racemosa (the white mangrove), found in coastal wetlands.","zh":"红树林植物的一个属；最著名的物种是 Laguncularia racemosa（白红树/白色红树林），生长在海岸湿地。"},"examples":[{"en":"Laguncularia is commonly discussed in studies of mangrove ecosystems.","zh":"在红树林生态系统研究中，Laguncularia 经常被提到。"},{"en":"The white mangrove (Laguncularia racemosa) helps protect shorelines from erosion.","zh":"白红树（Laguncularia racemosa）有助于保护海岸线、减少侵蚀。"}]}],"synonyms":["white mangrove (common name, for Laguncularia racemosa)"],"phonetic":"/ləˌɡʌŋkjəˈlɛəriə/","extraExplanation":["这是一个拉丁化的植物学名称，常见于学术论文、自然纪录片字幕和物种名录中，日常英语对话里很少直接使用；更常见的说法是 “white mangrove（白红树）”。","词源上与拉丁语有关：laguncula 有“小瓶/小壶”的意思，常用于形容植物某些结构的形状；-aria 常见于拉丁化分类名称的构词。"]}
{"word":"lagune","summary":{"en":"“Lagune” is a rare spelling of “lagoon,” meaning a shallow coastal lake separated from the sea.","zh":"“lagune”是“lagoon”的少见拼写，指与大海部分隔开的浅海岸水域（潟湖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A lagoon; a shallow body of water separated from the sea by sandbars, reefs, or barrier islands.","zh":"（少见用法）潟湖；与海洋被沙洲、珊瑚礁或屏障岛隔开的浅水水域。"},"examples":[{"en":"A narrow strip of sand separated the sea from the lagune.","zh":"一条狭长的沙洲把大海与潟湖隔开。"},{"en":"Flamingos often feed in the shallow water of a lagune.","zh":"火烈鸟常在潟湖的浅水区觅食。"}]}],"synonyms":["lagoon","inlet","bay (sometimes)"],"phonetic":"/ləˈɡuːn/","extraExplanation":["“lagune”在现代英语里非常少见，多被视为拼写变体或受法语/意大利语影响的写法；标准、最常用的英文拼写是“lagoon”。","如果你是在读地理、旅游或文学文本中看到“lagune”，通常可以直接理解为“lagoon（潟湖）”。"]}
{"word":"lagunero","summary":{"en":"Lagunero (fem. lagunera) most commonly means a person from—or something related to—the Laguna Region (Comarca Lagunera) in northern Mexico; more generally in Spanish it can mean “related to a lagoon.”","zh":"Lagunero（阴性lagunera）最常指墨西哥北部拉古纳地区的人或与该地区有关的事物；更广义也可指“与泻湖有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Comarca Lagunera (the “Laguna Region”) in northern Mexico, especially around Torreón, Gómez Palacio, and Lerdo","zh":"（墨西哥北部）拉古纳地区（Comarca Lagunera）的人，尤指托雷翁（Torreón）、戈麦斯帕拉西奥（Gómez Palacio）和莱尔多（Lerdo）一带的人"},"examples":[{"en":"She’s lagunera—she grew up near Torreón.","zh":"她是lagunera——她在托雷翁附近长大。"},{"en":"Many laguneros support Santos Laguna.","zh":"很多laguneros支持桑托斯拉古纳队（Santos Laguna）。"}]},{"partOfSpeech":"adj.","definition":{"en":"from or related to the Comarca Lagunera (Laguna Region) in Mexico","zh":"（墨西哥）与拉古纳地区有关的；来自拉古纳地区的"},"examples":[{"en":"Lagunero food often features grilled meats and flour tortillas.","zh":"拉古纳地区的食物常见烤肉和面粉玉米饼。"},{"en":"He has a strong lagunero accent.","zh":"他有很明显的拉古纳地区口音。"}]},{"partOfSpeech":"adj.","definition":{"en":"(general Spanish) related to a lagoon; of lagoons","zh":"（泛指西班牙语用法）与潟湖/泻湖有关的；湖沼的"},"examples":[{"en":"The guide described the lagunero ecosystem near the coast.","zh":"向导介绍了海岸附近的泻湖生态系统。"},{"en":"They studied lagunero birds that live around shallow water.","zh":"他们研究生活在浅水附近的泻湖鸟类。"}]}],"synonyms":["(Mexico) de la Comarca Lagunera","(general) de la laguna","lagoon-related"],"phonetic":"/ˌlɑːɡuˈnɛroʊ/","extraExplanation":["“Lagunero/lagunera”在墨西哥语境里非常常见，既可作名词（某地区的人），也可作形容词（该地区的）。在体育新闻中常见（如球队Santos Laguna的球迷）。","阴阳性变化：lagunero（男性/通用）、lagunera（女性）；复数为laguneros/laguneras。","除墨西哥外，在西班牙语世界里它也可能泛指“与潟湖有关”，但若提到Torreón等城市，几乎一定指墨西哥的Comarca Lagunera。"]}
{"word":"lagunes","summary":{"en":"Lagunes is likely a misspelling of “lagoons,” meaning shallow coastal lakes separated from the sea.","zh":"lagunes 很可能是 “lagoons”（lagoon 的复数）的拼写误写，指与海洋隔开的浅水泻湖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shallow body of water separated from the sea by a sandbar, coral reef, or barrier island","zh":"（与海洋被沙洲、珊瑚礁或屏障岛隔开的）泻湖；咸水湖；浅水潟湖"},"examples":[{"en":"The hotel sits beside a calm lagoon protected by a coral reef.","zh":"那家酒店坐落在被珊瑚礁保护的宁静泻湖旁。"},{"en":"Fish and birds often gather in lagoons because the water is shallow and warm.","zh":"鱼类和鸟类常常聚集在泻湖里，因为那里水浅而温暖。"},{"en":"After the storm, sand built up and turned part of the bay into a lagoon.","zh":"暴风雨过后，沙子堆积起来，把海湾的一部分变成了泻湖。"}]}],"synonyms":["lagoon","coastal lagoon","inlet (sometimes)","bay (sometimes)"],"phonetic":"/ləˈɡun/","extraExplanation":["“lagunes”在英语里不常见：你可能想写的是 **lagoons**（lagoon 的复数）。在一些语境中，“lagune(s)”也可能是法语的拼写（法语里指“泻湖/潟湖”）。"]}
{"word":"lagurus","summary":{"en":"Lagurus is a grass genus, best known for the ornamental hare’s-tail grass (Lagurus ovatus).","zh":"Lagurus 指兔尾草属，最知名的是观赏用的兔尾草（卵形兔尾草，Lagurus ovatus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of grasses; most commonly refers to Lagurus ovatus, a small ornamental grass with soft, fluffy seed heads (often called hare’s-tail grass).","zh":"兔尾草属（禾本科）；最常指卵形兔尾草（Lagurus ovatus），一种观赏草，花序柔软蓬松，像兔子的尾巴（常称“兔尾草/兔尾巴草”）。"},"examples":[{"en":"Lagurus is often grown in gardens for its soft, tail-like flower heads.","zh":"兔尾草属的植物常被种在花园里，因为它的花序柔软、像尾巴一样可爱。"},{"en":"Dried Lagurus ovatus is popular in floral arrangements and bouquets.","zh":"干燥的卵形兔尾草很常用来做花艺和花束搭配。"}]}],"synonyms":["hare’s-tail grass","Lagurus ovatus (specific species)"],"phonetic":"/ləˈɡjʊrəs/","extraExplanation":["“Lagurus”来自希腊语词根：lagos（兔子）+ oura（尾巴），因此常见英文名是 hare’s-tail (grass)。“-us”是拉丁化的属名结尾。","在园艺语境里，人们有时会直接说“lagurus”来指代最常见的那一种（Lagurus ovatus），类似用属名泛指某个常见物种。"]}
{"word":"lagwort","summary":{"en":"Lagwort (from German, often seen as Schlagwort) means “keyword”: a term used to label or help search for information.","zh":"Lagwort（源自德语，常见形式为 Schlagwort）意思是“关键词”：用于标注或帮助检索信息的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a keyword; a word or short phrase used to describe, label, or help find information (especially in libraries, archives, databases, or online search).","zh":"关键词；用于描述、标注或帮助检索信息的词或短语（常见于图书馆、档案、数据库或网络搜索）。"},"examples":[{"en":"Add a few Lagwörter so people can find your article more easily.","zh":"添加几个“Lagwörter”（关键词），这样别人更容易找到你的文章。"},{"en":"The librarian suggested new Lagwörter for the catalog entry.","zh":"图书管理员为这条馆藏目录记录建议了新的关键词。"}]}],"synonyms":["keyword","tag","search term","subject heading","descriptor"],"phonetic":"/ˈlɑːɡwɔːrt/","extraExplanation":["“Lagwort”是德语，更标准的拼写是“Schlagwort”，意思是“关键词/标语式的词”。在学术、图书馆检索语境里，它常指用于主题标引的词（类似英语的“keyword / subject heading”）。","如果你是在英语语境中看到“lagwort”，多数情况下是把德语词借用过来或拼写简化；英语里通常直接说“keyword”。"]}
