{"word":"lah","summary":{"en":"“Lah” is an informal Singapore/Malaysia English ending particle used to add emphasis or tone.","zh":"“lah”是新马英语里常见的句末语气词，用来加强语气或表达态度。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Singapore/Malaysia informal) A sentence-ending particle used to add emphasis or a friendly tone, similar to “you know,” “come on,” or “okay.”","zh":"（新加坡/马来西亚非正式）句末语气词，用来加强语气或显得更亲切，类似“啦/嘛/就…呀/行啦”。"},"examples":[{"en":"Don’t worry lah—everything will be fine.","zh":"别担心啦——一切都会好的。"},{"en":"Come on lah, just try it once.","zh":"拜托啦，就试一次嘛。"},{"en":"Okay lah, I’ll help you.","zh":"好啦，我帮你。"}]}],"synonyms":["you know (approx.)","come on (approx.)","okay (approx.)"],"phonetic":"/lɑ/","extraExplanation":["“lah”常见于新加坡英语（Singlish）和马来西亚英语的口语里，属于“语气助词/语气词”，主要作用是表达态度（安抚、催促、坚持、无奈、亲昵等），而不是增加新的“事实信息”。","它的语气会随场景变化：安慰时更柔和（Don’t worry lah），催促或不耐烦时更强（Hurry up lah）。写作或正式场合一般不用。","来源上常被认为与华语方言里的“啦”以及马来语、闽南语/粤语等区域语言的语气词使用习惯有关，因此带有明显的本地文化色彩。"]}
{"word":"lahar","summary":{"en":"A lahar is a dangerous volcanic mudflow made of water, ash, and rocks that rushes down a volcano.","zh":"lahar 指危险的火山泥流（火山泥石流），由水、火山灰和岩屑混合并沿火山山坡快速下冲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fast-moving flow of volcanic mud, ash, rock, and water that rushes down the slopes of a volcano, often along river valleys.","zh":"火山泥流；由水、火山灰、岩屑等混合形成的高速泥石流，常沿火山山坡和河谷奔流而下。"},"examples":[{"en":"After heavy rain, a lahar swept down the volcano and buried parts of the village.","zh":"大雨之后，一股火山泥流从火山冲下，掩埋了村庄的一部分。"},{"en":"Scientists monitor rivers near the volcano because lahars can travel far from the eruption site.","zh":"科学家监测火山附近的河流，因为火山泥流可能远离喷发地点仍然蔓延很远。"}]}],"synonyms":["volcanic mudflow","volcanic debris flow","mudflow"],"phonetic":"/ləˈhɑr/","extraExplanation":["“lahar”一词来自印度尼西亚/爪哇语，常用于描述像印尼、菲律宾、美国喀斯喀特山脉等火山地区常见的火山泥流灾害。","火山泥流不一定需要正在喷发：火山灰堆积后遇到暴雨、雪/冰融化或火山口湖溃决，也可能突然形成，危险性在于速度快、范围广、会沿河道远距离冲刷。"]}
{"word":"lahars","summary":{"en":"Lahars are dangerous volcanic mudflows made of water mixed with ash and rocks.","zh":"Lahars 指由水与火山灰、岩石混合形成的危险火山泥石流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lahar is a fast-moving flow of volcanic mud, ash, rock, and water that rushes down the slopes of a volcano, often along river valleys.","zh":"lahar（火山泥石流）是由火山灰、泥、水和岩石混合而成的快速流动体，常沿火山斜坡与河谷迅速下冲。"},"examples":[{"en":"After the eruption, heavy rain triggered lahars that swept through nearby valleys.","zh":"火山喷发后，大雨引发了火山泥石流，席卷了附近的山谷。"},{"en":"Scientists use hazard maps to show which towns could be affected by future lahars.","zh":"科学家使用灾害地图来标示哪些城镇可能会受到未来火山泥石流影响。"}]}],"synonyms":["volcanic mudflow","mudflow","debris flow"],"phonetic":"ˈlɑhɑr","extraExplanation":["“Lahar”一词来自印度尼西亚语/爪哇语地区的用法，因此常见于介绍印尼火山（如默拉皮火山）或环太平洋火山带灾害的文章中。","lahar 不一定需要正在喷发：火山灰和碎屑堆积在山坡上后，只要遇到暴雨、融雪或火山湖溃决，也可能突然形成泥石流般的灾害。","英文里常用复数 “lahars” 来谈论某地区可能出现的多条泥石流通道（multiple lahar paths）。"]}
{"word":"Lahauli","summary":{"en":"from Lahaul; a person from that Himalayan region of India","zh":"来自印度喜马拉雅地区拉豪尔；拉豪尔地区的人或其相关事物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Lahaul, a region in Himachal Pradesh, India","zh":"（印度喜马偕尔邦）拉豪尔（Lahaul）地区的人；拉豪尔人"},"examples":[{"en":"A Lahauli guide helped us cross the high mountain pass safely.","zh":"一位拉豪尔向导帮助我们安全穿越高海拔山口。"},{"en":"Many Lahaulis speak local Tibetic languages as well as Hindi.","zh":"许多拉豪尔人除了印地语外，也会说当地的藏缅语系（偏藏语支）语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Lahaul or its people, culture, or languages","zh":"与拉豪尔地区或其居民、文化、语言有关的；拉豪尔的"},"examples":[{"en":"We tried Lahauli dishes made with barley and local herbs.","zh":"我们品尝了用青稞和当地香草做的拉豪尔风味菜。"},{"en":"The museum has a small Lahauli textile collection.","zh":"博物馆里有一小批拉豪尔纺织品藏品。"}]}],"synonyms":["Lahuli","Lahulian"],"phonetic":"/ləˈhaʊli/","extraExplanation":["Lahaul 位于喜马拉雅山脉高海拔地区，历史上与藏文化圈交流密切，因此“Lahauli”在语境里既可指当地居民，也常用来描述当地的文化、服饰、饮食或语言。","在一些资料中也可能见到拼写变体，如 Lahuli / Lahulian，用法相近。"],"etymology":"源自地名 Lahaul（拉豪尔，印度喜马偕尔邦拉豪尔—斯皮提地区的一部分）+ 英语形容词/居民称谓后缀 -i，构成“某地的/某地人”的意思。","mnemonic":["把它拆开记：Lahaul（地名）+ -i（像“Delhi → Delhi-ite/Delhi-”那样表示“某地的/某地人”）。看到 -i 就联想到“来自某地”。","谐音小记：Lahauli ≈ “拉豪里”，想到“拉豪尔（Lahaul）那里的人/那里的”。"]}
{"word":"lahnda","summary":{"en":"Lahnda is a linguistic term for a group of related languages in northwestern Pakistan, often linked to Western Punjabi.","zh":"Lahnda（拉恩达语）是语言学术语，指巴基斯坦西北部的一组相关语言，常与西旁遮普语相关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of closely related Indo-Aryan languages spoken mainly in northwestern Pakistan (often considered part of Western Punjabi).","zh":"拉恩达语（Lahnda）：主要在巴基斯坦西北部使用的一组密切相关的印欧-雅利安语支语言（常被视为西旁遮普语的一部分）。"},"examples":[{"en":"Lahnda includes several regional varieties spoken in Punjab and nearby areas.","zh":"拉恩达语包括旁遮普省及周边地区使用的多种地方变体。"},{"en":"Some scholars classify Lahnda as part of Western Punjabi rather than a separate language.","zh":"一些学者认为拉恩达语应归入西旁遮普语，而不是独立语言。"}]}],"synonyms":["Lahndi","Western Punjabi (in some classifications)"],"phonetic":"/ˈlɑndə/","extraExplanation":["“Lahnda”在语言学中常用来指一组方言/语言的集合，而不是单一、标准化的“国家语言”。因此在不同书籍或地图上，你可能会看到它与“Western Punjabi（西旁遮普语）”“Lahndi（拉恩达语的另一种拼写）”等名称交叉使用。","日常语境里，人们更常用具体的地方名称来称呼自己的语言/方言；“Lahnda”更多见于学术分类与语言调查。"]}
{"word":"Lahndi","summary":{"en":"a language group of western Pakistan, often linked to Punjabi","zh":"巴基斯坦西部的一组语言（常与旁遮普语密切相关）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of Indo-Aryan languages spoken mainly in western Pakistan (especially Punjab), sometimes treated as varieties of Punjabi; also used for one member or dialect within that group","zh":"一种印欧语系—印度-雅利安语族的语言群，主要分布在巴基斯坦西部（尤指旁遮普一带）；有时被视为旁遮普语的若干变体；也可泛指其中某一种语言或方言"},"examples":[{"en":"Lahndi is often discussed in studies of the languages of Pakistan.","zh":"在研究巴基斯坦语言时，Lahndi 常被提到。"},{"en":"Some sources group several local varieties under the label Lahndi.","zh":"一些资料把多种本地方言归入 Lahndi 这一名称之下。"},{"en":"In some classifications, Lahndi is closely linked to Punjabi.","zh":"在某些分类体系中，Lahndi 与旁遮普语关系非常密切。"}]}],"synonyms":["Lahnda","Western Punjabi","Lahndi languages"],"phonetic":"/ˈlɑːndi/","extraExplanation":["在语言学与民族语言称呼中，Lahndi 的范围并不总是固定：有的书把它当作“西旁遮普语/西旁遮普诸方言”的总称；也有分类把其中一些单独命名（如 Saraiki 等）。不同资料的用法可能不一致，查阅时可对照其分类标准与地图。","在实际交流里，当地人更常用具体语言名（例如 Punjabi、Saraiki 等），而 Lahndi 更偏学术分类或概括性称呼。"],"etymology":"源自旁遮普语/相关地区用法：Lahnda（意为“西方的/西边的”）这一称呼，用来指旁遮普地区西部的语言/方言群；英文中也常见拼写 Lahnda、Lahndi。","mnemonic":["把 Lahndi 记成“land（土地）+ i”：这片“土地上的语言群”（在一片地区上分布的多种方言/语言）。","联想“Lahnda≈西边的”：把 Lahndi 当作“西旁遮普一带的语言/方言”。"]}
{"word":"lahontan","summary":{"en":"Lahontan usually refers to a French officer-writer (Baron de Lahontan) or to North American place names (especially in Nevada) named after him.","zh":"Lahontan 通常指拉洪坦男爵（法国军官兼作家），也可指以他命名的北美地名（尤以内华达州常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) Louis-Armand de Lom d’Arce, Baron de Lahontan (1666–1716), a French officer and writer known for his travel writings about New France (colonial Canada) and Indigenous peoples.","zh":"（专有名词）拉洪坦男爵（Louis-Armand de Lom d’Arce, Baron de Lahontan，1666–1716），法国军官与作家，以描写“新法兰西”（殖民时期加拿大）与原住民的旅行与见闻著作而知名。"},"examples":[{"en":"Lahontan wrote detailed accounts of life in New France.","zh":"拉洪坦写下了关于新法兰西生活的详尽记述。"},{"en":"Some historians discuss Lahontan’s work when studying early French descriptions of Indigenous cultures.","zh":"一些历史学者在研究法国早期对原住民文化的描述时，会讨论拉洪坦的著作。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used in North American place names, especially in Nevada (e.g., Lake Lahontan / Lahontan Reservoir), honoring Baron de Lahontan.","zh":"（地名用法）北美一些地名中使用的“Lahontan/拉洪坦”，尤其常见于美国内华达州（如拉洪坦湖/拉洪坦水库），以纪念拉洪坦男爵。"},"examples":[{"en":"We went fishing at Lahontan Reservoir last weekend.","zh":"我们上周末去拉洪坦水库钓鱼了。"},{"en":"The Lahontan cutthroat trout is named after the Lahontan region.","zh":"拉洪坦割喉鳟因“拉洪坦地区”而得名。"}]}],"synonyms":["Baron de Lahontan","Louis-Armand de Lom d’Arce"],"phonetic":"/ləˈhɑːntən/","extraExplanation":["拉洪坦的著名作品常与《Dialogues avec un sauvage》（常译作《与一位“野人”的对话》）相关；书中以“对话体”呈现对欧洲社会与宗教的批评，因此在文学与思想史讨论中较有名。","在英语语境里，Lahontan既可能指历史人物，也可能指以他命名的地理区域或物种名称（如 Lahontan cutthroat trout）。遇到大写 Lahontan，多半是专名；是否指人或地名可看上下文（writer/officer vs. lake/reservoir/region）。"]}
{"word":"lahore","summary":{"en":"Lahore is a major historic and cultural city in eastern Pakistan (capital of Punjab).","zh":"Lahore（拉合尔）是巴基斯坦东部的重要历史文化名城，也是旁遮普省省会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in eastern Pakistan, the capital of Punjab province, known for its rich history, Mughal-era architecture, food culture, and arts.","zh":"巴基斯坦东部的一座重要城市，旁遮普省省会，以悠久历史、莫卧儿时期建筑、美食文化与艺术闻名。"},"examples":[{"en":"Lahore is often called the cultural heart of Pakistan.","zh":"拉合尔常被称为巴基斯坦的文化中心。"},{"en":"They visited Lahore to see the Badshahi Mosque and Lahore Fort.","zh":"他们去拉合尔参观了巴德夏希清真寺和拉合尔堡。"}]}],"synonyms":["(proper noun; no true synonyms)"],"phonetic":"/ləˈhɔr/","extraExplanation":["“Lahore”在英语中通常读作 /ləˈhɔr/（美式常见），中文常译为“拉合尔”。","拉合尔在南亚历史与文学中经常被提及，尤其与莫卧儿帝国遗产、旁遮普文化（音乐、诗歌、饮食）相关。","常见搭配：Lahore Fort（拉合尔堡）、Badshahi Mosque（巴德夏希清真寺）、the Lahore Museum（拉合尔博物馆）。"]}
{"word":"Lahr","summary":{"en":"Lahr is most commonly a German place name (a town near the Black Forest), and it can also be a surname.","zh":"Lahr最常见是德国的地名（黑森林附近的一座城镇），也可以作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in southwestern Germany (in the state of Baden-Württemberg), near the Black Forest.","zh":"拉尔：德国西南部的一个城镇（巴登-符腾堡州），靠近黑森林地区。"},"examples":[{"en":"She grew up in Lahr before moving to Berlin.","zh":"她在拉尔长大，后来搬去了柏林。"},{"en":"Our train stops at Lahr (Schwarzwald) station.","zh":"我们的火车会停靠拉尔（黑森林）站。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), used in some English- and German-speaking contexts.","zh":"拉尔：一个姓氏，在英语和德语语境中都有可能出现。"},"examples":[{"en":"Mr. Lahr will present the next speaker.","zh":"拉尔先生将介绍下一位演讲者。"},{"en":"The article was written by Dana Lahr.","zh":"这篇文章由达娜·拉尔撰写。"}]}],"synonyms":["Lahr (Schwarzwald)"],"phonetic":"/lɑr/","extraExplanation":["“Lahr”作为地名在英语材料中常见于全称“Lahr (Schwarzwald)”，括号里的“Schwarzwald”意为“黑森林”，用来区分或强调地理位置。","如果你在句子里看到“in/at Lahr”，通常是指地点；如果前面有称谓（Mr./Ms.）或作人名主语，多半是姓氏。"]}
{"word":"lahuli","summary":{"en":"Lahuli means a person from Lahaul in northern India, or something related to that region; it can also refer to local languages/dialects spoken there.","zh":"Lahuli 指来自印度北部拉胡尔地区的人，或与该地区相关的事物；也可指当地使用的语言/方言（统称，用法不一）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Lahaul (also spelled Lahaul), a region in Himachal Pradesh in northern India","zh":"（来自印度北部喜马偕尔邦拉胡尔地区的人）拉胡尔人"},"examples":[{"en":"Many Lahulis move to lower valleys during the harsh winter.","zh":"很多拉胡尔人在严冬会搬到较低的山谷居住。"},{"en":"She grew up in a Lahuli village near Keylong.","zh":"她在靠近凯隆的一个拉胡尔村庄长大。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Lahaul, its people, or its culture","zh":"拉胡尔的；与拉胡尔地区、当地人或文化有关的"},"examples":[{"en":"They served Lahuli food made with local barley and peas.","zh":"他们端上了用当地青稞和豌豆做的拉胡尔食物。"},{"en":"The museum has a small collection of Lahuli textiles.","zh":"博物馆里有一小批拉胡尔纺织品藏品。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of related local languages/dialects spoken in the Lahaul area (usage varies by source)","zh":"（用法因资料而异）拉胡尔地区使用的一组相关语言/方言"},"examples":[{"en":"He is documenting Lahuli words and folk songs.","zh":"他正在记录拉胡尔语词汇和民歌。"},{"en":"Some schools use Hindi, while Lahuli is spoken at home.","zh":"一些学校使用印地语，但家里会说拉胡尔语。"}]}],"synonyms":["Lahauli","of Lahaul"],"phonetic":"/ləˈhuːli/","extraExplanation":["“Lahuli”常见的另一种拼写是“Lahauli”，都来自地名“Lahaul（拉胡尔）”。在英文里，这类“地名 + -i/-li/-auli”的形式常用来表示“某地的人”或“某地的”。","拉胡尔位于印度喜马偕尔邦的高海拔山谷地带（接近拉达克），因此在英文语境中常会与高原气候、季节性迁居、藏传佛教文化以及山地农牧生活等话题一起出现。","关于“Lahuli language”的说法，不同书籍/网站可能把它当作一个统称（指拉胡尔一带的多种相关方言/语言），而不是一个单一标准语言；正式名称与分类可能因学术体系而不同。"]}

