{"word":"lai","summary":{"en":"“Lai” is most commonly a person’s name; in literature, it can also mean a medieval short narrative poem/song (often spelled “lay”).","zh":"“Lai”最常见是人名；在文学语境中也可指中世纪短篇叙事诗/歌（常拼作“lay”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name or given name (common in Chinese communities; also seen in other cultures).","zh":"（人名）姓氏或名字（常见于华人社群，也见于其他文化）。"},"examples":[{"en":"Ms. Lai will lead the meeting today.","zh":"Lai 女士今天将主持会议。"},{"en":"I met a student named Lai in my English class.","zh":"我在英语课上认识了一个叫 Lai 的学生。"}]},{"partOfSpeech":"n.","definition":{"en":"(literature) a short medieval narrative poem or song, especially from Breton/French tradition (often also spelled “lay”).","zh":"（文学）中世纪短篇叙事诗/歌，尤指布列塔尼/法语传统中的“短叙事歌”（常也拼作 lay）。"},"examples":[{"en":"In class, we read a Breton lai about love and fate.","zh":"课堂上我们读了一首关于爱情与命运的布列塔尼 lai（短叙事歌）。"},{"en":"Marie de France is famous for her lais.","zh":"玛丽·德·法兰斯因她的 lais（短叙事歌）而闻名。"}]}],"synonyms":["lay (literary)"],"phonetic":"/laɪ/","extraExplanation":["“Lai”作人名时，读音会因语言而不同：在英语环境里常按拼写读作 /laɪ/（类似“lie”）。","文学术语“lai”来源于中世纪法语/布列塔尼传统，英语里也常写作“lay”。很多读者在英文教材中更常见到“Breton lay”。"]}
{"word":"laibach","summary":{"en":"Laibach is either the historical German name for Ljubljana or the name of a well-known Slovenian industrial/avant-garde band.","zh":"Laibach 既可指卢布尔雅那的德语旧称，也可指知名的斯洛文尼亚工业/前卫乐队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Laibach: the German name for Ljubljana, the capital city of Slovenia (used especially in historical contexts).","zh":"Laibach：斯洛文尼亚首都“卢布尔雅那”（Ljubljana）的德语名称（多用于历史语境）。"},"examples":[{"en":"During the Austro-Hungarian period, Ljubljana was often called Laibach in German documents.","zh":"在奥匈帝国时期，卢布尔雅那在德语文件中常被称为 Laibach。"},{"en":"The museum exhibit explains how the name Laibach appeared on old maps.","zh":"博物馆展览解释了旧地图上为何会出现 Laibach 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"Laibach: a Slovenian avant-garde/industrial music group known for provocative aesthetics and political symbolism.","zh":"Laibach：斯洛文尼亚前卫/工业音乐团体，以挑衅性的美学与政治象征风格闻名。"},"examples":[{"en":"Laibach’s concerts often blend music with strong visual imagery.","zh":"Laibach 的演出常把音乐与强烈的视觉影像结合在一起。"},{"en":"I first heard of Laibach through documentaries about European industrial music.","zh":"我最早是通过介绍欧洲工业音乐的纪录片知道 Laibach 的。"}]}],"synonyms":["Ljubljana (for the city)"],"phonetic":"/ˈlaɪbɑk/","extraExplanation":["“Laibach”作为地名带有历史与政治记忆：它是卢布尔雅那的德语旧称，在不同年代（尤其是战争与占领相关的语境）可能引发敏感联想，因此使用时要注意语境。","乐队 Laibach 取用这一名称本身就是一种艺术策略：他们经常借用权力符号与官方语言来进行讽刺、反思或挑战；理解其作品时，把它当作“观念艺术/表演艺术”的延伸会更容易。"]}
{"word":"laic","summary":{"en":"Laic means “non-clerical; belonging to ordinary believers (the laity),” and sometimes “secular.”","zh":"laic 指“非神职的、属于平信徒的”，有时也指“世俗的、非宗教的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not belonging to the clergy; related to ordinary people (the laity) rather than religious leaders.","zh":"（宗教中）非神职人员的；属于平信徒（普通信众）的，而非教士的。"},"examples":[{"en":"A laic member of the church volunteered to organize the community dinner.","zh":"一位教会的平信徒志愿组织社区晚餐。"},{"en":"The committee includes both clergy and laic representatives.","zh":"该委员会既有神职人员，也有平信徒代表。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Not religious; secular in character.","zh":"（较少见）非宗教的；世俗的。"},"examples":[{"en":"The organization presents itself as laic and open to people of all beliefs.","zh":"该组织以世俗、对各种信仰开放的形象示人。"},{"en":"They argued for a laic education system separate from the church.","zh":"他们主张建立与教会分离的世俗教育体系。"}]}],"synonyms":["lay","nonclerical","secular"],"phonetic":"/ˈleɪ.ɪk/","extraExplanation":["“laic”在英语里比较正式、偏学术或法律语境，日常更常用“lay”（如：a layperson / lay member）。","词源来自希腊语 *laikos*（“属于人民的”）。在法语/欧洲政治语境中常见相关词“laïcité”（政教分离、国家世俗性），英语讨论时有时会借用这个概念。"]}
{"word":"laical","summary":{"en":"Laical means “not clergy; belonging to ordinary (lay) people,” and more rarely “nonprofessional.”","zh":"laical 指“非神职人员的、属于平信徒的”，较少也可指“非专业的、外行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not connected with the church or religion; belonging to ordinary people rather than clergy (religious officials).","zh":"非教会的；俗人的；属于平信徒而非神职人员的。"},"examples":[{"en":"The hospital is run by a laical organization, not a religious order.","zh":"这家医院由一个非宗教团体运营，而不是由修会管理。"},{"en":"In the Middle Ages, laical people usually had less access to formal education than clergy.","zh":"在中世纪，平信徒通常比神职人员更难接受正规教育。"}]},{"partOfSpeech":"adj.","definition":{"en":"Nonprofessional; not trained or expert (a less common use).","zh":"非专业的；外行的（较少见用法）。"},"examples":[{"en":"The report was written in a clear style for laical readers.","zh":"这份报告用清晰的写法面向非专业读者。"}]}],"synonyms":["lay","nonclerical","secular","nonprofessional"],"phonetic":"/ˈleɪ.ɪ.kəl/","extraExplanation":["“laical”源自“laity / lay”（平信徒），常见于宗教、历史或法律语境，用来对比 clergy（神职人员）。","现代英语里更常用“lay”来表达同样意思（如 lay person, lay teacher）。注意“laical”较正式、较书面。"]}
{"word":"laicality","summary":{"en":"Laicality means the state or quality of being lay—non-clerical, not ordained.","zh":"laicality 指“平信徒/非神职”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being lay (not clergy or religiously ordained); a non-clerical character","zh":"平信徒（非神职人员）的性质；世俗/非教士的特征"},"examples":[{"en":"The committee’s laicality helped it represent ordinary members, not church leaders.","zh":"这个委员会的平信徒性质使它能代表普通成员，而不是教会领袖。"},{"en":"Some scholars discuss the laicality of medieval religious movements.","zh":"一些学者会讨论中世纪宗教运动的平信徒特征。"}]}],"synonyms":["lay status","non-clerical character","secularity (in some contexts)","lay nature"],"phonetic":"/leɪˈkælɪti/","extraExplanation":["这个词很少见，多用于宗教史、教会制度或学术写作中。它来自“laity”（平信徒、俗人）+ “-ality”（表示“……的性质/状态”）。在日常英语里，人们更常用“lay character / being lay / non-clerical”来表达。"]}
{"word":"laically","summary":{"en":"Laically means “in a layperson’s (non-clergy or nonprofessional) way,” often meaning “in simple, nontechnical terms.”","zh":"laically 指“以平信徒/外行人的方式”，常引申为“用通俗、非技术性的说法”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to ordinary people (not clergy or religious professionals); from a layperson’s point of view.","zh":"以平信徒/外行人的方式；从非宗教神职人员或非专业人士的角度来看。"},"examples":[{"en":"The topic can be explained laically without using theological terms.","zh":"这个话题可以用平信徒的方式解释，不必使用神学术语。"},{"en":"She approached the question laically, focusing on everyday experience rather than doctrine.","zh":"她以外行人的角度处理这个问题，更关注日常经验而不是教义。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a nonprofessional, nontechnical way; simply and for general audiences.","zh":"以非专业、非技术性的方式；用通俗易懂的方式。"},"examples":[{"en":"The doctor described the procedure laically so the family could understand.","zh":"医生用通俗的方式描述了手术过程，家属也能听懂。"},{"en":"Try to summarize the research laically for readers who aren’t specialists.","zh":"尽量用通俗的方式概括这项研究，方便非专业读者理解。"}]}],"synonyms":["in lay terms","plainly","simply","for non-specialists","from a lay perspective"],"phonetic":"/ˈleɪɪkli/","extraExplanation":["“laically”较少见，写作中更常用“in lay terms / from a lay perspective / for non-specialists”等表达，语气更自然。","词根来自“laic / lay”（平信徒、外行人）。在宗教语境里对比“clergy”（神职人员）；在学术/职业语境里对比“specialists / professionals”（专业人士）。"]}
{"word":"laich","summary":{"en":"Laich is a rare term (from German) meaning fish spawn or roe; it may also mean “to spawn” in German-style usage.","zh":"Laich 是一个较少见的词（源自德语），指鱼卵/产卵物；在德语式用法中也可指“产卵”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology, rare in English) fish eggs or spawn; roe.","zh":"（生物学；英语中较少见）鱼卵；（鱼的）产卵物；鱼籽。"},"examples":[{"en":"The scientist collected laich to study the fish population in the river.","zh":"科学家采集了鱼卵（laich）来研究河流中的鱼类种群。"},{"en":"In spring, the shallow water is full of laich.","zh":"春天，浅水区到处都是鱼卵（laich）。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to spawn; to lay eggs (used mainly in German contexts).","zh":"（罕见；多见于德语语境）产卵；繁殖。"},"examples":[{"en":"Some texts note that carp laich in warm, quiet water.","zh":"一些资料提到，鲤鱼会在温暖、平静的水域产卵（laich）。"}]}],"synonyms":["roe","spawn","fish eggs"],"phonetic":"/laɪk/","extraExplanation":["“laich”主要是德语词（Laich），在英语里偶尔出现在生物学/渔业相关资料中，表示“鱼卵/产卵物”。更常见的英语表达是 roe（鱼卵，尤指可食用的）或 spawn（鱼卵/产卵；也可作动词“产卵”）。","如果你想查的是拼写相近的英语词（如 latch, leech, laic/lay），告诉我你看到它的句子，我可以帮你确认。"]}
{"word":"laichs","summary":{"en":"Laches is a legal term meaning an unfair delay in asserting a right, which may prevent a claim from being enforced.","zh":"Laches 是法律术语，指当事人不合理拖延主张权利，导致请求可能因不公平而不被支持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an unreasonable delay in taking legal action, which can make a claim unfair to enforce","zh":"（法律）因当事人不合理拖延起诉或主张权利，而导致其请求在衡平法上可能不被支持的原则（迟延抗辩）"},"examples":[{"en":"The judge dismissed the case because of laches: the plaintiff waited too long to sue.","zh":"法官以“迟延抗辩（laches）”为由驳回了案件：原告拖了太久才起诉。"},{"en":"In equity, laches can bar a claim even if the statute of limitations has not run out.","zh":"在衡平法中，即使诉讼时效尚未届满，laches 也可能阻却一项请求。"}]}],"synonyms":["unreasonable delay","delay","tardiness (general, not legal-specific)"],"phonetic":"/ˈlætʃɪz/","extraExplanation":["你输入的“laichs”很可能是在找“laches”。这是英美法中的术语，常见于判决书或法律评论里。","laches 的核心是“拖延导致不公平”：如果一方长期不主张权利，使对方因时间推移而难以举证、安排事务或受到不利影响，法院可能认为继续审理不公。","它与“statute of limitations（诉讼时效）”不同：诉讼时效是法定期限；laches 更偏向衡平法上的公平考量。"]}
{"word":"laicisation","summary":{"en":"Laicisation means making institutions less controlled by religion (often by the state), or (in church use) formally removing someone from the clergy.","zh":"Laicisation 指使机构脱离宗教控制的世俗化过程；在教会语境中也可指正式解除某人的圣职。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something less controlled by a church or religious authority; transferring responsibilities to non-religious (lay) control, often by the state","zh":"（常指由国家推动的）世俗化／非宗教化过程；把原由教会或宗教机构掌管的事务转交给非宗教（平信徒）管理"},"examples":[{"en":"Laicisation of public schools aimed to keep religious instruction separate from state education.","zh":"公立学校的世俗化旨在把宗教教学与国家教育分开。"},{"en":"The reforms led to the laicisation of hospitals and other social services.","zh":"这些改革促成了医院和其他社会服务的非宗教化。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in church contexts) the act of removing a person from the clergy, returning them to the status of a layperson","zh":"（尤用于教会语境）解除圣职；使神职人员恢复为平信徒身份"},"examples":[{"en":"The priest requested laicisation after deciding to leave the ministry.","zh":"这位神父决定离开教职后申请解除圣职。"},{"en":"Laicisation is a formal process with specific rules in the Church.","zh":"解除圣职是一个在教会内有明确规定的正式程序。"}]}],"synonyms":["secularization","disestablishment","desacralization","laicization"],"phonetic":"/ˌleɪ.ɪ.səˈzeɪ.ʃən/","extraExplanation":["“Laicisation”更常见于英式拼写；美式常写作“laicization”。在法语与欧洲政治历史中，这个词常与“laïcité（政教分离/国家世俗性）”相关，尤其常见于讨论法国公共教育、公共机构与宗教影响的分离。第二个义项多出现在天主教语境（例如某人被“laicized/获得解除圣职”），与一般社会层面的“secularization（世俗化）”含义相近但更具体。"]}
{"word":"laicise","summary":{"en":"Laicise means to make an institution or system secular rather than religious.","zh":"Laicise 指使某个机构或体系从宗教控制中脱离，变得世俗化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something less controlled by religion or religious officials; to make it secular (not religious)","zh":"使（某事物）脱离宗教或教会控制；使世俗化（非宗教化）"},"examples":[{"en":"The government voted to laicise public education so schools would not be run by religious groups.","zh":"政府投票决定使公立教育世俗化，以便学校不再由宗教团体经营。"},{"en":"Some people support laicising the legal system, while others worry it will weaken tradition.","zh":"有些人支持让法律体系世俗化，但也有人担心这会削弱传统。"}]}],"synonyms":["secularize","dechurch (less common)","make secular"],"phonetic":"/ˈleɪ.ə.saɪz/","extraExplanation":["“laicise”更常见于英式拼写；美式拼写通常为“laicize”。两者意思相同。","词根来自“laity”（平信徒、俗人），常用于讨论国家与宗教的关系（如教育、法律、政府机构的世俗化）。在一些国家历史语境中，它与“政教分离”相关。"]}
{"word":"laicised","summary":{"en":"Laicised means officially removed from clerical status (or made secular/lay).","zh":"Laicised 指被正式解除圣职身份（或更广义地被世俗化、转为平信徒）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a priest or religious person) officially removed from clerical status and returned to being a layperson; defrocked.","zh":"（指神父或修会人士）被正式解除圣职身份，恢复为平信徒；被革职（俗称“脱去神职”）。"},"examples":[{"en":"After the investigation, he was laicised by the Church.","zh":"调查结束后，他被教会正式解除圣职身份。"},{"en":"A laicised priest may no longer perform Mass.","zh":"被解除圣职的神父不再可以主持弥撒。"}]},{"partOfSpeech":"vt.","definition":{"en":"To remove someone from clerical status; to make someone a layperson; to secularize (someone or something) from Church control.","zh":"解除某人的圣职身份；使成为平信徒；（更广义）使脱离教会控制而世俗化。"},"examples":[{"en":"The bishop decided to laicise the priest for serious misconduct.","zh":"主教因严重不当行为决定解除该神父的圣职身份。"},{"en":"Some reforms aimed to laicise education and reduce religious control over schools.","zh":"一些改革旨在使教育世俗化，减少宗教对学校的控制。"}]}],"synonyms":["laicized","defrocked","secularized","deprived (of orders)"],"phonetic":"/ˈleɪ.ə.saɪzd/","extraExplanation":["“laicised”更常见于英式拼写；美式拼写通常是“laicized”。两者意义相同。","这个词多用于天主教或东正教等语境，属于较正式的教会/法律用语；日常英语里更常用“defrocked”（被革去神职）或“removed from the priesthood”（被解除神职）。"]}
{"word":"laicises","summary":{"en":"Laicises means ‘makes something more secular’ or, in church contexts, ‘removes someone from clergy status.’","zh":"Laicises 指“使……世俗化”，或在教会语境中指“解除某人神职、恢复为平信徒身份”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(especially in British English) to make something less controlled by religion or the church; to make it more secular.","zh":"（尤指英式英语）使某事物减少宗教/教会的控制；使其更世俗化。"},"examples":[{"en":"The government laicises public education to keep religion out of state schools.","zh":"政府使公共教育世俗化，以避免宗教进入公立学校。"},{"en":"Some people worry that the reforms laicises traditions too quickly.","zh":"有些人担心这些改革让传统世俗化得太快。"}]},{"partOfSpeech":"vt.","definition":{"en":"(church use) to remove a person from the clergy and return them to lay (non‑clergy) status.","zh":"（教会用语）使某位神职人员被解除圣职，回到平信徒（非神职）身份。"},"examples":[{"en":"After the ruling, the priest is laicises and may no longer perform sacraments.","zh":"裁决后，这位神父被解除圣职，不能再施行圣礼。"},{"en":"In rare cases, the church laicises members of the clergy for serious misconduct.","zh":"在少数情况下，教会会因严重不当行为解除神职人员的圣职。"}]}],"synonyms":["secularizes","makes secular","de-religionizes","defrocks (church context)","dismisses from the clergy (church context)"],"phonetic":"/ˈleɪ.ə.saɪ.zɪz/","extraExplanation":["“laicises”是动词“laicise”的第三人称单数现在时（he/she/it laicises）。美式英语更常拼作“laicizes”。","词根与“laity”（平信徒）相关：在教会语境中指“使之成为平信徒”；在社会政治语境中常译为“世俗化/政教分离化”。"]}
{"word":"laicising","summary":{"en":"Laicising means making something more secular (less religious), or—in a church context—removing someone from clerical status.","zh":"Laicising 指使某事物世俗化（去宗教化）；在教会语境中也指解除某人的神职身份。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something less controlled by religion; making it more secular","zh":"使某事物去宗教化、世俗化（减少宗教的影响或控制）"},"examples":[{"en":"The reform aimed at laicising public education so it would be neutral toward all faiths.","zh":"这项改革旨在让公共教育世俗化，从而对所有信仰保持中立。"},{"en":"Some critics worried that laicising the law would weaken traditional values.","zh":"一些批评者担心把法律世俗化会削弱传统价值观。"}]},{"partOfSpeech":"v.","definition":{"en":"(church context) removing a priest or other clergy member from official clerical status","zh":"（教会语境）解除神职人员的教职身份，使其不再属于“神职人员”身份"},"examples":[{"en":"After the investigation, the diocese began laicising the priest.","zh":"调查之后，教区开始解除该神父的神职身份。"},{"en":"The report discussed procedures for laicising clergy who violated church rules.","zh":"报告讨论了对违反教会规定的神职人员进行解除神职的程序。"}]}],"synonyms":["secularizing","de-religifying","making secular","laicizing"],"phonetic":"ˈleɪəˌsaɪzɪŋ","extraExplanation":["“laicising”是英式拼写；美式更常见“laicizing”。两者意思相同。","词根与“laity（平信徒/俗人）”相关：laicise/laicize原意可理解为“使之成为平信徒/俗人状态”。","在天主教等语境中，第二个含义更专门，常见名词是“laicization（解除神职/革职为平信徒）”。"]}
{"word":"laicism","summary":{"en":"Laicism means secularism—keeping religion separate from the state (and sometimes emphasizing the authority of laypeople over clergy).","zh":"Laicism 指“政教分离/世俗主义”理念（有时也指强调平信徒相对神职人员的权威）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the principle that religion (especially the Church) should not control government, public education, or other public institutions; secularism","zh":"政教分离（或世俗主义）理念：主张宗教（尤其教会）不应控制政府、公共教育等公共机构"},"examples":[{"en":"France’s debate over laicism often focuses on religious symbols in public schools.","zh":"法国关于政教分离的争论常常聚焦于公立学校中的宗教符号。"},{"en":"The constitution supports laicism by keeping the state neutral toward all religions.","zh":"宪法通过让国家对所有宗教保持中立来支持政教分离原则。"}]},{"partOfSpeech":"n.","definition":{"en":"the view that ordinary non‑religious people (laypeople) should have authority in religious matters rather than clergy","zh":"平信徒主义：主张在宗教事务中应由普通信众（平信徒）而非神职人员拥有更多权威"},"examples":[{"en":"In some movements, laicism challenged the power of the clergy.","zh":"在一些运动中，平信徒主义挑战了神职人员的权力。"}]}],"synonyms":["secularism","separation of church and state","laicity","nonclericalism"],"phonetic":"/ˈleɪ.əˌsɪz.əm/","extraExplanation":["“laicism”常用于政治与社会语境，尤其谈法国的“laïcité（世俗性/政教分离）”。它强调国家在公共领域的中立性：不偏袒任何宗教，也不让宗教支配国家政策。","词源上来自法语相关词（laïque，意为“平信徒的、非宗教人士的”），再追溯到拉丁语 laicus（平民/非神职人员）。在英文写作里，这个词相对正式、学术化。"]}
{"word":"laicisms","summary":{"en":"Laicisms are beliefs or practices that emphasize (1) strict separation of religion from public life, or (2) greater power for laypeople in church affairs.","zh":"Laicisms 指一类观念或做法，强调（1）宗教与公共领域的严格分离，或（2）平信徒在教会事务中拥有更大的权力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The principle that public life (especially government and schools) should be kept free from religious control or influence; strict separation of religion and the state.","zh":"（尤指政府与学校等公共领域）应避免受宗教控制或影响的原则；强调政教严格分离。"},"examples":[{"en":"French debates about laicism often focus on religion in public schools.","zh":"法国关于“政教分离主义”的争论常常聚焦于公立学校中的宗教问题。"},{"en":"Supporters of laicism argue that the state must remain neutral toward all religions.","zh":"支持政教分离主义的人认为国家必须对所有宗教保持中立。"}]},{"partOfSpeech":"n.","definition":{"en":"The view or practice that laypeople (non-clergy) should have significant authority or influence in church affairs.","zh":"认为平信徒（非神职人员）应在教会事务中拥有重要权力或影响的观点或做法。"},"examples":[{"en":"Some reforms promoted laicism by giving lay members more decision-making power.","zh":"一些改革通过赋予平信徒更多决策权来推动“平信徒主义”。"},{"en":"In that parish, laicism meant that community leaders helped manage finances and programs.","zh":"在那个教区，“平信徒主义”意味着社区领袖协助管理财务与活动项目。"}]}],"synonyms":["secularism","laïcité","separation of church and state","anticlericalism","lay control"],"phonetic":"/ˈleɪɪˌsɪzəm/","extraExplanation":["“laicism”常与法语“laïcité（世俗主义/政教分离原则）”相关，但英语里也可能指教会内部的“平信徒影响力”增加。语境不同，侧重点会不同：谈国家与公共政策时更接近“世俗主义/政教分离”；谈教会治理结构时更接近“平信徒参与/平信徒掌权”。","词根与“laity（平信徒）”“laic（非神职的）”同源，来源于希腊语“laikos”，意为“属于人民的”。"]}
{"word":"laicity","summary":{"en":"Laicity means (1) being non-clerical (lay status) and (2) the principle of a secular public sphere independent of religious authority.","zh":"Laicity 指（1）非神职/平信徒身份与性质；（2）公共领域的世俗性原则（不受宗教权威支配）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being a layperson (not a member of the clergy); the non-clerical character of a person, group, or institution","zh":"（个人/团体/机构）作为“平信徒”（非神职人员）的状态或性质；非宗教神职的特征"},"examples":[{"en":"The committee’s laicity helped keep the discussion focused on community needs rather than church policy.","zh":"委员会的平信徒性质让讨论更能聚焦社区需求，而不是教会政策。"},{"en":"Some religious schools emphasize the laicity of their staff, even if the school has a faith background.","zh":"一些宗教背景的学校会强调员工的非神职身份，即使学校有宗教传统。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in discussions of politics) the principle that public institutions should be secular, independent from religious authority","zh":"（尤用于政治语境）世俗性原则：公共机构应保持中立与世俗，不受宗教权威支配"},"examples":[{"en":"The debate centered on laicity and whether religious symbols should be allowed in public schools.","zh":"争论的焦点是世俗性原则，以及公立学校是否应允许宗教符号。"},{"en":"Supporters argued that laicity protects everyone’s freedom of belief.","zh":"支持者认为世俗性原则能保护每个人的信仰自由。"}]}],"synonyms":["lay status","lay character","secularism","(French) laïcité"],"phonetic":"/leɪˈɪsəti/","extraExplanation":["“laicity”来自“laity”（平信徒、俗人），常见于宗教与社会学写作。它有时会被用来对应法语概念“laïcité”（法式政教分离/国家世俗化原则），但英语里更常直接借用写作“laïcité”。","在讨论“laïcité/ laicity”时，不同国家的历史背景差异很大：在法国语境中，它往往不仅指“政教分离”，还强调公共领域的宗教中立，因此会引发关于宗教符号、学校着装等议题的争论。"]}
{"word":"laicization","summary":{"en":"Laicization means making something secular (less under religious control), or formally removing someone from clergy to lay status.","zh":"laicization 指“世俗化/去宗教化”，也可指“解除神职、恢复为平信徒身份”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making something less controlled by religion, especially moving institutions (like schools or government) from church authority to secular (non-religious) authority.","zh":"（尤指学校、政府等机构）“世俗化/去宗教化”的过程：把原本由教会或宗教权威控制的事务转交给世俗（非宗教）机构或权力。"},"examples":[{"en":"Laicization of public education meant religious groups no longer controlled the curriculum.","zh":"公共教育的去宗教化意味着宗教团体不再控制课程内容。"},{"en":"The constitution promoted laicization to keep the state neutral toward religion.","zh":"宪法推动国家世俗化，以保持国家对宗教的中立。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Christian traditions, the act of removing a clergy member from clerical status and returning them to lay (non-clergy) status.","zh":"（某些基督教传统中）将神职人员解除神职、恢复为平信徒身份的行为。"},"examples":[{"en":"The priest requested laicization after leaving the ministry.","zh":"这位神父离开圣职后申请解除神职（恢复为平信徒）。"},{"en":"Laicization is a formal legal process within the Church.","zh":"解除神职在教会内部是一种正式的法律程序。"}]}],"synonyms":["secularization","disestablishment","deconfessionalization"],"phonetic":"/ˌleɪ.ə.səˈzeɪ.ʃən/","extraExplanation":["“laicization”源自“laity / lay”（平信徒）这一概念，核心是从“神职/宗教控制”转向“平信徒/世俗控制”。因此它既可用于政治社会语境（政教分离、国家世俗化），也可用于教会内部语境（解除神职）。","在法语与欧洲政治语境中常与“laïcité（世俗主义/国家中立的世俗原则）”相关；英文里在谈法国等国家的政教关系时也会出现。"]}
{"word":"laicize","summary":{"en":"Laicize means to make something secular, or (in the Catholic Church) to remove someone from clerical status and return them to lay status.","zh":"Laicize 指使事物世俗化；也可指（天主教中）解除圣职、使神职人员还俗成为平信徒。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something secular; to remove religious control, influence, or character from an institution, practice, or public life","zh":"使世俗化；使（机构、制度或公共生活）脱离宗教控制或宗教色彩"},"examples":[{"en":"The government voted to laicize the school system, moving it away from church control.","zh":"政府投票决定让学校系统世俗化，使其不再由教会控制。"},{"en":"Many countries have tried to laicize public administration so that laws apply equally to all citizens.","zh":"许多国家试图让公共管理世俗化，使法律对所有公民一视同仁。"}]},{"partOfSpeech":"vt.","definition":{"en":"(especially in the Roman Catholic Church) to remove a priest or member of a religious order from clerical status and return them to lay status","zh":"（尤指天主教）使（神职人员/修会成员）解除圣职、还俗，恢复为平信徒身份"},"examples":[{"en":"After a long legal process, the priest was laicized.","zh":"经过漫长的教会法律程序，这位神父被解除圣职并还俗。"},{"en":"He requested to be laicized so he could marry.","zh":"他申请还俗，以便结婚。"}]}],"synonyms":["secularize","dechristianize","defrock"],"phonetic":"/ˈleɪ.ə.saɪz/","extraExplanation":["“laicize”来自“laity”（平信徒），核心含义是“变成平信徒/世俗化”。在新闻与政治语境中，它常对应法语“laïcité（世俗主义/政教分离理念）”相关讨论。","在天主教语境里，laicize 通常是教会法意义上的正式程序（有时也会看到短语 be laicized / be reduced to the lay state），与一般口语里的“辞职”不同。"]}
{"word":"laicized","summary":{"en":"Laicized means officially made a layperson (no longer clergy), or more generally made more secular.","zh":"Laicized 指（神职人员）被官方解除神职、恢复为平信徒；也可泛指变得更世俗化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a priest or member of the clergy) officially removed from clerical status and returned to the status of a layperson.","zh":"（指神父或神职人员）被官方解除神职身份，恢复为平信徒身份。"},"examples":[{"en":"The priest was laicized after an investigation by the church.","zh":"教会调查后，这位神父被解除神职（被俗化）。"},{"en":"He later married after being laicized.","zh":"他在被解除神职后后来结婚了。"}]},{"partOfSpeech":"adj.","definition":{"en":"made less controlled by religious authorities; made more secular or non-clerical.","zh":"使宗教权威的控制减少；使更世俗化、非神职化。"},"examples":[{"en":"Over time, the school became laicized and focused more on civic education.","zh":"随着时间推移，这所学校逐渐世俗化，更注重公民教育。"},{"en":"Some communities prefer a laicized public space where no single religion dominates.","zh":"有些社群更偏好世俗化的公共空间，不让任何单一宗教占主导。"}]}],"synonyms":["secularized","defrocked","declericalized","returned to the lay state"],"phonetic":"/ˈleɪ.ə.saɪzd/","extraExplanation":["“laicized”常见于天主教语境，表示把神职人员“还俗/解除圣职”（近似“defrocked”，但“defrocked”更口语、语气更强；“laicized”更偏正式、法律/教会程序用语）。","英式拼写常见为“laicised”。词根来自“laity”（平信徒、俗人），核心概念是从“clergy（神职人员）”变为“layperson（平信徒）”。"]}
{"word":"laicizer","summary":{"en":"A laicizer is someone or something that makes an institution or practice more secular or less controlled by clergy.","zh":"laicizer 指使制度或做法更世俗化、减少神职人员控制的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that makes someone or something less controlled by religious clergy; someone who turns something into a lay (non-clergy) or more secular form.","zh":"使某人/某事摆脱神职人员控制、变得更“世俗化”或“平信徒化”的人或事物。"},"examples":[{"en":"Some historians describe the new education policy as a laicizer of public schools.","zh":"一些历史学者把新的教育政策描述为公立学校的“世俗化推动者”。"},{"en":"In the debate, critics worried that the reform would act as a laicizer of the church’s traditional roles.","zh":"在辩论中，批评者担心这项改革会削弱教会的传统角色，起到“去神职化/世俗化”的作用。"}]}],"synonyms":["secularizer","de-clericalizer","secularizing force"],"phonetic":"/ˈleɪ.ə.saɪ.zɚ/","extraExplanation":["“laicizer”来自动词“laicize”（使平信徒化/使世俗化），常见于宗教史、政治史与教育政策语境，尤其在讨论“政教分离”“世俗国家（laïcité）”或教会权力变化时。","该词在日常口语中不常用，更常见的表达包括“secularizer（世俗化者/推动者）”或“to secularize（使世俗化）”。"]}
{"word":"laicizes","summary":{"en":"“Laicizes” means (1) makes something more secular, or (2) removes someone from clerical status.","zh":"“laicizes”表示（1）使世俗化；或（2）解除某人的神职身份。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something less religious or more secular; to remove religious control or influence","zh":"使（某事物）世俗化；减少宗教色彩或宗教控制"},"examples":[{"en":"The government laicizes public schools by removing mandatory religious classes.","zh":"政府通过取消强制性的宗教课程来使公立学校世俗化。"},{"en":"Some people worry that new policies laicizes national traditions too quickly.","zh":"一些人担心新政策让国家传统过快地世俗化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove a priest or religious official from clerical status, making them a layperson","zh":"解除（神职人员）的神职身份，使其成为平信徒"},"examples":[{"en":"The bishop laicizes a priest after a formal investigation.","zh":"经过正式调查后，主教解除一名神父的神职身份。"},{"en":"He was laicized and could no longer serve as a priest.","zh":"他被解除神职后，不能再以神父身份服务。"}]}],"synonyms":["secularizes","de-Christianizes","disestablishes","defrocks"],"phonetic":"/ˈleɪ.ə.saɪz/","extraExplanation":["“laicizes”是动词“laicize”的第三人称单数（he/she/it laicizes）。常见于宗教、历史与政治语境，尤其在讨论“政教分离”“国家世俗化”时出现。","词根与“laity”（平信徒）相关：把原本属于神职或宗教体系的事物“变成由平信徒/世俗社会来管理”。第二个义项更偏教会内部用语，常见于天主教语境（类似“解除圣职/解除神职”）。"]}
{"word":"laicizing","summary":{"en":"Laicizing means making something secular or, in church contexts, removing someone from clerical status.","zh":"Laicizing 指使……世俗化；在教会语境中也指解除某人的神职身份。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Gerund/present participle of laicize) making something secular (not controlled by the church), or reducing religious influence in an institution or activity.","zh":"（laicize 的动名词/现在分词）使……世俗化（不再由教会掌控），或降低宗教在机构/活动中的影响。"},"examples":[{"en":"The government is laicizing public schools by removing mandatory religious instruction.","zh":"政府正在让公立学校世俗化，取消强制性的宗教课程。"},{"en":"Some citizens support laicizing the legal system so laws don’t favor any one religion.","zh":"一些公民支持让法律体系世俗化，使法律不偏向任何特定宗教。"}]},{"partOfSpeech":"v.","definition":{"en":"(Gerund/present participle of laicize, church use) removing a clergy member from clerical status and returning them to the role of an ordinary layperson.","zh":"（laicize 的动名词/现在分词，教会语境）将神职人员解除神职身份，使其回归为普通平信徒。"},"examples":[{"en":"The diocese began the process of laicizing the priest after a formal investigation.","zh":"在正式调查后，教区开始启动解除该神父神职的程序。"},{"en":"Laicizing a cleric is different from a temporary suspension from ministry.","zh":"解除神职与暂时停职（停止牧职）不同。"}]}],"synonyms":["secularizing","dechurching","disestablishing","defrocking (church context)","removing from clerical status"],"phonetic":"/ˈleɪ.ə.saɪ.zɪŋ/","extraExplanation":["“laicizing”多见于政治/教育等讨论“政教分离、世俗化”（secularization）的语境；在天主教等教会法语境中，laicize 指“解除神职”（也常被通俗称为 defrock，但 defrock 更口语且有时带贬义）。","词根来自“laity”（平信徒、俗人），核心对比是 clergy（神职人员）与 laity（平信徒）。"]}
{"word":"laics","summary":{"en":"“Laics” means laypeople—people who are not clergy, especially in a religious context.","zh":"“laics”指平信徒／非神职人员，常用于宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of laic: laypeople—people who are not members of the clergy (not priests, ministers, monks, etc.).","zh":"laic 的复数：平信徒／俗人——指不是神职人员的人（不是牧师、神父、僧侣等）。"},"examples":[{"en":"The ceremony was attended by both clergy and laics.","zh":"典礼上既有神职人员，也有平信徒参加。"},{"en":"In this tradition, laics can also lead certain community prayers.","zh":"在这个传统中，平信徒也可以带领某些社区祈祷。"}]}],"synonyms":["laypeople","laypersons","the laity","non-clergy"],"phonetic":"/ˈleɪɪks/","extraExplanation":["“laic”在现代英语里相对少见，更常用的是“layperson / laypeople”或“the laity（统称平信徒阶层）”。","词源上与拉丁语“laicus（属于民众的）”有关，常用于宗教语境，强调“非神职人员”。在更宽泛的语境里，也可理解为“非专业人士”。"]}
{"word":"laid","summary":{"en":"“Laid” is the past form of “lay,” meaning to put/place something down; it can also mean (animals) produced eggs, and informally it can be a rude slang for having sex.","zh":"“laid”是“lay”的过去式/过去分词，常指把某物放下或放平；也可指（动物）产卵；在俚语中还可粗俗地指发生性关系。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “lay”: put or placed something down in a flat position.","zh":"“lay”的过去式和过去分词：把某物放下、放平（使其处于平放的位置）。"},"examples":[{"en":"She laid the book on the table.","zh":"她把书放在桌子上。"},{"en":"He had laid his keys by the door, but now they’re gone.","zh":"他之前把钥匙放在门边，但现在不见了。"}]},{"partOfSpeech":"v.","definition":{"en":"(of animals/birds) produced eggs.","zh":"（动物/鸟类）产（卵）、下（蛋）。"},"examples":[{"en":"The hen laid three eggs this week.","zh":"这只母鸡这周下了三枚蛋。"},{"en":"Sea turtles lay eggs on the beach; the eggs are laid in the sand.","zh":"海龟在海滩产卵；卵会被产在沙里。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, slang) had sex with someone.","zh":"（非正式/俚语）与某人发生性关系。"},"examples":[{"en":"That word is rude—avoid it in polite conversation.","zh":"这个说法比较粗俗——在正式或礼貌的场合应避免使用。"}]}],"synonyms":["placed","put","set down","deposited"],"phonetic":"/leɪd/","extraExplanation":["学习提示：很多学习者会混淆 **lay** 和 **lie**。一般规律是：**lay + 宾语**（把“某物”放下：lay/laid/laid）；**lie** 不带宾语（自己“躺/位于”：lie/lay/lain）。例如：*I lay the phone down.*（我把手机放下） vs. *I lie down.*（我躺下）。","常见搭配里会看到 **laid**：**laid off**（裁员）、**laid out**（摆放好/规划好/昏倒）、**laid-back**（悠闲的、随和的）。这些更像固定搭配或复合词。"]}
{"word":"laid-back","summary":{"en":"Relaxed and easygoing.","zh":"轻松随和、不拘谨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relaxed and easygoing; not strict, formal, or easily stressed.","zh":"放松的；随和的；不拘谨的（不太紧张、要求不严或不那么正式）。"},"examples":[{"en":"She has a laid-back attitude, even during busy weeks.","zh":"她的态度很随和，即使在很忙的几周也不太紧张。"},{"en":"Our office dress code is pretty laid-back.","zh":"我们办公室的着装要求挺不严格的。"},{"en":"He’s laid-back with his kids, but still sets clear rules.","zh":"他对孩子比较放松，但还是会定下明确的规则。"}]}],"synonyms":["relaxed","easygoing","chill","casual","unhurried"],"phonetic":"/ˌleɪd ˈbæk/","etymology":"源自口语表达“laid back”（字面是“向后躺着/靠着”），引申为“身体放松”，再进一步引申为“性格/氛围轻松、不紧绷”。常用连字符写作 laid-back 作形容词。","mnemonic":["把它想成“lay back = 往后躺、放松一下”，性格也就“laid-back（很chill）”。","联想中文“躺平一点”，不那么紧绷=随和、轻松。"]}
{"word":"laid-backness","summary":{"en":"Relaxed, easygoing quality or vibe.","zh":"悠闲随和的特质或氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A relaxed, easygoing quality or attitude; the state of being calm and not easily worried or stressed.","zh":"悠闲随和的气质或态度；不紧张、不太焦虑的状态。"},"examples":[{"en":"I like the laid-backness of this town—people don’t rush everywhere.","zh":"我喜欢这个小镇的悠闲氛围——人们不会到处匆匆忙忙。"},{"en":"Her laid-backness helped the team stay calm under pressure.","zh":"她的随和让团队在压力下也能保持冷静。"},{"en":"The café’s laid-backness makes it a great place to study.","zh":"这家咖啡馆的轻松氛围让它成为学习的好地方。"}]}],"synonyms":["relaxation","ease","casualness","easygoingness","chillness","informality"],"phonetic":"/ˈleɪd ˌbæk.nəs/","extraExplanation":["语体上偏口语/非正式，常用来夸一种“轻松、好相处”的气质或场所氛围。","注意语感：laid-backness 多是褒义（放松、从容）；但在某些语境里也可能暗含“太佛系/不够上心”。"],"etymology":"由形容词 laid-back（随和的、悠闲的）+ 名词后缀 -ness（表示“……的状态/性质”）构成；laid-back 原意与“向后躺/靠着”有关，引申为“放松、不紧绷”。","mnemonic":["记后缀：-ness = “……的程度/状态”（如 happiness 幸福感），所以 laid-backness = “laid-back 的状态”。","把 laid-back 想成“躺靠着很放松”，加上 -ness 就是“这种放松感/随和感”。"]}
{"word":"laidly","summary":{"en":"Laidly is a rare, old word meaning “ugly” (and sometimes “in an ugly/awkward way”).","zh":"Laidly 是非常罕见的古语，意思是“丑陋的”（有时也作副词表示“难看/笨拙地”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/rare, especially Scots) ugly; unpleasant to look at.","zh":"（古语/罕用，尤见于苏格兰英语）丑陋的；难看的。"},"examples":[{"en":"In some old Scots tales, a “laidly” creature is one that looks frightening or ugly.","zh":"在一些古老的苏格兰故事里，称某个生物为“laidly”，意思是它看起来吓人或很丑。"},{"en":"The poet described the hut as laidly, but warm inside.","zh":"诗人把那间小屋写得“laidly”（难看），但里面很温暖。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic/rare) in an ugly or awkward way; unattractively.","zh":"（古语/罕用）以难看的方式；笨拙地；不美观地。"},"examples":[{"en":"The clothes hung laidly on the line after the storm.","zh":"暴风雨后，衣服挂在晾衣绳上显得很不整齐、难看。"}]}],"synonyms":["ugly","unattractive","unsightly","loathsome"],"phonetic":"/ˈleɪdli/","extraExplanation":["“laidly”非常罕见，现代英语里几乎不用。很多学习者看到它时，其实想找的是 **lately**（最近、近来），两者拼写相近但意思完全不同。","如果你本来要问“lately”，告诉我你的句子，我可以给你更常用的用法、搭配（如 *Have you been busy lately?*）和近义词区分（*recently* 等）。"]}
{"word":"laier","summary":{"en":"“laier” is likely a misspelling of “liar,” meaning a person who tells lies.","zh":"“laier”很可能是“liar”的拼写错误，意思是“说谎者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who tells lies; someone who does not tell the truth","zh":"说谎者；撒谎的人"},"examples":[{"en":"Don’t call him a liar unless you are sure.","zh":"除非你确定，否则不要叫他“说谎者”。"},{"en":"She admitted she had lied, but she isn’t a liar all the time.","zh":"她承认自己撒了谎，但她并不是一直都在说谎。"}]}],"synonyms":["fibber","storyteller","deceiver"],"phonetic":"/ˈlaɪər/","extraExplanation":["“laier”不是常见的英文拼写，最可能是把 **liar** 拼错了。**liar** 的发音是 /ˈlaɪər/。","容易混淆的词：**layer**（层；分层的人/物，/ˈleɪər/）和 **lair**（野兽的巢穴；藏身处，/ler/）。拼写和发音都不同。"]}
{"word":"laigh","summary":{"en":"“Laigh” is a Scots word meaning “low,” used as an adjective or adverb.","zh":"“laigh”是苏格兰方言词，意思相当于“low（低的/低地）”，可作形容词或副词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots) low; not high in position, level, or status.","zh":"（苏格兰英语/苏格兰方言）低的；不高的（位置、水平或地位）。"},"examples":[{"en":"The sun hung laigh in the winter sky.","zh":"冬天的天空里，太阳挂得很低。"},{"en":"They built a laigh wall to keep the view open.","zh":"他们建了一道矮墙，好让视野保持开阔。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Scots) low; in a low position; below.","zh":"（苏格兰英语/苏格兰方言）低地；在低处；在下面。"},"examples":[{"en":"Keep your head laigh when you walk under the branch.","zh":"从树枝下面走时，把头放低。"},{"en":"The village lies laigh by the river.","zh":"村庄坐落在河边的低处。"}]}],"synonyms":["low","below","down"],"phonetic":"/leɪ/","extraExplanation":["“laigh”主要见于苏格兰英语（Scots）和带苏格兰口音的文学作品里，相当于标准英语的“low”。常用来营造地方色彩或乡土叙述语气。","在苏格兰诗歌与民谣语境中很常见（例如罗伯特·彭斯 Robert Burns 的作品常出现类似词形与拼写），读起来会有更“口语/方言”的味道。"]}
{"word":"laighs","summary":{"en":"“Laighs” is a Scots dialect word meaning “the lowlands/low-lying ground,” but it’s often a misspelling of “laughs.”","zh":"“laighs”在苏格兰方言中指“低地/低洼地带”，但也常见为把标准英语“laughs（笑/笑声）”拼错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) low-lying land; the lowlands (plural).","zh":"（苏格兰方言）低地；低洼地带（复数）。"},"examples":[{"en":"The sheep grazed on the laighs near the river.","zh":"羊群在河边的低地上吃草。"},{"en":"In winter, the laighs can flood more easily than the hills.","zh":"冬天低地比山地更容易被淹。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) “laughs”: the plural form of “laugh,” or the verb “laugh” in the third-person singular (he/she laughs).","zh":"（更常见为拼写错误）“laughs”：名词“笑声”的复数；或动词“laugh”的第三人称单数（他/她笑）。"},"examples":[{"en":"Her laughs filled the room.","zh":"她的笑声充满了房间。"},{"en":"He laughs at his own jokes.","zh":"他会笑自己的笑话。"}]}],"synonyms":["lowlands","lows","low-lying ground"],"phonetic":"/leɪz/","extraExplanation":["“laigh”是苏格兰英语/苏格兰语（Scots）里的词，常见于文学或地方用法，意思接近“low（低的）/lowland（低地）”。写作“the laighs”时常特指“低地地区”。","如果你本来想写的是标准英语“laughs”，正确拼写是 laughs（不是 laighs）。可以告诉我你的句子语境，我能帮你确认是哪一个意思。"]}
{"word":"laik","summary":{"en":"“Laik” is an informal, nonstandard spelling of “like,” mostly seen online.","zh":"“laik”多见于网络，是“like”的非正式、非标准拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or playful spelling of “like,” often used in texting or online to imitate pronunciation, show informality, or sound humorous.","zh":"“like”的非标准/戏谑拼写，常见于短信或网络，用来模仿发音、表现随意或制造幽默效果。"},"examples":[{"en":"I laik this song a lot.","zh":"我很喜欢这首歌。"},{"en":"She was laik, “No way!” (informal internet style)","zh":"她当时就像是在说：“不可能！”（网络随意写法）"}]}],"synonyms":["like"],"phonetic":"/laɪk/","extraExplanation":["“laik”不是标准英语拼写，正式写作（作业、邮件、报告）请用“like”。","网络里用“laik”有时带有“故意装可爱/搞笑/口语化”的语气；也可能只是单纯打错字。"]}
{"word":"Laila","summary":{"en":"a female personal name","zh":"女性人名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name; also used as a surname in some cultures","zh":"女性名字；在一些文化中也可作姓氏"},"examples":[{"en":"Laila moved to Chicago for college.","zh":"Laila 为了上大学搬到了芝加哥。"},{"en":"Ask Laila if she can join the meeting at 3 p.m.","zh":"问问 Laila 能不能参加下午三点的会议。"}]}],"synonyms":["Layla","Leila","Leyla"],"phonetic":"/ˈlaɪlə/","extraExplanation":["在英语世界里更常见的拼写还有 Layla、Leila、Leyla。不同拼写通常只是转写差异，读音和文化来源可能相近。","流行文化中，“Layla”也是一首著名摇滚歌曲（Eric Clapton / Derek and the Dominos），让这个名字在英语语境里更为人熟知。"],"etymology":"多来源人名拼写。常见来源之一是阿拉伯语“Layla/Leila”（ليلى），本义与“夜晚”相关，因此在许多文化里带有“夜色、夜之美”的意象；也可见于波斯语、希伯来语等语境中的相关拼写与借用。","mnemonic":["把它联想成阿拉伯语里与“night（夜晚）”相关：Laila ≈ Layla（夜色的名字）。","记拼写：Lai- 像“来”，-la 像“啦”，读起来顺口：来啦（Laila）。"]}
{"word":"laimun","summary":{"en":"A layman is a non-expert—someone without professional training in a subject.","zh":"Layman 指“外行/非专业人士”，没有受过某领域的专业训练。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a trained specialist in a particular subject (especially not a professional in law, medicine, or the church)","zh":"外行；非专业人士（尤指非法律、医学或教会专业人员）"},"examples":[{"en":"I’m a layman, so could you explain it in simple terms?","zh":"我是外行，你能用简单的话解释一下吗？"},{"en":"To a layman, the report is hard to understand.","zh":"对外行来说，这份报告很难懂。"}]}],"synonyms":["layperson","nonexpert","amateur"],"phonetic":"/ˈleɪmən/","extraExplanation":["你输入的“laimun”通常是拼写误差；最常见对应词是 **layman**。在英语里常见搭配有 **to a layman**（对外行来说）、**in layman’s terms**（用外行能懂的话/通俗说法）。","**lay-** 在这里有“非神职人员、非专业人士”的意思（如教会语境中的“lay people”），所以 **layman** 不表示“躺下的人”。在现代英语中也常用更中性的说法 **layperson**。"]}
{"word":"lain","summary":{"en":"“Lain” is the past participle of “lie” (to lie down or be located).","zh":"“lain”是“lie（躺；位于）”的过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past participle of “lie” (to be in a flat/resting position). Used with “have/has/had” (e.g., “has lain”) and sometimes after “be” in older or formal style.","zh":"“lie（躺；位于）”的过去分词。常与“have/has/had”连用（如“has lain”），有时在较正式或较旧的用法中也可接在“be”后。"},"examples":[{"en":"She has lain in bed all morning because she felt sick.","zh":"她因为不舒服，整个早上都躺在床上。"},{"en":"The book had lain untouched on the shelf for years.","zh":"那本书在书架上多年无人翻动。"},{"en":"By sunset, the city had lain quiet under the snow.","zh":"到日落时分，城市在雪下静静地躺着（显得很安静）。"}]}],"synonyms":["reclined","rested","been lying"],"phonetic":"/leɪn/","extraExplanation":["“lain”常让学习者困惑，因为它来自不及物动词“lie（躺）”，而不是“lay（放置）”。常见变化：lie–lay–lain（躺）；lay–laid–laid（放）。例如：I lay down yesterday. / I have lain down many times. 但：I laid the book on the table. / I have laid it there.","在文学或较正式的写作中，“lie/lain”也可表示“位于、处于某种状态”：The village has lain abandoned for decades（村庄荒废了几十年）。"]}
{"word":"lainage","summary":{"en":"“Lainage” means woolen cloth or woolen textiles.","zh":"“lainage”指羊毛织物或毛纺品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"woolen goods or cloth; textiles made from wool.","zh":"羊毛织物；毛纺品（由羊毛制成的布料或纺织品）。"},"examples":[{"en":"The boutique specializes in European lainage, including soft wool scarves and coats.","zh":"这家精品店主打欧洲羊毛织物，包括柔软的羊毛围巾和大衣。"},{"en":"For winter garments, designers often choose lainage because it holds warmth well.","zh":"做冬装时，设计师常选用羊毛织物，因为它很保暖。"}]}],"synonyms":["woolens","woolen fabric","wool cloth","woolen goods"],"phonetic":"/ˈleɪnɪdʒ/","extraExplanation":["“lainage”是从法语借入的纺织行业用词，日常英语里比较少见，更常用的说法是“woolens / woolen fabric / wool cloth”。在商品说明、服装面料介绍或纺织贸易语境中更可能看到。"]}
{"word":"laine","summary":{"en":"“Laine” is usually a personal name; it can also mean “wool” when seen as a French word on clothing labels.","zh":"“Laine”通常是人名/姓氏；也可能作为法语词出现在衣物标签上，表示“羊毛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name or family name (proper noun), used in English-speaking contexts","zh":"（专有名词）人名或姓氏，在英语语境中使用"},"examples":[{"en":"Laine is my coworker in the marketing team.","zh":"Laine 是我市场团队的同事。"},{"en":"Dr. Laine will see you at 3 p.m.","zh":"Laine 医生会在下午三点见你。"}]},{"partOfSpeech":"n.","definition":{"en":"(from French) “wool”; used sometimes in fashion/textile contexts","zh":"（源自法语）“羊毛”；有时用于时尚/纺织语境"},"examples":[{"en":"The label says “laine,” meaning the sweater is made of wool.","zh":"标签上写着“laine”，意思是这件毛衣是羊毛材质。"},{"en":"In French, “laine” refers to wool fabric or yarn.","zh":"在法语里，“laine”指羊毛面料或毛线。"}]}],"synonyms":["(name) —","(French meaning) wool"],"phonetic":"/leɪn/","extraExplanation":["“laine”在英语中更常见的是人名/姓氏；作为“羊毛”的意思主要来自法语标签或纺织相关场景。","词源补充：法语“laine”（羊毛）源自拉丁语“lāna”（羊毛）。","另外，“Laine”在芬兰语里意为“波浪/浪”，所以在北欧也可能作为名字出现。"]}
{"word":"lainer","summary":{"en":"“Lainer” is usually a misspelling of “liner”: an inner covering, a vehicle on a regular route (especially a ship), or a single line of text (as in “one-liner”).","zh":"“lainer”通常是“liner”的误拼：可指内衬/衬里、定期航线的交通工具（尤指客轮），或文字中的“一行”（如 one-liner）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled) a person or thing that lines something, or a layer/covering placed inside something for protection or decoration.","zh":"（常拼作）liner：给某物加内衬/衬里的东西；或指用来保护、装饰的内层覆盖物。"},"examples":[{"en":"Put a plastic liner in the trash can to keep it clean.","zh":"在垃圾桶里套一个塑料内衬，保持干净。"},{"en":"The jacket has a warm liner for winter.","zh":"这件夹克有保暖内衬，适合冬天。"}]},{"partOfSpeech":"n.","definition":{"en":"A large ship (or sometimes an aircraft/bus) that travels on a regular route and schedule.","zh":"（远洋）定期航线的大型客轮；也可指按固定线路和时间运行的飞机/长途车。"},"examples":[{"en":"They crossed the ocean on a liner.","zh":"他们乘坐定期客轮横渡了大洋。"},{"en":"The airline became famous for its long-distance liners.","zh":"这家航空公司因其长程定期航班而出名。"}]},{"partOfSpeech":"n.","definition":{"en":"A single line of text (often used in poetry, scripts, or jokes), especially in compounds like “one-liner.”","zh":"（文字的）一行；常见于合成词如 one-liner（一句话笑话/妙语）。"},"examples":[{"en":"That comedian is great at quick one-liners.","zh":"那个喜剧演员很擅长抖机灵的一句话笑话。"},{"en":"Write a short poem with four liners.","zh":"写一首四行的短诗。"}]}],"synonyms":["inner lining","covering","ocean liner","one-liner"],"phonetic":"/ˈlaɪnɚ/","extraExplanation":["“lainer”通常不是标准拼写；你大概率想查的是“liner”。如果你指的是人名（姓氏）Lainer，它属于专有名词，需要结合具体语境（例如某位运动员/作者）来解释。","常见搭配：trash-can liner（垃圾桶内衬/垃圾袋）、eyeliner（眼线笔）、ocean liner（远洋客轮）、one-liner（一句话妙语/笑话）。"]}
{"word":"laiose","summary":{"en":"Laois is a county in Ireland (Leinster), with Portlaoise as its main town.","zh":"Laois 是爱尔兰（伦斯特省）的一个郡，主要城镇/郡治是 Portlaoise。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A county in the Republic of Ireland, in the province of Leinster; its county town is Portlaoise.","zh":"（专有名词）爱尔兰共和国伦斯特省的一个郡；郡治为波特劳伊斯（Portlaoise）。"},"examples":[{"en":"She grew up in County Laois in central Ireland.","zh":"她在爱尔兰中部的劳伊斯郡（County Laois）长大。"},{"en":"We drove through Laois on the way to Dublin.","zh":"我们去都柏林的路上开车经过劳伊斯郡。"}]}],"synonyms":["County Laois"],"phonetic":"/ˈliːʃə/","extraExplanation":["注意拼写：常见拼法是 **Laois**（不是 *laiose*）。它的读音对英语学习者很不直观，通常读作“LEESH-uh”。","地名背景：Laois 源自爱尔兰语 **Laois**（与古代部族/地区名有关）。历史上在英语里曾被称为 **Queen’s County**（女王郡），1922年后恢复为 Laois。","相关地名：**Portlaoise**（郡治）里也包含 Laois，但拼写不同，读音大致是“port-LEESH”。"]}
{"word":"lair","summary":{"en":"A lair is a hiding place—especially an animal’s den or a secret retreat (often with a dark or criminal feel).","zh":"lair 指“藏身处”，常指动物的巢穴；也可指人的秘密据点（常带阴暗或犯罪的语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wild animal’s home or hiding place, often a den-like shelter.","zh":"（野生动物的）巢穴；藏身处，常指像洞穴一样的栖身地。"},"examples":[{"en":"The fox ran back to its lair when it sensed danger.","zh":"狐狸感觉到危险时就跑回了自己的巢穴。"},{"en":"We found paw prints leading to the bear’s lair.","zh":"我们发现爪印通向熊的巢穴。"}]},{"partOfSpeech":"n.","definition":{"en":"A secret place where someone hides or where illegal/unsafe activity may happen.","zh":"（人的）秘密藏身处；（常带贬义）非法或危险活动的据点。"},"examples":[{"en":"The journalist investigated a gambling lair in the back of the building.","zh":"记者调查了大楼后面一个赌博窝点。"},{"en":"In the novel, the villain retreats to his underground lair.","zh":"在小说里，反派退回到他的地下秘密据点。"}]}],"synonyms":["den","hideout","nest","retreat","haunt"],"phonetic":"/lɛr/","extraExplanation":["“lair”常出现在故事、侦探小说和奇幻作品里，带有“隐秘、危险、阴暗”的氛围；描述坏人的住处时很常见。","易混词：den更中性，常指动物的“洞穴/窝”；lair更强调“隐藏的据点”，对人用时常带负面联想。"]}
{"word":"lairage","summary":{"en":"Lairage is a temporary holding area for livestock, especially at a slaughterhouse or market before inspection or slaughter.","zh":"Lairage 指牲畜的临时圈养区，尤用于屠宰场或市场在检疫或屠宰前的待宰/待检区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a holding area (pens or sheds) where livestock are kept temporarily, especially at a slaughterhouse or market before inspection, sale, or slaughter","zh":"（尤指屠宰场或牲畜市场的）临时圈养区/待宰区，用于在检疫、交易或屠宰前短暂安置牲畜"},"examples":[{"en":"The cattle waited in the lairage overnight before the morning inspection.","zh":"牛在待宰区过夜，等待第二天早上的检疫。"},{"en":"Good lairage conditions help reduce stress for animals before transport or slaughter.","zh":"良好的待宰区条件有助于在运输或屠宰前降低动物压力。"}]}],"synonyms":["holding pens","stockyard","livestock pens","holding area"],"phonetic":"/ˈlɛrɪdʒ/","extraExplanation":["“lairage”多见于英式英语与畜牧/屠宰行业语境，属于较专业的词。它强调“临时安置与管理”的场所（如圈舍、栏位），常与动物福利、检疫（inspection/ante-mortem inspection）、清洁与休息时间等要求一起出现。","词源与“lair（兽穴/栖身处）”有关，但现代用法并不是“野兽洞穴”，而是指家畜在屠宰或交易前的集中停留区。"]}
{"word":"laird","summary":{"en":"A laird is a Scottish landowner, often the traditional owner of an estate, and can also be used as a respectful title for that person.","zh":"laird 指苏格兰的地主/庄园主，也可作对该地主的敬称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scottish landowner; the owner of a large estate (especially in rural Scotland), traditionally seen as the local “lord” of the land","zh":"（苏格兰）地主；大庄园的拥有者（尤指乡村地区），传统上被视为当地的“领主”"},"examples":[{"en":"The laird of the estate rented farmland to local families.","zh":"庄园的地主把农田租给当地家庭。"},{"en":"In the novel, the young man works for a strict laird in the Highlands.","zh":"在小说里，那个年轻人在苏格兰高地为一位严厉的地主工作。"},{"en":"They visited a historic castle once owned by a famous laird.","zh":"他们参观了一座曾由著名地主拥有的历史城堡。"}]},{"partOfSpeech":"n.","definition":{"en":"a respectful title for a Scottish landowner, similar to “lord,” used before or instead of the person’s name","zh":"（敬称）用于苏格兰地主的称号，类似“lord（领主）”，可放在人名前或用来指称此人"},"examples":[{"en":"Good evening, Laird MacLeod.","zh":"晚上好，麦克劳德地主。"},{"en":"The villagers spoke carefully when the laird arrived.","zh":"地主到来时，村民说话格外小心。"}]}],"synonyms":["Scottish landowner","estate owner","lord (contextual)","squire (roughly similar)"],"phonetic":"/lɛrd/","extraExplanation":["“laird”常见于苏格兰历史与文学语境（如关于高地、氏族、城堡与庄园的故事）。它通常表示有土地与社会影响力的乡绅阶层，但不一定是英国贵族体系中的正式“贵族爵位”。","在现代用法里，它多出现在历史叙述、小说、旅游介绍或带苏格兰风格的表达中；日常英语里不常用，遇到时通常与苏格兰背景相关。"]}
{"word":"lairdess","summary":{"en":"A rare word meaning a woman who is a Scottish landowner (a female laird) or the wife of a laird.","zh":"一个较罕见的词，指苏格兰的女地主（女laird）或laird的妻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A woman who is a laird; a female Scottish landowner or the wife of a laird.","zh":"（罕见）女地主；女“laird”（苏格兰的地主/领主）；也可指“laird”的妻子。"},"examples":[{"en":"In the old parish records, she is described as the lairdess of the estate.","zh":"在旧的教区记录里，她被描述为该庄园的女地主。"},{"en":"Locals spoke respectfully of the lairdess who managed the land after her husband died.","zh":"当地人敬重地谈起那位在丈夫去世后管理土地的女领主。"}]}],"synonyms":["female laird","lady of the estate","landowner (female)"],"phonetic":"ˈlɛrdəs","extraExplanation":["“laird”是苏格兰用语，指拥有土地的地主/庄园主（类似英格兰语境里的“squire/landowner”，但带有苏格兰地方色彩）。","“lairdess”属于较少见、带年代感的词形；现代英语里更常见的说法是“a female laird”或直接用“laird”指女性（视语境与个人偏好）。","如果你原本想查的是别的词（例如拼写成“lair dress / layered / lairless”等），告诉我句子语境，我可以帮你确认正确拼写和意思。"]}
{"word":"lairdie","summary":{"en":"A Scots word meaning “laird,” often used humorously for a landowner or someone acting like one.","zh":"苏格兰用语，意思是“地主（laird）”，常带调侃意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland) a laird; often a humorous or affectionate term for a local landowner or someone acting important.","zh":"（苏格兰用语）地主；也常带幽默或亲昵意味，指当地小地主或摆出“地主/大人物”架子的人。"},"examples":[{"en":"In the village, everyone knew old Tam as the lairdie who owned most of the fields.","zh":"在村里，大家都知道老塔姆是那位拥有大部分田地的“地主老爷”。"},{"en":"He called himself the lairdie, but he only had a small bit of land.","zh":"他自称“地主”，可其实只有一小块地。"}]}],"synonyms":["laird","landowner","squire"],"phonetic":"/ˈlɛrdi/","extraExplanation":["“lairdie”是苏格兰英语/苏格兰方言（Scots）里从“laird（地主）”发展出来的口语形式，常带有调侃色彩（有点像说“地主老爷/大人物”）。","在现代英语里比较少见，多出现在苏格兰背景的对话、民间故事或文学作品中；正式写作更常用“laird”。"]}
{"word":"lairdly","summary":{"en":"“Lairdly” means “like a Scottish laird (landowner),” describing a dignified, landed style or manner.","zh":"“lairdly”指“像苏格兰地主/乡绅（laird）一样的”，形容带有庄园地主气派的风格或举止。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish) Like a laird; having the look, manners, or status of a Scottish landowner; dignified or grand in a rural, landed way.","zh":"（苏格兰用法）像“领主/地主”（laird）的；有乡绅地主气派的；带有庄园式、体面而威严的乡绅风格。"},"examples":[{"en":"He carried himself in a lairdly way, as if the whole valley belonged to him.","zh":"他举止很有乡绅气派，仿佛整座山谷都是他的。"},{"en":"The old house had a quiet, lairdly dignity.","zh":"那座老房子有一种安静而庄园式的庄重感。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a lairdly manner; like a laird.","zh":"以乡绅地主的方式；带着领主般的派头。"},"examples":[{"en":"He spoke lairdly, offering advice more like an owner than a guest.","zh":"他说话带着主人般的派头，给建议时更像主人而不是客人。"}]}],"synonyms":["lordly","landed","aristocratic","stately"],"phonetic":"/ˈlɛrdli/","extraExplanation":["“laird”是苏格兰语境里的词，指拥有土地的地主/乡绅（不一定是英国贵族头衔）。因此“lairdly”多见于描写苏格兰乡村、庄园生活的文字里，带一点地方文化色彩。","这是相对少见的词；在更通用的英语里，常用“lordly”（傲慢的/贵族派头的）或“landed”（有地产的）来表达相近意思，但语气和文化指向不完全相同。"]}
{"word":"lairdocracy","summary":{"en":"Lairdocracy means rule or dominance by Scottish landowners (lairds), often used critically.","zh":"lairdocracy 指苏格兰地主（laird）阶层的统治或支配，常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often humorous or critical) government or social dominance by lairds (Scottish landowners), especially when a small group of wealthy landowners holds most power and land.","zh":"（常带幽默或批评意味）“地主统治”；指由苏格兰的乡绅/地主（laird）主导的政治或社会权力结构，尤指少数富有地主掌握大量土地与影响力。"},"examples":[{"en":"Many reformers argued that the Highlands were trapped in a lairdocracy that blocked change.","zh":"许多改革者认为高地地区被“地主统治”所束缚，变革难以推进。"},{"en":"The novel mocks the local lairdocracy for treating tenants as if they were invisible.","zh":"这部小说讽刺当地的地主阶层，把佃农当成透明人。"}]}],"synonyms":["landlordism","landed oligarchy","landed gentry (dominance)","aristocracy (in context)"],"phonetic":"/ˌlɛərdˈɑːkrəsi/","extraExplanation":["词源与构词：laird 是苏格兰英语，指拥有大片土地的地主/乡绅（类似“地主、领主”但不一定是贵族头衔）。-ocracy 表示“统治、政体”（如 democracy 民主、aristocracy 贵族统治）。合起来 lairdocracy 就是“由地主阶层统治”。","语体与使用场景：该词较少见，多出现在讨论苏格兰土地问题、阶级结构或历史批评的语境中；往往带贬义，强调权力集中与不公平。"]}
{"word":"lairds","summary":{"en":"“Lairds” is the plural of “laird,” meaning Scottish landowners or estate owners.","zh":"“lairds”是“laird”的复数，指苏格兰的地主或庄园主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scottish landowner; the owner of a (usually large) estate in Scotland","zh":"（苏格兰）地主；庄园主（通常指拥有较大地产的人）"},"examples":[{"en":"In old stories, the laird often lived in a big house on the estate.","zh":"在老故事里，庄园主常常住在庄园里的大宅子中。"},{"en":"The village depended on the laird for jobs and housing.","zh":"村子在工作和住房方面依赖这位地主。"}]}],"synonyms":["landowners","landlords","estate owners","squires"],"phonetic":"/lɛrdz/","extraExplanation":["“Laird”主要用于苏格兰语境，是一种带有传统色彩的称呼，接近“地主/乡绅”。在现代英语里，它不如“landlord”常见，更多出现在历史、文学或描写苏格兰社会的文本中。","“lairds”是复数形式，指多位庄园主/地主。"]}
{"word":"lairdship","summary":{"en":"Lairdship means the status of being a Scottish laird, or the estate attached to that role.","zh":"Lairdship 指（苏格兰）laird 的身份/地位，也可指其相关的庄园或地产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the status, rank, or position of being a laird (a Scottish landowner or local lord); also the land or estate connected with that position","zh":"（苏格兰）领主/地主（laird）的身份、地位；也可指与该身份相关的土地或庄园"},"examples":[{"en":"He inherited the lairdship after his father died.","zh":"父亲去世后，他继承了这份领主身份（及相关产业）。"},{"en":"The novel describes a community shaped by the lairdship and its tenants.","zh":"这部小说描写了一个被领主制度及其佃户关系所塑造的社区。"}]}],"synonyms":["estate","landownership","lordship (in some contexts)"],"phonetic":"/ˈlɛrdʃɪp/","extraExplanation":["“lairdship”主要用于苏格兰历史、文学或法律/地契语境中；现代日常英语里很少见，更常用“estate”（庄园）、“landownership”（土地所有权）或直接说“the laird of …”。","“laird”通常指拥有土地的乡绅/地主，地位类似地方领主，但不一定等同于贵族头衔（peerage）。因此“lairdship”强调的是地方土地所有权与社会影响力，而不一定是正式的贵族爵位。"]}
{"word":"laired","summary":{"en":"“Laired” means an animal rested or hid in its lair; it can also describe an animal being in its hiding place.","zh":"“laired”表示（动物）在兽穴/隐蔽处卧藏或栖息；也可作形容词，指“在穴中/藏着的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “lair”: to lie down or stay hidden in a lair (a resting or hiding place, especially for a wild animal).","zh":"“lair”的过去式/过去分词：在兽穴/隐蔽处躺下或藏身（尤指野生动物的栖身处、藏身处）。"},"examples":[{"en":"The fox had laired in the tall grass near the river.","zh":"那只狐狸在河边的高草丛里藏身了。"},{"en":"A bear was laired deep inside the cave for the winter.","zh":"一只熊在洞穴深处栖身过冬。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an animal as being in its lair (resting or hidden).","zh":"（形容词用法）指动物在穴中/隐蔽处休息或藏着。"},"examples":[{"en":"The laired wolf did not move when we passed quietly.","zh":"我们悄悄经过时，穴中的狼没有动。"}]}],"synonyms":["hid","sheltered","nested","denned"],"phonetic":"/lɛrd/","extraExplanation":["“lair”作动词在现代日常英语里不算常见，更常见的是名词“a lair”（兽穴/藏身处）。在自然写作、狩猎/追踪（tracking）语境中，动词用法会更常出现，如“a deer lairs in thick cover”（鹿在密林中卧藏）。","拼写提示：不要和“layered”（有层次的/分层的）混淆；“laired”来自“lair（兽穴）”，而“layered”来自“layer（层）”。"]}
{"word":"lairing","summary":{"en":"“Lairing” means an animal is staying hidden in its lair (den), or the act of doing so (rare as a noun).","zh":"“lairing”指动物藏在巢穴/兽穴里栖息（多作动词）；也可作名词，指这种藏身行为（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “lair”) resting or staying in a hidden shelter (a lair), especially of a wild animal; or making/using a lair.","zh":"（动词 lair 的现在分词）指野生动物躲在隐蔽处（巢穴、兽穴）休息、停留；也可指建立/使用兽穴。"},"examples":[{"en":"The fox was lairing in the tall grass until nightfall.","zh":"那只狐狸一直藏在高草丛里歇着，直到天黑。"},{"en":"Researchers tracked where the wolves were lairing during the winter.","zh":"研究人员追踪狼群冬季在哪里藏身栖息。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of using a lair; a period when an animal stays in its den (rare).","zh":"（罕见）指使用兽穴的行为或习性；动物待在洞穴中的一段时间。"},"examples":[{"en":"Signs of lairing were found near the rocky hillside.","zh":"在多石的山坡附近发现了动物藏身栖息的迹象。"}]}],"synonyms":["denning","hiding","sheltering","nesting"],"phonetic":"/ˈlɛrɪŋ/","extraExplanation":["“lairing”在日常英语里不常见，更常出现在自然观察、狩猎/野生动物管理等语境中。日常表达里，人们更常说“sleeping/resting in its den”或“denning”（尤其指熊等动物在洞里越冬）。"]}
{"word":"lairless","summary":{"en":"Lairless means having no den or hiding place.","zh":"lairless 指“没有巢穴/藏身处的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no lair (den or hiding place); not living in a den.","zh":"没有巢穴/兽穴（藏身处）的；不栖居于洞穴中的。"},"examples":[{"en":"After the fire, the fox was lairless and had to find a new den.","zh":"大火之后，那只狐狸失去了兽穴，只好另找新巢。"},{"en":"The rescued dog was temporarily lairless, so the shelter kept him overnight.","zh":"那只被救助的狗暂时无处栖身，所以收容所让它过夜。"}]}],"synonyms":["homeless","without a den","denless"],"phonetic":"/ˈlɛrləs/","extraExplanation":["这个词由名词 lair（兽穴、藏身处）+ 后缀 -less（“没有……”）构成，意思很直观，但在现代英语中非常少见；更常用的表达是 homeless（无家可归的）或 without a den（没有洞穴/巢穴）。","在文学语境中，lairless 有时会带一点“被迫离开安全之所、暴露在外”的意象，可用于描写动物、流亡者或象征性的“失去庇护”。"]}
{"word":"lairman","summary":{"en":"A layman is a non-expert (or, in religious contexts, a non-clergy member).","zh":"layman 指某领域的非专业人士（外行）；在宗教语境中也指非神职人员（平信徒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a specialist in a particular subject; an ordinary person","zh":"（某领域的）外行；非专业人士；普通人"},"examples":[{"en":"I’m just a layman when it comes to law, so I asked a lawyer for advice.","zh":"在法律方面我只是个外行，所以我去请教了律师。"},{"en":"The doctor explained the results in terms a layman could understand.","zh":"医生用外行也能听懂的方式解释了结果。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is not a member of the clergy (not a priest, pastor, etc.)","zh":"（宗教中）非神职人员；平信徒"},"examples":[{"en":"In the church, both clergy and laymen took part in the discussion.","zh":"在教会里，神职人员和平信徒都参与了讨论。"}]}],"synonyms":["non-expert","amateur","ordinary person","civilian"],"phonetic":"/ˈleɪmən/","extraExplanation":["“lairman”在现代英语中不是常见词；你很可能想写的是 **layman**。","词源上，**lay** 有“非神职的、世俗的”之意，因此 **layman** 原本主要指“平信徒”，后来引申为“非专业人士/外行”。","常见搭配：**in layman’s terms**（用外行也能懂的话）；注意所有格常写 **layman’s**（单数）或 **laymen’s**（复数）。"]}
{"word":"lairmen","summary":{"en":"Lairmen are (in old Scottish usage) people who own or hold rights to burial plots in a churchyard.","zh":"lairmen（旧苏格兰用法）指拥有或享有教堂墓地中某块墓穴/墓地使用权的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, old-fashioned) A person who owns or has rights to a burial plot (“lair”) in a churchyard; by extension, someone responsible for arranging burials there.","zh":"（苏格兰用法，较旧）拥有或享有教堂墓地中某块墓穴/墓地（lair）使用权的人；也可引申指负责安排葬礼事宜的人。"},"examples":[{"en":"In the old parish records, several lairmen are listed as owners of family burial plots.","zh":"在旧的教区档案里，列出了好几位拥有家族墓地的 l​airmen。"},{"en":"The minister spoke with the lairmen about maintaining the gravestones.","zh":"牧师与这些墓地拥有者商量如何维护墓碑。"}]}],"synonyms":["burial plot owners","grave owners","sextons","gravediggers"],"phonetic":"/ˈlɛrmən/","extraExplanation":["“lairmen”是“lairman”的复数。这里的“lair”在苏格兰英语里常指“坟墓/墓穴/家族墓地”，不是常见的“野兽的巢穴”。因此这个词多出现在苏格兰历史、教区记录或文学描写中，现代日常英语更常说“burial plot owner / grave owner”，或按职责说“sexton（教堂墓地管理员）/ gravedigger（掘墓人）”。"]}
{"word":"lairs","summary":{"en":"“Lairs” is the plural of “lair,” meaning animal dens or secret hideouts.","zh":"“lairs”是“lair”的复数，指动物的巢穴或秘密藏身处（也可指窝点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “lair”: hidden places where wild animals live, or secret places where someone stays or does something illegal.","zh":"“lair”的复数：野兽的巢穴、藏身处；也可指坏人或非法活动的秘密据点。"},"examples":[{"en":"The hikers saw bear tracks near several lairs in the woods.","zh":"徒步者在树林里几个巢穴附近看到了熊的脚印。"},{"en":"The police searched suspected lairs of the gang.","zh":"警方搜查了该团伙疑似的藏身处。"}]}],"synonyms":["dens","hideouts","nests","burrows","haunts"],"phonetic":"/lɛr/","extraExplanation":["“lair”常用于描写动物（如 bear/wolf）的“巢穴/洞穴”，也常见于新闻或小说中，比喻罪犯的“窝点”。语气上比“home”更带有“隐蔽、危险或不正当”的感觉。","词源上与“躺下/休息”的含义有关，所以“lair”有“躲着休息的地方、藏身处”的意象。"]}
{"word":"lairstone","summary":{"en":"“Lairstone” is a Scottish dialect word meaning a gravestone/headstone.","zh":"“lairstone”是苏格兰方言词，意思是“墓碑/墓石”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) A gravestone or headstone marking a burial plot (a “lair”).","zh":"（苏格兰方言）墓碑；墓石（标记墓地“lair/墓穴”的石碑）。"},"examples":[{"en":"In older Scottish writing, you may see “lair-stane/lairstone” used to mean a gravestone.","zh":"在较老的苏格兰文字中，你可能会看到“lair-stane/lairstone”用来表示“墓碑”。"},{"en":"They visited the family lairstone to pay their respects.","zh":"他们去家族墓碑前致意。"}]}],"synonyms":["gravestone","headstone","tombstone"],"phonetic":"/ˈlɛrˌstoʊn/","extraExplanation":["“lair”在苏格兰英语里常指“墓穴、墓地的一块安葬位置”，所以“lair-stane（墓地之石）”逐渐固定为“墓碑/墓石”。拼写上既可见带连字符的lair-stane，也可见合写lairstone。","如果你是在某个小说、游戏或品牌里看到Lairstone（大写），它也可能是专有名词（人名/地名/公司名）。若能提供一句上下文，我可以帮你判断具体含义。"]}
{"word":"lairy","summary":{"en":"“Lairy” is a British informal adjective meaning either flashy/showy or loud and aggressive.","zh":"“lairy”是英式非正式形容词，可指“花哨张扬（偏俗气）”，也可指“吵闹好斗、咄咄逼人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(British, informal) Flashy or showy in a way that seems tasteless or too bold.","zh":"（英式，非正式）花哨、张扬（常带“俗气/过头”的意味）。"},"examples":[{"en":"He turned up in a lairy jacket that everyone noticed.","zh":"他穿着一件很张扬的夹克出现，大家都注意到了。"},{"en":"The club has a lairy neon sign outside.","zh":"那家夜店外面有个很花哨的霓虹招牌。"}]},{"partOfSpeech":"adj.","definition":{"en":"(British, informal) Loud, pushy, or aggressive in behavior; brash.","zh":"（英式，非正式）吵闹的、咄咄逼人的、好斗的；莽撞的。"},"examples":[{"en":"A few lairy fans started arguing with the staff.","zh":"几个闹事的球迷开始和工作人员争吵。"},{"en":"He can get a bit lairy after a couple of drinks.","zh":"他喝了几杯后可能会变得有点好斗、爱闹。"}]}],"synonyms":["flashy","showy","loud","brash","aggressive"],"phonetic":"/ˈlɛri/","extraExplanation":["“lairy”主要见于英式口语，常用来形容衣着/风格“过于张扬”，或形容人“闹腾、好勇斗狠”。在美式英语里不太常见，美式更常说 flashy / loud / brash / aggressive。","语气通常偏负面或带批评意味：不是单纯“显眼”，而是“显眼得有点烦/俗”。"]}
{"word":"laiser","summary":{"en":"“Laiser” is not standard English; it’s usually a misspelling of “laser,” meaning a powerful narrow beam of light or a device that produces it, and it can also be a verb meaning “to treat/cut with a laser.”","zh":"“laiser”不是标准英语，通常是“laser（激光）”的拼写错误：可指激光/激光设备，也可作动词表示“用激光治疗或切割”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Likely intended to mean “laser,” a device that produces a very strong, narrow beam of light.","zh":"（常见拼写错误）多半是想写“laser（激光）”，指一种能产生非常强、非常窄光束的装置。"},"examples":[{"en":"The word “laiser” is usually a misspelling of “laser.”","zh":"“laiser”通常是“laser”的拼写错误。"},{"en":"The doctor used a laser to treat the patient’s eye.","zh":"医生用激光治疗病人的眼睛。"}]},{"partOfSpeech":"n.","definition":{"en":"A laser beam or a tool that uses a laser (common in everyday speech).","zh":"激光束；激光设备（口语中常这样用）。"},"examples":[{"en":"Be careful—don’t point the laser at people’s eyes.","zh":"小心——不要把激光对着人的眼睛。"},{"en":"They used a laser to measure the distance.","zh":"他们用激光测量距离。"}]},{"partOfSpeech":"v.","definition":{"en":"To cut, remove, or treat something using a laser.","zh":"用激光切割、去除或治疗。"},"examples":[{"en":"She decided to laser the tattoo off.","zh":"她决定用激光把纹身去掉。"},{"en":"The clinic lasers unwanted hair.","zh":"那家诊所用激光脱毛。"}]}],"synonyms":["beam","laser beam","laser pointer"],"phonetic":"/ˈleɪzər/","extraExplanation":["“laser”是首字母缩略词，来自 Light Amplification by Stimulated Emission of Radiation（受激辐射光放大）。日常使用时不需要记全称，但知道它是缩写会更容易记住拼写。","如果你本来想写的是“lazier”（更懒的）或法语“laisser”（允许/让），告诉我你的上下文句子，我可以帮你选对词并纠正拼写。"]}
{"word":"laisse","summary":{"en":"A rare word in English: mainly a stanza unit in medieval French epic poetry; also an archaic word for a leash.","zh":"英语中较少见：主要指中世纪法语史诗里的“段/诗节”单位；也可作古义表示“牵绳”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in medieval French epic poetry) a stanza-like section with one repeated end sound (assonance) or rhyme.","zh":"（中世纪法语史诗中）一种类似“诗节/段落”的结构单位，通常以相同的尾音（类押韵/押韵）连接。"},"examples":[{"en":"The poem is divided into laisses, each carrying a small unit of the story.","zh":"这首诗被分成若干个 laisses，每一段推进一小段情节。"},{"en":"In the chanson de geste tradition, a laisse often ends with the same vowel sound.","zh":"在“武功歌”（chanson de geste）的传统中，一段 laisse 常以相同的元音尾音收束。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) a leash; a strap used to hold or lead an animal.","zh":"（罕见/古义）牵绳；用来牵引动物的带子。"},"examples":[{"en":"He held the hound close on its laisse.","zh":"他用牵绳把猎犬牵得很近。"}]}],"synonyms":["stanza","section","verse","leash"],"phonetic":"/lɛs/","extraExplanation":["“laisse”本质上是法语词，英语里多出现在文学研究（尤其是中世纪法语史诗《罗兰之歌》等）或历史语境中，因此在日常英语里很少用到。","如果你是在法语学习中看到“laisse”，它也可能是动词 laisser（让/允许/留下）的变位形式（如：il/elle laisse = 他/她让；留下）。你可以告诉我上下文句子，我能帮你判断是哪一种。"]}
{"word":"laissez","summary":{"en":"A French loanword meaning “let/allow,” mainly seen in “laissez-faire” (“hands-off” policy).","zh":"法语借词，意为“让/允许”，主要出现在“laissez-faire（放任自由/不干预）”中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from French) “let; allow; leave (alone),” used in English mainly in set phrases such as “laissez-faire.”","zh":"（源自法语）“让；允许；（别管）放任”，在英语中多见于固定搭配，如“laissez-faire（放任自由）”。"},"examples":[{"en":"The article argues for a laissez-faire approach to the economy.","zh":"这篇文章主张对经济采取 laissez-faire（放任自由）的做法。"},{"en":"They criticized the government’s laissez-faire attitude toward the housing crisis.","zh":"他们批评政府对住房危机的 laissez-faire（放任不管）态度。"}]}],"synonyms":["let","allow","hands-off"],"phonetic":"ˌlɛseɪ","extraExplanation":["“laissez”在现代英语里几乎不会单独使用，通常只作为法语借词出现在“laissez-faire”（字面“让做”，指政府尽量少干预、让市场自行运作）这一政治经济术语中。单独看到“laissez”，多半是在引用法语或为了强调“别管/放手让它自然发展”的语气。"]}
{"word":"laissez-faire","summary":{"en":"minimal interference, especially by government in the economy","zh":"（尤指政府对经济）尽量少干预的放任自由"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A policy or attitude of letting people and businesses act freely with little government control or interference, especially in the economy.","zh":"（尤指经济领域）“放任自由”的政策或态度；尽量少政府干预，让个人与企业自由运作。"},"examples":[{"en":"The party supports a laissez-faire approach to the economy.","zh":"该党支持对经济采取放任自由的方式。"},{"en":"Critics say a laissez-faire policy can widen the gap between rich and poor.","zh":"批评者认为放任自由的政策可能会拉大贫富差距。"},{"en":"In the early 1900s, many industries grew under relatively laissez-faire regulation.","zh":"在20世纪初，许多行业在相对放任的监管下发展起来。"}]},{"partOfSpeech":"n.","definition":{"en":"The idea or system of minimal government intervention in economic affairs; free-market capitalism (in a broad sense).","zh":"放任自由主义（理念/体制）；主张政府尽量少干预经济（广义上常与自由市场资本主义相关）。"},"examples":[{"en":"Laissez-faire became a major influence on modern economic thought.","zh":"放任自由主义对现代经济思想产生了重要影响。"},{"en":"The debate often centers on how far laissez-faire should go.","zh":"争论常聚焦于放任自由应当推进到什么程度。"}]}],"synonyms":["free market","nonintervention","hands-off","deregulation","unregulated capitalism"],"phonetic":"/ˌlɛseɪˈfɛr/","extraExplanation":["读音与拼写保留法语风格，在英语里常用作形容词（a laissez-faire policy/approach）或名词（laissez-faire in economics）。","在日常语境里也可引申为“管理很松、不过多干预”的风格（如课堂或育儿），但最常见仍是经济与政策讨论。"],"etymology":"源自法语 laissez faire，字面意思是“让（他们）去做/顺其自然”。18世纪法国经济思想家用来主张减少国家对贸易与产业的干预，后来进入英语并常用于讨论自由市场与监管。","mnemonic":["把它记成“Let’s say: fair（听起来像 ‘less a fair’）→ less intervention（更少干预）”。","联想中文“放任不管/顺其自然”，看到法语拼写就想到“让它自己运转”。"]}
{"word":"lait","summary":{"en":"Lait is a French word meaning “milk,” seen mostly in French phrases in English (like café au lait) and sometimes on cosmetic labels for milky lotions.","zh":"lait 源自法语，意为“牛奶”，在英语中多用于法语短语（如 café au lait）以及部分化妆品标签中（指乳状乳液/洁面）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) “milk”; used in English mainly in French phrases (e.g., café au lait) or on product labels.","zh":"（源自法语）“牛奶”；在英语中多见于法语短语（如 café au lait）或产品标签上。"},"examples":[{"en":"I ordered a café au lait, which is coffee with milk.","zh":"我点了一杯 café au lait，也就是加牛奶的咖啡。"},{"en":"The menu says “au lait,” meaning it comes with milk.","zh":"菜单上写着 “au lait”，意思是配牛奶/加牛奶。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially on French-style cosmetics) a milky lotion or cleanser.","zh":"（常见于法式化妆品上）乳状的润肤乳/洁面乳。"},"examples":[{"en":"She uses a cleansing lait to remove makeup gently.","zh":"她用乳状洁面乳温和卸妆。"},{"en":"The label reads “lait hydratant,” meaning a moisturizing lotion.","zh":"标签写着 “lait hydratant”，意思是保湿乳液。"}]}],"synonyms":["milk","lotion (in cosmetics context)"],"phonetic":"/leɪ/","extraExplanation":["“lait”在英语里通常不会单独当作日常词汇使用；更多是保留法语形式，出现在餐饮（café au lait、chocolate au lait）或护肤品命名中。","在点单或看标签时，可以把“au lait”理解为“加牛奶的/配牛奶的”。"]}
{"word":"laitance","summary":{"en":"Laitance is a weak, milky film on fresh concrete that can harm adhesion and usually must be removed.","zh":"Laitance 指新浇混凝土表面形成的薄弱乳白浮浆，会影响粘结力，通常需要清除。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, weak, milky layer of cement paste and fine particles that can form on the surface of fresh concrete (often from too much water, overworking, or bleeding). It usually needs to be removed before coatings or new layers are applied.","zh":"（混凝土表面的）浮浆；一层薄而强度低、呈乳白色的水泥浆和细颗粒，常因用水过多、过度抹压或泌水而在新浇混凝土表面形成。通常在做涂层或新铺层前需要清除。"},"examples":[{"en":"Before applying the epoxy coating, the contractor removed the laitance by grinding.","zh":"在涂环氧涂层之前，施工方通过打磨清除了浮浆。"},{"en":"Excess water can cause laitance and reduce surface durability.","zh":"用水过多会导致浮浆，并降低表面耐久性。"}]}],"synonyms":["cement scum","surface laitance","weak surface layer"],"phonetic":"/leɪˈtɑːns/","extraExplanation":["“Laitance”来自法语 lait（牛奶），因此常用“milky layer（乳白层）”来帮助记忆。","在工程语境里，laitance 通常被视为需要处理的表面缺陷，因为它会影响粘结力（如瓷砖胶、涂料、找平层与基层的附着）。常见处理方式包括打磨、喷砂或高压水射流等。"]}
{"word":"laitances","summary":{"en":"Laitances are weak, milky surface layers (especially on fresh concrete) that should usually be removed before coatings or bonding.","zh":"laitances 指（尤其是混凝土表面）形成的乳白、松弱的浮浆层，通常在做涂层或粘结前需要清除。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A weak, milky or powdery layer of fine particles that rises to the surface of fresh concrete or cement (often from too much water), which can reduce surface strength and cause poor bonding.","zh":"（混凝土/水泥）浇筑后表面浮起的“乳白浆/浮浆”（常因水分过多），会使表层强度变差、粘结不良。"},"examples":[{"en":"The contractor removed the laitance before applying the epoxy coating.","zh":"承包商在涂环氧涂层前先把浮浆清除掉。"},{"en":"Too much water in the mix can lead to excess laitance on the slab.","zh":"配比里水加得太多会导致板面浮浆过多。"},{"en":"Grinding is a common method to get rid of laitance and expose sound concrete.","zh":"打磨是去除浮浆并露出坚实混凝土的常见方法。"}]},{"partOfSpeech":"n.","definition":{"en":"In metallurgy or casting, a thin, weakened surface layer or scum formed by impurities or fine particles separating out.","zh":"（冶金/铸造）因杂质或细小颗粒析出而形成的薄弱表层/浮渣层。"},"examples":[{"en":"Surface laitance can interfere with adhesion during finishing.","zh":"表面薄弱层会在精加工时影响附着力。"},{"en":"The technician checked for laitance-like deposits along the casting surface.","zh":"技术员检查了铸件表面是否有类似浮渣层的沉积。"}]}],"synonyms":["laitance (singular)","surface slurry","scum layer","weak surface layer"],"phonetic":"/ˈleɪtənsɪz/","extraExplanation":["“laitances”是名词复数形式，单数为“laitance”。它来自法语“lait”（牛奶），因为这种表层常呈乳白、粉化的外观。建筑语境最常见，尤其在做地坪、涂层、防水或修补前，需要先把浮浆处理掉以保证粘结与强度。"]}
{"word":"laith","summary":{"en":"“Laith” can mean “reluctant/unwilling” in Scottish or older English, and it is also used as a given name (often Arabic) meaning “lion.”","zh":"“Laith” 在苏格兰英语或较旧用法中可表示“不情愿的/不愿意的”，也可作人名（常见于阿拉伯语文化），含义常被解释为“狮子”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Reluctant; unwilling (a Scottish/older spelling of “loth”).","zh":"不情愿的；不愿意的（苏格兰英语/较旧拼写，相当于 loth）。"},"examples":[{"en":"He was laith to apologize, even though he knew he was wrong.","zh":"他很不情愿道歉，尽管他知道自己错了。"},{"en":"I’m laith to leave so soon.","zh":"我不太愿意这么快就走。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (often Arabic), commonly understood to mean “lion.”","zh":"人名（常见于阿拉伯语文化），通常被理解为“狮子”。"},"examples":[{"en":"Laith is a popular boy’s name in some Arabic-speaking communities.","zh":"Laith 在一些阿拉伯语社群中是比较常见的男孩名字。"}]}],"synonyms":["loth","reluctant","unwilling","hesitant"],"phonetic":"/leɪθ/","extraExplanation":["作为形容词的 laith 多见于苏格兰英语与文学化/古体用法，现代标准英语更常用 loth（如：be loth to do sth 表示“不愿意做某事”）。","作为人名时，Laith 常对应阿拉伯语 ليث（Laith/Layth 的转写之一），含义常被解释为“狮子”，带有勇敢、强壮的文化联想。不同地区的拼写可能不同。"]}
{"word":"laithe","summary":{"en":"“laithe” is a rare Scots/archaic word meaning “reluctant/loath,” and more rarely “to loathe.”","zh":"“laithe”是较罕见的苏格兰英语/古用词，主要表示“不情愿的（loath）”，更少见时可作动词表示“憎恶（loathe）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots/archaic) unwilling; reluctant; not wanting to do something (same idea as “loath”).","zh":"（苏格兰英语/古用）不情愿的；勉强的；不太想做某事（意思接近 loath）。"},"examples":[{"en":"He was laithe to leave his family behind.","zh":"他不太情愿离开家人。"},{"en":"I’m laithe to ask for help, but I can’t do this alone.","zh":"我不太想开口求助，但我一个人做不完。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, Scots/archaic) to dislike strongly; to loathe.","zh":"（罕见，苏格兰英语/古用）强烈厌恶；憎恶（接近 loathe）。"},"examples":[{"en":"Some laithe the idea of war, even when they feel it is unavoidable.","zh":"有些人即使觉得战争不可避免，也仍然厌恶战争这个念头。"}]}],"synonyms":["loath","reluctant","unwilling","averse","hesitant"],"phonetic":"/leɪθ/","extraExplanation":["“laithe/ laith”多见于苏格兰英语与古体写法，现代标准英语里更常用的是 **loath**（形容词：不情愿的）和 **loathe**（动词：憎恶）。","不要和 **lathe**（n. 车床，读音 /leɪð/）混淆；它们拼写相近但意思完全不同。"]}
{"word":"laithly","summary":{"en":"Laithly is a Scottish/archaic adjective meaning “reluctant, unwilling,” and sometimes “unpleasant, loathsome.”","zh":"Laithly 是苏格兰方言/古用形容词，常指“不情愿的、勉强的”，有时也指“令人厌恶的、讨厌的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scotland, dialect/archaic) unwilling; reluctant; not wanting to do something.","zh":"（苏格兰方言/古用）不情愿的；勉强的；不愿做某事的。"},"examples":[{"en":"He was laithly to leave his home, even for a good job.","zh":"即使有份好工作，他也不情愿离开家。"},{"en":"I’m laithly to argue, but we need to be clear about the rules.","zh":"我不太想争论，但我们得把规则说清楚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scotland, dialect/archaic) unpleasant; loathsome; causing dislike.","zh":"（苏格兰方言/古用）令人厌恶的；讨厌的。"},"examples":[{"en":"They spoke of the laithly weather that kept everyone indoors.","zh":"他们说起那种让人讨厌的天气，害得大家都待在室内。"}]}],"synonyms":["reluctant","unwilling","loath","averse","unpleasant","loathsome"],"phonetic":"/ˈleɪθli/","extraExplanation":["“laithly”多见于苏格兰英语/文学化用法，现代日常英语里很少用。更常见的标准英语对应词通常是 **reluctant / unwilling**（不情愿的）或 **loathsome / unpleasant**（令人厌恶的）。","它容易被误读/误拼为 **lately**（最近）或 **lithely**（轻盈地、柔软地）。如果你是在现代文章里看到“laithly”，也可能是拼写错误，建议结合上下文确认。"]}
{"word":"laities","summary":{"en":"“Laities” means the ordinary members of a religion (not clergy), or non-experts in general.","zh":"“laities”指宗教中的平信徒（非神职人员），也可泛指外行、非专业人士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “laity”: ordinary people in a religion (not priests, monks, or other clergy); more generally, non-experts as opposed to professionals.","zh":"“laity”的复数：指宗教中非神职人员（不是神父、僧侣等）；引申为相对于专业人士的“外行/非专业人士”。"},"examples":[{"en":"In many churches, the laities volunteer as readers, musicians, or community helpers.","zh":"在许多教会里，平信徒会担任读经者、乐手或社区志愿者。"},{"en":"The doctor explained the report in language the laities could understand.","zh":"医生用外行也能听懂的方式解释了这份报告。"}]}],"synonyms":["laypeople","the laity","non-experts","nonprofessionals"],"phonetic":"/ˈleɪətiz/","extraExplanation":["“laity”源自希腊语 *laos*（人民）。在宗教语境中常与“clergy（神职人员）”对比。","日常英语里更常用“laypeople / the laity”。“laities”这个复数形式存在，但在现代用法中不算常见；多数情况下用“the laity”来表示整体群体。"]}
{"word":"laity","summary":{"en":"Laity means ordinary people who are not clergy, and by extension non-experts in a field.","zh":"Laity 指宗教中的平信徒（非神职人员），也可引申为某领域的外行、非专业人士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ordinary people in a religion who are not priests or other clergy.","zh":"（宗教中）平信徒；非神职人员的普通信众。"},"examples":[{"en":"The laity attended the service while the clergy led the prayers.","zh":"平信徒参加礼拜，而神职人员带领祷告。"},{"en":"In many churches, the laity help with charity work and community events.","zh":"在许多教会里，平信徒会参与慈善工作和社区活动。"}]},{"partOfSpeech":"n.","definition":{"en":"People who are not trained professionals in a particular field; non-experts.","zh":"（某领域的）外行；非专业人士。"},"examples":[{"en":"The report was written in language understandable to the laity.","zh":"这份报告用外行也能理解的语言写成。"},{"en":"Medical terms can be confusing for the laity.","zh":"医学术语对外行来说可能很令人困惑。"}]}],"synonyms":["non-clergy","laypeople","laymen","non-experts"],"phonetic":"/ˈleɪ.ə.ti/","extraExplanation":["“laity”来自“lay（非神职的）”这一词根，常与“clergy（神职人员）”成对出现：the laity vs. the clergy。","在学术或新闻写作中常见搭配：for the laity（给外行看的）、understandable to the laity（外行能懂的）。注意它通常作为集合名词使用（指一群普通人），不太常说“a laity”。"]}
{"word":"Laius","summary":{"en":"Laius is a mythological king of Thebes, best known as Oedipus’s father in Greek tragedy.","zh":"Laius（拉伊俄斯）是希腊神话中的忒拜国王，最为人熟知的身份是俄狄浦斯的父亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The king of Thebes and the father of Oedipus; his attempt to avoid a prophecy helps set the tragedy in motion.","zh":"（希腊神话）忒拜国王，俄狄浦斯的父亲；他试图逃避预言的做法反而推动了悲剧的发生。"},"examples":[{"en":"In Greek myth, Laius is warned that his son will one day kill him.","zh":"在希腊神话中，拉伊俄斯被告知他的儿子终有一天会杀死他。"},{"en":"Sophocles mentions Laius as the former king whose death must be explained.","zh":"索福克勒斯在悲剧中提到拉伊俄斯，称他为那位必须查明死因的前国王。"}]}],"synonyms":["King of Thebes (in Greek myth)"],"phonetic":"/ˈlaɪ.əs/","extraExplanation":["“Laius”常见于与“俄狄浦斯王”（Oedipus Rex）相关的故事和戏剧解读中：拉伊俄斯与预言、遗弃婴儿、命运与责任等主题密切相关。","在英语文本里它通常作为专有名词出现，首字母大写；有时会出现在“the murder of Laius（拉伊俄斯之死）”这类固定表达中，用来指整个悲剧谜团的起点。"]}
{"word":"laius","summary":{"en":"Laius is the king of Thebes in Greek mythology, famous as Oedipus’s father in a tragic prophecy story.","zh":"拉伊俄斯是希腊神话中的底比斯国王，以俄狄浦斯之父、卷入悲剧性预言的故事而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The king of Thebes and father of Oedipus, best known from the story in which a prophecy leads to tragedy for his family.","zh":"（希腊神话）底比斯（Thebes）的国王，俄狄浦斯（Oedipus）的父亲；因“预言导致家族悲剧”的故事而最为人熟知。"},"examples":[{"en":"In Greek mythology, Laius tries to avoid a prophecy about his son, but the attempt brings disaster.","zh":"在希腊神话中，拉伊俄斯试图逃避关于儿子的预言，但这种努力反而带来灾难。"},{"en":"Sophocles’ play *Oedipus Rex* refers to Laius as the former king whose death begins the mystery.","zh":"索福克勒斯的戏剧《俄狄浦斯王》把拉伊俄斯写成前任国王，他的死亡引发了整部戏的谜团。"}]}],"synonyms":["King of Thebes (mythology)"],"phonetic":"ˈleɪəs","extraExplanation":["“Laius”常见于西方文学与戏剧课本中，尤其与“俄狄浦斯情结”（Oedipus complex）相关的文化讨论一起出现。","读古典作品时你可能会看到不同拼写或译名（如“拉伊俄斯/拉俄斯”），但都指同一位底比斯国王。"]}
{"word":"LAIV","summary":{"en":"live attenuated flu vaccine, often as a nasal spray","zh":"减毒活流感疫苗，常见为鼻喷剂型"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a live attenuated influenza vaccine (a nasal-spray flu vaccine made with a weakened live virus)","zh":"减毒活流感疫苗（以减弱的活病毒制成的流感疫苗，常见为鼻喷剂型）"},"examples":[{"en":"LAIV is given as a nasal spray rather than an injection.","zh":"LAIV 通常以鼻喷方式接种，而不是打针。"},{"en":"Some people should not receive LAIV, so a clinician will check eligibility first.","zh":"有些人不适合接种 LAIV，因此医生会先评估是否符合接种条件。"},{"en":"The clinic ran out of LAIV and offered an inactivated flu shot instead.","zh":"诊所的 LAIV 用完了，改提供灭活流感疫苗注射。"}]}],"synonyms":["live attenuated influenza vaccine","nasal spray flu vaccine"],"phonetic":"/leɪv/","extraExplanation":["LAIV 常指“鼻喷流感疫苗”（因其常见给药方式为鼻喷）。它与“灭活流感疫苗（inactivated influenza vaccine, IIV）”不同：LAIV 用的是减毒活病毒，IIV 用的是灭活病毒成分。","医学缩写在不同国家/机构的指南里适用人群可能不同（例如年龄范围、免疫功能状况等），具体以当地卫生部门或医生建议为准。"],"etymology":"缩写自 Live Attenuated Influenza Vaccine：live（活的）+ attenuated（减毒的）+ influenza（流感）+ vaccine（疫苗）。在医学与公共卫生语境中常用该缩写。","mnemonic":["把 LAIV 读作“layv /leɪv/”，联想到 live（活的）→ 这是“活”的（减毒）疫苗。","A=attenuated（减毒），I=influenza（流感），V=vaccine（疫苗）：按首字母把全称拼回去。"]}

