{"word":"lak","summary":{"en":"LAK most commonly refers to the Lao kip (Laos’s currency); in South Asian contexts, “lak” may informally mean a lakh (100,000).","zh":"LAK 最常指老挝基普（老挝货币代码）；在南亚语境中，“lak”也可能是 lakh（十万）的非正式写法/简写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(ISO currency code) the Lao kip, the currency of Laos.","zh":"（国际货币代码）LAK 指老挝基普（老挝的货币）。"},"examples":[{"en":"The hotel rate is 250,000 LAK per night.","zh":"这家酒店每晚房价是 250,000 LAK。"},{"en":"You can exchange USD to LAK at the airport in Vientiane.","zh":"你可以在万象机场把美元兑换成 LAK。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, South Asia) a spelling/short form sometimes used for “lakh,” meaning 100,000.","zh":"（非正式，南亚地区）有时把 “lakh（十万）” 写作或简写成 lak。"},"examples":[{"en":"The car costs 12 lakhs (about 1.2 million) in India.","zh":"在印度这辆车要 12 lakhs（约 120 万）。"},{"en":"They raised 5 lakh for the project.","zh":"他们为这个项目筹到了 5 lakh（50 万）。"}]}],"synonyms":["Lao kip","lakh"],"phonetic":"/læk/","extraExplanation":["“LAK”通常出现在外汇、旅行或金融报价中，是老挝基普的标准三字母代码（类似 USD、EUR）。","“lakh/ lak”是南亚数字表达习惯（常见于印度、巴基斯坦、孟加拉国等）。注意：更标准的拼写是 lakh；写成 lak 多见于非正式场合或聊天。"]}
{"word":"lakarpite","summary":{"en":"“lakarpite” is not a recognized English word; it’s likely a misspelling or a non-English/proper name term.","zh":"“lakarpite”不是可识别的英文单词，可能是拼写错误或非英语/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a word from another language. Common guesses (depending on your context) include “lacquer paint,” “lactic acid,” or “lacerate.”","zh":"这不是一个标准的英文单词，可能是拼写错误或来自其他语言。根据语境，常见的可能是“lacquer paint（清漆/亮漆涂料）”、“lactic acid（乳酸）”或“lacerate（撕裂/划伤）”。"},"examples":[{"en":"I can’t find “lakarpite” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英文词典里查不到“lakarpite”——你能把它出现的句子发我吗？"},{"en":"Did you mean “lacquer paint” for painting wood or metal?","zh":"你是不是想说“lacquer paint（清漆/亮漆涂料）”，用于给木头或金属上漆？"},{"en":"If you meant “lactic acid,” it’s a substance produced in muscles during intense exercise.","zh":"如果你想说“lactic acid（乳酸）”，它是在剧烈运动时肌肉会产生的一种物质。"}]}],"phonetic":"—","extraExplanation":["从拼写上看，“lakarpite”不像常见英语词形，可能是：\n1）把两个词连在一起（例如 lacquer + paint）；\n2）把相近字母打错（c/k、t/p、e/i 等）；\n3）专有名词（人名、地名、品牌名）或其他语言词。\n把它所在的完整句子、主题（化学/绘画/医学/游戏等）发我，我可以更准确判断你想查的词。"]}
{"word":"lakatan","summary":{"en":"Lakatan is a sweet Philippine banana cultivar often sold as a dessert banana.","zh":"Lakatan 是一种来自菲律宾、口感甜、常作为甜点香蕉出售的香蕉品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type (cultivar) of banana originally from the Philippines, known for its sweet flavor and yellow-orange flesh; often sold as “Lakatan banana.”","zh":"一种源自菲律宾的香蕉品种（栽培种），以甜味和黄橙色果肉著称；常以“Lakatan banana（拉卡坦香蕉）”出售。"},"examples":[{"en":"I bought some Lakatan bananas because they’re sweeter than the regular ones.","zh":"我买了些拉卡坦香蕉，因为它们比普通香蕉更甜。"},{"en":"In some Filipino markets, Lakatan is labeled as a premium dessert banana.","zh":"在一些菲律宾市场里，Lakatan 会被标为高品质的甜点香蕉。"}]}],"synonyms":["Lakatan banana","Philippine banana cultivar"],"phonetic":"/ləˈkɑtən/","extraExplanation":["“Lakatan”常见于菲律宾及海外菲律宾社区的市场语境中，更多是作为香蕉“品种名”使用，而不是泛指所有香蕉。","不同地区对香蕉品种的俗名可能会混用；在购买或做菜时，如果需要精确品种，最好看标签上的品种名或产地说明。"]}
{"word":"lakatoi","summary":{"en":"A traditional large sailing canoe from Papua New Guinea, especially used for trading voyages.","zh":"巴布亚新几内亚传统的大型帆航独木舟，常用于贸易航行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large traditional sailing canoe (often with multiple hulls) from Papua New Guinea, used especially for trading voyages.","zh":"（巴布亚新几内亚的）拉卡托伊号：一种传统大型帆航独木舟（常为多船体），尤用于贸易航行。"},"examples":[{"en":"The museum displayed a lakatoi used in coastal trade.","zh":"博物馆展出了一艘曾用于沿海贸易的拉卡托伊号。"},{"en":"In stories of the Hiri voyages, a lakatoi carries pottery across the sea.","zh":"在关于“希里”航海的故事里，拉卡托伊号载着陶器横渡海洋。"}]}],"synonyms":["trading canoe","sailing canoe"],"phonetic":"/ˈlɑːkəˌtɔɪ/","extraExplanation":["“lakatoi”来自巴布亚新几内亚莫图（Motu）人相关语言与文化，常与“Hiri”贸易航行联系在一起：沿海社群会乘这种大型帆舟进行季节性远航，用陶器等物品交换西米（sago）等资源。","在英语语境中它多作为文化专有名词使用，通常不加冠词或按普通可数名词用法：a lakatoi / lakatois。"]}
{"word":"Lake","summary":{"en":"A lake is a large body of water surrounded by land.","zh":"lake 指被陆地包围的大面积水域，通常为淡水湖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large area of water surrounded by land (usually fresh water, but it can be salty).","zh":"湖；被陆地包围的一大片水域（通常是淡水，也可能是咸水）。"},"examples":[{"en":"They went swimming in the lake during summer.","zh":"他们夏天去湖里游泳。"},{"en":"A small cabin sits by the lake.","zh":"湖边有一间小木屋。"},{"en":"This lake is famous for its clear blue water.","zh":"这个湖以清澈的蓝色湖水而闻名。"}]}],"synonyms":["pond","reservoir"],"phonetic":"/leɪk/","extraExplanation":["在英语里，lake 通常指内陆水域；常与 river（河）区分：河流动，湖多为相对静止。","常见搭配：by the lake（在湖边）、lake water（湖水）、lake shore/lakeshore（湖岸）、lake bed（湖底）。","文化小知识：美国的 “the Great Lakes（五大湖）” 指苏必利尔湖、密歇根湖、休伦湖、伊利湖、安大略湖，是北美非常重要的淡水资源与航运区域。"]}
{"word":"lake","summary":{"en":"A lake is a large body of water surrounded by land.","zh":"lake 指被陆地包围的一大片水域，即“湖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large area of water surrounded by land","zh":"湖；被陆地包围的一大片水域"},"examples":[{"en":"We went swimming in the lake last summer.","zh":"去年夏天我们去湖里游泳了。"},{"en":"The lake is calm in the early morning.","zh":"清晨的湖面很平静。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for regions with many lakes (often plural), or in fixed expressions (e.g., the Great Lakes)","zh":"（常用复数或固定说法）指多湖地区或专有名称中的“湖”，如“五大湖”"},"examples":[{"en":"The Great Lakes are important for shipping and freshwater.","zh":"五大湖对航运和淡水资源都很重要。"}]}],"synonyms":["pond (smaller)","reservoir (man-made lake)","loch (Scottish English)"],"phonetic":"/leɪk/","extraExplanation":["在英语里，lake 通常指内陆的大型静水水域；与 river（河流，流动的水）和 pond（池塘，通常更小）相对。大小没有绝对标准，但日常语感上 pond 更小、更浅。","在文学描写中，lake 常与“宁静、倒影、深邃”联系在一起，比如常见搭配有 a still lake（静谧的湖）和 the lake’s surface（湖面）。"]}
{"word":"laked","summary":{"en":"“Laked” means “made into a lake / flooded like a lake,” and it can also mean “made into a lake pigment” in art contexts.","zh":"“laked”可指“变成湖/像湖一样积水（被淹）”，在艺术语境中也可指“制成湖色（色淀）颜料”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Having been made into a lake; covered with or forming a lake (rare/literary).","zh":"（形容词）被形成或变成湖的；呈湖状的；被湖水覆盖的（较少见/偏文学用法）。"},"examples":[{"en":"After the dam was built, the valley was gradually laked and the old road disappeared.","zh":"大坝建成后，山谷逐渐被“湖化”，旧路也消失了。"},{"en":"In spring, the low fields were laked for weeks after heavy rain.","zh":"春天大雨后，低洼田地会像湖一样积水好几周。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Past tense/past participle of “lake”: to form into a lake; to flood or pool like a lake; or (in art) to make a “lake pigment.”","zh":"（动词）“lake”的过去式/过去分词：使形成湖；使积水成湖状；或（美术/颜料）制成“色淀/湖色颜料”。"},"examples":[{"en":"The river overflowed and laked the surrounding farmland.","zh":"河水漫溢，把周围农田淹得像一片湖。"},{"en":"The dye was laked onto a base to create a stable red pigment.","zh":"染料被沉淀到载体上，制成稳定的红色湖色颜料。"}]}],"synonyms":["flooded","waterlogged","inundated","pooled"],"phonetic":"/leɪkt/","extraExplanation":["“laked”在日常英语中不常见：描述积水时更常用 flooded / waterlogged；描述形成湖泊更常用 formed a lake 或 became a lake。","艺术与颜料里，“lake / laked”更常见：lake pigment（湖色颜料/色淀）指把可溶性染料沉淀到惰性粉体（如明矾、白垩）上，变成可用于绘画的颜料；常见如 carmine lake（胭脂红湖色）。"]}
{"word":"lakefront","summary":{"en":"Lakefront means the area along a lake, or something located right next to a lake.","zh":"lakefront 指“湖滨地带”，也可作形容词表示“临湖的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the land or area along the edge of a lake (often used for parks, paths, homes, or businesses near the water)","zh":"湖岸；湖滨地带（指湖边的一片区域，常用于公园、步道、住宅或商业区）"},"examples":[{"en":"We walked along the lakefront at sunset.","zh":"我们在日落时沿着湖滨散步。"},{"en":"They rented an apartment on the lakefront.","zh":"他们租了一套湖滨公寓。"},{"en":"The city is improving the lakefront with new bike lanes and green space.","zh":"这座城市正在通过新自行车道和绿地来改善湖滨地区。"}]},{"partOfSpeech":"adj.","definition":{"en":"located along or facing a lake","zh":"位于湖边的；面向湖的"},"examples":[{"en":"The hotel has lakefront rooms with great views.","zh":"这家酒店有景观很好的湖景（临湖）房间。"},{"en":"Lakefront property is usually expensive.","zh":"湖边房产通常很贵。"}]}],"synonyms":["lakeshore","lakeside","waterfront"],"phonetic":"/ˈleɪkˌfrʌnt/","extraExplanation":["在北美，“lakefront”常用于城市公共空间与旅游语境（如 Chicago lakefront 指芝加哥密歇根湖沿岸的公园与步道系统）。在房地产广告里，lakefront 往往暗示“紧邻湖水、可直接到湖边”的地段价值。注意它不同于 lakeside（湖畔的，范围更宽泛）与 waterfront（临水的，可指湖/河/海）。"]}
{"word":"lakeland","summary":{"en":"Lakeland means a lake-rich region, and it can also be the name of specific places (notably a city in Florida or a term for England’s Lake District).","zh":"Lakeland 可指“多湖地区/湖区”，也可作地名（如美国佛州拉克兰市，或指英格兰湖区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region characterized by many lakes; a “lake country.”","zh":"多湖地区；湖泊众多的地方（“湖区”）。"},"examples":[{"en":"We spent the weekend hiking in the lakeland and camping by the water.","zh":"我们周末在湖区徒步，并在湖边露营。"},{"en":"This lakeland is famous for its clear lakes and summer festivals.","zh":"这个湖区以清澈的湖泊和夏季节庆而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name for specific places, especially Lakeland (a city in Florida, USA) or “Lakeland” used to refer to the Lake District area in England.","zh":"专有名词：某些地名，尤指美国佛罗里达州的拉克兰市（Lakeland），或英国英格兰“湖区”（有时也被称作 Lakeland）。"},"examples":[{"en":"She moved to Lakeland, Florida for a new job.","zh":"她为了新工作搬到了佛罗里达州的拉克兰市。"},{"en":"They toured Lakeland in England and visited quiet villages near the lakes.","zh":"他们游览了英格兰的湖区，参观了湖边安静的村庄。"}]}],"synonyms":["lake country","Lake District (UK, specific)","the Lakes (UK, informal)"],"phonetic":"/ˈleɪkˌlænd/","extraExplanation":["“Lakeland”作为普通名词时多用于描述“多湖的地区”（lake + land）。作为专有名词时，是否需要大写取决于语境：指具体城市/地区通常大写（Lakeland），泛指“湖区”通常不大写（a lakeland）。","在英国文学与旅行语境中，“Lakeland”常与英格兰的 Lake District（湖区）相关联；该地区也常被称为“the Lakes”。"]}
{"word":"lakelander","summary":{"en":"A “Lakelander” is usually someone from Lakeland (often Florida) or from England’s Lake District (Lakeland). Less commonly, it can mean a person who lives near a lake.","zh":"“Lakelander”通常指来自/居住在 Lakeland 的人（美国多指佛州拉克兰）或英国湖区（Lakeland）的人；较少情况下也可泛指住在湖边的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in or comes from a place called Lakeland (often Lakeland, Florida in the U.S.).","zh":"来自或居住在名为 Lakeland 的地方的人（在美国常指佛罗里达州的拉克兰）。"},"examples":[{"en":"She’s a Lakelander who moved to Tampa for work.","zh":"她是拉克兰人，后来为了工作搬到坦帕。"},{"en":"The festival draws Lakelanders and visitors from nearby towns.","zh":"这个节日吸引了拉克兰本地人以及周边城镇的游客。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Lake District area in northwest England (also spelled “Lakeland” in this sense).","zh":"英国西北部湖区（Lake District，亦称 Lakeland）的人。"},"examples":[{"en":"As a Lakelander, he grew up hiking the fells.","zh":"作为湖区人，他从小就常去山岭徒步。"},{"en":"Many Lakelanders take pride in protecting the national park.","zh":"许多湖区居民以保护国家公园为荣。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who lives near a lake; a lakeside resident (less common).","zh":"住在湖边的人；湖畔居民（较不常见）。"},"examples":[{"en":"The small café is popular with local Lakelanders in summer.","zh":"夏天这家小咖啡馆很受当地湖畔居民欢迎。"}]}],"synonyms":["resident","local","Lake District resident","Lakeland resident"],"phonetic":"ˈleɪkˌlændər","extraExplanation":["“Lakelander”通常是一个身份称呼（demonym，地名对应的居民称呼）。在指特定地方的人时常写成大写（Lakelander）；若只是泛指“住在湖边的人”，有时会小写（lakelander），但这种用法较少见。","英国语境里，Lakeland 常用来指 Lake District（湖区）；美国语境里更常指佛罗里达州的 Lakeland。具体含义通常要看上下文。"]}
{"word":"lakeless","summary":{"en":"“Lakeless” means having no lakes or lacking lakes.","zh":"“Lakeless”表示“没有湖泊的/缺乏湖泊的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no lakes; lacking lakes in a region or landscape.","zh":"没有湖泊的；缺乏湖泊的（指某个地区或景观）。"},"examples":[{"en":"Compared with the northern states, this area is relatively lakeless.","zh":"与北部各州相比，这一地区相对没什么湖泊。"},{"en":"They crossed a dry, lakeless plateau where water was hard to find.","zh":"他们穿越了一片干燥、缺少湖泊的高原，水源很难找到。"}]}],"synonyms":["lake-free","without lakes","lacking lakes"],"phonetic":"/ˈleɪk.ləs/","extraExplanation":["“lakeless”不是日常高频词，更常见的表达是“without lakes”或“lake-free”。它常出现在地理描写、旅行写作或带一点诗意的景观描写中，用来强调某地水体（湖泊）稀少。"]}
{"word":"lakelet","summary":{"en":"“Lakelet” means a very small lake, used mainly in descriptive writing.","zh":"“lakelet”意为“小湖”，主要用于描写性的书面表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small lake; a little lake (often used descriptively, and less common than “small lake” or “pond”).","zh":"小湖；很小的湖（多用于描写语境，比“small lake”或“pond”更少见）。"},"examples":[{"en":"A lakelet lay hidden among the pines, reflecting the morning light.","zh":"一片小湖隐藏在松林间，倒映着清晨的光。"},{"en":"They camped beside a clear lakelet fed by snowmelt.","zh":"他们在一片由融雪补给的清澈小湖边露营。"}]}],"synonyms":["small lake","pond","tarn (esp. a small mountain lake)"],"phonetic":"/ˈleɪklət/","extraExplanation":["“lakelet”由“lake（湖）+ -let（表示“小”的后缀）”构成，类似的词还有“streamlet（小溪）”“booklet（小册子）”。在日常英语里，人们更常说“small lake”或根据水体特征说“pond（池塘）”“lagoon（泻湖）”。","用法上更偏书面或描写性（尤其在旅行写作、自然描写中）。如果你在学术或地理语境中写作，通常会用更具体的术语来区分“pond / tarn（高山小湖）/ reservoir（水库）”等。"]}
{"word":"lakelike","summary":{"en":"“Lakelike” means “like a lake,” especially calm and reflective.","zh":"“Lakelike”意为“像湖一样的”，常强调平静与倒影感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a lake in appearance or qualities (often calm, wide, and reflective).","zh":"像湖的；具有湖泊特征的（常指平静、开阔、如镜面般反光）。"},"examples":[{"en":"The bay was lakelike in the early morning, smooth and silver.","zh":"清晨时海湾像湖一样平静，水面光滑如银。"},{"en":"After the storm passed, the flooded fields looked lakelike from the hill.","zh":"暴风雨过去后，从山上看，被淹的田地像湖一样。"}]}],"synonyms":["lake-like","lacustrine (formal)","calm","mirrorlike","glassy"],"phonetic":"/ˈleɪkˌlaɪk/","extraExplanation":["“lakelike”= lake + -like（“像……一样的”）。英语里很多形容词用“-like”构成，如 childlike（像孩子的）、dreamlike（如梦般的）、lifelike（逼真的）。写作中“lakelike”常用来营造宁静、空旷、倒影清晰的画面感。"]}
{"word":"lakemanship","summary":{"en":"Lakemanship is the skill and practical know-how for safe, competent boating on a lake.","zh":"Lakemanship 指在湖面安全、熟练驾船与应对情况的技能与经验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"skill and knowledge in handling a boat or doing water activities on a lake; the lake version of “seamanship.”","zh":"湖上水艺；在湖面驾驶船只或进行水上活动的技巧与知识（类似“seamanship 海员技术/航海技能”的湖泊版本）。"},"examples":[{"en":"Good lakemanship means checking the weather before you go out on the lake.","zh":"良好的湖上水艺包括出发前查看湖区天气。"},{"en":"The instructor taught basic lakemanship, like docking and reading buoys.","zh":"教练教授基础湖上水艺，比如靠岸停泊和识读浮标。"}]}],"synonyms":["boating skills","small-craft seamanship","boat handling","watercraft skills"],"phonetic":"/ˈleɪk.mən.ʃɪp/","extraExplanation":["这个词并不常见，更多时候人们会用更通用的说法：boating skills（划船/驾船技能）、small-craft seamanship（小型船艇操船技术）或 water safety（水上安全）。","构词上由 lake + -manship（表示“技艺/本领/熟练程度”，如 craftsmanship 工艺、sportsmanship 体育精神）组合而成，语感上强调“在湖上的熟练操控与判断”。"]}
{"word":"lakeport","summary":{"en":"Lakeport is most commonly a place name (a city in California); less commonly it can mean a port on a lake.","zh":"Lakeport 最常见是地名（加州一座城市）；较少见时可指“湖上的港口/码头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northern California, on the shore of Clear Lake (the county seat of Lake County)","zh":"（专有名词）美国加州北部的城市，位于克利尔湖（Clear Lake）湖畔，是莱克县（Lake County）的县治"},"examples":[{"en":"They spent the weekend in Lakeport by Clear Lake.","zh":"他们在克利尔湖旁的莱克波特度过了周末。"},{"en":"The meeting is scheduled at the courthouse in Lakeport, California.","zh":"会议定在加州莱克波特的法院举行。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a port or harbor on a lake; a lakeside docking area","zh":"（较少见）湖港；湖边的码头或停靠区"},"examples":[{"en":"The ferry leaves from the lakeport every hour in summer.","zh":"夏天渡轮每小时从湖港出发一次。"},{"en":"Small boats were tied up at the lakeport near the village.","zh":"小船系在村子附近的湖边码头。"}]}],"synonyms":["(place name)","lakeside dock","marina","harbor"],"phonetic":"/ˈleɪkˌpɔɹt/","extraExplanation":["“Lakeport”在日常英语里最常见的用法是地名（加州的 Lakeport）。作为普通名词“lake + port（湖 + 港）”的组合也能理解，但在真实语境中更常说“lakeside dock / marina / harbor”。","如果你在地图、新闻或旅行信息里看到 Lakeport，通常首字母会大写，表示地名。"]}
{"word":"lakeports","summary":{"en":"“Lakeports” usually means ports on a lake; it can also refer to multiple places named “Lakeport” (often the city in California).","zh":"“Lakeports”通常指“湖港”（湖上的港口）；也可指多个名为“Lakeport”的地点（常见为美国加州的 Lakeport 市）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of lakeport) Ports, harbors, or landing places located on a lake, where boats and goods can arrive and depart.","zh":"（lakeport 的复数）湖港；位于湖上的港口、码头或靠泊点，船只与货物可在此进出。"},"examples":[{"en":"In the 1800s, several lakeports grew into busy trading towns.","zh":"在19世纪，一些湖港发展成繁忙的贸易城镇。"},{"en":"The ferry connects the two lakeports on opposite sides of the lake.","zh":"这艘渡轮连接湖两岸的两个湖港。"}]},{"partOfSpeech":"n.","definition":{"en":"As a proper name, “Lakeport” can refer to a city (most commonly Lakeport, California); “Lakeports” may mean multiple places with that name or organizations using the name.","zh":"作为专有名词，“Lakeport”可指一个城市（最常见为美国加州的莱克波特市）；“Lakeports”可指多个同名地点或使用该名称的机构。"},"examples":[{"en":"Lakeport is the county seat of Lake County in California.","zh":"Lakeport 是美国加州莱克县的县治。"},{"en":"They visited several Lakeports during their road trip to compare small-town museums.","zh":"他们在自驾途中去了几个名为 Lakeport 的地方，对比小镇博物馆。"}]}],"synonyms":["lake harbor","lakeside port","inland port"],"phonetic":"ˈleɪkˌpɔrt","extraExplanation":["“lakeport”通常是由 lake（湖）+ port（港口）组合而成，属于比较直观的复合词。在美国地名中也常见这种构词方式：用自然地理特征 + 功能/地点类型来命名。","如果你指的是加州的 Lakeport：它位于 Clear Lake（清湖）附近，因湖泊旅游、钓鱼与地方行政功能而知名。"]}
{"word":"laker","summary":{"en":"A laker is usually a ship that operates on large lakes (especially the Great Lakes), and it can also mean a person connected to a lake or, informally, a Los Angeles Lakers fan.","zh":"laker通常指在大湖（尤其是北美五大湖）上航行的船；也可指与湖有关的人，或（非正式）指洛杉矶湖人队的球迷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ship (especially a large cargo ship) that operates mainly on a lake, especially on the Great Lakes in North America","zh":"（尤指北美五大湖上的）湖船；在湖上航行的（大型）货船"},"examples":[{"en":"The iron ore was carried by a laker across Lake Superior.","zh":"铁矿石由一艘湖船穿越苏必利尔湖运送。"},{"en":"A storm forced the laker to stay in port overnight.","zh":"暴风雨迫使那艘湖船在港口停留过夜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who lives near, works on, or spends a lot of time on a lake","zh":"住在湖边、在湖上工作或经常在湖上活动的人"},"examples":[{"en":"Local lakers know the safest routes across the lake in winter.","zh":"当地常在湖上活动的人知道冬天穿越湖面的最安全路线。"},{"en":"She’s a longtime laker who teaches sailing every summer.","zh":"她长期在湖区生活，每年夏天教帆船。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a fan of the Los Angeles Lakers basketball team","zh":"（非正式）洛杉矶湖人队的球迷"},"examples":[{"en":"He’s been a Laker since the Kobe Bryant era.","zh":"从科比时代起他就一直是湖人球迷。"},{"en":"A group of Lakers cheered outside the arena after the win.","zh":"赢球后，一群湖人球迷在球馆外欢呼。"}]}],"synonyms":["lake freighter","freighter","lake ship","Lakers fan","Lake Erie freighter"],"phonetic":"/ˈleɪkər/","extraExplanation":["“laker”最常见的非体育含义与北美“五大湖”有关，特指在这些内陆大湖上跑运输的货船；相关词组有“lake freighter（湖上货轮）”。","体育用法中，“a Laker”通常指洛杉矶湖人队的一名球员或球迷；写作时注意大小写：普通名词“laker”（湖船/湖区人）一般不大写，而球队相关的“Laker”常大写。"]}
{"word":"Lakers","summary":{"en":"“Lakers” most commonly refers to the Los Angeles Lakers NBA team; less commonly, it can mean people associated with lakes.","zh":"“Lakers”最常指NBA的洛杉矶湖人队；较少情况下也可指与湖泊相关的人（如住在湖边或在湖上工作的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous professional basketball team in the NBA based in Los Angeles, California (officially: the Los Angeles Lakers).","zh":"美国职业篮球联赛（NBA）中一支著名的职业篮球队，位于加利福尼亚州洛杉矶（全称：洛杉矶湖人队）。"},"examples":[{"en":"The Lakers are playing the Warriors tonight.","zh":"湖人队今晚要对阵勇士队。"},{"en":"He’s been a Lakers fan since he was a kid.","zh":"他从小就是湖人队的球迷。"},{"en":"LeBron James has played for the Lakers.","zh":"勒布朗·詹姆斯曾效力于湖人队。"}]},{"partOfSpeech":"n.","definition":{"en":"People who live near lakes, or who work/travel on lakes (less common).","zh":"住在湖边的人，或在湖上工作/航行的人（较少见）。"},"examples":[{"en":"In summer, the town fills with hikers and lakers.","zh":"夏天，小镇里到处都是徒步者和湖边游客。"},{"en":"The lakers know the water and weather well.","zh":"熟悉湖面与天气的，往往是常年在湖上活动的人。"}]}],"synonyms":["the Los Angeles Lakers","LA Lakers","L.A. Lakers"],"phonetic":"/ˈleɪkərz/","extraExplanation":["“Lakers”原意与“湖”有关，最早可追溯到球队早期在明尼苏达州（“万湖之地”）的历史；后来球队搬到洛杉矶，但队名保留至今。","在体育语境里，“the Lakers”通常直接特指洛杉矶湖人队；写作时常见搭配：Lakers game（湖人比赛）、Lakers fan（湖人球迷）、Lakers jersey（湖人球衣）。"]}
{"word":"lakers","summary":{"en":"“Lakers” most commonly refers to the Los Angeles Lakers NBA team; it can also mean people connected to a lake or Great Lakes cargo ships (less common).","zh":"“Lakers”最常指 NBA 的洛杉矶湖人队；也可指与湖泊相关的人或五大湖货船（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Los Angeles Lakers, a professional basketball team in the NBA (often called “the Lakers”)","zh":"洛杉矶湖人队（NBA 的职业篮球队，常简称“湖人”）"},"examples":[{"en":"The Lakers play their home games in Los Angeles.","zh":"湖人在洛杉矶打主场比赛。"},{"en":"I’m a Lakers fan, so I watched the game last night.","zh":"我是湖人球迷，所以我昨晚看了比赛。"},{"en":"He bought a Lakers jersey with his favorite player’s name on it.","zh":"他买了一件印着最喜欢球员名字的湖人球衣。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of laker: a person who lives near a lake or is associated with a lake (rare in everyday conversation)","zh":"laker 的复数：住在湖边的人；与湖泊有关的人（日常用法较少）"},"examples":[{"en":"Local lakers know the safest places to swim.","zh":"当地的湖边居民知道哪里游泳最安全。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of laker: a cargo ship used on the Great Lakes (mainly North American English)","zh":"laker 的复数：在北美五大湖行驶的货船（主要用于北美英语）"},"examples":[{"en":"In summer, you can see lakers carrying ore across the Great Lakes.","zh":"夏天你能看到五大湖货船运送矿石穿越湖面。"}]}],"synonyms":["the Los Angeles Lakers","LA Lakers","the Lakers"],"phonetic":"ˈleɪkərz","extraExplanation":["“Lakers”最常见的指代是 NBA 的“洛杉矶湖人队”。队名源于球队早期在明尼阿波利斯（“万湖之地”明尼苏达）时期的历史，后来迁到洛杉矶仍沿用该名称。","在口语里常直接说“the Lakers”。书写时通常大写，因为这是专有名词（球队名称）。"]}
{"word":"lakes","summary":{"en":"“Lakes” usually means more than one lake (noun plural); rarely, it can be a verb meaning water gathers into a still pool.","zh":"“lakes”通常是“湖”的复数（名词）；少见情况下可作动词，表示水汇聚成一片静水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large area of water surrounded by land; plural form of “lake.”","zh":"湖；被陆地包围的一大片水域（“lake”的复数）。"},"examples":[{"en":"This region has many lakes and forests.","zh":"这个地区有许多湖泊和森林。"},{"en":"In summer, people swim in the lakes.","zh":"夏天人们会在湖里游泳。"}]},{"partOfSpeech":"v.","definition":{"en":"to form or collect into a lake; to make water stand still in one place (less common).","zh":"形成湖泊；使水汇聚成湖或积成一片（较少见）。"},"examples":[{"en":"After the flood, water laked in the low fields.","zh":"洪水过后，水在低洼的田地里积成一片。"}]}],"synonyms":["lakes (noun plural)","bodies of water","ponds (smaller, not the same)","reservoirs (man-made, not the same)"],"phonetic":"/leɪks/","extraExplanation":["“lakes”最常见是名词复数，用来表示多个湖。作为动词“to lake”在现代英语里不常用，多见于描写性或较文学的语境，意思是“积水成湖/汇成一片静水”。","文化小提示：在美国，“the Great Lakes（五大湖）”常用来指苏必利尔湖、密歇根湖、休伦湖、伊利湖、安大略湖，是北美非常重要的淡水与航运区域。"]}
{"word":"lakeshore","summary":{"en":"The lakeshore is the land along the edge of a lake.","zh":"lakeshore 指湖的边缘地带，也就是湖岸、湖边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the land along the edge of a lake; the shore of a lake","zh":"湖岸；湖边的陆地（沿着湖的边缘）"},"examples":[{"en":"We took a walk along the lakeshore at sunset.","zh":"我们在日落时沿着湖岸散步。"},{"en":"Many birds build nests near the lakeshore.","zh":"很多鸟会在湖岸附近筑巢。"},{"en":"They rented a cabin on the lakeshore for the weekend.","zh":"他们周末在湖岸租了一间小木屋。"}]}],"synonyms":["shore","lakefront","lakeside (area)"],"phonetic":"/ˈleɪkˌʃɔr/","extraExplanation":["“Lakeshore”常见于地名或机构名中（如 Lakeshore Drive、Lakeshore School），表示“靠湖的一带/沿湖区域”。作地名时通常大写。","与近义表达对比：shore 更泛指海岸或湖岸；lakeside 更强调“在湖边（的位置/环境）”，常作形容词（a lakeside hotel 湖边的酒店）。"]}
{"word":"lakeside","summary":{"en":"“Lakeside” means the area next to a lake (noun) or something located by a lake (adjective).","zh":"“lakeside”表示湖边的地方（名词），或临湖的/湖边的（形容词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the land or area beside a lake; the shore of a lake","zh":"湖畔；湖边；靠近湖的地方"},"examples":[{"en":"They rented a cabin on the lakeside for the weekend.","zh":"他们周末在湖边租了一间小木屋。"},{"en":"We walked along the lakeside path at sunset.","zh":"我们在日落时沿着湖畔小路散步。"}]},{"partOfSpeech":"adj.","definition":{"en":"located next to a lake; by a lake","zh":"湖边的；临湖的"},"examples":[{"en":"The hotel has beautiful lakeside views.","zh":"这家酒店有很美的临湖景色。"},{"en":"Lakeside towns can be busy in summer.","zh":"湖边小镇在夏天可能很热闹。"}]}],"synonyms":["lake shore","shoreline","by the lake","on the lakefront"],"phonetic":"/ˈleɪkˌsaɪd/","extraExplanation":["“lakeside”是由“lake（湖）+ side（边）”组成的复合词，既能当名词（指湖边那片地方），也能当形容词（描述某物在湖边）。","常见搭配：lakeside cabin（湖边小屋）、lakeside view（临湖景观）、lakeside walk/path（湖边步道）、lakeside community/town（湖畔社区/小镇）。在旅游宣传或房产广告里很常见。"]}
{"word":"lakesides","summary":{"en":"“Lakesides” means the areas next to lakes.","zh":"“Lakesides”指多个“湖边/湖畔地带”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the areas or pieces of land next to a lake (plural of “lakeside”)","zh":"湖边；湖畔地带（“lakeside”的复数）"},"examples":[{"en":"In summer, the lakesides are full of picnics and people fishing.","zh":"夏天，湖边到处都是野餐的人和钓鱼的人。"},{"en":"We walked along the lakesides and took photos of the mountains.","zh":"我们沿着湖边走，拍了山的照片。"}]}],"synonyms":["lake shores","shorelines","lakefronts","banks"],"phonetic":"/ˈleɪkˌsaɪd/","extraExplanation":["“lakeside”是由 lake（湖）+ side（边）组成的复合词，既可作名词（湖边地区），也常作形容词（lakeside cabin 湖边小屋）。复数形式是“lakesides”。"]}
{"word":"lakeward","summary":{"en":"“Lakeward” means “toward the lake” or “on the lake side.”","zh":"“lakeward”表示“朝湖边/向湖的方向”或“靠湖一侧的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward a lake; in the direction of a lake (often describing movement or position).","zh":"朝向湖的；往湖那边的（常用来描述移动或位置）。"},"examples":[{"en":"We walked lakeward as the sun began to set.","zh":"太阳开始落山时，我们朝湖边走去。"},{"en":"A lakeward breeze brought cooler air in the evening.","zh":"傍晚时分，一阵朝湖面吹来的风带来了更凉爽的空气。"}]},{"partOfSpeech":"adj.","definition":{"en":"Facing or located toward a lake; on the lake side.","zh":"面向湖的；靠湖一侧的。"},"examples":[{"en":"The cabin’s lakeward windows have the best view.","zh":"小屋朝湖的窗户视野最好。"},{"en":"They chose a lakeward seat on the patio.","zh":"他们在露台选了一个靠湖的座位。"}]}],"synonyms":["toward the lake","lake-side","lakeside"],"phonetic":"/ˈleɪk.wɚd/","extraExplanation":["“lakeward”较少见，常见于描写自然环境或地理方位的文字中（尤其是较文学化的表达）。","后缀“-ward”表示“朝……方向”，类似：seaward（朝海的）、homeward（回家的）、northward（向北的）。在美式英语里也常见拼写“-wards”（如 towards），但美式更常用 toward。"]}
{"word":"lakeweed","summary":{"en":"Lakeweed means the water plants (or heavy algae) growing in a lake, often considered a nuisance.","zh":"Lakeweed 指湖里生长的水草（或大量藻类），常带“碍事的杂草”含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aquatic plants (or thick algae) that grow in a lake, often seen as unwanted because they tangle around boats, clog water, or make swimming difficult.","zh":"湖里的水生植物（或大量藻类），常被视为“水草/杂草”，因为会缠住船只、堵塞水域或影响游泳。"},"examples":[{"en":"The boat propeller got tangled in lakeweed near the shore.","zh":"靠近岸边时，船的螺旋桨被湖里的水草缠住了。"},{"en":"In late summer, the lakeweed becomes thick and makes swimming unpleasant.","zh":"夏末时湖里的水草变得很茂密，游泳就不太舒服了。"},{"en":"The park posted a notice asking visitors not to pull out lakeweed by hand.","zh":"公园贴出告示，提醒游客不要用手乱拔湖里的水草。"}]}],"synonyms":["aquatic weeds","water weeds","pondweed","algae (when referring to thick growth)"],"phonetic":"/ˈleɪkˌwiːd/","extraExplanation":["“lakeweed”不是非常常见的标准词，更常见的说法是写成两词“lake weed”，或用更具体的词：如“aquatic weeds（水生杂草）”“weeds（水草）”“algae（藻类）”“pondweed（眼子菜等水草的统称）”。","在日常语境里它通常带一点“讨厌、碍事”的感觉，尤其在钓鱼、划船、游泳等场景；如果是科学或环保讨论，最好用具体物种名或用更中性的“aquatic plants（水生植物）”。"]}
{"word":"lakey","summary":{"en":"“Lakey” is usually a misspelling of “lackey”: a servant/attendant, or (more commonly today) a person who blindly follows someone powerful.","zh":"“lakey”多为“lackey”的误拼：可指仆人/随从；现代更常用作贬义，比喻盲目追随权势者的“走狗/跟班”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A servant or attendant (especially a uniformed servant in the past).","zh":"仆人；随从（尤指过去穿制服侍奉的男仆）。"},"examples":[{"en":"In old novels, a wealthy family might have a lackey waiting at the door.","zh":"在旧小说里，富人家门口可能会有一名男仆随时等候。"},{"en":"The lackey carried the guest’s bags upstairs.","zh":"男仆把客人的行李提到楼上。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows someone powerful without thinking independently; a yes-man.","zh":"走狗；马屁精（盲目追随权势者、缺乏独立判断的人）。"},"examples":[{"en":"He’s not a leader—just a lackey who repeats whatever the boss says.","zh":"他不是领导，只是个跟班，老板说什么他就重复什么。"},{"en":"The senator was accused of being a corporate lackey.","zh":"那位参议员被指责是大公司的走狗。"}]}],"synonyms":["servant","attendant","underling","minion","yes-man","toady"],"phonetic":"/ˈlæki/","extraExplanation":["“lakey”通常是“lackey”的拼写错误；标准拼写是 lackey。","lackey 源自法语 laquais，历史上指贵族家中的随从；现代更常见的用法是比喻义（贬义）：指盲从权势的人。","文学里常用 lackey 来营造“旧式贵族/宫廷”氛围，也常用于政治或职场批评语境。"]}
{"word":"lakh","summary":{"en":"Lakh means 100,000, used mainly in South Asian counting and money contexts.","zh":"Lakh 指“十万”（100,000），主要用于南亚地区的计数和金额表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit meaning one hundred thousand (100,000), commonly used in South Asia, especially in India, Pakistan, Bangladesh, Nepal, and Sri Lanka.","zh":"（南亚常用的）“十万”（100,000）的计数单位，常见于印度、巴基斯坦、孟加拉国、尼泊尔、斯里兰卡等地。"},"examples":[{"en":"The project cost two lakh rupees.","zh":"这个项目花了二十万卢比。"},{"en":"The city has a population of about ten lakh.","zh":"这座城市人口大约有一百万（十个“lakh”）。"},{"en":"Her salary is 8 lakh per year.","zh":"她年薪是80万（8 lakh）。"}]}],"synonyms":["hundred thousand"],"phonetic":"/lɑk/","extraExplanation":["“lakh”多见于英语报道或商务语境中谈到南亚时的数字表达。写法上常见“a lakh / two lakh / 5 lakh”，有时也写作复数“lakhs”。","南亚数字分组方式也常与西方不同，例如 1,00,000 表示 one lakh（十万），10,00,000 表示 ten lakh（即 one million，一百万）。"]}
{"word":"lakhs","summary":{"en":"“Lakhs” is the plural of “lakh,” meaning 100,000 in the Indian numbering system.","zh":"“lakhs”是“lakh”的复数，表示印度计数法中的十万（100,000）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) A unit in the Indian numbering system equal to 100,000 (one hundred thousand). “Lakhs” is the plural form.","zh":"（南亚）印度数字计数法中的单位，等于100,000（十万）。“lakhs”为复数形式。"},"examples":[{"en":"The house costs 50 lakhs (5,000,000 rupees).","zh":"这套房子要50 lakhs（即500万卢比）。"},{"en":"Her annual salary is around two lakhs.","zh":"她的年薪大约是2 lakhs（20万）。"},{"en":"The company raised several lakhs in funding.","zh":"这家公司筹集了好几十万（lakhs 计数）的资金。"}]}],"synonyms":["hundred thousand"],"phonetic":"/læk/","extraExplanation":["“lakh”主要在印度、巴基斯坦、孟加拉国、尼泊尔、斯里兰卡等地的英语中使用，常见于新闻、薪资、房价与预算表达。","印度计数法常把数字写成 1,00,000（对应 100,000），而不是 100,000；更大的单位还有 “crore”=10,000,000（一千万）。","在英文里可说 “two lakh” 或 “two lakhs”，但更正式的写法常用 “two lakh” 作数量单位；具体取决于地区与写作风格。"]}
{"word":"lakie","summary":{"en":"“lakie” is usually a misspelling/variant of “lackey,” meaning a servant or (more often) a negative term for a yes-man or follower.","zh":"“lakie”通常是“lackey”的误拼或变体，指仆人/随从，更常作贬义，指盲从他人的跟班、应声虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant or misspelling of “lackey”: a servant, assistant, or person who follows and obeys someone (often used negatively, meaning an unthinking follower).","zh":"“lackey”的变体或常见拼写错误：仆人、随从；（常带贬义）盲从他人的走狗、跟班。"},"examples":[{"en":"In old stories, the king’s lackeys carried messages and opened doors.","zh":"在老故事里，国王的随从负责传话、开门。"},{"en":"Some critics called him a lackey for repeating whatever the boss said.","zh":"一些批评者说他是走狗，因为老板说什么他就跟着说什么。"}]}],"synonyms":["servant","underling","yes-man","toady","follower"],"phonetic":"ˈlæki","extraExplanation":["“Lackey”一词在现代英语里常带贬义，强调“没有独立判断、只会讨好或服从权势的人”。如果你想表达中性“助手/助理”，更常用 assistant, aide, helper。","如果你要找的是人名或昵称“Laki/Lakie”（在不同文化中可能存在），含义会因语言而异；你可以告诉我上下文（句子或来源），我能更准确解释。"]}
{"word":"lakier","summary":{"en":"“Lakier” is a Polish word meaning lacquer/varnish (sometimes nail polish or car paint). In English, people usually say “lacquer,” “varnish,” or “nail polish.”","zh":"“Lakier”是波兰语，意为清漆/罩光漆（有时也指指甲油或汽车漆）。英语里通常用“lacquer / varnish / nail polish”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Polish) lacquer; varnish; a glossy protective coating (also used for nail polish or car paint in Polish contexts).","zh":"（源自波兰语）清漆；罩光漆；有光泽的保护涂层（在波兰语语境中也可指指甲油或汽车漆）。"},"examples":[{"en":"In Polish, “lakier” can mean varnish for wood or paint for a car.","zh":"在波兰语里，“lakier”既可以指木器清漆，也可以指汽车漆。"},{"en":"She bought red lakier for her nails while traveling in Poland.","zh":"她在波兰旅行时买了红色的“lakier”（指甲油）。"}]}],"synonyms":["lacquer","varnish","clear coat","nail polish"],"phonetic":"/ˈlɑkˌjɛr/","extraExplanation":["“Lakier”本身不是常见英语词；它多出现在英语对话里作为外来词（比如谈到波兰产品、菜单、说明书或旅行经历）。在英语中更常用的对应词是 lacquer（清漆/漆）或 varnish（清漆/罩光漆）；若指指甲油通常说 nail polish。","拼写与词源上，“lakier”与英语 lacquer 有同源关系（都与“涂覆、上光”的概念有关），但在英语写作中一般仍建议用 lacquer/varnish，除非你是在引用波兰语原词。"]}
{"word":"lakiest","summary":{"en":"“Lakiest” is usually a misspelling of “luckiest” (the most lucky/fortunate).","zh":"“lakiest”通常是“luckiest（最幸运的）”的误拼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “luckiest,” meaning the most lucky or most fortunate.","zh":"（非标准拼写）通常是“luckiest”的误拼，意思是“最幸运的；最有福气的”。"},"examples":[{"en":"She felt like the luckiest person in the world.","zh":"她觉得自己是世界上最幸运的人。"},{"en":"We were the luckiest to find a taxi right away.","zh":"我们很幸运，马上就打到了一辆出租车。"}]}],"synonyms":["luckiest","most fortunate","most blessed"],"phonetic":"ˈlʌkiəst","extraExplanation":["“lakiest”在现代英语里几乎不作为标准词使用；更常见、正确的拼写是“luckiest”（lucky 的最高级）。","如果你是在写作或考试中使用，建议改为“luckiest”。如果你想表达“最幸运的”，也可以用“most fortunate”。"]}
{"word":"lakin","summary":{"en":"“Lakin” is most commonly a surname (and sometimes a given name). In informal writing, “lakin’” can represent “lacking” (not having enough).","zh":"“Lakin”最常见是姓氏（也可作名字）。在非正式写作中，“lakin’”有时用来表示“lacking（缺少、不足）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) and sometimes a given name.","zh":"姓氏（也偶尔作名字）。"},"examples":[{"en":"Ms. Lakin will lead the meeting today.","zh":"Lakin 女士今天将主持会议。"},{"en":"His last name is Lakin.","zh":"他的姓是 Lakin。"}]},{"partOfSpeech":"adj.","definition":{"en":"an informal spelling of “lacking,” meaning not having enough of something (often used to show casual speech).","zh":"“lacking”的非正式拼写，表示“缺少、不足”（常用来体现口语语气）。"},"examples":[{"en":"I’m lakin’ sleep this week.","zh":"我这周睡眠不足。"},{"en":"The plan is lakin’ details.","zh":"这个计划缺少细节。"}]}],"synonyms":["(name) —","lacking","missing","short of"],"phonetic":"/ˈleɪkɪn/","extraExplanation":["作姓名的 Lakin 在英语世界里较常见，读音通常是 “LAY-kin”。","写作 lakin’（常带撇号）多见于口语化表达或文学对白，用来模仿 “lacking” 的随意发音；正式写作中一般用 lacking。"]}
{"word":"laking","summary":{"en":"“Lacking” means not having enough of something; often used as “lacking in …”.","zh":"“lacking”表示“缺少/不足”，常用结构是“lacking in …”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not having enough of something; missing something that is needed","zh":"缺少的；不足的（指需要的东西不够或没有）"},"examples":[{"en":"The report is lacking in detail.","zh":"这份报告细节不足。"},{"en":"He’s smart but lacking confidence.","zh":"他很聪明，但缺乏自信。"},{"en":"The plan is lacking because it doesn’t include a budget.","zh":"这个计划不完善，因为没有包含预算。"}]},{"partOfSpeech":"phrase","definition":{"en":"the act of not having or not showing something (often used in the pattern “lacking in …”)","zh":"缺乏；没有（常用于“lacking in …”结构）"},"examples":[{"en":"She was criticized for lacking in leadership skills.","zh":"她因缺乏领导能力而受到批评。"},{"en":"The team is lacking in experience.","zh":"这个团队缺乏经验。"}]}],"synonyms":["missing","insufficient","inadequate","short of"],"phonetic":"/ˈlækɪŋ/","extraExplanation":["“laking”本身不是常见英文单词；大多数情况下是把 **lacking**（缺少的）拼错了。","**lacking in + 名词** 是非常常用的搭配：lacking in patience / lacking in evidence / lacking in support。","如果你本来想表达“像湖一样形成/出现”（来自动词 lake），那是非常少见的用法；日常英语几乎不用。"]}
{"word":"lakings","summary":{"en":"“Lakings” is an old-fashioned exclamation used to show surprise or emphasis.","zh":"“lakings”是古英语里的感叹语，用来表示惊讶或强调语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Archaic) A mild oath or exclamation, similar to “indeed!”, “goodness!”, or “by my faith!”","zh":"（古语）一种温和的感叹/起誓语，相当于“真的！”“天哪！”“确实如此！”"},"examples":[{"en":"Lakings! I never thought I’d see you again.","zh":"哎呀（真的）！我从没想过还能再见到你。"},{"en":"Lakings, sir, that’s a fine horse you have.","zh":"哎呀，先生，你这匹马真不错。"}]}],"synonyms":["indeed","goodness","my goodness","forsooth"],"phonetic":"/ˈleɪkɪŋz/","extraExplanation":["“lakings”多见于16–17世纪的英语戏剧与文学作品中，属于当时常见的“弱化誓词（minced oath）”，用来表达惊讶、强调或轻微的情绪起伏，但比直接的宗教誓词更委婉、更不冒犯。","在现代英语里它几乎不再使用；阅读古典文学（如早期戏剧、骑士传奇或仿古风格作品）时见到它，可以大致按“indeed / goodness / my goodness”来理解语气。"]}
{"word":"lakish","summary":{"en":"Lakish usually refers to the ancient city more commonly spelled “Lachish.”","zh":"Lakish通常指更常见拼写为“Lachish（拉吉什）”的那座古城。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a variant spelling of “Lachish,” an ancient city in the southern Levant (today in Israel), known from the Hebrew Bible and important archaeological finds.","zh":"“Lakish”常被视为“Lachish（拉吉什）”的另一种拼写：一座位于南黎凡特（今以色列境内）的古城，常见于《希伯来圣经》，并以重要考古发现而闻名。"},"examples":[{"en":"Some sources spell the site as Lakish, but most English histories use Lachish.","zh":"有些资料把这个遗址写作Lakish，但大多数英文史书使用Lachish。"},{"en":"Archaeologists have studied Lakish/Lachish to learn about ancient Judean fortifications.","zh":"考古学家研究Lakish/Lachish，以了解古代犹大的防御工事。"}]}],"synonyms":["Lachish"],"phonetic":"/ləˈkiʃ/","extraExplanation":["“Lachish（拉吉什）”在英语学术与圣经研究中更常用；“Lakish”多见于音译差异、非专业资料或不同语言转写习惯。","拉吉什因亚述帝国围攻的历史与相关浮雕记载而著名，也与“Lachish letters（拉吉什书信）”等考古文物有关。"]}
{"word":"lakishness","summary":{"en":"Rakishness means a charmingly rebellious, slightly disreputable style; less commonly, it can mean a slanted/leaning appearance.","zh":"rakishness 指带点迷人又不太正经的“浪子/不羁气质”；较少见时也可指外观上的倾斜状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being slightly disreputable in an attractive, confident way; a “charming bad-boy/bad-girl” style.","zh":"带点放荡不羁却又迷人自信的气质；有种“坏坏的魅力”。"},"examples":[{"en":"He had a certain rakishness that made him hard to ignore.","zh":"他有一种放荡不羁的迷人气质，让人很难忽视。"},{"en":"The movie gives the hero a touch of rakishness to make him more interesting.","zh":"电影给男主加了一点“浪子气”，让他更有看点。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being slanted or leaning (especially used about the angle of a ship or an object).","zh":"倾斜、歪斜的状态（尤用于描述船或物体的倾角）。"},"examples":[{"en":"From a distance, the sailboat’s rakishness made it look fast.","zh":"远远看去，帆船的倾斜姿态让它显得速度很快。"}]}],"synonyms":["roguishness","dashingness","mischief","wildness","debauchery (stronger)","tilt (angle sense)","slant (angle sense)"],"phonetic":"/ˈreɪkɪʃnəs/","extraExplanation":["“lakishness”在英语里不常见，最可能是拼写误差，通常想表达的是“rakishness”。","“rakishness”来自形容词“rakish”，而“rakish”与旧时名词“rake”有关：指沉迷享乐、放纵的男子（“浪子”）。因此它常带有“迷人但不太正经”的文学/影视气质。"]}
{"word":"lakism","summary":{"en":"“Lakism” is not a recognized standard English word; it’s probably a misspelling of a different “-ism” word.","zh":"“lakism”不是规范英语词；大概率是某个以“-ism（主义/学说）”结尾单词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a very rare name/coinage. You may have meant a similar word such as “laicism” (secularism in politics) or “Lamarckism” (an old theory of evolution).","zh":"不是标准英语单词；更可能是拼写错误或极罕见的专有名词/新造词。你可能想写的是类似的词，如“laicism”（政教分离/世俗主义的一种立场）或“Lamarckism”（拉马克学说，一种旧的进化理论）。"},"examples":[{"en":"I can’t find “lakism” in a dictionary—could it be “laicism”?","zh":"我在词典里找不到“lakism”——会不会是“laicism”？"},{"en":"Please check the spelling and share the sentence where you saw “lakism.”","zh":"请核对拼写，并把你看到“lakism”的句子发给我。"}]}],"phonetic":"/ˈleɪkɪzəm/","extraExplanation":["“-ism”在英语里常见于表示“主义/学说/风格”（如 feminism 女权主义，realism 现实主义）。所以“lakism”看起来像“某种主义”，但它本身不属于常见词汇。","如果你告诉我它出现的领域（政治、宗教、语言学、某本书/某个游戏/某个社群）或提供原句，我可以更准确地判断它到底指什么、以及最可能的正确拼写。"]}
{"word":"lakist","summary":{"en":"“Lakist” is not a standard English word; it’s likely a typo or a proper name. A common intended word may be “laicist” (secularist).","zh":"“lakist”不是标准英语词，可能是拼写错误或专有名词。较常见的可能目标词是“laicist（世俗主义者/主张政教分离者）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare spelling; not a recognized common English word in most dictionaries. It may be a typo or a name.","zh":"一种不规范或极少见的拼写；在多数英语词典中不是常见词。可能是拼写错误或专有名词（如人名/地名）。"},"examples":[{"en":"I couldn’t find “lakist” in a standard dictionary, so I checked whether it was a typo.","zh":"我在常用词典里查不到“lakist”，所以我去核对它是否是拼写错误。"},{"en":"If you meant “laicist,” the spelling is different even though it may sound similar.","zh":"如果你想表达“laicist（世俗主义者）”，拼写不同，尽管读音可能相近。"}]}],"phonetic":"/ˈleɪkɪst/","extraExplanation":["“lakist”很可能是拼写误差。你可以回想它出现的语境（政治/宗教/地理/人名？）来判断目标词。","最接近的常见词之一是 **laicist**（/ˈleɪsɪst/）：指主张政教分离、强调世俗主义的人或立场。也有人想写 **lakiest**（luckiest 的误拼或变体）或与 **lake** 相关的词，但这些都需要语境确认。","如果你把原句（前后各一句）发来，我可以帮你精确判断它应该是哪一个词，并给出正确释义与用法。"]}
{"word":"lakke","summary":{"en":"“Lakke” is not a standard English spelling; it is most likely meant to be “lacquer,” a shiny protective coating or the act of applying it.","zh":"“lakke”不是标准英语拼写；最可能是想写“lacquer”，指光亮的保护性涂层（清漆/亮漆）或给物品上这种漆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, shiny protective coating (a type of varnish) applied to wood, metal, or nails; also the liquid used to make this coating","zh":"（清漆/亮漆）一种坚硬、有光泽的保护涂层（类似清漆），用于木材、金属或指甲；也指这种涂料本身"},"examples":[{"en":"The table was finished with a clear lacquer to protect the wood.","zh":"这张桌子刷了一层透明亮漆来保护木头。"},{"en":"She applied red nail lacquer before the party.","zh":"聚会前她涂了红色指甲油。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover something with lacquer to make it shiny and protected","zh":"给……上亮漆/清漆（使其有光泽并起保护作用）"},"examples":[{"en":"The workers lacquered the wooden doors to prevent moisture damage.","zh":"工人给木门上清漆以防潮损坏。"},{"en":"In traditional crafts, some boxes are lacquered in many thin layers.","zh":"在传统工艺中，有些盒子会刷很多层很薄的漆。"}]}],"synonyms":["varnish","coating","finish"],"phonetic":"/ˈlækər/","extraExplanation":["“lakke”本身不是常见的标准英语拼写；如果你想查的就是英文单词，最可能是拼错了“lacquer”（清漆/亮漆）。","“lacquer”在工艺与艺术里很常见（如“lacquerware”漆器）。词源与“lac”（虫胶/树脂）有关，后来泛指能形成坚硬光亮膜的涂层。","如果你原本想表达“缺少”，对应的英语是“lack”（缺乏）。如果你告诉我句子语境，我也可以帮你确认你要找的词。"]}
{"word":"lakmus","summary":{"en":"Litmus is a dye used to test acids/bases, and it also means a clear test that reveals the truth about something (a “litmus test”).","zh":"Litmus 指用于检验酸碱性的石蕊（及石蕊试纸），也可引申为能揭示本质的关键检验（“litmus test”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue dye made from lichens, used in chemistry to test whether a liquid is acidic or basic (it turns red in acid and blue in base)","zh":"一种从地衣提取的蓝色染料，用于化学中测试溶液呈酸性还是碱性（酸性变红，碱性变蓝）"},"examples":[{"en":"We used litmus paper to check if the solution was acidic.","zh":"我们用石蕊试纸来检查溶液是否呈酸性。"},{"en":"If the liquid turns the litmus paper red, it is an acid.","zh":"如果液体把石蕊试纸变红，它就是酸性的。"}]},{"partOfSpeech":"n.","definition":{"en":"a simple, clear test that shows what someone’s true opinions, qualities, or intentions are (often in the phrase “litmus test”)","zh":"能清楚揭示某人真实观点、品质或意图的简单检验（常用于短语“litmus test”）"},"examples":[{"en":"How he treats service workers is a litmus test of his character.","zh":"他如何对待服务人员，是检验他人品的试金石。"},{"en":"For many voters, the debate was a litmus test for leadership.","zh":"对许多选民来说，那场辩论是对领导力的试金石。"}]}],"synonyms":["indicator","test","criterion","acid test"],"phonetic":"/ˈlɪtməs/","extraExplanation":["你输入的“lakmus”常见于波兰语等语言里，意思对应英语的 **litmus**（石蕊）。英语里最常见搭配是 **litmus paper**（石蕊试纸）和 **litmus test**（试金石、关键检验）。","词源上，litmus 与荷兰语有关，最初指一种染料；后来在英语里引申为“能快速看出本质的测试”。"]}
{"word":"lakota","summary":{"en":"Lakota refers to the Lakota people, their language, or anything related to their culture.","zh":"Lakota 指拉科塔人、拉科塔语，或与拉科塔文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Lakota people (a Native American nation that is part of the Sioux peoples), especially from the Great Plains of the United States","zh":"拉科塔人：拉科塔民族的成员（北美原住民民族之一，属于苏族/Sioux peoples 的组成部分），主要分布在美国大平原地区"},"examples":[{"en":"The Lakota have a long history on the northern Great Plains.","zh":"拉科塔人在北部大平原有悠久的历史。"},{"en":"She is Lakota and works to preserve her community’s traditions.","zh":"她是拉科塔人，并致力于保存自己社群的传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Lakota language, a Siouan language spoken by Lakota communities","zh":"拉科塔语：拉科塔人使用的语言，属于苏语系（Siouan）"},"examples":[{"en":"He is learning Lakota to speak with his grandparents.","zh":"他在学习拉科塔语，好和祖父母交流。"},{"en":"Some schools offer classes in Lakota.","zh":"一些学校开设拉科塔语课程。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Lakota people or their language and culture","zh":"拉科塔的：与拉科塔人、其语言或文化有关的"},"examples":[{"en":"They visited a Lakota cultural center.","zh":"他们参观了一家拉科塔文化中心。"},{"en":"The museum displayed Lakota beadwork.","zh":"博物馆展出了拉科塔珠饰工艺品。"}]}],"synonyms":["Sioux (broad, often used historically)","Lakȟótiyapi (Lakota language name)"],"phonetic":"ləˈkoʊtə","extraExplanation":["在英文里常见的拼写是大写 **Lakota**（专有名词）。有时你也会看到 **Lakhóta**（带重音符号的写法），更贴近拉科塔语的拼写习惯。","“Sioux（苏族）”是历史上由外界广泛使用的总称，许多社群更偏好使用自身的名称，例如 **Lakota / Dakota / Nakota**。在写作或交流时，优先尊重当事人/社群的自称更合适。"]}
{"word":"laksa","summary":{"en":"Laksa is a spicy Southeast Asian noodle soup, especially associated with Malaysia and Singapore.","zh":"叻沙是一种辛香的东南亚汤面，尤以马来西亚和新加坡最具代表性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spicy noodle soup from Southeast Asia (especially Malaysia and Singapore), usually made with rice noodles and a rich coconut milk–based or tamarind-based broth, often served with seafood or chicken","zh":"叻沙：一种源自东南亚（尤以马来西亚、新加坡为代表）的辛香汤面，常用米粉/米线，汤底多为椰奶咖喱或酸辣（罗望子）风味，常配海鲜或鸡肉"},"examples":[{"en":"I ordered a bowl of laksa because I wanted something spicy and comforting.","zh":"我点了一碗叻沙，因为我想吃点又辣又暖胃的。"},{"en":"In Singapore, laksa is a popular hawker-center dish.","zh":"在新加坡，叻沙是小贩中心很受欢迎的料理。"}]}],"synonyms":["curry noodle soup","spicy noodle soup"],"phonetic":"/ˈlɑːksə/","extraExplanation":["“Laksa”常被当作总称，指多种地区版本：例如新加坡/马来西亚常见的咖喱叻沙（椰奶更浓郁），以及偏酸辣的亚参叻沙（asam laksa，常用罗望子带出酸味）。","在英语里它通常不可数（Have you tried laksa?），但也很常用作可数来指“一碗/一份”（a laksa / two laksas），口语里都能接受。"]}
{"word":"lakshmi","summary":{"en":"Lakshmi is the Hindu goddess of wealth and good fortune, and it is also a common Indian female given name.","zh":"Lakshmi（拉克希米）是印度教的财富与吉祥女神，也常作为印度女性名字使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Hinduism, the goddess of wealth, good fortune, prosperity, and beauty; often worshipped as the consort of Vishnu.","zh":"在印度教中，掌管财富、好运、繁荣与美的女神；常被尊为毗湿奴（Vishnu）的配偶。"},"examples":[{"en":"Many families pray to Lakshmi for prosperity, especially during Diwali.","zh":"许多家庭会向拉克希米祈求兴旺，尤其在排灯节（Diwali）期间。"},{"en":"In the story, Lakshmi symbolizes abundance and good fortune.","zh":"在这个故事里，拉克希米象征富足与好运。"}]},{"partOfSpeech":"n.","definition":{"en":"A common Indian given name (usually for girls), related to the goddess Lakshmi.","zh":"印度常见的人名（多用于女性），与女神拉克希米同名或取其吉祥之意。"},"examples":[{"en":"Lakshmi is my classmate from Chennai.","zh":"拉克希米是我来自金奈（Chennai）的同学。"},{"en":"Her parents named her Lakshmi to wish her a bright future.","zh":"她的父母给她取名拉克希米，是希望她未来顺遂光明。"}]}],"synonyms":["Shri","Sri","Mahalakshmi"],"phonetic":"ˈlʌkʃmi","extraExplanation":["发音提示：英语里常读作“LUKH-shmee”（重音在第一音节），中间的“ksh”连读是这个词对学习者比较难的地方。","文化背景：拉克希米常与“富足、吉祥、家庭兴旺”联系在一起。在排灯节期间，许多人会进行“迎拉克希米”的仪式，象征邀请好运进入家中。","相关称呼：在一些传统与地区用法中，她也会与“Shri（室利）”等尊称一起出现，用来表达敬意与吉祥之意。"]}
{"word":"laky","summary":{"en":"“Laky” is a rare adjective meaning “full of lakes / lake-like,” and sometimes “colored with lake pigment.”","zh":"“laky”是个很少见的形容词，常指“多湖的/像湖的”，有时也指“用色淀（lake pigment）颜料着色的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having many lakes; full of lakes; lake-like.","zh":"（罕见）多湖的；湖泊很多的；像湖一样的。"},"examples":[{"en":"Finland is a laky country with thousands of lakes.","zh":"芬兰是一个多湖的国家，拥有成千上万的湖泊。"},{"en":"We drove through a laky region where water appeared around every bend.","zh":"我们开车穿过一个多湖地区，几乎每个弯道旁都能看到水面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, art/dyeing) Colored with a “lake” pigment (a traditional type of pigment made from dyes).","zh":"（罕见，艺术/染色）用“色淀/色湖（lake pigment）”颜料着色的。"},"examples":[{"en":"The painter used laky reds to give the portrait warmth.","zh":"画家用了带“色淀”效果的红色，让肖像更温暖。"}]}],"synonyms":["lake-rich","lake-filled","lake-like"],"phonetic":"/ˈleɪki/","extraExplanation":["“laky”在现代英语里非常少见。日常交流中更常见的是：\n- lucky /ˈlʌki/（幸运的）——很多学习者会把“lucky”误拼成“laky”。\n- lake /leɪk/（湖）或 lake-like（像湖一样的）。\n如果你想表达“幸运的”，正确拼写通常是 lucky。"]}

