{"word":"lalala","summary":{"en":"Sung “la” sounds used to hum a tune or playfully avoid a topic.","zh":"用“啦/拉”来哼旋律，或俏皮地表示回避话题。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Sung or spoken syllables used to represent a melody (often when the real words are unknown, unnecessary, or playful).","zh":"用来哼唱旋律的拟声音节（常用于歌词不重要、想不起来、或为了俏皮表达时）。"},"examples":[{"en":"She walked around the house singing, “lalala,” in a good mood.","zh":"她心情很好，在屋里走来走去哼着“lalala”。"},{"en":"I can’t remember the lyrics, so I just go “lalala” during the chorus.","zh":"我记不住歌词，所以副歌就用“lalala”带过。"}]},{"partOfSpeech":"int.","definition":{"en":"A casual way to show you are avoiding a topic or pretending not to hear something (often said jokingly).","zh":"（多带玩笑语气）用来表示回避话题或假装没听见。"},"examples":[{"en":"“Did you break it?” “Lalala, I can’t hear you!”","zh":"“是不是你弄坏的？”“lalala，我听不见！”"},{"en":"He said “lalala” to change the subject when it got awkward.","zh":"气氛尴尬时，他用“lalala”来转移话题。"}]}],"synonyms":["la la la","humming","tra-la-la"],"phonetic":"/ˌlɑː lɑː ˈlɑː/","extraExplanation":["书写上常见形式有“la la la”（分开写，更像一拍一拍的哼唱）和“lalala”（连写，更像连续的旋律）。","语气很关键：开心时像在哼歌；故意回避时常会加上夸张的语调，类似中文的“啦啦啦我不听”。"],"etymology":"源自哼唱时最常用、最容易发音的音节“la”。在英语里常写作“la la la / lalala”，用来拟声旋律或表达轻松、回避等情绪。","mnemonic":["把它当作中文“啦啦啦”：同样是哼歌、装没听见的声音。","联想音乐音名“la”（拉），连续的“la-la-la”就是在“拉”旋律。"]}
{"word":"lalang","summary":{"en":"Lalang usually means a tropical grass (cogon grass/alang-alang) and can also figuratively mean an opportunistic “flip-flopper,” especially in Malaysian/Singaporean English.","zh":"Lalang 通常指热带的白茅（cogon grass/alang-alang）；在马来西亚/新加坡语境中也可比喻“见风转舵、立场摇摆的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall tropical grass (Imperata cylindrica), often considered an invasive weed; also called cogon grass or alang-alang","zh":"一种高大的热带禾草（白茅，学名 Imperata cylindrica），常被视为入侵性杂草；也叫“cogon grass / alang-alang”"},"examples":[{"en":"The field was quickly overtaken by lalang after the rains.","zh":"雨后，那片田地很快就被白茅（lalang）占满了。"},{"en":"Farmers try to clear lalang because it competes with crops.","zh":"农民会尽量清除白茅（lalang），因为它会和农作物争夺养分与空间。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, especially in Malaysian/Singaporean English) someone who changes loyalty or opinion easily, like grass bending in the wind","zh":"（比喻义，常见于马来西亚/新加坡英语）指立场不坚定、见风转舵的人（像风吹草动一样摇摆）"},"examples":[{"en":"Some voters criticized him as a lalang for switching parties again.","zh":"有些选民批评他又换党，是个“见风转舵”的人（lalang）。"},{"en":"She refuses to be a lalang and stands by her principles.","zh":"她拒绝当“墙头草”（lalang），坚持自己的原则。"}]}],"synonyms":["cogon grass","alang-alang","Imperata cylindrica","flip-flopper (figurative)","opportunist (figurative)"],"phonetic":"ˈlɑlɑŋ","extraExplanation":["“Lalang”源自马来语，常指白茅这种草。在马来西亚与新加坡的社会语境里，它也发展出比喻用法：像草随风倒一样，形容人或立场容易动摇（常见搭配如“lalang mentality”）。"]}
{"word":"lalapalooza","summary":{"en":"“Lollapalooza” can mean a well-known music festival, or informally, something exceptionally impressive.","zh":"“Lollapalooza”既可指著名的音乐节，也可作非正式用法表示“特别厉害、非同寻常的事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A famous annual music festival, originally started in the U.S. (often written as “Lollapalooza”).","zh":"（专有名词）著名的年度音乐节，最初起源于美国（常写作“Lollapalooza”）。"},"examples":[{"en":"We’re going to Lollapalooza this summer to see our favorite bands.","zh":"今年夏天我们要去参加 Lollapalooza，去看我们最喜欢的乐队。"},{"en":"She bought a three-day pass for Lollapalooza in Chicago.","zh":"她买了芝加哥 Lollapalooza 的三日通票。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) An unusually impressive person, thing, or event; something extraordinary.","zh":"（非正式）非常厉害的人、事或活动；非同寻常的东西。"},"examples":[{"en":"That new science museum is a real lollapalooza—so many interactive exhibits.","zh":"那个新的科学博物馆真是太厉害了——有好多互动展品。"},{"en":"He threw a lollapalooza of a party for his graduation.","zh":"他毕业时办了一场超级盛大的派对。"}]}],"synonyms":["spectacle","extravaganza","blockbuster","marvel","showstopper"],"phonetic":"/ˌlɑləpəˈluːzə/","extraExplanation":["你输入的“lalapalooza”更常见的拼写是 **Lollapalooza**（两个 l、两个 o）。","“lollapalooza”在19世纪末的美式英语俚语中就有“特别出众的人/事”的意思，后来被用作音乐节名称，因此现在很多人先想到的是音乐节。"]}
{"word":"lalaqui","summary":{"en":"“Lalaqui” is not a common English vocabulary word; it’s probably a proper name or a misspelling.","zh":"“lalaqui”不是常见英语词汇；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (a surname or place name) or a misspelling of another word.","zh":"不是标准英语单词。更可能是专有名词（姓氏或地名），或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “lalaqui” in an English dictionary—do you mean a name or a different spelling?","zh":"我在英语词典里查不到“lalaqui”——你是指一个名字还是另一个拼法？"},{"en":"The email was signed “Lalaqui,” so I assumed it was the sender’s last name.","zh":"邮件署名为“Lalaqui”，所以我猜这是发件人的姓。"}]}],"phonetic":"/ləˈlɑki/","extraExplanation":["“lalaqui”在常见英语词典中通常查不到，因此更像是人名/地名或外来语的拼写。若你告诉我它出现的句子、国家/语言背景（例如法语、西班牙语、菲律宾语等），我可以帮你判断更准确的读音和含义。","如果你本来想查的是英文单词，可能需要核对拼写（例如是否想输入：\"lullaby\"、\"lackey\"、\"lacquer\" 等）。把原句发来我也能帮你定位。"]}
{"word":"lalia","summary":{"en":"Lalia (usually -lalia) is a form meaning “speech/talking,” used mainly in medical and linguistics terms.","zh":"lalia（多见于 -lalia）表示“言语/说话”，主要用于医学与语言学相关术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medical/linguistics, combining form) speech or talking; used in words that describe a type of speech or a speech disorder.","zh":"（医学/语言学中的构词成分）表示“言语、说话”；常用于构成描述某种说话方式或言语障碍的词。"},"examples":[{"en":"Echolalia means repeating other people’s words, and the “-lalia” part relates to speech.","zh":"Echolalia（回声言语）指重复别人说过的话，其中“-lalia”部分与“言语/说话”有关。"},{"en":"Coprolalia describes involuntary saying of obscene words; it is a kind of speech symptom.","zh":"Coprolalia（秽语症）指不由自主说出粗俗/淫秽词语，是一种言语症状。"},{"en":"Glossolalia can mean speaking in an unknown language, often in a religious context.","zh":"Glossolalia（“说方言/灵语”）可指说出未知语言，常见于宗教语境。"}]}],"synonyms":["speech","talking"],"phonetic":"/ˈleɪliə/","extraExplanation":["“lalia”源自希腊语 laliá，意思是“说话、言语”。在英语里它多作为后缀/构词成分出现（写作 -lalia），而不常单独作为普通词使用。","你会更常在医学或心理学术语里看到它：如 echolalia（回声言语）、coprolalia（秽语）、palilalia（重复自己刚说过的话）。"]}
{"word":"laliophobia","summary":{"en":"Laliophobia means an intense fear of speaking, often in public.","zh":"Laliophobia 指对说话（常见为公开发言）的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of speaking (especially speaking in public), often linked to anxiety about stuttering, making mistakes, or being judged.","zh":"对说话（尤其是公开发言）的强烈恐惧，常与担心口吃、出错或被他人评判的焦虑有关。"},"examples":[{"en":"Because of laliophobia, she avoided answering questions in meetings.","zh":"因为有言语恐惧症，她在会议上尽量避免回答问题。"},{"en":"His laliophobia got worse after a few embarrassing presentations at school.","zh":"在学校经历了几次尴尬的演讲后，他的言语恐惧症变得更严重了。"}]}],"synonyms":["speech anxiety","fear of public speaking","glossophobia"],"phonetic":"/ˌlæliəˈfoʊbiə/","extraExplanation":["“Laliophobia”由希腊语词根组成：lalia（说话/言语）+ phobia（恐惧）。它不是日常最常用的词，更常见的相关表达有 “fear of public speaking”（害怕公众演讲）或 “speech anxiety”（言语焦虑）。","它与“社交焦虑”（social anxiety）可能重叠，但更聚焦在“开口说话”这件事上；有些人尤其害怕在紧张时口吃或发音不清，从而形成回避。"]}
{"word":"lall","summary":{"en":"“Lall” is a rare/dialect verb meaning to hum/sing softly, or (more rarely) to babble or speak imperfectly.","zh":"“lall”是较少见的方言/古义动词，常指轻声哼唱/吟唱；更少见时指咿呀学语或含糊地说话。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Dialect/archaic) To sing or hum in a soft, simple way; to chant.","zh":"（方言/古义）轻声唱、哼唱；吟唱。"},"examples":[{"en":"She sat by the fire and lalled an old folk tune.","zh":"她坐在火炉旁，轻声哼唱一首古老的民谣。"},{"en":"In some older writings, a shepherd may be described as lalling to his sheep.","zh":"在一些较早的作品里，牧羊人可能会被描写成对着羊群轻声吟唱。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) To speak in a childlike or imperfect way; to lisp or babble.","zh":"（少见）像小孩一样含糊地说话；口齿不清地说；咿呀学语。"},"examples":[{"en":"The toddler lalled a few sounds and reached for her mother.","zh":"幼儿咿呀学语了几声，伸手要妈妈抱。"}]}],"synonyms":["hum","chant","sing softly","croon","babble","lisp"],"phonetic":"/læl/","extraExplanation":["“lall”在现代标准英语里非常少见，多见于苏格兰英语或旧式文学中。现代更常用的近义表达有：hum（哼唱）、sing softly（轻声唱）、babble（咿呀学语）、lisp（口齿不清）。","如果你本来想查的是“lull”（使平静/哄睡）或“loll”（懒散地躺/垂下），告诉我，我可以分别解释它们的常见用法与区别。"]}
{"word":"lallan","summary":{"en":"Lallan is commonly used as an Indian male name or a warm, informal term of address for someone dear or younger.","zh":"Lallan 常见于印度语境中，可作男性名字/昵称，也可作对亲近或年幼者的亲昵称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A South Asian (especially Indian) male given name or nickname.","zh":"（专有名词）南亚（尤其是印度）常见的男性名字或昵称。"},"examples":[{"en":"Many people in Uttar Pradesh call him Lallan as a friendly nickname.","zh":"在北方邦，很多人用“Lallan”作为亲切的昵称来叫他。"},{"en":"Lallan Singh introduced himself at the meeting.","zh":"拉兰·辛格在会议上做了自我介绍。"}]},{"partOfSpeech":"n.","definition":{"en":"(Indian English / Hindi-influenced) A warm, informal way to address a dear boy, younger person, or close friend—similar to “dear” or “buddy,” depending on context.","zh":"（印度英语/受印地语影响）对亲近的男孩、晚辈或好友的亲昵称呼，语气类似“亲爱的/小伙子/哥们儿”，具体取决于语境。"},"examples":[{"en":"Come here, Lallan, and have some food.","zh":"过来吧，Lallan（亲爱的/小家伙），吃点东西。"},{"en":"Don’t worry, Lallan—we’ll fix it together.","zh":"别担心，Lallan（兄弟/朋友）——我们一起解决。"}]}],"synonyms":["dear (context-dependent)","buddy (context-dependent)","pal (context-dependent)"],"phonetic":"/ləˈlɑn/","extraExplanation":["“Lallan”常被认为源自印地语/地区口语里的亲昵称呼，用来表达疼爱或亲近感；在不同地区、不同关系中，可能更像“宝贝/小家伙”，也可能更像“老弟/哥们”。","它也经常作为人名或外号出现（尤其在北印度语境），因此看到时要结合上下文判断是“称呼”还是“名字”。"]}
{"word":"lalland","summary":{"en":"La La Land means an unrealistic, dreamy state; it can also mean Hollywood/show business, and it’s the title of a well-known 2016 film.","zh":"La La Land 可指不切实际的幻想状态；也可指好莱坞/娱乐圈；同时是2016年电影《爱乐之城》的片名。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a dreamy, unrealistic world; a state of being out of touch with reality (often used humorously or critically)","zh":"不切实际的幻想世界；脱离现实的状态（常带幽默或批评语气）"},"examples":[{"en":"He thinks success will come overnight—he’s living in La La Land.","zh":"他以为成功会一夜到来——他活在幻想里。"},{"en":"Let’s be practical; we can’t make decisions in La La Land.","zh":"咱们务实一点；不能在不切实际的幻想里做决定。"}]},{"partOfSpeech":"phrase","definition":{"en":"the world of Hollywood and the entertainment industry; show business (especially in Los Angeles)","zh":"好莱坞与娱乐圈；演艺圈（尤指洛杉矶）"},"examples":[{"en":"She moved to L.A. hoping to make it in La La Land.","zh":"她搬到洛杉矶，希望在演艺圈闯出名堂。"},{"en":"La La Land can be exciting, but it’s also very competitive.","zh":"娱乐圈很刺激，但也非常竞争激烈。"}]},{"partOfSpeech":"n.","definition":{"en":"a 2016 musical romantic drama film directed by Damien Chazelle, set in Los Angeles","zh":"《爱乐之城》（2016年歌舞爱情剧情片，达米恩·查泽雷执导，故事背景在洛杉矶）"},"examples":[{"en":"La La Land won multiple awards and became widely popular.","zh":"《爱乐之城》获得多项奖项，并广受欢迎。"},{"en":"The soundtrack from La La Land is still played a lot.","zh":"《爱乐之城》的原声带到现在还常被播放。"}]}],"synonyms":["fantasy world","dreamland","out of touch","Hollywood","show business"],"phonetic":"/ˌlɑː lɑː ˈlænd/","extraExplanation":["你输入的“lalland”很可能是“La La Land”的拼写（常写作三个词：La La Land）。在日常口语里，它经常不指电影，而是指“沉浸在不现实的幻想中”。","“La la”本身就常用来模仿哼唱、或表示“不当回事/含糊带过”，因此“La La Land”带有一种轻飘飘、梦幻、不太严肃的语感。"]}
{"word":"lallands","summary":{"en":"La-la land usually means an unrealistic dreamworld or, informally, Los Angeles.","zh":"La-la land 通常指不切实际的“幻想世界”，也可非正式指洛杉矶。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(informal) An imaginary, dreamy, or unrealistic state where someone is not thinking in a practical way.","zh":"（非正式）一种幻想、迷糊或不切实际的状态；人不够清醒、脱离现实。"},"examples":[{"en":"Stop living in la-la land and start planning your budget.","zh":"别再活在幻想里了，开始做预算吧。"},{"en":"He was in la-la land during the meeting and missed the key point.","zh":"他开会时一直走神，错过了重点。"},{"en":"It sounds nice, but that idea belongs in la-la land.","zh":"听起来不错，但那个想法太不现实了。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) A nickname for Los Angeles, especially connected with the entertainment industry.","zh":"（非正式）洛杉矶的绰号，常与娱乐产业（好莱坞）相关。"},"examples":[{"en":"She moved to la-la land to try acting.","zh":"她搬到“拉拉之地”（洛杉矶）想试试当演员。"},{"en":"In la-la land, networking matters a lot.","zh":"在洛杉矶（娱乐圈）人脉很重要。"}]}],"synonyms":["dreamworld","fantasy world","cloud-cuckoo-land","daydream","Los Angeles (informal)"],"phonetic":"/ˈlɑː lɑː lænd/","extraExplanation":["拼写提醒：最常见的写法是 **la-la land** 或 **La-La Land**（有时写作 *lalaland*）。你输入的 **lallands** 可能是拼写错误或不常见的变体。","语感与用法：当表示“脱离现实、在做白日梦”时，这个词组常带一点调侃或批评意味；也可以更轻松地表示“走神”。","文化补充：**La La Land** 也是2016年的一部歌舞电影片名；另外洛杉矶常被称为“la-la land”，与好莱坞的“梦工厂”气质有关。"]}
{"word":"lallans","summary":{"en":"“Lallans” means the Scots language, especially Lowland Scots, often used in literature.","zh":"“Lallans”指苏格兰语（尤指低地方言），常见于文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Scots language (especially the Lowland Scots dialects), sometimes contrasted with Scottish Gaelic.","zh":"（尤指苏格兰低地的）苏格兰语/苏格兰方言（Scots）；常与苏格兰盖尔语相对。"},"examples":[{"en":"Robert Burns wrote many poems in Lallans.","zh":"罗伯特·彭斯的许多诗是用苏格兰方言（Lallans）写的。"},{"en":"Some students learn about Lallans in Scottish literature classes.","zh":"一些学生会在苏格兰文学课上学习苏格兰方言（Lallans）。"}]}],"synonyms":["Scots","Lowland Scots"],"phonetic":"/ˈlælənz/","extraExplanation":["“Lallans”来自苏格兰语（Scots），字面意思接近“低地的（Lowlands）语言”。它常被用作一种带文化认同意味的称呼，尤其在谈到苏格兰文学与诗歌（如Burns）时。","注意区分：Lallans/Scots ≠ Scottish Gaelic（苏格兰盖尔语）。前者与英语更近、历史上在低地广泛使用；后者属于凯尔特语族，主要与高地及岛屿地区相关。"]}
{"word":"lallapalooza","summary":{"en":"“Lallapalooza” is usually a misspelling of “lollapalooza,” meaning something outstanding, and it’s also the name of a major music festival.","zh":"“lallapalooza”通常是“lollapalooza”的误拼，意思是“非常出色/特别震撼的事物”，也指著名的Lollapalooza音乐节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A very impressive or extraordinary person, thing, or event; something outstanding.","zh":"（常见拼写错误）指非常令人惊叹、非同寻常的人、事或活动；极出色的事物。"},"examples":[{"en":"That final goal was a lollapalooza—everyone in the stadium went wild.","zh":"最后那个进球太震撼了——全场都沸腾了。"},{"en":"Her graduation party turned into a real lollapalooza.","zh":"她的毕业派对办得特别盛大、精彩。"}]},{"partOfSpeech":"n.","definition":{"en":"A large music festival called “Lollapalooza,” held in several countries (often used as a proper noun).","zh":"“Lollapalooza”音乐节（在多个国家举办；常作专有名词）。"},"examples":[{"en":"They’re going to Lollapalooza this summer.","zh":"他们今年夏天要去参加Lollapalooza音乐节。"}]}],"synonyms":["blockbuster","showstopper","standout","whopper"],"phonetic":"/ˌlɑləpəˈluːzə/","extraExplanation":["“lallapalooza”通常应写作“lollapalooza”。这个词在美式英语里常表示“特别厉害/特别大阵仗的东西”。","词源上常被认为来自早期美式口语，带有夸张、好玩的语气。后来“Lollapalooza”也成为著名音乐节的名称（起初由Perry Farrell在1991年创办）。"]}
{"word":"lallation","summary":{"en":"Lallation means infant babbling (repeated simple syllables); in older/medical usage, it can also mean replacing “R” with “L.”","zh":"lallation 指婴儿咿呀学语（重复简单音节）；在较旧或医学语境中，也可指把“R”音发成“L”音的发音障碍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Baby-like speech sounds, especially the repetition of simple syllables (like “la-la” or “ba-ba”); infant babbling.","zh":"婴儿式的发音，尤其指重复简单音节（如“la-la”“ba-ba”）；婴儿咿呀学语/牙牙学语。"},"examples":[{"en":"The baby’s lallation filled the room with soft, repetitive sounds.","zh":"宝宝的咿呀学语让房间里充满了轻柔、重复的声音。"},{"en":"Researchers recorded lallation to study early language development.","zh":"研究人员录下婴儿的咿呀学语，用来研究早期语言发展。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine, an inability to pronounce the letter “R,” often replaced by “L” (a type of speech error).","zh":"（医学/语言治疗）一种发音障碍：不能发“R”音，常用“L”音代替（类似把“r”说成“l”）。"},"examples":[{"en":"The clinician noted lallation during the speech assessment.","zh":"临床语言治疗师在言语评估中记录到这种“r音发不出、常被l音代替”的现象。"},{"en":"In some older medical texts, lallation refers to an “R-to-L” substitution.","zh":"在一些较早的医学文献中，lallation 指“R音变成L音”的替代现象。"}]}],"synonyms":["babbling","cooing","baby talk"],"phonetic":"/læˈleɪʃən/","extraExplanation":["词源与提示：lallation 来自拉丁语/拟声词根（像 “la-la” 这种重复音），因此常用于描述婴儿阶段的“重复音节”发声。","用法注意：现代日常英语里这个词不常见，更常见的说法是 babbling（婴儿咿呀学语）或 baby talk（儿语/娃娃腔）。医学上的第二个义项更偏旧式或专业语境。"]}
{"word":"lalled","summary":{"en":"**lalled** is an uncommon, poetic past tense of **lall**, meaning to hum “la-la” softly or (rarely) to babble like a baby.","zh":"**lalled** 是较少见、偏诗意的 **lall** 过去式，可指轻声“啦啦”哼唱，也可（较少见）指像婴儿一样咿呀学语。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of **lall**) to sing or hum softly using “la-la” sounds; to croon in a simple, soothing way (often poetic/old-fashioned).","zh":"（**lall** 的过去式/过去分词）用“啦啦”之类的音轻声哼唱；用简单、柔和的声音吟唱（多为诗歌/较古旧用法）。"},"examples":[{"en":"She **lalled** a little tune to calm the child.","zh":"她轻轻地用“啦啦”的声音哼着小调来安抚孩子。"},{"en":"In the old poem, the shepherd **lalled** while watching the sheep.","zh":"在那首古老的诗里，牧羊人看着羊群时轻声吟唱。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of **lall**) to speak in an unclear, baby-like way; to babble (rare/old-fashioned).","zh":"（**lall** 的过去式/过去分词）含糊不清、像婴儿一样咿呀学语；胡言乱语（较少见/较古旧）。"},"examples":[{"en":"The toddler **lalled** happily before forming real words.","zh":"幼儿在说出真正的词之前，开心地咿呀学语。"}]}],"synonyms":["hummed","crooned","sang softly","babble","cooed"],"phonetic":"/lɑld/","extraExplanation":["“lall”比较少见，常见于诗歌或带有古风的叙述中，用来描写轻柔的哼唱或婴儿学语。现代英语里更常用的近义表达有：hum（哼歌）、croon（低声吟唱）、babble（咿呀/胡言乱语）。","容易和 **lulled**（lull 的过去式，意为“使平静/使入睡”）混淆：如果你想表达“被安抚到快睡着”，更常用 **lulled**。"]}
{"word":"lalling","summary":{"en":"“Lalling” means soft, gentle singing or murmuring, often in poetic descriptions (birds, babies, or nature sounds).","zh":"“lalling”指轻柔的歌唱或呢喃，多用于诗意描写（如鸟鸣、婴儿咿呀、自然声）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"sing or speak in a soft, light, often joyful way (often used in poetry, like birdsong or a child’s voice)","zh":"（常见于诗歌）轻柔地歌唱或说话；咿呀轻语（常形容鸟鸣或孩子的声音）"},"examples":[{"en":"In the garden, a bird was lalling at dawn.","zh":"清晨，花园里有只鸟在轻声啭唱。"},{"en":"The baby lay in the crib, lalling to herself.","zh":"宝宝躺在婴儿床里，自顾自地咿呀轻语。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of lalling; soft singing or murmuring","zh":"轻声歌唱/呢喃的行为或声音"},"examples":[{"en":"The lalling of the stream made the room feel calm.","zh":"溪水的轻声潺潺让房间显得很安静。"}]}],"synonyms":["warbling","murmuring","babbling","trilling"],"phonetic":"/ˈlælɪŋ/","extraExplanation":["“lalling”是动词“lall”的现在分词/动名词形式，在现代英语中比较少见，更多出现在文学、诗歌或想营造柔和意境的描写里。","它常用来模仿或描写“轻而连贯的声音”，比如鸟鸣、流水声、婴儿咿呀学语；语感比常见的“sing/whisper”更带画面感、更诗意。"]}
{"word":"lalls","summary":{"en":"“lalls” is an uncommon verb form meaning “babble or sing softly,” often used in poetic or old-fashioned contexts.","zh":"“lalls”是较少见的动词形式，表示“咿呀学语或轻声哼唱”，常见于诗歌或较古典的语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “lall”) to sing or speak in a soft, gentle, often childlike way; to babble.","zh":"（“lall”的第三人称单数）以轻柔、带童稚感的方式哼唱或说话；咿呀学语、含糊地说。"},"examples":[{"en":"The baby lalls happily in the crib.","zh":"宝宝在婴儿床里开心地咿呀学语。"},{"en":"In the old poem, the shepherd lalls a simple tune.","zh":"在那首古诗里，牧羊人轻声哼着简单的曲调。"}]}],"synonyms":["babble","murmur","hum","croon"],"phonetic":"/læl/","extraExplanation":["“lall / lalls”在现代英语里很少用，常见于诗歌、古体写作或描写婴儿咿呀学语的语境。日常口语中更常用 baby babble（婴儿咿呀）、murmur（低语）、hum（哼唱）等。","如果你本来想输入的是 laughs（笑）、lulls（使平静/催眠）、calls（打电话/呼唤），告诉我上下文句子，我可以帮你确认正确拼写和用法。"]}
{"word":"lally","summary":{"en":"“Lally” is mainly a name; it also appears in “Lally column,” meaning a steel support post in construction.","zh":"“Lally”主要是人名/姓氏；也常见于 “Lally column”，指建筑用钢支撑柱。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) and sometimes a given name.","zh":"姓氏（也可作名字）。"},"examples":[{"en":"My professor’s last name is Lally.","zh":"我教授的姓是 Lally。"},{"en":"Lally is an Irish surname found in several English-speaking countries.","zh":"Lally 是一个爱尔兰姓氏，在多个英语国家都能见到。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in the phrase “Lally column”: a steel support post used in construction, often filled with concrete.","zh":"用于短语 “Lally column”：建筑中使用的钢制支撑柱，常灌入混凝土。"},"examples":[{"en":"The contractor added a Lally column to support the beam in the basement.","zh":"承包商在地下室加了一根 Lally column 来支撑横梁。"},{"en":"Don’t remove that Lally column—it may be holding up the floor.","zh":"别拆那根 Lally column——它可能在支撑地板。"}]}],"synonyms":["(name)","(Lally column) support post","steel column"],"phonetic":"/ˈlæli/","extraExplanation":["“Lally”单独作为普通词在现代英语里并不常见；你更常会在专有名词（人名/姓氏）或固定搭配 “Lally column” 中看到。","“Lally column” 这一说法属于北美建筑语境，来自早期相关产品/制造商的名称，后来变成通用叫法。"]}
{"word":"lallygag","summary":{"en":"“Lallygag” means to waste time or move too slowly, often in a mildly teasing or scolding way.","zh":"“lallygag”指磨蹭、浪费时间或慢吞吞地行动，常带轻微调侃或责备语气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to waste time; to move, work, or act too slowly when you should be doing something","zh":"磨蹭；拖拖拉拉；浪费时间（该做事却行动太慢）"},"examples":[{"en":"Stop lallygagging and get to class.","zh":"别再磨蹭了，快去上课。"},{"en":"We lallygagged after lunch and missed the start of the movie.","zh":"我们午饭后拖拖拉拉，错过了电影开场。"}]},{"partOfSpeech":"v.","definition":{"en":"to hang around in a lazy or aimless way; to loiter","zh":"闲逛；漫无目的地晃悠"},"examples":[{"en":"They were lallygagging around the mall with nothing to do.","zh":"他们在商场里闲逛，也没什么事做。"}]}],"synonyms":["dawdle","lollygag","dillydally","loaf","drag one's feet"],"phonetic":"/ˈlæliˌɡæɡ/","extraExplanation":["“lallygag”比较口语、带点幽默或轻微责备的语气，常用于家长、老师或上司催人快点行动。","词源不完全确定，但一般认为来自19世纪的美式口语，和“lollygag”是同义的拼写变体。"]}
{"word":"lallygagged","summary":{"en":"“Lallygagged” means you wasted time or dawdled (often by hanging around).","zh":"“lallygagged”表示你在磨蹭、浪费时间（也常指闲逛）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) Wasted time; dawdled instead of doing what you should have done.","zh":"（非正式）磨蹭、浪费时间；该做正事却拖拖拉拉。"},"examples":[{"en":"We lallygagged at the mall and missed the bus.","zh":"我们在商场磨蹭，结果错过了公交车。"},{"en":"If you lallygagged this morning, you’ll need to hurry now.","zh":"如果你今天早上一直拖拖拉拉，那你现在就得赶紧了。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) Spent time in a lazy, aimless way (often + around).","zh":"（非正式）闲逛、无所事事地耗时间（常与 around 连用）。"},"examples":[{"en":"They lallygagged around the park after lunch.","zh":"午饭后他们在公园里闲逛。"},{"en":"Stop lallygagging around and start your homework.","zh":"别再闲逛磨蹭了，开始写作业。"}]}],"synonyms":["dawdled","procrastinated","loafed","lingered","wasted time"],"phonetic":"/ˈlɑliˌɡæɡd/","extraExplanation":["“lallygagged”是动词“lallygag”的过去式/过去分词，更常见的拼写是“lollygagged / lollygag”。这种词带一点开玩笑或责备的语气，常用于口语。","常见搭配：lallygag around（闲逛磨蹭）；don’t lallygag（别磨蹭）。"]}
{"word":"lallygagging","summary":{"en":"Lallygagging means wasting time or dawdling instead of doing something promptly.","zh":"lallygagging 指磨磨蹭蹭、浪费时间，事情该快做却拖拖拉拉。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"wasting time; moving or acting too slowly; dawdling instead of doing what you should be doing","zh":"磨磨蹭蹭；浪费时间；该做事却拖拖拉拉"},"examples":[{"en":"Stop lallygagging and get to work.","zh":"别再磨蹭了，赶紧干活。"},{"en":"We missed the bus because we were lallygagging in the store.","zh":"我们在店里磨蹭，结果错过了公交车。"},{"en":"If you keep lallygagging, you’ll be late for class.","zh":"你再拖拖拉拉，上课就要迟到了。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of wasting time; unnecessary delay","zh":"磨蹭（的行为/习惯）；无谓的拖延"},"examples":[{"en":"There’s no time for lallygagging—we need to leave now.","zh":"没时间磨蹭了——我们得马上走。"},{"en":"The coach got angry at the team’s lallygagging during practice.","zh":"教练对队员训练时的磨蹭很生气。"}]}],"synonyms":["dawdling","wasting time","procrastinating","loafing","dragging one’s feet"],"phonetic":"/ˈlæliˌɡæɡɪŋ/","extraExplanation":["“lallygagging”常见于口语和轻松语境，带一点责备或催促的语气。更常见的拼写是“lollygagging / lollygagging”，意思相同。","这个词在美式英语里比较常听，常用来对孩子、同事或朋友说“别磨蹭了”。正式写作里可换成“dawdling / procrastinating / wasting time”。"]}
{"word":"lallygags","summary":{"en":"“Lallygags” means wastes time or moves too slowly instead of doing what should be done.","zh":"“lallygags”表示浪费时间、磨蹭拖拉，不赶紧做该做的事。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to waste time; to dawdle or do something slowly instead of getting on with what you should do","zh":"浪费时间；磨蹭；拖拖拉拉不赶紧做该做的事"},"examples":[{"en":"Stop lallygagging—we’re going to be late.","zh":"别再磨蹭了——我们要迟到了。"},{"en":"They lallygagged in the hallway and missed the start of the meeting.","zh":"他们在走廊里磨磨蹭蹭，错过了会议开始。"},{"en":"If you lallygag all morning, you’ll have to rush in the afternoon.","zh":"如果你一上午都拖拖拉拉，下午就得赶工。"}]}],"synonyms":["dawdle","loiter","drag one’s feet","waste time","procrastinate"],"phonetic":"ˈlæliˌɡæɡ","extraExplanation":["“lallygags”通常是动词 lallygag 的第三人称单数（He/She lallygags）或名词复数较少见的用法。更常见的拼写也有 lollygag，两者意思相同。","这个词语气比较口语、带一点责备或催促的感觉，常用于家长、老师、上司让人“快点”的场景。"]}
{"word":"lalo","summary":{"en":"“Lalo” is commonly used to mean “especially/particularly” (from Tagalog), and it can also be a male name or nickname.","zh":"“lalo”常用来表示“尤其/特别”（多见于他加禄语等菲律宾语言），也可以作为男性人名或昵称。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"especially; particularly (used to emphasize that something is more true or important in one case than in others).","zh":"尤其；特别（用于强调某种情况更明显、更重要）。"},"examples":[{"en":"I’m busy today, lalo na on weekdays.","zh":"我今天很忙，尤其是工作日。"},{"en":"This rule matters, lalo na for beginners.","zh":"这条规则很重要，尤其对初学者。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name/nickname (often used for men; sometimes a nickname for “Eduardo”).","zh":"人名/昵称（常用于男性；有时是 “Eduardo（爱德华多）” 的昵称）。"},"examples":[{"en":"Lalo will call you back later.","zh":"Lalo 稍后会回你电话。"},{"en":"His friends call him Lalo.","zh":"他的朋友们叫他 Lalo。"}]}],"synonyms":["especially","particularly","notably","even more"],"phonetic":"/ˈlɑˌloʊ/","extraExplanation":["“lalo”最常见于菲律宾语言（他加禄语 Tagalog）里，意思是“尤其/特别”，常见搭配是“lalo na + 名词/短语”，相当于英文的“especially/particularly”。","在西班牙语文化里，Lalo 也常作为男性昵称（例如 Eduardo 的昵称）。在英语语境中看到 “Lalo”，有时只是一个人名（如影视角色名）。"]}
{"word":"laloneurosis","summary":{"en":"A rare term meaning a speech-related neurosis (often referring to stuttering).","zh":"一个罕见术语，指与言语相关的神经症（常指口吃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, medical) A neurotic disorder that affects speech—especially a speech neurosis such as stuttering; sometimes used as a variant of “logoneurosis.”","zh":"（罕见，医学）影响言语的神经症；尤指言语神经症（如口吃）。有时被当作“logoneurosis（言语神经症/口吃）”的变体用法。"},"examples":[{"en":"Some older medical writings used “laloneurosis” to describe speech problems linked to anxiety or nervous tension.","zh":"一些较早的医学文献用“laloneurosis”来指与焦虑或紧张相关的言语问题。"},{"en":"Today, clinicians are more likely to describe the condition as stuttering or a fluency disorder rather than using the term “laloneurosis.”","zh":"如今，临床上更常说“stuttering（口吃）”或“fluency disorder（流利度障碍）”，而不是用“laloneurosis”。"}]}],"synonyms":["logoneurosis","stuttering","fluency disorder","speech disorder"],"phonetic":"/ˌlæloʊn(j)ʊˈroʊsɪs/","extraExplanation":["这个词在现代英语中非常少见，很多词典里也未必收录；如果你是在医学/语言病理学语境中遇到它，通常可理解为“言语相关的神经性障碍”。","词根提示：lalo- 常与“言语/说话”有关（类似 lalia），-neurosis 表示“神经症”。因此字面上可理解为“言语神经症”。","如果你想查更常用、也更标准的说法，可以对照：stuttering（口吃）、speech/fluency disorder（言语/流利度障碍）、logoneurosis（较旧的术语）。"]}
{"word":"lalopathies","summary":{"en":"“Lalopathies” means speech-related disorders or pathological conditions affecting speaking (plural of “lalopathy”).","zh":"“Lalopathies”指与说话有关的障碍/病变，是“lalopathy”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) medical or clinical conditions that affect speech—especially unusual, disordered, or impaired speaking.","zh":"（复数）影响言语/说话能力的医学或临床问题，尤指异常、紊乱或受损的说话。"},"examples":[{"en":"Some older medical texts group various speech disorders under “lalopathies.”","zh":"一些较早的医学文献会把多种言语障碍归在“lalopathies（言语病变/言语障碍）”这一类。"},{"en":"The report mentioned lalopathies alongside hearing and language difficulties.","zh":"报告在提到听力和语言困难时，也提到了“lalopathies”。"}]}],"synonyms":["speech disorders","speech impairments","articulation disorders","speech pathologies"],"phonetic":"/ləˈlɑːpəθiz/","extraExplanation":["“lalopathies”是名词复数，单数是“lalopathy”。它属于比较少见、偏学术/医学的用词。","词根来自希腊语：lalo-（说话、言语）+ -pathy（疾病、病变）。因此它的字面意思是“与说话有关的病变/障碍”。","在现代英语里，更常见、更具体的说法包括：speech disorder(s)、speech impairment、articulation disorder、dysarthria（构音障碍）等。实际写作中通常会用这些更标准的术语。"]}
{"word":"lalopathy","summary":{"en":"Lalopathy is a rare term meaning a disorder or abnormality of speech.","zh":"lalopathy 是一个罕见词，指言语（说话/发音）方面的障碍或异常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, medical) A speech disorder or defect; an abnormality of speech.","zh":"（罕见，医学）言语障碍；发音或说话异常。"},"examples":[{"en":"The report noted possible lalopathy after the stroke.","zh":"报告指出中风后可能出现言语障碍。"},{"en":"A specialist evaluated the child for hearing issues and lalopathy.","zh":"专家评估孩子是否有听力问题和言语障碍。"}]}],"synonyms":["speech disorder","speech impairment","speech pathology"],"phonetic":"/ˌlæləˈpæθi/","extraExplanation":["这个词很少在日常英语中使用，更常见的说法是 speech disorder / speech impairment，或更具体的 stuttering（口吃）、dysarthria（构音障碍）、aphasia（失语症）等。","词源上可理解为：lalo-（与“说话/言语”有关，来自希腊语根 lalia）+ -pathy（疾病/病变）。"]}
{"word":"lalophobia","summary":{"en":"Lalophobia means an intense fear of speaking or talking, often in social or public situations.","zh":"Lalophobia 指对说话/开口表达的强烈恐惧，常见于社交或公众场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of speaking or talking, especially in public or in front of others (a type of social anxiety).","zh":"对说话或开口表达的强烈恐惧，尤其是在公众面前或他人面前（可与社交焦虑相关）。"},"examples":[{"en":"She has lalophobia, so presentations at work feel overwhelming.","zh":"她有开口恐惧症，所以在工作中做展示会让她觉得难以承受。"},{"en":"Because of his lalophobia, he prefers to communicate by email instead of phone calls.","zh":"因为他害怕开口说话，他更喜欢用电子邮件而不是打电话沟通。"},{"en":"Therapy and gradual practice can help people manage lalophobia.","zh":"心理治疗和循序渐进的练习可以帮助人们缓解开口恐惧症。"}]}],"synonyms":["fear of speaking","speech anxiety","glossophobia (fear of public speaking)","social anxiety (related)"],"phonetic":"/ˌlæləˈfoʊbiə/","extraExplanation":["词源：来自希腊语 lalia（“说话、言语”）+ -phobia（“恐惧”）。因此它字面意思就是“对说话的恐惧”。","使用场景：这个词在日常口语中不算常见，更常见的表达有“fear of public speaking（害怕公开演讲）”“speech anxiety（言语焦虑）”或“social anxiety（社交焦虑）”。不过当你想强调“害怕开口”本身时，lalophobia 很贴切。","学习提示：不要把它和“stutter（口吃）”混淆。口吃是言语流畅度的问题；lalophobia 是情绪/心理层面的恐惧，可能导致回避说话。"]}
{"word":"laloplegia","summary":{"en":"Laloplegia is a medical term meaning paralysis of the speech muscles, leading to loss or severe difficulty of speaking.","zh":"laloplegia 是医学术语，指发音相关肌肉的麻痹，导致不能说话或说话严重困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) paralysis affecting the muscles used for speech, causing loss or severe impairment of the ability to speak.","zh":"（医学）言语麻痹；支配发音的肌肉发生麻痹，导致不能说话或说话严重困难。"},"examples":[{"en":"After the stroke, the patient developed laloplegia and could only communicate by writing.","zh":"中风后，患者出现言语麻痹，只能通过书写交流。"},{"en":"The neurologist tested facial and tongue movement to see whether laloplegia was present.","zh":"神经科医生检查面部和舌头的运动，以判断是否存在言语麻痹。"}]}],"synonyms":["speech paralysis","anarthria","dysarthria"],"phonetic":"/ˌlæloʊˈpliːdʒə/","extraExplanation":["词源来自希腊语：lalo-（说话、言语）+ -plegia（麻痹）。常见于较旧或较少使用的医学词汇中。","在现代临床语境里，医生更常用更具体的术语来描述：例如 dysarthria（构音障碍：说话含糊、发音不清）、anarthria（完全不能清晰发音）、或 aphasia（失语症：语言理解/表达的脑功能障碍，未必是肌肉麻痹）。"]}

