{"word":"lap","summary":{"en":"Lap most commonly means the part of your legs when you sit, or one round of a race; it can also mean to complete a lap, to overtake by a full lap, or to overlap materials.","zh":"lap 最常见指“膝上/腿上”，也指比赛的“一圈”；还可作动词表示“跑/游一圈”、比赛中“套圈”，或制作/施工中“搭接重叠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The top part of your legs when you are sitting (the area from your waist to your knees).","zh":"（坐着时）大腿上部到膝盖之间的部位；膝上。"},"examples":[{"en":"The child sat on her mom’s lap.","zh":"孩子坐在妈妈的膝上。"},{"en":"He put the laptop on his lap while watching a movie.","zh":"他看电影时把笔记本电脑放在膝上。"}]},{"partOfSpeech":"n.","definition":{"en":"One part of a race that is made up of several repeated lengths (especially in running, swimming, or car racing).","zh":"（比赛的）一圈；一段赛程（尤指跑步、游泳、赛车等）。"},"examples":[{"en":"She ran four laps around the track.","zh":"她绕跑道跑了四圈。"},{"en":"The driver led for the final lap.","zh":"这位车手在最后一圈领跑。"}]},{"partOfSpeech":"v.","definition":{"en":"To pass or go around a track or course; to complete a lap.","zh":"（在赛道上）跑/游/行进一圈；完成一圈。"},"examples":[{"en":"They lapped the pool ten times.","zh":"他们在泳池里游了十圈。"}]},{"partOfSpeech":"vt.","definition":{"en":"To catch up with and pass someone who is slower (especially in racing), so that you are one lap ahead.","zh":"（比赛中）追上一圈并超过（对手）；套圈。"},"examples":[{"en":"The champion lapped most of the field.","zh":"冠军把大多数选手都套圈了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover one thing partly over another (to overlap), often used in building or making things.","zh":"（将材料）搭接、叠盖（使部分重叠），常用于建筑或制作。"},"examples":[{"en":"Lap the edges slightly to prevent water from getting in.","zh":"把边缘稍微搭接，以防进水。"}]}],"synonyms":["circuit","round","overlap","overtake"],"phonetic":"/læp/","extraExplanation":["常见搭配：sit on someone’s lap（坐在某人腿上/膝上）；in someone’s lap（在某人腿上）；take a lap（跑/游一圈，口语也可指“绕一圈走走”）；lap time（单圈用时）。","“lap”=“圈”多见于运动与赛车语境；而“lap”=“搭接/叠盖”多见于木工、屋顶施工（例如屋瓦、金属板的重叠）。注意语境不同，含义差别很大。"]}
{"word":"lapacho","summary":{"en":"Lapacho most commonly refers to a South American trumpet-flowered tree (often the pink trumpet tree) or the inner bark used to make an herbal tea.","zh":"Lapacho 通常指一种南美的喇叭状花树（常为粉红风铃木/粉红喇叭树），也可指其内树皮制成的草本茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South American tree with showy trumpet-shaped flowers (often the pink trumpet tree), or the dried inner bark used to make an herbal tea/medicine","zh":"一种南美洲的树（常指开喇叭状花的“粉红风铃木/粉红喇叭树”），也可指其干燥内树皮，用来泡草本茶或作民间药用"},"examples":[{"en":"The lapacho trees bloom in bright pink in early spring.","zh":"早春时，lapacho（风铃木/喇叭树）会开出鲜艳的粉红花。"},{"en":"Some people drink lapacho tea, made from the inner bark, as a herbal remedy.","zh":"有些人会喝用内树皮泡的 lapacho 茶，把它当作草本调理饮品。"}]}],"synonyms":["pau d’arco","taheebo","pink trumpet tree"],"phonetic":"/ləˈpɑːtʃoʊ/","extraExplanation":["“Lapacho”多见于拉美语境，源自西班牙语用法；在英语中常与“pau d’arco（泡达科）/taheebo（塔希波）”并用，指同类树木的内树皮制品或相关茶饮。","作为植物名时，常指风铃木属（Handroanthus/Tabebuia）的一些树种，城市行道树很常见；作为茶/草本产品时，更多强调“内树皮（inner bark）”。","草本产品相关功效在不同文化中说法很多，但英文写作中较稳妥的表达是“herbal tea/remedy（草本茶/民间调理）”，避免直接断言医疗效果。"]}
{"word":"lapachol","summary":{"en":"Lapachol is a natural naphthoquinone compound from the lapacho (taheebo) tree, mainly discussed in scientific research.","zh":"拉帕醇是一种来自拉帕乔树（塔希波树）的天然萘醌类化合物，主要用于科研讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical compound (a naphthoquinone) found especially in the lapacho/taheebo tree; it has been studied for possible biological and medical effects.","zh":"拉帕醇（lapachol）：一种天然化合物（萘醌类），主要存在于拉帕乔树/塔希波树（lapacho/taheebo）中；因可能的生物与医学作用而被研究。"},"examples":[{"en":"Researchers extracted lapachol from lapacho wood to test its activity in the lab.","zh":"研究人员从拉帕乔木材中提取拉帕醇，并在实验室里测试其活性。"},{"en":"Lapachol is a naphthoquinone compound, so it is often discussed in studies of plant-based quinones.","zh":"拉帕醇属于萘醌类化合物，因此常出现在关于植物来源醌类的研究中。"}]}],"synonyms":["naphthoquinone compound (general category)"],"phonetic":"/ˈlæpəˌtʃoʊl/","extraExplanation":["“Lapachol”这个词来自 lapacho（拉帕乔树）+ 化学命名后缀 -ol。它是从南美一些树种的木材或树皮中分离出的成分之一。","日常语境中更多出现在学术论文、药理研究或天然产物化学里；它并不是常见的日常英语词汇。","与保健品相关内容中可能会提到 lapacho/taheebo 茶或树皮制品；需要注意“传统使用/体外研究”不等同于“临床证实有效或安全”。如涉及健康用途，应以正规医疗建议为准。"]}
{"word":"lapactic","summary":{"en":"“Lapactic” is not a recognized English word; it’s probably a misspelling (often of “lactic” or “laparoscopic”).","zh":"“lapactic” 不是规范英语词汇，通常是拼写错误（常见可能是 “lactic” 或 “laparoscopic”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of another word (for example, “lactic” or “laparoscopic”).","zh":"不是标准英语单词，可能是其他单词的拼写错误（例如 “lactic” 或 “laparoscopic”）。"},"examples":[{"en":"I can’t find “lapactic” in a dictionary—did you mean “lactic”?","zh":"我在词典里找不到 “lapactic”——你是不是想写 “lactic”？"},{"en":"If you’re talking about a type of surgery, you might mean “laparoscopic.”","zh":"如果你在说一种手术方式，你可能想表达的是 “laparoscopic（腹腔镜的）”。"}]}],"phonetic":"/læˈpæktɪk/","extraExplanation":["“lactic” 常见于运动与生理语境，意思是“乳酸的”，如 lactic acid（乳酸）。发音：/ˈlæktɪk/。","“laparoscopic” 常见于医学语境，意思是“腹腔镜的”。发音：/ˌlæpəroʊˈskɑpɪk/。","如果你告诉我它出现的句子或领域（运动/医学/其他），我可以更准确判断你想要的词。"]}
{"word":"Lapageria","summary":{"en":"a Chilean climbing plant with showy bell-shaped flowers; also the genus name (notably the copihue).","zh":"智利产的观赏攀缘植物，开醒目的钟形花；也是该类植物的属名（代表为科皮韦花）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a climbing plant from Chile with large, bell-shaped flowers; the genus name of the Chilean bellflower (often grown as an ornamental vine).","zh":"智利的一种攀缘开花植物属名；花大呈钟形，常作观赏藤本栽培（智利钟花/智利铃花属）。"},"examples":[{"en":"Lapageria is prized in gardens for its long-lasting, bell-shaped blooms.","zh":"这种植物在花园里很受珍视，因为它的钟形花朵开得久。"},{"en":"In a greenhouse, Lapageria can climb a trellis if given enough humidity and shade.","zh":"在温室里，只要湿度和遮阴足够，它就能沿着棚架攀爬生长。"}]},{"partOfSpeech":"n.","definition":{"en":"Lapageria rosea, the best-known species in this genus, also called the copihue; it is widely recognized as a national symbol of Chile.","zh":"该属最著名的物种 Lapageria rosea（常称 copihue/科皮韦花）；在智利被广泛视为国家象征之一。"},"examples":[{"en":"The copihue (Lapageria rosea) is often featured in Chilean imagery and celebrations.","zh":"科皮韦花（Lapageria rosea）常出现在智利的图像与庆典中。"}]}],"synonyms":["Chilean bellflower","copihue"],"phonetic":"ˌlæpəˈdʒɪriə","extraExplanation":["在智利文化中，copihue（Lapageria rosea）常被称为“智利国花/国家象征花”之一，常见颜色为红色，也有粉色、白色等园艺品种。","作为词汇，它多用于植物学、园艺与自然写作语境；常与“vine（藤本）”“bell-shaped flowers（钟形花）”“ornamental（观赏）”等搭配。"],"etymology":"源自植物学命名：为纪念法兰西第一帝国皇后约瑟芬（Joséphine de Beauharnais），其家族名“de la Pagerie”被用来构成属名。","mnemonic":["把它拆成“la + pager + ia”，联想到“Pagerie（帕热里）”这个人名来源：属名就是纪念“de la Pagerie”。","记“lap-”开头像“攀爬(lap→climb 记忆联想)”：这种植物是会爬的观赏藤本。"]}
{"word":"lapageria","summary":{"en":"Lapageria is a botanical name, best known for the Chilean bellflower (Lapageria rosea).","zh":"Lapageria 是植物学名称，最知名的是智利铃花（Lapageria rosea）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants; especially the Chilean bellflower (Lapageria rosea), a climbing plant with large bell-shaped flowers.","zh":"一种开花植物属；尤指智利铃花（Lapageria rosea，常见为蔓性植物，开大型钟形花）。"},"examples":[{"en":"Lapageria rosea is famous for its waxy, bell-shaped blossoms.","zh":"智利铃花（Lapageria rosea）以其蜡质感、钟形花朵而闻名。"},{"en":"The greenhouse grows lapageria alongside other climbing ornamentals.","zh":"温室里把智利铃花和其他攀援观赏植物一起栽培。"}]}],"synonyms":["Chilean bellflower","Lapageria rosea"],"phonetic":"/ˌlæpəˈdʒɪriə/","extraExplanation":["“Lapageria”多用于植物学/园艺语境，属于专有名词；在日常英语里不算常用词，更常见的说法是直接用完整学名“Lapageria rosea”或俗名“Chilean bellflower（智利铃花）”。","该属名来自人名（常见说法与法国皇室人物相关），属于典型的拉丁化学名命名方式；因此拼写和大小写在正式写法中很重要：属名首字母通常大写（Lapageria）。","如果你输入的“lapageria”是某个店名/地名/用户名，也可能不是这个植物学词；你可以给我一句上下文，我可以帮你判断具体指什么。"]}
{"word":"laparectomy","summary":{"en":"“Laparectomy” is rare/nonstandard; it’s usually a mistaken or improvised form. People often mean “laparotomy” or a specific “-ectomy” (organ removal).","zh":"“Laparectomy”较少见且不规范，常见于误写或临时造词；很多情况下其实想写“laparotomy（开腹术）”或某个具体器官的“-ectomy（切除术）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (rare or nonstandard) medical term formed to mean the surgical removal (excision) of tissue related to the abdomen; in practice, people often intend a different, standard term such as “laparotomy” (opening the abdomen) or a specific “-ectomy” (removal of a particular organ).","zh":"一个（较少见或不规范的）医学构词，字面可理解为“对腹部相关组织进行切除的手术”；但实际使用中，人们更常想表达的是标准术语，如“laparotomy（剖腹探查/开腹术）”或某个具体器官的“-ectomy（切除术）”。"},"examples":[{"en":"The note says “laparectomy,” but the surgeon likely meant laparotomy, because no organ removal was described.","zh":"病历写了“laparectomy”，但因为没有描述器官切除，外科医生很可能想写的是“laparotomy（开腹术）”。"},{"en":"If an organ is removed, the record usually names the organ, such as appendectomy or hysterectomy.","zh":"如果是切除器官，记录通常会写明器官名称，比如 appendectomy（阑尾切除术）或 hysterectomy（子宫切除术）。"}]}],"synonyms":["laparotomy (often intended)","abdominal surgery (general term)"],"phonetic":"/ˌlæpəˈrɛktəmi/","extraExplanation":["“laparectomy”不算常见的标准医学英语。它看起来像由 lapar-（腹部）+ -ectomy（切除）拼成的“造词”。临床记录里更常见的是：laparotomy（开腹/剖腹探查，强调‘切开’进入腹腔）以及以具体器官命名的 -ectomy（如 cholecystectomy 胆囊切除）。","如果你是在报告/病历/检查单上看到这个词，建议对照上下文：是否只是“开腹探查（laparotomy）”，还是确实有器官被切除（应出现明确的器官名称）。必要时可向出具方核对拼写与手术名称。"]}
{"word":"laparo","summary":{"en":"“laparo- / laparo” is a medical form referring to the abdomen, common in words about abdominal surgery.","zh":"“laparo- / laparo”是医学构词成分，表示与腹部相关，常见于腹部手术术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a medical combining form meaning “abdomen” or “abdominal wall,” used in words about abdominal surgery (often shortened in clinical speech, e.g., “laparo appy” = laparoscopic appendectomy).","zh":"医学构词成分，表示“腹部 / 腹壁”，常用于与腹部手术相关的词中（在临床口语里也常被简略说成“laparo…”，例如“laparo appy”指腹腔镜阑尾切除术）。"},"examples":[{"en":"The patient is scheduled for a laparoscopic procedure; the note says “laparo chole.”","zh":"病人安排做腹腔镜手术；病历上写着“laparo chole”（腹腔镜胆囊切除）。"},{"en":"In some hospitals, staff casually say “laparo” to refer to laparoscopy-related cases.","zh":"在一些医院里，工作人员会口语化地用“laparo”来泛指与腹腔镜相关的病例。"}]}],"synonyms":["abdomino-","celio-"],"phonetic":"/ˈlæpəroʊ/","extraExplanation":["“laparo-”来自希腊语词根，和“腹部/侧腹”相关。它常出现在：\n- laparoscopy（腹腔镜检查/手术）\n- laparotomy（剖腹手术）\n学习时可把它当作“看到 laparo- 就想到腹部相关”。"]}
{"word":"laparocele","summary":{"en":"Laparocele is a medical term for an abdominal (ventral) hernia.","zh":"Laparocele 是指腹疝（腹壁疝）的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hernia (protrusion of tissue) through the abdominal wall; a type of abdominal hernia.","zh":"腹疝；指组织通过腹壁薄弱处向外突出的一种疝（腹部疝）。"},"examples":[{"en":"After the surgery, the doctor examined him for signs of a laparocele.","zh":"手术后，医生检查他是否出现腹疝的迹象。"},{"en":"Heavy lifting can increase the risk of developing a laparocele.","zh":"搬抬重物可能会增加发生腹疝的风险。"}]}],"synonyms":["ventral hernia","abdominal hernia"],"phonetic":"ˌlæpərəˈsiːl","extraExplanation":["词源上可拆解为 laparo-（腹、腹部）+ -cele（疝、肿块突出），常见于医学术语中。","在现代临床英语里，更常用的对应说法是 “ventral hernia（腹壁疝）” 或更具体的 “incisional hernia（切口疝）”；“laparocele”较偏书面、较少在日常医患交流中使用。"]}
{"word":"laparocholecystotomy","summary":{"en":"Laparocholecystotomy is a surgery that opens the gallbladder through the abdominal wall.","zh":"laparocholecystotomy 指经腹壁切开并打开胆囊的外科手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the gallbladder is opened (an incision is made) through the abdominal wall, usually to remove stones, drain infected bile, or relieve obstruction","zh":"一种外科手术：经腹壁切开并打开胆囊，常用于取出胆结石、引流感染胆汁或缓解阻塞"},"examples":[{"en":"The surgeon performed a laparocholecystotomy to remove a large gallstone.","zh":"外科医生做了经腹胆囊切开术来取出一枚较大的胆结石。"},{"en":"Because of severe infection, the team chose laparocholecystotomy for drainage.","zh":"由于感染严重，医疗团队选择经腹胆囊切开术进行引流。"}]}],"synonyms":["cholecystotomy","open cholecystotomy"],"phonetic":"/ˌlæpəroʊkoʊˌlɛsɪˈstɑːtəmi/","extraExplanation":["这是一个典型的医学复合词：laparo-（腹部/腹壁）+ cholecysto-（胆囊）+ -tomy（切开）。字面意思就是“从腹部进入，把胆囊切开”。","临床上更常见、口语化的说法可能是 cholecystotomy（胆囊切开术）或 open cholecystotomy（开放性胆囊切开术）；而 cholecystectomy 指的是“切除胆囊”，意义不同。"]}
{"word":"laparocolectomy","summary":{"en":"A minimally invasive (laparoscopic) surgery to remove part or all of the colon.","zh":"用腹腔镜微创方式切除部分或全部结肠（大肠）的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove part or all of the colon (large intestine) using laparoscopic (“keyhole”) techniques","zh":"一种用腹腔镜（微创“钥匙孔”）方式切除部分或全部结肠（大肠）的手术"},"examples":[{"en":"The doctor recommended a laparocolectomy to remove the cancerous section of the colon.","zh":"医生建议做腹腔镜结肠切除术，以切除结肠里有癌变的那一段。"},{"en":"After a laparocolectomy, patients often start walking the same day to reduce complications.","zh":"做完腹腔镜结肠切除术后，病人通常当天就会开始下床走动，以减少并发症。"}]}],"synonyms":["laparoscopic colectomy","colectomy (laparoscopic)","minimally invasive colectomy"],"phonetic":"/ˌlæpəroʊkoʊˈlɛktəmi/","extraExplanation":["这是一个医学专业词：laparo-（腹腔镜/腹部微创）+ colectomy（结肠切除术）。日常交流中更常见的说法是 “laparoscopic colectomy”。","常见适应证包括结肠癌、严重憩室炎、炎症性肠病等；具体切除范围可能是右半结肠切除、左半结肠切除或乙状结肠切除等。","术后医生可能会谈到 “anastomosis（吻合）” 或 “stoma/colostomy（造口/结肠造口）”，取决于病情与手术方式。"]}
{"word":"laparocolostomy","summary":{"en":"A minimally invasive (laparoscopic) surgery to create a colostomy opening.","zh":"用腹腔镜微创方式建立结肠造口开口的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure in which a colostomy (an opening of the colon to the abdominal wall) is created using laparoscopic (“keyhole”) techniques.","zh":"一种用腹腔镜（微创“钥匙孔”）方式建立结肠造口（将结肠引出到腹壁形成排便开口）的手术。"},"examples":[{"en":"The surgeon recommended a laparocolostomy to reduce recovery time compared with open surgery.","zh":"外科医生建议采用腹腔镜结肠造口术，以缩短相较于开腹手术的恢复时间。"},{"en":"After the laparocolostomy, the patient received training on stoma care and supplies.","zh":"腹腔镜结肠造口术后，患者接受了造口护理与用品使用的培训。"}]}],"synonyms":["laparoscopic colostomy","colostomy (general term)"],"phonetic":"/ˌlæp.ə.roʊ.kəˈlɑːs.tə.mi/","extraExplanation":["这个词由三部分构成：laparo-（腹部/腹腔镜相关）+ colo-（结肠）+ -stomy（“造口/开口”的手术）。临床上更常见的说法是“laparoscopic colostomy（腹腔镜结肠造口术）”；“laparocolostomy”属于更偏专业或较少见的合成词。","注意：结肠造口（colostomy）可能是暂时的也可能是永久的，取决于疾病原因（如肠梗阻、肿瘤、外伤或炎症等）以及肠道恢复情况。"]}
{"word":"laparocolotomy","summary":{"en":"Laparocolotomy is a medical term for surgically opening the abdomen and making an incision into the colon.","zh":"Laparocolotomy 是医学术语，指外科手术中切开腹部并切开结肠（大肠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the abdomen is opened and an incision is made into the colon (large intestine).","zh":"一种外科手术：先切开腹部（开腹），并对结肠（大肠）进行切开。"},"examples":[{"en":"The surgeon performed a laparocolotomy to access and repair the damaged section of colon.","zh":"外科医生进行了 laparocolotomy（开腹结肠切开术），以进入并修复受损的结肠部分。"},{"en":"After the laparocolotomy, the patient was closely monitored for infection and bowel function.","zh":"在 laparocolotomy 手术后，医护人员密切观察患者是否感染以及肠道功能是否恢复。"}]}],"synonyms":["laparotomy","colotomy"],"phonetic":"/ˌlæpəroʊkəˈlɑːtəmi/","extraExplanation":["这个词由三部分构成：laparo-（腹部）、colo-（结肠/大肠）、-tomy（切开/切开术）。因此它字面意思就是“腹部+结肠+切开术”。","它属于较少见、较专业的医学用词；日常或临床沟通中更常见的相关词是 laparotomy（开腹术）和 colotomy（结肠切开术）。"]}
{"word":"laparocolpohysterotomy","summary":{"en":"A rare medical term meaning a uterus incision (hysterotomy) involving an abdominal (laparo-) and vaginal (colpo-) approach.","zh":"罕见医学术语：指涉及腹部（laparo-）与阴道（colpo-）途径的子宫切开术（hysterotomy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical incision into the uterus, reached through the abdomen and (typically) the vagina/cervix; a rare, highly technical term used in gynecologic or obstetric surgery writing.","zh":"一种非常专业且少见的医学术语，指经腹部并（通常）经阴道/宫颈途径进入后，对子宫进行切开（切开术）的手术操作或描述。"},"examples":[{"en":"The report described a laparocolpohysterotomy performed to access the uterine cavity.","zh":"报告描述了一项 laparocolpohysterotomy（经腹-阴道-子宫切开术），用于进入子宫腔。"},{"en":"Because the term is uncommon, many clinicians would instead write a clearer description of the surgical approach.","zh":"由于这个术语不常用，许多临床医生会改用更清楚的方式描述手术入路。"}]}],"synonyms":["hysterotomy (broader term)","uterine incision (plain English)"],"phonetic":"/ˌlæpəroʊˌkɑlpoʊˌhɪstərəˈtɑmi/","extraExplanation":["这是一个由词根拼接而成的超长医学复合词：laparo-（腹部/腹腔）、colpo-（阴道）、hystero-（子宫）、-tomy（切开术）。整体含义通常靠“词根拆解”来理解。","在真实的英文病历或手术记录中，这个词非常少见；更常见的是用更标准或更具体的写法来描述，例如说明是“abdominal approach + vaginal/cervical route + uterine incision”等。","如果你是在阅读论文或旧式教材看到它，可以把它当作“多途径/多部位联合的子宫切开术”这一类概念词，而不是日常会用到的常见术式名称。"]}
{"word":"laparocolpotomy","summary":{"en":"Laparocolpotomy is a medical term for making a surgical opening into the abdominal cavity through the vagina.","zh":"laparocolpotomy 指通过阴道切开进入腹腔/腹膜腔的外科手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure that makes an opening into the abdominal (peritoneal) cavity through the vagina (often through the posterior vaginal fornix); essentially a type of vaginal approach to the abdomen.","zh":"一种外科手术：通过阴道（常经阴道后穹窿）切开进入腹腔/腹膜腔；本质上是经阴道进入腹腔的手术入路。"},"examples":[{"en":"In some gynecologic surgeries, a laparocolpotomy can provide access to the pelvic cavity without a large abdominal incision.","zh":"在一些妇科手术中，经阴道腹腔切开术（laparocolpotomy）可在不做较大腹壁切口的情况下进入盆腔。"},{"en":"The surgeon discussed the risks of bleeding and infection before performing a laparocolpotomy.","zh":"手术前，外科医生说明了进行 laparocolpotomy 可能出现的出血与感染风险。"}]}],"synonyms":["culdotomy","vaginal celiotomy"],"phonetic":"/ˌlæpəroʊkɑlˈpɑtəmi/","extraExplanation":["词源拆解：laparo-（腹、腹壁/腹腔）+ colpo-（阴道）+ -tomy（切开术），合起来就是“经阴道进入腹腔的切开术”。","该词多见于妇产科/盆腔手术语境；不同教材可能将其与 culdotomy（经阴道后穹窿切开进入直肠子宫陷凹/腹膜腔）并列或部分重叠，具体用法会随术式与地区而异。"]}
{"word":"laparocystectomy","summary":{"en":"A medical term for surgery to remove a cyst via an abdominal approach.","zh":"一个医学术语，指通过腹部入路进行囊肿切除的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Surgical removal of a cyst through the abdomen (typically via an abdominal incision or abdominal approach).","zh":"（医学）经腹部（通常经腹部切口或腹部入路）切除囊肿的手术。"},"examples":[{"en":"The surgeon discussed whether a laparocystectomy was necessary because the cyst was large and causing pain.","zh":"外科医生讨论是否需要做经腹囊肿切除术，因为囊肿较大并引起疼痛。"},{"en":"After imaging tests, the team recommended laparocystectomy to remove the cyst safely.","zh":"影像检查后，团队建议进行经腹囊肿切除术，以安全切除囊肿。"}]}],"synonyms":["cystectomy","abdominal cystectomy","laparoscopic cystectomy (related)"],"phonetic":"/ˌlæpəroʊ sɪˈstɛk təmi/","extraExplanation":["这个词在临床上并不如一些相关术语常见，容易与 laparoscopic cystectomy（腹腔镜囊肿切除术）或 cholecystectomy（胆囊切除术）混淆。","构词提示：laparo- 表示“腹部”，cyst 表示“囊/囊肿”，-ectomy 表示“切除”。因此整体含义是“经腹切除囊肿”。在真实病历或论文中，医生更常用更具体的说法来说明切除的是哪一种囊肿（如卵巢囊肿等）以及采用的手术方式（开腹或腹腔镜）。"]}
{"word":"laparocystotomy","summary":{"en":"Laparocystotomy is a surgical incision into the urinary bladder through the abdominal wall.","zh":"laparocystotomy 指通过腹壁切开进入并切开膀胱的外科手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the urinary bladder is opened through an incision in the abdominal wall (often to remove stones, tumors, or foreign material, or to create access for another procedure).","zh":"一种外科手术：通过腹壁切开进入并切开膀胱（常用于取出结石、肿瘤或异物，或为其他手术提供通道）。"},"examples":[{"en":"The surgeon performed a laparocystotomy to remove a large bladder stone.","zh":"外科医生进行了经腹膀胱切开术，以取出一枚较大的膀胱结石。"},{"en":"In modern hospitals, laparocystotomy is less common because many bladder procedures can be done endoscopically.","zh":"在现代医院中，经腹膀胱切开术较少见，因为许多膀胱手术可以通过内镜完成。"}]}],"synonyms":["cystotomy (general term)","suprapubic cystotomy (related term)"],"phonetic":"/ˌlæpəroʊsɪˈtɑtəmi/","extraExplanation":["词源拆解：laparo- 表示“腹部/腹腔”，cysto- 表示“膀胱”，-tomy 表示“切开术”。合起来就是“经腹进入并切开膀胱的手术”。","学习提示：它是偏专业、较少见的医学词。在更常见的语境里，你可能会看到 cystotomy（膀胱切开术）、suprapubic cystotomy（耻骨上膀胱切开术）或 laparotomy（剖腹术）。在很多情况下，现代临床会用 endoscopic/transurethral procedures（内镜/经尿道手术）替代开腹切开。"]}
{"word":"laparoelytrotomy","summary":{"en":"Laparoelytrotomy is a rare obstetric surgery to deliver a baby by cutting through the abdomen and the side wall of the uterus.","zh":"Laparoelytrotomy 是一种较罕见的助产手术，通过切开腹壁与子宫侧壁来分娩取胎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to deliver a baby by making an incision in the abdomen and the side (lateral wall) of the uterus, rather than the usual lower uterine segment incision used in a cesarean section","zh":"一种助产手术：通过切开腹壁以及子宫的侧壁（外侧子宫壁）来取出胎儿；不同于常见剖宫产通常在子宫下段切开的方式"},"examples":[{"en":"Because of the unusual anatomy, the surgeon chose laparoelytrotomy instead of a standard C-section.","zh":"由于解剖结构较特殊，外科医生选择了“laparoelytrotomy”，而不是常规剖宫产。"},{"en":"Laparoelytrotomy is now rarely performed and is mostly discussed in medical history and specialized obstetric texts.","zh":"laparoelytrotomy 如今很少实施，更多见于医学史或专业产科文献的讨论。"}]}],"synonyms":["abdominal delivery (general)","cesarean section (related, not identical)"],"phonetic":"/ˌlæpəroʊˌɛlɪˈtrɑtəmi/","extraExplanation":["词源拆解有助理解：laparo- 表示“腹部”，-elytro- 来自希腊语，意为“鞘/阴道”，-tomy 表示“切开术”。整体可理解为“经腹对阴道（上段/侧方相关组织）区域的切开术”，用于分娩取胎。","这是相对少见、偏历史性的产科手术名称；现代临床更常用且更熟悉的对应概念是 cesarean section（剖宫产）。"]}
{"word":"laparoenterostomy","summary":{"en":"A medical term for surgery creating an opening into the intestine through the abdominal wall.","zh":"医学术语：通过腹壁建立与肠道相通的开口（造口）的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation that creates an opening (stoma) into the intestine through the abdominal wall, typically done via an abdominal incision (laparotomy), to allow intestinal contents to drain or to bypass a blockage","zh":"（医学）经腹部切开进行的肠造口术：通过腹壁建立与肠道相通的“造口”（stoma），用于引流、喂养或绕过肠梗阻等情况"},"examples":[{"en":"After the obstruction was confirmed, the surgeons performed a laparoenterostomy to relieve pressure in the bowel.","zh":"确认存在梗阻后，外科医生进行了经腹肠造口术，以减轻肠道内压力。"},{"en":"The patient received instructions on stoma care following laparoenterostomy.","zh":"患者在经腹肠造口术后接受了造口护理指导。"}]}],"synonyms":["enterostomy","intestinal stoma creation","ileostomy (more specific)","colostomy (more specific)"],"phonetic":"/ˌlæpəroʊˌɛntəˈrɑstəmi/","extraExplanation":["这是一个典型的医学复合词：laparo- 表示“腹部/腹腔”，entero- 表示“肠”，-stomy 表示“造口/建立开口的手术”。整体字面意思就是“在腹部进行的肠造口术”。","临床上更常见、更具体的相关词有 ileostomy（回肠造口）、colostomy（结肠造口）。laparoenterostomy 属于较少见、偏学术或旧式的表述，具体术式仍需结合病历描述。"]}
{"word":"laparoenterotomy","summary":{"en":"A medical term meaning a surgical incision into the abdomen and the intestine.","zh":"医学术语：指对腹腔并进入肠道进行切开的一种手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation involving an incision into the abdominal cavity and the intestine (often to access, open, or remove something from the bowel).","zh":"一种外科手术：在腹腔并进入肠道做切开（常用于进入、打开或取出肠道内的异物/内容物等）。"},"examples":[{"en":"The surgeon performed a laparoenterotomy to remove an intestinal obstruction.","zh":"外科医生进行了腹肠切开术，以解除肠梗阻。"},{"en":"After imaging, the team decided that laparoenterotomy was necessary.","zh":"影像检查后，团队认为需要进行腹肠切开术。"}]}],"synonyms":["enterotomy (related)","laparotomy (related)","bowel incision (general)"],"phonetic":"/ˌlæpəroʊˌentəˈrɑtəmi/","extraExplanation":["这是一个非常专业的医学术语，通常出现在手术记录或学术文章里。词根可以拆开记：laparo-（腹/腹壁）、entero-（肠）、-tomy（切开）。","临床上更常见、更通用的说法往往是 laparotomy（剖腹手术/开腹探查）或 enterotomy（肠切开术）；laparoenterotomy强调“经开腹进入并切开肠道”的组合概念。"]}
{"word":"laparogastroscopy","summary":{"en":"A (rare) medical term for using a scope to examine the stomach and nearby abdominal area.","zh":"（较少见的）医学术语，指用内镜检查胃及其邻近腹腔区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical procedure that uses a scope (camera) to examine the stomach and nearby abdominal area, often done with minimally invasive (laparoscopic/endoscopic) techniques","zh":"一种医学检查/手术方式，使用内镜（带摄像头的器械）观察胃及其邻近的腹腔区域，常以微创（腹腔镜/胃镜）方式进行"},"examples":[{"en":"The surgeon recommended laparogastroscopy to check for a stomach ulcer and related abdominal problems.","zh":"外科医生建议做 laparogastroscopy，以检查胃溃疡以及相关的腹部问题。"},{"en":"Laparogastroscopy is usually performed in a hospital with sedation or anesthesia.","zh":"laparogastroscopy 通常在医院进行，并会使用镇静或麻醉。"}]}],"synonyms":["gastroscopy","laparoscopy and gastroscopy","endoscopic examination"],"phonetic":"/ˌlæpəroʊɡæˈstrɑskəpi/","extraExplanation":["这个词在日常英语里非常少见，更常见的说法是 gastroscopy（胃镜检查）、laparoscopy（腹腔镜检查），或直接说 “a laparoscopy and gastroscopy”。","构词理解：laparo-（腹部/腹腔）+ gastro-（胃）+ -scopy（观察/镜检）。医学术语里常用这种组合来表示“用镜子看哪里”。","不同医院或文献对该词的用法可能不一致：有时指“同时做腹腔镜与胃镜”，有时指“与腹腔镜相关的胃部镜检”。如果在病历或检查单上看到，最好向医生确认具体检查范围。"]}
{"word":"laparogastrotomy","summary":{"en":"Laparogastrotomy is a medical term for surgically cutting into the abdomen and stomach.","zh":"laparogastrotomy 指通过切开腹壁进入胃部的外科手术（腹胃切开术）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation that involves making an incision into the abdominal wall and the stomach (often to access or treat a problem inside the stomach).","zh":"（外科）腹胃切开术：一种外科手术，通过切开腹壁并进入胃部，以便接触或处理胃内问题。"},"examples":[{"en":"The surgeon performed a laparogastrotomy to remove a foreign object from the patient’s stomach.","zh":"外科医生实施了腹胃切开术，以取出病人胃里的异物。"},{"en":"After the laparogastrotomy, the patient was closely monitored for infection and bleeding.","zh":"腹胃切开术后，医护人员密切监测患者是否出现感染和出血。"}]}],"synonyms":["gastrotomy","laparotomy (related)","surgical incision into the stomach"],"phonetic":"/ˌlæpəroʊˌɡæˈstrɑtəmi/","extraExplanation":["这是一个医学术语，由词根构成：laparo-（腹部）、gastro-（胃）、-tomy（切开术）。在现代临床中，更常见的表述可能是“gastrotomy（胃切开术）”或在具体语境下使用更明确的手术名称；“laparogastrotomy”强调同时经腹进入胃。"]}
{"word":"laparohepatotomy","summary":{"en":"A rare medical term for surgically cutting into the abdomen and the liver.","zh":"一个较少见的医学术语，指切开腹部并切开肝脏的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation involving an incision (cut) into the abdominal wall and the liver (often done to expose, examine, or treat the liver).","zh":"一种外科手术：切开腹壁并对肝脏进行切开（常用于暴露、检查或治疗肝脏）。"},"examples":[{"en":"Because the bleeding could not be controlled, the surgeon decided to perform a laparohepatotomy.","zh":"由于出血无法控制，外科医生决定进行腹-肝切开术。"},{"en":"Laparohepatotomy is rarely mentioned outside specialized surgical reports.","zh":"除专业外科报告外，“腹-肝切开术”很少被提及。"}]}],"synonyms":["laparotomy with hepatic incision","hepatic laparotomy"],"phonetic":"/ˌlæpəroʊˌhɛpəˈtɑːtəmi/","extraExplanation":["这是一个非常专业、较少见的医学术语，主要出现在外科病例报告或手术记录中。日常英语里更常见的相关词是 laparotomy（剖腹/开腹手术）以及 hepatic incision（肝切开）。","词根拆解有助记忆：laparo- 表示“腹部”，hepat(o)- 表示“肝”，-tomy 表示“切开/切开术”。","在现代医学语境中，医生通常会用更具体的手术名称来描述（例如“exploratory laparotomy + liver biopsy/repair”等），因此这个复合词在临床交流中不算常用。"]}
{"word":"laparohysterectomy","summary":{"en":"Laparohysterectomy means a hysterectomy done with laparoscopy (small incisions and a camera).","zh":"laparohysterectomy 指用腹腔镜方式进行的子宫切除术（小切口+摄像头）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of hysterectomy (surgical removal of the uterus) performed using laparoscopy—small incisions and a camera—rather than a large open incision.","zh":"一种通过腹腔镜（小切口+摄像头）完成的子宫切除术；不同于开腹的大切口手术。"},"examples":[{"en":"She had a laparohysterectomy to treat severe uterine fibroids.","zh":"她因严重的子宫肌瘤接受了腹腔镜子宫切除术。"},{"en":"The surgeon explained that laparohysterectomy often leads to smaller scars and a faster recovery than open surgery.","zh":"外科医生解释说，腹腔镜子宫切除术通常比开腹手术疤痕更小、恢复更快。"}]}],"synonyms":["laparoscopic hysterectomy","laparoscopy-assisted hysterectomy","minimally invasive hysterectomy"],"phonetic":"/ˌlæpəroʊˌhɪstɚˈɛktəmi/","extraExplanation":["这个词由两部分组成：laparo-（与腹部/腹腔镜相关）+ hysterectomy（子宫切除术）。临床上更常见的表达是“laparoscopic hysterectomy”（腹腔镜子宫切除术）；“laparohysterectomy”较偏医学书面或较少见用法。","腹腔镜子宫切除术有不同类型（如全子宫切除、次全子宫切除；是否同时切除宫颈/输卵管/卵巢等），具体含义通常需要结合病历或手术记录说明。"]}
{"word":"laparohysteropexy","summary":{"en":"A laparoscopic surgery that suspends and fixes the uterus to treat uterine prolapse while keeping the uterus.","zh":"一种腹腔镜手术，通过悬吊与固定子宫来治疗子宫脱垂，并保留子宫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure in which the uterus is lifted and fixed (suspended) into a more normal position using laparoscopy, usually to treat uterine prolapse or to support the uterus without removing it","zh":"一种腹腔镜手术，把子宫抬起并固定（悬吊）到较正常的位置，常用于治疗子宫脱垂，或在不切除子宫的前提下提供支撑"},"examples":[{"en":"She had a laparohysteropexy to treat uterine prolapse without a hysterectomy.","zh":"她做了腹腔镜子宫固定术来治疗子宫脱垂，而不需要切除子宫。"},{"en":"The surgeon explained that laparohysteropexy is done through small abdominal incisions.","zh":"外科医生解释说，腹腔镜子宫固定术是通过腹部的小切口完成的。"}]}],"synonyms":["laparoscopic hysteropexy","uterine suspension (laparoscopic)","uterus-sparing prolapse surgery"],"phonetic":"/ˌlæpəroʊˌhɪstɚoʊˈpɛksi/","extraExplanation":["该词由三部分构成：laparo-（腹部/腹腔镜）、hystero-（子宫）、-pexy（固定/悬吊）。整体意思就是“通过腹腔镜进行的子宫固定/悬吊术”。","在临床语境中，它通常指“保留子宫的脱垂修复术”之一；具体方式可能涉及网片或缝线固定到骶骨、韧带等结构。不同医院和术式细节会有差异，术前常会与“hysterectomy（子宫切除）”等方案一起讨论。"]}
{"word":"laparohysterotomy","summary":{"en":"A surgical opening of the uterus made through an abdominal incision.","zh":"通过腹部切口进行的子宫切开术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation in which the uterus is opened through an incision in the abdomen (for example, to deliver a baby or to perform certain fetal/uterine procedures).","zh":"一种外科手术：通过腹部切口进入并切开子宫（例如用于分娩或某些胎儿/子宫手术）。"},"examples":[{"en":"In some specialized cases, the surgeon may perform a laparohysterotomy to access the uterus safely.","zh":"在某些特殊情况下，外科医生可能会进行经腹子宫切开术，以更安全地进入子宫。"},{"en":"A laparohysterotomy can be part of a planned procedure when a standard vaginal delivery is not possible.","zh":"当无法进行常规阴道分娩时，经腹子宫切开术可能是计划手术的一部分。"}]}],"synonyms":["hysterotomy","uterine incision (medical context)"],"phonetic":"/ˌlæpəroʊˌhɪstərəˈtɑtəmi/","extraExplanation":["词源拆解：laparo-（腹部）+ hystero-（子宫）+ -tomy（切开术）。这个词非常专业，多见于手术记录或医学文献。","它与“cesarean section（剖宫产）”有关联：剖宫产通常包含“切开腹壁并切开子宫”这一步，但“laparohysterotomy”更强调“经腹切开子宫”这一具体操作步骤，而不一定等同于完整的“剖宫产”过程。"]}
{"word":"laparoileotomy","summary":{"en":"Laparoileotomy means surgically opening the abdomen and making an incision into the ileum (part of the small intestine).","zh":"Laparoileotomy 指外科手术中切开腹部并切开回肠（小肠的一部分）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the abdomen is opened (laparotomy) and an incision is made into the ileum (ileotomy), usually to inspect, treat, or relieve an intestinal problem","zh":"一种外科手术：切开腹壁进入腹腔（剖腹术），并对回肠（小肠末段）进行切开（回肠切开术），通常用于检查、治疗或解除肠道问题"},"examples":[{"en":"The surgeon performed a laparoileotomy to relieve an intestinal blockage in the ileum.","zh":"外科医生进行了 laparoileotomy，以解除回肠部位的肠梗阻。"},{"en":"After the laparoileotomy, the patient was monitored for infection and bowel function.","zh":"laparoileotomy 之后，医生监测患者是否感染以及肠道功能恢复情况。"}]}],"synonyms":["laparotomy with ileotomy","abdominal exploration with ileal incision"],"phonetic":"/ˌlæpəroʊˌɪlioʊˈtɑmi/","extraExplanation":["这个词在临床英语中并不常见，更常见的说法是分别使用 laparotomy（剖腹探查/剖腹术）和 ileotomy（回肠切开术），或根据具体手术写成“laparotomy with ileotomy”（剖腹术联合回肠切开）。","词根拆解有助记忆：laparo- 表示“腹部/腹壁”，ileo- 表示“回肠”，-tomy 表示“切开”。"]}
{"word":"laparomyitis","summary":{"en":"Laparomyitis is a rare medical term meaning inflammation of the abdominal muscles.","zh":"Laparomyitis 是一个少见的医学术语，指腹部肌肉的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Inflammation of the abdominal (belly) muscles; a very rare/uncommon term, built from parts meaning “abdomen” + “muscle inflammation.”","zh":"（医学）腹部肌肉的炎症；这是一个非常少见/不常用的术语，由表示“腹部”+“肌肉炎症”的词根组合而成。"},"examples":[{"en":"The report mentioned possible laparomyitis after abdominal trauma, though the doctor noted the term is rarely used.","zh":"报告提到腹部外伤后可能出现“laparomyitis（腹部肌炎）”，但医生也指出这个说法很少使用。"},{"en":"Severe abdominal muscle pain can have many causes, so clinicians usually describe the condition more specifically than saying “laparomyitis.”","zh":"腹部肌肉剧痛可能有很多原因，所以临床上通常会更具体地描述病情，而不是笼统地说“laparomyitis”。"}]}],"synonyms":["abdominal myositis","abdominal muscle inflammation"],"phonetic":"/ˌlæpəroʊmaɪˈaɪtɪs/","extraExplanation":["这个词看起来更像“构词上合理、但实际使用极少”的医学术语：laparo-（腹部/腹腔）+ my-（肌肉）+ -itis（炎症）。在真实的英文医学语境里，更常见的表达可能是 abdominal myositis（腹部肌炎）、myositis of the abdominal wall（腹壁肌炎）或直接描述为 abdominal muscle inflammation。","如果你原本想查的是拼写相近的医学词（例如 myositis / polymyositis / dermatomyositis 等），把正确拼写发我，我可以按常见程度和临床含义帮你对比区分。"]}
{"word":"laparomyomectomy","summary":{"en":"Laparomyomectomy is an open abdominal surgery to remove uterine fibroids while preserving the uterus.","zh":"laparomyomectomy 指通过开腹手术切除子宫肌瘤并保留子宫的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove uterine fibroids (myomas) through an open abdominal incision (laparotomy), while keeping the uterus.","zh":"一种通过开腹切口（开腹手术）切除子宫肌瘤（子宫平滑肌瘤），同时保留子宫的手术。"},"examples":[{"en":"After discussing fertility goals, the doctor recommended a laparomyomectomy instead of removing the whole uterus.","zh":"在讨论生育需求后，医生建议做开腹子宫肌瘤剔除术，而不是切除整个子宫。"},{"en":"Compared with laparoscopic surgery, recovery after laparomyomectomy may take longer because the incision is larger.","zh":"与腹腔镜手术相比，开腹子宫肌瘤剔除术由于切口更大，恢复时间可能更长。"}]}],"synonyms":["open myomectomy","abdominal myomectomy"],"phonetic":"/ˌlæpəroʊˌmaɪəˈmɛktəmi/","extraExplanation":["这是一个医学复合词：laparo-（腹部/开腹）+ myo-（肌肉）+ -ectomy（切除术）。整体强调“开腹途径”来做“肌瘤剔除”。","临床上常与 laparoscopic myomectomy（腹腔镜子宫肌瘤剔除术，微创）对比；若不保留子宫、直接切除子宫，则通常称为 hysterectomy（子宫切除术）。","该词在日常英语中较少出现，多见于病历、手术同意书、医学论文或保险理赔材料。"]}
{"word":"laparomyomotomy","summary":{"en":"Laparomyomotomy is an abdominal (open) surgical incision into a uterine fibroid (myoma).","zh":"Laparomyomotomy 指通过开腹手术对子宫肌瘤进行切开处理的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure in which a surgeon makes an incision into a uterine fibroid (myoma) through an abdominal opening (laparotomy), usually to help remove it or reduce its size.","zh":"一种外科手术：通过开腹（腹部切开）进入盆腔，在子宫肌瘤（myoma）上做切开（myomotomy），通常用于辅助取出肌瘤或减小/处理肌瘤。"},"examples":[{"en":"The doctor explained that a laparomyomotomy would involve an abdominal incision and cutting into the fibroid.","zh":"医生解释说，laparomyomotomy 会涉及开腹切口，并在肌瘤上做切开处理。"},{"en":"Because she wanted to preserve her uterus, the team discussed options such as myomectomy versus laparomyomotomy.","zh":"因为她希望保留子宫，医疗团队讨论了 myomectomy（肌瘤切除术）与 laparomyomotomy 等选择。"}]}],"synonyms":["myomotomy (via laparotomy)","open myomotomy","laparotomy with myomotomy"],"phonetic":"/ˌlæpəroʊˌmaɪəˈmɑtəmi/","extraExplanation":["这个词在英文医学写作中并不算常见；更常见的说法通常是 laparotomy + myomotomy（开腹 + 肌瘤切开）或直接用 myomectomy（肌瘤切除术）。","词形拆解：laparo-（腹部/开腹）+ myo-（肌肉）+ -oma（瘤/肿块）+ -tomy（切开）。注意与 -ectomy（切除）区分：myomotomy 是“切开”，myomectomy 是“切除”。","你输入的拼写“laparomyomotomy”可能是专业合成词或非标准拼法；若你想表达“腹腔镜下肌瘤切除术”，更常见是 laparoscopic myomectomy。建议结合具体病历/语境确认用词。"]}
{"word":"laparonephrectomy","summary":{"en":"Laparonephrectomy is the laparoscopic (minimally invasive) surgical removal of a kidney.","zh":"Laparonephrectomy 指通过腹腔镜（微创）方式进行的肾切除术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove a kidney using laparoscopic (minimally invasive) techniques, usually through small cuts in the abdomen","zh":"一种通过腹腔镜（微创）技术切除肾脏的手术，通常经腹部小切口完成"},"examples":[{"en":"She underwent a laparonephrectomy to remove a severely damaged kidney.","zh":"她接受了腹腔镜肾切除术，以切除严重受损的肾脏。"},{"en":"Compared with open surgery, laparonephrectomy often causes less pain and allows faster recovery.","zh":"与开腹手术相比，腹腔镜肾切除术通常疼痛更轻、恢复更快。"}]}],"synonyms":["laparoscopic nephrectomy","lap nephrectomy","nephrectomy (general term)"],"phonetic":"/ˌlæpəroʊnəˈfrɛktəmi/","extraExplanation":["这是一个医学复合词：laparo- 表示“腹部/腹腔镜相关”，nephrectomy 表示“肾切除术”。在临床上也常写作 laparoscopic nephrectomy（腹腔镜肾切除术）。","手术类型可能包括：单纯肾切除（因严重感染/功能丧失等）与根治性肾切除（如肾癌时可能同时处理周围组织）。具体范围由病因与医生方案决定。"]}
{"word":"laparonephrotomy","summary":{"en":"A transabdominal surgical incision into the kidney.","zh":"经腹部入路进行的肾切开术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation in which a surgeon makes an incision into the kidney through an abdominal (belly) approach.","zh":"一种外科手术：通过腹部入路切开肾脏（在肾组织上做切口）。"},"examples":[{"en":"Because of the stone’s location, the team planned a laparonephrotomy to access the kidney directly.","zh":"由于结石位置特殊，医疗团队计划进行腹部入路的肾切开术，以便直接进入肾脏。"},{"en":"The surgeon explained that a laparonephrotomy is more invasive than endoscopic procedures.","zh":"外科医生解释说，腹部入路的肾切开术比内镜手术更具侵入性。"}]}],"synonyms":["transabdominal nephrotomy","nephrotomy (via laparotomy)"],"phonetic":"/ˌlæpəroʊnəˈfrɑtəmi/","extraExplanation":["词源结构：laparo- 表示“腹部”，nephro- 表示“肾”，-tomy 表示“切开/切开术”。合起来就是“经腹部入路的肾切开术”。","这是较为专业、较少见的术语；临床上更常见的相关词包括 nephrotomy（肾切开术）以及描述入路的表达，如 transabdominal approach（经腹入路）。"]}
{"word":"laparorrhaphy","summary":{"en":"Laparorrhaphy is the surgical suturing (closure) of an abdominal incision.","zh":"laparorrhaphy 指对腹部切口进行外科缝合闭合的手术操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure in which an incision in the abdominal wall is closed (sutured), especially the closure of a laparotomy wound","zh":"腹壁切口缝合术；（尤指剖腹手术后）腹部切口的缝合闭合"},"examples":[{"en":"After the operation, the surgeon performed a careful laparorrhaphy to close the abdominal incision.","zh":"手术结束后，外科医生进行了细致的腹壁切口缝合，以闭合腹部切口。"},{"en":"Good technique in laparorrhaphy can reduce the risk of wound separation.","zh":"良好的腹壁切口缝合技术可以降低切口裂开的风险。"}]}],"synonyms":["abdominal wound closure","closure of a laparotomy incision","abdominal closure","surgical suturing of the abdomen"],"phonetic":"/ˌlæpəˈrɔrəfi/","extraExplanation":["词源拆解：lapar(o)- 表示“腹、腹部”，-rrhaphy 来自希腊语，表示“缝合、缝合术”。合起来就是“腹部的缝合术”。","使用场景：这是较专业、偏医学文献/手术记录的用词。日常英语里更常见的表达是“closure of the abdominal incision / wound closure”。","相关区别：laparotomy 指“剖腹（切开腹壁）”，laparorrhaphy 指“把这个切口缝回去（闭合）”。"]}
{"word":"laparosalpingectomy","summary":{"en":"Laparosalpingectomy is surgery (usually laparoscopic) to remove a fallopian tube (one or both).","zh":"laparosalpingectomy 指（多为腹腔镜方式的）输卵管切除术，可切除一侧或双侧输卵管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove one or both fallopian tubes, usually done using laparoscopy (minimally invasive “keyhole” surgery).","zh":"（通常通过腹腔镜进行的）输卵管切除术；指手术切除一侧或双侧输卵管。"},"examples":[{"en":"She had a laparoscopic laparosalpingectomy after an ectopic pregnancy.","zh":"宫外孕后，她接受了腹腔镜输卵管切除术。"},{"en":"The doctor explained that a laparosalpingectomy removes the fallopian tube to prevent a repeat ectopic pregnancy.","zh":"医生解释说，输卵管切除术会切除输卵管，以降低再次发生宫外孕的风险。"}]}],"synonyms":["laparoscopic salpingectomy","salpingectomy"],"phonetic":"/ˌlæpəroʊˌsæl.pɪŋˈɡɛk.təmi/","extraExplanation":["词源拆解：laparo-（腹、腹部）+ salping-（输卵管）+ -ectomy（切除术）。因此它字面意思就是“通过腹部（常指腹腔镜途径）进行的输卵管切除”。","临床上更常见的说法是 laparoscopic salpingectomy（腹腔镜输卵管切除术）。laparosalpingectomy 属于较少见、偏专业的合成词。","与相近术语区分：salpingectomy=输卵管切除；salpingostomy=在输卵管上切开造口（保留输卵管）；salpingo-oophorectomy=切除输卵管和卵巢。"]}
{"word":"laparosalpingotomy","summary":{"en":"A laparoscopic incision into a fallopian tube, usually to remove an ectopic pregnancy while preserving the tube.","zh":"腹腔镜下对输卵管进行切开（常用于处理异位妊娠并尽量保留输卵管）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A laparoscopic surgical procedure in which a small incision is made in a fallopian tube (salpinx), often to remove an ectopic pregnancy or other blockage while trying to preserve the tube.","zh":"一种腹腔镜手术：在输卵管上切开一个小切口（多用于取出输卵管异位妊娠或解除阻塞），目标通常是尽量保留输卵管功能。"},"examples":[{"en":"The doctor recommended a laparosalpingotomy to remove the ectopic pregnancy and preserve the fallopian tube.","zh":"医生建议做腹腔镜输卵管切开术，以取出异位妊娠并尽量保留输卵管。"},{"en":"After the laparosalpingotomy, she needed follow-up blood tests to make sure the pregnancy hormone level fell.","zh":"做完腹腔镜输卵管切开术后，她需要复查血液指标，确认妊娠激素水平下降。"}]}],"synonyms":["laparoscopic salpingotomy","salpingotomy"],"phonetic":"/ˌlæpəroʊˌsælpɪŋˈtɑːtəmi/","extraExplanation":["这是一个较专业的医学术语，常见于妇产科手术记录或学术文章中。词根可拆解为：laparo-（腹部/腹腔镜相关）+ salpingo-（输卵管）+ -tomy（切开）。","临床上常与“salpingectomy（输卵管切除术）”作对比：-tomy强调“切开取出/处理后保留器官”，-ectomy强调“切除”。具体选择取决于病情、出血情况、未来生育需求等，由医生评估决定。"]}
{"word":"laparoscope","summary":{"en":"A laparoscope is a camera-equipped instrument used to look inside the abdomen, often in minimally invasive surgery.","zh":"laparoscope 指“腹腔镜”，用于观察腹腔内部，常用于微创手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin medical instrument with a light and camera that doctors insert through a small cut to look inside the abdomen (belly), often for surgery.","zh":"腹腔镜：一种细长的医疗器械，带有光源和摄像头，医生通过小切口伸入腹部内部进行观察，常用于微创手术。"},"examples":[{"en":"The surgeon used a laparoscope to check the patient’s abdomen without making a large incision.","zh":"外科医生使用腹腔镜检查病人的腹部，而不需要做很大的切口。"},{"en":"During a laparoscopic operation, the camera on the laparoscope shows the organs on a screen.","zh":"在腹腔镜手术中，腹腔镜上的摄像头会把器官影像显示在屏幕上。"}]}],"synonyms":["endoscope (broader term)"],"phonetic":"/ˈlæpərəˌskoʊp/","extraExplanation":["词源提示：laparo- 表示“腹部/腹腔”，-scope 表示“观察器/镜”。因此 laparoscope 字面意思就是“用来观察腹腔的镜”。","常见搭配：laparoscopic surgery（腹腔镜手术/微创手术）、insert a laparoscope（置入腹腔镜）、through small incisions（通过小切口）。"]}
{"word":"laparoscopic","summary":{"en":"minimally invasive, camera-assisted abdominal surgery-related","zh":"与腹腔镜（微创、镜头辅助）手术有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or done using laparoscopy (a type of minimally invasive surgery using small cuts and a camera).","zh":"与腹腔镜检查/手术有关的；用腹腔镜方式进行的（微创，用小切口和镜头操作）。"},"examples":[{"en":"She had a laparoscopic surgery to remove her gallbladder.","zh":"她做了腹腔镜手术切除胆囊。"},{"en":"Laparoscopic procedures often lead to smaller scars and faster recovery.","zh":"腹腔镜手术通常疤痕更小、恢复更快。"}]}],"synonyms":["minimally invasive","endoscopic"],"phonetic":"/ˌlæpəˈrɑːskɑːpɪk/","extraExplanation":["“Laparoscopic”常见搭配：laparoscopic surgery（腹腔镜手术）、laparoscopic procedure（腹腔镜操作/手术方式）、laparoscopic cholecystectomy（腹腔镜胆囊切除术）。","口语里医生也可能说“keyhole surgery（钥匙孔手术）”来强调切口很小，含义接近微创腹腔镜手术。"],"etymology":"来自希腊语词根：laparo-（腹部、腹腔）+ -scopic（观看、观察的）。原意是“用镜子观察腹腔的”。后来引申为“用腹腔镜进行的（手术）”。","mnemonic":["拆词记：laparo-≈“腹/腹腔”，-scopic≈“看镜子”。合起来就是“用镜子看肚子里的（手术）”。","联想中文：腹腔镜=“在腹腔里用镜头看”，所以形容词 laparoscopic=“腹腔镜的/用腹腔镜做的”。"]}
{"word":"laparoscopy","summary":{"en":"Laparoscopy is a minimally invasive procedure using a small camera through tiny abdominal cuts to examine or operate inside the abdomen.","zh":"Laparoscopy（腹腔镜）是一种微创方式，通过腹部小切口插入小型摄像头来检查或进行腹部/盆腔手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical procedure in which a doctor uses a thin camera (a laparoscope) inserted through small cuts in the abdomen to look inside the body, and sometimes to perform surgery.","zh":"一种医疗检查或手术方式：医生通过腹部的小切口插入带摄像头的细管（腹腔镜）来观察体内情况，有时也用于完成手术。"},"examples":[{"en":"The doctor recommended laparoscopy to find the cause of her abdominal pain.","zh":"医生建议做腹腔镜检查来找出她腹痛的原因。"},{"en":"After laparoscopy, she went home the same day with only a few small bandages.","zh":"做完腹腔镜后，她当天就回家了，只贴了几块小纱布。"},{"en":"Laparoscopy is often used to diagnose endometriosis.","zh":"腹腔镜常用于诊断子宫内膜异位症。"}]}],"synonyms":["keyhole surgery","minimally invasive surgery","laparoscopic surgery"],"phonetic":"/ˌlæpəˈrɑskəpi/","extraExplanation":["“Laparoscopy”常译为“腹腔镜（检查/手术）”。它属于“微创”方式：切口较小、恢复通常更快，但仍需要麻醉与术后护理。","常见场景包括：查明不明原因腹痛、评估不孕原因、处理胆囊或阑尾问题等；具体是否适合需由医生根据病情决定。"]}
{"word":"laparosplenectomy","summary":{"en":"Laparosplenectomy is surgery to remove the spleen using laparoscopic (minimally invasive) methods.","zh":"laparosplenectomy 指用腹腔镜微创方式切除脾脏的手术（更常见说法是 laparoscopic splenectomy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove the spleen using minimally invasive laparoscopic techniques (small incisions and a camera).","zh":"腹腔镜脾切除术：用微创腹腔镜技术（小切口与摄像镜）切除脾脏的手术。"},"examples":[{"en":"After the accident, the surgeons performed a laparoscopic splenectomy to stop internal bleeding.","zh":"事故后，外科医生进行了腹腔镜脾切除术以止住内出血。"},{"en":"Laparosplenectomy may be recommended for certain blood disorders when medicines do not work.","zh":"当药物治疗无效时，某些血液疾病可能会建议进行腹腔镜脾切除术。"}]}],"synonyms":["laparoscopic splenectomy","splenectomy (general term)"],"phonetic":"/ˌlæpəroʊspliˈnɛktəmi/","extraExplanation":["“laparosplenectomy”在实际英语医疗写作中较少见；更常用、也更标准的说法是 **laparoscopic splenectomy**（腹腔镜脾切除术）。","词形拆解：**laparo-**（腹腔/腹部）+ **splen-**（脾脏）+ **-ectomy**（切除术）。了解这些构词能帮助你读懂很多医学词汇。","语境提示：切除脾脏后感染风险可能上升，临床上常会讨论疫苗接种与预防感染等随访管理（具体请遵医嘱）。"]}
{"word":"laparosplenotomy","summary":{"en":"A medical term for making a surgical incision into the abdomen to access and cut into the spleen.","zh":"医学术语，指开腹进入并对脾脏进行切开的手术操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical incision (cut) into the abdomen and the spleen; in practice, it usually refers to opening the abdomen to access and cut into the spleen.","zh":"对腹部和脾脏进行的外科切开；实际使用中多指通过开腹进入并切开脾脏的手术操作。"},"examples":[{"en":"Because of internal bleeding, the surgeon performed a laparosplenotomy to evaluate and repair the spleen.","zh":"由于出现内出血，外科医生进行了开腹脾切开术，以评估并修复脾脏。"},{"en":"The report describes a laparosplenotomy followed by careful control of bleeding.","zh":"报告描述了先进行开腹脾切开术，然后仔细止血。"}]}],"synonyms":["splenotomy","laparotomy with splenotomy"],"phonetic":"/ˌlæpəroʊˌspliːˈnɑːtəmi/","extraExplanation":["这是一个相对少见、偏专业的医学术语，更多时候临床会用更常见的说法，如 splenotomy（脾切开术）或 laparotomy with splenotomy（开腹并行脾切开）。","构词理解：lapar(o)- 表示“腹部/腹腔”，splen(o)- 表示“脾脏”，-tomy 表示“切开（用于进入或检查）”。把词根拆开记会更容易。"]}
{"word":"laparostict","summary":{"en":"Laparoscopic means “done using laparoscopy,” minimally invasive surgery through small abdominal cuts with a camera.","zh":"laparoscopic 意为“腹腔镜（微创）手术的/相关的”，指通过腹部小切口借助摄像头进行的手术。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to laparoscopy, a type of surgery done through small cuts in the abdomen using a camera and special instruments.","zh":"与腹腔镜（微创）手术有关的；通过腹部小切口，用摄像头和器械进行的手术。"},"examples":[{"en":"She had laparoscopic surgery to remove her gallbladder.","zh":"她做了腹腔镜手术来切除胆囊。"},{"en":"Laparoscopic procedures often leave smaller scars than open surgery.","zh":"腹腔镜手术通常比开腹手术留下更小的疤痕。"}]}],"synonyms":["minimally invasive","keyhole (surgery)"],"phonetic":"/ˌlæpə.rəˈskɑː.pɪk/","extraExplanation":["你输入的“laparostict”很可能是拼写错误，常见正确词是“laparoscopic”。","“laparo-”表示“腹部”，“-scopic”与“观察/镜检”有关；合起来就是“用镜子在腹腔内观察并操作的”。在医院里也常听到“laparoscopy（腹腔镜检查/手术）”这个名词。"]}
{"word":"laparosticti","summary":{"en":"Laparosticti is a mostly historical entomology term for a former group of beetles, especially those related to scarabs.","zh":"Laparosticti 是昆虫学中较偏历史用法的术语，指一类旧式划分的甲虫类群，常与金龟类及其近缘类群相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) a former taxonomic group of beetles (traditionally including scarab and related beetles), characterized by having the hind coxae (the basal segments of the legs) set in a way that divides the underside of the abdomen into distinct plates; the term is now mostly historical.","zh":"（昆虫学）一种已较少使用的甲虫分类群（传统上包括金龟子及其近缘类群等），其特点是后基节（腿的基部节）的位置与结构使腹部腹面分成明显的板块；该术语如今多见于旧式分类或历史文献。"},"examples":[{"en":"Older field guides may place scarab beetles under Laparosticti.","zh":"较旧的野外图鉴可能会把金龟子科甲虫归入 Laparosticti。"},{"en":"In modern classification, many groups once called Laparosticti are treated within the superfamily Scarabaeoidea.","zh":"在现代分类中，许多曾被称为 Laparosticti 的类群多被放在金龟总科（Scarabaeoidea）之内。"}]}],"synonyms":["Scarab beetles (contextual)","Scarabaeoidea (modern context)"],"phonetic":"ˌlæpəroʊˈstɪktaɪ","extraExplanation":["这是一个偏“历史性的分类名”。在较早的甲虫分类体系中，研究者会根据腹面（尤其是后足基节与腹板的关系）把一些甲虫分成不同大类；后来随着形态学与分子系统学的发展，这种划分方式不再常用，因此你在新论文/新图鉴里可能更常见到 Scarabaeoidea（金龟总科）等名称。","词源上可拆为 laparo-（与“腹部/腹侧”相关的构词成分）+ stict-（与“点/斑/刻点”相关的构词成分）+ -i（常见于拉丁化复数或分类名结尾）；不过在实际阅读中，把它当作一个固定的分类名来记更实用。"]}
{"word":"laparothoracoscopy","summary":{"en":"A medical term for an endoscopic procedure that examines both the abdomen and the chest.","zh":"医学术语：一种同时检查腹腔与胸腔的内镜操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An endoscopic procedure used to look inside the abdominal cavity and the chest cavity (thorax), combining laparoscopy and thoracoscopy for diagnosis or surgery.","zh":"一种内镜检查/手术方式，用来观察腹腔与胸腔（胸廓）内部，结合了腹腔镜（laparoscopy）与胸腔镜（thoracoscopy），可用于诊断或治疗。"},"examples":[{"en":"The surgeon performed laparothoracoscopy to inspect both the diaphragm and nearby organs.","zh":"外科医生进行了 laparothoracoscopy，以检查膈肌及其附近的器官。"},{"en":"In some complex cases, laparothoracoscopy can help doctors evaluate problems that involve both the chest and the upper abdomen.","zh":"在一些复杂病例中，laparothoracoscopy 可以帮助医生评估同时涉及胸部与上腹部的问题。"}]}],"synonyms":["combined laparoscopy and thoracoscopy","laparoscopy","thoracoscopy","endoscopy"],"phonetic":"/ˌlæpəroʊˌθɔrəˈskɑpi/","extraExplanation":["词形拆解：laparo-（腹部/腹腔）+ thoraco-（胸部/胸腔）+ -scopy（“观察、镜检”）。","这是非常专业的医学术语，实际临床文章里更常分别写 laparoscopy（腹腔镜）和 thoracoscopy（胸腔镜），或根据具体操作写成“combined laparoscopy and thoracoscopy”。","相关概念：thoracoscopy 在外科领域常与 VATS（video-assisted thoracoscopic surgery，视频辅助胸腔镜手术）相关；laparoscopy 则常用于微创腹部手术。"]}
{"word":"laparotome","summary":{"en":"A laparotome is a surgical knife/instrument used to open the abdomen during a laparotomy.","zh":"laparotome 指用于开腹手术时切开腹壁的外科手术器械（开腹刀）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical instrument used to cut open the abdominal wall (used in a laparotomy).","zh":"（外科）开腹刀；用于切开腹壁的手术器械（用于开腹手术）。"},"examples":[{"en":"The surgeon selected a laparotome to begin the abdominal incision.","zh":"外科医生选择了一把开腹刀来开始腹部切口。"},{"en":"In older operating rooms, a laparotome was commonly used before minimally invasive techniques became widespread.","zh":"在较早期的手术室里，在微创技术普及前，开腹刀是很常用的器械。"}]}],"synonyms":["abdominal knife","surgical knife","scalpel (general)"],"phonetic":"/ləˈpærəˌtoʊm/","extraExplanation":["词源提示：laparo- 表示“腹部”，-tome 来自希腊语，表示“切割的工具”（同根词：tome/atomy）。","相关术语区分：\n- laparotomy：开腹手术（手术方式）\n- laparoscope：腹腔镜（观察用的镜）\n- laparoscopy：腹腔镜检查/手术（操作方式，通常为微创）\n- laparotome：开腹刀（器械）","使用语境：laparotome 不是日常词，多见于外科器械清单、手术记录或医学教材中。"]}
{"word":"laparotomies","summary":{"en":"“Laparotomies” means abdominal surgeries where doctors open the abdomen (plural of laparotomy).","zh":"“laparotomies”指“开腹手术/剖腹手术”（laparotomy 的复数），即通过切开腹壁打开腹腔进行检查或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the abdomen is opened, usually through a cut in the abdominal wall, to examine or treat problems inside (plural of “laparotomy”).","zh":"剖腹手术；开腹手术（“laparotomy”的复数）：通过切开腹壁打开腹腔，以检查或治疗腹腔内问题的外科手术。"},"examples":[{"en":"The surgeon performed two laparotomies during the patient’s treatment because the condition changed.","zh":"由于病情变化，外科医生在治疗过程中对患者进行了两次开腹手术。"},{"en":"In some emergencies, laparotomies are necessary to stop internal bleeding quickly.","zh":"在某些紧急情况下，为了迅速止住内出血，可能必须进行开腹手术。"}]}],"synonyms":["open abdominal surgery","abdominal exploration"],"phonetic":"/ˌlæpəˈrɑtəˌmiz/","extraExplanation":["词源提示：laparo- 来自希腊语，意为“腹部/腹侧”；-tomy 意为“切开”。因此 laparotomy 字面意思就是“切开腹部”。","医学语境：现代很多情况会优先选择“腹腔镜手术（laparoscopy）”，切口更小、恢复更快；但当需要快速、广泛地探查或处理严重问题时，仍可能需要开腹手术。","用法提示：在一般英语写作中更常见单数形式 laparotomy；复数 laparotomies 多出现在病例报告、研究统计或病史记录中。"]}
{"word":"laparotomist","summary":{"en":"A laparotomist is a surgeon who performs laparotomy (opening the abdomen during surgery).","zh":"laparotomist 指进行剖腹手术（打开腹部的手术）的外科医生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgeon or medical specialist who performs a laparotomy (a surgical operation that opens the abdomen)","zh":"进行“剖腹探查/剖腹手术”（打开腹部的外科手术）的外科医生或专科医生"},"examples":[{"en":"The patient was referred to a laparotomist for urgent abdominal surgery.","zh":"病人被转诊给一位剖腹手术医生，以便进行紧急腹部手术。"},{"en":"In the past, a laparotomist was often needed when imaging tests were limited.","zh":"过去由于影像检查手段有限，常常需要剖腹手术医生来进行探查。"}]}],"synonyms":["surgeon","general surgeon","abdominal surgeon"],"phonetic":"/ˌlæpəˈrɑːtəˌmɪst/","extraExplanation":["词源上可拆为 laparo-（腹部）+ -tomy（切开、切开术）+ -ist（从业者）。因此 laparotomist 字面意思就是“做腹部切开术的人”。","这个词在现代临床英语中相对少见；更常见的说法是 surgeon（外科医生）、general surgeon（普外科医生）或 abdominal surgeon（腹部外科医生）。"]}
{"word":"laparotomize","summary":{"en":"A medical verb meaning to surgically open the abdomen (to perform a laparotomy).","zh":"医学动词，指进行剖腹术/剖腹探查，即手术打开腹部。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to perform a laparotomy on someone; to surgically open the abdomen (belly) for examination or treatment","zh":"对（患者）进行剖腹探查/剖腹手术；以手术方式打开腹腔以检查或治疗"},"examples":[{"en":"The trauma surgeon decided to laparotomize the patient to control internal bleeding.","zh":"创伤外科医生决定对患者进行剖腹手术，以控制体内出血。"},{"en":"In rare emergencies, doctors may laparotomize when imaging cannot explain the severe abdominal pain.","zh":"在少见的紧急情况下，如果影像检查无法解释剧烈腹痛，医生可能会选择剖腹探查。"}]}],"synonyms":["perform a laparotomy (on)","open the abdomen","do an exploratory laparotomy"],"phonetic":"/ləˈpærəˌtɑːˌmaɪz/","extraExplanation":["这是一个医学用词，常见于手术记录或学术写作中。它由 laparotomy（剖腹术）+ -ize（使……化/进行……）构成，意思相当于“perform a laparotomy”。在日常英语里更常说“perform/do a laparotomy”。"]}
{"word":"laparotomized","summary":{"en":"“Laparotomized” means someone has had their abdomen surgically opened (a laparotomy).","zh":"“Laparotomized”指某人已接受开腹手术（剖腹探查）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having undergone a laparotomy (a surgical operation in which the abdomen is opened).","zh":"（医学）已接受剖腹探查/开腹手术的（指腹部被外科切开）。"},"examples":[{"en":"The patient was laparotomized to control internal bleeding after the accident.","zh":"事故后，为了控制内出血，患者接受了开腹手术。"},{"en":"In the report, “laparotomized” indicates the abdomen was surgically opened during treatment.","zh":"在病历中，“laparotomized”表示治疗过程中曾外科切开腹部。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of laparotomize: to perform a laparotomy on someone.","zh":"laparotomize 的过去式/过去分词：对某人施行开腹手术。"},"examples":[{"en":"Surgeons laparotomized the patient when imaging could not explain the severe pain.","zh":"当影像检查无法解释剧烈疼痛时，外科医生对患者实施了开腹手术。"}]}],"synonyms":["post-laparotomy","status post laparotomy","opened (surgically, informal medical)"],"phonetic":"/ˌlæpəˈrɑtəˌmaɪzd/","extraExplanation":["“laparotomized”多见于病历、手术记录和研究论文，语气偏客观、技术性；日常交流中更常说“had abdominal surgery / had a laparotomy（做了开腹手术）”。","词源上，laparo- 来自希腊语，意为“腹部/体侧”，-tomy 表示“切开”。因此 laparotomy 字面意思就是“切开腹部”。"]}
{"word":"laparotomizing","summary":{"en":"“Laparotomizing” means performing an open abdominal operation (a laparotomy).","zh":"“laparotomizing”指正在进行开腹手术（剖腹探查）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"performing a laparotomy (making a surgical cut into the abdominal wall), usually to examine or treat problems inside the abdomen.","zh":"正在进行剖腹探查/开腹手术（在腹壁上做外科切口），通常用于检查或治疗腹腔内的问题。"},"examples":[{"en":"The surgical team is laparotomizing the patient to locate the source of internal bleeding.","zh":"外科团队正在对患者进行开腹手术，以寻找内出血的来源。"},{"en":"In trauma cases, doctors may start by laparotomizing when imaging is not enough and the patient is unstable.","zh":"在创伤病例中，如果影像检查不足且患者不稳定，医生可能会首先进行开腹手术。"}]}],"synonyms":["performing a laparotomy","opening the abdomen (surgically)","exploratory laparotomy (in context)"],"phonetic":"/ˌlæpəˈrɑtəˌmaɪzɪŋ/","extraExplanation":["“laparotomizing”来自动词“laparotomize”，医学写作中更常见名词“laparotomy（开腹/剖腹探查）”。它通常出现在手术记录、病例报告或学术文章里，属于较专业用语。","现代临床中，部分情况会优先选择“laparoscopy（腹腔镜手术）”这种微创方式；但当需要快速暴露、控制大出血或处理复杂损伤时，仍可能选择开腹手术。"]}
{"word":"laparotomy","summary":{"en":"Laparotomy is an operation that involves making a cut in the abdomen to access organs inside.","zh":"Laparotomy 指通过切开腹部进入腹腔以检查或治疗内部器官的手术（开腹手术）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation in which a doctor makes an incision (cut) into the abdomen to examine or treat organs inside.","zh":"一种外科手术：在腹部切开一个切口，以便检查或治疗腹腔内的器官。"},"examples":[{"en":"The patient underwent a laparotomy to stop internal bleeding after the accident.","zh":"事故后，为了止住内出血，病人接受了开腹手术。"},{"en":"During the laparotomy, the surgeon removed an inflamed appendix.","zh":"在开腹手术中，外科医生切除了发炎的阑尾。"},{"en":"If imaging is unclear, a laparotomy may be needed to confirm the diagnosis.","zh":"如果影像检查结果不明确，可能需要开腹手术来确诊。"}]}],"synonyms":["abdominal surgery","open abdominal surgery","exploratory laparotomy"],"phonetic":"/ˌlæpəˈrɑtəmi/","extraExplanation":["词源：laparo-（腹部、侧腹）+ -tomy（切开术）。常见于医学语境。","与 laparoscopy（腹腔镜手术）对比：laparotomy 通常切口更大、恢复时间可能更长；laparoscopy 多为微创、用镜子和小切口完成。","在医学写作中也可能看到 exploratory laparotomy（探查性开腹术），指为了查明病因而进行的开腹探查。"]}
{"word":"laparotrachelotomy","summary":{"en":"A very uncommon, likely nonstandard term that seems to refer to an incision into the trachea; usually replaced by “tracheotomy/tracheostomy.”","zh":"一个很少见、可能不规范的词，看似指“气管切开”；通常用更标准的“tracheotomy/tracheostomy”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very rare or nonstandard medical term that appears to mean “a surgical incision into the trachea (windpipe),” formed from parts used in medical word-building.","zh":"一个非常罕见或不规范的医学术语，看起来由医学构词成分拼合而成，大意可能是“对气管（风管）做外科切开”。"},"examples":[{"en":"The term “laparotrachelotomy” is not commonly found in standard medical dictionaries; clinicians usually say “tracheotomy” or “tracheostomy.”","zh":"“laparotrachelotomy”在常见医学词典中并不常见；临床上通常使用“tracheotomy（气管切开术）”或“tracheostomy（气管造口术）”。"},{"en":"If you saw this in a text, it may be a typo for “laryngotrachelotomy” or a mistaken blend of medical roots.","zh":"如果你在文章里看到这个词，它可能是“laryngotrachelotomy”的拼写错误，或是把多个医学词根错误混用造成的。"}]}],"synonyms":["tracheotomy","tracheostomy","trachelotomy"],"phonetic":"/ˌlæpəroʊˌtreɪkiˈlɑtəmi/","extraExplanation":["这个词看起来由三个部分拼成：laparo-（腹、腹腔）、trachelo-（常见有两种来源：trachea“气管”或 cervix/neck“颈/子宫颈”，容易混淆）、-tomy（切开）。因此整体结构不够“标准”，语义也可能不清楚。","更常见且规范的相关术语：tracheotomy（气管切开：做切口）、tracheostomy（气管造口：建立开口并维持通气）。如果你能提供它出现的句子或出处，我可以帮你判断它最可能指的是哪一个标准术语。"]}
{"word":"lapb","summary":{"en":"“lapb” is not a common English word; it’s likely an acronym or typo, and its meaning depends on context.","zh":"“lapb”不是常见英文单词；更可能是缩写或拼写错误，含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“lapb” is not a standard English word in common dictionaries. It is most likely an acronym, a typo, or a name/username, so its meaning depends on context.","zh":"“lapb”不是常见词典里的标准英文单词，更可能是缩写、拼写错误或名称/用户名；具体含义需要结合语境。"},"examples":[{"en":"I saw “lapb” in a message, but I couldn’t tell what it meant without more context.","zh":"我在一条信息里看到了“lapb”，但没有更多语境我无法判断它的意思。"},{"en":"Could you share the full sentence where “lapb” appears?","zh":"你能把包含“lapb”的完整句子发出来吗？"}]}],"phonetic":"/læp/","extraExplanation":["在一些技术或行业语境里，“LAPB”也可能是某个专有缩写（例如通信/网络相关术语），但必须看你出现它的场景（聊天、作业、论文、产品说明、代码等）才能确认。","如果你想查的是某个常见单词，可能是拼写误差：你可以告诉我你原本想表达的意思，或给我最接近的拼写/读音，我可以帮你匹配候选词。"]}
{"word":"lapboard","summary":{"en":"A lapboard is a flat board you place on your lap to support writing or a laptop.","zh":"lapboard 指放在膝上用来支撑写字或放笔记本电脑的平板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat board (often padded) that rests on your lap to support writing, a laptop, or other small tasks","zh":"（常带软垫的）膝上板；放在腿上用来写字、放笔记本电脑或做小任务的平板"},"examples":[{"en":"She used a lapboard to write notes on the train.","zh":"她用膝上板在火车上做笔记。"},{"en":"This lapboard makes it easier to use my laptop on the couch.","zh":"这个膝上板让我在沙发上用笔记本电脑更方便。"}]}],"synonyms":["lap desk","writing board","clipboard (similar, but usually held by hand)"],"phonetic":"/ˈlæp.bɔrd/","extraExplanation":["这个词是由 lap（大腿上/膝上）+ board（板）构成的合成词。日常生活里也常见说法是 lap desk（膝上书桌），有些产品会加上软垫、散热槽或小抽屉。"]}
{"word":"lapboards","summary":{"en":"Lapboards are flat boards used on your lap to support writing or other work; plural of lapboard.","zh":"Lapboards 指放在膝上用于支撑书写或其他操作的平板，是 lapboard 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat board or rigid surface placed on your lap to support writing, drawing, a laptop, sewing, etc.; the plural of “lapboard.”","zh":"放在膝上用来支撑书写、绘画、放置笔记本电脑或缝纫等的平板（lapboard 的复数）。"},"examples":[{"en":"In the meeting, I used one of the lapboards to take notes without a desk.","zh":"在会议上，我用了一块膝上书写板，没有桌子也能记笔记。"},{"en":"The teacher handed out lapboards so students could write during the museum tour.","zh":"老师发了膝上书写板，让学生在博物馆参观时也能写字。"},{"en":"She balanced her sketchbook on a lapboard while sitting on the floor.","zh":"她坐在地板上，把速写本放在膝上书写板上保持平稳。"}]}],"synonyms":["writing board","lap desk","portable writing board","clipboard (related)"],"phonetic":"/ˈlæpˌbɔrd/","extraExplanation":["“lapboard”在英语里多指便携的“膝上书写板/托板”，常见于没有桌子的场景（户外、课堂参观、会议临时座位等）。有时也会与“clipboard（夹板）”混用，但lapboard强调“放在膝上支撑”，clipboard强调“夹住纸张便于站着写”。"]}
{"word":"lapcock","summary":{"en":"“Lapcock” is an old or regional word for a lapwing, especially a male lapwing.","zh":"“lapcock”是较古老或地方性的说法，指凤头麦鸡（lapwing），尤指雄鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lapwing (a ground-nesting bird), especially the male; an old-fashioned or regional name.","zh":"凤头麦鸡（lapwing，一种在地面筑巢的鸟），尤指雄鸟；较古老或地方性的称呼。"},"examples":[{"en":"In some older countryside writing, a lapwing may be called a “lapcock.”","zh":"在一些较早的乡村写作中，lapwing（凤头麦鸡）可能会被称作“lapcock”。"},{"en":"The lapcock’s cry was described as sharp and restless over the wet fields.","zh":"有人描写那只lapcock在潮湿的田野上方发出尖锐、躁动的叫声。"}]}],"synonyms":["lapwing","peewit"],"phonetic":"/ˈlæpˌkɑk/","extraExplanation":["“lapcock”属于较少见的词，多见于英式乡村语境、旧文学或方言记录。“cock”在鸟类名称里常表示“雄的”（如cock pheasant 雄雉），所以“lapcock”可理解为“雄的lapwing”。现代英语里通常直接用“lapwing”。"]}
{"word":"lapdog","summary":{"en":"A lapdog is either a small pet dog kept on someone’s lap, or (disapproving) a person who blindly obeys someone more powerful.","zh":"lapdog既指能坐在膝上的小型宠物犬，也可贬义指对更有权势者盲从、唯命是从的人（走狗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dog kept as a pet, often sitting on someone’s lap","zh":"（常坐在人膝上、被当作宠物饲养的）小型宠物犬"},"examples":[{"en":"She has a tiny lapdog that follows her everywhere.","zh":"她养了一只小小的宠物犬，走到哪儿都跟着她。"},{"en":"The lapdog curled up on his lap during the movie.","zh":"看电影时，那只小狗蜷缩在他腿上。"}]},{"partOfSpeech":"n.","definition":{"en":"(disapproving) a person who shows unquestioning loyalty to a more powerful person or group and does what they want","zh":"（贬义）走狗；唯命是从的人；听命于强者的人"},"examples":[{"en":"Critics said the reporter was a lapdog for the government.","zh":"批评者说那名记者是政府的“走狗”。"},{"en":"He refused to be a lapdog and speak only what his boss wanted to hear.","zh":"他拒绝当唯命是从的人，只说老板想听的话。"}]}],"synonyms":["small dog","toy dog","pet","yes-man","toady","lackey"],"phonetic":"/ˈlæp.dɔɡ/","extraExplanation":["“lapdog”作比喻用法时语气很负面，常用于政治、媒体、职场等语境，强调“缺乏独立性、讨好权力”。与中文“走狗/鹰犬”在情感色彩上相近。"]}
{"word":"lapdogs","summary":{"en":"Lapdogs are small companion dogs; figuratively, it can mean a person who obediently serves someone powerful (often negatively).","zh":"lapdogs 指小型陪伴犬；也可作贬义比喻，指对权势者过分顺从的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pet dog kept mainly for companionship, often sitting on a person’s lap","zh":"（常坐在主人腿上、主要作陪伴的）小型宠物犬、膝上犬"},"examples":[{"en":"Her grandmother keeps two lapdogs and treats them like family.","zh":"她奶奶养了两只膝上犬，把它们当家人一样疼爱。"},{"en":"The café allows lapdogs as long as they stay quiet.","zh":"这家咖啡馆允许带小型宠物犬进入，只要它们保持安静。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, often negative) a person who obeys someone in power too willingly; a sycophant","zh":"（比喻，常带贬义）对有权势的人言听计从的人；马屁精；走狗"},"examples":[{"en":"Critics called the reporter a lapdog for repeating the official story.","zh":"批评者称那位记者是“走狗”，因为他照搬官方说法。"},{"en":"He refused to be a lapdog for his boss.","zh":"他拒绝当老板的走狗。"}]}],"synonyms":["toy dog","companion dog","pet dog","yes-man","sycophant","toady","lackey"],"phonetic":"/ˈlæpˌdɔɡ/","extraExplanation":["“lapdog”本义是“膝上犬”，来自“lap（大腿、膝部）+ dog（狗）”。在英语文化里，小型犬常被看作需要照顾、依赖主人的宠物，因此引申出贬义：形容对权势人物过度顺从、缺乏独立判断的人。","复数“lapdogs”常见于描述一群被宠爱的小狗，或在政治/媒体语境中批评某些人对权力机构过于听命。"]}
{"word":"lapeirousia","summary":{"en":"Lapeirousia is a plant genus in the iris family, mainly from southern Africa.","zh":"Lapeirousia 是鸢尾科的一个植物属，主要分布于非洲南部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the iris family (Iridaceae), mostly native to southern Africa","zh":"一种鸢尾科（Iridaceae）的开花植物属，主要原产于非洲南部"},"examples":[{"en":"Lapeirousia species often grow from corms and produce bright, iris-like flowers.","zh":"Lapeirousia 属的植物常由球茎生长，开出色彩鲜艳、类似鸢尾的花。"},{"en":"Some gardeners plant Lapeirousia for its showy spring blooms.","zh":"一些园艺爱好者会种植 Lapeirousia，因为它春季开花很抢眼。"}]}],"synonyms":["genus Lapeirousia","Iridaceae (family)"],"phonetic":"/ˌlæpɪˈruːziə/","extraExplanation":["“Lapeirousia”是拉丁化的学名，用于生物分类；在日常英语中多出现在植物学、园艺或自然科普语境里。","该属名通常被认为是为纪念法国博物学家 Philippe-Isidore Picot de Lapeyrouse（拉佩鲁兹/拉佩鲁斯）而命名的。"]}
{"word":"lapel","summary":{"en":"A lapel is the folded-back front part of a jacket or coat, below the collar.","zh":"lapel 指西装或外套领口下方、向外翻折的前襟翻领部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the part of a jacket or coat that folds back on the front, just below the collar","zh":"（西装或外套的）翻领；领口向外翻折的部分"},"examples":[{"en":"He straightened his tie and smoothed his lapel before the interview.","zh":"面试前，他理了理领带，又把翻领抚平。"},{"en":"A small pin was attached to her lapel.","zh":"她的翻领上别着一枚小胸针。"}]}],"synonyms":["jacket lapel","coat lapel","collar (related, but not the same)"],"phonetic":"/ləˈpɛl/","extraExplanation":["“lapel”常见于西装、夹克、大衣等正式或半正式服装语境。常见搭配有：lapel pin（领针/胸针）、lapel microphone / lavalier mic（领夹麦克风）、notch lapel（平驳领/缺口驳头）、peak lapel（戗驳领/尖驳头）、shawl lapel（青果领）。","词源上与“fold（折叠）”的概念有关：翻领就是衣服前片向外“翻折”形成的部分。"]}
{"word":"lapeled","summary":{"en":"“lapeled” is usually a misspelling of “labeled/labelled,” meaning “marked with a label” or “described/classified with a name.”","zh":"“lapeled”通常是“labeled/labelled”的拼写错误，意思是“贴了标签的”或“用某个名称来描述/归类（贴标签）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Common misspelling) Past tense/past participle of “label”: to attach a label to something or to describe/classify something with a name.","zh":"（常见拼写错误）“label”的过去式/过去分词：给某物贴标签；或用某个名称来描述/归类某人或某物。"},"examples":[{"en":"The boxes were labeled by room to make moving easier.","zh":"这些箱子按房间贴了标签，搬家更方便。"},{"en":"He was labeled as “lazy,” which wasn’t fair.","zh":"他被贴上“懒惰”的标签，这并不公平。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a label attached; marked with a label.","zh":"贴有标签的；带标签的。"},"examples":[{"en":"Please put the labeled jars back on the shelf.","zh":"请把贴好标签的罐子放回架子上。"},{"en":"Use only labeled containers for chemicals.","zh":"化学品只能使用带标签的容器。"}]}],"synonyms":["tagged","marked","classified","branded"],"phonetic":"/ˈleɪbəld/","extraExplanation":["“lapeled”通常是把“labeled / labelled”拼错了。美式英语更常用 **labeled**，英式英语常用 **labelled**（双写 l）。两者意思相同。","动词 **label** 不仅是“贴标签”，也常指“给人/事物下定义、贴标签（有时带负面含义）”，例如 *label someone as…*。"]}
{"word":"lapeler","summary":{"en":"Lapel means the folded part of a jacket or coat below the collar; by extension it can refer to attaching something (like a pin or mic) to that spot.","zh":"lapel 指外套或西装领口下方翻折的“翻领”；也可引申为把徽章或领夹麦克风等别在翻领处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a folded flap of cloth on the front of a jacket or coat, below the collar","zh":"（西装/外套的）翻领，领口翻折部分"},"examples":[{"en":"He wore a small flag pin on his lapel.","zh":"他在翻领上别了一枚小国旗徽章。"},{"en":"Please fold the lapel neatly before you sew the button on.","zh":"缝扣子之前，请把翻领折整齐。"}]},{"partOfSpeech":"v.","definition":{"en":"to show or attach something on a jacket’s lapel (often pins, badges, or small microphones)","zh":"把某物别在翻领上；在翻领处佩戴/安装（如徽章、领夹麦克风）"},"examples":[{"en":"The presenter lapel-mic’d his jacket before going on stage.","zh":"主持人在上台前把领夹麦克风夹在了西装翻领上。"},{"en":"Many employees lapel-pin their company badge at work.","zh":"很多员工上班时会把公司徽章别在翻领上。"}]}],"synonyms":["collar (related)","jacket front (related)","lapel pin (common phrase)","lapel mic (common phrase)"],"phonetic":"/ləˈpɛl/","extraExplanation":["“lapeler”不是常见的英语单词，最可能是你想查的“lapel”（翻领）。如果你是想表达“做翻领的人/翻领工”，英语更常说 *tailor*（裁缝）或用更具体的说法，如 *collar maker*（做领子/领口的人），但不常用“lapeler”。"]}
{"word":"lapelled","summary":{"en":"“Lapelled” describes clothing that has lapels; it can also mean adding lapels to a garment (rare).","zh":"“lapelled”指衣服“有翻领的”；也可作动词表示“给衣服加/做翻领”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a jacket, coat, etc.) having lapels (the folded flaps of cloth on the front).","zh":"（夹克、外套等）有翻领的（翻领指前襟向外翻折的布片）。"},"examples":[{"en":"He wore a dark, lapelled coat to the ceremony.","zh":"他在仪式上穿了一件深色的有翻领外套。"},{"en":"A lapelled blazer looks more formal than a collarless one.","zh":"有翻领的西装外套通常比无领款更正式。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add or make lapels on (a garment).","zh":"给（衣服）加上或做出翻领。"},"examples":[{"en":"The tailor lapelled the jacket to match the vintage style.","zh":"裁缝给这件夹克做了翻领，以符合复古风格。"}]}],"synonyms":["lapeled","with lapels","notched-lapel (type)","peaked-lapel (type)"],"phonetic":"/ləˈpɛld/","extraExplanation":["“lapelled”多见于英式拼写；美式更常写作“lapeled”（同义，都是“有翻领的”）。在服装描述里，这个词常用来区分“有翻领（lapelled）”和“无领/立领（collarless / stand-collar）”的款式。"]}
{"word":"lapels","summary":{"en":"Lapels are the folded front flaps on a jacket or coat, below the collar.","zh":"lapels 指外套或西装领口下方前襟向外翻折的两片翻领。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The folded flaps of cloth on the front of a jacket or coat, below the collar.","zh":"（西装或外套）领口下方前襟向外翻折的部分；翻领（lapel）"},"examples":[{"en":"His suit had wide lapels, popular in the 1970s.","zh":"他的西装翻领很宽，这是20世纪70年代流行的款式。"},{"en":"She pinned a small flower to her lapel.","zh":"她把一朵小花别在翻领上。"}]}],"synonyms":["jacket lapels","coat lapels","revers"],"phonetic":"/ləˈpɛlz/","extraExplanation":["“Lapel”常见于正式服装语境，尤其是西装外套（suit jacket/blazer）和大衣（coat）。常见搭配：wide/narrow lapels（宽/窄翻领）、notch lapel（平驳领）、peak lapel（尖驳领）、shawl lapel（青果领）。","“Lapels”是复数形式，因为一件外套通常有左右两片翻领；单数“a lapel”多用于说其中一边，或指在翻领上别的东西（on the lapel）。"]}
{"word":"lapful","summary":{"en":"A lapful is the amount that can fill your lap, often meaning a large heap carried or held at once.","zh":"lapful 指能装满膝上的一兜量，常泛指一次抱着/捧着的一大堆东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quantity that fills your lap (the area on your thighs when you sit); by extension, a large amount held or gathered at once","zh":"一“腿兜”的量（坐着时大腿形成的空间）；引申为一次能抱住或捧住的一大把/一大堆"},"examples":[{"en":"She carried a lapful of laundry to the bedroom.","zh":"她抱着一大堆衣服走进卧室。"},{"en":"The child sat with a lapful of toys.","zh":"孩子坐着，腿上堆满了玩具。"},{"en":"He gathered a lapful of fallen leaves.","zh":"他捧起一大把落叶。"}]}],"synonyms":["armful","handful","bundle","heap"],"phonetic":"ˈlæpˌfʊl","extraExplanation":["“lapful”由 lap（膝上、大腿间）+ -ful（“装满……的量”，如 handful, spoonful）构成，语气比较形象、带画面感。","现代英语里更常用于可数的“具体一堆东西”（衣物、玩具、树叶等）；比喻用法也有，但不如“a lot / a bunch”常见。"]}
{"word":"lapfuls","summary":{"en":"“Lapfuls” means several amounts that can be held in someone’s lap.","zh":"“lapfuls”指“几腿的量/一腿一腿的东西”，即能放在膝上的数量（复数强调很多份）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “lapful”: the amount that can be held in someone’s lap (often used to mean a large, loosely held quantity).","zh":"“lapful”的复数：一腿（大腿上/膝上）能盛下的量（常用来表示一大把、随意抱着的一堆）。"},"examples":[{"en":"She gathered lapfuls of fallen leaves and carried them to the compost pile.","zh":"她抱起一腿一腿的落叶，运到堆肥堆那里。"},{"en":"The child came inside with lapfuls of toys.","zh":"孩子抱着一腿一腿的玩具走进屋里。"}]}],"synonyms":["armfuls","handfuls","loads"],"phonetic":"/ˈlæp.fəlz/","extraExplanation":["“lapful”由“lap（膝上/大腿上）+ -ful（满……的量）”构成，像“handful（一把）”“armful（一抱）”一样，表示“能装满某个部位/容器的量”。复数“lapfuls”强调次数或份数很多。","这个词多用于叙述动作画面（抱、捧、拢起），常见搭配：lapfuls of leaves/sand/books/toys 等。正式写作里较少见，更偏口语或描写性文字。"]}
{"word":"lapiaz","summary":{"en":"a grooved, dissolved limestone surface in karst terrain.","zh":"喀斯特地区被溶蚀出沟槽的石灰岩地表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a limestone surface that has been dissolved by rainwater, leaving grooves, ridges, and sharp channels; a type of karst landform (often called a limestone pavement).","zh":"一种喀斯特地貌：石灰岩地表被雨水（弱酸性）溶蚀后形成的沟槽、脊状凸起与尖锐裂隙；常见于“石灰岩铺地/石灰岩地表”。"},"examples":[{"en":"The hikers crossed a lapiaz where the limestone was cut into deep grooves.","zh":"徒步者穿过一片 lapiaz，那里的石灰岩被切割成很深的沟槽。"},{"en":"Lapiaz forms in karst regions where slightly acidic rainwater dissolves limestone.","zh":"在喀斯特地区，微酸性的雨水溶解石灰岩，会形成 lapiaz。"},{"en":"The field guide warned that walking on lapiaz can be slippery after rain.","zh":"野外指南提醒：下雨后在 lapiaz 上行走可能很滑。"}]}],"synonyms":["limestone pavement","karren","karst pavement"],"phonetic":"/læˈpiˌɑː/","extraExplanation":["发音与拼写：英语里更常见的相关术语是 karst（喀斯特）与 limestone pavement（石灰岩铺地）。lapiaz 属于更“专业/地质学”用词，在学术写作、地貌描述或野外报告里更常见。","相关概念：lapiaz 常由溶蚀作用（solution）沿裂隙发展，形成沟（grooves）、溶沟（runnels）与石脊（ridges）；在一些资料中也与 karren（溶蚀小地形的统称）有重叠。"],"etymology":"源自法语 lapiaz / lapiés（指被溶蚀的石灰岩地表）。在地质学中借用来命名一种典型的喀斯特溶蚀地形。","mnemonic":["把它联想成“la-（拉）+pia(z)”≈“拉开一片”，想象石灰岩地表被雨水“拉开”成一道道沟槽。","联想法语来源：看到像法语的拼写（-iaz），提示这是地貌学里的外来术语，多半和欧洲喀斯特地形描述有关。"]}
{"word":"lapicide","summary":{"en":"A lapicide is a stonecutter or stonemason.","zh":"lapicide 指切石工/石匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cuts, carves, or shapes stone; a stonecutter (especially one who works stone for buildings or monuments)","zh":"切石工；石匠（尤指为建筑或纪念碑加工石材的人）"},"examples":[{"en":"The old cathedral was restored by a team of lapicides and carpenters.","zh":"这座古老的大教堂由一支石匠和木匠团队修复。"},{"en":"A skilled lapicide can carve letters that last for centuries on a gravestone.","zh":"熟练的石匠能在墓碑上刻出可保存数百年的字。"}]}],"synonyms":["stonecutter","stonemason","mason","lapidary"],"phonetic":"/ˈlæpɪsaɪd/","extraExplanation":["这个词很少见，日常英语里更常用 stonecutter、stonemason 或 mason。","词源上 lap- 来自拉丁语 lapis（“石头”）。虽然拼写上像 -cide（“杀…”的人/物”，如 pesticide），但 lapicide 的含义不是“杀石头”，而是指“加工石头的人”。因此看到它时不要按 -cide 的常见构词去猜。"]}
{"word":"lapidarian","summary":{"en":"Lapidarian refers to stone or gemstone work (or stone inscriptions), and can also mean a gem-cutter.","zh":"Lapidarian 指与石头/宝石加工相关（或与石刻铭文相关），也可指宝石加工师。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Relating to stone, gemstones, or the cutting and engraving of stone.","zh":"（形容词）与石头、宝石有关的；与切割、雕刻石材有关的。"},"examples":[{"en":"The museum displayed lapidarian tools used to cut and polish gems.","zh":"博物馆展出了用于切割和打磨宝石的宝石加工工具。"},{"en":"She took a lapidarian class to learn how to shape small stones into jewelry.","zh":"她参加了宝石加工课程，学习如何把小石头打造成首饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) Written on stone; dealing with inscriptions carved in stone (often in an ancient or historical context).","zh":"（形容词）刻在石头上的；与石刻铭文研究相关的（多用于古代或历史语境）。"},"examples":[{"en":"The scholar published a lapidarian study of Roman tomb inscriptions.","zh":"这位学者发表了关于罗马墓碑铭文的石刻研究。"},{"en":"Many lapidarian texts survive because stone lasts longer than paper.","zh":"许多石刻文字能够保存下来，是因为石头比纸更耐久。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A person who cuts, polishes, or engraves gemstones; a gem-cutter.","zh":"（名词）宝石加工者；切割、打磨或雕刻宝石的人。"},"examples":[{"en":"A skilled lapidarian can reveal a stone’s sparkle through careful cutting.","zh":"熟练的宝石加工师能通过精细切割展现宝石的光彩。"},{"en":"He apprenticed with a lapidarian to learn traditional gem-cutting techniques.","zh":"他跟随一位宝石加工师当学徒，学习传统的宝石切割技法。"}]}],"synonyms":["lapidary","gem-cutting","stone-carved","inscribed","epigraphic"],"phonetic":"/ˌlæpɪˈdɛriən/","extraExplanation":["“lapidarian”来自拉丁语 *lapis*（石头）。英语里更常见的相关词是 **lapidary**（既可作形容词“与宝石/石材加工有关的”，也可作名词“宝石加工师”）。","在学术语境中，“lapidarian inscriptions / lapidarian texts”常指“石刻铭文/石刻文字”，与考古、古典学、碑刻学（epigraphy）有关。"]}
{"word":"lapidaries","summary":{"en":"Lapidaries are gem-cutters or stone engravers; the word can also refer (less commonly) to the craft or works of gem/stone cutting.","zh":"Lapidaries 指“宝石切磨/石刻工匠”；也可（较少见）指宝石切磨工艺或作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who cut, shape, and polish precious stones (gems) or decorative stones","zh":"宝石/观赏石的切割、雕琢与抛光工匠；宝石匠"},"examples":[{"en":"The museum hired skilled lapidaries to restore the damaged gemstones.","zh":"博物馆雇了技艺高超的宝石匠来修复受损的宝石。"},{"en":"Local lapidaries sell hand-polished stones at the weekend market.","zh":"当地的宝石匠在周末集市上出售手工抛光的石头。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the craft or products of cutting and engraving stone, especially gems","zh":"（较少见）宝石切磨工艺；宝石切磨作品"},"examples":[{"en":"The exhibition included lapidaries from the Roman period.","zh":"展览包含了罗马时期的宝石雕刻作品。"}]}],"synonyms":["gem cutters","stonecutters","stone engravers"],"phonetic":"ˈlæpɪˌdɛriz","extraExplanation":["词源来自拉丁语 lapis（“石头”），所以 lapidary 与“石”有关；复数形式为 lapidaries。","注意：lapidary 也常作形容词，表示“与宝石/石刻有关的”；在写作里还可指“简洁有力的表达”（lapidary style），源于石碑铭文通常短而精炼。"]}
{"word":"lapidarist","summary":{"en":"A lapidarist is a craftsperson who cuts and polishes gemstones.","zh":"lapidarist 指从事宝石切割与抛光等加工的工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who cuts, polishes, or engraves gemstones (and sometimes other decorative stones).","zh":"宝石切磨师；宝石雕刻/打磨匠（也可指加工装饰性石材的人）。"},"examples":[{"en":"The lapidarist examined the rough opal and planned the best way to cut it.","zh":"宝石切磨师检查了这块粗糙的欧泊，并规划了最佳切割方式。"},{"en":"She apprenticed with a lapidarist to learn how to polish stones without cracking them.","zh":"她跟随一位宝石切磨师当学徒，学习如何在不让宝石开裂的情况下抛光。"}]}],"synonyms":["gem cutter","stonecutter","lapidary (person)"],"phonetic":"/ˈlæpɪˌdɛrɪst/","extraExplanation":["“lapidarist”来自拉丁语 lapis（石头）。在英语里常与 lapidary（宝石加工的；简洁有力的文风）同源，但含义不同：lapidarist 主要指“做宝石加工的人”，而 lapidary 既可指相关职业/技艺，也可指“措辞精炼的”。","在珠宝语境中，lapidarist 往往不仅是“切割”，还包括打磨（polish）、刻面（facet）、雕刻（carve/engrave）等工序；与 jeweler（珠宝商/珠宝匠，偏制作与镶嵌）有所区分。"]}
{"word":"lapidary","summary":{"en":"Lapidary means “related to cutting and polishing gemstones,” a “gem-cutter,” or (of writing) “elegant and concise.”","zh":"lapidary 可指“与宝石切磨雕刻有关的”、 “宝石加工师”，也可形容文风“简洁精炼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the cutting, polishing, or engraving of gemstones; also describing a person who does this work.","zh":"与宝石（或半宝石）的切割、打磨、雕刻有关的；也可指从事此类工作的工匠。"},"examples":[{"en":"She took a lapidary class to learn how to polish stones.","zh":"她上了一门宝石加工课，学习如何打磨石头。"},{"en":"The museum displayed lapidary art made from jade and agate.","zh":"博物馆展出了用玉和玛瑙制作的宝石雕刻艺术品。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who cuts, polishes, or engraves gemstones.","zh":"宝石加工师；宝石切磨匠。"},"examples":[{"en":"A skilled lapidary can reveal a stone’s hidden color and sparkle.","zh":"熟练的宝石切磨匠能展现石头隐藏的色泽与光彩。"},{"en":"He apprenticed under a lapidary for three years.","zh":"他在一位宝石加工师门下当了三年学徒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Elegant and concise in wording (especially of writing or speech).","zh":"（尤指文字或言谈）简洁而精炼、言简意赅的。"},"examples":[{"en":"Her lapidary style makes complex ideas easy to remember.","zh":"她精炼的文风让复杂观点更容易记住。"},{"en":"He answered in a lapidary sentence: “Facts first.”","zh":"他用一句精炼的话回答：“事实优先。”"}]}],"synonyms":["(gem-related) gemstone-cutting","(person) gem-cutter","(concise style) concise","terse","succinct"],"phonetic":"/ˈlæpɪˌdɛri/","extraExplanation":["“lapidary”来自拉丁语 lapis（石头）。它最早与“石头/宝石的加工与雕刻”有关，因此引申出“像雕刻在石头上一样简练、经得起推敲”的文风含义。","常见搭配：lapidary work（宝石加工/雕刻工作），lapidary arts（宝石雕刻艺术），lapidary style/prose（简练的文风）。"]}
{"word":"lapidate","summary":{"en":"Lapidate means to stone someone to death (or punish by throwing stones). It can rarely mean to decorate or cover with small stones.","zh":"lapidate 指用乱石砸死/以掷石惩罚（“石刑”）；极少数情况下也可指用小石子铺面或装饰。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to kill or punish someone by throwing stones at them (usually as a public punishment)","zh":"用乱石砸死；以掷石的方式处死或惩罚（常指公开的刑罚）"},"examples":[{"en":"In some historical accounts, criminals were lapidated in public as a warning to others.","zh":"在一些历史记载中，罪犯会被当众用乱石砸死，以儆效尤。"},{"en":"The novel describes a woman who feared she would be lapidated for breaking a strict rule.","zh":"小说描写一名女子因触犯严苛规定而担心会被乱石砸死。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to cover or decorate a surface with small stones","zh":"（罕见）用小石子铺面；以石子装饰表面"},"examples":[{"en":"The garden path was lapidated with smooth pebbles to create a natural look.","zh":"花园小径用光滑卵石铺面，营造自然的感觉。"}]}],"synonyms":["stone (to death)","execute by stoning","pelt with stones"],"phonetic":"/ˈlæpɪˌdeɪt/","extraExplanation":["这个词较正式、偏书面，日常英语更常用短语 be stoned to death（被乱石砸死）或 stone someone（用石头砸某人；处以“石刑”）。","词源与拉丁语 lapis（石头）有关；因此也会出现少见的“用石子铺面/装饰”的引申义，但在现代语境中最常见、最敏感的是“石刑/乱石致死”的意思。","涉及宗教法、历史惩罚或人权议题时会出现；表达时注意语境与文化敏感度。"]}
{"word":"lapidated","summary":{"en":"Lapidated is a rare word meaning either “stoned to death” or “decorated with stones/gems,” depending on context.","zh":"Lapidated 是个较罕见的词，可指“被投石处死”，也可指“镶嵌/装饰有宝石（石头）”，需结合语境判断。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Stoned to death; punished by throwing stones at someone.","zh":"（罕见）被乱石砸死；用投石的方式处死或惩罚。"},"examples":[{"en":"In some ancient accounts, the criminal was lapidated by the crowd.","zh":"在一些古代记载中，罪犯被人群用乱石砸死。"},{"en":"The novel describes a man who was lapidated for breaking a sacred law.","zh":"小说描写了一名男子因触犯神圣戒律而被乱石处死。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Decorated or set with stones or gems.","zh":"（罕见）用宝石/石头装饰的；镶嵌宝石的。"},"examples":[{"en":"She wore a lapidated belt that glittered under the lights.","zh":"她系着一条镶嵌宝石的腰带，在灯光下闪闪发亮。"},{"en":"The crown was richly lapidated with small rubies.","zh":"王冠上镶满了小红宝石，十分华丽。"}]}],"synonyms":["stoned","stoned to death","pelted (with stones)","gem-studded","jeweled","bejeweled","ornamented"],"phonetic":"/ˈlæpɪˌdeɪtɪd/","extraExplanation":["“lapidated”来自动词“lapidate”，源于拉丁语 *lapis*（石头）。在现代英语里更常见的相关词是 **stone (to death)**（用石头砸死）和 **lapidary**（宝石切磨/与宝石有关的）。","宗教或历史文本中偶尔会提到“lapidation”（投石处死）。在现实语境里谈到相关话题时，表达通常更直接：**was stoned** / **was stoned to death**。"]}
{"word":"lapidates","summary":{"en":"“Lapidate” most commonly means “to stone someone to death.”","zh":"“lapidate”最常见的意思是“用石头砸死（某人）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to stone someone to death; to throw stones at a person as a form of punishment","zh":"用石头砸死（某人）；以掷石作为惩罚"},"examples":[{"en":"In some historical accounts, criminals were lapidated in public as a harsh punishment.","zh":"在一些历史记载中，罪犯会被当众用石头砸死，作为严厉的惩罚。"},{"en":"The novel mentions a character who feared being lapidated for breaking a strict rule.","zh":"小说里提到一个角色因违反严苛规则而害怕被乱石砸死。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) relating to stones or stone-cut inscriptions","zh":"（罕见）与石头或石刻铭文有关的"},"examples":[{"en":"The museum displayed lapidate inscriptions from ancient tombs.","zh":"博物馆展出了来自古墓的石刻铭文。"}]}],"synonyms":["stone (to death)","pelt (with stones)","lapidation","stoning"],"phonetic":"/ˈlæpɪˌdeɪt/","extraExplanation":["“lapidate”来自拉丁语 lapis（石头）。在英语里最常见的用法是指“用石头砸死”，带有强烈的暴力与法律/宗教惩罚语境，写作或交流时需注意场合与敏感度。","相关词：lapidation（n. 乱石砸死的行为）；stoning（更常用的表达）。"]}
{"word":"lapidating","summary":{"en":"Lapidating means throwing stones at someone, especially as punishment; it can also (rarely) mean harshly condemning someone with words.","zh":"lapidating 指向某人投石，尤指作为惩罚的乱石砸（处死）；也可（较少用）比喻用言语猛烈谴责。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"throwing stones at (someone), especially as a form of punishment; stoning.","zh":"（向某人）投石，尤指作为惩罚的“乱石砸（处死）”。"},"examples":[{"en":"The prisoner was accused of a crime that, in some times and places, led to lapidating.","zh":"这名囚犯被指控的罪行，在某些时代和地区可能会导致被乱石砸死。"},{"en":"The film shows a community lapidating a man as a public punishment.","zh":"电影展示了一个社区以公开惩罚的方式用乱石砸死一名男子。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, rare) attacking someone with harsh words; condemning strongly.","zh":"（比喻，较少用）用尖刻言辞攻击；强烈谴责。"},"examples":[{"en":"Online commenters were lapidating the coach after the loss.","zh":"输球后，网友们用尖刻的话猛烈抨击那位教练。"}]}],"synonyms":["stoning","pelted with stones","pelting","condemning","denouncing"],"phonetic":"/ˈlæpɪˌdeɪtɪŋ/","extraExplanation":["“lapidating”是动词“lapidate”的现在分词/动名词形式，词根来自拉丁语 lapis（石头）。","它常用于讨论历史或宗教背景中的“乱石刑/投石处死”（stoning）。这是一个涉及暴力与人权的敏感话题，现代语境中多用于描述或批判而非赞同。"]}
{"word":"lapidation","summary":{"en":"Lapidation usually means killing by stoning; more rarely, it can mean working or polishing stone.","zh":"Lapidation 通常指“乱石处死/石刑”；较少见时也可指“石材加工/打磨”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of killing someone by throwing stones at them; stoning.","zh":"用石头砸死（某人）的行为；石刑（乱石处死）。"},"examples":[{"en":"In some historical accounts, lapidation was used as a punishment for certain crimes.","zh":"在一些历史记载中，石刑曾被用作对某些罪行的惩罚。"},{"en":"The novel mentions a trial that ends in lapidation, showing how brutal the justice system was.","zh":"小说提到一场审判最终以石刑收场，体现了当时司法制度的残酷。"}]},{"partOfSpeech":"n.","definition":{"en":"In older or technical writing, the act or method of working, shaping, or polishing stones (stone-cutting).","zh":"（较旧或较专业）对石头进行加工、雕琢或打磨的方法；石材加工。"},"examples":[{"en":"The museum label used the word lapidation to describe early stone-working techniques.","zh":"博物馆说明牌用 lapidation 来描述早期的石材加工技术。"},{"en":"This meaning is rare in everyday English; most readers think of stoning.","zh":"这个意思在日常英语中很少见；大多数人会想到“乱石处死”。"}]}],"synonyms":["stoning","execution by stoning","stone-working","stone cutting"],"phonetic":"/ˌlæpəˈdeɪʃən/","extraExplanation":["词源提示：lapidation 来自拉丁语 lapis（“石头”）。因此它既能指“用石头处死”，也能在较少见的语境中指“石头加工”。","语用提醒：现代英语里 lapidation 往往出现在法律/宗教历史、新闻报道或学术写作中；日常表达通常用 stoning。涉及宗教或文化背景时，使用时应保持客观、中立的叙述方式。"]}
{"word":"lapidator","summary":{"en":"A lapidator is a person who cuts and polishes gemstones; a less common word for “lapidary.”","zh":"lapidator 指宝石切磨师，是“lapidary”的较少见说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cuts, shapes, or polishes gemstones (a gem cutter); a lapidary","zh":"宝石切磨师；宝石加工匠（同 lapidary）"},"examples":[{"en":"The lapidator cut the rough stone into a sparkling oval gem.","zh":"这位宝石切磨师把原石切磨成一颗闪亮的椭圆形宝石。"},{"en":"At the workshop, a lapidator showed students how to polish quartz safely.","zh":"在工作坊里，一位宝石加工匠向学生演示如何安全地抛光石英。"},{"en":"She apprenticed under a skilled lapidator before opening her own studio.","zh":"在开设自己的工作室之前，她曾在一位技艺高超的宝石切磨师门下当学徒。"}]}],"synonyms":["lapidary","gem cutter","stone cutter","gem polisher"],"phonetic":"/ˈlæpɪˌdeɪtər/","extraExplanation":["“lapidator”较少见，更常用的词是“lapidary”（既可作名词“宝石切磨师”，也可作形容词“与宝石雕磨有关的 / 简洁精炼的”）。","词源来自拉丁语 lapis（“石头”），因此常与宝石、石材雕磨相关的语境一起出现。"]}
{"word":"lapideon","summary":{"en":"“Lapideon” is not a standard English word; it may be a misspelling of “lapidation” or “lapidary.”","zh":"“lapideon”不是标准英语单词；可能是“lapidation”或“lapidary”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “lapidation” (stoning) or “lapidary” (relating to cutting/polishing stones; or a person who does this).","zh":"不是标准英语单词。很可能是拼写错误，原意可能是“lapidation”（乱石投死/以石刑处死）或“lapidary”（与宝石切磨有关的；宝石切磨师）。"},"examples":[{"en":"I couldn’t find “lapideon” in a dictionary—did you mean “lapidation” or “lapidary”?","zh":"我在词典里找不到“lapideon”——你是不是想写“lapidation”或“lapidary”？"},{"en":"The article mentioned lapidation as a historical punishment.","zh":"那篇文章提到“lapidation”作为一种历史上的刑罚。"},{"en":"She bought a lapidary saw to cut small gemstones.","zh":"她买了一把宝石切磨用的锯（lapidary saw）来切小宝石。"}]}],"phonetic":"/ˌlæpɪˈdiːɑn/","extraExplanation":["“lapi-”常见于源自拉丁语 lapis（石头）的词根：例如 lapidary（与宝石切磨/雕刻有关），lapidation（用石头处死）。","如果你告诉我“lapideon”出现的句子或语境（例如游戏名、人名、品牌名、小说里的词），我可以更准确判断它到底指什么。"]}
{"word":"lapideous","summary":{"en":"Lapideous means “stone-like” or “stony,” often used in rare or literary writing.","zh":"lapideous 意为“像石头的/石质的”，多见于较少见或文学性的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary) Like stone; stony in appearance, texture, or hardness.","zh":"（罕见/文学用语）像石头的；石质的；外观、质地或硬度如石一般的。"},"examples":[{"en":"The statue’s lapideous surface felt cold and rough to the touch.","zh":"雕像的石质表面摸起来又冷又粗糙。"},{"en":"Her lapideous expression revealed no emotion.","zh":"她那如石般的表情毫无情绪波动。（比喻用法）"},{"en":"We walked through a lapideous landscape of cliffs and boulders.","zh":"我们走过一片岩石嶙峋、满是峭壁与巨石的地貌。"}]}],"synonyms":["stony","stone-like","rocky","petrified","lapidary"],"phonetic":"/ləˈpɪdiəs/","extraExplanation":["词源上与拉丁语 lapis（“石头”）有关，因此常见联想词有 lapidary（宝石切磨/刻石的；与宝石有关的）和 dilapidated（破败的，原义含“像石头崩落一样”）。","lapideous 在现代英语中非常少见，多见于描写自然景观、雕塑材质或带有“冷硬、无情”比喻色彩的文学语境；日常表达更常用 stony / stone-like / rocky。"]}
{"word":"lapides","summary":{"en":"“Lapides” is a Latin plural meaning “stones,” often used in medical contexts to mean bodily stones (calculi).","zh":"“lapides”是拉丁语复数，意为“石/结石”，多用于医学语境指体内结石（calculi）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin, used in English mainly in medical or academic writing) stones; small hard masses (calculi), often in the body (such as kidney or gall stones).","zh":"（拉丁语词，英语中多用于医学/学术语境）“石”；指坚硬的小块（结石），常见于人体内，如肾结石、胆结石。"},"examples":[{"en":"The report mentioned lapides in the kidney (renal stones).","zh":"报告提到肾脏内有 lapides（肾结石）。"},{"en":"In older medical Latin, lapides can refer to stones found in the bladder.","zh":"在较旧的医学拉丁语中，lapides 可指膀胱内发现的结石。"}]}],"synonyms":["stones","calculi","concretions"],"phonetic":"ˈlæpɪˌdiːz","extraExplanation":["“lapides”是拉丁语单数“lapis（石头）”的复数形式。英语里偶尔保留拉丁语复数，常见于医学记录、解剖/病理描述或古典学写作中。现代临床英语更常直接写“stones”或“calculi”。","发音通常按英语习惯读作 /ˈlæpɪˌdiːz/；在纯拉丁语课堂或学术场合也可能听到更接近古典拉丁的读法。"]}
{"word":"lapidescence","summary":{"en":"Lapidescence means the process of turning into stone (often used in myths or as a literary metaphor).","zh":"Lapidescence 指“逐渐变成石头/石质”的过程（常见于神话语境或文学比喻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming stone-like; petrification (turning into stone).","zh":"变成石头（或石质）的过程；石化。"},"examples":[{"en":"In myths, the hero fears lapidescence after looking at the monster.","zh":"在神话里，英雄担心看见怪物后会被石化。"},{"en":"The writer uses “lapidescence” to describe a heart that slowly turns cold and hard.","zh":"作者用“lapidescence”来描写一颗逐渐变冷、变硬的心。"}]}],"synonyms":["petrification","turning to stone","calcification (related but more medical/technical)"],"phonetic":"/ˌlæpɪˈdɛsəns/","extraExplanation":["这是一个非常少见、偏文学/学术的词，常用来描述神话里的“被石化”，或用作比喻（如情感变得麻木、僵硬）。日常英语里更常见的说法是 petrification（石化）或 turning to stone（变成石头）。","词源上来自拉丁语 lapis（“石头”）+ -escence（表示“逐渐进入某种状态的过程”，如 adolescence“青春期/逐渐成熟的阶段”）。"]}
{"word":"lapidescent","summary":{"en":"Lapidescent means stone-like in appearance or texture (a rare word).","zh":"Lapidescent 指“像石头一样的外观或质感”（较罕见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having the look, texture, or quality of stone; stone-like.","zh":"（罕见）像石头的；具有石质外观或质感的。"},"examples":[{"en":"The statue’s lapidescent surface felt cool and slightly rough to the touch.","zh":"雕像的石质表面摸起来冰凉，带点粗糙感。"},{"en":"After the paint dried, it left a lapidescent finish that resembled granite.","zh":"油漆干了以后留下类似花岗岩的石质效果。"}]}],"synonyms":["stony","stone-like","rocky","petrified-looking","lapidary"],"phonetic":"/ˌlæpɪˈdɛsənt/","extraExplanation":["“Lapidescent”源自拉丁语 *lapis*（石头）相关词根（如 *lapidary* “宝石/石雕的；鉴赏宝石的”）。它在现代英语里非常少见，写作中更常用的替代表达有 “stony,” “stone-like,” “rocky,” 或 “petrified-looking”（看起来像石化的）。"]}
{"word":"lapidicolous","summary":{"en":"“Lapidicolous” describes organisms (often lichens or mosses) that live or grow on rocks.","zh":"“Lapidicolous”指（常为地衣或苔藓等）生长在石头或岩石上的生物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living, growing, or occurring on stones or rocks (especially used for plants like lichens or mosses).","zh":"（尤用于地衣、苔藓等）生长在石头或岩石上的；栖石的。"},"examples":[{"en":"Many lichens are lapidicolous and can survive on bare rock surfaces.","zh":"许多地衣是栖石的，能在裸露的岩石表面生存。"},{"en":"The researcher compared lapidicolous mosses with species that prefer soil.","zh":"研究人员将栖石苔藓与更喜欢土壤的物种进行了比较。"}]}],"synonyms":["saxicolous","rock-dwelling","stone-dwelling"],"phonetic":"/ˌlæpɪˈdɪkəˌləs/","extraExplanation":["词源：来自拉丁语 lapis（石头）+ colere（居住、栖息、耕作），字面意思是“住在石头上的”。","使用场景：多见于生态学、植物学、地衣学等学术语境；日常英语里很少用。","相关词对比：saxicolous 也表示“生长在岩石上的”（更常见一些）；terricolous 表示“生长在土壤上的”；corticolous 表示“生长在树皮上的”。"]}
{"word":"lapidific","summary":{"en":"Lapidific is a rare adjective meaning “petrifying” or “turning into stone.”","zh":"lapidific 是个很少见的形容词，意思是“石化的/使石化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Turning into stone; causing something to become stone (petrifying).","zh":"（罕见）变成石头的；使……石化的（使变成石头的）。"},"examples":[{"en":"In old natural-history books, some writers used “lapidific” to describe water that seemed to turn wood into stone.","zh":"在一些古老的博物学书里，有作者用“lapidific”形容某种水似乎能把木头变成石头。"},{"en":"The story speaks of a lapidific gaze that freezes people like statues.","zh":"故事里提到一种“lapidific”的目光，会把人像雕像一样定住。"}]}],"synonyms":["petrifying","petrific","lithifying","calcifying"],"phonetic":"/ˌlæpɪˈdɪfɪk/","extraExplanation":["词源来自拉丁语 lapis（“石头”）+ -fic（“使……成为”）这一构词成分（常见于 -fication）。在现代英语中更常用 petrifying / petrified 或 lithifying / lithified。由于非常罕见，多见于早期科学写作或文学修辞中。"]}
{"word":"lapidifical","summary":{"en":"Lapidifical is a rare adjective meaning “petrifying; turning into stone,” or “related to petrification/stone formation.”","zh":"Lapidifical 是一个很罕用的形容词，意思是“使石化的、变成石头的”，或“与石化/结石形成有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Turning into stone; petrifying; causing something to become stone-like.","zh":"（罕用）使变成石头的；使石化的；石化作用的。"},"examples":[{"en":"In old medical writing, certain waters were said to have a lapidifical effect, forming stones in the body.","zh":"在早期医学著作中，有人说某些水有“石化作用”，会在体内形成结石。"},{"en":"The mineral-rich spring left a lapidifical crust on the rocks over time.","zh":"富含矿物质的泉水久而久之在岩石上留下了石化般的硬壳。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to petrification or the formation of stones (especially in nature or the body).","zh":"（罕用）与石化或结石形成有关的（尤指自然界或人体内）。"},"examples":[{"en":"The text discusses lapidifical processes in caves, where minerals slowly harden into deposits.","zh":"文章讨论了洞穴中的石化过程：矿物质缓慢硬化并形成沉积物。"},{"en":"He used the word “lapidifical” to describe how deposits build up in pipes.","zh":"他用“lapidifical”来形容沉积物在管道中逐渐堆积变硬的过程。"}]}],"synonyms":["petrifying","petrifactive","stone-forming","calcifying"],"phonetic":"ˌlæpɪˈdɪfɪkəl","extraExplanation":["“lapidifical”非常少见，日常英语里更常用的是 **petrifying / petrified**（石化的）或动词 **lapidify**（使石化、变成石头）。","词根来自拉丁语 **lapis**（石头）+ 表示“使……成为”的构词成分；因此字面意思接近“使之成石”。","在现代语境中，如果你想表达“像石头一样硬/不动”，通常用 **stone-like, rock-hard, petrified** 更自然。"]}
{"word":"lapidification","summary":{"en":"Lapidification means the process of becoming stone (petrification), and more rarely, a figurative hardening of feelings or attitudes.","zh":"Lapidification 指“石化、变成石头的过程”（同 petrification）；较少见的比喻义指情感或态度变得冷硬、僵化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of turning something into stone; petrification","zh":"石化；变成石头的过程（同 petrification）"},"examples":[{"en":"Some fossils were formed through lapidification over millions of years.","zh":"一些化石是在数百万年的石化过程中形成的。"},{"en":"In the museum, the guide explained how wood can undergo lapidification and become petrified wood.","zh":"在博物馆里，讲解员解释了木头如何经历石化并变成硅化木（化石木）。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, figurative) the act of making someone emotionally “hard,” unfeeling, or rigid","zh":"（罕见，比喻）使人“变硬”、冷漠无情或变得僵化的过程"},"examples":[{"en":"Years of constant pressure led to a kind of lapidification of his feelings.","zh":"多年的持续压力让他的感受出现了一种“石化”般的冷硬。"},{"en":"The novel warns against the lapidification of empathy in a cruel society.","zh":"这部小说警示人们，在残酷的社会中同理心可能会逐渐“石化”。"}]}],"synonyms":["petrification","fossilization","calcification","hardening"],"phonetic":"/ləˌpɪdɪfɪˈkeɪʃən/","extraExplanation":["这个词很少见，更多情况下英语会用更常见的 petrification（石化）或 fossilization（成化石/化石化）。lapidification 来自拉丁语词根 lapid-（石头，见 lapidary“宝石/石工的”）。","在文学或评论写作中，它的比喻义常用来形容“情感变得冷硬”“思想僵化”，带有批评色彩。"]}
{"word":"lapidified","summary":{"en":"Lapidified means “turned into stone” (or “made into stone”). It’s a rare word; “petrified” is more common.","zh":"lapidified 表示“变成石头的/被石化的（或使其石化）”。这是较少见的词，更常用的是 petrified。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"turned into stone; petrified (often used in geology or literary writing).","zh":"变成石头的；石化的（常用于地质或文学表达）。"},"examples":[{"en":"Over time, some pieces of wood became lapidified and looked like stone.","zh":"随着时间推移，一些木头碎片发生石化，看起来像石头。"},{"en":"In the story, the hero found a lapidified forest, silent and gray.","zh":"在故事里，主人公发现了一片石化的森林，寂静而灰白。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “lapidify”: to turn (something) into stone; to petrify.","zh":"“lapidify”的过去式/过去分词：使（某物）变成石头；使石化。"},"examples":[{"en":"Minerals in water slowly lapidified the buried wood.","zh":"水中的矿物质慢慢使埋藏的木头石化。"},{"en":"The creature was lapidified by the wizard’s spell in the legend.","zh":"传说中，那生物被巫师的咒语石化了。"}]}],"synonyms":["petrified","fossilized","turned to stone","stony"],"phonetic":"/ləˈpɪdɪˌfaɪd/","extraExplanation":["“lapidified”比较少见，更常用的同义词是“petrified / fossilized”。在科学写作里，“petrified wood（硅化木/石化木）”很常见。","词源与拉丁语“lapis（石头）”有关，因此带有“石头/石化”的含义；在文学语境中也可比喻“变得僵硬、无生命感”。"]}
{"word":"lapidifies","summary":{"en":"“Lapidifies” means “turns into stone” or “makes something turn into stone.”","zh":"“lapidifies”表示“（使）变成石头、石化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of something) to turn into stone; to become stony or stone-like.","zh":"（某物）变成石头；石化；变得像石头一样坚硬。"},"examples":[{"en":"In the old myth, anyone who looks at the monster immediately lapidifies.","zh":"在那个古老的神话里，任何人一看见怪物就会立刻石化。"},{"en":"Over time, the minerals build up and the wood slowly lapidifies.","zh":"随着时间推移，矿物质不断沉积，木头会慢慢石化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone or something turn into stone; to petrify.","zh":"使（某人或某物）变成石头；使石化。"},"examples":[{"en":"The curse lapidifies its victims without warning.","zh":"这个诅咒会在毫无预警的情况下让受害者石化。"},{"en":"Legends say the witch lapidifies travelers who enter the forest at night.","zh":"传说那位女巫会让夜里进入森林的旅人石化。"}]}],"synonyms":["petrifies","turns to stone","calcifies (sometimes)","hardens (context-dependent)"],"phonetic":"/ləˈpɪdɪfaɪz/","extraExplanation":["“lapidify”较少用于日常口语，更常见的近义词是“petrify”（石化、吓呆）。","词源来自拉丁语“lapis”（石头），因此常用于神话、奇幻文学或地质/化石语境。"]}
{"word":"lapidify","summary":{"en":"Lapidify means “to turn into stone” (or “to make something stone-like”), a rare word similar to petrify.","zh":"Lapidify 指“石化/使石化、使变得像石头一样”，较少见，意思接近 petrify。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn (something) into stone; to make stone-like; to petrify.","zh":"使（某物）变成石头；使石化；使变得像石头一样（石质化）。"},"examples":[{"en":"In the myth, the sorceress could lapidify her enemies with a single glance.","zh":"在神话中，那位女巫只需一眼就能让敌人石化。"},{"en":"Over time, minerals can lapidify wood, creating what we call petrified wood.","zh":"随着时间推移，矿物质会使木头石化，形成所谓的“硅化木/化石木”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become stone; to harden as if turning into stone (rare).","zh":"（罕见）变成石头；像变成石头一样变硬、僵化。"},"examples":[{"en":"As the lava cooled, it seemed to lapidify before our eyes.","zh":"熔岩冷却时，仿佛在我们眼前石化了。"}]}],"synonyms":["petrify","turn to stone","calcify","harden"],"phonetic":"/ləˈpɪdɪˌfaɪ/","extraExplanation":["词源提示：lapidify 来自拉丁语 lapis（“石头”）。在现代英语里更常见的词是 petrify（石化），因此 lapidify 多见于文学、神话或较正式/科学化的语境。"]}
{"word":"lapidifying","summary":{"en":"“Lapidifying” is a rare word meaning “turning to stone / making stone-like,” and sometimes “stoning someone.”","zh":"“lapidifying” 很少见，主要指“使石化/变得像石头一样”，有时也指“用石头投掷（施以石刑）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Turning into stone; making something become stone-like (petrifying).","zh":"（罕见）使变成石头；使石化、变得像石头一样（石化）。"},"examples":[{"en":"In the legend, the monster’s gaze was lapidifying, freezing travelers into statues.","zh":"在传说里，怪物的凝视具有“石化”的力量，会把旅人变成雕像。"},{"en":"The artist described the drying clay as lapidifying in the sun.","zh":"这位艺术家形容黏土在阳光下晾干时像在“逐渐石化”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Pelting or killing by throwing stones at someone; stoning.","zh":"（罕见）用石头投掷（甚至砸死）某人；施以石刑。"},"examples":[{"en":"The novel mentions a lapidifying crowd, but the scene is set in a distant past.","zh":"小说提到一群要“用石头处刑”的人群，但故事发生在遥远的过去。"},{"en":"Modern law rejects lapidifying punishments as cruel.","zh":"现代法律拒绝“石刑”这类残酷的惩罚。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “lapidify”: to turn into stone or to stone someone (rare).","zh":"“lapidify”的现在分词：使石化；或用石头投掷/处刑（罕见）。"},"examples":[{"en":"Fantasy writers sometimes use lapidifying to describe magic that turns people to stone.","zh":"奇幻作家有时用 lapidifying 来形容把人变成石头的魔法。"}]}],"synonyms":["petrifying","calcifying","turning to stone","stoning"],"phonetic":"/ləˈpɪdɪˌfaɪɪŋ/","extraExplanation":["词源提示：lapidify 来自拉丁语 lapis（“石头”）。因此它与“石头/石化”有关。现代英语更常用 petrify（石化）或 stone (to death)（用石头砸死/处刑）。","使用建议：lapidifying 非常少见，多出现在文学、神话/奇幻描写或历史语境中；日常表达通常不使用。"]}
{"word":"lapidist","summary":{"en":"A lapidist is a gemstone/stone worker (or dealer), especially someone who cuts and polishes stones.","zh":"lapidist 指从事宝石或石材切割、打磨、雕刻（或经营）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cuts, polishes, engraves, or deals in gemstones and other stones","zh":"宝石（或石材）的切磨、抛光、雕刻者；也可指经营宝石或石材的人"},"examples":[{"en":"The museum hired a lapidist to restore the scratched gemstone seal.","zh":"博物馆雇了一位宝石工匠来修复那枚被刮花的宝石印章。"},{"en":"A skilled lapidist can reveal a stone’s color and sparkle through careful cutting.","zh":"技艺高超的宝石切磨师能通过精细切割展现石头的色彩与光泽。"}]}],"synonyms":["lapidary","gem cutter","stone cutter","gem polisher"],"phonetic":"/ˈlæpɪdɪst/","extraExplanation":["“Lapidist”来自拉丁语 lapis（“石头”）。在英语里更常见的相关词是 “lapidary”（既可作名词指宝石工匠，也可作形容词指“与宝石加工相关的”）。在现代日常语境中，如果你想表达“宝石切割师/宝石工匠”，用 “lapidary” 或 “gem cutter” 往往更常见、更好懂。"]}
{"word":"lapidists","summary":{"en":"“Lapidists” means people who cut and polish gemstones; more rarely, it can refer to those who work with or study stone inscriptions.","zh":"“lapidists”指宝石切磨师（复数）；较少情况下也可指研究或制作石刻铭文的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who cuts, polishes, or engraves gemstones (a gem cutter).","zh":"宝石切磨师；从事宝石切割、打磨或雕刻的人。"},"examples":[{"en":"The lapidists shaped the rough stones into sparkling gems.","zh":"宝石切磨师把原石加工成闪亮的宝石。"},{"en":"She trained as a lapidist to learn how to facet sapphires.","zh":"她接受宝石切磨训练，学习如何给蓝宝石打刻面。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, a person who studies or creates stone inscriptions (connected to lapidary writing).","zh":"（较少用）研究或制作石刻铭文的人；与“石刻体/碑铭文体”相关。"},"examples":[{"en":"The lapidists documented the ancient inscriptions on the temple walls.","zh":"这些研究者记录了寺庙墙壁上的古代石刻铭文。"}]}],"synonyms":["gem cutter","lapidary","stone engraver"],"phonetic":"/ˈlæpɪdɪst/","extraExplanation":["“lapidists”是复数形式，单数是“lapidist”。在珠宝行业里更常见，通常指切割与打磨宝石的人。","词根来自拉丁语 lapis（石头）。相关词：lapidary（既可指“宝石切磨的”，也可指“碑铭式的、简洁有力的文风”）。"]}
{"word":"lapidity","summary":{"en":"Lapidity means the quality of being stone-like, especially stony hardness or a stone-like appearance.","zh":"Lapidity 指“如石一般的性质”，常指石质般的坚硬或外观质感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being like stone (stoniness), or having a stone-like hardness or look","zh":"如石头般的性质；石质感（外观或质地像石头一样坚硬、冷峻）"},"examples":[{"en":"The lapidity of the cliff face made it difficult to climb without proper gear.","zh":"峭壁表面的石质感使得没有合适装备就很难攀爬。"},{"en":"In the sculpture, the artist emphasized lapidity to give the figure a timeless, monumental feeling.","zh":"在这件雕塑中，艺术家强调石质感，让人物呈现出永恒而庄严的感觉。"}]}],"synonyms":["stoniness","hardness","stone-like quality"],"phonetic":"/ləˈpɪdɪti/","extraExplanation":["“lapidity”较少见，更多时候人们会用更常见的词表达类似意思，比如“stoniness”“hardness”“stone-like quality”。","词源可追溯到拉丁语“lapis”（意为“石头”）。它与“lapidary”（宝石切磨的；碑铭的）同源。"]}
{"word":"lapidose","summary":{"en":"Lapidose means stony or stone-like, often used in formal or literary description.","zh":"Lapidose 指“多石的”或“如石般的”，多用于正式或文学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stony; made of stone or full of stones.","zh":"多石的；由石头构成的；布满石块的。"},"examples":[{"en":"The trail becomes lapidose near the river, so watch your step.","zh":"靠近河边的小路变得很“多石”，走路要小心。"},{"en":"They built a lapidose wall from rocks gathered in the fields.","zh":"他们用田里捡来的石头砌了一道石墙。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Like stone in appearance or hardness; stone-like.","zh":"（文学用语）外观或质地像石头的；坚硬如石的。"},"examples":[{"en":"His face turned lapidose with shock, as if carved from rock.","zh":"他震惊得面容僵硬如石，仿佛从岩石里刻出来一样。"},{"en":"A lapidose silence filled the room after the news.","zh":"消息传来后，房间里陷入一种“石头般”的沉寂。"}]}],"synonyms":["stony","rocky","stone-like","stone-built"],"phonetic":"/ˈlæpɪˌdoʊs/","extraExplanation":["“lapidose”比较少见，常见于较正式或文学性的描写。日常英语里更常用 stony、rocky、stone-built、stone-like。","词源来自拉丁语 lapis（石头）。同源词包括 lapidary（宝石切磨的；关于宝石的）和 dilapidated（破败的，原义与“石头散落/建筑崩坏”相关）。"]}
{"word":"lapies","summary":{"en":"“Lapies” are sharp grooves and ridges on limestone formed by water dissolving the rock over time.","zh":"“Lapies”指石灰岩在长期雨水溶蚀作用下形成的沟槽与脊状纹理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) deep grooves and ridges formed on a limestone surface by the slow dissolving action of rainwater; a type of limestone pavement (often used as a plural noun).","zh":"（地质）石灰岩表面因雨水长期溶蚀形成的深沟与脊状纹理；属于“石灰岩铺地/石灰岩路面”地貌的一种（常以复数形式使用）。"},"examples":[{"en":"The hikers had to step carefully across the lapies because the grooves were sharp and uneven.","zh":"徒步者必须小心走过这些 lapies（溶蚀沟脊），因为沟槽又尖又不平。"},{"en":"In this karst region, lapies cover the limestone plateau like a natural stone maze.","zh":"在这片喀斯特地区，lapies 覆盖着石灰岩高原，像天然的石头迷宫。"}]}],"synonyms":["karren","limestone grooves","limestone pavement","lapiaz"],"phonetic":"/ləˈpiːz/","extraExplanation":["“lapies”多见于地貌/地质学语境，常指喀斯特地区石灰岩表面的“溶蚀沟脊”，与法语词源有关（也常见拼写/术语：lapiaz；相关统称：karren）。","日常英语中很少用到；在科普文章或地质野外记录里更常见。若你本来想查的是“lapis（青金石）”，也告诉我，我可以一起对比解释。"]}
{"word":"lapilli","summary":{"en":"Lapilli are small, pebble-sized pieces of volcanic material ejected during eruptions.","zh":"Lapilli 指火山喷发时抛出的、卵石大小的火山碎屑（火山砾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small stones or pebble-like fragments of volcanic rock and ash that are thrown out during an eruption (usually about 2–64 mm across)","zh":"（火山喷发时抛出的）火山砾、火山碎屑（多指直径约2–64毫米的碎石状火山物质）"},"examples":[{"en":"After the eruption, the ground was covered with lapilli and fine ash.","zh":"喷发之后，地面覆盖着火山砾和细火山灰。"},{"en":"Geologists studied the lapilli layer to learn how explosive the eruption was.","zh":"地质学家研究火山砾层，以了解这次喷发有多剧烈。"}]}],"synonyms":["volcanic cinders","scoria fragments","tephra (general term)"],"phonetic":"/ləˈpɪlaɪ/","extraExplanation":["“lapilli”是拉丁语“lapillus”（小石子）的复数形式；英文里常直接用复数“lapilli”来指一类火山喷出物，单数是“lapillus”，但日常与科普写作中复数更常见。","在火山学中，lapilli按大小介于“火山灰（ash，<2 mm）”与“火山弹/火山块（bombs/blocks，>64 mm）”之间，因此常用于描述喷发物的粒径与喷发类型。"]}
{"word":"lapilli-like","summary":{"en":"Pebble-sized volcanic-fragment-like in appearance or texture.","zh":"外观或质地像卵石大小的火山碎屑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling lapilli (small pebble-sized fragments of volcanic rock ejected during an eruption), especially in texture, shape, or size.","zh":"像火山豆石（喷发时抛出的、卵石大小的火山碎屑）的；尤指质地、形状或颗粒大小相似。"},"examples":[{"en":"Under the microscope, the ash layer contains lapilli-like grains mixed with fine dust.","zh":"在显微镜下，这层火山灰里既有细粉尘，也夹杂着类似火山豆石的颗粒。"},{"en":"The deposit has a lapilli-like texture, suggesting a more explosive phase of the eruption.","zh":"这处沉积物呈现出类似火山豆石的质地，暗示喷发曾经历更爆炸性的阶段。"}]}],"synonyms":["pebble-like","granular","gravelly","cinder-like"],"phonetic":"/ləˈpɪlaɪˌlaɪk/","extraExplanation":["lapilli 常译为“火山豆石/豆石”，通常指直径约 2–64 毫米的火山碎屑，大小介于火山灰（更细）与火山弹/火山块（更大）之间。写作 lapilli-like 常见于地质报告、论文或样品描述，用来强调“外观/粒度像”，不一定表示成分完全相同。"],"etymology":"来自意大利语/拉丁语系的地质术语 lapilli（lapillus 的复数，意为“小石子”），在火山学中指喷发抛出的豆石级碎屑；后缀 -like 表示“像……的”。","mnemonic":["把 lapilli 记成“拉（lap）起一粒粒（li-li）小石子”，联想到“很多小石子状颗粒”。","-like = “像……一样”，所以 lapilli-like = “像火山豆石一样的”。"]}
{"word":"lapilliform","summary":{"en":"Lapilliform means “lapilli-like”—having the look or texture of small volcanic stones/cinders.","zh":"lapilliform 指“火山砾状的”，外观或结构类似小块火山石/火山渣。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling lapilli (small volcanic stones or cinders), especially in shape, texture, or structure.","zh":"呈火山砾（lapilli，小块火山石/火山渣）状的；在形状、质地或结构上类似火山砾的。"},"examples":[{"en":"The geologist described the deposit as lapilliform, suggesting it formed from erupted volcanic fragments.","zh":"地质学家把这层沉积物描述为“火山砾状”（lapilliform），暗示它由喷发出的火山碎屑形成。"},{"en":"Under the microscope, the rock shows a lapilliform texture with rounded, pebble-like grains.","zh":"在显微镜下，这块岩石呈现火山砾状结构，颗粒圆润，像小卵石一样。"}]}],"synonyms":["lapilli-like","cinderlike","scoriaceous"],"phonetic":"/ləˈpɪlɪˌfɔrm/","extraExplanation":["这是一个相对专业的地质学/火山学词汇：lapilli 指火山喷发时抛出的“小颗粒火山碎块”（通常约 2–64 mm）。lapilliform 主要用来形容沉积物或岩石的外观与结构“像火山砾”。","词形上：lapilli + -form（“……形状的”）。在学术写作中常见，用于描述火山碎屑沉积、凝灰岩等的颗粒形态与组构。"]}
{"word":"lapillo","summary":{"en":"Lapillo means a small volcanic rock fragment (volcanic cinder/gravel), often mentioned in geology or landscaping.","zh":"Lapillo 指小块火山岩碎屑（火山砾/火山渣颗粒），常用于地质或园艺铺设等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small piece of volcanic rock (a pebble-sized fragment of solidified lava), similar to a lapillus; often used in landscaping or to describe volcanic deposits","zh":"（火山喷发产生的）小块火山岩/火山砾（卵石大小的熔岩碎块）；也常指用于园艺铺设或描述火山沉积物的火山砾石"},"examples":[{"en":"The garden path was covered with black lapillo to help drainage.","zh":"花园小路铺了一层黑色的火山砾石（lapillo），有助于排水。"},{"en":"Geologists found layers of lapillo mixed with ash near the crater.","zh":"地质学家在火山口附近发现了夹杂火山灰的火山砾（lapillo）层。"}]}],"synonyms":["lapillus","lapilli","cinder","scoria"],"phonetic":"/ləˈpiloʊ/","extraExplanation":["“lapillo”常见于意大利语/西班牙语语境，也被英语在火山学或园艺材料中借用使用。对应的更标准火山学术语是拉丁来源的“lapillus”（单数）和“lapilli”（复数），指2–64毫米左右的火山碎屑颗粒，大小介于火山灰（ash）与火山弹/火山块（bomb/block）之间。"]}
{"word":"lapillus","summary":{"en":"Lapillus means a small stone; in volcanology it refers to a small volcanic fragment (plural: lapilli).","zh":"lapillus 指小石子；在火山学中指火山砾（复数 lapilli）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small stone (especially a small pebble or a tiny stone used in medicine, e.g., a small kidney or bladder stone).","zh":"小石子；（尤指）小卵石；（医学）小结石（如肾/膀胱小结石）。"},"examples":[{"en":"The child picked up a lapillus from the riverbank and skipped it across the water.","zh":"孩子从河岸捡起一颗小卵石，打水漂让它在水面上跳跃。"},{"en":"The report described a lapillus found in the patient’s urinary tract.","zh":"报告描述了在患者泌尿道中发现的一枚小结石。"}]},{"partOfSpeech":"n.","definition":{"en":"In geology/volcanology, a small fragment of volcanic rock (about pea- to walnut-sized) thrown out during an eruption; plural: lapilli.","zh":"（地质/火山学）火山砾（喷发时抛出的、豌豆到核桃大小的火山碎屑）；复数：lapilli。"},"examples":[{"en":"After the eruption, the ground was covered with lapilli and ash.","zh":"喷发之后，地面覆盖着火山砾和火山灰。"},{"en":"Geologists sampled lapilli to study the eruption’s intensity.","zh":"地质学家采集火山砾来研究喷发强度。"}]}],"synonyms":["pebble","small stone","volcanic cinder","lapilli"],"phonetic":"/ləˈpɪləs/","extraExplanation":["“lapillus”来自拉丁语，原意是“小石子”。在英语里它属于较学术的词：日常生活说“pebble”（卵石）更常见；火山学里常用复数“lapilli”指一类火山喷出物（按粒径分类介于火山灰与火山弹/火山岩块之间）。"]}
{"word":"lapin","summary":{"en":"Lapin is a French word used in English mainly to mean rabbit, especially rabbit meat in cooking.","zh":"Lapin 是一个法语借词，英语里主要指兔子，尤其指烹饪中的兔肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rabbit (often used on menus or in culinary contexts, especially referring to rabbit meat)","zh":"兔子；（尤指菜单或烹饪语境中）兔肉"},"examples":[{"en":"The stew is made with lapin, herbs, and white wine.","zh":"这道炖菜用兔肉、香草和白葡萄酒做成。"},{"en":"Some restaurants list lapin instead of “rabbit” on the menu.","zh":"有些餐厅在菜单上会用 lapin 代替 “rabbit（兔肉）”。"}]}],"synonyms":["rabbit","rabbit meat"],"phonetic":"/læˈpæn/","extraExplanation":["“Lapin”是法语里“兔子”的意思，英语中多出现在烹饪、餐厅菜单或较正式/较法式的语境里。","在英语菜单上使用“lapin”有时是一种更“精致”的表达，也可能是为了避免直接写“rabbit”带来的心理阻碍（有些人把兔子当宠物）。"]}
{"word":"lapinized","summary":{"en":"“Lapinized” usually means a virus or vaccine strain has been adapted or attenuated by passage through rabbits.","zh":"“Lapinized”通常指病毒或疫苗毒株经过在兔体内培养/传代而“兔适应”或减毒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Adapted, altered, or weakened by being grown or passed through rabbits (often said of a virus or vaccine strain).","zh":"（生物/医学）通过在兔体内培养或传代而适应、改变或减毒的（常指病毒或疫苗毒株）。"},"examples":[{"en":"Researchers tested a lapinized virus strain to see if it was less harmful.","zh":"研究人员测试了一种兔传代减毒的病毒株，看看它是否更不致病。"},{"en":"The vaccine was made from a lapinized strain before being prepared for human use.","zh":"该疫苗先用兔传代得到减毒毒株，然后再制备用于人体。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Made rabbit-like; given characteristics associated with a rabbit.","zh":"（罕见）使像兔子一样的；赋予“兔子般”特征的。"},"examples":[{"en":"In the story, the hero is strangely lapinized after the spell.","zh":"在故事里，主角施咒后离奇地变得“像兔子一样”。"}]}],"synonyms":["rabbit-adapted","attenuated","adapted"],"phonetic":"/ləˈpaɪnaɪzd/","extraExplanation":["“lapin-”来自法语 lapin（兔子）。在病毒学/疫苗学里，lapinized 常见于“rabbit-adapted（兔适应的）”这一类表达：把病原体在兔体内反复传代，可能导致其对兔更适应、对原宿主（如人）致病性降低，从而用于研究或制备减毒株。"]}
{"word":"lapins","summary":{"en":"“Lapins” is the plural of “lapin,” a French loanword meaning rabbits—often used to refer to rabbit meat or fur in menus or fashion contexts.","zh":"“lapins”是法语借词“lapin”的复数，指兔子；在英语中多用于菜单或皮草语境，常指兔肉或兔毛皮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of lapin) a rabbit, especially one raised for meat or fur; also the meat/fur of a rabbit (used as a French-sounding term in menus or fashion).","zh":"（lapin 的复数）兔子，尤指饲养来取肉或皮毛的兔；也可指兔肉/兔皮毛（常见于菜单或时尚语境，用法带一点法式/高雅色彩）。"},"examples":[{"en":"The menu lists “lapins” to mean rabbit, served in a rich sauce.","zh":"菜单上写“lapins”，意思是兔肉，配浓郁的酱汁。"},{"en":"In some older fashion writing, “lapins” can refer to rabbit fur.","zh":"在一些较旧的时尚文章里，“lapins”也可指兔毛皮。"}]}],"synonyms":["rabbits","rabbit meat","coney (old-fashioned)"],"phonetic":"/ˈlæpɪn/","extraExplanation":["“lapin”源自法语，字面就是“兔子”。英语里偶尔借用这个词，常见于餐饮（指兔肉菜）或皮草/纺织语境（指兔毛皮），带有一种“法式菜单/行业用语”的感觉。日常英语更常说 rabbit / rabbit meat。","拼写提示：英语里也有人直接用法语复数 lapins（加 s），但更常见的仍是用 rabbit(s)。"]}
{"word":"lapis","summary":{"en":"Lapis most commonly refers to lapis lazuli, a deep-blue semi-precious stone used in jewelry and historical blue pigment.","zh":"Lapis 最常指青金石：一种深蓝色的半宝石，用于珠宝，也曾用于制作珍贵的蓝色颜料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep-blue semi-precious stone (short for “lapis lazuli”), used in jewelry and historically used to make a rich blue pigment","zh":"一种深蓝色的半宝石（“lapis lazuli”的简称，即青金石），用于珠宝制作，也曾被用来制成昂贵的蓝色颜料"},"examples":[{"en":"She wore a lapis necklace with small gold beads.","zh":"她戴着一条青金石项链，上面有小金珠。"},{"en":"Artists once ground lapis into pigment for bright blue paint.","zh":"过去艺术家会把青金石磨成颜料，用来调出明亮的蓝色。"}]},{"partOfSpeech":"n.","definition":{"en":"the Latin word for “stone,” seen in scientific or formal names (e.g., words related to stones or minerals)","zh":"拉丁语中“石头”的意思，常出现在一些科学或正式的命名中（例如与矿物、石类相关的词源）"},"examples":[{"en":"In Latin, lapis means “stone,” which is why it appears in some learned terms.","zh":"在拉丁语里，lapis 的意思是“石头”，所以它会出现在一些学术性词语中。"}]}],"synonyms":["lapis lazuli","gemstone","ultramarine (pigment)"],"phonetic":"/ˈlæpɪs/","extraExplanation":["“Lapis”在日常英语里通常就是“lapis lazuli（青金石）”的简称。青金石曾被用来制作“ultramarine（群青）”颜料，在欧洲文艺复兴时期非常珍贵，常用于宗教画中重要人物衣袍的蓝色。"]}
{"word":"lapises","summary":{"en":"Lapis usually means lapis lazuli, a deep-blue semi-precious stone used in jewelry and pigments.","zh":"Lapis通常指青金石：一种深蓝色的半宝石，可用于首饰与颜料制作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep-blue semi-precious stone (lapis lazuli), often used in jewelry and for making pigment","zh":"青金石（一种深蓝色的半宝石），常用于首饰，也可磨成颜料"},"examples":[{"en":"She wore a ring set with lapis lazuli.","zh":"她戴着一枚镶有青金石的戒指。"},{"en":"In the past, artists ground lapis into ultramarine pigment.","zh":"过去，艺术家会把青金石磨成群青颜料。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a “stone” used in some set phrases or names, from Latin *lapis* meaning “stone”","zh":"（较少见）源自拉丁语 *lapis*（“石头”），用于某些固定表达或名称中的“石/石头”之意"},"examples":[{"en":"The word “lapis” appears in a few Latin-based names and terms.","zh":"“lapis”会出现在一些源自拉丁语的名称和术语中。"}]}],"synonyms":["lapis lazuli","ultramarine (pigment, related)","blue stone (informal)"],"phonetic":"/ˈlæpɪs/","extraExplanation":["“lapises”通常被当作“lapis”的复数，但更常见的写法是“pieces of lapis (lazuli)”或直接用“lapis”作不可数名词（如：some lapis）。","如果你本来想写的是“lapses”，那是“lapse”的复数，意思是“失误/疏忽；（时间）流逝；（规律/活动）中断”。你可以告诉我上下文，我能帮你确认。"]}
{"word":"Lapith","summary":{"en":"a legendary Thessalian person in Greek myth, known for fighting the Centaurs","zh":"希腊神话中帖撒利传说民族的成员，以与半人马作战著称"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A member of the Lapiths, a legendary people of Thessaly, famous for fighting the Centaurs at the wedding of Pirithous.","zh":"（希腊神话）拉庇泰人之一：传说中居住在帖撒利（Thessaly）的民族成员，以在庇里托俄斯（Pirithous）婚礼上与半人马（Centaurs）作战而著名。"},"examples":[{"en":"In Greek myth, a Lapith is often shown battling a Centaur in temple sculptures.","zh":"在希腊神话中，拉庇泰人常在神庙雕刻里被描绘成与半人马搏斗的形象。"},{"en":"The story of the Lapiths and the Centaurs symbolizes the struggle between order and chaos.","zh":"拉庇泰人与半人马的故事常被用来象征秩序与混乱之间的斗争。"}]}],"synonyms":["Lapithae","Lapiths"],"phonetic":"/ˈlæpɪθ/","extraExplanation":["在古希腊艺术中，“拉庇泰人与半人马之战”（Centauromachy）是常见主题，出现在帕特农神庙（Parthenon）等雕刻中，常被解读为“文明/理性”对抗“野蛮/失控”的象征。"],"etymology":"源自希腊语“Λαπίθαι / Lapíthai（拉庇泰人，复数）”，英语单数形式为 Lapith；常见于古典文学与艺术史语境。","mnemonic":["联想“lap（拍/搭）+ it（它）”：拉庇泰人“搭上武器”去打半人马——用画面记：婚礼上突然开战。","把它和“半人马 Centaur”成对记忆：Lapith（人类阵营） vs. Centaur（野性阵营）。"]}
{"word":"lapith","summary":{"en":"A Lapith is a figure from Greek mythology: a member of the Lapiths, famous for battling the Centaurs.","zh":"Lapith 指希腊神话中的“拉庇泰人”成员，以与半人马之战闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Lapiths, a legendary people in Greek mythology from Thessaly, famous for fighting the Centaurs (especially at a wedding feast).","zh":"（希腊神话）拉庇泰人（Lapiths）的成员：传说中居住在色萨利（Thessaly）的一族，以在婚宴上与半人马（Centaurs）作战而闻名。"},"examples":[{"en":"In Greek myth, the Lapiths fought the Centaurs at the wedding of Pirithous.","zh":"在希腊神话中，拉庇泰人与半人马在皮里托俄斯（Pirithous）的婚礼上爆发战斗。"},{"en":"Some ancient artworks show a Lapith defeating a Centaur as a symbol of order over chaos.","zh":"一些古代艺术作品会描绘拉庇泰人击败半人马，用来象征“秩序战胜混乱”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Lapiths or to their mythic battle with the Centaurs.","zh":"（形容词用法）与拉庇泰人有关的；或与他们和半人马的神话之战有关的。"},"examples":[{"en":"The museum label described the scene as a Lapith battle.","zh":"博物馆说明牌把那一幕描述为“拉庇泰之战”。"}]}],"synonyms":["Lapiths (plural)","Thessalian (context-dependent)"],"phonetic":"/ˈlæpɪθ/","extraExplanation":["“Lapith”来自希腊语“Λαπίθης（Lapíthēs）”。最常见的文化语境是“拉庇泰人与半人马之战（Centauromachy）”，这一主题在古希腊雕塑与建筑装饰中很常见（例如帕特农神庙的相关题材），常被解读为文明/理性对抗野蛮/失控的隐喻。"]}
{"word":"lapithae","summary":{"en":"Lapithae = the Lapiths (plural), a mythic people of Thessaly known for fighting the Centaurs.","zh":"Lapithae 即拉庇泰人（复数），希腊神话中以在婚宴上与半人马大战而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The Lapiths—an ancient people of Thessaly in Greece, famous in myth for battling the Centaurs at a wedding feast. “Lapithae” is a plural form often used in Latinized or scholarly writing.","zh":"（希腊神话）拉庇泰人（Lapiths）——古希腊帖撒利地区的一个族群，在神话中因在婚宴上与半人马（Centaur）大战而闻名。“Lapithae”是常见于拉丁化或学术语境的复数形式。"},"examples":[{"en":"In Greek art, the Lapithae are often shown fighting Centaurs in dramatic scenes.","zh":"在希腊艺术中，拉庇泰人常被描绘成与半人马激战的戏剧性场面。"},{"en":"The story of the Lapithae appears in accounts of the wedding of Pirithous.","zh":"拉庇泰人的故事常见于关于皮里托俄斯婚礼的叙述中。"}]}],"synonyms":["Lapiths"],"phonetic":"/ˈlæpɪθi/","extraExplanation":["“Lapithae”多见于古典学/神话学写作，等同于更常见的“Lapiths”（英语复数）。单数常写作“Lapith”。","拉庇泰人与半人马之战（Centauromachy）在西方艺术与文学里常被用来象征“文明/秩序”对抗“野性/混乱”。这一主题出现在帕台农神庙的雕塑装饰等作品中。"]}
{"word":"lapithaean","summary":{"en":"Lapithaean means “of the Lapiths” (a mythic Greek people) or “a Lapith.”","zh":"Lapithaean 指“拉庇泰族的/与拉庇泰族有关的”，也可指“拉庇泰人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Lapiths, a legendary people of ancient Thessaly in Greek mythology (often linked with the famous battle against the Centaurs).","zh":"（形容词）拉庇泰人（Lapiths）的；与希腊神话中拉庇泰族有关的（常与其对抗半人马的故事相关）。"},"examples":[{"en":"The sculpture shows a Lapithaean warrior fighting a Centaur.","zh":"这座雕塑描绘了一位拉庇泰战士与半人马搏斗。"},{"en":"Writers sometimes use “Lapithaean” to evoke order and civilization opposing chaos.","zh":"作家有时用“Lapithaean”来暗示“秩序与文明对抗混乱”。"}]},{"partOfSpeech":"n.","definition":{"en":"A Lapith (a member of the Lapiths).","zh":"（名词）拉庇泰人；拉庇泰族的一员。"},"examples":[{"en":"In the myth, a Lapithaean helps defend the wedding feast from the Centaurs.","zh":"在神话中，一位拉庇泰人在婚宴上帮助抵御半人马的袭击。"}]}],"synonyms":["Lapith","Lapithean","Lapithic"],"phonetic":"/ləˈpɪθiən/","extraExplanation":["“Lapithaean / Lapithean”源自“Lapith（拉庇泰人）”。拉庇泰人与半人马的冲突常被称为“半人马之战（Centauromachy）”，在古希腊艺术中很常见（例如帕特农神庙的雕刻主题之一）。在英语写作里，这个词多出现在古典学、艺术史或带有古典意象的文学语境中，用来借指“文明/克制”与“野性/失控”的对立。"]}
{"word":"Lapithean","summary":{"en":"connected with the mythic Lapiths; or a Lapith person","zh":"与希腊神话拉庇泰人有关；或指拉庇泰人"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Lapiths, a people in Greek mythology (especially known for their battle with the centaurs).","zh":"（形容词）与希腊神话中的拉庇泰人（Lapiths）有关的，尤指他们与半人马之战。"},"examples":[{"en":"The vase shows a Lapithean scene of humans fighting centaurs.","zh":"这只花瓶描绘了一个拉庇泰人的场景：人类与半人马搏斗。"},{"en":"In art history, the Lapithean battle often symbolizes the struggle between civilization and chaos.","zh":"在艺术史中，拉庇泰之战常被用来象征文明与混乱的对抗。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Lapiths in Greek mythology.","zh":"（名词）希腊神话中的拉庇泰人之一。"},"examples":[{"en":"The hero is described as a Lapithean at the wedding feast.","zh":"故事把这位英雄描述为婚宴上的一名拉庇泰人。"}]}],"synonyms":["Lapith"],"phonetic":"/ləˈpɪθiən/","extraExplanation":["拉庇泰人（Lapiths）最有名的故事是“拉庇泰人与半人马之战”（Centauromachy）：在婚礼宴会上半人马失控，引发冲突。古希腊雕塑（如帕特农神庙的装饰题材）常借此表达“理性/秩序 vs. 野性/混乱”。","这个词在日常英语里很少用，多见于学术写作；如果你只是想说“拉庇泰人”，更常见的形式是 Lapith（名词/形容词）。"],"etymology":"源自希腊语族名“Lapith-（拉庇泰人）”，英语中加后缀 -ean 表示“……的 / ……人”。常见于古典学、艺术史与文学评论语境。","mnemonic":["把 Lapithean 记成“Lapith + -ean（……的/……人）”，就像 European（欧洲的/欧洲人）一样。","联想“拉庇泰婚礼（Lapith wedding）→ 半人马闹事 → 经典雕塑题材”，看到艺术史语境就容易想起。"]}
{"word":"Lapithic","summary":{"en":"connected with the mythic Lapiths, especially their conflict with the Centaurs","zh":"与希腊神话中的拉庇泰人有关，尤指其与半人马的冲突主题"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Lapiths, a legendary people in Greek mythology, especially known for their battle with the Centaurs.","zh":"与“拉庇泰人”（希腊神话中的传说族群）有关的；尤指他们与半人马的著名战斗。"},"examples":[{"en":"The frieze shows a Lapithic scene of the wedding battle between the Lapiths and the Centaurs.","zh":"这段浮雕展示了一个拉庇泰式的场景：拉庇泰人与半人马在婚礼上的战斗。"},{"en":"Scholars often read Lapithic imagery as a symbol of order confronting chaos.","zh":"学者常把拉庇泰式意象解读为“秩序对抗混乱”的象征。"}]}],"synonyms":["Lapithian"],"phonetic":"/ləˈpɪθɪk/","extraExplanation":["“拉庇泰人与半人马之战”（Centauromachy）是古希腊艺术与文学中常见主题，常出现在帕台农神庙等建筑雕刻与古典绘画里；“Lapithic”多用于艺术史、古典学语境。"],"etymology":"源自希腊语 Lapíthai（拉庇泰人），经由学术英语构词加上形容词后缀 -ic，表示“与……相关的”。","mnemonic":["把 Lapithic 记成“Lapith（拉庇泰人）+ -ic（……的）”，看到 -ic 就想到“与……有关的形容词”。","联想经典主题“拉庇泰人 vs 半人马”，凡是提到这场婚礼战斗或其象征意义的，都可能用到这个词。"]}
{"word":"Lapiths","summary":{"en":"mythic Thessalian people known for fighting the Centaurs","zh":"希腊神话中以对抗半人马族闻名的帖撒利族群"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legendary people in Greek mythology from Thessaly, famous for battling the Centaurs (especially at the wedding of Pirithous).","zh":"（希腊神话）拉庇泰人：传说中居住在帖撒利的民族，以与半人马族的战争闻名（尤其发生在皮瑞托俄斯的婚宴上）。"},"examples":[{"en":"In Greek myth, the Lapiths fought the Centaurs after a drunken brawl broke out at a wedding feast.","zh":"在希腊神话中，拉庇泰人在婚宴上因醉酒斗殴而与半人马族爆发大战。"},{"en":"The struggle between the Lapiths and the Centaurs is a common theme in classical art.","zh":"拉庇泰人与半人马族的争斗是古典艺术中常见的主题。"}]}],"synonyms":["Lapithae"],"phonetic":"/ˈlæpɪθs/","extraExplanation":["在文学与艺术里，拉庇泰人与半人马之战常被解读为“秩序/文明”对抗“野性/失控”的象征（并非对现实民族的评价）。","著名故事场景是皮瑞托俄斯（Pirithous）与希波达弥亚（Hippodamia）的婚礼：半人马因酒后失控引发冲突，拉庇泰人出面反击。该题材出现在帕台农神庙（Parthenon）等古典雕刻与绘画中。"],"etymology":"源自希腊语族名“Λαπίθαι (Lapíthai)”，拉丁化作“Lapithae”。在古典文献中用来指帖撒利地区的神话民族，常与“半人马之战（Centauromachy）”相关联。","mnemonic":["把 Lapiths 联想成“拉（拉扯）+庇护”：婚宴上拉庇泰人为了“庇护”新娘与宾客，和半人马打起来。","记搭配：Lapiths 常和 Centaurs 一起出现——看到半人马就容易想到拉庇泰人这场名战。"]}
{"word":"laplacian","summary":{"en":"“Laplacian” usually means the Laplace operator (Δ) in mathematics, or anything related to it.","zh":"“Laplacian”通常指数学中的拉普拉斯算子（Δ），或与之相关的内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(math) the Laplace operator (Δ), a differential operator that measures how a function changes compared with its surroundings; widely used in physics and partial differential equations.","zh":"（数学）拉普拉斯算子（Δ），一种微分算子，用来衡量函数相对其周围环境的变化；广泛用于物理与偏微分方程。"},"examples":[{"en":"In electrostatics, the potential in empty space often satisfies the Laplacian equation ΔV = 0.","zh":"在静电学中，空旷区域内的电势常常满足拉普拉斯方程 ΔV = 0。"},{"en":"We apply the Laplacian to smooth the image and reduce noise.","zh":"我们对图像应用拉普拉斯算子来平滑并降低噪声。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Laplace operator or to Laplace’s work in mathematics and physics.","zh":"与拉普拉斯算子有关的；或与拉普拉斯在数学与物理中的研究相关的。"},"examples":[{"en":"This section introduces Laplacian filtering in computer vision.","zh":"本节介绍计算机视觉中的拉普拉斯滤波。"},{"en":"A Laplacian matrix is commonly used to study graphs and networks.","zh":"拉普拉斯矩阵常用于研究图与网络。"}]}],"synonyms":["Laplace operator","Laplacian operator","Δ (delta)","∇² (nabla squared)"],"phonetic":"/ləˈplæʃən/","extraExplanation":["“Laplacian”来自法国数学家与天文学家皮埃尔-西蒙·拉普拉斯（Pierre-Simon Laplace）。在连续情形中，Laplacian 通常写作 Δ 或 ∇²；在离散情形（如图论）中，你会看到“graph Laplacian（图拉普拉斯算子/矩阵）”，常用于聚类、网络分析与谱方法。","发音与拼写提示：英语中常见重音在第二音节：la-PLA-cian。学术写作里常与 operator / matrix / equation 搭配：Laplacian operator（拉普拉斯算子）、Laplacian matrix（拉普拉斯矩阵）、Laplacian equation（拉普拉斯方程）。"]}
{"word":"Lapland","summary":{"en":"Northern European Arctic region; also a Santa Claus home in Christmas lore.","zh":"欧洲北部的拉普兰地区；也可指圣诞传说中圣诞老人的居所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A region in the far north of Europe, stretching across northern Norway, Sweden, Finland, and the Kola Peninsula of Russia; often associated with the Sámi people and Arctic landscapes.","zh":"欧洲最北部的拉普兰地区，横跨挪威、瑞典、芬兰北部及俄罗斯科拉半岛；常与萨米人和北极风光联系在一起。"},"examples":[{"en":"She traveled to Lapland to see the northern lights.","zh":"她去拉普兰看极光。"},{"en":"Many Sámi communities live in parts of Lapland.","zh":"许多萨米族社群生活在拉普兰的部分地区。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in Christmas stories) A mythical place said to be the home of Santa Claus.","zh":"（尤指圣诞故事中）传说中圣诞老人的故乡。"},"examples":[{"en":"The kids wrote a letter to Santa in Lapland.","zh":"孩子们写信给住在拉普兰的圣诞老人。"},{"en":"Movies often show Santa leaving Lapland on Christmas Eve.","zh":"电影里常常演圣诞老人从拉普兰在平安夜出发。"}]}],"synonyms":["Finnish Lapland","the Arctic","the Far North"],"phonetic":"/ˈlæpˌlænd/","extraExplanation":["文化提示：萨米人（Sámi）是北欧北部的原住民族群之一，传统生活与驯鹿放牧、手工艺和语言文化有关。提到民族时更推荐用“Sámi”，避免使用“Lapp”这种旧称。","在芬兰语中拉普兰称为“Lapin/Lappi”，芬兰也把“Lapland”作为官方行政区名之一（芬兰语“Lapland/Lappi”对应英文“Lapland”）。","“圣诞老人住在拉普兰”是近现代流行文化的设定，尤其常与芬兰北部（如罗瓦涅米 Rovaniemi）旅游宣传相关。"],"etymology":"源自“Lapp”（旧称，用来指萨米人；如今在英语里常被视为不够尊重/已过时）+ “land（土地）”。现代更常用“Sámi”指民族/文化；“Lapland”作为地名仍广泛使用。","mnemonic":["把它拆开记：Lap + land = “一片土地”。想象“北极圈的一片土地”，就容易联想到极光、雪地与驯鹿。","联想中文：拉普兰≈“拉着雪橇在北方的兰色（蓝色）极光下”，用画面帮助记地理与氛围。"]}
{"word":"lapland","summary":{"en":"Lapland is a far-northern European region known for Arctic landscapes and Sámi culture, and it is often linked to Christmas imagery in popular culture.","zh":"拉普兰是欧洲最北部的一片地区，以北极风光与萨米文化闻名，在流行文化中也常与圣诞意象相连。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in far northern Europe (across northern Norway, Sweden, Finland, and part of Russia) traditionally associated with the Sámi people; often imagined as a snowy Arctic homeland","zh":"拉普兰：欧洲最北部的一片地区（横跨挪威、瑞典、芬兰及俄罗斯部分地区），传统上与萨米人（Sámi）相关；在流行文化中常被想象为冰雪覆盖的北极家园"},"examples":[{"en":"Many travelers visit Lapland in winter to see the Northern Lights.","zh":"许多游客会在冬天去拉普兰看北极光。"},{"en":"Lapland is home to the Sámi, an Indigenous people of northern Europe.","zh":"拉普兰是萨米人——欧洲北部的原住民族——的家园。"},{"en":"In Christmas stories, Santa is sometimes said to live in Lapland.","zh":"在圣诞故事里，圣诞老人有时被说住在拉普兰。"}]}],"synonyms":["(the Arctic)","Northern Europe (region)","Finnish Lapland (specific)"],"phonetic":"/ˈlæpˌlænd/","extraExplanation":["“Lapland”在英文里既可以指整个跨国的“拉普兰地区”（文化与地理概念），也常被用来特指芬兰北部的“拉普兰省/拉普兰地区”（Finnish Lapland）。","在芬兰的旅游与媒体语境中，Lapland常与“圣诞老人故乡”“驯鹿”“雪屋”“极夜/极昼”等意象联系在一起，但真实的拉普兰也包含多样的城市与自然生态。","拼写注意：Lapland首字母大写，因为它是专有名词。对应形容词常见为“Laplandic”（较少见），更常说“in Lapland / from Lapland”。"]}
{"word":"Laplander","summary":{"en":"a person from Lapland; also describing something connected to that region","zh":"拉普兰地区的人；也可表示与该地区有关的"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person from Lapland (a region in northern Finland, Sweden, Norway, and Russia).","zh":"拉普兰地区的人（位于芬兰、瑞典、挪威及俄罗斯北部的一片区域）。"},"examples":[{"en":"She met a Laplander while traveling in northern Finland.","zh":"她在芬兰北部旅行时遇到了一位拉普兰人。"},{"en":"Many Laplanders work in tourism during the winter season.","zh":"许多拉普兰人在冬季从事旅游业工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Lapland or its people.","zh":"与拉普兰或其居民相关的。"},"examples":[{"en":"They joined a Laplander cultural festival to learn about local traditions.","zh":"他们参加了一个拉普兰文化节来了解当地传统。"},{"en":"The museum has a small Laplander history section.","zh":"博物馆里有一小块拉普兰历史展区。"}]}],"synonyms":["person from Lapland","Lapland resident","Sámi"],"phonetic":"/ˈlæpˌlændɚ/","extraExplanation":["文化提示：在英语中，Laplander 通常是“拉普兰地区的人”的中性说法。但如果用来特指当地原住民族时，现代语境更常用更尊重的名称 Sámi（萨米人）。旧称 Lapp 在不少语境里可能被视为不够尊重，建议避免。"],"etymology":"由 Lapland（拉普兰）+ -er（表示“……的人”）构成；Lapland 作为地名在英语中长期用于指北欧最北部地区。","mnemonic":["把它拆开记：Lapland（拉普兰）+ -er（……的人）→“来自拉普兰的人”。","联想“Santa lives in Lapland（圣诞老人住在拉普兰）”，所以 Laplander 就是“拉普兰那边的人”。"]}
{"word":"laplander","summary":{"en":"A Laplander is a person from Lapland; in modern contexts, “Sámi” is often preferred when referring to the Indigenous people.","zh":"Laplander 指来自拉普兰的人；现代语境中，指当地原住民族时常更倾向用 “Sámi（萨米人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Lapland, a region in northern Norway, Sweden, Finland, and Russia (often associated with Arctic culture).","zh":"拉普兰人：来自拉普兰（位于挪威、瑞典、芬兰及俄罗斯北部的地区）的人，常与北极圈文化相关。"},"examples":[{"en":"The museum has a section on Laplanders and their traditional reindeer herding.","zh":"博物馆有一个展区介绍拉普兰人及其传统的驯鹿放牧文化。"},{"en":"She met a Laplander while traveling in northern Finland.","zh":"她在芬兰北部旅行时遇到了一位拉普兰人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(sometimes, older or informal) relating to Lapland or its people.","zh":"（有时用于较旧或较口语的用法）与拉普兰或拉普兰人有关的。"},"examples":[{"en":"He bought a Laplander-style hat for the winter.","zh":"他买了一顶拉普兰风格的帽子过冬。"}]}],"synonyms":["person from Lapland","Sámi (more specific, for the Indigenous people)"],"phonetic":"/ˈlæpˌlæn.dɚ/","extraExplanation":["“Laplander”在英语里传统上指“拉普兰地区的人”，但在当代语境中，许多人更偏好用“Saami / Sámi（萨米人）”来指代该地区的原住民族，因为“Laplander”有时会被认为过于笼统、带有外部视角。实际使用时，若指特定族群，尽量使用对方自称（如 Sámi）；若仅指地域来源，可说“someone from Lapland”。"]}
{"word":"laplanders","summary":{"en":"“Laplanders” means people from Lapland; in older texts it may refer to the Sámi, but “Sámi” is usually the more accurate term.","zh":"“Laplanders”指拉普兰地区的人；在旧文本中有时指萨米人，但通常用“Sámi”更准确。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from Lapland, a region in northern Norway, Sweden, Finland, and Russia; the plural of “Laplander.”","zh":"拉普兰地区的人；“Laplander”的复数（拉普兰位于挪威、瑞典、芬兰和俄罗斯北部）。"},"examples":[{"en":"Many Laplanders grow up with long winters and short summers.","zh":"许多拉普兰人从小就经历漫长的冬季和短暂的夏季。"},{"en":"The museum exhibit introduces Laplanders’ daily life and local traditions.","zh":"博物馆展览介绍了拉普兰人的日常生活和当地传统。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/older use) A term sometimes used to refer to the Sámi people; this can be imprecise and may be considered outdated, so “Sámi” is usually preferred when you mean the Indigenous group.","zh":"（历史/较旧用法）有时用来指萨米人（Sámi）；这个说法不够准确，也可能被视为过时，因此在指原住民族时通常更建议用“Sámi”。"},"examples":[{"en":"Older books sometimes use “Laplanders” when they actually mean the Sámi.","zh":"一些较旧的书里会用“Laplanders”来指代萨米人。"},{"en":"To be respectful and accurate, the article uses “Sámi” instead of “Laplanders.”","zh":"为了尊重且准确，这篇文章用“Sámi”而不是“Laplanders”。"}]}],"synonyms":["people of Lapland","Lapland residents","Sámi (when specifically referring to the Indigenous people)"],"phonetic":"/ˈlæpˌlændɚz/","extraExplanation":["“拉普兰（Lapland）”是一个地理区域名，不等同于“萨米人（Sámi）”。萨米人是横跨多国的原住民族，并非所有拉普兰居民都是萨米人。","在当代语境中，如果你指的是“居住在拉普兰的人”，用“Laplanders”可以；如果你指的是“萨米族群”，更推荐直接说“Sámi people”。"]}
{"word":"laplandian","summary":{"en":"Laplandian means “from or related to Lapland”; it can also mean a person from Lapland, but that noun use is uncommon.","zh":"Laplandian指“来自或与拉普兰有关的”；也可指“拉普兰人”，但作名词不太常见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Lapland, a region in northern Europe (mainly in Finland, but also parts of Sweden, Norway, and Russia), or to people from that region.","zh":"与拉普兰有关的；来自拉普兰地区的（拉普兰位于北欧北部，主要在芬兰，也包括瑞典、挪威和俄罗斯的部分地区）。"},"examples":[{"en":"We tried a Laplandian winter tour to see the northern lights.","zh":"我们参加了一次拉普兰的冬季旅行去看北极光。"},{"en":"Laplandian folklore often includes stories about long polar nights and reindeer.","zh":"拉普兰的民间传说中常有关于漫长极夜和驯鹿的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Lapland (less common; “Laplander” is more usual).","zh":"拉普兰人（不太常见；更常用的说法是“Laplander”）。"},"examples":[{"en":"He introduced himself as a Laplandian and talked about local traditions.","zh":"他自称是拉普兰人，并谈起当地的传统。"}]}],"synonyms":["Lapland (as an adjective in phrases, e.g., Lapland culture)","from Lapland","Northern Finnish (context-dependent)"],"phonetic":"/læpˈlændiən/","extraExplanation":["“Lapland”是地理名称，而当地的原住民族群主要是萨米人（Sámi）。在谈到文化或族群时，用“Sámi”更准确也更尊重；“Laplandian”更偏向“地理/地区”的含义。","“Laplandian”在英语里相对少见，实际写作与新闻中更常看到“from Lapland / in Lapland”或“Lapland’s …”。"]}
{"word":"Laplandic","summary":{"en":"related to Lapland; sometimes (older) referring to Sámi people or languages.","zh":"与拉普兰有关；有时（较旧）指萨米人或萨米语言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Lapland (a region in northern Finland, Sweden, Norway, and Russia) or to its people and culture.","zh":"与拉普兰（北欧与俄罗斯北部地区）或其人民与文化有关的；拉普兰的。"},"examples":[{"en":"They studied Laplandic folk music during their trip to northern Finland.","zh":"他们在去芬兰北部旅行时研究了拉普兰的民间音乐。"},{"en":"The museum has a small Laplandic art collection.","zh":"这家博物馆有一小批拉普兰艺术收藏。"}]},{"partOfSpeech":"n.","definition":{"en":"the (often older or less common) term for the Sámi languages or for a person from Lapland; usage varies and can be sensitive.","zh":"（较旧或较不常用）指萨米语族/萨米语言，或指拉普兰地区的人；用法不一，且可能涉及敏感称呼。"},"examples":[{"en":"Older sources sometimes use “Laplandic” to refer to Sámi languages.","zh":"较早的资料有时用“Laplandic”来指萨米语言。"},{"en":"In modern writing, “Sámi” is usually preferred over “Laplandic.”","zh":"在现代写作中，通常更建议用“Sámi”而不是“Laplandic”。"}]}],"synonyms":["Lapland","Sámi","Sámi languages","Lappish"],"phonetic":"ˌlæpˈlændɪk","extraExplanation":["文化与用法提示：英语里与萨米人（Sámi）相关的称呼曾出现过多种写法与旧称。有些旧词在当代可能被视为不准确或不尊重。若你指的是民族/语言，通常用“Sámi / Sámi languages”更合适；若指地区与风物，可用“Lapland”作定语（如 Lapland culture, Lapland tourism）。"],"etymology":"源自“Lapland（拉普兰）+ -ic（形容词/名词后缀，表示‘……的/与……有关的’）”。该词多见于旧式或学术语境中，用来泛指拉普兰地区或其相关事物。","mnemonic":["记忆法：把它拆成“Lapland + -ic”，-ic 常见于“与……有关的”（如 historic, artistic）。所以 Laplandic ≈ “拉普兰的/与拉普兰有关的”。","联想：Lapland 是“圣诞老人故乡（常见文化形象）”之一——想到北极圈附近的拉普兰，就能联想到 Laplandic（拉普兰相关）。"]}
{"word":"laplandic","summary":{"en":"Laplandic means “of Lapland,” and less commonly “of the Sámi languages.”","zh":"Laplandic 意为“拉普兰的”，较少见也可指“与萨米语诸语言有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Lapland (a region in northern Norway, Sweden, Finland, and Russia) or its people and culture.","zh":"拉普兰（北欧及俄罗斯北部地区）及其人民、文化的；拉普兰的。"},"examples":[{"en":"We visited a Laplandic village above the Arctic Circle.","zh":"我们去了一个位于北极圈以北的拉普兰村落。"},{"en":"The museum has Laplandic clothing made for extreme winter weather.","zh":"博物馆里有为极寒冬季制作的拉普兰服饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"(language) relating to the Sámi languages, or (less commonly) the Sámi language group as a whole.","zh":"（语言）与萨米语诸语言有关的；（较少见）指萨米语族整体的。"},"examples":[{"en":"Some older books call the Sámi languages “Laplandic.”","zh":"一些较旧的书会把萨米语诸语言称作“Laplandic（拉普兰语的）”。"},{"en":"She is studying Laplandic vocabulary used in reindeer herding.","zh":"她在学习驯鹿放牧中使用的萨米语词汇（旧称 Laplandic）。"}]}],"synonyms":["Sámi","Sami","of Lapland","(older) Lappish"],"phonetic":"/læpˈlændɪk/","extraExplanation":["“Laplandic”在现代英语中不算常用；更常见的是“Lapland”（地名）或“Sámi”（民族/语言）。","涉及人群时请注意用词：历史上英语里有“Lapp/Lappish”等说法，但在当代语境中常被认为不够尊重或带有过时色彩；更建议使用“Sámi”。","“Lapland”是地理概念，而“Sámi”指跨国分布的原住民族及其相关语言与文化；两者常相关但不完全等同。"]}
{"word":"laplandish","summary":{"en":"“Laplandish” means related to Lapland; it can also (especially in older usage) refer to Sámi languages.","zh":"“Laplandish”指与拉普兰有关；也可（多见于旧用法）指萨米诸语言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Lapland (the northern region of Norway, Sweden, Finland, and Russia) or its people and culture.","zh":"拉普兰（位于挪威、瑞典、芬兰及俄罗斯北部地区）及其人民与文化的；拉普兰的。"},"examples":[{"en":"Laplandish traditions include reindeer herding and winter festivals.","zh":"拉普兰的传统包括驯鹿放牧和冬季节庆。"},{"en":"They visited a Laplandish village above the Arctic Circle.","zh":"他们参观了北极圈以北的一座拉普兰村落。"}]},{"partOfSpeech":"n.","definition":{"en":"The language or speech of Lapland; often used loosely or historically to refer to Sámi languages (usage can be outdated).","zh":"拉普兰的语言或说法；常被宽泛或历史性地用来指萨米语族（此用法可能较旧）。"},"examples":[{"en":"Older books sometimes mention “Laplandish” when talking about Sámi languages.","zh":"较早的书籍在谈到萨米语时，有时会提到“Laplandish”。"},{"en":"The museum label explained that “Laplandish” is an older term for several Sámi languages.","zh":"博物馆的说明牌解释说，“Laplandish”是指若干种萨米语的旧称。"}]}],"synonyms":["Lapland","of Lapland","Sámi (when referring to language/culture)"],"phonetic":"/ˌlæpˈlændɪʃ/","extraExplanation":["“Laplandish”在现代英语里不算常见，更常见的表达是“of Lapland / Lapland (adj.)”。谈到语言时，较尊重且更准确的说法通常是“(the) Sámi languages”（萨米诸语言），因为拉普兰并非单一语言区，也涉及不同族群与多种语言。"]}
{"word":"lapling","summary":{"en":"“Lapling” is a very rare word meaning a little child (a diminutive linked to “lap”).","zh":"“Lapling”非常罕见，可理解为指“小孩”的亲昵/文学化说法，词源上与“lap（膝上/怀里）”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A little child; a “little one” associated with sitting on an adult’s lap.","zh":"（罕见/古语）小孩；带有“在大人膝上/怀里”的亲昵称呼意味。"},"examples":[{"en":"The tired mother rocked the lapling to sleep.","zh":"疲惫的母亲摇着怀里的小孩入睡。"},{"en":"He spoke softly to the lapling clinging to her coat.","zh":"他轻声对那个抓着她外套不放的小孩说话。"}]}],"synonyms":["child","little one","toddler","baby"],"phonetic":"/ˈlæplɪŋ/","extraExplanation":["“lapling”在现代英语里几乎不用，很多词典里也查不到；你更常会看到 child / little one / toddler / baby 等表达。","它可以被理解为 lap（膝上、怀里）+ -ling（表示“小的、年幼的”的后缀，如 duckling 小鸭）。因此语气偏亲昵、文学化，也可能带古风。","如果你是想查拼写相近的常用词：sapling（树苗）、lapping（拍打/舔舐/重叠）或 lapel（西装翻领），告诉我语境我可以帮你确认。"]}
{"word":"lapon","summary":{"en":"“Lapon” is a rare word meaning a Sami person or something related to the Sami/Lapland; modern usage usually prefers “Sami.”","zh":"“Lapon”较罕用，指萨米人或与萨米/拉普兰相关的事物；现代用法通常更推荐用“Sami”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A Sami person; someone traditionally living in Lapland (northern Norway, Sweden, Finland, and Russia).","zh":"（罕用）萨米人；传统居住在拉普兰（挪威、瑞典、芬兰及俄罗斯北部）地区的人。"},"examples":[{"en":"Older travel books sometimes used the word “Lapon” to describe the Sami people of northern Scandinavia.","zh":"一些较早的旅行书有时会用“Lapon”来指北欧北部的萨米人。"},{"en":"Today, many writers prefer “Sami” instead of “Lapon.”","zh":"如今，很多作者更倾向用“Sami（萨米人）”而不是“Lapon”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to the Sami people or to Lapland.","zh":"（罕用）与萨米人或拉普兰地区有关的。"},"examples":[{"en":"The museum has a small collection of Lapon crafts and clothing.","zh":"这家博物馆收藏了一小部分与拉普兰/萨米相关的手工艺品和服饰。"}]}],"synonyms":["Sami","Saami","Laplander (less preferred)"],"phonetic":"/ˈlæpɑn/","extraExplanation":["“Lapon”在英语中非常少见，常见于较老的书籍或译文里；现代英语更常用“Sami”。在表达上，使用“Sami”通常更尊重当事群体、也更符合当代写作习惯。","“Lapland（拉普兰）”是地理区域名，不等同于某一个民族；萨米人是跨越多国边境的原住民族群。写作时可区分“Lapland (the region)”与“Sami (the people)”。"]}
{"word":"laportea","summary":{"en":"Laportea is a scientific genus name for certain nettle-family plants, many with stinging hairs.","zh":"Laportea 是一个植物学属名，指荨麻科的一些植物，许多带刺毛会蜇人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical and subtropical plants in the nettle family (Urticaceae), many of which have stinging hairs that can irritate skin","zh":"拉波特属（Laportea）：荨麻科（Urticaceae）的一属热带/亚热带植物，许多种类带有刺毛，接触皮肤会引起刺痛或刺激"},"examples":[{"en":"In some tropical forests, Laportea species can cause a painful sting if you brush against them.","zh":"在一些热带森林里，如果不小心擦到拉波特属（Laportea）的植物，可能会被刺得很痛。"},{"en":"The field guide lists Laportea as part of the nettle family.","zh":"野外植物图鉴把拉波特属（Laportea）列为荨麻科。"}]}],"synonyms":["genus Laportea","nettle genus (contextual)"],"phonetic":"/ləˈpɔːrtiə/","extraExplanation":["这是一个植物学“属名”（genus name），常见于科学论文、标本标签或自然观察记录中；日常英语里一般不单独用它来指某一种植物。","词源上是以法国博物学家/探险家命名的拉丁化学名（用于生物分类）。不同地区的常见种可能会有各自的俗名（common name），例如某些种会被称为“stinging nettle（会蜇人的荨麻类）”。"]}
{"word":"Lapp","summary":{"en":"“Lapp” is a dated term for a Sámi person and is often considered offensive today; it can also mean “related to Lapland.”","zh":"“Lapp”是指萨米人的过时称呼，如今常被认为带冒犯；也可作形容词表示“与拉普兰有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, often considered offensive) A Sámi person; an Indigenous person from the far north of Norway, Sweden, Finland, and Russia.","zh":"（过时，常被认为带有冒犯）萨米人；居住在挪威、瑞典、芬兰及俄罗斯北部的原住民族成员。"},"examples":[{"en":"Older books may use the word “Lapp,” but many Sámi people prefer to be called “Sámi.”","zh":"一些旧书里会用“Lapp”，但许多萨米人更希望被称为“Sámi（萨米人）”。"},{"en":"The museum updated its labels to use “Sámi” instead of “Lapp.”","zh":"博物馆更新了展签，用“Sámi（萨米人）”替代“Lapp”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Lapland (the northern region of Scandinavia).","zh":"与拉普兰（斯堪的纳维亚北部地区）有关的。"},"examples":[{"en":"They learned about Lapp traditions during their trip to northern Finland.","zh":"他们在芬兰北部旅行时了解了拉普兰地区的传统。"},{"en":"The guide described the Lapp landscape as snowy and quiet in winter.","zh":"导游把拉普兰的冬季景色形容为白雪覆盖、宁静安详。"}]}],"synonyms":["Sámi","Laplander (for the region, but use with care)"],"phonetic":"/læp/","extraExplanation":["“Lapp”在英语里常出现在较早的旅行文学或民族志写作中，但如今很多语境下被认为带有贬义或不尊重（因为它并非萨米人对自己的自称，也曾与刻板印象一起使用）。在现代英语中，更推荐用“Sámi”（单复数都可用）或更具体的国别/地区称呼。","如果你是在阅读历史文本，遇到“Lapp”可以理解为指“萨米人/拉普兰地区的人”，但在当代写作与口语中建议避免使用，以免冒犯。"]}
{"word":"lapp","summary":{"en":"“Lapp” is a dated term for the Sámi people and is often considered offensive today; it can also be a surname.","zh":"“Lapp”是对萨米人的旧称，现多被视为冒犯；也可作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, often offensive) A term historically used by outsiders to refer to the Sámi people of northern Scandinavia and nearby regions.","zh":"（过时，且常被视为冒犯）历史上外界对北欧萨米人（Sámi）的称呼。"},"examples":[{"en":"Older books sometimes use the word “Lapp,” but today “Sámi” is the respectful term.","zh":"较老的书里有时会用“Lapp”，但如今更尊重的说法是“Sámi（萨米人）”。"},{"en":"The museum updated its labels, replacing “Lapp” with “Sámi” to be culturally accurate.","zh":"博物馆更新了展品说明，把“Lapp”改为“Sámi”，以更准确且更尊重当地文化。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s surname, or part of a company/place name (e.g., in brand or family names).","zh":"姓氏；或公司/地名中的一部分（如品牌名或家族名）。"},"examples":[{"en":"Ms. Lapp will lead the meeting today.","zh":"Lapp 女士今天将主持会议。"},{"en":"The report was written by Dr. Lapp.","zh":"这份报告由 Lapp 博士撰写。"}]}],"synonyms":["Sámi"],"phonetic":"/læp/","extraExplanation":["在英语里，“Lapp”常与“Lapland（拉普兰）”一起出现在旧资料中，但许多萨米人认为该词带有外来者的刻板印象与贬义色彩，因此现代英语更推荐用 “Sámi”。在学术、博物馆、新闻等正式语境中尤其应避免使用该旧称，除非是在引用历史原文并加以说明。"]}
{"word":"lappa","summary":{"en":"A lappa is a West African wrap cloth or wrap skirt worn around the waist or body.","zh":"lappa 指西非常见的裹布/围布式衣物，通常围在腰间或裹在身上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(West Africa) A rectangular piece of cloth worn wrapped around the waist or body, like a skirt or wrap; also the garment made from this cloth.","zh":"（西非）一块长方形布料，常围在腰间或裹在身上像裙子/披裹；也可指这种裹布式衣物本身。"},"examples":[{"en":"She tied a bright lappa around her waist before going to the market.","zh":"她去市场前在腰间系上了一条色彩鲜艳的裹布（lappa）。"},{"en":"In many coastal towns, women wear a lappa with a matching headscarf.","zh":"在许多沿海城镇，女性常穿裹布（lappa），并搭配同色头巾。"}]}],"synonyms":["wrap","wrap skirt","wrapper (West African English)"],"phonetic":"/ˈlæpə/","extraExplanation":["“lappa”常见于西非英语语境（如塞拉利昂、利比里亚等），指日常穿着的裹布/围布，功能类似“wrap skirt”。不同地区也可能用其他词（如“wrapper”）来称呼。","这种裹布既是衣物也可能是身份与审美的表达：图案、颜色和系法可用于日常、节庆或礼仪场合。"]}
{"word":"lappaceous","summary":{"en":"Lappaceous means “burr-like and clinging,” literally (plants/seeds) and sometimes figuratively (hard to shake off).","zh":"lappaceous 意为“像刺果/刺球一样会黏附”，可指植物种子，也可比喻难以摆脱的情绪或习惯。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having sticky burrs or resembling a burr; clinging easily to clothing, hair, or fur.","zh":"有刺果般的黏附性；像蒺藜/牛蒡刺球那样容易粘在衣物、头发或毛发上的。"},"examples":[{"en":"After our hike, the dog’s fur was full of lappaceous seeds.","zh":"徒步后，狗的毛里沾满了这种会粘人的刺果种子。"},{"en":"Lappaceous burrs stuck to my socks and were hard to remove.","zh":"黏人的刺球粘在我的袜子上，很难弄下来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Tending to cling or persist stubbornly (often about memories, habits, or worries).","zh":"（比喻）容易纠缠不放、顽固地“粘着”（常形容记忆、习惯或烦恼）。"},"examples":[{"en":"The lappaceous fear of failing kept returning before every exam.","zh":"每次考试前，那种“粘着不走”的失败恐惧都会反复出现。"},{"en":"He tried to break the lappaceous habit of checking his phone every few minutes.","zh":"他努力改掉那种总是几分钟就看一次手机的“黏人”习惯。"}]}],"synonyms":["burry","burr-like","sticky","clinging","tenacious","persistent"],"phonetic":"/ləˈpeɪʃəs/","extraExplanation":["“lappaceous”比较书面、偏植物学用语，来自拉丁语 *lappa*（牛蒡/刺球），常用来形容带钩刺、会黏附传播的果实或种子。日常英语里更常见的说法是 *burr-y*, *burry*, *sticky*, *clingy*（比喻时也常用 *clingy* 或 *persistent*）。","自然文学或描写野外场景的文本里偶尔会用它来营造触感：刺球“黏上来、拽不掉”的画面感很强。"]}
{"word":"lappage","summary":{"en":"Lappage means the gentle lapping motion or sound of liquid (especially waves), and more rarely the sound of licking or lapping up a drink.","zh":"Lappage 指液体（尤其海浪）轻轻拍打的动作或声音；较少见时也指舔着喝/啜饮的声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or sound of liquid moving gently, especially when it “laps” against something (like waves against a shore)","zh":"（尤指水）轻轻拍打、荡漾的动作或声音（如海浪拍岸）"},"examples":[{"en":"We fell asleep to the lappage of the waves against the boat.","zh":"我们在海浪轻轻拍打船身的声音中睡着了。"},{"en":"The quiet lappage of the fountain made the garden feel calm.","zh":"喷泉水声轻轻荡漾，让花园显得很宁静。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the act or sound of licking or drinking with the tongue in repeated quick movements","zh":"（较少见）用舌头反复快速舔/啜饮的动作或声音"},"examples":[{"en":"The kitten’s lappage at the bowl was soft and steady.","zh":"小猫在碗边啜饮的声音轻柔而有规律。"}]}],"synonyms":["lapping","lap","washing (of waves)","rippling","splashing (gentle)"],"phonetic":"/ˈlæpɪdʒ/","extraExplanation":["“lappage”由动词“lap”（轻拍；舔着喝）加名词后缀“-age”构成，带有“动作/过程”的意思。","这个词在现代英语中比较少见，更常见的表达是“lapping (sound)”或“the sound of waves lapping”。在文学或描写性写作里偶尔会用来营造宁静、细腻的氛围。"]}
{"word":"lapped","summary":{"en":"“Lapped” is the past form of “lap”: to drink by licking, to wash against gently (waves), or to overlap/cover; it can also mean “overlapping.”","zh":"“lapped”是“lap”的过去式/过去分词：可指（动物）舔饮、（海浪等）轻拍冲刷，也可指覆盖/重叠；还可作形容词表示“重叠的/搭接的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “lap”: to drink (a liquid) with the tongue in quick strokes, like a cat or dog.","zh":"“lap”的过去式/过去分词：用舌头快速舔饮液体（常指猫狗等动物）。"},"examples":[{"en":"The kitten lapped milk from the bowl.","zh":"小猫从碗里舔牛奶。"},{"en":"After the run, the dog lapped up water eagerly.","zh":"跑完后，狗急切地舔水喝。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “lap”: (of water) to touch or wash against something gently and repeatedly.","zh":"“lap”的过去式/过去分词：（水）轻轻拍打、反复冲刷（岸边等）。"},"examples":[{"en":"Small waves lapped the shore.","zh":"小浪轻轻拍打着岸边。"},{"en":"Water lapped at the boat as we waited.","zh":"我们等待时，水轻轻拍着船身。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “lap”: to cover, wrap, or fold one part over another; to overlap.","zh":"“lap”的过去式/过去分词：覆盖、包裹；把一部分叠在另一部分上（重叠）。"},"examples":[{"en":"She lapped the blanket over the child.","zh":"她把毯子盖在孩子身上。"},{"en":"The carpenter lapped the boards to make a tighter joint.","zh":"木匠把木板搭接起来，让接缝更紧。"}]},{"partOfSpeech":"adj.","definition":{"en":"overlapping; laid partly over something else (often used before a noun).","zh":"（常作定语）重叠的；搭接的；部分覆盖在另一物上的。"},"examples":[{"en":"Use lapped joints to keep the wood from splitting.","zh":"使用搭接榫/搭接接头，能减少木材开裂。"},{"en":"The lapped edges made the roof more waterproof.","zh":"重叠的边缘让屋顶更防水。"}]}],"synonyms":["licked (drink)","sipped (informal, not exact)","washed against","rippling against","overlapped","covered","wrapped"],"phonetic":"/læpt/","extraExplanation":["“lapped”最常见的两种画面感用法：\n1）动物“舔着喝”（lap / lap up）：强调舌头快速接触液体；\n2）水“轻拍、轻涌”（waves lapped the shore）：语气很柔和，常见于描写风景的文字。\n另外，“lapped/overlapped”在工艺、建筑里常指“搭接/重叠”的结构（如lapped joint）。"]}
{"word":"lapper","summary":{"en":"Lapper means (1) a person/animal that drinks by lapping, or (2) a tool/machine/worker used for lapping (precision polishing).","zh":"Lapper 指（1）用舌头舔饮的人/动物，或（2）用于研磨抛光（lapping）的工具/机器/工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or animal that laps (drinks liquid with the tongue in quick strokes)","zh":"（人或动物）用舌头舔饮的人/动物"},"examples":[{"en":"The puppy was a noisy lapper, finishing the water in seconds.","zh":"小狗舔水的声音很大，几秒钟就把水喝完了。"},{"en":"At the bowl, the cat became a steady lapper.","zh":"在碗边，那只猫一直很稳定地舔着喝。"}]},{"partOfSpeech":"n.","definition":{"en":"a machine, tool, or worker used for lapping (polishing a surface to make it very smooth, often in manufacturing)","zh":"（制造业）研磨机；研磨工具；研磨工（用于“lapping”精密抛光/研磨）"},"examples":[{"en":"The parts were finished on a lapper to improve smoothness.","zh":"这些零件用研磨机做最后处理，以提高表面光滑度。"},{"en":"She works as a lapper in a small metal shop.","zh":"她在一家小型金工车间做研磨工。"}]}],"synonyms":["licker","lapping machine","polisher"],"phonetic":"/ˈlæpər/","extraExplanation":["“lapper”在日常英语里不太常见，通常更常用动词“lap”（舔饮）或名词“a machine for lapping / a lapping machine”。在技术/工业语境中（如精密加工、抛光），它更容易出现。"]}
{"word":"lappered","summary":{"en":"“Lapperted” is an archaic/dialect word meaning “wrapped or loosely covered; enveloped.”","zh":"“lappered”是古用/方言词，意为“被包裹的、被笼罩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dialect/archaic) wrapped, folded around, or covered loosely (often with cloth, mist, or darkness).","zh":"（方言/古用）被裹住的；被包围的；松松地披着（常指布料、雾气、黑暗等）。"},"examples":[{"en":"The child was lappered in a warm shawl.","zh":"孩子被暖暖的披肩裹着。"},{"en":"The hills lay lappered in morning mist.","zh":"群山笼在清晨的薄雾里。"}]},{"partOfSpeech":"vt.","definition":{"en":"(dialect/archaic) past form of “lapper”: to wrap or cover loosely; to envelop.","zh":"（方言/古用）“lapper”的过去式/过去分词：把……包裹起来；使……笼罩。"},"examples":[{"en":"She lappered the bread in a cloth to keep it soft.","zh":"她用布把面包包起来，让它保持柔软。"}]}],"synonyms":["wrapped","covered","enveloped","swathed"],"phonetic":"/ˈlæpɚd/","extraExplanation":["“lappered”多见于苏格兰英语（Scots）或较早的文学语体里，现代日常英语更常用 enveloped / wrapped / covered 来表达同样意思。","它与常见动词“lap（舔着喝/拍打水面）”不同：lap 的过去式是 lapped，不是 lappered。读文学作品时若看到 lappered，通常是在写“裹住、笼罩”的意象。"]}
{"word":"lappering","summary":{"en":"“Lappering” is a rare variant of “lapping”: the soft sound/motion of water hitting a surface, or drinking by lapping with the tongue.","zh":"“lappering”多为“lapping”的少见变体：指水轻拍发出的声音/动作，或指用舌头舔饮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/variant) the action of water or another liquid moving and making a soft sound as it hits something (like a shore or the side of a boat); lapping.","zh":"（少见/变体拼写）指水或其他液体轻轻拍打岸边、船舷等并发出轻柔声音的动作；（水）轻拍、潺潺拍岸。"},"examples":[{"en":"We fell asleep to the lappering of waves against the dock.","zh":"我们在海浪轻轻拍打码头的声音中睡着了。"},{"en":"The lake’s lappering sound was calm and steady.","zh":"湖水轻拍的声音平静而有节奏。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/variant) drinking by repeatedly touching a liquid with the tongue; lapping (like a cat or dog).","zh":"（少见/变体拼写）用舌头反复舔取液体来喝；（像猫狗一样）舔饮。"},"examples":[{"en":"The puppy kept lappering at the bowl of water.","zh":"小狗一直对着水碗舔饮。"},{"en":"After the run, he was lappering water from his cupped hands.","zh":"跑完后，他用双手捧水舔着喝。"}]}],"synonyms":["lapping","lapping sound","rippling","slapping (of waves)","licking (to drink)"],"phonetic":"/ˈlæpərɪŋ/","extraExplanation":["“lappering”在现代英语里很少见，很多情况下人们更常写作“lapping”（水拍打的声音/动作；或用舌头舔着喝）。如果你是在文学作品、方言文本或较旧的写法里看到“lappering”，通常可以理解为“lapping”的一种变体拼写。"]}
{"word":"lappers","summary":{"en":"“Lappers” usually means animals/people that drink by lapping, or (in sports) athletes who lap others.","zh":"“lappers”通常指用舌头舔着喝水的人/动物；也可指在比赛中“套圈”别人的运动员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “lapper”: a person or animal that drinks liquid by lapping it up with the tongue (like a cat or dog).","zh":"“lapper”的复数：指用舌头舔着喝液体（像猫狗那样）的人或动物。"},"examples":[{"en":"Cats are quick lappers, so the water level drops fast.","zh":"猫喝水舔得很快，所以水位降得很快。"},{"en":"The puppies were noisy lappers around the bowl.","zh":"小狗们围着碗舔水，吵吵闹闹的。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “lapper”: in sports (especially swimming), someone who “laps” others—finishes a full lap ahead of them.","zh":"“lapper”的复数：在体育运动中（尤指游泳）指“套圈者/超一圈的人”，即领先对手整整一圈。"},"examples":[{"en":"In the final 200 meters, the strongest swimmers became lappers.","zh":"在最后的200米里，最强的游泳选手开始把别人套圈。"},{"en":"The race had a few lappers and many beginners far behind.","zh":"这场比赛有几位套圈选手，也有许多初学者远远落后。"}]}],"synonyms":["lickers","drinkers","front-runners","leaders"],"phonetic":"/ˈlæpɚz/","extraExplanation":["“lapper”来自动词“lap”（用舌头舔着喝；或在比赛中“套圈”）。因此“lappers”可能出现在宠物/自然描写里（喝水），也可能出现在跑步或游泳的比赛报道里（领先一圈）。","如果你是在某段具体文本里看到“lappers”，它也可能是特定圈子里的昵称或网名用法；给我一句原文我可以帮你判断是哪一种意思。"]}
{"word":"lappet","summary":{"en":"A lappet is a small hanging flap—usually of cloth on clothing (like ear flaps on a hat) or a flap of skin (often on an animal’s ear).","zh":"lappet 指“小垂片/小瓣”，常见于服装上的垂下布片（如帽子的护耳）或动物耳朵等处的下垂皮瓣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small flap of cloth or a hanging piece on clothing (often decorative), especially on a hat or garment.","zh":"（衣物上的）小垂片/饰片；（常指帽子或服装上的）垂下布片，常用于装饰。"},"examples":[{"en":"The winter hat has ear lappets that you can tie under your chin.","zh":"这顶冬帽有可以系在下巴下面的护耳垂片。"},{"en":"Her coat had velvet lappets at the collar.","zh":"她的外套领口有天鹅绒饰片。"}]},{"partOfSpeech":"n.","definition":{"en":"A hanging flap of skin, especially the loose part of an animal’s ear (also called an ear lappet).","zh":"（尤指动物耳朵的）下垂皮瓣；耳垂状部分（也可说 ear lappet）。"},"examples":[{"en":"The rabbit’s long ear lappets drooped as it rested.","zh":"兔子休息时，长长的耳垂皮瓣耷拉着。"},{"en":"Some breeds have soft lappets that cover part of the ear canal.","zh":"有些品种有柔软的下垂皮瓣，能覆盖住部分耳道。"}]},{"partOfSpeech":"n.","definition":{"en":"In some butterflies and moths, a small flap or lobe on the wing.","zh":"（昆虫学）某些蝴蝶或蛾类翅上的小叶片/突起。"},"examples":[{"en":"The guide noted a small lappet on the hind wing.","zh":"图鉴提到后翅上有一个小叶片。"}]}],"synonyms":["flap","tab","earflap","lobe"],"phonetic":"/ˈlæpɪt/","extraExplanation":["“lappet”来自“lap”（覆盖、搭在……上）这一词根，核心感觉是“垂下来的小片/小瓣”，常见于服饰描写（例如帽子的护耳）以及动物外形描写。文学或描写性写作里，它常用来营造细节感，比如描写寒冷天气的装束或动物的耳朵形态。"]}
{"word":"lappeted","summary":{"en":"“Lappeted” usually means “having hanging flaps (lappets),” especially in clothing or descriptive writing; it can also be the past form of the rare verb “to lappet.”","zh":"“lappeted”通常表示“带有下垂垂片（lappets）的”，多用于服饰或描写性文字；也可作罕见动词 lappet 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having lappets (hanging flaps or folds), especially on clothing, headwear, or in descriptive/literary writing.","zh":"带有垂片（下垂的布片/褶片）的；（尤用于）衣物、帽饰等的描述或文学描写。"},"examples":[{"en":"He wore a lappeted cap that covered his ears against the wind.","zh":"他戴着一顶带垂片的帽子，用来挡风护耳。"},{"en":"In the old portrait, the soldier’s helmet looks lappeted at the sides.","zh":"在那幅旧肖像里，士兵的头盔两侧看起来带有垂片。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of the rare verb “to lappet”: to add flaps to, or to hang/cover like flaps.","zh":"罕见动词 lappet 的过去式/过去分词：加上垂片；像垂片一样下垂或覆盖。"},"examples":[{"en":"The costume was lappeted with extra fabric to create a medieval look.","zh":"这套服装加了额外的布片，做出中世纪的效果。"}]}],"synonyms":["flapped","with ear flaps","with side flaps","tabbed"],"phonetic":"ˈlæpɪtɪd","extraExplanation":["“lappeted”来自名词 lappet，指衣物或头饰上“下垂的布片/耳片”，也可指动物耳朵等“下垂部分”。这个词在现代日常英语中很少见，更常出现在服装史、艺术/肖像描述、文学描写或较正式的说明中。","更常用的现代说法通常是：with ear flaps（带护耳片的）、flapped（有翻片的）、with side flaps（带侧片的）。"]}
{"word":"lappethead","summary":{"en":"An archaic insult meaning a foolish or slow-witted person.","zh":"一个古旧的侮辱性词，指愚笨或反应迟钝的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, derogatory) A foolish or slow-witted person; a blockhead.","zh":"（古旧、贬义）愚笨的人；笨蛋；木头脑袋。"},"examples":[{"en":"He dismissed the idea and called anyone who believed it a “lappethead.”","zh":"他否定了这个想法，并把相信它的人称作“lappethead”（笨蛋）。"},{"en":"The word appears in older writing, but it sounds harsh and insulting today.","zh":"这个词在较早的文字里能见到，但在今天听起来很刻薄、带侮辱性。"}]}],"synonyms":["blockhead","dullard","numskull","fathead","idiot (informal)"],"phonetic":"/ˈlæpɪtˌhɛd/","extraExplanation":["“lappethead”属于非常少见的旧式侮辱语，现代英语中几乎不用；即使用也会显得粗鲁、刻薄。更常见、更中性的表达可以用：fool（傻瓜，较轻）、silly（傻的/可笑的）、slow-witted（反应慢的，较委婉），或在更正式语境中用：uninformed（不了解情况的）、mistaken（搞错的）。","词源上，“lappet”指“垂下的布片/耳垂样的垂片（如帽子的护耳）”，组合成“lappet + head”形成外貌类的贬称，后来引申为“笨人/傻瓜”。"]}
{"word":"lappets","summary":{"en":"Lappets are hanging flaps of fabric on clothing (often hats) or drooping folds of skin/ears in animals.","zh":"lappets 指衣物（常见于帽子）的下垂布片/垂片，也可指动物的下垂皮褶或长耳垂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loose flaps or hanging pieces of fabric, especially on clothing or headwear.","zh":"（衣服或帽子上的）垂片；下垂的布片"},"examples":[{"en":"Her winter hat has ear lappets to keep her warm.","zh":"她的冬帽有护耳垂片，用来保暖。"},{"en":"The costume designer added long lappets to the robe for a dramatic look.","zh":"服装设计师在长袍上加了长垂片，让造型更有戏剧感。"}]},{"partOfSpeech":"n.","definition":{"en":"In some animals, a hanging fold of skin, especially around the ears or neck.","zh":"（某些动物的）垂皮；下垂的皮褶（尤指耳部或颈部）"},"examples":[{"en":"The rabbit’s lappets drooped as it relaxed.","zh":"兔子放松时，耳垂耷拉下来。"},{"en":"Some breeds have long lappets that frame the face.","zh":"有些品种有很长的垂皮（或长耳垂），把脸部衬托出来。"}]}],"synonyms":["flaps","tabs","folds","earflaps"],"phonetic":"/ˈlæpɪts/","extraExplanation":["“lappets”是复数形式，单数是“lappet”。在现代英语里，这个词多见于服饰描述（尤其是帽子的护耳垂片）或对动物外形的描写，带一点偏“描写性/书面”的感觉。"]}
{"word":"lappic","summary":{"en":"Lappic is a rare, older term meaning “Sámi,” used for the Sámi people or their languages.","zh":"Lappic 是较少见且偏旧的用语，通常指“萨米的/萨米语（Sámi）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Sámi people (historically called “Lapps”) or their languages; an older, now often considered outdated term for “Sámi.”","zh":"与萨米人（历史上曾被称为“Lapps”）或其语言有关；较旧、如今常被认为不太合适的说法，相当于“Sámi（萨米的）”。"},"examples":[{"en":"Some older books refer to the Sámi languages as “Lappic,” but “Sámi” is the preferred term today.","zh":"一些旧书把萨米语族称为“Lappic”，但如今更推荐用“Sámi”。"},{"en":"The museum updated the label from “Lappic culture” to “Sámi culture.”","zh":"博物馆把“Lappic culture（拉普文化）”的标签更新为“Sámi culture（萨米文化）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A Sámi language (or the Sámi languages as a group); a rare, older usage.","zh":"（某种）萨米语；或指萨米语族整体（较少见的旧用法）。"},"examples":[{"en":"The article discusses Lappic and other Uralic languages.","zh":"这篇文章讨论了萨米语（Lappic）以及其他乌拉尔语系语言。"}]}],"synonyms":["Sámi","Saamic"],"phonetic":"/ˈlæpɪk/","extraExplanation":["“Lapp/Lapps”在英语中是历史称呼，但在当代常被认为不够尊重或带有过时色彩，因此学术与公共场合更倾向使用“Sámi（萨米）”。如果你是在阅读语言学材料，看到“Lappic”，通常就是指“Sámi languages（萨米诸语言）”。","拼写提示：你输入的“lappic”很可能就是这个词；如果你原本想查的是别的词（例如“lapidary / lapping / lactic”），告诉我上下文句子我可以帮你确认。"]}
{"word":"lappilli","summary":{"en":"Lapilli are small, pebble-sized volcanic fragments ejected in eruptions.","zh":"Lapilli 指火山喷发喷出的卵石大小火山碎屑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small pebble-sized bits of volcanic rock (about 2–64 mm across) thrown out during an eruption; commonly used as a plural noun in geology.","zh":"（火山学）火山喷发时抛出的“卵石大小”的碎屑（约2–64毫米）；在地质语境中常作复数名词使用。"},"examples":[{"en":"The trail was covered with lapilli from an ancient eruption.","zh":"这条小路上覆盖着一次远古喷发留下的火山碎屑（lapilli）。"},{"en":"Scientists studied the lapilli layers to date the eruption.","zh":"科学家研究火山碎屑（lapilli）的层位来为喷发定年。"}]}],"synonyms":["tephra","volcanic cinders","scoria fragments","volcanic gravel"],"phonetic":"/ləˈpɪlaɪ/","extraExplanation":["你写的 **lappilli** 更常见的标准拼写是 **lapilli**（只有一个 p）。它来自拉丁语 *lapillus*（“小石子”），英语里 **lapilli** 多被当作复数使用；若要表达单数，可用 **lapillus**（较少见）。"]}
{"word":"lapping","summary":{"en":"Lapping most often means the gentle, repeated sound/motion of waves, or the action of an animal drinking with its tongue. It can also describe something that overlaps in layers.","zh":"Lapping 常指海浪轻轻反复拍打的声音/动作，也可指动物用舌头舔饮的动作；还可形容层层相叠、部分覆盖的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the soft, repeated sound of water or waves touching a shore or the side of a boat","zh":"（水波）轻轻拍打的声音；潺潺水声"},"examples":[{"en":"We fell asleep to the lapping of waves against the beach.","zh":"我们在海浪轻拍海滩的声音中睡着了。"},{"en":"The lapping of water under the dock was calm and steady.","zh":"码头下的水轻轻拍打着，平静而有节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"the action of drinking or eating with quick movements of the tongue (often used for animals)","zh":"（多指动物）用舌头快速舔饮（舔食）的动作"},"examples":[{"en":"The cat’s lapping at the bowl was the only sound in the room.","zh":"猫在碗边舔饮的声音是房间里唯一的声响。"},{"en":"He watched the dog lapping up water after the run.","zh":"他看着狗跑完后大口舔水。"}]},{"partOfSpeech":"adj.","definition":{"en":"covering or touching partly; overlapping in layers (often in “lapping waves/roof tiles/skirts”)","zh":"部分覆盖；层层相叠的（常见于 lapping waves/roof tiles/skirts 等搭配）"},"examples":[{"en":"Lapping waves rolled over the rocks in slow lines.","zh":"层层海浪缓缓涌过礁石。"},{"en":"The roof has lapping tiles to keep rain out.","zh":"屋顶瓦片层层搭接，用来防雨。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “lap”: (1) to touch gently and repeatedly (water), or (2) to drink/eat with the tongue","zh":"lap 的现在分词：（1）（水）轻拍、轻触；（2）用舌头舔饮、舔食"},"examples":[{"en":"Small waves were lapping at the boat.","zh":"小浪轻轻拍打着船身。"},{"en":"The puppy was lapping milk from a dish.","zh":"小狗在盘子里舔牛奶。"}]}],"synonyms":["lapping of waves: splashing (sometimes), wash (of waves)","animal drinking: licking, lapping up","overlapping: overlapping, layered"],"phonetic":"/ˈlæpɪŋ/","extraExplanation":["“lapping”最常见的文学/描写性用法是名词或形容词，尤其出现在自然描写里：the lapping of waves（海浪轻拍声）。这种声音通常给人“安静、规律、放松”的感觉。","固定搭配：lap up 常指“（动物）舔光、喝光”，也可比喻“津津有味地接受/享受”（如：lap up praise 享受赞美、照单全收）。注意这时更常写成动词短语，而不是名词 lapping。"]}
{"word":"Lappish","summary":{"en":"Related to Lapland or the Sámi; also an older term for a Sámi language.","zh":"与拉普兰或萨米人相关；也可指萨米语的旧称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Lapland or to the Sámi people and their culture (now often replaced by “Sámi” in respectful modern usage).","zh":"与拉普兰地区或萨米人（Sámi）及其文化有关的（现代更常用更尊重的说法是“Sámi/萨米”）。"},"examples":[{"en":"The museum has an exhibit on Sámi culture, including traditional clothing once described as Lappish.","zh":"博物馆有一个关于萨米文化的展览，包括过去常被称作 Lappish 的传统服饰。"},{"en":"She is researching Lappish folktales from northern Scandinavia.","zh":"她在研究北斯堪的纳维亚的萨米民间故事（旧称 Lappish）。"}]},{"partOfSpeech":"n.","definition":{"en":"A Sámi language or dialect (older term; today “Sámi” or “Sámi languages” is preferred).","zh":"萨米语（或其方言）（较旧的称呼；如今更常用 “Sámi / Sámi languages / 萨米诸语言”）。"},"examples":[{"en":"The archive labels the recordings as Lappish, but the speakers are using Northern Sámi.","zh":"档案把这些录音标为 Lappish，但说话者使用的是北萨米语。"}]}],"synonyms":["Sámi","Sámi language","Lapland"],"phonetic":"/ˈlæpɪʃ/","extraExplanation":["用法提醒：在当代英语里，谈到民族与语言时通常用 “Sámi” 更准确也更尊重；“Lappish”多见于较老的书籍、地图标注或历史语境。若不确定，优先用 “Sámi culture / Sámi languages”。"],"etymology":"源自英语中对“Lapp（拉普人）/Lapland（拉普兰）”的旧称体系，后加形容词后缀 -ish 构成。现代语境中，“Lapp”在不少场合被视为过时甚至可能冒犯，因此更推荐使用“Sámi/萨米”。","mnemonic":["把 -ish 记成“……的”：Lapp + ish ≈ “拉普（兰/人）相关的”。","联想“Lapland（拉普兰）”→ Lappish：看到地名就能想到这是“与拉普兰/萨米相关的旧称”。"]}
{"word":"lappish","summary":{"en":"“Lappish” means ‘Sámi-related’ (people/culture/language) and can also refer to the Sámi language(s), though the term is somewhat outdated.","zh":"“lappish”主要指与萨米人及其文化/语言有关；也可指萨米语，但该词在现代语境中略显过时。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Sámi people, their culture, or their languages (especially in or near Lapland in northern Norway, Sweden, Finland, and Russia).","zh":"与萨米人（Sámi）及其文化或语言有关的；多指北欧拉普兰地区（挪威、瑞典、芬兰及俄罗斯北部一带）。"},"examples":[{"en":"The museum has a small collection of Lappish handicrafts.","zh":"这家博物馆收藏了一小批萨米（拉普兰）手工艺品。"},{"en":"She is studying a Lappish language as part of her linguistics program.","zh":"她在语言学课程中学习一门萨米语言。"}]},{"partOfSpeech":"n.","definition":{"en":"The Sámi language(s) (used as a noun, but less common in modern usage).","zh":"萨米语（或萨米诸语言；作名词用，但现代用法较少见）。"},"examples":[{"en":"He can read some Lappish, but he’s not fluent.","zh":"他能读一点萨米语，但并不流利。"}]}],"synonyms":["Sámi","Saami","Lapland (regional, not a direct synonym)"],"phonetic":"/ˈlæpɪʃ/","extraExplanation":["“Lappish”源自旧称“Lapp（拉普人）”。在英语里，“Lapp”在一些语境中被认为过时甚至带有冒犯性；更尊重、更常用的说法是“Saami/Sámi（萨米人）”，以及“Saami languages（萨米诸语言）”。如果是在学术或历史文本中见到“Lappish”，通常可理解为“Saami”。","“Lapland（拉普兰）”是一个地理/文化区域名称，并不等同于一个单一民族或单一语言；萨米语实际上包括多种彼此相关但不完全相同的语言。"]}
{"word":"lapponese","summary":{"en":"“Lapponese” refers to Lapland or the Sámi people (older term; “Sámi” is preferred today).","zh":"“lapponese”指与拉普兰或萨米人有关（较旧用法；如今更推荐用“Sámi/萨米人”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian word used in English-context discussions) relating to Lapland or to the Sámi people and their culture.","zh":"（意大利语词，在英语语境中常用于讨论）与拉普兰（Lapland）或萨米人（Sámi）及其文化有关的。"},"examples":[{"en":"She is studying Lapponese (Sámi) folk music from northern Scandinavia.","zh":"她正在研究北斯堪的纳维亚的拉普兰（萨米）民间音乐。"},{"en":"The museum has an exhibit on Lapponese traditions and reindeer herding.","zh":"博物馆有一个关于拉普兰（萨米）传统与驯鹿放牧的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Lapland, especially a Sámi person (older usage; today “Sámi” is usually preferred).","zh":"拉普兰人，尤其指萨米人（较旧用法；如今通常更推荐用“Sámi/萨米人”）。"},"examples":[{"en":"In older travel writing, a Lapponese might be described as living a nomadic life with reindeer.","zh":"在较早的旅行写作中，常把“lapponese（拉普兰人）”描写成与驯鹿一起过游牧生活的人。"}]}],"synonyms":["Sámi","Lapland (adj. use: of Lapland)","Laplandic (rare)"],"phonetic":"/ˌlæpəˈniːz/","extraExplanation":["“Lapponese”源自意大利语，字面与“Lapland（拉普兰）”相关。在英语里更常见的说法是“Sámi”（指民族与文化）以及“Lapland/Laplandic”（指地区相关）。","需要注意：英语中“Lapp”一词在当代可能被视为过时或带冒犯性，因此谈到民族身份时一般用“Sámi”。当你指的是地理区域（芬兰、瑞典、挪威和俄罗斯北部的一部分）时，用“Lapland”更中性。"]}
{"word":"lapponian","summary":{"en":"Lapponian is a mostly historical word meaning “of Lapland” or “of the Sámi people/languages,” and it is often avoided today in favor of “Sámi” or “Lapland.”","zh":"Lapponian 多为历史用语，意为“与拉普兰有关”或“与萨米人/萨米语有关”；如今常用更现代的“Sámi”或“Lapland”来替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(mostly historical) relating to Lapland (a region in northern Norway, Sweden, Finland, and Russia) or to the Sámi people who live there.","zh":"（多为历史用法）与拉普兰（北欧与俄罗斯北部地区）有关的；与居住在该地区的萨米人有关的。"},"examples":[{"en":"Some 19th-century travel books describe “Lapponian” clothing and winter customs.","zh":"一些19世纪的游记会描述“Lapponian（拉普兰/萨米）”的服饰和冬季习俗。"},{"en":"The museum’s old catalog uses “Lapponian” to label items from northern Scandinavia.","zh":"这家博物馆的旧目录用“Lapponian”来标注来自斯堪的纳维亚北部的藏品。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a person from Lapland; sometimes used to mean a Sámi person (now often considered outdated).","zh":"（历史用法）拉普兰人；有时指萨米人（如今常被认为过时）。"},"examples":[{"en":"The article refers to the “Lapponians” in language typical of that period.","zh":"这篇文章用当时常见的说法把他们称为“Lapponians（拉普兰人/萨米人）”。"},{"en":"Today many writers avoid “Lapponian” and use “Sámi people” instead.","zh":"如今许多作者会避免使用“Lapponian”，改用“Sámi people（萨米人）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical linguistics) the Sámi languages, or one of them (older terminology).","zh":"（历史语言学）萨米语族，或其中一种语言（旧称）。"},"examples":[{"en":"An older grammar book may call Northern Sámi “Lapponian.”","zh":"较早的语法书可能会把“北萨米语”称作“Lapponian”。"},{"en":"Modern works usually say “Sámi languages,” not “Lapponian.”","zh":"现代著作通常说“Sámi languages（萨米语族）”，而不是“Lapponian”。"}]}],"synonyms":["Sámi (preferred in modern usage)","of Lapland","Lappish (often outdated)","Sámi languages"],"phonetic":"/ləˈpoʊniən/","extraExplanation":["“Lapponian”来自“Lapp”（对萨米人的旧称）+ “-onian”。“Lapp”在一些语境中可能被视为过时或不够尊重，因此当代英文更推荐用“Sámi”/“Sámi people（萨米人）”以及“Lapland（拉普兰）”来表达。","如果你在老书、旧博物馆标签或历史文献中看到“Lapponian”，通常是在描述拉普兰地区或萨米人的文化、语言；写作时建议使用更现代、准确的称呼，并在引用原文时说明这是旧用法。"]}
{"word":"lapps","summary":{"en":"“Lapps” is a dated term for the Sámi people; today, “Sámi” is the preferred and more respectful word.","zh":"“Lapps”是指萨米人的旧称；如今更推荐且更尊重的说法是“Sámi（萨米人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, sometimes offensive) A term formerly used to refer to the Sámi people, an Indigenous people of northern Scandinavia and parts of Russia.","zh":"（旧称，有时带冒犯性）过去用来指“萨米人”（Sámi），即居住在北欧北部及俄罗斯部分地区的原住民族。"},"examples":[{"en":"Older books sometimes use the word “Lapps,” but today “Sámi” is preferred.","zh":"一些旧书里会用“Lapps”，但如今更推荐用“Sámi（萨米人）”。"},{"en":"The museum updated its labels to say “Sámi people” instead of “Lapps.”","zh":"博物馆更新了说明牌，把“Lapps”改为“Sámi people（萨米人）”。"}]}],"synonyms":["Sámi","Sami people"],"phonetic":"/læps/","extraExplanation":["在英语里，“Lapps”是较老的用法，现代语境中常被认为不准确或带有贬义色彩，因此在正式写作与礼貌表达中应避免使用。","更中性且尊重的说法是“Sámi”（单复数都常用“Sámi”），也可说“Sámi people”。","你输入的“lapps”全小写也可能只是拼写/输入错误；如果你原本想查的是其他词（如“laps”“apps”“Lapp’s”），告诉我上下文我可以再确认。"]}
{"word":"Lappula","summary":{"en":"a stickseed plant genus with burr-like fruits that cling easily","zh":"果实像刺球、容易附着的粘籽草属植物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the borage family whose small fruits have hooked bristles that stick to clothing or animal fur; often called stickseed","zh":"一种紫草科植物属，其小果实带倒钩刺毛，容易粘在衣物或动物毛上；常被称为“粘籽草/粘人草（stickseed）”"},"examples":[{"en":"After the hike, we found stickseeds from Lappula stuck all over our socks.","zh":"徒步结束后，我们发现衣袜上粘满了来自 Lappula 的粘籽。"},{"en":"Some Lappula species are considered weeds in dry, open fields.","zh":"一些 Lappula 物种在干燥、开阔的田地里会被当作杂草。"}]}],"synonyms":["stickseed","bur seed"],"phonetic":"/ləˈpjuːlə/","extraExplanation":["这是一个植物学“属名”（genus），在英文科普或野外植物识别资料中常见，通常不当作日常口语词汇使用；日常更常说 *stickseed* 或 *bur seed*。","它们果实上的倒钩刺毛是一种“附着传播”（epizoochory）：靠粘在动物身上被带到别处扩散种子。"],"etymology":"源自拉丁语 *lappa*（“牛蒡/带刺会粘的蒴果或刺球”）相关词形，用于指这类“会粘”的果实特征；*Lappula* 是植物学属名（科学命名）。","mnemonic":["把 *Lappula* 联想成“lappa（会粘的刺球）+ -ula（小的）”：小小的刺果，很容易粘衣服。","联想中文“拉、扑”：一拉就粘住、扑在衣服上不掉——帮助记住它“粘人”的特点。"]}
{"word":"lappula","summary":{"en":"Lappula is a plant genus (stickseed) known for prickly seeds that stick to fur and clothes.","zh":"Lappula 是一种植物属（黏籽草/粘籽草），以带倒钩、会粘在毛和衣物上的刺果种子而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the borage family (Boraginaceae), often called stickseed, whose fruits have tiny hooked prickles that cling to fur or clothing","zh":"（植物）拉普拉属：紫草科的一属小型开花植物，常称“黏籽草/粘籽草（stickseed）”，其果实带细小倒钩，容易粘在动物毛或衣物上"},"examples":[{"en":"Stickseed (Lappula) often spreads when its burr-like seeds catch on hikers’ socks.","zh":"黏籽草（Lappula）的种子像小刺球一样，常会粘在徒步者的袜子上，从而传播到别处。"},{"en":"In some dry, open habitats, you may see Lappula with small blue flowers close to the ground.","zh":"在一些干燥、开阔的环境里，你可能会看到贴地生长、开小蓝花的拉普拉属植物。"}]}],"synonyms":["stickseed","bur stickseed"],"phonetic":"/ləˈpuːlə/","extraExplanation":["“Lappula”是拉丁化的植物学属名，源头与拉丁语 lappa（“蒺藜/牛蒡那类会粘人的刺果、刺球”）有关，-ula 带有“小”的意味，因此可理解为“像小刺果一样的（植物）”。","在英文语境中，它更常以普通名 stickseed（黏籽草）出现；在园艺或野外植物识别手册里才会经常看到属名 Lappula。"]}
{"word":"lapputan","summary":{"en":"Laputan means “from Laputa” (Swift’s *Gulliver’s Travels*) and can also describe impractical, overly theoretical thinking.","zh":"Laputan 指“来自拉普他（《格列佛游记》中的飞岛）”，也可引申形容脱离现实、过度理论化的想法或作风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Relating to Laputa, a fictional flying island in Jonathan Swift’s *Gulliver’s Travels* (1726).","zh":"（文学）与拉普他（Laputa）有关；拉普他是乔纳森·斯威夫特《格列佛游记》（1726）中虚构的“飞岛”。"},"examples":[{"en":"Swift describes the scientists of Laputa in *Gulliver’s Travels*.","zh":"斯威夫特在《格列佛游记》中描写了拉普他岛上的科学家。"},{"en":"The novel uses a Laputan setting to satirize the age’s obsession with “pure theory.”","zh":"这部小说用拉普他的背景来讽刺那个时代对“纯理论”的迷恋。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often figurative) Impractical, overly theoretical, and out of touch with everyday life; absent-minded in a “bookish” way.","zh":"（常为引申义）脱离现实、过于理论化、不接地气；带有“书呆子式”心不在焉的意味。"},"examples":[{"en":"His Laputan ideas sounded brilliant, but they didn’t work in the real world.","zh":"他的想法很“拉普他式”——听起来很聪明，但在现实中行不通。"},{"en":"She gave a Laputan lecture full of formulas but no clear plan.","zh":"她的演讲很“拉普他式”：全是公式，却没有清晰方案。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Laputa; a Laputan inhabitant (in Swift’s story).","zh":"拉普他人；（在斯威夫特作品中）拉普他岛的居民。"},"examples":[{"en":"In the story, the Laputans are fascinated by math and music.","zh":"在故事里，拉普他人痴迷于数学和音乐。"}]}],"synonyms":["impractical","overly theoretical","ivory-tower","academic","abstract"],"phonetic":"/ləˈpuːtən/","extraExplanation":["你输入的 **lapputan** 很可能是拼写变体，常见形式是 **Laputan**（来自 *Laputa*）。在《格列佛游记》中，拉普他象征“只讲高深理论、不管实际生活”的学术风气，所以 **Laputan** 在英文里有时会被用来讽刺“纸上谈兵”的想法或人。","在文学语境中，它带有明显的讽刺色彩；在日常英语里不算常用，但在评论文章、书评或学术文化批评中偶尔能见到。"]}
{"word":"laps","summary":{"en":"“Laps” most commonly means (1) the knees/thighs when sitting (plural of lap) or (2) rounds in a race. It can also be a verb meaning to overtake by a lap, or for waves/animals to lap (wash over/lick up).","zh":"“laps”最常见指（1）坐着时的膝上/腿上（lap的复数），或（2）比赛中的一圈/来回。也可作动词，表示“套圈超过”，或指海浪轻拍、动物用舌头舔/啜饮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the upper part of your legs when you are sitting; also used for holding something or someone (plural of “lap”)","zh":"（坐着时）大腿上方、膝上的部位；也指把东西或人抱在腿上（“lap”的复数）"},"examples":[{"en":"The child sat on her mother’s lap, but now both kids are sitting on their parents’ laps.","zh":"孩子坐在妈妈腿上，但现在两个孩子都坐在父母的腿上。"},{"en":"He balanced his laptop on his lap; a minute later it slid off his lap onto the floor.","zh":"他把笔记本电脑放在腿上；过了一会儿它从腿上滑到地上。"}]},{"partOfSpeech":"n.","definition":{"en":"one complete trip around a track, pool, or course (plural of “lap”)","zh":"（赛道、泳池或路线）一圈；一段完整的环行（“lap”的复数）"},"examples":[{"en":"We ran five laps around the field.","zh":"我们绕着操场跑了五圈。"},{"en":"She swam ten laps in the pool before breakfast.","zh":"她早餐前在泳池游了十个来回（十圈）。"}]},{"partOfSpeech":"v.","definition":{"en":"to pass another competitor by going faster so that you catch up and go past them (third-person singular of “lap”)","zh":"（比赛中）套圈、超过（别人一圈）；赶上并超过对手（“lap”的第三人称单数）"},"examples":[{"en":"In longer races, the fastest runner often laps the slowest runner.","zh":"在长跑中，最快的选手常常会套圈最慢的选手。"},{"en":"He’s so quick that he sometimes laps his teammates during practice.","zh":"他速度太快了，训练时有时会把队友套圈。"}]},{"partOfSpeech":"v.","definition":{"en":"to touch, wash over, or drink with the tongue in small amounts (third-person singular of “lap”)","zh":"轻拍、冲刷（岸边等）；（动物）用舌头舔/啜饮（“lap”的第三人称单数）"},"examples":[{"en":"Small waves lap against the shore.","zh":"小浪轻轻拍打着岸边。"},{"en":"The cat laps up the milk quickly.","zh":"猫很快把牛奶舔/啜饮干净。"}]}],"synonyms":["rounds","circuits","knees","overtakes","outpaces"],"phonetic":"/læps/","extraExplanation":["“lap”作名词时很常见：一是“腿上/膝上”（sit on someone’s lap），二是“圈/来回”（run laps, swim laps）。在跑步或赛车里，“to lap someone”是很固定的用法，意思是“套圈”。注意不要和“overlap（重叠）”混淆。"]}
{"word":"lapsability","summary":{"en":"“Lapsability” means a tendency or likelihood to lapse—make mistakes, lose focus, or relapse into an old pattern.","zh":"“Lapsability”指容易发生“lapse（失误/松懈/复发）”的倾向或可能性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency or likelihood to lapse (for example, to make a mistake, lose concentration, or fall back into an old habit).","zh":"容易“失误/走神/松懈”或“故态复萌（旧习复发）”的倾向；易再度陷入某种状态的可能性。"},"examples":[{"en":"Under pressure, his lapsability showed—he forgot key details during the presentation.","zh":"在压力下，他的“易失误性”显现出来——他在演讲时忘了关键细节。"},{"en":"The program aims to reduce lapsability by giving people daily reminders and support.","zh":"这个项目通过每天的提醒和支持来降低“复发/松懈”的可能性。"},{"en":"Even strong teams have lapsability if they stop communicating.","zh":"即使是强团队，如果停止沟通，也会有“松懈导致出错”的风险。"}]}],"synonyms":["tendency to lapse","susceptibility","likelihood of relapse","propensity"],"phonetic":"/ˌlæpsəˈbɪləti/","extraExplanation":["“lapsability”由“lapse（失误；（状态）滑落；复发）+ -ability（……的可能性/倾向）”构成，意思是“容易发生lapse的特性”。","这是较少见、偏学术/正式的用词；日常表达更常用“likelihood of lapsing / tendency to lapse / risk of relapse（若指复发）”。","语境上可指：注意力松懈、道德/纪律滑坡、计划中断、旧习复发（如戒烟后复吸）等；具体含义通常靠上下文决定。"]}
{"word":"lapsable","summary":{"en":"“Lapsable” is a rare adjective meaning “able/likely to lapse (become invalid or end),” especially in legal or insurance contexts.","zh":"“lapsable”是个较罕见的形容词，表示“可能失效/终止的”，常见于法律或保险语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) able to lapse; likely to become invalid or end if not continued (often used about insurance, contracts, or rights).","zh":"（罕见）可失效的；若不续期/维持就可能终止或失去效力的（常指保险、合同、权利等）。"},"examples":[{"en":"If you stop paying premiums, the policy is lapsable after the grace period.","zh":"如果你停止缴纳保费，宽限期过后这份保单就可能失效。"},{"en":"Some permits are lapsable and must be renewed every year.","zh":"有些许可证是会失效的，必须每年续期。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) capable of slipping into a lapse (a temporary failure, pause, or mistake).","zh":"（罕见）容易出现疏忽/中断（短暂失误、停顿或差错）的。"},"examples":[{"en":"Even experienced speakers are lapsable when they are tired.","zh":"即使是有经验的演讲者，疲劳时也可能出现口误或短暂卡壳。"},{"en":"Memory can be lapsable under stress.","zh":"压力之下记忆可能变得不稳定、容易出差错。"}]}],"synonyms":["liable to lapse","subject to lapse","forfeitable","terminable"],"phonetic":"/ˈlæpsəbəl/","extraExplanation":["“lapsable”在现代英语中非常少见，更常见的表达是“liable to lapse / subject to lapse（可能失效的）”。如果你想表达“可折叠的”，常用词是“collapsible / foldable”，不是“lapsable”。","词形上它来自“lapse（失效；疏忽）+ -able（可……的）”。在法律/保险语境里更容易见到与“lapse”相关的表述。"]}
{"word":"lapsana","summary":{"en":"Lapsana is a botanical name for a genus of yellow-flowered plants in the daisy family, especially Lapsana communis (common nipplewort).","zh":"Lapsana 是菊科一属植物的学名，常指普通苦荬菜/乳头草（Lapsana communis）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant genus in the daisy family (Asteraceae), especially the species Lapsana communis (common nipplewort), a weedy European herb with small yellow flowers.","zh":"菊科的一属植物（Lapsana），尤指“普通苦荬菜/乳头草”（Lapsana communis），原产欧洲、常见为杂草，开小型黄色花。"},"examples":[{"en":"In some field guides, Lapsana is listed under the common name “nipplewort.”","zh":"在一些野外植物图鉴里，Lapsana 会以俗名“nipplewort（乳头草）”收录。"},{"en":"Lapsana communis often grows along roadsides and in disturbed soil.","zh":"普通苦荬菜（Lapsana communis）常生长在路边或被扰动的土壤中。"}]}],"synonyms":["nipplewort","Lapsana communis"],"phonetic":"/læpˈseɪnə/","extraExplanation":["“Lapsana”是拉丁化的植物学名称，源自古希腊语用来指称某类可食或药用的野菜。英文俗名“nipplewort”据说与其叶形或古代民间用途相关，但在现代多作为识别用的俗称。"]}
{"word":"lapsation","summary":{"en":"Lapsation is a rare noun meaning a lapse—slipping into an error or wrongdoing.","zh":"Lapsation 是个罕用名词，意思是“失误/过失”，尤其指“失足、堕落”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A lapse; a slipping or falling away, especially into an error or wrongdoing.","zh":"（罕用）失误；过失；（尤指）在道德或行为上“失足”、堕落。"},"examples":[{"en":"The report blamed the accident on a momentary lapsation in judgment.","zh":"报告将事故归咎于一时判断失误。"},{"en":"He apologized for his lapsation and promised not to repeat the mistake.","zh":"他为自己的过失道歉，并承诺不再重犯。"}]}],"synonyms":["lapse","slip","error","misstep","fall"],"phonetic":"/læpˈseɪʃən/","extraExplanation":["“lapsation”非常少见，多用于较正式或书面语境；日常英语里通常用更常见的“lapse”（如：a lapse in judgment/attention）。","词源上来自“lapse”（滑落、失误），带有“从原本的状态滑落/偏离”的意象；因此也可用于较抽象的道德或行为层面的“堕落/失足”。"]}
{"word":"lapse","summary":{"en":"Lapse can mean a small slip or mistake, a temporary return to a worse habit/state, something expiring due to time, or a break/interval.","zh":"lapse 可指小失误/疏忽；（暂时）倒退或复发；（因到期）失效；或一段中断/间隔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small mistake or slip in judgment, memory, or attention.","zh":"（判断、记忆或注意力方面的）小失误；疏忽；口误"},"examples":[{"en":"I made a lapse in judgment and sent the email too quickly.","zh":"我判断失误，邮件发得太快了。"},{"en":"There was a brief lapse in my memory—I forgot his name for a second.","zh":"我记忆一时断片——我一下子忘了他的名字。"},{"en":"A momentary lapse of attention can cause accidents.","zh":"注意力短暂分散就可能引发事故。"}]},{"partOfSpeech":"v.","definition":{"en":"To temporarily become weaker or less careful; to fall back into a bad habit or a previous state.","zh":"（暂时）变得松懈；倒退；（常指）复发、故态复萌"},"examples":[{"en":"After a month of progress, he lapsed into procrastination again.","zh":"进步了一个月后，他又开始拖延了。"},{"en":"She lapsed back into her old routine during the holidays.","zh":"假期里她又回到了以前的生活模式。"}]},{"partOfSpeech":"v.","definition":{"en":"To end or become no longer valid because time has passed (often used for agreements, memberships, or insurance).","zh":"（因到期）终止；失效（常用于合同、会员资格、保险等）"},"examples":[{"en":"My gym membership lapsed because I forgot to renew it.","zh":"我忘了续费，健身房会员就到期失效了。"},{"en":"The offer will lapse at midnight.","zh":"优惠将在午夜到期失效。"}]},{"partOfSpeech":"n.","definition":{"en":"A period of time during which something stops or is interrupted.","zh":"（活动、连续性等的）中断期；间隔"},"examples":[{"en":"After a long lapse, the two friends started talking again.","zh":"隔了很久之后，这两个朋友又开始联系了。"},{"en":"There was a short lapse in service during the storm.","zh":"暴风雨期间服务短暂中断。"}]}],"synonyms":["slip","error","mistake","oversight","break","interval","expire","relapse"],"phonetic":"/læps/","extraExplanation":["“lapse”在英语里常见的固定搭配有：a lapse in judgment（判断失误）、a lapse of memory（记忆失误/一时想不起来）、a lapse in concentration/attention（注意力不集中）。这些搭配里，lapse 通常指“短暂的失控/松懈”，语气比“big mistake”更轻。","“lapse”作动词时常与 into 搭配（lapse into…）表示“又陷回某种状态/坏习惯”。在正式语境里也很常见于合同或保险：policy/contract/membership lapsed（到期失效）。"]}
{"word":"lapsed","summary":{"en":"Lapsed usually means “no longer active or valid,” and it can also describe someone who has stopped practicing a belief; it’s also the past form of “lapse.”","zh":"Lapsed 通常指“已失效/已终止”，也可形容“不再虔诚信仰或不再遵守”的人；同时它也是 lapse 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"No longer valid or active because time has passed or required conditions were not met (often used for memberships, insurance, permits, subscriptions).","zh":"（因过期或未满足条件而）失效的、终止的（常用于会员、保险、许可、订阅等）。"},"examples":[{"en":"My gym membership has lapsed, so I need to renew it.","zh":"我的健身房会员已经失效了，所以我得去续费。"},{"en":"The insurance policy lapsed after he missed two payments.","zh":"他错过两次缴费后，保险单就失效了。"}]},{"partOfSpeech":"adj.","definition":{"en":"No longer practicing a religion or following a belief/standard; having fallen away from a previous commitment.","zh":"（对宗教/信念/原则）不再遵守的；（信仰）淡退的；（承诺）退守的。"},"examples":[{"en":"She is a lapsed Catholic who still enjoys the holidays.","zh":"她是个不再虔诚的天主教徒，但仍然喜欢过节。"},{"en":"He joked that he was a lapsed vegetarian after ordering a burger.","zh":"他点了汉堡后开玩笑说自己是个“退隐的素食者”。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “lapse”: to stop doing something for a time, or to gradually slip into a worse state; also, to come to an end.","zh":"“lapse”的过去式/过去分词：一段时间内中断；逐渐退步/走下坡路；（时间/协议等）终止。"},"examples":[{"en":"Their attention lapsed during the long meeting.","zh":"在那场冗长的会议中，他们的注意力走神了。"},{"en":"Several months have lapsed since we last spoke.","zh":"自从我们上次说话以来，已经过去了好几个月。"}]}],"synonyms":["expired","invalid","outdated","inactive","terminated","fallen away"],"phonetic":"/læpst/","extraExplanation":["“lapsed”在日常中非常常见于正式场景，尤其是保险/会员/证件：a lapsed policy（失效保单）、a lapsed license（过期/失效的执照）。","宗教语境里，“a lapsed + 宗教身份”（如 lapsed Catholic）通常表示“不再定期实践/不再虔诚”，语气往往比“非信徒”更温和，也带有“曾经是”的含义。"]}
{"word":"lapseful","summary":{"en":"prone to lapses or slips; forgetful or careless at times","zh":"容易疏忽失误的；时常健忘或粗心的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"prone to lapses (temporary failures of memory, attention, judgment, or duty); likely to make mistakes or slip back into bad habits","zh":"容易出现疏忽或失误的；容易“走神/忘事/失职”的；（习惯上）容易故态复萌的"},"examples":[{"en":"I’m a bit lapseful when I’m tired, so I write everything down.","zh":"我一累就容易犯迷糊，所以我把事情都写下来。"},{"en":"He became lapseful about taking his medicine on time.","zh":"他开始在按时吃药这件事上变得很容易疏忽。"},{"en":"The report warns that even trained staff can be lapseful under heavy pressure.","zh":"报告警告说，即使受过训练的员工在巨大压力下也可能出现疏忽。"}]}],"synonyms":["forgetful","careless","absent-minded","inattentive","negligent","slipshod","error-prone","unreliable"],"phonetic":"/ˈlæpsfəl/","extraExplanation":["lapseful 属于偏书面或少见用词；日常表达更常用 forgetful（健忘的）、careless（粗心的）、absent-minded（心不在焉的）、inattentive（不专心的）。","lapse 的常见搭配：a lapse in memory/judgment/attention（记忆/判断/注意力的失误）；lapse into silence/a habit（陷入沉默/故态复萌）。"],"etymology":"由 lapse（“失误、疏忽；逐渐衰退/偏离”）+ 形容词后缀 -ful（“充满……的/容易……的”）构成，字面意思是“充满疏忽的/容易发生疏忽的”。该词较少见，更多时候英语会用 forgetful、careless、prone to lapses 等表达。","mnemonic":["把它拆开记：lapse（疏忽、失误）+ -ful（很……的）→ “很容易疏忽的”。","联想中文“漏（lapse）+ 满（-ful）”：满满的“漏掉/疏忽”，就容易出错。"]}
{"word":"lapser","summary":{"en":"Lapser means a person who lapses—especially someone whose insurance policy or membership expires because they don’t renew it.","zh":"Lapser 指“发生中断/失效的人”，尤指未续费导致保险保单或会员资格到期失效的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lapses (stops doing something, returns to a bad habit, or lets something expire), especially a customer whose insurance policy or membership is not renewed.","zh":"“失误/退步/中断的人”；指出现疏忽、重新染上旧习，或让某事失效/到期的人；尤指在保险、会员等场景中未续费导致保单/资格失效的人。"},"examples":[{"en":"The company contacted policy lapsers and offered a discount to renew.","zh":"公司联系了那些让保单失效的客户，并提供折扣鼓励续保。"},{"en":"In recovery programs, a lapser may need extra support after a setback.","zh":"在戒瘾/康复项目中，出现复发的人在遭遇挫折后可能需要更多支持。"}]}],"synonyms":["non-renewer","former member","defector (context-dependent)"],"phonetic":"/ˈlæpsɚ/","extraExplanation":["“lapser”并不是日常高频词，更常见的是用“someone who lapses”来表达；在商业语境（尤其保险业）里，“policy lapsers（保单失效客户）”是相对固定的用法。","它来自动词“lapse”（中断、失效、犯错、复发）。因此“lapser”带有“从原本状态滑落/中止”的含义，语气通常是中性到略偏负面，取决于上下文。"]}
{"word":"lapsers","summary":{"en":"“Lapsers” are people who have lapsed, especially those who stop practicing a religion or fail to keep up a commitment.","zh":"“lapsers”指“中断/失守的人”，尤其指不再实践宗教或未能坚持承诺的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of lapser) A person who lapses—someone who stops following a habit, duty, standard, or belief (often used about religion: a person who stops practicing their faith).","zh":"（lapser 的复数）指“失守/中断者”：不再遵守某种习惯、职责、标准或信仰的人（常用于宗教语境：不再实践宗教的人）。"},"examples":[{"en":"Some lapsers return to their faith later in life.","zh":"有些“不再实践者”在晚年会重新回到信仰中。"},{"en":"The program was designed to support lapsers who stopped attending meetings.","zh":"这个项目旨在支持那些停止参加会议的人。"}]},{"partOfSpeech":"n.","definition":{"en":"In historical church contexts, people who denied their faith under persecution and later sought to return to the church.","zh":"（教会历史语境）指在迫害下否认信仰、后来又希望回归教会的人。"},"examples":[{"en":"The bishop debated how to treat lapsers after the persecution ended.","zh":"迫害结束后，主教讨论该如何对待这些“失足者”。"}]}],"synonyms":["lapsed believers","backsliders","defectors","dropouts"],"phonetic":"/ˈlæpsɚ/","extraExplanation":["“lapser”来自动词 lapse（中断、失守、退步）。在日常英语里更常见的是 lapsed（如 a lapsed Catholic：不再实践天主教的人），而“lapsers”相对少见，多见于研究、报道或宗教讨论中。","教会史里常用拉丁词“lapsi”（意为“跌倒的人”）指同一群体；英文里有时会用 lapsers 来表达类似含义。"]}
{"word":"lapses","summary":{"en":"“Lapses” most often means small mistakes or moments of inattention; it can also be the verb form meaning something stops being maintained or becomes invalid.","zh":"“lapses”最常指小过失或一时的走神/疏忽；也可作动词，表示某事未被维持而失效或松懈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Small mistakes, slips in attention, or short failures in judgment or behavior.","zh":"（名词复数）小过失；疏忽；一时的判断或行为失误。"},"examples":[{"en":"The report had a few minor lapses, but overall it was accurate.","zh":"这份报告有几处小疏漏，但总体是准确的。"},{"en":"He apologized for his lapse in judgment.","zh":"他为自己一时判断失误道了歉。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “lapse”) To temporarily fail to maintain a standard, rule, memory, or effort; to let something slip.","zh":"（动词“lapse”的第三人称单数）暂时未能保持某种标准/规则/记忆/努力；让某事“松掉、滑过去”。"},"examples":[{"en":"If your membership lapses, you may lose access to the service.","zh":"如果你的会员资格到期失效，你可能无法继续使用该服务。"},{"en":"Sometimes his attention lapses during long meetings.","zh":"在很长的会议中，他有时会走神。"}]}],"synonyms":["slips","mistakes","errors","oversights","failures"],"phonetic":"/ˈlæpsɪz/","extraExplanation":["“lapse”常见搭配：\n- lapse in attention/judgment：注意力/判断力的疏忽\n- insurance/contract lapses：保险/合同“失效、到期作废”\n- lapse into silence/a habit：逐渐陷入沉默/旧习（这个用法更像“慢慢变成”）"]}
{"word":"lapsful","summary":{"en":"“Lapsful” is a rare adjective meaning “full of lapses; prone to mistakes or forgetfulness.”","zh":"“lapsful”是很少见的形容词，意思是“疏失很多的；容易出错或健忘的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) full of lapses; tending to make mistakes or forget things.","zh":"（罕见）充满疏失的；容易出错或健忘的。"},"examples":[{"en":"The report was lapsful, with several dates and names written incorrectly.","zh":"这份报告疏失很多，好几个日期和名字都写错了。"},{"en":"He apologized for his lapsful memory during the meeting.","zh":"他为自己在会议上健忘、频频疏失而道歉。"}]}],"synonyms":["lapseful","forgetful","error-prone","careless"],"phonetic":"/ˈlæpsfəl/","extraExplanation":["“lapsful”非常少见，现代英语里更常用的是 **lapseful**（同义）或更自然的表达，如 **prone to lapses / full of mistakes / forgetful / error-prone**。","词根来自 **lapse**（疏忽；失误；（记忆等）暂时失灵），加上形容词后缀 **-ful**，表示“充满……的”。如果你是在某段文本里看到“lapsful”，它也可能是拼写错误。"]}
{"word":"lapsi","summary":{"en":"Lapsi are Christians who lapsed (abandoned their faith) during persecution, a key term in early Church history.","zh":"Lapsi 指在迫害时期背弃信仰的基督徒，是早期教会史中的重要术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In early Christian history, people who gave up their faith (for example, by worshiping Roman gods or handing over sacred books) during persecution; later, the term was used in debates about whether they could be accepted back into the Church.","zh":"（早期基督教史）在迫害时期背弃信仰的人（例如向罗马诸神献祭或交出圣书者）；后来该词常用于讨论他们是否能被教会重新接纳的争议。"},"examples":[{"en":"Some bishops argued that the lapsi should be forgiven after sincere repentance.","zh":"一些主教认为，若真诚悔改，lapsi 应当被宽恕。"},{"en":"The controversy over the lapsi shaped early Church rules about confession and restoration.","zh":"围绕 lapsi 的争论影响了早期教会关于告解与复归的规定。"}]}],"synonyms":["apostates","backsliders"],"phonetic":"/ˈlæp.saɪ/","extraExplanation":["“Lapsi”来自拉丁语，原意与“滑倒、失足（lapse）”有关，在教会史中专指在罗马帝国迫害（尤以德修斯 Decius 时期最著名）下“失足”背教的人。相关争论常与“是否能重新领圣餐/回到团契”以及惩戒期限有关。","常见相关词：libellatici（用钱买到献祭证明的人）、traditores（交出经卷/圣物的人）。不同地区与派别对这些人的处理严格程度不同。"]}
{"word":"lapsibility","summary":{"en":"Lapsibility means the tendency or likelihood of lapsing—making slips, declining, or relapsing.","zh":"Lapsibility 指“发生失误/衰退/复发等 lapse 的可能性或倾向”（较少见的正式用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency or possibility of lapsing (e.g., slipping into error, decline, forgetfulness, or a past habit)","zh":"（在用法上较少见）指“会失误/会衰退/会走神或旧习复发的可能性或倾向”"},"examples":[{"en":"The policy was designed to reduce lapsibility by setting clear deadlines and reminders.","zh":"这项政策通过设定明确的截止日期和提醒机制来降低“容易拖延或遗忘而出错”的可能性。"},{"en":"Even skilled performers have lapsibility under stress.","zh":"即使是熟练的表演者，在压力下也可能出现失误的可能性。"}]}],"synonyms":["susceptibility","vulnerability","proneness","likelihood of lapses","risk of relapse"],"phonetic":"/ˌlæpsəˈbɪləti/","extraExplanation":["“lapsibility”非常罕见，更多时候人们会用更常见的词来表达同样意思，例如：risk of relapse（复发风险）、susceptibility to error（易出错性）、likelihood of lapses（出现疏漏的可能性）。","构词上来自“lapse（失误；逐渐变差；（保险）失效；复发）+ -ibility（……的可能性/倾向）”。因此它强调“会发生lapse的可能性”，语感偏正式或学术化。","在不同语境里可指：记忆/注意力的疏漏（a lapse of memory/attention）、道德或行为上的再犯（relapse）、制度或合同的失效（policy/insurance lapse）。用时最好用上下文说明是哪一种“lapse”。"]}
{"word":"lapsible","summary":{"en":"“lapsible” is not standard; you probably mean “collapsible” (foldable, can be made smaller).","zh":"“lapsible”不是常见标准拼写；你大概率想查的是“collapsible”（可折叠、可收起）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely intended word: **collapsible** — able to be folded or pressed into a smaller, flatter shape (often for easy storage or transport).","zh":"你可能想查的是：**collapsible** —— 可折叠的；可压扁收起的（通常为了便于收纳或携带）。"},"examples":[{"en":"We bought a collapsible chair for camping.","zh":"我们买了一把可折叠的露营椅。"},{"en":"This water bottle is collapsible, so it takes up less space in my bag.","zh":"这个水瓶是可压扁收起的，所以在包里更省空间。"}]}],"synonyms":["foldable","portable","compact"],"phonetic":"/kəˈlæpsəbəl/","extraExplanation":["“lapsible”本身不是常见的标准英语单词，最常见的情况是把 **collapsible** 少写了开头的 **col-**。","词源上，**collapsible** 来自 **collapse**（倒塌；坍塌；折叠收起）+ 形容词后缀 **-ible**（“可……的”）。在产品说明中很常见：collapsible cup / umbrella / stroller（可折叠杯子/雨伞/婴儿车）。"]}
{"word":"lapsided","summary":{"en":"Lopsided means uneven or unbalanced, and it can also describe something one-sided or unfair.","zh":"lopsided 表示不平衡、歪斜；也可比喻一边倒或不公平。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Uneven or not balanced; heavier, higher, or larger on one side.","zh":"不平衡的；一边更重/更高/更大的。"},"examples":[{"en":"The picture frame looks lopsided on the wall.","zh":"相框挂在墙上看起来歪了。"},{"en":"The cake came out lopsided because the oven heated unevenly.","zh":"蛋糕烤得一边高一边低，因为烤箱受热不均。"}]},{"partOfSpeech":"adj.","definition":{"en":"One-sided or unfair in a figurative sense (e.g., results, arguments, relationships).","zh":"（比喻）一边倒的；不公平的（如结果、论点或关系）。"},"examples":[{"en":"It was a lopsided game—they won 7–0.","zh":"那是一场一边倒的比赛——他们以 7 比 0 获胜。"},{"en":"Their friendship felt lopsided: one person always gave, the other only took.","zh":"他们的友谊让人感觉不对等：一个人总在付出，另一个只会索取。"}]}],"synonyms":["uneven","unbalanced","asymmetrical","one-sided","skewed"],"phonetic":"/ˌloʊpˈsaɪdɪd/","extraExplanation":["你写的“lapsided”更常见是拼写错误；标准拼写是“lopsided”。","“lopsided”既可描述物理上的“歪/不平衡”，也常用于比喻（如“lopsided victory”一边倒的胜利、“lopsided relationship”不对等的关系）。","构词上可理解为“lop（垂下/偏向一侧）+ sided（有…一侧的）”，强调“偏在一边”的感觉。"]}
{"word":"lapsing","summary":{"en":"“Lapsing” usually means expiring (becoming invalid) or slipping back/losing focus temporarily.","zh":"“lapsing”常指（期限/合同等）到期失效，或指一时走神、松懈、复发旧习。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of time, a period, or a law/contract) coming to an end or becoming invalid because it is not continued or renewed; expiring.","zh":"（指时间、期限、法律/合同等）因未继续或未续期而到期、失效；终止。"},"examples":[{"en":"Her visa is lapsing next month, so she needs to renew it soon.","zh":"她的签证下个月就要到期了，所以她需要尽快续签。"},{"en":"The policy is lapsing because no payments have been made this year.","zh":"这份保单因为今年没有缴费而正在失效。"}]},{"partOfSpeech":"vi.","definition":{"en":"temporarily losing concentration, attention, or a good standard of behavior; slipping back into an old habit.","zh":"（注意力或行为）一时走神/松懈；（尤指戒除后）复发、故态复萌。"},"examples":[{"en":"I’m lapsing a little today—I keep forgetting what I was doing.","zh":"我今天有点走神——老是忘记自己刚要做什么。"},{"en":"After months without sugar, he worried he was lapsing into old eating habits.","zh":"在几个月不吃糖之后，他担心自己又复发回到以前的饮食习惯。"}]}],"synonyms":["expiring","ending","running out","slipping","backsliding"],"phonetic":"/ˈlæpsɪŋ/","extraExplanation":["“lapsing”来自动词“lapse”（失效、（行为）复发/倒退）。常见搭配：a lapsing policy（失效的保单）、lapse into silence/old habits（陷入沉默/重回旧习）。","注意区分：lapse（名词）也可指“小过失/一时失误”，如 a lapse in judgment（判断失误）。"]}
{"word":"lapsingly","summary":{"en":"“Lapsingly” means “in a way that shows a lapse,” often suggesting attention or standards gradually or intermittently slipping.","zh":"“Lapsingly”表示“以出现疏忽/失守的方式”，常暗示注意力或标准在逐渐或间歇性地下滑。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a slipping or failing way; in a manner that shows a lapse (a gradual decline in attention, standards, or behavior)","zh":"以滑落或失误的方式；以显示“疏忽/失守/退步”（lapse）的方式"},"examples":[{"en":"His attention wandered lapsingly during the long meeting.","zh":"在漫长的会议中，他的注意力断断续续地走神。"},{"en":"The team’s focus weakened lapsingly after the first setback.","zh":"第一次受挫后，团队的专注度逐渐、时有时无地下降。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare) in a way that gradually passes or fades over time","zh":"（罕见）以逐渐流逝、逐渐淡去的方式"},"examples":[{"en":"The memory returned, then disappeared lapsingly into silence.","zh":"那段记忆浮现又消散，渐渐沉入寂静之中。"}]}],"synonyms":["gradually","intermittently","with lapses","fitfully","sporadically"],"phonetic":"/ˈlæpsɪŋli/","extraExplanation":["“lapsingly”并不常见，更常用的表达是：gradually（逐渐地）、intermittently（间歇地）、with lapses（有时会走神/失误）、in fits and starts（断断续续地）。在写作中它带有较文学化的“逐渐滑落/松懈”的语气。"]}
{"word":"lapstone","summary":{"en":"A shoemaker’s stone used on the lap to support leather while working.","zh":"鞋匠放在膝上用来承托皮革、便于加工的石块（或金属块）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, smooth stone (or sometimes a metal block) held on the lap and used by a shoemaker to support leather while hammering, shaping, or sewing shoes.","zh":"（鞋匠用的）置于膝上承托皮革的光滑石块（有时也指金属块），用于敲打、塑形或缝制鞋子。"},"examples":[{"en":"The cobbler rested the leather on a lapstone before hammering in the nails.","zh":"鞋匠把皮革放在膝上的鞋匠石上，再把钉子敲进去。"},{"en":"In the old workshop, a lapstone lay beside the awls and thread.","zh":"在那间老作坊里，一块鞋匠石放在锥子和线旁边。"}]}],"synonyms":["shoemaker’s stone","cobbler’s stone"],"phonetic":"/ˈlæpˌstoʊn/","extraExplanation":["“lapstone”来自“lap（大腿/膝上）+ stone（石头）”，指把工具放在膝上使用的做法。它常见于传统修鞋/制鞋场景，也会出现在描写手工劳动的文学或历史文本中。","相关词：cobbler（补鞋匠/鞋匠）、shoemaker（制鞋匠）、awl（锥子）、last（鞋楦）。"]}
{"word":"lapstrake","summary":{"en":"Lapstrake is a boatbuilding method where hull planks overlap (clinker-built).","zh":"Lapstrake 指一种船体外板相互搭接重叠的造船方法（clinker-built）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a method of building a boat in which the wooden planks of the hull overlap each other (also called “clinker-built”), creating visible “steps” along the side","zh":"（造船）一种船壳外板相互“搭接重叠”的造法（也称clinker-built / clinker construction，中文常译“搭接板/叠板式”），船身侧面会出现一层层的“台阶”边缘"},"examples":[{"en":"The museum displayed a traditional lapstrake rowboat with overlapping planks.","zh":"博物馆展出了一艘传统的搭接板划艇，船壳木板彼此重叠。"},{"en":"Lapstrake construction is common in small wooden boats because it can be light and strong.","zh":"搭接板结构常见于小型木船，因为它往往轻巧又结实。"}]}],"synonyms":["clinker-built","clinker construction","lapstrake planking"],"phonetic":"/ˈlæp.stɹeɪk/","extraExplanation":["“Lapstrake”常用于航海与木工语境：lap- 表示“搭接/重叠”，strake 指船体上一条长木板（外板带）。因此它强调“外板彼此压搭”的结构特征。","在北欧与英国的传统木船中很常见（如维京船常被描述为clinker-built），这种结构能在较薄的板材下获得不错的强度，也有利于船体在波浪中“有弹性”地工作。","写作中也常见搭配：lapstrake hull（搭接板船体）、lapstrake planking（搭接板铺板）、clinker-built（同义的更常见说法）。"]}
{"word":"lapstrake-built","summary":{"en":"built with overlapping planks on a boat’s hull","zh":"船体木板彼此重叠搭接的建造方式"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a boat) built with overlapping wooden planks along the hull, like shingles on a roof.","zh":"（指船）采用叠板式外壳建造的：船体木板一片压一片重叠，像屋顶瓦片一样。"},"examples":[{"en":"The museum displayed a lapstrake-built Viking-style rowing boat.","zh":"博物馆展出了一艘叠板式建造的维京风格划艇。"},{"en":"Lapstrake-built hulls are often light yet strong for their size.","zh":"叠板式船体通常在同等尺寸下既轻又结实。"},{"en":"She chose a lapstrake-built dinghy because it handles well in choppy water.","zh":"她选择叠板式小艇，因为在有浪的水面上操控性很好。"}]}],"synonyms":["clinker-built","clinker-built construction","overlapping-plank","lapstrake construction"],"phonetic":"/ˈlæpˌstreɪk bɪlt/","extraExplanation":["常見對比：lapstrake-built（叠板式/克林克式）與 carvel-built（平板式/卡維爾式）。叠板式的板縫呈階梯狀重疊，外觀會看到一道道「肋線」；平板式則是板與板邊緣對齊，外表更平滑。","叠板式在北歐與英倫傳統木船中很常見（如維京船、傳統小艇），因為結構兼顧重量與韌性，也較能吸收浪打帶來的衝擊。"],"etymology":"來自「lapstrake / clinker」造船術語：lap 表示「覆蓋、搭接」，strake 指「一長條船板（船殼板條）」。合起來就是「板條彼此搭接重疊」的船殼結構。","mnemonic":["把 lap 想成「搭上去、蓋上去」（像中文的「搭」），strake 想成「長條板」，合起來就是「長條板一片搭一片」。","聯想屋頂「瓦片」：每片瓦都壓住下一片＝木板重疊的船殼。"]}
{"word":"lapstreak","summary":{"en":"Lapstreak refers to clinker-style construction with overlapping planks, especially in traditional wooden boats; it can also describe something made in that style.","zh":"Lapstreak指传统木船常见的“搭接重叠木板”（clinker）建造方式，也可作形容词表示“采用这种样式的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Boatbuilding) A method of building a wooden boat hull with overlapping planks (also called clinker-built), creating a stepped look along the sides.","zh":"（造船）一种木船船体的建造方式：木板彼此“搭接重叠”（也称clinker-built），使船身侧面呈现一层层台阶状的纹理。"},"examples":[{"en":"Traditional lapstreak boats have overlapping planks that shed water well.","zh":"传统的lapstreak木船因为木板层层搭接，排水性能很好。"},{"en":"The builder chose lapstreak construction for its strength and classic appearance.","zh":"建造者选择lapstreak结构，是因为它结实耐用，而且外观很经典。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having or made with overlapping planks in lapstreak (clinker) style.","zh":"（形容船体/木工结构）采用搭接重叠木板（lapstreak / clinker）样式的。"},"examples":[{"en":"They restored a lapstreak skiff from the 1930s.","zh":"他们修复了一艘20世纪30年代的lapstreak小划艇。"},{"en":"Lapstreak siding is less common today, but it still appears in traditional designs.","zh":"如今lapstreak式的外墙板不算常见，但在传统设计中仍能见到。"}]}],"synonyms":["lapstrake","clinker-built","clinker"],"phonetic":"/ˈlæpˌstɹik/","extraExplanation":["“Lapstreak”在英语里多用于航海与传统木船工艺语境，尤指北欧与英国传统小艇常见的“clinker（搭接）”工法。与之相对的是“carvel（平接）”工法：木板边缘对齐、表面更平滑。","拼写与用法上常见变体包括：lapstrake（更常见的拼写）、lap-streak（加连字符）、clinker-built（同义表达）。"]}
{"word":"lapstreaked","summary":{"en":"Lapstreaked describes a boat hull made from overlapping planks, leaving visible ridges (clinker-built).","zh":"lapstreaked 形容船壳用木板搭接重叠建造，外侧可见一圈圈凸棱（即 clinker/叠板式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of a small boat) built with overlapping wooden planks so the hull shows visible horizontal ridges; clinker-built.","zh":"（尤指小船）用“搭接板”方式建造的：木板彼此重叠铺设，船体外侧能看到一条条水平凸棱；又称“clinker（叠板/搭接板）式”结构。"},"examples":[{"en":"They launched a lapstreaked skiff that rode lightly over the waves.","zh":"他们下水了一艘搭接板结构的小划子，轻巧地掠过浪头。"},{"en":"The lapstreaked hull has raised seams where each plank overlaps the next.","zh":"这种搭接板船壳在每块木板的重叠处都有突起的接缝。"},{"en":"Lapstreaked boats are common in traditional Scandinavian and New England designs.","zh":"搭接板结构的船在传统的斯堪的纳维亚和新英格兰船型中很常见。"}]}],"synonyms":["clinker-built","lapstrake-built","overlapping-planked"],"phonetic":"/ˈlæpˌstriːkt/","extraExplanation":["“lapstreaked”来自名词/形容词“lapstrake / lapstreak”，指一种传统木船工艺：每块外板（plank）边缘压在下一块外板之上，用铆钉或钉子固定，形成一圈圈“台阶状”纹理。英语里也常用“clinker-built”表达同一概念（英式用法更常见）。","这种结构往往让船体更轻、也更有韧性，适合小型帆船、划艇；在文学或航海描写中，它常带有“传统、手工、古典船只”的意象。"]}
{"word":"lapstreaker","summary":{"en":"Lapstreaker = a lapstrake (clinker-built) boat, or someone who builds one.","zh":"Lapstreaker 指叠板（lapstrake/clinker）结构的船，或建造这种船的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a boat (often a small wooden boat) built with overlapping planks along the hull; a lapstrake/clinker-built boat","zh":"（常指小型木船）用“搭接外板/叠板”（lapstrake, 又称 clinker）工艺建造的船；叠板船"},"examples":[{"en":"He restored an old lapstreaker and rowed it on the lake every summer.","zh":"他修复了一条老叠板船，每年夏天都在湖上划。"},{"en":"Lapstreakers are known for being light and strong for their size.","zh":"叠板船以“体轻而结实”著称。"}]},{"partOfSpeech":"n.","definition":{"en":"a craftsperson who builds lapstrake (clinker) boats","zh":"建造叠板船（lapstrake/clinker 工艺）的匠人；叠板船造船师"},"examples":[{"en":"The lapstreaker showed us how each plank overlaps the next.","zh":"那位叠板船匠给我们演示了每块外板如何压在另一块上面。"}]}],"synonyms":["lapstrake boat","clinker-built boat","boatbuilder"],"phonetic":"/ˈlæpˌstreɪkər/","extraExplanation":["“Lapstreaker”在现代英语里相对少见；更常见的术语是“lapstrake (boat)”或“clinker-built (boat)”。“lapstrake”指船壳外板边缘彼此搭接（overlap），形成一条条可见的“板缝线”（streak/strake）。","这种工艺常与北欧传统小船、渔船或某些木质划艇联系在一起；相对的做法是“carvel-built”，即外板边缘对接，船体外表更平滑。"]}
{"word":"lapsus","summary":{"en":"“Lapsus” means a small, unintentional slip or mistake, often in speech or writing.","zh":"“lapsus”指无意的小失误，常见于口误或笔误等场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slip or mistake (often a small, unintentional error in speech, writing, or behavior)","zh":"（常指无意的、小的）口误／笔误／失误"},"examples":[{"en":"It was just a lapsus—I meant to say Tuesday, not Thursday.","zh":"那只是个口误——我本来想说星期二，不是星期四。"},{"en":"The editor caught a minor lapsus in the final paragraph.","zh":"编辑在最后一段发现了一个小笔误。"}]},{"partOfSpeech":"n.","definition":{"en":"(in set Latin phrases) a particular kind of slip, especially of speech or writing","zh":"（用于固定拉丁短语中）特定类型的失误，尤指口误或笔误"},"examples":[{"en":"The politician apologized for the lapsus linguae during the interview.","zh":"那位政治人物为采访中的口误道歉。"},{"en":"A spelling lapsus like that can change the tone of the whole sentence.","zh":"那样的拼写笔误可能会改变整句话的语气。"}]}],"synonyms":["slip","mistake","error","blunder","typo"],"phonetic":"/ˈlæp.səs/","extraExplanation":["“lapsus”源自拉丁语，原意接近“滑倒、失足”，引申为“失误”。在英语里它常出现在拉丁固定搭配中：\n- lapsus linguae：口误（字面“舌头的失误”）\n- lapsus calami：笔误（字面“笔的失误”）\n它属于较书面、较正式的用词；日常口语更常说 slip / mistake / typo。"]}
{"word":"laptop","summary":{"en":"A laptop is a portable computer with a built-in screen and keyboard.","zh":"Laptop 指带屏幕和键盘的一体式便携电脑（笔记本电脑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small portable computer that you can use on your lap or carry easily, with a screen and keyboard built in.","zh":"笔记本电脑；一种便携式电脑，通常把屏幕和键盘集成在一起，方便携带和使用。"},"examples":[{"en":"I bring my laptop to class to take notes.","zh":"我把笔记本电脑带到课堂上做笔记。"},{"en":"Her laptop battery lasts about eight hours.","zh":"她的笔记本电脑电池大约能用八个小时。"},{"en":"He closed his laptop and put it in his backpack.","zh":"他合上笔记本电脑，放进背包里。"}]}],"synonyms":["notebook (computer)","portable computer"],"phonetic":"/ˈlæpˌtɑp/","extraExplanation":["“Laptop”字面意思是“放在大腿（lap）上的电脑”。现在也常用更中性的说法“notebook (computer)”，强调轻薄与便携。","日常英语里也常说“laptop computer”，但通常直接说“laptop”就够了。","相关常见搭配：laptop battery（笔记本电池）、laptop charger（充电器）、laptop sleeve（电脑内胆包）、laptop stand（支架）、laptop bag（电脑包）。"]}
{"word":"laptops","summary":{"en":"“Laptops” is the plural form of “laptop,” meaning portable computers.","zh":"“laptops”是“laptop”的复数形式，指多台笔记本电脑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A portable personal computer that you can use on your lap or on a table, usually with a built-in screen, keyboard, and battery.","zh":"笔记本电脑；便携式个人电脑，通常自带屏幕、键盘和电池，可放在腿上或桌上使用。"},"examples":[{"en":"I bring my laptop to class to take notes.","zh":"我带笔记本电脑去上课做笔记。"},{"en":"Her laptop battery lasts about eight hours.","zh":"她的笔记本电脑电池续航大约八小时。"}]}],"synonyms":["notebook (computer)","portable computer"],"phonetic":"/ˈlæp.tɑp/","extraExplanation":["“Laptop”由“lap（大腿）+ top（上面）”构成，字面意思是“放在腿上的电脑”。现在也常用更宽泛的说法，如 notebook（更偏商务/技术语境）或 portable computer（更正式）。"]}
{"word":"lapulapu","summary":{"en":"Lapu-Lapu is a famous Filipino leader known for defeating Magellan in 1521; it is also the name of a city in Cebu.","zh":"Lapu-Lapu（拉普拉普）是以1521年击败麦哲伦而闻名的菲律宾领袖；也指菲律宾宿务的拉普拉普市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Filipino historical leader from Mactan Island who is best known for resisting Spanish colonization and defeating Ferdinand Magellan in 1521.","zh":"菲律宾麦克坦岛的历史领袖，以反抗西班牙殖民、在1521年击败探险家麦哲伦而闻名。"},"examples":[{"en":"Lapu-Lapu is often remembered as one of the first Filipino heroes to resist foreign rule.","zh":"拉普拉普常被纪念为最早反抗外来统治的菲律宾英雄之一。"},{"en":"Many students learn about Lapu-Lapu when studying the Battle of Mactan.","zh":"许多学生在学习“麦克坦之战”时会了解拉普拉普。"}]},{"partOfSpeech":"n.","definition":{"en":"A city in Cebu, Philippines (Lapu-Lapu City), named in honor of the historical figure.","zh":"菲律宾宿务的一座城市（拉普拉普市），以这位历史人物命名。"},"examples":[{"en":"We landed at the airport in Lapu-Lapu City on Mactan Island.","zh":"我们在麦克坦岛的拉普拉普市机场降落。"},{"en":"Lapu-Lapu City is a common base for travelers visiting Cebu.","zh":"拉普拉普市是游客游览宿务时常用的落脚点。"}]}],"synonyms":["(historical figure) Datu Lapu-Lapu","(place) Lapu-Lapu City"],"phonetic":"/ˌlɑːpuː ˈlɑːpuː/","extraExplanation":["“Lapu-Lapu”通常写作带连字符的“Lapu-Lapu”。在菲律宾文化语境中，他象征反殖民与地方领袖的自主性，因此常出现在纪念碑、节日叙事与学校教材中。","与他相关的关键历史事件是1521年的“麦克坦之战”（Battle of Mactan）。在很多英文史料与旅游介绍中，你会看到“Lapu-Lapu defeated Magellan”这样的表述。"]}
{"word":"laputa","summary":{"en":"Laputa is best known as a fictional floating island from *Gulliver’s Travels* and as the floating city in Miyazaki’s *Castle in the Sky*.","zh":"Laputa 通常指《格列佛游记》中的“飞行岛”，也指宫崎骏《天空之城》里的“天空之城／浮空岛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fictional flying island in Jonathan Swift’s novel *Gulliver’s Travels* (1726), famous for its scientists and satire of impractical “abstract” thinking","zh":"（专有名词）乔纳森·斯威夫特小说《格列佛游记》（1726）中的“飞行岛”，以讽刺脱离现实的学术与权力而著名"},"examples":[{"en":"In *Gulliver’s Travels*, Laputa is a floating island that controls the land below it.","zh":"在《格列佛游记》中，拉普他（Laputa）是一座漂浮在空中的岛屿，并能控制下方的土地。"},{"en":"The name “Laputa” is often used to refer to a place of unrealistic or impractical ideas.","zh":"“Laputa”这个名字常被用来指代充满不切实际想法的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"the legendary floating island/city in Hayao Miyazaki’s animated film *Castle in the Sky* (1986)","zh":"（专有名词）宫崎骏动画电影《天空之城》（1986）中的传说“天空之城／浮空岛”"},"examples":[{"en":"*Castle in the Sky* is known in Japan as *Laputa: Castle in the Sky*.","zh":"《天空之城》在日本的片名是《天空之城拉普他》（Laputa: Castle in the Sky）。"},{"en":"Many fans associate “Laputa” with an ancient city hidden in the clouds.","zh":"很多影迷会把“Laputa”与“藏在云端的古代城市”联系起来。"}]}],"synonyms":["floating island","sky island","castle in the sky"],"phonetic":"/ləˈpuːtə/","extraExplanation":["在西班牙语里，“la puta”字面上可能被理解为粗俗用语（“妓女”之意）。斯威夫特取名“Laputa”常被认为带有讽刺与戏谑色彩；在跨文化交流中，使用该词时如果对方是西语背景，可能会引发误会。"]}
{"word":"laputan","summary":{"en":"Laputan means “from Laputa” (a fictional place in Gulliver’s Travels) and can also describe something overly theoretical and impractical.","zh":"Laputan 指“来自拉普他”（《格列佛游记》中的虚构之地），也可引申为“过分理论化、不切实际”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Laputa (a fictional flying island).","zh":"拉普他人（来自“拉普他”——一座虚构的漂浮岛）。"},"examples":[{"en":"In the story, the Laputans are brilliant in math but often clueless about daily life.","zh":"在故事里，拉普他人数学很强，但常常不懂日常生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Laputa; (more broadly) describing ideas or people that are overly theoretical, impractical, and disconnected from reality.","zh":"与拉普他有关的；（引申）形容过分理论化、不切实际、脱离现实的想法或人。"},"examples":[{"en":"His plan sounded Laputan—clever on paper, but impossible to use in real life.","zh":"他的计划听起来很“拉普他”——纸面上很聪明，但现实中根本用不上。"},{"en":"The novel satirizes Laputan scientists who forget basic human needs.","zh":"这部小说讽刺那些“拉普他式”的科学家，他们忘了最基本的人类需求。"}]}],"synonyms":["impractical","overly theoretical","idealistic","ivory-tower"],"phonetic":"/ləˈpjuːtən/","extraExplanation":["“Laputan / Laputa”出自乔纳森·斯威夫特（Jonathan Swift）的《格列佛游记》（Gulliver’s Travels）。拉普他是一座会飞的岛，岛上的学者沉迷抽象知识与奇怪实验，常被用来讽刺“纸上谈兵、脱离现实”的学术或政治。","作为形容词时，“Laputan”带有文学讽刺色彩，常用于评论某些过分理想化、忽视实际条件的方案或人物。"]}
{"word":"laputically","summary":{"en":"A very rare literary adverb meaning “in a Laputan (overly theoretical, impractical) way.”","zh":"一个极少见的文学副词，意为“以拉普他式（过分理论化、脱离实际）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare / literary) In a Laputan way—overly theoretical, pedantic, and disconnected from practical reality (from Laputa, the floating island in Jonathan Swift’s *Gulliver’s Travels*).","zh":"（极少见／文学用语）以“拉普他式”的方式——过分理论化、迂腐，脱离实际（源自乔纳森·斯威夫特《格列佛游记》中漂浮岛“拉普他”）。"},"examples":[{"en":"He approached the problem laputically, with elegant formulas but no workable plan.","zh":"他用一种“拉普他式”的方式处理问题：公式很优雅，却没有可行方案。"},{"en":"The committee’s laputically detailed rules ignored what people actually needed.","zh":"委员会那些“拉普他式”细到夸张的规定，忽视了人们真正的需求。"}]}],"synonyms":["pedantically","theoretically","impractically"],"phonetic":"/ləˈpjuːtɪkli/","extraExplanation":["“laputically”并不是常见英语词；很多读者可能会认为它是拼写错误。若你想表达“治疗性地／从治疗角度”，更常用的是 **therapeutically**。若你能提供一句原文语境，我可以帮你判断作者到底想用哪一个词。","Laputa 在《格列佛游记》中象征对空谈学术、脱离现实的讽刺；因此由它衍生的形容词/副词常带有“书呆子式、只讲理论不落地”的语气。"]}
{"word":"lapwing","summary":{"en":"A lapwing is a field-and-wetland bird, especially the Northern lapwing, recognized by its crest and distinctive flight.","zh":"lapwing 指一种多见于田野与湿地的鸟类，常特指凤头麦鸡，以头冠和独特飞行方式著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medium-sized bird found in open fields and wetlands, known for its rounded wings, slow “flapping” flight, and distinctive crest (especially the Northern lapwing).","zh":"一种常见于开阔田野与湿地的中型鸟类，以圆宽的翅膀、较慢的拍翅飞行方式和（尤其是凤头麦鸡的）明显头冠为特征。"},"examples":[{"en":"We saw a lapwing walking across the wet grass near the river.","zh":"我们看到一只麦鸡在河边的湿草地上走动。"},{"en":"The lapwing’s crest makes it easy to recognize from a distance.","zh":"麦鸡的头冠让人从远处也很容易辨认。"},{"en":"Lapwings often nest on the ground, so farmers try to protect their nests.","zh":"麦鸡常在地面筑巢，所以农民会尽量保护它们的巢。"}]}],"synonyms":["plover (related group)","Northern lapwing","peewit (BrE, informal)"],"phonetic":"/ˈlæp.wɪŋ/","extraExplanation":["“Lapwing”这个名字常被解释为来自其飞行方式：看起来像“翅膀在拍打（lapping）”。在英式英语里，lapwing多指“凤头麦鸡（Northern lapwing）”，也常叫“peewit”（模仿其叫声）。","在欧洲文化中，lapwing常出现在田园与湿地描写里，也与“春天来到、田野复苏”的意象有关。"]}
{"word":"lapwings","summary":{"en":"Lapwings are wading birds often found in fields and wetlands, known for their distinctive flight and calls.","zh":"Lapwings 指一种常见于田野和湿地的涉禽，以独特的飞行方式和叫声闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of medium-sized bird (a wader) with long legs and broad wings, often seen in open fields and wetlands; known for its wavering flight and loud calls","zh":"一种中等大小的涉禽（滨鸟），腿较长、翅膀较宽，常见于开阔田野和湿地；以摇摆的飞行方式和响亮叫声闻名"},"examples":[{"en":"We saw lapwings nesting in the grassy field near the river.","zh":"我们看到凤头麦鸡在河边的草地里筑巢。"},{"en":"The lapwings’ sharp calls warned us that we were too close to their chicks.","zh":"凤头麦鸡尖锐的叫声提醒我们离它们的幼鸟太近了。"}]}],"synonyms":["plover (related family term)","wader (general term)"],"phonetic":"/ˈlæp.wɪŋ/","extraExplanation":["“lapwing”在英式英语里常指“凤头麦鸡”（Northern Lapwing, Vanellus vanellus），在一些地区也可能泛指同属的其他麦鸡类鸟。不同物种外形和分布会略有差异。","在文学与传统用法中，lapwing有时带有“转移注意、引开追踪”的联想，源于这种鸟在护巢时会用夸张动作引诱捕食者远离巢（英语里有相关表达，如把人“带着兜圈子”的隐喻）。"]}
{"word":"lapwork","summary":{"en":"Lapwork means work done while resting on your lap, especially small crafts; sometimes it also means working on a laptop while sitting.","zh":"Lapwork指把东西放在腿上完成的工作，常见于小手工；有时也指坐着用笔记本电脑工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"work you do while sitting with it resting on your lap (often sewing, knitting, small crafts, or paperwork)","zh":"坐着把物品放在腿上完成的工作（常指缝纫、编织、小手工或整理文件等）"},"examples":[{"en":"She did some lapwork in the evening, knitting a scarf while watching TV.","zh":"她晚上做了一些“lapwork”，一边看电视一边织围巾。"},{"en":"The clinic’s lapwork includes filling out basic forms and sorting receipts.","zh":"诊所的“lapwork”包括填写基础表格和整理收据。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, modern) work done on a laptop while sitting down","zh":"（非正式、现代用法）坐着用笔记本电脑完成的工作"},"examples":[{"en":"I finished my lapwork on the train using my laptop.","zh":"我在火车上用笔记本电脑把要做的事完成了。"},{"en":"Too much lapwork can make your neck and shoulders tense.","zh":"“lapwork”做太久容易让脖子和肩膀紧绷。"}]}],"synonyms":["handwork","needlework","craftwork","paperwork"],"phonetic":"ˈlæp.wɝk","extraExplanation":["“lapwork”并不是非常常见的标准词，更多时候会写成两个词：lap work。它的含义通常比较直观：在腿上进行的工作/活儿。现代语境里也有人把在膝上使用笔记本电脑办公称为lap work。"]}

