{"word":"laquais","summary":{"en":"Laquais means a servant attending a noble or powerful person, or (figuratively) a submissive lackey.","zh":"laquais 指侍从/男仆；也可比喻为对权势者卑躬屈膝的跟班、走狗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a servant (especially a uniformed footman) who attends a rich or important person; by extension, a submissive follower who does someone else’s dirty work.","zh":"（尤指穿制服的）侍从/男仆；引申为对权势者卑躬屈膝、替人跑腿或做脏活的人（走狗、跟班）。"},"examples":[{"en":"In the novel, the count arrives with two laquais carrying his cloak and gloves.","zh":"在小说里，伯爵带着两名侍从到来，替他拿着斗篷和手套。"},{"en":"The minister was surrounded by laquais who repeated whatever he said.","zh":"部长身边围着一群跟班，他说什么他们就附和什么。"}]}],"synonyms":["lackey","servant","footman","flunky","toady"],"phonetic":"/læˈkeɪ/","extraExplanation":["“laquais”是法语词，原意接近“侍从/仆役（footman）”。在英语文本里多见于描写旧式贵族生活或带有讽刺意味的政治/社会评论，语气常偏贬义，意思接近“lackey（走狗、跟班）”。","文学中常用来营造“旧制度/贵族阶层”的氛围：例如描写大人物出行时，身旁随行的仆役、随从。阅读时可根据上下文判断是中性“侍从”还是贬义“走狗”。"]}
{"word":"laquear","summary":{"en":"Lacquer is a glossy protective coating, or the act of applying that coating.","zh":"lacquer 指“有光泽的保护涂层（清漆/亮漆）”，也可指“给……上清漆/亮漆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hard, glossy coating put on wood, metal, or other surfaces to protect them and make them shine.","zh":"一种坚硬、有光泽的涂层（清漆/亮漆），用于木材、金属等表面，起保护并增亮的作用。"},"examples":[{"en":"The table is finished with a clear lacquer to protect the wood.","zh":"这张桌子用透明清漆做了表面处理，以保护木头。"},{"en":"The artisan applied several layers of lacquer for a deep shine.","zh":"工匠刷了好几层亮漆，让光泽更深更亮。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover something with lacquer; to give it a hard, shiny protective finish.","zh":"给某物上清漆/亮漆；用坚硬的光亮涂层进行保护性涂装。"},"examples":[{"en":"They lacquered the cabinets to make them more durable.","zh":"他们给橱柜上了清漆，让它更耐用。"},{"en":"Be careful not to touch the surface until it has been lacquered and dried.","zh":"表面上漆并干透前，注意不要触碰。"}]}],"synonyms":["varnish","finish","sealant","coat"],"phonetic":"/ˈlækɚ/","extraExplanation":["“laquear”本身不是常见英语单词；你可能想查的是英语的“lacquer”。“laquear”更像西班牙语/葡萄牙语里“上清漆、涂漆”的动词形式。","在艺术与工艺语境中，lacquer 常让人联想到东亚漆器（如中国漆器、日本“漆”工艺）那种层层上漆、打磨后形成的深邃光泽。现代英语里也常指工业用快干清漆（例如汽车喷漆、木器涂装）。"]}
{"word":"laquearia","summary":{"en":"Laquearia means decorative coffered ceiling panels, especially in ancient Roman or classical descriptions.","zh":"Laquearia 指装饰性的格槽天花板（凹格天花板镶板），多用于古罗马/古典语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"coffered ceiling panels; decorative sunken panels (often in a ceiling), especially in ancient Roman/Latin contexts.","zh":"（多指古罗马建筑中的）格槽天花板；带凹格装饰的天花板镶板/格板。"},"examples":[{"en":"The basilica’s laquearia were painted with stars and geometric patterns.","zh":"那座长方形会堂的格槽天花板上绘有星星和几何图案。"},{"en":"In the poem, the hero looks up at the laquearia and feels the weight of history above him.","zh":"在诗中，英雄抬头望向格槽天花板，感到头顶历史的沉重。"}]}],"synonyms":["coffered ceiling","ceiling coffers","ceiling panels","lacunaria"],"phonetic":"/ləˈkwɛəriə/","extraExplanation":["这个词非常罕见，多见于古典文学、考古/艺术史写作中。它源自拉丁语，常作为复数使用（类似“laquearia are …”的感觉），指天花板上的“格槽/凹格”装饰。相关的更常见术语有 *coffered ceiling*（格槽天花板）和 *lacunaria*（凹格天花板/格槽装饰，亦属古典用语）。"]}
{"word":"laquearian","summary":{"en":"Laquearian describes a coffered, paneled ceiling, especially in classical Roman-style architecture.","zh":"laquearian 指“格槽/藻井式拼板天花”的（尤用于古罗马或古典建筑语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a coffered (paneled) ceiling; decorated with recessed panels, especially in classical Roman-style architecture.","zh":"（尤指古罗马/古典建筑中）与格槽天花板（嵌格、藻井式拼板天花）有关的；带有凹陷方格装饰的。"},"examples":[{"en":"The hall’s laquearian ceiling was divided into square panels, each with a carved rosette.","zh":"大厅的 laquearian 格槽天花被分成一个个方形嵌格，每格都雕着玫瑰花饰。"},{"en":"They restored the laquearian woodwork to match the original Roman design.","zh":"他们修复了 laquearian 的木质拼板装饰，使之与原来的古罗马设计一致。"}]}],"synonyms":["coffered","paneled","lacunar"],"phonetic":"/ləˈkwɛriən/","extraExplanation":["“Laquearian”非常少见，多见于建筑史、古典学或艺术史写作。它来自拉丁语 *laquear*（格槽/拼板天花）与 *laquearia*（格槽天花的嵌格、藻井）。在更常见的英语里，人们通常用 **coffered**（格槽的、藻井式的）来表达同样概念。"]}
{"word":"laquei","summary":{"en":"Lackey means a servant or an overly obedient follower who does what someone powerful wants.","zh":"lackey 指仆从或对权势人物唯命是从的跟班（常带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a servant or follower who does whatever a powerful person wants, often in an insulting or overly obedient way","zh":"（常带贬义）对权势人物唯命是从的仆从；走狗；跟班"},"examples":[{"en":"The politician was surrounded by lackeys who agreed with everything he said.","zh":"那位政客身边围着一群走狗，对他说的每一句话都附和。"},{"en":"She refused to be treated like a lackey at work.","zh":"她拒绝在工作中被当作跟班使唤。"}]},{"partOfSpeech":"v.","definition":{"en":"to act like a lackey; to serve someone in an overly obedient way (rare)","zh":"（罕用）像走狗一样侍奉；卑躬屈膝地效劳"},"examples":[{"en":"He wouldn’t lackey for anyone just to get promoted.","zh":"他不会为了升职而对任何人卑躬屈膝。"}]}],"synonyms":["henchman","minion","toady","flunky","servant"],"phonetic":"/ˈlæki/","extraExplanation":["你输入的“laquei”很可能是 **lackey** 的拼写变体/误拼，或与法语 **laquais**（仆从）有关。英语 **lackey** 多用于批评某人“盲从权势、没有独立判断”。","在文学和新闻评论里，**lackey** 常用来讽刺政治、商业或名人圈中的“马屁精/跟班”。更中性可用 **assistant**（助理）或 **aide**（助手）。"]}
{"word":"laqueus","summary":{"en":"A rare Latin-derived English noun meaning “noose/snare,” and by extension a figurative “trap.”","zh":"源自拉丁语的罕见英语名词，意为“套索/陷阱”，也可引申为“圈套（比喻）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a noose, snare, or rope loop used to catch or restrain someone or something (a rare word in English, from Latin).","zh":"（罕见用词）套索；陷阱用的绳圈（源自拉丁语）。"},"examples":[{"en":"In the old tale, the hunter set a laqueus near the riverbank.","zh":"在那个古老的故事里，猎人在河岸边设下了一个套索。"},{"en":"He felt the laqueus tightening—figuratively—as debts and deadlines piled up.","zh":"他觉得“套索”（比喻意义上）在收紧：债务和截止日期越堆越多。"}]},{"partOfSpeech":"n.","definition":{"en":"figuratively, a trap or entanglement that is hard to escape (especially in literary or scholarly writing).","zh":"（比喻）难以摆脱的圈套；纠缠（多见于文学或学术语境）。"},"examples":[{"en":"The character walks into the laqueus of his own lies.","zh":"这个角色走进了自己谎言织成的圈套。"},{"en":"The author describes jealousy as a laqueus that tightens with attention.","zh":"作者把嫉妒写成一种会因关注而越收越紧的圈套。"}]}],"synonyms":["noose","snare","trap","entanglement","net"],"phonetic":"/ˈlæ.kwi.əs/","extraExplanation":["“laqueus”原本是拉丁语名词，意为“绳套、圈套、陷阱”。英语里偶尔在古典文学研究、拉丁语引文、或偏文学的比喻表达中出现，日常英语更常用的词是“noose / snare / trap”。","在古罗马语境中，它既可指实际的“套索”，也常被用作“困境/网罗”的比喻，因此现代英语借用时也多带有文学色彩。"]}
