{"word":"lar","summary":{"en":"Lar most commonly means a protective household god in ancient Roman religion; it can also mean (archaic) the left side of a ship (“larboard,” now usually “port”).","zh":"Lar最常见指古罗马宗教中的家神（拉尔神）；也可指（古旧航海用语）船的左舷（larboard，现多用port）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman religion) a household god believed to protect a home, family, or a particular place; singular of “Lares.”","zh":"（古罗马宗教）拉尔神：被认为守护家庭、家族或某个地点的家神；“Lares（拉列斯）”的单数形式。"},"examples":[{"en":"In ancient Rome, families offered small gifts to their Lar at home.","zh":"在古罗马，许多家庭会在家中向拉尔神献上小礼物。"},{"en":"The museum displayed a tiny statue of a Lar from a Roman household shrine.","zh":"博物馆展出了一尊来自罗马家庭神龛的小型拉尔神雕像。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, nautical) the left side of a ship when you face forward; “larboard,” now mostly replaced by “port.”","zh":"（旧式航海用语）船的左舷（面向船头时的左侧）；“larboard”一词如今多被“port（左舷）”取代。"},"examples":[{"en":"Older sea documents may use “larboard” instead of “port.”","zh":"较早的航海文献可能用“larboard”而不是“port（左舷）”。"},{"en":"Turn to larboard! (archaic)","zh":"向左舷转！（古旧说法）"}]}],"synonyms":["household god","lares","port (nautical, modern)"],"phonetic":"/lɑr/","extraExplanation":["“Lar/Lares”常出现在介绍罗马日常生活与宗教的文章里：罗马人会在家中设“lararium（家神龛）”，供奉拉尔神与祖先之灵。","“larboard”后来逐渐被“port”取代，主要是为了避免与“starboard（右舷）”在口头指令中听起来太像而造成误会。"]}
{"word":"Lara","summary":{"en":"Lara is most commonly a female first name, and it can also be a surname.","zh":"Lara 最常见是女性名字，也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a personal name for a woman or girl).","zh":"女性名字（用于女孩或女性的个人名字）。"},"examples":[{"en":"Lara is my classmate in English class.","zh":"Lara 是我英语课的同学。"},{"en":"Please ask Lara to call me back.","zh":"请让 Lara 给我回电话。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) in some cultures.","zh":"姓氏（在一些文化中也可作姓）。"},"examples":[{"en":"Dr. Lara will see you at 3 p.m.","zh":"Lara 医生会在下午三点见你。"}]}],"synonyms":["Laura (related name)"],"phonetic":"/ˈlɑɹə/","extraExplanation":["“Lara”在英语语境里通常被当作人名（专有名词），一般不翻译，常见做法是音译为“拉拉/拉娜”（具体取决于地区与个人偏好）。","在文学与流行文化中，“Lara”也常让人联想到《日瓦戈医生》（Doctor Zhivago）中的女主角 Lara，以及游戏/电影《古墓丽影》（Tomb Raider）主角 Lara Croft；这些会影响人们对名字的文化联想。","与其拼写相近的名字有“Laura（劳拉）”；两者在英语里是不同名字，读音也不同。"]}
{"word":"laralia","summary":{"en":"“Laralia” is not a common English vocabulary word; it is likely a name or a misspelling.","zh":"“Laralia”不是常见英语词汇；更可能是人名/专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a proper name (e.g., a person, place, brand) or a misspelling of another word.","zh":"不是常见英语词典中的标准词；更可能是专有名词（如人名、地名、品牌名）或某个单词的拼写错误。"},"examples":[{"en":"Laralia is listed as the author on the cover, so it may be a pen name.","zh":"封面上写着作者是 Laralia，所以它可能是笔名。"},{"en":"I couldn’t find “laralia” in the dictionary—do you mean “lorelei” or something similar?","zh":"我在词典里找不到“laralia”——你是不是想写“lorelei”等相近的词？"}]}],"phonetic":"N/A","extraExplanation":["“Laralia”在英语里不像是常用词，因此发音和含义高度依赖具体语境（例如：来源语言、是否为品牌/角色名）。如果你能告诉我它出现在哪句子、哪本书/游戏/歌曲里，我可以更准确地判断它的意思、正确拼写，以及更自然的读法。","如果你想查的是类似拼写的词，请确认是否是：Lorelai（常见人名）、larval（幼体的）、lullaby（摇篮曲）等。"]}
{"word":"laramide","summary":{"en":"Laramide refers to the Laramide Orogeny, a major mountain-building period that shaped western North America.","zh":"Laramide 指“拉拉米德造山运动”及其相关事物，是塑造北美西部山脉的重要造山时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Laramide Orogeny, a period of mountain-building in western North America (late Cretaceous to early Paleogene).","zh":"与“拉拉米德造山运动”有关的；指北美西部在白垩纪晚期至古新世/始新世早期的造山（山脉形成）时期。"},"examples":[{"en":"The Rocky Mountains were greatly shaped by Laramide tectonic activity.","zh":"落基山脉在很大程度上是由拉拉米德时期的构造活动塑造的。"},{"en":"Our field trip focused on Laramide-aged faults and folds.","zh":"我们的野外考察重点研究拉拉米德时期的断层与褶皱。"}]},{"partOfSpeech":"n.","definition":{"en":"A mountain-building episode (the Laramide Orogeny) that formed or uplifted many ranges in western North America.","zh":"（专有名词用法）拉拉米德造山运动：形成或抬升北美西部多条山脉的一次造山事件。"},"examples":[{"en":"Geologists date some uplifts to the Laramide.","zh":"地质学家将一些地壳抬升追溯到拉拉米德造山运动时期。"},{"en":"The Laramide is often discussed alongside Sevier deformation.","zh":"拉拉米德造山运动常与塞维尔构造变形一起讨论。"}]}],"synonyms":["Laramide Orogeny","Laramide deformation","Laramide tectonism"],"phonetic":"/ˈlærəˌmaɪd/","extraExplanation":["“Laramide”来自美国怀俄明州的拉勒米（Laramie）地区名称；在地质学里多见于教材、论文与地质图说明。","你输入的“laramide”可能是拼写变体；常见标准拼写为 **Laramide**（首字母大写）。如果你其实想问的是止泻药 **loperamide**（洛哌丁胺），告诉我我也可以解释那个词。"]}
{"word":"laramie","summary":{"en":"Laramie is most commonly a proper name for a city in Wyoming, and it also appears in cultural titles like The Laramie Project.","zh":"Laramie 最常见是美国怀俄明州的一座城市名，也常出现在如《拉勒米计划》等文化作品标题中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in southeastern Wyoming, U.S., known for the University of Wyoming and its high-elevation setting","zh":"美国怀俄明州东南部的一座城市，以怀俄明大学和高海拔地理环境而闻名"},"examples":[{"en":"She moved to Laramie to study at the University of Wyoming.","zh":"她搬到拉勒米（Laramie）去怀俄明大学读书。"},{"en":"It can get very windy in Laramie during the winter.","zh":"拉勒米的冬天可能会很刮风。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in titles and cultural references, especially The Laramie Project, a well-known American play about a real-life hate crime and its community impact","zh":"用于书名、剧名等文化语境的名称，尤其指美国知名戏剧《拉勒米计划》（The Laramie Project），探讨一起真实仇恨犯罪及其对社区的影响"},"examples":[{"en":"Our class watched The Laramie Project and discussed how communities respond to violence.","zh":"我们班观看了《拉勒米计划》，并讨论社区如何回应暴力事件。"}]}],"phonetic":"/ˈlærəmi/","extraExplanation":["“Laramie”通常读作重音在第一音节。它既是地名，也常作为专有名词出现在新闻、历史或文学/戏剧作品标题中。","如果你在地图或自然地理语境看到它，也可能指“Laramie River（拉勒米河）”“Laramie County（拉勒米县）”等相关地名。"]}
{"word":"larararia","summary":{"en":"“larararia” is not a recognized English word; it may be a misspelling (possibly of “lararia”).","zh":"“larararia”不是规范英文词，可能是拼写错误（例如想写“lararia”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up/placeholder string. You may have meant “lararia” (plural of Latin-derived “lararium,” a household shrine in ancient Rome) or another similar-looking word.","zh":"不是标准英文单词，可能是拼写错误或随意组合的字符串。你可能想写的是“lararia”（源自拉丁语“lararium”的复数，指古罗马家庭祭坛/家神龛）或其他拼写相近的词。"},"examples":[{"en":"“Larararia” doesn’t appear in standard English dictionaries—did you mean “lararia”?","zh":"“larararia”在常见英语词典里查不到——你是不是想写“lararia”？"},{"en":"If you tell me the sentence you saw it in, I can help identify the intended word.","zh":"如果你把看到它的句子发给我，我可以帮你判断原本想表达的词。"}]}],"extraExplanation":["“lararia”常用于古典研究/考古语境：单数“lararium”指罗马家庭供奉家神（Lares）的神龛；复数为“lararia”。如果你是在历史、博物馆说明或古罗马相关文本中看到的，很可能就是这个词。"]}
{"word":"lararia","summary":{"en":"Lararia are Roman household shrines (plural of lararium).","zh":"Lararia 指古罗马家庭神龛（lararium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Roman household shrines (plural of lararium), usually small altars or niches in a home for honoring the Lares (protective household spirits) and often other family gods.","zh":"（lararium 的复数）古罗马家庭神龛/家宅祭坛，通常是家中墙龛或小祭台，用来供奉拉瑞斯（Lares，守护家宅的神灵）以及其他家神。"},"examples":[{"en":"Archaeologists found brightly painted lararia in many houses at Pompeii.","zh":"考古学家在庞贝城的许多住宅中发现了色彩鲜艳的家庭神龛（lararia）。"},{"en":"The lararia show how religion was part of everyday family life in ancient Rome.","zh":"这些家庭神龛（lararia）显示出宗教如何融入古罗马家庭的日常生活。"},{"en":"A small offering of wine might be poured at the lararia during festivals.","zh":"在节日期间，人们可能会在家庭神龛（lararia）前献上少量酒作为祭品。"}]}],"synonyms":["household shrines","domestic shrines","larariums"],"phonetic":"/ləˈrɛriə/","extraExplanation":["“lararia”主要出现在古典学、考古与艺术史语境中，常与庞贝、赫库兰尼姆等遗址的壁画与家宅布局一起讨论。","典型的 lararium 可能是墙上的小龛位（像迷你“神龛柜”），旁边绘有蛇、祭品桌或家神形象；这类图像帮助研究者理解罗马人的家庭信仰与日常仪式。","英文中更常见的单数形式是 “lararium”；“lararia”作为复数在学术写作里很常用。"]}
{"word":"lararium","summary":{"en":"A lararium is an ancient Roman household shrine for honoring the family’s protective spirits (Lares).","zh":"lararium 指古罗马家庭中供奉守护神（Lares）的家祭神龛/祭坛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A household shrine in ancient Roman homes, used to honor the family’s protective spirits (the Lares), often with small statues and offerings.","zh":"古罗马家庭中的家祭神龛（家宅祭坛），用来供奉守护家庭的神灵（拉雷斯 Lares），常摆放小雕像与供品。"},"examples":[{"en":"In many Pompeii houses, the lararium was set into a wall niche near the kitchen or courtyard.","zh":"在庞贝的许多住宅里，lararium 常嵌在靠近厨房或庭院的墙龛中。"},{"en":"The family left wine or incense at the lararium during daily rituals.","zh":"家人会在 lararium 前献上酒或焚香，作为日常祭仪的一部分。"}]}],"synonyms":["household shrine","domestic shrine","family shrine"],"phonetic":"/ləˈrɛriəm/","extraExplanation":["lararium 来自拉丁语 Lar（复数 Lares），指“守护家庭与家宅的神灵”。lararium 不只是装饰品，更像是“家中最神圣的小角落”，体现罗马人把宗教实践融入日常生活的方式。","考古学中常在庞贝、赫库兰尼姆等遗址看到 lararium 的壁画与小神像；其位置通常与家庭活动空间（如厨房、庭院）相连，强调“守护”与“家”的概念。"]}
{"word":"larboard","summary":{"en":"“Larboard” means the left side of a ship (facing forward), an older term now mostly replaced by “port.”","zh":"“larboard”指船的左舷（面向船头时的左侧），是较旧的说法，现代多用“port”取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The left side of a ship when you are facing forward (toward the bow); an older term largely replaced by “port.”","zh":"（船上）面向船头时的左舷；较旧的说法，多已被“port（左舷）”取代。"},"examples":[{"en":"The sailor reported a light on the larboard side.","zh":"水手报告说左舷方向有一盏灯。"},{"en":"Turn to larboard, then steady the course.","zh":"向左舷转向，然后保持航向。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located on or directed toward the left side of a ship (facing forward).","zh":"位于船的左舷的；朝向左舷的（面向船头）。"},"examples":[{"en":"The larboard rail was wet from the spray.","zh":"左舷的栏杆被浪花打湿了。"},{"en":"They moved the cargo to the larboard side to balance the ship.","zh":"他们把货物移到左舷以保持船体平衡。"}]}],"synonyms":["port"],"phonetic":"/ˈlɑrˌbɔrd/","extraExplanation":["“larboard”在航海英语中是传统用语，但后来因为“larboard”和“starboard（右舷）”在嘈杂环境中容易听错，英语航海界逐渐改用“port（左舷）”来避免误会。因此在现代海事通信与规范里更常见的是“port/starboard”。","文学与历史语境里仍可能遇到“larboard”，例如海盗题材、航海小说或较早的英语文本（如梅尔维尔等描写航海的作品）中。阅读时可直接把它理解为“port（左舷）”。"]}
{"word":"larboards","summary":{"en":"“Larboards” means the left side of a ship (an old word for “port”).","zh":"“larboards”指船的左舷，是“port（左舷）”的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the left side of a ship when you are facing forward (an older nautical word; today it is usually called “port”).","zh":"（航海旧用语）船只朝前时的左舷；如今通常说“port（左舷）”。"},"examples":[{"en":"Keep to larboard as we enter the channel.","zh":"我们驶入航道时要靠左舷行驶。"},{"en":"The waves struck the larboards all night.","zh":"海浪整夜拍打着左舷。"}]}],"synonyms":["port","port side"],"phonetic":"/ˈlɑrˌbɔrd/","extraExplanation":["“larboard”是历史上的航海用语，和“starboard（右舷）”发音相近，容易在风浪中听错，后来英语航海界逐渐改用“port（左舷）”来避免混淆。现在“larboard”多见于旧文献、历史小说或复古风格的航海描写。"]}
{"word":"larbolins","summary":{"en":"“larbolins” doesn’t appear to be a standard English word; it’s likely a typo or a name—please provide context for an accurate match.","zh":"“larbolins”看起来不是标准英语词，更可能是拼写错误或名称；请提供上下文以便准确匹配。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or proper name. If you meant a different word, share the context (a sentence, topic, or where you saw it) and I can identify the closest match.","zh":"不是标准英语词；很可能是拼写错误、用户名或专有名词。若你想查的是另一个词，请提供上下文（句子/主题/出处），我可以帮你找最接近的正确词。"},"examples":[{"en":"I couldn’t find “larbolins” in a dictionary—could it be a brand name or a typo?","zh":"我在词典里找不到“larbolins”——它会不会是品牌名或拼写错误？"},{"en":"If you paste the full sentence with “larbolins,” I can guess the intended word.","zh":"如果你把包含“larbolins”的完整句子贴出来，我可以帮你推测你想表达的词。"}]}],"phonetic":"/ˌlɑr.boʊˈlɪnz/","extraExplanation":["“larbolins”在常见英语词典与语料库中没有明确记录，因此更像：①拼写错误；②人名/地名；③品牌名；④某个小圈子用语/游戏ID。","你可以回我：它出现在哪篇文章/哪本书/哪个网站？或给出前后各1-2句话。我也可以根据发音或相近拼写帮你锁定可能的目标词（例如以 -ins 结尾的词，或以 carbo-/arbor- 开头的词等）。"]}
{"word":"larbowlines","summary":{"en":"“Larbowlines” is likely a misspelling/merged form of “larboard bowlines,” meaning the bowlines (sail-control ropes) on the port/left side of a sailing ship.","zh":"“larbowlines”很可能是“larboard bowlines”的合写或误拼，指帆船左舷（port）一侧的牵帆索（用于控制帆形）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nautical, often written as “larboard bowlines”) ropes on the port (left) side of a sailing ship used to pull the front edge of a sail forward, helping the sail hold its shape when sailing close to the wind.","zh":"（航海用语，常写作“larboard bowlines”）帆船左舷（即“port”）一侧的牵帆索，用来把帆的前缘向前拉，使帆在迎风/近风航行时保持形状。"},"examples":[{"en":"Haul on the larboard bowlines to keep the sail drawing.","zh":"拉紧左舷的牵帆索，让帆继续有效受风。"},{"en":"In old sea stories, you may read commands like “Larboard bowlines!”","zh":"在老航海故事里，你可能会看到类似“Larboard bowlines!”（左舷牵帆索！）这样的口令。"}]}],"synonyms":["port bowlines","bowlines (port side)"],"phonetic":"ˈlɑrˌbɔrd ˈboʊlaɪnz","extraExplanation":["“larbowlines”看起来像把两个航海词连在一起的拼写：larboard（左舷，旧称）+ bowlines（牵帆索）。现代英语里更常用 port 代替 larboard，因为 larboard 和 starboard（右舷）在口头指令里容易听混。","bowline（牵帆索）来自古法语/中古英语，和“拉住帆的前缘（leech/edge）以调整受风”有关；不要和常见的结名 bowline knot（“称人结/单套结”）混淆。","如果你是在某段航海文本或海盗题材作品里见到“larbowlines”，它很可能是“larboard bowlines”的简写或误拼。"]}
{"word":"larc","summary":{"en":"LARC usually means long-acting reversible contraception (long-term, removable birth control).","zh":"LARC 通常指长效可逆避孕（长期有效、可取出/停止的避孕方式）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Long-acting reversible contraception; birth control methods that work for a long time and can be stopped/removed to restore fertility.","zh":"（缩写）长效可逆避孕；指能维持较长时间、且停止/取出后可恢复生育力的避孕方式。"},"examples":[{"en":"The clinic offers counseling on LARC options like IUDs and implants.","zh":"这家诊所提供关于 LARC 选择（如宫内节育器和皮下埋植）的咨询。"},{"en":"Many people choose LARC because it is low-maintenance and effective.","zh":"很多人选择 LARC，因为它省心且有效。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) A written form of “LARC” used casually in messages; it may also be a typo for “lark” or “larch,” depending on context.","zh":"（较少见）在聊天/短信里随手写的“LARC”；也可能是把“lark（云雀/玩乐）”或“larch（落叶松）”打错了，需看上下文。"},"examples":[{"en":"Did you mean LARC (the contraception term), or lark (the bird)?","zh":"你是指 LARC（避孕术语），还是 lark（云雀）？"},{"en":"I saw “larc” in the notes, but I think it was a typo for “larch.”","zh":"我在笔记里看到“larc”，但我觉得是把“larch”打错了。"}]}],"synonyms":["long-acting reversible contraception"],"phonetic":"/lɑrk/","extraExplanation":["LARC 常见包含两大类：IUD（宫内节育器）与 implant（皮下避孕植入棒）。它强调“长效（long-acting）”“可逆（reversible）”，也就是不用每天记得做什么、但想要怀孕时可通过取出/停止来恢复生育力。","在医疗英语里，LARC 是非常常见的公共卫生/妇产科缩写；在非医疗语境中单独写“larc”容易引起误解，建议写全或至少大写为 LARC。"]}
{"word":"larcenable","summary":{"en":"A legal adjective meaning “able to be stolen; property that can legally be the object of larceny.”","zh":"一个法律形容词，指“在法律上可作为盗窃（larceny）对象的财物；可被偷的（在盗窃罪意义上）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(legal) Capable of being stolen; considered property that can be the object of larceny (theft).","zh":"（法律）可成为盗窃对象的；法律上可被视为“可被偷走”的财物。"},"examples":[{"en":"In many jurisdictions, only larcenable property can be charged under larceny laws.","zh":"在许多司法辖区，只有“可成为盗窃对象的财物”才可能以盗窃罪（larceny）起诉。"},{"en":"The court argued that the item was not larcenable because it was not treated as personal property.","zh":"法院认为该物品不属于可被盗窃的对象，因为它不被视为动产（个人财产）。"}]}],"synonyms":["stealable","subject to larceny"],"phonetic":"/ˈlɑrsənəbəl/","extraExplanation":["这是偏法律/书面用语，日常英语里很少用。更常见的表达是“stolen property / something that can be stolen（能被偷的东西）”。","在英美法语境里，“larceny”传统上主要指对“他人的动产（personal property）”的盗取，因此一些对象（例如某些无形财产、服务、或特定情况下的土地/不动产）在传统定义下可能被认为“不 larcenable”。现代法律在很多地方已用更广义的“theft”条款覆盖。"]}
{"word":"larcener","summary":{"en":"A person who steals; a thief (often in legal/formal contexts).","zh":"偷东西的人；小偷（多用于法律/正式语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common spelling: **larcener** → **larcenist** or **larcenist/larcen(er)**; standard word: **larcenist** or **thief**) A person who commits larceny (the crime of stealing).","zh":"（常见拼写：**larcener** 多为非标准写法；更常用：**larcenist** 或 **thief**）犯盗窃罪的人；小偷。"},"examples":[{"en":"The police arrested a suspected larcener who had been stealing wallets on the subway.","zh":"警方逮捕了一名涉嫌盗窃的小偷，他一直在地铁上偷钱包。"},{"en":"In court, the larcener claimed it was a misunderstanding.","zh":"在法庭上，这名盗窃者称这是个误会。"}]}],"synonyms":["thief","stealer","burglar (different: breaks in)","pickpocket (specific)","robber (different: uses force)"],"phonetic":"/ˈlɑrsənər/","extraExplanation":["“Larcener”在现代英语里不算常见或标准的词形；更常见的表达是 **thief**（最常用、口语也自然）或更法律/正式的 **larcenist**。","**Larceny** 指“盗窃”（尤其是法律语境），日常交流里通常直接说 **steal**（动词）/ **theft**（名词）更自然。"]}
{"word":"larceners","summary":{"en":"“Larceners” means thieves—people who commit larceny (a legal term for stealing).","zh":"“larceners”指窃贼，即实施“larceny（盗窃罪）”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who commit larceny; thieves (plural of “larcener”)","zh":"犯盗窃罪的人；窃贼（“larcener”的复数）"},"examples":[{"en":"The police arrested two larceners for stealing phones on the subway.","zh":"警方逮捕了两名窃贼，他们在地铁上偷手机。"},{"en":"The shop owner installed cameras to deter larceners.","zh":"店主安装了摄像头来震慑小偷。"},{"en":"The report warned that larceners often target crowded tourist areas.","zh":"报告警告说，小偷常常把目标放在人多的旅游区。"}]}],"synonyms":["thieves","stealers","robbers (not always the same)","shoplifters (specific)"],"phonetic":"/ˈlɑrsənɚz/","extraExplanation":["“larcener”是较偏法律/正式的词，对应的行为是“larceny（盗窃罪）”。在日常英语里，人们更常说“thief/thieves（小偷）”或“shoplifter(s)（商店行窃者）”。","“larceny”在英美法语境中通常指未经允许拿走他人动产并意图永久占有；一些地区的法律会按金额区分“petty larceny（小额盗窃）/grand larceny（重大盗窃）”。"]}
{"word":"larcenic","summary":{"en":"“Larcenic” means “related to larceny; involving theft,” and is mostly used in legal or formal contexts.","zh":"“larcenic”意为“与盗窃（盗窃罪）有关的；涉及偷窃的”，多用于法律或较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or involving larceny (the unlawful taking of someone else’s property).","zh":"与盗窃罪（非法拿走他人财物）有关的；涉及盗窃的。"},"examples":[{"en":"The prosecutor presented evidence of a larcenic scheme to steal electronics from the store.","zh":"检察官出示证据，证明有一项涉及盗窃的计划，用来从商店偷走电子产品。"},{"en":"He was arrested for larcenic behavior after several wallets went missing.","zh":"在多只钱包失踪后，他因涉及盗窃的行为被逮捕。"}]}],"synonyms":["theft-related","thievish","criminal","pilfering"],"phonetic":"/lɑrˈsɛnɪk/","extraExplanation":["“larcenic”常见于法律、警务或正式写作中，日常口语更常说“theft-related（与盗窃有关的）”或直接用“stealing（偷窃）”。","“larceny”是英美法体系中一个较具体的法律概念，常指“非法占有他人动产（personal property）并意图永久剥夺”。不同地区法条对“larceny / theft / robbery / burglary”的划分可能不同：robbery强调暴力或威胁，burglary强调非法入室并意图犯罪。"]}
{"word":"larcenies","summary":{"en":"“Larcenies” means multiple cases of larceny (theft), often in legal or police reports.","zh":"“Larcenies”指多起盗窃（larceny），常见于法律或警方通报语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of larceny: theft—especially the illegal taking of someone else’s property (often used in legal contexts).","zh":"larceny 的复数：盗窃——尤其指在法律语境中，非法拿走他人财物的行为。"},"examples":[{"en":"The police reported several larcenies in the neighborhood last month.","zh":"警方报告说这个社区上个月发生了多起盗窃案。"},{"en":"The store increased security after repeated larcenies.","zh":"商店在盗窃事件反复发生后加强了安保。"},{"en":"He was charged with larcenies related to stolen electronics.","zh":"他因涉及盗窃电子产品而被指控多起盗窃罪。"}]}],"synonyms":["thefts","stealings","property crimes"],"phonetic":"/ˈlɑrsəni/","extraExplanation":["“larceny”是一个偏正式、偏法律的词，日常口语里更常说“theft”或“stealing”。","不同法域对“larceny”的定义可能不同：有些地方会把它与“robbery（抢劫）”“burglary（入室盗窃）”区分开来——通常“larceny”强调“偷拿财物”，不一定包含暴力或闯入。"]}
{"word":"larcenish","summary":{"en":"“Larcenish” means thievish—showing a tendency toward stealing.","zh":"“larcenish”表示“像小偷的/带有偷盗倾向的”，相当于 thievish、larcenous。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the character of theft; inclined to steal (similar to “larcenous”).","zh":"带有偷窃性质的；有偷盗倾向的（类似于 larcenous）。"},"examples":[{"en":"The police described the suspect’s behavior as larcenish.","zh":"警方形容嫌疑人的行为带有偷盗性质。"},{"en":"He gave a larcenish glance at the unattended bag.","zh":"他对那只无人看管的包投去一种“想顺手牵羊”的眼神。"}]}],"synonyms":["thievish","larcenous","pilfering","sticky-fingered"],"phonetic":"/ˈlɑr.sə.nɪʃ/","extraExplanation":["“larcenish”在现代英语里比较少见，更多时候人们会用更常见的“thievish”或更正式/法律色彩更强的“larcenous”。","构词上可理解为“larceny（盗窃罪/盗窃行为）+ -ish（带有……倾向/有点……的）”，语气常带一点讽刺或轻微评判。"]}
{"word":"larcenist","summary":{"en":"A formal word for a person who commits the crime of theft (larceny).","zh":"较正式的说法，指犯盗窃罪（larceny）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who commits larceny (the crime of stealing personal property).","zh":"犯盗窃罪的人；小偷（指犯“larceny/盗窃罪”的人）。"},"examples":[{"en":"The police arrested a larcenist who had been stealing wallets on the subway.","zh":"警方逮捕了一名一直在地铁里偷钱包的盗窃犯。"},{"en":"In court, the larcenist pleaded guilty to taking electronics from the store.","zh":"在法庭上，这名盗窃犯承认从商店偷走了电子产品。"}]}],"synonyms":["thief","stealer","shoplifter"],"phonetic":"/ˈlɑrsənɪst/","extraExplanation":["“larcenist”是法律语境里更常见的词，比日常用的“thief”更正式，带有“构成盗窃罪”的意味。日常聊天里通常直接说 thief / robber（但 robber 指“抢劫”，往往带暴力或威胁）。","词源上来自“larceny（盗窃罪）+ -ist（表示从事某行为的人）”。写作时如果是在新闻、判决或法律背景下用 larcenist 会更贴切。"]}
{"word":"larcenists","summary":{"en":"“Larcenists” means people who steal (a formal/legal word for thieves).","zh":"“Larcenists”指盗窃者/小偷，是偏正式、法律语境的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who commit larceny (the crime of stealing someone else’s property).","zh":"犯盗窃罪的人；小偷（指实施“larceny/盗窃”这种犯罪的人）。"},"examples":[{"en":"The police arrested two larcenists who were stealing phones on the subway.","zh":"警方逮捕了两名在地铁上偷手机的盗窃犯。"},{"en":"The store’s cameras helped identify the larcenists.","zh":"商店的监控帮助确认了这些盗窃者的身份。"}]}],"synonyms":["thieves","stealers","shoplifters","criminals"],"phonetic":"/ˈlɑrsənɪsts/","extraExplanation":["“larcenists”是“larcenist”的复数。法律语境里更常见的说法是“thieves（小偷）”或“offenders（犯罪者）”；“larcenist”更正式、偏法律用语。","“larceny”通常指在未使用暴力的情况下偷走他人财物（与“robbery/抢劫”区分；抢劫包含暴力或威胁）。不同地区法律定义可能不同，但日常英语里一般把它理解为“盗窃”。"]}
{"word":"larcenous","summary":{"en":"Larcenous means ‘related to theft’ or ‘showing an intention to steal.’","zh":"Larcenous 指“与盗窃有关的”或“有偷窃意图的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving theft or showing an intention to steal; related to stealing.","zh":"涉及盗窃的；有偷窃意图的；与偷窃有关的。"},"examples":[{"en":"The police arrested him for larcenous behavior in the store.","zh":"警方因他在商店里的盗窃行为而逮捕了他。"},{"en":"She gave him a larcenous look and then glanced at the cashier.","zh":"她露出一副想偷东西的眼神，然后瞥了一眼收银台。"}]}],"synonyms":["thievish","stealing","pilfering","criminal"],"phonetic":"/ˈlɑrsənəs/","extraExplanation":["“larcenous”来自名词“larceny”（盗窃罪），常见于法律或较正式的语境中，强调“偷窃”这一性质或意图。日常口语里更常说“stealing”或“thievish”。","在美国英语里，“larceny”通常指“非法拿走他人财物且意图永久占有”的盗窃行为（具体定义会因州法律而略有不同）。"]}
{"word":"larcenously","summary":{"en":"“Larcenously” means “in a thieving/stealing way,” often in formal or legal writing.","zh":"“larcenously”意为“以偷窃的方式、像小偷一样”，多见于正式或法律语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a larcenous way; like a thief, involving theft or dishonest taking of property.","zh":"以盗窃的方式；像小偷一样（涉及偷窃或不诚实地拿走他人财物）。"},"examples":[{"en":"He larcenously slipped the wallet into his pocket and walked away.","zh":"他偷偷把钱包塞进自己口袋里，然后走开了。"},{"en":"The camera footage showed someone larcenously removing packages from the porch.","zh":"监控录像显示有人鬼鬼祟祟地从门廊拿走包裹。"}]}],"synonyms":["thievishly","stealthily","dishonestly","illegally"],"phonetic":"/ˈlɑrsənəsli/","extraExplanation":["“larcenously”来自形容词“larcenous”（盗窃的），而“larcenous”又来自名词“larceny”（法律用语：盗窃）。在法律语境里，“larceny”常指未经允许拿走他人财物并意图永久占有；日常英语里更常用“steal/stealthily/like a thief”等表达，因此“larcenously”偏正式、书面或法律风格。"]}
{"word":"larcenousness","summary":{"en":"Larcenousness means a tendency or quality of being inclined to steal.","zh":"Larcenousness 指“具有偷窃倾向/偷窃性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being larcenous; a tendency or intention to steal (often used in legal or formal writing).","zh":"偷窃的性质或状态；有偷窃倾向/意图（常见于法律或正式语境）。"},"examples":[{"en":"The prosecutor tried to show the defendant’s larcenousness through patterns of repeated theft.","zh":"检方试图通过多次盗窃的模式来证明被告具有偷窃倾向。"},{"en":"His larcenousness cost him the trust of his friends and coworkers.","zh":"他的偷窃行为/倾向让他失去了朋友和同事的信任。"}]}],"synonyms":["thievery","stealing","pilfering","kleptomania (informal/clinical context)","criminality"],"phonetic":"/ˈlɑr.sə.nəs.nəs/","extraExplanation":["“larcenousness”来自形容词“larcenous（偷窃的）”加后缀“-ness（……的性质/状态）”。","“larceny”是法律术语，通常指对他人动产的非法占有（盗窃）。因此“larcenousness”多用于描述与“盗窃”相关的性质、动机或倾向，语气比普通的“stealing”更正式。"]}
{"word":"larceny","summary":{"en":"Larceny is the legal term for the crime of stealing someone else’s property.","zh":"Larceny 指“盗窃罪”，是偷取他人财物的法律用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The crime of stealing someone else’s property (especially personal property).","zh":"盗窃罪；偷窃（尤指对他人动产的偷盗行为）。"},"examples":[{"en":"He was arrested for larceny after stealing a wallet on the subway.","zh":"他因在地铁上偷钱包而以盗窃罪被逮捕。"},{"en":"The store’s security camera helped police prove the larceny.","zh":"商店的监控摄像头帮助警方证明了盗窃行为。"}]},{"partOfSpeech":"n.","definition":{"en":"(Legal) A specific category of theft defined by law; often used in formal or court-related contexts.","zh":"（法律）由法律界定的特定“盗窃”类别；常用于正式或司法语境。"},"examples":[{"en":"The charge was reduced from grand larceny to petit larceny.","zh":"指控从重盗窃（grand larceny）降为轻盗窃（petit larceny）。"},{"en":"Different states define larceny and theft slightly differently.","zh":"不同州对“larceny（盗窃）”和“theft（偷盗）”的定义略有不同。"}]}],"synonyms":["theft","stealing","robbery (not the same in law)"],"phonetic":"/ˈlɑrsəni/","extraExplanation":["“larceny”是法律用语，日常英语更常说“theft”或“stealing”。","在美国常见搭配：grand larceny（重盗窃，通常涉案金额较大）、petit/petty larceny（轻盗窃，金额较小）。具体金额门槛因州而异。","词源来自古法语，核心含义就是“偷拿不属于自己的东西”。","写作或新闻里用“larceny”会显得更正式、更法律化；日常对话用“steal/stealing”更自然。"]}
{"word":"larch","summary":{"en":"A larch is a conifer that drops its needles in winter; it can also mean the durable wood from that tree.","zh":"larch 指落叶松（一种冬季落针的针叶树）；也可指落叶松木（耐用木材）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall conifer tree that loses its needles in winter (unusual among conifers).","zh":"落叶松；一种高大的针叶树，但冬季会落针（在针叶树中较少见）。"},"examples":[{"en":"In the fall, the larch needles turn golden before they drop.","zh":"到了秋天，落叶松的针叶会先变成金黄色，然后脱落。"},{"en":"A larch forest can look bright and yellow in autumn.","zh":"秋天的落叶松林看起来会很明亮、金黄。"}]},{"partOfSpeech":"n.","definition":{"en":"the hard, durable wood from a larch tree, often used for outdoor building because it resists rot.","zh":"落叶松木；来自落叶松的坚硬耐用木材，常用于户外建材，因为较耐腐。"},"examples":[{"en":"They used larch for the fence posts because it holds up well outdoors.","zh":"他们用落叶松木做栅栏柱，因为它在户外很耐用。"},{"en":"The cabin’s siding is made of larch.","zh":"这间小木屋的外墙板是用落叶松木做的。"}]}],"synonyms":["tamarack (a North American larch)","conifer (broader term)"],"phonetic":"/lɑrtʃ/","extraExplanation":["“larch”在英语里既可以指树，也可以指这种树的木材。因为落叶松是“会落针的针叶树”，所以在自然写作里常被用来表现季节变化，尤其是秋天由绿转金的景象。","相关词：deciduous（落叶的）常用来形容阔叶树，但落叶松属于“落叶针叶树”，这一点在学习植物词汇时很有辨识度。","文学/自然写作中常见搭配：larch needles（落叶松针叶）、golden larch（金黄的落叶松）、larch forest（落叶松林）。"]}
{"word":"larchen","summary":{"en":"“larchen” is not standard English; it often represents German “Lärchen” (“larches”). Use “larch/larches” in English.","zh":"“larchen”不是标准英语；常见是德语“Lärchen（落叶松复数）”的替代写法。英语用“larch/larches”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard English spelling; most often seen as a German form “Lärchen” meaning “larches” (plural of “larch,” a kind of conifer tree). In English, people usually write “larch” (singular) or “larches” (plural).","zh":"一种不标准的英文拼写；最常见是德语形式“Lärchen”，意思是“落叶松”（larch）的复数。在英语里通常写“larch”（单数）或“larches”（复数）。"},"examples":[{"en":"In a German text, “Lärchen” means “larches” in English.","zh":"在德语文本中，“Lärchen”对应英语的“larches（落叶松们/落叶松复数）”。"},{"en":"If you mean the tree in English, write “larch,” not “larchen.”","zh":"如果你想表达英语里的那种树，写“larch”，而不是“larchen”。"}]}],"synonyms":["larches","larch"],"phonetic":"/ˈlɑrtʃən/","extraExplanation":["“Lärchen”里有变音符号“ä”，在不方便输入时有时会被写成“Larchen/Lerchen”等近似拼写，但这属于跨语言的替代写法，并不是标准英语词。","如果你是在看地名、人名或品牌名（例如某个叫 Larchen 的公司/姓氏），它可能是专有名词，含义需要结合具体语境来判断。你可以把原句发我，我能更准确解释。"]}
{"word":"larcher","summary":{"en":"“Larcher” is a rare word meaning someone associated with larch trees/wood, and it is also used as a surname.","zh":"“larcher”很少见，可指与落叶松树或落叶松木材相关的人，也可用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who works with larch trees (for example, planting, tending, or cutting larch), or someone associated with larch wood","zh":"与落叶松有关的人（例如种植、管理或砍伐落叶松的人），或与落叶松木材相关的人"},"examples":[{"en":"The larcher marked the healthiest larch trees for thinning.","zh":"那位管理落叶松的人标记了最健康的树，准备间伐。"},{"en":"In the old records, a local larcher supplied timber for boats and barns.","zh":"在旧档案里记载，当地有个做落叶松木材生意的人为船只和谷仓提供木料。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name)","zh":"一个姓氏（家族姓）"},"examples":[{"en":"Ms. Larcher will speak at the community meeting tonight.","zh":"拉彻女士今晚会在社区会议上发言。"}]}],"synonyms":["forester","logger","timber worker"],"phonetic":"/ˈlɑrtʃər/","extraExplanation":["“larcher”在现代英语中非常少见，更常见的相关词是“larch”（落叶松）以及职业类表达，如“forester”（护林员）、“logger”（伐木工）。","拼写上容易被误看成“archer”（弓箭手）；两者发音相近，但含义完全不同。"]}
{"word":"larches","summary":{"en":"“Larches” means larch trees; they are conifers that shed their needles in winter.","zh":"“larches”指“落叶松（复数）”，一种冬天会落针的针叶树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A larch tree (plural): a tall conifer that loses its needles in winter, often found in cold or mountainous regions.","zh":"落叶松（复数）：一种高大的针叶树，会在冬天落针，常见于寒冷或高山地区。"},"examples":[{"en":"In autumn, the larches turn golden before their needles fall.","zh":"秋天，落叶松会先变成金黄色，然后针叶脱落。"},{"en":"We hiked through a valley of larches near the mountains.","zh":"我们在山附近的山谷里穿过一片落叶松林徒步。"}]}],"synonyms":["larch trees"],"phonetic":"/ˈlɑrtʃɪz/","extraExplanation":["“Larch” 很特别：它属于针叶树（conifer），但却是少数会“落针/落叶”的针叶树之一，所以常被用来描写季节变化，尤其是秋天金黄、冬天光秃的景象。","常见搭配：larch forest（落叶松林）、larch needles（落叶松针叶）、Siberian larch / European larch（西伯利亚/欧洲落叶松）。","在英语里复数通常加 -es：larch → larches。发音里会多一个 /ɪz/ 的音。"]}
{"word":"larcin","summary":{"en":"“Larcin” means theft or stealing, but it’s rare in modern English; “theft” or “larceny” is more common.","zh":"“larcin”指“盗窃/偷窃”，但现代英语较少用；更常见的是 theft 或 larceny。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of stealing; theft (an uncommon word in modern English, often replaced by “theft” or “larceny”)","zh":"偷窃；盗窃行为（现代英语中较少用，常用 theft 或 larceny 代替）"},"examples":[{"en":"The court records described the incident as larcin.","zh":"法庭记录把这起事件描述为盗窃。"},{"en":"He was arrested for larcin after taking items from the shop.","zh":"他因从商店拿走商品而以盗窃被捕。"}]}],"synonyms":["theft","stealing","larceny","pilfering"],"phonetic":"/ˈlɑr.sɪn/","extraExplanation":["“larcin”多见于较旧或带法语色彩的英语语境，来源于法语 larcin（盗窃）。日常表达更常用 theft（一般“偷窃”）或 larceny（法律用语“盗窃罪/盗窃行为”）。"]}
{"word":"larcinry","summary":{"en":"Larceny is a formal legal word meaning the crime of stealing.","zh":"Larceny 是正式的法律用语，意思是“盗窃（罪）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the crime of stealing someone else’s property (a legal term; similar to “theft”)","zh":"盗窃罪；偷窃（法律用语，类似 theft）"},"examples":[{"en":"He was arrested for larceny after stealing a phone from a store.","zh":"他因在商店偷手机而以盗窃罪被逮捕。"},{"en":"The report says the suspect has prior convictions for larceny.","zh":"报告称嫌疑人此前有盗窃罪前科。"}]}],"synonyms":["theft","stealing"],"phonetic":"/ˈlɑrsəni/","extraExplanation":["你输入的“larcinry”常见是拼写错误，正确拼写是 **larceny**。","**Larceny** 是偏正式/法律场景用词；日常英语里更常说 **theft** 或 **stealing**。不同司法体系里，“larceny”和“theft”的法律定义可能有细微差别（例如是否需要“未经允许拿走并意图永久占有”），但学习者可以先把它理解为“盗窃”。"]}
{"word":"lard","summary":{"en":"“Lard” most commonly means pig fat used for cooking; as a verb, it means to stuff something with too much extra material or detail.","zh":"“lard”最常指烹饪用的猪油；作动词时指（文章、讲话等）塞入过多额外内容或细节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft white fat from pigs, used in cooking (for frying, baking, or making pastry).","zh":"（猪）猪油；板油（常用于煎、炸、烘焙或做酥皮点心）"},"examples":[{"en":"My grandma makes pie crust with lard for a flakier texture.","zh":"我奶奶会用猪油做派皮，这样口感更酥更松。"},{"en":"Heat a spoonful of lard in the pan before adding the vegetables.","zh":"把一勺猪油放进锅里加热，再下蔬菜。"}]},{"partOfSpeech":"v.","definition":{"en":"To add something in large amounts, often more than necessary (especially to fill speech or writing with too many details).","zh":"大量加入；（尤指）在讲话或写作中塞进过多细节/内容（常含“过多、累赘”之意）"},"examples":[{"en":"The article is larded with unnecessary statistics.","zh":"这篇文章塞满了不必要的统计数据。"},{"en":"Try not to lard your explanation with too many side stories.","zh":"尽量别在解释里穿插太多题外话。"}]}],"synonyms":["(n.) pork fat","(n.) cooking fat","(v.) stuff","(v.) load","(v.) season (with)"],"phonetic":"/lɑrd/","extraExplanation":["“lard”（猪油）在传统美式烘焙里很常见，尤其用于派皮、饼干等，能让口感更“flaky”（层次分明、酥）。现在也有人会用黄油或植物起酥油（shortening）替代。","动词用法“be larded with …”多见于正式写作或评论语境，语气通常偏负面，意思接近“充斥着/堆满了”。"]}
{"word":"lardacein","summary":{"en":"Lardacein is a rare, old medical term for waxy (amyloid-like) deposits in tissues.","zh":"Lardacein 是罕见的旧医学词，指组织中的蜡样（淀粉样）沉积。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, dated) A waxy, starch-like substance found in tissues in certain diseases; essentially an older term connected with “amyloid.”","zh":"（医学，旧用法）某些疾病中出现在组织里的蜡样、似淀粉的物质；基本上与“淀粉样物质（amyloid）”相关的旧称。"},"examples":[{"en":"In older pathology texts, doctors sometimes described amyloid deposits as lardacein.","zh":"在较早的病理学教材里，医生有时把淀粉样沉积描述为 lardacein。"},{"en":"The report mentioned a lardacein change in the spleen, meaning a waxy/amyloid-like appearance.","zh":"报告提到脾脏出现 lardacein 改变，意思是呈现蜡样/淀粉样的外观。"}]}],"synonyms":["amyloid","lardaceous change","waxy degeneration"],"phonetic":"/lɑrˈdeɪsiɪn/","extraExplanation":["这是一个相当少见且偏旧的医学词，常见于19世纪到20世纪早期的病理学文献中。之所以与“lard（猪油）”相关，是因为这种沉积在肉眼外观上常被形容为“蜡样/油脂样”。","现代医学写作里通常直接用 amyloid（淀粉样物质）或 amyloidosis（淀粉样变性）等术语，而不是 lardacein。"]}
{"word":"lardaceous","summary":{"en":"Lardaceous means “like lard”: greasy or fatty-looking; it can also be an older medical term for fatty/waxy-looking tissue.","zh":"lardaceous 意为“像猪油一样的”：油腻、肥腻；也可作较旧的医学用语，指组织呈脂肪样/蜡样外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling lard (pig fat); greasy, fatty, or oily in look, texture, or feeling.","zh":"像猪油（猪脂）的；油腻的、肥腻的（指外观、质地或触感）。"},"examples":[{"en":"After hours in the kitchen, the air felt lardaceous and heavy with cooking fumes.","zh":"在厨房忙了好几个小时后，空气变得油腻厚重，充满了烹饪的味道。"},{"en":"The sauce turned lardaceous as it cooled, forming a pale, fatty layer on top.","zh":"酱汁冷却后变得肥腻，表面结了一层浅色的油脂。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having a fatty, waxy appearance in body tissue; relating to “lardaceous degeneration” (an older term).","zh":"（医学）组织呈脂肪样、蜡样外观的；与“脂肪样变性/蜡样变性”（较旧术语）有关。"},"examples":[{"en":"Older medical texts sometimes describe a liver as lardaceous.","zh":"较早的医学文献有时会形容肝脏呈“脂肪样/蜡样”（lardaceous）。"}]}],"synonyms":["greasy","oily","fatty","unctuous","waxy"],"phonetic":"/lɑrˈdeɪʃəs/","extraExplanation":["词源上来自“lard（猪油）”+ 形容词后缀 “-aceous”（表示“……的、像……的”），因此字面意思就是“像猪油一样的”。","在现代日常英语中较少见，更常见的是用 greasy / oily / fatty 来表达；“lardaceous”带一点文学或描写性、甚至略带嫌恶的语感。","医学用法多见于旧资料；现在更常用更具体的术语（具体取决于疾病与组织改变）。"]}
{"word":"larded","summary":{"en":"“Larded” means either prepared with added fat (in cooking) or, figuratively, stuffed/loaded with extra words or details; it is also the past form of “lard.”","zh":"“larded”既可指烹饪中给肉加肥膘/油脂，也可作比喻表示“堆满、夹杂过多内容”，同时是“lard”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered or filled with strips of fat (lard), especially to add moisture and flavor to meat while cooking","zh":"（尤指烹饪时）用肥膘/猪油条夹入或覆盖在肉上，以增加油脂、保持水分并提升风味"},"examples":[{"en":"The chef served a larded roast to keep the meat juicy.","zh":"厨师端上了一道夹肥膘的烤肉，让肉质更鲜嫩多汁。"},{"en":"Traditionally, some game meats were larded before roasting.","zh":"传统上，有些野味在烘烤前会先夹肥膘。"}]},{"partOfSpeech":"adj.","definition":{"en":"loaded or sprinkled with extra words, jokes, or details; heavily “stuffed” with something (often used figuratively)","zh":"（比喻）充满、堆满（词句、笑料、细节等）；夹杂太多（常带夸张或批评意味）"},"examples":[{"en":"His speech was larded with clichés and long quotes.","zh":"他的演讲堆满了陈词滥调和冗长引语。"},{"en":"The article is larded with unnecessary details.","zh":"这篇文章夹杂了太多不必要的细节。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense or past participle of “lard”: to add fat to food, or to add something extra throughout","zh":"“lard”的过去式/过去分词：给食物加油脂；或（比喻）在整体中穿插加入某物"},"examples":[{"en":"She larded the meat with bacon before baking it.","zh":"她在烘烤前用培根给肉夹肥膘。"},{"en":"The report was larded with personal opinions.","zh":"这份报告夹杂了很多个人观点。"}]}],"synonyms":["stuffed","loaded","sprinkled","seasoned","embellished"],"phonetic":"/ˈlɑrdɪd/","extraExplanation":["“lard”原指“猪油/肥膘”，因此字面意思与烹饪强相关；引申义把“夹肥膘、塞进很多油脂”的感觉借来形容文字或内容“塞得太满”。","文学里常见到比喻用法，例如莎士比亚作品中就有把话语“larded”来形容语言被过多修饰或堆砌的表达。"]}
{"word":"larder","summary":{"en":"A larder is a place in a home where food is stored, similar to a pantry.","zh":"larder 指家中用来存放食物的储藏室/食品柜，含义类似 pantry（食品储藏室）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small room or cupboard used for storing food, especially in a home","zh":"（家中）食品储藏室；食物柜（尤指存放干货或冷藏前的食物）"},"examples":[{"en":"We keep rice, flour, and canned beans in the larder.","zh":"我们把米、面粉和罐装豆子放在食品储藏室里。"},{"en":"She went to the larder to look for something to snack on.","zh":"她去食品储藏室找点零食。"}]}],"synonyms":["pantry","food cupboard","storeroom"],"phonetic":"/ˈlɑrdər/","extraExplanation":["“larder”在英式英语里更常见，常指家里专门存放食物的小房间或大柜子；在美式英语中更常用的说法是“pantry”。不过在文学、历史题材或较正式的写作里，美式英语也会用“larder”。","词源与“lard（猪油）”有关：早期的larder常用来存放腌肉、猪油等耐放的食物，因此这个词带有传统家庭储粮的感觉。","常见搭配：a well-stocked larder（储备充足的储藏室）；empty the larder（把储藏室清空）；raid the larder（去储藏室翻找吃的/偷拿吃的）。文学中也常用来营造“家中物资是否充足”的氛围。"]}
{"word":"larderellite","summary":{"en":"“larderellite” is not a recognized standard English word; it’s probably a misspelling or a highly specialized/proper term.","zh":"“larderellite”不是常见或标准英语词汇；更可能是拼写错误，或非常专业/专有的术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It does not appear in major English dictionaries and is likely (1) a misspelling, (2) a very specialized scientific/proper name, or (3) a coined term.","zh":"不是标准英语词汇。在主流英语词典中通常查不到，可能是（1）拼写错误，（2）非常专业的科学/专有名称，（3）自造词。"},"examples":[{"en":"I couldn’t find “larderellite” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“larderellite”，你能把看到它的句子发我吗？"},{"en":"Did you mean “larder” (a room or cupboard for storing food)?","zh":"你是不是想写“larder”（储藏食物的食品储藏室/橱柜）？"}]}],"phonetic":"/ˌlɑːr.dɚˈɛl.aɪt/","extraExplanation":["从构词上看，它像是“larder（食品储藏室）+ -ellite（类似矿物/材料命名的后缀，如某些矿物名里会出现）”，但在常见英语与常见矿物名中都不算常见。","如果你是在论文、矿物/化学资料、或游戏/小说里看到的：请提供来源或上下文句子，我可以帮你判断它是否是专有名词、某种矿物/材料名，或是作者自造词。","如果你想查拼写：可以对照看看是否本来想写的是 larder、lard、larderer（古义：管理食品储藏室的人），或某个以 -lite/-elite 结尾的词。"]}
{"word":"larderer","summary":{"en":"A larderer is a person responsible for storing and managing food in a larder, especially in historical large households.","zh":"larderer指负责在食品储藏室里保管、管理食物的人（多见于旧时大户人家语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is in charge of a larder (a room or place where food is stored), especially in a large household; a keeper of stored food.","zh":"（尤指大户人家的）食品储藏室管理员；管理与保管储存食物的人。"},"examples":[{"en":"In the old manor house, the larderer kept the meat, cheese, and bread locked away.","zh":"在那座古老的庄园里，食品储藏室管理员把肉、奶酪和面包都锁起来保管。"},{"en":"The larderer checked the pantry each morning and recorded what needed replacing.","zh":"食品储藏室管理员每天早上检查储藏室，并记录哪些需要补充。"}]}],"synonyms":["keeper","storeroom manager","pantry manager"],"phonetic":"/ˈlɑrdərər/","extraExplanation":["“larderer”来自“larder”（食品储藏室、食物贮藏处）。在过去的英国大宅或贵族家庭里，厨房体系分工细致，larderer负责管理和发放储存的肉类、奶酪、面包等；现代英语中这个词较少见，常被更通用的“pantry manager / storeroom manager”或直接用“cook / kitchen staff”取代。"]}
{"word":"larderful","summary":{"en":"“Larderful” is a nonstandard, playful word meaning “having a larder/pantry full of food; well-stocked.”","zh":"“larderful”多为非标准、带幽默感的自造词，意思是“储藏室/食品柜里很充足、备货齐全”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or invented word: “having a larder full of food; well-stocked with stored food.”","zh":"非标准或自造词：指“储藏室（larder）里食物很充足；存粮充裕、备货齐全”。"},"examples":[{"en":"After harvest season, the house felt larderful and ready for winter.","zh":"收获季过后，这家里感觉“粮仓满满”，准备过冬也不慌。"},{"en":"We were larderful—there was soup, rice, and canned vegetables for weeks.","zh":"我们“储备很足”——汤、米饭、罐头蔬菜够吃好几个星期。"}]},{"partOfSpeech":"n.","definition":{"en":"Rare humorous formation used like a noun: “a larder-full amount (of food).”","zh":"少见的幽默造法，也可当名词用：指“满满一储藏室（的食物量）”。"},"examples":[{"en":"They donated a larderful to the food bank.","zh":"他们向食物银行捐了“满满一储藏室的量”。"}]}],"synonyms":["well-stocked","fully stocked","abundant","plentiful"],"phonetic":"/ˈlɑrdərfəl/","extraExplanation":["“larderful”不是常见的标准英语词汇，更常见的表达是：a well-stocked pantry / a full pantry / a larder full of food。","词形上它看起来像把“larder（储藏室）+ -ful（充满……的）”拼在一起，属于很直观的“自造词/临时造词（nonce word）”，在文学写作、幽默表达或个人笔记里可能出现，但在正式写作中建议改用更常规的说法。","在美式英语里，“pantry（食品储藏柜/储藏室）”比“larder”更日常；“larder”更偏英式或较旧的用法。"]}
{"word":"larderie","summary":{"en":"Larderie is a rare, old-fashioned word for a place where preserved meats (like bacon or lard) are stored—essentially a larder.","zh":"Larderie 是一个罕见的旧式词，指存放培根、猪油等腌制肉类的地方，本质上就是食品储藏室（larder）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where bacon, lard, or other stored meats are kept; a larder or pantry (rare/old-fashioned).","zh":"（罕见/旧式）储存培根、猪油或其他腌制肉类的地方；食品储藏室/食品间。"},"examples":[{"en":"In old accounts, the servants carried the salted pork down to the larderie for winter storage.","zh":"在旧记载里，仆人把腌猪肉搬到 larderie 里储存过冬。"},{"en":"The novel describes a manor house with a cool cellar and a small larderie near the kitchen.","zh":"小说描写一座庄园宅邸：有凉爽的地窖，厨房旁还有一间小小的 larderie。"}]}],"synonyms":["larder","pantry","storehouse"],"phonetic":"/ˈlɑrdəri/","extraExplanation":["这个词在现代英语里非常少见，多见于历史性写作或带法语色彩的文本。词根与法语 lard（猪油/腌肉）有关，含义常接近 larder（食品储藏室）。在法语语境中，larderie 也可指与猪肉制品相关的店铺/加工处。"]}
{"word":"larderlike","summary":{"en":"“Larderlike” means “like a larder”—cool, storage-oriented, pantry-like.","zh":"“larderlike”表示“像食品贮藏室一样的”——偏凉、用于储存、带有食品储藏间的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a larder (a cool storage room or pantry for food); having the look or feel of a food-storage space.","zh":"像食品贮藏室（储藏间/食品柜）的；带有“储藏食物空间”氛围的。"},"examples":[{"en":"The stone cellar felt larderlike—cool, dim, and perfect for keeping vegetables fresh.","zh":"那间石头地窖很有“食品贮藏室”的感觉——凉爽、昏暗，很适合保存蔬菜的新鲜。"},{"en":"She arranged the shelves in a larderlike way, with jars labeled and lined up neatly.","zh":"她把架子整理得很像食品储藏间：玻璃罐都贴好标签、整齐排放。"}]}],"synonyms":["pantry-like","storeroom-like","cellar-like"],"phonetic":"/ˈlɑrdɚˌlaɪk/","extraExplanation":["“larderlike”由名词 larder（食品储藏室）+ 后缀 -like（像……一样的）构成，属于较少见的描写性形容词，常用于营造空间氛围（如凉、暗、适合储存）。"]}
{"word":"larders","summary":{"en":"“Larders” means food storage spaces; it’s the plural of “larder.”","zh":"“larders”指食品储藏处，是“larder”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “larder”: a room, cupboard, or storage place where food (especially items that keep well) is stored.","zh":"“larder”的复数：食品储藏间/食品柜/储物处，用来存放食物（尤其是耐放的食品）。"},"examples":[{"en":"In old houses, larders were often kept cool to help food last longer.","zh":"在老房子里，食品储藏间通常保持凉爽，以便食物存得更久。"},{"en":"The charity filled the larders of families in need with rice and canned goods.","zh":"慈善机构用大米和罐头等物资为有需要的家庭补充食品储藏。"}]}],"synonyms":["pantries","food cupboards","storerooms"],"phonetic":"/ˈlɑrdɚz/","extraExplanation":["“larder”在英式英语里更常见，指专门放食物的储藏间（传统住宅里常靠近厨房且更阴凉）。在美式英语中，更常用“pantry”。"]}
{"word":"lardier","summary":{"en":"“Lardier” means “more fat or greasy,” the comparative of “lardy,” and is often informal or joking.","zh":"“lardier”意为“更肥胖或更油腻”，是“lardy”的比较级，常见于非正式、带玩笑语气的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"comparative form of “lardy”: fatter or more greasy (often humorous or insulting).","zh":"“lardy”的比较级：更肥胖的；更油腻的（常带幽默或贬义）。"},"examples":[{"en":"After a month of fast food, the burger looks even lardier than before.","zh":"吃了一个月快餐后，这个汉堡看起来比以前更油腻。"},{"en":"The comedian joked that his winter coat made him look lardier on stage.","zh":"那位喜剧演员开玩笑说他的冬衣让他在台上看起来更胖。"},{"en":"This sauce is lardier than the one we had yesterday.","zh":"这份酱汁比我们昨天吃的更油。"}]}],"synonyms":["fatter","greasier","oilier","more fatty","more greasy"],"phonetic":"/ˈlɑrdiər/","extraExplanation":["“lardier”比较少见，更常见的表达是：fatter（更胖）、greasier（更油腻）、more oily（更油）。在描述人时，“lardy/lardier”可能显得不礼貌，建议在正式或敏感场合改用更中性的说法（如 overweight / heavyset）。","词源上与 lard（猪油、肥肉）有关，因此它既可指“体型更肥”，也可指食物“含油更多/更腻”。"]}
{"word":"lardiest","summary":{"en":"“Lardiest” means the most fat/overweight or the most greasy (informal).","zh":"“lardiest”意为“最胖的/最臃肿的”或“最油腻的”（非正式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) The most fat or overweight; extremely chubby.","zh":"（非正式）最胖的；最臃肿的。"},"examples":[{"en":"Of all the kittens, the orange one is the lardiest.","zh":"在所有小猫里，那只橘色的是最胖的。"},{"en":"After the holidays, he joked that he felt lardiest of all his friends.","zh":"假期过后，他开玩笑说自己在朋友里感觉最胖。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) The most greasy or heavy with fat (often describing food).","zh":"（非正式）最油腻的；脂肪最重的（常形容食物）。"},"examples":[{"en":"That was the lardiest slice of pizza I’ve ever had.","zh":"那是我吃过最油的一片披萨。"},{"en":"She avoided the lardiest dishes on the menu.","zh":"她避开了菜单上最油腻的菜。"}]}],"synonyms":["fattest","chubbiest","heaviest","greasiest","oiliest"],"phonetic":"/ˈlɑrdiɪst/","extraExplanation":["“lardiest”是形容词“lardy”的最高级形式（lardy → lardier → lardiest）。词根“lard”指“猪油/油脂”。","语气上偏口语、带调侃甚至有点刻薄；形容人身材时可能冒犯别人，更礼貌的说法可以用“heavier / overweight / plus-size（语境合适时）”。","在现代英文里，“lardy / lardiest”并不算常用，更常见的是“fattest, greasiest, oiliest”。"]}
{"word":"lardiform","summary":{"en":"Lardiform means “lard-like”: resembling soft animal fat in appearance, shape, or texture.","zh":"Lardiform 指“猪油样/脂肪样”：在外观、形状或质地上像动物脂肪（猪油）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the shape, look, or texture of lard (soft animal fat); fat-like.","zh":"呈猪油（动物脂肪）形状、外观或质地的；像脂肪一样的。"},"examples":[{"en":"In older medical writing, the lesion was described as lardiform—pale, smooth, and greasy-looking.","zh":"在较早的医学文献中，这种病灶被描述为“lardiform（猪油样）”——颜色发白、表面光滑、看起来油腻。"},{"en":"The report noted a lardiform deposit around the tissue.","zh":"报告指出组织周围有猪油样沉积物。"}]}],"synonyms":["lard-like","fat-like","greasy-looking","adipose"],"phonetic":"/ˈlɑrdəˌfɔrm/","extraExplanation":["“lardiform”非常少见，多出现在旧式医学/病理学描述中，用来形容外观或触感像“猪油/脂肪”那样的组织或沉积物。","词形可拆为 lard（猪油、动物油脂）+ -iform（“……形状的/……样的”后缀，常见于 scientific English，如 ovaliform 等）。"]}
{"word":"lardiner","summary":{"en":"An old-fashioned word for a larder-keeper—someone who managed stored food (especially meat) in a large household.","zh":"一个古老用词，指“食物储藏室管理员”，在大家庭/庄园中负责储存食物（尤其是肉类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A person in charge of a larder or the storage of meat and food in a large household; a larder-keeper.","zh":"（古义）管理食物储藏室（larder）的人；在大家庭/庄园里负责肉类与食物储存的人。"},"examples":[{"en":"In the old manor, the lardiner kept the salted meat locked away.","zh":"在旧时的庄园里，lardiner 会把腌肉锁起来保管。"},{"en":"The steward spoke with the lardiner about winter supplies.","zh":"管家与 lardiner 商量冬季储备的事。"}]}],"synonyms":["larder-keeper","pantryman","storekeeper"],"phonetic":"/ˈlɑrdənər/","extraExplanation":["“lardiner”在现代英语里非常少见，多见于历史/古文语境，指庄园或贵族家庭中负责“larder（食物储藏室）”的职务人员。","容易与拼写相近的词混淆：gardener（园丁）是常用词；Lardner 也常见作姓氏（如作家 Ring Lardner）。如果你想查的是其中之一，告诉我上下文我可以帮你确认。"]}
{"word":"larding","summary":{"en":"“Larding” most commonly means inserting strips of fat into lean meat; figuratively, it can mean stuffing something with too many extra details.","zh":"“Larding”最常指在瘦肉中插入脂肪条的烹饪法；引申义可指把内容塞入过多额外细节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or technique of inserting strips of fat (usually bacon or pork fat) into lean meat to make it juicier and more flavorful during cooking","zh":"（烹饪）在瘦肉中插入脂肪条（常为培根或猪油脂）的做法，使肉在烹调时更嫩更多汁、更香"},"examples":[{"en":"The chef used larding to keep the venison from drying out.","zh":"主厨用“插脂”来防止鹿肉变干。"},{"en":"Traditional French recipes sometimes call for larding a roast before baking.","zh":"传统法式食谱有时会要求烤之前给肉“插脂”。"}]},{"partOfSpeech":"v.","definition":{"en":"adding many pieces of something, often too much; filling something with extra details (often used critically)","zh":"（比喻，常带批评）塞入大量东西；用过多细节把内容“堆满”"},"examples":[{"en":"The article was larding the story with unnecessary quotes.","zh":"这篇文章往故事里塞了很多不必要的引语。"},{"en":"Try not to go larding your essay with complicated words you don’t fully understand.","zh":"尽量别在作文里硬塞你并不完全理解的复杂词。"}]}],"synonyms":["inserting fat","lard","stuff","load","pad"],"phonetic":"/ˈlɑrdɪŋ/","extraExplanation":["“larding”来自动词“to lard”（加肥油/插脂）。在烹饪语境中，它指一种经典做法：把脂肪条穿进瘦肉里（常用专门的针），与“barding”（把肥膘或培根包在肉外面）相对。","比喻用法里，“lard … with …”常表示“用某物过度点缀/塞满”，语气多偏负面，暗示内容不够精炼。"]}
{"word":"lardite","summary":{"en":"“Lardite” is a rare, informal, usually offensive word for an overweight person.","zh":"“lardite”是个较少见的非正式词，通常带冒犯，用来指肥胖的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, usually offensive) a fat or overweight person.","zh":"（非正式，通常带冒犯）胖子；肥胖的人。"},"examples":[{"en":"He called his classmate a “lardite,” which was rude and hurtful.","zh":"他把同学叫作“lardite”，这很无礼也很伤人。"},{"en":"It’s better to avoid words like “lardite” and use respectful language instead.","zh":"最好避免使用像“lardite”这种词，改用更尊重人的表达。"}]}],"synonyms":["fatso","lardass","chunky (sometimes neutral, sometimes not)"],"phonetic":"/ˈlɑrdˌaɪt/","extraExplanation":["“lardite”不是常见的标准词汇，更像是由“lard（猪油/肥肉）+ -ite（表示某类人/物的后缀）”临时拼出来的贬义称呼，因此在现实交流中很容易被视为羞辱身材（body-shaming）。","如果你想表达“体重较大”而不冒犯他人，可以用更中性的说法：overweight（超重的，偏正式）、heavyset（骨架/体型较壮，较委婉）、plus-size（多用于服装尺码语境）。"]}
{"word":"lardlike","summary":{"en":"“Lardlike” means resembling lard—thick, greasy, or fatty.","zh":"“lardlike”指“像猪油一样的”，强调厚重、油腻或脂肪感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling lard (soft animal fat); having a thick, greasy, fatty look or texture.","zh":"像猪油/动物油脂的；呈现浓厚、油腻、脂肪状的外观或质地。"},"examples":[{"en":"The stew had a lardlike layer of fat floating on top.","zh":"这锅炖菜上面漂着一层像猪油一样的油脂。"},{"en":"His hands felt lardlike after working with greasy meat.","zh":"他处理油腻的肉之后，手摸起来像抹了猪油一样油滑。"}]}],"synonyms":["greasy","fatty","oily","unctuous"],"phonetic":"/ˈlɑrdˌlaɪk/","extraExplanation":["这是一个由“lard（猪油/动物油脂）+ -like（像……一样）”构成的形容词，多用于描述外观或触感“油腻、脂肪厚重”。在日常口语中更常见的替代说法是“greasy / fatty / oily”。"]}
{"word":"lardon","summary":{"en":"A lardon is a small strip/cube of bacon or pork fat used in cooking; it can also mean to add such strips to meat.","zh":"lardon 指烹调用的培根条/培根丁（或猪油丁）；也可作动词，指用培根条/油脂条给肉增香保湿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small strip or cube of bacon (or pork fat), often used to add flavor to dishes like salads, stews, or roasted meats","zh":"（烹饪）培根条/培根丁（或猪油丁），常用于给沙拉、炖菜或烤肉增香"},"examples":[{"en":"The recipe calls for frying lardons until crisp and then adding them to the salad.","zh":"食谱要求把培根丁煎到酥脆，然后拌进沙拉里。"},{"en":"Lardons add a salty, smoky flavor to soups and stews.","zh":"培根丁能给汤和炖菜带来咸香、烟熏的风味。"}]},{"partOfSpeech":"v.","definition":{"en":"to insert or cover meat with strips of bacon or fat (a traditional cooking technique)","zh":"（烹饪）用培根条/油脂条给肉穿插或包覆（传统增香保湿做法）"},"examples":[{"en":"The chef lardoned the roast to keep it juicy.","zh":"厨师用培根条给烤肉穿插增香，以保持多汁。"}]}],"synonyms":["bacon bits","bacon cubes","pancetta (similar)","salt pork (similar)"],"phonetic":"ˈlɑr.dən","extraExplanation":["“lardon”源自法语，常见于法式料理语境。在英语菜单里看到 lardons 通常指“培根丁/培根条”，尤其是用于沙拉（如里昂沙拉）或炖菜的那种小块。","与普通 bacon 不同，lardons 更强调“切成小条/小丁后用于烹调”的形态与用途；有时也可能更偏“猪油脂”而不全是瘦肉。"]}
{"word":"lardons","summary":{"en":"Lardons are small pieces of bacon or fatty pork used in cooking to add rich, savory flavor.","zh":"Lardons 指烹饪中用来增香的培根或肥猪肉小条/小丁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small strips or cubes of fatty bacon or pork used to add flavor to dishes (often cooked until crisp).","zh":"（烹饪用的）培根/猪肉肥膘小条或小丁，用来增香（常煎至酥脆）。"},"examples":[{"en":"The salad was topped with crispy lardons and a warm vinaigrette.","zh":"这道沙拉上撒了酥脆的培根丁，配上温热的油醋汁。"},{"en":"Add the lardons to the pan first so they render their fat.","zh":"先把培根丁下锅，这样能把油脂煸出来。"}]}],"synonyms":["bacon pieces","bacon strips (small)","pancetta cubes"],"phonetic":"/ˈlɑrdənz/","extraExplanation":["在英文食谱里，lardons 常出现在法式或欧式料理中，比如沙拉（如 frisée salad）、炖菜或汤里。它与 bacon bits 不完全一样：lardons 通常更厚、更大块，常用来“煸出油脂（render fat）”并给整道菜打底增香。","词源来自法语 lardon（小块腌猪肉）。英语里多用复数 lardons 来指一份配料；单数 lardon 也能用但较少见。"]}
{"word":"lardoon","summary":{"en":"A lardoon is a sharp satire or written mockery; it can also mean to satirize someone.","zh":"lardoon 指尖刻的讽刺或嘲弄（常为文字作品）；也可作动词，表示讽刺某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, sharp piece of satire or mockery (often written), aimed at criticizing or ridiculing someone","zh":"（多指书面的）短小尖刻的讽刺或嘲弄，用来批评或嘲笑某人"},"examples":[{"en":"The article reads like a lardoon of the mayor rather than fair reporting.","zh":"这篇文章读起来更像是在讽刺市长，而不是公正报道。"},{"en":"He published a lardoon that mocked the fashion trends of the day.","zh":"他发表了一篇短讽文，嘲弄当时的时尚潮流。"}]},{"partOfSpeech":"vt.","definition":{"en":"to satirize or mock someone (usually in writing)","zh":"（通常用文字）讽刺或嘲弄某人"},"examples":[{"en":"The playwright lardooned the rich by portraying them as clueless and self-centered.","zh":"那位剧作家通过把富人写得无知又自我，来讽刺他们。"},{"en":"Some comedians lardoon public figures to expose hypocrisy.","zh":"一些喜剧演员会讽刺公众人物，以揭露虚伪。"}]}],"synonyms":["lampoon","satire","squib","pasquinade","mockery"],"phonetic":"/lɑrˈduːn/","extraExplanation":["“lardoon”在现代英语中较少见，常被更常用的词替代，如 lampoon（讽刺文章/讽刺）、satire（讽刺作品/讽刺手法）、mockery（嘲弄）。在阅读较老的文学作品或正式文风的评论时更可能遇到。"]}
{"word":"lardoons","summary":{"en":"“Lardoons” means satirical jokes or writings attacking someone/something; it can also mean to satirize or lampoon.","zh":"“lardoons”指带讽刺意味的嘲弄/讽刺作品；也可作动词，表示讽刺、挖苦（相对少见用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a humorous or satirical attack (a joke, poem, comment, etc.) that criticizes someone or something; a lampoon","zh":"（以幽默或讽刺方式对人或事的）嘲讽、讽刺作品；挖苦（= lampoon）"},"examples":[{"en":"The article was a lardoon aimed at the city’s new policy.","zh":"这篇文章是一篇针对该市新政策的讽刺文。"},{"en":"His speech included a few light lardoons about his rivals.","zh":"他的演讲里夹杂了几句对对手的轻微挖苦。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make fun of or criticize someone in a humorous, satirical way; to lampoon","zh":"以幽默、讽刺的方式嘲弄或批评；讽刺（= lampoon）"},"examples":[{"en":"Online commenters lardooned the brand after the ad went viral.","zh":"广告走红后，网友纷纷讽刺这家品牌。"},{"en":"The comedian lardooned public figures but avoided personal cruelty.","zh":"这位喜剧演员会讽刺公众人物，但避免人身恶意攻击。"}]}],"synonyms":["lampoon","satire","mock","ridicule","parody","spoof"],"phonetic":"/lɑrˈdun/","extraExplanation":["“lardoons”是名词复数形式，对应单数“lardoon”。该词在现代英语中相对少见，更常用的近义词是“lampoon”“satire（讽刺作品/讽刺）”“mock（嘲弄）”。在正式写作里，用“satire”偏中性、可文学化；“mock”更口语、语气更直接。"]}
{"word":"lardry","summary":{"en":"Laundry means clothes (and similar items) that are being washed or need washing, and it can also mean a laundry shop/place.","zh":"Laundry 指需要洗或正在洗的衣物等，也可指洗衣店/洗衣房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clothes, sheets, towels, etc. that need to be washed, are being washed, or have just been washed.","zh":"需要洗、正在洗或刚洗好的衣物、床单、毛巾等（统称“要洗的衣物/洗好的衣物”）。"},"examples":[{"en":"I have a lot of laundry to do this weekend.","zh":"我这周末有很多衣服要洗。"},{"en":"Please put your dirty laundry in the basket.","zh":"请把脏衣服放进篮子里。"},{"en":"The laundry is still wet, so it can’t go in the closet yet.","zh":"衣服还没干，所以还不能放进衣橱。"}]},{"partOfSpeech":"n.","definition":{"en":"A place or business where clothes are washed and dried (often with machines).","zh":"洗衣店；洗衣房（用机器清洗、烘干衣物的地方或生意）。"},"examples":[{"en":"There’s a laundry on the corner that offers same-day service.","zh":"街角有一家洗衣店，提供当天取件服务。"},{"en":"I dropped my suit off at the laundry for cleaning.","zh":"我把西装送到洗衣店去洗了。"}]}],"synonyms":["washing","wash","laundromat (place)","cleaners (for a shop, often dry cleaners)"],"phonetic":"/ˈlɔn.dɹi/","extraExplanation":["你输入的 **lardry** 很可能是拼写错误，正确拼写通常是 **laundry**。","常见搭配：**do the laundry**（洗衣服，包含洗/晾/叠等）、**laundry basket/bag**（洗衣篮/洗衣袋）、**laundry room**（洗衣房）。在美式英语里，投币自助洗衣店常说 **laundromat**。","表达“家丑/丑闻”时会用固定说法 **dirty laundry**，如 **air your dirty laundry**（把家丑公开/把私事闹到外面）。"]}
{"word":"lards","summary":{"en":"“Lards” is usually the plural of “lard” (cooking fat) or the third-person singular of the verb “to lard” (to add fat or to stuff/mix in).","zh":"“lards”通常是“lard（猪油/动物油脂）”的复数，或动词“to lard（加油脂；夹杂/掺入）”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animal fat (especially pork fat) used in cooking, baking, or making soap","zh":"（尤指猪的）猪油；动物油脂（用于烹饪、烘焙或制皂等）"},"examples":[{"en":"My grandmother baked pie crust with lard to make it extra flaky.","zh":"我奶奶用猪油做派皮，让口感更酥松。"},{"en":"The recipe calls for a spoonful of lard.","zh":"这个食谱需要一勺猪油。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add fat or another ingredient to food; to mix something in","zh":"给（食物）加油脂或掺入某种配料；把……混入"},"examples":[{"en":"They lard the meat with strips of fat to keep it moist.","zh":"他们往肉里夹入脂肪条，以保持肉质湿润。"},{"en":"The article was larded with unnecessary details.","zh":"这篇文章夹杂了许多不必要的细节。"}]}],"synonyms":["fat","shortening","grease","stuff","add","mix in"],"phonetic":"/lɑrd/","extraExplanation":["“lards”通常是两种用法之一：①名词复数，表示“多种/多块猪油（动物油脂）”；②动词第三人称单数（he/she/it lards），表示“给食物加油脂/掺入”。在现代烹饪语境中，更常见的是名词“lard”。","比喻用法里，lard with 常带贬义，表示“夹杂/堆砌（多余内容）”。"]}
{"word":"lardworm","summary":{"en":"“Lardworm” is an archaic word for a maggot found in lard or fatty meat, and it can also be an old, offensive insult for an overweight person.","zh":"“lardworm”是一个较古老的词，指猪油或肥肉里的蛆；也可作旧式的侮辱语，用来骂胖人（冒犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A maggot (larva) found in lard, bacon, or other fatty meat.","zh":"（古义）生在猪油、培根或其他肥肉里的蛆（幼虫）。"},"examples":[{"en":"In old pantries, people sometimes found lardworms in stored fat.","zh":"在旧式食品储藏间里，人们有时会在存放的油脂中发现“lardworm”（蛆）。"},{"en":"The recipe warns you to throw away any lard if you see signs of lardworms.","zh":"这份食谱提醒：如果看到蛆的迹象，就要把猪油丢掉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Offensive, old-fashioned) A rude insult for an overweight person; a “fat slob.”","zh":"（冒犯、旧式用法）对胖人的粗鲁侮辱语，相当于“胖子/肥猪”等贬义说法。"},"examples":[{"en":"The bully called him a “lardworm,” which was cruel and unacceptable.","zh":"那个霸凌者叫他“lardworm”，既残忍又不可接受。"}]}],"synonyms":["maggot","larva","grub"],"phonetic":"/ˈlɑrdˌwɝm/","extraExplanation":["“lardworm”属于比较罕见、偏旧的词。字面意思是“猪油里的虫”，因此常见的本义与食物保存不当、油脂变质有关。","作为骂人的说法时，它把“油腻的脂肪”和“虫子”联系在一起，带有强烈羞辱意味；在现代英语里很不常用，但如果在旧小说、讽刺文字或历史语境里看到，应理解其侮辱性并避免使用。"]}
{"word":"lardy","summary":{"en":"Lardy describes something greasy or full of fat (especially lard).","zh":"Lardy 用来形容东西很油、脂肪多（尤其含猪油）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"containing a lot of fat (especially lard); greasy or fatty.","zh":"含很多脂肪（尤指猪油）的；油腻的；肥腻的。"},"examples":[{"en":"The stew tasted rich but a little lardy.","zh":"这道炖菜味道很浓郁，但有点油腻。"},{"en":"He wiped the lardy pan with a paper towel.","zh":"他用纸巾把那只沾满油脂的锅擦了擦。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) having a plump or fat look; chubby.","zh":"（较少见）看起来胖乎乎的；圆润的。"},"examples":[{"en":"The baby’s cheeks were lardy and soft.","zh":"宝宝的脸颊胖乎乎的，很柔软。"}]}],"synonyms":["greasy","fatty","oily","rich"],"phonetic":"/ˈlɑrdi/","extraExplanation":["“lardy”来自名词“lard”（猪油）。它更常见于英式英语或较口语/描写性的文字中，用来形容食物或器具“油脂很重”。","英国有一种点心叫“lardy cake”（猪油甜面包/猪油蛋糕），名称中的“lardy”就是“含猪油的”。"]}
{"word":"lare","summary":{"en":"“Lare” is a rare form referring to a Roman household guardian deity; English usually uses “Lares.”","zh":"“lare”较少见，指古罗马的家宅守护神；英语里更常用复数“Lares”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a household guardian spirit or deity in ancient Roman religion (more commonly seen in the plural form “Lares”)","zh":"（古罗马宗教中的）家宅守护神/守护灵（更常见的是复数形式“Lares”）"},"examples":[{"en":"In ancient Rome, many families honored the Lares at a small home shrine.","zh":"在古罗马，许多家庭会在家中的小神龛里供奉“家宅守护神（Lares）”。"},{"en":"The story mentions offerings made to the household gods, the Lares.","zh":"故事里提到人们向家宅守护神（Lares）献祭供品。"}]}],"synonyms":["household god","guardian spirit","tutelary deity"],"phonetic":"/lɛr/","extraExplanation":["“Lare”在英语里比较少见，更常用的形式是复数“Lares”。在古罗马家庭中，Lares常与家中的神龛（lararium）相关，人们会在日常或节日献上酒、食物等供品以祈求家宅平安。","如果你本来想查的是“lair”（野兽的巢穴/藏身处）或“rare”（稀有的），告诉我上下文句子，我可以帮你确认正确拼写与词义。"]}
{"word":"lareabell","summary":{"en":"“lareabell” is not a standard English word; it is most likely a proper name (Larabelle / Lara Bell).","zh":"“lareabell”不是常见英语单词；更可能是专有名词（人名 Larabelle / Lara Bell）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A likely proper name (given name or surname). It is not a standard English vocabulary word, so meaning depends on the person/place using it.","zh":"可能是专有名词（人名或姓氏）。它不是常见的英语词汇，因此含义取决于具体指代的人或地点。"},"examples":[{"en":"Larabelle Johnson will speak at the meeting tomorrow.","zh":"Larabelle Johnson 明天将在会议上发言。"},{"en":"I’m not sure how to spell Larabelle—could you confirm it?","zh":"我不确定 Larabelle 的拼写——你能确认一下吗？"}]}],"phonetic":"ˌlærəˈbɛl","extraExplanation":["“lareabell”在英语中不常见，比较像拼写变体或把两个词连在一起的写法（例如人名“Larabelle / Lara Bell”）。如果你是在文章、歌名、游戏ID、品牌或人名里看到的，发我原句/上下文，我可以帮你判断具体含义。","如果你想查的是某个常见单词，可能存在拼写错误；你也可以告诉我你想表达的中文意思（例如“可穿戴的”“可爱的”“拉贝尔”等），我来反推最可能的英文词。"]}
{"word":"laree","summary":{"en":"“laree” is an uncommon regional word (South Asia) meaning a bus or truck, often seen in “laree/larī adda” = bus stand.","zh":"“laree”是不太常见的南亚地区用词，指公交车或卡车，也常见于“laree/larī adda（汽车站）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, informal) a bus or truck; sometimes used in phrases meaning a bus stand/transport stop.","zh":"（南亚英语，非正式）公共汽车或卡车；也常出现在表示“汽车站/交通集散点”的短语里。"},"examples":[{"en":"We waited for the laree near the market.","zh":"我们在市场附近等那辆公交车/大巴。"},{"en":"He drove a laree to deliver goods between towns.","zh":"他开卡车在城镇之间运货。"},{"en":"Let’s meet at the laree adda (bus stand).","zh":"我们在汽车站（laree adda）见。"}]}],"synonyms":["bus","truck","lorry (BrE)"],"phonetic":"/ˈlɑːri/","extraExplanation":["“laree/larī”多见于巴基斯坦、印度等地的英语/乌尔都语语境中，常与“adda（集散点/站点）”搭配成“larī adda”，意思接近“汽车站、公交车站”。不同地区拼写可能有 lari / larree / laree 等变化。","它与标准英语里表示卡车的“lorry”在声音和用法上有关联：不少人认为这是从“lorry”在当地语言中的读音与拼写演变而来。"]}
{"word":"larees","summary":{"en":"Lares are the household guardian gods of ancient Rome (plural of “Lar”).","zh":"Lares 指古罗马的家神/守护神（Lar 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman religion) Household gods or guardian spirits believed to protect a home, family, or community; plural of “Lar.”","zh":"（罗马宗教）拉瑞斯神：被认为守护家庭、家族或社区的家神/守护神；“Lar”的复数。"},"examples":[{"en":"The Romans kept small statues of the Lares in a household shrine.","zh":"罗马人会在家中的小神龛里供奉拉瑞斯神的小雕像。"},{"en":"In the story, the family prays to the Lares for protection and good fortune.","zh":"故事里，这家人向拉瑞斯神祈求庇护与好运。"}]}],"synonyms":["household gods","guardian spirits","tutelary deities"],"phonetic":"/ˈlɛəriz/","extraExplanation":["你输入的“larees”更常见的拼写是 **Lares**（拉瑞斯神）。在古罗马家庭中，人们常在厨房或家中角落设置 **lararium（家神龛）**，供奉Lares（以及常与之一起出现的Penates等神祇），象征对家庭平安、祖先与日常生活的守护。","在英文中它多用于历史、神话、文学语境；现代英语里一般不会拿来指“普通的神”或“守护者”，除非是比喻或引用古罗马文化。"]}
{"word":"lares","summary":{"en":"Lares are the household guardian spirits in ancient Rome.","zh":"Lares 指古罗马的家宅守护神灵（家神）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Roman religion, the household guardian spirits (often thought of as protective gods) of a family and home; plural of “Lar.”","zh":"（古罗马宗教）家宅与家族的守护神灵（常被视为保护神）；“Lar”的复数。"},"examples":[{"en":"Romans often honored the Lares at a small домаш altar in the house.","zh":"古罗马人常在家中的小型家祭坛供奉拉瑞斯（家神）。"},{"en":"The phrase “Lares and Penates” refers to the spirits that protected the home and family.","zh":"“Lares and Penates（拉瑞斯与佩纳忒斯）”指守护家宅与家人的神灵。"}]}],"synonyms":["household gods","household guardian spirits","tutelary spirits"],"phonetic":"/ˈlɛəriz/","extraExplanation":["Lares（拉瑞斯）是罗马人日常生活里非常重要的家神观念，常与家中祭坛（lararium）联系在一起。人们会在重要日子献酒、食物或焚香，以求家庭平安与兴旺。","在文学与文化里，“Lares and Penates”常被用来象征“家园、故土、家庭的根”。"]}
{"word":"largamente","summary":{"en":"Largamente (Italian) means “widely/largely” and sometimes “at length, in a detailed or long way.”","zh":"largamente（意大利语）常表示“广泛地/在很大程度上”，有时也表示“长时间地、详尽地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Italian adverb) widely; largely; to a great extent.","zh":"（意大利语副词）广泛地；在很大程度上；大量地。"},"examples":[{"en":"This expression is used largamente in everyday Italian.","zh":"这个说法在日常意大利语中被广泛使用。"},{"en":"The policy was largamente accepted by the public.","zh":"这项政策在很大程度上被公众接受。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Italian adverb) at length; for a long time; in a long, detailed way.","zh":"（意大利语副词）长时间地；详尽地；长篇地。"},"examples":[{"en":"He spoke largamente about his travels.","zh":"他详尽地谈了自己的旅行经历。"},{"en":"They discussed the problem largamente before deciding.","zh":"他们在做决定前长时间地讨论了这个问题。"}]}],"synonyms":["widely","largely","amply","at length","in detail"],"phonetic":"ˌlɑrɡəˈmɛnteɪ","extraExplanation":["“Largamente”主要见于意大利语（也可能在葡萄牙语/西班牙语语境里被理解为“宽广地/大量地”的近义表达），常对应英语的 widely / largely / amply，或在语境中表示“详细地、长篇地”。","词根与英语“large（大的）”同源，核心意象是“范围大、程度大”，因此既能表示“广泛地/很大程度上”，也能引申为“充分地、详尽地”。"]}
{"word":"largando","summary":{"en":"“Largando” is Spanish/Portuguese for “letting go/leaving,” and in some regional Spanish it can mean “suddenly starting (to cry/laugh).”","zh":"“largando”是西班牙语/葡萄牙语，常表示“正在放开/离开”；在部分地区西语中也可表示“突然开始（哭/笑等）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Spanish/Portuguese) the -ing form of “largar”: letting go, dropping, releasing, or leaving (depending on context).","zh":"（西班牙语/葡萄牙语）动词“largar”的进行式：正在放开/丢下/释放/离开（具体含义取决于语境）。"},"examples":[{"en":"He walked away, largando the rope little by little.","zh":"他一边走开，一边慢慢把绳子放开。"},{"en":"In the video, she’s largando everything and moving to another city.","zh":"视频里她正在把一切都放下，然后搬去另一座城市。"}]},{"partOfSpeech":"other","definition":{"en":"(Regional Spanish, especially Argentina/Uruguay) starting suddenly to do something (e.g., to cry, to laugh): “largar a + infinitive.”","zh":"（西语地区用法，尤指阿根廷/乌拉圭）突然开始做某事（如哭、笑）：“largar a + 不定式”。"},"examples":[{"en":"He largó a llorar—everyone got quiet.","zh":"他突然哭了起来——大家都安静了。"},{"en":"They largaron a reír when they heard the joke.","zh":"他们一听到那个笑话就突然笑了起来。"}]}],"synonyms":["letting go","dropping","releasing","leaving","walking away","starting (suddenly)"],"phonetic":"/larˈɡɑndoʊ/","extraExplanation":["“largando”本身不是英语常用词，通常出现在西班牙语或葡萄牙语语境（歌词、对话、社交媒体）里。想准确翻译时，关键是看它后面有没有宾语（放开什么/丢下什么/离开哪里）或固定结构“largar a + 动词不定式”（突然开始做某事）。","西班牙语里“largar”在不同国家语感不同：有的地方更偏“放开/丢下/离开”，在拉普拉塔河流域（阿根廷、乌拉圭）也常用作“突然开始（哭/笑/说）”。"]}
{"word":"Large","summary":{"en":"Large means big in size, number, or scale; it can also describe big organizations or (informally) living generously.","zh":"Large表示“大”的尺寸、数量或规模；也可形容大型组织；口语中还可指生活阔绰、大方。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"big in size, amount, or degree","zh":"大的；规模大、数量多或程度高的"},"examples":[{"en":"They live in a large house near the park.","zh":"他们住在公园附近的一栋大房子里。"},{"en":"A large number of people attended the concert.","zh":"很多人参加了这场音乐会。"},{"en":"This is a large improvement compared with last year.","zh":"与去年相比，这是一个很大的改进。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a business, group, or system) having many members, workers, or a wide range of activities","zh":"（公司、组织或体系）规模大的；人员多、业务广的"},"examples":[{"en":"She works for a large international company.","zh":"她在一家大型跨国公司工作。"},{"en":"Large schools often offer more clubs and classes.","zh":"大型学校通常提供更多社团和课程。"}]},{"partOfSpeech":"adv.","definition":{"en":"(informal) in a way that is free, generous, or on a big scale","zh":"（非正式）大方地；阔绰地；大规模地"},"examples":[{"en":"After he got the job, he started living large.","zh":"他找到工作后就开始过起了阔绰的生活。"},{"en":"They don’t just think small—they think large.","zh":"他们不只是小打小闹，而是着眼大局。"}]}],"synonyms":["big","great","huge","enormous","substantial"],"phonetic":"/lɑrdʒ/","extraExplanation":["“large”常和“big”相近，但语感上：large更偏“客观尺寸/数量/规模”（a large amount / a large population）；big更常用于口语，也更常带情绪色彩（a big problem / big news）。","常见搭配：large amount/number/scale；at large（在逃；总体上）；by and large（总的来说）。注意：写“a large number of + 复数名词”，但“a large amount of + 不可数名词”。"]}
{"word":"large","summary":{"en":"Large most often means “big” in size or quantity, and it can also mean “major/important,” a clothing size (L), or appear in phrases like “at large.”","zh":"Large 常指“体积大/数量多”，也可指“重大”，还可作名词表示“大号（L）”，并常见于短语 at large 等固定用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"big in size, amount, or degree; not small.","zh":"大的；数量多的；程度高的；不小的。"},"examples":[{"en":"They live in a large house near the park.","zh":"他们住在公园附近的一栋大房子里。"},{"en":"A large number of students joined the club.","zh":"有很多学生加入了这个社团。"},{"en":"She has a large amount of experience in teaching.","zh":"她有大量的教学经验。"}]},{"partOfSpeech":"adj.","definition":{"en":"important or serious in scale; major.","zh":"重大的；严重的；主要的。"},"examples":[{"en":"This decision could have large effects on the whole community.","zh":"这个决定可能对整个社区产生重大影响。"},{"en":"They made a large investment in new technology.","zh":"他们在新技术上做了巨额投资。"}]},{"partOfSpeech":"n.","definition":{"en":"a size category for clothing or products (often written as “Large” or “L”).","zh":"（衣服或商品的）大号（常写作 Large 或 L）。"},"examples":[{"en":"Do you have this shirt in a large?","zh":"这件衬衫有大号吗？"},{"en":"I’ll take a Large coffee, please.","zh":"请给我一杯大杯咖啡。"}]},{"partOfSpeech":"adv.","definition":{"en":"in general; as a whole (used in fixed phrases).","zh":"总体上；一般来说（多用于固定搭配）。"},"examples":[{"en":"At large, the public supported the new policy.","zh":"总体而言，公众支持这项新政策。"},{"en":"The reasons remain unknown at large.","zh":"总体来说，原因仍不清楚。"}]}],"synonyms":["big","huge","large-scale","major","sizable"],"phonetic":"/lɑrdʒ/","extraExplanation":["常见搭配：a large number of（许多，大量的，后接可数名词复数）；a large amount of（大量的，后接不可数名词）。","固定表达 at large 有两种常见意思：①“总体上/普遍地”（the public at large 公众整体）；②“在逃的/未被捕的”（The suspect is still at large 嫌疑人仍在逃）。语境不同含义不同。"]}
{"word":"largebrained","summary":{"en":"Largebrained is informal slang meaning “very smart or clever,” especially online; it can also literally mean “having a large brain.”","zh":"Largebrained 是非正式网络俚语，常指“很聪明/很机智”；也可作字面义“脑很大”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, internet slang) Very smart, insightful, or clever; showing strong intelligence or strategic thinking.","zh":"（非正式/网络俚语）很聪明、有洞察力的；很有策略、脑子很灵光的。"},"examples":[{"en":"That’s a largebrained idea—why didn’t we think of it earlier?","zh":"这个点子太largebrained了——我们怎么没早点想到？"},{"en":"She made a largebrained move and solved the problem in minutes.","zh":"她做了一个很“largebrained”的操作，几分钟就把问题解决了。"},{"en":"Stop calling him lucky—his plan was genuinely largebrained.","zh":"别再说他只是运气好——他的计划是真的很“largebrained”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literal, less common) Having a large brain (in size).","zh":"（字面义/较少见）脑部体积较大；大脑很大。"},"examples":[{"en":"Some mammals are largebrained relative to their body size.","zh":"有些哺乳动物相对于体型来说属于“大脑较大”的类型。"}]}],"synonyms":["big-brained","brainy","clever","smart","insightful","sharp","strategic"],"phonetic":"/ˌlɑrdʒˈbreɪnd/","extraExplanation":["“largebrained”更常见于网络语境，语气往往带一点调侃或夸赞，类似“big-brained / big brain”。常用来形容某个想法、操作、推理特别机智。","它常和“small-brained”（讽刺“没脑子/不聪明”）形成对比，但在正式写作中不推荐使用；更自然的正式表达是“intelligent / clever / insightful / strategic”。","拼写上也常见带连字符的“large-brained”，或更常用的“big-brained”。"]}
{"word":"largehanded","summary":{"en":"Largehanded (large-handed) usually means “having large hands,” and more rarely (in literary style) means “generous, open-handed.”","zh":"largehanded（亦作 large-handed）通常指“手很大”；较少见的文学用法指“慷慨、出手大方”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having large hands; strong-looking or broad-handed (often describing physical appearance).","zh":"手很大；手掌宽厚、有力（常用于形容外貌特征）。"},"examples":[{"en":"He was a large-handed man who looked like he had done farm work all his life.","zh":"他手很大，看起来一辈子都在干农活。"},{"en":"The large-handed pianist could easily reach wide chords.","zh":"那位手很大的钢琴家可以轻松按到跨度很大的和弦。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, literary) Generous; giving freely; open-handed.","zh":"（较少见，文学用法）慷慨的；出手大方的；“手松”的。"},"examples":[{"en":"She was large-handed with tips and always thanked the staff by name.","zh":"她给小费很大方，而且总会叫出员工的名字表示感谢。"},{"en":"In the story, the landlord seems harsh, but his wife is large-handed to the poor.","zh":"故事里房东看起来刻薄，但他的妻子对穷人很慷慨。"}]}],"synonyms":["big-handed","broad-handed","strong-handed","open-handed","generous"],"phonetic":"/ˌlɑrdʒ ˈhændɪd/","extraExplanation":["这个词有时也写作 large-handed（带连字符）。现代英语里更常用来形容“手很大”的字面意思；表示“慷慨”时更常见的说法是 open-handed / generous / big-hearted。","表示“慷慨”这一层含义时，large-handed 带一点文学/旧式色彩，读到时可理解为“出手阔绰、给得多”。"]}
{"word":"largehearted","summary":{"en":"Largehearted means generous, warm, and forgiving—having a big heart.","zh":"largehearted 指“心胸宽广、慷慨仁厚、待人宽厚”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Kind, generous, and sympathetic; showing a warm willingness to forgive or help others.","zh":"心胸宽广的；慷慨仁厚的；富有同情心的（愿意原谅或帮助他人）。"},"examples":[{"en":"She was largehearted enough to forgive the mistake and move on.","zh":"她心胸宽广，愿意原谅这个错误并继续向前。"},{"en":"A largehearted neighbor brought food to the family after the storm.","zh":"暴风雨过后，一位慷慨的邻居给那家人送来了食物。"},{"en":"He spoke in a largehearted way, trying to understand both sides.","zh":"他说话很宽厚，努力理解双方的立场。"}]}],"synonyms":["big-hearted","generous","kind-hearted","warmhearted","magnanimous"],"phonetic":"/ˌlɑrdʒˈhɑrtɪd/","extraExplanation":["“largehearted”由“large（大）+ hearted（有……心的）”构成，强调“心量大、气度大”，常见于较文雅或带文学色彩的表达。更口语、现代的说法常用“generous”“big-hearted”“kind-hearted”。"]}
{"word":"largeheartedly","summary":{"en":"Largeheartedly means “in a generous and forgiving way.”","zh":"largeheartedly 意为“慷慨、宽容地；心胸宽广地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a generous, kind, and forgiving way; with a big heart.","zh":"以慷慨、善良、宽容的方式；心胸宽广地。"},"examples":[{"en":"She largeheartedly forgave his mistake and offered to help him improve.","zh":"她宽宏大量地原谅了他的错误，还主动帮他改进。"},{"en":"The community largeheartedly welcomed the newcomers.","zh":"社区以热情宽厚的态度欢迎新来的人们。"}]}],"synonyms":["generously","kindly","magnanimously","big-heartedly","with an open heart"],"phonetic":"/ˌlɑrdʒˈhɑrdɪdli/","extraExplanation":["“largeheartedly”比较少见，更常用的说法是“generously”（慷慨地）、“kindly”（善意地）、“magnanimously”（宽宏大量地）或“with a big heart”。","它来自形容词“large-hearted”（心胸宽广的、慷慨的）：large（大）+ heart（心）+ -ed（形容词后缀），再加 -ly 变成副词。写作中可用来强调一种带着温暖与宽容的“高尚慷慨”。"]}
{"word":"largeheartedness","summary":{"en":"Largeheartedness means generosity and a forgiving, big-hearted attitude toward others.","zh":"largeheartedness 指慷慨宽厚、心胸开阔、乐于体谅与原谅他人的品质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being generous, kind, and forgiving; a big-hearted spirit toward others","zh":"宽宏大量；慷慨仁厚；心胸宽广（对他人友善、愿意原谅）"},"examples":[{"en":"Her largeheartedness made new employees feel welcome on their first day.","zh":"她的宽厚让新员工第一天就感到被欢迎。"},{"en":"He responded to criticism with largeheartedness instead of anger.","zh":"他面对批评选择了宽容，而不是愤怒。"}]}],"synonyms":["generosity","kindness","big-heartedness","magnanimity","openheartedness"],"phonetic":"/ˌlɑrdʒˈhɑrdɪdnəs/","extraExplanation":["这个词由 large-hearted（“心胸宽大/大度的”）+ -ness（名词后缀，表示“……的品质/状态”）构成，语气较正式、带一点文学感；日常更常用 generosity、kindness、big-heartedness、magnanimity。","语义重点通常不是“钱多给”，而是“胸怀大、愿意体谅、愿意原谅”。在写人物性格或道德品质时很合适。"]}
{"word":"largely","summary":{"en":"“Largely” means “mostly” or “to a great extent,” often used in formal or neutral statements.","zh":"“largely”表示“主要地/大部分”或“在很大程度上”，常用于较正式、客观的表述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Mostly; to a great extent (used to say something is true in general, though not always completely).","zh":"大部分；在很大程度上（表示总体上成立，但不一定完全如此）。"},"examples":[{"en":"The project was largely successful, despite a few delays.","zh":"这个项目总体上很成功，尽管有一些延期。"},{"en":"His decision was largely influenced by his family.","zh":"他的决定在很大程度上受到家人的影响。"},{"en":"The audience was largely made up of students.","zh":"观众主要由学生组成。"}]}],"synonyms":["mostly","mainly","generally","for the most part","to a large extent"],"phonetic":"/ˈlɑrdʒli/","extraExplanation":["“largely”常用于较正式的书面或新闻表达，语气比“mostly”更客观、克制一些，常搭配：largely successful / largely due to / largely because of / largely unchanged。","常见易混：\n- largely = 在很大程度上/主要地（强调“总体比例或影响程度”）\n- mainly = 主要地（更强调“主要原因/重点”）\n- mostly = 大多（更口语、更直接）"]}
{"word":"largemouth","summary":{"en":"“Largemouth” means “having a large mouth,” and it’s most commonly used to refer to the largemouth bass (a popular sport fish).","zh":"“Largemouth”表示“大嘴的”，最常见的是指“大口黑鲈（大嘴鲈）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a large mouth; often used in names of animals (especially fish).","zh":"大嘴的；（常用于动物名称，尤其是鱼类）大口的。"},"examples":[{"en":"The largemouth bass is a popular sport fish in the U.S.","zh":"大口黑鲈（大嘴鲈）在美国是一种很受欢迎的运动钓鱼。"},{"en":"A largemouth fish can swallow bigger prey.","zh":"大嘴的鱼能吞下更大的猎物。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: a largemouth bass.","zh":"（非正式）大口黑鲈；大嘴鲈。"},"examples":[{"en":"He caught a largemouth near the reeds.","zh":"他在芦苇附近钓到了一条大口黑鲈。"},{"en":"This lake is full of largemouths in spring.","zh":"这个湖在春天有很多大口黑鲈。"}]}],"synonyms":["large-mouthed","big-mouthed","largemouth bass"],"phonetic":"/ˈlɑrdʒˌmaʊθ/","extraExplanation":["“Largemouth”在美式英语里最常见的搭配是“largemouth bass”（大口黑鲈，学名 Micropterus salmoides）。在北美的钓鱼文化中非常常见，所以很多人会直接把“largemouth”当作“largemouth bass”的简称来用。","写作时如果是泛指“嘴很大”，通常会用更通用的表达如“large-mouthed (fish/animal)”，而“largemouth”更像是偏固定搭配（尤其指这种鲈鱼）。"]}
{"word":"largemouthed","summary":{"en":"Largemouthed means someone is loud, talkative, or boastful (often negative). It can also mean “having a large mouth,” especially in biology/fishing (often written large-mouthed).","zh":"largemouthed指人时多为贬义：嘴大、话多、爱吹牛；也可指“嘴巴很大”，常用于生物/钓鱼语境（多写作large-mouthed）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) tending to talk too much, speak rudely, or boast in a way that annoys others; loud and outspoken","zh":"（形容人）嘴大、话多（常带贬义）；爱吹牛或说话粗鲁、张扬"},"examples":[{"en":"He was loud and largemouthed at the meeting, interrupting everyone.","zh":"他在会议上声音很大又嘴很大，不停打断别人。"},{"en":"She sounded largemouthed, but she was actually nervous.","zh":"她听起来很嘴大，但其实是紧张。"},{"en":"Try not to be largemouthed online—people remember what you post.","zh":"网上尽量别嘴太大——别人会记得你发过什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a large mouth opening (often used in biology or fishing, usually written with a hyphen)","zh":"（常用于生物/钓鱼语境，通常加连字符）大嘴的；口裂较大的"},"examples":[{"en":"A large-mouthed bass is a popular freshwater fish.","zh":"大口黑鲈是一种很受欢迎的淡水鱼。"},{"en":"The large-mouthed frog can swallow surprisingly big prey.","zh":"这种大嘴蛙能吞下出人意料的大猎物。"}]}],"synonyms":["loudmouthed","boastful","brash","mouthy","talkative"],"phonetic":"/ˌlɑrdʒ ˈmaʊðd/","extraExplanation":["“largemouthed”更常见的拼写是“large-mouthed”（带连字符）。形容人时多带负面评价，意思接近“嘴碎/嘴大/爱吹牛”。在自然科学或钓鱼语境中，“large-mouthed”通常是中性描述，指“嘴巴（口裂）很大”。"]}
{"word":"largen","summary":{"en":"“Largen” is a rare/old-fashioned verb meaning “to enlarge” or “to become larger.”","zh":"“largen”是一个少见/较古旧的动词，意思是“扩大；使变大”或“变大”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To make something larger; to enlarge.","zh":"（少见/古用）使……变大；扩大。"},"examples":[{"en":"They plan to largen the kitchen to create more space.","zh":"他们计划扩大厨房来腾出更多空间。"},{"en":"The company is trying to largen its customer base.","zh":"这家公司正努力扩大客户群。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare/archaic) To become larger; to grow in size or importance.","zh":"（少见/古用）变大；扩大；增长（体积或重要性）。"},"examples":[{"en":"As the city grew, the suburbs began to largen.","zh":"随着城市发展，郊区开始扩张。"},{"en":"His influence seemed to largen year by year.","zh":"他的影响力似乎逐年增长。"}]}],"synonyms":["enlarge","expand","increase","widen","broaden"],"phonetic":"/ˈlɑrdʒən/","extraExplanation":["“largen”在现代英语中非常少见，多数情况下人们会用更常用的“enlarge”或“make … larger”。你在文学作品、较老的文本或模仿古风的写作中更可能见到它。","词根与“large（大的）”相关，加上动词化后缀“-en”（如 widen, broaden），表达“变得/使变得更……”。"]}
{"word":"largeness","summary":{"en":"Largeness usually means great size or scale; less commonly it can mean generosity or broad-mindedness.","zh":"largeness通常指“巨大、规模大”；较少见时可指“慷慨或宽宏大量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being large in size, amount, or degree; great size.","zh":"（尺寸、数量或程度上的）大；巨大；庞大。"},"examples":[{"en":"The largeness of the room makes it feel bright and open.","zh":"房间的宽敞让它感觉明亮又通透。"},{"en":"We were surprised by the largeness of the crowd.","zh":"我们对人群的规模之大感到惊讶。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Generosity; willingness to give or forgive; largeness of heart.","zh":"（较少见）慷慨；宽宏大量；心胸宽广。"},"examples":[{"en":"She is known for her largeness of spirit when others make mistakes.","zh":"别人犯错时，她以宽宏大量而闻名。"},{"en":"His charity showed the largeness of his heart.","zh":"他的慈善行为体现了他心胸宽广。"}]}],"synonyms":["size","bigness","magnitude","vastness","greatness","generosity","openhandedness"],"phonetic":"/ˈlɑrdʒnəs/","extraExplanation":["“largeness”最常见是中性、客观的“大小/规模”，常用于书面语或正式表达（the largeness of + 名词）。日常口语里，人们更常直接用“big/large”或说“the size of …”。","表示“宽宏大量/慷慨”时，多见于较正式或文学语境，常与“of heart / of spirit / of mind”搭配，如“largeness of heart（宽广的心胸）”。"]}
{"word":"largenesses","summary":{"en":"“Largenesses” is a rare plural noun meaning multiple instances or types of “largeness” (great size/extent).","zh":"“Largenesses”是较少见的复数名词，表示“巨大/规模大”的多个实例或类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of “largeness”; more than one instance or kind of large size, amount, or extent","zh":"“largeness”的复数形式；指不止一种/不止一次的“巨大、规模大、数量多或范围广”"},"examples":[{"en":"The report compares the largenesses of the two budgets.","zh":"这份报告比较了两份预算的规模大小。"},{"en":"Different cities have different largenesses in population and area.","zh":"不同城市在人口和面积上有不同的规模大小。"}]}],"synonyms":["sizes","scales","magnitudes","dimensions","extents"],"phonetic":"/ˈlɑrdʒnəsɪz/","extraExplanation":["“largenesses”在真实英语里很少用，因为“largeness”通常是不可数名词（more largeness / a sense of largeness）。只有在需要强调“不同种类的巨大”或“多个方面的规模”时，才可能用复数来表达对比或分类。很多场合更自然的替代说法是：sizes, scale(s), magnitude(s), dimensions。"]}
{"word":"largeour","summary":{"en":"“largeour” is not standard English; it’s likely a misspelling (often of “languor”) or confusion with French “largeur.”","zh":"“largeour”不是标准英语；很可能是拼写错误（常见是把“languor”写错）或与法语“largeur”混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“largeour” is not a standard English word. It most often appears as a misspelling or a mistaken form in writing.","zh":"“largeour”不是标准英语单词；多半是拼写错误或误写出来的形式。"},"examples":[{"en":"I couldn’t find “largeour” in an English dictionary—did you mean “languor” or “large”?","zh":"我在英语词典里找不到“largeour”——你想写的是“languor”还是“large”呢？"},{"en":"Please check the spelling: “largeour” may be a typo.","zh":"请检查拼写：“largeour”可能只是打错了。"}]},{"partOfSpeech":"n.","definition":{"en":"Possible intended word: “languor” (a common real English word) — a relaxed, sleepy, or weak feeling; a lack of energy.","zh":"可能你想写的是：languor（真实且常见的英文词）——慵懒、倦怠、无力的感觉；缺乏精力。"},"examples":[{"en":"After lunch, I often feel a mild languor.","zh":"午饭后，我经常会感到一点点倦怠。"},{"en":"The summer heat filled the room with languor.","zh":"夏日的炎热让房间里弥漫着慵懒的气息。"}]}],"synonyms":["laziness","lethargy","weariness","torpor","listlessness"],"phonetic":"/ˈlæŋɡər/","extraExplanation":["“largeour”有时也会被误当成法语“largeur”（意思是“宽度”）。但“largeur”不是英语单词，在英文语境里一般用 width 或 breadth。","如果你能把“largeour”出现的原句发我，我可以更准确判断你想表达的是“倦怠(languor)”还是“宽度(width)”，或只是想写“large/large-scale”等。"]}
{"word":"largeous","summary":{"en":"Largeous is a rare, old-fashioned adjective meaning “generous” or “giving freely.”","zh":"largeous 是一个罕见的古语形容词，意思是“慷慨的/大方施予的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Generous; giving freely; bountiful.","zh":"（罕见/古语）慷慨的；出手大方的；丰厚的。"},"examples":[{"en":"The old ballads praise a largeous lord who feeds the poor in winter.","zh":"古老的民谣称赞一位“largeous”的领主，会在冬天赈济穷人。"},{"en":"She thanked him for his largeous help during a hard time.","zh":"在艰难时期，她感谢他慷慨相助。"}]}],"synonyms":["generous","bountiful","liberal (in giving)","openhanded"],"phonetic":"/ˈlɑrdʒəs/","extraExplanation":["“largeous”在现代英语里几乎不用，更多见于中古英语/早期现代英语文本中，意思接近 generous、bountiful。","现代写作中更自然的替代词：generous（慷慨的）、bountiful（丰盛的/大量给予的）。名词常用 largesse（慷慨施予；赏赐）。","如果你原本想拼的是“largesse”（常见词），告诉我我可以按 largesse 再做一条更实用的词条。"]}
{"word":"larger","summary":{"en":"“Larger” means “bigger,” the comparative form of “large,” used to compare size, amount, or degree.","zh":"“larger”意为“更大的”，是“large”的比较级，用于比较尺寸、数量或程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bigger in size, amount, number, or degree.","zh":"更大（尺寸、数量、程度等）的。"},"examples":[{"en":"This shirt is too small—do you have a larger one?","zh":"这件衬衫太小了——你们有更大一号的吗？"},{"en":"Our company needs a larger budget next year.","zh":"我们公司明年需要更大的预算。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Comparative form of “large”) used to compare two things; bigger than the other one.","zh":"（large 的比较级）用于比较两个事物；比另一个更大。"},"examples":[{"en":"My room is larger than yours.","zh":"我的房间比你的大。"},{"en":"Which is larger, 8 or 10?","zh":"8 和 10 哪个更大？"}]}],"synonyms":["bigger","greater","more substantial","more sizable"],"phonetic":"/ˈlɑrdʒər/","extraExplanation":["“larger”是形容词“large”的比较级，常见结构：A is larger than B（A比B更大）。也常用于购物场景：a larger size（更大尺码）。","注意搭配：large/larger通常指“体积、规模、数量”更大；如果强调“更大年龄”，更常说older而不是larger。"]}
{"word":"larges","summary":{"en":"Large means “big.” It can also be a noun for a bigger-than-medium size, and it appears in set phrases like “at large.”","zh":"large 表示“大的”。也可作名词表示“大号/大份”，并常见于固定搭配 at large（如“在逃/普遍地”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"big in size, amount, or degree","zh":"大的；数量多的；程度高的"},"examples":[{"en":"They live in a large house.","zh":"他们住在一栋大房子里。"},{"en":"A large number of people came to the event.","zh":"有很多人来参加这个活动。"}]},{"partOfSpeech":"n.","definition":{"en":"a size bigger than medium (often used in clothing or food)","zh":"（常指衣服或食物的）大号；大份"},"examples":[{"en":"I’ll take a large coffee, please.","zh":"请给我一杯大杯咖啡。"},{"en":"Do you have this shirt in a large?","zh":"这件衬衫有大号吗？"}]},{"partOfSpeech":"adv.","definition":{"en":"in a free or general way; not limited (used mainly in set phrases like “at large”)","zh":"自由地；广泛地；不受限制地（多用于固定搭配，如 at large）"},"examples":[{"en":"The suspect is still at large.","zh":"嫌疑人仍然在逃。"},{"en":"She is well known at large in the industry.","zh":"她在业内广为人知。"}]}],"synonyms":["big","huge","great","sizable","substantial"],"phonetic":"/lɑrdʒ/","extraExplanation":["“larges”通常不是常用的独立词条：它最常见是名词 large 的复数（例如在点餐/尺码语境里说 two larges，表示“两份大号/两个大杯”）。","固定搭配 at large 有两个常见意思：①“在逃”（警方语境）；②“整体上、普遍地”（如 the public at large“广大公众”）。"]}
{"word":"largess","summary":{"en":"Largess means generous giving (money, gifts, help), often in a formal or literary tone.","zh":"largess 指“慷慨的施予/馈赠”（钱、礼物或帮助），语气较正式或带文学色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Generous giving of money, gifts, or help, especially to other people.","zh":"慷慨的施予；大量的馈赠或帮助（尤指给他人的钱、礼物或支持）。"},"examples":[{"en":"The scholarship was a result of the donor’s largess.","zh":"这项奖学金来自捐赠者的慷慨资助。"},{"en":"The community benefited from her largess after the storm.","zh":"暴风雨过后，社区受益于她的慷慨援助。"},{"en":"He was known for his largess toward young artists.","zh":"他以对年轻艺术家的慷慨资助而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A large amount or abundance of something (less common in modern everyday use).","zh":"大量；丰裕（现代日常用法较少）。"},"examples":[{"en":"They enjoyed the largess of the harvest that year.","zh":"那一年他们享受到了丰收的富足。"},{"en":"The garden offered a largess of colors in spring.","zh":"春天花园呈现出缤纷繁盛的色彩。"}]}],"synonyms":["generosity","charity","munificence","benevolence","liberality"],"phonetic":"/lɑrˈdʒɛs/","extraExplanation":["“largess”常带一点书面/正式语气，常用于描述富人、机构、赞助人或权势者对他人的慷慨施予（如慈善、奖学金、资助）。在一些语境里也可能暗含“施予者处于更高地位”的感觉。","词源上与“large（大的、宽广的）”同源，最初有“慷慨、自由给予”的含义，因此常用来强调“给得多、给得大方”。","常见搭配：someone’s largess（某人的慷慨馈赠）；the largess of + 名词（某物的丰裕/大量，较文艺/修辞）。近义表达可用 generosity, charity, munificence（更正式）。"]}
{"word":"largesse","summary":{"en":"Largesse means generosity—especially giving money or gifts—or a generous gift/donation itself.","zh":"largesse 指（尤指金钱或礼物方面的）慷慨施予，也可指慷慨的礼物或捐赠本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Generosity in giving money, gifts, help, or kindness (often in a public or formal way).","zh":"慷慨施予；大方赠与（常带有公开或正式的意味）。"},"examples":[{"en":"The foundation is known for its largesse to local schools.","zh":"这家基金会以对当地学校的慷慨资助而闻名。"},{"en":"At the festival, the host showed largesse by providing free meals for everyone.","zh":"在节日里，主办方以免费为所有人提供餐食来展现慷慨。"}]},{"partOfSpeech":"n.","definition":{"en":"A generous gift or donation; something given freely.","zh":"慷慨的礼物或捐赠；施舍之物。"},"examples":[{"en":"The museum received a largesse from a private collector.","zh":"博物馆收到了一位私人收藏家的慷慨捐赠。"},{"en":"Employees benefited from the CEO’s largesse at the end of the year.","zh":"员工在年末受益于CEO的慷慨馈赠。"}]}],"synonyms":["generosity","munificence","benevolence","charity","bounty","philanthropy"],"phonetic":"/lɑrˈdʒɛs/","extraExplanation":["“largesse”带有一点“上位者/有资源的人给予下位者”的传统色彩：例如国王、贵族或富人向民众发钱发物。现代也常用于公司、基金会、富豪对社会或机构的捐助。","语气上比一般的“generosity”更偏“给出大量资源/金钱”的慷慨，有时也会暗示这种施予会带来影响力或声望（并不一定是贬义，但可用于较批判的语境）。","常见搭配：political/corporate largesse（政治/企业的“资源倾斜、恩惠”）、show/display largesse（展现慷慨）、benefit from someone’s largesse（受某人的慷慨之惠）。"]}
{"word":"largesses","summary":{"en":"“Largesses” means generous gifts or acts of giving, especially money or benefits given by someone wealthy or powerful.","zh":"“Largesses”指慷慨的赠与/赏赐，尤指富有或有权势者给出的金钱或好处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"generous gifts of money or valuable things given to others (often by a wealthy or powerful person); the plural of “largesse.”","zh":"（通常指富有或有权势的人给别人的）慷慨赠与、厚赐；为“largesse”的复数。"},"examples":[{"en":"The actor was known for his largesses to local charities.","zh":"这位演员以对当地慈善机构的慷慨捐赠而闻名。"},{"en":"During the festival, the king distributed largesses to the crowd.","zh":"节日期间，国王向人群发放赏赐。"}]},{"partOfSpeech":"n.","definition":{"en":"generosity; a habit or spirit of giving freely (more formal/literary).","zh":"慷慨大方；乐于施予的品格（较正式/文学用法）。"},"examples":[{"en":"She thanked him for his largesses of time and patience.","zh":"她感谢他在时间和耐心上的慷慨付出。"}]}],"synonyms":["generosity","gifts","donations","handouts","benefactions"],"phonetic":"/lɑrˈdʒɛs/","extraExplanation":["“Largesse”源自法语，常见于较正式或带历史/文学色彩的语境，尤其用来描述“上位者的施舍、赏赐”或“富人的捐赠”。在现代新闻或评论中也会用来暗示某种“权力—利益”的关系（语气可能带一点批评或讽刺）。"]}
{"word":"largest","summary":{"en":"“Largest” means the biggest or greatest (the superlative of “large”).","zh":"“largest”表示“最大的、最多的、程度最高的”，是“large”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The biggest in size, amount, number, or degree (superlative form of “large”).","zh":"最大的；最多的；程度最高的（“large”的最高级）"},"examples":[{"en":"This is the largest room in the house.","zh":"这是房子里最大的房间。"},{"en":"China has one of the largest populations in the world.","zh":"中国拥有世界上最多的人口之一。"},{"en":"Our largest expense is rent.","zh":"我们最大的一笔开销是房租。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the biggest way; on the largest scale (often used after a verb like “loom” or in set phrases).","zh":"以最大规模；最显著地（常用于固定搭配或某些动词之后）"},"examples":[{"en":"Safety concerns loom largest in the report.","zh":"报告中最突出的就是安全方面的担忧。"},{"en":"In his memory, that day stands largest of all.","zh":"在他的记忆里，那一天最为突出。"}]},{"partOfSpeech":"n.","definition":{"en":"The biggest or most important thing, person, or group (more common in the phrase “at large,” but “the largest” can be used as a noun phrase).","zh":"最大的事物/群体；最重要者（多见于名词短语用法）"},"examples":[{"en":"The largest of the three companies expanded overseas.","zh":"三家公司中最大的一家拓展到了海外。"}]}],"synonyms":["biggest","greatest","maximum","most"],"phonetic":"/ˈlɑrdʒəst/","extraExplanation":["“largest”是形容词“large”的最高级：large → larger → largest。常见结构：the largest + 名词（the largest city）。","注意发音：largest 里的 -st 结尾要清楚；另外“large”中的 /dʒ/ 类似中文“zh/j”的浊音感觉。","常见相关表达：by and large（总体上，大体上）；at large（在逃；自由的；整体而言）；loom large/loom largest（显得很重要/最突出）。"]}
{"word":"larget","summary":{"en":"“Larget” is not a standard English word; it’s usually a misspelling of “target” or “largest.”","zh":"“larget”不是标准英语词，通常是把“target（目标）”或“largest（最大的）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling of “target” or “largest,” depending on the sentence.","zh":"不是标准英语单词。最常见是把 “target（目标）” 或 “largest（最大的）” 拼错了，具体取决于上下文。"},"examples":[{"en":"Did you mean “target” (a goal) or “largest” (biggest)?","zh":"你想写的是 “target（目标）” 还是 “largest（最大的）”？"},{"en":"Correct: Our target is to finish by Friday.","zh":"正确：我们的目标是周五前完成。"},{"en":"Correct: This is the largest room in the house.","zh":"正确：这是房子里最大的房间。"}]},{"partOfSpeech":"n.","definition":{"en":"target: a goal, aim, or the object you are trying to hit or reach.","zh":"target：目标；要达到的目的；（射击等）要击中的对象。"},"examples":[{"en":"My target is to save $200 a month.","zh":"我的目标是每个月存200美元。"},{"en":"The company missed its sales target.","zh":"公司没有完成销售目标。"},{"en":"The arrow hit the target.","zh":"箭射中了靶子。"}]},{"partOfSpeech":"adj.","definition":{"en":"largest: biggest in size, amount, or degree (superlative of “large”).","zh":"largest：最大的（large 的最高级，表示尺寸、数量或程度最大）。"},"examples":[{"en":"Tokyo is one of the largest cities in the world.","zh":"东京是世界上最大的城市之一。"},{"en":"This is the largest piece of cake.","zh":"这是最大的一块蛋糕。"}]}],"synonyms":["goal","aim","objective","biggest"],"phonetic":"/ˈtɑrɡət/","extraExplanation":["“larget”有时会出现在学习者写作中，是因为“target”的 t/a 位置容易看错，或把“largest”少打了 s、把 i 写漏等。你可以把包含“larget”的完整句子发来，我能帮你判断你想表达的是哪一个词，并改成自然的英文。"]}
{"word":"larghetto","summary":{"en":"Larghetto is a musical term meaning “rather slow,” slightly faster than largo; it can also name a movement marked with that tempo.","zh":"Larghetto 是音乐术语，表示“较慢但不至于极慢”，比 largo 稍快；也可指以该速度标记的乐章/段落。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In music, played at a tempo that is a little faster than largo but still slow and broad.","zh":"（音乐术语）速度比 largo（极慢、庄严）稍快，但仍然偏慢、宽广地演奏。"},"examples":[{"en":"The second movement is marked larghetto, giving it a calm, singing character.","zh":"第二乐章标注为 larghetto，使它呈现出平静、如歌般的气质。"},{"en":"Play the melody larghetto—don’t rush the long notes.","zh":"旋律要用 larghetto 的速度来演奏——不要急着把长音带过去。"}]},{"partOfSpeech":"n.","definition":{"en":"A movement or section of a piece of music that is to be played at a larghetto tempo.","zh":"（音乐）以 larghetto 速度演奏的乐章或段落。"},"examples":[{"en":"Mozart wrote a beautiful Larghetto for the clarinet concerto.","zh":"莫扎特为单簧管协奏曲写过一段优美的 Larghetto。"},{"en":"The larghetto in the middle of the symphony contrasts with the fast finale.","zh":"交响曲中间的那个 larghetto 与快速的终曲形成对比。"}]}],"synonyms":["rather slowly","slowly","a little faster than largo","broadly (in music)"],"phonetic":"/lɑrˈɡɛtoʊ/","extraExplanation":["Larghetto 来自意大利语，是许多音乐速度标记（如 allegro, andante, largo）的一种。意大利语的 -etto 常带有“稍微、较小”的感觉，所以 larghetto 可以理解为“比 largo 稍快一点”。在乐谱里也可能写成 Larghetto（首字母大写），表示一个乐章标题或段落名称。"]}
{"word":"larghettos","summary":{"en":"“Larghettos” is the plural of “larghetto,” a musical term for a tempo slightly faster than largo, or a movement written in that tempo.","zh":"“larghettos”是“larghetto”的复数：指比largo稍快的慢速度，或以该速度写成的乐章/乐段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musical tempo marking meaning “somewhat fast (or less slow) than largo”; usually slow and broad, but a little quicker than very slow music.","zh":"音乐速度术语：指“比 largo（极慢）稍快一些”的速度；仍然偏慢、宽广，但没有那么慢。"},"examples":[{"en":"The second movement is marked larghetto, so it should feel calm but not dragging.","zh":"第二乐章标为 larghetto，所以要平静，但不要拖沓。"},{"en":"Play this passage in a warm, singing style at a larghetto tempo.","zh":"用温暖、如歌的方式以 larghetto 的速度演奏这一段。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece or movement in music written to be played at a larghetto tempo.","zh":"（音乐）以 larghetto 速度写成的乐段或乐章。"},"examples":[{"en":"The concert ended with a gentle Larghetto that featured the woodwinds.","zh":"音乐会以一段温柔的《Larghetto》结束，突出木管声部。"},{"en":"Her favorite track is the Larghetto from the concerto.","zh":"她最喜欢的是协奏曲里的《Larghetto》那一轨。"}]}],"synonyms":["slow tempo","largo (slower)","adagio (often similar, sometimes faster)"],"phonetic":"/lɑrˈɡɛtoʊ/","extraExplanation":["“larghettos”是“larghetto”的复数形式。Larghetto 来自意大利语，是古典音乐中常见的速度标记之一。一般可把它理解为“比 Largo 稍快一点的慢板”。","在乐谱里它既可能表示“速度”，也可能作为标题指“某个乐章/乐段”（例如第二乐章常见慢速度）。"]}
{"word":"larghissimo","summary":{"en":"A musical term meaning extremely slow and broad in tempo.","zh":"一个音乐术语，表示速度极慢且宽广、从容。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Music) Extremely slow and broad in tempo; very slowly, with a spacious, expansive feeling.","zh":"（音乐术语）速度极慢而宽广；非常缓慢、从容地演奏（或演唱）。"},"examples":[{"en":"The adagio returns, then the coda is marked larghissimo.","zh":"柔板主题再现后，尾声标注为 larghissimo（极缓、宽广）。"},{"en":"Play the final chord larghissimo so the sound can bloom.","zh":"最后一个和弦要以 larghissimo 演奏，让音色充分展开。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) A tempo marking or passage that is performed larghissimo.","zh":"（音乐术语）标注为 larghissimo 的速度（或以此速度进行的一段乐句）。"},"examples":[{"en":"The score moves from largo into a brief larghissimo.","zh":"乐谱从 largo 过渡到一小段 larghissimo。"}]}],"synonyms":["very slowly","extremely slowly","very broad (in tempo)"],"phonetic":"/lɑrˈɡisɪmoʊ/","extraExplanation":["这是意大利语速度标记，来自 largo（“宽广、从容”），加上最高级后缀 -issimo，表示“非常、极其”。因此 larghissimo 通常比 largo 还要慢、更“开阔”。在不同作曲家/作品中具体速度会有差异，常结合拍号、风格与情绪来判断。"]}
{"word":"larghissimos","summary":{"en":"“Larghissimos” are very slow, broad tempo markings (or the passages marked that way) in music—the plural of *larghissimo*.","zh":"“Larghissimos”指音乐中“极慢且宽广”的速度标记或相应段落，是 *larghissimo* 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(music) Plural of *larghissimo*: very slow, very broad tempo markings (slower and more expansive than *largo*), or passages played with that marking.","zh":"（音乐）*larghissimo* 的复数：指“极其缓慢、宽广”的速度术语（比 *largo* 更慢、更舒展），也可指按此速度演奏的段落。"},"examples":[{"en":"The score has two larghissimos before the final chorus, so the tempo must open up and slow down dramatically.","zh":"乐谱在终曲合唱前有两个 larghissimos，所以速度要明显放开并大幅放慢。"},{"en":"In rehearsal, the conductor asked the strings to sustain longer in the larghissimos.","zh":"排练时，指挥要求弦乐在那些 larghissimos 里把音拉得更长。"}]}],"synonyms":["largo","adagio","lento","grave"],"phonetic":"lɑrˈɡisɪmoʊ","extraExplanation":["这是意大利语音乐术语：*largo*（宽广、慢）→ *larghissimo*（最高级，意为“非常非常慢/宽广”）。在英文乐评或排练口语里，人们有时把它当名词用，复数就写作 *larghissimos*，表示“几处 larghissimo 段落/标记”。","与常见的 *adagio*、*lento* 相比，*larghissimo*更强调“宽广、庄重、拉开空间感”的慢，而不只是“慢”。"]}
{"word":"largifical","summary":{"en":"Largifical is a rare, formal word meaning “generous” or “giving freely.”","zh":"largifical 是一个罕见且偏正式的词，意思是“慷慨的、乐于施予的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) generous; giving freely; bountiful.","zh":"（罕见/正式）慷慨的；大方施予的；丰厚的。"},"examples":[{"en":"The donor was praised for his largifical support of the hospital.","zh":"这位捐赠者因对医院的慷慨资助而受到称赞。"},{"en":"In old poems, a “largifical hand” can mean someone who gives without counting the cost.","zh":"在一些旧诗中，“慷慨之手”可指不计代价、乐于施予的人。"}]}],"synonyms":["generous","bountiful","openhanded","liberal (in giving)","munificent"],"phonetic":"/lɑrˈdʒɪfɪkəl/","extraExplanation":["这个词在现代英语里非常少见，多见于古典/文学语境；日常更常用 generous、liberal（在“慷慨的”意义上）、bountiful、openhanded。","词源来自拉丁语 largus（丰富的、慷慨的）+ -fic-（“做、制造”相关词根），含义可理解为“使他人得益、慷慨给予”。","相关词：largesse（n. 慷慨施予，尤指对下属/公众的赠与；也可指“赏赐”）。注意 largesse 比 largifical 更常见。"]}
{"word":"largish","summary":{"en":"“Largish” means “somewhat large” or “fairly big,” often used in casual speech when you don’t want to be exact.","zh":"“largish”表示“有点大/相当大”，常用于口语，强调不太精确的大小描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat large; fairly big (but not extremely large).","zh":"有点大；相当大（但不是特别大）。"},"examples":[{"en":"We need a largish table to fit everyone.","zh":"我们需要一张偏大的桌子，才能坐得下所有人。"},{"en":"A largish dog barked at the mail carrier.","zh":"一只体型偏大的狗对邮递员叫个不停。"},{"en":"She bought a largish suitcase for the long trip.","zh":"为了长途旅行，她买了一个偏大的行李箱。"}]}],"synonyms":["somewhat large","fairly large","rather large","biggish","pretty big"],"phonetic":"/ˈlɑrdʒɪʃ/","extraExplanation":["“-ish”是英语里很常见的后缀，用来表达“大概、稍微、有点……的感觉”，语气通常比较口语、随意、不精确。比如：smallish（有点小）、tallish（有点高）、greenish（带点绿）。","“largish”强调“比你预期的要大一点，但又没大到夸张”，适合用在你不想给出精确尺寸/数字时。相比之下，biggish也常见但更口语；large-ish（带连字符）有时也会出现，用法接近。"]}
{"word":"largishness","summary":{"en":"“Largishness” means the state of being somewhat large.","zh":"“largishness”指“有点大、偏大”的状态或程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being somewhat large (not huge, but bigger than average).","zh":"“有点大”的特性；偏大的程度（不算巨大，但比一般大）。"},"examples":[{"en":"The bag’s largishness makes it hard to fit under the seat.","zh":"这个包有点大，很难塞到座位下面。"},{"en":"I like the apartment’s largishness, but the rent is high.","zh":"我喜欢这套公寓偏大的空间，但房租很贵。"}]}],"synonyms":["largeness","size","bigness","being kind of big"],"phonetic":"/ˈlɑr.dʒɪʃ.nəs/","extraExplanation":["“largishness”是由形容词“largish（有点大）”加名词后缀“-ness（……的性质/状态）”构成的较少见词。日常表达里更常用“largeness / size / being kind of big”。","“-ish”常表示“有点……、带点……”，语气比较口语、含蓄，不像“large”那么绝对：biggish（有点大）、tallish（有点高）。"]}
{"word":"largition","summary":{"en":"Largition means a generous gift or the act/quality of giving generously, often used in formal or historical contexts.","zh":"Largition 指慷慨的赠与或慷慨施予的行为/品质，常用于较正式或历史性的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a generous gift or donation; the act of giving money or goods freely (often in a formal or political context)","zh":"慷慨的赠与、捐赠；（常指正式或政治语境中的）施予行为"},"examples":[{"en":"The scholarship was a largition from an anonymous benefactor.","zh":"这项奖学金是一位匿名捐助者的慷慨捐赠。"},{"en":"Critics argued that the governor’s largition was meant to win votes.","zh":"批评者认为州长的“施予”是为了拉拢选票。"}]},{"partOfSpeech":"n.","definition":{"en":"generosity or open-handedness in giving; liberality","zh":"慷慨大方；宽厚的施予"},"examples":[{"en":"Her largition was well known in the community.","zh":"她的慷慨大方在社区里众所周知。"}]}],"synonyms":["donation","gift","bestowal","benefaction","largesse","munificence"],"phonetic":"/lɑrˈdʒɪʃən/","extraExplanation":["词源来自拉丁语 *largitio*（慷慨施予、馈赠），与 *large*（大的、丰富的）同源。这个词在现代英语中较为罕见，常见于历史、政治或文学化的表达。","在古罗马语境中，*largition* 有时暗含“统治者用钱财笼络人心”的意味（类似“political handouts/买票式施舍”），因此在批评性语境里会带一点贬义色彩。"]}
{"word":"largitional","summary":{"en":"“Largitional” is a rare, old-fashioned adjective meaning “generous in giving,” often used in formal or historical writing.","zh":"“Largitional” 是一个罕见的古雅形容词，意思是“慷慨施予（常与金钱/馈赠有关）”，多见于正式或历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Giving freely; generous, especially in giving money, gifts, or help.","zh":"（罕见/古语）慷慨的；乐于施予的，尤指慷慨给钱、礼物或帮助。"},"examples":[{"en":"The patron was praised for his largitional support of the hospital.","zh":"这位赞助人因对医院的慷慨资助而受到称赞。"},{"en":"In older writing, a “largitional” ruler is one who gives gifts to win loyalty.","zh":"在较早的写作里，“largitional”的统治者指通过赠礼来赢得忠诚的人。"}]}],"synonyms":["generous","open-handed","bountiful","liberal (in giving)"],"phonetic":"/lɑrˈdʒɪʃənəl/","extraExplanation":["这个词非常少见，现代英语里几乎不用。更常见的表达是 generous（慷慨的）、liberal in giving（出手大方的）、open-handed（大方的）。","词源上可追溯到拉丁语 largitio（施予、馈赠），因此常带有“分发金钱/赏赐”的语感；在历史语境中也可能暗示“用赏赐换取支持”。","如果你是在文章里看到 largitional，也可能是作者刻意使用的古典/书面风格词；日常写作不建议用，以免读者不熟悉。"]}
{"word":"largo","summary":{"en":"“Largo” is a music term meaning very slow and broad; it can also refer to a movement or piece played at that tempo.","zh":"“largo”是音乐术语，表示“非常缓慢而宽广的速度”；也可指以该速度演奏的乐章或乐段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In music) slow and broad in tempo; played in a calm, stately way.","zh":"（音乐术语）缓慢而宽广的；以沉稳、庄严的速度演奏。"},"examples":[{"en":"The second movement is marked largo, so don’t rush it.","zh":"第二乐章标注为largo，所以不要演得太急。"},{"en":"She played the melody in a largo tempo, letting each note breathe.","zh":"她用largo的速度演奏旋律，让每个音符都有呼吸感。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of music or a movement that is played largo.","zh":"（乐曲/乐章）以largo速度演奏的段落或乐章。"},"examples":[{"en":"My favorite part of the symphony is the largo in the middle.","zh":"这部交响曲里我最喜欢的是中间那段largo乐章。"},{"en":"They performed the largo with a warm, full sound.","zh":"他们用温暖、饱满的音色演奏了那段largo。"}]}],"synonyms":["slow","broad","stately","adagio (often slightly faster)"],"phonetic":"/ˈlɑrɡoʊ/","extraExplanation":["largo来自意大利语，原意与“宽广、开阔”相关，所以它不仅表示“慢”，也强调音乐的“从容、舒展、空间感”。","在常见速度术语里，largo通常比adagio更慢、更庄重（但不同作品/指挥可能有差异）。","经典例子：德沃夏克《第九交响曲“自新大陆”》第二乐章常被称为“Largo”，非常著名。"]}
{"word":"largos","summary":{"en":"“Largos” is the plural of “largo,” a musical term for a very slow, broad tempo or a movement/passage marked that way.","zh":"“Largos”是“largo”的复数，指音乐中“非常慢、宽广”的速度标记，或指以该速度写成的乐章/乐段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(music) A tempo marking meaning “very slow, broad, and stately.”","zh":"（音乐）速度术语，表示“非常慢、宽广而庄严”。"},"examples":[{"en":"Play this section in largo, letting the melody breathe.","zh":"这一段用largo的速度演奏，让旋律有呼吸感。"},{"en":"The conductor asked for a more spacious, largo feel.","zh":"指挥要求更开阔、更有largo风格的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) A passage or movement written in largo tempo; plural form: largos.","zh":"（音乐）以largo速度写成的乐段或乐章；复数：largos。"},"examples":[{"en":"The symphony includes two largos before the finale.","zh":"这部交响曲在终章前包含两个largo乐章。"},{"en":"Her recital program featured a short largo by Handel.","zh":"她的独奏会曲目里有一段亨德尔的短largo。"}]}],"synonyms":["very slowly","broadly (in music)","adagio (close, usually a bit faster)"],"phonetic":"/ˈlɑrɡoʊ/","extraExplanation":["“largo”来自意大利语，原意有“宽广、开阔”的感觉，所以它不仅指“慢”，也常暗示音色与乐句要拉开空间、演奏更从容。","在乐谱里你可能会看到更具体的写法，如“Largo assai”（非常慢）、“Largo ma non troppo”（慢但不要过分慢）。"]}
{"word":"largus","summary":{"en":"Largus is a rare, literary word meaning “generous” or “abundant,” mostly used in classical or old-fashioned contexts.","zh":"largus 是一个很少见的书面词，主要表示“慷慨的”或“丰富的”，多见于古典或仿古语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/learned) Generous; giving freely; lavish.","zh":"（罕见/书面）慷慨的；大方给予的；豪爽的。"},"examples":[{"en":"In the old poem, the king is praised as largus with gifts to the poor.","zh":"在那首古诗里，国王因对穷人慷慨施赠而受到赞美。"},{"en":"She was largus with her time, helping new students after class.","zh":"她很大方地付出时间，课后帮助新同学。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/learned) Abundant; plentiful; ample.","zh":"（罕见/书面）丰富的；充足的；大量的。"},"examples":[{"en":"The valley offered largus supplies of fresh water.","zh":"这片山谷提供了充足的淡水资源。"},{"en":"After the rain, the fields were largus with green growth.","zh":"雨后，田野里绿意蓬勃，生长旺盛。"}]}],"synonyms":["generous","lavish","bountiful","plentiful","ample"],"phonetic":"/ˈlɑrɡəs/","extraExplanation":["“largus”主要是拉丁语词（意为“慷慨的、丰富的”），在现代英语里几乎不作为日常词使用，更多见于古典/学术语境或仿古写作。","学习时容易与常用英语单词“large（大的）”混淆；两者拼写相近，但含义不同：large强调“尺寸/规模大”，largus强调“慷慨/丰盛”。"]}
{"word":"largy","summary":{"en":"“Largy” is a rare/archaic word meaning “generous,” or a “gift/generous payment.”","zh":"“largy”是较少见/古旧的词，可表示“慷慨的”，也可指“礼物/慷慨的赏赐”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"generous; showing a willingness to give money, help, or gifts (rare/archaic).","zh":"慷慨的；大方的（较少见/古旧用法）。"},"examples":[{"en":"The old story praises the king for being largy to the poor.","zh":"这个古老故事称赞国王对穷人很慷慨。"},{"en":"She was known as a largy patron of local artists.","zh":"她以慷慨资助本地艺术家而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a gift or generous payment (rare; often used in Scots/older English).","zh":"礼物；慷慨的赏赐/赠与（少见；常见于苏格兰英语或较旧英语）。"},"examples":[{"en":"He gave the musicians a largy after the performance.","zh":"演出后他给音乐家们一份慷慨的赏钱。"}]}],"synonyms":["generous","bountiful","liberal (in giving)","gift","gratuity"],"phonetic":"/ˈlɑrdʒi/","extraExplanation":["“largy”在现代英语里非常少见，多见于古旧文本或苏格兰英语语境，含义与“generous（慷慨的）/ gift（赠与）”接近。","学习时要注意它很容易被当成“large（大的）”的拼写错误；如果你想表达“大的”，通常应使用“large”。"]}
{"word":"lari","summary":{"en":"Lari is an Indonesian/Malay verb meaning “to run” or “to flee/run away.”","zh":"Lari 是印尼语/马来语动词，意思是“跑”或“逃跑/逃离”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Indonesian/Malay) to run; to move quickly on foot.","zh":"（印尼语/马来语）跑；用脚快速移动。"},"examples":[{"en":"Saya lari setiap pagi.","zh":"我每天早上跑步。"},{"en":"Anak itu lari ke sekolah.","zh":"那个孩子跑去学校。"}]},{"partOfSpeech":"v.","definition":{"en":"(Indonesian/Malay) to flee; to run away from danger or trouble.","zh":"（印尼语/马来语）逃跑；为躲避危险或麻烦而离开。"},"examples":[{"en":"Dia lari dari rumah karena takut.","zh":"他因为害怕而从家里逃走。"},{"en":"Para pencuri lari ketika polisi datang.","zh":"警察一来，小偷就逃跑了。"}]}],"synonyms":["(English) run","(English) flee","(English) run away"],"phonetic":"/ˈlɑri/","extraExplanation":["“lari”不是常见英语词汇，更常见于印尼语/马来语。英语里通常用 run（跑）/ flee（逃离）。","常见搭配：berlari（跑步/正在跑，较书面或完整形式）、lari dari…（从……逃跑）、pelari（跑者/跑步运动员）。"]}
{"word":"laria","summary":{"en":"“Laria” is usually a rare proper name (person/place/brand), not a common English word with a fixed meaning.","zh":"“Laria”通常是较少见的专有名称（人名/地名/品牌），并非含义固定的常用英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper noun used as a personal name (often feminine) or as a place/name brand; it is not a common standard English vocabulary word with a widely agreed dictionary meaning.","zh":"一个较少见的专有名词，可用作人名（常见为女性名）或地名/品牌名；它并不是英语里常见、含义固定的通用词。"},"examples":[{"en":"Laria is my cousin’s name.","zh":"Laria 是我表姐的名字。"},{"en":"I saw “Laria” on the sign, but I’m not sure what it refers to.","zh":"我在招牌上看到 “Laria”，但不确定它指什么。"}]}],"synonyms":["(as a name) Lara","(possible intended word) larva"],"phonetic":"/ˈlɑːriə/","extraExplanation":["“Laria”在英语语料里不算常见词，因此很多时候需要看上下文：是人名、地名、公司/产品名，还是你想查的其实是别的单词。","如果你是想表达“幼虫”，常见词是 larva（单数）/ larvae（复数）；如果是人名，可能也在找更常见的拼法如 Lara、Lariah 等。你可以把完整句子发来，我能帮你判断更准确的意思。"]}
{"word":"lariat","summary":{"en":"A lariat is a cowboy-style rope with a loop (a lasso), and it can also mean to catch something using that rope.","zh":"lariat 指牛仔用的套索（带圈绳索），也可作动词表示“用套索套住/捕捉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rope with a loop (a lasso) used to catch animals, especially cattle or horses.","zh":"套索；（尤指）牧牛或抓马用的带圈绳索。"},"examples":[{"en":"The cowboy threw his lariat over the calf’s head.","zh":"牛仔把套索抛到小牛的头上。"},{"en":"She practiced swinging a lariat in the rodeo arena.","zh":"她在牛仔竞技场练习挥舞套索。"}]},{"partOfSpeech":"v.","definition":{"en":"To catch or control something by throwing a lariat around it.","zh":"用套索套住（捕捉或控制）。"},"examples":[{"en":"They managed to lariat the runaway horse.","zh":"他们设法用套索套住了那匹逃跑的马。"},{"en":"He tried to lariat the steer, but missed the throw.","zh":"他想用套索套住那头公牛，但没套中。"}]}],"synonyms":["lasso","rope"],"phonetic":"/ˈlɛriət/","extraExplanation":["“lariat”在美式英语里很常见，和美国西部文化（cowboy、ranch、rodeo）联系紧密。日常英语里也会用“lasso”表示同样的东西；“lariat”更偏传统/西部语境。","词源上，lariat来自西班牙语“la reata”（意为绳索/皮绳），反映了北美西部早期西班牙语与牛仔文化的影响。","文学与影视里常见搭配：a cowboy with a lariat（拿着套索的牛仔）、to spin/swing a lariat（旋/挥套索）。相关词：rope（绳子）、lasso（套索）、rein（缰绳）。"]}
{"word":"lariated","summary":{"en":"“Lariated” means captured or controlled with a lariat (a looped rope), or figuratively “pulled in” suddenly.","zh":"“Lariated”指被套索套住/控制；也可比喻为突然被卷入、被勾住。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"caught, tied, or controlled with a lariat (a rope with a loop), especially by throwing it around someone or something","zh":"用套索（有圈的绳子）套住、捆住或控制（尤指把绳圈抛过去套住人或动物）"},"examples":[{"en":"The ranch hand lariated the calf and pulled it gently to a stop.","zh":"牧场工人用套索套住小牛，把它轻轻拉停。"},{"en":"The escaped horse was lariated and led back to the barn.","zh":"逃跑的马被套索套住后牵回了马厩。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) suddenly caught or pulled in, as if by a rope","zh":"（比喻）像被绳索套住一样突然被“拉住”、被卷入"},"examples":[{"en":"I got lariated into helping with the project before I could say no.","zh":"我还没来得及拒绝，就被“套”进了这个项目里去帮忙。"},{"en":"His attention was lariated by the headline.","zh":"他的注意力一下子被标题“勾住”了。"}]}],"synonyms":["lassoed","roped","snared","captured","reeled in"],"phonetic":"/ˈlæriˌeɪtɪd/","extraExplanation":["“lariat”常见于美国西部牛仔文化语境：牛仔用套索套牛、抓马等。词源与西班牙语有关，常被解释为来自 la reata（意为“绳索/皮绳”）。在现代日常英语中，这个词偏文学化或带有“西部片”风格；比喻用法更常见于写作或口语夸张表达。"]}
{"word":"lariating","summary":{"en":"“Lariating” means using a lasso (lariat) to rope and catch or control an animal, especially on a ranch or in rodeos.","zh":"“lariating”指用套索把动物套住以捕捉或控制，常见于牧场或牛仔竞技语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of) lariat: to catch, control, or secure something by throwing a lasso (a rope loop), especially in ranching or rodeos.","zh":"（现在分词）用套索（绳圈）套住、捕捉或控制（某物/某人），尤指牧场或牛仔竞技中的套牛、套马。"},"examples":[{"en":"He was lariating calves in the corral.","zh":"他在围栏里用套索套小牛。"},{"en":"She practiced lariating a dummy steer before the rodeo.","zh":"她在牛仔竞技前练习用套索套假公牛。"},{"en":"The ranch hand spent the morning lariating stray cattle.","zh":"那位牧场工人上午都在用套索套回走散的牛。"}]}],"synonyms":["lassoing","roping"],"phonetic":"/ˈlæriətɪŋ/","extraExplanation":["“lariating”在现代英语里更常见的拼写是 **lariatting**（或 **lariating** 作为不常见变体）。词根来自 **lariat**（套索），在美国西部文化（牧场、牛仔、rodeo）语境中很常用。","相关词：**lasso**（名词/动词：套索；用套索套住），**rope**（动词：用绳套住/捆住；在牧场语境里也常指用套索套住）。"]}
{"word":"lariats","summary":{"en":"Lariats are ropes (lassos) with loops, used mainly to catch animals, especially in cowboy/ranch settings.","zh":"Lariats 指带圈的套索/绳索，主要用于（牛仔/牧场）套住动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of lariat: a rope with a loop (a lasso), used especially by cowboys to catch animals","zh":"lariat 的复数：套索；（尤指牛仔用来套住动物的）带圈绳索"},"examples":[{"en":"The ranch hands carried lariats on their saddles.","zh":"牧场工把套索挂在马鞍上。"},{"en":"She practiced throwing lariats at a wooden post.","zh":"她练习把套索甩向一根木桩。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) ropes used for tying, lifting, or securing something, often in ranching contexts","zh":"（较少见）用于捆绑、拖拽或固定的绳索（常见于牧场语境）"},"examples":[{"en":"They used extra lariats to secure the load on the wagon.","zh":"他们用额外的绳索把货物固定在马车上。"}]}],"synonyms":["lassos","ropes","nooses"],"phonetic":"/ˈlɛriət/","extraExplanation":["“lariat”常和美国西部牛仔文化相关，也常与“lasso”互换使用。词源来自西班牙语“la reata”（意为绳索），反映了北美西南部西班牙语文化对英语的影响。"]}
{"word":"larick","summary":{"en":"Larick is most commonly a surname (a family name).","zh":"Larick 最常见用法是姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); also used less commonly as a given name.","zh":"姓氏（家族姓）；较少情况下也用作名字。"},"examples":[{"en":"Ms. Larick will lead the meeting today.","zh":"Larick 女士今天将主持会议。"},{"en":"I saw the name “Larick” on the class list.","zh":"我在班级名单上看到了“Larick”这个名字。"}]}],"phonetic":"/ləˈrɪk/","extraExplanation":["“Larick”通常作为专有名词使用，所以一般要大写。","它不是常见英语词汇，更像是姓氏/人名；在词典里可能找不到固定含义。","如果你是在特定语境（比如小说人物、公司名、地名或用户名）里看到它，含义往往取决于那个语境。"]}
{"word":"larid","summary":{"en":"Larid means a gull-family bird (Laridae) or something related to gulls.","zh":"larid 指“鸥科（Laridae）的鸟”（如海鸥、燕鸥等），也可作形容词表示“鸥科的/与鸥类有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gull or a bird in the gull family (Laridae)","zh":"鸥科鸟类；（尤指）海鸥一类的鸟"},"examples":[{"en":"Many larids, such as gulls and terns, live near coasts and lakes.","zh":"许多鸥科鸟类（如海鸥和燕鸥）生活在海岸和湖泊附近。"},{"en":"The researcher counted larids nesting on the island.","zh":"研究人员统计了在该岛筑巢的鸥科鸟类数量。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to gulls or the gull family (Laridae)","zh":"与鸥类有关的；鸥科的"},"examples":[{"en":"Larid species often have strong wings for long-distance flight.","zh":"鸥科物种常有强健的翅膀，适合长距离飞行。"},{"en":"The guide pointed out larid calls and behaviors.","zh":"导游讲解了鸥科鸟类的叫声与行为。"}]}],"synonyms":["gull (common word)","seabird (broader)"],"phonetic":"/ˈlærɪd/","extraExplanation":["“larid”主要用于生物学/鸟类学语境，来自拉丁化的科名“Laridae”（鸥科）。在日常英语里，人们更常直接说“gull”（海鸥）或具体鸟名（如“tern”燕鸥）。"]}
{"word":"laridae","summary":{"en":"Laridae is the scientific family name for gulls and closely related birds.","zh":"Laridae 是海鸥及其近缘鸟类所属的科学分类名称（鸥科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the biological (scientific) family that includes gulls and their close relatives (in bird classification)","zh":"（鸟类分类中的）鸥科：包含海鸥及其近缘鸟类的生物学（科学）科"},"examples":[{"en":"Many common gulls you see at the beach belong to the family Laridae.","zh":"你在海边常见的许多海鸥都属于鸥科（Laridae）。"},{"en":"In the field guide, gulls are listed under Laridae.","zh":"在野外鸟类图鉴里，海鸥被列在鸥科（Laridae）之下。"}]}],"synonyms":["gull family","gulls (common term)"],"phonetic":"ˈlærɪdi","extraExplanation":["“Laridae”是拉丁化的科学名称，常用于学术写作、图鉴和物种名录；日常英语里更常直接说“gulls（海鸥）”。","生物分类层级中，“family（科）”通常位于“order（目）”之下、“genus（属）”之上。不同学者的分类系统可能会对鸥科的范围有细微调整。"]}
{"word":"laridine","summary":{"en":"“Laridine” is not a standard English word; it is usually a misspelling of “loratadine” (an allergy antihistamine).","zh":"“laridine”不是标准英语词；通常是把“loratadine（氯雷他定）”这个抗过敏药名拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form in English; it is most often intended to mean “loratadine,” a common antihistamine allergy medicine (brand name: Claritin).","zh":"英语中不规范/拼写错误的形式；最常见是想写“loratadine（氯雷他定）”，一种常用的抗过敏（抗组胺）药（商品名：Claritin）。"},"examples":[{"en":"I think “laridine” in your note is a misspelling of “loratadine.”","zh":"我觉得你笔记里的“laridine”可能是“loratadine”的拼写错误。"},{"en":"The doctor suggested loratadine for seasonal allergies (not “laridine”).","zh":"医生建议用氯雷他定来缓解季节性过敏（不是“laridine”）。"}]}],"synonyms":["loratadine","Claritin"],"phonetic":"/ˌlɔːrətəˈdiːn/","extraExplanation":["“laridine”不是常见的英语词条。如果你是在药品、处方或健康相关内容里看到它，最可能是把“loratadine（氯雷他定）”拼错了。也有人会把它和“L-arginine（L-精氨酸）”混淆，但两者用途完全不同。","健康/用药信息建议以药盒标签或医生/药师说明为准；如果你愿意，发我出现“laridine”的完整句子或截图，我可以帮你判断它更可能是哪一个词。"]}
{"word":"larigo","summary":{"en":"“Larigo” isn’t recognized as a standard English word; it’s likely a typo or a proper name.","zh":"“larigo”不是标准英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a brand/name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、品牌/人名地名，或来自其他语言的词。"},"examples":[{"en":"I can’t find a clear English meaning for “larigo” in major dictionaries.","zh":"在主流词典里我找不到“larigo”明确的英语释义。"},{"en":"If you meant “largo,” it’s a music term meaning “slowly.”","zh":"如果你想写的是“largo”，它是音乐术语，意思是“缓慢地”。"}]}],"phonetic":"/ləˈriːɡoʊ/","extraExplanation":["“larigo”很可能是拼写误差。常见相近词之一是 **largo**（音乐术语：缓慢地），也可能是专有名词（如人名/店名/产品名）。","你可以把它所在的完整句子发我，或说明它出现的场景（音乐、游戏、品牌、聊天等），我就能更准确判断它的意思与用法。"]}
{"word":"larigot","summary":{"en":"Larigot is an archaic word for a small pipe or fife-like instrument.","zh":"Larigot 是一个较古老的词，指一种类似短笛/小吹管的管乐器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A small pipe or fife-like musical instrument, similar to a little flute or whistle.","zh":"（古义）一种小型管乐器，类似短笛/小笛子或口哨般的吹管。"},"examples":[{"en":"In medieval songs, a larigot might play bright, high notes for dancing.","zh":"在中世纪歌曲里，larigot 可能会吹出明亮的高音，用来伴舞。"},{"en":"The story mentions a shepherd carrying a larigot on his belt.","zh":"故事里提到一位牧羊人把 larigot 挂在腰带上。"}]}],"synonyms":["fife","pipe","whistle"],"phonetic":"/ˈlærɪɡoʊ/","extraExplanation":["这个词在现代英语里很少见，常见于历史/文学语境。来源与法语有关：法语里也有相关词形，并衍生出固定表达 “à tire-larigot”（表示“很多地、痛快地”，尤其常指“喝很多酒”）。","如果你在古书里看到 larigot，有时是为了营造“中世纪/田园音乐”的氛围，并不一定指一种今天仍常用的具体乐器。"]}
{"word":"lariid","summary":{"en":"“Lariid” isn’t a standard word; it’s likely a misspelling of “larid,” meaning “related to gulls” or “a gull-family bird.”","zh":"“lariid”不是标准单词；很可能是“larid”的拼写错误，意思是“海鸥科的（与海鸥有关的）”或“海鸥科的鸟”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling of “larid.”","zh":"不是标准英语单词，可能是把“larid”拼错了。"},"examples":[{"en":"I couldn’t find “lariid” in a dictionary—did you mean “larid”?","zh":"我在词典里找不到“lariid”——你是不是想写“larid”？"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a bird) Related to gulls and their close relatives (the gull family).","zh":"（鸟类）与海鸥及其近缘鸟类有关的；海鸥科的。"},"examples":[{"en":"Gulls are larid birds commonly seen along coasts.","zh":"海鸥是常见于海岸的海鸥科（larid）鸟类。"},{"en":"The guidebook lists several larid species in the area.","zh":"这本指南列出了该地区的几种海鸥科（larid）物种。"}]},{"partOfSpeech":"n.","definition":{"en":"A bird in the gull family (a gull or a close relative).","zh":"海鸥科的鸟（海鸥或其近缘种）。"},"examples":[{"en":"Several larids circled above the fishing boat.","zh":"几只海鸥科的鸟在渔船上空盘旋。"}]}],"synonyms":["gull (common word)","seabird (broader)"],"phonetic":"/ˈlærɪd/","extraExplanation":["“larid”多见于动物学/观鸟语境，比较书面，不是日常口语。日常说法通常直接用“gull（海鸥）”。","如果你想表达“把……放下”的过去式，可能是“laid”；如果是人名/缩写/游戏ID，也可能不属于英语词汇。你可以告诉我它出现的句子或场景，我能更准确判断。"]}
{"word":"lariidae","summary":{"en":"Lariidae is a rare/likely incorrect family name in taxonomy; it usually points to Laridae (gulls) or Loricariidae (armored catfishes) depending on context.","zh":"Lariidae 在分类学中很少见且常为不规范写法；通常需结合上下文判断是指鸥科（Laridae）或甲鲶科/清道夫那一科（Loricariidae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, taxonomy) A scientific family name; often seen as a misspelling or variant referring to either **Laridae** (the gull family) or **Loricariidae** (armored catfishes/“plecos”), depending on context.","zh":"（生物学·分类学）一种科名写法；在实际使用中常被视为拼写变体或误拼，可能指 **Laridae（鸥科）** 或 **Loricariidae（甲鲶科／异型鲶科，常见“清道夫/吸盘鱼”）**，需根据上下文判断。"},"examples":[{"en":"The paper mentions “Lariidae,” but it likely means **Laridae**, the family that includes gulls and terns.","zh":"论文里写了“Lariidae”，但很可能是指 **Laridae（鸥科）**，包含海鸥、燕鸥等。"},{"en":"In aquarium forums, people sometimes confuse “Lariidae” with **Loricariidae**, the pleco family.","zh":"在水族论坛里，有人会把“Lariidae”和 **Loricariidae（清道夫那一科）** 搞混。"}]}],"synonyms":["Laridae","Loricariidae"],"phonetic":"/ˌlærɪˈaɪɪdiː/","extraExplanation":["“科名”在拉丁学名里通常以 **-idae** 结尾（表示“某某科”）。常见正确写法包括：**Laridae**（鸥科，只有一个 i）与 **Loricariidae**（甲鲶科/异型鲶科，单词更长）。如果你能提供出现它的句子或领域（鸟类/鱼类/论文标题），我可以帮你精确判断应是哪一个词。"]}
{"word":"larikin","summary":{"en":"A (mainly Australian) word for a cheeky, mischievous troublemaker—sometimes criticized, sometimes admired.","zh":"（主要在澳大利亚使用）指“嘴贫顽皮、爱起哄的捣蛋鬼/叛逆青年”，可贬可褒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Australian English) a mischievous, rowdy young person who breaks rules in a playful or rebellious way; sometimes admired as cheeky and independent.","zh":"（尤指澳式英语）拉里金：顽皮、爱起哄、略带叛逆的年轻人；有时也带有“大胆不羁、很有个性”的褒义。"},"examples":[{"en":"Some people see him as a harmless larrikin who just likes to joke around.","zh":"有些人觉得他只是个无伤大雅的“小捣蛋”，喜欢开玩笑而已。"},{"en":"The film’s hero is a classic Australian larrikin—cheeky, brave, and a bit rude.","zh":"这部电影的主角是典型的澳洲“拉里金”形象——嘴贫、勇敢，但有点没礼貌。"},{"en":"The police warned a group of larrikins to stop making trouble outside the station.","zh":"警察警告一群闹事的年轻人别在车站外捣乱。"}]}],"synonyms":["troublemaker","rascal","mischief-maker","hooligan","scamp","rebel"],"phonetic":"/ˈlærɪkɪn/","extraExplanation":["拼写提醒：常见标准拼法是 **larrikin**（你输入的 *larikin* 多半是拼写变体或误拼）。","这个词很有澳洲文化色彩：在口语里既可能是批评“爱闹事”，也可能带点欣赏“敢说敢做、很有幽默感”的味道，语气取决于语境。","词源通常认为来自19世纪墨尔本的俚语（可能与爱尔兰人名/外号有关），后来逐渐泛指“顽皮捣蛋的年轻人”。","相关表达：**larrikin spirit**（拉里金精神：不拘一格、敢挑战权威的劲儿），**cheeky**（嘴贫/厚脸皮但可爱），**troublemaker**（麻烦制造者，偏贬义）。"]}
{"word":"larin","summary":{"en":"“Larin” is usually a proper name, most often a surname.","zh":"“Larin”通常是专有名词，多见作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly found in Russia and other Slavic-language regions; it may also appear as a place or business name","zh":"（常见）姓氏，多见于俄罗斯及其他斯拉夫语地区；也可能用作地名或机构/品牌名称"},"examples":[{"en":"My professor’s last name is Larin.","zh":"我教授的姓是 Larin。"},{"en":"In some translations of Russian literature, you may see the Larin family mentioned.","zh":"在一些俄罗斯文学译本里，你可能会看到“Larin 家族”被提到。"}]}],"phonetic":"/ˈlærɪn/","extraExplanation":["“Larin”通常被当作专有名词使用（姓氏）。它并不是常见的英语词汇，所以在句子里一般需要大写：Larin。","如果你本来想查的是别的词（例如 lair /ˈler/、learn /lɝn/、or “larin” 在某个游戏/作品中的专名），把完整句子或上下文发我，我可以帮你确认。"]}
{"word":"larinae","summary":{"en":"Larinae is a scientific taxonomy term for a subfamily of gulls within Laridae (in some classification systems).","zh":"Larinae 是生物分类学术语，指鸥科（Laridae）中的一个海鸥亚科（在某些分类体系中使用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily in the gull family (Laridae), referring to the “typical gulls” in bird classification.","zh":"（鸟类分类中）鸥科（Laridae）下的一个亚科，指“典型的海鸥类”这一类群。"},"examples":[{"en":"In older classifications, many common gulls were placed in the subfamily Larinae.","zh":"在较旧的分类体系中，许多常见海鸥被归入鸥亚科（Larinae）。"},{"en":"Some modern sources avoid using Larinae and instead treat gull groups differently.","zh":"一些现代资料不再使用 Larinae，而是用不同方式划分海鸥类群。"}]}],"synonyms":["gull subfamily","taxonomic subfamily name","scientific name (taxonomy)"],"phonetic":"/ˈlærɪniː/","extraExplanation":["“Larinae”是拉丁化的科学名称（分类阶元），常见于鸟类学或生物分类文献中，而不是日常英语单词。不同年代的分类系统可能会调整或不再采用这个亚科名。","如果你是在文章或数据库里看到“Larinae”，通常它指的是“gulls（海鸥）相关的一个分类组”，具体包含哪些属与种要看所采用的分类体系。"]}
{"word":"larine","summary":{"en":"“Larine” is usually a rare proper name (a person’s name) and is sometimes seen as a literary surname variant (Larina/Larine).","zh":"“Larine”通常是较少见的人名/姓氏；也可能作为文学语境中姓氏 Larina/Larine 的一种拼写变体出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare English proper name (given name or surname); often seen as a spelling variant of names like “Loreen/Lorene,” or as a transliteration-based spelling in some families","zh":"一个较少见的英文专有名词（可作名或姓）；有时是“Loreen/Lorene”等名字的变体拼写，或来自不同语言音译的拼写"},"examples":[{"en":"Larine is not a common name in the U.S., so people may ask how to spell it.","zh":"Larine 在美国并不常见，所以别人可能会问怎么拼写。"},{"en":"My classmate Larine pronounces her name “luh-REEN.”","zh":"我的同学 Larine 把自己的名字读作“luh-REEN”。"}]},{"partOfSpeech":"other","definition":{"en":"(literary) the family name “Larina/Larine,” associated with characters in Russian literature, especially Pushkin’s *Eugene Onegin* (Mrs. Larina and her daughters)","zh":"（文学）“Larina/Larine”这一姓氏，与俄国文学人物相关，尤其指普希金《叶甫盖尼·奥涅金》中的拉林娜夫人及其女儿们"},"examples":[{"en":"In *Eugene Onegin*, the Larina family represents quiet provincial life.","zh":"在《叶甫盖尼·奥涅金》中，拉林娜一家象征着安静的外省生活。"},{"en":"Some translations spell the surname as Larina, but you may also see Larine.","zh":"有些译本写作 Larina，但你也可能看到 Larine 这种拼法。"}]}],"synonyms":["Lorene","Loreen","Larina"],"phonetic":"/ləˈriːn/","extraExplanation":["“Larine”在英语里不是常见词汇，更常作为人名/姓氏出现；如果你本来想查的是营养补充剂“L-arginine（左旋精氨酸）”或别的单词（如“marine”），可以告诉我你的上下文（句子/领域），我可以帮你对照更正。","俄语姓氏常见形式是“Ларина”（Larina）；在不同英译/音译体系中，结尾字母可能出现变化（-a / -e）。"]}
{"word":"larithmic","summary":{"en":"Logarithmic means “related to logarithms” or “using a scale where equal steps mean multiplication.”","zh":"logarithmic 指“与对数有关”或“使用对数刻度（等距代表倍数变化）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a logarithm; changing according to a logarithmic scale (where equal steps represent multiplication, not addition).","zh":"与“对数”有关的；按对数刻度变化的（等距代表倍数变化，而不是加减变化）。"},"examples":[{"en":"Sound intensity is often measured on a logarithmic scale, like decibels.","zh":"声音强度常用对数刻度来衡量，比如分贝。"},{"en":"A logarithmic graph can make very large numbers easier to compare.","zh":"对数图表能让非常大的数字更容易比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"Increasing quickly at first and then more slowly (a pattern similar to a logarithmic curve).","zh":"（增长）开始很快，之后逐渐变慢的（类似对数曲线的变化模式）。"},"examples":[{"en":"The benefits grew in a roughly logarithmic way: big gains early, smaller gains later.","zh":"收益的增长大致呈对数式：前期提升大，后期提升小。"}]}],"synonyms":["log-based","exponential (contrast)","nonlinear"],"phonetic":"/ˌlɔɡəˈrɪðmɪk/","extraExplanation":["你输入的“larithmic”常见是拼写错误，正确拼写通常是 **logarithmic**（与 logarithm“对数”相关）。","对数刻度在现实中很常见：例如地震震级（里氏/矩震级）、声音分贝、酸碱度 pH 等。它的直觉是：数值每增加同样的“刻度距离”，实际大小是按倍数增长。"]}
{"word":"larithmics","summary":{"en":"A logarithm is a math value (or function) that tells you what power a base must be raised to in order to get a number.","zh":"对数是一个数学数值（或函数），表示把某个底数需要乘方到多少次才能得到一个数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a number that tells you what power you must raise a base to in order to get another number (for example, in base 10, the logarithm of 100 is 2 because 10² = 100)","zh":"（数学）对数：表示把“底数”需要乘方到多少次才能得到某个数的数值（例如以 10 为底，100 的对数是 2，因为 10² = 100）"},"examples":[{"en":"In base 10, the logarithm of 1000 is 3.","zh":"以 10 为底时，1000 的对数是 3。"},{"en":"We used logarithms to make the multiplication easier.","zh":"我们用对数来让乘法计算更容易。"}]},{"partOfSpeech":"n.","definition":{"en":"the logarithm function (often written as log, ln) used in math, science, and computing","zh":"对数函数（常写作 log、ln），在数学、科学与计算中使用"},"examples":[{"en":"Press the log button to find the logarithm of a number.","zh":"按下 log 键来求一个数的对数。"},{"en":"In many formulas, ln means the natural logarithm.","zh":"在很多公式里，ln 表示自然对数。"}]}],"synonyms":["log","log function","exponent (related concept)"],"phonetic":"/ˈlɔɡəˌrɪðəm/","extraExplanation":["你输入的 **“larithmics”** 很可能是拼写误差。更常见的词是 **logarithm（对数）**；形容词可说 **logarithmic（对数的）**，例如 “a logarithmic scale（对数刻度）”。","常见搭配：**log base 10（常用对数）**、**natural log / ln（自然对数，以 e 为底）**。对数常用于表示“增长很快但逐渐变慢”的关系，或用对数刻度压缩很大的数值范围（如地震震级、声音分贝等）。"]}
{"word":"larix","summary":{"en":"Larix = the larch genus, conifer trees that shed needles in winter.","zh":"Larix＝落叶松属：会在冬天落针叶的针叶树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees (larches) that are conifers but unusual because they lose their needles in winter (deciduous conifers).","zh":"落叶松属（Larix）：一种针叶树，但很特别的是冬天会落针叶（属于“落叶的针叶树”）。"},"examples":[{"en":"Larix trees turn golden in autumn before their needles fall.","zh":"落叶松属的树在秋天会变成金黄色，然后针叶脱落。"},{"en":"The park planted Larix near the river because it tolerates cold climates.","zh":"公园在河边种了落叶松属的树，因为它耐寒。"}]}],"synonyms":["larch"],"phonetic":"/ˈlɛrɪks/","extraExplanation":["“Larix”是拉丁语学名，在日常英语里更常说“larch（落叶松）”。在科学写作（植物学、林业、生态学）中常用“Larix”来指“落叶松属”。"]}
{"word":"larixin","summary":{"en":"“Larixin” isn’t a common dictionary word in English; it’s probably a name or a misspelling, so its meaning depends on context.","zh":"“larixin”不是常见的英语词典词；更可能是名称或拼写错误，含义需要结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, a transliteration, or a brand/proper name. Meaning depends on context.","zh":"不是标准英语词汇；更可能是拼写错误、音译词或品牌/专有名词。具体含义取决于语境。"},"examples":[{"en":"I searched for “larixin,” but I couldn’t find it in a dictionary.","zh":"我查了“larixin”，但在词典里找不到。"},{"en":"Could you share the sentence where you saw “larixin”? It may be a brand name.","zh":"你能把看到“larixin”的句子发我吗？它可能是品牌名。"}]}],"synonyms":["(no direct synonyms; depends on what it refers to)"],"phonetic":"ˈlærɪksɪn","extraExplanation":["“larixin”在常见英语词典中不收录。如果你是在医学/保健品/植物提取物的语境里看到它，它可能是某个产品名或成分名；如果是在解剖学语境里，可能想写的是 **larynx**（喉）或 **laryng-** 相关词；如果是在植物语境里，可能与 **larch**（落叶松）相关。","把你看到它的原句、领域（例如药品说明、论文、购物页面）、以及是否首字母大写（Larixin/larixin）告诉我，我可以更准确判断。"]}
{"word":"lark","summary":{"en":"Lark can mean a singing bird (often linked with morning in literature) or a harmless joke/adventure done just for fun.","zh":"lark既可指会鸣唱的云雀（文学中常与清晨相关），也可指为了好玩而做的无恶意玩笑/小冒险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small brown songbird known for singing, often in the morning; especially the skylark","zh":"云雀（常指会鸣唱的小型褐色鸣禽，尤指百灵/云雀）"},"examples":[{"en":"We woke up to the sound of a lark singing outside the window.","zh":"我们在窗外云雀的歌声中醒来。"},{"en":"In poems, the lark often symbolizes morning and hope.","zh":"在诗歌里，云雀常象征清晨与希望。"}]},{"partOfSpeech":"n.","definition":{"en":"a fun activity done as a joke; playful mischief","zh":"玩笑；嬉戏；恶作剧（通常是无恶意的）"},"examples":[{"en":"Sneaking out for ice cream at midnight was just a lark.","zh":"半夜溜出去买冰淇淋只是闹着玩。"},{"en":"Don’t worry—it was meant as a lark, not to hurt anyone.","zh":"别担心——那只是开玩笑，不是要伤害谁。"}]}],"synonyms":["skylark","songbird","prank","frolic","caprice"],"phonetic":"/lɑrk/","extraExplanation":["“lark”作“云雀”时常见于文学语境：如雪莱（Shelley）的《致云雀》（To a Skylark），把云雀的歌声写成自由、灵感与喜悦的象征。","作“玩笑/闹着玩”时，常见搭配是“for a lark”（只是图个乐、闹着玩）与“on a lark”（一时兴起、心血来潮）。这类用法强调轻松、即兴、无恶意。"]}
{"word":"larked","summary":{"en":"“Larked” means “had fun in a playful, silly way,” and it’s the past form of the verb “lark.”","zh":"“larked”是动词“lark”的过去式/过去分词，意思是“嬉闹、打闹；一时兴起玩乐”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"past tense/past participle of “lark”: to have fun in a lively, playful way (often by joking or doing silly things).","zh":"“lark”的过去式/过去分词：嬉闹；打闹；开玩笑般地玩乐（常指做些傻气或逗趣的事）。"},"examples":[{"en":"We larked around after class and nearly missed the bus.","zh":"我们下课后打闹了一阵，差点错过公交车。"},{"en":"They larked about in the park, taking funny photos.","zh":"他们在公园里嬉闹着拍搞笑照片。"}]},{"partOfSpeech":"vi.","definition":{"en":"past tense/past participle of “lark”: to do something just for adventure or amusement, not for a serious reason (often in “on a lark”).","zh":"“lark”的过去式/过去分词：出于好玩或冒险而做某事，并非认真目的（常见于短语“on a lark”）。"},"examples":[{"en":"On a lark, we larked off to the beach without a plan.","zh":"我们一时兴起就跑去海边了，也没做计划。"}]}],"synonyms":["joked around","messed around","fooled around","played around"],"phonetic":"/lɑrk/","extraExplanation":["“lark”作动词时更偏英式口语（British English），常见搭配是 lark about / lark around，意思接近“胡闹、打闹”。在美式英语里更常说 joke around / mess around / fool around。"]}
{"word":"larker","summary":{"en":"“Larker” is an uncommon noun meaning a person who likes to joke or mess around; rarely, it can mean someone who catches larks (birds).","zh":"“larker”是不常用的名词，常指爱开玩笑、爱胡闹的人；很少见的旧义可指捕捉云雀（鸟）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A person who larks—someone who plays around, has fun, or does silly/prankish things.","zh":"（不常用）爱胡闹/爱开玩笑的人；爱玩乐、爱恶作剧的人。"},"examples":[{"en":"He’s a real larker at parties, always joking and keeping everyone laughing.","zh":"他在聚会上特别爱闹，总是开玩笑逗大家笑。"},{"en":"The teachers knew the larkers would try something funny on the last day of school.","zh":"老师们知道那些爱捣蛋的学生会在学期最后一天搞点好玩的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/older) A person who catches or hunts larks (the bird).","zh":"（罕见/较旧）捕捉或猎捕云雀的人。"},"examples":[{"en":"In old writing, a larker might be someone who trapped larks for food.","zh":"在一些旧文本里，larker 可能指捕捉云雀当食物的人。"}]}],"synonyms":["prankster","joker","mischief-maker","fun-lover"],"phonetic":"ˈlɑrkər","extraExplanation":["“larker”在现代英语里很少见。很多时候人们其实想写的是 **lurker**（潜水者/潜伏者，常指在论坛只看不发言的人）。如果你是在网络语境里看到的“larker”，建议先确认是否为拼写错误。","词源上可理解为 **lark（胡闹/玩乐）+ -er（做……的人）**，意思就是“爱胡闹的人”。"]}
{"word":"larkers","summary":{"en":"“Larkers” usually means people who joke around or mess about for fun; rarely, it can mean people who catch larks (birds).","zh":"“larkers”通常指爱开玩笑、爱闹着玩的人；较少见的意思是捕捉云雀等鸟的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who play around, joke, or do something just for fun (plural of “larker”)","zh":"爱闹着玩的人；喜欢开玩笑、寻乐子的人（“larker”的复数）"},"examples":[{"en":"The larkers in the back of the class kept whispering and laughing.","zh":"教室后排那群爱闹着玩的人一直在窃窃私语、偷笑。"},{"en":"They weren’t being mean—just a bunch of larkers looking for a little fun.","zh":"他们并不是恶意的——只是一群想找点乐子的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) people who hunt or catch larks (the small songbirds)","zh":"（少见）捕捉云雀等小鸣禽的人"},"examples":[{"en":"In older texts, you may find “larkers” referring to people who caught larks for food.","zh":"在较老的文本里，“larkers”有时指为食用而捕捉云雀的人。"}]}],"synonyms":["jokers","pranksters","mischief-makers","clowns"],"phonetic":"ˈlɑrkərz","extraExplanation":["“larker”在现代英语里并不算常用，更常见的表达是（英式）“to lark about / around”（胡闹、打闹、玩乐）或名词“a lark”（寻开心、逗乐的事）。所以你看到“larkers”时，多半是在比较口语化或带点幽默的语境里指“爱闹的人”。"]}
{"word":"larkier","summary":{"en":"“Larkier” means more playful and lighthearted (comparative of “larky”).","zh":"“larkier”表示“更爱闹着玩、更轻松愉快”，是“larky”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of larky) more playful, lighthearted, and full of fun; more inclined to joke around","zh":"（larky 的比较级）更爱闹着玩、更轻松愉快、更爱开玩笑的"},"examples":[{"en":"After the exams, everyone felt larkier and started joking around.","zh":"考试结束后，大家更放松、更爱闹着玩了，开始开起玩笑。"},{"en":"He gets larkier when he’s with close friends.","zh":"他和好朋友在一起时会更爱闹着玩。"}]}],"synonyms":["more playful","more lighthearted","more fun-loving","more joking","more mischievous"],"phonetic":"/ˈlɑrkiər/","extraExplanation":["“larkier”来自英式口语形容词“larky”，源于名词/动词“lark”（胡闹、玩乐、开玩笑）。它常用来形容气氛或人的状态：轻松、调皮、爱搞笑。","使用场景上更偏英式英语；美式英语里更常说“more playful / more lighthearted / more fun-loving”。"]}
{"word":"larkiest","summary":{"en":"“Larkiest” means “the most playful and lighthearted,” the superlative form of “larky.”","zh":"“Larkiest”表示“最爱闹着玩、最轻松活泼的”，是“larky”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(superlative of **larky**) the most playful, lighthearted, and full of mischievous fun.","zh":"（**larky** 的最高级）最爱开玩笑的、最轻松活泼的、最带点调皮趣味的。"},"examples":[{"en":"Of all the kids at the party, Maya was the larkiest—she kept making everyone laugh.","zh":"在派对的孩子里，玛雅最“larkiest”——她一直逗得大家笑个不停。"},{"en":"His larkiest mood shows up on weekends, when he jokes around and plans silly games.","zh":"他周末最“larkiest”，爱开玩笑，还会组织一些傻傻的小游戏。"}]}],"synonyms":["goofiest","most playful","most lighthearted","most mischievous"],"phonetic":"/ˈlɑrkiəst/","extraExplanation":["**larkiest** 来自英式口语形容词 **larky**（爱闹着玩、爱开玩笑），而 **larky** 又与名词 **lark**（“玩乐、胡闹；寻开心”，如 *have a lark*）有关。它通常用来形容一种轻松、调皮但不恶意的气氛或性格。","在美式英语里更常见的近义表达是 **most playful / most mischievous / most lighthearted / goofiest**。在正式写作中，常用这些更通用的词来替代。"]}
{"word":"larkiness","summary":{"en":"“Larkiness” means playful, carefree fun or high spirits, sometimes with mild mischief.","zh":"“Larkiness”指轻松爱玩、兴致很高的玩闹感，有时带点小小的恶作剧意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Playful, carefree fun; a lighthearted mood or behavior (often suggesting joking around or a bit of mischief).","zh":"玩闹、轻松的欢乐；一种开朗、爱开玩笑（有时带点小恶作剧）的状态或行为。"},"examples":[{"en":"There was a sense of larkiness in the office after the team finished the project.","zh":"项目完成后，办公室里弥漫着一种轻松玩闹的气氛。"},{"en":"Her larkiness made the long trip feel shorter.","zh":"她的爱玩闹让漫长的旅程感觉短了许多。"},{"en":"The teacher appreciated the students’ larkiness—as long as it didn’t interrupt the lesson.","zh":"老师欣赏学生们的活泼玩闹——只要不影响上课就好。"}]}],"synonyms":["playfulness","high spirits","mischief","jocularity","silliness"],"phonetic":"/ˈlɑrkɪnəs/","extraExplanation":["“larkiness”来自名词/动词“lark”，口语里常指“玩乐、胡闹、寻开心（have a lark）”。这个词带有英式英语的语感，在正式写作中不算常见，更常见的是“playfulness / high spirits / silliness”。","语气通常是正面的（轻松、好玩），但在特定语境也可能暗示“不够认真”或“有点闹腾”，要看场合。"]}
{"word":"larking","summary":{"en":"“Larking” means playful, silly behavior—joking or fooling around (often said as “larking about/around”).","zh":"“larking”指嬉闹胡闹、开玩笑式地打闹（常说 larking about/around）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Playful, silly behavior; joking around, often in a lively way.","zh":"（非正式）胡闹、嬉闹；开玩笑式的打闹（常带有热闹、活泼的感觉）。"},"examples":[{"en":"The kids were larking around in the park after school.","zh":"放学后孩子们在公园里嬉闹。"},{"en":"Stop larking about and finish your homework.","zh":"别再胡闹了，快把作业写完。"},{"en":"There was a bit of larking in the office during the holiday party.","zh":"假日聚会时办公室里有些打闹嬉笑。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “lark”: to behave in a playful, silly way; to joke and fool around.","zh":"“lark”的现在分词：嬉闹；开玩笑；胡闹。"},"examples":[{"en":"They were larking about instead of listening to the teacher.","zh":"他们不听老师讲，在那儿打闹。"},{"en":"We spent the afternoon larking around by the beach.","zh":"我们在海边胡闹玩了一下午。"}]}],"synonyms":["fooling around","messing around","joking around","horsing around"],"phonetic":"/ˈlɑrkɪŋ/","extraExplanation":["“larking (about/around)”更常见于英式英语，语气轻松，通常指无伤大雅的闹着玩；在美式英语里更常用 fooling around / messing around 来表达类似意思。"]}
{"word":"larkingly","summary":{"en":"“Larkingly” means “playfully or jokingly; not seriously.”","zh":"“larkingly”表示“嬉闹地/开玩笑地；不认真地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a playful, joking, or mischievous way; done for fun rather than seriously.","zh":"以嬉闹、开玩笑或顽皮的方式；为了好玩而做，并非认真。"},"examples":[{"en":"They larkingly blamed the dog for the mess, even though they knew it was their fault.","zh":"他们嬉闹着把乱七八糟怪到狗身上，尽管明知是自己的错。"},{"en":"She spoke larkingly, trying to lighten the mood after the tense meeting.","zh":"她用玩笑的口吻说话，想在紧张的会议后缓和气氛。"}]}],"synonyms":["playfully","jokingly","mischievously","in fun","lightheartedly"],"phonetic":"/ˈlɑrkɪŋli/","extraExplanation":["“larkingly”来自动词/名词“lark”（嬉闹、胡闹、玩乐）。在现代英语中它相对少见，更常见的说法是“playfully / jokingly / mischievously”。","注意不要和名词“lark”（云雀，一种鸟）混淆；两者同形但语境不同。","在较老或较文学化的写法里，你可能会见到“lark about / lark around”（到处嬉闹、胡闹）以及“go on a lark”（一时兴起去玩/去做点冒险事）。"]}
{"word":"larkish","summary":{"en":"Larkish means playful and slightly mischievous, as if someone is joking around for fun.","zh":"Larkish 指“顽皮爱闹着玩、带点小淘气”的样子，通常是无恶意的玩笑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Playful, mischievous, or inclined to harmless fun and joking (often describing behavior or a mood).","zh":"爱开玩笑的；顽皮的；喜欢搞小恶作剧的（常形容行为或心情）。"},"examples":[{"en":"He was in a larkish mood and kept making silly jokes during lunch.","zh":"他午餐时心情很顽皮，一直讲些傻傻的笑话。"},{"en":"Their larkish behavior didn’t hurt anyone, but it did distract the class.","zh":"他们顽皮的举动没有伤害任何人，但确实让课堂分了心。"}]}],"synonyms":["playful","mischievous","jokey","high-spirited","impish"],"phonetic":"/ˈlɑr.kɪʃ/","extraExplanation":["“larkish”来自名词/动词“lark”，在英式英语里常指“玩乐、胡闹、闹着玩（a lark）”，也可以指“开个无伤大雅的玩笑/恶作剧”。因此 larkish 通常带有轻松、无恶意的语气。","用法提示：更常见的近义表达是“playful”“mischievous”“jokey”。“larkish”偏书面或英式语感，在现代口语中相对少见。"]}
{"word":"larkishly","summary":{"en":"“Larkishly” means “in a playful, mischievous way.”","zh":"“larkishly”表示“以顽皮、淘气（爱恶作剧）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a playful, mischievous, prankish way; done for fun and not seriously.","zh":"以顽皮、淘气、爱恶作剧的方式；出于好玩而不太认真地。"},"examples":[{"en":"He larkishly suggested we skip the meeting and go for ice cream.","zh":"他顽皮地提议我们别开会了，去吃冰淇淋。"},{"en":"They larkishly teased each other during the long bus ride.","zh":"在漫长的巴士旅程中，他们顽皮地互相逗弄。"},{"en":"She spoke larkishly, but her advice was still helpful.","zh":"她说话带点调皮，但建议仍然很有帮助。"}]}],"synonyms":["playfully","mischievously","impishly","prankishly","jokingly"],"phonetic":"ˈlɑrkɪʃli","extraExplanation":["“larkishly”来自形容词“larkish”（爱玩闹的），而“lark”在英式英语里常指“嬉闹/胡闹/闹着玩（a lark）”。因此它常带有“开玩笑、恶作剧”的轻松语气，但一般不含恶意。","这个词偏书面、偏英式一些；在日常口语里更常用“playfully”“mischievously”来表达类似意思。"]}
{"word":"larkishness","summary":{"en":"Larkishness means playful, joking, slightly mischievous behavior or mood.","zh":"Larkishness 指轻松爱闹、爱开玩笑、带点顽皮的状态或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A playful, joking, slightly mischievous mood or behavior; lighthearted fun.","zh":"爱开玩笑、带点顽皮的轻松心情或行为；嬉闹之态。"},"examples":[{"en":"There was a bit of larkishness in the office before the holiday break.","zh":"放假前办公室里有一点嬉闹的气氛。"},{"en":"His larkishness made the long trip feel shorter.","zh":"他的顽皮逗趣让漫长的旅程感觉没那么长。"}]}],"synonyms":["playfulness","high spirits","mischief","frolicsomeness","jocularity"],"phonetic":"/ˈlɑr.kɪʃ.nəs/","extraExplanation":["“larkishness”来自形容词“larkish”（爱闹着玩的、爱开玩笑的），而“lark”在英式英语里常指“胡闹/恶作剧、寻开心”（a lark）。因此这个词带有“轻松玩笑、无伤大雅的小淘气”的色彩，但在正式写作中相对少见，更常见的是“playfulness / high spirits / mischief”。","语感上，它通常是正面的：强调轻松、有趣；但如果越界影响他人，也可能被理解为“不够严肃”。"]}
{"word":"larklike","summary":{"en":"Larklike means cheerful and carefree, or (literary) like a lark’s bright song or lively flight.","zh":"larklike 指像云雀一样欢快无忧；（文学）也指像云雀的歌声或飞翔那样明亮灵动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a lark (a small songbird): cheerful, carefree, lighthearted, or playfully energetic.","zh":"像云雀（小型鸣禽）一样的：欢快的、无忧无虑的、轻松活泼的。"},"examples":[{"en":"She greeted everyone with a larklike laugh.","zh":"她用像云雀般清脆欢快的笑声跟大家打招呼。"},{"en":"His larklike mood made the long trip feel short.","zh":"他那种云雀般轻松愉快的心情，让漫长的旅途也显得不那么长。"},{"en":"The children ran outside in a larklike burst of energy.","zh":"孩子们带着云雀般的活力一下子冲到户外。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Resembling a lark’s song or flight—bright, high, and lively.","zh":"（文学用法）像云雀的歌声或飞翔：明亮、高亢而灵动的。"},"examples":[{"en":"A larklike melody rose above the quiet strings.","zh":"一段云雀般高亮的旋律飘在轻柔的弦乐之上。"},{"en":"Her voice had a larklike lift at the end of each line.","zh":"她的嗓音在每句末尾都有一种云雀般的上扬感。"}]}],"synonyms":["cheerful","carefree","lighthearted","buoyant","lively","chirpy"],"phonetic":"/ˈlɑrkˌlaɪk/","extraExplanation":["“lark”在英语文化里常象征清晨、自由与欢快的歌声，所以“larklike”常带有一种清新、轻盈、积极的情绪色彩。也因此更常见于描写氛围或人物气质的文学/抒情语境。","相关表达可联想：“as happy as a lark”（像云雀一样快乐）、“lighthearted”（无忧无虑的）、“chirpy”（（英式）快活健谈的）。"]}
{"word":"larkling","summary":{"en":"Larkling is a rare word meaning a young lark, and sometimes (in literary style) something lark-like—light and cheerful.","zh":"Larkling 是个少见词，指“云雀幼鸟”，也可作文学用语表示“像云雀一样轻快愉悦的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young lark (a small songbird); a little lark.","zh":"云雀幼鸟；小云雀。"},"examples":[{"en":"In the nest were three larklings waiting for food.","zh":"巢里有三只小云雀等着觅食。"},{"en":"The farmer heard larklings chirping in the early morning.","zh":"农夫在清晨听见小云雀吱吱叫。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) lark-like; cheerful and light in sound or manner.","zh":"（罕见，文学用语）像云雀一样的；轻快愉悦的（声音或举止）。"},"examples":[{"en":"Her larkling voice filled the room with a bright, spring feeling.","zh":"她那像云雀般轻快的嗓音让房间充满了明媚的春意。"},{"en":"He spoke in a larkling tone, as if the day could not go wrong.","zh":"他说话的语气轻快得像云雀一样，仿佛这一天不会出错。"}]}],"synonyms":["young lark","nestling (general)","lark-like (literary)"],"phonetic":"/ˈlɑrk.lɪŋ/","extraExplanation":["“larkling”在现代英语里非常少见，更多见于诗歌或带古风的描写。它通常由“lark（云雀）+ -ling（表示‘小的/幼小的’或带亲昵感的后缀）”构成，所以最直观的意思是“云雀幼鸟”。","如果你原本想表达“玩乐、胡闹、嬉闹”，常用词是“larking (about/around)”或短语“go larking about”。例如：They were larking about in the park.（他们在公园里嬉闹。）"]}
{"word":"larks","summary":{"en":"“Larks” can mean the plural of the bird “lark,” or (informally) playful pranks/adventures.","zh":"“Larks”既可指“云雀”（lark 的复数），也可（非正式）指玩闹、恶作剧式的乐事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small songbirds (plural of “lark”), known for singing and often flying high in the sky","zh":"云雀；一种小型鸣禽（“lark”的复数），以歌声和高飞著称"},"examples":[{"en":"At dawn, larks sing over the fields.","zh":"清晨，云雀在田野上空歌唱。"},{"en":"We heard larks while hiking in the countryside.","zh":"我们在乡间徒步时听到了云雀的叫声。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) playful adventures, pranks, or bits of fun (plural of “lark”)","zh":"（非正式）玩乐；胡闹；恶作剧式的冒险（“lark”的复数）"},"examples":[{"en":"Their late-night larks kept the neighbors awake.","zh":"他们深夜的胡闹把邻居都吵醒了。"},{"en":"It started as a harmless lark, but it got out of hand.","zh":"一开始只是无伤大雅的闹着玩，后来却失控了。"},{"en":"They went out on a few student larks before finals.","zh":"期末考试前他们出去玩闹了几次。"}]}],"synonyms":["songbirds (bird sense)","pranks","antics","capers","escapades"],"phonetic":"/lɑrks/","extraExplanation":["“lark”既是鸟名（云雀），也可表示“闹着玩/一时兴起做的事”。常见短语：on a lark（心血来潮、图个好玩），如：We drove to the beach on a lark（我们一时兴起开车去海边）。","文学里常用“lark”象征清晨、希望或轻快的歌声；与 nightingale（夜莺）并列时，常形成“清晨 vs. 夜晚”的意象对比。"]}
{"word":"larksome","summary":{"en":"“Larksome” means cheerful and playful, often in a poetic or old-fashioned tone.","zh":"“larksome”表示欢快、嬉戏（多用于诗意或较古雅的语气）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cheerful, playful, and full of high spirits (often used in a poetic or old-fashioned style).","zh":"欢快的；嬉戏的；充满活力的（常见于诗歌或较古雅的用法）。"},"examples":[{"en":"She greeted us with a larksome laugh and a quick smile.","zh":"她用一阵欢快的笑声和迅速的微笑迎接我们。"},{"en":"The children grew larksome after breakfast and ran outside to play.","zh":"孩子们早餐后变得很嬉闹，跑到外面去玩了。"},{"en":"The poem remembers a larksome spring morning in the countryside.","zh":"这首诗追忆了乡间一个欢快的春日清晨。"}]}],"synonyms":["cheerful","merry","playful","lighthearted","sprightly"],"phonetic":"/ˈlɑrksəm/","extraExplanation":["“larksome”来自名词“lark”（云雀；也指嬉戏、玩乐）+ 后缀“-some”（表示“具有……特征的”），因此字面上有“像云雀一样欢快”的感觉。","这个词在现代日常口语中较少见，更常出现在文学描写、诗歌或带复古色彩的文字里。","同义方向可联想：“merry / cheerful / playful / lighthearted”。若想更口语，可用“cheerful”或“playful”。"]}
{"word":"larksomes","summary":{"en":"Larksome means playful, lively, and full of cheerful mischief (often literary or old-fashioned).","zh":"Larksome 指“欢快淘气、兴致勃勃、带点顽皮”的（多为文学或较旧用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) Playful and full of high spirits; inclined to joke or have fun.","zh":"（较古老/文学用语）欢快淘气的；兴致勃勃、爱开玩笑的。"},"examples":[{"en":"The children were in a larksome mood after the picnic.","zh":"野餐后，孩子们情绪很欢快淘气。"},{"en":"He gave a larksome grin and suggested we skip work early.","zh":"他顽皮地笑了笑，提议我们早点溜班。"},{"en":"On spring mornings, the town feels strangely larksome.","zh":"在春天的早晨，这座小镇会显得格外轻快活泼。"}]}],"synonyms":["playful","lively","merry","lighthearted","jocular","frolicsome"],"phonetic":"ˈlɑrksəm","extraExplanation":["你输入的 **larksomes** 在现代英语里很少见；常见形式是 **larksome**（形容词）。有时人们会把它误写成复数，或把它当作“许多欢闹的（人/时刻）”的随意写法，但标准词条通常以 **larksome** 收录。","词源上可理解为 **lark（玩乐、胡闹） + -some（充满……的）**，整体带有一种轻松、带点俏皮的文学色彩。日常口语里更常用 **playful / lively / fun-loving** 等词。"]}
{"word":"larkspur","summary":{"en":"Larkspur is a tall, spiky garden flower (delphinium) often seen in blue or purple.","zh":"Larkspur 指一种高挑穗状花序的园艺花卉（飞燕草/翠雀花），常见蓝紫色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tall flowering plant (genus *Delphinium*) with spikes of blue, purple, pink, or white flowers, often grown in gardens and used in bouquets.","zh":"翠雀花（飞燕草属 *Delphinium*）：一种高大的开花植物，花序呈穗状，常见蓝、紫、粉或白色，常用于花园栽种和花束装饰。"},"examples":[{"en":"She planted larkspur along the fence for a tall splash of blue in summer.","zh":"她沿着栅栏种了翠雀花，让夏天多一片高挑的蓝色。"},{"en":"The florist added larkspur to the arrangement to give it height and a soft, airy look.","zh":"花艺师在花艺作品里加入翠雀花，让整体更有高度，也更轻盈柔和。"}]}],"synonyms":["delphinium","wild larkspur"],"phonetic":"/ˈlɑrkˌspɝ/","extraExplanation":["“larkspur”这个名字来自花朵后方像“距(spur)”一样伸出的结构，让人联想到云雀（lark）的“距”。","园艺和切花语境里常说“larkspur”，但在植物学上它通常对应飞燕草属 *Delphinium*。也有人把一年生的“rocket larkspur”（翠雀属 *Consolida*）也叫 larkspur。","注意：飞燕草/翠雀花对人和宠物可能有毒，若家中有儿童或宠物，摆放和种植时要留意。"]}
{"word":"larkspurs","summary":{"en":"Larkspurs are tall garden flowers with colorful spikes, especially blue or purple.","zh":"larkspurs 指翠雀花/飞燕草一类高大花卉，花序成穗，颜色常见蓝紫等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A larkspur: a tall flowering plant with showy spikes of blue, purple, pink, or white flowers, often grown in gardens.","zh":"翠雀花（或飞燕草）：一种高大的开花植物，花序呈穗状，花色常见蓝、紫、粉或白色，常用于园艺栽培。"},"examples":[{"en":"She planted larkspurs along the fence for a tall splash of blue in early summer.","zh":"她在篱笆旁种了翠雀花，让初夏有一片高挑的蓝色花景。"},{"en":"The bouquet included roses, daisies, and pale purple larkspurs.","zh":"那束花里有玫瑰、雏菊和淡紫色的翠雀花。"}]}],"synonyms":["larkspur","delphinium"],"phonetic":"/ˈlɑrkˌspɝz/","extraExplanation":["“larkspur(s)”是“larkspur”的复数形式；在日常语境里也常用作集合名词，指一丛或一片翠雀花。","词源上可理解为“lark（云雀）+ spur（距、踢马刺）”，因为花后部常有一段向后突出的“距”（spurred shape），看起来像小刺或踢马刺。","园艺与花语文化中，翠雀花常与“轻盈、开朗、守护/保护”等意象相关；但也要注意：某些飞燕草/翠雀花属植物对人和宠物有毒，园艺种植需留意安全提示。"]}
{"word":"larky","summary":{"en":"“Larky” means playful and slightly mischievous, often used in informal British English.","zh":"“larky”指爱玩、爱开玩笑、有点淘气（多为英式口语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, chiefly British) Playful and a bit mischievous; liking jokes or harmless pranks.","zh":"（非正式，主要英式）爱开玩笑的；有点淘气、喜欢恶作剧（通常无伤大雅）的。"},"examples":[{"en":"The meeting got a little larky once everyone relaxed.","zh":"大家放松下来后，会议气氛变得有点爱开玩笑。"},{"en":"They were in a larky mood and started teasing each other.","zh":"他们心情很闹腾，开始互相开玩笑。"},{"en":"His larky comments made the long trip feel shorter.","zh":"他那些调皮的玩笑让漫长的旅程感觉没那么长了。"}]}],"synonyms":["playful","mischievous","cheeky","lighthearted","jokey"],"phonetic":"/ˈlɑrki/","extraExplanation":["“larky”来自名词/动词“lark”（玩乐、胡闹、搞恶作剧）。在英式口语里比较常见，用来形容气氛或人“闹着玩、爱起哄”的感觉。","语气通常偏正面：强调轻松、逗趣；但如果场合严肃（比如正式会议、仪式），说某人很 larky 也可能带一点“不够稳重”的暗示。"]}
{"word":"larlike","summary":{"en":"Larklike means cheerful and lively, like a lark’s happy singing.","zh":"Larklike 指像云雀一样欢快、轻松、活泼的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"cheerful, lively, and lighthearted; like a lark (a bird often associated with happy singing).","zh":"欢快的、活泼轻松的；像“云雀”一样（云雀常因歌声而被联想到快乐）。"},"examples":[{"en":"She walked into the room with a larklike mood, humming softly.","zh":"她带着一种云雀般的好心情走进房间，轻轻哼着歌。"},{"en":"His larklike laugh made everyone relax.","zh":"他那种轻快的笑声让大家都放松下来。"}]}],"synonyms":["cheerful","lighthearted","buoyant","merry","sprightly"],"phonetic":"/ˈlɑrkˌlaɪk/","extraExplanation":["“larklike / lark-like”来自名词 lark（云雀）。在英语文化里，云雀常象征清晨、歌唱与愉快的精神状态，因此 larklike 多用来形容“轻快、开心、无忧无虑”的感觉。","常见相关表达：happy as a lark（非常开心），也能帮助理解 larklike 的语气。"]}
{"word":"larmier","summary":{"en":"A larmier is an architectural drip molding that directs rainwater away from a wall.","zh":"larmier 指建筑上的滴水线脚/滴水构件，用来把雨水从墙面导开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture) A projecting molding or groove on a building (often above a window, door, or cornice) designed to shed rainwater away from the wall; a dripstone.","zh":"（建筑）一种凸出的线脚或凹槽（常在窗、门或檐口上方），用来把雨水导离墙面；滴水线（滴水石/滴水线脚）。"},"examples":[{"en":"The architect added a larmier above the window to keep rain from streaking the stone.","zh":"建筑师在窗上方加了滴水线脚，防止雨水在石墙上留下水痕。"},{"en":"Over time, the old larmier cracked, and water began to seep into the facade.","zh":"久而久之，老旧的滴水线脚开裂，雨水开始渗入外立面。"}]}],"synonyms":["dripstone","drip molding","hood mold","water table (related)"],"phonetic":"/lɑrˈmjɛr/","extraExplanation":["这是一个较少见的借词，来自法语 larmier，和 larme（“眼泪”）同源，形象地表示“让水滴落下”的构造。","在英式建筑术语中常见对应说法有 dripstone / drip moulding；在古建筑修复、教堂或石砌建筑描述中更可能见到 larmier。"]}
{"word":"larmoyant","summary":{"en":"Larmoyant means tearfully sentimental, often implying emotion that feels a bit excessive or forced.","zh":"larmoyant 指“催泪而多愁善感的”，常含“过度煽情、略显做作”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of writing, speech, music, etc.) tearfully emotional in a way that can feel overly sentimental or melodramatic.","zh":"（指文章、讲话、音乐等）催人落泪的；多愁善感的（常带“过于煽情/做作”的语气）。"},"examples":[{"en":"Some critics called the film’s final scene larmoyant rather than genuinely moving.","zh":"一些影评人说这部电影的结尾更像是在煽情，而不是真正动人。"},{"en":"He wrote a larmoyant letter that begged for forgiveness and sympathy.","zh":"他写了一封充满煽情的信，恳求原谅与同情。"}]}],"synonyms":["maudlin","sentimental","tearful","melodramatic","mawkish"],"phonetic":"/ˌlɑr.mwɑˈjɑn/","extraExplanation":["“larmoyant”来自法语，和法语的“larme（眼泪）”同源。英语里它常用于文学/影评等语境，带一点“刻意催泪、略显矫情”的评价色彩。可与更中性的 moving（感人）对比：moving 偏正面；larmoyant 往往暗示过度渲染情绪。"]}
{"word":"larn","summary":{"en":"“Larn” is a nonstandard spelling of “learn,” used to show dialect or informal speech.","zh":"“larn”是“learn”的非标准拼写，常用于体现方言或非正式口语。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard/dialect) To learn; to gain knowledge or a skill.","zh":"（非标准/方言）学习；掌握知识或技能。"},"examples":[{"en":"I’m trying to larn English faster.","zh":"我正在努力更快地学英语。"},{"en":"He larned to drive when he was sixteen.","zh":"他十六岁时学会了开车。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Nonstandard/dialect, less common) To teach someone something.","zh":"（非标准/方言，较少见）教（某人）某事。"},"examples":[{"en":"My grandpa larned me how to fish.","zh":"我爷爷教我怎么钓鱼。"}]}],"synonyms":["learn","study","pick up"],"phonetic":"/lɑrn/","extraExplanation":["“larn”通常是“learn”的拼写变体，用来模仿口音或表现乡土/口语风格；在正式写作和考试中建议用“learn”。","在文学作品中作者有时会用“larn”来塑造人物的地域或社会背景（例如描写乡村口音、工人阶层口语等）。使用时要注意语境，避免让人觉得不专业或带有刻板印象。"]}
{"word":"larnakes","summary":{"en":"“Larnakes” means ancient Greek-style burial chests/coffins (plural of larnax), mainly used in archaeological contexts.","zh":"“larnakes”指古希腊式的葬箱/小棺（larnax 的复数），主要用于考古语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of larnax: a small coffin or chest, especially a terracotta or stone burial box used in ancient Greek (notably Minoan) burials.","zh":"larnax 的复数：一种小型棺箱或匣子，尤指古希腊（常见于米诺斯文明）用的陶制或石制葬具。"},"examples":[{"en":"Archaeologists found painted larnakes in the tomb, showing scenes of sea life.","zh":"考古学家在墓中发现了绘有图案的 larnakes，上面描绘了海洋生物的场景。"},{"en":"The museum displays several larnakes from Crete, dated to the Late Bronze Age.","zh":"博物馆展出了几件来自克里特岛、可追溯到青铜时代晚期的 larnakes。"}]}],"synonyms":["coffins","caskets","burial chests","ossuaries"],"phonetic":"/ˈlɑr.nə.kiːz/","extraExplanation":["“larnax / larnakes”来自希腊语词源，常用于考古与艺术史语境，特别指克里特岛米诺斯文化中常见的长方形陶棺（有时带彩绘）。日常英语中很少用，更多见于博物馆说明、学术文章或历史题材写作。","常见搭配：painted larnakes（彩绘陶棺）、terracotta larnakes（陶制葬箱）、burial larnakes（葬具）。"]}
{"word":"larnaudian","summary":{"en":"“larnaudian” is not recognized as a standard English word; it is probably a misspelling or a niche proper term.","zh":"“larnaudian”不是标准英语词；多半是拼写错误或小众专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “larnaudian” does not appear in major English dictionaries and is likely a misspelling, a very rare proper name, or a term from a specific fandom/text.","zh":"不是标准英语单词。“larnaudian”在主流英语词典中通常查不到，可能是拼写错误、非常罕见的专有名词，或出自某个特定作品/圈子用语。"},"examples":[{"en":"I can’t find “larnaudian” in standard dictionaries—could you share the sentence you saw it in?","zh":"我在标准词典里找不到“larnaudian”——你能把它出现的句子发我看看吗？"},{"en":"It may be a misspelling; similar-looking words include “Lernaean” or “Laudian.”","zh":"它可能是拼写错误；外形相近的词包括“Lernaean”或“Laudian”。"}]}],"synonyms":["(possible intended) Lernaean","(possible intended) Laudian"],"phonetic":"N/A","extraExplanation":["“larnaudian”很可能是拼写或转写导致的变体。常见的相近词有：\n- Lernaean（也写作 Ler(n)aean）：来自希腊神话“勒尔那（Lerna）”，最常见搭配是 “the Lernaean Hydra（勒尔那九头蛇）”。\n- Laudian：与17世纪英国坎特伯雷大主教 William Laud（威廉·劳德）相关，常见于宗教/历史语境。\n如果你把原句、来源（书/文章/游戏/人名）或你想表达的意思告诉我，我可以更准确判断它对应哪个词，并给出正确释义与用法。"]}
{"word":"larnax","summary":{"en":"“Larnax” isn’t a recognized English word; it’s probably a name or a misspelling (often of “learn”).","zh":"“larnax”不是常见英语词；多半是名称或拼写错误（常见可能是把“learn”写错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling, a username/brand name, or a made-up (fictional) term.","zh":"不是标准英语单词；更可能是拼写错误、用户名/品牌名，或虚构造词。"},"examples":[{"en":"I couldn’t find “larnax” in a dictionary—did you mean “learn” or “Lernaean”?","zh":"我在词典里找不到“larnax”——你是想写“learn（学习）”还是“Lernaean（勒耳那的/九头蛇相关的）”吗？"},{"en":"“Larnax” might be a product name rather than an English vocabulary word.","zh":"“Larnax”可能是产品名，而不是英语词汇。"}]}],"phonetic":"/ˈlɑːr.næks/","extraExplanation":["“larnax”看起来像拼写误差（例如把 learn /ˈlɝːn/ 写错），也可能是专有名词（游戏角色、公司名、账号名等）。如果你能提供一句包含它的原句、来源（网页/游戏/书名）或想表达的意思，我可以更准确地判断并给出对应词条。","如果你本来想输入的是 “learn”：意思是“学习；学会”。如果是 “Lernaean”：常见于短语 “the Lernaean Hydra（勒耳那九头蛇）”，引申为“问题越解决越多、难以根除的麻烦”。"]}
{"word":"larnyx","summary":{"en":"Larynx means the voice box in your throat that contains the vocal cords.","zh":"Larynx 指喉（喉头），也就是含有声带的“发声器官”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the voice box: an organ in your throat that contains the vocal cords and helps you breathe, speak, and swallow","zh":"喉（喉头）：位于喉咙的“发声器官”，内含声带，帮助呼吸、发声与吞咽"},"examples":[{"en":"The doctor examined her larynx to check why her voice was hoarse.","zh":"医生检查了她的喉部（喉头），看看声音嘶哑的原因。"},{"en":"Smoking can irritate the larynx and affect your voice.","zh":"吸烟会刺激喉部并影响嗓音。"},{"en":"When you speak, air passes through the larynx and makes the vocal cords vibrate.","zh":"说话时，气流通过喉部，让声带振动发声。"}]}],"synonyms":["voice box"],"phonetic":"/ˈlærɪŋks/","extraExplanation":["你输入的 **larnyx** 常见是把 **larynx** 拼错了（正确拼写：larynx）。","词源来自希腊语 *larynx*，在医学语境里常与 *vocal cords*（声带）、*trachea*（气管）、*pharynx*（咽）一起出现。","常见搭配：*laryngeal cancer*（喉癌）、*laryngitis*（喉炎）、*larynx examination*（喉部检查）。"]}
{"word":"laroid","summary":{"en":"“Laroid” means ‘gull-related’ and is mainly used in bird science.","zh":"“Laroid”意为“与海鸥等鸥形类有关的”，主要用于鸟类学等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a bird) related to gulls and their close relatives (the group that includes gulls, terns, skimmers, etc.).","zh":"（鸟类）与鸥类及其近缘类群有关的；鸥形类的（包括海鸥、燕鸥、剪嘴鸥等）。"},"examples":[{"en":"Researchers compared laroid species to other seabirds to study migration patterns.","zh":"研究人员将鸥形类物种与其他海鸟进行比较，以研究迁徙模式。"},{"en":"The island hosts several laroid birds during the breeding season.","zh":"在繁殖季节，这座岛上会出现几种鸥形类鸟。"}]}],"synonyms":["gull-like","larid (more specific)"],"phonetic":"/ˈlærɔɪd/","extraExplanation":["“laroid”来自鸟类分类学用语：Laridae（鸥科）以及更广的“Laroidea/laroid group”（传统上指鸥形类群）。在日常英语里很少用，多见于鸟类学、生态学论文或野外记录。","如果你是在写作或查词时看到“laroid”，它通常是在描述“像海鸥那一类的鸟”，而不是指某一种具体鸟名。"]}
{"word":"laron","summary":{"en":"“Laron” usually refers to Laron syndrome, a rare genetic disorder involving growth hormone insensitivity; it can also be a surname.","zh":"“Laron”通常指拉隆综合征（生长激素不敏感的罕见遗传病）；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare genetic condition in which the body cannot properly use growth hormone, often leading to short stature and very low levels of IGF-1 (insulin-like growth factor 1); also called “Laron syndrome.”","zh":"一种罕见的遗传性疾病，身体无法正常利用生长激素，常导致身材矮小并伴随IGF-1（类胰岛素样生长因子1）水平很低；也称“拉隆综合征”。"},"examples":[{"en":"The doctor mentioned Laron syndrome as a possible reason for the child’s slow growth.","zh":"医生提到拉隆综合征可能是孩子生长缓慢的原因之一。"},{"en":"People with Laron may need specialized medical care and long-term follow-up.","zh":"患有拉隆综合征的人可能需要专科治疗和长期随访。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used as a proper noun.","zh":"姓氏（专有名词）。"},"examples":[{"en":"Dr. Laron first described the condition in medical research.","zh":"拉隆医生最早在医学研究中描述了这种疾病。"}]}],"synonyms":["Laron syndrome","growth hormone insensitivity","GH insensitivity"],"phonetic":"/ləˈrɑn/","extraExplanation":["“Laron”常见于医学语境，最常指“Laron syndrome（拉隆综合征）”。该病以以色列儿科内分泌学家 Zvi Laron 命名。","学习建议：日常英语中单独说“Laron”并不常见，更常见的完整表达是“Laron syndrome”或“growth hormone insensitivity（生长激素不敏感）”。"]}
{"word":"larree","summary":{"en":"“Larree” is not a standard English word; it’s usually a playful misspelling of the name “Larry.”","zh":"“Larree”不是标准英语单词；通常是名字“Larry”的玩笑式误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a nonstandard or playful spelling of “Larry” (a male given name); sometimes used online to imitate pronunciation or for a humorous tone","zh":"“Larry”（男性名字）的非标准/玩笑式拼写；有时在网络上用来模仿发音或制造幽默语气"},"examples":[{"en":"My uncle Larry is coming to visit this weekend.","zh":"我叔叔Larry这周末要来拜访。"},{"en":"She wrote “Larree” in the caption as a joke, but his name is actually Larry.","zh":"她在说明里开玩笑写成“Larree”，但他真正的名字其实是Larry。"}]}],"synonyms":["Larry"],"phonetic":"/ˈlæri/","extraExplanation":["“Larree”不是英语里常见的标准拼写，通常不会出现在正式写作中。如果你是在作业/邮件/简历里要写名字，建议用标准拼写“Larry”。","如果你原本想查的是别的词（例如“larry”作动词在英式英语里有“拉扯、拽”的意思，但较少见），告诉我上下文句子，我可以帮你确认。"]}
{"word":"larries","summary":{"en":"“Larries” usually means fans who ‘ship’ Harry Styles and Louis Tomlinson (Larry Stylinson). Less commonly, it can be the plural of an Australian slang word for rowdy troublemakers.","zh":"“Larries”通常指支持 Harry Styles 和 Louis Tomlinson（Larry Stylinson）这对 CP 的粉丝；较少见时也可指澳式俚语里“爱闹事的人”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, fandom) People who believe in or support the idea that two celebrities (especially Harry Styles and Louis Tomlinson from One Direction) are or were secretly in a romantic relationship; fans of the “Larry Stylinson” pairing.","zh":"（非正式，粉丝文化）相信或支持两位名人（尤其是一世代的 Harry Styles 与 Louis Tomlinson）私下曾/正在恋爱的人；“Larry Stylinson（拉里）”同人/CP 的支持者。"},"examples":[{"en":"On social media, some Larries analyze old interviews for “clues.”","zh":"在社交媒体上，一些 Larries 会分析旧采访寻找“线索”。"},{"en":"She left the group chat because the Larries kept arguing with other fans.","zh":"她退了群聊，因为 Larries 一直在和其他粉丝争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of larry (Australian English, informal): a loud, rowdy, or mischievous person; a larrikin.","zh":"larry 的复数（澳大利亚英语，非正式）：吵闹、爱闹事或顽皮的人；相当于 larrikin（爱起哄的人）。"},"examples":[{"en":"A few larries were making noise outside the pub.","zh":"酒吧外面有几个闹腾的人在吵闹。"},{"en":"The teacher told the larries at the back to settle down.","zh":"老师让后排那几个爱闹的人安静下来。"}]}],"synonyms":["Larry shippers","Larry Stylinson fans","larrikins (AU, for the slang sense)"],"phonetic":"/ˈlæriz/","extraExplanation":["在网络语境里，“Larries”最常见的指向是 One Direction 粉圈里的“Larry Stylinson”CP 支持者；大小写常常提示含义：写作 “Larries” 多指粉圈群体，写作 “larries” 更可能是澳式俚语的复数。","如果你是在特定平台（如推特/TikTok）看到这个词，通常与“同人（shipping）”“解读细节（analysis）”“阴谋论式猜测（conspiracy-style speculation）”等讨论同场出现。"]}
{"word":"larrigan","summary":{"en":"“Larrigan” is mainly used as a name (usually a surname), not a common English vocabulary word.","zh":"“Larrigan”主要作为人名使用（多为姓氏），并不是常见英文词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), usually of Irish origin","zh":"（常见为爱尔兰起源的）姓氏"},"examples":[{"en":"Ms. Larrigan will lead the meeting today.","zh":"Larrigan 女士今天将主持会议。"},{"en":"I found a research paper by Dr. Larrigan.","zh":"我找到了一篇由 Larrigan 博士撰写的研究论文。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (first name), rare in modern English use","zh":"（较少见的）英文名字/名"},"examples":[{"en":"Larrigan is an unusual first name.","zh":"Larrigan 是一个不太常见的名字。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈlærɪɡən/","extraExplanation":["“Larrigan”在英语里通常不是普通词汇，而是人名（多见为姓）。在阅读文章或看名单时，把它当作专有名词处理：首字母大写，前面可接称呼（Mr., Ms., Dr.）。","拼写上可能与一些更常见的词混淆，比如澳大利亚英语的“larrikin”（调皮捣蛋的人）。如果你是在某段原文里看到“larrigan”，也有可能是人名、地名或拼写变体；给我上下文句子我可以帮你更准确判断。"]}
{"word":"larrigans","summary":{"en":"“Larrigans” is most commonly a plural form of the surname “Larrigan,” meaning people in the Larrigan family.","zh":"“Larrigans”最常见用法是姓氏“Larrigan”的复数形式，指拉里根家族/姓Larrigan的人。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Usually) a family name; “Larrigans” most often means “members of the Larrigan family” or “people named Larrigan.”","zh":"（通常）一个姓氏；“Larrigans”多指“拉里根家族的人”或“姓Larrigan的人”。"},"examples":[{"en":"Two Larrigans live next door to my grandparents.","zh":"有两位姓Larrigan的人住在我祖父母家隔壁。"},{"en":"The Larrigans moved to Chicago last year.","zh":"拉里根一家去年搬去了芝加哥。"}]}],"phonetic":"/ˈlærɪɡənz/","extraExplanation":["“Larrigan / Larrigans”在英语里并不是常见词汇，更常见的是作为姓氏出现，因此通常不需要“翻译词义”，而是保留原拼写。","如果你是在阅读小说/家谱/新闻时看到它，往往指某个家庭或家族成员（复数形式加 -s）。","也有可能是拼写听写造成的误差：例如澳大利亚英语里的“larrikin”（调皮捣蛋的年轻人）有时会被误写/误听成相近形式；如果你能提供原句，我可以帮你判断。"]}
{"word":"larrikin","summary":{"en":"A larrikin is a mischievous, cheeky troublemaker, often with an (especially Australian) sense of likeable rebellion.","zh":"larrikin 指顽皮嘴贫、爱闹腾的人；在澳洲语境中常带“有点叛逆但讨喜”的味道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (often a young man) who behaves in a mischievous, cheeky, and sometimes disorderly way; in Australian English it can also suggest a likeable, rebellious “good-humored troublemaker.”","zh":"（常指年轻男性）行为顽皮、嘴贫、甚至有点不守规矩的人；在澳大利亚英语里也可带有亲切的意味，指那种“有点叛逆但讨喜的捣蛋鬼/痞帅的人”。"},"examples":[{"en":"He’s a bit of a larrikin—always joking around, but he means well.","zh":"他有点像个 larrikin——总爱开玩笑闹腾，但人不坏。"},{"en":"The coach warned the team not to act like larrikins in public.","zh":"教练警告队员不要在公共场合像一群 larrikin 那样胡闹。"},{"en":"In some Aussie movies, the larrikin hero breaks rules but stands up for friends.","zh":"在一些澳洲电影里，larrikin 式的主角会不按规矩来，但很讲义气。"}]}],"synonyms":["rascal","mischief-maker","troublemaker","punk","rebel"],"phonetic":"/ˈlærɪkɪn/","extraExplanation":["“larrikin”最常见于澳大利亚和新西兰英语。在英美语境里较少见，读者可能需要根据上下文理解其“顽皮/捣蛋”的意味。","这个词的感情色彩会随语境变化：可以是负面的（粗鲁、闹事），也可以是偏正面的（幽默、反叛但有正义感）。","文化上常与“澳洲式幽默与反权威（anti-authoritarian）”的刻板印象相关：不太端着、爱调侃、敢顶嘴，但不一定恶意。"]}
{"word":"larrikinalian","summary":{"en":"“Larrikinalian” isn’t a standard English word; it likely relates to “larrikin,” an Australian term for a mischievous, rebellious person (sometimes charming).","zh":"“larrikinalian”不是标准英文词；它可能与“larrikin”有关，指一种澳大利亚语境下“调皮、叛逆（有时也讨喜）的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up form, possibly related to “larrikin” (an Australian term).","zh":"不是标准英文单词。很可能是拼写错误或自造词，可能与“larrikin”（澳大利亚用语）有关。"},"examples":[{"en":"I couldn’t find “larrikinalian” in major dictionaries—did you mean “larrikin”?","zh":"在主流词典里查不到“larrikinalian”，你是不是想写“larrikin”？"}]},{"partOfSpeech":"n.","definition":{"en":"larrikin: a person (often a young man) who is playful, rebellious, and a bit disrespectful, but sometimes seen as charming; a “rascal” or “mischievous troublemaker” (especially in Australian English).","zh":"larrikin：指（常为年轻男性）爱闹、叛逆、有点不守规矩的人；有时带一点“可爱、讨喜”的感觉。多见于澳大利亚英语。"},"examples":[{"en":"He’s a bit of a larrikin, always joking around in class.","zh":"他有点像个小痞子/调皮鬼，总是在课堂上开玩笑。"},{"en":"The film celebrates a larrikin spirit—bold, funny, and anti-authority.","zh":"这部电影歌颂一种“larrikin精神”——大胆、幽默、带点反权威。"}]}],"synonyms":["rascal","mischief-maker","troublemaker","rebel"],"phonetic":"/ˈlærɪkɪn/","extraExplanation":["“larrikin”是很典型的澳大利亚文化词，语气可褒可贬：可能是“调皮但讨喜”，也可能是“没礼貌、爱惹事”。具体取决于语境。","如果你想表达“像larrikin一样的人/风格”，英语里更常说“larrikin-like”或“a larrikin type”，而不是“larrikinalian”。","如果你能告诉我这个词出现的句子或来源（书名、游戏、社交媒体等），我可以更准确判断它是不是专有名词、昵称、或某个圈子里的新造词。"]}
{"word":"larrikiness","summary":{"en":"Larrikiness means a cheeky, playful kind of rebelliousness—often seen as humorous and informal, especially in Australian English.","zh":"Larrikiness 指一种调皮、嘴贫、带点叛逆但多半不恶意的气质，尤常见于澳大利亚英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being a larrikin: playfully rebellious, cheeky, and informal in a way that often feels humorous rather than seriously harmful","zh":"“larrikin”的特质：带点叛逆、爱开玩笑、嘴贫/调皮、行事不拘小节的风格，通常偏幽默而非恶意"},"examples":[{"en":"His jokes had a touch of larrikiness, but he knew when to stop.","zh":"他的玩笑带点“larrikiness”（顽皮的叛逆感），但他知道什么时候该收手。"},{"en":"The team’s larrikiness made the press conference lively and memorable.","zh":"球队那种“larrikiness”的劲儿让发布会变得热闹又让人印象深刻。"}]}],"synonyms":["cheekiness","mischief","impishness","playfulness"],"phonetic":"/ˈlærəkinəs/","extraExplanation":["“Larrikiness”主要见于澳大利亚英语，语气通常偏正面或亲切，强调“淘气但不坏”“不按常规但很有幽默感”。不过在正式场合或当行为影响他人时，也可能带有批评意味。","词根来自“larrikin”（澳新常用），在澳大利亚文化叙事里常与“反权威、爱自嘲、平民气质”联系在一起（类似一种“顽皮的草根叛逆”形象）。"]}
{"word":"larrikinism","summary":{"en":"Larrikinism means cheeky, rebellious, rule-bending behavior associated especially with Australian culture.","zh":"Larrikinism 指带点顽皮叛逆、爱挑战规则的作风，尤常与澳大利亚文化形象相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The attitude or behavior of a larrikin: cheeky, rebellious, rule-bending conduct (often seen as humorously anti-authority, sometimes admired, sometimes criticized).","zh":"“流氓式/痞气式”作风：带点无礼、叛逆、爱挑战规则的行为与态度（常带反权威的幽默感；有时被欣赏，有时被批评）。"},"examples":[{"en":"The film celebrates a kind of Australian larrikinism—bold jokes, loud confidence, and a dislike of authority.","zh":"这部电影歌颂了一种澳式“larrikinism”——大胆开玩笑、张扬自信，以及对权威的不买账。"},{"en":"His larrikinism got him in trouble at school when he kept teasing teachers.","zh":"他那种爱捣蛋的“larrikinism”让他在学校惹了麻烦，因为他总爱取笑老师。"}]}],"synonyms":["mischief","cheekiness","rebelliousness","rowdiness","anti-authoritarianism"],"phonetic":"/ˈlærɪkɪnɪzəm/","extraExplanation":["“larrikinism”主要用于澳大利亚英语，常与澳洲国家形象中的“爱开玩笑、反权威、讲义气但不太守规矩”的刻板印象相关。语气可褒可贬：褒义时接近“顽皮不羁、敢说敢做”；贬义时接近“痞气、闹事、无礼”。","词源上来自“larrikin”（19世纪澳洲用语，最初偏贬义，指街头游手好闲、惹事的年轻人），后来在文化叙事中逐渐被部分“浪漫化”。在写作中常见搭配：Australian larrikinism, a streak of larrikinism, celebrate/criticize larrikinism。"]}
{"word":"larrikins","summary":{"en":"“Larrikins” means mischievous or rowdy young people, especially in Australian English, often with a cheeky, likeable tone.","zh":"“larrikins”指顽皮、吵闹的年轻人；在澳大利亚英语中常带“调皮但讨喜”的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mischievous or rowdy young person; in Australia, often a cheeky but likeable troublemaker","zh":"（尤指澳大利亚英语）顽皮、爱闹事的年轻人；常带有“调皮但讨喜”的意味"},"examples":[{"en":"A group of larrikins were shouting and laughing outside the pub.","zh":"一群小混混在酒吧外面又喊又笑。"},{"en":"He’s a bit of a larrikin, but he has a good heart.","zh":"他有点顽皮爱闹，但心地不坏。"},{"en":"The film celebrates the larrikin spirit in Australian culture.","zh":"这部电影赞美了澳大利亚文化中的“痞帅/调皮不羁”的精神。"}]}],"synonyms":["rascals","troublemakers","rowdies","hooligans","mischief-makers"],"phonetic":"/ˈlærɪkɪn/","extraExplanation":["“larrikin”是澳大利亚很有代表性的词，语气可贬可褒：在正式语境里偏负面（吵闹、扰乱秩序），在口语或文化表达里也常带亲切感，指“爱开玩笑、反权威、但不坏”的人。","常见搭配：the larrikin spirit（不羁、爱挑战权威的精神）、a lovable larrikin（讨喜的顽皮鬼）。复数就是你写的 larrikins。"]}
{"word":"larriman","summary":{"en":"Larriman is most likely a rare surname used as a proper name.","zh":"Larriman 很可能是一个较少见的姓氏，用作专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare surname (family name); not a common English vocabulary word and usually used as a proper name.","zh":"一个较少见的姓氏（家族名）；不是常见英语词汇，通常作为专有名词使用。"},"examples":[{"en":"My professor’s last name is Larriman.","zh":"我教授的姓是 Larriman。"},{"en":"The book was written by Sarah Larriman.","zh":"这本书由 Sarah Larriman 所著。"}]}],"phonetic":"/ˈlærɪmən/","extraExplanation":["“Larriman”在现代英语中并不是常见词汇，更像是人名/姓氏的拼写。如果你是在某本书、电影字幕或名单里看到它，通常不需要“翻译”，而是按发音音译或直接保留原拼写。","如果你其实想查的是相似拼写（例如 Larrimore / Larriman / Harriman / Larimer），把上下文句子发我，我可以帮你确认最可能的词和含义。"]}
{"word":"larrup","summary":{"en":"“Larrup” is an informal word meaning to hit hard, or to defeat decisively; it can also mean to rush about noisily.","zh":"“larrup”是非正式用语，常指狠打/猛击，或（常与 on 连用）大胜；也可指脚步沉重地喧闹奔跑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal) to hit or beat someone or something hard; to thrash.","zh":"（非正式）狠狠地打；痛打；猛击。"},"examples":[{"en":"The coach said, “Don’t larrup the ball—control it.”","zh":"教练说：“别猛踢那球——要控制住。”"},{"en":"He got angry and started to larrup the door with his fist.","zh":"他生气了，开始用拳头猛捶门。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal, often with “on”) to defeat soundly; to beat by a large margin.","zh":"（非正式，常与 on 连用）大胜；把……打得落花流水。"},"examples":[{"en":"Our team larruped on the other side in the final.","zh":"我们队在决赛中把对方打得很惨。"},{"en":"They larruped the competition and won easily.","zh":"他们轻松碾压对手，赢得很容易。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal) to move quickly and noisily; to rush with heavy steps.","zh":"（非正式）（脚步沉重地）噔噔地快走/跑；喧闹地冲过去。"},"examples":[{"en":"The kids larruped down the stairs when they heard the ice-cream truck.","zh":"孩子们一听到冰淇淋车的声音，就噔噔噔地冲下楼。"}]}],"synonyms":["thrash","beat","whack","pummel","clobber","trounce"],"phonetic":"ˈlærəp","extraExplanation":["“larrup”多见于英国方言/口语（尤其是英格兰北部、苏格兰部分地区），语气很随意，正式写作中通常不用。","常见搭配：larrup someone (痛打某人)；larrup the ball/door (猛击某物)；larrup on someone (大胜某人)。"]}
{"word":"larruped","summary":{"en":"“Larruped” means “hit/thrashed hard,” or (informally) “did something with strong energy or force.”","zh":"“larruped”指“狠揍/痛打”，也可指（非正式）“用很大力气做某事、猛烈推进”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of larrup) to hit or beat someone/something hard; to thrash.","zh":"（larrup 的过去式/过去分词）狠揍；痛打；猛烈抽打。"},"examples":[{"en":"The bully larruped the smaller kid until a teacher stepped in.","zh":"那个霸凌者把小个子的孩子痛打一顿，直到老师出面制止。"},{"en":"The storm larruped the coast all night with heavy wind and rain.","zh":"暴风雨整夜猛烈袭击海岸，风雨交加。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) to do something with a lot of energy or force; to drive/push hard.","zh":"（非正式）用很大力气/劲头做某事；猛干；使劲推进。"},"examples":[{"en":"She larruped the ball into the outfield.","zh":"她把球用力击到外场。"},{"en":"He larruped the engine and sped off down the road.","zh":"他猛踩油门，沿路飞驰而去。"}]}],"synonyms":["thrashed","pummeled","beat up","battered","walloped"],"phonetic":"/ləˈrʌpt/","extraExplanation":["“larrup”属于较口语、带方言色彩的美式英语（在一些地区更常见），语气通常比较粗犷，常用于描写“狠狠打/猛烈冲击”。在较正式写作里，常用 beat/thrash/pummel（打），或 hit hard / pound / batter（猛烈冲击）来替换。"]}
{"word":"larruper","summary":{"en":"A dialect, informal noun meaning a very hard hitter (often in sports) or, less commonly, a person who beats others.","zh":"一个带方言色彩的非正式名词，常指（运动中）重击者/强棒打者；较少用来指殴打他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who hits very hard (especially in sports); a powerful hitter","zh":"（尤指体育中）重击者；强棒打者"},"examples":[{"en":"He was known as a real larruper at the plate, driving balls deep into the outfield.","zh":"他在打击区以“重炮手”著称，经常把球打到外野深处。"},{"en":"The coach wanted a larruper in the lineup to change the game with one swing.","zh":"教练希望阵容里有个强棒打者，能用一棒改变比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who beats or whips someone (dialect, informal; now less common)","zh":"（方言/非正式，较少用）殴打者；鞭打他人者"},"examples":[{"en":"In the old story, the bully was described as a larruper who scared the whole town.","zh":"在那个老故事里，恶霸被描写成一个动辄打人的家伙，吓得全镇人不敢惹。"},{"en":"The novel uses the word to show how rough the character’s world was.","zh":"小说用这个词来凸显人物所处环境的粗暴与野蛮。"}]}],"synonyms":["power hitter","slugger","hard-hitter","heavy hitter","bruiser"],"phonetic":"/ˈlærəpər/","extraExplanation":["“larruper”来自动词“larrup”（也常写作“larrop”），意思是“狠揍/痛打”或“猛击”。在美式英语里，它带有口语、地域色彩（常见于较老的文本或某些地方用法）。","在棒球等运动语境中，“larrup / larruper”常偏向积极含义：强调力量大、击球狠；但在一般语境里可能含暴力意味，使用时要看场合。","如果你是在某段文本里看到“larruper”，也可能是非标准拼写或排版误写；常见相关形式有：larrup（v.）、larruping（adj. “猛烈的”）。"]}
{"word":"larrupers","summary":{"en":"“Larrupers” means tough, forceful people—either hard hitters or very energetic workers (informal, especially in Australia/New Zealand).","zh":"“larrupers”指强悍有力的人：要么出手很重的狠角色，要么特别能干、很拼的人（非正式，尤见于澳新英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of larruper) A person who hits very hard; a strong fighter or heavy hitter (informal, chiefly Australian/New Zealand English).","zh":"（larruper 的复数）出手很重的人；强悍的打手/硬汉（非正式，多见于澳大利亚/新西兰英语）。"},"examples":[{"en":"Those two are real larrupers—don’t start a fight with them.","zh":"那两个人真是狠角色——别跟他们起冲突。"},{"en":"He was known as one of the larrupers on the local team.","zh":"他在当地球队里以“猛将”闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of larruper) An energetic, forceful person who works very hard (informal).","zh":"（larruper 的复数）干劲十足、做事很拼的人（非正式）。"},"examples":[{"en":"We need a couple of larrupers to finish this job before Friday.","zh":"我们需要几个能拼的狠人，才能在周五前把活干完。"},{"en":"They’re larrupers in the kitchen—service runs fast when they’re on.","zh":"他们在厨房里特别能干——他们一上岗，出餐就很快。"}]}],"synonyms":["heavy hitters","tough guys","hard workers","powerhouses","workhorses"],"phonetic":"/ˈlærəpərz/","extraExplanation":["“larruper”多见于澳新口语，带有一种“粗犷、豪爽、很能打/很能干”的色彩。它来自动词“larrup”，意思是“痛打、狠揍；猛烈地做某事”。在较正式的英语里，更常用“heavy hitter”“tough guy”“hard worker”等表达。"]}
{"word":"larruping","summary":{"en":"Larruping means either hitting/thrashing hard or (in some dialects) eating/drinking very greedily.","zh":"larruping 指（方言、口语）狠打/痛打，或（在部分用法中）狼吞虎咽地吃喝。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Informal, dialect) Beating or hitting someone/something hard; thrashing.","zh":"（非正式，方言）狠狠地打；痛打；鞭打。"},"examples":[{"en":"He came home with bruises after getting larruping by the older boys.","zh":"他被大一些的男孩痛打一顿后，带着淤青回了家。"},{"en":"The storm kept larruping the coast all night.","zh":"暴风雨整夜不停地猛烈袭击海岸。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal, dialect) Eating or drinking quickly and greedily; wolfing down.","zh":"（非正式，方言）狼吞虎咽地吃/喝；大口吞咽。"},"examples":[{"en":"They were larruping their food like they hadn’t eaten all day.","zh":"他们狼吞虎咽地吃着东西，好像一整天没吃过饭。"},{"en":"Stop larruping your drink—you’ll get a stomachache.","zh":"别那么猛灌饮料了——你会胃痛的。"}]}],"synonyms":["beating","thrashing","whipping","pounding","battering","wolfing down","devouring"],"phonetic":"/ˈlærəpɪŋ/","extraExplanation":["“larrup”多见于美国英语的口语/地区方言（尤其南部与乡村语境），语气较粗犷；在正式写作中通常会用 beat/thrash（痛打）或 devour/wolf down（狼吞虎咽）来替代。","用来形容自然力量时（如风雨“larruping”某地），带有“猛烈抽打、狠砸”的画面感，类似口语里的 pound / batter。"]}
{"word":"larrups","summary":{"en":"Larrups is an informal/dialect form meaning “beats/thrashes,” or it can be the plural of “larrup” (a hard beating).","zh":"larrups 为非正式/方言用法，常指“（他/它）狠打、痛揍”，也可作名词复数，表示“几顿痛打”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hit, beat, or thrash someone/something hard (informal, dialect)","zh":"（非正式/方言）狠打；痛揍；鞭打"},"examples":[{"en":"The older boys larruped him for taking the ball.","zh":"大一点的男孩因为他拿走了球而把他痛揍了一顿。"},{"en":"He larruped the rug to knock the dust out.","zh":"他用力拍打地毯把灰尘弄出来。"}]},{"partOfSpeech":"v.","definition":{"en":"to defeat decisively; to give someone a sound beating (informal)","zh":"（非正式）大败；把……打得落花流水"},"examples":[{"en":"Our team got larruped in the final game.","zh":"我们队在决赛被狠狠干了一顿（惨败）。"},{"en":"They larruped the competition by ten points.","zh":"他们以十分优势大胜对手。"}]},{"partOfSpeech":"n.","definition":{"en":"a hard beating; a thrashing (informal, dialect)","zh":"（非正式/方言）一顿痛打；狠揍"},"examples":[{"en":"He said the thief deserved a larrup.","zh":"他说那个小偷该挨一顿痛打。"}]}],"synonyms":["beat","thrash","pummel","whip","clobber","trounce"],"phonetic":"/ˈlærəp/","extraExplanation":["“larrup”多见于口语和地区用法（如美国南部/阿巴拉契亚地区、以及澳大利亚英语中偶尔可见），在正式写作里更常用 beat / thrash / pummel / defeat。","你输入的“larrups”通常是第三人称单数动词（He larrups…）或名词复数（two larrups）。"]}
{"word":"Larry","summary":{"en":"Larry is a common male name, often short for Lawrence.","zh":"Larry 是常见的英文男性名，常为 Lawrence 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, often a nickname for Lawrence","zh":"男性名字“拉里”，常作为“Lawrence（劳伦斯）”的昵称"},"examples":[{"en":"Larry is my coworker; he started last month.","zh":"拉里是我的同事；他上个月刚入职。"},{"en":"Her dad is named Lawrence, but everyone calls him Larry.","zh":"她爸爸叫劳伦斯，但大家都叫他拉里。"}]}],"synonyms":["Lawrence","Laurence"],"phonetic":"/ˈlæri/","extraExplanation":["“Larry”在英语国家（尤其是美国）是比较常见的男性名字，语气通常随和、口语化。","来源上多被视为“Lawrence / Laurence”的昵称；“Lawrence”来自拉丁语“Laurentius”，与“月桂（laurel）”相关，传统上带有“荣誉、胜利”的联想。","文化中常见人物：比如演员Larry David；文学/影视中也常用作普通、亲切的男性角色名。"]}
{"word":"larry","summary":{"en":"Larry is most commonly a male first name (often short for Lawrence). In some informal British usage, “a larry” can mean “a guy/fellow.”","zh":"Larry 最常见是男性名字（常为 Lawrence 的昵称）。在一些英式非正式用法里，“a larry”也可指“一个家伙/那人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name; also commonly used as a nickname for Lawrence or Laurence.","zh":"男性名字；也常用作 Lawrence / Laurence 的昵称。"},"examples":[{"en":"Larry is coming over after work.","zh":"拉里下班后会过来。"},{"en":"Her uncle Larry lives in Chicago.","zh":"她的拉里叔叔住在芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"A man (informal, mainly British English), sometimes used to address someone.","zh":"（非正式，主要英式英语）指“那个人/家伙”，有时用来当作对别人的称呼。"},"examples":[{"en":"That larry in the blue jacket cut in line.","zh":"那个穿蓝夹克的家伙插队了。"},{"en":"Oi, larry—watch where you’re going!","zh":"喂，那位——走路看着点！"}]}],"synonyms":["Lawrence (as the full name)","guy (BrE informal sense)","fellow (BrE informal sense)"],"phonetic":"/ˈlæri/","extraExplanation":["在美国英语里，Larry 几乎总是人名（例如喜剧演员 Larry David、篮球运动员 Larry Bird）。把 larry 当作“家伙/那人”的用法更偏英式、口语，而且有时带一点不耐烦或轻微贬义；在正式场合不建议使用。"]}
{"word":"Larry's","summary":{"en":"“Larry’s” usually means “belonging to Larry,” and it can also mean “Larry is/has” in informal contexts.","zh":"“Larry’s”通常表示“Larry的……”，在非正式语境中也可表示“Larry is/has”的缩写。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"The possessive form of the name “Larry,” meaning something belongs to or is connected with Larry.","zh":"名字“Larry”的所有格形式，表示“Larry的……”，即某物属于或与Larry有关。"},"examples":[{"en":"This is Larry’s jacket.","zh":"这是Larry的夹克。"},{"en":"We’re meeting at Larry’s house after class.","zh":"下课后我们在Larry家见。"},{"en":"I borrowed Larry’s notes for the test.","zh":"我借了Larry的笔记来准备考试。"}]},{"partOfSpeech":"other","definition":{"en":"In informal speech/writing, “Larry’s” can also be a contraction of “Larry is” or “Larry has,” depending on the context.","zh":"在非正式口语/书写中，“Larry’s”也可作缩写，表示“Larry is（Larry是/正在）”或“Larry has（Larry已经/拥有）”，需结合语境判断。"},"examples":[{"en":"Larry’s tired today. (= Larry is tired.)","zh":"Larry今天很累。（= Larry is tired.）"},{"en":"Larry’s been to New York twice. (= Larry has been...)","zh":"Larry去过纽约两次。（= Larry has been...）"}]}],"synonyms":["belonging to Larry","Larry is (informal)","Larry has (informal)"],"phonetic":"ˈlæɹiz","extraExplanation":["英语里’s 常见有两种功能：①表示所有格（Larry’s book）；②表示缩写（Larry’s = Larry is / Larry has）。判断方法：如果后面跟名词，多半是所有格；如果后面跟形容词、动词-ing、过去分词（tired / going / been），多半是 is/has 的缩写。"]}
{"word":"lars","summary":{"en":"Lars is mainly a Scandinavian male first name; it can also be a surname.","zh":"Lars 主要是一个北欧常见的男性名字；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in Scandinavia (especially Sweden, Norway, and Denmark).","zh":"男性名字，常见于斯堪的纳维亚地区（尤其是瑞典、挪威和丹麦）。"},"examples":[{"en":"Lars is from Norway, but he lives in the U.S. now.","zh":"Lars 来自挪威，但他现在住在美国。"},{"en":"I met a guy named Lars at the conference.","zh":"我在会议上认识了一个叫 Lars 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a surname (family name).","zh":"（较少见）姓氏。"},"examples":[{"en":"Ms. Lars will join the meeting at 3 p.m.","zh":"Lars 女士会在下午三点参加会议。"}]}],"synonyms":["Lawrence","Laurence"],"phonetic":"/lɑrz/","extraExplanation":["“Lars”通常被认为是拉丁名“Laurentius”（英语常见对应为 Lawrence / Laurence）的斯堪的纳维亚形式，含义与“月桂”（laurel，象征荣誉与胜利）有关。","在英语环境中，“Lars”一般保留原拼写与读音，属于较有北欧文化辨识度的名字。"]}
{"word":"larsenite","summary":{"en":"Larsenite is a rare mineral name used in mineralogy.","zh":"Larsenite 是矿物学中使用的罕见矿物名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (an arsenate) found in some ore deposits; used mainly as a scientific name in mineralogy.","zh":"一种罕见矿物（砷酸盐类），可见于某些矿床中；主要作为矿物学上的科学名称使用。"},"examples":[{"en":"Larsenite is a rare arsenate mineral reported from a few localities.","zh":"Larsenite（拉森石）是一种罕见的砷酸盐矿物，仅在少数地点有报道。"},{"en":"The sample was tentatively identified as larsenite based on its crystal habit and chemistry.","zh":"根据晶形与化学成分，该样品被初步鉴定为 larsenite。"}]}],"synonyms":["(no common synonyms; scientific mineral name)"],"phonetic":"/ˈlɑrsəˌnaɪt/","extraExplanation":["“Larsenite”属于矿物学命名，常以人名（多为地质/矿物学研究者的姓氏）加上后缀 -ite（表示“矿物”）构成。","该词在日常英语中几乎不使用，主要出现在矿物学论文、矿物目录或矿区报告中。"]}
{"word":"Lartin","summary":{"en":"“Lartin” is probably a misspelling of “Latin,” meaning the Latin language or relating to ancient Rome.","zh":"“Lartin” 很可能是 “Latin” 的拼写错误，意为“拉丁语”或“与古罗马有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(likely intended) relating to the language Latin or to ancient Rome.","zh":"（很可能想写的是）与拉丁语或古罗马有关的。"},"examples":[{"en":"She is taking a Latin class this semester.","zh":"她这学期在上拉丁语课。"},{"en":"Many Latin words are still used in law and medicine.","zh":"许多拉丁语词至今仍用于法律和医学领域。"}]},{"partOfSpeech":"n.","definition":{"en":"the Latin language, originally spoken in ancient Rome; a subject studied in school.","zh":"拉丁语：古罗马人最初使用的语言；也指学校里学习的科目。"},"examples":[{"en":"Latin influenced many modern European languages.","zh":"拉丁语影响了许多现代欧洲语言。"},{"en":"He can read simple Latin texts.","zh":"他能读一些简单的拉丁语文章。"}]}],"synonyms":["Roman","classical","Latinate"],"phonetic":"/ˈlætən/","extraExplanation":["你输入的 “Lartin” 常见于把 “Latin” 拼错了。如果你指的是人名（如 Martin/Lartin 作为昵称）或其他专有名词，请告诉我上下文。","大小写：Latin（大写）通常指“拉丁语/古罗马的”；latin（小写）有时在“拉丁字体/拉丁字母（Latin alphabet/script）”这类技术语境中出现，但日常写作多用大写。","相关文化：拉丁语常出现在格言与学术用语中，如 etc.（et cetera 等等）、i.e.（id est 即）、e.g.（exempli gratia 例如）等。"]}
{"word":"larum","summary":{"en":"“Larum” is an archaic word meaning an alarm (or to alarm), mostly seen in older literature; modern English usually uses “alarm.”","zh":"“larum”是古用词，意为“警报/警告”或“发出警报”，多见于旧文学作品；现代英语通常用“alarm”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) An alarm; a warning sound or signal, especially from a bell, drum, or shouting that alerts people to danger.","zh":"（古用）警报；警告的声音或信号，尤指钟声、鼓声或呼喊，用来提醒人们有危险。"},"examples":[{"en":"The watchman rang the larum to warn the town of a fire.","zh":"守夜人敲响警钟（larum），提醒城里的人起火了。"},{"en":"The soldiers sprang up at the larum of battle.","zh":"士兵们听到战斗的警报声（larum）便立刻跳起来。"}]},{"partOfSpeech":"v.","definition":{"en":"(Archaic) To raise an alarm; to call people to action by warning them of danger.","zh":"（古用）发出警报；通过警告危险来召集人们行动。"},"examples":[{"en":"They larumed the camp when they saw smoke on the horizon.","zh":"他们看到地平线上的烟后，便在营地里发出警报（larumed）。"},{"en":"The bells larumed the city before dawn.","zh":"黎明前钟声在城中响起，发出警报（larumed）。"}]}],"synonyms":["alarm","warning","alert","signal","call to arms"],"phonetic":"/ləˈrɑrm/","extraExplanation":["“larum”多见于较早期的英语文本，是“alarm”的旧拼写/旧说法，等于把 a- 这一前缀省略了。现代英语中通常用“alarm”。","在文学作品里（如莎士比亚时代的戏剧）常用“alarum”或“larum”表示“战斗警报/鼓声/号角声”，舞台指示里也可能出现，用来营造紧张、突发事件的氛围。"]}
{"word":"larums","summary":{"en":"“larums” is an archaic/literary word meaning “alarms,” especially in old plays and stage directions.","zh":"“larums”是古旧/文学用语，意思是“alarms（警报）”，常见于旧戏剧的舞台提示中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) alarms; loud warnings or sudden noises that signal danger or urgency.","zh":"（古旧用法）警报；警告危险或紧急情况的响声/信号。"},"examples":[{"en":"The camp was thrown into confusion by sudden larums in the night.","zh":"夜里突如其来的警报声让营地陷入混乱。"},{"en":"In old plays, you may read stage directions like “alarums” (sometimes spelled “larums”).","zh":"在旧戏剧中，你可能会看到类似“alarums”（有时也拼作“larums”）这样的舞台提示。"}]}],"synonyms":["alarms","warnings","alerts"],"phonetic":"/ləˈrʌmz/","extraExplanation":["“larums”多见于古英语或文学/戏剧语境，是“alarms”的旧式拼写或变体。最常被提到的用法来自莎士比亚等戏剧的舞台说明，如“Alarums and excursions”（意为战斗的喧嚣、冲突与追逐的场面）。现代日常英语几乎不用“larums”，一般直接用“alarm(s)”。"]}
{"word":"larunda","summary":{"en":"Larunda is a Roman mythological nymph (also called Lara) linked to a punishment for excessive speech and later to silence (Tacita).","zh":"Larunda 是罗马神话中的宁芙（又名 Lara），因多嘴而受罚，后来与“沉默”（Tacita）形象相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Roman mythology, a nymph (also called Lara) who was punished for talking too much; she later became associated with silence and was worshiped as the goddess Tacita (\"the Silent One\").","zh":"罗马神话中的一位宁芙（也叫 Lara），因多嘴泄密而受罚；后来与“沉默”联系在一起，并被视为与女神 Tacita（“沉默者”）相关。"},"examples":[{"en":"In Ovid’s stories, Larunda is punished for speaking openly about Jupiter’s secrets.","zh":"在奥维德的故事里，Larunda 因公开说出朱庇特的秘密而受到惩罚。"},{"en":"Some writers connect Larunda with Tacita, a figure linked to silence and keeping harmful speech away.","zh":"一些作者把 Larunda 与 Tacita 联系起来，后者象征沉默与阻止恶意言语。"}]}],"synonyms":["Lara","Tacita","Dea Tacita"],"phonetic":"/ləˈrʊndə/","extraExplanation":["Larunda 多见于古罗马文学与神话学讨论，最常被提到的来源之一是奥维德（Ovid）的《节日记》（Fasti）。故事中她因“说出不该说的话”而被割去舌头或失语，后来与“沉默/缄口”的宗教象征相连。","你也可能会见到她的另一个名字 Lara；而 Tacita（或 Dea Tacita，“沉默女神”）是与她相关联的称呼。不同版本在细节上会有差异，但核心主题常与“言语的力量与代价”有关。"]}
{"word":"larus","summary":{"en":"Larus is the scientific genus name used for many gulls.","zh":"Larus 是许多海鸥的科学属名（鸥属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for many gulls (seabirds) in biological classification.","zh":"（生物分类学）鸥属：许多海鸥的一个科学属名。"},"examples":[{"en":"In older field guides, several common gulls were listed under the genus Larus.","zh":"在较早的鸟类图鉴中，几种常见海鸥被归在鸥属（Larus）下。"},{"en":"The researcher compared Larus species found along the coast.","zh":"研究人员比较了沿海发现的鸥属（Larus）物种。"}]}],"synonyms":["gull (general term)","gull genus (context)"],"phonetic":"/ˈlɛrəs/","extraExplanation":["“Larus”是拉丁化的学名，用在生物学的双名法与分类系统中（属名首字母大写、斜体书写：Larus）。日常英语里更常直接说“gull（海鸥）”。","在现代分类中，一些过去归入Larus的海鸥后来被重新分到其他属；不同版本的鸟类名录/图鉴可能会有差异。"]}
{"word":"larva","summary":{"en":"A larva is a young, developing form of an animal—especially an insect—that will change into its adult form; it can also mean an early, undeveloped stage of something in a figurative sense.","zh":"Larva 指动物（尤指昆虫）的幼体/幼虫，会经历变态成长；也可比喻事物处于早期、尚未成熟的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young form of an animal that looks very different from the adult and will change shape as it grows (common in insects); for example, a caterpillar is a butterfly’s larva","zh":"（动物的）幼体；（尤指昆虫的）幼虫，外形常与成体很不同，成长过程中会发生形态变化（如毛毛虫是蝴蝶的幼虫）"},"examples":[{"en":"A caterpillar is the larva of a butterfly or moth.","zh":"毛毛虫是蝴蝶或飞蛾的幼虫。"},{"en":"Mosquito larvae live in still water.","zh":"蚊子的幼虫生活在静水中。"},{"en":"The larva will turn into an adult after metamorphosis.","zh":"幼体在变态之后会变成成体。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) an early stage of development of an idea, project, or organization","zh":"（比喻）某个想法、项目或组织的早期萌芽阶段"},"examples":[{"en":"The plan was still in the larva stage, so nothing was decided.","zh":"这个计划还处在萌芽阶段，所以什么都没定下来。"},{"en":"In the larva of the movement, only a few people supported it.","zh":"在这场运动的早期阶段，只有少数人支持。"}]}],"synonyms":["immature form","young stage","caterpillar (specific example)","grub (some insect larvae)"],"phonetic":"/ˈlɑrvə/","extraExplanation":["“Larva”来自拉丁语，原意与“面具/鬼魂”有关，后来在生物学里用来指“尚未成形的阶段”。","常见搭配：larval stage（幼虫期/幼体期）、larvae（复数）。注意复数常用拉丁式“larvae /ˈlɑrvi/”（写作 larvae）。"]}
{"word":"larvacea","summary":{"en":"Larvacea are tiny free-swimming marine tunicates (appendicularians) that keep a larva-like body and filter food using a mucus “house.”","zh":"幼形纲是小型自由游动的海洋被囊动物（尾海鞘类），终生保持幼体样形态，并用黏液“屋”滤食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of small, free-swimming marine tunicates (also called appendicularians) that keep a tadpole-like body and live inside a self-made mucus “house” used for filtering food from seawater","zh":"幼形纲（也称“尾海鞘类/尾海鞘亚纲”）：一类体型很小、自由游动的海洋被囊动物，终生保持类似蝌蚪的形态，并会分泌黏液“屋”来过滤海水取食"},"examples":[{"en":"Larvacea are important filter feeders in the ocean food web.","zh":"幼形纲在海洋食物网中是重要的滤食者。"},{"en":"A larvacean lives in a mucus “house” that traps tiny particles.","zh":"尾海鞘会住在能捕捉微小颗粒的黏液“屋”里。"}]}],"synonyms":["appendicularians","larvaceans"],"phonetic":"/lɑrˈveɪsiə/","extraExplanation":["“Larvacea”来自拉丁语词根 larva（幼体），因为它们成年后仍保留类似幼体的体态；在科普与教材中也常用更直观的名称“appendicularians（尾海鞘类）”。","它们分泌的黏液过滤结构（常被称为“house/屋”）会频繁更换与脱落，沉入海底后可能帮助把碳输送到深海，因此在海洋碳循环研究中也常被提到。"]}
{"word":"larvae","summary":{"en":"Larvae are the young, non-adult forms of many animals (especially insects); it is the plural of larva.","zh":"larvae 指许多动物（尤其昆虫）的幼体阶段，是 larva（幼虫）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural form of “larva”: the young stage of many animals (especially insects) after hatching and before becoming an adult.","zh":"“larva（幼虫）”的复数：许多动物（尤其是昆虫）在孵化后、变成成体之前的幼体阶段。"},"examples":[{"en":"Mosquito larvae live in standing water.","zh":"蚊子的幼虫生活在积水中。"},{"en":"The scientist collected larvae to study how they develop into adults.","zh":"科学家采集幼虫来研究它们如何发育成成体。"},{"en":"Frog larvae are called tadpoles.","zh":"青蛙的幼体叫蝌蚪。"}]}],"synonyms":["immature forms","young (insects)","caterpillars (some larvae)"],"phonetic":"/ˈlɑrˌvi/","extraExplanation":["“Larvae”读起来像“LAR-vee”，是“larva”的复数；单数是“a larva”，复数是“larvae”。","常见搭配：larvae + of + 名词（the larvae of butterflies 蝴蝶的幼虫）；也常用于科普语境，如 aquatic larvae（水生幼虫）、insect larvae（昆虫幼虫）。","词源上与拉丁语“larva”（面具、鬼魂的形象）有关，表示幼体阶段像“隐藏在面具下的形态”，还未显出成体的样子。"]}
{"word":"larval","summary":{"en":"Larval means “related to the larva (young) stage of an animal, especially insects.”","zh":"larval 指“与动物的幼体阶段（尤指昆虫幼虫期）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the larva stage of an animal (especially insects), before it becomes an adult.","zh":"与幼体（尤指昆虫的幼虫期）有关的；处于成体之前阶段的。"},"examples":[{"en":"Larval mosquitoes live in water before they can fly.","zh":"蚊子的幼虫生活在水中，之后才会飞。"},{"en":"The scientist studied larval development under a microscope.","zh":"科学家在显微镜下研究幼体的发育过程。"},{"en":"Many frogs start life in a larval form (tadpoles).","zh":"许多青蛙一开始以幼体形态（蝌蚪）生活。"}]}],"synonyms":["immature","juvenile","insect-larva-related"],"phonetic":"/ˈlɑrvəl/","extraExplanation":["“larval”来自拉丁语 larva，原意与“面具/幽灵”有关，后来在生物学中专指“幼体阶段”。在日常英语里，它最常见于科学、自然纪录片或医学语境（如 larval stage, larval form, larval development）。","常见搭配：larval stage（幼体阶段）、larval form（幼体形态）、larval development（幼体发育）。与之对应的词：adult（成体）、pupal（蛹期的，常用于昆虫）。"]}
{"word":"larvalia","summary":{"en":"Larvalia: larvaceans/appendicularians—planktonic marine tunicates that keep a larval-like shape as adults.","zh":"Larvalia：幼形海鞘（尾海鞘）类——外海浮游生活、成体仍呈幼体样（蝌蚪状）体形的海洋被囊动物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (class) of small marine tunicates also called larvaceans (appendicularians), which keep a tadpole-like body form as adults and live in the open ocean.","zh":"（动物学）尾海鞘纲／幼形海鞘类：一类小型海洋被囊动物（也叫幼形海鞘、尾海鞘），成体仍保留“蝌蚪状”的体形，生活在外海浮游环境中。"},"examples":[{"en":"Larvalia are planktonic tunicates that build delicate “houses” from mucus to filter food.","zh":"Larvalia 是浮游生活的被囊动物，会用黏液建造精细的“房子”来过滤取食。"},{"en":"In marine biology, Larvalia are often studied because they can strongly influence carbon cycling in the ocean.","zh":"在海洋生物学中，人们常研究 Larvalia，因为它们会显著影响海洋中的碳循环。"}]}],"synonyms":["Larvacea","appendicularians","larvaceans"],"phonetic":"lɑrˈveɪliə","extraExplanation":["“Larvalia”在现代分类与文献中常被“Larvacea”或“Appendicularia（尾海鞘类）”取代或并用；不同教材/数据库可能采用不同的级别（如“纲”或“目”）与名称。学习时可把它理解为“幼形海鞘/尾海鞘”这一类群的旧称或别称。"]}
{"word":"larvaria","summary":{"en":"“Larvaria” is the plural form of “larvarium,” meaning places or containers used to raise larvae for research or breeding.","zh":"“Larvaria”是“larvarium”的复数，指用于饲养、培育幼虫的容器或场所（多用于科研语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"containers, rooms, or facilities used to keep and raise larvae (especially insects) for study or breeding; plural of “larvarium.”","zh":"用于饲养、培育幼虫（尤指昆虫幼虫）以便研究或繁殖的容器、房间或设施；为“larvarium”的复数形式。"},"examples":[{"en":"The lab cleaned the larvaria after each batch of mosquito larvae was counted.","zh":"实验室在每批蚊子幼虫计数完成后都会清洗这些幼虫饲养容器。"},{"en":"Researchers used separate larvaria to prevent the larvae from mixing between species.","zh":"研究人员使用分开的幼虫饲养设施，以避免不同物种的幼虫混在一起。"}]}],"synonyms":["larvariums","larval rearing containers","rearing chambers"],"phonetic":"/lɑrˈvɛəriə/","extraExplanation":["这是一个较少见的科研用词，常出现在昆虫学、生态学或水产/蚊媒研究的语境中。","词源上与拉丁语 larva（幼虫）有关；英语里更常见的相关词是 larva（幼虫）、larval（幼虫的），以及单数形式 larvarium（幼虫饲养器/饲养室）。","如果你在日常英语中想表达“幼虫饲养的容器/房间”，也可以说“larval rearing container/room”。"]}
{"word":"larvarium","summary":{"en":"A larvarium is a container or enclosure for raising larvae under controlled conditions.","zh":"larvarium 指用于在可控条件下饲养、培育幼虫的容器或饲养箱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container or enclosure used to keep and raise larvae (for example, insect larvae) in a controlled way.","zh":"用于饲养、培育幼虫（例如昆虫幼虫）的容器或饲养箱（通常用于可控环境）。"},"examples":[{"en":"The researchers kept mosquito larvae in a larvarium to study their growth.","zh":"研究人员把蚊子幼虫养在幼虫饲养箱里，以研究它们的生长。"},{"en":"Clean water and stable temperature are important in a larvarium.","zh":"幼虫饲养箱里保持清洁的水和稳定的温度很重要。"}]}],"synonyms":["larval rearing container","rearing chamber","breeding tank (for larvae)"],"phonetic":"/lɑrˈvɛriəm/","extraExplanation":["词源上可拆为 larva（幼虫）+ -arium（表示“场所/容器”的后缀，如 aquarium“水族箱”、terrarium“生态缸”）。因此 larvarium 直观上就是“养幼虫的地方/容器”。","该词多见于生物学、昆虫学与实验室语境；日常英语里更常用的说法是 “rearing container/tank (for larvae)” 或直接说 “a container to raise larvae”。"]}
{"word":"larvariums","summary":{"en":"Larvariums are containers or setups used to raise insect larvae for research or breeding.","zh":"Larvariums 指用于饲养、培育昆虫幼虫的容器或装置（larvarium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of larvarium: containers or special setups used to keep and raise insect larvae (and sometimes other small aquatic organisms) for study or breeding.","zh":"larvarium 的复数：用于饲养、培育昆虫幼虫（有时也指其他小型水生幼体）以便研究或繁殖的容器或专用装置。"},"examples":[{"en":"The lab cleaned all the larvariums before starting the next mosquito experiment.","zh":"实验室在开始下一轮蚊子实验前，把所有的幼虫饲养器都清洗了。"},{"en":"Each larvarium was labeled with the species name and the hatching date.","zh":"每个幼虫饲养器都贴有物种名称和孵化日期的标签。"}]}],"synonyms":["larval rearing containers","rearing tanks","breeding containers"],"phonetic":"/lɑrˈvɛriəm/","extraExplanation":["“larvarium”常见于昆虫学（entomology）或公共卫生研究（例如蚊媒疾病研究）语境，指专门用来养幼虫的容器/装置。日常英语里不算常用词，更常见的说法可能是 “larval rearing container/tank”。","词形方面：英文中通常用规则复数加 -s 形成 “larvariums”。在更偏学术或拉丁化的写法里，有时也会见到不太常用的拉丁复数形式（如 “larvaria”），但实际使用频率较低。"]}
{"word":"larvas","summary":{"en":"Larvas is a plural form of larva: an insect’s early stage (like a caterpillar), and it can also mean an early, not-yet-developed stage of something.","zh":"Larvas 是 larva 的复数形式：指昆虫等的幼虫阶段（如毛毛虫），也可比喻指事物尚未成熟的早期阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the young, early form of an insect (or some other animals) that looks very different from the adult and later changes into it","zh":"（昆虫等的）幼虫；与成体外形差异很大，之后会蜕变成成体的早期形态"},"examples":[{"en":"A caterpillar is the larva of a butterfly.","zh":"毛毛虫是蝴蝶的幼虫。"},{"en":"The larvae live in water until they become adults.","zh":"这些幼虫在水中生活，直到长成成体。"},{"en":"Mosquito larvae can grow quickly in standing water.","zh":"蚊子幼虫在积水中会很快生长。"}]},{"partOfSpeech":"adj.","definition":{"en":"a very early stage of development of something, before it becomes fully formed","zh":"（比喻）事物的早期阶段；尚未成熟的雏形"},"examples":[{"en":"The idea was still in its larval stage.","zh":"这个想法仍处在萌芽阶段。"},{"en":"In the larval form of the plan, nothing was decided yet.","zh":"在计划的早期雏形阶段，还没有做出任何决定。"}]}],"synonyms":["grub","caterpillar","maggot","immature stage","early stage"],"phonetic":"/ˈlɑrvə/","extraExplanation":["“larvas”是“larva”的复数形式；在英文里更常见的复数拼写是“larvae”（读作/ˈlɑrviː/），尤其在生物学语境中更正式。“larvas”也能用，但通常更口语或非专业。","词源上，“larva”来自拉丁语，原意与“面具/幽灵”有关，后来引申为“被包裹、尚未显露真形的阶段”，这也解释了它为何常被用作比喻。"]}
{"word":"larvate","summary":{"en":"Larvate means “masked or disguised,” and more rarely “larval” in biology.","zh":"Larvate 意为“戴面具的/伪装的”，在生物学中较少见地可指“幼虫的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) masked; disguised; hidden under an outward appearance.","zh":"（正式用语）戴着面具的；伪装的；被外表掩盖的。"},"examples":[{"en":"Her larvate hostility appeared as polite small talk.","zh":"她把潜在的敌意伪装成礼貌的寒暄。"},{"en":"The novel follows a larvate criminal who seems harmless in public.","zh":"这部小说描写了一名伪装成无害公众形象的罪犯。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, rare) relating to a larva or the larval stage; larval.","zh":"（生物学，较少见）与幼虫有关的；幼虫期的。"},"examples":[{"en":"The study compared larvate forms with adult insects.","zh":"这项研究比较了幼虫形态与成虫。"}]}],"synonyms":["masked","disguised","concealed","hidden","larval"],"phonetic":"/ˈlɑr.veɪt/","extraExplanation":["“larvate”源自拉丁语 larva，原意为“面具、幽灵”，后来也可指“幼虫”。因此它既能表示“戴面具/伪装”，也能在生物学语境中表示“幼虫的”。在现代日常英语里比较少见，更常用的替代词是 masked、disguised、hidden 或 larval。"]}
{"word":"larvated","summary":{"en":"Larvated means “masked or hidden,” often used in formal or literary writing.","zh":"Larvated 意为“戴面具的、被掩盖的/伪装的”，多见于正式或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal, rare) Masked; concealed; hidden under an outer appearance.","zh":"（正式、少见）戴着面具的；伪装的；被外表掩盖的。"},"examples":[{"en":"Her calm smile was larvated anger.","zh":"她平静的微笑下掩藏着愤怒。"},{"en":"The proposal’s true purpose was larvated in polite language.","zh":"这个提案的真正目的被客气的措辞掩盖了。"},{"en":"In the story, the thief moves through the city in larvated identity.","zh":"在故事里，小偷以伪装的身份在城中行动。"}]}],"synonyms":["masked","hidden","concealed","disguised","covert"],"phonetic":"/lɑrˈveɪtɪd/","extraExplanation":["“larvated”来自拉丁语 larva，意思是“面具/鬼魂/幽灵般的形象”，后来引申出“伪装、隐藏”的含义。它是很书面、偏文学的词，日常英语更常用 masked / hidden / disguised / covert。","注意不要和 larva（昆虫的“幼虫”）混淆：拼写相近但常见含义不同。这里的“larvated”主要来自“面具”的词源。"]}
{"word":"larve","summary":{"en":"“Larve” is usually intended to mean “larva,” the immature stage of an insect.","zh":"“larve”通常是指“larva（幼虫）”，即昆虫的幼年阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “larva”: the young form of an insect (or other animal) that looks very different from the adult and will later change shape (metamorphose).","zh":"多半是“larva（幼虫）”的拼写错误：昆虫（或其他动物）的幼年形态，外形与成体很不同，之后会经历变态（如化蛹）再变成成体。"},"examples":[{"en":"A caterpillar is the larva of a butterfly.","zh":"毛毛虫是蝴蝶的幼虫。"},{"en":"The mosquito larva lives in water before it becomes an adult.","zh":"蚊子的幼虫在变成成虫之前生活在水里。"},{"en":"Scientists studied the larva under a microscope.","zh":"科学家在显微镜下观察幼虫。"}]}],"synonyms":["larva","immature form","juvenile stage"],"phonetic":"/ˈlɑrvə/","extraExplanation":["“Larve”在英语里不常见；标准拼写是“larva”（单数）。它的复数是“larvae”（读音常见为 /ˈlɑrviː/，拼写变化要特别记）。","“Larva”常用于生物学语境；日常里也会说“caterpillar（毛毛虫）”“maggot（蛆）”等更具体的幼虫名称。"]}
{"word":"larvi","summary":{"en":"“Larvi” is not standard English; it likely means “larvae,” the plural of “larva” (an animal’s/insect’s immature stage).","zh":"“larvi”不是标准英语；很可能指“larvae”，即“larva（幼虫/幼体）”的复数。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling of “larvae,” the plural form of “larva.”","zh":"不是标准英语单词；很可能是“larvae（larva 的复数）”的拼写错误。"},"examples":[{"en":"I think you meant “larvae,” the plural of “larva.”","zh":"我想你想写的是“larvae”，也就是“larva”的复数。"},{"en":"Mosquito larvae live in standing water.","zh":"蚊子的幼虫生活在积水中。"}]},{"partOfSpeech":"n.","definition":{"en":"“Larvae” (plural noun): the early, immature stage of an insect or other animal that later changes form (for example, a caterpillar before becoming a butterfly).","zh":"“Larvae”（复数名词）：昆虫或其他动物的幼体阶段，之后会发生形态变化（例如毛毛虫变成蝴蝶前的阶段）。"},"examples":[{"en":"The biologist collected larvae from the pond for study.","zh":"生物学家从池塘里采集幼虫来研究。"},{"en":"These larvae will develop into adult beetles.","zh":"这些幼虫将发育成成虫甲虫。"},{"en":"The fish feed on insect larvae near the surface.","zh":"鱼会在水面附近捕食昆虫幼虫。"}]}],"synonyms":["immature form","young (stage)","grubs (some insects)"],"phonetic":"/ˈlɑrviː/","extraExplanation":["“Larva”的复数是“larvae”，读音结尾是 /viː/（像“vee”）。很多学习者会把它拼成 *larvi*，因为在拉丁来源词里 -a 变 -ae 的复数变化不太直观。","常见搭配：mosquito larvae（蚊幼虫）、insect larvae（昆虫幼虫）、larval stage（幼体阶段）。"]}
{"word":"larvicidal","summary":{"en":"Larvicidal means “able to kill larvae,” especially insect larvae like mosquitoes.","zh":"Larvicidal 指“能杀死幼虫的”，常用于蚊子等昆虫幼虫的防治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to kill larvae (especially the immature stage of insects such as mosquitoes).","zh":"能杀死幼虫的（尤指蚊子等昆虫的未成熟阶段）。"},"examples":[{"en":"Larvicidal treatments are used to reduce mosquito populations before they become adults.","zh":"杀幼虫处理用于在蚊子变成成虫之前降低其数量。"},{"en":"The city added a larvicidal product to standing water in storm drains.","zh":"该市在雨水下水道的积水中投放了杀幼虫药剂。"}]}],"synonyms":["larva-killing","larvae-killing"],"phonetic":"/ˌlɑr.vəˈsaɪ.dəl/","extraExplanation":["“larvicidal”常见于公共卫生、环境科学与病媒控制（vector control）领域，尤其与登革热、疟疾等蚊媒疾病防治有关。","词形构成：larva（幼虫）+ -cidal（杀…的），类似的词还有 insecticidal（杀虫的）、herbicidal（除草的）、bactericidal（杀菌的）。","实际应用中，“larvicidal”可指化学药剂（如某些杀幼虫剂）或生物防治方式（如以细菌制剂等方式专门针对幼虫阶段），强调“在成虫出现之前”控制虫害。"]}
{"word":"larvicide","summary":{"en":"Larvicide is a substance used to kill insect larvae, especially mosquito larvae.","zh":"Larvicide 指用于杀死昆虫幼虫（尤指蚊幼虫）的药剂或制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical or biological agent used to kill insect larvae (especially mosquito larvae)","zh":"杀幼虫剂；用于杀死昆虫幼虫（尤指蚊虫幼虫）的化学或生物制剂"},"examples":[{"en":"The city applied a larvicide to standing water to reduce mosquitoes.","zh":"市政府在积水中投放杀幼虫剂，以减少蚊子数量。"},{"en":"Using larvicide can help prevent dengue outbreaks by stopping mosquitoes before they mature.","zh":"使用杀幼虫剂可以在蚊子成熟前加以控制，从而帮助预防登革热暴发。"}]}],"synonyms":["larval insecticide","mosquito larvicide","larval control agent"],"phonetic":"/ˈlɑrvəˌsaɪd/","extraExplanation":["词源上由 larva（幼虫）+ -cide（“杀死……的东西/药剂”，如 insecticide 杀虫剂、herbicide 除草剂）组成。","在公共卫生语境中常与 mosquito control（蚊虫防治）一起出现；常见做法是处理积水，因为蚊幼虫多在静水中生长。","有些杀幼虫剂是“生物制剂”（如某些微生物来源的制剂），相对更有针对性；但具体使用需遵循当地环保与卫生部门指南。"]}
{"word":"larvicolous","summary":{"en":"Larvicolous means “vole-related” in zoology/ecology.","zh":"larvicolous 在动物学/生态学中指“与田鼠（vole）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Relating to, characteristic of, or living like voles (animals in the vole/field-mouse group).","zh":"（动物学）与田鼠（vole）有关的；具有田鼠特征的；像田鼠那样生活的。"},"examples":[{"en":"The researchers found larvicolous rodents in the grassland habitat.","zh":"研究人员在草原栖息地发现了与田鼠相关的啮齿动物。"},{"en":"Owls often hunt larvicolous mammals in open fields at night.","zh":"猫头鹰常在夜间到开阔田野捕食与田鼠相关的小型哺乳动物。"}]}],"synonyms":["arvicolous","arvicoline","vole-related"],"phonetic":"/ˌlɑɹˈvɪkəˌləs/","extraExplanation":["这个词很少见，通常出现在动物学/生态学写作中，用来概括“田鼠类（vole/field vole）相关”的物种、习性或生态环境。","有时你会看到更常用的形式 arvicolous（同样指“田鼠类的”），因为它来自拉丁词根 Arvicola（田鼠属名/田鼠相关的分类名称）。如果你是在论文或书目里遇到 larvicolous，也可能是变体写法或拼写差异。"]}
{"word":"larviform","summary":{"en":"Larviform means “larva-like in form,” mainly used in scientific contexts.","zh":"larviform 意为“呈幼虫形态的”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form of a larva; larva-like in shape or structure (often used in biology and entomology).","zh":"幼虫形的；呈幼虫形态的（常用于生物学、昆虫学语境）。"},"examples":[{"en":"Some insects have a larviform female that looks more like a grub than an adult insect.","zh":"有些昆虫的雌虫呈幼虫形态，看起来更像蛴螬而不是成虫。"},{"en":"The researcher described the animal as larviform, with a soft body and reduced limbs.","zh":"研究者将这种动物描述为幼虫形的，身体柔软且四肢退化。"}]}],"synonyms":["larva-like","grub-like","vermiform"],"phonetic":"/ˈlɑr.vəˌfɔrm/","extraExplanation":["词源上可拆为 larvi-（larva，幼虫）+ -form（形状）+ -形容词后缀 -iform（“……形的”）。在科学写作里常用来强调“外形像幼虫”，不一定表示它真的是幼虫阶段。","常见近义表达有 larva-like（像幼虫的）或 grub-like（像蛴螬的）；但 larviform 更偏正式、学术。"]}
{"word":"larvigerous","summary":{"en":"Larvigerous describes an animal that is carrying larvae.","zh":"larvigerous 指“带幼虫的/携带幼体的”（偏生物学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Carrying or bearing larvae; having larvae attached or contained.","zh":"（生物）带幼虫的；携带/含有幼体的（尤用于昆虫等）。"},"examples":[{"en":"The researchers collected larvigerous female mosquitoes for the lab study.","zh":"研究人员采集了带幼虫的雌蚊用于实验室研究。"},{"en":"A larvigerous crab was kept in a separate tank to protect the young.","zh":"一只带幼体的螃蟹被单独饲养在一个水箱里以保护幼体。"}]}],"synonyms":["larva-bearing","carrying larvae","with larvae","ovigerous (related: bearing eggs)"],"phonetic":"/lɑrˈvɪdʒərəs/","extraExplanation":["这是一个非常少见、偏学术的形容词，多见于动物学/昆虫学论文或标本记录。日常英语通常会说 “carrying larvae / with larvae / gravid (pregnant, for eggs)” 等，更常用、也更容易理解。","词源上可拆为 larva（幼虫）+ -gerous（“携带……的”，来自拉丁语 gerere “携带”）。同类词还有 ovigerous（抱卵的/携卵的）。"]}
{"word":"larvikite","summary":{"en":"Larvikite is a Norwegian feldspar-rich igneous rock often used as a decorative stone.","zh":"拉尔维克岩是产自挪威、富含长石的火成岩，常用于装饰性石材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coarse-grained igneous rock (a type of monzonite/syenite) rich in feldspar, originally identified near Larvik, Norway; it is often used as an ornamental building stone.","zh":"拉尔维克岩（Larvikite）：一种粗粒的火成岩（常被归为富长石的二长岩/正长岩一类），最早在挪威拉尔维克地区被识别；常用作装饰性建筑石材。"},"examples":[{"en":"The lobby’s wall panels were made of polished larvikite, showing a blue-gray shimmer.","zh":"大堂的墙面板使用了抛光的拉尔维克岩，呈现出蓝灰色的闪光。"},{"en":"Geologists sampled larvikite near Larvik to study the area’s intrusive rocks.","zh":"地质学家在拉尔维克附近采集拉尔维克岩样品，以研究该地区的侵入岩。"}]}],"synonyms":["igneous rock","monzonite","syenite","ornamental stone"],"phonetic":"/ˈlɑrvɪˌkaɪt/","extraExplanation":["“Larvikite”这个名字来自挪威城镇Larvik（拉尔维克），属于典型的地名命名岩石。","它常被商业上称作“蓝珍珠（Blue Pearl）”之类的装饰石材名称（不同产地/品级会有不同商品名）。","学习时可把它理解为“挪威产、带蓝灰色闪光效果的装饰性火成岩”，在建筑与室内设计语境里更常见。"]}
{"word":"larviparous","summary":{"en":"Larviparous describes animals whose eggs hatch inside the parent, so they give birth to live young.","zh":"larviparous 指卵在母体内孵化、因而产出活体幼体的“卵胎生”繁殖方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing live young from eggs that hatch inside the parent’s body (the embryos develop in eggs retained internally rather than being laid outside).","zh":"卵胎生的；卵在母体内孵化后产出活体幼体（胚胎在母体内保留的卵中发育，而不是把卵产到体外）。"},"examples":[{"en":"Some sharks are larviparous, giving birth to live young after the eggs hatch inside the mother.","zh":"有些鲨鱼是卵胎生的，卵在母体内孵化后再产下活体幼鲨。"},{"en":"The scientist described the species as larviparous rather than egg-laying.","zh":"科学家把这种物种描述为卵胎生，而不是产卵型。"}]}],"synonyms":["ovoviviparous"],"phonetic":"/ˌlɑrˈvɪpərəs/","extraExplanation":["“larviparous”常见于动物学/生物学文献，用来说明繁殖方式。它与“oviparous（卵生）”和“viviparous（胎生）”并列比较：卵生=把卵产到体外发育；胎生=胚胎在母体内直接发育并通过胎盘等结构获得营养；卵胎生=卵在母体内孵化，主要营养来自卵黄。","词源上可拆解为 larvi-（幼体/幼虫）+ -parous（生产的）。不过在现代用法里，它指的是“产出已孵化的幼体/活体幼体”的繁殖方式，而不是特指“幼虫”。"]}
{"word":"larviposit","summary":{"en":"Larviposit means to deposit or give birth to live larvae rather than laying eggs, a term mainly used in entomology.","zh":"Larviposit 指“产幼虫/释放活幼虫（而非产卵）”，主要用于昆虫学等生物学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of an insect or other animal) to deposit or give birth to living larvae (instead of laying eggs).","zh":"（昆虫或其他动物）产下并释放活的幼虫（而不是产卵）。"},"examples":[{"en":"Some flesh flies larviposit directly onto meat, so their larvae begin feeding immediately.","zh":"一些麻蝇会直接在肉上产幼虫，因此幼虫会立刻开始取食。"},{"en":"The researcher observed the female fly larvipositing near the wound.","zh":"研究人员观察到雌蝇在伤口附近产幼虫。"}]},{"partOfSpeech":"vt.","definition":{"en":"To place or deposit larvae in a particular location.","zh":"把幼虫放置/释放在某个特定位置。"},"examples":[{"en":"Mosquitoes do not larviposit; they lay eggs on water.","zh":"蚊子不会产幼虫；它们会把卵产在水面上。"},{"en":"These parasites larviposit on a host so the young can enter quickly.","zh":"这些寄生虫会在宿主体表产幼虫，让幼体能迅速进入体内。"}]}],"synonyms":["give birth to larvae","deposit larvae","larviposition (noun form)","larval deposition"],"phonetic":"/ˌlɑr.vɪˈpɑ.zɪt/","extraExplanation":["“larviposit”是生物学/昆虫学里的专业动词，来自拉丁语词根：larva（幼虫）+ posit/ponere（放置）。日常英语里更常见的是名词“larviposition”（产幼虫）或用描述性表达如“give birth to larvae”。","它常用来对比“oviposit”（产卵）。例如很多苍蝇会larviposit，而蚊子通常是oviposit。"]}
{"word":"larviposition","summary":{"en":"Larviposition is the biological process of depositing or giving birth to larvae instead of laying eggs.","zh":"Larviposition 指生物将幼虫产出或释放出来（而非产卵）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of depositing or giving birth to larvae (rather than laying eggs), especially in insects and other invertebrates","zh":"（尤指昆虫等无脊椎动物）产幼虫、放置/产出幼虫的行为（不同于产卵）"},"examples":[{"en":"Some flies reproduce by larviposition, releasing live larvae onto food sources.","zh":"有些苍蝇通过产幼虫繁殖，把活的幼虫释放到食物来源上。"},{"en":"The researcher recorded the timing of larviposition in the female insect.","zh":"研究人员记录了雌虫产幼虫的时间。"}]}],"synonyms":["larval deposition","larval laying (rare)","viviparous larval release"],"phonetic":"/ˌlɑrviˌpɑˈzɪʃən/","extraExplanation":["该词多见于昆虫学、寄生虫学等学术语境，日常英语中很少使用。","构词可理解为 larv(i)-（幼虫）+ position（放置/置放）。“larviparous”（胎生/产幼虫的）和“oviposition”（产卵）常一起对比使用：oviposition 指产卵，larviposition 指直接产出幼虫。"]}
{"word":"larvivorous","summary":{"en":"Larvivorous describes animals that eat larvae.","zh":"larvivorous 指“以幼虫为食的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeding on larvae (the early life stage of insects, amphibians, etc.).","zh":"以幼虫为食的；吃幼体（如昆虫、两栖动物等幼虫）的。"},"examples":[{"en":"Some fish are larvivorous and help reduce mosquito populations by eating mosquito larvae.","zh":"有些鱼是食幼虫性的，会吃蚊子幼虫，从而帮助减少蚊虫数量。"},{"en":"Larvivorous insects can be important in controlling pests in wetlands.","zh":"在湿地里，食幼虫性的昆虫可能在控制害虫方面很重要。"}]}],"synonyms":["larva-eating"],"phonetic":"/lɑrˈvɪvərəs/","extraExplanation":["词源上由“larva（幼虫）+ -vorous（以……为食的）”构成，类似的还有：carnivorous（食肉的）、herbivorous（食草的）、insectivorous（食虫的）。","常见于生物学、生态学与公共卫生语境，例如“larvivorous fish（食蚊幼虫鱼）”在一些地区用于生物防治，帮助控制蚊媒疾病风险。"]}
{"word":"larvule","summary":{"en":"Larvule is a rare word meaning “a very small larva.”","zh":"Larvule 是个较少见的词，意思是“很小的幼虫/幼体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small larva; a tiny larval form (rare).","zh":"（生物学，较少用）小幼虫；微小的幼体形态。"},"examples":[{"en":"Under the microscope, the researcher could see a larvule moving in the water.","zh":"在显微镜下，研究人员能看到一只小幼虫在水中移动。"},{"en":"Some older biology texts use larvule to describe an early, tiny larval stage.","zh":"一些较早的生物学教材会用 larvule 来指早期、体型很小的幼虫阶段。"}]}],"synonyms":["larva","tiny larva","larval form"],"phonetic":"/ˈlɑr.vjuːl/","extraExplanation":["这个词在现代英语里非常少见，更常用的是 larva（幼虫）或 larval stage（幼虫期）。larvule 带有法语/拉丁语式的指小后缀（类似 -ule / -cule），语感上相当于“很小的……”。如果你是在论文或教材里遇到它，多半是偏旧或偏专业的写法。","拼写上也常有人误写；如果你原本想查的是 larval（幼虫的）或 larvae（larva 的复数），告诉我上下文我可以帮你确认。"]}
{"word":"laryng","summary":{"en":"laryng- is a medical word root meaning “larynx (voice box).”","zh":"laryng- 是医学词根，表示“喉/喉头（发声器官）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root (combining form) meaning “the larynx” (the voice box); used in many medical terms","zh":"词根/构词成分，意为“喉/喉头（发声器官）”；常用于医学词汇中"},"examples":[{"en":"Laryngitis is inflammation of the larynx and can cause a sore throat and a hoarse voice.","zh":"Laryngitis（喉炎）是喉头发炎，可能导致喉咙痛和声音嘶哑。"},{"en":"A doctor may use a laryngoscope to look at the larynx.","zh":"医生可能会用 laryngoscope（喉镜）来观察喉头。"},{"en":"The term laryngeal refers to things related to the larynx.","zh":"laryngeal（喉的/喉头的）指与喉头有关的事物。"}]}],"synonyms":["larynx (related word)","voice box (common name)"],"phonetic":"/ləˈrɪŋɡ/","extraExplanation":["“laryng-”来自希腊语 *larynx*（喉、喉头）。在英语里它常作为医学词根出现，而不是一个能单独使用的完整单词。","常见派生词：larynx（喉头/喉）、laryngeal（喉的）、laryngitis（喉炎）、laryngology（喉科学）、laryngoscope（喉镜）。如果你想查的是某个具体单词（如 larynx / laryngeal），也可以告诉我。"]}
{"word":"laryngal","summary":{"en":"Laryngal means “related to the larynx (voice box),” and it can also describe larynx-made speech sounds in linguistics.","zh":"laryngal 表示“与喉头（声箱）有关的”，在语言学中也可指“喉头发出的语音/喉音”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the larynx (the “voice box”) in the throat, which helps with breathing, swallowing, and making sound.","zh":"与喉头（“发声器官/声门所在处”）有关的；喉头的。"},"examples":[{"en":"The doctor examined her laryngeal area to check why her voice sounded hoarse.","zh":"医生检查了她的喉头部位，看看为什么声音嘶哑。"},{"en":"Laryngeal muscles control the opening and closing of the vocal cords.","zh":"喉头肌肉控制声带的开合。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Describing sounds made in the larynx, such as a glottal stop, or features involving the larynx.","zh":"（语言学）指在喉头发出或与喉头相关的语音，如声门塞音，或涉及喉头的语音特征。"},"examples":[{"en":"Some languages use laryngeal sounds that English speakers may find unfamiliar.","zh":"有些语言含有喉音，英语母语者可能不太熟悉。"},{"en":"The symbol [ʔ] represents a laryngeal sound called a glottal stop.","zh":"符号[ʔ]表示一种叫声门塞音的喉音。"}]}],"synonyms":["laryngeal","glottal (in some linguistic contexts)"],"phonetic":"/ləˈrɪŋɡəl/","extraExplanation":["“laryngal”来自“larynx（喉头）”。日常英语里更常见的形容词形式是“laryngeal”（多一个 -e-），意思相同；在医学与语音学语境中尤其常见。"]}
{"word":"laryngalgia","summary":{"en":"Laryngalgia means pain in the larynx (voice box).","zh":"laryngalgia 指喉頭（聲箱）疼痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pain in the larynx (the “voice box” in the throat).","zh":"喉頭（又稱「聲箱」）疼痛。"},"examples":[{"en":"The patient reported laryngalgia when swallowing.","zh":"病人表示吞嚥時出現喉頭疼痛。"},{"en":"Hoarseness and laryngalgia can happen after heavy voice use.","zh":"用嗓過度後可能出現聲音沙啞與喉頭疼痛。"}]}],"synonyms":["laryngeal pain","pain in the larynx","throat pain (less specific)"],"phonetic":"/ˌlærɪnˈɡældʒə/","extraExplanation":["這是一個較偏醫學用語：laryng- 來自 larynx（喉頭），-algia 來自希臘語，表示「疼痛」（也常見於 neuralgia 神經痛、myalgia 肌痛）。日常英文較常說 sore throat（喉嚨痛）或 throat pain（喉部疼痛）；laryngalgia 更精確指喉頭部位。"]}
{"word":"laryngeal","summary":{"en":"Laryngeal means “of or relating to the larynx (voice box) in the throat.”","zh":"laryngeal 意为“喉的；与喉（发声器官）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the larynx (the “voice box”) in the throat.","zh":"与喉（喉头，“发声器官”）有关的；喉的。"},"examples":[{"en":"The doctor examined her laryngeal muscles because her voice sounded weak.","zh":"因为她的声音听起来很弱，医生检查了她的喉部肌肉。"},{"en":"Smoking can increase the risk of laryngeal cancer.","zh":"吸烟会增加喉癌的风险。"},{"en":"The singer practiced to reduce laryngeal tension and improve tone.","zh":"这位歌手练习放松喉部紧张以改善音色。"}]}],"synonyms":["of the larynx","larynx-related","throat (medical, less precise)"],"phonetic":"/ləˈrɪndʒiəl/","extraExplanation":["“laryngeal”是医学和语言学里都很常见的形容词。医学中多指“喉部/声带相关”（如 laryngeal cancer 喉癌）；语言学中常用来描述“喉音/喉部发音”的现象或音（与发声位置有关）。","词根提示：laryng- 来自希腊语，指“喉/喉头”；-eal 表示“……的”。了解词根有助于记忆相关词，如 larynx（喉）和 laryngitis（喉炎）。"]}
{"word":"laryngeally","summary":{"en":"“Laryngeally” means “in a way related to the larynx (voice box),” especially in medical or phonetics contexts.","zh":"“laryngeally”表示“以与喉（喉头/声箱）有关的方式”，多用于医学或语音学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the larynx (the “voice box”) or to voice production in the throat.","zh":"以与喉（喉头/“声箱”）有关的方式；与喉部发声有关地。"},"examples":[{"en":"The surgeon examined the patient laryngeally to check the vocal folds.","zh":"外科医生从喉部相关的角度检查了病人，以查看声带情况。"},{"en":"Some symptoms are felt laryngeally, such as tightness when speaking.","zh":"有些症状会在喉部明显感觉到，比如说话时的紧绷感。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Linguistics/phonetics) In a way involving the larynx during speech, such as with glottal tension or voice quality.","zh":"（语言学/语音学）以涉及喉部参与发音的方式（如声门紧张或音质变化）。"},"examples":[{"en":"The consonant may be described as laryngeally constricted.","zh":"这个辅音可能被描述为“喉部收缩”的。"},{"en":"In some languages, contrasts are marked laryngeally rather than by tongue position.","zh":"在一些语言中，对立差异更多由喉部特征标记，而不是由舌位决定。"}]}],"synonyms":["in a laryngeal way","with the larynx","in the throat (informal)"],"phonetic":"/ləˈrɪndʒiəli/","extraExplanation":["“laryngeally”来自“larynx（喉头）+ -al（……的）+ -ly（……地）”。在医学语境里常见于描述检查或症状定位；在语音学里则常用来谈与“声门/喉部动作”相关的发音特征（例如紧喉、气声、喉塞音等）。","这个词在日常口语中不常用，更常见于医学、歌唱训练或语音学的专业写作；更口语的说法通常是“in the throat / with the voice box”。"]}
{"word":"laryngean","summary":{"en":"Laryngean means “related to the larynx (voice box) or throat-based voice production.”","zh":"laryngean 表示“与喉（喉头/声箱）有关的；与喉部发声有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the larynx (the voice box) or to voice production in the throat","zh":"与喉（喉头、声箱）有关的；与喉部发声有关的"},"examples":[{"en":"The doctor examined his laryngean area because his voice had become hoarse.","zh":"因为他的声音变得嘶哑，医生检查了他的喉部区域。"},{"en":"Some consonants are described as laryngean sounds in phonetics.","zh":"在语音学中，有些辅音被描述为喉音（喉部发出的音）。"}]}],"synonyms":["laryngeal","of the larynx"],"phonetic":"/ləˈrɪndʒiən/","extraExplanation":["“laryngean”常见于医学与语音学语境；日常英语里更常用的形容词是“laryngeal”（同义），都表示“喉的/喉部的”。","词根来自“larynx”（喉头）。如果你在学发音或语言学，“laryngean”也可能指与喉部调音相关的音或特征。"]}
{"word":"laryngeating","summary":{"en":"“laryngeating” is very rare/nonstandard; it seems to mean “related to the larynx,” but it’s often a misspelling of a more common medical/linguistics term.","zh":"“laryngeating”非常少见且不太标准；大意可能是“与喉有关”，但很多时候其实是更常见医学/语音学词汇的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Very rare / nonstandard) relating to the larynx (the “voice box” in your throat), or produced using the larynx.","zh":"（非常少见/非标准用法）与喉（喉头，“声箱”）有关的；或指用喉部发出/形成的。"},"examples":[{"en":"The doctor examined his larynx to see what was causing the hoarse voice.","zh":"医生检查了他的喉部，看看是什么导致声音嘶哑。"},{"en":"Some sounds are made with strong activity in the larynx.","zh":"有些声音是在喉部强烈活动下发出的。"}]}],"synonyms":["laryngeal","throat (informal)"],"phonetic":"/ləˈrɪndʒiˌeɪtɪŋ/","extraExplanation":["“laryngeating”不是常见英语单词，很多情况下可能是拼写或识别错误。你可能想表达的是：\n1) laryngeal（adj. 喉的、喉部的）\n2) laryngitis（n. 喉炎）\n3) laryngectomy（n. 喉切除术）\n4) laryngealization / to laryngealize（语音学：喉化/使喉化）\n如果你能提供它出现的句子或领域（医学/语音学/小说等），我可以帮你确认最准确的词。"]}
{"word":"laryngectomee","summary":{"en":"A laryngectomee is someone who has had their larynx removed in surgery (a laryngectomy).","zh":"laryngectomee 指做过喉切除术、喉（声箱）被切除的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has had a laryngectomy (surgery to remove the larynx/voice box), usually because of cancer","zh":"做过喉切除术（切除喉/声箱）的人，通常因喉癌等原因"},"examples":[{"en":"After the surgery, he became a laryngectomee and learned to speak with a voice prosthesis.","zh":"手术后，他成了一名喉切除术者，并学习使用发声假体说话。"},{"en":"The clinic offers support groups for laryngectomees and their families.","zh":"诊所为喉切除术者及其家属提供支持小组。"}]}],"synonyms":["laryngectomy patient","person who has had a laryngectomy"],"phonetic":"/ləˌrɪn.dʒɛk.təˈmiː/","extraExplanation":["构词提示：laryng- 表示“喉”，-ectomy 表示“切除术”，-ee 常表示“接受某种行为的人”（如 employee）。所以 laryngectomee 指“接受喉切除术的人”。","语境与用法：这是医学/护理场景中较正式的词；日常表达也常说“a person who has had a laryngectomy”或“a laryngectomy patient”。","文化与沟通：喉切除术后发声方式可能不同（如食管发声、电子喉、气管食管发声假体）。与当事人交流时，耐心等待、减少背景噪音、必要时用书写/手机文字沟通会更友好。"]}
{"word":"laryngectomies","summary":{"en":"“Laryngectomies” means surgeries to remove all or part of the larynx (voice box).","zh":"“Laryngectomies”指切除部分或全部喉（声盒）的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of laryngectomy: surgeries in which all or part of the larynx (voice box) is removed, usually to treat cancer.","zh":"laryngectomy 的复数：喉切除术（切除部分或全部喉/“声盒”的手术），多用于治疗喉癌等疾病。"},"examples":[{"en":"The hospital performed several laryngectomies last year for advanced throat cancer.","zh":"这家医院去年为晚期喉癌进行了多例喉切除术。"},{"en":"After laryngectomies, some patients learn new ways to speak with therapy.","zh":"喉切除术后，一些患者会在治疗师帮助下学习新的发声方式。"}]}],"synonyms":["laryngectomy","voice box removal surgery","laryngeal removal surgery"],"phonetic":"/ˌlærɪŋˈdʒɛktəmiz/","extraExplanation":["“laryngectomy”由 larynx（喉）+ -ectomy（切除术）构成，医学语境常见。","常见类型包括“total laryngectomy（全喉切除）”与“partial laryngectomy（部分喉切除）”。全喉切除后气道通常改为经颈部的永久气管造口呼吸。","术后沟通方式可能包括食管发音（esophageal speech）、电子喉（electrolarynx）或气管食管发音（tracheoesophageal speech, TEP）。这类词在日常对话里较少见，多出现在医疗说明、病历、新闻或患者教育材料中。"]}
{"word":"laryngectomize","summary":{"en":"Laryngectomize means to surgically remove the larynx (voice box).","zh":"Laryngectomize 指“通过手术切除喉（喉头/声箱）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to surgically remove a person’s larynx (voice box); to perform a laryngectomy on someone","zh":"通过手术切除某人的喉（声带所在的“喉头”）；对某人实施喉切除术"},"examples":[{"en":"After the cancer spread, doctors had to laryngectomize the patient to save his life.","zh":"癌症扩散后，医生不得不为挽救病人生命而对他进行喉切除手术。"},{"en":"People who are laryngectomized often need speech therapy to learn new ways to communicate.","zh":"做过喉切除的人常常需要语言治疗，学习新的沟通方式。"}]}],"synonyms":["perform a laryngectomy (on)","remove the larynx"],"phonetic":"/ləˌrɪŋˈɡɛktəˌmaɪz/","extraExplanation":["这是一个很专业、偏医学的动词，日常英语里更常见的说法是“perform a laryngectomy (on someone)”或直接用名词“laryngectomy（喉切除术）”。","喉（larynx）被切除后，病人通常会失去原来的发声方式，常见需要气管造口（tracheostomy）来呼吸，并通过食管发声、电子喉（electrolarynx）或气管食管发声等方式进行声音重建与康复训练。","词形来源：laryng(o)-（喉）+ -ectomy（切除术）+ -ize（使/进行……）。常见相关词：laryngectomized（做过喉切除的）、total laryngectomy（全喉切除）。"]}
{"word":"laryngectomized","summary":{"en":"Describes someone who has had their larynx removed by surgery; also the past participle of “laryngectomize.”","zh":"指做过喉切除术（喉部被切除）的人；也可作动词 laryngectomize 的过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had the larynx (voice box) surgically removed (a laryngectomy).","zh":"（因手术）已切除喉（发声器官）的；做过喉切除术的。"},"examples":[{"en":"After treatment for cancer, he became laryngectomized and learned new ways to communicate.","zh":"因癌症治疗后，他做了喉切除术（成为喉切除者），并学习新的沟通方式。"},{"en":"The clinic provides speech therapy for laryngectomized patients.","zh":"这家诊所为做过喉切除术的患者提供言语治疗。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past participle of laryngectomize: to surgically remove a person’s larynx.","zh":"laryngectomize 的过去分词：对某人进行喉切除手术（切除喉部）。"},"examples":[{"en":"The surgeon laryngectomized the patient to remove the tumor.","zh":"外科医生为切除肿瘤对患者进行了喉切除手术。"}]}],"synonyms":["post-laryngectomy","after laryngectomy","laryngectomy patient"],"phonetic":"ləˌrɪnˈdʒek.təˌmaɪzd","extraExplanation":["“laryngectomized”多见于医学或护理语境，用来描述“做过喉切除术的人/患者”。喉切除后通常会失去原有的发声方式，但可能通过食管发声、电子喉（electrolarynx）或气管食管发声（TEP）等方法重新获得说话能力。","词形结构：laryng-（喉）+ -ectomy（切除术）+ -ize（使/进行……）+ -ed（过去分词/形容词用法）。理解这些词根词缀有助于读懂医学英语。"]}
{"word":"laryngectomizing","summary":{"en":"“Laryngectomizing” means performing a laryngectomy—surgically removing all or part of the larynx (voice box).","zh":"“laryngectomizing”指实施喉切除术——外科手术切除全部或部分喉（发声器官）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(medical) Performing a laryngectomy on someone; removing all or part of the larynx (voice box), usually as a surgical treatment.","zh":"（医学）对某人实施喉切除术；切除全部或部分喉（发声器官），通常作为治疗手段。"},"examples":[{"en":"The surgeons are laryngectomizing the patient to remove the cancer.","zh":"外科医生正在为患者进行喉切除术，以切除癌变组织。"},{"en":"After laryngectomizing, the team discussed voice rehabilitation options.","zh":"喉切除术后，医疗团队讨论了嗓音康复的方案。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing the act/process of carrying out a laryngectomy (often used as a technical, continuous form).","zh":"描述正在进行的喉切除这一行为/过程（多见于技术性、进行时表达）。"},"examples":[{"en":"The report describes a laryngectomizing procedure performed under general anesthesia.","zh":"报告描述了一例在全身麻醉下进行的喉切除手术。"}]}],"synonyms":["performing a laryngectomy","removing the larynx","doing a laryngectomy","laryngectomy (as a procedure)"],"phonetic":"/ləˌrɪn.dʒɛkˈtoʊ.maɪ.zɪŋ/","extraExplanation":["“laryngectomizing”来自动词 laryngectomize（实施喉切除术），更常见的表达是“performing a laryngectomy / doing a laryngectomy”。在日常英语里，这个词较少见，通常出现在医学论文、手术记录或临床讨论中。","喉切除术后，患者可能需要通过“气管造口（stoma）”呼吸，并进行言语/发声康复（如食管发声、电子喉等）。如需沟通病情，常见更易懂的说法是“removing the voice box”。"]}
{"word":"laryngectomy","summary":{"en":"A surgery to remove all or part of the larynx (voice box).","zh":"切除全部或部分喉（声盒）的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove all or part of the larynx (voice box), usually to treat cancer or severe damage; it often changes how a person breathes and speaks.","zh":"喉切除术：通过手术切除全部或部分喉（声盒），通常用于治疗喉癌或严重损伤；常会改变患者的呼吸与发声方式。"},"examples":[{"en":"After a total laryngectomy, the patient breathes through a stoma in the neck.","zh":"全喉切除术后，患者通过颈部的造口（气孔）呼吸。"},{"en":"He learned to speak again using an electrolarynx after his laryngectomy.","zh":"喉切除术后，他用电子喉重新学会了说话。"}]}],"synonyms":["larynx removal (informal)","voice box removal (informal)","total laryngectomy","partial laryngectomy"],"phonetic":"/ˌlærɪnˈdɛktəmi/","extraExplanation":["词源：laryng- 来自 larynx（喉），-ectomy 表示“切除手术”（如 appendectomy 阑尾切除术）。因此 laryngectomy 字面义就是“喉的切除手术”。","常见搭配与相关词：total laryngectomy（全喉切除）、partial laryngectomy（部分喉切除）、stoma（造口/气孔）、tracheostomy（气管切开/气管造口，注意与喉切除不同）、electrolarynx（电子喉）、voice rehabilitation（言语/发声康复）。","使用场景：多见于医学语境与患者康复介绍；日常口语中更常用“had surgery to remove his/her voice box（做了手术切除了喉/声盒）”来解释。"]}
{"word":"laryngemphraxis","summary":{"en":"Laryngemphraxis means a blockage of the larynx that can cause choking or breathing difficulty.","zh":"laryngemphraxis 指喉头发生阻塞，可能导致噎住或呼吸困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Obstruction of the larynx (voice box), causing difficulty breathing or choking.","zh":"喉头（声门）阻塞，导致呼吸困难或窒息/噎住。"},"examples":[{"en":"The doctor treated the patient for suspected laryngemphraxis after sudden airway blockage.","zh":"患者出现突然气道堵塞后，医生按“喉头阻塞（laryngemphraxis）”的可能性进行处理。"},{"en":"Severe swelling can lead to laryngemphraxis and requires urgent medical care.","zh":"严重肿胀可能引发喉头阻塞，需要紧急医疗处理。"}]}],"synonyms":["laryngeal obstruction","airway obstruction","choking","asphyxia"],"phonetic":"/ləˌrɪn.dʒɛmˈfræk.sɪs/","extraExplanation":["这是一个非常罕见、偏旧式的医学术语，多用于专业文献；日常英语中更常见的说法是 **laryngeal obstruction**（喉头阻塞）或直接描述为 **airway obstruction / choking**（气道阻塞/噎住）。","词源可拆解理解：**laryng-**（喉、喉头）+ **-emphraxis**（阻塞，源自希腊语词根，含“堵住/塞住”之意）。"]}
{"word":"laryngendoscope","summary":{"en":"A medical instrument used to examine the larynx and assist with airway procedures (often referred to as a laryngoscope).","zh":"用于检查喉部并辅助气道操作的医疗器械（常称为“喉镜”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical instrument (a type of laryngoscope) used to look into the larynx (voice box) and help doctors examine the airway or place a breathing tube.","zh":"一种医疗器械（属于喉镜的一种），用于观察喉部（声箱）并帮助医生检查气道或进行气管插管。"},"examples":[{"en":"The anesthesiologist used a laryngendoscope to guide the breathing tube into the patient’s airway.","zh":"麻醉科医生使用喉镜引导呼吸管进入患者的气道。"},{"en":"In the emergency room, the doctor quickly checked the throat with a laryngendoscope.","zh":"在急诊室里，医生迅速用喉镜检查了咽喉情况。"}]}],"synonyms":["laryngoscope","endoscope (general term)"],"phonetic":"/ləˈrɪn.dʒənˌdoʊskoʊp/","extraExplanation":["“laryngendoscope”在日常英语里很少见，更常见、标准的词是“laryngoscope（喉镜）”。很多情况下人们写成“laryngendoscope”是把“laryngoscope”和“endoscope（内窥镜）”两种说法混在一起。","词根提示：laryng- 表示“喉/喉部”，-scope 表示“观察器”。所以它的核心意思就是“用来观察喉部的器械”。"]}
{"word":"larynges","summary":{"en":"“Larynges” means the plural of “larynx” (voice box).","zh":"“larynges”是“larynx（喉头/发声器官）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of larynx: the “voice box,” a body part in the throat that helps you breathe, swallow, and make sound.","zh":"larynx（喉头、发声器官）的复数：位于喉咙的“声箱”，帮助呼吸、吞咽并发声。"},"examples":[{"en":"The singers’ larynges were tired after a long rehearsal.","zh":"长时间排练后，歌手们的喉头都很疲劳。"},{"en":"Doctors checked the patients’ larynges to see if there was swelling.","zh":"医生检查了病人们的喉头，看看是否有肿胀。"}]}],"synonyms":["voice boxes (informal)"],"phonetic":"/ləˈrɪn.dʒiz/","extraExplanation":["“larynx”在医学和生物学语境里很常见；日常英语中更常说“voice box”（声带/发声器官）。","复数“larynges”属于不规则变化：-nx 结尾常变为 -nges（如 phalanx → phalanges）。"]}
{"word":"laryngic","summary":{"en":"Laryngic means “related to the larynx (voice box), especially in sound production.”","zh":"laryngic 指“与喉（发声器官）有关的”，常用于描述发音或声音产生方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the larynx (the “voice box”) in the throat, especially sounds produced with the larynx.","zh":"与喉（喉头，“发声器官”）有关的；尤指用喉部发出的声音。"},"examples":[{"en":"Some singers use a more laryngeal quality to create a rougher sound.","zh":"有些歌手会使用更“喉音化”的音色来制造更粗粝的效果。"},{"en":"In phonetics, certain consonants are described as laryngeal sounds.","zh":"在语音学里，有些辅音会被描述为“喉部音（喉音）”。"}]}],"synonyms":["laryngeal","glottal (in some contexts)"],"phonetic":"/ləˈrɪn.dʒɪk/","extraExplanation":["“laryngic”在日常英语里不太常见，更常见的是“laryngeal”。在语音学中，“laryngeal sounds（喉音）”常用来泛指与喉部发音机制相关的音（例如声门音、送气/清喉化等现象，具体分类依理论而定）。","词根提示：laryng- 来自希腊语“larynx（喉）”，后缀 -ic 表示“……的、与……有关的”。"]}
{"word":"laryngismal","summary":{"en":"“Laryngismal” means “related to a spasm of the larynx (voice box).” It’s rare and mainly medical.","zh":"“laryngismal”意为“与喉部（声门/喉头）痉挛有关的”。该词较少见，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a sudden spasm (tightening) of the larynx (voice box), especially one that causes noisy breathing or brief trouble breathing.","zh":"与喉部（声门/喉头）突然痉挛有关的，尤指导致喘鸣（呼吸有声音）或短暂呼吸困难的情况。"},"examples":[{"en":"The doctor noted a laryngismal episode during the night, with brief noisy breathing.","zh":"医生记录到患者夜间出现一次喉痉挛相关发作，短暂出现呼吸杂音。"},{"en":"In rare cases, reflux can trigger laryngismal spasms and a choking sensation.","zh":"在少数情况下，胃食管反流可能诱发喉痉挛相关的痉挛与“卡住/呛住”的感觉。"}]}],"synonyms":["laryngeal (spasm)","laryngospastic","glottic (spasm)"],"phonetic":"/ləˈrɪn.dʒɪz.məl/","extraExplanation":["“laryngismal”在现代英语中非常少见，多用于医学语境；更常见的表达包括“laryngeal spasm（喉痉挛）”“laryngospasm（喉痉挛）”。","它常与旧称“laryngismus（喉痉挛）/laryngismus stridulus（伴喘鸣的喉痉挛，历史上也指儿童某些喘鸣发作）”相关。若你是在文章里见到该词，也可能是作者使用了较古旧或较专业的变体。"]}
{"word":"laryngismus","summary":{"en":"A medical term for a sudden spasm of the vocal cords that may briefly obstruct breathing.","zh":"医学术语：声带突然痉挛，可能短暂阻碍呼吸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden spasm (involuntary tightening) of the vocal cords that can briefly block airflow and cause difficulty breathing.","zh":"喉痉挛：声带（喉部）突然不自主收缩，可能短暂阻塞气流并导致呼吸困难。"},"examples":[{"en":"The patient had a brief episode of laryngismus after the procedure and then recovered.","zh":"这位患者在手术后出现了短暂的喉痉挛，随后恢复。"},{"en":"Doctors monitored his breathing closely because laryngismus can temporarily block the airway.","zh":"医生密切监测他的呼吸，因为喉痉挛可能会暂时阻塞气道。"}]}],"synonyms":["laryngospasm","spasm of the vocal cords"],"phonetic":"/ləˈrɪn.dʒɪz.məs/","extraExplanation":["这是医学用语，较常见的相关表达是 **laryngospasm（喉痉挛）**；在临床写作或口语里，laryngospasm 比 laryngismus 更常用。","词根帮助记忆：**laryng-** 表示“喉/喉头”，**-ismus** 常用于表示某种状态或现象。"]}
{"word":"laryngitic","summary":{"en":"Laryngitic describes something (especially a voice) affected by laryngitis.","zh":"laryngitic 指与喉炎相关或因喉炎而出现（尤指嗓音嘶哑）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, or affected with, laryngitis (inflammation of the voice box), often causing a hoarse or weak voice.","zh":"与喉炎有关的；患喉炎的（喉部/声带发炎），常导致声音嘶哑或无力。"},"examples":[{"en":"He spoke in a laryngitic whisper after the concert.","zh":"演唱会后他带着喉炎般的沙哑低声说话。"},{"en":"The doctor noted her laryngitic voice and advised rest and fluids.","zh":"医生注意到她喉炎导致的声音嘶哑，建议多休息并补充水分。"}]}],"synonyms":["hoarse","raspy","laryngeal (more general)"],"phonetic":"ˌlær.ɪnˈdʒɪtɪk","extraExplanation":["“laryngitic”是较偏医学/正式的形容词，日常口语更常说“hoarse（嗓子哑的）”或“have laryngitis（得了喉炎）”。","构词上来自“larynx（喉头/喉）+ -itis（炎症）+ -ic（……的）”，所以字面意思就是“喉炎的/与喉炎相关的”。"]}
{"word":"laryngitis","summary":{"en":"Laryngitis is inflammation of the voice box that often causes hoarseness or loss of voice.","zh":"laryngitis 指喉炎：喉部发炎，常见症状是声音嘶哑或失声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation (swelling and irritation) of the larynx (voice box), usually causing a hoarse voice or loss of voice.","zh":"喉炎；喉部（声带/喉头）的炎症，常导致声音嘶哑或失声。"},"examples":[{"en":"I have laryngitis, so I can’t speak loudly today.","zh":"我得了喉炎，所以今天不能大声说话。"},{"en":"The teacher’s laryngitis made her voice very hoarse.","zh":"老师的喉炎让她的声音非常沙哑。"}]}],"synonyms":["hoarseness (symptom)","inflammation of the larynx"],"phonetic":"/ˌler.ənˈdʒaɪ.t̬ɪs/","extraExplanation":["“laryng-”来自“larynx（喉头）”，“-itis”是医学词缀，表示“炎症”。所以 laryngitis 字面意思就是“喉头的炎症”。","常见诱因包括感冒/流感等病毒感染、过度用嗓（大喊、长时间讲话/唱歌）、过敏或胃酸反流。多数为短期（acute），但若嘶哑持续超过约两周，尤其伴随呼吸困难、咳血等，应尽快就医评估。"]}
{"word":"laryngitises","summary":{"en":"“Laryngitises” means cases of laryngitis (inflammation of the voice box).","zh":"“Laryngitises”指多次/多个病例的喉炎（喉部发炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural form of laryngitis: inflammations of the larynx (voice box), often causing a hoarse voice or loss of voice.","zh":"laryngitis（喉炎）的复数：喉部（声箱）发炎，常导致声音嘶哑或失声。"},"examples":[{"en":"Winter colds can lead to repeated laryngitises in some people.","zh":"冬季感冒可能会让一些人反复出现喉炎。"},{"en":"The doctor said her laryngitises were likely caused by overusing her voice.","zh":"医生说她多次喉炎很可能是因为过度用嗓。"}]}],"synonyms":["cases of laryngitis","laryngitis (uncountable in common use)"],"phonetic":"/ˌlærɪnˈdʒaɪtɪs/","extraExplanation":["“laryngitises”是不太常见的复数形式（更常见的说法是把 laryngitis 当作不可数名词：e.g., “He has laryngitis.”）。在医学写作中也可能见到复数形式，表示不同次数/不同病例的喉炎。","词根提示：laryng- 表示“喉”，-itis 表示“炎症”（如 bronchitis 支气管炎、tonsillitis 扁桃体炎）。"]}
{"word":"laryngitus","summary":{"en":"Laryngitis is inflammation of the voice box that often causes hoarseness or voice loss.","zh":"Laryngitis 指喉头发炎，常见表现是声音嘶哑或失声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the larynx (voice box), often causing a hoarse voice or loss of voice.","zh":"喉炎；喉头（声带所在处）发炎，常导致声音嘶哑或失声。"},"examples":[{"en":"I got laryngitis after a bad cold, and my voice became very hoarse.","zh":"我重感冒后得了喉炎，声音变得很嘶哑。"},{"en":"The doctor said the laryngitis should improve with rest and plenty of fluids.","zh":"医生说多休息、补充水分后，喉炎应该会好转。"},{"en":"Singers try to avoid laryngitis by staying hydrated and not overusing their voices.","zh":"歌手会通过多喝水、不过度用嗓来避免喉炎。"}]}],"synonyms":["hoarseness (symptom)","inflammation of the larynx"],"phonetic":"/ˌlær.ɪnˈdʒaɪ.t̬əs/","extraExplanation":["你输入的 **laryngitus** 常见为拼写错误；正确拼写是 **laryngitis**。","词尾 **-itis** 在医学英语里常表示“炎症”（如 bronchitis 支气管炎、tonsillitis 扁桃体炎），看到这个后缀可以快速猜到大意。","喉炎多数与感冒/用嗓过度有关；但如果持续超过两周、伴随呼吸困难、咳血或高烧等情况，建议尽快就医。"]}
{"word":"laryngo","summary":{"en":"laryngo- is a medical combining form meaning “larynx (voice box).”","zh":"laryngo- 是医学构词成分，表示“喉/喉头（发声器官）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “larynx” (the voice box), used in medical words.","zh":"构词成分，表示“喉/喉头（发声器官）”，常用于医学词汇。"},"examples":[{"en":"Laryngoscopy is an exam that lets a doctor look at your larynx.","zh":"Laryngoscopy（喉镜检查）是一种让医生查看喉部的检查。"},{"en":"Laryngitis means inflammation of the larynx and often causes a hoarse voice.","zh":"Laryngitis（喉炎）指喉部发炎，常导致声音嘶哑。"},{"en":"The prefix laryngo- appears in many ENT (ear, nose, and throat) terms.","zh":"前缀 laryngo- 常见于许多耳鼻喉科术语中。"}]}],"synonyms":["laryng-","larynx (related word)"],"phonetic":"/ləˈrɪŋɡoʊ/","extraExplanation":["“laryngo-”通常不单独作为一个完整单词使用，而是放在词首与其他词根/后缀组合（如 -itis 炎症，-scopy 镜检）。","来源上与希腊语中表示“喉部/喉头”的词根有关，因此多见于医学与解剖学语境。"]}
{"word":"laryngocele","summary":{"en":"A laryngocele is a rare, air-filled bulge connected to the larynx that may cause a neck swelling, hoarseness, or breathing problems.","zh":"laryngocele 指一种少见的与喉部相连、充气的囊状膨出，可表现为颈部肿块、声音嘶哑或呼吸问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal air-filled (or sometimes fluid-filled) swelling of the laryngeal saccule that can bulge into the neck or into the airway.","zh":"（医学）喉室囊肿/喉室气囊肿：喉部“喉室小囊”异常扩张，内含空气（有时也可含液体），可向颈部或气道内膨出。"},"examples":[{"en":"The ENT doctor diagnosed a laryngocele after the patient reported a neck lump that got bigger when he coughed.","zh":"耳鼻喉科医生在患者诉说“咳嗽时颈部肿块变大”后，诊断为喉室气囊肿。"},{"en":"A large laryngocele can cause hoarseness or breathing difficulty.","zh":"较大的喉室气囊肿可能导致声音嘶哑或呼吸困难。"}]}],"synonyms":["laryngeal saccule dilation","laryngeal air sac (informal)"],"phonetic":"/ləˈrɪŋɡoʊˌsil/","extraExplanation":["词源：laryngo- 表示“喉（larynx）”，-cele 表示“疝/膨出/囊状突起”。","临床上常按位置分为“内型（向喉腔内）”“外型（向颈部外侧）”或“混合型”。常见线索是用力、咳嗽或吹奏乐器时肿块变明显。","这是医学专业词，日常英语里很少用；更口语的相关表达可能是“a swelling/lump near the voice box（靠近喉部的肿块）”。"]}
{"word":"laryngocentesis","summary":{"en":"Laryngocentesis is a needle puncture of the larynx for drainage or emergency airway access.","zh":"laryngocentesis 指对喉头进行针刺穿刺，用于引流或紧急建立气道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical procedure in which a needle is inserted into the larynx (voice box) to remove air or fluid, or to provide emergency airway access.","zh":"一种医疗操作：将针头刺入喉（喉头/声箱）以抽出空气或液体，或在紧急情况下建立呼吸通道。"},"examples":[{"en":"In rare emergencies, a clinician may consider laryngocentesis to help secure an airway.","zh":"在少数紧急情况下，临床医生可能会考虑进行喉穿刺来帮助建立气道。"},{"en":"The team discussed whether laryngocentesis was appropriate given the patient’s severe throat swelling.","zh":"团队讨论了在患者咽喉严重肿胀的情况下是否适合进行喉穿刺。"}]}],"synonyms":["laryngeal puncture","laryngeal aspiration"],"phonetic":"/ləˌrɪŋɡoʊsɛnˈtiːsɪs/","extraExplanation":["这是一个较少见、偏专业的医学词，常出现在急救或耳鼻喉科相关语境中；在日常英语中很少用到。","词源可拆解理解：laryngo- 表示“喉/喉头（larynx）”，-centesis 表示“穿刺/抽液（surgical puncture）”，合起来就是“对喉进行穿刺”。","相关词可类比记忆：amniocentesis（羊膜穿刺）、thoracentesis（胸腔穿刺）、paracentesis（腹腔穿刺）。"]}
{"word":"laryngofission","summary":{"en":"Laryngofission is a surgical procedure where the larynx is split open to access and treat problems inside it.","zh":"laryngofission 指“喉裂开术”，即将喉部切开以进入喉腔内部进行治疗的外科手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the larynx (voice box) is split open—usually by dividing the thyroid cartilage—to give access to the inside of the larynx for treatment or removal of disease.","zh":"（外科）喉裂开术：一种将喉（声箱）切开（通常是分开甲状软骨）以进入喉腔内部进行治疗或切除病变的手术。"},"examples":[{"en":"The surgeon performed a laryngofission to remove a growth from the vocal cords.","zh":"外科医生进行了喉裂开术，以切除声带上的赘生物。"},{"en":"Because the tumor was hard to reach, laryngofission was considered as an option.","zh":"由于肿瘤位置不易接近，医生将喉裂开术作为一种选择。"}]}],"synonyms":["laryngofissure","thyrotomy","median thyrotomy"],"phonetic":"/ləˌrɪŋɡoʊˈfɪʃən/","extraExplanation":["这是一个较为专业、偏“经典外科入路”的医学词汇，常见于耳鼻喉科（ENT）或喉部手术相关文献中。现代临床在很多情况下也可能优先选择经口内镜/激光等更微创的方式，但在特定病变位置或需要更大暴露范围时仍可能提及该术式。","词源可拆解理解：laryngo- 表“喉”，-fission 表“裂开/劈开”，合起来就是“喉部裂开（手术）”。"]}
{"word":"laryngofissure","summary":{"en":"A surgical procedure that opens the larynx (voice box) with an incision, often to remove disease or improve the airway.","zh":"通过切开打开喉（声箱）的外科手术，常用于切除病变或改善气道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the larynx (voice box) is opened by making a cut through it, usually to remove a tumor, treat scarring, or improve the airway","zh":"（喉裂开术）一种外科手术：将喉（声箱）切开打开，通常用于切除肿瘤、处理瘢痕狭窄或改善气道通畅"},"examples":[{"en":"The surgeon recommended a laryngofissure to remove the lesion from the vocal cords.","zh":"外科医生建议进行喉裂开术，以切除声带上的病灶。"},{"en":"After the laryngofissure, the patient needed careful voice rest and follow-up exams.","zh":"喉裂开术后，患者需要严格的嗓音休息并定期复查。"}]}],"synonyms":["laryngotomy","thyrotomy (often used for a similar approach)","laryngeal surgery"],"phonetic":"/ləˌrɪŋɡoʊˈfɪʃər/","extraExplanation":["词源拆解有助记忆：laryngo- 表示“喉”，-fissure 表示“裂开/裂隙”。因此 laryngofissure 字面意思就是“喉部裂开（的手术）”。","这是较专业的医学术语，在日常英语中很少出现。更常见的说法可能是 “laryngeal surgery”（喉部手术）或具体到病因的手术名称。是否采用该术式取决于病变位置、大小以及是否需要直接暴露声带等因素。"]}
{"word":"laryngograph","summary":{"en":"A device for recording vocal-fold vibration during speech or singing.","zh":"用于记录说话或歌唱时声带振动的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical or speech-science device that records how the vocal folds (vocal cords) vibrate during speaking or singing, usually by measuring electrical impedance across the throat (also called an electroglottograph).","zh":"一种医学或语音科学仪器，用来记录人在说话或歌唱时声带（声门）振动的情况，通常通过测量颈部两侧的电阻抗变化来实现（也称电声门图仪/电声门仪）。"},"examples":[{"en":"The clinician used a laryngograph to analyze the patient’s voice quality.","zh":"临床医生用喉头图（laryngograph）来分析患者的嗓音质量。"},{"en":"In the lab, students compared laryngograph signals with audio recordings of the same sentence.","zh":"在实验室里，学生把喉头图信号与同一句话的录音进行对比。"}]}],"synonyms":["electroglottograph","EGG (device)"],"phonetic":"/ləˈrɪŋɡəˌɡræf/","extraExplanation":["“Laryngograph”常见于语音治疗、嗓音训练与语言学/声学研究场景。它通常在喉部两侧贴上电极，得到反映声带开合接触程度的曲线（常称EGG波形），可辅助判断发声方式是否紧张、漏气等。","术语构词：laryngo-（喉/喉部）+ -graph（记录/书写）。在学术与临床文献中也常用“electroglottograph / electroglottography (EGG)”来指同类技术。"]}
{"word":"laryngography","summary":{"en":"Laryngography is an examination/recording method used to study the larynx and vocal fold movement, often for diagnosing voice problems.","zh":"laryngography 指用于观察与记录喉（声箱）及声带运动的检查/成像方法，常用于诊断嗓音问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical test or imaging method used to examine and record the larynx (voice box), often to study voice production or diagnose throat/voice disorders.","zh":"喉部造影／喉部检查记录：一种用于观察并记录喉（声箱）的医学检查或成像方法，常用于研究发声机制或诊断咽喉与嗓音疾病。"},"examples":[{"en":"The ENT specialist recommended laryngography to evaluate her persistent hoarseness.","zh":"耳鼻喉科医生建议做喉部造影（喉部检查记录），以评估她持续的声音嘶哑。"},{"en":"Laryngography can help clinicians see how the vocal folds move during speech.","zh":"喉部造影可以帮助临床医生观察说话时声带的运动情况。"}]}],"synonyms":["laryngeal imaging","laryngeal examination","laryngoscopy (related)","electroglottography (related)"],"phonetic":"/ˌlærɪŋˈɡrɑfi/","extraExplanation":["“laryngo-”表示“喉”，“-graphy”表示“记录/成像/描记”。因此 laryngography 字面意思是“对喉进行记录/成像”。","在不同语境里，它可能指用影像（如放射造影）观察喉部结构，也可能泛指对喉与声带运动的仪器记录；具体做法会因医院与检查目的而不同。","相关领域常见的近义或相关术语有：laryngoscopy（喉镜检查，直接用镜子/内镜看喉部）、videostroboscopy（频闪喉镜视频观察声带振动）、electroglottography/EGG（电声门图，用电极记录声带接触情况）。"]}
{"word":"laryngologic","summary":{"en":"Medical adjective meaning “related to the larynx (voice box) or to laryngology.”","zh":"医学形容词：指“与喉部（声箱）或喉科学相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to laryngology (the medical study and treatment of the larynx, or “voice box”).","zh":"喉科学的；与喉科学（研究与治疗喉部/“声箱”的医学分支）有关的。"},"examples":[{"en":"She was referred for a laryngologic exam because of long-lasting hoarseness.","zh":"因为长期声音嘶哑，她被转诊去做喉科检查。"},{"en":"The clinic offers laryngologic care for voice and swallowing problems.","zh":"这家门诊为发声与吞咽问题提供喉科诊疗。"}]}],"synonyms":["laryngeal","otolaryngologic (broader, ENT-related)"],"phonetic":"/ˌlærɪnˈdʒɑlədʒɪk/","extraExplanation":["“laryngologic”常见于医学语境，尤其是耳鼻喉科（ENT）相关的检查、手术或治疗描述中。日常英语里更常说“throat doctor/ENT doctor（耳鼻喉科医生）”或“voice box (larynx)”。"]}
{"word":"laryngological","summary":{"en":"“Laryngological” means “related to the larynx (voice box) or its medical care.”","zh":"“laryngological”意为“与喉（声箱）及其医学诊疗有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the larynx (the “voice box”) and its diseases or medical treatment.","zh":"与喉（“声箱”）及其疾病或医疗处理有关的。"},"examples":[{"en":"She had a laryngological exam because of ongoing hoarseness.","zh":"她因为持续声音嘶哑而做了喉科检查。"},{"en":"The clinic offers laryngological care for voice professionals like teachers and singers.","zh":"这家诊所为教师、歌手等用嗓职业者提供喉科诊疗。"}]}],"synonyms":["laryngeal","ENT-related (informal context)","throat-related (general)"],"phonetic":"/ˌlær.ɪn.ɡəˈlɑː.dʒɪ.kəl/","extraExplanation":["“laryngological”常用于医学/学术语境，日常英语里更常说“throat (and voice) specialist/doctor（喉咙/嗓音专科医生）”或“ENT（耳鼻喉科）”。","词源：laryng- 来自希腊语 *larynx*（喉），-logy 表示“学科/研究”，-ical 表示“……的”。相关名词是 laryngology（喉科学），相关职业是 laryngologist（喉科医生/喉科学专家）。"]}
{"word":"laryngologist","summary":{"en":"A laryngologist is a doctor who specializes in the larynx (voice box) and voice/throat problems.","zh":"laryngologist 指专门诊治喉部（声带/喉头）及发声相关问题的医生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical doctor who specializes in diseases and treatment of the larynx (voice box) and related throat/voice problems","zh":"喉科医生；专门诊治喉部（声带/喉头）及相关咽喉与发声问题的医生"},"examples":[{"en":"The singer visited a laryngologist after losing her voice.","zh":"那位歌手嗓子失声后去看了喉科医生。"},{"en":"A laryngologist can check your vocal cords with a small camera.","zh":"喉科医生可以用小型镜头检查你的声带。"}]}],"synonyms":["ENT doctor","otolaryngologist","throat specialist"],"phonetic":"/ləˌrɪŋˈɡɑːlədʒɪst/","extraExplanation":["在日常医疗语境里，laryngologist 常被归在 ENT（ear, nose, and throat，耳鼻喉科）或 otolaryngology（耳鼻喉科）体系中。很多时候你会听到更常用的说法是 “ENT doctor（耳鼻喉科医生）”。如果问题主要与声音、声带、喉部肿块或吞咽相关，可能会转诊给更偏“喉/嗓音”方向的专科医生。","词根小提示：laryng- 来自希腊语，表示“喉/喉头”；-logist 表示“研究者/专科医生”。理解词根有助于记忆同族词，如 larynx（喉头）。"]}
{"word":"laryngology","summary":{"en":"Laryngology is the medical field that focuses on the larynx (voice box) and voice/throat disorders.","zh":"Laryngology 指研究与治疗喉（声箱）及发声/咽喉相关疾病的医学领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the medical study and treatment of the larynx (voice box) and related throat/voice disorders","zh":"喉科学：研究与治疗喉（声箱）及相关咽喉、发声障碍的医学分支"},"examples":[{"en":"She was referred to laryngology for chronic hoarseness.","zh":"她因长期声音嘶哑被转诊到喉科（喉科学）就诊。"},{"en":"In laryngology, doctors often examine the vocal cords to understand voice problems.","zh":"在喉科学中，医生常检查声带来了解发声问题。"}]}],"synonyms":["laryngeal medicine","voice medicine"],"phonetic":"/ˌlærɪŋˈɡɑlədʒi/","extraExplanation":["词源拆解：laryng- 来自希腊语 larynx（喉、喉头），-logy 表示“学科/研究”。因此 laryngology 字面意思就是“研究喉的学科”。","常见相关科室：在美国医疗系统里，喉科学通常属于 ENT（耳鼻喉科，otolaryngology）的一部分；更专门的方向有 laryngologist（喉科专科医生）。","常见就诊问题：声音嘶哑（hoarseness）、声带结节/息肉（vocal nodules/polyps）、吞咽或喉部不适等。"]}
{"word":"laryngometry","summary":{"en":"Laryngometry means measuring the larynx (voice box), usually in medical or scientific contexts.","zh":"Laryngometry 指对喉部（声箱）进行测量，常见于医学或科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of the larynx (voice box), especially its size or shape, for medical or research purposes","zh":"喉测量法；对喉部（声箱）的尺寸或形态进行测量（多用于医学或研究）"},"examples":[{"en":"The researchers used laryngometry to compare airway size across different age groups.","zh":"研究人员使用喉测量法来比较不同年龄组的气道大小。"},{"en":"Laryngometry can help clinicians estimate how narrow the upper airway is.","zh":"喉测量法可帮助临床医生估计上气道有多狭窄。"}]}],"synonyms":["laryngeal measurement","airway measurement (context-dependent)"],"phonetic":"/ˌlærɪŋˈɡɑmətri/","extraExplanation":["词源拆解：laryngo- 表示“喉/喉部”，-metry 表示“测量”。因此 laryngometry 字面意思就是“喉部的测量”。","使用场景：该词较偏医学与语音/呼吸研究领域，日常英语中很少见。常与 airway（气道）、obstruction（阻塞）、sleep apnea（睡眠呼吸暂停）等话题同现。","相关词对比：laryngoscopy（喉镜检查）强调“用镜子/内镜观察喉部”；laryngometry 强调“对喉部进行测量”。"]}
{"word":"laryngoparalysis","summary":{"en":"Laryngoparalysis means paralysis of the larynx (voice box), often affecting breathing and voice.","zh":"Laryngoparalysis 指喉部（声箱）肌肉瘫痪，常影响呼吸与发声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the muscles of the larynx (voice box) are paralyzed, causing problems with breathing, speaking, or swallowing.","zh":"（医学）喉麻痹；喉部（声箱）肌肉发生瘫痪，导致呼吸、发声或吞咽困难。"},"examples":[{"en":"The patient’s hoarse voice and noisy breathing suggested possible laryngoparalysis.","zh":"患者声音嘶哑且呼吸有杂音，提示可能存在喉麻痹。"},{"en":"In severe laryngoparalysis, doctors may need to secure the airway to help the person breathe.","zh":"在严重喉麻痹时，医生可能需要先确保气道通畅，以帮助患者呼吸。"}]}],"synonyms":["laryngeal paralysis","vocal cord paralysis"],"phonetic":"/ləˌrɪŋɡoʊpəˈræləsɪs/","extraExplanation":["词源可拆解理解：laryngo- 表示“喉/喉部”，paralysis 表示“瘫痪”。合起来就是“喉部瘫痪”。","在临床语境中，这个词常与“声带（vocal cords）活动受限”“吸气性喘鸣（stridor）”“误吸（aspiration）风险”一起出现；具体治疗取决于病因与严重程度。"]}
{"word":"laryngopathy","summary":{"en":"A medical term for a disorder or disease of the larynx (voice box).","zh":"指喉部（声箱）的疾病或功能障碍的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A disease or disorder of the larynx (voice box), often affecting the voice, breathing, or swallowing.","zh":"喉部（声箱）的疾病或功能障碍，常影响发声、呼吸或吞咽。"},"examples":[{"en":"The singer was diagnosed with laryngopathy after weeks of hoarseness.","zh":"这位歌手在持续数周声音嘶哑后被诊断为喉部疾病。"},{"en":"Some laryngopathy cases improve with voice rest and therapy.","zh":"一些喉部疾病病例通过休声和嗓音治疗会好转。"},{"en":"The doctor examined his throat to rule out laryngopathy.","zh":"医生检查了他的咽喉，以排除喉部疾病的可能。"}]}],"synonyms":["laryngeal disorder","laryngeal disease","voice disorder"],"phonetic":"/ˌlærɪŋˈɡɑpəθi/","extraExplanation":["这是一个医学用词，由 laryngo-（喉、喉头）+ -pathy（疾病、病变）组成，字面意思就是“喉部的病”。","日常英语更常说 laryngeal disorder / voice disorder（喉部/嗓音障碍）。如果是喉炎通常用 laryngitis。"]}
{"word":"laryngopharyngeal","summary":{"en":"An adjective meaning “related to the larynx and pharynx,” often used in medical terms like laryngopharyngeal reflux (LPR).","zh":"形容词，表示“与喉和咽相关的（喉咽的）”，常用于医学术语，如喉咽反流（LPR）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the larynx (voice box) and the pharynx (throat), especially the area where they meet.","zh":"与喉（声带/喉头）和咽（咽喉）有关的，尤指两者相接的部位。"},"examples":[{"en":"The doctor examined the patient’s laryngopharyngeal area for signs of irritation.","zh":"医生检查了患者的喉咽部位，看是否有刺激或发炎的迹象。"},{"en":"Laryngopharyngeal reflux can cause throat clearing and a hoarse voice.","zh":"喉咽反流可能导致频繁清嗓和声音嘶哑。"}]}],"synonyms":["hypopharyngeal (related, not identical)","throat-related (informal)"],"phonetic":"/ləˌrɪŋɡoʊfəˈrɪndʒiəl/","extraExplanation":["这个词常见于医学语境，最常见的搭配是 laryngopharyngeal reflux（LPR，喉咽反流）。它和 GERD（胃食管反流）相关，但症状常更偏“喉咙”：如嗓子异物感、慢性清嗓、声音嘶哑、咳嗽等。","构词拆解：laryngo- = larynx（喉），pharyngeal = pharynx（咽）+ -al（形容词后缀），合起来表示“喉与咽相关的/喉咽的”。"]}
{"word":"laryngopharynges","summary":{"en":"“Laryngopharynges” is the plural of “laryngopharynx,” meaning the lower throat area behind the larynx that leads to the esophagus.","zh":"“laryngopharynges”是“laryngopharynx（喉咽）”的复数，指位于喉后方、通向食道的咽部下段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of laryngopharynx; the lower part of the throat (pharynx) that lies behind the larynx and connects to the esophagus","zh":"laryngopharynx（喉咽）的复数；咽部最下段，位于喉的后方，向下连接食道"},"examples":[{"en":"In humans, the laryngopharynges help guide food into the esophagus and keep it out of the airway.","zh":"在人类中，喉咽帮助把食物引导进入食道，并避免进入气道。"},{"en":"The doctor examined the patient’s laryngopharynges for signs of infection.","zh":"医生检查了患者的喉咽部位，看看是否有感染迹象。"}]}],"synonyms":["hypopharynges","lower pharynges"],"phonetic":"/ləˌrɪŋɡoʊˈfærɪŋks/","extraExplanation":["“laryngopharynges”多见于解剖学、医学或生物学语境；日常英语里更常说“throat”（喉咙）或更具体的“laryngopharynx”（喉咽，单数）。","“laryngopharynx”也常被称为“hypopharynx”（下咽）。在临床写作中，医生可能用这些术语来更精确地描述疼痛、肿胀、炎症或肿瘤的位置。"]}
{"word":"laryngopharyngitis","summary":{"en":"A medical term for inflammation of the larynx and pharynx (voice box and throat).","zh":"医学用语：喉与咽同时发炎（喉咽炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of both the larynx (voice box) and the pharynx (throat), often causing sore throat and hoarseness.","zh":"喉与咽的联合炎症（喉：声带/喉部；咽：咽喉/咽部），常见症状包括喉咙痛与声音嘶哑。"},"examples":[{"en":"The doctor said my sore throat and hoarse voice were due to laryngopharyngitis.","zh":"医生说我喉咙痛、声音嘶哑是因为喉咽炎。"},{"en":"Resting your voice can help when you have laryngopharyngitis.","zh":"得了喉咽炎时，让嗓子休息有助于恢复。"}]}],"synonyms":["pharyngolaryngitis","laryngitis and pharyngitis"],"phonetic":"/ləˌrɪŋɡoʊˌfærɪnˈdʒaɪtɪs/","extraExplanation":["这是较偏医学/临床用语，日常英语更常说 laryngitis（喉炎）或 pharyngitis（咽炎），或直接说 “a sore throat”/“hoarse voice”。","词形可拆解理解：laryngo-（喉）+ pharyngo-（咽）+ -itis（炎症）。看到 -itis 结尾的词，通常表示“某部位发炎”。"]}
{"word":"laryngopharynx","summary":{"en":"The laryngopharynx is the lower throat area behind the larynx where air and food pass before splitting into the airway and esophagus.","zh":"laryngopharynx（喉咽）是位于喉后方的咽下段，是空气与食物通过并分流到气管和食道的区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The lower part of the pharynx (throat) behind the larynx, where the pathways for food and air cross before separating into the esophagus and the trachea.","zh":"咽喉的下部（咽的下段），位于喉（larynx）后方；食物与空气在此经过并分流，分别进入食道与气管。"},"examples":[{"en":"During swallowing, the laryngopharynx helps guide food toward the esophagus.","zh":"吞咽时，喉咽会帮助把食物引导到食道。"},{"en":"The doctor checked the patient’s laryngopharynx for signs of inflammation.","zh":"医生检查了病人的喉咽，查看是否有发炎迹象。"}]}],"synonyms":["hypopharynx"],"phonetic":"/ləˌrɪŋɡoʊˈfærɪŋks/","extraExplanation":["“laryngopharynx”由 laryngo-（与“喉”有关）+ pharynx（“咽”）组成，所以中文常译为“喉咽”。它是咽的三部分之一：鼻咽（nasopharynx）、口咽（oropharynx）、喉咽（laryngopharynx）。","在医疗语境里，你也可能看到“喉咽反流”（laryngopharyngeal reflux, LPR），指胃酸反流刺激到喉咽，引起声音嘶哑、喉咙异物感、清嗓等症状。"]}
{"word":"laryngopharynxes","summary":{"en":"“Laryngopharynxes” means more than one laryngopharynx—the lower part of the throat behind the larynx leading toward the esophagus.","zh":"“Laryngopharynxes”指多个“喉咽”：位于喉后方、通向食道的咽部下段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of laryngopharynx: the lower part of the pharynx (throat) behind the larynx, leading down toward the esophagus","zh":"laryngopharynx（喉咽）的复数：咽部的下段，位于喉（larynx）后方，向下通向食道"},"examples":[{"en":"In anatomy class, we learned that food passes through the laryngopharynx on its way to the esophagus.","zh":"在解剖课上，我们学到食物在到达食道之前会经过喉咽。"},{"en":"Doctors examined the patient’s throat, including the laryngopharynxes, for signs of irritation.","zh":"医生检查了病人的喉部，包括喉咽部位，看看是否有刺激或发炎的迹象。"}]}],"synonyms":["hypopharynxes","lower pharynxes"],"phonetic":"/ləˌrɪŋɡoʊˈfærɪŋksɪz/","extraExplanation":["“laryngopharynx”常见于医学与解剖学语境，也叫“hypopharynx（下咽）”。它是咽（pharynx）的三部分之一：nasopharynx（鼻咽）、oropharynx（口咽）、laryngopharynx（喉咽）。","这个词的复数形式在实际英文中不算常见，因为医学写作里更常说“the laryngopharynx”或用更一般的“hypopharynx”。"]}
{"word":"laryngophony","summary":{"en":"Laryngophony is an abnormal increase in voice sounds heard over the lungs with a stethoscope, often linked to lung consolidation (e.g., pneumonia).","zh":"Laryngophony 指听诊时在肺部听到的语音异常增强，常与肺实变（如肺炎）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal increase in the loudness and clarity of a patient’s voice heard through a stethoscope over the chest, often suggesting lung tissue is abnormally solid (for example, from pneumonia).","zh":"（医学）用听诊器在胸部听到的患者语音异常增强、变得更清晰的现象，常提示肺组织出现实变（如肺炎）。"},"examples":[{"en":"The doctor noted laryngophony over the right lower lung, which supported a diagnosis of pneumonia.","zh":"医生在右下肺区听到喉音增强（laryngophony），这支持了肺炎的诊断。"},{"en":"Laryngophony is checked during a chest exam by asking the patient to speak while the clinician listens with a stethoscope.","zh":"检查喉音增强通常在胸部体检时进行：让患者说话，医生用听诊器在胸壁上听。"}]}],"synonyms":["bronchophony","increased vocal resonance"],"phonetic":"/ləˌrɪŋɡoʊˈfɑni/","extraExplanation":["词源：laryngo- 表示“喉/喉部”，-phony 表示“声音”。整体就是“喉部声音（的表现）”。","临床上它属于“语音共振/传导”类体征之一，和 bronchophony（支气管语音增强）、egophony（羊鸣音）常一起学习与比较；当肺泡充满液体或组织变实（如肺炎实变、肺不张等）时，声音更容易通过，从而听起来更响、更清楚。","这是听诊体征，用于辅助判断，并不能单独确诊；通常需要结合症状、体征及影像学检查。"]}
{"word":"laryngophthisis","summary":{"en":"Laryngophthisis is an old term for tuberculosis of the larynx (voice box).","zh":"Laryngophthisis 是一个较旧的术语，指喉部（喉头/声箱）的结核病（喉结核）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, old medical term for tuberculosis (consumption) affecting the larynx (voice box), causing chronic inflammation, ulcers, and a “wasting” condition that can lead to hoarseness and pain.","zh":"一种罕见且偏旧的医学术语，指累及喉部（声箱/喉头）的结核病（“痨病/肺痨”），会引起慢性炎症、溃疡与组织消耗，常导致声音嘶哑、疼痛等症状。"},"examples":[{"en":"In older medical texts, laryngophthisis was described as a cause of progressive hoarseness and throat pain.","zh":"在较早的医学文献中，laryngophthisis 被描述为导致进行性声音嘶哑和咽喉疼痛的原因之一。"},{"en":"The patient’s symptoms suggested laryngophthisis, though today doctors would usually say “laryngeal tuberculosis.”","zh":"患者的症状提示可能是 laryngophthisis，不过今天医生通常会说“喉结核（laryngeal tuberculosis）”。"}]}],"synonyms":["laryngeal tuberculosis","laryngeal phthisis","tuberculosis of the larynx"],"phonetic":"/ləˌrɪŋɡoʊˈθaɪsɪs/","extraExplanation":["词源提示：laryngo- 表示“喉/喉头”，phthisis 源自希腊语，历史上常用来指“消耗性疾病”，尤其是结核（过去中文常译作“痨”）。因此 laryngophthisis 字面含义就是“喉部的消耗性疾病”。","使用场景：该词在现代英语医学中较少见，多出现在19世纪到20世纪早期的医学书写或历史性描述中；现代更常用 laryngeal tuberculosis / tuberculosis of the larynx。"]}
{"word":"laryngoplasty","summary":{"en":"Laryngoplasty is surgery to repair or reshape the larynx to improve voice or breathing.","zh":"Laryngoplasty（喉成形术）是修复或重塑喉部的手术，用于改善发声或呼吸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure on the larynx (voice box) to improve breathing, protect the airway, or change/improve the voice.","zh":"喉成形术：对喉（声带所在的“发声器官”）进行的外科手术，用于改善呼吸、保护气道或改变/改善声音。"},"examples":[{"en":"After the injury, the doctor recommended laryngoplasty to help him speak more clearly.","zh":"受伤后，医生建议做喉成形术来帮助他更清楚地说话。"},{"en":"Some patients need laryngoplasty to reduce airway narrowing and make breathing easier.","zh":"有些患者需要喉成形术来减轻气道狭窄，使呼吸更顺畅。"}]}],"synonyms":["laryngeal surgery","laryngeal reconstruction","larynx repair"],"phonetic":"/ləˈrɪŋɡoʊˌplæsti/","extraExplanation":["词源：laryng(o)- 表示“喉”，-plasty 表示“修复/整形手术”。所以它字面意思就是“喉部整形修复手术”。","在临床上它是个较宽泛的术语，可能涵盖不同具体手术方式（例如为了改善发声、纠正喉部结构问题或帮助呼吸）。具体适应症与术式需要由耳鼻喉科/头颈外科医生根据检查决定。"]}
{"word":"laryngoplegia","summary":{"en":"Laryngoplegia means paralysis of the larynx, often affecting the vocal cords.","zh":"laryngoplegia 指喉部（常为声带）瘫痪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Paralysis of the larynx (voice box), often affecting the vocal cords and causing hoarseness, weak voice, or breathing problems.","zh":"喉麻痹；喉部（发声器官）发生瘫痪，常影响声带，导致声音嘶哑、无力或呼吸困难。"},"examples":[{"en":"The doctor suspected laryngoplegia because her voice was very weak after the surgery.","zh":"医生怀疑她有喉麻痹，因为她手术后声音非常无力。"},{"en":"In severe laryngoplegia, the airway may become narrow and breathing can be noisy.","zh":"在严重的喉麻痹中，气道可能变窄，呼吸会变得有杂音。"}]}],"synonyms":["laryngeal paralysis","vocal cord paralysis","paralysis of the larynx"],"phonetic":"/ləˌrɪŋɡoʊˈpliːdʒə/","extraExplanation":["这是比较少见、偏医学/兽医学的术语：laryngo- 表示“喉”，-plegia 表示“瘫痪”。临床上更常见的说法包括 vocal cord paralysis（声带麻痹/声带瘫痪）或 laryngeal paralysis（喉麻痹）。","常见相关症状：声音嘶哑（hoarseness）、气短（shortness of breath）、说话费力、吞咽呛咳（aspiration）。原因可能包括神经损伤、手术后并发症、肿瘤压迫或炎症等，具体需由医生评估。"]}
{"word":"laryngorrhagia","summary":{"en":"A medical term meaning bleeding from the larynx (voice box).","zh":"醫學用語，指喉部（聲帶盒）出血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bleeding from the larynx (the “voice box”), often noticed as coughing up blood or blood-tinged mucus coming from the throat/airway.","zh":"喉部（喉／“聲帶盒”）出血，常表現為咳血或咳出帶血黏液，來源在喉與上呼吸道。"},"examples":[{"en":"The ENT doctor evaluated her sudden laryngorrhagia after a severe coughing spell.","zh":"耳鼻喉科醫師評估了她在劇烈咳嗽後突然出現的喉出血。"},{"en":"Because laryngorrhagia can affect breathing, the patient was monitored closely in the emergency room.","zh":"由於喉出血可能影響呼吸，病人在急診被密切觀察。"}]}],"synonyms":["laryngeal bleeding","bleeding from the larynx"],"phonetic":"/ləˌrɪŋɡoʊˈreɪdʒə/","extraExplanation":["這是一個相對少見、偏醫學用語的名詞，多見於耳鼻喉科（ENT）語境。常見原因可包括：劇烈咳嗽或用聲過度造成黏膜破裂、喉部外傷、喉部發炎或腫瘤、凝血功能異常或正在使用抗凝血藥等。若有大量或反覆咳血、呼吸困難、聲音明顯改變，通常需要盡快就醫。","字源可拆解為 laryngo-（喉）+ -rrhagia（大量出血／出血），其中 -rrhagia 也見於 hemorrhage（出血）。日常英文中更常用的說法是 “laryngeal bleeding” 或 “bleeding from the larynx”。"]}
{"word":"laryngorrhea","summary":{"en":"Laryngorrhea means an unusually large amount of mucus or fluid coming from the larynx (voice box).","zh":"Laryngorrhea 指喉部分泌物（黏液/痰液）异常增多、流出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Excessive discharge of mucus or fluid from the larynx (voice box), often described as heavy throat secretions.","zh":"（医学）喉（喉头/发声器官）分泌物过多、分泌物流出（常指痰液或黏液很多）。"},"examples":[{"en":"The clinician noted laryngorrhea and persistent throat clearing during the exam.","zh":"临床医生在检查时记录到喉部分泌物过多，并伴随反复清嗓。"},{"en":"In severe respiratory irritation, laryngorrhea may make the voice sound wet or gurgly.","zh":"在严重的呼吸道刺激下，喉部分泌物过多可能让声音听起来湿哑或带“咕噜”感。"}]}],"synonyms":["excessive throat mucus","increased laryngeal secretions","phlegm (general, less precise)"],"phonetic":"/ləˌrɪŋɡoʊˈriə/","extraExplanation":["这是一个非常少见、偏专业的医学词。日常英语里更常用的说法是“excessive throat mucus / lots of phlegm / increased secretions”。","词形来自“laryngo-（喉/喉头）+ -rrhea（流出、分泌物过多）”，类似构词还有“rhinorrhea（流鼻涕）”。"]}
{"word":"laryngoscleroma","summary":{"en":"Laryngoscleroma is a rare chronic infection of the nose/throat area that can create hardened tissue and may block the airway.","zh":"laryngoscleroma 指一种罕见的慢性上呼吸道感染，可致组织硬化并可能造成气道阻塞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, long-lasting infection of the upper airways (especially the nose and throat) that can form hard, scar-like tissue and may narrow the airway.","zh":"一种罕见的慢性上呼吸道感染（尤其累及鼻腔与咽喉），可形成坚硬的硬化/瘢痕样组织，严重时可能导致气道狭窄。"},"examples":[{"en":"The ENT specialist suspected laryngoscleroma because the patient had progressive hoarseness and airway narrowing.","zh":"耳鼻喉科医生因患者声音逐渐嘶哑并出现气道变窄而怀疑是喉硬化病（laryngoscleroma）。"},{"en":"Laryngoscleroma can cause crusting and obstruction in the upper airway.","zh":"喉硬化病可能导致上气道结痂与阻塞。"}]}],"synonyms":["scleroma (medical)","rhinoscleroma (related condition)"],"phonetic":"/ləˌrɪŋɡoʊˌsklɪˈroʊmə/","extraExplanation":["这是一个医学术语，通常与“rhinoscleroma（鼻硬化病）”相关，可向下累及咽喉与喉部；病因多与克雷伯菌属（如Klebsiella rhinoscleromatis）感染有关。","词源可拆解理解：laryngo-（喉）+ scler-（硬、硬化）+ -oma（肿块/病变）。这里的 -oma 表示“病变/疾病”，不一定是肿瘤。","在日常英语中很少出现，多见于医学文献、病例报告或耳鼻喉科/传染病相关语境。"]}
{"word":"laryngoscope","summary":{"en":"A laryngoscope is a medical tool used to look into the larynx and often to help place a breathing tube.","zh":"laryngoscope（喉镜）是用于观察喉部（喉头），并常用于协助气管插管建立气道的医疗器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical instrument with a light and a handle used to look into the throat (larynx) and to help place a breathing tube","zh":"喉镜：一种带光源和手柄的医疗器械，用于观察喉部（喉头），并常用于协助置入气管插管以建立气道"},"examples":[{"en":"The doctor used a laryngoscope to examine the patient’s throat.","zh":"医生用喉镜检查了病人的喉咙。"},{"en":"During anesthesia, a laryngoscope helps the clinician insert a breathing tube safely.","zh":"在麻醉过程中，喉镜帮助医护人员更安全地置入呼吸管（气管插管）。"}]}],"synonyms":["throat scope","intubation scope"],"phonetic":"/ləˈrɪŋɡəˌskoʊp/","extraExplanation":["词源提示：laryng(o)- 来自希腊语，意为“喉、喉头”；-scope 表示“观察工具”（如 microscope 显微镜）。合起来就是“观察喉部的工具”。","使用场景：常见于急诊、麻醉科、耳鼻喉科。它不仅用于“看”，也常用于帮助建立气道（插管）。日常英语里也可说 laryngoscopy（喉镜检查，名词）或 do a laryngoscopy（做喉镜检查）。"]}
{"word":"laryngoscopic","summary":{"en":"“Laryngoscopic” means relating to viewing/examining the larynx with a laryngoscope.","zh":"“laryngoscopic”指与使用喉镜观察或检查喉部有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to examining the larynx (voice box) using a laryngoscope (a viewing instrument).","zh":"与用喉镜检查喉部（声盒）有关的；喉镜检查的。"},"examples":[{"en":"The doctor took a laryngoscopic look at his vocal cords.","zh":"医生用喉镜检查了他的声带。"},{"en":"Laryngoscopic images showed swelling around the larynx.","zh":"喉镜影像显示喉部周围有肿胀。"}]}],"synonyms":["laryngoscopic (examination-related)","laryngoscopy-related","endoscopic (broader term)"],"phonetic":"/ˌlærɪŋɡəˈskɑpɪk/","extraExplanation":["“laryngoscopic”常见于医学语境（耳鼻喉科、麻醉科、急诊等），多用于描述“喉镜检查（laryngoscopy）”相关的观察、影像或操作。","词根提示：laryng- 表示“喉/喉部”，-scop- 表示“看/观察”（也见于 microscope, telescope），-ic 表示“……的”。理解词根有助于记忆。"]}
{"word":"laryngoscopical","summary":{"en":"“Laryngoscopical” means related to examining the larynx with a laryngoscope.","zh":"“laryngoscopical” 指“与用喉镜检查喉部有关的/用于喉镜检查的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or used for examining the larynx (voice box) with a laryngoscope.","zh":"与用喉镜检查喉部（声带所在的“喉”）有关的；用于喉镜检查的。"},"examples":[{"en":"The doctor performed a laryngoscopical exam to check the patient’s vocal cords.","zh":"医生做了喉镜检查来查看患者的声带。"},{"en":"Laryngoscopical findings suggested swelling around the larynx.","zh":"喉镜检查结果提示喉部周围有肿胀。"}]}],"synonyms":["laryngoscopic","laryngoscopy-related","endoscopic (broader)"],"phonetic":"/ləˌrɪŋɡəˈskɑpɪkəl/","extraExplanation":["这是一个医学领域较少见的形容词，常见的表达更偏向：laryngoscopic（喉镜的、喉镜检查的）或 laryngoscopic examination（喉镜检查）。","词根提示：laryng-（喉）+ -scope（观察器械）+ -ical（……的）。理解词根有助于记忆同类医学词汇，如 endoscopic（内镜的）。"]}
{"word":"laryngoscopically","summary":{"en":"“Laryngoscopically” means “by using a laryngoscope to look at the larynx (voice box).”","zh":"“laryngoscopically”表示“通过喉镜检查/观察喉部（声带、喉头）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses a laryngoscope (a medical instrument) to view the larynx (voice box).","zh":"以喉镜检查的方式；通过喉镜观察喉部（声带/喉头）。"},"examples":[{"en":"The vocal cords were examined laryngoscopically before surgery.","zh":"手术前通过喉镜检查了声带。"},{"en":"The doctor confirmed the swelling laryngoscopically.","zh":"医生通过喉镜检查确认了肿胀。"},{"en":"Bleeding was assessed laryngoscopically in the emergency room.","zh":"在急诊室通过喉镜评估了出血情况。"}]}],"synonyms":["by laryngoscopy","with a laryngoscope","using a laryngoscope"],"phonetic":"/ləˌrɪŋɡəˈskɑpɪkli/","extraExplanation":["“laryngoscopically”多见于医学写作（病历、检查报告、论文），日常口语更常说：“with a laryngoscope / using a laryngoscope / by laryngoscopy”。","词根拆分有助记忆：laryng(o)-（喉/喉头）+ -scop-（看、观察；如 microscope 显微镜）+ -ically（以……方式）。"]}
{"word":"laryngoscopies","summary":{"en":"Laryngoscopies are procedures used to examine the larynx (voice box).","zh":"laryngoscopies 指用于检查喉部（声盒/喉头）的喉镜检查（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"medical examinations in which a doctor looks at the larynx (voice box) using a special instrument (a laryngoscope)","zh":"喉镜检查：医生使用喉镜等器械观察喉部（声盒/喉头）的医学检查"},"examples":[{"en":"The ENT specialist performed two laryngoscopies to check her vocal cords.","zh":"耳鼻喉科专科医生做了两次喉镜检查来查看她的声带。"},{"en":"After the surgery, follow-up laryngoscopies showed the swelling was improving.","zh":"手术后，复查喉镜显示肿胀正在好转。"}]}],"synonyms":["larynx exam","throat exam (larynx)","laryngeal examination"],"phonetic":"/ləˌrɪŋˈɡɑskəpi/","extraExplanation":["“laryngoscopies”是复数形式；单数是“laryngoscopy”。","常见用途包括评估声音嘶哑、吞咽困难、慢性咳嗽，或检查声带/喉部是否有炎症、息肉、肿物等。","临床上常见的有“间接喉镜/纤维喉镜（多为门诊）”与“直接喉镜（可能需要麻醉）”，具体方式由症状与检查目的决定。"]}
{"word":"laryngoscopist","summary":{"en":"A laryngoscopist is a clinician who examines the larynx and airway using a laryngoscope.","zh":"laryngoscopist 指使用喉镜检查喉部与气道的医疗专业人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical professional who uses a laryngoscope to examine the larynx (voice box) and nearby airway","zh":"使用喉镜检查喉部（声带/喉头）及邻近气道的医疗专业人员"},"examples":[{"en":"The laryngoscopist examined his vocal cords with a laryngoscope.","zh":"喉镜检查医师用喉镜检查了他的声带。"},{"en":"Before surgery, the laryngoscopist checked her airway to make sure it was clear.","zh":"手术前，喉镜检查医师检查了她的气道，确保通畅。"}]}],"synonyms":["ENT doctor","otolaryngologist","airway specialist"],"phonetic":"/ləˌrɪŋˈɡɑːskəpɪst/","extraExplanation":["这个词在日常英语里很少见，更常见的说法是：ENT doctor（耳鼻喉科医生）、otolaryngologist（耳鼻喉科专科医生）、anesthesiologist（麻醉科医生，常做插管时的喉镜操作）。因此在医院场景中，你可能更多听到“a doctor used a laryngoscope”而不是“laryngoscopist”。","构词法：laryngo- 表示“喉/喉头”，-scop- 表示“观察/镜检”（同根词：microscope, endoscope），-ist 表示“从事某领域的人”。"]}
{"word":"laryngoscopy","summary":{"en":"Laryngoscopy is a medical procedure to look at the voice box (larynx), usually to examine the vocal cords.","zh":"laryngoscopy 指用喉镜观察喉部（喉头）/声带的医学检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical examination in which a doctor looks at your larynx (voice box) and often the vocal cords, using a special instrument (a laryngoscope).","zh":"（医疗）喉镜检查：医生使用专门器械（喉镜）观察喉部（喉头/声门）及常包括声带的检查。"},"examples":[{"en":"The ENT doctor recommended a laryngoscopy to check her vocal cords.","zh":"耳鼻喉科医生建议做喉镜检查来查看她的声带。"},{"en":"A laryngoscopy can help find causes of hoarseness that lasts for weeks.","zh":"喉镜检查可以帮助找出持续数周声音嘶哑的原因。"},{"en":"He was nervous, but the laryngoscopy was quick and not very painful.","zh":"他很紧张，但喉镜检查很快，也不太痛。"}]}],"synonyms":["laryngeal examination","voice box examination"],"phonetic":"/ˌlærɪŋˈɡɑskəpi/","extraExplanation":["“laryng-”表示“喉/喉头”，来自希腊语；“-scopy”表示“观察/检查”。所以 laryngoscopy 字面意思就是“观察喉部的检查”。","常见类型：间接喉镜（用小镜子或内镜）、纤维/软性喉镜（经鼻进入）、硬性喉镜（多用于手术或麻醉下）。日常就诊时常见的是门诊可做的软性喉镜。","在英文就医语境中，ENT=Ear, Nose, and Throat（耳鼻喉科）。如果你看到 “flexible laryngoscopy / direct laryngoscopy” 等词，通常是在说明检查方式或是否需要麻醉。"]}
{"word":"laryngospasm","summary":{"en":"Laryngospasm is a sudden spasm of the vocal cords that blocks airflow and makes breathing difficult.","zh":"喉痉挛是声带突然痉挛收紧，阻塞气流并导致呼吸困难的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden, involuntary tightening (spasm) of the vocal cords that partly or completely blocks airflow into the lungs, causing trouble breathing and a choking/stridor sound.","zh":"喉痉挛：声带（喉部）突然不由自主地紧缩，导致气流部分或完全受阻，从而出现呼吸困难、像窒息一样的感觉或发出尖锐的喘鸣声。"},"examples":[{"en":"During the procedure, the patient briefly developed laryngospasm and needed immediate airway support.","zh":"在操作过程中，患者短暂出现喉痉挛，需要立刻进行气道支持。"},{"en":"Cold water or strong irritation can sometimes trigger laryngospasm in sensitive people.","zh":"冷水或强烈刺激有时会在敏感人群中诱发喉痉挛。"},{"en":"If you can’t breathe and hear a high-pitched sound when inhaling, seek emergency help—it could be laryngospasm.","zh":"如果你吸气困难并听到尖锐的吸气声，应立刻寻求急救帮助——这可能是喉痉挛。"}]}],"synonyms":["vocal cord spasm","glottic spasm"],"phonetic":"/ləˈrɪŋɡoʊˌspæzəm/","extraExplanation":["词源：laryngo- 表示“喉/喉头”，spasm 表示“痉挛”。合起来就是“喉部（声带）发生痉挛”。","语境提示：这是医学术语，常见于麻醉、手术、插管、呛咳、胃酸反流（刺激喉部）等情境的记录或说明。日常口语更可能说 “my throat closed up” 或 “I couldn’t breathe for a moment”，但在医疗场景会用 laryngospasm。","相关词汇：vocal cords（声带），airway（气道），stridor（喘鸣/喉鸣），choking（呛/窒息感），aspiration（误吸）。","学习提示：-spasm（痉挛）也是很多医学词的后半部分，如 bronchospasm（支气管痉挛）。认识这个构词有助于推断意思。"]}
{"word":"laryngostasis","summary":{"en":"Laryngostasis is a medical term for dangerous blockage of airflow at the larynx, leading to severe breathing difficulty.","zh":"Laryngostasis 指喉部气流被阻断的危险状态，会造成严重呼吸困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which airflow is blocked at the larynx (voice box), causing severe difficulty breathing or even temporary cessation of breathing.","zh":"（医学）喉部（声门/喉头）气流受阻的状态，可导致严重呼吸困难，甚至短暂呼吸停止。"},"examples":[{"en":"In rare emergencies, laryngostasis can develop quickly and requires immediate airway support.","zh":"在罕见的急症中，喉阻塞（laryngostasis）可能迅速发生，需要立刻建立气道支持。"},{"en":"The doctor ruled out laryngostasis after checking that the patient’s airway was open.","zh":"医生确认患者气道通畅后，排除了喉阻塞（laryngostasis）的可能。"}]}],"synonyms":["laryngeal obstruction","airway obstruction (at the larynx)","upper airway obstruction"],"phonetic":"/ləˌrɪŋɡoʊˈsteɪsɪs/","extraExplanation":["这是一个较少见、偏专业的医学词，常用于描述“喉部阻塞导致通气受限”的状态，临床上更常见的相关表述包括 laryngeal obstruction（喉梗阻/喉部阻塞）、laryngospasm（喉痉挛）或 airway obstruction（气道阻塞）。具体用词取决于病因（例如痉挛、异物、肿胀、肿瘤等）。","词源上可拆解为 laryngo-（喉/喉头）+ stasis（停滞、停止），字面意思接近“喉部通气停止/停滞”。实际医学语境中多强调气流被阻断而产生的危急呼吸问题。"]}
{"word":"laryngostenosis","summary":{"en":"Laryngostenosis means narrowing of the larynx (voice box), which may affect breathing and voice.","zh":"Laryngostenosis 指喉部（声箱/喉头）狭窄，可能影响呼吸与发声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A narrowing (stenosis) of the larynx (voice box) that can partially block the airway and affect breathing and voice.","zh":"喉狭窄：喉部（声门/喉头）发生变窄（狭窄），可能部分阻塞气道，影响呼吸与发声。"},"examples":[{"en":"The patient developed laryngostenosis after prolonged intubation and needed follow-up with an ENT specialist.","zh":"患者在长时间气管插管后出现喉狭窄，需要耳鼻喉科专科随访。"},{"en":"Severe laryngostenosis can cause noisy breathing (stridor) and shortness of breath.","zh":"严重的喉狭窄会引起喘鸣（吸气时的高调噪音）和呼吸困难。"}]}],"synonyms":["laryngeal stenosis","glottic stenosis (more specific)","subglottic stenosis (more specific)"],"phonetic":"/ləˌrɪŋɡoʊstəˈnoʊsɪs/","extraExplanation":["词源拆解：laryngo- 表示“喉/喉头（larynx）”，-stenosis 表示“狭窄”。合在一起就是“喉部狭窄”。","常见相关语境：多见于医学/耳鼻喉科（ENT）用语。原因可包括长期插管、外伤、感染、肿瘤或术后瘢痕等。症状常涉及声音嘶哑、喘鸣、呼吸费力。"]}
{"word":"laryngostomy","summary":{"en":"A surgical opening into the larynx to help breathing.","zh":"在喉部建立的外科造口，用于帮助呼吸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical opening made into the larynx (voice box) to help a person breathe; the opening itself may also be called a laryngostomy","zh":"（外科）在喉（喉头/声门箱）处建立的呼吸开口；也可指这个开口本身"},"examples":[{"en":"After the accident, the doctors performed a laryngostomy to secure his airway.","zh":"事故后，医生做了喉造口术来确保他的气道通畅。"},{"en":"She learned how to care for the laryngostomy site to prevent infection.","zh":"她学习了如何护理喉造口部位，以预防感染。"}]}],"synonyms":["laryngeal stoma","laryngeostomy"],"phonetic":"/ləˌrɪŋˈɡɑstəmi/","extraExplanation":["词源提示：laryngo- 表示“喉/喉头（larynx）”，-stomy 表示“造口/开口（外科建立的口）”。","易混词：tracheostomy（气管造口术）是在气管建立开口；laryngostomy（喉造口术）是在喉部建立开口。日常语境中更常听到 tracheostomy。","语体与使用：这是医学/外科术语，常见于病历、护理说明、医学论文中，普通日常对话较少用。"]}
{"word":"laryngostroboscope","summary":{"en":"A laryngostroboscope is a device used to view and assess vocal fold vibration using strobe light.","zh":"laryngostroboscope（喉频闪镜）是用频闪光观察并评估声带振动的检查设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical instrument that uses a strobe (flashing) light and a camera to examine the vocal folds (vocal cords) in the larynx, often to evaluate how they vibrate during speech or singing","zh":"一种医学检查仪器，利用频闪（闪光）灯与摄像设备观察喉部的声带（声襞），常用于评估说话或唱歌时声带的振动情况"},"examples":[{"en":"The ENT doctor used a laryngostroboscope to check why her voice was hoarse.","zh":"耳鼻喉科医生用喉频闪镜检查她声音沙哑的原因。"},{"en":"Singers with vocal fatigue may have a laryngostroboscope exam to see how their vocal folds are moving.","zh":"出现嗓音疲劳的歌手可能会做喉频闪镜检查，以观察声带的运动情况。"}]}],"synonyms":["stroboscopic laryngoscope","laryngeal stroboscope","videostroboscope"],"phonetic":"/ləˌrɪŋɡoʊˈstroʊbəˌskoʊp/","extraExplanation":["“laryngo-”表示“喉”， “stroboscope”表示“频闪观察装置”。该检查常被称为“喉频闪检查/喉频闪镜检查”，用于观察声带振动的“慢动作”效果（通过频闪与声带振动频率的配合产生视觉上的减慢）。","临床上常用于评估声音嘶哑、声带结节/息肉、声带麻痹、发声技巧相关问题等；通常由耳鼻喉科（ENT）或嗓音专科进行。"]}
{"word":"laryngotome","summary":{"en":"A laryngotome is a surgical knife used to cut into the larynx (voice box).","zh":"laryngotome 指用于切开喉部（声箱）的外科手术刀/器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical instrument (a type of knife) used to cut into the larynx (voice box), especially in procedures such as a laryngotomy","zh":"喉切开刀；用于切开喉部（发声器官）的外科手术器械，常用于“喉切开术”等操作"},"examples":[{"en":"In an emergency airway procedure, the surgeon prepared a laryngotome.","zh":"在紧急建立气道的手术中，外科医生准备了喉切开刀。"},{"en":"The medical museum displayed a 19th-century laryngotome used for laryngeal surgery.","zh":"医学博物馆展出了一把19世纪用于喉部手术的喉切开刀。"}]}],"synonyms":["laryngotomy knife","laryngeal knife","surgical scalpel (general)"],"phonetic":"/ləˈrɪŋɡəˌtoʊm/","extraExplanation":["词源提示：laryngo- 表示“喉/喉部”，-tome 表示“切割的工具”（同根于 anatomy, lobotomy 中的 -tomy “切开术”）。因此 laryngotome 指“切喉的器械”。","易混词区分：lapanengotomy（喉切开术）是“手术/操作”；laryngotome 是“做这个切开的刀/器械”。另外 tracheotomy（气管切开术）切的是气管而不是喉。"]}
{"word":"laryngotomies","summary":{"en":"“Laryngotomies” means surgical openings into the larynx (plural).","zh":"“laryngotomies”指在喉部进行的外科切开口（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of laryngotomy: surgical openings made into the larynx (voice box), usually to secure an airway in an emergency or during certain procedures.","zh":"laryngotomy 的复数：在喉（声盒）上进行的外科切开口，通常用于紧急或特定手术中建立/维持气道。"},"examples":[{"en":"In rare emergencies, doctors may perform laryngotomies to help a patient breathe.","zh":"在少数紧急情况下，医生可能会进行喉切开术来帮助病人呼吸。"},{"en":"The report compared outcomes after laryngotomies and other airway procedures.","zh":"该报告比较了喉切开术与其他气道手术后的结果。"}]}],"synonyms":["laryngotomy (singular)","airway incision","emergency airway procedure (general)"],"phonetic":"/ˌlærɪŋˈɡɑtəˌmiz/","extraExplanation":["“laryngotomy”由 laryngo-（喉）+ -tomy（切开）构成。日常医学语境里更常见的相关术语是 tracheotomy/tracheostomy（气管切开/造口）以及 cricothyrotomy（环甲膜切开，常用于急救建立气道）；不同术式切开的解剖位置与适用场景不同。","复数形式 laryngotomies 常见于医学论文、手术记录或病例讨论中；普通对话里更常用单数来指“一种手术/术式”。"]}
{"word":"laryngotomy","summary":{"en":"Laryngotomy is a medical term for making a surgical opening in the larynx to create an airway.","zh":"Laryngotomy 指在喉部进行外科切开以建立气道的手术（医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical cut into the larynx (voice box) to open an airway, usually in an emergency when someone cannot breathe.","zh":"（外科）喉切开术：在喉（声盒）处切开以建立气道的手术，多用于紧急情况下呼吸受阻时。"},"examples":[{"en":"In a life-threatening airway blockage, the doctor performed a laryngotomy to help the patient breathe.","zh":"在危及生命的气道阻塞情况下，医生实施了喉切开术来帮助病人呼吸。"},{"en":"A laryngotomy is different from a tracheotomy, which opens the airway lower down in the windpipe.","zh":"喉切开术不同于气管切开术，后者是在更低位置的气管处打开气道。"}]}],"synonyms":["laryngeal incision","laryngeal cut"],"phonetic":"/ˌlærɪŋˈɡɑːtəmi/","extraExplanation":["词源上，laryngo- 来自希腊语，指“喉/喉头”，-tomy 表示“切开”。因此 laryngotomy 字面意思就是“切开喉部”。","在现代医学中，更常见的相关术语是 cricothyrotomy（环甲膜切开术，紧急建立气道的常见做法）与 tracheotomy/tracheostomy（气管切开/气管造口，位置更低、适用情境也不同）。日常英语里 laryngotomy 属于较专业的医学词汇。"]}
{"word":"laryngotracheal","summary":{"en":"A medical adjective meaning “related to the larynx and the trachea.”","zh":"医学形容词，表示“与喉和气管相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the larynx (voice box) and the trachea (windpipe).","zh":"与喉（声箱）和气管（气道）有关的。"},"examples":[{"en":"The doctor examined the patient’s laryngotracheal area to check for swelling.","zh":"医生检查了病人的喉-气管区域，看看是否有肿胀。"},{"en":"Laryngotracheal infections can make breathing and speaking difficult.","zh":"喉-气管感染可能会让呼吸和发声变得困难。"}]}],"synonyms":["laryngeal and tracheal","laryngotracheal (combined form)"],"phonetic":"/ləˌrɪŋɡoʊˈtreɪkiəl/","extraExplanation":["这是一个医学/解剖学形容词，由两部分组成：laryngo-（与“喉”有关）+ tracheal（与“气管”有关）。常见于医学报告或研究中，如“laryngotracheal stenosis”（喉气管狭窄），“laryngotracheal trauma”（喉气管外伤）。日常英语中较少使用，普通表达更常说“the throat and windpipe area”。"]}
{"word":"laryngotracheitis","summary":{"en":"Laryngotracheitis is inflammation of the voice box and windpipe, often linked with croup and a barking cough.","zh":"laryngotracheitis 指喉与气管的炎症，常与哮吼相关，典型表现是犬吠样咳嗽等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the larynx (voice box) and trachea (windpipe), often causing a barking cough and noisy breathing (commonly seen in children).","zh":"喉气管炎：喉（声带处）与气管的炎症，常见表现为“犬吠样”咳嗽和呼吸时的声音（多见于儿童）。"},"examples":[{"en":"The doctor diagnosed the child with laryngotracheitis after hearing the barking cough.","zh":"医生听到孩子的犬吠样咳嗽后，诊断为喉气管炎。"},{"en":"In many cases, laryngotracheitis is caused by a viral infection.","zh":"很多情况下，喉气管炎是由病毒感染引起的。"}]}],"synonyms":["croup (often used for the common clinical condition)","infectious laryngotracheitis (more specific in some medical contexts)"],"phonetic":"/ləˌrɪŋɡoʊˌtreɪkiˈaɪtɪs/","extraExplanation":["在临床上，laryngotracheitis 常常与 “croup（哮吼/急性喉气管支气管炎）”相关或被当作其更正式的医学用语。典型症状包括夜间加重、吸气性喘鸣（stridor）以及声音嘶哑。","词源可拆解理解：laryngo-（喉）+ trache-（气管）+ -itis（炎症）。看到 -itis 结尾的词通常都表示“炎症”（如 tonsillitis 扁桃体炎）。"]}
{"word":"laryngotracheoscopy","summary":{"en":"A scope-based medical exam of the larynx and trachea.","zh":"用内镜检查喉部与气管的医学检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical examination of the larynx (voice box) and trachea (windpipe), usually using a scope (an endoscope) to look inside.","zh":"一种医学检查，用内镜观察喉（声箱）和气管（呼吸道）的内部情况。"},"examples":[{"en":"The doctor scheduled a laryngotracheoscopy to find the cause of his persistent hoarseness.","zh":"医生安排了喉气管镜检查，以查明他持续声音嘶哑的原因。"},{"en":"During the laryngotracheoscopy, the specialist checked for swelling and airway narrowing.","zh":"在喉气管镜检查中，专科医生查看是否有肿胀和气道狭窄。"},{"en":"She was told not to eat or drink for several hours before the laryngotracheoscopy.","zh":"她被告知在喉气管镜检查前数小时不要进食或饮水。"}]}],"synonyms":["laryngotracheal endoscopy","endoscopic examination of the larynx and trachea","laryngoscopy (related)","bronchoscopy (related)"],"phonetic":"/ləˌrɪŋɡoʊˌtreɪkiˈɑskəpi/","extraExplanation":["词源可拆解为：laryngo-（喉）+ tracheo-（气管）+ -scopy（观察、镜检）。常见于医学语境。","临床上可能使用“软式”或“硬式”内镜；有时会配合局部麻醉或轻度镇静，以减少不适并确保检查安全。","相关更常见的近义说法包括：laryngoscopy（喉镜检查）与 bronchoscopy（支气管镜检查，范围更往下到支气管）。"]}
{"word":"laryngotracheotomy","summary":{"en":"A medical operation that opens the larynx and trachea to create an airway.","zh":"一种切开喉部与气管以建立呼吸通道的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation in which the larynx (voice box) and the trachea (windpipe) are opened—usually to create or restore an airway, especially in an emergency","zh":"喉气管切开术；一种外科手术，切开喉部（声门/喉）与气管以建立或恢复呼吸通道，常用于紧急情况下"},"examples":[{"en":"In severe airway obstruction, a laryngotracheotomy may be performed to help the patient breathe.","zh":"在严重气道阻塞时，可能会进行喉气管切开术以帮助病人呼吸。"},{"en":"After the procedure, the medical team closely monitored the airway and breathing.","zh":"手术后，医疗团队会密切监测气道和呼吸情况。"}]}],"synonyms":["laryngotracheostomy","tracheotomy (related)","tracheostomy (related)"],"phonetic":"/ləˌrɪŋɡoʊˌtreɪkiˈɑːtəmi/","extraExplanation":["这个词属于医学专业用语，日常英语里更常见的是 tracheotomy（气管切开术）或 tracheostomy（气管造口术）。很多情况下医生会根据切开的部位与是否形成“造口”来选择术语。","词源可拆解理解：laryngo-（喉）+ tracheo-（气管）+ -tomy（切开）。掌握这些词根有助于理解其他医学词汇，如 laryngitis（喉炎）、trachea（气管）、anatomy（解剖学，字面也含“切开”之意）。"]}
{"word":"laryngotyphoid","summary":{"en":"Laryngotyphoid describes typhoid fever affecting the larynx (voice box).","zh":"laryngotyphoid 指伤寒累及喉部（声箱）的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to typhoid fever that affects the larynx (voice box), especially causing inflammation or ulceration of the larynx; laryngeal typhoid.","zh":"（医）与伤寒累及喉部（声箱）有关的；指伤寒引起的喉部炎症或溃疡等表现。"},"examples":[{"en":"The report described laryngotyphoid ulceration that made swallowing painful.","zh":"报告描述了伤寒所致的喉部溃疡，导致吞咽疼痛。"},{"en":"Because the patient was hoarse, doctors considered laryngotyphoid involvement of the airway.","zh":"由于患者声音嘶哑，医生考虑伤寒可能累及喉部气道。"}]}],"synonyms":["laryngeal typhoid","typhoid with laryngeal involvement"],"phonetic":"/ləˌrɪŋɡoʊˈtaɪfɔɪd/","extraExplanation":["这是一个非常少见、偏历史性的医学用语，常见于旧版病例报告或病理描述中。现代临床更多会用更直白的表达，例如 “typhoid fever with laryngeal involvement（伤寒合并喉部受累）” 或 “laryngeal ulceration in typhoid（伤寒相关喉溃疡）”。","词源上由 laryngo-（喉、喉头）+ typhoid（伤寒）构成，意思就是“喉部的伤寒/伤寒累及喉部”。"]}
{"word":"laryngovestibulitis","summary":{"en":"A medical term for inflammation of the upper entrance area of the larynx.","zh":"医学术语，指喉部入口（喉前庭）区域的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the vestibule of the larynx (the upper part of the voice box just above the vocal cords).","zh":"喉前庭炎：喉部（声门上方、声带上方的喉前庭区域）的炎症。"},"examples":[{"en":"The ENT doctor suspected laryngovestibulitis because the patient had throat pain and hoarseness.","zh":"耳鼻喉科医生因患者咽喉疼痛和声音嘶哑而怀疑是喉前庭炎。"},{"en":"Severe laryngovestibulitis can cause swelling that makes breathing uncomfortable.","zh":"严重的喉前庭炎可能引起肿胀，导致呼吸不适。"}]}],"synonyms":["laryngeal vestibulitis"],"phonetic":"/ləˌrɪŋɡoʊˌvɛstɪbjʊˈlaɪtɪs/","extraExplanation":["这个词是医学复合词：laryngo-（喉）+ vestibul-（前庭/入口）+ -itis（炎症）。在日常英语中很少见，多见于医学文献或病历记录。","相关症状常可包括咽喉疼痛、声音嘶哑、吞咽不适、喉部异物感；严重时可能出现气道肿胀，需要及时就医评估。"]}
{"word":"larynx","summary":{"en":"The larynx is the “voice box” in your throat that contains the vocal cords and helps you speak and breathe.","zh":"larynx 指喉头（声箱），位于喉咙内，包含声带，负责发声并辅助呼吸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The part of your throat that contains the vocal cords; it helps you breathe, speak, and protect your airway (also called the voice box).","zh":"喉头：位于喉咙内、包含声带的部位；帮助呼吸与发声，并保护气道（也称“声箱”）。"},"examples":[{"en":"The doctor checked his larynx because his voice had been hoarse for weeks.","zh":"因为他声音沙哑了好几周，医生检查了他的喉头。"},{"en":"Air passes through the larynx before reaching the lungs.","zh":"空气会先经过喉头，再进入肺部。"},{"en":"Singing lessons can help you use your larynx more efficiently and safely.","zh":"声乐课可以帮助你更高效、更安全地使用喉头。"}]}],"synonyms":["voice box"],"phonetic":"/ˈlær.ɪŋks/","extraExplanation":["“larynx”常见于医学与生物学语境；日常口语更常说“voice box（声箱）”。","和“throat（喉咙）”不同：throat 指整个咽喉区域的统称；larynx 更具体，主要与声带和发声相关。","常见搭配：larynx cancer（喉癌）、laryngitis（喉炎）、vocal cords in the larynx（喉头里的声带）。"]}
{"word":"larynxes","summary":{"en":"“Larynxes” is the plural of “larynx” (the voice box).","zh":"“larynxes”是“larynx（喉头／发声器官）”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of larynx; the two or more “voice boxes” in the throat that contain the vocal cords and help you breathe, speak, and swallow","zh":"larynx（喉／喉头）的复数；指两个或多个“发声器官”（喉头），位于喉咙内，包含声带，帮助呼吸、发声与吞咽"},"examples":[{"en":"Singers learn how to protect their larynxes from strain.","zh":"歌手会学习如何保护自己的喉头，避免过度用嗓。"},{"en":"The doctor checked the patient’s larynxes and vocal cords.","zh":"医生检查了病人的喉头和声带。"}]}],"synonyms":["voice boxes","larynges"],"phonetic":"/ˈlærɪŋksɪz/","extraExplanation":["“larynx”的复数有两种常见写法：larynxes 和 larynges（更偏医学、学术）。日常英语里 larynxes 也很常见。"]}
