{"word":"Las","summary":{"en":"“Las” is most commonly the Spanish word for “the” (feminine plural) when used inside English text; “LAS” can also be an acronym whose meaning depends on context.","zh":"“las”最常见是西班牙语里的“the”（阴性复数），在英语文本中作为借用语出现；“LAS”也可能是缩写，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"(Spanish, used in English contexts) the feminine plural definite article meaning “the,” used before feminine plural nouns (e.g., in names, menus, or quotes).","zh":"（西班牙语词，在英语语境中借用）阴性复数定冠词，相当于“the”，用于阴性复数名词前（常见于名称、菜单或引用中）。"},"examples":[{"en":"The menu listed “las empanadas” under appetizers.","zh":"菜单在开胃菜一栏写着“las empanadas（那些馅饼）”。"},{"en":"In Spanish class, we learned that “las” is used with feminine plural nouns.","zh":"在西班牙语课上，我们学到“las”用于阴性复数名词。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation/acronym read as “las,” used in specific fields (meaning depends on context).","zh":"缩写/首字母词（读作“las”），在不同领域含义不同，需依语境判断。"},"examples":[{"en":"In the medical note, LAS referred to a specific test in that clinic’s system.","zh":"在病历记录里，LAS指的是那家诊所系统中的某项特定检查。"},{"en":"Ask the writer what LAS stands for, because it can mean different things.","zh":"最好问清楚作者LAS代表什么，因为它可能有不同含义。"}]}],"synonyms":["the (in Spanish: las)"],"phonetic":"/læs/","extraExplanation":["在英语里单独写“las”通常不是英语本土词，最常见的情况是直接借用西班牙语（尤其在美国的餐饮、地名、文化语境中）。","如果你指的是全大写“LAS”，它很可能是某个专业缩写（如医疗、商业、科技等），需要你提供一句原文或上下文，我才能给出准确释义。"]}
{"word":"las","summary":{"en":"LAS is most commonly seen as the airport code for Las Vegas; otherwise it can be a field-specific abbreviation.","zh":"LAS最常见是拉斯维加斯的机场代码；其他情况下可能是某领域的专用缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used as the airport code (IATA) for Las Vegas (Harry Reid International Airport).","zh":"常用作机场三字代码（IATA），指美国拉斯维加斯的哈里·里德国际机场。"},"examples":[{"en":"My flight arrives at LAS at 9 p.m.","zh":"我的航班晚上9点到达LAS（拉斯维加斯机场）。"},{"en":"We’re connecting through LAS on the way to California.","zh":"我们去加州的路上要在LAS（拉斯维加斯）转机。"}]},{"partOfSpeech":"other","definition":{"en":"a context-dependent abbreviation in technical or medical writing (meaning varies by field).","zh":"在技术或医学写作中可能出现的缩写（含义随领域而变）。"},"examples":[{"en":"In this report, LAS refers to a specific measurement defined by the authors.","zh":"在这份报告里，LAS指作者定义的某项特定测量指标。"}]}],"phonetic":"/læs/","extraExplanation":["“LAS”本身不是常见的英语词汇，多数情况下是缩写或代码。日常最常见的用法是机场代码（拉斯维加斯）。在学术/医疗/工程文本里看到“LAS”，需要结合上下文或文末的缩写表（abbreviations list）来确认具体含义。","读法通常要么按字母读“L-A-S”，要么在旅行语境里直接读作类似“lass”的音。"]}
{"word":"lasa","summary":{"en":"“Lasa” is usually a place name, and it’s often a misspelling of “Lhasa” (the capital of Tibet).","zh":"“Lasa”通常是地名用法，并且常见为“Lhasa（拉萨，西藏首府）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Lasa: a proper name used for several places; most commonly seen as a misspelling of “Lhasa,” the capital city of Tibet (China).","zh":"Lasa：专有名词，用作一些地名；在英语里最常见的情况是把“Lhasa（拉萨）”误写成“Lasa”。"},"examples":[{"en":"Some people write “Lasa,” but the city’s common English spelling is “Lhasa.”","zh":"有些人会写成“Lasa”，但这座城市常见的英文拼写是“Lhasa”。"},{"en":"Lhasa (sometimes misspelled as Lasa) is known for the Potala Palace.","zh":"拉萨（有时被误写成 Lasa）以布达拉宫闻名。"}]}],"synonyms":["Lhasa"],"phonetic":"/ˈlɑːsə/","extraExplanation":["“Lhasa”的英语拼写来自藏语的转写方式，所以看起来不太符合英语的常见拼读规则；但它的常见读音接近 /ˈlɑːsə/，因此容易被写成更“顺眼”的 Lasa。","如果你指的是别的“Lasa”（例如意大利的一个小镇名、品牌名或缩写），告诉我具体语境（国家/句子/领域），我可以按那个意思补充更准确的词条。"]}
{"word":"lasagna","summary":{"en":"Lasagna is a popular baked Italian pasta dish made with layered pasta sheets, sauce, and cheese.","zh":"Lasagna 指意大利千层面：用面片、酱料和奶酪分层后烤制而成的料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baked Italian dish made with wide pasta sheets layered with sauce (often meat or vegetables), cheese, and sometimes béchamel.","zh":"千层面；一种意大利烤制料理，用宽面片分层夹入酱料（常见为肉酱或蔬菜酱）、奶酪，有时还会加入白酱（béchamel）。"},"examples":[{"en":"We’re having lasagna for dinner tonight.","zh":"我们今晚晚餐吃千层面。"},{"en":"She made vegetarian lasagna with spinach and ricotta.","zh":"她做了菠菜瑞可塔奶酪的素千层面。"},{"en":"In the restaurant, the lasagna comes out bubbling hot from the oven.","zh":"在餐厅里，千层面从烤箱端出来时还在咕嘟冒泡，非常烫。"}]}],"synonyms":["layered pasta bake","pasta casserole"],"phonetic":"/ləˈzɑːnjə/","extraExplanation":["“Lasagna”在美式英语里既可指整道“千层面”，也常被当作不可数名词指“千层面这道菜”（例如：I love lasagna）。在菜单或点餐时也会看到复数形式“lasagnas”，表示不同种类的千层面。","拼写提示：常见误拼为 *lasagne*（英式拼法更常见）或 *lasanga*（错误）。","文化小点：在美国，“lasagna”常被视为家常聚餐或节日聚会的“comfort food（治愈系食物）”，也常与《加菲猫 Garfield》爱吃千层面的形象联系在一起。"]}
{"word":"lasagnas","summary":{"en":"“Lasagnas” is the plural of “lasagna,” meaning one or more portions or types of the layered baked pasta dish.","zh":"“Lasagnas”是“lasagna”的复数，指一份以上或多种类型的意大利千层面（层叠烤焗宽面）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baked Italian dish made with layers of wide pasta sheets, sauce (often tomato and/or béchamel), cheese, and sometimes meat or vegetables.","zh":"一种意大利烤焗料理，由宽面片层层叠放，搭配酱汁（常见番茄酱和/或白酱）、奶酪，有时加入肉类或蔬菜。"},"examples":[{"en":"We ordered two lasagnas for the party—one meat and one vegetarian.","zh":"我们为聚会点了两份千层面——一份肉酱的，一份素食的。"},{"en":"Leftover lasagnas often taste even better the next day.","zh":"剩下的千层面第二天吃常常更好吃。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of lasagna (the dish) or, less commonly, individual portions/types of lasagna.","zh":"lasagna（千层面）的复数形式；也可指不同种类/不同份的千层面（较少见）。"},"examples":[{"en":"Their menu has several lasagnas, including spinach and mushroom.","zh":"他们的菜单上有好几种千层面，包括菠菜蘑菇口味。"},{"en":"She made mini lasagnas in ramekins for each guest.","zh":"她用小烤盅给每位客人做了迷你千层面。"}]}],"synonyms":["lasagna (singular)","lasagne (variant spelling)"],"phonetic":"/ləˈzɑːnjə/","extraExplanation":["“Lasagna”来自意大利语；在英语里通常把它当作可数名词使用（a lasagna / two lasagnas）。你也可能见到拼写“lasagne”，在英式英语中更常用，既可指这道菜也可指面片。"]}
{"word":"lasagne","summary":{"en":"Lasagne is an Italian baked pasta dish made of layered pasta sheets, sauce, and cheese.","zh":"Lasagne 指意大利千层面：由层层面皮、酱汁和奶酪烤制而成的面食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baked Italian pasta dish made with wide flat pasta sheets layered with sauce (often meat ragù and/or tomato), cheese (often ricotta and mozzarella), and sometimes vegetables.","zh":"千层面：一种意大利烤制面食，用宽扁的面皮一层层铺叠，夹入酱汁（常见肉酱和/或番茄酱）、奶酪（常见里考塔、马苏里拉）以及有时加入蔬菜。"},"examples":[{"en":"We’re having lasagne for dinner tonight.","zh":"我们今晚晚餐吃千层面。"},{"en":"She made a vegetarian lasagne with spinach and mushrooms.","zh":"她做了一个素食千层面，用了菠菜和蘑菇。"},{"en":"A slice of lasagne is filling, so I’ll share one with you.","zh":"一块千层面很顶饱，所以我跟你分着吃。"}]}],"synonyms":["lasagna"],"phonetic":"/ləˈzɑːnjə/","extraExplanation":["拼写提示：英式英语常写作 “lasagne”（也常指复数的面皮），美式英语更常见 “lasagna”。两者在日常使用中通常都表示这道“千层面”菜。"]}
{"word":"lasagnes","summary":{"en":"“Lasagnes” means more than one lasagne/lasagna (baked layered pasta dish).","zh":"“Lasagnes”指不止一份（多份）千层面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of lasagne/lasagna: baked Italian pasta made with wide sheets layered with sauce (often meat or vegetables) and cheese.","zh":"lasagne/lasagna 的复数：一种意大利烤箱千层面，用宽面片分层叠加酱汁（常见有肉酱或蔬菜）和奶酪烤制而成。"},"examples":[{"en":"They ordered two lasagnes for the table: one meat and one vegetarian.","zh":"他们点了两份千层面：一份肉酱的，一份素食的。"},{"en":"Frozen lasagnes are convenient, but homemade ones usually taste better.","zh":"冷冻千层面很方便，但自制的通常更好吃。"}]}],"synonyms":["lasagnas","lasagne (UK singular)","lasagna (US singular)"],"phonetic":"/ləˈzɑːnjəz/","extraExplanation":["“Lasagne/lasagna”有拼写差异：在英式英语里更常见单数 lasagne、复数 lasagnes；在美式英语里更常见 lasagna、复数 lasagnas。它们指的食物基本相同。","词源来自意大利语 lasagna/lasagne，原意与“锅、容器/面片”相关，后来特指这种“层层叠加”的烤面食。"]}
{"word":"lasarwort","summary":{"en":"Laserwort is a common name for certain umbrella-flowered plants in the carrot family (often *Laserpitium*).","zh":"Laserwort 是某些伞形科植物（常指 *Laserpitium* 属）的俗名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (especially in the carrot family, Apiaceae), often referring to species in the genus *Laserpitium*; it has umbels of small flowers and was traditionally connected with aromatic resins.","zh":"一种植物名（多指伞形科 Apiaceae），常用来称呼“激光草属/香树脂草属”（*Laserpitium*）等植物；开伞形小花，传统上与芳香树脂的名称有关。"},"examples":[{"en":"In the field guide, laserwort is listed among other members of the carrot family.","zh":"在野外植物图鉴里，laserwort 和其他伞形科植物一起被列出。"},{"en":"The hillside was dotted with wild laserwort in early summer.","zh":"初夏时，山坡上零星长着野生的 laserwort。"}]}],"synonyms":["Laserpitium (genus name)","Apiaceae (plant family)"],"phonetic":"/ˈleɪzərˌwɝt/","extraExplanation":["你输入的 **lasarwort** 很可能是 **laserwort** 的拼写误差；标准拼写一般是 *laserwort*。","词名里的 **laser-** 在这里通常不是“激光（laser）”的意思，而更接近拉丁语中指某种芳香树脂的词根；因此它是植物学/传统名称的“历史遗留词”。"]}
{"word":"lascar","summary":{"en":"“Lascar” is a historical term for a South Asian sailor, especially one who worked on British/European ships.","zh":"“lascar”是历史用语，主要指在英欧船只上工作的南亚水手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sailor (especially from South Asia) employed on European or British merchant ships, common in the 1700s–1900s; now mostly historical","zh":"（尤指18—20世纪）受雇于欧洲/英国商船的南亚水手；现多为历史用语"},"examples":[{"en":"The novel mentions a lascar crew working on a British ship.","zh":"小说提到一群在英国船上工作的南亚水手。"},{"en":"In port cities, lascars often lived in lodging houses near the docks.","zh":"在港口城市里，南亚水手常住在码头附近的客栈。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a soldier or camp follower in South Asia","zh":"（历史用语）南亚的士兵或随军人员"},"examples":[{"en":"Some old records use “lascar” to mean a local soldier hired by colonial forces.","zh":"一些旧档案用“lascar”指殖民军队雇佣的本地士兵。"}]}],"synonyms":["sailor","seaman","crewman","mariner (literary)"],"phonetic":"/ˈlæskɑr/","extraExplanation":["“lascar”是历史语境中的词，常见于殖民时期的航海、港口与移民叙事。现代英语里较少用来指现实中的人，写作时更常用于描述当时的社会与劳动体系。","词源可追溯到波斯语/乌尔都语等语言中表示“军队、营地”的词（如 lashkar 一类），后来在英语里逐渐固定为“（南亚）水手”等含义。","文学与历史写作中常见搭配：lascar seaman（南亚水手）、lascar crew（南亚船员）。阅读旧文本时，它通常指来自印度次大陆的海员群体。"]}
{"word":"lascaree","summary":{"en":"Lascaree is a historical word (a variant of “lascar”) meaning a South Asian sailor or soldier employed on European ships, especially in colonial-era contexts.","zh":"Lascaree 是历史用语（“lascar”的一种拼写/变体），指在欧洲船只上受雇的南亚水手或士兵，常见于殖民时代语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) a sailor or soldier from South Asia (especially India) employed on European ships or in colonial service; essentially the same as “lascar.”","zh":"（历史用语）在欧洲船只或殖民机构中受雇的南亚（尤指印度）水手或士兵；基本同“lascar（印度水手）”。"},"examples":[{"en":"The novel mentions a lascaree working aboard a British trading ship.","zh":"小说中提到一名在英国商船上工作的印度水手（lascaree）。"},{"en":"In old port records, lascarees are listed alongside European crew members.","zh":"在旧港口档案里，lascaree 常与欧洲船员一起被登记。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a member of a group of South Asian seamen collectively; “lascar” used as a collective term in older writing.","zh":"（少见）泛指一群南亚海员；在较旧的文本中，“lascar”有时可作集合名词使用，lascaree 也可见此用法。"},"examples":[{"en":"The captain wrote that the lascaree were skilled at handling the sails in rough weather.","zh":"船长写道，这些南亚水手（lascaree）在恶劣天气下操帆很熟练。"}]}],"synonyms":["lascar","South Asian sailor","Indian sailor"],"phonetic":"/ˌlæskəˈriː/","extraExplanation":["“lascaree”是较少见的拼写/变体，更常见的是“lascar”。该词多出现在18–19世纪的航海、殖民与贸易语境中，现代英语里带有明显的历史色彩。","它在旧文献中有时带有殖民时代的阶层与族群标记；当代写作若使用，通常需要注意语境与语气，或改用更中性的表达（如“South Asian sailor/crew member”）。"]}
{"word":"lascarine","summary":{"en":"Lascarine means ‘of/relating to lascars’ (South Asian sailors in colonial-era shipping), and can rarely mean a lascar.","zh":"lascarine 指“与拉斯卡（殖民时期南亚水手/劳工）有关的”，少数情况下也可指“拉斯卡本人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to lascars (sailors or workers from South Asia who were employed on European ships, especially during the colonial era).","zh":"与“拉斯卡（lascar）”有关的；指（殖民时期常见的）受雇于欧洲船只的南亚水手或劳工的。"},"examples":[{"en":"The novel mentions lascarine sailors working below deck during the long voyage.","zh":"小说提到在漫长航程中在甲板下工作的南亚水手。"},{"en":"Records from the port describe a lascarine crew arriving with the merchant ship.","zh":"港口档案记载，一艘商船抵达时带来一支南亚船员队伍。"}]},{"partOfSpeech":"n.","definition":{"en":"A lascar; a sailor or seaman from South Asia (rare/old-fashioned).","zh":"拉斯卡；南亚水手（较少见/偏旧式用法）。"},"examples":[{"en":"In older texts, a ‘lascarine’ might be listed among the ship’s crew.","zh":"在较旧的文本中，“lascarine”有时会被列为船员之一。"}]}],"synonyms":["lascar","seafaring (contextual)","maritime (contextual)"],"phonetic":"ˈlæskəˌrin","extraExplanation":["“lascar”一词历史上常见于英帝国的航海与港口语境，指来自印度、孟加拉、斯里兰卡等地、在欧洲商船或军舰上工作的船员/劳工。它带有明显的殖民时代背景：在一些文献中可能是中性职业称呼，但也可能夹带当时的阶级与种族偏见。阅读旧文学或史料时，注意其语境与作者立场。"]}
{"word":"lascars","summary":{"en":"“Lascars” is the plural of “lascar,” meaning Asian sailors (especially Indian) who historically worked on European, particularly British, ships.","zh":"“lascars”是“lascar”的复数，指历史上在欧洲（尤指英国）船只上工作的亚洲水手（尤其是印度水手）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sailor or seaman from South or Southeast Asia (especially India) who worked on European ships, particularly British merchant ships, in the past","zh":"（旧时尤指在英国等欧洲商船上工作的）南亚或东南亚水手，常指印度水手"},"examples":[{"en":"In the 1800s, many British ships employed lascars on long voyages.","zh":"在19世纪，许多英国船只在远航中雇用拉斯卡尔水手。"},{"en":"The novel mentions lascars working below deck in difficult conditions.","zh":"小说提到拉斯卡尔水手在甲板下艰苦地工作。"}]}],"synonyms":["seamen","sailors","crewmen"],"phonetic":"/ˈlæskɑr/","extraExplanation":["“lascar”常见于历史、殖民与海洋题材文本（如19世纪英国航运、港口与移民史）。它带有时代色彩：当时欧洲航运体系中对来自南亚/东南亚船员的通称，今天在一般英语中较少用，使用时多为历史语境。","词源上与波斯语/乌尔都语中表示“军人、营地随从”的词有关，后在英语里固定指在欧洲船上工作的亚洲船员。"]}
{"word":"laschety","summary":{"en":"“laschety” is not a standard English word; it’s likely a misspelling or a proper name. Share the context and I’ll help identify the intended word.","zh":"“laschety”不是标准英语单词，可能是拼写错误或专有名词。把上下文发来我可以帮你判断原本想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “laschety” does not appear in common English dictionaries and is likely a misspelling or a name.","zh":"不是标准英语单词。“laschety”在常见英语词典中找不到，可能是拼写错误或专有名词（如人名/品牌名）。"},"examples":[{"en":"I can’t find “laschety” in a dictionary—could you share the sentence you saw it in?","zh":"我在词典里找不到“laschety”——你能把它出现的句子发我吗？"},{"en":"Did you mean “laxity” (not being strict) or another word?","zh":"你是不是想写“laxity”（不严格/松懈）或别的词？"}]}],"extraExplanation":["“laschety”看起来像拼写错误。最接近、且较常见的可能词之一是 **laxity**（/ˈlæksəti/，表示“松懈、不严格”），但需要你提供上下文才能准确判断。","如果你把原句/截图发来，我可以帮你：①确认正确拼写；②解释词义与用法；③给出同义词与例句。"]}
{"word":"lascivient","summary":{"en":"“Lascivient” is an uncommon adjective meaning sexually lustful or lewd in an inappropriate way (more commonly: “lascivious”).","zh":"“lascivient”是一个不常用的形容词，表示不恰当地表现出性欲、猥亵/淫荡（更常见写法：lascivious）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Showing strong sexual desire in a way that is considered inappropriate; lustful or lewd.","zh":"（不常用）指以被认为不恰当的方式表现出强烈性欲；淫荡的、猥亵的。"},"examples":[{"en":"The film was criticized for its lascivient scenes.","zh":"这部电影因其猥亵的场景而受到批评。"},{"en":"He made a lascivient remark that made everyone uncomfortable.","zh":"他说了一句猥亵的话，让大家都很不舒服。"}]}],"synonyms":["lascivious","lewd","lustful","salacious","licentious"],"phonetic":"/ləˈsɪviənt/","extraExplanation":["“lascivient”在现代英语中非常少见，更常见、更标准的词是 **lascivious**（意思相同）。如果你是在文章或字幕里看到“lascivient”，也可能是拼写变体或拼写错误。","词源与“lascivious”相同，来自拉丁语 *lascivus*（意为“好色的、放纵的”）。在语体上偏正式/文学或批评语境，日常对话里更常用 **lewd**、**dirty-minded**、**creepy**（语气不同）。"]}
{"word":"lasciviently","summary":{"en":"“Lasciviously” means in a sexually suggestive, often offensive or inappropriate way.","zh":"“Lasciviously”表示“以带有强烈性暗示、常令人不适或不恰当的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sexually suggestive way; showing or expressing strong sexual desire in an offensive or inappropriate manner.","zh":"以淫荡/猥亵的方式；带有令人不适或不恰当的强烈性暗示。"},"examples":[{"en":"He made a lasciviously suggestive comment to a coworker.","zh":"他对同事说了一句带有猥亵性暗示的话。"},{"en":"The man stared lasciviously, making her feel unsafe.","zh":"那个男人用猥亵的目光盯着她，让她感到不安全。"}]}],"synonyms":["lewdly","lustfully","salaciously","obscenely"],"phonetic":"/ləˈsɪviəsli/","extraExplanation":["你输入的拼写“lasciviently”不常见，通常是“lasciviously”（副词）的拼写误差。对应形容词是“lascivious”（淫荡的/猥亵的）。","词源来自拉丁语 lascivus，含义与“放纵、好色”相关。现代英语中语气偏强，常用于批评不尊重他人、带骚扰意味的言行。使用时要注意语境与礼貌。"]}
{"word":"lascivious","summary":{"en":"“Lascivious” means sexually suggestive or lustful in an improper, offensive way.","zh":"“lascivious”指以不当、冒犯的方式表现出强烈的性暗示或色欲（贬义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling or showing strong sexual desire in a way that is considered rude, inappropriate, or morally unacceptable.","zh":"（以被认为粗俗、不合宜或不道德的方式）好色的，淫荡的，淫猥的。"},"examples":[{"en":"The novel describes a lascivious nobleman who uses power to harass others.","zh":"小说描写了一位好色的贵族，利用权势骚扰他人。"},{"en":"His lascivious comments made everyone uncomfortable.","zh":"他那些淫猥的评论让大家都很不舒服。"}]}],"synonyms":["lewd","lustful","salacious","licentious","indecent"],"phonetic":"/ləˈsɪviəs/","extraExplanation":["“lascivious”是明显的贬义词，常用于批评带有冒犯性或不当的性暗示行为/言论；语气比“sexy”或“flirtatious（调情的）”更负面、更严厉。","词源来自拉丁语，和“lust（色欲）”这类词在语义上接近；在文学或新闻语境里常用来营造道德批判或揭露丑闻的语气。","常见搭配：lascivious look/glance（淫荡的目光）、lascivious smile（不怀好意的笑）、lascivious behavior（淫乱/不当性行为）、lascivious remarks（猥亵言论）。注意在正式场合使用时通常指控意味较强。"]}
{"word":"lasciviously","summary":{"en":"“Lasciviously” means ‘in an offensively sexual, lewd way.’","zh":"“lasciviously”指“以淫荡、猥亵、令人反感的性方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a strongly sexual way that feels inappropriate, offensive, or morally wrong.","zh":"以淫荡的、下流的方式；带有让人不适或被冒犯的强烈性意味。"},"examples":[{"en":"He stared at her lasciviously, making her uncomfortable.","zh":"他用淫荡的眼神盯着她看，让她很不舒服。"},{"en":"The man spoke lasciviously to the staff and was asked to leave.","zh":"那名男子对工作人员说下流话，结果被请出去了。"}]}],"synonyms":["lewdly","obscenely","salaciously"],"phonetic":"/ləˈsɪviəsli/","extraExplanation":["这个词语气很重，通常带有明确的负面评价，常见于批评“猥亵、性骚扰式”的眼神、言语或行为。日常更中性的表达可用“sexually / flirtatiously（带性意味地/调情地）”，但“lasciviously”通常强调“令人反感或不当”。","词源来自拉丁语 lascivus（放纵、好色）。在法律或新闻语境中，有时会用来描述“淫秽/猥亵”的行为或内容。"]}
{"word":"lasciviousness","summary":{"en":"Lasciviousness means strong, often offensive sexual desire or behavior (lustfulness).","zh":"lasciviousness 指强烈且常带冒犯性的性欲或性行为（好色、淫荡）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong, often offensive sexual desire or behavior; lustfulness","zh":"强烈且常带冒犯性的性欲或性行为；淫荡、好色"},"examples":[{"en":"The novel criticizes the character’s lasciviousness and lack of self-control.","zh":"这部小说批评了这个角色的好色和缺乏自制力。"},{"en":"The policy was meant to protect minors from content that promotes lasciviousness.","zh":"该政策旨在保护未成年人免受宣扬淫荡内容的影响。"}]}],"synonyms":["lustfulness","lewdness","licentiousness","salaciousness"],"phonetic":"/ləˈsɪviəsnəs/","extraExplanation":["“lasciviousness”语气较强，常用于正式写作、法律或道德评价中，带明显的负面色彩，含“淫秽、下流”的指责意味。日常口语里更常说“lust”或“being horny”（但后者更口语、语境需谨慎）。","词源来自拉丁语，核心含义是“欲望强烈、放纵”。常见搭配有：lasciviousness of the gaze（淫邪的目光）、accusations of lasciviousness（好色/淫荡的指控）、lasciviousness and debauchery（淫荡与放荡）。"]}
{"word":"lasciviousnesses","summary":{"en":"“Lasciviousnesses” means multiple instances or forms of lustful, lewd, or offensively sexual behavior/attitudes (formal, negative).","zh":"“lasciviousnesses”指多种或多次“淫荡/好色/带不当性暗示”的行为或态度（正式用语，强烈贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “lasciviousness”: the quality or state of being lustful or sexually suggestive in an offensive or inappropriate way.","zh":"“lasciviousness”的复数：指“淫荡/好色/带有不当性暗示”的状态或特质（通常带负面评价）。"},"examples":[{"en":"The novel criticizes the lasciviousnesses of the powerful men who exploit others.","zh":"这部小说批判那些有权势的男人利用他人时表现出的种种淫邪行径。"},{"en":"The report lists several lasciviousnesses in his messages, including explicit comments and requests.","zh":"报告列出了他信息里多处不当性暗示的内容，包括露骨的评论和要求。"}]}],"synonyms":["lewdnesses","licentiousnesses","lustfulnesses","obscenities","indecencies"],"phonetic":"/ləˈsɪviəsnəsɪz/","extraExplanation":["“lasciviousnesses”很少在日常口语中出现，因为“lasciviousness（淫邪/好色）”本身多为不可数或抽象名词；写成复数通常是为了强调“多种表现/多次事件/不同类型的淫邪行为”，常见于评论、法律或学术写作。","词源上来自拉丁语词根，和“lascivious（淫荡的/好色的）”同源；语气偏正式、带强烈道德批评色彩。日常表达更常用“lust”“lewd behavior”“sexually explicit comments”等。"]}
{"word":"lase","summary":{"en":"Lase means to emit laser light, or to use a laser for a task (often in technical contexts).","zh":"Lase 指发射激光，或用激光进行某项操作（多见于技术语境）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to produce a thin, powerful beam of light using a laser; to emit laser light","zh":"（用激光器）发射激光；产生一束细而强的光束"},"examples":[{"en":"The device lases in short pulses.","zh":"这个装置以短脉冲方式发射激光。"},{"en":"When enough energy builds up, the crystal starts to lase.","zh":"当能量积累到足够时，晶体就开始产生激光。"}]},{"partOfSpeech":"vt.","definition":{"en":"to use a laser on something (for measuring, scanning, cutting, or targeting)","zh":"用激光对某物进行测量、扫描、切割或瞄准"},"examples":[{"en":"Technicians lased the part to check its exact dimensions.","zh":"技术员用激光测量该零件，以检查其精确尺寸。"},{"en":"The robot lased the metal sheet before cutting.","zh":"机器人在切割前用激光扫描了金属板。"}]}],"synonyms":["emit laser light","laser","beam","scan (with a laser)"],"phonetic":"/leɪz/","extraExplanation":["“lase”来自“laser”（激光）。在日常英语里更常见的说法是用“use a laser / laser (something)”而不是“lase”，因为“lase”更偏技术语境（物理、工程、光学）。","在科学写作中，“lase”常用于描述介质“开始产生激光”的状态，例如“the medium begins to lase（介质开始产生激光）”。"]}
{"word":"lased","summary":{"en":"“Lased” means “used a laser to emit a beam or to treat something,” and it’s the past form of “lase.”","zh":"“lased”是“lase”的过去式/过去分词，表示“用激光发射光束或用激光处理某物”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “lase”: to produce or send out a narrow, powerful beam of light using a laser (often used in science, medicine, and technology).","zh":"“lase”的过去式和过去分词：用激光产生或发射一束狭窄而强的光束（常用于科学、医疗与技术领域）。"},"examples":[{"en":"The scientist lased the sample to measure its composition.","zh":"科学家用激光照射样品以测量它的成分。"},{"en":"In the procedure, the doctor lased the tissue very precisely.","zh":"在手术中，医生非常精确地用激光处理组织。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common, informal) treated or removed with a laser; often written as “lasered” in general writing.","zh":"（较少见，非正式）用激光处理或去除；在一般写作中更常写作“lasered”。"},"examples":[{"en":"She had a tattoo lased off last year.","zh":"她去年用激光把纹身去掉了。"},{"en":"The scratches were lased away to make the surface smooth.","zh":"这些划痕被用激光去除，使表面变得光滑。"}]}],"synonyms":["lasered","irradiated (with a laser)","beamed (with a laser)"],"phonetic":"/leɪzd/","extraExplanation":["“lased”来自动词“lase”（/leɪz/）。在日常英语里，很多人更习惯用“laser”当动词（如：The doctor lasered the area），所以你也会常看到“lasered”。在更偏技术/学术的语境中，“lase / lased”更常见。","与“lased”相关的名词是“laser”（激光器/激光），以及“laser beam”（激光束）。"]}
{"word":"laser","summary":{"en":"A laser is a device that produces a focused beam of light; it can also mean using such a beam to cut, scan, or treat something.","zh":"Laser 指能发出聚焦光束的“激光器/激光”，也可作动词表示“用激光进行切割、扫描或治疗”等处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that produces a very strong, narrow beam of light, used in science, medicine, industry, and everyday technology","zh":"激光器；能发出非常强、非常窄的光束的装置，用于科学、医疗、工业及日常科技"},"examples":[{"en":"The surgeon used a laser to remove the tissue with great precision.","zh":"外科医生用激光非常精确地去除组织。"},{"en":"Laser printers are common in offices because they print quickly and clearly.","zh":"激光打印机在办公室很常见，因为打印又快又清晰。"}]},{"partOfSpeech":"v.","definition":{"en":"to use a laser on something (for example, to cut, remove, scan, or treat)","zh":"用激光处理（如切割、去除、扫描或治疗）"},"examples":[{"en":"They laser-cut the metal into thin, detailed shapes.","zh":"他们用激光切割金属，做成薄而精细的形状。"},{"en":"The clinic can laser the tattoo off, but it may take several sessions.","zh":"诊所可以用激光去除纹身，但可能需要多次治疗。"}]}],"synonyms":["laser beam","laser light"],"phonetic":"/ˈleɪzɚ/","extraExplanation":["“laser”是缩写，来自“Light Amplification by Stimulated Emission of Radiation”，中文常译为“受激辐射光放大”。在日常英语里它通常直接当作普通名词使用，不需要记住全称也能正常理解。","常见搭配：laser beam（激光束）、laser pointer（激光笔/指示器）、laser surgery（激光手术）、laser-cut（激光切割的，常作形容词/过去分词）。"]}
{"word":"laser printer","summary":{"en":"A laser printer is a printer that uses a laser and toner to print quickly and clearly.","zh":"激光打印机是利用激光与碳粉进行快速、清晰打印的打印机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printer that uses a laser and toner powder to produce fast, sharp text and images on paper.","zh":"一种使用激光和碳粉在纸上快速打印清晰文字与图像的打印机。"},"examples":[{"en":"We use a laser printer at the office because it prints reports quickly.","zh":"我们办公室用激光打印机，因为它打印报告很快。"},{"en":"Laser printers usually produce sharper text than many inkjet printers.","zh":"激光打印机通常比许多喷墨打印机打印出的文字更清晰。"},{"en":"If the page is faded, you may need to replace the toner in the laser printer.","zh":"如果页面很淡，你可能需要更换激光打印机的碳粉。"}]}],"synonyms":["laserjet printer","toner printer"],"phonetic":"/ˈleɪzər ˈprɪntər/","extraExplanation":["“laser printer”是一个复合名词：laser（激光）+ printer（打印机）。工作原理一般是：激光在感光鼓上形成静电图像→碳粉附着→加热定影到纸上，因此常见优点是速度快、文字锐利、适合大量文档；常见消耗品叫toner（碳粉），而喷墨打印机用的是ink（墨水）。"]}
{"word":"laserdisk","summary":{"en":"A LaserDisc is an older, large optical video disc format used to watch movies before DVDs became common.","zh":"LaserDisc是一种较早的大型光学影像光盘格式，在DVD普及前用于观看电影等视频。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large optical disc used mainly in the late 1970s–1990s to play movies and other video, similar in purpose to a DVD but bigger and older","zh":"一种大型光盘影像格式，主要流行于20世纪70年代末到90年代，用来播放电影等视频；用途类似DVD，但体积更大、年代更早"},"examples":[{"en":"My uncle still has a LaserDisc player and a shelf of old movies.","zh":"我叔叔还留着一台LaserDisc播放器和一整架老电影光盘。"},{"en":"Before DVDs became common, some film fans collected LaserDiscs for better picture quality.","zh":"在DVD普及之前，有些影迷会收藏LaserDisc，因为画质更好。"}]}],"synonyms":["LaserDisc (capitalized)","laser disc"],"phonetic":"/ˈleɪzərdɪsk/","extraExplanation":["LaserDisc（常写作两个词：LaserDisc / laserdisc）通常是直径约12英寸（约30厘米）的光盘，外形像超大的CD。","它在当年常被认为画质/音质比VHS录像带更好，但设备和光盘更贵、也更占空间，因此更偏向发烧友与影迷收藏。","有些LaserDisc会分“单面/双面”播放，某些电影需要翻面或换盘；这也是它在使用便利性上不如后来DVD的原因之一。"]}
{"word":"laserdisks","summary":{"en":"Laserdisks are large optical discs used for playing movies—an older video format from before DVDs.","zh":"Laserdisks 指激光影碟：DVD 之前常见的一种大型光盘电影格式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large optical disc used to store and play movies (an older video format, popular before DVDs)","zh":"激光影碟（用于存储和播放电影的大型光盘；DVD普及前较常见的旧式视频格式）"},"examples":[{"en":"My dad still has a shelf full of laserdisks from the 1990s.","zh":"我爸爸还留着一整架 1990 年代的激光影碟。"},{"en":"Some films were released on laserdisks with special features like director commentary.","zh":"有些电影会发行激光影碟版本，并附带导演解说等特别内容。"}]}],"synonyms":["LaserDisc","laser discs","optical discs (general)"],"phonetic":"/ˈleɪzərˌdɪsks/","extraExplanation":["“LaserDisc”（激光影碟）通常直径约 30 厘米（12 英寸），看起来像一张很大的 CD。它在 1970–1990 年代较常见，画质在当时很不错，但碟片大、价格高，也不能像 DVD 那样方便地存储更多内容，因此后来被 DVD 和蓝光取代。","写法上更常见的是单数/复数形式 “laserdisc / laserdiscs”。也有人写成 “laser disk(s)”，但在影音产品语境里 “LaserDisc” 更像一个格式名称。"]}
{"word":"lasered","summary":{"en":"“Lasered” usually means something was treated or done using a laser, or (informally) that someone pointed a laser pointer at something.","zh":"“Lasered”通常表示“用激光处理/加工过”，也可（非正式）表示“用激光笔对准/照射”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “laser”: to cut, remove, shape, measure, or treat something using a laser (a focused beam of light).","zh":"“laser”的过去式/过去分词：用激光（高度聚焦的光束）来切割、去除、塑形、测量或处理某物。"},"examples":[{"en":"The lab lasered tiny holes into the metal plate.","zh":"实验室用激光在金属板上打出微小的孔。"},{"en":"The surgeon lasered away the damaged tissue.","zh":"外科医生用激光去除了受损组织。"},{"en":"The company lasered the logo onto the glass.","zh":"公司用激光把标志刻到玻璃上。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) past tense of “laser”: to point a laser pointer at someone or something.","zh":"（非正式）“laser”的过去式：用激光笔对准某人或某物。"},"examples":[{"en":"Someone lasered the presenter’s screen during the talk.","zh":"演讲时有人用激光笔照着讲者的屏幕。"},{"en":"Please don’t laser the light into anyone’s eyes.","zh":"请不要把激光照到任何人的眼睛里。"}]},{"partOfSpeech":"adj.","definition":{"en":"treated, cut, or marked by a laser; having a laser-made effect.","zh":"经过激光处理/切割/标记的；具有激光加工效果的。"},"examples":[{"en":"He bought a lasered key for the new lock.","zh":"他为新锁买了一把激光切割的钥匙。"},{"en":"The trophy has a lasered message on the base.","zh":"奖杯底座上刻着激光雕刻的信息。"}]}],"synonyms":["laser-cut","laser-etched","laser-treated","scanned (by laser)","zapped (informal)"],"phonetic":"/ˈleɪzɚd/","extraExplanation":["“laser”原本是缩写：Light Amplification by Stimulated Emission of Radiation（受激辐射产生的光放大）。日常英语里更常把它当作普通名词/动词使用：a laser（激光器），to laser（用激光加工/扫描/治疗）。","拼写提示：英式英语中常见“laser”作动词的过去式为“lasered”；在技术文档里也会看到“laser-cut / laser-etched / laser-scanned”等更明确的搭配。"]}
{"word":"laserjet","summary":{"en":"LaserJet usually refers to HP’s LaserJet line of laser printers, and it’s also commonly used to mean a laser printer in general.","zh":"LaserJet 通常指惠普（HP）的 LaserJet 激光打印机系列，也常在口语中泛指激光打印机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of laser printer, especially one made under Hewlett-Packard’s (HP) LaserJet brand name","zh":"一种激光打印机，尤指惠普（HP）LaserJet 系列品牌的打印机"},"examples":[{"en":"Our office still uses an old HP LaserJet for quick black-and-white printing.","zh":"我们办公室还在用一台旧的惠普 LaserJet 来快速打印黑白文件。"},{"en":"The LaserJet prints text very sharply compared with the inkjet.","zh":"和喷墨打印机相比，这台 LaserJet 打印文字更清晰。"}]},{"partOfSpeech":"adj.","definition":{"en":"used as an adjective to describe something related to a LaserJet printer (often written before a noun)","zh":"作定语使用，表示“与 LaserJet 激光打印机有关的”（常用于名词前）"},"examples":[{"en":"Please install the LaserJet driver on your computer.","zh":"请在你的电脑上安装 LaserJet 打印机驱动程序。"},{"en":"I can’t scan because the LaserJet software is missing.","zh":"我没法扫描，因为缺少 LaserJet 的软件。"}]}],"synonyms":["laser printer","HP LaserJet"],"phonetic":"/ˈleɪzərˌdʒɛt/","extraExplanation":["“LaserJet”最早是惠普（HP）的注册商标名称，后来在日常英语中有时被当作“激光打印机”的代称使用（尤其在办公室场景）。正式写作里，如果不是特指惠普产品，更常说 laser printer（激光打印机）。"]}
{"word":"laserpitium","summary":{"en":"Laserpitium is a botanical genus name for certain European plants in the carrot (Apiaceae) family.","zh":"Laserpitium 是植物学属名，指伞形科（芹科）中一类主要分布于欧洲的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the carrot family (Apiaceae), including several wild European species with umbrella-shaped flower clusters.","zh":"（植物）激光草属：伞形科（芹科）的一属开花植物，主要分布在欧洲野外，常见伞状花序。"},"examples":[{"en":"Laserpitium grows naturally in parts of central and southern Europe.","zh":"激光草属植物自然生长在欧洲中部和南部的一些地区。"},{"en":"The guide pointed out a Laserpitium species by its white umbrella-like flowers.","zh":"向导通过它白色的伞状花指出这是一种激光草属植物。"}]}],"synonyms":["a genus in the Apiaceae (carrot) family","Laserpitium (botanical genus)"],"phonetic":"/ˌleɪzərˈpɪtiəm/","extraExplanation":["“Laserpitium”是植物学拉丁名，用在学术写作、植物志、标本标签中更常见；日常英语里通常不会用它来指某一种具体植物，而会说“a Laserpitium species（某种激光草属植物）”。","词源上与拉丁语“laser”（古代指一种名贵药用树脂，常与“silphium/塞尔菲翁”相关）有关；属名的历史命名带有“药用植物/树脂”联想。"]}
{"word":"lasers","summary":{"en":"“Lasers” is the plural of “laser,” meaning laser devices or laser beams used in medicine, industry, measurement, and light shows.","zh":"“lasers”是“laser”的复数，指激光器或激光束，常用于医疗、工业、测量和灯光表演等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Devices that produce a narrow, powerful beam of light by stimulating atoms to emit light in a controlled way.","zh":"激光器；通过“受激辐射”产生窄而强的光束的装置。"},"examples":[{"en":"Lasers are used in surgery to cut tissue very precisely.","zh":"激光在手术中用于非常精确地切割组织。"},{"en":"The factory uses lasers to measure tiny differences in size.","zh":"工厂用激光来测量极小的尺寸差异。"}]},{"partOfSpeech":"n.","definition":{"en":"The plural form of “laser,” meaning beams or systems of laser light.","zh":"“laser”的复数，指激光束或激光系统（复数）。"},"examples":[{"en":"The show featured colorful lasers moving across the stage.","zh":"演出中有彩色激光在舞台上移动。"},{"en":"Engineers tested different lasers to find the best one for the sensor.","zh":"工程师测试了不同的激光，找出最适合传感器的一种。"}]}],"synonyms":["laser beams","laser devices","beam lasers"],"phonetic":"/ˈleɪzɚz/","extraExplanation":["“laser”是首字母缩略词，来自 Light Amplification by Stimulated Emission of Radiation（通过受激辐射实现光放大）。在日常英语里，人们通常直接把它当作普通名词使用，不会想到它是缩写。","注意区分：laser（激光）与 flashlight/torch（手电筒），以及 LED light（LED灯）。激光的特点是光束非常“集中、方向性强”。"]}
{"word":"laserwort","summary":{"en":"Laserwort is an uncommon botanical word for certain herb-like plants in the carrot family, especially the genus Laserpitium.","zh":"Laserwort 是较少见的植物学词，指伞形科的一些草本植物，尤指激光草属（Laserpitium）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the carrot family (Apiaceae), especially species in the genus Laserpitium, traditionally used as an herb in parts of Europe","zh":"（植物）伞形科的一类草本植物，尤指“激光草属”（Laserpitium）的一些种类；在欧洲部分地区曾作为草药或香草使用"},"examples":[{"en":"In the wildflower guide, laserwort is listed among the umbellifers with umbrella-shaped flower heads.","zh":"在野花图鉴里，laserwort 被归在伞形科植物中，特点是“伞状”的花序。"},{"en":"Some traditional recipes mention dried laserwort as a bitter, aromatic herb.","zh":"一些传统食谱会提到用干燥的 laserwort 作带苦味的芳香香草。"}]}],"synonyms":["Laserpitium","umbellifer (general category)"],"phonetic":"/ˈleɪzərˌwɝt/","extraExplanation":["“wort”在古英语里常指“植物/草药”（见于 St. John’s wort 等词），所以 laserwort 字面上就是“名为 laser 的草”。","词源中的 “laser” 与拉丁语有关，历史上曾用来指某些芳香树脂/药材的名称；在植物命名中保留下来，形成 Laserpitium 等属名。"]}
{"word":"lases","summary":{"en":"“Lase” means “to emit a laser beam,” and “lases” is its third-person singular form.","zh":"“lase”表示“发射激光”，而“lases”是其第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to produce or emit a narrow, intense beam of light using a laser","zh":"用激光器发出（或产生）一束狭窄而强烈的光束；发射激光"},"examples":[{"en":"The surgeon used a tool that lases tissue with great precision.","zh":"外科医生使用一种能以极高精度用激光处理组织的工具。"},{"en":"Some devices lase only when the temperature is stable.","zh":"有些设备只有在温度稳定时才会发射激光。"}]}],"synonyms":["emit (a laser beam)","radiate","beam"],"phonetic":"/leɪz/","extraExplanation":["你输入的“lases”通常是动词“lase”的第三人称单数（he/she/it lases）或复数形式的误拼写。日常更常见的是名词“laser”（激光器/激光）及其复数“lasers”（激光器们/多束激光）。","“lase”多用于技术、科研或医学语境，表示“发射激光”。在一般对话中，人们更常说“use a laser / fire a laser / shine a laser (beam)”。","词源小知识：“laser”原本是缩写（Light Amplification by Stimulated Emission of Radiation）。后来才从“laser”派生出动词“to lase”。"]}
{"word":"lash","summary":{"en":"“Lash” most often means to strike sharply, to tie something tightly, or (as a noun) an eyelash.","zh":"“lash”最常见的意思是“猛抽/抽打”、“捆扎固定”，或作名词表示“睫毛”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hit someone or something hard and quickly (often with a whip, rope, tail, etc.)","zh":"（常用鞭子、绳子、尾巴等）快速而用力地抽打、鞭打"},"examples":[{"en":"The rider lashed the horse to make it run faster.","zh":"骑手鞭打马儿，让它跑得更快。"},{"en":"Branches lashed against the window in the storm.","zh":"暴风雨中，树枝抽打着窗户。"}]},{"partOfSpeech":"vt.","definition":{"en":"to tie or fasten something securely with rope, cord, or straps","zh":"用绳子/绑带等把……牢牢捆住、系紧"},"examples":[{"en":"They lashed the luggage to the roof rack.","zh":"他们把行李牢牢绑在车顶行李架上。"},{"en":"The raft was made by lashing logs together.","zh":"这只木筏是把原木捆在一起做成的。"}]},{"partOfSpeech":"n.","definition":{"en":"a sharp piece of leather or cord on a whip used for striking","zh":"（鞭子上的）鞭梢；用来抽打的皮条/绳条"},"examples":[{"en":"The lash of the whip cracked loudly.","zh":"鞭梢啪的一声响得很脆。"}]},{"partOfSpeech":"n.","definition":{"en":"an eyelash; the hairs along the edge of an eyelid (usually plural: lashes)","zh":"睫毛（常用复数 lashes）"},"examples":[{"en":"She has long lashes and bright eyes.","zh":"她睫毛很长，眼睛很明亮。"},{"en":"Mascara makes your lashes look thicker.","zh":"睫毛膏会让睫毛看起来更浓密。"}]},{"partOfSpeech":"v.","definition":{"en":"a sudden, angry, or critical remark or attack in words (often: lash out)","zh":"（言语上的）猛烈抨击；（常见搭配：lash out）突然发火/攻击"},"examples":[{"en":"He lashed out at his friend without thinking.","zh":"他一时冲动，冲朋友发火。"},{"en":"The article lashed the company for its poor safety record.","zh":"这篇文章猛烈抨击这家公司糟糕的安全记录。"}]}],"synonyms":["whip","strike","beat","tie","bind","fasten","lash out"],"phonetic":"/læʃ/","extraExplanation":["“lash”有两条常见语义线：一条是“快速抽打/拍击”（风雨把树枝抽打窗户也可用 lash），另一条是“捆扎固定”（航海、露营、搬运场景里很常见）。","名词“lash”在日常口语里常指“睫毛”（通常说 lashes）。与动词“lash”同形但语义不同，靠语境判断：眼睛/化妆品→睫毛；绳子/鞭子/风雨→抽打或捆绑。","常用短语：lash out (at sb) 表示“（言语或行为）突然攻击/发火”。比起单纯的 “criticize”，语气更激烈、更情绪化。"]}
{"word":"lashed","summary":{"en":"“Lashed” usually means (1) hit/struck strongly, or (2) tied/fastened firmly; it can also mean criticized sharply or (in “lashed out”) reacted angrily.","zh":"“Lashed”常指（1）猛击/抽打，或（2）捆扎固定牢；也可指严厉抨击，或在“lashed out”中表示突然发怒。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “lash”: to hit or strike (someone or something), often with a whip, rope, or strong force.","zh":"“lash”的过去式/过去分词：鞭打；猛击（某人或某物），常带有鞭子、绳子或强力抽打的感觉。"},"examples":[{"en":"The trainer lashed the rope to make a sharp snapping sound.","zh":"训练员猛甩绳子，发出清脆的“啪”一声。"},{"en":"The small boat was lashed by heavy rain and wind all night.","zh":"那艘小船整夜被狂风暴雨猛烈拍打。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “lash”: to tie, fasten, or secure something firmly with rope, straps, etc.","zh":"“lash”的过去式/过去分词：用绳子/带子等把……牢牢捆扎、固定。"},"examples":[{"en":"They lashed the luggage to the roof rack before driving off.","zh":"他们把行李牢牢捆在车顶行李架上才出发。"},{"en":"The canoe was lashed to the dock so it wouldn’t drift away.","zh":"独木舟被绑在码头上，防止漂走。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “lash”: to criticize or attack someone sharply with words.","zh":"“lash”的过去式/过去分词：（用言语）严厉抨击、猛烈批评。"},"examples":[{"en":"She lashed the company for its unfair policy.","zh":"她猛烈抨击公司不公平的政策。"},{"en":"The editorial lashed out at corruption in local government.","zh":"社论痛批地方政府的腐败问题。"}]},{"partOfSpeech":"vi.","definition":{"en":"(often in “lashed out”) to suddenly react angrily; to strike or speak in anger.","zh":"（常见于“lashed out”）突然发怒；因生气而出手或出言攻击。"},"examples":[{"en":"He apologized after he lashed out at his friend.","zh":"他对朋友发火后道了歉。"},{"en":"Under stress, she sometimes lashes out without meaning to.","zh":"在压力下，她有时会不自觉地发火。"}]},{"partOfSpeech":"adj.","definition":{"en":"as an adjective: tied or secured firmly (with ropes/straps).","zh":"作形容词：被牢牢捆住/固定好的（用绳子或带子等）。"},"examples":[{"en":"All the boxes were lashed to the truck bed.","zh":"所有箱子都被牢牢绑在卡车车斗上。"}]}],"synonyms":["whipped","struck","beat","tied","fastened","secured","criticized","attacked","rebuked","railed (against)"],"phonetic":"/læʃt/","extraExplanation":["“lash”这个词有两条常见“画面感”：①鞭子抽打的“啪”一下；②用绳索把东西“绑紧固定”。所以在航海/户外语境里，lashed 很常见，表示“捆扎好、固定住”。","常见搭配：lash together（把两样东西绑在一起）、lash down（捆紧/固定住）、be lashed by rain/waves（被暴雨/海浪猛烈拍打）、lash out（突然发怒/抨击）。在新闻或评论里，“lash”常用于“严厉批评”。"]}
{"word":"lasher","summary":{"en":"“Lasher” usually means a person who lashes (with a whip or with harsh words); it can also mean a rope/strap used to tie things down, especially at sea.","zh":"“lasher”通常指鞭打（或言语猛烈抨击）他人的人；也可指（尤指航海中）用于捆扎固定物品的绳带/绳索。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lashes (hits with a whip or strap), or who criticizes/attacks harshly with words","zh":"鞭打他人的人；（比喻）言辞猛烈抨击他人的人"},"examples":[{"en":"The lasher raised the whip, and the crowd fell silent.","zh":"挥鞭的人举起鞭子，人群立刻安静下来。"},{"en":"In the editorial, she became a lasher of corruption and abuse of power.","zh":"在社论中，她成了对腐败和滥用权力的猛烈批评者。"}]},{"partOfSpeech":"n.","definition":{"en":"(nautical) a rope, strap, or cord used to lash (tie) something firmly in place","zh":"（航海）捆扎绳；用于把物品牢牢绑住的绳带/绳索"},"examples":[{"en":"Use a lasher to secure the cargo so it won’t shift in rough seas.","zh":"用捆扎绳固定货物，避免在风浪中移动。"},{"en":"The deckhand checked the lashers before the ship left port.","zh":"船员在离港前检查了捆扎绳。"}]}],"synonyms":["whip-user","flogger","critic","attacker","tie-down","lashing rope"],"phonetic":"/ˈlæʃər/","extraExplanation":["“lasher”来自动词“lash”（鞭打；捆扎）。在航海语境里，lasher 指专门用来“绑牢”的绳索或带子，常与“secure / tie down（固定/捆扎）”等词一起出现。","在部分爱尔兰英语口语里，“a lasher of …”有时可表示“很多/相当多的……”，但属于地域性表达，正式写作中不常用。"]}
{"word":"lashers","summary":{"en":"“Lashers” usually means people who whip/strike, and less commonly ropes/straps used to tie things down.","zh":"“lashers”通常指鞭打/抽打的人；较少见时指用于捆扎固定的绳索或绑带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of lasher) a person who lashes (hits or whips) someone or something, or a device/thing used to lash.","zh":"（lasher 的复数）鞭打者；挥打/抽打的人；也可指用来捆扎或抽打的工具/物件。"},"examples":[{"en":"The story describes cruel lashers who punished prisoners with whips.","zh":"故事里描写了残忍的鞭打者，用鞭子惩罚囚犯。"},{"en":"In the old warehouse, they found lashers and straps used to tie cargo down.","zh":"在旧仓库里，他们发现了用于固定货物的捆扎带等物件。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, especially nautical) ropes or straps used for lashing—tying or fastening something securely.","zh":"（较少见，尤指航海用语）用于“lashing（捆扎/系牢）”的绳索或绑带。"},"examples":[{"en":"Sailors checked the lashers before the ship entered rough water.","zh":"船只进入风浪区前，水手检查了捆扎绳。"},{"en":"Make sure the lashers are tight so the load doesn’t shift.","zh":"确保捆扎带拉紧，防止货物移动。"}]}],"synonyms":["whippers","flagellators","strikers","lashings (ropes/straps)","ties","straps"],"phonetic":"/ˈlæʃər/","extraExplanation":["“lasher”来自动词“lash”（抽打；猛击；捆扎）。在日常英语里更常见的是“to lash”和名词“lash”（如“lashings”=大量的，英式口语），而“lasher(s)”本身较少见，常出现在特定语境（如描述施暴者或航海/货运的绑扎绳）。"]}
{"word":"lashes","summary":{"en":"“Lashes” most commonly means eyelashes; it can also be the verb form meaning “hits/whips” or “lashes out (criticizes angrily).”","zh":"“lashes”最常见意思是“睫毛”；也可作动词，表示“抽打/猛烈拍打”，或（常在 lash out 中）“怒斥/抨击”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the hairs that grow along the edges of the eyelids (plural of eyelash)","zh":"睫毛（eyelash 的复数）"},"examples":[{"en":"She has long lashes that make her eyes look bigger.","zh":"她的睫毛很长，让眼睛看起来更大。"},{"en":"Mascara can make your lashes look thicker.","zh":"睫毛膏能让你的睫毛看起来更浓密。"}]},{"partOfSpeech":"v.","definition":{"en":"whips; hits with a whip or something like a whip (third-person singular of lash)","zh":"用鞭子抽打；鞭打（lash 的第三人称单数）"},"examples":[{"en":"The wind lashes the windows during the storm.","zh":"暴风雨中，大风猛烈拍打窗户。"},{"en":"Waves lash the rocks along the shore.","zh":"海浪猛烈拍打着海岸边的岩石。"}]},{"partOfSpeech":"v.","definition":{"en":"criticizes angrily; attacks with words (third-person singular of lash out)","zh":"猛烈抨击；用言语攻击（常见于 lash out）"},"examples":[{"en":"He lashes out at his coworkers when he is stressed.","zh":"他压力大时会对同事发火。"},{"en":"She lashed out online, then apologized later.","zh":"她在网上发泄了一通，后来又道歉了。"}]}],"synonyms":["eyelashes","whips","strikes","beats","lashes out","attacks","criticizes"],"phonetic":"/ˈlæʃɪz/","extraExplanation":["“lash”本义和“鞭子/抽打”有关，所以在自然描写里常搭配风、雨、海浪等作主语（如 wind/waves lash...），表示“猛烈拍打”。","与惩罚有关的表达如“(give someone) 50 lashes”（抽50鞭）多见于历史/文学语境；现代日常英语更常用比喻义的“lash out”（情绪失控地抨击/发火）。"]}
{"word":"lashing","summary":{"en":"“Lashing” most commonly means a whipping/hitting, and it can also mean violent rain/waves, harsh criticism, or ropes used to tie things down.","zh":"“Lashing”最常指“鞭打/抽打”，也可指“猛烈的风雨/海浪”“严厉的批评”，或指“捆绑用的绳索/绑扎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of hitting or whipping someone or something with a lash (a whip, strap, or similar object); the punishment or blows given","zh":"用鞭子、皮带等抽打的行为；鞭打/抽打的惩罚或打击"},"examples":[{"en":"In the past, some schools used lashings as a form of punishment.","zh":"过去有些学校会用鞭打作为一种惩罚方式。"},{"en":"The report describes prisoners receiving repeated lashings.","zh":"报告描述了囚犯遭到反复鞭打。"}]},{"partOfSpeech":"n.","definition":{"en":"a violent, rapid movement or attack (often used for wind, waves, rain, or an animal’s tail)","zh":"猛烈、迅速的拍打/抽打式动作或袭击（常用于风浪、暴雨或动物尾巴等）"},"examples":[{"en":"Waves hit the rocks with the lashing force of a storm.","zh":"暴风雨中海浪猛烈地拍打着岩石。"},{"en":"We ran through the lashing rain to get inside.","zh":"我们冒着狂风暴雨跑进屋里。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong, biting criticism (usually in the phrase “a lashing”)","zh":"严厉的抨击、尖刻的批评（常用短语 a lashing）"},"examples":[{"en":"The movie received a lashing from several critics.","zh":"这部电影遭到几位影评人的严厉抨击。"},{"en":"He took a lashing online after his comment went viral.","zh":"他的言论走红后在网上被狠狠批评。"}]},{"partOfSpeech":"n.","definition":{"en":"a rope, strap, or cord used to tie things together; the act of tying or securing with rope (common in sailing, camping, and shipping)","zh":"捆绑用的绳索/绑带；用绳索捆扎、固定（航海、露营、运输中常见）"},"examples":[{"en":"The kayaks were secured to the roof rack with lashings.","zh":"皮划艇用捆绑带固定在车顶架上。"},{"en":"Check the lashings before you drive—the load shouldn’t shift.","zh":"开车前检查绑扎是否牢固——货物不该晃动。"}]}],"synonyms":["whipping","beating","flogging","barrage","thrashing","scolding","rebuke","tie-down","binding"],"phonetic":"/ˈlæʃɪŋ/","extraExplanation":["“Lashing”来自动词“lash”（抽打、猛击、捆扎）。在航海英语里，lashing 很常见，指用绳索把物品牢固绑在桅杆、甲板或货架上。","表达天气时更自然的搭配有：lashing rain（倾盆大雨/狂风暴雨）、lashing winds（狂风）。"]}
{"word":"lashingly","summary":{"en":"Lashingly means “in a strikingly impressive/stylish way,” and more rarely “in a lashing/whipping manner.”","zh":"lashingly 表示“非常惊艳/出色地”，较少见时也可指“猛烈抽打地（像鞭打一样）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a strikingly stylish, impressive, or eye-catching way (often about appearance, beauty, or performance).","zh":"极其时髦/出色/吸睛地（常形容外表、魅力或表现）。"},"examples":[{"en":"She looked lashingly beautiful in that red dress.","zh":"她穿那条红裙子看起来美得惊艳。"},{"en":"The team played lashingly well in the second half.","zh":"球队下半场踢得非常出色。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare) In a way that involves lashing (hitting or whipping).","zh":"（罕见）以鞭打/抽打的方式；猛烈抽打地。"},"examples":[{"en":"The wind drove the rain lashingly against the windows.","zh":"狂风把雨点猛烈地抽打在窗户上。"}]}],"synonyms":["strikingly","impressively","remarkably","stunningly","brilliantly"],"phonetic":"/ˈlæʃɪŋli/","extraExplanation":["“lashingly”多见于带一点夸张、带赞叹的语气，常用于描写外貌（lashingly handsome/beautiful）或表现（lashingly good），属于较“文学/修辞感”的用法，日常口语里更常用“really/very/so”。","词源上来自“lashing”（猛烈抽打、飞快挥动）引申出“有冲击力、很耀眼”的感觉，因此第一义更常见。"]}
{"word":"lashings","summary":{"en":"“Lashings” most often means “a lot of something” (especially in British informal English). It can also mean whippings or ropes used to tie things down.","zh":"“lashings”最常见的意思是“很多/大量”（尤指英式口语）；也可指“鞭打”或“捆扎用的绑绳/捆绑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, especially British) A large amount of something; plenty.","zh":"（非正式，尤指英式英语）大量；很多；充足。"},"examples":[{"en":"They served strawberries with lashings of cream.","zh":"他们端上草莓，配了大量奶油。"},{"en":"Add lashings of butter to make it richer.","zh":"多加很多黄油，让味道更浓郁。"}]},{"partOfSpeech":"n.","definition":{"en":"Strikes with a whip or similar; acts of whipping.","zh":"鞭打；抽打（的次数）。"},"examples":[{"en":"The old story describes a prisoner receiving lashings.","zh":"那个旧故事描写囚犯遭到鞭打。"}]},{"partOfSpeech":"n.","definition":{"en":"Ropes/cords used for fastening, or the act of tying something securely with rope.","zh":"（用于捆扎的）绳索/绑绳；或用绳牢牢捆绑（的行为）。"},"examples":[{"en":"Check the lashings on the cargo before you drive.","zh":"开车前检查货物的绑绳是否牢固。"},{"en":"The boat’s equipment was held down with lashings.","zh":"船上的设备用绑绳固定住了。"}]}],"synonyms":["lots of","plenty (of)","a great deal (of)","oodles (of)","loads (of)"],"phonetic":"/ˈlæʃɪŋz/","extraExplanation":["“lashings of …”是很常见的搭配，语气偏口语、略带夸张，常用于食物（cream, butter, sauce）或抽象名词（lashings of praise 大量称赞）。在美式英语里也能理解，但更常见的说法是“lots of / plenty of / a ton of”。","在英国流行文化中，“lashings of ginger beer”（大量姜汁汽水）常被认为是带有怀旧感的表达，和儿童冒险小说（如Enid Blyton的作品）里丰盛点心的描写有关。"]}
{"word":"lashins","summary":{"en":"“Lashings” most often means (1) whippings/hard blows or strong criticism, (2) ropes/straps used to tie things, or (3) “lashings of” = a lot of (especially sauce/cream).","zh":"“lashings”常见含义有：①鞭打/重击，也可指严厉批评；②用于捆绑固定的绳索/绑带；③短语“lashings of”表示（尤指食物）大量的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of lashing) a hard hit or a punishment with a whip; also used figuratively for severe criticism.","zh":"（lashing 的复数）鞭打；重击；也可比喻“严厉的批评/抨击”。"},"examples":[{"en":"The sailor received thirty lashings for breaking the rules.","zh":"那名水手因违反规定受了三十下鞭笞。"},{"en":"The company faced lashings from the press after the scandal.","zh":"丑闻之后，这家公司遭到媒体的严厉抨击。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of lashing) a rope, strap, or cord used for tying things firmly; the act of tying something down.","zh":"（lashing 的复数）捆绑用的绳索/绑带；（用绳索等）牢牢捆扎的动作。"},"examples":[{"en":"Check the lashings before the boat leaves the dock.","zh":"船离开码头前要检查一下绑绳是否牢固。"},{"en":"The boxes were secured with strong lashings in the truck.","zh":"这些箱子用结实的捆绑带固定在卡车上。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the phrase “lashings of,” a large amount of something (often food, especially sauce or cream).","zh":"用于短语“lashings of”，表示“大量的”（常用于食物，尤指酱汁、奶油等）。"},"examples":[{"en":"She served pancakes with lashings of syrup.","zh":"她端上煎饼，上面浇了大量糖浆。"},{"en":"We had strawberries with lashings of cream.","zh":"我们吃了草莓，配了好多奶油。"}]}],"synonyms":["whippings","strappings","ties","bindings","a lot of"],"phonetic":"/ˈlæʃɪŋz/","extraExplanation":["“lashings of”在英式英语里很常见，带一点夸张、俏皮的语气，常用来形容食物“给得很足”。","“lashings”这个拼写常被误写成“lashins”。如果你想表达“鞭打/捆绑/大量（食物）”，标准拼写通常是 lashings。"]}
{"word":"lashkar","summary":{"en":"“Lashkar” means an army or armed force, especially in South Asian/Middle Eastern contexts; it can also appear in the names of specific groups.","zh":"“Lashkar”主要指军队/武装力量（多见于南亚与中东语境）；也常作为某些组织名称的一部分出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian & Middle Eastern contexts) an army, military force, or a large armed group; sometimes used for a camp or military detachment.","zh":"（南亚与中东语境）军队、武装力量；也可指营地或一支武装分队。"},"examples":[{"en":"In older histories, the word “lashkar” often refers to a ruler’s army or war camp.","zh":"在较早的历史记载中，“lashkar”常指统治者的军队或军营。"},{"en":"The rebels gathered a lashkar before marching toward the capital.","zh":"叛军集结了一支武装队伍，然后向首都进军。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, a specific named militant organization when it appears as part of a group’s name (e.g., in news reporting).","zh":"引申义：当作为组织名称的一部分出现时（常见于新闻报道），指某个具体的武装组织。"},"examples":[{"en":"The report mentioned Lashkar as part of the group’s official name.","zh":"报道中提到“Lashkar”是该组织官方名称的一部分。"},{"en":"Be careful to distinguish the general meaning (“army”) from a particular organization with “Lashkar” in its name.","zh":"要注意区分它的一般含义“军队”，与名称中含“Lashkar”的特定组织。"}]}],"synonyms":["army","militia","armed force","troops","war band"],"phonetic":"/ˈlʌʃkɑr/","extraExplanation":["“Lashkar”源自波斯语/乌尔都语（也与阿拉伯语地区的用法相近），核心意思是“军队、营地”。在南亚历史与文学语境里，它常是中性词，指军队或军营；但在现代新闻语境中，因一些组织名称包含该词，读者容易把它直接联想到特定团体。理解时要结合上下文。"]}
{"word":"lashkars","summary":{"en":"“Lashkars” means armies or armed groups (plural of “lashkar”), especially in South Asian historical or political contexts.","zh":"“Lashkars”是“lashkar”的复数，指军队/兵团或武装团体，常见于南亚历史或政治语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian, historical) Armies or groups of soldiers, especially large bodies of troops or irregular militias.","zh":"（南亚语境，历史用法）军队；兵团；尤指大规模部队或非正规民兵。"},"examples":[{"en":"The chronicles describe Mughal lashkars moving across the plain.","zh":"史书描写了莫卧儿的军队（lashkars）穿越平原。"},{"en":"Local rulers sometimes raised lashkars quickly in times of crisis.","zh":"地方统治者在危机时期有时会迅速集结兵团（lashkars）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Modern, politics/news) Militants or armed groups; often used in the names of organizations in South Asia.","zh":"（现代政治/新闻语境）武装分子或武装组织；也常见于南亚一些组织名称中。"},"examples":[{"en":"News reports sometimes use the word “lashkars” to refer to armed factions in the region.","zh":"新闻报道有时用“lashkars”来指代该地区的武装派别。"},{"en":"Be careful: in headlines, “lashkar” can sound neutral but may refer to violent groups depending on context.","zh":"要注意：新闻标题里的“lashkar”表面中性，但在具体语境中可能指涉暴力组织。"}]}],"synonyms":["armies","troops","militias","armed groups"],"phonetic":"/ˈlæʃkɑr/","extraExplanation":["“lashkars”是“lashkar”的复数形式。该词常见于南亚历史与政治语境，来源于波斯语/乌尔都语等，基本义是“军队、兵团”。","在英语里它带有明显的地域与历史色彩，日常生活中不常用；更常出现在历史写作、学术文章或新闻报道中。","阅读时要结合上下文判断：它既可能只是“军队/部队”的一般称呼，也可能特指某些武装组织（尤其在现代新闻里）。"]}
{"word":"lashless","summary":{"en":"“Lashless” means having no eyelashes (or no visible lashes).","zh":"“lashless”指没有睫毛（或睫毛不明显）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no eyelashes; without visible lashes.","zh":"没有睫毛的；睫毛不明显的。"},"examples":[{"en":"After chemotherapy, she was temporarily lashless and chose to wear glasses for comfort.","zh":"化疗后，她一段时间没有睫毛，为了舒服就戴了眼镜。"},{"en":"The character is drawn lashless to give her a more alien, unsettling look.","zh":"这个角色被画成没有睫毛的样子，以营造更外星、更不安的感觉。"}]}],"synonyms":["without eyelashes","eyelash-free","bare-lashed"],"phonetic":"/ˈlæʃləs/","extraExplanation":["“lashless”由 lash（睫毛/鞭打的“鞭子”）+ -less（无……的）构成。在日常语境里几乎总是指“没有睫毛”，常见于美容、化妆、医学（如脱发/化疗）或文学描写。若在特定语境谈到“鞭子”，也可能表示“没有鞭子/不受鞭打的”，但这种用法很少见。"]}
{"word":"lashlight","summary":{"en":"A flashlight is a hand-held portable electric light; it can also mean to shine such a light on something.","zh":"flashlight 指手持式便携电灯（手电筒）；也可作动词表示“用手电筒照”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small portable electric light that you can hold in your hand; it makes a beam of light when you turn it on","zh":"手电筒；便携式电灯（打开后会发出一束光）"},"examples":[{"en":"I always keep a flashlight in my car in case of emergencies.","zh":"我车里总放着一支手电筒，以备紧急情况。"},{"en":"Use a flashlight to look under the bed.","zh":"用手电筒照一下床底。"},{"en":"The flashlight’s batteries are dead.","zh":"手电筒的电池没电了。"}]},{"partOfSpeech":"v.","definition":{"en":"to shine a flashlight (or other strong light) on something, usually to help people see in the dark","zh":"用手电筒照；用强光照（多用于黑暗中帮助看清）"},"examples":[{"en":"The guard flashlighted the ID card to read the name.","zh":"保安用手电筒照着证件来读名字。"},{"en":"They flashlighted the path so everyone could walk safely.","zh":"他们用手电筒照亮小路，让大家能安全行走。"}]}],"synonyms":["torch (BrE)","hand torch (BrE)","electric torch (less common)","light (general)"],"phonetic":"/ˈflæʃˌlaɪt/","extraExplanation":["“lashlight”通常是“flashlight”的拼写错误。美式英语里常用 flashlight；英式英语更常说 torch（注意不是“火把”的那个 torch）。"]}
{"word":"lashlite","summary":{"en":"“lashlite” is not standard; it usually means “flashlight.”","zh":"“lashlite”不是标准写法，通常指“flashlight（手电筒）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) A misspelling of “flashlight”: a small portable electric light you hold in your hand.","zh":"（非标准拼写）“flashlight”的常见拼写错误：手持式便携电灯/手电筒。"},"examples":[{"en":"I think “lashlite” is a typo—did you mean “flashlight”?","zh":"我觉得“lashlite”是打错了——你是不是想写“flashlight”（手电筒）？"},{"en":"Bring a flashlight in case the power goes out.","zh":"带个手电筒，以防停电。"}]}],"synonyms":["flashlight","torch (BrE)"],"phonetic":"/ˈflæʃˌlaɪt/","extraExplanation":["“lashlite”不是标准英语单词，最常见情况是把“flashlight”漏掉了开头的字母f。英语里美式英语更常用flashlight；英式英语常说torch（注意不是“火把”的那种torch）。"]}
{"word":"lashness","summary":{"en":"Lashness is a rare noun meaning harshness or severity; very rarely, it can refer literally to being whipped (lashing).","zh":"Lashness是个少见名词，主要指“严厉/苛刻”；极少数情况下可字面指“被鞭打（鞭笞）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) harshness; strictness or severity in tone, treatment, or judgment.","zh":"（少见）严厉；苛刻；（语气、对待或评判上的）严酷。"},"examples":[{"en":"The editor criticized the review for its lashness toward a first-time author.","zh":"编辑批评那篇书评对一位首次出书的作者过于苛刻。"},{"en":"Her feedback was honest, but the lashness made the team defensive.","zh":"她的反馈很诚实，但语气的严厉让团队产生了防备心理。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, literal) the state or quality of being whipped or struck with a lash; lashing.","zh":"（非常少见，字面）被鞭打的状态或性质；鞭笞。"},"examples":[{"en":"In old accounts, lashness was described as a common punishment at sea.","zh":"在一些旧记载中，鞭笞被描述为海上常见的惩罚。"}]}],"synonyms":["harshness","severity","strictness","sternness"],"phonetic":"/ˈlæʃnəs/","extraExplanation":["“lashness”在现代英语中非常不常用，更多见于个别写作者的用词或旧文本。日常表达中，如果你想说“严厉/苛刻”，更自然的词是“harshness / severity / strictness”。","也常有人把“lashness”和“lushness”（郁郁葱葱、丰美）混淆；如果你的意思是“茂盛感/繁茂”，请用“lushness”。"]}
{"word":"lashorn","summary":{"en":"“Lashorn” is not a common English word; it’s likely a misspelling or a proper name (surname).","zh":"“Lashorn”不是常见英文单词；更可能是拼写错误或专有名词（姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; most likely a misspelling or a name (surname).","zh":"不是常见的英文词汇；更可能是拼写错误或人名（姓氏）。"},"examples":[{"en":"I couldn’t find “lashorn” in an English dictionary—did you mean “lash” or “longhorn”?","zh":"我在英文词典里找不到“lashorn”——你是不是想写“lash”或“longhorn”？"},{"en":"Lashorn appears as a family name in some records.","zh":"Lashorn 在一些记录中会作为姓氏出现。"}]}],"synonyms":["(if you meant) lash","(if you meant) longhorn","(if you meant) lashing"],"phonetic":"/ˈlæʃhɔrn/","extraExplanation":["“lashorn”如果是你在文章/字幕/游戏里看到的词，很可能是：\n1）拼写误差：lash（鞭打；猛烈抨击；睫毛）+ horn（角/号角）并不常组合成固定词。\n2）专有名词：人名/地名/品牌名。\n如果你能提供一句原句（上下文），我可以帮你判断最可能的意思与正确拼写。"]}
{"word":"lasi","summary":{"en":"Lassi is a South Asian yogurt-based drink, often sweet (like mango) or salty and spiced.","zh":"Lassi（拉西）是一种南亚常见的酸奶饮料，可做成甜味（如芒果）或咸味加香料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional South Asian drink made from yogurt mixed with water (or milk), often sweetened or flavored (e.g., mango) or sometimes salted and spiced","zh":"一种传统南亚饮料，由酸奶加水（或牛奶）调制而成；可做成甜味（如芒果味）或咸味并加入香料"},"examples":[{"en":"I ordered a mango lassi with my curry.","zh":"我点咖喱时配了一杯芒果拉西。"},{"en":"A salty lassi can taste refreshing on a hot day.","zh":"炎热的天气里，咸味拉西喝起来很清爽。"}]}],"synonyms":["yogurt drink","mango yogurt smoothie (informal)"],"phonetic":"/ˈlɑːsi/","extraExplanation":["你输入的“lasi”常见是“lassi”的拼写变体/误拼；英语里更常用的标准拼写是“lassi”。","“Lassi”源自南亚饮食文化（尤其与印度、巴基斯坦等地相关）。常见口味包括芒果拉西（甜）与咸味拉西（加盐、孜然等香料）。在西方餐馆菜单上也经常出现。"]}
{"word":"lasianthous","summary":{"en":"Lasianthus is a scientific plant genus name in the coffee family.","zh":"Lasianthus 是茜草科中的一个植物属名（科学拉丁学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lasianthus: a genus (group) of tropical shrubs and small trees in the coffee family (Rubiaceae), found mainly in Asia and the Pacific; used as a scientific (Latin) plant name.","zh":"Lasianthus：茜草科（咖啡家族）中的一个植物属（热带灌木或小乔木），主要分布于亚洲与太平洋地区；属于植物学的拉丁学名。"},"examples":[{"en":"Scientists recorded several Lasianthus species in the rainforest survey.","zh":"科学家在雨林调查中记录了数种 Lasianthus（拉西亚属）植物。"},{"en":"This specimen was identified as Lasianthus based on its leaves and flowers.","zh":"研究人员根据叶片和花的特征将该标本鉴定为 Lasianthus（拉西亚属）。"}]}],"synonyms":["(no common everyday synonym; scientific genus name)"],"phonetic":"/ˌleɪziˈænθəs/","extraExplanation":["你输入的“lasianthous”很可能是拼写误差；常见的植物学写法是 **Lasianthus**（属名）。如果你想查的是别的词（例如某个物种名或形容词），可以把完整拼写或上下文句子发来，我可以更精确判断。","属名通常来自植物学拉丁文/希腊文词根；在阅读论文或植物志时，这类词多作为“学名标签”使用，而不是日常英语词汇。"]}
{"word":"lasing","summary":{"en":"“Lasing” means producing or emitting a laser beam; it’s common in scientific contexts.","zh":"“lasing”指“产生/发射激光”，多用于科学与工程语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of producing a laser beam; emitting light as a laser (present participle of “lase”).","zh":"产生激光束的过程；以激光形式发光（动词“lase”的现在分词）。"},"examples":[{"en":"The technician checked the power supply before lasing began.","zh":"技术员在开始产生激光之前检查了电源。"},{"en":"In this device, lasing occurs when the medium is pumped with enough energy.","zh":"在这种装置中，当介质被注入足够能量时就会产生激光。"}]},{"partOfSpeech":"vi.","definition":{"en":"emitting a laser beam; producing laser light (often used in science/engineering writing).","zh":"发射激光的；产生激光的（常见于科学/工程语境）。"},"examples":[{"en":"The crystal is lasing at a wavelength of 1064 nanometers.","zh":"该晶体以 1064 纳米的波长发射激光。"},{"en":"They aligned the mirrors so the cavity would start lasing.","zh":"他们调整反射镜，使谐振腔开始产生激光。"}]}],"synonyms":["laser emission","emitting a laser","generating laser light"],"phonetic":"/ˈleɪsɪŋ/","extraExplanation":["“lasing”主要用于物理与工程领域。日常英语里更常说“the laser is on / the laser is firing / the device is emitting a laser beam”。","“lase”来自“LASER”（Light Amplification by Stimulated Emission of Radiation，受激辐射光放大）。因此你也会看到写法“LASing”（把 LASER 当作词根来构造动词形式），在科研论文里较常见。"]}
{"word":"lasiocampa","summary":{"en":"Lasiocampa is a scientific genus name for certain hairy-caterpillar moths.","zh":"Lasiocampa 是某些幼虫多毛的蛾类的属名（科学学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of moths (family Lasiocampidae), whose caterpillars are often hairy; some species are known for making silken cocoons.","zh":"枯叶蛾属（Lasiocampa）：一种蛾类的属（枯叶蛾科），其幼虫常有浓密毛；部分种类会结丝质茧。"},"examples":[{"en":"Scientists recorded several Lasiocampa moths near the forest edge.","zh":"科学家在森林边缘记录到了几只枯叶蛾属（Lasiocampa）的蛾。"},{"en":"The child found a hairy caterpillar that may belong to Lasiocampa.","zh":"孩子发现了一只多毛的毛毛虫，可能属于枯叶蛾属（Lasiocampa）。"}]}],"synonyms":["eggar moth (genus name context)","Lasiocampidae (related family)"],"phonetic":"ˌlæzioʊˈkæmpə","extraExplanation":["这是一个拉丁化的学名（属名），在生物学文章里常用斜体书写：*Lasiocampa*。","词源上常解释为来自希腊语：*lasios*（多毛的）+ *kampē*（毛虫/幼虫），与该属幼虫常见的“多毛”特征相呼应。"]}
{"word":"lasiocampid","summary":{"en":"A lasiocampid is a moth (or related caterpillar) belonging to the family Lasiocampidae, often hairy and thick-winged.","zh":"lasiocampid 指裳蛾科（Lasiocampidae）的蛾（或其幼虫），常见特征是体表多毛、翅较厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a moth in the family Lasiocampidae (often called lappet moths), typically with hairy bodies and thick, fuzzy-looking wings; some species’ caterpillars can be pests.","zh":"裳蛾科（Lasiocampidae）的一类蛾（常称“裳蛾/披蛾”“lappet moth”），通常体表多毛、翅膀厚且显得绒毛感强；部分物种的幼虫可能危害植物。"},"examples":[{"en":"The scientist identified the specimen as a lasiocampid moth based on its hairy body and wing shape.","zh":"科学家根据它多毛的身体和翅形，把这个标本鉴定为裳蛾科的蛾。"},{"en":"Some lasiocampid caterpillars feed on trees and can cause noticeable defoliation.","zh":"一些裳蛾科的毛虫取食树叶，可能造成明显的落叶现象。"}]}],"synonyms":["lappet moth (common name)","Lasiocampidae moth (technical)"],"phonetic":"/ˌlæziˈoʊkæmpɪd/","extraExplanation":["“lasiocampid”来自学名科名 Lasiocampidae（裳蛾科）的英文形容词/名词用法，常见于生物学、昆虫学写作中。日常英语里更常说“lappet moth（裳蛾/披蛾）”。","在科研语境中，lasiocampid 常用来修饰名词：a lasiocampid moth / lasiocampid larvae（裳蛾科幼虫）。","拼写提醒：你输入的“lasiocampid”是正确形式；有时会被误写成 *lasiocampid* / *lasiocampid moth* 混用，但核心指向都是裳蛾科。"]}
{"word":"lasiocampidae","summary":{"en":"Lasiocampidae is the moth family known as lappet moths, noted for often large, hairy caterpillars.","zh":"Lasiocampidae 指枯叶蛾科（兜蛾科），一类常见幼虫体型较大且多毛的蛾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of moths (in the superfamily Lasiocampoidea), commonly called lappet moths; their caterpillars are often large and hairy.","zh":"（昆虫分类）枯叶蛾科/兜蛾科：鳞翅目中的一科蛾类，常称“枯叶蛾（lappet moths）”；其幼虫通常体型较大且多毛。"},"examples":[{"en":"Many Lasiocampidae caterpillars are covered in dense hairs.","zh":"许多枯叶蛾科（Lasiocampidae）的毛虫身上长着浓密的毛。"},{"en":"The researcher identified the specimen as a member of the family Lasiocampidae.","zh":"研究人员把这只标本鉴定为枯叶蛾科（Lasiocampidae）的成员。"}]}],"synonyms":["lappet moth family"],"phonetic":"/ˌlæzi.oʊkæmˈpaɪdi/","extraExplanation":["这是一个拉丁化的生物分类名称（科名），常出现在学术文章、野外图鉴或昆虫学资料里；日常英语里更常说 lappet moths（枯叶蛾）来指这类蛾。","词源可拆为希腊语 lasios（“多毛的”）+ kampe（“毛虫/幼虫”），反映该科幼虫常见的“多毛”特征。"]}
{"word":"lasiocampoidea","summary":{"en":"Lasiocampoidea is the scientific name of a moth superfamily in Lepidoptera.","zh":"Lasiocampoidea 是鳞翅目中一个蛾类总科的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name for a superfamily of moths (including lappet moths and related families) in the order Lepidoptera","zh":"（生物学）蛾类的一种“总科”名称，隶属于鳞翅目，包含枯叶蛾等相关科"},"examples":[{"en":"Lasiocampoidea includes the family Lasiocampidae, commonly called lappet moths.","zh":"Lasiocampoidea 包含枯叶蛾科（Lasiocampidae），常被称为“枯叶蛾（lappet moths）”。"},{"en":"The paper compares wing patterns across several Lasiocampoidea species.","zh":"这篇论文比较了多种 Lasiocampoidea 物种的翅纹。"}]}],"synonyms":["lappet moth superfamily","moth superfamily (taxonomic)"],"phonetic":"ˌleɪziˌoʊkæmˈpɔɪdiə","extraExplanation":["这是一个分类学（taxonomy）术语，通常出现在昆虫学、生态学或学术论文中；日常英语里几乎不会用到。","词源上常见的构词方式来自拉丁化/希腊化的学名体系：-oidea 表示“……样的/……类群（总科）”。发音在不同学者或地区可能略有差异，但在交流中通常只要能清晰读出各音节即可。"]}
{"word":"lasiocarpous","summary":{"en":"A botanical adjective meaning “having hairy fruits.”","zh":"一个植物学形容词，意思是“果实有毛的/结毛状果实的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having fruits covered with hair or soft down; bearing hairy fruit.","zh":"（植物学）果实表面有毛的；结有绒毛/毛状果实的。"},"examples":[{"en":"The botanist noted that the plant is lasiocarpous, with tiny hairs covering each fruit.","zh":"植物学家注意到这种植物是“lasiocarpous”的，每个果实表面都覆有细小的毛。"},{"en":"In the field guide, the lasiocarpous fruits help distinguish this species from a smooth-fruited one.","zh":"在野外图鉴中，带毛的（lasiocarpous）果实有助于把这个物种与果实光滑的物种区分开来。"}]}],"synonyms":["hairy-fruited","pubescent-fruited","downy-fruited"],"phonetic":"/ˌleɪʒioʊˈkɑːrpəs/","extraExplanation":["词源提示：来自希腊语词根 *lasio-*（“多毛的、粗毛的”）+ *-carpous*（与 *carp* 同源，意为“果实”）。常见于植物分类描述中，用来强调“果实是否有毛”这一鉴别特征。"]}
{"word":"lasius","summary":{"en":"Lasius is a scientific name for a genus of common ants.","zh":"Lasius 是一种常见蚂蚁“属”的学名（蚁属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus (group) of ants that includes many common garden and woodland ants, especially in the Northern Hemisphere","zh":"蚁属（Lasius）：一种蚂蚁的属（分类群），包含许多常见的花园蚂蚁和林地蚂蚁，主要分布在北半球"},"examples":[{"en":"Lasius ants are often seen making small soil mounds near sidewalks.","zh":"蚁属（Lasius）的蚂蚁常会在路边堆起小小的土丘。"},{"en":"In our yard, a Lasius colony lives under a flat stone.","zh":"在我们院子里，有一群蚁属（Lasius）的蚂蚁住在一块扁石头下面。"},{"en":"The researcher identified the specimen as Lasius based on its body shape and behavior.","zh":"研究人员根据体形和行为把这只标本鉴定为蚁属（Lasius）。"}]}],"synonyms":["ant genus","garden ant (general term)"],"phonetic":"/ˈleɪziəs/","extraExplanation":["“Lasius”是拉丁化的学名，通常在英语里首字母大写、用斜体书写（如 *Lasius*）。在生物分类中，它是“属”，属下面还有很多“种”。","常见相关种包括 *Lasius niger*（常被称为“black garden ant/黑花园蚁”）等；不同地区的常见种可能不同。"]}
{"word":"lask","summary":{"en":"“lask” is not a common modern English word; it’s usually a name or an abbreviation, or a misspelling of “ask.”","zh":"“lask”在现代英语中不常作为词汇使用；通常是人名/缩写，或是把“ask”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word in modern use; most often seen as a proper name (surname) or as an abbreviation (e.g., LASK, an Austrian football club). It may also be a misspelling of “ask.”","zh":"在现代英语中不是常见的词汇；更常见的是作为专有名词（姓氏）或缩写（如 LASK，奥地利的一家足球俱乐部）。也可能是把“ask”拼错了。"},"examples":[{"en":"I think you meant “ask,” not “lask.”","zh":"我觉得你想写的是“ask”，不是“lask”。"},{"en":"Her last name is Lask.","zh":"她的姓是 Lask。"},{"en":"LASK won the match last night.","zh":"LASK 昨晚赢了比赛。"}]}],"synonyms":["ask (if you meant “ask”)"],"phonetic":"/læsk/","extraExplanation":["“lask”作为普通英文单词几乎不使用，所以在阅读或写作中看到它，最常见的两种情况是：①人名/姓氏（首字母常大写为 Lask）；②缩写（常全大写为 LASK）。","如果你本来想表达“询问/请求”，正确拼写通常是 ask（/æsk/）。你也可以告诉我你看到“lask”的句子，我可以帮你判断具体含义。"]}
{"word":"lasket","summary":{"en":"“Lasket” is not a standard English word; it’s likely a misspelling (e.g., basket/casket) or a non-English word.","zh":"“lasket”不是标准英语单词；可能是拼写错误（如 basket/casket）或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of another word (for example, “basket” or “casket”), or a word from another language (e.g., Finnish “lasket”). If you share the sentence where you saw it, I can identify the intended meaning.","zh":"不是标准英语单词。很可能是其他单词的拼写错误（例如 basket“篮子”、casket“棺材/首饰盒”），或来自其他语言（如芬兰语 lasket）。如果你提供它所在的句子，我可以帮你确认真正想表达的意思。"},"examples":[{"en":"I couldn’t find “lasket” in an English dictionary—could it be “basket”?","zh":"我在英语词典里找不到“lasket”——你是不是想写“basket”？"},{"en":"Please send the full sentence containing “lasket,” and I’ll help you interpret it.","zh":"请把包含“lasket”的完整句子发我，我来帮你理解。"}]}],"phonetic":"/ˈlæskɪt/","extraExplanation":["“lasket”在芬兰语里常见（来自动词 laskea），在不同语境可表示“你在计算/你让……下降/你放下/你降价”等含义；但这不属于英语用法。","如果你是想查英语里发音相近的词：basket /ˈbæskɪt/（篮子），casket /ˈkæskɪt/（棺材；小盒子）。把你要表达的意思或原句给我，我可以帮你选对词。"]}
{"word":"lasking","summary":{"en":"“Lasking” isn’t standard English; it’s usually a misspelling of “asking.”","zh":"“lasking”不是标准英语词；通常是把 “asking” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “asking” (the act of requesting or inquiring).","zh":"不是标准英语单词；最常见是把 “asking”（询问、请求的行为）拼错了。"},"examples":[{"en":"I think you meant “asking”: I’m asking for directions.","zh":"我猜你想写的是 “asking”：我在问路。"},{"en":"She kept asking questions during the class.","zh":"她在课上一直提问。"}]}],"synonyms":["asking (likely intended)","inquiring","requesting","questioning"],"phonetic":"ˈæskɪŋ","extraExplanation":["“lasking”在常见英语词典中一般查不到。如果你是想表达“询问/请求”，正确拼写通常是 asking（ask + -ing）。","也有可能你想写的是其他以 la- 开头的词，比如 lashing（鞭打；猛烈抨击）或 lasting（持久的）。如果你能给我一句原句语境，我可以帮你确认你真正想用的词。"]}
{"word":"laspeyresia","summary":{"en":"Laspeyresia is an older genus name for certain tortricid moths, now usually treated as Cydia.","zh":"Laspeyresia 是卷蛾科某些蛾类的旧属名，现多并入 Cydia。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for certain small moths (family Tortricidae), now usually classified under the genus Cydia (e.g., pests such as the codling moth).","zh":"（旧）某些小蛾类的属名（卷蛾科），现代分类多并入 Cydia（例如一些农业害虫，如苹果蠹蛾相关类群）。"},"examples":[{"en":"In older entomology books, the codling moth may be listed under Laspeyresia instead of Cydia.","zh":"在较早的昆虫学书籍中，苹果蠹蛾可能会以 Laspeyresia 而不是 Cydia 来标注。"},{"en":"The database notes that Laspeyresia is an outdated genus name.","zh":"该数据库注明 Laspeyresia 是一个已过时的属名。"}]}],"synonyms":["Cydia"],"phonetic":"ˌlæspaɪˈrɪziə","extraExplanation":["这是一个分类学上的“旧属名”（synonym / outdated name）。随着形态学与分子系统学研究更新，一些原先放在 Laspeyresia 的物种被重新归入 Cydia，因此你在新文献里更常见到 Cydia。","它多出现在昆虫学、农业害虫管理、旧版检索表或历史文献中；日常英语里几乎不使用。"]}
{"word":"laspring","summary":{"en":"“laspring” is not a standard English word; it’s likely a typo or a proper name (possibly “spring” or “offspring”).","zh":"“laspring”不是标准英语单词；可能是拼写错误或专有名词（可能想写“spring”或“offspring”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or a name. Common possibilities include “spring” (the season / a coil) or “offspring” (a child/descendant), or “LA Spring” as a proper name (e.g., an event or place).","zh":"不是标准英语单词。很可能是拼写错误或专有名词。常见可能包括“spring”（春天/弹簧）或“offspring”（子女/后代），也可能是专有名词“LA Spring”（如活动或地点名）。"},"examples":[{"en":"I can’t find “laspring” in a dictionary—did you mean “spring”?","zh":"我在词典里找不到“laspring”——你是想写“spring”吗？"},{"en":"If you meant “offspring,” it means a person’s child or descendant.","zh":"如果你想写“offspring”，它的意思是“子女或后代”。"}]}],"phonetic":"/ˈlæsprɪŋ/","extraExplanation":["“laspring”看起来像把两个部分连在一起（如“LA + spring”）或少打/多打了字母。你可以告诉我它出现的句子或上下文（例如一整句话、文章链接、截图），我就能更准确判断你要查的词。","如果你是想查“spring”：常见意思是“春天；弹簧；跳跃/涌出”。如果是“offspring”：常用于较正式或生物学语境，指“子代/后代”。"]}
{"word":"lasque","summary":{"en":"Lasque is a rare, old-fashioned word meaning “tired” or “to become tired.”","zh":"Lasque 是一个罕见的旧式用词，意思是“疲倦的”或“变得疲倦”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/obsolete) tired; weary; worn out.","zh":"（罕见/已废用）疲倦的；疲劳的；筋疲力尽的。"},"examples":[{"en":"After the long climb, he felt lasque and sat down to rest.","zh":"爬了很久之后，他感到很疲倦，便坐下来休息。"},{"en":"By evening, the travelers were lasque from the heat.","zh":"到了傍晚，旅人们被炎热弄得疲惫不堪。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare/obsolete) to become tired; to grow weary.","zh":"（罕见/已废用）变得疲倦；感到厌倦。"},"examples":[{"en":"I lasque quickly in this heavy weather.","zh":"这种闷热的天气里，我很快就会觉得疲惫。"}]}],"synonyms":["tired","weary","exhausted","worn out"],"phonetic":"/læsk/","extraExplanation":["“lasque”在现代英语里几乎不用，更多见于旧文本或方言化/拼写变体的语境。若你是在现代材料中看到它，有可能是拼写错误或非常小众的用法。常见可替换的现代词包括：tired, weary, exhausted。","如果你想查的是别的词：\n- “lask”几乎不用；\n- “luscious”（多汁的/美味的/性感的）拼写相近但意思完全不同；\n- “lasque”也可能是人名、地名或品牌名，需要上下文才能确认。"]}
{"word":"lass","summary":{"en":"Lass means “a girl or young woman,” especially in Scottish/Northern British or old-fashioned style.","zh":"lass 指“女孩/年轻女子”，多见于苏格兰或英式北部方言，也常带复古或传统语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a girl or young woman (often used in Scotland, Northern England, or in a traditional/old-fashioned style)","zh":"女孩；年轻女子（常见于苏格兰、英格兰北部或较传统/旧式用法）"},"examples":[{"en":"She was a smart lass from Glasgow.","zh":"她是个来自格拉斯哥的聪明姑娘。"},{"en":"The lasses in the village helped with the festival.","zh":"村里的姑娘们一起帮忙办节庆。"}]},{"partOfSpeech":"n.","definition":{"en":"a friendly way to address a young woman (similar to “girl,” sometimes informal)","zh":"对年轻女子的称呼（类似“girl”，有时较口语）"},"examples":[{"en":"Good morning, lass—can I help you?","zh":"早上好，姑娘——需要我帮忙吗？"},{"en":"Come on, lass, you can do it.","zh":"加油，姑娘，你能做到的。"}]}],"synonyms":["girl","young woman","lassie","maid","miss"],"phonetic":"/læs/","extraExplanation":["“lass”带有明显的地域与语体色彩：在苏格兰与英格兰北部更自然；在其他地区（尤其是美式英语）多显得文学化、复古或带民谣/乡村氛围。","在现代语境中，用“lass”称呼陌生女性可能显得不合时宜或略带性别刻板印象；更中性安全的替代说法是“young woman / girl（视语境）/ miss（礼貌场合）”。","常见搭配：“lass and lad”（姑娘和小伙）、“bonnie lass”（漂亮/可爱的姑娘，苏格兰用法）、“lassie”（更亲昵的小称呼）。"]}
{"word":"lassen","summary":{"en":"“Lassen” is a common German verb meaning “to let/allow,” “to leave,” or “to have something done,” depending on the structure.","zh":"“lassen”是常见德语动词，可表示“让/允许”“留下/让……保持原样”，也可表示“请人做某事/让……被做”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(German) to let; to allow someone to do something","zh":"（德语）让；允许（某人做某事）"},"examples":[{"en":"Lass mich in Ruhe.","zh":"（德语）别烦我。/ 让我安静一会儿。"},{"en":"Meine Eltern lassen mich spät aufbleiben.","zh":"（德语）我父母允许我晚点睡。"}]},{"partOfSpeech":"v.","definition":{"en":"(German) to leave; to not take something with you; to leave something as it is","zh":"（德语）留下；不带走；让……保持原样"},"examples":[{"en":"Ich lasse mein Handy zu Hause.","zh":"（德语）我把手机落在家里/留在家里。"},{"en":"Lass die Tür offen.","zh":"（德语）把门开着。"}]},{"partOfSpeech":"v.","definition":{"en":"(German) to have something done (to arrange for a service)","zh":"（德语）（使役）让人做某事；请人把……做了（安排服务）"},"examples":[{"en":"Ich lasse mein Auto reparieren.","zh":"（德语）我让人把车修一下/我去修车。"},{"en":"Sie lässt sich die Haare schneiden.","zh":"（德语）她去剪头发/她让人给她理发。"}]}],"synonyms":["let","allow","leave","have (something done)"],"phonetic":"/ˈlɑsən/","extraExplanation":["“lassen”在德语里非常常见，核心感觉接近英语的 let / leave。常见结构：\n1）lassen + 人 + 动词原形：Ich lasse ihn gehen.（我让他走。）\n2）lassen + 宾语 + 形容词/分词：Lass die Tür offen.（让门开着。）\n3）sich lassen：表示“可以……/行得通”，如 Das lässt sich machen.（这事可以办。）\n4）口语里“Lass das!”=“别那样/住手！”","发音提示：德语“lassen”里的 a 更像“ah”的音，词尾 -en 常弱读成接近“ən/ n”的感觉。"]}
{"word":"lasses","summary":{"en":"“Lasses” means “girls/young women,” especially in Scottish or northern English usage.","zh":"“lasses”表示“女孩/年轻女子”，多见于苏格兰或英格兰北部用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a girl or young woman (an informal word, especially common in Scotland and northern England); “lasses” is the plural form of “lass.”","zh":"女孩；年轻女子（非正式用语，尤见于苏格兰及英格兰北部）。“lasses”是“lass”的复数形式。"},"examples":[{"en":"The old song tells a story about brave lads and lasses.","zh":"那首老歌讲的是勇敢的小伙子和姑娘们的故事。"},{"en":"The lasses in the village wore colorful dresses for the festival.","zh":"村里的姑娘们为节日穿上了五彩的裙子。"}]}],"synonyms":["girls","young women","maids (old-fashioned)"],"phonetic":"/læsɪz/","extraExplanation":["“lass”带有一定地域与文学色彩：在苏格兰/英格兰北部口语、民谣、诗歌里很常见，听起来朴实亲切。现代日常美式英语里更常用“girl/young woman”。","常见搭配：lads and lasses（小伙子和姑娘们，常见于歌曲、故事或节庆场景）。"]}
{"word":"lasset","summary":{"en":"“Lasset” is a rare, old-fashioned Scottish word meaning “a young girl.”","zh":"“lasset”是较少见、偏苏格兰的旧式词，意思是“年轻女孩/少女”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, old-fashioned) a young girl; a little lass.","zh":"（苏格兰用法，较古旧）小女孩；少女。"},"examples":[{"en":"In the old story, the lasset waited by the river for her brother.","zh":"在那个古老的故事里，小女孩在河边等她的哥哥。"},{"en":"The poem speaks of a lasset singing on the hillside.","zh":"这首诗写到一个少女在山坡上唱歌。"}]}],"synonyms":["lass","lassie","girl"],"phonetic":"/ˈlæsɪt/","extraExplanation":["“lasset”在现代英语里非常少见，多见于苏格兰语或带有苏格兰风格的旧文本中，意思接近“lass”（少女）。“-et”在一些方言/旧式用法里可带有“小、亲昵”的感觉。","如果你是在现代语境（电影台词、日常对话、写作）中看到它，很可能是拼写误差；更常见的词是“lass”（少女）或“lassie”（小姑娘）。"]}
{"word":"lassie","summary":{"en":"“Lassie” can mean a (Scottish) girl, or it can refer to the famous fictional collie dog named Lassie.","zh":"“lassie”既可指（苏格兰用语）女孩，也常指名叫Lassie的著名虚构柯利犬角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, informal) A girl or young woman.","zh":"（苏格兰用语，非正式）女孩；年轻女性。"},"examples":[{"en":"The lassie at the shop helped me find the right size.","zh":"店里的那个女孩帮我找到了合适的尺码。"},{"en":"In some Scottish stories, a “lassie” is simply a young girl.","zh":"在一些苏格兰故事里，“lassie”就是指小女孩。"}]},{"partOfSpeech":"n.","definition":{"en":"Lassie: the name of a famous fictional collie dog, known for being brave and loyal (from books, films, and a TV series).","zh":"莱西：著名的虚构柯利牧羊犬的名字，以勇敢、忠诚闻名（出自小说、电影和电视剧）。"},"examples":[{"en":"My dad grew up watching Lassie on TV.","zh":"我爸爸小时候看《莱西》电视剧长大。"},{"en":"People sometimes call a loyal dog “a real Lassie.”","zh":"人们有时会把一只忠诚的狗称作“真正的莱西”。"}]}],"synonyms":["lass","girl","young woman"],"phonetic":"/ˈlæsi/","extraExplanation":["“lassie”源自“lass”（女孩），在苏格兰英语里更常见，也带一点亲切、口语的感觉；在美国英语里单独说“lassie”较少见，更多人会联想到那只经典的柯利犬角色。","“Lassie”作为文化符号常用来代表“忠诚、会救人、可靠的狗”。在日常表达中，如果把某只狗比作Lassie，通常是在夸它聪明又忠心。"]}
{"word":"lassiehood","summary":{"en":"Lassiehood means “girlhood,” the time or state of being a young girl.","zh":"lassiehood 指“少女时期/女孩时期”，相当于 girlhood。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a lass; girlhood (the time when someone is a young girl)","zh":"少女时期；女孩的状态或年纪（相当于 girlhood）"},"examples":[{"en":"She spent her lassiehood in a small coastal town.","zh":"她的少女时期是在一个海边小镇度过的。"},{"en":"Stories from her lassiehood still make her laugh.","zh":"她少女时期的故事至今仍会让她发笑。"}]}],"synonyms":["girlhood","childhood","youth"],"phonetic":"/ˈlæsiˌhʊd/","extraExplanation":["“lassiehood”是由“lassie（苏格兰英语里常见，意为‘小姑娘/少女’）+ 后缀“-hood（表示‘……的状态/时期’，如 childhood, adulthood）”构成的词。整体语气较文学化或带地域色彩，在现代日常英语里更常用“girlhood”或“childhood”。"]}
{"word":"lassieish","summary":{"en":"“Lassieish” means “like Lassie”: loyal, heroic, and wholesome in a classic family-story way, often said jokingly.","zh":"“lassieish”指“像灵犬莱西那样”：忠诚、英勇、很正能量的家庭故事风格，常带调侃语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling Lassie (the famous fictional collie): very loyal, brave, wholesome, and “family-friendly,” often in a slightly humorous or teasing way.","zh":"像“灵犬莱西”（著名虚构牧羊犬）那样的：忠诚、勇敢、很正能量/适合家庭观看的（常带一点调侃或玩笑语气）。"},"examples":[{"en":"The movie is a bit lassieish—lots of heart, a happy ending, and a heroic dog.","zh":"这部电影有点“莱西式”——很暖心、结局圆满，还有一只英勇的狗。"},{"en":"Don’t be so lassieish; not every lost pet story has a perfect ending.","zh":"别这么“莱西式”了；不是每个走失宠物的故事都有完美结局。"}]}],"synonyms":["wholesome","heartwarming","sentimental","goody-goody (informal)","corny (informal)"],"phonetic":"/ˈlæsiˌɪʃ/","extraExplanation":["“Lassie”是20世纪非常有名的虚构柯利牧羊犬形象，来自小说、电影与电视剧；它常被当作“忠犬”“正能量家庭剧”的文化符号。英语里把专有名词加“-ish”可以表示“有点像……/带有……风格”（如 child + -ish → childish）。因此 lassieish 多用于口语或评论中，带有轻松的语气。"]}
{"word":"lassies","summary":{"en":"“Lassies” most commonly means “girls/young women” (plural of lassie), often with a Scottish or old-fashioned feel; it can also refer to the famous collie dog character “Lassie.”","zh":"“lassies”最常见意思是“姑娘们/年轻女子”（lassie 的复数，带苏格兰或较旧式语感）；也可指著名的柯利犬角色“Lassie（灵犬莱西）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “lassie”: a girl or young woman (often Scottish or old-fashioned).","zh":"“lassie”的复数：女孩；年轻女子（常见于苏格兰用法或较旧式、带亲昵称呼的语气）。"},"examples":[{"en":"The lassies in the village wore colorful shawls.","zh":"村里的姑娘们披着彩色的披肩。"},{"en":"Come along, lassies—let’s get home before it gets dark.","zh":"走吧，姑娘们——天黑前我们回家。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes) plural of “Lassie,” referring to the famous collie dog character; by extension, collie dogs like that character.","zh":"（有时）“Lassie（灵犬莱西）”的复数：指著名的柯利牧羊犬角色；引申指像“莱西”那样的柯利犬。"},"examples":[{"en":"The kids watched old Lassie episodes on TV.","zh":"孩子们在电视上看《灵犬莱西》的老剧集。"},{"en":"On that farm, there were two Lassies—both loyal collies.","zh":"那座农场里有两只“莱西”——都是忠诚的柯利犬。"}]}],"synonyms":["girls","young women","lasses"],"phonetic":"/ˈlæsi/","extraExplanation":["“lassie”主要见于英式英语，尤其带有苏格兰色彩；在现代日常英语中不算常用，更多出现在文学、民谣或带地域风格的表达里。","“Lassie（灵犬莱西）”是英美文化中很有名的长毛柯利犬形象，来自小说、电影与电视剧，因此有时人们会用它来指代这种“聪明、忠诚的柯利犬”。"]}
{"word":"lassiky","summary":{"en":"“lassiky” isn’t standard English; it’s likely a misspelling (often meant to be “classy”).","zh":"“lassiky”不是标准英语，通常是拼写错误（多半想写“classy”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a nonstandard spelling (often intended to mean “classy” or to refer to “Lassie”).","zh":"不是标准英语单词；很可能是拼写错误或非标准拼法（常见意图是写“classy（有品位的）”或指“Lassie（拉西，常作名字/狗名）”。"},"examples":[{"en":"I can’t find “lassiky” in a dictionary—did you mean “classy”?","zh":"我在词典里找不到“lassiky”——你是不是想写“classy”？"},{"en":"That outfit looks classy. (Not: lassiky.)","zh":"那套穿搭很有品位。（不是：lassiky。）"}]}],"synonyms":["classy","elegant","stylish"],"phonetic":"/ˈlæsɪki/","extraExplanation":["“lassiky”看起来像把“classy”误写了：可能少了开头的字母c，或键盘输入时出错。","如果你能告诉我你看到它的句子/上下文（比如一整句英文），我可以更准确判断你想表达的是“classy（有品位的）”“Lassie（名字/角色）”还是别的词。"]}
{"word":"lassitude","summary":{"en":"Lassitude means a heavy feeling of tiredness and low motivation.","zh":"Lassitude 指一种强烈的身心疲倦与缺乏动力的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling of physical or mental tiredness and low energy; lack of enthusiasm or motivation.","zh":"身心疲倦、无力感；缺乏热情或动力。"},"examples":[{"en":"After the long flight, she felt a deep lassitude and went straight to bed.","zh":"长途飞行后，她感到深深的疲惫，直接上床睡了。"},{"en":"The heat of the afternoon brought on lassitude, and everyone worked more slowly.","zh":"午后的炎热带来倦怠感，大家干活都慢了下来。"},{"en":"He spoke about a lassitude that made even simple tasks feel difficult.","zh":"他谈到一种倦怠感，让连简单的事情都变得困难。"}]}],"synonyms":["fatigue","weariness","lethargy","listlessness"],"phonetic":"/ˈlæsɪˌtud/","extraExplanation":["“lassitude”常见于较正式或文学性的语境，强调一种“慢慢蔓延的倦怠、懒散感”，比一般的“tiredness”更有“精神提不起劲”的意味。","常见搭配：feel lassitude（感到倦怠），a sense of lassitude（倦怠感），summer/afternoon lassitude（夏日/午后倦怠）。","词源来自拉丁语 *lassitudo*（疲劳、乏力）。文学中常用来描写炎热、沉闷或情绪低落导致的无力与慵懒氛围。"]}
{"word":"lassitudes","summary":{"en":"“Lassitudes” is the plural of “lassitude,” meaning tiredness or low energy, sometimes used in a literary sense of gentle sluggishness.","zh":"“lassitudes”是“lassitude”的复数，表示疲倦、无力、缺乏动力；也可用于文学语境描写慵懒的迟缓感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of physical or mental tiredness; lack of energy or motivation","zh":"（身心）疲倦、无力；缺乏精力或动力的状态"},"examples":[{"en":"After the long flight, a heavy lassitude settled over her.","zh":"长途飞行后，一阵深重的疲倦感笼罩着她。"},{"en":"In the summer heat, he worked slowly, fighting off lassitude.","zh":"在夏日酷热中，他干得很慢，努力抵抗那种倦怠感。"},{"en":"The team’s lassitude showed in the second half of the game.","zh":"球队在下半场的疲态很明显。"}]},{"partOfSpeech":"n.","definition":{"en":"a calm, relaxed sluggishness (sometimes poetic or literary)","zh":"（有时偏文学）慵懒、懈怠的悠缓状态"},"examples":[{"en":"The novel describes the afternoon lassitude of a small seaside town.","zh":"小说描写了海边小镇午后的慵懒氛围。"},{"en":"She enjoyed the gentle lassitude of a quiet weekend at home.","zh":"她享受在家度过安静周末时那种温柔的慵懒。"}]}],"synonyms":["fatigue","weariness","tiredness","lethargy","listlessness","sluggishness"],"phonetic":"/ˈlæsɪˌtuːd/","extraExplanation":["“lassitudes”是“lassitude”的复数形式。日常英语里更多用单数（lassitude），复数常用于强调“多次/多种疲倦感”或在文学描写中营造氛围。","词源来自拉丁语 lassitudo（疲倦），所以它常带一点“整个人提不起劲”的感觉，比普通的 tired 更书面、更有描写性。"]}
{"word":"lasslorn","summary":{"en":"A rare poetic adjective meaning “lovelorn,” especially missing a sweetheart (a ‘lass’).","zh":"一个罕见的诗意形容词，意为“相思/为情所困”，尤指思念一位“姑娘（lass）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, poetic) Feeling sad and lonely because you have lost a sweetheart or cannot be with the girl/woman you love; lovelorn.","zh":"（罕见、诗歌用语）因失去恋人或无法与所爱之人（尤指“姑娘/少女”）在一起而感到伤心、孤独；相思苦、失恋般的。"},"examples":[{"en":"In the old ballad, the sailor returns lasslorn, wandering the harbor at night.","zh":"在那首古老的民谣里，水手相思成疾地归来，夜里在港口徘徊。"},{"en":"He wrote a lasslorn letter after she moved away.","zh":"她搬走后，他写了一封满是相思与失落的信。"}]}],"synonyms":["lovelorn","heartbroken","forlorn","desolate"],"phonetic":"/ˈlæsˌlɔrn/","extraExplanation":["“lasslorn”并不是现代英语里的常用词，更像是由 lass（少女、姑娘）+ lorn（孤寂的、被遗弃的）组成的诗意复合词，有时也会写作“lass-lorn”。在现代写作中更常用的词是“lovelorn”（为情所困的、相思的）。","词根 lorn 常见于固定搭配“forlorn”（凄凉的、孤苦的）。如果你是在诗歌、民谣或苏格兰/古英语风格文本中看到它，通常是在营造古典、忧伤的爱情氛围。"]}
{"word":"lasso","summary":{"en":"A lasso is a looped rope used to catch animals; as a verb it means to catch or secure. It also names a computer ‘lasso’ selection tool.","zh":"lasso 指用来套住动物的套索；作动词表示用套索套住或引申为抓住、套牢；在软件中也指“套索/圈选”工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rope with a loop at one end, used for catching animals (especially cattle or horses) by throwing it","zh":"套索；（常指）用来套住牛马等动物的绳圈（末端有活结的绳子）"},"examples":[{"en":"The cowboy threw his lasso and caught the calf by the neck.","zh":"牛仔甩出套索，套住了小牛的脖子。"},{"en":"She learned to swing a lasso at a ranch in Texas.","zh":"她在德州的牧场学会了甩套索。"}]},{"partOfSpeech":"v.","definition":{"en":"to catch or control someone or something by throwing a lasso; more generally, to capture or secure","zh":"用套索套住；（引申）抓住、控制或套牢"},"examples":[{"en":"They lassoed the horse and led it back to the barn.","zh":"他们用套索套住那匹马，把它牵回马厩。"},{"en":"The company tried to lasso new customers with a big discount.","zh":"那家公司想用大折扣“套住”新客户。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool in some computer programs for selecting an area by drawing a loop around it (the lasso tool)","zh":"（软件）套索工具；圈选工具（用画圈的方式选取区域）"},"examples":[{"en":"Use the lasso tool to select the person and remove the background.","zh":"用套索工具圈选人物，然后去掉背景。"},{"en":"I zoomed in so the lasso selection would be more accurate.","zh":"我放大画面，让套索选区更准确。"}]}],"synonyms":["noose","rope","snare","capture","lasso tool"],"phonetic":"/ˈlæsoʊ/","extraExplanation":["“lasso”常和美国西部“cowboy（牛仔）”文化联系在一起，英语里也常用作引申比喻，表示“把机会/客户/注意力套住”。","词源上来自西班牙语（与“绳索、套索”相关），这也反映了北美牧场文化中西班牙语的影响。"]}
{"word":"lassock","summary":{"en":"“Lassock” isn’t a standard English word; you probably mean “lasso” (a rope loop used to catch animals) or it’s a proper name.","zh":"“lassock”不是常见英文词；你可能想写“lasso（套索）”，或它是专有名词（人名/地名/品牌）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “lasso” (a rope used to catch animals) or a surname/proper name.","zh":"不是标准英文单词。更可能是把“lasso（套索）”拼错了，或是一个姓氏/专有名词。"},"examples":[{"en":"I couldn’t find “lassock” in a dictionary—did you mean “lasso”?","zh":"我在词典里找不到“lassock”——你是不是想写“lasso”？"},{"en":"A cowboy threw a lasso to catch the horse.","zh":"牛仔抛出套索去套住马。"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “lasso”: a rope with a loop, used for catching animals (especially by cowboys).","zh":"如果你想表达“lasso”：套索；一种带圈的绳子，用来套住并捕捉动物（常与牛仔相关）。"},"examples":[{"en":"He practiced with his lasso every day.","zh":"他每天练习甩套索。"},{"en":"The rancher used a lasso to catch the calf.","zh":"牧场主用套索套住小牛。"}]},{"partOfSpeech":"vt.","definition":{"en":"If you meant “lasso”: to catch or control something by using a lasso; more generally, to grab or secure something quickly.","zh":"如果你想表达“lasso”：用套索套住/捕捉；引申为迅速抓住或控制某物。"},"examples":[{"en":"The cowboy lassoed the runaway horse.","zh":"牛仔用套索套住了逃跑的马。"},{"en":"She tried to lasso his attention with a funny story.","zh":"她想用一个搞笑故事吸引他的注意。"}]}],"synonyms":["noose","loop (rope loop)","rope"],"phonetic":"/ˈlæsoʊ/","extraExplanation":["“lasso”常和美国西部牛仔文化联系在一起；在电影、小说里经常出现。拼写上容易误写成“lasso + k”之类的形式，但标准拼写是 l-a-s-s-o。","如果“Lassock”是人名/地名/品牌名，请给我一句上下文（例如：出现在文章、聊天或标签里），我可以按专有名词帮你解释。"]}
{"word":"lassockie","summary":{"en":"A rare Scots word meaning “little girl,” used affectionately.","zh":"一个较少见的苏格兰方言词，意为“（亲昵地说）小姑娘”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, informal) A little girl; a young “lass,” often said in an affectionate way.","zh":"（苏格兰方言，非正式）小姑娘；小“少女/女孩子”，常带亲昵称呼的语气。"},"examples":[{"en":"The wee lassockie ran across the yard to greet her gran.","zh":"那个小姑娘跑过院子去迎接她的外婆。"},{"en":"He spoke kindly to the lassockie and offered her a sweet.","zh":"他温和地跟小姑娘说话，还给了她一颗糖。"}]}],"synonyms":["lassie","wee girl","little girl"],"phonetic":"/læˈsɑki/","extraExplanation":["这个词很少见，多出现在苏格兰英语/苏格兰方言（Scots）里。它由 lass（少女、女孩）加上表示“小、亲昵”的后缀（类似 -ie / -y / -ock）构成，语气像英语里的 “lassie / wee girl”。","拼写可能有变体（如 lassocky, lassockie），在现代标准英语里不常用；如果你是在文本里看到它，也可能是作者为了营造苏格兰口音或地方色彩。"]}
{"word":"lassoed","summary":{"en":"“Lassoed” means “caught with a lasso” or, figuratively, “secured/obtained skillfully.”","zh":"“lassoed”表示“用套索套住并捕捉”，也可比喻“巧妙地拿下/获得”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense / past participle of “lasso”) To catch or control an animal or person by throwing a rope loop (a lasso) around them.","zh":"（“lasso”的过去式/过去分词）用套索（绳圈）套住并捕捉或控制动物/人。"},"examples":[{"en":"The cowboy lassoed the calf in one smooth motion.","zh":"牛仔一气呵成地用套索套住了小牛。"},{"en":"The rescuers lassoed the frightened dog to keep it from running into traffic.","zh":"救援人员用套索套住那只受惊的狗，防止它冲到车流中。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To secure, capture, or obtain something, especially quickly or skillfully.","zh":"（比喻）迅速或巧妙地“拿下”、获得、争取到某物。"},"examples":[{"en":"She lassoed a great internship by applying early and interviewing well.","zh":"她因提前申请、面试出色而顺利拿到了一份很棒的实习。"},{"en":"The company lassoed new clients with a strong presentation.","zh":"公司凭借有力的陈述争取到了新客户。"}]}],"synonyms":["roped","snared","captured","secured","nabbed"],"phonetic":"/læˈsoʊ/","extraExplanation":["“lasso”来自西班牙语“lazo”（绳结、套索），与北美牧场文化（cowboy、ranch）关系密切。英语里常用作动词，比喻义多见于口语或写作中，带有“巧妙抓住机会/把东西圈住”的画面感。"]}
{"word":"lassoer","summary":{"en":"A lassoer is a person who catches animals using a lasso (rope loop), often in ranch work or rodeos.","zh":"lassoer 指用套索套住动物的人，常见于牧场工作或牛仔竞技语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who uses a lasso (a rope with a loop) to catch or control an animal; a roper.","zh":"用套索（带活结的绳圈）套住或控制动物的人；套索手／套牛手。"},"examples":[{"en":"The lassoer caught the calf in one smooth throw.","zh":"套索手一甩就稳稳套住了小牛。"},{"en":"In rodeos, a skilled lassoer can win by speed and accuracy.","zh":"在牛仔竞技里，技术高的套索手常靠速度和准度取胜。"}]}],"synonyms":["roper","cowboy","wrangler"],"phonetic":"/læˈsoʊɚ/","extraExplanation":["“lassoer”来自动词“lasso”（用套索套住）。在北美语境中，它常和牛仔文化、牧场赶牛以及 rodeo（牛仔竞技）联系在一起；更常见的说法也包括“roper”或“lariat thrower”。","相关文学/影视中常见于“western”（西部题材）作品，常用来塑造牧场生活或牛仔技能的画面。"]}
{"word":"lassoers","summary":{"en":"“Lassoers” means people who catch animals using a lasso, often on ranches or in rodeos.","zh":"“lassoers”指用套索捕捉动物的人，常见于牧场或牛仔竞技场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who uses a lasso (a looped rope) to catch an animal, especially in ranching or rodeo","zh":"用套索（有圈的绳子）套住并捕捉动物的人；尤指牧场或牛仔竞技中的套索手"},"examples":[{"en":"The lassoers worked quickly to catch the calves for vaccination.","zh":"套索手动作很快，把小牛套住以便接种疫苗。"},{"en":"In the rodeo, skilled lassoers can rope a moving target in seconds.","zh":"在牛仔竞技中，熟练的套索手能在几秒内套住移动的目标。"}]}],"synonyms":["ropers","cowboys","wranglers"],"phonetic":"ˈlæsoʊər","extraExplanation":["“lassoers”是复数形式；单数是“lassoer”。词根“lasso”来自西班牙语，常与北美牧场文化、牛仔（cowboy）和牛仔竞技（rodeo）相关。英语中也常说“to rope”表示“用套索套住”。"]}
{"word":"lassoes","summary":{"en":"“Lassoes” means either multiple lassos, or “he/she/it lassoes” (catches with a lasso).","zh":"“lassoes”既可表示“多个套索”，也可表示动词第三人称单数“（他/她/它）用套索套住；（引申）抓住/争取到”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of lasso (a rope with a loop used for catching animals, especially cattle)","zh":"lasso 的复数：套索（带圈的绳索，尤指用来套住牛马等动物）"},"examples":[{"en":"The ranch hands carried lassoes on their saddles.","zh":"牧场工人把套索挂在马鞍上。"},{"en":"In old Western movies, cowboys swing their lassoes with one hand.","zh":"在老西部电影里，牛仔常常单手挥舞套索。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular form of lasso: to catch or control someone or something with a lasso (or figuratively, to capture/secure)","zh":"lasso 的第三人称单数：用套索套住（也可引申为“抓住/争取到”）"},"examples":[{"en":"He lassoes the calf in one quick motion.","zh":"他一个利落的动作就把小牛套住了。"},{"en":"The recruiter lassoes top talent with a strong offer.","zh":"招聘人员用优厚的条件“套住”顶尖人才。"}]}],"synonyms":["lassos","nooses (for the rope tool sense)","captures (figurative)","snags (figurative)"],"phonetic":"/læˈsoʊz/","extraExplanation":["“lasso”来自西班牙语（与牧牛文化有关）。复数既可写作“lassoes”，也常见简写为“lassos”。动词第三人称单数同样有这两种拼写：“lassoes / lassos”。"]}
{"word":"lassoing","summary":{"en":"Lassoing means catching or controlling something with a lasso, or figuratively securing something quickly and skillfully.","zh":"Lassoing 指用套索套住/控制（人或动物），也可比喻迅速巧妙地争取到某物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"catching, controlling, or pulling something or someone using a lasso (a rope with a loop), often by throwing it","zh":"用套索（带圈的绳子）套住、捕捉、控制或拉住某物/某人（常指甩出绳圈去套）"},"examples":[{"en":"The cowboy was lassoing a calf that ran away from the herd.","zh":"牛仔正在套住一头从牛群里跑出来的小牛。"},{"en":"She practiced lassoing a post in the yard to improve her aim.","zh":"她在院子里练习套木桩来提高准头。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) getting or securing something quickly and skillfully, as if with a rope","zh":"（比喻）迅速而巧妙地“套住”、争取到某物（好像用绳子套住一样）"},"examples":[{"en":"He’s lassoing new clients through referrals and good service.","zh":"他通过转介绍和优质服务迅速争取到新客户。"},{"en":"The headline is lassoing readers’ attention in the first second.","zh":"这个标题在第一秒就抓住了读者的注意力。"}]}],"synonyms":["roping","snaring","catching","capturing","securing"],"phonetic":"/ˈlæsoʊɪŋ/","extraExplanation":["“lasso”常见于北美牧牛文化语境（cowboy、ranch）。词源来自西班牙语 lazo，意思是“绳结/套索”。在文学或影视中，套索常象征“控制、驯服、抓住机会”等意象。"]}
{"word":"lassos","summary":{"en":"“Lassos” can mean rope loops used for catching animals (plural noun) or “he/she/it lassos” (verb).","zh":"“lassos”既可指“套索”（名词复数），也可作动词表示“他/她/它用套索套住；（比喻）牢牢抓住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “lasso”: loops of rope used to catch animals (especially cattle or horses).","zh":"“lasso”的复数：套索（用绳子做成的圈），常用于套住牛或马等动物。"},"examples":[{"en":"The ranch hands carried lassos on their saddles.","zh":"牧场工人把套索挂在马鞍上。"},{"en":"In old Western movies, cowboys throw lassos to catch runaway horses.","zh":"在老西部电影里，牛仔会甩出套索去抓逃跑的马。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “lasso”: to catch, control, or pull something by looping a rope around it (also used figuratively).","zh":"“lasso”的第三人称单数：用套索（绳圈）套住并控制或拉住（也可引申为“牢牢抓住/掌控”）。"},"examples":[{"en":"She lassos the calf quickly and ties it safely.","zh":"她迅速套住小牛，并把它安全地系好。"},{"en":"The story lassos your attention from the first page.","zh":"这个故事从第一页起就牢牢抓住你的注意力。"}]}],"synonyms":["noose","rope loop","snare"],"phonetic":"/ˈlæsoʊ/","extraExplanation":["“lasso”来自西班牙语 lazo，意为“绳结、圈套”。在美国文化里常与牛仔、牧场生活和“西部片（Western）”联系在一起，因此在文学与影视中也常被用作“控制、抓住机会/注意力”的比喻。"]}
{"word":"lassu","summary":{"en":"Lasso: a rope loop used to catch animals; also a verb meaning to catch/secure with a loop.","zh":"Lasso：用来套住动物的套索；也可作动词，表示用套索套住/圈住（引申为迅速抓住）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rope with a sliding loop, used to catch animals (especially cattle or horses)","zh":"（套牛马等用的）套索；套绳"},"examples":[{"en":"The cowboy threw a lasso over the calf’s head.","zh":"牛仔把套索套在小牛的头上。"},{"en":"He practiced swinging a lasso in the yard.","zh":"他在院子里练习甩套索。"}]},{"partOfSpeech":"v.","definition":{"en":"to catch or control someone or something with a lasso; more generally, to grab or secure something quickly","zh":"用套索捕捉/套住；（引申）迅速抓住、圈住"},"examples":[{"en":"They lassoed the horse and led it back to the barn.","zh":"他们用套索套住那匹马，把它牵回了马厩。"},{"en":"She managed to lasso a great deal on a used laptop.","zh":"她成功捡到便宜，买到一台二手笔记本的好价钱。"}]}],"synonyms":["noose","rope","snare"],"phonetic":"/ˈlæsoʊ/","extraExplanation":["你输入的“lassu”在英语里不常见；最常见的对应词是“lasso”（套索）。在美国西部文化/牛仔语境中很常用，也常出现在西部片和牛仔表演（rodeo）里。","在软件里你可能见过“lasso tool”（套索工具），比如图像编辑软件中用来圈选不规则区域的工具：to lasso an area（用套索圈选一个区域）。"]}
{"word":"last","summary":{"en":"“Last” most commonly means “final” or “most recent,” and it can also mean “to continue/endure” as a verb.","zh":"“last”最常表示“最后的/最末的”或“最近的/上一次的”，作动词还可表示“持续、耐用”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Coming after all others in time, order, or position; the most recent or final one.","zh":"最后的；在时间、顺序或位置上排在最末的；最近的。"},"examples":[{"en":"This is the last page of the book.","zh":"这是这本书的最后一页。"},{"en":"I saw her last week.","zh":"我上周见过她。"},{"en":"He was the last person to leave the office.","zh":"他是最后一个离开办公室的人。"}]},{"partOfSpeech":"n.","definition":{"en":"The final part, event, or person; the most recent thing.","zh":"最后的部分/事件/人；最近发生的事。"},"examples":[{"en":"We saved the best for last.","zh":"我们把最好的留到最后。"},{"en":"I didn’t catch the last of what you said.","zh":"你最后那部分话我没听清。"}]},{"partOfSpeech":"v.","definition":{"en":"To continue for a period of time; to remain in good condition.","zh":"持续（一段时间）；耐用；保持良好状态。"},"examples":[{"en":"This battery should last all day.","zh":"这块电池应该能撑一整天。"},{"en":"These shoes won’t last long in the rain.","zh":"这双鞋在雨里不耐穿。"}]},{"partOfSpeech":"adv.","definition":{"en":"Most recently; in the most recent time period.","zh":"最近；上一次；最近这段时间。"},"examples":[{"en":"When did you last talk to him?","zh":"你上次什么时候跟他说话的？"},{"en":"I last visited New York in 2022.","zh":"我上次去纽约是在2022年。"}]}],"synonyms":["final","latest","most recent","end","endure","continue"],"phonetic":"/læst/","extraExplanation":["“last”既可以表示“最后的/最末的”（形容词），也常用于表示“上一个/最近的”（如 last week=上周）。注意：last night 在中文里通常译作“昨晚”。","动词 last 常和时间搭配（last for two hours/last all day），表示“持续”；也可以表示“耐用”（These jeans last a long time）。","常见搭配：at last（终于）、last but not least（最后但同样重要）、the last straw（压垮骆驼的最后一根稻草）。"]}
{"word":"last hurrah","summary":{"en":"“Last hurrah” means a final effort or a final celebration before something ends or changes.","zh":"“last hurrah”指在结束或重大变化前的最后一次努力、亮相或庆祝（最后一搏/最后的狂欢）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A final effort, performance, or period of success before ending or retiring.","zh":"在结束或退休前的最后一次努力、表演或辉煌时刻。"},"examples":[{"en":"The team’s playoff run was their last hurrah before several players retired.","zh":"这次季后赛之旅是多名球员退役前的最后一搏。"},{"en":"She threw a big party as a last hurrah before moving abroad.","zh":"她在出国前办了一场盛大派对，当作最后的狂欢。"}]},{"partOfSpeech":"phrase","definition":{"en":"A final celebration or bout of fun before a major change, often used for events like a last night out.","zh":"在重大变化前的最后一次庆祝或放纵玩乐（常指“最后一晚出去玩”等）。"},"examples":[{"en":"They planned a last hurrah on Friday before starting their new jobs.","zh":"他们计划周五来一场最后的狂欢，然后去新工作报到。"},{"en":"Let’s have one last hurrah—dinner and karaoke—before the semester ends.","zh":"学期结束前我们来最后嗨一次吧——吃饭再唱K。"}]}],"synonyms":["finale","swan song","last fling","farewell celebration","last burst"],"phonetic":"/læst hʊˈrɑː/","extraExplanation":["“hurrah”（也拼作“hurray”）是表示欢呼的感叹词，意思类似“好耶！”“last hurrah”字面是“最后一次欢呼”，引申为“最后一次亮相/最后一次尽兴”。","这个短语常见于新闻与口语，既可带一点怀旧、感伤，也可带轻松的“最后再玩一次”的感觉。语气通常不悲伤，更像是给一个阶段画上热闹的句号。","文化提示：在职场、毕业、搬家、退役等语境里很常见，可指一次活动（a last hurrah）也可指一段时期（their last hurrah）。"]}
{"word":"lastage","summary":{"en":"“lastage” is not a common standard word; it usually means the phrase “last age” (“the previous era”) or is a typo.","zh":"“lastage”不是常见标准词；通常是短语“last age”（上一时代/先前时期）的连写或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern use; it is most often a misspelling or a fused form of the phrase “last age” (meaning “the previous era/period”).","zh":"不是现代英语中常见的标准单词；多半是拼写错误，或把短语“last age”（意为“上一时代/先前时期”）连写在一起。"},"examples":[{"en":"I couldn’t find “lastage” in the dictionary—did you mean “last age”?","zh":"我在词典里找不到“lastage”——你是想写“last age”吗？"},{"en":"In the last age, people traveled more slowly than we do today.","zh":"在上一时代，人们旅行比今天慢得多。"}]}],"synonyms":["previous era","former times","past age"],"phonetic":"/ˈlæst eɪdʒ/","extraExplanation":["“lastage”很可能是把两个词连在一起（last + age），或是拼写误差。你可以检查原句语境：\n- 如果你想表达“上一代/过去的时代”，通常写作“last age / the last age”。\n- 如果你原本想写的是“lactase”（乳糖酶）或“last-ditch”（最后关头的），拼写会比较接近但意思完全不同。\n把包含它的整句话发我，我可以帮你判断最可能的正确词和用法。"]}
{"word":"lasted","summary":{"en":"“Lasted” means “continued for a period of time” or “endured/survived,” and it is the past form of “last.”","zh":"“Lasted”是“last”的过去式/过去分词，表示“持续一段时间”或“忍受并挺过去/坚持下来”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “last”: to continue for a period of time; to remain available or in good condition until the end of a period","zh":"“last”的过去式和过去分词：持续一段时间；（物品/资源）够用、维持到某个时间结束"},"examples":[{"en":"The meeting lasted two hours.","zh":"会议持续了两个小时。"},{"en":"Our food lasted until the end of the trip.","zh":"我们的食物一直够用到旅行结束。"},{"en":"The phone battery lasted all day.","zh":"手机电池撑了一整天。"}]},{"partOfSpeech":"vi.","definition":{"en":"to endure a difficult situation; to survive or keep going","zh":"忍受（困难处境）；挺过去、坚持下去"},"examples":[{"en":"We lasted through the heat without air-conditioning.","zh":"没有空调，我们熬过了炎热。"},{"en":"She lasted longer than anyone expected.","zh":"她比任何人预料的都坚持得更久。"}]}],"synonyms":["continued","endured","persisted","held out","survived"],"phonetic":"/læst/","extraExplanation":["“lasted”常用来表示“从开始到结束持续了多久”，后面常接时间长度（two hours / all day / a week）。提问时常用：How long did it last?（持续了多久？）。","注意区分：last（动词：持续/够用） vs. last（形容词：最后的）。例如：the last day（最后一天）不是“持续的一天”。"]}
{"word":"laster","summary":{"en":"“Laster” is an uncommon noun meaning either something long-lasting or (in shoemaking) a worker who shapes shoes on a last.","zh":"“laster”是不常见的名词，可指“耐久的事物/人”，也可指制鞋行业中把鞋面套在鞋楦上定型的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that lasts for a long time; something long-lasting (rare in modern English).","zh":"能持久的人或事物；耐久的东西（现代英语中较少用）。"},"examples":[{"en":"Their friendship turned out to be a laster, not just a short phase.","zh":"他们的友谊证明是长久的，不只是短暂的一段。"},{"en":"The museum wants materials that are real lasters, not items that fall apart quickly.","zh":"博物馆想要真正耐久的材料，而不是很快就会散掉的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"a worker who shapes or stretches shoes over a shoe last during shoemaking (specialized).","zh":"制鞋工：在制鞋过程中把鞋面套在鞋楦（last）上并进行定型/拉伸的人（专业用语）。"},"examples":[{"en":"She trained as a laster in a traditional shoe factory.","zh":"她在一家传统制鞋厂培训成为拉楦工。"},{"en":"The laster checked the fit carefully before the soles were attached.","zh":"拉楦工在粘上鞋底前仔细检查了合脚程度。"}]}],"synonyms":["long-lasting thing","stayer","shoemaker","cobbler (related)"],"phonetic":"/ˈlæstɚ/","extraExplanation":["“laster”在日常英语里不常见。很多学习者输入“laster”其实是想写：\n- “later”（稍后）\n- “last”（最后的/持续）\n- “latest”（最新的）\n如果你告诉我句子语境，我可以帮你确认你真正想用的词。","在文学或较旧的用法里，“a laster”可用来强调“经得起时间考验的人/事物”，但现代更常说“something that lasts”或“long-lasting”。"]}
{"word":"lasters","summary":{"en":"“Lasters” can mean things/people that last a long time (rare), or shoemaking workers who shape shoes over a last (more specific, technical).","zh":"“lasters”可以指“耐久的东西/能长久的人”（较少见），也可指制鞋行业中把鞋面拉紧并固定在鞋楦上的工人（更专业的用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that last for a long time; long-lasting ones (rare, informal).","zh":"能持续很久的人或事物；耐久的东西（较少见、偏口语）。"},"examples":[{"en":"These batteries are real lasters—they keep working for weeks.","zh":"这些电池真耐用——能用好几个星期。"},{"en":"The best friendships are the lasters.","zh":"最好的友谊是那些能长久维持的。"}]},{"partOfSpeech":"n.","definition":{"en":"In shoemaking, workers who pull and shape the upper part of a shoe tightly over the “last” (the foot-shaped mold).","zh":"（制鞋业）楦帮工；把鞋面拉紧并包裹在“鞋楦”（脚形模具）上的工人。"},"examples":[{"en":"The factory hired experienced lasters to improve the fit of the shoes.","zh":"工厂雇了有经验的楦帮工来提升鞋子的合脚度。"},{"en":"Lasters work carefully so the leather lies smooth over the last.","zh":"楦帮工会细心操作，让皮革在鞋楦上平整贴合。"}]}],"synonyms":["long-lasting ones","durable items","lasting workers (shoemaking)","shoemakers (general)"],"phonetic":"/ˈlæstɚz/","extraExplanation":["“laster(s)”这个词在日常英语里不算常见；很多情况下人们会直接说“long-lasting (adj.)”“durable (adj.)”或用动词“last”。","制鞋语境里，“last”（鞋楦）是一个很关键的名词：它是脚的形状模具，用来决定鞋的外形和尺码；“lasting”是把鞋面固定到鞋楦上的工序，因此“laster”就是做这一步的人。"]}
{"word":"lastex","summary":{"en":"Lastex is an elastic yarn or fabric used in clothing to add stretch.","zh":"Lastex 指一种用于服装等纺织品的弹性纱线或弹力面料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of elastic yarn or fabric (often rubber thread covered with cotton or other fibers), used especially in clothing to make parts stretchable","zh":"一种弹性纱线或弹性面料（常见为橡胶线外包棉或其他纤维），多用于服装，使部分具有伸缩性"},"examples":[{"en":"The waistband is made with Lastex, so it stretches comfortably.","zh":"腰头使用了 Lastex，所以穿起来弹性舒服。"},{"en":"Vintage swimsuits often used Lastex for a snug fit.","zh":"复古泳衣常用 Lastex 来贴身包裹。"}]}],"synonyms":["elastic","elastic thread","rubber thread","stretch fabric"],"phonetic":"/ˈlæstɛks/","extraExplanation":["Lastex 常被当作材料名使用，也曾是商标名；在服装与家用纺织品语境中更常见。常见搭配：Lastex waistband（松紧腰头）、Lastex thread（松紧线）、Lastex panel（弹力拼片）。"]}
{"word":"lasting","summary":{"en":"“Lasting” most commonly means “long-lasting; continuing for a long time,” often used for impressions, effects, relationships, or changes.","zh":"“lasting”最常见表示“持久的、长久的”，常用于印象、影响、关系或变化等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"continuing for a long time; not quickly ending or fading","zh":"持久的；长久的；不容易结束或消退的"},"examples":[{"en":"They built a lasting friendship through years of hard times.","zh":"他们在多年的艰难时期中建立了持久的友谊。"},{"en":"The speech made a lasting impression on the audience.","zh":"那次演讲给听众留下了持久的印象。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making something last longer, especially in clothing and shoe repair (e.g., shaping leather over a mold called a “last”)","zh":"（尤指制鞋/修鞋中的）楦制、绷楦等工序；使材料成形并更耐用的过程（与“last 鞋楦”相关）"},"examples":[{"en":"The workshop teaches basic lasting techniques for handmade shoes.","zh":"这家工坊教授手工鞋的基础绷楦技巧。"}]}],"synonyms":["long-lasting","enduring","persistent","permanent (often stronger)","sustained"],"phonetic":"/ˈlæstɪŋ/","extraExplanation":["“lasting”最常见是形容词，常与名词搭配：lasting impact/impression（持久的影响/印象）、lasting love（长久的爱）、lasting damage（长期损害）。","注意与“last”（持续）区分：last 是动词（The meeting lasted two hours. 会议持续了两小时）；lasting 是形容词（a lasting change 持久的改变）。","名词用法“lasting”较少见，多出现在制鞋领域，来源与“last（鞋楦）”有关。日常英语中你几乎只会遇到形容词用法。"]}
{"word":"lastingly","summary":{"en":"“Lastingly” means “in a way that lasts for a long time,” often used in formal writing about lasting effects or impressions.","zh":"“lastingly”表示“以持久的方式、长久地”，多用于较正式的表达，强调影响或印象的长期性。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that continues for a long time; enduringly.","zh":"持久地；长久地；经久地。"},"examples":[{"en":"The policy changed the company’s culture lastingly.","zh":"这项政策长期而深远地改变了公司的文化。"},{"en":"She made a lastingly positive impression on her students.","zh":"她给学生们留下了持久的积极印象。"}]}],"synonyms":["enduringly","permanently","durably","for good"],"phonetic":"/ˈlæs.tɪŋ.li/","extraExplanation":["“lastingly”来自形容词“lasting（持久的）”+ 副词后缀“-ly”。在日常口语中更常用“for a long time / in the long run / permanently”等表达；“lastingly”偏正式、书面，常用于强调影响或效果的“长久性”。","常见搭配：lastingly + affect/change/shape/impress（持久地影响/改变/塑造/留下印象）；lastingly + popular/important（长期受欢迎/重要）。"]}
{"word":"lastingness","summary":{"en":"“Lastingness” means the quality of lasting a long time—durability or persistence.","zh":"“lastingness”指“能持续很久的特质”，即持久性、耐久性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of continuing for a long time; durability or staying power","zh":"持久性；耐久性；能持续很久的特质"},"examples":[{"en":"They tested the lastingness of the fabric after many washes.","zh":"他们在多次清洗后测试了这种布料的持久性。"},{"en":"What matters most is the lastingness of the peace agreement, not just signing it.","zh":"最重要的是和平协议能否长久维持，而不只是签署它。"}]}],"synonyms":["durability","longevity","persistence","staying power","endurance"],"phonetic":"/ˈlæs.tɪŋ.nəs/","extraExplanation":["“lastingness”在日常英语里不算常见，更自然的说法通常是“durability（耐用性）”“longevity（寿命/长久）”“staying power（持久力）”或“endurance（耐力）”。","在写作或学术语境中，“lastingness”有时用来强调“持续存在”这件事本身（例如关系、影响、政策的长期性），但在产品/材料语境里更常用“durability”。"]}
{"word":"lastings","summary":{"en":"“Lastings” most often relates to things that continue for a long time (from “lasting”), and it can also mean a traditional durable fabric used for shoes.","zh":"“lastings”多与“持久、长期的”（来自 lasting）相关；也可指一种传统的耐磨布料（曾用于制鞋）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"continuing for a long time; durable; not easily forgotten or changed.","zh":"持续很久的；耐久的；不易消失或改变的。"},"examples":[{"en":"Their friendship has had a lasting impact on her life.","zh":"他们的友谊对她的人生产生了持久的影响。"},{"en":"We want a lasting solution, not a quick fix.","zh":"我们想要一个长久的解决方案，而不是临时的权宜之计。"}]},{"partOfSpeech":"n.","definition":{"en":"things that last, especially good results or effects that continue over time (often used in the phrase “the lastings of …”).","zh":"能长久留下的东西，尤指持续的成果或影响（常见于“the lastings of …”这种表达）。"},"examples":[{"en":"He hoped the lastings of his work would help future students.","zh":"他希望自己工作的长远成果能帮助未来的学生。"}]},{"partOfSpeech":"n.","definition":{"en":"(traditional) a strong, durable fabric, once commonly used for shoes; “lastings” is the plural form.","zh":"（传统用法）一种结实耐磨的布料，曾常用于制鞋；“lastings”为其复数形式。"},"examples":[{"en":"The old catalog listed leather, canvas, and lastings for work shoes.","zh":"那本旧目录列出了工靴用的皮革、帆布和耐磨布（lastings）。"}]}],"synonyms":["enduring","long-lasting","durable","persistent"],"phonetic":"/ˈlæstɪŋz/","extraExplanation":["“lastings”最常见的来源是形容词“lasting”的复数形式（比如写作里把“lasting effects/changes”换一种表达），但在现代日常英语中更自然的说法通常是“lasting + 名词”（如 lasting memory / lasting damage）。","作为布料名词的“lastings”属于偏旧的行业/历史用语，常见于旧式商品目录、制鞋或纺织背景中；在现代口语里不太常用。"]}
{"word":"lastjob","summary":{"en":"“Last job” usually means your most recent previous employment; less commonly it can mean the final task in a sequence.","zh":"“last job”通常指你最近上一份工作；较少情况下也可指一系列任务中的最后一项。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the most recent job you had before your current one (often used on resumes, in interviews, or in job applications)","zh":"你在当前工作之前最近做过的那份工作（常用于简历、面试或求职申请中）"},"examples":[{"en":"In my last job, I managed a small customer service team.","zh":"在我上一份工作中，我管理了一个小型客服团队。"},{"en":"What did you learn in your last job that will help you here?","zh":"你在上一份工作中学到的哪些东西能帮助你胜任这里的工作？"}]},{"partOfSpeech":"phrase","definition":{"en":"the final job in a series or the last task to do (less common; depends on context)","zh":"一系列工作/任务中的最后一项（较不常见，取决于语境）"},"examples":[{"en":"After we finish these repairs, the last job is to test the system.","zh":"修完这些之后，最后一项工作是测试系统。"}]}],"synonyms":["previous job","former job","most recent job","prior job","previous role"],"phonetic":"/læst dʒɑb/","extraExplanation":["“lastjob”更常见的写法是分开写成“last job”或“previous job”。求职语境里，“last job”通常指“上一份工作/最近一份工作”，不强调“最后一次（再也不工作了）”。","在简历/面试中，常用替代表达：previous role（上一份职位）、most recent position（最近的职位）、former employer（前雇主）。","与“last job”不同，“last”有时也可表示“最终的/最后的”，因此在非求职语境里可能是“最后一项任务”的意思。"]}
{"word":"lastly","summary":{"en":"“Lastly” means “at the end” and is often used to introduce the final point in a list.","zh":"“Lastly”表示“最后”，常用于引出列表或陈述中的最后一点。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"at the end; after everything else has been done or mentioned","zh":"最后；在所有事情完成或提到之后"},"examples":[{"en":"Lastly, please remember to lock the door when you leave.","zh":"最后，请记得离开时把门锁上。"},{"en":"We discussed the budget, the timeline, and lastly the risks.","zh":"我们讨论了预算、时间表，最后是风险。"}]},{"partOfSpeech":"adv.","definition":{"en":"more recently; most recently (less common)","zh":"最近；最近一次（较少用法）"},"examples":[{"en":"I saw her lastly at the conference in May.","zh":"我最近一次见到她是在五月的会议上。"}]}],"synonyms":["finally","in the end","at last","ultimately"],"phonetic":"/ˈlæstli/","extraExplanation":["“Lastly”常用于列举要点时的最后一项，语气比“finally”更偏向“顺序/结构”，不一定带有“终于”的情绪色彩。","常见搭配：firstly/secondly/lastly（较正式）；也可用更自然的 first/second/last（更口语）。"]}
{"word":"lastness","summary":{"en":"“Lastness” is a rare noun meaning either durability (lasting a long time) or the state of being last.","zh":"“lastness”是个少见名词，可指“持久/耐久性”，也可指“处于最后的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) The quality of lasting for a long time; durability.","zh":"（少见）持久的性质；耐久性。"},"examples":[{"en":"Good shoes are made for lastness, not just for style.","zh":"好鞋是为“耐穿持久”而做的，不只是为了好看。"},{"en":"The poem praises the lastness of love beyond hardship.","zh":"这首诗赞美爱情在苦难之外的持久。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The state of being last or coming at the end.","zh":"（少见）最后、末尾的状态（最后出现/排在末尾）。"},"examples":[{"en":"He felt the lastness of being chosen after everyone else.","zh":"他感到自己在所有人之后才被选中的那种“最后”的滋味。"},{"en":"In the lineup, her lastness made her easy to miss.","zh":"在队列里，她排在最后，容易被忽略。"}]}],"synonyms":["durability","lastingness","longevity","endness (rare)"],"phonetic":"/ˈlæstnəs/","extraExplanation":["“lastness”并不是常用词，更自然的表达通常是：durability（耐久性）、lastingness（持久性）、longevity（长久）、the fact of being last（处于最后的事实）。","它由形容词/动词“last”（持续；最后的）加名词后缀“-ness”构成，语感上偏书面或刻意造词，偶见于诗歌、评论或强调“持久/末尾”这种抽象概念的写法。"]}
{"word":"lastre","summary":{"en":"“lastre” is not a common English word; in Spanish it means “ballast” or figuratively a “burden/drag.”","zh":"“lastre”不是常见英语词；它来自西班牙语，意为“压舱物/配重”，也可比喻“负担/拖累”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not common in English) a Spanish loanword meaning “ballast” (heavy material used to stabilize a ship/vehicle) or, figuratively, a “burden/drag” that holds someone or something back.","zh":"（英语中不常用）源自西班牙语的借词，意为“压舱物/配重”（用来让船或车辆更稳定的重物）；引申为“负担/累赘”，指拖累前进的因素。"},"examples":[{"en":"In Spanish, lastre can mean the ballast that keeps a ship stable.","zh":"在西班牙语中，lastre 可以指让船保持稳定的压舱物。"},{"en":"Debt can become a lastre that slows a company’s growth.","zh":"债务可能成为拖慢公司成长的“负担/累赘”。"}]}],"synonyms":["ballast","burden","drag","dead weight"],"phonetic":"/ˈlɑːstreɪ/","extraExplanation":["“lastre”在标准英语词典里通常不作为常见词条出现；你更可能在西班牙语语境（如新闻、航运、经济评论）中看到它。","如果你想表达英语里的对应词：字面义常用 ballast；比喻义可用 burden / drag / dead weight（更口语一些）。","若你本来想查的是拼写相近的英文词，请告诉我上下文；常见混淆包括 luster（光泽）或 last（持续/最后的）。"]}
{"word":"lasts","summary":{"en":"“Lasts” most commonly means “continues” or “remains usable” (he/she/it lasts). It can also be the plural noun for shoemaking forms called “lasts.”","zh":"“Lasts”最常见表示“持续/耐用”（last 的第三人称单数：他/她/它 lasts）。也可作名词复数，指制鞋用的“鞋楦”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “last”) to continue for a period of time; to remain in good condition or be usable for a long time.","zh":"（动词 last 的第三人称单数）持续一段时间；（物品）耐用、保持良好状态。"},"examples":[{"en":"The meeting usually lasts about an hour.","zh":"会议通常持续大约一个小时。"},{"en":"This phone battery lasts all day.","zh":"这块手机电池能撑一整天。"},{"en":"Good shoes can last for years if you take care of them.","zh":"好鞋如果保养得当，可以穿很多年。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural noun) shoemaking forms (usually wooden or plastic) shaped like feet, used to make or repair shoes.","zh":"（名词复数）鞋楦（通常为木制或塑料制的脚形模具，用于制鞋或修鞋）。"},"examples":[{"en":"The cobbler keeps several lasts in different sizes.","zh":"鞋匠保存着几种不同尺码的鞋楦。"},{"en":"These boots were made on custom lasts.","zh":"这双靴子是用定制鞋楦制作的。"}]}],"synonyms":["continues","goes on","endures","persists","remains","holds up"],"phonetic":"/læsts/","extraExplanation":["“lasts”最常见是动词“last”的第三人称单数（He/She/It lasts）。如果你想表达“最后”，常用“last”作形容词（the last day）或“lastly”作副词（Lastly, …），不要用“lasts”。","名词“last”（鞋楦）属于制鞋行业用语，日常对话里不常见，但在谈皮鞋、靴子工艺或定制鞋时会出现。"]}
{"word":"lastspring","summary":{"en":"“Last spring” means the spring of the previous year, or the most recently passed spring depending on context.","zh":"“last spring”表示“去年春天/上一个春天”，也可能在语境中指“最近刚过去的春季”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"in the spring of the previous year (the spring before now)","zh":"去年春天；上一年春季"},"examples":[{"en":"Last spring, I started learning English seriously.","zh":"去年春天，我开始认真学英语。"},{"en":"We visited Washington, D.C., last spring.","zh":"我们去年春天去了华盛顿特区。"}]},{"partOfSpeech":"phrase","definition":{"en":"the most recent spring season that has just passed (depending on context, often the spring before this current season)","zh":"刚过去的那个春天（语境中指最近结束的春季）"},"examples":[{"en":"The flowers were amazing last spring.","zh":"刚过去的那个春天花开得特别美。"},{"en":"Compared to last spring, this year feels much warmer.","zh":"和上个春天相比，今年感觉暖多了。"}]}],"synonyms":["this past spring","spring of last year","the previous spring"],"phonetic":"/læst sprɪŋ/","extraExplanation":["“lastspring”通常应写成两个词：last spring。英语里“last + 时间”（last night/last week/last year）表示“上一个/去年”。","它的具体指向有时取决于说话时点：如果现在是夏天或秋天，“last spring”通常就是今年春天；如果现在是春天，“last spring”更可能指去年春天。为避免歧义，可以说“this past spring”（今年刚过去的春天）或“spring of last year”（去年春天）。"]}
{"word":"lasty","summary":{"en":"“lasty” is a rare adjective meaning “lasting/durable.” In most writing, “lasting” or “lastly” is more common depending on meaning.","zh":"“lasty”是较少见的形容词，意思接近“持久的/耐用的”。实际写作中通常用“lasting”（持久的）或“lastly”（最后），取决于你想表达的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lasting for a long time; durable (rare or informal).","zh":"持久的；耐用的（较少见或偏口语用法）。"},"examples":[{"en":"These shoes are really lasty—I’ve worn them for years.","zh":"这双鞋很耐穿——我穿了好多年。"},{"en":"We need a lasty solution, not a quick fix.","zh":"我们需要一个持久的解决方案，而不是临时补救。"}]}],"synonyms":["lasting","durable","long-lasting","enduring"],"phonetic":"/ˈlæsti/","extraExplanation":["“lasty”在现代标准英语里不常见，很多时候人们其实想写的是：\n1) “lastly”（副词，表示“最后”）；\n2) “lasting / long-lasting”（形容词，表示“持久的”）。\n如果你告诉我你的句子语境，我可以帮你确认你真正想用的词。"]}

