{"word":"lauan","summary":{"en":"Lauan is a Southeast Asian tropical hardwood commonly sold as plywood, sometimes called Philippine mahogany.","zh":"Lauan 指一种东南亚热带硬木，常见于夹板/胶合板；有时被称作“菲律宾桃花心木”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tropical hardwood (often used as plywood) from Southeast Asian trees, especially in the Philippines; also called Philippine mahogany in the wood trade","zh":"一种热带硬木（常被制成胶合板/夹板），来自东南亚树种（尤指菲律宾）；在木材贸易中也常被称为“菲律宾桃花心木”"},"examples":[{"en":"The cabinet is made of lauan plywood with a painted finish.","zh":"这个橱柜是用劳安木夹板做的，表面做了喷漆处理。"},{"en":"Builders often choose lauan because it is lightweight and affordable.","zh":"建筑工人常选用劳安木，因为它相对轻便、价格也更亲民。"},{"en":"The store sells lauan panels in several thicknesses.","zh":"这家店出售多种厚度的劳安木板材。"}]}],"synonyms":["Philippine mahogany","meranti","lauan plywood"],"phonetic":"/ləˈwɑn/","extraExplanation":["“Lauan”在英语里多指一类商品木材名称，而不一定是单一物种；常与“meranti（娑罗双属 Shorea 等）”相关。","木材市场上有时把 lauan 叫作“Philippine mahogany（菲律宾桃花心木）”，但它通常不属于真正的 mahogany（桃花心木属 Swietenia）；购买或做材料说明时可留意这种命名差异。"]}
{"word":"lauans","summary":{"en":"“Lauans” is the plural of “lauan,” a tropical hardwood (and the plywood made from it) often used for low-cost panels and furniture.","zh":"“lauans”是“lauan”的复数，指劳安木这种热带硬木（也可指劳安木胶合板），常用于较低成本的板材和家具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tropical hardwood (often used for plywood and cheap furniture), especially from trees in the Shorea group; also the plywood made from it","zh":"劳安木（一种热带硬木，常用于胶合板和较便宜的家具；也可指用劳安木做的胶合板）"},"examples":[{"en":"The cabinet is made of lauan plywood, so it dents easily.","zh":"这个橱柜是用劳安木胶合板做的，所以很容易被磕出凹痕。"},{"en":"They used lauans for the interior panels to keep costs down.","zh":"他们用劳安木做室内板材来降低成本。"}]}],"synonyms":["Philippine mahogany (trade name)","lauan plywood","meranti (related trade term)"],"phonetic":"/ləˈwɑn/","extraExplanation":["“lauan”（也写作 lauan plywood）在北美常出现在装修、木工和家具材料的语境里，带有“价格较低、质地较软、易凹”的联想。","词源上多与菲律宾及东南亚木材贸易相关；日常对话里更常听到的是“plywood（胶合板）”“veneer（木皮）”，而“lauan”偏材料名称、较专业。"]}
{"word":"Laub","summary":{"en":"“Laub” is mainly a German word meaning “foliage/leaves,” and it can also be a German surname.","zh":"“Laub”主要是德语词，意思是“枝叶/树叶（叶丛）”，也可作德语姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from German) foliage; a mass of leaves, especially on trees.","zh":"（源自德语）树叶；（尤指树木的）叶丛、枝叶。"},"examples":[{"en":"In German poetry, “Laub” often suggests the quiet beauty of autumn leaves.","zh":"在德语诗歌里，“Laub”常用来表达秋叶的静美。"},{"en":"The path was covered with golden Laub after the storm.","zh":"暴风雨过后，小路上铺满了金黄的落叶（Laub）。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname) found in German-speaking areas and among descendants abroad.","zh":"一个姓氏（常见于德语地区及其移民后裔中）。"},"examples":[{"en":"Dr. Laub will speak at the conference tomorrow.","zh":"Laub 博士明天将在会议上发言。"},{"en":"She traced the Laub family history back to Austria.","zh":"她把 Laub 家族的历史追溯到奥地利。"}]}],"synonyms":["foliage","leaves"],"phonetic":"/laʊb/","extraExplanation":["“Laub”是标准德语常用词，通常指“树叶/枝叶（foliage）”，与“Blatt（单片叶子）”相比更强调“一片叶丛、满树的叶子”这种整体感。","作为英语语境里的大写“Laub”，最常见是姓氏；读音在英语中常被读作 /laʊb/（类似 loud 的开头），而德语末尾辅音可能更接近清音。"]}
{"word":"laubanite","summary":{"en":"Laubanite is a very rare term, used mainly as a mineral name or (rarely) meaning “from/related to Lauban.”","zh":"Laubanite 是非常罕见的词，主要作为矿物名称使用，或（较少见地）表示“来自/与 Lauban（旧地名）相关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very rare mineral name used in mineralogy (not widely encountered in everyday English).","zh":"一种在矿物学中使用的、非常罕见的矿物名称（在日常英语中几乎见不到）。"},"examples":[{"en":"Laubanite is listed in some older mineral references as a rare species.","zh":"在一些较早的矿物学资料中，laubanite 被列为一种罕见矿物。"},{"en":"Most students will never see laubanite outside of a database or catalog.","zh":"大多数学生除了在数据库或目录里，几乎不会接触到 laubanite。"}]},{"partOfSpeech":"adj.","definition":{"en":"(historical/rare) relating to Lauban, a former German place name (today Lubań in Poland).","zh":"（历史用法/罕见）与 Lauban 相关的；Lauban 是一个旧的德语地名（今波兰的 Lubań）。"},"examples":[{"en":"Some documents mention Laubanite families in the region before the borders changed.","zh":"一些文件会提到边界变更前该地区的 “Laubanite” 家族。"}]}],"synonyms":["(mineral context) -ite minerals (pattern, not exact synonym)","(place-related) Lauban (historical place name)"],"phonetic":"ˈlaʊbənaɪt","extraExplanation":["这个词非常冷门，更多出现在专业名录、旧文献或地名相关的历史语境里。","如果你是在读矿物学资料里看到它，通常是“以地名/地点命名的矿物”的命名方式：词尾 -ite 在矿物名称中很常见（如 calcite, hematite）。","如果你是想拼 “laoban(老板)” 相关的英文，那通常不会用 laubanite；可以告诉我你的具体语境，我能帮你确认你真正想查的词。"]}
{"word":"laud","summary":{"en":"Laud means to praise highly, especially in public or formal contexts.","zh":"Laud 指（尤其在公开或正式场合）高度赞扬、称颂。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To praise someone or something highly, often in public or formal language.","zh":"（公开或正式地）高度赞扬，称颂（某人或某事）。"},"examples":[{"en":"Critics lauded the film for its powerful story.","zh":"影评人称赞这部电影的故事很有力量。"},{"en":"The coach was lauded as a leader who never gave up on the team.","zh":"教练被称颂为一位从不放弃球队的领导者。"}]}],"synonyms":["praise","commend","extol","applaud"],"phonetic":"/lɔd/","extraExplanation":["“laud”语气偏正式，常见于新闻、评论、演讲或书面语；日常口语里更常用“praise”“compliment”。","词源来自拉丁语 laudare（赞美），常见同根词：laudable（值得称赞的）、laudatory（赞美的，颂扬的）。","常见搭配：laud someone for something（因某事称赞某人）；be lauded as…（被誉为……）。"]}
{"word":"laudability","summary":{"en":"Laudability means the quality of being deserving of praise.","zh":"Laudability 指“值得称赞/可嘉”的品质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of deserving praise; praiseworthiness","zh":"值得称赞的品质；可嘉之处"},"examples":[{"en":"The laudability of her decision was clear when it helped the whole community.","zh":"当她的决定帮助了整个社区时，这个决定的可嘉之处就很明显了。"},{"en":"People admired the laudability of the volunteers’ quiet, steady work.","zh":"人们敬佩志愿者默默而持续的工作的可嘉之处。"}]}],"synonyms":["praiseworthiness","merit","worthiness","admirability"],"phonetic":"/ˌlɔdəˈbɪləti/","extraExplanation":["“laudability”较少见，较常用的表达是“praiseworthiness”或“worthiness of praise”。","词根“laud-”来自拉丁语 laudare（赞美），加上后缀“-ability”表示“……的性质/能力”，所以整体就是“值得被赞美的性质”。"]}
{"word":"laudable","summary":{"en":"Laudable means “deserving praise; admirable.”","zh":"laudable 意为“值得称赞的；可嘉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Deserving praise because it is good, admirable, or morally right.","zh":"值得称赞的；可嘉的（因为很好、令人钦佩或在道德上正确）。"},"examples":[{"en":"It’s laudable that you apologized and tried to fix the mistake.","zh":"你道歉并努力弥补错误，这一点值得称赞。"},{"en":"Her laudable goal is to make education more accessible to rural students.","zh":"她的可嘉目标是让乡村学生更容易获得教育。"},{"en":"The team showed laudable discipline under pressure.","zh":"团队在压力下表现出可嘉的自律。"}]}],"synonyms":["admirable","praiseworthy","commendable","worthy","creditable"],"phonetic":"/ˈlɔdəbəl/","extraExplanation":["词源上与“praise（赞美）”相关：来自拉丁语 laudare（赞美）。因此 laudable 强调“值得被公开表扬”的性质，而不只是“好”。","常见搭配：a laudable effort/goal/attempt（可嘉的努力/目标/尝试），laudable restraint（可嘉的克制）。","使用提示：laudable 常带一点正式语气，多用于书面或较正式的评价；日常口语里也可用 admirable / praiseworthy 来替换。"]}
{"word":"laudableness","summary":{"en":"“Laudableness” means the quality of being worthy of praise.","zh":"“Laudableness”指“值得称赞的品质/可嘉之处”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of deserving praise; praiseworthiness","zh":"值得称赞的品质；可嘉之处"},"examples":[{"en":"The laudableness of her actions became clear when she quietly paid for the family’s medical bills.","zh":"当她悄悄替那家人支付医疗费用时，她行为的可嘉之处就显现出来了。"},{"en":"He spoke not to show off, but to highlight the laudableness of the volunteers’ work.","zh":"他发言不是为了炫耀，而是为了强调志愿者工作的可嘉之处。"}]}],"synonyms":["praiseworthiness","merit","admirableness","commendability"],"phonetic":"/ˈlɔdəblnəs/","extraExplanation":["“laudableness”较少见，更常用的表达是“praiseworthiness”或形容词“laudable（值得称赞的）”。","词源上来自拉丁语“laudare（称赞）”。结构上是 laudable + -ness，用“-ness”把形容词变成名词，表示“……的性质/状态”。"]}
{"word":"laudably","summary":{"en":"“Laudably” means “in a praiseworthy way,” often used in formal writing.","zh":"“Laudably”意为“值得称赞地”，常用于较正式的表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that deserves praise; commendably.","zh":"值得称赞地；可嘉地。"},"examples":[{"en":"She handled the complaint laudably, staying calm and respectful.","zh":"她处理投诉的方式很可嘉，始终冷静而有礼。"},{"en":"The team worked laudably under pressure and still met the deadline.","zh":"团队在压力下仍然表现出色，按时完成了截止日期。"}]}],"synonyms":["commendably","admirably","praiseworthily","creditably"],"phonetic":"/ˈlɔ.də.bli/","extraExplanation":["“Laudably”来自动词“laud”（称赞、赞美），常用于较正式的书面语（如新闻、演讲、学术写作）中，表示某种行为“值得表扬”，语气比“well”更郑重、更强调“应受称赞”。","常见搭配：laudably honest（诚实得可嘉）、laudably restrained（克制得可嘉）、laudably consistent（始终如一，值得称赞）。","近义词里“admirably”更偏“令人钦佩、让人敬佩”，而“laudably”更强调“应当被公开表扬”。"]}
{"word":"laudanidine","summary":{"en":"Laudanidine is an alkaloid (natural chemical compound) found in the opium poppy, mainly mentioned in scientific contexts.","zh":"Laudanidine 是一种在罂粟中发现的生物碱（天然化学化合物），主要用于科学研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring chemical (an alkaloid) found in the opium poppy and related plants, studied in pharmacology and chemistry","zh":"一种天然存在的化学物质（生物碱），可在罂粟等植物中发现，常见于药理学与化学研究语境"},"examples":[{"en":"Laudanidine is one of several alkaloids that have been identified in the opium poppy.","zh":"Laudanidine 是在罂粟中被鉴定出的多种生物碱之一。"},{"en":"Researchers analyzed laudanidine to better understand the plant’s chemical profile.","zh":"研究人员分析 laudanidine，以更好地了解该植物的化学组成。"}]}],"synonyms":["opium alkaloid","poppy alkaloid"],"phonetic":"/ˌlɔdænɪˈdiːn/","extraExplanation":["这个词主要出现在学术/科研文本中（化学、药理学、植物化学），日常英语里几乎不会用到。","词形上常见于“某某碱（-ine）”的命名方式：英语里很多生物碱或药物成分以 -ine 结尾（如 caffeine, nicotine）。","它与 laudanum（历史上指“鸦片酊”）在词源上有关联：都和传统上从罂粟（opium poppy）获得的成分相关，但 laudanidine 指的是具体的一种化合物名称。"]}
{"word":"laudanin","summary":{"en":"Laudanum is an old opium-in-alcohol medicine once used for pain and sleep, but it is addictive and unsafe.","zh":"Laudanum 指一种旧时的“鸦片酒精酊”，曾用于止痛助眠，但容易成瘾且不安全。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicinal tincture of opium in alcohol, historically used as a painkiller and sleeping aid but highly addictive and dangerous","zh":"（旧时的）鸦片酒精酊剂；曾用于止痛、助眠，但成瘾性强且危险"},"examples":[{"en":"In the 1800s, doctors sometimes prescribed laudanum for pain.","zh":"在19世纪，医生有时会开劳丹宁（鸦片酊）来止痛。"},{"en":"The novel mentions a character who becomes dependent on laudanum.","zh":"小说提到一个角色对劳丹宁（鸦片酊）产生了依赖。"}]}],"synonyms":["opium tincture","tincture of opium"],"phonetic":"/ˈlɔdənəm/","extraExplanation":["你输入的“laudanin”常见于对“laudanum”的拼写误差；标准拼写是 **laudanum**。","Laudanum 在英美文学里常出现于维多利亚时代或19世纪背景（如描写失眠、焦虑、疼痛或药物依赖），带有“旧式药物、阴暗与成瘾风险”的文化联想。","现代医学已极少使用这一名称；相关成分属于受严格管制的阿片类药物。阅读历史文本时可将其理解为“含鸦片的强效镇痛/镇静药水”。"]}
{"word":"laudanine","summary":{"en":"Laudanine is an opium-poppy alkaloid, mainly mentioned in scientific contexts.","zh":"Laudanine（劳达宁）是一种鸦片罂粟中的生物碱，主要出现在科学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring chemical (an alkaloid) found in the opium poppy; used mainly as a scientific/medical term rather than an everyday word","zh":"一种天然生物碱，存在于鸦片罂粟中；主要用于科学/医学语境，而非日常用词"},"examples":[{"en":"Researchers identified laudanine among several alkaloids in the opium poppy.","zh":"研究人员在鸦片罂粟中鉴定出劳达宁等多种生物碱。"},{"en":"The report lists laudanine as a minor constituent of opium.","zh":"报告将劳达宁列为鸦片中的一种微量成分。"}]}],"synonyms":["opium alkaloid","alkaloid"],"phonetic":"ˈlɔdənˌiːn","extraExplanation":["“laudanine”这个词来自“laudanum（鸦片酊）”的词根；历史上 laudanum 是含鸦片的止痛/镇静酊剂。如今 laudanine 多见于化学、药理或毒理学资料中。","词尾 “-ine” 常用于命名生物碱或有机化合物（如 caffeine, morphine），因此它看起来像“化学名”。在普通英语写作中通常不会用到。"]}
{"word":"laudanosine","summary":{"en":"Laudanosine is an alkaloid metabolite produced when atracurium or cisatracurium breaks down, and high levels can affect the central nervous system.","zh":"Laudanosine（劳丹宁）是阿曲库铵或顺式阿曲库铵分解产生的生物碱代谢产物，浓度过高时可能影响中枢神经系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an alkaloid) formed in the body as a breakdown product of the muscle relaxant drugs atracurium and cisatracurium; in high amounts it may affect the brain (for example, increasing the risk of seizures).","zh":"一种化学物质（生物碱），是肌肉松弛药阿曲库铵（atracurium）和顺式阿曲库铵（cisatracurium）在体内分解产生的代谢产物；浓度过高时可能影响大脑（例如增加癫痫样发作风险）。"},"examples":[{"en":"During long ICU infusions of atracurium, clinicians may monitor for accumulation of laudanosine.","zh":"在ICU长期输注阿曲库铵时，临床人员可能会留意劳丹宁（laudanosine）的蓄积。"},{"en":"Laudanosine is discussed mainly in anesthesia and critical-care contexts rather than everyday medicine.","zh":"laudanosine 主要出现在麻醉学与重症医学的讨论中，而不是日常医疗用语里。"}]}],"synonyms":["atracurium metabolite","cisatracurium metabolite"],"phonetic":"/lɔːˈdæn.ə.siːn/","extraExplanation":["词源提示：词形与“laudanum（鸦片酊）”相似，但在现代临床语境中，laudanosine 通常是作为麻醉药（尤其是 atracurium/cisatracurium）代谢相关的术语出现。","发音要点（按音节）：lau-DAN-uh-seen。常见于学术论文、药理学/麻醉学教材与说明书中，口语里较少听到。"]}
{"word":"laudanum","summary":{"en":"Laudanum is an old, opium-based medicine (opium in alcohol) once used to relieve pain and induce sleep, but now considered highly addictive and dangerous.","zh":"Laudanum 指一种旧时的鸦片类药剂（鸦片溶于酒精），曾用于止痛与助眠，但因成瘾性强、风险高而受到严格管制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicinal tincture of opium (opium dissolved in alcohol), formerly used as a painkiller and sedative; now tightly controlled because it is addictive and dangerous.","zh":"（旧时的）鸦片酊：将鸦片溶于酒精制成的药剂，曾用于止痛与镇静；因高度成瘾且危险，如今受严格管制。"},"examples":[{"en":"In old medical records, laudanum was prescribed for severe pain and insomnia.","zh":"在旧医疗记录中，鸦片酊常被用来缓解剧痛和失眠。"},{"en":"The novel mentions a character who secretly relies on laudanum to sleep.","zh":"小说里提到一位角色偷偷依赖鸦片酊入睡。"}]}],"synonyms":["opium tincture","tincture of opium"],"phonetic":"ˈlɔdənəm","extraExplanation":["“laudanum”在18—19世纪的欧洲与北美很常见，许多家庭药箱里都能见到；当时对成瘾风险认识不足，因此在文学作品（尤其是维多利亚时期/哥特式小说）中常与“止痛、昏睡、依赖、堕落”等主题相关。","现代英语里提到“laudanum”通常带有历史或文学色彩；在现实医学语境中更常说“opium tincture（鸦片酊）”。"]}
{"word":"laudanums","summary":{"en":"Laudanum is a historical opium-based medicine, once common for pain and illness but dangerous and addictive.","zh":"Laudanum（劳丹姆/鸦片酊）是一种旧时常用的鸦片类药物，用于止痛等，但危险且易成瘾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong medicine made from opium (often mixed with alcohol), used in the past to treat pain, coughs, and diarrhea; it can cause addiction and poisoning","zh":"（旧时使用的）鸦片酊/劳丹姆（常与酒精混合），用于止痛、止咳、止泻等；但容易导致成瘾与中毒"},"examples":[{"en":"In the 1800s, laudanum was sold as a common painkiller.","zh":"在19世纪，劳丹姆曾作为常见止痛药出售。"},{"en":"The novel describes a character who becomes dependent on laudanum.","zh":"小说描写了一个角色对劳丹姆产生依赖（成瘾）。"},{"en":"Today, doctors avoid laudanum because safer medicines exist.","zh":"如今由于有更安全的药物，医生一般不会使用劳丹姆。"}]}],"synonyms":["opium tincture","tincture of opium","paregoric (related but weaker/older preparation)"],"phonetic":"/ˈlɔdənəm/","extraExplanation":["“laudanum”常见于18—19世纪欧洲与北美的医学与文学语境，作为止痛与镇静药非常普遍，但因含鸦片成分而有高度成瘾风险。维多利亚时代的作品里常用它来表现“隐秘的药物依赖”、悲剧或社会问题。","词源一般认为来自拉丁语相关形式，和“赞美/称颂”（laud-）的词根有关；历史上不同配方可能浓度不一，但都与鸦片制剂相关。"]}
{"word":"laudare","summary":{"en":"“Laudare” is a Latin verb meaning “to praise.”","zh":"“Laudare”是拉丁语动词，意思是“赞美、称赞”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to praise; to commend someone or something.","zh":"（拉丁语）赞美；称赞；褒奖（某人或某事）。"},"examples":[{"en":"In Latin class we learned that “laudare” means “to praise.”","zh":"在拉丁语课上我们学到“laudare”的意思是“赞美”。"},{"en":"The phrase “Deum laudare” means “to praise God.”","zh":"短语“Deum laudare”意思是“赞美上帝”。"}]}],"synonyms":["praise","commend","extol"],"phonetic":"/laʊˈdɑːreɪ/","extraExplanation":["“Laudare”是拉丁动词laudō（我赞美）的不定式形式，常见于宗教文本、格言、学术引用中。","它也是英语词汇的词源之一：laud（称赞）、laudatory（赞美的）、laudation（颂词/赞词）都与之同源。","如果你是在英语语境里看到它，通常是把拉丁语原文保留下来，用来增加庄重、古典或宗教色彩。"]}
{"word":"laudation","summary":{"en":"A formal speech or text giving high praise.","zh":"正式的赞美演讲或颂文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal speech or piece of writing that gives high praise to someone (often at a ceremony).","zh":"（常在仪式上发表的）正式赞美演讲；颂词；颂文。"},"examples":[{"en":"The professor delivered a laudation honoring her former mentor at the retirement ceremony.","zh":"这位教授在退休仪式上发表颂词，向她的前导师致敬。"},{"en":"His laudation focused on her courage and years of public service.","zh":"他的颂词重点赞扬了她的勇气和多年公共服务。"}]}],"synonyms":["tribute","encomium","panegyric","praise","commendation"],"phonetic":"/lɔˈdeɪʃən/","extraExplanation":["“Laudation”来自拉丁语词根 laud-，意思是“赞美”。因此它的语气通常比较正式、庄重，常用于典礼、追悼会、颁奖场合等。","与常见的“praise”相比，laudation更像“正式的颂词/致辞”。与“eulogy”相比，laudation不一定用于葬礼；eulogy更常指追悼词，但两者在“高度赞扬”的语气上有重叠。"]}
{"word":"laudations","summary":{"en":"formal words of praise or tribute","zh":"正式的赞美与颂扬之词"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"expressions of strong praise; compliments or tributes (often formal or literary)","zh":"赞美之词；称颂；致敬（常较正式或文学化）"},"examples":[{"en":"The retiring teacher received many laudations from former students.","zh":"这位即将退休的老师收到了许多来自往届学生的赞美与致敬。"},{"en":"Her speech was filled with laudations for the volunteers’ hard work.","zh":"她的演讲充满了对志愿者辛勤付出的称赞。"},{"en":"Despite the laudations, he remained humble about his achievements.","zh":"尽管赞誉不断，他仍对自己的成就保持谦逊。"}]}],"synonyms":["praise","acclaim","tribute","compliments","commendations","kudos","encomiums"],"phonetic":"/lɔˈdeɪʃənz/","extraExplanation":["用法提示：在现代英语里，laudation / laudations 比 praise 更正式，常见于颁奖词、致辞、书评或文学语境；日常口语更常用 praise, compliments。"],"etymology":"源自拉丁语 laudatio（“赞美、颂扬”），来自 laudare（“赞美、称颂”）。英语中多用于较正式语境；“laudations”是其复数形式，强调“多次/多种赞美”。","mnemonic":["联想“劳（laud）+ 大（d）+ 赞”：劳苦功高就该“大赞”。","把 laud- 记成“老德（lǎo dé）”：有“德”就值得被称颂（laud）。"]}
{"word":"laudative","summary":{"en":"Laudative describes language or writing that gives strong praise in a formal way.","zh":"Laudative 用来形容（较正式的）语言或文字中带有强烈赞美之意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Expressing strong praise or admiration; complimentary.","zh":"表示强烈赞美或钦佩的；称赞性的。"},"examples":[{"en":"The review was laudative, calling the film “beautiful and deeply moving.”","zh":"这篇影评充满赞美之词，称这部电影“美丽且深深打动人心”。"},{"en":"She wrote a laudative email to thank the team for their hard work.","zh":"她写了一封称赞性的邮件，感谢团队的辛勤付出。"}]}],"synonyms":["praiseful","complimentary","admiring","approving","eulogistic"],"phonetic":"/ˈlɔdətɪv/","extraExplanation":["“laudative”来自拉丁语词根 laud-，意思是“赞美”（同源词：laud / laudable）。它比常见的 “praising” 更正式，常见于书评、演讲、学术写作或媒体评论等场合。","语气提示：laudative 通常是积极的，但在某些语境里也可能带一点“过度吹捧/偏颇称赞”的暗示，需要看上下文。"]}
{"word":"laudator","summary":{"en":"Laudator means “a person who praises,” usually in formal or literary English.","zh":"Laudator 指“赞美、颂扬他人的人”，多用于正式或文学化英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who gives praise; a praiser (often in formal, academic, or literary contexts).","zh":"赞美者；颂扬者（常见于较正式、学术或文学语境）。"},"examples":[{"en":"In the preface, the author thanks both critics and laudators who supported the book.","zh":"在序言里，作者感谢批评者，也感谢支持这本书的赞美者。"},{"en":"She was a loyal laudator of the team, praising their effort even after losses.","zh":"她一直是球队忠实的赞美者，即使输球也称赞他们的努力。"}]}],"synonyms":["praiser","admirer","supporter","eulogist","panegyrist"],"phonetic":"/ˈlɔdətər/","extraExplanation":["“laudator”源自拉丁语“laudare”（赞美）相关词形，在现代英语里不算常用，常见于较“书面/学术/修辞”的表达。更日常的说法通常用“praiser”“supporter”“admirer”。","在古典修辞与公共演说传统中，类似“laudator”的角色常指负责公开称颂某人功绩的人；在现代也可用于较正式的“颂词/致敬”语境。"]}
{"word":"laudatorily","summary":{"en":"“Laudatorily” means “in a praising way,” used in formal writing or speech.","zh":"“laudatorily”意为“以赞美的方式”，多用于较正式的书面或演讲语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a praising or highly approving way.","zh":"以赞美的方式；（用）高度称赞地。"},"examples":[{"en":"The reviewer wrote laudatorily about the actor’s performance.","zh":"影评人用赞美的语气写到了那位演员的表演。"},{"en":"She spoke laudatorily of her mentor’s patience and kindness.","zh":"她称赞了导师的耐心与善良。"}]}],"synonyms":["praisefully","admiringly","approvingly","complimentarily"],"phonetic":"/ˌlɔdəˈtɔrəli/","extraExplanation":["“laudatorily”来自拉丁语词根 laud-，意思是“称赞”。常见相关词：laud（v. 称赞）、laudable（adj. 值得称赞的）、laudatory（adj. 赞美的；颂扬的）。","语体提示：这个词偏正式、书面语，常见于评论、致辞、学术写作。日常口语里更常用：praise (someone) highly / speak highly of / admiringly。"]}
{"word":"laudators","summary":{"en":"“Laudators” means people who praise, and in historical Roman contexts it can mean character witnesses who speak in someone’s favor.","zh":"“Laudators”指赞美者；在古罗马历史语境中也可指在法庭上为某人品行作正面陈述的“品格证人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who praise someone or something; praisers.","zh":"赞美者；称赞某人或某事的人。"},"examples":[{"en":"The scientist had many laudators after her discovery changed modern medicine.","zh":"这位科学家的发现改变了现代医学之后，有很多人为她称赞。"},{"en":"Every artist needs honest feedback, not just laudators.","zh":"每位艺术家都需要真诚的反馈，而不只是称赞者。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) in ancient Rome, people who appeared in court to speak in praise of someone’s character (character witnesses).","zh":"（历史用法）古罗马法庭上为某人的品行作正面陈述的人（类似“品格证人”）。"},"examples":[{"en":"In the trial, the defendant brought several laudators to speak about his good reputation.","zh":"在审判中，被告带来了几位品格证人（laudators）来谈他的好名声。"},{"en":"Roman writers mention laudators as part of public legal life.","zh":"罗马作家提到过 laudators，说明他们是公共法律生活的一部分。"}]}],"synonyms":["praisers","admirers","supporters","cheerleaders","eulogists"],"phonetic":"/ˈlɔːdeɪtɚz/","extraExplanation":["“laudator(s)”源自拉丁语 laudare（“赞美”）。英语里更常见的是动词 laud（称赞）或名词 praise/compliment；laudator 属于较少见、偏书面或历史语境的词。","在一些关于古罗马法律与修辞的英文材料中，会用拉丁复数形式 laudatores；现代英语写作中也可能直接用英文化复数 laudators。"]}
{"word":"laudatory","summary":{"en":"Laudatory means expressing praise or admiration, often in formal writing.","zh":"Laudatory 指“表达赞美/称颂的”，多用于较正式的书面语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Expressing praise; showing strong approval.","zh":"表示赞扬的；高度称赞的。"},"examples":[{"en":"The reviews were laudatory, calling the film “deeply moving.”","zh":"影评充满赞美，称这部电影“非常感人”。"},{"en":"She received a laudatory letter from her supervisor for her work.","zh":"她因工作表现收到主管的表扬信。"}]}],"synonyms":["praiseful","complimentary","admiring","approving","eulogistic"],"phonetic":"/ˈlɔdəˌtɔri/","extraExplanation":["“Laudatory”语气偏正式，常见于书面语（评论、表彰、公告、推荐信）。日常口语里更常用“praising”“complimentary”“positive”。","词根来自拉丁语“laudare”（赞美），同源词包括“laud”（v./n. 赞美）与“laudable”（adj. 值得称赞的）。注意区分：laudatory = 表达赞美；laudable = 值得被赞美。"]}
{"word":"laude","summary":{"en":"“Laude” is mainly used in Latin honor phrases like “cum laude,” meaning graduating “with honors/praise.”","zh":"“laude”主要用于如“cum laude”等拉丁语荣誉短语中，表示“以荣誉/赞誉（荣誉毕业）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Mostly seen in academic Latin phrases) “Laude” means “with praise/honor,” used to indicate graduating with honors (e.g., cum laude, magna cum laude, summa cum laude).","zh":"（多见于学术拉丁语短语）“laude”意为“以赞誉/荣誉”，常用于表示“荣誉毕业”（如 cum laude、magna cum laude、summa cum laude）。"},"examples":[{"en":"She graduated cum laude from UCLA.","zh":"她以 cum laude（荣誉）从加州大学洛杉矶分校毕业。"},{"en":"His diploma says “magna cum laude.”","zh":"他的文凭上写着“magna cum laude（高等荣誉）”。"},{"en":"Summa cum laude is the highest level of academic honors in many schools.","zh":"在许多学校里，summa cum laude 是最高等级的学术荣誉。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/technical) Latin form related to “praise”; not commonly used as a standalone English word outside set phrases.","zh":"（少见/偏专门）与“赞美”相关的拉丁语形式；除固定短语外，英语里几乎不单独使用。"},"examples":[{"en":"In English writing, “laude” usually appears only in phrases like “cum laude.”","zh":"在英文写作中，“laude”通常只出现在“cum laude”等固定短语里。"}]}],"synonyms":["honors","with honors","distinction"],"phonetic":"ˈlaʊ.deɪ","extraExplanation":["你输入的“laude”很可能是想查“laud”（动词，意为“称赞/赞美”）。例如：People lauded her bravery.（人们称赞她的勇敢。）","“cum laude / magna cum laude / summa cum laude”来自拉丁语：cum=“with（与）”，laude=“praise（赞誉）”。不同学校对对应的绩点或排名标准不完全一致。"]}
{"word":"lauded","summary":{"en":"“Lauded” means “highly praised,” and it is also the past form of “laud” (to praise publicly and strongly).","zh":"“lauded”意为“备受称赞的”，也可作动词“laud”的过去式/过去分词，表示公开而强烈地赞美。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"praised highly; publicly admired","zh":"被高度赞扬的；备受称赞的"},"examples":[{"en":"The film was widely lauded by critics for its storytelling.","zh":"这部电影因其叙事而受到影评人的广泛称赞。"},{"en":"She is a lauded scientist whose work has saved many lives.","zh":"她是一位备受赞誉的科学家，她的研究拯救了许多生命。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “laud”: to praise someone or something strongly, often in public","zh":"“laud”的过去式/过去分词：强烈地（常公开地）赞美某人或某事"},"examples":[{"en":"The mayor lauded the volunteers for their hard work.","zh":"市长称赞志愿者们的辛勤付出。"},{"en":"Her teacher has lauded her progress this semester.","zh":"她的老师称赞了她这学期的进步。"}]}],"synonyms":["praised","acclaimed","celebrated","commended","extolled"],"phonetic":"/ˈlɔdɪd/","extraExplanation":["“laud”是比较正式的用词，常见于新闻、颁奖词、书评等语境，语气比“praise”更郑重、更书面。","常见搭配：be lauded for…（因……而受赞誉）；laud someone as…（称赞某人为……）。"]}
{"word":"lauder","summary":{"en":"Lauder is most commonly a surname (e.g., Estée Lauder) or a Scottish place name; rarely, it can mean “a person who praises.”","zh":"Lauder最常见作姓氏（如雅诗兰黛）或苏格兰地名；少见情况下可指“赞美者/称颂者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) A person who praises someone or something; someone who lauds.","zh":"（罕见/旧式）赞美者；称颂的人（指“赞美/颂扬”的人）。"},"examples":[{"en":"In old writings, he is described as a constant lauder of the king.","zh":"在一些旧文本中，他被描述为国王的长期颂扬者。"},{"en":"She wasn’t a lauder of luxury; she preferred simple living.","zh":"她并不是奢华的赞美者；她更喜欢简朴的生活。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname), especially known from the cosmetics brand Estée Lauder.","zh":"姓氏（常见于品牌名中，如雅诗兰黛 Estée Lauder）。"},"examples":[{"en":"She worked for Lauder for three years before moving to another company.","zh":"她在雅诗兰黛工作了三年，然后去了另一家公司。"},{"en":"Estée Lauder is a well-known name in beauty and skincare.","zh":"雅诗兰黛在美妆和护肤领域是个知名名字。"}]},{"partOfSpeech":"other","definition":{"en":"A place name in Scotland (the town of Lauder, in the Scottish Borders).","zh":"苏格兰地名：劳德（Lauder），位于苏格兰边区（Scottish Borders）的一个小镇。"},"examples":[{"en":"They stopped in Lauder while traveling through the Scottish Borders.","zh":"他们穿行苏格兰边区时在劳德停留了一下。"}]}],"synonyms":["praiser","admirer","supporter"],"phonetic":"/ˈlɔdɚ/","extraExplanation":["“Lauder”在现代英语里最常见的是专有名词（姓氏或地名）。如果你想表达“更吵/更大声”，正确拼写通常是“louder”。","作为普通名词“lauder（赞美者）”来源于动词“laud（赞美、称颂）”，但在当代日常英语中非常少见，更常用“praiser / admirer”。"]}
{"word":"lauderdale","summary":{"en":"Lauderdale is a proper name, most commonly seen in place names—especially Fort Lauderdale in Florida.","zh":"Lauderdale 是专有名词，最常见于地名，尤其是佛罗里达州的 Fort Lauderdale（劳德代尔堡）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used mainly for places (especially in the U.S.), most commonly referring to Fort Lauderdale, a city on the Atlantic coast of Florida","zh":"一个专有名词，主要用于地名（尤其在美国）；最常见指佛罗里达州大西洋沿岸城市“劳德代尔堡（Fort Lauderdale）”"},"examples":[{"en":"We’re flying into Fort Lauderdale and driving to Miami.","zh":"我们飞到劳德代尔堡，然后开车去迈阿密。"},{"en":"Lauderdale is often used in place names like Lauderdale County.","zh":"Lauderdale 常见于地名中，比如“劳德代尔县（Lauderdale County）”。"}]}],"synonyms":["Fort Lauderdale (common use)"],"phonetic":"/ˈlɔdərˌdeɪl/","extraExplanation":["“Lauderdale”最初来自苏格兰的头衔与地名（Lauderdale 指苏格兰边区的一个山谷地区）。美国的 Fort Lauderdale 以海军军官 William Lauderdale 命名，因此很多美国地名里也会出现 Lauderdale。","在英文里它通常作为专有名词使用（首字母大写），单独写“Lauderdale”时往往需要结合上下文判断是指 Fort Lauderdale、某个县名，还是姓氏/头衔。"]}
{"word":"lauders","summary":{"en":"“Lauders” usually means the plural of “lauder” (people who praise), and it can also refer to the whisky brand “Lauder’s.”","zh":"“lauders”通常是“lauder”（赞美者）的复数；也可能指威士忌品牌“Lauder’s”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “lauder”: people who praise someone or something.","zh":"“lauder”的复数：指赞美者、称颂者。"},"examples":[{"en":"Her lauders said she was the most talented student in the class.","zh":"称赞她的人说她是班里最有才华的学生。"},{"en":"The singer’s loudest lauders posted supportive comments online.","zh":"那位歌手最热情的赞美者在网上留言支持。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper name) “Lauder’s”: a Scotch whisky brand; sometimes written as Lauders in casual text.","zh":"（专有名词）“Lauder’s”：一个苏格兰威士忌品牌；在非正式文本中有时会写成Lauders。"},"examples":[{"en":"He bought a bottle of Lauder’s whisky as a gift.","zh":"他买了一瓶Lauder’s威士忌当礼物。"}]}],"synonyms":["praisers","admirers","supporters","champions"],"phonetic":"ˈlɔdər","extraExplanation":["“lauders”在日常英语里不算常见；更常见的是动词“to laud”（称赞）以及第三人称单数“lauds”（他/她称赞）。如果你本来想写“lauds”，拼写少了一个字母。","也有人把“lauders”误写成“loaders”（装载者/加载器）或“loudest”（最响的/最大声的）。需要的话我可以根据你的句子帮你判断正确词。"]}
{"word":"laudes","summary":{"en":"Laudes most commonly refers to “Lauds,” the Christian morning prayer; more broadly (literary Latin), it can mean praises or hymns of praise.","zh":"Laudes 最常见指基督宗教的“晨祷礼（Lauds）”；更广义（文学/拉丁语用法）可指“赞美、颂词、赞歌”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Christian liturgy) The morning prayer service in the traditional daily cycle of church prayers (also called “Lauds”).","zh":"（基督宗教礼仪）传统“日课”（每日祈祷时辰）中的晨祷礼（也常写作 Lauds）。"},"examples":[{"en":"The monastery gathers for laudes at dawn.","zh":"修道院在黎明时分集合进行晨祷（laudes）。"},{"en":"In some prayer books, laudes is listed among the daily hours.","zh":"在一些祈祷书中，laudes 被列为每日祈祷时辰之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary, from Latin) Praises; songs or words of praise.","zh":"（文学用语，源自拉丁语）赞美；颂词；赞歌。"},"examples":[{"en":"The poet wrote laudes to honor the heroes of the city.","zh":"诗人为歌颂这座城市的英雄而写下赞歌（laudes）。"},{"en":"They offered laudes to celebrate the leader’s return.","zh":"他们献上颂词（laudes）来庆祝领袖归来。"}]}],"synonyms":["Lauds","morning prayer","praise","hymns of praise","encomiums"],"phonetic":"/lɔdz/","extraExplanation":["“Laudes/Lauds”与基督宗教的“日课（canonical hours）”有关：这套固定时刻的祈祷传统包括晨祷、晚祷等。英文更常见的写法是 Lauds（复数形式），但在拉丁文或带拉丁色彩的语境里也可能见到 laudes。","发音方面，英语礼仪语境中常把 Lauds 读作 /lɔdz/（类似“lodz”）；若在拉丁文课堂或更“拉丁化”的读法里，发音可能更接近“LOW-dess”。"]}
{"word":"laudian","summary":{"en":"Laudian means connected to Archbishop William Laud or to his High-Church style reforms; it can also mean a supporter of those ideas.","zh":"Laudian 指与威廉·劳德及其偏“高教会”礼仪与权威取向的改革有关；也可指其支持者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Archbishop William Laud (1573–1645) or to his policies in the Church of England, especially a strong emphasis on formal worship and church authority.","zh":"与英国坎特伯雷大主教威廉·劳德（1573–1645）或其在英格兰教会的政策有关的；尤指强调礼仪、教会权威与“高教会”风格的。"},"examples":[{"en":"Some historians describe these reforms as Laudian because they promoted a more ceremonial style of worship.","zh":"一些历史学家把这些改革称为“劳德式（Laudian）”，因为它们推动了更具仪式感的礼拜风格。"},{"en":"The parish adopted Laudian practices, including stricter rules for church services.","zh":"该教区采用了劳德式做法，包括对礼拜程序更严格的规定。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports or follows Archbishop Laud’s religious ideas; a supporter of Laudian church policies.","zh":"劳德派人士；支持或追随劳德宗教理念与教会政策的人。"},"examples":[{"en":"In the debates of the period, Puritans often criticized Laud and the Laudians.","zh":"在当时的争论中，清教徒常常批评劳德及其追随者（Laudians）。"},{"en":"He was labeled a Laudian by opponents who disliked his views on church order.","zh":"反对者因不喜欢他关于教会秩序的观点而给他贴上“劳德派（Laudian）”的标签。"}]}],"synonyms":["High-Church","Anglican (context-dependent)","ritualist (approx.)"],"phonetic":"/ˈlɔdiən/","extraExplanation":["“Laudian”主要用于英国17世纪宗教与政治史语境，常与“Puritan（清教徒）”形成对比。它通常指更强调礼仪庄严、主教制度与教会统一的取向。","劳德在查理一世时期影响很大；他推行的一些措施引发强烈反弹，相关冲突也与英国内战前的紧张局势有关。"]}
{"word":"Laudianism","summary":{"en":"A High‑Church Anglican movement linked to William Laud, stressing authority and formal ritual.","zh":"与威廉·劳德相关的高教会倾向，强调教会权威与正式礼仪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A 17th‑century movement within the Church of England associated with Archbishop William Laud, emphasizing church authority, formal liturgy, and the importance of ritual and sacraments, often described as ‘High Church.’","zh":"英格兰教会（圣公会）17世纪与坎特伯雷大主教威廉·劳德（William Laud）相关的宗教运动，强调教会权威、正式礼仪，以及仪式与圣礼的重要性，常被视为“高教会”取向。"},"examples":[{"en":"Some Puritans strongly opposed Laudianism because they saw it as too close to Catholic practice.","zh":"一些清教徒强烈反对劳德派思想，因为他们认为它过于接近天主教的做法。"},{"en":"Laudianism influenced how certain Anglican churches shaped their worship and church decoration.","zh":"劳德派思想影响了某些圣公会教堂的崇拜方式与教堂装饰风格。"}]}],"synonyms":["High Church Anglicanism","Anglo-Catholicism"],"phonetic":"/ˈlɔːdiəˌnɪzəm/","extraExplanation":["语境提示：它常出现在英国宗教史、清教徒与国教冲突、以及英国内战前后政治—宗教关系的讨论中。该词在当时多带争议色彩，取决于说话者立场：支持者可能视为“重视秩序与圣礼”，反对者可能视为“过度礼仪化”或“接近罗马天主教”。"],"etymology":"来自 William Laud（威廉·劳德）+ -ism（“……主义/思想体系”）。该词用于指称与劳德相关的教会政策与礼仪取向，尤其在17世纪英国内战前后的宗教争议语境中常见。","mnemonic":["把它拆成“Laud（劳德）+ -ism（主义）”，记成“劳德的那一套思想/政策”。","联想“loud（大声的）”→“仪式很隆重、很‘显眼’”，帮助记住它与正式礼仪、仪式强调有关（发音不同，但便于记忆）。"]}
{"word":"laudianism","summary":{"en":"Laudianism is a 17th‑century Anglican “high church” movement linked to William Laud, favoring formal ritual, church authority, and traditional worship.","zh":"劳德主义是与威廉·劳德相关的17世纪英国国教“高教会”倾向，强调更正式的礼仪、教会权威与传统崇拜形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A religious and political tendency in the Church of England linked to Archbishop William Laud (17th century), emphasizing “high church” worship—formal ceremony, church authority, and traditional rituals.","zh":"“劳德主义”（与17世纪坎特伯雷大主教威廉·劳德相关的宗教与政治倾向）：强调英国国教的“高教会”礼拜风格，如更正式的仪式、教会权威与传统礼仪。"},"examples":[{"en":"Some Puritans strongly opposed Laudianism because they saw it as too close to Catholic practice.","zh":"一些清教徒强烈反对劳德主义，因为他们认为它过于接近天主教的做法。"},{"en":"Historians often discuss Laudianism when explaining the religious tensions before the English Civil War.","zh":"历史学家在解释英国内战前的宗教紧张局势时，常会讨论劳德主义。"}]}],"synonyms":["high church Anglicanism","Laudian theology","ritualism (context-dependent)"],"phonetic":"ˈlɔdiəˌnɪzəm","extraExplanation":["“Laudianism”来自 William Laud（威廉·劳德，1573–1645）的姓氏。他在查理一世时期推动礼拜秩序与教会纪律的强化，主张更庄严的仪式与主教制度，因此常被反对者（尤其清教徒）视为“走向天主教化”。","在英语学术写作中，这个词多用于历史与宗教研究语境（如“英国内战前的宗教政策”“国教内部的高教会倾向”）。日常英语里很少用到。"]}
{"word":"laudification","summary":{"en":"Laudification means the act of praising (a rare, formal word).","zh":"Laudification 指“赞美、称颂的行为”（罕见且偏正式的用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of praising someone or something; the giving of high approval or compliments.","zh":"（罕见）赞美、称颂的行为；给予高度肯定或称赞。"},"examples":[{"en":"The award ceremony turned into a long laudification of the director’s achievements.","zh":"颁奖典礼变成了对导演成就的长篇称颂。"},{"en":"In his speech, he avoided loud laudification and focused on teamwork.","zh":"在演讲中，他避免过度吹捧，而是强调团队合作。"}]}],"synonyms":["praise","commendation","acclaim","eulogy","encomium"],"phonetic":"/ˌlɔdɪfɪˈkeɪʃən/","extraExplanation":["“laudification”在现代英语里非常少见，更常用的词是“praise”“commendation”“acclaim”或“eulogy”（尤指悼词/颂词）。","它来自动词“laudify”（称赞）和拉丁语词根“laud-”（赞美）。在正式或文学风格的语境中可能出现，但日常写作通常不推荐使用。"]}
{"word":"lauding","summary":{"en":"“Lauding” means praising someone or something highly, often in public or formal writing.","zh":"“Lauding”指对某人或某事进行高度（常为公开或正式的）赞扬。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Praising someone or something strongly and publicly; giving high compliments.","zh":"（公开而热烈地）赞扬、称赞（某人或某事）；高度评价。"},"examples":[{"en":"The critics were lauding the film for its honest storytelling.","zh":"影评人正在称赞这部电影叙事真诚。"},{"en":"She was lauded as a leader who stayed calm in a crisis.","zh":"她被赞誉为一位在危机中保持冷静的领导者。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of praising or giving high acclaim (often used in more formal writing).","zh":"赞美；颂扬（常用于较正式的书面语）。"},"examples":[{"en":"The article was full of lauding for the scientist’s achievements.","zh":"这篇文章充满了对这位科学家成就的颂扬。"}]}],"synonyms":["praising","commending","applauding","acclaiming","extolling"],"phonetic":"/ˈlɔdɪŋ/","extraExplanation":["“laud”来自拉丁语 laudare，意为“赞美”。“lauding”常见于新闻、评论和正式写作里，比日常的“praise”更庄重、更书面。","常见搭配：laud someone for something（因某事称赞某人）；be lauded as…（被誉为……）。","近义词语气差别：praise（最常用、中性）；commend（正式、强调认可）；acclaim（公众高度赞誉，常见于媒体）。"]}
{"word":"laudism","summary":{"en":"Laudism is a (often critical) term for the 17th‑century Anglican movement linked to William Laud, favoring formal, high‑church worship and strong church authority.","zh":"劳德主义是（常带批评意味的）术语，指17世纪与威廉·劳德相关的英国国教倾向，强调庄严礼仪的高教会风格与教会权威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a religious and political movement in the Church of England associated with Archbishop William Laud (17th century), emphasizing formal worship, church hierarchy, and “high-church” practices; often used critically by opponents","zh":"（常作贬义）“劳德主义/拉德主义”：与17世纪坎特伯雷大主教威廉·劳德（William Laud）相关的英国国教宗教与政治倾向，强调礼仪庄严、教会等级制度与高教会（High Church）传统"},"examples":[{"en":"Some Puritans attacked Laudism as a step back toward Catholic-style ritual.","zh":"一些清教徒抨击劳德主义，认为它是在倒退到天主教式的仪式化。"},{"en":"Laudism influenced how certain Anglican churches designed their services and church interiors.","zh":"劳德主义影响了某些圣公会教堂的礼拜形式和教堂内部布置。"}]}],"synonyms":["Laudianism","high-churchism (roughly)"],"phonetic":"/ˈlɔːdɪzəm/","extraExplanation":["“Laudism”在现代英语中相对少见，更常见的拼写是“Laudianism”（劳德主义/拉德主义）。两者通常指同一历史现象。","历史背景：威廉·劳德（1573–1645）主张更统一、更庄严的礼仪与教会治理；这些改革在当时引发强烈争议，并与英国内战前后的宗教冲突有关。","语用提示：该词在史学或宗教史语境中出现较多，且常带有批评色彩，尤其在清教徒（Puritans）或反对高教会立场的文字里。"]}
{"word":"laudist","summary":{"en":"A laudist is someone who praises enthusiastically; historically, it can also mean a supporter of Archbishop William Laud.","zh":"laudist 指热情的赞美者；在历史语境中也可指支持17世纪坎特伯雷大主教威廉·劳德及其宗教政策的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who praises someone or something strongly (often in a public or enthusiastic way)","zh":"赞美者；颂扬者（常指公开或热情地称赞他人或事物的人）"},"examples":[{"en":"The film has its critics, but it also has plenty of laudists online.","zh":"这部电影有批评者，但网上也有很多颂扬者。"},{"en":"She isn’t a laudist by nature, so her compliment meant a lot.","zh":"她天性不是那种爱夸人的人，所以她的称赞很有分量。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a supporter of Archbishop William Laud or his religious policies in 17th‑century England","zh":"（历史）劳德派支持者；支持17世纪英格兰坎特伯雷大主教威廉·劳德或其宗教政策的人"},"examples":[{"en":"In the pamphlet wars, Laudists and Puritans attacked each other fiercely.","zh":"在小册子论战中，劳德派与清教徒彼此猛烈抨击。"},{"en":"Some writers labeled him a Laudist because he favored church ceremony.","zh":"有些作者因为他偏好教会礼仪，就给他贴上“劳德派”的标签。"}]}],"synonyms":["praiser","admirer","supporter","panegyrist","booster"],"phonetic":"/ˈlɔdɪst/","extraExplanation":["“Laudist”来自动词 laud（赞美、称颂）+ -ist（表示“……的人/拥护者”）。日常英语中更常见的表达是 praiser / admirer / supporter；“laudist”相对少见，带一点书面或特定语境色彩。","历史义项与 William Laud（1573–1645）有关。他主张加强英国国教的礼仪与主教制度，因此在宗教与政治冲突中常与清教徒阵营对立。阅读历史文本时，“Laudist”可能带有立场标签的意味。"]}
{"word":"Lauds","summary":{"en":"expressions of strong praise; or “praises” (as a verb form).","zh":"赞美之词；或作动词表示“称赞”（第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Praises; expressions of approval or admiration.","zh":"赞美；称赞的话语（复数）。"},"examples":[{"en":"The team received many lauds after the successful launch.","zh":"发布成功后，这个团队收到了很多赞美。"},{"en":"Her performance earned lauds from critics and audiences alike.","zh":"她的表演赢得了评论家和观众一致的称赞。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “laud”: to praise someone or something highly.","zh":"“laud”的第三人称单数：高度赞扬；称颂。"},"examples":[{"en":"He lauds her leadership in every meeting.","zh":"他在每次会议上都高度称赞她的领导力。"},{"en":"The article lauds the city’s efforts to reduce pollution.","zh":"这篇文章称颂了该市减少污染的努力。"}]}],"synonyms":["praise","acclaim","commendation","kudos","tributes","compliments","applaud","extol","commend","hail"],"phonetic":"/lɔdz/","extraExplanation":["名词 lauds 常见于较正式的书面语（例如新闻、评论、颁奖词），日常口语里更常说 praise/compliments。","动词 laud 也偏正式，语气比 praise 更“郑重、官方”，常用于文章、演讲或评价中。"],"etymology":"来自拉丁语 laudare（“赞美、称颂”），与 laus（“赞美”）同源，后来进入英语成为 laud；lauds 可作名词复数或动词第三人称单数。","mnemonic":["联想中文“劳德/劳兹”（谐音）= 辛苦“劳”了也值得被“赞”（laud）。","记词根：laus=赞美；看到 laud 就想到“劳斯莱斯（Rolls-Royce）很容易让人称赞”。"]}
{"word":"lauds","summary":{"en":"“Lauds” most commonly means “praises” (he/she/it lauds). It can also mean “praises/compliments” as a plural noun, and in religious contexts “Lauds” refers to a morning prayer service.","zh":"“Lauds”最常见是动词第三人称单数，意为“称赞/赞扬”。也可作名词复数指“赞美之词”。在宗教语境中，大写Lauds还可指“晨祷”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) praises someone or something strongly; gives public approval or admiration.","zh":"（动词第三人称单数）高度赞扬；称颂；公开表示认可或钦佩。"},"examples":[{"en":"The coach lauds her players for their teamwork.","zh":"教练称赞她的队员们很有团队合作精神。"},{"en":"The article lauds the hospital’s quick response during the emergency.","zh":"这篇文章高度赞扬了医院在紧急情况下的快速反应。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) expressions of praise; compliments (less common).","zh":"（名词复数）赞美之词；称赞（较少见）。"},"examples":[{"en":"The singer accepted the lauds of the audience with a smile.","zh":"歌手微笑着接受了观众的称赞。"}]}],"synonyms":["praises","commends","applauds","celebrates","extols"],"phonetic":"/lɔdz/","extraExplanation":["在宗教语境中，Lauds（常大写）也可指基督宗教传统中的“晨祷”（canonical hour 之一），是日课祈祷的一部分，通常在清晨进行。这个含义与日常“称赞”不同，常见于教会或礼仪文本。"]}
{"word":"laugh","summary":{"en":"“Laugh” means to show amusement by smiling and making sounds; it can also mean mocking someone (laugh at), and as a noun it means the sound or act of laughing.","zh":"“laugh”表示因开心/好笑而发笑；也可指“嘲笑（laugh at）”；作名词时指“笑、笑声”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To make sounds and show a feeling of amusement or happiness.","zh":"（因好笑或开心而）笑、发笑。"},"examples":[{"en":"The joke was so funny that everyone laughed.","zh":"这个笑话太好笑了，大家都笑了。"},{"en":"She laughed when she saw the puppy rolling over.","zh":"她看到小狗打滚时笑了。"}]},{"partOfSpeech":"vi.","definition":{"en":"To treat someone or something as silly; to mock (often used with “at”).","zh":"嘲笑；把……当作可笑（常与 at 连用）。"},"examples":[{"en":"Don’t laugh at people for making mistakes.","zh":"不要因为别人犯错就嘲笑他们。"},{"en":"Some critics laughed at the idea at first.","zh":"一些评论家一开始嘲笑这个想法。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or sound of laughing; a moment of amusement.","zh":"笑；笑声；令人发笑的时刻。"},"examples":[{"en":"That movie gave me a good laugh.","zh":"那部电影让我好好笑了一场。"},{"en":"Her laugh is loud and warm.","zh":"她的笑声很响亮，也很温暖。"}]}],"synonyms":["giggle","chuckle","smile","mock","ridicule"],"phonetic":"/læf/","extraExplanation":["常见搭配：laugh at（嘲笑/取笑）、laugh with（和……一起笑，强调同乐而非嘲弄）、laugh off（用一笑带过/不当回事，如 laugh off the criticism）。","在文化语境里，laugh at 往往带负面含义；如果想表达友善的“跟着一起笑”，更自然的是 laugh with。"]}
{"word":"laugh-out-loud","summary":{"en":"To laugh audibly; very funny.","zh":"笑出声；非常好笑。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"In a way that makes you laugh audibly (not just silently); used to describe a strong, open laugh.","zh":"大声笑出来（不是在心里偷笑）；形容笑得很明显、很夸张。"},"examples":[{"en":"That scene made me laugh out loud in the theater.","zh":"那个场景让我在电影院里直接笑出声。"},{"en":"I tried not to laugh out loud during the meeting.","zh":"我在会议上努力忍住不笑出声。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely funny; causing people to laugh audibly.","zh":"特别好笑的；让人笑出声的。"},"examples":[{"en":"It’s a laugh-out-loud comedy.","zh":"这是一部笑点很密、让人笑出声的喜剧。"},{"en":"Her story was laugh-out-loud funny.","zh":"她的故事好笑到让人笑出声。"}]}],"synonyms":["burst out laughing","crack up","howl with laughter","roar with laughter","hilarious","side-splitting"],"phonetic":"/ˌlæf aʊt ˈlaʊd/","extraExplanation":["写作上常见两种形式：作副词用一般写作“laugh out loud”；作形容词修饰名词时常加连字符“laugh-out-loud”（如 laugh-out-loud moment）。","注意：网络里的“LOL”不一定真的在大笑，有时只是缓和语气；但“laugh out loud”通常更强调“真的笑出声”。"],"etymology":"来自动词短语“laugh out loud”（直译“笑到大声出来”）。在网络语境中也常写作缩写“LOL”，早期聊天/短信里用来表示“我笑出声了”。后来“LOL”有时也会被当作语气词，含义可能弱化为“觉得好笑/表示友好”。","mnemonic":["按字面拆开记：laugh（笑）+ out（出来）+ loud（大声）→“笑出来而且很大声”。","联想网络缩写 LOL：看到好笑的内容就“lol”，对应真实动作就是“laugh out loud”。"]}
{"word":"laughability","summary":{"en":"Laughability means the degree to which something is funny or ridiculous.","zh":"Laughability 指某事物“有多可笑/有多好笑”的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being laughable; how easily something makes people laugh or seems ridiculous","zh":"可笑性；引人发笑或显得荒唐的程度"},"examples":[{"en":"The movie’s laughability depends on whether you enjoy silly humor.","zh":"这部电影的可笑性取决于你是否喜欢傻气的幽默。"},{"en":"He tried to sound serious, but the laughability of his excuse ruined it.","zh":"他想表现得很认真，但借口太可笑，结果全毁了。"},{"en":"The report questioned the laughability of the claim, calling it unrealistic.","zh":"报告质疑这一说法的可信度，认为它可笑且不现实。"}]}],"synonyms":["ridiculousness","absurdity","comic value","humor","funniness"],"phonetic":"/ˌlæfəˈbɪləti/","extraExplanation":["“Laughability”在日常英语里不算常用，更常见的替代说法有“how funny it is（有多好笑）”“ridiculousness（荒谬/可笑程度）”“comic value（喜剧效果）”。","它既可以指“真的好笑”（喜剧效果），也可以偏负面地指“令人觉得荒唐可笑”。具体褒贬通常由上下文决定。"]}
{"word":"laughable","summary":{"en":"“Laughable” usually means ridiculous or not serious enough to be respected; sometimes it can mean simply amusing.","zh":"“Laughable”通常指“荒唐可笑、令人不屑一顾”，有时也可指“逗趣的”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"So bad, silly, or unreasonable that it makes people laugh (often in a critical way).","zh":"（常带批评）荒唐可笑的；糟糕到让人发笑的。"},"examples":[{"en":"His excuse for being late was laughable.","zh":"他迟到的借口荒唐可笑。"},{"en":"The plan sounded good at first, but the budget was laughable.","zh":"这个计划起初听起来不错，但预算少得可笑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to make people laugh; amusing (less common; usually replaced by “funny”).","zh":"能逗人发笑的；滑稽的（较少用，常用 funny 代替）。"},"examples":[{"en":"The movie has a few laughable moments.","zh":"这部电影有几个挺逗的片段。"}]}],"synonyms":["ridiculous","absurd","preposterous","ludicrous","comical"],"phonetic":"/ˈlæfəbəl/","extraExplanation":["“Laughable”常带有“嘲讽/不严肃”的语气，表示某事不值得认真对待：a laughable claim（可笑的说法）。如果你只是想表达“很好笑”，更自然的是用 funny / hilarious。","构词上是 laugh（笑）+ -able（“能够……的/值得……的”），字面意思是“让人想笑的”。"]}
{"word":"laughableness","summary":{"en":"“Laughableness” means the quality of being laughable—something so silly or absurd that it invites laughter.","zh":"“laughableness”指“可笑性”，即因愚蠢或荒谬而让人发笑的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being laughable; the state of seeming silly or deserving laughter (often because something is ridiculous rather than truly funny)","zh":"可笑性；显得荒唐或招人发笑的性质（常指“荒谬可笑”，不一定是真正有趣）"},"examples":[{"en":"The proposal’s laughableness became obvious once the costs were explained.","zh":"一旦把成本说明白，这个提案的可笑性就显露出来了。"},{"en":"He tried to defend the plan, but its laughableness made the room go quiet.","zh":"他试图为这个计划辩护，但它的可笑性让全场安静下来。"},{"en":"In her essay, she points out the laughableness of judging people by appearances.","zh":"在文章里，她指出以貌取人的可笑之处。"}]}],"synonyms":["ridiculousness","absurdity","silliness"],"phonetic":"/ˈlæfəbəlnəs/","extraExplanation":["“laughableness”由 laughable（可笑的）+ -ness（把形容词变成名词的后缀）构成，意思就是“可笑的程度/性质”。","这个词在现代英语里比较少见；更常用的表达是 “the fact that something is laughable” 或直接用名词 “ridiculousness / absurdity”。在正式写作中常用 “absurdity”，口语里常用 “ridiculousness”。","语气提示：laughable 往往带有批评或轻蔑色彩，表示“荒唐得让人发笑”，并不等于 “funny（有趣好笑）”。"]}
{"word":"laughably","summary":{"en":"Laughably means “in a way that seems absurdly funny or not serious,” often used to criticize something as ridiculously bad or unrealistic.","zh":"laughably 表示“荒唐得可笑、难以当真地”，常用来批评某事差得离谱或不现实。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is so bad, weak, or wrong that it seems funny or impossible to take seriously.","zh":"以荒唐可笑的方式；差到让人觉得好笑、难以当真。"},"examples":[{"en":"The plan was laughably unrealistic.","zh":"这个计划荒唐得可笑，根本不现实。"},{"en":"His excuse was laughably weak.","zh":"他的借口弱得可笑。"},{"en":"The product is laughably overpriced for what it offers.","zh":"就它提供的东西来说，这个产品贵得离谱、可笑。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that causes laughter; amusingly.","zh":"以引人发笑的方式；滑稽地。"},"examples":[{"en":"She told the story laughably, making everyone relax.","zh":"她把故事讲得很逗，让大家都放松下来。"},{"en":"The characters are laughably awkward at first.","zh":"这些角色一开始尴尬得很滑稽。"}]}],"synonyms":["ridiculously","absurdly","comically","pathetically"],"phonetic":"/ˈlæfəbli/","extraExplanation":["“laughably”常带有批评或讽刺语气，尤其在“laughably + 形容词”结构中很常见，例如 laughably small/poor/inept/unprepared，意思是“差得离谱、让人发笑”。","注意语气：它通常不是温和的“好笑”，而更接近“可笑到不值得认真对待”。在正式写作或职场场景里，用它评价人或方案可能显得尖刻。"]}
{"word":"laughed","summary":{"en":"“Laughed” is the past tense/past participle of “laugh,” meaning you smiled or made a sound because something was funny or you felt amused; it can also mean mocking someone (often “laughed at”).","zh":"“laughed”是“laugh”的过去式/过去分词，表示因为好笑或开心而笑；也可表示嘲笑某人（常用“laughed at”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “laugh”: to make sounds (or show behavior) of amusement, happiness, or sometimes disbelief.","zh":"“laugh”的过去式和过去分词：发出笑声或表现出开心、觉得好笑（有时也表示不相信、讽刺）的反应。"},"examples":[{"en":"She laughed at the joke and couldn’t stop smiling.","zh":"她听到那个笑话笑了，怎么也停不住微笑。"},{"en":"We laughed together after the long meeting ended.","zh":"漫长的会议结束后，我们一起笑了。"},{"en":"He laughed when he heard the rumor, because it sounded impossible.","zh":"他听到那个传闻时笑了，因为听起来不可能。"}]},{"partOfSpeech":"v.","definition":{"en":"used to describe a reaction that is unkind or mocking (often with “at”).","zh":"用于描述不友善或嘲笑的反应（常与“at”连用）。"},"examples":[{"en":"They laughed at his accent, which was rude.","zh":"他们嘲笑他的口音，这很无礼。"},{"en":"Don’t laugh at people for making mistakes.","zh":"不要因为别人犯错就嘲笑他们。"}]}],"synonyms":["chuckled","giggled","snickered","laughed at (mocked)"],"phonetic":"/læft/","extraExplanation":["“laughed”是规则动词“laugh”的过去式/过去分词：laugh → laughed。既可用于一般过去时（She laughed. 她笑了），也可用于完成时（She has laughed. 她已经笑过）或被动较少见的结构。","常见搭配：laughed at（嘲笑/笑某人）、laughed with（和……一起笑，语气更友好）、laughed off（对……一笑置之，表示不当回事，如：He laughed off the criticism）。","语感提示：英语里“laugh at”很容易带有“取笑、看不起”的意思；如果想表达友好地一起开心，优先用“laugh with”。"]}
{"word":"laughee","summary":{"en":"“Laughee” is an informal, nonstandard word meaning the person being laughed at (the target of a joke).","zh":"“laughee”是非正式、非标准的说法，指“被人笑/被取笑的人（笑话的对象）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard) A person who is being laughed at; the target of a joke.","zh":"（非正式/非标准用法）被人嘲笑的人；笑话的对象。"},"examples":[{"en":"In that prank, I was the laughee, not the laugher.","zh":"在那个恶作剧里，我是被笑的人，不是笑别人的人。"},{"en":"Don’t make someone the laughee just to entertain the group.","zh":"别为了逗大家开心就把别人变成被嘲笑的对象。"}]}],"synonyms":["butt (of a joke)","target","laughingstock","object of ridicule"],"phonetic":"/ˌlæˈfi/","extraExplanation":["“laughee”不是标准英语单词，更多是仿照“employee / interviewee”这种结构临时造出来的词：动词 + -ee 表示“接受该动作的人”。因此“laughee”直观意思就是“被笑的人”。","更常见、更自然的表达是：the butt of the joke（笑柄/被取笑的人）、the target of ridicule（被嘲讽的对象）、a laughingstock（笑柄）。","如果你想表达“发笑的人”，可以用“laugher”；日常最常用还是直接说“the one who’s laughing / the person who laughed”。"]}
{"word":"laugher","summary":{"en":"A “laugher” is a person who laughs; for “laughter” (the sound/activity of laughing), use “laughter.”","zh":"“laugher”指“笑的人”；表示“笑声/笑这种行为”更常用“laughter”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who laughs, especially in a particular way or in a situation","zh":"笑的人；（尤指在某种场合或以某种方式）发笑者"},"examples":[{"en":"She’s an easy laughER—she finds humor in small things.","zh":"她很容易被逗笑——小事也能让她觉得好笑。"},{"en":"The comedian is great at turning quiet audiences into laughers.","zh":"那位喜剧演员很擅长把安静的观众变成笑个不停的人。"}]}],"synonyms":["one who laughs","giggler","chuckler"],"phonetic":"/ˈlæfɚ/","extraExplanation":["“laugher”是正确的拼写，但日常英语里更常见的是“laughter”（笑声/笑）。如果你想表达“笑声”或“笑这件事”，通常用“laughter”；如果要表达“在笑的人”，才用“laugher”。","词尾“-er”常表示“做某事的人”（如 teacher, runner），所以 laugh + er = laugher（笑的人）。"]}
{"word":"laughers","summary":{"en":"“Laughers” usually means people who are laughing; informally, it can also mean very funny jokes or moments.","zh":"“laughers”通常指笑的人；口语中也可指特别好笑的笑料或桥段（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who laugh; people who are laughing (plural of “laugher”).","zh":"笑的人；正在笑的人（“laugher”的复数）。"},"examples":[{"en":"The comedian looked at the front row and pointed at the loudest laughers.","zh":"喜剧演员看着前排，指了指笑得最响的那些人。"},{"en":"In every class, there are a few laughers who react to every joke.","zh":"每个班里总有几个特别爱笑的人，听到笑话就会有反应。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Jokes, stories, or moments that are very funny (plural of “laugher,” meaning “a very funny thing”).","zh":"（非正式）特别好笑的笑料／段子／场面（“laugher”的复数，指“很搞笑的事物”）。"},"examples":[{"en":"That movie has a few real laughers, especially the restaurant scene.","zh":"那部电影里有几个真是笑点十足的桥段，尤其是餐厅那场戏。"},{"en":"His speech included some laughers to keep the audience relaxed.","zh":"他的演讲穿插了一些笑料，让观众更放松。"}]}],"synonyms":["people laughing","gigglers","chucklers","jokers (context-dependent)","funny bits"],"phonetic":"/ˈlæfərz/","extraExplanation":["“laugher”最常见的用法是“会笑的人／正在笑的人”。但在口语里，a real laugher 也可以指“特别好笑的事（一个大笑点）”。因此 laughers 既可能指“笑的人”，也可能指“笑料（复数）”，需要看上下文。"]}
{"word":"laughful","summary":{"en":"Laughful is a rare adjective meaning “funny/amusing” or “full of laughter.” In modern English, funny/humorous/amusing are much more common.","zh":"laughful 是个罕用形容词，意思是“好笑的/逗乐的”或“充满笑声的”。现代英语中更常用 funny/humorous/amusing 等词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Funny or amusing; likely to make people laugh.","zh":"（罕用）好笑的；逗人发笑的。"},"examples":[{"en":"It’s a laughful story, even though it has a serious message.","zh":"这是个很逗的故事，尽管它传达了严肃的信息。"},{"en":"The comedian told a few laughful jokes to warm up the crowd.","zh":"那位喜剧演员讲了几个好笑的笑话来暖场。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Full of laughter; cheerful and laughing a lot.","zh":"（罕用/较古）充满笑声的；欢笑不断的。"},"examples":[{"en":"The room turned laughful after he broke the awkward silence.","zh":"他打破尴尬的沉默后，房间里充满了笑声。"},{"en":"We spent a laughful evening with old friends.","zh":"我们和老朋友度过了一个欢笑不断的夜晚。"}]}],"synonyms":["funny","humorous","amusing","comical","laughable","hilarious"],"phonetic":"/ˈlæf.fəl/","extraExplanation":["“laughful”在现代英语里非常少见，更常用的表达是“funny”（好笑的）、“humorous”（幽默的）、“amusing”（有趣的）或“laughable”（令人发笑的/可笑的）。在正式写作或口语中，用这些词会更自然。","词形上，“-ful”常表示“充满……的”（如 joyful, hopeful）。因此“laughful”字面意思就是“充满笑的”。但它没有成为常用词，读者有时会觉得它不地道或像是临时造词。"]}
{"word":"laughing","summary":{"en":"“Laughing” can mean laughter (a noun), “smiling/with laughter” (an adjective), or the -ing form of “laugh” used in continuous tenses.","zh":"“laughing”既可表示“笑声”（名词），也可表示“笑着的/带笑意的”（形容词），还可作“laugh”的 -ing 形式用于进行时。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or sound of laughing; laughter","zh":"笑的动作或声音；笑声"},"examples":[{"en":"Her laughing filled the room and made everyone feel relaxed.","zh":"她的笑声充满了房间，让大家都放松下来。"},{"en":"I could hear laughing from the next table.","zh":"我能听到隔壁桌传来的笑声。"}]},{"partOfSpeech":"adj.","definition":{"en":"making the sound or expression of laughter; showing amusement","zh":"正在笑的；发出笑声的；表示觉得好笑的"},"examples":[{"en":"A laughing child ran across the park.","zh":"一个笑着的孩子跑过公园。"},{"en":"He gave me a laughing look, as if it were a joke.","zh":"他带着笑意看了我一眼，好像那是个玩笑。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “laugh,” used in continuous tenses","zh":"“laugh”的现在分词，用于进行时态"},"examples":[{"en":"They are laughing at the funny video.","zh":"他们正在看那个搞笑视频并大笑。"},{"en":"I was laughing so hard that I couldn’t speak.","zh":"我笑得太厉害了，连话都说不出来。"}]}],"synonyms":["laughter","giggling","chuckling","smiling"],"phonetic":"/ˈlæfɪŋ/","extraExplanation":["“laughing”既可以当名词（= laughter），也可以当形容词（“笑着的”），还常见于动词进行时（are laughing）。学习时可以通过句子位置判断：放在冠词/形容词后多是名词（the loud laughing），修饰名词多是形容词（a laughing face），跟在be后+现在分词多是动词（is laughing）。","搭配提醒：laugh at（嘲笑/因……而笑）、laugh with（和……一起笑）、laugh off（用一笑置之来化解尴尬/轻视）。在文化语境里，laugh at someone 往往带有不礼貌或伤人的意味，而 laugh with someone 更强调友好、共享幽默。"]}
{"word":"laughing stock","summary":{"en":"A “laughing stock” is someone or something widely mocked or laughed at.","zh":"“laughing stock”指被大家嘲笑、讥讽的对象（笑柄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that many people laugh at or make fun of; an object of ridicule","zh":"被众人嘲笑的对象；笑柄"},"examples":[{"en":"After his boast failed, he became the laughing stock of the whole class.","zh":"他夸下海口却失败后，成了全班的笑柄。"},{"en":"The company’s spelling mistake on the billboard turned it into a laughing stock online.","zh":"公司在广告牌上的拼写错误让它在网上成了被群嘲的对象。"}]}],"synonyms":["object of ridicule","butt of jokes","target of mockery"],"phonetic":"/ˈlæfɪŋ stɑk/","extraExplanation":["“laughing stock”通常带有负面、羞辱性的语气，表示被公开嘲笑。使用时要注意礼貌与语境。","常见搭配：become the laughing stock of…（成为……的笑柄）；make someone a laughing stock（让某人成为笑柄）。","近义表达：object of ridicule, butt of jokes。相关说法：at someone’s expense（以某人为代价/取笑某人）。"]}
{"word":"laughingly","summary":{"en":"Laughingly means “with laughter” or “in an amused way,” sometimes implying someone is joking or not taking something seriously.","zh":"laughingly 表示“笑着/带着笑意地”，有时也暗示“半开玩笑或不太当真（甚至略带嘲讽）”，需结合语境理解。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you are laughing or amused; with laughter.","zh":"带着笑意地；笑着；以表示觉得好笑或愉快的方式。"},"examples":[{"en":"“You’re kidding,” she said laughingly.","zh":"“你在开玩笑吧？”她笑着说。"},{"en":"He laughingly admitted that he was wrong.","zh":"他笑着承认自己错了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you are not taking something seriously; half-jokingly or mockingly (depending on context).","zh":"以不太当真（半开玩笑或略带嘲讽）的方式（含义取决于语境）。"},"examples":[{"en":"They laughingly dismissed the warning, but later regretted it.","zh":"他们笑着不当回事地把警告打发了，后来却后悔了。"},{"en":"She laughingly called him “a genius,” and he knew she meant it as a joke.","zh":"她笑着叫他“天才”，他知道这只是玩笑话。"}]}],"synonyms":["amusedly","merrily","jokingly","playfully","mockingly"],"phonetic":"/ˈlæfɪŋli/","extraExplanation":["“laughingly”多用于书面叙述或对话描写，常放在动词（said, admitted, replied, remarked等）后面，表示说话时带着笑。","语气既可能是友善轻松的笑，也可能是“笑着不当回事/带点讥讽”的笑；判断关键看上下文（是否在否定、轻视、嘲弄某事）。","在日常口语里，人们更常说“with a laugh / laughing”来表达同样意思；“laughingly”显得更文学、更叙事。"]}
{"word":"laughings","summary":{"en":"“Laughings” means sounds or instances of laughter (plural), but it’s less common than “laughter” or “laughs.”","zh":"“Laughings”指多次/多处的笑声或发笑（复数），但不如“laughter”或“laughs”常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “laughing”: moments or sounds of laughter; instances when people laugh.","zh":"“laughing”的复数：笑声；发笑的时刻（多次/多处的笑）。"},"examples":[{"en":"From the next room, we heard loud laughings and cheering.","zh":"从隔壁房间里，我们听到很大的笑声和欢呼声。"},{"en":"Her speech ended with warm laughings from the audience.","zh":"她的演讲在观众热烈的笑声中结束。"}]}],"synonyms":["laughter","laughs","giggles","chuckles"],"phonetic":"/ˈlæfɪŋz/","extraExplanation":["“laughings”在现代英语里不算常见，更常用的说法是“laughter”（不可数名词，表示“笑/笑声”整体）或“laughs”（可数名词，表示“一阵笑/几声笑”）。\n- 更自然：We heard a lot of laughter.\n- 或：We heard some laughs.\n“laughings”偶尔用于强调“多次、不同人的笑声”，或在较文学/较旧式的表达中出现。"]}
{"word":"laughingstock","summary":{"en":"Laughingstock means someone or something that many people mock or laugh at.","zh":"laughingstock 指“被众人嘲笑/取笑的对象”，也就是“笑柄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that is widely laughed at or mocked; an object of ridicule","zh":"被大家嘲笑、取笑的人或事；笑柄"},"examples":[{"en":"After the rumor spread, he became the laughingstock of the office.","zh":"谣言传开后，他成了办公室里的笑柄。"},{"en":"The team’s careless mistake made them a laughingstock online.","zh":"球队的低级失误让他们在网上成了笑柄。"},{"en":"She feared her presentation would turn her into a laughingstock.","zh":"她担心自己的演讲会让自己变成笑柄。"}]}],"synonyms":["butt (of the joke)","object of ridicule","joke","target of mockery"],"phonetic":"/ˈlæfɪŋˌstɑk/","extraExplanation":["构词提示：laughing + stock。这里的 stock 不是“股票”，而是古义里“被展示/被当作某种对象的人或物”的意思，所以 laughingstock 字面上有“被拿来当作笑的对象”的感觉。","语气与使用：laughingstock 往往带有强烈的负面评价，暗示当事人被公开嘲讽、丢脸。日常更温和的说法可以用 “the butt of the joke”（笑话的对象）或 “a joke”（被当笑话）。"]}
{"word":"laughingstocks","summary":{"en":"“Laughingstocks” means people or things widely mocked or ridiculed—public jokes.","zh":"“laughingstocks”指被广泛嘲笑或讥讽的人或事物，即“笑柄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that many others laugh at, mock, or treat as ridiculous (plural of “laughingstock”).","zh":"被众人嘲笑、讥讽的人或事物；笑柄（“laughingstock”的复数）。"},"examples":[{"en":"After the failed product launch, the company became one of the industry’s laughingstocks.","zh":"产品发布失败后，这家公司成了业内的笑柄之一。"},{"en":"He worried that a mistake on stage would make them laughingstocks at school.","zh":"他担心舞台上的失误会让他们在学校里成笑柄。"}]}],"synonyms":["jokes","objects of ridicule","butts of jokes","targets of mockery"],"phonetic":"/ˈlæfɪŋˌstɑk/","extraExplanation":["“laughingstock”是由“laughing（被嘲笑的）+ stock（旧义：木桩/刑具）”组合而来。过去的“stocks（木枷）”会把人固定在公众场所示众，人们可能围观取笑，因此这个词逐渐引申为“任人嘲笑的对象”。","常见搭配：become a laughingstock（沦为笑柄）；make someone a laughingstock（让某人成为笑柄）。语气偏负面，带有羞辱意味，用于正式或严肃语境时要注意礼貌。"]}
{"word":"laughingthrush","summary":{"en":"an Asian songbird with loud, laughter-like calls","zh":"叫声像笑、主要分布在亚洲的一种鸣禽"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of songbird found mainly in Asia, known for loud, varied calls that can sound like laughter; it belongs to the babbler family (Leiothrichidae).","zh":"一种主要分布在亚洲的鸣禽，以响亮、多变、仿佛“笑声”的叫声而闻名；常归入噪鹛科（Leiothrichidae）。"},"examples":[{"en":"We heard a laughingthrush calling loudly in the bamboo forest.","zh":"我们在竹林里听到噪鹛大声鸣叫。"},{"en":"The laughingthrush is popular with birdwatchers because it is active and vocal.","zh":"噪鹛因活跃又爱叫，深受观鸟者喜爱。"}]}],"synonyms":["babbler","songbird"],"phonetic":"/ˈlæfɪŋˌθrʌʃ/","extraExplanation":["中文里常译作“噪鹛”（如“红嘴相思鸟/白颊噪鹛”等不同物种名会更具体）。英语名里的 thrush 更像是一种“类比式命名”，不代表严格的生物分类。"],"etymology":"由 laughing（像在笑的）+ thrush（画眉/鸫类鸟名）组成。它并不一定是“真正的鸫科 thrush”，而是因叫声像笑、外形或习性让早期英语使用者联想到 thrush 才得名。","mnemonic":["拆开记：laughing（笑）+ thrush（常见鸟名）→ “会笑的鸟”。联想：在树林里听到像笑声一样的鸟叫。"]}
{"word":"laughingthrushes","summary":{"en":"Asian songbirds famous for loud calls that can sound like laughter.","zh":"以像笑声般嘈杂鸣叫闻名的亚洲鸣禽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medium-sized Asian songbirds known for loud, varied calls that can sound like laughing; the term often refers to species in the family Leiothrichidae (and related “babblers”).","zh":"一种中等体型的亚洲鸣禽，以嘈杂、多变、像“笑声”的叫声闻名；常指噪鹛科（及相关“鹛类/拟鸫类”）的鸟。"},"examples":[{"en":"We heard laughingthrushes calling loudly from the bamboo grove.","zh":"我们听到噪鹛在竹林里大声鸣叫。"},{"en":"Laughingthrushes often travel in small, noisy groups.","zh":"噪鹛常常成小群活动，声音很热闹。"},{"en":"Birdwatchers came to see the colorful laughingthrushes near the forest edge.","zh":"观鸟者来到林缘附近看那些羽色鲜艳的噪鹛。"}]}],"synonyms":["babblers","songbirds"],"phonetic":"/ˈlæfɪŋˌθrʌʃɪz/","extraExplanation":["学习提示：英语里很多鸟名是“外观/声音 + 类比某种鸟”的组合命名（如 woodpecker 啄木鸟）。这里的 thrush 更像是早期命名时的类比，不一定代表严格分类。"],"etymology":"复合词：laughing（像笑的）+ thrush（鸫）。名字来自其叫声听起来像“笑”，但它们多并非真正的“鸫”（thrush），而更接近“鹛类/噪鹛类”鸟。","mnemonic":["把它拆开记：laughing（笑）+ thrush（鸫）→“会笑的鸟”。想到“听起来像笑声的鸣叫”就好记。","联想中文“噪”（吵闹）+“鹛”（一种鸟）：它们常成群、声音很热闹 → 对应 laughing 的感觉。"]}
{"word":"Laughlin","summary":{"en":"A surname; also a U.S. place name (notably a town in Nevada).","zh":"常见姓氏；也可作地名（尤指美国内华达州一座城镇）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), common in English-speaking countries.","zh":"（姓氏）英语国家常见的姓。"},"examples":[{"en":"Ms. Laughlin will lead the meeting this afternoon.","zh":"Laughlin 女士今天下午将主持会议。"},{"en":"I met Dr. Laughlin at a conference in Chicago.","zh":"我在芝加哥的一次会议上认识了 Laughlin 博士。"}]},{"partOfSpeech":"other","definition":{"en":"A place name, especially Laughlin, a town in Nevada on the Colorado River.","zh":"（地名）常指美国内华达州科罗拉多河畔的 Laughlin 镇。"},"examples":[{"en":"They spent the weekend in Laughlin, Nevada.","zh":"他们在内华达州的 Laughlin 度过了周末。"},{"en":"Laughlin sits along the Colorado River near the Arizona border.","zh":"Laughlin 位于科罗拉多河沿岸，靠近亚利桑那州边界。"}]}],"phonetic":"ˈlɔflɪn","extraExplanation":["在英文里，专有名词（人名、地名）通常首字母大写；作为姓氏时前面常加 Mr./Ms./Dr. 等称谓。","美国内华达州的 Laughlin 因河岸度假、赌场与近胡佛水坝一带的旅游而较为知名。"],"etymology":"多作姓氏使用，常被认为与苏格兰/爱尔兰盖尔语名字 Lachlan（或其变体）有关；该名字与古盖尔语中指“来自（或与）斯堪的纳维亚/北方人之地”的词源（如 Lochlann）有历史联系。拼写在英语化过程中形成了 Laughlin 等变体。","mnemonic":["把它拆成“laugh（笑）+ lin（林）”：想象“在林里大笑”的人姓 Laughlin。","读音近似“洛夫林/拉夫林”，可联想中文音译“洛夫林”帮助记忆。"]}
{"word":"laughlin state","summary":{"en":"“Laughlin State” most commonly refers to Laughlin State Park in Nevada, or it may be a shortened/unclear way to refer to Laughlin, Nevada.","zh":"“Laughlin State”通常指内华达州的拉夫林州立公园，也可能是对“内华达州拉夫林镇”的不完整/简写说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A Nevada state park located in (and named after) Laughlin, a town on the Colorado River in southern Nevada.","zh":"（专有名词）美国内华达州的一个州立公园，位于（并以之命名的）拉夫林（Laughlin）镇附近，靠近科罗拉多河。"},"examples":[{"en":"We stopped at Laughlin State Park to picnic by the river.","zh":"我们在拉夫林州立公园停下来，在河边野餐。"},{"en":"Laughlin State Park is a quiet place to walk near the water.","zh":"拉夫林州立公园是一个靠近水边、适合安静散步的地方。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Informal/learner note) “Laughlin State” is not a standard fixed name by itself; people usually say “Laughlin State Park,” or they mean “Laughlin, Nevada” (the town).","zh":"（非正式/学习提示）“Laughlin State”本身并不是一个常见的固定名称；人们通常会说“Laughlin State Park（拉夫林州立公园）”，或指“Laughlin, Nevada（内华达州拉夫林镇）”。"},"examples":[{"en":"Do you mean Laughlin State Park or the town of Laughlin?","zh":"你指的是拉夫林州立公园，还是拉夫林这个镇？"}]}],"synonyms":["Laughlin State Park","Laughlin, Nevada","Laughlin (NV)"],"phonetic":"/ˈlɔflɪn/","extraExplanation":["“Laughlin”常被误读；它读作 /ˈlɔflɪn/，中间的“gh”不发音，听起来更像“LOFF-lin”。","拉夫林（Laughlin, Nevada）靠近亚利桑那州边界，是科罗拉多河沿岸的旅游与赌场小镇；因此在旅行语境中更常见到“Laughlin State Park / Laughlin, NV”这样的写法。","如果你是在地图或旅行攻略里看到“Laughlin State”，很可能是对“Laughlin State Park”的简写或省略。"]}
{"word":"laughs","summary":{"en":"“Laughs” can mean multiple laughs/laughter sounds (noun plural) or “he/she/it laughs” (verb form). In writing, it can also mark that someone is laughing.","zh":"“laughs”既可指“笑声/多次笑”（名词复数），也可指“他/她/它在笑”（动词形式）。在书写中也可用作表示“在笑”的标注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “laugh” (the sound or act of laughing); also commonly used as a casual stage direction or chat marker to show that someone is laughing.","zh":"“laugh”的复数（笑声；发笑的行为）；也常用作随意的舞台提示/聊天标注，表示“在笑”。"},"examples":[{"en":"We heard loud laughs coming from the kitchen.","zh":"我们听到厨房那边传来很大的笑声。"},{"en":"She laughs easily, even at small jokes.","zh":"她很容易笑，连小玩笑都会笑。"},{"en":"“I forgot my own password,” he says, laughs, and tries again.","zh":"“我把自己的密码忘了，”他说着，笑了笑，又试了一次。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular form of the verb “laugh”: to show amusement by smiling and making sounds; sometimes used to mean “to make fun of.”","zh":"动词“laugh”的第三人称单数：因觉得好笑而笑出声；有时也表示“嘲笑/取笑”。"},"examples":[{"en":"He laughs at his own mistakes and learns quickly.","zh":"他会对自己的错误一笑置之，并很快学会。"},{"en":"The baby laughs when you make that funny face.","zh":"你做那个滑稽表情时，宝宝会笑。"},{"en":"Don’t laugh at her accent—she speaks two languages.","zh":"别嘲笑她的口音——她会说两种语言。"}]}],"synonyms":["laughter","giggles","chuckles"],"phonetic":"/læfs/","extraExplanation":["“laughs”在口语/网络聊天里有时相当于“哈哈/笑死”，例如：\"That’s wild, laughs.\" 但正式写作中更常写成“(laughs)”作为舞台提示，或直接写“he laughs”。","注意区分：a laugh（一次笑/一阵笑）、laughs（多次笑/笑声），以及laugh at（嘲笑/对……发笑）。在礼貌表达里，避免用laugh at别人容易显得不尊重。"]}
{"word":"laughsome","summary":{"en":"“Laughsome” means amusing or laughable, but it’s uncommon in modern everyday English.","zh":"“laughsome”表示“好笑的、可笑的”，但在现代日常英语中较少用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Funny or amusing; likely to make people laugh.","zh":"好笑的；有趣的；让人发笑的。"},"examples":[{"en":"The comedian told a laughsome story about his first job.","zh":"那位喜剧演员讲了一个关于他第一份工作的好笑故事。"},{"en":"Her laughsome comments helped everyone relax.","zh":"她那些有趣的评论让大家都放松了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Silly or ridiculous in a way that invites laughter; laughable.","zh":"（因荒唐或滑稽而）可笑的；令人发笑的。"},"examples":[{"en":"It’s laughsome to think I believed that rumor.","zh":"想想我竟然相信那个谣言，真是可笑。"},{"en":"The plan sounded laughsome at first, but it actually worked.","zh":"这个计划起初听起来很荒唐，但结果真的成功了。"}]}],"synonyms":["amusing","funny","humorous","comic","laughable"],"phonetic":"/ˈlæf.səm/","extraExplanation":["“laughsome”在现代英语里比较少见，带一点文学或旧式的感觉；日常口语更常用“funny / amusing / humorous”。","词尾“-some”有“充满……的、带有……性质的”意思（如“troublesome”麻烦的），所以“laughsome”字面上可理解为“带来笑的”。"]}
{"word":"laughter","summary":{"en":"“Laughter” means the act or sound of laughing, often showing amusement or emotion.","zh":"“laughter”指“笑/笑声”，常用来表达开心、有趣，或紧张等情绪反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The sound or act of laughing; a reaction that shows amusement, joy, or sometimes nervousness.","zh":"笑声；笑的行为；表示开心、觉得好笑，有时也可能是紧张或尴尬时的反应。"},"examples":[{"en":"Her joke filled the room with laughter.","zh":"她的笑话让房间里充满了笑声。"},{"en":"There was nervous laughter after the mistake.","zh":"出错后大家发出了紧张的笑声。"},{"en":"Their laughter could be heard from the hallway.","zh":"从走廊里都能听到他们的笑声。"}]}],"synonyms":["laughing","giggles","chuckles","mirth","amusement"],"phonetic":"/ˈlæf.tɚ/","extraExplanation":["“Laughter”通常是不可数名词（表示“笑/笑声”这一整体感觉：The show brought laughter.），但在强调“某一次/一阵阵的笑声”时也可作可数用法：a burst of laughter（一阵爆笑）、loud laughter（大笑）。","常见搭配：burst into laughter（突然笑起来）、fill the room with laughter（让房间充满笑声）、hear laughter（听到笑声）。","文化语境上，英语里也会用“laughter”表达社交氛围与情绪（如nervous laughter紧张的笑），不一定都表示真的觉得好笑。"]}
{"word":"laughter-filled","summary":{"en":"full of laughter and cheerful amusement","zh":"充满笑声、欢乐愉快的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of laughter; containing a lot of laughter and happy, amused reactions.","zh":"充满笑声的；笑声不断、气氛欢乐的。"},"examples":[{"en":"The dinner turned into a laughter-filled evening with stories and jokes.","zh":"这顿晚餐变成了一个充满笑声的夜晚，大家讲故事、开玩笑。"},{"en":"She remembers a laughter-filled childhood with her cousins.","zh":"她记得和表亲们一起度过的、充满笑声的童年。"}]}],"synonyms":["joyful","cheerful","mirthful","jovial","hilarious","lighthearted","fun-filled"],"phonetic":"/ˈlæftər fɪld/","extraExplanation":["用法提示：作定语时常写作 laughter-filled（a laughter-filled room）。作表语时也可写作 filled with laughter（The room was filled with laughter）。两者意思相同，但前者更精炼、更“文学/描写性”。","风格与语境：多用于积极、温暖的场景描写（聚会、家庭回忆、课堂活动等）。"],"etymology":"由名词 lɑughter（笑声）+ 过去分词 filled（被……充满的）构成的复合形容词；常用连字符表示作定语（修饰名词）。","mnemonic":["拆开记：laughter（笑声）+ filled（装满）= “笑声装满了” → 充满笑声的。","联想中文：像“笑声满屋/笑声不断”，把“满”对应到 filled。"]}
{"word":"laughterful","summary":{"en":"“Laughterful” means full of laughter or making people laugh, but it’s rare and sounds literary; common alternatives are “laughter-filled” or “full of laughter.”","zh":"“laughterful”表示“充满笑声的/引人发笑的”，但较少见、略偏文学；更常用的是“laughter-filled”或“full of laughter”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of laughter; causing or showing a lot of laughter (rare, somewhat literary).","zh":"充满笑声的；引人发笑的；带着笑意的（较少见，略偏文学/诗意用法）。"},"examples":[{"en":"The room was warm and laughterful after dinner.","zh":"晚饭后房间里暖意融融，充满了笑声。"},{"en":"She spoke in a laughterful voice that made everyone relax.","zh":"她用带着笑意的声音说话，让大家都放松了。"},{"en":"Their laughterful stories turned a stressful day into a lighter one.","zh":"他们那些令人发笑的故事把紧张的一天变得轻松了些。"}]}],"synonyms":["laughter-filled","full of laughter","joyful","cheerful","amusing"],"phonetic":"/ˈlæf.tɚ.fəl/","extraExplanation":["“laughterful”在现代英语里不算常用，听起来有点“自造词/诗意用词”的感觉。日常写作与口语中更自然的表达通常是：laughter-filled（充满笑声的）、full of laughter（充满笑声的）、joyful（快乐的）、funny/amusing（好笑的/有趣的）。","构词上它是“laughter（笑声）+ -ful（充满……的）”，形式上合理，但因为习惯用法的原因没有像“joyful”“playful”那样普及。写作时如果追求自然地道，建议优先用更常见的替代表达。"]}
{"word":"laughterless","summary":{"en":"“Laughterless” describes something that has no laughter or feels humorless and tense.","zh":"“laughterless”指没有笑声、缺乏幽默、气氛偏紧张或冷淡的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without laughter; not showing or involving laughter, humor, or lightness.","zh":"无笑的；不带笑声的；缺乏幽默或轻松感的。"},"examples":[{"en":"His laughterless reply made the room feel tense.","zh":"他无笑的回答让房间气氛变得紧张。"},{"en":"The film is powerful but almost laughterless from start to finish.","zh":"这部电影很有力量，但从头到尾几乎没有笑点。"},{"en":"She gave a laughterless smile, trying to be polite.","zh":"她勉强挤出一个无笑的微笑，想保持礼貌。"}]}],"synonyms":["humorless","unsmiling","somber","grim","joyless"],"phonetic":"/ˈlæftɚləs/","extraExplanation":["“laughterless”= laughter（笑声）+ -less（“没有/缺乏”）。常用来营造氛围：冷淡、压抑、严肃，或表示“笑不出来”的情绪。","它比“serious（严肃）”更强调“缺少笑声/幽默”，带有更强的情感色彩，常见于文学描写或影评、评论文字中。"]}
{"word":"laughters","summary":{"en":"“Laughters” means multiple instances or sources of laughter, though “laughter” is more commonly used as an uncountable noun.","zh":"“laughters”表示多次/不同来源的笑声，但日常更常用不可数名词“laughter”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “laughter”: the sounds or moments of people laughing","zh":"“laughter（笑声/笑）”的复数：多次的笑声，或不同人的笑声（/笑的时刻）"},"examples":[{"en":"Laughters echoed through the hallway after the joke.","zh":"讲完笑话后，走廊里回荡着一阵阵笑声。"},{"en":"In the photos, you can almost hear the children’s laughters.","zh":"看这些照片，你几乎能“听见”孩子们的笑声。"}]}],"synonyms":["bursts of laughter","peals of laughter","giggles"],"phonetic":"/ˈlæftərz/","extraExplanation":["“laughter”通常是不可数名词（uncountable），更常说：There was a lot of laughter. / The room filled with laughter。","用“laughters”比较少见，多用于强调“多次/不同来源的笑声”，或文学描写里为了营造画面感（如“laughters and cries”）。在日常英语里更自然的表达往往是“bursts of laughter（笑声一阵阵）”“peals of laughter（爽朗的笑声）”。"]}
{"word":"laughworthy","summary":{"en":"Laughworthy means either genuinely funny or so ridiculous that it makes people laugh.","zh":"laughworthy 指“很搞笑”或“荒唐得可笑”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Funny enough to make you laugh; amusing.","zh":"好笑到让人发笑的；很有趣的。"},"examples":[{"en":"The comedian’s story was genuinely laughworthy.","zh":"那位喜剧演员的故事真的很让人发笑。"},{"en":"Her quick reply was so laughworthy that the whole room burst out laughing.","zh":"她机智的回答太好笑了，整个房间都笑翻了。"}]},{"partOfSpeech":"adj.","definition":{"en":"So silly or ridiculous that it becomes laughable (sometimes critical).","zh":"荒唐到令人发笑的（有时带批评意味）。"},"examples":[{"en":"His excuse was laughworthy—no one believed it for a second.","zh":"他的借口荒唐得可笑——没人相信。"},{"en":"The plan sounded laughworthy on paper, but it worked in real life.","zh":"这个计划写在纸上听起来可笑，但现实中竟然成功了。"}]}],"synonyms":["funny","amusing","hilarious","laughable","ridiculous"],"phonetic":"/ˈlæfˌwɝði/","extraExplanation":["“laughworthy”= laugh + “-worthy”（“值得……”的）。在语气上，它既可以是褒义（真的很有趣、很逗），也可以是贬义（荒唐可笑）。如果想更明确地表达褒义，常用“funny / hilarious”；想表达贬义，常用“ridiculous / laughable”。","这个词在日常口语里不算最常见，更常见的表达是“laugh-out-loud funny（笑到出声的）”或“laughable（可笑的）”。"]}
{"word":"laughy","summary":{"en":"“Laughy” is an informal adjective meaning “giggly/easily amused” or “lightly funny.”","zh":"“laughy”是一个非正式形容词，表示“爱笑/容易被逗笑”，也可表示“轻松好笑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Feeling like laughing; giggly and easily amused.","zh":"（非正式）想笑的；爱笑的；很容易被逗笑的。"},"examples":[{"en":"I’m in a really laughy mood today.","zh":"我今天特别想笑。"},{"en":"After the long meeting, everyone got kind of laughy.","zh":"开完那场长会后，大家都有点爱笑、容易被逗乐。"},{"en":"Stop looking at me—I’m already laughy!","zh":"别看我了——我已经憋不住想笑了！"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Likely to make people laugh; funny in a light, silly way.","zh":"（非正式）让人想笑的；好笑的（偏轻松、傻萌的那种）。"},"examples":[{"en":"It’s a simple, laughy comedy—not too serious.","zh":"这是一部很轻松好笑的喜剧，不太严肃。"},{"en":"He told a few laughy stories from school.","zh":"他讲了几件上学时的好笑小事。"}]}],"synonyms":["giggly","smiley","amused","lighthearted","funny","amusing"],"phonetic":"/ˈlæfi/","extraExplanation":["“laughy”不是很正式、也不算标准书面语，更常见于口语或轻松的文字（比如聊天、社交媒体）。想表达“爱笑/容易笑”，更常用：giggly, in a laughing mood；想表达“好笑的”，更常用：funny, amusing, humorous。"]}
{"word":"lauhala","summary":{"en":"Lauhala is the dried hala (pandanus) leaf used in Hawaiian weaving, or items made from it.","zh":"Lauhala 指夏威夷用来编织的哈拉树（露兜树）干叶，也可指用它编成的物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the dried leaf of the hala (pandanus) tree, traditionally used in Hawaiʻi for weaving mats, baskets, hats, and other crafts","zh":"露哈拉：哈拉树（露兜树/潘丹树）的叶子，晒干后在夏威夷传统上用来编织席垫、篮子、帽子等手工艺品"},"examples":[{"en":"She learned to weave a small basket from lauhala.","zh":"她学会用露哈拉编一个小篮子。"},{"en":"The museum displayed traditional lauhala mats used in Hawaiian homes.","zh":"博物馆展示了夏威夷家庭使用的传统露哈拉席垫。"}]},{"partOfSpeech":"n.","definition":{"en":"something made from woven lauhala, such as a mat, hat, or bag","zh":"用露哈拉编织成的物品（如席子、帽子或包）"},"examples":[{"en":"He bought a lauhala hat to protect himself from the sun.","zh":"他买了一顶露哈拉编织帽来遮阳。"},{"en":"Her lauhala bag was light but strong.","zh":"她的露哈拉编织包很轻却很结实。"}]}],"synonyms":["hala leaf","pandanus leaf","woven pandanus"],"phonetic":"/laʊˈhɑlə/","extraExplanation":["“Lauhala”来自夏威夷语：lau（叶子）+ hala（哈拉树/露兜树）。在夏威夷文化中，编织（weaving）不仅是实用技能，也常与家族传承、社区教学和传统工艺复兴有关。你可能还会看到相关词：hala（这种树）、pandanus（英文常用树名）、lauhala weaving（露哈拉编织）。"]}
{"word":"lauia","summary":{"en":"“lauia” isn’t a common English word; it’s likely a misspelling or a proper name.","zh":"“lauia”不是常见英语词汇；更可能是拼写错误或专有名词（如人名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name (proper noun).","zh":"不是常见的英语单词，可能是拼写错误或人名/专有名词。"},"examples":[{"en":"I can’t find “lauia” in an English dictionary—did you mean “laud” or “Laura”?","zh":"我在英语词典里找不到“lauia”——你是不是想写“laud”或“Laura”？"},{"en":"Please check the spelling of “lauia” and tell me where you saw it (a text, a name, or a brand).","zh":"请确认“lauia”的拼写，并告诉我你在哪里看到它（文章里、人名、还是品牌名）。"}]}],"extraExplanation":["“lauia”很可能是拼写误差。你可以回想一下它出现的语境：\n- 如果是动词、表示“称赞”，可能想写 laud。\n- 如果是人名，可能是 Laura / Laia / Louisa 等。\n把你看到的完整句子发我，我可以更准确判断。"]}
{"word":"lauig","summary":{"en":"“lauig” isn’t a standard English word; you probably mean “laugh,” meaning to laugh (v.) or a laugh (n.).","zh":"“lauig”不是标准英语单词；你很可能想查的是“laugh”，意思是“笑”（动词）或“笑/笑声”（名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended word) to make sounds and facial movements that show you find something funny; to show joy or amusement.","zh":"（可能是你想输入的词）发笑；因觉得有趣而笑出声或露出笑容。"},"examples":[{"en":"Everyone laughed at the joke.","zh":"大家都被这个笑话逗笑了。"},{"en":"She laughed when she saw the funny video.","zh":"她看到有趣的视频时笑了。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or sound of laughing.","zh":"笑；笑声。"},"examples":[{"en":"His laugh is loud and contagious.","zh":"他的笑声很大，很有感染力。"},{"en":"We heard a laugh from the next room.","zh":"我们听到隔壁房间传来一阵笑声。"}]}],"synonyms":["giggle","chuckle","snicker","grin"],"phonetic":"/læf/","extraExplanation":["“lauig”不是常见英语单词，最接近的常用词通常是“laugh”。如果你想查的是别的词，请告诉我你看到它的句子或正确拼写，我可以更准确判断。"]}
{"word":"laulau","summary":{"en":"Lau lau is a Hawaiian dish of meat wrapped in taro leaves and steamed until tender.","zh":"Lau lau 是夏威夷的芋叶包肉蒸菜，蒸至软嫩入味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hawaiian food) A traditional dish made by wrapping seasoned pork (often with butterfish) in taro leaves (or sometimes other leaves) and steaming it until tender.","zh":"（夏威夷料理）一种传统食物：把调味过的猪肉（常配油鱼/咸鱼）用芋叶（有时也用其他叶子）包起来蒸熟，口感软嫩。"},"examples":[{"en":"I ordered lau lau with rice and lomi salmon.","zh":"我点了芋叶蒸肉（lau lau），配米饭和番茄拌三文鱼（lomi salmon）。"},{"en":"Lau lau is usually steamed for hours so the meat becomes very soft.","zh":"Lau lau 通常要蒸好几个小时，肉才会变得非常软烂。"}]}],"synonyms":["Hawaiian steamed pork","leaf-wrapped pork","taro-leaf wrapped meat"],"phonetic":"ˈlaʊ ˌlaʊ","extraExplanation":["“Lau lau”来自夏威夷语，常写作“lau lau”或“lau-lau”。在夏威夷当地它不仅是食物名，也常出现在“luau（夏威夷宴会）”的菜单里。","传统做法常用“ti叶”在外层再包一层，帮助固定并增加香气；有的做法也会用鸡肉或章鱼等做馅。"]}
{"word":"laumonite","summary":{"en":"Laumontite (also spelled laumonite) is a zeolite mineral that can dehydrate and become crumbly in dry air.","zh":"Laumontite（也作 laumonite）是一种沸石矿物，在干燥空气中可能失水并变得粉化易碎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of zeolite mineral (a hydrated calcium aluminum silicate) that often forms white to gray crystals and may lose water and crumble when exposed to dry air.","zh":"一种沸石矿物（含水的钙铝硅酸盐），常呈白色到灰色晶体；在干燥空气中可能失水而变得粉化、易碎。"},"examples":[{"en":"Laumontite is a common zeolite found in cavities of volcanic rocks.","zh":"劳蒙沸石是一种常见的沸石，常见于火山岩的孔洞中。"},{"en":"Some collectors store laumontite in sealed containers because it can dehydrate and crumble.","zh":"一些矿物收藏者会把劳蒙沸石密封保存，因为它可能失水并变得粉化。"}]}],"synonyms":["laumontite","zeolite (general category)"],"phonetic":"/ˈlɔːmənˌtaɪt/","extraExplanation":["“Laumontite”更常见的拼写是 laumontite（也可见 laumonite 作为变体/误拼）。中文常译为“劳蒙沸石”。","它属于沸石族矿物，常与玄武岩、安山岩等火山岩的裂隙或晶洞有关；学习时可把它和“zeolite（沸石）”联系起来理解。","词源上与18世纪的矿物学命名传统有关，属于以人名或地名纪念式命名的矿物词汇。"]}
{"word":"laumontite","summary":{"en":"Laumontite is a zeolite mineral, typically white or colorless, found in cavities of volcanic rocks.","zh":"Laumontite（方沸石）是一种沸石族矿物，多为白色或无色，常见于火山岩空洞中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A white to colorless mineral in the zeolite group, often found lining cavities in volcanic rocks; it contains calcium, aluminum, and hydrated silicate.","zh":"一种白色到无色的沸石族矿物，常见于火山岩空洞的晶洞中作衬里；主要成分含钙、铝与含水硅酸盐。"},"examples":[{"en":"The geologist identified laumontite crystals growing inside a basalt cavity.","zh":"地质学家在玄武岩的空洞中辨认出了生长的方沸石晶体。"},{"en":"Laumontite is a zeolite mineral and can lose water if the air is too dry.","zh":"方沸石属于沸石矿物，如果空气太干燥，它可能会失去结晶水。"}]}],"synonyms":["zeolite (group term)"],"phonetic":"/ˈlɔːmənˌtaɪt/","extraExplanation":["方沸石（laumontite）常见于低温热液作用或火山岩气孔/裂隙中，与其他沸石（如针沸石、斜发沸石等）一起出现。","它的英文名来自19世纪的矿物学命名传统，通常与发现地或人物相关（具体来源在不同资料中记载略有差异）。"]}
{"word":"laun","summary":{"en":"“Laun” is not a standard English word; it is usually an incomplete spelling or abbreviation of “launch.”","zh":"“laun”不是标准英语词；通常是“launch”的不完整拼写或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or incomplete form; most often a misspelling/abbreviation of “launch.”","zh":"非标准或不完整的形式；最常见是 “launch（启动/发射/推出）” 的拼写错误或缩写。"},"examples":[{"en":"I think you meant “launch,” not “laun.”","zh":"我觉得你想写的是 “launch”，不是 “laun”。"},{"en":"The button should say “Launch app,” but it shows “laun.”","zh":"按钮本该显示 “Launch app（启动应用）”，但它显示成了 “laun”。"}]}],"synonyms":["launch (likely intended)"],"extraExplanation":["“laun”本身不是常见的标准英语单词。如果你是在学习词汇，很可能你要查的是：\n- launch /lɔntʃ/：启动（程序）、发射（火箭）、推出（产品）\n如果你告诉我你看到“laun”的句子或截图（上下文），我也可以帮你准确判断它到底指什么。"]}
{"word":"launce","summary":{"en":"“Launce” is either a small fish (sand eel) or an archaic spelling of “lance.”","zh":"“Launce”既可指玉筋鱼（沙鳗）等细长小海鱼，也可作“lance”的古拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, slender sea fish (also called a sand eel), often used as bait","zh":"（鱼）玉筋鱼；沙鳗（常作钓饵用）"},"examples":[{"en":"Fishermen often use launce as bait for salmon.","zh":"渔民常用玉筋鱼作鲑鱼的钓饵。"},{"en":"Seabirds dive for launce near the shore.","zh":"海鸟会在近岸潜水捕食玉筋鱼。"}]},{"partOfSpeech":"other","definition":{"en":"an old spelling of “lance” (a spear), or the verb meaning “to pierce with a lance”","zh":"“lance”的古拼写：长矛；（动词）用矛刺穿"},"examples":[{"en":"In older texts, you may see “launce” where modern English uses “lance.”","zh":"在较早的文本中，你可能会看到用“launce”来表示现代英语的“lance”。"},{"en":"The knight rode forward to launce his opponent.","zh":"骑士策马向前，用长矛刺向对手。"}]}],"synonyms":["sand eel","lance (archaic spelling)"],"phonetic":"/læns/","extraExplanation":["“launce”在现代英语里不常用，最常见的两种情况是：①指一种细长的小海鱼（常见于英式或地区性用法）；②作为“lance”的古体拼写，常出现在古英语文本或文学作品中。","文学/文化提示：莎士比亚《维罗纳二绅士》（The Two Gentlemen of Verona）里有一位小丑角色名叫 Launce（兰斯/劳恩斯），这也是学习者可能遇到这个拼写的原因之一。"]}
{"word":"launces","summary":{"en":"“launches” means “starts/introduces something new” or “sends something off (like a rocket)”; it can also be the plural noun of “launch.”","zh":"“launches”表示“推出/启动新事物”或“发射（如火箭）”；也可作名词复数，指多场发布/多次发射等。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person, company, or organization) starts or introduces something new, especially a product, service, plan, or event.","zh":"（人、公司或组织）推出/发布/启动某事物，尤指新产品、服务、计划或活动。"},"examples":[{"en":"The company launches a new app next week.","zh":"这家公司下周将推出一款新应用。"},{"en":"The city launches a campaign to reduce plastic waste.","zh":"这座城市启动了一项减少塑料垃圾的宣传活动。"}]},{"partOfSpeech":"v.","definition":{"en":"sends something into motion (for example, a rocket, spacecraft, or attack).","zh":"发射/使……开始运动（例如火箭、航天器或一次进攻）。"},"examples":[{"en":"The agency launches a satellite into orbit.","zh":"该机构把一颗卫星发射到轨道上。"},{"en":"The group launches an attack at dawn.","zh":"该组织在黎明时发起进攻。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “launch”: events or moments when something new is introduced; also the acts of sending rockets/ships, etc.","zh":"“launch”的复数：发布/推出活动（或时刻）；也可指多次发射/下水等行为。"},"examples":[{"en":"This year’s product launches were widely covered by the media.","zh":"今年的产品发布会得到了媒体的广泛报道。"},{"en":"The program includes several rocket launches.","zh":"该项目包括多次火箭发射。"}]}],"synonyms":["starts","introduces","unveils","begins","rolls out"],"phonetic":"/ˈlɔntʃɪz/","extraExplanation":["你输入的 **launces** 很可能是 **launches** 的拼写误写（launch 的第三人称单数/名词复数）。","另外，英语里确实有一个很少见的词 **launce**（一种小型海鱼），其复数可以写作 **launces**；但在日常英语中远不如 **launches** 常见。"]}
{"word":"launch","summary":{"en":"Launch means to start something officially, or to send something out with force (like a rocket); it can also mean to rush forward suddenly.","zh":"Launch 常指“正式启动/推出”，也可指“发射（火箭等）/使下水”，还可表示“猛冲、突然扑上去”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to start or begin something (an activity, project, product, or campaign), often in a planned or official way","zh":"（正式或有计划地）开始、启动（活动/项目/产品/宣传等）"},"examples":[{"en":"The company will launch a new app next month.","zh":"这家公司下个月将推出一款新应用。"},{"en":"They launched a campaign to raise money for the hospital.","zh":"他们发起了一项为医院筹款的活动。"}]},{"partOfSpeech":"vt.","definition":{"en":"to send something into the air, water, or space with force; to set a rocket, satellite, or ship in motion","zh":"发射；使（火箭/卫星/船等）出发或进入运行"},"examples":[{"en":"They plan to launch the rocket at sunrise.","zh":"他们计划在日出时发射火箭。"},{"en":"The navy launched the ship after months of construction.","zh":"海军在建造数月后为这艘船举行下水（使其出航）。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move suddenly and energetically in a particular direction","zh":"猛冲；突然用力朝某方向移动"},"examples":[{"en":"The dog launched at the ball as soon as it hit the ground.","zh":"球一落地，那只狗就猛地扑向球。"},{"en":"She launched into the room without knocking.","zh":"她没敲门就冲进了房间。"}]}],"synonyms":["start","begin","initiate","introduce","unveil","release","blast off","shoot","lunge"],"phonetic":"/lɔntʃ/","extraExplanation":["常见搭配：launch a product（推出产品）、launch a campaign（发起活动）、launch an investigation（展开调查）、launch an attack（发动攻击）。","固定搭配：launch into + 名词/动名词，表示“突然开始（长篇）讲话/工作/批评等”，语气常带“突然、来势很猛”的感觉：He launched into a long speech.（他突然开始长篇大论。）","词源提示：launch 与“把船下水/推出去”有关，因此既能指“发射火箭/导弹”，也能引申为“推出新产品、启动计划”。"]}
{"word":"launch pad","summary":{"en":"A launch pad is either the place where rockets are launched, or a figurative “starting point” that helps something take off.","zh":"launch pad既指火箭等的发射台，也可比喻为帮助事业或计划“起飞”的起点/跳板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A platform or area from which a rocket or spacecraft is launched.","zh":"（火箭/航天器的）发射台；发射场地"},"examples":[{"en":"The rocket stood on the launch pad for hours before liftoff.","zh":"火箭在发射台上停了好几个小时才起飞。"},{"en":"Engineers inspected the launch pad after the test.","zh":"工程师在测试后检查了发射台。"}]},{"partOfSpeech":"n.","definition":{"en":"A starting point that helps something develop quickly or successfully (often for a career, project, or idea).","zh":"（比喻）起点；跳板；助推平台（常指事业、项目或想法的起飞点）"},"examples":[{"en":"The internship was a launch pad for her career.","zh":"这次实习成了她职业发展的跳板。"},{"en":"The small grant became a launch pad for a bigger project.","zh":"这笔小额资助成了更大项目的起点。"}]}],"synonyms":["launch platform","pad","springboard","stepping stone"],"phonetic":"/ˈlɔntʃ ˌpæd/","extraExplanation":["“launch pad”原指航天发射设施，因此在新闻、商业与日常表达中常被借用作比喻，强调“提供条件/资源，让事情快速起飞”。","常见搭配：on the launch pad（已就位、准备开始）、a launch pad for sth（某事的跳板/起点）。","近义表达（比喻义）：springboard, stepping stone。"]}
{"word":"launch-heavy","summary":{"en":"having many releases or rollouts in a short time","zh":"发布/上线密集的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Characterized by frequent product releases or major rollouts within a short period of time.","zh":"（在一段时间内）发布/上线很密集的；以频繁发布为主的。"},"examples":[{"en":"Q4 is launch-heavy, so the team is adding extra support coverage.","zh":"第四季度发布很密集，所以团队会增加额外的支持排班。"},{"en":"We need a launch-heavy roadmap to catch up with competitors.","zh":"我们需要一份发布密集的路线图来追赶竞争对手。"},{"en":"The marketing calendar is launch-heavy, with two campaigns starting every month.","zh":"营销日历以密集发布为主，几乎每个月都有两场活动启动。"}]}],"synonyms":["release-heavy","launch-packed","launch-intensive","rollout-heavy"],"phonetic":"/lɔntʃ ˈhɛvi/","extraExplanation":["这里的 heavy 不是“重量大”，而是“某事物很多/占比大/负担重”的意思：如 traffic-heavy（车流密集的）、schedule-heavy（行程很满的）。","在产品/互联网语境里，launch 通常指“新功能上线、产品发布、活动启动”，不一定是“火箭发射”。"],"etymology":"这是现代复合形容词：launch（发布/上线/发射）+ heavy（“很多、占比大”这一引申义）。类似结构还有 feature-heavy（功能很多的）、data-heavy（数据量很大的）。常见于商业、产品、工程语境。","mnemonic":["把 heavy 记成“很重→很多→很密集/压力大”：launch-heavy 就是“发布多到很重”的感觉。","类比记忆：feature-heavy（功能很多）→ launch-heavy（发布很多）。"]}
{"word":"launch-ready","summary":{"en":"fully prepared to launch or release","zh":"已具备发布/启动/发射条件"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fully prepared for a launch, release, or rollout (a product, project, campaign, etc.).","zh":"（产品/项目/活动等）已完全准备好，可以发布/上线/启动的。"},"examples":[{"en":"After months of testing, the app is finally launch-ready.","zh":"经过几个月的测试，这个应用终于可以上线了。"},{"en":"The team isn’t launch-ready yet; we still need to fix a few bugs.","zh":"团队还没达到可上线的状态；我们还需要修几个漏洞。"},{"en":"They built a launch-ready marketing plan with clear timelines and budgets.","zh":"他们制定了一份可直接启动的营销方案，时间表和预算都很清晰。"}]},{"partOfSpeech":"adj.","definition":{"en":"Ready to start an operation immediately, especially in military, aerospace, or emergency contexts.","zh":"（尤指军事、航天或应急场景）已就绪，可立即执行发射/行动的。"},"examples":[{"en":"The spacecraft was declared launch-ready early this morning.","zh":"今天一早，这艘航天器被宣布已具备发射条件。"},{"en":"All systems are checked and launch-ready.","zh":"所有系统已检查完毕，具备发射条件。"}]}],"synonyms":["ready to launch","release-ready","deployment-ready","market-ready","good to go"],"phonetic":"/lɔntʃ ˈrɛdi/","extraExplanation":["拼写上常见两种：launch-ready（更常见，作定语或表语）与 launch ready（较少见）。例如：a launch-ready product / The product is launch-ready。","语气上比 ready 更强调：不仅“准备好了”，而且已经达到“可以对外启动/发布”的标准（常包含测试、合规、物料、流程等都已到位）。"],"etymology":"由“launch（发射/启动/推出）+ ready（准备好的）”组合而成的复合形容词。早先多用于航天/军事语境，后来被科技与商业领域借用，表示“可发布、可上线、可投入市场”。","mnemonic":["把它拆开记：launch=“发射/上线/推出”，ready=“准备好”；合起来就是“可发射/可上线”。","联想“火箭发射前的倒计时”：倒计时结束还不出问题，才叫 launch-ready（达到发射条件）。"]}
{"word":"launchable","summary":{"en":"“Launchable” means able to be launched—either physically (like a rocket) or practically (like an app that’s ready to release/run).","zh":"“launchable”表示“可发射的/可启动的”，既可指火箭等可发射，也常指应用或产品已准备好可上线发布、可运行。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be launched; ready to be sent into the air/space or put into operation.","zh":"可发射的；可启动的；（产品/计划等）可发布并投入使用的。"},"examples":[{"en":"The rocket is launchable only in good weather.","zh":"火箭只有在天气良好时才可发射。"},{"en":"We finally have a launchable version of the app.","zh":"我们终于有了一个可发布并上线的应用版本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing, especially software/build systems) Able to be started or executed without errors; runnable.","zh":"（计算机/软件）可启动的；可运行的（通常指不会报错或具备运行条件）。"},"examples":[{"en":"Make sure the program is launchable on both Windows and macOS.","zh":"请确保该程序在 Windows 和 macOS 上都可启动运行。"},{"en":"The file isn’t launchable because a required library is missing.","zh":"这个文件无法启动运行，因为缺少必需的库。"}]}],"synonyms":["ready-to-launch","releasable","deployable","runnable"],"phonetic":"/ˈlɔntʃəbəl/","extraExplanation":["“launchable”是由动词“launch”（发射/启动/发布）+ 形容词后缀“-able”（能够……的）构成，常见于航天语境与科技产品（尤其软件/应用）发布语境。","在产品与创业语境里，“launchable”常带有“已经准备到可以对外发布/上线”的含义，近似“ready to launch / release-ready”。"]}
{"word":"launched","summary":{"en":"“Launched” means “started/introduced” (a product or plan) or “sent off” (a rocket/boat), and can also mean “began suddenly.”","zh":"“launched”表示“推出/启动”（产品或计划）、“发射/放出”（火箭、船等），也可指“突然开始（做某事）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of launch) To start or introduce something in a planned way, especially a product, project, campaign, or event.","zh":"（launch 的过去式/过去分词）有计划地开始或推出（产品、项目、活动等）。"},"examples":[{"en":"The company launched a new app last month.","zh":"这家公司上个月推出了一款新应用。"},{"en":"They launched a campaign to raise money for the school.","zh":"他们发起了一项为学校筹款的活动。"}]},{"partOfSpeech":"vt.","definition":{"en":"To send something out or off with force; to fire, throw, or release (e.g., a rocket, missile, boat).","zh":"用力发射、投掷或放出（如火箭、导弹、船只等）。"},"examples":[{"en":"The rocket was launched at sunrise.","zh":"火箭在日出时发射。"},{"en":"They launched the boat into the water.","zh":"他们把船下水（放入水中）。"}]},{"partOfSpeech":"vi.","definition":{"en":"To begin moving or acting suddenly or energetically.","zh":"突然或迅速地开始行动/移动。"},"examples":[{"en":"She launched into an explanation without waiting for questions.","zh":"她没等别人提问就开始解释起来。"},{"en":"He launched himself out of the chair and ran to the door.","zh":"他从椅子上猛地站起身，跑向门口。"}]}],"synonyms":["started","introduced","released","initiated","kicked off","fired","sent off"],"phonetic":"/lɔntʃt/","extraExplanation":["“launch”常见搭配：launch a product/app/service（推出产品/应用/服务），launch a campaign/initiative（发起活动/倡议），launch an attack（发起攻击），launch into + 名词（突然开始做某事：launch into a speech/argument）。","语气与场景：用于商业/科技语境时，“launch”强调正式发布；用于动作描写时，带有“突然、用力”的画面感。"]}
{"word":"launchen","summary":{"en":"“Launchen” is not standard English; it is likely a misspelling of “launch,” meaning to start/introduce something or to send something (like a rocket) into motion.","zh":"“launchen”不是标准英语，通常是“launch”的拼写错误；“launch”可指发布/启动某事，或发射（如火箭）使其起动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to start or introduce something (such as a product, project, service, or event) to the public","zh":"（向公众）推出；发布（产品、项目、服务或活动）"},"examples":[{"en":"The company will launch a new app next month.","zh":"这家公司下个月将推出一款新应用。"},{"en":"They launched a campaign to raise money for the school.","zh":"他们发起了一项为学校筹款的活动。"}]},{"partOfSpeech":"v.","definition":{"en":"to send something into the air or into motion; to fire or throw something","zh":"发射；投掷；使（某物）飞出或开始运动"},"examples":[{"en":"The rocket launched at dawn.","zh":"火箭在黎明时发射升空。"},{"en":"He launched the ball across the field.","zh":"他把球远远地投向场地另一端。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or event of starting or introducing something; an official beginning","zh":"发布；推出；启动（的活动或仪式）"},"examples":[{"en":"The launch of the website went smoothly.","zh":"网站的上线发布很顺利。"},{"en":"We watched the launch live on TV.","zh":"我们在电视上观看了发射直播。"}]}],"synonyms":["start","begin","introduce","release","unveil","initiate","kick off"],"phonetic":"/lɔntʃ/","extraExplanation":["“launchen”不是标准英语单词。你很可能想写的是 **launch**。英语里动词一般不会用“-en”来构成“launch”的变体（例如“widen”来自“wide”，但“launch”不这样变化）。如果你告诉我它出现的句子，我也可以帮你确认语境。"]}
{"word":"launcher","summary":{"en":"“Launcher” usually means a device or program used to launch or start something.","zh":"“launcher”通常指用来“发射”或“启动”某物的装置或软件（也可指发起者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or program that starts (launches) something, such as a rocket, a weapon, or a computer application.","zh":"发射器；（也指）启动器：用来发射火箭/武器或启动电脑程序的装置或软件。"},"examples":[{"en":"The rocket sat on the launcher, ready for takeoff.","zh":"火箭停在发射架上，准备起飞。"},{"en":"Click the launcher to open your apps.","zh":"点击启动器来打开你的应用程序。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that launches or starts something (often used in news or formal writing).","zh":"发起者；发射者：指启动或发起某事的人或事物（常见于新闻或较正式的表达）。"},"examples":[{"en":"The company became the launcher of a new service.","zh":"这家公司成为一项新服务的推出方。"},{"en":"The launcher of the campaign spoke to reporters.","zh":"这次活动的发起者接受了记者采访。"}]}],"synonyms":["starter","app launcher","launch device","missile launcher"],"phonetic":"/ˈlɔntʃɚ/","extraExplanation":["“launcher”来自动词“launch”（发射；启动）。在科技语境里，它常指手机/电脑上的“应用启动器”（app launcher）；在军事/航天语境里，常指“导弹发射器/火箭发射架”。注意不要和“launchpad”（发射台/起步平台）混淆：launchpad更强调“平台/起点”，launcher更强调“发射/启动的装置或工具”。"]}
{"word":"launchers","summary":{"en":"“Launchers” means devices or people that start or send something off; it is the plural of “launcher.”","zh":"“Launchers”表示“发射器/启动器等装置或发射者”，是“launcher”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or person that launches something (for example, a rocket, missile, app, or sports ball)","zh":"发射器；发射装置；（能）发射某物的人（如火箭/导弹/应用/球类的发射装置）"},"examples":[{"en":"The rocket launcher was moved to a safe area.","zh":"火箭发射器被转移到了安全区域。"},{"en":"This phone comes with a simple app launcher on the home screen.","zh":"这款手机的主屏幕带有一个简洁的应用启动器。"},{"en":"They used a ball launcher to train the dog.","zh":"他们用抛球器训练狗。"}]}],"synonyms":["starters","initiators","catapults","launch devices"],"phonetic":"/ˈlɔntʃɚ/","extraExplanation":["“Launchers”是“launcher”的复数形式。常见语境包括：军事（missile/rocket launcher）、科技（app launcher=应用启动器）、体育与训练（ball launcher=抛球器/发球机）。在英文里也常见作复合名词，如“grenade launcher（榴弹发射器）”。"]}
{"word":"launches","summary":{"en":"“Launches” can mean “starts/introduces” or “fires/sends out” (as a verb), and it can also be the plural noun for “launch events/beginnings.”","zh":"“launches” 可作动词表示“推出/启动”或“发射/投出”；也可作名词复数，表示“发布/启动活动或开端”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) to start or introduce something new (a product, project, campaign, etc.)","zh":"（动词第三人称单数）推出；发起；启动（新产品、项目、活动等）"},"examples":[{"en":"She launches a new marketing campaign every spring.","zh":"她每年春天都会发起一项新的营销活动。"},{"en":"The company launches its new app next week.","zh":"这家公司下周将推出新应用。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) to send something out or up with force; to set something in motion (a rocket, an attack, a ship, etc.)","zh":"（动词第三人称单数）发射；投掷；使迅速开始（火箭、攻击、船只等）"},"examples":[{"en":"The space agency launches a rocket from Florida.","zh":"航天机构从佛罗里达发射火箭。"},{"en":"He launches the ball across the field.","zh":"他把球用力掷过球场。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) the beginnings or first public appearances of things (product launches, launches of programs)","zh":"（名词复数）发布会；推出/启动事件（如产品发布、项目启动）"},"examples":[{"en":"Their recent launches have attracted a lot of attention.","zh":"他们最近的发布活动吸引了很多关注。"},{"en":"The museum planned several launches for its new exhibition series.","zh":"博物馆为新的展览系列策划了几场发布活动。"}]}],"synonyms":["starts","initiates","introduces","unveils","rolls out","fires","shoots","deploys"],"phonetic":"/ˈlɔntʃɪz/","extraExplanation":["“launches” 常见两种用法：\n1) 动词：launch 的第三人称单数（he/she/it launches）。\n2) 名词：launch 的复数（two launches / several launches）。\n拼写上加 -es 是因为 launch 以 -ch 结尾，复数或第三人称单数一般加 -es。"]}
{"word":"launchful","summary":{"en":"Launchful is a rare, informal adjective meaning “full of launches” or “ready to launch.”","zh":"Launchful 是较罕见、偏口语的形容词，可表示“发布很多/发布密集”，或“已具备发布条件、可发布的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) full of launches or characterized by frequent launching (of products, projects, campaigns, etc.).","zh":"（罕见/非标准）“充满发布/发射”的；以频繁推出（产品、项目、活动等）为特征的。"},"examples":[{"en":"It was a launchful month for the company, with three new apps released.","zh":"对这家公司来说那是个“发布密集”的月份，一口气上线了三款新应用。"},{"en":"The team planned a launchful schedule leading up to the holiday season.","zh":"团队为假日季前制定了一个“连续上新/密集发布”的日程。"}]},{"partOfSpeech":"adj.","definition":{"en":"ready or suitable for launching; launch-ready (usually describing a product, plan, or campaign).","zh":"适合发布/发射的；已具备发布条件的（常形容产品、计划或宣传活动）。"},"examples":[{"en":"After the final test, the feature was launchful by Friday.","zh":"最后一次测试完成后，这项功能在周五前就达到可发布状态了。"},{"en":"Make sure the marketing materials are launchful before the announcement.","zh":"发布公告前要确保营销素材已经准备到位、可以直接上线。"}]}],"synonyms":["launch-ready","ready to launch","launch-heavy","release-heavy","promo-packed"],"phonetic":"/ˈlɔːntʃ.fəl/","extraExplanation":["“launchful”不是常见标准词汇，多见于临时造词或品牌/产品语境，用来强调“发布很多”或“具备发布条件”。正式写作中更常用：launch-heavy（发布很多的）、full of launches、launch-ready（可发布的）、ready to launch。"]}
{"word":"launching","summary":{"en":"“Launching” most commonly refers to starting or introducing something (a product, plan, event) or sending something off (like a rocket).","zh":"“Launching”最常指“启动/推出”（产品、计划、活动）或“发射/下水”（火箭、船等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of starting or sending something out (such as a product, event, or spacecraft); the beginning of something","zh":"发射；推出；启动（如产品、活动或航天器）；某事的开始"},"examples":[{"en":"The company is preparing for the launching of its new app next month.","zh":"这家公司正在为下个月新应用的推出做准备。"},{"en":"We watched the launching of the rocket on live TV.","zh":"我们在电视直播中观看了火箭发射。"}]},{"partOfSpeech":"adj.","definition":{"en":"starting to do something energetic or important; beginning strongly","zh":"开始做一件有力度或重要的事；强势开局"},"examples":[{"en":"After a short break, she came back launching into a new project.","zh":"短暂休息后，她回来就投入到一个新项目中。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “launch”: beginning or sending something into motion; introducing something to the public","zh":"“launch”的现在分词：使开始/使发射；向公众推出（产品、计划等）"},"examples":[{"en":"They are launching a new advertising campaign this week.","zh":"他们本周正在启动一场新的广告宣传活动。"},{"en":"The crew is launching the boat into the water.","zh":"船员正在把船下水。"}]}],"synonyms":["starting","beginning","introducing","unveiling","initiating"],"phonetic":"/ˈlɔntʃɪŋ/","extraExplanation":["“launching”既可以作名词（the launching of...），也常作为动词“launch”的现在分词，用在进行时（are launching）或作定语（a launching pad 发射台）。","常见搭配：launch a product/plan/campaign（推出/启动）；launch into something（突然开始做某事，常带“急切地/滔滔不绝地”进入状态）。"]}
{"word":"launchings","summary":{"en":"“Launchings” means multiple launches—events or actions where something is officially introduced, started, or sent out (like products, projects, ships, or satellites).","zh":"“Launchings”指多次“推出/启动/发射”的事件或行为，如新品发布、项目启动、船舶下水或卫星发射。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of launching) events or moments when something is officially started or sent out, such as a new product, a project, a website, or a ship.","zh":"（launching 的复数）指某事物被正式推出、启动或下水的多个事件/时刻，例如新品发布、项目启动、网站上线或船舶下水。"},"examples":[{"en":"The company scheduled several launchings this year, including a new app and a new smartwatch.","zh":"公司今年安排了多次发布活动，包括一款新应用和一款新智能手表。"},{"en":"Two ship launchings were held at the dock in the same month.","zh":"同一个月里，码头举行了两次船舶下水仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"the actions of launching things (sending them out, starting them, or putting them into motion), viewed as repeated activities.","zh":"指“发射/启动/推出”的一系列行为或反复进行的动作。"},"examples":[{"en":"Frequent launchings can test a team’s ability to handle pressure.","zh":"频繁的发布/启动会考验团队的抗压能力。"},{"en":"The launchings of small satellites have become more common in recent years.","zh":"近年来，小型卫星的发射变得更常见。"}]}],"synonyms":["launches","rollouts","introductions","debuts"],"phonetic":"/ˈlɔntʃɪŋz/","extraExplanation":["“launching”既可用于商业语境（product launching 新品发布/上市），也常见于航海语境（ship launching 船舶下水）。在公司新闻里，复数“launchings”通常指多场发布会或多个项目的上线节点。"]}
{"word":"launchpad","summary":{"en":"Launchpad means a physical platform for launching rockets, and figuratively a starting point that helps something grow quickly.","zh":"Launchpad既指火箭等的发射台，也可比喻促进事业或计划快速发展的起点/跳板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A platform or place used to start a rocket, spacecraft, or other launch.","zh":"（火箭、航天器等的）发射台；发射场地"},"examples":[{"en":"The rocket rolled out to the launchpad before sunrise.","zh":"火箭在日出前被运到发射台。"},{"en":"Engineers inspected the launchpad for safety issues.","zh":"工程师检查发射台是否有安全隐患。"}]},{"partOfSpeech":"n.","definition":{"en":"A starting point that helps something develop quickly, such as a career, project, or new idea.","zh":"（比喻）起点；跳板；助推器"},"examples":[{"en":"That internship was a launchpad for her career in design.","zh":"那次实习成了她设计职业生涯的跳板。"},{"en":"The free trial can be a launchpad for building a loyal customer base.","zh":"免费试用可以成为建立忠实客户群的起点。"}]}],"synonyms":["launching pad","platform","springboard","starting point"],"phonetic":"/ˈlɔntʃˌpæd/","extraExplanation":["“launchpad”原本指航天领域的“发射台”。后来在商业、学习与职业语境中被广泛借用，表示“让你更快起飞的起点/资源”。常见搭配：a launchpad for sth（某事的跳板/起点）。"]}
{"word":"launchplex","summary":{"en":"“Launchplex” usually means a rocket launch complex (informal/branding-style).","zh":"“launchplex”通常指火箭发射综合体（偏非正式或品牌式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a launch complex; a group of facilities (pads, towers, control buildings, etc.) used to launch rockets or spacecraft (often used informally or as a brand-like term).","zh":"（火箭/航天器的）发射综合体；用于发射的成套设施群（常为非正式用法或品牌式称呼）。"},"examples":[{"en":"The rocket was rolled out to the launchplex early in the morning.","zh":"火箭一大早被运送到发射综合体。"},{"en":"Engineers tested the fuel lines across the entire launchplex.","zh":"工程师在整个发射综合体内测试了燃料管线。"}]}],"synonyms":["launch complex","spaceport complex","launch facility"],"phonetic":"/ˈlɔntʃˌplɛks/","extraExplanation":["“launchplex”不是特别标准、常见的词，更常见的正式说法是“launch complex”。它通常被理解为由“launch（发射）+ -plex（来自complex/complexity，表示‘综合体/多设施的集合’）”构成的混成词，可能出现在新闻、口语、宣传文案或某些机构/项目的名称中。"]}
{"word":"launchway","summary":{"en":"a ramp for launching a boat into water","zh":"船舶下水用的斜坡/滑道"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sloped ramp or track used to launch a boat or ship into the water; a slipway","zh":"（把船下水用的）下水滑道；船台斜坡（同 slipway）"},"examples":[{"en":"The workers greased the launchway before sliding the boat into the river.","zh":"工人们在把船滑入河里之前，先给下水滑道涂了油。"},{"en":"After repairs, the vessel was moved back onto the launchway for relaunching.","zh":"修好后，这艘船被移回下水滑道，准备再次下水。"}]}],"synonyms":["slipway","boat ramp","launch ramp","ramp"],"phonetic":"/ˈlɔntʃˌweɪ/","extraExplanation":["用法提示：launchway 不是特别常见，更常用的说法是 slipway（英式更常见）或 boat ramp（口语、常见于美式英语，偏“拖车下水坡道”）。如果你在写更自然的现代英语，通常优先选 slipway/boat ramp。"],"etymology":"由 launch（使下水/发射）+ way（通道/道路）构成，字面意思是“用于下水的通道”。在航海与造船语境中常指船舶下水用的斜坡或滑道。","mnemonic":["记忆法：launch=“发射/下水”，way=“路”。合起来就是“让船下水的路/通道”。","联想：船从“坡道”滑下去 → launch（下水）+ way（路）= 下水滑道。"]}
{"word":"launchways","summary":{"en":"Launchways are ramps or tracks used to launch boats/ships into the water.","zh":"Launchways 指用于让船只下水的滑道或坡道（launchway 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of launchway: a ramp or track (especially at a shipyard) used for sliding a boat or ship into the water when it is launched.","zh":"launchway 的复数：用于“下水/发射”的坡道或轨道（尤指造船厂的下水滑道），让船只在下水时沿着滑入水中。"},"examples":[{"en":"The shipyard rebuilt the launchways before the new vessel’s launch.","zh":"造船厂在新船下水前重建了下水滑道。"},{"en":"Workers cleared debris from the launchways to ensure a smooth slide into the river.","zh":"工人清理下水滑道上的杂物，确保船体能顺利滑入河中。"}]}],"synonyms":["slipways","launch ramps","launching ramps","slideways"],"phonetic":"ˈlɔntʃ.weɪz","extraExplanation":["“launchway”在日常英语里不算常见，更常见的说法是 slipway / launching ramp / launch ramp。它多见于造船、船坞、工程等语境。"]}
{"word":"laund","summary":{"en":"“laund” is an archaic word meaning a grassy forest clearing (a glade).","zh":"“laund”是古义词，指森林中的草地空地（林间空地、glade）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A grassy clearing or open space in a forest; a glade.","zh":"（古义/文）森林中的草地空地；林间空地。"},"examples":[{"en":"They rested in a quiet laund before continuing through the woods.","zh":"他们在一片安静的林间空地休息，然后继续穿过树林。"},{"en":"In old poems, a deer may appear in a green laund.","zh":"在古诗文里，鹿可能出现在绿色的林间空地上。"}]}],"synonyms":["glade","clearing","woodland clearing"],"phonetic":"/lɔnd/","extraExplanation":["“laund”是非常少见的古英语/中古英语用词，多见于旧文学或地名研究语境。现代英语里更常用的是glade、clearing。","它与现代词“lawn（草坪）”在词源上有关：都来自表示“林中空地/草地”的旧词源，因此读到“laund”时可以联想到“lawn”的意象，但注意它在当代日常英语里几乎不用。"]}
{"word":"launder","summary":{"en":"“Launder” means to wash clothes; it can also mean to make illegal money or unpleasant information seem clean/acceptable.","zh":"“launder”指洗衣；也可指“洗钱”或粉饰信息，让非法或不体面的东西看起来合法/可接受。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wash and clean clothes or other fabric items (often by washing and drying them)","zh":"（通过洗涤、晾干/烘干等）洗净衣物或其他织物"},"examples":[{"en":"I need to launder my shirts before Monday.","zh":"我得在周一前把衬衫洗好。"},{"en":"Some fabrics should be laundered in cold water.","zh":"有些布料应该用冷水洗。"}]},{"partOfSpeech":"v.","definition":{"en":"to hide the illegal origin of money by moving it through businesses or banks so it seems legal (often: launder money)","zh":"（把非法所得通过交易或金融操作）“洗白”，使其看起来合法（常用：launder money）"},"examples":[{"en":"The gang tried to launder money through a fake company.","zh":"该团伙试图通过一家空壳公司洗钱。"},{"en":"Banks must report suspicious activity that could involve money laundering.","zh":"银行必须上报可能涉及洗钱的可疑活动。"}]},{"partOfSpeech":"v.","definition":{"en":"to change words, facts, or information to make something sound more acceptable or less shocking (often: launder the truth / launder language)","zh":"（通过改写/修饰）粉饰或“洗白”说法，使其更体面、不那么刺耳（常见：launder the truth / launder language）"},"examples":[{"en":"The report seemed to launder the facts to protect the company’s image.","zh":"这份报告似乎在粉饰事实，以保护公司的形象。"},{"en":"Some officials laundered harsh policies with soft language.","zh":"有些官员用温和措辞来包装严厉政策。"}]}],"synonyms":["wash","clean","do the laundry","money-launder","sanitize"],"phonetic":"/ˈlɔndɚ/","extraExplanation":["“launder”原意与“洗衣”有关；引申到“洗钱”时，核心比喻是把“脏钱”通过一连串交易“洗干净”，让来源看起来合法。","在新闻与法律语境中，“money laundering（洗钱）”非常常见；日常生活中谈洗衣也会用，但更口语的说法常是“do the laundry（洗衣服）”。"]}
{"word":"launderability","summary":{"en":"Launderability means how well something can be washed repeatedly without damage or loss of quality.","zh":"Launderability 指衣物或材料经多次洗涤后仍不易损坏、变形或褪色的“耐洗性/可洗性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of a fabric, garment, or material that shows how well it can be washed (laundered) repeatedly without shrinking, fading, losing shape, or being damaged","zh":"（织物/衣物/材料的）可洗性；耐洗性：指反复洗涤后仍能保持尺寸、颜色与形状、不易受损的性能"},"examples":[{"en":"The manufacturer improved the launderability of the shirts by using colorfast dye.","zh":"厂家使用耐褪色染料，提高了衬衫的耐洗性。"},{"en":"Check the label for care instructions and launderability before buying the jacket.","zh":"购买夹克前先查看洗护说明和耐洗程度。"},{"en":"This towel has good launderability, even after many hot washes.","zh":"这条毛巾耐洗性很好，即使多次高温清洗也不受影响。"}]}],"synonyms":["washability","cleanability","durability (in washing context)"],"phonetic":"/ˌlɔndr̩əˈbɪləti/","extraExplanation":["该词多见于纺织、服装与材料测试领域，常和“shrinkage（缩水）/colorfastness（耐褪色）/wrinkle resistance（抗皱）/durability（耐用性）”一起出现，用来评估产品在日常洗涤中的表现。","词形来源：launder（洗衣）+ -ability（……的能力），意思直观但偏专业，日常口语更常说“washes well / easy to wash / holds up in the wash（很耐洗）”。"]}
{"word":"launderable","summary":{"en":"Launderable means “washable”—able to be cleaned by laundering without damage.","zh":"launderable 指“可清洗的”，即能通过洗涤清洁且不易洗坏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be washed (usually in a washing machine) without being ruined; washable.","zh":"可清洗的；（通常指）可机洗且不易洗坏的。"},"examples":[{"en":"Make sure the cover is launderable before you buy it.","zh":"购买前先确认这个罩子是否可清洗。"},{"en":"The jacket is water-resistant, but it isn’t fully launderable.","zh":"这件夹克防水，但并不适合彻底清洗。"},{"en":"We need launderable uniforms for staff who work in the kitchen.","zh":"我们需要给在厨房工作的员工配发可清洗的制服。"}]}],"synonyms":["washable","machine-washable","easy-care"],"phonetic":"/ˈlɔndərəbəl/","extraExplanation":["“launderable”常见于产品标签、酒店/医疗/餐饮等行业的说明文字，强调“可以反复洗涤、便于清洁维护”。日常口语里更常说“washable”或“machine-washable”。","词形来源：launder（洗衣）+ -able（可以……的），类似构词还有“recyclable（可回收的）”“readable（可读的）”。"]}
{"word":"laundered","summary":{"en":"“Laundered” most commonly means cleaned by washing; it can also mean money that was made to look legal (“laundered money”) or information that was edited to hide the truth.","zh":"“laundered”常指“洗净的”。也可指“洗钱后的（资金）”，或指信息被“粉饰/过滤”以掩盖真相。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Washed and cleaned (especially clothes, sheets, or other fabric).","zh":"（尤指衣物、床单等布料）已洗净的；已送洗并清洁过的。"},"examples":[{"en":"I picked up the laundered shirts from the dry cleaner.","zh":"我从干洗店取回了洗好的衬衫。"},{"en":"All laundered linens must be stored in a clean, dry place.","zh":"所有洗净的床品必须存放在干净、干燥的地方。"}]},{"partOfSpeech":"vt.","definition":{"en":"Made illegally obtained money seem legitimate by moving it through businesses or accounts.","zh":"（把非法所得）“洗白”；通过企业或账户转移，使其看起来合法。"},"examples":[{"en":"The gang laundered cash through a chain of small businesses.","zh":"该团伙通过一系列小企业把现金洗白。"},{"en":"Authorities believe the funds were laundered overseas.","zh":"当局认为这笔资金被转移到海外进行洗钱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Changed or filtered to hide the truth or make something look better (often said of information, reports, or images).","zh":"（信息、报告或图片等）被“粉饰/过滤”；为掩盖真相或美化而改动。"},"examples":[{"en":"The report was laundered to remove any criticism of the policy.","zh":"这份报告被“粉饰”了，删去了对该政策的任何批评。"},{"en":"Some photos were laundered before being released to the press.","zh":"有些照片在发布给媒体前被处理过（以掩盖/美化）。"}]}],"synonyms":["washed","cleaned","laundried","money-laundered","sanitized","doctored","whitewashed"],"phonetic":"/ˈlɔndɚd/","extraExplanation":["“launder”原义是“洗衣服”。引申义“洗钱”很常见：把来路不明的钱经过多次转账、公司交易等“洗一遍”，让它看起来像合法收入。","“laundered information/words”是比喻用法，意思是把内容“洗干净”：删去敏感点、弱化立场、重新包装，让它更容易被接受。常见于新闻、政治、公关语境。"]}
{"word":"launderer","summary":{"en":"A launderer is usually a person/business that washes clothes; in legal/news contexts it can also mean a money launderer.","zh":"“Launderer”通常指洗衣从业者/洗衣店；在法律或新闻语境中也可指“洗钱者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or business that washes and irons clothes for others; someone who does laundry professionally","zh":"洗衣工；洗衣店经营者；以洗涤、熨烫衣物为业的人（或机构）"},"examples":[{"en":"I take my shirts to a launderer near my office.","zh":"我把衬衫拿到办公室附近的一家洗衣店去洗。"},{"en":"The hotel uses an outside launderer for all its linens.","zh":"这家酒店的所有床单和毛巾都交给外部洗衣服务处理。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who launders money; someone who makes illegally obtained money appear legal","zh":"洗钱者；把非法所得“漂白”成合法资金的人"},"examples":[{"en":"The report described how the launderer moved money through shell companies.","zh":"报告描述了洗钱者如何通过空壳公司转移资金。"},{"en":"Authorities arrested a suspected launderer involved in online fraud.","zh":"当局逮捕了一名涉嫌参与网络诈骗的洗钱者。"}]}],"synonyms":["laundry service","dry cleaner","money launderer"],"phonetic":"/ˈlɔndərər/","extraExplanation":["“Launderer”来自动词“launder”（洗涤）。在新闻和法律语境里，“money launderer / launderer”常指“洗钱者”。日常生活中更常说“dry cleaner”（干洗店/干洗商）或“laundry service”（洗衣服务），而不是经常用“launderer”来指洗衣店。","“Money laundering（洗钱）”这个比喻来源于“把脏东西洗干净”：把“脏钱”（非法所得）通过多次转账、公司交易等方式“洗”成看起来合法的资金来源。"]}
{"word":"launderers","summary":{"en":"“Launderers” are people who wash clothes professionally, or people who hide illegal money by making it appear legal.","zh":"“launderers”可指从事洗衣工作的人员，也可指通过手段掩盖非法资金来源的洗钱者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people whose job is to wash and iron clothes and linens (often professionally)","zh":"洗衣工；洗熨衣物的人（常指从事洗衣行业的工作人员）"},"examples":[{"en":"The hotel hires launderers to clean towels and bed sheets every day.","zh":"酒店雇洗衣工每天清洗毛巾和床单。"},{"en":"In the past, many launderers worked long hours by hand, without modern machines.","zh":"过去很多洗衣工没有现代机器，只能靠手工长时间工作。"}]},{"partOfSpeech":"n.","definition":{"en":"people who hide the illegal origin of money by making it seem legal (money launderers)","zh":"（资金）洗钱者；把非法所得“洗白”的人"},"examples":[{"en":"The police arrested several launderers who moved criminal money through fake businesses.","zh":"警方逮捕了几名通过假公司转移犯罪资金的洗钱者。"},{"en":"Banks must report suspicious activity to help stop launderers.","zh":"银行必须报告可疑活动，以帮助阻止洗钱者。"}]}],"synonyms":["washers","laundry workers","money launderers","laundering criminals"],"phonetic":"/ˈlɔndərərz/","extraExplanation":["“launderers”是名词复数，单数是“launderer”。它既可指“洗衣的人”，也常在新闻、法律语境中指“洗钱的人”。","“money laundering（洗钱）”这个说法来自“把脏钱洗干净”的比喻：通过一连串交易或公司把钱的来源伪装成合法。"]}
{"word":"launderess","summary":{"en":"A launderess is a woman who washes and irons clothes as a job, especially in earlier times.","zh":"launderess 指以洗衣、熨衣为业的女性（尤指过去的说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman whose job is washing and ironing clothes (especially in the past)","zh":"洗衣女工；以洗涤、熨烫衣物为业的女性（尤指过去）"},"examples":[{"en":"In the old days, many families hired a launderess to wash sheets and uniforms.","zh":"过去许多家庭会雇洗衣女工来清洗床单和制服。"},{"en":"She worked as a launderess and spent long hours scrubbing clothes by hand.","zh":"她做洗衣女工，常常要花很长时间用手搓洗衣物。"}]}],"synonyms":["laundry worker","washerwoman"],"phonetic":"/ˈlɔnd(ə)rəs/","extraExplanation":["“launderess”是偏旧式的说法，带有明显的历史感与阶层/劳动背景；现代英语更常用中性表达如“laundry worker”“laundress”（较少见）或直接说“works in a laundry”。","在文学与历史叙述中，“launderess”常用来营造19世纪到20世纪早期的社会生活氛围，强调体力劳动、服务行业与女性就业处境。"]}
{"word":"launderesses","summary":{"en":"Launderesses are women who wash (and often iron) clothes for a living; it’s an older, gender-specific term.","zh":"launderesses 指以洗（并常熨烫）衣物为职业的女性；这是较旧且带性别指向的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman whose job is to wash and often iron clothes and linens, especially for other people (an older, gender-specific word)","zh":"洗衣女工；为他人洗涤（并常常熨烫）衣物和床单的女性（较旧、带性别指向的用词）"},"examples":[{"en":"In the old novel, the launderesses worked from dawn to dusk by the river.","zh":"在那部旧小说里，洗衣女工们在河边从黎明忙到黄昏。"},{"en":"The hotel hired several launderesses to handle sheets and towels.","zh":"那家酒店雇了几位洗衣女工来处理床单和毛巾。"}]}],"synonyms":["washerwomen","laundry workers","laundrywomen"],"phonetic":"/ˈlɑndərəs/","extraExplanation":["“launderess”是传统上指“女性洗衣工”的词，常见于19世纪到20世纪早期的语境。现代英语里更常用性别中立的说法，如“laundry worker”“laundress”（较少见）或直接说“someone who does the laundry”。","历史上洗衣工作很辛苦，许多文学作品会用“launderess/washerwoman”来描写劳动阶层女性的生活处境。"]}
{"word":"launderette","summary":{"en":"A British English word for a self-service laundry shop (laundromat).","zh":"英式英语：自助洗衣店（美式多说 laundromat）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shop where you can wash and dry your clothes using coin- or card-operated machines (a laundromat).","zh":"（通常指小型的）自助洗衣店；可用投币或刷卡的洗衣机、烘干机洗衣服（相当于美式英语 laundromat）。"},"examples":[{"en":"I’m going to the launderette to wash my sheets.","zh":"我要去自助洗衣店洗床单。"},{"en":"There’s a launderette next to the supermarket.","zh":"超市旁边有一家自助洗衣店。"},{"en":"The launderette was busy on Sunday evening.","zh":"周日晚上自助洗衣店很忙。"}]}],"synonyms":["laundromat","coin laundry","self-service laundry"],"phonetic":"/ˌlɔːnˈdret/","extraExplanation":["“launderette”更常见于英式英语；在美式英语里更常说“laundromat”。两者意思基本相同。","词尾“-ette”常有“较小/小型”的感觉（也常见于英式商品或店铺名称），所以“launderette”听起来像“较小的洗衣店”。"]}
{"word":"laundering","summary":{"en":"Laundering usually means washing clothes; in finance/crime it can mean hiding the origin of money (money laundering).","zh":"laundering 通常指洗衣；在金融/犯罪语境中也可指“洗钱”，即掩盖资金来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of washing and cleaning clothes, sheets, etc.","zh":"（衣物、床单等的）洗涤；洗衣（的过程）"},"examples":[{"en":"I’m doing laundry this weekend, so I can’t go out.","zh":"我这周末要洗衣服，所以不能出去。"},{"en":"The hotel offers a same-day laundering service.","zh":"这家酒店提供当天洗衣服务。"}]},{"partOfSpeech":"n.","definition":{"en":"The illegal act of hiding where money came from by moving it through businesses or banks (money laundering).","zh":"（非法）洗钱：通过企业或银行等转移资金来掩盖钱款来源"},"examples":[{"en":"The police investigated the company for money laundering.","zh":"警方因洗钱问题调查了这家公司。"},{"en":"Banks must report suspicious transactions to prevent laundering.","zh":"银行必须上报可疑交易以防止洗钱。"}]},{"partOfSpeech":"v.","definition":{"en":"To wash and clean (clothes, fabric, etc.).","zh":"洗涤；洗（衣物、布料等）"},"examples":[{"en":"These shirts need laundering before you wear them.","zh":"这些衬衫穿之前需要先洗。"},{"en":"Delicate fabrics should be laundered gently.","zh":"精细面料应轻柔洗涤。"}]},{"partOfSpeech":"v.","definition":{"en":"To hide the true origin of money by moving it through different accounts or businesses (to launder money).","zh":"（非法）洗钱：通过多次转账或交易掩盖资金来源"},"examples":[{"en":"They were accused of laundering money through fake companies.","zh":"他们被指控通过空壳公司洗钱。"},{"en":"Criminals often launder profits to make them look legal.","zh":"犯罪分子常把非法收益“洗白”，让它看起来合法。"}]}],"synonyms":["washing","cleaning","laundry (context: clothes)","money laundering (context: crime)","concealing (context: money)"],"phonetic":"/ˈlɔndərɪŋ/","extraExplanation":["“launder”原意是“洗衣”，来源与“洗衣店/洗衣女工”的概念有关；后来引申出“money laundering（洗钱）”，把“把脏东西洗干净”这个比喻用在“把非法资金伪装成合法资金”上。","日常口语里更常说“do the laundry（洗衣服）”；“laundering”更正式，常见于说明书（laundering instructions）或服务说明（laundering service）。"]}
{"word":"launderings","summary":{"en":"“Launderings” is the plural of “laundering,” meaning either clothes being washed/ the washing process, or (in legal contexts) multiple acts of money laundering.","zh":"“launderings”是“laundering”的复数，可指要洗的衣物/洗涤过程；在法律语境中也可指多起“洗钱”行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clothes or linens that are being washed, or the act/process of washing them (plural form).","zh":"要洗的衣物/床单等，或“洗涤”的过程（复数形式）。"},"examples":[{"en":"Please put the launderings in the basket before you leave.","zh":"你离开前请把要洗的衣物放进篮子里。"},{"en":"The hotel collects launderings every morning.","zh":"酒店每天早上收取要洗的衣物。"}]},{"partOfSpeech":"n.","definition":{"en":"Acts of hiding the illegal origin of money (as in money laundering); plural form.","zh":"（如“洗钱”）指掩盖非法资金来源的行为（复数形式）。"},"examples":[{"en":"The investigation uncovered several launderings tied to the same network.","zh":"调查发现多起与同一网络有关的洗钱行为。"},{"en":"Banks must report suspicious transactions to prevent launderings.","zh":"银行必须上报可疑交易，以防止洗钱行为。"}]}],"synonyms":["laundry","washing","wash","money laundering","illicit fund transfers"],"phonetic":"/ˈlɔndərɪŋz/","extraExplanation":["“launderings”较少单独出现，更常见的形式是：laundering（不可数：洗涤/洗钱的行为）或 laundry（衣物/洗好的衣物/要洗的衣物）。在法律与新闻语境中，money laundering（洗钱）非常常见。"]}
{"word":"launders","summary":{"en":"“Launders” usually means “washes clothes/fabric,” and it can also mean “launders money” (hides illegal money by making it look legal).","zh":"“launders”通常指“洗衣/清洗布料”；也可指“洗钱”，即把非法资金伪装成合法来源。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular of “launder”: to wash and clean clothes or fabric, usually with water and soap","zh":"“launder”的第三人称单数：洗涤、清洗衣物或布料（通常用水和清洁剂）"},"examples":[{"en":"She launders her uniforms every weekend.","zh":"她每个周末都会洗她的制服。"},{"en":"This service launders bed sheets for hotels.","zh":"这家服务公司为酒店清洗床单。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “launder”: to hide the illegal origin of money by moving it through seemingly legal businesses or accounts (money laundering)","zh":"“launder”的第三人称单数：通过看似合法的渠道转移资金，以掩盖非法来源（洗钱）"},"examples":[{"en":"The report says the group launders money through shell companies.","zh":"报告称该团伙通过空壳公司洗钱。"},{"en":"The bank flags accounts that might be used to launder funds.","zh":"银行会标记可能被用来洗钱的账户。"}]}],"synonyms":["washes","cleans","does the laundry","dry-cleans","money-launders"],"phonetic":"/ˈlɔndərz/","extraExplanation":["“launder money（洗钱）”是一个比喻：像把“脏衣服洗干净”一样，把“脏钱”（非法所得）伪装成合法收入。常见搭配：launder money / launder funds；名词形式是 money laundering。","日常语境里，launder 更常指“洗衣/送洗”。如果只是说家庭洗衣，更口语的动词也可以用 do the laundry。"]}
{"word":"laundress","summary":{"en":"A laundress is a woman who washes (and often irons) clothes, especially as a job; the word is common in historical or literary contexts.","zh":"laundress 指以洗衣（常包括熨衣）为业的女性，多见于历史或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman whose job is washing and ironing clothes, often for other people","zh":"洗衣女工；（尤指为他人）洗衣、熨衣的女性"},"examples":[{"en":"The hotel hired a laundress to wash and press the sheets every day.","zh":"酒店雇了一位洗衣女工每天清洗并熨烫床单。"},{"en":"In the novel, the laundress knows everyone’s secrets because she handles their clothes.","zh":"在小说里，洗衣女工因为接触大家的衣物而知道许多人的秘密。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a woman who washed clothes for a household, sometimes living and working as domestic staff","zh":"（历史用法）为一个家庭洗衣的女仆/佣工（有时住在雇主家中工作）"},"examples":[{"en":"In the 1800s, many families employed a laundress once a week.","zh":"在19世纪，许多家庭每周会雇一位洗衣女工来洗衣。"},{"en":"She began work as a laundress before saving enough to open her own shop.","zh":"她先做洗衣女工，后来攒够钱开了自己的小店。"}]}],"synonyms":["laundry worker","washerwoman","laundrywoman","laundromat attendant"],"phonetic":"/ˈlɔndrəs/","extraExplanation":["“laundress”是性别标记明显的词，现代英语里更常用更中性的说法：laundry worker / laundromat attendant / person who does the laundry。","在文学或历史语境中，“laundress”常被用来营造旧时代生活氛围，也可能暗示阶层差异、辛劳的体力劳动等社会背景。"]}
{"word":"laundresses","summary":{"en":"“Laundresses” is the plural of “laundress”: women who wash and care for other people’s clothes and linens as a job.","zh":"“laundresses”是“laundress”的复数：指以洗涤、护理他人衣物和布草为职业的女性洗衣工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women whose job is to wash, dry, iron, and sometimes mend clothes and linens for other people.","zh":"（通常指女性）洗衣工；为他人清洗、晾干、熨烫（有时还修补）衣物和布草的人。"},"examples":[{"en":"In the past, many laundresses worked long hours washing clothes by hand.","zh":"在过去，许多洗衣工需要长时间用手洗衣服。"},{"en":"The hotel hired laundresses to handle sheets, towels, and uniforms.","zh":"这家酒店雇了洗衣工来处理床单、毛巾和制服。"},{"en":"She found work as a laundress to support her family.","zh":"她找到洗衣工的工作来养家。"}]}],"synonyms":["laundry workers","laundry attendants","washwomen"],"phonetic":"/ˈlɔndrəˌsɪz/","extraExplanation":["“laundress”是“launder”（洗衣）的名词形式，传统上指女性从事洗衣这一职业；对应的男性形式较少见，有时会用“launderman”，但现代英语更常用性别中性的“laundry worker / laundry attendant”。","在文学与历史语境中，“laundress”常出现在19世纪及更早时期的社会描写里，反映当时劳工阶层与家务劳动的现实。"]}
{"word":"laundrette","summary":{"en":"A British-English word for a self-service, coin-operated laundry shop.","zh":"英式英语中表示“自助投币洗衣店”的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shop where people wash and dry clothes using coin-operated machines; a self-service laundry (common in British English).","zh":"（英式英语）自助洗衣店；投币洗衣店（用自助洗衣机和烘干机洗衣服的地方）。"},"examples":[{"en":"I’m going to the laundrette to wash my sheets.","zh":"我要去自助洗衣店洗床单。"},{"en":"There’s a laundrette next to the supermarket.","zh":"超市旁边有一家自助洗衣店。"}]}],"synonyms":["laundromat","self-service laundry","coin laundry"],"phonetic":"/lɔnˈdrɛt/","extraExplanation":["“Laundrette”主要用于英式英语；美式英语更常说“laundromat”。","词尾“-ette”常带有“小型/简化版”的感觉（如 kitchenette 小厨房），所以 laundrette 往往指社区里比较小的自助洗衣店。","文化提示：在英国的 laundrette 里通常是自助操作、自己带洗衣液并等待；有些店也会提供“service wash”（代洗代烘）等服务，具体看店铺。"]}
{"word":"laundrie","summary":{"en":"Laundry means clothes that need washing (or have been washed), or the place/service for washing clothes.","zh":"Laundry 指要洗（或已洗好）的衣物，也可指洗衣店或洗衣服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clothes, sheets, etc. that need to be washed or have just been washed.","zh":"（要洗的或刚洗好的）衣物、床单等；洗好的衣服"},"examples":[{"en":"I have a lot of laundry to do this weekend.","zh":"我这周末有很多衣服要洗。"},{"en":"She folded the clean laundry and put it away.","zh":"她把洗干净的衣服叠好收起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A place or service where clothes are washed and dried (for example, a laundromat or a business that washes clothes for you).","zh":"洗衣店；洗衣服务（如自助洗衣店或代洗服务）"},"examples":[{"en":"I dropped off my shirts at the laundry near my apartment.","zh":"我把衬衫送到我公寓附近的洗衣店去洗。"},{"en":"This hotel offers laundry service for guests.","zh":"这家酒店为住客提供洗衣服务。"}]}],"synonyms":["washing","washing-up (BrE, not for clothes)","laundromat (place)","dry cleaner (related, not the same)"],"phonetic":"/ˈlɔn.dri/","extraExplanation":["“laundrie”通常是“laundry”的拼写错误。标准拼写是 laundry。"]}
{"word":"laundried","summary":{"en":"washed and cleaned (of clothing or fabric items)","zh":"（衣物等）洗净并处理好的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"washed or cleaned in a laundry (especially clothes, sheets, etc.)","zh":"（尤指衣物、床单等）已洗过的；已送洗并清洁好的"},"examples":[{"en":"All uniforms must be laundered before the next shift.","zh":"所有制服在下一班前都必须洗好。"},{"en":"Please put your laundered clothes in the top drawer.","zh":"请把洗好的衣服放在最上面的抽屉里。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “launder”: to wash and iron clothes or other fabric items","zh":"“launder”的过去式/过去分词：洗（并熨烫）衣物或其他布织物"},"examples":[{"en":"She laundered the bedsheets every Saturday.","zh":"她每周六都洗床单。"},{"en":"The hotel has already laundered the towels.","zh":"酒店已经把毛巾洗好了。"}]}],"synonyms":["washed","cleaned","laundered","freshly washed"],"phonetic":"/ˈlɔndrid/","extraExplanation":["在日常英语里，形容衣物“洗好”的说法更常见的是 “washed”。“laundered”偏正式一些，常用于酒店、医院、工作场所规章或洗衣服务（laundry service）语境。","“launder”还有一个较不常见的引申义：清洗非法所得（launder money = 洗钱）。但“laundried”通常还是指“洗过衣物”，谈到“洗钱”更多用 “laundered” 修饰 money。"],"etymology":"源自英语 launder（洗衣），更早来自中古法语 *lavandier*（洗衣工/洗衣人），与拉丁语 *lavare*（清洗）同源；“-ed”表示过去式或过去分词。","mnemonic":["把 launder 联想成“laundry（洗衣房）”，laundri-ed = “洗衣房处理过的”→ 洗好的。","记词根联想：和拉丁语 lavare（洗）同源，可联想到“lava（熔岩）把东西冲刷干净”的画面（夸张记忆法）。"]}
{"word":"laundries","summary":{"en":"“Laundries” is the plural of “laundry,” meaning either laundry shops/services or batches of clothes to be washed.","zh":"“Laundries”是“laundry”的复数，可指“洗衣店/洗衣服务”，也可指“一批批要洗的衣物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of laundry: places/shops where clothes are washed and dried (laundry services)","zh":"laundry 的复数：洗衣店；提供洗涤、烘干等服务的地方（洗衣服务机构）"},"examples":[{"en":"There are several laundries near the subway station.","zh":"地铁站附近有好几家洗衣店。"},{"en":"Many laundries offer same-day service.","zh":"很多洗衣店提供当日取衣服务。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of laundry: loads or batches of clothes and linens that need washing","zh":"laundry 的复数：一堆/一批需要清洗的衣物（含床单、毛巾等）"},"examples":[{"en":"I did three laundries this weekend because we were traveling.","zh":"这周末我洗了三批衣服，因为我们刚旅行回来。"},{"en":"The hotel collects laundries from guests every morning.","zh":"酒店每天早上收取住客要洗的衣物。"}]}],"synonyms":["laundry services","cleaners","laundromats","loads (of laundry)"],"phonetic":"/ˈlɔndriz/","extraExplanation":["“Laundry”既可指“洗衣店/洗衣服务”，也可指“要洗的衣物”。在美式英语里，当表示“要洗的衣物”时常用不可数：do the laundry（洗衣服）。但在口语里也会把它当作可数来用，尤其是指“一批/一桶衣物”，因此会出现复数“laundries”。","如果你想表达“去自助洗衣店”，更常见的词是“laundromat”（美式）或“launderette”（英式）。"]}
{"word":"laundromat","summary":{"en":"A laundromat is a self-service place to wash and dry clothes with coin- or card-operated machines.","zh":"laundromat 指“自助洗衣店”，用投币或刷卡的机器自己洗衣、烘衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A self-service place where you wash and dry your clothes using coin- or card-operated machines.","zh":"自助洗衣店；用投币或刷卡机器自己洗烘衣物的地方。"},"examples":[{"en":"I’m going to the laundromat to wash my sheets.","zh":"我要去自助洗衣店洗床单。"},{"en":"This laundromat is open 24 hours, so we can do laundry late at night.","zh":"这家自助洗衣店24小时营业，所以我们晚上很晚也能洗衣服。"},{"en":"He brought a book to the laundromat while waiting for the dryer.","zh":"他去自助洗衣店时带了本书，等烘干的时候看。"}]}],"synonyms":["launderette","self-service laundry"],"phonetic":"/ˈlɔndrəˌmæt/","extraExplanation":["“Laundromat”在美式英语里很常见，常指“自助洗衣店”。英式英语更常说“launderette”。","在美国的城市生活中，很多公寓没有洗衣机/烘干机（no in-unit washer/dryer），所以去laundromat很普遍；有些店还提供代洗代烘服务（drop-off / wash-and-fold）。","词形上是“laundry（洗衣）+ -o- + mat（来自automat的缩略，表示自动化/自助店）”，因此带有“自助机器”的感觉。"]}
{"word":"laundromats","summary":{"en":"“Laundromats” are self-service laundry shops with washing machines and dryers.","zh":"“Laundromats”指配有洗衣机和烘干机的自助洗衣店（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a self-service place where you wash and dry clothes using coin- or card-operated machines (plural of “laundromat”).","zh":"自助洗衣店；投币/刷卡洗衣房（“laundromat”的复数）"},"examples":[{"en":"There are several laundromats near the subway station.","zh":"地铁站附近有好几家自助洗衣店。"},{"en":"Many students use laundromats because they don’t have a washer at home.","zh":"很多学生会去自助洗衣店，因为家里没有洗衣机。"},{"en":"I spent Sunday afternoon at the laundromat doing laundry.","zh":"我周日下午在自助洗衣店洗衣服。"}]}],"synonyms":["laundry","laundry room","self-service laundry"],"phonetic":"/ˈlɔndrəˌmæt/","extraExplanation":["在美国，“laundromat”很常见，尤其是在公寓楼里没有洗衣机/烘干机（in-unit laundry）的时候。传统上很多机器用硬币（coin-operated），现在也常见刷卡或手机支付。","常见搭配：do laundry（洗衣服）、a load of laundry（一桶/一批衣服）、washer（洗衣机）、dryer（烘干机）、detergent（洗衣液/洗衣粉）。"]}
{"word":"laundry","summary":{"en":"Laundry means clothes and other items to be washed, and it can also mean a place/service for washing clothes.","zh":"laundry 指要洗的衣物，也可指洗衣的场所或洗衣服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clothes, sheets, towels, etc. that need to be washed, are being washed, or have just been washed.","zh":"需要洗、正在洗或刚洗好的衣物（如衣服、床单、毛巾等）。"},"examples":[{"en":"I have a lot of laundry to do this weekend.","zh":"我这个周末有很多衣服要洗。"},{"en":"Can you fold the clean laundry, please?","zh":"你能把干净的衣服叠一下吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A place or business where clothes are washed and dried (a laundromat or laundry service).","zh":"洗衣的地方或洗衣店（自助洗衣店或洗衣服务）。"},"examples":[{"en":"I dropped my shirts off at the laundry near my apartment.","zh":"我把衬衫送到公寓附近的洗衣店了。"},{"en":"The hotel has a laundry on the ground floor.","zh":"这家酒店一楼有洗衣房。"}]}],"synonyms":["washing","laundromat (place)","wash (informal, for the task)"],"phonetic":"/ˈlɔn.dri/","extraExplanation":["在美式英语里，\"do the laundry\" 很常用，意思是“洗衣服”（包括洗、晾/烘、叠放等一整套流程），而不是字面上的“做洗衣”。","\"laundry\" 通常是不可数名词（a lot of laundry），但在谈“几件/几堆衣物”时也有人会说 “loads of laundry（几桶/几批衣服）”。"]}
{"word":"laundrymaid","summary":{"en":"A (now old-fashioned) word for a female worker/servant who does the laundry.","zh":"（较旧的说法）指负责洗衣、晾晒和整理衣物的女工/女仆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female servant or worker whose job is to wash, dry, and care for clothes and linens (laundry), especially in large households or hotels (an older, less common term)","zh":"洗衣女工；负责清洗、晾干并整理衣物和床单等（尤指在大型家庭或旅馆中工作的女仆；较旧、现较少用）"},"examples":[{"en":"In the old novel, the laundrymaid works from dawn to dusk washing sheets and uniforms.","zh":"在那本旧小说里，洗衣女工从清晨忙到黄昏，清洗床单和制服。"},{"en":"The hotel hired a laundrymaid to handle guests’ linens before modern laundry machines became common.","zh":"在现代洗衣设备普及之前，那家旅馆雇了一位洗衣女工来处理客人的布草。"},{"en":"She started as a laundrymaid and later became the head of housekeeping.","zh":"她从洗衣女工做起，后来成了客房部主管。"}]}],"synonyms":["laundress","laundry worker","washerwoman"],"phonetic":"/ˈlɔndriˌmeɪd/","extraExplanation":["这个词带有明显的历史色彩：在19世纪到20世纪早期，许多大户人家、旅馆或机构会雇“maid（女仆）”分工做家务，“laundrymaid”专门负责洗衣与熨烫。现代英语更常用更中性的说法，如 laundry worker、laundress（也偏旧）、housekeeper，或直接说 someone who does the laundry。"]}
{"word":"laundryman","summary":{"en":"A man who works in a laundry, washing and pressing clothes and linens.","zh":"在洗衣店/洗衣房从事清洗、烘干、熨烫等工作的男性工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man whose job is to wash, dry, and iron clothes and linens, especially as part of a laundry service.","zh":"洗衣工；（在洗衣店/洗衣房工作的）男洗衣员"},"examples":[{"en":"The laundryman picked up the hotel sheets in the morning and returned them clean in the afternoon.","zh":"洗衣工早上把酒店的床单取走，下午就洗好送回来了。"},{"en":"She left her suit with the laundryman to be pressed before the interview.","zh":"面试前，她把西装交给洗衣工熨烫。"}]}],"synonyms":["laundry worker","laundry attendant","launderer"],"phonetic":"ˈlɔndriˌmæn","extraExplanation":["“laundryman”带有性别指向，实际使用中更常见、更中性的说法是“laundry worker”或“laundry attendant”。在美式英语里，如果指自助洗衣店（laundromat）工作人员，也常说“laundromat attendant”。"]}
{"word":"laundrymen","summary":{"en":"“Laundrymen” means male workers who wash and care for clothes professionally.","zh":"“laundrymen”指以洗衣为职业的男性洗衣工（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Men who do laundry as a job; male laundry workers (plural of “laundryman”).","zh":"洗衣工；洗衣店男员工（“laundryman”的复数）。"},"examples":[{"en":"The hotel hired laundrymen to wash and press the uniforms every day.","zh":"酒店雇了洗衣工每天清洗并熨烫制服。"},{"en":"In the old records, laundrymen were listed as part of the household staff.","zh":"在旧档案里，洗衣工被列为家庭雇员的一部分。"}]}],"synonyms":["laundry workers","laundry staff","laundromat attendants"],"phonetic":"/ˈlɔndriˌmɛn/","extraExplanation":["“laundryman”是带性别色彩的职业称呼（指男性）。现代英语里更常用更中性的说法，如：laundry worker / laundromat attendant / laundry staff。","在一些历史语境中（如19—20世纪的城市生活记载），laundrymen/laundresses 常用来区分男女从事洗衣工作的人员；阅读旧文献时会更常见。"]}
{"word":"laundryowner","summary":{"en":"A laundry owner is someone who owns (often runs) a laundry business.","zh":"laundry owner 指拥有（并常经营）洗衣店/洗衣业务的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who owns (and often manages) a laundry business, such as a laundromat or a wash-and-fold service","zh":"洗衣店的老板；拥有（并常常经营）洗衣业务的人，例如自助洗衣店或代洗代烘服务"},"examples":[{"en":"The laundry owner opened a new location near the subway station.","zh":"洗衣店老板在地铁站附近开了新店。"},{"en":"As a laundry owner, she has to maintain the machines and train new staff.","zh":"作为洗衣店老板，她需要维护机器并培训新员工。"}]}],"synonyms":["laundromat owner","dry-cleaning shop owner","shop owner","business owner"],"phonetic":"/ˈlɔndri ˌoʊnɚ/","extraExplanation":["“laundryowner”通常更常写作两词“laundry owner”。在正式写作里，用两词更自然；在招牌、用户名或系统字段中可能会连写成一个词。","在美国日常表达里，如果指“自助洗衣店”的经营者，也常说“laundromat owner”；若是“干洗店”，常说“dry cleaner (shop) owner”。"]}
{"word":"laundrywoman","summary":{"en":"A laundrywoman is a woman who washes (and often irons) clothes for other people as her job.","zh":"laundrywoman 指以为他人洗（并常常熨）衣服为职业的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman whose job is to wash and iron clothes for other people; a female laundry worker.","zh":"（为他人）洗衣、熨衣的妇女；女洗衣工。"},"examples":[{"en":"The laundrywoman picked up the clothes in the morning and delivered them the next day.","zh":"那位洗衣女工早上来取衣服，第二天就送回来了。"},{"en":"In the old story, a laundrywoman works hard to support her family.","zh":"在那个老故事里，一位洗衣女工努力工作来养家。"}]}],"synonyms":["laundry worker","launderer","washerwoman"],"phonetic":"/ˈlɔndriˌwʊmən/","extraExplanation":["这个词在现代英语里会显得比较“旧式”，而且带有性别限定。更常见、更中性的说法是 laundry worker、launderer，或直接说 someone who does the laundry for a living。","在文学与历史语境中，laundrywoman 常用来描写过去（尤其19世纪到20世纪早期）城市或乡村里从事洗衣谋生的女性形象，常隐含辛劳、体力劳动与社会阶层背景。"]}
{"word":"laundrywomen","summary":{"en":"“Laundrywomen” means women who do laundry as paid work (plural of “laundrywoman”).","zh":"“Laundrywomen”指以洗衣为职业的女性（“laundrywoman”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"women who do laundry as a job; female laundry workers (plural of “laundrywoman”).","zh":"以洗衣为职业的女性；洗衣女工（“laundrywoman”的复数）。"},"examples":[{"en":"In the past, many laundrywomen worked long hours washing clothes by hand.","zh":"过去，许多洗衣女工要长时间手洗衣物。"},{"en":"The hotel hired laundrywomen to handle sheets and towels before modern machines were common.","zh":"在现代机器普及之前，酒店会雇洗衣女工来处理床单和毛巾。"}]}],"synonyms":["laundry workers","laundry staff","laundresses (old-fashioned)"],"phonetic":"/ˈlɔndriˌwɪmɪn/","extraExplanation":["“laundrywoman”是较传统、带性别色彩的职业称呼。现代英语里更常用性别中立的说法，如“laundry worker”“laundress（也偏旧）”“laundry staff”。","在历史语境（如19世纪—20世纪初的小说、纪实作品）里，“laundrywomen”常用来描写从事体力劳动、社会地位较低、工作艰辛的一群女性，因此阅读文学作品时可能带有阶层与时代背景的含义。"]}
{"word":"launeddas","summary":{"en":"Launeddas are traditional three-pipe Sardinian wind instruments, often played with circular breathing.","zh":"劳内达斯是撒丁岛传统的三管芦苇管乐器，常以循环换气演奏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Sardinian wind instrument made of three cane pipes (a kind of triple clarinet), typically played using circular breathing","zh":"（复数名词）劳内达斯：撒丁岛传统的管乐器，由三根芦苇管组成（类似“三管单簧管/三簧管”），演奏时常用循环换气"},"examples":[{"en":"At the festival, a musician played the launeddas while dancers moved in a circle.","zh":"在节庆上，一位乐手吹奏劳内达斯，舞者围成一圈起舞。"},{"en":"The sound of the launeddas is bright and continuous because the player uses circular breathing.","zh":"劳内达斯的声音明亮而连绵不断，因为演奏者会使用循环换气。"}]}],"synonyms":["Sardinian triple clarinet","three-pipe reed instrument"],"phonetic":"/laʊˈnɛdɑz/","extraExplanation":["“launeddas”常被当作一个整体名称来用（形式上像复数），指撒丁岛（Sardinia）非常具代表性的民间乐器与演奏传统。","它通常由三根芦苇管组成：两根负责旋律/装饰音，一根负责持续低音；演奏者用“循环换气”让声音不中断，因此听起来像持续不断的嗡鸣与旋律交织。"]}
{"word":"laur","summary":{"en":"“laur” isn’t a standard English word; it usually points to “laurel” and ideas of honor or victory.","zh":"“laur”不是标准英文单词；通常指向“laurel（月桂）”，并引申为荣誉或胜利。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; most often seen as a root or shortened form related to “laurel” (a plant, and a symbol of honor/victory).","zh":"本身不是标准英文单词；最常见是作为词根或缩写形式，和“laurel（月桂）”相关（植物，也象征荣誉/胜利）。"},"examples":[{"en":"I think you meant “laurel,” like in “rest on your laurels.”","zh":"我觉得你想写的是“laurel”，比如短语“rest on your laurels（躺在功劳簿上）”。"},{"en":"In ancient stories, a laurel wreath was a prize for winners.","zh":"在古代故事里，月桂花冠是给胜利者的奖赏。"}]}],"synonyms":["laurel","laurels"],"phonetic":"/lɔr/","extraExplanation":["“laur-”常见于与“月桂”相关的词：\n- laurel（月桂；荣誉）\n- laureate（获奖者，如 Nobel laureate 诺贝尔奖得主）\n- laurels（功劳、荣誉；也指月桂花冠）\n如果你是想查人名“Laura”，那是另一个词条（常译“劳拉”）。"]}
{"word":"Laura","summary":{"en":"Laura is a common female given name, often culturally linked to the laurel symbol of honor.","zh":"Laura 是常见的女性名字，在文化上常与象征荣誉与胜利的“月桂”意象相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name)","zh":"女性名字；女子名（常作名）"},"examples":[{"en":"Laura is my sister’s name.","zh":"Laura 是我妹妹的名字。"},{"en":"I met Laura at the library after class.","zh":"下课后我在图书馆遇到了 Laura。"}]},{"partOfSpeech":"n.","definition":{"en":"a name sometimes associated with “laurel,” symbolizing honor or victory","zh":"一个常与“月桂（laurel）”意象相关的名字，带有荣誉、胜利的象征含义"},"examples":[{"en":"The name Laura is often linked to laurel in European culture.","zh":"在欧洲文化中，Laura 这个名字常与月桂的意象联系在一起。"}]}],"synonyms":["Lauren","Laurel"],"phonetic":"/ˈlɔrə/","extraExplanation":["Laura 常被认为源自拉丁语 laurus（“月桂树”）。在古罗马文化中，月桂花冠象征荣耀与胜利，因此这个名字也常给人“优雅、受人敬重”的联想。","在文学中，意大利诗人彼特拉克（Petrarch）在诗集中以“Laura”作为重要的抒情对象之一，使这个名字在欧洲文化中更具文学色彩。"]}
{"word":"laura","summary":{"en":"Laura is a common female first name.","zh":"Laura 是一个常见的女性英文名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a woman or girl’s first name).","zh":"女性名字（女子的名或名为 Laura 的人）。"},"examples":[{"en":"Laura is my classmate.","zh":"Laura 是我的同学。"},{"en":"I’m meeting Laura after work.","zh":"我下班后要去见 Laura。"}]}],"synonyms":["(no direct synonyms; related names: Lauren, Laurel)"],"phonetic":"/ˈlɔrə/","extraExplanation":["Laura 源自拉丁语 *laurus*，意为“月桂”（古罗马常用月桂冠象征荣誉与胜利）。","在英语文化中，Laura 也是常见的文学与流行文化人物名，例如 1944 年的电影《Laura》及同名经典歌曲，使这个名字更为人熟知。"]}
{"word":"Lauraceae","summary":{"en":"the laurel family of aromatic trees and shrubs.","zh":"月桂科／樟科：一类常具芳香的树木和灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family (the laurel family) that includes aromatic trees and shrubs such as bay laurel, avocado, cinnamon, and camphor.","zh":"樟科／月桂科（植物分类中的一个科），多为芳香的乔木或灌木，如月桂、鳄梨（牛油果）、肉桂、樟树等。"},"examples":[{"en":"Cinnamon and camphor come from different species in the Lauraceae.","zh":"肉桂和樟脑来自樟科的不同物种。"},{"en":"The avocado tree belongs to the Lauraceae family.","zh":"鳄梨树（牛油果树）属于樟科。"},{"en":"In many subtropical forests, Lauraceae trees are important for wildlife food and habitat.","zh":"在许多亚热带森林里，樟科植物对野生动物的食物与栖息地很重要。"}]}],"synonyms":["laurel family"],"phonetic":"/ˌlɔrəˈseɪsiˌi/","extraExplanation":["-aceae 是植物学中表示“科”的固定后缀（如 Rosaceae 蔷薇科、Fabaceae 豆科）。因此看到 -aceae 往往就能判断是植物分类名称。","Lauraceae 常译作“樟科”或“月桂科”。中文里“樟科”更常见，因为包含樟树、香樟等代表植物；“月桂科”更贴近 laurel（桂/月桂）这个词源。"],"etymology":"源自拉丁语 laurus（“月桂；桂冠”）+ 植物科名常见后缀 -aceae（“……科”）；字面义即“月桂科”。","mnemonic":["记后缀：看到 -aceae 就想“某某科”。Laur- 联想到 laurel（桂冠、月桂），合起来就是“月桂那一科”。","“Laur”≈“劳（lao）”+“桂（laurel）”的联想：劳‘桂’那一科 → 月桂/樟科。"]}
{"word":"lauraceae","summary":{"en":"Lauraceae = the laurel family (a plant family) that includes bay laurel, cinnamon, camphor, and avocado.","zh":"Lauraceae 指樟科/月桂科（植物科名），包括月桂、肉桂、樟树与牛油果等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of evergreen trees and shrubs (the laurel family), including plants such as bay laurel, cinnamon, camphor, and avocado.","zh":"樟科；月桂科（常绿乔木或灌木的一科，包括月桂、肉桂、樟树、鳄梨/牛油果等）。"},"examples":[{"en":"Cinnamon comes from trees in the Lauraceae family.","zh":"肉桂来自樟科（Lauraceae）的树木。"},{"en":"The avocado is a well-known fruit-bearing plant in Lauraceae.","zh":"鳄梨（牛油果）是樟科中很有名的结果植物。"}]}],"synonyms":["the laurel family"],"phonetic":"/ˌlɔːrəˈseɪ.iː/","extraExplanation":["“Lauraceae”是植物学中的拉丁化科名，来自拉丁语“laurus”（月桂）。在日常英语里，人们更常说“the laurel family（樟科/月桂科）”。","樟科植物常见特征包括：芳香的叶片（常含精油）、常绿、花较小但果实（如牛油果）可能很显著；“camphor（樟脑）”“cinnamon（肉桂）”“bay leaf（月桂叶）”等都与这一科有关。"]}
{"word":"Lauraceae-related","summary":{"en":"connected with the laurel (Lauraceae) plant family","zh":"与樟科（月桂科）植物科相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the plant family Lauraceae (the laurel family), which includes bay laurel, cinnamon, avocado, and camphor trees.","zh":"与樟科（又称月桂科）这种植物科有关的；属于或涉及樟科植物的（如月桂、肉桂、鳄梨、樟树等）。"},"examples":[{"en":"The paper compares Lauraceae-related essential oils from different regions.","zh":"这篇论文比较了不同地区与樟科有关的精油。"},{"en":"Researchers identified several Lauraceae-related compounds in the bark extract.","zh":"研究人员在树皮提取物中鉴定出几种与樟科相关的化合物。"}]}],"synonyms":["related to Lauraceae","Lauraceae-associated","laurel-family-related"],"phonetic":"/ˌlɔːrəˈseɪsiː rɪˈleɪtɪd/","extraExplanation":["Lauraceae 常见中文名为“樟科”，也有人称“月桂科”。在植物学/食品/香料研究中常见，因为该科包含肉桂（cinnamon）、月桂叶（bay leaf）、樟脑（camphor）来源植物以及鳄梨（avocado）。","写作上更常见、更自然的表达有：related to the Lauraceae 或 Lauraceae-associated。带连字符的 Lauraceae-related 多见于论文标题或复合定语。"],"etymology":"由植物科名 Lauraceae（拉丁化的科名后缀 -aceae 表示“某某科”）加上 related（“相关的”）构成，多用于学术写作中表达“与某科/类群有关”。","mnemonic":["记“Lauraceae ≈ laurel（月桂）家族”，看到 -aceae 就联想到“植物的某某科”。","Lauraceae-related = “樟科 + related（相关）”，直译记忆：‘跟樟科有关的’。"]}
{"word":"lauraceous","summary":{"en":"An adjective meaning “related to the laurel family (Lauraceae)” or “laurel-like.”","zh":"形容词：指“与樟科/月桂科（Lauraceae）有关”，也可指“像月桂的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the laurel family (Lauraceae), a group of aromatic trees and shrubs (such as bay laurel, cinnamon, and avocado).","zh":"（植物学）与樟科/月桂科（Lauraceae）有关的；指一类常带芳香的乔木或灌木（如月桂、肉桂、鳄梨/牛油果等）。"},"examples":[{"en":"Cinnamon comes from a lauraceous tree in the genus Cinnamomum.","zh":"肉桂来自樟科/月桂科的樟属（Cinnamomum）树木。"},{"en":"The botanist recorded several lauraceous species in the rainforest plot.","zh":"植物学家在这片雨林样地记录了几种樟科/月桂科植物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Laurel-like in appearance or smell (aromatic, evergreen, with leaves resembling bay leaves).","zh":"外观或气味像月桂的（常指芳香、常绿、叶片类似香叶/月桂叶）。"},"examples":[{"en":"The garden had a lauraceous scent after the rain.","zh":"雨后花园里弥漫着一种类似月桂的芳香。"},{"en":"Its glossy, lauraceous leaves made it easy to confuse with bay laurel at first glance.","zh":"它那光亮、像月桂的叶子让人乍一看很容易与月桂混淆。"}]}],"synonyms":["laurel-family (related)","Lauraceae-related","laurel-like"],"phonetic":"/lɔˈreɪʃəs/","extraExplanation":["“Lauraceous”源自拉丁语 *laurus*（月桂）+ “-aceous”（表示“……类的/……性质的”），在学术写作里最常见的用法是指“樟科/月桂科（Lauraceae）”。","樟科/月桂科植物常含挥发性芳香油，因此英语中也会用 lauraceous 来形容“有月桂般香味/叶形”的特征，但这种用法比植物分类意义更少见。"]}
{"word":"laurae","summary":{"en":"*Laurae* is a rare, formal plural meaning “laurels” or “honors,” based on the laurel-wreath symbol of achievement.","zh":"*Laurae* 是一个罕见且正式的复数词，意为“桂冠／月桂花环”或“荣誉”，源于月桂花环象征成就与荣耀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) Laurels—especially a laurel wreath, or the honors/recognition symbolized by laurel wreaths; plural of *laura* (from Latin).","zh":"（罕见、正式）桂冠／月桂花环；也指由桂冠象征的荣誉与赞誉。*laura* 的复数形式（源自拉丁语）。"},"examples":[{"en":"After years of research, she finally earned her laurae in the field.","zh":"经过多年的研究，她终于在该领域赢得了桂冠般的荣誉。"},{"en":"The poet wrote of heroes crowned with laurae.","zh":"诗人写到英雄们头戴桂冠。"}]}],"synonyms":["laurels","honors","accolades","distinctions"],"phonetic":"ˈlɔːreɪ","extraExplanation":["*Laurae* 多见于较文学化或学术化的英语写作里，带有“古典／拉丁语色彩”。日常英语中更常用 **laurels**（如：*rest on your laurels* 满足于既有成就）。","它与 **laurel**（月桂）同源：古希腊、古罗马常用月桂花环奖励诗人、将领或胜利者，因此“月桂”逐渐引申为“荣誉、桂冠”。"]}
{"word":"lauraldehyde","summary":{"en":"Lauraldehyde is a 12‑carbon aldehyde used mainly in fragrances and flavors (also called dodecanal).","zh":"Lauraldehyde（月桂醛/十二醛）是一种12碳链的醛类化合物，主要用于香精香料与食用香料中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an aldehyde) with a 12‑carbon chain, used mainly in fragrances and flavors; also called dodecanal","zh":"一种含12个碳链的醛类化合物，主要用于香精香料和食用香料中；也叫“十二醛”"},"examples":[{"en":"Lauraldehyde is used in perfumery to give a fresh, soapy, citrus‑like note.","zh":"月桂醛常用于香水配方中，带来清新、皂感、略带柑橘的气味基调。"},{"en":"Some flavor formulas add tiny amounts of lauraldehyde to boost a clean, fatty aroma.","zh":"有些食用香料配方会加入极少量的月桂醛，以增强干净、略带脂香的气味。"}]}],"synonyms":["dodecanal","lauric aldehyde","12-al (informal in perfumery)"],"phonetic":"/ˌlɔrˈældəˌhaɪd/","extraExplanation":["“Laur-”来自 lauric（“月桂酸的”），指12个碳的“月桂酸”系列；-aldehyde 表示“醛”。因此 lauraldehyde 常被理解为“月桂酸对应的醛”，其常用化学名是 dodecanal（十二醛）。","它属于专业化学/香精香料用词，日常英语中很少出现；在安全与法规语境里可能会出现在成分表或MSDS（安全数据表）中。"]}
{"word":"lauras","summary":{"en":"“lauras” is usually a misspelling of “Laura’s” (meaning “belonging to Laura”), or it can mean multiple people named Laura (plural “Lauras”).","zh":"“lauras”通常是把“Laura’s”（“劳拉的”）少写了撇号；也可能表示多个叫Laura的人（复数“Lauras”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Commonly written “Laura’s”) the possessive form of the name Laura, meaning something belongs to or is connected with Laura.","zh":"（通常写作“Laura’s”）名字 Laura 的所有格形式，表示“劳拉的”，指某物属于或与劳拉有关。"},"examples":[{"en":"This is Laura’s notebook.","zh":"这是劳拉的笔记本。"},{"en":"I’m meeting Laura’s friends after class.","zh":"下课后我要去见劳拉的朋友。"}]},{"partOfSpeech":"other","definition":{"en":"The plural form of the given name Laura: more than one person named Laura.","zh":"人名 Laura 的复数：指不止一个叫劳拉的人。"},"examples":[{"en":"There are two Lauras in our team, so we use last names to avoid confusion.","zh":"我们团队里有两个劳拉，所以我们用姓来避免混淆。"},{"en":"The Lauras in the class sit near the window.","zh":"班上那几位叫劳拉的同学坐在窗边。"}]}],"phonetic":"/ˈlɔrəz/","extraExplanation":["“lauras”在实际英语写作中不太常见，因为：\n1）表示“劳拉的”时一般必须写撇号：Laura’s（所有格）。\n2）表示“多个叫Laura的人”时才会写La(u)ras（首字母大写更自然：Lauras）。\n如果你看到小写“lauras”，可能是打字、标题风格或非正式写法。"]}
{"word":"laurate","summary":{"en":"A “laureate” is a person officially honored with a major prize or title (like a Nobel laureate), and it can also describe someone who has received such an honor.","zh":"“laureate”指获得重要官方奖项或头衔的人（如诺贝尔奖得主），也可作形容词表示“获奖的、受封的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is honored with an official prize or title for outstanding achievement (often in literature, science, or the arts).","zh":"因杰出成就而获得官方奖项或头衔的人（常见于文学、科学或艺术领域）。"},"examples":[{"en":"She became the youngest Nobel laureate in chemistry.","zh":"她成为最年轻的诺贝尔化学奖得主。"},{"en":"The poet laureate read a new poem at the national ceremony.","zh":"桂冠诗人在国家典礼上朗诵了一首新诗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Officially honored with a prize or title; award-winning.","zh":"被授予荣誉或奖项的；获奖的。"},"examples":[{"en":"The laureate author spoke about her creative process.","zh":"这位获奖作家谈到了她的创作过程。"},{"en":"They invited a laureate scientist to give the keynote talk.","zh":"他们邀请了一位获奖科学家做主旨演讲。"}]}],"synonyms":["awardee","honoree","prizewinner","recipient"],"phonetic":"/ˈlɔriət/","extraExplanation":["你输入的“laurate”更常见的拼写是“laureate”。它来自“laurel（月桂）”的概念：古希腊、古罗马会用月桂花冠奖励诗人、英雄或胜利者，因此“laureate”带有“戴上桂冠、受到最高荣誉”的文化意象。","常见固定搭配：Nobel laureate（诺贝尔奖得主），poet laureate（桂冠诗人，英美国家常见的官方诗人头衔）。"]}
{"word":"laurdalite","summary":{"en":"“laurdalite” is a rare mineral/geology term, not common in everyday English.","zh":"“laurdalite”多半是罕见的矿物/地质学术语，并非常见日常英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare geological/mineral term: a mineral name (used mainly in geology), not a common word in everyday English.","zh":"一种罕见的地质/矿物学术语：矿物名称（主要见于地质学语境），在日常英语中不常用。"},"examples":[{"en":"Laurdalite is mentioned in a few specialized geology references.","zh":"Laurdalite 在少数专业地质学参考资料中被提到。"},{"en":"This report lists laurdalite among minor minerals found in the sample.","zh":"这份报告把 laurdalite 列为样品中发现的次要矿物之一。"}]}],"phonetic":"/ˈlɔr.dəˌlaɪt/","extraExplanation":["“laurdalite”并不是常见英语词汇，更像是矿物/岩石学里的专有名词，很多词典可能不会收录。","如果你是在查一个更常用的词，可能是拼写有误：常见相近词包括 **laudable**（值得称赞的）或 **laureate**（获奖的/桂冠诗人）。你可以告诉我出现它的句子或来源（书名/论文/图片），我能更准确判断。"]}
{"word":"laure","summary":{"en":"Laure is mainly a French female name; very rarely, it appears as an old spelling connected to “laurel.”","zh":"Laure 主要是一个法语女性名字；极少情况下也会作为与“laurel（月桂）”相关的旧式拼写出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (most common in French); in English it is usually pronounced like “lore.”","zh":"女性名字（在法语中较常见）；在英语里通常读作类似“lore（罗尔）”的音。"},"examples":[{"en":"Laure is a common French name, similar in origin to Laura.","zh":"Laure 是一个常见的法语名字，词源上和 Laura 相近。"},{"en":"I met someone named Laure at the conference.","zh":"我在会议上认识了一个叫 Laure 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(very rare) an old/variant spelling related to “laurel” (a laurel tree or wreath).","zh":"（非常少见）与“laurel（月桂树／月桂花环）”相关的旧式或变体拼写。"},"examples":[{"en":"Some older texts use variant spellings like laure for laurel.","zh":"有些较旧的文本会用 laure 这种变体拼写来指 laurel。"}]}],"synonyms":["Laura","laurel (related word)"],"phonetic":"/lɔr/","extraExplanation":["Laure 的词源可追溯到拉丁语 laurus（“月桂”）。在欧洲文化里，“月桂冠”常象征胜利、荣誉与诗歌（如“poet laureate/桂冠诗人”这一说法也来自同一文化意象）。"]}
{"word":"laureal","summary":{"en":"Laurel means a type of evergreen plant, and it can also mean an honor or symbol of victory (a laurel wreath).","zh":"Laurel 指一种常绿植物，也可指“桂冠/荣誉”（胜利的象征）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An evergreen tree or shrub with shiny leaves; its leaves are sometimes used in cooking (bay laurel).","zh":"一种常绿树或灌木；其叶子有时用于烹饪（如月桂/香叶）。"},"examples":[{"en":"She added a bay laurel leaf to the soup for extra flavor.","zh":"她在汤里加了一片月桂叶（香叶）来增味。"},{"en":"A laurel hedge lined the path to the house.","zh":"通往房子的路旁是一排月桂树篱。"}]},{"partOfSpeech":"n.","definition":{"en":"An honor or symbol of victory, especially a wreath made of laurel leaves; often used in the plural (laurels).","zh":"荣誉或胜利的象征，尤指用月桂叶编成的桂冠；常用复数（laurels）。"},"examples":[{"en":"The champion received a laurel wreath.","zh":"冠军获得了桂冠。"},{"en":"He refused to rest on his laurels and kept training.","zh":"他不愿躺在过去的功劳簿上，而是继续训练。"}]}],"synonyms":["bay (tree/leaf)","wreath","honor","accolade"],"phonetic":"/ˈlɔrəl/","extraExplanation":["你输入的拼写“laureal”通常是“laurel”的误拼。常见相关词：poet laureate（桂冠诗人）、Nobel laureate（诺贝尔奖得主）。","文化背景：在古希腊与古罗马，月桂冠常用来奖励诗人、英雄或胜利者，因此 laurel 也引申为“荣誉/桂冠”。"]}
{"word":"laureate","summary":{"en":"A “laureate” is someone officially honored with an award or title, especially in literature, science, or the arts.","zh":"“laureate”指因成就而获官方荣誉或头衔的人，常见于文学、科学或艺术领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is honored with an official title or award for achievement, especially in the arts or academics (e.g., a Nobel Prize winner or a Poet Laureate).","zh":"因成就而获得官方头衔或奖项的人，尤指文学艺术或学术领域（如诺贝尔奖得主、桂冠诗人）。"},"examples":[{"en":"She became a Nobel laureate for her research in medicine.","zh":"她因医学研究成为诺贝尔奖得主。"},{"en":"The country appointed a new Poet Laureate to write poems for national events.","zh":"该国任命了一位新的桂冠诗人，为国家活动创作诗歌。"}]},{"partOfSpeech":"adj.","definition":{"en":"Honored or crowned with a symbolic award, especially a laurel wreath (often used in fixed titles like “Poet Laureate”).","zh":"被授予荣誉的；加冕的（尤指象征性的月桂冠；常见于固定头衔如“Poet Laureate”）。"},"examples":[{"en":"A laureate poet may be invited to represent the nation’s literary voice.","zh":"桂冠诗人可能会被邀请代表国家的文学声音。"}]}],"synonyms":["awardee","honoree","recipient","prizewinner","winner"],"phonetic":"/ˈlɔɹiət/","extraExplanation":["“laureate”来自拉丁语 laurus（意为“月桂”）。在古希腊罗马时期，月桂冠象征胜利与荣耀，因此“laureate”引申为“获奖者/获授荣誉的人”。","常见搭配：Nobel laureate（诺贝尔奖得主）、poet laureate（桂冠诗人）、laureate professor（荣誉教授/桂冠教授，依学校译法而定）。"]}
{"word":"laureated","summary":{"en":"Laureated means honored or awarded, as if crowned with laurels; it’s a literary, less common word.","zh":"laureated 指“获奖的、受表彰的”，带“戴上月桂冠”的文学色彩，用法较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"honored or rewarded (often publicly), especially as if “crowned with laurels.”","zh":"（尤指公开地）被授予荣誉的；受奖的（仿佛“戴上月桂冠”）。"},"examples":[{"en":"She is a laureated scientist with international awards.","zh":"她是一位获国际奖项、备受表彰的科学家。"},{"en":"The laureated poet read his new work at the ceremony.","zh":"这位获奖诗人在典礼上朗读了他的新作品。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to honor someone with a prize or title; to award.","zh":"（罕用）授予（某人）荣誉或奖项；表彰。"},"examples":[{"en":"The academy laureated him for his lifelong contributions to medicine.","zh":"该学会因他对医学的毕生贡献而授予他荣誉。"}]}],"synonyms":["honored","awarded","acclaimed","decorated","crowned","laureled"],"phonetic":"/ˈlɔriˌeɪtɪd/","extraExplanation":["“laureated”来自“laurel（月桂）”。在古希腊和古罗马，胜利者或诗人常被戴上月桂花环，象征荣耀与成就；因此英语里“laurel / laureate / laureated”都带有“受表彰、获奖”的意味。","现代英语更常用的是“laureate”（如“Nobel laureate 诺贝尔奖得主”）或直接说“award-winning / honored”。“laureated”较文学化、较少见，写作时要注意语域。"]}
{"word":"laureates","summary":{"en":"“Laureates” is the plural of “laureate,” meaning people who have received an important honor or prize, especially in fields like the Nobel Prize; it can also refer to people holding an official “poet laureate” title.","zh":"“Laureates”是“laureate”的复数，指获得重要荣誉或奖项的人（如诺贝尔奖得主）；也可指获得官方“桂冠诗人”头衔的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have been awarded a special honor or prize (especially in literature, peace, science, etc.).","zh":"获奖者；荣誉称号获得者（尤指文学、和平、科学等领域的奖项获得者）。"},"examples":[{"en":"Several Nobel laureates spoke at the conference.","zh":"几位诺贝尔奖得主在会上发言。"},{"en":"The university invited its most famous alumni, including a Pulitzer laureate.","zh":"这所大学邀请了最著名的校友，其中包括一位普利策奖得主。"}]},{"partOfSpeech":"n.","definition":{"en":"Poets who officially hold the title of “poet laureate” (for a country, state, or institution).","zh":"桂冠诗人（官方授予“Poet Laureate”称号的诗人，如国家、州或机构的桂冠诗人）。"},"examples":[{"en":"The national poet laureates often write poems for public events.","zh":"国家桂冠诗人常为公共活动创作诗歌。"},{"en":"She studied the works of past laureates in her literature class.","zh":"她在文学课上研究了历任桂冠诗人的作品。"}]}],"synonyms":["awardee","prizewinner","recipient","honoree"],"phonetic":"/ˈlɔriət/","extraExplanation":["“Laureate”来自“laurel（月桂）”。在古希腊和古罗马，月桂花环象征胜利与荣耀，常为诗人、英雄或获胜者加冕；因此“laureate”带有“被授予荣誉/加冕”的含义。","常见搭配：Nobel laureate（诺贝尔奖得主），Pulitzer Prize laureate（普利策奖得主），poet laureate（桂冠诗人）。日常英语里更常说“winner / recipient”，而“laureate”更正式、更书面。"]}
{"word":"laureateship","summary":{"en":"Laureateship means the office or status of being a laureate, especially a poet laureate.","zh":"Laureateship 指“获桂冠者（尤指桂冠诗人）的职位或身份”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The position or status of being a laureate (an officially honored person for artistic or academic achievement), especially a poet laureate.","zh":"桂冠诗人/获桂冠者的职位或身份（指因艺术或学术成就而被官方授予荣誉的人），尤指“桂冠诗人”的任职。"},"examples":[{"en":"She was offered the national poets’ laureateship and agreed to serve for two years.","zh":"她获邀担任国家桂冠诗人的职位，并同意任期两年。"},{"en":"During his laureateship, he wrote poems for public ceremonies and national events.","zh":"在他担任桂冠诗人期间，他为公共典礼和国家活动写诗。"}]}],"synonyms":["laureate office","poet laureateship","laureate status"],"phonetic":"/ˈlɔr.i.ət.ʃɪp/","extraExplanation":["“laureateship”由“laureate（获桂冠者/桂冠诗人）+ -ship（表示身份、职位、状态）”构成。英文里常见的“-ship”类似于中文的“……之职/……之位/……身份”，如“friendship（友谊）”“leadership（领导地位/领导力）”。","“laureate”源于古希腊罗马的月桂冠（laurel），象征荣誉与胜利，因此“poet laureate（桂冠诗人）”通常指由国家或机构正式任命、在重大公共场合创作作品的人。"]}
{"word":"laureateships","summary":{"en":"“Laureateships” is the plural of “laureateship,” meaning the title/position/term or the state of being a laureate (an honored prizewinner).","zh":"“laureateships”是“laureateship”的复数，指“桂冠得主”的头衔／职位／任期，或作为桂冠得主（获奖者）的身份状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, title, or term of office of a laureate (someone honored for outstanding achievement, especially in the arts or academia).","zh":"桂冠称号／桂冠职位：指“桂冠得主”的头衔、职位或任期（尤指文学、艺术、学术等领域的荣誉称号）。"},"examples":[{"en":"Her laureateship as Poet Laureate lasted two years.","zh":"她担任“桂冠诗人”的任期持续了两年。"},{"en":"The university created a new laureateship to honor excellence in public scholarship.","zh":"这所大学设立了一个新的“桂冠称号”，以表彰公共学术领域的卓越贡献。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being a laureate; public recognition as a prizewinner.","zh":"桂冠身份／获奖者地位：指作为桂冠得主的身份状态，或作为获奖者受到公众承认。"},"examples":[{"en":"After the Nobel announcement, his laureateship brought invitations from around the world.","zh":"诺贝尔奖公布后，他的“桂冠得主”身份带来了来自世界各地的邀请。"},{"en":"She used her laureateship to support young writers.","zh":"她利用自己的桂冠得主身份来支持年轻作家。"}]}],"synonyms":["laureateship (singular)","laureate position","laureate title","tenure (in some contexts)","honor (broader)"],"phonetic":"/ˈlɔɹiətˌʃɪps/","extraExplanation":["“laureateship”由“laureate（桂冠得主）+ -ship（表示身份、职位、状态）”构成，和“friendship / leadership”里的“-ship”用法相同。","“laureate”源自“laurel（月桂）”，古希腊罗马时期常用月桂花环象征胜利与荣誉，因此“to be laureate”带有“加冕、授予荣誉”的文化意味。"]}
{"word":"laureating","summary":{"en":"“Laureating” means honoring someone by granting an award or title (from “laurel,” a symbol of victory).","zh":"“Laureating”指通过授奖或授予称号来表彰某人（源自象征胜利的“月桂”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of **laureate**) honoring someone with a prize or official title; crowning with laurels (a symbol of victory).","zh":"（**laureate** 的现在分词）授予某人奖项或官方称号；以月桂加冕（象征胜利与荣誉）。"},"examples":[{"en":"The committee is **laureating** two writers this year for their contributions to literature.","zh":"委员会今年将为两位作家的文学贡献**授奖/授予荣誉称号**。"},{"en":"In ancient times, athletes were **laureating** champions with wreaths of laurel.","zh":"在古代，人们会用月桂花冠为冠军**加冕**。"}]}],"synonyms":["honoring","awarding","crowning","decorating","naming"],"phonetic":"/ˈlɔːriˌeɪtɪŋ/","extraExplanation":["“Laureate”来自“laurel（月桂）”。在古希腊、古罗马，月桂花冠常用于奖励诗人、将军或运动冠军，因此“laureate/加冕、授奖”带有“公开授予荣誉”的文化含义。","现代英语里更常见的是名词 **laureate**（如 **Nobel laureate**“诺贝尔奖得主”）。动词用法（to laureate / laureating）较少见，正式场合有时会用，但日常更常说 **honor**, **award**, **name**（授予称号）。"]}
{"word":"laureation","summary":{"en":"Laureation means the act of officially honoring someone (often symbolically with “laurels”) or the state of being honored; it’s rare in modern English.","zh":"laureation 指“授予（桂冠式的）荣誉/表彰”或“获得荣誉的状态”，但在现代英语中较为罕见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of honoring someone by awarding a laurel (symbolic wreath) or a prize; the conferring of public praise","zh":"（象征性）授予桂冠或奖项以表彰某人；授予荣誉、公开嘉奖"},"examples":[{"en":"The scientist’s laureation came with a national medal and wide public recognition.","zh":"这位科学家在获得国家奖章时也得到了广泛的公众认可。"},{"en":"In the speech, the mayor described the award as a simple act of laureation for years of service.","zh":"市长在演讲中称这个奖项是对多年服务的一种朴素表彰。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literary) the state of being a laureate; having been officially honored","zh":"（罕见/文学用语）成为桂冠获得者的状态；已被正式授予荣誉的身份"},"examples":[{"en":"After her laureation, he referred to her as a national treasure.","zh":"在她获得桂冠荣誉后，他称她为“国宝”。"},{"en":"The poem celebrates the artist’s laureation and lasting influence.","zh":"这首诗歌颂了这位艺术家获得桂冠的荣耀及其持久影响。"}]}],"synonyms":["honoring","recognition","acclaim","award","commendation"],"phonetic":"/ˌlɔriˈeɪʃən/","extraExplanation":["“laureation”在现代英语中非常少见，更常用的是“award/recognition/honor”，或与桂冠相关的“laurels / laureate”。","“laurel（桂冠）”源自古希腊罗马传统：用月桂枝编成花冠，象征胜利、诗歌与崇高成就；因此有“poet laureate（桂冠诗人）”等说法。"]}
{"word":"Laurel","summary":{"en":"a laurel plant or, by extension, honor and victory symbolized by a laurel wreath","zh":"月桂植物；也指象征荣誉与胜利的“桂冠/声誉”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen tree or shrub with shiny leaves; its leaves are sometimes used for flavoring (bay leaves)","zh":"月桂属的常绿树或灌木；其叶子常用于调味（如香叶/月桂叶）"},"examples":[{"en":"Add a bay leaf (laurel leaf) to the soup for extra flavor.","zh":"在汤里加一片香叶（月桂叶）会更香。"},{"en":"The garden has a tall laurel hedge along the fence.","zh":"花园围栏边有一排高高的月桂树篱。"}]},{"partOfSpeech":"n.","definition":{"en":"honor, praise, or a symbol of victory, traditionally shown as a wreath made from laurel leaves","zh":"荣誉、赞美；（传统上用月桂叶编成的）胜利花环，象征成就与荣耀"},"examples":[{"en":"The athlete returned home crowned with laurels.","zh":"那位运动员载誉而归。"},{"en":"She won international laurels for her research.","zh":"她的研究为她赢得了国际声誉。"}]}],"synonyms":["bay","bay leaf","wreath","crown","honor","glory","acclaim","prestige"],"phonetic":"/ˈlɔrəl/","extraExplanation":["文化典故：古希腊把月桂与阿波罗（Apollo）联系在一起；比赛或诗歌竞赛的获胜者常戴月桂冠。现代英语里因此有很多相关表达，如 “rest on one’s laurels”（躺在功劳簿上）。","日常用法区分：指调味用的“香叶”时，英语更常说 bay leaf；但 laurel leaf 也能理解。"],"etymology":"源自拉丁语 laurus（“月桂树”），经古法语 laurier 进入英语，后来也引申为“荣誉/桂冠”，因为古希腊与古罗马常用月桂花环授予胜利者与诗人。","mnemonic":["联想“桂冠”：中文常说“桂冠/桂冠诗人”，英语 laurel 也有“桂冠、荣誉”的意思。","发音记忆：laurel /ˈlɔrəl/ 听起来像“劳 + 柔”，想到“劳有所得，柔叶成冠（荣誉）”。"]}
{"word":"laurel","summary":{"en":"Laurel is an evergreen plant; it can also mean honor or victory, especially in the phrase “rest on your laurels.”","zh":"Laurel 指常绿植物（月桂等）；也可引申为“荣誉/胜利（桂冠）”，常见于短语“rest on your laurels（躺在功劳簿上）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen tree or shrub with shiny leaves, often used for decoration and sometimes for cooking (bay laurel)","zh":"一种常绿乔木或灌木，叶子有光泽，常用于装饰；有些品种（如月桂）也可用于烹饪调味"},"examples":[{"en":"The yard has a tall laurel hedge that stays green all year.","zh":"院子里有一排高高的月桂树篱，一年四季都很绿。"},{"en":"She added a bay laurel leaf to the soup for flavor.","zh":"她往汤里放了一片月桂叶来提味。"}]},{"partOfSpeech":"n.","definition":{"en":"honor, praise, or a symbol of victory (often plural: laurels)","zh":"荣誉、赞美或胜利的象征（常用复数：laurels）"},"examples":[{"en":"After the competition, the team received many laurels.","zh":"比赛结束后，这支队伍获得了许多荣誉。"},{"en":"He didn’t want to rest on his laurels; he kept improving.","zh":"他不想躺在功劳簿上，而是继续进步。"}]}],"synonyms":["bay (tree)","bay laurel","honor","acclaim"],"phonetic":"/ˈlɔrəl/","extraExplanation":["“laurel（桂冠/月桂）”在西方文化中常与古希腊罗马的胜利与诗歌传统有关：胜利者或杰出诗人常被授予月桂冠（laurel wreath）。因此 laurel 既指植物，也常引申为“荣誉、桂冠”。","常见搭配：a laurel wreath（月桂花环/桂冠）；win laurels（赢得荣誉）；rest on your laurels（躺在功劳簿上）。"]}
{"word":"laurel-associated","summary":{"en":"linked to laurel, often implying victory or honor.","zh":"与月桂相关，常暗示胜利或荣誉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with laurel (a bay tree), especially symbolically (e.g., victory, honor, achievement) or literally (made from/covered with laurel).","zh":"与月桂（常指月桂树/香叶树）有关的；常带有“胜利、荣誉、成就”的象征意味，或指实际由月桂制成/装饰的。"},"examples":[{"en":"In ancient Greece, laurel-associated crowns were given to winners of athletic contests.","zh":"在古希腊，与月桂相关的桂冠会颁给体育竞赛的获胜者。"},{"en":"The museum displayed laurel-associated symbols of triumph in Roman art.","zh":"博物馆展出了罗马艺术中与月桂相关的胜利象征。"},{"en":"The poet used laurel-associated imagery to suggest lasting fame.","zh":"诗人用与月桂相关的意象来暗示持久的名声。"}]}],"synonyms":["laurel-related","laurel-linked","connected with laurel","triumph-associated","honor-associated"],"phonetic":"ˈlɔrəl əˈsoʊsieɪtɪd","extraExplanation":["文化背景：在西方传统里，“laurel（桂冠）”常象征胜利与荣誉。比如“rest on your laurels（躺在功劳簿上）”“poet laureate（桂冠诗人）”。因此 laurel-associated 往往不只是“有月桂”的字面意思，也常带“荣耀/成就”的联想。"],"etymology":"由“laurel（月桂、桂冠）+ associated（相关的）”构成的复合形容词。laurel 源自拉丁语 laurus（“月桂”），在希腊罗马传统中与胜利、荣耀相连；associated 来自拉丁语 associāre（“使联合、使结伴”）。","mnemonic":["联想“桂冠（laurel wreath）= 荣誉”。看到 laurel-associated 就想成“带桂冠气质的：和荣耀/胜利挂钩的”。","把它拆开记：laurel（月桂/桂冠）+ associated（相关的）= “与桂冠相关”。"]}
{"word":"laurel-family","summary":{"en":"the botanical family Lauraceae, including bay laurel, cinnamon, avocado, and related aromatic plants","zh":"植物学上的樟科，包括月桂、肉桂、鳄梨等芳香植物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a plant family (Lauraceae) that includes aromatic trees and shrubs such as bay laurel, cinnamon, avocado, and camphor","zh":"樟科（Lauraceae）：一类多为芳香性的乔木或灌木植物科，包括月桂、肉桂、鳄梨（牛油果）、樟树等"},"examples":[{"en":"Cinnamon and avocado both belong to the laurel family.","zh":"肉桂和鳄梨（牛油果）都属于樟科。"},{"en":"Many plants in the laurel family have fragrant leaves or bark.","zh":"樟科的许多植物叶子或树皮都有香味。"},{"en":"The bay leaf used in cooking comes from a laurel-family tree.","zh":"烹饪用的月桂叶来自樟科的一种树。"}]}],"synonyms":["Lauraceae"],"phonetic":"/ˈlɔrəl ˌfæməli/","extraExplanation":["别把 laurel family（樟科）和“月桂冠/桂冠”（a laurel wreath，象征胜利与荣誉）混淆：前者是植物分类学术语，后者是文化象征用法。","常见成员：bay laurel（月桂）、cinnamon tree（肉桂树）、avocado（鳄梨/牛油果）、camphor tree（樟树）。不少成员含挥发油，所以气味明显。"],"etymology":"“laurel”源自拉丁语 laurea（“月桂、月桂冠”），后来进入法语与英语；“family”来自拉丁语 familia（“家族、群体”）。在植物学里，“family”是“科”的意思，因此 laurel family 指“月桂类植物的一科”，即樟科（Lauraceae）。","mnemonic":["把它拆开记：laurel（月桂）+ family（家族/一科）→“月桂这一大家族的植物”，对应中文“樟科”。","联想厨房：bay leaf（月桂叶）和 cinnamon（肉桂）都“香”，而樟科很多植物都带香味。"]}
{"word":"laurel-like","summary":{"en":"resembling laurel; suggesting laurel’s look or symbolism of honor","zh":"像月桂的；带有月桂外观或荣耀象征意味"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a laurel plant or its leaves; having the appearance or qualities associated with laurel.","zh":"像月桂（树/叶）的；具有月桂外观或月桂所象征特质的。"},"examples":[{"en":"The garden had laurel-like shrubs lining the walkway.","zh":"花园的小径两旁种着像月桂一样的灌木。"},{"en":"The crown was made of laurel-like leaves to suggest honor and victory.","zh":"那顶王冠用类似月桂叶的叶片做成，以象征荣誉与胜利。"}]}],"synonyms":["laurellike","laurelly","wreathlike","leafy"],"phonetic":"/ˈlɔrəl laɪk/","extraExplanation":["在西方文化里，“月桂冠”（laurel wreath）常用来象征胜利、成就与荣誉：古希腊、古罗马会用月桂冠嘉奖诗人或凯旋者，因此带有“受表彰、值得称赞”的联想。"],"etymology":"由 laurel（“月桂；月桂叶，常象征荣耀与胜利”）+ -like（“像……一样的”）构成，表示“像月桂的”。","mnemonic":["记成“laurel（月桂）+ like（像）”，直译就是“像月桂的”。","联想“月桂冠=荣耀”，看到 laurel-like 可想到“有月桂冠那种荣誉感/胜利感的样子”。"]}
{"word":"laurel-related","summary":{"en":"connected to laurel or its symbolism of honor and victory","zh":"与月桂或其“荣誉、胜利”象征相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with laurel (the bay tree) or with the symbolic use of laurel, especially as a sign of victory, honor, or achievement.","zh":"与“月桂”（月桂树）有关，或与月桂作为“胜利、荣誉、成就”象征的用法有关。"},"examples":[{"en":"The museum displayed laurel-related motifs from ancient Greek pottery.","zh":"博物馆展出了古希腊陶器上与月桂有关的图案。"},{"en":"The medal included a laurel-related design to suggest honor and victory.","zh":"这枚奖章采用了月桂元素的设计，用来暗示荣誉与胜利。"}]}],"synonyms":["laurine","bay-related","honor-related","victory-themed"],"phonetic":"/ˈlɔrəl rɪˌleɪtɪd/","extraExplanation":["在西方文化里，“月桂冠”常与古希腊、古罗马的胜利者、诗人或杰出人物有关；因此 laurel-related 不仅指“植物上的月桂”，也常指“荣誉/冠军”这一象征意义。","常见搭配：laurel-related imagery/motif/symbolism（与月桂相关的意象/图案/象征）。"],"etymology":"“laurel”源自拉丁语 laurus（“月桂树”）；英语中月桂常与“月桂冠”（laurel wreath）相连，象征胜利与荣誉。“related”意为“相关的”，组合成复合形容词。","mnemonic":["把 laurel 记成“劳瑞尔/劳+荣誉”：月桂=荣誉的象征；laurel-related=和荣誉（月桂）有关的。"]}
{"word":"laureled","summary":{"en":"Laureled means “honored/award-winning,” originally linked to being crowned with laurel leaves as a sign of victory.","zh":"laureled 表示“受表彰的、获奖的”，源自“戴月桂冠”这一象征胜利与荣誉的传统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Honored or celebrated for achievement; having received a prize, title, or public praise.","zh":"因成就而受表彰的；获奖的；享有盛名的。"},"examples":[{"en":"She is a laureled scientist known for her work on climate change.","zh":"她是一位屡获荣誉的科学家，以研究气候变化而闻名。"},{"en":"The laureled team returned home to a warm welcome.","zh":"这支获奖的队伍回到家乡，受到热烈欢迎。"}]},{"partOfSpeech":"adj.","definition":{"en":"Crowned or decorated with laurel leaves (a traditional symbol of victory and honor).","zh":"戴着月桂冠的；用月桂叶装饰的（传统上象征胜利与荣誉）。"},"examples":[{"en":"In the painting, the hero stands laureled with a wreath.","zh":"在画中，英雄头戴月桂花环而立。"},{"en":"A laureled statue guarded the entrance to the old theater.","zh":"一座戴着月桂装饰的雕像守护着老剧院的入口。"}]}],"synonyms":["honored","award-winning","celebrated","acclaimed","decorated"],"phonetic":"/ˈlɔr(ə)ld/","extraExplanation":["“Laureled”来自“laurel（月桂）”。在古希腊与古罗马，月桂花环常用来奖励运动员、诗人或胜利的将军，因此“laureled”在英语里引申为“受荣誉加冕的、备受赞誉的”。","在现代英语中，它常用于正式或文学语境，强调“被认可的成就”，例如“laureled author（获奖作家）”。"]}
{"word":"laureling","summary":{"en":"“Laureling” means praising or honoring someone (as if crowning them with a laurel wreath), or describing something that is receiving such praise.","zh":"“Laureling”指对某人加冕式地赞扬/表彰（仿佛戴上桂冠），也可形容正在受到这种赞誉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of “laurel”) praising, honoring, or crowning someone—often symbolically—with “laurels” (public recognition for achievement).","zh":"（动词 laurel 的现在分词）用“桂冠/荣誉”来赞扬、表彰或（象征性地）为某人加冕，表示成就受到公开认可。"},"examples":[{"en":"The newspaper was laureling the young scientist for her discovery.","zh":"这家报纸正在为那位年轻科学家的发现而为她加冕般地称颂表彰。"},{"en":"Critics kept laureling the film as the best of the year.","zh":"评论家不断把这部电影誉为年度最佳。"}]},{"partOfSpeech":"adj.","definition":{"en":"receiving praise and honor; being celebrated (often used in a literary or elevated style).","zh":"受到赞誉与荣耀；被赞颂（多用于较文学化、较正式的表达）。"},"examples":[{"en":"In the final scene, the laureling crowd cheered the champion.","zh":"在最后一幕里，欢呼的群众为冠军送上荣誉般的喝彩。"},{"en":"She walked onstage to laureling applause.","zh":"她在一片赞颂般的掌声中走上舞台。"}]}],"synonyms":["praising","honoring","celebrating","acclaiming","crowning"],"phonetic":"/ˈlɔrəlɪŋ/","extraExplanation":["“Laurel（桂树叶、桂冠）”在古希腊和古罗马文化中象征胜利与荣耀：运动冠军、诗人或将军可能被授予月桂花环（laurel wreath）。因此动词 laurel/短语 be laureled 常带有“授予荣誉、加冕式表彰”的意味。","“Laureling”这个形式多见于较文学化或新闻评论的写法；日常口语里更常用 praise / honor / celebrate / award 等词来表达。"]}
{"word":"laurelled","summary":{"en":"Laurelled means “honored or crowned with laurels,” and can also be the past form of “to laurel” (to honor).","zh":"Laurelled意为“受表彰的/戴桂冠的”，也可作动词laurel的过去式，表示“授予荣誉”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Honored or praised, as if crowned with laurel leaves (a symbol of victory or achievement).","zh":"受表彰的；被赞誉的（仿佛戴上月桂冠，象征胜利或成就）。"},"examples":[{"en":"She is a laurelled poet whose work is taught in many schools.","zh":"她是一位备受赞誉的诗人，作品在许多学校被教授。"},{"en":"The laurelled team returned home to a warm welcome.","zh":"这支获胜受表彰的队伍回到家乡，受到热烈欢迎。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past form) To reward or celebrate someone with laurels; to honor.","zh":"（过去式）以月桂加冕；授予荣誉；表彰。"},"examples":[{"en":"In ancient times, champions were laurelled before the crowd.","zh":"在古代，冠军会在观众面前被授予月桂荣誉。"},{"en":"The author was laurelled for a lifetime of writing.","zh":"这位作家因毕生写作成就而受到表彰。"}]}],"synonyms":["honored","celebrated","acclaimed","decorated","crowned"],"phonetic":"/ˈlɔrəld/","extraExplanation":["“laurelled”来自“laurel（月桂）”。在古希腊、古罗马，月桂花环常授予诗人、将军或竞赛优胜者，因此“to be laurelled”就引申为“获得荣誉/称号”。","拼写上英式英语常见“laurelled”（双写l），美式英语也常见“laureled”。两者意思相同。","文学与文化中常见搭配：a laurelled hero（凯旋英雄）、the laurelled brow（戴桂冠的额头，较文学化的表达）。"]}
{"word":"laurellike","summary":{"en":"Laurellike means “like a laurel,” either in appearance or in the sense of honor and victory associated with laurel wreaths.","zh":"Laurellike 表示“像月桂的”，可指外形相似，也可比喻带有月桂所象征的荣誉与胜利意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a laurel (the plant), or suggesting the qualities associated with laurel, such as honor, victory, or praise.","zh":"像月桂（植物）的；或带有“月桂”所象征的意义，如荣誉、胜利、赞美。"},"examples":[{"en":"She wore a laurellike wreath during the ceremony.","zh":"她在典礼上戴着一顶类似月桂的花冠。"},{"en":"The novel ends with a laurellike sense of triumph after years of struggle.","zh":"这部小说在多年奋斗后，以一种“月桂般”的胜利感收尾。"}]}],"synonyms":["laurel-like","laureled","victorious","triumphant"],"phonetic":"/ˈlɔrəlˌlaɪk/","extraExplanation":["“laurel（月桂）”在西方文化里常与胜利和荣誉相连：古希腊、古罗马会用月桂花环奖励诗人、将军或胜利者。因此，laurellike 除了字面“像月桂”，也常用于比喻“带有荣耀、凯旋、受赞誉的气息”。","这个词较少见，常见于文学或较正式的描写中；更常用的表达包括 “laurel” 作名词（e.g., win laurels 获得荣誉）或形容词 “laureled”（受奖的、受赞誉的）。"]}
{"word":"laurelling","summary":{"en":"“Laurelling” means praising or honoring someone—often like “crowning them with laurels.”","zh":"“Laurelling”指称赞或褒奖某人，带有“为其戴上桂冠”的比喻意味（有时暗含过度吹捧）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of laurel) praising or honoring someone, often in an excessive way; figuratively “crowning” them with praise or awards.","zh":"（laurel 的现在分词/动名词）称赞、褒奖某人；常带“过度吹捧/捧上天”的意味；比喻为某人“戴上桂冠”。"},"examples":[{"en":"The article is more about laurelling the celebrity than reporting the facts.","zh":"这篇文章更像是在吹捧那位名人，而不是在报道事实。"},{"en":"They spent the whole evening laurelling his achievements.","zh":"他们整个晚上都在赞美他的成就。"},{"en":"Laurelling one team doesn’t mean ignoring everyone else’s effort.","zh":"称赞一个团队并不意味着要忽视其他人的努力。"}]}],"synonyms":["praising","honoring","extolling","celebrating","glorifying","acclaiming"],"phonetic":"/ˈlɔrəlɪŋ/","extraExplanation":["“laurel（桂冠）”源自古希腊、古罗马的传统：用月桂叶编成的花环象征胜利、荣誉与诗歌成就（如奥运获胜者或诗人）。因此 laurel 作动词时有“授予荣誉/加冕式地赞扬”的比喻用法。","拼写提示：更常见的拼写是 laureling（美式单写 l）或 laurelling（英式双写 l）。两者意思相同。"]}
{"word":"laurels","summary":{"en":"Laurels means honors for achievements, or the laurel leaves/wreath symbolizing victory.","zh":"Laurels 可指因成就获得的荣誉，也可指象征胜利的月桂叶/桂冠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"honors, praise, or recognition earned for an achievement (often from a past success)","zh":"（因成就而获得的）荣誉、赞誉、名声（常指过去的成功带来的认可）"},"examples":[{"en":"After winning the award, she didn’t want to live on her laurels—she started a new project right away.","zh":"获奖之后，她不想躺在功劳簿上——立刻开始了新项目。"},{"en":"The team worked hard to earn their laurels this season.","zh":"这支队伍努力拼搏，才在本赛季赢得了荣誉。"}]},{"partOfSpeech":"n.","definition":{"en":"leaves from a laurel plant, or a laurel wreath used as a symbol of victory","zh":"月桂树的叶子；（象征胜利的）月桂花冠/桂冠"},"examples":[{"en":"In the ceremony, the champion wore a crown of laurels.","zh":"在典礼上，冠军戴着月桂冠。"},{"en":"Laurels were used as a symbol of victory in ancient times.","zh":"在古代，月桂常被用作胜利的象征。"}]}],"synonyms":["honors","acclaim","praise","recognition","glory"],"phonetic":"/ˈlɔrəlz/","extraExplanation":["“laurels（桂冠/荣誉）”来自古希腊、古罗马传统：胜利者或杰出诗人会戴月桂花冠。英语里因此用“win/earn laurels”表示“赢得荣誉”，用“rest (or live) on one’s laurels”表示“躺在过去的功劳簿上”。","文学与文化中常见“poet laureate（桂冠诗人）”，指由国家或机构正式授予称号的诗人。"]}
{"word":"laurelship","summary":{"en":"Laurelship is a rare, poetic noun meaning the honor or fame of being crowned with laurels.","zh":"Laurelship 是一个较少见、偏诗意的名词，意为“桂冠之荣”，即被授予月桂冠所象征的荣誉与名声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetic or rare) The state of being honored or crowned with laurels; the honor, glory, or fame given for achievement.","zh":"（诗意或少见）桂冠之荣；被授予桂冠的状态；因成就而获得的荣誉、光辉或名声。"},"examples":[{"en":"After the victory, the general dreamed of laurelship and lasting fame.","zh":"胜利之后，那位将军梦想获得桂冠之荣与不朽的名声。"},{"en":"In the poem, laurelship stands for the reward that follows great effort.","zh":"在这首诗里，“laurelship”象征巨大努力之后的回报。"}]}],"synonyms":["laurels","honor","glory","acclaim"],"phonetic":"/ˈlɔrəlˌʃɪp/","extraExplanation":["“Laurel”（月桂）在古希腊与罗马文化中常用来编成花冠，授予胜利者、诗人或杰出人物，因此“laurel”常象征胜利与荣耀。“-ship”可表示“状态/身份”（如 friendship, leadership），所以 laurelship 就是“拥有桂冠之荣的状态”。该词较少见，多见于文学或带有古典气息的表达。"]}
{"word":"laurelwood","summary":{"en":"Laurelwood usually means wood from a laurel plant, or it can be a place/business name that includes “Laurelwood.”","zh":"Laurelwood 通常指“月桂（类）植物的木材”，也常作为地名或机构名称的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wood from a laurel (or mountain laurel) plant, sometimes used for small crafts or described for its scent/appearance; also used as a descriptive name for something made of this wood.","zh":"月桂（或山月桂）植物的木材；有时用于小型工艺品，或用来描述这种木材的气味/外观；也可作形容词式用法，指“由月桂木制成的/像月桂木的”。"},"examples":[{"en":"The artisan carved a small bowl from laurelwood.","zh":"工匠用月桂木雕了一个小碗。"},{"en":"A laurelwood box sat on the shelf, polished to a soft shine.","zh":"架子上放着一个月桂木盒子，打磨得泛着柔和的光泽。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for places, neighborhoods, schools, or businesses (e.g., “Laurelwood Park”); the exact meaning depends on the specific location.","zh":"专有名词：用作地名、社区名、学校名或商号名（如“Laurelwood Park/月桂林公园”）；具体含义取决于所指地点或机构。"},"examples":[{"en":"We’re meeting near Laurelwood Park after lunch.","zh":"午饭后我们在月桂林公园附近见。"},{"en":"She moved to the Laurelwood neighborhood last year.","zh":"她去年搬到了Laurelwood社区。"}]}],"synonyms":["laurel wood","bay laurel wood","mountain laurel wood"],"phonetic":"/ˈlɔrəlˌwʊd/","extraExplanation":["“Laurel”在西方文化里常象征荣誉与胜利（如古希腊罗马的“桂冠”），因此含有“laurel”的地名/品牌名往往带有“优雅、荣耀、常青”的联想。","现实中“laurel”可能指不同植物（如月桂 bay laurel、山月桂 mountain laurel 等）。在没有更多上下文时，“laurelwood”通常理解为“与月桂相关的木材/以月桂为意象的名称”。"]}
{"word":"Lauren","summary":{"en":"A common English personal name, especially for women; sometimes also a surname.","zh":"常见英文人名（更常用于女性）；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A given name (first name), most commonly used for women in English-speaking countries (also used for men, though less common).","zh":"英文名字（名），在英语国家更常见作女性名（也可作男性名，但较少见）。"},"examples":[{"en":"Lauren is joining our team next Monday.","zh":"Lauren 下周一加入我们团队。"},{"en":"I met Lauren at a conference in Chicago.","zh":"我在芝加哥的一场会议上认识了 Lauren。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), less common than the given name.","zh":"姓氏（比作名字更少见）。"},"examples":[{"en":"Dr. Lauren published a paper on climate policy.","zh":"Lauren 博士发表了一篇关于气候政策的论文。"}]}],"synonyms":["Laura","Laurence","Lauren"],"phonetic":"/ˈlɔrən/","extraExplanation":["在英文文化里，这是一个非常常见、比较“经典”的名字。拼写相同，但性别使用上更偏女性；发音一般为两拍，重音在第一拍。","相关文化联想：laurel（月桂）在西方常象征荣誉与胜利（如“laureate”“poet laureate”等表达）。"],"etymology":"源自拉丁语地名 Laurentum（意为“月桂之地”一类的含义），经由 Laurence / Laura 等名字体系演变而来；与“月桂（laurel）”的象征意义（荣誉、胜利）有关联。","mnemonic":["联想 laurel（月桂）→ 月桂象征荣誉与胜利；把它记成“像月桂一样有光彩的名字”。","中文谐音小记：/ˈlɔrən/ 可记作“洛-仁”（只是帮助记发音，不代表含义）。"]}
{"word":"Laurence","summary":{"en":"a personal name; also used as a surname.","zh":"人名；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually masculine in American English), a spelling variant of “Lawrence.”","zh":"人名（在美式英语里多为男性名），常见拼写变体为“Lawrence”。"},"examples":[{"en":"Laurence is joining our team next month.","zh":"Laurence 下个月加入我们团队。"},{"en":"I met Laurence at a conference in Boston.","zh":"我在波士顿的一场会议上认识了 Laurence。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Laurence published a new paper on climate science.","zh":"Laurence 博士发表了一篇关于气候科学的新论文。"},{"en":"Her last name is Laurence.","zh":"她的姓是 Laurence。"}]}],"synonyms":["Lawrence"],"phonetic":"/ˈlɔrəns/","extraExplanation":["拼写与性别提示：美式英语里 Laurence 多被当作男性名；在英式英语中，Laurence 也常见作男性名，而 Laura/ Lauren 等更常见作女性名。","发音提示：重音在第一个音节，常读作“LOR-əns”（类似“劳-仁斯/劳-伦斯”的节奏）。"],"etymology":"源自拉丁语人名 Laurentius，意为“来自 Laurentum（古罗马地名）的人”。Laurentius 常与 laurel（月桂）联想在一起，因为月桂在古罗马象征荣誉与胜利。","mnemonic":["记忆法：把 Laurence 联想到 “Lawrence”——看到 AU 就想成同一个名字的另一种拼写。","文化联想：laurel（月桂）象征“荣誉/冠军”，可帮助记住这个名字的古典来源。"]}
{"word":"laurence","summary":{"en":"Laurence is a personal name (and sometimes a surname), commonly a variant spelling of Lawrence.","zh":"Laurence 是人名（有时也作姓氏），常见为 Lawrence 的一种拼写形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), a variant spelling of Lawrence; used for any gender but more common for men in English-speaking countries","zh":"人名（名字）：Lawrence 的一种拼写形式；可用于任何性别，但在英语国家更常见于男性"},"examples":[{"en":"Laurence is my coworker in the marketing team.","zh":"Laurence 是我市场团队的同事。"},{"en":"Her middle name is Laurence, after her grandfather.","zh":"她的中间名叫 Laurence，是为纪念她的祖父。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏"},"examples":[{"en":"Dr. Laurence will see you now.","zh":"Laurence 医生现在会见你。"}]}],"synonyms":["Lawrence"],"phonetic":"/ˈlɔr.əns/","extraExplanation":["Laurence 通常被认为是 Lawrence 的变体拼写，两者在日常使用中常常读音相同或非常接近。","名字的来源与拉丁语 Laurentius 有关，传统上常被解释为“来自劳伦图姆（Laurentum）的人”，并常联想到 laurel（月桂）象征的“荣誉、胜利”。","文化提示：Laurence 既可作男性名也可作女性名；例如英国演员 Laurence Olivier（劳伦斯·奥利弗）使这个拼写在部分地区更为人熟知。"]}
{"word":"laurencia","summary":{"en":"“Laurencia” is usually a female name, and it is also famous as a character in Lope de Vega’s play *Fuenteovejuna*.","zh":"“Laurencia”通常是女性名字；同时也是洛佩·德·维加戏剧《羊泉村》中的著名角色名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a variant of “Laurencia,” related to “Lawrence/Laurentius”).","zh":"女性名字（“Laurencia”的一种写法/变体，与“Lawrence / Laurentius”同源）。"},"examples":[{"en":"Laurencia is a Spanish-sounding name.","zh":"Laurencia 是一个听起来很西班牙风格的名字。"},{"en":"They named their daughter Laurencia after a character from literature.","zh":"他们给女儿取名 Laurencia，是因为文学作品里的一个角色。"}]},{"partOfSpeech":"other","definition":{"en":"a well-known character in the Spanish play *Fuenteovejuna* (1619) by Lope de Vega; she becomes a symbol of resistance against abuse of power.","zh":"西班牙戏剧《羊泉村》（*Fuenteovejuna*，1619，洛佩·德·维加著）中的著名角色；她常被视为反抗暴政与权力侵害的象征。"},"examples":[{"en":"In *Fuenteovejuna*, Laurencia delivers a powerful speech that sparks collective action.","zh":"在《羊泉村》中，Laurencia 的一段有力演说点燃了村民的集体行动。"},{"en":"Some readers view Laurencia as an early feminist figure in Spanish literature.","zh":"一些读者把 Laurencia 视为西班牙文学中较早的女性主义象征人物。"}]}],"synonyms":["Laura","Lauren","Lawrence (related name)"],"phonetic":"/lɔːˈrɛnsiə/","extraExplanation":["“Laurencia”常被认为与拉丁语 *Laurentius*（意为“来自劳伦图姆的人”）有关，也常与“月桂/桂冠（laurel）”的意象联系在一起（象征荣誉与胜利）。","《羊泉村》属于“西班牙黄金时代”戏剧名作，故事核心是村民在压迫下联合反抗；Laurencia 的控诉与号召在戏剧史上很有名，经常被引用来讨论权力、正义与集体抗争。"]}
{"word":"Laurene","summary":{"en":"Laurene is a female first name, a less common variant related to Lauren.","zh":"Laurene 是女性名字，与 Lauren 同源，是较少见的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a less common spelling variant of “Laurene,” related to “Lauren,” ultimately connected to Latin *Laurentius*, ‘from Laurentum’ and the laurel symbol).","zh":"女性名字（较少见的拼写形式；与“Lauren”同源，最终可追溯到拉丁语 *Laurentius*，意为“来自劳伦图姆”；也常让人联想到象征荣誉的“月桂”）。"},"examples":[{"en":"Laurene is a French-leaning spelling of a name many people know as Lauren.","zh":"Laurene 是一种偏法式的拼写，很多人更熟悉的是 Lauren。"},{"en":"Laurene introduced herself at the meeting and spelled her name slowly.","zh":"Laurene 在会议上自我介绍，并慢慢拼出了她的名字。"},{"en":"One well-known person with this name is Laurene Powell Jobs.","zh":"这个名字的知名人物之一是 Laurene Powell Jobs（劳伦·鲍威尔·乔布斯）。"}]}],"synonyms":["Lauren","Laurine","Lorraine"],"phonetic":"/lɔːˈriːn/","extraExplanation":["“Laurene”在英语语境中通常被当作专有名词（人名）。发音在不同地区可能会有轻微差异：有些人读得更接近“luh-REEN”，也有人更接近“lor-REEN”。如果你在自我介绍时遇到别人读错，简单说一句“It's pronounced…”即可。"]}
{"word":"laurent","summary":{"en":"“Laurent” is mainly a French person’s name (given name or surname). Sometimes it refers to “Saint Laurent,” the fashion brand.","zh":"“Laurent”主要是法语人名（名字或姓氏）；有时也用来指代时尚品牌“Saint Laurent”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A French masculine given name and surname. In English contexts, it is usually a person’s name (e.g., a classmate, author, athlete).","zh":"（专有名词）法语常见的男性名字和姓氏。在英语语境中通常就是指一个人的名字（如同学、作者、运动员等）。"},"examples":[{"en":"Laurent is my lab partner this semester.","zh":"Laurent 是我这学期的实验搭档。"},{"en":"I got an email from Laurent about the meeting time.","zh":"我收到了 Laurent 发来的邮件，内容是会议时间。"}]},{"partOfSpeech":"other","definition":{"en":"(Common reference) Short for well-known names or brands that include “Laurent,” especially “Saint Laurent” (a French fashion house).","zh":"（常见指代）有时用来简略指包含“Laurent”的知名名称或品牌，尤其是 “Saint Laurent”（法国时尚品牌）。"},"examples":[{"en":"She bought a Saint Laurent bag, so people just say “Laurent” sometimes.","zh":"她买了一个 Saint Laurent 的包，所以有时大家就简称“Laurent”。"},{"en":"Is that Laurent, or a different brand?","zh":"那是 Laurent（指 Saint Laurent）吗，还是别的牌子？"}]}],"synonyms":["Lawrence (English equivalent name)","Laurentius (Latin root form)"],"phonetic":"/lɔˈrɑnt/","extraExplanation":["“Laurent”源自拉丁语“Laurentius”，意思是“来自 Laurentum（拉伦图姆）的人”。Laurentum 是古意大利的地名。","它也和“laurel（月桂）”有关联：月桂在西方文化里常象征荣誉与胜利（如“laureate/桂冠”）。因此 Laurent 这个名字常带有“荣耀、桂冠”的文化联想。","英语里更常见的对应名字是 “Lawrence”。如果你在英语国家遇到 Laurent，通常读写保持法语形式，但有些人会被误叫成 Lawrence。"]}
{"word":"Laurentian","summary":{"en":"connected with Canada’s Saint Lawrence/Laurentian region or its ancient rock formations","zh":"与加拿大圣劳伦斯/劳伦琴地区或其古老地层有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Saint Lawrence River region or to the Laurentian Mountains/area in Canada","zh":"与加拿大圣劳伦斯河流域或劳伦琴山区/地区有关的"},"examples":[{"en":"Many towns along the river have strong Laurentian cultural influences.","zh":"河岸的许多城镇都受到浓厚的劳伦琴地区文化影响。"},{"en":"We spent a weekend hiking in the Laurentian Mountains north of Montreal.","zh":"我们在蒙特利尔以北的劳伦琴山脉徒步度过了一个周末。"}]},{"partOfSpeech":"adj.","definition":{"en":"(geology) relating to very ancient rock formations, especially those associated with the Canadian Shield","zh":"（地质）与极古老的岩层有关，尤指与加拿大地盾相关的地层"},"examples":[{"en":"The museum exhibit explains Laurentian rock and how it shaped the region.","zh":"博物馆展览讲解了劳伦琴古老岩层以及它如何塑造该地区。"},{"en":"Some older books use “Laurentian” for early Precambrian rocks.","zh":"一些较早的书会用“Laurentian”指代前寒武纪早期岩层。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Saint Lawrence/Laurentian region","zh":"圣劳伦斯河或劳伦琴地区的人"},"examples":[{"en":"She’s a proud Laurentian who grew up near the Saint Lawrence River.","zh":"她在圣劳伦斯河附近长大，是一位自豪的劳伦琴地区人。"}]}],"synonyms":["St. Lawrence","Laurentide","Canadian Shield"],"phonetic":"lɔˈrɛnʃən","extraExplanation":["常见专名：Laurentian Mountains（劳伦琴山脉，魁北克南部一带）、Laurentian Shield / Canadian Shield（劳伦琴地盾/加拿大地盾，覆盖加拿大大范围的古老基底岩）。","文学与文化语境里，“Laurentian”常用来营造“加拿大东北部、森林湖区、法语与英法交织的历史”这类地域氛围。"],"etymology":"源自法语姓氏/地名词根“Laurent-”（与“Laurent/Lawrence”同源），再加上形容词后缀“-ian”（表示“……的/与……有关的/……的人”）。在北美语境中多指加拿大与圣劳伦斯河及其周边地貌相关的事物。","mnemonic":["把它拆成“Laurent（劳伦/劳伦斯）+ -ian（……的/……人）”：记成“劳伦斯地区的/劳伦斯地区的人”。","联想地理：看到“Laurentian”就想到“Saint Lawrence（圣劳伦斯河）”和加拿大的“地盾（Shield）/山脉（Mountains）”。"]}
{"word":"laurentian","summary":{"en":"Laurentian usually means “connected to the St. Lawrence/Canadian Shield region,” and can also refer to a person linked to something named Laurentian (like Laurentian University).","zh":"Laurentian 通常指“与圣劳伦斯河/加拿大地盾地区相关”，也可指与名为 Laurentian 的机构或地点有关的人（如劳伦森大学学生/校友）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the region around the St. Lawrence River and the ancient rock area of eastern/central Canada (often the Canadian Shield), or to things named for it (e.g., Laurentian Mountains).","zh":"（形容词）与圣劳伦斯河周边地区、加拿大东/中部的古老岩石地带（常指加拿大地盾）有关的；或与以此命名的事物有关（如劳伦琴山脉）。"},"examples":[{"en":"They took a road trip through the Laurentian Mountains in Quebec.","zh":"他们在魁北克的劳伦琴山脉自驾旅行。"},{"en":"Many Laurentian landscapes are shaped by ancient rock and glaciers.","zh":"许多劳伦琴地区的景观受古老岩石与冰川作用形成。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing connected with a place or institution named “Laurentian” (most commonly, a student or graduate of Laurentian University).","zh":"（名词）与名为“Laurentian”的地方或机构有关的人或事物（最常见指劳伦森大学的学生或校友）。"},"examples":[{"en":"As a Laurentian, she volunteered at the campus welcome desk.","zh":"作为劳伦森大学的学生/校友，她在校园迎新服务台做志愿者。"}]},{"partOfSpeech":"adj.","definition":{"en":"In geology (capitalized), relating to very old Precambrian rocks once referred to as the “Laurentian” system.","zh":"（形容词，地质学，首字母大写）指非常古老的前寒武纪岩石，过去曾被称为“Laurentian（劳伦琴）地层/系”。"},"examples":[{"en":"The museum display mentions Laurentian rocks formed billions of years ago.","zh":"博物馆展览提到数十亿年前形成的劳伦琴岩石。"}]}],"synonyms":["St.-Lawrence-related","Canadian Shield (related)","Quebec Laurentides (related)"],"phonetic":"/lɔˈrɛnʃən/","extraExplanation":["“Laurentian”来自“St. Lawrence（圣劳伦斯）”的法语形式“Laurent”，在加拿大语境里常与魁北克的劳伦琴山脉（Les Laurentides）或加拿大地盾相关。","地质学里“Laurentian”是一种较旧的命名方式；现代教材更常用“Canadian Shield（加拿大地盾）”或更细的地层/岩体名称。"]}
{"word":"laurentide","summary":{"en":"Laurentide mainly means “connected with the Laurentide Ice Sheet,” a massive Ice Age ice sheet in North America.","zh":"Laurentide 主要指“与劳伦泰德冰盖有关的”，即冰河时期北美洲曾存在的巨大冰盖。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Laurentide Ice Sheet (the huge ice sheet that covered much of Canada and the northern United States during the last Ice Age).","zh":"与“劳伦泰德冰盖”有关的；指冰河时期覆盖加拿大及美国北部的大型冰盖。"},"examples":[{"en":"Laurentide glaciers shaped many of the lakes and valleys in Canada.","zh":"劳伦泰德冰川塑造了加拿大许多湖泊和山谷。"},{"en":"Scientists study Laurentide ice to understand past climate change.","zh":"科学家研究劳伦泰德冰盖，以了解过去的气候变化。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in geology and geography for things formed by or connected with the Laurentide Ice Sheet (for example, landforms or deposits).","zh":"（地质/地理用语）指由劳伦泰德冰盖形成或与之相关的事物（如地貌或沉积物）的名称/用法。"},"examples":[{"en":"The area contains Laurentide deposits left by retreating ice.","zh":"该地区有冰退时留下的劳伦泰德沉积物。"},{"en":"A Laurentide meltwater channel runs through the plain.","zh":"平原上有一条劳伦泰德融水通道。"}]}],"synonyms":["glacial (contextual)","Ice Age (contextual)","Laurentian (related, not always interchangeable)"],"phonetic":"/lɔˈrɛn.taɪd/","extraExplanation":["“Laurentide”常见于学术或科普语境（地质学、古气候学、地理学）。它来自“Laurentian（劳伦琴）”相关的地名传统，尤其与加拿大的圣劳伦斯地区（St. Lawrence / Laurentian）有关。","最常见的搭配是 Laurentide Ice Sheet（劳伦泰德冰盖）。在北美地质史中，它与冰碛（moraines）、冰川沉积物（glacial deposits）、融水通道（meltwater channels）等概念经常一起出现。"]}
{"word":"Laurentius","summary":{"en":"the Latin form of the male name Lawrence; also used in Christian and historical contexts.","zh":"男性名“劳伦斯”的拉丁语形式；也常见于基督教与历史语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin masculine given name; the Latin form of “Lawrence,” historically used in church, scholarly, and historical texts.","zh":"拉丁语男性人名；“Lawrence（劳伦斯）”的拉丁语形式，常见于教会、学术与历史文献中。"},"examples":[{"en":"In medieval records, Laurentius often appears as the Latin version of the name Lawrence.","zh":"在中世纪档案中，Laurentius 常作为 Lawrence 的拉丁文写法出现。"},{"en":"The manuscript lists the author as Laurentius, though later editions use Lawrence.","zh":"手稿把作者写作 Laurentius，但后来的版本改用 Lawrence。"}]},{"partOfSpeech":"other","definition":{"en":"a name associated with early Christian tradition, especially Saint Lawrence (often written as “Sanctus Laurentius” in Latin).","zh":"与早期基督教传统相关的名字，尤其指圣劳伦斯（拉丁文常写作 “Sanctus Laurentius”）。"},"examples":[{"en":"The inscription reads “Sanctus Laurentius,” referring to Saint Lawrence.","zh":"铭文写着 “Sanctus Laurentius”，指的是圣劳伦斯。"},{"en":"Many churches in Europe were dedicated to Laurentius under the name of Saint Lawrence.","zh":"欧洲许多教堂以 Laurentius（圣劳伦斯）之名奉献建立。"}]}],"synonyms":["Lawrence"],"phonetic":"/lɔːˈrɛn.ti.əs/","extraExplanation":["在英语语境中，Laurentius 多出现在拉丁文原文、碑铭、教会文件或学术写作里；日常英语更常用 Lawrence。","如果你在古籍或教堂铭文中看到 Laurentius，它通常不是“生词”，而是人名的拉丁化写法（Latinized form）。"],"etymology":"源自拉丁语 Laurentius，原意为“来自 Laurentum（劳伦图姆）的人”。该地名常被认为与 laurus（“月桂”）有关；月桂在古罗马象征荣誉与胜利，因此这个名字也常被联想到“月桂/荣耀”的意象。","mnemonic":["把 Laurentius 记成“Lawrence 的拉丁文马甲”：看到 -tius 结尾，常是拉丁化人名。","联想 laurel（月桂冠）= 荣誉；Laurentius ≈ “戴月桂冠的人/荣耀之名”（帮助记住文化意象）。"]}
{"word":"laureole","summary":{"en":"Laureole means a halo or ring of light, and by extension an aura of honor or fame.","zh":"Laureole 指“光环/光晕”，也可比喻“荣光、声望的光环”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A glowing ring or halo of light around someone’s head or around a bright object (often in art or religious imagery).","zh":"（常见于艺术或宗教意象中的）光环；（围绕头部或明亮物体的）光晕。"},"examples":[{"en":"In the painting, the saint has a golden laureole around his head.","zh":"在那幅画里，圣人的头上有一圈金色的光环。"},{"en":"The lamp seemed to wear a soft laureole in the fog.","zh":"在雾气中，那盏灯仿佛戴着一圈柔和的光晕。"}]},{"partOfSpeech":"n.","definition":{"en":"A symbolic glow of honor or fame surrounding a person; an aura of prestige.","zh":"（比喻）荣光；声望的光环；荣耀的气场。"},"examples":[{"en":"Winning the prize put a new laureole around her reputation.","zh":"获得那个奖项为她的名声增添了新的荣光。"},{"en":"The leader spoke with the laureole of past victories.","zh":"那位领袖带着昔日胜利的光环发言。"}]}],"synonyms":["halo","aureole","nimbus","glow","aura"],"phonetic":"/ˈlɔriˌoʊl/","extraExplanation":["词源提示：laureole 来自“laurel（月桂）”，月桂花冠在古希腊罗马象征胜利与荣誉，所以它既可指画中的“光环/光晕”，也常引申为“荣耀的光环”。","用法小提醒：laureole 属于较文学、较正式的词；日常英语里更常用 halo（光环）或 glow（光晕/光芒）。","文学/艺术语境：在基督教艺术中，圣人常被画上光环；写作里用 laureole 会带一点“古典、诗意、宗教或象征意味”的色彩。"]}
{"word":"laurestine","summary":{"en":"an evergreen viburnum shrub grown for its clustered flowers","zh":"一种常绿荚蒾类观赏灌木，开成簇小花"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen shrub (Viburnum tinus) with leathery leaves and clusters of small white to pink flowers, often grown as an ornamental plant","zh":"一种常绿灌木（地中海荚蒾／Viburnum tinus），叶片厚而有光泽，开成簇的白色到淡粉色小花，常作观赏植物栽培"},"examples":[{"en":"The laurestine by the gate kept its green leaves even in winter.","zh":"大门旁的地中海荚蒾冬天也依然绿叶常在。"},{"en":"Gardeners plant laurestine for its winter-to-spring flowers and low maintenance.","zh":"园艺爱好者种地中海荚蒾，是因为它冬春开花、好打理。"}]}],"synonyms":["laurustinus","viburnum","Viburnum tinus"],"phonetic":"/ˈlɔrɪˌstin/","extraExplanation":["Laurestine 在园艺语境里多指 Viburnum tinus（常见英文名也写作 laurustinus）。它原产地中海地区，常被用作绿篱或庭院灌木，花期常在冬末到春季。"],"etymology":"来自新拉丁语名称（常见作 laurustinus），由 laur-（与“月桂”laurel 同源）+ -tinus 组成；因其叶形常被认为有点像月桂而得名。","mnemonic":["把它拆成 laurel（月桂）+ -stine：联想到“像月桂一样常绿的灌木”。","记成“劳瑞（laure-）+ 斯汀（-stine）”：劳瑞家门口那丛冬天还开花的常绿灌木。"]}
{"word":"laurestinus","summary":{"en":"Laurestinus is an evergreen flowering shrub (Viburnum tinus) often grown in gardens.","zh":"Laurestinus 指一种常绿开花灌木（桂叶荚蒾，Viburnum tinus），常见于园艺栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen shrub (Viburnum tinus) with glossy, laurel-like leaves and small white or pinkish flowers, often grown as an ornamental plant","zh":"（桂叶荚蒾；学名 Viburnum tinus）一种常绿灌木，叶片有点像月桂叶，开白色或淡粉色小花，常用于观赏栽培"},"examples":[{"en":"The laurestinus by the front door blooms in late winter and early spring.","zh":"门口的桂叶荚蒾在冬末到早春开花。"},{"en":"Gardeners like laurestinus because it stays green all year.","zh":"园艺爱好者喜欢桂叶荚蒾，因为它四季常绿。"}]}],"synonyms":["Viburnum tinus","laurustinus"],"phonetic":"/ˌlɔrəsˈtaɪnəs/","extraExplanation":["“Laurestinus”也常写作“laurustinus”，词形里含有“laurel（月桂）”，因为它的叶子外观有点像月桂叶，但它并不是真正的月桂（Laurus nobilis）。","它原产地中常见于地中海地区，在英语园艺语境里常被用来指代这种“冬末早春开花、常绿、耐修剪”的庭院灌木。"]}
{"word":"Lauretta","summary":{"en":"a feminine personal name, often associated with Italian usage and the idea of laurel (honor).","zh":"女性人名，常见于意大利语语境，并联想到“月桂/桂冠（荣誉）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A feminine given name, used especially in Italian or Italian-American contexts; often felt as a more ornate form of “Laura.”","zh":"女性名字，常见于意大利语或意裔语境；常被视为“Laura（劳拉）”的更华丽/更昵称化形式。"},"examples":[{"en":"Lauretta moved to New York with her family when she was six.","zh":"Lauretta六岁时跟家人搬到了纽约。"},{"en":"We invited Lauretta to speak at the community event.","zh":"我们邀请Lauretta在社区活动上发言。"},{"en":"In Puccini’s opera, Lauretta sings the famous aria “O mio babbino caro.”","zh":"在普契尼的歌剧中，角色Lauretta演唱了著名咏叹调《O mio babbino caro》。"}]}],"synonyms":["Laura","Loretta","Laurel"],"phonetic":"/lɔˈrɛtə/","extraExplanation":["在意大利文化里，“月桂/桂冠”常象征荣耀与成就（如诗人桂冠、冠军桂冠），因此这类名字常带有“受荣誉环绕”的联想。","音乐/文学里较知名的用法：普契尼独幕歌剧《Gianni Schicchi》中的角色 Lauretta，以咏叹调《O mio babbino caro》广为人知。"],"etymology":"源自意大利语女性名 **Lauretta**，常被解释为 **Laura** 的昵称/指小形式；而 **Laura** 追溯到拉丁语 *laurus*（月桂树、桂冠），与“荣誉、胜利”的意象相关。","mnemonic":["联想“laurel（月桂/桂冠）→ 荣誉”，看到 Lauretta 就想到“戴桂冠的女孩”。","把它拆成“Laura + -etta（意大利语里常见的昵称/小词尾）”，记成“更可爱、更精致的 Laura”。"]}
{"word":"laurianne","summary":{"en":"Laurianne is a feminine first name, often a combined or variant form of Laura (Laurie) + Anne.","zh":"Laurianne 是女性名字，常被看作 Laura（Laurie）+ Anne 的组合或变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), often treated as a variant of “Laurie-Ann / Laurie Anne,” combining the names Laura (or Laurie) and Anne","zh":"女性名字（名），常被视为“Laurie-Ann / Laurie Anne”的变体，由 Laura（或 Laurie）与 Anne 组合而成"},"examples":[{"en":"Laurianne will join our class next semester.","zh":"Laurianne 下学期会加入我们班。"},{"en":"How do you spell your name—Laurianne or Lorianne?","zh":"你的名字怎么拼——Laurianne 还是 Lorianne？"}]}],"synonyms":["Laurie-Ann","Laurieanne","Lorianne","Marianne"],"phonetic":"/ˌlɔriˈæn/","extraExplanation":["“Laurianne”多见于法语或受法语影响的地区（如加拿大魁北克等），也可能是家庭自创的拼写。","常见相关名字：Laura / Laurie / Anne / Marianne；常见拼写变体：Laurie-Ann，Laurieanne，Lorianne。","作为人名时通常不翻译含义；若需要了解词源：Laura 常与“月桂（laurel）”相关，Anne 源自希伯来语，常被解释为“恩典/仁慈”。"]}
{"word":"lauric","summary":{"en":"Lauric means ‘related to or containing lauric acid,’ a fatty acid common in coconut oil.","zh":"lauric 指“与月桂酸有关或含月桂酸的”，月桂酸是一种常见于椰子油等的脂肪酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or containing lauric acid (a fatty acid found especially in coconut oil and palm kernel oil)","zh":"月桂酸的；与月桂酸有关的；含月桂酸的（常见于椰子油、棕榈仁油等）"},"examples":[{"en":"Coconut oil is rich in lauric acid, so it’s sometimes described as having a lauric profile.","zh":"椰子油富含月桂酸，所以有时会被描述为“月桂酸特征”明显。"},{"en":"The label lists lauric components among the main fatty acids.","zh":"标签上把月桂酸相关成分列为主要脂肪酸之一。"}]}],"synonyms":["of lauric acid","laurate (related form)"],"phonetic":"/ˈlɔrɪk/","extraExplanation":["“lauric”来自“laurel（月桂）”，因为月桂酸最早与月桂植物有关联而得名。日常英语里它多出现在营养、化妆品配方、食品科学等语境中。"]}
{"word":"Laurie","summary":{"en":"a personal name (also used as a family name)","zh":"人名（也可作姓氏）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name, commonly used for females (as a form of Laura) and sometimes for males (as a form of Laurence/Lawrence)","zh":"人名：常见作女性名（Laura 的昵称/变体），也可作男性名（Laurence/Lawrence 的昵称/变体）"},"examples":[{"en":"Laurie is meeting us for coffee after class.","zh":"Laurie 课后要和我们去喝咖啡。"},{"en":"In the novel, Laurie is a loyal friend who supports the main characters.","zh":"在小说里，Laurie 是个忠诚的朋友，会支持主角们。"}]},{"partOfSpeech":"other","definition":{"en":"a surname (family name)","zh":"姓氏（家族姓）"},"examples":[{"en":"Dr. Laurie will speak at the conference.","zh":"Laurie 医生将在会议上发言。"}]}],"synonyms":["Laura","Lauren","Laurence","Lawrence"],"phonetic":"ˈlɔri","extraExplanation":["文化小补充：英文名里“昵称/小名（nickname）”很常见，比如 Robert→Bob，Elizabeth→Liz。“Laurie”也常作为亲近或日常场景的叫法。","文学提示：在《小妇人》（Little Women）中，“Laurie”是 Theodore “Laurie” Laurence 的昵称，因此很多英语读者会把这个名字和该角色联系起来。"],"etymology":"“Laurie”多为昵称/变体用法：女性常来自“Laura”（与拉丁语 laurus“月桂”有关，象征荣誉/胜利）；男性常来自“Laurence/Lawrence”（源自拉丁语 Laurentius，原意为“来自 Laurentinum（地名）的人”，也与“月桂”意象发生联想）。","mnemonic":["联想“laurel（月桂冠）→荣誉/胜利”：Laurie 听起来像“lory/lo-ree”，想象戴着月桂冠的 Laurie。","中文谐音记忆：‘劳里/洛里’——把它当作一个常见英文名的音译来记。"]}
{"word":"laurie","summary":{"en":"Laurie is a common English first name (often a nickname for Lawrence or Laura/Lauren) and can also be a surname.","zh":"Laurie 是常见英文人名（常作 Lawrence 或 Laura/Lauren 的昵称），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for any gender but especially common as a nickname for Lawrence (male) or Laura/Lauren (female).","zh":"人名（名），可用于任何性别；常见作 Lawrence（男名）或 Laura/Lauren（女名）的昵称。"},"examples":[{"en":"Laurie is joining us for dinner tonight.","zh":"Laurie 今晚和我们一起吃饭。"},{"en":"Her full name is Laura, but everyone calls her Laurie.","zh":"她的全名是 Laura，但大家都叫她 Laurie。"},{"en":"Laurie introduced himself at the meeting.","zh":"Laurie 在会上做了自我介绍。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏。"},"examples":[{"en":"Dr. Laurie will see you now.","zh":"Laurie 医生现在可以见你了。"}]}],"synonyms":["Lawrence","Laura","Lauren","Lori"],"phonetic":"/ˈlɔri/","extraExplanation":["“Laurie”在英语文化中常让人联想到《小妇人》（Little Women）里的角色 Theodore “Laurie” Laurence，因此在文学或影视语境里出现时，有时会带一点“亲切、青春”的感觉。","拼写相近的“laurel”（月桂）是另一个词，意思和“Laurie”这个人名无关，注意不要混淆。"]}
{"word":"Laurie-Ann","summary":{"en":"a female compound first name","zh":"女性复合英文名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name; a compound form combining “Laurie” and “Ann,” often used as a first name (sometimes written with a hyphen)","zh":"女性名字；由“Laurie”和“Ann”组合而成的复合名，常作为名字使用（有时用连字符连接）"},"examples":[{"en":"Laurie-Ann introduced herself at the meeting and shook everyone’s hand.","zh":"Laurie-Ann在会议上做了自我介绍，并和每个人握手。"},{"en":"I saw Laurie-Ann’s name on the guest list.","zh":"我在宾客名单上看到了Laurie-Ann的名字。"}]}],"phonetic":"/ˌlɔɹi ˈæn/","extraExplanation":["发音上常在连字符处轻微停顿：LAWR-ee AN。书写时有多种形式：Laurie-Ann、Laurie Ann、Laurieann。","在不同地区与家庭中，复合名常用来同时纪念两位亲人或融合两种传统。"],"etymology":"“Laurie-Ann”通常由两个英文名组合而成：Laurie多为Laura/Laurence的昵称或变体（与拉丁语词根laurus“月桂”相关，象征荣誉；或与Laurence相关，含“来自劳伦图姆”之意）；Ann源自希伯来语 Hannah，含“恩典、仁慈”之意。连字符写法常见于英语文化中的复合名。","mnemonic":["记成“Laurie + Ann”：前半像“劳里”，后半像“安”，两段拼在一起就是一个完整名字。","把它联想成“月桂的荣誉（Laurie）+ 恩典（Ann）”，记得更牢。"]}
{"word":"Laurieanne","summary":{"en":"a female first name, often a combined form of Laurie and Anne","zh":"女性英文名，常由 Laurie 与 Anne 组合而成"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a first name), often formed as a combined name like “Laurie + Anne.”","zh":"女性名字（名），常见于“Laurie + Anne”这类组合名字。"},"examples":[{"en":"Laurieanne introduced herself at the start of the meeting.","zh":"Laurieanne 在会议一开始做了自我介绍。"},{"en":"The teacher wrote “Laurieanne” on the certificate.","zh":"老师把“Laurieanne”写在证书上。"}]}],"synonyms":["Laurie-Anne","Laurie Anne","Lorianne","Loriann"],"phonetic":"ˌlɔriˈæn","extraExplanation":["作为专有名词（人名），一般不翻译词义；在中文里通常音译（如“劳里安/劳丽安”等），具体以本人偏好为准。","书写上有时会出现连字符或空格变体：Laurie-Anne / Laurie Anne。"],"etymology":"多见为组合名：Laurieanne ≈ Laurie + Anne。Laurie 常作为 Laura / Lorraine 等名字的昵称或变体；Laura 源自拉丁语 laurus（“月桂”，引申为“荣誉、胜利”）。Anne 源自希伯来语 Hannah（“恩典、仁慈”）。","mnemonic":["把它拆开记：Laurie + Anne（两个常见英文名拼在一起）。","联想中文音：\"劳里\" + \"安\" → 记成“劳里安”。"]}
{"word":"laurin","summary":{"en":"“Laurin” is mainly used as a personal name.","zh":"“Laurin”主要用作人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually masculine in German-speaking countries, sometimes unisex elsewhere), similar to “Lauren” or “Laurence.”","zh":"人名（在德语地区多为男性名，在其他地区有时为中性名），与“Lauren / Laurence”等名字同源或相近。"},"examples":[{"en":"Laurin moved to the U.S. for college.","zh":"Laurin 去美国上大学了。"},{"en":"In this story, Laurin is the main character.","zh":"在这个故事里，Laurin 是主角。"}]}],"synonyms":["Lauren","Laurence","Loren"],"phonetic":"/ˈlɔrɪn/","extraExplanation":["“Laurin”多被视为“Laurence / Laurentius”（拉丁语姓氏，常被解释为“来自劳伦图姆”）或与“laurel（月桂）”相关名字的变体，因此常带有“月桂（象征荣誉与胜利）”的文化联想。","在英语语境中，Laurin通常被当作专有名词使用（首字母大写）。如果你在句子里看到小写“laurin”，多半是拼写、专名大小写或特定语境（如用户名/品牌名）的写法。"]}
{"word":"Laurine","summary":{"en":"a female name linked to laurel imagery; also an older adjective meaning “laurel-related.”","zh":"常见作女性名字，联想到月桂与荣誉；也可作较旧用法的形容词，意为“与月桂有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a variant of Laura/Lauren), often associated with “laurel” and the idea of honor or victory","zh":"女性名字（Laura/Lauren 的变体），常与“月桂”意象相关，引申为荣誉、胜利"},"examples":[{"en":"Laurine moved to Chicago for graduate school.","zh":"Laurine 为了读研究生搬到了芝加哥。"},{"en":"They named their daughter Laurine after her grandmother.","zh":"他们用 Laurine 给女儿取名，是为了纪念她的祖母。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to laurel; having the qualities or fragrance associated with laurel (botanical/literary)","zh":"（植物/文学用语）与月桂有关的；具有月桂特征或香气的"},"examples":[{"en":"In older texts, “laurine” may describe leaves resembling laurel.","zh":"在较旧的文本中，laurine 可能用来形容像月桂一样的叶子。"},{"en":"The poem uses laurine imagery to suggest glory and achievement.","zh":"这首诗用“月桂”的意象来暗示荣耀与成就。"}]}],"synonyms":["laurel"],"phonetic":"/lɔˈrin/","extraExplanation":["“月桂冠”（laurel wreath）在西方文化里常象征胜利、成就与荣誉（古希腊罗马传统）。因此一些同源名字（如 Laura、Lauren、Laurine）会被赋予类似的文化含义。","作为形容词的 laurine 在现代日常英语里不常见，更可能出现在植物学描述或文学风格的表达中。"],"etymology":"来自拉丁语 laurus（“月桂”）+ 英语形容词后缀 -ine（表示“……的、与……有关的”）。作为人名时，多与 Laura/Lauren 同源，文化联想常指“月桂冠→荣誉/胜利”。","mnemonic":["把 laur- 联想成 laurel（月桂）：看到 laur- 就想到“月桂冠＝荣耀”。","Laurine 的发音像“劳-琳”，可记成“劳而有荣（laurel）→ 荣耀的名字”。"]}
{"word":"laurinoxylon","summary":{"en":"Laurinoxylon is a paleobotanical genus name for fossil wood resembling the laurel family.","zh":"Laurinoxylon 是古植物学中用于指“类似月桂科特征的化石木材”的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (paleobotanical) genus name used for fossilized wood that shows features similar to the laurel family (Lauraceae).","zh":"（古植物学）一个化石木材的属名，用于指具有类似樟科/桂科（Lauraceae，月桂科）木材特征的化石木。"},"examples":[{"en":"The researchers identified the specimen as Laurinoxylon based on its wood anatomy.","zh":"研究人员根据木材解剖结构将该标本鉴定为 Laurinoxylon。"},{"en":"Laurinoxylon fossils suggest that laurel-like trees once grew in this region.","zh":"Laurinoxylon 的化石表明，这个地区曾生长过类似月桂类的树木。"}]}],"synonyms":["fossil wood (general term)","Lauraceae-like fossil wood (descriptive phrase)"],"phonetic":"/ˌlɔrəˌniːnoʊˈzaɪlɑn/","extraExplanation":["词源提示：Laurino- 与 laurel（月桂、樟科/桂科相关）有关；-xylon 来自希腊语，意思是“木材”。因此 Laurinoxylon 大意是“月桂类的木化石/木材”。","使用场景：这是一个较专业的学术词，常见于古植物学、地质学和化石研究论文中，用作“形态属（form genus）”一类的命名，强调木材结构相似性，而不一定等同于现代某个具体树种。"]}
{"word":"laurionite","summary":{"en":"Laurionite is a rare lead hydroxychloride mineral found in oxidized lead deposits.","zh":"Laurionite（羟氯铅矿）是一种稀有的羟氯化铅矿物，常见于含铅矿床的氧化带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (lead hydroxychloride) that forms as a secondary mineral in oxidized lead deposits","zh":"一种稀有矿物（羟氯铅矿），常作为次生矿物形成于含铅矿床的氧化带中"},"examples":[{"en":"Laurionite can appear as tiny white crystals in the oxidation zone of lead ores.","zh":"羟氯铅矿可能以微小的白色晶体形式出现在铅矿的氧化带中。"},{"en":"The sample contained laurionite along with other lead chloride minerals.","zh":"该标本含有羟氯铅矿，并伴生其他氯化铅类矿物。"}]}],"phonetic":"/ˈlɔriəˌnaɪt/","extraExplanation":["词源：Laurionite 得名于希腊的劳里翁（Laurion）矿区（历史上著名的银、铅矿产地），因此该词常见于矿物学与地质学语境中。","常见相关词：mendipite（门迪普石）、cotunnite（氯化铅矿）。它们都与铅的氯化物/羟氯化物矿物有关，容易在同类矿床或相似环境中一起被提到。"]}
{"word":"laurite","summary":{"en":"Laurite is a rare mineral: ruthenium sulfide (RuS₂), often associated with platinum‑group minerals.","zh":"Laurite（月桂矿）是一种稀有矿物：二硫化钌（RuS₂），常与铂族矿物伴生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made mainly of ruthenium sulfide (RuS₂), usually found in ultramafic rocks and in placer deposits with other platinum‑group minerals.","zh":"一种稀有矿物，主要成分为二硫化钌（RuS₂），常见于超镁铁质岩石中，也可与其他铂族矿物一起出现在砂矿（冲积矿）中。"},"examples":[{"en":"Laurite is one of the main platinum‑group minerals found in some chromite deposits.","zh":"在一些铬铁矿矿床中，月桂矿（laurite）是主要的铂族矿物之一。"},{"en":"Under a microscope, tiny grains of laurite can be identified by mineral tests.","zh":"在显微镜下，可以通过矿物测试辨认出细小的月桂矿颗粒。"}]}],"synonyms":["ruthenium sulfide (RuS₂)"],"phonetic":"/ˈlɔːraɪt/","extraExplanation":["“Laurite”是矿物学术语，常用于地质学/矿床学语境；日常英语中几乎不用。","词源来自拉丁语“laurus”（月桂树），为纪念化学元素“ruthenium（钌）”相关研究历史中的命名传统；在现代矿物命名中它特指RuS₂矿物。"]}
{"word":"laurocapram","summary":{"en":"Laurocapram is a chemical used to help other ingredients absorb through the skin.","zh":"Laurocapram 是一种帮助其他成分更容易被皮肤吸收的化学促渗剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound used as a skin-penetration enhancer in some pharmaceutical and cosmetic formulations (also known as “Azone”).","zh":"一种用于促进药物或成分经皮肤吸收的化学物质（也称“Azone / 阿宗”）。"},"examples":[{"en":"The cream contains laurocapram to help the active ingredient pass through the skin.","zh":"这款乳膏含有 laurocapram，用来帮助有效成分更好地透过皮肤。"},{"en":"Researchers tested laurocapram as a penetration enhancer in a transdermal patch.","zh":"研究人员在经皮贴剂中测试了 laurocapram 作为促渗剂的效果。"}]}],"synonyms":["Azone"],"phonetic":"/ˌlɔːroʊˈkæpræm/","extraExplanation":["Laurocapram 是一个偏专业的化学/药剂学术语，常见于药品学、皮肤给药（transdermal delivery）相关文献与配方说明中。","它的常用别名是 Azone（阿宗），在一些资料中会更常见；不同国家/地区对其在化妆品或外用制剂中的允许范围与用途可能不同。"]}
{"word":"laurocerasus","summary":{"en":"Laurocerasus is the botanical name for cherry laurel, a glossy-leaved evergreen often used for hedges.","zh":"Laurocerasus 是桂樱（樱桃月桂）的植物学名称，一种常用于绿篱的光亮叶常绿植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) Cherry laurel: an evergreen shrub or small tree (Prunus laurocerasus) with glossy, laurel-like leaves and small white flowers, often grown as a hedge.","zh":"（植物）樱桃月桂／桂樱（Prunus laurocerasus）：一种常绿灌木或小乔木，叶片光亮、形似月桂，开白色小花，常用于绿篱。"},"examples":[{"en":"The park planted laurocerasus as a dense evergreen hedge.","zh":"公园把桂樱（laurocerasus）种成了密实的常绿绿篱。"},{"en":"In spring, laurocerasus produces clusters of small white flowers.","zh":"春天桂樱（laurocerasus）会开成串的小白花。"}]}],"synonyms":["cherry laurel","Prunus laurocerasus","English laurel"],"phonetic":"/ˌlɔroʊˈsɛrəsəs/","extraExplanation":["“laurocerasus”来自拉丁语词根：lauro-（月桂）+ cerasus（樱桃），意思是“像月桂的樱桃”。因此它的叶子像月桂，但果实与樱桃同属蔷薇科樱属（Prunus）。","园艺语境中常把它当作绿篱植物；但其叶和籽含有会释放氰化物的成分（如氰苷），不建议食用，也要注意宠物误食风险。"]}
{"word":"laurone","summary":{"en":"Laurone is a rare chemistry word meaning a ketone (often identified as dodecan-2-one) used in research or fragrance/flavor contexts.","zh":"Laurone 是较少见的化学词，指一种酮类化合物（常对应 2-十二酮），多见于研究或香精香料语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical substance (a ketone) found in some natural oils and sometimes used in fragrance or flavor chemistry; also called dodecan-2-one or methyl undecyl ketone","zh":"一种化学物质（酮类），存在于某些天然油脂中，有时用于香精或香料化学；也称为“2-十二酮”或“十一烷基甲基酮”"},"examples":[{"en":"Some reference books list laurone as dodecan-2-one, a ketone used in fragrance research.","zh":"一些参考资料把 laurone 记为 2-十二酮，这是一种用于香精研究的酮类物质。"},{"en":"The lab labeled the sample “laurone” and recorded its odor profile.","zh":"实验室把样品标注为“laurone”，并记录了它的气味特征。"}]}],"synonyms":["dodecan-2-one","2-dodecanone","methyl undecyl ketone"],"phonetic":"ˈlɔːroʊn","extraExplanation":["“laurone”不是常见日常英语词汇，更常见于化学、香精香料或学术资料中。","在不同资料里它可能对应不同的命名体系（俗名 vs. 系统命名，如 dodecan-2-one），阅读文献时可同时核对 CAS 号或结构式以避免混淆。"]}
{"word":"laurotetanine","summary":{"en":"Laurotetanine is a plant-derived alkaloid mainly mentioned in scientific contexts.","zh":"Laurotetanine 是一种来源于植物的生物碱，主要用于科学研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring alkaloid (a plant-made chemical) found in some plants; it is studied in chemistry and pharmacology, not used as a common everyday word.","zh":"一种天然存在的生物碱（植物生成的化学物质），存在于某些植物中；主要用于化学与药理研究，并非日常常用词。"},"examples":[{"en":"Researchers isolated laurotetanine from a plant extract to study its biological activity.","zh":"研究人员从植物提取物中分离出 laurotetanine，以研究其生物活性。"},{"en":"Laurotetanine is an alkaloid that appears in some academic papers about natural products.","zh":"Laurotetanine 是一种生物碱，常见于一些关于天然产物的学术论文中。"}]}],"synonyms":["(no common everyday synonym; often referred to by its chemical name)"],"phonetic":"/ˌlɔːroʊˈtɛtənaɪn/","extraExplanation":["这个词属于“化学命名/天然产物”语境，通常出现在论文、药物化学或天然产物化学的资料里，而不是一般英语会话。","词形可拆看：lauro- 常与“月桂（laurel）/月桂属（Laurus）”相关；-tetanine 常见于某些生物碱的命名结尾。不同资料可能会提到它属于（苄基异喹啉类等）生物碱家族的一种。","发音在不同学科/地区可能略有差异；在学术交流中更重要的是拼写准确，必要时可直接拼读字母或提供化学结构/编号以避免误解。"]}
{"word":"lauroyl","summary":{"en":"“Lauroyl” is a chemistry term meaning “from lauric acid,” often seen in ingredient names and referring to a C12 fatty-acid acyl group.","zh":"“lauroyl”是化学用语，意思是“来自月桂酸的”，常见于成分名称中，指一种C12脂肪酸的酰基（月桂酰基）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to or derived from lauric acid; used to name a lauric-acid-based acyl group (C12:0), common in surfactants and cosmetics (e.g., sodium lauroyl sarcosinate).","zh":"（化学）与月桂酸有关的；源自月桂酸的，用于命名“月桂酰基”（C12:0），常见于表面活性剂与化妆品成分（如：月桂酰肌氨酸钠）。"},"examples":[{"en":"This shampoo uses a lauroyl-based surfactant to help remove oil.","zh":"这款洗发水使用了月桂酰基的表面活性剂来帮助去油。"},{"en":"Sodium lauroyl sarcosinate is often listed on ingredient labels.","zh":"成分表上常常会看到“月桂酰肌氨酸钠”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The lauroyl group itself (dodecanoyl, CH3(CH2)10CO–) in an organic molecule.","zh":"（化学）指分子中的“月桂酰基”本身（十二酰基，CH3(CH2)10CO–）。"},"examples":[{"en":"The compound contains a lauroyl group attached to an amide.","zh":"这种化合物含有一个连接在酰胺上的月桂酰基。"}]}],"synonyms":["dodecanoyl","lauric-acid-derived acyl group"],"phonetic":"/ˈlɔrɔɪl/","extraExplanation":["“lauroyl”来自“lauric acid（月桂酸）”，而月桂酸的名字与“laurel（月桂）”同源：早期月桂酸常从月桂类植物（如月桂/樟科植物）油脂中获得。","在配方或成分表里看到“lauroyl-”通常表示它是“月桂酸衍生的酰基”，常用于制造更温和或更易起泡的清洁剂/表面活性剂。"]}
{"word":"laurus","summary":{"en":"Laurus is the botanical genus that includes bay laurel, the source of bay leaves used in cooking.","zh":"Laurus 指月桂属，包含月桂（香叶/月桂叶的来源）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of evergreen trees and shrubs in the laurel family (Lauraceae), especially the bay laurel (Laurus nobilis), whose leaves are used as bay leaves in cooking","zh":"月桂属（樟科的一属常绿乔木或灌木），尤指月桂（Laurus nobilis）；其叶常用于烹饪，即“香叶/月桂叶”"},"examples":[{"en":"Bay leaves come from Laurus nobilis.","zh":"香叶（月桂叶）来自月桂（Laurus nobilis）。"},{"en":"In the herb garden, she grew Laurus for its fragrant leaves.","zh":"她在香草园里种了月桂属植物，取其芳香的叶子。"}]}],"synonyms":["laurel","bay laurel","Laurus nobilis"],"phonetic":"/ˈlɔrəs/","extraExplanation":["“Laurus”多见于植物学/园艺语境，是拉丁学名（属名），日常英语更常说“bay laurel”“laurel”。","月桂在西方文化中常象征胜利与荣誉（如“laurel wreath/月桂冠”），但这类象征通常用“laurel”来表达，而不是直接用“Laurus”。"]}
{"word":"laurustine","summary":{"en":"Laurustine is an evergreen viburnum shrub often grown for its winter-to-spring flowers and hedging.","zh":"Laurustine 是一种常绿荚蒾灌木，常因冬末到春季开花、适合做绿篱而栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen shrub (Viburnum tinus) with glossy leaves and clusters of small white or pinkish flowers, often grown in gardens and hedges","zh":"一种常绿灌木（地中海荚蒾，学名 Viburnum tinus），叶片有光泽，开成簇的小白花或淡粉花，常用于园艺绿篱与庭院种植"},"examples":[{"en":"The laurustine in our yard blooms in late winter, when most plants are still bare.","zh":"我们院子里的 laurustine 在冬末开花，那时大多数植物还很光秃。"},{"en":"They planted a row of laurustine to make a dense, evergreen hedge.","zh":"他们种了一排 laurustine，做成浓密的常绿绿篱。"}]}],"synonyms":["Viburnum tinus","viburnum","laurestine","tinus"],"phonetic":"ˈlɔrəsˌtin","extraExplanation":["这个词在园艺语境更常见；也常见拼写变体 **laurestine**。","词源上与拉丁语有关：**laurus** 指“月桂”，**tinus** 是古典作者用于指代这种荚蒾类植物的名称；但它并不是“真正的月桂树”。","在英语里它通常作不可数名词或作植物名（可数）使用：*laurustine*（泛指这类植物）/ *a laurustine*（一株）。"]}
{"word":"laurustinus","summary":{"en":"Laurustinus is an evergreen viburnum shrub grown for its glossy leaves and clusters of small flowers.","zh":"Laurustinus 指一种常绿的荚蒾灌木，因叶片有光泽、花成簇而常作观赏植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen shrub (Viburnum tinus) with glossy leaves and clusters of small white or pinkish flowers, often grown as an ornamental plant","zh":"一种常绿灌木（Viburnum tinus，常见作观赏植物），叶片有光泽，开成簇的小白花或淡粉花"},"examples":[{"en":"Laurustinus is often planted in gardens because it stays green all year.","zh":"月桂荚蒾常被种在花园里，因为它四季常绿。"},{"en":"In late winter, laurustinus can produce clusters of pale flowers.","zh":"在冬末，月桂荚蒾会开出一簇簇浅色小花。"}]}],"synonyms":["Viburnum tinus","laurustine (less common)"],"phonetic":"/ˌlɔr.əˈstɪn.əs/","extraExplanation":["“Laurustinus”常见于园艺语境，指荚蒾属植物 Viburnum tinus；在英式园艺中较常见。","词源上可理解为“像月桂（laurel）的荚蒾（tinus）”：它的叶子外形和质感有点像月桂叶，因此得名。","注意它不是“laurel（月桂）”本身，而是荚蒾属（Viburnum）的一种；中文常译作“月桂荚蒾”。"]}
{"word":"laurvikite","summary":{"en":"Laurvikite is a Norwegian igneous rock with a blue-silver shimmer, widely used as decorative stone.","zh":"Laurvikite 是一种产自挪威、带蓝银色闪光的火成岩，常作装饰石材使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of intrusive igneous rock (a kind of syenite) known for its shimmering blue-silver crystals; often cut and polished as a decorative building stone.","zh":"一种侵入性火成岩（正长岩的一种），以蓝银色闪光晶体著称；常被切割、抛光用作装饰性建筑石材。"},"examples":[{"en":"The lobby walls were faced with polished laurvikite that flashed blue in the light.","zh":"大厅墙面贴着抛光的 laurvikite，在灯光下泛出蓝色光泽。"},{"en":"Laurvikite is commonly used for countertops and exterior cladding in modern buildings.","zh":"laurvikite 常用于现代建筑的台面和外墙饰面。"}]}],"synonyms":["syenite (related rock type)","decorative building stone (general term)"],"phonetic":"/ˈlɔr.vɪˌkaɪt/","extraExplanation":["“Laurvikite（劳尔维克岩）”得名于挪威城镇 Larvik（拉尔维克）一带的产地，是挪威著名的天然石材之一。","它的“蓝色闪光”常来自长石（如斜长石/钾长石）产生的光学效应，因此在石材贸易中很受欢迎。"]}
{"word":"laury","summary":{"en":"“Laury” is most commonly a personal name, often a variant spelling of “Laurie.”","zh":"“Laury”最常见的是人名，常被视为“Laurie”的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually a variant spelling of “Laurie”), used for any gender but often as a nickname for “Laura” (female) or “Lawrence” (male)","zh":"人名（常被视为“Laurie”的变体拼写），可用于任何性别；常作“Laura（劳拉）”的昵称（女性）或“Lawrence（劳伦斯）”的昵称（男性）"},"examples":[{"en":"Laury said she would call me after class.","zh":"Laury 说她下课后会给我打电话。"},{"en":"In the email, Laury introduced himself as the new team leader.","zh":"在邮件里，Laury 介绍自己是新的团队负责人。"}]}],"synonyms":["Laurie","Laura","Lawrence"],"phonetic":"/ˈlɔri/","extraExplanation":["“Laury”在英语里更多见于姓名拼写（可能是家长自创拼写或地区/家族偏好），并不是常见的词汇。更常见的拼写是“Laurie”。","“Laurie”作为名字在英语文化中比较常见，也常出现在文学作品里（例如《小妇人》里的男主角昵称“Laurie”，全名常写作“Laurence”）。","这些名字常被认为与拉丁语“laurus（月桂）”相关（尤其是“Laura/Laurel”一支），月桂在西方文化里常象征荣誉与胜利。"]}
{"word":"lauryl","summary":{"en":"“Lauryl” is a chemistry term meaning “related to lauric acid,” often referring to a 12‑carbon (dodecyl) chain used in soaps and detergents.","zh":"“Lauryl”是化学用语，意为“与月桂酸有关”，常指一种12碳（十二烷基）链状基团，常见于肥皂和清洁剂成分中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to lauric acid; used in chemistry to describe a 12‑carbon chain group (dodecyl) found in many soaps and detergents","zh":"（化学）与月桂酸有关的；“月桂基/十二烷基”的，用来描述一种12个碳的链状基团，常见于肥皂和清洁剂中"},"examples":[{"en":"Sodium lauryl sulfate is a common foaming ingredient in shampoos.","zh":"月桂基硫酸钠是洗发水里常见的起泡成分。"},{"en":"The label lists lauryl alcohol as one of the ingredients.","zh":"标签上把月桂醇列为成分之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a lauryl (dodecyl) group used in naming chemical compounds","zh":"（化学）月桂基（十二烷基）；用于化合物命名的一种基团"},"examples":[{"en":"In this compound, a lauryl group is attached to the main chain.","zh":"在这个化合物里，主链连接了一个月桂基。"}]}],"synonyms":["dodecyl","C12-"],"phonetic":"/ˈlɔrəl/","extraExplanation":["“lauryl”来自“laurel（月桂）”，因为月桂酸（lauric acid）最早与月桂油/类似来源的脂肪酸研究有关。现代日常中你最常在成分表里看到它，如“sodium lauryl sulfate（SLS，月桂基硫酸钠）”“lauryl alcohol（月桂醇）”。","在成分语境里，“lauryl”通常指12碳链（dodecyl-），这类长碳链常用于表面活性剂，因此会带来“起泡、清洁、乳化”的效果；不同人对其刺激性耐受度不同。"]}
{"word":"laus","summary":{"en":"“Laus” is a Latin word meaning “praise,” seen in English mainly in mottos and religious contexts.","zh":"“laus”是拉丁语，意为“赞美”，在英语中主要出现在格言或宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in English mainly in mottos, church music, and academic writing) praise; glory; commendation.","zh":"（拉丁语；在英语中多见于格言、教会音乐和学术语境）赞美；荣耀；称赞。"},"examples":[{"en":"The hymn ends with the words “laus Deo,” meaning “praise to God.”","zh":"这首圣诗以“laus Deo”结尾，意思是“赞美上帝”。"},{"en":"In the inscription, “laus et gloria” expresses “praise and glory.”","zh":"在碑文中，“laus et gloria”表达“赞美与荣耀”。"}]}],"synonyms":["praise","glory","commendation"],"phonetic":"/laʊs/","extraExplanation":["“laus”不是常见的英语词汇，而是拉丁语名词。在英语世界里，它常被原样保留，用于宗教音乐（如圣诗、赞美诗）、校训或碑文等较正式、传统的场景。","相关常见搭配：laus Deo（赞美上帝）、laus et gloria（赞美与荣耀）。如果你想表达日常英语里的“赞美”，更常用 praise / compliment / commendation 等。"]}
{"word":"Lausanne","summary":{"en":"Lausanne is a city in western Switzerland on Lake Geneva.","zh":"Lausanne（洛桑）是瑞士西部日内瓦湖畔的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in western Switzerland on Lake Geneva, known for its universities and as an international sports center","zh":"瑞士西部日内瓦湖畔的一座城市，以大学教育闻名，也因国际体育机构聚集而著称"},"examples":[{"en":"Lausanne sits on the north shore of Lake Geneva.","zh":"洛桑位于日内瓦湖北岸。"},{"en":"She moved to Lausanne to study at a university there.","zh":"她搬到洛桑去那里的一所大学读书。"}]}],"phonetic":"/loʊˈzæn/","extraExplanation":["英语里“Lausanne”通常直接用作专有名词（城市名），首字母大写；常见中文译名是“洛桑”。","洛桑与国际体育关系密切：国际奥委会（IOC）总部设在洛桑，因此它也常被称为“奥林匹克之都”（Olympic Capital）。"]}
{"word":"lauschen","summary":{"en":"German “lauschen” means to listen closely/attentively, often quietly; with “auf,” it can mean to listen to (obey/pay attention to) someone.","zh":"德语“lauschen”表示“侧耳倾听/专心听”，常带安静、刻意聆听的感觉；与“auf”连用可表示“听……的话/注意某人说的内容”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to listen attentively; to listen closely (often quietly, as if trying to catch a faint sound or a secret).","zh":"专心听；侧耳倾听（常带有安静地、想听清微弱声音或秘密的感觉）。"},"examples":[{"en":"She listened closely at the door to hear if anyone was coming.","zh":"她在门边侧耳倾听，想听听是否有人过来。"},{"en":"The children listened for the first raindrops on the roof.","zh":"孩子们静静地听屋顶上第一滴雨落下的声音。"}]},{"partOfSpeech":"v.","definition":{"en":"(with “auf”) to listen to someone; to pay attention to what someone says.","zh":"（与“auf”连用）听从/听……的话；注意某人说的话。"},"examples":[{"en":"Listen to the teacher, please.","zh":"请听老师讲。"},{"en":"He doesn’t listen to his parents.","zh":"他不听父母的话。"}]}],"synonyms":["hören","zuhören","horchen"],"phonetic":"/ˈlaʊʃən/","extraExplanation":["“lauschen”是德语动词，语感比中性“hören（听见/听到）”更“专注、刻意”，常用于描写安静的场景或带一点“偷听、探听”的氛围。","常见搭配：lauschen + nach（倾听……的声音/动静），lauschen + auf（听……的话/注意）。","文学/描写中常见：如“dem Wind lauschen”（倾听风声）、“der Stille lauschen”（聆听寂静），用来营造氛围。"]}
{"word":"laut","summary":{"en":"very loud or noisily attention-grabbing","zh":"非常大聲、喧鬧張揚"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) very loud; noisy in a bold or attention-getting way.","zh":"（文學/較少用）非常大聲的；喧鬧的、張揚的。"},"examples":[{"en":"The bar was filled with laut laughter and clinking glasses.","zh":"酒吧裡充滿了喧鬧的大笑聲和杯子碰撞聲。"},{"en":"His laut complaints made everyone turn around.","zh":"他大聲又張揚的抱怨讓大家都回頭看。"}]}],"synonyms":["loud","noisy","booming","raucous","clamorous"],"phonetic":"/laʊt/","extraExplanation":["在一般日常英語裡更常用 *loud / noisy*；*laut* 帶有一點「刻意張揚、喧鬧」的文學色彩。","在音樂或德語語境中，*laut* 也常被理解為「大聲（的）」；但在英語裡屬於少見用字。"],"etymology":"源自德語 *laut*「大聲的」，與英文 *loud* 同源；英語中多見於較文學或風格化的用法。","mnemonic":["把它和英文 *loud* 聯想在一起：*laut* 看起來像 *loud* 的「表親」，意思也是「大聲」。","讀音 /laʊt/ 跟 *lout*（粗魯的人）接近：想像「粗魯的人講話很大聲」來記。"]}
{"word":"lautarite","summary":{"en":"Lautarite is a rare mineral: calcium iodate, found especially in Chilean nitrate deposits.","zh":"Lautarite 是一种罕见矿物：碘酸钙，常见于智利的硝石矿床。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made of calcium iodate (Ca(IO3)2), found especially in Chilean nitrate deposits.","zh":"一种罕见矿物，主要成分是碘酸钙（Ca(IO3)2），常见于智利的硝石矿床中。"},"examples":[{"en":"Lautarite is one natural source of iodine in some desert deposits.","zh":"在一些沙漠矿床中，lautarite（碘酸钙矿）是碘的天然来源之一。"},{"en":"The sample was identified as lautarite based on its chemical composition.","zh":"研究人员依据其化学成分将该样品鉴定为 lautarite（碘酸钙矿）。"}]}],"synonyms":["calcium iodate (mineral)"],"phonetic":"/ˈlɔːtərˌaɪt/","extraExplanation":["Lautarite 通常与智利北部（阿塔卡马一带）的硝石矿床相关；历史上这些矿床曾是重要的含碘资源来源，因此该词多见于地质学、矿物学或资源化学的语境中。"]}
{"word":"lautenclavicymbal","summary":{"en":"A rare Baroque keyboard instrument, like a harpsichord, made to sound like a lute.","zh":"一种罕见的巴洛克键盘乐器，类似羽管键琴，但旨在模仿鲁特琴音色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare Baroque keyboard instrument (a kind of harpsichord) designed to imitate the sound of a lute, often by using gut strings and a plucked mechanism.","zh":"一种罕见的巴洛克时期键盘乐器（属羽管键琴的一类），设计用来模仿鲁特琴的音色，常通过肠弦与拨弦结构产生类似“拨奏”的声音。"},"examples":[{"en":"The museum displayed a lautenclavicymbal beside a harpsichord to show how different the timbres were.","zh":"博物馆把 lautenclavicymbal 与羽管键琴并排展出，用来展示两者音色的差异。"},{"en":"Some performers use a lautenclavicymbal for Bach pieces to get a more lute-like color.","zh":"有些演奏者会用 lautenclavicymbal 来演奏巴赫作品，以获得更接近鲁特琴的音色。"}]}],"synonyms":["lute-harpsichord","lute keyboard","Lautenwerk","harpsichord (related)"],"phonetic":"/ˌlaʊtənˈklævɪˌsɪmbəl/","extraExplanation":["这个词来自德语“Lauten‑Clavicymbel”（直译可理解为“鲁特琴式的羽管键琴”）。它在英语里非常少见，更常见的相关术语是 lute‑harpsichord、lute keyboard 或德语名 Lautenwerk。","在音乐史语境中，这类乐器常与巴赫（J. S. Bach）联系在一起：有研究认为他可能偏爱或熟悉这种“像鲁特琴一样的键盘音色”，不过现存实物极少，很多演出使用的是复刻或仿制乐器。"]}
{"word":"Lautenwerk","summary":{"en":"a lute-sounding Baroque keyboard instrument","zh":"一种模仿鲁特琴音色的巴洛克键盘乐器"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Baroque keyboard instrument (or a harpsichord variant) designed to imitate the sound of a lute, often using gut strings or a lute-like stop for a softer, plucked tone.","zh":"巴洛克时期的一种键盘乐器（或羽管键琴的变体），旨在模仿鲁特琴的音色，常用肠弦或“鲁特音栓”来产生更柔和的拨弦音。"},"examples":[{"en":"Some of Bach’s keyboard pieces may have been intended for the lautenwerk rather than the modern piano.","zh":"巴赫的一些键盘作品可能更适合用鲁特键琴演奏，而不是现代钢琴。"},{"en":"The lautenwerk produces a gentle plucked sound, closer to a lute than a bright harpsichord.","zh":"鲁特键琴的声音更温和、带拨弦感，比明亮的羽管键琴更接近鲁特琴。"}]}],"synonyms":["lute-harpsichord","lute stop harpsichord","lute keyboard"],"phonetic":"/ˈlaʊtənˌwɝk/","extraExplanation":["这类乐器在18世纪并不算常见，现存原品很少，现代多为复原或仿制版本。","在古乐（historically informed performance）圈子里，它常与“巴赫可能偏好的键盘音色”这一话题一起出现。"],"etymology":"源自德语：Lauten-（“鲁特琴的”，来自 Laute“鲁特琴”）+ Werk（“器物/装置/作品”）。字面意思接近“鲁特琴式的装置/乐器”。在音乐史语境中专指一种模仿鲁特琴音色的键盘乐器。","mnemonic":["把它拆开记：Lauten（像“lute/鲁特”）+ werk（“作品/器械”）→“鲁特风格的键盘器械”。","联想“lute + keyboard”：虽然是键盘，但声音追求鲁特琴的拨弦感。"]}
{"word":"lauter","summary":{"en":"Lauter means “nothing but; sheer,” often used in formal or literary writing (e.g., “lauter lies”).","zh":"lauter 表示“纯粹的、全然的、尽是……的”，多用于较正式或文学语境（如“lauter lies”=纯属谎言）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(somewhat formal or literary) Nothing but; sheer; made up entirely of one thing.","zh":"（较正式或文学用法）纯粹的；全然的；尽是……的。"},"examples":[{"en":"The article was lauter exaggeration, with almost no facts.","zh":"那篇文章通篇都是夸大之词，几乎没有事实。"},{"en":"He dismissed the rumor as lauter lies.","zh":"他把那个传闻斥为纯属谎言。"},{"en":"The speech was lauter praise for the leader.","zh":"那场演讲几乎全是对那位领袖的颂扬。"}]}],"synonyms":["sheer","pure","nothing but","utter"],"phonetic":"/ˈlaʊtər/","extraExplanation":["“lauter”在英语里较少见，带一点书面/文学色彩，意思接近“pure / sheer / nothing but”。它源自德语“lauter”（意为“纯粹的、无杂质的”），所以常见搭配是“lauter + 名词”（如 lauter lies / lauter praise）。","如果你本来想写“louder”（更大声的），那是另一个词：louder = comparative of loud。拼写上只多一个 d，但意思完全不同。"]}
{"word":"lautite","summary":{"en":"Lautite is a rare mineral: copper arsenic sulfide (CuAsS).","zh":"Lautite 指一种罕见矿物：硫砷化铜（CuAsS）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (copper arsenic sulfide, CuAsS) that occurs in some metal ore deposits","zh":"一种较罕见的矿物——硫砷化铜（化学式 CuAsS），常见于某些金属矿床中"},"examples":[{"en":"The sample was identified as lautite based on its chemical composition (CuAsS).","zh":"根据其化学成分（CuAsS），该样品被鉴定为硫砷化铜（lautite）。"},{"en":"Lautite can occur together with other copper minerals in hydrothermal veins.","zh":"硫砷化铜可能与其他铜矿物一起出现在热液脉中。"}]}],"synonyms":["copper arsenic sulfide (CuAsS)"],"phonetic":"/ˈlaʊtaɪt/","extraExplanation":["“lautite”是矿物学术语，主要出现在地质与采矿语境中，日常英语里几乎不用。","该词通常来自命名矿物的传统：以发现地、人物或相关地质背景命名（不同资料对其命名来源的细节可能略有出入）。","由于含砷（arsenic），相关矿物与矿石的处理在现实中会涉及安全与环保要求；在英文材料中常与“arsenic-bearing minerals（含砷矿物）”等词搭配出现。"]}
{"word":"lautitious","summary":{"en":"A rare adjective meaning “very luxurious; sumptuous.”","zh":"一个罕见形容词，意思是“非常奢华的；华丽的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) very luxurious; elegant and richly comfortable; sumptuous.","zh":"（罕见）非常奢华的；讲究而舒适的；华丽的。"},"examples":[{"en":"They hosted a lautitious banquet with silver dishes and multiple courses.","zh":"他们举办了一场奢华的宴会，用银器盛装并安排了多道菜。"},{"en":"The hotel’s lautitious lobby was filled with marble, velvet chairs, and soft lighting.","zh":"这家酒店的大堂极尽奢华：大理石、天鹅绒座椅和柔和的灯光一应俱全。"}]}],"synonyms":["luxurious","sumptuous","lavish","opulent","plush"],"phonetic":"/lɔːˈtɪʃəs/","extraExplanation":["“lautitious”非常少见，更常见的表达是“luxurious / sumptuous / lavish / opulent”。如果你在现代文章中写作，用这些更常用的词会更自然。","词源上与拉丁语“lautitia”（精致、华美、优雅）有关，因此它强调“讲究、华丽、富丽”的气质，而不仅仅是“贵”。","拼写容易被误写；如果你原本想表达“爱夸奖的/赞美的”，更可能是“laudatory”（赞扬的）。"]}
{"word":"lautu","summary":{"en":"“Lautu” is usually a proper name rather than a standard English word.","zh":"“Lautu”通常是专有名词，而不是英语里的常见词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or place name) found in some Pacific Island contexts; it is not a common standard English vocabulary word.","zh":"专有名词（人名/地名），在一些太平洋岛国语境中可见；并非英语里的常见词汇。"},"examples":[{"en":"Ms. Lautu will speak at the meeting today.","zh":"Lautu 女士今天将在会上发言。"},{"en":"He traced his family history back to the Lautu line.","zh":"他把家族史追溯到 Lautu 家族这一支。"}]}],"phonetic":"/ˈlaʊtuː/","extraExplanation":["“Lautu”在英语里通常作为专有名词使用，因此多半要首字母大写：Lautu。","如果你是在找英语单词，可能想输入的是：\n- lout（n. 粗鲁的人、莽汉）\n- laud（v. 称赞、赞美）\n- laut（adj. 德语借词：响亮的；多见于音乐术语或讨论德语时）\n你可以告诉我你看到它的句子或语境，我可以更准确地解释。"]}
{"word":"lauwine","summary":{"en":"“lauwine” isn’t standard English; it likely refers to German “lawine” = avalanche.","zh":"“lauwine”不是标准英语；很可能指德语“lawine”，意思是“雪崩”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of **lawine** (from German), meaning an **avalanche** (a large mass of snow/ice/rocks sliding down a mountain).","zh":"不是标准英语单词。很可能是 **lawine**（源自德语）的拼写错误，意思是“**雪崩**”（大量雪/冰/岩石从山坡滑落）。"},"examples":[{"en":"This isn’t a common English word—did you mean **lawine** or **avalanche**?","zh":"这不是常见英语单词——你是不是想写 **lawine** 或 **avalanche（雪崩）**？"},{"en":"An **avalanche** can happen after heavy snowfall or sudden warming.","zh":"大雪之后或突然回暖时可能会发生**雪崩**。"}]}],"synonyms":["avalanche","snowslide"],"phonetic":"/ləˈvin/","extraExplanation":["“Lawine”是德语“雪崩”的意思；英语里更常用的对应词是 **avalanche**。在英语文本中看到“lawine”通常是借用德语（例如讨论阿尔卑斯山区、滑雪安全或引用德语资料时）。如果你指的是人名/品牌（如“LaWine”），请告诉我上下文，我可以按专有名词解释。"]}
{"word":"lauwines","summary":{"en":"“lauwines” is most likely a proper name (brand/username), not a standard English vocabulary word.","zh":"“lauwines”多半是专有名称（品牌/用户名），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name (often a brand, winery name, or username) written as one word; it is not a standard English dictionary word, so its exact meaning depends on the specific company/person using it.","zh":"一个名字（常见于品牌、酒庄名称或用户名），并非标准英语词汇；具体含义取决于使用它的公司或个人。"},"examples":[{"en":"I found “Lauwines” on Instagram, but it looks like a brand name, not an English word.","zh":"我在 Instagram 上看到 “Lauwines”，但它看起来像品牌名，不是英语单词。"},{"en":"If “Lauwines” is a winery, check the official website for its location and product list.","zh":"如果 “Lauwines” 是一家酒庄，建议去官网查看所在地和产品目录。"}]}],"phonetic":"/ˈlɔːwaɪnz/","extraExplanation":["“lauwines”更像是专有名词/商标（例如酒庄、网店、账号名），因此没有固定的“词典义”。如果你是想查别的词：\n- 可能是拼写：law wines（“法律/法规相关的葡萄酒”？不常见）\n- 或者是“LAU Wines / Lau Wines”（品牌写法不同）。\n你可以告诉我它出现的语境（句子、网站、国家/地区），我可以帮你更准确地判断读音和含义。"]}
{"word":"Lauxaniidae","summary":{"en":"a scientific family name for a group of small flies","zh":"一种小型蝇类的“科”级科学分类名称"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small flies (order Diptera), often called lauxaniid flies","zh":"短角亚目（双翅目）的一科小型蝇类，常称“斑蝇科/劳克萨蝇科（lauxaniid flies）”"},"examples":[{"en":"Lauxaniidae are commonly found in forests and grassy areas.","zh":"斑蝇科昆虫常见于森林和草地等环境。"},{"en":"The specimen was identified as a member of Lauxaniidae based on wing and bristle features.","zh":"根据翅脉和刚毛特征，这个标本被鉴定为斑蝇科的一员。"}]}],"synonyms":["lauxaniid flies"],"phonetic":"/lɔkˈsæniəˌdiː/","extraExplanation":["这是一个昆虫分类学名（拉丁化学名）。日常英语里更常见的是 lauxaniid flies（斑蝇科蝇类）来指代这一科的成员。","在生物分类中，-idae 通常表示“科”（family），如 Felidae（猫科）、Hominidae（人科）。"],"etymology":"来自属名 Lauxania 加上动物分类学中表示“科”的后缀 -idae；整体意思是“Lauxania 属相关的一科”。","mnemonic":["看到结尾 -idae 就联想到“某某科”（比如 Felidae=猫科），所以 Lauxaniidae=“Lauxania 那一科”。","把 laux- 记成“劳克斯”，再加 -aniidae（像“某某一大类/一科”），帮助你快速识别这是分类学名。"]}

