{"word":"lav","summary":{"en":"“Lav” is an informal short form of “lavatory,” meaning a toilet/restroom.","zh":"“lav”是“lavatory”的非正式缩写，意思是厕所/洗手间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A toilet or restroom; short for “lavatory.”","zh":"（非正式）厕所；“lavatory（洗手间/厕所）”的缩写。"},"examples":[{"en":"I’ll be back in a minute—I’m going to the lav.","zh":"我马上回来——我去一趟厕所。"},{"en":"Is there a lav on this floor?","zh":"这一层有洗手间吗？"}]}],"synonyms":["toilet","restroom","bathroom","loo"],"phonetic":"/læv/","extraExplanation":["“lav”多见于口语或非正式场合，尤其在英式英语里更常见；在美式英语中更常说 “bathroom / restroom”。","在公共场所你也可能看到复数 “lavs”（多间厕所）或标牌写 “Lavatory”。","“LAV”大写还可能是其他缩写（如 military: Light Armored Vehicle），但在日常对话里通常指厕所。"]}
{"word":"lava","summary":{"en":"Lava is hot molten rock that erupts from a volcano and flows on Earth’s surface.","zh":"Lava 指火山喷出并在地表流动的高温熔融岩石（熔岩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hot, melted rock (molten rock) that comes out of a volcano and flows on Earth’s surface.","zh":"熔岩：从火山喷出并在地表流动的高温熔融岩石。"},"examples":[{"en":"During the eruption, lava flowed down the mountainside.","zh":"火山爆发时，熔岩顺着山坡流下。"},{"en":"The road was closed because lava was crossing it.","zh":"因为熔岩正在穿过公路，道路被封闭了。"},{"en":"When lava cools, it becomes solid rock.","zh":"熔岩冷却后会变成坚硬的岩石。"}]}],"synonyms":["molten rock"],"phonetic":"/ˈlɑːvə/","extraExplanation":["“Lava”和“magma（岩浆）”常被一起学：magma 是在地底下的熔融岩石；一旦喷出地表，就叫 lava（熔岩）。","“lava”在日常比喻中也常用来形容“像熔岩一样炽热、汹涌”的东西（如 lava-like heat），但这种用法更偏文学或描写性表达。"]}
{"word":"lava-like","summary":{"en":"Like molten lava in look or movement.","zh":"外观或特性像熔岩（熔融、炽热、黏稠、流动）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling lava in appearance or behavior (very hot, molten, flowing, or dark and thick).","zh":"像熔岩的；在外观或特性上类似熔岩的（炽热、熔融、流动，或颜色深且黏稠）。"},"examples":[{"en":"The metal in the furnace glowed lava-like orange.","zh":"炉子里的金属发出熔岩般的橙色光。"},{"en":"A lava-like stream of mud slid down the hillside after the storm.","zh":"暴风雨后，一股熔岩般的泥流从山坡滑下。"},{"en":"The sauce was lava-like—thick, dark, and dangerously hot.","zh":"这酱汁像熔岩一样——浓稠、颜色深，而且烫得吓人。"}]}],"synonyms":["molten","fiery","incandescent","magma-like","red-hot","glowing","viscous"],"phonetic":"/ˈlɑːvə laɪk/","extraExplanation":["常见写法是带连字符的 lava-like（更突出临时的比喻形容），也可见 lavalike（较少）。","多用于描写：颜色（橘红、暗黑）、质地（黏稠、浓厚）、温度（炽热）、运动方式（缓慢但有压迫感地流动）。","在文学与新闻写作里常用作形象化比喻：如“lava-like anger（熔岩般的怒火）”强调强烈、难以控制、具有破坏性的情绪。"],"etymology":"由“lava（熔岩）+ -like（像……一样）”构成的复合形容词；用来形容外观、质感或流动方式与熔岩相似。","mnemonic":["把 -like 当作“像”，lava-like = “像熔岩一样”。联想到“辣到像岩浆（熔岩）”的食物，容易记住“又热又黏又流动”的感觉。"]}
{"word":"lava-related","summary":{"en":"connected to lava or the effects of lava flows.","zh":"与熔岩或熔岩流造成的影响有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or involving lava (molten rock that flows from a volcano).","zh":"与熔岩有关的；涉及火山熔岩（从火山流出的熔融岩石）的。"},"examples":[{"en":"The researchers mapped lava-related hazards around the volcano.","zh":"研究人员绘制了火山周边与熔岩有关的灾害分布图。"},{"en":"Officials closed the road because of lava-related damage.","zh":"由于与熔岩有关的破坏，官员关闭了这条道路。"}]}],"synonyms":["lava-associated","lava-linked","lava-connected","volcanic"],"phonetic":"/ˈlɑvə rɪˌleɪtɪd/","etymology":"由“lava（熔岩）+ related（相关的）”构成的复合形容词，用连字符连接，表示“与熔岩相关”。常见于新闻报道、科普文章和灾害评估语境。","mnemonic":["记作“lava（熔岩）+ related（相关）”，就是“跟熔岩沾边的”。","联想：火山喷发新闻里常见“lava flows（熔岩流）”，凡是由它引起/牵涉到的事物都可用这个形容词。"]}
{"word":"lavable","summary":{"en":"Lavable means “washable,” especially used on product labels or in formal descriptions.","zh":"lavable 意为“可清洗的”，多见于产品标签或较正式的描述中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be washed (usually without being damaged).","zh":"可清洗的；（通常指）洗了不易损坏的。"},"examples":[{"en":"These curtains are lavable, so you can wash them at home.","zh":"这些窗帘是可清洗的，所以你可以在家洗。"},{"en":"Choose a lavable cover if you have kids or pets.","zh":"如果你有孩子或宠物，建议选可清洗的罩套。"}]}],"synonyms":["washable","launderable"],"phonetic":"/ˈlævəbəl/","extraExplanation":["“Lavable”在英语里比较偏说明书/标签用语，日常更常见的是“washable”。在衣物或家居用品标签上，你也会看到“machine-washable（可机洗）”“hand-washable（可手洗）”。","词源上与法语有关：法语lavable常用于产品说明，英语里也会借用，尤其在纺织品、清洁用品的描述中较常见。"]}
{"word":"lavabo","summary":{"en":"Lavabo means a washbasin (bathroom sink), and it can also refer to a Christian hand-washing prayer/rite.","zh":"Lavabo 指洗手盆（浴室洗手池），也可指基督教礼仪中的洗手祷文/洗手礼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a washbasin; a sink (often in a bathroom), sometimes used in hotels or formal writing","zh":"洗手盆；水槽（多指浴室里的洗手池，在酒店或较正式语境中常见）"},"examples":[{"en":"The room has a shower, a toilet, and a lavabo.","zh":"房间里有淋浴、马桶和洗手盆。"},{"en":"Please wash your hands in the lavabo before dinner.","zh":"晚餐前请在洗手盆洗手。"}]},{"partOfSpeech":"n.","definition":{"en":"a short Christian prayer/rite said while the priest washes hands during a religious service (from Latin “I will wash”)","zh":"（基督教礼仪中）司祭/牧师洗手时所念的简短祈祷或仪式（源自拉丁语“我将洗净”）"},"examples":[{"en":"During the service, the priest recited the lavabo quietly.","zh":"礼拜过程中，神父轻声诵念了“lavabo”。"},{"en":"In some traditions, the lavabo comes before the Eucharist.","zh":"在一些传统中，“lavabo”在圣餐礼之前进行。"}]}],"synonyms":["sink","washbasin","basin"],"phonetic":"/ləˈveɪboʊ/","extraExplanation":["“Lavabo”来自拉丁语 *lavabo*（意为“我将洗”），出自《诗篇》26:6 的开头。在英语里它既可指“洗手盆”，也可指礼仪中的“洗手祷文/洗手礼”。在日常美式英语中更常说 *sink* 或 *bathroom sink*；*lavabo*显得更正式或更常见于酒店/说明文字。"]}
{"word":"lavaboes","summary":{"en":"Lavabo means a small washbasin/sink, and in some formal contexts it can refer to a restroom.","zh":"Lavabo 指小洗手盆/盥洗盆；在一些正式语境中也可指洗手间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a washbasin or sink, especially a small one in a bathroom; sometimes used to mean a toilet/restroom in formal contexts","zh":"洗手盆／盥洗盆（尤指浴室里的小洗手池）；在较正式语境中有时也指厕所／洗手间"},"examples":[{"en":"There’s a small lavabo in the guest bathroom.","zh":"客用浴室里有一个小洗手盆。"},{"en":"Please wash your hands at the lavabo before dinner.","zh":"晚饭前请到洗手盆那里洗手。"},{"en":"The sign points to the lavabos near the entrance.","zh":"标牌指向入口附近的洗手间（或洗手区）。"}]}],"synonyms":["washbasin","sink","basin","restroom (context-dependent)"],"phonetic":"/ləˈvɑːboʊ/","extraExplanation":["“lavabo”来自拉丁语“lavabo”（意为“我将洗”），源自天主教礼仪中洗手的用语，因此在一些国家/地区的正式场合会把它用来指“盥洗处”甚至“洗手间”。","你输入的“lavaboes”很可能是拼写误差；英语里更常见的复数是“lavabos”。在欧洲英语或标识语中也可能看到“lavaboes”，但不如“lavabos”常用。"]}
{"word":"lavabos","summary":{"en":"“Lavabos” is the plural of “lavabo,” meaning a washbasin/sink; in British English it can also mean a restroom/toilet.","zh":"“lavabos”是“lavabo”的复数，常指洗手盆/洗手池；在英式英语中也可指洗手间/厕所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a washbasin or sink, especially one in a public restroom (plural: lavabos).","zh":"洗手盆；洗手池（尤指公共厕所里的；复数：lavabos）。"},"examples":[{"en":"There are three lavabos outside the conference room.","zh":"会议室外面有三个洗手池。"},{"en":"Please wash your hands at the lavabo before you eat.","zh":"吃饭前请先在洗手盆处洗手。"}]},{"partOfSpeech":"n.","definition":{"en":"(chiefly British) a restroom or toilet.","zh":"（主要英式）洗手间；厕所。"},"examples":[{"en":"Excuse me—where are the lavabos?","zh":"不好意思——洗手间在哪里？"}]}],"synonyms":["sink","washbasin","basin","restroom","toilet"],"phonetic":"/ˈlɑːvəˌboʊ/","extraExplanation":["词源提示：lavabo 来自拉丁语“lavabo”（意为“我将洗”。在宗教仪式中，神职人员会在礼仪前洗手，这个词后来引申为“洗手处/洗手池”。","用法提示：在美国英语里更常说 sink / washbasin（洗手池）或 restroom / bathroom（洗手间）；lavabo 带一点正式或特定场所（如酒店、餐厅、公共设施）的感觉。"]}
{"word":"lavacre","summary":{"en":"“Lavacre” isn’t a standard English word; it’s likely a typo or a name.","zh":"“lavacre”不是常见英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a proper name. Please share the sentence or context so I can help identify the intended word.","zh":"不是标准英语词；可能是拼写错误或专有名词。请提供所在句子或语境，我可以帮你确认你想写的词。"},"examples":[{"en":"I couldn’t find “lavacre” in an English dictionary—could you show me the full sentence?","zh":"我在英语词典里找不到“lavacre”——你能把完整句子发我吗？"},{"en":"Did you mean “lava” (molten rock) or “massacre” (a large-scale killing)?","zh":"你是不是想写“lava”（熔岩）或“massacre”（大屠杀）？"}]}],"phonetic":"/ˈlɑːvəˌeɪkər/","extraExplanation":["“lavacre”看起来像把“lava”（熔岩）和“massacre”（大屠杀）拼在一起的误拼或自造词，也可能是游戏名、地名、用户名等专有名词。给我你看到它的来源（文章/游戏/对话）或前后文，我可以更准确判断。"]}
{"word":"lavadero","summary":{"en":"Lavadero means a washhouse/laundry place or a washbasin, used mainly in Spanish-speaking cultural contexts.","zh":"Lavadero指洗衣房／洗衣处或洗涤池，多见于西语文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place for washing clothes, such as a washhouse or laundry room (often used in Spanish-speaking contexts).","zh":"洗衣的地方；洗衣房／洗衣屋（多用于西语语境）。"},"examples":[{"en":"In the village, women used to gather at the lavadero to wash clothes and talk.","zh":"在村里，妇女们过去常在lavadero聚在一起洗衣、聊天。"},{"en":"The hotel has a small lavadero behind the kitchen for staff uniforms.","zh":"那家旅馆在厨房后面有个小lavadero，用来洗员工制服。"}]},{"partOfSpeech":"n.","definition":{"en":"a washbasin or washing area, especially a public or outdoor basin (common in parts of Latin America and Spain).","zh":"洗涤池／洗槽；（尤指）公共或户外的洗衣池（在拉美及西班牙部分地区常见）。"},"examples":[{"en":"He rinsed the vegetables in the lavadero before cooking.","zh":"他在lavadero里把蔬菜冲洗干净再做饭。"},{"en":"The old stone lavadero is now a local landmark.","zh":"那座古老的石头lavadero现在成了当地地标。"}]}],"synonyms":["laundry room","washhouse","wash basin","washing area"],"phonetic":"/ˌlɑːvəˈdeɪroʊ/","extraExplanation":["“Lavadero”来自西班牙语动词“lavar”（洗）。在一些城镇里，lavadero指传统的公共洗衣处，常与社区生活、女性劳动史等文化记忆相关。","英语里通常作为外来词出现在旅行、历史、建筑或拉美／西班牙文化介绍中；日常英语更常说“laundry room / washhouse / basin”。"]}
{"word":"lavage","summary":{"en":"Lavage means medically washing out a wound, organ, or body cavity with fluid.","zh":"Lavage 指医学上的“冲洗/灌洗”，用液体冲洗伤口、器官或体腔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) washing out a body cavity, wound, or organ with water or a special fluid, usually for cleaning or treatment.","zh":"（医学）冲洗；用水或特定液体冲洗体腔、伤口或器官，以清洁或治疗。"},"examples":[{"en":"The doctor performed a gastric lavage to remove the poison from his stomach.","zh":"医生进行了胃灌洗，把毒物从他的胃里冲出来。"},{"en":"Wound lavage helps reduce the risk of infection.","zh":"伤口冲洗有助于降低感染风险。"}]},{"partOfSpeech":"vt.","definition":{"en":"to wash out a body cavity, wound, or organ with water or a special fluid.","zh":"（用水或特定液体）冲洗（体腔、伤口或器官）。"},"examples":[{"en":"Nurses may lavage the wound before applying a new dressing.","zh":"护士可能会先冲洗伤口，再换上新的敷料。"},{"en":"The surgeon lavaged the area with sterile saline.","zh":"外科医生用无菌生理盐水冲洗了该区域。"}]}],"synonyms":["irrigation","washout","rinse","cleansing"],"phonetic":"/ləˈvɑʒ/","extraExplanation":["“lavage”常见于医疗语境（如 emergency room/ICU、外科、牙科），日常生活里很少用。更口语的说法通常是 “wash/rinse out”。","词源来自法语 *laver*（洗），所以发音里有类似 “zh” 的结尾音（-age）。"]}
{"word":"lavages","summary":{"en":"“Lavages” is the plural of “lavage,” meaning medical washing out of a body cavity with liquid.","zh":"“lavages”是“lavage”的复数，指用液体对体腔进行（医学）冲洗/灌洗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the washing out of a body cavity (such as the stomach, wound, or colon) with water or a medical solution, usually for cleaning or treatment","zh":"（医学）用水或药液冲洗体腔（如胃、伤口、结肠等），用于清洁或治疗"},"examples":[{"en":"The doctor ordered gastric lavage to remove the poison from his stomach.","zh":"医生下令进行胃灌洗，以把毒物从他的胃里清除出去。"},{"en":"After surgery, the wound was cleaned with saline lavage.","zh":"手术后，伤口用生理盐水冲洗清洁。"}]},{"partOfSpeech":"n.","definition":{"en":"washings or rinse procedures in general; the plural form often refers to multiple lavage treatments or sessions","zh":"（泛指）冲洗操作；复数常指多次灌洗/冲洗治疗或多个灌洗过程"},"examples":[{"en":"The patient received daily lavages for three days.","zh":"患者连续三天每天接受一次灌洗治疗。"},{"en":"The report compared different lavages used in the clinic.","zh":"报告比较了诊所里使用的不同灌洗方法。"}]},{"partOfSpeech":"vt.","definition":{"en":"to wash out (a cavity or area) with a stream of liquid (less common; more often seen as the noun “lavage”)","zh":"（较少用作动词）用液体冲洗（某个腔体或区域）；更常用名词形式“lavage”"},"examples":[{"en":"In emergencies, clinicians may lavage the stomach to reduce absorption of toxins.","zh":"在紧急情况下，临床医生可能会冲洗胃部以减少毒物吸收。"}]}],"synonyms":["rinses","washouts","irrigations"],"phonetic":"/ləˈvɑʒ/","extraExplanation":["“lavage”来自法语，字面意思与“清洗/冲洗”有关，因此在英语里常用于正式或医学语境。最常见搭配包括：gastric lavage（胃灌洗）、bronchoalveolar lavage（支气管肺泡灌洗，常用于检查/取样）、peritoneal lavage（腹腔灌洗）。","日常英语中更常说“wash out / rinse out”；“lavage(s)”多见于病历、论文或医疗说明书中。"]}
{"word":"lavalava","summary":{"en":"A Pacific Island wraparound waist cloth, especially a traditional Samoan garment.","zh":"太平洋岛国常见的腰部裹布式服装，尤指萨摩亚传统服饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rectangular piece of cloth worn wrapped around the waist, like a skirt; a traditional garment in Samoa and other Pacific Island cultures.","zh":"一块长方形布料，围在腰间像裙子一样穿；萨摩亚及其他太平洋岛国常见的传统服饰（类似围裙/裹裙）。"},"examples":[{"en":"He wore a lavalava to the beach because it was light and comfortable in the heat.","zh":"天气很热，他穿着一条 lavalava 去海边，因为又轻又舒服。"},{"en":"At the cultural festival, dancers performed in matching lavalavas.","zh":"在文化节上，舞者们穿着同款的 lavalava 表演。"}]}],"synonyms":["sarong","pareo","sulu","wrap skirt"],"phonetic":"/ˈlɑːvəˌlɑːvə/","extraExplanation":["“Lavalava”源自萨摩亚语，常用于指男女都可穿的腰部裹布（有时也写作“lava-lava”）。在不同太平洋地区，类似服饰也可能叫“sarong（沙笼）”“sulu（斐济等地常用）”“pareo（大溪地等地常用）”。","在正式场合与日常穿法可能不同：布料图案、长度、系法会随礼仪、场合与性别传统而变化。若在当地或文化活动中穿着，尊重场合与当地习惯会更得体。"]}
{"word":"lavalavas","summary":{"en":"“Lava” means hot melted rock from a volcano; “lavas” is its plural, often used when discussing different flows or types.","zh":"“lava”指火山喷出的高温熔融岩石；“lavas”是其复数，常用于讨论不同的岩浆流或类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hot, melted rock that comes out of a volcano; when it cools, it becomes solid rock.","zh":"从火山喷出的高温熔融岩石；冷却后会变成固体岩石。"},"examples":[{"en":"The volcano sent streams of lava down the mountain.","zh":"火山把岩浆流冲下山坡。"},{"en":"Fresh lava can be extremely dangerous because it stays hot for a long time.","zh":"新喷出的岩浆非常危险，因为它会在很长时间内保持高温。"}]},{"partOfSpeech":"n.","definition":{"en":"Different kinds or flows of lava (plural form: lavas), especially when talking about types in geology.","zh":"不同种类或不同流动/层的岩浆（复数：lavas），尤其用于地质学语境。"},"examples":[{"en":"Scientists compared the lavas from two separate eruptions.","zh":"科学家比较了两次不同喷发产生的岩浆。"}]}],"synonyms":["molten rock","magma (before it reaches the surface)"],"phonetic":"/ˈlɑːvə/","extraExplanation":["“lavalavas”不是常见英文单词。你可能想写的是“lava”（岩浆）或它的复数“lavas”。","区分：在地表流动时常说“lava”；还在地下、未喷出时通常叫“magma（岩浆，地下）”。日常英语里“lava”更常见。"]}
{"word":"lavalier","summary":{"en":"A lavalier is most commonly a small clip-on microphone; it can also mean a type of women’s necktie/neck ornament.","zh":"lavalier 最常指领夹麦克风；也可指一种女式领带/颈饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small microphone that clips to clothing (often on the collar or lapel), used for recording speech in interviews, presentations, film, and TV.","zh":"领夹麦克风；一种可夹在衣服上（常在领口或西装翻领处）的小型麦克风，用于采访、演讲、影视录音等。"},"examples":[{"en":"The reporter attached a lavalier to her jacket before the interview.","zh":"采访前，记者把领夹麦克风夹在外套上。"},{"en":"For the lecture, we used a wireless lavalier so the speaker could move freely.","zh":"讲座使用了无线领夹麦克风，讲者就能自由走动。"}]},{"partOfSpeech":"n.","definition":{"en":"A style of necktie or neck ornament worn by women, often tied in a soft bow or hanging ends.","zh":"（女式）领带/颈饰的一种款式；常系成柔和的蝴蝶结或垂下两端。"},"examples":[{"en":"She wore a blouse with a black lavalier at the collar.","zh":"她穿了一件衬衫，领口系着黑色的女式领带结。"}]}],"synonyms":["lav mic","lavalier mic","lapel mic","clip-on microphone"],"phonetic":"/ˌlævəˈlɪr/","extraExplanation":["“lavalier”一词源自法国历史人物“拉瓦利埃小姐”（Louise de La Vallière）的名字；她与当时流行的颈部饰带/系法相关，因此这种领饰被称为“lavalier”。后来这个词也被用来指夹在衣领附近的小型麦克风（因为常佩戴在领口位置）。","在音视频领域更常见的说法是“lavalier mic”或简写“lav mic”，也有人说“lapel mic”（翻领麦）。"]}
{"word":"lavaliere","summary":{"en":"Lavaliere can mean a small pendant on a necklace, and it can also refer to a clip-on (lavalier) microphone used for recording speech.","zh":"lavaliere 可指项链上的小吊坠，也可指用于收音的领夹式（lavalier）麦克风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pendant worn on a necklace, often set with a single stone (commonly a diamond).","zh":"（项链上的）小吊坠；常指镶有单颗宝石（多为钻石）的坠饰。"},"examples":[{"en":"She wore a diamond lavaliere with a simple black dress.","zh":"她穿着一条简单的黑裙子，配了一枚钻石小吊坠。"},{"en":"The antique lavaliere was passed down from her grandmother.","zh":"那枚古董小吊坠是她祖母传下来的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also: lavalier mic) A small clip-on microphone used in film, TV, theater, and interviews.","zh":"（也作：lavalier mic）领夹麦克风；常用于影视、电视、戏剧或采访的夹式小麦克风。"},"examples":[{"en":"The presenter clipped a lavalier microphone to his jacket.","zh":"主持人把领夹麦克风夹在西装外套上。"},{"en":"For the interview, they used a wireless lavalier mic to keep the audio clear.","zh":"采访时他们用了无线领夹麦克风，以保证收音清晰。"}]}],"synonyms":["pendant","necklace pendant","lavalier microphone","lav mic","clip-on mic"],"phonetic":"/ˌlævəˈlɪr/","extraExplanation":["“lavaliere / lavalier”都常见：首饰义多写作 lavaliere；领夹麦克风领域更常用 lavalier（也常直接说 lav mic）。","词源与文化背景：该词与法国历史人物拉瓦利埃尔公爵夫人（Louise de La Vallière，路易十四的情人）有关。19世纪末到20世纪初，英语中用她的名字指一种垂坠式项链/坠饰。后来“lavalier”也被借用来指可夹在衣领附近的小型麦克风，因为佩戴位置相似。"]}
{"word":"lavalieres","summary":{"en":"Lavalieres are either pendant-style necklaces or small clip-on microphones worn on clothing.","zh":"lavalieres 可指坠饰项链，也可指夹在衣服上的领夹式麦克风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece of jewelry worn around the neck, typically a pendant on a chain (often delicate and decorative).","zh":"（通常较精致的）女式项链；坠饰项链（常为链子加吊坠）。"},"examples":[{"en":"She wore a small gold lavaliere with a pearl pendant.","zh":"她戴着一条小巧的金色坠饰项链，上面挂着一颗珍珠。"},{"en":"The antique shop displayed silver lavalieres from the early 1900s.","zh":"古董店展示着20世纪初的银质坠饰项链。"}]},{"partOfSpeech":"n.","definition":{"en":"a small clip-on microphone worn on clothing near the chest; a lapel microphone.","zh":"领夹式麦克风；小型夹式麦（夹在衣领/胸前的麦克风）。"},"examples":[{"en":"For the interview, he clipped on a lavaliere to keep his hands free.","zh":"采访时他夹上了领夹麦，双手就能空出来。"},{"en":"The presenter’s lavaliere was hidden under her jacket collar.","zh":"主持人的领夹麦藏在外套领子下面。"}]}],"synonyms":["pendant necklace","locket","lapel mic","clip-on microphone","lav mic"],"phonetic":"/ˌlævəˈlɪr/","extraExplanation":["“lavaliere”一词与法国宫廷人物路易丝·德·拉·瓦利埃尔（Louise de La Vallière）相关：据说这种系在颈间的装饰风格与她的穿戴风尚有关，因此得名。","在影视与广播里，“lavaliere microphone”常被简称为“lav mic”或“lavalier mic”（拼写也常见为 lavalier）。你输入的“lavalieres”是复数形式。"]}
{"word":"lavaliers","summary":{"en":"Lavaliers are usually clip-on microphones worn on clothing; the word can also mean a pendant necklace.","zh":"lavaliers 通常指夹在衣服上的领夹麦克风；也可指吊坠项链。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small microphone that clips to your clothing (often on the collar or lapel), used for interviews, presentations, filming, etc.","zh":"领夹式麦克风（常夹在衣领或西装翻领上，用于采访、演讲、拍摄等）"},"examples":[{"en":"The host wore a lavalier so her hands were free while she talked.","zh":"主持人戴了领夹麦克风，这样说话时双手就能空出来。"},{"en":"Clip the lavalier to your shirt and hide the cable under your jacket.","zh":"把领夹麦克风夹在衬衫上，把线藏到外套里面。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece of jewelry: a pendant worn on a chain around the neck","zh":"（首饰）吊坠项链；挂坠（系在链子上戴在脖子上）"},"examples":[{"en":"She wore a simple lavalier with a small pearl pendant.","zh":"她戴着一条简洁的吊坠项链，上面有一颗小珍珠。"}]}],"synonyms":["lapel mic","clip-on microphone","tie-clip mic","pendant","pendant necklace"],"phonetic":"/ˌlævəˈlɪr/","extraExplanation":["“lavalier”源自法语（常与“La Vallière”相关），最早与一种吊坠式项链风格有关；后来因为领夹麦克风常挂在胸前、外形类似吊坠，这个词在影视与播音领域被广泛用来指“领夹麦克风”。","日常口语里，指麦克风时更常说 lapel mic / clip-on mic；“lavaliers”是其复数形式。"]}
{"word":"lavalike","summary":{"en":"Lava-like means resembling lava—thick, hot, glowing, or slow-flowing—and can also describe intense, burning emotion or energy.","zh":"lavalike（常写作 lava-like）意为“像熔岩的”，可形容黏稠炽热、发光或缓慢流动的状态，也可比喻强烈、灼热的情绪或气势。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling lava in appearance or movement (hot, thick, glowing, or slowly flowing).","zh":"像熔岩的；具有熔岩般外观或流动特征的（炽热、黏稠、发光或缓慢流动）。"},"examples":[{"en":"The volcano released a lava-like stream that crept down the slope.","zh":"火山释放出一股熔岩般的流体，缓慢地沿着山坡爬行而下。"},{"en":"Under the streetlights, the orange, lava-like glow made the wet road look unreal.","zh":"在路灯下，橙色的熔岩般光泽让湿漉漉的路面显得不真实。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Extremely hot, intense, or emotionally charged, as if burning.","zh":"（比喻）极其炽热、强烈或情绪高涨的，仿佛在燃烧。"},"examples":[{"en":"He answered with a lava-like anger that surprised everyone.","zh":"他带着熔岩般的怒火回答，令所有人吃惊。"},{"en":"The debate turned lava-like—slow at first, then suddenly overwhelming.","zh":"辩论变得像熔岩一样——起初缓慢，随后突然势不可挡。"}]}],"synonyms":["molten","lava-like","magma-like","fiery","glowing","seething"],"phonetic":"/ˈlɑːvəˌlaɪk/","extraExplanation":["“lava-like”通常用连字符作复合形容词（尤其放在名词前：a lava-like flow）。放在系动词后也可不加连字符（The flow was lava like），但写作中更常保留连字符以避免歧义。","比喻用法常强调两点：①热度/强度（burning intensity）；②推进方式（缓慢却不可阻挡）。写作时可配合动词如 creep, ooze, surge 来增强画面感。"]}
{"word":"lavalliere","summary":{"en":"A lavalliere is a soft ribbon necktie worn loosely and tied in a bow, usually as part of women’s clothing.","zh":"lavalliere 指一种松系并打成蝴蝶结的女式丝带领结/领带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman’s necktie: a soft, wide ribbon or tie worn loosely and tied in a bow at the neck (often as part of a blouse or dress).","zh":"女式领结（或领带）：一种柔软、较宽的丝带或领带，松松地系在颈部并打成蝴蝶结（常搭配衬衫或连衣裙）。"},"examples":[{"en":"She wore a white blouse with a black lavalliere at the collar.","zh":"她穿着白色衬衫，领口系着一条黑色的女式领结。"},{"en":"The costume designer added a satin lavalliere to give the outfit a vintage look.","zh":"服装设计师加了一条缎面的女式领结，让造型更有复古感。"}]}],"synonyms":["bow tie (women’s style)","ribbon tie","neck bow"],"phonetic":"/ˌlævəˈljɛr/","extraExplanation":["“lavalliere”常被认为源自法国路易十四时期的情妇路易丝·德·拉·瓦利耶尔（Louise de La Vallière）的名字；这种领部系带在19世纪末到20世纪初的女性服饰中很流行。","拼写上也常见“lavalier / lavaliere”（有时也指“领夹麦克风”），但“lavalliere”更偏向指服饰中的领结/领带。"]}
{"word":"lavament","summary":{"en":"“Lavament” is an archaic noun meaning “washing,” especially washing the hands.","zh":"“Lavament” 是一个古老/罕用名词，意思是“洗涤”，尤其指“洗手”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) the act of washing, especially washing the hands; a cleansing.","zh":"（古/罕用）洗涤的行为，尤指洗手；清洁。"},"examples":[{"en":"Before dinner, guests performed a quick lavament of their hands.","zh":"晚餐前，客人们简单洗了洗手。"},{"en":"In older texts, lavament may refer to ceremonial washing.","zh":"在较早的文本中，lavament 可能指仪式性的洗涤。"}]}],"synonyms":["washing","hand-washing","cleansing","ablution"],"phonetic":"/ˈlævəmənt/","extraExplanation":["该词非常罕见，现代英语里通常用 washing、hand-washing、ablution（较正式/宗教语境）来表达类似意思。","词源来自拉丁语 lavare（“清洗”），因此你也会在一些相关词里看到 lav- 词根，如 lavatory（洗手间，原意与“清洗”有关）。"]}
{"word":"lavand","summary":{"en":"“Lavand” is not a standard English word; it usually refers to “lavender.”","zh":"“lavand”不是标准英语常用词，通常指的是“lavender（薰衣草/淡紫色）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/nonstandard form that is usually a misspelling or shortened form of “lavender” (the purple color or the fragrant plant).","zh":"一种罕见/非标准写法，通常是 “lavender”（薰衣草/淡紫色）的拼写错误或缩写形式。"},"examples":[{"en":"Did you mean “lavender” (the plant) instead of “lavand”?","zh":"你想写的是 “lavender”（薰衣草）而不是 “lavand” 吗？"},{"en":"The label says “lavand,” but the scent is clearly lavender.","zh":"标签写着 “lavand”，但味道明显是薰衣草香。"}]}],"synonyms":["lavender","Lavandula"],"phonetic":"/ləˈvænd/","extraExplanation":["“lavand”在标准英语词典里通常不作为常用词条出现，更常见的是“lavender”（薰衣草/淡紫色）。如果你是在护肤品、香氛、品牌名或外来词环境里看到“lavand”，它可能是为了风格化拼写，或受法语/其他语言影响的写法。","如果你要表达植物学名称，更正式的属名是 Lavandula（薰衣草属）。"]}
{"word":"lavandera","summary":{"en":"Lavandera most commonly means a washerwoman (especially in U.S. Southwest usage); in Spanish it can also mean a wagtail (bird).","zh":"Lavandera 常指“洗衣妇”（尤见于美国西南部语境）；在西班牙语中也可指“鹡鸰”（一种鸟）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly in U.S. Southwest) a washerwoman; a woman who washes clothes for other people.","zh":"（主要见于美国西南部用法）洗衣妇；替他人洗衣服的女人。"},"examples":[{"en":"My great-grandmother worked as a lavandera for a wealthy family.","zh":"我曾祖母曾为一户富人做过洗衣妇（lavandera）。"},{"en":"The museum exhibit describes the daily life of a lavandera in early California.","zh":"博物馆展览介绍了早期加州一位洗衣妇（lavandera）的日常生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) a wagtail (a small bird with a long tail).","zh":"（西班牙语）鹡鸰（一种尾巴较长的小鸟）。"},"examples":[{"en":"In Spanish, the bird called a “lavandera” is a type of wagtail.","zh":"在西班牙语里，叫“lavandera”的鸟是一种鹡鸰。"}]}],"synonyms":["washerwoman","laundress"],"phonetic":"/ˌlɑːvənˈdɛrə/","extraExplanation":["“Lavandera”来自西班牙语，源于动词 lavand-（与 lavar “洗”有关）。在英语里它多见于美国西南部、与西班牙语/拉丁裔文化相关的历史语境（例如早期加州、新墨西哥等地的社区生活与劳作记录）。","如果你在英文文本中看到 lavandera，通常指“洗衣妇”；而在纯西班牙语语境里，它也常指一种鸟（wagtail）。可根据上下文判断。"]}
{"word":"lavanderas","summary":{"en":"“Lavanderas” is a Spanish word meaning “laundresses” (women who wash clothes professionally).","zh":"“lavanderas”是西语词，意思是“洗衣女工/洗衣妇”（以洗衣为业的女性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural noun) women who wash clothes for a living; laundresses.","zh":"（西语，复数名词）以洗衣为生的女性；洗衣女工。"},"examples":[{"en":"In the village, the lavanderas worked by the river all morning.","zh":"在村里，洗衣女工们整个上午都在河边干活。"},{"en":"The novel describes the songs of the lavanderas as they scrubbed clothes.","zh":"小说描写了洗衣女工们一边搓洗衣物一边唱歌的场景。"}]}],"synonyms":["laundresses","washerwomen"],"phonetic":"/ˌlɑːvənˈdɛrɑːz/","extraExplanation":["“lavanderas”来自西班牙语单数“lavandera”（洗衣女工）的复数形式。英语文章里常见于描写拉美或西语文化背景的场景，用来保留当地语言与氛围。","在一些地区文化叙事中，“lavanderas”不只是职业称呼，也会带出河边洗衣、集体劳动、女性社群与口述传统（聊天、唱歌、交换消息）等社会意象。"]}
{"word":"lavandero","summary":{"en":"Lavandero is a Spanish-derived word meaning a laundry worker (washerman), and in some regions it can also mean a place for washing clothes.","zh":"Lavandero 源自西班牙语，常指洗衣工（洗衣匠）；在部分地区也可指洗衣的地方/洗衣间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) a washerman or a person whose job is doing laundry; sometimes used for a laundry worker in Latin American contexts.","zh":"（源自西班牙语）洗衣工／洗衣匠；指以洗衣为业的人（在拉美语境中常见）。"},"examples":[{"en":"In the village, the lavandero washed clothes by the river every morning.","zh":"在村子里，那位洗衣工每天早上都在河边洗衣服。"},{"en":"She worked as a lavandero for wealthy families in town.","zh":"她在镇上为富人家庭做洗衣工。"}]},{"partOfSpeech":"n.","definition":{"en":"a laundry area or place where washing is done (regional usage in some Spanish-speaking communities).","zh":"洗衣的地方／洗衣间（某些西语地区的用法）。"},"examples":[{"en":"They built a small lavandero behind the house to wash clothes.","zh":"他们在房子后面建了一个小洗衣间来洗衣服。"}]}],"synonyms":["washerman","laundry worker","launderer"],"phonetic":"ˌlɑːvənˈdɛroʊ","extraExplanation":["“lavandero”是西班牙语名词，常见的性别对应形式是“lavandera”（女性）。在一些地区它也可指“洗衣的地方/洗衣台”。如果你是在英文文章里看到它，通常是保留西语词来呈现当地文化氛围，而英语里更常用“washerman / laundry worker / laundromat”等表达。"]}
{"word":"lavanderos","summary":{"en":"“Lavanderos” is a Spanish plural noun meaning launderers/washermen—people who wash clothes for others.","zh":"“lavanderos”是西班牙语复数名词，意思是洗衣工／洗衣匠（替别人洗衣服的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) plural of “lavandero”: people whose job is washing clothes; launderers/washermen.","zh":"（西班牙语）“lavandero”的复数：以洗衣为业的人；洗衣工／洗衣匠。"},"examples":[{"en":"In some Latin American towns, the lavanderos worked by the river, washing clothes for families.","zh":"在一些拉丁美洲城镇里，lavanderos 会在河边替人洗衣服。"},{"en":"The museum exhibit shows the tools lavanderos used before washing machines became common.","zh":"博物馆展览展示了在洗衣机普及之前，lavanderos 使用的工具。"}]}],"synonyms":["launderers","washermen","washers"],"phonetic":"/ˌlɑːvənˈdɛroʊs/","extraExplanation":["“lavandero”在西班牙语里通常指男性洗衣工（阴性常见为“lavandera”），复数“lavanderos”也可用作混合性别群体的泛称。","相关词：lavandería（洗衣店／洗衣房），lavar（洗）。在英语语境中更常直接说 launderers / washermen；“lavanderos”多见于涉及西语文化的写作、历史或人类学语境。"]}
{"word":"lavandier","summary":{"en":"“Lavandier” means a (usually male) laundry worker or washerman; it’s a rare French-derived word in English.","zh":"“Lavandier”指（通常为男性的）洗衣工/洗衣匠；在英语中较少见，带有法语来源色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who washes clothes for others; a laundry worker (especially a man).","zh":"替人洗衣服的人；洗衣工（尤指男性洗衣工）。"},"examples":[{"en":"In the old records, the village lavandier was paid partly in bread and wine.","zh":"在旧档案里，村里的洗衣工（lavandier）部分报酬是面包和葡萄酒。"},{"en":"She hired a lavandier to wash sheets and uniforms every week.","zh":"她雇了一位洗衣工每周清洗床单和制服。"}]}],"synonyms":["launderer","washerman","laundry worker"],"phonetic":"/ˌlævənˈdiər/","extraExplanation":["“Lavandier”源自法语，传统上指“洗衣工/洗衣匠”（女性常用对应词为 *lavandière*）。在英语里它比较少见，多出现在描写旧时生活、法国/法语地区文化（如历史文本、地域文学）或强调法语风格的语境中。"]}
{"word":"lavandin","summary":{"en":"Lavandin is a hybrid lavender plant widely grown for its strong-smelling essential oil.","zh":"Lavandin 是一种杂交薰衣草，因香气浓、产油量高而常被种植用于提炼精油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of lavender plant (a hybrid) grown mainly for its strongly scented flowers and essential oil, often used in soaps, detergents, and perfumes","zh":"（杂交）薰衣草的一种，主要为其浓郁香气的花与精油而栽培，常用于肥皂、洗涤剂与香水等香氛产品"},"examples":[{"en":"Lavandin oil is often used in soaps because it has a strong, clean scent.","zh":"杂交薰衣草精油常用于肥皂，因为它的香气很浓、很清新。"},{"en":"The farm grows lavandin in long rows for essential-oil production.","zh":"这座农场成排种植杂交薰衣草，用来生产精油。"},{"en":"This candle is scented with lavandin and rosemary.","zh":"这款蜡烛用杂交薰衣草和迷迭香来调香。"}]}],"synonyms":["hybrid lavender","lavender (general term)"],"phonetic":"/ˌlævəˈdɪn/","extraExplanation":["“Lavandin”通常指真正薰衣草（Lavandula angustifolia）与宽叶薰衣草（Lavandula latifolia）的杂交品种。它一般比真正薰衣草产油量更高、香味更“冲”且常带一点樟脑（camphor）调，因此在清洁用品中很常见；而更柔和、甜香的“lavender”在高端香水或助眠类产品中更常被强调。","词源上，“lavandin”来自法语用法；在普罗旺斯等地的香氛与精油产业里，这个词非常常见。"]}
{"word":"Lavandula","summary":{"en":"the lavender genus","zh":"薰衣草属"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aromatic plants in the mint family, commonly called lavender, known for purple flowers and fragrant oils used in perfumes and herbal products","zh":"薰衣草属（唇形科的一属芳香植物），以紫色花与香味精油闻名，常用于香水、护肤与草本制品"},"examples":[{"en":"Lavandula is widely grown for its scent and its pale purple blooms.","zh":"薰衣草属植物因香气与淡紫色花朵而被广泛栽培。"},{"en":"Many perfumes use essential oil distilled from Lavandula flowers.","zh":"许多香水会使用从薰衣草属花朵蒸馏出的精油。"}]}],"synonyms":["lavender"],"phonetic":"/ləˈvændʒʊlə/","extraExplanation":["这是“植物学拉丁名”（genus 名）。日常英语里更常说 lavender（薰衣草）。在园艺、芳疗、成分表或学术写作中更常见 Lavandula。"],"etymology":"源自新拉丁语 Lavandula（薰衣草属名），与拉丁语 lavare（“洗”）有关：古人常把薰衣草用于洗浴与熏香，使衣物与身体留香。","mnemonic":["联想拉丁词根 lav- ≈ “lavatory/洗”，薰衣草常用于洗浴与留香：Lavandula → “洗一洗也香香的薰衣草”。","把它拆开记：Lava-（像“lavender”的开头）+ -ndula（属名尾巴）→ 看到就想到“薰衣草属”。"]}
{"word":"lavandula","summary":{"en":"Lavandula is the botanical genus name for lavenders—fragrant plants often used for scent and decoration.","zh":"Lavandula 是薰衣草属的植物学属名，指一类常用于芳香与观赏的香草植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aromatic plants (lavenders) in the mint family, known for purple flowers and a strong, pleasant scent; often used in gardens, perfumes, and herbal products.","zh":"薰衣草属（薄荷科的一类芳香植物，常见紫色花、气味怡人；常用于园艺、香水与草本制品）。"},"examples":[{"en":"Lavandula is widely grown for its fragrance and its purple flower spikes.","zh":"薰衣草属植物因香气和紫色穗状花序而广泛栽培。"},{"en":"Many perfumes use essential oil extracted from Lavandula.","zh":"许多香水会使用从薰衣草属提取的精油。"},{"en":"In dry, sunny gardens, Lavandula often thrives.","zh":"在干燥、阳光充足的花园里，薰衣草属植物往往长得很好。"}]}],"synonyms":["lavender","lavenders"],"phonetic":"/ləˈvændʒʊlə/","extraExplanation":["“Lavandula”是拉丁学名（属名），日常英语里更常说“lavender（薰衣草）”。写作或学术语境中用“Lavandula”更精确，常见搭配如“Lavandula angustifolia”（真薰衣草/狭叶薰衣草）。","词源常与拉丁语“lavare（洗）”相关，因为古罗马时期薰衣草常用于沐浴、清洁与熏香。","园艺与香薰语境里，“Lavandula oil / lavender oil（薰衣草精油）”“dried lavender（干薰衣草）”都很常见；但医疗功效相关说法在不同文化和研究中证据强弱不一，建议用更中性的表达如“is used for…”而非“cures…”。"]}
{"word":"lavanga","summary":{"en":"Lavanga means “clove,” a warm, aromatic spice (common in South Asian contexts).","zh":"Lavanga 指“丁香”，一种温暖辛香的香料（常见于南亚语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"clove (the dried aromatic flower bud used as a spice), especially in Indian/South Asian cooking; sometimes also used to refer to the clove plant.","zh":"丁香（干燥芳香的花蕾香料），尤指印度/南亚烹饪语境中的称呼；有时也可指丁香植物。"},"examples":[{"en":"Add one or two lavanga to the tea to make masala chai more fragrant.","zh":"在茶里加一两粒 lavanga（丁香），做出的香料奶茶会更香。"},{"en":"The recipe calls for cinnamon, cardamom, and lavanga.","zh":"这道食谱需要肉桂、小豆蔻和 lavanga（丁香）。"}]}],"synonyms":["clove"],"phonetic":"/ləˈvɑːŋɡə/","extraExplanation":["“Lavanga”常见于印度及周边地区的英语语境（如菜单、香料清单、家庭食谱）中，来自南亚语言对“丁香”的称呼（与梵语传统有关）。在口味上它偏“温热、辛香”，常用于biryani（印度香饭）、garam masala（综合香料）、咖喱、腌料以及节日甜点等。英语里更常用的对应词是 clove。"]}
{"word":"lavant","summary":{"en":"Lavant is most commonly a place name; a rare older sense relates to washing/cleansing.","zh":"Lavant 最常见是地名；较少见的古义与“洗涤/清洁”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations (especially in Europe), such as the River Lavant in Austria and villages called Lavant in England","zh":"地名：用于若干地点的名称（多见于欧洲），例如奥地利的拉万特河（River Lavant）以及英格兰一些名为 Lavant 的村庄"},"examples":[{"en":"They hiked along the River Lavant in Austria.","zh":"他们沿着奥地利的拉万特河徒步旅行。"},{"en":"The train stopped near West Lavant in West Sussex.","zh":"火车在西萨塞克斯郡的 West Lavant 附近停靠。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare/archaic) washing; cleansing (used mostly in older or specialized writing)","zh":"（罕见/古义）洗涤；清洁（多见于较旧或特定领域的用法）"},"examples":[{"en":"In some older texts, you may see words like lavant connected to washing or cleansing.","zh":"在一些较旧的文本中，你可能会看到 lavant 这类与“洗涤、清洁”相关的词。"}]}],"synonyms":["cleansing","washing"],"phonetic":"/ləˈvænt/","extraExplanation":["“Lavant”在现代英语里最常见的是专有名词（地名）。如果你是在阅读地图、旅游资料或历史材料中遇到它，通常不用按普通词义去翻译。","它容易与“levant”（意为“东方/升起的”，如 the Levant “黎凡特地区”）混淆；两者拼写和读音相近，但含义与使用场景不同。"]}
{"word":"lavare","summary":{"en":"“Lavare” is an Italian verb meaning “to wash; to clean with water.”","zh":"“lavare”是意大利语动词，意思是“洗；用水清洗”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Italian) to wash; to clean something with water (often with soap).","zh":"（意大利语）洗；清洗（通常用水，常配合肥皂/清洁剂）。"},"examples":[{"en":"In Italian, “lavare” means “to wash,” as in “lavare le mani” (to wash your hands).","zh":"在意大利语里，“lavare”意思是“洗”，例如“lavare le mani”（洗手）。"},{"en":"Before cooking, remember to lavare the vegetables (wash the vegetables).","zh":"做饭前记得lavare这些蔬菜（把蔬菜洗干净）。"}]}],"synonyms":["wash","clean","cleanse","rinse"],"phonetic":"/ləˈvɑːreɪ/","extraExplanation":["“lavare”是意大利语不定式动词，属于以“-are”结尾的常见第一变位动词（类似英语里动词原形）。在日常使用中可指洗手、洗衣服、洗车等。意大利语里“清洗/冲洗”更强调动作时，也常见相关词如“lavarsi”（洗自己/洗澡）以及“lavaggio”（清洗/洗车等名词形式）。"]}
{"word":"lavaret","summary":{"en":"Lavaret is a European freshwater whitefish, often served as food.","zh":"Lavaret 指一种欧洲常见的淡水白鲑类鱼，常用于食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of whitefish (a freshwater fish) found mainly in European lakes; often eaten as food","zh":"拉瓦雷特鱼；一种白鲑（淡水鱼），主要见于欧洲湖泊，常作为食用鱼"},"examples":[{"en":"We ordered smoked lavaret with lemon and herbs.","zh":"我们点了烟熏拉瓦雷特鱼，配柠檬和香草。"},{"en":"Lavaret is common in some Alpine and Scandinavian lakes.","zh":"在一些阿尔卑斯地区和斯堪的纳维亚地区的湖泊里，拉瓦雷特鱼很常见。"}]}],"synonyms":["whitefish"],"phonetic":"/ˈlævəˌrɛt/","extraExplanation":["“lavaret”是一个相对少见的英语借词，常出现在欧洲语境（尤其是法语/瑞士、阿尔卑斯地区的餐饮与渔业介绍）中，指某类白鲑（whitefish）。在不同地区，它有时也会与“白鲑/白鱼”家族的近缘种混用，因此在阅读菜单或科普文章时，可把它理解为“可食用的淡水白鲑类鱼”。"]}
{"word":"lavas","summary":{"en":"“Lavas” is the plural of “lava,” used especially for multiple lava flows or different kinds of lava.","zh":"“lavas”是“lava”的复数，常用于表示多股熔岩流或不同类型的熔岩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of lava: hot, melted rock that flows from a volcano (often used when talking about different flows or types).","zh":"lava 的复数：从火山流出的高温熔融岩浆（常用于强调不同的熔岩流或不同类型的熔岩）。"},"examples":[{"en":"Scientists compared the chemical makeup of lavas from two eruptions.","zh":"科学家比较了两次喷发产生的熔岩（复数）在化学成分上的差异。"},{"en":"The map shows where the lavas flowed after the volcano erupted.","zh":"地图显示火山喷发后熔岩（复数）流经的路径。"}]}],"synonyms":["lava flows","molten rock"],"phonetic":"/ˈlɑːvəz/","extraExplanation":["“lava”在日常英语里多为不可数名词（例如：Lava covered the road. 熔岩覆盖了道路）。当你需要强调“多股/多次/不同来源的熔岩”时，学术写作或科普中会用复数“lavas”。"]}
{"word":"lavash","summary":{"en":"Lavash is a thin flatbread often used for wraps, common in Armenian and nearby cuisines.","zh":"Lavash（拉瓦什）是一种薄扁面包，常用来卷食物，常见于亚美尼亚及周边地区的饮食中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, soft flatbread common in Armenia and across the Caucasus, Iran, and parts of the Middle East, often used to wrap food or served with meals.","zh":"一种薄而柔软的扁面包，常见于亚美尼亚以及高加索、伊朗和中东部分地区；常用来卷食物或配菜食用。"},"examples":[{"en":"We wrapped grilled chicken and herbs in lavash.","zh":"我们用拉瓦什把烤鸡和香草卷起来吃。"},{"en":"Lavash is often served with cheese, greens, and dips.","zh":"拉瓦什常与奶酪、绿叶菜和蘸酱一起上桌。"}]}],"synonyms":["flatbread","wrap (bread)"],"phonetic":"/ləˈvɑːʃ/","extraExplanation":["“Lavash”在英语里通常直接指这种面饼本身；在不同地区口感会有变化：有的偏软有韧性，适合做卷饼；也有烤得更干更脆的版本，可掰开搭配蘸酱。","它与“pita（口袋饼）”“tortilla（玉米/小麦薄饼）”相似，但通常更大更薄、也没有pita那种中间鼓起形成的“口袋”。","“Lavash”在英语菜单中很常见，尤其在亚美尼亚/波斯/高加索风味餐厅。联合国教科文组织曾将亚美尼亚传统制作lavash的文化实践列入非物质文化遗产名录。"]}
{"word":"lavatera","summary":{"en":"Lavatera is a garden flowering plant (tree/annual mallow) with large, hibiscus-like blooms.","zh":"Lavatera指一种常见园艺开花植物（树锦葵/一年生锦葵），花朵大、像木槿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant in the mallow family (formerly the genus *Lavatera*), known for its large, hibiscus-like blooms; commonly called tree mallow or annual mallow","zh":"锦葵科的开花植物（过去多归入*Lavatera*属，现常并入锦葵属*Malva*），花朵大、类似木槿；常见俗名有“树锦葵/一年生锦葵”"},"examples":[{"en":"Lavatera is popular in gardens because it produces lots of big, pastel flowers.","zh":"锦葵（lavatera）在花园里很受欢迎，因为它会开出很多大朵的淡色花。"},{"en":"We planted lavatera near the fence to create a soft, cottage-garden look.","zh":"我们把lavatera种在篱笆旁，营造一种柔和的乡村花园风格。"},{"en":"Bees were visiting the lavatera blooms all afternoon.","zh":"蜜蜂整个下午都在采lavatera的花。"}]}],"synonyms":["mallow","tree mallow","annual mallow"],"phonetic":"/ˌlævəˈtɪrə/","extraExplanation":["“Lavatera”是拉丁化的植物学名称，来源于17世纪的瑞士医生与博物学家Lavater兄弟的姓氏，用来纪念他们对自然史与植物研究的贡献。","在现代植物分类中，许多原先归为*Lavatera*的种已被并入锦葵属*Malva*，所以你在种子包装、园艺书或学术资料里可能会看到两种名字并存。"]}
{"word":"lavatic","summary":{"en":"“Lavatic” is a rare word meaning “related to washing/cleansing.”","zh":"“lavatic”是一个很少见的词，意思是“与清洗/洗涤有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/obsolete) related to washing or cleansing; used for washing.","zh":"（罕见/旧用）与清洗、洗涤有关的；用于清洗的。"},"examples":[{"en":"In older texts, “lavatic” could describe water used for washing.","zh":"在较早的文本中，“lavatic”有时用来形容用于洗涤的水。"},{"en":"The term is rare today; people usually say “washing” or “cleansing.”","zh":"这个词现在很少用；人们通常说“washing”或“cleansing”。"}]}],"synonyms":["washing","cleansing","purifying","lustral"],"phonetic":"/ləˈvætɪk/","extraExplanation":["“lavatic”在现代英语里非常少见，很多时候会被认为是拼写错误。最常见的混淆词是 **lavatory**（厕所/洗手间）或 **lavatic** 被误写成与“洗手间”有关的词。","词源上可追溯到拉丁语 **lavare**（洗），加上形容词后缀 **-atic**（“……相关的”）。如果你是在某本书、历史材料或专业语境里看到它，通常就是“洗涤/净身相关”的意思。","如果你告诉我你看到它的句子上下文，我可以帮你判断它究竟是“lavatic（洗涤的）”还是想表达“lavatory（洗手间）/lavish/leviatic”等其他词。"]}
{"word":"lavation","summary":{"en":"Lavation is a rare noun meaning the act of washing or cleansing.","zh":"Lavation 是一个很少见的名词，意思是“清洗/洗涤”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of washing or cleansing; washing.","zh":"（罕用）洗涤；清洗；沐洗。"},"examples":[{"en":"In older writing, “lavation” can mean washing the hands before a meal.","zh":"在较早的文字中，lavation 可指用餐前洗手。"},{"en":"The nurse performed a gentle lavation of the wound with clean water.","zh":"护士用清水对伤口进行了轻柔的清洗。"}]}],"synonyms":["washing","cleansing","ablution","laving","lavage"],"phonetic":"/ləˈveɪʃən/","extraExplanation":["“lavation”在现代英语里非常少见，读者更常见的是同源词：lavatory（洗手间）、to lave（洗/沐洗，较文学化）、ablution（宗教或正式语境的“净身/洗礼式洗涤”）。","词源来自拉丁语 lavare（洗）。在医学语境里，人们更常用 lavage 表示“冲洗（胃/伤口等）”，而不是 lavation。","如果你原本想写“lavation”，也可能是在拼写或选词上想表达“清洗/冲洗”：日常可用 washing/cleaning；医学更常用 lavage。"]}
{"word":"lavational","summary":{"en":"Lavational is a very rare adjective meaning “related to washing/cleansing,” especially ritual washing.","zh":"Lavational 是一个非常少见的形容词，意为“与清洗/洁净有关”，尤其指仪式性的净身洗涤。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) relating to washing or cleansing; connected with a ritual washing (ablution).","zh":"（非常少见）与清洗、洁净有关的；与（宗教或仪式性的）洗涤/沐浴净身有关的。"},"examples":[{"en":"Some older texts mention a “lavational rite,” meaning a ritual washing before prayer.","zh":"一些较旧的文本会提到“lavational rite”，指祈祷前的仪式性洗涤。"},{"en":"The guide describes lavational practices for visitors, such as washing hands before entering the shrine.","zh":"导览说明了访客的净身做法，例如进入神社前先洗手。"}]}],"synonyms":["washing","cleansing","purificatory","ablutionary"],"phonetic":"/ləˈveɪʃənəl/","extraExplanation":["“lavational”在现代英语里非常罕见，很多词典不收或标为少用/古用。写作和日常表达中更常用：washing / cleansing（清洗、清洁），ritual washing / ablution（宗教性净身）。","词源上可联系拉丁语 lavare（洗）。容易让人联想到 lavatory（洗手间）或 lavage（冲洗），但这些是更常见的相关词。"]}
{"word":"lavations","summary":{"en":"“Lavations” means acts of washing or cleansing, often with a ceremonial or formal tone.","zh":"“Lavations”指清洗、净身等清洁行为，常带有仪式性或较正式的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Washings or acts of washing; ritual or thorough cleansing (a rare word, usually seen as the plural “lavations”).","zh":"洗涤、清洗的行为；（尤指）仪式性的或彻底的清洁（较少见的词，常用复数形式“lavations”）。"},"examples":[{"en":"After the hike, a hot shower and other lavations felt wonderful.","zh":"徒步之后，洗个热水澡以及其他清洁活动让人很舒服。"},{"en":"The text describes ceremonial lavations before entering the temple.","zh":"文中描述了进入寺庙前的仪式性净身清洗。"}]}],"synonyms":["washings","cleansing","ablutions","bathing"],"phonetic":"/ləˈveɪʃənz/","extraExplanation":["“Lavations”来自拉丁语词根 lavare（“清洗”）。在现代英语里它很少用于日常对话，更常见的说法是 washing(s)、bathing、cleansing 或 ritual washing。","它有时带一点文学/古风色彩，用来强调“正式、讲究、带仪式感的清洗”，而不只是普通的“洗手/洗澡”。"]}
{"word":"lavatorial","summary":{"en":"“Lavatorial” means “related to toilets or bathrooms,” often in a formal or humorous style.","zh":"“lavatorial”意为“与厕所/洗手间有关的”，常用于较正式或带幽默感的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to toilets, bathrooms, or washing facilities (often used in a formal, humorous, or old-fashioned way).","zh":"与厕所、洗手间或盥洗设施有关的（常带正式、幽默或略显古旧的语气）。"},"examples":[{"en":"The hotel has excellent lavatorial facilities on every floor.","zh":"这家酒店每层楼都有很好的盥洗设施。"},{"en":"He made a joke about lavatorial humor in the movie.","zh":"他开了个关于电影里“厕所笑料”的玩笑。"}]}],"synonyms":["toilet-related","bathroom","restroom (adj. use)","sanitary"],"phonetic":"/ˌlævəˈtɔriəl/","extraExplanation":["“lavatorial”来自“lavatory”（厕所/洗手间），而“lavatory”源自拉丁语 lavare（洗）。因此它本来就带有“洗涤/盥洗”的含义。","在日常英语里更常用 bathroom/restroom/toilet；“lavatorial”比较少见，多见于较正式的写作、讽刺/幽默语境，或英式英语风格的表达。","常见搭配：lavatorial facilities（盥洗设施）、lavatorial humor（厕所笑话/低俗笑料）。"]}
{"word":"lavatories","summary":{"en":"“Lavatories” means bathrooms/toilets, especially as a polite, formal term often used in public transportation or public buildings.","zh":"“lavatories”指“盥洗室/厕所”，语气较委婉正式，常用于公共交通或公共建筑场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bathrooms or toilets (a polite word, often used in public places, schools, trains, or airplanes).","zh":"盥洗室；厕所（较委婉的说法，常用于公共场所、学校、火车或飞机等）。"},"examples":[{"en":"The lavatories are at the end of the hall on the left.","zh":"盥洗室在走廊尽头的左边。"},{"en":"Passengers should remain seated unless they need to use the lavatory.","zh":"乘客应保持就座，除非需要使用洗手间。"}]},{"partOfSpeech":"n.","definition":{"en":"A room with a toilet and a sink, especially in British or formal usage.","zh":"带马桶和洗手池的房间（尤其在英式英语或较正式语境中）。"},"examples":[{"en":"There is a small lavatory next to the kitchen.","zh":"厨房旁边有一间小盥洗室。"}]}],"synonyms":["restroom","bathroom","toilet","washroom","ladies' room","men's room"],"phonetic":"/ˈlævəˌtɔri/","extraExplanation":["“lavatories”是复数形式，单数是“lavatory”。在美式英语里，日常更常说“bathroom / restroom”；“lavatory”听起来更正式，也常见于标识（如机场、火车、飞机上）。","这个词源头与“清洗（lav-）”有关，最初更偏“洗手/盥洗”的意思，因此带有委婉色彩。"]}
{"word":"lavatory","summary":{"en":"Lavatory is a formal word for a toilet/bathroom, especially on planes or in public places.","zh":"Lavatory 是“厕所/洗手间”的较正式说法，常见于飞机或公共场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toilet or bathroom, especially in a public place or on a plane/train/ship (more formal than “toilet”).","zh":"厕所；洗手间（较正式用语，常用于公共场所或飞机/火车/轮船上）。"},"examples":[{"en":"The lavatory is at the back of the plane.","zh":"洗手间在飞机后部。"},{"en":"Excuse me—where is the lavatory?","zh":"打扰一下——请问洗手间在哪儿？"}]},{"partOfSpeech":"n.","definition":{"en":"a small room or area with a sink for washing hands (sometimes used this way, especially in older or formal contexts).","zh":"盥洗室；洗手处（有时这样用，偏旧式或较正式语境）。"},"examples":[{"en":"Guests may use the lavatory to wash their hands before dinner.","zh":"客人可以在晚餐前去盥洗室洗手。"}]}],"synonyms":["restroom","bathroom","toilet","washroom"],"phonetic":"/ˈlævəˌtɔri/","extraExplanation":["“Lavatory”在美式英语里通常指“厕所/洗手间”，语气较正式；日常更常说“bathroom”(家里或公共场所常用委婉说法) 或 “restroom”(公共场所常见)。在飞机上，机组人员和标识常用“lavatory”。","词源来自拉丁语 lavare（“洗”），所以它也可能带有“洗手处/盥洗”的含义；不过现代口语中最常理解为“厕所”。"]}
{"word":"lavature","summary":{"en":"“Lavature” is a rare/archaic noun meaning washing or cleansing.","zh":"“Lavature”是一个罕见/古旧名词，意思是“清洗、洗涤、洁净”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) The act or process of washing; cleansing (especially washing the body or clothing).","zh":"（罕见/古旧）清洗、洗涤的行为或过程；（尤指）洗身体或衣物。"},"examples":[{"en":"In older texts, “lavature” can refer to washing the hands before a meal.","zh":"在较早的文本中，lavature 可指饭前洗手。"},{"en":"The healer recommended daily lavature to prevent infection.","zh":"医者建议每天清洗以预防感染。"}]}],"synonyms":["washing","cleansing","ablution","laundering"],"phonetic":"/ˈlævəˌtʃər/","extraExplanation":["“lavature”在现代英语中非常少见，多见于古旧或仿古写作。常见词是“washing / cleansing”。","它来自拉丁语词根 lavare（“洗”），与“lavatory”（厕所/洗手间）在词源上有关，但“lavature”本身通常不表示“厕所”。如果你想表达“洗手间”，更可能是想写“lavatory”或“bathroom / restroom”。"]}
{"word":"Lavaux","summary":{"en":"A famous Swiss terraced vineyard region on Lake Geneva.","zh":"瑞士日内瓦湖畔著名的梯田葡萄园产区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A terraced wine-growing region on the north shore of Lake Geneva in Switzerland, famous for its vineyards and designated as a UNESCO World Heritage Site.","zh":"瑞士日内瓦湖（莱芒湖）北岸的梯田葡萄酒产区，以葡萄园景观闻名，并被列为联合国教科文组织世界遗产。"},"examples":[{"en":"We took the train through Lavaux and saw vineyards climbing the hills above Lake Geneva.","zh":"我们坐火车穿过拉沃葡萄园梯田区，看见葡萄园沿着日内瓦湖上方的山坡层层向上延伸。"},{"en":"Lavaux wines are often made from the Chasselas grape.","zh":"拉沃地区的葡萄酒常用霞多丽——不，这里更典型的是夏斯拉（Chasselas）葡萄来酿造。"},{"en":"The stone walls in Lavaux help store heat and protect the vines.","zh":"拉沃的石墙能蓄热并保护葡萄藤。"}]}],"synonyms":["Lavaux Vineyard Terraces"],"phonetic":"/ləˈvoʊ/","extraExplanation":["Lavaux 通常指洛桑与蒙特勒之间的坡地葡萄园带，以“梯田+石墙+湖面反光”的独特微气候闻名：阳光（上方）、石墙蓄热（中间）、湖水反射（下方）常被称为“三重阳光”。","在旅游与餐酒文化中，Lavaux 常和“葡萄园徒步”“酒庄品酒”“列车观景”等搭配出现。"],"etymology":"来自法语地名“Lavaux”，位于瑞士法语区沃州（Vaud）。作为地名使用，其词源更接近地区历史命名传统；现代语境中主要指该葡萄梯田与产区。","mnemonic":["记成“拉（La）+沃（Vaux≈沃）”：联想到“拉沃葡萄园”，和瑞士沃州（Vaud）同一片法语区。","发音像“la-VOH”：重音在后面，想到“往后坡上走（VOH）看梯田葡萄园”。"]}
{"word":"lave","summary":{"en":"Lave means “to wash/bathe” or “(of water) to wash against,” and it is often used in poetic or literary descriptions.","zh":"Lave 表示“洗涤/沐浴”或“（水浪）冲刷、轻抚”，多见于诗意或文学描写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wash or bathe (someone or something), often in a gentle or poetic way","zh":"（常带诗意）洗涤；沐浴（某人或某物）"},"examples":[{"en":"She laved her face with cool water after the long hike.","zh":"长途徒步后，她用凉水洗了洗脸。"},{"en":"The nurse laved the wound carefully before bandaging it.","zh":"护士在包扎前小心地清洗了伤口。"}]},{"partOfSpeech":"v.","definition":{"en":"(of water or waves) to flow over, wash against, or bathe a shore or object","zh":"（水/海浪）拍打；冲刷；轻抚（岸边或物体）"},"examples":[{"en":"Waves laved the rocks at the edge of the bay.","zh":"海浪拍打着海湾边的岩石。"},{"en":"A warm current laved the sand all afternoon.","zh":"温暖的海流整个下午都轻抚着沙滩。"}]}],"synonyms":["wash","bathe","rinse","cleanse","sweep (over)","lap (against)"],"phonetic":"/leɪv/","extraExplanation":["“lave”在现代英语里不算常用，更常见于文学或抒情语境，用来营造“水轻柔洗涤/轻抚”的画面感。日常表达通常用“wash / bathe / rinse”。","词源来自拉丁语 *lavare*（洗），也与“lavatory（盥洗室）”“lava（火山熔岩，词源不同但拼写相近）”容易混淆；注意“lave”读作 /leɪv/，不要和“love /lʌv/”混淆。"]}
{"word":"laveche","summary":{"en":"“laveche” is a regional word for a strong southwesterly wind near Lake Geneva in Switzerland.","zh":"“laveche”指瑞士日内瓦湖一带的地方性强西南风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local Swiss French term for a strong southwesterly wind (especially around Lake Geneva), sometimes bringing warmer air and rough weather","zh":"（瑞士法语用语）“拉韦什风”：一种当地的强劲西南风（尤指日内瓦湖一带），常带来较暖空气和较为恶劣的天气"},"examples":[{"en":"A laveche can make the lake suddenly choppy and difficult for small boats.","zh":"拉韦什风会让湖面突然变得波涛汹涌，小船行驶会更困难。"},{"en":"Locals warned that a laveche was coming, so we postponed our hike.","zh":"当地人提醒拉韦什风要来了，所以我们推迟了徒步计划。"}]}],"synonyms":["(no close common-English synonym; compare regional wind names: mistral, sirocco, foehn)"],"phonetic":"/ləˈvɛʃ/","extraExplanation":["“laveche”并不是常见英语词，更常见于瑞士法语语境（如日内瓦湖周边）。在英文文本里出现时，通常是作为外来地名风/地方风的名称使用（类似于 *mistral*、*sirocco* 这类“特定地区的风名”）。","拼写有时也会见到带重音的法语形式（如 *lavèche*），但英语里多直接用不带重音的写法。"]}
{"word":"laved","summary":{"en":"“Laved” means “washed/bathed gently,” especially in literary descriptions (often of waves).","zh":"“laved”表示“轻轻冲洗/沐浴”，多见于文学描写（常指海浪拍岸）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “lave”) to wash or bathe something gently, often with water moving over it (literary).","zh":"（lave 的过去式/过去分词）轻轻冲洗或沐浴（某物），常指水流拂过（偏文学用法）。"},"examples":[{"en":"Waves laved the shore all night.","zh":"海浪整夜轻拍着海岸。"},{"en":"She laved her face with cool water.","zh":"她用凉水轻轻洗了洗脸。"},{"en":"Moonlight laved the garden in silver.","zh":"月光如银般洒满（“轻拂”着）花园。"}]}],"synonyms":["washed","bathed","rinsed","lapped (of waves)"],"phonetic":"/leɪvd/","extraExplanation":["“lave”在现代英语中不算常用，更多见于诗歌、文学或较正式的描写，常带有“轻柔地拍打/拂过”的画面感（尤其描写海浪）。","注意与“lavish（慷慨的/挥霍的）”拼写相近但意义无关。"]}
{"word":"laveer","summary":{"en":"“laveer” isn’t a standard English word; it’s likely a misspelling or a proper name.","zh":"“laveer”不是标准常用英语词；多半是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling or a name (e.g., a surname or place name).","zh":"不是常见英语词典里的标准单词；更可能是拼写错误，或是专有名词（如姓氏、地名）。"},"examples":[{"en":"I couldn’t find “laveer” in the dictionary—did you mean “lavender” or “lever”?","zh":"我在词典里找不到“laveer”——你是不是想写“lavender（薰衣草）”或“lever（杠杆）”？"},{"en":"“Laveer” can also appear as a family name in some contexts.","zh":"在某些语境中，“Laveer”也可能作为姓氏出现。"}]}],"phonetic":"/ləˈvɪr/","extraExplanation":["“laveer”在现代英语中不算常用词，很多情况下是拼写接近词的误写。你可以对照你的语境看看是否想表达：1) lavender（薰衣草/淡紫色），2) lever（杠杆/手段），3) veer（转向/突然改变方向），或 4) 作为专有名词（人名/地名）。如果你把原句发我，我可以帮你精准判断应当是哪一个词。"]}
{"word":"laveered","summary":{"en":"“Laveered” means “tacked/zigzagged,” especially in nautical English (sailing back and forth against the wind).","zh":"“laveered”意为“之字形/来回偏转地前进”，尤其用于航海语境，指通过不断换舷来逆风航行。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of **laveer**) To sail against the wind by turning the boat back and forth (tacking).","zh":"（**laveer** 的过去式）指（航海）通过不断转向、之字形航行来逆风前进（抢风航行/换舷航行）。"},"examples":[{"en":"The small sailboat **laveered** up the bay to reach the harbor.","zh":"那艘小帆船**之字形抢风**驶过海湾，进入港口。"},{"en":"In rough weather, the captain **laveered** to keep the ship under control.","zh":"在恶劣天气里，船长通过**不断换舷抢风**来保持船只可控。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) To move in a zigzag or wavering way; to veer back and forth.","zh":"（较少见）指呈之字形或摇摆不定地移动；来回偏转。"},"examples":[{"en":"The car **laveered** slightly as it avoided potholes.","zh":"那辆车为了躲避坑洞，稍微**来回偏转**。"},{"en":"Her attention **laveered** between the speaker and her phone.","zh":"她的注意力在演讲者和手机之间**摇摆不定**。"}]}],"synonyms":["tacked","zigzagged","veered","wavered","swerved"],"phonetic":"/ləˈvɪr/","extraExplanation":["“laveer”在现代英语中很少见，最常出现在航海语境里，意思接近“tack（抢风航行/换舷）”。如果你是在普通文章里看到“laveered”，作者可能是在用一种较文学化/古风的说法来表达“zigzagged / veered / wavered（之字形前进/偏转/摇摆）”。","也有人把它误写成“levered（用杠杆撬动）”或“leered（斜眼看/色眯眯地看）”。如果你能提供原句，我可以帮你判断具体是哪一个词。"]}
{"word":"laveering","summary":{"en":"“Laveering” is not standard English; it usually means “wavering” (unsteady, uncertain, hesitating).","zh":"“laveering”不是标准英语；通常是想写“wavering”（不稳定、动摇、犹豫）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard / likely misspelling) Usually intended to mean “wavering”: not steady or firm; changing back and forth; unsure.","zh":"（非标准拼写/很可能是拼写错误）通常想表达“wavering”：不稳定的；摇摆不定的；犹豫不决的。"},"examples":[{"en":"Her voice was wavering, as if she might cry.","zh":"她的声音有些颤抖，仿佛快要哭出来。"},{"en":"I’m wavering between tea and coffee.","zh":"我在茶和咖啡之间犹豫不决。"},{"en":"Public support is wavering after the bad news.","zh":"坏消息之后，公众支持开始动摇。"}]},{"partOfSpeech":"vi.","definition":{"en":"(From the verb) “to waver”: to move unsteadily or to become uncertain; to hesitate.","zh":"（源自动词）“to waver”：摇晃；动摇；犹豫。"},"examples":[{"en":"The candle flame wavered in the wind.","zh":"烛光在风中摇曳。"},{"en":"He wavered for a moment before answering.","zh":"他犹豫了一下才回答。"}]}],"synonyms":["wavering","unsteady","uncertain","hesitant","vacillating"],"phonetic":"/ˈweɪv(ə)rɪŋ/","extraExplanation":["“laveering”不是常见或标准的英文拼写。最接近、最常用的词通常是“wavering”。如果你是在某本书/歌词/方言里看到“laveering”，也可能是作者的非常规拼写（为了口音或风格），但在日常写作中建议用“wavering”。","相关词形：waver（动词），wavering（形容词/现在分词）。常见搭配：wavering voice（颤抖的声音）、wavering confidence（信心动摇）、waver between A and B（在A和B之间犹豫）。"]}
{"word":"laveers","summary":{"en":"“Levers” are tools (bars) that help lift or move things, and figuratively they are ways to influence outcomes.","zh":"“Levers”指用于撬动、抬起或控制的杠杆/拉杆；也可比喻为影响结果的手段或力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely meant: “levers”) Simple machines: rigid bars used to lift, move, or press something, usually by pivoting on a fixed point (a fulcrum).","zh":"（你可能想写的是 levers）杠杆：一种简单机械——坚硬的杆，通过绕固定支点（支点/支轴）转动来撬起、移动或施加压力。"},"examples":[{"en":"The mechanic used a lever to lift the engine slightly.","zh":"修理工用杠杆把发动机稍微抬起来。"},{"en":"Push down on the lever to open the door.","zh":"按下把手/拉杆就能开门。"}]},{"partOfSpeech":"n.","definition":{"en":"Ways to influence a situation; sources of power or advantage you can use to get a result.","zh":"（比喻）影响局势的手段；可以用来达成结果的“筹码/力量”。"},"examples":[{"en":"Education is one of the best levers for social change.","zh":"教育是推动社会改变的最好杠杆之一。"},{"en":"She used her connections as a lever to get an interview.","zh":"她利用人脉作为“杠杆”争取到一次面试。"}]},{"partOfSpeech":"vt.","definition":{"en":"To move or lift something by using a lever, or to pry something open.","zh":"用杠杆撬动/抬起；撬开。"},"examples":[{"en":"They levered the lid off the crate.","zh":"他们用工具把木箱盖撬开了。"},{"en":"He levered the rock out of the ground.","zh":"他把那块石头从地里撬了出来。"}]}],"synonyms":["bars","handles","controls","influence","leverage"],"phonetic":"/ˈlɛvər/","extraExplanation":["“laveers”不是常见英语单词；最常见的对应可能是拼写错误：levers（lever 的复数）或动词 levers（第三人称单数）。","美式英语中 lever 的常见读音是 /ˈlɛvər/；也有人读 /ˈliːvər/，两种都能听到。","lever 作名词既可指“杠杆/拉杆/把手”，也常用于抽象意义（a lever for change = 改变的杠杆/推动力）。"]}
{"word":"lavehr","summary":{"en":"“lavehr” is not a recognized English word; it’s likely a misspelling (possibly “lavender”).","zh":"“lavehr”不是常见英文单词；很可能是拼写错误（可能想写“lavender”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username.","zh":"不是标准英语单词，可能是拼写错误，或是人名/用户名。"},"examples":[{"en":"I couldn’t find “lavehr” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“lavehr”——你能确认一下拼写吗？"},{"en":"Did you mean “lavender” (the purple flower / light purple color)?","zh":"你是不是想写“lavender”（薰衣草/淡紫色）？"}]}],"extraExplanation":["“lavehr”看起来像是把字母顺序打错了或少打/多打了字母。比较常见、接近的可能是：\n- lavender /ˈlævəndɚ/：薰衣草；淡紫色\n- laver：海藻（食用紫菜的一种，较少见）\n- lave（较少见）：洗涤；（宗教语境）沐浴、洗手\n如果你告诉我你想表达的中文意思或上下文句子，我可以帮你锁定正确单词并给出详细释义和用法。"]}
{"word":"lavement","summary":{"en":"Lavement means an enema; it’s a rare, old-fashioned medical term in English.","zh":"Lavement 指“灌肠”；在英语中属于较少用、偏旧的医学词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical procedure of flushing the lower bowel with liquid; an enema (now rare or old-fashioned in modern English)","zh":"（医学）用液体冲洗下肠道的处理；灌肠（现代英语中较少用/偏旧）"},"examples":[{"en":"The old medical text mentions a lavement to relieve severe constipation.","zh":"那本旧医学书提到用灌肠（lavement）来缓解严重便秘。"},{"en":"In historical novels, doctors sometimes prescribe a lavement as a routine treatment.","zh":"在历史小说里，医生有时会把灌肠（lavement）当作常规疗法。"}]}],"synonyms":["enema","bowel irrigation"],"phonetic":"/ləˈvɑːmənt/","extraExplanation":["“Lavement”来自法语，字面意思与“清洗/洗涤”有关。在英语里它多见于旧式医学用语或文学作品中；现代更常用的是“enema”。使用时要注意语体：在日常交流中说“enema”更自然。"]}
{"word":"lavender","summary":{"en":"Lavender means a fragrant purple-flowered plant, and also the light purple color associated with it.","zh":"Lavender 指香味浓郁、开紫色花的薰衣草植物，也可指与之相关的淡紫色（薰衣草色）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small fragrant plant with purple flowers, often used for perfume, oil, and decoration","zh":"薰衣草（一种带紫色花、香味浓郁的植物，常用于香水、精油与装饰）"},"examples":[{"en":"The garden smells like lavender in the summer.","zh":"夏天花园里闻起来都是薰衣草的香味。"},{"en":"She put a small bag of dried lavender in the closet to keep clothes fresh.","zh":"她在衣柜里放了一小包干薰衣草，让衣服保持清香。"}]},{"partOfSpeech":"n.","definition":{"en":"a light purple color, like the flowers of the lavender plant","zh":"薰衣草色／淡紫色（像薰衣草花一样的浅紫色）"},"examples":[{"en":"He painted the bedroom a soft lavender.","zh":"他把卧室刷成了柔和的淡紫色。"},{"en":"She wore a lavender dress to the wedding.","zh":"她穿了一条淡紫色的裙子去参加婚礼。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a light purple color","zh":"淡紫色的；薰衣草色的"},"examples":[{"en":"The sky turned lavender at sunset.","zh":"日落时天空变成了淡紫色。"}]}],"synonyms":["lavender plant","light purple","pale purple","lilac (color)"],"phonetic":"/ˈlævəndər/","extraExplanation":["“Lavender”既指植物，也常用来指一种“淡紫色”。在英语里，颜色词有时既可作名词（a soft lavender），也可作形容词（lavender curtains）。","薰衣草在西方文化中常与“洁净、放松、温柔的香气”联系在一起，因此你会常看到它出现在肥皂、香薰、床上喷雾等产品描述中。","词源来自拉丁语 lavare（“洗”），因为过去人们会把薰衣草加入洗浴或洗衣用水中增香。"]}
{"word":"lavender-blue","summary":{"en":"a soft pastel shade between light purple and light blue","zh":"介于淡紫与浅蓝之间的柔和粉彩色调"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a pale purple color mixed with light blue; a soft, cool, pastel shade between lavender and blue.","zh":"带有淡紫与浅蓝混合的颜色；介于薰衣草紫与浅蓝之间的柔和粉彩色调。"},"examples":[{"en":"She wore a lavender-blue dress to the spring party.","zh":"她在春日聚会上穿了一件薰衣草蓝的连衣裙。"},{"en":"We painted the nursery walls lavender-blue to make the room feel calm.","zh":"我们把婴儿房的墙刷成薰衣草蓝，让房间感觉更安静。"},{"en":"At sunset, the sky turned a gentle lavender-blue.","zh":"日落时，天空变成了柔和的薰衣草蓝。"}]},{"partOfSpeech":"n.","definition":{"en":"A lavender-blue color; this particular shade as a color name.","zh":"薰衣草蓝（这种颜色）；作为颜色名称使用。"},"examples":[{"en":"Lavender-blue is popular in modern bedroom designs.","zh":"薰衣草蓝在现代卧室设计中很受欢迎。"},{"en":"Try lavender-blue with white for a clean, airy look.","zh":"试试薰衣草蓝配白色，会显得干净又通透。"}]}],"synonyms":["periwinkle","lavender","light blue","pastel blue","blue-violet"],"phonetic":"/ˈlævəndɚ bluː/","etymology":"由“lavender（薰衣草色/淡紫）+ blue（蓝色）”组合而成的复合颜色词，用连字符表示两种色调的混合或过渡。","mnemonic":["把它想成“薰衣草的紫 + 天空的蓝”混在一起：既有紫的柔和，也有蓝的清冷。","记连字符“-”：表示“两种颜色合体”，不是纯lavender也不是纯blue。"]}
{"word":"lavender-colored","summary":{"en":"pale purple; lavender in color","zh":"淡紫色的；薰衣草紫的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a pale purple (lavender) color.","zh":"呈淡紫色（薰衣草紫）的；淡紫色的。"},"examples":[{"en":"She wore a lavender-colored dress to the spring party.","zh":"她穿了一件淡紫色的连衣裙去参加春季派对。"},{"en":"The room looks calmer with lavender-colored walls.","zh":"淡紫色的墙让房间看起来更宁静。"},{"en":"He bought lavender-colored stationery for his notes.","zh":"他买了淡紫色的文具来记笔记。"}]}],"synonyms":["lavender","pale purple","light purple","lilac","mauve"],"phonetic":"/ˈlævəndɚ ˌkʌlɚd/","extraExplanation":["lavender 作为颜色在英语里常带有“柔和、清新、浪漫、安静”的感觉；在设计与时尚语境中很常见。","“-colored”常用于把名词变成形容词：例如 blue-colored（蓝色的）、skin-colored（肤色的）、rose-colored（玫瑰色的）。写作中也常直接说 “lavender” 作形容词：a lavender dress。"],"etymology":"来自“lavender（薰衣草）+ -colored（……颜色的）”。lavender 原本指一种芳香植物，后来也用来指它典型的浅紫色。","mnemonic":["把它拆开记：lavender（薰衣草=淡紫）+ colored（有……颜色的）→“薰衣草颜色的”。","联想“薰衣草花田”的画面：一大片淡紫色，就能快速对应这个颜色。"]}
{"word":"lavender-hued","summary":{"en":"light lavender-purple colored","zh":"淡薰衣草紫色的；带淡紫色调的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a pale purple color similar to lavender (often used to describe light, soft purple shades).","zh":"呈薰衣草般的淡紫色（常形容柔和、偏浅的紫色调）。"},"examples":[{"en":"She wore a lavender-hued dress to the spring wedding.","zh":"她在春季婚礼上穿了一件淡紫色的裙子。"},{"en":"The sky turned lavender-hued at dusk.","zh":"黄昏时天空变成了淡紫色。"},{"en":"The room felt calm with its lavender-hued walls.","zh":"淡紫色的墙面让房间显得很宁静。"}]}],"synonyms":["lavender-colored","lilac","mauve","purplish","violet-tinged","pale purple"],"phonetic":"/ˈlævəndɚ hjud/","extraExplanation":["写作里常用“X-hued”来让颜色描述更细腻、带画面感：如 rose-hued（玫瑰色调的）、golden-hued（金色调的）。","lavender 在英语里既指植物“薰衣草”，也常指一种“柔和的淡紫色”；因此 lavender-hued 往往暗示清淡、温柔、宁静的视觉氛围。"],"etymology":"由“lavender（薰衣草；淡紫色）+ hued（有……色调的）”构成。hued 源自 hue（色调），常与颜色词连用，组成复合形容词来描述色彩。","mnemonic":["记成“lavender（薰衣草=淡紫）+ hued（有……色调）”，合起来就是“带薰衣草那种淡紫色调的”。","联想“薰衣草精油给人放松感”，lavender-hued 常带“柔和、安静”的画面。"]}
{"word":"lavender-scented","summary":{"en":"Smelling like lavender.","zh":"闻起来有薰衣草香的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a smell like lavender (a light, sweet, floral scent).","zh":"带有薰衣草香味的（清淡、甜柔的花香）。"},"examples":[{"en":"She lit a lavender-scented candle to help her relax.","zh":"她点了一支薰衣草香的蜡烛来放松。"},{"en":"The hotel provided lavender-scented soap in the bathroom.","zh":"酒店在浴室里提供了薰衣草香的香皂。"},{"en":"His lavender-scented letter paper reminded her of summer fields.","zh":"他那带薰衣草香的信纸让她想起夏日的花田。"}]}],"synonyms":["lavender-fragranced","lavender-perfumed","lavender-aromatic"],"phonetic":"/ˈlævəndɚ ˌsɛntɪd/","extraExplanation":["常见搭配：lavender-scented candle/soap/oil/lotion/sachet（香包）。","这种“-scented”多用于产品描述、文学描写与广告文案，语气偏感官、温柔。","注意区别：lavender-colored（薰衣草色/淡紫色）说的是颜色，不是气味。"],"etymology":"英语复合形容词：lavender（薰衣草/薰衣草香）+ scented（有……气味的）。scented 来自 scent（气味），常用于“X-scented”结构，表示“带有X味道”。","mnemonic":["把它拆开记：lavender（薰衣草）+ scented（有香味的）＝“闻起来像薰衣草”。","联想“薰衣草=助眠放松”，看到 lavender-scented 就想到香薰、精油、枕头喷雾。"]}
{"word":"lavender-tinted","summary":{"en":"lightly purple in color; sometimes gently idealized in tone","zh":"带淡紫色调；也可指语气或回忆被温柔美化"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a light purple (“lavender”) color or a soft purple tint.","zh":"带淡紫色（薰衣草色）调的；呈浅紫色的。"},"examples":[{"en":"She wore a lavender-tinted scarf that matched her dress.","zh":"她戴了一条带淡紫色调的围巾，和裙子很搭。"},{"en":"The sky looked lavender-tinted at dusk.","zh":"黄昏时天空看起来带着淡紫色的光。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something (often a memory, mood, or story) that is gently idealized or made to seem more pleasant than it really was.","zh":"（多形容回忆、情绪或叙述）被温柔地美化的；带“粉饰”滤镜的。"},"examples":[{"en":"In his lavender-tinted memories, the old neighborhood felt safer than it actually was.","zh":"在他被美化的回忆里，老社区似乎比现实更安全。"},{"en":"The article gives a lavender-tinted view of the past, leaving out the hardships.","zh":"这篇文章用美化的视角看过去，忽略了艰难的一面。"}]}],"synonyms":["purplish","lilac","violet-tinged","tinted","tinged","rose-tinted","idealized","romanticized"],"phonetic":"/ˈlævəndɚ ˈtɪntɪd/","extraExplanation":["用法提示：常作定语（lavender-tinted light/sky/memories），也可作表语（The scene was lavender-tinted.）。","语义联想：和“rose-tinted（玫瑰色的；过于乐观美化的）”相近，但“lavender-tinted”在文学或描写中更偏“柔和、梦幻、朦胧”的气氛。"],"etymology":"由“lavender（薰衣草；淡紫色）+ tinted（染上……色调的）”构成的复合形容词；字面义是“带薰衣草色调的”，也可引申为“带温柔滤镜、稍加美化的”。","mnemonic":["把它拆开记：lavender=淡紫色；tinted=带色调→“带淡紫滤镜”。","联想手机滤镜：照片加“lavender tint”会更梦幻→也能联想到“回忆被加滤镜而更美”。"]}
{"word":"lavendered","summary":{"en":"“Lavendered” means lavender-colored, or sometimes lightly scented with lavender.","zh":"“lavendered”指“带淡紫色调的”，有时也指“带薰衣草香味的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a lavender color; tinted or shaded with a pale purple (lavender) tone.","zh":"带薰衣草紫色的；呈淡紫色调的；染上淡紫色的。"},"examples":[{"en":"She wore a lavendered scarf that looked soft in the evening light.","zh":"她戴着一条带淡紫色调的围巾，在暮色里显得很柔和。"},{"en":"The sky turned lavendered at dusk.","zh":"黄昏时天空变成了淡紫色。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lightly scented or treated with lavender (usually describing fabric, paper, or a room).","zh":"带有薰衣草香味的；用薰衣草处理过的（常形容布料、纸张或房间）。"},"examples":[{"en":"He kept his letters in a lavendered drawer.","zh":"他把信放在一个带薰衣草香味的抽屉里。"},{"en":"The hotel room felt clean and lavendered, like fresh linen.","zh":"酒店房间闻起来干净又带薰衣草香，像新洗的床单。"}]}],"synonyms":["lavender-colored","lavender-tinted","pale purple","mauve (approx.)","violet-tinged"],"phonetic":"/ˈlævəndɚd/","extraExplanation":["“lavendered”多用于文学或描写性语境，用来营造柔和、梦幻、宁静的画面（如“lavendered sky/fields/light”）。日常对话里更常说“lavender-colored / lavender-tinted / pale purple”。","词形上，“lavendered”相当于“lavender + -ed”，表示“被染上/带有……特征”的形容词用法，类似“silvered（泛银光的）”“rose-tinted（玫瑰色的）”。"]}
{"word":"lavendering","summary":{"en":"“Lavendering” means making something smell like lavender (often clothes/linens) or making it a pale lavender-purple color.","zh":"“lavendering”指给物品（常为衣物、床品）增添薰衣草香味，或把它呈现为淡淡的薰衣草紫色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of adding a lavender scent to something (especially clothes or linens), or making something smell like lavender","zh":"给某物（尤指衣物、床品）添加薰衣草香味；使其带有薰衣草香"},"examples":[{"en":"She spent the afternoon lavendering the sheets before guests arrived.","zh":"客人到来前，她花了一下午给床单熏上薰衣草香。"},{"en":"Lavendering your closet can help keep it smelling fresh.","zh":"给衣橱做薰衣草香处理能让它闻起来更清新。"}]},{"partOfSpeech":"v.","definition":{"en":"making something a pale purple color like lavender; tinting with a lavender shade","zh":"把某物染成/调成薰衣草般的浅紫色；加上薰衣草色调"},"examples":[{"en":"The sunset was lavendering the clouds along the horizon.","zh":"日落把地平线附近的云染成了淡紫色。"},{"en":"They are lavendering the room with soft purple lighting.","zh":"他们用柔和的紫色灯光给房间营造淡紫色调。"}]}],"synonyms":["scenting","perfuming","freshening","tinting","purpling"],"phonetic":"/ˈlævəndərɪŋ/","extraExplanation":["“lavendering”多见于较文学化或描写性的用法，来源于“lavender（薰衣草）”既指植物与香味，也常联想到把衣物放入薰衣草香包/精油中以除味、驱虫的生活习惯。现代英语里更常说“scenting with lavender / adding lavender scent / lavender-scented”。"]}
{"word":"lavenders","summary":{"en":"“Lavenders” usually means lavender plants/flowers (plural), and it can also refer to light purple shades.","zh":"“Lavenders”通常指（复数）薰衣草植物/花朵，也可指淡紫色系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Lavender plants or their purple flowers, often known for a sweet, calming scent.","zh":"（复数）薰衣草植物或其紫色花朵，常以清新、舒缓的香味闻名。"},"examples":[{"en":"The garden is full of lavenders in summer.","zh":"夏天花园里开满了薰衣草。"},{"en":"She dried the lavenders and put them in small bags for the closet.","zh":"她把薰衣草晾干，装进小袋子里放在衣柜里。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Shades of light purple, especially the soft purple color associated with lavender flowers.","zh":"（复数）淡紫色调；尤指像薰衣草花那样柔和的紫色。"},"examples":[{"en":"The room was decorated in soft lavenders and whites.","zh":"房间用柔和的淡紫色和白色来装饰。"},{"en":"She chose lavenders for the bridesmaids’ dresses.","zh":"她为伴娘礼服选了淡紫色系。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, plural form) To scent, perfume, or tint something with lavender.","zh":"（罕见，复数形式）用薰衣草给某物增香；或把某物染成淡紫色。"},"examples":[{"en":"They lavenders the linens with a light herbal fragrance.","zh":"他们用淡淡的草本香给床单增香。"}]}],"synonyms":["lavender flowers","lavender plants","light purple","pale purple","lilac (color)"],"phonetic":"/ˈlævəndɚz/","extraExplanation":["“Lavender”在英语文化中常和“平静、放松、干净的香气”联系在一起，因此常见于香包（sachet）、精油（essential oil）、肥皂等日用品表达。","常见搭配：lavender fields（薰衣草花田）、lavender scent（薰衣草香）、lavender oil（薰衣草精油）。法国普罗旺斯（Provence）的薰衣草田在英语语境里也很有代表性。"]}
{"word":"lavenite","summary":{"en":"Lavenite is a rare silicate mineral, mainly mentioned in geology and mineral-collecting contexts.","zh":"Lavenite 是一种罕见的硅酸盐矿物，主要出现在地质学与矿物收藏相关语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a sodium–calcium silicate) usually found in small crystals, often brownish to reddish-brown, occurring in some alkaline igneous rocks.","zh":"一种较罕见的矿物（含钠、钙的硅酸盐矿物），常以小晶体出现，颜色多为棕色到红棕色，常见于某些碱性火成岩中。"},"examples":[{"en":"Lavenite is mostly of interest to mineral collectors rather than industry.","zh":"Lavenite 主要对矿物收藏者有吸引力，而非工业用途。"},{"en":"The specimen label listed lavenite among several rare silicate minerals.","zh":"标本标签把 lavenite 列在几种罕见的硅酸盐矿物之中。"}]}],"synonyms":["(no common everyday synonyms; it’s a specific mineral name)"],"phonetic":"/ˈlævənaɪt/","extraExplanation":["“lavenite”属于矿物学用词，日常英语中几乎不出现，多见于矿物目录、博物馆说明牌、论文或收藏交流。","词名来源与地名/产地有关：Låven（挪威的一处地点/地区名）曾与该矿物的早期发现或研究相关，因此得名。","读音上常见的学习点是词尾 -ite（常用于矿物名，表示“……矿物”），例如 calcite（方解石）、malachite（孔雀石）。"]}
{"word":"laver","summary":{"en":"Laver is usually an edible seaweed used in cooking, especially in British (notably Welsh) food; rarely, it can mean a washer.","zh":"laver通常指可食用的紫菜/海藻（英式语境尤与威尔士饮食相关）；较少见时也可指洗涤者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of edible seaweed (a red algae) used in food, often eaten cooked or dried","zh":"（可食用的）紫菜；一种红藻类海藻，常煮熟或晒干食用"},"examples":[{"en":"In Wales, people sometimes cook laver and serve it with breakfast.","zh":"在威尔士，人们有时会把紫菜煮熟，作为早餐的一部分来吃。"},{"en":"The soup is topped with laver for a light ocean flavor.","zh":"这道汤上面撒了些紫菜，带一点海洋的清香。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person or thing that washes; someone who lavers (washes)","zh":"（罕见）清洗的人；洗涤者"},"examples":[{"en":"The old text mentions a laver who cleaned the clothes by the river.","zh":"那篇旧文提到一位在河边洗衣的洗涤者。"}]}],"synonyms":["seaweed","edible seaweed","nori (similar seaweed used in Japanese food)"],"phonetic":"/ˈleɪvər/","extraExplanation":["“laver”指海藻时，在英式语境里常与威尔士饮食文化相关：有名的菜叫“laverbread”（并不是面包，而是把laver煮成糊状/泥状的食品）。","不要和“lavatory（厕所）”或“lava（熔岩）”混淆；它们拼写相近但意义无关。"]}
{"word":"laverania","summary":{"en":"Laverania is a scientific name for a subgroup of Plasmodium malaria parasites, including Plasmodium falciparum.","zh":"Laverania 是疟原虫属中的一个亚属名称，包含恶性疟原虫等疟疾寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subgenus (taxonomic group) of malaria parasites in the genus Plasmodium, including species that infect humans and other great apes (notably Plasmodium falciparum).","zh":"（分类学）疟原虫属（Plasmodium）中的一个亚属，包含感染人类及其他类人猿的疟原虫物种（尤其包括恶性疟原虫 Plasmodium falciparum）。"},"examples":[{"en":"Plasmodium falciparum belongs to the subgenus Laverania.","zh":"恶性疟原虫（Plasmodium falciparum）属于 Laverania 这个亚属。"},{"en":"Researchers compared Laverania parasites from humans and gorillas to study malaria’s evolution.","zh":"研究人员比较来自人类和大猩猩的 Laverania 寄生虫，以研究疟疾的演化。"}]}],"synonyms":["(no common synonyms; sometimes written as a taxonomic label: subgenus Laverania)"],"phonetic":"/ˌlævəˈreɪniə/","extraExplanation":["“Laverania”常出现在生物医学与寄生虫学论文中，属于严格的分类学术语，日常英语里很少使用。","该亚属因与人类最严重的疟疾类型（由恶性疟原虫引起）关系密切而受到关注；许多研究用它来讨论人类疟疾与非人灵长类宿主之间的亲缘关系与跨宿主传播。"]}
{"word":"laveroc","summary":{"en":"“Laveroc” is a Scottish word meaning “lark” (especially a skylark).","zh":"“laveroc”是苏格兰用语，意思是“云雀/百灵鸟”（尤指云雀）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish dialect) A lark, especially a skylark (a small songbird known for singing high in the sky).","zh":"（苏格兰方言）云雀；泛指“百灵鸟”（一种以高空鸣唱著称的小鸣禽）。"},"examples":[{"en":"In Scots songs, the laveroc often symbolizes morning and hope.","zh":"在苏格兰民歌里，“laveroc（云雀）”常常象征清晨与希望。"},{"en":"We heard the laveroc singing above the fields at dawn.","zh":"黎明时分，我们听见田野上空有云雀在歌唱。"}]}],"synonyms":["lark","skylark","songbird"],"phonetic":"/ˈlævərɑk/","extraExplanation":["“laveroc”更常见的拼写是“laverock”，属于苏格兰英语/苏格兰语（Scots）用词，现代日常英语里较少见，但在诗歌、民谣、地方文化里很常见。","在英国文学与苏格兰传统中，云雀常被写作“清晨来临、自由、自然之声”的意象；读到“laveroc/laverock”时，多半是在这种诗意语境里。"]}
{"word":"laverock","summary":{"en":"“Laverock” is a Scottish word meaning “skylark.”","zh":"“laverock”是苏格兰用语，意思是“云雀（skylark）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a skylark (a small songbird), especially in Scottish English/Scots; often used in poetry and traditional songs","zh":"云雀（小型鸣禽）；尤指苏格兰英语/苏格兰语中的说法，常见于诗歌与民谣"},"examples":[{"en":"In Scots poems, the laverock often symbolizes morning and freedom.","zh":"在苏格兰诗歌里，“laverock（云雀）”常象征清晨与自由。"},{"en":"We heard a laverock singing high above the field.","zh":"我们听见一只云雀在田野上空高声歌唱。"},{"en":"The old song mentions the laverock at daybreak.","zh":"那首古老的歌谣提到黎明时的云雀。"}]}],"synonyms":["skylark","lark"],"phonetic":"/ˈlævərɑk/","extraExplanation":["“laverock”是苏格兰地区常用词，对应标准英语的“skylark”。在英国文学里它常带有田园、清晨、歌唱与希望的意象。","你可能在罗伯特·彭斯（Robert Burns）等苏格兰诗人的作品或传统民谣中见到这个词。"]}
{"word":"laverocks","summary":{"en":"“Laverocks” is a Scots word meaning “larks” (songbirds).","zh":"“laverocks”是苏格兰英语中“larks（云雀）”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lark (a small songbird), especially in Scots English; plural of “laverock.”","zh":"云雀（一种会鸣唱的小鸟）；尤用于苏格兰英语中；“laverock”的复数。"},"examples":[{"en":"In Scots poems, “laverocks” often sing over fields in spring.","zh":"在苏格兰诗歌里，“laverocks（云雀）”常常在春天的田野上空歌唱。"},{"en":"We heard the laverocks early in the morning, high above the grass.","zh":"清晨我们听见云雀（laverocks）在草地上空高声鸣唱。"}]}],"synonyms":["larks","sky larks"],"phonetic":"/ˈlævərɑk/","extraExplanation":["“laverock”是苏格兰英语/苏格兰方言（Scots）里对“lark（云雀）”的称呼，带有浓厚的地域与文学色彩。它常出现在描写乡野、春天、清晨与自由意象的诗歌中。","在文学里，你可能会在罗伯特·彭斯（Robert Burns）等苏格兰诗人的作品中见到“laverock/laverocks”这一写法，用来营造苏格兰乡土氛围。"]}
{"word":"lavers","summary":{"en":"“Lavers” most often means edible seaweed (plural of “laver”), especially in Welsh/UK food contexts; less commonly it can mean a laundry washer in older usage.","zh":"“lavers”最常指可食用海藻（“laver”的复数），多见于威尔士/英国饮食语境；较少情况下在旧用法中也可指洗衣工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) a type of edible seaweed, especially one used as food in Wales and parts of the UK (often made into “laverbread”).","zh":"（常用复数）一种可食用的海藻，尤指英国威尔士等地用来食用的紫菜类海藻（常做成“laverbread/海藻泥饼”）。"},"examples":[{"en":"Lavers are harvested from rocks along the coast and cooked into a dark paste.","zh":"人们会在海岸的岩石上采收海藻（lavers），再煮成深色的糊状物。"},{"en":"I tried a traditional Welsh breakfast with laverbread made from lavers.","zh":"我尝了传统的威尔士早餐，其中有用海藻（lavers）做的 laverbread。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, often historical) a person who washes clothes; a washer.","zh":"（较少用，多见于历史语境）洗衣人；洗衣工。"},"examples":[{"en":"In older texts, a “laver” could mean someone who washed laundry for others.","zh":"在较旧的文字中，“laver”可以指替人洗衣的人。"}]}],"synonyms":["seaweed","nori (related)","edible seaweed"],"phonetic":"/ˈleɪvər/","extraExplanation":["“lavers”常被当作“laver”的复数来用，尤其在谈到可食用海藻时更常见。英国威尔士的“laverbread”并不是面包，而是把海藻慢煮后做成的糊，常与燕麦拌成小饼煎着吃。","如果你是在名字/姓氏里看到“Lavers”，它也可能是姓氏（与词义无关，需看具体语境）。"]}
{"word":"laverwort","summary":{"en":"Liverwort: a tiny non-flowering plant that grows in damp places, often forming flat green mats.","zh":"地钱：一种在潮湿处生长的小型不开花植物，常形成扁平的绿色铺垫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, non-flowering plant (a bryophyte) that usually grows in damp places; liverworts often form flat green mats on soil, rocks, or tree bark","zh":"地钱（苔藓植物的一类）：一种体型很小、不开花、常生长在潮湿环境中的植物；常在土壤、岩石或树皮上形成扁平的绿色铺垫"},"examples":[{"en":"Liverworts often appear as a thin green layer on wet rocks near streams.","zh":"在溪流附近潮湿的岩石上，地钱常常看起来像一层薄薄的绿色覆盖物。"},{"en":"Because the forest floor stays moist, you can find mosses and liverworts there year-round.","zh":"因为林地地面常年潮湿，你一年四季都能在那里找到苔藓和地钱。"}]}],"synonyms":["hepatic (botany)","Marchantia (a common genus)"],"phonetic":"/ˈlɪvərˌwɝt/","extraExplanation":["“laverwort”在现代英语中非常少见，常被视为“liverwort”的误拼或罕见变体；标准拼写通常是 liverwort。","词源上 liver + wort（古英语中指“植物/草药”），“liver（肝）”来自早期人们觉得某些地钱叶状体的形状像肝脏（“形似治病”的传统观念）。","地钱属于苔藓植物（bryophytes），没有真正的根、茎、叶，也不产生种子；它们通过孢子繁殖，常见于阴湿环境。"]}
{"word":"laves","summary":{"en":"“Laves” usually means “washes/bathes” as the third-person singular of the literary verb “lave,” especially used for waves or water washing over something; it can also be a surname.","zh":"“laves”通常是文学动词“lave”的第三人称单数，表示（水、海浪）冲刷、洗涤；也可作姓氏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of water) to wash over or bathe something; to cleanse by washing (literary/poetic).","zh":"（多为文学/诗歌用法）水拍打、冲刷；洗浴、洗涤。"},"examples":[{"en":"Waves laves the rocks along the shore.","zh":"海浪拍打着岸边的岩石。"},{"en":"The river laves the roots of the old trees.","zh":"河水冲刷着老树的根部。"},{"en":"She laved her tired feet in cool water.","zh":"她把疲惫的脚泡在凉水里。"}]},{"partOfSpeech":"other","definition":{"en":"Third-person singular present of “lave.”","zh":"“lave”的第三人称单数现在时：laves。"},"examples":[{"en":"At high tide, the sea laves the steps of the pier.","zh":"涨潮时，海水冲刷着码头的台阶。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname): Laves.","zh":"姓氏：Laves。"},"examples":[{"en":"Ms. Laves will lead the meeting today.","zh":"Laves 女士今天将主持会议。"}]}],"synonyms":["wash","bathe","cleanse","lap (at)"],"phonetic":"/leɪvz/","extraExplanation":["“lave”在现代英语里比较少见，常见于诗歌、文学或较正式的描写中，用来营造“水轻柔或反复拍打”的画面感。日常表达更常用 wash / bathe / lap (at)。","注意拼写与发音：laves /leɪvz/（来自 lave）容易和 leaves /livz/（leaf 的复数，或 leave 的第三人称单数）混淆。若你原本想查“leaves”，可以告诉我语境我再帮你确认。"]}
{"word":"lavette","summary":{"en":"Lavette most commonly means a small cleaning/wiping cloth; it can also be a personal name.","zh":"Lavette 最常见的意思是清洁用的小抹布；也可作人名/姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cloth used for washing or wiping surfaces (similar to a dishcloth or cleaning cloth)","zh":"（用来清洗或擦拭的）小抹布；清洁布（类似洗碗布/抹布）"},"examples":[{"en":"Could you pass me a lavette to wipe the counter?","zh":"你能递给我一块抹布擦一下台面吗？"},{"en":"She rinsed the lavette and hung it up to dry.","zh":"她把抹布冲洗干净，然后挂起来晾干。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or given name (less common in everyday English)","zh":"（较少见）人名或姓氏：Lavette"},"examples":[{"en":"Lavette Johnson will speak at the meeting.","zh":"Lavette Johnson 会在会上发言。"}]}],"synonyms":["dishcloth","cleaning cloth","washcloth","rag"],"phonetic":"/ləˈvɛt/","extraExplanation":["“Lavette”常见于法语语境（尤其在加拿大法语或某些英语地区的借词用法）中，指厨房或清洁用的小布。英式/美式英语里更常说 dishcloth、cleaning cloth、washcloth（洗脸/洗澡用）。"]}
{"word":"lavialite","summary":{"en":"“Vitality” means energy, liveliness, or the power to keep living and growing.","zh":"“Vitality” 表示活力、生命力，或持续生存与发展的能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(likely intended: “vitality”) energy, strength, and a feeling of being alive and active.","zh":"（可能想写的是 vitality）活力；精力；充满生命力的状态。"},"examples":[{"en":"After a good night’s sleep, she felt full of vitality.","zh":"睡了个好觉之后，她感觉精力充沛。"},{"en":"The city’s markets add vitality to the neighborhood.","zh":"这座城市的集市为社区增添了活力。"}]},{"partOfSpeech":"n.","definition":{"en":"the ability of a person, animal, or organization to continue to live, grow, or succeed.","zh":"生存力；生命力；（人/动物/组织）持续发展或成功的能力。"},"examples":[{"en":"Regular exercise can improve your vitality as you age.","zh":"随着年龄增长，规律运动能提升你的生命力。"},{"en":"New ideas gave the small business vitality.","zh":"新点子让这家小企业重获生机。"}]},{"partOfSpeech":"n.","definition":{"en":"liveliness in style, expression, or performance.","zh":"（表达/风格/表演的）生动、有感染力。"},"examples":[{"en":"She spoke with vitality and confidence.","zh":"她讲话生动而自信。"}]}],"synonyms":["energy","vigor","liveliness","life","spirit"],"phonetic":"/vaɪˈtælɪti/","extraExplanation":["“lavialite” 不是常见英文单词，看起来像把法语“la vitalité”（意为“活力/生命力”）连写或拼错了。英文对应词通常是 vitality。","vitality 常用于积极语境：形容人精力旺盛、地方/作品“有生气”、或组织“有发展势头”。"]}
{"word":"lavic","summary":{"en":"“lavic” is a rare adjective meaning “related to lava,” and it’s often a misspelling of “Slavic.”","zh":"“lavic”是一个罕用形容词，意为“与熔岩有关的”；也常是把“Slavic（斯拉夫的）”拼错。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Related to lava; made of lava or formed by volcanic lava.","zh":"（罕用）与熔岩有关的；由熔岩构成的；由熔岩形成的。"},"examples":[{"en":"The island has lavic rocks formed by ancient eruptions.","zh":"这座岛有由古老喷发形成的熔岩岩石。"},{"en":"Scientists studied the lavic flow to understand the volcano’s history.","zh":"科学家研究熔岩流，以了解火山的历史。"}]},{"partOfSpeech":"other","definition":{"en":"A very uncommon word; often a misspelling of “Slavic” (relating to Slavs, Slavic languages/cultures).","zh":"一个非常少见的词；常见于把“Slavic”（斯拉夫人的/斯拉夫语系与文化的）拼错。"},"examples":[{"en":"Did you mean Slavic music or Slavic languages?","zh":"你想说的是斯拉夫音乐还是斯拉夫语言？"},{"en":"Many people type “lavic” by mistake when they mean “Slavic.”","zh":"很多人想写“Slavic”时会误打成“lavic”。"}]}],"synonyms":["volcanic","lava-related","igneous (context-dependent)"],"phonetic":"/ˈlævɪk/","extraExplanation":["“lavic”作为“熔岩的”这个形容词在现代英语里非常不常用，更常见的表达是“volcanic（火山的）”“lava（熔岩）+名词”（如 lava rock / lava flow）。","如果你想表达“斯拉夫的”，正确拼写是“Slavic”，常见搭配有：Slavic languages（斯拉夫语系）、Slavic culture（斯拉夫文化）、Slavic folklore（斯拉夫民间传说）。"]}
{"word":"laving","summary":{"en":"“Laving” is the -ing form of “lave,” meaning washing/bathing, or (poetically) waves gently washing a shore.","zh":"“laving”是“lave”的-ing形式，意为“清洗/沐浴”，也可（诗意地）指海浪轻拍海岸。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"washing or bathing something; also (poetic) waves gently washing against a shore.","zh":"清洗、沐浴（某物）；（诗意用法）海浪轻拍、冲刷海岸。"},"examples":[{"en":"She was laving her face with cool water after the long walk.","zh":"长时间步行后，她用凉水洗了洗脸。"},{"en":"We sat quietly, listening to the waves laving the rocks.","zh":"我们安静地坐着，听海浪轻拍岩石。"}]}],"synonyms":["washing","bathing","rinsing","splashing","lapping"],"phonetic":"/ˈleɪvɪŋ/","extraExplanation":["“laving”来自动词“lave”，意思是“洗、沐浴；（波浪）轻拍”。在现代英语里多见于文学/诗歌描写海浪，比如“waves laving the shore”。","很多学习者会把“laving”误当作“leaving”（离开）的拼写变体；日常写作中如果你想表达“离开”，通常应写“leaving”。"]}
{"word":"lavinia","summary":{"en":"Lavinia is mainly used as a female first name, and it can also refer to a figure from Roman legend or a character in Shakespeare.","zh":"Lavinia 主要作为女性名字使用，也可指罗马传说人物或莎士比亚作品中的角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a woman’s first name).","zh":"女子名字（女性的名字）。"},"examples":[{"en":"Lavinia is starting a new job in Chicago next week.","zh":"Lavinia 下周将在芝加哥开始一份新工作。"},{"en":"We named our daughter Lavinia because we liked how it sounds.","zh":"我们给女儿取名 Lavinia，因为我们喜欢它的发音。"}]},{"partOfSpeech":"n.","definition":{"en":"in Roman myth and legend, the daughter of King Latinus and the wife of Aeneas; a figure linked to the founding stories of Rome.","zh":"（罗马神话与传说）拉维尼娅：拉丁努斯国王之女、埃涅阿斯之妻；与罗马建城传说相关的人物。"},"examples":[{"en":"In some versions of the story, Lavinia marries Aeneas and becomes an ancestor figure in Roman legend.","zh":"在一些版本的故事中，拉维尼娅嫁给埃涅阿斯，成为罗马传说中的祖先人物之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a character in Shakespeare’s tragedy *Titus Andronicus*, Titus’s daughter.","zh":"（莎士比亚悲剧《泰特斯·安德洛尼克斯》）拉维尼娅：泰特斯的女儿。"},"examples":[{"en":"Lavinia is one of the most tragic figures in *Titus Andronicus*.","zh":"拉维尼娅是《泰特斯·安德洛尼克斯》中最悲惨的人物之一。"}]}],"phonetic":"/ləˈvɪniə/","extraExplanation":["“Lavinia”常被认为来自拉丁语传统，和古罗马叙事（尤其是维吉尔《埃涅阿斯纪》相关的传说体系）有文化联想，因此在英语世界里会带一点“古典、文学”的气质。","在现代英语使用中，它最常见的功能就是人名；遇到文学或古典历史语境时，才更可能指向神话人物或莎士比亚角色。"]}
{"word":"lavish","summary":{"en":"Lavish means ‘luxurious or very generous,’ and it can also mean ‘to give or spend in large amounts.’","zh":"lavish 指“奢华的/非常丰盛的”或“非常慷慨的”，也可作动词表示“大量给予或花费”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very rich, impressive, or expensive; giving or using a lot more than usual.","zh":"奢华的；极其丰富的；（给予/使用）很大方的、过多的。"},"examples":[{"en":"They held a lavish wedding at a five-star hotel.","zh":"他们在五星级酒店举办了一场奢华的婚礼。"},{"en":"The museum is famous for its lavish decorations.","zh":"这家博物馆以其华丽的装饰而闻名。"},{"en":"She was lavish with praise after the performance.","zh":"演出结束后，她毫不吝啬地称赞大家。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give or spend something generously, often in large amounts.","zh":"大量慷慨地给予；挥霍（钱、精力等）。"},"examples":[{"en":"The company lavished gifts on its top clients.","zh":"公司给重要客户送了大量礼物。"},{"en":"He lavished attention on the new puppy.","zh":"他把很多关注都给了那只新小狗。"}]}],"synonyms":["luxurious","sumptuous","extravagant","generous","unsparing"],"phonetic":"/ˈlævɪʃ/","extraExplanation":["词源提示：lavish 来自较早的含义“倾倒、流出”（有“像水一样倒出来”的感觉），所以既可以形容“东西很多、很丰盛”，也可以表示“把某物大量给出去”。","常见搭配：lavish praise/attention/care（大量称赞/关注/照顾）；a lavish party/meal/lifestyle（奢华的派对/大餐/生活方式）。","语感区分：lavish 通常强调“数量多＋很慷慨/很豪华”。如果强调“浪费、挥霍”，英语里也常用 wasteful、extravagant。"]}
{"word":"lavished","summary":{"en":"“Lavished” means “gave very generously” (often love, attention, praise, money, or gifts).","zh":"“lavished”意为“慷慨地大量给予/倾注”，常用于爱、关注、赞美、金钱或礼物等。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone a lot of something (such as love, attention, praise, money, or gifts), often more than usual","zh":"（在爱、关注、赞美、金钱或礼物等方面）大量给予，慷慨倾注（常指比平时更多）"},"examples":[{"en":"She lavished praise on her team after the project succeeded.","zh":"项目成功后，她对团队大加赞美。"},{"en":"The grandparents lavished attention on the new baby.","zh":"祖父母把大量的关爱都倾注在新生儿身上。"},{"en":"He lavished money on luxury cars and designer clothes.","zh":"他把钱大把花在豪车和名牌衣服上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover or provide something in a very generous amount","zh":"大量地给予或覆盖；充裕地提供"},"examples":[{"en":"The garden was lavished with spring sunlight.","zh":"花园沐浴在充沛的春日阳光中。"},{"en":"The chef lavished the dish with fresh herbs.","zh":"厨师在菜肴上撒了大量新鲜香草。"}]}],"synonyms":["showered","bestowed","gave generously","poured on"],"phonetic":"/ˈlævɪʃt/","extraExplanation":["“lavished”是动词“lavish”的过去式/过去分词。常见搭配有：lavish praise/attention/love on someone（对某人倾注赞美/关注/爱）；lavish something on someone（把某物慷慨给予某人）。","语气上，“lavish”常带“非常多、很慷慨”的正面含义，但在语境中也可能暗示“过度、铺张”。例如：lavish spending 可能暗示挥霍。"]}
{"word":"lavisher","summary":{"en":"A “lavisher” is someone who gives or spends very freely, sometimes to the point of waste.","zh":"“lavisher”指给/花得很多的人，既可褒义（慷慨给出），也可贬义（挥霍浪费）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who gives or spends very freely (especially money, praise, or attention); someone who lavishes things on others","zh":"挥霍者；慷慨给予者（尤指金钱、赞美或关注等给得很多的人）"},"examples":[{"en":"He was a lavisher of praise, always telling new employees they were doing well.","zh":"他很会“给夸奖”，总是称赞新员工做得很好。"},{"en":"The charity’s founder was known as a lavisher of time and energy.","zh":"这家慈善机构的创办人以大量投入时间和精力而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who uses more than necessary; a waster","zh":"浪费者；挥霍无度的人"},"examples":[{"en":"In hard times, people criticized him as a lavisher of resources.","zh":"在艰难时期，人们批评他挥霍资源。"}]}],"synonyms":["big spender","generous giver","waster","spender"],"phonetic":"/ˈlævɪʃər/","extraExplanation":["“lavisher”来自动词“lavish”（大量给予/挥霍）。在现代英语里，“lavish”更常见作形容词（lavish praise＝大量的赞美；a lavish wedding＝奢华的婚礼）。表示“给得很多的人”时，也更常用更自然的说法如“a generous giver”或“a big spender”，所以“lavisher”相对少见、偏书面。"]}
{"word":"lavishers","summary":{"en":"“Lavishers” means people who give or spend a lot freely and generously.","zh":"“lavishers”指挥霍或慷慨给予、花费很多的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who give or spend freely and generously (often on someone or something).","zh":"挥霍者；慷慨赠予者（常指在某人或某事上花费或给予很多）。"},"examples":[{"en":"The charity thanked the lavishers who donated large sums every year.","zh":"慈善机构感谢那些每年捐出大笔款项的慷慨捐赠者。"},{"en":"Lavishers of praise can motivate a team, but the praise should still be sincere.","zh":"经常慷慨赞美的人能激励团队，但赞美仍应真诚。"}]}],"synonyms":["big spenders","generous givers","donors","benefactors"],"phonetic":"/ˈlævɪʃərz/","extraExplanation":["“lavishers”是名词复数，单数是“lavisher”（较少见）。更常见的表达是“people who lavish…”或直接用动词“lavish”（如：lavish money/praise on someone）。","lavish 来自中古法语 *lavasse*（大雨、倾泻）相关的词源意象，带有“像倾倒一样大量给/花”的感觉，因此常和 money（钱）、attention（关注）、praise（赞扬）、gifts（礼物）等搭配。"]}
{"word":"lavishes","summary":{"en":"“Lavishes” means gives or spends something very generously (sometimes too much), or showers someone with attention or affection.","zh":"“lavishes”表示非常慷慨地给予或花费（有时过度），也可指对某人倾注大量关注或爱意。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give or spend something in a very generous (sometimes excessive) way","zh":"慷慨地（有时甚至过度地）给予或花费某物"},"examples":[{"en":"He lavishes praise on his team after every win.","zh":"每次赢球后，他都会对队员大加称赞。"},{"en":"She lavishes time and attention on her kids.","zh":"她把大量时间和关爱都倾注在孩子身上。"},{"en":"The company lavishes money on marketing but ignores customer service.","zh":"公司在营销上大把砸钱，却忽视了客户服务。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide someone with a lot of attention, gifts, or affection","zh":"对某人倾注大量关注、礼物或爱意"},"examples":[{"en":"Grandparents often lavish gifts on their grandchildren.","zh":"祖父母常常对孙辈送很多礼物。"},{"en":"He lavishes affection on his rescue dog.","zh":"他对收养来的救助犬倾注很多爱。"}]}],"synonyms":["shower","heap","bestow","give generously","spend freely"],"phonetic":"/ˈlævɪʃɪz/","extraExplanation":["“lavishes”是动词“lavish”的第三人称单数（he/she/it lavishes）。常见搭配：lavish praise/attention/affection/care (on sb), lavish money/time (on sth)。","语气上通常表示“多到有点夸张/不吝啬”，可褒可贬：lavish praise 多为褒义；lavish money 可能暗含“花得太多”。","结构提示：lavish A on B（把A大量给到B），例如：lavish compliments on someone（对某人大肆夸奖）。"]}
{"word":"lavishest","summary":{"en":"“Lavishest” means “the most lavish”—the most extravagant/generous, or the most richly provided.","zh":"“lavishest”表示“最奢华/最慷慨的”或“最丰盛、最丰富的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of **lavish**) most generous or extravagant, especially in spending, giving, or praise.","zh":"（**lavish** 的最高级）最慷慨的；最奢华/最铺张的（尤指花钱、馈赠或赞美方面）。"},"examples":[{"en":"Of all the weddings I’ve attended, theirs was the **lavishest**.","zh":"在我参加过的所有婚礼中，他们那场是最奢华的。"},{"en":"She wrote the **lavishest** compliments in the thank-you note.","zh":"她在感谢信里写下了最热情、最夸张的赞美。"},{"en":"The charity’s **lavishest** donor gave millions every year.","zh":"那家慈善机构最慷慨的捐赠者每年都会捐出数百万。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Superlative of **lavish**) most abundant or richly provided; containing the most impressive amount of something.","zh":"（**lavish** 的最高级）最丰盛的；最充足的；提供最多、最丰富的。"},"examples":[{"en":"This restaurant serves the **lavishest** breakfast buffet in town.","zh":"这家餐厅提供的是城里最丰盛的早餐自助。"},{"en":"The guide recommended the **lavishest** tour package, with extra meals and shows.","zh":"导游推荐了最豪华（内容最丰富）的旅行套餐，包含额外餐食和演出。"}]}],"synonyms":["most lavish","most extravagant","most luxurious","most generous","most opulent","most sumptuous"],"phonetic":"ˈlævɪʃɪst","extraExplanation":["“lavishest”是形容词“lavish”的最高级形式，用来和两者以上进行比较。日常更常见的最高级也可以说“most lavish”。在正式写作里，两种都对；在口语中“most lavish”更常听到一些。"]}
{"word":"lavishing","summary":{"en":"“Lavishing” means giving or spending something very generously, often in large amounts.","zh":"“lavishing”指大量而慷慨地给予或花费（有时暗含过度/浪费）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving something (money, praise, attention, etc.) generously and in large amounts; often more than is necessary","zh":"大量而慷慨地给予（金钱、赞美、关注等）；常带有“给得过多”的意味"},"examples":[{"en":"She was lavishing praise on her team after the win.","zh":"赢了之后，她对团队不吝赞美。"},{"en":"He’s been lavishing attention on the new puppy.","zh":"他一直把很多注意力都放在那只新小狗身上。"},{"en":"They were accused of lavishing public money on unnecessary projects.","zh":"他们被指责把公款大量花在不必要的项目上。"}]},{"partOfSpeech":"v.","definition":{"en":"spending or using something freely (sometimes wastefully)","zh":"挥霍式地花费或使用（有时含“浪费”之意）"},"examples":[{"en":"The company is lavishing resources on marketing this year.","zh":"这家公司今年在市场推广上投入了大量资源。"},{"en":"Don’t go lavishing your savings on gadgets you don’t need.","zh":"别把积蓄挥霍在不需要的小玩意上。"}]}],"synonyms":["giving generously","showering (someone) with","bestowing","spending freely","pouring (money/effort) into"],"phonetic":"/ˈlævɪʃɪŋ/","extraExplanation":["“lavishing”常见于固定搭配：lavish praise/attention/care on sb（对某人大加称赞/给予关注/照顾）。语气通常是正面的“慷慨给予”，但在谈钱或资源时也可能带批评色彩（暗示过度或不必要）。","词形上，lavishing 是动词 lavish 的现在分词/动名词形式；写作中常用于进行时（is/are lavishing）或作状语（lavishing compliments, he…）。"]}
{"word":"lavishingly","summary":{"en":"“Lavishingly” means doing something very generously or in an abundant, sometimes extravagant way.","zh":"“lavishingly”表示“非常慷慨/大量地（有时带点奢侈或过度）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very generous or abundant way, especially when giving praise, attention, money, or care.","zh":"奢侈地；慷慨地；大量地（尤指在给予赞美、关注、金钱或照顾时）。"},"examples":[{"en":"She was lavishingly praised for her performance.","zh":"她的表演受到了铺天盖地的赞美。"},{"en":"The hotel is lavishingly decorated with gold and marble.","zh":"这家酒店用金色装饰和大理石进行了极尽奢华的装修。"},{"en":"He spent lavishingly on gifts during the holidays.","zh":"他在节日期间非常大方地花钱买礼物。"}]}],"synonyms":["generously","extravagantly","abundantly","profusely"],"phonetic":"/ˈlævɪʃɪŋli/","extraExplanation":["“lavishingly”来自动词“lavish”（挥霍；慷慨给予）+副词后缀“-ly”。常与 praise/attention/care/spend/decorate 等搭配，语气通常强调“给得很多、甚至有点过头”。","近义词区分：generously（慷慨，偏正面、自然）；extravagantly（奢侈地，偏“花得过度/不必要”）；profusely（大量地，常用于感谢/道歉/出汗等，如 “apologize profusely”）。"]}
{"word":"lavishly","summary":{"en":"“Lavishly” means in a very generous, abundant, or luxurious way, often involving lots of money, effort, praise, or detail.","zh":"“lavishly”表示以非常慷慨、充裕或奢华的方式（常涉及花钱、用心、赞美或细节很多）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is very generous or large in amount; often with a sense of luxury or richness.","zh":"奢华地；大量地；慷慨地（常带有豪华、丰富的感觉）。"},"examples":[{"en":"They decorated the hall lavishly for the wedding.","zh":"他们为婚礼把大厅装饰得十分奢华。"},{"en":"The company spent lavishly on advertising.","zh":"这家公司在广告上花了很多钱。"},{"en":"She praised her students lavishly for their hard work.","zh":"她对学生的努力给予了充分的赞扬。"}]},{"partOfSpeech":"adv.","definition":{"en":"With abundant detail (especially in writing or description).","zh":"（描写、写作）细致入微地；详尽地。"},"examples":[{"en":"The novelist described the city lavishly, page after page.","zh":"这位小说家用大量笔墨、细致地描写这座城市，一页又一页。"},{"en":"The report is lavishly illustrated with photos.","zh":"这份报告配有大量照片作为插图。"}]}],"synonyms":["generously","abundantly","extravagantly","sumptuously"],"phonetic":"/ˈlævɪʃli/","extraExplanation":["“lavishly”来自形容词“lavish”，常用来形容花钱、用料、赞美或装饰“很大方/很奢华”。它既可以是褒义（慷慨、用心），也可能带一点贬义（过度铺张），需要看语境。","常见搭配：spend lavishly（大手大脚地花钱）、decorate lavishly（奢华装饰）、praise lavishly（高度赞扬）、lavishly illustrated（配大量插图）。"]}
{"word":"lavishment","summary":{"en":"Lavishment means generous giving or spending (lavishness), and less commonly an abundant amount of something given.","zh":"Lavishment 指慷慨给予或铺张花费（奢华/大方），较少见时也可指“给予很多”的丰厚数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving or spending freely and generously; lavishness","zh":"慷慨给予或挥霍性花费的行为；奢华/铺张"},"examples":[{"en":"The charity was known for the lavishment of aid after natural disasters.","zh":"这家慈善机构以在自然灾害后慷慨提供援助而闻名。"},{"en":"Some people admired his lavishment of gifts, while others called it wasteful.","zh":"有些人欣赏他大方送礼，也有人认为那是浪费。"}]},{"partOfSpeech":"n.","definition":{"en":"an abundant amount; something given in great quantity (less common)","zh":"大量的东西；丰厚的给予（较少见）"},"examples":[{"en":"They enjoyed the lavishment of praise that followed the performance.","zh":"演出结束后，他们享受到了如潮的赞美。"}]}],"synonyms":["lavishness","generosity","profusion","extravagance","munificence"],"phonetic":"/ˈlævɪʃmənt/","extraExplanation":["“lavishment”在现代英语里比较少见，更常用的是“lavishness”（奢华/铺张/大方）或直接用动词短语“lavish ... on ...”（把……大量地给/倾注于……）。例如：They lavished attention on the child.（他们把关注倾注在孩子身上。）","词源上与“lavish”同根，常带有“给得很多”的含义；根据语境，它既可能是褒义（慷慨），也可能是贬义（浪费、铺张）。"]}
{"word":"lavishness","summary":{"en":"Lavishness means great luxury or generosity, often suggesting something rich and sometimes excessive.","zh":"Lavishness 指奢华或慷慨（大手大脚）的程度，常带“很讲究/有时过度”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being very generous or spending/using a lot of money, time, or effort, often in a way that feels rich or excessive.","zh":"奢华；铺张；大手大脚（指花很多钱、时间或精力，常带有“过于讲究/过度”的感觉）。"},"examples":[{"en":"The wedding’s lavishness surprised even the guests.","zh":"这场婚礼的奢华程度连宾客都感到惊讶。"},{"en":"Some people admire her lavishness, but others think she spends too much.","zh":"有些人欣赏她出手阔绰，但也有人觉得她花得太多。"}]},{"partOfSpeech":"n.","definition":{"en":"A rich or luxurious style or appearance; elaborate decoration or comfort.","zh":"华丽的风格或外观；精致讲究的装饰与舒适感。"},"examples":[{"en":"The hotel is known for the lavishness of its lobby and suites.","zh":"这家酒店以大堂和套房的华丽著称。"},{"en":"The film shows the lavishness of royal life.","zh":"这部电影展现了皇室生活的奢华。"}]}],"synonyms":["luxury","opulence","extravagance","splendor","generosity"],"phonetic":"/ˈlævɪʃnəs/","extraExplanation":["“lavishness”来自形容词“lavish”（奢华的；慷慨的）加名词后缀“-ness”（……的状态/性质）。常见搭配：the lavishness of + 名词（……的奢华/铺张）；criticize/admire the lavishness（批评/赞赏铺张）。","语感上，“lavishness”有时带轻微负面色彩，暗示“过度、浪费”；但在描述酒店、舞台、服装、宴会等场景时，也可以是中性或褒义的“华丽、讲究”。"]}
{"word":"Lavoisieran","summary":{"en":"Connected with Lavoisier’s chemistry and quantitative methods.","zh":"与拉瓦锡的化学思想及定量方法相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Antoine Lavoisier (18th‑century French chemist) or to his ideas, especially in modern chemistry (e.g., oxygen theory of combustion and careful quantitative measurement).","zh":"与拉瓦锡（18世纪法国化学家）有关的；或指其化学思想（尤指氧化学说与重视定量测量的化学方法）。"},"examples":[{"en":"The paper takes a Lavoisieran approach, focusing on precise measurements and mass balance.","zh":"这篇论文采用拉瓦锡式的方法，强调精确测量与质量守恒的核算。"},{"en":"Lavoisieran chemistry helped replace older ideas about burning with oxygen-based explanations.","zh":"拉瓦锡式的化学观帮助用基于氧的解释取代了更早关于燃烧的观点。"}]}],"synonyms":["Lavoisierian"],"phonetic":"/ləˌvwɑːziˈeəriən/","extraExplanation":["拉瓦锡常被称为“现代化学之父”之一：他强调实验数据与定量分析，提出（并推广）质量守恒观念，并用“氧”解释燃烧与呼吸过程，从而推动化学从旧的“燃素说”转向现代体系。","在学术写作中，Lavoisieran/Lavoisierian 常用来形容“严谨测量、定量化、重视质量平衡”的研究风格或理论框架。"],"etymology":"源自法国语境中对化学家 Antoine Lavoisier（安托万·拉瓦锡）的姓氏 Lavoisier，加上英语形容词后缀 -an（表示“……的/与……相关的”）。更常见的拼写是 Lavoisierian。","mnemonic":["把它拆成“Lavoisier + -an”：看到后缀 -an 就想到“某人/某派的”。所以这是“拉瓦锡的/拉瓦锡学派的”。","联想关键词：拉瓦锡 = 质量守恒 + 精确称量；看到 Lavoisieran 就想“称一称、算一算”的化学。"]}
{"word":"lavolta","summary":{"en":"“Lavolta” is usually a nonstandard spelling of the Italian phrase “la volta” (“the time/occasion”), and it can also refer to a Renaissance dance called “la volta/volta.”","zh":"“lavolta”多半是意大利语短语“la volta”（“那次/这次、某一次”）的连写；也可指一种文艺复兴时期的舞蹈“la volta/volta”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Italian phrase) “the time” (as in “this time/that time”), often used in the pattern “la volta scorsa” = “last time.”","zh":"（意大利语短语）“那次/这次的时间、次数”，常见于固定搭配，如“la volta scorsa”表示“上次”。"},"examples":[{"en":"La volta scorsa, we met at the station.","zh":"上次，我们在车站见面。"},{"en":"This time (“questa volta”), I’ll arrive earlier.","zh":"这次（questa volta），我会早点到。"}]},{"partOfSpeech":"n.","definition":{"en":"A historical Renaissance dance (usually written “la volta” or simply “volta”), known for turning movements and, in some descriptions, a lift.","zh":"一种文艺复兴时期的舞蹈（常写作“la volta”或“volta”），特点是旋转动作；一些记载中还包含托举。"},"examples":[{"en":"In the film, the court dancers perform the volta (la volta).","zh":"电影里，宫廷舞者表演了volta（la volta）。"},{"en":"They studied Renaissance dances like the pavane and la volta.","zh":"他们学习了帕凡舞（pavane）和拉沃尔塔舞（la volta）等文艺复兴舞蹈。"}]}],"synonyms":["volta (dance)","questa volta (this time)","la volta scorsa (last time)"],"phonetic":"/lə ˈvɔltə/","extraExplanation":["“lavolta”常见于把意大利语的“la volta”连写在一起的情况；更标准的写法通常是分开写“la volta”。","作为舞蹈名称时，英语里也常直接写“volta”。如果你是在书名、地名或人名里看到“La Volta”，那可能是专有名词，需要结合具体语境确认含义。"]}
{"word":"lavrock","summary":{"en":"Lavrock is a Scots word meaning “lark,” a small singing bird.","zh":"Lavrock 是苏格兰方言词，意思是“云雀/百灵”等会歌唱的小鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots) a lark (a small songbird known for its cheerful singing, especially the skylark).","zh":"（苏格兰方言）云雀；百灵（一种以清亮歌声著称的小型鸣禽，尤指云雀）。"},"examples":[{"en":"In Scots poetry, the lavrock often symbolizes joy and morning light.","zh":"在苏格兰诗歌里，lavrock 常常象征喜悦与清晨的光亮。"},{"en":"We heard the lavrock singing above the fields at dawn.","zh":"黎明时分，我们听见田野上空的 lavrock 在歌唱。"}]}],"synonyms":["lark","skylark"],"phonetic":"/ˈlæv.rɑk/","extraExplanation":["“Lavrock”主要见于苏格兰英语（Scots），在现代日常英语中更常用“lark”。","它常出现在苏格兰民歌与诗歌中，借由“清晨啼唱的鸟”来表达希望、自由、春天或爱情的情绪（例如苏格兰诗人 Robert Burns 的作品中就能看到相关意象）。"]}
{"word":"lavrocks","summary":{"en":"“Lava rock(s)” are porous volcanic rocks commonly used in landscaping, drainage, grills, and sometimes aquarium filtration.","zh":"“Lava rock(s)”指多孔的火山岩块，常用于景观铺设、排水、烧烤炉，有时也用于水族过滤。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"porous volcanic rock used for gardening/landscaping, drainage, and sometimes gas grills or fire pits (often sold in small red or black pieces)","zh":"火山岩块（多孔的火山岩石），常用于园艺/景观铺设、排水，有时也用于燃气烧烤炉或火盆（常见红色或黑色碎块）"},"examples":[{"en":"We spread lava rock around the plants to reduce weeds and help the soil drain.","zh":"我们在植物周围铺了火山岩块来减少杂草，并帮助土壤排水。"},{"en":"The grill uses lava rocks to distribute heat more evenly.","zh":"这台烤炉用火山岩块来更均匀地分散热量。"}]},{"partOfSpeech":"phrase","definition":{"en":"(aquariums) a rough, porous rock used as biological filter media because it provides space for beneficial bacteria","zh":"（水族箱）用作生物过滤材料的多孔粗糙岩石，因为它能为有益菌提供附着空间"},"examples":[{"en":"Some hobbyists put lava rock in the filter to support beneficial bacteria.","zh":"一些爱好者会在过滤器里放火山岩块来帮助有益菌生长。"}]}],"synonyms":["scoria","pumice (similar)","volcanic rock"],"phonetic":"ˈlɑːvə rɑːk","extraExplanation":["你输入的“lavrocks”更常见的拼写是 **lava rocks**（两词）。口语或网名里也可能把它连写成一个词。","严格来说市面上常见的“lava rock”多指 **scoria（火山渣岩）**；而 **pumice（浮石）**也很像，但通常更轻、孔更细。购买时商家可能不会区分得很严。"]}
{"word":"lavroffite","summary":{"en":"“Lavroffite” is not a standard English word; it’s likely a coined or misspelled term, possibly meaning a supporter/follower of (Sergey) Lavrov.","zh":"“Lavroffite” 不是标准英语词；更可能是自造词或拼写错误，可能指（谢尔盖）拉夫罗夫的支持者/追随者。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard term; most likely a coined word or misspelling rather than an established English vocabulary item. It may be intended to mean “a follower/supporter of Lavrov” (Sergey Lavrov, Russian foreign minister), similar in pattern to words like “Trotskyite.”","zh":"一个非常少见、非标准的词；更可能是自造词或拼写错误，并非英语中的常用词。它可能被用来表示“拉夫罗夫（Sergey Lavrov）的追随者/支持者”，构词方式类似于“Trotskyite（托派）”。"},"examples":[{"en":"I can’t find “lavroffite” in standard dictionaries; it may be a misspelling or a niche political label.","zh":"我在主流词典里找不到“lavroffite”；它可能是拼写错误或小圈子里的政治标签。"},{"en":"In online discussions, someone might coin “Lavroffite” to mean a person who strongly supports Lavrov’s views.","zh":"在网络讨论中，有人可能会自造“Lavroffite”来指非常支持拉夫罗夫观点的人。"}]}],"synonyms":["supporter of Lavrov","Lavrov supporter","follower (informal)"],"phonetic":"/ləˈvrɔːfaɪt/","extraExplanation":["从英语构词看，后缀 -ite / -ite 常用于表示“某人/某思想的追随者、拥护者”（如 Marxist/Marxite、Trotskyite），但 “Lavroffite” 并不是固定、广泛认可的用法。","如果你是在特定文章或语境中看到这个词，可能是作者的戏谑、讽刺或临时造词；也可能是把 “Lavrov” 的拼写改成 “Lavroff” 后再加 -ite。建议你提供原句，我可以帮你判断它在那段话里的确切含义。"]}
{"word":"lavrovite","summary":{"en":"Lavrovite is a rare mineral name used mostly in specialized mineralogy contexts.","zh":"Lavrovite 是一种较罕见的矿物名称，主要用于矿物学等专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mineralogy) a rare mineral species, mainly mentioned in specialized geology/mineral-collecting sources rather than everyday English.","zh":"（矿物学）一种较罕见的矿物名称，主要见于专业地质/矿物收藏资料，而非常用英语。"},"examples":[{"en":"The collector labeled the specimen as lavrovite, though it required lab testing to confirm.","zh":"收藏者把这块标本标为 lavrovite，不过仍需要实验室检测来确认。"},{"en":"Lavrovite is not a common word in general English; you usually see it in mineral lists.","zh":"Lavrovite 在日常英语里并不常见；你通常会在矿物清单中见到它。"}]}],"synonyms":["(no common synonyms; typically treated as a proper mineral name)"],"phonetic":"ˈlævroʊvaɪt","extraExplanation":["这个词在主流英语词典中很少收录，通常属于“专业名词/专有名”。如果你是在论文、标本标签或矿物数据库里看到的，我可以根据你提供的出处（比如产地、化学式、所属矿物族或截图）帮你更准确地确认它具体指哪一种矿物，以及中文常见译名。"]}
{"word":"lavs","summary":{"en":"“lavs” means toilets/bathrooms in informal British English.","zh":"“lavs”在非正式英式英语中指“厕所/洗手间”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly British) toilets; bathrooms (plural of “lav,” short for “lavatory”).","zh":"（非正式，主要英式英语）厕所；洗手间（“lav”的复数，“lavatory”的简称）。"},"examples":[{"en":"The lavs are at the end of the hallway on the left.","zh":"洗手间在走廊尽头的左边。"},{"en":"Sorry—I need to pop to the lavs for a minute.","zh":"不好意思——我得去一趟洗手间。"},{"en":"The café has clean lavs, which is a big plus.","zh":"这家咖啡馆的洗手间很干净，这是个很大的加分项。"}]}],"synonyms":["toilets","bathrooms","restrooms (AmE)","loo (BrE)"],"phonetic":"/lævz/","extraExplanation":["“lav / lavs”多见于英式口语，语气比较随意；在美式英语里更常说“bathroom / restroom”。","“lavatory”较正式或用于公共场所标识（如飞机上、火车上），口语里常被缩短成“lav”。"]}
{"word":"lavy","summary":{"en":"Lavy is an informal word meaning “toilet/lavatory,” used mainly in British, Australian, and New Zealand English.","zh":"lavy 是一个非正式词，主要在英式、澳式和新西兰英语中表示“厕所/洗手间”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly British/Australian/NZ) A toilet; a lavatory.","zh":"（非正式，多见于英式/澳新英语）厕所；洗手间。"},"examples":[{"en":"Where’s the lavy? I need to wash my hands.","zh":"洗手间在哪儿？我想去洗个手。"},{"en":"He ran to the lavy during the break.","zh":"休息时他跑去上厕所了。"}]}],"synonyms":["toilet","lavatory","loo","restroom","bathroom"],"phonetic":"/ˈlævi/","extraExplanation":["“lavy”常被看作“lavvy”的拼写变体，而“lavvy”来自“lavatory（厕所）”的口语缩短形式。","语气比较随意，适合口头表达；在正式场合更常用“toilet / restroom / bathroom”。","在美式英语里更常见的说法是“bathroom/restroom”，因此“lavy”可能会让一些美国人觉得陌生。"]}

