{"word":"lay","summary":{"en":"Lay most commonly means to put something down (it takes an object), and it can also mean to produce eggs or to arrange/spread something.","zh":"Lay 最常见意思是“把某物放下/平放”（后面通常要接宾语），也可指“下蛋”或“铺开/安排”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put or place something down in a flat position","zh":"把某物放下；平放"},"examples":[{"en":"Please lay the book on the table.","zh":"请把书放在桌子上。"},{"en":"She laid the baby gently in the crib.","zh":"她轻轻把婴儿放进婴儿床。"}]},{"partOfSpeech":"vt.","definition":{"en":"to produce and leave eggs (used for birds, insects, and some animals)","zh":"（鸟、昆虫等）下（蛋）；产卵"},"examples":[{"en":"Chickens lay eggs almost every day.","zh":"母鸡几乎每天都下蛋。"}]},{"partOfSpeech":"vt.","definition":{"en":"to arrange or spread something out over a surface","zh":"铺开；铺设；摆放（在表面上）"},"examples":[{"en":"They laid a blanket on the grass.","zh":"他们把毯子铺在草地上。"},{"en":"The workers are laying new pipes under the street.","zh":"工人正在街道下面铺设新管道。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put forward or state something (a plan, idea, or blame) clearly","zh":"提出；陈述（计划/观点）；归咎于"},"examples":[{"en":"She laid out her plan step by step.","zh":"她一步一步地把计划讲清楚。"},{"en":"Don’t lay the blame on others.","zh":"不要把责任推到别人身上。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be in a resting position (nonstandard in formal English; often confused with 'lie')","zh":"躺；处于平放状态（非标准用法，常与 lie 混淆）"},"examples":[{"en":"Informal: I’m going to lay down for a minute. (More standard: lie down.)","zh":"口语：我想躺一会儿。（更标准：lie down。）"}]}],"synonyms":["place","put","set","position","spread"],"phonetic":"/leɪ/","extraExplanation":["易混点：lay vs. lie。一般规则是：lay 后面要有“宾语”（放“什么”）；lie 不需要宾语（自己“躺”）。例如：I lay the phone on the bed.（我把手机放在床上。） vs. I lie on the bed.（我躺在床上。）","时态速记：lay（原形）— laid（过去式/过去分词）— laying（现在分词）。lie（躺）— lay（过去式）— lain（过去分词）— lying（现在分词）。因此会出现：Yesterday I lay down.（昨天我躺下了。）","常见短语：lay down（放下/制定规则/（口语）躺下），lay out（展开说明/布置/规划），lay off（裁员/暂时停止），lay the table（摆餐具、摆桌）。"]}
{"word":"lay awake all night","summary":{"en":"“lay awake all night” means you couldn’t sleep and stayed awake the whole night.","zh":"“lay awake all night”表示整晚无法入睡，一直清醒着。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be unable to sleep and remain awake in bed for the whole night","zh":"整晚睡不着，躺在床上一直清醒着"},"examples":[{"en":"I laid awake all night, worrying about the interview.","zh":"我整晚睡不着，一直在担心面试。"},{"en":"She lay awake all night after drinking too much coffee.","zh":"她喝了太多咖啡后整晚都睡不着。"},{"en":"We were so excited that we lay awake all night talking.","zh":"我们太兴奋了，整晚都没睡，一直在聊天。"}]}],"synonyms":["lie awake all night","stay awake all night","be up all night","not sleep all night"],"phonetic":"/leɪ əˈweɪk ɔl naɪt/","extraExplanation":["更常见、更标准的说法是 **lie awake all night**（lie-lay-lain：躺）。很多人会说 **lay awake**，但严格语法里 *lay* 通常是“放下（某物）”的过去式（lay-laid-laid）。如果你想写得更规范：现在时用 **lie awake**，过去时用 **lay awake** 或 **was/were lying awake**。","这个短语常用来表达“因焦虑、兴奋、疼痛、噪音、咖啡因”等原因失眠；语气通常带有抱怨或强调情绪。"]}
{"word":"layabout","summary":{"en":"A layabout is a lazy person who avoids working.","zh":"layabout 指逃避工作、游手好闲的懒人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who avoids work and spends time being lazy; someone who has no ambition to work.","zh":"游手好闲的人；懒散不工作的人；无所事事的人。"},"examples":[{"en":"He’s not a bad person, but he can be a real layabout on weekends.","zh":"他人不坏，但周末真的会变得很懒散、什么都不干。"},{"en":"Her parents worried she would become a layabout after quitting her job.","zh":"她辞职后，父母担心她会变成游手好闲的人。"}]}],"synonyms":["slacker","loafer","idler","bum"],"phonetic":"/ˈleɪ.əˌbaʊt/","extraExplanation":["“Layabout”带有明显的负面评价，常用来批评一个人不愿工作、缺乏上进心。比起中性描述（如 take a break / rest），它更像是在指责“好吃懒做”。","词源上与“lay about（闲着、无所事事地待着）”的表达有关，强调“到处闲晃、不做正事”的状态。"]}
{"word":"layabouts","summary":{"en":"Layabouts are lazy people who avoid work or responsibility.","zh":"layabouts 指游手好闲、逃避工作或责任的懒散之人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is lazy and avoids work or responsibility; someone who spends time doing nothing useful.","zh":"游手好闲的人；懒散不做事、逃避责任的人。"},"examples":[{"en":"He lost his job because his boss thought he was a layabout.","zh":"他丢了工作，因为老板觉得他是个游手好闲的人。"},{"en":"The neighbors complained about a group of layabouts hanging around the park all day.","zh":"邻居抱怨有一群游手好闲的人整天在公园里闲逛。"}]}],"synonyms":["loafer","idler","slacker","bum"],"phonetic":"/ˈleɪəˌbaʊt/","extraExplanation":["“layabouts”是“layabout”的复数形式。这个词带有明显的贬义，常用来批评一个人懒惰、没有上进心或不愿承担责任，比“unemployed（失业的）”更带评价色彩。","词源上可理解为“lay about（到处躺/闲着）”，形象地表达“无所事事、懒散度日”。"]}
{"word":"layaway","summary":{"en":"Layaway is a store program where you pay for an item in installments and pick it up after it’s fully paid.","zh":"Layaway 指商店的“分期预付保留”服务：分次付款，付清后再取货。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a way to buy something by paying in parts over time while the store keeps the item until you finish paying","zh":"（商店）分期预付保留：先分几次付款，商品由商店代为保留，付清后再取货"},"examples":[{"en":"I put the coat on layaway and will pick it up after I finish paying.","zh":"我把那件外套办了预付保留，等付清后再去取。"},{"en":"Many stores offered layaway for holiday shopping.","zh":"很多商店在节日购物季提供预付保留服务。"}]},{"partOfSpeech":"v.","definition":{"en":"to place an item in a store’s layaway program (to reserve it while paying over time)","zh":"把商品办成预付保留（参加分期预付、商店代保管的服务）"},"examples":[{"en":"She layawayed the toy so her kids wouldn’t see it before the birthday.","zh":"她把玩具办成预付保留，这样孩子在生日之前就看不到了。"},{"en":"You can layaway this laptop with a small deposit.","zh":"你可以用一小笔订金把这台笔记本电脑办成预付保留。"}]}],"synonyms":["installment plan (similar)","reserve (general)"],"phonetic":"/ˈleɪ.əˌweɪ/","extraExplanation":["“Layaway”在美国零售业很常见，尤其是在节日季或需要控制预算时。它不同于信用卡分期：通常不会马上把商品带走，而是由商店先“保留/存放”，你付清后再取货。","用法提示：名词更常见（on layaway / put something on layaway）。动词形式在口语里也会出现，但不如名词常见。","相关表达：put (something) on layaway（把……办成预付保留）；layaway plan/program（预付保留计划）。"]}
{"word":"layaways","summary":{"en":"“Layaways” is the plural of “layaway”: a payment plan where the store holds an item until you finish paying (also used as a verb meaning to put something on layaway).","zh":"“Layaways”是“layaway”的复数：指商店代为保管商品、顾客分期付清后再取货的付款方式（也可作动词，表示把商品办理成layaway）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “layaway”) a plan where you pay for an item in several payments while the store keeps it until it’s fully paid.","zh":"（layaway 的复数）“分期预付保留货”制度：顾客分多次付款，商品由商店代为保管，付清后再取货。"},"examples":[{"en":"Many stores offered layaways for holiday shopping.","zh":"很多商店在节日购物季提供 layaways（分期预付保留）。"},{"en":"She used two layaways to buy school clothes for her kids.","zh":"她用了两个 layaways（分期预付保留订单）来给孩子买上学穿的衣服。"}]},{"partOfSpeech":"vt.","definition":{"en":"(as a verb form) to put items on layaway—agree to pay over time while the store holds them.","zh":"（作动词用）把商品“放到分期预付保留”里：约定分期付款，由商店先保留商品。"},"examples":[{"en":"We laid away a winter coat and paid a little each week.","zh":"我们把一件冬衣放到分期预付保留里，每周付一点钱。"},{"en":"You can lay away the phone today and pick it up after the final payment.","zh":"你今天可以把手机办成分期预付保留，最后一笔付清后再来取。"}]}],"synonyms":["installment plan","in-store installment plan","reserve (in a store context)"],"phonetic":"/ˈleɪəˌweɪ/","extraExplanation":["“layaway”在美国零售文化中很常见：和“buy now, pay later（先买后付）/credit card（信用卡）”不同，layaway 通常是“先付钱、店里先保管、付清再拿走”，因此不会马上把商品带回家。","这个做法在过去（信用卡不普及或信用额度有限时）更常见；现在有些商店在返校季、圣诞季仍会提供类似服务。","拼写上：名词常写作 layaway；动词过去式常写 laid away（也有人写 layaway/layed away，但较不规范）。"]}
{"word":"layback","summary":{"en":"Layback is mainly a climbing term for pulling on one side of a crack while pushing with your feet and leaning back; it can also mean using that technique or a backward-leaning style in some sports.","zh":"Layback 主要是攀岩术语，指在裂缝/角落一侧用手向后拉、脚在对侧顶住并后仰保持平衡的动作；也可指用这种技术攀爬，或某些运动中的后仰姿势/风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Climbing) A technique where you pull on one edge of a crack or corner with your hands while pushing your feet against the opposite surface, leaning your body back for balance.","zh":"（攀岩）“背靠/后仰对拉”技术：手抓裂缝或角落的一侧向后拉，脚在对侧用力顶住，身体后仰以保持平衡。"},"examples":[{"en":"The route is mostly a long layback along a thin crack.","zh":"这条线路大多是一段沿着细裂缝的长距离后仰对拉。"},{"en":"My arms got pumped quickly during the layback.","zh":"做后仰对拉时我的手臂很快就酸胀无力了。"}]},{"partOfSpeech":"v.","definition":{"en":"To climb using the layback technique.","zh":"用“后仰对拉”的方式攀爬。"},"examples":[{"en":"If the crack is too shallow to jam, try to layback it.","zh":"如果裂缝太浅没法塞手卡住，可以试试用后仰对拉爬。"},{"en":"She laybacked the corner smoothly and reached the ledge.","zh":"她顺畅地后仰对拉通过了角落，抓到了平台。"}]},{"partOfSpeech":"n.","definition":{"en":"A backward-leaning position or style in some sports (such as skiing), often used for balance or flair.","zh":"（某些运动中，如滑雪）后仰的姿势或风格，常用于保持平衡或增加观赏性。"},"examples":[{"en":"He finished the run with a dramatic layback turn.","zh":"他用一个夸张的后仰转弯结束了这趟滑行。"}]}],"synonyms":["(climbing) lieback","(general) lean back","(climbing) side-pull (related)"],"phonetic":"/ˈleɪbæk/","extraExplanation":["注意：layback（一个词）多见于攀岩术语；日常英语里形容“放松的、随和的”通常用 laid-back（带连字符）。","攀岩里 layback 常用于无法“卡手/卡脚”（jam）或需要快速通过的裂缝/角落；但会很费手臂力量，所以常与“脚法”和身体重心控制一起练。"]}
{"word":"layboy","summary":{"en":"“Playboy” usually means a man who lives for pleasure and dates many women; it can also refer to the U.S. magazine brand “Playboy.”","zh":"“playboy”通常指爱玩乐、常与多名女性约会的“花花公子”；也可指美国杂志品牌《花花公子》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man (often rich) who spends a lot of time having fun and dating many women rather than doing serious work or having a committed relationship","zh":"花花公子；（常指有钱的）爱玩乐、常与多名女性约会而不太认真投入长期关系的男性"},"examples":[{"en":"He was known as a playboy when he was younger.","zh":"他年轻时以花花公子出名。"},{"en":"The movie shows him changing from a playboy into a responsible father.","zh":"电影里他从花花公子转变成了负责任的父亲。"}]},{"partOfSpeech":"n.","definition":{"en":"Playboy: a famous U.S. men’s magazine brand (also used as a company name)","zh":"《花花公子》：美国著名男性杂志品牌（也可指其公司/品牌）"},"examples":[{"en":"The article was published in Playboy in the 1960s.","zh":"那篇文章发表于20世纪60年代的《花花公子》。"}]}],"synonyms":["ladies' man","womanizer","philanderer","party boy"],"phonetic":"/ˈpleɪˌbɔɪ/","extraExplanation":["你输入的“layboy”在英语里不常见，通常是“playboy”的拼写错误。标准拼写是 playboy。","“playboy（花花公子）”带明显的负面评价，暗示不够认真、爱玩乐、感情不专一。正式场合可用更中性的说法，如: womanizer（更负面，指玩弄女性者）、ladies’ man（较中性，受女性欢迎的男性）、party boy（爱派对的男孩/年轻男性）。","文化上，《Playboy》杂志与成人内容和特定时代的美国流行文化有关；在一些语境中提到它可能不太适合未成年人或正式环境。"]}
{"word":"layday","summary":{"en":"A shipping term for the allowed days to load or unload a vessel under a contract.","zh":"航运术语：合同规定的船舶装货或卸货允许天数（装卸期）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Shipping & trade) A day allowed under a charter party for loading or unloading a ship; often used in the plural (“laydays”).","zh":"（航运与贸易）装卸期内允许用于装货或卸货的日期；常用复数“laydays”（装卸期）。"},"examples":[{"en":"The charter allows five laydays for loading at the port.","zh":"租船合同规定在该港装货有五个装卸期日。"},{"en":"If loading isn’t finished within the laydays, the charterer may have to pay demurrage.","zh":"如果未能在装卸期内完成装货，承租人可能需要支付滞期费。"}]}],"synonyms":["lay day","laytime day","loading day","discharging day"],"phonetic":"/ˈleɪ.deɪ/","extraExplanation":["“Layday / laydays”多见于航运合同（charter party）语境，和“demurrage（滞期费）”“dispatch（速遣费）”等条款常一起出现。现代英语里更常写作“lay day / lay days”，但在法律或行业文件中也会见到合写“layday(s)”。"]}
{"word":"laydown","summary":{"en":"Laydown means an easy, almost certain win, or something certain to win.","zh":"laydown 指“轻松几乎必胜的胜利”，也可形容“稳胜的、很容易的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an easy, almost certain win (often in sports, competitions, or horse racing)","zh":"轻松几乎必胜的胜利（常用于体育比赛、竞赛或赛马语境）"},"examples":[{"en":"With their star player back, it should be a laydown.","zh":"他们的明星球员回归后，这场比赛应该是稳赢。"},{"en":"The favorite in the race looked like a laydown on paper.","zh":"从纸面实力看，这匹热门马看起来是稳胜。"}]},{"partOfSpeech":"adj.","definition":{"en":"certain to win; very easy (describing a game, race, or result)","zh":"稳胜的；非常容易的（形容比赛或结果）"},"examples":[{"en":"It was a laydown match for the champions.","zh":"对冠军队来说，那是一场轻松取胜的比赛。"},{"en":"Nothing is a laydown in the playoffs.","zh":"季后赛里没有哪一场是稳稳赢的。"}]}],"synonyms":["sure thing","easy win","walkover","cakewalk","slam dunk"],"phonetic":"/ˈleɪˌdaʊn/","extraExplanation":["“laydown”通常来自赛马/博彩语境，表示“稳赢的热门”。日常口语里也可泛指“十拿九稳的胜利”。","注意区分：**laydown**（一个词）多指“稳赢/轻松胜利”；而 **lay down**（两个词）通常是动词短语，意思是“放下、制定（规则）、躺下”等。"]}
{"word":"layed","summary":{"en":"“Layed” is usually a misspelling of “laid” (past/past participle of “lay”). Use “laid” in standard English.","zh":"“layed”通常是“laid”（lay 的过去式/过去分词）的拼写错误；标准英语请用“laid”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A common misspelling of “laid,” the past tense/past participle of “lay” (to put/place something down). In standard English, use “laid.”","zh":"（非标准）“laid”的常见拼写错误；“lay（放置）”的过去式/过去分词。标准英语应写“laid”。"},"examples":[{"en":"Incorrect: I layed the book on the table.","zh":"错误：I layed the book on the table.（应为 laid）"},{"en":"Correct: I laid the book on the table.","zh":"正确：I laid the book on the table.（我把书放在桌子上。）"},{"en":"She has laid the papers next to your laptop.","zh":"她已经把文件放在你的笔记本电脑旁边了。"}]}],"synonyms":["laid","placed","put"],"phonetic":"/leɪd/","extraExplanation":["“lay / laid / laid”是及物动词，后面要接宾语：lay the baby down（把宝宝放下）。","很多人把“lay”和“lie”混淆：lie（躺）是不及物动词：lie / lay / lain，例如：Yesterday I lay down early（昨天我早早躺下）。","所以“layed”通常不是一个需要记的标准词形；写作或考试中请用“laid”。"]}
{"word":"layer","summary":{"en":"Layer most commonly means a level or covering; it can also mean someone who lies in wait, and it can be a verb meaning to put or form things in layers.","zh":"layer最常指“层/覆盖层”；也可指“埋伏者”；作动词表示“分层铺放”或“形成分层”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A level or sheet of material (or a thickness of something) lying over or under another.","zh":"一层；一片（覆盖在另一层之上或之下的材料/厚度）。"},"examples":[{"en":"A thin layer of ice covered the pond.","zh":"池塘上结了一层薄冰。"},{"en":"Spread a layer of cream on the cake.","zh":"在蛋糕上抹一层奶油。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that lies in wait to attack, trap, or surprise someone.","zh":"埋伏者；伏击者（躲藏等待袭击、设陷或突袭的人/物）。"},"examples":[{"en":"The detective said a thief was a layer in wait near the station.","zh":"侦探说车站附近有小偷在埋伏。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put things down in layers; to cover or arrange something in levels.","zh":"把……铺成层；分层覆盖或分层摆放。"},"examples":[{"en":"Layer the vegetables and cheese in the dish.","zh":"把蔬菜和奶酪一层层铺在盘子里。"},{"en":"She layered a blanket over the sleeping child.","zh":"她在熟睡的孩子身上又盖了一层毯子。"}]},{"partOfSpeech":"vi.","definition":{"en":"To form layers or be arranged in layers.","zh":"形成层次；呈层状叠加。"},"examples":[{"en":"As it cools, the sauce may layer at the top.","zh":"酱汁冷却后，上面可能会出现分层。"}]}],"synonyms":["level","sheet","coating","stratum"],"phonetic":"/ˈleɪər/","extraExplanation":["常见搭配：a layer of + 名词（a layer of dust 一层灰）；in layers（分层地）；layer upon layer（层层叠叠，常用于文学描写）。","“layer”在日常中最常见的是“层”（衣服、奶油、冰、灰尘等）。第二个名词义“埋伏者”较少见，更常见的表达是“someone lying in wait”。","在电脑/设计语境中，layer也常指“图层/层级”（如Photoshop layers），属于引申用法：把信息像“层”一样叠放与管理。"]}
{"word":"layerage","summary":{"en":"Layerage is a rare noun meaning the structure or process of forming layers.","zh":"Layerage 是较少见的名词，指“层状结构”或“分层的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the arrangement or presence of layers; the way something is built up in layers (rare).","zh":"层状结构；分层的状态或排列方式（较少见用法）。"},"examples":[{"en":"The cake’s layerage made it look taller than it really was.","zh":"蛋糕的层次结构让它看起来比实际更高。"},{"en":"Geologists described the rock’s layerage as evidence of slow change over time.","zh":"地质学家把岩石的层状结构描述为时间缓慢变化的证据。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of putting something into layers (rare).","zh":"分层的行为或过程（较少见用法）。"},"examples":[{"en":"Careful layerage of paint can create a richer color.","zh":"仔细地分层上色能形成更丰富的颜色。"}]}],"synonyms":["layering","stratification","layers"],"phonetic":"/ˈleɪərɪdʒ/","extraExplanation":["“layerage”在现代英语中非常少见，很多情况下人们更常用“layering”（分层/叠加）或“stratification”（分层/层化，偏学术）。如果你是在作业或正式写作里看到/想用，通常用“layering / layers”会更自然。","有时学习者会把“leverage”（/ˈliːvərɪdʒ/，杠杆作用/利用）误写成“layerage”。如果你的语境是“利用优势、借力”，你可能想表达的是“leverage”。"]}
{"word":"layerages","summary":{"en":"“Layerages” is the plural of the rare noun “layerage,” meaning the formation or arrangement of layers.","zh":"“layerages”是罕用名词“layerage”的复数，指层的形成或排列（层状结构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) The arrangement or formation of layers; a layered structure (often in geology, materials, or textiles).","zh":"（罕用）层的排列或形成；层状结构（常见于地质、材料或纺织语境）。"},"examples":[{"en":"Geologists studied the layerage of the cliff to understand its history.","zh":"地质学家研究悬崖的层状结构，以了解它的形成历史。"},{"en":"The fabric’s layerage makes it warmer without adding much weight.","zh":"这种布料的多层结构让它更保暖，但不会增加太多重量。"}]}],"synonyms":["layering","stratification","layer structure","layers"],"phonetic":"/ˈleɪərɪdʒ/","extraExplanation":["“layerages”是名词“layerage”的复数形式，但在现代英语里非常少见。日常或学术写作中，人们更常用：\n- “layering”（层叠/分层的过程或结果）\n- “stratification”（分层/层化，偏正式，常用于社会或地质）\n- “layers”或“layer structure”（更直白）\n如果你是在某篇论文、技术报告或旧文本里看到“layerages”，通常就是指“不同层的分布/层状结构”。"]}
{"word":"layered","summary":{"en":"“Layered” means “having layers” (physical or abstract), and it can also be the past form of “layer” meaning “to arrange in layers.”","zh":"“Layered”指“有多层的”（可指实体或抽象含义），也可作动词“layer”的过去式，表示“把……分层放置/叠加”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having multiple layers; made up of several levels or parts placed on top of each other.","zh":"分层的；有多层的；由好几层叠加组成的。"},"examples":[{"en":"She wore a layered dress with a jacket on top.","zh":"她穿了一件分层连衣裙，外面又套了一件夹克。"},{"en":"The cake is layered with cream and fruit.","zh":"这块蛋糕夹着奶油和水果，层层叠叠。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of meaning, a story, or an argument) Having several levels of ideas or emotions; complex and rich.","zh":"（指意义、故事或论点）有多重层次的；含义丰富、较复杂的。"},"examples":[{"en":"It’s a layered novel—you notice new meanings each time you read it.","zh":"这是一部有层次的小说——你每次读都会发现新的含义。"},{"en":"Her speech was layered with humor and criticism.","zh":"她的演讲既幽默又带批评意味，层次很丰富。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “layer”: to put or arrange something in layers.","zh":"“layer”的过去式：把……分层放置；把……叠成层。"},"examples":[{"en":"They layered the vegetables in the pot before adding the sauce.","zh":"他们先把蔬菜一层层放进锅里，再倒入酱汁。"},{"en":"He layered paint over the old color to create texture.","zh":"他在旧颜色上叠加涂料来制造质感。"}]}],"synonyms":["multi-layered","tiered","stratified","complex"],"phonetic":"/ˈleɪərd/","extraExplanation":["“layered”既可描述真实的“物理层”（衣服、蛋糕、地质结构），也常用来形容“抽象层次”（含义多、情感复杂）。在写作或影评里说 a layered character/film，通常是在夸它“耐读、耐看”。","常见搭配：layered clothing（洋葱式穿衣/分层穿搭），a layered cake（千层/夹层蛋糕），a layered explanation（层次分明的解释），layered meaning（多重含义）。"]}
{"word":"layering","summary":{"en":"Layering means arranging things in layers, especially for clothing, cooking, art/design, or natural rock/soil layers.","zh":"Layering 指“分层/叠加”，常用于穿搭叠穿、烹饪叠加风味、艺术设计叠涂与地质岩土的层状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of putting things in layers (one on top of another), or the result of being arranged in layers","zh":"分层；把事物一层层叠放（或排列）的过程；分层后的状态"},"examples":[{"en":"The chef uses layering to build flavor in the soup.","zh":"厨师用分层的方式来逐步叠加汤的味道。"},{"en":"Good layering keeps you warm without making you feel too hot.","zh":"好的穿衣分层能保暖，同时不至于太热。"},{"en":"The painting shows careful layering of color.","zh":"这幅画展示了颜色的精心叠涂（分层上色）。"}]},{"partOfSpeech":"n.","definition":{"en":"(geology/science) a series of layers in rock, soil, or other material; stratification","zh":"（地质/科学）岩石、土壤等物质的层理；层状结构"},"examples":[{"en":"The canyon walls reveal thousands of years of layering.","zh":"峡谷岩壁展示了数千年的地层分层。"},{"en":"Scientists studied the snow layering to understand past weather.","zh":"科学家研究积雪的分层来了解过去的天气。"}]},{"partOfSpeech":"n.","definition":{"en":"the technique of dressing in multiple thin layers of clothing to adjust to changing temperatures","zh":"（穿搭）叠穿：用多层薄衣服来适应温度变化的穿衣方法"},"examples":[{"en":"Layering is common in places where mornings are cold and afternoons are warm.","zh":"在早冷午暖的地方，叠穿很常见。"},{"en":"Try layering a T-shirt under a light jacket.","zh":"试试在轻薄外套里面叠穿一件T恤。"}]}],"synonyms":["layering process","layering technique","stratification","stacking","building up"],"phonetic":"/ˈleɪərɪŋ/","extraExplanation":["“layering”常见于生活场景：穿搭（layering clothes/for warmth）、烹饪（layering flavors/ingredients）、艺术设计（layering colors/textures）。语感上偏“有步骤地叠加”，强调层次感与可调节性。","在地质语境里，layering接近“stratification（地层化/成层）”，常用来描述岩层、沉积物或雪层的分层结构。"]}
{"word":"layerings","summary":{"en":"“Layerings” means multiple layers, or multiple instances/levels of layering, both literally (food, clothes, rocks) and figuratively (meanings, emotions).","zh":"“layerings”指“多层/多次的分层”，既可指字面上的层叠（食物、衣物、岩石），也可指抽象的层次（含义、情感）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Multiple layers arranged on top of or around each other; the result of putting things in layers.","zh":"（复数名词）多层叠加在一起的结构；把事物分层放置后的结果。"},"examples":[{"en":"The cake’s layerings of sponge and cream made it look tall and elegant.","zh":"这块蛋糕海绵与奶油的层层叠加让它看起来又高又精致。"},{"en":"Geologists studied the rock layerings to understand the area’s history.","zh":"地质学家研究岩石的层理（层层结构）来了解该地区的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Different levels of meaning, detail, or emotion added on top of each other (often in writing, art, or conversation).","zh":"（复数名词）（常用于写作、艺术或谈话中）层层递进的含义、细节或情感。"},"examples":[{"en":"The novel has many layerings of meaning, so it rewards careful reading.","zh":"这本小说有许多层层含义，因此细读会更有收获。"},{"en":"Her apology had layerings of sadness and relief.","zh":"她的道歉里夹杂着层层的难过与释然。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) The process or method of building something in layers (e.g., clothing, food, materials).","zh":"（复数名词）分层构建的过程或方法（如穿衣叠穿、做菜分层、材料分层）。"},"examples":[{"en":"Winter outfits often rely on smart layerings to stay warm without feeling bulky.","zh":"冬季穿搭常靠聪明的叠穿来保暖又不显臃肿。"},{"en":"In this recipe, the layerings should be even so the dish bakes properly.","zh":"这道菜的各层要铺得均匀，才能烤得恰到好处。"}]}],"synonyms":["layers","strata","stacking","tiering","levels"],"phonetic":"/ˈleɪərɪŋ/","extraExplanation":["“layerings”是“layering”的复数形式，但在日常英语里更常见的是不可数用法“layering”（如：Layering is important in winter.）。当你强调“多种/多次分层”或“不同类型的分层效果”时，才更自然用复数“layerings”。在地质语境中，也常用更专业的词如“stratification/strata（地层）”来表达“层理/地层结构”。"]}
{"word":"layers","summary":{"en":"“Layers” means multiple separate levels or sheets stacked together, and it can also mean levels of meaning/complexity; it may also be the verb form meaning “puts in layers.”","zh":"“layers”表示多层/层叠的部分，也可指含义或复杂性的层次；还可作动词（layer 的第三人称单数），表示“分层放置/覆盖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of layer: separate levels or sheets of something placed on top of each other","zh":"layer 的复数：一层层的部分；彼此叠放的层面/层片"},"examples":[{"en":"Wear several layers in winter to stay warm.","zh":"冬天穿好几层衣服会更保暖。"},{"en":"The cake has three layers with cream between them.","zh":"这个蛋糕有三层，中间夹着奶油。"},{"en":"You can see layers of paint on the old door.","zh":"你能在那扇旧门上看到一层层油漆。"}]},{"partOfSpeech":"n.","definition":{"en":"levels of meaning, detail, or complexity in an idea, story, or situation","zh":"（含义、细节或复杂性上的）层次；多重面向"},"examples":[{"en":"The movie has many layers, so you notice new details each time.","zh":"这部电影很有层次，所以你每次都会注意到新细节。"},{"en":"There are layers of emotion in her voice.","zh":"她的声音里有多层情绪。"}]},{"partOfSpeech":"v.","definition":{"en":"3rd person singular of layer: to arrange or cover something in layers","zh":"layer 的第三人称单数：把……分层放置；用层覆盖"},"examples":[{"en":"She layers vegetables and noodles in the pot.","zh":"她把蔬菜和面条一层层放进锅里。"},{"en":"He layers a jacket over a sweater when it gets colder.","zh":"天冷时他在毛衣外面再套一件夹克。"}]}],"synonyms":["levels","sheets","strata","coats","tiers"],"phonetic":"/ˈleɪərz/","extraExplanation":["“layers”既可以指看得见的物理层（衣服、蛋糕、油漆、地层），也常用来比喻“含义/情感的层次”（a story with many layers）。","发音里常见的美式读法是两拍：LAY-ers，第二拍是轻音的“ərz”。"]}
{"word":"layery","summary":{"en":"“Layery” means “layered” or “having layers,” often used to describe a texture or look with clear layers.","zh":"“Layery”表示“分层的/有层次的”，常用来形容质感或外观有明显层次。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or made of layers; arranged in layers (similar to “layered”).","zh":"有层次的；由多层构成的；呈层状排列的（类似“layered”）。"},"examples":[{"en":"The cake had a layery texture, with cream between each thin sheet.","zh":"这个蛋糕的口感很“分层”，每一层薄片之间都有奶油。"},{"en":"Her outfit looked layery because she wore a shirt, a sweater, and a coat.","zh":"她的穿搭看起来很“有层次”，因为她穿了衬衫、毛衣和外套。"},{"en":"The rock face looked layery, showing stripes from different time periods.","zh":"岩壁看起来层层分明，条纹显示出不同时期形成的地层。"}]}],"synonyms":["layered","multi-layered","stratified"],"phonetic":"/ˈleɪəri/","extraExplanation":["“layery”是由名词 layer（层）+ 形容词后缀 -y 构成，表示“有……特征/带有……感觉”。在日常英语里更常见的说法是 layered（分层的、有层次的）；“layery”更偏口语化或描述“质感/视觉效果”的感觉（例如蛋糕、衣着、地质纹理）。"]}
{"word":"layette","summary":{"en":"A layette is a prepared set of clothes and essentials for a newborn baby.","zh":"layette 指为新生儿准备的一整套衣物和基本用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of clothing and basic items for a newborn baby (often including onesies, blankets, socks, and sometimes diapers).","zh":"（给新生儿准备的）婴儿衣物及基本用品套装（常包括连体衣、毯子、袜子，有时也包括尿布等）。"},"examples":[{"en":"They bought a layette for the baby before the due date.","zh":"他们在预产期前给宝宝买了一套新生儿用品（layette）。"},{"en":"The hospital gift shop sells simple layettes for new parents.","zh":"医院的礼品店为新手父母出售简单的婴儿用品套装。"}]}],"synonyms":["newborn set","baby essentials (set)","baby starter set"],"phonetic":"/leɪˈɛt/","extraExplanation":["这个词来自法语，原意与“摆放（lay out）/准备好”有关，所以 layette 常带有“提前备齐一套给新生儿用的东西”的感觉。","在美国英语里，layette 比 “baby clothes” 更正式、更偏“成套”或“礼盒/清单”概念；在日常口语中，人们也常直接说 newborn essentials（新生儿必备用品）或 baby outfit（宝宝衣服/一套衣服）。"]}
{"word":"layettes","summary":{"en":"Layette(s) means a set of clothes and essential items for a newborn baby.","zh":"Layette（复数 layettes）指一套新生儿衣物与基本用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of baby clothes and basic items for a newborn (often including onesies, diapers, blankets, etc.)","zh":"（新生儿用的）婴儿衣物与基本用品套装（常包括连体衣、尿布、毯子等）"},"examples":[{"en":"They received several layettes at the baby shower.","zh":"他们在宝宝派对上收到了几套新生儿用品套装。"},{"en":"The hospital gift shop sells layettes for parents who need essentials quickly.","zh":"医院的礼品店出售新生儿用品套装，方便需要迅速备齐必需品的父母。"}]}],"synonyms":["newborn set","baby essentials set","baby outfit set"],"phonetic":"/leɪˈjɛt/","extraExplanation":["“layette”通常用于美式英语的育儿语境，尤其在购物或送礼（如 baby shower）时很常见。它多指“一整套”新生儿所需的衣物与用品，而不只是单件衣服。","词源来自法语，原意与“婴儿的小物件/小衣物”有关。在现代语境中，常见于商店分类（如 newborn layette set）。"]}
{"word":"layfolk","summary":{"en":"Layfolk are non-experts or non-professionals, especially non-clergy members of a church.","zh":"Layfolk 指外行人或平信徒，尤指教会中非神职人员的普通信众。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"ordinary people who are not trained or officially involved in a particular profession or organization (especially the church).","zh":"外行人；平信徒（指未受专业训练或未正式参与某行业/组织的人，尤指教会中非神职人员）。"},"examples":[{"en":"The doctor explained the results in terms that layfolk could understand.","zh":"医生用外行人也能听懂的方式解释了结果。"},{"en":"In many churches, layfolk help run community programs and services.","zh":"在许多教会里，平信徒会协助开展社区项目和服务。"}]}],"synonyms":["laypeople","laity","non-experts","the general public"],"phonetic":"/ˈleɪfoʊk/","extraExplanation":["“Layfolk”常见于宗教语境，尤其与“clergy（神职人员）”相对：clergy负责主持宗教仪式与教务，layfolk/laypeople则是普通信众。","在一般语境里也可指“非专业人士”，近义表达更常用的是“laypeople / the general public / non-experts”。","用法提示：既可指单数群体（the layfolk），也可当复数理解；现代英语中“laypeople”更常见、更中性。"]}
{"word":"layia","summary":{"en":"“Layia” is not a common English word; it is usually a name or a misspelling of a similar word.","zh":"“Layia”不是常见英语词；通常是人名，或是相近词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word; most commonly seen as a personal name or a misspelling/variant of similar-looking words (e.g., “Laia,” “Laya,” or “lay”).","zh":"不是标准英语词典词；更常见的是人名，或是与拼写相近词（如“Laia”“Laya”或“lay”）的误拼/变体。"},"examples":[{"en":"My classmate Layia moved here from another city.","zh":"我的同学 Layia 从另一个城市搬到这里。"},{"en":"Did you mean “lay” (put down) instead of “layia”?","zh":"你想写的是“lay”（放下）而不是“layia”吗？"}]}],"phonetic":"/ˈleɪ.ə/","extraExplanation":["“Layia”在英语里没有稳定、普遍认可的词义，因此在阅读或写作中更可能是：\n1）人名（名字/昵称/网名）；\n2）其他词的拼写错误。\n\n如果你告诉我它出现的句子或上下文（例如：一段对话、歌词、小说片段），我可以帮你判断它最可能指什么，并给出更准确的解释。","可能的相近词：\n- lay /leɪ/：放下；产卵（最常见的相关词）\n- Laia（常见于加泰罗尼亚语/西班牙语语境的人名）\n- Laya：也常作为人名或品牌名出现"]}
{"word":"laying","summary":{"en":"“Laying” usually means putting something down/placing it (present participle of “lay”), or (of animals) producing eggs; it can also mean the process of installing something, and it’s used in phrases like “laying hens.”","zh":"“Laying”通常指“放置/放下”（动词lay的现在分词），也可指动物“产卵”；还可表示“铺设/安装的过程”，并用于短语如“laying hens（产蛋母鸡）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “lay”: putting or placing something down in a flat position, or putting something somewhere carefully","zh":"“lay”的现在分词：把某物放下（使其平放），或小心地把某物放到某处"},"examples":[{"en":"She is laying the book on the table.","zh":"她正把书放在桌子上。"},{"en":"They are laying bricks to build a wall.","zh":"他们正在砌砖建墙。"},{"en":"Please stop laying your clothes on the floor.","zh":"请别再把衣服丢在地板上。"}]},{"partOfSpeech":"v.","definition":{"en":"(of an animal, especially a bird) producing and putting eggs","zh":"（动物，尤指鸟类）产卵、下蛋"},"examples":[{"en":"The hen is laying eggs almost every day.","zh":"这只母鸡几乎每天都下蛋。"},{"en":"Spring is the season when many birds start laying.","zh":"春天是许多鸟类开始产卵的季节。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of putting something in place (often used with a noun, like “pipe laying” or “road laying”)","zh":"铺设、敷设的过程（常与名词连用，如“管道铺设”“道路铺设”）"},"examples":[{"en":"The laying of new cables will take two weeks.","zh":"新电缆的铺设将需要两周。"},{"en":"Road laying is blocked by heavy rain.","zh":"大雨阻碍了道路铺设。"}]},{"partOfSpeech":"adj.","definition":{"en":"used before a noun to describe something that is designed for laying eggs (e.g., “laying hens”)","zh":"（定语用法）用于描述“产蛋用的/下蛋的”（如“蛋鸡/产蛋母鸡”）"},"examples":[{"en":"The farm keeps 500 laying hens.","zh":"这个农场养了500只产蛋母鸡。"}]}],"synonyms":["placing","putting","setting","installing","depositing"],"phonetic":"/ˈleɪɪŋ/","extraExplanation":["“laying”来自动词“lay”（放置；下蛋）的现在分词。学习者最常混淆的是“lay”和“lie”：\n- lay（vt. 及物）= 放“某物”，需要宾语：lay the book down.\n- lie（vi. 不及物）= 自己“躺/位于”，不需要宾语：lie down.\n对应的过去式也不同：lay–laid–laid；lie–lay–lain。"]}
{"word":"layland","summary":{"en":"“Layland” is usually a surname or a less-common place name; it may also be a variant spelling of “Leyland.”","zh":"“Layland”通常是姓氏或较少见的地名；也可能是“Leyland”的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also a spelling variant of “Leyland.”","zh":"姓氏；也可作“Leyland”的拼写变体。"},"examples":[{"en":"Ms. Layland will lead the meeting today.","zh":"Layland 女士今天将主持会议。"},{"en":"I found the name Layland in an old census record.","zh":"我在一份旧人口普查记录里找到了 Layland 这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a place name; used in some English-speaking regions as the name of a town, area, or street.","zh":"（较少见）地名；在一些英语地区用作城镇、区域或街道名称。"},"examples":[{"en":"They moved to Layland for work.","zh":"他们为了工作搬到了 Layland。"},{"en":"Turn left onto Layland Road.","zh":"在 Layland 路左转。"}]}],"synonyms":["Leyland (variant spelling)"],"phonetic":"/ˈleɪlənd/","extraExplanation":["“Layland”在英文里并不是非常常见的普通词汇，更常见的是“Leyland”（如英国汽车品牌相关名、或“Leyland cypress /ˈleɪlənd ˈsaɪprəs/ 莱兰柏”这种树名）。如果你是在文章里看到“layland”，有可能是人名/地名，或是把“Leyland”拼成了“Layland”。","如果你能告诉我它出现的句子或上下文（人名、地名、公司名、植物名），我可以帮你更准确判断具体含义。"]}
{"word":"laylight","summary":{"en":"A laylight is an interior glazed ceiling panel/opening that brings in and diffuses light, often beneath a skylight.","zh":"laylight 指室内天花处的玻璃采光板/开口，用来引入并柔化光线，常位于天窗下方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a glass (or glazed) panel or framed opening set in or just below a ceiling to let in and diffuse light, often used under a skylight or over a stairwell","zh":"（建筑）天花板上或天花板下方设置的玻璃（或带玻璃的）采光板/框架开口，用来引入并柔化光线，常见于天窗下方或楼梯间上方"},"examples":[{"en":"The old hotel’s laylight softens the sunlight coming from the skylight above.","zh":"那家老旅馆的顶棚采光板把上方天窗的阳光柔和了。"},{"en":"They restored the stained-glass laylight in the lobby ceiling.","zh":"他们修复了大堂天花板上的彩绘玻璃采光板。"}]}],"synonyms":["skylight (related)","rooflight (related)","glazed ceiling panel","ceiling light well (related)"],"phonetic":"ˈleɪlaɪt","extraExplanation":["“laylight”是比较少见、偏建筑领域的词，也常写作“lay light”。它通常指位于室内天花处的玻璃采光结构，用来把天窗（skylight/rooflight）引入的强光变得更均匀、柔和。","在历史建筑或老式公共建筑（如酒店、车站、剧院）里更常见，有时会用磨砂玻璃或彩色玻璃来兼顾采光与装饰。"]}
{"word":"layloc","summary":{"en":"“Lay low” means to avoid attention or to rest quietly.","zh":"“lay low”表示保持低调、避免引人注意；也可指安静休息。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"If you “lay low,” you stay quiet, avoid attention, and keep a low profile (often to avoid trouble or danger).","zh":"“lay low”表示保持低调、躲避关注、尽量不引人注意（常为避免麻烦或危险）。"},"examples":[{"en":"After the argument, he decided to lay low for a few days.","zh":"争吵之后，他决定低调几天。"},{"en":"The police said the suspect might be laying low somewhere outside the city.","zh":"警方说嫌疑人可能在城外某处躲着。"}]},{"partOfSpeech":"phrase","definition":{"en":"To take a break and rest quietly, without socializing or doing much.","zh":"（较口语）指安静地休息一下，不社交、不怎么活动。"},"examples":[{"en":"I’m going to lay low tonight and just watch a movie.","zh":"我今晚想安静点，就看看电影。"}]}],"synonyms":["keep a low profile","keep quiet","stay out of sight","lie low"],"phonetic":"/leɪ loʊ/","extraExplanation":["你输入的“layloc”不是常见英语单词，最可能是把常用短语“lay low”拼错了（发音也接近）。如果你原本想查的是别的词（例如“lay lock”“layloc”作为名字/产品/缩写），告诉我上下文句子，我可以按你的真实目标再解释。"]}
{"word":"laylock","summary":{"en":"Laylock is an old/dialect word for “lilac,” and it can also be a surname.","zh":"Laylock 是“lilac（丁香）”的古旧/方言拼写，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or dialect) a lilac plant or its pale purple flowers.","zh":"（古旧或方言）丁香（植物）或其淡紫色花。"},"examples":[{"en":"The garden smelled sweet with laylock in bloom.","zh":"花园里开着丁香，空气里都是甜香。"},{"en":"She picked a small branch of laylock and put it in a jar.","zh":"她摘了一小枝丁香，插在瓶里。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname): Laylock.","zh":"姓氏：Laylock。"},"examples":[{"en":"Mr. Laylock will join the meeting at 3 p.m.","zh":"Laylock 先生会在下午三点参加会议。"}]}],"synonyms":["lilac"],"phonetic":"/ˈleɪˌlɑk/","extraExplanation":["“laylock”常见于较早的英语拼写或地方用法（尤其在苏格兰/北英格兰语境中），相当于现代英语的“lilac（丁香）”。读到旧诗或旧小说时遇见“laylock”，一般可直接按“lilac”理解。"]}
{"word":"layman","summary":{"en":"A layman is a non-expert—someone without special training in a field.","zh":"layman 指“非专业人士/外行”，强调没有受过某领域的专业训练。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not trained or specialized in a particular subject; an ordinary person (especially not a professional in law, medicine, science, etc.)","zh":"外行；门外汉；非专业人士（尤指不属于法律、医学、科学等专业领域的人）"},"examples":[{"en":"As a layman, I find the medical terms confusing.","zh":"作为外行，我觉得这些医学术语很难懂。"},{"en":"The guide explains the rules in language a layman can understand.","zh":"这份指南用外行也能理解的语言解释了规则。"}]}],"synonyms":["layperson","non-expert","amateur","outsider"],"phonetic":"/ˈleɪmən/","extraExplanation":["“layman”来自“lay”（非神职的、世俗的）+ “man”。传统上指“非神职人员”，后来引申为“非专业人士”。在现代英语里常被用来强调“用通俗语言解释复杂内容”（例如：in layman’s terms）。","用法注意：它是比较传统的说法，有时会被认为不够性别中立；在更正式或更包容的语境中，可以用“layperson”或“non-expert”。"]}
{"word":"laymanship","summary":{"en":"Laymanship means the role or influence of laypeople (non-professionals, especially non-clergy), often in church life or governance.","zh":"Laymanship 指平信徒/外行（尤其非神职人员）在机构中的身份、作用或对治理的影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the status or role of laypeople (people who are not professionally trained or not part of the clergy) in an organization, especially in a church","zh":"（尤指教会中的）平信徒的身份或角色；非专业人士在某机构中的地位"},"examples":[{"en":"The parish encouraged greater laymanship in planning community events.","zh":"该教区鼓励平信徒更多参与社区活动的规划。"},{"en":"In many churches, laymanship includes teaching classes and helping lead services.","zh":"在许多教会中，平信徒的角色包括授课并协助带领礼拜。"}]},{"partOfSpeech":"n.","definition":{"en":"the idea or principle that laypeople should have influence or control in managing an organization (often contrasted with professional or clerical control)","zh":"平信徒/非专业人士应参与或主导管理的理念（常与专业人士或神职人员主导相对）"},"examples":[{"en":"Some members argued for laymanship in church governance to balance clerical authority.","zh":"一些成员主张在教会治理中加强平信徒参与，以平衡神职人员的权威。"},{"en":"The debate over laymanship focused on who should make final decisions.","zh":"关于“平信徒主导/参与”的争论集中在谁应做最终决定。"}]}],"synonyms":["laity","lay leadership","lay participation","lay involvement","nonprofessional involvement"],"phonetic":"/ˈleɪmənʃɪp/","extraExplanation":["“laymanship”由“lay（平信徒、外行的）+ -manship（……的身份/技艺/风范）”构成，常见于宗教或社团语境，强调“非神职/非专业者的参与与作用”。日常英语里更常用的说法是“lay people / laity（平信徒）”、“lay leadership（平信徒领导）”、“lay participation（平信徒参与）”。"]}
{"word":"laymen","summary":{"en":"Laymen are people who are not experts (or, in religion, not clergy).","zh":"laymen 指外行人/非专业人士；在宗教语境中也指平信徒（非神职人员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are not experts in a particular subject; ordinary people.","zh":"（在某一领域）外行人；非专业人士；普通人。"},"examples":[{"en":"The guide explains the science in a way that laymen can understand.","zh":"这本指南用外行人也能懂的方式解释科学。"},{"en":"For laymen, the medical terms in the report are confusing.","zh":"对外行人来说，报告里的医学术语很让人困惑。"}]},{"partOfSpeech":"n.","definition":{"en":"People who are not members of the clergy (in a religious context).","zh":"（宗教语境中）平信徒；非神职人员。"},"examples":[{"en":"The meeting included both clergy and laymen from the community.","zh":"会议包括神职人员和社区的平信徒。"},{"en":"Laymen often volunteer in church activities.","zh":"平信徒常常参与教会志愿活动。"}]}],"synonyms":["laypeople","non-experts","ordinary people","the general public","amateurs"],"phonetic":"/ˈleɪmən/","extraExplanation":["“layman / laymen”来自“lay”（非神职的、世俗的）这一用法。很多情况下它不带贬义，只是强调“不是专业人士/不是神职人员”。","现代英语中，“laymen”有时被认为偏男性化；更中性的说法常见有“laypeople”“non-experts”“the general public”。在正式写作里可以根据场合替换。"]}
{"word":"layne","summary":{"en":"Layne is mainly used as a personal name (first name) or a surname.","zh":"Layne 主要用作人名（名字）或姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (first name), used for any gender but more common as a masculine name in the U.S.","zh":"人名（名字），可用于任何性别，但在美国更常见作男性名。"},"examples":[{"en":"Layne is joining our class next week.","zh":"Layne 下周会加入我们班。"},{"en":"I met someone named Layne at the conference.","zh":"我在会议上认识了一个叫 Layne 的人。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Her last name is Layne.","zh":"她的姓是 Layne。"},{"en":"Dr. Layne will see you now.","zh":"Layne 医生现在可以见你了。"}]}],"synonyms":["Lane (common spelling variant)"],"phonetic":"/leɪn/","extraExplanation":["“Layne”常被视为“Lane”的变体拼写。它与英语里表示“（乡间）小路/车道”的词 lane（/leɪn/）在发音和联想上很接近，因此有时会让人联想到“道路、路径”。","作为名字时，拼写更独特，常见于现代英语姓名命名风格。"]}
{"word":"layner","summary":{"en":"“Layner” is usually a surname and not a common everyday English word.","zh":"“Layner”通常是姓氏，不是常见的日常英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare word in modern English; most often seen as a surname (family name). It is not a common standard spelling for an everyday English word.","zh":"现代英语中很少作为常用词出现；最常见的用法是作为姓氏（家族姓）。它不是日常英语里常见的标准拼写。"},"examples":[{"en":"Ms. Layner will lead the meeting today.","zh":"Layner 女士今天将主持会议。"},{"en":"I saw the name Layner on the roster.","zh":"我在名单上看到了 Layner 这个名字。"}]}],"synonyms":["(surname) no direct synonyms","learner (possible intended word)","liner (possible intended word)"],"phonetic":"/ˈleɪnər/","extraExplanation":["“layner”在英语里不常见，很多学习者输入它时，实际上可能想查：\n1) learner（学习者） /ˈlɝːnər/：a person who is learning something（正在学习的人）\n2) liner（内衬；班轮；眼线笔等） /ˈlaɪnər/：a protective inner layer; a ship/airline route; etc.\n如果你告诉我你想表达的中文意思或给我一句例句，我可以帮你确认你要的词是哪一个。"]}
{"word":"layoff","summary":{"en":"“Layoff” means a job loss caused by a company’s business/economic reasons; as a verb, “lay off” means to dismiss workers for those reasons.","zh":"“Layoff”指因公司经营或经济原因导致的裁员/失业；作动词短语“lay off”表示因这些原因裁员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation when a company stops employing one or more workers, usually because there is not enough work or money (not because of the worker’s fault).","zh":"（公司因工作量或资金不足等原因）解雇/裁员（通常不是员工个人过错）。"},"examples":[{"en":"The company announced a large layoff after sales dropped.","zh":"销量下滑后，公司宣布大规模裁员。"},{"en":"She survived the layoff, but several teammates lost their jobs.","zh":"她躲过了裁员，但好几位队友失去了工作。"},{"en":"They offered severance pay to employees affected by the layoff.","zh":"他们向受裁员影响的员工提供了遣散费。"}]},{"partOfSpeech":"vt.","definition":{"en":"To stop employing workers, usually temporarily or permanently, for economic reasons.","zh":"（因经济原因）裁员；解雇（可指暂时或永久）。"},"examples":[{"en":"The factory laid off 200 workers during the slow season.","zh":"淡季时，这家工厂裁掉了200名工人。"},{"en":"Many tech firms have laid off staff to cut costs.","zh":"许多科技公司为削减成本而裁员。"}]}],"synonyms":["redundancy (BrE)","job cut","downsizing","workforce reduction"],"phonetic":"/ˈleɪˌɔf/","extraExplanation":["在美式职场语境里，layoff 通常强调“非个人原因”的裁员（如经济下行、业务调整），因此比 fire（因表现或纪律问题被开除）更“中性”。常见搭配：mass layoff（大规模裁员）、temporary layoff（临时停工裁员）、layoff notice（裁员通知）、severance package/pay（遣散补偿）、be laid off（被裁）。","语法提醒：名词是 layoff；动词短语是 lay off（分开写）。例如：They will lay off workers. / The layoff was unexpected."]}
{"word":"layoffs","summary":{"en":"“Layoffs” usually means job cuts where employees are let go because of business reasons, not personal fault.","zh":"“Layoffs”通常指因经营或结构调整等原因而进行的裁员，并非员工个人过错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of ending employees’ jobs (usually because a company needs to cut costs or restructure, not because of individual performance).","zh":"裁员；解雇（通常因公司削减成本或重组，并非因为个人表现）。"},"examples":[{"en":"The company announced layoffs after sales fell for three quarters.","zh":"公司在连续三个季度销量下滑后宣布裁员。"},{"en":"Many workers worry about layoffs during an economic downturn.","zh":"在经济低迷时期，许多员工担心被裁员。"}]},{"partOfSpeech":"n.","definition":{"en":"A period when a worker is temporarily not working (often because there isn’t enough work), sometimes with the expectation of returning later.","zh":"（暂时）停工期；临时解雇期（常因工作不足，可能之后复工）。"},"examples":[{"en":"The factory had a two-week layoff due to a shortage of parts.","zh":"由于零部件短缺，工厂停工两周。"},{"en":"Seasonal layoffs are common in some industries like construction.","zh":"在建筑等行业，季节性停工/临时裁员很常见。"}]}],"synonyms":["job cuts","reductions","downsizing","workforce reductions"],"phonetic":"/ˈleɪˌɔfs/","extraExplanation":["“layoff”可数名词；“layoffs”是复数形式，常用于新闻标题和公司公告（e.g., “Mass layoffs” 大规模裁员）。","口语与正式用法：公司常说“reduce headcount / workforce reductions（缩减编制）”来委婉表达裁员；日常也会说“get laid off（被裁）”。注意与“get fired（被开除，多因个人原因）”区分。","常见搭配：announce/plan/avoid layoffs（宣布/计划/避免裁员）；layoffs hit/affect an industry（裁员冲击/影响某行业）；a round of layoffs（一轮裁员）。"]}
{"word":"layout","summary":{"en":"“Layout” most commonly means the arrangement/design of things on a page, screen, or in a space; as a verb, it means to arrange/design (often expressed as “lay out”).","zh":"“Layout”最常见指页面/屏幕/空间中的布局或版面；作动词时表示进行布局/排版，但日常更常用短语“lay out”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The way something is arranged or designed on a page, screen, or in a space (for example, the position of text, images, rooms, or furniture).","zh":"（页面、屏幕或空间中）布局；版面设计；（房间、家具等的）摆放方式。"},"examples":[{"en":"The website has a clean layout, so it’s easy to find information.","zh":"这个网站的版面很清爽，所以很容易找到信息。"},{"en":"We changed the layout of the living room to make more space.","zh":"我们调整了客厅的摆放方式来腾出更多空间。"}]},{"partOfSpeech":"v.","definition":{"en":"To arrange or design the parts of something, especially a page or document, so it looks clear and organized.","zh":"（尤指为页面或文件）进行排版；设计布局，使其清晰有条理。"},"examples":[{"en":"She laid out the report so the charts match the text.","zh":"她给报告排版，让图表与文字对应。"},{"en":"We need to layout the brochure before printing.","zh":"我们需要先把宣传册排版好再印刷。"}]}],"synonyms":["arrangement","design","format","plan","configuration"],"phonetic":"/ˈleɪ.aʊt/","extraExplanation":["用法提醒：在现代英语里，名词“layout”非常常见；动词更常用短语“lay out”（如：lay out a page / lay out a plan）。把“layout”当动词用在印刷/设计领域能见到，但在一般写作里用“lay out”更自然。"]}
{"word":"layouts","summary":{"en":"Layouts are the ways things are arranged—either in a physical space or in the design of a page/screen.","zh":"layouts 指“布局/版式”：既可指实体空间的摆放与规划，也可指页面或屏幕上的排版设计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The arrangement or plan of how things are placed in a space (for example, a room, building, garden, or city).","zh":"（空间中事物的）布局；布置方式；平面安排（如房间、建筑、花园或城市的规划）。"},"examples":[{"en":"I like the layout of this apartment—the kitchen is close to the living room.","zh":"我喜欢这套公寓的布局——厨房离客厅很近。"},{"en":"The museum’s layout makes it easy to follow the exhibits in order.","zh":"这家博物馆的布局让人很容易按顺序参观展品。"}]},{"partOfSpeech":"n.","definition":{"en":"The design and organization of text, images, and space on a page or screen (such as a website, app, or magazine).","zh":"（页面或屏幕上的）版式；排版；页面设计（如网站、应用或杂志）。"},"examples":[{"en":"This website has a clean layout with simple menus.","zh":"这个网站的版式很清爽，菜单也很简洁。"},{"en":"She tried several layouts for the poster before choosing one.","zh":"她为海报尝试了好几种排版后才选定一种。"}]}],"synonyms":["arrangement","design","plan","format","configuration"],"phonetic":"/ˈleɪaʊt/","extraExplanation":["“layouts”是“layout”的复数形式，表示“多个布局/多种版式”。在工作场景里常见：例如网页设计、平面设计、室内设计中说“different layouts”（不同的布局/不同方案）。","相关常见短语：page layout（页面排版）、floor layout（楼层平面布局）、keyboard layout（键盘布局）、layout design（版式/布局设计）。动词常用“lay out”（把……摆开/安排/设计），如：lay out a room（布置房间）、lay out a page（排版）。"]}
{"word":"layover","summary":{"en":"A layover is a temporary stop during a trip, most often the time between connecting flights.","zh":"layover 指旅途中（尤指转机航班之间）的临时停留时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short stay at an intermediate place during a journey (especially between flights) before continuing to the final destination.","zh":"旅途中在中途地点的短暂停留（尤指转机期间在机场停留），之后继续前往目的地。"},"examples":[{"en":"We have a three-hour layover in Chicago before our next flight.","zh":"我们在芝加哥有三个小时的转机停留，然后搭下一班飞机。"},{"en":"During the layover, you can grab food or change terminals.","zh":"转机停留期间，你可以吃点东西或换航站楼。"},{"en":"Is this a direct flight, or does it include a layover?","zh":"这是直飞吗，还是包含中途转机？"}]},{"partOfSpeech":"n.","definition":{"en":"A period when a vehicle, crew, or worker is temporarily not in active use or operation; downtime.","zh":"（车辆、机组或员工的）暂时停用期；停工/空闲时间。"},"examples":[{"en":"The bus had a layover at the depot before starting the next route.","zh":"公交车在车库停靠一段时间，然后开始下一趟线路。"},{"en":"The crew gets a short layover between shifts.","zh":"机组在轮班之间有一段短暂的休息时间。"}]}],"synonyms":["connection","stop (temporary)","break","downtime"],"phonetic":"/ˈleɪˌoʊvər/","extraExplanation":["在旅行语境里，layover 常与 stopover 对比：layover 通常指较短的转机停留（常见为不到24小时），stopover 往往更长，甚至像“中途顺便玩一两天”。航空公司与国家/地区规定不完全一致，但日常交流里可以用“short layover / long layover”来表达时间长短。","常见搭配：long/short layover（长/短转机）、overnight layover（过夜转机）、have a layover in + 城市（在某地转机）、layover time（转机时长）、layover flight（有转机的航班）。"]}
{"word":"layovers","summary":{"en":"Layovers are short stops or waiting times between parts of a trip, especially between flights.","zh":"layovers 指旅途中两段行程之间的短暂停留或转机等待时间（尤指航班之间）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short stay at an airport (or sometimes in a city) between parts of a journey, usually while waiting for the next flight, train, or bus.","zh":"（旅途中）中途停留、转机等待时间（多指在机场，有时也指在城市短暂停留）。"},"examples":[{"en":"We have a two-hour layover in Chicago before our next flight.","zh":"我们在芝加哥有两个小时的转机停留时间，然后搭下一班飞机。"},{"en":"Because of the long layover, I left the airport to get dinner.","zh":"因为转机时间很长，我离开机场去吃了晚饭。"}]},{"partOfSpeech":"n.","definition":{"en":"The time period you spend waiting between connections during a trip.","zh":"（旅途中）两段行程之间等待衔接的那段时间。"},"examples":[{"en":"Try to choose an itinerary with a short layover.","zh":"尽量选转机等待时间短的行程。"},{"en":"Our layovers were long, so the trip felt tiring.","zh":"我们的中途等待时间很长，所以旅程感觉很累。"}]}],"synonyms":["stopover","connection","transfer","waiting time"],"phonetic":"/ˈleɪˌoʊvər/","extraExplanation":["“layover”在旅行英语里非常常见，通常指“需要换乘/转机而造成的停留”。如果只是飞机在途中短暂停一下但你不下机、也不换航班，更常用“stopover/technical stop”等说法（具体看航空公司用词）。","用法提示：常说“a layover in + 城市/机场”或“a 3-hour layover”。复数“layovers”表示多个中途停留。"]}
{"word":"laypeople","summary":{"en":"Laypeople are non-experts—the general public without specialized training in a field.","zh":"laypeople指非专业人士/外行人，即没有某领域专门训练的一般大众。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ordinary people who are not experts or professionals in a particular field (especially not trained in law, medicine, science, or religion).","zh":"外行人；非专业人士（尤其指未受过法律、医学、科学或宗教等专业训练的普通人）。"},"examples":[{"en":"The report was written for laypeople, not scientists.","zh":"这份报告是写给外行人看的，不是写给科学家的。"},{"en":"Doctors should explain test results in language laypeople can understand.","zh":"医生应该用外行人也能听懂的语言解释检查结果。"},{"en":"A judge may summarize complex legal terms so laypeople on the jury can follow.","zh":"法官可能会概括复杂的法律术语，好让陪审团中的外行人能听懂。"}]}],"synonyms":["non-experts","the general public","ordinary people","nonprofessionals","civilians"],"phonetic":"/ˈleɪˌpiːpəl/","extraExplanation":["“laypeople”是“layperson”的复数形式。单数可用“a layperson”，复数常见写法有“laypeople”（更常用）或“lay persons”（较正式）。","“lay-”在这里表示“非专业的、非神职的”。在宗教语境中，laypeople指“平信徒”（相对于clergy神职人员）。在医学、法律、科技等语境中，则更常指“外行人/一般大众”。","用法提示：在一些场合也可用更口语的表达“ordinary people / the general public”。不过“laypeople”更强调“不是该领域的专家”。"]}
{"word":"layperson","summary":{"en":"A layperson is someone who is not an expert in a particular field.","zh":"layperson 指某个领域的外行、非专业人士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a trained expert or professional in a particular subject (especially in fields like law, medicine, religion, or science)","zh":"（某领域的）外行；非专业人士（尤指法律、医学、宗教或科学等领域）"},"examples":[{"en":"As a layperson, I find medical reports hard to understand.","zh":"作为外行，我觉得医学报告很难看懂。"},{"en":"The guide explains the law in language that a layperson can follow.","zh":"这本指南用外行也能理解的语言解释法律。"},{"en":"The professor tried to describe the research so a layperson could appreciate it.","zh":"教授尽量用外行也能理解的方式来介绍这项研究。"}]}],"synonyms":["nonexpert","amateur","outsider","novice","civilian"],"phonetic":"/ˈleɪˌpɝsən/","extraExplanation":["“layperson”中的“lay-”来自“laity”（平信徒/非神职人员），最初用于宗教语境，指非神职人员；后来引申为任何领域的“非专业人士”。","常见搭配：for a layperson（对外行来说）、to a layperson（在外行看来）、in layperson’s terms / in plain English（用通俗易懂的话）。注意：更常见的表达是“in layman’s terms”，但“layperson”更中性、更包容。"]}
{"word":"layrock","summary":{"en":"“lay rock” means to place rocks/stones for construction or protection; “layrock” as one word is uncommon and often a name.","zh":"“lay rock”指为建造或防护而铺放石块；连写“layrock”不常见，多见于名称（如姓氏/品牌/地名）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to place rocks/stones on the ground in order to build or protect something (e.g., a wall, path, shoreline)","zh":"铺放/摆放石块以建造或保护某物（如石墙、石径、护岸）"},"examples":[{"en":"Workers laid rock along the riverbank to prevent erosion.","zh":"工人们在河岸铺放石块以防止水土流失。"},{"en":"We’re going to lay rock for a simple garden path this weekend.","zh":"这周末我们要铺石子做一条简单的花园小路。"}]},{"partOfSpeech":"other","definition":{"en":"(rare/nonstandard as one word) “layrock” may appear as a surname, brand name, or place name; meaning depends on context","zh":"（罕见/非标准的连写形式）“layrock”可能是姓氏、品牌名或地名；具体含义取决于语境"},"examples":[{"en":"Layrock is listed as the contractor on the project documents.","zh":"项目文件上把 Layrock 列为承包商。"}]}],"synonyms":["lay stones","place rocks","spread gravel","install riprap"],"phonetic":"/leɪ rɑk/","extraExplanation":["在标准英文里更常写作两个词：lay rock。也常见更具体的表达：lay stones（铺石块）、lay gravel（铺碎石）、rock lining / riprap（护岸块石，常用于防冲刷）。","注意：lay 是不规则动词：lay–laid–laid（放置）；不要和 lie–lay–lain（躺）混淆。比如：I lay the rocks today. / I laid them yesterday. / They have been laid. "]}
{"word":"lays","summary":{"en":"“Lays” most commonly means “puts/places” (he/she lays something down) or “produces eggs.” It can also be the plural of a literary word meaning “songs/ballads.”","zh":"“lays”最常见是动词：表示“放置/摆放”或“产卵”。也可作名词复数（文学用法），表示“歌谣/叙事诗”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Third-person singular present of “lay”: to put or place something down in a flat or careful position.","zh":"“lay”的第三人称单数现在时：把某物放下、摆放（通常平放或小心放置）。"},"examples":[{"en":"He lays the book on the table every night.","zh":"他每天晚上把书放在桌子上。"},{"en":"She lays a blanket on the grass before the picnic.","zh":"野餐前她把毯子铺在草地上。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular present of “lay”: (of a bird, insect, etc.) to produce and leave eggs.","zh":"“lay”的第三人称单数现在时：（鸟、昆虫等）产卵。"},"examples":[{"en":"This chicken lays eggs almost every day.","zh":"这只母鸡几乎每天都下蛋。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “lay” (literary): a short song or narrative poem, often with a traditional or old-fashioned feeling.","zh":"“lay”的复数（文学用法）：短歌或叙事诗，常带有传统/古风的感觉。"},"examples":[{"en":"The book collects old lays and legends from the region.","zh":"这本书收集了当地古老的歌谣与传说。"}]}],"synonyms":["places","puts","sets","deposits (eggs)","songs","ballads"],"phonetic":"/leɪz/","extraExplanation":["学习者常把 lay 和 lie 搞混：lay 后面通常要接宾语（lay + something，比如 lay the phone down）；lie 不接宾语，表示“躺/位于”（I lie down）。现在时第三人称：he/she lays vs he/she lies；过去式：laid vs lay。","注意大写的 “Lay’s” 常指薯片品牌（Lay’s potato chips），和动词 lays（放置/产卵）不是一回事。"]}
{"word":"layshaft","summary":{"en":"A layshaft is a secondary shaft in a gearbox (countershaft) used to transmit power through gears.","zh":"Layshaft 指变速箱里的副轴/中间轴（countershaft），用于通过齿轮传递动力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secondary shaft in a gearbox (also called a countershaft) that transfers power from the input shaft to the output shaft through gears","zh":"（变速箱中的）副轴/中间轴（也叫 countershaft 传动轴），通过齿轮把动力从输入轴传递到输出轴"},"examples":[{"en":"In a manual transmission, the layshaft carries several gears that mesh with the gears on the main shaft.","zh":"在手动变速箱中，副轴上装有多个齿轮，与主轴上的齿轮啮合。"},{"en":"Wear on the layshaft bearings can cause whining noises when you change gears.","zh":"副轴轴承磨损会导致换挡时出现尖啸声。"}]}],"synonyms":["countershaft","secondary shaft"],"phonetic":"/ˈleɪˌʃæft/","extraExplanation":["“Layshaft”在英式工程/汽车英语里更常见；在美式语境中更常用“countershaft”。两者在多数变速箱讨论中可互换，但具体结构仍以图纸/说明书为准。","词源上可理解为“lay + shaft”（放置的/从属的轴）：它通常相对主轴（main shaft）而言，是承担中间传递与变速比实现的那根轴。"]}
{"word":"layship","summary":{"en":"Layship is a rare noun meaning the status of being a layperson (not clergy or not a professional specialist).","zh":"Layship 是个较罕见的名词，指“平信徒/外行人的身份或状态”（非神职或非专业人士）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the status or condition of being a layperson (not a member of the clergy or a professional specialist).","zh":"（罕见）平信徒/外行人的身份或状态（指非神职人员或非专业人士）。"},"examples":[{"en":"In some church writings, layship is contrasted with clergy authority.","zh":"在一些教会文献中，“layship”会与神职人员的权威形成对照。"},{"en":"He wrote about the value of layship in community decision-making.","zh":"他写到平信徒身份在社区决策中的价值。"}]}],"synonyms":["laity","lay status","laypeople","laymanship"],"phonetic":"/ˈleɪʃɪp/","extraExplanation":["“layship”不是现代英语里的常用词，更多见于较老或较小众的宗教/社会语境。日常表达通常用：the laity（平信徒群体）、lay status（平民/非专业身份）、laypeople（平信徒/非专业人士）。","词尾 -ship 表示“身份、地位、状态或关系”（如 friendship 友谊、leadership 领导力）。因此 layship 直观上就是“lay（平信徒/外行）+ -ship（身份）”。"]}
{"word":"laystall","summary":{"en":"Laystall means an old-fashioned waste dump or dungheap.","zh":"Laystall 指（旧用的）垃圾或粪肥等废弃物的堆放处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where garbage, manure, or other waste is thrown; a dungheap or refuse dump (old-fashioned).","zh":"（旧用）垃圾、粪肥等废弃物堆放处；粪堆；垃圾堆放点。"},"examples":[{"en":"In older towns, a laystall might be kept outside the city walls to collect manure and rubbish.","zh":"在较早的城镇里，常会在城墙外设一个laystall来集中堆放粪肥和垃圾。"},{"en":"The alley smelled like a laystall after the rain.","zh":"雨后那条小巷闻起来像垃圾粪堆一样难闻。"}]}],"synonyms":["dump","rubbish heap","refuse heap","dungheap","manure pile"],"phonetic":"/ˈleɪˌstɔl/","extraExplanation":["这是一个较少见、偏英式且带有历史感的词，常见于较早的文学或历史描写中。","词源上可理解为“lay（放置）+ stall（场所/固定地点）”，即“把废物放在固定地点”的意思；现代英语更常用 dump、rubbish heap、manure pile 等表达。"]}
{"word":"laystow","summary":{"en":"“laystow” is not a standard English word; it’s likely a misspelling or a name.","zh":"“laystow”不是标准英语词汇；更可能是拼写错误或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username. If you meant something else, please share the sentence you saw it in.","zh":"不是标准英语单词，可能是拼写错误，或是名字/用户名。如果你是想查别的词，请把它出现的句子发我。"},"examples":[{"en":"I can’t find “laystow” in a dictionary—could you show me the sentence where it appears?","zh":"我在词典里找不到“laystow”，你能把它出现的句子发我吗？"}]}],"phonetic":"/ˈleɪstoʊ/","extraExplanation":["“laystow”看起来像把两个词拼在一起，最可能的相关词有：\n1) stow（把东西收好/放好；常用于行李、装备）：Please stow your bag under the seat.（请把包放到座位下面。）\n2) lay to（航海用语：船迎风停住/减速以保持位置）：The boat lay to in the storm.（船在风暴中迎风停住。）\n如果你告诉我语境（在哪本书/哪句话/想表达什么），我可以帮你确定它到底应该是哪一个词或短语。"]}
{"word":"laytime","summary":{"en":"Laytime is the contractually allowed time to load or unload a ship in shipping.","zh":"Laytime指航运租船合同中约定的装卸船允许时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Shipping) The time allowed in a charter party (shipping contract) for loading and/or unloading a vessel at a port, without extra charges.","zh":"（航运）在租船合同中规定的装货和/或卸货的允许时间；在该时间内完成通常不会产生额外费用。"},"examples":[{"en":"The charter party sets laytime at five days for loading.","zh":"租船合同规定装货允许时间（laytime）为五天。"},{"en":"If the terminal exceeds the laytime, the charterer may have to pay demurrage.","zh":"如果码头作业超过允许时间（laytime），承租方可能需要支付滞期费（demurrage）。"}]}],"synonyms":["loading time","unloading time","allowed time (in a charter)"],"phonetic":"/ˈleɪˌtaɪm/","extraExplanation":["“Laytime”是国际航运与海商法中的常用术语，常见于租船合同（charter party）。它通常按“工作日/连续日”“是否包含周末与节假日”等规则计算。","与laytime紧密相关的两个概念是：demurrage（滞期费：超过laytime的罚金/补偿）与despatch（速遣费：提前完成装卸可能获得的奖励，视合同约定）。"]}
{"word":"layup","summary":{"en":"“Layup” most commonly means an easy close-range basketball shot; it can also mean something that’s very easy or almost guaranteed to succeed.","zh":"“Layup”最常指篮球的“上篮”；也可引申为“轻而易举的事/稳胜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple shot in basketball made very close to the basket, usually by taking one or two steps and gently placing the ball off the backboard","zh":"（篮球）上篮：在篮筐附近用一两步把球轻轻放进篮筐（常借助篮板）的投篮"},"examples":[{"en":"He drove to the hoop and finished with an easy layup.","zh":"他突破到篮下，轻松上篮得分。"},{"en":"Practice right-hand and left-hand layups every day.","zh":"每天练习右手和左手上篮。"}]},{"partOfSpeech":"n.","definition":{"en":"something very easy to do or achieve; a sure win or obvious success","zh":"轻而易举的事；稳胜、十拿九稳的成功"},"examples":[{"en":"With her experience, the interview was a layup.","zh":"凭她的经验，这次面试简直是小菜一碟。"},{"en":"They thought the game would be a layup, but the other team fought hard.","zh":"他们以为这场比赛稳赢，没想到对手拼得很凶。"}]}],"synonyms":["easy win","sure thing","slam dunk (informal, figurative)","basketball lay-in"],"phonetic":"/ˈleɪ.ʌp/","extraExplanation":["“Layup”原本是篮球术语（lay + up：把球“放上去”），后来在美式英语里常被引申为“很容易的事/稳胜”。口语里也常说“a layup”或“an easy layup”。"]}
{"word":"layups","summary":{"en":"“Layups” is the plural of “layup,” meaning a basketball close-range shot, or (informally) something very easy.","zh":"“Layups”是“layup”的复数：可指篮球的“上篮”，也可口语指“轻而易举的事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Basketball) A close-range shot made by laying the ball softly off the backboard or into the hoop, usually while moving toward the basket.","zh":"（篮球）上篮；球员在靠近篮筐时边移动边将球轻放入篮筐或擦板命中的投篮。"},"examples":[{"en":"He scored two layups in a row on the fast break.","zh":"他在快攻中连续完成了两次上篮得分。"},{"en":"Practice layups with both hands to finish through traffic.","zh":"练习左右手上篮，才能在防守干扰下完成终结。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Something very easy to do; an easy win or simple task.","zh":"（非正式）轻而易举的事；稳拿的胜利/简单任务。"},"examples":[{"en":"The first question was a layup, but the rest were harder.","zh":"第一题是送分题，但后面的更难。"},{"en":"Against that team, it felt like a layup.","zh":"对上那支队，感觉就是轻松拿下。"}]}],"synonyms":["easy shot","close-range shot","gimme","softball","easy win"],"phonetic":"/ˈleɪˌʌp/","extraExplanation":["“Layup”原本是篮球术语，常见搭配有：do/make a layup（上篮）、miss a layup（上空篮）、easy layup（轻松上篮）、driving layup（突破上篮）、left-handed/right-handed layup（左/右手上篮）。","引申义“很容易的事”在美式口语里很常用，语气类似于“送分题/稳了”，但也可能带一点“太简单了”的感觉。"]}
{"word":"laywoman","summary":{"en":"A laywoman is a woman who is not clergy; an ordinary female member of a church (sometimes, a non-expert woman).","zh":"laywoman 指非神职人员的女性平信徒；有时也可指非专业人士（女性外行）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who is not a member of the clergy or a religious order; an ordinary (non-expert) member of a church.","zh":"（宗教）平信徒女性；非神职人员、非修会成员的普通女性信徒。"},"examples":[{"en":"As a laywoman, she helps lead the church choir but isn’t clergy.","zh":"作为一名平信徒女性，她协助带领教会诗班，但并不是神职人员。"},{"en":"The article was written for laywomen and laymen, not for theologians.","zh":"这篇文章是写给普通信徒（男女平信徒）的，不是写给神学家看的。"}]}],"synonyms":["layperson","laywoman (female layperson)","non-clergy member"],"phonetic":"/ˈleɪˌwʊmən/","extraExplanation":["“lay-”在这里不是“躺下”的 lay，而是表示“非专业/非神职”的“平信徒”。对应词有 layman（男平信徒）与 layperson（性别中立，更常用、更现代）。","在一些宗教或学术语境里，layperson 也可泛指“外行/非专业人士”。因此 laywoman 有时也会被用来强调“非专业的女性”，但最常见仍是宗教语境。"]}
{"word":"laywomen","summary":{"en":"“Laywomen” means women who are not clergy or not professionals in a field (plural of “laywoman”).","zh":"“Laywomen”指平信徒女性或某领域的非专业女性，是“laywoman”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women who are not members of the clergy or not trained as professionals in a particular field; plural of “laywoman.”","zh":"平信徒女性；（特定领域中）非专业女性。“laywoman”的复数。"},"examples":[{"en":"The hospital chaplain spoke with laywomen as well as priests and nuns.","zh":"医院牧师不仅与神父和修女交谈，也与平信徒女性交谈。"},{"en":"The program teaches basic legal rights for laywomen who are not lawyers.","zh":"该项目为不是律师的非专业女性讲解基本法律权利。"}]}],"synonyms":["laywomen","laypeople","laypersons","nonprofessionals","non-clergy (religious context)"],"phonetic":"/ˈleɪˌwɪmɪn/","extraExplanation":["“lay-”在宗教语境里常指“非神职人员/非教士”。因此 laywoman/laywomen 常与 clergy（神职人员）、priest（神父/牧师）、nun（修女）等对照使用。","在一般语境里，layperson（非专业人士）更常见，也更中性；如果不是强调性别，很多场合用 laypeople 或 laypersons 更自然。"]}

