{"word":"laz","summary":{"en":"“laz” is usually an informal texting shortcut for “lazy/laze.” Capitalized “Laz” refers to the Laz people.","zh":"“laz”通常是聊天中“lazy/laze”的非正式缩写；首字母大写“Laz”指拉兹人（一个民族）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, mainly in texting) Short for “lazy” or “laze,” often used to describe someone who doesn’t want to do work or prefers to rest.","zh":"（非正式，多见于短信/聊天）“lazy（懒的）”或“laze（闲着、偷懒）”的缩写，常用来形容不想做事、只想休息的状态/人。"},"examples":[{"en":"I’m feeling laz today—can we order takeout?","zh":"我今天有点懒——我们点外卖可以吗？"},{"en":"Stop being laz and finish your homework.","zh":"别偷懒了，把作业写完。"}]},{"partOfSpeech":"n.","definition":{"en":"Laz (capitalized): a member of the Laz people, an ethnic group mainly from the Black Sea region (especially northeastern Turkey and parts of Georgia).","zh":"Laz（首字母大写）：拉兹人；一个主要分布在黑海地区的民族（尤其在土耳其东北部及格鲁吉亚部分地区）。"},"examples":[{"en":"She is Laz, and her family comes from the Black Sea coast.","zh":"她是拉兹人，家族来自黑海沿岸。"}]}],"synonyms":["lazy (informal meaning)","sluggish","idle"],"phonetic":"/læz/","extraExplanation":["在英语里，小写“laz”并不是标准词典用词，更像网络口语/缩写；在正式写作中建议用“lazy”（形容词）或“laze around”（动词短语，指闲散、无所事事）。","注意大小写：小写“laz”常被理解为“lazy”的缩写；大写“Laz”更可能指民族/族群名称。"]}
{"word":"lazar","summary":{"en":"Lazar is usually a male name; in archaic English, lazar can mean a leper or a very poor sick beggar.","zh":"Lazar 通常是男性名字；在古英语/文学语境里，lazar 也可指麻风病人或贫病交加的乞者。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (used especially in Eastern Europe), related to the biblical name Eleazar","zh":"男性名字（在东欧较常见），与《圣经》名字 Eleazar（以利亚撒）同源"},"examples":[{"en":"Lazar is a common name in some Balkan countries.","zh":"Lazar 在一些巴尔干国家是比较常见的名字。"},{"en":"We met a musician named Lazar at the festival.","zh":"我们在音乐节上认识了一位叫 Lazar 的音乐人。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) a leper, or more generally a very poor sick person or beggar","zh":"（古义）麻风病人；也可泛指贫病交加的人或乞丐"},"examples":[{"en":"In old texts, “lazar” could mean a leper kept away from the town.","zh":"在古老文本中，“lazar”有时指被隔离在城镇外的麻风病人。"},{"en":"The poem describes a lazar at the gate asking for food.","zh":"诗中描写了一位在门口讨食的贫病之人。"}]}],"synonyms":["(archaic) leper","(dated) beggar"],"phonetic":"/ˈlæzər/","extraExplanation":["“lazar”这个古义名词来自《新约》里“乞丐拉撒路（Lazarus）”的故事，因此在中世纪英语里逐渐引申为“麻风病人/穷病之人”。现代英语中这个用法很少见，更多是出现在文学作品或历史语境里。","如果你本来想查的是“laser（激光）”，拼写是 laser，读音 /ˈleɪzər/，意思与“lazar”完全不同。"]}
{"word":"lazaret","summary":{"en":"A lazaret is a place for quarantine, especially near ports; it can also mean a small isolation/storage compartment on a ship.","zh":"lazaret 指（多在港口附近的）检疫隔离所；也可指船上的隔离/储物小隔舱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quarantine station (often near a port) where people, animals, or goods are isolated to prevent the spread of infectious disease","zh":"（常在港口附近的）检疫隔离所；用于隔离人员、动物或货物以防传染病传播的场所"},"examples":[{"en":"During the outbreak, arriving passengers were sent to the lazaret for medical checks.","zh":"疫情暴发期间，抵达的乘客被送到检疫隔离所以进行健康检查。"},{"en":"The old lazaret stood on a small island outside the harbor.","zh":"那座旧检疫隔离所坐落在港外的一座小岛上。"}]},{"partOfSpeech":"n.","definition":{"en":"(also “lazarette”) a small compartment on a ship used for isolation, storage, or sometimes medical purposes","zh":"（亦作 lazarette）船上的小隔舱；用于隔离、储物，或有时作简易医疗用途"},"examples":[{"en":"They stored emergency supplies in the lazaret at the stern.","zh":"他们把应急物资存放在船尾的隔舱里。"},{"en":"The sailor was kept apart in the lazaret until the fever passed.","zh":"那名水手被安置在隔舱里隔离，直到退烧。"}]}],"synonyms":["lazaretto","quarantine station","isolation ward"],"phonetic":"/ˌlæzəˈrɛt/","extraExplanation":["“lazaret”与更常见的“lazaretto”同源，词根与《圣经》中的拉撒路（Lazarus）有关；中世纪欧洲常把麻风病人或疑似传染者集中隔离，因此许多港口城市设有专门的“lazaret”。","词语在文学与历史叙述中常用来营造“隔离、瘟疫、边界”的氛围；例如描写港口检疫、流亡与疾病的作品里会出现这一意象。"]}
{"word":"lazarets","summary":{"en":"“Lazarets” are quarantine stations or isolation hospitals (plural of lazaret), often mentioned in historical contexts.","zh":"“lazarets”是“lazaret”的复数，指检疫站或隔离医院，常见于历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quarantine station or isolation hospital, especially near a port, where people (and sometimes goods) are kept to prevent the spread of disease","zh":"（尤指港口附近的）检疫站；隔离医院（用于防止疾病传播）"},"examples":[{"en":"The ship was ordered to stop, and the crew were sent to the lazaret for inspection.","zh":"那艘船被命令停靠，船员被送到检疫站接受检查。"},{"en":"During the outbreak, travelers stayed in lazarets before entering the city.","zh":"在疫情暴发期间，旅客在进城前要先住进隔离站。"}]}],"synonyms":["quarantine station","isolation hospital","quarantine facility","pesthouse"],"phonetic":"/ˈlæzəˌrɛt/","extraExplanation":["“lazaret”(也常见作“lazaretto”)多用于历史或文学语境，指旧时港口的隔离设施，类似今天的“quarantine facility”。","词源与《圣经》中“拉撒路/Lazarus”有关：中世纪欧洲常用“Lazar house”指收容麻风病人的医院，后来逐渐引申为各种传染病的检疫隔离场所。","拼写提示：你输入的“lazarets”是复数形式；单数为“lazaret”。"]}
{"word":"lazarette","summary":{"en":"A lazarette is a quarantine place—either a shore-based quarantine station or an isolation/hospital area on a ship.","zh":"lazarette 指用于防疫隔离的地方：可以是岸上的检疫站，也可以是船上的隔离/病房区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A quarantine station (often near a port or on an island) where sick travelers or goods were isolated to prevent the spread of disease.","zh":"（常在港口附近或岛上的）检疫站；隔离站，用于隔离病人或货物以防疫病传播。"},"examples":[{"en":"In the 1800s, ships sometimes had to stop at the lazarette before anyone could enter the city.","zh":"在19世纪，船只有时必须先在检疫站停靠，才能让乘客进入城市。"},{"en":"The authorities sent the crew to the lazarette after signs of fever appeared on board.","zh":"船上出现发热迹象后，当局把船员送往检疫站隔离。"}]},{"partOfSpeech":"n.","definition":{"en":"A sick bay or isolation room on a ship (especially on older ships).","zh":"（尤指旧式船只上的）病房；隔离舱。"},"examples":[{"en":"The injured sailor was carried down to the lazarette for treatment.","zh":"受伤的水手被抬到船上的病房接受治疗。"},{"en":"They kept contagious patients in the lazarette until the doctor said it was safe.","zh":"他们把传染病患者留在隔离舱里，直到医生说安全为止。"}]}],"synonyms":["quarantine station","isolation ward","sick bay","infirmary"],"phonetic":"/ˌlæzəˈrɛt/","extraExplanation":["“lazarette”来自中世纪与“leper（麻风病人）”隔离有关的历史传统，常与圣拉撒路（St. Lazarus）相关联；因此它常出现在港口检疫、航海史和瘟疫题材的文学/历史叙述中。现代英语更常用“quarantine station”“isolation ward”等表达，但在历史语境里“lazarette”很常见。"]}
{"word":"lazaretto","summary":{"en":"A lazaretto is a quarantine station or isolation building, especially historically near ports, used to prevent the spread of contagious disease.","zh":"lazaretto 指检疫站或隔离设施，尤指历史上港口附近用来防止传染病扩散的隔离所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quarantine station (often near a port) where travelers, sailors, or goods are kept in isolation to prevent the spread of disease","zh":"（常在港口附近的）检疫站/隔离站；用于隔离旅客、水手或货物以防止疾病传播"},"examples":[{"en":"In the 1800s, ships suspected of carrying cholera were sent to the lazaretto before anyone could enter the city.","zh":"在19世纪，疑似携带霍乱的船只会先被送到检疫站，人员不能直接进城。"},{"en":"The island served as a lazaretto during outbreaks, keeping the sick separated from the mainland.","zh":"疫情暴发时，这座岛被用作隔离站，让病人远离大陆。"}]},{"partOfSpeech":"n.","definition":{"en":"a building or hospital area used to isolate people with contagious diseases","zh":"（医院或其他机构内的）传染病隔离病房/隔离区"},"examples":[{"en":"The old fort was converted into a lazaretto for patients with infectious fevers.","zh":"这座旧堡垒被改造成传染病患者的隔离区。"},{"en":"Historical records describe a small lazaretto next to the city gates.","zh":"史料记载城门旁有一处小型隔离所。"}]}],"synonyms":["quarantine station","isolation ward","quarantine hospital","pesthouse"],"phonetic":"/ˌlæzəˈrɛtoʊ/","extraExplanation":["词源上来自意大利语 *lazzaretto*，常与《圣经》中的“拉撒路（Lazarus）”相关联；在中世纪到近代早期，欧洲港口城市常设“lazaretto”用于防鼠疫、霍乱等传染病扩散。","该词带有明显的历史/文学色彩，现代日常英语里更常用 *quarantine station*, *isolation ward* 等表达。"]}
{"word":"lazarettos","summary":{"en":"Lazarettos are quarantine stations/hospitals used to isolate people with contagious diseases, especially in port areas.","zh":"lazarettos 指用于隔离传染病患者的检疫站/隔离医院，常见于港口或岛上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"quarantine stations or hospitals (often on islands or near ports) used to isolate people—especially sailors or travelers—with contagious diseases","zh":"（常设在港口附近或岛上的）隔离站；检疫所；传染病隔离医院（尤用于隔离水手或旅客）"},"examples":[{"en":"In the past, ships arriving with illness could be sent to lazarettos before anyone was allowed to enter the city.","zh":"过去，若船上有人生病，常会先被送往隔离站检疫，之后才允许进城。"},{"en":"The old lazarettos on the island are now historical sites.","zh":"岛上的旧隔离站如今成了历史遗址。"}]},{"partOfSpeech":"other","definition":{"en":"plural of lazaretto","zh":"lazaretto 的复数形式"},"examples":[{"en":"Several Mediterranean ports maintained lazarettos to prevent epidemics.","zh":"一些地中海港口设有多个隔离站来防止疫情扩散。"}]}],"synonyms":["quarantine station","isolation hospital","pesthouse"],"phonetic":"/ˌlæzəˈrɛtoʊ/","extraExplanation":["这个词常与海港检疫史相关：中世纪到近代，欧洲港口城市为防鼠疫、霍乱、黄热病等传播，会在港外（常是小岛）设“lazaretto”让旅客与货物隔离观察一段时间（如 40 天的“quarantine”传统）。","词源常被认为与《圣经》人物拉撒路（Lazarus）及“麻风病人收容所”的历史联想有关，因此带有“疾病隔离/收治”的色彩。"]}
{"word":"lazarist","summary":{"en":"A Lazarist is a member of the Catholic Congregation of the Mission (Vincentians), known for preaching and charitable work.","zh":"Lazarist 指天主教遣使会（文生会）的成员，以宣讲与慈善服务闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Roman Catholic religious order called the Congregation of the Mission (also known as the Vincentians), founded by Saint Vincent de Paul, traditionally devoted to preaching and charity, especially among the poor","zh":"天主教修会“遣使会”（又称“文生会 / 文生会士”）的成员；该会由圣文生·德·保禄创立，传统上以宣讲与慈善服务贫困者为重"},"examples":[{"en":"A Lazarist priest helped run the local school and free clinic.","zh":"一位遣使会（Lazarist）神父协助经营当地学校和免费诊所。"},{"en":"The university was founded by Lazarists and still keeps some of their traditions.","zh":"这所大学由遣使会士创办，至今仍保留一些他们的传统。"}]}],"synonyms":["Vincentian","member of the Congregation of the Mission"],"phonetic":"/ˈlæzərɪst/","extraExplanation":["“Lazarist”常被用来指“遣使会（Congregation of the Mission）”的会士。英语里也常见同义称呼“Vincentian（文生会士）”，来源于创立者Saint Vincent de Paul（圣文生·德·保禄）。","词源与“Lazarus（拉匝禄）”有关：该修会早期在巴黎一处名为Saint-Lazare的修院/住所活动，因此得名“Lazarists”。","在不同国家与语境中，“Lazarist”与“Vincentian”多可互换；若谈到具体学校或机构（如某些学院、修院），通常会用其历史上常用的称呼。"]}
{"word":"lazarlike","summary":{"en":"Lazarlike usually means “like Lazarus”—a dramatic return or recovery, as if rising from the dead; less commonly, it can mean miserably poor or sickly.","zh":"Lazarlike 通常指“像拉撒路一样”——仿佛起死回生般的复出或康复；较少见时也可指贫病凄苦、病弱不堪。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often literary) Like Lazarus; seeming to come back from death or near-death, or to return unexpectedly after being gone for a long time.","zh":"（常用于文学/修辞）像拉撒路一样；仿佛从死亡或濒死中复活，或在消失很久后出人意料地回归。"},"examples":[{"en":"After weeks in the hospital, he made a Lazarlike recovery and walked into the room on his own.","zh":"在医院住了几周后，他出现了“拉撒路式”的康复，自己走进了房间。"},{"en":"The old theater had a Lazarlike return, reopening after everyone thought it was finished.","zh":"那家老剧院“拉撒路式”地回归了——在大家都以为它完了之后又重新开张。"}]},{"partOfSpeech":"adj.","definition":{"en":"Like a poor, sick beggar (an older sense, from “lazar”); extremely wretched or disease-marked.","zh":"像贫病交加的乞者（较旧义，来自“lazar”）；极其凄惨或病容明显的。"},"examples":[{"en":"He described the refugees in Lazarlike conditions, needing food and medical care.","zh":"他形容难民处于“拉撒路式”的境况，急需食物和医疗救助。"}]}],"synonyms":["resurgent","reborn","revived","resurrected","miraculous","comeback"],"phonetic":"/ˈlæzɚˌlaɪk/","extraExplanation":["“Lazarlike”来自《圣经》里“拉撒路”的意象，最常见的是《约翰福音》中耶稣使拉撒路复活，因此常用来形容“起死回生、强势回归”。","另一个较旧的来源是《路加福音》中“乞丐拉撒路”的故事，加上中古英语里“lazar”有“麻风病人/病弱乞者”的含义，所以也可能带有“贫病凄苦”的色彩。实际写作中多取第一种“复活/回归”的意味。"]}
{"word":"lazarly","summary":{"en":"“lazarly” is usually a misspelling of “lazily” (adv.).","zh":"“lazarly”通常是“lazily”（副词）的拼写错误。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"“lazarly” is not a standard English word. It is most often a misspelling of “lazily” (in a lazy way; without much effort).","zh":"“lazarly”不是标准英语单词。它最常见是把“lazily”拼错了（懒散地；不用心地）。"},"examples":[{"en":"He answered the email lazily, with only two short sentences.","zh":"他很敷衍地回了邮件，只写了两句短话。"},{"en":"The cat lay lazily in the sun all afternoon.","zh":"那只猫懒洋洋地在阳光下躺了一下午。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare/unstable) If someone writes “lazarly,” they may be trying to mean “like Lazarus” (a person who came back from the dead in the Bible), but English normally uses “Lazarus-like” instead.","zh":"（非常少见/不规范）有人写“lazarly”可能想表达“像拉撒路一样”（《圣经》中死而复生的人），但英语通常用“Lazarus-like”来表达。"},"examples":[{"en":"After a long illness, he made a Lazarus-like recovery.","zh":"久病之后，他出现了“拉撒路式”的康复（起死回生般的恢复）。"}]}],"synonyms":["lazily","idly","sluggishly","lethargically"],"phonetic":"/ˈleɪzəli/","extraExplanation":["“Lazarus”来自《圣经·约翰福音》：耶稣使拉撒路复活。因此在英语里，Lazarus常用来比喻“死而复生、重新出现、意外恢复”。但“lazarly”并不是固定或常见的派生词，更自然的说法是“Lazarus-like / a Lazarus-like comeback”。"]}
{"word":"lazarole","summary":{"en":"“lazarole” is not a common standard English word; it’s likely a misspelling or a rare proper name. Context is needed to identify the intended meaning.","zh":"“lazarole”不是常见标准英语词，更可能是拼写误差或罕见专有名词；需要上下文才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard or widely recognized English word. It is likely a misspelling or a very rare proper name/term; you may have meant a related word such as “lazar” (a beggar/leper, archaic), “Lazarus” (a biblical name), or “lazarillo” (a guide/servant, from Spanish).","zh":"这不是一个常见或标准的英语单词，更可能是拼写错误或非常罕见的专有名词/术语；你可能想写的是相关词，如“lazar”（乞丐/麻风病人，古语），“Lazarus”（拉撒路，圣经人名），或“lazarillo”（向导/仆从，源自西班牙语）。"},"examples":[{"en":"I couldn’t find “lazarole” in a dictionary—did you mean “Lazarus” or “lazar”?","zh":"我在词典里找不到“lazarole”——你是不是想写“Lazarus（拉撒路）”或“lazar”？"},{"en":"If you can share the sentence where you saw “lazarole,” I can help identify the intended word.","zh":"如果你把看到“lazarole”的原句发我，我可以帮你判断原本想表达的词。"}]}],"synonyms":["(possible intended) Lazarus","(possible intended) lazar","(possible intended) lazarillo"],"phonetic":"/ˈlæzəˌroʊl/","extraExplanation":["“lazar-”这一词根在英语里常和《圣经》人物“Lazarus（拉撒路）”相关：拉撒路死而复生的故事使其名字在文化中常象征“复活/重生”。","中古与近代英语里也出现过“lazar”指“麻风病人/贫民（常作乞丐形象）”，与欧洲历史上“leper house（麻风病院）”等背景有关，因此在文学中偶尔带有“贫困、疾病、被社会边缘化”的色彩。","如果你是从某本书、歌词、游戏或人名名单里看到“lazarole”，它也可能是专有名词（姓氏/角色名/品牌名）的独特拼写。把上下文贴出来最容易确认。"]}
{"word":"lazarone","summary":{"en":"A historical term for a poor street loafer or beggar in Naples; often spelled “lazzarone.”","zh":"（历史用语）指那不勒斯的贫穷街头闲散者或乞丐；常见拼写为“lazzarone”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A poor, idle person in Naples, Italy—often a beggar or street loafer; a street urchin.","zh":"（历史用语）意大利那不勒斯的贫穷闲散者，常指乞丐或街头游荡者；街头流浪儿。"},"examples":[{"en":"In old travel writings, a “lazzarone” often appears as a ragged man lounging in the sun near the harbor.","zh":"在一些早期游记里，“lazzarone”常被描写成衣衫褴褛、在港口附近晒太阳闲躺的人。"},{"en":"The novel describes the boy as a lazzarone who survives by running errands for coins.","zh":"小说把那个男孩写成一个靠跑腿赚零钱度日的流浪儿。"}]}],"synonyms":["vagrant","beggar","loafer","street urchin"],"phonetic":"ˌlɑːtsəˈroʊni","extraExplanation":["“lazarone”更常见的拼写是 **lazzarone**（复数 **lazzaroni**），来自意大利语，通常与18—19世纪欧洲人对那不勒斯底层街头人群的描写有关。","这个词带有明显的时代与阶层色彩，在现代英语里较少使用；如果只是想表达“游民/流浪者/懒汉”，更常用 **vagrant, beggar, loafer, street urchin** 等中性或更常见的词。"]}
{"word":"lazarous","summary":{"en":"Lazarus is a biblical name often used to mean a return to life or a surprising comeback.","zh":"Lazarus（拉撒路）是《圣经》人物名，常用来比喻“复活”或“出人意料的强势回归”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A man in the Bible who was raised from the dead by Jesus; used as a symbol of coming back to life.","zh":"（专有名词）《圣经》中被耶稣使其复活的人物“拉撒路”；也常被用作“死而复生、重新归来”的象征。"},"examples":[{"en":"In the Bible, Lazarus is brought back to life by Jesus.","zh":"在《圣经》中，耶稣使拉撒路复活。"},{"en":"After weeks of illness, he joked that he felt like Lazarus walking out of the hospital.","zh":"病了几周后，他开玩笑说自己像拉撒路一样走出医院。"}]},{"partOfSpeech":"other","definition":{"en":"(Common usage, metaphor) A dramatic return or recovery after being thought finished or gone.","zh":"（常见引申义）在被认为“已经结束/消失”之后的戏剧性回归或复苏。"},"examples":[{"en":"The team made a Lazarus-like comeback in the final minutes.","zh":"这支队伍在最后几分钟上演了“拉撒路式”的逆转。"},{"en":"Some critics called the singer’s new album a Lazarus moment for her career.","zh":"一些评论家称这位歌手的新专辑是她事业的“拉撒路时刻”。"}]}],"synonyms":["resurrection","revival","comeback","return"],"phonetic":"/ˈlæzərəs/","extraExplanation":["你输入的 **lazarous** 更常见的正确拼写是 **Lazarus**（拉撒路）。","文化背景：拉撒路的故事出自《约翰福音》（John 11），因此英语里常用 **a Lazarus** 或 **Lazarus-like** 来形容“起死回生、强势复出”。","相关表达：**the Lazarus effect**（拉撒路效应：意外复苏/恢复）、**a comeback from the dead**（像“死而复生”般的回归）。"]}
{"word":"lazars","summary":{"en":"“lazars” is usually a misspelling of “lasers” (plural of laser); it can also mean multiple people named Lazar.","zh":"“lazars”通常是“lasers（激光器复数）”的误拼；也可能指多个名为/姓为 Lazar 的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “laser”: devices that produce a narrow, powerful beam of light.","zh":"“laser”的复数：激光器；能发出集中而强的光束的装置。"},"examples":[{"en":"The doctor used lasers to treat the skin condition.","zh":"医生使用激光来治疗皮肤问题。"},{"en":"Many factories use lasers to cut metal accurately.","zh":"许多工厂用激光来精确切割金属。"}]},{"partOfSpeech":"other","definition":{"en":"Plural of “Lazar”: a family name or given name (less common).","zh":"“Lazar”的复数：人名或姓氏（较少见）。"},"examples":[{"en":"Two Lazars signed the guest book.","zh":"有两位姓/名为 Lazar 的人签了留言簿。"}]}],"synonyms":["laser devices","laser beams"],"phonetic":"/ˈleɪzərz/","extraExplanation":["“lazars”不是最常见的拼写；很多学习者其实想查的是“lasers”（激光器的复数），因为发音相近。","LASER 原本是首字母缩写：Light Amplification by Stimulated Emission of Radiation（受激辐射光放大）。日常英语里通常把它当作普通单词使用。"]}
{"word":"lazarus","summary":{"en":"Lazarus usually refers to the biblical man raised from the dead, and by extension someone who returns unexpectedly; it can also refer to the American poet Emma Lazarus.","zh":"Lazarus通常指《圣经》中被复活的拉撒路，并引申为“意外回归/卷土重来”的象征；也可指美国诗人艾玛·拉撒路。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A man in the Bible (John 11) who was brought back to life by Jesus; often used as a symbol of someone “returning” after being gone or thought finished.","zh":"（专有名词）《圣经》中被耶稣使其复活的人（约翰福音11章）；常用来象征“消失后又回来”或“以为完了却又重新出现”的人/事。"},"examples":[{"en":"In the Bible story, Lazarus is raised from the dead by Jesus.","zh":"在《圣经》的故事里，拉撒路被耶稣从死里复活。"},{"en":"After months of silence, his career came back like Lazarus.","zh":"沉寂了好几个月后，他的事业像拉撒路一样又回来了。"}]},{"partOfSpeech":"n.","definition":{"en":"A reference to Emma Lazarus (1849–1887), an American poet whose words appear on the Statue of Liberty (“The New Colossus”).","zh":"指艾玛·拉撒路（1849–1887），美国诗人；其诗《新巨像》的一段文字刻在自由女神像基座上。"},"examples":[{"en":"Many people quote Emma Lazarus when talking about immigration to the U.S.","zh":"谈到移民与美国时，很多人会引用艾玛·拉撒路的诗句。"},{"en":"“Give me your tired, your poor…” comes from a poem by Lazarus.","zh":"“把你们疲惫的人、贫穷的人给我……”出自拉撒路的一首诗。"}]}],"synonyms":["rise like Lazarus (idiom: come back after seeming finished)","resurrection (related idea)","comeback (related idea)"],"phonetic":"/ˈlæzərəs/","extraExplanation":["“Lazarus”在英语里常被当作文化典故使用：因为《约翰福音》中拉撒路“死而复生”，所以有表达“像拉撒路一样复活/卷土重来”的说法（rise like Lazarus）。","艾玛·拉撒路的《新巨像》（The New Colossus）与自由女神像联系紧密，常出现在关于移民、庇护与美国身份认同的讨论中。"]}
{"word":"lazary","summary":{"en":"Lazary is an archaic word meaning a leprosy hospital (or, less commonly, a person with leprosy).","zh":"lazary 是古义词，指麻风病院（较少也可指麻风病人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A hospital or refuge for people with leprosy; a leper-house.","zh":"（古义）麻风病院；收容麻风病人的机构。"},"examples":[{"en":"In some medieval towns, a lazary stood outside the city walls.","zh":"在一些中世纪城镇，麻风病院常建在城墙外。"},{"en":"The novel mentions a lazary as a symbol of social exclusion.","zh":"小说提到麻风病院，用来象征社会排斥。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) A person with leprosy; a leper.","zh":"（古义）麻风病人。"},"examples":[{"en":"The poem speaks of a lone lazary wandering the road.","zh":"诗中写到一位孤独的麻风病人徘徊在路上。"}]}],"synonyms":["leprosy hospital","leper colony","lazaretto"],"phonetic":"/ˈlæzəri/","extraExplanation":["“lazary”多见于较老的文学或历史语境，现代英语更常用“leper colony / leprosy hospital”。","词源与《圣经》中的“Lazarus（拉撒路）”相关：中世纪欧洲常把患麻风病的人与“拉撒路”联系起来，因此出现了以其名命名的收容机构。","近义/相关词：lazaretto（检疫站，常用于传染病隔离）、leper colony（麻风病隔离区）。"]}
{"word":"laze","summary":{"en":"“Laze” means to spend time relaxing in a lazy, unhurried way; it can also mean a period of idle relaxation.","zh":"“laze”表示懒散地放松、悠闲打发时间；也可指一段无所事事的休闲时光。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to relax or spend time in a lazy, unhurried way, often doing little or nothing","zh":"懒散地打发时间；悠闲地躺着或待着（常指不怎么做事）"},"examples":[{"en":"We lazed on the beach all afternoon.","zh":"我们在海滩上懒懒散散地待了一整个下午。"},{"en":"After the exam, he just lazed around at home.","zh":"考完试后，他就在家里无所事事地晃悠。"}]},{"partOfSpeech":"n.","definition":{"en":"lazy relaxation; an easy, idle mood","zh":"懒散的休闲；悠然无所事事的状态"},"examples":[{"en":"The quiet garden invited an afternoon of laze.","zh":"安静的花园让人想来一段慵懒的下午时光。"}]}],"synonyms":["loung(e)","idle","relax","loaf","loll"],"phonetic":"/leɪz/","extraExplanation":["“laze”通常比“be lazy”更中性：它常强调“悠闲放松、什么都不急”，不一定带强烈的道德批评；而“lazy”作形容词更容易让人联想到“懒惰、不努力”。","常见搭配：laze around（无所事事地待着/晃悠）、laze in the sun（晒太阳懒躺）、a lazy day / a day of laze（慵懒的一天）。注意：口语里更常说“laze around”而不是单独用“laze”。"]}
{"word":"lazed","summary":{"en":"“Lazed” means “spent time relaxing and doing very little” (past tense/participle of laze).","zh":"“lazed”表示“悠闲地消磨时间、懒散地待着”，是动词“laze”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"Past tense and past participle of “laze”: to spend time relaxing and doing very little (often in a slow, comfortable way).","zh":"“laze”的过去式和过去分词：懒散地消磨时间，悠闲地什么也不做（常带轻松、舒适的感觉）。"},"examples":[{"en":"We lazed by the pool all afternoon.","zh":"我们在泳池边悠闲地待了一整个下午。"},{"en":"After the exam, she lazed around the house and watched movies.","zh":"考完试后，她在家里懒散地待着看电影。"},{"en":"They had lazed in the sun until it started to get cold.","zh":"他们一直在太阳下晒着、闲着，直到开始变冷。"}]}],"synonyms":["relaxed","lounged","idled","rested"],"phonetic":"/leɪzd/","extraExplanation":["“lazed”来自动词“laze”（悠闲、消磨时间），和形容词“lazy”（懒惰的）不完全一样：\n- laze 强调“放松、悠闲地不做事”（可以是中性的甚至有点享受）。\n- lazy 更常表示“因懒惰而不愿做该做的事”（常带负面评价）。"]}
{"word":"lazes","summary":{"en":"“Laze” means to relax and do very little; “lazes” is the he/she/it form.","zh":"laze 表示懒散地休息、无所事事；lazes 是其第三人称单数形式（他/她/它）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to relax and do very little (often in a lazy, comfortable way)","zh":"懒散地休息；无所事事（常带有舒服但不想动的感觉）"},"examples":[{"en":"On Sundays, he just lazes on the sofa and watches TV.","zh":"周日他就瘫在沙发上看电视。"},{"en":"We lazed around the beach all afternoon.","zh":"我们整个下午都在海滩上闲晃、放松。"}]},{"partOfSpeech":"vi.","definition":{"en":"to spend time in a slow, lazy way; to lounge","zh":"懒洋洋地打发时间；闲躺着"},"examples":[{"en":"She lazed in the sun after lunch.","zh":"午饭后她在阳光下懒懒地躺着。"}]}],"synonyms":["relax","lounge","loaf","idle"],"phonetic":"/leɪz/","extraExplanation":["“lazes”通常是动词“laze”的第三人称单数现在时：He/She/It lazes (around).","常见搭配：laze around（闲着、无所事事），laze on the couch/sofa（瘫在沙发上），laze in the sun（晒太阳发呆）。","语气提示：laze 通常比 relax 更“懒散/无所事事”，有时带一点点负面评价，但也可用于轻松愉快的度假语境。"]}
{"word":"lazied","summary":{"en":"“Lazied” is an uncommon past form meaning “spent time idly,” but in most cases you should use “lazed” or “was/were lazy.”","zh":"“Lazied”是不常见的过去式，表示“懒散度日”；多数情况下更推荐用“lazed”或“was/were lazy”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon) Past tense/past participle of “to lazy”: to spend time doing little or no work; to relax in an idle way.","zh":"（不常用）“to lazy”的过去式/过去分词：懒散地度过时间；无所事事地放松。"},"examples":[{"en":"We lazied around the house all weekend.","zh":"我们整个周末都在家里懒懒散散地待着。"},{"en":"After the exam, she lazied in the park for an hour.","zh":"考完试后，她在公园里懒散地待了一个小时。"}]},{"partOfSpeech":"other","definition":{"en":"Often a mistaken form: many learners write “lazied” when they mean “lazed” (from “to laze”) or “was/were lazy” (using the adjective “lazy”).","zh":"常见误写：很多学习者写“lazied”，其实想表达“lazed”（来自动词“to laze”）或“was/were lazy”（用形容词“lazy”）。"},"examples":[{"en":"Correct: We lazed on the beach all day. (Not: We lazied on the beach.)","zh":"正确：We lazed on the beach all day.（不太建议：We lazied on the beach.）"},{"en":"Correct: I was lazy yesterday. (Meaning: I didn’t feel like working.)","zh":"正确：I was lazy yesterday.（意思：我昨天不想干活。）"}]}],"synonyms":["lazed","idled","lounged","relaxed","loafed"],"phonetic":"/ˈleɪzid/","extraExplanation":["“lazied”作为动词形式在现代英语里比较少见，更自然的说法通常是：用动词“laze”→“lazed”，或用形容词“lazy”搭配系动词（be）→“was/were lazy”。在写作和考试中，建议优先使用更常见的“lazed/was lazy”。"]}
{"word":"lazier","summary":{"en":"“Lazier” is the comparative form of “lazy,” meaning more unwilling to work or more relaxed/slow-paced.","zh":"“lazier”是“lazy”的比较级，表示更懒（更不愿意努力）或更悠闲/慢节奏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More lazy; showing less willingness to work or use energy than someone/something else.","zh":"更懒的；比别人/别的事物更不愿意工作或更不愿费力的。"},"examples":[{"en":"I feel lazier on rainy days, so I study in short sessions.","zh":"下雨天我感觉更懒，所以我用短时间分段学习。"},{"en":"This phone app makes me lazier because it does everything for me.","zh":"这个手机应用让我变得更懒，因为它什么都替我做了。"}]},{"partOfSpeech":"adj.","definition":{"en":"More relaxed and slow-moving (often describing a day, afternoon, or pace).","zh":"更悠闲、节奏更慢的（常形容一天、一个下午或步调）。"},"examples":[{"en":"We had a lazier afternoon at the beach.","zh":"我们在海滩度过了一个更悠闲的下午。"},{"en":"Try a lazier pace if you’re feeling stressed.","zh":"如果你感到压力大，试试更慢、更放松的节奏。"}]}],"synonyms":["more lazy","more sluggish","more idle","more relaxed (for pace)"],"phonetic":"/ˈleɪziɚ/","extraExplanation":["“lazier”是形容词“lazy”的比较级：lazy → lazier → laziest。以辅音字母+y结尾的形容词，变比较级时通常把y变成i再加-er。","“lazy”既可以是贬义（懒惰、不努力），也可以是中性/褒义语境（悠闲、慢节奏的生活方式）。是否礼貌取决于语气和场景。"]}
{"word":"lazies","summary":{"en":"“Lazies” is an informal plural noun meaning “lazy people.”","zh":"“lazies”是非正式复数名词，意思是“懒人/懒惰的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"informal: lazy people; people who avoid work or effort (plural of “lazy” used as a noun).","zh":"（非正式）懒人；不爱劳动或不愿费力的人（把“lazy”当名词用的复数）。"},"examples":[{"en":"Stop calling your classmates “lazies”—it sounds rude.","zh":"别把同学叫“lazies”，听起来很没礼貌。"},{"en":"He jokes that his team is full of “lazies,” but they’re actually just tired.","zh":"他开玩笑说他团队里都是“lazies”，但其实他们只是累了。"}]}],"synonyms":["lazy people","idlers","slackers"],"phonetic":"ˈleɪziz","extraExplanation":["“lazy”最常见是形容词（a lazy student 懒惰的学生）。把“lazy”当名词用（a lazy / lazies）属于口语、带评价色彩，容易显得不礼貌。更中性说法：lazy people / unmotivated people（缺乏动力的人）/ people who don’t want to work（不想工作的人）。","拼写提示：如果你想表达“懒惰（这种状态）”，通常用名词 laziness（懒惰）。"]}
{"word":"laziest","summary":{"en":"“Laziest” means “the most lazy” (the superlative of lazy).","zh":"“laziest”表示“最懒的”，是“lazy”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “lazy”: the most unwilling to work or use effort; the least active.","zh":"“lazy”的最高级：最懒的；最不愿意付出努力的；最不活跃的。"},"examples":[{"en":"Of all the students in the group, Tom is the laziest.","zh":"在这组学生里，汤姆是最懒的。"},{"en":"Sunday is my laziest day—I like to stay home and rest.","zh":"星期天是我最懒的一天——我喜欢待在家里休息。"},{"en":"That was the laziest excuse I’ve ever heard.","zh":"那是我听过最敷衍、最偷懒的借口。"}]}],"synonyms":["most idle","least active","most inactive","most sluggish","least motivated"],"phonetic":"/ˈleɪziəst/","extraExplanation":["“laziest”是形容词“lazy”的最高级，常见结构是：the laziest + 名词（the laziest person）或在范围内比较：the laziest of/in + 复数名词（the laziest of my friends / in the class）。","拼写规则：以 -y 结尾的形容词变最高级时，通常把 y 变成 i，再加 -est：lazy → laziest（类似：happy → happiest）。","语气提醒：直接说某人“the laziest”可能显得不礼貌；在正式场合可用更委婉的表达，如 “least motivated”（动力最不足的）或 “not very active”（不太积极）。"]}
{"word":"lazily","summary":{"en":"“Lazily” means “in a relaxed, low-energy way,” and sometimes “because someone is being lazy.”","zh":"“lazily”表示“懒洋洋地、慢悠悠地”，也可表示“因为懒惰而（偷懒地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a relaxed way, without much energy or effort; slowly and comfortably.","zh":"懒洋洋地；漫不经心地；缺乏精力或努力地（常带“慢悠悠、随意”的感觉）。"},"examples":[{"en":"He stretched lazily on the sofa after lunch.","zh":"午饭后他懒洋洋地在沙发上伸了个懒腰。"},{"en":"The cat lazily watched the birds outside the window.","zh":"猫懒洋洋地看着窗外的鸟。"},{"en":"She answered the question lazily, without really thinking.","zh":"她漫不经心地回答了这个问题，没有认真思考。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that shows unwillingness to work or be active; because of laziness.","zh":"由于懒惰而；懒散地（强调“不想做事/不愿用力”的原因或态度）。"},"examples":[{"en":"He lazily ignored the email and missed the deadline.","zh":"他因为懒得处理而无视那封邮件，结果错过了截止日期。"},{"en":"Don’t lazily assume it will fix itself—check it now.","zh":"别偷懒地以为它会自己好起来——现在就检查。"}]}],"synonyms":["idly","leisurely","sluggishly","listlessly","indolently"],"phonetic":"/ˈleɪzəli/","extraExplanation":["“lazily”既可以是中性的“悠闲、慢悠悠”，也可以是带批评的“懒得做、偷懒”。语气常由上下文决定：比如形容猫、午后阳光下的动作，多偏“慵懒惬意”；形容工作或责任时，更容易变成“懒散不负责任”。","常见搭配：lazily stretched（懒洋洋地伸展）、lazily drifted（慢悠悠地飘/移动）、lazily glanced（随意地瞥一眼）、lazily assumed（想当然地、图省事地认为）。"]}
{"word":"laziness","summary":{"en":"Laziness means a habit or state of avoiding work or effort.","zh":"Laziness 指“懒惰”，即习惯性地回避工作或付出努力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being unwilling to work or use effort; a habit of avoiding activity or responsibility.","zh":"懒惰；不愿意付出努力或逃避行动/责任的状态或习惯。"},"examples":[{"en":"His laziness kept him from finishing the project on time.","zh":"他的懒惰让他没能按时完成项目。"},{"en":"She fought her laziness by setting small daily goals.","zh":"她通过设定每天的小目标来对抗懒惰。"},{"en":"The teacher warned that laziness can become a bad habit.","zh":"老师警告说，懒惰可能会变成坏习惯。"}]}],"synonyms":["idleness","sloth","inactivity","apathy"],"phonetic":"/ˈleɪzinəs/","extraExplanation":["“laziness”是名词，常用来评价一种习惯性的态度，语气通常偏负面。更中性的表达可以用“lack of motivation（缺乏动力）”“low energy（精力不足）”，避免给人贴标签。","词源上与“lazy（懒的）”相关。日常搭配很常见：“pure laziness（纯粹的懒）”“out of laziness（出于懒惰）”“overcome laziness（克服懒惰）”。","在文学或写作中，“laziness”有时也被用来象征“停滞”“麻木”或“自我放纵”，不一定只是字面上的不干活。"]}
{"word":"lazinesses","summary":{"en":"“Lazinesses” means repeated instances or types of laziness (plural of “laziness”).","zh":"“lazinesses”是“laziness”的复数，表示多次或多种懒惰（具体的懒惰表现）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of laziness; repeated cases or different kinds of being unwilling to work or make effort","zh":"laziness 的复数；指多次出现的懒惰行为，或不同类型的懒惰（不愿付出努力）"},"examples":[{"en":"The coach was frustrated by the team’s lazinesses during practice.","zh":"教练对球队在训练中的各种懒散表现感到沮丧。"},{"en":"In his journal, he listed his lazinesses and promised to change one habit each week.","zh":"在日记里，他列出了自己的几种懒惰表现，并承诺每周改掉一个习惯。"}]}],"synonyms":["slackness","idleness","inertia","apathy","indolence"],"phonetic":"/ˈleɪzinəsɪz/","extraExplanation":["“Laziness”通常是不可数名词（e.g., Laziness is a problem. 懒惰是个问题），更常用这种说法。用复数“lazinesses”时，强调“具体的几次/几种懒惰表现”，语气往往更带批评或强调分类。"]}
{"word":"lazing","summary":{"en":"“Lazing” means relaxing and doing very little, often in a comfortable, unhurried way.","zh":"“lazing”指悠闲地无所事事、放松打发时间，常带舒服、慢节奏的感觉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"relaxing or spending time doing very little; being idle (present participle of “laze”).","zh":"（laze 的现在分词）懒散地待着；消磨时间；无所事事。"},"examples":[{"en":"We spent the whole Sunday lazing by the pool.","zh":"我们整个星期天都在泳池边懒散地待着。"},{"en":"He was lazing on the sofa instead of studying.","zh":"他没有学习，而是瘫在沙发上打发时间。"},{"en":"After the hike, I felt like lazing around for the rest of the day.","zh":"徒步之后，我只想当天剩下的时间都随便躺着休息。"}]},{"partOfSpeech":"adj.","definition":{"en":"slow, relaxed, and lazy in a pleasant way (often before a noun).","zh":"（多用于名词前）悠闲慵懒的；懒洋洋的（常带舒服、放松的感觉）。"},"examples":[{"en":"It was a lazing summer afternoon.","zh":"那是一个慵懒的夏日午后。"},{"en":"She enjoyed a lazing weekend with no plans at all.","zh":"她享受了一个什么计划都没有的悠闲周末。"}]}],"synonyms":["lounging","idling","relaxing","resting","loafing around","taking it easy"],"phonetic":"/ˈleɪzɪŋ/","extraExplanation":["“lazing”来自动词“laze”，意思是“闲着、懒散地消磨时间”。它通常强调“放松、悠闲”的状态；而“lazy”更常用来形容一个人“懒惰/不勤快”（带更多评价色彩）。例如：\n- I’m lazing around today.（我今天在放松休息。）\n- He is lazy.（他这个人很懒。）"]}
{"word":"lazule","summary":{"en":"“Lazule” is a rare word used to mean a deep azure-blue color, sometimes linked to lapis lazuli; in modern English, “azure” or “(lapis) lazuli” is more common.","zh":"“lazule”很少见，通常指深蔚蓝色，有时与青金石（lapis lazuli）相关；现代英语更常用“azure”或“(lapis) lazuli”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) A deep azure-blue color; often used as a poetic or old-fashioned variant related to “lazuli/azure.”","zh":"（罕用）深邃的天蓝/蔚蓝色；常见于诗意或较旧的用法，可视为与“lazuli/azure（天蓝色）”相关的变体。"},"examples":[{"en":"The sky turned lazule at dusk, dark and intensely blue.","zh":"黄昏时天空变得lazule般深蓝，颜色浓烈。"},{"en":"She wore a lazule scarf that stood out against the white snow.","zh":"她围着一条深蓝色的围巾，在白雪中格外醒目。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Lapis lazuli or a blue pigment associated with it (usage is uncommon; “lapis lazuli” is standard).","zh":"（罕用）青金石，或由其制成的蓝色颜料（此用法不常见；更标准的说法是“lapis lazuli/青金石”）。"},"examples":[{"en":"The manuscript was painted with gold and lazule tones.","zh":"这份手稿用金色与青金石般的蓝色来绘制。"},{"en":"In older descriptions, lazule may refer to the stone used for rich blue pigment.","zh":"在较旧的描述中，lazule有时指用来制作浓郁蓝色颜料的石头。"}]}],"synonyms":["azure","deep blue","lazuli"],"phonetic":"/ləˈzuːl/","extraExplanation":["“lazule”在现代英语里非常少见，很多时候是拼写变体、误拼，或是带有文学/装饰性色彩的用法。你更常会看到：\n- **azure**：常用词，指“天蓝色、蔚蓝”。\n- **(lapis) lazuli**：指“青金石”，也可引申为“青金石蓝”。\n如果你是在某篇文章或品牌名里看到“lazule”，也可能是刻意取的“蓝色意象”用词。"]}
{"word":"lazuli","summary":{"en":"Lazuli most commonly refers to lapis lazuli, a deep-blue semi-precious stone, and more rarely it can mean “deep blue” as an adjective.","zh":"lazuli最常指“青金石”（lapis lazuli），一种深蓝色的半宝石；更少见时可作形容词表示“深蓝色的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in the phrase “lapis lazuli”) a deep-blue semi-precious stone used in jewelry and carvings, and historically ground into pigment for paint.","zh":"（常用于短语“lapis lazuli”青金石）一种深蓝色的半宝石，用于首饰与雕刻；历史上也会被研磨成颜料用于绘画。"},"examples":[{"en":"She wore a necklace with a small piece of lazuli.","zh":"她戴着一条项链，上面镶着一小块青金石。"},{"en":"Ancient artists sometimes used lazuli to make rich blue pigments.","zh":"古代艺术家有时会用青金石制作浓郁的蓝色颜料。"}]},{"partOfSpeech":"adj.","definition":{"en":"deep blue; azure-colored (rare in modern everyday English).","zh":"深蓝色的；天蓝色的（现代日常英语中较少用）。"},"examples":[{"en":"The poem describes a lazuli sky over the desert.","zh":"这首诗描写了沙漠上空深蓝的天空。"}]}],"synonyms":["lapis lazuli","ultramarine","azure"],"phonetic":"/ˈlæzjəˌlaɪ/","extraExplanation":["“lazuli”常见于“lapis lazuli”（青金石）这一完整名称：lapis在拉丁语里有“石头”的意思，lazuli与阿拉伯语/波斯语中表示“蓝色”的词源有关。","青金石在欧洲绘画史上很重要：它曾被磨成昂贵的“群青（ultramarine）”颜料，文艺复兴时期常用来画圣母玛利亚的蓝色衣袍，象征珍贵与神圣。","在英语里单独说“lazuli”不如说“lapis lazuli”常见；购买宝石或描述材质时用全称会更自然。"]}
{"word":"lazuline","summary":{"en":"Lazuline means deep, vivid azure-blue like lapis lazuli.","zh":"lazuline 指像青金石一样深而鲜明的湛蓝色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the deep, bright blue color of lapis lazuli; azure-blue.","zh":"呈青金石般的深亮蓝色；湛蓝的。"},"examples":[{"en":"The sky turned lazuline just after sunset.","zh":"日落后不久，天空变成了湛蓝色。"},{"en":"She wore a lazuline scarf that looked like a piece of the sea.","zh":"她戴着一条湛蓝的围巾，像一片海。"}]}],"synonyms":["azure","cerulean","sapphire-blue","ultramarine","lapis-lazuli blue"],"phonetic":"/ˈlæzjəˌlaɪn/","extraExplanation":["“lazuline”较为少见、偏文学或描写性用词，常用于诗歌、艺术评论或色彩描写。","词源与“lazuli”（青金石）相关；青金石在历史上也被用来制作颜料（如群青 ultramarine），因此该词常带有“宝石般蓝色”的联想。"]}
{"word":"lazulis","summary":{"en":"“Lazuli” usually refers to the deep-blue gemstone (as in “lapis lazuli”), and it can also mean a deep-blue color in literary or design contexts.","zh":"“lazuli”通常指青金石（常见于“lapis lazuli”），也可作形容词表示“青金石般的深蓝色”（多用于文学或设计语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep-blue semi-precious stone used in jewelry and decoration; often seen in the phrase “lapis lazuli.”","zh":"一种深蓝色的半宝石，常用于珠宝和装饰；常见于短语“lapis lazuli（青金石）”。"},"examples":[{"en":"The necklace was made of lazuli beads.","zh":"这条项链是用青金石珠子做的。"},{"en":"Ancient artists valued lazuli for its rich blue color.","zh":"古代艺术家很珍视青金石那种浓郁的蓝色。"}]},{"partOfSpeech":"adj.","definition":{"en":"deep blue in color (used mainly in art, design, or poetic descriptions).","zh":"深蓝色的（多用于艺术、设计或较诗意的描写）。"},"examples":[{"en":"She painted the sky in a lazuli blue.","zh":"她把天空涂成了青金石般的深蓝色。"},{"en":"The lake looked lazuli at dusk.","zh":"傍晚时湖面呈现出深蓝色。"}]}],"synonyms":["lapis lazuli","azure","deep blue"],"phonetic":"/ləˈzuːli/","extraExplanation":["“lazuli”常与“lapis”一起构成固定说法“lapis lazuli（青金石）”。你输入的“lazulis”多半是口语/写作中把它当作可数名词时的复数形式（例如指多颗青金石或多件青金石制品），但在正式英语里更常说“pieces of lapis lazuli / lazuli stones”等。","词源上与阿拉伯语/波斯语中表示“蓝色、天空”的词有关；历史上青金石也与昂贵的蓝色颜料（如群青 ultramarine）有文化关联。"]}
{"word":"lazulite","summary":{"en":"Lazulite is a sky-blue mineral that can occur in metamorphic rocks and is sometimes used as a gemstone.","zh":"Lazulite（天蓝石）是一种天蓝色矿物，常见于变质岩中，有时可用作宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blue to bluish-green mineral (a phosphate of magnesium and aluminum), often found in metamorphic rocks and sometimes used as a gemstone.","zh":"一种蓝色到蓝绿色的矿物（镁和铝的磷酸盐），常见于变质岩中，有时可作为宝石材料。"},"examples":[{"en":"The collector showed a small lazulite crystal with a deep sky-blue color.","zh":"收藏家展示了一小块天蓝色很深的天蓝石晶体。"},{"en":"Lazulite is sometimes confused with similar blue minerals, so identification matters.","zh":"天蓝石有时会与相似的蓝色矿物混淆，因此鉴定很重要。"}]}],"synonyms":["(no true synonym; related: lapis lazuli, azure)"],"phonetic":"/ˈlæz.jəˌlaɪt/","extraExplanation":["“lazulite”这个名字与表示“蓝色”的词源有关：它和“azure（蔚蓝色）”以及“lapis lazuli（青金石）”在历史上有词源关联，常让人联想到“天空般的蓝”。","注意区分：lazulite（天蓝石）是一个具体矿物名称；lapis lazuli（青金石）是以“天蓝金石/青金石”为主的岩石（常含青金石矿物），两者不是同一种东西。"]}
{"word":"lazulites","summary":{"en":"Lazulites are specimens of the mineral lazulite (blue phosphate mineral).","zh":"lazulites 指矿物“lazulite（天蓝石/蓝磷铝镁石）”的复数形式，即多块天蓝石标本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) blue to blue‑green phosphate minerals called lazulite, often found in metamorphic rocks and sometimes used as small gemstones or collectors’ specimens.","zh":"（复数）一种称为“天蓝石 / 蓝磷铝镁石”（lazulite）的蓝色到蓝绿色磷酸盐矿物，常见于变质岩中，有时可作小型宝石或矿物标本收藏。"},"examples":[{"en":"The museum display includes lazulites from Austria and Brazil.","zh":"博物馆展柜里有来自奥地利和巴西的天蓝石（lazulites）标本。"},{"en":"Under strong light, the lazulites show a rich, deep blue color.","zh":"在强光下，这些天蓝石呈现出浓郁的深蓝色。"}]}],"synonyms":["lazulite (plural: lazulites)"],"phonetic":"/ˈlæz.jəˌlaɪts/","extraExplanation":["“lazulite”一词与表示“蓝色”的词源有关，和“lazuli”（如 lapis lazuli，青金石）同源背景相近，常让学习者误以为它们是同一种矿物；但天蓝石（lazulite）与青金石（lapis lazuli）在成分与形成环境上不同。","在地质语境中，这个词多用于矿物学/岩石学描述；日常英语里很少见，通常出现在博物馆标签、论文或矿物收藏者交流中。"]}
{"word":"lazulitic","summary":{"en":"Lazulitic means “related to or containing the mineral lazulite,” often describing a deep-blue mineral look in geology.","zh":"lazulitic 指“与矿物天蓝磷铝石（lazulite）有关/含有该矿物的”，常用于地质、矿物学语境，带有深蓝色矿物特征的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, containing, or resembling the mineral lazulite (a deep blue phosphate mineral).","zh":"与“天蓝磷铝石”（lazulite，一种深蓝色磷酸盐矿物）有关的；含有天蓝磷铝石的；类似天蓝磷铝石的。"},"examples":[{"en":"Geologists described the rock as lazulitic because it contained visible grains of lazulite.","zh":"地质学家把这块岩石形容为 lazulitic，因为其中含有肉眼可见的天蓝磷铝石颗粒。"},{"en":"The specimen has a faint lazulitic blue that deepens under strong light.","zh":"这件标本带有淡淡的 lazulitic 蓝色，在强光下会显得更深。"}]}],"synonyms":["lazulite-bearing","azure (color sense)","deep-blue (descriptive)"],"phonetic":"/ˌlæzjʊˈlɪtɪk/","extraExplanation":["这个词在日常英语里非常少见，多出现在矿物学、地质学的描述中。","词根 lazul- 与“深蓝色”有关（也常让人联想到 lapis lazuli / lazuli 这类表示天蓝色的来源词），-ic 表示“……的、与……有关的”。"]}
{"word":"lazurite","summary":{"en":"Lazurite is a deep-blue mineral that makes up most of lapis lazuli and is used for jewelry and blue pigment.","zh":"Lazurite（天蓝石）是一种深蓝色矿物，是青金石的主要成分，可用于饰品和蓝色颜料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A deep-blue mineral (a sodium aluminum silicate) that is the main component of lapis lazuli; it is valued as a gemstone and as a source of blue pigment.","zh":"一种深蓝色矿物（钠铝硅酸盐），是青金石（lapis lazuli）的主要成分；常被用作宝石材料，也可用来提取蓝色颜料。"},"examples":[{"en":"The necklace’s intense blue color comes from lazurite in the lapis lazuli beads.","zh":"这条项链浓烈的蓝色来自青金石珠子中的天蓝石（lazurite）。"},{"en":"In some historical artworks, ground lazurite helped create brilliant blue paint.","zh":"在一些历史绘画中，研磨后的天蓝石可用来制作明亮的蓝色颜料。"}]}],"synonyms":["lazurite (a mineral, not a general color)","lapis lazuli (the rock containing lazurite)"],"phonetic":"/ˈlæʒəˌraɪt/","extraExplanation":["“lazurite”与“azure（蔚蓝）”同源，都来自表示“蓝色/天空”的词根；“lapis lazuli”常译为“青金石”，其中主要的蓝色矿物就是lazurite。","艺术史里常提到的高级蓝色颜料“ultramarine（群青）”传统上来自青金石；它的蓝色来源与lazurite密切相关。"]}
{"word":"lazurites","summary":{"en":"“Lazurites” means more than one lazurite, a deep-blue mineral that gives lapis lazuli its famous color.","zh":"“Lazurites”指多块/多种 lazurite（天蓝石）矿物，是青金石呈现标志性蓝色的主要来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of lazurite; deep-blue mineral crystals (a sodium-calcium aluminosilicate with sulfur) that are the main blue component of lapis lazuli.","zh":"lazurite 的复数；一种深蓝色矿物晶体（含硫的钠钙铝硅酸盐），是青金石（lapis lazuli）主要呈蓝色的成分。"},"examples":[{"en":"Scientists analyzed the lazurites in the rock to confirm it was true lapis lazuli.","zh":"科学家分析岩石中的 lazurites，以确认它是真正的青金石。"},{"en":"Tiny lazurites can sparkle inside a polished piece of lapis.","zh":"抛光后的青金石内部可能有细小的 lazurites 闪闪发亮。"}]}],"synonyms":["lazurite","lapis lazuli (related)","blue mineral (general)"],"phonetic":"ˈlæʒəˌraɪt","extraExplanation":["“Lazurite”常见于地质学、矿物学语境；日常英语里更常听到的是“lapis lazuli（青金石）”。","词源与“azure（蔚蓝色）”同源，追溯到表示“蓝色/天蓝”的古老词根，因此它的名字本身就带有“蓝”的含义。"]}
{"word":"lazy","summary":{"en":"“Lazy” usually means “not wanting to make an effort,” but it can also mean “relaxed and slow” (a lazy Sunday) or “not functioning strongly” (a lazy eye).","zh":"“lazy”最常指“不愿意费力、懒惰的”，也可指“悠闲慢悠悠的”（慵懒的周日），或指“无力/功能较弱的”（如 lazy eye 弱视）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not willing to work or use effort; liking to rest instead of being active.","zh":"懒惰的；不愿意工作或花力气，更喜欢休息而不是行动。"},"examples":[{"en":"I feel lazy today, so I’m staying home.","zh":"我今天觉得很懒，所以待在家。"},{"en":"He’s not lazy—he’s just tired after work.","zh":"他不是懒，只是下班后太累了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relaxed and slow-moving; not in a hurry (often describing time, a day, or a feeling).","zh":"悠闲的、慢悠悠的；不着急的（常形容时光、一天或氛围）。"},"examples":[{"en":"We spent a lazy Sunday reading and drinking coffee.","zh":"我们度过了一个慵懒的周日，看书喝咖啡。"},{"en":"The afternoon had a lazy, peaceful rhythm.","zh":"下午的节奏慵懒而宁静。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not working well or not moving strongly (often describing a body part, like an eye).","zh":"无力的；运作不佳的（常指身体部位，比如“斜视/弱视”的眼睛）。"},"examples":[{"en":"She has a lazy eye, so she wears special glasses.","zh":"她有弱视（俗称“懒眼”），所以戴特殊眼镜。"}]}],"synonyms":["idle","sluggish","inactive","unmotivated","laid-back"],"phonetic":"/ˈleɪzi/","extraExplanation":["“lazy”用来形容人时有时会显得带批评意味。更委婉的表达可以用：unmotivated（缺乏动力）、low-energy（没精神）、taking a break（在休息）。","文学与日常描写里，“a lazy afternoon / a lazy river”通常是褒义或中性，强调“慢、悠闲、舒适”，不等于“懒惰”。"]}
{"word":"lazyback","summary":{"en":"“Lazyback” is an informal, uncommon word meaning a lazy person, and more rarely a lounging/reclining chair.","zh":"“lazyback”是较少见的非正式用法，常指懒惰的人；更少见时也可指便于躺靠/后仰的椅子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A lazy person; someone who avoids work or effort.","zh":"（非正式，较少见）懒惰的人；总想偷懒、不愿下功夫的人。"},"examples":[{"en":"Stop being a lazyback and help clean the room.","zh":"别当个懒人了，来一起打扫房间。"},{"en":"He joked that he was a lazyback on weekends.","zh":"他开玩笑说自己周末就是个懒虫。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A chair or seat with a back designed for lounging or reclining.","zh":"（较少见）一种适合休闲倚靠/后仰的椅子（靠背较“懒”、便于躺靠）。"},"examples":[{"en":"They put two lazybacks on the porch to relax in the evening.","zh":"他们在门廊上放了两把躺靠椅，晚上用来放松。"}]}],"synonyms":["lazy person","idler","slacker","couch potato","recliner","lounge chair"],"phonetic":"/ˈleɪziˌbæk/","extraExplanation":["“lazyback”不是非常常用的标准词，更常见的表达是：lazy person / couch potato（懒虫、宅在沙发上的人，偏口语）或 lounge chair / recliner（躺椅/可后仰的椅子）。","如果你是在特定语境（比如某个品牌名、方言、游戏ID、网络用语）里看到的“lazyback”，告诉我上下文句子，我可以帮你判断最贴近的意思。"]}
{"word":"lazybed","summary":{"en":"A traditional raised planting ridge made with little digging, especially for potatoes in Scotland and Ireland.","zh":"一种几乎不翻土、堆成垄状的传统高畦（尤用于苏格兰和爱尔兰种土豆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long raised strip of soil used for planting (especially potatoes), made with minimal digging; a traditional method in parts of Scotland and Ireland","zh":"（尤指种土豆的）“懒人畦/懒人垄”：几乎不翻土、把土堆成的长条高畦；在苏格兰和爱尔兰部分地区的传统做法"},"examples":[{"en":"Farmers planted potatoes in lazybeds along the coastal fields.","zh":"农民在海边田地里用懒人畦种土豆。"},{"en":"The garden guide describes a lazybed method that builds ridges instead of deep digging.","zh":"园艺指南介绍了“懒人畦”做法：堆垄而不是深翻。"}]}],"synonyms":["lazy bed","raised bed","ridge","planting ridge"],"phonetic":"/ˈleɪzi bɛd/","extraExplanation":["“lazybed”常见于英爱地区（尤其苏格兰高地与岛屿、爱尔兰西部）的农业语境：把海藻、草皮、粪肥等铺在地面上，再覆土形成一条条垄，用来保湿、改良贫瘠土壤并减少翻地劳动，因此带有“省力/少翻土”的含义。","拼写上也常见分开写作“lazy bed”；在现代园艺里有时会被更广义地理解为“少耕/免耕”的高畦思路，但在历史文献中多指传统的马铃薯垄作法。"]}
{"word":"lazybird","summary":{"en":"“Lazybird” is an informal, playful nickname for a lazy or slow-starting person; it’s not a very standard word in formal English.","zh":"“lazybird”多用于非正式、俏皮的昵称，指懒散或起步慢的人；在正式英语中并不算常见标准用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a playful or informal nickname for a person who is lazy, slow to start work, or likes staying in bed late","zh":"（非正式、带玩笑的称呼）懒人；做事慢、爱赖床的人"},"examples":[{"en":"Come on, lazybird—get up or we’ll miss the bus.","zh":"快点啦，懒鸟——再不起床我们就赶不上公交了。"},{"en":"He calls himself a “lazybird” on weekends because he sleeps until noon.","zh":"他周末会自称“懒鸟”，因为能睡到中午。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a literal “lazy bird,” meaning a bird that seems inactive or resting a lot","zh":"（少见）字面义“懒洋洋的鸟”；指看起来不怎么活动、常在休息的鸟"},"examples":[{"en":"That lazybird hasn’t moved for ten minutes.","zh":"那只懒洋洋的鸟十分钟都没动了。"}]}],"synonyms":["lazy person","couch potato","sleepyhead","slacker"],"phonetic":"/ˈleɪziˌbɝd/","extraExplanation":["“lazybird”不是非常固定、常见的标准英文单词，更常见的说法是“lazy person / couch potato / sleepyhead”。把“lazy + bird”合在一起通常是为了俏皮、可爱或取网名/昵称的感觉。","语气一般偏轻松调侃；如果对方敏感或在正式场合，建议避免使用，以免显得不礼貌。"]}
{"word":"lazybone","summary":{"en":"“Lazybones” means a lazy person, usually said informally in a teasing or mildly critical way.","zh":"“lazybones”指“懒人/懒虫”，多为非正式说法，常带调侃或轻微责备语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lazy person (informal; often used as a playful or mildly critical nickname)","zh":"懒人；懒虫（非正式用法，常带玩笑或轻微责备的语气）"},"examples":[{"en":"Come on, lazybones—get out of bed!","zh":"快点，懒虫——起床啦！"},{"en":"Stop being a lazybones and help me clean the room.","zh":"别当懒虫了，来帮我打扫房间。"},{"en":"He calls his brother “lazybones” when he doesn’t do chores.","zh":"他弟弟不做家务时，他就叫他“懒虫”。"}]}],"synonyms":["slacker","loafer","lazy bum","couch potato"],"phonetic":"/ˈleɪziˌboʊnz/","extraExplanation":["“lazybones”在形式上常用复数（以 -s 结尾），但意思通常指“一个人”。口语里多用于家人、朋友之间的调侃；在正式场合或对陌生人使用可能显得不礼貌。","近似语气的表达有：lazy bum（更口语、可能更刻薄）、couch potato（偏指爱窝在沙发看电视/不爱运动的人）。"]}
{"word":"lazybones","summary":{"en":"“Lazybones” means a lazy person, usually in a playful or mildly scolding way.","zh":"“lazybones”指懒人/懒骨头，多用于调侃或轻微责备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lazy person (often said in a teasing or mildly critical way)","zh":"懒骨头；懒人（常带开玩笑或轻微责备的语气）"},"examples":[{"en":"Come on, lazybones—get out of bed!","zh":"快点，懒骨头——起床啦！"},{"en":"He calls himself a lazybones on weekends because he sleeps in.","zh":"他周末爱睡懒觉，所以自嘲是个懒骨头。"},{"en":"Don’t be a lazybones; help me clean up.","zh":"别当懒骨头了，帮我收拾一下。"}]}],"synonyms":["lazy person","slacker","loafer","couch potato"],"phonetic":"/ˈleɪziˌboʊnz/","extraExplanation":["“lazybones”是非正式用语，语气通常偏调侃（尤其对家人、朋友或小孩），但在正式场合或对不熟的人使用可能显得不礼貌。","这个词常当作称呼（类似外号）来用：Hey/Oh, lazybones! 也可以用在句子里：Don’t be a lazybones. ","词形上看像复数（bones），但常作单数名词使用：a lazybones；有时也可作复数：They’re a couple of lazybones. "]}
{"word":"lazyboots","summary":{"en":"“lazyboots” means a lazy person (informal and humorous).","zh":"“lazyboots”指“懒人”，语气非正式、偏幽默。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often humorous) A lazy person; someone who avoids work or moves very slowly.","zh":"（非正式，常带幽默）懒人；不爱干活、行动慢、爱偷懒的人。"},"examples":[{"en":"Come on, lazyboots—help me carry these boxes.","zh":"快点，懒鬼——来帮我搬这些箱子。"},{"en":"He called himself a lazyboots, but he finished the project on time.","zh":"他自嘲是个懒人，但还是按时完成了项目。"}]}],"synonyms":["lazybones","slacker","loafer"],"phonetic":"/ˈleɪziˌbuːts/","extraExplanation":["“lazyboots”带有口语、打趣的语气，常用于家人朋友之间的轻松场合；在正式写作中很少见。","它通常是单数形式作称呼（like a nickname）。也可以写作“lazy boots”，但“lazyboots”更像固定绰号。"]}
{"word":"lazyhood","summary":{"en":"Lazyhood means the state or period of being lazy (an uncommon word).","zh":"lazyhood 指“懒惰的状态或时期”（较少见用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being lazy; a way of living characterized by laziness (rare/uncommon word)","zh":"懒惰的状态；（以懒散为特征的）生活方式或一段时期（较少见用词）"},"examples":[{"en":"He spent the summer in lazyhood, avoiding work and sleeping late.","zh":"他整个夏天都处在懒散状态里，躲着不干活，还睡到很晚。"},{"en":"She joked that weekend lazyhood was her favorite hobby.","zh":"她开玩笑说，周末的“懒散模式”是她最喜欢的爱好。"},{"en":"The novel contrasts the hero’s early lazyhood with his later discipline.","zh":"这部小说把主人公早年的懒散与后来养成的自律作了对比。"}]}],"synonyms":["laziness","idleness","sloth","indolence"],"phonetic":"/ˈleɪziˌhʊd/","extraExplanation":["“lazyhood”由 lazy + 后缀 -hood 构成。-hood 常表示“状态/身份/时期”（如 childhood 童年、neighborhood 社区、brotherhood 兄弟情谊）。因此 lazyhood 字面就是“懒惰之状态/时期”。","这是一个比较少见、略带幽默或文学味道的用法；更常见的表达是 laziness（懒惰）或 being lazy（很懒）。"]}
{"word":"lazying","summary":{"en":"“Lazying” is usually a misspelling; the correct form is “lazing,” meaning relaxing or spending time doing little.","zh":"“lazying”通常是拼写错误；正确形式是“lazing”，意思是懒散放松、无所事事地待着。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to spend time doing very little; to relax in an idle way (present participle of “laze”).","zh":"懒散地消磨时间；无所事事地放松（“laze”的现在分词）。"},"examples":[{"en":"We spent the afternoon lazing by the pool.","zh":"我们整个下午都在泳池边懒懒地待着。"},{"en":"He was lazing on the sofa instead of studying.","zh":"他躺在沙发上懒散着，不去学习。"}]},{"partOfSpeech":"adj.","definition":{"en":"relaxed and idle; done in a slow, comfortable way.","zh":"悠闲慵懒的；慢悠悠、很舒服的（氛围/活动）。"},"examples":[{"en":"It was a lazing Sunday with no plans.","zh":"那是个没有任何计划的慵懒周日。"},{"en":"They enjoyed a lazing walk along the beach.","zh":"他们享受了一次沿着海边的悠闲散步。"}]}],"synonyms":["lounging","idling","relaxing","resting"],"phonetic":"/ˈleɪzɪŋ/","extraExplanation":["你输入的“lazying”通常被认为是拼写错误。正确拼写一般是“lazing”。因为动词“laze”以不发音的 e 结尾，加 -ing 时要去掉 e：laze → lazing。","注意区别：lazy（adj. 懒的）描述“人/态度”；laze（v. 懒散地待着）描述“行为”。例如：He is lazy.（他很懒。） vs. He is lazing around.（他在到处闲晃/无所事事。）"]}
{"word":"lazyish","summary":{"en":"“Lazyish” means “a little lazy” in an informal, casual way.","zh":"“lazyish”表示“有点懒”，属于非正式、口语化表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat lazy; a little lazy (often used casually to soften the meaning).","zh":"有点懒的；懒懒的（口语，用来弱化语气）"},"examples":[{"en":"I’m feeling lazyish today, so I might just stay home.","zh":"我今天有点懒，可能就待在家里。"},{"en":"It’s a lazyish weekend—no big plans, just rest.","zh":"这是个懒懒的周末——没什么大计划，就休息。"},{"en":"He’s not lazy, just lazyish in the morning.","zh":"他不算懒，只是早上有点懒散。"}]}],"synonyms":["somewhat lazy","a bit lazy","kind of lazy","rather lazy"],"phonetic":"/ˈleɪziɪʃ/","extraExplanation":["“lazyish”是由“lazy + -ish”构成的非正式词。“-ish”常表示“有点……/大概……/带点……的感觉”，语气更委婉、随意。例如：greenish（有点绿）、tallish（有点高）、sixish（六点左右）。","这种说法更常见于口语、聊天、轻松的写作中；正式写作里通常用“somewhat lazy / a bit lazy / rather lazy”。"]}
{"word":"lazylegs","summary":{"en":"“Lazylegs” is an informal, playful nickname for a lazy person or someone who doesn’t want to move.","zh":"“lazylegs”是非正式、带玩笑语气的说法，指懒的人或不想动、走得慢的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, playful) A lazy person—especially said to a child as a teasing nickname.","zh":"（非正式、带玩笑语气）懒人；常用来逗孩子的外号，意思是“懒腿/懒虫”。"},"examples":[{"en":"Come on, Lazylegs—let’s clean up your room.","zh":"快点啦，小懒虫——把你的房间收拾一下。"},{"en":"Don’t be a lazylegs; get up and help set the table.","zh":"别偷懒啦，起来帮忙摆桌子。"}]},{"partOfSpeech":"n.","definition":{"en":"A humorous way to describe someone who is slow to move or doesn’t want to walk.","zh":"（幽默说法）形容一个人不想走、动作慢、懒得动。"},"examples":[{"en":"My lazylegs refused to go up one more flight of stairs.","zh":"我这双“懒腿”就是不肯再爬一层楼了。"},{"en":"After lunch, everyone had lazylegs and didn’t want to go back to work.","zh":"午饭后大家都犯懒，不想回去工作。"}]}],"synonyms":["lazybones","slacker","couch potato","slowpoke"],"phonetic":"ˈleɪziˌlɛɡz","extraExplanation":["“lazylegs”更常见的写法是分开写作“lazy legs”。合在一起写通常是为了像外号一样的效果（类似昵称）。","语气多为轻松、打趣；在正式场合或对不熟的人使用可能显得不礼貌。"]}
{"word":"lazys","summary":{"en":"“Lazy” means unwilling to work or use effort, or slow/relaxed in pace. “Lazys” is not standard spelling.","zh":"“lazy”表示“懒惰的；不愿意费力的”，也可表示“缓慢悠闲的”。“lazys”不是标准拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not willing to work or use effort; wanting to avoid activity.","zh":"懒惰的；不愿意花力气做事的。"},"examples":[{"en":"I feel lazy today, so I’m staying home.","zh":"我今天觉得很懒，所以待在家里。"},{"en":"He’s too lazy to cook, so he ordered takeout.","zh":"他懒得做饭，所以点了外卖。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done in a slow or relaxed way, often without much energy.","zh":"缓慢而悠闲的；没什么劲的。"},"examples":[{"en":"We spent a lazy afternoon reading and talking.","zh":"我们悠闲地过了一个下午，读书聊天。"},{"en":"A lazy river moved through the park.","zh":"一条缓慢流动的河穿过公园。"}]}],"synonyms":["idle","sluggish","inactive"],"phonetic":"/ˈleɪzi/","extraExplanation":["“lazys”不是标准拼写。你可能想写的是：","1) lazy（形容词）：I’m lazy. 我很懒。","2) lazies（名词复数，较少用）：the lazies = 懒人们（更自然说法：lazy people）。","3) laziness（名词）：懒惰。例：Laziness can be a problem. 懒惰可能是个问题。","常见搭配：feel lazy（觉得懒）、too lazy to + 动词（懒得做某事）、lazy day（悠闲的一天）。"]}
{"word":"lazyship","summary":{"en":"“Lazyship” is a playful, nonstandard noun meaning “laziness.”","zh":"“lazyship”是较口语/玩笑的非标准名词，意思相当于“laziness（懒惰）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or playful word meaning the state or habit of being lazy; laziness.","zh":"（非标准/玩笑用法）指懒惰的状态或习惯；懒散。"},"examples":[{"en":"My weekend was pure lazyship: pajamas, snacks, and no plans.","zh":"我的周末简直是“懒人模式”：睡衣、零食、没有任何计划。"},{"en":"He blamed his unfinished homework on lazyship instead of asking for help.","zh":"他把没写完作业怪在“懒惰”上，而不是去寻求帮助。"}]}],"synonyms":["laziness","idleness","sloth"],"phonetic":"/ˈleɪziʃɪp/","extraExplanation":["“lazyship”在标准英语里不常见，更常用的词是“laziness”。它通常出现在口语、网络文字或幽默表达中，用来夸张地把“懒”说成一种“状态/身份”。","后缀“-ship”常见于表示“身份、状态、性质”（如 friendship 友谊，leadership 领导力）。把它加在 lazy 后面属于创造性用法，因此更像玩笑或风格化表达。正式写作建议用 laziness。"]}
{"word":"lazzarone","summary":{"en":"A historical word for a very poor Neapolitan beggar/idler; often seen in travel or literary descriptions of Naples.","zh":"指那不勒斯的贫民、乞丐或游民的历史用词，常见于描写那不勒斯的旅行或文学作品中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A very poor person, especially a street beggar or idler in Naples, Italy; a member of the Neapolitan underclass.","zh":"（历史用语）极贫穷的人，尤指意大利那不勒斯的街头乞丐或游民；那不勒斯底层民众的一员。"},"examples":[{"en":"In the travel book, the author describes the lazzaroni sleeping by the harbor.","zh":"在那本游记里，作者描写了睡在港口边的那不勒斯贫民（lazzaroni）。"},{"en":"The painting shows a lazzarone in ragged clothes asking for food.","zh":"那幅画里有一个衣衫褴褛的那不勒斯乞丐（lazzarone）在讨要食物。"}]}],"synonyms":["beggar","vagrant","pauper","street urchin"],"phonetic":"/ˌlɑːtsəˈroʊni/","extraExplanation":["“lazzarone”来自意大利语，英语里也常见复数形式“lazzaroni”。这个词多用于18—19世纪的历史、文学或旅行写作中，带有时代色彩。","词源通常与《圣经》中“拉撒路（Lazarus）”相关：在欧洲文化里，Lazarus常与贫穷、乞讨者的形象联系在一起，因此该词也带有“穷人/乞丐”的联想。","现代日常英语里较少使用；写作时更常用更中性的词，如“beggar / homeless person / poor people”，以避免刻板印象。"]}
{"word":"lazzaroni","summary":{"en":"Lazzaroni refers to the poor street population of Naples (historically), and by extension can mean “idle rabble,” though it may sound insulting today.","zh":"lazzaroni 历史上指那不勒斯的贫民/街头穷人；引申可指“游手好闲的乌合之众”，但现代语境里可能带侮辱色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Poor, often unemployed street people in Naples, Italy; the urban underclass.","zh":"（历史用法）意大利那不勒斯的贫民/街头穷人群体；城市底层民众。"},"examples":[{"en":"In 18th‑century accounts of Naples, the lazzaroni were described as living by odd jobs and charity.","zh":"在18世纪关于那不勒斯的记载中，lazzaroni 常被描述为靠零工和施舍度日。"},{"en":"The traveler wrote that the lazzaroni gathered near the harbor each morning.","zh":"这位旅行者写道，lazzaroni 每天早晨会聚集在港口附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(often figurative, sometimes offensive) People seen as idle, ragged, or disorderly.","zh":"（常作比喻用法，有时带冒犯）被认为游手好闲、衣衫褴褛或不守秩序的人。"},"examples":[{"en":"The newspaper unfairly dismissed the protestors as “lazzaroni.”","zh":"那家报纸不公平地把抗议者贬称为“lazzaroni”。"},{"en":"Try not to use the term for modern groups—it can sound classist and insulting.","zh":"尽量不要用这个词指代现代群体——它可能显得很阶级偏见、也很侮辱人。"}]}],"synonyms":["Neapolitan poor (historical)","street people (context-dependent)","rabble (figurative)","riffraff (figurative)"],"phonetic":"/ˌlɑːtsəˈroʊni/","extraExplanation":["词形提示：lazzaroni 是复数形式；单数是 lazzarone。英语里有时也把 lazzaroni 当作“集体名词”来用，但更常见仍是复数含义。","文化背景：这个词源自意大利语，常与那不勒斯的贫民阶层联系在一起；有学者认为它可能与“Lazarus（拉撒路）”的形象（贫困者、乞者的象征）在文化联想上有关。由于带有阶层评判色彩，在现代语境中使用需谨慎。"]}
