{"word":"ld","summary":{"en":"“LD” is a common abbreviation; it most often means “learning disability,” but it can also refer to a medical marker (lactate dehydrogenase) or a baseball term (line drive), depending on context.","zh":"“LD”是常见缩写，最常指“learning disability（学习障碍）”，也可能在医学中指“乳酸脱氢酶”，或在棒球语境中指“line drive（平直强劲的击球）”，需结合上下文理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “learning disability” (a condition that makes certain kinds of learning, like reading, harder)","zh":"“learning disability（学习障碍）”的缩写，指在阅读等学习技能上存在明显困难的情况"},"examples":[{"en":"She was diagnosed with an LD in elementary school.","zh":"她在小学时被诊断出有学习障碍（LD）。"},{"en":"The school provides support for students with LD.","zh":"学校为有学习障碍（LD）的学生提供支持。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “lactate dehydrogenase,” a blood test marker used in medicine","zh":"“lactate dehydrogenase（乳酸脱氢酶）”的缩写，是医学检验中常见的血液指标之一"},"examples":[{"en":"The doctor ordered an LD test along with other blood work.","zh":"医生除了其他血液检查外，还开了LD（乳酸脱氢酶）检测。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “line drive” in baseball (a hard, straight hit)","zh":"棒球里“line drive（平直强劲的击球）”的缩写"},"examples":[{"en":"He hit an LD into left field for a single.","zh":"他打出一记平直强劲的球（LD）到左外野，形成一垒安打。"}]}],"phonetic":"/ˌɛlˈdiː/","extraExplanation":["“LD”在英文里通常作为缩写使用，具体含义高度依赖语境：教育场景多指学习障碍；医学报告常见为乳酸脱氢酶；体育新闻（尤其棒球）可能指line drive。","书写上常见“LD”大写；在正式文件里，首次出现通常会先写全称（如learning disability），后面再用缩写。"]}
{"word":"LDC","summary":{"en":"LDC most commonly means “least developed country/countries,” a UN development category; it can also be another acronym depending on context.","zh":"LDC 最常见指“最不发达国家”（联合国的发展分类）；也可能在不同语境中代表其他机构/名称缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"least developed country/countries (a UN category for nations with very low income and major development challenges)","zh":"最不发达国家（联合国对低收入、发展困难国家的分类）"},"examples":[{"en":"The UN reviews the LDC list every three years.","zh":"联合国每三年会审查一次最不发达国家（LDC）名单。"},{"en":"Many LDCs receive special trade support from richer countries.","zh":"许多最不发达国家会获得发达国家的特殊贸易支持。"}]},{"partOfSpeech":"other","definition":{"en":"(in some contexts) an abbreviation for an organization or unit named “LDC” (the meaning depends on the field, document, or company)","zh":"（在某些语境中）“LDC”也可能是某个机构/部门名称的缩写（具体含义取决于领域、文件或公司）"},"examples":[{"en":"Please confirm what LDC stands for in this report.","zh":"请确认这份报告里的 LDC 具体代表什么。"},{"en":"Our client, LDC, will send the contract tomorrow.","zh":"我们的客户 LDC 明天会发送合同。"}]}],"synonyms":["Least Developed Countries","least developed country","UN LDCs"],"phonetic":"/ˌɛl diː ˈsiː/","extraExplanation":["在国际发展语境中，LDC 最常见指联合国的“最不发达国家”（Least Developed Countries）。它是一种政策分类，用于识别在收入、教育健康等人类发展指标与经济脆弱性方面面临更大挑战的国家，以便给予特殊支持（如援助、贸易优惠、技术合作等）。","如果你是在公司文件、物流、工程、医疗或某个学校/机构里看到 LDC，它也可能是内部缩写（例如某个中心、委员会、部门名）。最好结合上下文标题、首次出现处的全称或附录缩写表来确认。"]}
{"word":"LDG","summary":{"en":"An abbreviation; often an airport code (IATA).","zh":"一个缩写；常见为机场三字码（IATA）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation, most commonly used as an IATA airport code for Leshukonskoye Airport (Arkhangelsk Oblast, Russia).","zh":"缩写；最常见用法是俄罗斯阿尔汉格尔斯克州列舒孔斯科耶机场（Leshukonskoye Airport）的国际航协（IATA）机场代码。"},"examples":[{"en":"My ticket shows LDG as the destination airport.","zh":"我的机票上目的地机场代码写的是 LDG。"},{"en":"LDG is a small regional airport in Russia.","zh":"LDG 是俄罗斯的一座小型地区机场。"}]}],"phonetic":"ˌɛl diː ˈdʒiː","extraExplanation":["LDG 也可能在不同领域代表别的含义（例如公司/项目缩写、网络用语等）。如果你告诉我它出现的场景（航班信息、游戏、聊天、文件标题等），我可以给出最准确的释义。"],"etymology":"来自国际航协（IATA）分配的三字母机场代码体系；LDG 是为 Leshukonskoye Airport 指定的代码。","mnemonic":["把 LDG 当作三个字母来记：L-D-G（“艾尔-迪-吉”），常见于机票/航班信息的机场三字码。"]}
{"word":"ldg","summary":{"en":"“LDG” is usually an abbreviation; its meaning depends on where you see it.","zh":"“LDG”通常是缩写；具体意思取决于使用场景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"LDG: an initialism (abbreviation) made from the first letters of a longer name; its exact meaning depends on the context (company names, school programs, technical terms, etc.).","zh":"LDG：由多个词的首字母组成的缩写；具体含义取决于语境（公司名、学校项目、技术术语等）。"},"examples":[{"en":"What does LDG stand for in this email?","zh":"这封邮件里的 LDG 是什么的缩写？"},{"en":"Our school uses LDG as a short name for one of its programs.","zh":"我们学校用 LDG 作为某个项目的简称。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌɛl diː ˈdʒiː/","extraExplanation":["“LDG”本身不是常见英语单词，通常读作三个字母的名称。如果你把它出现的句子或领域（例如游戏、工程、学校、公司）发我，我可以帮你判断最可能的全称与意思。"]}
{"word":"ldinfo","summary":{"en":"“ldinfo” is usually a tool name or abbreviation meaning “LD info,” often referring to dynamic linking information in computing or LD/LDH-related information in medical contexts.","zh":"“ldinfo”通常是工具名或缩写，表示“LD 信息”：在计算机领域常指动态链接相关信息；在医疗语境中也可能指乳酸脱氢酶（LD/LDH）相关信息。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing, especially on macOS) A command-line tool name meaning “linker/dynamic-loader info,” used to display information about binaries, libraries, or dynamic linking related data.","zh":"（计算机，尤指 macOS）一个命令行工具名，含义类似“链接器/动态加载器信息”，用于查看可执行文件、库文件或动态链接相关的信息。"},"examples":[{"en":"On macOS, you might use ldinfo to inspect details about a system library.","zh":"在 macOS 上，你可能会用 ldinfo 来查看某个系统库的详细信息。"},{"en":"If a program won’t start, checking dynamic linking info with ldinfo can help troubleshooting.","zh":"如果程序无法启动，用 ldinfo 查看动态链接信息有时能帮助排查问题。"}]},{"partOfSpeech":"other","definition":{"en":"(medicine, abbreviation) Short for “LD info,” meaning information related to lactate dehydrogenase (LD/LDH) test results.","zh":"（医学缩写）“LD info”的简写，指与乳酸脱氢酶（LD/LDH）检验结果相关的信息。"},"examples":[{"en":"The report includes LD info along with other blood test values.","zh":"报告里除了其他血检指标，也包含 LD（乳酸脱氢酶）相关信息。"}]}],"synonyms":["linker info","dynamic loader info","LDH info"],"phonetic":"/ˌɛlˈdiːˌɪnfoʊ/","extraExplanation":["“ldinfo”不是常见日常英语单词，更像是专有名词/工具名或缩写。不同系统与语境中它可能指不同东西：在技术语境里常被理解为“linker/dynamic loader info”；在医疗记录里也可能只是“LD（或 LDH）相关信息”的简写。","如果你是在终端里看到它，告诉我操作系统（macOS/Linux/Windows）和你看到的完整命令行（例如后面跟了哪些参数），我可以更准确解释它具体做什么。"]}
{"word":"ldl","summary":{"en":"LDL = low-density lipoprotein, often called “bad cholesterol.”","zh":"LDL 指低密度脂蛋白，常被称为“坏胆固醇”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Low-density lipoprotein, a type of particle in the blood that carries cholesterol; often called “bad cholesterol” because high levels are linked to a higher risk of heart disease.","zh":"低密度脂蛋白（LDL），血液中运载胆固醇的一类脂蛋白；常被称为“坏胆固醇”，因为水平过高与心血管疾病风险增加有关。"},"examples":[{"en":"My doctor said my LDL is high, so I need to improve my diet and exercise more.","zh":"医生说我的 LDL 偏高，所以我需要改善饮食并多运动。"},{"en":"A blood test can measure LDL, HDL, and triglycerides.","zh":"验血可以测出 LDL、HDL 和甘油三酯。"},{"en":"Lowering LDL can help reduce the risk of heart attacks and strokes.","zh":"降低 LDL 有助于减少心脏病发作和中风风险。"}]}],"synonyms":["low-density lipoprotein","bad cholesterol (informal)"],"phonetic":"/ˌɛl.diːˈɛl/","extraExplanation":["LDL 通常写作大写，因为它是医学缩写，读作字母音：L-D-L。","日常英语里人们常说 “LDL (bad cholesterol)” 和 “HDL (good cholesterol)”。但“好/坏”是简化说法，具体是否需要治疗要看个人总体风险与医生建议。"]}
{"word":"LDR","summary":{"en":"an abbreviation most often meaning a long-distance romantic relationship; also used for a light-sensitive resistor in electronics","zh":"常见缩写，多指“异地恋”；在电子领域也可指“光敏电阻”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long-distance relationship (a romantic relationship in which partners live far apart)","zh":"异地恋；远距离恋爱（情侣两地分居、相隔较远的恋爱关系）"},"examples":[{"en":"They’ve been in an LDR since she moved to Seattle for work.","zh":"她为了工作搬到西雅图后，他们就一直在异地恋。"},{"en":"An LDR can work if you communicate regularly and plan visits.","zh":"如果经常沟通并计划见面，异地恋也能维持得很好。"},{"en":"He said he doesn’t want an LDR because he values daily time together.","zh":"他说他不想异地恋，因为他很看重每天能在一起的时间。"}]},{"partOfSpeech":"n.","definition":{"en":"a light-dependent resistor (an electronic component whose resistance changes with light)","zh":"光敏电阻（随光照强弱改变电阻的电子元件）"},"examples":[{"en":"The circuit uses an LDR to detect changes in brightness.","zh":"这个电路用光敏电阻来检测亮度变化。"},{"en":"When light hits the LDR, its resistance drops.","zh":"光照到光敏电阻上时，它的电阻会下降。"}]}],"synonyms":["long-distance relationship","long-distance romance","distance relationship","light-dependent resistor","photoresistor"],"phonetic":"ˌɛl diː ˈɑr","extraExplanation":["社交语境里常见写法包括：in an LDR（在异地恋中）、do LDR（进行异地恋）。如果不确定含义，可看上下文：谈感情/城市距离通常指“异地恋”；谈电路/传感器通常指“光敏电阻”。"],"etymology":"多为缩写用法：在聊天与社交媒体中，LDR 常指 long-distance relationship（取首字母）；在电子领域中，LDR 也常指 light-dependent resistor（同样取首字母）。","mnemonic":["把 LDR 记成“Long Distance Romance”（远距离恋爱）也好记：L=Long，D=Distance，R=Relationship/Romance。","电子里把 LDR 想成“Light Does (the) Resistance”（光照会改变电阻）。"]}
{"word":"LDRs","summary":{"en":"long-distance romantic relationships","zh":"异地恋（的关系）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"long-distance relationships; romantic relationships where partners live far apart and can’t meet often","zh":"异地恋；指恋人分隔两地、难以经常见面的恋爱关系"},"examples":[{"en":"They’ve been in an LDR for two years, so they video call every night.","zh":"他们异地恋两年了，所以每天晚上都会视频通话。"},{"en":"LDRs can work if both people communicate well and make clear plans to visit.","zh":"如果双方沟通良好、并把见面计划说清楚，异地恋也能维持得很好。"},{"en":"She’s worried about starting an LDR after graduation.","zh":"她担心毕业后开始异地恋。"}]}],"synonyms":["long-distance relationships","distance relationship","long-distance romance"],"phonetic":"/ˌɛl.diːˈɑːrz/","extraExplanation":["常见写法：LDR（单数）、LDRs（复数）。有时也写作 LDR relationship（口语/网聊里会出现，但严格说有点重复）。","语境提示：多用于非正式场合（短信、社交平台、口语）。在正式写作中更常写全称 long-distance relationship(s)。"],"etymology":"这是网络缩写：LDR = long-distance relationship（异地恋），加 -s 表复数，常见于社交媒体、聊天与论坛。","mnemonic":["把 L-D-R 记成：Long（长） + Distance（距离） + Relationship（关系）＝“异地恋”。"]}
{"word":"LDS","summary":{"en":"connected with The Church of Jesus Christ of Latter-day Saints.","zh":"与“耶稣基督后期圣徒教会/后期圣徒”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for The Church of Jesus Christ of Latter-day Saints, or for its members (Latter-day Saints).","zh":"“耶稣基督后期圣徒教会”（及其成员“后期圣徒”）的缩写。"},"examples":[{"en":"She grew up in an LDS family in Utah.","zh":"她在犹他州一个后期圣徒（LDS）家庭中长大。"},{"en":"Many LDS members volunteer in their communities.","zh":"许多LDS成员会在社区做志愿服务。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to The Church of Jesus Christ of Latter-day Saints or its beliefs and practices.","zh":"与“耶稣基督后期圣徒教会”及其信仰、实践有关的。"},"examples":[{"en":"They attended an LDS service on Sunday.","zh":"他们周日参加了后期圣徒（LDS）的礼拜。"},{"en":"The museum has an exhibit on LDS history.","zh":"这家博物馆有一个关于后期圣徒（LDS）历史的展览。"}]}],"synonyms":["Latter-day Saints","The Church of Jesus Christ of Latter-day Saints","LDS Church","Mormon"],"phonetic":"/ˌɛl diː ˈɛs/","extraExplanation":["文化用法提示：在英语中，LDS 曾被广泛用来指该教会或其成员；不过该教会近年更鼓励使用“Latter-day Saints（后期圣徒）”或直接使用教会全名，以强调“耶稣基督”在名称中的核心位置。","“Mormon（摩门）”在历史上也常用来指该教会成员，但对部分信徒而言并非最偏好的称呼；正式场合更建议用 “Latter-day Saints” 或全名。"],"etymology":"来自英文全称 The Church of Jesus Christ of Latter-day Saints 的首字母缩写（L-D-S）；在美国尤其常见。","mnemonic":["记忆法：LDS = Latter-day Saints（后期圣徒）的首字母，联想“后期(Last/Latter)-日(day)-圣徒(Saints)”三个关键词。"]}

