{"word":"ld","summary":{"en":"“LD” is a common abbreviation; it most often means “learning disability,” but it can also refer to a medical marker (lactate dehydrogenase) or a baseball term (line drive), depending on context.","zh":"“LD”是常见缩写，最常指“learning disability（学习障碍）”，也可能在医学中指“乳酸脱氢酶”，或在棒球语境中指“line drive（平直强劲的击球）”，需结合上下文理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “learning disability” (a condition that makes certain kinds of learning, like reading, harder)","zh":"“learning disability（学习障碍）”的缩写，指在阅读等学习技能上存在明显困难的情况"},"examples":[{"en":"She was diagnosed with an LD in elementary school.","zh":"她在小学时被诊断出有学习障碍（LD）。"},{"en":"The school provides support for students with LD.","zh":"学校为有学习障碍（LD）的学生提供支持。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “lactate dehydrogenase,” a blood test marker used in medicine","zh":"“lactate dehydrogenase（乳酸脱氢酶）”的缩写，是医学检验中常见的血液指标之一"},"examples":[{"en":"The doctor ordered an LD test along with other blood work.","zh":"医生除了其他血液检查外，还开了LD（乳酸脱氢酶）检测。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “line drive” in baseball (a hard, straight hit)","zh":"棒球里“line drive（平直强劲的击球）”的缩写"},"examples":[{"en":"He hit an LD into left field for a single.","zh":"他打出一记平直强劲的球（LD）到左外野，形成一垒安打。"}]}],"phonetic":"/ˌɛlˈdiː/","extraExplanation":["“LD”在英文里通常作为缩写使用，具体含义高度依赖语境：教育场景多指学习障碍；医学报告常见为乳酸脱氢酶；体育新闻（尤其棒球）可能指line drive。","书写上常见“LD”大写；在正式文件里，首次出现通常会先写全称（如learning disability），后面再用缩写。"]}
{"word":"ldg","summary":{"en":"“LDG” is usually an abbreviation; its meaning depends on where you see it.","zh":"“LDG”通常是缩写；具体意思取决于使用场景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"LDG: an initialism (abbreviation) made from the first letters of a longer name; its exact meaning depends on the context (company names, school programs, technical terms, etc.).","zh":"LDG：由多个词的首字母组成的缩写；具体含义取决于语境（公司名、学校项目、技术术语等）。"},"examples":[{"en":"What does LDG stand for in this email?","zh":"这封邮件里的 LDG 是什么的缩写？"},{"en":"Our school uses LDG as a short name for one of its programs.","zh":"我们学校用 LDG 作为某个项目的简称。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌɛl diː ˈdʒiː/","extraExplanation":["“LDG”本身不是常见英语单词，通常读作三个字母的名称。如果你把它出现的句子或领域（例如游戏、工程、学校、公司）发我，我可以帮你判断最可能的全称与意思。"]}
{"word":"ldinfo","summary":{"en":"“ldinfo” is usually a tool name or abbreviation meaning “LD info,” often referring to dynamic linking information in computing or LD/LDH-related information in medical contexts.","zh":"“ldinfo”通常是工具名或缩写，表示“LD 信息”：在计算机领域常指动态链接相关信息；在医疗语境中也可能指乳酸脱氢酶（LD/LDH）相关信息。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing, especially on macOS) A command-line tool name meaning “linker/dynamic-loader info,” used to display information about binaries, libraries, or dynamic linking related data.","zh":"（计算机，尤指 macOS）一个命令行工具名，含义类似“链接器/动态加载器信息”，用于查看可执行文件、库文件或动态链接相关的信息。"},"examples":[{"en":"On macOS, you might use ldinfo to inspect details about a system library.","zh":"在 macOS 上，你可能会用 ldinfo 来查看某个系统库的详细信息。"},{"en":"If a program won’t start, checking dynamic linking info with ldinfo can help troubleshooting.","zh":"如果程序无法启动，用 ldinfo 查看动态链接信息有时能帮助排查问题。"}]},{"partOfSpeech":"other","definition":{"en":"(medicine, abbreviation) Short for “LD info,” meaning information related to lactate dehydrogenase (LD/LDH) test results.","zh":"（医学缩写）“LD info”的简写，指与乳酸脱氢酶（LD/LDH）检验结果相关的信息。"},"examples":[{"en":"The report includes LD info along with other blood test values.","zh":"报告里除了其他血检指标，也包含 LD（乳酸脱氢酶）相关信息。"}]}],"synonyms":["linker info","dynamic loader info","LDH info"],"phonetic":"/ˌɛlˈdiːˌɪnfoʊ/","extraExplanation":["“ldinfo”不是常见日常英语单词，更像是专有名词/工具名或缩写。不同系统与语境中它可能指不同东西：在技术语境里常被理解为“linker/dynamic loader info”；在医疗记录里也可能只是“LD（或 LDH）相关信息”的简写。","如果你是在终端里看到它，告诉我操作系统（macOS/Linux/Windows）和你看到的完整命令行（例如后面跟了哪些参数），我可以更准确解释它具体做什么。"]}
{"word":"ldl","summary":{"en":"LDL = low-density lipoprotein, often called “bad cholesterol.”","zh":"LDL 指低密度脂蛋白，常被称为“坏胆固醇”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Low-density lipoprotein, a type of particle in the blood that carries cholesterol; often called “bad cholesterol” because high levels are linked to a higher risk of heart disease.","zh":"低密度脂蛋白（LDL），血液中运载胆固醇的一类脂蛋白；常被称为“坏胆固醇”，因为水平过高与心血管疾病风险增加有关。"},"examples":[{"en":"My doctor said my LDL is high, so I need to improve my diet and exercise more.","zh":"医生说我的 LDL 偏高，所以我需要改善饮食并多运动。"},{"en":"A blood test can measure LDL, HDL, and triglycerides.","zh":"验血可以测出 LDL、HDL 和甘油三酯。"},{"en":"Lowering LDL can help reduce the risk of heart attacks and strokes.","zh":"降低 LDL 有助于减少心脏病发作和中风风险。"}]}],"synonyms":["low-density lipoprotein","bad cholesterol (informal)"],"phonetic":"/ˌɛl.diːˈɛl/","extraExplanation":["LDL 通常写作大写，因为它是医学缩写，读作字母音：L-D-L。","日常英语里人们常说 “LDL (bad cholesterol)” 和 “HDL (good cholesterol)”。但“好/坏”是简化说法，具体是否需要治疗要看个人总体风险与医生建议。"]}
