{"word":"lh","summary":{"en":"LH most commonly means “luteinizing hormone” (medical) or “left hand” (instructions/music).","zh":"LH最常见的意思是“黄体生成素（医学）”或“左手（说明/乐谱）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for luteinizing hormone, a hormone involved in ovulation and testosterone production (common in medical and biology contexts).","zh":"黄体生成素（促黄体激素）的缩写；一种与排卵和睾酮生成有关的激素（常见于医学、生物学语境）。"},"examples":[{"en":"The doctor ordered an LH test to check her ovulation.","zh":"医生开了黄体生成素（LH）检测来确认她是否排卵。"},{"en":"High LH levels can be related to certain hormone conditions.","zh":"LH水平偏高可能与某些激素相关疾病有关。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for left hand (used in music, sports, and instructions).","zh":"左手的缩写（用于音乐、运动或操作说明中）。"},"examples":[{"en":"Play the melody with your RH and the chords with your LH.","zh":"用右手（RH）弹旋律，用左手（LH）弹和弦。"},{"en":"Hold the bowl in your LH and mix with your right hand.","zh":"用左手拿碗，右手搅拌。"}]}],"synonyms":["luteinizing hormone","left hand"],"phonetic":"/ˌɛlˈeɪtʃ/","extraExplanation":["“LH”在不同场景含义差别很大：在医院/体检报告里几乎总是指黄体生成素；在钢琴谱、鼓谱或训练笔记里常指 left hand（左手），对应 RH（right hand，右手）。","如果你指的是网络聊天里的“lh”，也可能是某个小圈子缩写（例如人名、游戏术语等）。你可以告诉我上下文（在哪看到的、前后一句话），我能更准确解释。"]}
{"word":"Lhasa","summary":{"en":"Lhasa is the capital city of Tibet Autonomous Region, famous for Tibetan Buddhist heritage.","zh":"Lhasa（拉萨）是西藏自治区的首府，以藏传佛教文化遗产著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of the Tibet Autonomous Region of China, located on the Tibetan Plateau and known for its historical and religious importance (especially Tibetan Buddhism).","zh":"拉萨（西藏自治区首府），位于青藏高原，以其历史与宗教（尤其藏传佛教）地位闻名。"},"examples":[{"en":"Many travelers visit Lhasa to see the Potala Palace.","zh":"许多旅行者去拉萨参观布达拉宫。"},{"en":"Lhasa sits at a high altitude, so visitors often need time to adjust.","zh":"拉萨海拔很高，游客通常需要时间适应。"},{"en":"The old streets of Lhasa are full of shops, pilgrims, and local food.","zh":"拉萨的老街上有许多商店、朝圣者和本地美食。"}]}],"synonyms":["Lasa (variant spelling)"],"phonetic":"ˈlɑːsə","extraExplanation":["“Lhasa”常被解释为源自藏语的“神之地/众神之地”（place of the gods），也常见音译为“拉萨”。在英文中它是专有名词，首字母要大写：Lhasa。"]}
{"word":"lhb","summary":{"en":"LHB usually refers to an acronym; its exact meaning depends on context.","zh":"LHB 通常是首字母缩写；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can stand for different things depending on the field (medicine, sports, business, etc.); its meaning is not fixed without context.","zh":"缩写词：在不同领域（医学、体育、商业等）可能代表不同含义；没有上下文时无法确定唯一意思。"},"examples":[{"en":"What does LHB mean in this report?","zh":"这份报告里的 LHB 是什么意思？"},{"en":"LHB can mean different things, so please share the full sentence.","zh":"LHB 可能有不同含义，请把完整句子发来。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌɛl eɪtʃ ˈbiː/","extraExplanation":["“LHB”本身不是一个常见的独立英文单词，更常见的是首字母缩写（acronym/initialism）。常见于专业语境：例如医学检验指标、体育（如棒球位置/类型的缩写）、公司/机构名称等。","为了给出最准确的释义，请你提供：1）它出现的句子或段落；2）所属领域（医学/游戏/体育/聊天缩写等）；3）是否全大写 LHB 或小写 lhb。"]}
{"word":"lhd","summary":{"en":"LHD usually means “left-hand drive”; sometimes it means “left-hand dominant.”","zh":"LHD通常指“左舵（左侧驾驶位）”；有时也指“左利手（左手为主）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation most commonly meaning “left-hand drive,” a vehicle designed to be driven on the right side of the road (the steering wheel is on the left).","zh":"缩写，最常见意思是“左舵（左侧驾驶位）”，指方向盘在左边、通常靠右行驶的国家使用的车辆设计。"},"examples":[{"en":"Most cars in the U.S. are LHD.","zh":"美国大多数汽车都是LHD（左舵）。"},{"en":"Japan mainly uses RHD, not LHD.","zh":"日本主要使用RHD（右舵），不是LHD。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) an abbreviation meaning “left-hand dominant,” describing a person who mainly uses their left hand.","zh":"（较少见）缩写，表示“左手为主（左利手）”，指一个人主要用左手。"},"examples":[{"en":"She is LHD, so she writes with her left hand.","zh":"她是LHD（左利手），所以用左手写字。"}]}],"synonyms":["left-hand drive","left-hand dominant"],"phonetic":"/ˌɛl eɪtʃ ˈdiː/","extraExplanation":["“LHD”是缩写，在不同领域可能代表不同意思；最常见于汽车语境（left-hand drive）。在医学、工程或组织名称里也可能有其他含义，所以如果你告诉我上下文（比如汽车、医学报告、聊天内容），我可以给出更准确的解释。"]}
{"word":"lherzite","summary":{"en":"Lherzolite: a mantle-derived peridotite rich in olivine and both pyroxenes.","zh":"二辉橄榄岩：一种地幔来源的橄榄岩，富含橄榄石并同时含两类辉石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of peridotite (ultramafic rock) mainly made of olivine plus both pyroxenes (orthopyroxene and clinopyroxene), common in Earth’s upper mantle and sometimes brought to the surface in volcanic rocks as xenoliths.","zh":"一种橄榄岩（超镁铁质岩），主要由橄榄石以及两种辉石（斜方辉石与单斜辉石）组成，常见于地幔上部，也会以捕虏体（xenolith）的形式随火山岩被带到地表。"},"examples":[{"en":"Geologists studied a lherzolite xenolith to learn about the composition of the upper mantle.","zh":"地质学家研究了一块二辉橄榄岩捕虏体，以了解地幔上部的成分。"},{"en":"The sample contains olivine and both kinds of pyroxene, so it is classified as lherzolite.","zh":"这份样品含有橄榄石和两类辉石，因此被归类为二辉橄榄岩。"}]}],"synonyms":["peridotite (broader term)"],"phonetic":"/ˈlɛr.zəˌlaɪt/","extraExplanation":["你输入的“lherzite”在英文中更常见、标准的写法是 **lherzolite**（二辉橄榄岩）；“lherzite”有时被当作简写或误拼。","词源来自法国比利牛斯山的 **Lherz** 地区（当地出露并描述了这种岩石），因此名字带有地名色彩。","在岩石分类里，lherzolite 属于 peridotite（橄榄岩）的一种；与之相对的常见相关名词还有 **harzburgite**（方辉橄榄岩）和 **dunite**（纯橄岩），它们的主要区别在于辉石含量不同。"]}
{"word":"lherzolite","summary":{"en":"Lherzolite is an ultramafic rock rich in olivine and two pyroxenes, often used as a key reference for Earth’s upper mantle.","zh":"Lherzolite 是一种富含橄榄石与两种辉石的超镁铁质岩石，常作为研究地球上地幔的关键参照岩石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of coarse-grained ultramafic igneous rock made mainly of olivine plus two pyroxenes (orthopyroxene and clinopyroxene); it is considered an important rock of Earth’s upper mantle.","zh":"一种粗粒的超镁铁质火成岩，主要由橄榄石和两种辉石（斜方辉石与单斜辉石）组成；常被认为是地球上地幔的重要组成岩石。"},"examples":[{"en":"Many models of the upper mantle treat lherzolite as a representative mantle rock.","zh":"许多上地幔模型把橄榄岩（lherzolite）视为具有代表性的地幔岩石。"},{"en":"The xenoliths brought up by the basalt include lherzolite and harzburgite.","zh":"这次玄武岩携带上来的捕虏体包括橄榄岩（lherzolite）和方辉橄榄岩（harzburgite）。"}]}],"synonyms":["mantle peridotite","peridotite (broad term)"],"phonetic":"/ˈlɛrzəˌlaɪt/","extraExplanation":["“lherzolite”一词来自法国比利牛斯山的 Lherz 地区（也写作 Lherz 或 Lers），因当地出露的典型岩石而得名。","在地球科学里，lherzolite 常被用来讨论“未明显亏损”的上地幔组成；相对地，harzburgite 往往代表经历过更强部分熔融、更加“亏损”的地幔残余。"]}
{"word":"lhiamba","summary":{"en":"“lhiamba” is a regional slang word meaning marijuana/cannabis.","zh":"“lhiamba”是地区性俚语，意思是“大麻/麻类毒品”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Regional slang, especially in parts of southern Africa) marijuana; cannabis.","zh":"（地区俚语，尤指南部非洲部分地区）大麻；麻类毒品。"},"examples":[{"en":"The police said they had found lhiamba during the search.","zh":"警方表示在搜查过程中发现了“大麻”。"},{"en":"In some communities, “lhiamba” is a local slang term for cannabis.","zh":"在一些社区里，“lhiamba”是指大麻的本地俚语。"}]}],"synonyms":["cannabis","marijuana","weed","pot"],"phonetic":"/liˈɑːmbə/","extraExplanation":["“lhiamba”不是全球通用的标准英语词，更常见于特定地区的英语/葡语语境中的俚语或转写拼法；不同地方也可能拼作“liamba”等。","由于它指涉非法药物（在许多国家/地区属违法或受严格管制），在正式写作中更建议用中性、标准的词如“cannabis / marijuana”，并注意语境与法律风险。"]}
{"word":"lhota","summary":{"en":"Lhota refers to the Lhota (Lotha) Naga people of Nagaland, India, or the language they speak.","zh":"Lhota 指印度那加兰邦的洛塔（Lotha）那加族及其所说的洛塔语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Lhota (Lotha) Naga people, an ethnic group mainly living in Nagaland, India","zh":"洛塔（Lhota/Lotha）那加族人；主要居住在印度那加兰邦的一个民族"},"examples":[{"en":"The Lhota are one of the Naga groups in northeastern India.","zh":"洛塔族是印度东北部那加族群之一。"},{"en":"She visited a village where many Lhota families live.","zh":"她参观了一个有许多洛塔族家庭居住的村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"the Tibeto-Burman language spoken by the Lhota people (often called the Lhota Naga language)","zh":"洛塔语；洛塔族使用的语言（常称“洛塔那加语”）"},"examples":[{"en":"He is learning Lhota to communicate with local elders.","zh":"他正在学习洛塔语，以便与当地长者交流。"},{"en":"Lhota is used at home, while English may be used in school.","zh":"家里使用洛塔语，而学校里可能使用英语。"}]}],"synonyms":["Lotha","Lhota Naga"],"phonetic":"/ˈloʊtə/","extraExplanation":["“Lhota”也常见拼写为“Lotha”。这类族群名称在英语里通常既可指“族人”，也可指“语言”。在学术写作中，为避免歧义，常写作“the Lhota people”或“the Lhota language / Lhota Naga language”。"]}
