{"word":"ll","summary":{"en":"“ll” is usually not a standalone English word; it’s often typed instead of “’ll” (will/shall), or it can refer to the “ll” letter combination in languages like Spanish.","zh":"“ll”通常不是独立的英文单词；常见是把“’ll”（will/shall 的缩写）误打成“ll”，也可能指西班牙语等语言中的“ll”字母组合。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal texting) A misspelling or shortened form people type when they mean “’ll” (short for “will/shall”), as in I’ll / you’ll.","zh":"（非正式短信/打字）有时人们把“’ll”（I’ll / you’ll 中表示 will/shall 的缩写）误打或简写成“ll”。"},"examples":[{"en":"Text: “Ill call you later” (intended: “I’ll call you later.”)","zh":"短信：“Ill call you later”（想表达的是：“I’ll call you later.”）"},{"en":"She typed “youll see” instead of “you’ll see.”","zh":"她把 “youll see” 打成了 “you’ll see.”"}]},{"partOfSpeech":"other","definition":{"en":"A letter combination (digraph) in some languages; for example, Spanish “ll” is traditionally treated as a distinct sound (though many speakers pronounce it like “y”).","zh":"（字母组合/双字母）在一些语言中表示特定发音；例如西班牙语 “ll” 传统上算作一个独立音（但很多地区读音接近英语的 y）。"},"examples":[{"en":"In Spanish, “ll” appears in words like “llama.”","zh":"西班牙语里 “ll” 出现在如 “llama”（羊驼/火焰，依语境不同）这样的词中。"},{"en":"Many learners learn “ll” as a special sound when studying Spanish.","zh":"很多学习者学西班牙语时会把 “ll” 当作一个特殊发音来学。"}]}],"synonyms":["'ll (contraction of will/shall)","double L"],"phonetic":"/ɛl ˈɛl/","extraExplanation":["你输入的“ll”在英文里本身不是一个标准单词；最常见的情况是打字时省略了撇号，把 “I’ll / you’ll / we’ll / they’ll” 写成了 “ill / youll / well / theyll”。在正式写作中应保留撇号。","如果你指的是聊天缩写含义（比如某个平台的“ll”代表某句固定话），不同社群差异很大；你可以告诉我上下文句子，我可以按语境解释。"]}
{"word":"lla","summary":{"en":"“LLA/lla” is usually an acronym (L-L-A), and its meaning depends on the context.","zh":"“LLA/lla”通常是缩写（读作 L-L-A），具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(often written “LLA”) An abbreviation used in different fields with different meanings; it is not a common standalone English word.","zh":"（常写作“LLA”）在不同领域代表不同含义的缩写；本身并不是常见的英语单词。"},"examples":[{"en":"In the document, LLA stands for “Limited Leave of Absence.”","zh":"在这份文件里，LLA 代表“有限请假（Limited Leave of Absence）”。"},{"en":"Our team has an LLA role for handling legal paperwork.","zh":"我们团队有一个 LLA 的岗位负责处理法律文件。"}]},{"partOfSpeech":"other","definition":{"en":"(pronounced as letters) The spoken form of the letters “L-L-A.”","zh":"（按字母读）字母组合“L-L-A”的读法。"},"examples":[{"en":"People usually say “L-L-A” rather than reading it like a normal word.","zh":"人们通常会读作“L-L-A”，而不是像普通单词那样连读。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"ˌɛlˌɛlˈeɪ","extraExplanation":["“LLA”最常见的情况是行业/机构内部缩写，含义必须看上下文（例如公司岗位名、学校项目名、医疗术语或政策名）。如果你告诉我它出现在哪句话、哪份表格或哪个领域（学校/法律/医疗/公司等），我可以给出更准确的释义。"]}
{"word":"llama","summary":{"en":"A llama is a woolly South American pack animal; “LLaMA” can also refer to an AI language model name.","zh":"llama 指南美洲的驮运与取毛动物“羊驼”；“LLaMA”也可指一种 AI 语言模型名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South American animal with long neck and thick wool, related to the alpaca and camel family; often kept for carrying loads and for its wool","zh":"羊驼（骆驼科的南美动物，脖子长、毛厚；常用于驮运和取毛）"},"examples":[{"en":"We saw a llama at the farm, chewing calmly.","zh":"我们在农场看到一只羊驼，悠闲地咀嚼着。"},{"en":"In the Andes, llamas can carry supplies along mountain paths.","zh":"在安第斯山脉，羊驼能沿着山路驮运物资。"},{"en":"The sweater is made from llama wool.","zh":"这件毛衣是用羊驼毛做的。"}]},{"partOfSpeech":"n.","definition":{"en":"(LLaMA) a name used for a family of large language AI models developed by Meta","zh":"（LLaMA）Meta 公司开发的一系列大型语言 AI 模型的名称"},"examples":[{"en":"The team tested their chatbot using the LLaMA model.","zh":"团队用 LLaMA 模型测试了他们的聊天机器人。"},{"en":"She read a tutorial on fine-tuning LLaMA for a new task.","zh":"她读了一篇关于为新任务微调 LLaMA 的教程。"}]}],"synonyms":["(animal)","pack animal","camelid","alpaca (related, not the same)"],"phonetic":"/ˈlɑːmə/","extraExplanation":["“llama”源自西班牙语，最早来自安第斯地区的克丘亚语（Quechua）。在英语里读作 /ˈlɑːmə/，重音在第一音节。","注意大小写：指动物通常写作“llama”；指 AI 模型时常写作“LLaMA”（首字母大写），是一个专有名称。"]}
{"word":"llamas","summary":{"en":"“Llamas” is the plural of “llama,” a woolly South American animal often used for fiber and carrying loads.","zh":"“llamas”是“llama”的复数，指一种毛厚的南美洲羊驼，常用于取毛和驮运。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A llama: a South American animal with thick wool, often kept for its fiber, as a pack animal, or as a gentle farm animal.","zh":"羊驼：一种南美洲动物，毛厚，常被饲养用于取毛、驮运，或作为温顺的农场动物。"},"examples":[{"en":"Llamas can carry supplies on hiking trails in the Andes.","zh":"在安第斯山脉的徒步路线中，羊驼可以驮运物资。"},{"en":"The farm keeps llamas for their wool.","zh":"这个农场饲养羊驼来获取羊毛。"}]}],"synonyms":["llama (singular)"],"phonetic":"/ˈlɑːməz/","extraExplanation":["“llamas”是“llama”的复数形式。注意不要和“lama（喇嘛）”混淆：lama是藏传佛教的宗教称谓，发音和拼写不同。","词源上，llama来自西班牙语llama，进一步与南美原住民语言（如克丘亚语）有关，体现了安第斯地区的文化背景。"]}
{"word":"llanberisslate","summary":{"en":"Slate stone from the Llanberis area of North Wales, commonly used for roofs and buildings.","zh":"产自威尔士北部兰贝里斯地区、常用于屋顶与建筑的板岩石材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, fine-grained slate stone quarried around Llanberis in North Wales, used for roofing, building, and sometimes for writing slates or decorative stonework","zh":"一种产自英国威尔士北部兰贝里斯（Llanberis）一带的板岩，质地坚硬细密，常用于屋顶、建筑，也可用于石板、装饰石材等"},"examples":[{"en":"The museum roof was repaired with Llanberis slate to match the original style.","zh":"博物馆的屋顶用兰贝里斯板岩修复，以匹配原来的风格。"},{"en":"Many old houses in North Wales were covered with Llanberis slate.","zh":"威尔士北部许多老房子都铺着兰贝里斯板岩屋顶。"}]}],"synonyms":["Welsh slate","North Wales slate","slate from Llanberis"],"phonetic":"/lænˈbɛrɪs sleɪt/","extraExplanation":["“Llanberis”来自威尔士语地名，指斯诺登尼亚（Eryri/Snowdonia）地区的兰贝里斯村与周边采石场。19世纪这里是英国最重要的板岩工业中心之一。","在英国语境里说“Llanberis slate”通常强调产地与传统工艺；它不仅是材料名称，也常带有地方历史与建筑风格的联想。"]}
{"word":"llandeilo","summary":{"en":"Llandeilo is a town in southwest Wales (Carmarthenshire).","zh":"Llandeilo（兰代洛）是威尔士西南部卡马森郡的一座城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Carmarthenshire, southwest Wales, known for its Welsh language heritage and nearby historic sites such as Dinefwr Castle and Newton House.","zh":"兰代洛：英国威尔士西南部卡马森郡的一个城镇，以威尔士语文化闻名，附近有迪尼弗城堡（Dinefwr Castle）与牛顿庄园（Newton House）等历史景点。"},"examples":[{"en":"We stopped in Llandeilo for lunch on our drive through Carmarthenshire.","zh":"我们开车穿过卡马森郡时，在兰代洛停下来吃午饭。"},{"en":"Llandeilo is a good base for visiting Dinefwr Castle.","zh":"兰代洛是去参观迪尼弗城堡的不错落脚点。"}]}],"synonyms":["(no direct synonyms; proper place name)"],"phonetic":"/ɬænˈdeɪloʊ/","extraExplanation":["“Llandeilo”是威尔士语地名，常见结构为“llan-”（原意与教堂/教区有关）+ 圣人名字，这里指圣Teilo（泰洛）。因此地名大意可理解为“圣泰洛的教区/教堂所在地”。","威尔士语的“ll”是英语里没有的清擦音，所以英语使用者的读法常会简化为类似“lan-”的音。不同人和不同地区的英语口音也会导致读音略有差异。"]}
{"word":"llandovery","summary":{"en":"Llandovery is a town in southwest Wales; it also names an early Silurian geological interval.","zh":"Llandovery 是威尔士西南部的一座小镇；同时也是志留纪早期一个地质年代/地层单位的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small market town in Carmarthenshire, southwest Wales, known as a gateway to the Cambrian Mountains and for its Welsh-language heritage.","zh":"英国威尔士西南部卡马森郡（Carmarthenshire）的一个小集镇，以通往坎布里亚山脉的门户及浓厚的威尔士语文化而闻名。"},"examples":[{"en":"We stopped in Llandovery for lunch before driving into the mountains.","zh":"我们在前往山区开车前，先在兰多弗里（Llandovery）停下来吃午饭。"},{"en":"Llandovery is a quiet town, but it’s a good base for hiking nearby.","zh":"兰多弗里是个安静的小镇，但很适合当作附近徒步的落脚点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Geology) A time interval (and related rock layers) in the early Silurian Period, named after the area around Llandovery in Wales.","zh":"（地质）志留纪早期的一个地质时间段（及相应地层），以威尔士兰多弗里一带命名。"},"examples":[{"en":"These fossils are dated to the Llandovery epoch of the Silurian.","zh":"这些化石的年代可追溯到志留纪的兰多弗里世。"},{"en":"The paper discusses sedimentation during the Llandovery in Wales.","zh":"这篇论文讨论了威尔士在兰多弗里期的沉积作用。"}]}],"synonyms":["(town) —","(geology) Llandovery epoch / Llandovery Series"],"phonetic":"/lænˈdʌvəri/","extraExplanation":["“Llandovery”来自威尔士语地名。开头的“Ll-”在威尔士语里常读作清擦边音（英语里没有完全对应的音），所以英语使用者常用更接近的/l/音来读。","在英语写作中它是专有名词，通常首字母大写；如果指地质年代/地层单位，也同样大写。"]}
{"word":"llanero","summary":{"en":"A llanero is a plains cowboy from the Llanos of Venezuela/Colombia; it can also describe things related to that culture.","zh":"llanero指委内瑞拉/哥伦比亚利亚诺斯草原的牧人（南美牛仔），也可作形容词表示与该地区文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South American plainsman or cowboy, especially from the Llanos (the grassy plains) of Venezuela and Colombia","zh":"（尤指委内瑞拉、哥伦比亚利亚诺斯草原的）草原牧人；南美牛仔"},"examples":[{"en":"The novel describes a llanero riding across the flooded plains during the rainy season.","zh":"这部小说描写了一位利亚诺斯牛仔在雨季穿越被淹没的草原。"},{"en":"Many llaneros are skilled horsemen and cattle herders.","zh":"许多利亚诺斯牧人都擅长骑马和放牧牛群。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the llaneros or to the Llanos region and its cowboy culture","zh":"与利亚诺斯牧人有关的；与利亚诺斯草原及其牛仔文化有关的"},"examples":[{"en":"They listened to llanero folk music on the drive.","zh":"他们在开车途中听利亚诺斯民间音乐。"},{"en":"A llanero hat and boots are common symbols of the region.","zh":"利亚诺斯风格的帽子和靴子是这一地区常见的象征。"}]}],"synonyms":["plainsman","cowboy","cattle herder","horseman","gaucho (related, different region)"],"phonetic":"/jɑˈnɛroʊ/","extraExplanation":["“Llanero”是西班牙语外来词，来自“llano”（意为“平原”），字面含义接近“平原上的人”。在英语中多用于拉丁美洲历史、地理或文化语境。","文化与历史背景：利亚诺斯（Llanos）是委内瑞拉与哥伦比亚境内的广阔热带草原。历史上，llaneros以精湛的骑术与放牧技能闻名，并在南美独立战争叙事中常被提及。","易混淆对比：gaucho通常指阿根廷、乌拉圭等地潘帕斯草原的牛仔；llanero则主要对应委内瑞拉/哥伦比亚的利亚诺斯地区。"]}
{"word":"llano","summary":{"en":"A llano is a wide, flat grassy plain, especially the Llanos grasslands of Venezuela and Colombia.","zh":"llano 指辽阔平坦的草原/平原，尤指委内瑞拉和哥伦比亚的利亚诺斯草原（Llanos）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a broad, flat, grassy plain (especially the tropical grasslands of Venezuela and Colombia, often called the Llanos)","zh":"（尤指委内瑞拉和哥伦比亚的）辽阔平坦的草原、平原（常称“Llanos/利亚诺斯草原”）"},"examples":[{"en":"During the rainy season, parts of the llano can flood for weeks.","zh":"在雨季，利亚诺斯草原的一些区域可能会被洪水淹没好几个星期。"},{"en":"Many cattle ranches are spread across the Llanos, a vast llano region in northern South America.","zh":"许多牧牛场分布在南美北部广阔的利亚诺斯平原地区。"}]}],"synonyms":["plain","prairie","grassland","savanna","flatland"],"phonetic":"/ˈjɑnoʊ/","extraExplanation":["“llano”来自西班牙语，意思是“平坦的”。英语中多用于描述南美洲的“Llanos（利亚诺斯草原）”，常用复数形式“the Llanos”指这个地区整体。","利亚诺斯草原以季节性洪泛（雨季水淹、旱季干燥）著称，常见活动包括放牧与骑马文化；当地牛仔常被称为“llanero（利亚内罗）”。"]}
{"word":"llanos","summary":{"en":"Llanos are the large plains/grasslands of northern South America, especially in Venezuela and Colombia.","zh":"Llanos 指南美北部（尤指委内瑞拉、哥伦比亚）的大片平原/草原地带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"vast tropical grasslands (plains) in northern South America, especially in Venezuela and Colombia; plural of llano","zh":"（南美北部的）辽阔热带草原/平原地带，尤指委内瑞拉和哥伦比亚的“利亚诺斯草原”；为 llano 的复数"},"examples":[{"en":"Cattle ranching is common in the Llanos of Venezuela.","zh":"在委内瑞拉的利亚诺斯草原，养牛业很常见。"},{"en":"During the rainy season, parts of the Llanos can flood.","zh":"在雨季，利亚诺斯草原的部分地区会被淹没。"},{"en":"The trip crossed the Llanos before reaching the foothills of the Andes.","zh":"旅程先穿越利亚诺斯草原，然后到达安第斯山的山麓。"}]}],"synonyms":["plains","grasslands","savannas","lowlands"],"phonetic":"/ˈjɑːnoʊz/","extraExplanation":["“Llanos”是西班牙语借词，来自“llano”（意为“平坦的、平原”）。英语里常用来专指委内瑞拉与哥伦比亚奥里诺科河流域一带的广阔草原，而不只是泛指“任何平原”。","发音上，英语使用者常把西班牙语中的“ll”读成接近 /y/ 的音，所以常见读法是 /ˈjɑːnoʊz/。","相关文化词汇：当地牧民常被称为“llaneros”（利亚诺斯牛仔/骑手），在委内瑞拉与哥伦比亚文化中很有代表性。"]}
{"word":"llareta","summary":{"en":"Llareta is a slow-growing Andean cushion plant that forms dense green mats on high mountains.","zh":"Llareta是一种生长极慢的安第斯高山垫状植物，会在高海拔地区形成密实的绿色团块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slow-growing, cushion-shaped Andean plant (Azorella compacta) that forms dense green mats on high, dry mountains, especially in Chile, Peru, and Bolivia","zh":"一种安第斯山脉的高山垫状植物（学名 Azorella compacta），生长极慢，在寒冷干燥的高海拔地区形成密实的绿色“垫子”或团块，常见于智利、秘鲁和玻利维亚"},"examples":[{"en":"We spotted llareta covering the rocks like a bright green sponge at 4,000 meters.","zh":"在海拔4000米处，我们看到岩石上长着像亮绿色海绵一样的垫状灌丛——llareta。"},{"en":"Because llareta grows very slowly, many parks protect it from being collected.","zh":"因为llareta生长非常缓慢，许多国家公园会保护它不被采集。"}]}],"synonyms":["yareta","Azorella compacta"],"phonetic":"/jəˈreɪtə/","extraExplanation":["“Llareta”也常写作“yareta”，在当地西语与原住民语言的影响下出现不同拼写。它生活在高海拔、强紫外线、风大且干燥的环境中，因此长成紧密的“垫状”结构以减少水分流失并抵御寒冷。","历史上当地人曾把llareta当作燃料使用（因为干燥后很易燃），但由于其生长极慢、过度采集会造成生态破坏，如今许多地区已限制采集并强调保护。"]}
{"word":"llautu","summary":{"en":"“llautu” is not a recognized English word; it likely comes from another language or is a name/misspelling.","zh":"“llautu”不是常见英语词，可能来自其他语言或是名字/拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “llautu” is most likely a proper name, a misspelling, or a word from another language (often seen in Andean/Quechua or Spanish-related contexts).","zh":"不是标准英语词。“llautu”更可能是专有名词、拼写错误，或来自其他语言（常见于安第斯地区/克丘亚语或与西班牙语相关的语境）。"},"examples":[{"en":"I couldn’t find “llautu” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“llautu”——你能把它出现的句子发我看看吗？"},{"en":"If “llautu” is a person or place name, the meaning depends on the specific culture or region.","zh":"如果“llautu”是人名或地名，它的含义会取决于具体文化或地区。"}]}],"phonetic":"unknown","extraExplanation":["“ll-”开头在英语里很少见，但在西班牙语拼写传统中较常见（如“ll”）。也可能是克丘亚语或其他安第斯语言的词形转写。","如果你告诉我它来自哪里（一本书/歌词/游戏/地名/人名）或给出上下文句子，我可以更准确地判断语言来源、可能含义，以及更合适的读音。"]}
{"word":"ller","summary":{"en":"“ller” isn’t a standalone English word; it usually appears as the ending letters in other words (often involving “-er” or spelling with “ll”).","zh":"“ller”不是独立英语单词；它通常是其他单词的结尾字母组合（常与“-er”或“ll”的拼写相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; most often seen as part of other words (e.g., “seller,” “taller,” “traveller/traveler”).","zh":"本身不是标准英语单词；通常作为其他单词的一部分出现（如 seller“卖方”、taller“更高的”、traveller/traveler“旅行者”）。"},"examples":[{"en":"“ller” alone doesn’t have a dictionary meaning, but you’ll see it at the end of many words.","zh":"“ller”单独出现没有词典义，但你会在很多单词末尾看到它。"},{"en":"For example: seller, caller, taller.","zh":"例如：seller（卖方/卖家）、caller（打电话的人/来访者）、taller（更高的）。"}]},{"partOfSpeech":"other","definition":{"en":"(As a suffix pattern in spelling) The letters “-ller” often appear when adding “-er” to a base that ends in “-ll” or “-l” (spelling varies by dialect).","zh":"（作为拼写形式）当在以“-ll”或“-l”结尾的词后加“-er”时，常会出现“-ller”（不同英语地区拼写可能不同）。"},"examples":[{"en":"sell + -er → seller","zh":"sell + -er → seller（卖家）"},{"en":"tall + -er → taller","zh":"tall + -er → taller（更高的）"},{"en":"UK: travel + -er → traveller; US: traveler","zh":"英式：travel + -er → traveller；美式：traveler"}]}],"synonyms":["-er (suffix)","agent noun ending","comparative -er"],"phonetic":"/lər/","extraExplanation":["“-er”是英语里非常常见的后缀，常表示“做某事的人/物”（teach→teacher）或形容词比较级（tall→taller）。你看到的“ller”通常只是拼写结果：要么词根本来就有“ll”（sell, tall），要么在某些拼写体系里会把末尾的l写成双写（英式 traveller）。"]}
{"word":"llet","summary":{"en":"Let means “allow/permit,” and it’s also used in “let’s” to make suggestions; in British English it can mean “rent out.”","zh":"let 表示“允许/让”，也用于“let’s”提出建议；在英式英语里还可表示“出租”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Often used with an object) to allow or permit someone to do something.","zh":"（常接宾语）允许；让（某人做某事）。"},"examples":[{"en":"My parents don’t let me stay out late.","zh":"我父母不允许我在外面待到很晚。"},{"en":"Please let her speak.","zh":"请让她说话。"},{"en":"They let the kids play in the yard.","zh":"他们让孩子们在院子里玩。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something available for use or rent; to rent out (British English is more common).","zh":"出租；租出去（英式英语更常见）。"},"examples":[{"en":"They plan to let the apartment to students.","zh":"他们计划把公寓出租给学生。"},{"en":"The house is to let.","zh":"这房子招租。"}]},{"partOfSpeech":"aux.","definition":{"en":"Used to make a suggestion or request, especially with “let’s” (= let us).","zh":"用于提出建议/请求，常用于“let’s”（= let us）。"},"examples":[{"en":"Let’s take a break.","zh":"我们休息一下吧。"},{"en":"Let’s not argue about it.","zh":"我们别为这个争了。"}]}],"synonyms":["allow","permit","enable"],"phonetic":"/lɛt/","extraExplanation":["你输入的“llet”通常不是标准英文单词，更像是把“let”多打了一个 l 的拼写错误；最常见目标词是 let。","常见结构：let + 宾语 + 动词原形（不加 to），如 let me go（让我走）、let him explain（让他解释）。","常见固定搭配：let alone（更不用说），例如：He can’t cook, let alone bake a cake.（他连做饭都不会，更不用说烤蛋糕了。）","在礼貌请求里，Let me... / Let’s... 语气较温和：Let me help you.（我来帮你吧。）"]}
{"word":"lleu","summary":{"en":"Lleu is a Welsh male name and also the name of a hero in Welsh mythology (Lleu Llaw Gyffes) from the Mabinogi.","zh":"Lleu既是威尔士语男性名字，也指威尔士神话中的英雄人物（Lleu Llaw Gyffes），出自《马比诺吉》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Welsh masculine given name (a proper name), sometimes used in modern Welsh literature and naming.","zh":"威尔士语男性名字（专有名词），在现代威尔士语文学与取名中也会使用。"},"examples":[{"en":"His name is Lleu, and he’s from North Wales.","zh":"他叫Lleu，来自威尔士北部。"},{"en":"In Welsh class, we learned how to pronounce the name Lleu.","zh":"在威尔士语课上，我们学习了如何发音Lleu这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"(Welsh mythology) Lleu Llaw Gyffes, a heroic figure in the medieval Welsh tales of the Mabinogi, often compared in role to a culture-hero.","zh":"（威尔士神话）“Lleu Llaw Gyffes”，出自中世纪威尔士故事集《马比诺吉》（Mabinogi）的英雄人物，常被视为类似“文化英雄”的角色。"},"examples":[{"en":"Lleu Llaw Gyffes appears in the Fourth Branch of the Mabinogi.","zh":"Lleu Llaw Gyffes出现在《马比诺吉》第四支故事中。"},{"en":"The story of Lleu is often discussed alongside other Celtic myths.","zh":"关于Lleu的故事常与其他凯尔特神话一起讨论。"}]}],"synonyms":["Llew","Lleu Llaw Gyffes"],"phonetic":"/leɪ/","extraExplanation":["“Lleu”来自威尔士语传统；其中开头的“ll”在威尔士语里是一个特殊音（无声的侧擦音），英语里没有完全对应的发音，所以英文环境中常被近似读成类似“LAY/LEH”的音。","神话人物更常以全名“Lleu Llaw Gyffes”出现；“Llaw”意为“手”，“Gyffes”常被解释为“灵巧/熟练”，整体带有“巧手的Lleu”这类含义。"]}
{"word":"llew","summary":{"en":"“Llew/llew” is a Welsh word meaning “lion,” and it is also used as a given name (often linked to Welsh names like Llewelyn).","zh":"“Llew/llew”源自威尔士语，意为“狮子”；也可作人名，常与威尔士名字（如 Llewelyn）的简称相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Welsh word meaning “lion.”","zh":"威尔士语中表示“狮子”。"},"examples":[{"en":"In Welsh, “llew” means “lion.”","zh":"在威尔士语里，“llew”的意思是“狮子”。"},{"en":"The name “Llew” is sometimes chosen because it suggests strength, like a lion.","zh":"名字“Llew”有时会因为带有“狮子”般的力量感而被选用。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (often used as a short form of Welsh names such as Llewelyn).","zh":"人名；常作为威尔士名字（如 Llewelyn）的简称。"},"examples":[{"en":"Llew introduced himself at the start of the meeting.","zh":"Llew 在会议开始时做了自我介绍。"},{"en":"I saw “Llew” in the credits and assumed it might be a Welsh name.","zh":"我在演职员表里看到“Llew”，就猜它可能是个威尔士名字。"}]}],"synonyms":["lion (meaning)","Welsh given name (usage)"],"phonetic":"/luː/","extraExplanation":["“llew”来自威尔士语。威尔士语的“ll”是一个英语里没有的发音（清侧擦音），所以在英语环境中常被简化读成接近 /l/ 的音；因此人名 “Llew” 在英语里常听起来像 “loo”。","文化联想：在凯尔特与威尔士文化语境中，“狮子”常用来象征勇气与力量，所以“Llew”这个名字有时会带一点“勇敢/强壮”的含义色彩。"]}
{"word":"llion","summary":{"en":"“llion” is usually a misspelling of “lion” (a large wild cat).","zh":"“llion”通常是“lion（狮子）”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"“llion” is not a standard English word; it is most likely a misspelling of “lion,” a large wild cat.","zh":"“llion”不是标准英语单词；它很可能是“lion”的拼写错误，指一种大型野生猫科动物（狮子）。"},"examples":[{"en":"I think you meant “lion,” not “llion.”","zh":"我觉得你想写的是“lion”，不是“llion”。"},{"en":"The lion is often called the king of the jungle.","zh":"狮子常被称为“丛林之王”。"}]}],"synonyms":["big cat","king of beasts"],"phonetic":"/ˈlaɪən/","extraExplanation":["“lion”在英语文化里常用来象征勇气、力量与王权（比如国徽、队名、故事寓言中）。也因此常出现在成语或比喻里，如“as brave as a lion（像狮子一样勇敢）”。"]}
{"word":"llipt","summary":{"en":"“llipt” is not a standard English word; it’s likely a typo for “elliptic/elliptical” or “ellipsis.”","zh":"“llipt”不是标准英语单词；很可能是“elliptic/elliptical”或“ellipsis”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or incomplete typing (often intended to be “elliptic/elliptical” or “ellipsis”).","zh":"不是标准英语单词；通常是拼写错误或未打完（常见可能想写“elliptic/elliptical（椭圆的/省略的）”或“ellipsis（省略号；省略）”）。"},"examples":[{"en":"I couldn’t find “llipt” in the dictionary—did you mean “elliptic”?","zh":"我在词典里找不到“llipt”——你是不是想写“elliptic”？"},{"en":"In writing, you may use an ellipsis (…) to show missing words.","zh":"写作中可以用省略号（…）来表示省略的内容。"}]}],"extraExplanation":["“llipt”看起来像把以 el- 开头的词漏掉了开头的 e（例如 elliptic / elliptical / ellipsis）。\n- elliptic / elliptical：常见含义是“椭圆形的”；在语法与写作里也可指“省略的、简略的（表达）”。\n- ellipsis：名词，“省略号（…）”或“省略（某些词）”。\n如果你告诉我你看到“llipt”的句子或领域（数学/写作/聊天），我可以帮你确定你想要的正确单词并给更贴切的例句。"]}
{"word":"lludd","summary":{"en":"“Lludd” is a Welsh legendary name, often described as a mythical king in Welsh/British tradition.","zh":"“Lludd” 是威尔士传说中的人名，常被描述为威尔士/不列颠传统里的传奇国王。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Lludd: a figure in Welsh legend, often described as a legendary king of Britain (sometimes linked with the name “Lud”).","zh":"Lludd：威尔士传说人物，常被描述为不列颠的传奇国王（有时与名字“Lud”联系在一起）。"},"examples":[{"en":"In Welsh mythology, Lludd is remembered as a wise ruler who dealt with major troubles in the land.","zh":"在威尔士神话中，Lludd 常被记为一位英明的统治者，曾处理国家的大麻烦。"},{"en":"Some retellings connect Lludd with Lud, a name that appears in later British legends.","zh":"一些复述版本会把 Lludd 与 Lud 联系起来；Lud 这个名字在后来的英国传说中也出现过。"}]}],"synonyms":["Lud (related name in some traditions)"],"phonetic":"/lɪð/","extraExplanation":["你输入的 “lludd” 很可能是在找专有名词 “Lludd”（首字母大写），属于威尔士传说体系中的人物名，不是常见英语词汇。","威尔士语里 “ll” 是一个特殊发音（和英语的 l 不同），英语资料里常用近似读法来标注，所以你可能会看到不同的拼写或读音写法。","如果你其实想查的是别的词（例如 “Ludd”、“Luddite”，或是拼写打错了），告诉我你想表达的意思或给一个例句，我可以帮你定位正确词条。"]}
{"word":"llyn","summary":{"en":"“Llyn” is the Welsh word for “lake,” commonly used in Welsh place names.","zh":"“llyn”是威尔士语“湖”的意思，常用于威尔士地名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Welsh) a lake; often seen in Welsh place names.","zh":"（威尔士语）“湖”；常见于威尔士地名中。"},"examples":[{"en":"Llyn Tegid is a large natural lake in Wales.","zh":"Llyn Tegid 是威尔士的一座大型天然湖泊。"},{"en":"Many Welsh maps use “llyn” to label lakes.","zh":"许多威尔士地图会用“llyn”来标注湖泊。"}]}],"synonyms":["lake","loch","tarn"],"phonetic":"/lɪn/","extraExplanation":["“llyn”来自威尔士语（Cymraeg），意思是“湖”。在威尔士地名里很常见，比如 Llyn Padarn、Llyn Ogwen。","威尔士语里它的开头辅音常带一种英语没有的“清侧擦音”（写作 ll），听起来不像普通的 /l/。因此英语使用者常把它近似读成 /l/ 开头。"]}
