{"word":"lv","summary":{"en":"LV is a common abbreviation that can mean Las Vegas, Louis Vuitton, level (gaming), or left ventricle (medicine), depending on context.","zh":"LV 是常见缩写，依上下文可指拉斯维加斯、路易威登、等级（游戏）、或左心室（医学）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Las Vegas (Nevada, USA), often used in travel, news, and pop culture.","zh":"拉斯维加斯（美国内华达州），常见于旅行、新闻与流行文化语境。"},"examples":[{"en":"We’re flying to LV this weekend for a short trip.","zh":"我们这周末要飞去 LV（拉斯维加斯）短途旅行。"},{"en":"LV is famous for casinos and live shows.","zh":"LV 因赌场和现场演出而出名。"}]},{"partOfSpeech":"other","definition":{"en":"Louis Vuitton, a French luxury fashion brand; used in shopping and fashion contexts.","zh":"路易威登（法国奢侈品牌），常用于购物与时尚语境。"},"examples":[{"en":"She bought an LV bag as a graduation gift.","zh":"她买了一个 LV 包作为毕业礼物。"},{"en":"Is that wallet from LV?","zh":"那个钱包是 LV 的吗？"}]},{"partOfSpeech":"other","definition":{"en":"Level, especially in gaming or informal writing (e.g., ‘lv 10’).","zh":"等级、级别（尤指游戏或非正式写法，如“lv 10”）。"},"examples":[{"en":"My character is lv 20 now.","zh":"我的角色现在是 20 级（lv 20）。"},{"en":"You need to reach a higher lv to enter that area.","zh":"你需要更高等级才能进入那个区域。"}]},{"partOfSpeech":"other","definition":{"en":"Left ventricle (LV) in medicine, referring to the heart’s left pumping chamber.","zh":"左心室（医学缩写 LV），指心脏左侧的主要泵血腔室。"},"examples":[{"en":"The doctor checked the LV function in the report.","zh":"医生在报告里检查了左心室（LV）功能。"},{"en":"LV hypertrophy means the left ventricle is thickened.","zh":"LV 肥厚表示左心室壁增厚。"}]}],"synonyms":["Las Vegas","Louis Vuitton","level","left ventricle"],"phonetic":"/ˌɛlˈviː/","extraExplanation":["“LV”通常是缩写，具体含义高度依赖上下文：旅游/城市常指 Las Vegas；时尚购物常指 Louis Vuitton；游戏聊天常指 level（等级）；医学报告里常指 left ventricle（左心室）。","发音通常按字母读作 “L-V”。写作时常见全大写“LV”，但游戏语境也常见小写“lv”。"]}
{"word":"lvalue","summary":{"en":"An lvalue is a programming expression that refers to a specific memory location and is typically assignable (can be on the left side of =).","zh":"lvalue 是编程中的一种表达式，指向具体内存位置，通常可被赋值（可出现在 = 左侧）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Programming) An expression that refers to a specific memory location, so it can usually appear on the left side of an assignment (it is assignable).","zh":"（编程）能指向一个具体内存位置的表达式，通常可以出现在赋值语句的左侧（可被赋值）。"},"examples":[{"en":"In C, a variable like x is an lvalue, so you can write x = 5.","zh":"在 C 语言中，像 x 这样的变量是 lvalue，所以你可以写 x = 5。"},{"en":"A literal like 5 is not an lvalue, so you cannot assign to it.","zh":"像 5 这样的字面量不是 lvalue，所以你不能给它赋值。"},{"en":"The expression *p is an lvalue when p points to valid memory.","zh":"当 p 指向有效内存时，表达式 *p 是一个 lvalue。"}]},{"partOfSpeech":"n.","definition":{"en":"(Programming, by extension) The “object identity” side of an expression—something that represents a stored object rather than just a temporary value.","zh":"（编程，引申）表达式中“对象身份/存储对象”的一面——代表一个被存储的对象，而不仅仅是临时值。"},"examples":[{"en":"In C++, some expressions produce temporary values, while lvalues refer to named or stored objects.","zh":"在 C++ 中，有些表达式会产生临时值，而 lvalue 指向有名字或被存储的对象。"},{"en":"Understanding lvalues helps explain why some function calls can return assignable results and others can’t.","zh":"理解 lvalue 有助于解释为什么有些函数调用能返回可赋值的结果，而有些不行。"}]}],"synonyms":["left value (informal)","assignable expression"],"phonetic":"ˈɛlˌvæl.ju","extraExplanation":["“lvalue”最初来自短语“left value”，因为在许多语言里可赋值的表达式常放在等号左边。与之常见对比是“rvalue”（right value），通常指临时结果或纯值。","在 C/C++ 里，判定是否为 lvalue 常与“是否有可寻址的存储位置”有关；但现代 C++ 还引入了更细的分类（如 xvalue、prvalue、glvalue），用于更精确地描述值类别与移动语义。"]}
{"word":"lvalues","summary":{"en":"“lvalues” are expressions that name a specific storage location (usually assignable).","zh":"“lvalues” 指能对应到具体存储位置（通常可被赋值）的表达式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of lvalue: a value (an expression) that refers to a specific memory location, so it can usually appear on the left side of an assignment (e.g., in many languages, a variable is an lvalue).","zh":"lvalue 的复数：指（某个表达式的）值能对应到一个具体的内存位置，因此通常可以出现在赋值语句的左边（在许多语言里，变量就是 lvalue）。"},"examples":[{"en":"In C/C++, variables like x and arr[0] are lvalues, so you can assign to them.","zh":"在 C/C++ 中，像 x 和 arr[0] 这样的变量/表达式是 lvalue，所以你可以对它们赋值。"},{"en":"The expression (x + 1) is not an lvalue, so writing (x + 1) = 3 is an error.","zh":"表达式 (x + 1) 不是 lvalue，所以写 (x + 1) = 3 会报错。"},{"en":"Functions may return lvalues (by reference) or rvalues (by value), depending on the language rules.","zh":"函数可能返回 lvalue（按引用返回）或 rvalue（按值返回），取决于语言规则。"}]}],"synonyms":["assignable expressions","addressable values","modifiable lvalues (more specific)"],"phonetic":"/ˈɛlˌvælˌjuz/","extraExplanation":["“lvalue”中的“l”最初来自“left（左边）”：早期常用解释是“可以放在赋值号左边的东西”。不过在现代 C++ 等语言里，更准确的理解是：lvalue 表达式“有身份/有地址（可以定位到某个对象）”，而不仅仅是“能不能写在等号左边”。","相关概念常一起学习：rvalue（通常是临时值/没有稳定身份）、assignment（赋值）、reference（引用）。"]}
{"word":"Lviv","summary":{"en":"a historic cultural city in western Ukraine","zh":"乌克兰西部的历史文化名城"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in western Ukraine, known for its historic architecture and as a cultural and educational center.","zh":"乌克兰西部的重要城市，以历史建筑闻名，也是文化与教育中心。"},"examples":[{"en":"She studied architecture in Lviv and fell in love with the old town.","zh":"她在利沃夫学习建筑，并爱上了那座古城。"},{"en":"Trains from Kyiv to Lviv are a common way to travel across Ukraine.","zh":"从基辅到利沃夫的火车是横穿乌克兰的常见出行方式。"}]}],"synonyms":["Lvov","Lwów","Lemberg"],"phonetic":"/ləˈviːv/","extraExplanation":["Lviv 的英语拼写与读音常见两种：/ləˈviːv/（更接近英语习惯）以及更贴近乌克兰语的近似读法“luh-VEEV”。在新闻与国际场合，多使用乌克兰语转写 Lviv，而较旧资料可能出现 Lvov、Lemberg 等历史称呼。"],"etymology":"源自东斯拉夫语传统名称“Львів”（Lviv），与“lev/льв(=狮子)”相关；城市名常被解释为“狮子之城”或与一位名叫Lev（列夫/狮子）的历史人物相关。历史上在不同语言与时期也写作/称作 Lwów（波兰语）、Lvov（俄语转写）、Lemberg（德语）。","mnemonic":["记忆法：把 Lviv 想成“luh-VEEV”，中间重音像“VIV（维夫）”。","联想：词根与“狮子(lev)”有关，可联想到“狮子城”的画面来记住它是一个历史文化名城。"]}
{"word":"lvov","summary":{"en":"Lvov is an older/Russian-based spelling for the Ukrainian city now usually called Lviv.","zh":"Lvov 是一个较旧、偏俄语体系的拼写，指如今通常称为 Lviv 的乌克兰城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Lvov (also written L’vov) is a Russian-based spelling for the city now commonly called Lviv, a major cultural and historical city in western Ukraine.","zh":"Lvov（也写作 L’vov）是一个偏俄语体系的拼写，指今天更常称为 Lviv（利沃夫/利维夫）的城市，位于乌克兰西部，是重要的文化与历史名城。"},"examples":[{"en":"The train route lists Lvov, but the city is usually called Lviv in English today.","zh":"列车路线写的是 Lvov，但如今英语里这座城市通常称为 Lviv。"},{"en":"Many older books mention Lvov when describing Eastern European history.","zh":"许多较早的书在讲东欧历史时会用 Lvov 这个名称。"}]}],"synonyms":["Lviv","L’vov"],"phonetic":"/ləˈvɔf/","extraExplanation":["“Lvov / L’vov”多见于俄语转写或较旧的英文资料；现代国际英文新闻与地图更常用乌克兰语转写“Lviv”。","中文里常见译名有“利沃夫”（传统译法，对应较常见的 Lvov）与“利维夫”（对应 Lviv）；不同媒体会选用不同译名。"]}

