{"word":"Mae","summary":{"en":"a female first name","zh":"女性名字"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, often used as a variant of “May” or as a short form of names like Mary or Margaret","zh":"女性名字，常见作“May”的变体，也可作为 Mary、Margaret 等名字的简称"},"examples":[{"en":"Mae is my grandmother’s name.","zh":"Mae 是我奶奶的名字。"},{"en":"Mae told me she’s moving to Chicago next month.","zh":"Mae 告诉我她下个月要搬去芝加哥。"},{"en":"Her full name is Margaret, but everyone calls her Mae.","zh":"她的全名是 Margaret，但大家都叫她 Mae。"}]}],"synonyms":["May","Mary"],"phonetic":"/meɪ/","extraExplanation":["Mae 在英语文化中属于比较传统、简短的女性名。你可能在美国流行文化里见过：如演员 Mae West（梅·韦斯特）。在中文语境中有时会音译为“梅”。"],"etymology":"主要是英文人名拼写之一：常被视为 May 的变体；也常作为 Mary、Margaret 等名字的昵称/简称形式，在苏格兰与英语地区都可见。","mnemonic":["把 Mae 记成 May 的“换个拼法”：发音一样 /meɪ/，像“梅”的音。","联想中文“梅”：Mae ≈ “梅”，常见女性名。"]}
{"word":"mae","summary":{"en":"“Mae” is most commonly a female given name; it can also mean “more” in Scots, be Costa Rican slang for “dude/friend,” or appear as an abbreviation (MAE).","zh":"“Mae”最常见是女性名字；在苏格兰英语中可表示“更多”；也可作为哥斯达黎加俚语表示“哥们/朋友”；还可能以缩写（MAE）出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (short for names like Mary, Margaret, or May; also used on its own).","zh":"女性名字（可作独立名字，也常被视为 Mary、Margaret、May 等名字的昵称或变体）。"},"examples":[{"en":"Mae called me after work to check in.","zh":"Mae 下班后打电话来问候我。"},{"en":"The author Mae Jemison is also a famous astronaut.","zh":"Mae Jemison 也是一位著名的宇航员。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scots/Scottish English) more; a greater amount or degree.","zh":"（苏格兰英语/苏格兰方言）更多；更大程度。"},"examples":[{"en":"Can ye gie me a wee bit mae time?","zh":"你能再给我一点时间吗？"},{"en":"I cannae eat ony mae.","zh":"我再也吃不下更多了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Costa Rican Spanish slang, often seen in English text about Costa Rica) a guy/dude; a friend (like “mate”).","zh":"（哥斯达黎加西班牙语俚语；在英文介绍哥斯达黎加时常见）哥们/那个人；朋友（类似“mate”）。"},"examples":[{"en":"In Costa Rica, people may say “mae” the way English speakers say “dude.”","zh":"在哥斯达黎加，人们会用“mae”来表达类似英语“dude（哥们）”的感觉。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some contexts (e.g., MAE = Master of Arts in Education, depending on the school).","zh":"在某些语境中的缩写（例如在部分学校里 MAE 可指“教育学文学硕士”，具体以机构定义为准）。"},"examples":[{"en":"She earned her MAE in education leadership.","zh":"她获得了教育领导方向的 MAE 学位。"}]}],"synonyms":["May","more (Scots meaning)","dude (Costa Rica slang)","mate (similar idea)"],"phonetic":"/meɪ/","extraExplanation":["“Mae”作为英文名字最常见，发音通常与“May”相同。拼写全大写“MAE”时，多半是在讲缩写，需要看上下文（学校、专业、机构）来确定含义。","苏格兰用法“mae=more”常出现在口语、歌词或文学对白里，用来营造地域特色。","哥斯达黎加俚语“mae”主要出现在西语语境；如果你在英文旅行文章或对话里看到，通常是在借用当地说法来表达亲近、随意的语气。"]}
{"word":"Maeander","summary":{"en":"to wander or curve in a winding, indirect way","zh":"以蜿蜒、迂回的方式行进或延伸"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wander or follow a winding, indirect path (in movement, speech, or writing)","zh":"蜿蜒前行；漫步；（讲话/写作）迂回、绕来绕去"},"examples":[{"en":"We meandered through the old town and discovered a quiet café.","zh":"我们在老城区里随意闲逛，发现了一家安静的咖啡馆。"},{"en":"Her story meandered, but the ending was worth it.","zh":"她的故事讲得有点绕，但结尾很精彩。"}]},{"partOfSpeech":"n.","definition":{"en":"a winding curve or turn, especially in a river; an indirect route","zh":"（尤指河流的）曲流、蜿蜒的弯道；迂回的路线"},"examples":[{"en":"The river’s meanders create rich farmland along its banks.","zh":"河流的曲流在两岸形成了肥沃的农田。"},{"en":"We took a meander through the park instead of the main road.","zh":"我们没有走大路，而是在公园里绕着走了一段。"}]},{"partOfSpeech":"other","definition":{"en":"the ancient name of a river in present-day Turkey, famous for its many bends","zh":"（古名）迈安德洛斯河：位于今土耳其、以河道多弯而著名的河流"},"examples":[{"en":"The word comes from the Meander River, known in antiquity for its winding course.","zh":"这个词源自古代以河道蜿蜒著称的迈安德洛斯河。"}]}],"synonyms":["wander","ramble","roam","wind","snake","twist","zigzag","stray","take a detour"],"phonetic":"/miˈændɚ/","extraExplanation":["在艺术与装饰中，“meander/Greek key（希腊回纹）”指一种连续折线的回纹图案，常见于古希腊陶器与建筑装饰，形状像“不断绕来绕去”的路径。"],"etymology":"来自希腊语“Maiandros”（迈安德洛斯河，今土耳其境内）。由于这条河以弯曲蜿蜒闻名，后来其名称引申为“曲折前进、绕行”。拼写“Maeander”常见于较古典或学术语境，也可视为“meander”的变体。","mnemonic":["把“Maeander”联想成“my + and + err（我还会走错路）”：一路‘and’来‘and’去、还会‘err’，所以走得很蜿蜒。","联想中文“蜿蜒（wān yán）”：发音不对应，但画面很像——河流/道路一直拐弯。"]}
{"word":"maeander","summary":{"en":"Meander means to wander in a relaxed, indirect way, or to form a winding curve (especially a river).","zh":"Meander 表示“悠闲地迂回漫步/前进”，也指（尤指河流的）“蜿蜒曲流”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to wander or follow a winding, curving path (literally or figuratively); to take a longer, indirect route","zh":"（字面或比喻）蜿蜒而行；漫步；迂回前进"},"examples":[{"en":"We meandered through the old town and found a quiet café.","zh":"我们在老城区里随意漫步，找到了一家安静的咖啡馆。"},{"en":"The river meanders across the valley.","zh":"这条河在山谷中蜿蜒流过。"},{"en":"Her story meandered, but it was still interesting.","zh":"她的叙述有些东拉西扯，但仍然很有趣。"}]},{"partOfSpeech":"n.","definition":{"en":"a winding curve or turn, especially in a river; a roundabout movement or course","zh":"（尤指河流的）曲流；弯道；迂回的路径"},"examples":[{"en":"This part of the river has wide meanders.","zh":"这段河流有很大的曲流。"},{"en":"The conversation took a few meanders before returning to the main topic.","zh":"谈话绕了几个弯才回到主题。"}]}],"synonyms":["wander","stroll","ramble","roam","wind","snake"],"phonetic":"/miˈændɚ/","extraExplanation":["你输入的“maeander”常见为“meander”的拼写变体/误拼。其词源与古希腊-拉丁传统有关：来自“Maeander（迈安得尔）河”，这条河以河道曲折闻名，因此英语里用来表示“蜿蜒、迂回”。在地理/地貌学中，meander 专指河流的“曲流”。"]}
{"word":"maeandra","summary":{"en":"Maeandra is a rare spelling referring mainly to the ancient Maeander (Meander) River, known for its winding path and the origin of the word “meander.”","zh":"Maeandra 是一种罕见拼写，主要指古代的 Maeander（Meander）河，以河道蜿蜒著称，也是英语“meander”一词的词源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/Latinized spelling of the Maeander (Meander), an ancient river in Asia Minor (modern-day Turkey), famous for its winding course.","zh":"一种罕见/拉丁化的拼写形式，指“Maeander（Meander）河”（古代小亚细亚、今土耳其的一条河），以河道曲折蜿蜒而闻名。"},"examples":[{"en":"Ancient writers described the Maeandra as a river full of twists and bends.","zh":"古代作家把 Maeandra 描述成一条充满弯曲与回旋的河流。"},{"en":"The word “meander” ultimately comes from the name of this river, sometimes spelled Maeandra in older texts.","zh":"英语里的“meander（蜿蜒、漫步）”最终源自这条河的名字，在一些旧文本中有时拼作 Maeandra。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) Used as a scientific name in some contexts for organisms (e.g., in older or specialized taxonomy), depending on the field and source.","zh":"（较少见）在某些学科的旧式或专业分类文献中，可能被用作某些生物的学名用词，具体含义需结合领域与出处。"},"examples":[{"en":"In a few specialized sources, Maeandra appears as a taxonomic term.","zh":"在少数专业资料中，Maeandra 会以分类学术语的形式出现。"}]}],"synonyms":["Maeander","Meander"],"phonetic":"/miˈændrə/","extraExplanation":["“Maeandra”在现代英语里非常少见，更常见的形式是 **Maeander / Meander**。如果你是在读历史、古典文学或旧版译本，看到 Maeandra 往往就是指那条著名的“曲流之河”。","拼写里的 **ae** 在英语借词中常被读成 /i/（类似 *aegis* 的常见读法），因此它的英语读音通常接近 **meander**。","如果你本来想查的是日常动词/名词 **meander**（“蜿蜒；漫步；迂回地讲”），告诉我语境，我可以按现代用法给你更常用的词条与例句。"]}
{"word":"maeandrina","summary":{"en":"Maeandrina is a scientific genus name for certain maze-textured, reef-building corals (often called brain corals).","zh":"Maeandrina 是某些表面呈迷宫纹理的造礁珊瑚的科学属名（常与“脑珊瑚”相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of reef-building stony corals (often called brain corals), found especially in the Caribbean and western Atlantic; the colonies commonly have winding, maze-like ridges.","zh":"一种造礁石珊瑚属（常被称为“脑珊瑚”），主要分布在加勒比海与西大西洋；其群体表面常见蜿蜒如迷宫的脊状纹理。"},"examples":[{"en":"In the Caribbean, Maeandrina corals can form large colonies with maze-like grooves.","zh":"在加勒比海，Maeandrina 属珊瑚能形成大型群体，表面有迷宫状的沟纹。"},{"en":"Some divers mistake Maeandrina for “brain coral” without realizing it is a scientific genus name.","zh":"有些潜水员把 Maeandrina 当成泛称的“脑珊瑚”，却不知道它其实是一个科学属名。"}]}],"synonyms":["brain coral (common name)","meandrine coral (descriptive term)"],"phonetic":"/miːˈændrɪnə/","extraExplanation":["Maeandrina 是拉丁化的科学命名，常与英文俗名 brain coral（脑珊瑚）相关，但“脑珊瑚”是外观描述的统称，并不只指这一个属。","词根与 “meander（蜿蜒曲折）”有关，指其表面纹理像河流曲流或迷宫一样盘旋。"]}
{"word":"maeandrine","summary":{"en":"Meandering means winding or indirect—used for physical paths (like rivers) or for speech/writing that doesn’t go straight to the point.","zh":"Meandering 指“蜿蜒的、曲折的”，也可指讲话或写作“不够直接、东拉西扯”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a river, road, path, etc.) following a winding, curving route rather than a straight one","zh":"（河流、道路、小径等）蜿蜒的，曲折的"},"examples":[{"en":"A meandering river runs through the valley.","zh":"一条蜿蜒的河流穿过山谷。"},{"en":"We took a meandering path to enjoy the scenery.","zh":"我们走了一条曲折的小路来欣赏风景。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of speech, writing, or thinking) not direct; moving from one topic to another","zh":"（讲话、写作或思路）不够直接的，东拉西扯的"},"examples":[{"en":"His explanation was long and meandering.","zh":"他的解释又长又绕，不够直接。"},{"en":"The novel has a meandering storyline.","zh":"这部小说的情节推进比较散漫、曲折。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of wandering or moving in a winding way; a slow, indirect course","zh":"漫步；曲折前行；迂回的行进路线（或方式）"},"examples":[{"en":"We enjoyed an afternoon of meandering around the old town.","zh":"我们在老城区悠闲地逛了一下午。"}]}],"synonyms":["winding","curving","twisting","rambling","wandering"],"phonetic":"/miˈændərɪŋ/","extraExplanation":["你输入的“maeandrine”不是常见英文单词；最接近、最常用的词是 **meandering**。","词源上与“漫游、徘徊”有关，所以既可形容“路线蜿蜒”，也可形容“表达不直截了当”。","常见搭配：**meandering river/path/road**（蜿蜒的河/小路/道路），**meandering conversation/story**（东拉西扯的对话/故事）。"]}
{"word":"maeandriniform","summary":{"en":"Maeandriniform means “meandering; winding like a river.”","zh":"maeandriniform 指“像河流弯道一样蜿蜒曲折的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Winding and twisting in a pattern like a river’s bends; meandering in shape.","zh":"（形状）像河流弯道一样蜿蜒曲折的；回环的。"},"examples":[{"en":"The trail follows a maeandriniform path along the hillside.","zh":"这条小径沿着山坡呈蜿蜒曲折的走向。"},{"en":"Under the microscope, the cells formed maeandriniform lines.","zh":"在显微镜下，这些细胞形成了蜿蜒的线条。"},{"en":"Artists sometimes use maeandriniform motifs to suggest flow and movement.","zh":"艺术家有时用蜿蜒的图案来表现流动感和运动感。"}]}],"synonyms":["meandering","sinuous","serpentine","winding"],"phonetic":"/miˈændrɪnəˌfɔrm/","extraExplanation":["这个词比较少见，多见于科学写作或艺术/建筑描述，用来强调“像河道那样曲折回环”的形态。","词根来自“meander（曲流）”，其文化背景常指古代小亚细亚的迈安德河（今土耳其境内），以河道蜿蜒著名；相关的“Greek key / meander pattern（回纹/曲折纹）”也常见于古希腊装饰纹样。"]}
{"word":"maeandrinoid","summary":{"en":"Maeandrinoid means winding or maze-like, especially in technical descriptions (e.g., river patterns, coral or fossil structures).","zh":"Maeandrinoid 指“蜿蜒曲折、迷宫状的”，多用于专业描述（如河道形态、珊瑚或化石结构）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a winding, maze-like pattern; meandering.","zh":"呈曲折蜿蜒、如迷宫般的；迂回的。"},"examples":[{"en":"The satellite image showed a maeandrinoid river channel across the plain.","zh":"卫星图像显示那条河在平原上呈现出蜿蜒曲折的河道。"},{"en":"The designer chose a maeandrinoid motif for the border of the carpet.","zh":"设计师为地毯边缘选择了迷宫式的曲折纹样。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/Geology) Describing structures—especially coral patterns or fossils—that resemble a labyrinth or meandering grooves.","zh":"（生物/地质）形容结构（尤指珊瑚纹理或化石）呈迷宫状或蜿蜒沟槽状。"},"examples":[{"en":"Some corals form maeandrinoid ridges that look like a maze from above.","zh":"有些珊瑚会形成迷宫般的隆脊，从上方看像一座迷宫。"},{"en":"The fossil surface had maeandrinoid markings, suggesting complex growth patterns.","zh":"化石表面有迷宫式的纹路，暗示其生长模式较为复杂。"}]}],"synonyms":["meandering","winding","sinuous","labyrinthine","maze-like"],"phonetic":"/miˈændrəˌnɔɪd/","extraExplanation":["词源提示：maeandrinoid 来自 Maeander（古希腊/小亚细亚的一条以“多弯曲”著名的河流，常用来比喻“蜿蜒曲折”）+ -oid（“……状/类似……”）。因此它强调“像蜿蜒河道或迷宫纹样那样的形状”。","使用场景：该词非常书面且偏专业，常见于地貌学（河道形态）、艺术图案描述，以及珊瑚/化石形态学等语境。日常英语更常用 meandering 或 maze-like。"]}
{"word":"maeandroid","summary":{"en":"“maeandroid” isn’t a standard English word; it’s likely a name/username or a misspelling of “android” (or another word).","zh":"“maeandroid”不是标准英语词，可能是名字/网名，或把“android”等词拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most likely appears as a username, product name, or a misspelling (for example, of “android” or “meander”).","zh":"不是标准英语单词。更可能是用户名、产品名，或拼写错误（例如想写“android”或“meander”）。"},"examples":[{"en":"I couldn’t find “maeandroid” in a dictionary; is it a username or a brand name?","zh":"我在词典里查不到“maeandroid”；它是用户名还是品牌名？"},{"en":"If you meant “android,” you can say: “I use an Android phone.”","zh":"如果你想写“android”，可以说：“我用的是安卓手机。”"}]}],"phonetic":"/ˌmeɪˈæn.drɔɪd/","extraExplanation":["“maeandroid”看起来像把名字（Mae）+ android 组合在一起的自造词或网名，因此在常规词典中通常查不到。","如果你告诉我它出现的句子/语境（例如一段对话、标题、应用名），我可以更准确判断意思。","你可能想查的常见词：\n- android（n.）安卓系统/安卓手机；或“机器人（外形像人）”\n- meander（v.）蜿蜒、漫步；（谈话/叙述）离题、绕来绕去"]}
{"word":"maecenas","summary":{"en":"Maecenas is a famous Roman patron of poets, and the name is also used to mean a generous supporter of the arts.","zh":"Maecenas 原是著名的罗马诗人赞助者，也可引申指“慷慨的艺术赞助人/资助者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A Roman statesman and famous supporter of poets, remembered as a model patron of the arts.","zh":"（专有名词）罗马政治人物、著名的诗人资助者，被视为“艺术赞助人”的典范。"},"examples":[{"en":"Maecenas supported poets like Virgil and Horace.","zh":"梅塞纳斯资助了维吉尔和贺拉斯等诗人。"},{"en":"In literature classes, Maecenas is often mentioned as the ideal patron.","zh":"在文学课上，Maecenas 常被提到，作为理想赞助人的代表。"}]},{"partOfSpeech":"n.","definition":{"en":"A generous patron; someone who supports artists, writers, or cultural projects (often used humorously or in formal writing).","zh":"（引申义）慷慨的赞助人；支持艺术家、作家或文化项目的人（常见于较正式或带点幽默的表达）。"},"examples":[{"en":"The museum’s Maecenas funded a new gallery for young painters.","zh":"这家博物馆的“梅塞纳斯式赞助人”资助了一个面向青年画家的新展厅。"},{"en":"She became a Maecenas to local musicians by paying for their studio time.","zh":"她为当地音乐人支付录音棚费用，成了他们的“资助者/赞助人”。"},{"en":"Every creative community needs a Maecenas now and then.","zh":"每个创意社群时不时都需要一位“伯乐式的赞助人”。"}]}],"synonyms":["patron","benefactor","sponsor","supporter"],"phonetic":"/maɪˈsiːnəs/","extraExplanation":["“Maecenas”原指罗马共和国末期的盖乌斯·梅塞纳斯（Gaius Maecenas），他以资助诗人闻名，因此名字后来被当作普通名词使用，表示“文化艺术的赞助人/保护人”。","在英文里把某人称作“a Maecenas”通常带有书面语色彩，有时也带点玩笑意味：把对方比作历史上的大赞助人。"]}
{"word":"maecenasship","summary":{"en":"Maecenasship means patronage—especially financial support for artists and the arts.","zh":"Maecenasship 指对艺术家与艺术事业的赞助（尤其是资金支持）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"patronage of artists, writers, or the arts (support—often financial—given by a wealthy or powerful person or institution)","zh":"（对艺术家、作家或艺术事业的）赞助；资助（通常指有权势或富有的人/机构给予的资金或资源支持）"},"examples":[{"en":"The museum’s new wing was built through private maecenasship.","zh":"博物馆的新馆翼是在私人赞助下建成的。"},{"en":"Without maecenasship, many young composers would struggle to share their work.","zh":"没有赞助，许多年轻作曲家会很难让作品被更多人听见。"}]}],"synonyms":["patronage","sponsorship","backing","support"],"phonetic":"/miːˈsiːnəsˌʃɪp/","extraExplanation":["Maecenasship 来自古罗马政治家 Gaius Maecenas（盖乌斯·梅塞纳斯）的名字。他以资助诗人维吉尔（Virgil）与贺拉斯（Horace）而闻名，因此 “Maecenas” 在英语里逐渐成为“文学艺术赞助人”的代称，maecenasship 则指这种赞助行为/制度。","这个词较偏正式、文学性强；日常英语里更常用 patronage（赞助/庇护）或 sponsorship（赞助、赞助商支持）。"]}
{"word":"maed","summary":{"en":"“maed” is not standard English; it’s usually a misspelling of “made.”","zh":"“maed”不是标准英语，通常是“made”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) A misspelling of “made” (past tense and past participle of “make”).","zh":"（非标准/少见）“made”的拼写错误；“make”的过去式和过去分词。"},"examples":[{"en":"I maed a mistake. (Incorrect) → I made a mistake.","zh":"I maed a mistake.（错误）→ I made a mistake.（我犯了一个错误。）"},{"en":"This table was maed of wood. (Incorrect) → This table was made of wood.","zh":"This table was maed of wood.（错误）→ This table was made of wood.（这张桌子是木头做的。）"}]}],"synonyms":["made"],"phonetic":"/meɪd/","extraExplanation":["“maed”不是现代标准英语单词，最常见原因是把“made”（/meɪd/）拼错了。","如果你是在苏格兰英语/方言文本里看到类似形式，也可能是作者用来表现口音或古体拼写；但在日常写作和考试中请用标准拼写“made”。","想确认你的意思：你是想问“made”的用法（如 made of / made from / made into）还是某个名字“Maed”？"]}
{"word":"maeg","summary":{"en":"“maeg” is not a standard English word; it’s usually a misspelling of “mage” or a personal name/username.","zh":"“maeg”不是标准英语词；通常是把 “mage（法师）”拼错，或作为人名/网名使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Uncommon) A misspelling of “mage” (a wizard or magic user), especially in fantasy games and stories.","zh":"（不常见）常见于拼写错误：应为 “mage”，指（奇幻作品/游戏中的）法师、魔法师。"},"examples":[{"en":"I think you meant “mage,” not “maeg.”","zh":"我觉得你想写的是 “mage”，不是 “maeg”。"},{"en":"In the game, the mage can cast powerful spells.","zh":"在游戏里，法师可以施放强力法术。"}]},{"partOfSpeech":"other","definition":{"en":"A rare spelling used as a name or username; not a standard English dictionary word.","zh":"一种少见的拼写，可能用作人名或网名；不是标准英语词典词。"},"examples":[{"en":"Maeg is the name on the account, so I’ll message Maeg directly.","zh":"账号名是 Maeg，所以我会直接私信 Maeg。"}]}],"synonyms":["mage","wizard","sorcerer"],"phonetic":"/meɪɡ/","extraExplanation":["“mage”一词常见于奇幻文学与RPG游戏（如《龙与地下城》风格）中，意为“施法者/法师”。如果你是在写作或游戏语境里看到 maeg，多半是把字母顺序写错了。","如果你其实想查的是某种语言（例如古英语/北欧语系）里的词，请告诉我你看到它的原句或出处，我可以按语境帮你判断。"]}
{"word":"maegbot","summary":{"en":"“Maegbot” isn’t a standard English word; it’s most likely a name for a bot or an informal coined term.","zh":"“maegbot”不是标准英语词，更可能是某个机器人的名称或临时造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word (likely a username, project name, or misspelling). It does not have a widely recognized dictionary meaning in general English.","zh":"非标准词（更可能是用户名、项目名或拼写错误）。在一般英语中没有公认的词典释义。"},"examples":[{"en":"I couldn’t find a standard English definition for “maegbot.” Do you mean “MagBot” or “chatbot”?","zh":"我找不到“maegbot”的标准英语释义。你是想写“MagBot”还是“chatbot（聊天机器人）”吗？"},{"en":"In our Discord server, Maegbot is the bot that posts daily reminders.","zh":"在我们的 Discord 服务器里，Maegbot 是用来发布每日提醒的机器人。"}]}],"synonyms":["bot","chatbot","automation bot","script (informal)"],"phonetic":"/ˈmeɪɡbɑt/","extraExplanation":["从拼写来看，“maegbot”很像“某某 + bot”的组合（bot=机器人/自动程序），前半段“maeg”可能是人名（如 Mae/Maeg）或缩写。","如果你能提供一句原文语境（它出现在哪个平台、做什么功能），我可以帮你判断它更接近：1）专有名词/机器人名称；2）拼写误差（如 magbot、megabot、chatbot）；或 3）某个小众圈子的术语。"]}
{"word":"maegbote","summary":{"en":"Maegbote is an Old English legal term for compensation paid by a wrongdoer’s kin to settle a feud or injury.","zh":"Maegbote 是古英语法律术语，指由加害者亲族支付的赔偿金，用于平息仇怨或伤害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, Anglo-Saxon law) Compensation paid by a person’s kin (family/clan) to settle a feud or make amends for wrongdoing, similar to a “blood-price.”","zh":"（历史用语，盎格鲁-撒克逊法律）由加害者的宗族/亲族支付的赔偿金，用来平息仇怨、弥补过错，类似“赎命金/血价”。"},"examples":[{"en":"In some Anglo-Saxon codes, the killer’s family could pay maegbote to prevent a cycle of revenge.","zh":"在一些盎格鲁-撒克逊法典中，凶手的家族可以支付 maegbote，以避免复仇循环。"},{"en":"The historian explained that maegbote worked alongside other payments like wergild.","zh":"历史学家解释说，maegbote 会与 wergild 等其他赔偿制度并行。"}]}],"synonyms":["kin-compensation","blood-price (approx.)","composition (legal, historical)"],"phonetic":"ˈmæɡˌboʊt","extraExplanation":["这个词更常见的拼写是古英语 **mægbōt / mǣgbōt**（也可见作 *maegbote* 的转写）。其中 **mæg** 表示“亲族/族人”，**bōt** 表示“补偿、修复、赎偿”。它属于早期日耳曼社会的“以赔偿止争端”的法律与习俗体系，用金钱或财物来替代血仇升级。","在学习相关历史词汇时，可以一起记：**wergild**（按身份定价的“人命金/赔命金”）与 **maegbote**（强调“由亲族承担与支付”的赎偿）。"]}
{"word":"maeing","summary":{"en":"“maeing” is not standard English; it is most likely a misspelling of “making,” meaning the act/process of creating or producing something.","zh":"“maeing”不是规范英语，通常是把“making”拼错了；“making”表示“制作/创造的过程”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Not a recognized English word; most likely a misspelling of “making.”","zh":"（非标准）不是规范英语单词；很可能是把“making”拼错了。"},"examples":[{"en":"I think you meant “making,” not “maeing.”","zh":"我觉得你想写的是“making”，不是“maeing”。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of producing, creating, or preparing something","zh":"制作；创造；准备某物的过程"},"examples":[{"en":"Bread making takes patience and practice.","zh":"做面包需要耐心和练习。"},{"en":"The making of this film took three years.","zh":"这部电影的制作花了三年。"}]},{"partOfSpeech":"adj.","definition":{"en":"producing or earning (used before a noun)","zh":"产生（或赚得）……的（用作定语）"},"examples":[{"en":"He’s a decision-making manager.","zh":"他是一位负责决策的经理。"},{"en":"This is a money-making idea.","zh":"这是个能赚钱的点子。"}]}],"synonyms":["creation","production","preparation","manufacture"],"phonetic":"/ˈmeɪkɪŋ/","extraExplanation":["“make”变成“making”时，通常要把词尾不发音的e去掉：make → making（不是*maeing）。这个规则也适用于：write → writing，take → taking。"]}
{"word":"maelstrom","summary":{"en":"Maelstrom means a powerful whirlpool, or (figuratively) a chaotic, swirling situation.","zh":"maelstrom 指强烈的大漩涡，也可比喻让人被卷入的混乱、动荡局面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A powerful whirlpool or violent swirling mass of water, especially in the sea.","zh":"（尤指海上的）大漩涡；急速旋转的水流。"},"examples":[{"en":"The small boat kept a safe distance from the maelstrom.","zh":"那艘小船与大漩涡保持安全距离。"},{"en":"Waves spun toward the center like a maelstrom.","zh":"海浪像大漩涡一样向中心旋转。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation or state of great confusion, turmoil, or intense activity that feels like everything is being pulled in.","zh":"（比喻）混乱、动荡的局面；让人被“卷入”的巨大纷乱。"},"examples":[{"en":"She tried to stay calm in the maelstrom of exam week.","zh":"在考试周的混乱中，她努力保持冷静。"},{"en":"After the announcement, the office fell into a maelstrom of emails and meetings.","zh":"公告发布后，办公室陷入了邮件和会议的忙乱漩涡中。"}]}],"synonyms":["whirlpool","vortex","eddy","turmoil","chaos"],"phonetic":"/ˈmeɪlstrəm/","extraExplanation":["“maelstrom”来自荷兰语/挪威语相关词源，原指挪威海域著名的强潮流与漩涡（常被写作“the Maelstrom”）。后来英文里常用作比喻，表示让人被卷入的巨大混乱或动荡。","文学提示：埃德加·爱伦·坡（Edgar Allan Poe）有短篇《A Descent into the Maelström》（《坠入大漩涡》），使这个词在英语文学中更具代表性。"]}
{"word":"maelstroms","summary":{"en":"“Maelstroms” means powerful sea whirlpools, or (figuratively) overwhelming chaos and turmoil.","zh":"“maelstroms”指强大的海上漩涡，也可比喻难以控制的混乱与动荡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Powerful whirlpools or violent swirling currents in the sea (plural of “maelstrom”).","zh":"（maelstrom 的复数）海上的巨大漩涡；强烈翻涌的水流。"},"examples":[{"en":"Sailors feared the maelstroms near the rocky coast.","zh":"水手们害怕岩石海岸附近的巨大漩涡。"},{"en":"The map warned of maelstroms that could pull small boats off course.","zh":"地图警告说有漩涡可能把小船带离航线。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, multiple chaotic or overwhelming situations, events, or emotions happening at once.","zh":"（比喻）混乱、动荡、令人不堪承受的局面（复数）。"},"examples":[{"en":"After the scandal, the company faced maelstroms of criticism online.","zh":"丑闻之后，这家公司在网上遭遇了铺天盖地的批评。"},{"en":"In the maelstroms of exams, work, and family duties, she tried to stay calm.","zh":"在考试、工作和家庭责任的混乱夹击下，她努力保持冷静。"}]}],"synonyms":["whirlpools","vortices","turmoil","chaos","upheaval"],"phonetic":"/ˈmeɪlstrəm/","extraExplanation":["“maelstrom”常与海洋危险、不可控的力量联系在一起，来源于荷兰语/挪威语相关词，历史上也常指挪威海域著名的强涡流（如莫斯克斯特劳门 Moskstraumen）。","文学中常用作象征：不仅是“水的漩涡”，也可象征社会动荡或心理风暴。比如爱伦·坡（Edgar Allan Poe）有短篇《A Descent into the Maelström》（《坠入大漩涡》）。"]}
{"word":"maemacterion","summary":{"en":"Maemacterion is an ancient Athenian (Attic) month name, roughly late November to December.","zh":"Maemacterion 是古雅典（阿提卡）历中的一个月份名称，大致相当于公历11月下旬到12月。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Ancient Greece) The fifth month of the Attic calendar, roughly corresponding to late November–December.","zh":"（古希腊）阿提卡历（雅典历）的第五个月，大致相当于公历11月下旬到12月。"},"examples":[{"en":"Many festivals in Athens were dated by months like Maemacterion rather than by numbered days.","zh":"雅典的许多节庆会用像 Maemacterion 这样的月份来纪年，而不是用数字日期。"},{"en":"The inscription records a payment made in Maemacterion, during the sailing season’s decline.","zh":"这段铭文记载了一笔在 Maemacterion 期间的付款，当时航海季节已逐渐结束。"}]}],"synonyms":["Maimakterion","Maemakterion","Attic month"],"phonetic":"/maɪˈmæk.tə.ri.ən/","extraExplanation":["“Maemacterion”更常见的拼写是 **Maimakterion / Maimakterion**（也见 Maemakterion）。它来自希腊语 **Maimaktēr**，与“暴风、狂烈天气”相关，因此这个月名常让人联想到入冬前后的风暴天气。","阿提卡历是以月相为基础的阴历系统，不同城邦的历法与月份名称可能不完全相同，所以在阅读古典文献或铭文时，通常需要换算到大致的公历月份范围。"]}
{"word":"Maemakterion","summary":{"en":"an ancient Athenian month roughly in November–December","zh":"古雅典历中约对应公历11–12月的月份"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek calendar) A month in the Attic (Athenian) calendar, roughly corresponding to late autumn (around November–December).","zh":"（古希腊历法）雅典（阿提卡）历中的一个月份，大致相当于深秋到初冬（约公历11–12月）。"},"examples":[{"en":"Some Athenian festivals were held in Maimakterion, when the weather often turned stormy.","zh":"一些雅典节庆在迈马克特里翁月举行，那时天气常常转为风暴多发。"},{"en":"The inscription dates the event to the month of Maimakterion in the archon’s year.","zh":"这段铭文把事件日期记为某执政官任内的迈马克特里翁月。"}]}],"synonyms":["Maimakterion","Maimacterion","Greek month","Attic month"],"phonetic":"ˌmaɪməˈkɪriən","extraExplanation":["你输入的拼写“Maemakterion”更常见的转写是“Maimakterion”（也见“Maimacterion”）。不同拉丁化拼写都指同一个古雅典历月。","这是古代历法名词，多见于古典学、历史、铭文学资料中；在现代日常英语里几乎不会用到。"],"etymology":"源自古希腊语 Μαημακτηριών（Maimaktēriṓn），与宙斯的称号“Μαιμάκτης”（意为“狂暴/风暴之神”之类的含义）相关，因此这个月份常被联想到风暴与恶劣天气。","mnemonic":["把它拆成“mai- + mak-”：联想“迈（mai）进”到“风暴（storm）”季节——这个月常和宙斯的“暴风”称号相关。"]}
{"word":"maenad","summary":{"en":"A maenad is a female follower of Dionysus in Greek myth, or (figuratively) a wildly frenzied woman.","zh":"maenad 指希腊神话中酒神狄俄尼索斯的女性追随者，也可比喻情绪或行为极度狂热的女子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a female follower of Dionysus (the god of wine), known for wild, ecstatic dancing and intense celebration.","zh":"（希腊神话）酒神狄俄尼索斯（Dionysus）的女性追随者，常被描写为狂喜起舞、纵情庆典的女子。"},"examples":[{"en":"In the myth, the maenads danced through the forest in a frenzy of worship.","zh":"在神话中，酒神女信徒们在森林里狂热地跳着敬神之舞。"},{"en":"The painting shows maenads celebrating Dionysus with drums and wine.","zh":"这幅画描绘了酒神女信徒们击鼓饮酒、庆祝狄俄尼索斯。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman who behaves in a wildly excited or frenzied way (often used in a literary or figurative sense).","zh":"（文学/比喻）行为极度兴奋、近乎狂乱的女子。"},"examples":[{"en":"In the novel, the crowd is described as maenads, swept up by the music.","zh":"小说中把人群写成“酒神女信徒”，被音乐裹挟得近乎疯狂。"},{"en":"She spoke with the intensity of a maenad, unable to sit still.","zh":"她说话时像“酒神女信徒”般激动，坐也坐不住。"}]}],"synonyms":["bacchante","frenzied woman","wild celebrant"],"phonetic":"/ˈmiːnæd/","extraExplanation":["“Maenad”来自希腊语 mainas（意为“疯狂的女子”）。在古希腊艺术与戏剧里，酒神女信徒常象征酒神崇拜中的“狂喜”（ecstasy）与失控的力量。","在文学中，这个词常用来营造古典、戏剧化的氛围，强调群体狂热或个人情绪的失控，而不一定指真实宗教人物。常见相关形象还包括“酒神祭典”（Bacchanal）与“酒神式的狂欢”（bacchanalian）。"]}
{"word":"maenades","summary":{"en":"Maenades are the (mythical) female followers of Dionysus, famous for ecstatic, wild ritual dancing.","zh":"Maenades 指希腊神话中酒神狄俄尼索斯的女性追随者，以狂喜、狂舞的仪式形象著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"women who were followers of Dionysus (Bacchus) in Greek mythology, often shown in art and literature as dancing wildly and entering a state of religious ecstasy; plural of maenad.","zh":"（希腊神话中）酒神狄俄尼索斯（罗马名巴克科斯）的女性追随者，常被描绘为狂舞、陷入宗教性的狂喜状态；为 maenad 的复数。"},"examples":[{"en":"In the painting, the maenades whirl through the forest in a frenzy.","zh":"在那幅画里，狂女们在森林中旋转狂舞，陷入癫狂。"},{"en":"The play uses maenades as a symbol of uncontrollable desire and religious ecstasy.","zh":"这部戏剧用狂女来象征难以控制的欲望与宗教狂喜。"}]}],"synonyms":["maenads","Bacchantes","Dionysian women"],"phonetic":"/ˈmiːnædz/","extraExplanation":["“Maenades”是“maenad”的一种复数写法（也常见作“maenads”）。词源来自希腊语 mainás，和“发狂/狂热”有关。","在文学中常与欧里庇得斯的悲剧《酒神的女信徒》（The Bacchae）相关；“Bacchantes（巴克科斯女信徒）”也常被当作近义称呼。"]}
{"word":"maenadic","summary":{"en":"Maenadic means “like the Maenads” in Greek myth—wild, ecstatic, and frenzied.","zh":"maenadic 指“像希腊神话中的迈那得那样”——狂喜、狂乱、带有失控般激情的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Maenads (women in Greek myth who worshiped Dionysus) or to their wild, ecstatic behavior.","zh":"与“迈那得”（希腊神话中酒神狄俄尼索斯的女性狂欢信徒）有关的；或指她们那种狂喜、狂乱的行为。"},"examples":[{"en":"The novel describes a maenadic festival filled with dancing and shouting.","zh":"小说描写了一场迈那得式的节庆，到处是舞蹈与呼喊。"},{"en":"Her maenadic devotion to the singer surprised even her friends.","zh":"她对那位歌手近乎“迈那得式”的狂热崇拜，连朋友都感到惊讶。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wildly excited or frenzied; intensely passionate in a way that seems out of control.","zh":"极度兴奋的；狂乱的；带有失控般强烈激情的。"},"examples":[{"en":"The crowd grew maenadic as the game went into overtime.","zh":"比赛进入加时后，人群变得近乎狂乱。"},{"en":"He rejected the maenadic rumor-spreading and asked for facts.","zh":"他拒绝那种狂热失控的谣言传播，要求拿出事实。"}]}],"synonyms":["frenzied","ecstatic","wild","rabid","hysterical","orgiastic"],"phonetic":"/miˈnædɪk/","extraExplanation":["“maenadic”来自希腊神话中的 Maenads（迈那得），她们是酒神狄俄尼索斯（Dionysus）的女信徒，常被描写为在宗教狂欢中进入“出神/狂喜”的状态（ecstasy）。因此这个词在英语里多用于文学、评论或较正式的写作，用来强调一种“狂热到近乎失控”的氛围。","常见搭配包括 maenadic frenzy（狂乱）、maenadic dance（狂舞）、maenadic rites（狂欢仪式/祭仪）。在文学中，你可能会在欧里庇得斯的悲剧《酒神的女信徒》（The Bacchae）相关讨论里见到这个词。"]}
{"word":"maenadically","summary":{"en":"“Maenadically” means “in a wild, ecstatic, frenzied way,” like a Dionysian frenzy.","zh":"“maenadically”意为“以狂热、忘我、癫狂的方式”，带有“酒神式狂欢”的联想。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a wild, frenzied, ecstatic, or fanatically excited way (often suggesting uncontrolled celebration or behavior).","zh":"以狂热的、癫狂的、忘我的方式（常暗示失控的庆祝或行为）。"},"examples":[{"en":"The crowd danced maenadically as the music grew louder.","zh":"音乐越来越响时，人群以近乎癫狂的方式跳舞。"},{"en":"He spoke maenadically, as if carried away by a sudden rush of emotion.","zh":"他说话时情绪像突然爆发一样，近乎狂热。"}]}],"synonyms":["wildly","frantically","feverishly","ecstatically","frenziedly"],"phonetic":"/miːˈnædɪkli/","extraExplanation":["“maenadically”来自“maenadic”，而“maenadic”源自希腊神话中的 Maenads（酒神狄俄尼索斯 Dionysus 的女信徒/随从）。她们常被描写为在宗教狂喜中跳舞、欢呼，甚至失去理性，因此这个词带有“酒神式的狂欢、失控的亢奋”的文化意象。","现代英语里它比较少见，常用于文学或较有画面感的写作；日常表达更常用“wildly / frantically / feverishly”。"]}
{"word":"maenadism","summary":{"en":"Maenadism means a wild, ecstatic frenzy—often used in literary or historical contexts related to Dionysus worship.","zh":"Maenadism 指酒神女信徒式的狂喜狂乱，常用于文学或历史语境，也可比喻失控的群体狂热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild, frenzied state of excitement (often linked to drunken, ecstatic dancing), like the behavior of the Maenads in Greek mythology","zh":"一种狂喜般的疯狂兴奋状态（常与醉酒、狂热舞蹈等有关），类似希腊神话中“酒神女信徒”（Maenads）的行为"},"examples":[{"en":"The crowd’s cheers rose into something like maenadism, loud and uncontrollable.","zh":"人群的欢呼逐渐变成了一种近似酒神式狂乱的状态，喧闹而难以控制。"},{"en":"In the novel, the festival scene is described as a brief outbreak of maenadism.","zh":"小说中把节庆场面描写成一阵短暂爆发的酒神式狂乱。"}]},{"partOfSpeech":"n.","definition":{"en":"a religious or cultural practice characterized by ecstatic frenzy, associated with the worship of Dionysus (Bacchus)","zh":"一种带有狂喜狂热特征的宗教/文化实践，常与狄俄尼索斯（酒神巴克斯）的崇拜相关"},"examples":[{"en":"Some historians discuss maenadism as part of ancient Dionysian ritual life.","zh":"一些历史学者会把酒神式狂乱视为古代狄俄尼索斯仪式生活的一部分来讨论。"}]}],"synonyms":["frenzy","ecstasy","mania","orgiastic revelry","bacchanalia"],"phonetic":"/ˈmiːnəˌdɪzəm/","extraExplanation":["词源来自“Maenad”（酒神女信徒，希腊语含“狂乱者/发狂者”之意）+“-ism”。在英文里更常见的是形容词“maenadic”（酒神式的、狂乱的）。","文化背景：Maenads 常出现在希腊戏剧与神话中，尤其与欧里庇得斯（Euripides）的《酒神的女信徒》（The Bacchae）有关；英语里用 maenadism 多是文学化/比喻用法，形容失控的群体狂热。"]}
{"word":"maenads","summary":{"en":"Maenads are the ecstatic female followers of Dionysus in Greek mythology; the word can also mean frenzied, uncontrollable people (often used figuratively).","zh":"Maenads 指希腊神话中酒神狄俄倪索斯的狂喜女信徒；也可作比喻，指狂热失控的人群（常用来强调兴奋与混乱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, women who worshiped Dionysus (Bacchus), often shown in a wild, ecstatic state during rituals.","zh":"（希腊神话）酒神狄俄倪索斯（罗马名：巴克科斯）的女信徒，常被描绘为在仪式中陷入狂喜、狂乱的状态。"},"examples":[{"en":"In the myth, the maenads follow Dionysus into the mountains to celebrate.","zh":"在神话里，迈那得们跟随狄俄倪索斯走进群山庆祝。"},{"en":"The painting shows maenads dancing with drums and ivy crowns.","zh":"这幅画描绘了迈那得们敲着鼓、戴着常春藤花冠起舞。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, people (often women) behaving in a frenzied, uncontrollable way, especially as an excited crowd.","zh":"（比喻）行为狂热、难以控制的人（常指女性），尤其指兴奋失控的人群。"},"examples":[{"en":"The headline described the fans as maenads rushing the stage.","zh":"标题把冲向舞台的粉丝形容为“迈那得般的狂热人群”。"},{"en":"In the novel, the party turns chaotic, and the guests move like maenads.","zh":"在小说中，派对变得混乱，宾客像迈那得一样失控躁动。"}]}],"synonyms":["bacchantes","frenzied women","rabble (figurative)","fanatics (figurative)"],"phonetic":"ˈmiːnædz","extraExplanation":["“Maenads”是“maenad”的复数，来自希腊语 *mainas*（意为“疯狂的女子”），与“mania（躁狂、狂热）”同源。","在文学与艺术中，maenads常与葡萄藤、常春藤、酒、鼓与山林狂欢等意象相连；它既可指宗教性的“神圣狂喜”，也常被用来强调失序、冲动与集体狂热。"]}
{"word":"maenaite","summary":{"en":"Maenaite means a Maenad (a female follower of Dionysus) or something relating to Maenads and Dionysian ecstatic worship.","zh":"Maenaite 指酒神狄俄尼索斯的女性追随者（Maenad），也可作形容词表示与酒神女祭司及其狂喜式崇拜相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female follower of Dionysus (Bacchus) in Greek mythology; a Maenad.","zh":"（希腊神话中）酒神狄俄尼索斯（罗马名巴克科斯）的女性追随者；即“酒神女祭司/狂女”（Maenad）。"},"examples":[{"en":"In the painting, a maenaite dances wildly in honor of Dionysus.","zh":"在这幅画中，一位 maenaite 为狄俄尼索斯狂舞。"},{"en":"The poet describes the maenaites shouting in the mountains at night.","zh":"诗人描写 maenaites 在夜晚的山中呼喊。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Maenads or to the ecstatic worship of Dionysus.","zh":"与酒神女祭司（Maenads）或与狄俄尼索斯的狂喜式崇拜相关的。"},"examples":[{"en":"The play uses maenaite imagery—ivy, drums, and ecstatic dancing.","zh":"这部戏运用了 maenaite 意象——常春藤、鼓点与忘我的舞蹈。"}]}],"synonyms":["maenad","bacchante","bacchant"],"phonetic":"/ˈmiːnəˌaɪt/","extraExplanation":["“Maenaite”来自希腊语词根，和“Maenad（酒神女祭司/狂女）”同源。相关形象常见于古希腊戏剧与文学，尤其是欧里庇得斯的《酒神的女信徒》（The Bacchae），常用来象征“狂喜、失控、神秘仪式中的激情”。","现代英语里更常用的词是“Maenad”或“Bacchante”。“Maenaite”较少见，多出现在文学、艺术史或古典研究语境中。"]}
{"word":"Maenalus","summary":{"en":"a classical Arcadian mountain name used as a symbol of pastoral countryside","zh":"古典文学中象征田园牧歌世界的阿卡迪亚山名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Greek mythology and classical literature) a mountain in Arcadia (Greece), often used as a poetic symbol of rustic, pastoral life.","zh":"（希腊神话与古典文学中）阿卡迪亚的一座山；常被诗歌借用来象征质朴的田园生活。"},"examples":[{"en":"In Virgil’s pastoral poems, Maenalus stands for the wild, musical countryside of Arcadia.","zh":"在维吉尔的田园诗里，Maenalus 常用来代表阿卡迪亚那种野性而富有音乐感的乡野世界。"},{"en":"The novel borrows the name Maenalus to suggest an idealized rural setting.","zh":"这部小说借用 Maenalus 这个名字，暗示一种被理想化的乡村背景。"}]}],"synonyms":["Arcadia","pastoral paradise","Mainalo"],"phonetic":"/ˈmiːnələs/","extraExplanation":["在英语文学里，Maenalus 常出现在“牧歌/田园诗”（pastoral poetry）的传统中，尤其与维吉尔（Virgil）的《牧歌》（Eclogues）相关。它不一定是在讲具体地理位置，而是借地名营造一种“远离城市、贴近自然、牧人歌唱”的氛围。"],"etymology":"源自拉丁语 Maenalus，来自古希腊语 Mainalon（指阿卡迪亚地区的“迈纳洛山/迈纳罗斯山”）。在罗马与后世欧洲文学中，这个地名逐渐获得“田园、牧歌式自然”的象征意义。","mnemonic":["把它联想成“美（美好）+纳（纳入）+洛斯（像古希腊名字）”：把“美好的田园”纳入想象之地。","可记成“main land（主要土地）→ 田园之地”的谐联想：看到 Maenalus 就想到牧歌式的乡野。"]}
{"word":"maenalus","summary":{"en":"Maenalus is a classical name for a mountain in Arcadia, often used poetically to evoke pastoral nature and shepherd life.","zh":"Maenalus 是古典文学中阿卡迪亚的一座山名，常被诗意地用来唤起田园自然与牧羊生活的意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Greek mythology and classical literature) A mountain (Mount Maenalus) in Arcadia, Greece, often used as a poetic symbol of wild nature, shepherd life, and pastoral scenery.","zh":"（希腊神话与古典文学中）希腊阿卡迪亚的迈那洛斯山（Maenalus 山），常被诗歌用作“荒野自然、牧羊生活、田园风景”的象征。"},"examples":[{"en":"In Virgil’s pastoral poems, Maenalus appears as a landscape of forests, flocks, and songs.","zh":"在维吉尔的田园诗中，Maenalus 常被写成有森林、羊群与歌声的风景。"},{"en":"The novel borrows the name Maenalus to suggest a quiet, old-fashioned countryside mood.","zh":"这部小说借用 Maenalus 这个名字来暗示一种安静、古朴的乡村氛围。"}]}],"synonyms":["Mount Maenalus","Maenalus (Arcadia)"],"phonetic":"/miˈnæləs/","extraExplanation":["Maenalus 多见于古典作品的“田园诗（pastoral）”语境：阿卡迪亚（Arcadia）在欧洲文学里常被理想化为牧人、自然与简朴生活的乐土，因此 Maenalus 也常成为一种“田园意象”，不一定指真实地理描写。","拼写与读音来自拉丁化形式 Maenalus；在英语文本中通常作为专有名词使用，首字母大写。"]}
{"word":"maenidae","summary":{"en":"Maenidae is the scientific family name for moonyfishes, small marine fishes mainly in the Mediterranean and eastern Atlantic.","zh":"Maenidae 是“月鱼科”的学名，指主要分布于地中海与东大西洋的一类小型海水鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small marine fishes (often called moonyfishes), found mainly in the eastern Atlantic and Mediterranean Sea.","zh":"（鱼类）月鱼科：一类体型较小的海水鱼，俗称“月鱼/银月鱼”，主要分布在东大西洋与地中海。"},"examples":[{"en":"Scientists recorded several Maenidae species along the Mediterranean coast.","zh":"科学家在地中海沿岸记录到了几种月鱼科的鱼类。"},{"en":"Some Maenidae are caught in small-scale coastal fisheries.","zh":"一些月鱼科鱼类会被沿海小规模渔业捕捞。"}]}],"synonyms":["moonyfishes (common name)","moonfish family (informal)"],"phonetic":"/miːˈnaɪdiː/","extraExplanation":["“Maenidae”是生物分类学中的“科”名，常见于学术文章、鱼类图鉴和物种数据库中；日常英语里更常用的是通俗名（如 moonyfishes/月鱼）。","词尾 -idae 是动物分类中表示“科”的常见拉丁化后缀（例如 Felidae 猫科，Canidae 犬科）。"]}
{"word":"maeonian","summary":{"en":"Maeonian is a literary word meaning “Lydian; from ancient Maeonia (western Asia Minor),” and rarely it can mean a person from that region.","zh":"Maeonian 是文学用词，意为“古代 Maeonia（多指吕底亚，位于小亚细亚西部）的；吕底亚的”，少见时也可指“该地的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Relating to ancient Maeonia (often identified with Lydia in western Asia Minor), or to its people; Lydian.","zh":"（文学用语）与古代“Maeonia”（常被视为小亚细亚西部的吕底亚 Lydia）或其居民有关的；吕底亚的。"},"examples":[{"en":"In the poem, the river is called “Maeonian,” a poetic way to say it flows through Lydia.","zh":"在诗里，这条河被称作“Maeonian”，是一种诗意的说法，意思是它流经吕底亚。"},{"en":"The author describes “Maeonian music” to give the scene an ancient, classical feeling.","zh":"作者写到“Maeonian music（Maeonian 的音乐）”，用来营造古典、古代的氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from ancient Maeonia/Lydia (rare; mainly in older texts).","zh":"（罕见；多见于旧文本）古代 Maeonia/吕底亚人。"},"examples":[{"en":"The historian mentions Maeonians alongside other peoples of Asia Minor.","zh":"这位历史学家在提到小亚细亚各民族时，也提到了 Maeonians。"}]}],"synonyms":["Lydian","of Lydia","(poetic) Anatolian"],"phonetic":"/miˈoʊniən/","extraExplanation":["“Maeonian”主要出现在古典题材的诗歌、史书或带有古风的英语写作里，属于“诗性地名形容词”（用地名来制造古典气息），类似于用“Spartan”表示“斯巴达的/尚武的”。","在一些古典传统中，“Maeonian”还可能被用作与早期希腊史诗传统相关的诗意指称（例如提到荷马的语境），但现代英语里非常少见，多数读者会把它理解为“吕底亚/小亚细亚西部”的文学性称呼。"]}
{"word":"maeonides","summary":{"en":"Maeonides is a classical poetic name for Homer, meaning “the Maeonian,” i.e., from ancient Maeonia (Lydia).","zh":"Maeonides 是古典文学中对荷马的诗性别称，意为“来自古代梅奥尼亚（吕底亚一带）的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Classical literature) A poetic name for Homer, meaning “the Maeonian (man),” i.e., from Maeonia (an ancient region in Lydia, Asia Minor).","zh":"（古典文学）“Maeonides”是对荷马（Homer）的诗性称呼，意为“来自梅奥尼亚（Maeonia）的那位（人）”，梅奥尼亚是古代小亚细亚吕底亚地区的一部分。"},"examples":[{"en":"In some Latin poems, Maeonides is used as another name for Homer.","zh":"在一些拉丁诗歌中，“Maeonides”被用作荷马的别称。"},{"en":"The author quotes Maeonides to give the passage an epic, Homeric feel.","zh":"作者引用“Maeonides”，让这段文字带有史诗式的“荷马风格”。"}]},{"partOfSpeech":"other","definition":{"en":"(Broader, rarer) A patronymic-style epithet meaning “son/descendant of Maeon,” used in classical-style writing.","zh":"（更宽泛、较少见）一种父名式称号，意为“梅奥恩（Maeon）的儿子/后裔”，用于模仿古典文风的写作中。"},"examples":[{"en":"The translator keeps the epithet Maeonides to preserve the classical tone.","zh":"译者保留“Maeonides”这一称号，以保留古典语气。"}]}],"synonyms":["Homer","the Homeric poet","the bard of Maeonia"],"phonetic":"/miˈɑnɪˌdiz/","extraExplanation":["“Maeonides”是拉丁化的希腊式别名（类似称号/外号），常见于古罗马诗人或学者写作中，用来避免重复直呼“Homer”，也让语气更庄重、更“史诗化”。","“Maeonia”（梅奥尼亚）通常被认为与吕底亚（Lydia）相关；因此该称号在文化上等于在说“那位来自小亚细亚的史诗诗人（荷马）”。"]}
{"word":"maes","summary":{"en":"Maes is mainly a Welsh word meaning “field,” and it can also be a surname.","zh":"Maes 主要是威尔士语，意为“田野/开阔地”，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Welsh word meaning “field” or “open ground,” sometimes seen in Welsh place names (and occasionally used in English texts about Wales).","zh":"威尔士语词，意为“田野、空地”，常见于威尔士地名中（在介绍威尔士的英文语境里偶尔会直接使用）。"},"examples":[{"en":"In Welsh place names, maes often refers to a field or open area.","zh":"在威尔士地名中，maes 常指“田野”或“开阔地”。"},{"en":"They walked across the maes outside the village.","zh":"他们穿过村外那片开阔的田野。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Dr. Maes will speak at the conference tomorrow.","zh":"Maes 医生明天将在会议上发言。"}]}],"synonyms":["field","open ground","meadow"],"phonetic":"/meɪz/","extraExplanation":["“Maes”来自威尔士语，在威尔士很常见，尤其体现在地名里。很多威尔士地名会用自然地貌相关的词来描述地点特征；看到 maes，通常可以理解为“田地/空旷地带”的线索。","如果你是想查英文单词但拼写不确定：常见的相近拼写有 maze（迷宫）、mace（权杖/肉豆蔻豆蔻衣）等。你想找的是哪一个？"]}
{"word":"Maesse","summary":{"en":"Maesse is most often a surname; more rarely it may be a nonstandard spelling related to German “Messe,” depending on context.","zh":"Maesse 最常见是姓氏；较少情况下可能是与德语 “Messe”（博览会/弥撒）相关的非标准拼写，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A surname (family name).","zh":"（专有名词）姓氏（家族姓）。"},"examples":[{"en":"Dr. Maesse will present the research findings tomorrow.","zh":"Maesse 博士将于明天展示研究结果。"},{"en":"I found the name Maesse in an old registry.","zh":"我在一份旧登记册里看到了 Maesse 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare) A nonstandard spelling that may appear as a variant of German “Messe” (a trade fair, or a religious Mass), depending on context.","zh":"（罕见）一种非标准拼写，可能是德语 “Messe” 的变体（指“商品交易会/博览会”，或“弥撒”），具体含义取决于语境。"},"examples":[{"en":"The document mentions “Maesse,” likely referring to the Messe (trade fair) in the region.","zh":"文件中提到 “Maesse”，很可能指该地区的 Messe（博览会/交易会）。"},{"en":"In some older texts, spellings vary, and “Maesse” may stand in for “Messe.”","zh":"在一些较旧的文本中，拼写可能不统一，“Maesse” 有时会用来代指 “Messe”。"}]}],"phonetic":"/ˈmɛsə/","extraExplanation":["“Maesse” 不是常见的标准英语词汇，更常见于人名（姓氏）或作为外来词/拼写变体出现在特定语境里。","如果你是在某篇文章、名单、地图或历史记录中看到 “Maesse”，最可靠的做法是：确认它是否为人名；若是地名/活动名，再对照当地语言（尤其是德语区）里 “Messe”（博览会/弥撒）的用法。","拼写上双写元音（如 ae）有时来自旧式拼写、扫描/OCR 误读，或把带变音符号的德语拼写转写为拉丁字母时产生的差异。"]}
{"word":"maestive","summary":{"en":"Maestive means “related to May,” especially describing things that happen or bloom in May.","zh":"maestive 指“与五月有关的”，常用于描述在五月发生或盛开的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to May; appearing, blooming, or happening in the month of May.","zh":"（罕用）与五月有关的；在五月出现、开花或发生的。"},"examples":[{"en":"The poet described the maestive air as soft, bright, and full of new leaves.","zh":"诗人把五月的空气写得柔和明亮，充满新叶的气息。"},{"en":"Maestive flowers often include early roses and spring wildflowers that peak in May.","zh":"“五月花”常包括早开的玫瑰以及在五月达到盛放的春季野花。"}]}],"synonyms":["Maytime","in May","springlike","vernal"],"phonetic":"/meɪˈstiːv/","extraExplanation":["这是一个非常少见的形容词，来自拉丁语 *Maius*（“五月”）。在现代英语里更常用的说法是 *May* / *Maytime*、*in May*，或用更宽泛的季节词如 *spring*、*vernal*（春季的）。在文学或古典风格写作中偶尔会用它来营造“五月气息”的意象。"]}
{"word":"maestoso","summary":{"en":"Maestoso is a musical term meaning “majestic and stately,” telling performers to play in a grand, noble style.","zh":"Maestoso 是音乐术语，表示“庄严宏伟、威严从容”，提示演奏要有宏大高贵的气质。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Music) A direction to perform in a majestic, stately, grand manner.","zh":"（音乐术语）指示以庄严宏伟、威严从容的风格演奏。"},"examples":[{"en":"The conductor asked the strings to play the opening maestoso.","zh":"指挥要求弦乐把开头演奏得更“maestoso”（庄严宏伟）。"},{"en":"At the maestoso section, the tempo felt broad and noble.","zh":"进入 maestoso 段落时，速度显得更宽广、更高贵。"}]},{"partOfSpeech":"adj.","definition":{"en":"Majestic or stately in character (often used to describe a musical passage or style).","zh":"雄伟庄严的、气势恢宏的（常用于形容乐段或风格）。"},"examples":[{"en":"It’s a maestoso theme that sounds like a royal procession.","zh":"这是一个 maestoso 的主题，听起来像王室游行。"},{"en":"The pianist shaped the melody into a maestoso arc.","zh":"钢琴家把旋律塑造成一个庄严宏大的乐句走向。"}]}],"synonyms":["majestic","stately","grand","noble","regal"],"phonetic":"/maɪˈstoʊsoʊ/","extraExplanation":["“Maestoso”源自意大利语，来自“maestà”（威严、庄严）。在乐谱里它通常是表情/速度提示，意思更偏“气质与力度的庄重感”，不一定等于“更慢”，而是要更宽广、厚重、带权威感。","常见搭配：maestoso assai（非常庄严宏伟）、maestoso e sostenuto（庄严且延音/连贯）。"]}
{"word":"maestosos","summary":{"en":"Maestoso is a musical term meaning “in a majestic, stately way,” and it can also describe music that sounds grand and noble.","zh":"Maestoso 是乐谱中的术语，表示“以庄严雄伟的方式（演奏）”，也可形容音乐听起来宏大而高贵。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Music) A direction to play in a majestic, stately way—often with a broad tempo and a full, noble sound.","zh":"（音乐术语）指示以庄严、雄伟的方式演奏——通常速度较宽广、音色饱满而有气势。"},"examples":[{"en":"The conductor asked the strings to play the opening maestoso.","zh":"指挥要求弦乐把开头用 maestoso（庄严雄伟地）来演奏。"},{"en":"Mark it maestoso, not too fast, so the melody sounds grand.","zh":"标注为 maestoso，不要太快，这样旋律才会显得宏伟。"}]},{"partOfSpeech":"adj.","definition":{"en":"Majestic; grand and stately in character (especially about music or a musical passage).","zh":"雄伟庄严的；宏大而端庄的（尤指音乐或某段乐句的气质）。"},"examples":[{"en":"It has a maestoso theme that feels like a royal entrance.","zh":"它的主题很 maestoso，让人联想到王者登场的气势。"},{"en":"The piece ends with a maestoso chord progression.","zh":"这首曲子以庄严雄伟的和弦进行收尾。"}]}],"synonyms":["majestic","stately","grand","noble","with majesty"],"phonetic":"/maɪˈstoʊzoʊ/","extraExplanation":["“maestoso”来自意大利语，常见于乐谱速度/表情标记（像 allegro, adagio 一样）。它更强调“庄严、宏伟的气质”，不只是“慢”。","你输入的“maestosos”更像西班牙语或意大利语的复数形式；英语中通常用原形“maestoso”，不常写复数。"]}
{"word":"maestra","summary":{"en":"Maestra is a borrowed word meaning a female maestro—especially a woman conductor—or, in Spanish/Italian contexts, a female teacher.","zh":"Maestra 是外来词，常指女指挥/女音乐大师；在西语或意大利语语境中也可指女老师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who is a master in music, especially a female conductor or musical director (the feminine form of “maestro”).","zh":"（尤指音乐领域的）女大师；女指挥；女音乐总监（“maestro”的阴性形式）。"},"examples":[{"en":"The maestra led the orchestra with calm authority.","zh":"这位女指挥沉稳而有威严地带领着乐团。"},{"en":"After the concert, the audience applauded the maestra for her interpretation of the symphony.","zh":"音乐会结束后，观众为这位女指挥对交响曲的诠释鼓掌致意。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Spanish or Italian contexts) a female teacher, especially in a primary school.","zh":"（在西班牙语或意大利语语境中）女老师（尤指小学老师）。"},"examples":[{"en":"In Mexico, children might call their teacher “maestra.”","zh":"在墨西哥，孩子们可能会称呼老师为“maestra”。"},{"en":"She thanked her maestra for helping her learn to read.","zh":"她感谢自己的老师帮助她学会阅读。"}]}],"synonyms":["conductor","maestro","music director","teacher (in Spanish contexts)"],"phonetic":"/maɪˈstrɑː/","extraExplanation":["“Maestra”是外来词：在意大利语里是“maestro”（大师/指挥）的阴性形式。英语中使用时，最常见于古典音乐、歌剧等场合，强调“女性指挥/女性音乐大师”的身份。","在西班牙语国家，“maestra”日常就可指女老师（与“maestro”相对）。英语句子里如果直接用这个词，往往是在保留当地称呼、体现文化语境。"]}
{"word":"maestri","summary":{"en":"“Maestri” is the Italian plural of “maestro,” meaning respected masters (often in music). In English, it’s used mainly in Italian/cultural contexts; “maestros” is more common.","zh":"“Maestri”是意大利语中“maestro（大师/名家，常指音乐界）”的复数。在英语里多用于意大利或文化语境；更常见的英语复数是“maestros”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian plural) More than one “maestro” — respected masters/experts, especially conductors, composers, or highly skilled artists and teachers.","zh":"（意大利语复数）“maestro”的复数：多位“大师/名家”，尤指指挥家、作曲家或技艺高超的艺术家、老师。"},"examples":[{"en":"The festival invited several Italian maestri to lead the orchestra.","zh":"音乐节邀请了几位意大利指挥大师来指挥乐团。"},{"en":"Young musicians studied with the maestri of the old conservatory tradition.","zh":"年轻音乐家向老派音乐学院传统中的几位大师学习。"}]}],"synonyms":["maestros","masters","experts"],"phonetic":"/maˈɛstri/","extraExplanation":["“Maestri”主要是意大利语里“maestro（大师/师傅/指挥）”的复数形式。在英语文章中，有时为了保留意大利文化语感（尤其在古典音乐、歌剧语境），会直接用“maestri”；更常见、更“英语化”的复数写法是“maestros”。","词源上，maestro 来自拉丁语“magister（师长/导师）”。在意大利文化里，它既可用于音乐界的“指挥/名师”，也可用于手艺人或领域专家，带有尊敬意味。"]}
{"word":"maestro","summary":{"en":"A respectful term for a great musician (especially a conductor), and by extension anyone who is very skilled.","zh":"对杰出音乐家（尤指指挥）的尊称，也可引申指任何非常擅长某事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A highly skilled musician, especially a famous conductor, composer, or performer (often used as a respectful title).","zh":"（尤指著名的）音乐大师；指挥家/作曲家/演奏家（常作尊称或头衔）。"},"examples":[{"en":"The maestro raised his baton and the orchestra began to play.","zh":"指挥大师举起指挥棒，乐团随即开始演奏。"},{"en":"Everyone applauded the maestro after the concert.","zh":"音乐会结束后，大家为这位大师鼓掌。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is extremely skilled at something (often used humorously or admiringly).","zh":"（常带赞赏或幽默）某方面的高手；大师级人物。"},"examples":[{"en":"She’s a maestro at organizing busy schedules.","zh":"她在安排繁忙日程方面简直是个高手。"},{"en":"He’s the maestro of making simple meals taste great.","zh":"他很会把简单的饭菜做得特别好吃。"}]}],"synonyms":["virtuoso","master","genius","conductor"],"phonetic":"/ˈmaɪstroʊ/","extraExplanation":["“Maestro”来自意大利语，原意是“老师/师傅”。在古典音乐语境中常用来尊称知名指挥家或作曲家（如“Maestro Verdi”）。在英语里也会借用到日常场景，表示“某领域的高手”，语气多为称赞。","在称呼上，有时会直接说“Maestro!”作为礼貌且带敬意的叫法，但在非音乐场合使用可能显得夸张或带玩笑意味，取决于语境与关系。"]}
{"word":"maestros","summary":{"en":"“Maestros” means highly respected masters—especially music conductors—or experts in a field.","zh":"“Maestros”指“大师们”，尤指（著名）指挥家，也可泛指某领域的高手/专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “maestro”: musicians (especially conductors) or people highly respected for great skill in an art, craft, or field.","zh":"“maestro”的复数：指（尤指）指挥家、音乐大师；也可泛指在某个艺术、技艺或领域中备受敬重的高手/大师。"},"examples":[{"en":"The festival invited several maestros to conduct the orchestra.","zh":"音乐节邀请了几位指挥大师来指挥乐团。"},{"en":"These chefs are maestros of Italian cuisine.","zh":"这些厨师是意大利菜的高手。"}]}],"synonyms":["masters","experts","virtuosos","conductors","adepts"],"phonetic":"/ˈmaɪstroʊz/","extraExplanation":["“Maestro”来自意大利语，原意与“老师/导师”有关；在英语里最常用于古典音乐语境（尤其是对著名指挥家的尊称），也会更广义地表示“某领域的大师”。","注意语气：在英语中把别人称作“maestro”通常带有敬意或略带幽默的夸赞；对不熟的人使用时要看场合，避免显得过度夸张。"]}
{"word":"Maeve","summary":{"en":"an Irish female name; also the name of a legendary queen in Irish myth","zh":"爱尔兰女性名字；也指爱尔兰神话中的传奇女王之名"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name of Irish origin, now also used in other English-speaking countries","zh":"源自爱尔兰的女性名字，如今也常见于其他英语国家"},"examples":[{"en":"Maeve is starting a new job next week.","zh":"Maeve 下周要开始一份新工作。"},{"en":"How do you spell Maeve?","zh":"Maeve 怎么拼写？"}]},{"partOfSpeech":"other","definition":{"en":"the name of a legendary queen in Irish mythology, often linked to power and leadership","zh":"爱尔兰神话中的传奇女王之名，常与权力和领导力相关"},"examples":[{"en":"In Irish legend, Queen Maeve is a central figure in the epic tales of Ulster.","zh":"在爱尔兰传说中，Maeve 女王是与阿尔斯特相关史诗故事里的核心人物。"},{"en":"The novel references Maeve as a symbol of ambition.","zh":"这部小说把 Maeve 作为野心的象征来引用。"}]}],"synonyms":["Maebh","Meabh","Medb"],"phonetic":"/meɪv/","extraExplanation":["发音提示：Maeve 在英语里通常读作 /meɪv/，类似“mayv”，一个音节，结尾是清晰的 /v/。","拼写变体：在爱尔兰本土你可能更常见到 Maebh、Meabh 或 Medb（更接近传统/古老拼写）。"],"etymology":"来源于古爱尔兰语名字 Medb/Meadb（现代常写作 Maeve，也常见拼写 Maebh）。常被解释为“令人陶醉/使人醉”的含义，后来作为爱尔兰传统女性名流传并在英语世界流行。","mnemonic":["把它想成“May + v”：像“五月 May”后面加一个 /v/ 的尾音 → /meɪv/。","联想“美芙/梅芙”（常见中文音译）：看到 ae 就想到“梅(=May)”的读音。"]}

