{"word":"mafey","summary":{"en":"“mafey” is not a standard English word; it’s likely a name or a misspelling.","zh":"“mafey”不是标准英语词，可能是人名/姓氏或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (a surname or given name) or a misspelling of another word.","zh":"不是标准英语单词；最常见用法是作为人名（姓氏或名字），或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “mafey” in a dictionary—maybe it’s someone’s last name.","zh":"我在词典里找不到“mafey”——也许它是某人的姓。"},{"en":"If you meant “miffy,” that word means slightly annoyed.","zh":"如果你想写的是“miffy”，它的意思是“有点恼火的”。"}]}],"phonetic":"ˈmæfeɪ","extraExplanation":["“mafey”在主流英语词典中通常查不到，因此更可能是：\n1）人名/姓氏的拼写（例如出现在社交媒体用户名、家族姓氏中）；\n2）把其他单词拼错了。常见接近的词有：\n- miffy（英式口语）：有点不高兴/闹别扭的\n- miffed：有点被惹恼的\n- Malfeasance（mal- + feasance）：不当行为（与拼写不太像，但有人会听写错）\n如果你告诉我它出现的句子或语境（聊天、歌曲、姓名、游戏ID等），我可以帮你精确判断。"]}
{"word":"maffia","summary":{"en":"“Maffia” is a common misspelling of “mafia,” meaning an organized criminal group, or metaphorically a powerful controlling clique.","zh":"“maffia”是“mafia”的常见错拼，意为黑手党等有组织犯罪集团，也可比喻某个强势垄断的小圈子/集团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “mafia”) a secret criminal organization, especially one involved in extortion, smuggling, or organized crime.","zh":"（通常拼作“mafia”）黑手党；秘密的犯罪组织，常涉及敲诈、走私或有组织犯罪。"},"examples":[{"en":"The movie is about the Italian mafia and its influence on the city.","zh":"这部电影讲的是意大利黑手党及其对城市的影响。"},{"en":"The police arrested several members of a mafia group for extortion.","zh":"警方因敲诈罪逮捕了该黑手党团伙的几名成员。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader, informal sense: a powerful group that controls an activity or business in an unfair or secretive way (often used metaphorically).","zh":"（引申、非正式）在某个行业或活动中以不公平或隐秘方式操控、垄断的强势集团（常作比喻用法）。"},"examples":[{"en":"Some people complain about a “parking mafia” controlling the best spots.","zh":"有人抱怨有个“停车黑帮”在控制最好的车位。"},{"en":"He joked that her friends were a “coffee mafia” who judged everyone’s drink choice.","zh":"他开玩笑说她的朋友是“咖啡黑帮”，会评判每个人点什么饮品。"}]}],"synonyms":["organized crime","crime syndicate","mob","gang","cartel"],"phonetic":"/ˈmɑfiə/","extraExplanation":["“maffia”是常见的拼写错误；标准拼写是“mafia”。","“mafia”一词常与意大利西西里岛的有组织犯罪历史相关。如今在新闻、影视中常用作“黑手党”，也常被借用来比喻某个圈子或集团的强势控制。"]}
{"word":"maffias","summary":{"en":"“Mafias” (often misspelled as “maffias”) is the plural of “mafia,” meaning organized criminal groups; informally it can mean a powerful, secretive clique.","zh":"“mafias”（常被误拼为“maffias”）是“mafia”的复数，指有组织的犯罪集团；非正式地也可指有势力、较隐秘的圈子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mafia”: organized criminal groups (or, more loosely, any powerful secret group).","zh":"“mafia”的复数：有组织的犯罪集团（也可更宽泛地指有势力、较隐秘的团体）。"},"examples":[{"en":"Several mafias competed for control of the city’s illegal gambling.","zh":"多个黑手党式的犯罪集团争夺该城市非法赌博的控制权。"},{"en":"The government said the mafias were involved in drug trafficking.","zh":"政府表示这些犯罪集团参与了毒品走私。"}]},{"partOfSpeech":"n.","definition":{"en":"Used informally to describe a close-knit group that controls something unfairly (often in phrases like “the media mafia” or “the book mafia”).","zh":"非正式用法：指一个关系紧密、以不公平方式掌控某事的圈子（常见于“媒体黑手党”“书圈黑手党”等说法）。"},"examples":[{"en":"Some people jokingly call the strict parent group the “homework mafia.”","zh":"有人开玩笑把那群严格的家长称为“作业黑手党”。"}]}],"synonyms":["crime syndicates","organized crime groups","gangs","cartels (in drug contexts)","cliques (informal sense)"],"phonetic":"/ˈmɑfiə/","extraExplanation":["你输入的“maffias”通常被视为拼写错误；标准拼写是“mafias”（单数：mafia）。","“mafia”最初与意大利西西里岛的有组织犯罪有关；英语里常把它泛指各类有组织犯罪集团。大写“Mafia”有时特指意大利黑手党体系（具体取决于语境与写法）。"]}
{"word":"maffick","summary":{"en":"Maffick means to celebrate loudly and publicly, often in the streets.","zh":"maffick 指在公共场所（常在街头）喧闹兴奋地庆祝、狂欢。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to celebrate loudly and excitedly in public (often in the streets), sometimes in a slightly wild or unruly way","zh":"（常指在街头等公共场所）喧闹、兴奋地庆祝；有时带点失控或放纵的狂欢"},"examples":[{"en":"Fans mafficked in the streets after the team won the championship.","zh":"球队夺冠后，球迷在街头喧闹狂欢。"},{"en":"The city mafficked late into the night when the war ended.","zh":"战争结束时，全城一直狂欢到深夜。"}]}],"synonyms":["celebrate","rejoice","party","carouse","make merry"],"phonetic":"/ˈmæfɪk/","extraExplanation":["“maffick”是一个较少见、偏英式用法的词，来源与历史事件有关：1900年英布战争期间，南非城镇Mafeking（马费金）的围困解除，英国国内爆发街头庆祝潮，“to maffick”就用来形容那种热闹的公共狂欢。","在现代英语里它带有一点“复古/新闻报道式”的味道，不如“celebrate”“rejoice”“party in the streets”常用。"]}
{"word":"mafficked","summary":{"en":"“Mafficked” means “celebrated noisily,” a historical, old-fashioned usage.","zh":"“mafficked”指“喧闹狂欢地庆祝”，带明显历史与旧式用法色彩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle, informal, historical) celebrated very noisily and excitedly in public.","zh":"（过去式/过去分词，非正式，历史用语）在公共场合非常喧闹、热烈地庆祝。"},"examples":[{"en":"When the news arrived, crowds mafficked in the streets all night.","zh":"消息传来后，人群在街上彻夜喧闹庆祝。"},{"en":"The city mafficked after the victory was announced.","zh":"胜利宣布后，全城热烈狂欢。"}]}],"synonyms":["celebrated","rejoiced","partied","revelled","cheered"],"phonetic":"/ˈmæfɪkt/","extraExplanation":["“maffick / mafficked / mafficking”主要出现在19世纪末到20世纪初的英式英语中，源自1899–1900年第二次布尔战争期间“救援马费金（Mafeking）”的消息引发英国民众的大规模庆祝。“to maffick”后来就被用来指“喧闹狂欢”。","这是历史色彩很强、现在很少用的词；现代英语里通常用 celebrate, rejoice, party, revel, cheer 来表达类似意思。"]}
{"word":"mafficker","summary":{"en":"A rare, old-fashioned word for someone who celebrates loudly and publicly.","zh":"一个罕见的旧式词，指大声、公开地庆祝的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who celebrates noisily and enthusiastically, especially in a public or patriotic way (old-fashioned/rare).","zh":"（罕见/旧式）指喧闹、热烈庆祝的人，尤指带有公众性或爱国情绪的庆祝者。"},"examples":[{"en":"The streets filled with maffickers waving flags and cheering late into the night.","zh":"街上挤满了挥舞旗帜、欢呼到深夜的庆祝人群。"},{"en":"Newspapers described the maffickers as loud, exuberant, and impossible to ignore.","zh":"报纸形容这些庆祝者喧闹、兴高采烈，让人无法忽视。"}]}],"synonyms":["celebrant","reveler","partygoer"],"phonetic":"/ˈmæfɪkər/","extraExplanation":["“mafficker”源自动词“maffick”（狂欢、喧闹庆祝）。该词与1900年英军在南非马费金（Mafeking）围城解围后，英国民众的大规模庆祝有关，因此带有历史背景与强烈的“公众欢庆”色彩。","现代英语中很少使用，多见于历史叙述或文学/新闻旧文；日常表达更常用“celebrant / reveler / partygoer”。"]}
{"word":"mafficking","summary":{"en":"“Mafficking” is not standard; it’s likely “trafficking,” meaning illegal trading of goods or people (human trafficking).","zh":"“mafficking” 不是标准拼写；很可能是 “trafficking”，指（常为非法的）贩运货物或人口（人口贩运）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) Most likely a misspelling of “trafficking.”","zh":"（不是标准英语单词）很可能是把 “trafficking” 拼错了。"},"examples":[{"en":"I couldn’t find “mafficking” in a dictionary—did you mean “trafficking”?","zh":"我在词典里找不到 “mafficking”——你是不是想写 “trafficking”？"}]},{"partOfSpeech":"n.","definition":{"en":"the buying, selling, or transporting of goods—often used for illegal goods (e.g., drugs, weapons).","zh":"（货物的）买卖或运输；常指非法交易（如毒品、武器）。"},"examples":[{"en":"The police investigated drug trafficking.","zh":"警方调查了毒品贩运。"},{"en":"The report described weapons trafficking across the border.","zh":"报告描述了跨境武器走私/贩运。"}]},{"partOfSpeech":"n.","definition":{"en":"the illegal trade and movement of people, especially for forced labor or sexual exploitation (human trafficking).","zh":"人口贩运（尤其指以强迫劳动或性剥削为目的的非法贩卖与转运）。"},"examples":[{"en":"The organization works to stop human trafficking.","zh":"该组织致力于制止人口贩运。"},{"en":"She gave a talk about recognizing signs of trafficking.","zh":"她做了一个关于识别人口贩运迹象的讲座。"}]}],"synonyms":["illegal trade","smuggling (related)","human trafficking","drug trafficking"],"phonetic":"/ˈtræfɪkɪŋ/","extraExplanation":["“Trafficking”在新闻与法律语境中非常常见：\n- drug trafficking = 毒品贩运\n- weapons trafficking = 武器走私/贩运\n- human trafficking = 人口贩运（与“human smuggling 偷渡/协助非法入境”不同，trafficking 强调剥削与控制）。\n如果你告诉我原句（上下文），我可以帮你确认到底想表达哪一种意思。"]}
{"word":"mafficks","summary":{"en":"“Mafficks” is a rare, old-fashioned word meaning loud public celebration—especially patriotic cheering; it can be used as a verb or a noun.","zh":"“mafficks”是罕见且略旧的用法，表示在公共场合喧闹地庆祝、欢呼（常带爱国意味）；可作动词或名词。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to celebrate loudly and excitedly in public, often in a patriotic way (rare, old-fashioned)","zh":"（罕见、略旧）公开而热烈地庆祝、欢呼（常带爱国色彩）"},"examples":[{"en":"Crowds mafficked in the streets after the victory was announced.","zh":"胜利消息公布后，人群在街头热烈欢庆。"},{"en":"Newspapers described people mafficking late into the night.","zh":"报纸形容人们一直欢庆到深夜。"}]},{"partOfSpeech":"n.","definition":{"en":"loud public celebration or revelry; a bout of excited cheering (rare, old-fashioned)","zh":"（罕见、略旧）喧闹的公众庆祝；一阵热烈的欢呼"},"examples":[{"en":"There was a burst of mafficking in the town square.","zh":"镇广场上爆发出一阵热烈的欢庆。"}]}],"synonyms":["celebrate","cheer","revel","rejoice","make merry"],"phonetic":"/ˈmæfɪk/","extraExplanation":["“maffick / mafficking / mafficks”多见于19世纪末到20世纪初的英式英语。它与1899–1902年的布尔战争有关：英国在救援马菲金（Mafeking，今南非的Mahikeng）后，伦敦等地出现了大规模庆祝，人们把这种喧闹的胜利庆典称为“mafficking”。因此这个词带有明显的历史语境与英帝国时期的公共情绪色彩。","现代英语中很少使用；如果要表达“热烈庆祝”，更常用 celebrate, cheer, revel, rejoice 等。"]}
{"word":"maffioso","summary":{"en":"A maffioso is a Mafia member; it can also describe something Mafia-related.","zh":"maffioso 指黑手党成员；也可形容与黑手党有关的事物或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mafia; a person involved in organized crime, especially in an Italian-style criminal organization","zh":"黑手党成员；（尤指意大利式）有组织犯罪集团成员"},"examples":[{"en":"The film’s main character is a maffioso who wants to leave the criminal life.","zh":"这部电影的主角是一名黑手党成员，他想退出犯罪生活。"},{"en":"Police arrested several suspected maffiosi after a long investigation.","zh":"经过长期调查，警方逮捕了数名疑似黑手党成员。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Mafia or organized crime; having a Mafia-like style","zh":"与黑手党或有组织犯罪有关的；带有“黑手党式”风格的"},"examples":[{"en":"Some critics disliked the novel’s maffioso glamour.","zh":"一些评论家不喜欢小说里对黑手党式“魅力”的渲染。"},{"en":"He used maffioso language to sound tough.","zh":"他用带黑手党味的说法来显得强硬。"}]}],"synonyms":["mafioso","mafia member","mobster","gangster"],"phonetic":"/ˌmɑfiˈoʊsoʊ/","extraExplanation":["“maffioso”来自意大利语，字面意思是“黑手党的人”。英语里也常见更通用的词：mafia member 或 mobster（更口语、更泛指）。在新闻或历史语境中，这个词通常指与意大利西西里黑手党相关的人物。"]}
{"word":"maffle","summary":{"en":"“Maffle” is a Scots informal verb meaning to stammer/mumble or to fumble something awkwardly.","zh":"“maffle”是苏格兰方言里的非正式动词，表示结结巴巴/含糊地说，或手忙脚乱地把事弄糟。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots, informal) To stammer or speak in a confused, hesitant way; to mumble.","zh":"（苏格兰方言，非正式）结结巴巴地说；含糊、慌乱地表达。"},"examples":[{"en":"He started to maffle when everyone looked at him.","zh":"大家都看着他时，他开始结结巴巴地说。"},{"en":"I was so nervous I just maffled an apology.","zh":"我太紧张了，只含糊地道了个歉。"}]},{"partOfSpeech":"v.","definition":{"en":"(Scots, informal) To fumble or bungle something because you are awkward, rushed, or unsure.","zh":"（苏格兰方言，非正式）笨手笨脚地弄；手忙脚乱地搞砸。"},"examples":[{"en":"Don’t maffle the buttons—take your time.","zh":"别手忙脚乱地按按钮——慢慢来。"},{"en":"She maffled the tie and had to start again.","zh":"她手忙脚乱把领带打坏了，只好重来。"}]}],"synonyms":["stammer","mumble","fumble","bungle","splutter"],"phonetic":"/ˈmæfəl/","extraExplanation":["“maffle”主要见于苏格兰英语（Scots）或带方言色彩的写作/对话里，在美式日常英语中非常少见。更常用的对应表达有：stammer（结巴）、mumble（含糊地说）、fumble（笨手笨脚）。","它常带一点轻微的幽默或口语感，用来形容“紧张导致说不清/做不好”。"]}
{"word":"maffler","summary":{"en":"“Maffler” is usually a misspelling of “muffler”: a warm neck scarf or a vehicle part that reduces engine noise.","zh":"“maffler”通常是“muffler”的拼写错误；muffler 可指保暖的厚围巾，也可指汽车等的消声器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scarf (often woolen) worn around the neck to keep warm","zh":"（围在脖子上保暖的）围巾，厚围巾"},"examples":[{"en":"He wrapped a muffler around his neck before going out.","zh":"他出门前把厚围巾围在脖子上。"},{"en":"In winter, many commuters wear gloves and a muffler.","zh":"冬天很多通勤族会戴手套、围厚围巾。"}]},{"partOfSpeech":"n.","definition":{"en":"a device on a vehicle that reduces engine noise (also called a “silencer”)","zh":"（汽车等的）消声器，排气消音器"},"examples":[{"en":"The mechanic said the muffler was rusted and needed replacement.","zh":"修车师傅说消声器生锈了，需要更换。"},{"en":"A damaged muffler can make your car unusually loud.","zh":"消声器损坏会让车的声音异常大。"}]}],"synonyms":["scarf","neck scarf","silencer","exhaust muffler"],"phonetic":"/ˈmʌflər/","extraExplanation":["“maffler”通常不是标准英语单词；多半是把 **muffler** 拼错了（发音接近，尤其在快速输入或听写时）。","词源小提示：**muffler** 来自 “muffle”（包住/捂住、使声音变小），所以既能指“围巾”（把脖子捂住），也能指“消声器”（把噪音压下去）。"]}
{"word":"mafflin","summary":{"en":"“Mafflin” is a Scottish dialect word meaning flustered/awkward, or speaking in a mumbling, stumbling way.","zh":"“mafflin”是苏格兰方言，常指人慌乱笨拙，或说话含糊结巴、磕磕绊绊。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scotland, dialect) confused, awkward, or flustered; not sure what to do or say.","zh":"（苏格兰方言）困惑的、笨拙的、慌乱的；不知所措或不知该怎么说。"},"examples":[{"en":"I got all mafflin when the teacher asked me a question in front of the class.","zh":"老师在全班面前问我问题时，我一下子就慌乱得不知怎么回答。"},{"en":"Don’t worry—everyone feels a bit mafflin on their first day at a new job.","zh":"别担心——新工作第一天大家都会有点手足无措。"}]},{"partOfSpeech":"vi.","definition":{"en":"(From the verb “maffle,” dialect) to speak with difficulty or uncertainty; to mumble, stammer, or fumble for words.","zh":"（源自方言动词 maffle）说话不利索或没把握；含糊其词、结巴、找词找得磕磕绊绊。"},"examples":[{"en":"He started mafflin and couldn’t finish the sentence.","zh":"他开始结结巴巴，句子都说不完。"},{"en":"I was so nervous I just kept mafflin my explanation.","zh":"我太紧张了，解释的时候一直说得磕磕绊绊。"}]}],"synonyms":["flustered","muddled","tongue-tied","fumbling","stammering"],"phonetic":"/ˈmæf.lɪn/","extraExplanation":["“mafflin”主要见于苏格兰英语/苏格兰方言，用来形容人因为紧张、困惑而显得笨拙或说话不顺。它和动词“maffle”（含糊地说、结巴、笨拙地处理）有关，因此既可形容状态（adj.），也可表示动作（vi.）。","日常英语里更常用的近义表达有：flustered（慌乱的）、muddled（糊涂的）、tongue-tied（舌头打结说不出来）、fumbling for words（笨拙地找词）。"]}
{"word":"mafia","summary":{"en":"Mafia means an organized criminal group; informally, it can also mean a secretive clique that unfairly controls something.","zh":"Mafia 指有组织犯罪集团（常译“黑手党”）；非正式用法也可指暗中操控事务的小圈子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secret criminal organization (often involved in illegal business, violence, and extortion); sometimes used more generally for any powerful organized crime group","zh":"（常指）黑手党：秘密的犯罪组织（常涉及非法生意、暴力与敲诈勒索）；也可泛指任何有势力的有组织犯罪集团"},"examples":[{"en":"The film tells the story of a family connected to the mafia.","zh":"这部电影讲述了一个与黑手党有关联的家族故事。"},{"en":"He was arrested for helping the mafia launder money.","zh":"他因帮助黑手党洗钱而被捕。"},{"en":"Some newspapers use “the mafia” to mean any large organized crime network.","zh":"一些报纸会用“the mafia”泛指大型有组织犯罪网络。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a close-knit group that controls an activity or organization in an unfair or secretive way","zh":"（非正式）小圈子/帮派：在某个领域或组织中以不公平或暗中方式掌控局面的团体"},"examples":[{"en":"People complained that a small mafia controlled who got promotions.","zh":"人们抱怨有个小圈子掌控了谁能升职。"},{"en":"It’s hard to enter the industry when an old mafia guards the best jobs.","zh":"当一个老牌“小圈子”把守着最好的职位时，进入这个行业会很难。"}]}],"synonyms":["organized crime","crime syndicate","mob","gang","cartel","clique (informal)"],"phonetic":"ˈmɑfiə","extraExplanation":["“Mafia”通常与意大利西西里岛的有组织犯罪有关，英语里常用小写 mafia 表示一般意义上的犯罪组织；也常用大写 Mafia 指特定历史背景下的“黑手党”。在现代媒体与影视作品中（如《教父》The Godfather）出现频繁，但学习时要注意：它是强烈的负面词，现实语境里可能涉及犯罪、暴力与受害者，使用时应谨慎、尊重当事人和文化背景。"]}
{"word":"mafias","summary":{"en":"“Mafias” is the plural of “mafia,” meaning organized criminal groups, or figuratively, powerful cliques.","zh":"“mafias”是“mafia”的复数，可指有组织的犯罪团伙，也可比喻有影响力、排外的小圈子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “mafia”: organized criminal groups, often involved in illegal activities such as extortion, smuggling, or corruption.","zh":"“mafia”的复数：有组织的犯罪团伙，常从事敲诈、走私、贪腐等非法活动。"},"examples":[{"en":"Police arrested several members of rival mafias.","zh":"警方逮捕了几个敌对黑手党团伙的成员。"},{"en":"The report described how mafias controlled parts of the local economy.","zh":"报告描述了黑手党团伙如何控制当地经济的部分领域。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) plural of “mafia”: tightly connected groups that use influence or secrecy to protect their own interests.","zh":"（比喻）“mafia”的复数：关系紧密、靠影响力或“圈内规则”互相庇护的小团体。"},"examples":[{"en":"In the novel, different mafias compete for power inside the city government.","zh":"在那部小说里，不同的小圈子在市政府内部争夺权力。"},{"en":"Some people complain about “office mafias” that block newcomers.","zh":"有些人抱怨公司里的“小圈子”会排挤新人。"}]}],"synonyms":["criminal gangs","crime syndicates","organized crime groups","cliques","rings"],"phonetic":"/ˈmɑfiəz/","extraExplanation":["“Mafia”一词常与意大利西西里岛的有组织犯罪联系在一起，英文里既可指真实的犯罪组织，也常被引申为“内部抱团、排外的小集团”（如“academic mafia”“office mafia”），但这种用法在正式写作中要谨慎，避免过度标签化。"]}
{"word":"mafic","summary":{"en":"Mafic describes dark, magnesium- and iron-rich igneous rocks or minerals (e.g., basalt).","zh":"Mafic（镁铁质）形容富含镁和铁、通常颜色较深的火成岩或矿物（如玄武岩）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) relating to or made of igneous rocks or minerals that are rich in magnesium and iron, usually dark-colored.","zh":"（地质）指富含镁和铁的火成岩或矿物；通常颜色较深。"},"examples":[{"en":"Basalt is a common mafic volcanic rock.","zh":"玄武岩是一种常见的镁铁质火山岩。"},{"en":"Mafic minerals like olivine and pyroxene often appear dark green to black.","zh":"橄榄石和辉石等镁铁质矿物常呈深绿到黑色。"},{"en":"Compared with felsic rocks, mafic rocks generally have lower silica content.","zh":"与长英质岩石相比，镁铁质岩石通常二氧化硅含量更低。"}]}],"synonyms":["magnesium- and iron-rich","ferromagnesian","basic (geology)"],"phonetic":"/ˈmæfɪk/","extraExplanation":["“mafic”是由“magnesium（镁）”和“ferric（含铁的）”组合而来（ma- + -fic），用来概括成分特征。","地质学里常与“felsic（长英质）”对比：felsic多为浅色、富硅（如花岗岩）；mafic多为深色、富镁铁（如玄武岩、辉长岩）。"]}
{"word":"mafiosi","summary":{"en":"Mafiosi are members of the Mafia; it’s the plural of mafioso.","zh":"mafiosi 指黑手党成员；是 mafioso 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Members of the Mafia (an organized crime group, especially in Italy or among Italian-American communities).","zh":"黑手党成员；（尤指意大利或意裔美国社群中的）黑帮成员。"},"examples":[{"en":"The movie follows two mafiosi who try to leave the criminal life behind.","zh":"这部电影讲的是两名黑手党成员试图金盆洗手、远离犯罪生活。"},{"en":"Police arrested several suspected mafiosi after a long investigation.","zh":"经过长期调查，警方逮捕了多名疑似黑手党成员。"}]}],"synonyms":["gangsters","mobsters","Mafia members"],"phonetic":"/ˌmɑːfiˈoʊzi/","extraExplanation":["“mafiosi”是意大利语复数形式，单数是“mafioso”（一个黑手党成员）。英语里也常把“mafioso”当作泛指“黑帮分子/黑社会成员”，但严格来说它和意大利“黑手党（Mafia）”相关。","使用时要注意语境：它通常出现在新闻报道、历史/犯罪题材作品或讨论有组织犯罪时；在日常对话里随意用来指某个族群或个人，可能带有刻板印象或冒犯意味。"]}
{"word":"mafioso","summary":{"en":"A mafioso is a Mafia member; it can also describe Mafia-like or gangster-style behavior.","zh":"mafioso 指黑手党成员；也可形容带有黑手党/黑帮风格的行为或作风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mafia (an Italian organized-crime group), or someone who acts like a Mafia member","zh":"黑手党成员；（引申）行为或作风像黑手党的人"},"examples":[{"en":"The movie follows a mafioso trying to leave the criminal life behind.","zh":"这部电影讲述了一名黑手党成员试图告别犯罪生活的故事。"},{"en":"He liked to pose like a mafioso, wearing dark suits and speaking in threats.","zh":"他喜欢摆出黑手党那种派头，穿深色西装、说话带威胁。"}]},{"partOfSpeech":"adj.","definition":{"en":"connected with or typical of the Mafia; gangster-like","zh":"与黑手党有关的；带有黑帮/黑手党风格的"},"examples":[{"en":"The report described a mafioso network of corruption in the city.","zh":"报告描述了该市一个带有黑手党性质的腐败网络。"},{"en":"They used mafioso tactics to intimidate competitors.","zh":"他们用黑帮式手段恐吓竞争对手。"}]}],"synonyms":["Mafia member","gangster","mobster"],"phonetic":"/ˌmɑːfiˈoʊsoʊ/","extraExplanation":["“mafioso”来自意大利语，单数指“黑手党成员”，复数常见为“mafiosi”。英语里既可直指意大利黑手党，也常被泛化用于形容“黑帮式、恐吓勒索式”的作风。","在新闻与学术语境中，描述现实犯罪组织时用词要谨慎：并非所有意大利裔社群都与黑手党有关；将该词随意贴在族裔或社区身上可能带来刻板印象。"]}
{"word":"mafoo","summary":{"en":"“Mafoo” isn’t a common English dictionary word; it’s usually a made-up name or placeholder, so the meaning depends on where you saw it.","zh":"“mafoo”不是常见的英语词典词；多为自造名字或占位符，含义取决于出现的语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often seen as a made-up name, a username, or playful nonsense text. Meaning depends on context.","zh":"不是标准英语词；常见于自造名字、网名或玩笑式的“无意义文本”。具体含义取决于语境。"},"examples":[{"en":"My gamer tag is Mafoo.","zh":"我的游戏昵称是 Mafoo。"},{"en":"He typed “mafoo” as a placeholder because he didn’t know what to write.","zh":"他因为不知道写什么，就用“mafoo”当作占位符。"}]}],"synonyms":["placeholder","made-up word","nonsense word","username"],"phonetic":"/məˈfuː/","extraExplanation":["“mafoo”更像是拼写出来的“声音感”词（类似随口编的词），在英语里没有稳定、通用的词典义。","如果你是在某个视频、游戏、歌曲或社交媒体里看到它，它可能是人名/角色名/账号名，或是某个小圈子里的梗。给我一句原句或链接语境，我可以帮你判断它在那个语境中的意思。","也有可能是拼写误差：例如你想查的是某个相近拼写的词（请告诉我你原本想表达的意思或发音）。"]}
{"word":"maftir","summary":{"en":"Maftir refers to either the person who reads the final Torah portion (often also the Haftarah) or the final Torah portion itself.","zh":"Maftir 可指诵读《妥拉》最后一段（常也诵读《哈夫塔拉》）的人，也可指这段最后的《妥拉》读经本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) The person who is called up to read the final part of the weekly Torah reading and usually to chant the Haftarah afterward.","zh":"（犹太教）在会堂礼拜中被召上台诵读每周《妥拉》读经最后一段的人，通常也会接着诵唱《哈夫塔拉》（先知书选段）。"},"examples":[{"en":"He was honored as the maftir at his bar mitzvah service.","zh":"在他的成人礼礼拜中，他获得了担任 maftir 的荣誉。"},{"en":"The rabbi explained that the maftir often reads the Haftarah after finishing the last Torah verses.","zh":"拉比解释说，maftir 往往在读完《妥拉》最后几节后还会诵读《哈夫塔拉》。"}]},{"partOfSpeech":"n.","definition":{"en":"(Judaism) The final portion (a short set of verses) read from the Torah at a service, after the main Torah reading.","zh":"（犹太教）礼拜中在主要《妥拉》读经之后所诵读的最后一小段经文（maftir 读段）。"},"examples":[{"en":"Today’s maftir was only a few verses long.","zh":"今天的 maftir 只有短短几节经文。"},{"en":"On holidays, the maftir is often related to the special theme of the day.","zh":"在节日里，maftir 往往与当天的特殊主题有关。"}]}],"synonyms":["haftarah reader (contextual)","final Torah portion (descriptive)"],"phonetic":"/ˈmɑːftər/","extraExplanation":["“Maftir”源自希伯来语，和“结束/完成”的含义相关。在许多会堂礼仪中，maftir 读段通常用于“连接”《妥拉》读经与随后《哈夫塔拉》的诵读，因此担任 maftir 常被视为一种荣誉（例如成人礼 Bar/Bat Mitzvah）。","不同传统（如阿什肯纳兹、塞法迪等）在旋律与细节安排上可能略有差异，但“最后一段妥拉读经 + 常伴随哈夫塔拉”的核心用法很常见。"]}
{"word":"maftirs","summary":{"en":"“Maftir” is a Jewish liturgical term for the final Torah reader, often connected with reading the Haftarah.","zh":"“Maftir” 是犹太礼拜用语，指进行妥拉最后一段诵读的人，常与诵读《哈夫塔拉》相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) A person called up for the final Torah reading of the service, who then reads (or introduces) the Haftarah.","zh":"（犹太教）在礼拜中被叫上台进行《妥拉》最后一段诵读的人，随后诵读（或引出）《哈夫塔拉》（先知书选读）。"},"examples":[{"en":"In many synagogues, the maftir also reads the Haftarah.","zh":"在许多会堂里，maftir 也会诵读《哈夫塔拉》。"},{"en":"He was honored with maftir for his bar mitzvah.","zh":"在他的成人礼（bar mitzvah）上，他获得了担任 maftir 的荣誉。"}]}],"synonyms":["(no direct synonym in common English)"],"phonetic":"/mɑfˈtɪr/","extraExplanation":["“maftirs”常见于英语里作为复数用法，通常更标准的拼写是 **maftirim**（希伯来语复数），但在一般英语写作中也会用 **maftirs**。","发音与拼写提示：你输入的 **maftirs** 很可能是指 **maftir**（单数）+ -s（复数）。","相关词：**aliyah**（被叫上台诵读妥拉的“上台”/荣誉）、**Haftarah**（先知书选读）。"]}
{"word":"mafura","summary":{"en":"Mafura means oil or fat (grease), used especially in some East and Southern African contexts.","zh":"mafura 指“油/脂肪（油脂、油污）”，多见于部分东非和南部非洲语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(East & Southern African English, from Bantu languages) cooking oil or fat; grease.","zh":"（东非/南部非洲英语用法，源自班图语）食用油或脂肪；油脂、油垢。"},"examples":[{"en":"Add a little mafura to the pan so the onions don’t stick.","zh":"锅里加一点mafura（食用油），这样洋葱就不会粘锅。"},{"en":"The mechanic wiped the mafura off his hands.","zh":"修车工把手上的mafura（油污）擦掉了。"}]}],"synonyms":["oil","fat","grease","cooking oil"],"phonetic":"/məˈfʊrə/","extraExplanation":["“mafura”常见于一些班图语（如绍纳语等）里，基本意思是“油/脂肪”。在部分地区的英语口语中也会直接借用来指食用油、动物油或机油油污等。","词首的“ma-”在多种班图语中常与复数/集合概念有关，所以它常带有“油脂这一类东西（总称）”的感觉。"]}
{"word":"mafurra","summary":{"en":"“Mafurra” is usually a nonstandard spelling of “mafura,” the mafura tree or the oil/butter made from its seeds in southern Africa.","zh":"“mafurra”通常是“mafura”的非标准拼写，指马富拉树或其种子榨取的油脂（常见于非洲南部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of “mafura,” referring to the mafura tree (Trichilia emetica) or the vegetable fat/oil (“mafura butter”) made from its seeds, used especially in southern Africa for cooking, soap, and skincare.","zh":"“mafura”的一种拼写变体，指马富拉树（Trichilia emetica，常见于非洲南部）或由其种子榨取的植物油脂（“mafura 黄油/脂”），常用于烹饪、制皂和护肤。"},"examples":[{"en":"In some regional writing, “mafurra” is used to mean mafura oil used for soap-making.","zh":"在一些地区性的文字中，“mafurra”用来指制皂用的 mafura 油脂。"},{"en":"The community collects seeds from the mafura tree to press a thick butter-like fat.","zh":"社区会收集马富拉树的种子来压榨出一种像黄油一样浓稠的油脂。"}]}],"synonyms":["mafura"],"phonetic":"/məˈfʊrə/","extraExplanation":["“mafurra”并不是常见的标准英语拼写；更常见的是“mafura”。在英语材料里它多出现在民族植物学（ethnobotany）、非洲地区产品介绍或地方性记述中。","如果你是在某篇文章/歌词/人名或地名里看到“mafurra”，它也可能是专有名词（人名、地名、品牌名等）。你可以把原句发来，我可以帮你判断具体意思。"]}
