{"word":"maha","summary":{"en":"“Maha” most commonly means “great/grand” in South Asian-derived terms (e.g., Mahayana, Maharaja). It can also be an acronym “MAHA,” often “Make America Healthy Again.”","zh":"“Maha”最常见含义是源自南亚语系的“伟大/宏大”，常见于词语或专名中（如 Mahayana, Maharaja）。它也可作缩写“MAHA”，常指“Make America Healthy Again（让美国再次健康）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Sanskrit/Pali) great; grand; major—often used as a title or prefix in South Asian names and religious terms.","zh":"（源自梵语/巴利语）“伟大的；宏大的；重要的”——常作前缀或头衔，用于南亚人名与宗教术语中。"},"examples":[{"en":"The term “Maha” in “Maharaja” means “great,” so “Maharaja” means “great king.”","zh":"“Maharaja（摩诃罗阇）”里的 “Maha” 表示“伟大”，所以 “Maharaja” 意为“伟大的国王/大王”。"},{"en":"In Buddhism, “Mahayana” literally means “the Great Vehicle.”","zh":"在佛教中，“Mahayana（大乘）”字面意思是“伟大的乘（大车）”。"}]},{"partOfSpeech":"n.","definition":{"en":"an acronym used in U.S. political/media contexts, often meaning “Make America Healthy Again.”","zh":"在美国政治/媒体语境中使用的缩写，常指 “Make America Healthy Again（让美国再次健康）”。"},"examples":[{"en":"Some commentators described the proposal as part of the “MAHA” agenda.","zh":"一些评论员把该提案称为“MAHA”议程的一部分。"},{"en":"The “MAHA” slogan appeared on signs at the event.","zh":"活动现场的标语牌上出现了“MAHA”口号。"}]}],"synonyms":["great","grand","major"],"phonetic":"/ˈmɑːhɑː/","extraExplanation":["“maha- / 摩诃-”在很多来自印度次大陆的借词里都能看到（如 Mahatma“圣雄/伟大之魂”、Mahayana“大乘”）。在英语里它多作为外来语成分出现，而不是日常可自由使用的形容词。","书写上：作为外来语成分常写作 Maha-（首字母大写，尤其在专有名词中）；作为美国政治口号缩写时通常全大写 MAHA。"]}
{"word":"mahajan","summary":{"en":"Mahajan is commonly an Indian surname; in South Asian contexts it can also mean a merchant or traditional moneylender/banker.","zh":"Mahajan 常见作印度姓氏；在南亚语境中也可指商人或传统放贷者/钱庄老板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common Indian surname (family name), especially among Punjabi and some other North Indian communities","zh":"常见的印度姓氏（家族姓），在旁遮普及印度北部一些社群中较常见"},"examples":[{"en":"Ms. Mahajan will lead today’s meeting.","zh":"Mahajan 女士将主持今天的会议。"},{"en":"I met Dr. Mahajan at the conference.","zh":"我在会议上见到了 Mahajan 医生。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia) a wealthy merchant, trader, or traditional moneylender/banker; sometimes used for a respected community leader in business contexts","zh":"（南亚）富有的商人、贸易者，或传统的放贷者/钱庄老板；有时也指商界中受尊敬的头面人物"},"examples":[{"en":"In some villages, the mahajan used to lend money to farmers.","zh":"在一些村庄里，mahajan 过去常向农民放贷。"},{"en":"The shopkeepers asked the mahajan for credit.","zh":"店主们向那位 mahajan 请求赊账/信用借款。"}]}],"synonyms":["merchant","trader","moneylender","banker"],"phonetic":"/məˈhɑːdʒən/","extraExplanation":["“Mahajan”一词在印度语境里既可能是姓氏，也可能是普通名词。作为普通名词时，常见于印度社会与经济史的描述，带有“商人/放贷者/钱庄老板”的传统意味；在现代语境中使用时，可能会涉及阶层与债务关系等敏感话题，需注意语气与场合。"]}
{"word":"mahajun","summary":{"en":"“Mahajun” is usually a misspelling of “mahjong,” a Chinese tile game played by matching sets.","zh":"“mahajun”通常是“mahjong（麻将）”的误拼，指一种通过配牌成组进行的中国牌砖游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese tile-based game (commonly spelled “mahjong”) played by 4 people, involving drawing and discarding tiles to form matching sets","zh":"一种中国的牌（牌砖）类游戏（更常见拼写为“mahjong/mahjongg”），通常4人玩，通过摸牌、打牌组成配套的牌型"},"examples":[{"en":"My grandparents play mahjong every weekend.","zh":"我爷爷奶奶每个周末都会打麻将。"},{"en":"Do you know the rules of mahjong?","zh":"你知道麻将的规则吗？"},{"en":"We stayed up late playing mahjong during the holiday.","zh":"假期里我们熬夜打麻将。"}]}],"synonyms":["mahjong","mahjongg"],"phonetic":"/ˈmɑːdʒɑːŋ/","extraExplanation":["“mahajun”通常是对“mahjong（麻将）”的误拼或不常见转写。英语里最常见的拼写是 mahjong（也有人写 mahjongg）。","英语里的 mahjong 一词来自中文“麻将”的早期转写，具体拼写在不同地区与年代会有差异。","在英语语境中，mahjong 既可指“麻将这项游戏”，也可泛指“麻将牌（tiles）”；若要强调“麻将牌”，可以说 mahjong tiles。"]}
{"word":"mahal","summary":{"en":"Mahal is a non-standard English loanword: in Tagalog it means “expensive” or “dear/beloved,” and in South Asian names it can mean a “palace/grand building.”","zh":"Mahal 不是标准英语词，但常见于多语场景：在他加禄语里可表示“昂贵”或“亲爱的/挚爱”，在南亚的名称中也可指“宫殿/宏伟建筑”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Tagalog, often used in English in Filipino communities) expensive; costly.","zh":"（他加禄语；在海外菲律宾社群的英语里也常见）昂贵的；价格高的。"},"examples":[{"en":"This mango is mahal, so I’ll just buy one.","zh":"这个芒果很mahal（很贵），所以我只买一个。"},{"en":"Eating out is so mahal these days.","zh":"现在外食真是太贵（mahal）了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Tagalog, used as a term of endearment) dear; beloved; my love.","zh":"（他加禄语；常作昵称/爱称）亲爱的；挚爱；我的爱人。"},"examples":[{"en":"In her message she wrote, “Good night, mahal.”","zh":"她在信息里写道：“晚安，mahal（亲爱的）。”"},{"en":"He calls his wife “mahal” when speaking Tagalog.","zh":"他说他加禄语时，会叫妻子“mahal（亲爱的）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asian usage, seen in place/building names) a palace, grand house, or impressive building.","zh":"（南亚用法；常见于地名/建筑名）宫殿；大宅；宏伟建筑。"},"examples":[{"en":"The word appears in names of historic buildings, such as the Taj Mahal.","zh":"这个词常出现在历史建筑的名称里，比如 Taj Mahal（泰姬陵）。"},{"en":"Some old city maps label certain mansions as a “mahal.”","zh":"一些旧城市地图会把某些大宅标注为“mahal”。"}]}],"synonyms":["expensive","costly","dear","beloved","my love","palace","mansion"],"phonetic":"/məˈhɑl/","extraExplanation":["“mahal”并不是标准英语词汇，但在多语环境里很常见：\n- 在菲律宾语境中，它来自他加禄语：既可以表示“贵”，也可以表示“爱/亲爱的”。具体含义通常靠上下文判断（谈价格=贵；对人说话=亲爱的）。\n- 在南亚语境中，“-mahal”常出现在建筑或地名里，和“宫殿/宏伟建筑”的概念相关；最广为人知的例子是 Taj Mahal。"]}
{"word":"mahala","summary":{"en":"Mahala means a neighborhood or district, sometimes with a negative sense of a poor, run-down area (especially in Balkan contexts).","zh":"Mahala 指“社区/街区”，在部分巴尔干语境中也可能带贬义，指贫困破败的地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a neighborhood or district; in some Balkan contexts, it can also mean a poor or run-down area (a slum-like neighborhood).","zh":"（街区、）社区、城区；在部分巴尔干语境中也可指贫困或破败的地区（类似“贫民区”）。"},"examples":[{"en":"She grew up in a small mahala on the edge of the city.","zh":"她在城市边缘的一个小社区长大。"},{"en":"In older stories, the mahala is where working families live and neighbors know each other well.","zh":"在一些较老的故事里，“mahala”是工薪家庭居住、邻里关系很熟的地方。"},{"en":"Some people use mahala negatively to describe a rough, neglected neighborhood.","zh":"有些人会带贬义地用“mahala”来形容治安差、被忽视的破败社区。"}]}],"synonyms":["neighborhood","district","quarter","slum (sometimes)"],"phonetic":"/məˈhɑːlə/","extraExplanation":["“mahala”常见于东南欧/巴尔干语言与英语转写中，来源多与阿拉伯语/土耳其语影响有关（常追溯到阿拉伯语 *mahalla* “街区、住区”）。在不同国家与语境里，它既可以是中性地指“社区/街坊”，也可能带有“贫困、破旧”的负面含义，使用时要注意语气与背景。"]}
{"word":"mahalamat","summary":{"en":"An affectionate slang way to say “thank you, my love/dear,” blending *mahal* + *salamat*.","zh":"把 *mahal*（亲爱的/爱）+ *salamat*（谢谢）混合起来的亲昵俚语：相当于“谢谢你，亲爱的/我的爱”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Informal, Filipino/Taglish internet slang) A playful blend of Tagalog *mahal* (“love/dear”) + *salamat* (“thank you”), meaning “thank you, my love / thanks, dear,” used to sound extra affectionate.","zh":"（非正式，菲律宾语/塔加洛语与英语混用的网络俚语）把塔加洛语 *mahal*（“亲爱的/爱”）和 *salamat*（“谢谢”）拼在一起的玩笑式说法，意思是“谢谢你，亲爱的/谢谢你，我的爱人”，用来表达更亲昵的感谢。"},"examples":[{"en":"Mahalamat for the ride home!","zh":"谢谢你送我回家呀，亲爱的！"},{"en":"Mahalamat, babe—really appreciate it.","zh":"亲爱的谢谢你——我真的很感激。"}]}],"synonyms":["salamat","thank you","thanks","thanks, dear"],"phonetic":"/ˌmɑhɑˈlɑmɑt/","extraExplanation":["这不是标准英语单词，也不是规范的塔加洛语拼写，更像是社交媒体/聊天中的“可爱说法（cute slang）”。正式场合更常用 *Salamat*（谢谢）或英语 *Thank you*。","*Mahal* 在塔加洛语里还可以表示“贵的/昂贵的”，但在这种说法里通常取“亲爱的/爱”的意思。"]}
{"word":"mahaleb","summary":{"en":"Mahaleb is a fragrant spice made from ground kernels of the mahaleb cherry, used mainly in Mediterranean and Middle Eastern baking.","zh":"Mahaleb 是由马哈勒布樱桃的种仁磨成的芳香香料，主要用于地中海与中东地区的烘焙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spice made by grinding the kernels (seeds) of the mahaleb cherry, used especially in Middle Eastern, Greek, and Turkish baking for a sweet, almond-like aroma.","zh":"由马哈勒布樱桃（mahaleb cherry）的种仁（核内的籽）磨成的香料，常用于中东、希腊和土耳其烘焙，带有类似杏仁的甜香。"},"examples":[{"en":"This Easter bread gets its distinctive fragrance from a pinch of mahaleb.","zh":"这种复活节面包加一小撮 mahaleb 就会有很特别的香气。"},{"en":"If you can’t find mahaleb, try a small amount of almond extract as a rough substitute.","zh":"如果买不到 mahaleb，可以少量用杏仁香精作大致替代。"}]},{"partOfSpeech":"n.","definition":{"en":"the mahaleb cherry tree (Prunus mahaleb), whose kernels are used to make the spice.","zh":"马哈勒布樱桃树（学名 Prunus mahaleb）；其种仁可用来制作同名香料。"},"examples":[{"en":"Mahaleb grows in parts of the Mediterranean region.","zh":"mahaleb 在地中海部分地区生长。"}]}],"synonyms":["mahlep","mahleb","mahlab","mahleb spice"],"phonetic":"/ˌmɑːhəˈlɛb/","extraExplanation":["拼写也常见为 **mahlep / mahlep / mahlab**，在不同语言与地区的转写会有差异。","风味常被描述为“杏仁 + 樱桃核仁”的香气，适合甜面包、饼干与节庆糕点（如希腊的 tsoureki、部分土耳其点心等）。","词源多与阿拉伯语及地中海地区语言的借词/转写有关，因此读音与拼写在英语里并不完全统一。"]}
{"word":"mahalla","summary":{"en":"A mahalla is a neighborhood community unit (especially in Central Asia), often with strong social ties and some local self-organization.","zh":"Mahalla 指（尤其在中亚）具有紧密邻里关系并带一定自治/互助功能的社区街区单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Central Asia and some Muslim-majority regions) a local neighborhood or community unit, often centered around shared social life and informal self-governance.","zh":"（中亚及部分穆斯林地区）“社区/街区”基层单位，常以邻里关系为核心，并带有一定的社区自治与互助功能。"},"examples":[{"en":"In Uzbekistan, the mahalla often organizes local celebrations and helps families in need.","zh":"在乌兹别克斯坦，mahalla 常会组织社区庆祝活动，并帮助有需要的家庭。"},{"en":"She grew up in a close-knit mahalla where everyone knew each other.","zh":"她在一个关系紧密的 mahalla 长大，邻里之间彼此都很熟悉。"}]}],"synonyms":["neighborhood","district","quarter","community"],"phonetic":"/məˈhɑːlə/","extraExplanation":["“Mahalla”（也拼作 mahalla/mahalla）源自阿拉伯语词根，意思接近“居住地/街区”。在乌兹别克斯坦、塔吉克斯坦等地，它不仅是地理上的“邻里”，也常指一种社会组织：社区长者或委员会会协调邻里事务、调解纠纷、组织节日、提供互助支持。","在英语文章里，mahalla 往往作为文化专有名词保留原词，不直接翻成 neighborhood，因为它包含更强的社区制度与社会功能色彩。"]}
{"word":"mahaly","summary":{"en":"“Mahaly” is usually a name, not a common English vocabulary word.","zh":"“Mahaly”通常是人名，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Not a standard English word. It is most often used as a personal name (a variant spelling of names like “Mahali/Mahaly”), so its meaning depends on the person or cultural background.","zh":"不是标准英语词汇。它更常见于人名（可能是“Mahali/Mahaly”等的变体拼写），具体含义取决于个人或文化背景。"},"examples":[{"en":"Mahaly is my classmate; she’s from Brazil.","zh":"Mahaly 是我的同学；她来自巴西。"},{"en":"I’m not sure how to spell it—Mahaly or Mahali?","zh":"我不确定怎么拼——Mahaly 还是 Mahali？"}]}],"synonyms":["(proper name)"],"phonetic":"/məˈhɑːli/","extraExplanation":["“Mahaly”在英语词典中一般查不到，常见情况是：①人名/姓氏的拼写变体；②把其他词拼错了。你可能想输入：\n- **mahali**（在斯瓦希里语中常见，意思是“地方/位置”或“价格/费用”，语境不同含义不同）\n- **mahal**（在他加禄语/马来语中可表示“爱/亲爱的”或“昂贵的”，但这不是英语词）\n如果你告诉我它出现的句子或是哪种语言/名字来源，我可以更准确解释。"]}
{"word":"mahant","summary":{"en":"A mahant is the head priest or leader of a Hindu monastery/temple community, especially in India.","zh":"mahant 指（尤在印度）印度教寺院或寺庙团体的主持/领袖，类似“住持/方丈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In South Asian (especially Indian) contexts, the head or chief priest of a Hindu monastery or temple community (a religious leader, similar in role to an abbot).","zh":"（南亚，尤指印度语境）印度教寺院或寺庙团体的负责人/主持僧（宗教领袖，角色近似“方丈/住持”）。"},"examples":[{"en":"The mahant welcomed the pilgrims and led the morning prayers.","zh":"这位 mahant（住持）迎接朝圣者并带领大家做晨祷。"},{"en":"Local officials met with the mahant to discuss the festival arrangements.","zh":"地方官员与 mahant 会面，商讨节庆活动的安排。"},{"en":"After years of service, he was appointed mahant of the monastery.","zh":"多年服务后，他被任命为该寺院的 mahant（主持）。"}]}],"synonyms":["abbot","superior","head priest","monastic leader"],"phonetic":"/məˈhɑːnt/","extraExplanation":["mahant 常见于英语对印度宗教制度的介绍或新闻报道中，属于文化特定词汇；在印度教语境里多指“寺院/修行机构（matha）”的领导者，而不等同于佛教体系的称谓。","词源来自印地语/梵语传统用法，含义与“宗教导师、主持者”相关；翻译时可根据场景译为“住持、方丈、寺院主持、寺院领袖”等。"]}
{"word":"mahar","summary":{"en":"Mahar is a marriage gift from the groom to the bride in Islamic-related traditions (also called mahr).","zh":"Mahar 指伊斯兰相关传统中“新郎给新娘的婚姻赠与/聘礼”（也称 mahr）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Islamic and some South Asian/Indonesian contexts) a required marriage gift from the groom to the bride, agreed at the time of marriage; also called mahr.","zh":"（伊斯兰及部分南亚/印尼语境）新郎在婚姻中必须给新娘的“聘礼/婚姻赠与”，通常在结婚时约定；也称 mahr（ مهر ）。"},"examples":[{"en":"In their marriage contract, the mahar was set at a specific amount of money.","zh":"在他们的婚约中，mahar（婚姻赠与）被定为一笔明确的金额。"},{"en":"She chose to receive part of her mahar immediately and the rest later.","zh":"她选择先领取一部分 mahar，其余部分以后再给。"},{"en":"The imam explained that the mahar belongs to the bride, not her family.","zh":"伊玛目解释说，mahar 属于新娘本人，而不是她的家庭。"}]}],"synonyms":["mahr","bridal gift","dower (context-dependent)"],"phonetic":"/ˈmɑhɑr/","extraExplanation":["“mahar/mahr”常被粗略翻成“dowry（嫁妆）”，但两者方向不同：dowry 在许多文化中是女方家庭给男方/男方家庭；而 mahar 是男方给女方，并且原则上归新娘个人所有。","不同地区对 mahar 的形式很灵活：可以是金钱、首饰、财物，甚至是某种承诺（如完成学习、提供住房等），但具体做法取决于当地法律、宗教解释与家庭习俗。"]}
{"word":"maharaj","summary":{"en":"Maharaj is a South Asian title meaning “great king,” used for a ruler or as a respectful form of address; less commonly, it can also be used for a revered religious teacher.","zh":"Maharaj 是南亚语境中的尊称，意为“伟大君主/大王”，可指统治者或作敬称；较少情况下也可用作对宗教导师的尊称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Hindu or South Asian royal title meaning “great king,” often used for an Indian prince or ruler; also used as a respectful form of address for such a person.","zh":"（南亚，尤指印度）“大王/伟大君主”的王室头衔，常指印度的王公或统治者；也可作对其的尊称。"},"examples":[{"en":"The museum has portraits of a maharaj and his family from the 1800s.","zh":"博物馆里有一位19世纪印度王公（maharaj）及其家人的肖像。"},{"en":"Locals referred to him as the maharaj, a title of great respect.","zh":"当地人称他为 maharaj，这是一个非常尊敬的称号。"}]},{"partOfSpeech":"n.","definition":{"en":"a respectful address for a religious leader or teacher in some South Asian communities (less common in general English).","zh":"（较不常见）在部分南亚社群中，对宗教领袖或导师的敬称。"},"examples":[{"en":"Followers greeted the teacher as Maharaj during the gathering.","zh":"在集会中，追随者以 Maharaj 来称呼那位导师。"}]}],"synonyms":["maharaja","rajah","king","ruler","prince"],"phonetic":"/ˌmɑːhəˈrɑːdʒ/","extraExplanation":["“Maharaj”常见于北印度语言（如印地语）环境中，可理解为“maharaja”的缩略/变体拼写；正式英语里更常见的拼写是 “maharaja”。","词源上与梵语有关：maha-（伟大）+ raja（国王）。在历史语境中多指印度诸邦的统治者或王公。现代也可能作为尊称或姓氏出现，具体含义取决于语境。"]}
{"word":"maharaja","summary":{"en":"A maharaja is an Indian royal title meaning a great king, and it can also mean a very wealthy/powerful person in a humorous or figurative way.","zh":"maharaja 指印度的“大君/王公”等高阶君主称号；也可引申为（带幽默或比喻）非常富有或有权势的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Hindu (especially Indian) king or prince, especially one ruling a large region; a title of high rank.","zh":"（尤指印度的）大君、王公；统治大片地区的君主的尊号（地位很高）。"},"examples":[{"en":"The museum has a portrait of a maharaja wearing jeweled robes.","zh":"博物馆里有一幅大君穿着镶宝石长袍的肖像。"},{"en":"In the novel, the maharaja invites the travelers to his palace.","zh":"小说里，大君邀请旅人去他的宫殿。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is extremely wealthy or powerful (often used humorously or metaphorically).","zh":"（常带幽默或比喻）巨富/大佬般的人物；财力或权势极大的人。"},"examples":[{"en":"He spends like a maharaja when he travels.","zh":"他旅行时花钱像个大君一样大手大脚。"},{"en":"She isn’t a tech maharaja—she just runs a small startup.","zh":"她不是什么科技大佬——只是经营一家小型创业公司。"}]}],"synonyms":["Indian prince","monarch","sovereign","tycoon","magnate"],"phonetic":"ˌmɑːhəˈrɑːdʒə","extraExplanation":["词源来自梵语 *mahārāja*：*mahā-* 表示“伟大”，*rāja* 表示“国王”。英语里常用来指历史上的印度诸邦君主（多见于殖民时期或历史语境）。","文化语境：在现代印度，“Maharaja”更多作为历史称号、文化形象或品牌名称出现；也常出现在旅行文学、历史小说和影视作品中，用来营造“王宫、奢华、仪式感”的氛围。"]}
{"word":"maharajah","summary":{"en":"A maharajah is a historical Indian king or ruler; figuratively, it can mean a very powerful or wealthy person.","zh":"maharajah 指（历史上的）印度大君/国王；引申义可指很有权势或非常富有的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (historical) Indian ruler or king, especially in the period when India was made up of many princely states.","zh":"（历史用语）印度的统治者或国王，尤指印度由许多土邦（诸侯邦）组成的时期。"},"examples":[{"en":"The museum displayed portraits of a maharajah and his court.","zh":"博物馆展出了印度大君及其宫廷的肖像。"},{"en":"Stories often describe a maharajah living in great wealth and splendor.","zh":"故事里常描写印度大君生活奢华、富丽堂皇。"}]},{"partOfSpeech":"n.","definition":{"en":"A very wealthy, powerful, or influential person (used figuratively, often in journalism or casual speech).","zh":"（比喻用法）极其富有、有权势或有影响力的人（常见于新闻或口语）。"},"examples":[{"en":"He became a real tech maharajah in the city.","zh":"他成了这座城市里真正的科技大亨。"},{"en":"The article criticized a few media maharajahs for shaping public opinion.","zh":"文章批评少数媒体大亨左右舆论。"}]}],"synonyms":["maharaja","prince","ruler","monarch","tycoon (figurative)"],"phonetic":"/ˌmɑːhəˈrɑːdʒə/","extraExplanation":["“maharajah”也常拼作“maharaja”，来自梵语：mahā（伟大）+ rāja（国王）。英语里是借词，通常指殖民时期及之前印度各土邦的统治者。","女性形式有时写作“maharani”（印度王后/女统治者）。在现代语境中，用来比喻“大亨”时可能带一点夸张或调侃的色彩，正式写作时需注意语境是否合适。"]}
{"word":"maharajahs","summary":{"en":"“Maharajahs” means Indian kings or princes (plural of maharajah), and it can also be used figuratively for people living in great luxury.","zh":"“maharajahs”指印度的大君/王公（maharajah 的复数），也可比喻极其富贵、生活奢华的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a king or prince in India (plural of “maharajah”); a very powerful ruler, especially in the past.","zh":"（印度的）大君、王公；（尤指旧时）权势很大的统治者（“maharajah”的复数）。"},"examples":[{"en":"The museum displayed jewels that once belonged to the maharajahs of Rajasthan.","zh":"博物馆展出了曾属于拉贾斯坦诸位大君的珠宝。"},{"en":"In old travel writing, maharajahs are often described as ruling grand palaces and courts.","zh":"在早期游记中，大君常被描写为统治着宏伟的宫殿与王廷。"}]},{"partOfSpeech":"n.","definition":{"en":"people who live extremely luxuriously or seem to have royal-level wealth (figurative).","zh":"（比喻）生活极其奢华的人；富得像王公一样的人。"},"examples":[{"en":"They’re not maharajahs, but they do spend freely on vacations and restaurants.","zh":"他们谈不上“像大君一样富”，但确实在度假和餐馆上花钱很大方。"}]}],"synonyms":["maharajas","princes","kings","rulers"],"phonetic":"/ˌmɑːhəˈrɑːdʒəz/","extraExplanation":["“Maharajah/maharaja”来自梵语，字面意思是“伟大的国王”。在英语里多用来指英属印度时期或更早的诸侯统治者。","拼写上也常见变体：maharaja（较常见）、maharajah（较传统的拼法）；复数既可写 maharajas，也可写 maharajahs。"]}
{"word":"maharajas","summary":{"en":"Maharajas is the plural of maharaja, a historical Indian king or ruler.","zh":"maharajas 是 maharaja 的复数，指历史上的印度国王或统治者（大君）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A maharaja; a historical Indian king or ruler (especially a Hindu ruler), often associated with great wealth and power.","zh":"（尤指历史上的印度、常与印度教相关的）大君、国王、统治者；常给人富有与权势的印象。"},"examples":[{"en":"The museum has portraits of maharajas who once ruled large parts of India.","zh":"这家博物馆收藏着曾统治印度大片地区的诸位大君的肖像。"},{"en":"Stories about maharajas often mention palaces, jewels, and royal ceremonies.","zh":"关于大君的故事常会提到宫殿、珠宝和王室仪式。"}]}],"synonyms":["kings","rulers","monarchs"],"phonetic":"/ˌmɑːhəˈrɑːdʒəz/","extraExplanation":["“Maharaja”来自梵语：mahā（伟大的）+ rāja（国王），字面意思是“伟大的国王”。英语里常用来指印度土邦时期的君主或显赫统治者。","复数有两种常见形式：maharajas（英语规则复数）和 maharajahs（更接近另一种拼写 maharajah 的复数）。两者都常见。","在现代语境中，这个词有时也被借用来比喻“某领域的巨头/大人物”，但需注意语境，避免把真实历史称谓过度戏谑化。"]}
{"word":"maharajrana","summary":{"en":"Maharajrana (more commonly written “Maharaj Rana”) is a historical South Asian title meaning a high-ranking ruler or noble.","zh":"Maharajrana（更常写作“Maharaj Rana”）是南亚历史上的一种头衔，指地位很高的统治者或贵族。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a South Asian royal or noble title/name combining “Maharaj(a)” (great king) and “Rana” (ruler/warrior leader), used especially in historical contexts in India and Nepal (often written as “Maharaj Rana”); it refers to a high-ranking ruler or aristocrat rather than a common vocabulary word.","zh":"南亚的一种王室/贵族称号或名字，由“maharaj(a)”（大王/伟大的国王）与“rana”（统治者/武士领袖）组成，常见于印度与尼泊尔的历史语境（也常写作“maharaj rana”）；指高阶统治者或贵族身份，而非日常常用词。"},"examples":[{"en":"In the old records, he is described as a Maharaj Rana who controlled the region.","zh":"在旧档案中，他被描述为一位掌控该地区的“Maharaj Rana”（大王·拉纳）。"},{"en":"The museum label mentions a letter sent by the Maharaj Rana to a neighboring ruler.","zh":"博物馆的说明牌提到一封由“Maharaj Rana”寄给邻国统治者的信。"}]}],"synonyms":["Maharaja","Rana","Rajah","royal title","noble title"],"phonetic":"/ˌmɑːhəˈrɑːdʒ ˈrɑːnə/","extraExplanation":["“Maharaj(a)”源自梵语，字面含义接近“伟大的国王”；“Rana”在不同地区可指统治者、武士首领或贵族头衔。两者合用时，通常是在特定王朝/家族体系中的正式称谓。","拼写上你写的“maharajrana”更像是把两个词连写在一起；在英文资料里更常见的写法是分开（Maharaj Rana）或按各地习惯使用不同空格/连字符。","如果你指的是尼泊尔的“Rana”家族（拉纳家族）时期，它与尼泊尔近代政治史关系密切；但具体含义会随人物、年代与地区而变化。建议提供一句上下文或你看到它的出处，我可以帮你更精确地解释。"]}
{"word":"maharana","summary":{"en":"Maharana is an Indian royal title, especially for the rulers of Mewar (Rajasthan).","zh":"Maharana 是印度的王室头衔，尤指梅瓦尔（拉贾斯坦）统治者的称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a royal title in India, especially used by the rulers of Mewar (a historic kingdom in present-day Rajasthan); it is often translated as “great king” or “great ruler.”","zh":"印度的一种王室头衔，尤其指梅瓦尔（今拉贾斯坦邦一带的历史王国）的统治者；常被译为“伟大之王/大君主”。"},"examples":[{"en":"Maharana Pratap is remembered for resisting Mughal expansion in the 16th century.","zh":"马哈拉纳·普拉塔普因在16世纪抵抗莫卧儿扩张而被人们铭记。"},{"en":"The museum displays letters issued under the seal of the Maharana of Mewar.","zh":"博物馆展出了盖有梅瓦尔马哈拉纳印玺的公文与书信。"}]}],"synonyms":["maharaja","raja"],"phonetic":"/ˌmɑːhəˈrɑːnə/","extraExplanation":["“Maharana”来自梵语/印地语语境：maha-（伟大的）+ rana（国王/战士统治者一类的称号）。在英语里它通常作为历史与文化专有名词使用，首字母大写较常见（Maharana）。","它与更常见的“maharaja（大王）”相近，但“maharana”在历史上与梅瓦尔王室联系更紧密，带有特定地域与家族传统色彩。"]}
{"word":"maharanee","summary":{"en":"Maharanee is an older spelling of maharani, meaning an Indian queen or the wife/widow of a maharaja.","zh":"maharanee 是 maharani 的旧式拼写，指印度的王后/女王，或大君主（maharaja）的妻子或遗孀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(India) A queen or a female ruler; the wife or widow of a maharaja (a great king).","zh":"（印度）王后；女统治者；（大君主 maharaja 的）妻子或遗孀。"},"examples":[{"en":"The maharanee appeared at the ceremony wearing traditional jewelry.","zh":"那位王后在仪式上佩戴着传统珠宝亮相。"},{"en":"In the old story, the maharanee governed the region while the king was away.","zh":"在这个古老的故事里，国王不在时由王后治理那片地区。"}]}],"synonyms":["maharani","rani","queen"],"phonetic":"/ˌmɑːhəˈrɑːni/","extraExplanation":["“Maharanee”是“maharani”的较旧/较少见拼写，常见于19世纪到20世纪早期的英文文本（尤其与殖民时期的印度相关）。现代英语更常写作“maharani”。","词源来自印地语/梵语体系：maha-（伟大的）+ rani（王后/女王）。在文化语境中，它既可指统治者本人的头衔，也可指“王的配偶”的身份。"]}
{"word":"maharanees","summary":{"en":"“Maharanees” means “maharanis”: queens/female rulers in India, or the wives of maharajas.","zh":"“maharanees”是“maharani/maharanee”的复数，指印度的王后/女王或女性统治者，也可指maharaja的妻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of maharanee/maharani: queens or female rulers in parts of India; also the wives of maharajas (kings or princes).","zh":"maharanee/maharani 的复数：指印度部分地区的女王或女性统治者；也可指“maharaja（国王/藩王）”的妻子。"},"examples":[{"en":"The museum exhibit included portraits of maharanees from the 19th century.","zh":"博物馆展览里有一些19世纪印度王后的肖像。"},{"en":"In the novel, the maharanees advise the young prince behind the scenes.","zh":"在小说里，这些王后在幕后为年轻王子出谋划策。"}]}],"synonyms":["maharanis","queens","royal consorts"],"phonetic":"/ˌmɑːhəˈrɑːniz/","extraExplanation":["“Maharanee/maharani”来自印地语/梵语传统称号：maha-（伟大）+ rani（王后/女王）。英语里常见拼写是 maharani；maharanee 属于较旧或较少见的拼写。","在历史语境中，它可能指拥有实际权力的女性统治者，也可能只是王室头衔（国王/藩王的配偶）。阅读时可根据上下文判断是“统治者”还是“王后”。"]}
{"word":"maharani","summary":{"en":"Maharani means an Indian queen/queen consort, especially the wife of a maharaja.","zh":"Maharani 指印度的王后/王妃，尤指 maharaja（大君）的妻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A queen or queen consort in India (especially the wife of a maharaja), or a woman holding a comparable royal title.","zh":"（印度的）王后／王妃；尤指“maharaja（大君）”的妻子，或拥有类似王室头衔的女性。"},"examples":[{"en":"The maharani attended the festival in a traditional sari.","zh":"王妃穿着传统纱丽出席了节庆。"},{"en":"In the museum, you can see portraits of a maharaja and his maharani.","zh":"在博物馆里，你可以看到大君和王妃的肖像。"}]}],"synonyms":["queen","queen consort","rani"],"phonetic":"/ˌmɑːhəˈrɑːni/","extraExplanation":["“Maharani”来自梵语/印地语构词：maha-（大、伟大）+ rani（王后/女王）。对应男性头衔是“maharaja”（大君/国王）。","在英语语境中，“maharani”常用于历史、殖民时期文献、旅游介绍或印度王公贵族相关的文化内容；现代印度是共和国，这类称号多见于历史或礼仪性称呼。","有时品牌、酒店或餐厅也会使用“maharani”来营造“皇家、华丽”的文化意象；此时多为借用意象，并不表示真实王室身份。"]}
{"word":"maharanis","summary":{"en":"“Maharani(s)” means Indian queens or royal women, especially the wives/widows of maharajas.","zh":"“Maharani(s)”指印度的王后/王妃等皇室贵族女性，尤指 maharaja 的妻子或遗孀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of maharani: a woman of high rank in India, especially the wife or widow of a maharaja (a king or ruler), sometimes used as a title meaning “queen.”","zh":"maharani 的复数：印度的高阶贵族女性，尤指 maharaja（王公/统治者）的妻子或遗孀；也可作为头衔使用，含“王后/女王”之意。"},"examples":[{"en":"The museum displayed portraits of several maharanis from the 19th century.","zh":"博物馆展出了几位19世纪 maharani（王妃/王后）的肖像。"},{"en":"Many maharanis were known as patrons of art, music, and education.","zh":"许多 maharani 以资助艺术、音乐和教育而闻名。"}]}],"synonyms":["queens","royal women","princesses"],"phonetic":"/ˌmɑːhəˈrɑːniz/","extraExplanation":["“Maharani”来自梵语/印地语语源：maha-（“伟大”）+ rani（“王后/女王”）。在英语写作中常出现在历史、殖民时期记录、艺术史与印度诸邦（princely states）的语境里。","在现代印度，真实的“土邦”制度已成为历史，但在礼貌称呼、家族传统、文化报道或文学作品中仍可能见到该头衔。使用时注意语境，避免把它当作任何印度女性的通称。"]}
{"word":"maharao","summary":{"en":"Maharao is a historical Indian royal title for certain princely-state rulers, similar to maharaja.","zh":"Maharao 是印度历史上的王号，用于部分土邦统治者，含义近似 maharaja（大君）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hereditary royal title used by some rulers of princely states in western India (especially in Rajasthan and Kutch), similar in rank and meaning to “maharaja.”","zh":"（印度西部部分土邦统治者使用的）世袭王号/封号，尤见于拉贾斯坦与库奇一带，含义与地位大致相当于“maharaja（大君）”。"},"examples":[{"en":"The Maharao of Kutch ruled the region before India’s independence.","zh":"在印度独立前，库奇的 Maharao 统治着该地区。"},{"en":"The palace museum includes portraits of the Maharaos who governed the state.","zh":"宫殿博物馆里有历代治理该邦的 Maharao 的肖像。"}]}],"synonyms":["maharaja","prince","ruler"],"phonetic":"/ˌmɑːhəˈraʊ/","extraExplanation":["“Maharao”多被视为一种历史性的尊号，常用于介绍英属印度时期的“土邦”（princely states）统治者。","词源上可理解为“maha-（伟大）+ rao（传统尊称/首领）”，在不同地区拼写与用法可能略有差异。","与“maharaja”相近，但并非所有地区都用同一个头衔；具体称号常与当地历史、王朝与英殖民时期的行政安排有关。"]}
{"word":"maharashtri","summary":{"en":"Maharashtri means ‘of Maharashtra/Marathi people,’ and can also refer to the ancient language variety Maharashtri Prakrit.","zh":"Maharashtri 指“马哈拉施特拉/马拉地人相关的”，也可指古代语种“马哈拉施特里普拉克里特语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Maharashtra (a state in western India) or to the Marathi-speaking people of that region; Marathi.","zh":"与印度西部的马哈拉施特拉邦（Maharashtra）或当地讲马拉地语（Marathi）的人群有关的；马哈拉施特拉的；马拉地的。"},"examples":[{"en":"Maharashtri cuisine often includes spicy curries and millet breads.","zh":"马哈拉施特拉（Maharashtri）的饮食常见辛辣咖喱和杂粮面饼。"},{"en":"She comes from a Maharashtri family in Pune.","zh":"她来自浦那的一个马哈拉施特拉（Maharashtri）家庭。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Maharashtra; a Marathi-speaking person (less common than “Maharashtrian” in modern English).","zh":"马哈拉施特拉邦人；马拉地语使用者（现代英语里不如“Marashtrian”常用）。"},"examples":[{"en":"Many Maharashtris moved to Mumbai for work.","zh":"许多马哈拉施特拉邦人（Maharashtris）为了工作搬到孟买。"}]},{"partOfSpeech":"n.","definition":{"en":"Maharashtri Prakrit: an ancient Indo-Aryan language variety associated with western India and used in some classical Indian literature.","zh":"马哈拉施特里普拉克里特语（Maharashtri Prakrit）：与印度西部有关的一种古代印度-雅利安语支语言变体，见于部分古典印度文学。"},"examples":[{"en":"Some poems were composed in Maharashtri Prakrit.","zh":"有些诗歌是用马哈拉施特里普拉克里特语写成的。"}]}],"synonyms":["Maharashtrian","Marathi"],"phonetic":"/ˌmɑːhəˈrɑːʃtri/","extraExplanation":["“Maharashtri”在现代日常英语中相对少见，更常见的形容词/名词是“Maharashtrian”。不过在语言学或古典文学语境里，“Maharashtri”常用于指“Maharashtri Prakrit（马哈拉施特里普拉克里特语）”。","拼写上容易与“Marathi（马拉地语/马拉地人）”混淆：一般口语场景用“Marathi”或“Maharashtrian”更自然；谈到古代语种时更可能看到“Maharashtri”。"]}
{"word":"maharawal","summary":{"en":"Maharawal is a royal title, especially for the hereditary rulers of Jaisalmer in Rajasthan, India.","zh":"Maharawal是印度拉贾斯坦邦杰伊瑟尔梅尔旧王国统治者使用的王号/君主称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hereditary royal title used by the rulers of Jaisalmer (a former princely state in Rajasthan, India), roughly meaning “great ruler/king.”","zh":"（印度）“Maharawal”是拉贾斯坦邦杰伊瑟尔梅尔（Jaisalmer）旧王国统治者使用的世袭王号，大致相当于“伟大的统治者/国王”。"},"examples":[{"en":"The Maharawal of Jaisalmer was a Rajput ruler in western India.","zh":"杰伊瑟尔梅尔的Maharawal是印度西部的一位拉杰普特统治者。"},{"en":"In the museum, we saw portraits of several Maharawals from the royal family.","zh":"在博物馆里，我们看到了皇室家族几位Maharawal的肖像。"}]}],"synonyms":["ruler","king","monarch","royal title"],"phonetic":"ˌmɑhəˈrɑwəl","extraExplanation":["“Maharawal”常被视为一种地区性的君主称号（类似“maharaja/大君”但更具地方特色），主要与拉贾斯坦邦沙漠城市杰伊瑟尔梅尔及其王族有关。","在英文历史写作中，它通常作为专有名词使用并大写（the Maharawal of Jaisalmer）；在现代印度，更多出现在历史、文化遗产与旅游相关语境中，而非现实政治权力称谓。"]}
{"word":"maharawat","summary":{"en":"“Maharawat” is mainly a proper noun used as a surname (and sometimes a regional clan/title term in North India), not a common English word.","zh":"“Maharawat”主要是专有名词，多用作姓氏（在印度北部某些语境也可指氏族/头衔），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly found in India; not a standard English vocabulary word.","zh":"（专有名词）姓氏，最常见于印度；并非标准英语词汇。"},"examples":[{"en":"Mr. Maharawat will speak at the meeting tomorrow.","zh":"Maharawat 先生将于明天在会议上发言。"},{"en":"She listed “Maharawat” as her last name on the form.","zh":"她在表格上把 “Maharawat” 填为自己的姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional use) a community/clan name or honorific title in parts of North India (especially Rajasthan/Haryana) used in some historical or social contexts.","zh":"（地区用法）在印度北部部分地区（尤指拉贾斯坦邦/哈里亚纳邦）出现的社群/氏族名称或带有头衔色彩的称呼，用于某些历史或社会语境中。"},"examples":[{"en":"The article mentions the Maharawat community in Rajasthan.","zh":"这篇文章提到了拉贾斯坦邦的 Maharawat 社群。"},{"en":"In some records, “Maharawat” appears as a title before a person’s name.","zh":"在一些记录中，“Maharawat” 会作为头衔出现在人名之前。"}]}],"synonyms":["(no direct English synonym; it is a proper name)"],"phonetic":"/ˌmɑːhəˈrɑːwʌt/","extraExplanation":["“maharawat”不是常见英语单词，更多是音译的专名（人名/姓氏/社群名）。不同地区与家族对其来源与拼写可能不完全一致。","如果你是在某篇文章、证件或社交媒体上看到这个词，给我上下文（句子/国家/语言环境），我可以更准确判断它是姓氏、地名还是头衔。"]}
{"word":"maharishi","summary":{"en":"A maharishi is a revered “great sage” in Indian tradition, and it can also be a title used for some modern spiritual leaders.","zh":"maharishi 指印度传统中的“大圣贤”，也可作某些现代灵性导师使用的头衔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Indian traditions, a great sage or revered spiritual teacher (from Sanskrit, literally “great rishi/seer”).","zh":"（印度传统中）大圣贤；受尊敬的修行者、圣者（源自梵语，字面义为“伟大的仙人/先知”）。"},"examples":[{"en":"In the story, a maharishi gives the king advice about compassion.","zh":"在故事里，一位大圣贤给国王关于慈悲的忠告。"},{"en":"Many Indian epics describe maharishis living in forests and teaching students.","zh":"许多印度史诗描写大圣贤隐居林中、教导弟子。"}]},{"partOfSpeech":"n.","definition":{"en":"A title used as a name for certain modern spiritual leaders; most famously, Maharishi Mahesh Yogi, who popularized Transcendental Meditation (TM).","zh":"（作为头衔）用于某些现代灵性导师的称号；最知名的是“玛赫里希·玛赫西·优吉”（Maharishi Mahesh Yogi），他推广了“超觉静坐/超觉冥想”（TM）。"},"examples":[{"en":"The documentary mentions Maharishi Mahesh Yogi and the rise of TM in the West.","zh":"纪录片提到玛赫里希·玛赫西·优吉以及TM在西方的兴起。"},{"en":"Some fans refer to him simply as “the Maharishi.”","zh":"一些追随者干脆称他为“玛赫里希”。"}]}],"synonyms":["sage","rishi","seer","guru"],"phonetic":"/ˌmɑhəˈriʃi/","extraExplanation":["“Maharishi”来自梵语：maha-（伟大的）+ rishi（圣贤、先知、隐修者）。英文中常写作 maharishi（普通名词）或 Maharishi（作为头衔/专名）。","在英文语境里，如果指具体人物（如 Maharishi Mahesh Yogi），通常要大写；如果泛指“圣贤”这一类人物，小写更常见。"]}
{"word":"maharishis","summary":{"en":"“Maharishis” means great sages in Hindu tradition; it is the plural of “maharishi.”","zh":"“maharishis”指印度教传统中的“大圣贤们”，是“maharishi”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"great sages in Hindu tradition (plural of “maharishi”), respected as spiritually advanced teachers and seers","zh":"（印度教传统中的）大圣贤、伟大的修行者与先知（“maharishi”的复数），常被视为德行与灵性修为极高的导师"},"examples":[{"en":"In the epic stories, maharishis advise kings and guide heroes.","zh":"在史诗故事中，maharishis 常常劝谏国王、指引英雄。"},{"en":"The temple’s artwork shows maharishis meditating in the forest.","zh":"寺庙的艺术作品描绘了 maharishis 在森林中打坐冥想。"}]}],"synonyms":["sages","holy men","seers","spiritual teachers"],"phonetic":"/ˌmɑːhəˈriːʃiːz/","extraExplanation":["“Maharishi”来自梵语：mahā-（伟大的）+ ṛṣi（圣贤、仙人、先知）。因此 maharishis 指“伟大的圣贤们”。","在印度文学与宗教语境里，ṛṣi/maharishi 常与经典、修行、启示（被认为“看见”真理的人）相关；中文里常译作“圣贤”“仙人”“大德”“大圣”。","现代英语里你也会看到专名用法，如 “Maharishi Mahesh Yogi”（超觉静坐运动相关人物）；但一般名词 maharishi/maharishis 更偏传统文化与宗教语境。"]}
{"word":"maharmah","summary":{"en":"“maharmah” is not a standard English word; it’s likely a misspelling or a transliteration/name. Please provide context to identify the intended word.","zh":"“maharmah”不是标准英语词；很可能是拼写错误或外来语/名字的转写。请提供上下文以确认你想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard or widely recognized English word. It may be a misspelling or a transliteration of a word from another language, or a personal/place name. Common look-alikes include “mahram” (Islamic law term) and “Mahatma” (honorific, as in Mahatma Gandhi).","zh":"不是标准或常见的英语单词。可能是拼写错误、外来语音译/转写，或人名/地名。常见的相近词包括“mahram”（伊斯兰法术语）和“Mahatma”（尊称，如“圣雄甘地”）。"},"examples":[{"en":"I couldn’t find “maharmah” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“maharmah”——你能把它出现的句子发我吗？"},{"en":"Did you mean “mahram” or “Mahatma”? The meanings are very different.","zh":"你想找的是“mahram”还是“Mahatma”？它们的意思差别很大。"}]}],"synonyms":["(possible intended words) mahram","(possible intended words) Mahatma"],"phonetic":"/ˌmɑː.hɑːrˈmɑː/","extraExplanation":["“maharmah”这种拼写在常见英语词典和主流语料里不太出现，因此最可靠的做法是：你提供上下文（整句/段落、来源语言或地区、是否是人名/地名）。我可以据此判断它更接近哪个词（例如伊斯兰语境里的 mahram，或印度语境里的 Mahatma），并给出准确释义与用法。"]}
{"word":"maharshi","summary":{"en":"A “maharshi” is a highly respected Hindu sage or spiritual seer.","zh":"“maharshi”指印度教语境中备受尊崇的圣贤、灵性先知/大修行者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a revered Hindu sage; literally “great rishi” (a great seer or holy person known for spiritual wisdom).","zh":"（印度教语境）受尊崇的圣贤/大圣人；字面义为“伟大的里希”（有灵性洞见与修行智慧的圣者）。"},"examples":[{"en":"Many people call Ramana Maharshi a maharshi because of his spiritual teachings.","zh":"很多人称罗摩那·马哈希为“maharshi”，因为他的灵性教导影响深远。"},{"en":"In the story, the king seeks advice from a maharshi living in the forest.","zh":"故事里，国王去森林里拜访一位maharshi，请他指点迷津。"}]}],"synonyms":["sage","seer","rishi","holy man","spiritual teacher"],"phonetic":"/məˈhɑrʃi/","extraExplanation":["“Maharshi”来自梵语：maha-（伟大）+ rishi（圣贤、先知、隐士圣者）。常见于印度宗教与哲学文本，也常作为尊称或头衔使用。","在英语里它通常写作 maharshi（不大写）表示“这类人物”；如果指特定人物名字的一部分（如 Ramana Maharshi），则按专名习惯大写。"]}
{"word":"mahat","summary":{"en":"Mahat is a Sanskrit-derived term used mainly in Indian philosophy for the “Great Principle,” linked to cosmic intelligence and early stages of creation/evolution.","zh":"Mahat 是源自梵语的术语，主要用于印度哲学，指“伟大原则/大原理”，常与宇宙理智及创化（演化）的早期阶段相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Indian philosophy, especially Sāṃkhya) the “great principle”: the first product of primordial nature, linked with cosmic intelligence and the source of ego and mind.","zh":"（印度哲学，尤指数论派 Sāṃkhya）“大原理/大本体（mahat）”：从原质（prakṛti）最先显现的原则，常与宇宙理智相关，被视为自我意识与心识等进一步演化的根源。"},"examples":[{"en":"In Sāṃkhya philosophy, mahat is described as the first evolution of nature.","zh":"在数论哲学中，mahat 常被描述为自然（原质）的第一次演化。"},{"en":"Some texts connect mahat with cosmic intelligence rather than an individual mind.","zh":"有些文本把 mahat 解释为“宇宙理智”，而不是个人的心智。"}]},{"partOfSpeech":"other","definition":{"en":"a transliteration of a Sanskrit word meaning “great,” sometimes used in names, titles, or religious/philosophical writing.","zh":"梵语词的音译，原义为“伟大/宏大”，有时出现在人名、称号或宗教与哲学写作中。"},"examples":[{"en":"You may see mahat in transliterated Sanskrit passages in English books.","zh":"在英文书籍里，你可能会在梵语转写段落中看到 mahat 这个词。"},{"en":"The meaning of mahat is often explained in a footnote as “the great (principle).”","zh":"mahat 的含义常在脚注中被解释为“伟大的（原则）”。"}]}],"synonyms":["the Great Principle","cosmic intelligence (in some interpretations)"],"phonetic":"/məˈhɑːt/","extraExplanation":["“mahat”在英语里不算常用词，更多出现在印度哲学、宗教学、瑜伽研究等语境的学术写作中。一般读者更常见的是解释性译法，如“the Great Principle”。","在数论（Sāṃkhya）的体系里，常见的顺序是：prakṛti（原质/自然）→ mahat（大原理）→ ahaṃkāra（我执/自我意识）→ manas（心/意）等；不同传统与译者对术语对应会略有差异，阅读时可留意注释。"]}
{"word":"mahatma","summary":{"en":"Mahatma means a spiritually great person, and it is also a title famously used for Gandhi.","zh":"Mahatma 指“伟大灵魂的圣人/智者”，也常作为对甘地的尊称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a great-souled person; in Indian (especially Hindu) tradition, a holy or spiritually wise person","zh":"伟大灵魂的人；在印度（尤指印度教）传统中指圣人、精神上非常有智慧的人"},"examples":[{"en":"In some Hindu communities, a mahatma is respected as a spiritual teacher.","zh":"在一些印度教社群中，mahatma 会被尊敬为精神导师。"},{"en":"The villagers asked the mahatma for advice on living peacefully.","zh":"村民向这位 mahatma 请教如何平和地生活。"}]},{"partOfSpeech":"n.","definition":{"en":"an honorific title used for Mohandas K. Gandhi: “Mahatma Gandhi”","zh":"对莫罕达斯·K·甘地的尊称：Mahatma Gandhi（“圣雄甘地”）"},"examples":[{"en":"Many people still quote Mahatma Gandhi’s writings on nonviolence.","zh":"许多人至今仍引用 Mahatma Gandhi 关于非暴力的著作。"},{"en":"In textbooks he is often referred to as Mahatma Gandhi.","zh":"在教科书里他常被称为 Mahatma Gandhi。"}]}],"synonyms":["saint","sage","spiritual leader","holy person"],"phonetic":"/məˈhɑtmə/","extraExplanation":["词源来自梵语：mahā-（伟大）+ ātman（灵魂/自我），字面意思是“伟大的灵魂”。","“Mahatma”并不是甘地的本名，而是人们对他的敬称（中文常译“圣雄”）。在日常英语中，单独说 mahatma 通常带有印度宗教/文化语境。"]}
{"word":"mahatmaism","summary":{"en":"Mahatmaism means the principles associated with Mahatma Gandhi, especially nonviolence and civil disobedience.","zh":"Mahatmaism 指与甘地相关的理念与原则，尤指非暴力与公民不服从。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ideas, values, and political/social principles associated with Mahatma Gandhi, especially nonviolence, civil disobedience, and simple living","zh":"圣雄甘地思想；指与甘地相关的一套理念与社会政治原则，尤指非暴力、和平抗争（公民不服从）与简朴生活"},"examples":[{"en":"Some activists studied Mahatmaism to learn strategies of nonviolent protest.","zh":"一些行动者研究“甘地主义”，以学习非暴力抗争的策略。"},{"en":"He criticized Mahatmaism as too idealistic for modern politics.","zh":"他批评“甘地主义”对现代政治来说过于理想化。"},{"en":"The lecture compared Mahatmaism with other independence movements of the 20th century.","zh":"这场讲座把甘地主义与20世纪其他独立运动作了比较。"}]}],"synonyms":["Gandhism","Gandhian philosophy","nonviolent resistance"],"phonetic":"/məˈhɑːtməˌɪzəm/","extraExplanation":["“Mahatma”是对甘地的尊称，源自梵语，常译为“圣雄”（意为“伟大的灵魂”）。因此“Mahatmaism”字面上就是“圣雄之主义”。","在英语里这个词并不算特别常用，更常见的说法是“Gandhism（甘地主义）”或“Gandhian philosophy（甘地思想）”。在学术或评论语境中，“Mahatmaism”有时带一点“把甘地神圣化/偶像化”的批评意味，具体要看上下文。","与之相关的关键词包括：nonviolence（非暴力）、civil disobedience（公民不服从）、satyagraha（坚持真理/真理力量，甘地用来指非暴力抵抗的核心理念）。"]}
{"word":"mahatmas","summary":{"en":"“Mahatmas” means “great souls,” referring to revered spiritual/moral leaders (and, in some esoteric traditions, enlightened masters).","zh":"“Mahatmas”意为“伟大的灵魂”，指受尊敬的精神/道德领袖；在部分神秘传统中也指开悟的大师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of *mahatma*: a highly respected spiritual or moral leader in Indian tradition; literally, a “great soul.”","zh":" *mahatma* 的复数：在印度传统中备受尊敬的精神/道德领袖；字面义为“伟大的灵魂”。"},"examples":[{"en":"Many people in the village spoke of the mahatmas who guided them in times of trouble.","zh":"村里许多人谈到那些在困难时期引导他们的“圣贤/伟人”（mahatmas）。"},{"en":"Gandhi is often remembered as one of India’s great mahatmas.","zh":"甘地常被人们视为印度伟大的“圣者/伟人”之一。"}]},{"partOfSpeech":"n.","definition":{"en":"In Theosophy and some esoteric writings, enlightened masters or advanced spiritual teachers.","zh":"在神智学（Theosophy）及一些神秘主义著作中，指“开悟的大师/高度修行的灵性导师”。"},"examples":[{"en":"The book described the mahatmas as hidden masters who teach humanity.","zh":"这本书把 mahatmas 描述成教导人类的隐秘大师。"}]}],"synonyms":["saints","sages","spiritual leaders","holy men","gurus"],"phonetic":"/məˈhɑːtməz/","extraExplanation":["词源：来自梵语 *mahā*（伟大的）+ *ātman*（灵魂、自我），合起来就是“伟大的灵魂”。英语里常用单数 *mahatma*，复数是 *mahatmas*。","文化提示：在英语语境中，最常见的联想是“Mohandas K. Gandhi（甘地）被称为 Mahatma Gandhi”。这个称号更多是尊称，而不是正式头衔。"]}
{"word":"mahayana","summary":{"en":"Mahayana is a major branch of Buddhism, especially influential in East Asia, emphasizing the bodhisattva ideal and compassion.","zh":"Mahayana（大乘）是佛教的重要分支，在东亚影响深远，强调菩萨精神与慈悲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major branch of Buddhism that developed in India and later spread widely in East Asia; it emphasizes the bodhisattva ideal (seeking enlightenment to help all beings).","zh":"大乘佛教：佛教的重要分支，起源于印度，后广泛传播到东亚；强调“菩萨道”（为度化众生而求觉悟）。"},"examples":[{"en":"Mahayana Buddhism is common in China, Korea, Japan, and Vietnam.","zh":"大乘佛教在中国、韩国、日本和越南很常见。"},{"en":"Many Mahayana texts discuss compassion and the bodhisattva path.","zh":"许多大乘经典讨论慈悲与菩萨道。"}]}],"synonyms":["Mahayana Buddhism","Northern Buddhism (older, less precise term)"],"phonetic":"/ˌmɑːhəˈjɑːnə/","extraExplanation":["“Mahayana”来自梵语，字面意思是“伟大的乘（工具/道路）”，常译为“大乘”。它与“Theravada（上座部）”常被对比：大乘更强调菩萨行与普度众生；但两者都以佛陀教法为基础。","在英语里它通常作为专有名词使用，首字母常大写：Mahayana (Buddhism)。有时也会看到形容词用法：Mahayana traditions（大乘传统）。"]}
{"word":"mahayanism","summary":{"en":"Mahayanism means Mahayana Buddhism, a major Buddhist tradition that highlights the bodhisattva path and influenced East Asian Buddhism.","zh":"Mahayanism 指大乘佛教，强调菩萨道，对东亚佛教影响深远。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major tradition of Buddhism that emphasizes the bodhisattva ideal (seeking enlightenment for the benefit of all beings) and developed influential scriptures and practices across East Asia and beyond","zh":"大乘佛教（佛教的重要传统之一，强调“菩萨道/菩萨理想”，即为利益一切众生而求觉悟，并在东亚等地发展出重要的经典与修行方式）"},"examples":[{"en":"Mahayanism spread widely in China, Korea, and Japan.","zh":"大乘佛教在中国、韩国和日本广泛传播。"},{"en":"Many Mahayanism texts emphasize compassion and wisdom together.","zh":"许多大乘佛教经典强调慈悲与智慧并重。"},{"en":"The bodhisattva ideal is central to Mahayanism.","zh":"菩萨理想是大乘佛教的核心。"}]}],"synonyms":["Mahayana Buddhism","the Mahayana tradition"],"phonetic":"ˌmɑːhəˈjɑːnɪzəm","extraExplanation":["“Mahayanism”是英语里较学术/概括性的说法，更常见的表达是“Mahayana Buddhism（大乘佛教）”。","常见对比：大乘（Mahayana）与上座部（Theravada，常被称为“小乘”在现代语境可能带贬义，正式场合建议用“Theravada/上座部”）。","大乘相关的重要概念包括：bodhisattva（菩萨）、emptiness（空性）、compassion（慈悲）；在文化上常与汉传佛教、藏传佛教中的部分传统有关联。"]}
{"word":"mahayanist","summary":{"en":"A Mahayanist is someone who follows Mahayana Buddhism, or something related to it.","zh":"Mahayanist 指大乘佛教徒，或指与大乘佛教相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows Mahayana Buddhism (a major branch of Buddhism common in East Asia).","zh":"大乘佛教徒；信奉大乘佛教的人（佛教主要宗派之一，常见于东亚地区）。"},"examples":[{"en":"Many Mahayanists in China practice forms of Buddhism that emphasize compassion and helping others.","zh":"中国的许多大乘佛教徒修行的佛法强调慈悲与利他。"},{"en":"The temple serves both Mahayanists and visitors who are simply curious about Buddhism.","zh":"这座寺院既服务于大乘佛教徒，也接待只是对佛教好奇的访客。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of Mahayana Buddhism.","zh":"（与）大乘佛教有关的；具有大乘佛教特征的。"},"examples":[{"en":"The museum has a Mahayanist section with statues of bodhisattvas.","zh":"博物馆里有一个大乘佛教相关的展区，陈列着菩萨造像。"},{"en":"Some texts describe Mahayanist ideals such as the bodhisattva path.","zh":"一些经典阐述了大乘佛教的理念，例如菩萨道。"}]}],"synonyms":["Mahayana Buddhist","Mahayana follower"],"phonetic":"/ˌmɑːhəˈjɑːnɪst/","extraExplanation":["“Mahayanist”来自 “Mahayana”（大乘；梵语意为“伟大的乘/大车”）+ “-ist”（表示“……主义者/信奉者”的后缀）。","大乘佛教常见概念包括“菩萨”（bodhisattva）与“菩萨道”，强调发愿、慈悲与度众。与之相对常被提到的另一大传统是“Theravada”（上座部佛教）。","在现代英语中，更常见、更中性的说法是 “Mahayana Buddhist”。“Mahayanist”也可用，但在语境上更像学术或分类用语。"]}
{"word":"mahayanistic","summary":{"en":"An adjective meaning “related to Mahāyāna Buddhism.”","zh":"形容词：指“与大乘佛教有关的；大乘的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mahāyāna Buddhism, a major branch of Buddhism that emphasizes the bodhisattva ideal (seeking enlightenment to help all beings).","zh":"与“大乘佛教”有关的；大乘佛教的（强调菩萨道，即为度化众生而求觉悟）。"},"examples":[{"en":"Many temples in China and Japan are Mahayanistic in tradition.","zh":"中国和日本的许多寺院都属于大乘传统。"},{"en":"The text explains several Mahayanistic ideas, such as compassion and the bodhisattva path.","zh":"这篇文本解释了若干大乘思想，例如慈悲与菩萨道。"},{"en":"Her research compares Mahayanistic and Theravada practices.","zh":"她的研究比较了大乘与上座部的修行方式。"}]}],"synonyms":["Mahayana","Mahāyāna Buddhist","of Mahāyāna Buddhism"],"phonetic":"/ˌmɑːhɑːjəˈnɪstɪk/","extraExplanation":["“Mahayanistic”来自“Mahāyāna（大乘）”。英语里更常见、也更自然的说法是“Mahāyāna (Buddhist)”或“Mahayana”，例如：Mahayana Buddhism / a Mahayana tradition。“Mahayanistic”较少见，常出现在学术写作中。","大乘传统主要流行于东亚与部分中亚地区（如中国、韩国、日本、越南等），常见观念包括“菩萨（bodhisattva）”“空（emptiness）”“慈悲（compassion）”等；这是一种概括性描述，不同地区与宗派会有差异。"]}
{"word":"mahbub","summary":{"en":"Mahbub is a personal name meaning “beloved,” and it also appears as a character name in *Kim*.","zh":"Mahbub 是一个意为“心爱的人”的人名，也常见于《基姆》等英语文学作品中的角色名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (and sometimes a family name) used in Arabic-, Persian-, Urdu-, and Bengali-speaking communities; it literally means “beloved” or “dear.”","zh":"男性名字（有时也作姓氏），常见于阿拉伯语、波斯语、乌尔都语和孟加拉语社群；字面意思是“被爱的人 / 心爱的人”。"},"examples":[{"en":"Mahbub is an Arabic name meaning “beloved.”","zh":"Mahbub 是一个阿拉伯名字，意思是“心爱的人”。"},{"en":"His name is Mahbub, but his friends call him Mahbub bhai.","zh":"他叫 Mahbub，但朋友们叫他 Mahbub bhai（“马哈布布兄弟/大哥”）。"}]},{"partOfSpeech":"n.","definition":{"en":"a character name in English literature, especially Mahbub Ali in Rudyard Kipling’s novel *Kim* (1901).","zh":"英语文学中的人物名，尤其指吉卜林（Rudyard Kipling）小说《基姆》（*Kim*, 1901）里的 Mahbub Ali。"},"examples":[{"en":"In *Kim*, Mahbub Ali works as a horse dealer and a spy.","zh":"在《基姆》中，Mahbub Ali 是一位马贩子，同时也是间谍。"}]}],"synonyms":["beloved","dear"],"phonetic":"/mɑːˈbuːb/","extraExplanation":["Mahbub 源自阿拉伯语 **maḥbūb**（محبوب），来自词根 **ḥ-b-b**，与“爱、喜爱”有关，因此常被理解为“被爱的人、爱人、亲爱的”。","常见拼写变体包括 **Mahboob / Mahboub / Mehboob**；不同地区的转写习惯不同，但含义通常相近。"]}
{"word":"mahdi","summary":{"en":"Mahdi can mean an Islamic end-times “Guided One” who will restore justice, and it is also used as a male name.","zh":"Mahdi 可指伊斯兰教末世将出现、恢复公正的“正义引导者（马赫迪）”，也可作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam) A messianic figure called “the Guided One,” expected by many Muslims to appear before the end of the world to restore justice and true religion.","zh":"（伊斯兰教）“马赫迪”，意为“被引导者/正义引导者”；许多穆斯林相信他将在末日前出现，恢复公正与正统信仰。"},"examples":[{"en":"In some Islamic traditions, the Mahdi will appear to bring justice.","zh":"在一些伊斯兰传统中，人们相信马赫迪将出现并带来公正。"},{"en":"The story of the Mahdi is discussed differently in Sunni and Shia writings.","zh":"关于马赫迪的说法在逊尼派与什叶派文献中有所不同。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name in Arabic-speaking and Muslim communities.","zh":"（人名）“Mahdi/马赫迪”也常用作男性名字，见于阿拉伯语地区与穆斯林社群。"},"examples":[{"en":"Mahdi is a common first name in Iran and North Africa.","zh":"Mahdi 在伊朗和北非很常见，是常用的名字。"},{"en":"I met Mahdi at the library after class.","zh":"我下课后在图书馆遇到了 Mahdi。"}]}],"synonyms":["the Guided One","messianic figure"],"phonetic":"/ˈmɑdi/","extraExplanation":["“Mahdi”（المهدي）字面意思是“被引导者”。在什叶派（尤其十二伊玛目派）传统中，马赫迪的身份与特定历史人物（末代伊玛目）联系更紧密；而在逊尼派传统中，更多是“将出现的一位正义领袖”的概念，细节因学者与文献而异。","英语里通常写作 Mahdi（首字母大写），因为它是专有名词；作为人名时也同样大写。发音在不同语言/地区会略有差别。"]}
{"word":"mahdian","summary":{"en":"Mahdian means connected to the Mahdi in Islam, or to beliefs and movements centered on the Mahdi.","zh":"Mahdian 指与伊斯兰中的马赫迪相关，或指以马赫迪信仰/运动为中心的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Mahdi (a messianic figure in Islam), or to beliefs/teachings about the Mahdi","zh":"与“马赫迪”（伊斯兰传统中的救世/末世人物）有关的；指关于马赫迪的信仰或学说的"},"examples":[{"en":"Some Shia traditions include strong Mahdian expectations about the end times.","zh":"一些什叶派传统中包含较强的“马赫迪将出现”的末世期待。"},{"en":"The lecture discussed Mahdian themes in Islamic history and theology.","zh":"这场讲座讨论了伊斯兰历史与神学中的“马赫迪”主题。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports, promotes, or is strongly focused on belief in the Mahdi","zh":"信奉或宣扬马赫迪信仰的人；以马赫迪信念为核心的人"},"examples":[{"en":"In that period, the movement attracted many Mahdians who hoped for rapid change.","zh":"在那个时期，这个运动吸引了许多期待迅速变革的马赫迪信徒。"}]}],"synonyms":["Mahdist","messianic (approx.)"],"phonetic":"/ˈmɑːdiən/","extraExplanation":["“Mahdian”常见于宗教学、历史学或政治语境中，语气多为中性学术描述。日常英语里更常见的相关词是“Mahdi”（马赫迪）和“Mahdist”（马赫迪派的/马赫迪运动的）。","不同伊斯兰传统对“马赫迪”的理解不完全相同（尤其在什叶派与部分逊尼派之间）。在跨文化交流中，使用该词时尽量保持尊重与准确，避免把复杂信仰简单等同于其他宗教的“弥赛亚”概念。"]}
{"word":"mahdiship","summary":{"en":"Mahdiship means the office or authority of the Mahdi, especially in historical discussions (e.g., the Sudanese Mahdist state).","zh":"Mahdiship 指“马赫迪”的职位/身份与统治权，常用于历史语境（如苏丹马赫迪政权）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the status, office, or authority of the Mahdi (a messianic leader in Islam), especially in historical contexts such as the Sudanese Mahdist state","zh":"“马赫迪”（伊斯兰传统中的救世/弥赛亚式领袖）的身份、职位或统治权；尤指历史上的苏丹马赫迪国家/运动中的统治地位"},"examples":[{"en":"The rebels claimed that the leader’s mahdiship gave him the right to rule.","zh":"叛军宣称领袖的“马赫迪”地位（mahdiship）赋予他统治的合法性。"},{"en":"After the Mahdi’s death, disputes arose over who could inherit the mahdiship.","zh":"马赫迪去世后，谁能继承这一“马赫迪”权威（mahdiship）引发了争议。"}]}],"synonyms":["Mahdist authority","Mahdist rule","Mahdism (related)"],"phonetic":"/ˈmɑːdiˌʃɪp/","extraExplanation":["“Mahdiship”是由“Mahdi（马赫迪）+ -ship（表示身份/职位/状态，如 kingship）”构成的名词，常见于历史、宗教研究或殖民时期文献中。","在伊斯兰语境里，“马赫迪（Mahdi）”通常指末世将出现、恢复公正的领袖；在19世纪的苏丹，“马赫迪运动（Mahdism）”以此为号召建立政权，因此“mahdiship”常用来指那种宗教—政治合一的统治权。"]}
{"word":"mahdism","summary":{"en":"Mahdism is belief in or movements focused on the Mahdi, a promised Islamic leader expected to restore justice.","zh":"马赫迪主义指围绕马赫迪（伊斯兰传统中的被期待出现并恢复正义的领袖）的信仰或相关运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a religious belief or movement centered on the Mahdi (in Islam, a promised leader who is expected to appear to restore justice and true faith, especially near the end times).","zh":"一种以“马赫迪”（Mahdi，伊斯兰传统中被期待出现、恢复正义与正信的救世领袖，常与末世观念相关）为核心的宗教信仰或运动。"},"examples":[{"en":"Mahdism has influenced political movements in several parts of the Muslim world.","zh":"马赫迪主义影响了穆斯林世界一些地区的政治运动。"},{"en":"The 19th-century Mahdist movement in Sudan is often discussed as an example of Mahdism in history.","zh":"19世纪苏丹的马赫迪运动常被当作历史上马赫迪主义的例子来讨论。"},{"en":"Some writers use “Mahdism” to describe hopes for a divinely guided savior-like leader.","zh":"一些作者用“马赫迪主义”来描述人们对一位受神引导、类似救世主的领袖的期待。"}]}],"synonyms":["Mahdist belief","Mahdist movement"],"phonetic":"/ˈmɑːdiːzəm/","extraExplanation":["“Mahdism”来自“Mahdi（马赫迪）+ -ism（主义/思潮）”。在不同伊斯兰传统中，对“马赫迪是谁、何时出现、会带来什么改变”的理解并不完全相同；因此这个词在学术与新闻语境中既可能指宗教信念，也可能指具体历史运动（如苏丹马赫迪运动）。","在英文写作里，Mahdism 有时也被更宽泛地借用，指“对即将到来的救世式领袖或末世性复兴的期待”，但使用时需要注意语境，避免把不同穆斯林社群的信仰简单化。"]}
{"word":"mahdist","summary":{"en":"Mahdist means “connected with the Mahdi or Mahdism,” or “a follower of the Mahdi,” often discussed in relation to 19th-century Sudan.","zh":"Mahdist 指“与马赫迪或马赫迪主义有关的”，也可指“马赫迪的追随者”，常见于与19世纪苏丹相关的历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Mahdi (a messianic figure in Islam) or to a movement that claims the Mahdi’s authority.","zh":"与“马赫迪”（伊斯兰传统中的救世主式人物）有关的；指宣称拥有马赫迪权威的宗教/政治运动的。"},"examples":[{"en":"The Mahdist movement combined religious belief with political resistance.","zh":"马赫迪运动把宗教信仰与政治抵抗结合在一起。"},{"en":"Historians study Mahdist rule in Sudan to understand anti-colonial struggles.","zh":"历史学家研究苏丹的马赫迪统治，以理解反殖民斗争。"}]},{"partOfSpeech":"n.","definition":{"en":"a supporter or member of a Mahdist movement; a follower of the Mahdi.","zh":"马赫迪派成员/支持者；马赫迪的追随者。"},"examples":[{"en":"Many Mahdists joined the uprising against the Egyptian and British authorities.","zh":"许多马赫迪派人士加入了反抗埃及和英国当局的起义。"},{"en":"He wrote about meeting Mahdists during his travels in North Africa.","zh":"他写到自己在北非旅行时遇见了马赫迪派人士。"}]}],"synonyms":["Mahdism (related term)","follower of the Mahdi","supporter of the Mahdi"],"phonetic":"/məˈdɪst/","extraExplanation":["“Mahdist”来自“Mahdi”（马赫迪）+ “-ist”（表示某种信仰或立场的追随者）。在英语里它常与19世纪苏丹的“马赫迪起义/马赫迪国”（Mahdist Sudan, 1880s–1890s）相关，英文史料与军事史中很常见。","在文学与历史写作中，Winston Churchill 的《The River War》常提到 Mahdists（以当时英帝国视角叙述），阅读时可注意其时代立场与用词可能带有偏见。"]}
{"word":"mahesh","summary":{"en":"Mahesh is a common Indian male name; it can also refer to Shiva in Hindu tradition, meaning “great lord.”","zh":"Mahesh 是常见的印度男性名字；在印度教中也可指湿婆（Shiva）的称号之一，意为“伟大的主”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in India and among people of Indian heritage.","zh":"男性名字（常见于印度及印度裔人群）。"},"examples":[{"en":"Mahesh is my coworker; he just moved here from Pune.","zh":"Mahesh 是我的同事；他刚从浦那搬到这里。"},{"en":"I met Mahesh at the conference and we talked about education.","zh":"我在会议上认识了 Mahesh，我们聊了教育话题。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Hindu tradition) a name/title of Shiva, meaning “great lord.”","zh":"（印度教传统）湿婆（Shiva）的称号之一，意为“伟大的主 / 大自在天”。"},"examples":[{"en":"In some families, the name Mahesh is chosen to honor Shiva.","zh":"在一些家庭里，取名 Mahesh 是为了表达对湿婆的敬意。"},{"en":"The temple was dedicated to Mahesh (Shiva).","zh":"这座寺庙供奉的是 Mahesh（湿婆）。"}]}],"synonyms":["Mahesha","Mahadev (related Shiva name)"],"phonetic":"/məˈheɪʃ/","extraExplanation":["“Mahesh”来自梵语词源（常与 Mahā- 表示“伟大”、Īśa/Īśvara 表示“主/神”相关），因此带有宗教与文化含义。作为人名时通常不需要翻译，但在介绍含义时可解释为“great lord”。","英文语境中它通常读作 /məˈheɪʃ/（重音在第二音节）。有些人也会根据母语口音读得更接近“ma-HESH/ma-HAYSH”，礼貌做法是直接询问对方偏好的读法。"]}
{"word":"mahewu","summary":{"en":"Mahewu is a traditional Southern African fermented maize drink, sometimes served as a light meal.","zh":"Mahewu 是南部非洲传统的发酵玉米饮品，有时也可当作简餐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Southern African fermented drink (often slightly thick) made from maize meal (cornmeal) and water, sometimes sweetened; it can be served as a beverage or light meal.","zh":"（南部非洲）一种传统发酵玉米饮品（常略稠），用玉米粉和水制成，有时会加糖；可当饮料或简餐食用。"},"examples":[{"en":"In Zimbabwe, mahewu is often sold in markets as a cheap, filling drink.","zh":"在津巴布韦，mahewu 常在集市上售卖，是一种便宜又顶饱的饮品。"},{"en":"She made mahewu by mixing cooked maize meal with water and letting it ferment overnight.","zh":"她把煮好的玉米糊加水搅匀，放置一夜发酵来做 mahewu。"}]}],"synonyms":["fermented maize drink","fermented cornmeal drink","mageu"],"phonetic":"/məˈheɪwuː/","extraExplanation":["“Mahewu”常见于津巴布韦、赞比亚、南非等地的英语语境中，属于从班图语族语言进入英语的外来词；不同地区拼写可能不同，如 amahewu、mageu。","它通常带有微酸的发酵风味，口感介于饮料与稀粥之间；在一些家庭里也会作为早餐或补充能量的食物。"]}
{"word":"mahi","summary":{"en":"“Mahi” most often means “work/effort” in New Zealand English, and it can also mean the fish “mahi-mahi.”","zh":"“Mahi”最常见的意思是在新西兰英语中指“工作/付出”，也可指鱼“mahi-mahi（鲯鳅）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(New Zealand informal, from Māori) work; a job; effort put into doing something.","zh":"（新西兰口语，源自毛利语）工作；活儿；为完成某事付出的努力。"},"examples":[{"en":"I’ve got a lot of mahi to finish before Friday.","zh":"我周五前有很多活儿要做。"},{"en":"Nice mahi on that report—it’s really clear.","zh":"那份报告做得真不错——写得很清晰。"},{"en":"We’re putting in the mahi to get ready for the event.","zh":"我们正在下功夫为活动做准备。"}]},{"partOfSpeech":"n.","definition":{"en":"short for “mahi-mahi,” a bright-colored ocean fish (also called dolphinfish).","zh":"“mahi-mahi”的简称：一种颜色鲜艳的海鱼（也叫鲯鳅／dolphinfish）。"},"examples":[{"en":"I’ll have the grilled mahi with rice.","zh":"我要一份烤的mahi配米饭。"},{"en":"The tacos are made with fresh mahi-mahi.","zh":"这些墨西哥卷饼用的是新鲜的mahi-mahi。"}]}],"synonyms":["work","job","effort","labor","mahi-mahi","dolphinfish"],"phonetic":"/ˈmɑhi/","extraExplanation":["在新西兰英语里，mahi常见于日常口语，尤其在更愿意融入毛利文化表达的语境中，用来指“工作/干活”，语气通常偏积极（强调投入与努力）。","“mahi-mahi”来自夏威夷语，字面有“强壮/很厉害”的感觉，英文菜单上常把它简写成mahi。注意它并不是“dolphin（海豚）”，而是“dolphinfish（鲯鳅）”。"]}
{"word":"mahican","summary":{"en":"Mahican refers to a Native American people (and their historical language) from the Hudson River Valley; it can also mean “related to the Mahican.”","zh":"Mahican 指哈德逊河流域的马希坎原住民族及其历史语言，也可作形容词表示“与马希坎有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people originally from the Hudson River Valley in present-day New York and parts of New England; today many descendants are part of the Stockbridge-Munsee Community.","zh":"马希坎人：原居于今纽约州哈德逊河流域及新英格兰部分地区的北美原住民族；如今许多后裔属于“斯托克布里奇—蒙西（Stockbridge-Munsee）”社群。"},"examples":[{"en":"The Mahican lived along the Hudson River before many communities were displaced.","zh":"马希坎人曾沿哈德逊河生活，后来许多社群被迫迁徙。"},{"en":"Some Mahican descendants are associated with the Stockbridge-Munsee Community in Wisconsin.","zh":"一些马希坎人后裔与威斯康星州的斯托克布里奇—蒙西社群有关联。"}]},{"partOfSpeech":"n.","definition":{"en":"the Algonquian language historically spoken by the Mahican people (now largely not used as a daily community language).","zh":"马希坎语：马希坎人历史上使用的阿尔冈昆语系语言（如今多已不再作为日常社群语言使用）。"},"examples":[{"en":"Researchers have recorded word lists from Mahican to help document the language.","zh":"研究者记录了马希坎语词表，以帮助保存这门语言。"},{"en":"Mahican is related to other Algonquian languages.","zh":"马希坎语与其他阿尔冈昆语系语言有亲缘关系。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mahican people or their language and culture.","zh":"马希坎（的）：与马希坎人、其语言或文化有关的。"},"examples":[{"en":"The museum displayed Mahican artifacts and historical maps.","zh":"博物馆展出了马希坎文物和历史地图。"},{"en":"They attended a Mahican cultural event organized by the community.","zh":"他们参加了由社群组织的马希坎文化活动。"}]}],"synonyms":["Mohican (often confused/variant spelling)","Stockbridge-Munsee"],"phonetic":"/məˈhiːkən/","extraExplanation":["“Mahican”常与“Mohican”混淆。英语中《The Last of the Mohicans》（《最后的莫希干人》）让“Mohican”更广为人知，但“Mahican/ Mohican”在历史与拼写上存在交叉与误用；在学术与当代社群语境中，常见更具体的名称如“Stockbridge-Munsee”。","“Mahican”一词来源于当地原住民语言，常被解释为与“水域/河流”相关的含义；这也呼应其与哈德逊河流域的历史联系。"]}
{"word":"mahimahi","summary":{"en":"Mahi-mahi is an ocean fish (dolphinfish) commonly served as food.","zh":"Mahi-mahi 指一种常见的食用海鱼（dolphinfish，鲯鳅/鬼头刀）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brightly colored ocean fish (dolphinfish) often eaten as food; also called dorado","zh":"一种色彩鲜艳的海鱼（鲯鳅/鬼头刀，英文也叫 dolphinfish），常作为食用鱼；也称 dorado（多拉多）"},"examples":[{"en":"I ordered mahi-mahi tacos for lunch.","zh":"我午餐点了马希马希鱼（鲯鳅）塔可。"},{"en":"Mahi-mahi is popular in Hawaiian-style cooking.","zh":"马希马希鱼在夏威夷风味料理里很常见。"},{"en":"The restaurant serves grilled mahi-mahi with rice and vegetables.","zh":"那家餐厅提供烤马希马希鱼，配米饭和蔬菜。"}]}],"synonyms":["dolphinfish","dorado"],"phonetic":"/ˌmɑhi ˈmɑhi/","extraExplanation":["“mahi-mahi”来自夏威夷语，意思大致是“强壮/有力”（常被解释为“very strong”）。英语里常用连字符写作“mahi-mahi”。","注意：英文里的“dolphinfish”指的是这种鱼，并不是海豚（dolphin）。为避免误会，菜单上常改写成“mahi-mahi”。","常见搭配：grilled mahi-mahi（烤）、mahi-mahi tacos（鱼肉塔可）、blackened mahi-mahi（香料煎黑/焦香风味）。"]}
{"word":"mahjong","summary":{"en":"Mahjong is a traditional Chinese tile game (and also the tiles used to play it).","zh":"Mahjong 指传统的中国麻将游戏，也可指麻将牌本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Chinese tile-based game for 4 players (often played socially), where players draw and discard tiles to complete winning combinations.","zh":"麻将：一种传统的中国牌类（骨牌）游戏，通常四人进行；玩家摸牌、打牌，组成特定牌型以获胜。"},"examples":[{"en":"My grandparents play mahjong every weekend with their friends.","zh":"我爷爷奶奶每个周末都会和朋友一起打麻将。"},{"en":"We learned the basic rules of mahjong while traveling in Taiwan.","zh":"我们在台湾旅行时学会了麻将的基本规则。"},{"en":"After dinner, the family gathered around the table for a few rounds of mahjong.","zh":"晚饭后，家人围坐在桌边打了几圈麻将。"}]},{"partOfSpeech":"n.","definition":{"en":"the set of tiles used to play mahjong.","zh":"麻将牌：指玩麻将用的一整副牌（牌张/牌面）。"},"examples":[{"en":"She bought a new mahjong set with carved bamboo tiles.","zh":"她买了一副新的麻将牌，是雕刻竹纹的牌。"},{"en":"Please put the mahjong tiles back in the box when you’re done.","zh":"打完后请把麻将牌放回盒子里。"}]}],"synonyms":["mah-jongg","Chinese tile game","Mah Jong"],"phonetic":"/ˈmɑːdʒɑːŋ/","extraExplanation":["“Mahjong”来自中文“麻将”（Májiàng）的音译；在北美也常见拼写“mah-jongg”。不同地区规则差异很大（例如中国、香港、日本“立直麻将”、美国麻将），所以说“play mahjong”时，常需要说明是哪一种规则。","在英语语境里，mahjong除了指游戏本身，也常承载“家庭聚会、邻里社交”的文化联想；但在不同文化中对“是否涉及金钱”的理解不一，表达时可用“for fun / socially”来避免误会。"]}
{"word":"mahjongg","summary":{"en":"Mahjongg is a traditional Chinese tile game (and can also mean the tiles used to play it).","zh":"Mahjongg 指传统的麻将游戏，也可指麻将牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Chinese tile-based game for four players, usually played with a set of tiles, where players draw and discard to form winning combinations.","zh":"麻将：一种传统的中国四人牌类（骨牌）游戏，使用牌（麻将牌）进行摸牌、打牌并组合成牌型以获胜。"},"examples":[{"en":"My grandparents play mahjongg every weekend with their friends.","zh":"我祖父母每个周末都会和朋友一起打麻将。"},{"en":"We learned the basic rules of mahjongg in a community center class.","zh":"我们在社区中心的课程里学了麻将的基本规则。"},{"en":"After dinner, the family gathered around the table for a quick game of mahjongg.","zh":"晚饭后，全家人围坐在桌旁来了一局麻将。"}]},{"partOfSpeech":"n.","definition":{"en":"The tiles used to play mahjongg.","zh":"麻将牌：用于打麻将的一整套牌。"},"examples":[{"en":"She carefully cleaned the mahjongg before putting it back in the box.","zh":"她把麻将牌仔细擦干净后放回盒子里。"},{"en":"Some mahjongg sets have beautiful carved designs.","zh":"有些麻将牌套装有很精美的雕刻图案。"}]}],"synonyms":["mahjong","mah-jongg"],"phonetic":"/ˈmɑːˌdʒɑːŋ/","extraExplanation":["“Mahjongg”是英语里较常见的一种拼写变体；更常见的拼写还有“mahjong”和“mah-jongg”。英语中这个词来自中文“麻将”的音译，通常指游戏本身，也可以指麻将牌。","在西方语境里，麻将有时会让人联想到社区聚会或家庭娱乐；不同地区规则差异很大（例如中国各地、香港、台湾、日本等都有不同玩法），所以在英语交流中可以补一句“Which rules do you play?”（你们玩哪种规则？）以避免误会。"]}
{"word":"mahjonggs","summary":{"en":"Mahjong is a traditional Chinese tile game (or the tiles used for it), usually played by four people.","zh":"Mahjong 指传统的中国麻将游戏，或指打麻将用的那副牌，通常四人进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Chinese tile-based game played by 4 people, involving drawing and discarding tiles to form winning sets","zh":"麻将：一种传统的中国牌类（牌/砖）游戏，通常4人进行，通过摸牌、打牌组合成胡牌的牌型"},"examples":[{"en":"My grandparents play mahjong every weekend.","zh":"我爷爷奶奶每个周末都会打麻将。"},{"en":"We learned the basic rules of mahjong during the holiday.","zh":"假期里我们学了麻将的基本规则。"},{"en":"She won the mahjong game with a lucky draw.","zh":"她摸到一张幸运的牌，赢了这局麻将。"}]},{"partOfSpeech":"n.","definition":{"en":"the set of tiles used to play mahjong","zh":"麻将牌：用于打麻将的一整副牌（牌/砖）"},"examples":[{"en":"He bought a new mahjong set for his parents.","zh":"他给父母买了一副新的麻将牌。"},{"en":"Please put the mahjong tiles back in the box.","zh":"请把麻将牌放回盒子里。"}]}],"synonyms":["mah-jong","mahjongg"],"phonetic":"/ˈmɑːdʒɔŋ/","extraExplanation":["你输入的“mahjonggs”更像是拼写错误。最常见拼法是 **mahjong**；也有人写 **mah-jong** 或 **mahjongg**（较少见，带两个 g）。","“Mahjong”在英语里既可指“麻将这个游戏”，也可指“麻将牌这副牌”。在口语中也常说 **play mahjong**（打麻将）。","麻将在英语语境里通常被视为一种具有东亚文化背景的社交游戏；不同地区规则差异很大（如中国各地、香港、台湾、日本、美国比赛规则等），所以讨论规则时常会说明是哪一种玩法。"]}
{"word":"mahjongs","summary":{"en":"“Mahjongs” usually means multiple games or instances of playing mahjong, or it can simply be a plural way of referring to mahjong tiles/games.","zh":"“Mahjongs”通常指多局/多次麻将游戏，或作为复数提到麻将（牌/游戏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “mahjong”: the Chinese tile game played by 4 people, using sets, runs, and pairs (also written “mah-jongg”).","zh":"“mahjong（麻将）”的复数形式：一种四人玩的中国牌类/骨牌类游戏，用牌组凑成顺子、刻子和对子（也常写作 mah-jongg）。"},"examples":[{"en":"We played mahjongs all afternoon during the holiday.","zh":"假期里我们玩了一下午的麻将。"},{"en":"In the community center, you can hear mahjongs clicking on the tables.","zh":"在社区活动中心里，你能听到桌上麻将碰撞的咔嗒声。"}]}],"synonyms":["mahjong","mah-jongg","the tile game of mahjong"],"phonetic":"/ˈmɑːdʒɔːŋ/","extraExplanation":["“Mahjong”来自中文“麻将”的音译，在英语里常见拼写有 mahjong / mah-jongg。不同地区规则差异很大：常见的有中国地方规则、香港规则、台湾规则，以及面向英语世界的“American Mahjong”（通常使用计分卡，规则和牌型更固定）。","英语里说“play mahjong”最常见；“play mahjongs”也能理解，但更口语、较少见。也常用作不可数名词：We played mahjong last night（昨晚我们打麻将）。"]}
{"word":"mahlstick","summary":{"en":"A painter’s support stick used to steady the hand and prevent smudging while painting details.","zh":"画家用来稳手、防止蹭花颜料、方便画细节的支撑杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long stick with a padded (usually leather-covered) tip that a painter rests on the canvas or easel to steady the hand while painting fine details.","zh":"（绘画用的）支腕杆/稳手杖：一根长杆，末端通常有皮革包垫，画家把它支在画布或画架上，用来稳住手部，方便画细节。"},"examples":[{"en":"She used a mahlstick to keep her hand steady while painting the tiny highlights in the eyes.","zh":"她用支腕杆稳住手，在眼睛里画出细小的高光。"},{"en":"If you’re working in oil paint, a mahlstick can help you avoid smudging the wet surface.","zh":"如果你在画油画，支腕杆能帮助你避免把未干的画面蹭花。"}]}],"synonyms":["artist’s rest","painter’s stick"],"phonetic":"/ˈmɑːlˌstɪk/","extraExplanation":["“mahlstick”常见于传统写实绘画与油画技法中，也常被称为“artist’s rest”或“painter’s stick”。使用时通常一端握在手里，另一端轻轻支在画架边、画布框或手持的支点上，让手腕不直接压到湿颜料上。","词源上与荷兰语/德语中的相关词有关（与“画/涂抹”的概念相连），因此它属于较专业的艺术用品词汇。"]}
{"word":"mahmal","summary":{"en":"A mahmal is a richly decorated ceremonial litter carried on a camel, historically associated with pilgrimage caravans to Mecca.","zh":"Mahmal 指一种装饰华丽、由骆驼驮载的仪式性礼舆，历史上常与前往麦加的朝觐队伍有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorated ceremonial litter (covered platform carried on a camel), traditionally sent with some Muslim pilgrimage caravans to Mecca as a symbol of royal or state support","zh":"（传统上随部分穆斯林朝觐队伍前往麦加的）华饰礼舆；装饰华丽、由骆驼驮载的象征性“礼轿/舆座”"},"examples":[{"en":"In the past, the caravan traveled with a mahmal as a sign of official protection.","zh":"过去，朝觐商队会带着mahmal，以示官方的护送与庇护。"},{"en":"The museum display includes a model of a mahmal covered in embroidered cloth.","zh":"博物馆展柜里有一个mahmal模型，上面覆着绣花织物。"}]}],"synonyms":["ceremonial litter","palanquin (general)","camel-borne litter"],"phonetic":"/ˈmɑməl/","extraExplanation":["Mahmal 一词来自阿拉伯语，常与历史上的埃及或叙利亚朝觐队伍相关。它通常并不载人，而是象征统治者对朝觐的支持与威望，外覆华丽布帛（有时称为 kiswa 等相关织物传统），在队伍中具有强烈的仪式与政治象征意义。","在英语语境中，mahmal 多见于历史、宗教研究或博物馆/旅行写作，属于较专门的词。若只是想表达“骆驼上的轿舆”，更常见的泛称是 palanquin（轿子）或 ceremonial litter（礼舆）。"]}
{"word":"mahmoud","summary":{"en":"Mahmoud is a male Arabic name (also used as a surname) meaning “praised/commendable.”","zh":"Mahmoud 是一个阿拉伯语男性名字（也可作姓氏），意思是“受赞扬的/值得称赞的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Arabic origin (also used as a family name), meaning “praised” or “commendable.”","zh":"一个源自阿拉伯语的男性名字（也可作姓氏），意思是“受赞扬的、值得称赞的”。"},"examples":[{"en":"Mahmoud is my classmate; he moved here last year.","zh":"Mahmoud 是我的同学；他去年搬到这里。"},{"en":"Please ask Mahmoud if he can join the meeting at 3 p.m.","zh":"请问 Mahmoud 能不能在下午三点参加会议。"},{"en":"The letter was signed, “Mahmoud.”","zh":"信的落款是“Mahmoud”。"}]}],"phonetic":"/mɑːˈmuːd/","extraExplanation":["“Mahmoud”常见于阿拉伯语国家及穆斯林社群，来自词根 ḥ-m-d（与“赞美”相关），与名字“Ahmad / Muhammad / Hamid”等同源。","常见拼写变体包括：Mahmud、Mahmood。英语里通常重音在第二音节，读起来像“mah-MOOD”。","在英语写作中它是专有名词，首字母要大写；称呼他人时可直接用 Mahmoud，或搭配 Mr./Dr. 等头衔（如 Mr. Mahmoud）。"]}
{"word":"mahmudi","summary":{"en":"Mahmudi is most commonly used as a personal name (surname or given name). In some historical contexts, it can also refer to a type of coin or money name.","zh":"Mahmudi 最常见是人名（可作姓或名）；在某些历史语境中也可能指一种钱币/货币名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (a surname or given name) used in several cultures, especially in Arabic-, Persian-, and Turkish-influenced contexts; often related to the root meaning “praised.”","zh":"人名（可作姓或名），在阿拉伯语、波斯语及受土耳其文化影响的语境中较常见；常与“受赞美的/被称颂的”这一词根意义相关。"},"examples":[{"en":"Dr. Mahmudi will present the research today.","zh":"Mahmudi 博士今天将展示这项研究。"},{"en":"Her family name is Mahmudi.","zh":"她的姓是 Mahmudi。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a type of coin or money name used in parts of the Middle East and Central Asia in different periods; exact value and usage depended on the place and era.","zh":"（历史）在中东与中亚部分地区不同时期使用过的一种钱币/货币名称；具体面值与用途因地区与年代而异。"},"examples":[{"en":"The museum label mentions a mahmudi coin from that period.","zh":"博物馆的说明牌提到那个时期的一枚 mahmudi 硬币。"},{"en":"Old trade records sometimes list prices in mahmudi.","zh":"旧贸易记录有时会用 mahmudi 记价。"}]}],"synonyms":["(name) Mahmood","(name) Mahmoud","(name) Mahmud"],"phonetic":"/mɑːˈmuːdi/","extraExplanation":["“Mahmudi”常被视为与阿拉伯语词根 ḥ-m-d（赞美）相关的姓名形式，和更常见的“Mahmoud/Mahmood（马哈茂德）”在来源上相近。具体拼写（Mahmudi、Mahmoodie 等）往往随地区与转写习惯而变化。","如果你是在特定文本里看到“mahmudi”，它也可能是某个人名、家族名、地名或历史货币名。给我一句原文或出现的国家/年代，我可以帮你更准确判断是哪一种。"]}
{"word":"mahoe","summary":{"en":"A tropical tree (often the Caribbean “blue mahoe”), valued for fiber and wood.","zh":"一种热带乔木（常指加勒比的“蓝马霍树”），以纤维与木材用途闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (especially in the hibiscus family) known for its strong, useful fiber and lightweight wood; in the Caribbean, it often refers to the blue mahoe tree.","zh":"一种热带乔木（多属木槿科），以纤维坚韧、木材轻而实用著称；在加勒比地区常特指“蓝马霍树”（blue mahoe）。"},"examples":[{"en":"Blue mahoe is Jamaica’s national tree.","zh":"蓝马霍树是牙买加的国树。"},{"en":"The bark of some mahoe trees can be used to make rope or cord.","zh":"某些马霍树的树皮纤维可以用来制作绳索或绳线。"},{"en":"Craftspeople sometimes use mahoe wood for small furniture and carvings.","zh":"工匠有时用马霍木制作小型家具或雕刻品。"}]}],"synonyms":["blue mahoe","sea hibiscus"],"phonetic":"/məˈhoʊ/","extraExplanation":["“mahoe”是地区性很强的植物俗名，不同国家/岛屿可能指不同的树种：在牙买加最常见的是Hibiscus elatus（blue mahoe）；在一些英语地区也可能用来指Hibiscus tiliaceus（sea hibiscus）。遇到这个词时，常需要结合产地或上下文确认具体物种。"]}
{"word":"mahoes","summary":{"en":"“Mahoes” is the plural of “mahoe,” a Caribbean tropical tree (especially blue mahoe) and its useful wood.","zh":"“Mahoes”是“mahoe”的复数，指加勒比地区的一种热带树（尤指蓝马霍树）及其可用木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (especially the blue mahoe) native to the Caribbean; its wood is used for furniture and crafts.","zh":"一种热带树（尤指“蓝马霍树/蓝美洲锦葵树”），原产加勒比地区；其木材可用于制作家具和工艺品。"},"examples":[{"en":"Blue mahoe is prized for its attractive, multicolored wood grain.","zh":"蓝马霍树因其漂亮的多色木纹而备受珍视。"},{"en":"The artisan carved a small bowl from mahoe wood.","zh":"那位工匠用马霍木雕刻了一个小碗。"}]}],"synonyms":["blue mahoe","Caribbean mahoe"],"phonetic":"/məˈhoʊ/","extraExplanation":["“mahoes”通常是名词复数形式（单数：mahoe）。","“blue mahoe（蓝马霍树）”与牙买加关系很密切：它是牙买加的国树之一（常见于当地文化与木工制品介绍中）。","该词在日常英语中不算常见，更常出现在植物学、木材贸易、旅行/地区文化介绍里。"]}
{"word":"mahoganies","summary":{"en":"“Mahoganies” is the plural of “mahogany,” meaning mahogany trees/woods or (less commonly) mahogany-like reddish-brown color shades.","zh":"“Mahoganies”是“mahogany”的复数，可指桃花心木的树/木材，或（较少见）桃花心木般的红棕色色调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of \"mahogany\": types of mahogany trees or pieces of mahogany wood (often used for fine furniture).","zh":"“mahogany”的复数：指多种桃花心木树，或多块/多件桃花心木木材（常用于高档家具）。"},"examples":[{"en":"The workshop stores different mahoganies for different furniture styles.","zh":"那家工坊会储存不同种类的桃花心木，以适配不同的家具风格。"},{"en":"Older cabinets made from mahoganies often have a warm, rich look.","zh":"用桃花心木制作的老式橱柜常常呈现温暖、深沉的质感。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of \"mahogany\" meaning a reddish-brown color similar to mahogany wood.","zh":"“mahogany”的复数：指类似桃花心木的红棕色（多用于描述不同色调/不同版本的该颜色）。"},"examples":[{"en":"The paint catalog includes several mahoganies, from light red-brown to deep brown.","zh":"这本色卡里有好几种“桃花心木色”，从浅红棕到深棕都有。"}]}],"synonyms":["mahogany wood","hardwood","reddish-brown"],"phonetic":"/məˈhɑɡəni/","extraExplanation":["“mahogany”常指用于高档家具与乐器的硬木（如吉他背侧板）。在日常英语里说木材时更常用不可数：mahogany（例如：made of mahogany）。当你强调“不同品种/不同来源/多块木料”时才更可能看到复数 mahoganies。","在环保语境中，mahogany 有时会与“合法采伐、可持续认证（如 FSC）”一起出现；购买或描述时可能会提到来源地与认证信息。"]}
{"word":"mahoganize","summary":{"en":"Mahoganize means to stain or finish something so it looks like mahogany (a reddish-brown wood).","zh":"Mahoganize 指把表面上色/处理成像红木那样的红褐色外观。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make (wood or another surface) look like mahogany, especially by staining or polishing it a reddish-brown color","zh":"（尤指通过上色或抛光）把（木材或表面）处理成像红木（mahogany）一样的红褐色外观"},"examples":[{"en":"They mahoganized the pine doors so they would match the old furniture.","zh":"他们把松木门做了“仿红木”处理，好让它和旧家具更搭。"},{"en":"The frame was mahoganized and then sealed with a glossy finish.","zh":"这个框架先做了仿红木上色处理，然后又刷了亮光封层。"}]}],"synonyms":["stain","darken","give a mahogany finish","finish","tint"],"phonetic":"/məˈhɑːɡəˌnaɪz/","extraExplanation":["“mahoganize”比较少见，更常见的表达是“stain (it) to look like mahogany / give it a mahogany finish”。","构词上来自“mahogany（红木）+ -ize（使变成……）”，多见于木工、家具修复或装饰语境。"]}
{"word":"mahogany","summary":{"en":"Mahogany is a reddish-brown tropical hardwood, and it can also mean a deep reddish-brown color.","zh":"Mahogany 指红褐色的热带硬木（桃花心木/红木），也可指深红褐色这种颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reddish-brown hardwood from tropical trees, valued for making high-quality furniture and musical instruments","zh":"红木；桃花心木（一种带红褐色的热带硬木，常用于高档家具和乐器）"},"examples":[{"en":"The dining table is made of solid mahogany.","zh":"这张餐桌是用实心桃花心木做的。"},{"en":"Many classic guitars use mahogany for the neck or body.","zh":"许多经典吉他会用桃花心木做琴颈或琴身。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a deep reddish-brown color like mahogany wood","zh":"红褐色的；像红木颜色的"},"examples":[{"en":"She wore a mahogany coat that looked almost copper in the sun.","zh":"她穿了一件红褐色的外套，在阳光下几乎像铜色。"},{"en":"The room was painted a warm mahogany tone.","zh":"房间刷成了温暖的红褐色调。"}]}],"synonyms":["rosewood","hardwood","reddish-brown","chestnut"],"phonetic":"/məˈhɑɡəni/","extraExplanation":["“mahogany”最初指来自美洲与加勒比地区的某些树种木材，后来也常被广义用于形容类似的红褐色硬木或颜色。","在英语里，它既是木材名称，也常用作颜色词；作为颜色词时，多见于服饰、家具、室内设计等语境。","由于红木类木材与热带森林生态有关，一些地区对其贸易与采伐有更严格的法规与可持续认证（如FSC），在购买木制品时有时会提到。"]}
{"word":"mahogonies","summary":{"en":"Mahogonies is the plural of mahogany, meaning mahogany wood or mahogany trees.","zh":"Mahogonies 是 mahogany 的复数，指红木（木材）或红木树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of mahogany) a type of reddish-brown tropical hardwood, often used to make fine furniture.","zh":"（mahogany 的复数）红木；一种红褐色的热带硬木，常用于制作高档家具。"},"examples":[{"en":"These cabinets are made from imported mahogonies.","zh":"这些橱柜是用进口红木制成的。"},{"en":"The museum displayed tables crafted from different mahogonies.","zh":"博物馆展出了用不同红木制作的桌子。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of mahogany) mahogany trees; trees that produce mahogany wood (especially in the Americas).","zh":"（mahogany 的复数）红木树；可产红木的树（尤指美洲地区的品种）。"},"examples":[{"en":"Illegal logging threatens mahogonies in some regions.","zh":"在一些地区，非法砍伐威胁着红木树的生存。"},{"en":"The park protects native mahogonies and other hardwoods.","zh":"这个公园保护本地红木树和其他硬木树种。"}]}],"synonyms":["mahogany wood","hardwood","red hardwood","tropical hardwood"],"phonetic":"/məˈhɑːɡəni/","extraExplanation":["“mahogonies”是名词“mahogany”的复数形式。更常见的用法是直接说“mahogany wood”（红木材）或“mahogany trees”（红木树）。","拼写提示：美式英语常见读音为 /məˈhɑːɡəni/；复数只是在词尾加 -es：mahogany → mahogonies。"]}
{"word":"mahogony","summary":{"en":"Mahogany is a valuable tropical hardwood (and the tree it comes from), and it can also mean a deep reddish-brown color.","zh":"Mahogany 指珍贵的热带硬木（及其树），也可指深红褐色（桃花心木色）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical hardwood (or the timber from it) valued for making fine furniture because it is strong and has a rich reddish-brown color.","zh":"桃花心木；（或其木材）一种热带硬木，因坚固且呈红褐色，常用于制作高档家具。"},"examples":[{"en":"The dining table is made of mahogany and has a warm reddish-brown glow.","zh":"这张餐桌是桃花心木做的，带着温暖的红褐色光泽。"},{"en":"Antique mahogany furniture can last for generations.","zh":"古董桃花心木家具可以传好多代。"}]},{"partOfSpeech":"n.","definition":{"en":"A color like mahogany wood: a deep reddish-brown.","zh":"桃花心木色；深红褐色。"},"examples":[{"en":"She dyed her hair a mahogany brown for the winter.","zh":"冬天她把头发染成了桃花心木棕色。"},{"en":"The walls are painted in a soft mahogany shade.","zh":"墙壁刷成了柔和的桃花心木色调。"}]},{"partOfSpeech":"n.","definition":{"en":"A mahogany tree (especially in the Americas) that produces this valuable wood.","zh":"桃花心木树（尤指美洲地区的树种），能产出珍贵木材。"},"examples":[{"en":"Some mahogany trees are protected because of over-logging.","zh":"一些桃花心木树因过度砍伐而受到保护。"}]}],"synonyms":["hardwood","reddish-brown","wood"],"phonetic":"/məˈhɑːɡəni/","extraExplanation":["你输入的 **mahogony** 常见拼写错误；正确拼写是 **mahogany**。","词源上来自西非语言（常被认为与约鲁巴语有关），后来经由欧洲贸易进入英语；因其木材在殖民与贸易时代的家具制造中非常重要，词在英语里逐渐固定下来。","文化用法上，mahogany 常让人联想到“经典、庄重、传统”的室内风格（例如深色木质书房、老式图书馆等）。"]}
{"word":"mahoitre","summary":{"en":"“mahoitre” isn’t an English word; it’s probably a misspelling related to “maître d’.”","zh":"“mahoitre”不是英文词；很可能与“maître d’（餐厅领班/迎宾主管）”有关或是其误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of French-derived “maître” (often seen in English in “maître d’,” meaning the head waiter/host in a restaurant).","zh":"不是标准英文单词。很可能是法语外来词“maître”的拼写错误；在英语里常见于“maître d’”，指餐厅的领班/迎宾主管（类似领位、主管服务员）。"},"examples":[{"en":"I think you meant “maître d’,” the person who greets guests and manages seating.","zh":"我猜你想写的是“maître d’”，就是负责迎宾、安排座位的人。"},{"en":"The maître d’ found us a table by the window.","zh":"餐厅领班/迎宾主管给我们安排了靠窗的座位。"}]}],"phonetic":"/ˌmeɪtrə ˈdiː/","extraExplanation":["“maître”在法语里本义是“主人、师傅、大师”，来自拉丁语magister（导师/师长），与英语master同源。英语里最常见的固定搭配是“maître d’（maître d’hôtel的缩写）”。如果你是在写名字、地名或品牌，也可能是专有名词拼写，请给我你看到它的句子或来源我可以更准确判断。"]}
{"word":"maholi","summary":{"en":"“Maholi” is most often a place name (India). In some contexts it’s a nonstandard spelling of South Asian “mahaul/mahol,” meaning atmosphere or environment.","zh":"“Maholi”多指地名（印度）。在某些语境里也可能是南亚语言“mahaul/mahol”的非标准拼写，意为“气氛/环境”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A town/place name, especially Maholi, a locality in Uttar Pradesh, India.","zh":"（专有名词）地名：Maholi（马霍利），常指印度北方邦的一个城镇/地区。"},"examples":[{"en":"Maholi is in Sitapur district in Uttar Pradesh, India.","zh":"Maholi 位于印度北方邦锡塔布尔（Sitapur）县。"},{"en":"She grew up near Maholi before moving to Lucknow.","zh":"她在 Maholi 附近长大，后来搬去了勒克瑙（Lucknow）。"}]},{"partOfSpeech":"other","definition":{"en":"(Nonstandard in English) A transliteration/spelling variant of Hindi/Urdu “mahaul/mahol,” meaning the atmosphere, mood, or social environment of a place or situation.","zh":"（非标准英语用法）印地语/乌尔都语“mahaul/mahol”的音译/拼写变体，意思是“气氛、氛围、环境（尤其是社会氛围）”。"},"examples":[{"en":"The maholi in the room felt tense after the argument.","zh":"争吵之后，房间里的氛围（maholi）变得很紧张。"},{"en":"I like the maholi of this café—quiet and friendly.","zh":"我喜欢这家咖啡馆的氛围（maholi）——安静又友好。"}]}],"synonyms":["atmosphere","vibe","environment"],"phonetic":"/məˈhoʊli/","extraExplanation":["“Maholi”在英语里并不是常见词。你看到它时，最常见的两种情况：①作为地名（印度的 Maholi）；②作为南亚语言词“mahaul/mahol（氛围/环境）”的拉丁字母拼写变体。","如果你是在聊天或影视字幕里看到“mahol/mahaul”，更标准的拼法通常是“mahaul”，意思接近英语的 atmosphere / vibe / environment（语境不同侧重点不同）。"]}
{"word":"maholtine","summary":{"en":"“maholtine” is not recognized as a standard English word; it’s likely a misspelling or a proper name. Please share context to identify it.","zh":"“maholtine”不是常见标准英语词，更可能是拼写错误或专有名词；请提供语境以便确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a surname, a brand name, or a word from another language. Common nearby spellings you might have meant include “maltine” (an old-fashioned term related to malt extract) or “Mahatma”/“mahogany” (depending on context).","zh":"不是标准英语单词。它可能是拼写错误、人名/姓氏、品牌名，或来自其他语言的词。按拼写相近推测，你可能想写的是“maltine”（与麦芽提取物相关的旧式说法）或根据语境可能是“Mahatma/mahogany”等。"},"examples":[{"en":"I couldn’t find “maholtine” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“maholtine”——你能把看到它的句子发我吗？"},{"en":"Did you mean “maltine”? It sometimes appears in older texts about malt extract.","zh":"你是不是想写“maltine”？它有时会出现在较旧的、讨论麦芽提取物的文本里。"}]}],"phonetic":"/ˈmɑːhoʊltiːn/","extraExplanation":["“maholtine”很可能是拼写误差：如果你能提供出现它的上下文（完整句子/截图/来源网站或书名），我可以更准确判断它到底是哪一个词、应该怎么读、以及对应的含义。","也可以检查：1）是否少/多了字母（如 -ine/-line/-tine）；2）是否是专有名词（人名、产品名、地名）；3）是否是其他语言的外来词。"]}
{"word":"mahomet","summary":{"en":"“Mahomet” is an archaic English form of “Muhammad,” now generally avoided in modern usage.","zh":"“Mahomet”是“Muhammad（穆罕默德）”的旧式英语写法，现代通常不建议使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older English spelling of Muhammad, the founder of Islam; now considered archaic and often inappropriate in modern writing","zh":"（旧式英语拼写）穆罕默德；伊斯兰教的创立者。此拼写现多被视为过时，现代写作中常不建议使用"},"examples":[{"en":"In some older English books, you may see “Mahomet” where we would write “Muhammad” today.","zh":"在一些较老的英文书里，你可能会看到用“Mahomet”来指今天写作中的“Muhammad（穆罕默德）”。"},{"en":"Modern history textbooks usually avoid “Mahomet” and use “Muhammad” instead.","zh":"现代历史教材通常避免使用“Mahomet”，而改用“Muhammad”。"}]}],"synonyms":["Muhammad"],"phonetic":"/məˈhɑːmɪt/","extraExplanation":["“Mahomet”常见于中世纪到近代早期的欧洲英语文本，是对阿拉伯语“Muḥammad”的早期转写方式之一。由于当时信息来源有限，这类转写差异很大。","在当代英语语境中，“Mahomet”可能带有历史上的误解或偏见色彩，尤其在讨论伊斯兰与穆罕默德时，通常更尊重、更标准的写法是“Muhammad”。","文学与历史语境：莎士比亚时代及更早的欧洲作品中偶见“Mahomet”，多反映当时欧洲对伊斯兰世界的想象或二手叙述；阅读时可将其理解为旧称呼，而非现代推荐用法。"]}
{"word":"mahometan","summary":{"en":"Mahometan is an archaic term for “Muslim” or “Islamic,” now often considered inaccurate and offensive; use “Muslim” or “Islamic” instead.","zh":"Mahometan 是表示“穆斯林/伊斯兰的”的古旧词，如今常被认为不准确且可能冒犯；建议改用“Muslim”或“Islamic”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, now often offensive) a Muslim; a person who follows Islam.","zh":"（古旧用法，现常被视为冒犯）穆斯林；伊斯兰教的信徒。"},"examples":[{"en":"In some old books, the word “Mahometan” was used to mean “Muslim,” but it is not appropriate in modern English.","zh":"在一些旧书里，“Mahometan”曾被用来表示“Muslim（穆斯林）”，但在现代英语中并不合适。"},{"en":"Modern writers usually say “Muslim” or “Islamic,” not “Mahometan.”","zh":"现代写作者通常用“Muslim（穆斯林）”或“Islamic（伊斯兰的）”，而不用“Mahometan”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(archaic) relating to Islam; Muslim.","zh":"（古旧用法）与伊斯兰教有关的；穆斯林的。"},"examples":[{"en":"The museum label used the older phrase “Mahometan art,” but today “Islamic art” is preferred.","zh":"博物馆标签用了较旧的说法“Mahometan art”，但如今更推荐用“Islamic art（伊斯兰艺术）”。"}]}],"synonyms":["Muslim","Islamic","Mohammedan (also archaic, often offensive)"],"phonetic":"/məˈhɑmətn̩/","extraExplanation":["“Mahometan”来自早期欧洲人对先知穆罕默德（Muhammad）的称呼“Mahomet”，并把伊斯兰误解为“崇拜穆罕默德”的宗教（类似“Christian”之于“Christ”）。但伊斯兰强调只崇拜真主（Allah），因此该词带有历史误解色彩。","在当代英语里，这个词常被认为过时且带有冒犯性，尤其在描述人群或宗教身份时。更中性、准确的用法是“Muslim”（指信徒）和“Islamic”（指与伊斯兰相关的事物，如“Islamic law / Islamic art”）。","你可能会在旧文学、殖民时代文献、或历史语境中看到它。阅读时可理解为“Muslim”，但写作或日常交流中应避免使用。"]}
{"word":"mahometry","summary":{"en":"“Mahometry” is an archaic, often offensive word for Islam, based on the mistaken idea that Muslims worship Muhammad.","zh":"“Mahometry”是指伊斯兰教的古旧（常被视为冒犯的）旧称，源于把穆斯林误解为崇拜穆罕默德的错误观念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, often offensive) Islam; a mistaken old term that treats Islam as if it were a religion founded on worship of Muhammad.","zh":"（古旧用法，常被视为冒犯）伊斯兰教；一种错误的旧称，把伊斯兰教误当成“崇拜穆罕默德”的宗教。"},"examples":[{"en":"Some early European writers used “mahometry” when they actually meant Islam.","zh":"一些早期的欧洲作者用“mahometry”时，其实指的是伊斯兰教。"},{"en":"In modern writing, it’s better to avoid “mahometry” because it misrepresents Muslim beliefs.","zh":"在现代写作中，最好避免使用“mahometry”，因为它会歪曲穆斯林的信仰。"}]}],"synonyms":["Islam","Mohammedanism (dated)","Mahometanism (dated)","Muhammadanism (dated)"],"phonetic":"/məˈhɑmətri/","extraExplanation":["“mahometry”来自对“Mahomet（穆罕默德）”的旧式拼写与误解，类似于“Mohammedanism / Mahometanism（穆罕默德教）”这类旧词。它暗示穆斯林“崇拜穆罕默德”，但伊斯兰教强调只崇拜真主（Allah），穆罕默德被视为先知而非神。","如果你在历史文献、殖民时期文本或文学作品中遇到它，通常应理解为当时西方对伊斯兰教的误称；在当代语境中更推荐使用“Islam（伊斯兰教）”或“Muslim（穆斯林）”。"]}
{"word":"mahone","summary":{"en":"“Mahone” is usually a proper noun: a surname or a place name.","zh":"“Mahone”通常是专有名词：姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially found among Irish and Irish-American families.","zh":"姓氏（家族姓），在爱尔兰及爱尔兰裔美国人中较常见。"},"examples":[{"en":"My teacher’s last name is Mahone.","zh":"我老师的姓是 Mahone。"},{"en":"Detective Mahone worked on the case for months.","zh":"Mahone 探员为这个案子查了好几个月。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in some English-speaking regions (for example, in names like “Mahone Bay”).","zh":"地名用法（在英语地区的一些地名中出现，例如 “Mahone Bay”）。"},"examples":[{"en":"We stopped at Mahone Bay during our road trip.","zh":"我们自驾旅行时在 Mahone Bay 停留了一下。"},{"en":"Mahone Bay is known for its coastal scenery.","zh":"Mahone Bay 以海岸风景闻名。"}]}],"synonyms":["(surname) Malone","(surname) Mahon","(place-name element) bay"],"phonetic":"/məˈhoʊni/","extraExplanation":["“Mahone”多见于专有名词（人名/地名），通常不作为普通词汇使用。不同家族或地区的读法可能略有差异，但常见读音接近“muh-HOH-nee”。","在流行文化中，“Mahone”也可能被用作虚构人物的姓氏（例如影视作品里的角色），因此你可能会在字幕、角色表或新闻报道中看到。"]}
{"word":"mahonia","summary":{"en":"Mahonia is an evergreen shrub with spiny leaves and yellow flowers, sometimes known as Oregon grape.","zh":"Mahonia 指一种常绿带刺叶的灌木，开黄花，有些种俗称“俄勒冈葡萄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of evergreen shrub with spiny, holly-like leaves and yellow flowers, often producing blue or purple berries; a plant in the genus Mahonia (also called Oregon grape in some species).","zh":"一种常绿灌木，叶子像冬青一样带刺，开黄色花，常结蓝色或紫色浆果；属于十大功劳属（Mahonia），其中一些种也叫“俄勒冈葡萄”（Oregon grape）。"},"examples":[{"en":"Mahonia grows well in shady gardens and keeps its leaves all winter.","zh":"十大功劳很适合种在阴处的花园里，冬天也能保持绿叶。"},{"en":"In early spring, the mahonia’s yellow flowers are a bright sign that warmer weather is coming.","zh":"初春时，十大功劳的黄花很醒目，像是在提醒天气要回暖了。"}]}],"synonyms":["Oregon grape","barberry (related plant family)"],"phonetic":"/məˈhoʊniə/","extraExplanation":["“Mahonia”这个名字来自美国植物学家 Bernard McMahon（18—19世纪），用来纪念他对植物栽培与传播的贡献。","在北美，“Oregon grape”（常指 Mahonia aquifolium）有时会被用于传统草药或作为观赏植物，但日常英语里更多是在园艺、植物学语境中出现。","注意不要把“mahonia”的浆果和真正的葡萄（grape）混为一谈；“Oregon grape”是俗名，指外形或果实颜色让人联想到葡萄。"]}
{"word":"mahonias","summary":{"en":"Mahonias are evergreen ornamental shrubs (plural of mahonia), known for holly-like leaves and yellow flowers.","zh":"Mahonias 是 mahonia 的复数，指一类常绿观赏灌木，以冬青似的叶子和黄色花著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mahonia: evergreen shrubs with holly-like leaves and yellow flowers, often grown as ornamentals; some species produce blue berries.","zh":"mahonia 的复数：一种常绿灌木，叶子像冬青，开黄色花，常作观赏植物；部分品种会结蓝色浆果。"},"examples":[{"en":"Mahonias bloom early, so they add color to the garden when little else is flowering.","zh":"mahonia 开花较早，所以在其他花很少的时候也能为花园增添色彩。"},{"en":"The landscaper planted mahonias along the shaded walkway for year-round greenery.","zh":"园艺师在背阴的小路旁种了 mahonia，让那里四季常绿。"}]}],"synonyms":["Oregon grapes (common name, in some contexts)","mahonia shrubs"],"phonetic":"/məˈhoʊniəz/","extraExplanation":["“Mahonia”是一个植物属名，常见英文俗名包括 **Oregon grape**（俄勒冈葡萄）和 **barberry-like shrub**（类似小檗的灌木）。在北美园艺语境里，人们常把某些 mahonia 叫作 Oregon grape。","发音以单数 **mahonia** 为基础：复数通常直接加 -s（mahonias）。写作学术/植物百科时更常见单数属名 Mahonia（首字母大写）。"]}
{"word":"mahori","summary":{"en":"Māori refers to the Indigenous people of Aotearoa New Zealand, their culture, or their language.","zh":"Māori 指新西兰（奥特亚罗瓦）的原住民毛利人，也可指其文化或毛利语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Indigenous people of Aotearoa New Zealand, their culture, or their language","zh":"与新西兰（奥特亚罗瓦）原住民毛利人及其文化或语言有关的"},"examples":[{"en":"Māori art and carving are important parts of New Zealand’s heritage.","zh":"毛利艺术与雕刻是新西兰文化遗产的重要组成部分。"},{"en":"She is studying Māori history at university.","zh":"她在大学学习毛利历史。"}]},{"partOfSpeech":"n.","definition":{"en":"an Indigenous person of Aotearoa New Zealand","zh":"毛利人（新西兰原住民）"},"examples":[{"en":"Many Māori live in cities as well as in rural communities.","zh":"许多毛利人既生活在城市，也生活在乡村社区。"},{"en":"He is Māori, and he teaches traditional songs to children.","zh":"他是毛利人，并教孩子们传统歌曲。"}]},{"partOfSpeech":"n.","definition":{"en":"the Polynesian language traditionally spoken by the Māori people","zh":"毛利语（毛利人传统使用的波利尼西亚语）"},"examples":[{"en":"Can you say hello in Māori?","zh":"你会用毛利语说“你好”吗？"},{"en":"Māori is an official language of New Zealand.","zh":"毛利语是新西兰的官方语言之一。"}]}],"synonyms":["Indigenous New Zealander (context-dependent)","te reo Māori (the Māori language)"],"phonetic":"/ˈmaʊri/","extraExplanation":["你输入的“mahori”通常是拼写误差；标准拼写是 **Māori**（带长音符号 macron 的 ā），表示该元音读得更长。写作中尽量使用带长音的拼写，以示尊重与准确。","在英语里可作形容词或名词使用：例如“a Māori leader / Māori traditions”。作为复数时常与单数同形：\"Māori\" 既可指一位毛利人，也可指毛利人群体（语境会说明）。"]}
{"word":"mahound","summary":{"en":"“Mahound” is an archaic, often derogatory medieval European name for Muhammad, now mainly seen in historical or literary discussion.","zh":"“Mahound”是中世纪欧洲对穆罕默德的古老且常带侮辱性的称呼，如今多见于历史或文学讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old, incorrect European name for the Prophet Muhammad, often used in a hostile or insulting way in medieval Christian writing","zh":"（旧时欧洲）对穆罕默德（先知）的错误称呼，常见于中世纪基督教文献中，带有敌意或侮辱色彩"},"examples":[{"en":"In some medieval European texts, “Mahound” appears as a distorted name for Muhammad.","zh":"在一些中世纪欧洲文献中，“Mahound”被用作对穆罕默德的歪曲称呼。"},{"en":"Modern historians usually avoid the word because it is inaccurate and often derogatory.","zh":"现代历史学者通常避免使用这个词，因为它既不准确，也常带有贬义。"}]},{"partOfSpeech":"n.","definition":{"en":"a literary reference to Muhammad as a character or symbol, especially in discussions of Salman Rushdie’s novel *The Satanic Verses*","zh":"文学语境中的指称：把穆罕默德作为人物或象征来提及，尤见于讨论萨尔曼·鲁西迪小说《撒旦诗篇》时"},"examples":[{"en":"The novel’s use of “Mahound” became a major point of controversy.","zh":"小说中使用“Mahound”一词成为巨大争议点。"},{"en":"Scholars may discuss “Mahound” as a narrative device rather than a neutral historical term.","zh":"学者可能把“Mahound”讨论为一种叙事手法，而不是中性的历史用语。"}]}],"synonyms":["(historical/incorrect) Mahomet","(neutral) Muhammad"],"phonetic":"/məˈhaʊnd/","extraExplanation":["这个词源于中世纪欧洲对伊斯兰的误解与敌对叙事，常把穆罕默德“妖魔化”或与异教神祇混同，因此带有强烈历史偏见。","在当代英语中，这个词非常少见，且通常被视为冒犯性用语；除非在讨论历史文献或特定文学作品时，一般不建议使用。"]}
{"word":"mahout","summary":{"en":"A mahout is a person who trains and handles an elephant, common in South and Southeast Asia.","zh":"mahout 指“象夫”，即训练、照料并驾驭大象的人，常见于南亚与东南亚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An elephant keeper, trainer, or driver, especially in South and Southeast Asia.","zh":"（尤指南亚、东南亚的）象夫；训练或驾驭大象的人。"},"examples":[{"en":"The mahout guided the elephant calmly through the forest.","zh":"象夫沉着地引导大象穿过森林。"},{"en":"In the ceremony, the mahout decorated the elephant with colorful cloth.","zh":"在仪式中，象夫用彩布装饰大象。"}]}],"synonyms":["elephant handler","elephant keeper","elephant driver"],"phonetic":"/məˈhaʊt/","extraExplanation":["“mahout”常见于与印度、泰国、缅甸等地的大象文化相关的语境（旅游、历史、宗教仪式、王室或战争史）。在现代讨论中，也会出现在动物福利与伦理话题里（如训练方式是否人道）。","词源来自印地语/乌尔都语“mahāut”，进一步可追溯到梵语词根，含有“骑乘、驾驭（大象）的人”的意思。"]}
{"word":"mahouts","summary":{"en":"“Mahouts” means elephant handlers/trainers (plural).","zh":"“mahouts”指“象夫/驯象师”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An elephant handler or trainer, especially in South and Southeast Asia (plural form of “mahout”).","zh":"（尤指南亚与东南亚的）驯象师、象夫（“mahout”的复数）。"},"examples":[{"en":"In the old royal procession, mahouts guided the elephants through the crowded streets.","zh":"在古老的王室游行中，象夫引导大象穿过拥挤的街道。"},{"en":"The sanctuary employs experienced mahouts to care for rescued elephants.","zh":"这家保护区雇用有经验的象夫来照料获救的大象。"},{"en":"The tourists listened as the mahouts explained each elephant’s habits.","zh":"游客们听着象夫讲解每头大象的习性。"}]}],"synonyms":["elephant handlers","elephant keepers"],"phonetic":"/məˈhaʊts/","extraExplanation":["“mahout”源自印地语/乌尔都语等南亚语言（常追溯到印地语/乌尔都语 m\u000101h\u00016bt），在英语里多用于描述传统与专业的驯象工作者；在泰国、印度、斯里兰卡等地的历史、宗教与王权仪式中常见。","在现代语境中，相关讨论有时会涉及动物福利与旅游业：有些机构强调“照护者/护象人”的角色与更温和的训练方式。"]}
{"word":"mahra","summary":{"en":"Mahra usually refers to a region in eastern Yemen (Al Mahrah) and related people/language; it can also be a personal name.","zh":"Mahra 通常指也门东部的马赫拉地区（Al Mahrah）及其相关人群/语言；也可作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region/governorate in eastern Yemen on the Arabian Sea, bordering Oman; also used to refer to its local people (the Mahra/Mahri).","zh":"马赫拉（也作马哈拉）：也门东部靠阿拉伯海、与阿曼接壤的一个地区/省名；也可指当地居民（马赫拉人/马赫里人）。"},"examples":[{"en":"Al Mahrah is a governorate in eastern Yemen.","zh":"马赫拉是也门东部的一个省（行政区）。"},{"en":"Some families in Mahra have cultural ties with neighboring Oman.","zh":"马赫拉的一些家庭与邻国阿曼在文化上有联系。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mahri language, a Modern South Arabian language spoken by some people in the Mahra region and nearby areas.","zh":"马赫里语（Mahri）：一种现代南阿拉伯语族语言，在马赫拉地区及周边部分人群中使用。"},"examples":[{"en":"Mahri is different from Arabic, though many speakers also know Arabic.","zh":"马赫里语与阿拉伯语不同，不过许多使用者也会阿拉伯语。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name used in some cultures (often a transliteration; the exact meaning depends on the original language and spelling).","zh":"人名“Mahra”（多为音译名；具体含义取决于原始语言与拼写来源）。"},"examples":[{"en":"Mahra introduced herself at the meeting.","zh":"Mahra 在会上做了自我介绍。"}]}],"synonyms":["Al Mahrah","Mahrah","Mahri"],"phonetic":"/ˈmɑːrə/","extraExplanation":["“Mahra”在英语里多见于专名：地名常写作 **Al Mahrah / Al Mahra**（阿拉伯语冠词 *al-* 表“the”），语言名常写作 **Mahri**。不同拼写（Mahra/Mahrah/Mahri）在新闻与学术文本中都可能出现。"]}
{"word":"mahran","summary":{"en":"Mahran is most commonly used as a male given name (often spelled Mehran), and it can also be a surname or a less common place name.","zh":"Mahran 最常见为男性名字（常见拼写为 Mehran），也可作姓氏，偶尔还会作为地名出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name, used especially in Persian- and Arabic-speaking communities (also commonly spelled “Mehran”).","zh":"男性名字，常见于波斯语和阿拉伯语社群（也常见拼写为“Mehran/Mehrān”）。"},"examples":[{"en":"Mahran moved to the U.S. for graduate school.","zh":"Mahran 为了读研究生搬到了美国。"},{"en":"In this story, Mahran is the main character.","zh":"在这个故事里，Mahran 是主角。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname) in some regions.","zh":"在一些地区也可作姓氏。"},"examples":[{"en":"Dr. Mahran will see you now.","zh":"Mahran 医生现在可以接诊你了。"},{"en":"I emailed Ms. Mahran about the schedule.","zh":"我给 Mahran 女士发邮件询问了日程。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in some countries (less common; used in certain local names).","zh":"一些国家中的地名用法（较少见；多见于特定地区的专名）。"},"examples":[{"en":"The report mentioned a village called Mahran.","zh":"报告提到一个叫 Mahran 的村庄。"}]}],"synonyms":["Mehran","Mihran"],"phonetic":"/mɑːˈrɑːn/","extraExplanation":["“Mahran”更常见的转写是“Mehran/Mehrān”，与波斯语词根“mehr(مهر)”有关，常与“爱、亲和、太阳/光明”等意象相关（不同地区解释可能略有差异）。","作为人名时，英语里通常按重音落在第二音节来读；在正式文件中，拼写可能因护照或地区转写规则而不同（如 Mehran, Mihran 等）。"]}
{"word":"mahratta","summary":{"en":"Mahratta is an older spelling of Maratha, referring to the Maratha people of western India or things related to them.","zh":"Mahratta是Maratha的旧拼写，指印度西部的马拉塔人或与其相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Maratha people of western India (especially Maharashtra); an older spelling of “Maratha.”","zh":"（印度西部，尤指马哈拉施特拉邦的）马拉塔人；“Maratha”的旧拼写。"},"examples":[{"en":"In the 18th century, the British often wrote “Mahratta” in their reports.","zh":"在18世纪，英国人在报告中常把“Maratha”写作“Mahratta”。"},{"en":"The novel mentions Mahratta horsemen riding across the Deccan.","zh":"小说提到马拉塔骑兵在德干高原上驰骋。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Maratha people, their language, or their history; an older spelling of “Maratha.”","zh":"与马拉塔人、其语言或历史相关的；“Maratha”的旧拼写。"},"examples":[{"en":"The museum has a small Mahratta coin collection.","zh":"博物馆有一小批马拉塔钱币收藏。"},{"en":"She is studying Mahratta history under the Mughal and later British periods.","zh":"她在研究莫卧儿时期及其后英国时期的马拉塔历史。"}]}],"synonyms":["Maratha","Marathi (related term)"],"phonetic":"/məˈrɑːtə/","extraExplanation":["“Mahratta”主要见于较早的英语资料（尤其是殖民时期的拼写），现代英语更常用“Maratha”。","马拉塔（Maratha）与“马拉地语/马拉提语（Marathi）”有关：Marathi是语言名，Maratha多指族群/历史政权相关。"]}
{"word":"mahri","summary":{"en":"Mahri refers to the Mahra people/culture or their language (Mehri), spoken mainly in Yemen and Oman.","zh":"Mahri 指马赫拉人/文化，或马赫里语（Mehri语），主要在也门和阿曼使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Mahra region (especially in eastern Yemen and western Oman), or relating to that people/culture","zh":"马赫拉地区（主要在也门东部、阿曼西部）的人；或与该族群/文化有关的"},"examples":[{"en":"She met a Mahri family while traveling in eastern Yemen.","zh":"她在也门东部旅行时遇到了一户马赫里家庭。"},{"en":"Mahri traditions include distinctive poetry and music.","zh":"马赫里传统中有很有特色的诗歌和音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mehri language, a Modern South Arabian language spoken mainly in Yemen and Oman","zh":"马赫里语（Mehri语）：一种现代南阿拉伯语系语言，主要在也门和阿曼使用"},"examples":[{"en":"He can speak Mahri as well as Arabic.","zh":"他既会说马赫里语，也会说阿拉伯语。"},{"en":"Mahri is less widely taught than Arabic.","zh":"马赫里语的教学普及度不如阿拉伯语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mahra people or the Mahri language","zh":"马赫拉人/马赫里语的；与其有关的"},"examples":[{"en":"They recorded a Mahri folk song.","zh":"他们录制了一首马赫里民歌。"},{"en":"The museum displayed Mahri cultural artifacts.","zh":"博物馆展出了马赫里文化文物。"}]}],"synonyms":["Mehri"],"phonetic":"/ˈmɑːri/","extraExplanation":["“Mahri”常见于语言学与人类学语境，也会拼作“Mehri”。它属于“现代南阿拉伯语”（Modern South Arabian）的一支，与阿拉伯语同属闪语族，但不是阿拉伯语的方言。","在新闻或历史文本中，“Mahra/Mahri”也可能指马赫拉地区或马赫拉苏丹国（历史政权）相关的人与事。"]}
{"word":"mahseer","summary":{"en":"Mahseer is a large Asian freshwater fish (carp-like), well known as a powerful sport fish.","zh":"Mahseer 指一种亚洲大型淡水鱼（类似鲤科鱼），以力气大、适合运动垂钓而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large freshwater fish (a type of carp) found in South and Southeast Asia, famous as a strong game fish","zh":"马哈鱼（mahseer）：南亚和东南亚常见的一种大型淡水鱼（属鲤科相关类群），以力量大、适合垂钓而闻名"},"examples":[{"en":"The mahseer is known for powerful runs, so anglers use strong line.","zh":"马哈鱼以冲力强著称，所以钓鱼人会用更结实的鱼线。"},{"en":"Conservation groups are working to protect mahseer habitats in Himalayan rivers.","zh":"一些环保组织正在努力保护喜马拉雅河流中的马哈鱼栖息地。"}]}],"synonyms":["game fish","freshwater carp (general)"],"phonetic":"/ˌmɑːˈsɪr/","extraExplanation":["“Mahseer”常见于钓鱼文章、自然纪录片与南亚生态讨论中，尤其与印度、尼泊尔、不丹等地的山地河流相关。","在英语里它通常指Tor属等几种近缘鱼类（不同地区可能指不同具体物种），因此在科研或保护语境中常会搭配具体拉丁学名来避免混淆。"]}
{"word":"mahsir","summary":{"en":"Mahsir (more commonly spelled mahseer) is a large South Asian freshwater fish, often known as a prized game fish.","zh":"Mahsir（更常见拼写为 mahseer）是一种南亚大型淡水鱼，常被视为著名的游钓鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large freshwater fish found in South and Southeast Asia, especially India and the Himalayan region; often valued as a game fish","zh":"一种产于南亚与东南亚的大型淡水鱼，尤见于印度及喜马拉雅地区；常被视为“游钓鱼”（运动钓鱼的目标鱼）"},"examples":[{"en":"The river is famous for mahseer, a powerful fish that many anglers hope to catch.","zh":"这条河以马西尔鱼闻名，它力量很大，许多钓鱼爱好者都想钓到。"},{"en":"Mahseer populations have declined in some areas because of dams and habitat loss.","zh":"由于水坝建设与栖息地破坏，一些地区的马西尔鱼数量已经减少。"}]}],"synonyms":["mahseer","Tor (genus)"],"phonetic":"/mɑːˈsɪr/","extraExplanation":["“mahsir”更常见的拼写是“mahseer”。它通常指鲤科（Cyprinidae）中“Tor（马口鱼属/马西尔鱼属）”等相关鱼类，在印度、尼泊尔、不丹等地的河流文化与运动钓鱼传统中很有名。","在旅游/钓鱼语境里，你可能会看到“golden mahseer（金马西尔鱼）”“Himalayan mahseer（喜马拉雅马西尔鱼）”等说法，用来指不同地区或外观较典型的种类。"]}
{"word":"mahsur","summary":{"en":"Mahsur is a Turkish word sometimes used in English contexts to mean “trapped/confined” or “besieged/surrounded.”","zh":"Mahsur 多为土耳其语词，在英语语境中偶尔出现，意思是“被困/受限”或“被围困/被包围”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mostly Turkish; rare in everyday English) trapped, confined, or unable to escape.","zh":"（多见于土耳其语语境；英语日常中很少用）被困的、被困住的；无法脱身的。"},"examples":[{"en":"We were mahsur in the hotel because of the heavy snow.","zh":"大雪让我们被困在旅馆里，出不去。"},{"en":"The hikers were mahsur between two flooded rivers.","zh":"徒步者被两条暴涨的河流夹在中间，困住了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In some Turkish/Arabic-influenced contexts) besieged; surrounded so movement is restricted.","zh":"（在受土耳其语/阿拉伯语影响的语境中）被围困的；被包围以致行动受限的。"},"examples":[{"en":"The village was mahsur for days after the roads were blocked.","zh":"道路被封后，这个村庄被围困了好几天。"},{"en":"They felt mahsur by endless paperwork and deadlines.","zh":"他们觉得被无尽的文件和截止期“困住了”。"}]}],"synonyms":["trapped","stuck","stranded","confined","hemmed in","besieged"],"phonetic":"/mɑːˈsʊr/","extraExplanation":["“mahsur”在土耳其语里很常见，常搭配动词短语 **mahsur kalmak**（字面“保持被困状态”），意思是“被困住/困在某处”。在标准英语里并不是常用词；如果你是在英语写作中表达这个意思，更自然的说法是 **trapped / stuck / stranded / confined**。","如果你想查的是英语单词，可能你想输入的是 **mansour / mahsul / mahzur** 等相近拼写。告诉我你看到它的句子或语言来源，我可以帮你确认。"]}
{"word":"mahu","summary":{"en":"Mahu is a Hawaiian/Polynesian term for a traditional third-gender identity, involving both masculine and feminine spirit.","zh":"Mahu 是夏威夷/波利尼西亚文化中的词，指一种传统的第三性别身份，体现兼具男性与女性的气质/精神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Hawaiian and some other Polynesian cultures) a person who embodies both masculine and feminine spirit; a traditional third-gender identity.","zh":"（夏威夷及部分波利尼西亚文化中）兼具男性与女性气质/精神的人；一种传统的“第三性别”身份认同。"},"examples":[{"en":"In Hawaiian culture, mahu have long held respected roles as teachers and caretakers.","zh":"在夏威夷文化中，mahu 长期以来常担任受尊重的角色，例如教师与照护者。"},{"en":"It’s important to use the word mahu with cultural respect and in the right context.","zh":"使用 mahu 这个词时，重要的是要尊重其文化背景，并在合适的语境中使用。"}]}],"synonyms":["third-gender person","gender-diverse person"],"phonetic":"/ˈmɑːhuː/","extraExplanation":["“Māhū”（常写作 mahu）是来自夏威夷语的文化词汇，指一种传统性别角色与身份，不完全等同于现代英语里的 “transgender（跨性别）” 或 “non-binary（非二元）”。在不同岛屿与社群中含义与接受度可能不同。","拼写上常见带长音符号的 “māhū”；不带符号的写法在英语文本中也很常见。由于历史上的殖民与宗教影响，这个词在某些时期曾被污名化；当代语境里更强调其文化与身份的尊重性用法。"]}
{"word":"mahua","summary":{"en":"Mahua is a Chinese twisted, deep-fried dough snack, often sweet or sesame-flavored.","zh":"Mahua（麻花）是一种拧成麻花状后油炸的中国传统小吃，常带甜味或芝麻香。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese snack made by twisting strips of dough and deep-frying them until crisp; often lightly sweetened or flavored with sesame.","zh":"麻花：一种中国传统小吃，把面团搓成长条后拧成麻花状油炸至酥脆；常带甜味或芝麻等风味。"},"examples":[{"en":"I bought a bag of mahua at the Asian supermarket.","zh":"我在亚洲超市买了一袋麻花。"},{"en":"This mahua is crispy and slightly sweet.","zh":"这个麻花很酥脆，带一点甜味。"},{"en":"In some places, people eat mahua with tea as a snack.","zh":"在一些地方，人们会配着茶吃麻花当点心。"}]}],"synonyms":["twisted fried dough","fried dough twist","Chinese fried dough twist"],"phonetic":"/ˈmɑːhwɑː/","extraExplanation":["“mahua”多见于菜单、零食包装或海外华人社区的英文表达，本质上是对中文“麻花（máhuā）”的音译。更正式的英文写法有时会写成“ma hua”或直接写“twisted fried dough / fried dough twist”。","麻花在中国各地做法略有不同：有的更甜更硬脆，有的更松软；常见口味包括芝麻、红糖、蜂蜜等。作为伴手礼或街头小吃都很常见。"]}
{"word":"mahuang","summary":{"en":"Mahuang (ma huang) is a traditional Chinese herb (ephedra) used for breathing and cold symptoms, but it contains stimulants like ephedrine and may have safety/legal restrictions.","zh":"Mahuang（麻黄）是传统中药（麻黄属/ephedra），用于呼吸与感冒类症状，但含麻黄碱等兴奋性成分，可能有安全与法规限制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Chinese medicinal herb (Ephedra sinica), historically used to help relieve asthma, nasal congestion, and cold symptoms; it contains stimulant chemicals such as ephedrine.","zh":"麻黄（中药；草本植物，学名 Ephedra sinica），传统上用于缓解哮喘、鼻塞和感冒症状；含有麻黄碱等兴奋性成分。"},"examples":[{"en":"In traditional Chinese medicine, mahuang is often used in formulas for wind-cold symptoms like chills and a runny nose.","zh":"在中医里，麻黄常用于“风寒”类方剂，比如怕冷、流清涕等症状。"},{"en":"The label said the supplement contained mahuang, so the doctor warned him about possible side effects.","zh":"标签上写着补充剂含有麻黄，所以医生提醒他注意可能的副作用。"}]}],"synonyms":["ma huang","ephedra","Chinese ephedra","Ephedra sinica"],"phonetic":"/ˌmɑː ˈhwɑːŋ/","extraExplanation":["“麻黄”在英文里常写作 ma huang 或 mahuang，也常被称为 ephedra / Chinese ephedra（麻黄属植物）。","由于含麻黄碱（ephedrine），它可能导致心跳加快、血压升高、焦虑与失眠等风险；在一些国家和地区，含麻黄碱的减肥/提神类产品曾引发安全争议并受到监管或限制。","在学习与使用相关英文时，可注意语境差异：在中医语境多指药材；在保健品/药理语境常与 ephedrine、stimulant（兴奋剂）、banned/restricted（被禁/受限）等词一起出现。"]}
{"word":"mahuangs","summary":{"en":"“Mahuangs” means “mahuang” plants (Ephedra) in plural, often discussed in traditional medicine and in safety/regulation contexts because of stimulant compounds.","zh":"“Mahuangs”是“mahuang（麻黄）”的复数，指麻黄属（Ephedra）植物；常见于传统用药与因兴奋性成分而引发的安全/监管讨论中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mahuang: a group of desert shrubs (Ephedra) used in traditional Chinese medicine; the plant is a natural source of ephedrine-like stimulants.","zh":"mahuang（麻黄）的复数：指一类生长在干旱地区的麻黄属（Ephedra）灌木；在中医中被使用，含有类似麻黄碱的兴奋性成分。"},"examples":[{"en":"Some traditional formulas include mahuangs to help with cold-related congestion.","zh":"一些传统方剂会加入麻黄类药材，用于缓解感冒引起的鼻塞。"},{"en":"The label warned that products containing mahuangs may raise heart rate and blood pressure.","zh":"标签警告说，含麻黄类成分的产品可能会升高心率和血压。"}]}],"synonyms":["ephedra","Ephedra","Chinese ephedra","ma huang"],"phonetic":"/ˈmɑˌhwɑŋ/","extraExplanation":["“麻黄（mahuang）”在中医语境里常与“发汗、宣肺、平喘”等功效相关，但在现代医学与监管语境中更常被讨论的是其所含的麻黄碱（ephedrine）及类似物的刺激作用与安全风险。","在英语里，mahuang/ma huang 有时也直接指含麻黄提取物的减肥或提神产品；在美国等地，含麻黄碱类成分的膳食补充剂曾因安全问题受到严格限制或禁售。阅读英文材料时要区分：指植物本身 vs. 指提取物/产品。"]}
{"word":"mahwa","summary":{"en":"Manhwa (often misspelled as “mahwa”) means a Korean comic or graphic novel, frequently read online.","zh":"Manhwa（常被误写为“mahwa”）指韩国漫画/图像小说，常见于线上阅读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Korean comic or graphic novel, especially one published in Korea or in a Korean style (often read digitally).","zh":"“韩漫”；韩国的漫画或图像小说，尤指在韩国出版或具有韩式风格的作品（常以数字形式阅读）。"},"examples":[{"en":"I’ve been reading a romance manhwa on my phone.","zh":"我一直在手机上看一部恋爱题材的韩漫。"},{"en":"This manhwa was adapted into a drama series.","zh":"这部韩漫被改编成了电视剧。"}]}],"synonyms":["Korean comic","webtoon (often related, not identical)"],"phonetic":"/ˈmænwə/","extraExplanation":["你输入的“mahwa”更常见的拼写是“manhwa”（韩语：만화）。英文里通常用“manhwa”指韩国漫画，用“manga”指日本漫画，用“manhua”指中文漫画（中国/华语圈）。","在网络语境里，很多人也会用“webtoon”来指在平台上竖屏滚动阅读的数字漫画；webtoon不一定都是韩漫，但韩国作品非常常见。"]}
{"word":"mahzor","summary":{"en":"A Jewish festival prayer book, especially for Rosh Hashanah and Yom Kippur.","zh":"犹太教节期祷告书，尤用于犹太新年与赎罪日等重大节日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish prayer book used especially for the High Holy Days (Rosh Hashanah and Yom Kippur) and sometimes other festivals.","zh":"（犹太教）节期祷告书，尤指用于犹太新年（Rosh Hashanah）和赎罪日（Yom Kippur）等“重大节日”的祈祷书。"},"examples":[{"en":"Many synagogues provide a mahzor for services on Rosh Hashanah.","zh":"许多会堂在犹太新年礼拜时会提供一本 mahzor。"},{"en":"She followed the prayers in the mahzor during Yom Kippur.","zh":"在赎罪日她跟着 mahzor 里的祈祷文一起诵读。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A cycle or round (from Hebrew), especially a liturgical cycle.","zh":"（较少见）循环、轮回；（源自希伯来语）也可指礼仪周期。"},"examples":[{"en":"In Hebrew, the word can also refer to a cycle or recurring round.","zh":"在希伯来语中，这个词也可指“循环”或“周而复始的一轮”。"}]}],"synonyms":["High Holy Day prayer book","Jewish festival prayer book"],"phonetic":"/ˈmɑx.zɔr/","extraExplanation":["Mahzor（复数常见为 mahzorim）来自希伯来语 מַחְזוֹר（machzor），字面含义与“循环、轮回”相关，因为许多节期祷文会按年度循环使用。","读音中的“hz/kh”常对应类似德语 Bach 的清擦音（/x/）；英语里有时会近似读成 /k/ 或 /h/，不同社群与地区会有差异。"]}
{"word":"mahzorim","summary":{"en":"“Mahzorim” are High Holy Day Jewish prayer books (plural of machzor/mahzor).","zh":"“mahzorim”指犹太教用于重要节期（尤其犹太新年与赎罪日）的祈祷书（machzor/mahzor 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) High Holy Day prayer books; plural of “machzor/mahzor,” a Jewish prayer book used especially for Rosh Hashanah and Yom Kippur services.","zh":"（犹太教）《节期祈祷书》；“machzor/mahzor（节期祈祷书）”的复数，主要用于犹太新年（Rosh Hashanah）与赎罪日（Yom Kippur）等重要节期礼拜。"},"examples":[{"en":"The synagogue put extra mahzorim on the shelves for the High Holy Days.","zh":"会堂在节期前把更多的 mahzorim 放到书架上，供“犹太新年与赎罪日”使用。"},{"en":"I borrowed a mahzor, and my friend showed me how to find the prayers for Yom Kippur.","zh":"我借了一本 mahzor，我朋友教我怎么找到赎罪日的祈祷文。"}]}],"synonyms":["High Holy Day prayer books","machzorim"],"phonetic":"/ˈmɑːxˌzɔːrɪm/","extraExplanation":["“mahzorim”来自希伯来语复数形式（-im 结尾常表示阳性复数）。英文中更常见的单数拼写是 **machzor**（也写作 **mahzor**），发音里常把“ch”读成喉音/kh（类似德语 Bach 的音），但在英语环境里也可能被读得更接近 /k/ 或 /h/。","与 **siddur**（日常祈祷书）不同，**machzor/mahzor**通常专用于节期，尤其是“High Holy Days”（犹太新年与赎罪日）礼拜中较长、较特别的祷文与仪式。"]}
{"word":"mahzors","summary":{"en":"“Mahzors” means Jewish festival prayer books (plural of “mahzor”), especially for Rosh Hashanah and Yom Kippur.","zh":"“mahzors”指犹太教节期祈祷书（“mahzor”的复数），尤用于犹太新年与赎罪日等高圣日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “mahzor”) a Jewish prayer book used especially for the High Holy Days (Rosh Hashanah and Yom Kippur) and other major festivals.","zh":"（“mahzor”的复数）犹太教的节期祈祷书，尤指在犹太新年（Rosh Hashanah）与赎罪日（Yom Kippur）等“高圣日”以及其他重要节日使用。"},"examples":[{"en":"The synagogue handed out mahzors before the Rosh Hashanah service began.","zh":"会堂在犹太新年礼拜开始前发放了mahzors（节期祈祷书）。"},{"en":"I brought my own mahzors for the High Holy Days so I could follow along easily.","zh":"为了在高圣日期间更容易跟上仪式，我带了自己的mahzors（节期祈祷书）。"}]}],"synonyms":["machzorim","festival prayer books","High Holy Day prayer books"],"phonetic":"/ˈmɑzɔr/","extraExplanation":["“mahzor”来自希伯来语 מַחְזוֹר（machzor），字面有“循环/周期”的意思，指一年中按节期循环使用的礼仪文本。英语里更常见的复数是“mahzorim”，但在口语或非正式写法中也会看到“mahzors”。","在很多英语语境中，人们会用“machzor/mahzor”指“高圣日祈祷书”，与日常使用的犹太祈祷书“siddur（西杜尔）”相区分。"]}
