{"word":"Maia","summary":{"en":"Maia is most commonly a female name. It can also refer to a figure in Greek mythology (mother of Hermes) or a star in the Pleiades cluster.","zh":"Maia 最常见是女性名字；也可指希腊神话中的人物（赫尔墨斯之母），或指昴星团中的一颗恒星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (often used in English and other languages)","zh":"女性名字（英语及其他语言中常见）"},"examples":[{"en":"Maia is starting her first year at college this fall.","zh":"Maia 今年秋天要开始读大学一年级。"},{"en":"We named our daughter Maia because we liked the sound and meaning.","zh":"我们给女儿取名叫 Maia，因为喜欢它的读音和寓意。"}]},{"partOfSpeech":"n.","definition":{"en":"in Greek mythology, one of the Pleiades and the mother of Hermes","zh":"（希腊神话）昴宿七姊妹之一，赫尔墨斯之母"},"examples":[{"en":"In Greek myths, Hermes is the son of Zeus and Maia.","zh":"在希腊神话中，赫尔墨斯是宙斯和玛亚（Maia）的儿子。"},{"en":"The Pleiades include Maia, a figure later linked to spring and growth.","zh":"昴宿七姊妹中有 Maia，这一形象后来常与春天和生长联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"a star in the Pleiades cluster (also called Maia) in the constellation Taurus","zh":"（天文学）金牛座昴星团中的一颗恒星：昴宿四（也称 Maia）"},"examples":[{"en":"Through binoculars, you can see the Pleiades; one of its bright stars is Maia.","zh":"用双筒望远镜可以看到昴星团；其中一颗亮星叫 Maia。"},{"en":"Maia is part of the Pleiades in the constellation Taurus.","zh":"Maia 属于金牛座的昴星团。"}]}],"synonyms":["Maya (variant spelling)"],"phonetic":"/ˈmaɪ.ə/","extraExplanation":["“Maia”在英语里通常作为人名出现，读音是两个音节：MY-uh（重音在前）。","在罗马文化中，Maia也与“成长、丰饶、春天”有关；英语单词“May（五月）”常被认为与她的名字有关联（在大众文化中很常这样解释）。"]}
{"word":"maia","summary":{"en":"Maia is most commonly a female name; it can also refer to a figure in Greek mythology (mother of Hermes) and to a star in the Pleiades.","zh":"Maia 最常见是女性名字；也可指希腊神话中的人物（赫尔墨斯之母）以及昴宿星团中的一颗恒星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A female given name used in many languages.","zh":"（专有名词）女性名字，在多种语言中使用。"},"examples":[{"en":"Maia is starting a new job next week.","zh":"Maia 下周要开始一份新工作。"},{"en":"I met Maia at a language exchange event.","zh":"我在一次语言交流活动上认识了 Maia。"}]},{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A nymph (one of the Pleiades) and the mother of Hermes by Zeus.","zh":"（希腊神话）宁芙女神之一（昴宿星团“七姐妹”之一），宙斯与她生下了赫尔墨斯（Hermes）。"},"examples":[{"en":"In Greek mythology, Maia is known as the mother of Hermes.","zh":"在希腊神话中，Maia 以赫尔墨斯之母而闻名。"},{"en":"The story of Maia appears in lessons about the Olympian gods.","zh":"关于 Maia 的故事常出现在讲解奥林匹斯诸神的课程里。"}]},{"partOfSpeech":"n.","definition":{"en":"Astronomy: One of the bright stars in the Pleiades cluster (in the constellation Taurus).","zh":"（天文学）昴宿星团中的一颗亮星（位于金牛座）。"},"examples":[{"en":"Maia is a star name found in the Pleiades.","zh":"Maia 是昴宿星团中的一颗恒星名。"},{"en":"On clear nights, you can spot the Pleiades, which include Maia.","zh":"在晴朗的夜晚，你能看到昴宿星团，其中包括 Maia。"}]}],"synonyms":["Mayah (variant spelling)","Maja (variant spelling in some languages)"],"phonetic":"/ˈmaɪ.ə/","extraExplanation":["“Maia”在英文里最常见的用法是人名；作为神话名和星名时通常会大写。","读音常见为 /ˈmaɪ.ə/（类似“MY-uh”），不同语言/地区可能有不同读法与拼写（如 Maja）。","与“May（五月）”有时会被联想到：罗马神话里也有名为 Maia 的女神/母神形象，且“May”被认为可能与 Maia 有关联（属于文化与词源层面的常见说法）。"]}
{"word":"maiacca","summary":{"en":"“Maiacca” is not a common English word; it is usually a proper name (often a surname).","zh":"“Maiacca”不是常见英文单词；通常是专有名词（多为姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (most often a surname) rather than a standard English vocabulary word.","zh":"一个较少见的专有名词（多见为姓氏），而不是常见的英文词汇。"},"examples":[{"en":"Ms. Maiacca will join the meeting at 3 p.m.","zh":"Maiacca 女士将于下午三点参加会议。"},{"en":"The article was written by Dr. Maiacca.","zh":"这篇文章由 Maiacca 博士撰写。"}]}],"phonetic":"/maɪˈækə/","extraExplanation":["“Maiacca”在常见英语词典里通常找不到作为普通词汇的释义，更常见的是人名/姓氏（可能来源于意大利语等语言）。","如果你是想查某个英文单词的拼写，可能接近的有：\n- “Mayaca”（一种水生植物属名，常见于生物学语境）\n- “maca”（玛咖，一种植物/保健品语境）\n你可以告诉我你看到它的句子或领域（比如植物学、人名、地名），我能更准确地确认。"]}
{"word":"maianthemum","summary":{"en":"Maianthemum: a genus of woodland plants, often known as false lily-of-the-valley.","zh":"Maianthemum：一种林地植物属，常被称为“假铃兰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of woodland flowering plants in the lily-of-the-valley group (family Asparagaceae), including species often called false lily-of-the-valley.","zh":"一种林地开花植物属（天门冬科、铃兰类群），其中一些物种常被称为“假铃兰”。"},"examples":[{"en":"Maianthemum canadense is often called false lily-of-the-valley in North America.","zh":"在北美，Maianthemum canadense 常被称为“假铃兰”。"},{"en":"In spring, maianthemum spreads through shady forests with small white flowers.","zh":"春天里，maianthemum 会在阴凉的森林中蔓延，开出小小的白花。"}]}],"synonyms":["false lily-of-the-valley","May lily"],"phonetic":"/ˌmaɪænˈθiːməm/","extraExplanation":["这是一个植物学属名，通常在园艺、野外识别或科普文章中出现；日常英语里更常用的是它的俗名（例如 false lily-of-the-valley）。","词源上可拆理解为“Maia（五月/春季的意象）+ anthemon（希腊语，花）”，暗示其春季开花的特征。"]}
{"word":"maid","summary":{"en":"“Maid” most commonly means a female domestic worker (or hotel cleaner). In older or literary English, it can also mean a young unmarried woman, as in “maid of honor.”","zh":"“maid”最常指女佣/清洁人员；在较旧或文学语境中也可指未婚少女，如“maid of honor（首席伴娘）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman or girl employed to do housework or cleaning for a family or in a hotel","zh":"女佣；女仆（受雇做家务或清洁工作的人，也可指酒店清洁人员）"},"examples":[{"en":"The maid cleans the rooms every morning.","zh":"女佣每天早上打扫房间。"},{"en":"They hired a maid to help with cooking and laundry.","zh":"他们雇了一位女佣帮忙做饭和洗衣。"}]},{"partOfSpeech":"n.","definition":{"en":"an old-fashioned word meaning an unmarried young woman; also used in titles like “maid of honor”","zh":"（旧式）未婚女子；也用于头衔中，如“maid of honor（伴娘/首席伴娘）”"},"examples":[{"en":"In old stories, the knight saved a young maid.","zh":"在古老故事里，骑士救了一位少女。"},{"en":"Her sister was the maid of honor at the wedding.","zh":"她的姐姐在婚礼上担任首席伴娘。"}]}],"synonyms":["housekeeper","cleaner","domestic worker"],"phonetic":"/meɪd/","extraExplanation":["“maid”在现代英语里主要指做家务/清洁工作的女性雇员，但这个词带有一定的历史感，有时会让人联想到旧时代的阶级与服务关系。日常更中性、更常见的说法是“housekeeper（家政人员）”或“cleaner（清洁工）”。在酒店语境中常见“hotel maid”或更正式的“housekeeping staff”。","词源上，maid原意与“少女/未婚女子”有关，所以在文学或古风语境中仍能看到这种用法（如“fair maid”）。"]}
{"word":"maida","summary":{"en":"Maida is refined white wheat flour widely used in South Asian cooking and baking.","zh":"Maida 指南亚地区常用的精制白小麦粉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A finely milled, refined wheat flour commonly used in South Asian (especially Indian) cooking for breads, pastries, and fried snacks.","zh":"一种细磨的精制小麦粉，常用于南亚（尤其印度）料理制作面包、点心和油炸小吃。"},"examples":[{"en":"She used maida to make samosas with a crisp outer shell.","zh":"她用 maida 做了萨莫萨，外皮酥脆。"},{"en":"Many Indian bakeries use maida for cakes and cookies.","zh":"许多印度烘焙店用 maida 来做蛋糕和饼干。"},{"en":"This recipe calls for half maida and half whole-wheat flour.","zh":"这个食谱要求一半用 maida，一半用全麦面粉。"}]}],"synonyms":["refined wheat flour","white flour","all-purpose flour (similar)"],"phonetic":"/ˈmaɪdə/","extraExplanation":["“Maida”是印度英语中很常见的食材词，源自印地语/乌尔都语等南亚语言语境。它通常指经过高度精制、颜色更白、麸皮和胚芽含量更低的面粉，因此口感更细腻，适合做酥皮、甜点和松软面点。与普通英语里的“all-purpose flour（中筋面粉）”有重叠，但在不同国家精制度和蛋白质含量可能不完全一致。"]}
{"word":"maidan","summary":{"en":"Maidan means a public square; in news contexts, “the Maidan” often refers to Kyiv’s Independence Square and sometimes the protest movement linked to it.","zh":"maidan 指“广场/公共空地”；在新闻语境中，“the Maidan”常特指基辅独立广场，并可引申指与其相关的抗议运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a public square or open gathering place (especially in Eastern Europe, Russia, and Central Asia).","zh":"（尤指东欧、俄罗斯和中亚的）广场；公共集会空地。"},"examples":[{"en":"People met in the maidan to celebrate the holiday.","zh":"人们在广场上聚会庆祝节日。"},{"en":"The market stalls filled the maidan every weekend.","zh":"每个周末，集市摊位都会摆满广场。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) the central square in Kyiv, Ukraine—Maidan Nezalezhnosti (“Independence Square”)—and, by extension, major protest movements that took place there.","zh":"（常大写）乌克兰基辅的“独立广场”（Maidan Nezalezhnosti）；也可引申指发生在那里的大型抗议运动。"},"examples":[{"en":"News reports showed large crowds in the Maidan.","zh":"新闻报道展示了独立广场上的大量人群。"},{"en":"In some discussions, “the Maidan” refers to the protest movement itself, not only the place.","zh":"在一些讨论中，“Maidan”指的不仅是地点，也指那场抗议运动本身。"}]}],"synonyms":["public square","plaza","town square","open square"],"phonetic":"/ˈmaɪdæn/","extraExplanation":["“Maidan”一词常见于乌克兰语、俄语等语境，原义偏向“广场/空地”。在国际新闻中，如果看到大写的“the Maidan”，很多时候特指基辅独立广场及其作为政治集会象征的意义（例如与2013–2014年的示威相关的讨论）。","词源上它与波斯语/阿拉伯语中表示“广场、场地”的词有关，因此在不同地区（从东欧到中亚）都能见到类似用法或地名。"]}
{"word":"maidaz","summary":{"en":"“maidaz” is not a standard English word; it’s usually a name/handle or a misspelling (often confused with “Midas”).","zh":"“maidaz”不是标准英语单词；通常是名字/网名或拼写误差（常被误认为“Midas”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often appears as a username, brand name, or a misspelling/variant of another word (for example, “Midas”).","zh":"不是标准英语单词；常见于用户名、品牌名，或是其他单词的拼写变体/误拼（例如 “Midas”）。"},"examples":[{"en":"I couldn’t find “maidaz” in a dictionary—do you mean “Midas”?","zh":"我在词典里找不到“maidaz”——你是不是想写“ Midas ”？"},{"en":"Maidaz is the name of the channel, not an English vocabulary word.","zh":"Maidaz 是频道名，不是英语词汇。"}]}],"phonetic":"/ˈmeɪdæz/","extraExplanation":["“maidaz”在常见英语词典里没有固定词义，因此学习时更可能需要“纠错/确认目标词”。你可以告诉我它出现的句子或语境（比如一段话、标题、产品名），我就能判断它是专有名词、拼写错误，还是某种外来词/俚语。","如果你本来想查的是 **Midas**（迈达斯），那是希腊神话人物，常用于短语 **the Midas touch**（点石成金的本领/做什么都成功的能力）。","如果你想表达的是 **maid**（女佣/侍女），那是常见词；而结尾的 -z 有时是网络拼写，用来让名字更“酷”或更像口语发音。"]}
{"word":"maidchild","summary":{"en":"Maidchild is a rare, old-fashioned word meaning a girl, sometimes a young unmarried woman.","zh":"maidchild是较罕见、偏古旧的词，主要指“女孩”，有时也指“年轻未婚女子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a girl (a female child); an old-fashioned or regional word.","zh":"女孩（女性孩子）；一种较古老或地区性的说法。"},"examples":[{"en":"In some older texts, you may see “maidchild” used simply to mean “girl.”","zh":"在一些较老的文本中，你可能会看到“maidchild”只是用来表示“女孩”。"},{"en":"The story speaks of a poor maidchild who grew up in the countryside.","zh":"故事讲到一个贫穷的乡村女孩长大成人。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, archaic) a young unmarried woman; a maiden.","zh":"（罕见，古旧）年轻未婚女子；少女。"},"examples":[{"en":"The ballad praises the maidchild’s kindness and courage.","zh":"民谣称赞这位少女的善良与勇气。"}]}],"synonyms":["girl","lass","daughter","maiden"],"phonetic":"/ˈmeɪd.tʃaɪld/","extraExplanation":["“maidchild”在现代英语中非常少见，更多出现在较早的文学作品、民谣，或某些方言（如苏格兰英语）语境里，常等同于“girl / lass”。","词源上由“maid（少女/未婚女子）+ child（孩子）”构成，因此带有“女孩子/少女”的含义，但语感偏古风。现代写作通常用“girl”“daughter”“young woman”更自然。"]}
{"word":"maiden","summary":{"en":"“Maiden” most commonly means a young unmarried woman (old-fashioned/literary) or “first/earliest” in phrases like “maiden voyage.”","zh":"“maiden”最常见义为“少女/未婚女子”（偏文学或古风），也可表示“首次的/最早的”，如“maiden voyage（首航）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young unmarried woman (often used in older literature or formal style)","zh":"少女；未婚女子（多见于较古典或正式用法）"},"examples":[{"en":"In the old ballad, the maiden waits by the river for her lover.","zh":"在那首古老的民谣里，少女在河边等她的恋人。"},{"en":"The story begins with a brave maiden who refuses to give up hope.","zh":"故事以一位勇敢的少女开篇，她拒绝放弃希望。"}]},{"partOfSpeech":"adj.","definition":{"en":"first; earliest; not yet used or experienced (often in set phrases)","zh":"首次的；最早的；未使用过的／未经历过的（常用于固定搭配）"},"examples":[{"en":"She scored her maiden goal in the final minutes of the game.","zh":"她在比赛最后几分钟打进了自己的首粒进球。"},{"en":"The singer released her maiden album last year.","zh":"这位歌手去年发行了她的首张专辑。"}]},{"partOfSpeech":"adj.","definition":{"en":"of or like a young unmarried woman (literary/old-fashioned)","zh":"少女的；像少女的（文学或较古典用法）"},"examples":[{"en":"He described her maiden voice as soft and clear.","zh":"他形容她的少女嗓音柔和而清澈。"}]},{"partOfSpeech":"n.","definition":{"en":"a female horse, usually a young one (less common; mainly in British usage)","zh":"母马（较少见；多为英式用法，常指年轻的母马）"},"examples":[{"en":"The maiden was kept in a separate stall during training.","zh":"训练期间，那匹母马被单独安置在马厩里。"}]}],"synonyms":["young woman","girl (context-dependent)","unmarried woman","first","initial","debut"],"phonetic":"/ˈmeɪdən/","extraExplanation":["“maiden”作“少女/未婚女子”时，在现代英语里带有文学感或古风色彩；日常口语更常说“young woman”“girl”（需注意语气与年龄）或“unmarried woman”。","“maiden + 名词”常见于体育与职业领域，表示“首次的/首个的”，如 maiden voyage（首航）、maiden speech（首次演讲）、maiden name（婚前姓）。其中“maiden name”在现代也常用更中性的说法“birth name”。","在莎士比亚等文学作品中，“maiden”经常用来强调纯真、年轻或未婚身份，属于典型的古典修辞用词。"]}
{"word":"maiden name","summary":{"en":"A woman’s birth surname, especially the surname she used before marriage.","zh":"女性的出生姓氏，尤指结婚前使用的姓氏（婚前姓/娘家姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman’s family surname from birth, used before she changes her last name after marriage (in cultures where this is common).","zh":"（女性的）婚前姓氏；娘家姓（在一些文化中，结婚后常会改随配偶姓氏时使用）。"},"examples":[{"en":"Please enter your mother’s maiden name for the security question.","zh":"请填写你母亲的婚前姓氏作为安全问题答案。"},{"en":"After she got married, she chose to keep her maiden name.","zh":"结婚后，她选择保留自己的婚前姓氏。"},{"en":"The biography lists her maiden name in parentheses.","zh":"这本传记把她的婚前姓氏用括号标出来。"}]}],"synonyms":["birth name","née (used in writing, e.g., Jane Smith, née Brown)","family name (in context)"],"phonetic":"/ˈmeɪd(ə)n neɪm/","extraExplanation":["“Maiden name”常见于表格、法律文件、族谱/传记写作中，用来帮助识别同一个人（尤其在改姓后）。","在美国与其他英语国家，并非所有人结婚后都会改姓；也有人保留原姓、使用连字符双姓，或夫妻共同改姓，因此“maiden name”更多是描述一种常见做法，而非必须规则。","网络安全语境里，“mother’s maiden name（母亲婚前姓氏）”曾被广泛用作验证问题，但因为容易被公开信息推测，如今更推荐使用更难猜的验证方式或自定义答案。"]}
{"word":"maidenchild","summary":{"en":"Maidenchild is an uncommon, old-fashioned word meaning a firstborn child, and more rarely a young girl in poetic writing.","zh":"Maidenchild 是一个不常见的古语，主要指“长子/长女、头胎孩子”；更少情况下在诗歌中可指“小女孩/少女”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or literary) a firstborn child; the first child a parent has.","zh":"（古语/文学用语）长子或长女；父母的第一个孩子。"},"examples":[{"en":"In old stories, the king promised the throne to his maidenchild.","zh":"在古老的故事里，国王答应把王位传给他的长子/长女。"},{"en":"She wrote about the joy of holding her maidenchild for the first time.","zh":"她写下第一次抱着自己第一个孩子的喜悦。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a young girl; a maiden (an unmarried young woman), with emphasis on youth.","zh":"（罕见）小女孩；少女（强调年纪尚小）。"},"examples":[{"en":"The poem describes a maidenchild walking through the spring fields.","zh":"这首诗描写一个少女穿行在春日的田野中。"}]}],"synonyms":["firstborn","eldest child","first child","girl (poetic/rare)","maiden (rare)"],"phonetic":"/ˈmeɪdənˌtʃaɪld/","extraExplanation":["“maiden-”在英语里除了表示“未婚的、少女的”，也常表示“第一次的、最初的”（如 maiden voyage“首航”、maiden speech“首次演讲”）。因此 maidenchild 这一较少见的复合词常被理解为“第一个孩子/长子（女）”。","这个词在现代日常英语中几乎不用；更常见的表达是 firstborn / eldest child / first child。若写作“maiden child”（分开写）更容易被读者理解。"]}
{"word":"maidenhair","summary":{"en":"Maidenhair usually means a delicate fern (maidenhair fern), and it can also be a poetic way to describe very fine hair-like strands.","zh":"maidenhair通常指铁线蕨（maidenhair fern），也可作诗意用法，比喻非常纤细的发丝状细丝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A delicate fern with thin black stems and small fan-shaped leaflets; it is often grown as a houseplant (also called “maidenhair fern”).","zh":"铁线蕨；一种外形纤细的蕨类植物，茎细黑、叶片呈小扇形，常作为室内观赏植物（也叫“maidenhair fern”）。"},"examples":[{"en":"The maidenhair by the window needs bright, indirect light.","zh":"窗边那盆铁线蕨需要明亮但不直射的光。"},{"en":"She kept a pot of maidenhair in the bathroom because it likes humidity.","zh":"她把一盆铁线蕨放在浴室里，因为它喜欢湿度大。"}]},{"partOfSpeech":"n.","definition":{"en":"The hair-like stems or fine, soft hair compared to a maidenhair fern; used in poetic or descriptive writing.","zh":"（比喻）如铁线蕨般纤细的“发丝”；常用于诗意或描写性的表达。"},"examples":[{"en":"In the poem, her curls are described as “maidenhair,” dark and fine.","zh":"诗里把她的卷发描写成“maidenhair”，黑而细。"}]}],"synonyms":["maidenhair fern","Adiantum","fern"],"phonetic":"/ˈmeɪdənˌhɛr/","extraExplanation":["“Maidenhair”直译是“少女的头发”，因为这种蕨类的细黑叶柄像发丝一样纤细，因此得名。常见种是“maidenhair fern”，学名Adiantum属。养护上通常喜欢散射光、较高湿度与保持土壤微湿（但不积水）。"]}
{"word":"maidenhair-fern-like","summary":{"en":"delicately fern-shaped; resembling a maidenhair fern","zh":"形态纤细轻薄、像铁线蕨的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a maidenhair fern, especially in having delicate, thin, fan-shaped or feathery leaflets.","zh":"像铁线蕨的；尤指叶片纤细、轻薄、呈扇形或羽状、看起来很“蕨类般柔美”的。"},"examples":[{"en":"The plant has maidenhair-fern-like leaves that tremble in the slightest breeze.","zh":"这种植物的叶子像铁线蕨一样轻薄，微风一吹就轻轻颤动。"},{"en":"She described the pattern as maidenhair-fern-like, fine and lacey.","zh":"她形容那个图案像铁线蕨一样，细致而带蕾丝般的质感。"}]}],"synonyms":["fernlike","filigreed","lacy","feathery","delicate"],"phonetic":"/ˈmeɪdənˌhɛr fɝn laɪk/","extraExplanation":["“maidenhair fern”通常指铁线蕨属（Adiantum）的蕨类，常见特征是细黑的叶柄与轻薄的扇形小叶，因此“maidenhair-fern-like”多用于描写外观非常细腻、轻盈、蕨叶状的东西（植物叶形、花纹、装饰图案等）。"],"etymology":"由“maidenhair（铁线蕨/少女发丝般的）+ fern-like（像蕨类的）”构成的复合形容词；“maidenhair”原本就用来比喻铁线蕨细黑的叶柄像少女的发丝，后来延伸为“纤细柔美的”。","mnemonic":["拆开记：maiden（少女）+ hair（头发）→ 像“少女发丝”一样细；再加 fern-like（像蕨类）→ “细细的蕨叶感”。","联想画面：看到细黑叶柄 + 扇形小叶，就想“铁线蕨”，于是“maidenhair-fern-like”=“铁线蕨那种细致轻薄的样子”。"]}
{"word":"maidenhairs","summary":{"en":"Maidenhairs are delicate ferns with hair-thin stems; “maidenhairs” can also mean several maidenhair ferns together.","zh":"maidenhairs 指茎细如发、叶片轻薄的铁线蕨；也可泛指多株/一片铁线蕨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fern with very thin, hair-like stems and delicate leaves; often called a “maidenhair fern.”","zh":"一种铁线蕨（铁线蕨属）植物，茎细如发、叶片轻薄细致；常称“铁线蕨/少女发蕨”。"},"examples":[{"en":"Maidenhairs grow best in moist, shady places.","zh":"铁线蕨在潮湿、阴凉的地方长得最好。"},{"en":"She keeps maidenhairs as a houseplant because the leaves look light and elegant.","zh":"她把铁线蕨当作室内植物养，因为叶子看起来轻盈又优雅。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) maidenhair ferns as a group, especially in gardening or botany.","zh":"（复数）指一类/一丛铁线蕨（园艺或植物学语境中常用）。"},"examples":[{"en":"The garden path is lined with maidenhairs and moss.","zh":"小路两旁种着铁线蕨和苔藓。"}]}],"synonyms":["maidenhair fern","adiantum (botanical)","fern"],"phonetic":"/ˈmeɪdənˌhɛr/","extraExplanation":["“maidenhair”字面是“少女的头发”，用来形容这种蕨类茎细、柔、像发丝的外观，并不是指真正的头发。","常见的铁线蕨属学名为 Adiantum（如 Adiantum raddianum 常作室内观叶植物）。园艺写作里也常用复数 maidenhairs 指“多株铁线蕨/一片铁线蕨”。"]}
{"word":"maidenhairtree","summary":{"en":"“Maidenhair tree” means the ginkgo tree, known for its fan-shaped leaves.","zh":"“Maidenhair tree”指银杏树，以扇形叶片著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree with fan-shaped leaves, commonly known as the ginkgo; its leaves resemble the fronds of maidenhair fern","zh":"一种扇形叶的树，常称为银杏（树）；其叶形像铁线蕨（maidenhair fern）的叶片"},"examples":[{"en":"The street was lined with maidenhair trees that turned bright yellow in autumn.","zh":"这条街两旁种着银杏树，到了秋天会变成明亮的金黄色。"},{"en":"In some cities, people plant maidenhair trees because they tolerate pollution well.","zh":"在一些城市，人们种银杏树，因为它们很耐污染。"}]}],"synonyms":["ginkgo","ginkgo tree","Ginkgo biloba"],"phonetic":"/ˈmeɪdənˌhɛr triː/","extraExplanation":["“Maidenhair tree”是银杏树（Ginkgo biloba）的英文别名之一，因为银杏叶的形状让人联想到“铁线蕨（maidenhair fern）”的叶片。日常英语里更常说“ginkgo (tree)”。","银杏是一种非常古老的树种，常被称为“活化石”。在东亚（包括中国、日本、韩国）具有很强的文化意涵，也常见于寺庙、街道与校园的种植景观。"]}
{"word":"maidenhead","summary":{"en":"“Maidenhead” is an old-fashioned noun meaning (1) a woman’s virginity and (2) a first experience (as in “maiden voyage”).","zh":"“maidenhead”是较旧的名词：①女性的处女之身／贞洁；②首次经历（如“maiden voyage”指首航）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman’s virginity; the state of being a virgin (an old-fashioned word, sometimes considered crude or offensive today)","zh":"（旧用，有时被认为粗俗或冒犯）女性的贞洁／处女之身；处女状态"},"examples":[{"en":"In older novels, “maidenhead” is sometimes used to mean a young woman’s virginity.","zh":"在一些较早的小说里，maidenhead 有时用来指年轻女子的处女之身。"},{"en":"The word appears in historical texts, but it’s rarely used in polite modern conversation.","zh":"这个词会出现在历史文本中，但在现代礼貌对话里很少使用。"}]},{"partOfSpeech":"n.","definition":{"en":"someone’s first experience, attempt, or achievement (used in fixed phrases like “maiden voyage”)","zh":"（常见于固定搭配）首次经历／首次尝试／初次成就"},"examples":[{"en":"The ship set off on its maiden voyage last week.","zh":"这艘船上周开始了它的处女航（首航）。"},{"en":"She gave a calm performance in her maiden speech to the committee.","zh":"她在委员会的首次发言中表现得很镇定。"}]}],"synonyms":["virginity","maidenhood","first","debut","inaugural"],"phonetic":"/ˈmeɪdənˌhɛd/","extraExplanation":["“maidenhead”由 maiden（少女、未婚女子）+ -head（表示“状态、性质”的后缀）构成，字面是“少女之态”，因此在古英语/中古英语语境里常指“处女状态”。","现代英语里谈论性与身体时更常用更中性的说法（如 virginity）。使用 maidenhead 可能显得古旧、带评判色彩，甚至令人不适；在学习或阅读文学作品时理解即可，日常表达建议避免。"]}
{"word":"maidenheads","summary":{"en":"“Maidenheads” is the plural of “maidenhead,” an old-fashioned word mainly meaning a woman’s virginity; very rarely, it can relate to the idea of “first,” but modern English usually uses “maiden voyage/speech.”","zh":"“Maidenheads”是“maidenhead”的复数，主要是古旧用法，指女性的贞洁／处女之身；极少情况下与“首次”含义相关，但现代英语通常用“maiden voyage/speech”等表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman’s virginity (an old-fashioned, often literary word; can refer to the state of being a virgin, and sometimes specifically the hymen)","zh":"（女性的）贞洁／处女之身（较古旧、带文学色彩的词；有时也特指处女膜）"},"examples":[{"en":"In some old poems, the word “maidenhead” is used to mean a young woman’s virginity.","zh":"在一些古老诗歌中，“maidenhead”用来表示年轻女子的贞洁／处女之身。"},{"en":"The novel uses archaic language, mentioning “maidenheads” in a way that sounds dated today.","zh":"这部小说使用古语，用到“maidenheads”，在今天听起来比较过时。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person’s first experience or first performance of something; the idea of “maiden” meaning “first” (more commonly said as “maiden voyage/speech”)","zh":"（罕见）某事的第一次经历／首次表现；源自“maiden”有“首次”的含义（更常说“maiden voyage/speech”）"},"examples":[{"en":"He gave his maiden speech in parliament.","zh":"他在议会发表了首次演讲。"},{"en":"The ship set off on its maiden voyage.","zh":"这艘船开始了首航。"}]}],"synonyms":["virginity","chastity (context-dependent)","hymen (specific/body term)","innocence (not always sexual)"],"phonetic":"/ˈmeɪdənˌhɛd/","extraExplanation":["“maidenhead”在现代英语里很少用于日常对话，多见于古典文学、历史文本或具有复古风格的写作中。它涉及性与身体话题，语气可能显得陈旧、带强烈道德色彩，使用时要注意场合与尊重。","现代英语表达“处女之身”更常用中性说法，如“virginity”。而表示“首次”的含义，现代最常见的固定搭配是“maiden voyage / maiden speech”，而不是“maidenhead”。"]}
{"word":"maidenhood","summary":{"en":"Maidenhood means the time or state of being a young unmarried woman, often with an older/literary sense of virginity.","zh":"Maidenhood 指少女或未婚女子的时期/状态，常带较古老或文学语境中的“处女之身”含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a young unmarried woman; virginity (often used in older or literary writing)","zh":"少女的身份或时期；未婚女子的状态；（常指）处女之身（多见于较古老或文学语境）"},"examples":[{"en":"In the novel, she looks back on her maidenhood with a mix of pride and regret.","zh":"在小说里，她带着骄傲与遗憾回望自己的少女时代。"},{"en":"The poem describes maidenhood as a time of innocence and strict rules.","zh":"这首诗把少女时期描写成既纯真又受严格约束的时光。"}]}],"synonyms":["girlhood","virginity (context-dependent)","youth"],"phonetic":"/ˈmeɪdənˌhʊd/","extraExplanation":["“maidenhood”由“maiden（少女/未婚女子）+ -hood（……的状态/时期，如 childhood）”构成。现代日常英语里较少用，更多见于文学、历史或宗教语境。","这个词有时会带有对女性贞洁的传统价值观色彩；在当代写作中，为避免性别刻板印象，可改用更中性的表达，如“girlhood/young adulthood/early life”或直接说“when she was young”。"]}
{"word":"maidenhoods","summary":{"en":"“Maidenhoods” means the periods or states of being a maiden (youth/unmarried womanhood), and can also mean the early stages of something (figurative).","zh":"“Maidenhoods”指少女/未婚年轻女子的状态或时期（常含青春或贞洁意味），也可比喻指某事物的早期阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the states or periods of being a maiden (a young, unmarried woman), often implying youth and/or virginity; plural of “maidenhood.”","zh":"少女（未婚年轻女子）的状态或时期，常含“年轻/贞洁”的含义；“maidenhood”的复数。"},"examples":[{"en":"In old poems, writers sometimes speak of “lost maidenhoods” to describe a woman’s youth passing away.","zh":"在一些旧诗歌里，作者有时会用“lost maidenhoods”来形容女子青春的逝去。"},{"en":"The novel contrasts the characters’ maidenhoods with their later, more difficult adult lives.","zh":"这部小说把人物的少女时期与后来更艰难的成人生活作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"the early or first stages of something (a figurative use, less common).","zh":"某事物的早期或初始阶段（比喻用法，较少见）。"},"examples":[{"en":"The town’s maidenhoods were marked by small farms and quiet streets.","zh":"这座城镇的“初创时期”以小农场和安静的街道为特征。"}]}],"synonyms":["girlhood","youth","virginity (context-dependent)","early days","infancy (figurative)"],"phonetic":"/ˈmeɪdənˌhʊdz/","extraExplanation":["“maidenhood/maidenhoods”在现代英语里偏文学、偏古风，日常更常说“girlhood”（少女时代）或“virginity”（贞洁/处女身，语气更直白也更敏感）。使用时要注意语境：谈论“virginity”在某些文化与个人层面可能较为私密或引发不适，写作中更建议用中性表达如“youth/early years”。"]}
{"word":"maidenish","summary":{"en":"Maidenish means “like a maiden”—girlish, shy, modest, or innocent, often in a literary or old-fashioned tone.","zh":"maidenish 意为“像少女的”，指少女般的腼腆、矜持或纯真，常带文学或古旧语感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"like a maiden; girlish in a shy, modest, or innocent way (often old-fashioned or literary)","zh":"像少女的；带有羞怯、矜持或纯真的（常偏古旧或文学用语）"},"examples":[{"en":"He blushed with a maidenish shyness when praised.","zh":"被夸奖时，他羞得脸红，带着一种少女般的腼腆。"},{"en":"Her maidenish laugh made the moment feel youthful and sweet.","zh":"她少女般的笑声让那一刻显得年轻而甜美。"}]}],"synonyms":["girlish","shy","modest","demure","innocent"],"phonetic":"/ˈmeɪdənɪʃ/","extraExplanation":["“maidenish”由 maiden（少女、未婚女子）+ 后缀 -ish 构成，-ish 常表示“有点像……、带点……的”。这个词在现代口语里不常见，更常见于文学描写或较旧的文本。","语气上可能带一点“过分天真/装矜持”的评价色彩，具体要看上下文；写作时若怕显得陈旧，可用 girlish, shy, innocent, demure 等更常用的词替代。"]}
{"word":"maidenism","summary":{"en":"“Maidenism” is a rare noun meaning the state of being a maiden (maidenhood), or less commonly the qualities or behavior associated with a maiden, mainly in older/literary contexts.","zh":"“Maidenism”是个少见名词，主要指“少女/未婚女子的状态”（maidenhood），也可较少见地指被认为具有少女特征的气质或举止，多见于较旧或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being a maiden; maidenhood (being an unmarried young woman, especially in older or literary use)","zh":"处女/少女的身份或状态；少女期、未婚女子的状态（多为较旧或文学用法）"},"examples":[{"en":"In older novels, maidenism is sometimes treated as a symbol of innocence and social expectation.","zh":"在一些较早的小说里，“maidenism”有时被当作纯真与社会期待的象征。"},{"en":"The poem contrasts youth and maidenism with later adult responsibilities.","zh":"这首诗把青春与“maidenism”同后来的成人责任作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) qualities, manners, or behavior thought typical of a maiden","zh":"（较少见）被认为具有“少女/未婚女子”特征的气质、举止或行为"},"examples":[{"en":"The critic praised the character’s maidenism—her modest, careful way of speaking.","zh":"评论家称赞这个人物的“maidenism”——她说话含蓄、谨慎的方式。"},{"en":"He used the word jokingly, exaggerating her maidenism for comic effect.","zh":"他开玩笑用这个词，为了喜剧效果夸大她的“maidenism”。"}]}],"synonyms":["maidenhood","virginity (only in some contexts)","girlhood (not identical)"],"phonetic":"/ˈmeɪdənˌɪzəm/","extraExplanation":["“maidenism”非常少见，常见的表达是“maidenhood”。“maiden”本身在现代英语里更偏文学、历史或固定搭配（如 maiden voyage 初航）。在当代语境中，把女性与“纯洁/少女气质”强绑定可能带有刻板印象；写作时可根据语境选择更中性的词。"]}
{"word":"maidenlike","summary":{"en":"An old-fashioned adjective meaning modest, shy, or innocent in a “young woman” way.","zh":"较古旧的形容词，表示“带有少女气质的”，如端庄、羞怯、纯真等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities traditionally associated with a young unmarried woman: modest, gentle, shy, or innocent (sometimes used in an old-fashioned way).","zh":"具有传统上与年轻未婚女子相关的特质：端庄、温柔、羞怯或纯真（有时带有较为古旧的语感）。"},"examples":[{"en":"She gave a maidenlike smile and looked down at the floor.","zh":"她露出少女般含蓄的微笑，低头看向地板。"},{"en":"The poem describes a maidenlike figure walking through a quiet garden.","zh":"这首诗描写了一位少女般的身影在静谧的花园里行走。"}]}],"synonyms":["modest","shy","demure","innocent","gentle"],"phonetic":"/ˈmeɪdənˌlaɪk/","extraExplanation":["“maiden”原意是“少女/未婚女子”，在文学和旧式英语里很常见；加上“-like”表示“像……一样”。因此“maidenlike”多见于文学描写或较正式、带古典气息的语境。","现代英语中，这个词可能显得过时，且容易带有性别刻板印象（把“害羞/纯洁/温柔”默认归为女性特质）。更中性的替代词可用：modest（谦逊的/端庄的）、shy（害羞的）、gentle（温和的）、innocent（天真的/纯真的）。"]}
{"word":"maidenliness","summary":{"en":"Maidenliness means a traditionally modest, gentle, “young unmarried woman” kind of femininity.","zh":"Maidenliness 指传统观念中“少女/未婚女子”式的端庄、温柔、含蓄等气质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being maidenly—modest, gentle, and traditionally “ladylike,” especially associated with a young unmarried woman (a “maiden”).","zh":"“少女般/处女般”的气质；指（传统观念中）年轻未婚女性的端庄、温柔、含蓄等特质。"},"examples":[{"en":"In the old novel, the heroine’s maidenliness is praised as a sign of good character.","zh":"在那部旧小说里，女主角的少女般端庄被称赞为品德良好的象征。"},{"en":"The author questions why maidenliness is expected from women but not from men.","zh":"作者质疑为什么社会期待女性具有“少女般的端庄”，却不对男性有同样要求。"}]}],"synonyms":["modesty","demureness","gentleness","primness"],"phonetic":"/ˈmeɪdənlinəs/","extraExplanation":["“maidenliness”源自“maiden（少女/未婚女子）+ -ly（……般的）+ -ness（名词后缀）”。它常见于文学作品或较旧的语境中，带有明显的传统性别角色色彩。现代写作中如果要表达“端庄、含蓄、温柔”，更常用更中性的词，如“modesty（谦逊/端庄）”“gentleness（温柔）”。"]}
{"word":"maidenly","summary":{"en":"Maidenly describes a modest, gentle, or shy quality traditionally linked to a young unmarried woman; it can sound literary or old-fashioned.","zh":"Maidenly 指传统上与年轻未婚女子相关的端庄、温柔或羞怯气质，语感偏文学或较旧式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities traditionally associated with a young unmarried woman, especially being modest, gentle, or shy (sometimes old-fashioned).","zh":"具有传统上与年轻未婚女子相关的特质，尤指端庄、温柔或羞怯（有时带旧式/文雅色彩）。"},"examples":[{"en":"She gave a maidenly smile and looked down.","zh":"她露出一个端庄羞涩的微笑，然后低下了头。"},{"en":"The novel describes her as maidenly and soft-spoken.","zh":"小说把她描写得娴静端庄、说话轻声细语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a maiden (a young unmarried woman); appropriate for or typical of a maiden.","zh":"与“少女/未婚女子”有关的；适合或典型于少女的。"},"examples":[{"en":"She wore a simple, maidenly dress for the ceremony.","zh":"她在仪式上穿了一条朴素的少女式连衣裙。"},{"en":"He wrote poems about maidenly beauty.","zh":"他写诗歌颂少女般的美。"}]}],"synonyms":["modest","demure","shy","bashful","girlish"],"phonetic":"/ˈmeɪdənli/","extraExplanation":["“maidenly”来自“maiden”（少女、未婚女子）+“-ly”（构成形容词）。它在现代英语里偏文学/旧式，用来形容“端庄、含蓄”的气质时要注意语境：有时会带有传统性别刻板印象的意味。更中性常用的近义表达有：modest（谦逊/端庄）、demure（娴静羞怯，较文学）、shy（害羞）。"]}
{"word":"maidens","summary":{"en":"Maidens means young unmarried women; in literary/old-fashioned use it can also mean virgins.","zh":"maidens 指未婚的年轻女子；在文学或较旧用法中也可指“处女/贞女”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"young unmarried women; (often literary or old-fashioned) girls or women who have never married","zh":"未婚的年轻女子；（常见于文学或较旧用法）未出嫁的少女/女子"},"examples":[{"en":"In the old story, the prince promised to protect the maidens of the village.","zh":"在那个古老的故事里，王子承诺保护村里的少女们。"},{"en":"The painting shows three maidens gathering flowers by the river.","zh":"这幅画描绘了三位少女在河边采花。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/archaic) women who are virgins","zh":"（文学/古语）处女；贞女"},"examples":[{"en":"The poem speaks of maidens and heroes in a distant age.","zh":"这首诗写到遥远年代的贞女与英雄。"}]}],"synonyms":["young women","girls","maidens (literary)","virgins (archaic sense)"],"phonetic":"/ˈmeɪdənz/","extraExplanation":["“maiden”这个词在现代英语里不算日常口语，更多见于文学、童话、历史叙述或带有“古风”的表达中。日常表达“年轻女性/女孩”通常用“young women / girls”。","与“virgin（处女）”相关的含义带有强烈的历史与文化色彩，现代语境中可能显得过时或带评判意味，使用时要注意语境与礼貌。","“maidens”也常出现在固定搭配里，如“maiden voyage”（处女航/首航），这里的“maiden”表示“首次的”，但这个用法通常不写成复数“maidens”。"]}
{"word":"maidenship","summary":{"en":"A rare/old-fashioned noun meaning the state or time of being a maiden (often implying youth or virginity).","zh":"较罕见/旧式名词，指作为少女的身份或时期（常含年轻或贞洁之意）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a maiden; maidenhood (often implying youth or virginity; now rare or old-fashioned)","zh":"少女（处女）身份；少女时期（常含“年轻/贞洁”之意；较为罕见或旧式用法）"},"examples":[{"en":"In old poems, her maidenship is described as pure and untouched.","zh":"在一些旧诗中，她的少女身份被描写为纯洁无瑕。"},{"en":"The novel contrasts her maidenship with the responsibilities of married life.","zh":"这部小说把她的少女时期与婚后生活的责任作对比。"}]}],"synonyms":["maidenhood","virginity","girlhood"],"phonetic":"/ˈmeɪdənʃɪp/","extraExplanation":["“maidenship”由 maiden（少女/处女）+ -ship（表示“身份、状态”的后缀，如 friendship, leadership）构成，语感偏文学或古风。现代英语中更常见的表达是 maidenhood 或 virginity（语义更直接、也更敏感），以及更中性的 youth/young womanhood（强调“年轻阶段”而非贞洁）。使用时注意语境与文化敏感度：谈到他人的“贞洁/处女”在许多场合可能显得冒犯或不合时宜。"]}
{"word":"maidenweed","summary":{"en":"“Maidenweed” is a common name for certain weeds, often a low-growing lawn weed in warm areas.","zh":"“Maidenweed”是某些杂草的俗称，常指温暖地区草坪里匍匐生长的一种杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common name for several kinds of unwanted wild plants, especially a low-growing weed found in lawns and gardens in warm regions (often referring to “dewflower,” a plant in the spiderwort family).","zh":"（俗名）指几种不同的野草/杂草的统称；在一些地区常特指草坪和花园里常见的匍匐生长杂草（常指“露花草/水竹叶”一类，属鸭跖草科）。"},"examples":[{"en":"Maidenweed spread across the lawn after the rainy season.","zh":"雨季过后，这种“maidenweed”（一种杂草）在草坪上蔓延开来。"},{"en":"Pull maidenweed before it flowers, or it may reseed quickly.","zh":"最好在它开花前把maidenweed拔掉，不然很快会再结籽繁殖。"},{"en":"Some gardeners mistake maidenweed for a harmless ground cover.","zh":"有些园丁会把maidenweed误认为无害的地被植物。"}]}],"synonyms":["weed","lawn weed","dewflower (regional)"],"phonetic":"/ˈmeɪdənˌwiːd/","extraExplanation":["“maidenweed”是民间俗名，不是严格的单一学名；不同国家/地区可能指不同的杂草。园艺或除草时，更可靠的做法是结合照片或植物特征（叶形、花色、是否匍匐生长）来确认具体是哪一种。"]}
{"word":"maidhead","summary":{"en":"“Maidhead” is usually a nonstandard form of “maidenhead,” meaning (archaic/literary) virginity, and sometimes (older anatomical usage) the hymen.","zh":"“maidhead”通常是“maidenhead”的非标准写法，意思多为（古旧/文学用语）贞洁/处女之身，有时在旧解剖学用法中指处女膜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic or literary) a woman’s virginity; the state of being a virgin.","zh":"（古旧或文学用语）女性的贞洁；处女之身。"},"examples":[{"en":"In older literature, the word “maidenhead” often refers to a woman’s virginity.","zh":"在较早的文学作品中，“maidenhead”常用来指女性的贞洁。"},{"en":"The novel uses the term to show the strict moral expectations placed on young women.","zh":"这部小说用这个词来表现社会对年轻女性严格的道德期待。"}]},{"partOfSpeech":"n.","definition":{"en":"(anatomy, older usage) the hymen (a thin membrane sometimes present at the vaginal opening).","zh":"（解剖学，旧称）处女膜（阴道口处有时存在的一层薄膜）。"},"examples":[{"en":"Some medical texts from the past used “maidenhead” to mean the hymen.","zh":"一些旧时医学文本会用“maidenhead”来指处女膜。"},{"en":"Modern writing usually avoids this term and uses “hymen” instead.","zh":"现代写作通常避免使用这个词，而改用“hymen”。"}]}],"synonyms":["virginity","chastity","hymen (in anatomical context)"],"phonetic":"/ˈmeɪdənˌhɛd/","extraExplanation":["“maidhead”通常被视为“maidenhead”的拼写变体或误拼；现代英语里更常见也更标准的是“maidenhead”。","这个词带有强烈的历史与文化色彩，常出现在古典文学、宗教或旧法律语境中；在日常交流中使用可能显得冒犯、物化或过时。","词源上，“maiden”表示“少女/未婚女子”，“-head”在古英语中可表示“状态/身份”（类似 modern 的 “-hood”），所以原义接近“少女/处女的状态”。"]}
{"word":"maidhood","summary":{"en":"Maidhood means the state of being a maid—most often an unmarried young woman (maidenhood), and less commonly a female domestic servant.","zh":"maidhood 指“作为少女（未婚年轻女子）的时期/身份”（最常见），较少也可指“作为女仆的身份或生活”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or period of being a maid (especially an unmarried young woman); maidenhood.","zh":"（尤指未婚年轻女子的）少女时期；处女之身；少女身份（同 maidenhood）。"},"examples":[{"en":"In old poems, she is praised for her modesty in maidhood.","zh":"在古诗中，人们称赞她在少女时期的端庄。"},{"en":"The novel treats maidhood as a brief season before marriage.","zh":"这部小说把少女时期描写成婚前短暂的一段时光。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The status or life of a maid as a female domestic worker.","zh":"（较少见）女仆／侍女的身份或生活。"},"examples":[{"en":"She left maidhood to work in a shop in town.","zh":"她离开了女仆生活，去镇上的商店工作。"}]}],"synonyms":["maidenhood","girlhood","virginity","service (in domestic work)"],"phonetic":"/ˈmeɪdˌhʊd/","extraExplanation":["“maidhood”是比较少见、带有文学或古风色彩的词，现代英语更常用“maidenhood”（少女时期/未婚女子的身份）或直接用“girlhood”（少女时代）。","历史上“maid”既可指“少女/处女”，也可指“女仆”，因此“maidhood”在语境中可能出现两种含义；阅读古文或文学作品时要结合上下文判断。"]}
{"word":"maidhoods","summary":{"en":"“Maidhoods” is the plural of “maidhood,” meaning the state/period of being a maid or young unmarried woman (often literary/old-fashioned).","zh":"“maidhoods”是“maidhood”的复数，指少女／未婚女子的身份或时期（偏文学、较古风），偶尔也可指女仆工作的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a maid (a girl or young unmarried woman); maidenhood.","zh":"少女／未婚女子的身份或时期；处女期（maidenhood）。"},"examples":[{"en":"In old stories, a heroine’s maidhood is often described as a time of innocence.","zh":"在古老故事里，女主角的少女时期常被描写成纯真的时光。"},{"en":"The novel contrasts childhood, maidhood, and marriage as different stages of life.","zh":"这部小说把童年、少女期和婚姻对比为人生的不同阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the condition of being a female servant; service as a maid.","zh":"（罕见）作为女仆的身份或状态；女仆的工作（maid 的工作状态）。"},"examples":[{"en":"She left maidhood to open a small shop of her own.","zh":"她离开女仆工作后，自己开了一家小店。"}]}],"synonyms":["maidenhood","girlhood","youth (in context)"],"phonetic":"/ˈmeɪd.hʊd/","extraExplanation":["“maidhood”较为古风或文学化，在现代英语里更常用“girlhood”（少女时期）或“maidenhood”（处女／未婚少女时期）。","“maidhoods”是复数形式，常见于把不同人物或不同阶段进行对照的写法（如“their maidhoods”）。"]}
{"word":"maidie","summary":{"en":"A Scottish informal word meaning a young woman/girl or a term of endearment.","zh":"苏格兰口语词，指年轻女子/姑娘，也可作亲昵称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) A young woman or girl; a maid; a sweetheart (often as a friendly form of address).","zh":"（苏格兰口语）年轻女子/姑娘；女仆；也可作对心上人或年轻女性的亲昵称呼。"},"examples":[{"en":"Come here, maidie, and tell me what happened.","zh":"过来，姑娘，跟我说说发生了什么。"},{"en":"He wrote songs about a bonnie maidie from the village.","zh":"他写歌唱一位村里漂亮的姑娘。"}]}],"synonyms":["girl","lass","maid","sweetheart"],"phonetic":"/ˈmeɪdi/","extraExplanation":["“maidie”多见于苏格兰英语/方言（Scots）语境，是“maid（姑娘/女仆）”的亲昵或小称形式，带有温柔、口语化的感觉。现代通用美式英语中很少用到，更常见的是“girl / young woman / maid / sweetheart”等表达。","也可能作为女性名字的昵称或拼写变体出现（如某些人名的爱称），这时发音和含义会随个人或地区习惯变化。"]}
{"word":"maidin","summary":{"en":"“Maiden” most commonly means a young unmarried woman (old-fashioned), and it can also mean “first” (e.g., maiden voyage, maiden speech).","zh":"“maiden”最常指“年轻未婚女子/（旧式）处女”，也可表示“首次的/第一的”（如 maiden voyage 首航、maiden speech 首次演讲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young unmarried woman; (old-fashioned) a girl or woman who has not had sex","zh":"年轻未婚女子；（较旧式）处女"},"examples":[{"en":"In old stories, a brave knight often saves a maiden.","zh":"在古老故事里，勇敢的骑士常常拯救一位少女。"},{"en":"The word “maiden” sounds old-fashioned in modern English.","zh":"“maiden”这个词在现代英语里听起来比较古老。"}]},{"partOfSpeech":"adj.","definition":{"en":"being the first of its kind; first (used before a noun)","zh":"首次的；开创性的；第一（常放在名词前）"},"examples":[{"en":"The company launched its maiden voyage last year.","zh":"这家公司去年启动了首次航行。"},{"en":"She gave a maiden speech in Parliament.","zh":"她在议会发表了首次演讲。"}]}],"synonyms":["young woman","girl","first","initial","inaugural"],"phonetic":"/ˈmeɪdən/","extraExplanation":["你输入的“maidin”在英语里不常见，最可能是拼写错误：常见目标词是“maiden”（少女；首次的）。","如果你本来想写的是短语“made in”（如“Made in China”），它表示“产自/制造于……”，通常写成两个词，并常用于产品标签。"]}
{"word":"maidish","summary":{"en":"“Maidish” means maidenly or girlish—like a young maid, often shy or innocent.","zh":"“maidish”意为“少女般的/像侍女的”，常形容羞怯、纯真或端庄（偏文学、旧式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a maid or young woman; maidenly, girlish, or somewhat naïve in a gentle way.","zh":"像侍女/少女的；少女般的、带点天真或羞怯的（常带文学或旧式语感）。"},"examples":[{"en":"She had a maidish shyness and kept her eyes on the floor.","zh":"她带着少女般的羞怯，把目光落在地板上。"},{"en":"The character is described as maidish, modest, and soft-spoken.","zh":"这个角色被描写成少女气、端庄而轻声细语的。"},{"en":"In the old novel, he praises her maidish innocence.","zh":"在那本旧小说里，他称赞她少女般的纯真。"}]}],"synonyms":["maidenly","girlish","youthful","demure","innocent"],"phonetic":"/ˈmeɪdɪʃ/","extraExplanation":["“maidish”不算常用词，更常见的是“maidenly / girlish / youthful”。它由“maid（少女/侍女）+ -ish（有点……的、像……的）”构成，常见于较文学、较旧式的描写语境。使用时要注意语气：多为温和的形容（害羞、纯真、端庄），但在某些语境也可能被理解为“幼稚、过于天真”。"]}
{"word":"maidishness","summary":{"en":"Maidishness means a shy, modest, youthful “maiden-like” quality.","zh":"maidishness 指“像少女/处女般”的羞怯、端庄、天真气质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being “maidish”: like a maid; youthful, shy, modest, or virginal in manner.","zh":"“像少女/女仆的样子”的特质：举止带有少女般的羞怯、端庄、朴素或（带有）处女性的感觉。"},"examples":[{"en":"There was a certain maidishness in the way she lowered her eyes when spoken to.","zh":"她被人搭话时垂下眼睛，那种举止里带着一丝少女般的羞怯。"},{"en":"The novel describes her early maidishness giving way to confidence as she grows older.","zh":"小说写到她早年的少女气逐渐退去，随着年龄增长变得自信起来。"},{"en":"His compliment was awkward: he praised her “maidishness,” as if innocence were a costume.","zh":"他的赞美很别扭：他夸她“少女般的纯真”，仿佛天真是一套可以穿上的服装。"}]}],"synonyms":["girlishness","innocence","modesty","shyness","demureness"],"phonetic":"ˈmeɪdɪʃnəs","extraExplanation":["“maidishness”由 maid（少女/女仆）+ -ish（带有……的、略显……的）+ -ness（名词后缀，表示“性质/状态”）构成，语体偏文学或旧式；现代英语更常用 innocence（天真/纯真）、modesty（端庄/谦逊）、shyness（害羞）或 girlishness（少女气）。","注意语感：用来形容女性时可能带有“把女性理想化为纯真/顺从”的历史色彩，正式写作中可根据语境谨慎选择同义词。"]}
{"word":"maidism","summary":{"en":"“Maidism” is a rare, old-fashioned noun meaning maidenhood—the condition of being a maid/young unmarried woman (sometimes implying virginity).","zh":"“maidism”是一个罕见且偏旧式的名词，指“少女/未婚女子的状态（少女时期）”，有时也含“贞洁、处女状态”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, old-fashioned) The state or condition of being a maid; maidenhood or virginity.","zh":"（罕见/旧式）作为少女/未婚女子的状态；少女时期；（也可指）贞洁、处女状态。"},"examples":[{"en":"In some old writings, “maidism” refers to a young woman’s maidenhood before marriage.","zh":"在一些旧时写作中，“maidism”指的是女子结婚前的少女时期。"},{"en":"The novel contrasts freedom in youth with the social expectations placed on maidism.","zh":"这部小说将青春的自由与社会对“少女身份/贞洁”的期待作对比。"}]}],"synonyms":["maidenhood","virginity","girlhood (sometimes)","unmarried state"],"phonetic":"/ˈmeɪdɪzəm/","extraExplanation":["“maidism”由 maid（少女/女仆）+ -ism 构成，但它不像 feminism 这类词表示“主义/思潮”。在历史语境中更常指“少女身份、未婚状态”或“贞洁”。现代英语里很少用，通常会用 maidenhood / virginity / being unmarried 来表达。","注意：maid 也可以指“女仆”，但 “maidism” 通常不是指“女仆制度/女仆身份”。如果你想表达“当女仆/家政工作”，更自然的说法是 domestic service / being a maid。"]}
{"word":"maidkin","summary":{"en":"“Maidkin” means a little maid or young girl, and it’s archaic/rare today.","zh":"“maidkin”指“小姑娘/年轻女孩”，属于古语、现代很少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A little maid; a young girl or young woman (archaic/rare).","zh":"小姑娘；年轻女孩（古语/少见）"},"examples":[{"en":"In old ballads, a knight may speak to a maidkin by the river.","zh":"在古老的民谣里，骑士可能会在河边和一位小姑娘说话。"},{"en":"The story describes a poor maidkin who works in a great house.","zh":"故事描写了一个在大宅里干活的贫穷小姑娘。"}]}],"synonyms":["girl","young woman","lass (dialect)","maiden (literary/old-fashioned)"],"phonetic":"/ˈmeɪdˌkɪn/","extraExplanation":["“maidkin”是古语用法，现代英语中几乎不用；读到它时通常出现在民谣、童话、古风小说或仿古写作里。","词尾“-kin”是一个表示“小、亲昵”的后缀（常见于较早期英语/方言），类似“lambkin（小羊羔）”。因此“maidkin”带有“小姑娘、惹人怜爱/亲昵”的感觉。使用时要注意语域：现代对话中用“girl / young woman”更自然。"]}
{"word":"maidlike","summary":{"en":"“Maidlike” means having qualities associated with a maid—especially neat, modest, or demure (literary/old-fashioned).","zh":"“maidlike”指“像女仆/侍女的”，尤指整洁、端庄或羞怯（偏文学/较古旧）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a maid; typical of a maid, especially in being neat, modest, or demure (often literary or old-fashioned).","zh":"像女仆/侍女的；具有女仆特征的（尤指整洁、端庄、羞怯；常见于文学或较古旧的用法）。"},"examples":[{"en":"She wore a maidlike dress—plain, clean, and carefully buttoned.","zh":"她穿着一件女仆般的裙子——朴素、干净，扣子也扣得一丝不苟。"},{"en":"His voice softened into a maidlike politeness when he spoke to the guests.","zh":"他和客人说话时，声音变得格外温顺有礼，带着一种侍女般的恭敬。"}]}],"synonyms":["demure","modest","prim","neat","ladylike"],"phonetic":"/ˈmeɪdˌlaɪk/","extraExplanation":["“maidlike”带有较强的文学/描写色彩，在现代日常口语里不算常用，更常见的替换说法有“modest（端庄的）”“demure（娴静羞怯的）”“maid-like（加连字符的写法）”。在文学里它有时不仅指“像女仆那样的穿着/举止”，也会隐含一种“顺从、温柔、传统女性气质”的评价；使用时注意语境，避免让人感觉刻板或冒犯。"]}
{"word":"maidling","summary":{"en":"Maidling is a rare, old-fashioned word meaning a young girl or maiden (sometimes a young maidservant).","zh":"maidling 是一个少见的古风词，指少女/处女（有时也指年轻女仆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/poetic) a young girl; a maiden; a young maidservant.","zh":"（古语/诗歌用语）少女；处女；年轻的女仆。"},"examples":[{"en":"In the old ballad, a maidling waits by the river for her love to return.","zh":"在那首古老的民谣里，一位少女在河边等待恋人归来。"},{"en":"The story describes a maidling who works in the lord’s household.","zh":"故事描写了一位在领主家中做事的年轻女仆。"}]}],"synonyms":["maiden","girl","lass","young maid"],"phonetic":"/ˈmeɪdlɪŋ/","extraExplanation":["“maidling”很少用于现代英语，常见于诗歌、民谣或仿古文体。它由“maid（少女/女仆）+ -ling（表示‘小的、年轻的’的后缀）”构成，语气带有“年少、娇小、带点古风”的感觉。现代更常说“girl / young woman / maiden / young maid”之类。"]}
{"word":"maidly","summary":{"en":"“Maidly” is an archaic adjective meaning maiden-like: girlish, modest, or innocent.","zh":"“maidly”是一个古用形容词，意思是“像少女一样的”：少女般、端庄或纯洁。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Having the qualities of a maiden; girlish, modest, or virginal.","zh":"（古用）具有少女/处女的特质；少女般的、端庄的、纯洁的。"},"examples":[{"en":"In old poems, a “maidly blush” suggests a shy, innocent redness in the face.","zh":"在古诗歌里，“maidly blush（少女般的红晕）”常用来表达害羞、纯真的脸红。"},{"en":"She was praised for her maidly manners, meaning her behavior seemed modest and proper.","zh":"人们称赞她有“maidly manners”，意思是她的举止显得端庄得体。"}]}],"synonyms":["maidenly","girlish","modest","innocent","demure"],"phonetic":"/ˈmeɪdli/","extraExplanation":["“maidly”在现代英语里很少使用，多见于较早的文学作品或仿古写作。更常见、自然的表达是“girlish / maidenly / modest / innocent”。","词根“maid”原意是“少女/女仆”，但“maidly”这个形容词通常强调“少女般的纯洁、矜持”，而不是“女仆”的职业含义。"]}
{"word":"maids","summary":{"en":"“Maids” usually means female cleaners/housekeepers (plural of maid). In older/literary English, it can also mean young unmarried women.","zh":"“maids”通常指“女佣/清洁人员”（maid 的复数）。在较古旧或文学语境中，也可指“未婚少女”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female household worker who cleans, tidies, and helps with chores in a home or hotel; a housekeeper.","zh":"女佣；女仆；（家中或旅馆的）清洁/家务人员。"},"examples":[{"en":"The hotel maids clean the rooms every morning.","zh":"旅馆的女清洁员每天早上打扫房间。"},{"en":"She worked as a maid to support her family.","zh":"她当女佣来养家。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “maid”: a young unmarried woman (older or literary use); also used in titles like “maid of honor.”","zh":"“maid”的复数：未婚年轻女子（较古旧/文学用法）；也用于称谓如“chief bridesmaid/maid of honor（伴娘/首席伴娘）”。"},"examples":[{"en":"In old stories, maids and knights often appear together.","zh":"在古老的故事里，少女与骑士常常同时出现。"},{"en":"Her maids helped prepare her wedding dress. (old-fashioned)","zh":"她的侍女帮她准备婚纱。（较古旧）"}]}],"synonyms":["housekeepers","cleaners","room attendants","household helpers"],"phonetic":"/meɪdz/","extraExplanation":["“maid”现在最常见的意思是“做清洁/家务的人”，但这个说法在一些语境里可能带有阶层或性别刻板印象。更中性、更常用的说法包括：housekeeper（家政/客房服务员）、cleaner（清洁员）、household helper（家务助手）。在酒店场景里也常说room attendant（客房服务员）。","文学或古英语里，maid 还可以指“少女/处女”，如 maiden（少女；处女）更明确、偏文学。"]}
{"word":"maidservant","summary":{"en":"A maidservant is a female domestic servant, a term often used in historical or literary settings.","zh":"maidservant 指女仆/女佣，多用于历史或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female domestic servant (a woman employed to do household work, often in older or historical contexts)","zh":"女仆；女佣（受雇做家务的女性，常见于较早或历史语境）"},"examples":[{"en":"In the novel, the maidservant rises before dawn to light the fires and prepare breakfast.","zh":"在小说里，女仆天不亮就起床生火并准备早餐。"},{"en":"The wealthy family employed a maidservant to clean the rooms and wash the clothes.","zh":"那户富有人家雇了一位女佣打扫房间、洗衣服。"}]}],"synonyms":["maid","housemaid","domestic servant","servant"],"phonetic":"/ˈmeɪdˌsɝːvənt/","extraExplanation":["“maidservant”带有较强的时代感，常用于描写维多利亚时代、贵族宅邸或圣经/古典译文等语境。现代日常英语更常用“housekeeper”（管家/女管家，偏管理）或“(domestic) cleaner”（清洁工）等更中性的说法。","词由“maid”（女仆/侍女）+“servant”（仆人）组成，复合后语气更明确指“家中受雇的女仆”。在当代交流中，为避免阶级色彩或冒犯，描述职业时可优先用更中性的职业名称。"]}
{"word":"maidservants","summary":{"en":"“Maidservants” means female domestic workers; it’s an old-fashioned plural form often used in historical or literary contexts.","zh":"“maidservants”指“女仆/女佣”，是较旧式的复数形式，常见于历史或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female domestic worker (now often considered old-fashioned or class-marked); the plural form of “maidservant.”","zh":"女仆；女佣（较旧式、带有阶层色彩的说法）；“maidservant”的复数。"},"examples":[{"en":"In many Victorian novels, maidservants are shown doing laundry, cleaning rooms, and serving meals.","zh":"在许多维多利亚时代小说中，女仆常被描写为洗衣、打扫房间和端饭菜。"},{"en":"The estate employed several maidservants to care for the household.","zh":"这座庄园雇了好几位女仆来照料家务。"}]}],"synonyms":["maids","servants","domestic workers","housemaids"],"phonetic":"/ˈmeɪdˌsɝːvənts/","extraExplanation":["“maidservant”由 maid（女仆/少女）+ servant（仆人）组成，常见于18—19世纪英国（以及受英国影响的写作）中，带有明显的家庭雇佣与阶层背景。现代英语更常用更中性的说法：housekeeper（管家/女管家，偏管理）、cleaner（保洁/清洁工）、domestic worker（家政人员）等。","在经典文学里（如简·奥斯汀、狄更斯等作品的语境中），maidservant不仅指“做家务的人”，也常用来提示人物的社会地位、经济条件和当时的礼仪秩序。"]}
{"word":"maidship","summary":{"en":"maidenhood; the condition of being a maid (archaic/literary)","zh":"少女/侍女的身份或状态；少女时期或贞洁（古旧/文学用语）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being a maid; maidenhood (often implying youth or virginity; archaic or literary)","zh":"侍女/少女的身份或状态；处女之身、少女时期（多为古旧或文学用语）"},"examples":[{"en":"In the poem, she mourns the loss of her maidship after marriage.","zh":"在诗中，她哀叹婚后失去了自己的少女身份（maidship）。"},{"en":"Old stories sometimes treat maidship as something to be guarded.","zh":"古老故事有时把少女贞洁（maidship）当作需要守护的东西。"}]}],"synonyms":["maidenhood","virginity","girlhood","chastity"],"phonetic":"ˈmeɪdʃɪp","extraExplanation":["用法提示：现代更常用 maidenhood（少女时期/处女之身）或 virginity（贞洁/处女之身）。maidship 带有更古典、叙事或诗歌的语感。","文化提醒：在一些历史文本里，maidship 常被与婚姻、家族名誉等观念绑定；现代语境谈论相关话题时可更中性、尊重个人选择。"],"etymology":"源自中古英语：maid（少女、侍女）+ -ship（表示“状态/身份”的后缀，如 friendship）。用于表示“少女/侍女的身份或状态”，现代英语中较少见，常见于文学或古风语境。","mnemonic":["把 -ship 记成“身份/状态”（如 friendship=友谊）：maidship=“maid 的身份/状态”。","联想“maid（女仆/少女）+ ship（船）”：一艘载着“少女时期”的船，象征青春/少女身份。"]}
{"word":"maidu","summary":{"en":"Maidu refers to a Native American people in northern California and the languages traditionally spoken by them.","zh":"Maidu 指加州北部的迈杜原住民族群，也指他们传统使用的迈杜语（语言群）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people of northern California, especially in the Sierra Nevada and Sacramento Valley region","zh":"（美国）迈杜人：加利福尼亚北部的一个原住民族群，主要分布在内华达山脉与萨克拉门托谷地一带"},"examples":[{"en":"The Maidu lived in parts of northern California long before European settlers arrived.","zh":"在欧洲移民到来之前，迈杜人早已生活在加利福尼亚北部的部分地区。"},{"en":"Some museums and cultural centers share Maidu history and traditional arts.","zh":"一些博物馆和文化中心会介绍迈杜人的历史与传统艺术。"}]},{"partOfSpeech":"n.","definition":{"en":"the group of related Indigenous languages traditionally spoken by the Maidu people","zh":"迈杜语：迈杜人传统使用的一组相关原住民语言"},"examples":[{"en":"Linguists have worked to document Maidu and support language revitalization.","zh":"语言学家一直在记录迈杜语，并支持语言复兴工作。"},{"en":"She attended a community class to learn basic Maidu greetings.","zh":"她参加了社区课程，学习一些基础的迈杜语问候语。"}]}],"synonyms":["Maidu people","Maiduan languages"],"phonetic":"/ˈmaɪduː/","extraExplanation":["“Maidu”常见于历史、人类学与语言学语境，也常出现在加州本地文化与原住民权益相关的讨论中。","在英语中通常首字母大写（Maidu），表示族群或语言名称。","若你本来想查的是“my dude”（口语：老兄/哥们）或“maid”（女佣/女仆），告诉我上下文，我也可以一起解释对比。"]}
{"word":"maidy","summary":{"en":"“Maidy” is an old-fashioned word meaning “maidenly; like a young, innocent girl.”","zh":"“maidy”是较古旧的词，意思是“少女般的；纯真、稚嫩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Like a maid/maiden; maidenly, youthful, and innocent in appearance or manner.","zh":"（古旧用法）像少女/处女般的；带有少女气质的、年轻而纯真的（外表或举止）。"},"examples":[{"en":"In old poems, a writer might describe a “maidy face” to mean a young, innocent-looking face.","zh":"在一些旧诗文里，作者可能用“maidy face”来形容“年轻纯真的面容”。"},{"en":"The heroine is portrayed with a maidy charm—gentle, shy, and bright-eyed.","zh":"女主角被刻画得带着“少女般的魅力”——温柔、害羞、眼神明亮。"}]}],"synonyms":["maidenly","girlish","youthful","innocent"],"phonetic":"/ˈmeɪdi/","extraExplanation":["“maidy”在现代英语中非常少见，更多见于古典/文学语境。日常表达通常用“maidenly”“girlish”“youthful”“innocent-looking”。","如果你是在聊天或写作中看到“maidy”，也可能是人名/昵称（如“Maidy”），或是拼写误差（例如想写“maidenly”或“mardy”）。你可以给我原句，我可以帮你判断。"]}
{"word":"maiefic","summary":{"en":"Malefic means harmful or evil, especially in astrology or formal contexts.","zh":"Malefic 指“有害的、邪恶的”，尤其常用于占星学或较正式的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"harmful, evil, or causing misfortune (often used in astrology or formal writing).","zh":"有害的；邪恶的；带来不幸的（常用于占星学或较正式的表达）。"},"examples":[{"en":"In astrology, Saturn is sometimes described as a malefic planet.","zh":"在占星学里，土星有时被描述为一颗“凶星”（malefic planet）。"},{"en":"The story warns about a malefic force that brings bad luck.","zh":"这个故事警告人们要小心一种会带来厄运的邪恶力量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) of or relating to wrongdoing; criminal.","zh":"（较少见）与作恶/犯罪有关的；不法的。"},"examples":[{"en":"The novel follows a detective tracking a malefic plot.","zh":"小说讲的是一名侦探追查一个不法阴谋。"}]}],"synonyms":["harmful","evil","malevolent","sinister","baneful"],"phonetic":"/məˈlɛfɪk/","extraExplanation":["你输入的“maiefic”很可能是拼写错误，常见目标词是 **malefic**（凶的/有害的）。","**malefic** 来自拉丁语 *mal-*（坏的）+ *facere*（做），字面意思接近“做坏事的”。在占星学中，常与 **benefic**（吉的/有益的）成对出现。"]}
{"word":"maier","summary":{"en":"Maier is mainly used as a surname; historically (from German) it could mean an estate manager or chief farmer.","zh":"Maier 主要用作姓氏；历史上（源自德语）也可指庄园管家或总管农。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), common in German-speaking and Jewish (Ashkenazi) communities; it is a spelling variant of Meier/Mayer.","zh":"姓氏（家族姓），常见于德语地区及部分犹太（阿什肯纳兹）社群；是 Meier/Mayer 的一种拼写变体。"},"examples":[{"en":"Dr. Maier will present the research results tomorrow.","zh":"Maier 博士明天将展示研究结果。"},{"en":"Her last name is Maier, spelled M-A-I-E-R.","zh":"她的姓是 Maier，拼作 M-A-I-E-R。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, from German) an estate manager or chief farmer; in medieval contexts, a Maier/Meier oversaw a manor or farm for a lord.","zh":"（历史用法，源自德语）庄园管家／总管农；在中世纪语境中，Maier/Meier 指替领主管理庄园或农场的人。"},"examples":[{"en":"In the old record, the Maier is listed as responsible for the manor’s fields.","zh":"在旧档案中，Maier 被记为负责庄园田地的人。"},{"en":"The village Maier collected rents and organized farm work.","zh":"村里的 Maier 收取租金并安排农活。"}]}],"synonyms":["Meier","Mayer"],"phonetic":"/ˈmaɪər/","extraExplanation":["“Maier”多见于人名而非普通词汇。其来源与德语的 Meier/Mayer 同源，历史上与“管家、庄园管理者”有关；在不同地区与移民社群中出现多种拼写（如 Meier、Mayer、Maier）。在英语语境里通常按姓氏使用。"]}
{"word":"maieutic","summary":{"en":"Maieutic describes Socratic-style teaching that draws out someone’s ideas through guided questions.","zh":"Maieutic 指苏格拉底式的“产婆式”教学/提问：用引导问题促使对方自己得出想法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A method of teaching or questioning that helps someone discover ideas or knowledge for themselves (often through guided questions).","zh":"（常通过引导式提问）帮助对方“自己得出答案/发现知识”的教学或提问方法。"},"examples":[{"en":"The tutor used a maieutic approach, asking questions instead of giving answers.","zh":"老师采用“产婆式”的引导方法，用提问代替直接给答案。"},{"en":"Socrates is famous for maieutic dialogue that leads people to examine their beliefs.","zh":"苏格拉底以“产婆式”对话著称，引导人们反思自己的信念。"}]},{"partOfSpeech":"n.","definition":{"en":"The practice or technique of drawing out ideas through guided questioning; the “midwifery” of thought.","zh":"通过引导式提问把想法“引出来”的技巧；一种“思想的接生术/产婆术”。"},"examples":[{"en":"In the seminar, maieutic was used to help students form their own arguments.","zh":"在研讨课上，大家用“产婆式提问”帮助学生形成自己的论证。"}]}],"synonyms":["Socratic","inquisitive","eliciting","probing","dialectical"],"phonetic":"/ˌmeɪ.juˈtɪk/","extraExplanation":["“maieutic”源自希腊语，字面意思与“助产/接生”有关。苏格拉底把自己比作“思想的产婆”：他不把知识“灌输”给别人，而是用一连串问题帮助对方把心中已有但未成形的观点“生出来”。","常见搭配：maieutic method（产婆式方法）、maieutic questioning（产婆式提问）、maieutic dialogue（产婆式对话）。学习写作或讨论时，这个词常用来描述“用问题引导思考”的课堂风格。","文学/文化提及：在柏拉图《泰阿泰德篇》（Theaetetus）中，苏格拉底明确谈到自己的“产婆术”（midwifery）式辩证法，常被认为与 maieutic 的核心思想相呼应。"]}
{"word":"maieutical","summary":{"en":"Maieutical means “Socratic”: guiding someone to discover ideas by asking questions instead of giving answers.","zh":"Maieutical 指“苏格拉底式”的：通过提问引导他人自己发现并表达想法，而非直接给出答案。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a teaching or questioning method) helping someone “give birth” to ideas by guiding them with careful questions rather than directly telling them answers; Socratic.","zh":"（指教学或提问方法）通过循序渐进的提问引导对方“产出”想法，而不是直接给答案；苏格拉底式的。"},"examples":[{"en":"The professor used a maieutical approach, asking questions until students reached the conclusion themselves.","zh":"这位教授采用了“产婆式”引导法，不断提问，直到学生自己推导出结论。"},{"en":"Her maieutical coaching helped the team clarify what they already knew but couldn’t yet express.","zh":"她的苏格拉底式辅导帮助团队把“早已隐约知道却说不清”的想法理顺并表达出来。"}]}],"synonyms":["Socratic","inquisitive","probing","elicitative"],"phonetic":"/ˌmeɪjuˈtɪkəl/","extraExplanation":["“Maieutical”来自希腊语，原义与“助产/接生”相关。苏格拉底把自己比作“思想的助产士”，认为教师/对话者的任务不是灌输知识，而是通过追问、澄清、举例与反问，让对方把内在的理解“生出来”。","常见搭配：maieutical method / maieutical questioning / maieutical dialogue。相关名词是 maieutics（产婆术式的提问法）。"]}
{"word":"maieutics","summary":{"en":"Maieutics is a Socratic, question-based teaching method that helps learners discover answers themselves.","zh":"Maieutics 指苏格拉底式的提问教学法，通过引导性问题让学习者自己发现答案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A method of teaching by asking guiding questions to help someone discover ideas or knowledge for themselves (often linked to Socrates).","zh":"一种通过提出引导性问题来帮助对方自己“产出”想法或知识的教学方法（常与苏格拉底相关）。"},"examples":[{"en":"The professor used maieutics, asking questions until students found the answer on their own.","zh":"教授采用“产婆术”式的提问，引导学生一步步自己找到答案。"},{"en":"In coaching, maieutics can help people clarify what they really want.","zh":"在教练辅导中，“产婆术”式提问能帮助人们澄清自己真正想要的是什么。"}]}],"synonyms":["Socratic method","Socratic questioning","dialectic (in some contexts)"],"phonetic":"/ˌmeɪjuˈtɪks/","extraExplanation":["“maieutics”源自希腊语，字面意思与“助产/接生”有关，所以常被译为“产婆术”。比喻老师像“接生婆”一样，不是把知识直接塞给学生，而是通过提问帮助对方把潜在的想法“生出来”。","常见搭配：the maieutic method（产婆术/苏格拉底式提问法）。相关词：Socratic method（苏格拉底式问答法，范围更广、更常用）。","在英语中该词较学术化，日常交流更常说“the Socratic method”或“teaching through questions”。"]}
{"word":"maigre","summary":{"en":"Maigre means “very thin/lean,” and in traditional cooking it can also mean “meatless.”","zh":"Maigre 表示“很瘦、精瘦”，在传统烹饪语境中也可表示“无肉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, animal, or body part) very thin; lean.","zh":"（人、动物或身体部位）很瘦的；精瘦的。"},"examples":[{"en":"After the long journey, the stray dog looked maigre and tired.","zh":"长途跋涉后，那只流浪狗看起来又瘦又累。"},{"en":"The portrait shows a maigre face with sharp cheekbones.","zh":"那幅画像里是一张消瘦的脸，颧骨很突出。"}]},{"partOfSpeech":"adj.","definition":{"en":"(cooking, traditional) meatless; made without meat (often associated with Lent), typically using fish, vegetables, or eggs.","zh":"（烹饪，传统用法）无肉的；不含肉类的（常与四旬斋/斋戒期相关），多用鱼、蔬菜或鸡蛋制作。"},"examples":[{"en":"They served a maigre menu of fish and vegetables.","zh":"他们提供了一份以鱼和蔬菜为主的无肉菜单。"},{"en":"On Fridays, some families choose a maigre meal instead of meat.","zh":"在周五，有些家庭会选择无肉的一餐来代替吃肉。"}]},{"partOfSpeech":"n.","definition":{"en":"A meatless meal or dish (rare).","zh":"无肉的一餐或一道菜（较少见）。"},"examples":[{"en":"During Lent, the monastery kept to maigres most days.","zh":"四旬斋期间，修道院大多数日子都吃无肉餐。"}]}],"synonyms":["lean","thin","scrawny","gaunt","meager","meatless"],"phonetic":"/ˈmeɡər/","extraExplanation":["“maigre”来自法语，字面意思是“瘦的”。英语里它比较少见，常见于较正式的写作或烹饪语境。","在西方基督教传统中，四旬斋或某些“禁食/守斋”的日子会避免吃肉，因此会出现“maigre menu / maigre dish”这类表达（通常仍可吃鱼）。","发音在英语里往往更“英语化”，不读成法语的喉音“r”。"]}
{"word":"maihem","summary":{"en":"Mayhem means serious chaos or disorder; it can also be an old legal term for causing permanent injury.","zh":"Mayhem 主要表示“严重混乱/失控的局面”；也可作旧法律用语，指“致残重伤罪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of chaos, confusion, or violent disorder.","zh":"混乱；骚乱；失控的局面（常带有暴力或严重无序的含义）。"},"examples":[{"en":"There was mayhem in the street after the fight broke out.","zh":"打架爆发后，街上陷入一片混乱。"},{"en":"The sudden power outage caused mayhem at the airport.","zh":"突然停电导致机场一片大乱。"}]},{"partOfSpeech":"n.","definition":{"en":"In old legal use, the crime of violently injuring someone so they are permanently harmed (rare today).","zh":"（旧法律用语）重伤罪；将人致残的暴力伤害（现代英语中很少用）。"},"examples":[{"en":"In historical texts, “mayhem” could refer to a specific crime, not just general chaos.","zh":"在历史文本里，“mayhem”有时指一种具体罪名，而不只是泛指混乱。"}]}],"synonyms":["chaos","disorder","confusion","havoc","turmoil"],"phonetic":"/ˈmeɪ.hem/","extraExplanation":["你输入的“maihem”通常是拼写错误，正确拼写是 **mayhem**。","在现代口语和新闻里，**mayhem** 多指“严重混乱/大乱”，常见搭配有 **cause mayhem**（造成混乱）、**total/absolute mayhem**（彻底大乱）。"]}
{"word":"maihems","summary":{"en":"“Maihems” is not a standard spelling; it most likely means “mayhems,” the plural of “mayhem,” meaning violent chaos or serious disorder.","zh":"“maihems”不是标准拼写；最可能指“mayhems”（mayhem 的复数），意思是暴力的混乱或严重失序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “mayhems” (plural of “mayhem”): violent chaos, confusion, or serious disorder.","zh":"很可能是“mayhems”（“mayhem”的复数）的拼写错误：指暴力的混乱、骚乱，或严重的失序状态。"},"examples":[{"en":"After the power outage, there was mayhem in the streets.","zh":"停电之后，街上出现了混乱的局面。"},{"en":"The prank caused mayhem in the classroom for a few minutes.","zh":"这个恶作剧让教室里几分钟内乱成一团。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause chaos or destruction; to create trouble (less common; usually used informally or in creative writing).","zh":"制造混乱或破坏；捣乱（较少见，多用于非正式语境或文学/创意表达）。"},"examples":[{"en":"Online rumors can mayhem a community if no one checks the facts.","zh":"如果没人核实事实，网络谣言可能会让一个社群陷入混乱。"}]}],"synonyms":["chaos","disorder","havoc","turmoil","confusion"],"phonetic":"/ˈmeɪˌhɛm/","extraExplanation":["“mayhem”原本是法律用语，指对他人造成严重伤害、使其“失去战斗能力”（例如致残）。现代英语里更常用来泛指“混乱、骚乱、闹剧般的失控局面”。","如果你想表达“麻烦/混乱很多”，更自然的说法常见于：a lot of chaos / total chaos / complete mayhem。"]}
{"word":"maiid","summary":{"en":"Maid most commonly means a female cleaner or domestic worker; it can also mean a young woman in old-fashioned or literary contexts.","zh":"Maid最常指女佣/（酒店）客房服务员；也可指少女/年轻女子（偏旧式或文学用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a girl or young woman (somewhat old-fashioned); also used in set phrases like “old maid.”","zh":"少女；年轻女子（较旧式用法）；也常见于固定搭配，如“old maid”（老处女/未婚老妇）。"},"examples":[{"en":"In old stories, a brave knight might rescue a maid from danger.","zh":"在古老故事里，勇敢的骑士可能会从危险中救出一位少女。"},{"en":"The novel describes her as a country maid with simple dreams.","zh":"小说把她描写成一位怀抱朴素梦想的乡村少女。"}]},{"partOfSpeech":"n.","definition":{"en":"a female domestic worker who cleans rooms, makes beds, and helps in a home or hotel; (also) a hotel housekeeper.","zh":"女仆；女佣；（旅馆）客房服务员/清洁员（负责打扫房间、铺床等）。"},"examples":[{"en":"The hotel maid cleaned the room and changed the towels.","zh":"酒店的客房服务员打扫了房间并更换了毛巾。"},{"en":"She worked as a maid to support her family.","zh":"她当女佣来养家。"}]}],"synonyms":["housekeeper","cleaner","domestic worker","servant"],"phonetic":"/meɪd/","extraExplanation":["你输入的“maiid”很可能是拼写错误，常见目标词是“maid”。","“maid”在现代英语里更常指“（酒店/家庭）女佣、清洁人员”；表示“少女/年轻女子”的意思带有文学或旧式色彩，常见于童话、历史故事或诗歌语境。"]}
{"word":"maiidae","summary":{"en":"Maiidae is the scientific family name for spider crabs.","zh":"Maiidae 是“蜘蛛蟹科”的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine crustaceans known as spider crabs, typically with long legs and often a rough, spiny shell; many species camouflage themselves by attaching algae or small organisms to their bodies","zh":"蜘蛛蟹科（海洋甲壳动物的一科），通常腿很长、甲壳粗糙或多刺；许多种类会把藻类或小生物“装饰”在身上用来伪装"},"examples":[{"en":"The Japanese spider crab belongs to the family Maiidae.","zh":"日本蜘蛛蟹属于蜘蛛蟹科（Maiidae）。"},{"en":"Some Maiidae species decorate their shells with seaweed to blend in.","zh":"一些蜘蛛蟹科的物种会用海藻装饰甲壳来融入环境。"}]}],"synonyms":["spider-crab family"],"phonetic":"/ˈmaɪ.ə.diː/","extraExplanation":["“Maiidae”是生物分类学中的“科名”，常见于科学写作或纪录片解说；日常英语里更常说“spider crab（蜘蛛蟹）”。","英语里科名/属名等拉丁化名称通常首字母大写且用斜体（Maiidae），但在一般文本中也常见不使用斜体的写法。","“Maiidae”读音在不同地区可能略有差异；学习时更重要的是能把它和常用名“spider crabs”对应起来。"]}
{"word":"mail","summary":{"en":"Mail most commonly means letters and packages sent through the post; it can also mean to send something by post, and sometimes it refers to email (especially in British English).","zh":"mail 最常指邮政投递的信件和包裹；也可作动词表示“邮寄”；有时（尤其英式英语）也可指电子邮件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"letters and packages sent or delivered to people (post).","zh":"（总称）邮件；信件和包裹（邮政投递的东西）。"},"examples":[{"en":"Did you get any mail today?","zh":"你今天收到邮件了吗？"},{"en":"The mail usually arrives around noon.","zh":"邮件通常中午左右送到。"}]},{"partOfSpeech":"v.","definition":{"en":"to send something by post or by an official delivery service.","zh":"邮寄；通过邮政或官方投递服务寄送。"},"examples":[{"en":"Please mail this letter for me.","zh":"请帮我把这封信寄出去。"},{"en":"We mailed the package yesterday.","zh":"我们昨天把包裹寄出了。"}]},{"partOfSpeech":"n.","definition":{"en":"email (used especially in British English; in American English, people usually say “email”).","zh":"电子邮件（尤其英式英语常说 mail；美式英语更常说 email）。"},"examples":[{"en":"I’ll send you the details by mail.","zh":"我会用邮件把细节发给你。（此处多指电子邮件的用法）"}]}],"synonyms":["post","letters","parcel","send","ship"],"phonetic":"/meɪl/","extraExplanation":["在美式英语里，mail 通常指“实体邮政邮件/信件包裹”，而电子邮件更常说 email。比如：check the mail（查看邮箱/收信）多指实体信件；check my email（查邮箱）更明确指电子邮件。","常见搭配：mailbox（邮箱）、mail carrier / mailman（邮递员）、junk mail（垃圾广告邮件）、mailing address（邮寄地址）、mail something to someone（把某物寄给某人）。"]}
{"word":"mail-and-plate","summary":{"en":"Mixed armor combining chain mail and metal plates.","zh":"锁子甲与金属板甲结合的混合盔甲。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A type of medieval armor that combines chain mail (linked rings) with rigid metal plates for extra protection.","zh":"一种中世纪盔甲形式，把锁子甲（铁环编成）与金属板甲结合，以获得更强防护。"},"examples":[{"en":"The knight wore mail-and-plate to protect his chest and shoulders in battle.","zh":"那名骑士穿着锁子甲与板甲结合的盔甲，在战斗中保护胸部和肩部。"},{"en":"In the museum, you can see how mail-and-plate was a step between full chain mail and full plate armor.","zh":"在博物馆里，你能看到这种“锁子甲+板甲”是从全锁子甲过渡到全板甲的一步。"}]}],"synonyms":["mixed armor","mail and plate armor","mail-and-plate armor","hybrid armor","chain-and-plate"],"phonetic":"/ˌmeɪl ən ˈpleɪt/","extraExplanation":["mail 指的是由许多金属小环相互扣连而成的链甲（锁子甲），对劈砍较有效，但对强力穿刺的防护相对弱一些；plate 指较硬的金属板，用来加强身体关键部位（如胸、肩、肘、膝）。","在中世纪晚期，一些士兵或骑士会在锁子甲外加板片（例如胸甲、肩甲），因此会出现 mail-and-plate 这类“混合甲”。在奇幻作品或角色扮演游戏中也常用来描述装备档次。"],"etymology":"由 mail（锁子甲；本义与“网状/环扣结构”相关）+ and + plate（板甲；金属板）组成的复合表达，用来指“锁子甲与板甲混搭”的护甲类型；常见于历史、军事史与奇幻文学语境。","mnemonic":["把它拆开记：mail＝“锁子（环环相扣像邮寄包裹的链条）”，plate＝“铁板（像盘子/板子一样硬）”，合起来就是“链+板”的盔甲。","联想中文“锁子甲 + 板甲”四个字：看到 and 就直接脑补“加上/外加”。"]}
{"word":"mail-armored","summary":{"en":"protected by armor, especially chain mail","zh":"被铠甲（尤指锁子甲）保护的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"protected by armor, especially chain mail; wearing armor","zh":"穿着铠甲的；（尤指）穿锁子甲防护的"},"examples":[{"en":"In the painting, a mail-armored knight stands beside the king.","zh":"在这幅画里，一位穿锁子甲的骑士站在国王身旁。"},{"en":"Mail-armored soldiers were slower, but they could survive many sword blows.","zh":"穿锁子甲的士兵行动更慢，但能扛住许多刀剑的砍击。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) emotionally guarded; hard to affect or persuade","zh":"（比喻）把自己“武装起来”的；不易被打动或说服的"},"examples":[{"en":"He stayed mail-armored in the meeting, giving away almost nothing.","zh":"他在会议上把自己“武装得严严实实”，几乎不透露任何信息。"},{"en":"Her mail-armored calm made it difficult to argue with her.","zh":"她那种“铠甲般”的冷静让人很难与她争辩。"}]}],"synonyms":["armored","armoured","mail-clad","chainmailed","mail-coated"],"phonetic":"ˌmeɪl ˈɑrmərd","extraExplanation":["学习提示：这里的 mail 不是“邮件”，而是“锁子甲/链甲”（也常写作 chain mail / chainmail）。在文学或奇幻题材里很常见，用来描写骑士或战士的防具。"],"etymology":"来自“mail（锁子甲）+ armored（穿甲的）”。其中 mail 指中世纪的“锁子甲”，源自古法语 maille（网眼、环），与“邮件”post/mail 无关。","mnemonic":["把 mail 记成“像网（网眼/金属环）一样的甲”：maille≈“网眼”，所以 mail-armored=“网甲加身”。","联想：奇幻游戏里“链甲（chain mail）”是常见装备；mail-armored 就是“穿链甲的”。"]}
{"word":"mail-clad","summary":{"en":"armored in chain mail","zh":"披锁子甲的；穿链甲的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing chain mail (a protective armor made of many interlinked metal rings); armored.","zh":"身穿锁子甲（由许多金属环扣连而成的护甲）；披甲的。"},"examples":[{"en":"The mail-clad knight rode into the courtyard at dawn.","zh":"身穿锁子甲的骑士在黎明时骑入庭院。"},{"en":"In the story, a mail-clad guard stands at the castle gate.","zh":"在故事里，一名披锁子甲的卫兵守在城堡大门口。"},{"en":"The artist painted mail-clad warriors with spears and round shields.","zh":"画家画了披锁子甲、持长矛和圆盾的战士。"}]}],"synonyms":["armored","chain-mailed","mail-armored","mail-coated","mail-shirted"],"phonetic":"/ˈmeɪl ˌklæd/","extraExplanation":["mail 在这里不是“邮件”，而是“锁子甲”。在中古英语和历史/奇幻语境中很常见。","常见于文学、史诗、历史题材与奇幻作品，用来营造“中世纪骑士/战士”的画面感。"],"etymology":"源自英语 mail（锁子甲，来自古法语 maille“网眼、金属环/网状物”）+ clad（穿着……的，来自古英语 clāþ“衣物”相关）。整体意思是“穿着锁子甲的”。","mnemonic":["把它拆开记：mail（锁子甲）+ clad（穿着）= 穿着锁子甲。","联想对比：mail（邮件）装在信封里；mail（锁子甲）“一圈圈像网状的金属环”。看见中世纪画面就选“锁子甲”的 mail。"]}
{"word":"mail-free","summary":{"en":"without postal mail or with postage included at no extra cost","zh":"无邮件相关；或免邮费（邮资已含）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving postal mail; with no mail delivered, sent, or handled","zh":"不涉及邮政邮件的；没有邮件投递/收发的"},"examples":[{"en":"The island has a mail-free day each week because the boat doesn’t come.","zh":"这个岛每周有一天是“无邮件日”，因为船不会来。"},{"en":"For security reasons, the facility runs a mail-free policy for new arrivals.","zh":"出于安全原因，该机构对新来人员实行不收发邮件的政策。"}]},{"partOfSpeech":"adj.","definition":{"en":"sent or provided with no mailing charge (postage included)","zh":"免邮费的（邮资已含/不另收费）"},"examples":[{"en":"Members receive mail-free delivery on all orders over $50.","zh":"会员满50美元可享受免邮配送。"},{"en":"Please use the mail-free envelope provided in the package.","zh":"请使用包装内附的免邮回邮信封。"}]}],"synonyms":["postage-free","postage-paid","freepost","free shipping","no-mail"],"phonetic":"/ˈmeɪl friː/","extraExplanation":["含义要看语境：\n1) mail-free day/policy = “没有邮件（投递/收发）”。\n2) mail-free delivery/envelope = “免邮费/免邮资”。\n在网购场景里，美式英语通常更常说 free shipping（免运费）；英式或更正式语境里常见 postage-free（免邮资）。"],"etymology":"这是由 mail（邮件/邮寄）+ free（免除的/没有的）构成的复合形容词。连字符常用于强调“无邮件”或“免邮费”这两种含义；实际使用中更常见的同义表达是 postage-free 或 free shipping。","mnemonic":["把它拆开记：mail（邮件）+ free（免）→ “免邮件/免邮费”。","联想中文电商常见的“包邮/免邮”，对应 mail-free（更偏“邮费免费”这一用法）。"]}
{"word":"mail-related","summary":{"en":"connected with mail or email","zh":"与邮件/电子邮件有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with mail (letters/parcels) or email; involving sending, receiving, or handling mail.","zh":"与邮政（信件/包裹）或电子邮件有关的；涉及收发或处理邮件的。"},"examples":[{"en":"Please send all mail-related questions to customer support.","zh":"所有与邮件相关的问题请发给客服。"},{"en":"The company is upgrading its mail-related security systems to block phishing.","zh":"公司正在升级与邮件相关的安全系统，以拦截钓鱼邮件。"},{"en":"I have some mail-related errands, like mailing a package and buying stamps.","zh":"我有一些与邮政相关的事要办，比如寄包裹和买邮票。"}]}],"synonyms":["email-related","postal-related","mail-associated","mail-connected","correspondence-related"],"phonetic":"/ˈmeɪl rɪˌleɪtɪd/","extraExplanation":["mail 在英语里既可以指“邮政邮件（信件/包裹）”，也可以指“电子邮件（email）”。实际含义通常要看语境：出现 stamps、post office、package 多半是邮政；出现 inbox、phishing、attachment 多半是电子邮件。","写作中也常用近似表达：mail-related issues/tasks/activities，或更明确的 postal-related（偏邮政）/ email-related（偏电子邮件）。"],"etymology":"这是由“mail + related”构成的复合形容词，其中 related 表示“与……有关”。常见于书面语/商务沟通中，用来把“邮件”当作一个主题领域来描述。","mnemonic":["把它拆开记：mail（邮件）+ related（相关的）= 与邮件相关。","联想中文常见搭配“……相关”：mail-related ≈ “邮件相关”。"]}
{"word":"mailability","summary":{"en":"Mailability means how suitable something is for sending by mail, especially in direct-mail marketing.","zh":"Mailability指某物通过邮政寄送的适合程度，尤其常用于直邮营销语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Business/marketing) The quality of being suitable to send through the mail, especially in direct-mail marketing (e.g., how well an item, package, or campaign can be mailed effectively and legally).","zh":"（商业/营销）可邮寄性；指某物（尤其是直邮营销中的物料、包装或活动）是否适合通过邮政寄送，以及寄送是否高效、合规。"},"examples":[{"en":"Before printing the brochures, the team tested their mailability to make sure they met postal size rules.","zh":"在印刷宣传册之前，团队测试了它们的可邮寄性，确保符合邮政尺寸规定。"},{"en":"Better packaging improved the product’s mailability and reduced shipping damage.","zh":"更好的包装提高了产品的可邮寄性，并减少了运输损坏。"}]}],"synonyms":["mailing suitability","postal suitability","mail readiness"],"phonetic":"/ˌmeɪləˈbɪləti/","extraExplanation":["“mailability”在日常口语中不常见，更常出现在直邮（direct mail）、邮政规范、印刷与包装行业的语境里。","在直邮营销中，mailability常与邮资成本（postage cost）、邮政规定（postal regulations）、可投递性/可分拣性（machinability）等因素一起讨论。"]}
{"word":"mailable","summary":{"en":"“Mailable” means “able/suitable to be sent by mail.”","zh":"“mailable”指“可邮寄的/符合邮寄要求的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be sent by mail (especially by a postal service); suitable for mailing.","zh":"可邮寄的；适合用邮政寄送的。"},"examples":[{"en":"Is this package mailable, or do I need a different box?","zh":"这个包裹可以邮寄吗，还是我需要换一个盒子？"},{"en":"Lithium batteries aren’t always mailable by regular air mail.","zh":"锂电池不一定能用普通航空邮件寄送。"},{"en":"The post office rejected it because the address label wasn’t mailable.","zh":"邮局拒收了，因为地址标签不符合邮寄要求。"}]}],"synonyms":["maillable (variant spelling)","postable","sendable","fit for mailing"],"phonetic":"/ˈmeɪləbl/","extraExplanation":["“mailable”常见于邮政/物流、跨境电商与合规说明中，表示“符合邮寄规定”。是否mailable通常取决于尺寸、重量、包装方式，以及是否属于禁寄/限寄物（如液体、易燃品、电池等）。","近义表达可用“eligible to be mailed / fit for mailing”。在实际沟通里也常直接说“Can I mail this?”（我能寄这个吗？）而不是用mailable。"]}
{"word":"mailbag","summary":{"en":"Mailbag means either a bag for carrying mail, or a Q&A segment made from audience messages.","zh":"mailbag既指装信件包裹的邮袋，也指媒体中整理读者/听众来信并回应的问答环节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bag or pouch used to carry letters and packages for delivery.","zh":"邮袋；邮包（用于装载和投递信件、包裹的袋子）"},"examples":[{"en":"The mail carrier slung the mailbag over his shoulder.","zh":"邮递员把邮袋挎在肩上。"},{"en":"She found the missing letter at the bottom of the mailbag.","zh":"她在邮袋底部找到了那封丢失的信。"}]},{"partOfSpeech":"n.","definition":{"en":"A newspaper, magazine, podcast, or TV segment where readers/listeners send in questions or comments and the host/editor responds.","zh":"读者来信/问答专栏（或节目环节）；“来信袋”（收集提问与留言并回复）"},"examples":[{"en":"This week’s mailbag answers questions about learning English.","zh":"本周的“来信问答”解答了关于学英语的问题。"},{"en":"The host opened the mailbag and read listener comments.","zh":"主持人打开“来信袋”，朗读听众留言。"},{"en":"Send your questions for our Friday mailbag.","zh":"把你的问题发来，周五的问答环节会回复。"}]}],"synonyms":["mail sack","postal bag","letters column","Q&A","inbox"],"phonetic":"/ˈmeɪlˌbæɡ/","extraExplanation":["“mailbag”作比喻义时，常见于媒体与网络内容：把读者/观众来信想象成装在一个袋子里，编辑或主持人“打开袋子”逐条回应。类似表达还有“letters to the editor（致编辑的来信）”“Q&A（问答）”。"]}
{"word":"mailbags","summary":{"en":"Mailbags are bags for carrying mail; in media, “the mailbag” can mean letters/messages from the public or a Q&A segment.","zh":"mailbags 指装运邮件的邮袋；在媒体中，“the mailbag”也可指读者来信/听众留言或读信问答环节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bags used by a postal service to hold and carry letters and packages.","zh":"（邮政）邮袋；装运信件和包裹的袋子。"},"examples":[{"en":"The post office loaded the mailbags onto the truck.","zh":"邮局把邮袋装上了卡车。"},{"en":"Several mailbags were missing after the flight landed.","zh":"飞机降落后，有几个邮袋不见了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Media) Letters or messages sent in by the public; also a section in a newspaper, radio show, or podcast where these are read and answered.","zh":"（媒体）读者/听众来信来信专栏；也可指节目中读信并回应的环节。"},"examples":[{"en":"This week’s mailbag includes questions about study tips.","zh":"本周的来信专栏收到了关于学习方法的问题。"},{"en":"The host answered three emails in the mailbag segment.","zh":"主持人在来信环节回答了三封邮件。"}]}],"synonyms":["mail sacks","postal bags","mail pouch","reader mail","letters to the editor"],"phonetic":"/ˈmeɪlˌbæɡz/","extraExplanation":["“mailbags”是“mailbag”的复数。第一义更偏向实体的“邮袋”；第二义是媒体用法，常见单数形式“the mailbag”（来信专栏/来信环节），复数“mailbags”也能用，但通常用于强调“很多来信/很多来信内容”。"]}
{"word":"mailbox","summary":{"en":"A mailbox is a container for physical mail or, in email, a place/account where messages are received.","zh":"mailbox 指收取/投递纸质邮件的邮箱/邮筒，也可指电子邮件的邮箱（账户或收件处）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A box or container where mail (letters, small packages) is delivered or collected; often found at a home, apartment building, or on a street.","zh":"邮箱；邮筒：用于投递或收取邮件（信件、小包裹）的箱子/容器，常见于住宅、楼房或街道上。"},"examples":[{"en":"Please put the letter in the mailbox before 5 p.m.","zh":"请在下午五点前把信放进邮筒/邮箱里。"},{"en":"I checked my mailbox, but there was no mail today.","zh":"我看了邮箱，但今天没有邮件。"}]},{"partOfSpeech":"n.","definition":{"en":"An electronic place where email messages are received and stored (often called an inbox).","zh":"（电子）邮箱：接收并保存电子邮件的地方（常指收件箱）。"},"examples":[{"en":"My mailbox is full, so I can’t receive new emails.","zh":"我的邮箱满了，所以收不到新邮件了。"},{"en":"Check your mailbox for the confirmation email.","zh":"请在邮箱里查看确认邮件。"}]}],"synonyms":["letterbox","postbox","inbox"],"phonetic":"/ˈmeɪlˌbɑks/","extraExplanation":["美式英语里，mailbox 通常指家门口或公寓楼里的“信箱”；街边用于寄信的红蓝色大邮筒也常被叫 mailbox。英式英语中街边寄信的邮筒更常说 postbox。","在电子邮件语境中，mailbox 有时指整个邮箱账户或某个邮件文件夹；更日常的说法通常是 inbox（收件箱）。"]}
{"word":"mailboxes","summary":{"en":"“Mailboxes” most commonly means more than one physical mailbox; it can also mean multiple email inboxes/accounts.","zh":"“Mailboxes”通常指多个实体邮箱；在计算机语境中也可指多个电子邮箱/收件箱或账号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mailbox”: boxes or containers used for sending, receiving, or collecting mail.","zh":"“mailbox”的复数：用于投递、接收或收集邮件的箱子/容器。"},"examples":[{"en":"Please put the letters in the mailboxes by the entrance.","zh":"请把信放到入口处的邮箱里。"},{"en":"The apartment building has twelve mailboxes, one for each unit.","zh":"这栋公寓楼有十二个邮箱，每户一个。"}]},{"partOfSpeech":"n.","definition":{"en":"Email inboxes or accounts (common in computing).","zh":"（计算机）电子邮箱/收件箱或邮箱账号。"},"examples":[{"en":"Our support team checks several mailboxes throughout the day.","zh":"我们的客服团队每天会查看几个邮箱。"},{"en":"Please don’t send large files to these shared mailboxes.","zh":"请不要把大文件发送到这些共享邮箱。"}]}],"synonyms":["postbox","letterbox","inboxes"],"phonetic":"/ˈmeɪlˌbɑks/","extraExplanation":["美式英语里 mailbox 常指家门口的“私人邮箱”（收信），也可指街边的“邮筒”（寄信）；英式英语更常用 postbox 指街边邮筒，用 letterbox 指门上的投信口或收信箱。具体含义通常看场景。"]}
{"word":"mailcatcher","summary":{"en":"Mailcatcher is most commonly a development/testing tool that captures outgoing emails so you can view them without actually sending them.","zh":"mailcatcher 最常指开发/测试用的邮件拦截工具，用来抓取应用发出的邮件并在本地查看，避免真实发送。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a software tool (often used in development/testing) that receives and stores outgoing emails so you can view them safely without sending them to real addresses","zh":"（常用于开发/测试的）邮件拦截工具：接收并保存应用发出的邮件，方便在本地查看，而不会真的发送到真实邮箱"},"examples":[{"en":"In development, we route all emails to MailCatcher so customers don’t receive test messages.","zh":"在开发环境里，我们把所有邮件都转到 MailCatcher，这样客户就不会收到测试邮件。"},{"en":"Check MailCatcher to see the password-reset link.","zh":"去 MailCatcher 里查看重置密码链接。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something that catches mail (rare; mostly used literally or playfully)","zh":"收取/接住邮件的人或物（较少见，多为字面或玩笑用法）"},"examples":[{"en":"The doorman joked that he was the building’s mailcatcher.","zh":"门卫开玩笑说自己是这栋楼的“收信员”。"}]}],"synonyms":["email catcher","mail trap","test SMTP server","MailHog"],"phonetic":"/ˈmeɪlˌkætʃər/","extraExplanation":["在软件开发语境里，“MailCatcher”常指一个具体的开源工具名（也可能泛指同类工具）。它通常在本地开启一个 SMTP 服务把邮件“截住”，并提供网页界面让你查看邮件内容与附件。","类似用途的工具还有 MailHog、smtp4dev 等；目标都是让测试邮件不外发，避免误发给真实用户。"]}
{"word":"mailclad","summary":{"en":"Mailclad means wearing metal armor, especially chain mail, and is common in historical or fantasy writing.","zh":"mailclad 指“身穿金属甲胄（尤指锁子甲）”，常见于历史或奇幻题材描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wearing mail (a protective armor made of many small metal rings or plates); armored","zh":"身穿锁子甲（或金属甲胄）的；披甲的"},"examples":[{"en":"The mailclad knight rode into the courtyard.","zh":"身披锁子甲的骑士骑进了庭院。"},{"en":"In old stories, heroes are often described as mailclad before battle.","zh":"在古老故事里，英雄上战场前常被描写为披甲的。"}]}],"synonyms":["armored","in chainmail","mail-armored","clad in mail"],"phonetic":"/ˈmeɪlˌklæd/","extraExplanation":["“mail”在这里不是“邮件”，而是指中世纪常见的金属护甲（尤指由许多金属环扣连而成的“chain mail/chainmail”，中文常译“锁子甲”）。因此 mailclad 多见于历史、奇幻、史诗类写作，带有古风与画面感。","拼写上也常见连写或变体：mail-clad / mail clad。现代更常用的相关表达有 “armored” 或 “in chainmail”。"]}
{"word":"mailcoach","summary":{"en":"A horse-drawn coach used for carrying mail (often with passengers) on scheduled routes in the past.","zh":"过去用于定期运送邮件（常兼载客）的马拉邮政马车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A horse-drawn coach (carriage) used to carry mail, and often passengers, on regular routes before trains and modern postal trucks.","zh":"邮政马车；驿车（在铁路和现代邮政运输出现前，用马拉车定期运送邮件，常也载客）。"},"examples":[{"en":"In the 1800s, the mail coach brought letters and newspapers to small towns.","zh":"在19世纪，邮政马车把信件和报纸送到小镇。"},{"en":"She read a novel set in England where a thief stopped the mail coach on a dark road.","zh":"她读到一本以英国为背景的小说：小偷在黑夜的路上拦截邮政马车。"},{"en":"The inn advertised fresh horses for passing mail coaches.","zh":"那家客栈广告说可为路过的邮政马车提供新马匹。"}]}],"synonyms":["post coach","mail carriage","stagecoach (related)"],"phonetic":"/ˈmeɪl ˌkoʊtʃ/","extraExplanation":["“mail coach”常出现在英国历史语境中，尤其是18—19世纪。它与“stagecoach（驿站客车）”很接近：stagecoach更强调载客与分段换马；mail coach更强调运送邮件，但很多时候也会搭载乘客。","文学与文化作品里，mail coach常用来营造“长途旅行、驿站、夜路、强盗拦车”的氛围，在狄更斯等描写19世纪英国生活的作品中也能看到类似场景。"]}
{"word":"maile","summary":{"en":"Maile is a fragrant Hawaiian vine commonly used to make leis and for ceremonial decoration.","zh":"Maile 是一种有香味的夏威夷藤本植物，常用于制作花环（lei）和仪式装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant Hawaiian vine (often used to make leis and for ceremonial decoration)","zh":"一种带香气的夏威夷藤本植物（常用来制作花环/花链 lei，并用于仪式装饰）"},"examples":[{"en":"She wore a maile lei at the graduation ceremony.","zh":"她在毕业典礼上戴了一串 maile（香藤）花环。"},{"en":"Maile is valued in Hawaii for its sweet scent.","zh":"在夏威夷，maile 因其甜美的香气而备受珍视。"},{"en":"The hula dancers carried maile leaves as part of the performance.","zh":"草裙舞舞者在表演中拿着 maile 叶子作为道具。"}]}],"synonyms":["maile vine","Hawaiian maile"],"phonetic":"/ˈmaɪleɪ/","extraExplanation":["“Maile”是夏威夷文化中很有代表性的植物名，常与“lei（花环/花链）”一起出现，用于庆典、欢迎仪式、毕业、婚礼等场合。","英语里它通常保留夏威夷语拼写与发音，因此在夏威夷相关文本、旅游介绍、文化报道中较常见。"]}
{"word":"mailed","summary":{"en":"“Mailed” means “sent by mail” and is the past form of “mail.”","zh":"“mailed”表示“已邮寄/寄出”，是动词“mail”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"sent a letter, package, or email (as past tense/past participle of “mail”)","zh":"（mail 的过去式/过去分词）寄出；邮寄；（也可指）发送邮件"},"examples":[{"en":"I mailed the documents yesterday.","zh":"我昨天把文件寄出去了。"},{"en":"Your package was mailed this morning.","zh":"你的包裹今天早上已经寄出了。"},{"en":"She mailed me the photos after the trip.","zh":"旅行结束后，她把照片寄给了我。"}]}],"synonyms":["sent","posted","shipped"],"phonetic":"/meɪld/","extraExplanation":["“mailed”最常见用法是动词“mail”的过去式/过去分词，表示“已经寄出”。在美式英语里，mail既可指传统邮政（letters/packages），也常用于较口语的“发邮件（email）”，但正式场合更常说“email/emailed”。","常见搭配：mailed a letter/package；mailed it to someone（寄给某人）；mailed someone something（把某物寄给某人）。"]}
{"word":"mailer","summary":{"en":"A mailer is a sender of mail, or an advertising/information item sent through the mail.","zh":"mailer 可指寄件方，也可指通过邮寄发送的宣传/信息材料（邮寄广告）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that sends mail (letters, packages, or emails), especially regularly","zh":"（经常）寄送邮件/信件/包裹的人或公司；寄件方"},"examples":[{"en":"The mailer must write the correct address and include enough postage.","zh":"寄件方必须写对地址并贴足邮资。"},{"en":"Our warehouse is the mailer for all online orders.","zh":"我们的仓库负责寄出所有网购订单。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece of mail used for advertising or information, such as a brochure, flyer, or coupon packet","zh":"（用于宣传或告知的）邮寄广告、宣传单、小册子（等）"},"examples":[{"en":"I got a mailer with coupons from the local supermarket.","zh":"我收到一份本地超市寄来的优惠券邮寄广告。"},{"en":"The campaign sent out a mailer to voters last week.","zh":"那场竞选上周向选民寄出了宣传单。"}]}],"synonyms":["sender","shipper","direct-mail piece","flyer","brochure"],"phonetic":"/ˈmeɪlər/","extraExplanation":["在美国英语里，mailer 很常见于“direct mail（直邮广告）”的语境，指实体的宣传材料（明信片、小册子、折页等）。在数字语境中也有人把批量营销邮件称为 mailer，但更常说“email campaign / marketing email”。"]}
{"word":"mailers","summary":{"en":"“Mailers” most often means promotional materials sent by post (direct mail), and can also mean the sender or a mailing envelope/packaging.","zh":"“mailers”最常指邮寄的宣传广告（直邮），也可指寄件人或用于邮寄的信封/邮寄包装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) Promotional material or an item sent through the post, often used in advertising (\"direct mail\").","zh":"（常用复数）邮寄的宣传材料/广告邮件（直邮），或通过邮局寄送的物品。"},"examples":[{"en":"I got a bunch of mailers from local restaurants this week.","zh":"我这周收到了很多本地餐馆寄来的广告邮件。"},{"en":"The campaign sent mailers to every registered voter.","zh":"竞选团队给每位登记选民都寄了宣传信件。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or company that mails letters or packages; someone who sends things by mail.","zh":"寄件人；寄送信件或包裹的个人或公司。"},"examples":[{"en":"The mailer forgot to include a return address.","zh":"寄件人忘了写回邮地址。"},{"en":"Large mailers often get discounts from the postal service.","zh":"大宗寄件公司通常能从邮政获得折扣。"}]},{"partOfSpeech":"n.","definition":{"en":"A container or envelope designed for mailing, especially protective packaging (e.g., a padded mailer).","zh":"（邮寄用）信封/邮寄袋；尤指带保护层的包装（如气泡信封）。"},"examples":[{"en":"Please put the book in a padded mailer before shipping.","zh":"请把书放进气泡信封再寄出。"},{"en":"These mailers keep documents from bending.","zh":"这种邮寄袋能防止文件折弯。"}]}],"synonyms":["direct mail","flyers","circulars","promotional mail","padded envelope"],"phonetic":"/ˈmeɪlər/","extraExplanation":["在北美，“mailers”很常见于商业语境，尤其是直邮营销（direct mail）：把优惠券、传单、明信片等寄到住户信箱。很多人会把这类“广告信”统称为 mailers 或 junk mail（垃圾邮件/广告邮寄品）。注意：junk mail 也可能被用来指电子邮箱里的垃圾邮件，但更常见的电子邮件说法是 spam。"]}
{"word":"mailes","summary":{"en":"“Mailes” is rare in everyday English; it can mean the plural of “maile” (a Hawaiian plant used for leis) or a surname.","zh":"“mailes”在日常英语中较少见；可指“maile”（用于制作夏威夷花环的植物）的复数，或作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Plural of “maile”: a fragrant Hawaiian vine whose leaves are used to make leis (garlands).","zh":"（少见）“maile”的复数：一种夏威夷的芳香藤本植物，其叶子常用来制作花环（lei）。"},"examples":[{"en":"Maile is traditional in Hawaiian ceremonies, and people may wear maile leis at weddings.","zh":"Maile 在夏威夷传统仪式中很常见，人们可能在婚礼上佩戴 maile 花环。"},{"en":"Some shops sell leis made from maile or from plants that look similar.","zh":"有些商店卖用 maile 或外形相似植物制作的花环。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Mailes will see you now.","zh":"Mailes 医生现在可以见你。"}]}],"synonyms":["lei vine (context)","Hawaiian vine (context)"],"phonetic":"/ˈmaɪleɪz/","extraExplanation":["“mailes”在日常英文里并不常见；很多时候可能是拼写误差，常见想表达的是：miles（英里）或 mails（邮件，mail 的复数/第三人称）。如果你告诉我你看到它的句子，我可以帮你判断具体是哪一个。","“maile”来自夏威夷语，常与“lei（花环）”一起出现，带有强烈的夏威夷文化语境。"]}
{"word":"mailguard","summary":{"en":"Mailguard usually means an email security tool or service that protects inboxes from spam, viruses, and phishing.","zh":"Mailguard 通常指邮件安全防护工具/服务，用于防垃圾邮件、病毒和钓鱼攻击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"software or a service that protects email (mail) by filtering spam, blocking viruses, and preventing phishing or data leaks","zh":"（电子）邮件防护软件或服务：用于过滤垃圾邮件、拦截病毒、防止钓鱼攻击或数据泄露"},"examples":[{"en":"Our company added Mailguard to stop phishing emails before they reach employees.","zh":"我们公司部署了 Mailguard，在钓鱼邮件到达员工之前就把它拦截下来。"},{"en":"Mailguard flagged the message as spam and moved it to the junk folder.","zh":"Mailguard 把这封邮件标记为垃圾邮件，并移到了垃圾箱。"}]},{"partOfSpeech":"n.","definition":{"en":"a person responsible for protecting or monitoring physical mail (letters and packages)","zh":"（较少见）负责看护或监管实体邮件（信件、包裹）的人"},"examples":[{"en":"The building hired a mail guard to prevent package theft.","zh":"这栋楼雇了一个“邮件看护员”来防止包裹被偷。"}]}],"synonyms":["email security","spam filter","anti-spam service","email gateway","mail protection"],"phonetic":"/ˈmeɪlˌɡɑrd/","extraExplanation":["“mailguard”常见于IT语境，也可能是某些公司的产品名/商标；写作时有时会看到 Mailguard、MailGuard 或 mail guard。","这是一个复合词：mail（邮件）+ guard（守卫/防护）。在职场英语里更常用 email security / email gateway / anti-spam service 来泛指这类系统。"]}
{"word":"MailHog","summary":{"en":"a developer tool for catching and viewing test emails","zh":"用于拦截并查看测试邮件的开发工具"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lightweight tool that captures emails sent from an app (via SMTP) so developers can view and test them without delivering to real inboxes.","zh":"一种轻量级的邮件捕获/测试工具：把应用通过 SMTP 发出的邮件先“拦截”下来，便于开发者查看与测试，而不会真的投递到真实邮箱。"},"examples":[{"en":"In development, we point the app’s SMTP settings to MailHog so we can preview password-reset emails safely.","zh":"在开发环境里，我们把应用的 SMTP 配置指向 MailHog，这样就能安全预览“重置密码”邮件。"},{"en":"MailHog shows the message body and headers, which helps us debug formatting and links.","zh":"MailHog 会展示邮件正文和头信息，方便我们排查格式和链接问题。"}]}],"synonyms":["SMTP catcher","email catcher","email testing tool","mail testing tool","mail sink"],"phonetic":"/ˈmeɪlˌhɑɡ/","extraExplanation":["它常用于本地开发或测试环境：应用照常“发邮件”，但邮件被 MailHog 接收并显示在网页界面里（通常也提供简单的 API），避免误发给真实用户。","在正式生产环境一般不会使用它；生产通常接真实的 SMTP/邮件服务商。"],"etymology":"由 mail（邮件）+ hog（“吃很多”的动物，引申为“吞/抓取很多”）组合而来；名称表达“把邮件都吞进来集中查看”的用途。","mnemonic":["把 hog 想成“吃货/吞吞吞”：MailHog = “把邮件都吞下来”给你看。","联想中文“邮件+河豚（很能吃）”：邮件都被它吃进测试箱。"]}
{"word":"mailie","summary":{"en":"“Mailie” is usually a rare personal name spelling (MAY-lee), not a standard English word; it may also be a typo for “mainly.”","zh":"“Mailie”通常是少见的人名拼写（多读作 MAY-lee），不是常见英语词；也可能是“mainly”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare spelling of a given name (often pronounced like “MAY-lee”), seen as a variant of names such as Maile/Maylie/Maylee. It is not a standard English dictionary word.","zh":"一种较少见的名字拼写（常读作“梅-莉”），常被当作 Maile / Maylie / Maylee 等名字的变体。它不是标准英语词典词汇。"},"examples":[{"en":"Mailie is my cousin’s name, but people often misspell it.","zh":"Mailie 是我表姐的名字，但大家经常把它拼错。"},{"en":"How do you pronounce “Mailie”—MAY-lee or MY-lee?","zh":"“Mailie”怎么读——MAY-lee 还是 MY-lee？"}]},{"partOfSpeech":"other","definition":{"en":"(Likely mistake) Sometimes typed when someone means “mainly” (mostly; primarily).","zh":"（可能是误拼）有时人们想写 mainly（主要地；大多），却打成 mailie。"},"examples":[{"en":"I mailie/mainly listen to pop music.","zh":"我主要听流行音乐。"},{"en":"Did you mean “mainly” instead of “mailie”?","zh":"你是想写“mainly”而不是“mailie”吗？"}]}],"synonyms":["mainly (if it was a typo)","mostly","primarily"],"phonetic":"/ˈmeɪli/","extraExplanation":["“Mailie”更常见于人名场景，而不是一般英文词汇。如果你是在聊天/作业里看到的，请结合上下文判断：是人名，还是把“mainly”误拼了。","如果你能提供一句原文（mailie 出现的句子），我可以帮你更准确判断含义和最自然的写法。"]}
{"word":"mailing","summary":{"en":"“Mailing” most commonly means the process of sending items by mail; it can also describe something related to mail, like a mailing address.","zh":"“mailing”最常指“邮寄/寄送的过程”，也可作形容词表示“与邮寄相关的”，如mailing address（邮寄地址）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity or process of sending letters, packages, or messages through the postal system or another delivery service.","zh":"邮寄；寄送（通过邮政系统或其他投递服务寄信件、包裹等的过程/行为）。"},"examples":[{"en":"Mailing usually takes 3–5 business days within the U.S.","zh":"在美国境内邮寄通常需要3到5个工作日。"},{"en":"Please allow extra time for mailing during the holidays.","zh":"节假日期间请预留更长的邮寄时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sent by mail; related to items that are being mailed.","zh":"已邮寄的；与寄送中的物品有关的。"},"examples":[{"en":"Your mailing address is different from your billing address.","zh":"你的邮寄地址与账单地址不同。"},{"en":"We received the mailing documents yesterday.","zh":"我们昨天收到了那份邮寄文件。"}]}],"synonyms":["posting","shipment","dispatch"],"phonetic":"/ˈmeɪlɪŋ/","extraExplanation":["“mailing”常见于表格或网站：mailing address（邮寄地址）、mailing list（邮寄名单/邮件名单）、direct mailing（直邮广告）。在美式英语里，mail既可指“邮件/邮政”，也可泛指“寄送”。","注意区分：mail（名词/动词，邮件/寄送）→ mail something（寄某物）；mailing（名词，寄送行为/邮寄物的统称较少见）。在商务语境中，“mailing”也可指“一批寄出的材料/宣传品”（a mailing）。"]}
{"word":"mailings","summary":{"en":"“Mailings” means items sent by mail (often in bulk), or the act of sending them.","zh":"“mailings”指邮寄物（常为批量群发），也可指寄送这一过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things sent by mail; letters, flyers, or other items that an organization sends to many people (often for information or advertising).","zh":"邮寄物；（常指）群发的邮件/宣传品，如信件、传单等（常用于信息通知或营销）。"},"examples":[{"en":"We received a lot of election mailings this week.","zh":"这周我们收到了很多选举宣传邮件。"},{"en":"The company uses mailings to announce new products.","zh":"这家公司用群发邮寄来发布新产品信息。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of sending things by mail.","zh":"邮寄；寄送（的过程或行为）。"},"examples":[{"en":"Mailings usually go out on Friday.","zh":"邮寄通常在周五寄出。"},{"en":"Please check the mailings schedule before printing the labels.","zh":"打印标签前请先查看寄送时间表。"}]}],"synonyms":["mail","postal mail","direct mail","circulars","flyers"],"phonetic":"/ˈmeɪlɪŋz/","extraExplanation":["“mailings”通常是名词复数，常见于商业或机构语境（如direct mail 直邮营销、newsletter mailings 简报邮寄）。日常口语里，如果只是指“寄出的信”，也常说“letters”或“things I mailed”。"]}
{"word":"maill","summary":{"en":"“Mail” means letters/packages you send or receive, and it can also mean to send them (and informally, to email).","zh":"“mail”指邮政、信件和包裹，也可作动词表示邮寄；口语中也可指发电子邮件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"letters and packages that are sent and delivered; the postal system","zh":"邮政；（寄送的）信件和包裹"},"examples":[{"en":"I got some mail today, including a letter from my bank.","zh":"我今天收到了邮件，包括一封银行寄来的信。"},{"en":"The mail usually arrives around noon.","zh":"邮件通常中午左右送到。"}]},{"partOfSpeech":"vt.","definition":{"en":"to send a letter or package to someone by post","zh":"邮寄；把信件或包裹寄给某人"},"examples":[{"en":"Can you mail this package for me tomorrow?","zh":"你明天能帮我把这个包裹寄出去吗？"},{"en":"I mailed the form last week, but they haven’t replied yet.","zh":"我上周把表格寄出去了，但他们还没回复。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal) to email someone","zh":"（非正式）给某人发电子邮件"},"examples":[{"en":"Mail me the file when you have a chance.","zh":"你有空的时候把文件邮件发给我。"},{"en":"I’ll mail you the details tonight.","zh":"我今晚把细节发邮件给你。"}]}],"synonyms":["post","send","ship","email"],"phonetic":"/meɪl/","extraExplanation":["你输入的“maill”通常不是标准拼写，最常见的目标词是“mail”（邮政/邮寄）。","易混淆词：mail（邮件/邮寄） vs. mall（购物中心）。两者发音不同：mail /meɪl/，mall /mɔl/（美式）。","在美式英语里，口语中有时会用mail表示“发电子邮件”，但在更正式的场合常说email或send an email，以避免歧义。"]}
{"word":"maillable","summary":{"en":"able to be sent by mail","zh":"可通过邮政寄送的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be mailed; suitable for sending through the postal system.","zh":"可邮寄的；适合通过邮政系统寄送的。"},"examples":[{"en":"Is this bottle maillable, or will it break in transit?","zh":"这个瓶子可以邮寄吗？还是会在运输途中碎掉？"},{"en":"The product is maillable if you use a padded envelope.","zh":"如果用气泡信封包装，这个产品就可以邮寄。"}]}],"synonyms":["mailable","postable","sendable","shippable"],"phonetic":"ˈmeɪləbəl","extraExplanation":["常见于电商/物流语境，强调物品在尺寸、重量、包装、安全性等方面“符合邮寄条件”。","近义表达里更口语的说法是 mailable（更常见拼写），意思相同；maillable 也会出现，但相对少见。"],"etymology":"由 mail（邮寄）+ -able（“可以……的”形容词后缀）构成，意思就是“可以被邮寄的”。","mnemonic":["记：mail=邮寄，-able=可以……的 → “可以邮寄的”。","联想“可……的”=“-able”：readable=可读的，washable=可洗的，maillable=可邮寄的。"]}
{"word":"maille","summary":{"en":"Maille means chain mail—linked metal rings used as flexible armor, and by extension a linked-ring metal mesh used in crafts/jewelry.","zh":"maille 指“锁子甲”（由金属环扣连成的铠甲），也可泛指用于工艺或首饰的金属环扣网状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"chain mail; armor made of many small metal rings linked together to form a flexible protective mesh.","zh":"锁子甲；由许多小金属环相互扣连形成的柔性防护铠甲。"},"examples":[{"en":"The knight wore maille under his cloak for protection.","zh":"骑士在斗篷下面穿着锁子甲以保护自己。"},{"en":"Museum displays often show maille shirts from the Middle Ages.","zh":"博物馆展览中常能看到中世纪的锁子甲上衣。"}]},{"partOfSpeech":"n.","definition":{"en":"a linked-ring metal mesh used in crafts or jewelry (often in the phrase “chainmaille”).","zh":"（工艺/首饰用的）金属环扣网状结构（常见于“chainmaille”一词）。"},"examples":[{"en":"She makes bracelets using chainmaille techniques.","zh":"她用链甲编织（chainmaille）技法制作手链。"},{"en":"The bag had a decorative maille panel that shimmered in the light.","zh":"那只包上有一块装饰性的金属环扣网面，在光下闪闪发亮。"}]}],"synonyms":["chain mail","mail","ring mail (less common)"],"phonetic":"/meɪ/","extraExplanation":["“maille”是法语拼写，英语里也会借用，含义与“mail（锁子甲）”相同或非常接近。读音在英语使用者中常读作 /meɪ/（类似“may”），尤其在手工首饰圈里常见。","词源上与“mesh（网状结构）”的概念相关：本质是“许多小环相连形成的网”。在历史语境中常与中世纪武士、骑士装备一起出现；在现代语境中常与手工艺“chainmaille（链甲编织）”相关。"]}
{"word":"maillechort","summary":{"en":"Maillechort is a silver-colored copper–nickel–zinc alloy (nickel silver) used for decorative and durable metal goods.","zh":"Maillechort 是一种铜-镍-锌的银白色合金（镍银），用于制作装饰性和耐用的金属制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silver-colored alloy made mainly of copper, nickel, and zinc (also called nickel silver or German silver), used for items like cutlery, jewelry, and musical instruments.","zh":"一种呈银白色的合金，主要由铜、镍和锌组成（也叫“镍银/德国银”），常用于餐具、首饰和乐器等。"},"examples":[{"en":"The knife handles are made of maillechort, so they look like silver but cost much less.","zh":"这套餐刀的手柄是用 maillechort 做的，所以看起来像银，但便宜得多。"},{"en":"Some wind instruments use maillechort for keys because it’s durable and polishes well.","zh":"一些管乐器的按键会用 maillechort，因为它耐用而且容易抛光。"}]}],"synonyms":["nickel silver","German silver","nickel brass"],"phonetic":"/ˈmaɪləˌkɔrt/","extraExplanation":["“Maillechort”来自法语，是一种以发明者/工艺命名的材料名称（19世纪在欧洲流行）。它常被误认为是真银，但本质上不含银；在英文里更常见的说法是 nickel silver 或 German silver。"]}
{"word":"mailless","summary":{"en":"“Mailless” means either not having/receiving postal mail, or (in historical/literary use) not wearing protective mail armor.","zh":"“mailless”可指“没有/收不到邮件”，也可在历史或文学语境中指“未穿（锁子）铠甲”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without mail (letters/parcels); not receiving or having postal mail.","zh":"无邮件的；没有收到（或没有）邮政信件/包裹的。"},"examples":[{"en":"The remote cabin was practically mailless in winter.","zh":"那间偏远的小木屋在冬天几乎收不到邮件。"},{"en":"After the storm, the island was mailless for days.","zh":"暴风雨过后，那座岛屿好几天都没有邮件送达。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without protective mail (especially chain mail armor).","zh":"未穿铠甲的；未穿锁子甲的（尤指链甲）。"},"examples":[{"en":"The mailless knight was vulnerable to arrows.","zh":"未穿锁子甲的骑士很容易被箭射伤。"},{"en":"In the story, the hero fights mailless to show courage.","zh":"在故事里，英雄不穿铠甲作战，以显示勇气。"}]}],"synonyms":["without mail","mail-free","unarmored","unprotected"],"phonetic":"/ˈmeɪlləs/","extraExplanation":["“mail”除了指“邮件”，在较文学或历史语境里还可指“铠甲/锁子甲”（如 chain mail）。因此 mailless 在不同文本中可能有两种解读，需结合上下文判断。"]}
{"word":"maillot","summary":{"en":"Maillot means a tight sports garment—often a cyclist’s jersey or a gymnast’s/dancer’s leotard; sometimes it also means a one-piece swimsuit.","zh":"Maillot 指紧身运动服，常指骑行衫或体操/舞蹈紧身连体服；有时也指连体泳衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A close-fitting shirt or one-piece garment worn for sports, especially as a cyclist’s jersey or a gymnast/dancer’s leotard.","zh":"（尤指运动用的）紧身上衣或连体服；常指自行车运动员的骑行衫，或体操/舞蹈的紧身连体服（类似 leotard）。"},"examples":[{"en":"She bought a new maillot for her gymnastics class.","zh":"她为体操课买了一件新的 maillot（紧身连体服）。"},{"en":"The race leader wore the yellow maillot on the mountain stage.","zh":"在山地赛段，领骑者穿着黄色 maillot（领骑衫）。"}]},{"partOfSpeech":"n.","definition":{"en":"In some contexts, a one-piece swimsuit.","zh":"（某些语境）连体泳衣。"},"examples":[{"en":"He packed a black maillot for the hotel pool.","zh":"他为酒店泳池带了一件黑色的连体泳衣（maillot）。"}]}],"synonyms":["jersey","cycling jersey","leotard","one-piece swimsuit"],"phonetic":"/maɪˈoʊ/","extraExplanation":["“Maillot”是法语借词，在体育语境里非常常见：自行车比赛中不同颜色的“maillot”（领骑衫）对应不同排名或奖项，例如环法自行车赛的黄色领骑衫（maillot jaune）。在英语里也常用更直白的词如 “jersey”（骑行衫）或 “leotard”（舞蹈/体操紧身衣）。","发音在英语里通常读作 /maɪˈoʊ/，词尾的 -t 不发音，接近法语读法。"]}
{"word":"maillots","summary":{"en":"Maillots are one-piece swimsuits or tight one-piece performance outfits; “maillots” is the plural of “maillot.”","zh":"maillots 指连体泳衣或表演用紧身连体服；maillots 是 maillot 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman’s one-piece swimsuit (especially a tight-fitting style).","zh":"（尤指贴身款的）女式连体泳衣。"},"examples":[{"en":"She wore a black maillot to the pool.","zh":"她穿着一件黑色连体泳衣去泳池。"},{"en":"The store sells bikinis and maillots in many sizes.","zh":"这家店卖各种尺码的比基尼和连体泳衣。"}]},{"partOfSpeech":"n.","definition":{"en":"a tight, one-piece costume worn for dance, gymnastics, or stage performance; similar to a leotard.","zh":"（舞蹈、体操或舞台表演穿的）紧身连体服；类似连体舞衣。"},"examples":[{"en":"The dancer changed into a simple maillot for rehearsal.","zh":"舞者换上了一件简洁的紧身连体服去排练。"},{"en":"Gymnasts often wear a maillot-style outfit for competitions.","zh":"体操运动员比赛时常穿类似紧身连体服的服装。"}]}],"synonyms":["one-piece swimsuit","swimsuit","leotard"],"phonetic":"/maɪˈoʊ/","extraExplanation":["“maillot”来自法语，英语里多用于时尚/泳装语境。你输入的 **maillots** 是复数形式；单数是 **maillot**。","在现代美式英语中，说泳衣更常用 **one-piece swimsuit**；而舞蹈/体操场景更常见的词是 **leotard**（但两者不完全一样：leotard 常指训练/表演用紧身衣，不一定用于游泳）。"]}
{"word":"maills","summary":{"en":"“Maills” is not a standard spelling; it usually means “mail” (letters/packages or email) or the verb “to mail” (to send by post).","zh":"“maills” 不是标准拼写；通常是想写 “mail”（邮件/信件包裹或电子邮件）或动词 “mail”（邮寄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “mail”) Letters and packages sent through the postal system; also email messages in general use.","zh":"（常见拼写为 mail）通过邮政系统寄送的信件和包裹；也可泛指电子邮件。"},"examples":[{"en":"I got some mail today, including a package.","zh":"我今天收到了邮件，其中还有一个包裹。"},{"en":"Check your mail—your teacher sent an email.","zh":"看看你的邮件——老师发了封电子邮件。"}]},{"partOfSpeech":"v.","definition":{"en":"To send a letter or package through the post office.","zh":"邮寄；通过邮局寄送信件或包裹。"},"examples":[{"en":"I’ll mail the documents tomorrow morning.","zh":"我明天早上把文件寄出去。"},{"en":"She mailed a birthday card to her friend.","zh":"她给朋友寄了一张生日卡。"}]}],"synonyms":["post","letters","parcel","ship","send"],"phonetic":"/meɪl/","extraExplanation":["“maills” 不是标准英文拼写，最常见是把 “mails”（mail 的复数或第三人称单数）拼错了。正确形式：mail（不可数名词更常见，如 “some mail”）、mails（复数：different kinds of mails 较少见；或动词：He mails it）。","名词用法里，英式英语常说 “post”，美式英语更常说 “mail”。例如：I got the mail / I got the post。"]}
{"word":"mailman","summary":{"en":"A mailman is a person who delivers mail; in modern English, people often say “mail carrier” as a more gender-neutral term.","zh":"mailman 指“邮递员/送信员”。现代英语中常用更中性的说法 mail carrier（邮递员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to deliver mail (letters and packages) to homes and businesses.","zh":"邮递员；送信员（负责把信件和包裹投递到住家或公司的人）"},"examples":[{"en":"The mailman delivers our letters every afternoon.","zh":"邮递员每天下午把信送到我们家。"},{"en":"I left the package for the mailman to pick up.","zh":"我把包裹留给邮递员来取。"}]},{"partOfSpeech":"n.","definition":{"en":"A worker in a postal service who collects, sorts, or delivers mail (general use).","zh":"邮政工作人员（更泛指在邮政系统里收取、分拣或投递邮件的人）"},"examples":[{"en":"She became a mailman after finishing training at the post office.","zh":"她在邮局培训结束后成了一名邮递员。"}]}],"synonyms":["mail carrier","letter carrier","postal worker","postman"],"phonetic":"/ˈmeɪl.mæn/","extraExplanation":["在美国英语里，mailman 是常见说法，但现在也常用更中性的说法：mail carrier、letter carrier 或 postal worker，尤其当性别不明确或不想强调性别时。","mail 指“邮件/邮政系统”，man 在旧用法里常表示“从事某职业的人”，但现代语境中容易被理解为“男性”，所以会出现上述中性替代。"]}
{"word":"mailmen","summary":{"en":"“Mailmen” means postal workers who deliver mail; it’s the plural of “mailman.”","zh":"“mailmen”指投递邮件的邮递员，是“mailman”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mailman”: a person (traditionally a man) whose job is to deliver mail (letters and packages).","zh":"“mailman”的复数：邮递员（传统上指男性），负责投递信件和包裹的人。"},"examples":[{"en":"The mailmen deliver letters every morning in our neighborhood.","zh":"我们社区的邮递员每天早上送信。"},{"en":"Two mailmen carried the heavy packages to the front desk.","zh":"两位邮递员把沉重的包裹搬到前台。"}]}],"synonyms":["mail carriers","postal workers","letter carriers","postmen (BrE)"],"phonetic":"/ˈmeɪlˌmɛn/","extraExplanation":["在现代英语里，mailman 虽然很常见，但因为带有性别色彩，更中性、更常用的说法是 mail carrier（邮递员/投递员）或 postal worker（邮政工作人员）。在正式场合或希望更包容的表达时，用 mail carrier 更合适。","美国日常用语中常说 “The mail is here.”（邮件到了），“I got the mail.”（我取邮件了）。在英式英语中更常见 postman / postmen。"]}
{"word":"mailouts","summary":{"en":"a mass mailing or the process of sending it","zh":"群发邮寄的宣传品或其寄送过程"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Items (such as letters, flyers, or promotional materials) sent out by mail to many people; a mass mailing.","zh":"（寄给很多人的）邮寄物/宣传品；群发邮寄（常用于营销）。"},"examples":[{"en":"The charity organized a mailout to raise money for disaster relief.","zh":"这个慈善机构组织了一次群发邮寄来为赈灾筹款。"},{"en":"We’re preparing a mailout of 10,000 flyers to local households.","zh":"我们正在准备向本地住户邮寄一万份传单。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of sending such materials out by mail.","zh":"群发邮寄的行为/流程。"},"examples":[{"en":"The mailout will start on Monday and finish by Thursday.","zh":"这次群发邮寄将于周一开始，周四前完成。"},{"en":"They outsourced the mailout to a printing company.","zh":"他们把群发邮寄的工作外包给了一家印刷公司。"}]}],"synonyms":["mass mailing","bulk mailing","direct mail","mailing","circular","flyer","campaign"],"phonetic":"/ˈmeɪlˌaʊt/","extraExplanation":["在北美市场营销里，mailout 常与 direct mail（直邮营销）一起出现，强调“面向名单的大批量寄送”。有时也会写作 mail-out。","在实际英语中常见用法：do a mailout（做一次群发邮寄）、a mailout of brochures（邮寄一批宣传册）、a mailout list（邮寄名单）。"],"etymology":"由 mail（邮寄）+ out（向外、发出）构成；最早常见于商业与市场营销语境，指把材料“寄出去”给一批收件人。","mnemonic":["把它拆开记：mail（寄信）+ out（发出去）= “寄出去的一批东西”。","联想中文“群发”：给很多人同时寄出（out）。"]}
{"word":"mailperson","summary":{"en":"A gender-neutral word for someone who delivers mail.","zh":"指投递邮件的“邮递员/投递员”，较为性别中立的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to deliver mail (letters and packages), usually for the post office.","zh":"邮递员；投递员（负责投递信件与包裹，通常为邮局工作）"},"examples":[{"en":"The mailperson delivers our letters around 11 a.m. every day.","zh":"邮递员每天大约上午11点把信送到我们家。"},{"en":"I left the package on the porch for the mailperson to pick up.","zh":"我把包裹放在门廊上，方便邮递员取走寄出。"},{"en":"Please don’t block the mailbox—the mailperson needs easy access.","zh":"请不要挡住邮箱——邮递员需要方便投递。"}]}],"synonyms":["letter carrier","postal worker","mail carrier"],"phonetic":"/ˈmeɪlˌpɝsən/","extraExplanation":["“mailperson”是比较现代、性别中立的说法（不强调男或女），常用于正式或公共场合。传统说法如“mailman”偏向指男性，现在仍有人用，但在一些语境下“mailperson”更礼貌、更包容。","相关词：postal worker（邮政工作人员，范围更广，不一定送信）；letter carrier（送信员，偏美式/邮政系统用语）。"]}
{"word":"mailpersons","summary":{"en":"Mailpersons are people who deliver mail; it’s a gender-neutral plural form.","zh":"mailpersons 指“邮递员/投递员”，是性别中立的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mailperson; people whose job is to deliver mail (letters and packages), usually for the postal service.","zh":"mailperson（邮递员/邮差）的复数；指以投递信件和包裹为职业的人，通常为邮政系统工作人员。"},"examples":[{"en":"Mailpersons deliver letters even in bad weather.","zh":"邮递员即使在恶劣天气里也会投递信件。"},{"en":"The mailpersons in our neighborhood start work early in the morning.","zh":"我们社区的邮递员一大早就开始工作。"}]}],"synonyms":["mail carriers","postal workers","letter carriers"],"phonetic":"/ˈmeɪlˌpɝsənz/","extraExplanation":["“mailperson”是较中性、包容的说法，用来避免只用“mailman”（传统上暗示男性）。在美国也常说“mail carrier”（投递员）。"]}
{"word":"mailplane","summary":{"en":"A mailplane is an airplane used to carry mail, often on a regular route.","zh":"mailplane 指用于运送邮件的飞机，常按固定航线运行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An airplane that carries mail (and sometimes small packages), especially on a regular route.","zh":"邮运飞机；（尤指按固定航线运送信件、有时也运送小包裹的）邮政飞机。"},"examples":[{"en":"The mailplane landed just after dawn with letters from the capital.","zh":"邮运飞机刚过黎明就降落了，带来了首都寄来的信件。"},{"en":"Before email, some towns depended on a mailplane for fast delivery.","zh":"在电子邮件出现之前，一些城镇依靠邮运飞机来快速投递。"}]}],"synonyms":["mail plane","airmail plane","mail aircraft"],"phonetic":"/ˈmeɪlˌpleɪn/","extraExplanation":["“mailplane”在现代日常英语中不算常用，更常见的说法是“mail plane”（分开写）或“airmail plane / airmail aircraft”。在航空史语境里，这个词会更常见，尤其用于讲20世纪早期的“航空邮政（airmail）”与固定邮运航线。","在美国文化语境中，航空邮政曾是连接偏远地区的重要方式；许多早期民航公司也从承运邮件起步（通过政府邮运合同建立航线与运营能力）。"]}
{"word":"mailpouch","summary":{"en":"A mailpouch is a strong bag used for carrying mail.","zh":"mailpouch 指用于装运邮件的结实邮袋/邮包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pouch (strong bag) used to carry letters and other mail, especially by postal workers or on vehicles such as trains and planes.","zh":"邮袋；邮包（用于装载信件等邮件的结实袋子，尤指邮政工作人员或火车、飞机等运输工具上使用的）。"},"examples":[{"en":"The postal worker slung the mailpouch over his shoulder and started his route.","zh":"邮递员把邮袋挎在肩上，开始送信路线。"},{"en":"In old photos, you can see mailpouches being loaded onto a train at the station.","zh":"在老照片里，你能看到车站把邮袋装上火车的场景。"}]}],"synonyms":["mailbag","postal bag","pouch (postal)"],"phonetic":"/ˈmeɪlˌpaʊtʃ/","extraExplanation":["在美式英语里，mail pouch 常指邮政系统使用的“邮袋/邮包”。历史上也常见于铁路邮政（Railway Mail Service）等场景。","在美国一些乡村地区，“Mail Pouch”还会让人联想到“Mail Pouch Tobacco”这个老牌烟草品牌：许多谷仓外墙曾涂有“Mail Pouch Tobacco”广告字样（barn ads），因此在文化语境中可能带有怀旧的乡村意象。"]}
{"word":"mailroom","summary":{"en":"A mailroom is the place in an organization where mail and packages are handled.","zh":"mailroom 指机构里负责收发与分拣信件、包裹的收发室。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a room in a company, school, or large building where mail and packages are received, sorted, and sent out","zh":"（公司、学校或大型建筑里）收发、分类并分派信件和包裹的房间；收发室"},"examples":[{"en":"Please send the signed contract to the mailroom on the first floor.","zh":"请把签好的合同送到一楼的收发室。"},{"en":"The package is in the mailroom, waiting for pickup.","zh":"包裹在收发室，等你来取。"},{"en":"She started her career in the mailroom and later moved into HR.","zh":"她从收发室的工作做起，后来转到了人力资源部门。"}]}],"synonyms":["mail room","postroom","mail center"],"phonetic":"/ˈmeɪlˌrum/","extraExplanation":["在美国职场语境里，mailroom 常出现在“大公司入门岗位”的叙述中：从 mailroom 做起（start in the mailroom）象征从基层了解公司运作、逐步晋升。类似表达也会出现在影视和商业报道中。","拼写上有时会写作 mail room（两词），意思相同；mailroom（合写）更像固定名词。英式英语更常见 mailroom 或 postroom（post room）。"]}
{"word":"mails","summary":{"en":"“Mails” most often means letters/packages that are delivered (plural of mail). It can also be the verb form meaning “sends by mail.”","zh":"“mails”通常指“邮件/信件/包裹”（mail 的复数）；也可以作动词，表示“邮寄/寄出（或发邮件）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mail”: letters, packages, or messages that are sent and delivered (usually by a postal service).","zh":"“mail”的复数：指由邮政系统投递的信件、包裹或邮件（通常指实体邮寄物）。"},"examples":[{"en":"I check my mails every morning at the mailbox.","zh":"我每天早上在邮箱里查看邮件/信件。"},{"en":"The office received a lot of mails today, including several packages.","zh":"办公室今天收到了很多邮件，其中包括几个包裹。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “mail”: to send something by post (or, in some contexts, to send a message by email).","zh":"“mail”的第三人称单数：把某物寄出（邮寄）；在某些语境中也可指发送电子邮件。"},"examples":[{"en":"She mails the documents to the client every Friday.","zh":"她每周五把文件邮寄给客户。"},{"en":"He mails me the receipt after the payment goes through.","zh":"付款完成后，他会把收据发给我。"}]}],"synonyms":["post","letters","mail (uncountable)","deliveries"],"phonetic":"/meɪlz/","extraExplanation":["在现代英语里，数名词用法上更常说 “mail” 来泛指“邮件/邮政投递物”（不可数），例如: I got a lot of mail today. “mails” 作复数在某些地区或旧式用法中也能见到，但在美式英语日常口语里相对少见。","“mail” 既可指传统邮寄（snail mail），也可指电子邮件（email）。若要明确区分，常说 “mail”=实体邮件，“email”=电子邮件。"]}
{"word":"mailsack","summary":{"en":"A mailsack is a large, sturdy bag used to carry mail.","zh":"mailsack 指用于装运邮件的大而结实的邮袋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, strong bag used for carrying and transporting letters and packages (mail), especially by a postal service","zh":"邮袋；邮包（用于装运信件和包裹等邮件的大而结实的袋子，常见于邮政系统）"},"examples":[{"en":"The mail carrier lifted a heavy mailsack onto the truck.","zh":"邮递员把沉重的邮袋搬上了卡车。"},{"en":"A stack of mailsacks waited at the post office before sorting began.","zh":"邮局里分类开始前，已经堆着一排排邮袋。"}]}],"synonyms":["mailbag","postal bag","mail pouch"],"phonetic":"/ˈmeɪlˌsæk/","extraExplanation":["在现代英语里更常见的说法是 mailbag；mailsack 听起来更偏传统或带一点文学/历史感，常用于描写过去的邮政运输（例如火车、马车或早期邮车运送邮件）。","在一些固定搭配里也会看到相关表达：例如 “the mail sack” 指一整袋当天的来信；“sack” 本身有“麻袋/大袋子”的意思。"]}
{"word":"mailshot","summary":{"en":"A mailshot is a bulk letter or email sent to many people, typically for advertising or announcements.","zh":"mailshot 指一次性群发给很多人的信件或邮件，多用于广告推广或发布通知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of letters or emails sent to many people at the same time, usually to advertise something or share information","zh":"（通常为宣传或通知而）一次性群发给许多人的信件或电子邮件"},"examples":[{"en":"The company sent a mailshot to thousands of customers about the new product.","zh":"公司向成千上万的客户群发了一封宣传新产品的邮件。"},{"en":"We got a mailshot inviting us to a local charity event.","zh":"我们收到了一封群发邮件，邀请我们参加本地的慈善活动。"}]}],"synonyms":["mass mailing","direct mail","mailing","email blast","newsletter"],"phonetic":"/ˈmeɪlˌʃɑt/","extraExplanation":["在英式英语中更常见；美式英语里更常用 mass mailing、mailing、direct mail（纸质广告信）或 email blast/newsletter（电子群发）。","语气上常带有“营销推广、批量投放”的感觉；如果你想更中性，可以说 newsletter（通讯/简报）或 announcement email（通知邮件）。"]}
{"word":"mailwoman","summary":{"en":"A woman who delivers mail; often replaced by the gender-neutral term “mail carrier.”","zh":"负责投递邮件的女性；现代英语中常用更中性的“mail carrier（邮递员）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman whose job is to deliver mail (letters and packages).","zh":"邮递员（女性）；女邮差（负责投递信件和包裹的女性）。"},"examples":[{"en":"The mailwoman delivers our letters every morning.","zh":"女邮差每天早上给我们送信。"},{"en":"I asked the mailwoman where to drop off this package.","zh":"我问女邮差这个包裹应该在哪里寄出。"}]}],"synonyms":["mail carrier","letter carrier","postal worker"],"phonetic":"/ˈmeɪlˌwʊmən/","extraExplanation":["“mailwoman”是性别明确的说法。在现代英语里，更常见、更中性的职业称呼是“mail carrier”或“letter carrier”，用来指任何性别的邮递员。美国也常用“postal worker”（邮政工作人员）。"]}
{"word":"mailwomen","summary":{"en":"“Mailwomen” means female postal workers who deliver mail (plural).","zh":"“mailwomen”指送信的女性邮递员（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"women who deliver mail; female postal workers (plural of “mailwoman”).","zh":"送信的女性；女邮递员（“mailwoman”的复数）。"},"examples":[{"en":"The mailwomen arrive around noon in our neighborhood.","zh":"我们社区的女邮递员大约中午送达。"},{"en":"The city honored its mailwomen for their service during the storm.","zh":"这座城市表彰了在暴风雨期间坚持工作的女邮递员。"}]}],"synonyms":["mail carriers","postal workers","letter carriers"],"phonetic":"/ˈmeɪlˌwɪmɪn/","extraExplanation":["“mailwoman / mailwomen”是带性别色彩的称呼。现代英语里更常用更中性的说法是“mail carrier”或“postal worker”，在正式写作和职场沟通中更稳妥。","在美式英语里，“mailman”过去很常见，但现在很多机构（如美国邮政 USPS）更倾向使用不分性别的“letter carrier / mail carrier”。"]}
{"word":"maim","summary":{"en":"Maim means to cause severe, permanent injury (often disabling), and it can also mean to seriously damage something so it loses its full effect.","zh":"Maim 指造成严重且永久性的伤残（常导致残疾）；也可引申指严重破坏某物，使其不完整或失去效用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to injure someone badly and permanently, especially so they lose the use of a body part","zh":"使（人）重伤致残；严重伤害（尤指导致身体部位永久失去功能）"},"examples":[{"en":"The explosion maimed several people.","zh":"爆炸使几个人重伤致残。"},{"en":"He was maimed in the war and could no longer walk normally.","zh":"他在战争中致残，之后再也不能正常行走。"}]},{"partOfSpeech":"vt.","definition":{"en":"to damage something seriously so it is no longer complete or effective","zh":"严重破坏（某物）使其不完整或失去效用"},"examples":[{"en":"The building was maimed by the fire.","zh":"这栋建筑被大火严重毁坏。"},{"en":"Heavy editing can maim the meaning of a poem.","zh":"过度删改会严重破坏诗歌的含义。"}]}],"synonyms":["cripple","mutilate","disable","injure","damage"],"phonetic":"/meɪm/","extraExplanation":["“maim”常见于严肃语境（战争、事故、暴力犯罪）。它强调“永久性伤残”，语气比 “injure / hurt” 更重；如果只是一般受伤，通常不用 maim。","词源来自古法语/拉丁语系统，核心含义与“使人变残缺、缺损”有关；因此也可引申为“严重破坏（作品/事物的完整性）”。"]}
{"word":"Maimakterion","summary":{"en":"an Attic (Athenian) calendar month roughly in late autumn–early winter","zh":"雅典（阿提卡）历中的一个月份，约在深秋至初冬"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A month in the Attic (Athenian) calendar, usually falling roughly in late autumn to early winter (around November–December in the modern calendar).","zh":"（古希腊）雅典（阿提卡）历中的一个月份，通常大致对应现代历的深秋到初冬（约11–12月）。"},"examples":[{"en":"In some sources, Maimakterion is placed as the fifth month of the Attic year.","zh":"在一些资料中，Maimakterion 被列为阿提卡历的一年第五个月。"},{"en":"The inscription is dated to Maimakterion, so it likely belongs to the late-autumn part of the year.","zh":"这段铭文的纪年是 Maimakterion，因此很可能属于一年中深秋的时间段。"}]}],"synonyms":["Attic month","Athenian month","Attic calendar month"],"phonetic":"/maɪmækˈtɪriən/","extraExplanation":["阿提卡历是古雅典使用的阴阳历体系：月份以宗教与城邦生活为核心，和现代公历并非一一固定对应；同一“月份”在不同年份可能会因闰月与观测而略有漂移。","英语学术写作中，这类月份名常用于解读铭文、史料纪年与节庆安排；如果需要换算到公历，通常只能给出“约在某个季节/某两个月之间”的范围。"],"etymology":"源自古希腊语 Maimaktēríōn（μαιμακτηριών），与宙斯的称号“Zeus Maimaktēs（宙斯·迈马克特斯）”相关；该称号常被解释为与“狂暴、暴风、冬季风雨”等意象有关，因此这个月名也常被联想到进入冬季前后多风多雨的时节。","mnemonic":["把它拆开记：Mai-（像“迈”）+ mak-（像“猛/狂”）+ -terion（像“时期/场所”）。联想“迈进（迈）到狂风（猛）季节的时期”，对应深秋初冬风雨更强。","联想“宙斯带来暴风雨”的形象：Maimakterion ≈ 暴风之月 → 天气转冷、风雨加剧。"]}
{"word":"maimed","summary":{"en":"Maimed means badly and often permanently injured; it’s also the past form of “maim.”","zh":"maimed 指严重且常带永久性后果的受伤（致残）；也可作动词 maim 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"injured badly, especially so that a body part is permanently damaged or no longer works well.","zh":"（尤指）严重受伤、致残；（身体部位）永久性受损或功能受影响。"},"examples":[{"en":"He was maimed in a car accident and needed long-term care.","zh":"他在车祸中致残，需要长期照护。"},{"en":"The explosion left several people maimed.","zh":"爆炸导致数人重伤致残。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “maim”) to injure someone so badly that they are permanently harmed.","zh":"（maim 的过去式/过去分词）使（某人）严重受伤致残；造成永久性伤害。"},"examples":[{"en":"The soldier was maimed during the war.","zh":"那名士兵在战争中致残。"},{"en":"The animal was maimed but survived.","zh":"那只动物严重受伤但活了下来。"}]}],"synonyms":["disabled","crippled","mutilated","severely injured"],"phonetic":"/meɪmd/","extraExplanation":["“maim”常见于新闻、法律或历史语境，语气很重，强调“永久性伤害/致残”，比“hurt”“injure”更严重。日常生活中若只是一般受伤，通常用 “injured” 更自然。","常见搭配：be maimed for life（终身致残）、maimed in an accident/war（在事故/战争中致残）。"]}
{"word":"maimedly","summary":{"en":"“Maimedly” means “in a maimed/crippled way,” but it’s extremely rare; most writers use clearer alternatives like “with a limp.”","zh":"“maimedly”意为“以残缺/致残的方式（行动不便地）”，但非常罕见；多数情况下会用更常见的表达如“with a limp（跛着）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a maimed or crippled way; as if injured so that normal movement or function is damaged (very rare in modern English).","zh":"以残缺/致残的方式；像受伤导致行动或功能受损那样（现代英语中很少用）。"},"examples":[{"en":"After the accident, he walked maimedly across the room, leaning on the wall.","zh":"事故之后，他扶着墙一瘸一拐地穿过房间。"},{"en":"The wounded bird hopped maimedly along the ground before taking shelter.","zh":"受伤的鸟在地上蹦跳着、行动不便，然后躲了起来。"}]}],"synonyms":["lamely","with a limp","awkwardly","haltingly","impairedly"],"phonetic":"/ˈmeɪmdli/","extraExplanation":["“maimedly”由“maimed（致残的）+ -ly（副词后缀）”构成，但在当代英语里非常罕见。写作中通常更自然地用“lamely（跛脚地/勉强地）”“awkwardly（笨拙地）”或更具体的表达，如“with a limp（跛着）”。","它也可能是拼写错误：人们想写“lamely”或“maimed”。如果你是在文章里看到它，建议结合上下文判断是刻意的文学用词还是误拼。"]}
{"word":"maimedness","summary":{"en":"Maimedness means the condition of being seriously and permanently injured or disabled.","zh":"Maimedness 指严重且可能永久的受伤或致残状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being maimed (having a body part damaged, disabled, or permanently injured)","zh":"残疾；伤残状态（指身体部位受损、失能或永久性受伤的状态）"},"examples":[{"en":"The accident left him with lasting maimedness in his left hand.","zh":"那次事故让他的左手留下了长期的伤残。"},{"en":"The story describes a soldier’s maimedness as both physical pain and emotional loss.","zh":"故事把士兵的伤残写成既有身体的痛苦，也有情感上的失落。"}]}],"synonyms":["disability","impairment","permanent injury","disablement","injury"],"phonetic":"/ˈmeɪmdnəs/","extraExplanation":["“maimedness”在现代英语中相对少见，更常见的说法是“disability / impairment / permanent injury”。在写作中使用“maimedness”往往带有更强的文学色彩，强调“被严重毁伤/致残”的结果。","使用时注意语气与尊重：在谈论残障人士时，日常交流中更常用中性、以人为本的表达（如“a person with a disability”），避免让词语听起来像在给人贴标签。"]}
{"word":"maimer","summary":{"en":"“Maimer” is a rare noun meaning a person who seriously injures others, causing lasting damage.","zh":"“maimer”是较少用的名词，指使他人严重受伤并造成长期伤残的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who maims (seriously injures someone so they lose the use of a body part); a mutilator (rare).","zh":"使人致残者；肢体伤害者（较少用）。"},"examples":[{"en":"The court described him as a violent maimer who left victims with permanent injuries.","zh":"法庭称他为暴力的致残者，使受害者留下永久伤害。"},{"en":"In some older writing, the villain is portrayed as a maimer rather than a killer.","zh":"在一些较早的作品里，反派被描写成致残者，而不是杀手。"}]}],"synonyms":["mutilator","attacker","assailant","crippler (often offensive)"],"phonetic":"/ˈmeɪmər/","extraExplanation":["“maimer”在现代英语中很少见，更常用的说法是“someone who maims”“mutilator”或直接用动词“to maim”。","构词法：maim（使残废）+ -er（做某事的人）→ maimer（做出该行为的人）。","阅读或写作时如果遇到“maimer”，通常带有较强的文学/古旧色彩，用来强调‘残忍地伤人致残’这一点。"]}
{"word":"maimers","summary":{"en":"“Maimers” means people who maim (permanently injure) others; it’s a rare word in modern English.","zh":"“maimers”指“致残他人的人”，但在现代英语中很少用，更常用“maim”或相关短语表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of maimer: people who intentionally injure someone so that they are permanently damaged (for example, by disabling a limb). This word is uncommon; English more often uses the verb “maim” or phrases like “those who maim others.”","zh":"“maimer”的复数：指故意把他人致残、造成永久伤害的人（例如使四肢失去功能）。该词很少见；英语更常用动词“maim”，或用“those who maim others（伤残他人的人）”等表达。"},"examples":[{"en":"The report condemned the maimers and killers responsible for attacks on civilians.","zh":"该报告谴责了对平民发动袭击的致残者和杀害者。"},{"en":"After the war, the victims spoke out against the maimers who targeted noncombatants.","zh":"战后，受害者公开谴责那些把非战斗人员作为目标的致残者。"}]}],"synonyms":["those who maim","attackers","assailants","perpetrators"],"phonetic":"/ˈmeɪmərz/","extraExplanation":["“maimer”来自动词“maim（使残废）”。在现代英语里，“maimer”作为名词非常少用；更自然的说法通常是：the person who maimed him / those who maim others / attackers who maimed civilians 等。","如果你是想查另一个词（例如拼写接近的单词），可以告诉我上下文句子，我可以帮你确认你真正想要的词。"]}
{"word":"maiming","summary":{"en":"Maiming means causing or involving permanent, disabling injury; it can also refer to the act itself.","zh":"maiming 指造成或涉及永久性致残伤害，也可指“致残”这一行为本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of seriously injuring someone so they are left with permanent damage (for example, losing the use of a limb).","zh":"使人遭受严重伤害并留下永久性残疾的行为（如失去肢体功能）。"},"examples":[{"en":"The explosion caused deaths and maiming among civilians.","zh":"爆炸造成平民死亡和致残。"},{"en":"The report documents killings, torture, and maiming during the conflict.","zh":"报告记录了冲突中的杀戮、酷刑与致残行为。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing a person or animal to be permanently injured; disabling.","zh":"造成（人或动物）永久伤残的；使失去正常功能的。"},"examples":[{"en":"Landmines can cause maiming injuries long after a war ends.","zh":"地雷可能在战争结束很久后仍造成致残性伤害。"},{"en":"He survived, but suffered a maiming wound to his leg.","zh":"他活了下来，但腿部受了致残性的重伤。"}]}],"synonyms":["crippling","disabling","mutilation","severe injury"],"phonetic":"/ˈmeɪ.mɪŋ/","extraExplanation":["“Maiming”来自动词“to maim”（使残废、致残），常出现在法律、新闻报道、人道主义与战争语境中，语气较严肃，强调“永久性伤害”，不用于轻微受伤。","与“injury/hurt”相比，“maim/maiming”更强调功能受损或残疾；常见搭配有：maiming injury（致残伤）、maiming and killing（致残与杀害）。"]}
{"word":"maimings","summary":{"en":"serious injury that causes lasting damage; the act of causing such injury","zh":"造成长期或永久损伤的重伤致残；致残行为"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of seriously injuring someone so that part of the body is damaged permanently (or for a long time)","zh":"（使人）重伤致残的行为；致残伤害"},"examples":[{"en":"The report documented several cases of maiming during the conflict.","zh":"报告记录了冲突期间多起致残伤害的案例。"},{"en":"He was arrested for a violent attack that resulted in maiming.","zh":"他因一次导致他人致残的暴力袭击被逮捕。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “maim”) to seriously injure someone so that part of the body is damaged permanently (or for a long time)","zh":"（maim 的现在分词）使（人）重伤致残；造成永久性（或长期）伤害"},"examples":[{"en":"The explosion sent shrapnel through the crowd, maiming several people.","zh":"爆炸产生的弹片穿过人群，致使数人重伤致残。"},{"en":"The machine can cause severe accidents, maiming workers who are not careful.","zh":"这台机器可能造成严重事故，让不小心的工人致残。"}]}],"synonyms":["crippling","disablement","mutilation","injury","harm","wound"],"phonetic":"/ˈmeɪmɪŋ/","extraExplanation":["你输入的“maimings”通常是名词“maiming”的复数形式，表示“多起/多次致残伤害事件”。也可能被理解为动词 maim 的现在分词用法，但更常见的拼写是单数“maiming”。","语域提示：该词语气较重，多用于法律、战争报道、人权报告或严重事故描述；日常口语里更常用 “serious injury” 或 “crippling injury”（语气也较强）。"],"etymology":"来自中古英语 maimen / maymen，意为“使残废、使失去肢体功能”，与古法语相关词形有关；核心含义一直围绕“造成永久性伤害/残疾”。","mnemonic":["联想词根：maim ≈ “make (someone) aim-less（失去行动能力/功能）”，帮助记住“致残”。","中文联想：把它记成“霉（maim）到身体功能都坏了”→“重伤致残”（仅作记忆梗）。"]}
{"word":"maimon","summary":{"en":"Maimon is mainly used as a surname/proper name, often connected to the famous scholar Maimonides.","zh":"Maimon 主要用作姓氏/专名，常与著名学者 Maimonides（迈蒙尼德）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name, best known from Jewish history (e.g., Moses ben Maimon, also called Maimonides).","zh":"一个姓氏，在犹太历史中较为知名（如摩西·本·迈蒙，也称迈蒙尼德）。"},"examples":[{"en":"Maimon is a surname associated with medieval Jewish scholarship.","zh":"Maimon 是一个与中世纪犹太学术传统相关的姓氏。"},{"en":"Some texts refer to Moses ben Maimon by the Latinized name “Maimonides.”","zh":"一些文献用拉丁化名字 “Maimonides（迈蒙尼德）” 来指摩西·本·迈蒙。"}]}],"synonyms":["Maimonides (related name)"],"phonetic":"/ˈmaɪmən/","extraExplanation":["“Maimon”在英语里通常作为专有名词出现（人名/姓氏），本身不是常见的普通词汇。最常见的相关人物是 Moses ben Maimon（1138–1204），英语里常称 Maimonides（迈蒙尼德），是重要的犹太哲学家与律法学者。","如果你是在某篇文章里看到 maimon（全小写），也可能是作者的用户名、品牌名，或其他语言的转写；给我一句原句我可以帮你判断具体含义。"]}
{"word":"Maimonidean","summary":{"en":"connected with the medieval Jewish thinker Maimonides or his ideas","zh":"与中世纪犹太思想家迈蒙尼德或其思想相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Moses Maimonides (1135–1204), a major Jewish philosopher and legal scholar, or to his writings, ideas, or style of interpretation.","zh":"与迈蒙尼德（摩西·本·迈蒙，1135–1204）有关的；指其著作、思想或诠释风格的。"},"examples":[{"en":"The class discussed Maimonidean ethics and the role of reason in religious life.","zh":"课堂讨论了迈蒙尼德式的伦理观，以及理性在宗教生活中的作用。"},{"en":"Some scholars compare Maimonidean interpretations of biblical law with later rabbinic traditions.","zh":"一些学者把迈蒙尼德式的《圣经》律法诠释与后来的拉比传统进行比较。"}]}],"synonyms":["Maimonides-related","rabbinic","Jewish-philosophical"],"phonetic":"/maɪˌmɑːnɪˈdiːən/","extraExplanation":["迈蒙尼德是中世纪最重要的犹太思想家之一，代表作常被提到的是《迷途指津》（Guide for the Perplexed）。因此在学术语境里，Maimonidean 往往带有“重视理性、哲学论证、系统化解释经典与律法”的联想。","该词多见于宗教研究、哲学史、犹太法（Halakha）研究等学术写作中，日常英语里相对少用。"],"etymology":"来自专有名词 Maimonides（迈蒙尼德）+ 英语形容词后缀 -ean（表示“属于……的/与……相关的”），构成表示“迈蒙尼德的/迈蒙尼德思想的”。","mnemonic":["把 -ean 记成“某某流派/某某风格的”：Shakespearean（莎士比亚式的）→ Maimonidean（迈蒙尼德式的）。","联想“迈蒙尼德＝中世纪犹太哲学大人物”，看到 Maimonidean 就想到“与他的思想/著作相关”。"]}
{"word":"maimonidean","summary":{"en":"Maimonidean means “related to Maimonides or his ideas”; it can also mean a follower of Maimonides.","zh":"Maimonidean 意为“与迈蒙尼德或其思想相关的”，也可指“迈蒙尼德的追随者/学派成员”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Moses Maimonides (1138–1204) or to his writings, ideas, or style (especially in Jewish law, philosophy, and theology).","zh":"（形容词）与迈蒙尼德（摩西·迈蒙尼德，1138–1204）或其著作、思想、风格有关的（尤指犹太法、哲学与神学领域）。"},"examples":[{"en":"The course includes a Maimonidean approach to interpreting biblical language.","zh":"这门课包含一种迈蒙尼德式的《圣经》语言诠释方法。"},{"en":"Scholars still debate the Maimonidean influence on later Jewish philosophy.","zh":"学者们至今仍在讨论迈蒙尼德思想对后世犹太哲学的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A follower, interpreter, or supporter of Maimonides’ teachings.","zh":"（名词）迈蒙尼德的追随者、诠释者或其学说的支持者。"},"examples":[{"en":"Some medieval Maimonideans defended his views against critics.","zh":"一些中世纪的迈蒙尼德派为他的观点辩护，反驳批评者。"},{"en":"As a Maimonidean, she emphasizes reason and careful interpretation.","zh":"作为迈蒙尼德派的一员，她强调理性与严谨的诠释。"}]}],"synonyms":["Maimonides-related","Maimonidean philosophy","Maimonidean thought"],"phonetic":"/ˌmaɪməˈnaɪdiən/","extraExplanation":["“Maimonidean”来自迈蒙尼德（Maimonides）的名字。迈蒙尼德是中世纪最重要的犹太思想家之一，也是一位医生与法学家；他的重要著作包括《密西拿托拉》（Mishneh Torah，犹太法典式巨著）与《迷途指津》（Guide for the Perplexed，常译《困惑者指南》）。在英语学术写作中，Maimonidean 常用来指一种把信仰与理性、经文与哲学（尤其亚里士多德传统）结合起来的思想风格。"]}
{"word":"Maimonides","summary":{"en":"A major medieval Jewish philosopher, legal scholar, and physician.","zh":"中世纪重要的犹太哲学家、律法学者与医生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval Jewish philosopher, legal scholar, and physician (1138–1204), also known as Moses ben Maimon or “Rambam,” best known for major works of Jewish law and philosophy.","zh":"中世纪犹太哲学家、法律学者与医生（1138–1204），又称“摩西·本·迈蒙”（Moses ben Maimon）或“拉姆班/兰巴姆”（Rambam），以犹太律法与哲学著作最为著名。"},"examples":[{"en":"Maimonides wrote influential works that shaped Jewish law and philosophy for centuries.","zh":"迈蒙尼德的著作深刻影响了犹太律法与哲学，延续数百年。"},{"en":"In many Jewish communities, Maimonides is respectfully called “Rambam.”","zh":"在许多犹太社群中，人们尊称迈蒙尼德为“Rambam（兰巴姆）”。"},{"en":"Students often read Maimonides alongside Aristotle when studying medieval philosophy.","zh":"学习中世纪哲学时，学生常把迈蒙尼德与亚里士多德放在一起阅读。"}]}],"synonyms":["Moses ben Maimon","Rambam"],"phonetic":"/maɪˈmɑːnɪˌdiːz/","extraExplanation":["文化与历史背景：迈蒙尼德生于伊比利亚半岛（今西班牙），后迁至北非与埃及，在开罗附近行医并著述。他的代表作常被提及：法律巨著《密西拿托拉》（Mishneh Torah）与哲学著作《迷惘者指南》（Guide for the Perplexed）。","用法提示：这是专有名词，英语中常用于学术或宗教历史语境；可直接说 “Maimonides wrote…”（把他当作人名主语）。中文常译作“迈蒙尼德/迈蒙尼达”。"],"etymology":"源自其家族名的拉丁化/英语化形式：Moses ben Maimon（意为“迈蒙之子摩西”）→ 中世纪欧洲文献中逐渐写作 Maimonides。也常见希伯来语尊称缩写“Rambam”（Rabbi Moshe ben Maimon）。","mnemonic":["把它记成“迈蒙-尼德”：前半“迈蒙”对应 ben Maimon（迈蒙之子），后半像英语人名后缀，提醒你它是人物名。","联想缩写“Rambam”：R(a)bbi + M(oshe) + b(en) + M(aimon)，一眼看出“摩西·本·迈蒙”。"]}
{"word":"Maimonides-related","summary":{"en":"connected with Maimonides or his works/thought.","zh":"与迈蒙尼德及其著作/思想相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, influenced by, or concerning Maimonides (the medieval Jewish philosopher, legal scholar, and physician Moses ben Maimon).","zh":"与迈蒙尼德（中世纪犹太哲学家、法学家与医生摩西·本·迈蒙）有关的；受其影响的；讨论其思想/著作的。"},"examples":[{"en":"The course included several Maimonides-related readings on ethics and law.","zh":"这门课包含了几篇与迈蒙尼德相关的伦理与法律阅读材料。"},{"en":"Her dissertation focuses on Maimonides-related debates in medieval Jewish philosophy.","zh":"她的论文聚焦于中世纪犹太哲学中与迈蒙尼德相关的争论。"},{"en":"The museum displayed Maimonides-related manuscripts and commentaries.","zh":"博物馆展出了与迈蒙尼德相关的手稿与注释文献。"}]}],"synonyms":["Maimonidean","Rambam-related","Maimonides-associated","Maimonides-connected"],"phonetic":"/maɪˈmɑːnɪˌdiːz rɪˈleɪtɪd/","extraExplanation":["迈蒙尼德（1138–1204）在英语学术写作中常被称为 Maimonides，也被称作 Rambam。他的重要著作包括《迷途指津》（Guide for the Perplexed）与《密西拿托拉》（Mishneh Torah）。因此在文章、课程或展览说明中常见 “Maimonides-related + 名词”（如 studies / texts / debates / sources）。"],"etymology":"由专名“‎Maimonides（迈蒙尼德）”加上后置形容词构词“-related（与……有关的）”组合而成，常用于学术语境，表示“与某位人物/思想体系相关”。","mnemonic":["把它拆开记：Maimonides + related = “迈蒙尼德 + 相关的”。看到 -related 就直接联想到“与……有关”。"]}
{"word":"maimonist","summary":{"en":"A Maimonist is a follower of Maimonides or something related to his teachings.","zh":"Maimonist 指迈蒙尼德的追随者，或与其学说相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Maimonides (the medieval Jewish philosopher and legal scholar Moses ben Maimon), or someone who studies/advocates his ideas (especially in Jewish law and philosophy).","zh":"迈蒙尼德（中世纪犹太哲学家与律法学者摩西·本·迈蒙）的追随者；研究或主张其思想的人（尤指犹太律法与哲学领域）。"},"examples":[{"en":"Some medieval Jewish thinkers were strongly influenced by Maimonides, and later called themselves Maimonists.","zh":"一些中世纪犹太思想家深受迈蒙尼德影响，后来被称为“迈蒙尼德派（Maimonists）”。"},{"en":"The article compares a Maimonist reading of the Bible with a more mystical approach.","zh":"这篇文章把一种“迈蒙尼德派”的《圣经》解读方式与更偏神秘主义的路径作了比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Maimonides or his teachings.","zh":"与迈蒙尼德或其学说有关的。"},"examples":[{"en":"The class focused on Maimonist interpretations of Jewish law.","zh":"这门课重点讨论迈蒙尼德派对犹太律法的解释。"}]}],"synonyms":["follower of Maimonides","Rambam scholar","Maimonidean"],"phonetic":"/maɪˈmɑːnɪst/","extraExplanation":["“Maimonist”来自“Maimonides”（迈蒙尼德），他也常被称为“Rambam”（希伯来语缩写）。他最著名的作品包括《密西拿托拉》（Mishneh Torah，系统整理犹太律法）和《迷途指津》（Guide for the Perplexed，讨论信仰与理性/哲学的关系）。因此，“Maimonist”常带有“理性主义、哲学化地理解信仰”的语境。","这个词在日常英语里很少见，更多出现在宗教学、哲学史、犹太研究等学术写作中。"]}
{"word":"maims","summary":{"en":"“Maims” means “injures very badly, causing permanent damage,” and can also mean “seriously damages” things.","zh":"“maims”是“maim”的第三人称单数，常指“造成永久性重伤致残”，也可指“严重破坏（事物）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to injure someone so badly that part of the body is permanently damaged or disabled","zh":"使（某人）重伤致残；造成永久性损伤"},"examples":[{"en":"The explosion maimed several workers.","zh":"爆炸使几名工人重伤致残。"},{"en":"He was maimed in the war and could no longer use his right hand.","zh":"他在战争中致残，右手再也无法使用。"},{"en":"The accident didn’t kill her, but it maimed her for life.","zh":"事故没有夺走她的生命，但让她终身残疾。"}]},{"partOfSpeech":"vt.","definition":{"en":"to damage something seriously so it no longer works well or looks right","zh":"严重破坏（事物），使其功能或外观受损"},"examples":[{"en":"The storm maimed the old trees in the park.","zh":"暴风雨严重摧残了公园里的老树。"},{"en":"Careless editing can maim a good story.","zh":"草率的编辑可能会毁掉一个好故事。"}]}],"synonyms":["cripple","disable","mutilate","injure","damage"],"phonetic":"/meɪm/","extraExplanation":["“maims”是动词“maim”的第三人称单数现在时（he/she/it maims）。这个词语气很重，通常用于描述造成永久性残疾或严重功能损伤的伤害；比“hurt / injure”更严重。"]}
{"word":"maimul","summary":{"en":"A mammal is a warm-blooded animal with hair or fur that feeds its young with milk.","zh":"mammal 指“哺乳动物”：恒温、有毛发，并用乳汁哺育幼崽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warm-blooded animal that has hair or fur and feeds its babies with milk","zh":"哺乳动物：恒温、有毛发（或皮毛），并用乳汁哺育幼崽的动物"},"examples":[{"en":"Humans are mammals.","zh":"人类是哺乳动物。"},{"en":"A whale is a mammal, not a fish.","zh":"鲸鱼是哺乳动物，不是鱼。"},{"en":"Bats are the only mammals that can truly fly.","zh":"蝙蝠是唯一能真正飞行的哺乳动物。"}]}],"synonyms":["animal (general)","vertebrate (broader category)"],"phonetic":"/ˈmæməl/","extraExplanation":["“maimul” 不是常见或标准的英文单词。它很可能是你想输入的 **mammal**（哺乳动物）的拼写错误。","小提示：**mammal** 来自拉丁语 *mamma*（“乳房/乳汁”），因此和“用乳汁喂养幼崽”这一特征有关。"]}
{"word":"main","summary":{"en":"Main means the most important or the central part of something.","zh":"main表示“最重要的/主要的”，也可指“主体、核心部分”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"most important; chief; principal","zh":"主要的；最重要的；首要的"},"examples":[{"en":"The main reason I came is to learn English.","zh":"我来的主要原因是学习英语。"},{"en":"Our main goal is to finish the project on time.","zh":"我们的主要目标是按时完成项目。"},{"en":"Please use the main entrance.","zh":"请走正门（主要入口）。"}]},{"partOfSpeech":"n.","definition":{"en":"the main part or central point of something","zh":"主体；主要部分；核心"},"examples":[{"en":"The main of the story is simple: be kind.","zh":"这个故事的核心很简单：要善良。"},{"en":"The main of the building was damaged in the storm.","zh":"建筑的主体在暴风雨中受损了。"}]}],"synonyms":["chief","principal","primary","major"],"phonetic":"/meɪn/","extraExplanation":["“main”作形容词时非常常见，通常放在名词前：main idea / main character / main street / main problem。","“the main of …”作名词用法较少见，更常用的是“the main part”或“the main point”。在日常英语里，名词意义常用“main point / main idea / main part”来表达。","常见搭配：mainly（主要地，adv.）；in the main（总体上，大体上，较正式）；the main thing is…（最重要的是……）。"]}
{"word":"main road","summary":{"en":"“Main road” means the primary, busiest road in an area.","zh":"“main road”指某地最主要、最繁忙的道路（主干道/主路）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A major public road that carries most traffic in an area; a primary route (often wider and busier than smaller streets).","zh":"主要道路；主干道（通常比小街更宽、更繁忙，承载主要车流）。"},"examples":[{"en":"Take the first left after you reach the main road.","zh":"到主路后，第一个路口左转。"},{"en":"Our hotel is close to the main road, so it can be a bit noisy at night.","zh":"我们酒店靠近主干道，所以晚上可能会有点吵。"},{"en":"The accident caused heavy traffic on the main road.","zh":"这起事故导致主干道交通严重拥堵。"}]}],"synonyms":["main street","primary road","major road","arterial road"],"phonetic":"/ˈmeɪn ˌroʊd/","extraExplanation":["“main road”是日常通用说法，强调“最主要、最常用的路”。在不同地区也常用更具体的词：英式英语常说“main road / A-road”，美式英语更常说“main road / main street / highway（高速公路）”，但三者不完全等同。","对比：main road（主路/主干道，泛指）≈ primary road（更偏正式/规划用语）；side road / back road（小路/支路）；expressway / freeway / highway（快速路/高速，通常更大更快）。"]}
{"word":"main-channel","summary":{"en":"the primary communication or broadcast channel","zh":"主要沟通渠道或主频道"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the primary or most important route for communication, distribution, or delivery of information or services (often in media, marketing, or customer support)","zh":"（常用于媒体、营销或客服）主要的、最重要的信息/服务传递渠道"},"examples":[{"en":"We’ll announce the update through our main channel first, then post it on social media.","zh":"我们会先通过主要渠道发布更新，然后再发到社交媒体上。"},{"en":"Email is still our main channel for communicating with customers.","zh":"电子邮件仍然是我们与客户沟通的主要渠道。"}]},{"partOfSpeech":"n.","definition":{"en":"the primary stream or frequency of a broadcast (for example, a TV network’s flagship feed)","zh":"（广播/电视等）主频道；主信号流"},"examples":[{"en":"The game will air on the main channel, not the sports add-on.","zh":"比赛会在主频道播出，而不是体育附加频道。"},{"en":"Switch back to the main channel for the evening news.","zh":"切回主频道看晚间新闻。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that is the primary channel for a purpose","zh":"作为主要渠道的；主渠道的"},"examples":[{"en":"Our main-channel strategy focuses on newsletters and webinars.","zh":"我们的主渠道策略聚焦于邮件简报和线上研讨会。"},{"en":"They invested more in main-channel advertising.","zh":"他们在主渠道广告上投入更多。"}]}],"synonyms":["primary channel","main route","chief channel","principal channel","primary route","flagship channel","core channel"],"phonetic":"/ˈmeɪn ˈtʃænəl/","extraExplanation":["在不同领域里，“channel”可以指：沟通方式（email、电话）、销售路径（直营网店、经销商）、媒体平台（电视台/频道、YouTube频道）、或技术上的信号通道。因此 main-channel 往往不是固定某一种平台，而是“最优先、最常用、最关键的那条”。","写法上常见三种：main channel（最常见）、main-channel（作定语时更像一个整体）、Main Channel（作为专有名称时首字母大写）。"],"etymology":"由“main（主要的）+ channel（渠道/频道）”组合而来；在媒体与商业语境中常用来指“最核心的传播/投放/沟通路径”。","mnemonic":["把它理解成“主干道”：main=主要的，channel=通道/渠道 → “主要通道/主渠道”。","联想中文“主频道”：电视里最常看的那个台，就是 main channel。"]}
{"word":"main-top","summary":{"en":"the platform high on a ship’s mainmast","zh":"主桅高处的作业/瞭望平台"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"On a traditional sailing ship, the platform or area high on the mainmast used by sailors for working with rigging, keeping watch, etc.","zh":"（传统帆船上）主桅上的“桅楼/桅盘”（高处的平台或作业区），供水手操作索具、瞭望等。"},"examples":[{"en":"A sailor climbed to the main-top to look for land.","zh":"一名水手爬到主桅桅楼上寻找陆地。"},{"en":"From the main-top, they could see the storm building on the horizon.","zh":"从主桅桅楼上，他们能看到地平线上的风暴正在形成。"},{"en":"He worked in the main-top, tightening lines as the ship rolled.","zh":"船身摇晃时，他在主桅桅楼上收紧绳索。"}]}],"synonyms":["main top","maintop","top","masthead platform"],"phonetic":"/ˈmeɪn ˌtɑp/","extraExplanation":["常见相关词：fore-top（前桅桅楼）、mizzen-top（后桅/小后桅桅楼）。在海事/历史文本中也可能写作 main top，连字符 main-top 多见于旧式写法或为避免歧义。"],"etymology":"来自航海用语：main（主的，指主桅 mainmast）+ top（桅顶的作业平台/上部结构）。在帆船时代，top 常指桅杆上的“桅盘/桅楼”，而不仅是“顶部”这个抽象位置。","mnemonic":["把它拆开记：main=主（主桅），top=桅顶平台；合起来就是“主桅顶的平台”。","联想中文“上到主桅楼去瞭望”：主(main)+顶(top) → 主桅顶上的地方。"]}
{"word":"main-topmast","summary":{"en":"the upper section of a ship’s main mast","zh":"帆船主桅的上段桅杆"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the upper mast above the mainmast on a sailing ship, supporting the main topsail and other upper sails","zh":"（帆船）主桅上段的桅杆；位于主桅之上，用来支撑主上帆等上层帆具"},"examples":[{"en":"The crew sent a sailor up the main-topmast to check the rigging.","zh":"船员派一名水手爬上主上桅，检查索具。"},{"en":"In heavy wind, they reduced sail and secured lines near the main-topmast.","zh":"大风中，他们缩帆，并在主上桅附近加固绳索。"}]}],"synonyms":["topmast","mainmast topmast"],"phonetic":"/ˈmeɪn ˈtɑpˌmæst/","extraExplanation":["传统三桅或多桅帆船上常见的结构是：下桅（mast）之上接上桅（topmast），再往上可能还有顶上桅（topgallant mast）。因此 main-topmast 指“主桅”这一根桅杆体系中的“上桅”部分。","现代航海语境多出现在历史帆船、帆船复原船、海事文学或航海博物馆说明中。"],"etymology":"来自航海用语的复合词：main（主桅/主帆相关）+ topmast（上桅）。topmast 原指“位于下桅之上的桅段”，用于挂更高处的帆。","mnemonic":["拆开记：main=主（主桅那一套），topmast=上桅（top=上面）。合起来就是“主桅的上面那段桅杆”。","把它想成“主桅的 second floor（第二层）”：下层是 mainmast，上面接的就是 main-topmast。"]}
{"word":"mainan","summary":{"en":"“Mainan” means a toy; figuratively, it can mean a plaything.","zh":"“mainan”意为“玩具”；比喻时可指“玩物/被人当作取乐对象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toy; something made for children (or adults) to play with","zh":"玩具；用来玩耍的物品（多指给儿童，也可指成人）"},"examples":[{"en":"She bought her son a new toy.","zh":"她给儿子买了一个新玩具。"},{"en":"These wooden toys are handmade.","zh":"这些木制玩具是手工制作的。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a plaything; someone or something treated as an object for amusement, not taken seriously","zh":"（比喻）玩物；被人当作取乐的对象、不被认真对待的人或事"},"examples":[{"en":"He refused to be anyone’s plaything.","zh":"他拒绝当任何人的玩物。"},{"en":"Fame can turn people into a plaything of public opinion.","zh":"名声可能让人变成舆论的玩物。"}]}],"synonyms":["toy","plaything","thing to play with"],"phonetic":"/ˈmaɪ.nɑn/","extraExplanation":["“mainan”是印尼语词，来自动词“main”（玩、玩耍）加上名词化后缀“-an”，字面意思就是“用来玩的东西”。在日常对话里最常对应英语的“toy”。","比喻义（玩物/玩具）在英语里常用“plaything”，语气通常带有负面含义，表示被操控或不被尊重。"]}
{"word":"mainboard","summary":{"en":"the computer’s primary circuit board","zh":"电脑的核心电路板（主板）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the main circuit board of a computer, where the CPU, memory, and key connectors are installed (also called the motherboard)","zh":"（电脑的）主板；承载CPU、内存及主要接口的核心电路板（也叫 motherboard）"},"examples":[{"en":"Make sure the CPU socket on the mainboard matches your processor.","zh":"确认主板上的 CPU 插槽和你的处理器型号匹配。"},{"en":"The technician replaced the mainboard after the computer stopped powering on.","zh":"电脑无法开机后，技术员更换了主板。"},{"en":"This mainboard has two M.2 slots for SSDs.","zh":"这块主板有两个用于 SSD 的 M.2 插槽。"}]}],"synonyms":["motherboard","system board"],"phonetic":"/ˈmeɪnˌbɔrd/","extraExplanation":["常见搭配：mainboard/motherboard + chipset（芯片组）, socket（插槽）, RAM slots（内存槽）, PCIe slot（PCIe 插槽）, BIOS/UEFI（固件）, onboard audio/LAN（板载声卡/网卡）。","英式或部分亚洲市场的产品说明中更常用 mainboard；美式日常交流里 motherboard 更常见，但两者通常可互换。"],"etymology":"由 main（主要的）+ board（板；电路板）构成的复合词。在电脑语境里常与 motherboard 同义；mainboard 在一些地区/厂商资料中更常见。","mnemonic":["main + board：把它想成“主要的板子”，电脑里最核心的那块电路板。","联想中文“主板”= 主要（main）+ 板（board），一一对应好记。"]}
{"word":"mainbrace","summary":{"en":"Mainbrace is a nautical term for the rope that braces the main yard; in the idiom “splice the mainbrace,” it means to have a celebratory drink.","zh":"mainbrace 是航海用语，指支撑/调整主桁的横牵索；在习语 “splice the mainbrace” 中，引申为“喝一杯庆祝”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) A strong rope/cable used to brace (support and help turn) the main yard on a sailing ship.","zh":"（航海）主帆桁横牵索；用于支撑并协助转动主桁的粗绳/缆索。"},"examples":[{"en":"The crew tightened the mainbrace before the storm reached the ship.","zh":"暴风雨到来前，船员把主帆桁横牵索收紧。"},{"en":"Old sailing manuals describe how to handle the mainbrace when changing course.","zh":"一些古老的航海手册会讲到改航向时如何操作主帆桁横牵索。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the idiom “splice the mainbrace,” a traditional naval way to mean “have a drink,” originally to celebrate or reward sailors.","zh":"在习语“splice the mainbrace”中，指“喝一杯/发酒庆祝”（源自海军传统，用于庆祝或犒赏水手）。"},"examples":[{"en":"After the successful rescue, the captain told everyone to splice the mainbrace.","zh":"救援成功后，船长让大家“喝一杯”庆祝。"},{"en":"In the novel, the sailors cheerfully “splice the mainbrace” at the end of the voyage.","zh":"小说里，水手们在航程结束时高兴地“喝一杯”庆祝。"}]}],"synonyms":["main brace","brace"],"phonetic":"ˈmeɪnˌbreɪs","extraExplanation":["“Mainbrace / main brace”多见于历史航海语境：主桁（main yard）是大帆船最重要的横桁之一，而“brace”是用来拉动、调整横桁角度的绳索系统。","“splice the mainbrace（接主牵索）”之所以能引申为“喝酒庆祝”，与英国皇家海军的传统有关：在重大胜利、节庆或特殊命令时会发放朗姆酒；后来在文学作品与影视中也常用来营造“老水手/海军”氛围。"]}
{"word":"Maine","summary":{"en":"Maine is a U.S. state in New England, famous for its coastline and lobster; it can also refer (rarely) to a historical region in France.","zh":"Maine 通常指美国新英格兰地区的缅因州，以海岸线和龙虾闻名；也可（较少见）指法国历史上的一个地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in the northeastern United States (New England), known for a long Atlantic coastline, forests, and seafood (especially lobster). Capital: Augusta.","zh":"美国东北部（新英格兰地区）的一个州，以漫长的大西洋海岸线、森林和海鲜（尤其是龙虾）闻名。首府：奥古斯塔（Augusta）。"},"examples":[{"en":"She grew up in Maine, near the coast.","zh":"她在缅因州长大，住在海边附近。"},{"en":"We went to Maine for fresh lobster and hiking.","zh":"我们去缅因州吃新鲜龙虾、徒步旅行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A French region/province called Maine (historical), the name that likely influenced the U.S. state’s name.","zh":"（较少见）法国历史上的一个地区/行省，名为 Maine（曼恩/缅因），该名称可能影响了美国缅因州的州名。"},"examples":[{"en":"The name may come from the old French province of Maine.","zh":"这个名字可能源自法国旧时的缅因（Maine）行省。"}]}],"synonyms":["the Pine Tree State"],"phonetic":"/meɪn/","extraExplanation":["“Maine”的读音和单词“main”（主要的）相同，但意义不同；写作“main”时通常是形容词或名词，表示“主要的/主干”。","缅因州常见别称是“The Pine Tree State”（松树州），因为当地森林资源丰富。"]}
{"word":"maine","summary":{"en":"Maine is a U.S. state in New England, famous for its coastline and lobster.","zh":"Maine 指美国新英格兰地区的缅因州，以海岸线和龙虾闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in the northeastern United States (New England), known for its rocky Atlantic coastline, forests, and seafood (especially lobster). Capital: Augusta.","zh":"美国东北部新英格兰地区的一个州，以大西洋岩石海岸、森林和海鲜（尤其是龙虾）闻名。首府为奥古斯塔（Augusta）。"},"examples":[{"en":"We’re taking a road trip to Maine to see the coastline.","zh":"我们要去缅因州自驾旅行，看看海岸线。"},{"en":"Maine is famous for lobster rolls.","zh":"缅因州以龙虾卷很有名。"},{"en":"She moved from New York to Maine for a quieter life.","zh":"她从纽约搬到缅因州，想过更安静的生活。"}]}],"phonetic":"/meɪn/","extraExplanation":["“Maine”是专有名词，首字母必须大写：Maine。作定语时常见于名词前，如“Maine lobster（缅因龙虾）”“Maine coast（缅因海岸）”。","在美国文化里，缅因州常让人联想到灯塔、松林、海边小镇与海鲜；也是作家斯蒂芬·金（Stephen King）许多作品的故事背景地。"]}
{"word":"Mainer","summary":{"en":"a person from or living in Maine","zh":"来自或居住在美国缅因州的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is from Maine or who lives in Maine (a U.S. state)","zh":"缅因州人；住在美国缅因州的人"},"examples":[{"en":"She’s a Mainer, born and raised in Portland, Maine.","zh":"她是缅因州人，在缅因州波特兰出生并长大。"},{"en":"Many Mainers work in fishing, tourism, and forestry.","zh":"许多缅因州人从事渔业、旅游业和林业。"},{"en":"As a Mainer, he’s used to long winters.","zh":"作为缅因州人，他习惯了漫长的冬天。"}]}],"synonyms":["Maine resident","person from Maine"],"phonetic":"/ˈmeɪ.nɚ/","extraExplanation":["在美国英语里，很多州/地区的居民称呼都会用“地名 + -er”，例如 New Yorker（纽约人）、Texan（德州人，但这里不是 -er）。因此 Mainer 是一种很常见、自然的“地方身份”表达。","注意大小写：作为专有名词通常要大写 Mainer；泛指身份时也常保持大写。"],"etymology":"由州名 Maine（缅因州）+ 表示“某地人”的后缀 -er 构成，意思是“来自/居住在缅因州的人”。","mnemonic":["把它拆开记：Maine（缅因州）+ -er（……的人）→ “缅因州的人”。","联想：你在地图上看到 Maine，然后加一个“人”的后缀 -er，就变成“缅因州居民”。"]}
{"word":"mainferre","summary":{"en":"Mainframe = a powerful central computer used by large organizations for large-scale, multi-user data processing.","zh":"Mainframe 指大型机构用于大规模、多用户数据处理的强大中央计算机（大型主机）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, powerful computer used mainly by big organizations to process and store huge amounts of data for many users at the same time","zh":"（大型机构使用的）大型主机/大型计算机，用于同时为许多用户处理并存储海量数据"},"examples":[{"en":"Banks still use mainframes to handle millions of transactions safely.","zh":"银行仍然使用大型主机来安全地处理数百万笔交易。"},{"en":"Our customer records are stored on a mainframe system.","zh":"我们的客户记录存放在一套大型主机系统上。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or operated by a mainframe computer","zh":"与大型主机有关的；由大型主机运行的"},"examples":[{"en":"She works on mainframe applications in the finance department.","zh":"她在财务部门从事大型主机应用的工作。"}]}],"synonyms":["host computer","central computer","enterprise server"],"phonetic":"/ˈmeɪnˌfreɪm/","extraExplanation":["“mainferre”不是常见英文单词。你可能想输入的是 **mainframe**（拼写相近），意思是“大型主机/大型计算机”。\n\nmainframe 在20世纪中后期非常重要，至今仍在银行、政府、航空等需要“高可靠+高安全+高并发”的场景中使用。常见相关词：**mainframe computer**, **mainframe system**, **mainframe application**。如果你指的是别的词（例如人名、品牌、游戏名），可以给我一个句子我再帮你准确解释。"]}
{"word":"mainframe","summary":{"en":"A mainframe is a very large, reliable computer system used by big organizations to handle huge amounts of important data and transactions.","zh":"mainframe 指大型机构用于处理海量关键数据与交易的高可靠大型主机系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, powerful computer used mainly by big organizations (like banks, governments, and airlines) to process huge amounts of data reliably and securely.","zh":"大型主机电脑；一种大型、强大的计算机，主要供银行、政府、航空等大型机构使用，用来可靠、安全地处理海量数据。"},"examples":[{"en":"Many banks still run their core systems on a mainframe because it is very stable.","zh":"许多银行的核心系统仍运行在大型主机上，因为它非常稳定。"},{"en":"The airline’s mainframe handles millions of bookings and check-ins every day.","zh":"这家航空公司的大型主机每天处理数百万次订票和办理登机手续。"}]},{"partOfSpeech":"n.","definition":{"en":"The central, most important system or place where an organization’s main computing work is done.","zh":"（引申）主系统；指机构里最核心、最重要的计算平台或处理中心。"},"examples":[{"en":"Customer records are stored on the mainframe, not on individual laptops.","zh":"客户记录保存在主系统（大型主机）上，而不是各自的笔记本电脑里。"}]}],"synonyms":["big iron","central system"],"phonetic":"/ˈmeɪnfreɪm/","extraExplanation":["“Mainframe”这个词在20世纪中期很常见，原本指大型计算机机柜的“主框架（main frame）”，后来逐渐用来指整套大型机系统。","在现代语境里，mainframe并不等于“超级计算机（supercomputer）”：超级计算机更强调极限运算速度（如科研模拟），而大型机更强调高可靠性、事务处理能力（大量订单/转账）、安全与可维护性。","常见搭配：mainframe computer（大型主机）、mainframe system（大型机系统）、mainframe modernization（大型机现代化/改造）、on the mainframe（在大型机上运行）。"]}
{"word":"mainframes","summary":{"en":"“Mainframes” means large, powerful computers used by big organizations for high-volume, reliable data processing (plural of “mainframe”).","zh":"“mainframes”指大型机构用于高吞吐、可靠数据处理的大型主机（“mainframe”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large, powerful computer used by big organizations to process huge amounts of data and run many users’ tasks at the same time","zh":"（大型机构使用的）大型主机；大型机（用于处理海量数据并同时支持许多用户/任务）"},"examples":[{"en":"Banks still use mainframes to handle millions of transactions securely.","zh":"银行仍然使用大型主机来安全地处理数以百万计的交易。"},{"en":"The company is moving some services from the mainframe to the cloud.","zh":"这家公司正在把一些服务从大型主机迁移到云端。"},{"en":"Mainframes are known for reliability and strong security controls.","zh":"大型主机以高可靠性和强安全控制而闻名。"}]}],"synonyms":["big iron","enterprise computer","central computer"],"phonetic":"/ˈmeɪn.freɪm/","extraExplanation":["“mainframe”来自早期计算机时代：中央处理单元和关键部件常装在一个很大的“frame（机架/机柜）”里，因此叫 mainframe。","现代语境中，mainframe 常与“server（服务器）”“supercomputer（超级计算机）”区分：mainframe 强在高可靠、可扩展、可同时处理大量业务（尤其是金融、政府、航空订票等）；supercomputer 更偏向科学计算与极端算力。","你输入的“mainframes”是复数形式；单数是 “mainframe”。在口语中也常说 “mainframe systems”（主机系统）。"]}
{"word":"mainit","summary":{"en":"hot; warm to the point of discomfort, especially about weather or objects","zh":"热的；（尤指天气或物体）热到有些不舒服"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"hot (having a high temperature; also used for hot weather)","zh":"热的；炎热的（温度高，也常用来形容天气热）"},"examples":[{"en":"Mainit today—bring water.","zh":"今天很热——带点水。"},{"en":"Mainit ang kape, so wait a minute before drinking.","zh":"咖啡很烫，所以先等一下再喝。"}]},{"partOfSpeech":"vi.","definition":{"en":"to feel hot; to become hot","zh":"觉得热；变热"},"examples":[{"en":"I get hot easily when I walk fast.","zh":"我走快一点就很容易觉得热。"},{"en":"The room becomes hot in the afternoon.","zh":"房间到了下午会变热。"}]}],"synonyms":["hot","warm","heated","sweltering"],"phonetic":"/mɑˈiːnɪt/","extraExplanation":["用法小提示（他加禄语）：常见结构是“Mainit + (ng) 名词 / Mainit ang + 名词”。例如：Mainit ang panahon（天气很热），Mainit na kape（热咖啡）。","它也可以在语气上表达“受不了的热/很闷热”，具体强度取决于语境与语调。"],"etymology":"他加禄语常用形容词，来自南岛语系的同源词根，核心意思与“热、温度高”相关；日常对话里也常用来描述天气炎热。","mnemonic":["把它拆成“mai + nit”：想成“买（mai）一杯很‘腻/热’（nit）咖啡”，提醒自己是“热的”。","联想中文“闷热”的“闷”（mèn）和开头的“ma-”相近：ma- 开头就想天气很闷热。"]}
{"word":"mainland","summary":{"en":"Mainland usually means the main continuous land of a country (not the islands). In China-related contexts, “the Mainland” often refers to mainland China.","zh":"Mainland通常指一个国家连成一片的主要陆地（不含岛屿）。在中国相关语境里，“the Mainland”常指中国大陆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the main part of a country or region (a large continuous area of land), not including islands or overseas territories; often used in contrasts like “the mainland and the islands.”","zh":"（国家或地区的）本土/大陆部分；指连成一片的主要陆地，不包括岛屿或海外领地；常与“岛屿”相对。"},"examples":[{"en":"We took a ferry from the island back to the mainland.","zh":"我们坐渡轮从岛上回到大陆（本土）。"},{"en":"Goods are shipped from the mainland to smaller islands each week.","zh":"每周都有货物从本土运往较小的岛屿。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the main part of a country (not the islands or overseas areas).","zh":"本土的；大陆的（相对于岛屿或海外地区）。"},"examples":[{"en":"Mainland prices are usually lower than on the island.","zh":"本土的价格通常比岛上低。"}]},{"partOfSpeech":"n.","definition":{"en":"in some contexts, especially about China, “the Mainland” means mainland China (excluding Hong Kong, Macau, and Taiwan).","zh":"在特定语境中（尤其谈到中国时），“the Mainland”常指中国大陆（通常不含香港、澳门和台湾）。"},"examples":[{"en":"She moved from Hong Kong to the Mainland for work.","zh":"她从香港去大陆工作。"},{"en":"The policy applies in the Mainland but not in Hong Kong.","zh":"这项政策适用于大陆，但不适用于香港。"}]}],"synonyms":["continent","mainland area","main territory","the main landmass"],"phonetic":"/ˈmeɪnˌlænd/","extraExplanation":["用法提醒：在“the mainland”里通常要加定冠词 the（例如：on the mainland, from the mainland）。作形容词时一般不加 the（例如：mainland cities）。","文化语境：在跨地域话题中，“the Mainland/ mainland China”是常见称呼，但不同地区对其政治与身份含义可能很敏感。写作或交流时，最好根据场合明确指代（例如：mainland China / the Chinese mainland），并尊重对方用词习惯。"]}
{"word":"mainlander","summary":{"en":"A “mainlander” is someone from the mainland—most commonly, a person from mainland China (contrasted with Taiwan, Hong Kong, etc.). It can also mean “mainland” as an adjective.","zh":"“mainlander”指来自大陆的人，最常见是指中国大陆人（相对于台湾、香港等）。也可作形容词表示“大陆的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the mainland (the main part of a country), especially someone from mainland China (as opposed to Taiwan, Hong Kong, or an island region)","zh":"大陆人；（尤指）中国大陆人（相对于台湾、香港或岛屿地区）"},"examples":[{"en":"In Taiwan, some people use the word “mainlander” to mean someone from mainland China.","zh":"在台湾，有些人用“mainlander”来指来自中国大陆的人。"},{"en":"The city has many mainlanders who moved here for work.","zh":"这座城市有很多为了工作搬来这里的大陆人。"}]},{"partOfSpeech":"adj.","definition":{"en":"from or connected to the mainland (not an island)","zh":"大陆的；来自大陆的（非岛屿）"},"examples":[{"en":"Mainlander tourists visited the island during the holiday.","zh":"假期里有大陆游客来岛上旅游。"},{"en":"She prefers mainlander food to island cuisine.","zh":"她更喜欢大陆的食物，不太喜欢岛上的料理。"}]}],"synonyms":["person from the mainland","mainland Chinese","mainland resident"],"phonetic":"/ˈmeɪnˌlændɚ/","extraExplanation":["“mainlander”是一个带有强烈语境色彩的词：在台湾语境中，历史上也常指1949年前后从中国大陆迁入台湾的人及其后代（有时与“本省人”对比）。在日常跨地域交流中，为了更中性、避免引起误解，常用“people from mainland China / mainland Chinese”（英语）或“来自中国大陆的人”（中文）。","在更一般的地理意义上，它也可以指“来自一国本土/大陆部分的人”（例如相对于离岛居民），但最常见的国际用法仍与“mainland China”相关。"]}
{"word":"Mainlanders","summary":{"en":"people from the mainland, especially from mainland China in some contexts","zh":"来自本土/大陆的人；在特定语境中常指中国大陆人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who come from a country’s mainland (not from its islands or overseas territories).","zh":"来自一个国家“本土/大陆”（不是岛屿或海外属地）的人。"},"examples":[{"en":"Many mainlanders move to the islands for work.","zh":"很多大陆本土的人为了工作搬到岛上。"},{"en":"The ferry is often crowded with mainlanders on holidays.","zh":"节假日渡轮上常常挤满来自大陆本土的乘客。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often in Hong Kong or Taiwan contexts) People from mainland China.","zh":"（常见于香港或台湾语境）“大陆人”，指来自中国大陆的人。"},"examples":[{"en":"Some shops offer tax refunds for mainlanders.","zh":"有些商店会给大陆游客提供退税服务。"},{"en":"The article discussed tensions between locals and mainlanders.","zh":"这篇文章讨论了本地人与大陆人之间的紧张关系。"}]}],"synonyms":["mainland residents","mainland Chinese","people from the mainland","non-islanders"],"phonetic":"/ˈmeɪnˌlændɚz/","extraExplanation":["语用提示：在香港/台湾等地，“mainlanders”有时带有情绪色彩（可能中性，也可能被用得不礼貌）。正式或更中性的说法可用 “people from mainland China / mainland Chinese visitors/residents”。在其他国家语境中，它也可以泛指“来自本土（非岛屿）的人”。"],"etymology":"由 main（主要的/本土的）+ land（陆地）+ -er（……的人）构成；原意是“来自本土陆地的人”，后来在特定地区语境中常专指“来自中国大陆的人”。","mnemonic":["记法：main（主要的）+ land（陆地）→ “主要的陆地”= 大陆；mainlander = 大陆来的那个人。","联想：和 islander（岛民/岛上人）相对，记住“陆地 vs 岛”。"]}
{"word":"mainlanders","summary":{"en":"“Mainlanders” means people from the mainland (not an island), often referring to people from mainland China.","zh":"“mainlanders”指大陆居民（非岛屿），常用于指中国大陆的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live on, or come from, the mainland (not an island), especially used to mean people from mainland China in contrast to Hong Kong, Macau, or Taiwan.","zh":"大陆人；（尤指）中国大陆居民（与香港、澳门或台湾相对）。"},"examples":[{"en":"Many mainlanders visit Hong Kong for shopping and sightseeing.","zh":"许多大陆人到香港购物和观光。"},{"en":"In Taiwan, some people use “mainlanders” to refer to people from mainland China.","zh":"在台湾，有些人用“mainlanders”指来自中国大陆的人。"}]}],"synonyms":["people from the mainland","mainland Chinese (context-specific)","Mainlanders (capitalized in some contexts)"],"phonetic":"/ˈmeɪnˌlændərz/","extraExplanation":["“mainlanders”在不同地区带有不同语气：在香港、澳门或台湾的语境里，它常用来区分“本地人/岛上居民”和“来自中国大陆的人”。有时是中性描述，有时会被当作带偏见或标签化的说法。若不确定语气，可改用更中性的“people from mainland China（中国大陆来的人）”或直接说“visitors/tourists from the mainland（来自大陆的游客）”。","英式写法常见为“Mainlanders”（特指群体时可能大写），但日常英语中多小写“mainlanders”。在正式写作中，最好明确指的是“mainland China”还是“一般意义上的 mainland（大陆地区）”。"]}
{"word":"mainlands","summary":{"en":"“Mainlands” means more than one mainland—the main land area (not islands) of a country or region.","zh":"“Mainlands”是“mainland”的复数，指一个或多个国家/地区的主要陆地部分（不含岛屿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “mainland”: the main (largest) land area of a country or region, not including nearby islands","zh":"“mainland”的复数：指一个国家或地区的主要（最大）陆地区域，不包括附近的岛屿"},"examples":[{"en":"Many people travel between the islands and the mainlands for work.","zh":"很多人为了工作在岛屿和各个大陆地区之间往返。"},{"en":"Ferries connect the island to the mainlands across the channel.","zh":"渡轮把这个岛与海峡对岸的陆地连接起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in politics/geography) more than one “mainland” area when comparing several island regions or countries","zh":"（常用于政治/地理对比）在比较多个岛国或群岛地区/国家时，指不止一个“本土大陆地区/大陆本部”"},"examples":[{"en":"In the Pacific, some island nations rely on the mainlands nearby for supplies.","zh":"在太平洋地区，一些岛国依赖附近的大陆地区获取物资。"},{"en":"News reports compared prices on the islands with those on the mainlands.","zh":"新闻报道对比了岛上与大陆地区的物价。"}]}],"synonyms":["mainland areas","continental areas","the continent (context-dependent)"],"phonetic":"ˈmeɪnˌlændz","extraExplanation":["在中文语境里常见的“大陆（Mainland）”带有特定政治指代（如“the Mainland”指中国大陆、相对于港澳台），但英文里 mainland 本身多为中性地理词。写作时若要特指某地，常说 “mainland China / the Chinese mainland” 或 “the mainland (of …)”。","更常用的单数形式是 mainland；只有在同时谈到多个“本土大陆地区”时才用复数 mainlands。"]}
{"word":"mainline","summary":{"en":"Mainline can mean a main route (especially a railway line), something mainstream, or (informally) injecting drugs into a vein.","zh":"mainline 可指（尤指）铁路干线等主干线路、主流的/主流事物，也可（俚语）指静脉注射毒品。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a drug user) to inject a drug directly into a vein.","zh":"（吸毒者）把毒品直接注射进静脉（静脉注射）。"},"examples":[{"en":"He was arrested for possessing drugs and equipment used to mainline heroin.","zh":"他因持有毒品以及用于静脉注射海洛因的器具而被捕。"},{"en":"The report warns that mainlining greatly increases the risk of overdose.","zh":"报告警告说，静脉注射会大大增加过量的风险。"}]},{"partOfSpeech":"n.","definition":{"en":"a major or most important route, especially a main railway line.","zh":"主干线路；（尤指）铁路干线。"},"examples":[{"en":"Freight trains were delayed on the mainline after the storm.","zh":"暴风雨后，货运列车在干线上延误了。"},{"en":"The village sits just off the mainline to the capital.","zh":"这个村庄就在通往首都的干线旁。"}]},{"partOfSpeech":"adj.","definition":{"en":"mainstream; accepted as normal by most people.","zh":"主流的；被大多数人接受为“正常”的。"},"examples":[{"en":"Her music finally crossed over into the mainline charts.","zh":"她的音乐终于打入主流排行榜。"},{"en":"The film was too experimental for mainline audiences.","zh":"这部电影太实验了，不太适合主流观众。"}]}],"synonyms":["main route","trunk line","mainstream","conventional","inject intravenously"],"phonetic":"/ˈmeɪnˌlaɪn/","extraExplanation":["“mainline”在美国文化里还有专名用法：the Main Line 常指宾夕法尼亚州费城西郊一带（沿铁路干线发展），历史上与富裕社区、名校等形象相关。","动词 mainline（静脉注射）属于毒品语境，正式写作中通常会用更中性的表达如 inject intravenously（静脉注射），并注意语境敏感性。"]}
{"word":"mainlined","summary":{"en":"“Mainlined” most often means injected a drug into a vein; more rarely, it means made something part of the mainstream quickly.","zh":"“Mainlined”最常指把毒品静脉注射；较少见时指让某事迅速“主流化”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(slang) Injected a drug directly into a vein (past tense/past participle of “mainline”).","zh":"（俚语）把毒品直接注射进静脉（“mainline”的过去式/过去分词）。"},"examples":[{"en":"He admitted he had mainlined heroin for years.","zh":"他承认自己多年来一直静脉注射海洛因。"},{"en":"The report described a rise in people who had mainlined opioids.","zh":"报告描述了静脉注射阿片类药物的人数上升。"}]},{"partOfSpeech":"vt.","definition":{"en":"Moved into the mainstream quickly; made something part of normal, widely accepted practice (past tense/past participle of “mainline”).","zh":"快速进入主流；把某事物纳入常态、广泛接受的做法（“mainline”的过去式/过去分词）。"},"examples":[{"en":"Over time, the once-radical idea was mainlined into everyday policy.","zh":"随着时间推移，这个曾经激进的想法被纳入日常政策的主流。"},{"en":"Streaming services mainlined international shows for U.S. audiences.","zh":"流媒体平台让国际剧集迅速进入美国观众的主流视野。"}]}],"synonyms":["injected (into a vein)","shot up (slang)","mainstreamed","brought into the mainstream"],"phonetic":"/ˈmeɪnlaɪnd/","extraExplanation":["“mainline”本义与“主干线/干线”有关；作为毒品俚语时，指把药物直接打进“主线”（静脉）。这个用法语气很强，常见于医学、社会新闻、戒毒与公共卫生语境。","第二个比喻义（把某事“主流化”）在写作中也能见到，但频率较低；更常见的表达是“mainstreamed / brought into the mainstream”。"]}
{"word":"mainliner","summary":{"en":"Mainliner: (1) a person traveling on a mainline route; (2) a member/supporter of the mainstream or established group.","zh":"mainliner： (1) 干线乘客/走主线的人；(2) 主流派、传统建制派成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a passenger on a mainline (a major railroad or transport route), especially someone traveling on the main line rather than a branch line","zh":"（铁路或交通）干线乘客；指在主要线路（干线）上旅行的人（相对于支线）"},"examples":[{"en":"We met a friendly mainliner on the overnight train from Chicago.","zh":"我们在从芝加哥出发的夜车上遇到了一位友善的干线乘客。"},{"en":"The branch line was slow, but the mainliners reached the city quickly.","zh":"支线很慢，但走干线的人很快就到了城里。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who belongs to, supports, or represents the “mainline” (the mainstream or established part of something, such as politics or religion)","zh":"主流派成员；指属于、支持或代表“主流/传统建制”（如政治或宗教）的人"},"examples":[{"en":"In that debate, the mainliners argued for gradual reform.","zh":"在那场辩论中，主流派主张渐进改革。"},{"en":"The article compared mainliners and newcomers in the party.","zh":"那篇文章比较了党内的主流派与新加入者。"}]}],"synonyms":["mainline passenger","mainline traveler","mainstreamer","establishment figure"],"phonetic":"/ˈmeɪnˌlaɪnər/","extraExplanation":["“mainliner”来自“main line（干线/主线）”。在北美语境中，mainline也常指“主流、传统、建制”的群体或机构，例如“mainline Protestant（美国传统主流新教）”。因此mainliner既可能是字面意义上的“走干线的人”，也可能是引申意义上的“主流派人士”。","语域提示：第二个意思在政治、社会评论中较常见，有时带有“建制派/传统派”的微妙语气（不一定褒贬，取决于上下文）。"]}
{"word":"mainliners","summary":{"en":"Mainliners can mean members of mainline Protestant churches, people who use a main railway line, or (informally) people who inject drugs.","zh":"mainliners 可指主流新教教派成员、铁路干线乘客/工作人员，也可在俚语中指静脉注射毒品者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who belongs to a traditional, established Protestant church (a “mainline” denomination), especially in the U.S.","zh":"（尤指美国）主流新教教派的成员（“mainline”教派），通常指历史悠久、较为传统的教会团体成员。"},"examples":[{"en":"Her grandparents are mainliners who have attended the same church for decades.","zh":"她的祖父母是主流新教教派的成员，几十年来一直在同一间教会做礼拜。"},{"en":"In some towns, mainliners and evangelicals have different worship styles.","zh":"在一些城镇里，主流新教与福音派的礼拜风格不同。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who travels or works on a main railway line (main line).","zh":"（铁路）干线乘客；在铁路主干线工作的人员。"},"examples":[{"en":"The station is busiest during rush hour, when mainliners crowd the platforms.","zh":"高峰期车站最繁忙，干线乘客挤满了站台。"},{"en":"Mainliners often prefer express trains that stop less frequently.","zh":"干线乘客通常更喜欢停站较少的特快列车。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sensitive) a person who injects drugs into a vein (“mainline”).","zh":"（非正式用语，较敏感）静脉注射毒品者（把药物“打进血管”，即 mainline）。"},"examples":[{"en":"The outreach program offers clean supplies and support for mainliners who want treatment.","zh":"外展项目为静脉注射者提供清洁用品，并为想接受治疗的人提供支持。"},{"en":"Public health workers focus on reducing harm among mainliners.","zh":"公共卫生工作者着重于降低静脉注射人群的危害。"}]}],"synonyms":["mainline Protestants","rail travelers","people who inject drugs (PWID)"],"phonetic":"/ˈmeɪnˌlaɪnər/","extraExplanation":["“mainliners”是复数形式；单数是“mainliner”。","在美国宗教语境中，“mainline Protestant”通常指一些历史悠久、组织完善、社会影响力较大的新教宗派。这个用法带有社会学/文化讨论色彩，并不等同于“虔诚与否”。","与毒品相关的“mainliner”属于俚语且带有污名化风险；在正式或关怀性场合更常用更中性的表达，如“people who inject drugs (PWID)”（静脉注射药物者）。"]}
{"word":"mainlines","summary":{"en":"“Mainlines” can mean major lines/routes (plural noun), or it can be the verb “mainline,” meaning either to inject a drug into a vein or to make something the central focus.","zh":"“mainlines”可作复数名词，指各种“干线/主线路”；也可对应动词“mainline”，表示“静脉注射毒品”，或“把某事纳入核心/主流”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to consume (a drug) by injecting it into a vein","zh":"（毒品）静脉注射；把（毒品）打进血管里"},"examples":[{"en":"He admitted he used to mainline heroin.","zh":"他承认自己以前会静脉注射海洛因。"},{"en":"The clinic offers help for people who have been mainlining drugs.","zh":"这家诊所为曾经静脉注射毒品的人提供帮助。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something the main focus or central part of a system, policy, or discussion","zh":"把……作为主线/主流；将……纳入核心议程"},"examples":[{"en":"The company mainlined safety training into every department.","zh":"公司把安全培训作为每个部门的核心内容。"},{"en":"They tried to mainline climate issues into the election debate.","zh":"他们试图把气候议题纳入选举辩论的核心。"}]},{"partOfSpeech":"n.","definition":{"en":"main routes or systems; major lines for transport, utilities, or communication (plural)","zh":"（复数）干线；主线路（如铁路、管道、通信线路等）"},"examples":[{"en":"Storm damage shut down several rail mainlines.","zh":"暴风雨造成多条铁路干线停运。"},{"en":"The water mainlines run under the oldest part of the city.","zh":"城市最古老的区域下面铺设着供水主干管线。"}]}],"synonyms":["major lines","trunk lines","inject (a drug)","mainstream","integrate"],"phonetic":"/ˈmeɪnlaɪn/","extraExplanation":["“mainline”作动词表示“静脉注射毒品”时语域很强，常见于医学、新闻或戒毒语境，带有明显的负面和高风险含义。日常对话中更常用“inject drugs”来更中性地表达。","“mainline”作“把……纳入核心/主流”更常见于商业、政策、媒体语境；名词“mainline(s)”则常指铁路干线或各类“主干线路/主管道”。"]}
{"word":"mainlining","summary":{"en":"Mainlining most commonly means injecting a drug directly into a vein; informally it can also mean absorbing something extremely quickly and intensely.","zh":"Mainlining最常指把毒品直接注射进静脉；口语中也可比喻“极快、强烈地吸收”信息等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of injecting a drug directly into a vein (used especially in discussions of drug use and addiction)","zh":"（尤用于谈论毒品与成瘾时）把毒品直接注射进静脉的行为"},"examples":[{"en":"The health program warns about the risks of mainlining, including infection and overdose.","zh":"该健康项目警告“静脉注射吸毒”（mainlining）的风险，包括感染和过量。"},{"en":"He sought treatment after years of mainlining heroin.","zh":"他在多年静脉注射海洛因后寻求治疗。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal, figurative) to take in something very quickly and intensely, as if straight into the bloodstream (e.g., information, music, media)","zh":"（非正式/比喻）非常快速、强烈地吸收某物，好像直接“打进血液里”（如信息、音乐、媒体）"},"examples":[{"en":"During exam week, she was mainlining information from videos and notes.","zh":"考试周她从视频和笔记里疯狂“快速吸收”信息。"},{"en":"I was mainlining podcasts on my commute.","zh":"我通勤时一直在“猛听”播客。"}]}],"synonyms":["injecting","intravenous injection","shooting up (slang)","taking in","absorbing"],"phonetic":"/ˈmeɪnˌlaɪnɪŋ/","extraExplanation":["“Mainline”原意是“（铁路的）干线/主线”。把药物注射进静脉被比喻成“直接进入身体的主通道”，因此形成俚语“to mainline”。","语境提醒：与毒品相关的用法常见于医学、新闻或戒毒话题；比喻用法也存在，但在正式写作中可能显得过于强烈或不够得体。"]}
{"word":"mainly","summary":{"en":"“Mainly” means “mostly” or “primarily,” used to show the main part or reason without excluding others.","zh":"“mainly”表示“主要地/多半”，强调重点在某一部分，但并不排除其他情况。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"More than anything else; mostly; primarily.","zh":"主要地；多半；大体上。"},"examples":[{"en":"The audience was mainly students and teachers.","zh":"观众主要是学生和老师。"},{"en":"I’m mainly interested in the history, not the politics.","zh":"我主要对历史感兴趣，而不是政治。"},{"en":"The work is mainly done online these days.","zh":"如今这项工作主要在线上完成。"}]}],"synonyms":["mostly","primarily","largely","chiefly","for the most part"],"phonetic":"/ˈmeɪnli/","extraExplanation":["“mainly”常用来温和地表达“重点/核心在这里”，语气比“only（只）”更不绝对，表示“以……为主，但不排除其他”。","常见搭配：mainly + 名词/动名词（mainly students / mainly working online），mainly + 形容词/介词短语（mainly responsible / mainly in summer）。"]}
{"word":"mainmast","summary":{"en":"Mainmast means the principal (usually tallest, central) mast of a sailing ship.","zh":"mainmast 指帆船上最主要（通常最高、位于中央）的桅杆，即主桅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tallest or principal mast on a sailing ship, usually the central mast that carries major sails and rigging","zh":"（帆船的）主桅；主桅杆（通常是船中央最高、最主要的桅杆，承载主要帆和索具）"},"examples":[{"en":"The crew climbed the mainmast to repair a torn sail.","zh":"船员爬上主桅去修补破掉的帆。"},{"en":"From the deck, the mainmast rose high against the gray sky.","zh":"从甲板上看，主桅高高耸立在灰色的天空下。"},{"en":"In old sea stories, storms often snap the mainmast like a twig.","zh":"在老海上故事里，暴风雨常把主桅像树枝一样折断。"}]}],"synonyms":["main mast","principal mast"],"phonetic":"/ˈmeɪnˌmæst/","extraExplanation":["“mast”是“桅杆”。在多桅帆船上常见的三根桅杆分别是：foremast（前桅）、mainmast（主桅）、mizzenmast（后桅）。主桅通常最大，承担主要的推进帆。","常见搭配：the mainmast broke/splintered（主桅折断/碎裂）；climb/shin up the mainmast（爬上主桅）；mainmast rigging（主桅索具）。","在文学与海洋叙事中（如航海小说、海盗故事），mainmast常用来营造“高耸、危险、风暴、远航”的意象：角色爬上主桅瞭望、或风暴中主桅断裂象征危机。"]}
{"word":"mainmasts","summary":{"en":"“Mainmasts” means the main/primary masts on a sailing ship (plural of “mainmast”).","zh":"“mainmasts”指帆船上的主桅（“mainmast”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The principal (tallest or most important) masts on a sailing ship; plural of “mainmast.”","zh":"（帆船上）主桅；主要的桅杆（“mainmast”的复数）。"},"examples":[{"en":"From the harbor, you could see the ship’s mainmasts rising above the other boats.","zh":"从港口望去，你能看到那艘船的主桅高高耸立，超过其他船只。"},{"en":"During the storm, the crew checked the mainmasts and rigging for damage.","zh":"暴风雨中，船员检查主桅和索具是否受损。"},{"en":"The old painting shows three mainmasts with full sails catching the wind.","zh":"那幅老画里有三根主桅，满帆迎风。"}]}],"synonyms":["main masts","principal masts","primary masts"],"phonetic":"ˈmeɪnˌmæsts","extraExplanation":["“mast”是“桅杆”，而“mainmast”通常指一艘帆船上最主要/最高的那根桅杆（不同船型可能有多根桅杆，如前桅 foremast、主桅 mainmast、后桅 mizzenmast）。在一些语境里，人们也会用“mainmasts”泛指船上主要的几根桅杆。"]}
{"word":"mainmortable","summary":{"en":"“mainmortable” is not a recognized English word; it’s likely a misspelling.","zh":"“mainmortable”不是标准英语单词，可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a typo, so it does not have an accepted dictionary meaning.","zh":"不是标准英语单词，可能是拼写错误或打字错误，因此没有被词典收录的固定含义。"},"examples":[{"en":"I can’t find “mainmortable” in a dictionary—did you mean “memorable” or “immortal”?","zh":"我在词典里找不到“mainmortable”——你是不是想写“memorable（难忘的）”或“immortal（不朽的）”？"},{"en":"Please tell me the sentence you saw it in, and I can help you identify the correct word.","zh":"请把你看到它的句子发给我，我可以帮你判断正确的单词。"}]}],"extraExplanation":["“mainmortable”看起来像把两个词粘在一起（或拼写接近某个词）。最常见的可能是：\n1) memorable（难忘的）\n2) immortal（不朽的）\n3) manifold / maintain 等以 main- 开头的词（取决于上下文）\n把原句或你想表达的中文意思发我，我可以给出最准确的对应词和用法。"]}
{"word":"mainor","summary":{"en":"“mainor” is not a common English word; it is usually a misspelling of “minor” (underage person; not serious/small; to study a secondary subject).","zh":"“mainor”不是常见英语词；通常是把“minor”拼错了（未成年人；轻微的/不重要的；辅修）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely meant: minor) a person under the legal age of adulthood (usually 18 in the U.S.).","zh":"（多半是想写：minor）未成年人；未到法定成年年龄的人（在美国通常为18岁）。"},"examples":[{"en":"You must be 18 or older; minors can’t buy alcohol.","zh":"你必须年满18岁；未成年人不能购买酒精饮料。"},{"en":"The movie is not allowed for minors without a parent.","zh":"这部电影未成年人没有家长陪同不得观看。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely meant: minor) not important, serious, or large; small in degree.","zh":"（多半是想写：minor）不重要的；较小的；轻微的。"},"examples":[{"en":"It was a minor mistake, so don’t worry too much.","zh":"那是个小错误，不用太担心。"},{"en":"She suffered minor injuries in the accident.","zh":"她在事故中受了轻伤。"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely meant: minor) to study a secondary subject in college, in addition to your main subject (your major).","zh":"（多半是想写：minor）（大学）辅修（某学科），与主修（major）相对。"},"examples":[{"en":"I’m majoring in biology and minoring in psychology.","zh":"我主修生物，辅修心理学。"},{"en":"He decided to minor in business to improve his job prospects.","zh":"他决定辅修商科，以提升就业机会。"}]}],"synonyms":["(adj.) small","(adj.) slight","(adj.) lesser","(n.) underage person","(v.) take a minor (in)"],"phonetic":"/ˈmaɪnər/","extraExplanation":["“mainor”本身在英语里不常见，更多时候是把“minor”拼错了。","minor（辅修）这一用法主要见于北美大学语境：major 是主修，minor 是辅修。","如果你指的是姓氏“Mainor”（人名/地名），也可能存在，但它不属于常见词汇；你可以告诉我上下文，我再按人名解释。"]}
{"word":"mainour","summary":{"en":"“mainour” is not a standard English word; it is most likely a misspelling of **manor** (a large country house/estate).","zh":"“mainour”不是标准英语单词；它很可能是 **manor**（庄园主宅/庄园）的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: **manor**) A large country house, often the main home on a historic estate; also the estate/lands connected to it.","zh":"（你可能想查的是 **manor**）庄园主宅；（也可指）领地/庄园（含房屋与其附属土地）。"},"examples":[{"en":"They visited an old manor in the countryside.","zh":"他们参观了乡间一座古老的庄园主宅。"},{"en":"The manor house was surrounded by gardens and farmland.","zh":"庄园主宅周围有花园和农田。"}]}],"synonyms":["estate","country house","mansion"],"phonetic":"/ˈmænɚ/","extraExplanation":["“mainour”不是常见英语单词，最接近且常见的拼写是 **manor**（庄园/庄园主宅）。如果你想表达“主要的/我们的”，通常写作 **main**（主要的）和 **our**（我们的），但它们不会合写成一个词。","文化提示：在英国历史语境中，**manor** 常与中世纪的“庄园制度”相关；在现代英语里更常指“乡间大宅/庄园主宅”，语感偏正式、带一点历史或文学氛围（例如描写古老宅邸的小说里常出现）。"]}
{"word":"mainpast","summary":{"en":"“mainpast” is not a standard English word; it likely refers to “main past” or the simple past tense.","zh":"“mainpast”不是标准英语单词；可能指“main past（两个词）”或“一般过去时”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or username. You may mean “main past” (two words) or you may be asking about the “main (simple) past tense” in grammar.","zh":"不是标准英语单词，更像是拼写错误或用户名。你可能想写的是两个词“main past”，或是在问语法里的“主要的（一般）过去时”。"},"examples":[{"en":"I can’t find “mainpast” in a dictionary—did you mean “main past” or “simple past”?","zh":"我在词典里找不到“mainpast”——你是想写“main past”还是“simple past（一般过去时）”吗？"},{"en":"In this story, the main events happened in the past, so the writer uses the simple past tense.","zh":"这个故事的主要事件发生在过去，所以作者使用一般过去时。"}]}],"phonetic":"/ˈmeɪnˌpæst/","extraExplanation":["“main past”如果是你想表达的两个词，常见意思可能是“主要的过去经历/主要发生在过去的部分（main part in the past）”。但这不是固定搭配，更自然的说法通常是：the main events in the past / the main part of the story is set in the past。","如果你想问语法：英语里最常用来讲过去事实的时态是 simple past（一般过去时），例如：I went, I saw, I studied。也常与过去时间词连用：yesterday, last week, in 2020, two days ago。"]}
{"word":"mainpernable","summary":{"en":"Impenetrable means impossible to get through, or very hard to understand.","zh":"Impenetrable 指“无法穿透的”，也可指“难以理解的/晦涩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a material, wall, or defense) impossible or very difficult to get through.","zh":"（指材料、墙或防御）无法或极难穿透的；坚不可摧的。"},"examples":[{"en":"The castle was protected by impenetrable stone walls.","zh":"城堡由坚不可摧的石墙保护着。"},{"en":"Dense fog made the forest seem impenetrable.","zh":"浓雾让森林看起来难以进入。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of an idea, text, or person) hard to understand; obscure.","zh":"（指思想、文章或人）难以理解的；晦涩的。"},"examples":[{"en":"Some parts of the article were impenetrable to beginners.","zh":"这篇文章有些部分对初学者来说很难懂。"},{"en":"He gave an impenetrable explanation full of jargon.","zh":"他的解释晦涩难懂，满是行话。"}]}],"synonyms":["impassable","inaccessible","opaque","unfathomable","inscrutable"],"phonetic":"/ɪmˈpɛnətrəbəl/","extraExplanation":["你输入的“mainpernable”看起来像是拼写错误。最接近、最常见的英文单词是 **impenetrable**（常见拼写为 i-m-p-e-n-e-t-r-a-b-l-e）。","词源上，**im-** 表示“否定/不”，**penetrate** 表示“穿透/进入”，因此 **impenetrable** 字面意思就是“不能被穿透的”。","近义词区分：**impenetrable** 强调“无法穿过/无法理解”；**impermeable** 更常用于“不可渗透的”（液体/气体不能通过，如 impermeable fabric）。"]}
{"word":"mainpernor","summary":{"en":"“mainpernor” is not a recognized English word; it’s probably a misspelling or a proper name.","zh":"“mainpernor”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username rather than a dictionary word.","zh":"这不是标准英语单词；更可能是拼写错误，或是人名/用户名等专有名词。"},"examples":[{"en":"I can’t find “mainpernor” in an English dictionary—did you mean “main,” “person,” or something else?","zh":"我在英语词典里找不到“mainpernor”——你是想写“main（主要的）”、“person（人）”还是别的词？"},{"en":"Please tell me the sentence where you saw “mainpernor,” and I’ll help you identify the correct word.","zh":"请把你看到“mainpernor”的句子发给我，我可以帮你判断正确的词。"}]}],"extraExplanation":["我可能需要你提供更多线索才能准确查询：\n1）你在哪个句子/文章里看到它？\n2）它想表达的中文意思是什么？\n3）是否可能是两个词连在一起（例如 main + person / main + partner 等）？\n\n如果你想查的是某个接近的英文词，也可以把你想表达的意思告诉我，我会给出最可能的正确拼写和用法。"]}
{"word":"mainpin","summary":{"en":"“Main pin/mainpin” usually means a key support (like “linchpin”), or in technical contexts a main pin in machinery.","zh":"“main pin/mainpin”通常指“关键支撑/主心骨”（类似 linchpin）；在技术语境中可指机器里的主销/轴销。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the most important person or thing that holds a plan, group, or system together; a key support (more commonly said as “linchpin”).","zh":"（非正式用法）最关键的人或事物；支撑整体的核心（更常用说法是 linchpin）。"},"examples":[{"en":"She’s the main pin of the team—without her, everything falls apart.","zh":"她是团队的主心骨——没有她，一切都会散。"},{"en":"Trust is the main pin in a healthy relationship.","zh":"信任是健康关系中的关键支柱。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) a main pin used in a machine to support or connect moving parts (often written as “main pin” in technical writing).","zh":"（技术）机器中的主销/主轴销，用来支撑或连接运动部件（技术文献中常写作 main pin）。"},"examples":[{"en":"The mechanic checked the main pin for wear before reassembling the part.","zh":"机械师在重新装配前检查了主销是否磨损。"}]}],"synonyms":["linchpin","key support","cornerstone","key factor"],"phonetic":"/meɪn pɪn/","extraExplanation":["“mainpin”连写在现代英语里不太常见；更自然的写法通常是分开写“main pin”。如果你想表达“关键人物/关键环节”，母语者更常用“linchpin”（关键人物/关键点）或“key factor”（关键因素）。","如果你是从机械、汽车或工程语境看到的“mainpin/main pin”，它可能指某种“销（pin）/轴销”，具体含义会随设备结构不同而变化。你可以告诉我句子或领域，我可以帮你更精准地解释。"]}
{"word":"mainport","summary":{"en":"Main port means the most important harbor in a place or, in computing, the primary connection port.","zh":"main port 指某地最重要的港口；在计算机语境中也可指主要端口/接口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the principal or most important seaport/harbor of a country, region, or shipping route","zh":"（国家/地区或航线中）主要港口；最重要的港湾"},"examples":[{"en":"Shanghai is one of China’s main ports for international trade.","zh":"上海是中国重要的国际贸易主要港口之一。"},{"en":"The storm closed the main port, so ships had to wait offshore.","zh":"暴风雨导致主要港口关闭，船只只能在近海等待。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing/networking) the primary connection point (“port”) used by a device, program, or service","zh":"（计算机/网络）主要端口；主连接接口"},"examples":[{"en":"Plug the cable into the main port on the back of the router.","zh":"把网线插到路由器背面的主端口上。"},{"en":"The app listens on the main port, while testing uses a different one.","zh":"这个应用在主端口上监听，而测试使用另一个端口。"}]}],"synonyms":["principal port","primary port","major port","chief port"],"phonetic":"/ˈmeɪn pɔrt/","extraExplanation":["“mainport”更常见的写法是分开写作“main port”。合写“mainport”有时会出现在公司名、产品名或特定技术文档中。","在航运语境里，port 指“港口”；在计算机语境里，port 多指“端口/接口”。可根据上下文判断。"]}
{"word":"mainpost","summary":{"en":"Mainpost usually means the primary post online (the original/most important post). Less commonly, it can mean a main supporting post/pillar in a structure.","zh":"mainpost 通常指网络上的主贴/原帖（最重要的帖子）；较少情况下也可指建筑中的主立柱/主要支撑柱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the primary or most important post (especially online), which other replies or comments relate to","zh":"（尤指在网络上）主要帖、主贴；其他回复或评论围绕它展开"},"examples":[{"en":"Please read the main post before you comment.","zh":"评论前请先读一下主贴。"},{"en":"I updated the main post with the final schedule.","zh":"我在主贴里更新了最终日程。"},{"en":"The main post explains the rules; the comments are just discussion.","zh":"主贴说明规则；评论区只是讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"a main supporting post or pillar in a structure (a central/primary upright post)","zh":"（建筑等中的）主立柱；主要支撑柱"},"examples":[{"en":"The roof load is carried by the main post in the center.","zh":"屋顶的重量由中间的主立柱承担。"},{"en":"They reinforced the main post to stabilize the porch.","zh":"他们加固了主立柱以稳定门廊。"}]}],"synonyms":["main post","original post (OP)","primary post","principal post"],"phonetic":"/ˈmeɪnˌpoʊst/","extraExplanation":["“mainpost”在实际写作中更常见的形式是分开写作“main post”。在论坛/社交平台语境里，它常常指“原帖/首帖”，也常被叫作“OP (original post)”。如果你看到连写“mainpost”，通常是用户名、标签、标题风格或非正式用法。"]}
{"word":"mainprise","summary":{"en":"“Main prize” means the biggest or most important prize in a competition.","zh":"“main prize”指比赛或竞赛中最重要、价值最高的奖项（大奖）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the most important or valuable prize in a contest or competition","zh":"（比赛或竞赛中的）大奖，最高奖"},"examples":[{"en":"She won the main prize in the writing competition.","zh":"她在写作比赛中赢得了大奖。"},{"en":"The main prize is a trip to New York.","zh":"大奖是一趟去纽约的旅行。"},{"en":"Even if you don’t get the main prize, you can still win smaller awards.","zh":"即使你拿不到大奖，也可能赢得一些小奖项。"}]}],"synonyms":["grand prize","top prize","first prize"],"phonetic":"/meɪn praɪz/","extraExplanation":["“mainprise”通常不是标准英文拼写；更常见的写法是分开写成 **main prize**（大奖）。如果你是在某个特定品牌名、用户名或游戏道具中看到“mainprise”，那可能是自创拼写。"]}
{"word":"mainprised","summary":{"en":"“Mainprised” is not standard English; it’s probably a misspelling (e.g., surprised/comprised/prized).","zh":"“mainprised”不是标准英语，很可能是拼写错误（如 surprised / comprised / prized）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of another word (for example, “surprised,” “comprised,” or “prized”).","zh":"不是标准英语单词，可能是其他词的拼写错误（例如 surprised、comprised 或 prized）。"},"examples":[{"en":"I can’t find “mainprised” in a dictionary—did you mean “surprised”?","zh":"我在词典里找不到“mainprised”——你是不是想写“surprised”？"},{"en":"If you meant “comprised,” you could say: “The team is comprised of five people.”","zh":"如果你想写“comprised”，可以说：“The team is comprised of five people.”（这个团队由五个人组成。）"}]}],"extraExplanation":["“mainprised”在常见英语词典中查不到，通常说明它是拼写错误或把两个词连在了一起。","你想表达的意思是哪一种？\n1) “惊讶”：surprised\n2) “由……组成”：comprised (of)\n3) “珍视的/最珍贵的”：prized 或 main prize（主要奖项/一等奖）\n把你的原句发我，我可以帮你确认最合适的词。"]}
{"word":"mainprising","summary":{"en":"“mainprising” is not a standard English word; it most likely means “comprising” (= including; made up of).","zh":"“mainprising”不是标准英语单词；最可能是想写“comprising”（=包括；由……组成）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard) Likely a misspelling of “comprising,” meaning “including; made up of.”","zh":"（非标准用法）很可能是把“comprising”拼错了，意思是“包括；由……组成”。"},"examples":[{"en":"The committee, comprising six teachers and two parents, met on Monday.","zh":"该委员会由六名教师和两名家长组成，于周一开会。"},{"en":"The package includes three items, comprising a book, a pen, and a notebook.","zh":"这个套餐包含三样东西，包括一本书、一支笔和一个笔记本。"}]}],"synonyms":["including","consisting of","made up of","composed of"],"phonetic":"/kəmˈpraɪzɪŋ/","extraExplanation":["“comprising”来自动词“comprise”。在现代英语中更自然的表达通常是：\n- “X consists of A, B, and C.”（X由A、B、C组成）\n- “X is composed of A, B, and C.”（X由A、B、C构成）\n注意：传统语法里常说“comprise”=“包含/由……组成”，所以更推荐“X comprises A, B, and C”（X包括A、B、C），而不是“X is comprised of …”。不过在日常英语里“is comprised of”也很常见。","如果你本来想写的是“main prize”（大奖/头奖）或“main pricing”（主要定价/主价目），告诉我上下文句子，我可以帮你选最合适的词。"]}
{"word":"mainprisor","summary":{"en":"“mainprisor” is not a standard English word; it is likely a misspelling of “main prisoner” (or sometimes “main prison”).","zh":"“mainprisor” 不是标准英文单词；很可能是 “main prisoner”（或有时是 “main prison”）的拼写错误。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Likely intended: “main prisoner”) the most important or most talked-about prisoner in a case (often the key suspect or the person authorities focus on most).","zh":"（可能想写的是 main prisoner）在某个案件中最重要、最受关注的囚犯（常指关键嫌疑人或警方最关注的人）。"},"examples":[{"en":"The news reports focused on the main prisoner in the corruption case.","zh":"新闻报道聚焦于这起贪腐案中的主要囚犯（关键嫌疑人）。"},{"en":"Lawyers argued that the main prisoner should get a fair trial despite public pressure.","zh":"律师认为，尽管有舆论压力，主要囚犯也应得到公正审判。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Possible alternative: “main prison”) the central or primary prison in a region or system.","zh":"（另一种可能：main prison）某个地区或体系中的主要监狱／中心监狱。"},"examples":[{"en":"He was transferred to the main prison in the capital.","zh":"他被转送到首都的主要监狱。"}]}],"synonyms":["key prisoner","primary suspect (context-dependent)","central prison (for “main prison”)"],"phonetic":"/meɪn ˈprɪzənɚ/","extraExplanation":["“mainprisor” 不是标准英文拼写。最接近的常见词是 prisoner（囚犯）或 prison（监狱）。如果你告诉我你想表达的语境（新闻、法律、学校作业等），我可以帮你选最自然的说法，并给出更准确的搭配。"]}
{"word":"mainprize","summary":{"en":"The main prize is the top or most valuable prize in a contest or lottery.","zh":"main prize 指比赛或抽奖中最重要、价值最高的奖（头奖/大奖）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The most important or highest-value prize in a competition, lottery, or contest.","zh":"（比赛、抽奖或竞赛中的）头奖；最高奖；大奖。"},"examples":[{"en":"She won the main prize in the writing contest.","zh":"她在写作比赛中赢得了头奖。"},{"en":"The main prize is a trip to New York, and there are smaller prizes too.","zh":"头奖是一次去纽约的旅行，另外还有一些小奖。"}]}],"synonyms":["grand prize","top prize","first prize","jackpot (lottery)"],"phonetic":"/ˌmeɪn ˈpraɪz/","extraExplanation":["更常见的写法是分开写：main prize。把它写成 mainprize 也能看懂，但在正式英文里不太标准。","main prize 常用于抽奖（raffle/lottery）、竞赛（contest/competition）或节目（game show）语境，对应的还有 second prize（二等奖）、third prize（三等奖）以及 consolation prize（安慰奖）。"]}
{"word":"mainprizer","summary":{"en":"“Main prize” means the biggest or most important prize in an event.","zh":"“main prize”指活动中的最重要、价值最高的奖项（大奖/头奖）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the most important or highest-value prize in a competition, raffle, or award event","zh":"（比赛、抽奖或颁奖活动中的）大奖；头奖；最高奖"},"examples":[{"en":"She won the main prize in the photo contest.","zh":"她赢得了摄影比赛的大奖。"},{"en":"The main prize is a trip to New York.","zh":"头奖是一趟去纽约的旅行。"}]}],"synonyms":["grand prize","top prize","first prize"],"phonetic":"/ˈmeɪn praɪz/","extraExplanation":["“mainprizer”不是常见英语单词，通常应写作 two words：**main prize**（大奖/头奖）。","在英式英语里也常说 **top prize**；抽奖场景中也常见 **grand prize**（特等奖/大奖）。"]}
{"word":"mains","summary":{"en":"“Mains” most often means the main supply pipes/cables for water, gas, or electricity; it can also mean the most important parts of something.","zh":"“mains”最常指供水/供气/供电等的主干管线；也可指某事物的主要部分或要点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The main pipes or cables that supply a service (such as water, gas, or electricity) to a building or area.","zh":"（供水、供气或供电等的）主干管道；总管；（电）电网主线"},"examples":[{"en":"The water was shut off because a pipe burst in the mains.","zh":"因为主水管爆裂，供水被关闭了。"},{"en":"Make sure the appliance is unplugged from the mains before cleaning it.","zh":"清洁前务必把电器从电源插座上拔掉。"},{"en":"The whole neighborhood lost power when the mains were damaged.","zh":"电网主线受损后，整个社区都停电了。"}]},{"partOfSpeech":"n.","definition":{"en":"The most important parts or aspects of something; the essentials.","zh":"（某事物的）主要部分；要点；核心"},"examples":[{"en":"I didn’t catch every detail, but I understood the mains of his argument.","zh":"我没听清每个细节，但我理解了他论点的要点。"},{"en":"Let’s focus on the mains and leave the minor issues for later.","zh":"我们先抓住重点，小问题以后再说。"}]}],"synonyms":["utilities","main supply lines","primary lines","essentials","main points"],"phonetic":"/meɪnz/","extraExplanation":["在英式英语里，the mains 常指“市电/家用交流电”（相当于美式英语的 the power/electricity）。比如：off the mains 表示“断开市电供电”。"]}
{"word":"mainsail","summary":{"en":"The mainsail is the main, largest sail on a sailboat’s main mast.","zh":"mainsail 指帆船主桅上的主帆（通常最大、最主要的那面帆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The largest main sail on a sailboat, attached to the main mast and used as the primary source of power.","zh":"（帆船的）主帆：连接在主桅上的最大帆，通常是主要动力来源。"},"examples":[{"en":"The crew raised the mainsail as the wind picked up.","zh":"风变大时，船员升起了主帆。"},{"en":"With the mainsail trimmed correctly, the boat moved faster and steadier.","zh":"把主帆调校正确后，船跑得更快也更稳。"}]}],"synonyms":["main sail"],"phonetic":"/ˈmeɪn.seɪl/","extraExplanation":["在帆船术语里，main- 表示“主要的”，sail 是“帆”。mainsail 常见于航海、帆船比赛与海洋文学中（例如描写远航、探险时会提到“升主帆/收主帆”来表现启航或天气变化）。常见搭配：raise/hoist the mainsail（升主帆）、reef the mainsail（把主帆打缩帆/减帆面积）、trim the mainsail（调整主帆角度与绳索，让受风更合适）。"]}
{"word":"mainsails","summary":{"en":"Mainsails are the principal sails on a ship’s mainmast.","zh":"mainsails 指帆船主桅上的主要帆（主帆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the large principal sail on a sailing ship’s mainmast (plural: mainsails)","zh":"（帆船）主帆；主桅上的主要大帆（复数：mainsails）"},"examples":[{"en":"The crew raised the mainsails as the wind strengthened.","zh":"风势增强时，船员升起了主帆。"},{"en":"With the mainsails down, the boat moved slowly under a smaller sail.","zh":"主帆放下后，船只在较小的帆的带动下缓慢前进。"}]}],"synonyms":["main sails","principal sails"],"phonetic":"/ˈmeɪnˌseɪl/","extraExplanation":["“mainsail”是航海用语：main- 表示“主要的”，sail 表示“帆”。在传统帆船上，主帆通常是最关键、面积较大的帆之一，用来提供主要动力。现代语境中也常见于海洋文学或航海题材作品（如描写航行、暴风雨、船员操作等场景）。"]}
{"word":"mainsheet","summary":{"en":"Mainsheet means the line (rope) used to control the mainsail on a sailboat.","zh":"mainsheet 指帆船上用来控制主帆的缭绳/索具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rope (line) used to control the mainsail on a sailboat by pulling it in or letting it out","zh":"（帆船上）主帆缭绳；用于收紧或放松主帆、控制主帆角度的绳索"},"examples":[{"en":"Pull in the mainsheet to bring the boom closer to the centerline.","zh":"收紧主帆缭绳，把横桁（boom）拉向船的中线。"},{"en":"Let the mainsheet out a little when the wind gets stronger.","zh":"风变强时，把主帆缭绳稍微放一点。"},{"en":"The sailor adjusted the mainsheet to keep the boat balanced.","zh":"水手调整主帆缭绳来保持船体平衡。"}]}],"synonyms":["main sheet","mainsail sheet","sheet (sailing)"],"phonetic":"/ˈmeɪnˌʃit/","extraExplanation":["在帆船术语里，sheet 不是“床单”，而是指“用来调帆角度的绳索/索具”。mainsheet 专指控制主帆（mainsail）的那一根。","mainsheet 的主要作用是控制横桁（boom）的位置，从而改变主帆对风的角度；它常与 traveler（滑轨/滑车系统）一起使用来精细调节。"]}
{"word":"mainshock","summary":{"en":"A mainshock is the largest earthquake in a sequence; it can also mean the main impact in a series of events.","zh":"mainshock 指一组地震中的“主震”；也可引申为一连串事件中最主要的一次冲击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the largest or strongest earthquake in a sequence, often following smaller foreshocks and followed by aftershocks","zh":"（一系列地震中）主震；通常在前震之后发生，并伴随余震"},"examples":[{"en":"After several small tremors, the mainshock hit just after midnight.","zh":"在几次小震之后，主震在午夜过后发生。"},{"en":"Engineers inspected bridges after the mainshock to check for structural damage.","zh":"主震之后，工程师检查桥梁以确认是否有结构损坏。"}]},{"partOfSpeech":"n.","definition":{"en":"the primary, most significant event in a series of shocks or impacts (used more generally, often in news or figurative writing)","zh":"（引申）一连串冲击/事件中的主要、最关键的一次（常见于新闻或比喻用法）"},"examples":[{"en":"The scandal was the mainshock, and the resignations were the aftershocks.","zh":"丑闻是“主震”，而接连的辞职则像“余震”。"}]}],"synonyms":["principal earthquake","major quake","primary shock"],"phonetic":"/ˈmeɪnˌʃɑk/","extraExplanation":["在地震学里，“主震”是相对概念：同一震群中规模最大的那次叫 mainshock，而较小的可能被称为 foreshock（前震）或 aftershock（余震）。有时只有事后回顾整个序列，才更清楚哪一次是主震。","mainshock 常见于新闻报道与科普写作；日常口语里也常直接说 the earthquake 或 the big quake。"]}
{"word":"mainspring","summary":{"en":"Mainspring means the main coiled spring that powers a watch/clock, and by extension the main driving force behind something.","zh":"mainspring 指钟表等的主发条；也可引申为推动某事的核心动力或主要动机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coiled spring that stores energy and powers a mechanical device, especially a wind-up watch or clock.","zh":"（钟表等机械装置中的）主发条；储存能量并驱动机械运转的卷簧。"},"examples":[{"en":"The watch stopped because its mainspring broke.","zh":"这只表停了，因为主发条断了。"},{"en":"After winding the clock, the mainspring slowly releases energy to keep it running.","zh":"给钟上紧发条后，主发条会慢慢释放能量让它继续走。"}]},{"partOfSpeech":"n.","definition":{"en":"The main driving force or motive behind something (a person, plan, or system).","zh":"（比喻）原动力；主要动机；推动某事运转的核心力量。"},"examples":[{"en":"Curiosity was the mainspring of her research.","zh":"好奇心是她研究的原动力。"},{"en":"Trust is the mainspring of a healthy relationship.","zh":"信任是健康关系的核心动力。"}]}],"synonyms":["driving force","motive","impetus","engine","primary cause"],"phonetic":"/ˈmeɪnˌsprɪŋ/","extraExplanation":["比喻义很常见：把“主发条”当作“让一切动起来的关键力量”。在写作中常用于解释某人的行为动机或一个系统的运作逻辑。","词源上由 main（主要的）+ spring（弹簧）组成。常见搭配：the mainspring of + 名词（the mainspring of success/innovation）。"]}
{"word":"mainsprings","summary":{"en":"Mainsprings means the main driving forces behind something, or (literally) the main springs that power a watch or machine.","zh":"mainsprings 指某事背后的主要动力/原因，也可指（字面义）钟表或机械中提供动力的主发条/主弹簧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the main cause or driving force behind something (often a person’s actions or an organization’s success)","zh":"（某事的）主要原因；（某人行为或组织成功的）主要动力"},"examples":[{"en":"Curiosity was the mainspring of her research.","zh":"好奇心是她研究的主要动力。"},{"en":"Trust is one of the mainsprings of a healthy relationship.","zh":"信任是健康关系的主要动力之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a tightly coiled spring in a watch, clock, or other machine that provides power","zh":"（钟表等机械中的）主发条；主弹簧（提供动力的紧密卷簧）"},"examples":[{"en":"The watch stopped because the mainspring had broken.","zh":"手表停了，因为主发条断了。"},{"en":"A skilled repairer replaced the mainspring in the old clock.","zh":"熟练的修理师更换了老钟的主发条。"}]}],"synonyms":["driving forces","motivations","key factors","impulses","engines"],"phonetic":"/ˈmeɪnˌsprɪŋz/","extraExplanation":["“mainspring”原本是钟表等机械里提供主要动力的“主发条”。因此它很自然地被借用为比喻义：某件事背后最关键、最能推动发展的力量或原因。","你输入的“mainsprings”是复数形式，常见于讨论“多种动力/多重动机”的语境：the mainsprings of change（变革的主要动力）。"]}
{"word":"mainstay","summary":{"en":"Mainstay most commonly means a reliable pillar or chief support that people depend on.","zh":"Mainstay 最常指“支柱/主要依靠”，即人们长期依赖的可靠支持来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, thing, or activity that provides strong, reliable support and is depended on most of the time.","zh":"支柱；中流砥柱；（人、事物或活动）最可靠、最常依赖的支持来源。"},"examples":[{"en":"Rice is the mainstay of the local diet.","zh":"米饭是当地饮食的主食／主要依靠。"},{"en":"Her grandmother was the mainstay of the family during hard times.","zh":"在艰难时期，她的祖母是这个家庭的支柱。"},{"en":"Tourism is a mainstay of the island’s economy.","zh":"旅游业是这个岛屿经济的支柱产业。"}]},{"partOfSpeech":"v.","definition":{"en":"To support or keep something steady; to make something stronger or more secure.","zh":"支撑；稳固；加强（使更牢靠或更稳定）。"},"examples":[{"en":"They introduced new rules to mainstay the company’s finances.","zh":"他们推出新规来稳固公司的财务状况。"},{"en":"Extra funding can mainstay public schools during budget cuts.","zh":"在削减预算时，额外资金可以支撑公立学校。"}]}],"synonyms":["pillar","backbone","foundation","support","staple"],"phonetic":"/ˈmeɪnˌsteɪ/","extraExplanation":["“mainstay”最常用作名词，表示“最重要的支撑/依靠”。动词用法较少见，正式或文学语境里可能出现。","词源上与航海有关：stay 指支撑桅杆的“支索/拉索”，mainstay 原指“主支索”，后来引申为“主要支柱”。","常见搭配：a mainstay of…（……的支柱）；the mainstay of the economy/industry/family（经济/行业/家庭的支柱）。"]}
{"word":"mainstays","summary":{"en":"“Mainstays” is the plural of “mainstay,” meaning key supports or essential people/things you depend on.","zh":"mainstays 是 mainstay 的复数，指“支柱/主要依靠”，即你所依赖的关键人物或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that are strongly relied on; a main support or essential part of something.","zh":"支柱；中流砥柱；赖以维持的主要力量/事物。"},"examples":[{"en":"Teachers are a mainstay of every community.","zh":"教师是每个社区的支柱。"},{"en":"Rice and noodles are mainstays of many Asian diets.","zh":"米饭和面条是许多亚洲饮食的主食/主要组成。"},{"en":"For years, her sister was her mainstay during difficult times.","zh":"多年来，在艰难时期她的姐姐一直是她的依靠/支柱。"}]}],"synonyms":["pillars","backbones","supports","staples"],"phonetic":"/ˈmeɪnˌsteɪz/","extraExplanation":["“Mainstay”原本是航海用语：stay 指支撑船桅的缆索，mainstay 就是“主支索”，引申为“最重要的支撑/依靠”。","形式上 mainstay 的复数是 mainstays。常见搭配：a mainstay of…（……的支柱/主力），the mainstays of the economy（经济的支柱产业/力量）。"]}
{"word":"mainstream","summary":{"en":"Mainstream means the dominant, widely accepted culture or ideas, and something mainstream is popular or considered standard by most people.","zh":"Mainstream 指社会中占主导、被大众普遍接受的文化或观念；mainstream 的事物就是大多数人喜欢或认为标准的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ideas, styles, or activities that are accepted and liked by most people; the dominant or most popular culture.","zh":"主流；大众普遍接受和喜爱的观念、风格或活动；占主导地位的文化/潮流。"},"examples":[{"en":"Jazz was once considered strange, but it later entered the mainstream.","zh":"爵士乐曾被认为很怪，但后来进入了主流。"},{"en":"Her research moved from the mainstream of economics to a more experimental approach.","zh":"她的研究从经济学主流转向更具实验性的方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"Accepted as normal or standard by most people; widely popular.","zh":"主流的；被大多数人视为正常/标准的；广受欢迎的。"},"examples":[{"en":"The movie became a mainstream hit within a week.","zh":"这部电影一周内就成了主流爆款。"},{"en":"He prefers mainstream news sources over small blogs.","zh":"比起小博客，他更偏好主流新闻来源。"}]},{"partOfSpeech":"vt.","definition":{"en":"To bring something into common acceptance; to make it part of the mainstream.","zh":"使主流化；使被普遍接受；把某事纳入主流。"},"examples":[{"en":"Online learning has been mainstreamed in many universities.","zh":"在线学习在许多大学已被主流化。"}]}],"synonyms":["dominant","popular","conventional","standard","common","accepted"],"phonetic":"/ˈmeɪnˌstriːm/","extraExplanation":["“Mainstream”字面意思是“主水流/主河道”，引申为“社会中的主流力量或主导趋势”。在媒体语境里，mainstream media 指“大型、传统、覆盖面广的媒体”，但它不一定等于“正确”，有时也带有“较保守/较符合大众口味”的暗示。","常见搭配：enter the mainstream（进入主流）、mainstream culture（主流文化）、mainstream society（主流社会）、mainstream opinion（主流观点）、mainstream acceptance（主流认可）、mainstreaming（主流化）。"]}
{"word":"mainstreamed","summary":{"en":"Made widely accepted or placed into regular classes (education).","zh":"使成为主流；（教育）安排进入普通班级。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle) Brought into the mainstream; made widely accepted, common, or available to the general public.","zh":"（过去式/过去分词）使进入主流；让大众普遍接受、常见或广泛可得。"},"examples":[{"en":"Online payments were quickly mainstreamed after more stores began offering them.","zh":"越来越多商店提供线上支付后，线上支付很快就主流化了。"},{"en":"Streetwear was mainstreamed by major brands and pop stars.","zh":"街头潮流被大品牌和流行明星带进了主流。"}]},{"partOfSpeech":"vt.","definition":{"en":"(education) Placed a student—especially one with disabilities or special needs—into regular classes rather than separate programs.","zh":"（教育）将学生（尤其是有障碍或特殊需求的学生）安排进入普通班级，而不是分离式课程。"},"examples":[{"en":"He was mainstreamed in middle school with support from a classroom aide.","zh":"他在初中被安排进入普通班级学习，并有课堂助理提供支持。"},{"en":"The district mainstreamed more students by expanding inclusive teaching resources.","zh":"该学区通过增加融合教育资源，让更多学生进入普通班级。"}]}],"synonyms":["popularized","normalized","institutionalized","assimilated","integrated","included"],"phonetic":"/ˈmeɪnˌstriːmd/","extraExplanation":["在教育领域，mainstreamed 常与 inclusive education（融合教育）相关。含义通常偏中性，但是否“合适”取决于支持资源是否到位（如助教、个别化支持等）。有些场合也会用 integrated 或 included 来表达更强调“被接纳与参与”的意味。"],"etymology":"来自 main（主要的、主流的）+ stream（流、潮流）。原义是“主流”，20世纪逐渐发展出动词 mainstream，表示“使成为主流/让大众接受”；在教育语境中又引申为“将特殊教育学生融入普通班级”。","mnemonic":["把 main 当“主”，stream 当“流”：mainstream = 主流；mainstreamed = 被“推进主流里”。","联想“上主干道”：从“特殊/小路”并入“主流道路（普通班/大众市场）”。"]}
{"word":"mainstreamer","summary":{"en":"a person who follows widely popular tastes or ideas","zh":"跟随或偏好大众主流品味/观念的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who prefers, supports, or follows mainstream (widely accepted) ideas, tastes, or culture.","zh":"主流派的人；偏好、支持或跟随大众/主流观念、品味或文化的人。"},"examples":[{"en":"He’s a mainstreamer who usually watches big Hollywood movies instead of indie films.","zh":"他比较主流，通常看好莱坞大片，而不是独立电影。"},{"en":"Some fans call her a “mainstreamer” because she likes whatever is popular on social media.","zh":"有些粉丝叫她“主流派”，因为她喜欢社交媒体上流行的一切。"}]}],"synonyms":["conformist","follower","traditionalist","trend-follower","popularizer"],"phonetic":"/ˈmeɪnstriːmər/","extraExplanation":["语气提示：mainstreamer 往往带一点评价色彩，可能是中性（只是说明偏好主流），也可能略带贬义（暗示“随大流”“不够独特”）。更常见的说法是 mainstream person / mainstream audience。"],"etymology":"由 mainstream（主流、大众）+ -er（表示“……的人”）构成，意思是“属于/支持主流的人”。属于较新的口语化构词，用于评价一个人的品味或立场。","mnemonic":["拆词记：main（主要的）+ stream（潮流、流向）+ -er（人）→ “跟着主要潮流走的人”。","联想：把 stream 想成“潮流的河流”，mainstreamer 就是“在主河道里顺流的人”。"]}
{"word":"mainstreaming","summary":{"en":"the process of integrating into ordinary settings or becoming widely accepted","zh":"融入普通体系或使之被广泛接受的过程"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of integrating people (especially students with disabilities or special needs) into ordinary schools, classes, or social settings rather than separating them","zh":"（尤指教育领域）把残障或有特殊需求的人融入普通学校、普通班级或一般社会环境的做法，而不是隔离安置"},"examples":[{"en":"The school supports mainstreaming by providing classroom aides and adapted materials.","zh":"学校通过配备课堂助理和调整教材来支持融合教育。"},{"en":"Mainstreaming can help students build friendships with peers in the same neighborhood school.","zh":"融合教育能帮助学生在社区学校里和同龄人建立友谊。"},{"en":"Parents asked for mainstreaming when their child was ready for a regular classroom.","zh":"当孩子准备好进入普通课堂时，家长提出希望实施融合教育。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making something widely accepted or treated as normal in society or culture","zh":"使某事物被社会广泛接受、变得“常态化/主流化”的过程"},"examples":[{"en":"The mainstreaming of remote work changed how many companies hire and manage teams.","zh":"远程办公的主流化改变了许多公司招聘与管理团队的方式。"},{"en":"Streaming accelerated the mainstreaming of international TV shows.","zh":"流媒体加速了海外电视剧的主流化。"}]}],"synonyms":["inclusion","integration","assimilation","normalization","standardization"],"phonetic":"/ˈmeɪnˌstriːmɪŋ/","extraExplanation":["教育语境里，mainstreaming 常与 inclusion（全纳教育）一起出现。日常使用中有时把两者混用，但 inclusion 更强调“系统性支持与无障碍”，不仅仅是“把人放进普通班”。在写作或正式场合，建议根据学校/政策用词选择更准确的词。"],"etymology":"由 main + stream（“主流”）组合而来；mainstream 表示“主流、主流文化”，加 -ing 形成名词，表示“进入主流/使其成为主流的过程”。在教育语境中常特指把特殊教育学生纳入普通班级的做法。","mnemonic":["拆开记：main（主要的）+ stream（河流/流）→ 进入“主流的河道”= 被纳入主流环境。","联想：把人或事“带进主流频道”= mainstreaming（主流化/融入普通体系）。"]}
{"word":"mainstreams","summary":{"en":"“Mainstreams” most often means several dominant, widely accepted trends or groups; it can also be a verb meaning “makes something mainstream.”","zh":"“Mainstreams”通常指多个占主导、被广泛接受的潮流或圈层；也可作动词，意为“使……进入主流”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the dominant or most widely accepted ideas, styles, or ways of doing things in society (plural of “mainstream”)","zh":"（“mainstream”的复数）社会中占主导或最被广泛接受的思想、风格或做事方式"},"examples":[{"en":"In many countries, there are several cultural mainstreams rather than just one.","zh":"在许多国家，文化主流不止一种，而是有好几种。"},{"en":"These music scenes developed outside the mainstreams of pop radio.","zh":"这些音乐圈子是在流行电台的主流之外发展起来的。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “mainstream”) to make something part of the dominant system or widely accepted culture","zh":"（“mainstream”的第三人称单数）使……进入主流体系；使……被大众广泛接受"},"examples":[{"en":"The company mainstreams new features only after careful testing.","zh":"公司只有在仔细测试后才会把新功能推向主流产品。"},{"en":"Some critics worry the platform mainstreams extreme opinions.","zh":"一些评论者担心这个平台会让极端观点进入主流。"}]}],"synonyms":["dominant trends","the majority","establishments","prevailing currents","orthodoxies"],"phonetic":"/ˈmeɪnstriːmz/","extraExplanation":["“mainstream(s)”常用于媒体、文化与社会议题：比如“the mainstream media（主流媒体）”“mainstream society（主流社会）”。“mainstreams（复数）”强调存在多个主流圈层或主导力量，例如不同国家、阶层或社群各自有“主流”。","作为动词“to mainstream”，多见于新闻与学术写作，表示把原本边缘的事物（理念、群体、技术、艺术风格）纳入制度或大众文化中。"]}
{"word":"mainstreeter","summary":{"en":"A “mainstreeter” is someone associated with mainstream, everyday community values or local small-business life—often contrasted with Wall Street elites.","zh":"“mainstreeter”指与主流、日常社区价值观或本地小商业生活相关的人，常与“华尔街精英”形成对比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who represents or supports mainstream, traditional values and everyday community life (often linked with small-town or middle-class America).","zh":"主流派人士；代表或支持传统、普遍价值观与日常社区生活的人（常与美国小镇/中产阶级形象相关）。"},"examples":[{"en":"In the campaign ad, she tried to sound like a mainstreeter who understands the cost of groceries.","zh":"在竞选广告里，她努力表现得像一个懂得食品杂货价格压力的“主流民众代表”。"},{"en":"The article said the new policy might help mainstreeters more than big investors.","zh":"文章说这项新政策可能更能帮助普通民众，而不是大投资者。"}]},{"partOfSpeech":"n.","definition":{"en":"a business person or customer connected to local, non-elite commerce (the kind of shopping and services found on “Main Street,” not Wall Street).","zh":"与本地商业相关的人（如小商家或顾客）；“大街商业”圈子的人（相对“华尔街”式金融精英）。"},"examples":[{"en":"The bank positioned itself as a lender for mainstreeters and small businesses.","zh":"这家银行把自己定位为服务普通民众和小企业的贷款机构。"},{"en":"Mainstreeters worried that rising rents would push local stores out of town.","zh":"本地商家担心房租上涨会把当地店铺挤出城镇。"}]}],"synonyms":["ordinary person","average voter","middle-class American","local business owner","Main Street voter"],"phonetic":"/ˈmeɪnˌstriːtər/","extraExplanation":["“Mainstreeter”来自“Main Street（主街）”。在美国文化里，Main Street常被当作隐喻：代表普通人的日常生活、社区、传统价值与本地小商业；常与“Wall Street（华尔街）”对比，后者象征金融资本与精英圈层。","这个词在新闻与政治语境中常带一点立场色彩：用来强调“贴近普通民众/中间立场/传统而务实”。语气可褒可贬，取决于说话者态度与上下文。","文学上，“Main Street”也让人联想到辛克莱·刘易斯（Sinclair Lewis）1920年的小说《Main Street》，描写美国小镇生活与社会心态；因此相关词有时会带一点“典型小镇美国”的文化意味。"]}
{"word":"mainstreetism","summary":{"en":"Mainstreetism means a conventional “small-town Main Street” mindset, or a political/media appeal to ordinary people contrasted with elites.","zh":"mainstreetism 指“主街式”的小城保守心态；也可指政治／媒体上诉诸“普通民众”以对比精英的表达方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A way of thinking typical of small-town “Main Street” life, often meaning conventional, narrow, or resistant to change.","zh":"“主街式”思维／主街主义：典型小城“主街”生活的思维方式，常指保守、传统、眼界较窄或抗拒变化。"},"examples":[{"en":"The novel criticizes the mainstreetism of a town that judges anyone different.","zh":"这部小说批评小镇的“主街主义”——它会评判任何与众不同的人。"},{"en":"Her mainstreetism showed in the way she dismissed new ideas as ‘too weird.’","zh":"她把新点子一概说成“太怪了”，这体现了她的主街式保守心态。"}]},{"partOfSpeech":"n.","definition":{"en":"(Politics/media) A rhetorical appeal to “ordinary Main Street people,” contrasted with big-city elites or Wall Street; sometimes used neutrally, sometimes critically.","zh":"（政治／媒体）诉诸“普通主街民众”的说法，用来对比大城市精英或华尔街；可中性也可带批评意味。"},"examples":[{"en":"The candidate framed his plan as a win for Main Street, not Wall Street—classic mainstreetism.","zh":"这位候选人把计划说成是为主街而非华尔街服务——这就是典型的主街主义话术。"},{"en":"Some commentators see this kind of mainstreetism as oversimplifying complex economic issues.","zh":"一些评论者认为这种主街主义会把复杂的经济问题过度简化。"}]}],"synonyms":["small-town mentality","provincialism","parochialism","conventionalism","populist rhetoric"],"phonetic":"/ˈmeɪnˌstriːtɪzəm/","extraExplanation":["“Main Street（主街）”在美国文化里常象征小城镇的日常生活与传统价值观。mainstreetism 常带有批判色彩，暗示眼界受限、对新思想或不同生活方式不够包容。","这个词与美国作家 Sinclair Lewis 的小说《Main Street》（1920）关系密切；作品讽刺小城社会的保守与从众，因此 mainstreetism 常用于文学评论或文化批评。"]}
{"word":"mainswear","summary":{"en":"Menswear means men’s clothing, or relating to men’s clothing.","zh":"Menswear 指“男装”，也可作形容词表示“与男装有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “menswear”) clothing made for men, or the business/industry of men’s clothing.","zh":"（通常写作“menswear”）男装；男装行业。"},"examples":[{"en":"This store sells both womenswear and menswear.","zh":"这家店既卖女装也卖男装。"},{"en":"He works in menswear design.","zh":"他从事男装设计工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to men’s clothing or a men’s clothing department.","zh":"与男装有关的；男装（部门）的。"},"examples":[{"en":"I found it in the menswear section.","zh":"我是在男装区找到它的。"},{"en":"Menswear brands often focus on classic basics like shirts and jackets.","zh":"男装品牌通常会强调衬衫、夹克等经典基础款。"}]}],"synonyms":["men's clothing","men's wear"],"phonetic":"/ˈmɛnzˌwɛr/","extraExplanation":["“mainswear”并不是常见的标准拼写，最可能是把“menswear”（男装）拼错了。写作时一般用 menswear（英式/美式都常见）。","常见搭配：menswear department（男装部/男装区）、menswear brand（男装品牌）、menswear designer（男装设计师）。"]}
{"word":"mainsworn","summary":{"en":"Mainsworn is a rare, literary word meaning “oath-bound; sworn to serve,” and sometimes refers to the person who has sworn the oath.","zh":"mainsworn 是罕见的文学用词，意为“受誓言约束、宣誓效忠”，有时也指“立誓效忠者本人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Bound by a solemn oath; sworn to serve or support someone or something.","zh":"（罕见/文学用语）受庄严誓言约束的；宣誓效忠或承诺支持（某人/某事）的。"},"examples":[{"en":"The mainsworn guard refused the bribe and kept his vow.","zh":"那位宣誓效忠的守卫拒绝了贿赂，并坚守誓言。"},{"en":"They were mainsworn to the king, even in exile.","zh":"即使流亡在外，他们仍宣誓效忠国王。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A person who is bound by such an oath; an oath-bound follower or servant.","zh":"（罕见）立誓效忠的人；宣誓追随者/仆从。"},"examples":[{"en":"Only the mainsworn were allowed into the council chamber.","zh":"只有立誓效忠者才被允许进入议事厅。"}]}],"synonyms":["sworn","oath-bound","vowed","pledged","sworn to"],"phonetic":"/ˈmeɪnˌswɔrn/","extraExplanation":["“mainsworn”不是现代日常英语常用词，更常见的表达是 sworn、oath-bound、sworn to (someone/something)。","其中 main 在古英语/诗歌语境里可指“力量、主力”或（更古风地）“手/臂的力量”，因此 mainsworn 带有一种“以主力/以手起誓、誓约在身”的古风色彩，常见于奇幻、历史小说或仿古文体。","如果你是在某本小说/游戏里看到该词，语义通常就是“誓约效忠、誓言绑定”，具体效忠对象要看上下文。"]}
{"word":"maint","summary":{"en":"“maint” is an abbreviation, usually meaning “maintenance,” and sometimes “maintain” in technical contexts.","zh":"“maint”是缩写，通常指“maintenance（维护）”，在技术语境中有时也指“maintain（维护/保持）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) short for “maintenance”; also sometimes short for “maintain,” especially in technical notes or filenames.","zh":"（缩写）“maintenance（维护/保养）”的简写；在技术笔记或文件名中也可能表示“maintain（维护/保持）”。"},"examples":[{"en":"Please submit a maint request if the air conditioner stops working.","zh":"如果空调不工作了，请提交维护（maint）申请。"},{"en":"The maint team will inspect the elevators this weekend.","zh":"维护（maint）团队会在本周末检查电梯。"},{"en":"In the codebase, the folder named “maint” contains maintenance scripts.","zh":"在代码库里，名为“maint”的文件夹放的是维护脚本。"}]}],"synonyms":["maintenance (full form)","maintain (full form)"],"phonetic":"/meɪnt/","extraExplanation":["“maint”不是常见的日常口语单词，更常出现在工单系统（maintenance request）、工程/IT文档、表格栏位、文件夹名或变量名中。正式写作里通常不要用它，而应写全“maintenance / maintain”。","如果你是在某个具体场景（例如报错信息、课程笔记、文件名）里看到“maint”，把原句发我，我可以帮你判断它具体指“maintenance”还是“maintain”。"]}
{"word":"maintain","summary":{"en":"Maintain means to keep something in good condition, to keep something at the same level, or to insist that something is true.","zh":"Maintain 表示“维护/保养”“保持/维持（水平或状态）”，也可表示“坚持认为/坚称”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to keep something in good condition or working properly by checking, repairing, or caring for it regularly","zh":"（通过定期检查、维修或保养）维持某物良好状态或正常运作"},"examples":[{"en":"It’s important to maintain your car with regular oil changes.","zh":"定期换机油对保养汽车很重要。"},{"en":"The building is old, but it’s well maintained.","zh":"这栋楼很旧，但维护得很好。"}]},{"partOfSpeech":"vt.","definition":{"en":"to continue to have or keep something at the same level, standard, or condition","zh":"保持（某种水平、标准或状态）不变；维持"},"examples":[{"en":"She exercises every day to maintain her health.","zh":"她每天锻炼来保持健康。"},{"en":"The company maintained high quality despite rising costs.","zh":"尽管成本上升，公司仍保持高质量标准。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep saying that something is true; to claim firmly","zh":"坚持认为；坚称（某事为真）"},"examples":[{"en":"He maintained that he was innocent.","zh":"他坚称自己是无辜的。"},{"en":"They maintain that the plan will save money in the long run.","zh":"他们坚持认为从长远看这项计划能省钱。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep something going; to support or provide what is needed (often used in formal writing)","zh":"使持续进行；供养/维持所需（较正式用法）"},"examples":[{"en":"The farm can maintain a family of five.","zh":"这座农场能够养活五口之家。"}]}],"synonyms":["keep","preserve","sustain","uphold","retain"],"phonetic":"/meɪnˈteɪn/","extraExplanation":["“Maintain”常见两大核心用法：一是“维护/保养”（maintain a machine/building），强调通过照顾让它继续好用；二是“保持”（maintain health/standards），强调状态不下降。","法律或正式语境里，maintain 还常表示“坚持主张/提出主张”，如 maintain that…（坚称……），语气比 say/think 更坚定。"]}
{"word":"maintainabilities","summary":{"en":"“Maintainabilities” means the (often multiple) degrees of ease of maintaining systems or designs; it’s the plural of “maintainability.”","zh":"“Maintainabilities”表示（多个系统/方案的）易维护程度，是“maintainability（可维护性）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to maintain (repair, update, or keep working well), especially in engineering and software; plural form of “maintainability.”","zh":"（尤指工程与软件领域）易维护性；可维护性；为“maintainability”的复数形式。"},"examples":[{"en":"Good documentation improves the maintainability of the system.","zh":"良好的文档会提高系统的可维护性。"},{"en":"They compared the maintainabilities of several designs before choosing one.","zh":"他们在选择之前比较了几种设计的可维护性。"}]}],"synonyms":["ease of maintenance","serviceability","upkeep quality","maintainability (singular)"],"phonetic":"/meɪnˌteɪnəˈbɪləti/","extraExplanation":["“Maintainabilities”在日常英语中不常见，更常用单数“maintainability”作为不可数概念来谈（如：the maintainability of the code）。当你要强调“多个系统/多个方案各自的可维护性”时，才更可能用复数。","在软件语境里，maintainability通常指代码是否容易读懂、修改、扩展、测试与修复（例如结构清晰、重复少、命名一致、有测试与文档等）。"]}
{"word":"maintainability","summary":{"en":"Maintainability means how easy something is to maintain or update, especially in engineering and software.","zh":"Maintainability 指某物（尤指工程或软件）有多容易被维护、更新或修理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being easy to maintain, repair, or update, especially for a system, machine, or software code.","zh":"（尤指系统、机器或软件代码的）可维护性；易于维护、修理或更新的程度。"},"examples":[{"en":"Good documentation improves the maintainability of the project.","zh":"好的文档能提高项目的可维护性。"},{"en":"We refactored the code to increase maintainability and reduce bugs.","zh":"我们重构了代码，以提高可维护性并减少漏洞。"},{"en":"Design choices today affect long-term maintainability.","zh":"今天的设计选择会影响长期的可维护性。"}]}],"synonyms":["serviceability","upkeep","ease of maintenance"],"phonetic":"/meɪnˌteɪnəˈbɪləti/","extraExplanation":["在软件工程语境里，maintainability 常与 reliability（可靠性）、scalability（可扩展性）、readability（可读性）一起讨论。提高可维护性的方法包括：命名清晰、模块化设计、减少重复（DRY）、写自动化测试、持续重构（refactoring）、完善注释与文档等。","常见搭配：high/low maintainability（高/低可维护性）、maintainability of code/system（代码/系统的可维护性）、improve/increase maintainability（提升可维护性）。"]}
{"word":"maintainable","summary":{"en":"“Maintainable” means easy to maintain—easy to keep working well, repair, or update over time.","zh":"“Maintainable”表示“易维护的”：长期来看容易保持良好运行、维修或更新。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be kept in good condition, repaired, or updated easily over time (especially for systems, code, equipment, or plans).","zh":"可维护的；容易长期保持良好状态、维修或更新的（常用于系统、代码、设备或方案）。"},"examples":[{"en":"We rewrote the app to make the code more maintainable.","zh":"我们重写了这个应用，让代码更易维护。"},{"en":"Choose a maintainable schedule that you can follow for months, not just a week.","zh":"选择一个可长期坚持、便于维护的日程安排，而不是只能坚持一周的。"},{"en":"The design is simple and maintainable, so new team members can learn it quickly.","zh":"这个设计简单且易维护，所以新成员能很快上手。"}]}],"synonyms":["easy to maintain","serviceable","manageable","supportable"],"phonetic":"/meɪnˈteɪnəbəl/","extraExplanation":["这个词在职场和技术语境里非常常见：强调“长期成本低、好改、好修、好理解”。在软件工程中常和 readability（可读性）、modular（模块化）、well-documented（文档齐全）等一起出现。","词形来源：maintain（维护）+ -able（“能够……的”）。注意它通常不是指“可以维持下去”(sustainable) 的环境含义，而是偏“维护/修改是否省力”。"]}
{"word":"maintainableness","summary":{"en":"Maintainableness means the quality of being easy to maintain or keep in good condition (often said as maintainability).","zh":"maintainableness 指“易维护性/可维护性”，即容易维护或保持良好状态的特性（更常用 maintainability）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to maintain, repair, or keep in good condition; maintainability","zh":"易维护性；可维护性：指某物容易保养、维修或保持良好状态的特性（常用词为 maintainability）"},"examples":[{"en":"In software projects, maintainableness matters because code changes over time.","zh":"在软件项目中，可维护性很重要，因为代码会随着时间不断变化。"},{"en":"They redesigned the machine for better maintainableness, so parts can be replaced quickly.","zh":"他们重新设计了这台机器以提高易维护性，这样零件可以更快更换。"}]}],"synonyms":["maintainability","serviceability","ease of maintenance"],"phonetic":"/meɪnˈteɪnəbəlnəs/","extraExplanation":["“maintainableness”比较少见，尤其在正式写作或技术文档里，通常更常用“maintainability”。但两者表达的核心意思接近：某物是否容易维护、修改、修理与长期管理。","构词思路：maintain（维护）+ -able（能……的）→ maintainable（可维护的）+ -ness（……性）→ maintainableness（可维护性）。"]}
{"word":"maintainance","summary":{"en":"Maintenance means keeping something in good condition; it can also mean financial support, especially by law.","zh":"Maintenance 指“维护保养、维持良好状态”；也可指（法律语境中）“抚养费/生活支持”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling: maintenance) the act of keeping something in good condition by checking, repairing, or caring for it regularly; upkeep.","zh":"（正确拼写：maintenance）维护；保养：通过定期检查、修理或照料来保持某物处于良好状态。"},"examples":[{"en":"The building needs regular maintenance to stay safe.","zh":"这栋楼需要定期维护才能保持安全。"},{"en":"My car is in the shop for routine maintenance.","zh":"我的车在修理厂做例行保养。"}]},{"partOfSpeech":"n.","definition":{"en":"money or support provided to help someone continue living, especially in legal contexts (e.g., child maintenance).","zh":"（尤用于法律语境）抚养费；生活费支持（如 child maintenance）。"},"examples":[{"en":"He pays child maintenance every month.","zh":"他每个月支付孩子的抚养费。"},{"en":"The court ordered maintenance payments.","zh":"法院裁定需支付抚养费。"}]}],"synonyms":["upkeep","care","servicing","repair","support","alimony"],"phonetic":"/ˈmeɪntənəns/","extraExplanation":["“maintainance” 是常见拼写错误；标准拼写是 “maintenance”。可以用记忆法：main + ten + ance（虽然不是严格词根拆分，但有助于记住中间是 “ten”，不是 “tain”。）","词源上，maintenance 与 maintain 同源，核心意思是“维持、保持”，因此既可指“维护保养”，也可指“维持生活的经济支持”（法律用语较常见）。"]}
{"word":"maintainances","summary":{"en":"Maintenance usually means keeping something in good condition (repairs/servicing); in formal contexts it can also mean financial support.","zh":"Maintenance 通常指“维护/保养（维修、检修）”；在正式语境中也可指“生活费/抚养费等经济支持”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the work of keeping something in good condition by checking, repairing, cleaning, or servicing it","zh":"维护；保养：通过检查、修理、清洁或检修来保持某物良好状态的工作"},"examples":[{"en":"The elevator is closed for maintenance.","zh":"电梯因维护暂停使用。"},{"en":"Regular maintenance keeps your car safe and reliable.","zh":"定期保养能让你的车更安全、更可靠。"},{"en":"The building’s maintenance costs are rising.","zh":"这栋楼的维护成本正在上升。"}]},{"partOfSpeech":"n.","definition":{"en":"money or support given to provide for someone’s basic needs (more formal/legal)","zh":"（正式/法律用语）抚养费；生活费：用于满足某人基本生活需要的金钱或支持"},"examples":[{"en":"He was ordered to pay child maintenance each month.","zh":"他被判每月支付子女抚养费。"},{"en":"She receives maintenance after the divorce.","zh":"离婚后她领取生活费/赡养费。"}]}],"synonyms":["upkeep","servicing","repair (work)","care"],"phonetic":"/ˈmeɪntənəns/","extraExplanation":["你写的 **maintainances** 通常被认为是拼写错误。正确拼写一般是 **maintenance**（不可数名词）。\n\n复数 **maintenances** 很少用，只有在强调“不同类型/不同项目的维护工作”时才可能出现，但日常英语里更常说：**maintenance work / maintenance tasks / maintenance activities**。","词源提示：**maintenance** 来自 **maintain**（维持、保持）+ 名词后缀 **-ance**，常指“维持某种状态所需的行为/费用”。"]}
{"word":"maintained","summary":{"en":"Maintained means kept something in good condition, kept something going/at the same level, or insisted something was true; it can also describe something as well cared for.","zh":"Maintained 表示维护保养、保持持续/水平不变，或坚称某事为真；也可作形容词指“维护良好、保养得当”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of maintain) kept something in good condition by checking and repairing it regularly; took care of it","zh":"（maintain 的过去式/过去分词）通过定期检查和修理使某物保持良好状态；维护、保养"},"examples":[{"en":"They maintained the building carefully to prevent damage.","zh":"他们仔细维护这栋楼，以防止损坏。"},{"en":"The team maintained the machines every month.","zh":"团队每月保养这些机器。"}]},{"partOfSpeech":"vt.","definition":{"en":"continued something over time; kept it at the same level or standard","zh":"使某事持续；保持在同一水平或标准"},"examples":[{"en":"She maintained her focus during the long exam.","zh":"在漫长的考试中，她一直保持专注。"},{"en":"The company maintained high quality even as it grew.","zh":"公司即使在扩张时也保持了高质量。"}]},{"partOfSpeech":"vt.","definition":{"en":"stated firmly that something was true; insisted","zh":"坚称某事属实；坚持（某种说法）"},"examples":[{"en":"He maintained that he had never seen the document before.","zh":"他坚称自己以前从未见过那份文件。"},{"en":"She maintained her innocence throughout the trial.","zh":"在整个审判过程中她都坚持自己无罪。"}]},{"partOfSpeech":"adj.","definition":{"en":"kept in good condition; taken care of regularly (often in “well-maintained”)","zh":"维护良好的；保养得当的（常见于 well-maintained）"},"examples":[{"en":"It’s a well-maintained park with clean paths.","zh":"这是一个维护良好的公园，小路很干净。"},{"en":"They live in a maintained historic house.","zh":"他们住在一栋维护得很好的历史老房子里。"}]}],"synonyms":["kept up","preserved","sustained","continued","upheld","looked after"],"phonetic":"/meɪnˈteɪnd/","extraExplanation":["“maintained that + 从句”常用于正式表达，表示“坚称/坚持认为”。例如：He maintained that the report was accurate.（他坚称报告是准确的。）","日常生活里更常见的是“maintain + 物品/系统”（维护、保养）和“maintain + 状态/水平”（保持）。形容词用法最常见搭配是“well-maintained”（维护良好/保养得当）。"]}
{"word":"maintainer","summary":{"en":"A maintainer is usually a person who keeps a project or system running well; it can also mean a product used to keep something in good condition.","zh":"maintainer 通常指维护项目或系统正常运作的人；也可指用于保养、护理的产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who takes care of a project, system, or product by keeping it working well—e.g., fixing problems, reviewing changes, and managing updates","zh":"维护者；（项目/系统/产品的）管理与维护人员：负责让其正常运作，如修复问题、审查改动、管理更新等"},"examples":[{"en":"The maintainer reviewed my code and suggested a safer approach.","zh":"维护者审查了我的代码，并建议了一个更安全的做法。"},{"en":"If you find a bug, report it to the package maintainer.","zh":"如果你发现了漏洞/错误，请向该软件包的维护者报告。"},{"en":"She is the maintainer of the school’s website.","zh":"她是学校网站的维护负责人。"}]},{"partOfSpeech":"n.","definition":{"en":"a product used to keep something in good condition (common in advertising or on labels)","zh":"保养用品；护理产品（常见于广告或产品标签）"},"examples":[{"en":"This leather maintainer helps prevent drying and cracking.","zh":"这款皮革保养剂有助于防止干裂。"},{"en":"Use a color maintainer to keep dyed hair bright.","zh":"使用护色护理产品来保持染发的亮泽。"}]}],"synonyms":["caretaker","keeper","administrator","steward","custodian"],"phonetic":"/meɪnˈteɪnɚ/","extraExplanation":["在开源软件（open-source）语境里，maintainer 通常指“维护者/负责人”：他们不一定写了最多代码，但会决定是否合并（merge）他人的改动、发布新版本、处理 issue（问题单），也会制定贡献规则。","在公司或团队里，maintainer 也可指“某个模块/仓库的负责人”，强调长期负责与持续维护，而不只是一次性的开发。","词根来自 maintain（维持、维护）+ -er（做某事的人/物）；因此既可指“人”，也可指“用于维护的产品”。"]}
{"word":"maintainers","summary":{"en":"Maintainers are people responsible for keeping something (equipment, buildings, or projects—especially software) working well over time.","zh":"Maintainers 指负责让某物（设备、建筑或项目，尤其是软件）长期正常运作并保持良好状态的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who keep something in good condition by checking, repairing, and caring for it regularly; people responsible for ongoing upkeep.","zh":"维护者；保养人员：定期检查、修理并照料某物，使其保持良好状态的人。"},"examples":[{"en":"The building’s maintainers inspect the elevators every month.","zh":"这栋楼的维护人员每个月都会检查电梯。"},{"en":"Park maintainers clean the trails and fix broken signs.","zh":"公园维护人员会清理步道并修理损坏的标识牌。"}]},{"partOfSpeech":"n.","definition":{"en":"People who manage and look after a project or system over time, especially a software project (often open-source), reviewing changes and deciding what gets included.","zh":"（尤指软件/开源项目的）维护者：长期管理并照看项目或系统的人，负责审核修改并决定哪些内容被纳入。"},"examples":[{"en":"The maintainers approved the bug fix and merged the code.","zh":"维护者批准了这个漏洞修复，并合并了代码。"},{"en":"If you have questions, contact the package maintainers.","zh":"如果你有问题，请联系该软件包的维护者。"}]}],"synonyms":["caretakers","upkeep staff","technicians","administrators","project owners"],"phonetic":"/meɪnˈteɪnərz/","extraExplanation":["在开源文化中，maintainers 通常不仅“修修补补”，还要做代码审查（review）、发布版本（release）、处理问题反馈（issues）、制定贡献规则（contribution guidelines）。因此它既包含“维护”，也带有“管理/把关”的含义。"]}
{"word":"maintaining","summary":{"en":"“Maintaining” means keeping something in good condition, continuing a level or state, or insisting on an opinion/claim.","zh":"“Maintaining”表示维护保养、维持某种水平或状态，或坚持/维护某种观点或主张。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"keeping something in good condition or working order by checking, repairing, or caring for it regularly","zh":"（通过定期检查、修理或照料）维护、保养，使某物保持良好状态或正常运转"},"examples":[{"en":"Maintaining the car includes changing the oil and checking the brakes.","zh":"保养汽车包括更换机油和检查刹车。"},{"en":"Maintaining a clean kitchen helps prevent pests.","zh":"保持厨房清洁有助于防止害虫。"}]},{"partOfSpeech":"v.","definition":{"en":"continuing to have or keep something at the same level, standard, or situation","zh":"维持（某种水平、标准或状态），使其持续不变"},"examples":[{"en":"The team is maintaining a high level of performance this season.","zh":"这支队伍本赛季一直保持高水平的表现。"},{"en":"She is maintaining her routine even during busy weeks.","zh":"即使在很忙的几周里，她也一直坚持自己的日常习惯。"}]},{"partOfSpeech":"v.","definition":{"en":"supporting or defending an idea, claim, or opinion (often in writing or formal speech)","zh":"（常用于书面或正式表达）坚持并维护某种观点、主张或说法"},"examples":[{"en":"He is maintaining that the decision was unfair.","zh":"他坚持认为这个决定不公平。"},{"en":"The report maintains that more funding is needed.","zh":"报告认为需要更多资金支持。"}]}],"synonyms":["keeping","preserving","upholding","sustaining","continuing","supporting"],"phonetic":"/meɪnˈteɪnɪŋ/","extraExplanation":["“maintaining”是动词maintain的-ing形式，可用作：\n1）现在分词：The company is maintaining its standards.\n2）动名词：Maintaining good relationships takes time.\n3）形容词用法：maintenance/maintaining costs（维护成本/维持成本，语境不同侧重点不同）。"]}
{"word":"maintainment","summary":{"en":"“Maintainment” is rare/nonstandard; usually replace it with “maintenance” (upkeep) or sometimes “sustainment” (ongoing support).","zh":"“Maintainment”较少见且不规范；通常应改用“maintenance（维护/保养）”，有时根据语境也可用“sustainment（持续支持）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An uncommon or nonstandard word sometimes used to mean “maintenance” (keeping something in good condition) or “sustainment” (continuing support).","zh":"一个不常见/不规范的词，有时被用来表示“maintenance（维护、保养）”或 “sustainment（持续支持、维持）”。"},"examples":[{"en":"The report mentions “maintainment,” but most writers would say “maintenance.”","zh":"报告里提到“maintainment”，但大多数写作者会用“maintenance（维护）”。"},{"en":"Budget limits affected the maintainment of the equipment.","zh":"预算限制影响了设备的维护（更常写作 maintenance）。"}]}],"synonyms":["maintenance","upkeep","sustainment"],"phonetic":"/meɪnˈteɪnmənt/","extraExplanation":["“Maintainment”在标准英语里非常少见，许多词典不收录；在正式写作中通常建议改用“maintenance（维护、保养）”或“sustainment（持续供给/维持）”，以避免显得不专业或引起误解。","容易混淆的常见词：\n- maintenance：设备/系统的维护保养；也可指“维持（某状态）”\n- containment：控制、遏制（如控制火势、遏制疫情）\n选择哪个词取决于语境：谈修理保养→maintenance；谈控制扩散→containment；谈持续供给支持→sustainment。"]}
{"word":"maintainor","summary":{"en":"“Maintainor” is usually a misspelling of “maintainer,” meaning a person who maintains something.","zh":"“maintainor”通常是“maintainer”的误拼，意思是“负责维护某物的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A person who maintains or takes care of something; the correct spelling is usually “maintainer.”","zh":"（常见拼写错误）指负责维护、保养或管理某物的人；正确拼写通常是“maintainer”。"},"examples":[{"en":"If you mean someone who fixes and takes care of a system, the word is “maintainer,” not “maintainor.”","zh":"如果你想表达“负责维护系统的人”，应该用“maintainer”，而不是“maintainor”。"},{"en":"The software maintainer updates the code and fixes bugs.","zh":"软件维护者会更新代码并修复漏洞。"}]}],"synonyms":["maintainer","caretaker","keeper","technician"],"phonetic":"/meɪnˈteɪnər/","extraExplanation":["“maintainor”在标准英语里一般不被视为正确拼写；最常见、最自然的形式是“maintainer”。","“maintainer”既可用于日常场景（设备维护人员），也常用于技术语境（软件/开源项目维护者）。"]}
{"word":"maintains","summary":{"en":"“Maintains” means keeps something in good condition, keeps something going at a steady level, or firmly states something is true.","zh":"“maintains”表示保养维护、维持保持，或坚称某事为真。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “maintain”) to keep something in good condition or working properly through regular care or repairs.","zh":"（maintain 的第三人称单数）通过定期保养或修理使某物保持良好状态或正常运转。"},"examples":[{"en":"She maintains her bike by cleaning and oiling the chain.","zh":"她通过清洁并给链条上油来保养自行车。"},{"en":"The landlord maintains the building’s heating system every winter.","zh":"房东每年冬天都会维护大楼的供暖系统。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep or continue a situation, activity, or level; to sustain.","zh":"维持（某种状况、活动或水平）；使持续。"},"examples":[{"en":"The team maintains a high level of customer service.","zh":"这个团队维持着高水平的客户服务。"},{"en":"He maintains his daily exercise routine even when he’s busy.","zh":"即使很忙，他也坚持每天锻炼。"}]},{"partOfSpeech":"vt.","definition":{"en":"to state firmly that something is true, often in the face of doubt or disagreement.","zh":"坚称；坚持说（某事为真，常用于面对质疑或反对时）。"},"examples":[{"en":"She maintains that she followed the rules.","zh":"她坚称自己遵守了规则。"},{"en":"The witness maintains he saw the driver run the red light.","zh":"证人坚持说他看到司机闯了红灯。"}]}],"synonyms":["keeps up","preserves","sustains","upholds","services","asserts"],"phonetic":"/meɪnˈteɪn/","extraExplanation":["“maintain”在英语里很常见的三条主线含义是：保养维护（maintain a machine/road）、维持保持（maintain a level/relationship）、坚称主张（maintain that...). 看到宾语就能快速判断是哪一种。","常见搭配：maintain a system/vehicle/building（维护…），maintain order/peace/standards（维持…），maintain that + 从句（坚称…）。"]}
{"word":"maintenance","summary":{"en":"Maintenance means keeping something working well through regular care and repairs, or continuing to keep a condition or standard.","zh":"Maintenance 指通过定期保养与修理来保持良好运行，也可指维持某种状态或标准。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the work of keeping something in good condition by checking it regularly, repairing it, and preventing problems","zh":"维护；保养：通过定期检查、修理与预防问题来使某物保持良好状态的工作"},"examples":[{"en":"Regular maintenance can prevent expensive repairs later.","zh":"定期维护可以避免以后昂贵的修理费用。"},{"en":"The elevator is closed for maintenance today.","zh":"电梯今天因维护而停用。"},{"en":"Car maintenance includes oil changes and tire checks.","zh":"汽车保养包括换机油和检查轮胎。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of continuing to keep something at the same level, standard, or condition","zh":"维持：使某事物保持在同一水平、标准或状态的行为"},"examples":[{"en":"The maintenance of public safety is a shared responsibility.","zh":"公共安全的维持是共同的责任。"},{"en":"Good sleep helps with the maintenance of mental health.","zh":"良好的睡眠有助于维持心理健康。"}]}],"synonyms":["upkeep","servicing","care","preservation","support"],"phonetic":"/ˈmeɪn.tən.əns/","extraExplanation":["“Maintenance”常和特定名词搭配：building/road/equipment maintenance（建筑/道路/设备维护），以及“under maintenance”（正在维护中）。在职场里也常见“preventive maintenance”（预防性维护）与“routine maintenance”（例行维护），强调“先预防、再修理”的理念。","与“maintain”（v. 维持；维护）同源：maintain a machine（维护机器）、maintain a standard（维持标准）。注意“maintenance”更偏“这项工作/过程”，而“repair”更偏“坏了以后修理”。"]}
{"word":"maintenance-free","summary":{"en":"requiring little or no routine upkeep","zh":"几乎不需要日常维护的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not needing regular upkeep, repairs, or attention; designed to keep working without routine maintenance","zh":"免维护的；无需定期保养/检修的；设计成几乎不用日常维护也能运作"},"examples":[{"en":"The building uses maintenance-free materials to reduce long-term costs.","zh":"这栋楼使用免维护材料来降低长期成本。"},{"en":"He bought a maintenance-free battery for his car.","zh":"他给车买了一块免维护电池。"},{"en":"The company advertises the product as maintenance-free, but you still need to clean it sometimes.","zh":"公司宣传产品“免维护”，但你有时还是需要清洁一下。"}]}],"synonyms":["low-maintenance","no-maintenance","self-sustaining","carefree"],"phonetic":"/ˈmeɪntənəns friː/","extraExplanation":["常见于广告与说明书语境，含义通常是“基本不用例行保养”，并不一定等于“永远不用任何维护”。更准确的理解是 low-maintenance（低维护）或 minimal maintenance（最少维护）。","写法上常见带连字符 maintenance-free；放在名词后作表语时有时也可写作 maintenance free，但带连字符更常见、更规范。"],"etymology":"由 maintenance（维护、保养）+ free（免于……的）构成的复合形容词。英语里“X-free”常表示“无X/不含X/免于X”（如 sugar-free）。","mnemonic":["把它拆开记：maintenance（维护）+ free（免）= “免维护”。","联想常见标签：sugar-free（无糖）→ maintenance-free（免维护），同样的“X-free = 无/免X”结构。"]}
{"word":"maintenance-related","summary":{"en":"connected with upkeep, repair, or servicing","zh":"与保养、维修或维护有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, concerning, or used for maintenance (keeping something in good condition through inspection, repair, and care)","zh":"与维护相关的；用于维护的（指为保持良好状态而进行的检查、保养、维修等）"},"examples":[{"en":"Please submit all maintenance-related requests through the online portal.","zh":"请通过线上系统提交所有与维护相关的申请。"},{"en":"We had a maintenance-related delay because a safety check took longer than expected.","zh":"由于安全检查耗时超出预期，我们出现了与维护相关的延误。"},{"en":"The handbook includes maintenance-related procedures for the air-conditioning system.","zh":"手册包含空调系统的维护相关操作流程。"}]}],"synonyms":["maintenance","upkeep-related","service-related","repair-related"],"phonetic":"/ˈmeɪntənəns rɪˈleɪtɪd/","extraExplanation":["常用于正式或工作场景（例如邮件、报告、制度文件）中，把一类事情归为“维护/保养/维修”这一范畴：maintenance-related costs（维护相关成本）、maintenance-related issues（维护相关问题）、maintenance-related work（维护相关工作）。","在技术或工程语境里，maintenance 不只是“修坏了再修”，也包括预防性保养（preventive maintenance），所以 maintenance-related 既可指维修也可指例行检查与保养。"],"etymology":"由 maintenance（维护、保养）+ related（相关的）构成的复合形容词。maintenance 来自中古法语，原义与“支撑、维持”有关，后来引申为“维持良好状态的保养/维修”。related 来自拉丁语词根，表示“连接、关联”。","mnemonic":["把它拆开记：maintenance（维护）+ related（相关）= “维护相关”。看到连字符就当作“打包成一个形容词”。","联想常见搭配：maintenance-related costs/issues/work——记住三个高频名词，写作更顺手。"]}
{"word":"maintenances","summary":{"en":"“Maintenances” is the plural of “maintenance,” usually referring to multiple maintenance tasks/projects (and less commonly, financial support).","zh":"“Maintenances”是“maintenance”的复数，通常指多项维护/保养任务或项目（较少指生活费/抚养费）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the work of keeping something in good condition (repairing, cleaning, checking, servicing); plural form of “maintenance”","zh":"维护；保养（修理、清洁、检查、检修等使事物保持良好状态的工作），“maintenance”的复数形式"},"examples":[{"en":"The building’s maintenances were scheduled for every Friday night.","zh":"这栋楼的维护工作安排在每周五晚上进行。"},{"en":"Regular maintenances help machines run safely and longer.","zh":"定期维护能让机器更安全、寿命更长。"}]},{"partOfSpeech":"n.","definition":{"en":"money or support given to keep someone living at an acceptable level (less common in plural)","zh":"生活费；抚养费（用于维持某人基本生活的金钱或支持；复数较少见）"},"examples":[{"en":"He struggled to pay maintenances for two households.","zh":"他很难负担两个家庭的生活费。"}]}],"synonyms":["upkeep","servicing","repair work","maintenance work","support"],"phonetic":"/ˈmeɪntənəns/","extraExplanation":["“maintenance”在日常英语里通常是不可数名词，更常说：maintenance work / maintenance costs / maintenance schedule。","复数“maintenances”多见于技术、管理或正式文件中，用来强调“多项维护任务/多个维护项目/不同类别的维护”。很多场合用“maintenance tasks/activities”会更自然。","拼写提醒：maintenance（不是 *maintainance*）。"]}
{"word":"maintenir","summary":{"en":"Maintenir (French) means “to maintain/keep” and also “to support/sustain.”","zh":"maintenir（法语）主要表示“维持/保持”，也可表示“支撑/使持续”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(French verb) to maintain; to keep something in the same state or condition; to continue doing something.","zh":"（法语动词）维持；保持某物处于同一状态；继续做某事。"},"examples":[{"en":"The teacher told us to maintain silence during the exam. (French: maintenir le silence)","zh":"老师让我们在考试期间保持安静。（法语：maintenir le silence）"},{"en":"They try to maintain a good relationship with their neighbors. (French: maintenir de bonnes relations)","zh":"他们努力与邻居保持良好关系。（法语：maintenir de bonnes relations）"},{"en":"To stay healthy, you need to maintain a balanced diet. (French: maintenir une alimentation équilibrée)","zh":"为了保持健康，你需要维持均衡饮食。（法语：maintenir une alimentation équilibrée）"}]},{"partOfSpeech":"vt.","definition":{"en":"(French verb) to support; to hold up; to sustain something (physically or figuratively).","zh":"（法语动词）支撑；托住；使某事得以持续（可指物理或抽象意义）。"},"examples":[{"en":"The bridge is designed to support heavy trucks. (French: maintenir / soutenir des camions lourds)","zh":"这座桥的设计可以承载重型卡车。（法语：maintenir / soutenir des camions lourds）"},{"en":"The organization supports families in need. (French: maintenir / soutenir des familles)","zh":"该组织支援有需要的家庭。（法语：maintenir / soutenir des familles）"}]}],"synonyms":["maintain","keep","sustain","support","preserve"],"phonetic":"/mæn.təˈnɪr/","extraExplanation":["“maintenir”在法语里非常常用，常与名词搭配：maintenir l’ordre（维持秩序）、maintenir la pression（保持压力）、maintenir une promesse（信守承诺）、maintenir une décision（维持/不改变决定）。","它来自拉丁语 *manu tenere*（字面义“用手握住”），因此既可以表示“保持不变”，也可以引申为“支撑、稳住”。"]}
{"word":"maintenon","summary":{"en":"Maintenon is a French place name (a town with a famous château) and a noble name best known from Madame de Maintenon, linked to King Louis XIV.","zh":"Maintenon（曼特农）既是法国地名（以城堡闻名的小镇），也是贵族称号/姓氏，最常指与路易十四相关的“曼特农夫人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A commune (small town) in north-central France (Eure-et-Loir), known for the Château de Maintenon and its large aqueduct.","zh":"（专有名词）法国中北部（厄尔-卢瓦尔省）的一个小镇，以“曼特农城堡”和巨大的“曼特农渡槽/高架渠”闻名。"},"examples":[{"en":"We took a day trip from Paris to Maintenon to see the château.","zh":"我们从巴黎去曼特农一日游，参观了那座城堡。"},{"en":"The aqueduct at Maintenon is an impressive unfinished engineering project.","zh":"曼特农的渡槽是一项令人惊叹但未完工的工程项目。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A French noble title and family name, best known from Madame de Maintenon (Françoise d’Aubigné), the second wife of King Louis XIV (in a private marriage).","zh":"（专有名词）法国贵族头衔与姓氏；最著名的是“曼特农夫人”（弗朗索瓦丝·达奥比涅），路易十四的第二任妻子（秘密/非公开婚姻）。"},"examples":[{"en":"In history class, we read about Madame de Maintenon and her influence at court.","zh":"历史课上我们读到了曼特农夫人以及她在宫廷中的影响。"},{"en":"The name Maintenon often appears in books about Louis XIV’s Versailles.","zh":"在讲路易十四凡尔赛的书里，“Maintenon（曼特农）”这个名字常常出现。"}]}],"synonyms":["Madame de Maintenon","Château de Maintenon"],"phonetic":"/mæn.təˈnɑn/","extraExplanation":["“Madame de Maintenon（曼特农夫人）”常与凡尔赛宫廷文化、路易十四晚年的宗教与教育政策联系在一起；她也与圣西尔女子学校（Maison royale de Saint-Louis, Saint-Cyr）有关。","读法上，英语里通常按法语地名/称号来念；写作中常见形式包括“Maintenon”“Madame de Maintenon”“Château de Maintenon”。"]}
{"word":"maintien","summary":{"en":"Maintain means to keep something in good condition, keep something at the same level, or insist that something is true.","zh":"Maintain 常指维护保养、维持某种水平或状态，或坚称某事为真。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to keep something in good condition by checking or repairing it regularly","zh":"通过定期检查或修理来保持某物处于良好状态；维护"},"examples":[{"en":"We need to maintain the car so it stays safe to drive.","zh":"我们需要保养这辆车，这样开起来才安全。"},{"en":"The building is old, but it is well maintained.","zh":"这栋楼很旧，但维护得很好。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep something continuing at the same level or standard","zh":"保持（水平、标准、状态）不变；维持"},"examples":[{"en":"Try to maintain a healthy diet during the holiday.","zh":"假期里也尽量保持健康饮食。"},{"en":"The company maintained high quality this year.","zh":"这家公司今年保持了高质量。"}]},{"partOfSpeech":"vt.","definition":{"en":"to say firmly that something is true, even when others disagree","zh":"坚称；主张（即使他人不同意）"},"examples":[{"en":"He maintained that he was innocent.","zh":"他坚称自己是无辜的。"},{"en":"She maintains that the plan will work.","zh":"她坚持认为这个计划会奏效。"}]}],"synonyms":["keep","preserve","sustain","uphold"],"phonetic":"/meɪnˈteɪn/","extraExplanation":["你输入的“maintien”更像是拼写错误；英语里常见的是 maintain（维护/维持/坚称）。","顺便一提，法语里确实有“maintien”，意思接近“维持、保持（状态）/支撑”，但在英语中不这样用。"]}
{"word":"maintop","summary":{"en":"Maintop is the platform high on a ship’s mainmast, used for lookout and working with sails/rigging.","zh":"Maintop 指帆船主桅杆上方的桅平台，用于瞭望及处理帆与索具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nautical) The platform high on the mainmast of a sailing ship, used as a lookout point and as a place to handle sails and rigging.","zh":"（航海）帆船主桅杆上方的“桅楼/桅平台”，用于瞭望，也用于操作帆和索具。"},"examples":[{"en":"The sailor climbed to the maintop to watch for land.","zh":"水手爬上主桅的桅平台去观察是否有陆地。"},{"en":"From the maintop, you can see the sails and the ocean clearly.","zh":"从主桅的桅平台上，可以清楚看到船帆和海面。"}]}],"synonyms":["main top","mainmast top"],"phonetic":"/ˈmeɪnˌtɑp/","extraExplanation":["“maintop”常写作 two words：main top；也可用更具体的说法“mainmast top”（主桅桅楼/桅平台）。这是传统帆船结构词，现代日常英语里不常见，多出现在航海史、海洋小说（如海盗题材或19世纪航海故事）和船舶介绍中。","相关词：foretop（前桅桅平台）、mizzen-top（后桅桅平台）、rigging（索具）、mast（桅杆）。"]}
{"word":"maintopman","summary":{"en":"A nautical term for a sailor who works aloft on the main mast’s rigging and sails.","zh":"航海用语：在主桅高处索具与帆具上作业的水手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sailor whose job is to work high up on the ship’s rigging and sails on the main mast (especially on older sailing ships)","zh":"（尤指旧式帆船上）负责在主桅高处索具与帆具上作业的水手；主桅桅楼水手"},"examples":[{"en":"In the age of sail, a main topman had to climb quickly and work confidently in strong winds.","zh":"在帆船时代，主桅桅楼水手必须动作敏捷，且能在大风中镇定工作。"},{"en":"The captain ordered the main topmen to reef the sails before the storm reached the ship.","zh":"船长命令主桅桅楼水手在风暴到来前收缩帆面。"}]}],"synonyms":["topman","sailor","seaman"],"phonetic":"/ˈmeɪn ˈtɑːpmən/","extraExplanation":["“maintopman”通常写作两个词 main topman（复数 main topmen），属于航海/帆船时代的职业称呼。main mast 是“主桅”，top 指桅楼/桅顶平台一带，因此 topman 指在高处索具与帆上工作的水手。","在英文海洋文学里（如描写帆船与海战的小说），这类词常用来营造时代氛围；现代日常英语里很少见。"]}
{"word":"maintopmast","summary":{"en":"A nautical term for the mast section above the mainmast that supports upper sails.","zh":"航海术语：主桅上方、用于支撑上层帆的桅杆部分（主上桅）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) The section of mast above a ship’s mainmast, used to support the main topsail and other upper sails.","zh":"（航海）主上桅：位于船的主桅上方的一段桅杆，用来支撑主上帆等上层帆具。"},"examples":[{"en":"In the old painting, you can see sailors climbing the maintopmast to reef the sail.","zh":"在那幅旧画里，你能看到水手爬上主上桅去收缩帆面。"},{"en":"The crew inspected the maintopmast for cracks after the storm.","zh":"暴风雨过后，船员检查主上桅是否有裂痕。"}]}],"synonyms":["main-topmast","topmast (of the mainmast)"],"phonetic":"/ˈmeɪnˌtɑpˌmæst/","extraExplanation":["这个词多见于传统帆船（尤其是多桅横帆船）的索具结构里。常见写法也会用连字符：main-topmast。现代日常英语里不常用，更多出现在航海史、小说（如海洋冒险题材）或帆船技术资料中。"]}
{"word":"maintopmen","summary":{"en":"Maintopmen are sailors assigned to work high up on the mainmast top of a traditional sailing ship.","zh":"Maintopmen 指传统帆船上负责在主桅顶高处作业的水手（maintopman 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sailor who works aloft on the mainmast top (the platform high on the main mast) of a sailing ship; one of the crew assigned to that area.","zh":"（帆船上）在主桅顶（主桅杆上方的平台）高处作业的水手；负责主桅顶相关工作的船员。"},"examples":[{"en":"The maintopmen climbed quickly to reef the sails before the storm arrived.","zh":"暴风雨到来前，主桅顶水手迅速爬上去收帆（缩帆）。"},{"en":"In old sea stories, maintopmen are often described as fearless and skilled climbers.","zh":"在老海上故事里，主桅顶水手常被描写成无畏、擅长攀爬的人。"}]}],"synonyms":["topman","sailor","seaman"],"phonetic":"/ˈmeɪnˌtɑp.mən/","extraExplanation":["“maintopmen”通常是“maintopman”的复数形式。这里的“top”指桅杆上较高处的“顶台/桅顶平台”（不是“顶部”这种泛指），而“main-”指“主桅”（mainmast）。","这个词多见于航海史、海军史、古典海洋文学或关于帆船时代（Age of Sail）的文本中；现代日常英语里很少使用。"]}
{"word":"maintops","summary":{"en":"Maintops are the platforms high on a sailing ship’s mainmast.","zh":"Maintops 指帆船主桅上的高处平台（主桅平台）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the platform high on the mainmast of a sailing ship, used as a lookout and for handling sails and rigging (plural: maintops)","zh":"（帆船）主桅平台：位于主桅上方的高处平台，用于瞭望以及操作帆具和索具（复数：maintops）"},"examples":[{"en":"A sailor climbed into the maintop to watch for land.","zh":"一名水手爬上主桅平台瞭望是否有陆地。"},{"en":"From the maintops, they could see the storm approaching.","zh":"从主桅平台上，他们能看到暴风雨正在逼近。"}]}],"synonyms":["maintop (singular)","main-top (variant spelling)"],"phonetic":"/ˈmeɪnˌtɑp/","extraExplanation":["“maintop”是航海/帆船用语：mainmast=主桅；top=桅顶平台。历史上大帆船常有foretop（前桅平台）、maintop（主桅平台）、mizzen top（后桅平台）。","在古典海洋文学里（如一些19世纪航海小说），“in the maintops”常用来描写水手在高处观察、迎风收放帆或在战斗中占据高点。"]}
{"word":"maintopsail","summary":{"en":"A topsail carried on the mainmast of a traditional sailing ship.","zh":"传统帆船上设置在主桅上的上帆（主上帆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sail on the mainmast set above the mainsail (especially on traditional square-rigged ships); also, the part of the rig where that sail is carried.","zh":"（传统方帆船上）主桅中设置在主帆之上的一面帆；也可指承载该帆的相关索具/帆装位置。"},"examples":[{"en":"As the wind strengthened, the crew set the maintopsail to gain more speed.","zh":"风力增强时，船员升起主上帆以提高航速。"},{"en":"In old naval paintings, you can often see the maintopsail billowing high above the deck.","zh":"在一些古老的海军绘画里，你常能看到甲板上方高高鼓起的主上帆。"}]}],"synonyms":["main topsail","topsail (on the mainmast)"],"phonetic":"/ˈmeɪnˌtɑpˌseɪl/","extraExplanation":["“maintopsail”主要出现在传统帆船语境（如18—19世纪的商船、军舰与航海文学）中。它由“main-（主桅/主帆）+ topsail（上帆）”构成，字面意思就是“主桅的上帆”。在一些船型或不同时代的帆装中，上帆还可能细分为“lower/upper topsail（下上帆/上上帆）”。"]}
{"word":"mainward","summary":{"en":"Mainward means “toward the main part or mainland,” but it’s rare in modern English.","zh":"mainward 意为“朝向主要部分/本土方向”，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the main part, center, or mainland; in the direction of what is most important or primary (rare).","zh":"朝向主要部分、中心或本土；朝向最重要/主要的方向（较少见）。"},"examples":[{"en":"The small road curves mainward, back to the highway.","zh":"那条小路向主要道路方向弯回去，通向高速公路。"},{"en":"Boats traveled mainward as the storm approached.","zh":"暴风雨逼近时，船只朝本土方向驶去。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving or facing toward the main part or mainland (rare).","zh":"朝向主要部分或本土的（较少见）。"},"examples":[{"en":"They took the mainward route to reach the city quickly.","zh":"他们走了朝向主城区的路线，以便更快到达。"}]}],"synonyms":["toward the mainland","inward","toward the center","homeward (context-dependent)"],"phonetic":"/ˈmeɪn.wɚd/","extraExplanation":["“mainward”属于比较少见、略带书面或叙述风格的词，结构类似于“northward / homeward”。现代英语更常用“toward the mainland / toward the main road / back toward the city”等更具体的表达。"]}
{"word":"Mainz","summary":{"en":"a city on the Rhine in western Germany","zh":"德国西部莱茵河畔的一座城市"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in western Germany on the Rhine River, the capital of the state of Rhineland-Palatinate.","zh":"德国西部莱茵河畔的城市，莱茵兰-普法尔茨州首府。"},"examples":[{"en":"Mainz lies on the Rhine River across from Wiesbaden.","zh":"美因茨位于莱茵河畔，与威斯巴登隔河相望。"},{"en":"Many visitors come to Mainz for its cathedral and old town.","zh":"许多游客来美因茨参观大教堂和老城区。"}]},{"partOfSpeech":"n.","definition":{"en":"Used in names of institutions, events, or products connected with the city (e.g., University of Mainz).","zh":"用于指与该城市相关的机构、活动或产品名称（如“美因茨大学”）。"},"examples":[{"en":"She studied medicine at the University of Mainz.","zh":"她在美因茨大学学习医学。"},{"en":"The conference will be held in Mainz this year.","zh":"今年的会议将在美因茨举行。"}]}],"phonetic":"/maɪnts/","extraExplanation":["英文里“Mainz”是专有名词，通常不加冠词（说“in Mainz”，不说“in the Mainz”）。","美因茨常与古腾堡（Johannes Gutenberg）联系在一起：他与活字印刷术的发展密切相关；城市里也有古腾堡博物馆。"],"etymology":"源自古罗马时期的拉丁名“Mogontiacum”（一处军营与聚落），中世纪逐渐演变为德语“Mainz”。英语中通常沿用德语地名。","mnemonic":["读音像“minds”（/maɪndz/ 的感觉），可以联想“这里有很多聪明人的城市”。","“z”结尾可提醒：这是德语地名，拼写看起来更“硬朗”。"]}
{"word":"Mainzian","summary":{"en":"connected with Mainz or its residents","zh":"美因茨的；美因茨人"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mainz, a city in Germany, or to its people or culture","zh":"与德国城市美因茨（Mainz）及其人民或文化有关的；美因茨的"},"examples":[{"en":"The museum has a strong collection of Mainzian religious art.","zh":"这家博物馆收藏了大量美因茨的宗教艺术品。"},{"en":"She wrote a Mainzian guide to local food and wine.","zh":"她写了一本介绍美因茨当地美食与葡萄酒的指南。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mainz","zh":"美因茨人；来自美因茨的人"},"examples":[{"en":"Many Mainzians celebrate the carnival season with parades and costumes.","zh":"许多美因茨人在狂欢节期间会参加游行并穿上戏服。"},{"en":"He is a proud Mainzian who often talks about the Rhine.","zh":"他是一位自豪的美因茨人，常常谈起莱茵河。"}]}],"synonyms":["Mainzer","Mainz resident","Mainz local"],"phonetic":"ˈmaɪntsiən","extraExplanation":["Mainz 位于德国莱茵河畔，英语中也常用更常见的形式 Mainzer（美因茨人；美因茨的），尤其在体育或日常语境里更常见；Mainzian 相对更书面、较少见。"],"etymology":"由城市名 Mainz（美因茨）+ 表示“……的人/……的”之形容词/名词后缀 -ian 构成，表示“美因茨的/美因茨人”。","mnemonic":["把 -ian 记成“某地的人/某地的”（如 Canadian）。Mainz + ian → “美因茨的/美因茨人”。","联想中文：看到 -ian 就想到“某地人”（意译成“……人/……的”），帮助快速判断词性。"]}
{"word":"maioid","summary":{"en":"**Myeloid** means “related to bone marrow” or “a bone-marrow–derived immune cell.”","zh":"**myeloid** 指“与骨髓有关的”，也可指“骨髓来源的一类免疫细胞”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: **myeloid**) relating to bone marrow (the soft tissue inside bones that makes blood cells).","zh":"（可能是拼写错误，原词多为 **myeloid**）与**骨髓**有关的；骨髓性的（骨内制造血细胞的软组织）。"},"examples":[{"en":"Myeloid cells help the body fight infections.","zh":"骨髓系细胞帮助身体对抗感染。"},{"en":"The doctor mentioned myeloid leukemia, a cancer of blood-forming cells.","zh":"医生提到骨髓性白血病，这是一种发生在造血细胞的癌症。"}]},{"partOfSpeech":"n.","definition":{"en":"(In medicine/biology) a bone-marrow–derived cell, especially a type involved in innate immunity (e.g., monocytes, granulocytes).","zh":"（医学/生物）骨髓来源的细胞；尤指参与先天免疫的一类细胞（如单核细胞、粒细胞）。"},"examples":[{"en":"The sample contained many myeloids, suggesting inflammation.","zh":"样本里有许多骨髓系细胞，提示存在炎症。"}]}],"synonyms":["bone-marrow-related","marrow-derived"],"phonetic":"/ˈmaɪəˌlɔɪd/","extraExplanation":["“maioid”在英语里几乎不作为常用词出现；在医学语境中，最常见的对应词是 **myeloid**（骨髓性的）。如果你是在读体检报告、论文或看到“AML（acute myeloid leukemia，急性骨髓性白血病）”等缩写，那么基本可以确定是这个词。","词形提示：**myel-** 常见于医学词根，表示“骨髓/脊髓”（如 myeloma 多发性骨髓瘤；myelitis 脊髓炎），再加上 **-oid**（“类似……的/……样的”）构成 myeloid。"]}
{"word":"maioidea","summary":{"en":"Maioidea is a scientific taxonomic name for a superfamily of crabs, often called spider crabs.","zh":"Maioidea 是蟹类的一个科学分类名称（总科），常对应通俗说法“蜘蛛蟹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic superfamily of crabs that includes many “spider crabs,” often with long legs and sometimes decorated with algae or other materials for camouflage.","zh":"（动物分类）一种蟹的总科，包含许多“蜘蛛蟹”；常见特征是腿细长，有些会把海藻等附着在身上进行伪装。"},"examples":[{"en":"Maioidea includes many species commonly called spider crabs.","zh":"Maioidea 包含许多通常被称为“蜘蛛蟹”的物种。"},{"en":"Some majoid crabs (Maioidea) use materials from their environment to camouflage themselves.","zh":"一些马约蟹类（Maioidea）会利用环境中的材料来伪装自己。"}]}],"synonyms":["spider crabs","majoid crabs"],"phonetic":"/ˌmeɪ.oʊˈɔɪ.di.ə/","extraExplanation":["“Maioidea”是生物分类学名称（总科），在日常英语里更常听到的是通俗名“spider crab(s)”（蜘蛛蟹）。","你可能也会看到拼写“Majoidea”（更常见的拼法之一）；不同资料在拉丁化拼写上可能略有差异。","词根与“Maia / maia-”有关，常见于一些甲壳类的分类命名中；理解上把它当作“蜘蛛蟹相关的分类名”即可。"]}
{"word":"maioidean","summary":{"en":"“maioidean” is not a recognized English word; it likely needs context or a corrected spelling.","zh":"“maioidean”不是常见英语词；需要上下文或更正拼写才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a transliteration from another language, or a proper name (e.g., a surname, place name, or fictional term).","zh":"不是标准英语词汇。可能是拼写错误、其他语言的音译/转写，或专有名词（如姓氏、地名、虚构词）。"},"examples":[{"en":"I can’t find “maioidean” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里找不到“maioidean”——你能把看到它的句子发我吗？"},{"en":"If you meant a similar-looking word, please tell me the topic (history, fantasy, medicine, etc.).","zh":"如果你想查的是一个长得很像的词，请告诉我相关领域（历史、奇幻、医学等）。"}]}],"phonetic":"/maɪˈɔɪdiən/","extraExplanation":["“maioidean”看起来不像常见英语构词，更像是：\n1）拼写误差（比如多/少了字母，或把i/e、a/o打错）；\n2）来自盖尔语/爱尔兰语/苏格兰语等语言的转写；\n3）人名或地名（专有名词通常不进普通词典）。\n\n你可以提供：出现的原句、来源（书/网站/游戏/论文）、以及你想表达的大概意思。我就能帮你定位最可能的正确拼写，并给出准确释义与例句。"]}
{"word":"maioli","summary":{"en":"“Maioli” is likely a misspelling of **aioli**, a garlic sauce (often garlic mayonnaise).","zh":"“maioli”很可能是 **aioli** 的误拼：一种蒜味酱（常见为蒜味蛋黄酱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Food) A garlic-flavored sauce, traditionally made by emulsifying garlic with olive oil; in modern cooking it is often a garlic mayonnaise.","zh":"（食物）蒜味酱汁；传统做法是用大蒜与橄榄油乳化而成，现代烹饪中常指“蒜味蛋黄酱/蒜味美乃滋”。"},"examples":[{"en":"I ordered fries with aioli instead of ketchup.","zh":"我点了薯条，蘸的是蒜味蛋黄酱（aioli），不是番茄酱。"},{"en":"The restaurant serves roasted vegetables with lemon aioli.","zh":"那家餐厅把烤蔬菜配柠檬蒜味酱。"},{"en":"This burger comes with a spicy aioli.","zh":"这个汉堡配的是辣味蒜味酱。"}]}],"synonyms":["garlic mayo","garlic mayonnaise","garlic sauce"],"phonetic":"/aɪˈoʊli/","extraExplanation":["“maioli”并不是常见的英文单词拼写。你可能想查的是 **aioli**（蒜味酱）。在菜单或社交媒体上偶尔会看到把它写成“mayoli/maioli”之类的非标准拼写，用来强调它像（或就是）“mayo + garlic”的感觉，但在标准英语中更推荐写 **aioli**。","词源来自普罗旺斯语/法语（aïoli），大致由“蒜（ail）+ 油（oli/oli）”构成。传统的 aioli 不一定含蛋；而美式餐厅里常见的是“蒜味蛋黄酱”版本。"]}
{"word":"maiolica","summary":{"en":"Maiolica is colorful Italian tin-glazed earthenware, or an object made in that style.","zh":"Maiolica 指意大利的锡釉彩陶（马约利卡），也可指这种风格的具体器物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of brightly painted Italian pottery (earthenware) traditionally coated with an opaque white tin glaze and decorated with colorful designs.","zh":"（意大利）马约利卡陶器；一种传统上施以不透明白色锡釉、并绘有鲜艳图案的彩绘陶（陶质器皿）。"},"examples":[{"en":"The museum displayed a 16th-century maiolica plate with vivid blue and yellow patterns.","zh":"博物馆展出了一只16世纪的马约利卡盘子，上面有鲜艳的蓝黄纹样。"},{"en":"She collects maiolica because the glossy glaze makes the colors look bright and clean.","zh":"她收藏马约利卡陶器，因为光亮的釉面让颜色显得明亮又清爽。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece or object made in this style (for example, a bowl, tile, or vase).","zh":"马约利卡风格的器物（如碗、瓷砖或花瓶等）。"},"examples":[{"en":"He bought a small maiolica as a souvenir from Florence.","zh":"他从佛罗伦萨买了一件小马约利卡陶器作纪念品。"},{"en":"The kitchen backsplash used maiolica tiles with floral motifs.","zh":"厨房防溅墙使用了带花卉纹样的马约利卡瓷砖。"}]}],"synonyms":["tin-glazed earthenware","faience"],"phonetic":"/ˌmaɪˈɑlɪkə/","extraExplanation":["“Maiolica”常与意大利文艺复兴时期的工艺联系在一起，常见于盘、罐、瓷砖等日用与装饰器物。它的典型特征是白色锡釉打底（让表面更不透明、更像“画布”），再在釉上绘彩，烧成后色彩明快。","词源上常被认为与“Majorca（马略卡岛）”有关：中世纪经由该地转运的西班牙伊斯兰风格锡釉陶影响了意大利工匠，后来在意大利发展出独特的彩绘传统。","学习时可顺便区分：maiolica（多指意大利锡釉彩陶传统） vs. faience（法昂斯，英语里更广义地指锡釉陶） vs. porcelain（瓷器，胎质与工艺不同）。"]}
{"word":"maiolicas","summary":{"en":"Maiolicas = plural of maiolica; brightly painted Italian tin-glazed pottery, often Renaissance-era.","zh":"maiolicas 是 maiolica 的复数；指色彩鲜艳的意大利锡釉彩绘陶器，常见于文艺复兴时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Maiolicas are pieces of maiolica: Italian-style, tin-glazed earthenware (pottery) that often has bright, painted designs, especially associated with the Renaissance.","zh":"maiolicas 是 maiolica（马约利卡陶）的复数：一种意大利风格的锡釉陶器（陶土器皿），常见色彩鲜艳的彩绘装饰，尤其与文艺复兴时期相关。"},"examples":[{"en":"The museum displayed a room of Renaissance maiolicas decorated with mythological scenes.","zh":"博物馆展出了一间摆满文艺复兴时期马约利卡陶的展室，上面画着神话场景。"},{"en":"Collectors look for maiolicas with vivid blues and yellows and minimal damage to the glaze.","zh":"收藏家会寻找蓝黄颜色鲜明、釉面损伤较少的马约利卡陶。"}]}],"synonyms":["maiolica ware","tin-glazed earthenware","majolica (variant spelling)"],"phonetic":"/maɪˈɑːlɪkəz/","extraExplanation":["“maiolica”源自意大利语，常被认为与西班牙的马略卡岛（Majorca）有关，因为中世纪时期的釉陶贸易与该地区联系紧密。","英语里你也会看到拼写变体“majolica”。在不同语境下两者有时会被混用，但在艺术史/博物馆语境中，“maiolica”更常指意大利的锡釉彩绘陶。"]}
{"word":"maiongkong","summary":{"en":"Hong Kong is a major city and special administrative region on China’s southern coast; it can also describe things related to Hong Kong.","zh":"Hong Kong 指中国南部沿海的重要城市与特别行政区；也可作形容词表示“香港的/与香港有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major city and Special Administrative Region (SAR) on China’s southern coast, known as an international financial center and a place where Cantonese and English are widely used","zh":"中国南部沿海的国际大都市与特别行政区（简称“特区”），以国际金融中心著称，粤语和英语都很常见"},"examples":[{"en":"My aunt lives in Hong Kong, so we visit every summer.","zh":"我阿姨住在香港，所以我们每年夏天都会去看她。"},{"en":"Hong Kong is famous for its skyline and busy harbor.","zh":"香港以天际线和繁忙的海港闻名。"},{"en":"He works for a Hong Kong company.","zh":"他在一家香港公司工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"used as an adjective to describe something from or related to Hong Kong","zh":"作形容词用，表示“香港的；与香港有关的”"},"examples":[{"en":"We tried Hong Kong–style milk tea.","zh":"我们尝了港式奶茶。"},{"en":"She follows Hong Kong news closely.","zh":"她很关注香港新闻。"}]}],"synonyms":["H.K. (informal abbreviation)"],"phonetic":"/hɑŋ kɑŋ/","extraExplanation":["“Hong Kong”字面意思常被解释为“Fragrant Harbor（香港/香港）”。粤语读音接近“Heung Gong”。在日常英文里，它既可指地点（名词），也常作定语修饰名词（如Hong Kong cinema 香港电影、Hong Kong dollars 港币）。"]}
{"word":"Maior","summary":{"en":"“Maior” is mainly Portuguese (and sometimes Latin): it means “bigger/greater,” and can also mean “older/senior.” It’s not a standard English word.","zh":"“Maior”主要是葡萄牙语（有时也见于拉丁语），意思是“更大/更伟大”，也可表示“年长/资深”。它不是标准英语词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Portuguese) bigger; greater; older; senior (comparative form, often used with nouns like “irmão maior” = older brother).","zh":"（葡萄牙语）更大；更高；更年长；资深的（比较级形式，常与名词搭配，如“irmão maior”=哥哥/年长的兄弟）。"},"examples":[{"en":"My Portuguese friend said “maior” means “bigger,” as in “uma casa maior” (a bigger house).","zh":"我的葡萄牙朋友说“maior”意思是“更大”，比如“uma casa maior”（更大的房子）。"},{"en":"In “irmã maior,” “maior” means “older/senior,” not necessarily physically bigger.","zh":"在“irmã maior”里，“maior”表示“年长/资深”，不一定指体型更大。"}]},{"partOfSpeech":"other","definition":{"en":"(Latin, mainly in mottos/academic contexts) greater; larger; the greater part (comparative of “magnus” = great).","zh":"（拉丁语，多见于格言/学术语境）更大；更伟大；较大的一部分（“magnus”=伟大的 的比较级）。"},"examples":[{"en":"You may see “maior” in Latin mottos, where it can be understood as “greater.”","zh":"你可能会在拉丁语格言里看到“maior”，通常可理解为“更伟大/更大”。"}]}],"synonyms":["bigger","larger","greater","older","elder"],"phonetic":"/maɪˈɔr/","extraExplanation":["“Maior”不是常见英语单词；它最常见于葡萄牙语/拉丁语。如果你想表达英语“更大/更重要”，常用 bigger / larger / greater；表达“年长的”常用 older / elder；表达“更重要的”常用 more important。","注意与英语 major（主要的）不同：major来自拉丁语同源词，但英语里写作 major，不写 maior。"]}
{"word":"maior","summary":{"en":"“Maior” is mainly a Portuguese word meaning “bigger/greater,” and it can also mean “older” in family context.","zh":"“maior”主要是葡语词，意思是“更大/更重要”，在家庭语境里也可表示“更年长（如哥哥/姐姐）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Portuguese) bigger; greater; larger; major (the comparative form of “grande,” meaning “big/great”).","zh":"（葡语）更大；更伟大；更大规模的；主要的（是“grande/大”的比较级，相当于“更大/更重要”）。"},"examples":[{"en":"In Portuguese, “maior” means “bigger” or “greater.”","zh":"在葡语里，“maior”表示“更大”或“更伟大/更重要”。"},{"en":"Ele é o irmão maior. (He is the older brother.)","zh":"Ele é o irmão maior.（他是哥哥。）"},{"en":"Precisamos de uma casa maior. (We need a bigger house.)","zh":"Precisamos de uma casa maior.（我们需要一间更大的房子。）"}]},{"partOfSpeech":"other","definition":{"en":"(Latin, less common in English text) “greater,” used as the comparative of “magnus” (“great”).","zh":"（拉丁语，在英文文本中较少见）“更大/更伟大”，是 magnus（伟大/大）的比较级。"},"examples":[{"en":"Some academic or historical writing may quote Latin forms like “maior.”","zh":"一些学术或历史写作会引用拉丁词形，例如“maior”。"}]}],"synonyms":["bigger","larger","greater","older","major"],"phonetic":"/maɪˈɔr/","extraExplanation":["“maior”在葡语里用途很广：既可以表示“更大/更重要”，也常用于年龄或辈分上的“更年长”（如“irmão maior”=哥哥/更年长的兄弟）。具体含义通常要看上下文。","如果你是在英语文章里看到“maior”，它往往是引用葡语/拉丁语原文，而不是英语单词。英语里更常用的对应词是 bigger / larger / greater / older / major（视语境而定）。"]}
{"word":"maipure","summary":{"en":"“maipure” is not a standard English word; it is likely a name/brand or a misspelling.","zh":"“maipure”不是标准英语词；更可能是名称/品牌或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a brand, username, or product name) or a misspelling of another word.","zh":"不是标准英语单词。更可能是专有名称（如品牌名、用户名、产品名）或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “maipure” in an English dictionary; it may be a brand name.","zh":"我在英语词典里找不到“maipure”；它可能是一个品牌名。"},{"en":"If you meant “impure,” the spelling is different and the meaning changes.","zh":"如果你想写的是“impure（不纯的）”，拼写不同，意思也会变。"}]}],"phonetic":"/ˈmaɪ pjʊr/","extraExplanation":["“maipure”看起来像把两个部分拼在一起（如“mai”+“pure”），但英语里并没有常见词条是这个拼法。你可以告诉我它出现的句子或语境（例如广告、产品包装、聊天内容），我可以更准确判断它的意思。","如果你本来想查的是这些更常见的词，也可以直接回复我：\n- impure（不纯的、不洁的）\n- pure（纯的）\n- my pure（口语里可能表示“我的纯净/纯粹的……”，但不算固定搭配）"]}
{"word":"mair","summary":{"en":"Mair is mainly a Scottish/archaic word meaning “mayor,” and it can also mean an old town officer who carried out official orders; it is also used as a surname.","zh":"Mair 主要是苏格兰方言/古用词，常指“市长”，也可指旧时执行官方命令的城镇官员；此外也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect/archaic) A mayor (the chief official of a town/city).","zh":"（苏格兰方言/古用）市长；城镇的首席官员。"},"examples":[{"en":"In some older Scottish records, the mair was responsible for local decisions and order.","zh":"在一些较早的苏格兰档案中，mair 负责地方决策与治安。"},{"en":"He served as mair of the burgh for several years.","zh":"他担任该自治镇（burgh）的市长（mair）好几年。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, archaic) A town officer who carried out official orders; a kind of messenger or minor legal officer (similar to a bailiff).","zh":"（苏格兰古用）执行公文命令的城镇官员；类似“执达吏/差役”的角色。"},"examples":[{"en":"The mair delivered the summons to the household.","zh":"mair 把传票送到那户人家。"},{"en":"In the old court system, a mair might enforce small legal orders.","zh":"在旧时的法院体系里，mair 可能负责执行一些小型的法律命令。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏（人名）。"},"examples":[{"en":"Her last name is Mair.","zh":"她的姓是 Mair。"}]}],"synonyms":["mayor (for the main meaning)","town officer (contextual)","bailiff (approximate, historical context)"],"phonetic":"/mɛr/","extraExplanation":["“mair”常见于苏格兰英语（Scots）与历史文献中，是“mayor”的方言形式之一；在现代标准英语里通常不用，更多会看到“mayor”。","在苏格兰旧式行政/司法语境里，“mair”也可指协助执行命令的官员，含义会随时代与地区而变化。"]}
{"word":"mairatour","summary":{"en":"“mairatour” is not a standard English word; it’s likely a name/brand and needs context.","zh":"“mairatour”不是标准英语词，可能是名称/品牌，需要语境确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a proper name or brand/username (possibly “Maira Tour” = a tour service or a person named Maira connected with travel). Meaning depends on context.","zh":"不是标准英语单词。看起来像专有名词、品牌名或用户名（可能是“Maira Tour”，表示旅游服务，或与名为 Maira 的人相关的旅行/行程）。具体含义取决于语境。"},"examples":[{"en":"I couldn’t find “mairatour” in an English dictionary—could it be the name of a travel company?","zh":"我在英语词典里查不到“mairatour”——它会不会是一家旅游公司的名字？"},{"en":"If you mean “Maira Tour,” you can write it as two words and capitalize it like a name.","zh":"如果你指的是“Maira Tour”，可以分成两个词，并像名字一样首字母大写。"}]}],"phonetic":"ˈmaɪrəˌtʊr","extraExplanation":["如果你能提供一句包含“mairatour”的原句、它出现的平台（网站/地图/社交媒体）、或你想表达的意思（例如“旅游/导览/行程”），我可以帮你判断它是拼写错误、专有名词，还是由两个词组合而成。","常见的可能：\n1) 拼写或空格问题：例如 “Maira tour / Maira Tours”。\n2) 人名+词：Maira（人名）+ tour（旅行/巡演）。\n3) 品牌/账号：旅行社、导游服务、YouTube/IG 账号等。"]}
{"word":"maire","summary":{"en":"Maire means “mayor,” mainly used when referring to French-speaking places.","zh":"Maire 指“市长”，主要用于谈论法语地区时的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in French-speaking places) the mayor of a town or city; the head of a local government.","zh":"（尤指法语地区）市长；地方政府首长。"},"examples":[{"en":"The maire met with residents to discuss the new housing plan.","zh":"市长与居民会面，讨论新的住房计划。"},{"en":"In many French towns, the maire works from the town hall.","zh":"在许多法国城镇，市长在市政厅办公。"}]}],"synonyms":["mayor","town mayor"],"phonetic":"/mɛr/","extraExplanation":["“maire”是法语词（法语里相当于英语的“mayor”）。在英语语境中，它多出现在谈论法国或魁北克等法语区的政治与行政时，用来保持当地称呼。发音在法语里更接近“mɛʁ”，但英语借用时常读作更接近“mare/mehr”的音。"]}
{"word":"Maireana","summary":{"en":"an Australian genus of hardy salt-tolerant shrubs","zh":"澳大利亚的一类耐旱耐盐灌木属"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Australian shrubs and small plants (in the amaranth/saltbush family), many species adapted to dry, salty soils and common in arid rangelands","zh":"一种澳大利亚植物属（苋科/盐生灌木类群），多为耐旱、耐盐的小灌木或草本，常见于干旱荒漠与牧场地带"},"examples":[{"en":"Maireana species are often planted for land rehabilitation in dry, saline areas.","zh":"Maireana 属的植物常用于干旱、盐渍化地区的生态修复。"},{"en":"After heavy grazing, some Maireana shrubs can help stabilize the soil.","zh":"在过度放牧之后，一些 Maireana 灌木能帮助稳定土壤。"}]}],"synonyms":["bluebush","saltbush"],"phonetic":"/ˌmɛriˈænə/","extraExplanation":["发音与用法：作为植物属名，写作首字母大写（Maireana）。在科学写作中，常用斜体表示属名（Maireana），具体物种则是“属名 + 种加词”，如 Maireana sedifolia。","常见俗名：该属中的一些物种在澳大利亚英语里会被叫作 bluebush（蓝灌木）或 saltbush（盐灌木/盐生灌木），但这些俗名也可能指其他近缘属，因此在需要精确时用学名更清楚。"],"etymology":"属名“Maïreana / Maireana”是植物学拉丁名，常见解释为纪念法国植物学家 René Maire（雷内·梅尔）；该属主要分布在澳大利亚干旱区。","mnemonic":["可把它联想成“mare（马）+ -ana（像……的）”：想象“在荒漠盐碱地里也能生长的‘马吃的灌木’”，帮助记住它和澳洲干旱牧场环境有关。"]}
{"word":"mairie","summary":{"en":"“Mairie” means the town hall or mayor’s office in French.","zh":"“mairie”在法语中指市政厅或市长办公室（市政府）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) the town hall; the mayor’s office (the municipal government building or administration).","zh":"（法语）市政厅；市长办公室（市政府的办公建筑或行政机构）。"},"examples":[{"en":"We went to the mairie to register our new address.","zh":"我们去市政厅登记新地址。"},{"en":"The wedding ceremony will be held at the mairie.","zh":"婚礼仪式将在市政厅举行。"},{"en":"You can ask at the mairie about local services and permits.","zh":"你可以在市政厅咨询本地服务和许可手续。"}]}],"synonyms":["town hall","city hall","mayor’s office","municipal hall"],"phonetic":"/mɛˈriː/","extraExplanation":["“mairie”是法语词，在法国日常生活中非常常见：既可指“市政厅这栋建筑”，也常指“市政府/市长办公室这一行政单位”。在法国办理结婚登记、户籍/住址变更、申请部分证明或了解市政服务等，常需要去mairie。","英语里更常用的对应说法是“town hall”或“city hall”。在旅游或在法语语境中，英语写作也会直接保留法语词“mairie”。"]}
{"word":"mairs","summary":{"en":"“Mairs” is the plural of “mair,” an old Scottish word for a local official (mayor/magistrate-type figure).","zh":"“Mairs”是“mair”的复数，是较旧的苏格兰用语，指地方官员（类似市长/地方法官一类的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mair: a Scottish term for a local official (similar to a mayor, magistrate, or town officer), especially in older or literary use.","zh":"mair 的复数：苏格兰用语，指地方官员（类似市长、地方法官或城镇官吏），多见于较旧或文学语境。"},"examples":[{"en":"In older Scottish records, the mairs enforced local orders and collected fines.","zh":"在较早的苏格兰档案中，mairs 负责执行地方命令并收取罚金。"},{"en":"The novel mentions the mairs of the burgh as respected figures in the community.","zh":"小说里提到该自治镇（burgh）的 mairs，是社区中受人敬重的人物。"}]}],"synonyms":["mayors","magistrates","local officials"],"phonetic":"/mɛrz/","extraExplanation":["“mair”是苏格兰英语/苏格兰语（Scots）里的词，常出现在历史文献或描写苏格兰社会的文学作品中。现代日常英语里更常用“mayor”（市长）或更具体的官职名称。","很多学习者会把“mairs”误看成“mares”（母马的复数）。如果你原本想查的是“mares”，告诉我语境我可以一起对比讲解。"]}
{"word":"maison","summary":{"en":"Maison is a French word meaning “house,” and in English it often refers to a fashion/luxury “house” or appears in brand and restaurant names.","zh":"Maison 源自法语，意为“房子/家”；在英语里常指时装屋/奢侈品牌“某某之家”，也常出现在品牌或餐厅名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a house; a home.","zh":"（法语借词）房子；家。"},"examples":[{"en":"They rented a small maison near the beach.","zh":"他们在海边租了一间小房子。"},{"en":"In the village, every maison had a little garden.","zh":"在那个村子里，每一户人家都有一个小花园。"}]},{"partOfSpeech":"n.","definition":{"en":"a company or brand—especially in fashion, luxury goods, or food—often used in names meaning “house” (e.g., a fashion house).","zh":"（尤用于品牌名称）公司/品牌的“某某之家”；（尤指）时装屋、奢侈品牌或餐饮品牌。"},"examples":[{"en":"She dreams of working for a famous French maison.","zh":"她梦想为一家著名的法国时装屋工作。"},{"en":"The perfume was launched by a historic maison.","zh":"这款香水由一家历史悠久的品牌推出。"}]},{"partOfSpeech":"n.","definition":{"en":"a restaurant or food business that uses “Maison” in its name to suggest a traditional, house-made style.","zh":"（用于店名）“Maison + 名称”的餐厅/食品店，暗示“自家制作、传统风格”。"},"examples":[{"en":"Let’s try the bakery called Maison Pierre.","zh":"我们去试试那家叫 Maison Pierre 的面包店吧。"},{"en":"The menu highlights maison-style desserts.","zh":"菜单主打“自家风格”的甜点。"}]}],"synonyms":["house","home","fashion house","brand","label"],"phonetic":"/meɪˈzɑn/","extraExplanation":["“maison”在法语里最基本就是“房子/家”。在英语环境中，它常以法语原形出现，尤其在时尚与奢侈品行业：用“maison”来表达“品牌之屋/工坊传统”，带一点法式格调与历史感。","发音上，英语里通常会英语化读音，不必完全按法语鼻音读；日常交流中只要清晰即可。"]}
{"word":"maisonette","summary":{"en":"A maisonette is a small house or, especially in the UK, a two-story apartment with its own entrance.","zh":"maisonette 指小房子；尤其在英国常指带独立入口的复式（两层）公寓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small house, or (more commonly in British English) a two-level apartment with its own private entrance, often within a larger building.","zh":"小房子；（更常见于英式英语）带独立入口的复式公寓（通常在一栋大楼里）。"},"examples":[{"en":"They rented a maisonette with a private front door and two floors.","zh":"他们租了一套带独立前门、上下两层的复式公寓。"},{"en":"The maisonette has the living room downstairs and the bedrooms upstairs.","zh":"这套复式公寓客厅在楼下，卧室在楼上。"},{"en":"In some listings, a “maisonette” feels more like a small house than a typical apartment.","zh":"在一些房源里，“maisonette”更像小房子，而不像普通公寓。"}]}],"synonyms":["duplex (approx.)","two-story apartment","townhouse (approx.)","small house"],"phonetic":"/ˌmeɪ.zəˈnɛt/","extraExplanation":["“Maisonette”来自法语“maison”（房子）加上表示“小”的词尾，字面意思接近“小房子”。","在房地产语境中，它常用来强调“独立入口”和“上下两层”的居住结构；美式英语里相近的说法可能是“duplex”或“townhouse”，但不完全等同。"]}
{"word":"maisonettes","summary":{"en":"“Maisonettes” is the plural of “maisonette”: a small house or (especially in the UK) a two-level apartment, often with its own entrance.","zh":"“maisonettes”是“maisonette”的复数：指小住宅；尤指英国常见的带独立入口、通常上下两层的复式公寓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small house or (especially in the UK) an apartment that often has two floors and its own private entrance","zh":"（小）住宅；（尤指英国）复式公寓/连层公寓，常有独立入口"},"examples":[{"en":"They bought a two-bedroom maisonette near the station.","zh":"他们在车站附近买了一套两居室的复式公寓。"},{"en":"The maisonette has the living room downstairs and the bedrooms upstairs.","zh":"这套复式公寓的客厅在楼下，卧室在楼上。"},{"en":"In London, renting a maisonette can be cheaper than a full house.","zh":"在伦敦，租一套复式公寓有时比整栋房子更便宜。"}]}],"synonyms":["duplex apartment","townhouse","two-level apartment","flat (UK)","apartment"],"phonetic":"/ˌmeɪzəˈnɛt/","extraExplanation":["“maisonette”来自法语“maison”（房子），后缀“-ette”有“小、较小”的意思，所以字面上有“小房子/小住宅”的感觉。","在英式英语里，“maisonette”常指带独立入口、可能分上下两层的公寓（类似“复式”），而在美式英语中更常说“duplex apartment / townhouse / apartment with a private entrance”等，具体用词取决于房屋类型。"]}
{"word":"maist","summary":{"en":"“Maist” is a Scots/archaic form meaning “most” or sometimes “almost.”","zh":"“maist”是苏格兰英语/古语形式，意思多为“most（大多数/最多）”，有时也表示“almost（几乎）”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"(Scots/archaic) Most; the greatest part or number.","zh":"（苏格兰英语/古语）大多数；最多的部分或数量。"},"examples":[{"en":"Maist folk in the village knew each other.","zh":"村里大多数人彼此都认识。"},{"en":"He spent maist of his money on travel.","zh":"他把大部分钱花在旅行上了。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Scots/archaic) Almost; nearly.","zh":"（苏格兰英语/古语）几乎；差不多。"},"examples":[{"en":"I was maist ready to leave when you called.","zh":"你打电话时，我几乎就准备离开了。"},{"en":"The cup was maist full.","zh":"杯子几乎满了。"}]}],"synonyms":["most","almost","nearly","the majority of"],"phonetic":"/meɪst/","extraExplanation":["“maist”常见于苏格兰英语（Scots）以及较早期的英语书写中，相当于现代英语的“most / almost”。","在文学里，苏格兰诗人罗伯特·彭斯（Robert Burns）的作品中常能见到“maist”，用来呈现口语与地方风格。阅读时可直接按“most/almost”理解。"]}
{"word":"maister","summary":{"en":"“Maister” is an archaic (often Scots) spelling of “master.”","zh":"“maister”是“master”的古老拼写（常见于苏格兰英语/旧文献）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/Scots spelling) a master; a man who has authority, control, or high skill, or the head/owner of a household or workplace.","zh":"（古语/苏格兰拼写）“master”的旧拼法：主人、师傅、掌控者；也可指家庭或作坊/工作的负责人。"},"examples":[{"en":"In old letters, you may see “maister” where modern English uses “master.”","zh":"在旧信件里，你可能会看到“maister”，现代英语对应写作“master”。"},{"en":"The apprentice promised to obey his maister and learn the craft.","zh":"学徒承诺服从他的师傅，并学习这门手艺。"},{"en":"“Maister” is common in Scots writing, especially in older texts.","zh":"“Maister”在苏格兰英语写作中较常见，尤其在较早的文本里。"}]}],"synonyms":["master","chief","head","boss","teacher"],"phonetic":"/ˈmæstər/","extraExplanation":["“Maister”多见于中古英语/近代早期英语的拼写变体，以及苏格兰英语（Scots）。现代标准英语通常不用这种拼写；阅读文学或历史文献时把它当作“master”理解即可。","在文学中，苏格兰诗人罗伯特·彭斯（Robert Burns）等人的作品里常能见到“Maister”，带有地域与时代色彩。"]}
{"word":"maistre","summary":{"en":"“Maistre” is an archaic spelling of “master,” meaning a master/teacher or a respectful title in older texts.","zh":"“maistre”是“master”的古拼写，在旧文本中指主人/师傅/大师或一种尊称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic spelling) A master; a person who has authority, control, or high skill, or someone addressed as “Master.”","zh":"（古拼写）“master”的旧拼法；指主人、师傅/大师，或对某人的尊称“Master（先生/少爷）”。"},"examples":[{"en":"In old texts, “maistre” often means the same as “master.”","zh":"在古文献中，“maistre”常与“master”同义。"},{"en":"The apprentice served his maistre for seven years.","zh":"学徒为他的师傅（maistre）服务了七年。"},{"en":"They called him maistre John out of respect.","zh":"他们出于尊敬称他为“约翰先生（maistre John）”。"}]}],"synonyms":["master","teacher","mentor","sir","mister (historical/related)"],"phonetic":"/ˈmeɪstər/","extraExplanation":["“maistre”常见于中古英语（Middle English）或受法语影响的早期英语文本中，是“master”的旧式拼写；在现代英语中通常不再这样拼写。","在历史语境里，它既可能指“手艺师傅/行会师傅”，也可能是对受过教育或有地位者的称呼；具体要看上下文。","阅读古文时可把它先对应成现代英语的“master”，再根据语境判断是“主人/雇主”“师傅/导师”还是“尊称”。"]}
{"word":"maistres","summary":{"en":"“Maistres” is an old or dialect spelling of “masters.”","zh":"“maistres”是“masters”的古体或方言拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An archaic or dialect spelling of “masters” (plural of “master”), meaning people who have authority, high skill, or control (historically also: owners/employers).","zh":"“masters”的古体或方言拼写（“master”的复数），指有权威的人、技艺高超的人或掌控局面的人（历史上也可指雇主/主人）。"},"examples":[{"en":"The apprentices obeyed their maistres and followed the rules of the guild.","zh":"学徒服从他们的“maistres”（师傅/行会里的师长），并遵守行会的规矩。"},{"en":"In old texts, you may see maistres where modern English uses masters.","zh":"在古老文本里，你可能会看到“maistres”，而现代英语会写作“masters”。"}]}],"synonyms":["masters","experts","teachers","leaders"],"phonetic":"/ˈmæstərz/","extraExplanation":["“maistres”常见于中古英语/早期现代英语拼写，或苏格兰英语（Scots）等地区性写法；当时英语拼写尚未完全标准化。","在历史语境里，“master(s)”有时与阶层关系有关（如“主人/雇主”对“仆人/学徒”），现代使用时更常指“师傅、专家、掌控者”，语感更中性。"]}
{"word":"maistresse","summary":{"en":"“Maistresse” is an old spelling of “mistress,” meaning a woman who leads or has authority (often in a household), and sometimes a lover outside marriage.","zh":"“maistresse”是“mistress”的古拼写，可指女主人/掌权女性，也可指婚外情的情妇，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An archaic spelling of “mistress,” meaning a woman who has authority or control (especially over a household or servants).","zh":"“mistress（女主人/主母）”的古拼写形式，指掌管家庭或仆役、拥有权威与管理权的女性。"},"examples":[{"en":"In old texts, “maistresse” often refers to the lady of the house.","zh":"在古文献中，“maistresse”常指家中的女主人。"},{"en":"The servants waited for their maistresse to give instructions.","zh":"仆人们等着女主人下达指示。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman in a position of power or leadership (for example, an older use meaning a female teacher or a woman who directs others).","zh":"有权力或领导地位的女性（较旧用法，如指女教师或指挥他人的女性）。"},"examples":[{"en":"She was called a maistresse of the school in the older record.","zh":"在较早的记录里，她被称为学校的女教师（maistresse）。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman with whom someone (especially a married man) has a romantic or sexual relationship outside marriage; a lover.","zh":"（尤指已婚男性的）婚外情对象；情妇。"},"examples":[{"en":"Some historical writings use “maistresse” for a man’s lover.","zh":"一些历史文本会用“maistresse”指男性的情妇。"},{"en":"The play hints that he kept a secret maistresse.","zh":"剧中暗示他有一位秘密情妇。"}]}],"synonyms":["mistress","lady of the house","female head (of household)","paramour","lover"],"phonetic":"/ˈmɪstrəs/","extraExplanation":["“maistresse”是中古/早期近代英语里常见的拼写变体，后来逐渐固定为“mistress”。阅读莎士比亚、早期书信或古籍时会遇到这种拼法；现代英语写作中通常不用。","“mistress”在现代语境里常让人先联想到“情妇”，但在较早语境中更常见的是“女主人/主母”“女教师/女主管”等中性或带尊称的含义；理解时要根据时代与上下文判断。"]}
{"word":"maistry","summary":{"en":"“Maistry” is a Scots/archaic form of “mastery,” meaning great skill or control/dominance.","zh":"“maistry”是“mastery”的苏格兰英语/古语拼写，意思是“精通、技艺高超”或“控制、占上风”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots / archaic) mastery; great skill, or control over something or someone.","zh":"（苏格兰英语 / 古语）精通；高超技艺；对某事或某人的掌控、支配。"},"examples":[{"en":"She showed maistry in the kitchen, turning simple food into something special.","zh":"她在厨房里展现出精湛的手艺，把普通食材做成了特别的美味。"},{"en":"He wanted maistry over his temper, not to be ruled by anger.","zh":"他想掌控自己的脾气，而不是被愤怒左右。"}]}],"synonyms":["mastery","skill","expertise","command","control","dominance"],"phonetic":"/ˈmeɪstri/","extraExplanation":["“maistry”多见于苏格兰英语（Scots）与较早期的文学/书面语，是“mastery”的变体拼写。现代标准英语里通常用“mastery”。","在一些语境中，它不仅指“技能上的精通”，也可指“占上风、压制对方”的意思（接近“dominance / upper hand”）。"]}
{"word":"maists","summary":{"en":"“Maists” is likely a dialect form related to Scots “maist,” meaning “most” (and sometimes “almost” in dialect writing).","zh":"“maists”很可能与苏格兰方言“maist”有关，意思接近“most（最/最多）”，在部分方言写法中也可表达“almost（几乎）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a Scots and northern English form of “most” (used as an adjective or adverb).","zh":"苏格兰英语及英格兰北部方言中“most（最/最多）”的写法与用法（可作形容词或副词）。"},"examples":[{"en":"In Scots, you might hear: “That’s the maist important thing.”","zh":"在苏格兰英语里，你可能会听到：“That’s the maist important thing.”（那是最重要的事。）"},{"en":"“I maist forgot!” means “I almost forgot!” in some dialect writing.","zh":"在一些方言写法中，“I maist forgot!” 表示 “I almost forgot!”（我差点忘了！）。"}]},{"partOfSpeech":"adv.","definition":{"en":"used to mean “most; to the greatest degree/extent” (Scots/northern dialect).","zh":"表示“最；在最大程度上”（苏格兰/北部方言用法）。"},"examples":[{"en":"He was the maist tired after the long walk.","zh":"走了很长一段路后，他最累。"},{"en":"She sings the maist beautifully in the group.","zh":"在这个团体里，她唱得最动听。"}]},{"partOfSpeech":"n.","definition":{"en":"plural form sometimes seen in dialect writing (meaning “most things/people,” or “the majority,” depending on context).","zh":"在方言写作中偶尔见到的复数形式（“多数/大多数的人或事”，具体看语境）。"},"examples":[{"en":"“The maists o’ them” can mean “most of them” in Scots-style writing.","zh":"在苏格兰风格写法中，“The maists o’ them” 可以表示 “most of them”（他们大多数）。"}]}],"synonyms":["most","almost (dialect sense)","the majority (context-dependent)"],"phonetic":"/meɪst/","extraExplanation":["“maist”主要出现在苏格兰语（Scots）或带方言色彩的文学/对白中，标准英语里一般用“most”或“almost”。","你输入的“maists”更常见的情况是：要么是把“maist”写成了复数/强调形式（方言写法），要么是拼写错误。若你本来想查的是“waists（腰）”或“masts（桅杆）”，告诉我上下文句子我可以帮你确认。"]}
{"word":"maithili","summary":{"en":"Maithili is a major language of the Mithila region in India and Nepal; it can also describe the people and culture connected to that region.","zh":"Maithili（迈蒂利）指印度与尼泊尔米提拉地区的重要语言，也可作形容词描述该地区相关的族群与文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a language spoken mainly in the Mithila region of northern India (especially Bihar and Jharkhand) and parts of Nepal","zh":"一种主要在印度北部米提拉（Mithila）地区（尤以比哈尔邦、贾坎德邦）以及尼泊尔部分地区使用的语言（迈蒂利语）"},"examples":[{"en":"Maithili is spoken by millions of people in India and Nepal.","zh":"迈蒂利语在印度和尼泊尔有数以百万计的使用者。"},{"en":"She is learning Maithili to talk with her grandparents.","zh":"她在学迈蒂利语，好和祖父母交流。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Maithili language, or to the Maithil people/culture of the Mithila region","zh":"与迈蒂利语有关的；或与米提拉地区的迈蒂尔（Maithil）族群/文化有关的"},"examples":[{"en":"He enjoys Maithili folk songs.","zh":"他喜欢迈蒂利民歌。"},{"en":"They attended a Maithili cultural festival.","zh":"他们参加了一个迈蒂利文化节。"}]}],"synonyms":["Maithili language","Tirhuta (script context)"],"phonetic":"/ˌmaɪˈtɪli/","extraExplanation":["“Maithili”源自“Mithila（米提拉）”，这是北印度一个具有悠久文化传统的区域名称。","书写方面：迈蒂利语过去常见“提拉胡塔字母（Tirhuta/Mithilakshar）”，现代多使用天城文（Devanagari），在尼泊尔也常见。","在印度，迈蒂利语被列入《印度宪法》第八附表（即被承认为重要的地区语言之一），因此在教育、媒体与公共事务中更常出现。"]}
{"word":"maithuna","summary":{"en":"Maithuna is a Sanskrit-based term meaning sexual union, especially in Tantric religious contexts where it may be literal or symbolic.","zh":"Maithuna 源自梵语，意为“交合/性交”，多用于怛特罗等宗教语境中，可能是字面或象征性的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu and Buddhist Tantra) sexual union or intercourse, sometimes used as a ritual or symbolic practice in specific religious traditions.","zh":"（印度教与佛教的密宗/怛特罗传统中）男女交合、性交；在某些宗教传统里也可指具有仪式性或象征意义的修行实践。"},"examples":[{"en":"In some Tantric traditions, maithuna is described as a practice with strict rules and a spiritual purpose.","zh":"在一些怛特罗传统中，maithuna 被描述为一种有严格规范、并具有修行目的的实践。"},{"en":"The scholar explained that maithuna can be understood literally or symbolically, depending on the text and lineage.","zh":"学者解释说，maithuna 可以按字面理解，也可以按象征意义理解，取决于典籍与传承。"}]}],"synonyms":["sexual union","intercourse","ritual sexual union"],"phonetic":"/maɪˈtuːnə/","extraExplanation":["该词源自梵语，常见于关于“怛特罗（Tantra）”的宗教与学术讨论中；在某些脉络里它被列为“五M（pañcamakāra）”之一。","在现代英语语境中使用时，通常带有强烈的宗教/文化特定含义，不等同于日常口语里的“sex”。写作或讨论时建议说明具体文本、传统或研究背景，以避免误解或刻板印象。"]}
{"word":"maitlandite","summary":{"en":"Maitlandite is an extremely rare mineral name used in mineralogy.","zh":"Maitlandite 是矿物学中使用的一个极其罕见的矿物名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very rare mineral name used in geology/mineralogy (a specific mineral species).","zh":"（地质/矿物学）一种非常罕见的矿物名称（指某一特定矿物种）。"},"examples":[{"en":"Maitlandite is listed as a rare mineral species in some mineral databases.","zh":"在一些矿物数据库中，maitlandite 被列为一种稀有矿物种。"},{"en":"The field report mentions maitlandite occurring in tiny grains.","zh":"野外报告提到 maitlandite 以极细小的颗粒产出。"}]}],"phonetic":"/ˈmeɪtləndˌaɪt/","extraExplanation":["“‑ite”是英文里常见的矿物后缀（如 calcite 方解石、hematite 赤铁矿），通常表示“某种矿物/岩石”。因此 maitlandite 多半是以人名或地名（Maitland）命名的专门术语。","该词非常冷僻，常见于专业论文、矿物目录或标本标签中；日常英语几乎不会用到。若你能提供出现它的句子或资料来源（论文/标本卡/网页），我可以进一步帮你确认它在该语境下对应的具体矿物信息。"]}
{"word":"maitre","summary":{"en":"“Maitre” is most commonly seen in “maître d’,” meaning the head waiter or dining-room manager in a restaurant.","zh":"“maitre”最常见于“maître d’”，指餐厅的领位/餐厅经理（负责接待与统筹服务）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in the phrase “maître d’”) the head waiter or dining-room manager in a restaurant, who greets guests and oversees service.","zh":"（多用于短语“maître d’”）餐厅的领位/餐厅经理（接待客人并负责统筹服务的人）。"},"examples":[{"en":"Please ask the maître d’ if we can get a table for two.","zh":"请问一下领位/餐厅经理，我们能不能要一张两人桌。"},{"en":"The maître d’ apologized and offered us a better table.","zh":"领位/餐厅经理道了歉，并给我们换了一张更好的桌子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common in English; from French) a master or teacher; a person with expert skill.","zh":"（英语中较少单独使用；源自法语）大师；导师；技艺精湛的人。"},"examples":[{"en":"In French, maître can mean “master” or “teacher.”","zh":"在法语里，maître 可以表示“主人/大师”或“老师”。"},{"en":"He trained under a maître of classical cuisine.","zh":"他在一位经典法餐大师门下学习。"}]}],"synonyms":["head waiter","host","dining-room manager","restaurant host"],"phonetic":"/ˌmeɪtər ˈdiː/","extraExplanation":["“maître”原本是法语词，带有长音符号（maître）。英语里常见于“maître d’”（maître d’hôtel 的缩写），口语中常把它当作一个整体来念。写作时有时会省略重音符号（maitre），但正式场合更常见带符号的 maître。"]}
{"word":"maitres","summary":{"en":"“Maitres” is an English spelling (often without accents) of the French plural “maîtres,” meaning “masters/experts,” and it can also refer to restaurant head staff from “maître d’.”","zh":"“maitres”常是不带重音的拼写形式，对应法语复数“maîtres”，意思是“大师/师傅/权威”；也可指餐厅的领班或接待主管（来自“maître d’”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French loanword; plural of maître) masters; people who are highly skilled or in charge, especially in an art, craft, or profession.","zh":"（法语外来词，maître 的复数）大师；师傅；（某领域）权威或负责人。"},"examples":[{"en":"The young chef trained under several French maîtres before opening his own restaurant.","zh":"这位年轻厨师在开自己的餐厅前，曾师从几位法国大师。"},{"en":"In the old guild system, apprentices learned from the maîtres of their trade.","zh":"在旧时的行会制度里，学徒从本行业的师傅那里学习。"}]},{"partOfSpeech":"n.","definition":{"en":"In hospitality, used to refer to head waiters/hosts (from maître d’, short for maître d’hôtel); sometimes written without accents as “maitres.”","zh":"（餐饮服务业）指领班/接待主管（来自 maître d’，是 maître d’hôtel 的简称）；有时不加重音写作 maitres。"},"examples":[{"en":"The maitres coordinated the seating during the busy dinner rush.","zh":"晚餐高峰期，领班们负责协调安排座位。"},{"en":"Ask the maître d’ for a quieter table if you prefer.","zh":"如果你想要安静一点的座位，可以问一下接待主管（maître d’）。"}]}],"synonyms":["masters","experts","authorities","maître d’s","head waiters"],"phonetic":"/ˈmeɪtrəz/","extraExplanation":["“maître”在法语里本义是“主人/师傅/大师”，对应的复数是“maîtres”。英语中常见于餐厅用语“maître d’（接待主管）”。在英文文本里，重音符号（ˆ）常被省略，所以你可能看到“maitres”。","发音上，英语里常按外来词的英语化读法来读；而在更正式或法语感更强的场合，有人会更接近法语发音。"]}
{"word":"maitresse","summary":{"en":"Maitresse (from French) is a rare English word meaning a man’s mistress or kept female lover, often in historical or literary contexts.","zh":"maitresse（源自法语）在英语中较少见，通常指“情妇/被包养的女性情人”，多用于历史或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare in English) a man’s mistress; a female lover, especially one kept in a long-term relationship outside marriage.","zh":"（英语中较少见）情妇；（尤指）被包养的女性情人，常指婚外长期关系中的女性。"},"examples":[{"en":"In the novel, the prince secretly supported a maîtresse in Paris.","zh":"在小说里，那位王子在巴黎暗中供养一位情妇。"},{"en":"The scandal centered on rumors that he had a maitresse at court.","zh":"丑闻的焦点是传言他在宫廷里有一位情妇。"}]}],"synonyms":["mistress","lover","paramour","kept woman"],"phonetic":"/mɛˈtrɛs/","extraExplanation":["这个词来自法语 **maîtresse**（带“^”的 â 表示历史上的拼写变化），在英语里多见于描写法国/贵族/宫廷背景的文学或历史语境，带有“法式、旧时代、暧昧而不正式”的语感。","注意语体与礼貌：现代英语日常交流中通常用 **mistress**（但也较敏感、可能带负面评价）或更中性的 **lover / partner**（视语境而定）。","法语里 **maîtresse** 还有“女主人、女教师”的意思；但在英语借用中，多数时候指“情妇”，别与“女老师”含义混用。"]}
{"word":"maitreya","summary":{"en":"Maitreya is the future Buddha in Buddhist tradition, expected to appear and teach again.","zh":"Maitreya（弥勒佛）是佛教传统中的未来佛，被认为将在未来降世并再次弘法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Buddhism, the Buddha of the future who is expected to appear on Earth, achieve enlightenment, and teach the Dharma again.","zh":"（佛教）弥勒佛：被认为将在未来降世、成佛并再次弘法的未来佛。"},"examples":[{"en":"Many Buddhist traditions honor Maitreya as the future Buddha who will renew the teachings.","zh":"许多佛教传统尊奉弥勒佛为将来会复兴佛法的未来佛。"},{"en":"In some temples, you may see a statue of Maitreya welcoming visitors with a calm smile.","zh":"在一些寺庙里，你可能会看到弥勒佛的塑像以平和的微笑迎接来访者。"},{"en":"The story of Maitreya often appears in texts and art across Asia.","zh":"弥勒佛的故事常见于亚洲各地的典籍与艺术作品中。"}]}],"synonyms":["Maitreya Buddha","the Future Buddha"],"phonetic":"/maɪˈtreɪə/","extraExplanation":["“Maitreya”来自梵语 *Maitreya*，与“慈爱、友善”（*maitrī*）相关，因此中文常译作“弥勒”，也常与“慈、友爱”的意涵相连。","不同文化中的弥勒形象可能不一样：在东亚民间常见“大肚弥勒（布袋和尚形象）”的笑佛造型，但在更广泛的佛教传统里，“弥勒”也可呈现为菩萨或未来佛的庄严形象。","英语里它是专有名词，通常首字母大写：Maitreya。常见搭配有 “Maitreya Buddha（弥勒佛）”、“the future Buddha（未来佛）”。"]}
{"word":"maitrise","summary":{"en":"maîtrise (often written “maitrise”) means “mastery/control,” and can also mean a French-style master’s degree.","zh":"maîtrise（常写作 maitrise）意为“精通/掌控”，也可指法语体系中的“硕士学位”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"mastery; strong skill and control over a subject, activity, or situation","zh":"精通；熟练掌握；对某个领域/活动/局面的良好控制"},"examples":[{"en":"She showed real maîtrise of the piano after years of practice.","zh":"经过多年的练习，她在钢琴方面展现出真正的精通。"},{"en":"In a crisis, his calm maîtrise helped the team make good decisions.","zh":"在危机中，他冷静的掌控力帮助团队做出正确决定。"}]},{"partOfSpeech":"n.","definition":{"en":"(France/Francophone education) a master’s degree","zh":"（法国/法语教育体系）硕士学位"},"examples":[{"en":"He completed a maîtrise in economics before starting work.","zh":"他在开始工作前完成了经济学硕士学位。"}]}],"synonyms":["mastery","command","control","proficiency"],"phonetic":"/mɛˈtriːz/","extraExplanation":["“maitrise”通常写作带抑扬符的法语形式“maîtrise”。英语文章里有时会保留法语拼写，用来强调一种“优雅、从容的掌控/熟练”。","在法语里它来自动词“maîtriser”（掌握、控制）。如果你在英语学习中看到它，多半相当于 mastery / command / control。","第二个含义（法国学位）在不同国家的学制对照不完全一致：它大致对应“硕士层级”，但具体年限与结构会因年代与学校而不同。"]}
{"word":"maius","summary":{"en":"“Maius” is Latin for the month of May, used mainly in historical or scholarly contexts.","zh":"“Maius”是拉丁语“五月”，多用于历史或学术语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) May; the month of May in the Roman calendar.","zh":"（拉丁语）五月；罗马历中的五月。"},"examples":[{"en":"In the manuscript, the date is written as “Maius 12.”","zh":"在这份手稿里，日期写作“Maius 12”（5月12日）。"},{"en":"The festival was held in Maius, when spring was turning to summer.","zh":"节庆在Maius（五月）举行，当时春天正转向夏天。"}]},{"partOfSpeech":"other","definition":{"en":"A Latin word used in mottos, scholarly writing, or historical contexts to refer to May.","zh":"在格言、学术写作或历史语境中用来指“五月”的拉丁词。"},"examples":[{"en":"Some university seals include month names like Maius in Latin.","zh":"一些大学的印章上会用拉丁语写月份名，比如Maius。"},{"en":"The letter is dated “Kalendis Maiis,” meaning ‘on the first day of May.’","zh":"这封信的日期写作“Kalendis Maiis”，意思是“五月初一”。"}]}],"synonyms":["May","(Latin) Maius mensis"],"phonetic":"/ˈmaɪ.ʌs/","extraExplanation":["“Maius”源自罗马神祇或人格化概念“Maia”（玛亚），与生长、繁盛相关；因此五月在古罗马文化中常与春末的生机联系在一起。","在罗马历法里常见的表达还有“Kalendae”（月初/一日）、“Nonae”（五日或七日）、“Idus”（十三日或十五日）。你可能会看到如“Idibus Maiis”（五月十五日）这类写法。"]}
{"word":"maize","summary":{"en":"Maize means corn—the plant and its kernels used for food and animal feed.","zh":"Maize 指“玉米”，包括这种作物及其玉米粒，可供人食用或作饲料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Corn; a tall cereal plant that produces large yellow (or sometimes white) kernels on a cob, used as food for people and animals.","zh":"玉米；一种高大的谷物作物，结出玉米棒上的玉米粒（常见为黄色，也有白色），供人和动物食用。"},"examples":[{"en":"In many countries, maize is a staple food used to make porridge or flatbread.","zh":"在许多国家，玉米是主食，用来做粥或烙饼。"},{"en":"The farmers planted maize in spring and harvested it in late summer.","zh":"农民在春天播种玉米，在夏末收获。"},{"en":"Maize kernels can be ground into flour for tortillas and other dishes.","zh":"玉米粒可以磨成粉，用来做玉米饼等食物。"}]}],"synonyms":["corn"],"phonetic":"/meɪz/","extraExplanation":["“maize”在英式英语和学术/农业语境中更常见；在美式日常口语里通常直接说“corn”。在一些地区“corn”历史上也可泛指“谷物”，所以需要强调特指玉米时会用“maize”。","词源来自西班牙语“maíz”，源头与加勒比地区泰诺语有关；玉米原产于美洲，后来传播到世界各地，成为重要粮食与饲料作物。","常见搭配：maize field（玉米地）、maize flour/meal（玉米粉/玉米面）、sweetcorn（甜玉米，英式常用）、popcorn（爆米花）。"]}
{"word":"maize-based","summary":{"en":"made mainly from corn","zh":"主要由玉米制成的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made from, using, or mainly containing maize (corn) as the main ingredient or source material","zh":"以玉米为主要原料制成的；以玉米为主要来源的"},"examples":[{"en":"Many tortillas are made from maize-based dough.","zh":"很多玉米饼是用玉米为主的面团做的。"},{"en":"The company developed a maize-based sweetener for drinks.","zh":"这家公司开发了一种以玉米为原料的饮料甜味剂。"},{"en":"They tested a maize-based biofuel to reduce oil use.","zh":"他们测试了一种玉米基生物燃料来减少石油使用。"}]}],"synonyms":["corn-based","corn-derived","maize-derived","corn-fed","corn-centered"],"phonetic":"/ˈmeɪz ˌbeɪst/","extraExplanation":["在美式英语里，maize和corn都可指“玉米”，但日常生活中更常说corn；maize更常见于更正式、农业或国际语境（例如作物、研究、食品工业）。","“-based”常用于描述原料或来源：plant-based（植物基）、soy-based（大豆基）、water-based（水性/以水为基底）。"],"etymology":"“maize”来自泰诺语（Taino）“mahiz”，经西班牙语进入英语，指玉米；“-based”表示“以……为基础/主要成分”。合起来就是“以玉米为基础（原料）的”。","mnemonic":["把它拆开记：maize（玉米）+ based（基于/为基础）→“玉米基/以玉米为主”。","联想“玉米（玉）”做“底（base）”，上面再做成各种食品或材料 → maize-based。"]}
{"word":"maizebird","summary":{"en":"“Maizebird” is a rare, nonstandard word meaning a bird in/near cornfields.","zh":"“Maizebird”是一个罕见的非规范用词，大意是“在玉米地附近的鸟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A bird seen in or around maize (corn) fields; not a standard bird name, but a descriptive label.","zh":"（罕见用法）指在玉米地附近出现的鸟；不是规范的鸟类名称，更像一种描述性的叫法。"},"examples":[{"en":"Farmers noticed a few “maizebirds” feeding on spilled corn after harvest.","zh":"农民注意到收割后有几只“玉米地的鸟”在吃散落的玉米粒。"},{"en":"In the story, the maizebird becomes a symbol of the countryside.","zh":"在故事里，“maizebird”成了乡村的象征。"}]}],"synonyms":["cornfield bird","field bird","(context-specific) blackbird","(context-specific) sparrow"],"phonetic":"/ˈmeɪzˌbɝd/","extraExplanation":["“maizebird”在现代英语中非常少见，很多时候并不是某一种鸟的正式名称，而是把“maize（玉米）+ bird（鸟）”临时组合出来的描述。写作或阅读时，更可靠的做法是看上下文：作者可能指任何常在玉米地觅食的鸟（如 blackbird、sparrow、starling 等）。","如果你是在某本书、诗歌、地方方言或特定地区材料里遇到它，可能带有地方色彩或象征意义；可以把原句发出来，我能帮你判断更准确指什么鸟/什么意象。"]}
{"word":"maizenic","summary":{"en":"A rare, nonstandard adjective meaning “related to or made from maize (corn).”","zh":"一个罕见且不标准的形容词，意为“与玉米有关的/由玉米制成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Relating to maize (corn); made from or containing corn.","zh":"（罕见/不标准用法）与玉米有关的；由玉米制成的；含玉米成分的。"},"examples":[{"en":"The snack has a maizenic flavor, like roasted corn.","zh":"这种零食带有“玉米味”，像烤玉米一样。"},{"en":"They used a maizenic flour to thicken the soup.","zh":"他们用一种玉米粉（玉米淀粉类）来勾芡这道汤。"}]}],"synonyms":["maize-based","corn-based","made from corn","containing corn","corn-derived"],"phonetic":"/ˌmeɪzəˈnɪk/","extraExplanation":["“maizenic”在现代英语里非常少见，很多词典不收录。更常见、自然的说法是：maize-based / corn-based（以玉米为基础的）、made from corn（由玉米制成的）、containing corn（含玉米成分的）。","它看起来像是由“maize（玉米）”加上形容词后缀构成的造词；在写作或正式场合，建议改用上面更常见的表达，以避免读者困惑。","如果你是在食品语境中看到它，也可能与一些地区把“Maizena（玉米淀粉品牌名）”泛指为玉米淀粉有关；此时可直接说 cornstarch（玉米淀粉）。"]}
{"word":"maizer","summary":{"en":"Maizer is a rare noun meaning someone who grows or produces maize (corn).","zh":"Maizer 是个较少见的名词，指种植或生产玉米的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who grows, produces, or works with maize (corn); a maize farmer or producer. (Rare and not widely used.)","zh":"种植、生产或从事玉米相关工作的人；玉米种植者/生产者。（较少见，用法不普遍。）"},"examples":[{"en":"In some rural areas, local maizers sell corn at the weekend market.","zh":"在一些乡村地区，当地的玉米种植者会在周末集市卖玉米。"},{"en":"The co-op supports small maizers with seeds and training.","zh":"合作社为小规模玉米种植户提供种子和培训。"}]}],"synonyms":["corn farmer","maize grower","maize producer"],"phonetic":"/ˈmeɪzər/","extraExplanation":["“maizer”在现代英语里非常少见，很多时候人们更常说“corn farmer / maize grower / maize producer”。","它也可能是拼写或听写误差：常见的相近词包括“maize”（玉米）和“miser”（守财奴/吝啬的人）。如果你是在句子里看到的，我可以帮你根据上下文判断。"]}
{"word":"maizes","summary":{"en":"Maize means corn—the plant and its edible kernels/products.","zh":"Maize 指“玉米”，既可指玉米这种作物，也可指玉米粒或玉米制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall cereal plant that produces large ears (cobs) of edible kernels; widely grown for food and animal feed (in American English, this is usually called “corn”).","zh":"玉米；一种高大的谷类作物，结大穗（玉米棒），籽粒可食用，也常用作饲料（美式英语中通常叫 corn）。"},"examples":[{"en":"Maize is grown in many parts of the world.","zh":"玉米在世界许多地区都有种植。"},{"en":"The farmers harvested maize in late summer.","zh":"农民在夏末收获玉米。"},{"en":"Maize flour is used to make tortillas.","zh":"玉米粉用来做玉米饼（tortillas）。"}]},{"partOfSpeech":"n.","definition":{"en":"the kernels or products made from this plant, used as food or feed.","zh":"玉米粒；玉米制品（作为食物或饲料）。"},"examples":[{"en":"They stored sacks of maize for the winter.","zh":"他们储存了几袋玉米过冬。"},{"en":"The dish is made with maize and beans.","zh":"这道菜用玉米和豆子做的。"}]}],"synonyms":["corn","sweetcorn (esp. BrE, when eaten as a vegetable)","Indian corn (older usage)"],"phonetic":"/meɪz/","extraExplanation":["“maizes”是“maize”的复数形式，但“maize”在英语里常作不可数名词（指作物/粮食整体）或可数名词（指不同种类/批次）使用。","英式与国际英语更常用“maize”；美式英语日常更常说“corn”。在一些语境里“corn”在英式英语中也可能泛指“谷物”，因此用“maize”更明确。"]}

