{"word":"maj","summary":{"en":"“maj / maj.” is a common abbreviation for “major,” used for a college major, the military rank Major, or “major” in music (a key/chord).","zh":"“maj / maj.”常作“major”的缩写，可指大学主修专业、军衔少校，或音乐中的“大调/大三和弦”等。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation of “major” (most often used in notes or labels), meaning a main subject of study, an important field, or something large/important.","zh":"“major”的缩写（常见于笔记或标签），表示主修专业/主要领域，或“重要的、重大的”。"},"examples":[{"en":"She’s a biology maj. at UCLA.","zh":"她在加州大学洛杉矶分校主修生物。"},{"en":"This is a maj. problem we need to fix today.","zh":"这是个很重大的问题，我们今天必须解决。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for the military rank “Major” (an officer rank).","zh":"军衔“Major（少校）”的缩写。"},"examples":[{"en":"Maj. Thompson will brief the team at 0900.","zh":"汤普森少校将在09:00给团队做简报。"}]},{"partOfSpeech":"other","definition":{"en":"In music, short for “major” (e.g., “C maj” = C major), describing a key or chord that typically sounds brighter/happier than minor.","zh":"在音乐里，“major（大调）”的简写（如“C maj”=C大调），通常比小调听起来更明亮。"},"examples":[{"en":"Play it in G maj, not G minor.","zh":"用G大调弹，不要用G小调。"}]}],"synonyms":["major (full form)","Maj. (with period)"],"phonetic":"/ˈmeɪdʒɚ/","extraExplanation":["“maj”在正式英文写作里不常单独出现，更常见的是带点的“maj.”（尤其在军衔里几乎一定写作“Maj.”）。在口语中，人们通常直接说完整的“major”。"]}
{"word":"Maja","summary":{"en":"a female name; also a May-related form in some European date expressions","zh":"女性名字；在部分欧洲语言的日期表达中也可表示“五月相关”的形式"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name; in English it is often a variant spelling of “Maya.”","zh":"女性名字；在英语里常被视为“Maya”的另一种拼写。"},"examples":[{"en":"Maja introduced herself and spelled her name for the class.","zh":"Maja 做自我介绍，并把名字的拼写写给全班看。"},{"en":"Maja is a common name in parts of Europe, and some people pronounce it differently.","zh":"Maja 在欧洲一些地区很常见，而且不同人可能读法不同。"}]},{"partOfSpeech":"other","definition":{"en":"in some Slavic/Polish contexts, a form meaning “of May,” used in calendar dates (e.g., “1 May”).","zh":"在一些斯拉夫语/波兰语语境中，表示“五月的/在五月”的形式，常用于日期表达（如“5月1日”）。"},"examples":[{"en":"In Polish, you may see “1 maja” meaning “May 1st.”","zh":"在波兰语里，你可能会看到“1 maja”，意思是“5月1日”。"},{"en":"The museum reopens 3 maja in that announcement.","zh":"那则公告里写着博物馆将于“3 maja”（5月3日）重新开放。"}]}],"synonyms":["Maya","Maia"],"phonetic":"/ˈmaɪə/","extraExplanation":["发音小提示：在美国英语里，Maja 常被按 “Maya” 的读法来读；但在一些欧洲语言里也可能更接近“MAH-ya”的感觉。实际以本人自我介绍为准最礼貌。"],"etymology":"作为人名时，多见于欧洲语言（如斯拉夫语族、斯堪的纳维亚语境）对“Maya/玛雅”这一名字的不同拼写；具体来源因地区而异。作为日期用法时，来自部分语言中“五月（May）”的变格形式，用于表达“某月某日”。","mnemonic":["把 Maja 记成“换个拼法的 Maya（玛雅）”：j 看起来像 y 的“替身”。","如果看到它出现在数字后面（如 1 maja），多半是在表达日期，联想到“May（五月）”。"]}
{"word":"maja","summary":{"en":"Maja is most commonly used as a female first name, often a variant of Maya.","zh":"Maja 最常见用法是女性名字，常被视为 Maya 的一种变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name (a variant of “Maya”), used in many countries.","zh":"女性名字（“Maya”的一种变体），在许多国家/地区使用。"},"examples":[{"en":"Maja is starting a new job next week.","zh":"Maja 下周要开始一份新工作。"},{"en":"I met Maja at an international conference.","zh":"我在一次国际会议上认识了 Maja。"}]}],"synonyms":["Maya"],"phonetic":"/ˈmɑːjə/","extraExplanation":["“Maja”在英语语境里最常见的是人名（专有名词）。在不同语言中读音可能略有差异：英语里常读作“MAH-yah”。","该名字在斯拉夫语系与北欧国家较常见，也常被视为“Maya”的拼写变体；有时与“Maria/Marija”等名字在某些地区的昵称或变体关联。","注意：若你指的是缩写“MAJA”（某机构/项目名）或其他语言里的词义，请告诉我具体语境，我可以按你需要解释。"]}
{"word":"majagga","summary":{"en":"“Majagga” is not a standard English word; please provide context or the original language/source.","zh":"“majagga”不是标准英语词；请提供上下文或来源语言/出处以便判断含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a personal/place name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “majagga” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“majagga”——你能把它出现的句子发我吗？"},{"en":"If “majagga” is a name (a username or place), its meaning depends on the source.","zh":"如果“majagga”是名字（用户名或地名），它的含义要看出处。"}]}],"phonetic":"/məˈdʒæɡə/","extraExplanation":["“majagga”看起来更像转写/拼写变体，而不是常见英语词。你可以提供：1）原句或上下文；2）它来自哪种语言/地区（比如韩语、印地语、斯瓦希里语等）；3）是否可能是拼错（例如少/多一个字母）。我就能更准确判断含义与用法。"]}
{"word":"majagua","summary":{"en":"Majagua is a Caribbean name for a fiber-producing tree (often a hibiscus/mahoe) and for the strong bark fiber used in rope and weaving.","zh":"Majagua 是加勒比地区对一种可取韧皮纤维的树（常为木槿/mahoe 类）及其坚韧树皮纤维的称呼，可用于制绳与编织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Caribbean tree (often a type of hibiscus/mahoe) whose bark provides strong fiber used for rope, cord, and weaving; the fiber itself may also be called majagua.","zh":"（加勒比地区常见的）一种树（常指木槿属/mahoe 一类），其树皮可取坚韧的纤维，用来制绳、编织等；这种纤维本身也可称为 majagua。"},"examples":[{"en":"In some Caribbean communities, majagua fiber is used to make rope and baskets.","zh":"在一些加勒比社区，人们用 majagua 纤维来制作绳子和篮子。"},{"en":"The craft teacher showed us how to strip the bark of the majagua to get the fiber.","zh":"手工课老师给我们演示了如何剥取 majagua 的树皮来获得纤维。"}]},{"partOfSpeech":"n.","definition":{"en":"the majagua tree itself (a local common name that can refer to different species depending on the region).","zh":"majagua 这种树本身（作为地方俗名，在不同地区可能指不同的树种）。"},"examples":[{"en":"A majagua grows near the shore and tolerates salty air.","zh":"海边长着一棵 majagua，能耐受带盐的海风。"},{"en":"Locals pointed out the majagua and explained its traditional uses.","zh":"当地人指给我们看 majagua，并解释了它的传统用途。"}]}],"synonyms":["mahoe","mahau","sea hibiscus","blue mahoe"],"phonetic":"/mɑˈhɑɡwə/","extraExplanation":["“Majagua”是西班牙语地区（尤其古巴、波多黎各、多米尼加等加勒比地区）常见的地方词汇。它通常与“mahoe/mahau”（英语里也常见）指向同类植物有关，常被用来称呼海边常见的木槿类树（如 sea hibiscus）或可产韧皮纤维的树。因为是俗名，不同岛屿或国家可能对应不同的具体物种；阅读资料时可留意学名（Latin name）来确认。"]}
{"word":"majaguas","summary":{"en":"Majaguas are tropical Caribbean plants (plural of majagua), known for bark fibers used to make rope and cord.","zh":"Majaguas 指 majagua 的复数：加勒比地区的热带植物，以树皮纤维可制绳、编索而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of majagua) Tropical trees/shrubs in the Caribbean and nearby regions (often certain hibiscus relatives), especially valued for their tough inner bark (bast) fiber used to make rope, cord, and ties.","zh":"（majagua 的复数）加勒比海及周边地区的热带树/灌木（常指某些木槿属近缘植物），尤以其坚韧的韧皮纤维著称，可用来制绳、编索、捆扎等。"},"examples":[{"en":"In rural coastal areas, people once used majaguas to make strong cord for fishing nets.","zh":"在一些沿海乡村地区，人们曾用 majaguas 的纤维制作结实的绳线来编渔网。"},{"en":"The guide pointed out majaguas along the trail and explained how the bark can be processed into rope.","zh":"向导在小径旁指给我们看 majaguas，并讲解如何把树皮加工成绳子。"}]}],"synonyms":["hibiscus (regional)","lacebark","bast fiber (from the plant)"],"phonetic":"/məˈhɑːɡwə/","extraExplanation":["这是一个西班牙语借词（常见于加勒比海地区的英语语境，如古巴、波多黎各、多米尼加等）。在不同国家与地区，majagua 可能指不同但相近的植物（多与木槿属或“lacebark”类树木有关），共同点是“树皮纤维可用来制绳”。因此在阅读旅行记、民族志或本地农事/手工资料时最常见。"]}
{"word":"majas","summary":{"en":"“Majas” is usually the plural of Spanish “maja,” used in English mainly in Spanish art/history contexts.","zh":"“majas”通常是西班牙语“maja”的复数，英语里多用于西班牙艺术/历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “maja”: in Spanish culture, a fashionable or spirited young woman (especially from Madrid), often shown in traditional dress; sometimes used in English when talking about Spanish art or history.","zh":"“maja”的复数：西班牙文化中指（尤指马德里地区）打扮时髦、性格活泼的年轻女子，常穿传统服饰；英语里多用于谈论西班牙艺术或历史时借用。"},"examples":[{"en":"Goya painted famous scenes of majas in Madrid society.","zh":"戈雅画过马德里社会中著名的“majas”形象。"},{"en":"The museum exhibit described the clothing worn by majas and majos.","zh":"博物馆展览介绍了majas和majos穿的服饰。"}]},{"partOfSpeech":"n.","definition":{"en":"A plural form of the given name “Maja” (a female name used in many countries).","zh":"人名“Maja”的复数形式（多个名叫Maja的女性）。"},"examples":[{"en":"Two Majas were in the same class, so we used their last names too.","zh":"班里有两个叫Maja的人，所以我们也用姓来区分。"}]}],"synonyms":["Spanish girls (contextual)","Madrid folk (contextual)"],"phonetic":"/ˈmɑːhɑːz/","extraExplanation":["英语里“maja/majas”多出现在艺术史语境，最常被提到的是戈雅（Francisco Goya）的画作《La maja desnuda》（裸女）与《La maja vestida》（着衣）。在日常英语对话中并不常用。","如果你其实想查拉脱维亚语“mājas”（意为“家/房子”），或是某个品牌/人名/地名，请告诉我你看到它的句子或语言环境，我可以按正确语种解释。"]}
{"word":"Majed","summary":{"en":"an Arabic-origin personal name meaning noble or glorious.","zh":"阿拉伯语来源的人名，含高贵、光荣之意。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name of Arabic origin, often understood as “glorious,” “noble,” or “illustrious.”","zh":"阿拉伯语来源的男性名字，常含“光荣的 / 高贵的 / 杰出的”之意。"},"examples":[{"en":"Majed introduced himself and explained that his name comes from Arabic.","zh":"Majed 做了自我介绍，并解释他的名字来自阿拉伯语。"},{"en":"We invited Majed to join our study group after class.","zh":"下课后我们邀请 Majed 加入学习小组。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname) in some communities.","zh":"在一些社群中也可作姓氏使用。"},"examples":[{"en":"Dr. Majed will present the research results tomorrow.","zh":"Majed 博士将于明天展示研究成果。"}]}],"synonyms":["Majid","Majeed"],"phonetic":"/məˈdʒeɪd/","extraExplanation":["在英语语境里，它通常被当作专有名词（人名）使用，因此一般不加冠词，也不作复数变化。","不同地区或家庭会采用不同拼写（如 Majed, Majid, Majeed），发音也可能随个人习惯略有差异。"],"etymology":"源自阿拉伯语名字 ماجد（mājid），常与词根 m-j-d（与“荣耀、崇高”相关的含义）有关；在英语中多为音译拼写之一，也常见拼写为 Majid / Majeed。","mnemonic":["联想中文“majestic（雄伟的）”的 maj- 开头：名字常带“高贵、荣耀”的感觉。"]}
{"word":"Majeed","summary":{"en":"a male personal name often associated with the idea of glory or honor","zh":"常与“荣耀、尊贵、受敬”含义相关的男性人名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in Arabic-, Persian-, Urdu-, and Somali-speaking communities; it is often understood to carry the sense of “glorious,” “noble,” or “highly honored.”","zh":"男性名字，常见于阿拉伯语、波斯语、乌尔都语、索马里语等文化圈；通常被理解为带有“荣耀的、尊贵的、受崇敬的”含义。"},"examples":[{"en":"Majeed introduced himself and explained how to pronounce his name.","zh":"Majeed 自我介绍，并解释了他的名字怎么读。"},{"en":"We invited Majeed to join our study group after class.","zh":"下课后我们邀请 Majeed 加入学习小组。"}]}],"synonyms":["Majid","Majeed","Mejid","Al-Majid"],"phonetic":"/məˈdʒiːd/","extraExplanation":["在伊斯兰文化中，Al-Majīd（“至荣耀者”）也常作为真主的尊名之一出现，因此这个名字在一些家庭里带有祝福与敬意的文化意味。","英文语境里它通常被当作专有名词（人名）使用，不会像普通形容词那样在句中变化；需要时可礼貌询问对方偏好的读音与拼写。"],"etymology":"源自阿拉伯语词根 m-j-d，相关词形如 Majīd（常译“荣耀的、崇高的、尊贵的”）。在不同语言与拼写体系里可写作 Majeed / Majid / Mejdid 等，属于音译差异。","mnemonic":["把它联想成“majestic（雄伟的、庄严的）”的开头 maj-，意思上都和“荣耀/庄严”接近：Majeed ≈ majestic 的感觉。","中文记忆：可记成“马吉德/马吉德”，想到“很‘吉’（吉祥）又很‘德’（有德）”，对应尊贵受敬的感觉。"]}
{"word":"majesta","summary":{"en":"“Majesta” is not common in modern English; it’s usually a rare variant/misspelling of “majesty,” or a non-English-style title meaning “Your Majesty.”","zh":"“majesta”在现代英语中不常见，通常是“majesty（威严；王者尊严）”的罕见变体/误拼，或某些非英语语境里表示“陛下”的称谓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare) A variant or misspelling of “majesty,” meaning impressive greatness or royal dignity.","zh":"（很少见）“majesty（威严；王者尊严）”的拼写变体或误拼，指庄严的气势或君王的尊贵。"},"examples":[{"en":"The writer praised the majesta of the mountains at sunrise.","zh":"作者称赞日出时群山的庄严气势。"},{"en":"In older or nonstandard writing, you may see “majesta” used where modern English uses “majesty.”","zh":"在较旧或不规范的写法中，你可能会看到用“majesta”来表达现代英语的“majesty”。"}]},{"partOfSpeech":"other","definition":{"en":"(As a title in some non-English contexts) A form related to “Your Majesty,” used when addressing a king or queen.","zh":"（某些非英语语境中的称谓）与“Your Majesty（陛下）”相关的形式，用于称呼国王或女王。"},"examples":[{"en":"In historical translations, the speaker addressed the queen as “Majesta,” meaning “Your Majesty.”","zh":"在一些历史译文里，说话者用“Majesta”称呼女王，意思相当于“陛下”。"}]}],"synonyms":["majesty","grandeur","royal dignity","splendor"],"phonetic":"/məˈdʒɛstə/","extraExplanation":["“majesta”在现代英语里几乎不作为标准词使用。多数情况下，你想查的可能是“majesty”（威严、庄严、王者尊严）。如果你是在特定书名、人名、游戏/品牌或某种语言（如意大利语“Maestà”）里看到的“Majesta”，告诉我出现的句子或来源，我可以帮你更精准地解释。"]}
{"word":"majestatic","summary":{"en":"Majestic means grand, impressive, and awe-inspiring (often used for nature, animals, buildings, or a dignified presence).","zh":"Majestic 表示“雄伟壮丽、庄严宏伟、令人敬畏”，常用于形容自然景观、动物、建筑或庄重的气质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common spelling: majestic) Very grand, beautiful, and impressive; making you feel admiration or awe.","zh":"（常见拼写：majestic）雄伟壮丽的；庄严宏伟的；令人敬畏的。"},"examples":[{"en":"We watched the majestic mountains at sunrise.","zh":"我们在日出时看着雄伟的群山。"},{"en":"The eagle looked majestic as it soared above the valley.","zh":"老鹰在山谷上空翱翔时显得十分威武壮观。"},{"en":"She walked into the hall with a calm, majestic confidence.","zh":"她带着沉稳而庄重的自信走进大厅。"}]}],"synonyms":["grand","magnificent","splendid","regal","stately"],"phonetic":"/məˈdʒɛstɪk/","extraExplanation":["你输入的“majestatic”通常是“majestic”的拼写错误。更常见的对应名词是“majesty（威严；王权）”。","“majestic”常用来形容自然景观（mountains, waterfall）、动物姿态（eagle, lion）、建筑（palace, cathedral）或气质（majestic presence）。常见搭配：majestic view / majestic scenery / majestic peak。"]}
{"word":"majestatis","summary":{"en":"Ma­jes­ta­tis is a Latin form meaning “of majesty/sovereignty,” mainly used inside fixed legal-historical phrases.","zh":"majestatis 是拉丁语形式，意为“属于威严/主权（君权）的”，多用于固定的法律与历史术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; genitive singular of majestas) “of majesty; of sovereignty or royal authority.” Often seen in legal or historical phrases.","zh":"（拉丁语；majestas 的单数属格）“属于威严/王权的；关于主权或君权的”。常见于法律或历史术语中。"},"examples":[{"en":"The phrase crimen laesae majestatis means “the crime of injured majesty,” i.e., treason against the sovereign.","zh":"短语 crimen laesae majestatis 意为“冒犯君权之罪”，也就是对君主/国家的叛国罪。"},{"en":"In medieval documents, majestas and majestatis were used to refer to the authority of the crown.","zh":"在中世纪文献中，majestas 和 majestatis 常用来指王权/王室的权威。"}]}],"synonyms":["majesty","sovereignty","royal authority"],"phonetic":"/məˈdʒɛstəˌtɪs/","extraExplanation":["“majestatis”本身不是英语单词，而是拉丁语名词 majestas（威严、君权、主权）的“属格”（genitive）形式，相当于英语里的“of …”。因此它常出现在固定搭配里，整体作为术语借入英文或用于学术写作。","经典搭配：crimen laesae majestatis（或 laesa maiestas）通常译作“叛国罪/大逆罪”，字面是“损害（君主）威严之罪”。在不同历史时期，它的适用范围可能从直接谋反扩展到侮辱君主等更广义的行为。","拼写提示：古典拉丁语中 i/j、u/v 的写法在文献里可能变化，例如 maiestas 也可见作 majestas。"]}
{"word":"majestic","summary":{"en":"“Majestic” means grand, beautiful, and awe-inspiring, often describing nature, buildings, or a dignified presence.","zh":"“majestic”指宏伟壮观、令人赞叹敬畏的，常形容自然景观、建筑或带威严气场的风度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Grand, impressive, and beautiful in a way that inspires admiration or awe.","zh":"宏伟壮观的；庄严的；令人敬畏且美丽的。"},"examples":[{"en":"The palace looked majestic at sunrise.","zh":"日出时，宫殿看起来宏伟壮观。"},{"en":"We watched the majestic mountains from the train window.","zh":"我们从火车窗户望着壮丽的群山。"},{"en":"The eagle spread its wings in a majestic flight.","zh":"老鹰展开翅膀，威严地飞翔。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a dignified, royal, or authoritative presence; noble in style or manner.","zh":"威严的；高贵的；带有王者气度或权威感的。"},"examples":[{"en":"She walked into the room with a majestic calm.","zh":"她带着一种威严的镇定走进房间。"},{"en":"The actor’s voice sounded deep and majestic.","zh":"那位演员的嗓音低沉而庄重。"}]}],"synonyms":["grand","magnificent","splendid","stately","regal","awe-inspiring"],"phonetic":"/məˈdʒɛstɪk/","extraExplanation":["“majestic”常用来形容自然景观（山脉、瀑布、海洋）或宏大建筑（宫殿、教堂），语气偏正面、带赞叹。日常口语里也可半幽默地形容人或动物“很有气场”。","词源来自拉丁语“maiestas”（伟大、威严），与“majesty（威严；王权）”同源。文学和影视中常用来营造“庄严、史诗感”的氛围。"]}
{"word":"majestical","summary":{"en":"“Majestical” means grand and dignified, but it is a less common variant of “majestic.”","zh":"“majestical”意为“庄严宏伟的”，但在现代英语中不如“majestic”常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a grand, dignified, and impressive beauty or power; like a king, queen, or great natural scene.","zh":"庄严宏伟的；威严壮观的；有帝王般气势的（常用于人、建筑、自然景观等）。"},"examples":[{"en":"The mountains looked majestical in the morning light.","zh":"群山在晨光中显得庄严壮观。"},{"en":"She walked into the hall with a majestical calm.","zh":"她带着一种威严的沉静走进大厅。"}]}],"synonyms":["majestic","grand","stately","regal","magnificent","imposing"],"phonetic":"/məˈdʒɛstɪkəl/","extraExplanation":["“majestical”在现代英语中较少见，更常用的是“majestic”。在较早的文学或较正式、仿古的语境里，你可能会看到“majestical”作为“majestic”的变体。","拼写提示：日常写作中建议用“majestic”（更自然、更常见）；“majestical”可能会被读者当作不常见用法或拼写变体。"]}
{"word":"majestically","summary":{"en":"“Majestically” means “in a grand, dignified, impressive way,” often used for nature, movement, or a royal-like presence.","zh":"“majestically”表示“宏伟庄严地、气度不凡地”，常用于描写自然景象、动作或具有王者般的气场。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a grand, impressive, or royal-looking way.","zh":"以宏伟、庄严或具有王者气派的方式。"},"examples":[{"en":"The eagle soared majestically over the mountains.","zh":"老鹰在群山上空庄严地翱翔。"},{"en":"She walked majestically into the hall in a long dress.","zh":"她穿着长裙，气度不凡地走进大厅。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that shows dignity, calm power, or greatness.","zh":"以体现尊严、从容力量或伟大气势的方式。"},"examples":[{"en":"The old ship moved majestically through the fog.","zh":"那艘老船在雾中缓缓前行，显得格外庄重。"},{"en":"The music rose majestically, filling the room.","zh":"音乐庄严地高涨，充满了整个房间。"}]}],"synonyms":["grandly","regally","stately","imposingly","magnificently"],"phonetic":"/məˈdʒɛstɪkli/","extraExplanation":["“majestically”来自形容词“majestic（宏伟的、庄严的）”，常用来描写自然景象（山、海、天空、动物）或仪态（步伐、动作、气场），带有“令人敬畏、很有气势”的感觉。","写作中它偏正式，常见于描写性文字；日常口语里更常用“beautifully / impressively / grandly”等更通用的副词替换，视语境而定。"]}
{"word":"majesticalness","summary":{"en":"“Majesticalness” means the quality of being majestic—grand, dignified, and awe-inspiring (but it’s uncommon; “majesty/majesticness” is more natural).","zh":"“majesticalness”指“雄伟庄严的特质”（用法较少，更地道的说法是“majesty/majesticness”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being majestic; grand, impressive dignity or beauty","zh":"雄伟庄严之感；宏大、令人敬畏的尊贵或美感"},"examples":[{"en":"The mountains filled her with a sense of majesticalness at sunrise.","zh":"日出时群山带给她一种雄伟庄严的感觉。"},{"en":"The cathedral’s light and height create a quiet majesticalness.","zh":"大教堂的光线与高度营造出一种安静的庄严感。"}]}],"synonyms":["majesty","majesticness","grandeur","splendor","magnificence","dignity"],"phonetic":"/məˈdʒɛstɪkəlnəs/","extraExplanation":["“majesticalness”并不常见，更多时候人们会用更自然的形式：**majesticness**（更常见）或 **majesty**（最常见、也更正式）。","词形来源是 **majestical**（意为“庄严的、宏伟的”）+ **-ness**（名词后缀，表示“……的性质/状态”）。在正式写作中，建议优先使用 **majesty/majesticness**，听起来更地道。"]}
{"word":"majesticness","summary":{"en":"Majesticness means the quality of being majestic—impressively grand and awe-inspiring.","zh":"majesticness 指“雄伟庄严”的特质，强调宏伟、令人赞叹或敬畏的气势。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being majestic—great, impressive, and inspiring admiration or awe.","zh":"雄伟庄严的特质；宏伟、令人赞叹或敬畏的气势。"},"examples":[{"en":"The majesticness of the mountains took our breath away.","zh":"群山的雄伟壮丽让我们屏住了呼吸。"},{"en":"She tried to capture the majesticness of the old castle in her painting.","zh":"她试图在画中表现那座古堡的庄严宏伟。"}]}],"synonyms":["majesty","grandeur","splendor","magnificence","regality"],"phonetic":"/məˈdʒɛstɪknəs/","extraExplanation":["“Majesticness”是由形容词“majestic（雄伟的、威严的）”加名词后缀“-ness”构成，意思直观，但在现代英语里相对少用。更常见、更自然的名词是“majesty”（庄严、雄伟；也可指王权/皇室威严）。例如：the majesty of nature（大自然的壮丽）。","语体上，“majesticness”更偏描述性、口语或写作者的自造词（强调“那种雄伟的感觉”）；正式写作中通常用“majesty”“grandeur”“splendor”更地道。"]}
{"word":"majesties","summary":{"en":"“Majesties” is the plural of “majesty”: either impressive grandeur/dignity, or (in royal contexts) more than one monarch as a formal title (“Their Majesties”).","zh":"“Majesties”是“majesty”的复数：可指宏伟庄严的气势，也可在王室语境中作为对多位君主的正式称谓（“Their Majesties”，他们/她们的陛下）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “majesty”: the impressive greatness, dignity, or beauty of something (often used about nature, art, or important people).","zh":"“majesty”的复数：宏伟、庄严、崇高之美（常用于形容自然、艺术或重要人物带来的震撼与尊严）。"},"examples":[{"en":"We admired the majesties of the mountains at sunrise.","zh":"我们欣赏了日出时群山的壮丽景象。"},{"en":"The novel describes the majesties of the ancient empire.","zh":"这部小说描写了古代帝国的恢宏气象。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural title/royal reference: more than one king/queen as a group (e.g., “Their Majesties”).","zh":"（复数）王室称谓/指代：指两位或以上的君主（如“他们的陛下/她们的陛下”，Their Majesties）。"},"examples":[{"en":"Their Majesties will arrive at noon.","zh":"他们的陛下将于中午抵达。"},{"en":"The guests bowed to Their Majesties.","zh":"宾客们向他们的陛下鞠躬致意。"}]}],"synonyms":["grandeurs","splendors","magnificence","dignities"],"phonetic":"/ˈmædʒəstiz/","extraExplanation":["在英语里，Majesty 既可表示“宏伟/庄严的气势”，也可作为对君主的尊称。“Your Majesty”用于当面称呼一位君主；“Their Majesties”用于指两位君主（例如国王与王后）或在正式场合中集体指代。文学作品中常用“the majesty/majesties of nature”来表达自然景观带来的敬畏感。"]}
{"word":"majestious","summary":{"en":"“Majestious” is not standard; the correct word is usually “majestic,” meaning grand, impressive, and dignified.","zh":"“majestious”不是标准拼写；通常正确词是“majestic”，表示雄伟、令人赞叹且庄严。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having great beauty, power, or dignity; impressive in a noble way.","zh":"雄伟的；庄严的；威风凛凛的（形容美丽、力量或尊严令人印象深刻）。"},"examples":[{"en":"We saw the majestic mountains at sunrise.","zh":"我们在日出时看到了雄伟的群山。"},{"en":"The eagle looked majestic as it soared above the valley.","zh":"老鹰在山谷上空翱翔时显得格外威武。"},{"en":"The palace’s majestic entrance made everyone feel small.","zh":"宫殿宏伟的入口让每个人都显得渺小。"}]}],"synonyms":["grand","magnificent","imposing","stately","noble"],"phonetic":"/məˈdʒɛstɪk/","extraExplanation":["“majestious”不是标准英语拼写，通常想写的是“majestic”（形容词：雄伟的/庄严的）。","相关词：majesty（n. 威严；雄伟；陛下）。例：“Your Majesty”=“陛下”。","“majestic”常用于自然景观（mountains, ocean）、动物（eagle, lion）或建筑（palace, cathedral），语气偏正式、带赞叹。"]}
{"word":"Majesty","summary":{"en":"Majesty means impressive grandeur or dignity, and it is also a royal title of respect (Your Majesty).","zh":"Majesty 指“雄伟庄严、威严”的气质，也可作对君主的尊称（陛下）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A quality of great dignity, beauty, and power that makes someone or something seem grand and impressive.","zh":"（人或事物的）威严；雄伟；庄严之美，使人感到宏大而令人敬畏的气质。"},"examples":[{"en":"The mountains rose in quiet majesty above the valley.","zh":"群山在山谷之上静静耸立，显得雄伟庄严。"},{"en":"We were struck by the majesty of the cathedral’s architecture.","zh":"我们被大教堂建筑的庄严宏伟所震撼。"},{"en":"Her speech had a calm majesty that held everyone’s attention.","zh":"她的演讲带着沉静的威严，吸引了所有人的注意。"}]},{"partOfSpeech":"n.","definition":{"en":"A respectful form of address for a king, queen, emperor, or empress (used as “Your Majesty” or “His/Her Majesty”).","zh":"对国王、女王、皇帝或皇后的尊称（如“Your Majesty / 陛下”“His/Her Majesty / 他/她的陛下”）。"},"examples":[{"en":"Your Majesty, the ambassador has arrived.","zh":"陛下，大使已经到了。"},{"en":"Her Majesty the Queen visited the hospital.","zh":"女王陛下访问了这家医院。"}]}],"synonyms":["grandeur","splendor","dignity","regality"],"phonetic":"/ˈmædʒəsti/","extraExplanation":["“majesty”来自拉丁语词根，和“major（更大）”同源，因此有“宏大、至高”的感觉。","常见固定搭配：the majesty of nature（大自然的壮丽）、with majesty（庄严地，较文学化）、Your Majesty（陛下）。","文学中常用“majesty”来描写自然与神圣之物的崇高感，比如描写高山、海洋、古老建筑或王权仪式的庄严氛围。"]}
{"word":"majesty","summary":{"en":"Majesty means either (1) a royal title for a king or queen, or (2) a feeling of grand, dignified beauty.","zh":"Majesty 既指君主的尊称“陛下”，也指宏伟庄严、令人敬畏的壮美感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"royal rank and authority; used as a title of respect for a king, queen, or emperor","zh":"王室的地位与权威；对国王、女王或皇帝的尊称（陛下）"},"examples":[{"en":"Your Majesty, the guests have arrived.","zh":"陛下，客人已经到了。"},{"en":"The letter was addressed to His Majesty the King.","zh":"这封信是写给国王陛下的。"}]},{"partOfSpeech":"n.","definition":{"en":"greatness, dignity, or impressive beauty that makes something feel grand or noble","zh":"宏伟、庄严或令人敬畏的美（带有崇高、壮观的感觉）"},"examples":[{"en":"We stood in silence, struck by the majesty of the mountains.","zh":"我们静静站着，被群山的壮丽所震撼。"},{"en":"The cathedral’s majesty filled the room with awe.","zh":"大教堂的庄严宏伟让人心生敬畏。"}]}],"synonyms":["royalty","sovereignty","grandeur","magnificence","splendor"],"phonetic":"/ˈmædʒəsti/","extraExplanation":["“Majesty”既可以是正式称谓（如 Your Majesty / His Majesty / Her Majesty），也可以指自然景观或艺术作品给人的“庄严壮观”的感觉。作为称谓时，通常出现在仪式、官方文件或历史语境中；日常对话里很少用。","文学与经典表达中常见“the majesty of nature（大自然的壮丽）”“in all its majesty（尽显其庄严/壮美）”。"]}
{"word":"majestyship","summary":{"en":"A rare, old-fashioned or humorous noun meaning the dignity/status of a “Majesty,” sometimes used as “Your Majestyship.”","zh":"一个罕见、带古风或幽默色彩的名词，指“陛下”的尊严/地位，也可用作称呼“Your Majestyship（陛下）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, often humorous or old-fashioned) The status, office, or dignity of a majesty; used as a form of address meaning “Your Majesty.”","zh":"（罕见，常带幽默或古风）“陛下”的身份/尊严/地位；也可作称呼用语，意为“陛下”。"},"examples":[{"en":"Your Majestyship, the council is ready to hear your decision.","zh":"陛下，议会已准备好听候您的裁决。"},{"en":"The writer used “majestyship” to give the scene an old-fashioned, courtly tone.","zh":"作者用“majestyship”来营造一种古典、宫廷式的氛围。"}]}],"synonyms":["Your Majesty","majesty","royal dignity","sovereign dignity"],"phonetic":"/ˈmædʒəstiˌʃɪp/","extraExplanation":["“majestyship”由“majesty（陛下/威严）+ -ship（表示身份、地位或状态，如 friendship, leadership）”构成，但在现代英语中几乎不作为正式称谓使用。正式场合通常说“Your Majesty”，对国王/女王；对皇帝常见“Your Majesty”或在特定文化语境下用“Your Imperial Majesty”。","因为这个词很少见，写作中使用时容易显得刻意或不自然；更常见于戏仿、历史题材对话、或作者想制造“古风/宫廷腔”的文学语气时。"]}
{"word":"majeure","summary":{"en":"Majeure is a French-based form meaning “major,” seen mainly in the phrase “force majeure” in legal and business contexts.","zh":"majeure 是带法语色彩的形式，意思接近“重大”。在英语中主要出现在法律/商务短语 force majeure（不可抗力）里。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mostly in French loan phrases) major; very important, serious, or large in degree.","zh":"（多见于法语借词短语中）重大的；严重的；程度很大的。"},"examples":[{"en":"The contract includes a force majeure clause for events like earthquakes.","zh":"合同里包含“force majeure（不可抗力）”条款，适用于地震等事件。"},{"en":"They described it as a majeure crisis that required immediate action.","zh":"他们把这称为一场重大的危机，需要立刻采取行动。"}]},{"partOfSpeech":"phrase","definition":{"en":"In legal/business English, used especially in the fixed phrase “force majeure” meaning an unforeseen event that prevents someone from fulfilling a contract.","zh":"在法律/商业英语中，尤用于固定短语“force majeure”，指不可预见且使人无法履行合同的事件（不可抗力）。"},"examples":[{"en":"The supplier claimed force majeure due to flooding.","zh":"供应商因洪水主张不可抗力。"},{"en":"Force majeure doesn’t automatically cancel a contract; it depends on the clause wording.","zh":"不可抗力并不一定自动取消合同；要看条款如何写。"}]}],"synonyms":["major","serious","significant","critical"],"phonetic":"mæˈʒʊr","extraExplanation":["“majeure”来自法语，英语里单独使用并不常见；日常更常用对应的英语词“major”。","在书面语或专业语境（法律、国际商务、新闻）中，你更可能看到它出现在法语固定搭配里，最常见就是“force majeure”。","拼写提示：英语里“major（重大/主修）”是常用形式；“majeure”通常带有“法语原文/法式表达”的味道。"]}
{"word":"Majid","summary":{"en":"Majid is an Arabic-origin name, usually for men, meaning “glorious” or “noble,” and it can also be a surname.","zh":"Majid 是源自阿拉伯语的名字，通常为男性名，含义多为“光荣/尊贵”，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name of Arabic origin meaning “glorious,” “noble,” or “illustrious.”","zh":"男性名字（源自阿拉伯语），常见含义为“光荣的、尊贵的、显赫的”。"},"examples":[{"en":"Majid introduced himself and explained how to pronounce his name.","zh":"Majid 做了自我介绍，并解释了他的名字怎么读。"},{"en":"Majid is a common name in many Arabic-speaking communities.","zh":"Majid 在许多阿拉伯语社群中是个常见名字。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) used in some regions and communities.","zh":"姓氏（在一些地区和社群中使用）。"},"examples":[{"en":"Her teacher, Mr. Majid, teaches math.","zh":"她的老师 Majid 先生教数学。"}]}],"synonyms":["Majed","Majeed"],"phonetic":"/məˈdʒiːd/","extraExplanation":["“Majid”来自阿拉伯语词根，常与“荣耀/尊贵”相关。在英文里通常按音译拼写；也可能写作 Majed、Majeed（拼法差异多与不同地区的转写习惯有关）。","英语环境中如果不确定读法，可以礼貌地问：“How do you pronounce your name?” 这是很常见也很尊重的做法。"]}
{"word":"majidieh","summary":{"en":"Majidieh is mainly used as a Tehran place name; historically it can also refer to an old Persian silver coin.","zh":"Majidieh 主要用作德黑兰的地名；在历史语境中也可指一种旧时的波斯银币。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name (proper noun), most commonly a neighborhood name in Tehran, Iran, often spelled Majidieh or Majidiyeh.","zh":"一个地名（专有名词），最常见指伊朗德黑兰的一个地区名，常拼作 Majidieh 或 Majidiyeh。"},"examples":[{"en":"I used to live near Majidieh in Tehran.","zh":"我以前住在德黑兰的 Majidieh 附近。"},{"en":"Let’s meet at a café in Majidieh.","zh":"我们在 Majidieh 的一家咖啡馆见吧。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, the name of a Qajar-era Persian silver coin (less common in modern English; usually discussed in historical contexts).","zh":"历史上指卡扎尔王朝时期的一种波斯银币名称（现代英语中较少见，多用于历史语境）。"},"examples":[{"en":"The document lists prices in majidieh and tomans.","zh":"这份文件用 majidieh 和 toman 来标价。"}]}],"synonyms":["Majidiyeh (variant spelling)"],"phonetic":"/ˌmædʒɪˈdiːə/","extraExplanation":["“Majidieh/Majidiyeh”通常是从波斯语人名或称号（如 Majid，意为“光荣的、尊贵的”）衍生出来的地名转写。由于波斯语到英语的转写没有唯一标准，所以常见多种拼法（-ieh / -iyeh）。","作为货币名称时，多出现在19世纪左右伊朗相关的历史、旅行记或旧账本里；现代日常英语里几乎不会用它来表示钱。"]}
{"word":"Majidiyeh","summary":{"en":"an Ottoman-era coin name or a related place name seen in variant transliterations","zh":"奥斯曼时期的银币名称，或同源的地名（常见不同转写）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silver coin of the late Ottoman Empire (also spelled “Mecidiye”), issued in the 19th century and named after Sultan Abdülmecid I; in some contexts it can refer more generally to currency of that series","zh":"奥斯曼帝国晚期的一种银币（也拼作“mecidiye”），19世纪发行，以苏丹阿卜杜勒迈吉德一世命名；在一些语境中也可泛指同系列货币"},"examples":[{"en":"The merchant asked to be paid in Majidiye coins.","zh":"商人要求用马吉迪耶银币付款。"},{"en":"In the novel, a few Majidiye are mentioned as a symbol of the old empire.","zh":"小说里提到几枚马吉迪耶银币，象征旧帝国。"}]},{"partOfSpeech":"other","definition":{"en":"a place name used for neighborhoods/areas in Turkey and nearby regions (often a transliteration variant of “Mecidiye”), typically connected historically to the Ottoman period","zh":"土耳其及周边地区的一些地名/街区名（常为“Mecidiye”的音译变体），通常与奥斯曼时期的历史命名有关"},"examples":[{"en":"They rented an apartment in Majidiye, close to the main road.","zh":"他们在马吉迪耶租了套公寓，靠近主干道。"},{"en":"Majidiye appears on older maps with slightly different spellings.","zh":"在较老的地图上，Majidiye 常以略有不同的拼写出现。"}]}],"synonyms":["Mecidiye","Mecidiyeh","Majidiye"],"phonetic":"/ˌmɑːdʒɪˈdiːjeɪ/","extraExplanation":["这是转写词：不同语言（阿拉伯字母、土耳其语拉丁字母、英语）之间转换时，j/c、-ye/-yeh 之类的拼法会变化。","如果你是在特定国家/城市的地址里看到它，更可能是地名；如果在历史、钱币或小说语境里出现，更可能指奥斯曼银币（mecidiye）。"],"etymology":"源自奥斯曼土耳其语“mecidiye / mecidi”, 含义为“与(苏丹)阿卜杜勒迈吉德（Abdülmecid）有关的”；英语里常见多种转写：Majidiyeh / Majidiye / Mecidiye 等。","mnemonic":["把它拆成“Majid + -iyeh”：Majid（迈吉德）像人名，-iyeh 表示“与……有关的”，联想“与迈吉德有关→mecidiye/majidiye”。","记成“ma-ji-DEE-yeh”：重音在“DEE”，读起来像在说一种老钱币或老地名。"]}
{"word":"majlis","summary":{"en":"Majlis means a council/meeting for discussion or a guest reception room, especially in Arab and Islamic contexts.","zh":"Majlis 指议事会/协商会议，也可指家庭中的会客厅，常见于阿拉伯及伊斯兰语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a council or meeting where people gather to discuss issues, make decisions, or advise a leader (common in Arab and Islamic societies)","zh":"（阿拉伯及伊斯兰社会常见的）议事会；协商会议；顾问会议"},"examples":[{"en":"The village majlis met to discuss water use during the dry season.","zh":"村里的majlis开会讨论旱季的用水问题。"},{"en":"Citizens can bring complaints to the majlis and ask local leaders for help.","zh":"民众可以把诉求带到majlis，请地方领袖协助处理。"}]},{"partOfSpeech":"n.","definition":{"en":"a reception room or sitting area in a home where guests are welcomed (especially in Gulf countries)","zh":"（尤指海湾国家家庭中的）会客厅；接待室"},"examples":[{"en":"Guests were served tea in the majlis before dinner.","zh":"晚餐前，客人们在majlis里喝茶。"},{"en":"In many homes, the majlis is kept especially tidy for visitors.","zh":"在许多家庭里，majlis会专门为接待访客而保持整洁。"}]}],"synonyms":["council","assembly","meeting","guest room","reception room"],"phonetic":"ˈmædʒlɪs","extraExplanation":["Majlis 来自阿拉伯语，字面意思与“坐下、坐席（sitting）”有关，所以既可以指“人们坐在一起商议的场合/机构”，也可以指“接待客人坐下聊天的房间”。","在一些国家（如伊朗、阿富汗等），Majlis 也可能作为正式机构名称的一部分，指国家层面的“议会”。具体含义常需结合当地语境。"]}
{"word":"majo","summary":{"en":"Majo is a Spanish loanword used in English mainly in cultural/art contexts, meaning a stylish, bold person (often a man) in traditional Spanish urban fashion.","zh":"Majo 是西班牙语借词，英语里多用于文化/艺术语境，指带传统西班牙城市时尚风格、很有自信与“酷劲”的人（常指男性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) a stylish, confident person—often a man—known for traditional dress and a bold, “street-smart” attitude (especially in historical Madrid).","zh":"（源自西班牙语）指穿着讲究、很有自信、带点“市井酷劲”的人——常指男性；尤指历史上马德里的传统打扮与风格。"},"examples":[{"en":"In the novel, a young majo walks through Madrid in flashy clothes.","zh":"小说里，一个年轻的 majo 穿着花哨的衣服走在马德里街头。"},{"en":"The painting shows majos and majas in traditional Spanish outfits.","zh":"这幅画描绘了穿传统西班牙服饰的 majos 和 majas。"}]}],"synonyms":["dandy","stylish person","man about town"],"phonetic":"/ˈmɑhoʊ/","extraExplanation":["“majo/maja”在西班牙文化里常与18—19世纪的马德里民间时尚有关（带点“街头潮人/侠气”的气质），在英语中多见于艺术史、文学或旅行文化语境。","容易与英语的“major（主要的/专业）”混淆；如果你想查的是“major”，告诉我我可以按“major”再给你一份词条。","相关词：maja（女性形式）；majos y majas（男女一组的说法，常出现在艺术作品介绍中）。"]}
{"word":"majolica","summary":{"en":"Majolica is brightly colored, glazed decorative pottery, often associated with Italian ceramics.","zh":"Majolica 指色彩鲜艳、带釉的装饰性陶器，常与意大利陶瓷传统相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of brightly colored pottery, usually with a shiny glaze; often decorated with detailed designs","zh":"一种色彩鲜艳的陶器，通常带有光亮釉面；常有精细装饰图案"},"examples":[{"en":"The museum displayed a set of Italian majolica plates with floral patterns.","zh":"博物馆展出了一套意大利马约利卡彩陶盘，上面有花卉图案。"},{"en":"She collects majolica because the glaze makes the colors look vivid and rich.","zh":"她收藏马约利卡彩陶，因为釉面让颜色看起来鲜亮浓郁。"}]}],"synonyms":["decorative pottery","glazed earthenware","ceramic ware"],"phonetic":"/məˈdʒɑlɪkə/","extraExplanation":["“Majolica”常指装饰性陶器，但在不同国家/时期用法略有差别：在意大利传统中，它多与“锡釉陶（tin-glazed earthenware）”相关，颜色明亮、图案细致；在英国维多利亚时期，“majolica”有时也用来指一种色彩浓烈的铅釉浮雕陶器。参观博物馆或阅读艺术史材料时，可留意其具体指代。"]}
{"word":"majolicas","summary":{"en":"Majolicas are pieces of colorful, painted tin-glazed pottery (plural of majolica).","zh":"Majolicas 指彩绘锡釉陶器（majolica 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"painted tin-glazed pottery (especially Italian-style earthenware) with colorful designs; “majolicas” is the plural form of “majolica.”","zh":"彩绘锡釉陶（尤指意大利风格的陶器/陶盘），常有鲜艳图案；“majolicas”是“majolica”的复数形式。"},"examples":[{"en":"The museum displayed several Renaissance majolicas with bright blue and yellow patterns.","zh":"博物馆展出了几件文艺复兴时期的彩绘锡釉陶，带有明亮的蓝黄图案。"},{"en":"She collects majolicas—plates, vases, and small bowls—from antique markets.","zh":"她收藏彩绘锡釉陶——盘子、花瓶和小碗——多从古董市场淘来。"}]}],"synonyms":["maiolica","tin-glazed earthenware","ceramics","pottery"],"phonetic":"/məˈdʒɑlɪkə/","extraExplanation":["“majolica/majolicas”常见于艺术史、古董与陶瓷收藏语境，指一种在陶坯表面施白色不透明锡釉，再以鲜艳颜料绘饰的陶器风格。","词源与传播：该工艺与风格在意大利发展并流行，名称通常与意大利语及地中海贸易有关（常被认为与马略卡岛 Majorca 的贸易联系相关）。","拼写提示：英语里也可见变体拼写“maiolica”（更贴近意大利语拼写），在博物馆标签或艺术史书中较常见。"]}
{"word":"majolist","summary":{"en":"“Majolist” is not a standard English word; it’s likely a typo or a name, often intended to mean “major list.”","zh":"“majolist”不是标准英语词；多半是拼写错误或专有名称，常见意图是“major list（专业/重要清单）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often seen as a typo or as a username/product name. In many contexts, people actually mean “major list” (a list of majors/important items).","zh":"不是标准英语词；常见于拼写错误，或作为用户名/产品名。在很多语境中，人们可能想写的是“major list”（专业列表/重要事项清单）。"},"examples":[{"en":"I can’t find “majolist” in the dictionary—did you mean “major list”?","zh":"我在词典里找不到“majolist”——你是不是想写“major list”？"},{"en":"Please check the major list of courses before you register.","zh":"请在选课前查看课程的专业/主要课程清单。"}]}],"synonyms":["major list","list of majors","main list"],"phonetic":"ˈmeɪdʒoʊlɪst","extraExplanation":["“majolist”本身没有被主流词典收录，因此更可能是：\n1）把“major list”连写了；\n2）把“major”误拼成“majo”，再加上“list”；\n3）某个平台/软件里的专有名词。\n如果你能提供一句完整的上下文（例如它出现在哪个句子或界面里），我可以更准确地解释它想表达的意思。"]}
{"word":"majoon","summary":{"en":"Majo(o)n is a sweet paste-like confection; in some regions it may contain hashish, and in traditional medicine it can also mean an herbal honey-based paste.","zh":"Majo(o)n 指一种甜的糊状点心；在部分地区可能含哈希什；在传统医学中也可指草药加蜂蜜/糖浆制成的药用膏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sweet, paste-like confection (especially in North Africa and the Middle East), sometimes made with hashish (cannabis resin) as an edible.","zh":"（尤指北非与中东的）一种甜的糊状点心/糖膏；有时会加入大麻树脂（哈希什）作为食用型大麻制品。"},"examples":[{"en":"In the novel, the traveler is offered majoon with tea and warned to eat only a little.","zh":"小说里，旅人被请吃配茶的 majoon，并被提醒只吃一点点。"},{"en":"Some recipes describe majoon as a spiced nut-and-honey paste.","zh":"有些食谱把 majoon 描述为加入香料的坚果蜂蜜甜膏。"}]},{"partOfSpeech":"n.","definition":{"en":"In Unani/Arabic-Persian medical tradition, an herbal electuary—a thick paste of herbs mixed with honey or syrup, taken as medicine.","zh":"在尤那尼医药与阿拉伯—波斯医学传统中，指“药膏/蜜丸膏（electuary）”：把药材与蜂蜜或糖浆调成稠膏来服用。"},"examples":[{"en":"The practitioner prescribed a majoon made from herbs and honey.","zh":"医师开了一种由草药与蜂蜜制成的 majoon。"},{"en":"Traditional majoon is stored in a jar and taken in small spoonfuls.","zh":"传统的 majoon 常装在罐子里，每次用小勺取少量服用。"}]}],"synonyms":["ma'jun","majoun","electuary","herbal paste"],"phonetic":"/mæˈdʒuːn/","extraExplanation":["词源上常对应阿拉伯语 معجون (maʿjūn)，本义接近“揉合成的膏/糊”。因此它既可指甜点式的“膏”，也可指药用的“蜜膏/药膏”。","在一些地区，“majoon”特指含哈希什的可食用大麻制品；但不同国家与语境含义不一。涉及大麻成分的版本在许多地方可能违法或受严格管制，阅读或交流时要注意语境与当地法律。"]}
{"word":"major","summary":{"en":"“Major” most often means a college subject you study (noun) or to study it (verb), and it can also mean very important/serious (adjective).","zh":"“major”最常指大学的主修专业（名词）或“主修”（动词），也可表示“重大的/重要的/严重的”（形容词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Most common) A person’s main subject of study in college or university.","zh":"（最常见）大学/学院里一个人的主修专业。"},"examples":[{"en":"She decided to major in biology because she loves science.","zh":"她决定主修生物学，因为她喜欢科学。"},{"en":"What’s your major?","zh":"你的专业是什么？"}]},{"partOfSpeech":"v.","definition":{"en":"To study something as your main subject in college or university.","zh":"（在大学/学院）主修某一学科。"},"examples":[{"en":"He majors in computer science.","zh":"他主修计算机科学。"},{"en":"I majored in history, but I work in marketing now.","zh":"我主修历史，但现在在做市场营销。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very important; bigger or more serious than usual.","zh":"重大的；重要的；较严重的（比一般更大/更严重）。"},"examples":[{"en":"This is a major decision, so take your time.","zh":"这是一个重大决定，所以慢慢考虑。"},{"en":"The storm caused major damage to the coast.","zh":"这场风暴对海岸造成了严重破坏。"}]},{"partOfSpeech":"n.","definition":{"en":"A military officer of a rank above captain and below lieutenant colonel.","zh":"（军衔）少校（高于上尉，低于中校）。"},"examples":[{"en":"Major Thompson spoke to the new recruits.","zh":"汤普森少校对新兵讲话。"}]}],"synonyms":["main","important","serious","principal","specialize in (v., close meaning)"],"phonetic":"/ˈmeɪdʒər/","extraExplanation":["在美式英语里，问别人“What's your major?”通常是问大学专业；回答时常用“I’m a biology major.”（我是生物专业的）或“I major in biology.”（我主修生物）。","注意区分：名词 major（专业） vs. 动词 major in（主修……）。动词后面通常要接介词 in：major in math / major in economics。","形容词 major 常与这些名词搭配：major problem（重大问题）、major change（重大变化）、major cause（主要原因）、major damage（严重损害）。"]}
{"word":"major-leaguer","summary":{"en":"a top-level professional player; by extension, a leading figure","zh":"顶级职业选手；引申为某领域的一线人物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a player in Major League Baseball (MLB), or more generally a person who competes at the top professional level in a sport or field","zh":"美国职棒大联盟（MLB）球员；引申为在某个领域处于最高职业水平的人"},"examples":[{"en":"He finally became a major-leaguer after years in the minor leagues.","zh":"他在小联盟打了多年后，终于成为大联盟球员。"},{"en":"She’s a major-leaguer in tech—everyone knows her work.","zh":"她在科技圈是顶尖人物——大家都知道她的成果。"}]}],"synonyms":["big leaguer","top pro","star","ace","leading figure"],"phonetic":"/ˈmeɪdʒər ˌliːɡər/","extraExplanation":["在美国棒球语境里，minor leaguer（小联盟球员）通常指发展联盟/较低级别联赛球员；major-leaguer 带有“已站上最高舞台”的意味。","引申用法常见于商业、科技、娱乐等领域，表示“重量级人物/一线选手”。"],"etymology":"源自美国职业棒球体系：Major League（大联盟）+ -er（表示“……的人”）。最初专指大联盟球员，后来常用于比喻“顶级高手”。","mnemonic":["Major = “主要/大的”，league = “联盟”，-er = “人” → “大联盟的人”。","联想：能进“MLB大联盟”的，都是“顶级玩家/高手”。"]}
{"word":"majora","summary":{"en":"Majora is a Latin plural meaning “the larger ones,” most often seen in anatomical terms like labia majora.","zh":"Majora 是拉丁语复数，意为“较大者”，最常见于解剖学术语如 labia majora（大阴唇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Latin plural meaning “the larger ones,” used in English mainly in anatomy (most commonly in the phrase “labia majora”).","zh":"拉丁语复数形式，意为“较大的那些/大者”，在英语里主要用于解剖学术语中（最常见于短语 labia majora）。"},"examples":[{"en":"In anatomy class, we learned that the labia majora are the outer folds of the vulva.","zh":"在解剖课上，我们学到 labia majora（大阴唇）是外侧的皮褶。"},{"en":"The report uses the term “majora” only as part of Latin names, not as an everyday English word.","zh":"这份报告里的“majora”只作为拉丁名称的一部分使用，并不是日常英语词。"}]}],"synonyms":["larger ones (contextual)","the greater (contextual)"],"phonetic":"/məˈdʒɔrə/","extraExplanation":["“majora”来自拉丁语比较级 major（“更大/较大”）的中性或阴性复数形式，字面意思是“较大的那些”。在英语医学/解剖语境中，常保留拉丁语的复数形式，与对应的“minora（较小者）”成对出现，例如：labia majora / labia minora。单独说“majora”在日常英语里并不常见，通常需要搭配具体名词。"]}
{"word":"majorat","summary":{"en":"Majorat is a historical inheritance system where an estate is kept intact and passed to one heir (often the eldest), and it can also mean the entailed estate itself.","zh":"Majorat 指一种历史上的继承制度：家族地产不分割，由一名继承人（常为长子）继承；也可指受此制度约束的那份庄园/财产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(law, history) A system of inheritance in which a family estate is kept together and passed down to the eldest (or a single designated) heir, instead of being divided among children.","zh":"（法律／历史）“长子继承制”式的财产继承安排：家族地产/庄园不分割，由长子（或指定的单一继承人）继承。"},"examples":[{"en":"Under a majorat, the estate could not be split among the heirs.","zh":"在 majorat 制度下，庄园不能在继承人之间分割。"},{"en":"The novel mentions a majorat that keeps the family land in one person’s hands.","zh":"小说提到一个 majorat，使家族土地始终掌握在一个人手里。"}]},{"partOfSpeech":"n.","definition":{"en":"The property/estate that is tied to such an inheritance rule (an entailed estate).","zh":"（引申）受 majorat 继承规则约束的财产/庄园（类似“限定继承的地产”）。"},"examples":[{"en":"He inherited the majorat along with the title.","zh":"他继承了头衔，也继承了那份 majorat 庄园。"}]}],"synonyms":["primogeniture","entail","entailed estate"],"phonetic":"/ˌmædʒəˈrɑː/","extraExplanation":["majorat 是法语借词，常见于欧洲贵族与旧式财产制度的语境，尤其与“保持家族地产不被分割、维持家族地位”有关。英文里它相对少见，阅读历史、法律或文学作品时更可能遇到。","相关概念：primogeniture（长子继承制，更宽泛的制度概念）、entail（限定继承/不许随意处分的地产安排）。两者常在同一语境中出现，但并不完全等同。"]}
{"word":"majorate","summary":{"en":"Majorate means to increase or make something greater; it’s formal and uncommon in modern English.","zh":"majorate 表示“增加/提高/使更大（有时含夸大之意）”，属于正式且较少使用的词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to increase or make something larger, higher, or more important (formal, uncommon)","zh":"（正式且不常用）增加；提高；使变大/更高/更重要"},"examples":[{"en":"The company decided to majorate its investment in renewable energy.","zh":"这家公司决定增加对可再生能源的投资。"},{"en":"Some critics say the report majorates the risks without enough evidence.","zh":"一些批评者说，这份报告在证据不足的情况下夸大了风险。"}]}],"synonyms":["increase","raise","boost","augment","enlarge"],"phonetic":"/ˈmeɪdʒəreɪt/","extraExplanation":["“majorate”在现代英语里很少见，常见的替代词是“increase / raise / boost / enlarge / augment”。在写作中如果想更自然，通常用这些更常用的词。","它源自拉丁语词根“major”（更大、更重要），因此常带有“使……更大/更重要/更显著”的语感；有时也会被用来表示“夸大”。"]}
{"word":"majoration","summary":{"en":"Majoration means an increase, especially a formal/technical increase or a surcharge added to a base amount.","zh":"Majoration 指“上调/增加”，常见于正式或技术语境；也可指在基础金额上加收的“附加费/溢价”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an increase or raising of an amount, price, rate, or level (often used in formal or technical contexts)","zh":"（金额、价格、费率、水平等的）上调；增加（多用于正式或技术语境）"},"examples":[{"en":"The contract allows a majoration of the fee after the first year.","zh":"合同允许在第一年之后上调费用。"},{"en":"Any majoration of prices must be approved by management.","zh":"任何价格上调都必须经管理层批准。"}]},{"partOfSpeech":"n.","definition":{"en":"a surcharge or premium added to a base price, especially in insurance or finance","zh":"（尤指保险或金融中的）加价；附加费；溢价"},"examples":[{"en":"Drivers under 25 may pay a majoration on their insurance premium.","zh":"25岁以下的驾驶者可能需要支付保险费的附加费。"},{"en":"A majoration is applied when the payment is late.","zh":"逾期付款会加收附加费用。"}]}],"synonyms":["increase","raise","uplift","markup","surcharge","premium"],"phonetic":"/ˌmeɪdʒəˈreɪʃən/","extraExplanation":["“Majoration”在英语里相对少见，常见于欧洲（尤其受法语影响的语境）或法律、保险、行政文件中；日常英语更常用 increase、raise、surcharge、markup 等。","词源上与法语 majoration 关系密切，来自拉丁语词根 major-（“更大”）。"]}
{"word":"Majorcan","summary":{"en":"connected with the island of Majorca (Mallorca) or its people","zh":"与马略卡岛（马洛卡岛）及其居民相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Majorca (Mallorca), an island in Spain, or to its people, culture, or language variety.","zh":"与马略卡岛（马洛卡岛，西班牙）有关的；马略卡岛人的；马略卡文化/语言变体的。"},"examples":[{"en":"We tried Majorcan food like sobrassada and ensaïmada.","zh":"我们尝了马略卡美食，比如sobrassada香肠酱和ensaïmada螺旋甜面包。"},{"en":"She studies Majorcan traditions and local festivals.","zh":"她研究马略卡的传统和当地节庆。"},{"en":"Majorcan beaches can be crowded in summer.","zh":"马略卡的海滩夏天可能很拥挤。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Majorca (Mallorca).","zh":"马略卡岛人（马洛卡人）。"},"examples":[{"en":"As a Majorcan, he knows the island’s hidden coves well.","zh":"作为马略卡人，他很了解岛上那些隐秘的小海湾。"},{"en":"Many Majorcans speak Catalan as well as Spanish.","zh":"许多马略卡人除了西班牙语，也会说加泰罗尼亚语。"}]}],"synonyms":["Mallorcan"],"phonetic":"/məˈjɔrkən/","extraExplanation":["Majorca/Mallorca 是西班牙巴利阿里群岛（Balearic Islands）中最大的岛。英语里你可能同时看到 Majorca（较传统）和 Mallorca（更贴近当地拼写）。因此也会看到 Majorcan 与 Mallorcan 两种形式。","在旅游与文化语境中，Majorcan 常用来描述当地特色：饮食、建筑、手工艺、方言等。"],"etymology":"源自地名 Majorca（今更常见拼写 Mallorca）+ 形容词/名词后缀 -an（表示“……的 / ……人”）。英文里 Majorcan 与 Mallorcan 常指同一对象，只是拼写传统不同。","mnemonic":["把它拆开记：Majorca + -n/-an → “马略卡的 / 马略卡人”。看到 -an 就联想到“某地的人或某地的东西”（如 American）。","联想中文：马略卡（Majorca）+ 人（-an）→ 马略卡人。"]}
{"word":"majorcan","summary":{"en":"Majorcan means “from or related to Majorca (Mallorca), Spain,” and can also mean a person from there.","zh":"Majorcan 指“来自或与西班牙马略卡岛（Majorca/Mallorca）有关的”，也可指“马略卡岛人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Majorca (Mallorca), the largest of Spain’s Balearic Islands; from Majorca.","zh":"与马略卡岛（Majorca/Mallorca，西班牙巴利阿里群岛最大岛）有关的；来自马略卡岛的。"},"examples":[{"en":"Majorcan cuisine often features olive oil, seafood, and almonds.","zh":"马略卡岛的美食常以橄榄油、海鲜和杏仁为特色。"},{"en":"They stayed in a small Majorcan village near the coast.","zh":"他们住在一个靠海的小马略卡岛村庄里。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Majorca (Mallorca).","zh":"马略卡岛人；来自马略卡岛的人。"},"examples":[{"en":"She’s a Majorcan who moved to Barcelona for university.","zh":"她是马略卡岛人，为了上大学搬到了巴塞罗那。"},{"en":"Many Majorcans speak both Spanish and Catalan.","zh":"许多马略卡岛人既会说西班牙语，也会说加泰罗尼亚语。"}]}],"synonyms":["Mallorcan"],"phonetic":"/məˈdʒɔrkən/","extraExplanation":["“Majorcan”和“Mallorcan”都常见，指同一个地方：Majorca（西语常用 Mallorca）。在当地也能看到“Mallorquí”（加泰罗尼亚语/马略卡方言）这种写法。"]}
{"word":"majordomo","summary":{"en":"A majordomo is the manager of a grand household (or, figuratively, someone who keeps an operation running).","zh":"majordomo 指大宅邸的“总管/管家长”，也可引申为负责统筹管理、让事情顺利运转的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person in charge of running a large household or estate; the head servant who manages other staff and daily operations.","zh":"（大宅邸/庄园的）总管；管家长，负责管理其他仆役与日常事务的人。"},"examples":[{"en":"The majordomo organized the dinner party and directed the household staff.","zh":"总管安排了晚宴，并指挥家中的仆役。"},{"en":"In historical novels, the majordomo often controls access to the master of the house.","zh":"在历史小说里，总管常常掌控谁能见到家主。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly (sometimes humorous): a person who manages or oversees an organization or an important set of arrangements.","zh":"（引申，常带幽默）总管式的人；负责统筹管理某个机构或重要安排的人。"},"examples":[{"en":"She became the unofficial majordomo of the office, keeping everything running smoothly.","zh":"她成了办公室里非正式的“总管”，让一切运转顺畅。"}]}],"synonyms":["steward","household manager","head butler","chief servant"],"phonetic":"/ˌmeɪdʒərˈdoʊmoʊ/","extraExplanation":["词源上来自拉丁语，字面含义接近“家中最大的（负责人）”。在英语里它常见于描写贵族宅邸、庄园或历史背景的作品中，语气通常比 butler（管家）更“总管/管家长”，强调管理与统筹。","文化语境：现代现实生活中不常用，更多出现在文学、影视、酒店/豪华场景的描写里；在日常英语中可用 head butler、household manager、steward 等更直观。"]}
{"word":"majordomos","summary":{"en":"Majordomos are chief stewards—people who manage a household staff or oversee operations in places like hotels or clubs.","zh":"majordomos 是“总管/主管”的复数：指管理家仆的总管，或在酒店、俱乐部等机构负责日常运营的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chief steward or head servant in a large household, responsible for managing other staff and overseeing daily operations.","zh":"（大户人家中的）总管、管家总负责人；负责管理其他仆役并统筹日常事务。"},"examples":[{"en":"The majordomo greeted the guests and directed the servants.","zh":"总管迎接客人，并指挥仆役们做事。"},{"en":"In the old mansion, the majordomo kept the household running smoothly.","zh":"在那座老宅里，总管让整个家务运转得井井有条。"}]},{"partOfSpeech":"n.","definition":{"en":"A person in charge of operations or administration in a hotel, restaurant, club, or similar organization; a chief attendant or manager.","zh":"（酒店、餐厅、俱乐部等的）主管、事务负责人；总领班/经理一类的人。"},"examples":[{"en":"Ask the majordomo if a table is available.","zh":"你可以问主管有没有空桌。"},{"en":"The event majordomo coordinated the staff and the schedule.","zh":"活动负责人协调了工作人员和时间安排。"}]}],"synonyms":["chief steward","head steward","steward","household manager","butler (sometimes)","manager"],"phonetic":"ˌmeɪdʒərˈdoʊmoʊ","extraExplanation":["“majordomo”源自西班牙语（也与意大利语用法相近），本义接近“更大的/主要的家务负责人”，常见于描写贵族宅邸、庄园或宫廷的场景。","你给的“majordomos”是复数形式；单数是“majordomo”。在文学或历史题材作品里，这个词常用来营造“旧时代大宅邸/贵族家中等级分明的仆役体系”的氛围。"]}
{"word":"majored","summary":{"en":"“Majored” means you studied a subject as your main focus at college/university (major in…).","zh":"“majored”表示在大学把某学科作为主修方向（major in…）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Past tense/past participle of “major”) to study a subject as your main focus in college or university.","zh":"（major 的过去式/过去分词）在大学把某一学科作为主修方向。"},"examples":[{"en":"She majored in biology and later became a doctor.","zh":"她主修生物学，后来成了医生。"},{"en":"I majored in English, but I work in marketing now.","zh":"我主修英语，但现在在做市场营销。"},{"en":"He majored in computer science at UCLA.","zh":"他在加州大学洛杉矶分校主修计算机科学。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Less common) to specialize mainly in something; to focus most effort on it.","zh":"（较不常见）主要专攻/侧重于某事；把重点放在某方面。"},"examples":[{"en":"Early in her career, she majored in portrait photography.","zh":"在职业生涯早期，她主要专攻人像摄影。"},{"en":"The team majored on defense in the second half.","zh":"下半场这支队伍把重点放在防守上。"}]}],"synonyms":["specialized (in)","studied","focused (on)"],"phonetic":"/ˈmeɪdʒərd/","extraExplanation":["在美式英语里，college/university 的“major”指“主修专业”，常见固定搭配是 **major in + 学科**（如 major in economics）。对应的“辅修”是 **minor in**。日常口语里也常说：“What did you major in?”（你主修什么？）"]}
{"word":"majorem","summary":{"en":"*Majorem* is a Latin form meaning “greater,” best known from the motto *Ad majorem Dei gloriam*.","zh":"*Majorem* 是拉丁语形式，意为“更大的/更重要的”，最常见于格言 *Ad majorem Dei gloriam*。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, accusative singular masculine of *maior*) “greater; larger; more important,” used especially in mottos and formal Latin phrases.","zh":"（拉丁语，*maior* 的宾格单数阳性形式）“更大/更高/更重要的”，常见于格言或正式拉丁短语中。"},"examples":[{"en":"The motto *Ad majorem Dei gloriam* means “For the greater glory of God.”","zh":"格言 *Ad majorem Dei gloriam* 的意思是“为了上帝更大的荣耀”。"},{"en":"In the inscription, *majorem* modifies a noun to show “greater” in the object position.","zh":"在铭文中，*majorem* 用来修饰名词，在宾格（作宾语）位置表达“更大的/更重要的”。"}]}],"synonyms":["greater","larger","more important"],"phonetic":"/məˈdʒɔrɛm/","extraExplanation":["“majorem”不是现代英语单词，而是拉丁语形容词比较级的变格形式：原级 *magnus*（大）→ 比较级 *maior*（更大）→ 其宾格单数阳性/阴性常写作 *majorem*。","你最可能在天主教/耶稣会传统中看到它：*Ad majorem Dei gloriam*（常缩写为 AMDG）是耶稣会著名格言，强调一切行为“为了更大的天主荣耀”。","发音在英语语境里通常是近似读法；若按古典拉丁读音会与英语近似不同（如 j 的发音与重音规则）。"]}
{"word":"majorette","summary":{"en":"A majorette is a baton-twirling leader/performer in a marching band or parade.","zh":"Majorette 指在行进乐队或游行中带队并挥舞指挥棒表演的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (usually a young woman) who leads a marching band or parade group, often twirling a baton and performing dance-like moves","zh":"（常指年轻女性）在游行或行进乐队中带队表演的人，常挥舞指挥棒（bâton）并配合舞步表演"},"examples":[{"en":"The majorette led the marching band down Main Street, twirling her baton in time with the music.","zh":"那位女指挥棒表演者带领行进乐队沿着主街前进，随着音乐节奏挥舞指挥棒。"},{"en":"She practiced every day to become a majorette for the school parade.","zh":"她每天练习，想在学校游行中成为指挥棒表演者。"}]}],"synonyms":["baton twirler","parade performer"],"phonetic":"/ˌmeɪdʒəˈrɛt/","extraExplanation":["“Majorette”在北美常与学校的marching band（行进乐队）、parade（游行）文化相关；形象通常包括制服、队形表演与指挥棒（baton）旋转技巧。不同地区也可能用“baton twirler”来更直白地称呼。","词源上与法语“major”（主要的、领队的）有关，带有“领头/带队”的意味。现代语境里有时也会用更中性或更具体的说法（如“drum major”指鼓队/乐队指挥）以避免性别刻板印象。"]}
{"word":"majorettes","summary":{"en":"“Majorettes” is the plural of “majorette”: performers who march with a band, often twirling batons and dancing, especially in parades and school events.","zh":"“majorettes”是“majorette”的复数：随乐队行进表演、常转指挥棒并舞动的表演者，常见于游行与校园活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A majorette; a female performer (often a teenager or young adult) who marches with a band and leads or entertains the crowd, typically by twirling a baton and doing dance moves.","zh":"（常指）女司令台/女领队；随乐队行进表演的女性表演者，常通过甩指挥棒（花式转棒）和舞蹈动作带动气氛。"},"examples":[{"en":"The majorettes twirled their batons at the front of the marching band.","zh":"女领队们在行进乐队前排挥舞并旋转指挥棒表演。"},{"en":"Our school has two majorettes who perform at football games and parades.","zh":"我们学校有两位女领队，会在橄榄球比赛和游行中表演。"}]}],"synonyms":["baton twirlers","marching band performers","parade performers"],"phonetic":"/ˌmædʒəˈrɛts/","extraExplanation":["“majorette”多用于美国的行进乐队（marching band）文化和节庆游行语境。词尾 -ette 常带有“小/女性化”的意味，因此传统上指女性；现代语境中也有人用更中性的说法，如 “baton twirler(s)”（转棒表演者）或直接说 “band leader(s)” 视具体角色而定。"]}
{"word":"majoring","summary":{"en":"“Majoring” means studying a main subject at college/university (majoring in something).","zh":"“Majoring”指在大学里主修某个专业（majoring in + 学科）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"studying a main subject (a “major”) at a college or university; specializing in a field","zh":"（在大学）主修某一专业；专攻某个领域"},"examples":[{"en":"She is majoring in computer science.","zh":"她主修计算机科学。"},{"en":"I’m thinking about majoring in economics next year.","zh":"我在考虑明年主修经济学。"},{"en":"He’s majoring in English but also taking art classes.","zh":"他主修英语，但也在上艺术课。"}]},{"partOfSpeech":"vi.","definition":{"en":"giving most attention, time, or effort to something (less common in everyday conversation)","zh":"把主要精力放在某事上（较少用于日常口语）"},"examples":[{"en":"The report is majoring on the causes of the problem.","zh":"这份报告主要聚焦于问题的成因。"},{"en":"Our discussion is majoring on solutions, not blame.","zh":"我们的讨论主要集中在解决方案上，而不是追责。"}]}],"synonyms":["specializing","studying (as a main subject)","focusing (on)"],"phonetic":"/ˈmeɪdʒərɪŋ/","extraExplanation":["在美国大学语境里，major 是“主修专业”。学生通常会说“major in + 学科”（majoring in biology）。除了 major，常见的相关词还有：minor（辅修）、double major（双主修）、declare a major（正式确定/申报专业）。有些学校大一大二可以先探索课程，之后再 declare a major。"]}
{"word":"majorism","summary":{"en":"Majorism is majority-first decision-making, often criticized for neglecting minority rights.","zh":"Majorism 指“多数至上”的决策取向，常被批评为忽视少数权利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The idea or practice that the majority should rule in politics or decision-making, sometimes ignoring the rights or needs of minorities.","zh":"（政治/决策中）“多数至上”的理念或做法，强调由多数决定，有时会忽视少数群体的权利与需求。"},"examples":[{"en":"Critics warned that majorism could silence minority voices in parliament.","zh":"批评者警告说，多数至上可能会让议会中的少数声音被压制。"},{"en":"A healthy democracy needs majority rule, but it must avoid majorism.","zh":"健康的民主需要多数决，但必须避免多数至上。"}]}],"synonyms":["majoritarianism","tyranny of the majority","majority-first politics"],"phonetic":"/ˈmeɪdʒəˌrɪzəm/","extraExplanation":["“majorism”常见于政治学与社会评论语境，带有批判色彩：它不是中性的“多数决（majority rule）”，而是指把“多数的意愿”当成唯一正当性来源，从而弱化宪法保障、少数权利、司法独立或权力制衡等机制。","近义概念可对比：majority rule（多数决，较中性） vs. majoritarianism（多数主义/多数至上，学术上更常见；majorism相对少见但意思接近）。"]}
{"word":"majorist","summary":{"en":"Majorist means supporting majority rule, or a person who favors the majority’s power in politics, sometimes at the expense of minority rights.","zh":"majorist 指支持多数统治的（或这样的人），有时含“多数派压过少数权利”的批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports majority rule in politics, especially the idea that the majority’s wishes should outweigh minority rights or protections","zh":"（政治）主张“多数决定/多数统治”的人；多数派至上主义者（尤指认为多数意志应压倒少数权利或保障）"},"examples":[{"en":"Critics argued that the policy was driven by majorists who ignored minority concerns.","zh":"批评者认为这项政策是由多数派至上主义者推动的，他们忽视了少数群体的关切。"},{"en":"In a divided society, a majorist approach can increase tension.","zh":"在一个分裂的社会里，多数派至上的做法可能会加剧紧张。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting majority rule; favoring the majority’s power or preferences over minority protections","zh":"（政治立场）支持多数统治的；偏向多数派权力或偏好的"},"examples":[{"en":"The debate contrasted majorist politics with protections for minority rights.","zh":"这场辩论将多数派政治与少数群体权利保护作了对比。"},{"en":"Some commentators called the proposal majorist and potentially unfair.","zh":"一些评论员称该提案是“多数派至上”的，可能不公平。"}]}],"synonyms":["majoritarian","majoritarianism supporter","majority-rule advocate"],"phonetic":"/ˈmeɪdʒərɪst/","extraExplanation":["“majorist”不是非常常见的日常用词，更常见的相关词是“majoritarian”（多数统治的）和“majoritarianism”（多数派至上/多数统治主义）。","在政治与法治语境中，它常带批评意味：强调“多数决定”可能会牺牲少数群体的权利或程序正义。"]}
{"word":"majoristic","summary":{"en":"Majoristic means favoring the majority, often implying a “majority-over-minority” attitude.","zh":"majoristic 指偏向多数人的、偏“多数至上”的，常暗示多数压过少数的倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring the majority (of people or opinions), often in a way that gives the majority more power than minority groups","zh":"偏向多数人的；多数至上的（常指让多数群体获得更大权力、相对忽视少数群体）"},"examples":[{"en":"The proposal was criticized as majoristic because it reduced protections for minority communities.","zh":"这项提案被批评为“多数至上”，因为它削弱了对少数群体的保护。"},{"en":"A majoristic approach can win elections, but it may deepen social divisions.","zh":"“多数至上”的做法可能赢得选举，但也可能加深社会分裂。"}]}],"synonyms":["majoritarian","majority-rule","populist (sometimes)"],"phonetic":"/ˌmeɪdʒəˈrɪstɪk/","extraExplanation":["“majoristic”不是非常常见的词，更常见的表达是“majoritarian”（多数派的／多数至上的）或“majority-rule”（多数决）。在政治与社会讨论中，它常带有批评意味：强调多数决定一切，而没有充分保障少数群体的权利与利益。"]}
{"word":"majoritarian","summary":{"en":"Majoritarian means based on or favoring the power and decisions of the majority, especially in politics.","zh":"majoritarian 指以多数人的权力与决定为基础或偏向多数原则的，尤用于政治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supporting or based on the wishes, power, or rule of the majority (more than half of a group), especially in politics.","zh":"支持或以多数人的意愿、权力或统治为基础的（尤指政治上）。"},"examples":[{"en":"The party took a majoritarian approach and focused on winning the largest voting bloc.","zh":"该政党采取多数主义的方式，重点争取最大的投票群体。"},{"en":"Critics worry that majoritarian politics can ignore the rights of minorities.","zh":"批评者担心，多数主义政治可能会忽视少数群体的权利。"}]}],"synonyms":["majority-based","populist","democratic (in a majority-rule sense)"],"phonetic":"/məˌdʒɔrəˈtɛriən/","extraExplanation":["“majoritarian”常用于政治学与公共讨论，和“democracy（民主）”有关，但语气不一定是褒义：它既可以中性地描述“按多数决定”，也常用于提醒“多数的决定可能压过少数权利”。","常见搭配：majoritarian rule（多数统治）、majoritarian democracy（多数民主）、majoritarian system（多数制/多数选举制度）。注意与“majority（多数）”区分：majoritarian更强调“以多数为原则/标准”的倾向或制度。"]}
{"word":"majoritarianism","summary":{"en":"Majoritarianism is the idea that the majority should decide, sometimes at the expense of minority rights.","zh":"多數主義指以多數人的意志作為決定依據，但有時會以犧牲少數權利為代價。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief or practice that the majority’s wishes should decide political or social outcomes, sometimes without enough protection for minority rights.","zh":"多數主義；主張以多數人的意志決定政治或社會結果的信念或做法，有時會忽視或不足以保障少數群體的權利。"},"examples":[{"en":"Critics warned that majoritarianism could weaken protections for religious minorities.","zh":"批評者警告，多數主義可能削弱對宗教少數群體的保護。"},{"en":"A healthy democracy balances majority rule with safeguards against majoritarianism.","zh":"健康的民主會在多數決與防止多數主義之間取得平衡。"}]}],"synonyms":["majority rule","majority dominance","populist majoritarianism"],"phonetic":"/məˌdʒɔːrəˈtɛriəˌnɪzəm/","extraExplanation":["“majoritarianism”常用於政治學與公共討論，帶有評價色彩：它不只是「多數決」(majority rule) 這個程序，更常指「只要多數贏就行」的心態或治理方式，可能導致所謂“tyranny of the majority”（多數暴政）。","在比較語境中，它常與“pluralism”（多元主義）或“consociationalism”（協商式民主/共治）對比：前者更強調多元利益的共存與妥協，後者強調在分裂社會中由不同群體共享權力。"]}
{"word":"majorities","summary":{"en":"“Majorities” means more than half (or the largest voting group) in several groups or situations; it can also mean reaching legal adulthood in multiple cases.","zh":"“majorities”是“majority”的复数，指多个群体/情境中的“多数（超过一半或最大票数阵营）”；也可指多处语境中的“法定成年”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the larger number or greater part of a group; more than half","zh":"（一组中的）多数；大多数（通常指超过一半）"},"examples":[{"en":"The proposal passed with a clear majority.","zh":"该提案以明显多数获得通过。"},{"en":"A majority of students prefer online materials.","zh":"大多数学生更喜欢在线资料。"}]},{"partOfSpeech":"n.","definition":{"en":"the largest group in a vote or election, even if it is not more than half (often contrasted with “plurality”)","zh":"（选举/表决中的）最大票数阵营；相对多数（有时不一定超过一半）"},"examples":[{"en":"She won a majority in the final round of voting.","zh":"她在最后一轮投票中赢得了多数票。"},{"en":"They formed a majority coalition in parliament.","zh":"他们在议会组成了多数联盟。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being an adult; the legal age when someone becomes fully responsible in law","zh":"（法律意义上的）成年；法定成年年龄"},"examples":[{"en":"In many places, you reach your majority at 18.","zh":"在许多地方，18岁达到法定成年。"},{"en":"He came into his inheritance on reaching his majority.","zh":"他到法定成年时继承了遗产。"}]}],"synonyms":["most","the greater part","the bulk","the larger number","pluralities (in some voting contexts)"],"phonetic":"/məˈdʒɔːrətiz/","extraExplanation":["“majorities”是“majority”的复数形式。常见搭配：a/the majority of + 复数名词（the majority of voters），或直接用作名词（win a majority，a majority government）。","在英美政治语境里，majority 常与选举和议会相关：majority party（多数党）、majority leader（多数党领袖）、majority vote（多数票表决）。"]}
{"word":"majority","summary":{"en":"Majority means more than half of a group, or the group/side with more votes; it can also mean legal adulthood.","zh":"majority 指“超过一半/大多数”，也可指“多数派/多数票”，还可表示“法定成年”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"More than half of a group or total number; the larger part.","zh":"（数量上）超过一半；大多数；多数部分。"},"examples":[{"en":"The majority of students preferred online classes.","zh":"大多数学生更喜欢线上课程。"},{"en":"A majority of 60% voted in favor of the plan.","zh":"有60%的多数票赞成该计划。"}]},{"partOfSpeech":"n.","definition":{"en":"The side or group that has more votes in an election or decision.","zh":"（投票/决策中的）多数派；多数票一方。"},"examples":[{"en":"The proposal passed by a narrow majority.","zh":"该提案以微弱多数通过。"},{"en":"The majority in Congress supported the new law.","zh":"国会中的多数派支持这项新法律。"}]},{"partOfSpeech":"n.","definition":{"en":"The age or status of being legally an adult.","zh":"（法律意义上的）成年；成年年龄。"},"examples":[{"en":"In many places, you reach majority at 18.","zh":"在许多地区，18岁达到法定成年。"}]}],"synonyms":["most (informal)","the greater part","the bulk","the larger share"],"phonetic":"/məˈdʒɔːrəti/","extraExplanation":["常见搭配：the majority of + 复数名词（the majority of people），或 the majority of + 不可数名词（the majority of the time）。","语法小提示：the majority of + 复数名词时，动词通常用复数（The majority of students are...）；但在强调“整体”作为一个单位时也可能用单数（The majority of the committee is...），取决于语境。","与 most 的区别：most 常用于更口语/直接的表达（Most students...）；majority 更正式，常用于统计、投票、政治与报告（a majority of / the majority）。"]}
{"word":"majority-backed","summary":{"en":"supported by more than half of a group","zh":"获得超过半数支持的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supported or endorsed by more than half of a group (such as voters, members, or shares).","zh":"得到某个群体中“超过半数”支持或背书的（如选民、成员或股份）。"},"examples":[{"en":"The bill became law after a majority-backed vote in the senate.","zh":"这项法案在参议院获得多数支持的表决后成为法律。"},{"en":"They announced a majority-backed plan to reform the school system.","zh":"他们公布了一项获得多数支持的学校改革方案。"}]}],"synonyms":["majority-supported","majority-approved","majority-endorsed","widely supported","backed by a majority"],"phonetic":"/məˈdʒɔrəti bækt/","extraExplanation":["常见搭配：majority-backed proposal/plan/decision/government/coalition（多数支持的提案/计划/决定/政府/联盟）。","写作提示：作定语放在名词前时更常写作 majority-backed（带连字符）；放在系动词后作表语时也可写作 backed by a majority（如：The plan is backed by a majority. / 该计划得到多数支持）。","注意区别：majority-backed 强调“超过半数的支持”；broadly backed/strongly backed 强调“支持范围广/力度强”，不一定超过半数。"],"etymology":"由 majority（“多数”）+ backed（“支持的、背书的”）构成的复合形容词；back 在这里表示“支持/撑腰”。常用连字符表示两个部分共同修饰后面的名词。","mnemonic":["把它拆开记：majority=“大多数”，backed=“有人撑腰/支持”，合起来就是“有大多数撑腰的”。","联想中文新闻常说的“获多数支持/多数派支持”，看到 backed 就想到“背书”。"]}
{"word":"majority-based","summary":{"en":"Decided according to what the larger group chooses.","zh":"以多数人的选择或多数票为依据的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Based on what most people in a group think, want, or choose; decided by the greater number of votes or members.","zh":"以多数人的意见/选择为依据的；由多数票或多数成员决定的。"},"examples":[{"en":"The committee uses a majority-based voting system to approve new policies.","zh":"委员会采用多数票制来通过新政策。"},{"en":"In a majority-based decision, the option with the most votes wins, even if it’s not everyone’s first choice.","zh":"在多数决定中，得票最多的选项会获胜，即使它不是每个人的首选。"},{"en":"They criticized the plan for being too majority-based and ignoring smaller groups.","zh":"他们批评这个方案过于“多数导向”，忽视了小群体的声音。"}]}],"synonyms":["majoritarian","majority-rule","vote-based","democratic"],"phonetic":"/məˈdʒɔrəti beɪst/","extraExplanation":["在讨论制度时，majority-based 常与 minority rights（少数权利）形成对比：多数决定可以提高效率，但也可能带来“多数暴政”（majority tyranny）的担忧，因此一些制度会加入保护少数的规则（如更高门槛、否决权、比例代表制等）。"],"etymology":"由 majority（“多数”）+ based（“以……为基础的”）构成的复合形容词，常见于政治、投票、组织决策等语境，用来强调“依多数而定”。","mnemonic":["拆开记：majority = “多数”，based = “基于……”。合起来就是“基于多数（人/票）”。","联想中文：多数表决 = majority-based decision（多数决定）。"]}
{"word":"majority-favoring","summary":{"en":"biased toward the majority.","zh":"偏向多数的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to benefit or give an advantage to the majority group or the option supported by most people.","zh":"偏向多数（人/群体/观点），给予多数一方优势的。"},"examples":[{"en":"The new district map was criticized as majority-favoring and unfair to smaller communities.","zh":"新的选区划分被批评为偏向多数、对较小社区不公平。"},{"en":"A majority-favoring rule can make it hard for minority voices to be heard.","zh":"偏向多数的规则会让少数声音更难被听见。"}]}],"synonyms":["majoritarian","majority-biased","winner-take-all","pro-majority","biased"],"phonetic":"/məˈdʒɔrəti ˈfeɪvərɪŋ/","extraExplanation":["常见于讨论“多数决”与“少数权利”的平衡：多数导向的制度往往提高决策效率，但可能造成少数群体代表性不足。类似语境还会出现 majority rule（多数决）、minority rights（少数权利）、winner-take-all（赢者通吃）。"],"etymology":"由 majority（多数）+ favoring（偏向、支持）构成的合成形容词；多用于政治、选举制度、制度设计等语境，表示“制度或安排在结果上更有利于多数”。","mnemonic":["把它拆开记：majority（多数）+ favoring（偏心/偏向）→“偏向多数”的。","联想中文：多数 + 偏爱 → “多数偏爱型/偏向多数”。"]}
{"word":"majority-rule","summary":{"en":"decision-making by the choice supported by more than half (or the most) votes","zh":"以过半（或最多）票数决定结果的决策原则"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the principle or system in which decisions are made by the choice supported by more than half of the voters or members","zh":"“多数决”原则：由超过半数的人支持的选择来做决定的制度或做法"},"examples":[{"en":"In the committee, we use majority-rule to approve new policies.","zh":"在委员会里，我们用多数决来通过新政策。"},{"en":"Majority-rule can be efficient, but it may overlook minority voices.","zh":"多数决可能很有效率，但也可能忽视少数人的声音。"},{"en":"The proposal passed under majority-rule with 12 votes to 8.","zh":"该提案在多数决下以12票对8票通过。"}]},{"partOfSpeech":"n.","definition":{"en":"a decision-making method where the option with the most votes wins (often implying more than half, depending on the rules)","zh":"一种投票决策方式：得票最多的选项获胜（是否必须过半取决于规则）"},"examples":[{"en":"The club used majority-rule instead of requiring a two-thirds majority.","zh":"俱乐部采用多数决，而不是要求三分之二多数。"},{"en":"Under majority-rule, the candidate with the most votes becomes president.","zh":"在多数决下，得票最多的候选人成为主席。"}]}],"synonyms":["majoritarianism","majority voting","simple majority","majority decision"],"phonetic":"/məˈdʒɔrəti ruːl/","extraExplanation":["在民主语境中，多数决常被视为基本规则，但实际制度通常会用宪法、人权保障、司法审查或“超多数”（如三分之二）等方式来保护少数群体的权利与避免“多数人的暴政”（tyranny of the majority）。"],"etymology":"由 majority（“多数”）+ rule（“规则/治理”）构成的复合词。作为政治与群体决策术语，用来表达“由多数人的选择来决定”的原则。","mnemonic":["majority = “大多数”，rule = “规则/决定方式”，合起来就是“用大多数来定规则”。","联想中文：投票时“票多的说了算”= 多数决。"]}
{"word":"majorize","summary":{"en":"Majorize is mainly a math verb meaning one vector dominates another by comparing sorted partial sums (with equal totals). It can rarely mean ‘to make something more major/important.’","zh":"Majorize 主要是数学用语，指通过“降序排序后比较部分和（且总和相等）”来说明一个向量支配另一个向量；少数情况下也可指“使……更主要/更重要”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Mathematics) To be larger than another vector in a specific ordered-sum sense (used in inequalities and linear algebra): a vector x majorizes y if, after sorting both in descending order, the partial sums of x are at least those of y, and the total sums are equal.","zh":"（数学）以一种“按大小排序后的部分和比较”的意义上“支配/优于”另一向量（常见于不等式与线性代数）：若将向量 x 与 y 都按降序排列后，x 的前 k 项和都不小于 y 的前 k 项和，且总和相等，则称 x majorizes y。"},"examples":[{"en":"In majorization theory, x majorizes y when x is more ‘uneven’ but has the same total sum.","zh":"在主序（majorization）理论中，当 x 更“分散/不均匀”但总和相同，就说 x majorizes y。"},{"en":"We can prove the inequality by showing that one sequence majorizes the other.","zh":"我们可以通过证明一组数列 majorizes 另一组数列来证明该不等式。"}]},{"partOfSpeech":"vt.","definition":{"en":"(General, rare) To make something greater in importance, size, or degree; to emphasize as “major.”","zh":"（一般用法，较少见）使某事更重要/更大/更突出；把……强调为“主要的”。"},"examples":[{"en":"The report majorizes cost control over long-term innovation.","zh":"这份报告把成本控制放在比长期创新更重要的位置。"}]}],"synonyms":["(math) dominate","(math) be more unequal than","(rare general) emphasize","prioritize"],"phonetic":"/ˈmeɪdʒəˌraɪz/","extraExplanation":["“majorize”在日常英语里不常用，最常见于数学与经济学（如不平等度量、资源分配、凸函数与不等式证明）。","数学里的 majorize 常与“排序后比较部分和”的思路绑定：它刻画的是“更不均匀/更集中”而不是简单的“更大”。因此不要把它直译为普通的“变大”。","相关术语：majorization（名词），weak majorization（弱主序，通常不要求总和相等），Schur-convex function（舒尔凸函数，常与 majorization 配套出现）。"]}
{"word":"majors","summary":{"en":"“Majors” usually means college main subjects (fields of study), and it can also mean army officers with the rank of major; as a verb, it means “to specialize in a main subject.”","zh":"“Majors”通常指大学的主修专业（复数），也可指军衔为少校的军官（复数）；作动词时表示“主修/专攻”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) The main subject(s) a student studies at college or university.","zh":"（名词复数）大学/学院里学生主要学习的专业（主修方向）。"},"examples":[{"en":"She changed her majors twice before choosing psychology.","zh":"她换了两次主修专业，最后选择了心理学。"},{"en":"STEM majors often take more lab classes.","zh":"理工科专业的学生通常要上更多实验课。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Army officers holding the rank of major (a rank above captain and below lieutenant colonel).","zh":"（名词复数）军衔为“少校（major）”的军官（高于上尉，低于中校）。"},"examples":[{"en":"Several majors attended the briefing.","zh":"几位少校参加了情况通报会。"},{"en":"The majors reviewed the training plan.","zh":"少校们审查了训练计划。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, present tense) To study something as your main subject at college or university; to specialize in.","zh":"（动词，现在时）在大学主修；以……为主要研究/学习方向。"},"examples":[{"en":"They major in computer science.","zh":"他们主修计算机科学。"},{"en":"Many students major in business because it feels practical.","zh":"很多学生主修商科，因为觉得更实用。"}]}],"synonyms":["fields of study","specializations","concentrations","disciplines","specialize (in)"],"phonetic":"/ˈmeɪdʒərz/","extraExplanation":["在美式英语里，college/university 的“major”指“主修专业”，常与“minor（辅修）”搭配：major in + 学科（major in biology）。日常对话里也会问：“What’s your major?”（你主修什么？）","“major”也可作形容词表示“重要的；重大的”（a major problem），但“majors”更常见的是“主修专业（复数）”或“少校（复数）”。"]}
{"word":"majorship","summary":{"en":"Majorship means the position, rank, or time of service of a major.","zh":"Majorship 指“少校”的职位、军衔或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, rank, or term of office of a major (especially in the military or police)","zh":"（尤指军队或警察中的）少校职位、军衔或任期"},"examples":[{"en":"He served a three-year majorship in the army before transferring to civilian work.","zh":"他在军队担任少校三年，之后转入民间工作。"},{"en":"After her promotion, she assumed the responsibilities that came with a majorship.","zh":"晋升后，她承担了少校职位所带来的职责。"}]}],"synonyms":["the rank of major","major's position","major's office"],"phonetic":"/ˈmeɪdʒɚˌʃɪp/","extraExplanation":["“majorship”在现代英语里相对少见，更常见的表达是“the rank/position of major”或直接说“a major.”","注意不要和“majority”（多数；成年）混淆：两者词形相近，但意义不同。"]}
{"word":"majos","summary":{"en":"“Majos” is a Spanish loanword (plural of “majo”), referring to stylish working-class young men in old Spain, especially Madrid.","zh":"“majos”是西班牙语借词（majo的复数），指旧时西班牙（尤指马德里）穿着大胆时髦的平民青年男子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish; plural of “majo”) fashionable, boldly dressed working‑class young men in 18th–19th century Spain, often associated with Madrid; sometimes used more broadly for people in that style.","zh":"（源自西班牙语；“majo”的复数）18—19世纪西班牙（常与马德里相关）穿着大胆时髦的平民青年男子；有时泛指这种“马霍/马哈”风格的人。"},"examples":[{"en":"In the painting, the majos wear short jackets and bright sashes.","zh":"在画作中，majos（马霍们）穿着短上衣，系着鲜艳的腰带。"},{"en":"Some writers used majos to represent a rebellious street style in old Madrid.","zh":"一些作家用majos来代表旧马德里一种叛逆的街头风格。"}]}],"synonyms":["majos (Spanish cultural term)","majo (singular)","maja (female counterpart)"],"phonetic":"ˈmɑːhoʊs","extraExplanation":["“majo/maja”是西班牙文化词：majo（男）、maja（女）。他们常被描写为衣着讲究、带点挑衅与自由气质的平民青年形象。","这个词在英语里不算常用，更多出现在艺术与历史语境中，比如戈雅（Goya）的名作《La maja desnuda》（《裸女》）与《La maja vestida》（《着衣的女子》）。","如果你本来想写的是英语“majors”（专业/主修；或“主要的”），告诉我具体句子，我可以帮你区分与改正。"]}
{"word":"majoun","summary":{"en":"Not an English dictionary word; likely a misspelling.","zh":"非词典英语词；多半是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or typo. Common intended words include “major” or “maroon,” depending on context.","zh":"不是标准英语单词；多半是拼写错误或打字错误。常见的可能目标词包括“major（主要的/专业）”或“maroon（栗色/使困在…）”，具体取决于上下文。"},"examples":[{"en":"I can’t find “majoun” in an English dictionary—did you mean “major” (your field of study)?","zh":"我在英语词典里找不到“majoun”——你是不是想写“major”（专业/主修）？"},{"en":"If you meant the color, the word is “maroon,” not “majoun.”","zh":"如果你指的是颜色，应该是“maroon（栗色）”，不是“majoun”。"}]}],"extraExplanation":["如果你把包含“majoun”的整句发我（或说明你想表达的意思：专业/主要的/颜色/人名/外来词等），我可以更准确判断你想要的词，并给出正确释义与用法。"],"etymology":"“majoun”本身不是常见英语词形，所以没有可靠的英语词源记录；通常属于拼写误差。","mnemonic":["把它当作“major”的常见误拼：major 里有“jor”，容易被误打成“joun”。"]}
{"word":"majusculae","summary":{"en":"Majusculae means capital/uppercase letter forms, especially in manuscripts (a scholarly/Latin plural form).","zh":"Majusculae 指大写/首都字母的字形（多用于手稿学语境，属学术/拉丁语复数形式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural; mainly in Latin or scholarly writing) large or capital letters; uppercase forms, especially in ancient or medieval manuscripts.","zh":"（复数；多见于拉丁语或学术写作）大写字母；大写形式，尤指古代或中世纪手稿中的大写字形。"},"examples":[{"en":"The inscription is written in majusculae rather than small, cursive letters.","zh":"这段铭文使用的是 majusculae（大写字形），而不是较小的草写字母。"},{"en":"In the manuscript, majusculae mark the beginning of important sections.","zh":"在这份手稿中，majusculae（大写字形）用来标记重要章节的开头。"}]}],"synonyms":["uppercase letters","capital letters","capitals","majuscule (more common in English)"],"phonetic":"/məˈdʒʌs.kjəˌliː/","extraExplanation":["“Majusculae”源自拉丁语，常见于古典学、古文字学/手稿学（paleography）语境。英语里更常用的形式是单数/形容词“majuscule”（意为“大写的；大写字形”），日常表达通常直接说“uppercase letters / capital letters”。","在手稿学中，“majuscule script（大写体）”常与“minuscule script（小写体）”对比：前者字形更大、更接近“印刷体”，后者更小、更便于快速书写。"]}
{"word":"majuscular","summary":{"en":"Majuscular means written in or related to capital (uppercase) letters.","zh":"majuscular 意为“用大写字母书写的；与大写字母有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"written in capital (uppercase) letters; relating to capital letters","zh":"用大写字母书写的；与大写字母有关的"},"examples":[{"en":"Please write your surname in majuscular letters on the form.","zh":"请在表格上用大写字母填写你的姓。"},{"en":"The heading is printed in a majuscular style to stand out.","zh":"标题用大写风格印刷，以便更醒目。"}]}],"synonyms":["uppercase","capital","in capitals"],"phonetic":"/məˈdʒʌskjələr/","extraExplanation":["“majuscular”比较少见，更常用的说法是“uppercase”或“capital (letters)”。在排版、古文字学（研究古代文字/手稿）或较正式的写作里，你可能会看到“majuscule/majuscule letters”（大写字母）与“minuscule”（小写字母）成对出现。","词源来自拉丁语“majusculus”（意为“稍大一些”），与“major”（较大的）同源。"]}
{"word":"majuscule","summary":{"en":"Majuscule means a capital (uppercase) letter, or writing done in uppercase—often discussed in manuscripts and typography.","zh":"Majuscule 指大写字母或大写体书写方式，常见于手稿研究与字体排印语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, capital letter (especially in ancient or medieval writing); an uppercase letter","zh":"大写字母；（尤指古代或中世纪手稿中的）大写体字母"},"examples":[{"en":"In the manuscript, each paragraph begins with a decorated majuscule.","zh":"在这份手稿中，每一段都以一个装饰性的大写体字母开头。"},{"en":"The title is written entirely in majuscules.","zh":"标题完全用大写字母书写。"}]},{"partOfSpeech":"adj.","definition":{"en":"written in capital letters; using uppercase characters","zh":"用大写字母写的；大写体的"},"examples":[{"en":"The inscription is in majuscule script, with bold, evenly sized letters.","zh":"这段铭文使用大写体书写，字形粗壮且大小均匀。"},{"en":"For readability, set the first word in majuscule.","zh":"为了易读性，把第一个词设为大写。"}]}],"synonyms":["capital letter","uppercase","uppercase letter","capital","all caps"],"phonetic":"ˈmædʒəˌskjuːl","extraExplanation":["“Majuscule”常见于字体设计、古文字学（paleography）和书籍史语境中，用来指“全大写/大写体”字形系统。与之相对的是“minuscule”（小写体），后来逐渐发展成现代的大小写体系。"]}
{"word":"majuscules","summary":{"en":"Majuscules are capital (uppercase) letters; the word is also used as an adjective meaning “written in capitals,” especially in scholarly or historical contexts.","zh":"Majuscules 指大写字母；也可作形容词，表示“用大写字母书写的”，常见于学术或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a capital (uppercase) letter, especially in formal or historical writing contexts","zh":"大写字母（尤其用于较正式或历史文字语境）"},"examples":[{"en":"Please write your name in majuscules on the form.","zh":"请在表格上用大写字母写下你的名字。"},{"en":"The inscription uses majuscules carved into stone.","zh":"这段铭文使用了刻在石头上的大写字母。"}]},{"partOfSpeech":"adj.","definition":{"en":"written in or relating to capital (uppercase) letters","zh":"用大写字母书写的；与大写字母有关的"},"examples":[{"en":"The title is in majuscule letters.","zh":"标题是用大写字母写的。"},{"en":"In some manuscripts, majuscule script is easier to read than cursive styles.","zh":"在一些手稿中，全大写体比连写体更容易阅读。"}]}],"synonyms":["capital letters","uppercase letters"],"phonetic":"/ˈmædʒ.əˌskjuːl/","extraExplanation":["“majuscule”常见于语言学、古文字学和排版领域，指“大写体/大写字母”。日常英语里更常说“capital letters”或“uppercase letters”。","词源来自拉丁语“maiusculus”（意为“稍大一些”），与“minuscules”（小写体/小写字母）相对；在古代手稿研究中，常用“majuscule script / minuscule script”区分不同书写体系。"]}

