{"word":"makable","summary":{"en":"Makable (usually written “makeable”) means “able to be made” or, more generally, “workable/feasible.”","zh":"makable（更常写作 makeable）表示“能做成/能制造的”，也可引申为“可行的/可实现的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Variant spelling of “makeable”) able to be made, built, or produced; possible to create.","zh":"（“makeable”的变体拼写）可制作的；可制造的；能做成的。"},"examples":[{"en":"This design is makable with basic tools.","zh":"这个设计用基础工具就能做出来。"},{"en":"We need a plan that’s actually makable within one week.","zh":"我们需要一个在一周内确实能做成的计划。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) workable or feasible; possible to achieve or arrange.","zh":"（引申）可行的；可实现的；能安排妥当的。"},"examples":[{"en":"Your schedule is makable if you cut one meeting.","zh":"如果你少开一个会，这个日程安排就是可行的。"},{"en":"Let’s find a makable compromise.","zh":"我们来找一个可行的折中方案。"}]}],"synonyms":["makeable","doable","workable","feasible","achievable","possible"],"phonetic":"/ˈmeɪkəbəl/","extraExplanation":["“makable”在现代英语中比较少见，更常用的拼写是“makeable”。在正式写作里建议使用“makeable”，以避免被当成拼写错误。","词形结构：make + -able（表示“能够……的”）。类似的词还有 readable（可读的）、washable（可洗的）。"]}
{"word":"makadoo","summary":{"en":"“Makadoo” is usually a variant spelling of “muckadoo,” an Australian/NZ slang term meaning “something worth almost nothing,” especially in “not worth a muckadoo.”","zh":"“makadoo”通常是“muckadoo”的变体拼写，是澳新俚语，表示“几乎不值钱/不重要的东西”，常见于“not worth a muckadoo（不值一提）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian/New Zealand slang) something of little value or importance; practically nothing.","zh":"（澳大利亚/新西兰俚语）不值钱或不重要的东西；几乎等于“没啥/不算什么”。"},"examples":[{"en":"Don’t worry about his opinion—it’s not worth a muckadoo.","zh":"别在意他的意见——那根本不值一提。"},{"en":"All that work for a prize that’s worth a muckadoo.","zh":"忙了半天，奖品却一文不值。"}]},{"partOfSpeech":"phrase","definition":{"en":"Used in the phrase “not worth a muckadoo,” meaning “not worth anything.”","zh":"用于短语“not worth a muckadoo”，意思是“一点也不值/毫无价值”。"},"examples":[{"en":"This old charger is not worth a muckadoo anymore.","zh":"这个旧充电器现在一点也不值了。"}]}],"synonyms":["nothing","something worthless","not worth a cent","rubbish","trifle"],"phonetic":"/ˌmʌkəˈduː/","extraExplanation":["“makadoo”更常见是“muckadoo”的变体拼写/误写（读起来常与“cockatoo”押韵），属于澳新英语里的老派俚语，用来夸张地说“毫无价值”。","如果你是在某本书/歌词/对话里看到“makadoo”，也可能是作者故意的拼写（为了口音或押韵）。你可以把原句发我，我能帮你更准确判断含义。"]}
{"word":"makah","summary":{"en":"Makah refers to a Native American people in northwestern Washington and also means “related to the Makah.”","zh":"Makah 指美国华盛顿州西北部的马卡族，也可作形容词表示“马卡族的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people from the northwestern tip of Washington State (on the Olympic Peninsula), known for strong ocean-going traditions such as fishing, sealing, and canoe culture","zh":"美国原住民部族之一，居住在华盛顿州奥林匹克半岛西北端，以海洋文化闻名（如捕鱼、海豹捕猎、独木舟传统等）"},"examples":[{"en":"The Makah live near Neah Bay on the Pacific coast.","zh":"马卡族居住在太平洋沿岸的尼亚湾附近。"},{"en":"A museum in the area shares Makah history and maritime culture.","zh":"当地的博物馆介绍马卡族的历史与海洋文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Makah people, language, or community","zh":"马卡族的；与马卡族、其语言或社群有关的"},"examples":[{"en":"They attended a Makah cultural event featuring songs and drumming.","zh":"他们参加了一场马卡族文化活动，有歌唱和击鼓表演。"},{"en":"Some students are learning Makah words as part of a local history project.","zh":"一些学生在地方历史项目中学习马卡语词汇。"}]}],"synonyms":["Makah people","Makah Tribe"],"phonetic":"/məˈkɑː/","extraExplanation":["“Makah”常用作专有名词，首字母通常大写：Makah。","马卡族与海洋关系非常紧密，历史上以航海、捕鱼与沿海生活方式著称。现代语境中提到马卡族时，常也会涉及其条约权利与传统捕鲸议题；讨论时建议使用尊重、基于事实的表达。","在英语写作中可说“the Makah (people/tribe)”指族群；作形容词时可说“Makah traditions / Makah community”。"]}
{"word":"Makaha","summary":{"en":"Makaha is a place name on Oʻahu, Hawaiʻi—best known for Makaha Beach and surfing; it can also refer to nearby Makaha Valley.","zh":"Makaha 是夏威夷瓦胡岛的地名，最常指马卡哈海滩与冲浪胜地；也可指附近的马卡哈山谷。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a coastal area and beach on the west (leeward) side of Oʻahu, Hawaiʻi, known for surfing and the community around Māʻili–Makaha.","zh":"美国夏威夷州瓦胡岛西岸（背风面）的一个海岸地区与海滩，以冲浪闻名，也指周边的居民区。"},"examples":[{"en":"We drove to Makaha for a quiet sunset and a walk on the beach.","zh":"我们开车去马卡哈看宁静的日落、在海滩散步。"},{"en":"Makaha is famous among surfers for its winter waves.","zh":"马卡哈在冲浪者中以冬季海浪闻名。"}]},{"partOfSpeech":"other","definition":{"en":"the valley and residential area inland from the beach, often called Makaha Valley.","zh":"海滩内陆的山谷与住宅区，常称为“马卡哈山谷（Makaha Valley）”。"},"examples":[{"en":"She lives in Makaha Valley, a short drive from the shore.","zh":"她住在马卡哈山谷，开车一会儿就到海边。"}]}],"synonyms":["Makaha Beach","Makaha Valley","West Oʻahu"],"phonetic":"/məˈkɑːhə/","extraExplanation":["“Makaha”常见拼写对应夏威夷语地名“Makaha / Mākaha”。夏威夷语地名在英文里通常保留原拼写（有时不写变音符号如 kahakō、ʻokina），读音对英语学习者来说可能不直观。","马卡哈以冲浪文化著名，历史上也与大型浪点（冬季浪更强）相关；在旅游、新闻或冲浪语境中看到“Makaha”，多数是在指这个地点而不是普通英文词。"]}
{"word":"makahiki","summary":{"en":"Makahiki is a traditional Hawaiian festival season honoring Lono, celebrated with peace, games, and feasting; today it can also mean a community cultural/sports celebration.","zh":"Makahiki是夏威夷传统的节庆季节，祭祀Lono，常以休战、竞技与宴饮庆祝；现代也可指社区式的文化/运动庆典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Hawaiian season and festival period (historically lasting about four months) dedicated to the god Lono, marked by peace, games, feasting, and tribute/offerings; today it often refers to local community celebrations and sports events.","zh":"（夏威夷语）传统的“玛卡希基”季节与庆典期（历史上约持续四个月），祭祀农业与和平之神Lono，期间常有停战、竞技、宴饮与进贡；现代也常指社区举办的相关庆典与运动活动。"},"examples":[{"en":"Many schools in Hawai‘i hold a makahiki to teach students about Hawaiian culture.","zh":"夏威夷的许多学校会举办makahiki活动，向学生介绍夏威夷文化。"},{"en":"During makahiki, communities celebrate with games, music, and shared food.","zh":"在makahiki期间，社区会用比赛、音乐和共享食物来庆祝。"},{"en":"Our workplace hosted a makahiki-style field day with traditional-inspired competitions.","zh":"我们单位办了一场“makahiki风格”的运动日，安排了受传统启发的比赛。"}]}],"synonyms":["Hawaiian harvest festival","traditional Hawaiian festival season","cultural celebration","field day (contextual)"],"phonetic":"/ˌmɑːkəˈhiːki/","extraExplanation":["词源提示：makahiki 来自夏威夷语，常被解释为“年/一年一个周期”之意（与季节轮转相关）。在传统社会中，它与对 Lono 的敬奉、农业收获与社会秩序密切相连。","文化补充：历史上的 makahiki 常包含“停战/休战”传统（减少冲突）、竞技游戏（如摔跤、赛跑等）与向首领进贡等活动；现代使用时更偏向“文化庆典/运动会”的语感，具体内容会因社区与场合而不同。","用法提示：在英文里常直接写作 makahiki（有时也写作 Makahiki），若指夏威夷整体传统节庆季节，可用 the Makahiki；若指某学校/单位的活动，常用 a makahiki。"]}
{"word":"makale","summary":{"en":"“Makale” is a Turkish word meaning “article/essay.” In English, you usually say “article” or “essay.”","zh":"“makale”是土耳其语，意思是“文章/短文（论文）”。英语里通常用 article 或 essay 来表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Turkish) an article or essay, especially a written piece in a newspaper, magazine, or online.","zh":"（源自土耳其语）文章；（尤指报刊或网络上的）论文/短文。"},"examples":[{"en":"I’m translating a Turkish makale into English.","zh":"我正在把一篇土耳其语的 makale 翻译成英文。"},{"en":"She published a makale about climate change on a news website.","zh":"她在新闻网站上发表了一篇关于气候变化的文章。"}]}],"synonyms":["article","essay","paper","piece"],"phonetic":"/mɑːkɑːˈleɪ/","extraExplanation":["“makale”是土耳其语常用词，在英语里并不是常见外来词。日常英语表达通常直接用 article（文章/报道）、essay（短文/随笔）、paper（学术论文/报告）等词来对应，具体选哪个取决于文章类型与正式程度。"]}
{"word":"makar","summary":{"en":"Makar means a Scottish poet or bard, seen as a creator of verse.","zh":"Makar 指苏格兰的诗人/吟游诗人，强调诗人作为诗歌的“创造者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish) a poet or bard; especially a respected poet regarded as a “maker” of verse.","zh":"（苏格兰用语）诗人；吟游诗人、歌咏者（尤指被尊崇、被视为“创作诗歌的人”）。"},"examples":[{"en":"Robert Burns is often called a great Scottish makar.","zh":"罗伯特·彭斯常被称为伟大的苏格兰“makar”（诗人）。"},{"en":"The city appointed an official makar to write poems for public events.","zh":"这座城市任命了一位官方“makar”，为公共活动创作诗歌。"}]}],"synonyms":["poet","bard","minstrel"],"phonetic":"/ˈmeɪkər/","extraExplanation":["“makar”来自中古苏格兰语/中古英语中与“make（创造）”同源的词，意思强调诗人是“创造者”，不仅写诗，也在“创造”语言与意象。","在当代苏格兰，“Makar”也可指官方授予的诗人头衔（类似“Poet Laureate 桂冠诗人”），如“Scots Makar（苏格兰国家诗人）”或一些城市的“City Makar（城市诗人）”。"]}
{"word":"makara","summary":{"en":"Makara is a mythical sea creature in Hindu-Buddhist art; it can also mean Capricorn in Indian astrology.","zh":"Makara指印度教—佛教艺术中的神话海兽；在印度占星中也可指摩羯座（Capricorn）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu and Buddhist art and mythology) a mythical sea creature, often shown as a mix of animals (commonly crocodile- or fish-like). It is frequently used as a protective or decorative motif, especially near water imagery.","zh":"（印度教与佛教艺术/神话中）一种神话海兽，常被描绘为多种动物的混合体（常见为类似鳄鱼或鱼）。常作为守护性或装饰性图案，尤其出现在与水相关的意象旁。"},"examples":[{"en":"A makara is often carved at the end of temple railings or water spouts.","zh":"寺庙栏杆末端或排水口处常能看到“摩伽罗”（makara）的雕刻。"},{"en":"The statue shows a makara with a crocodile-like mouth and a fish tail.","zh":"这尊雕像把摩伽罗刻成鳄鱼般的嘴与鱼尾的组合。"}]},{"partOfSpeech":"n.","definition":{"en":"(In Indian astrology) Capricorn; the zodiac sign associated with the makara.","zh":"（印度占星中）摩伽罗座，即黄道十二宫的“摩羯座/山羊座”（Capricorn），与makara相关联的星座。"},"examples":[{"en":"In some Indian traditions, Makara corresponds to Capricorn.","zh":"在一些印度传统中，Makara对应西方占星的Capricorn（摩羯座）。"}]}],"synonyms":["mythical sea creature","sea monster","Capricorn"],"phonetic":"ˈmɑːkərə","extraExplanation":["“makara”源自梵语，常与“水、河流、海洋”的象征联系在一起，在南亚与东南亚寺庙艺术中非常常见。它不是单一固定长相的动物，更像一种“合成神兽”的概念：不同地区会把它画成鳄鱼、象、鱼、蛇等特征的组合。","在图像学中，makara常被视为守护与吉祥的象征，常见于门口、栏杆末端、喷泉或排水口等位置；它也与河神、海神或某些神祇的坐骑/标志有关。"]}
{"word":"makaraka","summary":{"en":"Makaraka is most commonly a New Zealand place name near Gisborne, and it also appears in names of local institutions connected to that area.","zh":"Makaraka最常见是新西兰吉斯本附近的地名，也常用于该地区相关机构/地点的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name in New Zealand (a small locality near Gisborne, in the Gisborne District, on the east coast of the North Island).","zh":"新西兰地名（北岛东海岸吉斯本附近的一个小地方，属吉斯本地区）。"},"examples":[{"en":"She grew up in Makaraka near Gisborne.","zh":"她在吉斯本附近的马卡拉卡（Makaraka）长大。"},{"en":"The team stopped in Makaraka on the way to Gisborne.","zh":"队伍在去吉斯本的路上在马卡拉卡停了一下。"}]},{"partOfSpeech":"other","definition":{"en":"a Māori-derived proper name used for institutions and local sites (for example, a school, road, or sports club) connected to the Makaraka area.","zh":"源自毛利语的专有名称（常用于与马卡拉卡地区相关的学校、道路或体育俱乐部等机构/地点名称）。"},"examples":[{"en":"He plays for a local club in Makaraka.","zh":"他在马卡拉卡的一家本地俱乐部踢球。"},{"en":"They attended an event hosted in Makaraka.","zh":"他们参加了在马卡拉卡举办的一场活动。"}]}],"phonetic":"/ˌmɑːkəˈrɑːkə/","extraExplanation":["“Makaraka”常见于新西兰的地名与机构名中，属于毛利语影响下的拼写形式。毛利地名通常会保留传统发音与拼写，用来标记部族（iwi/hapū）历史、地貌特征或传统故事背景。","如果你指的是另一种“makaraka”（例如人名、品牌名或某种语言里的词义），告诉我它出现的句子或所在语言/地区，我可以更精确地解释。"]}
{"word":"makari","summary":{"en":"Makari means “if only; would that…,” used mainly in Scottish/poetic style to express a heartfelt wish.","zh":"Makari 表示“要是……就好了 / 但愿……”，多见于苏格兰或诗歌式表达，用来强调强烈愿望。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Scottish English/Scots, literary) used to express a strong wish: “if only,” “would that…”.","zh":"（苏格兰英语/苏格兰方言，文学用法）用来表达强烈愿望：相当于“要是……就好了 / 但愿……”。"},"examples":[{"en":"Makari I could go back and change what I said.","zh":"要是我能回去改掉我说过的话就好了。"},{"en":"Makari the weather would clear before the boat leaves.","zh":"但愿船出发前天气能放晴。"}]}],"synonyms":["if only","would that","I wish"],"phonetic":"/məˈkɑri/","extraExplanation":["“makari”较常见于苏格兰文学或带方言色彩的写作与歌词中，日常口语里更常用“if only / I wish”。","词源上通常认为与希腊语“μακάρι (makári)”（表示祝愿、但愿）有关，因此带有一种偏诗意、感叹式的语气。"]}
{"word":"makars","summary":{"en":"Makars is the plural of makar, a Scottish term meaning “poet,” literally “maker.”","zh":"Makars 是 makar 的复数，是苏格兰语境中指“诗人”的说法，字面义为“创造者/制作者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poet (especially in Scots/Scottish English); literally “maker,” meaning a creator of poetry","zh":"诗人（尤指苏格兰语/苏格兰英语语境）；字面义为“创造者”，引申为“诗的创作者”"},"examples":[{"en":"In Scotland, a traditional term for a poet is a makar.","zh":"在苏格兰，诗人的传统称呼之一是 makar。"},{"en":"She reads the great makars of the fifteenth century.","zh":"她阅读十五世纪的伟大苏格兰诗人（makars）的作品。"},{"en":"He was named the nation’s Makar, a role similar to a poet laureate.","zh":"他被任命为国家的“首席诗人”（Makar），这一角色类似“桂冠诗人”。"}]}],"synonyms":["poet","bard","versifier"],"phonetic":"/ˈmɑːkər/","extraExplanation":["“makar”源自中古苏格兰语（Scots），与英语“make（制作）”同源，强调诗人“创造/制作”诗歌的能力，因此带有对艺术创造力的尊称意味。","在现代苏格兰，“Makar”有时是正式头衔（如 Scottish Makar），类似英国的 Poet Laureate（桂冠诗人）。","如果你想查的是常见英语“makers”（制造者/创作者），拼写应为 makers；“makars”多用于苏格兰文学与文化语境。"]}
{"word":"makassar","summary":{"en":"Makassar is a major port city in South Sulawesi, Indonesia.","zh":"Makassar 指印尼南苏拉威西省的重要港口城市“望加锡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major port city in South Sulawesi, Indonesia (also spelled “Makasar”), known as a regional trade center and gateway to eastern Indonesia.","zh":"印尼南苏拉威西省的重要港口城市“望加锡”（也拼作 Makasar），以区域贸易中心、通往印尼东部的门户而闻名。"},"examples":[{"en":"Makassar is a busy port city in eastern Indonesia.","zh":"望加锡是印尼东部一座繁忙的港口城市。"},{"en":"They flew to Makassar and then continued to smaller islands.","zh":"他们飞到望加锡，然后再前往更小的岛屿。"}]}],"synonyms":["Makasar"],"phonetic":"/məˈkɑːsɑːr/","extraExplanation":["“Makassar”在英语里常见于地理与历史语境：它位于苏拉威西岛西南部，历史上是重要的海上贸易与香料贸易节点。","这座城市在部分时期也曾被官方称为“Ujung Pandang（乌戎潘当）”，所以你可能会在旧资料或地图上看到不同名称。","相关地名：Makassar Strait（望加锡海峡）位于婆罗洲与苏拉威西之间，是重要航道。"]}
{"word":"makatea","summary":{"en":"Makatea refers to an uplifted coral-limestone (raised reef) island, and it can also name the island Makatea in French Polynesia.","zh":"Makatea 指一种由抬升珊瑚石灰岩（抬升珊瑚礁）形成的岛屿地貌类型，也可特指法属波利尼西亚的马卡提亚岛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of Pacific island made of uplifted coral limestone (a raised reef), often with steep cliffs around the coast","zh":"一种由抬升的珊瑚石灰岩（抬升珊瑚礁）形成的太平洋岛屿类型，海岸常见陡峭石灰岩峭壁"},"examples":[{"en":"Makatea islands often have cliffs that make landing by boat difficult.","zh":"Makatea 型岛屿常有峭壁，使得小船靠岸变得困难。"},{"en":"Scientists studied soils on a makatea to understand how plants grow on limestone.","zh":"科学家在一座 makatea 岛上研究土壤，以了解植物如何在石灰岩环境中生长。"}]},{"partOfSpeech":"n.","definition":{"en":"Makatea: an island in French Polynesia (Tuamotu Archipelago), known for its raised limestone landscape","zh":"Makatea：法属波利尼西亚（土阿莫土群岛）的一座岛，以抬升石灰岩地貌著称"},"examples":[{"en":"Makatea was once an important site for phosphate mining.","zh":"Makatea 曾经是重要的磷酸盐开采地。"},{"en":"They planned a trip through the Tuamotus, including Makatea.","zh":"他们计划穿越土阿莫土群岛旅行，其中包括 Makatea。"}]}],"synonyms":["raised coral island","uplifted limestone island","raised reef island"],"phonetic":"/ˌmɑːkəˈteɪə/","extraExplanation":["“makatea”一词常见于波利尼西亚语境，既可作为地貌类型名词（指抬升珊瑚礁形成的石灰岩台地/岛），也可特指法属波利尼西亚的马卡提亚岛。","作为地貌术语时，它强调“珊瑚礁被地壳抬升后露出海面”，与低平的环礁（atoll）形成对比：atoll 通常很低平，而 makatea 往往更高、更陡。"]}
{"word":"Makaurau","summary":{"en":"Makaurau is a Māori name for Auckland, New Zealand (often seen as part of “Tāmaki Makaurau”).","zh":"Makaurau 是新西兰奥克兰的毛利语名称（常见于“Tāmaki Makaurau”这一完整说法中）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Māori name referring to Auckland (especially in the fuller form Tāmaki Makaurau), the largest city in New Zealand.","zh":"毛利语中对新西兰最大城市奥克兰的称呼（更常见的完整说法为 Tāmaki Makaurau）。"},"examples":[{"en":"I lived in Makaurau (Auckland) for two years.","zh":"我在 Makaurau（奥克兰）住了两年。"},{"en":"Many events in Makaurau celebrate Māori language and culture.","zh":"Makaurau 有许多活动会庆祝毛利语言与文化。"}]}],"synonyms":["Auckland","Tāmaki Makaurau"],"phonetic":"ˌmɑːkaʊˈraʊ","extraExplanation":["“Makaurau”通常与“Tāmaki”一起出现：Tāmaki Makaurau，是奥克兰地区更完整、更常见的毛利语名称。","这个名称常被解释为与“众多追求者/爱慕者”有关（因这片土地资源丰富、位置重要，历史上吸引许多部族争夺与居住）。在正式场合或尊重原住民文化的语境中，使用毛利语地名越来越常见。","书写时常保留毛利语拼写与大写；在英文文章里也可能写成“Makaurau (Auckland)”来帮助读者理解。"]}
{"word":"make","summary":{"en":"Make most commonly means create/produce, cause, earn, become, or manage to reach/attend.","zh":"make 常见意思包括：制作/创造、使发生/使某人做、赚得、成为/变得、赶上/去得了（make it）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to create, build, or produce something (often from materials or ideas)","zh":"制作；制造；创作（用材料或想法做出某物）"},"examples":[{"en":"She makes her own clothes.","zh":"她自己做衣服。"},{"en":"They made a cake for his birthday.","zh":"他们为他的生日做了一个蛋糕。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to happen or to cause someone to do something","zh":"使发生；迫使/让某人做某事"},"examples":[{"en":"The news made him happy.","zh":"这个消息让他很开心。"},{"en":"My teacher made me rewrite the essay.","zh":"老师让我把作文重写一遍。"}]},{"partOfSpeech":"vt.","definition":{"en":"to earn or gain (money, profit, etc.)","zh":"赚得；获得（钱、利润等）"},"examples":[{"en":"She makes $60,000 a year.","zh":"她一年赚6万美元。"},{"en":"This company made a big profit last year.","zh":"这家公司去年赚了很多利润。"}]},{"partOfSpeech":"v.","definition":{"en":"to become or turn into; to reach a particular state or result","zh":"变成；成为；达到某种状态或结果"},"examples":[{"en":"He will make a great doctor.","zh":"他会成为一名很棒的医生。"},{"en":"The joke made the situation less tense.","zh":"这个玩笑让气氛没那么紧张了。"}]},{"partOfSpeech":"v.","definition":{"en":"to arrive in time for something or succeed in reaching a place/time (often used with “it”)","zh":"赶上；来得及（常与 it 连用）"},"examples":[{"en":"Hurry up, or we won’t make the train.","zh":"快点，不然我们赶不上火车了。"},{"en":"I can’t make it to the meeting today.","zh":"我今天去不了开会。"}]}],"synonyms":["create","produce","build","cause","force","earn","form"],"phonetic":"/meɪk/","extraExplanation":["“make” 是英语里非常高频、非常“多义”的动词，常见搭配很多：make a decision（做决定）、make friends（交朋友）、make sure（确保）、make sense（有道理）。学它时建议记“搭配块（collocations）”，比只背单一中文意思更实用。","使役结构：make + 人 + 动词原形（不加 to），例如：The boss made him work late.（老板让他加班。）"]}
{"word":"make-up","summary":{"en":"Make-up most commonly means cosmetics; it can also mean something invented (a fabrication) or the composition/structure of something.","zh":"Make-up 最常见指“化妆品/妆容”；也可指“编造之物（虚构、捏造）”或“构成/成分/结构”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cosmetics used on the face (and sometimes the body) to improve or change appearance.","zh":"（脸部或身体的）化妆品，用来美化或改变外表。"},"examples":[{"en":"She put on make-up before the interview.","zh":"她在面试前化了妆。"},{"en":"He prefers natural-looking make-up.","zh":"他更喜欢看起来自然的妆容。"}]},{"partOfSpeech":"n.","definition":{"en":"An invented story or information; something not true.","zh":"编造的故事或信息；虚构的东西。"},"examples":[{"en":"That rumor is just a make-up.","zh":"那个传言只是编出来的。"},{"en":"The “evidence” turned out to be a make-up.","zh":"所谓的“证据”后来被发现是伪造的。"}]},{"partOfSpeech":"n.","definition":{"en":"The way something is formed or arranged; composition or structure (often used as “makeup” without a hyphen in American English).","zh":"构成方式；成分或结构（美式英语常写作不加连字符的“makeup”）。"},"examples":[{"en":"The team’s make-up includes people from five countries.","zh":"这个团队的构成包括来自五个国家的人。"},{"en":"Water makes up a large part of the human body’s makeup.","zh":"水构成人体成分中的很大一部分。"}]}],"synonyms":["cosmetics","makeup","fabrication","invention","composition","structure"],"phonetic":"/ˈmeɪkˌʌp/","extraExplanation":["拼写小提示：在美式英语里，表示“化妆品/妆容”和“构成”时，最常见的写法是 **makeup**（一个词）；**make-up** 也能用，但更偏英式或较旧的写法。","不要和动词短语 **make up** 混淆：**make up**（不加连字符）常表示“编造”“和好”“补上（缺课/工作）”等，如 *They made up after the argument.*（他们吵完架和好了）。"]}
{"word":"makeable","summary":{"en":"“Makeable” means something can be made or done, often used to stress practicality or feasibility.","zh":"“makeable”表示某事物“做得出来/可制作/可行”，常用来强调实际可操作性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be made, produced, or done; feasible.","zh":"可制作的；可生产的；可做到的；可行的。"},"examples":[{"en":"The design is simple and makeable with basic tools.","zh":"这个设计很简单，用基本工具就能做出来。"},{"en":"Your plan is ambitious, but it’s makeable if you work step by step.","zh":"你的计划很有野心，但如果一步一步来，是可以实现的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suitable or easy for someone to make; “makeable” as a practical choice for DIY or learning.","zh":"（对某人来说）适合制作的；容易做的（常用于手工、DIY或学习语境）。"},"examples":[{"en":"This recipe is makeable even for beginners.","zh":"这个食谱连新手也做得出来。"},{"en":"She chose a makeable project for the weekend.","zh":"她选了一个周末能完成的、比较好做的项目。"}]}],"synonyms":["doable","feasible","possible","workable","easy to make"],"phonetic":"/ˈmeɪkəbəl/","extraExplanation":["“makeable”不是最常见的日常用词，但在口语、DIY/设计/工程语境里会用来强调“做得出来、可实现”。更常见的替代表达包括：possible（可能的）、feasible（可行的）、doable（做得到的）、easy to make（容易制作）。","构词上是 make + -able（表示“能够被……”），类似：readable（可读的）、washable（可洗的）、breakable（易碎的）。"]}
{"word":"makebate","summary":{"en":"“Makebate” is not standard; it’s usually a misspelling of “masturbate,” meaning to stimulate oneself sexually.","zh":"“makebate”不是标准用法，通常是“masturbate”的误拼，意思是通过自我刺激获得性快感。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A common misspelling of “masturbate.”","zh":"（非标准）“masturbate”的常见拼写错误。"},"examples":[{"en":"“Makebate” isn’t a standard English word; the usual spelling is “masturbate.”","zh":"“makebate”不是标准英语词；通常的拼法是“masturbate”。"}]},{"partOfSpeech":"v.","definition":{"en":"to touch or stimulate one’s genitals for sexual pleasure (often to orgasm)","zh":"（通常指）通过触摸或刺激自己的生殖器以获得性快感（常达到高潮）。"},"examples":[{"en":"Some people masturbate as a normal part of sexual health.","zh":"有些人把手淫作为性健康的正常一部分。"},{"en":"It can be helpful to talk to a doctor or counselor if the habit causes distress.","zh":"如果这种行为让你感到困扰，和医生或咨询师沟通可能会有帮助。"}]}],"synonyms":["masturbate","self-stimulate","self-pleasure"],"phonetic":"/ˈmæstərˌbeɪt/","extraExplanation":["“masturbate”属于较直接的性相关用语：在医学/科普语境中很常见且中性；在日常闲聊中可能显得私密或冒犯，需注意场合与对象。","如果你是在找更委婉的说法，常见替代表达有“masturbation（名词）”“self-pleasure / self-stimulation（较委婉）”。"]}
{"word":"makebates","summary":{"en":"Makebate means a person who stirs up quarrels or conflict on purpose.","zh":"Makebate 指故意挑起争端、搅动矛盾的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who deliberately stirs up arguments or conflict; a troublemaker who “makes” people fight","zh":"（故意）挑起争端的人；搅事、挑拨是非的人"},"examples":[{"en":"Ignore him—he’s a makebate who enjoys watching coworkers argue.","zh":"别理他——他就是个爱看同事吵架的挑事精。"},{"en":"The community asked the makebate to stop spreading rumors online.","zh":"社区要求那个挑拨是非的人停止在网上散布谣言。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, archaic) something or someone that causes quarrels","zh":"（罕见/古旧）引发争吵的人或事物"},"examples":[{"en":"In old writings, a gossip could be called a makebate.","zh":"在一些旧文献里，爱传闲话的人可能会被称为 makebate。"}]}],"synonyms":["troublemaker","instigator","agitator","provocateur","rabble-rouser"],"phonetic":"/ˈmeɪkˌbeɪt/","extraExplanation":["“makebate”是比较古老的词，常见于早期英语与文学中（例如莎士比亚时代的用法）。现代英语里更常用 troublemaker、instigator、rabble-rouser（语气更强）或 shit-stirrer（粗俗，慎用）。","你输入的“makebates”很可能是复数形式（makebates），单数是 makebate。"]}
{"word":"makedom","summary":{"en":"Makedom means managing with what you have—an improvised, make-do way of coping.","zh":"makedom 指“将就、凑合着用”，用现有资源临时应付的状态或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A makeshift or improvised way of managing with limited resources; the act or habit of “making do.”","zh":"（在资源不足时的）将就、凑合；临时应付的办法或习惯。"},"examples":[{"en":"During the trip, we lived in cheerful makedom—simple meals and shared supplies.","zh":"旅行期间我们开心地将就着过——吃得简单，物资也一起用。"},{"en":"In hard times, makedom can teach people to be creative and waste less.","zh":"在困难时期，将就凑合能教会人更有创意，也更少浪费。"}]}],"synonyms":["make-do","makeshift","improvisation","stopgap","patchwork"],"phonetic":"/ˈmeɪkˌduːm/","extraExplanation":["“makedom”是比较少见的名词，用来把短语“make do（将就、凑合着用）”名词化，强调一种“临时应对、节俭度日”的生活状态或做法。更常见、自然的说法通常是“make do”本身，或“a makeshift solution（权宜之计）”。","语感上它常带一点文学/叙述色彩：不仅指“东西不够”，也暗含“在限制中仍然设法把日子过下去”的韧性。"]}
{"word":"makefast","summary":{"en":"“Make fast” is a nautical verb meaning to secure something firmly (especially a boat or rope). It can also be a noun for the securing line/device.","zh":"“makefast / make fast”多用于航海语境，表示把东西（尤其船或缆绳）牢牢固定；也可作名词指固定用的绳索/装置。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(nautical) To secure a rope, cable, or boat firmly by tying or fastening it to something.","zh":"（航海/海事）把绳索、缆绳或船只牢牢系住、固定在某处。"},"examples":[{"en":"Make fast the mooring lines before the tide turns.","zh":"在潮水转向之前把系泊缆绳系牢。"},{"en":"The crew made the boat fast to the dock.","zh":"船员把船牢牢系在码头上。"}]},{"partOfSpeech":"n.","definition":{"en":"(n., nautical) A line, rope, or device used to secure something; a mooring fastener.","zh":"（名词，航海）用于固定的绳索或装置；系泊用的固定物。"},"examples":[{"en":"Check the makefasts before we leave the harbor.","zh":"离港前检查一下固定绳（系泊装置）。"}]}],"synonyms":["secure","fasten","tie off","moor"],"phonetic":"/ˈmeɪkˌfæst/","extraExplanation":["在航海英语里更常写作两词：make fast。意思是“把……固定牢”。常见搭配有 make fast the lines（把缆绳系牢）、make fast to the dock/cleat/bollard（系在码头/系缆桩上）。","它与 fast（牢固地、固定住）有关，这里的 fast 不是“快”，而是“牢、稳”。因此 make fast = “使之牢固”。"]}
{"word":"makefasts","summary":{"en":"“Make fast” means to fasten something securely; in nautical English it also means to secure a boat to a dock (moor).","zh":"“make fast”表示把某物牢牢固定住；在航海英语中也指把船系泊在码头（系缆、靠泊固定）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to fasten something securely so it will not move or come loose","zh":"把某物牢牢固定住；拴紧、系牢"},"examples":[{"en":"Make fast the rope to the post before you pull the boat in.","zh":"在把船拉进来之前，把绳子牢牢系在柱子上。"},{"en":"Please make the lid fast so nothing spills.","zh":"请把盖子盖紧，别让东西洒出来。"}]},{"partOfSpeech":"phrase","definition":{"en":"(nautical) to secure a boat or ship to a dock or another object; to moor","zh":"（航海）把船系泊好；把船拴在码头或其他物体上"},"examples":[{"en":"The crew made fast at the pier just before sunset.","zh":"船员在日落前刚好把船系泊在码头。"},{"en":"Once we make fast, you can step onto the dock.","zh":"等我们把船拴好后，你就可以上码头了。"}]}],"synonyms":["secure","fasten","tie up","lash","moor"],"phonetic":"/meɪk fæst/","extraExplanation":["你输入的 **makefasts** 不太常见，更标准的写法通常是 **make fast**（动词短语）。在航海语境里也会看到连写 **makefast**（名词），指“系缆点/系缆装置”或“系泊用的绳索固定处”。例如：*Check the makefasts before loading cargo.*（装货前检查系缆点/系泊固定处。）"]}
{"word":"makefile","summary":{"en":"A Makefile is a build script used by the “make” tool to compile/build projects and automate tasks.","zh":"Makefile 是供 “make” 工具使用的构建脚本，用于编译/构建项目并自动化常见任务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a file (usually named “Makefile”) that tells the program “make” how to build a software project by listing targets, dependencies, and commands","zh":"（通常名为“Makefile”的）构建脚本文件，用来告诉“make”如何编译/构建软件项目：包含目标（target）、依赖（dependency）和执行命令"},"examples":[{"en":"The Makefile builds the app and runs the tests with one command.","zh":"这个 Makefile 可以用一条命令构建应用并运行测试。"},{"en":"If you change a header file, the Makefile can rebuild only the files that depend on it.","zh":"如果你改了头文件，Makefile 可以只重新编译依赖它的文件。"},{"en":"On Linux, you can usually compile the project by typing: make.","zh":"在 Linux 上，你通常输入 make 就能编译这个项目。"}]}],"synonyms":["build script","build file","make script"],"phonetic":"/ˈmeɪkˌfaɪl/","extraExplanation":["Makefile 常见于 C/C++、Linux/Unix 开发环境，也常用于自动化任务（如格式化、打包、部署）。","基本结构通常是：target: dependencies（目标：依赖），下一行用“Tab 制表符”开头写命令；很多初学者的报错来自把 Tab 写成了空格。","GNU Make 是最常见实现；除了最基础规则，还支持变量、模式规则（pattern rules）和伪目标（.PHONY）。"]}
{"word":"makeless","summary":{"en":"“Makeless” means “matchless; incomparable,” used mainly in Scottish or old-fashioned contexts.","zh":"“Makeless”意为“无与伦比、无可匹敌”，主要见于苏格兰英语或较古的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chiefly Scottish/archaic) Matchless; without an equal; incomparable.","zh":"（主要用于苏格兰英语/古用）无与伦比的；无可匹敌的。"},"examples":[{"en":"Her voice was makeless—everyone fell silent to listen.","zh":"她的嗓音无与伦比——大家都安静下来聆听。"},{"en":"They spoke of the makeless beauty of the Highlands.","zh":"他们谈起高地那无可比拟的美景。"}]}],"synonyms":["matchless","incomparable","unequaled","peerless"],"phonetic":"/ˈmeɪkləs/","extraExplanation":["“makeless”在现代标准英语里很少见，多见于苏格兰英语或古文学语境。","这里的 make 不是“制作”，而是较古的用法，表示“配偶/匹配（mate/match）”；因此 makeless 字面意思接近“没有对手、没有匹配者”，即“无可匹敌”。","日常写作中更常用的表达是：matchless, incomparable, unequaled（美式拼写）。另外，很多人会把它误读为短语“make less（减少）”，但两者意思完全不同。"]}
{"word":"makeover","summary":{"en":"A makeover is a change that makes someone or something look better or feel refreshed; it can also mean to do that change.","zh":"Makeover 指让人或事物变得更好看、更焕新的“改造/翻新”，也可作动词表示进行这种改造。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a process of improving someone’s or something’s appearance, style, or condition by making changes","zh":"（外表、风格或状态的）改造；翻新；“大变身”"},"examples":[{"en":"She got a makeover before the wedding.","zh":"她在婚礼前做了一次造型大改造。"},{"en":"The café is getting a makeover with new paint and lighting.","zh":"这家咖啡馆正在翻新，重新粉刷并更换灯光。"}]},{"partOfSpeech":"v.","definition":{"en":"to improve the appearance or condition of someone or something by changing it","zh":"改造；翻新；给……做“形象升级”"},"examples":[{"en":"They decided to makeover the old website to make it easier to use.","zh":"他们决定改造旧网站，让它更好用。"},{"en":"A stylist will makeover the contestants for the show.","zh":"造型师会为节目选手做形象改造。"}]}],"synonyms":["transformation","refresh","revamp","restyle","renovation"],"phonetic":"/ˈmeɪkˌoʊvɚ/","extraExplanation":["“Makeover”在现代英语里常见于时尚、美妆、家居、节目改造等语境，给人一种“变化明显、焕然一新”的感觉。","在更正式的写作中，谈到房屋或空间时也常用“renovation / remodeling / refurbishment”；谈到个人形象时可用“makeover”或更中性的“restyling”。","拼写上常见作一个词“makeover”，也有人写作“make-over”（较少见、偏旧式）。"]}
{"word":"maker","summary":{"en":"Maker means a person, company, or thing that makes/produces something, and can also mean someone who creates or shapes important decisions or changes.","zh":"maker 指制造/制作某物的人、公司或事物；也可指制定政策或推动重要变化的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, company, or machine that makes or produces something.","zh":"制造者；制作者；生产者（人、公司或机器）。"},"examples":[{"en":"The maker of this phone is based in California.","zh":"这款手机的制造商总部在加利福尼亚州。"},{"en":"She is the maker of the cake for the party.","zh":"聚会的蛋糕是她做的。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who creates or starts something, especially an important plan, decision, or change.","zh":"创立者；发起者（尤指重要计划、决定或变革）。"},"examples":[{"en":"He is one of the makers of the new policy.","zh":"他是这项新政策的制定者之一。"},{"en":"History remembers her as a maker of social change.","zh":"历史记住了她是一位推动社会变革的人。"}]}],"synonyms":["creator","producer","manufacturer","builder","craftsperson","policy maker"],"phonetic":"/ˈmeɪkər/","extraExplanation":["“maker”来自动词“make（制作/制造/创造）+ -er（做某事的人/物）”。所以它既可以指“做东西的人/机器”，也常在正式语境里指“政策制定者、决策者”。","常见搭配：car/film/toy maker（汽车/电影/玩具制造商），policy maker（政策制定者）。另外，“maker”在一些文化语境中也可指“造物主（the Maker）”，用于宗教或文学中。"]}
{"word":"makeready","summary":{"en":"Makeready means the preparation/setup done before starting, especially the pre-press setup in printing.","zh":"Makeready 指开始前的准备/设置工作，尤指印刷开印前的调机与准备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Preparation work done before something starts, especially the setup in printing (adjusting plates, ink, paper, and alignment) before a press run.","zh":"开始前的准备工作；（尤指印刷）上机前的调机/准备（如调整印版、油墨、纸张与套准等）。"},"examples":[{"en":"The press crew spent the morning on makeready to get the colors lined up.","zh":"印刷班组花了一上午做 makeready，把颜色套准对齐。"},{"en":"Good makeready reduces waste and improves print quality.","zh":"好的 makeready 能减少损耗并提升印刷质量。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or used for preparation before production, especially in printing.","zh":"（尤指印刷）与生产前准备有关的；用于开印前调机的。"},"examples":[{"en":"We ran a makeready sheet to check the alignment.","zh":"我们先跑了一张 makeready 试印张来检查套准。"},{"en":"Makeready costs are higher when the job requires many color changes.","zh":"当作业需要频繁换色时，makeready 成本会更高。"}]}],"synonyms":["setup","preparation","prepress setup","readying"],"phonetic":"/ˈmeɪkˌrɛdi/","extraExplanation":["“makeready”在现代英语里最常见于印刷行业；日常口语更常说 make ready / get ready（准备好）。","拼写上常见变体有 make-ready（带连字符）与 make ready（作动词短语）。在行业文件或报价单里，makeready 常作为一个名词项目出现（表示开机前准备时间与损耗）。"]}
{"word":"makeress","summary":{"en":"“Makeress” is an old-fashioned noun meaning a female maker/creator, and sometimes (in literary/Scots use) a female poet.","zh":"“Makeress”是一个较古老的名词，指女性的制作者/创造者；在文学或苏格兰语境中也可指女诗人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A woman who makes or creates something; a female maker.","zh":"（古义）女制造者；女创造者；制作某物的女性。"},"examples":[{"en":"In older writings, a craftswoman might be called a makeress.","zh":"在较早的文字中，手艺精湛的女性有时会被称为 makeress。"},{"en":"The term makeress is rare today and sounds old-fashioned.","zh":"makeress 这个词如今很少见，听起来很古老。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/Scots, archaic) A female poet—by analogy with “makar/maker,” an older term for poet.","zh":"（文学/苏格兰用法，古义）女诗人——源自“makar/maker”（古时指诗人）的用法。"},"examples":[{"en":"Some critics speak of a “makeress” when discussing women poets in early Scots tradition.","zh":"有些评论家在讨论早期苏格兰传统中的女性诗人时，会用“makeress”一词。"},{"en":"The makeress shaped images with words, like a builder with stone.","zh":"这位“makeress”用文字塑造意象，就像工匠用石头建造一般。"}]}],"synonyms":["female maker","woman creator","craftswoman","poet (literary sense)"],"phonetic":"/ˈmeɪkərəs/","extraExplanation":["“makeress”由“maker（制作者）+ -ess（传统上表示女性的后缀）”构成。现代英语中，-ess 这类性别后缀（如 actress, waitress）使用在减少，很多场合更倾向用中性说法（例如 poet, maker, craftsperson）。","在苏格兰文学语境里，makar/maker 可指“诗人”。因此 “makeress” 有时被用来指“女诗人”，但属于少见、带文学色彩的用法。"]}
{"word":"makers","summary":{"en":"“Makers” means people or companies that make or produce things; it can also refer to the DIY/creative “maker” community in some contexts.","zh":"“makers”指制造/创作某物的人或公司；在某些语境下也可指强调DIY与创作的“创客”群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who make, create, or produce something (plural of “maker”).","zh":"制造者；创作者；生产者（“maker”的复数）。"},"examples":[{"en":"The makers of this film won several awards.","zh":"这部电影的制作团队（创作者）获得了好几个奖项。"},{"en":"Toy makers must follow strict safety rules.","zh":"玩具制造商必须遵守严格的安全规定。"},{"en":"Local makers sell handmade goods at the weekend market.","zh":"本地手作匠人在周末集市上卖手工制品。"}]},{"partOfSpeech":"n.","definition":{"en":"Companies or brands that manufacture a product (used especially in phrases like “car makers,” “phone makers”).","zh":"（尤用于搭配）生产某种产品的公司或品牌，如“汽车制造商”“手机厂商”。"},"examples":[{"en":"Car makers are investing heavily in electric vehicles.","zh":"汽车制造商正在大力投资电动车。"},{"en":"Several phone makers released new models this year.","zh":"好几家手机厂商今年发布了新机型。"}]}],"synonyms":["producers","creators","manufacturers","builders","fabricators"],"phonetic":"/ˈmeɪkər/","extraExplanation":["“maker”在英语里很常见，也常出现在复合词中，表示“做决定/制定规则的人或机构”，例如：decision-maker（决策者）、policy-maker（政策制定者）、matchmaker（牵线人/媒人）。","“Makers”也可指“创客/创客群体”（the maker movement），强调自己动手做、DIY、用技术与工具进行创作。"]}
{"word":"makership","summary":{"en":"Makership means the identity or role of being a maker, and sometimes the shared culture/community among makers.","zh":"Makership 指“作为制作者/创客的身份或角色”，有时也指制作者之间的共同文化与社群感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, role, or identity of being a maker (someone who creates, builds, or crafts things); used in a general or slightly formal way","zh":"“创作者/制作者”的身份、角色或状态；常带一点概括性或较正式的语气"},"examples":[{"en":"Her makership comes from years of building furniture by hand.","zh":"她的“制作者身份”来自多年手工制作家具的经验。"},{"en":"The course encourages students to reflect on their makership, not just their final products.","zh":"这门课鼓励学生反思自己的“创作身份”，而不只关注最终作品。"}]},{"partOfSpeech":"n.","definition":{"en":"a sense of community or culture among makers (often in contexts like makerspaces, DIY, or design education)","zh":"制作者之间的社群感或文化（常见于创客空间、DIY、设计教育等语境）"},"examples":[{"en":"The makerspace helped strengthen makership across the campus.","zh":"创客空间帮助强化了校园里的“创客文化/制作者社群感”。"},{"en":"Online forums can support makership by sharing tools, plans, and feedback.","zh":"线上论坛可以通过分享工具、方案和反馈来支持“创作社群文化”。"}]}],"synonyms":["maker identity","craftsmanship","making (as a practice)","maker culture"],"phonetic":"/ˈmeɪkərʃɪp/","extraExplanation":["“makership”由 maker（制作者/创客）+ 后缀 -ship 构成。-ship 常表示“身份/状态/关系”（如 friendship 友谊、leadership 领导力）。因此 makership 通常强调“作为制作者的身份与自我认同”，而不仅仅是“做东西”的动作。","这是一个相对少见、偏新或偏学术/教育场景的词，在日常英语里更常说 being a maker、maker identity、maker community、craftsmanship 或 making things。"]}
{"word":"makerspace","summary":{"en":"A makerspace is a shared workshop-like space where people create and learn using tools and technology.","zh":"Makerspace指供人共享使用工具与技术进行创作和学习的“创客空间/制作空间”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shared place (often in a school, library, or community center) where people use tools, technology, and materials to design, build, and learn by making things","zh":"创客空间；共享的制作与学习场所（常见于学校、图书馆或社区中心），人们在这里使用工具、技术和材料来设计、制作并通过动手学习"},"examples":[{"en":"Our library has a makerspace with 3D printers and sewing machines.","zh":"我们图书馆有一个创客空间，里面有3D打印机和缝纫机。"},{"en":"Students use the makerspace to build robots for the science fair.","zh":"学生们用创客空间为科学展做机器人。"},{"en":"The community makerspace offers weekend workshops for beginners.","zh":"社区创客空间为初学者提供周末工作坊。"}]}],"synonyms":["hackerspace","fab lab","workshop","maker lab","innovation lab"],"phonetic":"/ˈmeɪkərˌspeɪs/","extraExplanation":["“makerspace”一词与近年的“maker movement（创客运动）”相关，强调“动手做、边做边学（learning by doing）”。常见设备包括3D打印机、激光切割机、木工/电子工具等，也常有导师或社群活动帮助新手入门。","在教育场景中，makerspace常与STEM/STEAM（科学、技术、工程、艺术、数学）学习结合，用项目式学习培养创造力、合作与解决问题能力。"]}
{"word":"makes","summary":{"en":"“Makes” is usually the verb form of “make” for he/she/it, and it can also mean different product brands (especially cars).","zh":"“makes”通常是动词“make”的第三人称单数形式；也可作名词，表示不同产品品牌（尤指汽车）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular of “make”: to create, build, or produce something; to cause something to happen","zh":"“make”的第三人称单数：制作/创造/生产；使某事发生"},"examples":[{"en":"She makes dinner every night.","zh":"她每天晚上做晚饭。"},{"en":"This news makes me happy.","zh":"这个消息让我很开心。"},{"en":"He makes a lot of mistakes when he’s tired.","zh":"他累的时候会犯很多错误。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) different brands or types of a product, especially vehicles: “makes and models”","zh":"（复数名词）不同的品牌或种类（尤指车辆），常见于“makes and models（品牌和型号）”"},"examples":[{"en":"The website compares different makes of cars.","zh":"这个网站比较不同品牌的汽车。"},{"en":"We repair all makes and models.","zh":"我们维修所有品牌和型号。"}]}],"synonyms":["creates","produces","builds","causes","brands"],"phonetic":"/meɪks/","extraExplanation":["“makes”最常见是动词“make”的第三人称单数形式：he/she/it makes。否定和疑问要用助动词：She doesn’t make coffee. / Does she make coffee?","名词用法多见于正式或商业语境（如汽车行业），意思接近“brands（品牌）”。"]}
{"word":"makeshift","summary":{"en":"“Makeshift” describes something quickly and temporarily made from available materials as a substitute.","zh":"“makeshift”指用现有条件临时凑合出来的替代物，强调权宜和临时性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made or arranged quickly from whatever is available, especially as a temporary substitute (not ideal, but useful for now).","zh":"（用现有材料）临时凑合做的；权宜的（通常不太理想，但暂时能用）。"},"examples":[{"en":"We built a makeshift shelter from branches and a plastic sheet.","zh":"我们用树枝和一块塑料布搭了一个临时的简易棚。"},{"en":"The clinic set up a makeshift waiting area in the hallway.","zh":"诊所在走廊里临时安排了一个候诊区。"},{"en":"He used a makeshift desk until his new one arrived.","zh":"在新书桌到之前，他先用一个临时凑合的“书桌”。"}]}],"synonyms":["temporary","improvised","jury-rigged","stopgap","ad hoc"],"phonetic":"/ˈmeɪkˌʃɪft/","extraExplanation":["“makeshift”强调“临时、凑合、替代品”的感觉，常带有“条件有限所以将就一下”的语气。","常见搭配：makeshift bed/desk/shelter/clinic/kitchen（临时床/桌子/避难所/诊所/厨房）。","词源上可理解为“make + shift（设法应付/凑合）”，所以它的核心含义是“想办法先顶一顶”。","在新闻与纪实写作中很常见：如灾害后“makeshift shelters（临时避难所）”。"]}
{"word":"makeshiftiness","summary":{"en":"Makeshiftiness means the quality of being temporary and improvised, often because better options aren’t available.","zh":"Makeshiftiness 指“临时拼凑、将就应付”的性质或状态，常因缺少更好的选择而产生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being makeshift—temporary and not ideal, but used because it is available","zh":"临时凑合的状态或性质——并非理想，但因手头可用而暂时使用"},"examples":[{"en":"The room’s makeshiftiness was obvious: a blanket served as a curtain.","zh":"房间的临时凑合感很明显：一条毯子被当作窗帘。"},{"en":"In an emergency, a little makeshiftiness can still solve real problems.","zh":"在紧急情况下，一点“临时凑合”也能解决实际问题。"},{"en":"The shelter was safe, but its makeshiftiness reminded everyone it wasn’t meant to last.","zh":"避难所很安全，但它的临时性提醒大家这并不是长久之计。"}]}],"synonyms":["improvisation","temporariness","patchwork quality","stopgap nature"],"phonetic":"ˈmeɪkˌʃɪftɪnəs","extraExplanation":["“makeshiftiness”来自形容词“makeshift（临时凑合的）+ -ness（名词后缀，表示性质/状态）”。“makeshift”原意接近“临时想办法应付（make + shift）”，常用于紧急或资源不足时的替代方案。语气通常中性偏消极：强调“能用但不理想”。"]}
{"word":"makeshiftness","summary":{"en":"Makeshiftness means the quality of being temporary and improvised rather than proper or permanent.","zh":"makeshiftness 指“临时凑合、权宜拼凑”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being makeshift; the state of being temporary, improvised, or done with whatever is available","zh":"临时凑合的特质；权宜之计的状态（用现有材料临时拼凑、非长久之计）"},"examples":[{"en":"The shelter’s makeshiftness was obvious, but it kept us dry for the night.","zh":"这个避难处明显很凑合，但至少让我们那晚没淋雨。"},{"en":"He apologized for the makeshiftness of the solution and promised a proper repair tomorrow.","zh":"他为这个权宜的解决办法道歉，并承诺明天会做正式修理。"}]}],"synonyms":["improvisation","temporariness","stopgap nature","makeshift quality"],"phonetic":"/ˈmeɪkˌʃɪftnəs/","extraExplanation":["“makeshiftness”是由形容词/名词 makeshift（临时凑合的；临时用品）加后缀 -ness 构成的名词，表示“……的性质/状态”。这个词在现代英语里比较少见，更常见的表达是 “the makeshift nature of …” 或直接用 “makeshift” 作形容词（a makeshift bed）。","语气上常带一点“不得已、将就、暂时”的意味，有时也暗示“不够理想但能应付”。"]}
{"word":"makeshifts","summary":{"en":"“Makeshifts” are temporary substitutes or stopgap solutions used when the proper thing isn’t available.","zh":"“makeshifts”指在缺少合适之物时使用的临时代用品或权宜之计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"temporary substitutes or solutions used because the proper thing is not available","zh":"（因缺少合适之物而用的）临时代用品；权宜之计"},"examples":[{"en":"After the storm, people used makeshifts until the power and water were restored.","zh":"暴风雨过后，人们用一些临时办法撑着，直到电力和供水恢复。"},{"en":"The camp relied on makeshifts like plastic sheets for roofs.","zh":"营地只能靠一些临时代用品，比如用塑料布当屋顶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of something) temporary and not ideal, but usable for now","zh":"（事物）临时的；凑合的；权宜的"},"examples":[{"en":"They built a makeshift desk out of boxes.","zh":"他们用箱子搭了一个临时书桌。"},{"en":"We slept in a makeshift shelter near the road.","zh":"我们在路边的临时棚屋里过夜。"}]}],"synonyms":["stopgaps","temporary substitutes","improvisations","quick fixes","workarounds"],"phonetic":"/ˈmeɪkˌʃɪft/","extraExplanation":["“makeshift”由 make（做、制造）+ shift（应付、凑合）组成，强调“先顶一下”的感觉：能用但不完美。作名词时常用复数 makeshifts，表示一堆临时替代物或权宜之计。"]}
{"word":"makeshifty","summary":{"en":"“Makeshifty” means temporary, improvised, and not ideal; it’s an informal way to say “makeshift.”","zh":"“makeshifty”表示临时拼凑、将就、不太理想；是比较口语的“makeshift”说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Temporary and not ideal; made or arranged quickly using whatever is available (like something “makeshift”).","zh":"临时凑合的；用手头现成材料匆忙拼凑出来的（类似 makeshift）。"},"examples":[{"en":"We slept in a makeshifty tent made from tarps and rope.","zh":"我们睡在一个临时凑合的帐篷里，是用防水布和绳子拼起来的。"},{"en":"They set up a makeshifty office in the hallway while the building was repaired.","zh":"大楼维修期间，他们在走廊里搭了个临时凑合的办公区。"}]},{"partOfSpeech":"adj.","definition":{"en":"Looking or feeling improvised, rough, or “not professionally done.”","zh":"看起来/感觉上是临时拼凑的、粗糙的、不太专业的。"},"examples":[{"en":"The stage lights were a bit makeshifty, but the show was still fun.","zh":"舞台灯光有点简陋凑合，但演出还是很有意思。"},{"en":"His plan sounded makeshifty and risky.","zh":"他的计划听起来有点凑合而且冒险。"}]}],"synonyms":["makeshift","improvised","temporary","rough-and-ready","jury-rigged"],"phonetic":"/ˈmeɪkʃɪfti/","extraExplanation":["“makeshifty”比较口语、非正式，常见于日常表达或网络文字；更标准、更常用的说法通常是“makeshift”（adj./n.）。","词源上“makeshift”来自“make（做）+ shift（设法应付）”，强调“先凑合顶上、以后再换更好的”。"]}
{"word":"makeup","summary":{"en":"“Makeup” most commonly means cosmetics for the face; it can also mean the composition or structure of something.","zh":"“makeup”最常指化妆品/妆容；也可表示某事物的构成或结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cosmetics (such as foundation, lipstick, and eye shadow) used to improve or change the appearance of the face.","zh":"（化）妆品；用于美化或改变面部外观的化妆用品（如粉底、口红、眼影等）。"},"examples":[{"en":"She wears very little makeup to work.","zh":"她上班时几乎不化妆。"},{"en":"He bought makeup for a stage performance.","zh":"他为舞台表演买了化妆品。"}]},{"partOfSpeech":"n.","definition":{"en":"The way something is formed or put together; the composition or structure of something.","zh":"构成；结构；组成方式。"},"examples":[{"en":"We studied the chemical makeup of the water.","zh":"我们研究了水的化学构成。"},{"en":"Her makeup is a mix of confidence and patience.","zh":"她的性格由自信和耐心交织而成。"}]}],"synonyms":["cosmetics","make-up","face paint","composition","structure","constitution"],"phonetic":"/ˈmeɪkˌʌp/","extraExplanation":["“makeup”（也常写作“make-up”）在美妆语境里是不可数名词，通常不说“a makeup”。如果要表达“一套/一次妆容”，更常用“a look”“a makeup look”或“a full face of makeup（全妆）”。","在“构成/组成”的意思里，makeup 常用于较正式或学术的表达：chemical makeup（化学构成）、genetic makeup（基因构成）、the makeup of the team（团队构成）。"]}
{"word":"makeups","summary":{"en":"“Makeups” usually means cosmetics (multiple items) or different makeup looks; less commonly it means the composition/structure of something.","zh":"“makeups”通常指（多件）化妆品或不同妆容；较少见时指某事物的组成/结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cosmetics used to improve or change how the face (or skin) looks.","zh":"化妆品；彩妆（用于改善或改变面部/皮肤外观）。"},"examples":[{"en":"Her makeups are arranged neatly on the bathroom shelf.","zh":"她的化妆品整齐地摆在浴室架子上。"},{"en":"Stage performers often bring their own makeups for different characters.","zh":"舞台演员常常自带不同角色用的化妆品。"}]},{"partOfSpeech":"n.","definition":{"en":"Different cosmetic looks or styles created with makeup (for example, “natural makeup,” “smoky-eye makeup”).","zh":"不同的妆容；化妆风格（如“裸妆”“烟熏妆”）。"},"examples":[{"en":"The artist showed three makeups for the same model: natural, glam, and bridal.","zh":"化妆师给同一位模特展示了三种妆容：自然、华丽、婚礼妆。"},{"en":"Try simple makeups if you’re new to cosmetics.","zh":"如果你刚开始化妆，可以先尝试简单的妆容。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, plural of “makeup” meaning the parts or structure of something (what it is made of).","zh":"较少见：makeup 的复数，指“构成；组成；结构”。"},"examples":[{"en":"The team discussed the makeups of different soil types in the region.","zh":"团队讨论了该地区不同土壤类型的组成。"},{"en":"We studied the makeups of the two communities—age, income, and language.","zh":"我们研究了两个社区的构成——年龄、收入和语言。"}]}],"synonyms":["cosmetics","beauty products","makeup products","looks","styles"],"phonetic":"/ˈmeɪkˌʌp/","extraExplanation":["“Makeups”在日常英语里最常见的是指“多件化妆品”或“不同妆容”。更常见、更自然的说法通常是不可数的“makeup”（如：I wear makeup. 我化妆/我用彩妆）。","拼写上也常见“make-up”（尤其是英式或较正式写法），但美式英语里“makeup”更常用。","不要和动词短语“make up”（编造/和好/组成）混淆：动词第三人称单数是“makes up”，不是“makeups”。"]}
{"word":"makeweight","summary":{"en":"Makeweight means someone or something added mainly to fill out numbers or to pad/balance something, not because it’s essential.","zh":"Makeweight 指主要为了凑人数、补分量而加入的人或物，通常暗示并非必需、价值不大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing added to a group, team, or situation mainly to fill a gap or make the numbers even, rather than because they are truly needed","zh":"（为凑数、补人数而）临时加入的人或物；“凑数的”"},"examples":[{"en":"They needed an extra player, so I went along as a makeweight.","zh":"他们需要多一个人上场，所以我就当作凑数的加入了。"},{"en":"The company hired him as a makeweight to show the project had enough staff.","zh":"公司雇他来凑人数，好让项目看起来人手充足。"}]},{"partOfSpeech":"adj.","definition":{"en":"added only to complete or balance something; not essential","zh":"（为补足、平衡而）附加的；非必要的"},"examples":[{"en":"A brief quote was included as makeweight material at the end of the article.","zh":"文章末尾加了一段简短引语作为凑篇幅的补充内容。"},{"en":"The argument relied on makeweight details instead of strong evidence.","zh":"这个论点靠一些凑数的细节，而不是有力证据。"}]}],"synonyms":["filler","padding","stopgap","extra","placeholder"],"phonetic":"/ˈmeɪkˌweɪt/","extraExplanation":["这个词由 make + weight 组成，原意与“增加重量、凑足分量”有关，所以常带有“并不重要、只是为了补齐”的语气。使用时可能略带轻微贬义，表示对其价值不高的判断。"]}
{"word":"makework","summary":{"en":"“Makework” means work created mainly to keep people busy, often seen as unnecessary or low-value.","zh":"“makework”指为了让人忙起来而安排的工作，通常被认为没必要或价值不高。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Work that is created just to keep people busy, often with little real value or purpose.","zh":"为了让人忙起来而刻意安排的工作（往往缺乏实际价值或意义）。"},"examples":[{"en":"The manager assigned makework to fill the slow afternoon.","zh":"经理安排了一些“凑工作量”的任务来打发下午的空闲时间。"},{"en":"Employees complained that the extra reports were just makework.","zh":"员工抱怨这些额外的报表只是形式上的“无用功”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the purpose of keeping someone occupied rather than achieving an important goal.","zh":"（工作/任务）主要目的在于让人有事做，而不是为了达成重要目标的。"},"examples":[{"en":"They gave us makework tasks while the real project was on hold.","zh":"真正的项目暂停时，他们给我们安排了一些“做做样子”的任务。"},{"en":"Filing papers all day felt like makework.","zh":"整天整理文件让我感觉像是在做无意义的忙碌。"}]}],"synonyms":["busywork","make-work","boondoggle","unnecessary work"],"phonetic":"/ˈmeɪkˌwɝk/","extraExplanation":["常见拼写是 **make-work**（带连字符），也可以写成 **makework**（合写），含义相同。更正式的写作里常用 make-work。","这个词常带有批评意味：暗示任务“看起来很忙”，但对结果帮助不大。与“training/练习”不同，training 通常有明确的学习目标。"]}
{"word":"makhazin","summary":{"en":"Makhazin means “storehouses/warehouses,” an Arabic plural form often used in historical or Middle East–related English contexts.","zh":"Makhazin 指“仓库/储藏所”（阿拉伯语复数形式），多见于历史或中东相关的英文语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Arabic loanword/transliteration) storehouses; warehouses; storage depots (plural of makhzan).","zh":"（阿拉伯语音译/转写）仓库；储藏所；物资存放点（makhzan 的复数）。"},"examples":[{"en":"The goods were kept in the makhazin until they could be shipped.","zh":"货物先存放在这些 makhazin（仓库）里，等能发货时再运走。"},{"en":"In old port cities, makhazin near the harbor held spices and textiles.","zh":"在一些古老的港口城市里，靠近码头的 makhazin（仓库）常用来存放香料和纺织品。"}]}],"synonyms":["storehouses","warehouses","depots","storage facilities"],"phonetic":"/məˈxɑːzɪn/","extraExplanation":["“makhazin”（阿拉伯语：مخازن）是“makhzan（仓库/储藏处）”的复数形式。它常见于英文历史、文化或中东相关文本中，作为阿拉伯词的转写，而不是现代英语的日常用词。","它与英语单词“magazine”在词源上有关：早期经由法语等语言传播，“magazine”最初就有“仓库/储藏处”的意思，后来才发展出“期刊杂志”“弹药库/弹匣”等含义。"]}
{"word":"makhorka","summary":{"en":"Makhorka is a strong, cheap tobacco associated with Russia/USSR, often used when better tobacco wasn’t available.","zh":"Makhorka 指一种在俄罗斯/前苏联常见、味道很烈且较廉价的烟草，常见于优质烟草缺乏的年代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, low-quality tobacco (often from a hardy tobacco plant) that was widely used in Russia and the former Soviet Union, especially when better tobacco was scarce.","zh":"一种味道很冲、品质较低的烟草（常指耐寒烟草制成），在俄罗斯和前苏联地区很常见，尤其在优质烟草短缺时广泛使用。"},"examples":[{"en":"In the novel, the soldier rolls a cigarette with makhorka because regular tobacco is hard to find.","zh":"在小说里，士兵用马霍尔卡烟草卷烟，因为普通烟草很难弄到。"},{"en":"The room smelled of makhorka and damp wool coats.","zh":"房间里有马霍尔卡烟草和潮湿羊毛大衣的味道。"}]}],"synonyms":["shag tobacco","rough tobacco","rustic tobacco"],"phonetic":"/məˈkɔrkə/","extraExplanation":["“makhorka/махорка”常和战争年代、贫困时期或基层生活联系在一起，带有一种“粗糙、凑合”的时代气息。在一些俄语文学或回忆录中，它不仅是烟草，也常用来营造艰苦环境的氛围。","它有时特指用耐寒烟草（Nicotiana rustica）制作的烟草，比常见的栽培烟草（Nicotiana tabacum）更烈、更呛。"]}
{"word":"makhzan","summary":{"en":"Makhzan means a storehouse, and in Moroccan contexts it can also mean the ruling establishment or state power structure (often written Makhzen).","zh":"Makhzan 指“仓库/储藏处”；在摩洛哥语境中也可指“统治集团/国家权力体系”（常写作 Makhzen）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a storehouse; a place where goods are kept or stored (an Arabic loanword).","zh":"仓库；储藏室（源自阿拉伯语的外来词）。"},"examples":[{"en":"The grain was kept in a makhzan near the port.","zh":"粮食被存放在港口附近的一个仓库里。"},{"en":"They searched the makhzan for spare parts.","zh":"他们在仓库里寻找备用零件。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in Morocco, often written Makhzen/Makhzan) the central governing power or ruling establishment, historically linked to the sultan’s administration and state authority.","zh":"（尤指摩洛哥，常写作 Makhzen/Makhzan）统治集团；中央政权/国家权力体系（历史上与苏丹的行政机构相关）。"},"examples":[{"en":"Some critics say the Makhzan still shapes Moroccan political life.","zh":"一些批评者说，“马赫赞”体系仍在影响摩洛哥的政治生活。"},{"en":"The reforms were negotiated with representatives of the Makhzan.","zh":"改革与“马赫赞”方面的代表进行了谈判。"}]}],"synonyms":["warehouse","storehouse","depot","(Morocco) establishment","(Morocco) regime"],"phonetic":"/ˈmɑk.zɑn/","extraExplanation":["“makhzan”来自阿拉伯语 مَخْزَن (makhzan)，词根含义与“储存、保管”有关。","它和英语单词“magazine”在词源上有关：早期“magazine”也有“仓库/军火库”的意思，后来才发展出“杂志”的含义。","在北非语境里写作 Makhzen/Makhzan 时，常带有政治与历史色彩，指国家权力结构或统治精英，而不只是普通“仓库”。"]}
{"word":"makhzen","summary":{"en":"Makhzen most commonly means Morocco’s ruling establishment; historically it can also mean a storehouse/warehouse.","zh":"Makhzen 最常指摩洛哥的统治建制或权力结构；历史上也可指“仓库/货栈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Morocco) the country’s ruling establishment or power structure, closely linked to the monarchy, senior officials, security services, and influential elites.","zh":"（摩洛哥）“马赫赞/马赫森”，指与王室关系紧密的统治体系或权力结构，包括高层官员、安全机构与重要精英网络。"},"examples":[{"en":"Many journalists in Morocco use “the Makhzen” to mean the political establishment around the monarchy.","zh":"在摩洛哥，许多记者用“the Makhzen”来指围绕王室的政治建制派。"},{"en":"Protesters criticized the Makhzen for blocking reforms.","zh":"抗议者批评马赫赞阻碍改革。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, from Arabic) a storehouse; a warehouse for goods, especially in North African contexts.","zh":"（历史用法，源自阿拉伯语）仓库；货栈（尤指北非语境中的货物储藏处）。"},"examples":[{"en":"In older texts, makhzen can refer to a storehouse where grain or supplies were kept.","zh":"在较早的文献中，makhzen 可指储存谷物或物资的仓库。"}]}],"synonyms":["(political sense) establishment","regime","power structure","state apparatus"],"phonetic":"/mɑːkˈzɛn/","extraExplanation":["“Makhzen”源自阿拉伯语“مخزن”（makhzan，意为“仓库/储藏处”）。在摩洛哥的政治语境里，它的含义从“国家收税与物资储备之处”逐渐引申为“国家权力的中心与统治网络”。","英语新闻或学术写作中常写作 the Makhzen（通常大写），带有“体制/深层权力结构”的意味，语气往往偏批评或分析。"]}
{"word":"maki","summary":{"en":"Maki is a Japanese-style sushi roll: rice and fillings rolled in seaweed and sliced into pieces.","zh":"Maki 指日式寿司卷：把米饭和馅料用海苔卷起并切段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of Japanese sushi made by rolling rice and fillings in seaweed (nori), then slicing it into bite-size pieces; a sushi roll.","zh":"一种日式寿司：把米饭和馅料用海苔（nori）卷起来，再切成小段；即“寿司卷”。"},"examples":[{"en":"I’ll have a tuna maki and a miso soup, please.","zh":"我想要一份金枪鱼寿司卷，再来一碗味噌汤，谢谢。"},{"en":"Cucumber maki is a simple, beginner-friendly sushi roll.","zh":"黄瓜寿司卷很简单，适合新手。"},{"en":"The menu lists salmon maki in an 8-piece set.","zh":"菜单上写着三文鱼寿司卷，8块一份。"}]}],"synonyms":["sushi roll","makizushi"],"phonetic":"/ˈmɑːki/","extraExplanation":["“maki”来自日语「巻き」（まき），意思是“卷”。在英语点餐环境中，maki通常指切成小段的海苔寿司卷（makizushi）。","常见类型：hosomaki（细卷，馅料较少，如黄瓜卷）、futomaki（粗卷，馅料更丰富）。不同餐厅也可能把“maki”直接写作“sushi roll”。"]}
{"word":"makimono","summary":{"en":"A Japanese handscroll unrolled horizontally to read or view art.","zh":"日本的横向手卷，展开阅读文字或观看绘画。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese handscroll (a long roll of paper or silk) that is unrolled horizontally to show writing, calligraphy, or a painted narrative scene","zh":"（日）横卷／手卷：一种日本的长卷轴（纸或绢），水平展开来阅读文字、书法或观看连贯的绘画故事"},"examples":[{"en":"The museum displayed a makimono illustrating a famous historical battle.","zh":"博物馆展出了一幅描绘著名历史战役的手卷（makimono）。"},{"en":"You view a makimono by unrolling it section by section from right to left.","zh":"观看手卷（makimono）时，通常从右向左一段一段地展开。"}]}],"synonyms":["handscroll","scroll","picture scroll"],"phonetic":"/ˌmɑːkiˈmoʊnoʊ/","extraExplanation":["「makimono（巻物）」是日语词，字面意思是“卷起来的东西”。在英文语境中多用于艺术史、博物馆说明或日本文化相关写作。","相关词：**emakimono（絵巻物）**特指“绘卷”，强调画面叙事；makimono 更泛指手卷形式，既可有文字也可有画。"]}
{"word":"makimonos","summary":{"en":"Makimonos are Japanese illustrated handscrolls (plural of makimono).","zh":"Makimonos 指日本的绘卷/手卷（makimono 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Japanese illustrated handscrolls—long paintings or calligraphy on paper or silk, rolled up and read/viewed from right to left. “Makimonos” is the plural of “makimono.”","zh":"日本的绘卷（手卷）——把绘画或书法画在纸或绢上，卷起来保存，展开时通常从右向左阅读/观赏。“makimonos”是“makimono”的复数。"},"examples":[{"en":"The museum displayed several makimonos from the Edo period.","zh":"博物馆展出了几幅江户时期的绘卷。"},{"en":"We studied makimonos to understand how stories were told through images in Japan.","zh":"我们通过研究绘卷来了解日本如何用图像讲故事。"},{"en":"The artist unrolled the makimono slowly, revealing the scene section by section.","zh":"艺术家慢慢展开那幅绘卷，让画面一段段呈现出来。"}]}],"synonyms":["Japanese handscrolls","handscrolls","emaki (when referring to illustrated narrative scrolls)"],"phonetic":"/ˌmɑkiˈmoʊnoʊz/","extraExplanation":["“巻物（まきもの, makimono）”在日本艺术与文学中很常见，常用于叙事：画面像“时间轴”一样随着展开推进，让观者边看边“阅读”故事。常见相关类型有“絵巻物（えまきもの, emaki）”，强调图文叙事的绘卷。英语里也有人直接说 “Japanese handscroll(s)” 来解释给不熟悉日本文化的读者。"]}
{"word":"making","summary":{"en":"“Making” usually means the process of creating something, or it is the present participle of “make” (doing/causing).","zh":"“making”常指“制作/形成的过程”，也可作 make 的现在分词，表示“正在做/促使发生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of creating, producing, or building something","zh":"制作；制造；创作的过程（指做出某物的行为或过程）"},"examples":[{"en":"The making of the film took three years.","zh":"这部电影的制作花了三年。"},{"en":"She enjoys the making of handmade gifts.","zh":"她喜欢制作手工礼物。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “make”: creating, preparing, or causing something to happen","zh":"make 的现在分词：正在制作/准备；促使某事发生"},"examples":[{"en":"He is making dinner right now.","zh":"他现在正在做晚饭。"},{"en":"They are making plans for the weekend.","zh":"他们正在制定周末计划。"},{"en":"That joke is making me laugh.","zh":"那个笑话让我发笑。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in phrases to mean “likely to become” or “having the qualities to become” (often: “a making of…”)","zh":"用于短语中：有望成为；具备成为……的潜质（常见：the making of…）"},"examples":[{"en":"She has the making of a great leader.","zh":"她具备成为优秀领导者的潜质。"},{"en":"It felt like the making of a good friendship.","zh":"这感觉像是一段好友谊的开端。"}]}],"synonyms":["creation","production","manufacture","building","preparation"],"phonetic":"/ˈmeɪkɪŋ/","extraExplanation":["“making”既可以是名词（the making of… 表示“……的制作/形成过程”），也可以是动词 make 的现在分词，用在进行时（be making）或作动名词（Making friends is hard. 交朋友很难）。","常见搭配：making progress（取得进展）、making sense（讲得通/有道理）、making sure（确保）、money-making（赚钱的/盈利的，作形容词）。"]}
{"word":"makings","summary":{"en":"Makings means either the materials needed to make something, or the qualities/potential needed to become something (often in “the makings of …”).","zh":"Makings 指做某物所需的材料，或（常见于 “the makings of …”）成为某种事物所需的素质与潜力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the materials or ingredients needed to make something","zh":"做某物所需的材料；原料"},"examples":[{"en":"Do we have the makings for pancakes?","zh":"我们有做煎饼需要的材料吗？"},{"en":"With flour, eggs, and milk, she had the makings of a simple cake.","zh":"有面粉、鸡蛋和牛奶，她就有了做一个简单蛋糕的原料。"}]},{"partOfSpeech":"n.","definition":{"en":"the qualities or potential needed to become something in the future (often used in “the makings of …”)","zh":"成为某种事物的素质或潜力（常用于 “the makings of …”）"},"examples":[{"en":"He has the makings of a great leader.","zh":"他具备成为优秀领导者的潜质。"},{"en":"Her curiosity and patience are the makings of a good scientist.","zh":"她的好奇心和耐心是成为好科学家的关键素质。"},{"en":"The team showed the makings of a championship run.","zh":"这支队伍展现了夺冠征程所需的实力和潜力。"}]}],"synonyms":["ingredients","materials","components","potential","promise"],"phonetic":"/ˈmeɪkɪŋz/","extraExplanation":["“makings”几乎总以复数形式出现，常见搭配有：the makings for + 食物/物品（做……的材料），以及 the makings of + 人/事（成为……的潜质）。","语气上，“the makings of …”带有鼓励或判断潜力的意味，常用于评价人的能力、性格或团队表现。"]}
{"word":"Makkah","summary":{"en":"Makkah is Islam’s holiest city in Saudi Arabia, home to the Kaaba and the destination of the Hajj pilgrimage.","zh":"麦加是沙特阿拉伯的伊斯兰教最神圣城市，克尔白（天房）所在地，也是朝觐（哈吉）的目的地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The holiest city in Islam, in western Saudi Arabia; the birthplace of the Prophet Muhammad and the location of the Kaaba, the direction of Muslim prayer.","zh":"伊斯兰教最神圣的城市，位于沙特阿拉伯西部；先知穆罕默德的出生地，也是克尔白（天房）所在地，穆斯林礼拜时朝向的方向。"},"examples":[{"en":"Every year, millions of Muslims travel to Makkah for the Hajj pilgrimage.","zh":"每年都有数以百万计的穆斯林前往麦加参加朝觐（哈吉）。"},{"en":"During prayer, Muslims around the world face toward Makkah.","zh":"礼拜时，世界各地的穆斯林都会面向麦加。"}]}],"synonyms":["Mecca"],"phonetic":"/ˈmɑːkə/","extraExplanation":["“Makkah”是该城市在阿拉伯语中的常见转写；英文里也常见“Mecca”。在一些宗教或正式语境中，人们更倾向使用“Makkah”以贴近原语发音与拼写。","文化与宗教敏感点：麦加对穆斯林极为神圣；按沙特现行规定，非穆斯林一般不得进入城市中心圣区。写作或交流时可保持尊重，避免将其随意当作普通比喻。","在英语中，“mecca”有时会被小写用作比喻，表示“某领域的圣地/中心”（如“a mecca for jazz lovers”）。但这属于引申义，用在正式宗教语境时建议保留专名大写并使用“Makkah/Mecca”。"]}
{"word":"makluk","summary":{"en":"A Mamluk is a medieval Islamic slave-soldier; the Mamluks later ruled Egypt and Syria.","zh":"马穆鲁克指中世纪伊斯兰世界的“奴隶士兵”阶层，后来在埃及与叙利亚建立并统治马穆鲁克政权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of a medieval Muslim military class, originally enslaved soldiers who later gained power and ruled Egypt and Syria (the Mamluk Sultanate, 1250–1517).","zh":"马穆鲁克（Mamluk/也常写作 mameluke）：中世纪伊斯兰世界的一种军事阶层，最初多为被奴役并受训的士兵，后来掌权并统治埃及与叙利亚（马穆鲁克苏丹国，1250–1517）。"},"examples":[{"en":"The Mamluks defeated the Mongols at the Battle of Ain Jalut in 1260.","zh":"马穆鲁克人在1260年的艾因贾鲁特之战中击败了蒙古军队。"},{"en":"In many history books, a Mamluk is described as a slave-soldier who could rise to high rank.","zh":"在许多历史书中，马穆鲁克被描述为“奴隶士兵”，却可能升至高位。"}]}],"synonyms":["slave-soldier","mameluke"],"phonetic":"/ˈmæm.luːk/","extraExplanation":["“makluk”更常见的标准拼写是 **Mamluk**（也见 **mameluke**）。词源来自阿拉伯语 *mamlūk*，意为“被拥有的人/奴隶”。历史上，他们虽然出身为奴隶士兵，但通过军事训练与政治联盟，形成强大的统治集团。","英语里 **Mamluk** 常用于历史语境；若在现代语境看到“makluk”，可能是音译、拼写变体，或对该词的不规范转写。写学术或正式文章时建议用 **Mamluk**。"]}
{"word":"mako","summary":{"en":"A mako is a very fast ocean shark, especially the shortfin or longfin mako.","zh":"mako 指一种速度很快的海洋鲨鱼，常特指短鳍或长鳍的灰鲭鲨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fast, ocean-dwelling shark with a pointed snout, known for speed and powerful jumps (often referring to the shortfin or longfin mako shark).","zh":"一种速度很快的海洋鲨鱼，吻部尖，力量强、常会跃出水面（常指短鳍灰鲭鲨或长鳍灰鲭鲨）。"},"examples":[{"en":"The mako is one of the fastest sharks in the ocean.","zh":"灰鲭鲨是海洋中速度最快的鲨鱼之一。"},{"en":"Researchers tagged a mako to track its migration across the Pacific.","zh":"研究人员给一条灰鲭鲨做了标记，以追踪它横跨太平洋的迁徙。"},{"en":"We watched a mako leap out of the water near the boat.","zh":"我们看到一条灰鲭鲨在船旁跃出水面。"}]}],"synonyms":["mako shark","shortfin mako","longfin mako"],"phonetic":"/ˈmeɪkoʊ/","extraExplanation":["“mako”来自毛利语（Māori），与“鲨鱼/鲨鱼牙齿”等含义相关；英语里通常直接指“灰鲭鲨（mako shark）”。","在新闻或科普中常见搭配：shortfin mako（短鳍灰鲭鲨）、longfin mako（长鳍灰鲭鲨）。"]}
{"word":"makomako","summary":{"en":"Makomako is a Māori word for the New Zealand native wineberry tree.","zh":"Makomako 是毛利语，指新西兰本土的酒莓树（wineberry）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Māori name for the New Zealand native wineberry tree (Aristotelia serrata), a small tree with dark berries and light, “peppery” foliage","zh":"毛利语中对新西兰本土“酒莓树 / 酒果树”（Aristotelia serrata，常见英文名 wineberry）的一种称呼；这种小乔木结深色浆果，叶片较浅、带微辛香气"},"examples":[{"en":"We planted makomako in the garden to attract native birds.","zh":"我们在花园里种了 makomako 来吸引本土鸟类。"},{"en":"The makomako berries turn dark when they’re ripe.","zh":"makomako 的浆果成熟时会变得很深色。"}]}],"synonyms":["wineberry","Aristotelia serrata"],"phonetic":"/ˌmɑːkoʊˈmɑːkoʊ/","extraExplanation":["“Makomako”常见于新西兰语境，尤其是涉及毛利文化、原生植物与生态恢复（native planting / restoration）的文章或导览说明中。","英文里更常用的对应词是 wineberry（不是葡萄酒的“酒渣”，而是一种树的俗名）。在正式或学术场合也会写其拉丁学名 Aristotelia serrata。"]}
{"word":"makonde","summary":{"en":"Makonde refers to an ethnic group in Tanzania/Mozambique, their Bantu language, and anything related to their culture.","zh":"Makonde 指坦桑尼亚/莫桑比克一带的马孔德民族、他们的班图语（马孔德语），以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bantu-speaking ethnic group mainly living in southeastern Tanzania and northern Mozambique","zh":"马孔德人（班图语族民族，主要居住在坦桑尼亚东南部与莫桑比克北部）"},"examples":[{"en":"The Makonde are known for their strong cultural traditions.","zh":"马孔德人以其深厚的文化传统而闻名。"},{"en":"Many Makonde communities live near the border between Tanzania and Mozambique.","zh":"许多马孔德社群居住在坦桑尼亚与莫桑比克的边境附近。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bantu language spoken by the Makonde people (also called Kimakonde/Chimakonde in some contexts)","zh":"马孔德语（马孔德人使用的班图语；在一些语境中也称 Kimakonde/Chimakonde）"},"examples":[{"en":"She is learning Makonde to communicate with her relatives.","zh":"她在学习马孔德语，以便和亲人交流。"},{"en":"The guide translated a few greetings from Makonde into English.","zh":"导游把几句马孔德语问候翻译成了英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Makonde people, their language, or their culture","zh":"马孔德（人/语/文化）的；与马孔德有关的"},"examples":[{"en":"Makonde art often features detailed wood carvings.","zh":"马孔德艺术常以精细的木雕为特色。"},{"en":"We visited a Makonde cultural center during the trip.","zh":"旅行中我们参观了一个马孔德文化中心。"}]}],"synonyms":["the Makonde","Makonde language","Kimakonde"],"phonetic":"/məˈkɑn.deɪ/","extraExplanation":["“Makonde”在英语里通常作为专有名词使用，首字母大写：the Makonde（马孔德人）、Makonde (language)（马孔德语）。","马孔德木雕（Makonde carving）在东非很有名，常见题材包括人物群像、祖先/精灵意象与日常生活场景；在旅游与艺术语境里你可能更常遇到这个搭配。"]}
{"word":"makopa","summary":{"en":"Makopa is a Filipino/Tagalog word for the wax apple (rose apple) fruit.","zh":"Makopa 是菲律宾/他加禄语中对“莲雾（wax apple / rose apple）”的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical fruit (also the tree that bears it), commonly called the wax apple or rose apple, with crisp, watery flesh and a mild, slightly sweet taste.","zh":"一种热带水果（也指结果的树），英语常称“wax apple / rose apple（莲雾/玫瑰苹果）”，口感清脆多汁，味道清淡微甜。"},"examples":[{"en":"In the Philippines, makopa is often eaten fresh and chilled.","zh":"在菲律宾，makopa 常常洗净后冰镇直接吃。"},{"en":"She sliced the makopa and served it with a little salt.","zh":"她把 makopa 切片，配一点盐一起吃。"},{"en":"The makopa tree grows well in warm, humid climates.","zh":"makopa 树适合在温暖潮湿的气候中生长。"}]}],"synonyms":["wax apple","rose apple","Java apple","water apple"],"phonetic":"/məˈkoʊpə/","extraExplanation":["“Makopa”是菲律宾（尤其是他加禄语/Tagalog）中对这种水果的常见称呼；英语里更常见的名称是 wax apple 或 rose apple。中文里常译作“莲雾”（不同地区也可能有别称）。","在东南亚的日常饮食里，这种水果常被当作清爽的点心：直接吃、冰镇吃，或搭配盐、酸梅粉、辣椒盐等调味。"]}
{"word":"makos","summary":{"en":"“Makos” usually means more than one mako shark (plural of “mako”).","zh":"“Makos”通常指多条灰鲭鲨，是“mako”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mako shark (either of two fast, ocean-dwelling sharks), known for speed and a pointed snout; “makos” is the plural form","zh":"灰鲭鲨（两种速度很快的远洋鲨鱼之一），以游速快、吻部尖而闻名；“makos”为复数形式"},"examples":[{"en":"Makos can swim very fast compared with many other sharks.","zh":"灰鲭鲨与许多其他鲨鱼相比游得非常快。"},{"en":"The documentary showed makos hunting fish in open water.","zh":"纪录片展示了灰鲭鲨在外海捕食鱼类。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) short for “mako shark,” sometimes used in names, teams, or nicknames","zh":"（非正式）“灰鲭鲨”的简称，有时用于名称、队名或绰号"},"examples":[{"en":"Their mascot is a mako, symbolizing speed.","zh":"他们的吉祥物是灰鲭鲨，象征速度。"}]}],"synonyms":["mako shark","shortfin mako","longfin mako"],"phonetic":"/ˈmeɪkoʊ/","extraExplanation":["“mako”一词常被认为来自毛利语（Māori），与“鲨鱼/一种鲨鱼”相关；英语里更常见单数“mako”，复数写作“makos”。","日常写作中，如果你指的是这种动物，一般写“mako shark / mako sharks”。单独写“mako/makos”也可以，但语境要清楚。"]}
{"word":"makoua","summary":{"en":"Makoua is most commonly a proper noun, especially the name of a town in the Republic of the Congo; it can also be a personal or family name.","zh":"Makoua 最常见为专有名词，尤其指刚果共和国的一个城镇；也可用作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name: a town in the Republic of the Congo (Cuvette Department)","zh":"地名：刚果共和国（Cuvette省）的一个城镇"},"examples":[{"en":"Makoua is a small town in the Republic of the Congo.","zh":"Makoua 是刚果共和国的一个小城镇。"},{"en":"She traveled through Makoua on her way north.","zh":"她在北上途中经过了 Makoua。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal or family name in some regions (usage varies)","zh":"人名或姓氏（在部分地区使用，具体含义因文化而异）"},"examples":[{"en":"Makoua is my friend’s family name.","zh":"Makoua 是我朋友的姓氏。"},{"en":"Mr. Makoua will speak at the meeting.","zh":"Makoua 先生将会在会议上发言。"}]}],"phonetic":"/məˈkuːə/","extraExplanation":["“Makoua”在英语中更常见的是专有名词（地名/人名），通常不作为普通词汇使用，因此具体含义需要结合语境（例如国家、族群、语言或个人背景）。","拼写上有时会与“Makua / Makhuwa”（非洲东南部的马库阿人及其语言）混淆，但它们不一定指同一事物；如果你能告诉我你看到它的句子或来源，我可以更准确解释。"]}
{"word":"makran","summary":{"en":"Makran is a coastal region on the Arabian Sea, mainly in southwestern Pakistan and southeastern Iran.","zh":"Makran 指阿拉伯海沿岸的马克兰地区，主要位于巴基斯坦西南部和伊朗东南部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coastal region along the Arabian Sea, mainly in southwestern Pakistan (Balochistan) and southeastern Iran","zh":"马克兰地区：阿拉伯海沿岸的一片地区，主要位于巴基斯坦西南部（俾路支省）与伊朗东南部"},"examples":[{"en":"The Makran Coast is known for its dramatic cliffs and quiet beaches.","zh":"马克兰海岸以壮观的海崖和安静的海滩而闻名。"},{"en":"A powerful earthquake once caused a tsunami along the Makran coast.","zh":"曾有一次强烈地震在马克兰海岸引发了海啸。"},{"en":"He traveled across Makran on his way from Iran to Pakistan.","zh":"他从伊朗前往巴基斯坦途中穿越了马克兰地区。"}]}],"synonyms":["Makran Coast","Mekran (variant spelling)"],"phonetic":"/məˈkrɑːn/","extraExplanation":["“Makran”常见于新闻与地理语境，如“Makran Coast（马克兰海岸）”“Makran Subduction Zone（马克兰俯冲带）”。俯冲带位于阿拉伯海附近，因此在地震与海啸研究中也很常被提到。","拼写上偶尔可见变体“Mecran / Mekran”，但“Makran”更常用。作为地名，通常首字母大写。"]}
{"word":"makroskelic","summary":{"en":"“Makroskelic” isn’t standard English; it likely means “macroskeletal,” describing a large-scale skeletal/framework structure.","zh":"“makroskelic”不是标准英语；很可能指“macroskeletal”，表示宏观的骨架/框架结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) likely meant “macroskeletal”: relating to the large-scale structure or framework of something, especially a body’s skeleton or the main supporting framework of a system.","zh":"（非标准拼写）多半是想写“macroskeletal”：指某物的宏观（大尺度）结构或骨架框架，尤指身体骨骼或系统的主要支撑结构。"},"examples":[{"en":"In this report, we focus on the macroskeletal layout of the robot, not the small wiring details.","zh":"在这份报告中，我们关注机器人的宏观骨架布局，而不是细小的线路细节。"},{"en":"The artist planned the macroskeletal form first, then added surface textures later.","zh":"艺术家先规划整体骨架形态，然后再添加表面纹理。"}]}],"synonyms":["macroskeletal","macrostructural","skeletal","structural","overall framework"],"phonetic":"ˌmækroʊˈskɛlətl","extraExplanation":["“makroskelic”并不是常见的英语单词，更像是拼写错误或个人造词。英语里更自然的写法通常是：macroskeletal（宏观骨架的）、macrostructure（宏观结构的）、skeletal framework（骨架/框架）。","构词提示：macro- 表示“宏观的/大的”，skeletal 来自 skeleton（骨骼）。在学术写作里，如果不是专门术语，很多时候用 macrostructure 或 overall framework 更清晰、更常见。"]}
{"word":"maksoorah","summary":{"en":"Maksoorah is an Arabic loanword meaning a screened enclosure (often in a mosque), and it can also refer to the Arabic letter form “ى” (alif maqsurah).","zh":"Maksoorah 是源自阿拉伯语的外来词，可指清真寺等处的隔离/围挡区域；也可指阿拉伯语字母形式“ى”（alif maqsurah）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Arabic) a screened or enclosed area, especially in a mosque, traditionally reserved for a ruler or important people.","zh":"（源自阿拉伯语）封闭或用屏风隔开的区域，尤指清真寺内传统上为统治者或重要人物保留的隔间/包厢。"},"examples":[{"en":"In some historic mosques, the ruler prayed in a maksoorah for safety.","zh":"在一些历史悠久的清真寺里，统治者会在 maksoorah（隔间）中礼拜以确保安全。"},{"en":"The guide pointed out the maksoorah near the front of the prayer hall.","zh":"导游指着礼拜大厅前方附近的 maksoorah（隔离区）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Arabic writing/grammar) another spelling of “alif maqsurah,” the letter “ى” used at the end of some Arabic words.","zh":"（阿拉伯文字/语法）“alif maqsurah（短尾/弯尾的alif）”的另一种拼写：字母“ى”，常出现在某些阿拉伯词的词尾。"},"examples":[{"en":"In Arabic class we learned when to write an alif as maksoorah (ى).","zh":"在阿拉伯语课上，我们学习了什么时候要把 alif 写成 maksoorah（ى）。"},{"en":"This word ends with maksoorah, not the regular alif (ا).","zh":"这个词以 maksoorah（ى）结尾，而不是普通的 alif（ا）。"}]}],"synonyms":["maqsurah","maqsura","enclosure","screened area"],"phonetic":"/ˌmæk.sʊˈrɑː/","extraExplanation":["“maksoorah”常见于英语学术写作或导览解说中，是阿拉伯语“maqṣūrah/مقصورة”的转写之一；也可能被用来指“alif maqsurah（الألف المقصورة）”。不同地区或作者会写成 maqsurah / maksura / maqsura 等，属于转写差异。"]}
{"word":"maku","summary":{"en":"Maku is mainly a Japanese word meaning “curtain/act” (幕) or “to wrap/wind” (巻く).","zh":"Maku 主要是日语词：可指“帷幕/一幕”（幕），也可指“缠绕/卷起”（巻く）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Japanese) a curtain; also used to mean a “scene/act” of a play (as in kabuki or traditional theater).","zh":"（日语）“幕”：帷幕、幕布；也可引申为戏剧的“场/幕”（如歌舞伎等传统戏剧中的一幕）。"},"examples":[{"en":"The play has three maku, and the second one is the most dramatic.","zh":"这出戏有三幕，其中第二幕最富戏剧性。"},{"en":"The maku fell at the end of the performance.","zh":"演出结束时帷幕落下。"}]},{"partOfSpeech":"v.","definition":{"en":"(Japanese, from the verb “maku”) to wind, wrap, or coil something around something else.","zh":"（日语，来自动词“巻く”）缠绕、卷起；把某物绕在另一物上。"},"examples":[{"en":"She maku the scarf around her neck to keep warm.","zh":"她把围巾绕在脖子上保暖。"},{"en":"In Japanese, maku can mean “to wrap” or “to coil.”","zh":"在日语里，maku 可以表示“包裹”或“缠绕”。"}]}],"synonyms":["curtain","act","wrap","wind","coil"],"phonetic":"/ˈmɑku/","extraExplanation":["“maku”不是常见英语单词，更常见于日语语境：\n1）写作「幕」时，既指“帷幕/幕布”，也用于戏剧结构中的“一幕”。英语里对应常用 curtain / act。\n2）写作「巻く」时是动词“缠/卷/绕”。若你想找英语表达，常用 wrap / wind / coil。","如果你是在英文文章里看到 maku，它可能是人名、地名、品牌名，或日语借词；最好提供上下文句子以便确定含义。"]}
{"word":"makua","summary":{"en":"Makua refers to a major ethnic group in northern Mozambique and also to their Bantu language (often called Makhuwa).","zh":"Makua 指莫桑比克北部的重要族群“马库阿人”，也可指他们使用的班图语系语言“马库阿语”（常称 Makhuwa）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bantu ethnic group mainly in northern Mozambique (and nearby areas), also called the Makhuwa/Macua people","zh":"马库阿人：主要分布在莫桑比克北部（及周边地区）的班图语系族群，也常写作 Makhuwa / Macua"},"examples":[{"en":"The Makua are one of the largest ethnic groups in Mozambique.","zh":"马库阿人是莫桑比克最大的族群之一。"},{"en":"Some Makua communities live near the Mozambique–Tanzania border.","zh":"一些马库阿人社群生活在莫桑比克与坦桑尼亚边境附近。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bantu language spoken by the Makua people (often called Makhuwa)","zh":"马库阿语：马库阿人使用的班图语系语言（也常称 Makhuwa）"},"examples":[{"en":"She learned basic greetings in Makua before traveling to Nampula.","zh":"去楠普拉旅行前，她学了一些马库阿语的基本问候语。"},{"en":"Makua is written in the Latin alphabet in many modern materials.","zh":"许多现代资料中，马库阿语使用拉丁字母书写。"}]}],"synonyms":["Makhuwa","Macua"],"phonetic":"/məˈkuːə/","extraExplanation":["“Makua”在英语里多作为专有名词使用，指族群或语言；常见拼写变体有“Makhuwa”“Macua”。不同来源可能因转写系统不同而拼写不同，但通常指向同一族群/语言群。","谈到族群名称时，英语里常用大写（Makua）；指语言时也常大写（Makua / Makhuwa）。在写作中最好结合具体地区（如 Mozambique 莫桑比克）以避免混淆。"]}
{"word":"makuk","summary":{"en":"“Makuk” isn’t common English; it’s usually a misspelling of “mukluk,” a traditional Arctic winter boot.","zh":"“makuk” 不是常见英语词；通常是 “mukluk”（北极地区传统保暖靴/雪地靴）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a misspelling or variant spelling of “mukluk” (a soft winter boot originally worn by Inuit and other Arctic peoples).","zh":"不是标准英语词；最常见情况是 “mukluk” 的误拼或变体拼写（源自因纽特等北极地区民族穿的软底保暖靴）。"},"examples":[{"en":"I think “makuk” here is a typo—did you mean “mukluk” boots?","zh":"这里的 “makuk” 可能是拼写错误——你是不是想说 “mukluk” 雪地靴？"},{"en":"She bought a pair of mukluks for the snowy winter.","zh":"她为下雪的冬天买了一双 mukluks 雪地靴。"}]}],"synonyms":["mukluk","winter boot","snow boot"],"phonetic":"/məˈkʊk/","extraExplanation":["“mukluk” 是一个借词（loanword），来自因纽特-尤皮克语系相关语言，后来进入英语，多用于描述北方地区传统的软皮靴/雪地靴。","如果你是在某本书、游戏、地名或人名里看到 “Makuk”，它也可能是专有名词（品牌名/姓氏/地名等）。如果你告诉我上下文句子，我可以更准确判断含义。"]}
{"word":"makuta","summary":{"en":"Makuta usually means a crown or ornate royal/religious headdress, especially in South and Southeast Asian contexts; in some Swahili usage it can also relate to a crown or historical currency.","zh":"Makuta通常指“王冠/华丽冠饰”，多见于南亚与东南亚的宗教或王权语境；在部分斯瓦希里语用法中，也可指王冠或历史上的货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a crown or royal headdress (often used in South Asian and Southeast Asian cultural or religious contexts).","zh":"王冠；皇冠式头饰（常见于南亚、东南亚的文化或宗教语境）。"},"examples":[{"en":"The statue shows the deity wearing a makuta decorated with jewels.","zh":"这尊雕像展示了神祇戴着一顶镶有宝石的makuta（王冠）。"},{"en":"In the temple carving, the king’s makuta symbolizes authority.","zh":"在寺庙雕刻中，国王的makuta象征权威。"}]},{"partOfSpeech":"n.","definition":{"en":"in Swahili, “makuta” can refer to a crown or (historically) a unit of currency/coins in some regions.","zh":"在斯瓦希里语中，makuta可指“王冠”，也可（历史上）指某些地区的货币单位/硬币。"},"examples":[{"en":"The story mentions a chief’s makuta as a symbol of leadership.","zh":"故事中提到酋长的makuta，作为领导地位的象征。"},{"en":"Older texts may use makuta when talking about coins or money.","zh":"较早的文本里可能用makuta来谈论硬币或钱。"}]}],"synonyms":["crown","diadem","headdress"],"phonetic":"/məˈkuːtə/","extraExplanation":["“Makuta”常见于梵语转写makuṭa（मकुट），基本义为“冠、冕、宝冠”。在印度教、佛教与东南亚相关艺术（雕像、壁画、寺庙浮雕）中，经常用来描述神祇或君王所戴的华丽冠饰。","如果你是在特定文本或地区语境里看到makuta（例如斯瓦希里语材料、历史钱币资料、或宗教艺术说明），含义会因语境而略有不同；最稳妥的理解通常是“王冠/冠饰”。"]}
{"word":"makutas","summary":{"en":"“Makutas” is not a common English word; it’s most often Tagalog for “to come undone/loosen,” or a fan plural-like form of the BIONICLE name “Makuta.”","zh":"“Makutas”不是常见英语词；多见于他加禄语中表示“松开/散开”，或在 BIONICLE 粉丝语境里作为 Makuta 的类复数用法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Tagalog) to become untied or loosened; to come undone (often used for knots, strings, shoelaces, etc.).","zh":"（他加禄语）变松、解开；（结、绳子、鞋带等）松脱、散开。"},"examples":[{"en":"My shoelaces keep coming undone—I need to tie them tighter.","zh":"我的鞋带一直松脱——我得绑紧一点。"},{"en":"The knot loosened and came undone in the rain.","zh":"那个结在雨里变松，后来就散开了。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun, pop culture) “Makutas” is sometimes used as a plural-like form of Makuta, a name from the BIONICLE universe (referring to members of the Brotherhood of Makuta).","zh":"（专有名词，流行文化）“Makutas”有时被当作 Makuta 的复数样式，用于 BIONICLE（生化战士）世界观中，指“Makuta 兄弟会”的成员。"},"examples":[{"en":"In fan discussions, people sometimes talk about the Makutas as a group.","zh":"在粉丝讨论里，人们有时会把 Makutas 当作一个群体来谈。"}]}],"synonyms":["come undone","loosen","untie"],"phonetic":"/məˈkuːtɑːs/","extraExplanation":["“makutas”不是常见英语词，更常见于他加禄语（Tagalog）语境，表示“松开/解开”。如果你是在英语语境里看到它，另一个常见来源是 BIONICLE 的设定名“Makuta”，而“Makutas”常见于粉丝用法（类似复数），但并非严格标准英语复数。","如果你能提供一句你看到“makutas”的原句（或说明来自哪里：歌词/小说/游戏/对话），我可以更准确判断它属于哪一种用法。"]}
{"word":"makutu","summary":{"en":"Makutu means Māori witchcraft or a harmful curse (NZ usage).","zh":"Makutu 指毛利语语境中的“巫术/恶咒”，在新西兰英语中常用来表示带来伤害的诅咒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(New Zealand English, from Māori) witchcraft; a curse or harmful spell believed to cause illness, bad luck, or misfortune.","zh":"（新西兰英语，源自毛利语）巫术；诅咒/恶咒（被认为会带来疾病、厄运或不幸的法术）。"},"examples":[{"en":"Some people in the story believed the sickness was caused by makutu.","zh":"故事里有些人认为这种病是被下了makutu（诅咒）造成的。"},{"en":"He asked an elder for help to lift the makutu.","zh":"他请一位长者帮忙解除makutu（恶咒）。"}]}],"synonyms":["curse","witchcraft","hex","spell"],"phonetic":"/məˈkuːtuː/","extraExplanation":["“Makutu”是毛利文化语境中的词，常出现在新西兰相关的历史、民俗或文学作品里。它通常不仅仅指“魔法”，而更强调一种可能带来伤害的“诅咒/恶咒”观念。使用时要注意文化敏感性：在现实交流中，最好把它当作特定文化背景下的信念与叙事元素来理解与表达。"]}

