{"word":"Mam","summary":{"en":"“Mam” usually means “mother” (UK/Irish informal) or a polite way to address a woman (like “ma’am”).","zh":"“Mam”常指“妈妈”（英式/爱尔兰口语），也可作对女性的礼貌称呼（类似“ma’am/女士”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly UK/Irish, informal) Mother; mom.","zh":"（主要用于英式/爱尔兰口语，非正式）妈妈；母亲。"},"examples":[{"en":"I’ll call my mam after class.","zh":"我下课后会给我妈妈打电话。"},{"en":"His mam makes the best soup.","zh":"他妈妈做的汤最好喝。"}]},{"partOfSpeech":"n.","definition":{"en":"(chiefly UK/India, polite) A respectful form of address to a woman, similar to “ma’am.”","zh":"（主要用于英国/印度等地，礼貌用语）对女性的尊称，类似“ma’am / 女士”。"},"examples":[{"en":"Excuse me, mam, you dropped your card.","zh":"打扰一下，女士，您掉了卡。"},{"en":"Yes, mam. I understand.","zh":"好的，女士。我明白了。"}]}],"synonyms":["mom","mum","mother","ma’am"],"phonetic":"/mæm/","extraExplanation":["“mam”在很多地方口语里就是“mum/mom（妈妈）”的变体拼写，常见于英国北部、苏格兰、威尔士和爱尔兰等地区。","表示尊称时，“mam”有时是“ma’am”的简写/变体；在美国更常写作并使用“ma’am”。注意不同地区对这种称呼的接受度不一样：在某些地区很礼貌，在另一些场合可能显得过于正式或带有距离感。"]}
{"word":"mam","summary":{"en":"“mam” most commonly means “mother” in informal British/Irish English; it can also be a polite way to address a woman, though “ma’am” is the usual spelling.","zh":"“mam”最常见义为英式/爱尔兰口语中的“妈妈”；也可作对女性的礼貌称呼，但更常见的拼写是“ma’am”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly British & Irish) mother; mom.","zh":"（非正式，主要用于英式/爱尔兰英语）妈妈；母亲。"},"examples":[{"en":"I’ll call my mam after work.","zh":"我下班后会给我妈打电话。"},{"en":"His mam makes the best soup.","zh":"他妈妈做的汤最好喝。"}]},{"partOfSpeech":"n.","definition":{"en":"a polite form of address for a woman (similar to “ma’am” in some contexts).","zh":"对女性的礼貌称呼（在某些语境中类似“ma’am/女士”）。"},"examples":[{"en":"Excuse me, mam—could you help me?","zh":"打扰一下，女士——您能帮我一下吗？"},{"en":"Yes, mam. I understand.","zh":"好的，女士。我明白了。"}]}],"synonyms":["mom","mother","mum","ma’am"],"phonetic":"/mæm/","extraExplanation":["“mam”表示“妈妈”时，常见于英国北部、苏格兰和爱尔兰等地区（如Newcastle、Manchester一带）；在美国更常用“mom”。","表示对女性的称呼时，“mam”容易和更常见的拼写“ma’am”（= madam 的缩写）混淆；写作正式英语时通常建议用“ma’am”。"]}
{"word":"mama","summary":{"en":"“Mama” is an affectionate, informal word for “mother,” often used by children or to express warmth.","zh":"“mama”是“mother”的亲昵称呼，常用于孩子称呼或表达亲密与温暖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mother, especially used by a child; also a warm, affectionate way to address or refer to one’s mother.","zh":"妈妈；母亲（常为孩子用语，也可作亲昵的称呼）"},"examples":[{"en":"Mama, can you help me with my homework?","zh":"妈妈，你能帮我写作业吗？"},{"en":"I miss my mama when I’m away at school.","zh":"我在外地上学时会想妈妈。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman who plays a motherly role (for example, in a family or community), even if she is not the biological mother.","zh":"像母亲一样照顾人的女性；母亲般的人（不一定是亲生母亲）"},"examples":[{"en":"My aunt was like a mama to me after my parents divorced.","zh":"父母离婚后，姑妈就像我的妈妈一样照顾我。"},{"en":"In the neighborhood, everyone knew her as the mama who looked out for the kids.","zh":"在社区里，大家都知道她是那个照看孩子们的“妈妈”。"}]},{"partOfSpeech":"n.","definition":{"en":"A female animal, especially when speaking to children or in informal contexts.","zh":"（尤指对孩子说或在非正式场合）动物的妈妈；雌性亲兽"},"examples":[{"en":"Look, the baby duck is following its mama.","zh":"看，小鸭子在跟着它的妈妈。"},{"en":"The kitten stayed close to its mama.","zh":"小猫一直贴着它的妈妈。"}]}],"synonyms":["mom","mommy","mother","mum","mamma"],"phonetic":"/ˈmɑːmə/","extraExplanation":["“mama”是非常口语、亲密的称呼，常见变体还有“mom/mommy/mum/mamma”。在美式英语里更常写作“mama”或“mom/mommy”。","在一些语境里，“mama”也会出现在文化作品与称呼中（如歌曲、影视台词），表达亲情、思念或依赖感，语气通常比“mother”更亲近。"]}
{"word":"mamaguy","summary":{"en":"“Mamaguy” is a nonstandard informal term meaning a man who depends on his mother too much, similar to “mama’s boy.”","zh":"“mamaguy”是非标准的口语/网络说法，指过度依赖母亲的男生，类似“mama’s boy（妈宝男/妈妈男孩）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard) A man who is strongly attached to his mother, or who relies on her too much; similar to “mama’s boy.”","zh":"（非正式、非标准用法）很黏妈妈/过度依赖母亲的男生；类似“妈宝男/妈妈男孩”（mama’s boy）。"},"examples":[{"en":"People online called him a “mamaguy” because his mom still makes all his appointments.","zh":"网友叫他“mamaguy”，因为他妈妈还在替他安排所有预约。"},{"en":"Don’t label him a mamaguy just because he respects his mother.","zh":"不要只因为他尊重妈妈就给他贴“mamaguy”的标签。"}]}],"synonyms":["mama’s boy","momma’s boy","mother’s boy","dependent son"],"phonetic":"ˈmɑmə ɡaɪ","extraExplanation":["“mamaguy”不是常见的标准英语单词，更像是网络自造词/用户名，通常带有调侃甚至贬义。正式场合更常用“mama’s boy”。","中文里常见对应是“妈宝男”（语气较负面）；如果想更中性，可以说“very close to his mother（和妈妈很亲）”或“dependent on his mother（依赖妈妈）”。"]}
{"word":"mamaliga","summary":{"en":"Mamaliga is a Romanian/Moldovan cornmeal dish, similar to polenta.","zh":"Mamaliga（玉米粥）是罗马尼亚/摩尔多瓦的传统玉米面食品，类似polenta。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Romanian and Moldovan dish made from boiled cornmeal, similar to polenta; often served as a side dish or as a base for other foods (cheese, sour cream, stews).","zh":"一种罗马尼亚和摩尔多瓦的传统玉米粥（用玉米面煮成），类似意大利玉米糊（polenta）；常作为配菜或搭配奶酪、酸奶油、炖菜等食用。"},"examples":[{"en":"We ate mamaliga with cheese and sour cream for dinner.","zh":"我们晚餐吃了玉米粥，配奶酪和酸奶油。"},{"en":"In some Romanian villages, mamaliga is served instead of bread.","zh":"在一些罗马尼亚村庄里，玉米粥会用来代替面包。"},{"en":"The stew tastes even better when you spoon it over warm mamaliga.","zh":"把炖菜浇在热乎乎的玉米粥上会更好吃。"}]}],"synonyms":["polenta","cornmeal porridge"],"phonetic":"/ˌmɑməˈliɡə/","extraExplanation":["“mămăligă”是罗马尼亚语词（常见拼写也写作mamaliga，不带变音符号）。它在当地饮食文化中很重要，既可以做得很软像粥，也可以做得更硬、切片食用。","在英语语境里，它通常被解释为“Romanian polenta”，因为最容易类比的食物是意大利的polenta，但两者在做法与搭配上可能各有地方特色。"]}
{"word":"mamaloi","summary":{"en":"“Mamaloi” is not a standard English word; it’s likely a name/handle or a misspelling, so meaning depends on context.","zh":"“mamaloi”不是标准英语词；更可能是名字/网名或拼写错误，含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare term in English; it is most often seen as a name/handle or a misspelling, so its meaning depends on context.","zh":"不是常见的英语词；更常见于人名/网名或拼写错误，因此具体含义取决于语境。"},"examples":[{"en":"I couldn’t find a dictionary meaning for “mamaloi”; can you share the sentence where you saw it?","zh":"我在词典里找不到“mamaloi”的标准释义；你能把它出现的句子发我吗？"},{"en":"“Mamaloi” looks like a username rather than an English vocabulary word.","zh":"“Mamaloi”看起来更像用户名，而不是标准英语词汇。"}]}],"phonetic":"/ˌmæməˈlɔɪ/","extraExplanation":["“mamaloi”不属于常见英语词条（在主流英英词典中通常查不到）。它可能是：1）人名/昵称/品牌名；2）外来语音译；3）把某个词拼错了（例如把两个词连写、或把类似发音的词写错）。","如果你告诉我它出现的地区/平台（比如TikTok、游戏、某个国家的口语）或提供完整句子，我可以更准确判断它可能想表达的意思，并给出合适的英文替代词。"]}
{"word":"mamamouchi","summary":{"en":"“mamamouchi” isn’t recognized as an English vocabulary word; it’s likely a name/handle or a romanized foreign-language term.","zh":"“mamamouchi”不是英语词汇；更可能是名字/网名或外语词的罗马字拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most likely appears as a romanized (Latin-letter) spelling of a name, username, or a word from another language (often Japanese/Okinawan in online contexts). Meaning depends on where you saw it.","zh":"不是标准英语词。它更可能是人名、用户名，或其他语言（网上常见为日语/冲绳方言等）的罗马字拼写。具体含义取决于你看到它的语境。"},"examples":[{"en":"I couldn’t find a clear English dictionary meaning for “mamamouchi”; it may be a name or a handle.","zh":"我在英语词典里找不到“mamamouchi”的明确释义；它可能是名字或网名。"},{"en":"Can you share the sentence or the website where you saw “mamamouchi”?","zh":"你能把你看到“mamamouchi”的句子或网站发我吗？"}]}],"phonetic":"/ˌmɑːməˈmuːtʃi/","extraExplanation":["如果你告诉我它出现的语境（例如一整句话、游戏/动漫作品名、社交平台、或它是不是人名），我可以更准确判断它可能对应的原词（比如日语假名写法）、含义，以及更自然的英文表达方式。","从拼写看，它可能被分成 mama + mouchi / mochi（“麻糬”在英文常写作 mochi）。但目前没有足够信息确认是不是相关词或只是用户名。"]}
{"word":"mamamu","summary":{"en":"Not a standard English word; likely a misspelling (e.g., “mama”) or a name (e.g., “MAMAMOO”).","zh":"不是标准英语单词；多半是拼写错误（如“mama”）或专有名称（如“MAMAMOO”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“mamamu” is not a standard English word. It is most likely (1) a misspelling of “mama/momma/mamma,” or (2) a name/handle (for example, a group name like “MAMAMOO,” often misspelled).","zh":"“mamamu”不是标准英语单词。它很可能是：(1) “mama / momma / mamma（妈妈）”的拼写错误；或(2) 一个名字/网名（例如韩国组合名“MAMAMOO”，常被拼错）。"},"examples":[{"en":"Did you mean “mama” (mom) when you wrote “mamamu”?","zh":"你写“mamamu”是不是想写“mama（妈妈）”？"},{"en":"“MAMAMOO” is a K-pop group name, not an English vocabulary word.","zh":"“MAMAMOO”是一个韩流组合名，不是英语词汇。"}]}],"phonetic":"/ˈmɑmɑmu/","extraExplanation":["如果你是在聊天里看到“mamamu”，它可能是某种语言（如他加禄语、印尼语等）里的词，或是昵称/梗。告诉我它出现的句子/场景（例如整句话、你在哪个平台看到的），我可以更准确判断意思与用法。","如果你想表达“妈妈”，英语里更常见写法是：mom（最常用、美式口语）、mommy（小朋友用）、mama（较口语/亲昵称呼）、mother（更正式）。"]}
{"word":"mamas","summary":{"en":"“Mamas” usually means “mothers” (plural of mama) and can also be a warm, informal form of address.","zh":"“mamas”通常指“妈妈们”（mama 的复数），也可作为亲切、非正式的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “mama”: mothers; also used as a friendly or informal way to address women, especially mothers, in some communities","zh":"“mama”的复数：妈妈们；也可作亲切、非正式的称呼，在一些社群中用来称呼女性（尤其是母亲）"},"examples":[{"en":"All the mamas waited outside the school after class.","zh":"所有妈妈们都在放学后在学校外面等着。"},{"en":"The kids ran to their mamas when the music started.","zh":"音乐一响，孩子们就跑向自己的妈妈们。"},{"en":"Hey, mamas—thanks for coming today!","zh":"嗨，各位妈妈——谢谢你们今天来！"}]}],"synonyms":["mothers","moms","mums"],"phonetic":"/ˈmɑməz/","extraExplanation":["“mamas”在口语里常见于轻松、亲昵的场合；有时也带有社区/文化语气（例如把一群妈妈亲切地叫作“mamas”）。在正式写作中通常用“mothers”。","如果你想表达西班牙语里的“mamás”（重音在第二个音节），英语文本中有时也会保留重音符号写作“mamás”。"]}
{"word":"mamba","summary":{"en":"Mamba usually means a very venomous African snake; in sports/pop culture it can also refer to Kobe Bryant’s “Black Mamba” nickname and related gear.","zh":"mamba通常指一种非洲剧毒蛇；在体育/流行文化语境中也可指科比的“黑曼巴”绰号及相关装备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A kind of very venomous snake found mainly in sub-Saharan Africa (such as the black mamba or green mamba).","zh":"（主要分布于撒哈拉以南非洲的）一种剧毒蛇类，如黑曼巴蛇、绿曼巴蛇。"},"examples":[{"en":"The black mamba is one of the most feared snakes in Africa because its venom acts quickly.","zh":"黑曼巴蛇因毒性起效快，被认为是非洲最令人畏惧的蛇之一。"},{"en":"In the documentary, a mamba moved silently through the grass.","zh":"在纪录片里，一条曼巴蛇悄无声息地穿过草丛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Commonly) A nickname connected with Kobe Bryant (“Black Mamba”), meaning a fierce, focused competitor.","zh":"（常用）与科比·布莱恩特相关的昵称“Black Mamba（黑曼巴）”，指凶猛、专注、好胜的竞争者形象。"},"examples":[{"en":"Fans called Kobe Bryant “Black Mamba” because of his intense, attacking style.","zh":"球迷称科比·布莱恩特为“黑曼巴”，因为他强悍、极具侵略性的球风。"},{"en":"He said he was in ‘Mamba mode’ when he needed to focus and push himself.","zh":"他说在需要专注并逼自己一把时，他会进入“曼巴模式”。"}]},{"partOfSpeech":"n.","definition":{"en":"A well-known line of athletic shoes and sports gear associated with Kobe Bryant (often written “Mamba”).","zh":"与科比·布莱恩特相关、广为人知的一系列运动鞋与运动装备（常写作“Mamba”）。"},"examples":[{"en":"She bought a pair of Mamba shoes to wear on the court.","zh":"她买了一双曼巴系列的球鞋在球场上穿。"}]}],"synonyms":["black mamba","green mamba","venomous snake","(nickname) Black Mamba"],"phonetic":"/ˈmɑːmbə/","extraExplanation":["“mamba”一词最早来自班图语系中的一些语言（具体来源说法不一），英语里用来指一类非洲树栖、行动敏捷的毒蛇。","流行文化里，“Black Mamba/黑曼巴”因科比而广为人知；他用这个绰号强调自己在比赛中的冷静、致命与专注。","日常使用中需注意语境：在自然科普里几乎一定指蛇；在体育语境里多指科比的昵称或相关鞋款/精神。"]}
{"word":"mambas","summary":{"en":"Mambas are venomous African snakes (plural of mamba). In informal use, “mambas” can also mean people/teams nicknamed “Mamba,” suggesting speed and fierce skill.","zh":"mambas 是 mamba（曼巴蛇）的复数，指毒性很强的非洲曼巴蛇；在非正式语境中也可指被称为“Mamba”的人/团队，含“迅猛、强悍、技术出众”之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, fast, highly venomous African snake (a type of cobra), such as the black mamba or green mamba","zh":"（非洲的）曼巴蛇；一种体型较大、行动迅速、毒性很强的蛇（如黑曼巴、绿曼巴）"},"examples":[{"en":"The black mamba is one of the most feared snakes in Africa because of its powerful venom.","zh":"黑曼巴因毒性强而被认为是非洲最令人畏惧的蛇之一。"},{"en":"Researchers tracked mambas to learn how they move and hunt.","zh":"研究人员追踪曼巴蛇，以了解它们如何移动和捕猎。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, in sports and pop culture) people or things nicknamed “Mamba,” often implying speed, skill, or a fierce style; plural form of mamba","zh":"（非正式，体育/流行文化）被称作“曼巴”的人或事物，常带有“速度快、技术强、风格凶猛”的含义；mamba 的复数"},"examples":[{"en":"Fans called him a “mamba” for his quick, aggressive play style.","zh":"球迷称他为“曼巴”，因为他的打法快速而强硬。"},{"en":"They wore shirts that said “Mambas” to show support.","zh":"他们穿着印有“Mambas”的衣服来表示支持。"}]}],"synonyms":["black mamba","green mamba","venomous snake","cobra (related group)"],"phonetic":"/ˈmæmbə/","extraExplanation":["“mamba”一词常见于英语新闻与自然纪录片，最常指“black mamba（黑曼巴）”“green mamba（绿曼巴）”。它们以速度快、攻击性强而著名，因此“mamba”在比喻用法里也容易引申为“迅猛、凌厉”。","在美国流行文化里，“Black Mamba（黑曼巴）”也与篮球巨星科比·布莱恩特（Kobe Bryant）的绰号相关；他用“曼巴精神（Mamba Mentality）”强调专注、刻苦与竞争心。"]}
{"word":"mambo","summary":{"en":"Mambo is a lively Latin dance and its music; it can also mean to dance that style.","zh":"mambo 指曼波舞及其音乐，也可作动词表示“跳曼波”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Latin dance and the music for it, usually with strong rhythm and syncopation (often associated with Cuba and later popularized internationally)","zh":"曼波舞；曼波音乐（节奏强烈、常有切分节奏，常与古巴渊源相关，后来风靡国际）"},"examples":[{"en":"They learned the mambo in a beginner dance class.","zh":"他们在初级舞蹈课上学了曼波。"},{"en":"The band switched from salsa to mambo, and the room lit up.","zh":"乐队从萨尔萨切换到曼波，现场气氛一下子热了起来。"}]},{"partOfSpeech":"v.","definition":{"en":"to dance the mambo","zh":"跳曼波舞"},"examples":[{"en":"We mamboed for a few songs at the party.","zh":"在派对上我们跳了几首歌的曼波。"}]}],"synonyms":["Latin dance","dance music"],"phonetic":"/ˈmɑmboʊ/","extraExplanation":["“Mambo”一词常被认为来自海地克里奥尔语/非洲语言影响的宗教语境（也有人把它与巫毒教中的称谓联系起来），后来在古巴音乐与舞蹈发展中成为一种风格名称。","在音乐文化上，曼波与“salsa（萨尔萨）”“cha-cha-cha（恰恰）”关系密切：很多人会把它们当作同一拉丁舞/拉丁音乐家族中的不同分支。","文学与流行文化中常见的提及包括歌曲名与乐队编制，例如《Mambo No. 5》让这个词在英语世界更家喻户晓。"]}
{"word":"mamboed","summary":{"en":"“Mamboed” means “danced the mambo,” and it can also jokingly mean “moved around energetically like dancing.”","zh":"“mamboed”表示“跳了曼波舞”，也可幽默地指“像跳舞一样兴奋地扭动/摆动”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) danced the mambo; moved to Latin dance rhythms in a lively way.","zh":"（过去式/过去分词）跳了曼波舞；随着拉丁舞节奏活力地舞动。"},"examples":[{"en":"They mamboed across the floor when the band started playing.","zh":"乐队一开始演奏，他们就跳着曼波舞穿过舞池。"},{"en":"At the party, we mamboed to the music and laughed all night.","zh":"在派对上，我们随着音乐跳曼波舞，笑了一整晚。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, humorous) moved or swayed energetically, as if dancing the mambo.","zh":"（非正式/幽默）像跳曼波舞一样兴奋地摆动或扭动。"},"examples":[{"en":"The toddler mamboed in his seat when he heard his favorite song.","zh":"小孩听到最喜欢的歌时，在座位上扭来扭去。"},{"en":"She mamboed down the hallway, celebrating her good news.","zh":"她在走廊里兴奋地扭着走，庆祝好消息。"}]}],"synonyms":["danced","grooved","swayed","shimmied"],"phonetic":"/ˈmɑmboʊd/","extraExplanation":["“mambo”最早指一种源自古巴的音乐与舞蹈风格，后来在1940–50年代在美国（尤其是纽约）流行起来；常与大乐队（big band）与拉丁爵士联系在一起。","拼写上，“mamboed”= mambo + -ed；口语中也可能听到更快的连读。"]}
{"word":"mamboes","summary":{"en":"Mambo usually means a lively Cuban-rooted Latin dance and its music; it can also mean a Haitian Vodou priestess. “Mamboes” is a less common plural spelling of “mambo.”","zh":"Mambo 通常指源自古巴的热烈拉丁舞及其音乐；也可指海地巫毒教的女祭司。“mamboes”是“mambo”较少见的复数拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Latin dance (and the music for it), originally from Cuba and strongly influenced by Afro-Cuban rhythms","zh":"曼波舞；曼波音乐（源自古巴、受非裔古巴节奏影响的热烈拉丁舞与其音乐）"},"examples":[{"en":"They learned the mambo in a beginner dance class.","zh":"他们在初级舞蹈课上学了曼波舞。"},{"en":"This band plays classic mambo with strong horns and percussion.","zh":"这支乐队演奏经典曼波音乐，铜管和打击乐很突出。"}]},{"partOfSpeech":"n.","definition":{"en":"a Vodou priestess in Haitian Vodou","zh":"（海地巫毒教中的）女祭司／女巫师"},"examples":[{"en":"In Haitian Vodou, a mambo may lead ceremonies and community rituals.","zh":"在海地巫毒教中，mambo 可能主持仪式与社群祭典。"}]},{"partOfSpeech":"v.","definition":{"en":"to dance the mambo","zh":"跳曼波舞"},"examples":[{"en":"We mamboed for a few songs at the club.","zh":"我们在俱乐部里跳了几首歌的曼波舞。"}]}],"synonyms":["Latin dance","dance music"],"phonetic":"/ˈmɑmboʊ/","extraExplanation":["你写的 **mamboes** 多半是 **mambos**（mambo 的复数）的另一种拼写。英语里以 -o 结尾的外来词，有时复数会写作 **-oes**（更像传统规则），但现代常见写法多为 **mambos**。","“mambo”在英语中既指舞与音乐，也可指海地巫毒教（Haitian Vodou）中的女祭司。这两个意思来自不同文化背景，使用时注意语境。"]}
{"word":"mamboing","summary":{"en":"Mamboing means dancing the mambo or moving rhythmically in a mambo-like way.","zh":"Mamboing 指跳曼波舞，或以曼波风格有节奏地摆动身体。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"dancing the mambo (a lively Latin dance), or moving to music in a mambo style.","zh":"跳曼波舞（mambo，一种活泼的拉丁舞）；或以曼波的风格随音乐摆动。"},"examples":[{"en":"Everyone was mamboing on the dance floor after the band started playing.","zh":"乐队一开始演奏，大家就在舞池里跳起了曼波。"},{"en":"He was mamboing to the beat like he’d practiced for weeks.","zh":"他跟着节拍跳曼波，像是练了好几个星期一样。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, playful) moving your body in a lively, rhythmic way, not necessarily doing the exact mambo steps.","zh":"（非正式/俏皮）跟着音乐热烈、有节奏地扭动身体，不一定是标准的曼波舞步。"},"examples":[{"en":"The kids were just mamboing around in the living room.","zh":"孩子们就在客厅里跟着音乐乱扭乱跳。"},{"en":"Stop mamboing and help me carry these bags!","zh":"别光顾着扭来扭去，来帮我提一下这些袋子！"}]}],"synonyms":["dancing","grooving","swaying"],"phonetic":"/ˈmɑmboʊɪŋ/","extraExplanation":["“mamboing”来自动词“mambo”的现在分词/动名词形式。“mambo”既指舞蹈也指音乐风格，常与古巴音乐、拉丁爵士的文化背景相关。","曼波在20世纪中期在美国夜总会文化中很流行（尤其与纽约的拉丁音乐场景有关）。所以在英文里，用“mamboing”有时也带一点轻松、复古的氛围。"]}
{"word":"mambos","summary":{"en":"“Mambos” most commonly means multiple mambo dances or pieces of mambo music (plural of “mambo”).","zh":"“Mambos”最常见意思是“mambo”的复数：多支曼波音乐或多种曼波舞（曼波舞步/套路）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mambo: a lively Latin dance and the music style used for it, originally from Cuba","zh":"mambo 的复数：一种热烈的拉丁舞（曼波舞）及其对应的音乐风格，起源于古巴"},"examples":[{"en":"They danced mambos all night at the salsa club.","zh":"他们在萨尔萨俱乐部跳了一整晚的曼波舞。"},{"en":"The band played classic mambos with strong brass and percussion.","zh":"乐队演奏了经典的曼波曲目，铜管和打击乐很有力量。"}]},{"partOfSpeech":"n.","definition":{"en":"informal: different mambo songs or dance routines (styles/versions)","zh":"（非正式）不同的曼波歌曲或舞步编排（不同版本/套路）"},"examples":[{"en":"The DJ mixed old-school mambos with modern Latin pop.","zh":"DJ 把老派曼波和现代拉丁流行混在一起播放。"},{"en":"In class, we learned two mambos with different turns.","zh":"课上我们学了两套曼波舞步，转身动作不同。"}]},{"partOfSpeech":"v.","definition":{"en":"plural of mambo (verb): dances in the mambo style","zh":"mambo（动词）的第三人称单数为 mambos；若理解为复数语境，可指“跳曼波舞”这一动作（以曼波风格起舞）"},"examples":[{"en":"He mambos confidently even when the tempo speeds up.","zh":"即使速度加快，他也能自信地跳曼波。"}]}],"synonyms":["mambo dances","Latin dances","Afro-Cuban music","mambo numbers"],"phonetic":"/ˈmɑmboʊ/","extraExplanation":["“Mambo”常被视为古巴的非裔古巴音乐传统（如 danzón、son）与大乐队（big band）编制结合后发展出的风格；20世纪中期在美国（尤其是纽约）也非常流行。提到“mambo”，很多人会联想到以强烈铜管与打击乐著称的作品，以及舞池文化。"]}
{"word":"mambu","summary":{"en":"“Mambu” is not standard English; it’s a loanword meaning “things/matters,” used mainly in Central/East African language contexts (especially Lingala).","zh":"“Mambu”不是标准英语词；它多作为外来词使用，意思是“事情/事务”，常见于中东非语言语境（尤其林加拉语）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Loanword; mainly used in Central/East African contexts) “things; matters; affairs.” Often appears in phrases in Lingala (DR Congo) or as a variant spelling influenced by Swahili “mambo.”","zh":"（外来词；多见于中东非语境）“事情；事儿；事务；情况”。常见于刚果（金）等地的林加拉语（Lingala）表达中，也可能是受斯瓦希里语“mambo”影响的变体拼写。"},"examples":[{"en":"In Lingala, “mambu” can mean “things” or “issues.”","zh":"在林加拉语里，“mambu”可以表示“事情”或“问题”。"},{"en":"They were talking about family mambu—money, work, and health.","zh":"他们在聊家里的事儿——钱、工作和健康。"}]}],"synonyms":["things","matters","issues","affairs","business"],"phonetic":"/ˈmɑm.bu/","extraExplanation":["“mambu”不是标准英语词汇，因此在英语词典里通常查不到。你更可能在非洲音乐、社交媒体、移民社区英语、或双语对话中看到它，用来保留原语言的语感。","如果你的目标是英语表达，最常用的对应词是：things / matters / issues / business（语气更正式或更像“公事”）。","你输入的“mambu”也可能是对斯瓦希里语“mambo”的不同拼写；在斯瓦希里语里“mambo”常指“事情/消息”，也常用作问候语的一部分（如询问近况）。"]}
{"word":"mameliere","summary":{"en":"“Mameliere” is not standard English; it likely refers to “mammary” or “mammal”-related terms.","zh":"“mameliere”不是标准英语；很可能指“mammary（乳房/乳腺的）”或与“mammal（哺乳动物）”相关的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word. It is most likely a misspelling or a borrowing from French (mamelière / mameliare), related to “mammary” (breast) or “mammal.”","zh":"不是现代标准英语单词。很可能是拼写错误，或源自法语（mamelière / mameliare）的外来词，与“乳房的（mammary）”或“哺乳动物（mammal）”相关。"},"examples":[{"en":"I couldn’t find “mameliere” in English dictionaries; did you mean “mammary”?","zh":"我在英语词典里找不到“mameliere”；你是不是想写“mammary（乳房的）”？"},{"en":"In biology, we usually say “mammary glands,” not “mameliere.”","zh":"在生物学里我们通常说“mammary glands（乳腺）”，而不是“mameliere”。"}]}],"synonyms":["mammary","mammalian"],"phonetic":"/ˈmæməri/","extraExplanation":["“mameliere”看起来更像法语/意大利语拼写，词根常与拉丁语 mamma（乳房）有关。英语里对应的常用词是 mammary（乳房的、乳腺的）、mammal（哺乳动物）、mammalian（哺乳动物的）。","如果你是在读文学、历史或解剖学旧文献，可能会遇到这种非标准拼写或外来词形式；但在现代英语写作中通常不用。"]}
{"word":"mamelon","summary":{"en":"Mamelon most commonly means a small rounded, nipple-like bump; in dentistry it refers to the small lobes on the edge of new incisors.","zh":"mamelon 常指乳头状的小圆突起；在牙科中指新萌出门牙切缘上的小结节（切缘结节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small rounded bump or projection, especially one shaped like a nipple","zh":"小而圆的突起；（尤指）乳头状的突起"},"examples":[{"en":"The sculptor added tiny mamelons to give the surface a more natural texture.","zh":"雕塑家加了一些小乳头状突起，让表面纹理更自然。"},{"en":"Some anatomical descriptions use the word “mamelon” for a nipple-like prominence.","zh":"一些解剖学描述会用“mamelon”指乳头状的隆起。"}]},{"partOfSpeech":"n.","definition":{"en":"one of the small rounded lobes (cusps) sometimes seen on the cutting edge of a newly erupted incisor tooth","zh":"（牙）新萌出的门牙切缘上有时可见的圆形小结节（切缘结节）"},"examples":[{"en":"Children’s new incisors may show mamelons that wear down over time.","zh":"儿童新长出的门牙可能会有切缘结节，随着时间会被磨平。"},{"en":"The dentist said the mamelons were normal and not a sign of damage.","zh":"牙医说这些切缘结节很正常，不是受损的迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"a rounded mound or breast-shaped hill used in military fortification (historical usage)","zh":"（史）用于防御工事的圆丘／乳房状土墩"},"examples":[{"en":"The old fortress plans mention a mamelon guarding the approach to the gate.","zh":"老堡垒的设计图提到有一处圆丘用来守卫通往城门的道路。"}]}],"synonyms":["protuberance","bump","nodule","cusp"],"phonetic":"/ˈmæməˌlɑn/","extraExplanation":["“mamelon”来自法语 *mamelon*，与 *mamma*（乳房）同源，因此常带有“乳头/乳房状隆起”的形状联想。","在现代英语里，它最常见于牙科语境（门牙切缘的结节），其次见于解剖学或较文学化的“乳头状突起”描述；军事义项更偏历史用语。"]}
{"word":"mamelonation","summary":{"en":"A dental term for the bumps (mamelons) seen on the edges of newly erupted front teeth.","zh":"牙科用语：指新萌出前牙切缘上的小圆突（mamelons）出现/形成的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the presence or formation of small rounded bumps (mamelons) on the cutting edge of newly erupted front teeth, especially permanent incisors","zh":"（牙科）新萌出的前牙（尤其是恒切牙）切缘出现或形成小圆突（“切缘结节/乳突”，mamelons）的现象"},"examples":[{"en":"The dentist explained that mamelonation is common in newly erupted permanent incisors.","zh":"牙医解释说，新萌出的恒切牙出现 mamelonation 很常见。"},{"en":"As her bite wore the edges down, the mamelonation became less noticeable.","zh":"随着咬合磨耗把切缘磨平，这种 mamelonation 就不那么明显了。"}]}],"synonyms":["presence of mamelons","incisal mamelons (context)","mamelon formation"],"phonetic":"/ˌmæməˌloʊˈneɪʃən/","extraExplanation":["这个词比较少见，主要用于牙科语境。mamelon 指新萌出的切牙切缘上“像小波浪/小齿”的三个圆突；mamelonation 就是“出现这种圆突的状态/现象”。","很多人长大后看不到这些小圆突，是因为正常咀嚼会逐渐磨平；如果成年后仍很明显，有时提示上下前牙咬合接触较少（例如开合）。如有担心应咨询牙医。"]}
{"word":"mameluco","summary":{"en":"Mameluco can mean a mixed European–Indigenous person in colonial Brazil, or (in Spanish) a one-piece work garment like coveralls.","zh":"mameluco 可指殖民时期巴西的欧裔与原住民混血者；在西班牙语中也常指连体工作服（工装连体衣）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin America, esp. Brazil; historical) a person of mixed European (often Portuguese) and Indigenous ancestry.","zh":"（拉丁美洲，尤指巴西；历史用语）指具有欧洲（常为葡萄牙）与原住民混血血统的人。"},"examples":[{"en":"In colonial Brazil, mamelucos often served as intermediaries between Portuguese settlers and Indigenous communities.","zh":"在殖民时期的巴西，mamelucos 常常充当葡萄牙殖民者与原住民社群之间的沟通者。"},{"en":"The novel mentions mamelucos traveling inland with expeditions.","zh":"小说中提到 mamelucos 随远征队深入内陆。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, everyday use) a one-piece work garment; coveralls; sometimes a jumpsuit.","zh":"（西班牙语日常用法）连体工作服；工装裤；有时也指连体衣/连身裤。"},"examples":[{"en":"Ponte el mameluco antes de entrar al taller.","zh":"进车间前把连体工作服穿上。"},{"en":"The mechanic wore a blue mameluco to keep his clothes clean.","zh":"那位修理工穿着蓝色连体工作服，以免弄脏衣服。"}]}],"synonyms":["(Brazil, historical) mestizo","(Spanish) coveralls","jumpsuit","one-piece work suit"],"phonetic":"/ˌmɑːməˈluːkoʊ/","extraExplanation":["这个词在不同地区含义差异很大：在巴西语境中多为历史社会分类（与殖民、族群与内陆拓殖有关），在现代西班牙语口语里更常见的是“连体工作服/工装”。阅读或翻译时要看语言与地域。","巴西语境中的用法带有历史色彩，现代讨论族群身份时可能更倾向使用更中性、当事人更认可的称呼；使用时注意语境与敏感度。"]}
{"word":"mameluke","summary":{"en":"A mameluke is mainly (1) a historical Mamluk soldier/ruler in Egypt and Syria, and (2) a Mamluk-style ceremonial curved sword.","zh":"mameluke主要指（1）历史上的马穆鲁克武士/统治者，（2）马穆鲁克风格的礼仪弯刀/佩剑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a powerful military class (originally enslaved soldiers) that ruled Egypt and Syria in the Middle Ages and later periods","zh":"（历史）马穆鲁克：中世纪起在埃及与叙利亚掌权的一支强大武士阶层（最初多为被买来的奴隶兵）"},"examples":[{"en":"The novel is set in Cairo during the time of the Mamelukes.","zh":"这部小说以马穆鲁克统治时期的开罗为背景。"},{"en":"Historians study how Mameluke commanders gained political power.","zh":"历史学家研究马穆鲁克将领如何获得政治权力。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some English-speaking military traditions) a curved sword or a ceremonial sword associated with Mameluke style","zh":"（部分英语军事传统）马穆鲁克式弯刀；马穆鲁克风格的礼仪佩剑"},"examples":[{"en":"The officer wore a Mameluke-style sword in the ceremony.","zh":"军官在仪式上佩戴了马穆鲁克式礼仪佩剑。"},{"en":"The museum displays a Mameluke sword with an ivory hilt.","zh":"博物馆展出了一把象牙柄的马穆鲁克弯刀。"}]}],"synonyms":["Mamluk","Mameluke sword"],"phonetic":"/ˈmæməˌluːk/","extraExplanation":["“Mameluke”常见的历史对应词是“Mamluk/马穆鲁克”（更贴近阿拉伯语转写）。词源来自阿拉伯语 *mamlūk*，意为“被拥有的人/奴隶”，因为这些士兵最初多为被购买并训练的奴隶军人。","在英语语境里，“Mameluke sword”也常被提到：它与18—19世纪欧洲与北美的军礼服饰传统有关，例如美国海军陆战队军官礼仪佩剑的造型就受马穆鲁克弯刀风格影响。"]}
{"word":"mamelukes","summary":{"en":"Mamelukes can mean (1) the historical military ruling class of Egypt (Mamluks), or (2) loose trousers gathered at the knee in 19th‑century fashion.","zh":"mamelukes 可指（1）埃及历史上的马木留克军事统治阶层，也可指（2）19世纪流行的一种膝部收束的宽松长裤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a powerful military class in Egypt (and nearby regions) made up of enslaved or purchased soldiers who later ruled as leaders","zh":"（中东史）马木留克/马穆鲁克：埃及等地由奴隶出身的职业军人组成的强大军事阶层，后来也曾掌权统治"},"examples":[{"en":"The Mamelukes ruled Egypt for centuries before the Ottoman period.","zh":"马木留克在奥斯曼时期之前统治埃及长达数百年。"},{"en":"In the museum, we saw armor used by Mameluke soldiers.","zh":"在博物馆里，我们看到了马木留克士兵使用过的盔甲。"}]},{"partOfSpeech":"n.","definition":{"en":"loose, baggy trousers gathered at the knee, popular in some 19th-century Western fashions","zh":"（服装）马木留克裤：19世纪西方流行的一种宽松、在膝部收束的灯笼式长裤"},"examples":[{"en":"The costume included a tunic and mamelukes gathered below the knee.","zh":"这套戏服包括一件束腰外衣和一条在膝下收束的马木留克裤。"},{"en":"Victorian illustrations sometimes show children wearing mamelukes.","zh":"维多利亚时代的插画有时会画出孩子穿着马木留克裤。"}]}],"synonyms":["Mamluks","Mamelukes (variant spelling)","Mamluk cavalry (related)","breeches (clothing-related)"],"phonetic":"/ˈmæməˌluːk/","extraExplanation":["词源来自阿拉伯语 mamlūk，意为“被拥有的人/奴隶”。历史上的马木留克多从突厥、高加索等地被买来受训为精锐骑兵，后来在埃及建立了马木留克苏丹国（约1250–1517）。","英语里也常见拼写 Mamluk / Mameluke（大小写变化常暗示是历史阶层还是一般名词）。拿破仑时代的绘画与文学中偶尔会出现“马木留克骑兵”的形象，因此在西方文化中较为人熟知。","服装义源于“东方风格/土耳其风”在19世纪欧洲的流行：这种宽松裤装被联想为中东或奥斯曼风格，因而借用了同一名称。"]}
{"word":"mamercus","summary":{"en":"Mamercus is an ancient Roman male given name, mainly used when referring to historical Romans.","zh":"Mamercus 是古罗马男性名字，英语中多用于指代某位历史上的罗马人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name from ancient Rome (a Roman praenomen), used by a small number of Roman families; in English it usually refers to a specific historical person named Mamercus.","zh":"古罗马的男性名字（罗马人的“名”praenomen），使用范围较小；英语语境中多指某位名为 Mamercus 的历史人物。"},"examples":[{"en":"Mamercus Aemilius Mamercinus appears in Roman history as a member of the Aemilii family.","zh":"Mamercus Aemilius Mamercinus 在罗马史中以埃米利乌斯家族成员的身份出现。"},{"en":"In the text, Mamercus is mentioned as a Roman statesman from an early period.","zh":"在这篇文章里，Mamercus 被提到是一位早期的罗马政治人物。"}]}],"synonyms":["(no direct synonym; it is a proper name)"],"phonetic":"/məˈmɝːkəs/","extraExplanation":["“Mamercus”主要见于古罗马姓名体系。罗马人常用“三名法”：praenomen（名）+ nomen（氏族名）+ cognomen（支系/别名）。因此你常会看到更完整的形式，例如：Mamercus Aemilius Mamercinus。","英语里它通常被当作专有名词使用：首字母大写，不加冠词；需要复数时很少见，但可以写作 Mamerci（拉丁复数）或更常见的 Mamercuses（英语化复数）。"]}
{"word":"mamers","summary":{"en":"Mamers is an ancient Italic name for Mars, used mainly in classical and historical writing.","zh":"Mamers 是古意大利地区对战神 Mars（玛尔斯）的称呼，主要用于古典与历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mamers: an ancient Italic (especially Oscan/Samnite) name for the Roman god Mars, the god of war; used mainly in historical or classical contexts.","zh":"Mamers：古意大利语族（尤指奥斯坎语/萨姆奈特语）中对罗马战神“玛尔斯（Mars）”的称呼；主要见于历史或古典语境。"},"examples":[{"en":"In some Oscan inscriptions, Mamers appears as the local name for Mars.","zh":"在一些奥斯坎语铭文中，Mamers 作为战神 Mars 的当地称呼出现。"},{"en":"The author compares the Roman Mars with Mamers in early Italian religion.","zh":"作者在论述早期意大利宗教时，将罗马的 Mars 与 Mamers 作比较。"}]}],"synonyms":["Mars"],"phonetic":"/ˈmeɪmərz/","extraExplanation":["Mamers 常被认为与拉丁语 Mars 同源或密切相关，反映了罗马在统一意大利之前，各地对同一或相近神祇的不同称呼。","你输入的 “mamers” 也可能是拼写/输入错误：如果你本来想查的是 “manners（礼貌；举止）” 或 “mammals（哺乳动物）”，告诉我你想要的词，我可以改为对应词条。"]}
{"word":"mamertine","summary":{"en":"Mamertine refers to the ancient Mamertines of Sicily or, in common usage, to the “Mamertine Prison” in Rome.","zh":"Mamertine 指与西西里岛的古代马墨尔丁人有关，或更常见地指罗马的“马墨尔丁监狱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Mamertines (ancient Italian mercenaries who took control of Messana—modern Messina—in Sicily) or to things connected with them","zh":"与“马墨尔丁人”（古代意大利雇佣兵，曾占据西西里岛的墨萨那/今墨西拿）有关的；与其相关的"},"examples":[{"en":"The book describes the Mamertine occupation of Messana as a spark that helped draw Rome into Sicily.","zh":"这本书把马墨尔丁人占据墨萨那描写为把罗马卷入西西里事务的一点火星。"},{"en":"Coins from the city include Mamertine symbols used to assert their rule.","zh":"这座城市出土的硬币上有马墨尔丁人的标志，用来宣示他们的统治。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Mamertines","zh":"马墨尔丁人（指该群体的一名成员）"},"examples":[{"en":"According to the historian, a Mamertine asked for outside help when local conflicts escalated.","zh":"据史学家记载，当地冲突升级时，一名马墨尔丁人请求外部势力援助。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in the phrase “Mamertine Prison”) the ancient prison in Rome traditionally associated with the detention of important prisoners","zh":"（常见于短语“Mamertine Prison”）马墨尔丁监狱：罗马的一座古监狱，传统上与关押重要囚犯有关"},"examples":[{"en":"The tour included the Mamertine Prison, a site surrounded by Roman and Christian traditions.","zh":"行程包括马墨尔丁监狱，这是一个被罗马传统与基督教传说共同环绕的遗址。"},{"en":"In some accounts, the Mamertine Prison is linked to the imprisonment of early Christian leaders.","zh":"在一些说法中，马墨尔丁监狱与早期基督教领袖的囚禁有关。"}]}],"synonyms":["Mamertines (as a noun phrase)","Mamertine Prison (proper name)"],"phonetic":"/ˈmæmərˌtin/","extraExplanation":["“Mamertine”来自拉丁语 Mamertini，意为“玛尔斯（战神）之子/追随者”。马墨尔丁人原是坎帕尼亚（意大利南部）一带的雇佣兵，公元前3世纪占据墨萨那（Messana），其求援与冲突被认为与第一次布匿战争（罗马与迦太基）爆发的背景有关。","“Mamertine Prison”（意大利语常称 Carcere Mamertino，也常与“Tullianum”一并提及）在旅游与宗教语境中很常见；英语里单独用 mamertine 较少，更多作为专名的一部分出现。"]}
{"word":"mamey","summary":{"en":"Mamey is a tropical fruit (often mamey sapote) with brown skin and orange-red flesh, popular in Latin American and Caribbean foods.","zh":"mamey 指一种热带水果（常指 mamey sapote/马米果），外皮褐色、果肉橙红，在拉美与加勒比饮食中很常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical fruit with rough brown skin and soft orange-to-reddish flesh, commonly eaten fresh or used in smoothies and desserts (also called mamey sapote).","zh":"一种热带水果，外皮粗糙呈褐色，果肉柔软、橙红至红色，常直接食用或用于奶昔、甜点（也常称“mamey sapote / 马米果、红肉人心果”等）。"},"examples":[{"en":"In Puerto Rico, people often blend mamey with milk to make a sweet smoothie.","zh":"在波多黎各，人们常把 mamey 和牛奶一起打成甜甜的奶昔。"},{"en":"The mamey’s flesh is bright orange and tastes mildly sweet, like a mix of pumpkin and sweet potato.","zh":"mamey 的果肉呈亮橙色，味道微甜，有点像南瓜和红薯的混合。"},{"en":"She bought a ripe mamey at the Latin market for a fruit salad.","zh":"她在拉美超市买了一个熟透的 mamey，用来做水果沙拉。"}]}],"synonyms":["mamey sapote","sapote"],"phonetic":"/məˈmeɪ/","extraExplanation":["“Mamey”在不同地区可能指不同水果：在加勒比和墨西哥语境中，最常见是“mamey sapote”（Pouteria sapota，果肉橙红）；而在一些西语地区，“mamey”也可能指“mamey de Santo Domingo”（Mammea americana，常译“马梅苹果”，果肉偏黄、风味不同）。购买或点餐时若不确定，可以补一句“mamey sapote?”来确认。","在英语里它多出现在拉美/加勒比饮食文化相关的语境中，如冰淇淋（mamey ice cream）、奶昔（mamey shake）和果昔（mamey smoothie）。"]}
{"word":"mameyes","summary":{"en":"Mameyes is mainly a Puerto Rican place name; in some contexts it also refers to the well-known Mameyes landslide disaster.","zh":"Mameyes 主要是波多黎各的地名；在某些语境中也可指著名的“ Mameyes 山体滑坡”灾害。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name in Puerto Rico, used for several neighborhoods/areas called “Mameyes.”","zh":"（专有名词）波多黎各的地名，用于指称若干名为“Mameyes”的社区/地区。"},"examples":[{"en":"She grew up in Mameyes, Puerto Rico.","zh":"她在波多黎各的 Mameyes 长大。"},{"en":"Our hotel is near Mameyes, in the San Juan area.","zh":"我们的酒店在圣胡安一带的 Mameyes 附近。"}]},{"partOfSpeech":"other","definition":{"en":"(in news/history) shorthand for the “Mameyes landslide,” a deadly landslide disaster in Puerto Rico.","zh":"（新闻/历史语境）“Mameyes 山体滑坡”的简称，指波多黎各一次严重的致命滑坡灾害。"},"examples":[{"en":"The documentary revisits the Mameyes tragedy.","zh":"这部纪录片回顾了 Mameyes 的悲剧事件。"},{"en":"Survivors of Mameyes later pushed for stronger safety rules.","zh":"Mameyes 的幸存者后来推动制定更严格的安全规定。"}]}],"synonyms":["(place name) —","(disaster context) Mameyes landslide"],"phonetic":"/məˈmeɪ.jeɪz/","extraExplanation":["“Mameyes”常被当作西班牙语地名使用；不同城市/地区可能都有同名社区，所以在阅读新闻或地图时，最好结合“城市名/区域名”（如 San Juan、Ponce 等）一起确认具体指哪里。","在波多黎各语境中，“Mameyes”有时会让人联想到 1980 年代发生的一次重大滑坡灾害；如果你是在文章或纪录片里看到这个词，通常指的就是那次事件。"]}
{"word":"mameys","summary":{"en":"Mamey is a tropical fruit (and the tree that grows it), often referring to mamey sapote; “mameys” means more than one mamey.","zh":"mamey 指一种热带水果（也可指结这种果的树），英语里常指 mamey sapote；“mameys”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical fruit with soft orange or reddish flesh, common in the Caribbean and Central America (also called mamey sapote)","zh":"一种热带水果，果肉多为橙色或红橙色，常见于加勒比与中美洲（也常称为“红毛丹枣/人心果属的红肉品种”，英语常说 mamey sapote）"},"examples":[{"en":"I tried mamey for the first time in a smoothie, and it tasted sweet and creamy.","zh":"我第一次在奶昔里尝到 mamey，味道甜而且很绵密。"},{"en":"In some Latin American markets, you can buy frozen mamey pulp for desserts.","zh":"在一些拉美市场，你可以买到冷冻的 mamey 果泥用来做甜点。"}]},{"partOfSpeech":"n.","definition":{"en":"the tree that produces the mamey fruit","zh":"结 mamey 果的树"},"examples":[{"en":"The mamey tree grows best in warm, tropical climates.","zh":"mamey 树最适合在温暖的热带气候中生长。"}]}],"synonyms":["mamey sapote","sapote"],"phonetic":"/ˈmɑːmeɪ/","extraExplanation":["“mameys”通常是“mamey”的复数拼写（也有人写作“mameyes”）。在不同地区，“mamey”有时会指不同的水果；在英语里最常见的是“mamey sapote（红肉人心果）”。点餐或购物时，如果看到“mamey smoothie / mamey ice cream”，一般就是这种甜、口感像牛油果或红薯泥一样绵密的果肉。"]}
{"word":"mamie","summary":{"en":"Mamie is most commonly a female name (often a nickname for Mary), and in some families it can be an informal way to say “mom” or “grandma.”","zh":"Mamie 最常见是女性名字（常作 Mary 的昵称）；在一些家庭里也可作对“妈妈”或“奶奶/外婆”的亲昵称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, often used as a nickname for Mary (also spelled Mayme).","zh":"女性名字，常作 Mary 的昵称（也常拼作 Mayme）。"},"examples":[{"en":"Mamie loves gardening and reading mysteries.","zh":"Mamie 喜欢园艺和读侦探小说。"},{"en":"Her grandmother’s name was Mamie.","zh":"她外婆（或奶奶）名叫 Mamie。"}]},{"partOfSpeech":"n.","definition":{"en":"a very informal term used in some families or dialects for “mother” or “grandmother.”","zh":"在某些家庭或方言中非常口语的称呼，指“妈妈”或“奶奶/外婆”。"},"examples":[{"en":"Mamie, can you help me with my homework?","zh":"Mamie，你能帮我做作业吗？"},{"en":"We’re visiting Mamie this weekend.","zh":"我们这周末去看 Mamie（妈妈/奶奶/外婆）。"}]}],"synonyms":["Mayme","Mary (nickname use)","Mom (family use)","Grandma (family use)"],"phonetic":"/ˈmeɪmi/","extraExplanation":["在美国文化里，Mamie 最常见的是人名（例如美国前第一夫人 Mamie Eisenhower）。作为称呼用时比较家庭化、地区性强，不如 mom / grandma 普遍。","注意不要与 “mammy” 混淆：mammy 是英语里带有强烈历史与种族刻板印象的词（指旧时对黑人保姆的刻板形象），现代语境中通常被认为不恰当。Mamie（人名/家人昵称）与之不同。"]}
{"word":"mamies","summary":{"en":"“Mamies” is usually the plural of the name Mamie, and sometimes an informal plural meaning “grandmas.”","zh":"“Mamies” 通常是女性名字 Mamie 的复数；有时也可作非正式说法，表示“奶奶/姥姥们”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Mamie: a female given name (a nickname form of Mary), used especially in the U.S.","zh":"Mamie 的复数：女性名字（常被视为 Mary 的昵称形式），在美国较常见。"},"examples":[{"en":"Two Mamies were in my grandmother’s class photo from the 1920s.","zh":"我祖母那张 1920 年代的班级合影里有两个叫 Mamie 的人。"},{"en":"The book lists the most popular baby names, including several Mamies.","zh":"这本书列出了最常见的宝宝名字，其中包括好几个 Mamie。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of mamie (informal/childlike): grandmothers; older women addressed like “Grandma.”","zh":"mamie 的复数（非正式/童语）：外婆/奶奶们；像“奶奶/姥姥”那样称呼的年长女性。"},"examples":[{"en":"The kids ran to their mamies after the show.","zh":"演出结束后，孩子们跑向各自的奶奶/姥姥。"}]}],"synonyms":["Mary (related name)","grandmas","grandmothers","grandma","granny"],"phonetic":"/ˈmeɪmi/","extraExplanation":["Mamie 常被认为是 Mary 的昵称形式之一，在美国 20 世纪上半叶更常见；例如美国前第一夫人 Mamie Eisenhower（艾森豪威尔夫人）。","有些地区把 mamie 当作“奶奶/姥姥”的亲昵称呼使用，但书面英语里更常见的是 grandma / granny；在不同文化语境中也可能与 mammy（历史上对黑人保姆/奶妈的称呼，带有种族与历史敏感性）产生联想，因此在正式表达中建议用更中性的 grandma。"]}
{"word":"mamilius","summary":{"en":"Mamilius is a character name from Shakespeare’s *The Winter’s Tale*: the young son of King Leontes and Queen Hermione.","zh":"Mamilius（玛米利乌斯）是莎士比亚《冬天的故事》中的人物名：列昂提斯与赫敏妮的年幼儿子。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A young prince in Shakespeare’s play *The Winter’s Tale*; the son of King Leontes and Queen Hermione.","zh":"莎士比亚戏剧《冬天的故事》中的小王子；列昂提斯国王与赫敏妮王后的儿子。"},"examples":[{"en":"Mamilius is loved by the court because he is playful and bright.","zh":"玛米利乌斯因活泼聪明而受到宫廷众人喜爱。"},{"en":"In *The Winter’s Tale*, Mamilius becomes a tragic figure as the family falls apart.","zh":"在《冬天的故事》中，玛米利乌斯在家庭崩解中成为一个悲剧性人物。"}]},{"partOfSpeech":"other","definition":{"en":"Used in literary discussion to refer to an innocent child harmed by adults’ jealousy, suspicion, or political conflict.","zh":"在文学讨论中可用来指代：因成人的嫉妒、猜忌或权力冲突而受害的无辜孩子。"},"examples":[{"en":"The novel’s lost son is sometimes compared to Mamilius—an innocent caught in adult fear.","zh":"这部小说中失踪的儿子常被拿来与玛米利乌斯类比——无辜者被卷入成人的恐惧。"}]}],"synonyms":["(proper name)"],"phonetic":"/məˈmɪliəs/","extraExplanation":["“Mamilius”主要作为文学专名出现，最常见的语境就是莎士比亚《冬天的故事》。这个角色与作品主题（猜忌、误判、家庭破裂与迟来的修复）紧密相关，因此在英语文学评论里常被提到。","在原剧中，玛米利乌斯常被描写为天真可爱、擅讲故事的孩子；他的遭遇强化了剧情的悲剧感，也凸显成人不理性的代价。"]}
{"word":"mamilla","summary":{"en":"Mamilla is a place name for an area of Jerusalem near the Old City.","zh":"Mamilla 是耶路撒冷老城附近一片区域的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a neighborhood/area in Jerusalem, Israel, near the Old City, known for the Mamilla Mall and the Mamilla Cemetery.","zh":"以色列耶路撒冷的一个地区/街区，靠近老城，以“玛米拉购物街（Mamilla Mall）”和“玛米拉公墓（Mamilla Cemetery）”等地标而知名。"},"examples":[{"en":"We walked from Mamilla to the Jaffa Gate in about ten minutes.","zh":"我们从玛米拉走到雅法门大约用了十分钟。"},{"en":"Many tourists shop at Mamilla Mall before visiting the Old City.","zh":"很多游客在参观老城前会先去玛米拉购物街逛逛。"}]}],"synonyms":["Mamilla neighborhood","Mamilla Mall","Mamilla (Jerusalem)"],"phonetic":"/məˈmɪlə/","extraExplanation":["“Mamilla”通常作为专有名词使用，指耶路撒冷西侧靠近老城城墙的一带；现代语境里常与“ Mamilla Mall（露天商业步行街）”连用。","该区域也有历史遗址与宗教/文化相关地点（如Mamilla Cemetery），因此在旅行文章中既可能出现在购物语境，也可能出现在历史与公共记忆的讨论中。","中文常见译名有“玛米拉”（也可能见到“玛姆拉”等不同音译）；读到不同译名时一般指同一地区。"]}
{"word":"mamillary","summary":{"en":"Mamillary is a medical adjective meaning “related to the nipple/breast,” and it can also specifically refer to the mamillary bodies in the brain.","zh":"mamillary 是医学用形容词，表示“与乳头/乳房有关”，也可特指大脑中的“乳头体”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the breast or nipple (used mainly in medical/anatomy contexts).","zh":"（主要用于医学/解剖学）与乳房或乳头有关的；乳状的。"},"examples":[{"en":"The doctor noted a small mamillary lesion near the nipple.","zh":"医生记录到乳头附近有一个小的乳头相关病灶。"},{"en":"In anatomy class, we learned terms like mamillary and mammary.","zh":"在解剖课上，我们学习了像 mamillary 和 mammary 这样的术语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Referring to the mamillary bodies (mammillary bodies), small rounded structures at the base of the brain involved in memory pathways.","zh":"指乳头体（下丘脑乳头体）：位于脑底部、与记忆通路相关的小圆形结构。"},"examples":[{"en":"Damage in the mamillary region can affect memory function.","zh":"乳头体区域受损可能影响记忆功能。"},{"en":"The MRI report mentioned changes near the mamillary bodies.","zh":"核磁共振报告提到乳头体附近有变化。"}]}],"synonyms":["mammillary","nipple-related","areolar (context-dependent)"],"phonetic":"/məˈmɪləri/","extraExplanation":["mamillary 和 mammary（乳腺的）很容易混淆：mammary 更常见，常用于“mammary gland（乳腺）”；mamillary 更偏解剖细节，常见于“mamillary body/bodies（乳头体）”或描述“nipple-like（乳头状的）”。","词源来自拉丁语 mamilla（乳头、小乳房），因此在医学英语里多用于正式、专业写作，日常口语中较少见。"]}
{"word":"mamillate","summary":{"en":"“Mammillate” means nipple-shaped or having nipple-like bumps, often used in scientific descriptions.","zh":"“mamillate”指“乳头状的、像乳头一样凸起的”，常用于医学或地质等科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small, nipple-like projections; shaped like a nipple.","zh":"乳头状的；有小乳头状突起的。"},"examples":[{"en":"Some volcanoes form a mammillate dome with rounded bumps on its surface.","zh":"一些火山会形成乳头状的穹丘，表面有圆钝的隆起。"},{"en":"Under the microscope, the tissue showed a mammillate pattern.","zh":"在显微镜下，这种组织呈现乳头状的形态。"}]}],"synonyms":["nipple-shaped","papillate","mammillary","mammillated"],"phonetic":"/ˈmæməˌleɪt/","extraExplanation":["词源来自拉丁语 mamilla（“乳头；小乳房”），因此常用于医学、解剖学、地质学等语境，用来描述“像乳头一样凸起”的外观。","相关形式：mammillated（同义形容词，更常见于专业写作）。"]}
{"word":"mamillated","summary":{"en":"“Mamillated” describes something that has nipple-like rounded bumps or projections.","zh":"“mamillated” 指表面有乳头状的圆形小突起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small rounded projections (like nipples or small breasts); shaped or covered with nipple-like bumps.","zh":"（表面）有乳头状/乳房状的小突起的；呈乳头状隆起的。"},"examples":[{"en":"The surgeon noted a mamillated surface on the tissue during the examination.","zh":"外科医生在检查时注意到组织表面呈乳头状突起。"},{"en":"Some botanical texts describe certain leaves as mamillated when they have tiny dome-like bumps.","zh":"一些植物学资料会把带有细小圆顶状突起的叶片描述为“乳头状”的。"}]}],"synonyms":["nippled","nipple-like","tuberculate","bumpy"],"phonetic":"/məˈmɪleɪtɪd/","extraExplanation":["词源上来自拉丁语 *mamma*（乳房/乳头），因此 *mamillated* 常用于医学、解剖学、植物学等较正式的描述语境，强调“乳头状突起”的外观。日常英语中很少用。"]}
{"word":"mamillation","summary":{"en":"Mamillation means a nipple- or breast-like rounded bump on a surface, used mainly in technical writing.","zh":"Mamillation 指表面出现乳头状/乳房状的圆形突起，主要用于专业或学术写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rounded, nipple- or breast-like swelling or bump on a surface (in anatomy, pathology, or geology).","zh":"（在解剖、病理或地质等语境中）指表面出现的乳头状或乳房状的圆形隆起、突起。"},"examples":[{"en":"The scan showed small areas of mamillation on the surface of the organ.","zh":"扫描显示该器官表面有一些小的乳头状隆起。"},{"en":"Geologists described mamillation patterns on the weathered rock face.","zh":"地质学家描述了风化岩壁上的乳头状突起纹理。"}]}],"synonyms":["protuberance","bulge","bump","swelling","nodule"],"phonetic":"/ˌmæmɪˈleɪʃən/","extraExplanation":["词源与拉丁语 mamma（乳房）有关，因此 mamillation 常用于较正式、学术性的“形状描述”，强调“像乳头/乳房那样的圆钝突起”。日常英语里更常用 bump、bulge、protuberance。"]}
{"word":"mamlatdar","summary":{"en":"A local Indian government revenue/administrative officer (especially in Gujarat and Maharashtra).","zh":"印度地方政府的税务/行政官员（尤见于古吉拉特邦、马哈拉施特拉邦）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In parts of India, especially Gujarat and Maharashtra) a government revenue and administrative officer in charge of a subdivision of a district (a taluka/tehsil), often handling land records, revenue collection, and some local executive duties.","zh":"（印度部分地区，尤指古吉拉特邦、马哈拉施特拉邦）地方政府的税务与行政官员，通常负责一个县下辖分区（taluka/tehsil）的土地登记、税收征管及部分基层行政事务。"},"examples":[{"en":"The mamlatdar verified the land records before approving the transfer.","zh":"Mamlatdar 在批准过户前核对了土地登记记录。"},{"en":"Villagers went to the mamlatdar’s office to submit a revenue complaint.","zh":"村民去 mamlatdar 办公室提交税务相关的申诉。"}]}],"synonyms":["revenue officer","sub-district officer","tehsil officer (context-dependent)"],"phonetic":"/ˈmʌm.lʌtˌdɑr/","extraExplanation":["mamlatdar 是英印时期及其后沿用的行政职位名称，常见于西印度一些邦的官方文件与日常口语中。不同邦的具体权限可能不完全相同，但核心多与土地、税收与基层行政管理相关。","在很多语境里，它常与 taluka/tehsil（县下辖的分区）一起出现：例如“mamlatdar of X taluka”。这是偏“制度/职务”用词，使用时通常需要提供地区或机构背景以便读者理解。"]}
{"word":"mamluk","summary":{"en":"A Mamluk was a powerful slave-soldier in the medieval Islamic world, especially Egypt and Syria; the term also describes things from that period and culture.","zh":"马穆鲁克指中世纪伊斯兰世界（尤指埃及、叙利亚）的奴隶出身军人阶层，后来形成强大统治集团；也可作形容词指该时期与文化风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a class of slave soldiers (often of Turkic or Caucasian origin) who served Muslim rulers, especially in Egypt and Syria, and later became powerful rulers themselves (the Mamluk Sultanate, 1250–1517).","zh":"马穆鲁克：指一类为穆斯林统治者效力的奴隶出身军人（多来自突厥或高加索地区），尤以埃及和叙利亚为代表；后来他们也曾掌权建立“马穆鲁克苏丹国”（1250–1517）。"},"examples":[{"en":"The Mamluks became Egypt’s ruling military elite in the late Middle Ages.","zh":"马穆鲁克在中世纪后期成为埃及的统治性军事精英。"},{"en":"Many history books describe how Mamluk cavalry shaped battles in the region.","zh":"许多历史书会写到马穆鲁克骑兵如何影响该地区的战局。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mamluks, their culture, style, or period in history.","zh":"（形容词）与马穆鲁克有关的；指马穆鲁克的文化、风格或历史时期的。"},"examples":[{"en":"We visited a mosque known for its Mamluk architecture.","zh":"我们参观了一座以马穆鲁克式建筑闻名的清真寺。"},{"en":"The museum has a small collection of Mamluk metalwork.","zh":"博物馆里有一小批马穆鲁克时期的金属工艺品。"}]}],"synonyms":["slave-soldier","Mamluk ruler","Mamluk elite"],"phonetic":"/ˈmæm.luːk/","extraExplanation":["“Mamluk”源自阿拉伯语 māmlūk，意思是“被拥有的人/奴隶”。但在历史语境中它并不等同于一般意义的“奴隶”：马穆鲁克通常接受严格军事训练，社会地位很高，甚至能进入统治阶层。","常见相关搭配：Mamluk Sultanate（马穆鲁克苏丹国）；Mamluk architecture/metalwork（马穆鲁克建筑/金属工艺）。","文学与历史书写中常用“Mamluk”来强调一种独特的“军人阶层—政权”模式：从外来军奴到掌权者。"]}
{"word":"mamluks","summary":{"en":"Mamluks were elite slave-soldiers who became a major military and ruling class, especially in medieval Egypt and Syria.","zh":"马穆鲁克人原为受训练的“奴隶士兵”，后来成为重要的精锐军人阶层与统治集团，尤见于中世纪的埃及与叙利亚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(History) A powerful military and ruling class made up largely of former slave soldiers, especially in Egypt and Syria, who ruled from 1250 to 1517.","zh":"（历史）马穆鲁克人／马木留克王朝的统治阶层：主要由被训练为士兵的奴隶出身者组成，尤指在埃及与叙利亚地区，1250—1517年间掌权。"},"examples":[{"en":"The Mamluks controlled Egypt for centuries before the Ottomans took over.","zh":"奥斯曼帝国接管之前，马穆鲁克人曾在埃及掌权数百年。"},{"en":"Many textbooks describe the Mamluks as elite cavalry soldiers.","zh":"许多教材把马穆鲁克人描述为精锐的骑兵武士。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of this group; a Mamluk soldier or official (singular: Mamluk).","zh":"马穆鲁克人中的一员；一名马穆鲁克士兵或官员（单数：Mamluk）。"},"examples":[{"en":"A Mamluk could rise to high rank through military skill and loyalty.","zh":"一名马穆鲁克人可以凭借军事才能与忠诚升至高位。"},{"en":"The museum displays armor believed to have belonged to a Mamluk.","zh":"博物馆展出了据信属于一名马穆鲁克人的盔甲。"}]}],"synonyms":["Mamluk","slave soldier","Mamluk dynasty"],"phonetic":"/ˈmæm.lʊks/","extraExplanation":["“Mamluk”源自阿拉伯语 mamlūk，字面意思是“被拥有的、被支配的”，常被译作“奴隶士兵”。他们通常从外族少年中被购买或征募，接受严格军事训练，成年后在军政体系中拥有很高地位。","最著名的是埃及的马穆鲁克苏丹国（1250–1517）。他们曾在艾因贾鲁特之战（1260）击败蒙古军，对中东历史影响很大。后来被奥斯曼帝国吞并，但马穆鲁克势力仍长期存在于埃及政治中。","词形上：Mamluk（单数）→ Mamluks（复数）。在历史写作里常作为专有名词使用，因此首字母通常大写。"]}
{"word":"mamlutdar","summary":{"en":"Likely a misspelling of **mamlatdar** (an Indian local revenue/administrative officer).","zh":"很可能是 **mamlatdar** 的误拼（印度基层税务/行政官员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"“Mamlutdar” is not a standard English word. It is likely a misspelling of **mamlatdar**, a local government revenue officer/administrator in parts of India (especially in Maharashtra and Gujarat).","zh":"“mamlutdar” 不是标准英语词。它很可能是 **mamlatdar** 的拼写错误，指印度部分地区（尤其马哈拉施特拉邦、古吉拉特邦）的基层税务/行政官员。"},"examples":[{"en":"I couldn’t find “mamlutdar” in English dictionaries—did you mean “mamlatdar”?","zh":"我在英语词典里找不到“mamlutdar”——你是不是想写“mamlatdar”？"},{"en":"The mamlatdar helped verify the land records for the village.","zh":"那位 mamlatdar 帮助核实了村里的土地档案。"}]}],"synonyms":["revenue officer","local administrator"],"phonetic":"ˈmɑm.lət.dɑr","extraExplanation":["“Mamlatdar”源自印度地方行政体系中的官职名称，常与土地登记、税收征管、基层行政事务有关。不同地区/转写体系可能出现拼写变体（如 mamlatdar、mamlatdār），你输入的 “mamlutdar” 很可能属于误拼或非标准转写。","如果你是在特定文章、历史材料或某种语言（如印地语/乌尔都语/古吉拉特语）里看到 “mamlutdar”，也可能是该来源的转写方式；你可以贴出原句，我可以根据上下文确认含义。"]}
{"word":"mamma","summary":{"en":"“Mamma” is an affectionate, informal word meaning “mother,” often used by children or in family speech.","zh":"“mamma”是表示“母亲/妈妈”的非正式亲昵称呼，常用于孩子或家庭口语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mother (often used by children or as a warm, family word); also used as a respectful or affectionate way to address a woman in some communities","zh":"妈妈；母亲（常为孩子用的亲昵称呼；在某些社群中也可作为对女性亲切或尊称的称呼）"},"examples":[{"en":"I want my mamma!","zh":"我想要我妈妈！"},{"en":"My mamma taught me to be kind to others.","zh":"我妈妈教我善待他人。"},{"en":"In some places, people may say “mamma” to address an older woman respectfully.","zh":"在一些地方，人们可能用“mamma”来礼貌地称呼年长女性。"}]}],"synonyms":["mom","mother","mama","mommy"],"phonetic":"/ˈmɑːmə/","extraExplanation":["“mamma”是非正式、带情感色彩的称呼，常见于口语、童语或家庭场景。美式英语里更常见的拼写是“mama/mom”；“mamma”有时会让人联想到更传统或带地域/族裔色彩的用法。","在歌剧与音乐里，“Mamma”也常作为“母亲”的呼唤出现（如意大利语mamma的影响），因此在歌词、台词中你可能会看到这种拼写。"]}
{"word":"mammae","summary":{"en":"“Mammae” is a medical/anatomy term meaning “breasts/mammary glands” (plural).","zh":"“mammae”是医学/解剖学用语，表示“乳房/乳腺”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “mamma,” meaning the milk-producing glands (breasts) of female mammals, including humans.","zh":"“mamma”的复数，指雌性哺乳动物（包括人类）的乳腺/乳房，即产乳的腺体。"},"examples":[{"en":"In anatomy class, we learned that the mammae contain glands that produce milk.","zh":"在解剖课上，我们学到乳房（乳腺）内有分泌乳汁的腺体。"},{"en":"Most mammals have mammae to feed their young.","zh":"大多数哺乳动物都有乳腺，用来哺育幼崽。"}]}],"synonyms":["breasts","mammary glands"],"phonetic":"/ˈmæmiː/","extraExplanation":["“mammae”是拉丁语复数形式（单数是“mamma”）。在医学/解剖学语境里更常见；日常英语通常用“breasts”（乳房）或“mammary glands”（乳腺）。","相关词：mammal（哺乳动物）与 mammary（乳腺的）同源，都与“产乳/乳房”相关。医学写作中常见搭配：mammary glands, mammary tissue, breast exam（乳房检查）。"]}
{"word":"mammal","summary":{"en":"A mammal is a warm-blooded animal with hair/fur; females usually feed their young with milk.","zh":"mammal 指“哺乳动物”：恒温、通常有毛发，雌性一般用乳汁哺育幼崽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A warm-blooded animal that has hair or fur and whose females usually feed their babies with milk.","zh":"哺乳动物：一种恒温动物，通常有毛发或皮毛，雌性一般用乳汁哺育幼崽。"},"examples":[{"en":"Humans, dogs, and whales are all mammals.","zh":"人类、狗和鲸鱼都是哺乳动物。"},{"en":"Most mammals give birth to live babies, but a few lay eggs (like the platypus).","zh":"大多数哺乳动物会产下活体幼崽，但少数会产卵（例如鸭嘴兽）。"}]}],"synonyms":["milk-producing animal","warm-blooded animal (broadly)"],"phonetic":"/ˈmæməl/","extraExplanation":["“mammal”来自拉丁语 mamma（乳房），所以它的核心特征与“用乳汁喂养幼崽”有关。并不是所有哺乳动物都生活在陆地上：海豚、鲸等也属于哺乳动物。","和“reptile（爬行动物）/ bird（鸟类）/ fish（鱼类）”相比，学习者常用“whether it produces milk（是否分泌乳汁）”和“has hair/fur（是否有毛发）”来快速判断。"]}
{"word":"mammalgia","summary":{"en":"Mammalgia is the medical term for breast pain.","zh":"mammalgia 是“乳房疼痛”的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Breast pain; soreness or discomfort in one or both breasts.","zh":"乳房疼痛；一侧或双侧乳房的酸痛或不适。"},"examples":[{"en":"She visited her doctor because of persistent mammalgia.","zh":"她因为持续的乳房疼痛而去看医生。"},{"en":"Mammalgia can be related to hormonal changes during the menstrual cycle.","zh":"乳房疼痛可能与月经周期中的激素变化有关。"},{"en":"The nurse asked whether the mammalgia was mild or severe.","zh":"护士询问乳房疼痛是轻微还是严重。"}]}],"synonyms":["breast pain","mastalgia"],"phonetic":"/mæmˈældʒə/","extraExplanation":["这是医学用词，常见于病历或医生交流中。日常英语里更常说“breast pain”。","词源：mamm- 表示“乳房”（来自拉丁语 mamma），-algia 表示“疼痛”（来自希腊语 algos）。因此字面意思就是“乳房疼痛”。","如果出现剧烈疼痛、红肿发热、发烧、乳头分泌物或摸到持续存在的肿块，一般建议尽快就医评估；很多情况与激素变化、乳腺囊肿或炎症有关，但需要专业判断。"]}
{"word":"mammalia","summary":{"en":"Mammalia is the scientific class name for mammals.","zh":"Mammalia 是“哺乳纲”的科学名称，即哺乳动物所属的分类等级。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific class of animals called mammals: warm-blooded vertebrates that usually have hair or fur and feed their babies with milk.","zh":"哺乳纲：动物分类学中的一纲，指恒温的脊椎动物，通常有毛或皮毛，并用乳汁哺育幼崽。"},"examples":[{"en":"Humans belong to the class Mammalia.","zh":"人类属于哺乳纲。"},{"en":"Whales look like fish, but they are Mammalia because they breathe air and feed milk to their young.","zh":"鲸看起来像鱼，但它们属于哺乳纲，因为它们用肺呼吸，并用乳汁喂养幼崽。"}]}],"synonyms":["mammals (common term)"],"phonetic":"/məˈmeɪliə/","extraExplanation":["“Mammalia”是拉丁化的科学名称（分类学用语），在日常英语里更常用“mammals”（哺乳动物，复数）或“a mammal”（一只哺乳动物）。","词根与“mammary（乳房的）”同源，来自拉丁语“mamma”（乳房），强调“以乳汁哺育幼崽”这一特征。"]}
{"word":"mammalian","summary":{"en":"Mammalian means “related to mammals.”","zh":"mammalian 意为“哺乳动物的；与哺乳动物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to mammals (animals that are warm-blooded, have hair or fur, and whose females usually feed their young with milk).","zh":"与哺乳动物有关的（哺乳动物通常恒温、有毛发/皮毛，雌性多以乳汁哺育幼崽）。"},"examples":[{"en":"Humans are mammalian animals.","zh":"人类是哺乳动物。"},{"en":"Mammalian mothers usually nurse their babies.","zh":"哺乳动物的母亲通常会用乳汁喂养幼崽。"},{"en":"Scientists study mammalian brains to understand learning and memory.","zh":"科学家研究哺乳动物的大脑来理解学习与记忆。"}]}],"synonyms":["of mammals","mammal"],"phonetic":"/məˈmeɪliən/","extraExplanation":["“mammalian”来自拉丁语 mam(m)a（乳房、乳头）+ -al（……的）+ -ian（与……有关的）。因此它的核心线索就是“与喂奶有关”。","常见搭配：mammalian species（哺乳动物物种），mammalian brain（哺乳动物大脑），mammalian cells（哺乳动物细胞）。","易混词：mammal（n. 哺乳动物） vs. mammalian（adj. 哺乳动物的）。例如：a mammal（一个哺乳动物）/ mammalian characteristics（哺乳动物特征）。"]}
{"word":"mammalians","summary":{"en":"“Mammalians” means mammals, or things related to mammals. In everyday English, “mammals” is more common.","zh":"“mammalians”表示“哺乳动物（复数）”，也可作形容词指“哺乳动物的”。日常英语中更常用“mammals”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mammals (animals that are warm-blooded, have backbones, and usually have hair or fur; mothers feed their babies with milk).","zh":"哺乳动物（恒温、有脊椎，通常有毛发；母体用乳汁喂养幼崽的动物）。"},"examples":[{"en":"Humans, dogs, and whales are all mammalians (mammals).","zh":"人类、狗和鲸都是mammalians（哺乳动物）。"},{"en":"Most mammalians give birth to live young, but some (like the platypus) lay eggs.","zh":"大多数哺乳动物会产下活体幼崽，但也有一些（如鸭嘴兽）会产卵。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to mammals.","zh":"与哺乳动物有关的；哺乳动物的。"},"examples":[{"en":"Bats are the only mammalian animals that can truly fly.","zh":"蝙蝠是唯一能够真正飞行的哺乳动物。"},{"en":"Milk is a mammalian feature used to feed babies.","zh":"乳汁是哺乳动物用来喂养幼崽的特征。"}]}],"synonyms":["mammals","mammalian animals"],"phonetic":"/məˈmeɪliənz/","extraExplanation":["“mammalians”在日常英语里不如“mammals”常用；更自然的说法通常是用名词“mammals”。\n拼写提示：单数常见形式是“mammalian”，复数是“mammalians”。","词源提示：mammal / mammalian 来自拉丁语 mamma（乳房），因此与“用乳汁哺育幼崽”这一特征密切相关。"]}
{"word":"mammaliferous","summary":{"en":"Mammaliferous means “bearing/containing mammals,” usually in scientific contexts (especially fossils or rock layers).","zh":"mammaliferous 指“含有/产出哺乳动物的”，多用于科学语境（尤其指含哺乳动物化石的地层或沉积物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Producing, containing, or bearing mammals; having mammalian life (often used in scientific or paleontology writing).","zh":"（罕见/学术）产出、包含或具有哺乳动物的；有哺乳动物生存/出土的（常见于科学或古生物学语境）。"},"examples":[{"en":"Scientists searched the mammaliferous layers of rock for fossils.","zh":"科学家在“含哺乳动物化石的”岩层中寻找化石。"},{"en":"This valley is unusually mammaliferous compared with the surrounding desert.","zh":"与周围沙漠相比，这个山谷异常“富含哺乳动物”。"}]}],"synonyms":["mammal-bearing","mammal-rich","fossil-bearing (when talking about strata)"],"phonetic":"/məˌmæləˈfɪrəs/","extraExplanation":["这个词很少在日常英语中出现，更常见于地质学/古生物学：mammaliferous layer（含哺乳动物化石的地层）、mammaliferous deposit（含哺乳动物遗存的沉积物）。","构词上可拆为 mammal（哺乳动物）+ -iferous（“带有/产生……的”）。同一后缀还常见于 carboniferous（含碳的）、auriferous（含金的）。","日常表达里通常会用更自然的说法：rich in mammals（哺乳动物丰富的）或 containing mammal fossils（含哺乳动物化石的）。"]}
{"word":"mammality","summary":{"en":"“Mammality” means the quality or state of being a mammal—the traits that make something mammal-like.","zh":"“mammality”指“哺乳动物性”，即某物作为哺乳动物的性质与特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or qualities of being a mammal; mammal nature or characteristics","zh":"哺乳动物性；作为哺乳动物的特征或属性"},"examples":[{"en":"The article explored human mammality by comparing our parenting behaviors with those of other mammals.","zh":"这篇文章通过将人类的育儿行为与其他哺乳动物对比，探讨了人类的哺乳动物性。"},{"en":"Warm-bloodedness and nursing are often discussed as key signs of mammality.","zh":"恒温性和哺乳常被视为哺乳动物性的关键标志。"}]}],"synonyms":["mammalianity (rare)","mammalian characteristics","mammal traits"],"phonetic":"/mæˈmælɪti/","extraExplanation":["“mammality”是一个较少见、偏学术的名词，常出现在生物学、动物学或科普写作中，用来概括“哺乳动物的共同特征”。更常见的表达是“mammalian characteristics（哺乳动物的特征）”或“mammal traits（哺乳动物特征）”。","构词上来自 Latin “mamma”（乳房）→ mammal（哺乳动物）+ -ity（表示“性质/状态”的后缀），因此字面意思就是“哺乳动物之性质”。"]}
{"word":"mammalogical","summary":{"en":"“Mammalogical” means relating to mammals or the study of mammals.","zh":"“mammalogical”表示“与哺乳动物或哺乳动物学有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to mammals or to the scientific study of mammals (mammalogy).","zh":"与哺乳动物有关的；或与研究哺乳动物的学科（哺乳动物学）有关的。"},"examples":[{"en":"The museum has a small mammalogical collection of skulls and fur samples.","zh":"这家博物馆有一小批与哺乳动物学相关的收藏，包括头骨和毛皮样本。"},{"en":"Her mammalogical research focuses on bat behavior and communication.","zh":"她的哺乳动物学研究聚焦于蝙蝠的行为与交流。"}]}],"synonyms":["mammalian","mammalogy-related","zoological (broader)"],"phonetic":"/ˌmæməˈlɑdʒɪkəl/","extraExplanation":["“mammalogical”来自“mammal（哺乳动物）+ -logy（……学）+ -ical（……的）”。日常英语里更常见的说法是“mammal”作形容词用（例如：mammal species 哺乳动物物种），或直接说“mammalogy / mammalogist（哺乳动物学 / 哺乳动物学家）”。"]}
{"word":"mammalogist","summary":{"en":"A mammalogist is a scientist who studies mammals.","zh":"mammalogist 指研究哺乳动物的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies mammals (animals like humans, dogs, whales, bats, etc.).","zh":"哺乳动物学家；研究哺乳动物（如人类、狗、鲸、蝙蝠等）的科学家。"},"examples":[{"en":"The mammalogist studied bat behavior in a cave.","zh":"这位哺乳动物学家在洞穴里研究蝙蝠的行为。"},{"en":"A mammalogist can work in a museum, a university, or wildlife conservation.","zh":"哺乳动物学家可以在博物馆、大学或野生动物保护机构工作。"}]}],"synonyms":["mammal scientist","zoologist (broader)","wildlife biologist (often related)"],"phonetic":"/məˈmæləˌdʒɪst/","extraExplanation":["词源小提示：mammal（哺乳动物）来自拉丁语 mammalis，和 mamma（乳房）有关；-logist 表示“……学者/研究者”（如 biologist 生物学家）。因此 mammalogist 字面上就是“研究哺乳动物的人”。","相关学科对比：zoologist（动物学家）研究所有动物；mammalogist 更专注于哺乳动物这一类。"]}
{"word":"mammalogists","summary":{"en":"Mammalogists are scientists who study mammals.","zh":"Mammalogists 指研究哺乳动物的科学家（哺乳动物学家）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies mammals (animals like humans, dogs, whales, and bats).","zh":"哺乳动物学家；研究哺乳动物（如人类、狗、鲸、蝙蝠等）的科学家。"},"examples":[{"en":"Mammalogists study how bats use sound to navigate in the dark.","zh":"哺乳动物学家研究蝙蝠如何利用声音在黑暗中导航。"},{"en":"The museum invited mammalogists to identify the animal from its skull.","zh":"博物馆邀请哺乳动物学家根据头骨鉴定这种动物。"}]}],"synonyms":["mammal scientists","mammalogy researchers","wildlife biologists (mammals)"],"phonetic":"/məˈmælədʒɪsts/","extraExplanation":["词形提示：mammalogists 是 mammalogist（哺乳动物学家）的复数。词根 mammal（哺乳动物）+ -logist（“研究……的人/专家”，如 biologist 生物学家）。","学科范围：哺乳动物学（mammalogy）常涉及行为、生态、分类、进化与保护；在自然保护与野外调查中很常见。"]}
{"word":"mammalogy","summary":{"en":"Mammalogy is the branch of biology that studies mammals.","zh":"mammalogy 指“哺乳动物学”，即生物学中研究哺乳动物的分支学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of mammals (animals like humans, dogs, whales, and bats)","zh":"哺乳动物学；研究哺乳动物（如人类、狗、鲸、蝙蝠等）的科学"},"examples":[{"en":"She chose mammalogy because she loves studying bats and their behavior.","zh":"她选择哺乳动物学，因为她喜欢研究蝙蝠及其行为。"},{"en":"Mammalogy helps scientists understand how mammals evolved and adapt to new environments.","zh":"哺乳动物学帮助科学家理解哺乳动物如何进化并适应新环境。"}]}],"synonyms":["study of mammals","mammal science"],"phonetic":"/ˌmæməˈlɑːdʒi/","extraExplanation":["词源：mamma- 表示“乳房/乳汁（与哺乳有关）”，-logy 表示“……学/研究”。所以 mammalogy 直译就是“研究哺乳（特征）的学科”。","学科范围常包括：分类与辨识、生态与分布、行为、进化与遗传、保护（如濒危哺乳动物保护）、以及人类活动对哺乳动物的影响。","相关词：mammal（哺乳动物）；mammalogist（哺乳动物学家）。常见近义表达：study of mammals（研究哺乳动物）。"]}
{"word":"mammals","summary":{"en":"Mammals are warm-blooded vertebrates; most have hair/fur, and mothers feed babies with milk.","zh":"哺乳动物是恒温的脊椎动物；多数有毛发，母体用乳汁哺育幼崽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Warm-blooded animals that have backbones and usually have hair or fur; mothers feed their babies with milk.","zh":"哺乳动物：恒温、有脊椎、通常有毛发（或毛皮）；雌性用乳汁喂养幼崽的动物。"},"examples":[{"en":"Humans, dogs, and whales are all mammals.","zh":"人类、狗和鲸都是哺乳动物。"},{"en":"Most mammals give birth to live young, but some, like the platypus, lay eggs.","zh":"大多数哺乳动物生幼崽（胎生），但也有一些（如鸭嘴兽）会下蛋（卵生）。"},{"en":"In winter, many mammals grow thicker fur to stay warm.","zh":"冬天，许多哺乳动物会长出更厚的毛来保暖。"}]}],"synonyms":["mammal species","warm-blooded animals (general description)"],"phonetic":"/ˈmæməlz/","extraExplanation":["“mammal”来自拉丁语 mamma，意思是“乳房/乳头”，强调“用乳汁喂养幼崽”这一特征。","注意：不是所有哺乳动物都有明显的毛发（例如海豚、鲸类毛发很少），但它们仍属于哺乳动物；而鸟类虽然恒温，却不会分泌乳汁。","常见搭配：marine mammals（海洋哺乳动物）、mammal species（哺乳动物物种）、mammals and birds（哺乳动物与鸟类）。"]}
{"word":"mammary","summary":{"en":"Mammary usually means “related to the breast/milk-producing glands,” often in medical or scientific contexts.","zh":"mammary 通常指“与乳房/乳腺（产乳腺体）有关”，多用于医学或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the breasts (especially the milk-producing glands in humans and other mammals).","zh":"与乳房有关的；（尤指）与哺乳动物产乳腺体有关的。"},"examples":[{"en":"Mammary glands produce milk to feed newborn babies.","zh":"乳腺会产生乳汁来喂养新生儿。"},{"en":"The doctor examined a small lump in the mammary tissue.","zh":"医生检查了乳腺组织里的一个小肿块。"}]},{"partOfSpeech":"n.","definition":{"en":"A breast or mammary gland (less common; usually used in scientific or medical writing).","zh":"乳房；乳腺（较少见，多用于科学或医学语境）。"},"examples":[{"en":"In mammals, the mammary is an organ specialized for nursing young.","zh":"在哺乳动物中，乳腺是专门用于哺育幼崽的器官。"}]}],"synonyms":["breast (adj. use: breast tissue)","lactational (more specific)","milk-producing (informal)"],"phonetic":"/ˈmæməri/","extraExplanation":["词源：来自拉丁语 *mamma*（“乳房/妈妈”之意，拟声词性质），因此 *mammary* 主要用于“乳房/乳腺相关”的正式或医学表达。","常见搭配：*mammary gland(s)*（乳腺），*mammary tissue*（乳腺组织），*mammary tumor*（乳腺肿瘤），*mammogram*（乳房X光检查；与词根相关）。","语体提示：日常英语更常说 *breast*（乳房）；*mammary* 听起来更“医学/生物学”，在普通对话里可能显得过于正式或生硬。"]}
{"word":"mammas","summary":{"en":"“Mammas” is the plural of “mamma,” meaning either mothers (informal) or, in medical/biological use, breasts.","zh":"“mammas”是“mamma”的复数，既可指（非正式的）妈妈们，也可在医学/生物学中指乳房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “mamma”: an informal word for a mother; also used as a warm form of address to a mother.","zh":"“mamma”的复数：非正式说法，指母亲；也可作为对母亲的亲昵称呼。"},"examples":[{"en":"The children ran to their mammas after school.","zh":"孩子们放学后跑向各自的妈妈。"},{"en":"Many mammas in the neighborhood shared babysitting duties.","zh":"社区里很多妈妈会互相分担照看孩子的事情。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “mamma”: a female breast (medical or biological use).","zh":"“mamma”的复数：乳房（多用于医学或生物学语境）。"},"examples":[{"en":"In medical contexts, doctors may examine the mammas for lumps.","zh":"在医学语境中，医生可能会检查乳房是否有肿块。"},{"en":"Most mammals feed their young through the mammas.","zh":"大多数哺乳动物通过乳房哺育幼崽。"}]}],"synonyms":["moms","mothers","mamas","mommas"],"phonetic":"/ˈmɑməz/","extraExplanation":["“mammas”在日常英文里更常写作“moms / mothers”，单数更常见拼写是“mom / mama / momma / mamma”。“mamma”常带有更温柔、带点旧式或戏剧/文学色彩的感觉（比如歌剧里的“mamma mia”），而“mom”更口语、更美式。","“mamma”的“乳房”义项偏医学/生物学，不太用于日常对话；日常谈到人体时更常用“breast(s)”。"]}
{"word":"mammate","summary":{"en":"Mammate is a rare technical adjective meaning “having breasts/teats; mammary.”","zh":"mammate 是一个罕见的专业形容词，意思是“有乳房/乳头的；与乳腺有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, technical) Having breasts or teats; relating to a mammary (milk-producing) structure.","zh":"（罕见、偏专业）有乳房或乳头的；与乳腺（产奶结构）有关的。"},"examples":[{"en":"In older scientific writing, some animals were described as “mammate” to highlight that they have teats.","zh":"在较早的科学写作中，有些动物会被描述为“mammate”，用来强调它们有乳头。"},{"en":"The term is rare today; “mammary” is more common in modern biology.","zh":"这个词如今很少见；现代生物学里更常用“mammary（乳腺的）”。"}]}],"synonyms":["mammary","breasted"],"phonetic":"/ˈmæmeɪt/","extraExplanation":["“mammate”来自拉丁语 mamma（乳房、乳头）。它在现代英语中非常少见，多见于旧式或专业文献；日常表达通常改用 mammary（乳腺的）、breasted（有乳房的，较口语/描述性）等。","如果你本来想查的是 “mammal（哺乳动物）”，它指“用乳汁哺育幼崽的动物”，拼写与含义都不同。"]}
{"word":"mammati","summary":{"en":"Mammati: a South Asian word for a heavy hoe/spade used for digging soil.","zh":"mammati：南亚地区常用词，指一种用于挖土的重型锄/小铲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) A heavy hand tool like a hoe or small spade, used for digging and cutting soil, especially in Sri Lanka and parts of India.","zh":"（南亚英语）一种类似锄头或小铲的重型手工具，用于挖土、翻地或切开土壤，常见于斯里兰卡及印度部分地区。"},"examples":[{"en":"He used a mammati to dig a drainage channel along the field.","zh":"他用 mammati 在田边挖了一条排水沟。"},{"en":"Farmers sharpen the mammati blade before the planting season.","zh":"农民会在播种季前把 mammati 的刃磨快。"}]}],"synonyms":["hoe","mattock","spade"],"phonetic":"/ˈmæməˌti/","extraExplanation":["“mammati”在标准美式英语里不算常见词，更常见的拼法是 **mammoty / mamoty**。它属于地区性用词（南亚英语），在当地日常生活和农业语境中更容易见到。"]}
{"word":"mammatocumulus","summary":{"en":"Mammatocumulus is a pouchy, hanging cloud feature under a larger cloud, often seen after thunderstorms (also called mammatus).","zh":"mammatocumulus 指云底部呈袋状下垂的云体特征，常见于雷暴后或雷暴砧状云下方（也叫 mammatus / 乳状云）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cloud formation made of pouch-like bulges hanging from the underside of a larger cloud (often under a thunderstorm anvil); also called “mammatus.”","zh":"一种云底部向下垂挂、呈“袋状/乳房状”凸起的云体结构（常见于雷暴砧状云下方）；也称“乳状云/乳房云（mammatus）”。"},"examples":[{"en":"We saw mammatocumulus clouds after the storm had passed.","zh":"暴风雨过去后，我们看到了乳状云（mammatocumulus）。"},{"en":"Mammatocumulus often appears under the flat anvil of a thunderstorm cloud.","zh":"乳状云常出现在雷暴云平坦的“砧状云顶”下方。"}]}],"synonyms":["mammatus","mammatus clouds"],"phonetic":"/məˈmætəˌkjuːmjələs/","extraExplanation":["“mammatocumulus”在现代气象学里更常用的名称是“mammatus”（乳状云），属于一种“云的补充特征（supplementary feature）”，常附着在积雨云或层积云等云体下方。","词源来自拉丁语“mamma”（乳房），描述其外观像一团团向下鼓起的“口袋”。这种云不一定意味着马上会下大雨，更多是提示高空曾有强烈对流与湍流活动。"]}
{"word":"mammatus","summary":{"en":"Mammatus describes (or names) dramatic pouch-like cloud bulges hanging from the underside of a cloud, often after thunderstorms.","zh":"mammatus 指（或可作名词指代）云底部呈袋状、乳状向下垂的凸起结构，常见于雷暴之后。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(meteorology) Describing clouds with hanging, pouch-like bulges on their underside, often seen after strong thunderstorms.","zh":"（气象）指云底部出现一团团向下垂的“乳状/袋状”凸起的云，常在强雷暴后出现。"},"examples":[{"en":"We saw mammatus clouds glowing orange at sunset after the storm passed.","zh":"暴风雨过去后，我们在日落时看见乳状云被染成橙色发光。"},{"en":"Mammatus formations are dramatic, but they don’t always mean a tornado is coming.","zh":"乳状云看起来很震撼，但并不一定意味着龙卷风要来。"}]},{"partOfSpeech":"n.","definition":{"en":"Mammatus clouds; the pouch-shaped cloud formations themselves.","zh":"乳状云；指这些袋状下垂的云体本身。"},"examples":[{"en":"Photographers waited for the mammatus to develop along the anvil cloud.","zh":"摄影师们等着乳状云沿着砧状云发展出来。"}]}],"synonyms":["mammatus clouds","mammatocumulus (older term)"],"phonetic":"/ˈmæmətəs/","extraExplanation":["词源提示：mammatus 来自拉丁语 mamm(a)（乳房），因为云底的鼓包形状像一串“下垂的袋子”。在气象学里也常见写法 mammatocumulus（旧称），现代更常说 mammatus clouds。","形成直觉：通常与强对流云（如雷暴的砧状云 anvil）有关。当较冷、含水汽/冰晶的空气在云底局部下沉并与周围较暖空气混合时，会形成一团团向下凸出的“囊状”结构。","使用习惯：日常交流中更常说 “mammatus clouds”，单独说 mammatus 多见于天气报告、科普文章或摄影圈。"]}
{"word":"mammea","summary":{"en":"Mammea is a tropical tree and its fragrant, thick-skinned fruit (often called mammee apple).","zh":"Mammea 指一种热带树及其芳香、厚皮的大型果实（常称 mammee apple）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical evergreen tree (Mammea americana) native to the Caribbean and parts of Central/South America, and also its large, round fruit with thick skin and fragrant, orange flesh","zh":"一种热带常绿树（Mammea americana，美洲玛米果树），也指它结的圆形大果；果皮厚、果肉橙色且有香味"},"examples":[{"en":"In the Caribbean, mammea fruit is sometimes made into juice or jam.","zh":"在加勒比地区，mammea 的果实有时会被做成果汁或果酱。"},{"en":"The mammea tree provides shade and produces fragrant blossoms.","zh":"mammea 树能遮阴，还会开出有香味的花。"},{"en":"Be careful: “mammea” is not always the same as “mamey,” which can refer to a different fruit.","zh":"注意：“mammea”不一定等同于“mamey”；“mamey”有时指的是另一种水果。"}]}],"synonyms":["mammee","mammee apple","mamey apple (regional)"],"phonetic":"/məˈmiːə/","extraExplanation":["“mammea”常见于植物学或食物文化语境，指 Mammea americana（英文也常叫 mammee apple / mammee）。\n\n它容易和“mamey”混淆：在不同地区，“mamey”可能指 Mammea americana（mamey apple），也可能指另一种水果 Pouteria sapota（sapote/mamey sapote）。看菜单或市场标签时，最好结合产地或学名确认。"]}
{"word":"mammectomy","summary":{"en":"Mammectomy is a medical term for surgical removal of a breast (commonly called mastectomy).","zh":"mammectomy 指乳房切除术，即通过手术切除乳房（更常用说法是 mastectomy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove one or both breasts, usually to treat or prevent breast cancer; also called a mastectomy.","zh":"乳房切除术：通过手术切除一侧或双侧乳房，常用于治疗或预防乳腺癌；也称“乳房切除（mastectomy）”。"},"examples":[{"en":"After the diagnosis, her doctor discussed whether a mammectomy (mastectomy) was necessary.","zh":"确诊后，医生与她讨论是否需要进行乳房切除术（mammectomy/mastectomy）。"},{"en":"Some patients choose mammectomy as a preventive step because of a high genetic risk.","zh":"一些患者因遗传风险较高，会选择乳房切除术作为预防措施。"}]}],"synonyms":["mastectomy","breast removal surgery"],"phonetic":"/ˌmæməˈtɛktəmi/","extraExplanation":["“mammectomy”在现代临床英语中不如“mastectomy”常用；在医学沟通或阅读资料时，更常见的是“mastectomy”。","乳房切除术有不同类型（如全乳切除、保乳手术/部分切除等），具体方案取决于肿瘤位置、分期、个人风险与偏好，通常需要与外科医生和肿瘤团队共同决定。","这个话题可能涉及身体形象与心理压力；英语中常见的支持性表达包括“reconstruction (breast reconstruction 乳房重建)”“support group 互助小组”“counseling 心理咨询”。"]}
{"word":"mammee","summary":{"en":"Mammee is an uncommon spelling mainly meaning “mother,” and more rarely a dated word for a caretaker (use neutral terms like “nanny”).","zh":"Mammee 是不太常见的拼写，主要指“妈妈”；较少情况下是旧式的“看护者/保姆”，建议改用更中性的说法如 nanny。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(variant spelling) a mother; used especially as a child’s word or in some dialects.","zh":"（拼写变体）妈妈；多为儿童用语或方言用法。"},"examples":[{"en":"Mammee, can you read me a story?","zh":"妈妈，你能给我读个故事吗？"},{"en":"He called his mother “mammee” when he was little.","zh":"他小时候会把妈妈叫作“mammee”。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/dated) a nursemaid or caretaker of children; often overlaps with “mammy,” which can be culturally sensitive.","zh":"（少见/旧式）保姆、带孩子的看护人；常与“mammy”意义重叠，而“mammy”在文化上可能带有敏感含义。"},"examples":[{"en":"In older writing, “mammee” sometimes refers to the woman who cared for the children.","zh":"在一些较早的文字里，“mammee”有时指照顾孩子的女性。"},{"en":"Modern writers usually choose more neutral words like “nanny” or “caregiver.”","zh":"现代写作者通常会用更中性的词，比如“nanny（保姆）”或“caregiver（照护者）”。"}]}],"synonyms":["mama","mommy","mom","mother","nanny","caregiver"],"phonetic":"/ˈmæmi/","extraExplanation":["“mammee”并不是最常见的标准拼写，更常见的是“mama/mommy”（口语）或“mother”（正式）。","如果你想表达“保姆/看孩子的人”，更推荐用中性且常用的“nanny”“babysitter”“caregiver”。","需要注意：“mammy”在美国历史语境里常与种族刻板印象相关，可能冒犯他人；在不确定语境时避免使用。"]}
{"word":"mammees","summary":{"en":"“Mammees” is the plural of “mammee,” meaning either a Caribbean tropical fruit/tree (mamey apple) or, in Caribbean English, an informal way to address mothers or older women.","zh":"“mammees”是“mammee”的复数：既可指加勒比常见的热带水果/树（马米苹果），也可在加勒比英语中作对母亲或年长女性的亲昵称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of mammee) A round tropical fruit (also called the mamey apple) or the tree that produces it, native to the Caribbean and Central America.","zh":"（mammee 的复数）一种热带水果（也叫“mamey apple / 马米苹果”）或结这种果实的树，原产加勒比与中美洲。"},"examples":[{"en":"The market was selling ripe mammees alongside mangoes and guavas.","zh":"市场上除了芒果和番石榴，还在卖成熟的 mammees（马米苹果）。"},{"en":"We made juice from mammees during our trip to Jamaica.","zh":"我们在牙买加旅行时用 mammees（马米苹果）做了果汁。"}]},{"partOfSpeech":"n.","definition":{"en":"(Caribbean English, informal) Mothers, grandmothers, or older women, used as a familiar form of address.","zh":"（加勒比英语，非正式）对母亲、祖母或年长女性的称呼（带亲昵/熟悉语气）。"},"examples":[{"en":"Mammee, can you tell me that story again?","zh":"Mammee，你能再给我讲一遍那个故事吗？"},{"en":"The kids ran to their mammees after school.","zh":"放学后孩子们跑向自己的 mammees（妈妈/外婆等年长女性）。"}]}],"synonyms":["mamey apple","mammee apple"],"phonetic":"/mæˈmiː/","extraExplanation":["“mammee（马米苹果）”在英语里多见于加勒比与中美洲语境；在北美并不算常见，可能会用更具体的说法如 “mamey apple / mammee apple”。","作为称呼的 “mammee” 带明显地域色彩（常见于加勒比英语/克里奥尔语影响的英语）。在其他英语环境中，用 “mom/mum/mother/grandma” 更通用。注意它不同于 “mammy”（后者在美国历史语境中可能涉及刻板印象，用法需谨慎）。"]}
{"word":"mammer","summary":{"en":"“Mammer” is a rare/old word meaning to hesitate or speak with a stammer; it can also mean a stammering kind of speech.","zh":"“mammer”是较少见/偏古的词，表示犹豫或结结巴巴、含糊地说话；也可指结巴式的言语。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hesitate or speak in a confused, halting way; to stammer or mumble","zh":"犹豫不决或结结巴巴、含糊地说话；口吃、嘟囔"},"examples":[{"en":"He mammered for a moment before answering the teacher.","zh":"他在回答老师之前犹豫了一下，还说得有些结巴。"},{"en":"She mammered an apology, but no one could clearly hear it.","zh":"她含糊地道了歉，但没人听清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"confused or hesitant speech; a stammer","zh":"含糊、犹豫的言语；结巴"},"examples":[{"en":"His reply was full of mammer and uncertainty.","zh":"他的回答充满了结巴与不确定。"}]}],"synonyms":["stammer","mumble","hesitate","falters","hem and haw"],"phonetic":"/ˈmæmɚ/","extraExplanation":["“mammer”在现代英语中非常少见，常被认为是古体或方言用法；现代更常用的词是“stammer / mumble / hesitate”。","这个词常用来描写人物紧张、尴尬或不知所措时说话不利索的状态，因此在文学叙述里有较强的画面感。"]}
{"word":"mammered","summary":{"en":"“Mammered” means spoke hesitantly or indistinctly (an uncommon/old-fashioned verb form).","zh":"“mammered”意为说话犹豫或含糊不清（较少见、偏旧式/方言用法）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of “mammer”) spoke in a hesitant, confused, or stammering way; mumbled.","zh":"（“mammer”的过去式/过去分词）说话犹豫、结结巴巴或含糊不清；嘟囔。"},"examples":[{"en":"He mammered an apology, not meeting her eyes.","zh":"他结结巴巴地道了歉，不敢看她的眼睛。"},{"en":"“I… I didn’t mean it,” she mammered.","zh":"“我……我不是那个意思，”她结结巴巴地说。"},{"en":"The child mammered when the teacher asked his name.","zh":"老师问名字时，孩子紧张得说话结巴。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) moved or acted in a hesitant, ineffective way; fumbled.","zh":"（较少见）做事犹豫、笨拙；手忙脚乱。"},"examples":[{"en":"He mammered with the keys and couldn’t open the door quickly.","zh":"他拿着钥匙手忙脚乱，没能很快打开门。"}]}],"synonyms":["stammered","mumbled","faltered","spluttered"],"phonetic":"/ˈmæmərd/","extraExplanation":["“mammer”属于较古老/方言色彩的词（在现代英语里不常见）。在当代更常用的是：stammer（口吃/结巴）、mumble（含糊地说）、murmur（低声说）。","拼写提醒：很多学习者会把常见的“murmured（低声说）”误写成“mammered”。如果你的意思是“低声说/轻声嘀咕”，更可能是 murmured。"]}
{"word":"mammering","summary":{"en":"“Mammering” means hesitating or stammering while speaking (rare/old-fashioned).","zh":"“mammering”指说话时犹豫、结巴、吞吞吐吐（较少见且偏古旧）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hesitating or speaking in a confused, awkward way; stammering (old-fashioned/rare).","zh":"（古旧/少见）犹豫地说话；结结巴巴地说；吞吞吐吐的。"},"examples":[{"en":"He stood there, mammering, unable to answer the teacher’s question.","zh":"他站在那里吞吞吐吐，答不上老师的问题。"},{"en":"Her mammering apology made it clear she wasn’t telling the whole story.","zh":"她结结巴巴的道歉让人看出她并没有把实情都说出来。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of hesitating or stammering in speech (rare).","zh":"（少见）犹豫或结巴地说话；吞吞吐吐。"},"examples":[{"en":"There was a lot of mammering before anyone finally spoke up.","zh":"在终于有人开口之前，大家犹豫结巴了好一阵。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “mammer”: to hesitate or stammer while speaking (old-fashioned/rare).","zh":"“mammer”的现在分词：说话时犹豫或结巴（古旧/少见）。"},"examples":[{"en":"He kept mammering and looking down, as if ashamed.","zh":"他一直吞吞吐吐、低着头，好像很羞愧。"}]}],"synonyms":["stammering","hesitating","stumbling (over words)","fumbling (for words)"],"phonetic":"/ˈmæmərɪŋ/","extraExplanation":["“mammering / mammer”在现代英语里很少见，带有古风或方言色彩。写作中用它可以营造“老式、文学化”的语气；日常口语更常用：hesitating, stumbling over words, stammering。","这个词常让学习者联想到拼写相近的“murmuring（低声咕哝）”，但含义不同：mammering强调“犹豫/结巴”，murmuring强调“轻声说/咕哝”。"]}
{"word":"mammers","summary":{"en":"“Mammers” is a rare/archaic form meaning to hesitate or stammer (or the plural noun for stammering).","zh":"“mammers”较少见、偏古体/方言，用来表示“犹豫、结巴地说”，也可作名词复数表示“口吃/吞吞吐吐”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(plural of mammer) to hesitate or speak with a stammer; to falter in speech.","zh":"（mammer 的复数）犹豫不决或结结巴巴地说话；说话吞吞吐吐。"},"examples":[{"en":"He mammered for a moment before answering the question.","zh":"他在回答问题前犹豫了片刻，说话也有些结巴。"},{"en":"Don’t mammer—just tell me what happened.","zh":"别吞吞吐吐的，直接告诉我发生了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of mammer) a stammer or a hesitant way of speaking.","zh":"（mammer 的复数）口吃；吞吞吐吐、犹豫的说话方式。"},"examples":[{"en":"Her words came out in mammerings when she got nervous.","zh":"她一紧张就会结结巴巴，说话吞吞吐吐。"}]}],"synonyms":["stammer","hesitate","mumble","falter"],"phonetic":"/ˈmæmɚ/","extraExplanation":["“mammer”/“mammering(s)”比较少见，带有古体或方言色彩（常见于苏格兰或英格兰北部语境）。现代英语里更常用的说法是 “stammer”（口吃）、“mumble”（含混地嘟囔）、“hesitate”（犹豫）。","你输入的“mammers”多半是动词第三人称单数（He/She mammer*s*）或复数名词（mammer*s*）。如果你是在某篇文章里看到它，我也可以帮你根据上下文判断是哪一种。"]}
{"word":"mammet","summary":{"en":"Mammet is an old word meaning a puppet/doll, often used to suggest someone is being controlled like a puppet.","zh":"mammet 是个较古老的词，意为木偶/玩偶，也常用来指像木偶一样被人操控的“傀儡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a puppet or doll; something (or someone) moved or controlled by another person","zh":"木偶；玩偶；（也可指）被他人操控的人、傀儡"},"examples":[{"en":"In the old play, the villain treats the prince like a mammet and pulls the strings from behind the curtain.","zh":"在那出老戏里，反派把王子当作木偶一样，在幕后拉线操控。"},{"en":"She refused to be a mammet for anyone else’s ambitions.","zh":"她拒绝做任何人野心的傀儡。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, insulting) a weak or foolish person","zh":"（旧式、带侮辱）软弱或愚蠢的人"},"examples":[{"en":"He called his rival a “mere mammet,” but the insult sounded old-fashioned.","zh":"他骂对手“不过是个mammet”，但这句侮辱听起来很古旧。"}]}],"synonyms":["puppet","doll","marionette","dummy","pawn"],"phonetic":"/ˈmæmɪt/","extraExplanation":["“mammet”是古英语/中古英语里较罕见的词，现代英语中多见于文学作品、历史题材或仿古风格的写作。","在莎士比亚等早期英文文本中，它常带有“被操控的木偶/傀儡”的贬义色彩，用来强调一个人没有自主性。"]}
{"word":"mammets","summary":{"en":"Mammets is the plural of mammet, meaning a puppet/doll or, figuratively, a controllable fool or pawn.","zh":"mammets 是 mammet 的复数，指木偶/洋娃娃，也可比喻为任人摆布的傀儡或被利用的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a puppet or doll; a figure made to be moved or controlled (often used in an old-fashioned or literary way)","zh":"木偶；洋娃娃；被操控的人偶（多为古旧或文学用法）"},"examples":[{"en":"The children played with puppets and mammets at the fair.","zh":"孩子们在集市上玩木偶和洋娃娃。"},{"en":"In the old story, the magician made a mammet dance on the table.","zh":"在那个古老的故事里，魔法师让一个人偶在桌上跳舞。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, insulting) a weak or foolish person who is easily controlled by others; a mere tool","zh":"（比喻、贬义）软弱或愚蠢、任人摆布的人；傀儡；工具人"},"examples":[{"en":"He wasn’t the leader—just a mammet following orders.","zh":"他并不是领导者——只是个听命行事的傀儡。"},{"en":"Don’t let them treat you like a mammet.","zh":"别让他们把你当成傀儡一样摆布。"}]}],"synonyms":["puppets","dolls","effigies","pawns","tools"],"phonetic":"/ˈmæmɪt/","extraExplanation":["“mammet”的复数是“mammets”。这个词在现代英语里比较少见，更多出现在文学或历史语境中。","它在莎士比亚《奥赛罗》(Othello) 里出现过，用作侮辱，带有“愚蠢的傀儡/被人操控的人”的意思，因此读到时常带强烈贬义色彩。"]}
{"word":"mammey","summary":{"en":"“Mammey” is an uncommon spelling. It may refer to “mammy” (a dated, often offensive stereotype term) or to “mamey” (a tropical fruit).","zh":"“mammey”不是常见拼写，可能指“mammy”（过时且常带冒犯性的刻板印象用语）或“mamey”（一种热带水果）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled “mammy”) a Black woman employed as a nanny/housekeeper in the U.S., especially in the American South in the past; today this word is considered dated and often offensive because it is tied to racist stereotypes.","zh":"（也拼作“mammy”）指美国（尤其旧时南方）受雇照看孩子、做家务的黑人女性；如今该词多被视为过时且常带冒犯性，因为与种族刻板印象相关。"},"examples":[{"en":"The book discusses why the “mammy” stereotype is harmful.","zh":"这本书讨论了为什么“mammy（黑保姆）”的刻板印象有害。"},{"en":"She avoided the term because it can be offensive.","zh":"她避免使用这个词，因为它可能带有冒犯性。"}]},{"partOfSpeech":"n.","definition":{"en":"(often spelled “mamey”) a tropical fruit with orange flesh, eaten fresh or used in drinks and desserts.","zh":"（常拼作“mamey”）一种热带水果，橙色果肉，可鲜食或用于饮品和甜点。"},"examples":[{"en":"We bought mamey at the Latin market to make a smoothie.","zh":"我们在拉美市场买了mamey来做奶昔。"},{"en":"Mamey tastes sweet and creamy.","zh":"Mamey的味道甜而绵密。"}]}],"synonyms":["nanny","caregiver","housekeeper","mamey"],"phonetic":"/ˈmæmi/","extraExplanation":["“mammey”在英文里不算常见拼写，最常见可能是“mammy”的误拼。现代英语中，谈到过去的家务劳动与照护工作者时，较中性的说法常用“nanny（保姆）”“caregiver（照护者）”“housekeeper（管家/家务工）”。","如果你想表达水果，通常写作“mamey”（例如 mamey sapote）。不同地区对这种水果的称呼可能不同。"]}
{"word":"mammeys","summary":{"en":"“Mammeys” is likely a misspelling of “mammies,” the plural of “mammy” (mom/child’s word), but “mammy” can also be a historically racist stereotype in U.S. English.","zh":"“mammeys”很可能是“mammies”（“mammy”的复数）的误拼，表示“妈妈/妈咪”；但“mammy”在美国英语中也可能指带有种族歧视历史的刻板“黑保姆”形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “mammy”) a mother; or a child’s word for “mom.”","zh":"（“mammy”的复数）妈妈；或儿童对“妈妈”的称呼。"},"examples":[{"en":"In the story, the children ran to their mammies after school.","zh":"在故事里，孩子们放学后跑向自己的妈妈们。"},{"en":"The toddler called out, “Mammy!” when she couldn’t find her mom.","zh":"小宝宝找不到妈妈时喊：“妈咪！”"}]},{"partOfSpeech":"n.","definition":{"en":"(U.S. history; often offensive) a stereotyped term for a Black woman depicted as a loyal domestic servant caring for a white family.","zh":"（美国历史语境；常具冒犯性）对黑人女性的刻板称呼：被描绘为忠诚的家政女仆/保姆，照顾白人家庭。"},"examples":[{"en":"Many educators avoid the word “mammy” because it is tied to racist stereotypes.","zh":"很多教育者会避免使用“mammy”这个词，因为它与种族主义刻板印象有关。"},{"en":"The film was criticized for repeating a “mammy” stereotype.","zh":"这部电影因重复“mammy（黑保姆）”刻板形象而受到批评。"}]}],"synonyms":["moms","mothers","mummies (BrE, informal spelling for mothers)","nannies (context-dependent)"],"phonetic":"/ˈmæmi/","extraExplanation":["“mammeys”更常见的拼写通常是“mammies”（复数），或写成“mammy’s”（表示“mammy的”）。具体要看你的句子。","在美国文化中，“mammy”作为对黑人家政女工的形象称呼，和奴隶制及种族歧视历史紧密相关；现代英语写作中常被视为不尊重或冒犯。若只是想说“保姆/阿姨”，更中性可用“nanny / babysitter / caregiver”。"]}
{"word":"mammie","summary":{"en":"“Mammie” can be a childlike word for mother or a personal name, but in US history it can also refer to an offensive racial stereotype (like “mammy”).","zh":"“Mammie”既可作对母亲的童稚称呼或人名/昵称，但在美国历史语境中也可能指带冒犯性的种族刻板形象（同“mammy”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A child’s word for “mother,” or a familiar nickname for a mother or grandmother (spelling variant of “mammy”).","zh":"（非正式）对“妈妈”的儿童称呼，或对母亲/祖母的亲昵称呼（“mammy”的变体拼写）。"},"examples":[{"en":"When I was little, I called my mother “Mammie.”","zh":"我小时候叫我妈妈“Mammie”。"},{"en":"Mammie, can you read me a story?","zh":"妈妈（Mammie），你能给我读个故事吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(US history, offensive) A stereotype for an older Black woman shown as a devoted domestic servant or nursemaid in white households (also spelled “mammy”).","zh":"（美国历史；冒犯性）指一种刻板形象：被描绘成忠诚的黑人年长女性家仆/保姆（也拼作“mammy”）。"},"examples":[{"en":"The film has been criticized for using the “mammy/mammie” stereotype.","zh":"这部电影因使用“mammy/mammie（黑妈）”的刻板形象而受到批评。"},{"en":"Many educators avoid this term because of its racist history.","zh":"许多教育者会避免使用这个词，因为它有种族主义的历史背景。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name or nickname (less common today).","zh":"女性名字或昵称（如今较少见）。"},"examples":[{"en":"Her great-aunt Mammie was born in 1910.","zh":"她的姑奶奶（或曾姑母）Mammie出生于1910年。"}]}],"synonyms":["mom","mommy","mama","mum","mother","mammy"],"phonetic":"/ˈmæmi/","extraExplanation":["在美国文化语境中，“mammy/mammie”作为刻板形象与奴隶制及其后续的种族不平等有关，常被认为带有贬低与美化压迫的意味。现代英语里更安全的说法通常是“mother/mom”或“nanny/caregiver”（视语境而定）。如果只是家庭私下对母亲的昵称，用“Mammie”一般不会引发上述问题。"]}
{"word":"mammies","summary":{"en":"“Mammies” is the plural of “mammy.” It can mean “mothers/caregivers” informally, but in US historical context it often refers to an offensive racial stereotype of Black women as loyal domestic servants.","zh":"“mammies”是“mammy”的复数。它可作非正式用法表示“母亲/照护者”，但在美国历史语境中常指对黑人女性的冒犯性种族刻板形象（忠诚的家佣/保姆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mammy”: a mother or a woman who takes care of children (informal).","zh":"“mammy”的复数：母亲；照看孩子的女性（非正式）。"},"examples":[{"en":"Some kids still call their grandmother “Mammy.”","zh":"有些孩子仍然把奶奶叫作“Mammy”。"},{"en":"She worked as a caregiver, almost like a mammy to the whole neighborhood.","zh":"她做护工，几乎像整个社区的“妈妈/照护者”。"}]},{"partOfSpeech":"n.","definition":{"en":"(US history, often offensive) Plural of “Mammy”: a racial stereotype of an older Black woman shown as a loyal domestic servant or nanny in the white South.","zh":"（美国历史语境，常具冒犯性）“Mammy”的复数：对年长黑人女性的种族刻板形象，常被描绘成对白人家庭忠诚的女佣或保姆。"},"examples":[{"en":"The film repeats old “Mammy” stereotypes, which many viewers find harmful.","zh":"这部电影重复了旧式的“Mammy”刻板形象，许多观众认为这会造成伤害。"},{"en":"Many museums explain how “Mammy” images were used in advertising.","zh":"许多博物馆会解释“Mammy”形象如何被用于广告宣传。"}]}],"synonyms":["mothers","moms","caregivers","nannies"],"phonetic":"/ˈmæmiz/","extraExplanation":["在当代英语里，“Mammy/mammies”在讨论美国奴隶制与种族刻板印象时非常常见；在现实称呼陌生人或泛指群体时容易被认为带有侮辱性或不尊重。","如果你只是想表达“妈妈/照顾孩子的人”，更安全常用的说法是 mother, mom, caregiver, nanny。若是家庭内部昵称（例如叫外婆“mammy”），通常属于地域/家族用法，但在跨文化交流中仍建议先了解对方感受。"]}
{"word":"mammifer","summary":{"en":"“Mammifer” is a rare English word meaning a mammal, or (less commonly) relating to mammals.","zh":"“mammifer”是较罕用的英语词，可指“哺乳动物”，也可（较少见）作形容词表示“与哺乳动物有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A mammal; an animal that feeds its young with milk.","zh":"（罕用）哺乳动物；用乳汁哺育幼崽的动物。"},"examples":[{"en":"Humans are mammifers, so babies drink milk from their mothers.","zh":"人类是哺乳动物，所以婴儿会喝母亲的乳汁。"},{"en":"Most whales are mammifers even though they live in the ocean.","zh":"大多数鲸类生活在海洋里，但它们仍然是哺乳动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, scientific) Relating to mammals; mammal-bearing (often seen as “mammiferous”).","zh":"（罕用/科学语境）与哺乳动物有关的；“产哺乳动物的”（更常见写法为 mammiferous）。"},"examples":[{"en":"The paper discusses mammifer evolution in the early Cenozoic.","zh":"这篇论文讨论了新生代早期哺乳动物的演化。"}]}],"synonyms":["mammal","mammalian (adj.)","mammiferous (adj., formal)"],"phonetic":"/ˈmæmɪfɚ/","extraExplanation":["“mammifer”在现代英语里很少用，日常最常用的是“mammal（哺乳动物）”。如果你想表达“与哺乳动物有关的”，更常见的是“mammalian（哺乳动物的）”或“mammiferous（产乳的/哺乳动物的，偏学术）”。","你输入的“mammifer”也很像法语“mammifère（哺乳动物）”的拼写；在英语学习中容易混淆。"]}
{"word":"mammifera","summary":{"en":"Mammifera is a scientific (often older) term used to refer to mammals, similar to Mammalia.","zh":"Mammifera 是一个科学（偏旧）用语，用来指哺乳动物，意义上常接近 Mammalia（哺乳纲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, taxonomy) A scientific group name meaning “mammal-bearers,” used to refer to mammals as a whole (often treated as equivalent to the class Mammalia).","zh":"（生物学/分类学）一个意为“哺乳的动物”的学名用法，用来指“哺乳动物整体”（常被当作与“哺乳纲 Mammalia”近似或等同）。"},"examples":[{"en":"Humans belong to Mammifera because we are mammals that nurse our young.","zh":"人类属于 Mammifera，因为我们是会用乳汁哺育幼崽的哺乳动物。"},{"en":"In older scientific writing, you may see Mammifera used where modern books say Mammalia.","zh":"在较早的科学文献中，你可能会看到用 Mammifera 来表示现代教材所说的 Mammalia（哺乳纲）。"}]}],"synonyms":["mammals","Mammalia"],"phonetic":"/məˈmɪfərə/","extraExplanation":["“Mammifera”源自拉丁语：mamma（乳房/乳汁）+ ferre（携带、产生），字面意思接近“产乳者/哺乳者”。","在现代分类学中更常用的正式名称是“Mammalia（哺乳纲）”。“Mammifera”有时出现在旧文献、拉丁化标题或较宽泛的“哺乳动物类群”表述中。注意它是科学术语，日常英语通常直接说“mammals”。"]}
{"word":"mammiferous","summary":{"en":"Mammiferous means “milk-producing” or “related to mammals,” and it is mainly used in scientific contexts.","zh":"mammiferous 指“泌乳的”或“与哺乳动物有关的”，主要用于较正式的科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal or its body parts) producing milk; relating to mammals.","zh":"（指动物或其身体部位）泌乳的；与哺乳动物有关的。"},"examples":[{"en":"Humans are mammiferous animals because mothers produce milk for their babies.","zh":"人类是哺乳动物，因为母亲会为婴儿分泌乳汁。"},{"en":"Mammiferous glands are commonly called mammary glands.","zh":"泌乳腺通常被称为乳腺。"}]}],"synonyms":["mammalian","lactating","milk-producing"],"phonetic":"/mæˈmɪfərəs/","extraExplanation":["这个词比较少见，常出现在生物学/医学等较正式的语境中。日常英语更常用的说法是：mammalian（哺乳动物的）或 lactating（正在泌乳的）。","词源上，mammiferous = mammi-（乳房/乳腺，来自拉丁语 mamma）+ -ferous（“携带/产生”，如 carboniferous“含碳的”、odoriferous“有气味的”）。因此它字面意思就是“产奶/带乳腺的”。"]}
{"word":"mammiform","summary":{"en":"Mammiform means breast-shaped, used mainly in medical or biological descriptions.","zh":"mammiform 意为“乳房状的”，多用于医学或生物学的形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Breast-shaped; having a rounded form like a breast or nipple.","zh":"乳房状的；呈乳头/乳房般圆隆形的。"},"examples":[{"en":"The scan showed a mammiform mass on the surface of the organ.","zh":"扫描显示器官表面有一个乳房状的肿块。"},{"en":"Some plants produce mammiform bumps on their leaves.","zh":"有些植物的叶片上会长出乳房状的突起。"}]}],"synonyms":["breast-shaped","mammary-shaped","nipple-like"],"phonetic":"/ˈmæmɪˌfɔrm/","extraExplanation":["词源：来自拉丁语 *mamma*（乳房）+ *-form*（形状）。常见于医学与生物学描述，用来形容“像乳房一样圆隆/突起”的外观。","近义表达在学术语境中常见：*mammary-shaped*（乳腺/乳房形的）、*nipple-like*（乳头状的）；在肿瘤影像或病理描述里也可能与 *papillary*（乳头状的）一起出现，但两者并不总是同义。"]}
{"word":"mammilate","summary":{"en":"Mammilate describes something with rounded, nipple-like bumps; it’s a technical term used in fields like medicine and geology.","zh":"Mammilate 指“带有乳头状圆形突起”的外形，是医学、地质等领域常见的专业描述词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one or more rounded, nipple-like bumps; shaped like a breast (used mainly in medicine, biology, and geology).","zh":"具有一个或多个乳头状的圆形突起；呈乳房状（多用于医学、生物学、地质学等语境）。"},"examples":[{"en":"The radiologist noted a mammilate contour on the surface of the mass.","zh":"放射科医生指出该肿块表面呈乳头状的轮廓。"},{"en":"Some mineral samples show a mammilate texture with small rounded knobs.","zh":"一些矿物标本呈现乳房状（乳头状）结构，带有小的圆形突起。"}]},{"partOfSpeech":"v.","definition":{"en":"To form into, or develop, nipple-like projections (rare).","zh":"使形成（或发展出）乳头状突起（较少见）。"},"examples":[{"en":"Over time, the surface may mammilate as deposits build up unevenly.","zh":"随着时间推移，沉积物不均匀堆积，表面可能会逐渐形成乳头状突起。"}]}],"synonyms":["nipple-like","papillate","mammillated","knobbed"],"phonetic":"/ˈmæməˌleɪt/","extraExplanation":["词源来自拉丁语 mammilla（“乳头/小乳房”），因此 mammilate 常用于描述“像乳头一样凸起”的外形，属于较专业、较少在日常口语中出现的词。"]}
{"word":"mammilated","summary":{"en":"Mammilated describes a surface covered with small, rounded, nipple-like bumps, often used in scientific description.","zh":"mammilated 指表面布满小而圆的乳头状突起，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small, rounded, nipple-like bumps or projections on the surface.","zh":"表面有小而圆的乳头状突起的；呈乳突状的。"},"examples":[{"en":"The fossil showed a mammilated surface with many tiny rounded bumps.","zh":"这块化石的表面呈乳突状，有许多细小的圆形凸起。"},{"en":"Under the microscope, the shell appeared mammilated rather than smooth.","zh":"在显微镜下，这个贝壳看起来是乳突状的，而不是光滑的。"}]}],"synonyms":["mammillated","nippled","tuberculate","nodular","bumpy"],"phonetic":"/məˈmɪleɪtɪd/","extraExplanation":["这是一个较少见、偏科学写作的形容词，常见于解剖学、动物学、植物学、地质学等描述“表面形态”的语境。","词源来自拉丁语 mamilla（“乳头、小乳突”）。拼写上也常见 mammillated（双写 l 的形式更常用）；mammilated 可视为变体拼写。"]}
{"word":"mammilla","summary":{"en":"Mammilla is a medical/anatomical word meaning “nipple,” or more generally a small nipple-like projection.","zh":"mammilla 是医学/解剖学用语，意思是“乳头”，也可泛指“乳头状小突起”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nipple; the small raised part on a breast (anatomy)","zh":"乳头；乳房上突起的小部分（解剖学）"},"examples":[{"en":"In anatomy class, we learned that the mammilla is another word for the nipple.","zh":"在解剖课上，我们学到 mammilla 是“乳头”的另一种说法。"},{"en":"The doctor examined the mammilla for signs of irritation.","zh":"医生检查乳头是否有刺激或发炎的迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"a small nipple-like bump or projection on the body or on an organ","zh":"（身体或器官上的）乳头状小突起"},"examples":[{"en":"The report described several small mammillae on the surface of the tissue.","zh":"报告描述了该组织表面有几个乳头状小突起。"},{"en":"Some glands have a mammilla-like projection where fluid exits.","zh":"有些腺体在液体排出的部位会有乳头状突起。"}]}],"synonyms":["nipple","papilla","protuberance"],"phonetic":"/məˈmɪlə/","extraExplanation":["这个词比较偏医学/解剖学语境，日常英语更常用的是 nipple。","词源来自拉丁语 mammilla（“小乳房/乳头”），与 mammary（乳腺的）同源。写作时常见复数形式 mammillae（更学术）。"]}
{"word":"mammillae","summary":{"en":"Mammillae is the plural of mammilla, meaning small nipple-like projections—often referring to the brain’s mammillary bodies.","zh":"mammillae 是 mammilla 的复数，指乳头样小突起；常特指大脑的乳头体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) small nipple-like projections in anatomy; most commonly refers to the mammillary bodies—two small rounded structures on the underside of the brain involved in memory.","zh":"（复数）解剖学中的“乳头样小突起”；最常见指大脑底部的一对乳头体（mammillary bodies），与记忆功能有关。"},"examples":[{"en":"Damage to the mammillae can affect memory and learning.","zh":"乳头体受损可能影响记忆与学习。"},{"en":"On the MRI, the doctor checked the mammillae for signs of injury.","zh":"在核磁共振影像上，医生检查乳头体是否有受伤迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) small nipple-like structures on an organ or surface, especially in medical or biological descriptions.","zh":"（复数）器官或表面上的乳头状小结构，常用于医学或生物学描述。"},"examples":[{"en":"The report noted tiny mammillae on the surface of the tissue.","zh":"报告提到该组织表面有细小的乳头状突起。"},{"en":"Some animals have mammillae that help guide milk to the young.","zh":"有些动物的乳头状结构有助于将乳汁导向幼崽。"}]}],"synonyms":["mammillary bodies (in the brain)","nipple-like projections","papillae (sometimes, depending on context)"],"phonetic":"/məˈmɪliː/","extraExplanation":["“mammillae”来自拉丁语：单数是 mammilla，复数常用 -ae 结尾（读音常近似“ee”）。在现代医学里最常见的搭配是 mammillary bodies（乳头体），所以你在神经解剖、影像学报告中更容易见到这个用法。","注意不要与更常见的英语词 nipple（乳头）混用：mammillae 更偏医学/解剖的书面表达。"]}
{"word":"mammillaplasty","summary":{"en":"A medical term for surgery to reshape or reconstruct the nipple and/or areola.","zh":"指对乳头和/或乳晕进行重塑或重建的外科手术（医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure to reshape, repair, reduce, or reconstruct the nipple and/or areola (the darker skin around the nipple).","zh":"一种用于重塑、修复、缩小或重建乳头和/或乳晕（乳头周围较深色皮肤）的外科手术。"},"examples":[{"en":"After the injury healed, the surgeon discussed whether mammillaplasty could improve the shape of the nipple.","zh":"伤口愈合后，外科医生讨论乳头整形术是否能改善乳头的形态。"},{"en":"Mammillaplasty is sometimes performed as part of breast reconstruction after mastectomy.","zh":"乳头整形术有时会作为乳房切除术后乳房重建的一部分进行。"}]}],"synonyms":["nipple reconstruction","areola reconstruction","nipple surgery"],"phonetic":"/ˌmæmɪləˈplæsti/","extraExplanation":["词源：mammilla- 来自拉丁语，意为“乳头/小乳房”，-plasty 表示“整形、修复的外科手术”。因此 mammillaplasty 直译为“乳头整形术”。","使用场景：该词多见于医学病历、整形外科或乳房重建相关资料中，日常口语里更常说 “nipple surgery / nipple reconstruction / areola surgery”。","学习提示：注意与更常见的术语区分——mastoplasty（乳房整形/乳房手术，范围更大）、mammoplasty（乳房整形，通常指隆胸/缩胸等）不等同于 mammillaplasty（乳头/乳晕层面的手术）。"]}
{"word":"mammillar","summary":{"en":"Mammillar means “breast/nipple-related” or “nipple-shaped,” used mostly in medical or anatomy contexts.","zh":"mammillar 指“与乳房/乳头有关的”或“乳头状的”，多用于医学与解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the breast or nipple; shaped like a small rounded projection (a “nipple-like” bump).","zh":"乳房的；乳头的；乳头状的（像小突起一样的圆锥/圆顶状）。"},"examples":[{"en":"The scan showed a small mammillar projection on the surface of the tissue.","zh":"影像检查显示该组织表面有一个小的乳头状突起。"},{"en":"In anatomy, some structures are described as mammillar because of their nipple-like shape.","zh":"在解剖学中，一些结构会因其乳头状外形而被描述为“mammillar”。"}]}],"synonyms":["mammillary","nipple-like","papillary (similar idea in biology)"],"phonetic":"/məˈmɪlər/","extraExplanation":["“mammillar”多见于医学、解剖学和生物学语境，较少用于日常英语。它来自拉丁语词根 mamm-（乳房）以及表示“……的/相关的”的形容词后缀。","相关术语：mammilla（乳头/乳状小突起）、mammillary（更常见的同义形容词，尤其用于“mammillary body/乳头体”等解剖结构）。"]}
{"word":"mammillaria","summary":{"en":"Mammillaria is a genus of small cacti often kept as houseplants.","zh":"Mammillaria 指乳突球属，一类常见的小型盆栽仙人掌属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, often round or cylindrical cacti, many of which have clusters of spines and small flowers; commonly grown as houseplants","zh":"乳突球属（仙人掌科）：一类小型仙人掌，常呈球形或圆柱形，带成簇刺与小花，常作为盆栽观赏植物"},"examples":[{"en":"I keep a Mammillaria on my windowsill because it stays small and blooms easily.","zh":"我在窗台上养了一盆乳突球属的仙人掌，因为它体型小，而且容易开花。"},{"en":"The nursery labeled it as Mammillaria, a popular cactus genus for beginners.","zh":"苗圃把它标为 Mammillaria（乳突球属），这是很适合新手的热门仙人掌属。"}]}],"synonyms":["pincushion cactus (common name for many species)"],"phonetic":"ˌmæmɪˈlɛəriə","extraExplanation":["词源提示：Mammillaria 来自拉丁语 mammilla，意为“乳头、乳突”，指这类仙人掌表面常见的“乳突状小疙瘩”（tubercles），刺和花常从这些突起处长出。","使用场景：在英语里它多见于园艺、植物百科、植物爱好者交流中；日常口语里也常用更通俗的名字，如 pincushion cactus（针垫仙人掌，常指其中一些种）。"]}
{"word":"mammillary","summary":{"en":"Mammillary means “breast/nipple-related” or “nipple-like,” used mainly in medical or anatomy contexts.","zh":"mammillary 指“与乳房/乳头有关”或“乳头状的”，主要用于医学和解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the breast or nipple; in anatomy, shaped like or associated with a small nipple-like projection.","zh":"（解剖）与乳房或乳头有关的；呈乳头状突起的。"},"examples":[{"en":"The doctor noted mammillary changes during the breast exam.","zh":"医生在乳房检查时注意到乳头周围的变化。"},{"en":"In anatomy class, we learned about the mammillary bodies in the brain.","zh":"在解剖课上，我们学习了大脑中的乳头体。"}]}],"synonyms":["breast-related","nipple-like","papillary (context-dependent)"],"phonetic":"/məˈmɪləri/","extraExplanation":["“mammillary”常见于医学/解剖学语境，来自拉丁语 mamma（乳房）。日常英语里更常用 breast-related（与乳房有关的）或 nipple-like（乳头状的）来表达。","mammillary bodies（乳头体）是大脑下丘脑附近的一对结构，与记忆相关；在神经科学或医学影像报告中较常出现。"]}
{"word":"mammillate","summary":{"en":"Mammillate describes something that has nipple-like bumps or a nipple-shaped form.","zh":"mammillate 用来形容“乳头状的”，即表面有乳头般的突起或形状呈乳头状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Botany) Having small, nipple-like projections; shaped like a nipple.","zh":"（解剖/植物）有乳头状小突起的；呈乳头状的。"},"examples":[{"en":"The surface of the seed was mammillate, with tiny rounded bumps.","zh":"这颗种子的表面呈乳头状，有许多细小的圆形突起。"},{"en":"In some plants, a mammillate texture helps describe the leaf or fruit surface.","zh":"在一些植物描述中，“乳头状”的质地可用来形容叶片或果实表面。"}]}],"synonyms":["nipple-shaped","papillate","tuberculate"],"phonetic":"/məˈmɪl.eɪt/","extraExplanation":["词源来自拉丁语 mamilla（“乳头”）+ -ate（形容词后缀），常见于医学、解剖学与植物学的形态描述，属于较偏学术/专业用词。"]}
{"word":"mammillated","summary":{"en":"Mammillated describes a surface covered with small, rounded, nipple-like bumps, often used in biology and geology.","zh":"mammillated 指表面布满小而圆的乳头状突起，常见于生物学和地质学的专业描述中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having small, rounded, nipple-like bumps or projections on the surface","zh":"表面有乳头状（小而圆的）突起的；呈乳突状的"},"examples":[{"en":"Under the microscope, the seed coat looks mammillated.","zh":"在显微镜下，种皮看起来呈乳突状。"},{"en":"The ancient pottery had a mammillated texture you could feel with your fingers.","zh":"那件古陶器的表面有乳突状纹理，用手指能摸出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(geology) shaped with rounded hill-like knobs, as if covered in small mounds","zh":"（地质）呈圆丘状隆起的；像布满小土包一样的"},"examples":[{"en":"The lava field cooled into a mammillated surface of rounded knobs.","zh":"那片熔岩原冷却后形成了布满圆形隆起的乳突状表面。"}]}],"synonyms":["bumpy","knobby","nodular","nippled","protuberant"],"phonetic":"/məˈmɪl.eɪ.tɪd/","extraExplanation":["词源：来自拉丁语 *mamilla*（“乳头；小乳房”），因此这个词常用于描述“像乳头一样凸起”的表面形态。","使用场景：在日常英语中较少见，更常出现在生物学（如种子、果实、贝壳表面）和地质学（如熔岩、岩石表面形态）的描述里。","近义表达（更常用）：在一般写作中，常用 *bumpy*（凹凸不平的）、*knobby*（多瘤状突起的）、*nodular*（结节状的）来替代，以适应非专业读者。"]}
{"word":"mammillation","summary":{"en":"Mammillation means a surface pattern of small, rounded, nipple-like bumps or projections.","zh":"mammillation 指表面呈现许多小而圆、类似乳头的凸起或起伏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or feature of having small, rounded, nipple-like bumps or projections; a pattern of rounded protuberances","zh":"（表面）呈乳头状凸起的特征；乳突状起伏（由许多小而圆的突起组成的形态）"},"examples":[{"en":"The surface of the rock showed mammillation after years of weathering.","zh":"这块岩石的表面经过多年的风化后呈现出乳突状起伏。"},{"en":"Under the microscope, the tissue had fine mammillation along the edge.","zh":"在显微镜下，这些组织边缘有细微的乳突状凸起。"}]}],"synonyms":["protuberance","bumpiness","nodulation","tuberculation"],"phonetic":"/ˌmæməˈleɪʃən/","extraExplanation":["词源来自拉丁语 *mammilla*（“乳头、小乳房”）。因此它常用来描述“像乳头一样的圆形小突起”，在医学、解剖学、地质学或材料表面描述中偶尔会出现，是比较偏专业、偏书面的词。"]}
{"word":"mammilliform","summary":{"en":"Mammilliform means “nipple-shaped” or “having nipple-like projections,” often used in medical or scientific descriptions.","zh":"mammilliform 指“乳头状的/有乳头状突起的”，多用于医学或科学描述形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a structure) shaped like a small nipple or rounded projection; having nipple-like bumps.","zh":"（指结构）呈乳头状的；有乳头状小突起的。"},"examples":[{"en":"The botanist noted mammilliform bumps on the surface of the cactus.","zh":"植物学家注意到仙人掌表面有乳头状的小突起。"},{"en":"On imaging, the lesion appeared as a mammilliform projection from the wall.","zh":"在影像检查中，该病灶表现为壁面上的乳头状突起。"},{"en":"Some shells have a mammilliform tip at the apex.","zh":"有些贝壳在顶端有乳头状的尖部。"}]}],"synonyms":["nipple-shaped","papillary","mamillated","tuberculate"],"phonetic":"/məˈmɪlɪˌfɔrm/","extraExplanation":["词源上来自拉丁语 mammilla（“小乳房/乳头”）+ -form（“……形状的”）。因此它常用于医学影像、病理学、解剖学与植物学等场景，描述“乳头样/乳突样”的外形。","在医学语境中，mammilliform 通常是纯粹的形态学描述，不带褒贬；中文常对应“乳头状”“乳突状”。"]}
{"word":"mammilloid","summary":{"en":"“Mammilloid” means nipple-shaped or having small rounded nipple-like projections, used mainly in scientific/medical descriptions.","zh":"“mammilloid”指“乳头状的/似乳突的”，主要用于医学或科学描述形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a nipple or a small rounded bump; having nipple-like projections.","zh":"乳头状的；像小乳突一样凸起的。"},"examples":[{"en":"Under the microscope, the surface looks mammilloid, with many tiny rounded bumps.","zh":"在显微镜下，表面呈乳头状，有许多细小的圆形突起。"},{"en":"The radiology report mentioned a mammilloid contour along the edge of the lesion.","zh":"影像学报告提到病灶边缘呈乳头状轮廓。"}]}],"synonyms":["nipple-shaped","papillary","mammillary"],"phonetic":"/məˈmɪlɔɪd/","extraExplanation":["该词多见于医学、解剖学、病理学与影像学等语境，用来描述形态“像乳头一样的突起”。词源上与拉丁语词根 mammilla（乳头）有关，后缀 -oid 表示“……状/类似”。"]}
{"word":"mammilloplasty","summary":{"en":"Mammilloplasty is surgery to reshape or reconstruct the nipple.","zh":"mammilloplasty 指“乳头整形/重建手术”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure to reshape, reconstruct, reduce, or restore the nipple (mammilla), often as part of breast surgery or reconstructive/plastic surgery.","zh":"乳头整形术：对乳头（mammilla）进行重塑、重建、缩小或修复的外科手术，常见于乳房手术或整形/重建手术的一部分。"},"examples":[{"en":"After breast reconstruction, the patient chose mammilloplasty to recreate the nipple shape.","zh":"乳房重建后，这位患者选择做乳头整形术来重建乳头外形。"},{"en":"The surgeon explained that mammilloplasty can adjust the size and projection of the nipple.","zh":"外科医生解释说，乳头整形术可以调整乳头的大小和突出度。"}]}],"synonyms":["nipple reconstruction","nipple repair surgery","nipple reduction"],"phonetic":"/məˈmɪləˌplæsti/","extraExplanation":["词源提示：mammilla 在拉丁语中意为“乳头/小乳房”，-plasty 表示“整形、重建的外科手术”（如 rhinoplasty 鼻整形）。","医学语境中，它常与乳房重建（例如乳腺癌手术后）相关，也可能用于先天或外伤后的乳头形态修复。属于专业医疗术语，日常英语中不常见。","涉及手术风险与预期效果（疤痕、感觉变化、对称性等），通常需要由合格医生评估并充分知情同意。"]}
{"word":"mammin","summary":{"en":"**mammin** is not a standard spelling; you probably mean **mammon**: wealth or money viewed as something people worship too much (often negative).","zh":"**mammin** 不是标准拼写；你可能想写 **mammon**：被视为让人过度崇拜的“金钱/财富”（常带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of **mammon**) Wealth or material possessions, especially when seen as a force that makes people too greedy or too focused on money.","zh":"（多半是 **mammon** 的误拼）“财富/金钱”，尤指被视为会让人变得贪婪、过度崇拜金钱的东西（带贬义）。"},"examples":[{"en":"He sacrificed his health in the pursuit of mammon.","zh":"他为了追逐金钱，牺牲了健康。"},{"en":"The story warns against choosing mammon over family.","zh":"这个故事警告人们不要把金钱置于家庭之上。"}]}],"synonyms":["materialism","greed","the love of money","wealth (neutral)"],"phonetic":"/ˈmæmən/","extraExplanation":["“Mammon”源自《圣经》传统，用来指“金钱/财富的偶像”，常出现在道德劝诫语境中，如“serve God or Mammon（侍奉上帝或金钱）”。因此它通常不是中性词，而是批评“拜金主义、贪婪”的用法。","如果你想表达中性“金钱/财富”，更常用 money / wealth；如果要表达“过度追钱”，可用 greed / materialism / the love of money。"]}
{"word":"mammitides","summary":{"en":"Mammitides are pock-like, nipple-shaped bumps found on lava or volcanic rock surfaces (plural).","zh":"mammitides 指火山熔岩或火山岩表面出现的乳头状、疱状小凸起（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pock-like, nipple-shaped bumps on the surface of lava or volcanic rock (plural form).","zh":"（复数）火山熔岩或火山岩表面呈乳头状/疱状的凸起（或小鼓包）。"},"examples":[{"en":"The basalt shows many mammitides, suggesting the lava surface cooled unevenly.","zh":"这块玄武岩表面有许多 mammitides，说明熔岩表层冷却不均匀。"},{"en":"In the field notes, she described mammitides on the underside of an old lava flow.","zh":"在野外记录里，她描述了古老熔岩流底部的 mammitides。"}]}],"synonyms":["mammitis (singular)","mammillations","lava blisters"],"phonetic":"ˈmæmɪtaɪdz","extraExplanation":["这是一个非常少见、偏火山学/岩石学的术语。单数常写作 **mammitis**，而 **mammitides** 是其复数形式。","词源上与拉丁语 *mamma*（乳房）有关，用来比喻“乳头状的突起”；结尾 **-ides** 常见于学术词汇里表示复数或某类事物（在一些学科中会出现类似构词）。","容易与日常词汇混淆：它不是 *mammoth*（猛犸象），也不是 *marmite*（英式酵母酱/也可指“锅”）。在一般英语写作中几乎不会用到。"]}
{"word":"mammitis","summary":{"en":"Mammitis means inflammation of the mammary gland, especially in animals (often the same as mastitis).","zh":"mammitis 指乳腺炎（乳房/产奶腺体的炎症），多用于动物，常与 mastitis 同义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"inflammation of the mammary gland (the milk-producing gland), especially in animals such as cows; it can cause swelling, pain, and reduced milk production","zh":"乳腺炎；乳房（产奶腺体）的炎症，尤指奶牛等动物，常见症状包括肿胀、疼痛以及产奶量下降"},"examples":[{"en":"The veterinarian diagnosed the cow with mammitis and started treatment right away.","zh":"兽医诊断这头奶牛患有乳腺炎，并立即开始治疗。"},{"en":"Good hygiene during milking helps prevent mammitis.","zh":"挤奶时保持良好卫生有助于预防乳腺炎。"}]}],"synonyms":["mastitis","mammary inflammation"],"phonetic":"/mæˈmaɪtɪs/","extraExplanation":["“mammitis”是较少见、偏旧或偏专业的词；现代农业与兽医学里更常用“mastitis（乳腺炎）”。","该词常出现在奶牛养殖与乳品行业的语境中；预防通常强调挤奶卫生、正确挤奶流程与及时处理感染。"]}
{"word":"mammock","summary":{"en":"Mammock is a rare, old-fashioned verb meaning to chew or devour something roughly and greedily.","zh":"mammock 是一个少见的古英语动词，意思是粗鲁、贪婪地咀嚼或吞吃。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) to chew or devour something noisily and greedily; to munch up roughly.","zh":"（古义）大声、贪婪地咀嚼或吞吃；粗鲁地啃吃。"},"examples":[{"en":"The hungry dog mammocked the bone in seconds.","zh":"那只饿狗几秒钟就把骨头咬得咯吱作响、啃完了。"},{"en":"In old writing, soldiers may be described as mammocking their rations.","zh":"在旧文学里，士兵有时会被写成“狼吞虎咽地啃吃口粮”。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, literary) to tear something to pieces while eating; to mangle in the mouth.","zh":"（罕见，文学）边吃边撕扯得稀烂；在口中嚼得乱七八糟。"},"examples":[{"en":"He mammocked the bread, leaving crumbs everywhere.","zh":"他把面包嚼得稀烂，掉得满地都是碎屑。"}]}],"synonyms":["munch","gnaw","chew","devour","gobble"],"phonetic":"/ˈmæmək/","extraExplanation":["“mammock”在现代英语里非常少见，多见于古文或文学化用法。它和“mouth/maw（口、咽喉）”这类词在感觉上有关联，用来强调“狼吞虎咽、粗鲁地嚼”。","很多学习者会把“mammock”和常用词“hammock（吊床）”混淆；“hammock”的拼写和意义都不同。如果你本来想查“hammock”，告诉我我可以给你那条词条。"]}
{"word":"mammocked","summary":{"en":"“Mammocked” is an archaic word meaning “torn or mangled into pieces,” or the past form of “mammock” (to tear/shred).","zh":"“mammocked”是古语，意思是“被撕碎/扯烂、弄得支离破碎的”，也可作动词 mammock（撕碎、扯烂）的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Torn into pieces; badly shredded or mangled.","zh":"（古语）被撕成碎片的；被扯烂、弄得很破碎的。"},"examples":[{"en":"The letter was mammocked and hard to read after the dog found it.","zh":"那封信被狗叼到后撕得稀巴烂，几乎看不清了。"},{"en":"After the storm, the sails looked mammocked along the edges.","zh":"暴风雨过后，船帆边缘被扯得破破烂烂。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of mammock: to tear, shred, or mangle (something) into pieces.","zh":"mammock 的过去式/过去分词：把（某物）撕碎、扯烂、弄得支离破碎。"},"examples":[{"en":"The rough handling mammocked the fragile paper bag.","zh":"粗暴的搬弄把那只薄纸袋扯得稀烂。"},{"en":"He mammocked the old cloth into strips for cleaning.","zh":"他把旧布撕成布条用来擦拭。"}]}],"synonyms":["torn","shredded","ripped up","mangled","tattered"],"phonetic":"/ˈmæməkt/","extraExplanation":["“mammocked”多见于古英语/文学语境，现代日常英语里很少用，更常用的表达是 “torn to pieces / shredded / ripped up / mangled”。","这个词常被认为带有莎士比亚时期的色彩：在《科利奥兰纳斯》(Coriolanus) 中出现过 “mammocked”。读到它时，可把语气理解为更生动、更粗暴的“撕烂”。"]}
{"word":"mammocking","summary":{"en":"Mammocking means tearing or mangling something into rough pieces (an archaic form).","zh":"Mammocking 指把东西粗暴地撕碎或弄得破破烂烂（较古老的用法）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) tearing, cutting, or mangling something roughly into pieces (the -ing form of **mammock**).","zh":"（古语）粗暴地把某物撕碎、砍碎或弄得破破烂烂（动词 **mammock** 的 -ing 形式）。"},"examples":[{"en":"Stop **mammocking** the paper—use scissors if you want neat edges.","zh":"别再把纸乱撕得稀巴烂了——想要整齐边缘就用剪刀。"},{"en":"The dog came back **mammocking** the toy, with stuffing everywhere.","zh":"狗叼回玩具时把它咬得稀巴烂，棉絮到处都是。"},{"en":"In older writing, you may see words like **mammocking** to describe brutal, messy tearing.","zh":"在较旧的写作里，你可能会看到 **mammocking** 这类词，用来形容残暴、凌乱的撕扯。"}]}],"synonyms":["tear up","rip apart","shred","mangle","hack to pieces"],"phonetic":"/ˈmæm.əkɪŋ/","extraExplanation":["**mammock / mammocking** 属于比较少见的古语/方言用词，在现代英语里不常用；日常更常用 **tear up, rip apart, shred, mangle** 等。","这个词常被提到是因为出现在莎士比亚等早期英语作品中（读经典文学时更容易遇到）。"]}
{"word":"mammocks","summary":{"en":"Mammocks are small raised, often wooded patches of dry land in wetlands (a regional word similar to hammock/hummock).","zh":"mammocks 指湿地里略微隆起、常有树林的小块干地（地区用词，近似 hammock/hummock）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly Southeastern U.S.) A small, slightly raised area of ground—often a wooded “island” in a swamp or marsh; a kind of hammock/hummock.","zh":"（主要见于美国东南部）沼泽或湿地里略微隆起的一小块地面，常长有树木，像“树岛”；类似 hammock/hummock（林地小丘）。"},"examples":[{"en":"Alligators often rest in the water, while deer may stay on the mammocks.","zh":"短吻鳄常在水里休息，而鹿可能会待在那些隆起的林地小丘上。"},{"en":"The trail crosses wetlands and then climbs onto a dry mammock with oak trees.","zh":"小路穿过湿地，然后爬上一处长着橡树的干燥小丘。"}]}],"synonyms":["hammocks","hummocks","knolls","islets (in a marsh)"],"phonetic":"/ˈmæmək/","extraExplanation":["“mammock”在现代英语里较少见，更多出现在地方性写作、自然记录或地名语境中，尤其与美国东南部的湿地景观有关。","它与“hammock（林地小丘/树岛）”和“hummock（小土丘/小隆起）”意义接近；阅读时可用这两个更常见的词来辅助理解。"]}
{"word":"mammodi","summary":{"en":"“mammodi” isn’t a standard English word; it’s likely a misspelling or a name. Provide context to identify the intended meaning.","zh":"“mammodi” 不是标准英语词，可能是拼写错误或专有名词；请提供上下文以确认想表达的意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a proper name (e.g., a place or a person’s name). Common close spellings include “mammoth” (very large) or “Mamoudzou/Mamoudi” (place names).","zh":"不是标准英语单词，可能是拼写错误或专有名词（如地名、人名）。常见相近拼写包括 “mammoth”（巨大）或 “Mamoudzou/Mamoudi”（地名）。"},"examples":[{"en":"I couldn’t find “mammodi” in an English dictionary—did you mean “mammoth”?","zh":"我在英语词典里找不到 “mammodi”——你是不是想写 “mammoth”（巨大）？"},{"en":"If “Mammodi” is a name, please share the sentence it appears in so I can explain it accurately.","zh":"如果 “Mammodi” 是一个名字，请把它出现的句子发给我，我才能更准确地解释。"}]}],"phonetic":"/ˈmæmədi/","extraExplanation":["“mammodi” 看起来更像是拼写输入时的误差。最常见的相近英文词是 **mammoth**（形容词/名词：巨大的；猛犸象）。如果你能提供上下文（完整句子、主题、来自哪里），我可以帮你确认到底是哪一个词或专有名词。"]}
{"word":"mammogen","summary":{"en":"“Mammogen” means a substance (or describing a substance) that promotes mammary gland growth and development.","zh":"mammogen 指（或形容）能促进乳腺生长与发育的物质/因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hormone or other substance that stimulates the growth and development of mammary (breast) tissue.","zh":"（生物/医学）促使乳腺（乳房）组织生长与发育的激素或其他物质；促乳腺生长因子。"},"examples":[{"en":"During puberty, several mammogens help the mammary glands develop.","zh":"在青春期，多种促乳腺生长因子会帮助乳腺发育。"},{"en":"Researchers tested whether this drug has mammogen-like effects in mice.","zh":"研究人员测试这种药物在小鼠中是否具有类似促乳腺生长因子的作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"stimulating the growth or development of mammary tissue.","zh":"（生物/医学）促乳腺生长的；促进乳腺发育的。"},"examples":[{"en":"Estrogen is often described as having mammogen activity.","zh":"雌激素常被描述为具有促乳腺生长的活性。"},{"en":"The paper discusses mammogen signals in breast development.","zh":"这篇论文讨论了乳腺发育中的促乳腺生长信号。"}]}],"synonyms":["mammogenic hormone","mammary growth factor","mammogenic factor"],"phonetic":"/ˈmæməˌdʒɛn/","extraExplanation":["这个词多见于生物学、内分泌学和乳腺发育研究中，日常英语里很少用。","常与 lactogen（促泌乳/促进产乳的，如催乳素 prolactin）区分：mammogen 更偏向“让乳腺长起来/发育起来”，lactogen 更偏向“让乳腺分泌乳汁”。","词源上 mamm- 来自拉丁语“乳房/乳腺”，-gen 表示“产生/促成”。"]}
{"word":"mammogenic","summary":{"en":"Mammogenic describes something that promotes the growth or development of mammary (breast) tissue.","zh":"mammogenic 指“促乳腺发育的”，即促进乳腺（乳房）组织生长与发育。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, medicine) Causing or promoting the growth and development of mammary (breast) tissue.","zh":"（生物/医学）促使或促进乳腺（乳房）组织生长与发育的。"},"examples":[{"en":"Prolactin is considered a key mammogenic hormone in many mammals.","zh":"在许多哺乳动物中，催乳素被认为是一种关键的促乳腺发育激素。"},{"en":"Researchers tested whether the compound had mammogenic effects in laboratory animals.","zh":"研究人员检测该化合物是否会在实验动物中产生促乳腺发育的作用。"}]}],"synonyms":["mammotrophic","galactopoietic (related, often milk-production context)"],"phonetic":"/ˌmæməˈdʒɛnɪk/","extraExplanation":["这个词多见于学术论文（内分泌学、乳腺生物学、毒理学等），日常英语中很少使用。它由 mamm(o)-（乳房/乳腺）+ -genic（产生……的、引起……的）构成，常用于搭配 mammogenic hormone / mammogenic effect / mammogenic activity。","注意不要和 carcinogenic（致癌的）混淆；mammogenic 指“促进乳腺发育”，并不等同于“致癌”。在某些研究语境中，作者可能会讨论某物质既有 mammogenic 作用，也可能与肿瘤风险相关，但这取决于具体研究结论。"]}
{"word":"mammogenically","summary":{"en":"A rare scientific adverb meaning “in a way that promotes or relates to mammary (breast) tissue development.”","zh":"一个少见的科研用副词，表示“以促进或涉及乳腺（乳房）组织发育的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the formation, development, or stimulation of mammary (breast) tissue; in a mammary-gland–producing or mammary-development way (used mainly in scientific writing).","zh":"以与乳腺（乳房）组织的形成、发育或刺激相关的方式；以促使乳腺生成/发育的方式（多用于科研语境）。"},"examples":[{"en":"The hormone acted mammogenically in the animal model, increasing mammary tissue growth.","zh":"在动物模型中，该激素表现出促乳腺发育的作用，使乳腺组织生长增加。"},{"en":"Researchers measured whether the compound would behave mammogenically at low doses.","zh":"研究人员测量该化合物在低剂量下是否会呈现促乳腺发育的效应。"}]}],"synonyms":["in a mammary-development way","in a way that promotes mammary growth","mammary-developmentally"],"phonetic":"ˌmæməˈdʒɛnɪkli","extraExplanation":["这是一个非常少见、偏专业的副词，常见于内分泌学、发育生物学、毒理学等论文中。","构词：mammo-（乳房/乳腺）+ -genic（产生……的/促成……的）+ -ally（副词后缀）。因此整体意思是“以促成乳腺生成/发育的方式”。","日常英语里几乎不用；更常见的替代表达是 in a mammary-development way / in a way that promotes mammary growth。"]}
{"word":"mammogram","summary":{"en":"A mammogram is an X-ray image of the breast used to screen for or diagnose breast problems, especially breast cancer.","zh":"mammogram 指乳房X光检查/乳房X光片，用于筛查或诊断乳房问题，尤其是乳腺癌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an X-ray picture of the breast used to check for signs of breast cancer or other changes","zh":"乳房X光片；用于检查乳腺癌或其他变化的乳房X光检查（影像）"},"examples":[{"en":"She scheduled a mammogram as part of her annual health checkup.","zh":"她把乳房X光检查安排在年度体检中。"},{"en":"The doctor recommended a mammogram after she noticed a lump.","zh":"她发现肿块后，医生建议做乳房X光检查。"}]}],"synonyms":["breast X-ray","mammography (method)"],"phonetic":"/ˈmæməˌɡræm/","extraExplanation":["“mammogram”由“mamm(o)-（乳房）+ -gram（记录/影像）”组成，字面意思是“乳房的影像记录”。","在美国英语里，mammogram通常指“检查/拍片”这件事本身，也常指“拍出来的片子”。日常表达中常说“get a mammogram（做乳腺X光检查）”或“have a mammogram”。","与之相关的词：mammography（乳腺X光摄影术/检查方法，较正式）、screening mammogram（筛查性乳腺X光）、diagnostic mammogram（诊断性乳腺X光）。"]}
{"word":"mammographic","summary":{"en":"An adjective meaning “related to mammography (breast X-ray imaging).”","zh":"形容词：表示“与乳腺X线摄影（乳房X光成像检查）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to mammography (a medical imaging test that uses low-dose X-rays to examine the breast, often for screening or diagnosing breast disease).","zh":"与乳腺X线摄影（乳房的低剂量X光成像检查，常用于筛查或诊断乳腺疾病）有关的；乳腺X线摄影的。"},"examples":[{"en":"The clinic offers mammographic screening for women over 40.","zh":"该诊所为40岁以上女性提供乳腺X线筛查。"},{"en":"The report describes mammographic findings that need follow-up tests.","zh":"报告描述了需要进一步检查的乳腺X线影像发现。"}]}],"synonyms":["mammography-related","mammogram-related"],"phonetic":"/ˌmæməˈɡræfɪk/","extraExplanation":["“mammographic”来自“mammography（乳腺X线摄影）”，其中“mammo-”与乳房有关，“-graphy”表示“记录/成像/描绘”。在医疗语境里常见搭配有：mammographic screening（乳腺X线筛查）、mammographic image（乳腺X线影像）、mammographic findings（乳腺X线所见）。","这是医学专业/正式用语，日常英语里更常直接说“a mammogram（一次乳腺X线检查）”或“mammogram results（检查结果）”。"]}
{"word":"mammographies","summary":{"en":"“Mammographies” means breast X-ray exams (plural of mammography).","zh":"“Mammographies”指乳房X光检查（mammography 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"X-ray imaging tests of the breast (plural of mammography), used to screen for or help diagnose breast conditions, including breast cancer.","zh":"乳房X光检查（mammography 的复数），用于筛查或辅助诊断乳房疾病，包括乳腺癌。"},"examples":[{"en":"Many clinics recommend regular mammographies for women over a certain age.","zh":"许多诊所建议达到一定年龄的女性定期做乳房X光检查。"},{"en":"The doctor compared her mammographies from last year and this year.","zh":"医生对比了她去年和今年的乳房X光检查结果。"}]}],"synonyms":["breast X-rays","mammography exams","mammography screenings"],"phonetic":"/məˈmɑːɡrəfiz/","extraExplanation":["“Mammographies”在英语里是较少见的复数写法；更常见的表达是用单数作定语：a mammography exam / mammography screening，或用复数“mammograms”（乳房X光片/影像）来指具体的影像结果。","区分：mammography（检查/技术/过程），mammogram（拍出来的影像或片子）。例如：She had a mammography. / Her mammogram was normal."]}
{"word":"mammography","summary":{"en":"Mammography is a low-dose X-ray test used to image the breasts, mainly for breast cancer screening or diagnosis.","zh":"Mammography 指乳房X光摄影检查（低剂量X光成像），主要用于乳腺癌筛查或诊断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical imaging test that uses low-dose X-rays to examine the breasts, often used to screen for or diagnose breast cancer","zh":"乳房X光摄影检查（低剂量X光检查乳房），常用于乳腺癌的筛查或诊断"},"examples":[{"en":"She scheduled a mammography appointment as part of her yearly health checkup.","zh":"她把乳房X光摄影检查安排进了年度体检。"},{"en":"The doctor recommended mammography to look for early signs of breast cancer.","zh":"医生建议做乳房X光摄影检查，以寻找乳腺癌的早期迹象。"},{"en":"After the mammography, the clinic explained when she would receive the results.","zh":"做完乳房X光摄影检查后，诊所说明了她何时能拿到结果。"}]}],"synonyms":["mammogram (the image/result)","breast X-ray (informal)","breast screening (broader term)"],"phonetic":"/ˌmæməˈɡræfi/","extraExplanation":["词源上，mammography 来自拉丁语 mamm(a)（乳房）+ -graphy（记录/成像）。临床语境里常与 screening（筛查）和 diagnostic（诊断性检查）搭配：screening mammography 指无症状人群的常规筛查；diagnostic mammography 则用于已有症状（如肿块、异常分泌物）或筛查结果异常后的进一步检查。","英美医疗沟通中常见表达：get/have a mammogram（做乳腺X光检查），而 mammography 更偏正式/书面或医院用语。"]}
{"word":"mammon","summary":{"en":"Mammon means wealth worshiped as the highest value; it can also refer to a personified “master” of greed in religious tradition.","zh":"Mammon 指被奉为最高价值的财富（金钱至上），也可指宗教传统中被人格化的“贪婪与世俗财富之主”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wealth or money that is treated as an object of worship; material riches valued above moral or spiritual concerns.","zh":"被当作崇拜对象的金钱或财富；把物质利益置于道德或精神之上的“金钱至上”。"},"examples":[{"en":"He warned that chasing mammon can cost you your health and your relationships.","zh":"他警告说，一味追逐“金钱至上”可能会让你失去健康和人际关系。"},{"en":"The novel criticizes a society devoted to mammon rather than compassion.","zh":"这部小说批判了一个崇拜金钱而非同情心的社会。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Bible and Christian tradition, a personified force or “master” representing greed and worldly riches.","zh":"（《圣经》与基督教传统中）被人格化的力量或“主人”，象征贪婪与世俗财富。"},"examples":[{"en":"The sermon quoted, “You cannot serve God and Mammon.”","zh":"布道中引用了：“你们不能又事奉上帝，又事奉玛门。”"},{"en":"In medieval writings, Mammon appears as a tempter who lures people with gold.","zh":"在中世纪作品中，玛门常被描写成用黄金诱惑人的诱惑者。"}]}],"synonyms":["greed","materialism","worldly wealth","riches","lucre"],"phonetic":"/ˈmæmən/","extraExplanation":["“Mammon/玛门”源自亚兰语 *māmōnā*（财富、财物），经希腊语与拉丁语进入英语。英语里常大写 *Mammon* 来表示被人格化的“金钱之神/贪婪之主”，小写 *mammon* 则多指“对金钱的崇拜”或“金钱至上”。","常见搭配：*worship mammon*（拜金）、*devoted to mammon*（沉迷金钱/逐利）、*the pursuit of mammon*（对财富的追逐）。文学中也常用它来批评“物质主义、拜金主义”。"]}
{"word":"mammondom","summary":{"en":"Mammondom is a rare word meaning the dominance or “kingdom” of money—an attitude or society centered on wealth.","zh":"Mammondom 是个较罕见的词，指“金钱至上/拜金”的支配状态或社会氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the rule or dominance of wealth and material gain; a society or mindset devoted to money.","zh":"（罕见）“金钱至上”的统治或支配；以财富与物质利益为中心的社会或心态。"},"examples":[{"en":"Some critics say the film shows how mammondom can corrupt even kind people.","zh":"一些评论家说，这部电影展现了“金钱至上”如何腐蚀甚至善良的人。"},{"en":"He left the city because he was tired of mammondom and constant competition.","zh":"他离开城市，因为厌倦了金钱至上和无休止的竞争。"}]}],"synonyms":["materialism","money-worship","greed","commercialism"],"phonetic":"/ˈmæmənˌdɑm/","extraExplanation":["“mammondom”不是常见现代英语词，更多见于较旧或带讽刺意味的写法。它由“mammon（玛门，指金钱/贪财）+ -dom（表示领域、统治，如 kingdom）”构成，字面意思接近“金钱的王国/金钱统治”。","“Mammon”源自《圣经》语境中对“财富（被当作偶像）”的拟人化表达，因此“mammondom”常带道德批评色彩，指对金钱的盲目崇拜。","更常见、更自然的表达：materialism（物质主义）、the worship of money（金钱崇拜）、money culture（拜金文化）。"]}
{"word":"mammoni","summary":{"en":"Mammoni refers to adult children—especially men—who rely too much on their mothers (an Italian term often used in cultural commentary).","zh":"mammoni 指过度依赖母亲的成年子女（多指男性），常见于对意大利社会文化现象的讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword) Adult sons (or adult children) who are overly dependent on their mothers; “mama’s boys.”","zh":"（意大利语外来词）过度依赖母亲的成年儿子（或成年子女）；常译为“妈宝男/妈宝”。"},"examples":[{"en":"The article described many Italian mammoni who still live with their mothers in their thirties.","zh":"那篇文章提到不少意大利的“mammoni”，三十多岁仍和母亲同住。"},{"en":"He joked that he was a mammoni because his mom still does his laundry.","zh":"他开玩笑说自己是“mammoni”，因为妈妈还在帮他洗衣服。"}]}],"synonyms":["mama's boy","man-child","overdependent adult"],"phonetic":"/məˈmoʊni/","extraExplanation":["“mammoni”是意大利语复数形式，单数常见为“mammone”（字面可理解为“很黏妈妈的人”）。英语里多在新闻、社会观察或文化讨论中借用，带一点调侃或批评语气；使用时注意语境，避免对个人或群体造成冒犯。","不要和英语“mammon”（意为“金钱/财富，被人格化的贪财”）混淆；两者拼写相近但来源与含义不同。"]}
{"word":"mammoniacal","summary":{"en":"Mammoniacal means greedily devoted to money or material wealth, often in a critical tone.","zh":"mammoniacal 指过度崇拜金钱或物质财富的，常带批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person, attitude, or society) overly devoted to money and material wealth; greedy or money-worshipping.","zh":"（指人、态度或社会）过分崇拜金钱与物质财富的；贪财的、唯利是图的。"},"examples":[{"en":"Some critics say the film attacks a mammoniacal culture that values profit over people.","zh":"一些评论家说，这部电影批判了一种把利润看得比人更重要的拜金文化。"},{"en":"His mammoniacal pursuit of wealth damaged his friendships.","zh":"他对财富的拜金式追逐伤害了他的友谊。"}]}],"synonyms":["materialistic","money-obsessed","greedy","avaricious","mercenary"],"phonetic":"/ˌmæməˈnaɪəkəl/","extraExplanation":["“Mammon”一词源自《圣经》语境，常用来指“金钱/财富被当作偶像来崇拜”。因此 mammoniacal 带有明显的批评色彩，比单纯的 “money-minded（重视钱的）”更负面，强调“像宗教崇拜一样迷信金钱”。","该词较偏文学或评论文体（书评、社评、文化批评）中使用；日常口语里更常说 “greedy,” “materialistic,” 或 “money-obsessed”。"]}
{"word":"mammonish","summary":{"en":"Mammonish describes a greedy, money-worshiping focus on material gain.","zh":"Mammonish 指过度崇拜金钱、唯利是图的“拜金/物质至上”倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively focused on money, possessions, or material success; greedy or materialistic.","zh":"过分崇拜金钱与物质成功的；贪财的、物质至上的。"},"examples":[{"en":"The film criticizes a mammonish society that values profit over people.","zh":"这部电影批评了一个把利润看得比人更重要的拜金社会。"},{"en":"He became mammonish after his promotion, talking only about investments and status.","zh":"他升职后变得很拜金，开口闭口都是投资和地位。"},{"en":"Her mammonish attitude made teamwork difficult.","zh":"她那种唯利是图的态度让团队合作变得很困难。"}]}],"synonyms":["materialistic","money-minded","greedy","mercenary","avaricious"],"phonetic":"/ˈmæmənɪʃ/","extraExplanation":["“mammonish”来自“Mammon（玛门）”，在《圣经》传统中常被用来拟人化“财富/金钱”，尤其带有“人把金钱当作崇拜对象”的负面含义（如“serve God and Mammon”意为不能既事奉上帝又事奉金钱）。因此这个形容词通常带批评意味，用来指责过度追逐物质利益。"]}
{"word":"mammonism","summary":{"en":"Mammonism means treating money and material gain as the most important thing in life.","zh":"Mammonism 指把金钱与物质利益当成人生最重要目标的拜金倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief in or pursuit of wealth and material possessions as the highest value; excessive devotion to money-making.","zh":"拜金主义；将财富与物质占有视为最高价值的观念或倾向。"},"examples":[{"en":"The novel criticizes mammonism and shows how greed can destroy relationships.","zh":"这部小说批判拜金主义，展现贪婪如何摧毁人际关系。"},{"en":"She left the company because its culture of mammonism valued profits over people.","zh":"她离开那家公司，因为那种拜金文化把利润看得比人更重要。"}]}],"synonyms":["greed","avarice","money-worship","materialism","consumerism"],"phonetic":"/ˈmæmənɪzəm/","extraExplanation":["“Mammon”最初源自《圣经》语境，常用来指“财富/金钱”被当作崇拜对象（甚至拟人化为“财富之神”）。因此“mammonism”带有明显的批判色彩，常用于道德、宗教或社会评论中，强调“把钱当成最高信仰/目标”。","在写作中它比“materialism（物质主义）”更尖锐：materialism可较中性地指重视物质生活，而mammonism通常暗含贪婪、逐利至上、价值失衡。"]}
{"word":"mammonist","summary":{"en":"A mammonist is someone (or something) excessively devoted to money and material gain.","zh":"mammonist 指过度崇拜金钱与物质利益的“拜金者/拜金的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who values money and material wealth above spiritual, moral, or human concerns; a worshiper of wealth","zh":"把金钱与物质财富看得高于精神、道德或人际关怀的人；拜金者"},"examples":[{"en":"He was criticized as a mammonist who cared only about profit.","zh":"他被批评为一个只在乎利润的拜金者。"},{"en":"The novel portrays a mammonist society where everything has a price.","zh":"这部小说描绘了一个拜金的社会，在那里一切都可以标价。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing excessive devotion to money or material success; greed-focused","zh":"过度崇拜金钱或物质成功的；以贪利为中心的"},"examples":[{"en":"She rejected the mammonist attitude that happiness can be bought.","zh":"她拒绝那种“幸福可以用钱买到”的拜金态度。"},{"en":"Their mammonist values hurt the team’s trust.","zh":"他们的拜金价值观伤害了团队的信任。"}]}],"synonyms":["materialist","money-grubber","profit-driven","money-obsessed","greedy"],"phonetic":"/ˈmæmənɪst/","extraExplanation":["“Mammon”源自《圣经》语境，常被理解为“财富/金钱”的拟人化象征（有时也被当作“财富之神/邪神”的形象）。在《马太福音》6:24中有句名言：“You cannot serve God and mammon.”（你不能又侍奉上帝，又侍奉玛门/金钱。）因此 mammonist 带有明显的批评色彩，强调“把钱当成最高追求”。","在现代英语里，mammonist 属于较正式、文学或评论性的用词；日常口语更常说 materialistic（物质主义的）或 money-obsessed（迷恋钱的）。"]}
{"word":"mammonistic","summary":{"en":"“Mammonistic” describes someone or something that worships money or puts wealth above moral or human values.","zh":"“mammonistic”形容拜金、以财富为最高价值，甚至凌驾于道德或人情之上的态度/行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too focused on money, material wealth, or greed; treating money as the highest value.","zh":"过度崇拜金钱、物质财富或贪财的；把金钱当作最高价值的。"},"examples":[{"en":"The movie criticizes a mammonistic society where success is measured only by money.","zh":"这部电影批判了一个拜金的社会：成功只用金钱来衡量。"},{"en":"He left the company because he felt its culture was becoming mammonistic.","zh":"他离开那家公司，因为他觉得公司的文化越来越拜金。"}]}],"synonyms":["materialistic","money-minded","money-obsessed","greedy","mercenary"],"phonetic":"/ˌmæməˈnɪstɪk/","extraExplanation":["“Mammonistic”来自“mammon”，意为“财富（常带贬义：不义之财/拜金）”。“Mammon”在《圣经》（如《马太福音》6:24）里常被当作“金钱的化身/偶像”，用来批评把财富当作信仰的心态。","语气：较正式、批判性强，常用于写作、评论或社会批评。日常口语里更常用 materialistic（物质主义的）、money‑obsessed（迷恋钱的）、greedy（贪婪的）。"]}
{"word":"mammonite","summary":{"en":"Mammonite means a person who worships money—someone strongly devoted to wealth and material gain.","zh":"Mammonite 指“拜金者”，即把金钱与财富当作人生最高追求、近乎崇拜的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is obsessed with money or material wealth; a worshiper of Mammon (wealth seen as an idol).","zh":"拜金者；金钱至上者；（把财富当作偶像崇拜的）玛门崇拜者。"},"examples":[{"en":"The novel portrays him as a mammonite who values profit over people.","zh":"小说把他刻画成一个拜金者，把利润看得比人更重要。"},{"en":"She feared the city would turn everyone into mammonites, chasing money at any cost.","zh":"她担心这座城市会把所有人都变成拜金者，不惜一切代价追逐金钱。"}]}],"synonyms":["money-worshiper","materialist","gold-digger","greedy person"],"phonetic":"/ˈmæmənaɪt/","extraExplanation":["“Mammon”源自《圣经》传统，常指“财富被当成神来崇拜”的观念（可联想到“serve God and Mammon”/“不能又事奉上帝又事奉玛门”）。因此 mammonite 带强烈批评色彩，常用于文学或道德评论语境，比常见的 “materialist / money worshiper” 更书面、更尖锐。"]}
{"word":"mammonitish","summary":{"en":"Mammonitish means “greedy or worshiping money,” but it is very rare in modern English.","zh":"mammonitish 指“贪财/拜金、物质至上”，但在现代英语中非常罕见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Showing excessive love of money; greedy or materialistic, as if worshiping wealth (Mammon).","zh":"（罕见）过分爱财、贪婪或物质至上；仿佛把金钱当作偶像崇拜（Mammon，钱财之神/象征）。"},"examples":[{"en":"He criticized the company’s mammonitish obsession with profit at any cost.","zh":"他批评这家公司一味逐利、不惜代价的“拜金式”执念。"},{"en":"The novel portrays a mammonitish society where status depends on wealth.","zh":"这部小说刻画了一个“金钱至上”的社会：地位取决于财富。"}]}],"synonyms":["mammonish","greedy","materialistic","money-minded","avaricious"],"phonetic":"/ˈmæmənɪʃ/","extraExplanation":["这个词非常少见，多数情况下人们会用更常见的 mammonish、money-minded、materialistic、greedy 来表达类似意思。","Mammon 源自《圣经》语境，常用来象征“对财富的崇拜”。在英语文化里，说 someone serves Mammon 往往带有道德批评意味。"]}
{"word":"mammonization","summary":{"en":"Mammonization means becoming dominated by money and profit—often with a critical, negative tone.","zh":"Mammonization 指逐渐被金钱与利润主导的过程，常带批判性的负面语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming overly focused on money and material gain; turning something (a person, institution, or society) into something driven mainly by profit.","zh":"（个人、机构或社会）逐渐被金钱与物质利益主导的过程；把某事物变得以盈利为首要目标的过程。"},"examples":[{"en":"Some critics worry that the mammonization of higher education will weaken its public mission.","zh":"一些评论者担心，高等教育的“拜金化”会削弱其公共使命。"},{"en":"The novel portrays a city’s mammonization, where relationships are measured by price tags.","zh":"这部小说描写了一座城市的拜金化：人际关系都用价码来衡量。"},{"en":"They resisted the mammonization of their community festival by refusing corporate sponsorship.","zh":"他们通过拒绝企业赞助来抵制社区节日的商业化（拜金化）。"}]}],"synonyms":["commercialization","commodification","materialism","profit-drivenism","mercenariness"],"phonetic":"/ˌmæmənaɪˈzeɪʃən/","extraExplanation":["“mammonization”来自“Mammon”（玛门），在《圣经》语境中常指“财富/贪财的偶像”，带有明显的道德批评色彩，暗示“把钱当成神来崇拜”。因此它通常比“commercialization（商业化）”更负面、更强调贪婪与价值观扭曲。","常见搭配：the mammonization of society/politics/education（社会/政治/教育的拜金化）；动词可用“mammonize”（较少见）。"]}
{"word":"mammonize","summary":{"en":"Mammonize means to make something (or someone) money-centered—treating wealth as the highest value.","zh":"Mammonize 指使某事/某人变得金钱至上，把财富当作最高价值（多含批评意味）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make (a person, society, or activity) focused on money and material gain; to turn into something that “worships” wealth","zh":"使（人、社会或活动）金钱至上；使变得唯利是图、崇拜财富"},"examples":[{"en":"Some critics say social media has mammonized creativity by rewarding whatever makes the most money.","zh":"一些评论者认为社交媒体把创造力“金钱化”了，因为它奖励最能赚钱的内容。"},{"en":"He worried that chasing profits would mammonize the company’s original mission.","zh":"他担心逐利会让公司的初心变得唯利是图。"}]},{"partOfSpeech":"v.","definition":{"en":"to become focused on money and material success","zh":"变得金钱至上；变得只重物质与金钱的成功"},"examples":[{"en":"When politics mammonizes, public service can start to look like a business deal.","zh":"当政治变得“金钱化”时，公共服务可能开始像一桩生意。"}]}],"synonyms":["commercialize","materialize","commodify","corrupt","sell out"],"phonetic":"/ˈmæməˌnaɪz/","extraExplanation":["“Mammon”源自《圣经》中常用来指“财富/金钱（被当作偶像崇拜）”的词（常见于“serve God or Mammon”的表达）。因此 mammonize 带有明显的批评色彩，通常用于正式或文学性语境，强调“把钱当成最高价值”。"]}
{"word":"mammonolatry","summary":{"en":"Mammonolatry means worshiping money or wealth as if it were a god—an extreme form of greed or material devotion.","zh":"Mammonolatry 指“拜金”：把金钱或财富当作神来崇拜，对物质与金钱的极端奉奉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the worship of wealth (money or material gain) as if it were a god; extreme devotion to making and keeping money","zh":"拜金主义；把金钱/财富当作“神”来崇拜的行为或观念；对赚钱与守财的极端崇拜"},"examples":[{"en":"Some critics say the film is a satire of modern mammonolatry.","zh":"一些评论家说，这部电影是在讽刺现代社会的拜金主义。"},{"en":"He warned that mammonolatry can replace empathy with greed.","zh":"他警告说，拜金主义可能会让贪婪取代同理心。"},{"en":"The sermon condemned mammonolatry and urged people to value generosity.","zh":"那篇布道谴责拜金主义，并劝人们重视慷慨。"}]}],"synonyms":["materialism","greed","money worship","avarice"],"phonetic":"/ˌmæməˈnɑlətri/","extraExplanation":["词源上由“mammon（玛门/钱财）+ -latry（崇拜）”构成。Mammon 常见于《圣经》语境，特别与“God and Mammon（上帝与玛门）”的对比相关，强调把财富当作最终目标、凌驾于道德与信仰之上的倾向。","语体上较正式、带批判意味，常用于宗教写作、社会评论或文学批评；日常口语更常说 materialism（物质主义）或 greed（贪婪）。"]}
{"word":"mammons","summary":{"en":"Mammon (often written as a concept or personified figure) means wealth treated as an object of worship; “mammons” is its plural form but is less common than “mammon.”","zh":"Mammon（有时作为概念或拟人形象）指被当作崇拜对象的财富；“mammons”是其复数形式，但不如“mammon”常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wealth or material possessions viewed as something people worship or pursue too strongly (often with a negative, moral tone).","zh":"（带贬义、道德批评色彩）指被人过度崇拜、追逐的财富或物质享受。"},"examples":[{"en":"He sacrificed his health in the pursuit of mammon.","zh":"他为追逐金钱而牺牲了健康。"},{"en":"The novel criticizes a society that worships mammon over compassion.","zh":"这部小说批评了一个把金钱看得比同情更重要的社会。"}]},{"partOfSpeech":"n.","definition":{"en":"Mammon as a personified force or “false god” of money and greed (common in religious or literary writing).","zh":"（宗教/文学用法）“玛门”——金钱与贪欲的拟人化象征，被视为“假神”。"},"examples":[{"en":"In the poem, Mammon tempts the hero with gold and power.","zh":"在诗中，玛门用金钱与权力诱惑主人公。"},{"en":"The preacher warned against serving Mammon instead of God.","zh":"牧师警告人们不要侍奉玛门而不侍奉上帝。"}]}],"synonyms":["wealth","money","riches","greed","materialism"],"phonetic":"/ˈmæmən/","extraExplanation":["“Mammon/玛门”来自《圣经》传统，常见于《马太福音 6:24》：人不能又事奉上帝又事奉玛门（意指金钱/财富）。因此它在英语里常带有“把钱当作信仰、导致贪婪”的批评意味。","你输入的“mammons”是复数形式，但在现代英语里更常用不可数或单数的“mammon”来泛指“金钱崇拜/物质至上”。"]}
{"word":"mammonteus","summary":{"en":"“Mammonteus” is a rare/nonstandard form of “mammoniteous,” meaning money-worshipping or greedily focused on wealth.","zh":"“mammonteus”是“mammoniteous”的罕见/非标准形式，指崇拜金钱、过度追逐财富（贪财、物质至上）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A rare/nonstandard spelling of “mammoniteous,” meaning excessively devoted to money or material wealth; greedy and materialistic.","zh":"“mammoniteous”的罕见/非标准拼写，意思是过度崇拜金钱或物质财富的；贪财、物质至上的。"},"examples":[{"en":"He criticized the company’s mammonteus culture, where profit mattered more than people.","zh":"他批评那家公司“mammonteus”的文化：利润比人更重要。"},{"en":"The novel portrays a mammonteus landlord who values rent above kindness.","zh":"小说刻画了一位贪财的房东，把房租看得比善意更重要。"}]}],"synonyms":["greedy","avaricious","materialistic","money-grubbing"],"phonetic":"/ˌmæməˈnaɪtiəs/","extraExplanation":["Mammon（玛门）源自《圣经》传统，常被用来人格化“财富/贪财”这一诱惑（如“侍奉上帝与玛门”）。因此由 Mammon 衍生出的形容词（如 mammoniteous）多带贬义，强调“把钱当成信仰”。","这个拼写在现代英语中几乎不用，更常见的表达是 greedy / materialistic / money-grubbing。写作或考试中建议用更常见的词；若在文学语境出现，通常是为了营造古典、讽刺或宗教色彩。"]}
{"word":"mammose","summary":{"en":"“Mammose” is a rare adjective meaning “mammary; related to the breasts or mammary glands.”","zh":"“mammose”是一个罕见形容词，意思是“乳腺的；与乳房或乳腺有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to the breast(s) or mammary glands; mammary.","zh":"（罕见）与乳房或乳腺有关的；乳腺的。"},"examples":[{"en":"In some older medical writing, “mammose” was used to mean “mammary.”","zh":"在一些较早的医学写作中，“mammose”曾被用来表示“mammary（乳腺的）”。"},{"en":"Mammose tissue changes can occur during pregnancy and breastfeeding.","zh":"怀孕和哺乳期可能会出现乳腺组织的变化。"}]}],"synonyms":["mammary","breast (adj.)","lactational (in context)"],"phonetic":"/ˈmæmˌoʊs/","extraExplanation":["“mammose”在现代英语里非常少见，更常用的词是“mammary”（乳腺的）或“breast”（乳房的）。如果你是在作业/论文中看到它，很可能出自较旧或较少见的医学用语。","它也常被误写或误读为“mammoth”（巨大的）或“mucous”（黏液的）。如果你能提供原句，我可以帮你判断具体意思。"]}
{"word":"mammoth","summary":{"en":"Mammoth means an Ice Age elephant-like animal, and it also means extremely large.","zh":"mammoth 既指冰河时代的猛犸象，也可作形容词表示“非常巨大、庞大”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large extinct elephant-like animal with long curved tusks and thick hair, famous from the Ice Age.","zh":"一种已灭绝的巨大象类动物（长弯獠牙、浓密毛发），以冰河时代最著名。"},"examples":[{"en":"Scientists found a mammoth tooth in the frozen ground.","zh":"科学家在冻土里发现了一颗猛犸象的牙齿。"},{"en":"In some museums, you can see a life-sized mammoth skeleton.","zh":"在一些博物馆里，你可以看到等比例的猛犸象骨架。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely large; huge.","zh":"非常巨大的；庞大的。"},"examples":[{"en":"They faced a mammoth challenge at work.","zh":"他们在工作中面对一个巨大的挑战。"},{"en":"Cleaning the whole house was a mammoth task.","zh":"打扫整栋房子是一项庞大的任务。"}]}],"synonyms":["huge","enormous","gigantic","massive"],"phonetic":"/ˈmæməθ/","extraExplanation":["“mammoth”作形容词时常用于强调规模或难度很大，语气比“big/large”更强，接近“huge/enormous”。","词源来自俄语/西伯利亚地区对这种动物的称呼，后来进入英语。","相关搭配：a mammoth task/challenge/effort（艰巨的任务/挑战/努力）。"]}
{"word":"mammothrept","summary":{"en":"Mammoth means an extinct elephant-like animal, or something extremely large.","zh":"mammoth 指“猛犸象”，也可形容“巨大/艰巨”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literal) A large, extinct elephant-like animal with long curved tusks, especially the woolly mammoth.","zh":"（本义）一种已灭绝、像大象的巨大动物，长而弯的象牙；尤指长毛猛犸象。"},"examples":[{"en":"Scientists studied mammoth bones found in Siberia.","zh":"科学家研究了在西伯利亚发现的猛犸象骨骼。"},{"en":"The museum has a model of a woolly mammoth.","zh":"博物馆里有一只长毛猛犸象的模型。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Extremely large in size, amount, or importance.","zh":"（引申）非常巨大的；数量极多的；极其重要的。"},"examples":[{"en":"They faced a mammoth task after the storm.","zh":"暴风雨过后，他们面临一项艰巨的任务。"},{"en":"The project required a mammoth effort from the whole team.","zh":"这个项目需要全团队付出巨大的努力。"}]}],"synonyms":["enormous","huge","gigantic","massive"],"phonetic":"/ˈmæm.əθ/","extraExplanation":["“mammothrept” 不是常见英文单词，可能是拼写/输入连在一起了。你是不是想查：1）mammoth（猛犸象；巨大的），2）rept.（某些词典里用作 reptile 的缩写，意为“爬行动物”）？如果你想表达“巨型爬行动物”，更自然的说法是 “a gigantic reptile” 或 “a huge reptile”。"]}
{"word":"mammoths","summary":{"en":"Mammoths are extinct, elephant-like animals; “mammoth” can also mean extremely large.","zh":"mammoths 指已灭绝的类象巨兽“猛犸象”；mammoth 也可形容“非常巨大”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Very large, extinct, elephant-like mammals with long curved tusks and shaggy hair, best known from the Ice Age.","zh":"猛犸象：已灭绝的巨大类象哺乳动物，通常有弯曲长獠牙和浓密长毛，最著名于冰河时期。"},"examples":[{"en":"Woolly mammoths lived during the last Ice Age.","zh":"长毛猛犸象生活在上一个冰河时期。"},{"en":"Scientists have found mammoth bones in Siberia and Alaska.","zh":"科学家在西伯利亚和阿拉斯加发现了猛犸象骨骼。"},{"en":"The museum displayed a mammoth skeleton with enormous tusks.","zh":"博物馆展出了一具带着巨大獠牙的猛犸象骨架。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Extremely large in size or amount.","zh":"（非正式）巨大的；庞大的。"},"examples":[{"en":"They faced a mammoth task to finish the project on time.","zh":"他们要按时完成项目，面临一项艰巨的任务。"},{"en":"The storm caused mammoth damage along the coast.","zh":"这场风暴在海岸造成了巨大的破坏。"}]}],"synonyms":["(adj.) huge","(adj.) enormous","(adj.) gigantic","(adj.) massive"],"phonetic":"/ˈmæməθ/","extraExplanation":["“mammoth”既指动物，也可作形容词表示“巨大”。在写作中用作比“big”更有画面感、夸张感的表达，常见搭配有：a mammoth task / mammoth effort / mammoth amount。","词源来自俄语“мамонт (mamont)”，与在冻土中发现的猛犸遗骸有关。","文化与文学中，猛犸象常象征“史前、庞大、消失的时代”；你也会在电影、儿童读物和博物馆展览中频繁看到它（如“woolly mammoth/长毛猛犸象”）。"]}
{"word":"mammotomy","summary":{"en":"Mammotomy is a medical term for making an incision in the breast, often connected to taking a biopsy sample.","zh":"mammotomy 是医学术语，指对乳房进行切开操作，常与获取活检样本相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical incision into the breast (sometimes used more broadly to refer to a breast biopsy or breast tissue removal).","zh":"乳房切开术；（有时也泛指）乳房活检或取出部分乳腺组织的操作。"},"examples":[{"en":"The surgeon performed a mammotomy to obtain a tissue sample for testing.","zh":"外科医生进行了乳房切开术，以获取组织样本进行检测。"},{"en":"After the mammotomy, the doctor explained the biopsy results in simple terms.","zh":"乳房切开术之后，医生用通俗的方式解释了活检结果。"}]}],"synonyms":["breast biopsy","breast incision","mammotome biopsy"],"phonetic":"/ˌmæməˈtɑtəmi/","extraExplanation":["这个词多见于医学语境，日常英语里更常说 breast biopsy（乳房活检）或 breast incision（乳房切口）。","在现代临床中，mammotomy 有时会被用来指一种“真空辅助活检”技术（常见商品名 Mammotome），通过较小切口取样，相对创伤更小。","词源上 mamm- 来自拉丁语 mamma（乳房），-tomy 来自希腊语 tomē（切开），同类词还有 lobotomy（脑叶切开术）、tracheotomy（气管切开术）。"]}
{"word":"mammotropin","summary":{"en":"Mammotropin is a hormone (prolactin) involved in breast development and milk production.","zh":"mammotropin 指催乳素/泌乳素，是与乳腺发育和泌乳相关的激素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hormone (also called prolactin) that stimulates breast development and milk production, especially after childbirth","zh":"一种激素（也叫催乳素/泌乳素），主要促进乳腺发育并刺激产后乳汁分泌"},"examples":[{"en":"After childbirth, mammotropin helps the body start producing milk.","zh":"分娩后，mammotropin 会帮助身体开始分泌乳汁。"},{"en":"High levels of mammotropin can sometimes cause milk production even when a person is not pregnant.","zh":"mammotropin 水平过高有时会导致即使未怀孕也出现泌乳。"}]}],"synonyms":["prolactin","lactotropin"],"phonetic":"/məˈmæməˌtroʊpɪn/","extraExplanation":["mammotropin 是较偏医学/生理学的用词，日常英语里更常见的是 prolactin（催乳素/泌乳素）或 lactotropin。","在临床语境中，医生常用“prolactin level（催乳素水平）”来讨论相关检查；催乳素过高可能与某些药物、压力、甲状腺问题或垂体腺瘤等情况有关（具体需由专业医生判断）。"]}
{"word":"mammula","summary":{"en":"Mammula is a rare scientific noun meaning a small nipple-like bump or projection.","zh":"mammula 是一个较少见的科学名词，指乳头状的小突起或小隆起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, breast- or nipple-like projection; a tiny rounded bump (used mainly in anatomy, zoology, and botany)","zh":"乳头状/乳房状的小突起；小圆隆起（主要用于解剖学、动物学与植物学等专业语境）"},"examples":[{"en":"Under the microscope, the shell surface shows several small mammulae.","zh":"在显微镜下，贝壳表面可见几个小小的乳头状突起。"},{"en":"The botanist described the seed coat as having mammula-like bumps.","zh":"植物学家描述种皮上有类似乳头状的小隆起。"}]}],"synonyms":["mammilla","nipple (general)","papilla (in some contexts)","protuberance (general)"],"phonetic":"/mæˈmjuːlə/","extraExplanation":["“mammula”源自拉丁语 mammula，意为“乳房/乳头的缩小形式（小乳房）”。在现代英语里它非常少见，多出现在学术写作中；更常见的相关词是“mammilla”（同样指乳头状突起）。","注意不要和“mammal（哺乳动物）”混淆：两者词根都与“mamma（乳房）”有关，但“mammula”通常指结构上的“小突起”，不是动物类别。"]}
{"word":"mammulae","summary":{"en":"“Mammulae” means small nipple-like projections; it’s the plural of “mammula,” used mainly in scientific/anatomical writing.","zh":"“mammulae”指小乳头状突起，是 mammula 的复数，主要用于科学/解剖学写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small, nipple-like bumps or projections (especially in anatomy or biology); plural of “mammula”","zh":"小乳头状突起、小凸起（尤用于解剖学或生物学语境）；为 mammula 的复数"},"examples":[{"en":"Under the microscope, the surface shows tiny mammulae.","zh":"在显微镜下，可以看到表面有许多细小的乳头状突起。"},{"en":"Some anatomical descriptions mention mammulae as small rounded projections.","zh":"一些解剖学描述会把 mammulae 解释为小的圆形突起。"}]}],"synonyms":["papillae","protuberances","small projections"],"phonetic":"/mæmˈjuːliː/","extraExplanation":["“mammulae”来自拉丁语词根 mamm-（与“乳房/乳头”相关），因此常用来形容“像小乳头一样的突起”。","在现代解剖学中，你更常见到的是相关词“mammillary”（如 mammillary bodies / mammillary process），含义同样指“乳头状的”。","拼写提醒：有时人们会把 mammulae 和 mammillae 混用或误拼；具体用哪一个取决于你阅读的学科传统与原文写法。"]}
{"word":"mammular","summary":{"en":"Mammular means “related to the breast” or “breast-shaped,” and it’s a rare word today (often replaced by mammary).","zh":"mammular 意为“与乳房有关的”或“呈乳房形的”，如今较少使用，常被 mammary 取代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the breast (a mamma); breast-like in shape.","zh":"与乳房有关的；呈乳房形（乳头形）状的。"},"examples":[{"en":"The artist used a mammular form to symbolize motherhood.","zh":"这位艺术家用乳房形的造型来象征母性。"},{"en":"In older medical writing, “mammular” was sometimes used to describe breast-related anatomy.","zh":"在较早的医学文献中，“mammular”有时用于描述与乳房相关的解剖结构。"}]}],"synonyms":["mammary","breastlike","mamma-related"],"phonetic":"/ˈmæmjələr/","extraExplanation":["“mammular”较少见，现代英语里更常用的是“mammary”（乳房的、乳腺的）。如果你想表达“乳房/乳腺相关”，通常选“mammary gland（乳腺）”“mammary tissue（乳腺组织）”更自然。","词源上与拉丁语“mamma（乳房）”有关；在艺术、雕塑或旧式医学语境中偶尔出现，用来强调“乳房形/乳头形”的外观特征。"]}
{"word":"mammut","summary":{"en":"Mammut usually means “mammoth” (the extinct animal) in European spelling, and it is also the name of a Swiss outdoor brand.","zh":"Mammut通常是“猛犸象”的欧洲拼写形式，也可以指瑞士户外品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly European spelling) A mammoth; a large extinct elephant-like animal, famous for its long curved tusks and thick fur.","zh":"（主要见于欧洲拼写）猛犸象；一种已灭绝的大型象类动物，以弯曲长牙和浓密毛发著称。"},"examples":[{"en":"The museum has a Mammut skeleton on display.","zh":"博物馆里展出了猛犸象的骨架。"},{"en":"Scientists found Mammut bones preserved in ice.","zh":"科学家在冰层中发现了保存完好的猛犸象骨骼。"}]},{"partOfSpeech":"n.","definition":{"en":"Mammut (brand): A Swiss outdoor clothing and climbing-gear company name, often seen on jackets and backpacks.","zh":"Mammut（品牌）：瑞士的户外服装与攀登装备品牌名，常见于夹克和背包上。"},"examples":[{"en":"He wore a Mammut jacket on the hike.","zh":"他徒步时穿了一件Mammut夹克。"},{"en":"I bought a Mammut rope for climbing practice.","zh":"我买了一根Mammut的绳子用来练习攀岩。"}]}],"synonyms":["mammoth","woolly mammoth (specific type)"],"phonetic":"/ˈmæmʊt/","extraExplanation":["“Mammut”常被当作“mammoth（猛犸象）”的德语/品牌写法。英语里更常用的拼写是“mammoth”，含义也可引申为“巨大的、庞大的”（如：a mammoth task 一项艰巨的任务）。","如果你是在衣物或装备上看到“Mammut”，通常指瑞士户外品牌，而不是动物本身。"]}
{"word":"mammutidae","summary":{"en":"Mammutidae is the extinct animal family that includes mastodons (genus Mammut).","zh":"Mammutidae 指乳齿象科，即包含乳齿象（Mammut 属）在内的一类已灭绝象类动物家族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct elephant-like mammals called mastodons (including the genus Mammut), known from fossils in North and Central America and parts of Eurasia.","zh":"乳齿象科：已灭绝的象类哺乳动物家族（包括乳齿象属 Mammut），以化石闻名，主要分布于北美、中美洲及欧亚部分地区。"},"examples":[{"en":"Scientists identified the fossil teeth as belonging to Mammutidae rather than modern elephants.","zh":"科学家鉴定这些化石牙齿属于乳齿象科，而不是现代象类。"},{"en":"In many museum exhibits, Mammutidae is discussed alongside mammoths to show different branches of elephant evolution.","zh":"在许多博物馆展览中，乳齿象科常与猛犸象一起介绍，用来展示象类演化的不同分支。"}]}],"synonyms":["mastodons (informal/general)","Mammutidae family (scientific wording)"],"phonetic":"/mæˈmʌtɪdi/","extraExplanation":["“Mammutidae”是生物分类学用语，指“乳齿象科”，成员通常被称为mastodon（乳齿象）。它们与mammoth（猛犸象）不是同一种：乳齿象的臼齿常呈圆锥状齿尖，适合取食树叶、枝条等；猛犸象的臼齿更像一排排的板状脊，更适合啃食草。","词形上，“-idae”是动物科名的常见拉丁化后缀（表示“某某科”）。在一般英语写作中，更常用的日常词是“mastodon(s)”，而“Mammutidae”多见于论文、科普或博物馆标签中。"]}
{"word":"mammy","summary":{"en":"“Mammy” can mean a racist historical stereotype of a Black domestic servant (offensive), and more rarely a dated word for “mother.”","zh":"“mammy”常指带有种族歧视的黑人女仆/保姆刻板形象（冒犯性）；较少情况下也可作过时的“妈妈”称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Offensive, historical) A racist stereotype of an older Black woman who works as a devoted domestic servant or nanny in a White household, often shown as cheerful and self-sacrificing.","zh":"（冒犯性、历史用法）一种带有种族歧视的刻板形象：年长的黑人女性在白人家庭做家务或带孩子，被描绘成永远忠诚、乐于奉献、总是开心的女仆/保姆。"},"examples":[{"en":"Many museums explain why the “mammy” image is harmful and racist.","zh":"许多博物馆会解释为什么“mammy（黑妈妈女仆）”的形象有害且带有种族歧视。"},{"en":"The film uses a “mammy” stereotype instead of giving the character a real personality.","zh":"这部电影使用了“mammy”的刻板形象，而不是给角色真实的个性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dated, informal) A childish or affectionate word for “mother,” used in some dialects or older literature.","zh":"（过时、非正式）对“妈妈/母亲”的童语或昵称，在某些方言或较早的文学作品中可见。"},"examples":[{"en":"In old stories, a child might call her mother “Mammy.”","zh":"在一些旧故事里，孩子可能会把母亲叫作“Mammy（妈妈）”。"},{"en":"Today, most people simply say “mom” or “mommy.”","zh":"如今，大多数人会直接说“mom”或“mommy”。"}]}],"synonyms":["mommy","mom","mother","nanny","housekeeper"],"phonetic":"/ˈmæmi/","extraExplanation":["“mammy”在美国历史语境中常指一种种族主义刻板形象，源于奴隶制与种族隔离时期的宣传与流行文化（如广告、舞台剧、早期电影）。它把黑人女性描绘成“天生适合伺候与照顾白人家庭”的角色，用来淡化压迫历史，因此在现代英语里通常被视为冒犯性用语。","文学与影视中常被讨论的例子包括《乱世佳人》（Gone with the Wind）中的相关角色类型，以及曾引发争议的品牌形象（如“Aunt Jemima”）等；在学术、历史或批判语境中可能会出现，但日常交流中建议避免使用。"]}
{"word":"mamo","summary":{"en":"“Mamo” is not a common English word; it’s usually a name, or a Spanish form meaning “I suckle / I nurse.”","zh":"“Mamo”不是常见英语词，通常是人名；也可能是西班牙语形式，意思是“我吮吸/我哺乳”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (given name or surname). In English, “Mamo” is most often seen as a person’s name rather than a common vocabulary word.","zh":"人名（名或姓）。在英语里，“Mamo”多见于人名，而不是常用词汇。"},"examples":[{"en":"Dr. Mamo will speak at the conference tomorrow.","zh":"Mamo 医生明天会在会议上发言。"},{"en":"I saw the name Mamo on the list of authors.","zh":"我在作者名单上看到了 Mamo 这个名字。"}]},{"partOfSpeech":"v.","definition":{"en":"(From Spanish, informal) “mamo” can mean “I suckle / I nurse” (1st person singular of the verb “mamar”). This is not standard English, but you may see it in bilingual conversations or quotes.","zh":"（来自西班牙语，非正式）“mamo”可表示“我吮吸/我吸奶/我哺乳”（动词 mamar 的第一人称单数）。这不是标准英语，但可能出现在双语对话或引用中。"},"examples":[{"en":"In the interview he said, “Yo mamo,” using Spanish, not English.","zh":"在采访里他说了“Yo mamo”，用的是西班牙语，不是英语。"},{"en":"Some posts mix English and Spanish, so you might see “mamo” in the middle of an English sentence.","zh":"有些帖子会英西混用，所以你可能会在英文句子中间看到“mamo”。"}]}],"synonyms":["(name) N/A","(Spanish meaning) nurse (in Spanish context)"],"phonetic":"/ˈmɑːmoʊ/","extraExplanation":["“Mamo”不是常见英语词汇；如果你是在英文聊天/歌词/字幕里看到它，通常需要看语境：要么是人名，要么是夹杂的西班牙语。","如果你想查的是某个英文单词但拼写不确定（比如 mammal, memo, mama 等），把原句发我，我可以帮你确认。"]}
{"word":"mamona","summary":{"en":"Mamona is mainly a Spanish (especially Mexican) slang word meaning an unpleasant/annoying woman (often offensive), and in some regions it also names the castor plant.","zh":"Mamona 主要是西语（尤其墨西哥）俚语，常指“令人讨厌/刻薄的女人”（多带冒犯）；在一些地区也可指“蓖麻（用于蓖麻油）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(From Mexican Spanish, slang; often offensive) A woman who is annoying, rude, or unpleasant; sometimes used like “jerk” or “bitchy.”","zh":"（源自墨西哥西语俚语；常带冒犯）指令人讨厌、刻薄或难相处的女性；有时类似“讨厌鬼/很婊/很刻薄”的用法。"},"examples":[{"en":"He said his coworker was *mamona*, but it sounded really disrespectful.","zh":"他说他的同事很 *mamona*，但听起来非常不尊重人。"},{"en":"In some Mexican Spanish, *mamona* can mean someone is being mean or overly difficult.","zh":"在一些墨西哥西语里，*mamona* 可以表示某人在刻薄或故意刁难。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin America) A common name for the castor bean plant (Ricinus communis), used for castor oil.","zh":"（拉丁美洲）蓖麻（蓖麻属植物，Ricinus communis）的俗名之一，用于提取蓖麻油。"},"examples":[{"en":"In some regions, people call the castor plant *mamona*.","zh":"在一些地区，人们把蓖麻叫做 *mamona*。"},{"en":"Castor oil comes from the seeds of the plant sometimes known as *mamona*.","zh":"蓖麻油来自蓖麻的种子，这种植物在某些地方也叫 *mamona*。"}]}],"synonyms":["(slang) annoying","(slang) rude","(plant) castor plant","Ricinus communis"],"phonetic":"məˈmoʊnə","extraExplanation":["“mamona”不是标准英语词，更多是西班牙语（尤其墨西哥）里的口语/俚语。用于形容人时语气可能很难听，带明显贬义，正式场合或不熟的人面前不建议使用。","不同国家/地区含义可能不一样：在部分语境里也可指“蓖麻/蓖麻树”。如果你告诉我你在哪个国家看到这个词、是骂人还是植物语境，我可以帮你更精确解释。"]}
{"word":"mamoncillo","summary":{"en":"Mamoncillo is a Caribbean tropical fruit with green skin and sweet-tart pulp around a large seed.","zh":"Mamoncillo 是一种加勒比常见的热带水果，绿皮、果肉甜酸，包着一颗大种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small tropical fruit (from the tree *Melicoccus bijugatus*) common in the Caribbean and parts of Central and South America, with a thin green skin and a sweet-tart, sticky pulp around a large seed; also called **quenepa** or **Spanish lime**.","zh":"一种热带水果（树种为 *Melicoccus bijugatus*），常见于加勒比及中南美部分地区；果皮薄而偏绿，果肉甜酸、略黏，包裹着一颗大种子；也常叫 **quenepa** 或 **Spanish lime（西班牙青柠/西班牙酸橙，俗称）**。"},"examples":[{"en":"In Puerto Rico, people often snack on mamoncillos in the summer.","zh":"在波多黎各，人们夏天常把 mamoncillos 当零食吃。"},{"en":"She peeled the mamoncillo and sucked the sweet-tart pulp off the seed.","zh":"她剥开 mamoncillo，把甜酸的果肉从种子上吸着吃。"}]}],"synonyms":["quenepa","quenepas","Spanish lime","genip","limoncillo"],"phonetic":"/ˌmɑː.mənˈsiː.oʊ/","extraExplanation":["“Mamoncillo”是西班牙语借词，在英语里多见于加勒比移民社区、旅行/美食语境。不同地区叫法很多：波多黎各常说 *quenepa*，多米尼加常见 *quenepas*，有些地方也叫 *limoncillo* 或 *genip*。","吃法上通常是用手剥开外皮，含着/吸着果肉吃；果肉比较“黏”、纤维感明显，这一点与龙眼、荔枝等口感不太一样。","英语里的“Spanish lime”并不是真的酸橙（lime），而是民间俗称，主要因为外形和酸甜口感让人联想到柑橘类。"]}
{"word":"mamoncillos","summary":{"en":"Mamoncillos are small Caribbean tropical fruits with sweet-tart pulp around a large seed.","zh":"Mamoncillos 是加勒比地区常见的小型热带水果，果肉酸甜、包着大种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small tropical fruit (the plural of mamoncillo) with a thin green skin and sweet-tart pulp around a large seed, popular in the Caribbean and parts of Latin America.","zh":"（mamoncillo 的复数）一种热带小水果，外皮薄而绿色，果肉酸甜包着大种子，常见于加勒比地区和拉丁美洲部分地区。"},"examples":[{"en":"In Puerto Rico, people often buy mamoncillos from street vendors in summer.","zh":"在波多黎各，夏天人们常从路边摊买 mamoncillos 来吃。"},{"en":"She peeled the mamoncillos and sucked the pulp off the seed.","zh":"她剥开 mamoncillos，把果肉从种子上吸下来。"},{"en":"At the family party, a bowl of mamoncillos sat next to mangoes and pineapple.","zh":"家庭聚会上，一碗 mamoncillos 放在芒果和菠萝旁边。"}]}],"synonyms":["mamoncillo","quenepas","genips","Spanish lime"],"phonetic":"ˌmæmənˈsɪloʊz","extraExplanation":["“mamoncillos”多用于加勒比英语语境，是从西班牙语借来的词；不同地区也常叫 quenepas、genips、Spanish lime（并不是真正的酸橙）等。","这种水果学名常见为 Melicoccus bijugatus；吃法通常是咬开或剥皮后吸食果肉，最后吐出大种子。"]}
{"word":"mamoty","summary":{"en":"“Mamoty” is not a standard English word; it is most likely a misspelling of “mammoth,” meaning either very large or the extinct Ice Age animal.","zh":"“mamoty”不是标准英语单词；它很可能是“mammoth”的拼写错误，意思是“巨大的”或“猛犸象（冰河时代的灭绝动物）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"If you meant **mammoth**, it means extremely large; or a large extinct elephant-like animal with long curved tusks.","zh":"如果你想写的是 **mammoth**，它表示“极其巨大的”；也可指“猛犸象（已灭绝、像大象、有长弯象牙的动物）”。"},"examples":[{"en":"They faced a mammoth task to finish the project in one week.","zh":"他们要在一周内完成项目，任务非常艰巨。"},{"en":"We saw a mammoth skeleton in the museum.","zh":"我们在博物馆里看到了猛犸象的骨架。"}]},{"partOfSpeech":"n.","definition":{"en":"An extinct, elephant-like animal (a mammoth), often associated with the Ice Age.","zh":"猛犸象：一种已灭绝的、类似大象的动物，常与冰河时代联系在一起。"},"examples":[{"en":"Scientists study mammoths to learn about ancient climates.","zh":"科学家研究猛犸象来了解古代气候。"}]}],"synonyms":["huge","enormous","gigantic","massive","colossal"],"phonetic":"/ˈmæməθ/","extraExplanation":["“mamoty”在英语里不是常见标准拼写。最可能是把 **mammoth** 拼错了（中间有两个 m）。","**mammoth** 既能当形容词（= huge/very big），也能当名词（= 猛犸象）。日常表达里更常用形容词义，如 *a mammoth effort / a mammoth crowd*。"]}
{"word":"mampalon","summary":{"en":"“Mampalon” doesn’t appear to be a standard English word; it’s likely a name or a misspelling. Share the sentence/context and I can identify the intended word.","zh":"“mampalon”不是常见英语词，可能是名字或拼写错误。提供句子/上下文我就能帮你确认想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a surname/place name, or a word from another language.","zh":"不是标准英语词汇。更可能是拼写错误、姓氏/地名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “mampalon” in major English dictionaries—could it be a name or a typo?","zh":"我在主要英语词典里查不到“mampalon”——它会不会是名字或拼写错误？"},{"en":"If you meant “mammon,” the meaning is related to money/wealth.","zh":"如果你想写的是“mammon”，它的意思与金钱/财富有关。"}]}],"phonetic":"/ˈmæm.pəˌlɑn/","extraExplanation":["我没能在常见英语词典中找到“mampalon”的词条。为了更准确帮你：请告诉我它出现的句子/上下文、来源（书名、歌曲、游戏、聊天等）、或你想表达的意思。","它也可能是拼写接近的词，例如：mammon（对金钱的崇拜/财富）、mangling（弄乱/毁坏，动名词）、mandolin（曼陀林，一种乐器）等；但需要上下文才能确认。"]}
{"word":"mampara","summary":{"en":"Mampara (Spanish) means a partition/screen used to separate spaces, often a shower screen or divider.","zh":"mampara（西语）指用来分隔空间的隔板/屏风/隔断，常见于淋浴挡水玻璃或室内分隔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a partition or screen that separates spaces (often a light divider, such as a shower screen or office divider)","zh":"（西班牙语）隔板；屏风；隔断（常指轻便的空间分隔物，如淋浴房挡水玻璃、办公室隔断）"},"examples":[{"en":"In the bathroom, they installed a glass mampara to keep water from splashing out of the shower.","zh":"在浴室里，他们装了一块玻璃mampara（挡水隔板），防止淋浴水溅出来。"},{"en":"A mampara divides the waiting area from the reception desk.","zh":"一块mampara把等候区和前台隔开。"}]}],"synonyms":["partition","divider","screen","panel","shower screen"],"phonetic":"/məˈmɑːpɹə/","extraExplanation":["“mampara”主要是西班牙语词，在西语国家日常生活中很常见：可以指浴室的淋浴隔断（mampara de ducha）、办公室/柜台的隔板、房间里的屏风等。英语里一般不用这个词，更常说 partition / divider / screen / shower screen。","在拉美某些地区，“mampara”也可指柜台前的挡板或透明隔离板（例如服务窗口的玻璃隔板）。"]}
{"word":"mampus","summary":{"en":"Mampus is Caribbean informal slang for very strong (often cheap) rum or hard liquor.","zh":"Mampus是加勒比地区的非正式说法，指很烈（常较廉价）的朗姆酒或烈酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Caribbean, informal) Very strong, often cheap rum or other hard liquor; sometimes used loosely for any powerful alcoholic drink.","zh":"（加勒比英语，非正式）度数很高、常较廉价的朗姆酒或烈酒；有时也泛指“很烈的酒”。"},"examples":[{"en":"He brought a bottle of mampus to the party, and everyone knew it was going to be a loud night.","zh":"他带了一瓶mampus去派对，大家都知道今晚肯定会很嗨。"},{"en":"That drink isn’t for beginners—it’s straight mampus.","zh":"那种酒不适合新手——就是纯粹的烈酒（mampus）。"}]}],"synonyms":["overproof rum","moonshine","hard liquor","strong rum"],"phonetic":"/ˈmæmpəs/","extraExplanation":["“mampus”在标准美式英语里非常少见，更常出现在加勒比地区的英语口语与书写中，用来指“特别烈的朗姆酒/烈酒”，带一点俚语色彩。","如果你是在小说、歌词或地方新闻里看到它，通常是在表现地域文化、酒吧场景或人物口吻（带有加勒比地域风味）。"]}
{"word":"mamry","summary":{"en":"“mamry” is not a standard English word; you probably mean “memory” (remembering; or computer storage).","zh":"“mamry”不是标准英文单词；你可能想写的是“memory”（记忆/回忆；或电脑/手机的内存/存储）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) The ability to remember information, experiences, and people; what you remember.","zh":"（你可能想写的是 memory）记忆力；记忆的内容（你记得的事、经历或人）。"},"examples":[{"en":"My memory isn’t great with names.","zh":"我对名字的记忆不太好。"},{"en":"That trip is a happy memory for me.","zh":"那次旅行对我来说是一段快乐的回忆。"}]},{"partOfSpeech":"n.","definition":{"en":"The part of a computer or phone that stores data for use (temporary or long-term).","zh":"（计算机/手机）存储器；内存，用来存储和使用数据。"},"examples":[{"en":"This app uses a lot of memory.","zh":"这个应用很占内存。"},{"en":"I need more memory on my phone.","zh":"我的手机需要更大的存储空间/内存。"}]}],"synonyms":["recollection","remembrance","mind","storage","RAM"],"phonetic":"/ˈmɛməri/","extraExplanation":["“mamry”不是常见英文单词，最常见的情况是把“memory”拼错了。正确拼写：m-e-m-o-r-y。","“memory”在日常生活中通常指“记忆/回忆”；在科技语境里常指“内存/存储”。具体含义要看上下文（例如 computer/phone 等词会提示是“内存”）。"]}
{"word":"mamsell","summary":{"en":"“Mamsell” is a dated English spelling of French “mademoiselle,” meaning “Miss.”","zh":"“mamsell”是较过时的英文写法，源自法语“mademoiselle”，意为“小姐/未婚女士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated) A French-style form of address meaning “Miss,” used for an unmarried young woman; also a casual spelling/pronunciation of “mademoiselle.”","zh":"（过时）法语式的称呼，意为“小姐/未婚女士”；也常被当作“mademoiselle（小姐）”的口语拼写或读音。"},"examples":[{"en":"The waiter said, “This way, mamsell,” in a joking French accent.","zh":"服务员用开玩笑的法式口音说：“这边走，mamsell（小姐）。”"},{"en":"In the old novel, he kept calling her “mamsell,” as if she were a girl.","zh":"在那本老小说里，他总叫她“mamsell”，好像她还是个小姑娘。"},{"en":"Tourists sometimes say “mamsell,” but in modern French it’s safer to use “madame” in formal settings.","zh":"游客有时会说“mamsell”，但在现代法语里，正式场合更稳妥的是用“madame（女士）”。"}]}],"synonyms":["mademoiselle","Miss"],"phonetic":"/mæmˈzɛl/","extraExplanation":["“mamsell”主要出现在英文作品里，是对法语“mademoiselle”的英文化/口语化写法（有时也写作“mam’selle”）。在戏剧、小说中常用来营造法式氛围或人物口音。","文化使用上要注意：在当代法语环境里，“mademoiselle”作为对成年女性的正式称呼已变得不常用，可能被认为带有以婚姻状态区分女性的意味；不确定时用“madame（女士）”更稳妥。"]}
{"word":"mamushi","summary":{"en":"Mamushi is a Japanese word used in English to mean the venomous Japanese pit viper.","zh":"Mamushi 在英语中通常指“日本蝮”这种有毒的蝮蛇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a venomous Japanese pit viper (Gloydius blomhoffii), commonly found in Japan and sometimes mentioned in Japanese culture and folklore","zh":"蝮蛇（日本蝮，学名 *Gloydius blomhoffii*），日本常见的有毒蝰蛇之一，也常出现在日本文化与民间故事中"},"examples":[{"en":"Hikers in Japan are advised to watch for mamushi in grassy areas.","zh":"在日本徒步时，常会提醒人们在草丛地带留意蝮蛇（mamushi）。"},{"en":"The documentary explained how the mamushi uses heat-sensing pits to locate prey.","zh":"纪录片解释了蝮蛇（mamushi）如何利用感热的“颊窝”来定位猎物。"}]}],"synonyms":["Japanese pit viper","pit viper","Japanese viper"],"phonetic":"/məˈmuːʃi/","extraExplanation":["“mamushi（まむし）”是日语外来词的罗马字写法，英语里多用于指日本的这种毒蛇本身，属于比较专门的词汇。日常英文中更常说 pit viper（响尾蛇同科的“蝮蛇类/蝰蛇类”）或 Japanese pit viper（日本蝮）。","在日语语境里，“まむし”有时也会带有比喻色彩，用来形容“阴险、狡猾”的人（语感偏负面）；但在英语里通常不这样用，更多是动物学意义。","日本一些地区也有以“まむし”命名的药酒/滋补酒（例如“まむし酒”），说法带有民俗与传统养生色彩；英语中若要表达，可说 mamushi-infused liquor / mamushi liquor，并补充说明以免误解。"]}
{"word":"mamzer","summary":{"en":"Mamzer is a Hebrew/Yiddish-origin noun that can mean a specific “forbidden-birth status” in Jewish law, and it is also used (offensively) as an insult like “bastard.”","zh":"Mamzer 是源自希伯来语/意第绪语的名词：一是犹太教律法中的特定身份术语；二是在口语中也可能被当作侮辱性骂人话，类似“混蛋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Jewish law) A child born from certain forbidden relationships; traditionally a serious legal/religious status in Judaism.","zh":"（犹太教律法）指出生于某些被严格禁止的亲属/婚姻关系中的孩子；在传统犹太法律中属于严重的法律/宗教身份分类。"},"examples":[{"en":"In traditional Jewish law, a mamzer may face restrictions on whom they can marry.","zh":"在传统犹太教律法中，mamzer 可能在婚姻对象方面受到限制。"},{"en":"The novel mentions the word mamzer to show how harsh social labels can be.","zh":"小说提到 mamzer 这个词，用来表现社会标签的严苛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, offensive) A rude insult meaning “bastard,” used to express anger at someone.","zh":"（非正式，冒犯性）粗鲁的辱骂，类似“混蛋/杂种”，用来表达对某人的愤怒。"},"examples":[{"en":"He shouted an offensive slur at the driver.","zh":"他对那位司机喊了带冒犯性的辱骂。"},{"en":"It’s better to avoid words like mamzer in polite conversation.","zh":"在正式或礼貌的场合，最好避免使用像 mamzer 这样的词。"}]}],"synonyms":["bastard (offensive)","jerk (informal)","rude person"],"phonetic":"/ˈmɑmzər/","extraExplanation":["这个词来自希伯来语 mamzer（ממזר）。在犹太教律法语境里，它是一个非常具体且敏感的法律/身份术语，不等同于英文日常里“私生子”的泛称。","在现代英语对话中，它有时被当作辱骂词使用，通常会被视为带有侮辱性甚至可能涉及反犹语境的冒犯表达；建议谨慎使用或改用中性表达（如 rude person / jerk 等）。"]}
