{"word":"maoism","summary":{"en":"Maoism is the ideology associated with Mao Zedong and, more broadly, the politics and policies linked to his era.","zh":"Maoism 指与毛泽东相关的意识形态，也可泛指与其时代相连的政治与政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political ideology and movement based on the ideas of Mao Zedong, especially emphasizing peasant-led revolution, mass mobilization, and continued class struggle under socialism","zh":"毛主义；以毛泽东思想为核心的政治意识形态与运动，常强调以农民为主的革命、群众动员，以及在社会主义条件下继续阶级斗争"},"examples":[{"en":"In history class, we studied how Maoism shaped politics in mid-20th-century China.","zh":"在历史课上，我们学习了毛主义如何影响20世纪中期中国的政治。"},{"en":"Some revolutionary groups abroad adopted Maoism as a model for guerrilla struggle.","zh":"一些海外革命团体曾把毛主义当作游击斗争的范本。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader use) the policies or style of rule associated with Mao Zedong’s period of leadership","zh":"（更宽泛的用法）与毛泽东执政时期相关的政策或治理风格"},"examples":[{"en":"The book critiques the excesses of Maoism during the Cultural Revolution.","zh":"这本书批评了“文革”时期毛主义实践中的过激之处。"},{"en":"People debate how to evaluate Maoism in terms of social change and human cost.","zh":"人们争论应如何从社会变革与人道代价的角度评价毛主义。"}]}],"synonyms":["Mao Zedong Thought","Marxism-Leninism (in some contexts)"],"phonetic":"/ˈmaʊ.ɪz.əm/","extraExplanation":["“Maoism”在英文里既可以指一种思想体系（意识形态/理论），也常被用来概括与毛泽东时代相关的政治实践与政策；具体含义通常要看语境。","学术写作中，谈到“毛主义”时常会与“Marxism-Leninism（马克思列宁主义）”并置，表示其被视为在特定历史与社会条件下的发展或变体。"]}
{"word":"maoist","summary":{"en":"Maoist means “related to Mao Zedong or Maoism,” and it can also mean “a follower of Maoism.”","zh":"Maoist 指“与毛泽东或毛主义有关的”，也可指“毛主义的追随者/支持者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mao Zedong or to the political ideas and movement based on his interpretation of Marxism-Leninism","zh":"与毛泽东有关的；与毛主义（基于毛泽东对马克思列宁主义的解释所形成的政治思想与运动）有关的"},"examples":[{"en":"Some groups in the 1960s described themselves as Maoist and supported rural revolution.","zh":"一些20世纪60年代的团体自称为毛主义者，并支持以农村革命为核心的路线。"},{"en":"The book compares Soviet-style communism with Maoist policies in China.","zh":"这本书比较了苏联式共产主义与中国的毛主义政策。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports or follows Maoism","zh":"毛主义者；信奉或支持毛主义的人"},"examples":[{"en":"He was a Maoist in college and joined a student political group.","zh":"他大学时是毛主义者，并加入了一个学生政治团体。"},{"en":"The article interviews former Maoists about why they changed their views.","zh":"这篇文章采访了前毛主义者，讨论他们为何改变观点。"}]}],"synonyms":["pro-Mao","Maoist (as a noun: Maoism supporter)"],"phonetic":"/ˈmaʊ.ɪst/","extraExplanation":["“Maoist / Maoism”在英语语境中既可能是中性描述（政治思想流派的名称），也可能在新闻或争论中带有强烈立场色彩。写作时若想保持客观，可用：“Maoist ideology / Maoist movement / Maoist-influenced groups”等更描述性的表达。","相关搭配：Maoist guerrillas（毛派游击队）、Maoist insurgency（毛派叛乱）、Maoist China（毛时代的中国）。在不同国家语境中，“Maoist”也可能指自称受毛主义影响的政党或武装组织（例如南亚部分地区）。"]}
{"word":"maoists","summary":{"en":"Maoists are people who follow Mao Zedong’s political ideas, or things related to/supporting Maoism.","zh":"Maoists 指信奉毛泽东政治思想的人，或与毛主义相关/支持毛主义的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows Mao Zedong’s ideas about politics and society; someone who supports Maoism (often used for members of communist movements inspired by Mao).","zh":"毛主义者；信奉毛泽东思想或支持毛主义的人（常指受其影响的共产主义运动成员）。"},"examples":[{"en":"In the 1960s, some student groups called themselves Maoists.","zh":"在20世纪60年代，一些学生团体自称为毛主义者。"},{"en":"The book compares Maoists with other left-wing movements of the same period.","zh":"这本书把毛主义者与同一时期的其他左翼运动作比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or supporting Maoism.","zh":"毛主义的；支持毛主义的。"},"examples":[{"en":"They published a Maoist newspaper to spread their political views.","zh":"他们出版了一份毛主义报纸来传播政治观点。"},{"en":"The group split over Maoist versus more moderate strategies.","zh":"该组织因毛主义策略与更温和的策略之争而分裂。"}]}],"synonyms":["followers of Maoism","Maoism supporters","Maoist activists"],"phonetic":"/ˈmaʊ.ɪsts/","extraExplanation":["“Maoists”来自“Maoism（毛主义）”。在英文语境中，这个词常用于描述某些共产党或革命团体的思想路线，尤其强调：农民动员、群众路线、长期游击战等观念。具体含义会因国家和历史时期不同而有所变化。","在新闻或历史写作里，“Maoist”有时是中性分类用语，但也可能带有立场色彩；理解时最好结合上下文（如在讲学术分析、政党名称，还是在讲冲突与安全议题）。"]}
{"word":"maomao","summary":{"en":"“maomao” is usually a nickname/screen name from Chinese contexts, or a pinyin-based cute way related to “cat,” and sometimes a pop-culture proper name.","zh":"“maomao”多见于中文语境的昵称/网名，或源自拼音、带有“猫/可爱”联想的说法，也可能是流行文化中的专有名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(as a name) “MaoMao,” a common nickname or screen name in Chinese contexts, often suggesting something cute or soft (sometimes associated with cats).","zh":"（作名字）“MaoMao”，中文语境里常见的昵称/网名，常带有可爱、软萌的感觉（有时会让人联想到猫）。"},"examples":[{"en":"Her online name is MaoMao, and she posts cat photos.","zh":"她的网名是MaoMao，她会发很多猫的照片。"},{"en":"We call the baby MaoMao at home.","zh":"我们在家里叫宝宝“MaoMao”。"}]},{"partOfSpeech":"other","definition":{"en":"(in Mandarin pinyin) māo māo—an informal, cute-sounding repetition that can be linked to “cat/cat” or a childlike way of referring to a cat (context-dependent).","zh":"（汉语拼音）māo māo——一种口语里显得可爱的叠词表达，可与“猫/小猫”的联想相关（具体含义看语境）。"},"examples":[{"en":"In some families, a cat may be called māo māo in a childlike way.","zh":"有些家庭里，会用更童趣的说法把猫叫作“māo māo”。"},{"en":"The kid pointed at the animal and said, “māo māo!”","zh":"孩子指着那只动物说：“māo māo！”"}]},{"partOfSpeech":"n.","definition":{"en":"(pop culture) Mao Mao, a character/title used in some English media (e.g., an animated series title/character name), used as a proper noun.","zh":"（流行文化）Mao Mao，英语媒体中出现过的角色名/作品名（如动画剧集标题或角色名），作专有名词使用。"},"examples":[{"en":"They were talking about the show Mao Mao after class.","zh":"下课后他们在聊《Mao Mao》那部动画。"}]}],"synonyms":["MaoMao (proper name)","kitty (similar feeling in English)","nickname","screen name"],"phonetic":"/ˈmaʊ ˌmaʊ/","extraExplanation":["“maomao”在英语里不是一个固定的词汇，更常见于：1）中文拼音转写（māo māo）；2）昵称/网名；3）作品或角色的专有名词。","如果你想表达中文“猫猫”（很可爱地说“猫”），英文里更自然的说法通常是 “kitty/kitty cat” 或 “little cat”，而不是直接写 maomao。","拼音的声调会影响意思：例如 māo（猫）与 mǎo、máo 等读音不同，含义也可能不同；但在不标声调的情况下（maomao）往往只保留“可爱昵称”的感觉。"]}
{"word":"Maori","summary":{"en":"Māori refers to the Indigenous people of New Zealand and also to their language and related culture.","zh":"Māori 指新西兰的原住民族群“毛利人”，也可指毛利语及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Indigenous people of Aotearoa New Zealand (New Zealand).","zh":"（新西兰）毛利人；新西兰的原住民族群。"},"examples":[{"en":"The Māori are the Indigenous people of New Zealand.","zh":"毛利人是新西兰的原住民族群。"},{"en":"She is Māori and speaks te reo Māori at home.","zh":"她是毛利人，在家里说毛利语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Māori people or their culture, language, or traditions.","zh":"毛利人的；与毛利文化、语言或传统有关的。"},"examples":[{"en":"We visited a Māori cultural center.","zh":"我们参观了一个毛利文化中心。"},{"en":"The museum has Māori carvings and woven art.","zh":"这家博物馆有毛利雕刻和编织艺术品。"}]},{"partOfSpeech":"n.","definition":{"en":"the Māori language (often called te reo Māori).","zh":"毛利语（常称 te reo Māori）。"},"examples":[{"en":"He is learning Māori at school.","zh":"他在学校学习毛利语。"},{"en":"Many place names in New Zealand come from Māori.","zh":"新西兰许多地名源自毛利语。"}]}],"synonyms":["Māori people","te reo Māori"],"phonetic":"/ˈmaʊri/","extraExplanation":["“Māori”常见两种写法：Māori（带长音符号 macron）与 Maori（不带）。在新西兰语境中，使用“Māori”更尊重也更常见。","英语里常把“Māori”读作 /ˈmaʊri/（接近“毛-瑞”）。在毛利语中元音长短很重要，ā 的音更长。","“te reo Māori”直译为“毛利人的语言”，在新西兰公共场合与教育体系中越来越常见。"]}
{"word":"maoridom","summary":{"en":"Māoridom means the Māori people as a collective, and by extension Māori culture and community life.","zh":"Māoridom 指毛利人的整体（社群），也可泛指毛利文化与社群生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Māori people considered as a group, especially as a community with shared identity, culture, and social life","zh":"（总称）毛利人；尤指作为一个共享身份、文化与社会生活的社群"},"examples":[{"en":"The new policy was widely discussed within Māoridom.","zh":"这项新政策在毛利社群中被广泛讨论。"},{"en":"She works to support education initiatives across Māoridom.","zh":"她致力于支持整个毛利社群的教育项目。"}]},{"partOfSpeech":"n.","definition":{"en":"Māori culture, traditions, and ways of life in general","zh":"毛利文化与传统；毛利人的生活方式（统称）"},"examples":[{"en":"The museum created an exhibit that highlights Māoridom and its history.","zh":"博物馆策划了一个展览，突出展示毛利文化及其历史。"},{"en":"His writing reflects a deep respect for Māoridom.","zh":"他的写作体现出对毛利文化的深深敬意。"}]}],"synonyms":["Māori community","Māori people (collective)","Māori society","Māori culture"],"phonetic":"/ˈmaʊriˌdəm/","extraExplanation":["“Māoridom”多用于新西兰英语语境，常写作带长音符的“Māoridom”（Māori中的ā表示长元音）。在正式写作中通常大写，强调其作为群体/文化整体的概念。","这个词有时会出现在政治、教育、媒体讨论中，用来概括“毛利社群/毛利世界”的观点与利益；使用时注意尊重语境，避免把多样的个体经验简化成单一立场。"]}
{"word":"maoriland","summary":{"en":"“Maoriland” is a historical, poetic name for New Zealand, used mainly in older literature.","zh":"“Maoriland”是对新西兰的历史性、诗意称呼，主要见于较早的文学作品中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical, literary) A poetic or romantic name for New Zealand, highlighting Māori culture; common in late 19th–early 20th century writing.","zh":"（历史/文学用语）对新西兰的诗意或浪漫称呼，强调毛利文化；常见于19世纪末至20世纪初的写作中。"},"examples":[{"en":"In early poems, writers sometimes called New Zealand “Maoriland.”","zh":"在早期诗歌里，作家有时把新西兰称为“Maoriland（毛利之地）”。"},{"en":"The magazine promoted “Maoriland” stories for readers overseas.","zh":"那本杂志向海外读者推广“Maoriland”的故事。"}]}],"synonyms":["New Zealand (poetic)","Aotearoa"],"phonetic":"/ˈmaʊəriˌlænd/","extraExplanation":["“Maoriland”并不是现代常用地名，而是一种带有殖民时代色彩的文学称呼，常用于营造“异域、浪漫、传统”的想象。今天更中性、常见的说法是“New Zealand”或毛利语名“Aotearoa”。在当代语境中使用“Maoriland”可能显得过时，甚至可能被理解为对毛利文化的刻板印象，因此建议只在历史或文学讨论中使用。"]}
{"word":"maorilander","summary":{"en":"“Maorilander” is an informal term (often used in Australia) for a New Zealander, and it can be playful or mildly offensive depending on context.","zh":"“Maorilander”是一个非正式用语（常见于澳大利亚），指“新西兰人”，语气可能是玩笑式的，也可能带轻微冒犯，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Australian English) A New Zealander; someone from New Zealand (often used by Australians, sometimes playfully, sometimes mildly insulting).","zh":"（非正式，主要为澳大利亚英语）新西兰人；来自新西兰的人（常由澳大利亚人使用，有时是开玩笑式的称呼，也可能带一点轻微贬义）。"},"examples":[{"en":"Some Aussies call New Zealanders “Maorilanders,” but it can sound disrespectful.","zh":"有些澳洲人会把新西兰人叫作“Maorilander”，但听起来可能不太尊重。"},{"en":"He moved to Sydney and got used to being labeled a “Maorilander.”","zh":"他搬到悉尼后，慢慢习惯了被叫作“Maorilander”。"}]}],"synonyms":["New Zealander","Kiwi (informal)"],"phonetic":"/ˌmaʊriˈlændɚ/","extraExplanation":["“Maorilander / Māorilander”来自旧称“Maoriland”（曾被用来指新西兰，带有把毛利文化当作新西兰象征的意味）加上“-er”。因为这个词把“毛利（Māori）”当作新西兰整体的标签，可能会让人觉得刻板化或不够尊重；在正式或不熟的场合，建议直接说“New Zealander”或更具体的身份（如“Māori”“Pākehā”等，需看语境与本人认同）。"]}
{"word":"maoris","summary":{"en":"“Maoris” is the plural of “Māori/Maori,” meaning the Indigenous people of New Zealand; the preferred plural is often “Māori.”","zh":"“Maoris”是“Māori/Maori（毛利人）”的复数，但在新西兰语境中更常用且更推荐的复数仍是“Māori”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People of the Indigenous Polynesian ethnic group of New Zealand (plural form of “Māori/Maori”).","zh":"新西兰的波利尼西亚原住民族——毛利人（“Māori/Maori”的复数形式）。"},"examples":[{"en":"Many Maoris (Māori) maintain strong ties to their iwi (tribe).","zh":"许多毛利人依然与自己的部族（iwi）保持紧密联系。"},{"en":"The museum worked with Māori communities to present their history respectfully.","zh":"博物馆与毛利社群合作，以尊重的方式呈现他们的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"The Māori language (less common; often written simply as “Māori” when referring to the language).","zh":"毛利语（较不常见；指语言时通常直接写作“Māori”）。"},"examples":[{"en":"She is learning Māori at school.","zh":"她在学校学习毛利语。"},{"en":"Some public signs include Māori as well as English.","zh":"一些公共标识同时使用毛利语和英语。"}]}],"synonyms":["Māori","Maori people"],"phonetic":"/ˈmaʊri/","extraExplanation":["在新西兰英语中，复数通常也写作“Māori”（不加 -s），因此“Maoris”在当地语境里可能显得不太地道，甚至被认为不够尊重；更推荐用“Māori”作单复数同形，或说“the Māori people / Māori communities”。","拼写上常见“Māori”（带长音符号 macron：ā），更贴近原语发音与书写；无长音的“Maori”也可见，但正式、尊重的写法多用“Māori”。"]}
{"word":"maormor","summary":{"en":"“maormor” isn’t a standard English word; you probably meant “marmot” (a large ground squirrel).","zh":"“maormor”不是标准英语词；你可能想写“marmot”（土拨鼠/大型地松鼠）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This spelling is not a standard English word. It is most likely a misspelling of “marmot,” a large ground squirrel.","zh":"这个拼写不是标准英语单词；很可能是把“marmot”（土拨鼠，一种大型地松鼠）拼错了。"},"examples":[{"en":"I couldn’t find “maormor” in the dictionary—did you mean “marmot”?","zh":"我在词典里找不到“maormor”——你是不是想写“marmot”？"},{"en":"A marmot stood on a rock and whistled to warn the others.","zh":"一只土拨鼠站在岩石上，吹口哨警告其他同伴。"}]},{"partOfSpeech":"n.","definition":{"en":"marmot: a large, stout ground-dwelling rodent found in mountains and grasslands (e.g., in North America, Europe, and Asia).","zh":"marmot：一种体型较大、身体粗壮、生活在地面洞穴里的啮齿动物，常见于山地与草原（分布于北美、欧洲和亚洲等地）。"},"examples":[{"en":"We saw marmots near the hiking trail in the mountains.","zh":"我们在山里的徒步小径附近看到了土拨鼠。"},{"en":"Marmots hibernate during the winter in cold regions.","zh":"在寒冷地区，土拨鼠会在冬天冬眠。"}]}],"synonyms":["groundhog","woodchuck"],"phonetic":"/ˈmɑrmət/","extraExplanation":["“marmot”在北美语境里常被拿来和“groundhog（土拨鼠/美洲旱獭）”混用，但严格来说groundhog是marmot的一种（woodchuck）。","如果你其实想表达的是其他语言的词（例如瑞典语“mormor”=外婆），告诉我你想用的语言/语境，我可以给出对应解释与用法。"]}
