{"word":"maquahuitl","summary":{"en":"A Mesoamerican (especially Aztec) wooden club weapon edged with obsidian blades.","zh":"一种中美洲（尤指阿兹特克）镶黑曜石刃的木质棍棒武器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Mesoamerican weapon, especially associated with the Aztec (Mexica): a wooden club set with sharp obsidian blades along the sides.","zh":"一种传统的中美洲武器，尤与阿兹特克（墨西加）相关：在木质棍棒两侧镶嵌黑曜石刀片的“黑曜石刃木剑/木棒”。"},"examples":[{"en":"The museum displayed a maquahuitl with obsidian blades embedded in a wooden body.","zh":"博物馆展出了一把 maquahuitl：木身两侧嵌着黑曜石刀片。"},{"en":"In many accounts of the Spanish conquest, warriors are described fighting with the maquahuitl.","zh":"在许多关于西班牙征服的记述中，战士常被描写为使用 maquahuitl 作战。"}]}],"synonyms":["macuahuitl","obsidian-edged club"],"phonetic":"/ˌmɑːkwəˈwiːtəl/","extraExplanation":["“maquahuitl”一词来自纳瓦特尔语（Nahuatl），通常指阿兹特克等族群使用的镶黑曜石刃的木制武器。它并不是金属剑：木身提供支撑，黑曜石负责切割。","在英文材料里也常写作 “macuahuitl”。很多现代复原与影视作品会把它误画成“链锯式大刀”，但传统形制更接近“厚木板/球棒”侧边嵌刃。"]}
{"word":"maquereau","summary":{"en":"Maquereau is a French word meaning “mackerel,” and it can also mean “pimp” in slang.","zh":"Maquereau 是法语词，常指“鲭鱼”，在俚语中也可指“皮条客”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mackerel; a type of ocean fish often eaten as food","zh":"鲭鱼；一种常见的海鱼，常作为食物"},"examples":[{"en":"We grilled maquereau with lemon and herbs.","zh":"我们把鲭鱼配柠檬和香草烤来吃。"},{"en":"Maquereau is rich in omega-3 fats.","zh":"鲭鱼富含欧米伽-3脂肪酸。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, from French) a pimp; a man who profits from a sex worker’s earnings","zh":"（俚语，源自法语）皮条客；靠性工作者收入牟利的人"},"examples":[{"en":"In the novel, the detective tracks a maquereau who controls several women.","zh":"在小说里，侦探追查一个控制多名女性的皮条客。"},{"en":"The film portrays how a maquereau exploits vulnerable people.","zh":"这部电影呈现了皮条客如何剥削弱势群体。"}]}],"synonyms":["mackerel","pimp"],"phonetic":"/ˌmækəˈroʊ/","extraExplanation":["“Maquereau”是法语词：字面义是“鲭鱼”。在法语里它也有“皮条客”的俚语义，这种转义常被解释为带有贬义与社会批判色彩。","在英语中，这个拼写的“maquereau”不算常见：谈鱼类更常用英语词“mackerel”；谈犯罪/剥削语境时，也更常见直接说“pimp”。使用该词时要注意语境与冒犯性。"]}
{"word":"maquette","summary":{"en":"A maquette is a small model used to plan or preview a larger artwork or architectural design.","zh":"maquette 指用于规划或预览大型艺术作品或建筑设计的小型模型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, usually unfinished model made to show what a larger sculpture, building, or design will look like.","zh":"（通常未完成的）小型模型，用来展示更大雕塑、建筑或设计的外观与构想。"},"examples":[{"en":"The sculptor made a clay maquette before carving the final statue.","zh":"雕塑家在雕刻最终雕像之前，先做了一个黏土小模型。"},{"en":"The architect presented a maquette of the museum to explain the layout.","zh":"建筑师展示了博物馆的模型，用来说明空间布局。"}]}],"synonyms":["model","scale model","prototype","mock-up"],"phonetic":"/mæˈkɛt/","extraExplanation":["“maquette”是法语借词（常用于艺术与建筑领域）。在创作流程中，它常用于测试比例、结构、光影与整体感觉，类似“概念模型/小样”。","在建筑语境里，maquette有时也可指更精致的展示模型；但更口语的说法常用“model”或“scale model”。"]}
{"word":"maquettes","summary":{"en":"Maquettes are small preliminary models used to plan or preview a larger artwork, building, or design.","zh":"Maquettes 指用于规划或预览大型作品/建筑/设计的小样模型（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small preliminary models (often scaled down) used to plan or show what a larger sculpture, building, stage set, or design will look like","zh":"（常为缩小比例的）小样模型，用来规划或展示更大型的雕塑、建筑、舞台布景或设计最终会是什么样子"},"examples":[{"en":"The architect presented several maquettes to help the client visualize the new museum.","zh":"建筑师展示了几个小样模型，帮助客户想象新博物馆的样子。"},{"en":"Before carving the statue, the artist made clay maquettes to test the pose.","zh":"在雕刻雕像之前，艺术家先做了泥塑小样来测试姿势。"},{"en":"The stage designer built maquettes of the set so the director could plan the lighting.","zh":"舞台设计师搭建了布景小样模型，方便导演规划灯光。"}]}],"synonyms":["scale models","mock-ups","prototypes"],"phonetic":"/mæˈkɛt/","extraExplanation":["“maquette”源自法语，在艺术、建筑与舞台设计领域很常见。它通常指“用于构思/展示的初步小模型”，比“model”更强调“前期试做、方案推敲”的用途。","用法提示：你输入的“maquettes”是复数形式；单数是“a maquette”。在日常英语中也常用“scale model（比例模型）”来表达类似意思。"]}
{"word":"maqui","summary":{"en":"Maqui is a South American berry (and the plant that grows it), popular in juices and supplements.","zh":"Maqui 指马基莓（及其植株），一种南美浆果，常见于饮品与营养补充品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dark-purple berry from a South American evergreen shrub (maqui), often used in juices, powders, and supplements","zh":"马基莓；一种来自南美洲常绿灌木的深紫色小浆果，常用于果汁、粉末或保健品"},"examples":[{"en":"Maqui berries are often added to smoothies for their deep color and tart flavor.","zh":"马基莓常被加入奶昔里，带来深紫色和酸涩风味。"},{"en":"The label says this drink contains maqui and blueberry.","zh":"标签上写这款饮料含有马基莓和蓝莓。"}]},{"partOfSpeech":"n.","definition":{"en":"the evergreen shrub (Aristotelia chilensis) that produces maqui berries","zh":"马基莓树；结马基莓的常绿灌木（学名 Aristotelia chilensis）"},"examples":[{"en":"The maqui plant grows naturally in parts of Chile and Argentina.","zh":"马基莓树自然生长在智利和阿根廷的部分地区。"}]}],"synonyms":["maqui berry","Aristotelia chilensis"],"phonetic":"/ˈmɑːki/","extraExplanation":["“Maqui”一词源自智利原住民马普切人（Mapuche）的语言；在英语里多见于食品、健康饮品与营养补充剂的商品描述。","在日常英文中常写作 maqui berry / maqui berries；作为可数名词使用：one maqui berry, two maqui berries。","温和提醒：在英语语境里常会提到“antioxidants（抗氧化物）”等健康相关说法，但具体功效与医学结论应以权威来源为准。"]}
{"word":"maquillage","summary":{"en":"Maquillage means makeup, and sometimes (figuratively) a cover-up or disguise.","zh":"Maquillage 指“化妆/妆容”，也可比喻“粉饰、掩饰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"makeup; the cosmetics used to change or improve someone’s appearance (often in fashion, theater, or film contexts).","zh":"（尤用于时尚、戏剧或电影语境的）化妆；化妆品/妆容。"},"examples":[{"en":"The actor’s maquillage looked natural under the stage lights.","zh":"演员的妆在舞台灯光下看起来很自然。"},{"en":"She spent extra time on her maquillage before the photo shoot.","zh":"拍摄前她花了更多时间在化妆上。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a surface-level cover-up meant to hide flaws or the truth; a disguise.","zh":"（比喻）表面的掩饰；粉饰；伪装。"},"examples":[{"en":"The report was just maquillage for deeper problems in the company.","zh":"这份报告只是对公司更深层问题的粉饰。"},{"en":"A few polite words can be maquillage for anger.","zh":"几句客套话可能只是对愤怒的掩饰。"}]}],"synonyms":["makeup","cosmetics","face paint","cover-up","disguise"],"phonetic":"/ˌmæk.iˈɑːʒ/","extraExplanation":["“Maquillage”来自法语，英语里多用于较正式或带“时尚/艺术圈”气息的语境；日常英语更常说“makeup”。","在评论文章或文学语境中，它也常被用作比喻，强调“用漂亮表面遮住真实问题”的意味，因此带一点批评色彩。"]}
{"word":"maquiritare","summary":{"en":"Maquiritare usually refers to the Ye'kuana people of the upper Orinoco region or their Cariban language.","zh":"Maquiritare 通常指奥里诺科河上游地区的耶库阿纳（马基里塔雷）族群，或指他们的加勒比语系语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people of the upper Orinoco River region (mainly in Venezuela and parts of Brazil); also spelled Makiritare and commonly known as the Ye'kuana","zh":"（马基里塔雷人）奥里诺科河上游地区的原住民族之一（主要在委内瑞拉及巴西部分地区）；也常写作 Makiritare，并常被称为 Ye'kuana（耶库阿纳人）"},"examples":[{"en":"The museum exhibit included baskets made by Maquiritare (Ye'kuana) artisans.","zh":"博物馆展览中有马基里塔雷（耶库阿纳）工匠制作的篮子。"},{"en":"A researcher traveled to the upper Orinoco to learn about Maquiritare communities.","zh":"一位研究者前往奥里诺科河上游，了解马基里塔雷人的社区。"}]},{"partOfSpeech":"n.","definition":{"en":"the language of the Maquiritare (Ye'kuana) people, a Cariban language","zh":"马基里塔雷（耶库阿纳）人的语言，属加勒比语系（Cariban languages）"},"examples":[{"en":"She is documenting Maquiritare to help support language education for children.","zh":"她在记录马基里塔雷语，以支持儿童的语言教育。"},{"en":"Some words in Maquiritare describe plants found only in the rainforest.","zh":"马基里塔雷语里有些词用来描述只在雨林中出现的植物。"}]}],"synonyms":["Ye'kuana","Makiritare"],"phonetic":"/məˌkɪrɪˈtɑːreɪ/","extraExplanation":["“Maquiritare / Makiritare / Ye'kuana”在不同资料中可能指同一族群（及其语言），拼写差异多与西班牙语转写、学术传统有关。许多当事人更偏好自称“Ye'kuana”，写作时可优先使用社群自称并在括号中注明其他拼法。"]}
{"word":"maquis","summary":{"en":"Maquis can mean Mediterranean scrubland, or (historically) the French Resistance fighters who hid and fought from such terrain in WWII.","zh":"maquis既可指地中海地区的灌木丛荒原，也可指（二战时期）利用这种地形隐蔽作战的法国抵抗运动成员/组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dense Mediterranean scrub or brushland (especially in Corsica and southern France).","zh":"（尤指科西嘉岛及法国南部的）地中海灌木丛地带；浓密的灌木荒原。"},"examples":[{"en":"We hiked through the maquis above the coast, where the shrubs were shoulder-high.","zh":"我们沿着海岸上方的山坡穿行在马基灌木丛中，灌木几乎齐肩高。"},{"en":"In summer the maquis can smell strongly of rosemary and thyme.","zh":"夏天时，马基灌木丛常会散发出迷迭香和百里香的浓烈气味。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the French Resistance during World War II; the Resistance movement itself (often used as a plural: the maquis).","zh":"（二战时期的）法国抵抗运动成员；法国抵抗组织（常用复数：the maquis）。"},"examples":[{"en":"He joined the maquis to fight the occupation in the mountains.","zh":"他加入了马基游击队，在山区对抗占领军。"},{"en":"Stories of the maquis became symbols of courage and quiet defiance.","zh":"关于马基抵抗者的故事成了勇气与沉着反抗的象征。"}]}],"synonyms":["scrubland","brush","shrubland","French Resistance","Resistance fighters"],"phonetic":"/mæˈkiː/","extraExplanation":["“maquis”原本是法语词，最早主要指科西嘉等地的密灌木地形；这种地形便于隐蔽，因此二战时法国抵抗者常在此活动，词义也延伸为“抵抗组织/游击队”。","用法提示：表示“抵抗组织/抵抗者”时，英语里常说“the maquis”，语感上有点像在说“那些在灌木丛中活动的人/组织”。"]}
{"word":"maquisard","summary":{"en":"A maquisard is a French Resistance fighter in WWII, especially one who fought as a rural guerrilla in occupied France.","zh":"maquisard 指二战时期法国抵抗运动中的“马基”抵抗战士，尤指在乡村/山林中进行游击与秘密行动的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the French Resistance who fought the German occupation (especially in rural guerrilla groups) during World War II; more generally, a guerrilla or underground fighter in occupied France","zh":"（二战期间）法国“马基”抵抗组织成员；指在被占领的法国（尤指乡村地区）进行游击战、秘密抵抗的法国抵抗战士"},"examples":[{"en":"His grandfather was a maquisard who hid in the mountains and sabotaged rail lines.","zh":"他的祖父是一名马基抵抗战士，曾躲在山里破坏铁路线路。"},{"en":"The novel follows a young maquisard as he learns to trust his comrades.","zh":"这部小说讲述一位年轻的马基抵抗战士如何学会信任战友。"}]}],"synonyms":["French Resistance fighter","resistance fighter","guerrilla","partisan"],"phonetic":"/ˌmækiˈzɑrd/","extraExplanation":["“Maquisard”来自法语 maquis（灌木丛、偏僻山林），因为抵抗者常躲在这种难以进入的地形中开展行动。英文里常用于历史语境，尤其是谈到二战时期法国抵抗运动。发音与拼写都带法语色彩，复数常写作 maquisards。"]}

