{"word":"mau","summary":{"en":"“mau” is most commonly seen as MAU (“monthly active users”) in tech/business; it can also refer to “Mau Mau” in Kenyan history, or appear as a Hawaiian/Māori loanword meaning “continue” or “hold.”","zh":"“mau”最常见的是科技/商业中的缩写 MAU（“月活跃用户数”）；也可能指肯尼亚历史中的 “Mau Mau”；或作为夏威夷语/毛利语借词出现，意为“继续”或“抓住”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"MAU: “monthly active users,” a common product/marketing metric meaning the number of unique users who used an app or service in a month.","zh":"MAU： “月活跃用户数”，常见的产品/营销指标，指一个月内使用某个应用或服务的独立用户数量。"},"examples":[{"en":"Our MAU grew by 12% after the new feature launch.","zh":"新功能上线后，我们的 MAU 增长了 12%。"},{"en":"Investors often ask about DAU and MAU for consumer apps.","zh":"投资人常常会问消费类应用的 DAU 和 MAU。"}]},{"partOfSpeech":"n.","definition":{"en":"Mau (in “Mau Mau”): the name commonly used for a Kenyan anti-colonial independence movement in the 1950s.","zh":"Mau（见于 “Mau Mau”）：常用来指代20世纪50年代肯尼亚的反殖民独立运动。"},"examples":[{"en":"The film references the Mau Mau uprising in Kenya.","zh":"这部电影提到了肯尼亚的 Mau Mau 起义。"},{"en":"She studied how the Mau Mau movement shaped modern Kenyan history.","zh":"她研究了 Mau Mau 运动如何影响肯尼亚现代史。"}]},{"partOfSpeech":"other","definition":{"en":"mau (from Hawaiian or Māori, used in some English contexts): “to continue / to keep going” (Hawaiian) or “to hold / to grasp” (Māori).","zh":"mau（源自夏威夷语或毛利语，在少数英语语境中可见）：夏威夷语中有“继续/不断”的意思；毛利语中可表示“握住/抓住”。"},"examples":[{"en":"In Hawaiian, “mau” can describe something that continues.","zh":"在夏威夷语里，“mau”可以用来形容“持续不断”。"},{"en":"In Māori, “mau” can mean to hold fast.","zh":"在毛利语里，“mau”可以表示“牢牢抓住”。"}]}],"synonyms":["monthly active users","active users (monthly)","user metric"],"phonetic":"/maʊ/","extraExplanation":["“mau”在日常英语里不是常用词；最常见的其实是商业/数据分析语境里的缩写 MAU（monthly active users）。如果你是在某段对话、游戏、或某个地区文化内容里看到“mau”，也可能是专有名词（如 Mau Mau）或来自波利尼西亚语言的借词。","发音方面：缩写 MAU 往往会按字母读成 “M-A-U”；而专名 “Mau” 常被读成接近 /maʊ/（类似英文“wow”的韵）。不同语境可能不同。"]}
{"word":"mauby","summary":{"en":"Mauby is a traditional Caribbean bittersweet drink made from mauby tree bark, often flavored with spices and sweetened.","zh":"Mauby 是一种传统加勒比苦甜饮料，以 mauby 树皮煮/泡制成，常加香料并加糖调味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Caribbean drink (usually non‑alcoholic) made by steeping or boiling the bark of the mauby tree with spices and sweetener; it tastes bittersweet and is often served cold.","zh":"一种加勒比地区的饮料（通常不含酒精），用 mauby 树皮浸泡或煮制，再加入香料与甜味剂；口感苦甜，常冷饮。"},"examples":[{"en":"My aunt makes mauby with cinnamon and orange peel.","zh":"我阿姨会用肉桂和橙皮来做 mauby。"},{"en":"In Trinidad, you can buy bottled mauby at many corner shops.","zh":"在特立尼达，很多街角小店都能买到瓶装 mauby。"},{"en":"It’s an acquired taste, but some people love the bitter bite of mauby.","zh":"它的味道需要慢慢适应，但有些人很喜欢 mauby 那种微苦的冲劲。"}]}],"synonyms":["mabi","mabí"],"phonetic":"ˈmɔːbi","extraExplanation":["“mauby”常见于加勒比英语（如特立尼达和多巴哥、巴巴多斯、格林纳达等）。写法也可见“mabi / mabí”。它通常用树皮（在一些地区指 Colubrina 属植物的树皮）煮或泡出带苦味的茶，再加糖、丁香、肉桂、姜等调味；也有人会发酵做成微起泡或含少量酒精的版本。","文化上，mauby 常被当作家常饮品或传统清凉饮料；很多人把它和“夏天、家里长辈做的饮料、路边小店瓶装饮料”的记忆联系在一起。"]}
{"word":"maucaco","summary":{"en":"“maucaco” isn’t standard English; you likely mean “macaque” (a kind of monkey) or Portuguese “macaco” (“monkey”).","zh":"“maucaco”不是标准英语；你可能想写“macaque”（一种猕猴）或葡萄牙语“macaco”（猴子）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “macaque” (a type of monkey) or a non-English word (Portuguese “macaco,” meaning “monkey”).","zh":"不是标准英语单词。很可能是把“macaque（猕猴/短尾猴的一类）”拼错了，或是非英语词（葡萄牙语“macaco”，意为“猴子”）。"},"examples":[{"en":"Did you mean “macaque,” the monkey often seen in Asian forests and temples?","zh":"你是不是想写“macaque”，就是在亚洲森林或寺庙附近常见的猕猴？"},{"en":"In Portuguese, “macaco” simply means “monkey.”","zh":"在葡萄牙语里，“macaco”就是“猴子”的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “macaque”) a medium-sized Old World monkey found mainly in Asia and North Africa.","zh":"（如果你想写的是“macaque”）一种中等体型的旧大陆猴，主要分布在亚洲和北非。"},"examples":[{"en":"Researchers studied how macaques use tools to find food.","zh":"研究人员观察猕猴如何使用工具寻找食物。"},{"en":"Please don’t feed the macaques; it can make them aggressive.","zh":"请不要喂猕猴；这可能让它们变得有攻击性。"}]}],"synonyms":["monkey","ape (general, not exact)","macaque (if intended)"],"phonetic":"/məˈkæk/","extraExplanation":["“macaque”在英文里更常见；“macaco”是葡萄牙语常用词。你可以告诉我你看到“maucaco”的句子或出处（比如书名、歌曲、聊天记录），我就能更准确判断它指的是什么。"]}
{"word":"maucauco","summary":{"en":"“maucauco” isn’t a recognized English word; it likely needs context or corrected spelling.","zh":"“maucauco”不是可识别的英语词；需要语境或确认是否拼写有误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a family/place name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “maucauco” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“maucauco”——你能提供你看到它的句子吗？"},{"en":"If you meant a different spelling, I can define it once you confirm the correct word.","zh":"如果你想写的是另一个拼法，确认正确单词后我就能为你解释。"}]}],"phonetic":"/maʊˈkaʊkoʊ/","extraExplanation":["从拼写结构看，“maucauco”不像常见英语词根或词缀组合，因此更可能是专有名词（如网名、品牌名、地名）或外来语的转写。","如果你告诉我它的来源（在哪个网站/文章/歌曲里看到）、你想表达的意思，或可能的正确拼写（例如是否想写成 *Macao*、*muchacho* 等），我可以更准确地判断并给出解释。"]}
{"word":"maucherite","summary":{"en":"Maucherite is a rare nickel–arsenic mineral found in some ore deposits.","zh":"毛赫石是一种稀有的镍—砷矿物，见于部分矿床中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare mineral made mainly of nickel and arsenic (chemical formula Ni₁₁As₈), typically found in hydrothermal ore deposits and sometimes associated with other nickel-arsenide minerals.","zh":"一种稀有矿物，主要由镍和砷组成（化学式 Ni₁₁As₈），常见于热液矿床中，常与其他镍砷化物矿物伴生。"},"examples":[{"en":"Maucherite is often reported from nickel-arsenide vein deposits.","zh":"毛赫石常见于镍—砷化物脉状矿床的报道中。"},{"en":"The sample contained maucherite along with other nickel-bearing minerals.","zh":"该样品含有毛赫石，并伴随其他含镍矿物。"}]}],"synonyms":["nickel arsenide mineral","Ni–As mineral"],"phonetic":"/ˈmaʊkəˌraɪt/","extraExplanation":["“maucherite”属于矿物学专门词汇，主要用于地质、矿床学与矿物鉴定语境。","词源上多被认为是以人名命名（常见于矿物命名传统），用于纪念相关的矿物学家或地质学研究者。"]}
{"word":"Mauchly","summary":{"en":"Mauchly is best known as the surname of John W. Mauchly, co-inventor of the early computer ENIAC.","zh":"Mauchly 最常指约翰·W·莫奇利这一姓氏，他是早期计算机 ENIAC 的共同发明者。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"John W. Mauchly (1907–1980), an American physicist and engineer best known as a co-inventor of the ENIAC, one of the earliest general-purpose electronic digital computers.","zh":"约翰·W·莫奇利（1907–1980），美国物理学家与工程师，最著名的身份是 ENIAC（最早期的通用电子数字计算机之一）的共同发明者。"},"examples":[{"en":"Mauchly worked with J. Presper Eckert on the ENIAC project during World War II.","zh":"莫奇利在二战期间与 J. Presper Eckert 一起参与了 ENIAC 项目。"},{"en":"In many histories of computing, Mauchly’s name appears alongside Eckert’s as a pioneer of early computers.","zh":"在许多计算机史著作中，莫奇利的名字常与埃克特并列，被视为早期计算机的先驱。"}]}],"synonyms":["John W. Mauchly","Eckert–Mauchly (context: partnership/company name)"],"phonetic":"/ˈmɔkli/","extraExplanation":["“Mauchly”通常作为姓氏出现，常见于计算机史语境。学习或写作时，最常指约翰·W·莫奇利（John W. Mauchly）。","ENIAC（Electronic Numerical Integrator and Computer）常被提到是早期大型电子计算机之一；与之相关的机构还包括宾夕法尼亚大学与当时的美国军方需求。","在英文资料中，你也可能看到“Eckert–Mauchly”连用（如 Eckert–Mauchly Computer Corporation），表示两人的合作与相关公司名称。"]}
{"word":"Maud","summary":{"en":"Maud is mainly a female first name (related to Matilda) and also the title of a famous poem by Alfred, Lord Tennyson.","zh":"Maud 主要是女性名字（与 Matilda 有关），也可指丁尼生的著名长诗《Maud》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a form of Matilda), common in English-speaking cultures, especially in Britain","zh":"女性名字（Matilda 的一种形式），在英语文化中常见，尤其在英国"},"examples":[{"en":"Maud is starting kindergarten this fall.","zh":"Maud 今年秋天要上幼儿园了。"},{"en":"My great-grandmother’s name was Maud.","zh":"我曾祖母叫 Maud。"}]},{"partOfSpeech":"n.","definition":{"en":"the title of a long poem (a dramatic monologue) by Alfred, Lord Tennyson, first published in 1855","zh":"阿尔弗雷德·丁尼生（Alfred, Lord Tennyson）于 1855 年发表的长诗（戏剧性独白）的题名《Maud》"},"examples":[{"en":"In class, we read excerpts from Tennyson’s Maud.","zh":"课堂上我们读了丁尼生《Maud》的一些节选。"}]}],"synonyms":["Matilda (related name)","Maude (variant spelling)"],"phonetic":"/mɔd/","extraExplanation":["“Maud”常被认为是“Matilda”的变体。Matilda 源自古日耳曼语词根，常被解释为“力量/权势（maht）+ 战斗（hild）”，因此名字在传统上带有“强大、勇敢”的联想。","在文学语境里，提到 “Tennyson’s Maud” 通常指那首以爱情、心理波动与社会氛围为主题的长诗；在引用或论文中会把它当作作品名（书名/诗名）处理。"]}
{"word":"maud","summary":{"en":"Maud is most commonly a female first name; less commonly, it refers to a traditional Scottish plaid cloak/blanket.","zh":"Maud 最常见是女性名字；较少见时可指苏格兰传统的格子披风/披毯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a personal name), often used in English-speaking countries","zh":"女性名字（人名），在英语国家较常见"},"examples":[{"en":"Maud is my great-grandmother’s name.","zh":"Maud 是我曾祖母的名字。"},{"en":"Please welcome Maud Chen to the stage.","zh":"请欢迎陈 Maud 上台。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional Scottish plaid cloak or blanket, historically worn by shepherds (a “shepherd’s plaid”)","zh":"（苏格兰传统）格子呢披风/毯子；旧时牧羊人常披的格子披毯"},"examples":[{"en":"The shepherd wrapped himself in a maud to keep warm.","zh":"牧羊人用一条 maud 披在身上取暖。"},{"en":"In old accounts, the traveler is described wearing a maud over his coat.","zh":"在旧记载中，这位旅人被描述为在外套外披着一条 maud。"}]}],"synonyms":["Maude (name variant)","plaid (cloak/blanket)","tartan (pattern/cloth)"],"phonetic":"/mɔd/","extraExplanation":["作人名时，Maud 常被视为 Matilda 的昵称或变体之一（与“Maude”也常互通使用）。在英语文学里较知名的例子是丁尼生（Alfred Tennyson）的叙事诗《Maud》。","作“披风/披毯”的 maud 属于较少见、偏苏格兰语（Scots）的用法；现代英语中更常说 plaid、tartan cloak 或 blanket。"]}
{"word":"maudeline","summary":{"en":"Maudeline is usually a less common spelling of the female name Madeline/Madeleine; the cake meaning is typically spelled “madeleine.”","zh":"Maudeline 通常是女性名字 Madeline/Madeleine 的少见拼写；表示“玛德琳小蛋糕”时一般拼作 madeleine。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a less common spelling of Madeline/Madeleine).","zh":"女性名字（Madeline/Madeleine 的较少见拼写变体）。"},"examples":[{"en":"Maudeline is starting high school this year.","zh":"Maudeline 今年要上高中了。"},{"en":"I met a woman named Maudeline at the conference.","zh":"我在会议上认识了一位叫 Maudeline 的女士。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes, by association with the spelling Madeleine) a small French butter cake, often shell-shaped; however this meaning is usually spelled “madeleine.”","zh":"（有时因与 Madeleine 的拼写联想）一种法式黄油小蛋糕，常见贝壳形；但这个意思通常写作“madeleine”。"},"examples":[{"en":"For dessert, we had tea and madeleines.","zh":"甜点我们吃了茶和玛德琳小蛋糕。"},{"en":"If you mean the cake, the common spelling is “madeleine,” not “maudeline.”","zh":"如果你指的是蛋糕，常见拼写是“madeleine”，不是“maudeline”。"}]}],"synonyms":["Madeline","Madeleine","Maudelyn"],"phonetic":"/ˈmɔːdəlɪn/","extraExplanation":["“Maudeline”在英语里并不常见，更常见的是“Madeline / Madeleine”。“Madeleine”源自法语，对应《圣经》人物抹大拉的马利亚（Mary Magdalene）的名字传统，因此在西方常作为女性名使用。","如果你是在找文学/文化中的“Madeleine”：法语小说家普鲁斯特（Proust）写过“玛德琳蛋糕唤起回忆”的经典场景（常被用来比喻“某个味道/气味突然触发记忆”）。"]}
{"word":"maudle","summary":{"en":"Maudle means to talk in a confused, rambling way (often when drunk), or to muddle something clumsily.","zh":"maudle 指（常因醉酒等）含糊絮叨地胡说，或笨拙地把事情弄乱。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to speak in a confused, rambling, or slightly silly way, often because you are drunk or sleepy","zh":"（常因喝醉或困倦而）含糊地胡说、絮叨"},"examples":[{"en":"After a few drinks, he started to maudle about old memories.","zh":"喝了几杯之后，他开始含糊地絮叨起过去的回忆。"},{"en":"I was so tired that I just maudled nonsense in the meeting.","zh":"我太累了，在会议上只是在含糊地说些没头没脑的话。"}]},{"partOfSpeech":"vt.","definition":{"en":"to muddle or handle something in a clumsy, ineffective way","zh":"笨拙地把……弄乱；胡乱摆弄（使事情更糟）"},"examples":[{"en":"Don’t maudle the instructions—read them carefully.","zh":"别胡乱把说明弄得一团糟——仔细读。"},{"en":"He maudled the paperwork and missed the deadline.","zh":"他把文件处理得一团乱，结果错过了截止日期。"}]}],"synonyms":["babble","mumble","ramble","slur","muddle","mess up"],"phonetic":"/ˈmɔdəl/","extraExplanation":["“maudle”多见于苏格兰英语（Scots）或较古旧的英语，用法不算常见；在日常现代英语里，更常用的近义表达有：babble（胡言乱语）、mumble（含糊地说）、ramble（东拉西扯地说）、mess up（搞砸）。"]}
{"word":"maudlin","summary":{"en":"Maudlin describes someone or something that is overly sentimental or tearfully emotional, often in an exaggerated way.","zh":"Maudlin 指过度感伤、爱哭、偏煽情的情绪或表达，常带轻微贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overly emotional or tearfully sentimental, often in a way that feels exaggerated or a bit embarrassing.","zh":"（情绪）过度感伤的；过分多愁善感、爱哭的（常带一点夸张或让人尴尬的感觉）。"},"examples":[{"en":"After a few drinks, he got maudlin and started talking about his childhood.","zh":"喝了几杯之后，他变得很伤感，开始聊起自己的童年。"},{"en":"The movie’s ending felt maudlin rather than genuinely moving.","zh":"那部电影的结局显得过于煽情，而不是真正感人。"},{"en":"She wrote a maudlin message that made her friends worry about her.","zh":"她写了一条很伤感的消息，让朋友们为她担心。"}]}],"synonyms":["overly sentimental","tearful","sappy","mushy"],"phonetic":"/ˈmɔdlɪn/","extraExplanation":["“maudlin”常用来评价一种“过度、煽情式的悲伤”，与“touching（感人）/moving（动人）”不同：后者是积极的，maudlin 往往带轻微贬义。","词源与“Mary Magdalene（抹大拉的马利亚）”有关：在传统艺术中她常被描绘为哭泣、悔恨的形象，因此衍生出“爱哭、过度伤感”的含义。"]}
{"word":"maudlinism","summary":{"en":"Maudlinism means an overly emotional, tearful, self-pitying style or tendency.","zh":"Maudlinism 指一种过度情绪化、爱哭、自怜且略显矫情的表达方式或倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or habit of being overly sentimental, tearful, or self-pitying in a way that may seem exaggerated or insincere.","zh":"过度伤感（矫情）的倾向或习惯；常带有夸张、令人觉得不真诚的自怜与哭哭啼啼。"},"examples":[{"en":"The movie’s final scene slips into maudlinism, with slow music and endless tears.","zh":"电影的最后一幕落入了矫情的伤感：慢音乐配上没完没了的眼泪。"},{"en":"His speech had real emotion, but it avoided maudlinism by staying simple and honest.","zh":"他的演讲确实有真情实感，但通过保持朴素真诚而避免了矫情的煽情。"},{"en":"After the breakup, she tried not to drown in maudlinism and focused on her daily routine.","zh":"分手后，她尽量不沉溺于自怜式的伤感，而是专注于日常生活。"}]}],"synonyms":["sentimentality","bathos","tearfulness","mushiness","self-pity"],"phonetic":"/ˈmɔdlɪnɪzəm/","extraExplanation":["“maudlin”原意与《圣经》中常被描绘为痛哭忏悔的抹大拉的马利亚（Mary Magdalene）形象有关，因此逐渐引申为“爱哭、过度伤感”。“maudlinism”是在此基础上加上 -ism，强调一种“倾向/风气/作风”，语气常带批评。","使用上，“maudlinism”比“sadness（悲伤）”更偏“过头的伤感/煽情”，常用于评论电影、文章、演讲等表达方式。"]}
{"word":"maudlinize","summary":{"en":"“Maudlinize” means to make something overly sentimental or self-pitying.","zh":"“maudlinize”指让人或气氛变得过分伤感、煽情或自怜。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something overly sentimental, tearful, or self-pitying; to cause a mood to become maudlin","zh":"使（某人/某事）变得过分伤感、动不动就想哭或自怜；让气氛变得多愁善感"},"examples":[{"en":"The sad music maudlinized the whole scene.","zh":"悲伤的音乐让整个场景变得格外伤感。"},{"en":"A few drinks can maudlinize his stories and make them sound more tragic than they are.","zh":"喝了几杯酒后，他讲故事就会变得更伤感，把事情说得比实际更悲惨。"},{"en":"Don’t maudlinize the situation—let’s focus on what we can do next.","zh":"别把情况说得太煽情自怜了——我们先专注下一步能做什么。"}]}],"synonyms":["make maudlin","sentimentalize","overdramatize","milk (a situation)","get sentimental"],"phonetic":"/ˈmɔd.lɪn.aɪz/","extraExplanation":["“maudlinize”由形容词“maudlin（过分伤感的）”加动词后缀“-ize”构成，表示“使变成……的状态”。它比较少见，更常用的表达有“make (someone) maudlin / become maudlin / get sentimental”。","“maudlin”一词历史上与“Mary Magdalene（抹大拉的马利亚）”的形象有关：传统艺术中她常被描绘为含泪悔罪，后来这个联想逐渐演变为“爱哭、伤感”的含义。"]}
{"word":"maudlinly","summary":{"en":"“Maudlinly” means “in an overly sentimental or self-pitying way.”","zh":"“maudlinly”表示“以过度伤感或自怜的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly sentimental, tearful, or self-pitying way.","zh":"以过度伤感、爱哭或自怜的方式。"},"examples":[{"en":"After a few drinks, he spoke maudlinly about his past.","zh":"喝了几杯后，他开始以很伤感的语气谈起自己的过去。"},{"en":"She laughed, then apologized maudlinly for being “too emotional.”","zh":"她笑了笑，然后带着自怜的情绪道歉说自己“太情绪化了”。"},{"en":"The movie ends maudlinly, focusing on sadness more than insight.","zh":"这部电影以煽情的方式收尾，更强调悲伤而不是带来启发。"}]}],"synonyms":["sentimentally","tearfully","self-pityingly","overemotionally"],"phonetic":"/ˈmɔːd.lɪn.li/","extraExplanation":["“maudlinly”来自形容词“maudlin”（过度感伤的），常暗含轻微批评：情绪表达显得夸张、沉溺或缺少节制。","它常与饮酒语境搭配出现（如“get maudlin”），因为酒精可能让人更容易变得多愁善感、爱自怜。","搭配提示：speak/talk maudlinly（伤感地说）、smile maudlinly（带着伤感地笑）、end maudlinly（以煽情收尾）。注意它通常不是中性夸赞。"]}
{"word":"maudlinness","summary":{"en":"Maudlinness means an overly sentimental, tearful kind of sadness, often seen as exaggerated or self-pitying.","zh":"Maudlinness 指一种过分煽情、爱流泪的伤感，常带夸张或自怜的负面意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being overly emotional in a sad, self-pitying, or tearful way (often seen as exaggerated or sentimental).","zh":"（情绪）过分伤感、爱自怜或动不动就想哭的状态（常带有夸张、矫情的意味）。"},"examples":[{"en":"After a few drinks, his speech slipped into maudlinness, and everyone felt awkward.","zh":"喝了几杯之后，他的讲话变得过分伤感，大家都觉得很尴尬。"},{"en":"The movie tries for sincerity, but the maudlinness in the final scene feels forced.","zh":"这部电影想走真诚路线，但结尾那段的矫情感显得很刻意。"}]}],"synonyms":["sentimentality","tearfulness","self-pity","mushiness"],"phonetic":"/ˈmɔːdlɪnnəs/","extraExplanation":["“maudlinness”来自形容词“maudlin”（过分伤感的），而“maudlin”与《圣经》中抹大拉的马利亚（Mary Magdalene）在艺术作品里常被描绘成流泪悔罪的形象有关，因此这个词常带有“眼泪汪汪、煽情”的联想。","语气提示：它通常是负面评价，表示“情绪太多、太矫情”，而不是单纯的“难过”。如果只是客观地说“很伤心”，更常用“sadness”“grief”。"]}
{"word":"maudlinwort","summary":{"en":"Maudlinwort is an old-fashioned word for a medicinal herb (often sweet marjoram, sometimes cudweed).","zh":"Maudlinwort 是一个古老的草药名，常指甜马郁兰，有时也指鼠曲草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A traditional name for certain herbs (the exact plant varies by region and source), often referring to sweet marjoram or sometimes cudweed, used in old folk medicine.","zh":"（古语）某些草药植物的俗称（具体指哪一种因地区与文献而异），常指甜马郁兰（sweet marjoram），有时也指鼠曲草（cudweed），旧时常用于民间草药疗法。"},"examples":[{"en":"In some old herbals, maudlinwort is listed as a remedy for colds and low spirits.","zh":"在一些古老的草药书里，maudlinwort 被列为治疗感冒和情绪低落的草药。"},{"en":"The word maudlinwort is rarely used today; modern texts usually name the plant directly.","zh":"maudlinwort 这个词如今很少使用；现代资料通常会直接写出植物的名称。"}]}],"synonyms":["sweet marjoram","cudweed","herb (archaic name)"],"phonetic":"/ˈmɔd.lɪn.wɝt/","extraExplanation":["词形可拆成两部分：maudlin（与“Magdalene/抹大拉的马利亚”相关的旧称，也有“多愁善感、爱哭”的含义）+ wort（古英语里常见的“草/草药”后缀，如 St John’s wort）。因此它属于典型的“古老草药名”。","由于历史上民间与地方性用法不统一，不同文献里 maudlinwort 可能对应不同植物；阅读旧文本时最好结合拉丁学名或上下文确认。"]}
{"word":"mauds","summary":{"en":"“Mauds” means more than one person named Maud.","zh":"“mauds”指不止一位名叫 Maud 的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “Maud,” a female given name.","zh":"“Maud”的复数形式（女性名字），指多个名叫 Maud 的人。"},"examples":[{"en":"Two Mauds in our class were both born in April.","zh":"我们班有两个叫 Maud 的同学，都是四月出生的。"},{"en":"The family photo shows three Mauds across four generations.","zh":"这张全家福里有跨越四代的三位 Maud。"}]}],"synonyms":["Maud (plural)"],"phonetic":"/mɔdz/","extraExplanation":["Maud 是一个传统的英语女性名，常被认为是 Matilda 的中古英语/法语形式，词源可追溯到日耳曼语元素，含义大致与“力量（might）/战斗（battle）”相关。","在文学中，Tennyson（丁尼生）有长诗《Maud》（1855），使这个名字带有一点维多利亚时代的文学气息。"]}
{"word":"mauger","summary":{"en":"Mauger is an archaic word meaning “in spite of; despite,” often used as “mauger (someone).”","zh":"mauger 是一个古语，意思是“尽管；不顾；即使”，常见结构是“mauger + 某人”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(archaic) In spite of; despite; notwithstanding (often used as “mauger (someone)” meaning ‘in spite of them/their wishes’).","zh":"（古语）尽管；不顾；即使（常用于“mauger + 人”，表示“不顾某人/违背某人意愿”）。"},"examples":[{"en":"Mauger all his efforts, the plan failed.","zh":"尽管他竭尽全力，这个计划还是失败了。"},{"en":"She kept her promise, mauger her friends’ warnings.","zh":"尽管朋友们警告她，她仍然遵守了诺言。"},{"en":"He returned home, mauger his enemies.","zh":"他回到了家，不顾敌人的阻挠。"}]}],"synonyms":["despite","in spite of","notwithstanding","regardless of"],"phonetic":"/ˈmɔdʒɚ/","extraExplanation":["这是一个很少见的古英语词，现代写作和口语中几乎不用，通常用 despite / in spite of / notwithstanding 来替代。","词源来自古法语 mal gré，字面意思是“坏的意愿/违心”，引申为“违背某人意愿”。在文学或旧文本中可能出现，读到时把它理解为 despite 往往就够了。"]}
{"word":"maugh","summary":{"en":"“Maugh” is mainly a rare surname rather than a common English word.","zh":"“Maugh”主要是一个较少见的英文姓氏，而不是常用英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare family name (surname); not a common standard English vocabulary word.","zh":"一个较少见的英文姓氏；不是常见的标准英文词汇。"},"examples":[{"en":"Dr. Maugh will present the results at the conference.","zh":"Maugh 医生将在会议上展示结果。"},{"en":"Her last name is Maugh, spelled M-A-U-G-H.","zh":"她的姓是 Maugh，拼作 M-A-U-G-H。"}]}],"synonyms":["(as a surname)"],"phonetic":"/mɔ/","extraExplanation":["“Maugh”在现代英语里不算常用词，更多是专有名词（姓氏）或拼写变体。你可能想查的是：\n1) **Maugham**：英国作家 W. Somerset Maugham（毛姆），常见于文学语境；\n2) **mauve**：颜色“淡紫色/灰紫色”。\n如果你告诉我你看到它的句子或上下文，我可以更准确判断是哪一个。"]}
{"word":"maught","summary":{"en":"“Maught” is not common in modern English. It may appear as an archaic/dialect spelling of “might,” or it may be a misspelling of “naught” (“nothing”).","zh":"“maught”在现代英语中不常用。它可能是古语/方言中“might”的拼写变体，也可能是把“naught”（“没有/零”）误拼成了“maught”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Archaic or dialect) A nonstandard spelling of “might” (past tense of “may”), meaning “was/were able to” or “was/were permitted to.”","zh":"（古语/方言）“might”的非标准拼写形式，表示“能够/可以（过去时）”或“被允许（过去时）”。"},"examples":[{"en":"In some older writing, you may see “maught” used where modern English would write “might.”","zh":"在一些较老的文本里，你可能会看到用“maught”来表示现代英语的“might”。"},{"en":"He said he maught come tomorrow. (Today we would write: He said he might come tomorrow.)","zh":"他说他明天也许会来。（现代写法：He said he might come tomorrow.）"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “naught” (“nothing”). If you meant “naught,” the meaning is “zero; nothing.”","zh":"常见为“naught”（“没有东西/零”）的误拼。如果你想写“naught”，意思是“零；什么也没有”。"},"examples":[{"en":"All that effort came to naught.","zh":"所有努力都化为乌有。"},{"en":"He had naught to say.","zh":"他无话可说。"}]}],"synonyms":["might (archaic/dialect use)","naught (if that’s what you meant)","nothing (modern equivalent of naught)"],"phonetic":"/mɔt/","extraExplanation":["“maught”在现代标准英语中非常少见，通常不会出现在考试或正式写作里。如果你是在小说、诗歌、历史文本里看到它，多半是作者用来营造古风或方言口吻。","如果你是在写作中想表达“可能/也许”，推荐直接用“might”。如果想表达“没有/无”，用“naught”（较文学）或更常用的“nothing”。"]}
{"word":"maugis","summary":{"en":"Maugis is a medieval French legendary character, often a knight-magician who helps Renaud (one of the Four Sons of Aymon).","zh":"Maugis 是中世纪法国传说人物，常被写成协助雷诺（《艾蒙四子》之一）的骑士兼魔法师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A character from medieval French epic tales (the chansons de geste), often portrayed as a clever knight and magician—especially in stories about the Four Sons of Aymon (\"Renaud de Montauban\").","zh":"（专有名词）中世纪法国史诗/骑士叙事诗（chansons de geste）中的人物名，常被塑造成机智的骑士兼魔法师，尤见于《艾蒙四子》（《蒙托邦的雷诺》）相关故事。"},"examples":[{"en":"In some versions of the legend, Maugis uses magic to help Renaud escape danger.","zh":"在某些传说版本中，Maugis 会用魔法帮助雷诺摆脱危险。"},{"en":"Maugis appears in medieval romances connected to Charlemagne’s era.","zh":"Maugis 出现在与查理曼时代相关的中世纪传奇故事中。"}]}],"synonyms":["Maugris","Malagigi"],"phonetic":"/moʊˈʒiː/","extraExplanation":["“Maugis”多见于法语中世纪叙事诗与骑士传奇，人物形象常兼具“骑士（战斗/忠诚）”与“术士/智者（计谋/法术）”两种功能。","不同语言与版本里常有异拼：如法语中可见 Maugris；意大利传统里常对应为 Malagigi（同源人物）。阅读英译本时，遇到这些名字可互相对照理解。"]}
{"word":"maugrabee","summary":{"en":"Maugrabee is a rare, old-fashioned spelling meaning “Maghrebi” (from the Maghreb in Northwest Africa).","zh":"Maugrabee 是一种罕见的旧式拼写，意思相当于“Maghrebi（马格里布的/马格里布人）”，指北非西部马格里布地区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/old-fashioned) Maghrebi; relating to the Maghreb (Northwest Africa, especially Morocco, Algeria, Tunisia).","zh":"（罕见/旧式拼写）马格里布的；指北非西部的马格里布地区（尤指摩洛哥、阿尔及利亚、突尼斯）或与其有关的。"},"examples":[{"en":"The book describes Maugrabee merchants traveling across the Sahara.","zh":"这本书描写了马格里布商人穿越撒哈拉的经历。"},{"en":"She studied Maugrabee Arabic in historical documents.","zh":"她研究历史文献中的马格里布阿拉伯语。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) A person from the Maghreb; a Maghrebi.","zh":"（罕见/旧式拼写）马格里布人；来自马格里布地区的人。"},"examples":[{"en":"In the diary, the writer calls his guide a “Maugrabee.”","zh":"在日记里，作者称他的向导为“马格里布人”。"}]}],"synonyms":["Maghrebi","Maghribi","Moroccan (sometimes, depending on context)"],"phonetic":"/ˌmɑːɡrəˈbiː/","extraExplanation":["“maugrabee”多见于较早期的英文游记、殖民时期文献或旧式转写中，常被认为是阿拉伯语“Maghribī（马格里布的/马格里布人）”的旧拼法或变体。现代英语更常用 **Maghrebi / Maghribi**。","如果你是在某篇特定文章/小说里看到这个词，可能会带有时代色彩或外来语转写的不稳定性；需要时可以提供句子，我可以帮你确认语境中的确切含义。"]}
{"word":"maugre","summary":{"en":"Maugre is an archaic word meaning “despite; in spite of,” mostly seen in older literature.","zh":"maugre 是古语，意思是“尽管；不顾”，多见于旧文学或仿古文风。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(archaic) In spite of; despite.","zh":"（古语）尽管；不顾；虽然。"},"examples":[{"en":"Maugre the rain, they continued their journey.","zh":"尽管下雨，他们仍继续赶路。"},{"en":"He kept his promise, maugre all difficulties.","zh":"他不顾一切困难，仍然遵守了承诺。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, archaic) Ill will; unwillingness (as in “maugre one’s head,” meaning against one’s will).","zh":"（罕见；古语）恶意；不情愿（如短语“maugre one’s head”=违背某人的意愿）。"},"examples":[{"en":"He did it maugre his head.","zh":"他是违背自己意愿去做的。"}]}],"synonyms":["despite","in spite of","notwithstanding"],"phonetic":"/ˈmɔɡər/","extraExplanation":["“maugre”源自中古法语“mal gré”（字面义为“坏的意愿/不情愿”）。后来在英语里多用作介词，意思接近“despite / in spite of”。","现代英语里这个词非常少见，主要出现在旧文学、历史文本或模仿古风的写作中；日常写作通常用“despite”“in spite of”。","有时会见到固定结构“maugre (someone’s) head”，表示“违背（某人）意愿；不由得”。"]}
{"word":"maukin","summary":{"en":"A Scots dialect word meaning “hare,” often in the phrase “timorous maukin.”","zh":"苏格兰方言词，意思是“野兔”，常见搭配为“timorous maukin（胆小的野兔）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) a hare (often used in the phrase “timorous maukin” to mean a shy, easily frightened hare).","zh":"（苏格兰方言）野兔；常见于短语“timorous maukin”，指“胆小、容易受惊的野兔”。"},"examples":[{"en":"A timorous maukin darted across the road and vanished into the heather.","zh":"一只胆小的野兔猛地窜过马路，转眼消失在石南丛里。"},{"en":"In old Scottish writing, “maukin” is a familiar word for a hare.","zh":"在较早的苏格兰文学作品里，“maukin”是指“野兔”的常用词。"}]}],"synonyms":["hare"],"phonetic":"/ˈmɔkɪn/","extraExplanation":["“maukin”主要见于苏格兰英语（Scots）与较古旧的文学语境，现代日常英语里通常说“hare”。","你可能会在苏格兰诗歌或乡村题材作品中看到它；其中“timorous maukin（胆小的野兔）”很有名，常被用来营造乡野、朴实或带一点幽默的语气。"]}
{"word":"maul","summary":{"en":"“Maul” most commonly means to attack violently (often by biting and tearing). It can also mean a heavy hammer, or to badly damage/ruin something.","zh":"“maul”最常指（常以撕咬方式）凶猛袭击；也可指“大槌/大锤”，或指把某物严重弄坏、糟蹋。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to attack someone or something violently, especially by biting and tearing","zh":"（尤指用咬撕的方式）凶猛袭击、撕咬（人或动物）"},"examples":[{"en":"The dog mauled the mail carrier.","zh":"那只狗撕咬了邮递员。"},{"en":"He was mauled by a bear while hiking.","zh":"他徒步时被熊袭击撕咬。"}]},{"partOfSpeech":"n.","definition":{"en":"a heavy hammer-like tool used for hitting or breaking things","zh":"大槌；大锤（用于敲击或砸碎）"},"examples":[{"en":"He used a maul to split the wood.","zh":"他用大槌把木头劈开。"},{"en":"Grab the maul from the toolbox.","zh":"把工具箱里的大锤拿来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to damage or ruin something badly, especially by handling it roughly or doing it carelessly","zh":"（因粗暴对待或草率处理而）把……弄坏；糟蹋"},"examples":[{"en":"The wet suitcase mauled the papers inside.","zh":"潮湿的行李箱把里面的文件弄得一团糟。"},{"en":"The editor felt the book had been mauled in translation.","zh":"编辑觉得这本书在翻译中被糟蹋了。"}]}],"synonyms":["attack","tear","savaged","hammer","sledgehammer","damage","ruin"],"phonetic":"/mɔl/","extraExplanation":["“maul”作动词时常带有强烈暴力色彩，尤其在新闻语境中常见（如动物袭击）。比“bite/attack”更强调“撕扯、造成重伤”。","名词“maul”指“大槌”，在北美语境里常见于劈柴（splitting maul）。","近义词区别：attack（泛指攻击）/ bite（强调咬）/ maul（强调咬住并撕扯、造成严重伤害）。"]}
{"word":"maulana","summary":{"en":"Maulana is a South Asian term for a Muslim religious scholar, and it can also be used as an honorific title before someone’s name.","zh":"Maulana（毛拉纳）是南亚常用的称呼，指穆斯林宗教学者/教士，也可作姓名前的敬称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in South Asia) a Muslim religious scholar or cleric; also used as an honorific title meaning “our master/teacher.”","zh":"（尤指南亚）穆斯林宗教学者、教士；也可作敬称，意为“我们的导师/老师”。"},"examples":[{"en":"The community invited a maulana to give a sermon at the mosque.","zh":"社区邀请一位毛拉纳到清真寺讲道。"},{"en":"Many students studied Arabic grammar with the maulana.","zh":"许多学生跟这位毛拉纳学习阿拉伯语语法。"}]},{"partOfSpeech":"n.","definition":{"en":"a respectful form of address used before a person’s name, similar to “Sheikh” or “Reverend,” in some Muslim communities.","zh":"在一些穆斯林社群中，用在姓名前的尊称，类似于“Sheikh（谢赫）”或“Reverend（牧师/神父）”。"},"examples":[{"en":"Maulana Rashid spoke about charity during Ramadan.","zh":"毛拉纳·拉希德在斋月期间谈到慈善。"},{"en":"People greeted him by saying, “Maulana, please advise us.”","zh":"人们向他问候说：“毛拉纳，请指点我们。”"}]}],"synonyms":["Islamic scholar","cleric","imam","mullah","sheikh"],"phonetic":"/maʊˈlɑːnə/","extraExplanation":["“Maulana”源自阿拉伯语“mawlā”（主人、保护者、导师），在乌尔都语/印地语等语境里常用来称呼伊斯兰学者。","不同地区用法会有差异：在南亚较常见；在英语新闻里也常见于人物称号（如某些宗教领袖或政治人物的称呼）。使用时要注意场合与对方身份，避免误用为泛指所有穆斯林。"]}
{"word":"maulawiyah","summary":{"en":"Maulawiyah refers to the Mevlevi (Mawlawi) Sufi order associated with Rumi, known for the whirling ceremony.","zh":"Maulawiyah指与鲁米相关的梅夫莱维（毛拉维）苏菲教团，以旋转仪式闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam) the Mevlevi (Mawlawi) Sufi order founded in Konya, Turkey, associated with Jalal al-Din Rumi and known for the “whirling dervish” ceremony.","zh":"（伊斯兰教）梅夫莱维/毛拉维苏菲教团（Mawlawiyya/Mevlevi Order），起源于土耳其科尼亚，与鲁米（Jalal al-Din Rumi）相关，以“旋转苦行僧”仪式闻名。"},"examples":[{"en":"The Mawlawiyah is famous for its ritual whirling as a form of spiritual devotion.","zh":"毛拉维教团以仪式性的旋转作为一种灵修奉献而闻名。"},{"en":"In Konya, you can learn about the Mawlawiyah tradition connected to the poet Rumi.","zh":"在科尼亚，你可以了解与诗人鲁米相关的毛拉维传统。"}]}],"synonyms":["Mevlevi order","Mawlawiyya","Mawlawi order"],"phonetic":"/mɑːləˈwiːjə/","extraExplanation":["“Mawlawiyah / Maulawiyah”是把阿拉伯语教团名称（المولوية）用拉丁字母拼写出来的不同写法；也常见拼写为“Mevlevi”（土耳其语）或“Mawlawi/Mawlawī”。","该教团的仪式性旋转（常被称为“whirling dervishes”）在西方文化中很有知名度，但在其传统内部更强调的是音乐、诗歌与纪律化修行的整体体系，而不只是“表演”。","注意别与南亚语境中的“maulvi/maulawi”（对伊斯兰学者的称呼，类似“毛拉/阿訇”的一种称谓）混淆；语源相关，但用法不同。"]}
{"word":"mauled","summary":{"en":"“Mauled” means attacked and badly injured, badly damaged, or harshly criticized/defeated.","zh":"“mauled”表示被猛烈攻击并重伤、被严重损坏，或在比喻义上被狠狠抨击/惨败。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a person or animal) to attack and injure someone badly, often by biting and tearing.","zh":"（人或动物）猛烈攻击并严重伤害（常指撕咬、抓挠）。"},"examples":[{"en":"The hiker was mauled by a bear and needed emergency care.","zh":"那名徒步者被熊猛烈攻击，急需紧急救治。"},{"en":"The dog mauled the mail carrier before anyone could stop it.","zh":"那只狗在被人制止前猛烈攻击了邮递员。"}]},{"partOfSpeech":"vt.","definition":{"en":"To damage something severely; to ruin the condition or shape of something.","zh":"严重损坏；把……弄得面目全非。"},"examples":[{"en":"The accident mauled the front of the car.","zh":"事故把车头撞得严重变形。"},{"en":"The old book was mauled by water and rough handling.","zh":"那本旧书被水浸和粗暴翻动弄得破损不堪。"}]},{"partOfSpeech":"v.","definition":{"en":"To criticize someone harshly or defeat them badly (often in public, such as in politics, media, or sports).","zh":"严厉抨击；惨败（常见于政治、媒体或体育语境）。"},"examples":[{"en":"The candidate was mauled by the press after the scandal.","zh":"丑闻之后，那位候选人遭到媒体猛烈抨击。"},{"en":"Our team got mauled in the first half.","zh":"我们队上半场被打得很惨。"}]}],"synonyms":["attacked","savaged","tore up","ripped","battered","trashed","slammed"],"phonetic":"/mɔld/","extraExplanation":["“mauled”通常是动词“maul”的过去式/过去分词，也常用作形容词表示“被撕咬得很惨/被摧残得很厉害”（如：a mauled victim）。","词义核心是“粗暴地弄伤/弄坏”，因此既可用于真实的动物袭击，也可用于比喻性的“舆论痛批、比赛惨败”。使用时注意语气很强，带有严重、血腥或惨烈的感觉。"]}
{"word":"mauler","summary":{"en":"A mauler is someone (or an animal) that attacks violently and causes serious injury; informally, it can also mean a powerful, aggressive competitor.","zh":"mauler 指凶狠攻击并造成重伤的人（或动物）；口语中也可指以力量和凶猛打法压制对手的强硬型选手或队伍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or animal that attacks violently and injures someone badly","zh":"凶狠攻击并造成严重伤害的人（或动物）；残害者"},"examples":[{"en":"The dog was labeled a mauler after it seriously injured a neighbor.","zh":"那只狗在严重咬伤邻居后被贴上了“凶犬/残害者”的标签。"},{"en":"In the novel, the villain is portrayed as a ruthless mauler who shows no mercy.","zh":"在小说中，反派被描写成一个毫不留情的残害者。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a team, athlete, or fighter who overwhelms opponents with heavy, aggressive force","zh":"（非正式）以强硬、凶猛打法压制对手的人（或球队/选手）"},"examples":[{"en":"They aren’t a finesse team—they’re maulers who win with power.","zh":"他们不是技巧型球队，而是靠力量取胜的“硬碰硬”型队伍。"},{"en":"As a boxer, he was known as a mauler who kept pushing forward.","zh":"作为拳手，他以凶猛压迫、不断前压的打法著称。"}]}],"synonyms":["attacker","brute","aggressor","brawler","fighter"],"phonetic":"/ˈmɔlər/","extraExplanation":["“mauler”来自动词“to maul”（猛烈攻击、撕咬、重伤）。它既可字面指“咬伤/打伤人的人或动物”，也常在体育语境里比喻“靠力量碾压对手的人/队”。","语气通常偏负面或带警惕意味；在体育里则可能带一点“强悍、硬朗”的赞许色彩。"]}
{"word":"maulers","summary":{"en":"“Maulers” is the plural of “mauler”: someone or something that attacks brutally or causes serious damage; in sports, a very aggressive, hard-hitting player.","zh":"“maulers”是“mauler”的复数：指凶猛攻击并造成重创的人/动物或造成严重破坏的事物；在体育中也指打法强硬、侵略性很强的选手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or animals that maul (attack or injure someone badly), or things that cause severe damage.","zh":"“mauler”的复数：指会撕咬/殴打并造成严重伤害的人或动物；也可指造成严重破坏的事物。"},"examples":[{"en":"The hikers carried bear spray in case of maulers in the area.","zh":"徒步者带着防熊喷雾，以防附近有会伤人的猛兽。"},{"en":"In the boxing gym, he was known as one of the division’s best maulers.","zh":"在拳击馆里，他被认为是该级别最擅长“硬拼猛攻”的选手之一。"}]}],"synonyms":["attackers","brutes","aggressors","brawlers","wreckers"],"phonetic":"/ˈmɔlərz/","extraExplanation":["“mauler”来自动词“to maul”，意思是“粗暴地攻击、撕咬、重创”。在体育语境（尤其拳击、橄榄球、冰球）里，mauler常带有比喻色彩，指“打法强硬、擅长近身对抗、持续压迫”的选手或球员。注意：在日常对话中用来指人时可能带贬义或攻击性，描述动物或体育风格会更常见、更自然。"]}
{"word":"mauley","summary":{"en":"Mauley is mainly used as a surname (a proper name), not a common vocabulary word.","zh":"Mauley 主要用作姓氏（专有名词），不是常见的普通词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It is not a common standard English vocabulary word, and you may see it as a person’s last name (e.g., in historical or local records).","zh":"一个姓氏（家族名）。它不是常见的标准英语词汇，更多作为人的姓出现在姓名或历史/地方记录中。"},"examples":[{"en":"Ms. Mauley will speak at the meeting today.","zh":"Mauley 女士今天会在会议上发言。"},{"en":"The letter was addressed to the Mauley family.","zh":"这封信是寄给 Mauley 一家的。"}]}],"phonetic":"/ˈmɔli/","extraExplanation":["“mauley”在现代英语里不常作为普通词出现。很多情况下它可能是姓名拼写，或是对别的词的误拼。","如果你想表达“粗暴地打/撕咬”（动词），更可能是 **maul**；如果你指《丛林之书》里的男孩角色，拼写是 **Mowgli**。你可以告诉我看到这个词的句子/上下文，我可以帮你确认意思。"]}
{"word":"mauling","summary":{"en":"“Mauling” means a violent, rough attack (often by an animal) or the act of badly damaging something; it can also be the -ing form of “maul.”","zh":"“mauling”指凶猛粗暴的袭击（常为动物造成）或对某物的严重破坏；也可作“maul”的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a violent attack that injures someone badly, often by an animal (or sometimes a person)","zh":"（常指动物造成的）凶猛袭击；重伤式攻击"},"examples":[{"en":"The jogger was taken to the hospital after a dog mauling.","zh":"慢跑者遭到狗的袭击（咬伤）后被送往医院。"},{"en":"News reports described the incident as a brutal mauling.","zh":"新闻报道将该事件描述为一次残忍的凶猛袭击。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of hitting, tearing, or damaging something roughly; badly mangling","zh":"粗暴地打击/撕扯；把……弄得很破烂（弄坏）"},"examples":[{"en":"The bear’s claws left a mauling of the tent fabric.","zh":"熊的爪子把帐篷布撕得破破烂烂。"},{"en":"The storm caused a mauling of trees along the coast.","zh":"风暴把沿海的树木摧残得很厉害。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “maul”: attacking or damaging someone or something violently and roughly","zh":"“maul”的现在分词：凶猛地攻击/撕咬；粗暴地破坏"},"examples":[{"en":"The dog was mauling the toy until it tore apart.","zh":"那只狗一直撕咬玩具，直到把它扯烂。"},{"en":"In the film, the monster is shown mauling its victims.","zh":"在电影里，怪物被拍到在袭击受害者。"}]}],"synonyms":["savage attack","mangling","tearing","beating","assault"],"phonetic":"/ˈmɔlɪŋ/","extraExplanation":["“mauling”在新闻语境里很常见，尤其用于描述狗袭击、熊袭击等，语气比一般的“attack”更强烈，强调“撕咬、抓挠、造成重伤”。","在体育报道中也会借用为比喻：a mauling 表示“一边倒的痛打/碾压式击败”（多见于橄榄球、拳击等对抗性强的项目）。例如：The team gave their rivals a mauling.（那支队把对手打得很惨。）"]}
{"word":"mauls","summary":{"en":"“Mauls” can mean “attacks/handles very roughly” (verb) or “heavy splitting hammers” (plural noun).","zh":"“mauls”可指“猛烈攻击/粗暴对待”（动词）或“劈柴等用的大槌（复数名词）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) Third-person singular of “maul”: to attack or handle someone/something very roughly, causing damage or injury.","zh":"（动词）“maul”的第三人称单数：猛烈攻击或粗暴对待某人/某物，造成伤害或损坏。"},"examples":[{"en":"The dog mauls the toy until it falls apart.","zh":"那只狗把玩具咬得乱七八糟，直到它散架。"},{"en":"Headlines said the hiker’s arm was badly mauled, but he survived.","zh":"新闻说那位徒步者的手臂被严重咬伤，但他活了下来。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) Plural of “maul”: heavy tools (often like a large hammer) used for tasks such as splitting wood.","zh":"（名词）“maul”的复数：大槌一类的重型工具，常用于劈柴等。"},"examples":[{"en":"They kept axes and mauls in the shed for splitting logs.","zh":"他们把斧头和劈柴大槌放在棚子里。"},{"en":"Use mauls carefully; they’re heavy and can bounce back.","zh":"使用大槌要小心；它们很重，而且可能反弹。"}]}],"synonyms":["attacks","savagely bites","mangles","batters","splitting hammers"],"phonetic":"/mɔlz/","extraExplanation":["“maul”作动词时，常用于动物袭击（尤其是狗、熊等）造成的严重咬伤；语气比“bite”更强，暗示“反复撕咬/重伤”。","作名词时，“maul”指类似大锤的工具，常见搭配：a splitting maul（劈柴槌）。"]}
{"word":"maulstick","summary":{"en":"A painter’s padded stick used to steady the hand while painting details.","zh":"画家用来支撑手腕、稳定手部以便画细节的带软垫长杆（描杆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long stick with a padded (soft) end that a painter holds or rests on the canvas to steady the hand while painting fine details.","zh":"画家用的支手杖（描杆）：一根长杆，一端有软垫，作画时用来支撑手腕或靠在画布上，以便画细节时更稳。"},"examples":[{"en":"The artist used a maulstick to keep her hand steady while painting the tiny highlights.","zh":"画家用支手杖让手更稳，好画出那些很小的高光。"},{"en":"In classical oil painting, a maulstick can prevent smudging wet paint.","zh":"在古典油画中，支手杖可以避免把未干的颜料蹭花。"}]}],"synonyms":["mahlstick","painter’s rest","hand rest stick"],"phonetic":"/ˈmɔlˌstɪk/","extraExplanation":["“maulstick”也常写作“mahlstick”。词源来自荷兰语/德语一支与“画”有关的词（如德语 Malstab），其中 Mal- 有“绘画”的意思。中文里常见译法有“描杆”“画家支手杖”“支手棒”。"]}
{"word":"maulvi","summary":{"en":"A South Asian term for a Muslim religious scholar or cleric.","zh":"南亚语境中对穆斯林宗教学者或教士的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) A Muslim religious scholar or cleric, often someone educated in Islamic law and theology.","zh":"（南亚用语）穆斯林宗教学者/教士，常指受过伊斯兰法学与神学教育的人。"},"examples":[{"en":"The villagers asked the maulvi to explain the meaning of the verse.","zh":"村民请毛拉（maulvi）解释那段经文的含义。"},{"en":"A maulvi led the discussion on religious duties during the festival.","zh":"一位毛拉在节日期间主持了关于宗教义务的讨论。"},{"en":"In the novel, the maulvi is portrayed as a respected teacher in the community.","zh":"在小说中，这位毛拉被描写成社区里备受尊敬的老师。"}]}],"synonyms":["mullah","imam","cleric","religious scholar"],"phonetic":"/ˈmɑːlvi/","extraExplanation":["“maulvi”（也常拼作 mawlvi / molvi / مولوی）主要见于印度、巴基斯坦、孟加拉等南亚语境，表示受宗教教育的伊斯兰学者或教士。","它有时可作为对宗教老师的尊称；但在新闻或文学中也可能因语境不同而带有褒义（受尊敬的学者）或贬义（被刻板化为保守人物）。阅读时要结合上下文判断语气。","与“imam”（伊玛目，常指带领礼拜的人）和“mullah”（毛拉，使用范围更广）意义相近但不完全等同：maulvi 更强调“受宗教教育的学者/老师”的身份。"]}
{"word":"maumee","summary":{"en":"Maumee is the name of a city in northwest Ohio and also the Maumee River that flows into Lake Erie.","zh":"Maumee 指美国俄亥俄州西北部的一座城市，也指注入伊利湖的莫米河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northwest Ohio, near Toledo, in the United States","zh":"（美国）俄亥俄州西北部的一座城市，靠近托莱多"},"examples":[{"en":"Maumee is a suburb of Toledo in northwest Ohio.","zh":"莫米是俄亥俄州西北部托莱多附近的一个郊区城镇。"},{"en":"She moved to Maumee for a new job in the area.","zh":"她为了在当地的新工作搬到了莫米。"}]},{"partOfSpeech":"n.","definition":{"en":"the Maumee River, a river in northwest Ohio and northeast Indiana that flows into Lake Erie","zh":"莫米河：流经印第安纳州东北部与俄亥俄州西北部，最终注入伊利湖的一条河流"},"examples":[{"en":"The Maumee River flows into Lake Erie at Toledo.","zh":"莫米河在托莱多附近注入伊利湖。"},{"en":"They went kayaking on the Maumee River on the weekend.","zh":"周末他们去莫米河划皮划艇了。"}]}],"phonetic":"/mɔːˈmiː/","extraExplanation":["“Maumee”常被认为与美洲原住民语言及部族名称有关：它与“Miami”（迈阿密族/米亚米族）这一名称存在历史关联。在早期英语记录中，拼写和读音经历过变化，后来固定为今天的“Maumee”。","在美国地名中，很多像“Maumee”这样的词源都来自原住民语言（或其法语/英语转写形式），因此拼写与读音有时不完全符合现代英语的常见规则。"]}
{"word":"maumet","summary":{"en":"Maumet is a dated spelling of Muhammad; it also appears in medieval texts as an inaccurate, offensive term for an idol.","zh":"Maumet 是穆罕默德（Muhammad）的过时拼写；在一些中世纪文本中还被误用为指“偶像/假神”的冒犯性旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated) An old European spelling/name for the Prophet Muhammad.","zh":"（过时）欧洲旧时对先知穆罕默德（Muhammad）的拼写/称呼。"},"examples":[{"en":"In some old English texts, Muhammad is written as “Mahomet” or “Maumet.”","zh":"在一些古英文文本中，Muhammad 会被写作 “Mahomet” 或 “Maumet”。"},{"en":"Modern writing uses “Muhammad,” not “Maumet.”","zh":"现代写作使用 “Muhammad（穆罕默德）”，而不是 “Maumet”。"}]},{"partOfSpeech":"n.","definition":{"en":"(dated, offensive) In medieval European writing, a word used for a supposed “false god” or idol, based on misunderstandings about Islam.","zh":"（过时，具冒犯性）中世纪欧洲作品中因误解伊斯兰教而产生的用法，用来指所谓“假神/偶像”。"},"examples":[{"en":"Some medieval stories wrongly describe Muslims as worshipping “Mahomet” as an idol.","zh":"一些中世纪故事错误地把穆斯林描写成把 “Mahomet” 当作偶像崇拜。"},{"en":"Because this use is inaccurate and offensive, it should be avoided today.","zh":"由于这种用法不准确且带有冒犯性，今天应避免使用。"}]}],"synonyms":["Muhammad","Mahomet (variant spelling)"],"phonetic":"/ˈmɑːmət/","extraExplanation":["“Maumet/ Mahomet” 是中世纪到近代早期欧洲语言里对 “Muhammad” 的多种转写之一，常见于旧文学、史书、戏剧或宗教论战文本。","第二个义项源于当时欧洲对伊斯兰信仰的误读与偏见；现代语境中若要引用，建议明确标注为“历史用法/带偏见的旧称”，并优先使用正确称呼 “Muhammad（穆罕默德）”。"]}
{"word":"maumetries","summary":{"en":"“Maumetries” is the plural of the archaic word “maumetry,” meaning idolatry or a wrongly labeled “false religion,” often found in medieval writings.","zh":"“maumetries”是古词“maumetry”的复数，指偶像崇拜或对“异教/错误宗教”的贬称，常见于中世纪文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, often offensive) idolatry; the worship of idols or a “false religion.”","zh":"（古义，常带冒犯性）偶像崇拜；（对“异教/错误宗教”的贬称）"},"examples":[{"en":"In some medieval texts, writers wrongly described Islam as “maumetry.”","zh":"在一些中世纪文本中，作者会错误地把伊斯兰教称作“maumetry（偶像崇拜）”。"},{"en":"The poem condemns “maumetries,” meaning the worship of idols.","zh":"这首诗谴责“maumetries”，意思是偶像崇拜。"}]}],"synonyms":["idolatry","paganism (older/negative use)","idol worship"],"phonetic":"/ˈmɔmətriz/","extraExplanation":["“maumetries”通常是复数形式，对应单数“maumetry”。该词在中古英语/中世纪拉丁语与法语传统中出现，源头与对“Mahomet（穆罕默德）”的误解有关；当时一些欧洲基督教作者把伊斯兰教错误描写成偶像崇拜，因此这个词在现代语境里往往被视为不准确且带偏见。阅读古文时可把它理解为作者在骂“偶像崇拜/异教”，但在现代写作中应避免使用。"]}
{"word":"maumetry","summary":{"en":"“Maumetry” is an archaic word meaning idolatry or the worship of false gods/idols.","zh":"“maumetry”是一个古旧词，意思是“偶像崇拜/对假神的崇拜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Idolatry; the worship of false gods or idols (an old, historical word).","zh":"偶像崇拜；对“假神/偶像”的崇拜（古旧历史用词）。"},"examples":[{"en":"In medieval writings, “maumetry” was used to condemn idol worship.","zh":"在中世纪的文字中，“maumetry”常用来谴责偶像崇拜。"},{"en":"The preacher warned against “maumetry,” meaning devotion to idols instead of God.","zh":"传教士警告人们不要陷入“maumetry”，即不敬真神而去崇拜偶像。"}]}],"synonyms":["idolatry","idol worship","pagan worship"],"phonetic":"/ˈmɔmətri/","extraExplanation":["这是一个非常古旧的英语词，多见于中古英语/早期近代英语文本（宗教论战、编年史、布道文等）。现代英语里通常不用它，而会用更常见的词：idolatry（偶像崇拜）、pagan worship（异教崇拜）、idol worship（崇拜偶像）。","词源上与中古拉丁语/古法语中表示“偶像崇拜、异教”的词有关；在历史语境里，它常带有强烈的贬义，用来指责对方宗教或信仰“错误”。","阅读古文时可把它理解成“对偶像或假神的崇拜”，但在现代写作中使用会显得过于古怪或刻意。"]}
{"word":"maumets","summary":{"en":"“Maumets” is an archaic plural noun meaning “idols/false gods,” found mostly in medieval texts and often offensive in historical context.","zh":"“Maumets” 是古语复数名词，意为“偶像/假神”，多见于中世纪文本，且在历史语境中常带冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, often offensive) an idol; a false god; an object of worship seen as “pagan.”","zh":"（古语，且常带冒犯性）偶像；假神；被视为“异教”崇拜的神像/崇拜物。"},"examples":[{"en":"In medieval writings, the author claimed that foreigners “worshipped maumets.”","zh":"在中世纪的文字里，作者声称外国人“崇拜 maumets（偶像）”。"},{"en":"The poem uses the word “maumets” to criticize what it sees as empty worship.","zh":"这首诗用“maumets”来批评它认为空洞的崇拜。"}]}],"synonyms":["idols","false gods","images (religious statues)","heathen gods (dated)"],"phonetic":"/ˈmɔmɪts/","extraExplanation":["这个词是复数形式，单数是 **maumet**。它常见于中世纪英语/法语背景的文本里，历史上被用来（错误地）指代伊斯兰先知穆罕默德（Muhammad）或穆斯林所崇拜的“偶像”。由于这种用法带有偏见与误解，现代英语中几乎不用，阅读历史文献时更应注意其冒犯性与时代局限。"]}
{"word":"maun","summary":{"en":"“Maun” is a Scots dialect form meaning “must / have to.”","zh":"“maun”是苏格兰英语/方言形式，意思相当于“must / have to（必须/得）”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(Scots, dialect) must; have to; be required to do something.","zh":"（苏格兰英语/方言）必须；得；不得不（做某事）。"},"examples":[{"en":"I maun go now, or I’ll miss the bus.","zh":"我得走了，不然就赶不上公交了。"},{"en":"You maun mind your manners when you visit your granny.","zh":"你去看奶奶时必须注意礼貌。"},{"en":"We maun finish this today.","zh":"我们今天必须把这个完成。"}]}],"synonyms":["must","have to","need to","be required to"],"phonetic":"/mɔn/","extraExplanation":["“maun”主要见于苏格兰英语（Scots）及文学化/方言化的对话中，在现代标准英语里通常不用；标准写法一般用“must / have to / need to”。","在小说、诗歌或影视作品中出现“maun”，常用来营造地域口音与人物身份（如苏格兰背景）。阅读时可直接把它理解成“must”。"]}
{"word":"maunch","summary":{"en":"“Maunch” is an uncommon/dialect form of “munch,” meaning to chew (often with enjoyment or a crunchy sound).","zh":"“maunch”是不太常见的拼写/方言形式，基本等同于“munch”，表示咀嚼（常带有吃得很香或咔嚓作响的感觉）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to chew something (often noisily or with enjoyment); a less common spelling/dialect form of “munch.”","zh":"咀嚼（常带有吃得很香或咬得很响的感觉）；是“munch”的不常见拼写/方言形式。"},"examples":[{"en":"The kids maunched on popcorn during the movie.","zh":"孩子们看电影时咔嚓咔嚓地嚼着爆米花。"},{"en":"He sat outside and maunched an apple slowly.","zh":"他坐在外面慢慢地嚼着一个苹果。"}]},{"partOfSpeech":"n.","definition":{"en":"a chewing sound or the act of munching; less common than “munch.”","zh":"咀嚼的声音或咀嚼这一动作；比“munch”少见。"},"examples":[{"en":"All I could hear was the maunch of chips in the quiet room.","zh":"安静的房间里我只能听到薯片被咀嚼的咔嚓声。"}]}],"synonyms":["munch","chew","gnaw"],"phonetic":"/mɔntʃ/","extraExplanation":["“maunch”多见于苏格兰英语/方言或较旧的拼写，用法和语气通常等同于更常见的“munch”。在现代标准美式英语里，写作“munch”会更自然、更常用。"]}
{"word":"maunche","summary":{"en":"Maunche is an archaic/dialect spelling meaning “to munch; chew noisily.”","zh":"maunche 是古体/方言拼写，意思是“吧唧吧唧地嚼；大声咀嚼”（相当于 munch）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(archaic or dialect) To chew noisily; to munch.","zh":"（古体或方言）大声咀嚼；吧唧吧唧地吃（同 munch）。"},"examples":[{"en":"The child sat by the fire and maunched a piece of bread.","zh":"孩子坐在炉火旁，吧唧吧唧地嚼着一块面包。"},{"en":"You could hear them maunching nuts during the long talk.","zh":"漫长的谈话中，你能听到他们在咀嚼坚果的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A noisy chew or bite; the act of munching.","zh":"（罕见）一口大声的咀嚼；咀嚼的动作（名词用法较少见）。"},"examples":[{"en":"With each maunche, the crisp apple crackled.","zh":"每咬一口（发出咀嚼声），脆苹果都会咔嚓作响。"}]}],"synonyms":["munch","chew","gnaw"],"phonetic":"/mʌntʃ/","extraExplanation":["“maunche”更常见于较早期或方言拼写，现代英语里通常写作“munch”。如果你是在旧书、诗歌或历史文本里看到它，基本可以按“munch（大声咀嚼）”来理解。","在现代写作中一般不建议用“maunche”，除非你想营造古风/乡土口吻。"]}
{"word":"maund","summary":{"en":"Maund is mainly an old South Asian unit of weight (about 37 kg, varying by place/time). More rarely, it can mean a large basket/hamper in historical usage.","zh":"Maund主要指南亚旧时的重量单位（约37公斤，但因地因时而异）；较少见时也可指历史语境中的大篮子/大筐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional South Asian unit of weight (used historically in India, Pakistan, etc.), roughly 37 kilograms (values varied by region and time)","zh":"（南亚传统）重量单位“maund/蒙德”（旧时在印度、巴基斯坦等地使用），大约相当于37公斤（不同地区与时期数值不一）"},"examples":[{"en":"The cotton was sold by the maund in the old market records.","zh":"在旧市场记录里，棉花是按“maund（蒙德）”来出售的。"},{"en":"Prices were quoted as rupees per maund.","zh":"价格按“每maund多少卢比”来标价。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, rare) a large basket or hamper, especially one used for carrying goods or collecting alms","zh":"（历史用语，较少见）大篮子/大筐（尤指用来运货或乞讨收施舍的篮筐）"},"examples":[{"en":"He carried grain in a maund slung over his shoulder.","zh":"他把装着谷物的一个大筐（maund）搭在肩上。"},{"en":"In older texts, “maund” can refer to a beggar’s basket for alms.","zh":"在较早的文本中，“maund”也可指乞丐用来收施舍的篮筐。"}]}],"synonyms":["(unit) weight unit","(basket) hamper","basket"],"phonetic":"/mɔnd/","extraExplanation":["“maund”作为重量单位主要见于英殖民时期及更早的贸易语境，来源与南亚语言中的“mān/maan（重量）”有关；不同地区（如孟加拉、旁遮普等）的换算标准曾不一致。","它与“Maundy（濯足节/濯足日）”只是拼写相近，意义与来源不同，别混淆。"]}
{"word":"maunder","summary":{"en":"“Maunder” means to talk on in a rambling way or to wander around slowly and without a clear purpose.","zh":"“Maunder”指慢吞吞地唠叨（常没重点）或漫无目的地慢慢闲逛。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To talk in a slow, relaxed, and sometimes slightly confused way, often without a clear point.","zh":"（说话）慢吞吞、漫不经心地唠叨；有时语无伦次、没有重点。"},"examples":[{"en":"He maundered on about his childhood for an hour.","zh":"他慢悠悠地唠叨自己的童年，唠叨了一个小时。"},{"en":"After the long flight, I just maundered a few tired sentences.","zh":"长途飞行后，我只是疲惫地慢吞吞说了几句。"}]},{"partOfSpeech":"vi.","definition":{"en":"To wander or move around slowly and aimlessly.","zh":"（走动）闲逛；漫无目的地慢慢走。"},"examples":[{"en":"We maundered through the old streets, stopping whenever something caught our eye.","zh":"我们在老街里慢慢闲逛，看到感兴趣的就停下来。"},{"en":"She maundered around the house, unsure what to do next.","zh":"她在屋里慢慢踱来踱去，不知道接下来该做什么。"}]}],"synonyms":["ramble","drift","wander","meander"],"phonetic":"/ˈmɔndɚ/","extraExplanation":["“maunder”带有英式文学/叙述语气，常用来描写一种“拖沓、散漫、没有方向”的说话或走动方式。比起中性词“walk/talk”，它更强调松散与漫无目的。","常见搭配：maunder on（唠叨个不停）；maunder through/around（在……闲逛）。在写作中它能营造慵懒、迟缓、甚至有点迷糊的氛围。"]}
{"word":"maundered","summary":{"en":"Maundered means someone spoke in a slow, rambling way (or, less commonly, wandered aimlessly).","zh":"maundered 指（某人）慢吞吞、没重点地絮叨；较少见时也可指漫无目的地闲逛。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of maunder) to talk in a rambling, unfocused way; to say things slowly and without clear purpose.","zh":"（maunder 的过去式/过去分词）指漫无边际地说话；慢吞吞、没重点地絮叨。"},"examples":[{"en":"He maundered about the weather for ten minutes and never got to the point.","zh":"他絮絮叨叨讲了十分钟天气，却始终没说到重点。"},{"en":"Nervous in the interview, she maundered through her answer.","zh":"面试时她很紧张，回答得支支吾吾、没条理。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) (past tense/past participle of maunder) to wander or loiter aimlessly.","zh":"（较少见）（maunder 的过去式/过去分词）指漫无目的地闲逛、徘徊。"},"examples":[{"en":"They maundered along the river until sunset.","zh":"他们沿着河边漫无目的地走到日落。"},{"en":"After the meeting, he maundered around the office, unsure what to do next.","zh":"会后他在办公室里徘徊，不确定接下来该做什么。"}]}],"synonyms":["rambled","drifted","meandered","wandered","babble (informal)"],"phonetic":"/ˈmɔndɚd/","extraExplanation":["“maunder”带一点文学/书面色彩，常用来描写“说话没重点、拖拖拉拉”的状态，比常见的“ramble”更有一种迟缓、迷糊的感觉。","用在人身上时语气通常不太褒义：暗示说话者思路不清或在逃避重点；用在“闲逛”义时也常带“无所事事”的意味。"]}
{"word":"maunderer","summary":{"en":"A maunderer is someone who rambles on in an unfocused way (and, less commonly, someone who wanders aimlessly).","zh":"maunderer 指说话絮絮叨叨、没有重点的人；较少用时也可指漫无目的闲逛的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who talks in a slow, rambling, unfocused way","zh":"（说话）慢吞吞、絮絮叨叨、没有重点的人"},"examples":[{"en":"He can be a real maunderer when he’s tired, jumping from one topic to another.","zh":"他一累就很会絮叨，话题从一个跳到另一个，没有重点。"},{"en":"The meeting went long because one maunderer kept repeating the same ideas.","zh":"会议拖得很长，因为有个人一直絮叨重复同样的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who wanders around without a clear purpose (less common)","zh":"（较少用）漫无目的闲逛的人"},"examples":[{"en":"On quiet afternoons, a few maunderers drift along the riverside path.","zh":"安静的午后，会有几个人在河边小路上漫无目的地闲逛。"}]}],"synonyms":["rambler","windbag","roamer","wanderer","drifter"],"phonetic":"/ˈmɑndərɚ/","extraExplanation":["“maunderer”来自动词“maunder”（絮叨；闲逛）。这个词在现代日常口语里不算常见，更偏书面或带点文学色彩；想表达更常用的说法，可以用“a rambler / someone who rambles”（絮叨的人）或“a wanderer / drifter”（闲逛的人，语气不同）。"]}
{"word":"maunderers","summary":{"en":"“Maunderers” are people who ramble when they speak or wander aimlessly.","zh":"“maunderers”指说话絮絮叨叨、没重点的人，或漫无目的闲逛的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who talk in a slow, rambling, and often unclear way","zh":"说话慢吞吞、絮絮叨叨、常常不太清楚的人"},"examples":[{"en":"The meeting dragged on because a few maunderers kept repeating themselves.","zh":"会议拖得很久，因为有几个人一直絮絮叨叨、反复说同样的话。"},{"en":"He’s not rude—just a maunderer who takes a long time to get to the point.","zh":"他不是没礼貌，只是说话绕来绕去、要很久才讲到重点。"}]},{"partOfSpeech":"n.","definition":{"en":"people who wander around without a clear purpose; aimless walkers","zh":"漫无目的闲逛的人；随便走来走去的人"},"examples":[{"en":"On quiet afternoons, a few maunderers drift along the riverside path.","zh":"安静的下午，会有一些人沿着河边小路漫无目的地闲逛。"},{"en":"Tourists and maunderers filled the old streets, stopping whenever something caught their eye.","zh":"游客和闲逛的人挤满了老街，看到感兴趣的东西就停下来。"}]}],"synonyms":["ramblers","wanderers","drifters","loiterers","babblers"],"phonetic":"/ˈmɔndɚz/","extraExplanation":["“maunderers”是“maunderer”的复数；更常见的基础词是动词“maunder”（絮叨/闲逛）。这个词在现代英语里偏文学或带点幽默的语气，用来形容“说话没重点”或“走来走去无所事事”。","在小说或散文里，它常用来营造一种“松散、漫游、思绪飘散”的氛围：人或语言像在街上慢慢晃、没有明确方向。"]}
{"word":"maundering","summary":{"en":"Maundering means rambling in speech or wandering aimlessly; it can also describe unfocused writing or thoughts.","zh":"maundering 指说话漫无边际或行动漫无目的地闲逛，也可形容文章或思路散漫没重点。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"talk in a rambling, unfocused, or slightly confused way; say things without a clear point (often used when someone is tired, bored, or daydreaming).","zh":"（说话）漫无边际、没重点地唠叨；含糊而散漫地说（常指疲倦、无聊或走神时）。"},"examples":[{"en":"He kept maundering about his childhood, jumping from one story to another.","zh":"他一直漫无边际地聊童年，一会儿一个故事，跳来跳去。"},{"en":"Sorry—I’m maundering. Let me get to the main point.","zh":"抱歉我说跑题了。我直接说重点。"}]},{"partOfSpeech":"vi.","definition":{"en":"walk or move around in an aimless way; wander.","zh":"（行动）漫无目的地闲逛；徘徊。"},"examples":[{"en":"We spent the afternoon maundering around small streets and shops.","zh":"我们下午在小街小店里漫无目的地逛来逛去。"},{"en":"He was maundering through the park, not sure where to go next.","zh":"他在公园里徘徊着，不确定下一步要去哪儿。"}]},{"partOfSpeech":"adj.","definition":{"en":"rambling and unfocused (describing speech, writing, or thoughts).","zh":"（言语/文字/思路）散漫的、没条理的、啰嗦而没重点的。"},"examples":[{"en":"The essay feels maundering; it needs a clearer structure.","zh":"这篇文章有点散乱，需要更清晰的结构。"},{"en":"She gave a maundering reply that didn’t answer the question.","zh":"她给了一个散漫的回答，并没有回应问题。"}]}],"synonyms":["rambling","wandering","meandering","drifting","aimless"],"phonetic":"/ˈmɔn.dɚ.ɪŋ/","extraExplanation":["“maundering”来自动词“maunder”。它在现代英语里不算高频，更常见于较文学、较正式的描写，带有一种“人神游/思绪散开”的氛围。","写作中常用来委婉地表达“说话跑题、啰嗦、思路不清”，语气通常是轻微的批评或自嘲。"]}
{"word":"maunders","summary":{"en":"“Maunders” means “talks on in a rambling way” or “wanders aimlessly,” and it’s the 3rd-person singular form of “maunder.”","zh":"“maunders”表示“絮叨、东拉西扯地说”或“闲逛、漫无目的地走”，是动词“maunder”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a person) to talk in a slow, rambling, and slightly confused way; to speak without a clear point.","zh":"（人）絮絮叨叨、漫无边际地说；说话有点含糊或没有重点。"},"examples":[{"en":"He just maunders on about the old days whenever he’s tired.","zh":"他一累就会没完没了地絮叨过去的事。"},{"en":"She started to maunder, and everyone stopped listening.","zh":"她开始东拉西扯地说个不停，大家就都不再认真听了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to wander or move about in a relaxed, aimless way; to drift.","zh":"闲逛；漫步；漫无目的地走动。"},"examples":[{"en":"On Sundays, they maunder around the neighborhood and look at the gardens.","zh":"周日他们就在社区里随意逛逛，看看花园。"},{"en":"I maundered down to the river to clear my head.","zh":"我慢慢晃到河边，让自己清醒一下。"}]}],"synonyms":["ramble","drone on","babble","wander","meander","amble"],"phonetic":"/ˈmɑn.dɚz/","extraExplanation":["“maunders”通常是动词“maunder”的第三人称单数（he/she/it maunders），也可能被当作“maunder”的复数形式来理解，但最常见的用法还是动词形式。","这个词带有一点文学/旧式（old-fashioned）的感觉，在英式英语里更常见；语气往往暗示“说得没重点、让人有点不耐烦”，但不一定很刻薄。"]}
{"word":"maundful","summary":{"en":"Mouthful means either one mouth’s worth of food/drink, or (informally) a long, hard-to-say word or phrase.","zh":"Mouthful 指“一口食物/饮料”，也可（非正式）指“又长又拗口、难念的词或短语”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An amount of food or drink that fills your mouth at one time.","zh":"一口（食物或饮料）；满口"},"examples":[{"en":"He took a mouthful of soup and smiled.","zh":"他喝了一口汤，笑了。"},{"en":"Don’t talk with your mouth full of food.","zh":"嘴里含着食物时别说话。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A long, complicated, or hard-to-pronounce word, name, or phrase.","zh":"（非正式）又长又拗口、难念的词/名字/短语"},"examples":[{"en":"‘Intercontinental ballistic missile’ is a real mouthful.","zh":"“洲际弹道导弹”这个说法真拗口。"},{"en":"Her full job title is a mouthful, so we use a shorter one.","zh":"她的完整职位名称很长很拗口，所以我们用简称。"}]}],"synonyms":["bite","sip (for drinks)","long name","tongue-twister"],"phonetic":"/ˈmaʊθfʊl/","extraExplanation":["你输入的 **maundful** 不是常见英文拼写，最可能是 **mouthful** 的拼写错误。","固定搭配：**a mouthful** 常用来表示“拗口的长词/长名字”。也可用于形容“工作/任务很多”时说 **I have a mouthful (to deal with)**，语气偏口语。","相关表达：**bite-sized**（小块的、易消化的）；**a handful**（一把；也可指“难对付的人/事”）。"]}
{"word":"maundies","summary":{"en":"“Maundies” means traditional alms given on Maundy Thursday (notably in Britain).","zh":"“maundies”指圣周四（濯足节）传统上发放的施舍品，英国语境中尤常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alms (money, food, or gifts) traditionally given to poor people on Maundy Thursday, especially in a Christian context (often in Britain as part of the Royal Maundy ceremony).","zh":"（尤指基督教传统中、濯足节/圣周四的）施舍、赈济品；（英国）“皇家濯足节施舍”中的赐予物（钱币/礼品等）。"},"examples":[{"en":"In the past, churches distributed maundies to the poor on Maundy Thursday.","zh":"过去，教会常在圣周四向穷人分发施舍品（maundies）。"},{"en":"The Royal Maundy tradition includes giving specially minted coins as maundies.","zh":"“皇家濯足节”传统包括赠送专门铸造的硬币作为施舍品（maundies）。"}]}],"synonyms":["alms","charity","handouts","donations"],"phonetic":"/ˈmɔndi/","extraExplanation":["“maundies”是“maundy”的复数形式。Maundy常与“Maundy Thursday（圣周四/濯足节）”相关：这一天纪念《圣经》中耶稣在最后的晚餐时给门徒的“新命令”（拉丁语 *mandatum*，意为“命令”），也与为人洗脚的谦卑服务象征有关。英国的“Royal Maundy（皇家濯足节赈济）”会向受表彰的长者赠送特别铸造的“maundy money（濯足节钱币）”。"]}
{"word":"maunds","summary":{"en":"“Maunds” is the plural of “maund,” a traditional South Asian unit of weight whose exact value varied.","zh":"“maunds”是“maund”的复数，指南亚传统重量单位，具体数值会因地区与年代而变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of maund: a traditional unit of weight used in South Asia (especially India and Pakistan), with a value that varied by region and time period.","zh":"maund 的复数：南亚（尤指印度、巴基斯坦）传统的重量单位，但数值因地区与年代而异。"},"examples":[{"en":"The invoice lists the rice as 20 maunds.","zh":"发票上写着大米为 20 maunds（20 莫恩德）。"},{"en":"In older records, grain prices were often given per maund.","zh":"在较旧的记录里，谷物价格常以每 maund 计。"}]}],"synonyms":["traditional unit of weight","South Asian weight measure"],"phonetic":"/mɔnd/","extraExplanation":["“maund/莫恩德”不是现代国际单位制（SI）里的标准单位；它在不同地区有不同换算值，所以阅读历史文献或老账本时，最好查看当时当地的具体定义。","该词源自南亚地区的贸易与集市计量传统；在英语史料中常见于殖民时期或跨境贸易语境。"]}
{"word":"maundy","summary":{"en":"Maundy most commonly refers to Maundy Thursday (Holy Thursday) before Easter; it can also refer to the UK ceremony and special coins given on that day.","zh":"maundy最常指复活节前的濯足节/圣周四；也可指英国在这一天举行的施赈仪式及其特别钱币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Christianity) the Thursday before Easter (also called Holy Thursday), remembering Jesus’ Last Supper and his command to love and serve one another.","zh":"（基督教）濯足节/圣周四：复活节前的星期四，纪念耶稣的最后晚餐，以及他关于彼此相爱、彼此服侍的教导。"},"examples":[{"en":"Many churches hold a foot-washing service on Maundy Thursday.","zh":"许多教堂会在濯足节举行洗脚礼拜。"},{"en":"Maundy Thursday marks the beginning of the Easter Triduum in many Christian traditions.","zh":"在许多基督教传统中，濯足节标志着逾越节三日庆典的开始。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in the UK) a royal ceremony and the special coins given to selected elderly people on Maundy Thursday (often called Maundy money).","zh":"（尤指英国）英国王室在濯足节举行的施赈仪式，以及授予受选老人等的特别纪念钱币（常称为“濯足节施赈钱币”）。"},"examples":[{"en":"The recipients received Maundy money in a traditional service.","zh":"受赠者在传统仪式中领取了濯足节施赈钱币。"},{"en":"She kept the Maundy coins as a family treasure.","zh":"她把濯足节钱币当作家族珍藏保存起来。"}]}],"synonyms":["Holy Thursday","Maundy Thursday","Royal Maundy","Maundy money"],"phonetic":"/ˈmɔndi/","extraExplanation":["“Maundy”来自拉丁语 *mandatum*（命令/诫命），与耶稣在最后晚餐时所说“我赐给你们一条新命令：要彼此相爱”有关（《约翰福音》13章）。因此它既指那一天（Maundy Thursday），也延伸到与“服务、施予”相关的礼仪传统。","在英国的“Royal Maundy”传统里，君主会向一定人数（通常与君主年龄相关）的人赠送特别铸造的硬币，以象征慈善与服侍的精神。"]}
{"word":"maunge","summary":{"en":"“Maunge” is not a standard English word; it’s likely a misspelling or a name.","zh":"“maunge”不是标准英语词，更可能是拼写错误或人名/地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (surname/place).","zh":"不是标准英语词。更可能是拼写错误，或是人名/地名（姓氏等）。"},"examples":[{"en":"I couldn’t find “maunge” in a dictionary—did you mean “manage” or “mange”?","zh":"我在词典里找不到“maunge”——你想写的是“manage（管理）”还是“mange（疥癣）”吗？"},{"en":"“Maunge” may be a family name, depending on the context.","zh":"根据语境，“Maunge”也可能是一个姓氏。"}]}],"phonetic":"ˈmɔndʒ","extraExplanation":["“maunge”在常见英语词典中通常查不到。如果你告诉我它出现在哪个句子/场景里（比如一段文本、聊天、歌词、地名、人名），我可以更准确判断你想表达的词。","最常见的可能目标拼写包括：\n- manage /ˈmænɪdʒ/：管理；设法做到\n- mange /meɪndʒ/：疥癣（动物皮肤病）\n- maunder /ˈmɔndɚ/：闲逛；喃喃自语（不太常用）"]}
{"word":"maungy","summary":{"en":"Maungy is not a common English word; it is most likely a misspelling of “mangy,” meaning diseased/unkempt (often animals) or shabby (informal).","zh":"“maungy”不是常见英文词；很可能是“mangy”的拼写错误，意为（多指动物）患皮肤病/邋遢不健康，或（非正式）破旧的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely a misspelling of **mangy**: having mange (a skin disease) or looking very dirty, thin, and unhealthy (often used for animals).","zh":"很可能是 **mangy** 的拼写错误：指（动物）患疥癣等皮肤病；也可形容又脏又瘦、看起来很不健康（多用于动物）。"},"examples":[{"en":"A mangy dog was wandering near the market.","zh":"一只患疥癣的瘦狗在市场附近游荡。"},{"en":"The stray cat looked mangy and exhausted.","zh":"那只流浪猫看起来又脏又瘦、精疲力竭。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) shabby, poor-quality, or unpleasant.","zh":"（非正式）破旧的、质量很差的、令人不快的。"},"examples":[{"en":"They offered him a mangy blanket and a hard bed.","zh":"他们给了他一条破旧的毯子和一张很硬的床。"}]}],"synonyms":["scruffy","unkempt","shabby","ragged","scrawny"],"phonetic":"/ˈmændʒi/","extraExplanation":["“mangy”常用于描述动物外观，语气通常带有同情或厌恶，使用时注意场合与语气。","“mangy”来自“mange”（疥癣），所以它的核心感觉是“因为皮肤病或疏于照顾而显得很糟”。"]}
{"word":"maunna","summary":{"en":"“maunna” is not a standard English word; it is usually a misspelling of Hawaiian “mauna” (“mountain”), used in names like Mauna Kea.","zh":"“maunna”不是标准英语词，通常是夏威夷语“mauna”（“山”）的误拼，常见于 Mauna Kea 等地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “Mauna,” a Hawaiian word meaning “mountain,” often seen in place names like Mauna Kea and Mauna Loa.","zh":"“Mauna”的常见拼写错误。“Mauna”是夏威夷语，意为“山”，常见于地名，如 Mauna Kea（冒纳凯亚火山）和 Mauna Loa（冒纳罗亚火山）。"},"examples":[{"en":"I think “maunna kea” is misspelled—the correct spelling is “Mauna Kea.”","zh":"我觉得“maunna kea”拼错了，正确写法是“Mauna Kea”。"},{"en":"In Hawaiian, “mauna” means “mountain.”","zh":"在夏威夷语里，“mauna”意思是“山”。"}]}],"synonyms":["Mauna"],"phonetic":"/ˈmaʊnə/","extraExplanation":["“Mauna”来自夏威夷语，常用于火山或山峰的名称；英语写作中一般保留原拼法并大写（作为地名的一部分）。","如果你原本想表达的是别的词（例如人名、网络用语或另一种语言的词），可以告诉我上下文或你想写的句子，我可以帮你确认正确拼写与含义。"]}
{"word":"maupassant","summary":{"en":"Maupassant is the surname of a major French realist writer, best known for influential short stories.","zh":"Maupassant 指法国现实主义重要作家莫泊桑，最出名的是影响深远的短篇小说。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Guy de) Maupassant: a famous 19th-century French writer, especially known for short stories and realist fiction.","zh":"（居伊·德）莫泊桑：19世纪著名法国作家，尤以短篇小说和现实主义风格闻名。"},"examples":[{"en":"We read a short story by Maupassant in literature class.","zh":"我们在文学课上读了一篇莫泊桑的短篇小说。"},{"en":"Maupassant often writes about ordinary people and the ironies of daily life.","zh":"莫泊桑常写普通人的生活，以及日常中的讽刺与反讽。"}]}],"synonyms":["Guy de Maupassant"],"phonetic":"/ˌmoʊpəˈsɑːn/","extraExplanation":["“Maupassant”通常指作家本人（Guy de Maupassant，1850–1893）。英语里也常把他的姓当作“作者名”来用：a story by Maupassant（莫泊桑的一篇小说）。","他的作品以语言简洁、结尾常有反转或讽刺著称；入门阅读中最常见的作品包括《项链》（The Necklace）和《羊脂球》（Boule de Suif）。","发音提示：英语里一般读作 /ˌmoʊpəˈsɑːn/；但在法语中鼻化更明显、结尾不发清晰的“t”。"]}
{"word":"mauquahog","summary":{"en":"Mauquahog is a less common spelling for quahog, a hard-shell edible clam from the Atlantic coast of North America.","zh":"mauquahog 是 quahog 的较少见拼写，指北美大西洋沿岸的可食用硬壳蛤（硬蛤）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard-shelled edible clam (the quahog), common on the Atlantic coast of North America; also used as food.","zh":"一种硬壳、可食用的蛤蜊（即 quahog/硬蛤），常见于北美大西洋沿岸；也可指其作为食物。"},"examples":[{"en":"We ate mauquahog steamed with butter at a seaside restaurant.","zh":"我们在海边餐馆吃了用黄油蒸的 mauquahog（硬蛤）。"},{"en":"Local families go out at low tide to dig for mauquahog.","zh":"当地家庭会在退潮时去挖 mauquahog（硬蛤）。"}]}],"synonyms":["quahog","hard clam","cherrystone (size term)","littleneck (size term)"],"phonetic":"/ˈkwɔːhɔːɡ/","extraExplanation":["“mauquahog”是“quahog”的较少见变体拼写，来源与美国东北部原住民语言（如阿尔冈昆语族）有关；在新英格兰地区（如马萨诸塞、罗德岛）更容易看到相关词（quahog）。","“quahog”在当地饮食文化里很常见：小的常做浓汤（clam chowder）或油炸，大的常做填馅烤蛤（stuffed clams）。"]}
{"word":"maurandia","summary":{"en":"Maurandia: an ornamental climbing plant genus known as snapdragon vine.","zh":"Maurandia：一种常见观赏攀缘植物属，俗称“金鱼草藤/攀缘金鱼草”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of climbing, flowering plants (often grown as ornamentals), commonly called snapdragon vine; it has small snapdragon-like blooms and twining stems.","zh":"一种攀缘开花植物属（常作观赏植物栽培），常称“金鱼草藤/攀缘金鱼草”；花形像小型金鱼草，茎会缠绕攀爬。"},"examples":[{"en":"She trained maurandia to climb the trellis on the balcony.","zh":"她把 maurandia 牵引到阳台的格架上攀爬。"},{"en":"Maurandia produces delicate purple or pink flowers in warm seasons.","zh":"Maurandia 在温暖季节会开出淡紫色或粉色的小花。"}]}],"synonyms":["snapdragon vine","climbing snapdragon"],"phonetic":"/mɔˈrændiə/","extraExplanation":["“Maurandia”在园艺语境中多指“攀缘金鱼草/金鱼草藤”（snapdragon vine）。在植物分类上，这一类植物常被并入或与“Cymbalaria”等属相关联；不同资料可能把某些物种写作 Maurandya（拼写变体）或用其他属名处理。实际购买种子/苗时，建议同时用英文俗名（snapdragon vine）或具体学名（如 Maurandya scandens 等）核对。"]}
{"word":"Maureen","summary":{"en":"Maureen is a female first name, an Irish form of Mary.","zh":"Maureen 是女性名字，源自爱尔兰语，是 Mary（玛丽）的变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name, especially common in Ireland and in English-speaking countries in the 20th century; an Irish form of Mary.","zh":"女性名字，尤其常见于爱尔兰及英语国家（20世纪较多）；源自爱尔兰语，是“Mary（玛丽）”的一种形式。"},"examples":[{"en":"Maureen is my aunt’s name.","zh":"Maureen 是我姑妈的名字。"},{"en":"Please welcome Maureen to the team.","zh":"请欢迎 Maureen 加入团队。"},{"en":"Maureen O’Hara was a famous Irish actress.","zh":"Maureen O’Hara 是一位著名的爱尔兰女演员。"}]}],"synonyms":["Mary","Maura"],"phonetic":"/mɔˈrin/","extraExplanation":["词源与文化：Maureen 来自爱尔兰语形式（常与 Máirín 相关），属于 Mary（玛丽）的变体之一，因此在爱尔兰文化语境中很常见。","使用感受：在美国等地，Maureen 常让人联想到较传统、偏上一代的名字风格（在20世纪中期更流行）。","常见昵称/相关名：有时会用 Mo 作昵称；相关名字包括 Mary、Maura、Marian 等（含义与来源可能相近但并非完全相同）。"]}
{"word":"mauresque","summary":{"en":"Mauresque means “Moorish-style,” especially ornate decorative patterns and architecture; it can also name a Moorish-style ornament.","zh":"mauresque 指“摩尔式/摩尔风格的”，尤指华丽的装饰纹样与建筑风格；也可作名词指摩尔式装饰品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in the style of the Moors; relating to Moorish (North African Muslim) art and architecture, especially ornate patterns and arches.","zh":"摩尔式的；与摩尔人（北非穆斯林）艺术与建筑风格有关的，尤指华丽的纹样与拱门。"},"examples":[{"en":"The hotel lobby was decorated in a mauresque style, with horseshoe arches and intricate tilework.","zh":"酒店大堂采用摩尔式装饰，有马蹄形拱门和精美的瓷砖拼贴。"},{"en":"She bought a mauresque lamp with carved metal patterns.","zh":"她买了一盏摩尔式灯具，上面有镂空的金属纹样。"}]},{"partOfSpeech":"n.","definition":{"en":"a mauresque design, ornament, or work of art (Moorish-style decoration).","zh":"摩尔式图案/装饰/艺术品（指摩尔风格的装饰元素）。"},"examples":[{"en":"The museum displayed a mauresque from 19th-century Spain.","zh":"博物馆展出了一件19世纪西班牙的摩尔式装饰品。"}]}],"synonyms":["Moorish","moresque","arabesque (related, not identical)"],"phonetic":"/moʊˈrɛsk/","extraExplanation":["“mauresque”源自法语，和“Moors（摩尔人）”有关。历史上摩尔文化与中世纪伊比利亚半岛（如安达卢斯）的建筑装饰密切相关，常见特征包括马蹄形拱门、几何与植物卷草纹、精细的镶嵌与花砖。","英语里更常见的拼写是“moresque”，含义相近；在艺术史语境中两者都可用来指“摩尔风格/仿摩尔风格”的装饰。使用时建议注意语境，避免把“摩尔风格”简单等同于某种单一民族刻板印象。"]}
{"word":"mauretanian","summary":{"en":"Mauritanian means “from Mauritania,” either describing something related to the country or referring to a person from there.","zh":"Mauritanian 指“来自毛里塔尼亚的”：既可作形容词表示与该国相关，也可作名词表示毛里塔尼亚人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mauritania (a country in northwest Africa) or its culture","zh":"（形容词）与毛里塔尼亚（非洲西北部国家）或其文化有关的"},"examples":[{"en":"They studied Mauritanian history in class.","zh":"他们在课堂上学习毛里塔尼亚历史。"},{"en":"Mauritanian music often uses traditional instruments and rhythms.","zh":"毛里塔尼亚音乐常常使用传统乐器和节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mauritania","zh":"（名词）毛里塔尼亚人"},"examples":[{"en":"She is a Mauritanian living in New York.","zh":"她是一位住在纽约的毛里塔尼亚人。"},{"en":"Many Mauritanians speak Arabic and French.","zh":"许多毛里塔尼亚人会说阿拉伯语和法语。"}]}],"synonyms":["of Mauritania","from Mauritania"],"phonetic":"/ˌmɔrɪˈteɪniən/","extraExplanation":["拼写与发音提示：Mauritania（毛里塔尼亚）+ -n / -an → Mauritanian，用来表示“某国的/某国人”。类似构词还有 Egyptian（埃及的/埃及人）、Canadian（加拿大的/加拿大人）。","文化语境：英语里“a Mauritanian”通常指国籍身份；谈到族群或语言时更需要具体说明（例如 Arab / Berber communities、Hassaniya Arabic、French），以避免把多元群体简单化。"]}
{"word":"mauri","summary":{"en":"Mauri is a Māori word meaning the life force or vital essence present in living beings and the natural world.","zh":"Mauri 是毛利语，指存在于生命与自然之中的生命力／本质能量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Māori culture) the life force or vital essence that exists in people, animals, plants, and natural places; the energy that supports life and wellbeing.","zh":"（毛利文化）生命力／灵力；存在于人、动物、植物及自然之中的“生命本质”，支撑生命与安康的能量。"},"examples":[{"en":"In Māori worldview, a river can have mauri that must be protected.","zh":"在毛利世界观中，河流也有 mauri（生命力），必须被保护。"},{"en":"The community worked to restore the lake’s mauri after pollution.","zh":"污染之后，社区努力修复湖泊的 mauri（生命力）。"},{"en":"Some people describe feeling a strong mauri in a quiet forest.","zh":"有些人形容在安静的森林里能感到很强的 mauri（生命力）。"}]}],"synonyms":["life force","vital essence","life energy"],"phonetic":"/ˈmaʊri/","extraExplanation":["“mauri”是毛利语词汇，常译为“生命力/灵力/本质生命能量”，但它不完全等同于英语的“spirit”。它与自然环境的健康、人的福祉及人与土地（whenua）的关系紧密相关。","在新西兰的语境里，你可能会在环保、河流与湖泊治理、文化教育等话题中见到“mauri”（例如“restoring/protecting the mauri of a river”）。使用时通常带有尊重与文化语境，不宜当作随意的“能量学”口号。"]}
{"word":"Maurice","summary":{"en":"Maurice is most commonly a male first name; it can also be a surname.","zh":"Maurice 最常见是男性名字，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), used mainly in English- and French-speaking contexts.","zh":"（男子）名字“莫里斯/莫瑞斯”，常见于英语和法语语境。"},"examples":[{"en":"Maurice is coming to the meeting at 3 p.m.","zh":"莫里斯下午三点来开会。"},{"en":"My grandfather’s name was Maurice.","zh":"我祖父叫莫里斯。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏“莫里斯”。"},"examples":[{"en":"Dr. Maurice will see you now.","zh":"莫里斯医生现在见你。"},{"en":"She emailed Professor Maurice about the assignment.","zh":"她给莫里斯教授发邮件问作业。"}]}],"synonyms":["Morris"],"phonetic":"/məˈris/","extraExplanation":["“Maurice”常被认为源自拉丁语名字“Mauricius”，与“来自毛里塔尼亚（Mauretania）的人”有关；在法语里读音也很常见，因此在英语世界里常带一点法语气质。","文化上，“Saint Maurice（圣莫里斯）”是欧洲历史中较有名的圣人名字来源之一；在英语流行文化中也能见到如儿童文学作家 Maurice Sendak（《Where the Wild Things Are》作者）等。","常见变体/相关形式：Morris（更英式）、Maurizio（意大利语）、Maurice 的昵称可用 Mo / Moe。"]}
{"word":"maurist","summary":{"en":"A Maurist is a member of the French Benedictine Congregation of Saint Maur, famous for reform and serious scholarship; it can also mean ‘related to’ that group.","zh":"Maurist 指法国本笃会的“圣莫尔会”成员（以改革与严谨学术著称），也可作形容词表示“与圣莫尔会相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Congregation of Saint Maur, a French group of Benedictine monks known for religious reform and careful scholarly work (especially in history and texts) in the 1600s–1700s","zh":"圣莫尔会会士：指“圣莫尔会”（法国本笃会改革团体）的成员；该团体以宗教改革与严谨的学术研究（尤以历史与文献整理）著称，活跃于17—18世纪"},"examples":[{"en":"A Maurist monk helped produce an accurate edition of an early Christian text.","zh":"一位圣莫尔会会士协助整理并出版了一部早期基督教文本的可靠版本。"},{"en":"The library’s catalog includes works edited by the Maurists.","zh":"这座图书馆的目录中收录了由圣莫尔会学者整理编校的著作。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Congregation of Saint Maur or its scholarly traditions","zh":"与圣莫尔会（及其学术传统）有关的"},"examples":[{"en":"The professor discussed Maurist scholarship in early modern France.","zh":"教授讨论了近代早期法国的圣莫尔会学术传统。"}]}],"synonyms":["Benedictine (context-dependent)","monk (general)"],"phonetic":"/ˈmɔrɪst/","extraExplanation":["“Maurist”来自拉丁文“Sanctus Maurus（圣莫尔）”。圣莫尔会（Congregation of Saint Maur）于17世纪在法国形成，是本笃会内部的重要改革团体，以纪律整顿与高标准的文献校勘、史料编纂闻名。","在英语学术写作里，Maurists常被提到是“文本学/史学严谨方法”的代表之一；你可能在历史学、神学、古典学或图书馆学语境中遇到这个词。"]}
{"word":"mauritanian","summary":{"en":"Mauritanian means “from or related to Mauritania,” or “a person from Mauritania.”","zh":"Mauritanian 指“毛里塔尼亚的/与毛里塔尼亚有关的”，也可指“毛里塔尼亚人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mauritania (a country in northwest Africa), or to its people, language, or culture.","zh":"与毛里塔尼亚（西北非国家）有关的；毛里塔尼亚人的；毛里塔尼亚语言或文化的。"},"examples":[{"en":"Mauritanian music often features rhythmic drumming and traditional instruments.","zh":"毛里塔尼亚音乐常常包含有节奏的鼓点和传统乐器。"},{"en":"She studies Mauritanian history in a North African politics course.","zh":"她在一门北非政治课程中学习毛里塔尼亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mauritania; a citizen of Mauritania.","zh":"毛里塔尼亚人；毛里塔尼亚公民。"},"examples":[{"en":"He is a Mauritanian who lives in Nouakchott.","zh":"他是一名居住在努瓦克肖特的毛里塔尼亚人。"},{"en":"The conference welcomed Mauritanians working abroad.","zh":"大会欢迎在海外工作的毛里塔尼亚人。"}]}],"synonyms":["of Mauritania","Mauritania's"],"phonetic":"/ˌmɔrɪˈteɪniən/","extraExplanation":["“Mauritanian”是国家名“Morocco（摩洛哥）”之外的另一个北非/西北非国家相关形容词，注意不要与“Mauretania（古罗马时期的‘毛里塔尼亚’地区）”混淆；现代国家是Mauritania，首都是Nouakchott（努瓦克肖特）。","发音与拼写提示：英式/美式都常把重音放在倒数第二音节附近（-TA-），结尾“-ian”常表示“……的/……人”（如Canadian, Brazilian）。"]}
{"word":"mauritanians","summary":{"en":"“Mauritanians” means people from Mauritania; it can also refer to things related to Mauritania (usually as “Mauritanian”).","zh":"“Mauritanians”指毛里塔尼亚人；也可指与毛里塔尼亚有关的事物（作形容词通常用“Mauritanian”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Mauritania (a country in Northwest Africa), or people of Mauritanian nationality or heritage","zh":"毛里塔尼亚人；毛里塔尼亚的居民（指来自西北非国家毛里塔尼亚的人，或具有毛里塔尼亚国籍/血统的人）"},"examples":[{"en":"Many Mauritanians speak Arabic, and some also speak French.","zh":"许多毛里塔尼亚人说阿拉伯语，有些人也会说法语。"},{"en":"The documentary interviews Mauritanians living in the capital, Nouakchott.","zh":"这部纪录片采访了住在首都努瓦克肖特的毛里塔尼亚人。"}]},{"partOfSpeech":"adj.","definition":{"en":"of or relating to Mauritania or its people","zh":"毛里塔尼亚的；与毛里塔尼亚或其人民有关的"},"examples":[{"en":"Mauritanian music blends different regional traditions.","zh":"毛里塔尼亚音乐融合了不同地区的传统。"},{"en":"She studies Mauritanian history in her African studies class.","zh":"她在非洲研究课上学习毛里塔尼亚历史。"}]}],"synonyms":["people from Mauritania","Mauritanian people"],"phonetic":"/ˌmɔːrɪˈteɪniənz/","extraExplanation":["“Mauritanians”通常是复数形式；单数是“a Mauritanian”。作为形容词时更常见拼写为“Mauritanian”（如：Mauritanian culture）。","不要与“Mauretanians / Mauri（古代北非的摩里人）”混淆：它们指的是古代罗马时期的一些人群与地区概念，不等同于现代国家毛里塔尼亚的国民。"]}
{"word":"mauritia","summary":{"en":"Mauritia is a genus of South American palms, especially the wetland moriche/buriti palm.","zh":"Mauritia 指南美洲棕榈的一属，尤指湿地常见的莫里切/布里蒂棕榈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American palm trees (family Arecaceae), especially the moriche palm, common in wetlands and important for local ecosystems and communities.","zh":"（植物）毛里求榈属：南美洲棕榈科的一属棕榈树，尤指常见于湿地的“莫里切棕榈/毛里求榈”，对当地生态与社区生活很重要。"},"examples":[{"en":"Mauritia palms grow in swampy areas and provide fruit for wildlife.","zh":"毛里求榈属的棕榈常生长在沼泽湿地，并为野生动物提供果实。"},{"en":"In some regions, people use Mauritia fruit to make drinks and sweets.","zh":"在一些地区，人们会用毛里求榈属植物的果实制作饮料和甜食。"}]}],"synonyms":["moriche palm","buriti palm"],"phonetic":"/mɔːˈrɪʃiə/","extraExplanation":["“Mauritia”常见于植物学与生态学文章中，最有代表性的物种是 *Mauritia flexuosa*（英语常叫 moriche palm 或 buriti）。它在亚马孙与奥里诺科流域的湿地很常见，果实可食用，叶与纤维也可用于编织等用途。","大写的“*Mauritia*”是拉丁学名写法（属名首字母大写并斜体）；在日常英语里更常说“moriche palm / buriti palm”而不是直接说“*Mauritia*”。"]}
{"word":"mauritian","summary":{"en":"Mauritian means “from Mauritius,” and it can describe the people, culture, or something related to the country; it can also mean a person from Mauritius.","zh":"Mauritian 指“来自毛里求斯的”，可形容人、文化或与该国相关的事物；也可作名词表示“毛里求斯人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mauritius (the country), its people, or its culture.","zh":"毛里求斯的；与毛里求斯这个国家、其人民或文化有关的。"},"examples":[{"en":"Mauritian food often blends Indian, African, Chinese, and French influences.","zh":"毛里求斯美食常常融合印度、非洲、华人和法国的影响。"},{"en":"She enjoys Mauritian music, especially sega.","zh":"她喜欢毛里求斯音乐，尤其是塞加（sega）。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mauritius; someone whose nationality is Mauritian.","zh":"毛里求斯人；毛里求斯国籍的人。"},"examples":[{"en":"Many Mauritians speak more than one language.","zh":"许多毛里求斯人会说不止一种语言。"},{"en":"He is a Mauritian who grew up near Port Louis.","zh":"他是毛里求斯人，在路易港附近长大。"}]}],"synonyms":["from Mauritius","of Mauritius","Mauritius-born"],"phonetic":"/məˈrɪʃən/","extraExplanation":["“Mauritian”来自国名“Mauritius（毛里求斯）”。日常英语里常用作形容词（Mauritian culture / Mauritian Creole）。","毛里求斯语言环境多元：英语常用于政府与教育；法语在媒体和日常中很常见；许多人也使用毛里求斯克里奥尔语（Mauritian Creole）。"]}
{"word":"Mauritius","summary":{"en":"Mauritius is an island country in the Indian Ocean.","zh":"Mauritius 指印度洋上的岛国毛里求斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An island country in the Indian Ocean, east of Madagascar, known for its multicultural society, beaches, and as a former French and British colony.","zh":"毛里求斯：印度洋的岛国，位于马达加斯加以东，以多元文化社会、海滩风光闻名，历史上曾受法国和英国殖民统治。"},"examples":[{"en":"My friend moved to Mauritius for work and fell in love with the island’s culture.","zh":"我的朋友因为工作搬到毛里求斯，并爱上了那里的文化。"},{"en":"Mauritius is famous for its lagoons, coral reefs, and tropical climate.","zh":"毛里求斯以泻湖、珊瑚礁和热带气候闻名。"}]}],"synonyms":["Republic of Mauritius"],"phonetic":"/məˈrɪʃəs/","extraExplanation":["“Mauritius”在英语里通常指国家本身；国籍/形容词常用“Mauritian”（毛里求斯的；毛里求斯人）。","语言与文化小补充：毛里求斯官方语言是英语，但日常生活中法语与毛里求斯克里奥尔语（Mauritian Creole）也非常常见，体现其多语言环境。"]}
{"word":"mauser","summary":{"en":"Mauser usually refers to a famous German rifle (or the Mauser firearm brand) known for classic bolt‑action designs.","zh":"Mauser通常指著名的德国毛瑟步枪（或毛瑟枪械品牌），以经典的栓动设计闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German-made rifle (often a bolt‑action military rifle), especially classic models used in the late 1800s and early 1900s","zh":"毛瑟步枪（德国制造的步枪，常指经典的军用栓动步枪，盛行于19世纪末至20世纪初）"},"examples":[{"en":"The museum displays a Mauser rifle from the early 20th century.","zh":"博物馆展出了一支20世纪初的毛瑟步枪。"},{"en":"In the novel, the soldier carries a Mauser across his shoulder.","zh":"小说里，士兵把毛瑟步枪扛在肩上。"}]},{"partOfSpeech":"n.","definition":{"en":"the firearm company and brand name associated with the Mauser family and their designs","zh":"毛瑟（与毛瑟家族及其枪械设计相关的公司/品牌名）"},"examples":[{"en":"Collectors often talk about Mauser as a major name in firearm history.","zh":"收藏爱好者常把毛瑟视为枪械史上的重要品牌。"}]}],"synonyms":["bolt-action rifle","service rifle"],"phonetic":"/ˈmaʊzɚ/","extraExplanation":["“Mauser”源自德国毛瑟兄弟（如Paul Mauser）的姓氏。毛瑟系列枪械以结构结实、精度高而闻名，其中“Gewehr 98（G98）”等栓动步枪在历史与文学作品中常被用来营造一战前后欧洲战场的氛围。","在英语里它通常作为专有名词使用：首字母大写（Mauser）。口语或写作中提到具体型号时，常见表达有“a Mauser rifle / a Mauser pistol / a Mauser model …”。"]}
{"word":"mausole","summary":{"en":"A mausoleum is a large, special building used as a tomb, often built to honor someone important.","zh":"mausoleum 指大型、用于安葬并具有纪念意义的陵墓建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, often impressive building or tomb where a person (or family) is buried","zh":"（通常较宏伟的）陵墓；纪念墓"},"examples":[{"en":"The family built a mausoleum to honor their grandparents.","zh":"这家人为纪念祖父母建了一座陵墓。"},{"en":"Tourists visited the ancient mausoleum outside the city.","zh":"游客参观了城外那座古老的陵墓。"}]}],"synonyms":["tomb","crypt","sepulcher","memorial tomb"],"phonetic":"/ˌmɔsəˈliəm/","extraExplanation":["你输入的“mausole”通常是“mausoleum”的拼写未完成或拼写变体。标准拼写是 mausoleum。","词源上与古代统治者 Mausolus（毛索洛斯）有关；他的大型陵墓被认为非常著名，后来“mausoleum”就泛指宏伟的墓室/陵墓。","文化语境中，mausoleum 往往带有“庄严、纪念、宏大建筑”的感觉；比 tomb（坟墓）更强调建筑本身的规模与纪念意义。"]}
{"word":"mausolea","summary":{"en":"“Mausolea” means large tomb buildings; it is the plural form of “mausoleum.”","zh":"“mausolea”指大型陵墓建筑，是“mausoleum”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “mausoleum”: large, often impressive tomb buildings built to hold one or more dead bodies (or ashes).","zh":"“mausoleum”的复数：陵墓；（通常宏大的）墓室建筑，用来安放一人或多人的遗体或骨灰。"},"examples":[{"en":"Ancient mausolea often combined religious meaning with political power.","zh":"古代的陵墓常把宗教意义与政治权力结合在一起。"},{"en":"Tourists visited the mausolea of famous leaders and artists.","zh":"游客参观了著名领袖和艺术家的陵墓。"},{"en":"The city protects historic mausolea as part of its cultural heritage.","zh":"这座城市将历史陵墓作为文化遗产的一部分加以保护。"}]}],"synonyms":["tombs","sepulchers","crypts","burial chambers"],"phonetic":"/ˌmɔsəˈliə/","extraExplanation":["“Mausoleum”源自古代卡里亚（Caria）统治者摩索拉斯（Mausolus）的墓——“哈利卡纳苏斯的陵墓”（Mausoleum at Halicarnassus），被认为是古代世界七大奇迹之一。后来这种宏大的墓葬建筑就以他的名字泛称为 mausoleum。","复数形式 mausolea 带有较明显的书面语/正式语感；日常英语里也常见更规则的复数 mausoleums。"]}
{"word":"mausoleal","summary":{"en":"“Mausoleal” means related to a mausoleum, or having a tomb-like, solemn mood.","zh":"“mausoleal”指与陵墓有关，或带有坟墓般肃穆、阴郁的氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a mausoleum (a large, often impressive tomb); tomb-like or funereal in tone.","zh":"与陵墓/墓室有关的；像陵墓一样的；（气氛或语调）阴郁哀悼的。"},"examples":[{"en":"They walked through the mausoleal halls of the old cemetery in silence.","zh":"他们沉默地走过那座老公墓里陵墓般阴冷的长廊。"},{"en":"The building’s mausoleal grandeur made the museum feel more like a tomb than a gallery.","zh":"那栋建筑陵墓般的宏伟感，让这座博物馆更像一座坟墓而不是展馆。"},{"en":"His speech had a mausoleal seriousness that unsettled the audience.","zh":"他的演讲带着一种陵墓般的凝重感，让听众有些不安。"}]}],"synonyms":["sepulchral","funereal","tomb-like","mournful"],"phonetic":"/ˌmɔsəˈliəl/","extraExplanation":["“mausoleal”来自“mausoleum（陵墓）”。“mausoleum”一词源于古代卡里亚（Caria）统治者摩索拉斯（Mausolus）的陵墓——哈利卡纳苏斯陵墓（Mausoleum at Halicarnassus），曾被列为古代世界七大奇迹之一。后来“mausoleum”泛指宏大墓室，而“mausoleal”多用于描写带有墓穴般肃穆、阴冷或哀悼氛围的场景与文风。"]}
{"word":"mausolean","summary":{"en":"“Mausolean” is usually a misspelling of “mausoleum,” meaning a large tomb building.","zh":"“mausolean”通常是“mausoleum”的误拼，意思是“（大型）陵墓”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (common misspelling of) **mausoleum**: a large, usually grand building used as a tomb for burying or keeping the remains of a person or family.","zh":"（常见拼写错误）**mausoleum（陵墓）**：用于安葬或安放遗体的大型墓室建筑，通常较庄严或宏伟，常为个人或家族所建。"},"examples":[{"en":"Many famous leaders are buried in a mausoleum.","zh":"许多著名领袖被安葬在陵墓中。"},{"en":"The family built a mausoleum to honor their ancestors.","zh":"这家族修建了一座陵墓来纪念祖先。"}]}],"synonyms":["tomb","crypt","sepulcher"],"phonetic":"/ˌmɔsəˈliəm/","extraExplanation":["“mausoleum”一词来自古代卡里亚（今土耳其一带）统治者摩索拉斯（Mausolus）的陵墓“哈利卡纳苏斯陵墓（Mausoleum at Halicarnassus）”，曾被列为世界七大奇迹之一，因此后来“大型陵墓”就用他的名字来指代。","拼写提醒：正确拼写是 **mausoleum**（不是 *mausolean*）。结尾是 **-eum**。"]}
{"word":"mausoleum","summary":{"en":"A mausoleum is a large, often grand tomb or building where someone is buried.","zh":"mausoleum 指宏大的墓室或陵墓建筑，常用于重要人物或家族的安葬与纪念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, impressive building or tomb where a person (often an important one) is buried","zh":"陵墓；（通常为重要人物修建的）宏大的墓室或纪念性墓建筑"},"examples":[{"en":"The family built a mausoleum for their ancestors in the cemetery.","zh":"这家人在墓园里为祖先修建了一座家族陵墓。"},{"en":"Tourists visited the leader’s mausoleum to pay their respects.","zh":"游客参观那位领袖的陵墓以表达敬意。"}]}],"synonyms":["tomb","sepulcher","crypt"],"phonetic":"/ˌmɔsəˈliəm/","extraExplanation":["“mausoleum”一词源自古代卡里亚统治者 Mausolus（毛索洛斯）的陵墓（位于今土耳其一带），其陵墓以宏伟著称，后来这种“纪念性大墓”就被称为 mausoleum。","常见搭配：a family mausoleum（家族陵墓），a marble mausoleum（大理石陵墓），visit a mausoleum（参观陵墓）。语体较正式，多用于历史、旅游或新闻语境。"]}
{"word":"mausoleums","summary":{"en":"“Mausoleums” is the plural of “mausoleum,” meaning grand above-ground tomb buildings for burials.","zh":"“Mausoleums”是“mausoleum”的复数，指宏伟的（通常地面以上的）陵墓建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large, special buildings where one person or a family is buried; grand tombs above ground.","zh":"（多为地面以上的）陵墓；安葬重要人物或家族的宏伟墓室/墓建筑。"},"examples":[{"en":"Many famous leaders are buried in mausoleums.","zh":"许多著名领袖安葬在陵墓里。"},{"en":"The family built a small mausoleum in the cemetery.","zh":"这家人在公墓里建了一座小型家族陵墓。"},{"en":"We visited the marble mausoleum and read the inscriptions on the walls.","zh":"我们参观了那座大理石陵墓，并读了墙上的碑文。"}]}],"synonyms":["tombs","sepulchers","burial vaults"],"phonetic":"/ˌmɔsəˈliəmz/","extraExplanation":["“Mausoleum”源自古代“摩索拉斯陵墓”（Mausoleum at Halicarnassus），被认为是古代世界七大奇迹之一。后来英语里就用 mausoleum 泛指宏伟的陵墓。","用法提示：mausoleum（陵墓建筑）常与 tomb（坟墓/墓穴）、crypt（地下墓室）、grave（墓地/坟）区分；mausoleum 通常更正式、规模更大，且往往是地面上的建筑。"]}
{"word":"maut","summary":{"en":"“Maut” is not a common English word; it’s most often a Malay/Indonesian loanword meaning “death,” or it appears as a name (surname/title).","zh":"“Maut”在英语中不常用；多见于马来语/印尼语借词，意思是“死亡”，也可能作为姓名/标题出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword, mainly from Malay/Indonesian) death; the state of being dead.","zh":"（外来词，主要来自马来语/印尼语）死亡；死去的状态。"},"examples":[{"en":"In some Malay texts, “maut” simply means “death.”","zh":"在一些马来语文本中，“maut”就只是指“死亡”。"},{"en":"The phrase “takut maut” means “afraid of death.”","zh":"短语“takut maut”意思是“害怕死亡”。"}]},{"partOfSpeech":"other","definition":{"en":"(rare in English) used as a name/label (e.g., a surname, place name, or a title) rather than a common English word.","zh":"（英语中较少见）更多作为名称/标签使用（如姓氏、地名或标题），而不是常见英语词。"},"examples":[{"en":"Maut can appear as a family name in records.","zh":"在一些记录中，Maut可能作为姓氏出现。"}]}],"synonyms":["death","the end (of life)","dying"],"phonetic":"/maʊt/","extraExplanation":["“maut”在标准英语里不是常用词；如果你是在阅读马来语/印尼语内容时遇到它，通常就是“死亡”的意思。","马来语/印尼语里常见搭配：hari maut（死亡之日）、takut maut（怕死）、malaikat maut（死亡天使/死神，文化语境中指带走生命的天使）。"]}
{"word":"mauther","summary":{"en":"“mauther” is a dialect word meaning “mother,” mainly found in Scots/Northern English contexts.","zh":"“mauther”是方言词，主要在苏格兰/英格兰北部语境中表示“母亲/妈妈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, Scotland/Northern England) mother.","zh":"（方言，苏格兰/英格兰北部）母亲；妈妈。"},"examples":[{"en":"In some Scots writing, a child might call his mother “mauther.”","zh":"在一些苏格兰方言写作里，孩子可能会把母亲叫作“mauther”。"},{"en":"He wrote about his mauther with great affection.","zh":"他带着深情写到他的母亲。"}]}],"synonyms":["mother","mom","mum (BrE)","ma (informal)"],"phonetic":"/ˈmɔðɚ/","extraExplanation":["“mauther”多见于苏格兰或英格兰北部的方言/文学化拼写，用来表达地方口音或人物身份（乡村、传统、家族叙事等）。在现代标准英语里通常用“mother / mom”。","如果你是在家谱、人名或地名中看到“Ma(u)ther”，也可能是专有名词或拼写变体；可以提供上下文句子以便确认。"]}
{"word":"mauts","summary":{"en":"“mauts” is a Scots/archaic plural meaning “malt” or “malted drink (beer/ale).”","zh":"“mauts”是苏格兰方言/古语的复数形式，表示“麦芽”或“麦芽酒（啤酒/麦酒）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect/archaic) plural of “maut”: malt; by extension, alcoholic drink (especially beer/ale) made from malt.","zh":"（苏格兰方言/古语）“maut”的复数：麦芽；引申指用麦芽酿成的酒（尤指啤酒/麦酒）。"},"examples":[{"en":"In some Scots writing, you may see “mauts” meaning malted drinks.","zh":"在一些苏格兰方言作品里，你可能会看到“mauts”用来指麦芽酒/啤酒。"},{"en":"They met for songs and mauts at the inn.","zh":"他们在酒馆里唱歌聚会、喝麦芽酒。"}]}],"synonyms":["malt","beer","ale"],"phonetic":"/mɔt/","extraExplanation":["“maut”主要出现在苏格兰英语（Scots）的文学或方言拼写里，现代日常英语里几乎不用；在学习中更常见的是标准英语“malt”（麦芽）和“beer/ale”（啤酒/麦酒）。","如果你本来想查的是别的词（比如拼写输入错误），告诉我你想表达的意思或给一个例句，我可以帮你定位正确单词。"]}
{"word":"mauve","summary":{"en":"Mauve is a pale, soft purple color; it can be used as a noun (the color) or an adjective (mauve-colored).","zh":"mauve 指一种柔和的浅紫色；既可作名词表示“浅紫色”，也可作形容词表示“浅紫色的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pale purple color with a slight pink or gray tone.","zh":"一种浅紫色（略带粉色或灰调）。"},"examples":[{"en":"She wore a mauve dress to the wedding.","zh":"她穿了一件浅紫色的连衣裙去参加婚礼。"},{"en":"The bedroom walls are painted mauve for a soft, calm feel.","zh":"卧室墙刷成浅紫色，感觉柔和又宁静。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the color mauve (pale purple).","zh":"浅紫色的（带一点粉或灰调）。"},"examples":[{"en":"He chose a mauve tie to match his shirt.","zh":"他选了一条浅紫色的领带来配衬衫。"},{"en":"The flowers have mauve petals.","zh":"这些花有浅紫色的花瓣。"}]}],"synonyms":["lavender","lilac","pale purple"],"phonetic":"/moʊv/","extraExplanation":["“mauve”源自法语，原意是“锦葵花（mallow）”，因为这种花常呈淡紫色。","历史上“mauve”也指一种早期的合成染料（mauveine），19世纪中期流行，一度引发紫色系服饰的潮流。","搭配小提示：英语里常见近似色词有“lavender（薰衣草紫）”“lilac（丁香紫）”“purple（紫色，范围更广）”。“mauve”通常更偏灰、更柔和。"]}
{"word":"mauvein","summary":{"en":"Mauveine is an early synthetic purple dye (first widely successful aniline dye), discovered in 1856 and used to dye textiles.","zh":"Mauvein（苯胺紫/苯胺染料）是一种早期的合成紫色染料，1856年被发现，常用于纺织品染色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic purple dye, the first commercially successful aniline dye, discovered in 1856 and used especially for coloring fabrics","zh":"一种合成的紫色染料（苯胺染料），1856年被发现，是第一种获得商业成功的合成染料，尤其用于纺织品染色"},"examples":[{"en":"In the late 1800s, dresses dyed with mauveine became fashionable in Europe.","zh":"在19世纪末，用mauvein（苯胺紫）染色的连衣裙在欧洲成了时尚。"},{"en":"The museum displayed a sample cloth colored with mauveine to show early synthetic dyes.","zh":"博物馆展示了一块用mauvein（苯胺紫）染色的布样，用来介绍早期合成染料。"}]}],"synonyms":["aniline purple","Perkin's mauve"],"phonetic":"/ˈmoʊviːn/","extraExplanation":["mauveine（也常写作 mauveine 或 mauvein）因英国化学家 William Henry Perkin（威廉·亨利·珀金）在尝试合成奎宁（治疗疟疾）时偶然发现而闻名。这一发现被认为开启了现代合成染料工业，也推动了有机化学与化工产业的发展。","词形来源与颜色有关：mauve 是“淡紫色/紫红色”，来自法语；mauveine 指“产生淡紫色的（染料）”。在历史语境中，它常与维多利亚时代的流行色彩和早期工业化时尚联系在一起。"]}
{"word":"mauveine","summary":{"en":"Mauveine is an early synthetic purple dye, famous as the first widely used artificial dye.","zh":"Mauveine 是一种早期的合成紫色染料，以“第一种广泛使用的人造染料”而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a purple (mauve) synthetic dye, originally made from coal-tar chemicals; it was the first widely used artificial dye.","zh":"一种紫色（淡紫/紫红）合成染料，最初由煤焦油化学物质制成；被认为是第一种广泛使用的人造染料。"},"examples":[{"en":"Mauveine was used to dye silk a fashionable purple in the 19th century.","zh":"在19世纪，mauveine 被用来把丝绸染成当时很时髦的紫色。"},{"en":"The discovery of mauveine changed the dye industry and helped start modern organic chemistry.","zh":"mauveine 的发现改变了染料工业，并推动了现代有机化学的发展。"}]}],"synonyms":["aniline purple","Perkin’s mauve","mauve dye"],"phonetic":"/ˈmoʊ.viːn/","extraExplanation":["mauveine 通常与英国化学家 William Henry Perkin（威廉·亨利·珀金）联系在一起：他在 1856 年尝试合成奎宁（quinine）时意外得到这种紫色染料。","它的流行让“mauve（淡紫色）”成为一种时尚色彩，也带动了后来大量合成染料的研发，对纺织、化工和日常消费品都有深远影响。","拼写提示：mauveine 读起来接近“moh-veen”，词形来自 mauve（淡紫色）+ -ine（常见于化学物质/染料名称的后缀）。"]}
{"word":"mauves","summary":{"en":"“Mauves” usually means several shades of mauve (a pale purple-pink color). Less commonly, it can mean mallow plants with purple flowers.","zh":"“mauves”通常指多种“mauve”色调（偏粉的浅紫/藕紫）。较少见时也可指开紫花的锦葵类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “mauve”: a pale purple color with a hint of pink","zh":"“mauve”的复数：一种带粉调的浅紫色（藕紫/淡紫）"},"examples":[{"en":"The sunset filled the sky with soft mauves and pinks.","zh":"日落把天空染成柔和的藕紫色和粉色。"},{"en":"She chose curtains in light mauves to make the room feel calm.","zh":"她选了浅藕紫色的窗帘，让房间更显宁静。"}]},{"partOfSpeech":"adj.","definition":{"en":"plural of “mauve” (adjective use): having a pale purple-pink color","zh":"“mauve”的复数（形容词用法的复数形式）：呈淡紫偏粉的颜色的"},"examples":[{"en":"The artist painted mauves clouds over a dark hill.","zh":"画家在深色山丘上方画了藕紫色的云。"},{"en":"Autumn flowers in mauves and whites lined the walkway.","zh":"步道两旁开着藕紫色和白色的秋花。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “mauve”: a type of plant (mallow) with purple flowers (less common)","zh":"“mauve”的复数：一种开紫色花的锦葵类植物（较少见）"},"examples":[{"en":"Wild mauves grew near the field after the rain.","zh":"雨后，田边长出了野生的锦葵。"}]}],"synonyms":["lavender","lilac","pale purple","orchid (color)","violet (light shades)"],"phonetic":"/moʊv/","extraExplanation":["“mauve”源自法语，原意与“锦葵（mallow）”有关，因为这种花常呈紫色。19世纪出现了著名的合成染料“mauveine（苯胺紫）”，推动了“mauve”作为颜色词的流行。","日常用法里，“mauves”最常见是指“多种藕紫色调”（例如画作/服装搭配中的一系列紫粉色）。"]}
{"word":"mauvette","summary":{"en":"Mauvette means a pale, soft purple color (a light mauve), used mainly in art, design, and fashion.","zh":"mauvette 指一种柔和的淡紫色（浅紫红），多用于艺术、设计与时尚等配色描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a color) a pale, soft purple (a light mauve), often with a slightly gray tone.","zh":"（颜色）淡淡的浅紫色（浅紫红），常带一点灰调。"},"examples":[{"en":"She wore a mauvette scarf that softened the whole outfit.","zh":"她戴了一条淡紫色围巾，让整套穿搭显得更柔和。"},{"en":"The sky turned mauvette just before sunset.","zh":"日落前，天空染上了淡淡的浅紫色。"}]},{"partOfSpeech":"n.","definition":{"en":"A mauvette color; a pale purple shade.","zh":"淡紫色；浅紫色调。"},"examples":[{"en":"The designer used mauvette for the bedroom walls to create a calm mood.","zh":"设计师用淡紫色刷卧室墙面，营造安静的氛围。"},{"en":"Add a touch of mauvette to balance the bright pink.","zh":"加一点淡紫色来平衡亮粉色。"}]}],"synonyms":["mauve","pale purple","lavender","lilac"],"phonetic":"/moʊˈvɛt/","extraExplanation":["“mauvette”与“mauve（淡紫色）”有关，来源可追溯到法语；在艺术、时尚与室内设计语境里更常见，通常用来表达一种“柔和、偏灰、低饱和度的浅紫色”。","它不是非常日常的口语词，更常出现在配色说明、化妆品色号或布料/涂料描述中。"]}
{"word":"mauvine","summary":{"en":"Mauvine is a historic synthetic purple dye (and the color it makes), famous as the first widely successful aniline dye.","zh":"Mauvine是一种具有历史意义的合成紫色染料（也指这种紫色），以第一种广泛成功的苯胺染料而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic purple dye (the first commercially successful aniline dye), originally made from coal-tar chemicals; also the purple color produced by this dye","zh":"一种合成的紫色染料（第一种商业上成功的苯胺染料），最初由煤焦油化学物质制成；也指这种染料呈现的紫色"},"examples":[{"en":"Her dress was dyed mauvine, a vivid purple that stood out in the crowd.","zh":"她的裙子染成了mauvine（一种鲜艳的紫色），在人群中很显眼。"},{"en":"The museum displayed early textiles colored with mauvine.","zh":"博物馆展出了用mauvine染色的早期纺织品。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the color of mauvine; a reddish-purple shade","zh":"呈mauvine颜色的；一种偏红的紫色"},"examples":[{"en":"They painted the accent wall mauvine to warm up the room.","zh":"他们把背景墙刷成mauvine色，让房间更温暖。"},{"en":"She chose a mauvine lipstick for a softer look than bright purple.","zh":"她选了mauvine色口红，比亮紫色更柔和。"}]}],"synonyms":["mauve","purple","violet","aniline purple"],"phonetic":"/ˈmoʊviːn/","extraExplanation":["“mauvine”这个词来自法语“mauve”（锦葵花/淡紫色）。","mauvine因英国化学家威廉·亨利·珀金（William Henry Perkin）在1856年偶然发现而闻名，被视为合成染料工业的开端，也推动了现代有机化学与化工产业的发展。","在维多利亚时代，mauvine一度成为时尚界的热门颜色，因此在历史、服装与染织相关的文章中较常出现。"]}
{"word":"maux","summary":{"en":"*Maux* is a French plural meaning “ills/troubles,” mainly seen in French phrases used in English (e.g., *maux de tête*).","zh":"*Maux* 是法语复数，意为“病痛/烦恼/祸患”，在英语中多见于法语短语（如 *maux de tête*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From French; used mainly in French phrases in English) “maux” means “ills, troubles, ailments,” the plural of French *mal* (“ill, harm”). You may see it in expressions like *maux de tête* (“headaches”).","zh":"（源自法语；在英语中多用于法语短语）“maux”意为“病痛、烦恼、祸患”，是法语 *mal*（“疾病/伤害/坏事”）的复数。常见于如 *maux de tête*（“头痛/头疼”）等表达。"},"examples":[{"en":"She joked about her *maux de tête* after working all night.","zh":"她开玩笑说自己熬夜后有 *maux de tête*（头疼）。"},{"en":"The article used a French phrase to describe the city’s social *maux* (problems).","zh":"那篇文章用法语短语来形容这座城市的社会 *maux*（问题/弊病）。"}]}],"synonyms":["ills","troubles","ailments","maladies"],"phonetic":"/moʊ/","extraExplanation":["在现代英语里，“maux”本身很少单独当作英语词使用；更常见的是保留法语拼写、放在固定法语短语中（例如 *maux de tête*）。如果你是在英语文章里看到单独的 *maux*，通常是作者刻意使用法语来营造较“文艺/书面”的语气，相当于英语里的 *ills / troubles / maladies*。"]}

