{"word":"maw","summary":{"en":"Maw means a (usually animal) mouth/jaws, often pictured as wide and swallowing; it can also mean to chew/tear roughly (less common).","zh":"maw 指（多为动物的）大口/颚，常强调张开、吞噬的意象；也可作动词表示粗暴地咬嚼或撕扯（较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the mouth, jaws, or throat (especially of an animal), often imagined as wide open and able to swallow things","zh":"（尤指动物的）大口、颚、咽喉；常含“张得很大、能吞噬”的感觉"},"examples":[{"en":"The snake opened its maw and swallowed the mouse whole.","zh":"蛇张开大口，把老鼠整只吞了下去。"},{"en":"The lion’s maw was stained with blood after the hunt.","zh":"狮子捕猎后，大口上沾着血迹。"},{"en":"The story describes the cave as a dark maw that seems to swallow light.","zh":"故事把洞穴写成一张黑暗的大口，仿佛能吞掉光。"}]},{"partOfSpeech":"v.","definition":{"en":"to tear, mangle, or eat something roughly and messily (less common)","zh":"（较少用）粗暴地撕扯、咬碎；狼吞虎咽地吃"},"examples":[{"en":"The dog maw(ed) the toy until it fell apart.","zh":"狗把玩具咬得稀烂，最后都散开了。"},{"en":"He mawed at the sandwich in a hurry.","zh":"他很赶时间，狼吞虎咽地啃三明治。"}]}],"synonyms":["mouth","jaws","gullet","throat","chomp","mangle"],"phonetic":"/mɔ/","extraExplanation":["“maw”带有强烈的画面感，常与“gaping（张开的）”“hungry（饥饿的）”等词搭配，如“a gaping maw”。","在文学或新闻中常用作比喻，表示“吞噬一切的力量/地方”，例如“the maw of war（战争的巨口）”“the maw of the city（城市的吞噬力）”。","日常口语里更常说“mouth/jaws”；“maw”更偏书面、描写性（有时带一点阴森或暴力色彩）。"]}
{"word":"mawali","summary":{"en":"Mawali: non-Arab Muslims in early Islamic society who were linked as clients to Arab tribes.","zh":"Mawali：伊斯兰早期社会中，作为“部族附属/庇护关系”依附阿拉伯部族的非阿拉伯裔穆斯林（学术语境常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In early Islamic history, non-Arab Muslims (often freed slaves or converts) who were attached as “clients” to an Arab tribe for social and legal protection; the plural of Arabic *mawlā*.","zh":"（伊斯兰早期历史）指非阿拉伯裔穆斯林（常为获释奴隶或改宗者），通常以“部族附属/庇护关系”依附于某个阿拉伯部族以获得社会与法律保护；源自阿拉伯语 *mawlā* 的复数。"},"examples":[{"en":"Many mawali served as administrators and scholars in the Umayyad and Abbasid periods.","zh":"许多 mawali 在倭马亚和阿拔斯时期担任行政官员与学者。"},{"en":"Some sources describe tensions between Arab elites and the mawali in the early empire.","zh":"一些史料记载早期帝国中阿拉伯精英与 mawali 之间存在紧张关系。"}]}],"synonyms":["clients","non-Arab converts","freedmen","client communities"],"phonetic":"/məˈwɑːli/","extraExplanation":["“Mawālī / mawali” 是阿拉伯语复数形式（单数 *mawlā*）。在不同语境里 *mawlā* 本身含义很宽（如“保护者、被保护者、主人、盟友”等），但历史研究中常用 “mawali” 专指早期伊斯兰社会里依附部族的非阿拉伯改宗者/被解放者。","该词常出现在英语的伊斯兰史、阿拉伯史学术写作中；普通日常英语里很少用到。阅读时可根据上下文判断是否为中性学术用语，或带有阶层/族群结构讨论的意味。"]}
{"word":"mawbound","summary":{"en":"Mawbound is an old-fashioned word meaning “constipated,” especially describing animals like horses.","zh":"Mawbound 是较旧的词，意思是“便秘的”，尤其常用来形容马等动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Old-fashioned, mainly in veterinary or rural use) constipated; unable to pass stool, especially of an animal (such as a horse).","zh":"（较旧用法，多见于兽医或乡村语境）便秘的；（尤指马等动物）排便困难的。"},"examples":[{"en":"The mare looked uncomfortable and the vet suspected she was mawbound.","zh":"那匹母马看起来很不舒服，兽医怀疑它便秘（mawbound）。"},{"en":"Old farm guides warn that a mawbound horse may stop eating and seem dull.","zh":"旧的农场指南提醒：便秘的马可能会不吃东西、精神萎靡。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a state of constipation or blockage in the bowels (used as a noun).","zh":"（罕见）便秘；肠道阻塞（作名词用）。"},"examples":[{"en":"In the old manual, the treatment for mawbound was rest and a mild laxative.","zh":"在那本旧手册里，治疗 mawbound（便秘/肠阻塞）的方法是休息并使用温和的泻药。"}]}],"synonyms":["constipated","blocked","impacted","bunged up (informal)"],"phonetic":"/ˈmɔːˌbaʊnd/","extraExplanation":["这个词非常少见，常写作 **maw-bound**（带连字符），属于较旧的英语/方言色彩词汇。这里的 **maw** 在古用法里可指“胃、肚子（尤指动物的）”，**bound** 有“被束缚、被堵住”的意思，所以组合起来就是“肚子被堵住了”→“便秘/不通”。","现代英语里更常用的表达是 **constipated**（便秘的）或 **blocked/impacted**（堵塞的/粪便嵌塞的）。如果你是在文学作品、旧农书或马术/兽医资料里看到它，通常就是这个含义。"]}
{"word":"mawed","summary":{"en":"“Mawed” means “chewed or mangled roughly” (often violently), and can also be used figuratively for harsh damage.","zh":"“mawed”指“粗暴地咀嚼/撕咬得破碎”，也可作比喻表示“摧残、毁坏”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of maw) to chew, tear, or mangle something roughly, usually with the mouth or jaws; to bite into in a violent way.","zh":"（maw 的过去式/过去分词）用嘴或颚粗暴地咀嚼、撕扯或咬碎；凶狠地啃咬。"},"examples":[{"en":"The dog mawed the toy until the stuffing came out.","zh":"那只狗把玩具咬得稀烂，里面的填充物都出来了。"},{"en":"The injured animal had mawed the rope in panic.","zh":"那只受伤的动物惊慌中把绳子啃咬得破破烂烂。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to damage, ruin, or treat something harshly, as if by tearing with teeth.","zh":"（比喻）像被撕咬一样摧残、毁坏或粗暴对待（某物）。"},"examples":[{"en":"The scandal mawed his reputation for years.","zh":"那场丑闻多年都在摧残他的名声。"},{"en":"War had mawed the town’s old buildings.","zh":"战争把小镇的老建筑破坏得满目疮痍。"}]}],"synonyms":["chewed up","mangled","gnawed","tore","ripped","savaged"],"phonetic":"/mɔd/","extraExplanation":["“mawed”来自动词“maw”，在现代英语里比较少见，带有文学色彩或强调“粗暴撕咬/啃噬”的画面感。日常更常用的词有“chewed up, mangled, gnawed, tore”。","补充：名词“maw”表示“（动物的）大嘴/巨口、颚”，也可比喻“无底洞般的吞噬之口”（如“the maw of war”战争的巨口）。"]}
{"word":"mawger","summary":{"en":"Mawger is an archaic word meaning “in spite of; despite,” sometimes used like “nevertheless.”","zh":"mawger 是古语，表示“尽管；不顾”，有时也可作“然而；仍然”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(archaic) In spite of; despite; notwithstanding.","zh":"（古语）尽管；不顾；虽然。"},"examples":[{"en":"Mawger all his efforts, he failed to win her trust.","zh":"尽管他费尽心力，他还是没能赢得她的信任。"},{"en":"Mawger the storm, the ship kept its course.","zh":"尽管风暴来袭，船仍按航线前行。"}]},{"partOfSpeech":"adv.","definition":{"en":"(archaic) Even though; nevertheless.","zh":"（古语）即使如此；然而；仍然。"},"examples":[{"en":"He was warned; mawger, he went on alone.","zh":"他已被警告；然而他仍独自继续前行。"}]}],"synonyms":["despite","in spite of","notwithstanding","nevertheless"],"phonetic":"/ˈmɔɡɚ/","extraExplanation":["“mawger”更常见的拼写是“mauger / maugre”。它来自法语短语“mal gré”，意思是“违背意愿、尽管不愿意”。","这是文学或仿古写作中偶尔会出现的词；现代英语通常用“despite / in spite of / notwithstanding”来表达同样意思。"]}
{"word":"mawing","summary":{"en":"“Mawing” is usually a nonstandard spelling of “mowing” (cutting grass). It can also mean “chewing noisily” as the -ing form of “maw.”","zh":"“mawing”通常是“mowing（割草）”的非标准拼写/拼错；也可作“maw”的 -ing 形式，表示“粗鲁地大口咀嚼、吧唧嚼”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Often a misspelling or nonstandard spelling of) “mowing”: cutting grass or crops with a mower or scythe.","zh":"（常见拼写错误或非标准拼写）“mowing（割草/收割）”：用割草机或镰刀把草或庄稼割短/割下。"},"examples":[{"en":"I’ll be mawing the lawn this afternoon. (More standard: “mowing the lawn.”)","zh":"我今天下午要去 mawing（割草）草坪。（更标准：mowing the lawn。）"},{"en":"The neighbors were mawing early in the morning, so it was noisy.","zh":"邻居一大早就在 mawing（割草），所以挺吵的。"}]},{"partOfSpeech":"v.","definition":{"en":"“Mawing” as the -ing form of “maw” (informal): chewing something in a rough, noisy way; chomping.","zh":"作为动词“maw”的 -ing 形式（非正式）：粗鲁、很大声地咀嚼；大口猛嚼。"},"examples":[{"en":"He sat there mawing on a sandwich while talking.","zh":"他一边说话一边大口 mawing（猛嚼）三明治。"},{"en":"Stop mawing your food and close your mouth.","zh":"别再 mawing（吧唧吧唧地嚼）了，把嘴闭上。"}]}],"synonyms":["mowing","cutting (grass)","trimming","chomping","chewing"],"phonetic":"ˈmɔ.ɪŋ","extraExplanation":["“mawing”在日常英语里最常见的情况是把“mowing（割草）”拼错了。写作和考试中建议用标准拼写“mowing”。","“maw”这个动词（猛嚼/粗鲁地吃）比较口语化，也不如“chew/chomp”常见；用在描写粗鲁吃相、带一点负面评价的语气时更合适。"]}
{"word":"mawk","summary":{"en":"Mawk is a dialect word meaning a gull, and sometimes a maggot/grub.","zh":"Mawk 是方言词，常指“海鸥”，有时也指“蛆/幼虫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, Scotland & Northern England) A gull (a seabird), especially a large gull.","zh":"（方言，苏格兰与英格兰北部）海鸥；尤指体型较大的鸥类。"},"examples":[{"en":"Fishermen watched the mawks circling over the harbor.","zh":"渔民看着海鸥在港口上空盘旋。"},{"en":"A loud mawk cry came from the rocks by the sea.","zh":"海边礁石上传来一声响亮的海鸥叫。"}]},{"partOfSpeech":"n.","definition":{"en":"(dialect) A maggot or grub.","zh":"（方言）蛆；幼虫。"},"examples":[{"en":"The old meat was full of mawks.","zh":"那块变质的肉里全是蛆。"},{"en":"He used mawks as bait when fishing.","zh":"他用蛆当鱼饵钓鱼。"}]}],"synonyms":["gull","maggot","grub"],"phonetic":"/mɔk/","extraExplanation":["“mawk”主要出现在苏格兰或英格兰北部的方言里，现代标准英语里不常用。读到文学作品、民谣、或地方口述记录时更可能遇到。","与之相似的现代常用词：表示“海鸥”通常用 gull；表示“蛆/幼虫”常用 maggot 或 grub。"]}
{"word":"mawkin","summary":{"en":"Mawkin is a Scots dialect word meaning mainly “hare,” and sometimes “scarecrow/ragged-looking figure.”","zh":"Mawkin 是苏格兰方言词，主要指“野兔”，有时也指“稻草人/衣衫褴褛的形象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) a hare (a wild animal like a rabbit, with long ears and strong legs).","zh":"（苏格兰方言）野兔（类似兔子、耳朵长、跑得快的野生动物）。"},"examples":[{"en":"In Scots poems, “mawkin” often means a hare running across the fields.","zh":"在苏格兰诗歌里，“mawkin”常指田野里奔跑的野兔。"},{"en":"The farmer spotted a mawkin at dawn and watched it disappear into the grass.","zh":"农夫在黎明看到一只野兔，转眼它就钻进草丛不见了。"}]},{"partOfSpeech":"n.","definition":{"en":"(older dialect) a scarecrow or a ragged, straw-stuffed figure; sometimes used jokingly for a poorly dressed person.","zh":"（较旧的方言）稻草人；或破破烂烂、像塞了稻草的人形物；也可戏称衣着邋遢的人。"},"examples":[{"en":"They set up a mawkin to keep birds away from the crops.","zh":"他们立了个稻草人来赶走庄稼地里的鸟。"},{"en":"He came in soaked and muddy, looking like a mawkin.","zh":"他浑身湿透又满是泥，看起来像个稻草人（狼狈不堪）。"}]}],"synonyms":["hare","scarecrow"],"phonetic":"/ˈmɔkɪn/","extraExplanation":["“mawkin”多见于苏格兰英语/苏格兰方言（Scots），也常拼作 **maukin**。在文学中（尤其是苏格兰诗歌与民谣）它很常指“野兔”。","第二个义项“稻草人/邋遢的人”与英语古词 **malkin**（与“抹布、女仆、邋遢的人”等含义有关）在拼写与语源上常被认为有关联；不同地区与文本里含义会有所偏移。"]}
{"word":"mawkingly","summary":{"en":"Mockingly means ‘in a teasing or scornful way,’ as if making fun of someone.","zh":"Mockingly 表示“以嘲笑、讥讽的方式”，带有取笑或轻蔑的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows teasing, scorn, or lack of respect; as if making fun of someone.","zh":"以嘲笑、讥讽或不尊重的方式；像是在取笑别人。"},"examples":[{"en":"He smiled mockingly when I made a mistake.","zh":"我犯错时，他带着讥讽的笑容。"},{"en":"“Sure, you can do it,” she said mockingly.","zh":"“当然，你做得到。”她讽刺地说道。"},{"en":"The crowd laughed mockingly at the nervous speaker.","zh":"人群嘲笑那个紧张的演讲者。"}]}],"synonyms":["sarcastically","derisively","scornfully","tauntingly"],"phonetic":"/ˈmɑkɪŋli/","extraExplanation":["你输入的“mawkingly”不是常见英文单词；最可能是拼写错误，目标词是“mockingly”。","“mockingly”来自动词 mock（嘲弄、戏弄）。语气通常偏负面，和 jokingly（开玩笑地）不同：jokingly 更友好，而 mockingly 往往带轻蔑或伤人意味。"]}
{"word":"mawkish","summary":{"en":"Mawkish means overly sentimental in a way that feels fake or embarrassing; less commonly, it can mean sickly sweet in taste or smell.","zh":"Mawkish 指过分伤感、过度煽情（显得做作或尴尬）；较少见时也可指甜得发腻或气味令人不适。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overly sentimental in a way that feels fake, exaggerated, or embarrassing.","zh":"过分伤感的；过度煽情的（让人觉得做作、夸张甚至尴尬）。"},"examples":[{"en":"The movie’s ending felt mawkish rather than moving.","zh":"这部电影的结局让人觉得过度煽情，而不是感人。"},{"en":"He wrote a mawkish love letter full of clichés.","zh":"他写了一封矫情的情书，满是陈词滥调。"},{"en":"I like romantic stories, but I don’t enjoy anything too mawkish.","zh":"我喜欢浪漫故事，但不太喜欢太矫情、太煽情的那种。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Having a sickly, unpleasantly sweet taste or smell.","zh":"（较少见）有一种令人发腻的不舒服的甜味或气味。"},"examples":[{"en":"The drink had a mawkish sweetness that made it hard to finish.","zh":"这饮料甜得发腻，让人很难喝完。"},{"en":"A mawkish odor hung in the air.","zh":"空气中弥漫着一股令人发腻的气味。"}]}],"synonyms":["overly sentimental","sappy","schmaltzy","cloying","corny"],"phonetic":"/ˈmɔkɪʃ/","extraExplanation":["“mawkish”常用来批评作品或表达方式“太煽情”，暗含“不真诚/太用力”的感觉，比“sentimental（感伤的）”更负面。","常见搭配：mawkish ending/scene/speech（煽情的结尾/场景/演讲），mawkish romance（矫情的爱情）。","近义词细微差别：sappy（口语，偏“肉麻/腻”），corny（俗套尴尬，不一定伤感），schmaltzy（常指电影/音乐等刻意煽情）。"]}
{"word":"mawkishly","summary":{"en":"“Mawkishly” means “in an overly sentimental and awkward/embarrassing way.”","zh":"“mawkishly”表示“过度煽情、显得笨拙或尴尬地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly sentimental, awkward, or embarrassing way (showing emotion that feels clumsy or not quite sincere).","zh":"以过度多愁善感、笨拙甚至令人尴尬的方式（情感表达显得生硬或不太自然）。"},"examples":[{"en":"He spoke mawkishly about their “perfect love,” and everyone went quiet.","zh":"他用很做作、过度煽情的方式谈他们“完美的爱情”，结果大家都沉默了。"},{"en":"The movie ends mawkishly, with a long speech and slow music.","zh":"电影结尾很煽情又有点尴尬：一段长演讲配上慢音乐。"}]}],"synonyms":["sentimentally","cloyingly","saccharinely","overemotionally"],"phonetic":"ˈmɔkɪʃli","extraExplanation":["“mawkishly”来自形容词“mawkish”（过分感伤、令人反感的甜腻）。它常用来批评某种情绪表达：不是“真挚感人”，而是“矫情/做作/尬”。","语气通常偏负面，常和speech（讲话）、sentiment（情怀/感伤）、ending（结尾）、romantic scene（爱情场景）等搭配。"]}
{"word":"mawkishness","summary":{"en":"Mawkishness is the quality of being overly sentimental in a way that feels fake or too sweet.","zh":"Mawkishness 指过度煽情、矫情、甜腻到让人觉得不真诚的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being overly sentimental, emotional, or “sweet” in a way that feels insincere or embarrassing","zh":"（感情）过度煽情、矫情的特质；甜腻到让人觉得不真诚或尴尬"},"examples":[{"en":"The movie’s mawkishness made the ending feel forced rather than moving.","zh":"这部电影的矫情让结尾显得很刻意，而不是感人。"},{"en":"She disliked the mawkishness of the greeting card messages.","zh":"她不喜欢贺卡祝福语里那种过度煽情的腔调。"},{"en":"His speech avoided mawkishness and focused on real gratitude.","zh":"他的发言避免了矫情，专注于真实的感激。"}]}],"synonyms":["over-sentimentality","sentimentality","sappiness","cloyingness"],"phonetic":"/ˈmɔ.kɪʃ.nəs/","extraExplanation":["词根提示：形容词 *mawkish* 原意与“发腻、令人反胃”有关，后来引申为“甜腻到让人不舒服的感伤”。因此 *mawkishness* 常带负面评价，强调“情感过度、显得假或尬”。","使用场景：常见于评论电影、小说、演讲、广告等作品的“煽情程度”，暗示作者/创作者用过多情绪来操控观众。","近义辨析：*sentimentality*（感伤、易动情）可能中性或轻微负面；*mawkishness* 更强调“甜腻、做作、让人起鸡皮疙瘩”的感觉。"]}
{"word":"mawkishnesses","summary":{"en":"“Mawkishnesses” means multiple instances of overly sentimental, insincere emotional expression.","zh":"“mawkishnesses”指多处/多种过分伤感、矫情、不够真诚的情感表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mawkishness: feelings, attitudes, or pieces of writing/speech that are overly sentimental in a way that seems false or too emotional.","zh":"mawkishness 的复数：指（多种）过分伤感、矫情的情绪/态度，或（多处）显得不真诚、过度煽情的文字与表达。"},"examples":[{"en":"The film has a few mawkishnesses near the end, but it’s still enjoyable.","zh":"这部电影结尾有几处有点矫情的煽情桥段，但整体还是好看的。"},{"en":"She edited the speech to remove the mawkishnesses and keep it sincere.","zh":"她修改了演讲稿，删掉那些过分煽情的部分，让表达更真诚。"}]}],"synonyms":["sentimentality","sappiness","cloyingness","corniness"],"phonetic":"/ˈmɔkɪʃnəsɪz/","extraExplanation":["“mawkish”常用来批评一种“甜腻到不真诚”的情感表达：不是单纯“感人”，而是让人觉得用力过猛、刻意煽情。","词源上，mawkish 早期与“令人作呕/胃口不好”有关（带有“腻、反胃”的感觉），后来引申为“情感上过分甜腻、让人不适”。"]}
{"word":"mawks","summary":{"en":"“Mawks” is a rare dialect word meaning “maggots,” or (as a verb form) “becomes infested with maggots.”","zh":"“mawks”是一个罕见的方言词，意思是“蛆”（复数），也可作动词形式表示“（变得）生蛆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, dialect) Maggots; soft white insect larvae, especially found in decaying food or flesh (plural form).","zh":"（罕见/方言）蛆；（尤指在腐败食物或腐肉中的）昆虫幼虫（复数形式）。"},"examples":[{"en":"The meat was left out too long and soon filled with mawks.","zh":"肉放在外面太久，很快就长满了蛆。"},{"en":"Fishermen sometimes used mawks as bait.","zh":"渔民有时会用蛆当鱼饵。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, dialect) To become infested with maggots (third-person singular: mawks).","zh":"（罕见/方言）（使）生蛆；（第三人称单数：mawks）。"},"examples":[{"en":"In the heat, the garbage mawks quickly.","zh":"天气一热，垃圾很快就会生蛆。"}]}],"synonyms":["maggots","larvae"],"phonetic":"/mɔk/","extraExplanation":["“mawks”通常是名词“mawk”的复数，或动词“mawk”的第三人称单数。这个词在现代标准英语里非常少见，更常见的说法是 “maggots”（蛆）。","如果你想表达“标记/分数/痕迹”，你可能想查的是 “marks”（拼写很接近）。"]}
{"word":"mawky","summary":{"en":"“Mawky” is a rare dialect adjective meaning “dirty/muddy,” and in older use it can mean “spoiled/rotten.”","zh":"“mawky”是较少见的方言形容词，常指“肮脏/泥泞”；在较旧用法中也可指“变质/腐烂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dialect, mainly Scots/Northern English) dirty; muddy; messy.","zh":"（方言，主要见于苏格兰/英格兰北部）肮脏的；泥泞的；乱糟糟的。"},"examples":[{"en":"My boots are mawky after walking through the field.","zh":"我走过田地后，靴子变得又脏又泥。"},{"en":"Don’t sit on that mawky step.","zh":"别坐在那级又脏又泥的台阶上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Older/rare) spoiled or rotten, sometimes implying being full of maggots (especially of meat or food).","zh":"（较旧/少见）变质的；腐烂的（有时含“生蛆”的意思，尤指肉或食物）。"},"examples":[{"en":"The meat had gone mawky, so they threw it away.","zh":"那肉已经腐坏了，所以他们把它扔了。"},{"en":"The smell told us the food was mawky.","zh":"味道告诉我们食物已经变质了。"}]}],"synonyms":["mucky","muddy","dirty","filthy","grimy","spoiled","rotten"],"phonetic":"/ˈmɔki/","extraExplanation":["“mawky”在现代标准英语里非常少见，多出现在苏格兰英语或英格兰北部方言中；在一般写作里更常用“muddy / dirty / mucky”表达“又脏又泥”。","它常被当作“mucky（脏的）”的方言变体来理解；在一些旧文本里也可指食物腐坏、甚至“生蛆”的状态。"]}
{"word":"mawmish","summary":{"en":"Mawkish means overly sentimental in an artificial or unpleasant way; it can also mean sickly sweet in taste or smell.","zh":"Mawkish 指过分煽情、显得做作的；也可指味道或气味甜腻得发腻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overly sentimental or emotional in a way that feels false, weak, or unpleasant.","zh":"（感情表达）过分多愁善感的；矫情的；让人觉得做作或不舒服的。"},"examples":[{"en":"The movie’s ending felt mawkish rather than moving.","zh":"这部电影的结尾让人觉得矫情，而不是感人。"},{"en":"He wrote a mawkish poem full of exaggerated sadness.","zh":"他写了一首矫情的诗，充满了夸张的悲伤。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a sickly-sweet taste or smell; cloying.","zh":"（味道或气味）甜腻的；令人发腻的。"},"examples":[{"en":"The candy had a mawkish sweetness that was hard to finish.","zh":"这糖甜得发腻，很难吃完。"}]}],"synonyms":["overly sentimental","sappy","cloying","saccharine"],"phonetic":"/ˈmɔkɪʃ/","extraExplanation":["你输入的“mawmish”通常是对 **mawkish** 的拼写误写。标准拼写是 **mawkish**。","词感上，**mawkish** 常用来“轻微批评”那种为了煽情而煽情的表达（例如广告、电影桥段、文章结尾）。","在文学/影评语境里，常见搭配有：**mawkish sentiment**, **mawkish nostalgia**, **mawkish ending**。"]}
{"word":"mawn","summary":{"en":"“Mawn” is a nonstandard/dialect spelling of “mown,” meaning “cut (grass/plants).”","zh":"“mawn”是“mown”的非标准/方言拼写，意思是“（草/植物）被割过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/dialect spelling) of “mown”: grass or plants that have been cut with a mower or scythe.","zh":"（非标准/方言拼写）“mown”的写法：指草或植物已被割草机或镰刀割过。"},"examples":[{"en":"The lawn looked neat after it was mawn.","zh":"草坪被割过之后看起来很整齐。"},{"en":"He walked across the mawn field to the barn.","zh":"他穿过割过的田地走向谷仓。"}]}],"synonyms":["mown","cut","trimmed"],"phonetic":"/moʊn/","extraExplanation":["“mawn”多见于方言或口语化拼写，用来按发音写出“mown”（动词 mow 的过去分词）。在标准英文写作里通常用“mown”，例如：the mown grass（割过的草）。如果你是在阅读带方言风格的文学作品或歌词，看到“mawn”很可能就是这个意思。"]}
{"word":"mawp","summary":{"en":"“Mawp” is a humorous sound effect meaning muffled hearing or ringing ears—like you can’t hear what someone is saying.","zh":"“mawp”是一个带梗的拟声词，表示听觉变得模糊或耳鸣，好像听不清别人说话。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A written sound effect used to show that someone’s hearing is muffled or ringing (as if they can’t hear what’s being said), often used humorously online.","zh":"表示“听不清/耳鸣嗡嗡作响”的拟声词（文字音效），常用于网络语境里带幽默感地表达“我听不到你在说什么”。"},"examples":[{"en":"After the fireworks, all I could hear was: mawp… mawp…","zh":"烟花放完后，我耳朵里只剩下：mawp……mawp……"},{"en":"He started explaining the rules, but my brain went mawp and I missed everything.","zh":"他开始解释规则，但我脑子直接 mawp 了，啥都没听进去。"}]}],"synonyms":["ringing","muffled","eeee (tinnitus sound)"],"phonetic":"/mɑwp/","extraExplanation":["“mawp”常被认为来自美剧《Archer（间谍亚契）》里的梗：角色在爆炸或枪声后出现耳鸣、听不清别人说话时，会用“mawp… mawp…”来表现听觉被“消音/糊住”。后来在社交媒体上被广泛引用，表示注意力断线、信息进不去或现场太吵听不清。"]}
{"word":"maws","summary":{"en":"“Maws” is the plural of “maw,” meaning an animal’s stomach/throat, or (figuratively) a gaping mouth-like opening.","zh":"“maws”是“maw”的复数，指动物的胃/喉部，也可比喻像大嘴一样张开的巨大开口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “maw”: the stomach or throat of an animal (especially a bird), sometimes used in cooking or biology.","zh":"“maw”的复数：指动物（尤指鸟类）的胃或喉部（在烹饪或生物学语境中也会用到）。"},"examples":[{"en":"Some birds store food in their maws before digesting it.","zh":"有些鸟会先把食物储存在胃囊/喉部里，然后再消化。"},{"en":"The researcher examined the maws of several seabirds to see what they had eaten.","zh":"研究人员检查了几只海鸟的胃，看看它们吃了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “maw”: a large, open mouth or opening; figuratively, something that seems ready to swallow things up (often used in vivid or literary writing).","zh":"“maw”的复数：大嘴或巨大的开口；比喻“像要吞噬一切的东西”（常见于形象或文学性表达）。"},"examples":[{"en":"The caves looked like dark maws in the hillside.","zh":"山坡上的洞穴看起来像一个个黑暗的大口。"},{"en":"In the fog, the tunnel entrances became shadowy maws.","zh":"在雾中，隧道入口变成了阴影般的“大口”。"}]}],"synonyms":["mouths","openings","gullets","stomachs","chasm(s)"],"phonetic":"/mɔz/","extraExplanation":["“maw”比较偏文学或描写性用词，带有“张口吞噬”的画面感；日常英语里更常说“mouth/opening”或“stomach”。","词源上来自古英语，原意与“胃、咽喉”有关；后来引申为“像嘴一样的开口”。"]}
{"word":"mawseed","summary":{"en":"“Mawseed” is not standard English; it’s likely a misspelling or a proper name.","zh":"“mawseed”不是标准英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/brand. If you mean it as two words, “maw seed” could be read literally as “seed in an animal’s maw (mouth/throat),” but this is not a common expression.","zh":"不是标准英语单词，更可能是拼写错误、专有名词（人名/品牌名）。如果按两个词理解为“maw seed”，字面可指“在（动物）咽喉/口中之种子”，但这不是常见说法。"},"examples":[{"en":"I can’t find “mawseed” in an English dictionary—do you mean “mossy,” “mustard seed,” or something else?","zh":"我在英语词典里找不到“mawseed”——你是不是想写“mossy（长满苔藓的）”、“mustard seed（芥菜籽）”，或别的词？"},{"en":"If “Mawseed” is a company or username, its meaning depends on the creator.","zh":"如果“Mawseed”是公司名或用户名，它的含义要看命名者的设定。"}]}],"phonetic":"/ˈmɔːsiːd/","extraExplanation":["“maw”在英语里是“（动物的）大口、咽喉、胃”等含义（文学语境较常见），发音类似“mɔː”。如果你能提供一句包含“mawseed”的原句或你想表达的中文意思，我可以帮你锁定正确的单词/短语，并给出更准确的解释与例句。"]}
{"word":"mawsie","summary":{"en":"“Mawsie” is a rare Scots/UK dialect word meaning “timid/shy (mouse-like),” and sometimes “a mouse.”","zh":"“Mawsie”是较少见的苏格兰/英式方言词，常指“胆小害羞（像老鼠一样）”，有时也指“老鼠”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dialect, Scots/UK) Timid, meek, or shy in a “mouse-like” way; not bold.","zh":"（方言，苏格兰/英式）胆小的、温顺的、害羞的；像老鼠一样不张扬。"},"examples":[{"en":"He’s a quiet, mawsie lad who hates being the center of attention.","zh":"他是个安静、很“mawsie”的男孩，讨厌成为关注焦点。"},{"en":"Don’t be so mawsie—tell them what you think.","zh":"别这么怯生生的——把你的想法说出来。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, dialect) A mouse.","zh":"（少见，方言）老鼠。"},"examples":[{"en":"A wee mawsie ran across the kitchen floor.","zh":"一只小老鼠从厨房地板上跑过去。"}]}],"synonyms":["mousy","shy","timid","meek","bashful"],"phonetic":"/ˈmɔːzi/","extraExplanation":["“mawsie”多见于苏格兰英语/方言写作，和更常见的标准英语“mousy”（胆小的、畏缩的）同源/同义。日常英语里更常用“shy / timid / mousy”。如果你是在短信或用户名里看到，也可能是把“mousy”拼成了“mawsie”。"]}
{"word":"mawworm","summary":{"en":"Mawworm is an old insult meaning a hypocritical person who pretends to be very pious or morally strict.","zh":"Mawworm 是一个古老的侮辱性词语，指假装虔诚或道德严苛的伪善者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, usually insulting) A hypocrite or someone who pretends to be very religious or morally strict in order to gain approval.","zh":"（古语，常作侮辱）伪善者；假装虔诚或道德高尚以博取好感的人。"},"examples":[{"en":"He called the man a mawworm for preaching virtue while cheating his neighbors.","zh":"他骂那个人是个 mawworm，一边宣讲美德一边却欺骗邻居。"},{"en":"In old plays, a “mawworm” is often a character who looks pious but behaves selfishly.","zh":"在一些老戏剧里，“mawworm”常指表面虔诚、实则自私的人物。"}]}],"synonyms":["hypocrite","sanctimonious person","pharisee","moralizer","prig"],"phonetic":"/ˈmɔˌwɝm/","extraExplanation":["这是一个非常古老、带强烈贬义的词，现代英语里几乎不再日常使用；更常见的近义表达是 hypocrite（伪君子）、sanctimonious person（假装圣洁的人）、holier-than-thou type（自以为比别人更圣洁的人）。","词形可理解为 maw（胃/口、肚子）+ worm（虫），带有“像虫一样钻在里面”的侮辱感，暗示这种人靠“吞食”他人的信任或道德名声而活。","你可能在旧文学或戏剧文本里见到它；如果写现代文章，除非刻意营造古风或讽刺效果，一般不建议用这个词。"]}
