{"word":"maza","summary":{"en":"maza: a South Asian slang word meaning “fun/pleasure,” sometimes used as an exclamation for “awesome!”","zh":"maza：南亚口语借词，表示“乐趣/享受”，也可作感叹“太爽了/太棒了”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English / Hinglish) enjoyment, pleasure, or “fun,” often used casually in conversation.","zh":"（南亚英语/印地语夹英语常用）乐趣、享受、痛快；口语里表示“很爽/很好玩”。"},"examples":[{"en":"The trip was full of maza—we laughed the whole time.","zh":"这次旅行特别有意思（maza），我们一路都在笑。"},{"en":"No maza in this movie; it’s too slow.","zh":"这电影没啥意思（没maza），节奏太慢了。"},{"en":"Spicy food is my maza!","zh":"辣的食物就是我的快乐（我的maza）！"}]},{"partOfSpeech":"int.","definition":{"en":"(South Asian English / Hinglish, informal) used to say something is enjoyable or satisfying, similar to “nice!” or “that’s the best!”","zh":"（南亚英语/印地语夹英语，非正式）感叹用法：表示“真爽！/太棒了！/过瘾！”"},"examples":[{"en":"You got front-row seats? Maza!","zh":"你抢到第一排座位了？爽（maza）！"},{"en":"The final goal was maza—everyone cheered.","zh":"最后那个进球太过瘾了（maza），大家都在欢呼。"}]}],"synonyms":["fun","enjoyment","pleasure","thrill","delight"],"phonetic":"/məˈzɑː/","extraExplanation":["“maza/mazaa（常写作 mazaa）”源自印地语/乌尔都语 मज़ा / مزہ，意思是“乐趣、享受、滋味”。在南亚地区的英语口语里很常见，属于文化借词（loanword），常见搭配有：maza aaya（很爽/很好玩）、mazaa nahi aaya（没意思/不尽兴）。","拼写上你可能会看到：maza、mazaa。长音更强调“更爽、更过瘾”的感觉。"]}
{"word":"mazaedia","summary":{"en":"“mazaedia” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“mazaedia”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a proper name (e.g., a username/brand). If you meant a common English word, please share the sentence or the correct spelling.","zh":"不是标准英语单词，可能是拼写错误或专有名词（如用户名/品牌）。如果你想查的是常见英文词，请提供句子或确认正确拼写。"},"examples":[{"en":"I can’t find “mazaedia” in a dictionary—did you mean “media”?","zh":"我在词典里找不到“mazaedia”——你是不是想写“media”？"},{"en":"Could you tell me where you saw the word “mazaedia” (a book, game, website)?","zh":"你是在哪里看到“mazaedia”这个词的（书、游戏、网站）？"}]}],"phonetic":"/ˌmæzəˈdiə/","extraExplanation":["“mazaedia”看起来像拼写误差或把两个词拼到一起。最接近的常见词之一是 **media**（媒体），但也可能是某个品牌/ID/作品名。","如果你把包含它的英文句子发我，我可以根据上下文判断它可能想表达的词，并给出准确释义与用法。"]}
{"word":"mazaedidia","summary":{"en":"“mazaedidia” isn’t a recognized English word; please provide context or the intended meaning/spelling.","zh":"“mazaedidia”不是常见英语词；请提供上下文或你想表达的意思/正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not found as a standard English word. It may be a misspelling, a name, or a transliteration from another language.","zh":"这不是标准英语词汇。它可能是拼写错误、人名/地名，或其他语言的音译。"},"examples":[{"en":"I can’t find “mazaedidia” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“mazaedidia”——你能把它出现的句子发给我吗？"},{"en":"If you meant “mass media,” the spelling is different.","zh":"如果你想写的是“mass media（大众媒体）”，拼写是不一样的。"}]}],"phonetic":"/ˌmæz.eɪˈdɪd.i.ə/","extraExplanation":["我目前无法把“mazaedidia”匹配到常见英语单词或固定短语。最有效的做法是：你把原句/截图发来，或告诉我它来自哪种语言、是否是人名/品牌/地名。","也可能是拼写接近某个词（例如 mass media、Mazda 等），但仅凭这个串很难确定。你也可以告诉我你想表达的中文意思，我来反推最可能的英文。"]}
{"word":"mazaedium","summary":{"en":"“mazaedium” isn’t recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“mazaedium”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language. Please share the sentence or intended meaning so I can identify the correct word.","zh":"不是标准英语单词。可能是拼写错误、人名/地名，或来自其他语言。请提供出现的句子或你想表达的意思，我可以帮你确定正确的词。"},"examples":[{"en":"I couldn’t find “mazaedium” in major English dictionaries—could you provide a sentence with it?","zh":"我在主要英语词典里查不到“mazaedium”，你能提供一个包含它的句子吗？"},{"en":"Did you mean “medium” (something in the middle) or “mausoleum” (a tomb building)?","zh":"你是不是想写“medium”（中间/媒介）或“mausoleum”（陵墓建筑）？"}]}],"extraExplanation":["“mazaedium”看起来像是拼写误差或专有名词。常见的相近拼写候选包括：\n- medium：意为“媒介/中等”，读音和拼写都比较接近。\n- mausoleum：意为“陵墓”，字母组合也有相似之处。\n如果你告诉我：①它出现的上下文（句子/文章领域），②你想表达的中文意思，③是否是人名/品牌/游戏术语，我可以更准确地匹配并给出正式释义。"]}
{"word":"mazagran","summary":{"en":"Mazagran is a cold, often sweetened iced coffee drink, sometimes flavored with lemon.","zh":"Mazagran 指一种冷饮咖啡，常加糖加冰，有时带柠檬等风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cold coffee drink, usually sweetened and served over ice; sometimes mixed with lemon or other flavorings.","zh":"一种冷咖啡饮品，通常加糖并加冰饮用；有时会加入柠檬或其他风味。"},"examples":[{"en":"On hot days, he orders a mazagran instead of a regular iced coffee.","zh":"天气很热的时候，他会点一杯 mazagran，而不是普通的冰咖啡。"},{"en":"The café’s mazagran is served over ice with a slice of lemon.","zh":"这家咖啡馆的 mazagran 加冰并配一片柠檬。"}]}],"synonyms":["iced coffee","cold coffee","coffee lemonade (variant)"],"phonetic":"/ˈmæzəɡræn/","extraExplanation":["“Mazagran”常被认为与19世纪阿尔及利亚的马扎格兰（Mazagran）要塞有关；传说法国士兵在炎热环境下把咖啡加冰（或稀释）饮用，后来这种“冷咖啡”概念在法国流行并演变出不同版本。","在不同国家/咖啡馆里，mazagran 的配方差异很大：有的接近“加柠檬的冰咖啡”，有的更像“咖啡苏打/气泡咖啡”，点单时可询问具体配方。"]}
{"word":"mazalgia","summary":{"en":"Mazalgia refers to breast pain; the standard term is mastalgia.","zh":"mazalgia 指乳房疼痛；更标准常用的术语是 mastalgia。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Breast pain or soreness (a medical term; more commonly spelled “mastalgia”).","zh":"乳房疼痛或酸胀（医学术语；更常见拼写为 mastalgia）。"},"examples":[{"en":"She reported mastalgia that worsened before her period.","zh":"她说在月经来前乳房疼痛会加重。"},{"en":"The doctor asked whether the breast pain was constant or came and went.","zh":"医生询问这种乳房疼痛是持续性的还是时有时无。"}]}],"synonyms":["mastalgia","mammalgia","breast pain"],"phonetic":"/mæsˈtæl.dʒə/","extraExplanation":["“Mazalgia”在英语医学语境中较少见，通常是“mastalgia”的误拼或少见变体。临床资料与科普文章更常用 mastalgia（也可见 mammalgia）。","mastalgia 常按发生规律分为：周期性（多与月经周期相关）与非周期性（与周期无明显关系）。如果疼痛持续、单侧明显、伴肿块/皮肤改变/分泌物等，应尽快就医评估。"]}
{"word":"Mazama","summary":{"en":"a genus of American brocket deer; also the name of an Oregon volcano","zh":"美洲麂鹿属；亦指美国俄勒冈的一座古火山（马扎马火山）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A brocket deer (a small to medium deer) of the genus *Mazama*, found in Central and South America.","zh":"（动物）麂鹿属（Mazama）的小到中型鹿类，分布于中美洲与南美洲。"},"examples":[{"en":"The red brocket deer belongs to the genus Mazama.","zh":"红麂鹿属于麂鹿属（Mazama）。"},{"en":"Mazama species are usually shy and live in forested habitats.","zh":"麂鹿属的物种通常很胆小，多生活在森林栖息地。"}]},{"partOfSpeech":"n.","definition":{"en":"Mount Mazama, an extinct volcano in Oregon whose collapse formed Crater Lake.","zh":"（地名）马扎马火山：美国俄勒冈州的一座古火山，其塌陷形成了火山口湖——火山湖（Crater Lake）。"},"examples":[{"en":"Crater Lake sits in the caldera of Mount Mazama.","zh":"火山湖位于马扎马火山的破火山口中。"},{"en":"Scientists study Mount Mazama’s eruption history through ash layers.","zh":"科学家通过火山灰层研究马扎马火山的喷发历史。"}]}],"synonyms":["brocket deer","deer","Mount Mazama","volcano"],"phonetic":"/məˈzɑːmə/","extraExplanation":["在英语语境里，*Mazama* 常见于两类文本：①动物学/生态学（指麂鹿属）；②地质与旅游介绍（指马扎马火山与火山湖）。阅读时可根据是否出现 deer/species/forest 或 volcano/Crater Lake/caldera 来判断含义。"],"etymology":"多通过西班牙语进入英语：西语 *mazama* 指一种美洲鹿类；其来源一般认为与纳瓦特尔语（Nahuatl）中“鹿”的词根有关。作为地名 *Mount Mazama*，名称在美国西北地区使用并被沿用至今。","mnemonic":["把 *Mazama* 记成“ma-za-ma”三拍：看到生态文章里出现这串音，多半在讲“鹿类（麂鹿属）”。","联想地名：*Mount Mazama* → 想到美国俄勒冈的 *Crater Lake*（火山湖），两者常一起出现。"]}
{"word":"mazama","summary":{"en":"Mazama most commonly refers to brocket deer (genus *Mazama*), and it can also mean Mount Mazama in Oregon or the Mazamas mountaineering club.","zh":"Mazama 常指短角鹿属（*Mazama*）的鹿类；也可指俄勒冈州的马扎马山，或当地的 Mazamas 登山组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of small-to-medium American deer, especially a brocket deer (genus *Mazama*) found in Central and South America.","zh":"一种美洲小到中型鹿，尤指短角鹿属（*Mazama*）的鹿类，分布于中美洲和南美洲。"},"examples":[{"en":"The red brocket deer (*Mazama americana*) is shy and usually stays in dense forest.","zh":"红短角鹿（*Mazama americana*）很胆小，通常待在茂密的森林里。"},{"en":"In some field guides, several brocket deer species are listed under the genus *Mazama*.","zh":"在一些野外图鉴中，多种短角鹿被归在短角鹿属（*Mazama*）之下。"}]},{"partOfSpeech":"n.","definition":{"en":"Mount Mazama, an ancient volcano in Oregon, U.S.A., whose collapse formed Crater Lake.","zh":"马扎马山：美国俄勒冈州的一座古火山，其塌陷形成了火山口湖（Crater Lake）。"},"examples":[{"en":"Crater Lake lies inside the caldera of Mount Mazama.","zh":"火山口湖位于马扎马山的破火山口之内。"},{"en":"Geologists study Mount Mazama to understand large volcanic eruptions.","zh":"地质学家研究马扎马山，以了解大型火山喷发。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mazamas, a mountaineering and hiking organization based in the Pacific Northwest (U.S.).","zh":"“Mazamas”登山组织：美国太平洋西北地区的登山与徒步团体。"},"examples":[{"en":"She joined the Mazamas to learn basic climbing skills.","zh":"她加入了 Mazamas 来学习基础攀登技能。"},{"en":"The Mazamas offer classes and group hikes in the region.","zh":"Mazamas 在当地提供课程和团体徒步活动。"}]}],"synonyms":["brocket deer","Mount Mazama"],"phonetic":"/məˈzɑːmə/","extraExplanation":["“Mazama”作动物学名称时，常被认为与纳瓦特尔语（Nahuatl）中表示“鹿”的词根有关；在拉丁学名中用作属名（*Mazama*）。","“Mount Mazama”的命名与“鹿”的含义有关：早期命名者借用了这一词形；该火山约在7700年前发生巨大喷发并塌陷，形成今天的 Crater Lake。"]}
{"word":"mazame","summary":{"en":"“Mazame” is likely a misspelling of “Mazama,” a name for an Oregon volcano (linked to Crater Lake) and also a deer genus in biology.","zh":"“mazame”很可能是“Mazama”的误拼：既可指与火山口湖相关的俄勒冈州马扎马火山，也可指生物学中的鹿类属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Mazama”) a proper name used for Mount Mazama, an extinct volcano in Oregon, USA; its collapse formed Crater Lake.","zh":"（通常拼作“Mazama”）专有名词：美国俄勒冈州的一座死火山——马扎马火山；其坍塌形成了火山口湖（Crater Lake，火山口湖国家公园的著名景观）。"},"examples":[{"en":"Crater Lake sits inside the caldera of Mount Mazama.","zh":"火山口湖位于马扎马火山的破火山口内。"},{"en":"The eruption of Mount Mazama dramatically changed the landscape.","zh":"马扎马火山的喷发极大改变了当地的地貌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) a scientific genus name for certain brocket deer found in the Americas.","zh":"（生物）“Mazama”是美洲部分小鹿（赤麂类/短角鹿类常译作“赤麂属/短角鹿属”等，依语境而定）的属名（学名属）。"},"examples":[{"en":"Mazama is a genus of brocket deer native to the Americas.","zh":"Mazama 是美洲原生的一类短角鹿（赤麂类）属名。"},{"en":"Researchers compared DNA among different Mazama species.","zh":"研究人员比较了不同 Mazama 物种之间的 DNA。"}]}],"synonyms":["Mount Mazama","Crater Lake (contextual)"],"phonetic":"/məˈzɑːmə/","extraExplanation":["“mazame”在英语里并不是常见标准拼写；你可能想查的是 **Mazama**（火山名/生物属名）或 **madam**（女士/夫人，用于称呼）。如果你告诉我语境（地理、生物，还是日常对话），我可以把最合适的词条补充得更精确。"]}
{"word":"Mazandarani","summary":{"en":"from Mazandaran; a person or the language of that region in northern Iran","zh":"伊朗马赞达兰地区的；指当地人或当地语言（马赞达拉尼语）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Mazandaran (a province on the southern coast of the Caspian Sea in northern Iran)","zh":"马赞达兰（伊朗北部里海沿岸一省）的人；马赞达兰人"},"examples":[{"en":"Many Mazandaranis speak Persian as well as their local language.","zh":"很多马赞达兰人既会说波斯语，也会说他们的本地方言/语言。"},{"en":"She is Mazandarani and visits her hometown every summer.","zh":"她是马赞达兰人，每年夏天都会回家乡。"}]},{"partOfSpeech":"n.","definition":{"en":"the Northwestern Iranian language spoken in Mazandaran; also called Tabari","zh":"马赞达拉尼语（伊朗西北伊朗语支语言之一；也称塔巴里语 Tabari）"},"examples":[{"en":"He can read folk songs written in Mazandarani.","zh":"他能读用马赞达拉尼语写的民歌。"},{"en":"The museum has recordings of stories in Mazandarani.","zh":"博物馆有马赞达拉尼语故事的录音。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Mazandaran, its people, or its language","zh":"与马赞达兰（地区/人群/语言）有关的；马赞达兰的"},"examples":[{"en":"Mazandarani cuisine often uses herbs, rice, and fish.","zh":"马赞达兰菜常用香草、米饭和鱼。"},{"en":"They studied Mazandarani traditions and music.","zh":"他们研究马赞达兰的传统与音乐。"}]}],"synonyms":["Tabari"],"phonetic":"ˌmæzənˈdærəni","extraExplanation":["在英语里，像“+ -i”的形式常用来表示某地的人或语言（例如 Iraqi, Pakistani）。因此 Mazandarani 既可指“马赞达兰人”，也可指“马赞达拉尼语”，还可作形容词表示“马赞达兰的”。"],"etymology":"源自地名“马赞达兰（Mazandaran）”+ 英语形容词/名词后缀“-i”，表示“某地的人/语言/相关事物”。","mnemonic":["记成“马赞达兰 + -i（某地的人/语言）”：看到 -i 就联想到“来自那里/那里的语言”。","把 Mazandarani 拆着读：Mazan-daran-i，最后的 -i 提醒你它常用作“人/语言/形容词”。"]}
{"word":"mazanderani","summary":{"en":"Mazanderani refers to the people, culture, or language of Mazandaran (northern Iran); it can mean a person from Mazandaran or the Mazanderani language.","zh":"Mazanderani 指伊朗北部马赞德兰地区的人民、文化或语言；可指马赞德兰人，也可指马赞德拉尼语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mazandaran Province in northern Iran, or to its people, culture, or language.","zh":"与伊朗北部马赞德兰省有关的；指马赞德兰地区的人民、文化或语言的。"},"examples":[{"en":"Mazanderani music often uses rhythms that feel different from Persian pop.","zh":"马赞德拉尼音乐常用的节奏和波斯流行乐的感觉不太一样。"},{"en":"She is doing research on Mazanderani culture along the Caspian Sea.","zh":"她正在研究里海沿岸的马赞德拉尼文化。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mazandaran Province in Iran.","zh":"马赞德兰人（来自伊朗马赞德兰省的人）。"},"examples":[{"en":"He is a Mazanderani who grew up near Sari.","zh":"他是马赞德兰人，在萨里附近长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Iranian language traditionally spoken in Mazandaran Province (also commonly spelled “Mazandarani”).","zh":"马赞德拉尼语（伊朗语支的一种语言，主要在马赞德兰省使用；也常拼作 Mazandarani）。"},"examples":[{"en":"Her grandparents speak Mazanderani at home, but she answers in Persian.","zh":"她的祖父母在家说马赞德拉尼语，但她用波斯语回答。"},{"en":"I can understand a little Mazanderani, but I’m not fluent.","zh":"我能听懂一点马赞德拉尼语，但不流利。"}]}],"synonyms":["Mazandarani","Tabari"],"phonetic":"/ˌmɑː.zæn.dəˈrɑː.ni/","extraExplanation":["在英语里，这个词常见的拼写是 **Mazandarani**；**Mazanderani** 也能见到，但相对少一些。","历史上马赞德拉尼语有时也被称为 **Tabari**（塔巴里语），在学术或历史语境中可能会遇到。","发音上，重音通常落在 “-da-” 附近：Ma-**zan**-da-ra-ni（不同说话者会略有差异）。"]}
{"word":"mazapilite","summary":{"en":"Mazapilite is a rare tellurite mineral name, mainly used in geology and mineralogy.","zh":"Mazapilite 是一种罕见的亚碲酸盐矿物名称，主要用于地质与矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a tellurite) found in some tellurium-rich ore deposits","zh":"一种罕见矿物（亚碲酸盐类），常见于富含碲的矿床中"},"examples":[{"en":"Mazapilite is a rare tellurite mineral reported from a few localities.","zh":"Mazapilite 是一种罕见的亚碲酸盐矿物，仅在少数地点有报道。"},{"en":"The specimen contains mazapilite associated with other tellurium minerals.","zh":"这件标本中含有 mazapilite，并与其他含碲矿物共生。"}]}],"phonetic":"/məˈzæpɪˌlaɪt/","extraExplanation":["该词属于矿物学专名，多用于地质报告、矿物目录与标本描述中，日常英语中几乎不出现。","词源上通常认为来自墨西哥萨卡特卡斯州（Zacatecas）的 Mazapil 地名（许多矿物会以发现地或著名产地命名）。读写时可将其拆成 “Mazapil + -ite（矿物后缀）”。"]}
{"word":"mazard","summary":{"en":"“Mazard” is an archaic slang word meaning “head.”","zh":"“mazard”是一个古旧俚语，意思是“头、脑袋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, slang) A person’s head.","zh":"（古旧俚语）人的头、脑袋。"},"examples":[{"en":"He took a knock on the mazzard and felt dizzy.","zh":"他脑袋挨了一下，觉得头晕。"},{"en":"Keep your mazzard down when you walk under that low beam.","zh":"从那根低梁下面走时，把头低一点。"}]}],"synonyms":["head","noggin","pate"],"phonetic":"/ˈmæzɚd/","extraExplanation":["“mazard/mazzard”在现代英语里非常少见，带有强烈的古风和俚语色彩；在莎士比亚时代及其后的一些作品中能见到，用来粗俗或幽默地指“头”。","拼写上常见变体有“mazard”和“mazzard”。在当代写作中通常用更常见的词如“head”“noggin”“pate”。"]}
{"word":"mazards","summary":{"en":"“Mazards” is the plural of the archaic slang noun “mazard,” meaning “heads.”","zh":"“mazards”是古语俚语名词“mazard”的复数，意思是“头（们）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, slang) A head; the human skull.","zh":"（古语/俚语）头；人类的头颅。"},"examples":[{"en":"He took a blow to the mazard and fell down.","zh":"他头上挨了一下，倒了下去。"},{"en":"Use your mazard—think before you act.","zh":"动动脑子——做事前先想一想。"}]}],"synonyms":["head","noggin","skull","pate"],"phonetic":"/ˈmæzərd/","extraExplanation":["“mazard/mazzard”多见于早期英语（尤其是英国俚语/口语）里，意思相当于今天更常见的“head”。现代英语中基本不用，更多是在文学作品、历史文本或模仿古风的写作中出现。","拼写上有变体“mazzard”。在一些莎士比亚同时代及更早的文本中能看到这一词，用来制造口语感或粗俗幽默感。"]}
{"word":"mazarine","summary":{"en":"Mazarine means a deep, rich blue color, or something that is that color.","zh":"Mazarine 指一种浓郁的深蓝色，或“深蓝色的”事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep, rich blue color (often called “mazarine blue”).","zh":"一种浓郁的深蓝色（常称“马扎然蓝/马扎林蓝”）。"},"examples":[{"en":"She chose mazarine curtains to give the room a calm, elegant look.","zh":"她选了马扎然蓝的窗帘，让房间显得宁静又雅致。"},{"en":"The painting uses mazarine blue in the shadows to add depth.","zh":"这幅画在阴影里用了马扎然蓝，增加了层次感。"}]},{"partOfSpeech":"adj.","definition":{"en":"deep blue in color.","zh":"呈浓郁深蓝色的。"},"examples":[{"en":"He wore a mazarine tie with a white shirt.","zh":"他穿白衬衫配了一条马扎然蓝的领带。"},{"en":"Under the evening sky, the sea looked almost mazarine.","zh":"傍晚天空下，大海看起来几乎是马扎然蓝的。"}]}],"synonyms":["deep blue","navy","royal blue"],"phonetic":"/ˈmæzəˌriːn/","extraExplanation":["“mazarine/mazarine blue”这个词与17世纪法国政治家红衣主教朱尔·马扎然（Cardinal Mazarin）有关。据说这种深蓝色在当时的服饰与染色中很流行，因此以他的名字来称呼。现代英语里它较少见，更多出现在艺术、设计或较文学化的描写中。"]}
{"word":"Mazatec","summary":{"en":"an Indigenous people of Oaxaca, Mexico, and the language(s) they speak; also an adjective for related culture.","zh":"墨西哥瓦哈卡州的马萨特克族及其语言；也可作形容词指相关文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people of northern Oaxaca (Mexico).","zh":"（墨西哥瓦哈卡州北部的）马萨特克族人；当地的原住民族之一。"},"examples":[{"en":"A Mazatec elder shared stories about the community’s history.","zh":"一位马萨特克族长者分享了社区的历史故事。"},{"en":"The museum worked with Mazatec leaders to present the exhibit respectfully.","zh":"博物馆与马萨特克族领袖合作，以尊重的方式呈现展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language (or languages) spoken by the Mazatec people in Oaxaca, Mexico.","zh":"马萨特克语（或马萨特克诸语言）：马萨特克族在墨西哥瓦哈卡州使用的原住民语言。"},"examples":[{"en":"She is learning Mazatec to speak with her grandparents.","zh":"她正在学习马萨特克语，好和祖父母交流。"},{"en":"The book includes a short Mazatec–Spanish glossary.","zh":"这本书附有一份简短的马萨特克语—西班牙语词汇表。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mazatec people or their language and culture.","zh":"马萨特克族的；与马萨特克语或其文化有关的。"},"examples":[{"en":"They attended a Mazatec cultural festival in Oaxaca.","zh":"他们参加了瓦哈卡的一场马萨特克文化节。"},{"en":"The researcher recorded Mazatec songs with permission from the community.","zh":"研究者在获得社区许可后录制了马萨特克歌曲。"}]}],"synonyms":["Mazatecan"],"phonetic":"/ˈmɑːzəˌtɛk/","extraExplanation":["“Mazatec”既可指一个民族，也可指其语言。语言上常用复数概念来看待：马萨特克并非单一方言，而是一组彼此相关、但互通性不一的语言/方言变体。","在英文中它通常大写（Mazatec），因为既是专有名词（民族/语言名称），也可作形容词（Mazatec culture）。"],"etymology":"词名来自西班牙语 Mazateco/Mazateca，源于纳瓦特尔语（Nahuatl）中与“鹿”相关的词根；常被解释为“鹿之地/鹿之人”的含义（不同资料拼写与分析略有差异）。","mnemonic":["把它拆成音节记：Ma-za-tec ≈ “马-萨-泰克”，联想到“在墨西哥（Mexico）的一支族群/语言”，用“Mex-”和“-tec”两个硬音结尾来加深印象。"]}
{"word":"mazatec","summary":{"en":"Mazatec refers to an Indigenous people in Oaxaca, Mexico, their language(s), or anything related to their culture.","zh":"Mazatec 指墨西哥瓦哈卡州的马萨特克原住民族、其语言（或语言群），也可作形容词表示与其文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people from the Sierra Mazateca region (mainly in Oaxaca, Mexico)","zh":"马萨特克人（主要居住在墨西哥瓦哈卡州马萨特克山区的原住民族群成员）"},"examples":[{"en":"Many Mazatec communities live in the mountains of northern Oaxaca.","zh":"许多马萨特克社区居住在瓦哈卡州北部的山区。"},{"en":"She is Mazatec and grew up speaking her community’s language at home.","zh":"她是马萨特克人，从小在家里就使用本族语言。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mazatec language (a group of closely related languages) spoken in Oaxaca and nearby areas of Mexico","zh":"马萨特克语（在墨西哥瓦哈卡州及周边地区使用的一组彼此接近的语言）"},"examples":[{"en":"He is learning Mazatec to talk with his grandparents.","zh":"他在学马萨特克语，好和祖父母交流。"},{"en":"The book includes basic phrases in Spanish and Mazatec.","zh":"这本书收录了西班牙语和马萨特克语的基础短语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mazatec people or their language and culture","zh":"与马萨特克人、马萨特克语或其文化有关的"},"examples":[{"en":"Mazatec traditions are an important part of local festivals.","zh":"马萨特克传统是当地节庆的重要组成部分。"},{"en":"The museum has a Mazatec textile exhibit.","zh":"博物馆有一个马萨特克纺织品展。"}]}],"synonyms":["Mazatec people","Mazatec language"],"phonetic":"/ˌmɑːzəˈtɛk/","extraExplanation":["“Mazatec”常用作总称，但语言学上它往往指一“组”彼此相关、可分成不同方言/语言变体的马萨特克语系变体；不同地区的互通性不一定完全一样。","在英语里通常写作大写（Mazatec），因为它既是民族名称也是语言名称。","与马萨特克文化相关的英文资料中，偶尔会提到20世纪中叶一些关于萨满/仪式的民族志记载；阅读时建议尊重当地社群与宗教文化语境。"]}
{"word":"mazateco","summary":{"en":"Mazateco refers to the Mazatec people of Mexico, their language(s), or something related to their culture.","zh":"Mazateco 指墨西哥的马萨特克族人、马萨特克语（及其语言群），或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mazatec Indigenous people of northern Oaxaca (and nearby areas) in Mexico","zh":"（墨西哥瓦哈卡州北部及周边的）马萨特克族人"},"examples":[{"en":"She works with Mazateco communities in Oaxaca.","zh":"她在瓦哈卡与马萨特克族社区合作。"},{"en":"Many Mazateco families speak an Indigenous language at home.","zh":"许多马萨特克族家庭在家里使用一种原住民语言。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mazatec language (often called “Mazatec” in English); a group of closely related Indigenous languages","zh":"马萨特克语（英语中常称 Mazatec）；一组彼此相关的原住民语言"},"examples":[{"en":"He is learning Mazateco to communicate with elders.","zh":"他在学习马萨特克语，以便与长者交流。"},{"en":"Mazateco has several regional varieties.","zh":"马萨特克语有多个地区变体。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mazatec people or their language and culture","zh":"马萨特克族的；与马萨特克语或其文化有关的"},"examples":[{"en":"They shared Mazateco stories and songs at the cultural event.","zh":"他们在文化活动上分享了马萨特克族的故事与歌曲。"},{"en":"The museum has a Mazateco textile collection.","zh":"博物馆收藏了一批马萨特克族纺织品。"}]}],"synonyms":["Mazatec","Mazatec people","Mazatec language"],"phonetic":"/ˌmɑːzəˈteɪkoʊ/","extraExplanation":["“Mazateco”在英语里也能见到，但更常见的英文形式是“Mazatec”。“Mazateco”更接近西班牙语写法/用法；在学术或社区语境中，两种形式可能并存。","马萨特克语并非单一“一个”语言，而是一组亲缘很近、但在不同地区差异明显的变体；实际交流时常需要说明具体地区（例如某个城镇或区域）的说法。","在文化与历史语境中，马萨特克地区与传统草药知识及宗教仪式研究常被提及；写作时建议尊重社区自称与具体语境，避免把复杂文化简单化。"]}
{"word":"Mazda","summary":{"en":"Mazda is a Japanese car company/brand.","zh":"Mazda（马自达）是一家日本汽车公司/品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese automobile company (car brand) known for making vehicles such as sedans, SUVs, and sports cars.","zh":"马自达：日本的汽车制造公司（汽车品牌），生产轿车、SUV、跑车等车型。"},"examples":[{"en":"She drives a Mazda to work every day.","zh":"她每天开一辆马自达去上班。"},{"en":"Mazda is famous for sporty handling in some of its models.","zh":"马自达的一些车型以操控偏运动而出名。"}]}],"synonyms":["automaker","car brand"],"phonetic":"/ˈmɑːzdə/","extraExplanation":["“Mazda”是专有名词，通常不翻译，中文常写作“马自达”。","名称常被认为与两种来源有关：一是创始人姓氏“Matsuda（松田）”的读音相近；二是与古代波斯宗教中代表智慧之神的“Ahura Mazda（阿胡拉·马兹达）”有关，寓意“智慧、光明”。"]}
{"word":"Mazdaean","summary":{"en":"connected with Zoroastrianism and the worship of Ahura Mazda","zh":"与祆教（琐罗亚斯德教）及阿胡拉·马兹达崇拜相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ahura Mazda or to Zoroastrianism (the ancient Iranian religion that centers on the worship of Ahura Mazda).","zh":"与阿胡拉·马兹达（Ahura Mazda）或琐罗亚斯德教（祆教）有关的；祆教的。"},"examples":[{"en":"Mazdaean teachings emphasize the struggle between truth and lies.","zh":"祆教思想强调真理与谎言之间的斗争。"},{"en":"The inscription is often studied in the context of Mazdaean religion in ancient Persia.","zh":"这段铭文常在研究古代波斯的祆教背景时被讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"A follower of Zoroastrianism; a worshipper of Ahura Mazda (rare in modern usage).","zh":"琐罗亚斯德教（祆教）信徒；崇拜阿胡拉·马兹达的人（现代用法较少）。"},"examples":[{"en":"Some historians describe early Persian priests as Mazdaeans.","zh":"一些历史学家把早期波斯祭司称为祆教徒。"}]}],"synonyms":["Zoroastrian","Mazdean"],"phonetic":"/ˌmɑzˈdeɪən/","extraExplanation":["“Mazdaean”常见于宗教学、历史学语境，尤其谈到古代伊朗/波斯的宗教传统。更常见、也更通用的词是“Zoroastrian”（琐罗亚斯德教的）。","注意不要与汽车品牌“Mazda（马自达）”混淆：两者同形但语源与含义无关，学术语境中的“Mazdaean”指宗教与文化历史。"],"etymology":"源自“(Ahura) Mazda”（阿胡拉·马兹达）+ 英语形容词/名词后缀“-ean”（表示“……的/……的人”），用于指与祆教信仰体系相关的人或事物。","mnemonic":["把它拆成“Mazda + -ean”：-ean 常表示“……的/……的人”（如 European），所以 Mazdaean≈“与 Mazda 信仰有关的/信 Mazda 的人”。","联想“Ahura Mazda（阿胡拉·马兹达）”是祆教的至高神名：看到 Mazdaean 就想到“马兹达→祆教”。"]}
{"word":"mazdaism","summary":{"en":"Mazdaism is another name for Zoroastrianism, the ancient Persian religion centered on Ahura Mazda and moral dualism.","zh":"Mazdaism 指祆教／琐罗亚斯德教，即以阿胡拉·马兹达为中心、强调善恶与道德选择的古代波斯宗教。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Zoroastrianism; the ancient Persian religion taught by the prophet Zoroaster, centered on the worship of Ahura Mazda and a strong emphasis on moral choice (good vs. evil).","zh":"祆教／琐罗亚斯德教；古代波斯的宗教，由先知琐罗亚斯德创立，以阿胡拉·马兹达为至高神，强调善恶对立与人的道德抉择。"},"examples":[{"en":"Some historians study how Mazdaism influenced later religious ideas in the region.","zh":"一些历史学家研究祆教如何影响该地区后来的宗教观念。"},{"en":"The empire’s official religion was often described as Mazdaism, though practices varied over time.","zh":"该帝国的官方宗教常被描述为祆教，但不同时期的具体实践有所差异。"}]}],"synonyms":["Zoroastrianism"],"phonetic":"/ˈmæzdiˌɪzəm/","extraExplanation":["“Mazdaism”一词来自“Ahura Mazda（阿胡拉·马兹达）”，意为“智慧之主”。在英文写作中，它常作为“Zoroastrianism（琐罗亚斯德教）”的近义词，但有时会更强调对阿胡拉·马兹达的崇敬这一面。","在文学与历史语境中，你可能会在谈到古波斯（如阿契美尼德、萨珊王朝）宗教与礼仪时见到该词；现代更常用的通称仍是“Zoroastrianism”。"]}
{"word":"mazdaist","summary":{"en":"Mazdaist means a follower of Zoroastrianism or something related to it.","zh":"Mazdaist 指琐罗亚斯德教（祆教）的信徒，或与祆教相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Zoroastrianism (the ancient Persian religion centered on Ahura Mazda).","zh":"琐罗亚斯德教（祆教；古波斯宗教，以阿胡拉·马兹达为至高神）的信徒。"},"examples":[{"en":"A Mazdaist may worship Ahura Mazda as the supreme deity.","zh":"Mazdaist（祆教徒）可能把阿胡拉·马兹达奉为至高神。"},{"en":"Some historians describe the early Persian Empire as having strong Mazdaist influence.","zh":"一些历史学家认为早期波斯帝国深受Mazdaist（祆教）影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to Zoroastrianism; Zoroastrian.","zh":"与琐罗亚斯德教（祆教）有关的；祆教的。"},"examples":[{"en":"The museum displayed Mazdaist symbols of fire and light.","zh":"博物馆展出了祆教（Mazdaist）的火与光的象征符号。"},{"en":"The text includes Mazdaist ideas about the struggle between good and evil.","zh":"这部文本包含祆教（Mazdaist）关于善恶对抗的思想。"}]}],"synonyms":["Zoroastrian","Mazdean","Mazdaean"],"phonetic":"/ˈmæzdəˌɪst/","extraExplanation":["“Mazdaist”来自“(Ahura) Mazda（马兹达）”，即琐罗亚斯德教中的至高神阿胡拉·马兹达；因此该词常被当作“Zoroastrian（琐罗亚斯德教的）”的同义或近义表达，但在现代英语中更常见的说法通常是“Zoroastrian”。","在文学与历史写作里，“Mazdaist”有时用于强调宗教核心在“马兹达崇拜/马兹达信仰”（Mazdaism / Mazdean tradition）这一传统线索。"]}
{"word":"mazdakean","summary":{"en":"Mazdakean means “related to Mazdak/Mazdakism” or “a follower of Mazdakism.”","zh":"Mazdakean 指“与马兹达克/马兹达克主义相关的”，也可指“马兹达克主义的追随者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mazdak (a 5th–6th century Persian religious reformer) or to Mazdakism, a movement in late Sasanian Iran often described as advocating social and economic equality.","zh":"与马兹达克（5—6世纪波斯宗教改革者）或马兹达克主义有关；该运动在萨珊末期伊朗兴起，常被描述为主张社会与经济平等。"},"examples":[{"en":"Some historians discuss Mazdakean ideas when explaining social unrest in the late Sasanian Empire.","zh":"一些历史学家在解释萨珊帝国晚期的社会动荡时，会讨论马兹达克主义思想。"},{"en":"A few sources describe the reforms as Mazdakean in spirit, though the details are debated.","zh":"有些资料称这些改革带有马兹达克主义色彩，但具体细节仍有争议。"}]},{"partOfSpeech":"n.","definition":{"en":"a follower of Mazdak; an adherent of Mazdakism.","zh":"马兹达克的追随者；马兹达克主义的信徒。"},"examples":[{"en":"The text portrays the Mazdakeans as a controversial group within the empire.","zh":"这段文字把马兹达克主义者描绘成帝国内部颇具争议的群体。"},{"en":"The ruler’s crackdown forced many Mazdakeans to practice in secret.","zh":"统治者的镇压迫使许多马兹达克主义者秘密活动。"}]}],"synonyms":["Mazdakite"],"phonetic":"/ˌmɑːzdəˈkiːən/","extraExplanation":["“Mazdakean”一词来自人名 Mazdak（马兹达克），常见于历史学、宗教学语境，日常英语中很少用。","关于马兹达克主义的具体教义与社会主张，史料来源有限且互有矛盾；因此学术写作里常会用 “often described as…” “is debated” 等谨慎表达。","相关词：Mazdak（人名）、Mazdakism（马兹达克主义）、Sasanian（萨珊的）。"]}
{"word":"Mazdaki","summary":{"en":"connected with Mazdak or his movement; a follower of that movement","zh":"与马兹达克及其运动有关；该运动的追随者"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mazdak or to Mazdakism, a religious and social reform movement in late Sasanian Persia","zh":"与马兹达克（Mazdak）或“马兹达克教/马兹达克主义”（萨珊波斯晚期的宗教与社会改革运动）有关的"},"examples":[{"en":"Some historians describe the revolt as influenced by Mazdaki ideas about social equality.","zh":"一些历史学家认为这场起义受到了马兹达克主义关于社会平等的思想影响。"},{"en":"The text mentions Mazdaki communities that faced persecution after the reform failed.","zh":"文献提到改革失败后遭到迫害的马兹达克派社群。"}]},{"partOfSpeech":"n.","definition":{"en":"a follower of Mazdak; a member of the Mazdaki movement","zh":"马兹达克的追随者；马兹达克派成员"},"examples":[{"en":"He was labeled a Mazdaki by his opponents to justify his punishment.","zh":"他的对手给他扣上“马兹达克派”的帽子，以此为惩罚寻找理由。"},{"en":"Mazdaki were often portrayed as radicals in later sources.","zh":"在较晚的史料中，马兹达克派常被描绘成激进分子。"}]}],"synonyms":["Mazdakite"],"phonetic":"/mæzˈdɑːki/","extraExplanation":["马兹达克主义常被概括为强调社会公平、反对过度贫富差距的思想运动，但关于其具体教义与实践，史料多来自反对者或后世记载，描述可能带有偏见；阅读时可留意史料来源与立场。","在英语学术写作中也常见 Mazdakite 这一拼写/形式，含义接近。"],"etymology":"源自人名 Mazdak（马兹达克，约公元5–6世纪的波斯宗教改革者）；英语里用 -i 形式表示“与某人/某派有关”（常见于民族、宗派或思想流派的形容词/名词形式）。","mnemonic":["记忆法：把它拆成“Mazdak + i”，-i 很像“某某派/某某主义的”标签（如 Persian（波斯的）不是 -i，但很多专名会用这种后缀来表示“相关的”）。","联想：Mazdaki ≈ “Mazdak 的 key（关键思想）”，发音近似“maz-DAH-kee”，把“DAH”当作重音提示。"]}
{"word":"Mazdakian","summary":{"en":"related to Mazdak or his reform movement; a follower of it","zh":"与马兹达克及其改革运动有关；其追随者"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mazdak (a Persian religious and social reformer of the late 5th–early 6th century) or to his movement, Mazdakism.","zh":"与马兹达克（5世纪末至6世纪初波斯的宗教与社会改革者）或其运动“马兹达克教/马兹达克主义”有关的。"},"examples":[{"en":"Some historians describe the uprising as a Mazdakian-inspired challenge to the Sasanian elites.","zh":"一些历史学家将这场起义描述为受马兹达克主义启发、对萨珊精英阶层的挑战。"},{"en":"The text mentions Mazdakian ideas about social justice and redistribution.","zh":"这篇文本提到马兹达克主义关于社会公正与再分配的思想。"}]},{"partOfSpeech":"n.","definition":{"en":"A follower of Mazdak or Mazdakism; a Mazdakite.","zh":"马兹达克及其教义的追随者；马兹达克教徒。"},"examples":[{"en":"The chronicles portray him as a Mazdakian who opposed the old nobility.","zh":"史书记载把他描写成一位反对旧贵族的马兹达克教徒。"}]}],"synonyms":["Mazdakite","Mazdakist"],"phonetic":"/mæzˈdɑːkiən/","extraExplanation":["“马兹达克主义”（Mazdakism）常被概括为强调社会平等、限制贵族与祭司特权、提倡资源共享等理念的宗教—社会改革运动，兴起于萨珊波斯时期；不同史料对其教义细节与影响评价差异较大。","在学术写作里，Mazdakian 常用作形容词修饰 ideas、movement、reforms、uprising 等，也可作名词指教徒。"],"etymology":"来自专有名词 Mazdak（马兹达克，人名）+ 形容词/名词后缀 -ian，表示“……相关的/属于……的人”。","mnemonic":["把它拆成“马兹达克 Mazdak + -ian（某某的/某某派的人）”，看到 -ian 就联想到“某某主义/某某阵营相关”。","联想中文常见的“——派/——主义”，Mazdak + ian ≈ “马兹达克派/马兹达克主义相关”。"]}
{"word":"Mazdakite","summary":{"en":"follower of Mazdakism; or relating to it","zh":"马兹达克派信徒；或与该教派/运动有关"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Mazdak, or a member of Mazdakism, a religious and social movement in late Sasanian Persia that promoted communal ethics and social reform","zh":"马兹达克的追随者；马兹达克教（或马兹达克运动）的信徒（萨珊波斯末期的宗教与社会改革运动，强调平等与社会改革等理念）"},"examples":[{"en":"Some sources describe the Mazdakites as advocating radical social reforms in Sasanian Persia.","zh":"一些资料称马兹达克派在萨珊波斯提倡较为激进的社会改革。"},{"en":"The rebellion was suppressed, and many Mazdakites were persecuted.","zh":"叛乱被镇压，许多马兹达克派成员遭到迫害。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Mazdak or Mazdakism","zh":"与马兹达克或马兹达克教（运动）有关的"},"examples":[{"en":"The text mentions Mazdakite teachings alongside other late antique religious trends.","zh":"这篇文章把马兹达克派的教义与古代晚期其他宗教思潮并列提及。"},{"en":"Historians still debate how accurately later writers portrayed Mazdakite ideas.","zh":"历史学家仍在争论后世作者对马兹达克派思想的描述是否准确。"}]}],"synonyms":["Mazdakism adherent","Mazdak follower"],"phonetic":"/mæzˈdækaɪt/","extraExplanation":["马兹达克（Mazdak）常被描述为主张社会公平、反对过度财富集中的人物；“Mazdakite”多见于历史、宗教学、古代伊朗研究的学术语境。","不同史料对马兹达克派的观点与实践记载不一：有的强调宗教改革，有的强调社会经济主张；阅读时可留意作者与史料来源。"],"etymology":"来自人名 Mazdak（马兹达克，约5–6世纪的波斯宗教改革者）+ 英语后缀 -ite（表示“追随者/成员”，也可作形容词表示“……的”）。","mnemonic":["记后缀：-ite 常表示“某学派/某人的追随者”（如 Israelite 以色列人）。所以 Mazdak + -ite ≈ “马兹达克的追随者”。"]}
{"word":"mazdakite","summary":{"en":"Mazdakite means a follower of Mazdak or something related to the Mazdakite reform movement in late Sasanian Persia.","zh":"Mazdakite 指马兹达克的追随者，或与萨珊末期波斯的马兹达克派改革运动有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Mazdak, a Persian religious reformer; a member of the Mazdakite movement in late Sasanian Iran","zh":"马兹达克的追随者；马兹达克派（萨珊末期伊朗的一场宗教与社会改革运动）的成员"},"examples":[{"en":"Some historical sources describe Mazdakites as promoting radical social reforms.","zh":"一些史料记载马兹达克派主张激进的社会改革。"},{"en":"The king’s crackdown forced many Mazdakites to hide or flee.","zh":"国王的镇压迫使许多马兹达克派成员躲藏或逃亡。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Mazdak or the Mazdakite movement","zh":"与马兹达克或马兹达克派运动有关的"},"examples":[{"en":"The text includes a brief discussion of Mazdakite ideas.","zh":"这篇文章简要讨论了马兹达克派的思想。"},{"en":"They compared the revolt to earlier Mazdakite movements in the region.","zh":"他们把这次起义与该地区更早的马兹达克派运动作了比较。"}]}],"synonyms":["Mazdaki","Mazdakian","follower of Mazdak"],"phonetic":"/ˈmæzdəˌkaɪt/","extraExplanation":["词源与背景：Mazdakite 来自人名 Mazdak（马兹达克）+ -ite（表示“某人/某派的追随者或成员”）。类似构词：Jacobite、Israelite。","文化与历史提示：马兹达克（约5—6世纪）常被描述为提倡节制、社会平等与对财富分配的改革；不同史料对其主张细节与评价差异很大，因此在阅读“mazdakite”相关材料时要注意作者立场与史学争议。"]}
{"word":"Mazdean","summary":{"en":"connected with Zoroastrianism and the worship of Ahura Mazda","zh":"与祆教（琐罗亚斯德教）及对阿胡拉·马兹达的崇拜相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Zoroastrianism, especially the worship of Ahura Mazda in ancient Iranian religion.","zh":"与祆教/琐罗亚斯德教有关的；尤指古伊朗对“阿胡拉·马兹达”（至高神）的崇拜。"},"examples":[{"en":"Some historians describe early Persian religion as Mazdean in character.","zh":"一些历史学家把早期波斯宗教描述为具有“马兹达信仰”的特征。"},{"en":"The inscription uses ideas that are clearly Mazdean, such as truth versus the Lie.","zh":"这段铭文使用了明显的祆教观念，比如“真理”与“谎言/邪恶”的对立。"}]},{"partOfSpeech":"n.","definition":{"en":"A follower of the Mazdean religion; a Zoroastrian.","zh":"马兹达信仰的信徒；祆教/琐罗亚斯德教徒。"},"examples":[{"en":"The community included Jews, Christians, and Mazdeans living side by side.","zh":"这个社群里有犹太人、基督徒和祆教徒并居。"}]}],"synonyms":["Zoroastrian","Mazdaean"],"phonetic":"/mæzˈdiːən/","extraExplanation":["“Mazdean”多见于历史、宗教学与古代伊朗研究的英文写作中，语气偏学术；日常英语更常说“Zoroastrian”。","核心概念之一是对“真理/秩序”（Asha）与“谎言/混乱”（Druj）的道德对立，这在一些古波斯铭文与文献讨论中常被称为“Mazdean”思想。"],"etymology":"源自“(Ahura) Mazda（马兹达）”加上形容词/名词后缀“-ean”，表示“与……有关的人或事物”。在学术语境中常用来指与祆教相关的思想、文本或信徒。","mnemonic":["把它拆成“Mazda + -ean”：看到Mazda就联想到“阿胡拉·马兹达”，-ean 表示“……的/……的人”。","联想汽车品牌“MAZDA（马自达）”→ 记住它来自神名“(Ahura) Mazda”，不是汽车本身。"]}
{"word":"mazdean","summary":{"en":"Mazdean means “Zoroastrian”: relating to Zoroastrianism (Mazdaism) or a follower of it.","zh":"Mazdean 指“琐罗亚斯德教的（马兹达教的）”：既可作形容词，也可指该宗教的信徒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Zoroastrianism (Mazdaism), the ancient Iranian religion that worships Ahura Mazda","zh":"与琐罗亚斯德教（马兹达教）有关的；指古代伊朗宗教，以“阿胡拉·马兹达”为至高神"},"examples":[{"en":"Some scholars discuss Mazdean beliefs in studies of ancient Persia.","zh":"一些学者在研究古代波斯时会讨论马兹达教（琐罗亚斯德教）的信仰。"},{"en":"The text includes Mazdean ideas about the struggle between good and evil.","zh":"这篇文本包含马兹达教关于善恶斗争的思想。"}]},{"partOfSpeech":"n.","definition":{"en":"a follower of Zoroastrianism (Mazdaism)","zh":"琐罗亚斯德教（马兹达教）的信徒"},"examples":[{"en":"In historical records, Mazdeans are mentioned alongside other religious groups of the region.","zh":"在历史记录中，马兹达教信徒常与该地区其他宗教群体并列被提及。"}]}],"synonyms":["Zoroastrian","Mazdaean"],"phonetic":"/ˈmæzdiən/","extraExplanation":["“Mazdean”来自“(Ahura) Mazda”（阿胡拉·马兹达），是琐罗亚斯德教中最高神祇的名字，因此该词常用于历史、宗教学或古伊朗研究语境中；日常英语里较少见。","相关常见词：Zoroastrian（更常用的形容词/名词，指琐罗亚斯德教及其信徒）；Mazdaism（马兹达教，另一种称呼）。"]}
{"word":"mazdoor","summary":{"en":"A South Asian term meaning a manual laborer or worker.","zh":"南亚常用词，指体力劳动者/工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, from Hindi/Urdu) a laborer; a manual worker, often doing physically demanding or low-paid work.","zh":"（南亚英语，源自印地语/乌尔都语）工人；体力劳动者，常指做辛苦或报酬较低的工作的人。"},"examples":[{"en":"Many mazdoors on the construction site start work before sunrise.","zh":"建筑工地上的许多 mazdoor（工人）天没亮就开始干活。"},{"en":"The charity provided meals for migrant mazdoors who had lost their jobs.","zh":"该慈善机构为失业的外来 mazdoor（务工者）提供餐食。"},{"en":"In some news reports, the word “mazdoor” is used to refer to informal-sector workers.","zh":"在一些新闻报道中，“mazdoor”用来指非正规部门的劳动者。"}]}],"synonyms":["laborer","manual worker","worker","construction worker","day laborer"],"phonetic":"/məzˈdʊr/","extraExplanation":["“mazdoor”常见于印度、巴基斯坦等地的英语语境（South Asian English），在国际英语里通常用“laborer/worker/manual worker”表达。","词源来自印地语/乌尔都语“मज़दूर / مزدور”，与“工资/报酬”相关，带有“靠出卖劳力谋生”的含义。","使用时注意语气：在一些语境中它是中性描述，但若用来强调“低阶层/苦力”可能显得不够尊重；更中性的说法是“worker”“construction worker”“day laborer”。"]}
{"word":"mazdur","summary":{"en":"Mazdur means a manual laborer, especially in South Asian contexts (often spelled mazdur/mazdoor).","zh":"Mazdur 指体力劳动者/雇工，尤常见于南亚语境（也常拼作 mazdur/mazdoor）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a laborer; a working-class person who does manual work (especially in South Asia)","zh":"工人；体力劳动者（尤指南亚语境中的“劳工/雇工”）"},"examples":[{"en":"The contractor hired several mazdurs to carry bricks and mix cement.","zh":"承包商雇了几名 mazdur 来搬砖和拌水泥。"},{"en":"Many mazdurs are paid by the day rather than by the month.","zh":"很多 mazdur 按天计薪，而不是按月。"}]}],"synonyms":["laborer","worker","manual worker","day laborer"],"phonetic":"/ˈmɑːz.dʊr/","extraExplanation":["“mazdur”常见于乌尔都语/印地语等南亚语言，英语中多见于报道、文学翻译或移民社区语境；在英语里更常见的拼写是“mazdoor”。","这个词通常带有社会阶层与劳动条件的含义，常与“日结工、建筑工、搬运工”等场景相关。正式英语写作里可以用“laborer/worker/daily-wage worker”来替换。"]}
{"word":"maze","summary":{"en":"A “maze” is a confusing network of paths, or anything complicated and hard to understand; it can also mean “to confuse.”","zh":"“maze”指迷宫，也可指复杂难懂的事物；作动词时表示“使迷惑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A complex network of paths (or passages) designed or arranged to confuse people and make it hard to find the way out.","zh":"迷宫；错综复杂、容易让人迷路的路径或通道系统。"},"examples":[{"en":"The children ran through the hedge maze in the park.","zh":"孩子们在公园的树篱迷宫里跑来跑去。"},{"en":"We got lost in the maze of narrow streets in the old town.","zh":"我们在老城区迷宫般狭窄的街道里迷路了。"}]},{"partOfSpeech":"n.","definition":{"en":"A confusing or complicated situation or system that is difficult to understand or manage.","zh":"错综复杂的事物（或局面）；让人困惑、难以理清的系统或过程。"},"examples":[{"en":"Applying for a visa can feel like a maze of paperwork.","zh":"申请签证有时像是陷入一堆迷宫般的文件手续。"},{"en":"He tried to guide me through the maze of office rules.","zh":"他试着带我理清公司里复杂的规章制度。"}]},{"partOfSpeech":"vt.","definition":{"en":"To confuse someone or make them feel lost and unsure.","zh":"使迷惑；使不知所措。"},"examples":[{"en":"The instructions mazed me at first, but then I understood them.","zh":"这些说明一开始把我弄糊涂了，但后来我明白了。"}]}],"synonyms":["labyrinth","puzzle","tangle","confuse","bewilder"],"phonetic":"/meɪz/","extraExplanation":["“maze”常和“labyrinth（迷宫）”一起比较：日常英语里两者常可互换，但在一些文化/神话语境中，labyrinth更常指“只有一条路、绕来绕去但不分岔”的结构；maze更常指“分岔很多、容易走错”的迷宫。","常见搭配：a hedge maze（树篱迷宫）, a corn maze（玉米迷宫）, a maze of streets/rules/paperwork（街道/规则/手续的“迷宫”）。","文学与文化中，“maze”常被用作隐喻，表示人被复杂的情感、命运或制度困住，需要“find a way out（找到出路）”。"]}
{"word":"maze-like","summary":{"en":"complex and confusing, with many twists like a labyrinth","zh":"曲折复杂、容易让人迷路或理不清的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many confusing turns or passages, like a maze; complex and hard to find your way through.","zh":"像迷宫一样的；曲折复杂、让人容易迷路或难以理清的。"},"examples":[{"en":"The old city has maze-like streets that are easy to get lost in.","zh":"这座古城的街道像迷宫一样，很容易迷路。"},{"en":"The hospital corridors were maze-like, so we asked for directions.","zh":"医院走廊像迷宫一样，我们只好问路。"},{"en":"The paperwork felt maze-like, with forms and rules in every direction.","zh":"这些手续让人感觉像迷宫一样，到处都是表格和规定。"}]}],"synonyms":["labyrinthine","winding","complex","confusing","intricate"],"phonetic":"/ˈmeɪzˌlaɪk/","extraExplanation":["maze-like 常用来形容“空间结构”复杂（街道、走廊、建筑），也可以引申形容“信息/流程”复杂难懂（制度、手续、逻辑）。语气通常是“令人困惑、难以导航”。","近义表达还有 labyrinthine（更正式/文学），但日常英语里 maze-like 更直观好用。"],"etymology":"由名词 maze（迷宫）+ 形容词后缀 -like（“像……一样的”）构成。字面意思就是“像迷宫一样”。","mnemonic":["拆开记：maze（迷宫）+ like（像）→ “像迷宫一样”。","联想：去商场停车场转半天找不到出口，就是 maze-like。"]}
{"word":"mazed","summary":{"en":"“Mazed” most commonly means “bewildered or confused.” It can also be the past form of the verb “maze” (“to confuse”), which is less common.","zh":"“mazed”最常见意思是“困惑的、茫然的”。它也可以是动词“maze”（使困惑）的过去式/过去分词，但这种用法较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"confused and unable to think clearly; bewildered","zh":"困惑的；茫然的；一时想不清楚的"},"examples":[{"en":"I was mazed by all the instructions and didn’t know where to start.","zh":"我被一堆说明弄得很茫然，不知道从哪儿开始。"},{"en":"He looked mazed after hearing the sudden news.","zh":"听到突如其来的消息后，他看起来很困惑。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “maze”; to confuse or puzzle (less common in modern everyday English)","zh":"“maze”的过去式/过去分词；使困惑、使迷惑（现代日常英语中较少用作动词）"},"examples":[{"en":"The complex map mazed the new hikers.","zh":"那张复杂的地图把新手徒步者弄糊涂了。"}]}],"synonyms":["bewildered","confused","puzzled","baffled","perplexed"],"phonetic":"/meɪzd/","extraExplanation":["“mazed”常用于描述人的状态，语气比“confused”更形象，带有“像在迷宫里迷路”的感觉（maze = 迷宫）。","写作里你也会看到“a mazed look/expression”（茫然的表情）这一固定搭配。"]}
{"word":"mazedly","summary":{"en":"“Mazedly” means “in a bewildered, dazed way.” It is uncommon in everyday English.","zh":"“mazedly”意为“茫然地/迷惘地”，但在日常英语中比较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a dazed, confused, or bewildered way; showing that you are “mazed” (very puzzled).","zh":"以茫然、困惑、迷惘的方式；表现出“发懵/迷惑”的样子。"},"examples":[{"en":"She looked at the sudden change in the schedule, smiled weakly, and nodded mazedly.","zh":"她看着日程突然改动，勉强笑了笑，茫然地点了点头。"},{"en":"He wandered mazedly through the crowded station, unsure where to go.","zh":"他在拥挤的车站里迷迷糊糊地走着，不知道该去哪。"},{"en":"“Wait—what just happened?” she asked, blinking mazedly.","zh":"“等等——刚刚发生了什么？”她眨着眼，困惑地问。"}]}],"synonyms":["dazedly","bewilderedly","confusedly","blankly","stunnedly"],"phonetic":"/ˈmeɪzdli/","extraExplanation":["“mazedly”在现代英语里比较少见，多数情况下人们会用更常见的副词：\n- **amazedly**（惊讶地，强调“吃惊”）\n- **confusedly**（困惑地）\n- **dazedly**（发懵地/恍惚地，常因震惊、疲惫等）\n如果你想表达“既震惊又发懵”的感觉，**dazedly**往往更自然。","词源上来自 **maze**（迷宫）引申出的动词/形容词 **to be mazed / mazed**（迷住、使困惑；困惑的）。文学或较有风格的叙述中偶尔能见到，用来营造“像走进迷宫一样”的迷惘感。"]}
{"word":"mazedness","summary":{"en":"Mazednes means a feeling or state of confusion or bewilderment.","zh":"Mazednes 指迷惑或茫然的感觉/状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of being confused, bewildered, or mentally “lost,” as if in a maze.","zh":"迷惑、困惑、茫然的状态（好像在迷宫里找不到方向）。"},"examples":[{"en":"After hearing the sudden news, she sat in mazedness for a moment, unable to speak.","zh":"听到突如其来的消息后，她一时陷入茫然，说不出话来。"},{"en":"His mazedness showed in his eyes as he tried to follow the instructions.","zh":"他努力跟上指示时，眼神里明显流露出困惑。"}]}],"synonyms":["confusion","bewilderment","puzzlement","disorientation"],"phonetic":"/ˈmeɪzɪdnəs/","extraExplanation":["“mazedness”是由形容词“mazed（迷惑的）”加名词后缀“-ness”构成，意思直观，但在现代英语里相对少见；更常用的说法是“confusion / bewilderment”。","词根意象来自“maze（迷宫）”：把“思路乱、找不到方向”的感觉形象化。文学或较正式的叙述中偶尔会用来营造氛围。"]}
{"word":"mazeful","summary":{"en":"Mazeful means maze-like: confusing, winding, and difficult to find your way through (often used in poetic or literary writing).","zh":"Mazeful 指“迷宫般的”：曲折复杂、令人困惑、难以找到方向（多见于文学/诗意表达）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of confusing twists; like a maze; hard to understand or navigate.","zh":"像迷宫一样曲折复杂的；令人困惑、难以理清的。"},"examples":[{"en":"The old city’s mazeful alleys were easy to get lost in.","zh":"老城里迷宫般的小巷很容易让人迷路。"},{"en":"She tried to explain the mazeful rules of the game in simple words.","zh":"她试着用简单的话解释这款游戏复杂难懂的规则。"}]}],"synonyms":["maze-like","labyrinthine","winding","tangled","confusing"],"phonetic":"/ˈmeɪz.fəl/","extraExplanation":["“mazeful”非常少见，带有诗意/文学色彩。日常英语中更常用的表达是“maze-like”“labyrinthine”或“confusing”。","词形结构：maze（迷宫）+ -ful（充满……的）。和“beautiful / useful”里的 -ful 类似，用来表示“充满、具有”。"]}
{"word":"mazegill","summary":{"en":"a bracket fungus with maze-like pores or gill-like ridges underneath","zh":"菌盖下表面呈迷宫状孔纹/褶状脊的木生层孔菌"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of bracket fungus whose underside has maze-like ridges or pores that look like “gills.”","zh":"一种“层孔菌/多孔菌”类的木生菌，菌盖下面的孔或褶呈迷宫状，看起来像“菌褶/鱼鳃”。"},"examples":[{"en":"We found a mazegill growing on a fallen log after the rain.","zh":"雨后我们在一根倒木上发现了迷宫孔菌。"},{"en":"The mazegill’s underside forms winding, maze-like patterns instead of neat, straight gills.","zh":"这种迷宫孔菌的菌盖下表面不是整齐笔直的菌褶，而是蜿蜒的迷宫状纹路。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized in field guides) a common-name group that can refer to several similar fungi, especially in genera such as Daedaleopsis and related polypores.","zh":"（野外图鉴中常首字母大写）一类常见名的统称，可指若干外形相近的真菌，常见于 Daedaleopsis 等属及其近缘的多孔菌。"},"examples":[{"en":"The guidebook lists the thin mazegill as a common species on hardwood.","zh":"图鉴把“薄迷宫孔菌”列为阔叶木上很常见的物种。"},{"en":"Different mazegills can look alike, so checking the pore pattern and the host tree helps.","zh":"不同的迷宫孔菌外观可能很像，因此要看孔纹形状以及它生长的树种来判断。"}]}],"synonyms":["bracket fungus","polypore","Daedaleopsis"],"phonetic":"/ˈmeɪzˌɡɪl/","extraExplanation":["在蘑菇学里，很多“多孔菌”（polypores）并没有真正的“菌褶”（gills），而是孔洞或脊状纹路；“mazegill”就是形容这些孔/脊蜿蜒成迷宫的外观。","不同地区的俗名可能不一致；在鉴定时，最好结合“生长的树种（寄主）”“孔面是否会变色”“菌盖形状与厚薄”等特征，并参考当地图鉴。"],"etymology":"由英语 maze（迷宫）+ gill（鳃；此处借指“菌褶/菌孔的纹理”）构成，因其菌盖下表面呈迷宫状而得名。","mnemonic":["记忆拆分：maze=迷宫，gill=鳃/菌褶 → “像迷宫一样的菌褶/孔面”。","联想：看到下面一圈圈、弯弯绕绕的纹路，就像在“走迷宫”（maze）——这就是 mazegill。"]}
{"word":"mazel","summary":{"en":"Mazel means “good luck,” and it’s most often seen in the congratulatory phrase “mazel tov.”","zh":"mazel 表示“好运/幸运”，最常见于用于祝贺的短语“mazel tov（恭喜/祝贺）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"good luck; a lucky fate (often used in the phrase “mazel tov”)","zh":"好运；幸运（常见于短语“mazel tov”中）"},"examples":[{"en":"She wished him mazel on his new job.","zh":"她祝他新工作好运。"},{"en":"After the graduation ceremony, everyone said “mazel tov.”","zh":"毕业典礼后，大家都说“mazel tov（恭喜／祝贺）”。"}]}],"synonyms":["good luck","luck","fortune"],"phonetic":"/ˈmɑzəl/","extraExplanation":["“mazel”来自意第绪语（Yiddish），而意第绪语是许多阿什肯纳兹犹太社群传统使用的语言。","在英语里单独用“mazel”比较少见，更常见的是“mazel tov”（字面接近“好星运/好运气”，实际常用作“恭喜、祝贺”），多用于婚礼、成人礼（bar/bat mitzvah）、新生儿、毕业等喜庆场合。","相关常见表达：\"mazel tov\"（恭喜/祝贺），\"good luck\"（祝好运），\"congratulations\"（恭喜）。"]}
{"word":"mazelike","summary":{"en":"“Mazelike” describes something maze-like—very winding or complicated and easy to get lost in (literally or figuratively).","zh":"“Mazelike”指“像迷宫一样的”，形容道路/结构曲折复杂，或比喻过程与信息难以理清。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a maze; having many confusing or twisting passages, turns, or details that are hard to follow.","zh":"迷宫般的；曲折复杂、让人难以分辨方向或理清头绪的。"},"examples":[{"en":"The old city has mazelike streets that are easy to get lost in.","zh":"这座老城的街道像迷宫一样，很容易迷路。"},{"en":"The instructions were so mazelike that I had to read them twice.","zh":"说明书复杂得像迷宫一样，我不得不读了两遍。"}]}],"synonyms":["labyrinthine","winding","complex","intricate","confusing"],"phonetic":"/ˈmeɪzlaɪk/","extraExplanation":["“mazelike”由“maze（迷宫）+ -like（像……一样）”构成，常用来形容真实空间（街道、建筑、走廊）或抽象事物（制度、流程、叙事）“结构复杂、难以理清”。","写作中它带有一种“令人困惑、曲折”的画面感，比单说“complex（复杂的）”更强调“绕来绕去、容易迷路”的感觉。","相关近义表达：labyrinthine（更书面，常指“迷宫般复杂”）、byzantine（强调制度/政治/规则“盘根错节、繁琐难懂”，带批评语气）。"]}
{"word":"mazement","summary":{"en":"Amazement means a strong feeling of surprise or wonder.","zh":"Amazement 指强烈的惊讶或惊叹之情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong feeling of surprise or wonder","zh":"惊讶；惊奇；诧异（强烈的意外或惊叹感）"},"examples":[{"en":"She stared at the magician in amazement.","zh":"她惊奇地盯着魔术师看。"},{"en":"To my amazement, the package arrived the next day.","zh":"令我惊讶的是，包裹第二天就到了。"},{"en":"His voice was full of amazement when he heard the news.","zh":"他听到消息时，声音里充满了惊讶。"}]}],"synonyms":["surprise","wonder","astonishment","shock"],"phonetic":"/əˈmeɪzmənt/","extraExplanation":["你输入的“mazement”通常是拼写错误；标准拼写是“amazement”。","词源上来自动词“amaze”（使惊讶/使惊叹）。常见搭配：in amazement（惊讶地）；to one’s amazement（令某人惊讶的是）。"]}
{"word":"mazer","summary":{"en":"A mazer is an old-fashioned wooden drinking bowl/cup, often maple and sometimes decorated with metal.","zh":"mazer 指一种古老的木制饮酒碗/杯，常用枫木制作，有时会镶金属装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wooden drinking bowl or cup (often made from maple and sometimes decorated with metal), used especially in medieval Europe","zh":"（中世纪欧洲常见的）木制饮酒碗/杯（常用枫木制作，有时镶金属装饰）"},"examples":[{"en":"The museum displayed a medieval mazer with a silver rim.","zh":"博物馆展出了一只镶银边的中世纪木酒碗（mazer）。"},{"en":"In old stories, a lord might pass a mazer of ale around the table.","zh":"在古老故事里，领主可能会把一只装着麦酒的木酒碗（mazer）在桌上传递。"}]}],"synonyms":["wooden drinking bowl","drinking bowl","cup (historical)"],"phonetic":"/ˈmeɪzər/","extraExplanation":["“mazer”是古词/历史用语，多见于中世纪英国及欧洲的器物描述。常与“maple（枫木）”有关：早期的mazer常用枫木瘤（木头的瘤状纹理部分）制成，外观纹理漂亮，因此在贵族宴饮场合也很受欢迎。","在文学或历史语境中，常见搭配有“mazer bowl”“silver-rimmed mazer（镶银边的mazer）”。现代日常英语里很少用，更多出现在博物馆说明、历史小说、或中世纪文化介绍中。"]}
{"word":"mazers","summary":{"en":"“Mazers” means wooden drinking bowls/cups (plural), especially in medieval contexts.","zh":"“mazers”指木制饮酒碗/杯的复数，多用于中世纪语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mazer: a wooden (often maple) drinking bowl or cup, sometimes with a metal rim, used especially in medieval Europe.","zh":"mazer 的复数：一种木制（常为枫木）饮酒碗/杯，常配金属杯口，尤见于中世纪欧洲。"},"examples":[{"en":"The museum displayed several mazer bowls, along with old silver-rimmed mazer cups.","zh":"博物馆展出了几只木制饮酒碗/杯（mazers），还有一些带银质杯口的 mazer 杯。"},{"en":"In the story, the guests raised their mazers to toast the new king.","zh":"故事里，宾客们举起木杯（mazers）为新国王祝酒。"}]}],"synonyms":["wooden drinking bowls","wooden cups","drinking vessels"],"phonetic":"/ˈmeɪzərz/","extraExplanation":["“mazer”是较少见的历史词，常出现在中世纪题材的小说、诗歌、历史介绍或博物馆说明中。","词源上常被解释为与“maple（枫木）”有关，因为这类杯子经常用枫木制作。"]}
{"word":"mazes","summary":{"en":"“Mazes” most commonly means more than one maze (a confusing set of paths). It can also be the verb form meaning “confuses.”","zh":"“mazes”最常见是“迷宫”的复数；也可以是动词“maze”的第三人称单数，表示“使困惑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “maze”: a complicated network of paths or passages designed to be confusing.","zh":"“maze”的复数：迷宫；由许多复杂通道/路径组成、让人容易迷路的地方。"},"examples":[{"en":"Many old castles in Europe have hedge mazes in their gardens.","zh":"欧洲许多古老城堡的花园里都有树篱迷宫。"},{"en":"The city’s narrow streets felt like mazes to first-time visitors.","zh":"对第一次来的游客来说，这座城市狭窄的街道像迷宫一样。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “maze”: to confuse someone so they cannot think clearly or find a solution.","zh":"“maze”的第三人称单数：使（某人）困惑；让人理不清头绪或找不到办法。"},"examples":[{"en":"All the new rules mazes me when I try to fill out the form.","zh":"我填写表格时，这些新规定把我弄得一头雾水。"},{"en":"The word puzzle mazes him at first, but he solves it later.","zh":"这个文字谜题一开始让他很困惑，但后来他解开了。"}]}],"synonyms":["labyrinths","puzzles","confuses","bewilders"],"phonetic":"/meɪz/","extraExplanation":["“maze”常指有多条岔路、容易走错的“迷宫”；“labyrinth（迷宫/曲径）”在很多语境里更偏向“单一路径、蜿蜒但不分岔”的结构。不过日常英语里两者也常被混用。"]}
{"word":"mazhabi","summary":{"en":"Mazhabi means “religious/sectarian” in South Asian usage, and it can also refer to a person defined by religion or specifically to the Mazhabi Sikh community.","zh":"Mazhabi在南亚语境中常指“宗教的/教派性的”，也可指以宗教身份界定的人，或特指马扎比锡克（Mazhabi Sikh）社群。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English, from Urdu/Hindi) related to religion or a religious sect; religious, sectarian.","zh":"（南亚英语，源自乌尔都语/印地语）与宗教或教派有关的；宗教的、教派性的。"},"examples":[{"en":"Some leaders tried to avoid mazhabi language in public speeches.","zh":"一些领导人尽量避免在公开演讲中使用带有教派色彩的宗教用语。"},{"en":"The debate became mazhabi instead of political.","zh":"这场争论变得更像宗教/教派之争，而不是政治讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"A person identified mainly by their religion or sect (usage varies by region and can sound sensitive depending on context).","zh":"（用法因地区而异，语感可能较敏感）主要以宗教或教派身份来界定的人。"},"examples":[{"en":"He didn’t want to be seen only as a mazhabi; he wanted to be known for his work.","zh":"他不希望别人只把他看作“某种宗教身份的人”，而是希望因他的工作而被认可。"}]},{"partOfSpeech":"n.","definition":{"en":"In Punjabi/Sikh contexts: a member of the Mazhabi Sikh community (historically a Dalit group within Sikh society).","zh":"在旁遮普/锡克语境中：Mazhabi Sikh（马扎比锡克）社群成员（历史上属于锡克社会中的达利特群体之一）。"},"examples":[{"en":"The village includes families from the Mazhabi Sikh community.","zh":"这个村子里有一些马扎比锡克社群的家庭。"},{"en":"She is researching the history of Mazhabi Sikhs in Punjab.","zh":"她在研究旁遮普地区马扎比锡克群体的历史。"}]}],"synonyms":["religious","sectarian","faith-based","denominational"],"phonetic":"/məˈzɑːbi/","extraExplanation":["“mazhabi”常见于南亚语境，来自“mazhab（宗教/教派）”。在英语里它不算常用词，多出现在新闻、历史、社会研究或南亚侨民的表达中。","在涉及族群、宗教、种姓/社群身份时，这个词可能带有标签化意味；正式写作中常用更中性的说法，如 “religious/sectarian” 或直接点明具体宗教/社群名称。","“Mazhabi Sikh”是一个特定历史与社会背景下的社群称呼；写作或讨论时建议尊重当事人自我认同，并避免把该词当作泛指“宗教人士”的随意称呼。"]}
{"word":"mazic","summary":{"en":"“Mazic” isn’t standard English; it’s usually a misspelling or a made-up spelling (often intended as “magic”).","zh":"“mazic”不是标准英语词，通常是拼写错误或自造拼法（常见本意是“magic”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in most dictionaries; often a misspelling or informal variant of “magic” (or sometimes “mosaic,” depending on context).","zh":"不是大多数英语词典中的标准词；常见于把“magic（魔法/神奇）”误拼（有时也可能想写“mosaic（马赛克/拼接的）”，取决于语境）。"},"examples":[{"en":"I think you meant “magic,” not “mazic.”","zh":"我觉得你想写的是“magic”，不是“mazic”。"},{"en":"If you saw “mazic” in a username or brand name, it may be a made-up spelling.","zh":"如果你在用户名或品牌名里看到“mazic”，那可能是人为造出来的拼法。"}]}],"synonyms":["magic","mosaic"],"phonetic":"ˈmeɪzɪk","extraExplanation":["“Mazic”可能出现的几种情况：\n1）拼写错误：最常见是把“magic”误写成“mazic”。\n2）专有名词：可能是姓氏、用户名、品牌名或游戏/小说中的自造词。\n3）近形词混淆：若语境与图案/拼接有关，也可能原本想写“mosaic”。\n\n如果你能提供一句包含“mazic”的原句或来源（书、游戏、网页等），我可以帮你更准确判断意思。"]}
{"word":"mazier","summary":{"en":"“Mazier” means “more maze-like”: more winding, complex, or confusing.","zh":"“Mazier”表示“更像迷宫一样”：更曲折、更复杂或更令人迷惑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more confusing or complicated; having more twists and turns (like a maze)","zh":"更曲折复杂的；更让人迷惑的（像迷宫一样）"},"examples":[{"en":"The plot gets mazier in the final chapters, and I had to reread a few pages.","zh":"最后几章情节变得更曲折复杂，我不得不重读几页。"},{"en":"The old city’s streets are even mazier at night.","zh":"这座老城的街巷到了夜里更像迷宫一样难辨方向。"}]}],"synonyms":["more confusing","more complex","more labyrinthine","more winding","more intricate"],"phonetic":"/ˈmeɪziɚ/","extraExplanation":["“mazier”是形容词“mazy”的比较级；“mazy”来自“maze（迷宫）”，常用来形容故事、道路、思路等“像迷宫一样”曲折、难懂。","用法小提示：常见搭配有 mazy streets（迷宫般的街道）、mazy plot（曲折的情节）、mazy thoughts（纷乱难理的思绪）。","文学语感：在描写梦境、森林小径、或人物复杂心理时，“mazy/mazier”带有一种诗意、朦胧而缠绕的感觉。"]}
{"word":"maziest","summary":{"en":"“Maziest” means “the most maze-like or confusing.”","zh":"“maziest”意为“最像迷宫的；最令人迷惑难理清的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “mazy”: the most like a maze—full of twists and turns; confusing or hard to follow.","zh":"“mazy”的最高级：最像迷宫的——曲折蜿蜒、难以辨认；（思路/叙述）最让人迷惑、难以理清的。"},"examples":[{"en":"This is the maziest old neighborhood I’ve ever walked through—every alley turns into another alley.","zh":"这是我走过最“迷宫般”的老街区——每条小巷拐进去又是另一条小巷。"},{"en":"The maziest part of the novel is the middle, where the timeline keeps jumping around.","zh":"这本小说最让人迷惑的部分在中段，时间线一直跳来跳去。"}]}],"synonyms":["most labyrinthine","most winding","most confusing","most puzzling"],"phonetic":"/ˈmeɪziəst/","extraExplanation":["“maziest”来自形容词“mazy”（像迷宫的、令人迷惑的），而“mazy”与名词“maze”（迷宫）同源。它比单纯说“complicated”更带有“曲折、绕来绕去”的画面感。","用法提示：多用于描述道路/花园/街区的布局（字面“像迷宫”），也可描述故事情节、解释、思路（比喻“让人绕晕”）。"]}
{"word":"mazily","summary":{"en":"“Mazily” means in a winding, maze-like way, or in a confusing, hard-to-follow way.","zh":"“Mazily”表示“蜿蜒如迷宫地”，也可表示“令人困惑、难以理清地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a winding, twisting, maze-like way.","zh":"以蜿蜒曲折、像迷宫一样的方式。"},"examples":[{"en":"A narrow path ran mazily through the forest.","zh":"一条狭窄的小路在森林里蜿蜒曲折地延伸。"},{"en":"The river flowed mazily between the hills.","zh":"河流在群山之间曲折地流淌。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a confusing or hard-to-follow way; bewilderingly.","zh":"以令人困惑、难以理清的方式；使人迷惘地。"},"examples":[{"en":"The story moves mazily from one memory to another.","zh":"故事在一个回忆与另一个回忆之间令人迷惑地跳转。"},{"en":"He explained the rules mazily, so I had to ask again.","zh":"他把规则讲得很混乱，所以我不得不再问一遍。"}]}],"synonyms":["windingly","twistingly","tortuously","confusingly","bewilderingly"],"phonetic":"/ˈmeɪzəli/","extraExplanation":["“mazily”来自形容词“mazy”（迷宫般的、曲折的）+ 副词后缀“-ly”。它带一点文学色彩，更常见于描写风景、道路、河流或叙事结构的“曲折/迷离”。日常口语里表达“让人困惑”，更常用“confusingly / in a confusing way”。"]}
{"word":"maziness","summary":{"en":"Maziness means confusion/bewilderment, or a maze-like complexity that’s hard to navigate.","zh":"Maziness 指“困惑/迷惘”，也可指“像迷宫般的复杂难懂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of confusion or bewilderment; mental puzzlement, as if you were lost in a maze","zh":"困惑、迷惘的状态；头脑一团乱，好像迷路在迷宫里"},"examples":[{"en":"After hearing the new rules, I was left in a complete maziness.","zh":"听完新规定后，我彻底陷入困惑。"},{"en":"The story’s sudden ending adds a feeling of maziness for the reader.","zh":"故事突然的结尾让读者产生一种迷惘感。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being maze-like (complicated, twisting, hard to follow)","zh":"像迷宫一样的特质（曲折复杂、难以理清）"},"examples":[{"en":"The maziness of the old city streets makes it easy to get lost.","zh":"老城街道的迷宫般复杂让人很容易迷路。"},{"en":"I dislike the maziness of this software menu—it’s hard to find anything.","zh":"我不喜欢这个软件菜单的复杂绕人——很难找到东西。"}]}],"synonyms":["confusion","bewilderment","puzzlement","complexity","labyrinthine quality"],"phonetic":"ˈmeɪzinəs","extraExplanation":["“maziness”并不是非常常见的标准词汇，更多时候人们会用更常用的词来表达同样意思，例如 confusion（困惑）、bewilderment（迷惘）、complexity（复杂）等。它通常被理解为由“maze（迷宫）+ -ness（……的状态/性质）”构成。"]}
{"word":"mazinesses","summary":{"en":"Mazinesses means multiple instances or aspects of maze-like confusion or complexity.","zh":"Mazinesses 指“迷宫般的困惑或复杂性”的多种表现/多个方面（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being confusing, winding, or maze-like; bewildering complexity (plural form).","zh":"迷宫般、曲折难懂或令人困惑的状态；复杂得让人迷失（复数形式）。"},"examples":[{"en":"The novel’s mazinesses can make new readers lose track of who is speaking.","zh":"这部小说的种种“迷离复杂”会让新读者搞不清是谁在说话。"},{"en":"The old city’s mazinesses—narrow alleys and sudden turns—were charming but hard to navigate.","zh":"老城的“曲折如迷宫”——狭窄的巷子和突然的转弯——很迷人，但很难走。"}]},{"partOfSpeech":"n.","definition":{"en":"complex or rambling twists and turns in a route, story, or argument (plural).","zh":"路线、叙事或论证中盘根错节、绕来绕去的曲折之处（复数）。"},"examples":[{"en":"Skip the mazinesses and tell me the main point.","zh":"别绕来绕去，直接告诉我重点。"},{"en":"The lecture had interesting ideas, but its mazinesses made the conclusion unclear.","zh":"这场讲座观点很有趣，但讲得太曲折，结论不清楚。"}]}],"synonyms":["confusions","complexities","intricacies","twists and turns","bewilderments"],"phonetic":"/ˈmeɪzinəsɪz/","extraExplanation":["“mazinesses”来自较少见的名词“maziness”（迷离复杂），其形容词形式是“mazy”，意思是“像迷宫一样曲折/让人迷惑”。这个词带一点文学或描写性风格，日常英语更常用 confusion、complexity、twists and turns、maze-like complexity 等表达。"]}
{"word":"mazing","summary":{"en":"“Mazing” is a rare word meaning “bewildering/confusing,” related to “maze.” In everyday English, people usually mean “amazing.”","zh":"“mazing”很少见，意思接近“令人困惑的/使人迷失的”，与“maze（迷宫）”有关。日常英语里多数人其实想写的是“amazing（惊人的、很棒的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"bewildering; confusing (rare, literary/old-fashioned).","zh":"令人困惑的；使人迷惘的（少见，偏文学/旧式用法）。"},"examples":[{"en":"The mazing streets of the old town made it easy to get lost.","zh":"老城里迷宫般又令人迷惑的街道，很容易让人走失。"},{"en":"She felt a mazing mix of fear and excitement.","zh":"她感到一种令人迷惘的恐惧与兴奋交织在一起。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “maze”: to confuse or bewilder; to make someone feel lost (rare).","zh":"“maze”的现在分词：使困惑；使迷失方向（少见）。"},"examples":[{"en":"The complicated rules were mazing the new players.","zh":"复杂的规则把新玩家弄得一头雾水。"}]}],"synonyms":["bewildering","confusing","perplexing","disorienting"],"phonetic":"/ˈmeɪzɪŋ/","extraExplanation":["“mazing”在现代英语中非常少见，更多时候人们写的是“amazing”（惊人的、很棒的）。如果你想表达“太棒了/令人惊叹”，通常用“amazing”。","“mazing”与“maze（迷宫）”相关，带有“像迷宫一样让人迷失/困惑”的感觉，因此更偏文学描写。"]}
{"word":"mazocacothesis","summary":{"en":"Not a recognized English word; likely a misspelling or a very rare proper/technical term.","zh":"不是可识别的英语单词；可能是拼写错误或极少见的专有/技术用语。"},"extraExplanation":["“mazocacothesis”不是常见英语单词，也不见于主流词典（可能是拼写错误、非常罕见的术语，或是专有名词/人名/品牌）。","你可以检查是否想写：\n- **masochist / masochism**（受虐者 / 受虐倾向）\n- **cache / cacophony / hypothesis**（缓存 / 刺耳噪音 / 假设）等类似拼写片段\n把原句（它出现的上下文）发给我，我可以根据句子帮你推断最可能的正确单词并给出详细释义。"]}
{"word":"mazodynia","summary":{"en":"Mastodynia (sometimes written as mazodynia) means breast pain.","zh":"Mastodynia（有时写作 mazodynia）指“乳房疼痛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Breast pain; pain or tenderness in the breast.","zh":"（医学）乳房痛；乳房疼痛或压痛。"},"examples":[{"en":"She saw a doctor because of persistent mastodynia.","zh":"她因为持续的乳房痛去看了医生。"},{"en":"Mastodynia can be related to hormonal changes during the menstrual cycle.","zh":"乳房痛可能与月经周期中的激素变化有关。"}]}],"synonyms":["mastodynia","mastalgia","breast pain"],"phonetic":"/ˌmæs.təˈdaɪ.ni.ə/","extraExplanation":["“mazodynia”在现代英语医学文献中非常少见，更多见、也更标准的写法是 **mastodynia**（也常说 **mastalgia**）。如果你是在报告、处方或论文里看到“mazodynia”，它可能是拼写变体或误拼。","词源上：**masto-**（乳房）+ **-dynia**（疼痛）。通常用于临床描述症状，不是日常口语。日常表达更常用 “breast pain”。"]}
{"word":"mazolysis","summary":{"en":"“Mazolysis” isn’t a standard English word; it’s likely a misspelling or rare technical term that needs context.","zh":"“mazolysis”不是常见标准英语词，更可能是拼写错误或罕见术语，需要语境才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard or widely recognized English word. It may be a misspelling or a very rare technical term, so a reliable dictionary definition is unclear without more context (field, sentence, or source).","zh":"这不是一个常见或标准的英语单词；可能是拼写错误或极少见的专业术语。缺少语境（学科、原句或出处）时，很难给出可靠释义。"},"examples":[{"en":"I couldn’t find a dictionary entry for “mazolysis”; could you share the sentence where you saw it?","zh":"我在词典里找不到“mazolysis”的词条；你能把你看到它的句子发我吗？"},{"en":"It may be a typo—did you mean “myolysis” or “mesolysis”?","zh":"它可能是拼写错误——你想写的是“myolysis”还是“mesolysis”？"}]}],"phonetic":"/mæˈzɑlɪsɪs/","extraExplanation":["“mazolysis”很可能是把别的词拼错了。常见的相近专业词包括：","myolysis（肌溶解/肌肉组织分解，医学）；mesolysis（常见于皮肤科/指甲相关语境，指甲板与甲床分离或剥离的一种现象，较专业）。","如果你能提供出处（例如医学报告、论文段落、课本截图），我可以按该领域给出准确释义、用法和相关词汇。"]}
{"word":"mazolytic","summary":{"en":"“Mazolytic” is not recognized as a standard English word; it is likely a misspelling (often of “mucolytic”).","zh":"“Mazolytic”不是标准英语词；很可能是拼写错误（常见为“mucolytic”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “mucolytic” (a medicine that breaks down mucus) or another similar-looking scientific term.","zh":"不是标准英语单词；很可能是对“mucolytic（化痰的；溶解黏液的）”或其他相似科学术语的拼写错误。"},"examples":[{"en":"I couldn’t find “mazolytic” in major dictionaries—did you mean “mucolytic”?","zh":"我在主要词典里找不到“mazolytic”——你是不是想写“mucolytic”？"},{"en":"If you meant a drug that breaks up mucus, the correct term is “mucolytic agent.”","zh":"如果你指的是“分解黏液的药物”，正确说法是“mucolytic agent（化痰剂/黏液溶解剂）”。"}]}],"synonyms":["(likely intended) mucolytic"],"phonetic":"ˌmæzəˈlɪtɪk","extraExplanation":["“mucolytic”常见于医学语境（如说明书、医嘱），意思是“分解/稀释呼吸道黏液，帮助咳出痰”。常见搭配：mucolytic drug/agent（化痰药/黏液溶解剂）。","如果你能提供这个词出现的句子或领域（医学、化学、生物等），我可以更准确判断它是否是某个非常专业的术语或专有名词。"]}
{"word":"mazopathia","summary":{"en":"A rare medical term meaning a disease or disorder of the breast.","zh":"一个罕见的医学术语，指乳房的疾病或病变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) A disease or disorder of the breast; mastopathy.","zh":"（医学，罕用）乳房疾病或乳房的病变；同“mastopathy（乳房病）”。"},"examples":[{"en":"The report mentioned mazopathia, but most modern texts use the term mastopathy.","zh":"报告里提到“mazopathia”，但大多数现代文献更常用“mastopathy（乳房病）”这个术语。"},{"en":"She was referred to a specialist to evaluate possible mazopathia after persistent breast pain.","zh":"由于乳房持续疼痛，她被转诊给专科医生评估是否存在乳房病变（mazopathia）。"}]}],"synonyms":["mastopathy","breast disease","breast disorder"],"phonetic":"/ˌmæzoʊˈpeɪθiə/","extraExplanation":["这个词非常少见，多见于旧式或专门的医学用语。词源可拆为希腊语词根 *mazo-*（乳房）+ *-pathia*（疾病/病态），字面意思就是“乳房的病”。在现代英语医学写作中，更常见的表达是 **breast disease**（乳房疾病）或 **mastopathy**。"]}
{"word":"mazopathic","summary":{"en":"A rare medical adjective meaning “related to diseases of the breast.”","zh":"一个较罕见的医学形容词，意为“与乳房疾病/病变有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to disease or disorders of the breast (especially the mammary gland).","zh":"与乳房（尤其是乳腺）的疾病或病变有关的。"},"examples":[{"en":"The doctor documented several mazopathic symptoms, including breast pain and swelling.","zh":"医生记录了几种与乳房病变相关的症状，包括乳房疼痛和肿胀。"},{"en":"This is a highly specialized term, mostly seen in older medical writing about mazopathic conditions.","zh":"这是一个非常专业的词，多见于较早的医学文献中，用来描述与乳房病变相关的情况。"}]}],"synonyms":["mammary","breast-related","mastopathic (rare)"],"phonetic":"/ˌmæzoʊˈpæθɪk/","extraExplanation":["该词非常罕见，通常出现在较旧或非常专业的医学语境中。日常英语里更常用的是 breast-related（与乳房相关的）、mammary（乳腺的）或与具体疾病对应的词（如 mastitis 乳腺炎）。","词根提示：mazo- 源自希腊语，意为“乳房”；-pathic 来自 path-，表示“疾病/病变”。因此 mazopathic 字面含义就是“乳房病变的/与乳房疾病有关的”。"]}
{"word":"mazopathy","summary":{"en":"Mazopathy means a disease or disorder of the breast; it’s a rare technical term.","zh":"mazopathy 指“乳房疾病/乳房病变”，属于较少见的专业术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disease or disorder of the breast; breast disease (a rare/technical term).","zh":"乳房疾病；乳房病变（较少见的专业用语）。"},"examples":[{"en":"The doctor noted signs of mazopathy and recommended further imaging.","zh":"医生记录了乳房病变的迹象，并建议做进一步影像检查。"},{"en":"In modern medical writing, “mastopathy” is more common than “mazopathy.”","zh":"在现代医学写作中，“mastopathy（乳房病）”比“mazopathy”更常见。"}]}],"synonyms":["mastopathy","breast disease","benign breast disease"],"phonetic":"/ˌmæzoʊˈpæθəpi/","extraExplanation":["词源提示：mazo- 源自希腊语，意为“乳房”，-pathy 意为“疾病/病变”。因此 mazopathy 字面就是“乳房的病”。","使用场景：该词在当代英语医学文献中较少见，临床或科普语境更常用 mastopathy、breast disease、benign breast disease 等表达。"]}
{"word":"mazopexy","summary":{"en":"Mazopexy is a medical term for breast-lift surgery (more commonly called mastopexy).","zh":"Mazopexy 是指乳房提升/固定的外科手术（更常见的说法是 mastopexy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure to lift or fix the breast in a higher position (breast-lift surgery).","zh":"一种将乳房提升或固定到更高位置的外科手术（乳房提升术）。"},"examples":[{"en":"She asked her surgeon whether a mazopexy would help with breast sagging after weight loss.","zh":"她询问外科医生：体重下降后乳房下垂，做 maz​​opexy 是否能改善。"},{"en":"The doctor explained that mazopexy reshapes and lifts the breast but does not necessarily increase its size.","zh":"医生解释说，mazopexy 主要是重塑并提升乳房，但不一定会增大罩杯。"}]}],"synonyms":["mastopexy","breast lift"],"phonetic":"/ˈmæzoʊˌpɛksi/","extraExplanation":["“mazopexy”较少见，更常用的标准医学术语是 **mastopexy**（乳房提升术）。词根来自希腊语：**mazos**（乳房）+ **-pexy**（外科固定、缝合固定）。","在英文医学语境中，**-pexy** 也常见于其他“固定术”词汇里，例如：**gastropexy**（胃固定术）、**orchiopexy**（睾丸固定术）。"]}
{"word":"mazourka","summary":{"en":"A mazurka is a Polish triple-time dance, or a piece of music in that dance style.","zh":"mazurka 指波兰的三拍子民间舞蹈，也指这种风格的舞曲/乐曲（常见于肖邦作品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Polish folk dance in triple time (3/4), often with a strong accent on the second or third beat; also a piece of music written in that style","zh":"马祖卡舞：一种波兰民间舞蹈，三拍子（3/4），常把重音放在第二或第三拍；也指这种风格的舞曲/乐曲"},"examples":[{"en":"The pianist played a Chopin mazurka as an encore.","zh":"钢琴家加演了一首肖邦的马祖卡舞曲。"},{"en":"We learned a simple mazurka step in dance class.","zh":"我们在舞蹈课上学了一个简单的马祖卡舞步。"},{"en":"The music sounded like a mazurka, with a strong off-beat accent.","zh":"这段音乐听起来像马祖卡，带有明显的非第一拍重音。"}]}],"synonyms":["Polish folk dance","dance tune"],"phonetic":"/məˈzɝːkə/","extraExplanation":["“mazourka”常见为“mazurka”的拼写变体或误拼；英语中更标准、最常用的拼写是“mazurka”。","马祖卡源自波兰马佐夫舍（Mazovia）地区的民间舞蹈传统；在古典音乐里，肖邦（Chopin）的《马祖卡》最有名。","节拍通常是3/4，但风格特点在于重音常落在第二或第三拍，让音乐听起来有“摇摆/跳跃”的感觉。"]}
{"word":"mazourkas","summary":{"en":"Mazurka (plural: mazurkas) is a Polish dance in triple time and the music written for it.","zh":"Mazurka（复数 mazurkas）是波兰三拍舞蹈，也指为其创作的音乐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Polish folk dance in triple time, and also the music written for this dance (often for piano).","zh":"一种波兰的三拍民间舞（也指为这种舞写的音乐，常见于钢琴曲）。"},"examples":[{"en":"Chopin wrote many mazurkas for solo piano.","zh":"肖邦写了许多钢琴独奏的玛祖卡舞曲。"},{"en":"The band played a mazurka, and couples began to dance in a quick triple rhythm.","zh":"乐队演奏起玛祖卡，人们就跟着轻快的三拍节奏起舞。"}]},{"partOfSpeech":"other","definition":{"en":"plural form: mazurkas (note: “mazourkas” is a common misspelling).","zh":"复数形式：mazurkas（注意：“mazourkas”是常见的拼写错误）。"},"examples":[{"en":"Her recital included two mazurkas and a nocturne.","zh":"她的独奏会曲目包括两首玛祖卡和一首夜曲。"}]}],"synonyms":["Polish folk dance","dance tune"],"phonetic":"/məˈzɝkə/","extraExplanation":["“mazurka”源自波兰语，和波兰的马佐夫舍（Mazovia）地区有关，因此带有鲜明的波兰民间色彩。","在西方古典音乐中，最有名的是肖邦（Chopin）的《玛祖卡》系列：它们不只是“舞曲伴奏”，也常被当作具有民族风格与个人情感的小型钢琴作品来演奏。"]}
{"word":"mazovian","summary":{"en":"Mazovian means “from or related to Mazovia,” a region in central Poland; it can also mean a person from there.","zh":"Mazovian 表示“来自或与马佐维亚（波兰中部）有关”，也可指“马佐维亚人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mazovia (Mazowsze), a historical and cultural region in central Poland, including the area around Warsaw.","zh":"（与）马佐维亚（Mazovia / Mazowsze）有关的；马佐维亚地区的（波兰中部历史与文化区域，含华沙周边）。"},"examples":[{"en":"Warsaw lies in the Mazovian region of Poland.","zh":"华沙位于波兰的马佐维亚地区。"},{"en":"We tried Mazovian dishes at a small restaurant outside Warsaw.","zh":"我们在华沙郊外的一家小餐馆尝了马佐维亚风味的菜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mazovia.","zh":"马佐维亚人；来自马佐维亚地区的人。"},"examples":[{"en":"Many Mazovians moved to the capital for work.","zh":"许多马佐维亚人为了工作搬到首都。"}]}],"synonyms":["Masovian"],"phonetic":"/məˈzoʊviən/","extraExplanation":["在现代行政区划中，你也会看到“Masovian / Mazovian Voivodeship（马佐维亚省）”这类写法；“Mazovian”和“Masovian”都常见，属于不同的英文拼写习惯。","词源上来自拉丁化/英语化的地名“Mazovia（波兰语：Mazowsze）”。在英语语境里，它多用于地理、历史、文化（如饮食、民俗、方言）相关的描述。"]}
{"word":"mazuca","summary":{"en":"“Mazuca” isn’t a standard English word; it most often appears as a misspelling of “mazurka,” a Polish dance and musical form.","zh":"“Mazuca”不是标准英语词；最常见情况是把“mazurka（玛祖卡舞/舞曲）”误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard English) A spelling that is likely a misspelling or variant of “mazurka,” a lively Polish folk dance (and the music for it), usually in triple time.","zh":"（非标准英语）常见于把“mazurka（玛祖卡舞/玛祖卡舞曲）”拼错或变体写法；指一种波兰民间舞（及其舞曲），通常为三拍子。"},"examples":[{"en":"I couldn’t find “mazuca” in an English dictionary—did you mean “mazurka”?","zh":"我在英语词典里找不到“mazuca”——你是不是想写“mazurka”？"},{"en":"The pianist played a mazurka by Chopin.","zh":"钢琴家演奏了一首肖邦的玛祖卡舞曲。"}]}],"synonyms":["mazurka"],"phonetic":"/məˈzɝːkə/","extraExplanation":["“Mazurka（mazurka）”与波兰文化联系很深，19世纪作曲家肖邦（Chopin）写了大量玛祖卡舞曲，因此在音乐语境中非常常见。","如果你是在特定地区、品牌、网名或方言里看到“mazuca”，可以告诉我出现的句子/语境，我可以更准确判断它是不是专有名词或地方用法。"]}
{"word":"mazuma","summary":{"en":"Mazuma is slang for money, especially cash.","zh":"Mazuma 是“钱”的俚语说法，尤指现金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) Money, especially cash.","zh":"（俚语）钱；（尤指）现金。"},"examples":[{"en":"I don’t have enough mazuma to buy a new phone right now.","zh":"我现在没有足够的钱买新手机。"},{"en":"He made some quick mazuma doing weekend delivery work.","zh":"他靠周末送货的工作很快赚了一些钱。"},{"en":"Bring some mazuma if you want snacks at the game.","zh":"如果你想在比赛时买零食，就带点现金。"}]}],"synonyms":["money","cash","dough","bucks"],"phonetic":"/məˈzuːmə/","extraExplanation":["“mazuma”常见于较老派的美式口语与幽默表达，语气轻松、带一点俏皮感；在正式写作中不常用。","词源通常被认为来自意第绪语（Yiddish）/希伯来语相关词，和“现金、现款（ready cash）”的概念有关，因此它常暗示“手头能立刻拿出来用的钱”。"]}
{"word":"mazumas","summary":{"en":"Mazuma(s) is an old-fashioned slang word meaning “money.”","zh":"Mazuma(s) 是较旧式的俚语，意思是“钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money (informal, old-fashioned slang).","zh":"钱；金钱（非正式、略带旧式的俚语）。"},"examples":[{"en":"I’m a bit short of mazuma right now.","zh":"我现在有点缺钱。"},{"en":"He spent all his mazumas on a new guitar.","zh":"他把所有的钱都花在一把新吉他上了。"}]}],"synonyms":["money","cash","bucks","dough (slang)"],"phonetic":"/məˈzuːmə/","extraExplanation":["“mazuma”多见于英美较老派的口语或幽默语气中，现代日常更常说 money、cash、bucks。","词源通常认为与意第绪语（Yiddish）有关，后来进入20世纪初的美式俚语；“mazumas”常被当作复数，用来强调“钱很多/零散的钱”。"]}
{"word":"mazur","summary":{"en":"Mazur is most often a Polish surname; it can also mean a person from Masuria (Mazury) or, less commonly in English, a Polish folk dance related to the mazurka.","zh":"Mazur最常见是波兰姓氏；也可指来自波兰马祖里亚（Mazury）地区的人，或在较少见的情况下指一种与玛祖卡相关的波兰民间舞。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A surname, especially common in Poland and among people of Polish heritage.\nExamples: EN: Dr. Mazur will speak at the conference. / ZH: 马祖尔博士将在会议上发言。","zh":"（专有名词）姓氏，尤其常见于波兰及波兰裔人群中。\n例句：EN: Dr. Mazur will speak at the conference. / ZH: 马祖尔博士将在会议上发言。"},"examples":[{"en":"Dr. Mazur will speak at the conference.","zh":"马祖尔博士将在会议上发言。"},{"en":"I met Ms. Mazur through a friend from Warsaw.","zh":"我通过一位来自华沙的朋友认识了马祖尔女士。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) A person from Masuria (Polish: Mazury), a lake region in northeastern Poland; also meaning “Masurian.”\nExamples: EN: His grandparents were Mazurs from northeastern Poland. / ZH: 他的祖父母是来自波兰东北部马祖里地区的马祖尔人。","zh":"（名词）来自马祖里亚（Masuria，波兰语：Mazury，位于波兰东北部的湖区）的人；也可指“马祖里亚人/马祖里亚的”。\n例句：EN: His grandparents were Mazurs from northeastern Poland. / ZH: 他的祖父母是来自波兰东北部马祖里地区的马祖尔人。"},"examples":[{"en":"His grandparents were Mazurs from northeastern Poland.","zh":"他的祖父母是来自波兰东北部马祖里地区的马祖尔人。"},{"en":"Mazur traditions are sometimes discussed in Polish regional history.","zh":"在波兰地方史中有时会讨论马祖尔人的传统。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, less common in English) A Polish folk dance related to the mazurka (Polish: mazur).\nExamples: EN: The program included a mazur and a polonaise. / ZH: 节目包括一段马祖尔舞和一段波罗乃兹舞。","zh":"（名词，英语中较少见）一种与“玛祖卡舞（mazurka）”相关的波兰民间舞（波兰语：mazur）。\n例句：EN: The program included a mazur and a polonaise. / ZH: 节目包括一段马祖尔舞和一段波罗乃兹舞。"},"examples":[{"en":"The program included a mazur and a polonaise.","zh":"节目包括一段马祖尔舞和一段波罗乃兹舞。"},{"en":"Some writers use “mazur” when talking about older Polish dance styles.","zh":"有些作者在谈论较早的波兰舞蹈风格时会用“mazur”。"}]}],"synonyms":["Mazurian","mazurka"],"phonetic":"/məˈzʊr/","extraExplanation":["“Mazur”在英语里最常见是姓氏；若出现在历史、民族或地理语境中，常与波兰东北部的马祖里亚（Masuria/Mazury）有关。","与音乐/舞蹈相关时，“mazur”是波兰语词，和“mazurka（玛祖卡）”同源；在谈肖邦等作曲家受波兰舞曲影响时偶尔会见到。"]}
{"word":"Mazurian","summary":{"en":"connected with Poland’s Mazury region; also its people or dialect.","zh":"与波兰马祖里地区有关；也指当地人或方言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mazury (the Masurian Lake District), a region in northeastern Poland, or to its people or culture.","zh":"（形容词）与波兰东北部马祖里（马祖里湖区）地区，或其人民与文化有关的。"},"examples":[{"en":"We took a trip through the Mazurian Lake District in summer.","zh":"我们夏天去了马祖里湖区旅行。"},{"en":"The museum has a small collection of Mazurian folk art.","zh":"博物馆里有一小部分马祖里民间艺术藏品。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Mazury, or someone of Mazurian heritage.","zh":"（名词）马祖里人；来自马祖里地区的人（或具有该地区血统的人）。"},"examples":[{"en":"Her grandfather was a Mazurian who moved to the city after the war.","zh":"她的祖父是马祖里人，战后搬到了城市。"},{"en":"Many Mazurians kept local traditions alive through songs and festivals.","zh":"许多马祖里人通过歌曲和节庆延续当地传统。"}]},{"partOfSpeech":"n.","definition":{"en":"The traditional dialect(s) historically spoken by Mazurians (often treated as a variety closely related to Polish, and sometimes discussed in relation to regional German influence).","zh":"（名词）马祖里方言（历史上马祖里人所说的方言；常被视为与波兰语密切相关的变体，也常在研究中提到其与德语的区域接触影响）。"},"examples":[{"en":"He studies Mazurian to understand language contact in the region.","zh":"他研究马祖里方言，以了解该地区的语言接触现象。"},{"en":"Some older speakers still remember words from Mazurian used at home.","zh":"一些年长者仍记得家里用过的马祖里方言词汇。"}]}],"synonyms":["Masurian"],"phonetic":"/məˈzʊriən/","extraExplanation":["Mazurian 常用于地理与文化语境（如“马祖里湖区”）；在语言学语境中也可指当地传统方言。不同资料对“是否算独立语言”表述不一，日常学习中可理解为“该地区的方言/地方话”。"],"etymology":"来自地区名 Mazury（马祖里）+ 英语形容词/名词后缀 -an，表示“……地区的/……人”。该词也常见拼写变体 Masurian，源于不同语言与转写传统。","mnemonic":["把 -an 记成“某地的人/某地的”：Mazury + -an → “马祖里（Mazury）的”。","联想“湖区旅行”：看到 Mazurian 就想到 “Mazurian Lakes（马祖里湖区）”。"]}
{"word":"mazurian","summary":{"en":"Mazurian means “from Mazuria (Masuria) in northeastern Poland,” and can also refer to a Mazurian person or the Mazurian dialect/language.","zh":"Mazurian 指“来自波兰东北部马祖里（马苏里亚）地区的”，也可指马祖里人或马祖里语/方言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mazuria (Masuria), a lake region in northeastern Poland, or to its people and culture","zh":"与波兰东北部的马祖里（马苏里亚）地区有关的；或与当地人、文化有关的"},"examples":[{"en":"We traveled through the Mazurian Lake District in summer.","zh":"我们夏天游览了马祖里湖区。"},{"en":"Mazurian folk songs are often performed at local festivals.","zh":"马祖里民歌常在当地节庆中演出。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mazuria (Masuria), especially someone with Mazurian cultural roots","zh":"马祖里人；来自马祖里（马苏里亚）地区的人（尤指具有马祖里文化背景的人）"},"examples":[{"en":"Her grandparents were Mazurians who grew up near the lakes.","zh":"她的祖父母是马祖里人，在湖区附近长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mazurian language/dialect, a variety historically spoken in the Mazuria region (often treated as a dialect related to Polish)","zh":"马祖里语（或方言）；历史上在马祖里地区使用的一种语言变体（常被视为与波兰语相关的方言）"},"examples":[{"en":"A few elders still remember some Mazurian words and songs.","zh":"少数老人仍记得一些马祖里语词汇和歌曲。"}]}],"synonyms":["Masurian"],"phonetic":"/məˈzʊriən/","extraExplanation":["“Mazurian”也常拼作“Masurian”，指同一地区与文化；英文中两种拼法都可见，旅游与地理语境里常出现“Masurian (Mazurian) Lake District”（马苏里亚/马祖里湖区）。","该词来自当地族称“Mazur”。历史上该地区经历过复杂的政治与语言接触（如德语与波兰语影响），因此关于“马祖里语”是“独立语言”还是“波兰语方言”的分类，在不同资料与语境中可能有所差异。"]}
{"word":"mazurka","summary":{"en":"A Polish dance—and also music written in that dance style, often heard in Chopin’s piano works.","zh":"一种波兰舞蹈；也指采用这种舞蹈风格写成的舞曲（肖邦的钢琴作品中很常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively Polish folk dance in triple time (3/4), often with accents on the second or third beat.","zh":"玛祖卡舞：一种波兰民间舞蹈，通常为三拍子（3/4），重音常落在第二或第三拍。"},"examples":[{"en":"We learned a simple mazurka step in dance class.","zh":"我们在舞蹈课上学了一个简单的玛祖卡舞步。"},{"en":"The rhythm of a mazurka feels different from a waltz because of its shifting accents.","zh":"玛祖卡的节奏感和华尔兹不同，因为它的重音会变化。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of music written in the style/rhythm of a mazurka, especially for piano.","zh":"玛祖卡舞曲：采用玛祖卡节奏/风格写成的音乐作品，尤其常见于钢琴曲。"},"examples":[{"en":"She played a Chopin mazurka at the recital.","zh":"她在演奏会上弹了一首肖邦的玛祖卡舞曲。"},{"en":"This mazurka has a bright, folk-like melody.","zh":"这首玛祖卡舞曲旋律明亮，很有民间风格。"}]}],"synonyms":["Polish folk dance","dance tune","piano miniature"],"phonetic":"məˈzɝkə","extraExplanation":["“Mazurka”源自波兰语，和波兰的马佐夫舍（Mazovia）地区有关；因此它不仅是舞蹈名，也代表一种带有波兰乡土气息的音乐风格。","在古典音乐里，肖邦（Chopin）的《玛祖卡》最著名：他把民间舞曲的节奏与情绪（如轻快、怀乡、含蓄的悲喜交织）发展成精致的钢琴小品。"]}
{"word":"mazurkas","summary":{"en":"Mazurkas are Polish triple-time dances and the music written in that style, famously used by Chopin.","zh":"Mazurkas 指波兰的三拍子舞曲及其风格的乐曲，最著名的例子是肖邦的《玛祖卡》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lively Polish folk dance in triple time (3/4), often with accents on the second or third beat; also, a piece of music written in this style.","zh":"玛祖卡舞（波兰民间舞，三拍子3/4，常在第二或第三拍重音）；也指这种风格的乐曲。"},"examples":[{"en":"We learned a mazurka in dance class, stepping lightly on the off-beats.","zh":"我们在舞蹈课上学了一支玛祖卡舞，脚步轻快，重音落在非强拍上。"},{"en":"Chopin’s mazurkas are short piano pieces inspired by Polish folk rhythms.","zh":"肖邦的《玛祖卡》是一组受波兰民间节奏启发的短小钢琴作品。"}]}],"synonyms":["Polish folk dance","dance in triple time","mazurka (singular)"],"phonetic":"/məˈzɝːkəz/","extraExplanation":["“Mazurka”来自波兰语 *mazurek*，与波兰中部的马佐夫舍（Mazovia）地区有关。许多人最熟悉的“mazurka”来自肖邦（Chopin）的钢琴作品：他把民间舞曲的节奏与艺术音乐的和声、情感表达结合在一起。","复数形式是 *mazurkas*。英语中也可写作 *mazurkas* 来泛指多首此类作品（如“Chopin’s mazurkas”）。"]}
{"word":"mazut","summary":{"en":"Mazut is a heavy residual fuel oil used mainly for industrial heating and power generation.","zh":"Mazut 指主要用于工业供热和发电的重质渣油燃料（类似重油）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A heavy, dark residual fuel oil (similar to heavy fuel oil) used for heating, industrial boilers, and power generation.","zh":"一种重质、颜色很深的渣油燃料（类似重油），用于供暖、工业锅炉和发电等。"},"examples":[{"en":"Some power plants burn mazut when natural gas is unavailable.","zh":"有些发电厂在天然气供应不足时会燃烧 mazut（重质燃料油）。"},{"en":"The ship’s engine can run on diesel, but it is often cheaper to use mazut on long routes.","zh":"船舶发动机可以用柴油运行，但长途航线往往使用 mazut 更便宜。"}]}],"synonyms":["heavy fuel oil","residual fuel oil","bunker fuel"],"phonetic":"/məˈzuːt/","extraExplanation":["“mazut”一词常见于与俄罗斯、东欧及前苏联地区相关的能源语境，来源于俄语“мазут”。在英语新闻与技术材料中，它通常指一种低品质但成本较低的重质燃料油，燃烧时可能产生较多烟尘与硫氧化物，因此在一些地区受到环保政策限制或逐步被替代。"]}
{"word":"mazy","summary":{"en":"Mazy means maze-like: winding, intricate, and sometimes confusing (literary/rare).","zh":"Mazy 指“像迷宫一样”的：曲折复杂、难以理清（文学/少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary/rare) Confusingly winding or complicated, like a maze; labyrinthine.","zh":"（文学/少见）像迷宫一样曲折复杂的；令人迷惑的；迷宫般的。"},"examples":[{"en":"They followed a mazy path through the old garden.","zh":"他们沿着旧花园里迷宫般曲折的小路前行。"},{"en":"The story moves through mazy memories and half-forgotten dreams.","zh":"故事穿行在纷乱曲折的记忆与半遗忘的梦境之中。"},{"en":"We got lost in the mazy streets of the medieval town.","zh":"我们在那座中世纪小镇迷宫般的街道里迷路了。"}]}],"synonyms":["labyrinthine","winding","intricate","tortuous","maze-like"],"phonetic":"ˈmeɪzi","extraExplanation":["“mazy”多见于诗歌、文学或较为复古的文体，日常英语里更常用“maze-like”“winding”“labyrinthine”。","它常带有一种画面感：路、街巷、思绪、叙事线索等“曲折、盘绕、难以理清”。"]}
{"word":"mazzard","summary":{"en":"A (rare/old) word for a wild sweet cherry tree or its dark fruit.","zh":"（较少见/偏旧）指野生甜樱桃树或其深色果实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild sweet cherry tree (Prunus avium), or its small dark-red/blackish fruit; also used for a type of sweet cherry.","zh":"野生甜樱桃树（欧洲甜樱桃，Prunus avium），或其小而深红/近黑色的果实；也可指一种甜樱桃品种。"},"examples":[{"en":"The old hedge was dotted with mazzards that ripened in early summer.","zh":"老篱笆间点缀着几棵野生甜樱桃树，初夏就会成熟。"},{"en":"In some old recipes, mazzards are used for a deeper, more wine-like cherry flavor.","zh":"在一些老食谱里，会用深色野樱桃来带出更浓、更像红酒的樱桃风味。"}]}],"synonyms":["wild cherry","sweet cherry","gean (dialect)"],"phonetic":"/ˈmæzərd/","extraExplanation":["“mazzard”在现代英语中比较少见，更多见于英国方言、旧书或植物/园艺语境。日常交流里更常说“wild cherry”或直接说“cherry”。","在英格兰部分地区，“mazzard”有时特指果实较深色、味道更浓的甜樱桃类型；不同地区用法可能略有差异。"]}
{"word":"mazzards","summary":{"en":"“Mazzards” can mean wild cherries (or the wild cherry tree), and in old slang it can also mean “heads.”","zh":"“mazzards”可指野樱桃（或野樱桃树）；在过时俚语中也可指“脑袋/头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “mazzard”) a wild cherry tree, or its small dark-red fruit (a kind of cherry).","zh":"（“mazzard”的复数）野樱桃树；或其小而深红的野樱桃果实（一种樱桃）。"},"examples":[{"en":"In early summer, mazzards can be found along old hedgerows and woodland edges.","zh":"初夏时，常能在老篱笆旁和林缘找到野樱桃（mazzards）。"},{"en":"The recipe calls for sour cherries, but mazzards can work in a pinch.","zh":"食谱需要酸樱桃，但应急时用野樱桃（mazzards）也可以。"}]},{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned, slang) heads; skulls.","zh":"（过时俚语）脑袋；头颅。"},"examples":[{"en":"He took a knock on the mazzard and felt dizzy afterward.","zh":"他脑袋挨了一下，之后觉得头晕。"},{"en":"Keep your mazzard down when you walk under that low beam.","zh":"从那根低梁下走时把头低一点。"}]}],"synonyms":["wild cherries","heads (old slang)","skulls (old slang)"],"phonetic":"/ˈmæzərdz/","extraExplanation":["“mazzard”是比较古老的词：一方面指一种野樱桃/甜樱桃的早期称呼；另一方面在英式旧俚语里也可指“头、脑袋”。在现代英语中较少见，阅读老文学作品或方言材料时更可能遇到。"]}
{"word":"Mazzinian","summary":{"en":"Connected with Giuseppe Mazzini or his nationalist republican ideas; a follower of them.","zh":"与马志尼及其民族共和理念相关；或指其追随者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Giuseppe Mazzini (an Italian 19th‑century nationalist and republican thinker) or to his political ideals, especially republicanism, national self‑determination, and unification.","zh":"（形容）与朱塞佩·马志尼（19世纪意大利民族主义与共和主义思想家）或其政治理念有关的，尤指共和、民族自决与国家统一等主张。"},"examples":[{"en":"The essay traces the Mazzinian influence on early Italian republican movements.","zh":"这篇文章追溯了马志尼式思想对早期意大利共和运动的影响。"},{"en":"Some activists adopted a Mazzinian vision of a united nation built on civic duty.","zh":"一些活动人士采纳了马志尼式的愿景：以公民责任为基础建立统一的国家。"}]},{"partOfSpeech":"n.","definition":{"en":"A supporter or follower of Giuseppe Mazzini’s political program or style of nationalism.","zh":"（名词）马志尼的支持者/追随者；奉行马志尼式民族主义与共和主义路线的人。"},"examples":[{"en":"In exile, he met other Mazzinians who circulated pamphlets and letters.","zh":"在流亡中，他遇到了其他马志尼派人士，他们传播小册子与书信。"},{"en":"The police kept a close watch on suspected Mazzinians.","zh":"警方严密监视疑似马志尼派分子。"}]}],"synonyms":["Mazzini-inspired","republican","nationalist","patriot"],"phonetic":"/mætˈsiːniən/","extraExplanation":["马志尼（1805–1872）是意大利统一运动的重要思想家之一，强调“人民主权”“共和制”“民族解放”以及公民道德责任。英语里用 Mazzinian 来概括与其思想、组织网络或政治风格相关的人与事。","该词多见于历史、政治学写作，日常口语中较少使用。"],"etymology":"来自人名 Mazzini（朱塞佩·马志尼，Giuseppe Mazzini）+ 形容词/名词后缀 -an（表示“……的；……的人”）。常用于政治思想史与意大利统一（Risorgimento）相关语境。","mnemonic":["把 -an 记成“……的人/……的”：Mazzini + an → “马志尼的/马志尼派的人”。","联想中文“马志尼”+“派”：看到 Mazzinian 就想到“马志尼派思想/追随者”。"]}
{"word":"mazzinian","summary":{"en":"Mazzinian means “connected with Giuseppe Mazzini or his republican, nationalist ideas,” and it can also mean “a follower of Mazzini.”","zh":"Mazzinian 指“与马志尼及其共和民族主义思想有关的”，也可指“马志尼的追随者/马志尼主义者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Giuseppe Mazzini (an Italian nationalist and activist) or to his political ideas, especially republicanism, democracy, and the unification of Italy.","zh":"与朱塞佩·马志尼（意大利民族主义者与政治活动家）有关的；或指其政治思想的，尤指共和、民主与意大利统一理念。"},"examples":[{"en":"In the 1800s, some young Italians were inspired by Mazzinian ideals of a united republic.","zh":"在19世纪，一些意大利青年受到马志尼式“统一共和国”理想的鼓舞。"},{"en":"The writer’s Mazzinian tone is clear: he argues that citizens must take moral responsibility for the nation.","zh":"这位作者的“马志尼式”语气很明显：他主张公民必须对国家承担道德责任。"}]},{"partOfSpeech":"n.","definition":{"en":"a supporter or follower of Giuseppe Mazzini and his movement or principles.","zh":"马志尼的支持者；马志尼主义的追随者。"},"examples":[{"en":"He was known as a Mazzinian and often spoke against monarchy.","zh":"他以马志尼主义者著称，经常公开反对君主制。"},{"en":"Several Mazzinians were forced into exile for their political activities.","zh":"一些马志尼主义者因政治活动被迫流亡。"}]}],"synonyms":["Mazzinist","Mazzinism-related"],"phonetic":"/mɑtˈsiːniən/","extraExplanation":["“Mazzinian”来自人名 Mazzini（马志尼）+ 形容词后缀 -an，表示“与某人/某派有关”。常见于历史、政治学、欧洲史（意大利复兴运动 Risorgimento）语境。","相关词：Mazzinist（马志尼主义者）、Mazzinism（马志尼主义）。在英文中，这类以人物命名的词（如 Marxist, Darwinian）通常用来概括其思想体系或追随者。"]}
{"word":"mazzinianism","summary":{"en":"Mazzinianism: Mazzini’s republican, nationalist ideas about national unity and self-determination.","zh":"马志尼主义：马志尼所倡导的共和与民族主义思想，强调民族统一与自决。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political ideology associated with Giuseppe Mazzini, emphasizing republicanism, national self-determination, civic duty, and the unification/liberation of nations (especially in 19th‑century Italy).","zh":"“马志尼主义”：与朱塞佩·马志尼相关的政治思想，强调共和制、民族自决、公民责任，以及民族的统一与解放（尤其指19世纪意大利的统一运动背景）。"},"examples":[{"en":"Mazzinianism inspired some young activists who believed a united Italy should be a republic, not a monarchy.","zh":"马志尼主义鼓舞了一些青年活动家，他们认为统一后的意大利应当是共和国，而不是君主制。"},{"en":"In the history class, we compared Mazzinianism with other forms of European nationalism.","zh":"在历史课上，我们把马志尼主义与欧洲其他民族主义思潮作了比较。"}]}],"synonyms":["Mazzinism","Italian republicanism","republican nationalism","national self-determination (related idea)"],"phonetic":"/ˌmɑtsiˈniənɪzəm/","extraExplanation":["“Mazzinianism”来自意大利思想家朱塞佩·马志尼（Giuseppe Mazzini, 1805–1872）。他是意大利“复兴运动/统一运动”（Risorgimento）的重要人物，主张通过人民觉醒与公民道德来实现民族统一与自由，并偏向共和政治。","在英语里也可见拼写“Mazzinism”。这个词多出现在历史、政治思想或欧洲民族国家形成的讨论中，日常口语很少用。"]}
{"word":"Mazzinism","summary":{"en":"Mazzini’s nationalist republican ideology, especially linked to Italian unification.","zh":"马志尼的民族统一与共和主义政治思想（多与意大利统一相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The political ideas and movement associated with Giuseppe Mazzini, emphasizing Italian national unity, a republican government, popular sovereignty, and moral duty in politics (especially in the 1800s).","zh":"与朱塞佩·马志尼（Giuseppe Mazzini）相关的政治思想与运动，强调民族统一（尤指意大利）、共和政体、人民主权，以及政治中的道德使命感（多见于19世纪）。"},"examples":[{"en":"Mazzinism inspired many young activists during the Italian unification movement.","zh":"马志尼主义在意大利统一运动时期鼓舞了许多青年行动者。"},{"en":"Some historians contrast Mazzinism’s moral idealism with more pragmatic approaches to nation-building.","zh":"一些历史学者把马志尼主义的道德理想主义与更务实的建国策略作对比。"}]}],"synonyms":["Mazzinianism","nationalism","republicanism","patriotism"],"phonetic":"/ˈmɑːtsiˌnɪzəm/","extraExplanation":["马志尼（1805–1872）是意大利“复兴运动”（Risorgimento）的重要人物之一。他主张以人民为基础的民族国家、反对君主专制，并强调政治行动应带有道德与使命感。在英语语境里，Mazzinism 常见于历史、政治思想史与19世纪欧洲民族主义研究。"],"etymology":"源自意大利民族主义思想家 Giuseppe Mazzini（马志尼）的姓氏 + 英语后缀 -ism（“……主义/学说/思潮”），用于指代其政治理念及相关运动。","mnemonic":["把 -ism 记成“主义”；Mazzini（马志尼）+ ism → “马志尼的主义”。","联想中文“复兴运动/意大利统一”：看到 Mazzinism 就想到“意大利统一时期的共和民族主义思想”。"]}
{"word":"Mazzinism-related","summary":{"en":"related to Mazzini’s nationalist-republican political ideas","zh":"与马志尼的民族主义—共和主义政治思想相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or characteristic of Mazzinism (the political ideas associated with Giuseppe Mazzini, especially 19th‑century Italian nationalism, republicanism, and the belief in national self-determination).","zh":"与“马志尼主义”（与朱塞佩·马志尼相关的政治思想，尤指19世纪意大利民族主义、共和主义及民族自决观念）有关的；具有马志尼主义特征的。"},"examples":[{"en":"The essay traces Mazzinism-related networks among Italian exiles in London.","zh":"这篇论文追溯了伦敦意大利流亡者之间与马志尼主义相关的联络网络。"},{"en":"Some activists promoted Mazzinism-related ideals of a unified, republican Italy.","zh":"一些活动家宣传与马志尼主义相关的理想：一个统一的共和制意大利。"}]}],"synonyms":["Mazzinian","Mazzinist","nationalist","republican","patriotic"],"phonetic":"/ˈmɑːt.siˌnɪz.əm rɪˈleɪ.tɪd/","extraExplanation":["“Mazzinism（马志尼主义）”常与19世纪欧洲民族国家形成、革命运动、以及“民族应当自由统一、以共和国形式实现政治共同体”等观念联系在一起。学术写作里用“X-related”这种结构，通常表示“与X有关/受X影响/围绕X展开”，语气比直接说“X”更中性、更宽泛。"],"etymology":"由“Giuseppe Mazzini（朱塞佩·马志尼）+ -ism（学说/主义）+ related（相关的）”构成；用于指与其政治思想传统有关的事物或观点。","mnemonic":["把它拆开记：Mazzini（马志尼）+ ism（主义）+ related（相关）＝“和马志尼主义有关的”。","联想“马志尼=意大利统一/共和国/民族自决”，看到该词就想到这些关键词。"]}
{"word":"Mazzinist","summary":{"en":"a follower of Mazzini’s nationalist and republican ideas; or related to them","zh":"马志尼民族主义与共和思想的追随者；或与其思想相关"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A supporter or follower of Giuseppe Mazzini’s political ideas, especially his 19th‑century Italian nationalist and republican movement.","zh":"马志尼主义的支持者；追随朱塞佩·马志尼政治思想的人（尤指19世纪意大利民族主义与共和主义运动）。"},"examples":[{"en":"Some young activists in the 1840s identified themselves as Mazzinists and argued for a united republic.","zh":"19世纪40年代，一些青年活动家自称马志尼主义者，主张建立统一的共和国。"},{"en":"The pamphlet was written from a Mazzinist point of view, praising civic duty and national unity.","zh":"这本小册子以马志尼主义立场写成，称颂公民责任与民族统一。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Mazzini or to his political principles (especially nationalism, republicanism, and civic duty).","zh":"与马志尼或其政治主张相关的（尤指民族主义、共和主义与公民责任）。"},"examples":[{"en":"They debated Mazzinist ideals of citizenship in their study group.","zh":"他们在学习小组里讨论马志尼主义关于公民身份的理想。"},{"en":"The novel includes a Mazzinist character who dreams of a unified Italy.","zh":"小说里有一位带有马志尼主义色彩的角色，梦想意大利统一。"}]}],"synonyms":["Mazzinian","republican","nationalist"],"phonetic":"/ˈmɑːtsiˌnɪst/","extraExplanation":["马志尼是意大利“复兴运动”（Risorgimento）时期的重要思想家与革命者之一，强调民族自决、共和政体与公民道德责任。英语里用 Mazzinist 指其追随者，常见于历史与政治学语境。"],"etymology":"来自人名 Giuseppe Mazzini（朱塞佩·马志尼，1805–1872）+ 英语后缀 -ist（表示“某学说/运动的拥护者”）。","mnemonic":["把 -ist 记成“主义/拥护者”：socialist（社会主义者）→ Mazzinist（马志尼主义者）。","联想“马志尼＝意大利统一与共和理想”，见到 Mazzinist 就想到“追随他那套理想的人/相关的思想”。"]}
{"word":"mazzinist","summary":{"en":"A Mazzinist is someone who supports Giuseppe Mazzini’s republican nationalist ideas; it can also describe those ideas or movements.","zh":"Mazzinist 指支持马志尼的共和民族主义思想的人，也可作形容词表示“马志尼主义的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supporter or follower of Giuseppe Mazzini and his republican, nationalist ideas (especially in 19th‑century Italy)","zh":"马志尼主义者；支持或追随朱塞佩·马志尼及其共和、民族主义思想的人（尤指19世纪意大利）"},"examples":[{"en":"The young activist was labeled a Mazzinist because he argued for a united Italian republic.","zh":"这位年轻的活动人士被称为马志尼主义者，因为他主张建立一个统一的意大利共和国。"},{"en":"Many Mazzinists opposed monarchy and favored popular sovereignty.","zh":"许多马志尼主义者反对君主制，主张人民主权。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characterized by Mazzini’s political principles","zh":"与马志尼的政治原则有关的；具有马志尼主义特征的"},"examples":[{"en":"The group published a Mazzinist manifesto calling for civic duty and national unity.","zh":"该团体发表了一份马志尼主义宣言，呼吁公民责任与民族团结。"}]}],"synonyms":["Mazzinian","republican nationalist","Italian republican (historical)"],"phonetic":"/ˈmɑːtsɪnɪst/","extraExplanation":["“Mazzinist”来自意大利思想家与革命者朱塞佩·马志尼（Giuseppe Mazzini, 1805–1872）。他是意大利“复兴运动/统一运动”（Risorgimento）的重要人物之一，强调共和国、民族自决、公民道德与社会责任。","在英语史料与政治写作中，这个词多见于19世纪欧洲革命史、意大利统一相关研究；现代日常英语里较少使用，通常出现在历史或学术语境。"]}

