{"word":"mea","summary":{"en":"“Mea” is a Latin word meaning “my,” best known in English from the phrase “mea culpa” (“my fault”).","zh":"“Mea”是拉丁语，意思是“我的”，在英语中最常见于短语“mea culpa”（“我的错”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, used in English mainly in set phrases) “my” or “mine” (feminine singular), expressing personal responsibility.","zh":"（拉丁语，在英语中多见于固定短语）“我的/我之”（阴性单数），常用来表达个人责任或承认过错。"},"examples":[{"en":"In the phrase “mea culpa,” mea means “my.”","zh":"在短语“mea culpa”中，mea 的意思是“我的”。"},{"en":"He offered a public “mea culpa” for the mistake.","zh":"他就这个错误公开作出“认错/自我检讨”（mea culpa）。"}]}],"phonetic":"/ˈmeɪə/","extraExplanation":["“mea”本身是拉丁语，在现代英语里很少单独使用，最常见的搭配是“mea culpa”（直译“我的过错”），相当于英语里较正式或带点书面/讽刺意味的“my fault / I’m to blame”。","发音上，英语中常把“mea”读作 /ˈmeɪə/，在“mea culpa”里整体常读作 /ˈmeɪə ˈkʌlpə/。"]}
{"word":"meable","summary":{"en":"“Meable” isn’t a standard word; it most likely refers to “amenable” (= willing to agree/cooperate; responsive).","zh":"“meable” 不是标准单词；最可能是 “amenable”的误拼（表示愿意配合/听劝、易受影响）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or incomplete form of another word (commonly “amenable”).","zh":"不是标准英语单词；多见于拼写错误或某个单词的残缺形式（常见于把 “amenable” 拼错/漏写）。"},"examples":[{"en":"I couldn’t find “meable” in a dictionary—did you mean “amenable”?","zh":"我在词典里找不到 “meable”——你是不是想写 “amenable”？"},{"en":"If you mean “amenable,” it describes someone who is willing to agree or cooperate.","zh":"如果你想表达的是 “amenable”，它形容一个人愿意同意或配合。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “amenable”) willing to agree, cooperate, or be persuaded; responsive to guidance or control.","zh":"（可能你想写：amenable）愿意同意/配合的；听劝的；易于受影响或管控的。"},"examples":[{"en":"She is amenable to feedback and makes changes quickly.","zh":"她很愿意接受反馈，并且很快就会做出调整。"},{"en":"The team was amenable to trying a new plan.","zh":"团队愿意尝试一个新方案。"},{"en":"This condition is amenable to treatment.","zh":"这种情况是可以治疗/干预的。"}]}],"synonyms":["cooperative","willing","agreeable","compliant","open to"],"phonetic":"/əˈmiːnəbəl/","extraExplanation":["“meable”本身通常不使用；最常见的目标词是 **amenable**（少写了开头的 a，或把 a 漏掉）。","**amenable** 常见搭配：*amenable to*（愿意接受/适合于）：*amenable to change / advice / treatment*。","也有人想写 **measurable**（可测量的）或 **malleable**（可塑的），但它们的含义与拼写差别更大；如果你告诉我原句，我可以帮你精确判断。"]}
{"word":"meach","summary":{"en":"Meach is a rare dialect word meaning to sneak away, and in Scottish use it can also mean to play truant (skip school).","zh":"meach 是较少见的方言词，常指“偷偷溜走/潜行”；在苏格兰方言里也可指“逃学”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Dialect, archaic) To move quietly and secretly; to sneak or slink (often to avoid being seen).","zh":"（方言/古语）偷偷地走动；潜行；鬼鬼祟祟地溜走（常指为了不被发现）。"},"examples":[{"en":"The boy meached away when he heard his name called.","zh":"男孩听到有人叫他的名字，就悄悄溜走了。"},{"en":"She meached into the room so she wouldn’t wake the baby.","zh":"她悄悄走进房间，免得吵醒宝宝。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Scotland, dialect) To skip school; to play truant.","zh":"（苏格兰方言）逃学；旷课。"},"examples":[{"en":"He got in trouble for meaching all week.","zh":"他因为一整周都在逃学而惹上麻烦。"},{"en":"Don’t meach today—there’s an exam.","zh":"今天别逃学——有考试。"}]}],"synonyms":["sneak","slink","skulk","creep","play truant","skip school"],"phonetic":"/miːtʃ/","extraExplanation":["“meach”在现代标准英语里很少见，多出现在苏格兰/英格兰部分地区的方言或较老的文学作品中。","它在含义上常与更常见的词“sneak / slink”（偷偷溜走）或“play truant / skip school”（逃学）接近；写作中如果不是刻意营造方言或年代感，通常用这些更常见的表达。"]}
{"word":"meaching","summary":{"en":"“Meaching” is not a standard English word; it’s usually a misspelling of “meaning,” “matching,” or “teaching.”","zh":"“meaching”不是标准英语单词，通常是把“meaning / matching / teaching”等词拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling/typo, commonly for “meaning,” “matching,” or “teaching.”","zh":"不是标准英语单词。通常是拼写错误，常见可能想写的是 meaning（意思/含义）、matching（匹配的/相配的）或 teaching（教学）。"},"examples":[{"en":"I can’t find “meaching” in a dictionary—did you mean “meaning”?","zh":"我在词典里找不到“meaching”——你是不是想写“meaning”？"},{"en":"If you meant “matching,” you could say: “These shoes are matching.”","zh":"如果你想写“matching”，可以说：“These shoes are matching.”（这双鞋很配。）"},{"en":"If you meant “teaching,” you could say: “She is teaching English.”","zh":"如果你想写“teaching”，可以说：“She is teaching English.”（她在教英语。）"}]}],"phonetic":"/ˈmiːtʃɪŋ/","extraExplanation":["“meaching”看起来像是把常见词拼错了。你可以告诉我你想表达的中文意思（比如“意思/含义”“匹配”“教学”），或给我一句完整英文句子，我就能帮你确定正确的单词和用法。"]}
{"word":"meacock","summary":{"en":"“Meacock” is mainly a surname; it’s not a common dictionary word. In rare cases it may be a misspelling/variant of “peacock.”","zh":"“Meacock”主要是姓氏，不是常见词汇；少数情况下可能是“peacock（孔雀）”的误拼或异拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); not a common standard English vocabulary word.","zh":"姓氏（家族名）；不是常见的标准英语词汇。"},"examples":[{"en":"Ms. Meacock will join the meeting at 3 p.m.","zh":"Meacock 女士将于下午三点参加会议。"},{"en":"I saw the name “Meacock” on the office directory.","zh":"我在办公室名录上看到了“Meacock”这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) sometimes treated as a variant spelling of “peacock,” meaning the male peafowl (a bird known for its colorful tail feathers).","zh":"（罕见）有时被当作“peacock”的异拼，指雄孔雀（以绚丽尾羽著称的鸟）。"},"examples":[{"en":"Did you mean “peacock” instead of “meacock”?","zh":"你想写的是“peacock（孔雀）”而不是“meacock”吗？"},{"en":"A peacock spread its tail in the garden.","zh":"一只孔雀在花园里展开了尾羽。"}]}],"synonyms":["(surname) no true synonyms","peacock (if that’s what you meant)"],"phonetic":"/ˈmiːkɑːk/","extraExplanation":["“Meacock”更常见于英语世界中的姓氏（尤其在英格兰有记录）。如果你是在阅读文章/名单时遇到它，通常不需要按“单词词义”理解，而是当作人名或地名的一部分。","如果你本来想查“peacock（孔雀）”，告诉我你想要的词，我可以给出更完整的常用释义、搭配和例句。"]}
{"word":"meacon","summary":{"en":"Meacon means rebroadcasting navigation signals to mislead receivers; it can be used as a verb or a noun in aviation and security contexts.","zh":"Meacon 指通过重新转发导航信号来误导接收者；可作动词或名词，常用于航空与安全领域。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to illegally receive and rebroadcast a radio/navigation signal (such as a GPS or beacon signal) in order to mislead receivers about their true position or direction","zh":"（非法）接收并重新转发无线电/导航信号（如 GPS 或导航台信号），以误导接收方对自身位置或方向的判断"},"examples":[{"en":"The report warned that GPS meaconing could make ships think they were miles from their real location.","zh":"报告警告说，GPS 的 meaconing 可能让船只误以为自己距离真实位置相差数英里。"},{"en":"Pilots are trained to cross-check instruments in case a navigation aid is being meaconed.","zh":"飞行员会被训练交叉核对仪表，以防某个导航信号遭到 meaconing（重放/转发欺骗）。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or technique of rebroadcasting a navigation signal to confuse or deceive navigation systems","zh":"通过转发导航信号来混淆或欺骗导航系统的行为/技术"},"examples":[{"en":"Meaconing is one way to attack radio-based navigation.","zh":"Meaconing 是攻击基于无线电导航的一种方式。"}]}],"synonyms":["spoof","deceive","signal rebroadcasting","navigation signal spoofing"],"phonetic":"/ˈmiːkɑːn/","extraExplanation":["“meacon”来自缩写“masking beacon”（遮蔽/伪装导航信标）。它常出现在航空、军事与网络安全语境中。","它与“GPS spoofing（GPS 诱骗）”相关，但不完全相同：meaconing 更强调把真实信号“接收后转发/延迟后转发”，让接收机误判；而 spoofing 也可能直接生成伪造信号。"]}
{"word":"mead","summary":{"en":"Mead is honey wine—an alcoholic drink made by fermenting honey and water.","zh":"Mead 指蜂蜜酒：用蜂蜜和水发酵制成的酒精饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An alcoholic drink made by fermenting honey with water, sometimes with fruit, spices, or herbs.","zh":"蜂蜜酒：用蜂蜜和水发酵制成的酒精饮料，有时会加入水果、香料或草药。"},"examples":[{"en":"We tried a glass of mead at the medieval festival.","zh":"我们在中世纪主题的节日上尝了一杯蜂蜜酒。"},{"en":"Traditional mead is made from honey, water, and yeast.","zh":"传统的蜂蜜酒由蜂蜜、水和酵母制成。"},{"en":"This mead has a light apple flavor.","zh":"这款蜂蜜酒带有淡淡的苹果风味。"}]}],"synonyms":["honey wine"],"phonetic":"/mid/","extraExplanation":["“mead”在英语文化里常和“中世纪、北欧/维京、古英语史诗”等意象联系在一起，比如想象中的大厅里人们举杯饮酒。现代也有精酿（craft）蜂蜜酒，风格从干型到甜型都有。","常见相关词：honey wine（蜂蜜酒，较直白的说法）；melomel（加入水果的蜂蜜酒）；metheglin（加入香料/草药的蜂蜜酒）。"]}
{"word":"meader","summary":{"en":"Meander means to go in a winding way (like a river) or to be indirect in speech or writing; it can also mean a winding curve.","zh":"Meander 指像河流一样蜿蜒前进，也可指说话/写作不够直接、容易跑题；名词还可表示“曲流/弯曲处”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to move or go in a winding, curving way (not straight)","zh":"（路线）蜿蜒前进；曲折地走"},"examples":[{"en":"The river meanders through the valley.","zh":"这条河在山谷中蜿蜒流过。"},{"en":"We meandered around the old town without a plan.","zh":"我们没有计划地在老城区里随意闲逛。"}]},{"partOfSpeech":"v.","definition":{"en":"to talk, write, or think in a way that is not direct and often changes topic","zh":"（说话/写作/思路）离题；不够直接，东拉西扯"},"examples":[{"en":"His explanation meandered and never answered the question clearly.","zh":"他的解释东拉西扯，始终没有清楚回答问题。"},{"en":"Try not to meander in your essay—stay focused on your main idea.","zh":"写作文尽量别跑题——要围绕中心观点。"}]},{"partOfSpeech":"n.","definition":{"en":"a winding curve or turn, especially in a river; a winding path","zh":"（尤指河流的）弯曲处；曲流；蜿蜒的路线"},"examples":[{"en":"This section of the river has many meanders.","zh":"这段河道有很多曲流。"},{"en":"We followed the meander of a narrow path into the forest.","zh":"我们沿着一条狭窄小路的蜿蜒走进森林。"}]}],"synonyms":["wander","wind","snake","ramble","roam","drift"],"phonetic":"/miˈændɚ/","extraExplanation":["你输入的“meader”在英语里不常见，很多学习者其实想查的是 **meander**（拼写多一个 n）。","**词源小故事**：meander 来自古希腊语 *Maiandros*，指土耳其的一条以“弯弯绕绕”出名的河（今 Büyük Menderes 河）。因此这个词既能形容河流蜿蜒，也常被引申为说话/写作“绕来绕去”。","写作里常见搭配：**a meandering story/plot**（情节松散、绕弯的故事）；日常里常说 **meander around**（随意逛逛）。"]}
{"word":"meadow","summary":{"en":"A meadow is an open grassy area, often with wildflowers, sometimes used for making hay.","zh":"Meadow 指开阔的草地/牧草地，常有野花，有时用于割草做干草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a field of grass and wildflowers, often used for hay or left as open natural land","zh":"草地；牧草地；长满青草和野花的开阔地（常用于割草做干草或保持自然状态）"},"examples":[{"en":"We had a picnic in a meadow full of wildflowers.","zh":"我们在一片开满野花的草地上野餐。"},{"en":"In summer, the meadow turns bright green and buzzes with insects.","zh":"夏天，草地变得翠绿，昆虫嗡嗡作响。"},{"en":"The farmer cuts the meadow in late June to make hay.","zh":"农民在六月下旬割草地的草做干草。"}]}],"synonyms":["grassland","pasture","field (general)"],"phonetic":"/ˈmɛdoʊ/","extraExplanation":["“Meadow”常让人联想到乡村自然景观：比“field（田地/地块）”更强调自然的草与花；比“lawn（草坪）”更野、更不规则，也通常不人工修剪。","在文学里，meadow常用来营造宁静、自由、田园（pastoral）的氛围，例如描写“a quiet meadow by a river（河边静谧的草地）”。","常见搭配：wildflower meadow（野花草地）、meadow grass（牧草/草地草）、meadowland（草地/草甸地带）。"]}
{"word":"meadowbur","summary":{"en":"Meadowbur is a burr-like prickly seed head (or the plant that makes it) that sticks to clothes or animal fur.","zh":"Meadowbur 指会粘在衣物或动物毛上的刺果（或结这种刺果的植物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prickly seed head (a burr) from certain wild grasses or weeds that can stick to clothing or animal fur; also used for the plant that produces it","zh":"（某些野草/杂草的）带刺的“蒺藜状种子球/刺果”，会粘在衣物或动物毛上；也可指结这种刺果的植物"},"examples":[{"en":"After our hike, we found meadowburs stuck to the dog’s fur.","zh":"徒步回来后，我们发现狗的毛上粘了很多meadowbur（刺果）。"},{"en":"The kids avoided the field because it was full of meadowbur plants.","zh":"孩子们避开那片地，因为那里长满了会结刺果的meadowbur植物。"}]}],"synonyms":["burr","bur","sandbur","cocklebur"],"phonetic":"/ˈmɛdoʊbɝ/","extraExplanation":["“meadowbur”更常见的写法是“meadow burr”或“meadowbur(r)”。在不同地区，它可能指不同的会结刺果（burr）的野草/杂草；因此在阅读或查资料时，最好结合图片、拉丁学名或所在地区来确认具体是哪一种植物。","词源提示：burr/bur 指“带钩刺、会粘人的果实/种子球”（像会黏在衣服上的小刺球）。英语里很多植物名会用 burr/bur 结尾，如 burdock（牛蒡）等。"]}
{"word":"meadowed","summary":{"en":"“Meadowed” is a rare, often literary form meaning “covered with meadow grass” or “turned into a meadow.”","zh":"“meadowed”较少见、偏文学，用来表示“被草地覆盖”或“变成草地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(past tense / past participle of “meadow”) covered with or made into meadowland (grassy fields, often with wildflowers).","zh":"（“meadow”的过去式/过去分词）被草地覆盖的；被变成草地/牧草地的。"},"examples":[{"en":"In spring, the valley was meadowed with fresh green grass and wildflowers.","zh":"春天，山谷里一片新绿，野花盛开，仿佛铺成了草地。"},{"en":"The once-wooded slope has been meadowed over time as trees disappeared.","zh":"随着树木消失，这片曾经有树林的山坡逐渐变成了草地。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare, literary) to cover with meadows or turn into a meadow.","zh":"（罕见，偏文学）使……长满草地；把……变成草地。"},"examples":[{"en":"The river’s slow floods meadowed the lowlands year by year.","zh":"河水年复一年的缓慢泛滥，使低地逐渐变成草地。"},{"en":"Farmers meadowed the flat land for hay.","zh":"农民把平地改成草场来收割干草。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) to become meadow-like; to form a meadow.","zh":"（罕见）变得像草地；形成草地。"},"examples":[{"en":"After the fire, the hillside slowly meadowed as grasses returned.","zh":"火灾之后，草类回来了，山坡慢慢又变得像草地。"}]}],"synonyms":["grass-covered","pastoral","covered in meadows","turned into meadowland"],"phonetic":"/ˈmɛdoʊd/","extraExplanation":["“meadowed”在现代英语里非常少见，多见于描写自然风景的文学性文字。日常表达更常用：\"covered in meadows/grass\"（被草地覆盖）、\"turned into a meadow\"（变成草地）。","词根“meadow”指“草地、牧草地”，常让人联想到有野花、缓坡、溪流等宁静的田园意象，因此在诗歌或散文中用来营造画面感。"]}
{"word":"meadower","summary":{"en":"A rare word meaning a meadow-dweller—someone or something that lives in or is linked to meadows.","zh":"一个罕用词，指“草地栖居者”——生活在草地里或与草地相关的人或动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A person or animal that lives in or is closely associated with meadows; a meadow-dweller.","zh":"（罕用）生活在草地/牧草地里，或与草地密切相关的人或动物；草地栖居者。"},"examples":[{"en":"The old poem describes shepherds and other meadowers moving quietly through the grass.","zh":"那首老诗描写了牧羊人和其他“草地栖居者”在草丛中悄然穿行。"},{"en":"In spring, meadowers such as rabbits and ground-nesting birds are easier to spot.","zh":"春天时，兔子、在地面筑巢的鸟等草地动物更容易被看到。"}]}],"synonyms":["meadow-dweller","field-dweller","grassland inhabitant"],"phonetic":"ˈmɛdoʊɚ","extraExplanation":["“meadower”由 meadow（草地、牧草地）+ 后缀 -er 构成，字面意思是“与草地有关的……的人/物”。这个词在现代英语里非常少见，更常用的说法是 meadow-dweller（草地居民/栖居者）、creature of the meadow（草地生物），或直接说 animals in the meadow（草地里的动物）。","在文学或描写性写作中，作者可能用“meadower”来营造田园（pastoral）氛围，带一点古雅或诗意的感觉。"]}
{"word":"meadowing","summary":{"en":"“Meadowing” means the act of turning land into a meadow or the process of creating/maintaining meadow habitat.","zh":"“meadowing”指把土地变成草地（草地化），或指营造/维护草地栖息地的过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(gerund/present participle of meadow) to turn land into a meadow, or to cover/fill an area with meadow-like grass and wildflowers.","zh":"（meadow 的动名词/现在分词）把土地变成草地/牧草地；或使某处长满像草地一样的草与野花。"},"examples":[{"en":"Over time, the abandoned field was meadowing, with tall grass and wildflowers returning.","zh":"随着时间推移，那片废弃的田地逐渐草地化，高草和野花又长回来了。"},{"en":"The project focuses on meadowing the edges of the park to support bees and butterflies.","zh":"该项目重点把公园边缘草地化，以支持蜜蜂和蝴蝶。"}]},{"partOfSpeech":"n.","definition":{"en":"the process or practice of creating or maintaining a meadow (often for habitat or landscaping).","zh":"营造或维护草地的过程/做法（常用于栖息地恢复或景观设计）。"},"examples":[{"en":"Meadowing can reduce lawn maintenance and increase biodiversity.","zh":"草地化可以减少草坪维护并提高生物多样性。"},{"en":"They discussed meadowing as an alternative to planting high-water-demand lawns.","zh":"他们讨论用草地化来替代种植耗水量大的草坪。"}]}],"synonyms":["meadow restoration","re-wilding (partly related)","habitat restoration","naturalization"],"phonetic":"/ˈmɛdoʊɪŋ/","extraExplanation":["“meadowing”在日常英语里不算常见，更常见的表达是“creating a meadow / converting land to meadow / meadow restoration”。不过在生态修复、园艺与景观设计语境中，它作为动词用法越来越常见。","词源上与“meadow（草地）”相关：把“草地”名词动词化（to meadow），再加 -ing 形成进行/过程含义。文学或描写自然的文字中，也可能用来营造“土地逐渐变成草地”的画面感。"]}
{"word":"meadowink","summary":{"en":"“Meadowink” is not a standard dictionary word; it’s usually a creative/brand-style term meaning meadow-colored ink (often fresh green) or a name/username.","zh":"“Meadowink”不是标准词典词，通常是创意/品牌式用语：指带草地意象（常偏清新绿色）的墨水，或作为名称/用户名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal/creative) A coined term for ink whose color suggests a meadow (fresh green), or ink used to draw or write about meadow scenes.","zh":"（非正式/创意用法）自造词，指带有“草地/原野”感觉的墨水（常偏清新绿色），或用于描绘/书写草地意象的墨水。"},"examples":[{"en":"She wrote the title in meadowink to give the page a calm, spring feeling.","zh":"她用“meadowink”写标题，让页面有一种宁静的春日感觉。"},{"en":"For the landscape sketch, he chose meadowink instead of black.","zh":"画风景速写时，他选了“meadowink”，而不是黑色墨水。"}]},{"partOfSpeech":"other","definition":{"en":"A name used for a product, account, or pen-ink shade (proper-name style).","zh":"用于产品、账号或钢笔墨水色号的名称（类似专有名/品牌名的用法）。"},"examples":[{"en":"Meadowink is their newest fountain-pen color in the spring collection.","zh":"Meadowink 是他们春季系列里最新的钢笔墨水色。"},{"en":"You can find her reviews under the username Meadowink.","zh":"你可以用用户名 Meadowink 找到她的测评。"}]}],"synonyms":["green ink","spring green","emerald ink","pen ink"],"phonetic":"/ˈmɛdoʊˌɪŋk/","extraExplanation":["“meadowink”不是常见的标准英语词，更像是把 meadow（草地、牧场）和 ink（墨水）拼在一起的创意合成词，因此含义通常要看具体语境：可能指“草地绿”一类的墨水色，也可能只是品牌名/网名。","如果你是想查别的词（例如 meadow 或 ink），或这是某个品牌/作品里的专有名词，也可以把原句发我，我能按上下文给出更准确的解释。"]}
{"word":"meadowland","summary":{"en":"Meadowland means an area of land covered with meadow-like grass and wild plants.","zh":"meadowland 指长满草和野生植物的草地区域（草地/牧草地）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Land covered with natural grass and wild plants, often used as open pasture or kept as a natural habitat (a meadow area).","zh":"长满天然草与野生植物的开阔地，常用于放牧或作为自然栖息地（草地/牧草地）。"},"examples":[{"en":"We walked through the meadowland at sunset and heard crickets in the grass.","zh":"我们在日落时穿过那片草地，听见草丛里的蟋蟀声。"},{"en":"The town protected the meadowland to support birds and pollinators.","zh":"小镇保护这片草地，以支持鸟类和传粉昆虫的生存。"}]}],"synonyms":["meadow","grassland","pasture","hayfield"],"phonetic":"/ˈmɛdoʊˌlænd/","extraExplanation":["“meadowland”通常是可数或不可数名词，意思接近“meadows（多片草地）/ meadow area（草地区域）”。在生态与保护话题中很常见，强调一种自然景观与栖息地，而不只是“草”。","词形构成：meadow（草地）+ land（土地）。语感上比单说“meadow”更偏“区域/地带”，也常用于地名、景观描写或环境报告中。"]}
{"word":"meadowlands","summary":{"en":"Meadowlands are low, grassy areas often connected with wetlands; it can also refer to the famous wetland region in New Jersey called the Meadowlands.","zh":"meadowlands 指低洼的草地/湿地草原；也可专指美国新泽西州著名的“梅多兰兹湿地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Low-lying grassy land, often near a river or in a wet area; meadows or wetlands used for grass and wildlife.","zh":"低洼的草地（常靠近河流或湿地）；可指草甸或湿地草原，常用于草生长与野生动物栖息。"},"examples":[{"en":"In spring, the meadowlands fill with wildflowers and migrating birds.","zh":"春天，低洼草地上开满野花，也会有候鸟迁徙停留。"},{"en":"They built a walking trail through the meadowlands to protect the habitat.","zh":"他们在低洼草地里修了步道，以保护栖息地。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name for a well-known wetland area in northeastern New Jersey, USA (often called “the Meadowlands”).","zh":"专有名词：美国新泽西州东北部著名湿地区域（常称“The Meadowlands/新泽西梅多兰兹湿地”）。"},"examples":[{"en":"The Meadowlands are an important stop for birds along the Atlantic Flyway.","zh":"新泽西梅多兰兹湿地是大西洋候鸟迁飞通道上的重要停歇地。"},{"en":"There are nature centers that teach visitors about the Meadowlands ecosystem.","zh":"那里有自然中心，向游客介绍梅多兰兹湿地生态系统。"}]}],"synonyms":["wetlands","marshlands","grasslands","meadows"],"phonetic":"/ˈmɛdoʊˌlændz/","extraExplanation":["“meadowlands”通常是复数形式，语气上更像在说“一大片草地/湿地地带”。写作中如果指新泽西的专名，常用大写并加定冠词：the Meadowlands。","新泽西 Meadowlands 曾因工业与填埋等问题受到污染，近几十年也进行过生态修复，因此在美国语境里，它既常与“湿地保护”相关，也带有一点城市边缘地带的文化印象。"]}
{"word":"meadowlark","summary":{"en":"A meadowlark is a North American grassland songbird famous for its beautiful whistling song.","zh":"meadowlark 指一种北美草原/草地常见的鸣禽，以悦耳的口哨般歌声闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A North American songbird (a type of blackbird) known for its clear, whistling song and for living in open grasslands and meadows.","zh":"一种北美的鸣禽（黑鹂科相关鸟类），以清亮的口哨般歌声著称，常栖息在草原与牧草地等开阔地带。"},"examples":[{"en":"We heard a meadowlark singing across the prairie at sunrise.","zh":"日出时，我们听到草原那边有草地鹨在歌唱。"},{"en":"Meadowlarks prefer open fields rather than dense forests.","zh":"草地鹨更喜欢开阔的田野，而不是茂密的森林。"}]}],"synonyms":["lark (informal, not exact)","grassland songbird"],"phonetic":"/ˈmɛdoʊˌlɑrk/","extraExplanation":["“meadowlark”在美国文化中常被当作“乡野、开阔大地、自然之声”的象征，常出现在描写草原、农场和西部景色的文学与歌曲里。","严格来说常见的有两种：Eastern Meadowlark（东草地鹨）和Western Meadowlark（西草地鹨）。它们外形相似（胸前常见黄色与黑色“V”形斑纹），但鸣叫声不同；在一些州里还是州鸟（state bird）。"]}
{"word":"meadowlarks","summary":{"en":"Meadowlarks are North American songbirds famous for their yellow chest and beautiful, clear song.","zh":"Meadowlarks 指北美常见的鸣禽，以黄胸与清亮动听的歌声著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meadowlark: a medium-sized North American songbird (related to blackbirds) known for its bright yellow chest and clear, flute-like song; “meadowlarks” is the plural form.","zh":"草地鹨／草地鹂（meadowlark）：一种北美常见的鸣禽（与拟椋鸟科鸟类相关），胸前鲜黄、叫声清亮悦耳；“meadowlarks”为其复数形式。"},"examples":[{"en":"We saw meadowlarks singing on the fence posts near the field.","zh":"我们看到草地鹨站在田边的栅栏柱上唱歌。"},{"en":"In spring, meadowlarks return and their songs fill the open grasslands.","zh":"春天草地鹨归来，它们的歌声会回荡在开阔的草原上。"}]}],"synonyms":["meadowlark","songbird"],"phonetic":"/ˈmɛdoʊˌlɑrk/","extraExplanation":["“meadowlark”并不是“lark（云雀）”的同一种鸟；它属于北美的拟椋鸟类（和黑鸟、牛鹂更接近）。名字里带“meadow-”主要因为它常出现在草地、牧场等开阔地带。","在美国文化中，meadowlark常被用来象征草原、乡村与春天的回归；Western meadowlark（西草地鹨）还是一些州的“州鸟”（state bird）。"]}
{"word":"meadowless","summary":{"en":"“Meadowless” describes a place or landscape that has no meadows or grassy open fields.","zh":"“meadowless”用来形容某个地方或景观“没有草地/牧草地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a meadow; lacking grassy open fields.","zh":"没有草地（牧草地）的；缺乏开阔草地的。"},"examples":[{"en":"The meadowless hillside looked rocky and dry.","zh":"那片没有草地的山坡看起来多石而干燥。"},{"en":"In winter, the valley can feel meadowless, even if grass returns in spring.","zh":"冬天时山谷会显得“没有草地”，即使春天草会再长回来。"}]}],"synonyms":["without meadows","meadow-free","grassless (similar but broader)","barren (more general)"],"phonetic":"/ˈmɛdoʊləs/","extraExplanation":["“meadowless”是一个比较少见的形容词，由名词 meadow（草地、牧草地）+ 后缀 -less（“没有……的”）构成。英语里用 -less 可以很自然地造出表示“缺乏某物”的词，如 homeless（无家可归的）、fearless（无畏的）。因此，即使没见过这个词，也可以通过词缀推断大意。"]}
{"word":"meadows","summary":{"en":"“Meadows” is the plural of “meadow”: open grassy fields, often in the countryside.","zh":"“meadows”是“meadow”的复数：指开阔的草地/草甸，常见于乡村或公园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A field of grass and wildflowers, usually in the countryside, often used for walking, grazing animals, or simply as natural open land.","zh":"（乡村常见的）草地、牧草地、野花草甸；通常是开阔的自然草地，可供散步或放牧。"},"examples":[{"en":"We had a picnic in a meadow full of wildflowers.","zh":"我们在一片开满野花的草地上野餐。"},{"en":"Cows were grazing in the meadows near the river.","zh":"河边的草地上有牛在吃草。"},{"en":"In spring, the meadow turns bright green.","zh":"春天时，草地会变得翠绿。"}]},{"partOfSpeech":"n.","definition":{"en":"A natural or artificial open grassy area, sometimes used in place names or to describe a landscape style.","zh":"（也可指）开阔的草坪/绿地；常用于地名或景观描写。"},"examples":[{"en":"They live in a neighborhood called Pine Meadows.","zh":"他们住在一个叫“松林草原（Pine Meadows）”的小区。"},{"en":"The park includes wooded trails and wide meadows.","zh":"这个公园既有林间小径，也有宽阔的草地。"}]}],"synonyms":["grasslands","fields","pastures","open land"],"phonetic":"/ˈmɛdoʊz/","extraExplanation":["“meadow”常让人联想到英美文学里宁静、田园（pastoral）的意象：开阔、自然、带野花与微风的乡间景色。","拼写提示：复数是“meadows”。发音里“ea”读作 /ɛ/（像“bed”里的 e），不是 /iː/。"]}
{"word":"meadowsweet","summary":{"en":"Meadowsweet is a sweet-smelling wild plant with small white flowers, common in damp meadows and riverbanks.","zh":"Meadowsweet 指一种带甜香、开小白花的野生植物，常见于潮湿草地与河岸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sweet-smelling wild plant with clusters of small white flowers, often found growing in damp meadows and along rivers (also called queen-of-the-meadow); its flowers/leaves have been used in traditional herbal teas and flavoring","zh":"绣线菊草（也常称“草原女王”）：一种带甜香的野生植物，开成簇的小白花，常生长在潮湿草地或河岸；其花和叶在传统草药中常用于泡茶或调味"},"examples":[{"en":"Meadowsweet grows beside the stream and smells lightly of honey.","zh":"绣线菊草长在溪边，闻起来有淡淡的蜜香。"},{"en":"In some traditions, people dried meadowsweet flowers to make a gentle herbal tea.","zh":"在一些传统里，人们会把绣线菊草的花晾干，用来泡温和的花草茶。"}]}],"synonyms":["queen-of-the-meadow"],"phonetic":"/ˈmɛdoʊˌswit/","extraExplanation":["“Meadowsweet”字面意思是“草地的甜香”。它常指植物 Filipendula ulmaria。历史上它与“水杨酸/阿司匹林”的故事常被提到：该植物（以及同样含相关成分的柳树）曾用于缓解疼痛与发热的民间疗法；后来化学家从相关植物成分研究出乙酰水杨酸（阿司匹林）。日常英语里更常把 meadowsweet 当作植物名使用，而不是药名。"]}
{"word":"meadowsweets","summary":{"en":"Meadowsweet is a sweet-smelling wildflower that often grows in wet meadows and by streams, sometimes used in herbal tea.","zh":"Meadowsweet 指一种带甜香的野花，多生长在潮湿草地或溪边，有时也用于花草茶等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall wild plant with clusters of small creamy-white flowers and a sweet smell, often growing in wet meadows and along streams (also used in herbal tea and traditional remedies)","zh":"一种生长在潮湿草地或溪边的高大野生植物，开成簇的乳白色小花，带甜香（也常用于花草茶和传统草药）"},"examples":[{"en":"In early summer, meadowsweet blooms along the riverbanks.","zh":"初夏时，溪河岸边的绣线菊会开花。"},{"en":"She picked a few meadowsweet flowers to dry for herbal tea.","zh":"她摘了些绣线菊的花晾干，用来泡花草茶。"}]}],"synonyms":["Filipendula ulmaria","queen of the meadow"],"phonetic":"/ˈmɛdoʊˌswit/","extraExplanation":["“Meadowsweet”常指欧洲常见的草本植物 Filipendula ulmaria（过去也常被归入 Spiraea 属），中文常译作“绣线菊”（在不同地区与不同植物中文名可能有差异）。","它名字里的 meadow（草地）+ sweet（甜香）来自其生长环境与气味特征。历史上在欧洲民间草药中较常见，也常被用来给饮品或房间增香。"]}
{"word":"meadowwort","summary":{"en":"Meadowwort is a regional/common name for certain meadow wildflowers, often meadowsweet.","zh":"Meadowwort 是某些草地野花的俗名，常指绣线菊草（meadowsweet）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant name used in some regions for certain wildflowers that grow in meadows, especially **meadowsweet** (Filipendula ulmaria) and sometimes similar meadow plants.","zh":"（地区性用法）草本植物名，指生长在草地/牧草地里的某些野花，常特指**绣线菊草（meadowsweet，Filipendula ulmaria）**，有时也泛指外形或生境相近的草地植物。"},"examples":[{"en":"In early summer, meadowwort blooms along the damp edges of the field.","zh":"初夏时，草地边缘潮湿的地方会开出 meadowwort 的花。"},{"en":"The herbal guide lists meadowwort as a traditional wild plant used in teas.","zh":"那本草药指南把 meadowwort 列为传统上可用来泡茶的野生植物。"}]}],"synonyms":["meadowsweet","wildflower","(regional) meadow herb"],"phonetic":"/ˈmɛdoʊˌwɝt/","extraExplanation":["“meadowwort”并不是非常常见或非常固定的标准植物名，在不同地区/不同资料里可能指不同的“草地野花”。阅读自然观察或文学文本时，可以把它先理解为“草地里的一种野花（常见指 meadowsweet）”，如果需要精确辨认，最好结合拉丁学名或图片。"]}
{"word":"meadowy","summary":{"en":"Meadowy means “meadow-like”—grassy, open, and pleasantly pastoral.","zh":"meadowy 表示“像草地一样的”——绿草覆盖、开阔宁静、带有田园气息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a meadow; covered with grass and wild plants, or having the open, peaceful feeling of a meadow.","zh":"像草地一样的；长满青草和野花的，或带有草地那种开阔宁静氛围的。"},"examples":[{"en":"We walked through a meadowy field filled with wildflowers.","zh":"我们穿过一片长满野花、很有草地气息的田野。"},{"en":"The painting has a soft, meadowy look—green, bright, and calm.","zh":"这幅画有一种柔和的草地感——绿色、明亮又宁静。"}]}],"synonyms":["meadowlike","grassy","pastoral","verdant"],"phonetic":"ˈmɛdoʊi","extraExplanation":["“meadowy”由名词 meadow（草地、牧场）加形容词后缀 -y 构成，-y 常表示“充满……的 / 具有……特征的”（如 cloudy 多云的、leafy 多叶的）。","这个词带有比较文学/描写性的风格，常用于写景（自然、田园、诗意的氛围），比简单说 “grassy” 更强调“草地般的感觉”。"]}
{"word":"meads","summary":{"en":"“Meads” usually means (1) honey wine (plural of mead), and in poetic/old English it can also mean (2) grassy meadows.","zh":"“Meads”通常指（1）蜂蜜酒（mead 的复数）；在诗歌或古旧英语中也可指（2）草地/草甸（mead=meadow 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alcoholic drink made by fermenting honey with water (often with fruit or spices); plural of “mead.”","zh":"蜂蜜酒（用蜂蜜加水发酵制成的酒，常会加入水果或香料）；“mead”的复数。"},"examples":[{"en":"They served meads flavored with ginger and berries.","zh":"他们端上了用姜和莓果调味的蜂蜜酒。"},{"en":"In the fantasy novel, warriors celebrate with meads in the great hall.","zh":"在那部奇幻小说里，战士们在大厅里用蜂蜜酒庆祝。"}]},{"partOfSpeech":"n.","definition":{"en":"(Poetic/old use) Meadows or grassy fields; plural of “mead” meaning “meadow.”","zh":"（诗歌/古旧用法）草地，牧场；“mead”（草地/草甸）的复数。"},"examples":[{"en":"Birdsong drifted across the spring meads.","zh":"鸟鸣飘过春日的草地。"},{"en":"They wandered through green meads beside the river.","zh":"他们沿河漫步在绿色的草地间。"}]}],"synonyms":["mead (honey wine)","honey wine","hydromel","meadows (for the poetic sense)","grasslands"],"phonetic":"/mid/","extraExplanation":["“mead（蜂蜜酒）”在欧洲历史很悠久，常出现在北欧/盎格鲁-撒克逊文化与史诗氛围中，比如《贝奥武夫》里有“大厅饮宴”的场景。现代英语里说 mead 更常见；meads 通常是复数（多种/多杯蜂蜜酒）或文学化的“草地复数”。","注意区分：mead（蜂蜜酒） vs. meadow（常用的“草地”）。mead=meadow 这个“草地义”更偏诗意或古风写法。"]}
{"word":"meadsman","summary":{"en":"A meadsman is an old-fashioned word for a meadow worker, especially someone who mows or makes hay.","zh":"meadsman 是较古老的词，指在草甸上劳作的人，尤其是割草、打草做干草的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/poetic) A person who works in or tends meadows (meads), especially someone who mows or makes hay.","zh":"（古体/诗歌用语）在草地（mead＝草甸、牧草地）上劳作的人，尤指割草或打草做干草的人。"},"examples":[{"en":"In the old poem, the meadsman swings his scythe at dawn.","zh":"在那首古老的诗里，割草人清晨挥动着长柄大镰刀。"},{"en":"The meadsman gathered hay before the rain came.","zh":"雨来之前，打草人把干草收拢起来。"}]}],"synonyms":["mower","haymaker","farmhand","field worker"],"phonetic":"/ˈmiːdzmən/","extraExplanation":["“meadsman”由“mead（草甸、牧草地）+ man”构成，现代英语里很少使用，多见于文学或仿古写法。","注意不要和“mead（蜂蜜酒）”混淆；这里的 mead 指“草地/草甸”，不是酒。"]}
{"word":"meadsweet","summary":{"en":"Meadsweet usually means “meadowsweet,” a sweet-scented wildflower.","zh":"Meadsweet通常指“meadowsweet”：一种带甜香的野花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of “meadowsweet,” a wild plant with small white, sweet-smelling flowers (often found in damp meadows and near streams).","zh":"“meadowsweet（绣线菊/沼泽绣线菊）”的异拼写：一种野生植物，开小白花，气味清甜，常见于潮湿草地或溪流边。"},"examples":[{"en":"The riverbank was lined with meadsweet in early summer.","zh":"初夏时，河岸边长满了meadsweet（沼泽绣线菊）。"},{"en":"Some herbal teas include meadsweet for its pleasant fragrance.","zh":"有些花草茶会加入meadsweet，因为它香气怡人。"}]}],"synonyms":["meadowsweet","Filipendula ulmaria"],"phonetic":"/ˈmɛdoʊˌswit/","extraExplanation":["“Meadsweet”在现代英语里不如“meadowsweet”常见，多被视为拼写变体或较旧/地区性的写法。阅读自然文学或植物志时偶尔会遇到。","Meadowsweet（学名 Filipendula ulmaria）在欧洲的传统草药与民俗中较常出现；它的花有甜香味，因此名字里有“sweet”。（注意：草药使用涉及安全与剂量，非专业建议请勿自行用于医疗用途。）"]}
{"word":"meadwort","summary":{"en":"Meadwort is an old word for an herb—especially meadowsweet—used to flavor mead.","zh":"Meadwort 是较古老的说法，指（尤指 meadowsweet）用来给蜂蜜酒增香的草本植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a herb (especially meadowsweet) traditionally used to flavor mead (a honey-based alcoholic drink).","zh":"（尤指“绣线菊/欧洲绣线菊”，即 meadowsweet）一种传统上用来给蜂蜜酒（mead）增香的草本植物。"},"examples":[{"en":"In some old recipes, meadwort is added to give mead a gentle, sweet aroma.","zh":"在一些古老配方里，会加入 meadwort，让蜂蜜酒带有柔和的甜香。"},{"en":"The brewer flavored the drink with honey and a little meadwort.","zh":"酿酒师用蜂蜜和少量 meadwort 给饮品调味。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) meadowsweet itself, the plant associated with this use.","zh":"（旧式用法）指 meadowsweet 这种植物本身（因常用于蜂蜜酒而得名）。"},"examples":[{"en":"The meadow was dotted with meadwort in summer.","zh":"夏天时，草地上点缀着一丛丛的 meadwort。"},{"en":"She gathered meadwort for its fragrance.","zh":"她采了些 meadwort 来取其香气。"}]}],"synonyms":["meadowsweet"],"phonetic":"/ˈmiːdˌwɝːt/","extraExplanation":["“meadwort”是个带有历史感的词：mead 指“蜂蜜酒”，-wort 是古英语/中古英语里常见的“草药、植物”后缀（也见于 St. John’s wort 等）。因此字面意思就是“做蜂蜜酒用的草药”。","在欧洲（尤其是不列颠一带）的传统里，meadowsweet（常被对应为 Filipendula ulmaria）因香气宜人，曾被用于给酒、蜂蜜酒或饮品增香；现代英语里更常直接说 meadowsweet。"]}
{"word":"meager","summary":{"en":"Meager means “not enough” in amount/quality, or “thin and poorly fed.”","zh":"Meager 表示“少得不够用/质量差”，也可指“瘦弱、营养不良”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Small in amount, quality, or degree; not enough (often describing food, money, resources, or results).","zh":"（数量、质量或程度）少得可怜的；不足的（常形容食物、钱、资源或成果）。"},"examples":[{"en":"We had a meager lunch of bread and soup.","zh":"我们午餐很寒酸，只有面包和汤。"},{"en":"His savings were meager, so he couldn’t afford the trip.","zh":"他的积蓄很少，所以负担不起这次旅行。"},{"en":"The team got meager results after months of work.","zh":"团队忙了几个月，成果却很有限。"}]},{"partOfSpeech":"adj.","definition":{"en":"Thin and lacking flesh; not well-fed (describing a person or animal).","zh":"（人或动物）瘦弱的；没什么肉的；营养不良的。"},"examples":[{"en":"The dog looked meager after weeks on the street.","zh":"那只狗在街上流浪了几周，看起来很瘦弱。"},{"en":"He appeared meager in the dim light, as if he hadn’t eaten well in days.","zh":"在昏暗的光线下，他显得很瘦，好像好几天没好好吃饭。"}]}],"synonyms":["scant","sparse","insufficient","paltry","skimpy","thin"],"phonetic":"/ˈmiːɡɚ/","extraExplanation":["“meager”常带有“令人失望、远低于期待”的语气，不只是“少”，还暗示“不够用/不够好”。","同义词对比：\n- “small”中性：a small budget（小预算）\n- “meager”偏负面：a meager budget（少得不够用的预算）\n- “scant”强调“几乎没有、勉强够”：scant evidence（证据不足）\n- “modest”较委婉甚至偏正面：a modest income（不算高但体面）"]}
{"word":"meagerly","summary":{"en":"“Meagerly” means “with very little; in a poor, insufficient, or plain way.”","zh":"“meagerly”表示“微薄地、贫乏地；简朴地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a small, poor, or insufficient way; with very little (money, food, resources, etc.).","zh":"以微薄的方式；贫乏、不足地（指钱、食物、资源等很少）。"},"examples":[{"en":"They lived meagerly after losing their jobs.","zh":"失业后他们过得很拮据。"},{"en":"The family ate meagerly during the winter.","zh":"冬天里这家人吃得很少、很清淡。"},{"en":"Funding was meagerly provided, so the project moved slowly.","zh":"经费给得很少，所以项目进展很慢。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a plain or simple way, with little decoration or comfort.","zh":"简朴地；缺少装饰或舒适条件地。"},"examples":[{"en":"The room was meagerly furnished with a bed and a chair.","zh":"房间里陈设很简陋，只有一张床和一把椅子。"},{"en":"She dressed meagerly, choosing practical clothes over fashion.","zh":"她穿得很朴素，比起时尚更重视实用。"}]}],"synonyms":["sparingly","scantily","barely","poorly","plainly"],"phonetic":"/ˈmiːɡɚli/","extraExplanation":["“meagerly”来自形容词“meager”（贫乏的、微薄的），常用来描述生活条件、食物分量、收入或资源“少得可怜”。语气通常偏消极，带有同情或批评意味。","易混淆点：meagerly（微薄地/简陋地）强调“少”；cheaply（便宜地）强调“花钱少”；poorly（糟糕地/差地）强调“质量差”。"]}
{"word":"meagerness","summary":{"en":"Meagerness means a lack or insufficiency—having too little of something (resources, food, evidence, etc.).","zh":"meagerness 表示“缺乏、不足、贫乏”，强调某物少到不够用或显得寒酸（如资源、食物、证据等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having too little of something; poverty, thinness, or insufficiency","zh":"缺乏、贫乏的状态；（资源、数量、质量等）不足；也可指瘦弱、单薄"},"examples":[{"en":"The meagerness of the harvest worried the farmers.","zh":"收成的贫乏让农民很担心。"},{"en":"She apologized for the meagerness of the meal.","zh":"她为这顿饭的简陋/寒酸而道歉。"},{"en":"The report noted the meagerness of the evidence.","zh":"报告指出证据不足。"}]}],"synonyms":["insufficiency","scarcity","paucity","poverty","thinness"],"phonetic":"/ˈmiːɡərnəs/","extraExplanation":["Meagerness 来自形容词 meager（“贫乏的、少得可怜的”）。它常用在较正式的写作里，强调“少到不够用”或“质量很差”。","常见搭配：the meagerness of + 名词（the meagerness of resources / pay / evidence / results）。","语气对比：scarcity 更偏“稀缺/供应不足”（常用于资源、商品）；poverty 更偏“贫困”（人或社会的经济状态）；meagerness 更强调“少得寒酸、勉强、不令人满意”。"]}
{"word":"meagernesses","summary":{"en":"Meagernesses means multiple instances or aspects of scarcity/insufficiency, or multiple weak/thin qualities.","zh":"Meagernesses 指多方面的匮乏/不足，或多处薄弱、单薄之处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) a lack of enough quantity, resources, or richness; scarcity; insufficiency","zh":"（复数）数量或资源不足；贫乏；匮乏"},"examples":[{"en":"The meagernesses of the relief supplies became obvious after a few days.","zh":"几天后，救援物资的匮乏变得很明显。"},{"en":"They criticized the budget’s meagernesses, especially in education and health.","zh":"他们批评预算的不足之处，尤其是在教育和医疗方面。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) qualities of being thin, weak, or of poor quality; thinness; sparseness","zh":"（复数）瘦弱、单薄或质量不佳的特征；瘦薄；稀疏"},"examples":[{"en":"The novel describes the meagernesses of life during the hard winter.","zh":"这部小说描写了寒冬里生活的单薄与艰难。"},{"en":"The meagernesses of his arguments made the proposal unconvincing.","zh":"他论证的薄弱之处让这个提案缺乏说服力。"}]}],"synonyms":["scarcities","shortages","deficiencies","sparsenesses","insufficiencies"],"phonetic":"/ˈmiɡərnəsɪz/","extraExplanation":["“meagernesses”是名词“meagerness”的复数形式，来自形容词“meager（贫乏的、瘦弱的）”。日常英语里更常用不可数的“meagerness”来泛指“贫乏/不足”，用复数“meagernesses”时，通常是在强调“多种不同方面的不足”或“一个事物里好几处薄弱之处”。"]}
{"word":"meagre","summary":{"en":"Meagre (US: meager) means too little in amount, or very thin in appearance.","zh":"meagre（美式常拼作 meager）指“数量太少、不够”，也可指“人很瘦弱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an amount or supply) too small; not enough.","zh":"（数量或供给）很少的；不足的。"},"examples":[{"en":"They survived on a meagre diet of rice and vegetables.","zh":"他们靠少量的米饭和蔬菜勉强度日。"},{"en":"The charity has only a meagre budget this year.","zh":"这个慈善机构今年的预算很有限。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person’s body or appearance) very thin, often in an unhealthy-looking way.","zh":"（人的身形或外表）瘦弱的；瘦得让人担心的。"},"examples":[{"en":"After the illness, he looked meagre and tired.","zh":"生病之后，他看起来瘦弱而疲惫。"},{"en":"A meagre face stared back from the mirror.","zh":"镜子里映出一张瘦削的脸。"}]}],"synonyms":["meager","scant","sparse","paltry","skimpy","insufficient"],"phonetic":"/ˈmiːɡɚ/","extraExplanation":["“meagre”是英式拼写；美式更常写作“meager”。两者发音与意思相同。","语气上，“meagre/meager”常带有“少得可怜、不够用”的评价色彩；如果只想中性表达“少量”，可以用“small/limited”。","文学与新闻中常见搭配：meagre resources（匮乏的资源）、meagre wages（微薄的工资）、a meagre profit（微薄的利润）。"]}
{"word":"meagrely","summary":{"en":"“Meagrely” means “in a very small or inadequate way; not generously.”","zh":"“meagrely”表示“以很少、很不足的方式；不慷慨地/微薄地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a small, inadequate, or not generous way; scantily.","zh":"以很少的、不足的、不够慷慨的方式；吝啬地/稀少地。"},"examples":[{"en":"The workers were paid meagrely for long hours.","zh":"工人们长时间工作却拿到微薄的工资。"},{"en":"He lived meagrely after losing his job.","zh":"失业后他过得很拮据。"},{"en":"The charity was meagrely funded this year.","zh":"这家慈善机构今年资金很有限。"}]}],"synonyms":["scantily","sparingly","poorly","barely","thinly"],"phonetic":"/ˈmiːɡərli/","extraExplanation":["“meagrely”更常见于英式拼写；美式对应拼写通常是“meagerly”。两者意思相同。","语气上常带有批评或同情：暗示“少得不够用/不公平”，比中性的“a little”更强调不足。","常见搭配：paid meagrely（工资微薄）、live meagrely（生活拮据）、be meagrely funded/resourced（资金/资源不足）。"]}
{"word":"meagreness","summary":{"en":"Meagreness means scarcity or insufficiency—something is too small, too poor, or lacking richness.","zh":"Meagreness 指“贫乏、不足”，强调数量太少、质量太差，或内容不够充实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being small in amount, poor in quality, or not enough; scarcity or inadequacy.","zh":"（数量或质量）不足、贫乏；稀少或不够用。"},"examples":[{"en":"The meagreness of the meal surprised the guests.","zh":"这顿饭的寒酸让客人们很惊讶。"},{"en":"She criticized the meagreness of the evidence.","zh":"她批评证据太薄弱、不充分。"}]},{"partOfSpeech":"n.","definition":{"en":"(In writing or speaking) the quality of lacking richness, detail, or variety; thinness or plainness.","zh":"（文章或表达）缺乏充实与细节；单薄、乏味。"},"examples":[{"en":"Readers noticed the meagreness of his descriptions.","zh":"读者注意到他的描写很单薄。"},{"en":"The report’s meagreness made it hard to make a decision.","zh":"报告内容过于简略，让人很难做决定。"}]}],"synonyms":["scarcity","insufficiency","poverty","thinness","sparseness","inadequacy"],"phonetic":"/ˈmiːɡɚnəs/","extraExplanation":["“meagreness”来自形容词“meagre”（美式拼写常见为“meager”）+ 名词后缀“-ness”。在美式英语里更常看到“meagerness”，两者意思相同，只是拼写差异。","语气上，“meagreness/meagerness”通常带有负面评价，暗示“不仅少，而且不令人满意”。"]}
{"word":"meaht","summary":{"en":"“Meaht” is not a standard spelling; it is most likely a misspelling of “meat,” meaning animal flesh used as food, and by extension the main/important part of something.","zh":"“meaht”不是标准拼写；很可能是把“meat”拼错了，意思是“（食用的）肉”，也可引申为“要点/核心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) the flesh of an animal eaten as food (beef, pork, chicken, etc.).","zh":"（可能想写的单词）肉；（供食用的）动物肌肉（如牛肉、猪肉、鸡肉等）。"},"examples":[{"en":"Do you eat meat, or are you vegetarian?","zh":"你吃肉吗，还是吃素？"},{"en":"This soup has meat and vegetables in it.","zh":"这汤里有肉和蔬菜。"},{"en":"She doesn’t eat red meat.","zh":"她不吃红肉。"}]},{"partOfSpeech":"n.","definition":{"en":"the main or most important part of something (often used in the phrase “the meat of the matter”).","zh":"（比喻）要点；核心部分（常见于短语“the meat of the matter”）。"},"examples":[{"en":"Let’s get to the meat of the matter.","zh":"我们直奔主题吧。"},{"en":"The meat of his argument is that we need more time.","zh":"他论点的核心是我们需要更多时间。"}]}],"synonyms":["flesh","protein","essence","core"],"phonetic":"/mit/","extraExplanation":["“meaht” 不是常见的英文拼写，最可能是把 “meat” 打错了（多了一个 h）。如果你其实想查的是 “meant”（meaning “intended/想要表达的”），告诉我句子我可以帮你确认。"]}
{"word":"meak","summary":{"en":"“Meak” is not standard; it’s usually a misspelling of “meek” (gentle, submissive).","zh":"“meak”不是标准拼写；通常是“meek”（温顺、柔和、可能有点顺从）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually a misspelling of “meek” (or sometimes “weak”).","zh":"不是标准英语单词；通常是“meek”（有时也可能是“weak”）的拼写错误。"},"examples":[{"en":"I think you mean “meek,” not “meak.”","zh":"我觉得你想写的是“meek”，不是“meak”。"},{"en":"If you meant “weak,” it describes someone without much strength or power.","zh":"如果你想写的是“weak”，它表示缺乏力量或能力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Quiet, gentle, and not likely to argue or fight; humble in a way that may seem too submissive.","zh":"温顺、柔和、不爱争辩或对抗；谦卑到可能显得有些逆来顺受。"},"examples":[{"en":"He is a meek person who rarely raises his voice.","zh":"他性格温顺，很少提高嗓门。"},{"en":"She gave a meek smile and said nothing.","zh":"她温和地笑了笑，没有说话。"},{"en":"Don’t confuse being meek with being weak—you can be gentle and still be strong.","zh":"不要把温顺和软弱混为一谈——你可以很温和，但依然很坚强。"}]}],"synonyms":["gentle","mild","humble","submissive","docile"],"phonetic":"/miːk/","extraExplanation":["“meak”在英语里一般不作为正规词使用。最常见的是把“meek”（温顺的）拼错了；发音接近，拼写也容易混淆。","“meek”在文化与文学语境中常带有“谦卑、温和”的色彩，但在某些场景也可能暗示“过于顺从”。比如《圣经》语境里常强调“meek”的美德（温柔、谦卑）。","如果你的意思是“weak”（虚弱的/无力的），它更偏向能力或体力不足；而“meek”描述的是性格与处事方式。"]}
{"word":"meaking","summary":{"en":"“Making” means the process of creating/producing something, or the -ing form of “make.” “Meaking” is usually a misspelling.","zh":"“making”表示“制作/创造的过程”，也可作“make”的-ing形式；“meaking”通常是拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of creating, building, or producing something","zh":"制作；制造；创作的过程"},"examples":[{"en":"Making bread takes time and practice.","zh":"做面包需要时间和练习。"},{"en":"The making of this film took three years.","zh":"这部电影的制作花了三年。"}]},{"partOfSpeech":"adj.","definition":{"en":"creating or producing something (often used before a noun)","zh":"正在制作/生产的（常作定语）"},"examples":[{"en":"a making machine","zh":"一台制造机器"},{"en":"a making process","zh":"生产/制作流程"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “make”: to create, prepare, or cause something to happen","zh":"“make”的现在分词：制作；准备；导致发生"},"examples":[{"en":"She is making dinner right now.","zh":"她现在正在做晚饭。"},{"en":"They’re making plans for the weekend.","zh":"他们正在为周末做计划。"},{"en":"That noise is making me nervous.","zh":"那个噪音让我紧张。"}]}],"synonyms":["creating","producing","building","manufacturing","preparing"],"phonetic":"/ˈmeɪkɪŋ/","extraExplanation":["“meaking”通常不是标准英语单词；很多时候是把“making”（做/制作）拼错了。","拼写提示：making = make + -ing，注意中间没有e（不是“maeking”或“meaking”）。","如果你想表达“温顺的/谦和的”，正确单词是“meek”（不是 meaking）。"]}
{"word":"meal","summary":{"en":"A meal is either a regular time to eat (breakfast/lunch/dinner) or the food eaten at that time.","zh":"meal 指“用餐的一顿/时间”，也可指“这一顿所吃的饭菜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An occasion when people eat food, especially at a regular time (like breakfast, lunch, or dinner).","zh":"一顿饭；用餐时间（通常指早餐、午餐或晚餐等固定时间）。"},"examples":[{"en":"Dinner is the main meal in many families.","zh":"在许多家庭里，晚餐是最重要的一顿饭。"},{"en":"We shared a meal after the meeting.","zh":"会议结束后，我们一起吃了一顿饭。"}]},{"partOfSpeech":"n.","definition":{"en":"The food that is eaten on one occasion.","zh":"一餐所吃的食物；一顿饭的饭菜。"},"examples":[{"en":"That was a delicious meal.","zh":"那是一顿很美味的饭。"},{"en":"He cooked a simple meal of rice and vegetables.","zh":"他做了一顿简单的饭：米饭和蔬菜。"}]}],"synonyms":["breakfast","lunch","dinner","supper","repast"],"phonetic":"/mil/","extraExplanation":["“meal”既可以强调“吃饭这件事/时间”（例如 at mealtimes 用餐时间），也可以强调“这一顿的饭菜”（a hot meal 一顿热饭）。","在美式英语里，常见搭配有：have a meal（吃一顿饭）、skip a meal（不吃一顿）、meal prep（备餐：提前准备几天的饭）。"]}
{"word":"mealable","summary":{"en":"“Mealable” is a rare/nonstandard adjective meaning “suitable to serve as a meal.”","zh":"“mealable”是一个少见/非标准的形容词，意思是“能当作一顿饭的、适合作为一餐的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/nonstandard) Suitable to be eaten as a meal; able to serve as a meal.","zh":"（少见/非标准用法）适合作为一餐来吃的；能当作一顿饭的。"},"examples":[{"en":"After a long hike, even a simple sandwich felt mealable.","zh":"走了很久的徒步之后，连一个简单的三明治都感觉能当一顿饭。"},{"en":"We need something quick but still mealable, not just snacks.","zh":"我们需要快速但还能当一餐的东西，而不只是零食。"}]}],"synonyms":["edible","eatable","fit to eat","substantial"],"phonetic":"ˈmiːləbəl","extraExplanation":["“mealable”在现代英语中非常少见，也不算标准词汇；很多情况下可能是拼写错误或误写。","如果你想表达“可塑的、易改变的”，更常见的词是 **malleable**；如果你想表达“可邮寄的”，是 **mailable**。","在正式写作里，建议用更常见的表达，如 **filling enough to be a meal**（足够顶一顿饭的）、**substantial**（份量足的）。"]}
{"word":"mealberry","summary":{"en":"Mealberry is an uncommon word, usually a regional name for a wild blueberry-like berry with a slightly dry, mealy texture.","zh":"Mealberry 是个不太常见的词，通常是地区性俗称，指一种类似蓝莓的野生浆果，口感可能略干、带粉质感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common name for a wild blueberry-like shrub (often referring to the velvetleaf/Canada blueberry) whose fruit can taste slightly dry or “mealy.”","zh":"一种野生、类似蓝莓的灌木果实的俗名（常指“加拿大蓝莓/绒叶蓝莓”），果肉口感可能略干、带“粉质感”。"},"examples":[{"en":"In late summer, hikers sometimes snack on mealberries along the trail.","zh":"夏末时，徒步者有时会在小径边采食野生的 mealberry（野蓝莓）。"},{"en":"The jam was made from mealberries picked near the lake.","zh":"这果酱是用湖边采到的 mealberry 做的。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally (rare): any small berry with a dry, powdery (“mealy”) texture.","zh":"更泛指（较少见）：任何口感偏干、带粉质（“粉粉的”）的小浆果。"},"examples":[{"en":"Some people avoid mealberries because they prefer juicier berries.","zh":"有些人不太喜欢 mealberry，因为他们更偏好汁水多的浆果。"}]}],"synonyms":["Canada blueberry","velvetleaf blueberry","wild blueberry","huckleberry (regional)"],"phonetic":"/ˈmilˌbɛri/","extraExplanation":["“Meal-”在这里不是“正餐”的意思，而是“像面粉一样的、粉质的（mealy）”。因此 mealberry 指“口感偏粉、偏干的浆果”。","这个词在现代日常英语里不常见，更常见的说法会直接用具体植物名（如 blueberry/huckleberry）或地区性名称；在北美部分地区可能作为野生浆果的俗名出现。"]}
{"word":"mealed","summary":{"en":"“Mealed” usually means dusted or covered with meal/flour (powdery). It can also be a rare past form of “meal” meaning to coat with meal/flour or to grind into meal.","zh":"“mealed”通常表示“沾了粗粉/面粉、呈粉末状的”。它也可作较少见的动词过去式/过去分词，表示“用粗粉/面粉裹上/撒上”或“磨成粗粉”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered or dusted with meal (coarsely ground grain) or flour; powdery","zh":"沾满粗磨谷粉（meal）或面粉的；带粉末状的"},"examples":[{"en":"Her hands were mealed with flour after making bread.","zh":"做完面包后，她的手上沾满了面粉。"},{"en":"The baker’s apron looked mealed and white.","zh":"面包师的围裙看起来沾了粉，白白的。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “meal” (rare): to sprinkle or coat with meal/flour; to make into meal","zh":"“meal”的过去式/过去分词（较少见）：用谷粉/面粉撒上或裹上；（把谷物）磨成粗粉"},"examples":[{"en":"The fish was mealed before being fried.","zh":"鱼在油炸前先裹上了粗粉/面粉。"},{"en":"In older writing, grain may be described as mealed for storage.","zh":"在较老的文字里，谷物有时会被描述为“磨成粗粉后”储存。"}]}],"synonyms":["floured","powdered","dusted","coated"],"phonetic":"/mild/","extraExplanation":["“meal”除了常见的“饭/一餐”，还有一个较老但仍会出现的名词意思：指“粗磨的谷物粉”（如cornmeal 玉米粉）。因此“mealed”多用于描写“沾了粉、呈粉状”的外观。","在现代英语里，“mealed”作为动词形式比较少见；日常更常说“coated/dusted with flour（裹上/撒上面粉）”。"]}
{"word":"mealer","summary":{"en":"Mealer usually means a person or machine that grinds grain into meal; less commonly, it can mean a mealy (starchy) potato good for mashing or baking.","zh":"Mealer通常指把谷物磨成粗粉（meal）的人或机器；较少见时，也可指适合做土豆泥或烘烤的粉糯型（土豆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or machine that grinds grain into meal (coarse flour)","zh":"把谷物磨成粗粉（meal，粗面粉）的人或机器"},"examples":[{"en":"The old mealer turned corn into meal for the village.","zh":"那台老式磨粉机把玉米磨成粗粉，供村里使用。"},{"en":"They repaired the mealer before the harvest season.","zh":"他们在收获季前修好了磨粉机。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a potato or similar food that is mealy and good for mashing or baking","zh":"（不常用）口感粉糯、适合做土豆泥或烘烤的土豆（或类似食物）"},"examples":[{"en":"For creamy mashed potatoes, choose a mealer rather than a waxy potato.","zh":"想做细腻的土豆泥，选粉糯型（土豆）比蜡质型更合适。"},{"en":"This variety is a reliable mealer for baking.","zh":"这种品种很适合烤着吃，口感粉糯。"}]}],"synonyms":["miller","grinder","mill (machine)","starchy potato (for the 2nd sense)"],"phonetic":"/ˈmiːlər/","extraExplanation":["“meal”在这里指“粗面粉/谷物粗粉”，常见于cornmeal（玉米面）、oatmeal（燕麦片/燕麦粥）等词中；因此“mealer”就是“把谷物磨成meal的人或设备”。","第二义与形容词“mealy”（粉质的、干松的）有关：英式/烹饪语境里有时会用“mealer”指“粉糯型土豆”，但在日常英语中更常直接说“a mealy potato”或“starchy potato”。"]}
{"word":"mealie","summary":{"en":"“Mealie” is a regional (especially South African) word for maize/corn, and it can also refer to food made from ground maize (often “mealie meal”).","zh":"“mealie”是地区用语（尤指南非），表示“玉米”，也可指由玉米磨成粉制作的食物（常见于“mealie meal”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"maize; corn (especially in South Africa and some other parts of southern Africa).","zh":"玉米；玉蜀黍（尤指南非及南部非洲一些地区的用法）。"},"examples":[{"en":"In South Africa, people often call corn “mealie.”","zh":"在南非，人们常把玉米称为“mealie”。"},{"en":"The farmer grew mealies on a small plot of land.","zh":"那位农民在一小块地里种了玉米。"}]},{"partOfSpeech":"n.","definition":{"en":"food made from ground maize (often in the phrase “mealie meal”).","zh":"玉米粉制成的食物（常见于短语“mealie meal”，指玉米粉/玉米粉主食）。"},"examples":[{"en":"They cooked porridge using mealie meal.","zh":"他们用玉米粉煮了粥。"},{"en":"Mealie meal is a common staple in many homes.","zh":"玉米粉在许多家庭里是很常见的主食。"}]}],"synonyms":["maize","corn","cornmeal (in some contexts)"],"phonetic":"/ˈmiːli/","extraExplanation":["“mealie”主要是地区词（regional term），在美式英语里更常说“corn”或“maize”。在南非英语中，“mealies”常用复数来泛指玉米作物或玉米棒。","常见搭配：mealie meal（玉米粉）、mealie pap（用玉米粉做的粥/糊状主食，具体叫法因地区而异）。"]}
{"word":"mealier","summary":{"en":"Mealier means “more mealy”: more dry, powdery, and grainy in texture (often about food), and sometimes figuratively more vague or weak in substance.","zh":"mealier 意为“更粉/更面”：口感更干、粉、沙（常形容食物），也可引申为内容更空泛或表态更含糊。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of mealy) Having a more dry, powdery, grainy texture—like flour or meal; sometimes used for foods such as potatoes or apples.","zh":"（mealy 的比较级）更“粉”的；更干、松散、有颗粒感的（像面粉/粗粉一样），常用来形容土豆、苹果等食物的口感。"},"examples":[{"en":"These potatoes are mealier than the ones we bought last week.","zh":"这些土豆比我们上周买的更粉一些。"},{"en":"Older apples can get mealier and less juicy.","zh":"放久的苹果可能会更粉，汁水也更少。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) More bland, weak, or lacking clear substance; sometimes related to “mealy-mouthed” (not speaking plainly).","zh":"（比喻）更空泛、更软弱无力、缺乏明确内容的；有时与“mealy-mouthed（说话含糊、不直说）”的语感相关。"},"examples":[{"en":"His apology sounded mealier than before—lots of words, not much responsibility.","zh":"他的道歉听起来比之前更空泛——话很多，但几乎不承担责任。"},{"en":"The statement became mealier after the company faced criticism.","zh":"公司遭到批评后，这份声明变得更含糊、更软。"}]}],"synonyms":["more powdery","more grainy","drier","more starchy","more bland","more vague"],"phonetic":"ˈmiːliər","extraExplanation":["“mealier”来自形容词“mealy”（像“meal/粗粉、谷粉”一样的）。在食物里多指“粉、面、干、沙”的口感：比如粉土豆通常适合做土豆泥；而多汁脆爽的苹果则相反，不希望变“mealy/mealier”。","比喻用法不如字面常见，常借“mealy-mouthed（说话不直截了当）”的感觉来表达“说得软、含糊、没实质”。"]}
{"word":"mealies","summary":{"en":"Mealies means maize/corn in South African English.","zh":"mealies 在南非英语中指“玉米”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, informal) Maize/corn; the ears or kernels of maize used as food or feed.","zh":"（南非英语，非正式）玉米；指玉米棒或玉米粒，可作食物或饲料。"},"examples":[{"en":"We bought fresh mealies from the roadside stall.","zh":"我们在路边摊买了新鲜的玉米。"},{"en":"The farmers planted mealies after the first good rains.","zh":"第一场好雨之后，农民就开始种玉米了。"},{"en":"She cooked mealie pap to go with the stew.","zh":"她煮了玉米粥来配炖菜。"}]}],"synonyms":["maize","corn"],"phonetic":"/ˈmiːliz/","extraExplanation":["“mealies”主要见于南非及周边地区的英语口语中，是“mielies”的英语拼写形式；“mielies”来自南非荷兰语/南非语（Afrikaans）对“玉米”的称呼。","在南非文化语境里，“mealies”常和食物“mealie pap”（玉米粥/玉米糊）一起出现，是很常见的主食搭配。阅读南非题材小说或纪实作品时，这个词常用来营造本土生活气息。"]}
{"word":"mealiest","summary":{"en":"“Mealiest” means “the most mealy”: extremely dry, grainy, and crumbly in texture, especially about food.","zh":"“mealiest”表示“最粉、最干松、颗粒感最强”的口感，多用于形容食物（尤其土豆等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “mealy”: having the most dry, soft, grainy, or crumbly texture (often used for cooked foods like potatoes, apples, or pears).","zh":"“mealy”的最高级：质地最“粉、干、松、带颗粒感”的（常形容煮熟的土豆，或水果如苹果、梨）。"},"examples":[{"en":"Of all the potatoes we tried, the russet was the mealiest and best for mashing.","zh":"在我们试过的土豆里，褐皮土豆（russet）最粉最松，最适合做土豆泥。"},{"en":"The mealiest apples can taste a bit dry instead of crisp and juicy.","zh":"最“粉”的苹果吃起来可能会偏干，而不是脆、汁水多。"}]}],"synonyms":["most mealy","driest","grainiest","crumbliest"],"phonetic":"/ˈmiːliəst/","extraExplanation":["在食物语境里，mealy 常用来描述“粉、松、易碎”的口感：比如 russet（土豆）煮熟后会变得很粉，适合做土豆泥；而 waxy potatoes（蜡质土豆，如 Yukon Gold、红皮土豆）更紧实，适合炖煮或沙拉。mealiest 就是“最粉/最松散”的意思。","注意别和 mealy-mouthed（说话含糊、态度不够坦率）混淆；mealiest 通常只用于口感/质地，不常用于形容人。"]}
{"word":"mealily","summary":{"en":"“Mealily” means (1) in a powdery, flour-like way, or (2) in a weak, indirect way of speaking.","zh":"“Mealily”可指（1）粉状、松散的口感或状态，也可指（2）说话软弱含糊、拐弯抹角。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a mealy or powdery way (like flour or fine grains); not firm or clear.","zh":"以粉状、颗粒细碎（像面粉）或松散的方式；不够紧实、清晰。"},"examples":[{"en":"The apple tasted mealily, so I didn’t finish it.","zh":"这个苹果吃起来粉粉的，所以我没吃完。"},{"en":"The potatoes broke down mealily instead of staying firm.","zh":"这些土豆煮着煮着就变得粉散了，没有保持紧实。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an indirect, weak, or over-cautious way (often describing how someone speaks or responds).","zh":"拐弯抹角、软弱或过分谨慎地（常形容说话或回应方式）。"},"examples":[{"en":"He answered mealily, trying not to upset anyone.","zh":"他回答得很含糊小心，想避免得罪任何人。"},{"en":"Instead of giving a clear opinion, she spoke mealily about “different perspectives.”","zh":"她没有明确表态，而是含糊其辞地谈“不同视角”。"}]}],"synonyms":["powderily","softly","vaguely","evasively"],"phonetic":"/ˈmiːlɪli/","extraExplanation":["“mealily”来自形容词“mealy”，本义与“meal（粗磨的粉、谷粉）”有关，所以常用来形容水果（如苹果）口感“粉粉的、干松的”。","引申义常和“mealy-mouthed（说话含糊、吞吞吐吐）”的语气相关：不是直接说清楚，而是为了不得罪人而说得软、绕。日常写作里更常见的是用“mealy-mouthed”来形容人，用“mealy”来形容食物口感。"]}
{"word":"mealiness","summary":{"en":"Mealiness means a dry, crumbly texture (often in food) or, figuratively, a dull and weak quality in style or expression.","zh":"Mealiness 指食物“粉/沙、干松易碎”的口感；也可比喻表达或风格乏味、无力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being mealy—having a soft, dry, crumbly texture (often said of fruit, potatoes, etc.).","zh":"“粉质/沙”的特性：口感松散、干干的、易碎（常形容水果、土豆等）。"},"examples":[{"en":"The apple’s mealiness made it unpleasant to eat.","zh":"这个苹果口感发沙（粉粉的），吃起来不太舒服。"},{"en":"Overcooking can increase the mealiness of potatoes.","zh":"煮得太久会让土豆更粉、更干、更松散。"}]},{"partOfSpeech":"n.","definition":{"en":"A figurative quality of being dull, weak, or lacking crispness and energy (especially in writing, speech, or style).","zh":"（比喻）乏味、无力、缺少“劲儿”或鲜明感（常形容文章、讲话、风格）。"},"examples":[{"en":"The essay was clear but had a certain mealiness in its style.","zh":"这篇文章很清楚，但风格有点乏味、缺少力度。"},{"en":"The dialogue avoids mealiness by using vivid verbs and concrete details.","zh":"对话通过生动的动词和具体细节避免了乏味感。"}]}],"synonyms":["graininess","dryness","crumbly texture","dullness","flatness"],"phonetic":"/ˈmiːlinəs/","extraExplanation":["mealiness 来自形容词 mealy（像面粉一样的、粉质的）。在食物语境里，它通常是负面评价，尤其形容水果不新鲜或保存不当导致口感“发沙”。","比喻用法里，mealiness 常和 lack of punch（缺少冲击力/力度）、dullness（乏味）意思接近；注意它不等于“含糊其辞”的 mealy-mouthed（说话拐弯抹角、言辞软弱）。"]}
{"word":"mealing","summary":{"en":"“Mealing” is uncommon in modern English. It can mean eating meals (rare), or in Scottish/dialect use it can mean grain meal/flour; it can also mean “mealy/powdery” in older usage.","zh":"“mealing”在现代英语中较少见：可指“用餐/吃饭”（较少用），也可在苏格兰/方言中指“谷粉/粗磨面粉”，旧用法里还可表示“粉状的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of eating meals; having meals (present participle of “meal,” a rare verb).","zh":"吃饭；用餐（“meal”作动词时的现在分词，用法较少见）。"},"examples":[{"en":"After a long hike, we were mealing happily at a small café.","zh":"长途徒步后，我们在一家小咖啡馆里开心地用餐。"},{"en":"In old-style writing, you may see “mealing” used to mean eating regularly.","zh":"在较旧的写法里，你可能会看到“mealing”用来表示规律地吃饭。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish / dialect) ground grain, especially oatmeal; “meal” as a flour-like food ingredient.","zh":"（苏格兰/方言）谷物粉，尤指燕麦粉；相当于“meal（谷粉）”。"},"examples":[{"en":"The recipe calls for mealing (oatmeal) to thicken the soup.","zh":"这个食谱需要加入燕麦粉来让汤变稠。"},{"en":"In some dialects, “mealing” can mean a bag of meal/flour.","zh":"在一些方言里，“mealing”也可指一袋谷粉/面粉。"}]},{"partOfSpeech":"adj.","definition":{"en":"(archaic) mealy; covered with or like fine powder.","zh":"（古义）粉状的；带粉末的（类似 mealy）。"},"examples":[{"en":"The surface looked mealing, as if dusted with flour.","zh":"表面看起来粉粉的，好像撒了面粉一样。"}]}],"synonyms":["eating","having a meal","meal (flour)","oatmeal","mealy","powdery"],"phonetic":"/ˈmiːlɪŋ/","extraExplanation":["“meal”在英语里常见意思是“餐”；但它也有“谷粉/粗磨面粉”（如 oatmeal）的意思。由此派生的“mealing”在现代英语中并不常用，更可能在苏格兰英语、方言或旧文本里出现。","现代日常表达里，如果你想说“用餐/吃饭”，通常用 “eating (a meal)” 或 “having a meal”；如果想说“粉状的”，更常用 “mealy” 或 “powdery”。"]}
{"word":"mealless","summary":{"en":"“Mealless” means “without meals,” but it’s rare; if you mean “without meat,” use “meatless.”","zh":"“mealless”指“没有饭吃/不吃正餐”，但很少用；若想表达“无肉/素食”，应使用“meatless”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having no meals; without eating meals (rare; usually written as “meal-less”).","zh":"没有饭吃的；不吃正餐的（较少见，常写作“meal-less”）。"},"examples":[{"en":"After a long delay, we spent a mealless day at the airport.","zh":"因为长时间延误，我们在机场度过了没吃上饭的一天。"},{"en":"He went to bed mealless and exhausted.","zh":"他没吃饭就上床睡了，筋疲力尽。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often confused) If you mean “without meat,” the correct word is “meatless.”","zh":"（常见混淆）如果你想表达“没有肉的/素食的”，正确拼写是“meatless”。"},"examples":[{"en":"Many restaurants offer meatless options like tofu or vegetable burgers.","zh":"很多餐厅提供无肉选择，比如豆腐或蔬菜汉堡。"},{"en":"She chose a meatless meal on Mondays.","zh":"她在周一选择素食餐。"}]}],"synonyms":["without a meal","hungry","unfed","meal-less"],"phonetic":"/ˈmiləs/","extraExplanation":["“mealless”在现代英语中不常见；更自然的表达通常是“without a meal / without eating / skipping meals”。","如果你在菜单、饮食或宗教/环保语境里想说“无肉”，几乎一定要用“meatless”，比如“meatless dish / meatless diet”。"]}
{"word":"mealman","summary":{"en":"“Mealman” is rare; it can mean a person who delivers meals, but it’s often a misspelling of “mailman.”","zh":"“mealman”较少见；可指送餐的人，但也常被误写为“mailman”（邮递员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Informal) A person who brings or delivers meals, especially to homes, offices, or people who can’t cook for themselves.","zh":"（少见/非正式）送餐员；送饭的人，尤指把餐食送到家里、办公室或需要照护的人那里。"},"examples":[{"en":"The mealman delivered hot lunches to the seniors every weekday.","zh":"那位送餐员每个工作日都会给老人们送热午餐。"},{"en":"We hired a mealman to drop off dinners during the busy season.","zh":"在最忙的那段时间，我们请人每天把晚餐送来。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling of “mailman” (a postal worker who delivers mail).","zh":"“mailman”（邮递员）的常见拼写错误。"},"examples":[{"en":"If you mean the person who brings letters, the correct spelling is “mailman.”","zh":"如果你指送信的人，正确拼写是“mailman”。"}]}],"synonyms":["food delivery person","delivery driver","courier"],"phonetic":"/ˈmilˌmæn/","extraExplanation":["“mealman”不是常见标准词汇，更多时候是临时造词（meal + man）或口语用法。正式表达“送餐员”更常用：delivery driver、food delivery worker、courier、meal delivery person。","由于“mealman”和“mailman”读写相近，学习者容易混淆：meal=餐；mail=邮件。语境里出现letters、packages、post office时通常应为mailman。"]}
{"word":"mealmen","summary":{"en":"“Mealmen” is a rare plural meaning sellers of ground grain (“meal”), and it is also commonly a misspelling of “mailmen.”","zh":"“mealmen”较少见，可指售卖谷物粗粉（meal）的人（复数），也常被误拼用来指“mailmen”（邮递员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “mealman”) A person who sells or delivers meal (ground grain, like cornmeal or oatmeal); an old-fashioned/rare word.","zh":"（“mealman”的复数）售卖或配送“meal”（谷物磨成的粗粉，如玉米粉、燕麦粉等）的人；较古旧、少见的用法。"},"examples":[{"en":"In older British texts, mealmen supplied oatmeal to local households.","zh":"在较早的英国文本里，mealmen 会向当地家庭供应燕麦粉。"},{"en":"The village relied on mealmen for flour and other ground grains.","zh":"村子里依靠 mealmen 提供面粉和其他磨碎的谷物。"}]},{"partOfSpeech":"n.","definition":{"en":"Often a misspelling of “mailmen” (postal workers).","zh":"常见的误拼，可能想写的是“mailmen”（邮递员/邮差）。"},"examples":[{"en":"If you mean postal workers, write: “The mailmen deliver letters every morning.”","zh":"如果你指邮递员，应写：The mailmen deliver letters every morning.（邮递员每天早上送信。）"},{"en":"Many people type “mealmen” when they actually mean “mailmen.”","zh":"很多人打出“mealmen”，其实想写的是“mailmen”。"}]}],"synonyms":["(rare) flour merchants","(rare) grain dealers","(intended) mailmen","postal workers"],"phonetic":"ˈmiːlˌmɛn","extraExplanation":["“mealman/mealmen”在现代英语里非常少见，更常见的是“miller”（磨坊主）或“flour merchant”（面粉商）。","容易混淆点：meal /miːl/（谷物粗粉、或“一餐”）与 mail /meɪl/（邮件）拼写相近，因此“mealmen”常被当作“mailmen”的拼写错误。","如果你想表达“吃饭的人/用餐者”，更自然的说法是“diners”或“people eating a meal”，而不是“mealmen”。"]}
{"word":"mealmonger","summary":{"en":"A rare word meaning a person who sells or supplies meals (and sometimes, very rarely, flour/meal).","zh":"一个罕见词，指卖饭或供餐的人；极少情况下也可指卖面粉/谷粉的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, often humorous or critical) A person who sells or supplies meals (food), especially for profit.","zh":"（罕见，常带幽默或批评意味）卖饭菜、提供餐食以牟利的人；餐食商贩。"},"examples":[{"en":"In the old story, the traveler paid a mealmonger for a bowl of stew.","zh":"在那则旧故事里，旅人付钱给一个卖饭的商贩买了一碗炖汤。"},{"en":"He complained that the town was full of mealmongers who overcharged hungry workers.","zh":"他抱怨镇上到处都是宰客的卖饭人，专门向饥饿的工人多收费。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) A dealer in meal (ground grain or flour).","zh":"（极罕见）卖谷粉、面粉等“meal（谷粉）”的人。"},"examples":[{"en":"A local mealmonger sold barley meal at the market.","zh":"当地一个卖谷粉的人在集市上卖大麦粉。"}]}],"synonyms":["food vendor","caterer","meal provider","purveyor"],"phonetic":"/ˈmiːlˌmʌŋɡɚ/","extraExplanation":["“monger”在英语里常指“商贩/贩卖者”，有时带贬义或讽刺色彩（如 fishmonger 卖鱼的，warmonger 好战者）。因此 mealmonger 听起来略带“唯利是图的卖饭人”的感觉。","这个词在现代英语里非常少见；日常更常用的说法是 food vendor（小吃摊/餐食摊贩）、caterer（餐饮供应商）、meal provider（供餐者）。"]}
{"word":"mealmouth","summary":{"en":"Mealy-mouthed means speaking in an indirect, evasive way instead of being clear and honest.","zh":"Mealy-mouthed 指说话不坦率、不直接，含糊其辞、闪烁其词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or their speech) not speaking plainly or directly, often to avoid offending someone or to hide the truth; evasive.","zh":"（形容人或说话方式）说话不直截了当的，含糊其辞的，常为避免冒犯或掩饰真实想法而闪烁其词。"},"examples":[{"en":"The spokesperson gave a mealy-mouthed answer instead of explaining what really happened.","zh":"发言人没有解释真正发生了什么，而是给了一个含糊其辞的回答。"},{"en":"Don’t be mealy-mouthed—just tell me yes or no.","zh":"别吞吞吐吐的——直接告诉我是或不是。"},{"en":"Her apology sounded mealy-mouthed and didn’t take responsibility.","zh":"她的道歉听起来很敷衍、很含糊，并没有承担责任。"}]}],"synonyms":["evasive","indirect","noncommittal","wishy-washy","guarded","equivocal"],"phonetic":"/ˌmiːliˈmaʊðd/","extraExplanation":["常见拼写是 **mealy-mouthed**（也可写作 *mealy mouthed*）。你输入的 **mealmouth** 多半是误拼或少见变体。","词源上 *mealy* 原意是“像面粉一样的、粉状的”，引申为“软弱无力、缺乏力度”。*mealy-mouthed* 形象地表示“嘴里像含着面粉一样，说不清楚、不干脆”。"]}
{"word":"mealmouthed","summary":{"en":"Mealy-mouthed means speaking in a deliberately unclear, indirect way (often to avoid offense or responsibility).","zh":"Mealy-mouthed 指故意说得不清不楚、拐弯抹角（常为避免得罪人或推卸责任）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or their speech) not speaking clearly or directly, often to avoid offending people or to hide the truth.","zh":"（指人或言语）说话含糊、拐弯抹角，常为了避免得罪人或掩饰真实想法。"},"examples":[{"en":"The spokesperson gave a mealy-mouthed answer instead of admitting the mistake.","zh":"发言人没有承认错误，而是给了一个含糊其辞的回答。"},{"en":"I’m tired of mealy-mouthed promises—tell us your plan clearly.","zh":"我厌倦了含糊的承诺——把你的计划讲清楚。"}]}],"synonyms":["evasive","equivocal","indirect","noncommittal","wishy-washy"],"phonetic":"/ˈmiːliˌmaʊðd/","extraExplanation":["常见拼写是 **mealy-mouthed**（也写作 mealy mouthed），你输入的 *mealmouthed* 多半是拼写错误。","词源上 *mealy* 有“像面粉一样”的意思；*mealy-mouthed* 形象地暗示“嘴里像塞了粉，话说不清/不直白”。","语气通常偏负面，常用来批评政治人物、公关发言、或在敏感话题上故意模糊立场的说法。"]}
{"word":"mealock","summary":{"en":"“Mealock” is likely a misspelling of “Maalox,” an antacid used for heartburn and indigestion.","zh":"“mealock”很可能是“Maalox”的误拼；Maalox是一种用于缓解烧心和消化不良的抗酸药。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Often written “Maalox”) a brand of antacid medicine used to relieve heartburn, acid indigestion, and upset stomach.","zh":"（常写作“Maalox”）一种抗酸药品牌，用于缓解胃灼热（烧心）、胃酸过多/消化不良和胃部不适。"},"examples":[{"en":"I took some Maalox after dinner because I had heartburn.","zh":"晚饭后我烧心了，所以吃了点Maalox。"},{"en":"The pharmacist suggested an antacid like Maalox for quick relief.","zh":"药师建议用像Maalox这样的抗酸药来快速缓解。"}]}],"synonyms":["antacid","acid reducer","stomach medicine"],"phonetic":"/ˈmeɪlɑks/","extraExplanation":["你输入的“mealock”在英语里不算常见标准拼写；更常见的是药品品牌名 **Maalox**（读音接近“MAY-loks”）。如果你想找的是别的词（例如“meal lock / meal-lock”之类的组合词），可以告诉我你看到它的句子或场景，我可以帮你精准判断。","**Maalox** 通常指含有氢氧化铝、氢氧化镁等成分的抗酸剂（不同地区配方可能不同），日常口语里会把它当作“抗酸药/胃药”的代称之一。"]}
{"word":"mealproof","summary":{"en":"Mealproof (usually “meal-proof”) is an uncommon adjective meaning resistant to mess or stains from eating.","zh":"Mealproof（多写作 meal-proof）是不常见的形容词，指用餐时不易被弄脏、抗污耐脏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon; usually written with a hyphen) Resistant to damage, mess, or staining caused by eating a meal (food spills, sauce, grease, etc.).","zh":"（不常见，通常写作 meal-proof）指能防止用餐时造成的弄脏或损坏（如食物洒落、酱汁、油渍等）。"},"examples":[{"en":"Choose a meal-proof tablecloth if you have kids.","zh":"如果家里有小孩，可以选一块“防用餐弄脏”的桌布。"},{"en":"These pants aren’t meal-proof—one drop of sauce shows immediately.","zh":"这条裤子不“防用餐弄脏”——一点酱汁滴上去就很明显。"}]}],"synonyms":["spillproof","stain-resistant","stainproof"],"phonetic":"/ˈmilˌpruf/","extraExplanation":["“mealproof / meal-proof”不是常见标准词，更自然的说法通常是 spillproof（防洒/防溅）、stain-resistant（抗污）、stainproof（防污）。例如：spillproof cup（防洒杯）、stain-resistant fabric（抗污面料）。","如果你原本想表达的是“备餐”，常用词是 meal prep（备餐/餐食预先准备），如：I do meal prep on Sundays.（我周日会备餐。）"]}
{"word":"meals","summary":{"en":"“Meals” is the plural of “meal,” meaning occasions of eating (breakfast/lunch/dinner) or the food eaten at one time.","zh":"“meals”是“meal”的复数，指多顿饭（早餐/午餐/晚餐等）或指一次用餐所吃的食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food that is prepared and eaten at a particular time (for example, breakfast, lunch, or dinner).","zh":"在特定时间准备并食用的一顿饭（如早餐、午餐或晚餐）。"},"examples":[{"en":"We have three meals a day: breakfast, lunch, and dinner.","zh":"我们一天吃三顿饭：早餐、午餐和晚餐。"},{"en":"School meals are provided for students who need them.","zh":"学校为有需要的学生提供校餐。"}]},{"partOfSpeech":"n.","definition":{"en":"The food served or eaten at one time (a specific occasion of eating).","zh":"一顿饭所吃/供应的食物（指某次用餐的内容）。"},"examples":[{"en":"That was a delicious meal.","zh":"那顿饭非常美味。"},{"en":"I cooked a simple meal for my family.","zh":"我给家人做了一顿简单的饭。"}]}],"synonyms":["dinners","lunches","breakfasts","food (general)"],"phonetic":"/milz/","extraExplanation":["“Meal”既可以指“用餐的时间/一餐”（countable），也可以指“一顿饭的内容/菜肴组合”（countable）。\n常见搭配：have a meal（吃一顿饭）、skip a meal（不吃一顿）、a light/heavy meal（清淡/丰盛的一餐）、home-cooked meal（家常饭）。\n相关词：mealtime（用餐时间）、meal plan（餐食计划/配餐方案）。"]}
{"word":"mealtide","summary":{"en":"Mealtide means a usual time for eating a meal; it can also (less commonly) mean the meal itself, in a literary or old-fashioned style.","zh":"Mealtide 指固定的用餐时段；较少见时也可指“一顿饭”，语气更偏文学或旧式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A regular time of day when people usually eat a meal (such as breakfast, lunch, or dinner).","zh":"用餐时间；吃饭的固定时段（如早餐、午餐或晚餐）。"},"examples":[{"en":"At mealtide, the whole family sat down together.","zh":"到用餐时间，全家人都会一起坐下来吃饭。"},{"en":"The restaurant gets busiest around the evening mealtide.","zh":"餐厅在傍晚用餐时段最忙。"}]},{"partOfSpeech":"n.","definition":{"en":"Food served for a meal; a mealtime meal (less common; often literary/old-fashioned).","zh":"（较少见，偏文学/旧式）一顿饭；一餐的食物。"},"examples":[{"en":"After the long journey, a warm mealtide awaited them.","zh":"长途跋涉后，一顿热乎的饭在等着他们。"}]}],"synonyms":["mealtime","dinnertime","lunchtime","feeding time"],"phonetic":"/ˈmiːlˌtaɪd/","extraExplanation":["“mealtide”由 meal（餐）+ tide（时段、时令）构成，tide 在古英语/中古英语里常有“时间、季节、时机”的意思（如 Christmastide＝圣诞节期间）。因此 mealtide 带一点传统、叙事或文学色彩。","现代日常英语里更常说 mealtime（用餐时间）或 lunch/dinner time。你会在描写乡村生活、家庭传统或较古典的叙事文本中更容易看到 mealtide。"]}
{"word":"mealtime","summary":{"en":"Mealtime means the usual time when people eat a meal.","zh":"Mealtime 指人们通常吃饭的时间（饭点/用餐时间）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the usual time when people eat a meal (such as breakfast, lunch, or dinner)","zh":"吃饭的时间；用餐时间（如早餐、午餐或晚餐的时间）"},"examples":[{"en":"What time is mealtime at your house?","zh":"你们家一般几点吃饭？"},{"en":"The kids wash their hands before mealtime.","zh":"孩子们在开饭前会洗手。"},{"en":"In many families, mealtime is a chance to talk about the day.","zh":"在很多家庭里，用餐时间是聊聊一天情况的机会。"}]}],"synonyms":["dinnertime","lunchtime","breakfast time","meal time"],"phonetic":"/ˈmiːl.taɪm/","extraExplanation":["“mealtime”常用作不可数名词，强调“固定/惯常的吃饭时间”（例如家庭作息或学校作息中的饭点）。如果你想表达“某一顿饭”，通常说“a meal”（如：I had a quick meal）。","搭配很常见：mealtime routine（用餐常规）、mealtime conversation（餐桌聊天）、mealtime manners（餐桌礼仪）。在育儿或学校语境里也常出现，如：mealtime rules（用餐规则）。"]}
{"word":"mealtimes","summary":{"en":"Mealtimes are the regular times of day when people eat meals.","zh":"Mealtimes 指一天中规律吃饭的时间段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the regular times of day when people eat meals (such as breakfast, lunch, and dinner)","zh":"用餐时间；一天中人们规律进食的时间（如早餐、午餐、晚餐）"},"examples":[{"en":"Our school has fixed mealtimes: lunch is at 12:10.","zh":"我们学校的用餐时间是固定的：午餐在12:10。"},{"en":"Try not to snack too much between mealtimes.","zh":"尽量不要在两餐之间吃太多零食。"}]}],"synonyms":["meal times","eating times"],"phonetic":"/ˈmiːltaɪmz/","extraExplanation":["“Mealtimes”通常用复数，强调“一天里有好几个固定的吃饭时段”。在家庭、学校、医院、监狱、军队等有规律作息的场景里很常见。","相关常见搭配：regular/fixed mealtimes（规律/固定的用餐时间），between mealtimes（两餐之间），at mealtimes（在用餐时）。","英美文化里，“dinner”在多数情况下指晚上那顿正餐；但在某些地区或家庭里也可能指中午的正餐，因此谈“mealtimes”时常会结合具体时间说明。"]}
{"word":"mealworm","summary":{"en":"A mealworm is the larva of a darkling beetle, commonly used as pet food and sometimes eaten as a protein source.","zh":"mealworm 指暗黑甲虫的幼虫（黄粉虫），常用作宠物饲料，也有时作为蛋白质来源供人食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small yellowish-brown larva (baby form) of the darkling beetle, often used as food for pets and sometimes eaten by people as an insect protein","zh":"黄粉虫（暗黑甲虫的幼虫），常用作宠物饲料，也有时作为人类食用的昆虫蛋白来源"},"examples":[{"en":"I bought mealworms to feed my pet lizard.","zh":"我买了黄粉虫来喂我的宠物蜥蜴。"},{"en":"Bird owners often keep dried mealworms for a quick treat.","zh":"养鸟的人常备干黄粉虫当作快速零食。"},{"en":"Some companies make snacks using mealworm flour for extra protein.","zh":"有些公司用黄粉虫粉做零食来增加蛋白质。"}]}],"synonyms":["yellow mealworm","tenebrio larva","insect larva"],"phonetic":"/ˈmiːlˌwɝːm/","extraExplanation":["“Mealworm”里的 meal 指“谷物/粗粉（如面粉、麦麸）”，不是“一顿饭”。之所以叫这个名字，是因为它们常出现在面粉、谷物等储藏食品里。","在食品与环保话题中，mealworms 常被提到作为“可持续蛋白质”来源；在宠物饲养圈里则更常见（爬宠、鸟类、鱼等）。","相关词：darkling beetle（暗黑甲虫，成虫）；larva（幼虫）；dried/freeze-dried mealworms（干/冻干黄粉虫）；mealworm farm（黄粉虫养殖场）。"]}
{"word":"mealworms","summary":{"en":"Mealworms are beetle larvae commonly used as animal feed and sometimes as human food.","zh":"mealworms 指黑甲虫科昆虫的幼虫（黄粉虫），常用于喂宠物和鸟类，有时也可供人食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a larva (young stage) of a darkling beetle, commonly raised as food for birds, reptiles, fish, and sometimes humans","zh":"黄粉虫（黑甲虫科昆虫的幼虫），常被饲养用作鸟类、爬行动物、鱼类的饲料，有时也供人食用"},"examples":[{"en":"I bought mealworms to feed my pet gecko.","zh":"我买了黄粉虫来喂我的壁虎。"},{"en":"Many bird owners keep dried mealworms for winter feeding.","zh":"很多养鸟的人会储备干黄粉虫在冬天喂鸟。"},{"en":"Some farms raise mealworms as a sustainable protein source.","zh":"一些农场饲养黄粉虫作为更可持续的蛋白质来源。"}]}],"synonyms":["beetle larvae","Tenebrio larvae","yellow mealworms"],"phonetic":"/ˈmiːlˌwɝːmz/","extraExplanation":["“Mealworm”这个名字来自它们常出现在谷物、面粉（meal）等储藏食物附近；但“worm”在这里是俗称，它们并不是真正的“蠕虫”，而是甲虫的幼虫。","在宠物饲养语境中常见搭配有：live mealworms（活体黄粉虫）、dried mealworms（干黄粉虫）、mealworm bedding（饲养基质）。在食品语境中可能会看到：mealworm flour/powder（黄粉虫粉）。"]}
{"word":"mealy","summary":{"en":"Mealy means “dry and grainy like flour” (especially food), and it can also describe weak, insincere-sounding speech.","zh":"Mealy 常指食物“干、发粉、颗粒感重”，也可形容言语“软弱无力、客套不真诚”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of food) having a dry, grainy, floury texture that breaks into small particles; not smooth or juicy.","zh":"（食物）口感干、粉、带颗粒感的；不细腻、不多汁。"},"examples":[{"en":"The apple was mealy, not crisp and sweet.","zh":"这个苹果口感发粉，不脆也不甜。"},{"en":"Overcooked potatoes can turn mealy and unpleasant.","zh":"土豆煮过头会变得发粉，口感不好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person’s words or feelings) weak, overly polite, or lacking strength and sincerity.","zh":"（言语或情感）软弱无力的；过分客套的；缺乏真诚和力度的。"},"examples":[{"en":"He gave a mealy apology that didn’t sound sincere.","zh":"他道了个软绵绵的歉，听起来并不真诚。"},{"en":"She offered mealy compliments to avoid conflict.","zh":"她说了些客套的恭维话来避免冲突。"}]}],"synonyms":["grainy","floury","powdery","dry","insincere","weak","mealy-mouthed"],"phonetic":"/ˈmiːli/","extraExplanation":["“mealy”来自“meal”（粗磨的粉，如玉米粉/面粉）。因此它用来形容食物像“粉”一样的口感：干、松、颗粒感明显。","形容人时常出现在固定搭配里，如“mealy-mouthed”（说话吞吞吐吐、过分圆滑不直率）。","常见搭配：mealy apple（发粉的苹果）、mealy potatoes（发粉的土豆）、mealy texture（粉状口感）。"]}
{"word":"mealybug","summary":{"en":"A mealybug is a white, cottony-looking sap-sucking insect that damages plants.","zh":"mealybug 指粉蚧：一种看起来像白色棉絮、会吸食汁液并危害植物的小昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, soft-bodied insect that sucks plant sap and is covered with a white, powdery, “cotton-like” wax; it often harms houseplants and crops.","zh":"粉蚧（介壳虫的一类）：一种体软、吸食植物汁液的小昆虫，身体常覆有白色粉状或棉絮状蜡质分泌物；常危害盆栽和农作物。"},"examples":[{"en":"My orchid leaves were turning yellow because of mealybugs.","zh":"我的兰花叶子发黄，是因为感染了粉蚧。"},{"en":"Mealybugs often hide in leaf joints and under stems.","zh":"粉蚧常躲在叶腋处和茎的下方。"},{"en":"If you see white cottony clumps, you may have a mealybug problem.","zh":"如果你看到白色棉絮状小团，可能就是粉蚧的问题。"}]}],"synonyms":["scale insect","plant pest","cottony pest"],"phonetic":"/ˈmiːliˌbʌɡ/","extraExplanation":["“mealy-”来自“mealy”（粉状的、像面粉一样的），指粉蚧表面的白色蜡粉；“bug”在日常英语里可泛指昆虫。","常见的处理方式包括：用棉签蘸酒精擦除、用肥皂水/园艺油喷洒、隔离受害植物并检查新买植物（这些是园艺常识，不是医疗建议）。"]}
{"word":"mealybugs","summary":{"en":"Mealybugs are white, powdery-looking insects that suck plant sap and damage plants.","zh":"粉蚧是看起来带白色粉状蜡层的吸汁害虫，会吸食植物汁液并危害植株。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, soft-bodied insect covered with a white, powdery wax; it sucks plant sap and can weaken or damage houseplants and crops","zh":"粉蚧（小型、柔软的吸汁昆虫，身体常覆白色粉蜡；会吸食植物汁液，导致盆栽或农作物衰弱、受害）"},"examples":[{"en":"My orchid leaves turned yellow because of mealybugs.","zh":"我的兰花叶子变黄了，是因为长了粉蚧。"},{"en":"Mealybugs often hide in leaf joints and along stems.","zh":"粉蚧常躲在叶腋和茎部缝隙里。"},{"en":"Farmers monitor crops for pests like mealybugs to prevent outbreaks.","zh":"农民会监测作物中的粉蚧等害虫，以防爆发成灾。"}]}],"synonyms":["mealybug (singular)","plant-sucking pest","scale insect (related group)"],"phonetic":"/ˈmiːliˌbʌɡ/","extraExplanation":["“mealy-”在这里表示“像面粉一样的、粉状的”，指粉蚧表面那层白色蜡粉；它们常被误认为是棉絮或霉点。","粉蚧会分泌蜜露（黏黏的糖液），容易引来蚂蚁并诱发煤污病（叶面发黑）。日常养护中常见的做法是隔离受害植株、用酒精棉签点擦虫体，或使用针对介壳虫/粉蚧的园艺皂、矿物油等。"]}
{"word":"mealymouth","summary":{"en":"Mealy-mouthed means speaking in an unclear, evasive way instead of being direct.","zh":"mealy-mouthed 指说话含糊回避、不够直接坦率。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not speaking clearly or directly; using vague or evasive words to avoid giving a clear opinion or answer.","zh":"说话含糊其辞、不够坦率；用模糊或回避的措辞来避免给出明确观点或答案。"},"examples":[{"en":"Stop being mealy-mouthed and tell us what you really think.","zh":"别再含糊其辞了，直接说你到底怎么想。"},{"en":"The spokesperson gave a mealy-mouthed response to the scandal.","zh":"发言人对这起丑闻的回应含糊其辞。"}]}],"synonyms":["evasive","wishy-washy","equivocal","ambiguous"],"phonetic":"/ˈmiːliˌmaʊθ/","extraExplanation":["“mealy-”来自“meal（面粉）”，有“粉状、无味、软塌塌”的感觉；“mealy-mouthed”字面像“嘴里含着面粉”，引申为说话不清楚、吞吞吐吐、缺乏立场。","常见搭配：a mealy-mouthed apology（敷衍/不真诚的道歉）、a mealy-mouthed statement（含糊的声明）。语气通常是批评性的，暗示对方不够诚实或不够有担当。","近义词侧重点：evasive（回避问题）、wishy-washy（优柔寡断、没主见）、ambiguous（有歧义/不明确）。反义表达：frank / blunt / straightforward（坦率/直白/直接）。"]}
{"word":"mealymouthed","summary":{"en":"“Mealy-mouthed” describes speech that is vague and indirect to avoid giving a clear opinion or offending others.","zh":"“mealymouthed”指说话含糊、绕弯子，常为避免表态或避免得罪人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not willing to speak clearly or directly, especially to avoid offending someone or taking a firm position; using indirect or “soft” language.","zh":"说话不直截了当的（尤其为避免得罪人或避免明确表态）；用含糊、委婉、绕弯子的说法。"},"examples":[{"en":"The spokesperson gave a mealy-mouthed answer instead of saying yes or no.","zh":"发言人给了一个含糊其辞的回答，而不是直接说“是”或“不是”。"},{"en":"Voters were tired of mealy-mouthed promises that never became real plans.","zh":"选民厌倦了那些含糊其辞、从不落实为具体方案的承诺。"},{"en":"Stop being mealy-mouthed—tell me what you really think.","zh":"别再绕弯子了——告诉我你真正的想法。"}]}],"synonyms":["evasive","wishy-washy","equivocal","noncommittal","cagey"],"phonetic":"/ˈmiːliˌmaʊðd/","extraExplanation":["这个词常用来批评政治人物、公司声明或公关语言：表面“客气/谨慎”，但让人感觉在回避责任或不敢明确立场。","词源上与“mealy（像面粉一样的、粉状的）”有关，带有“嘴里像塞了粉一样说不清楚”的形象感；因此通常含贬义。"]}
{"word":"mealymouthedly","summary":{"en":"Mealymouthedly means speaking in an evasive, unclear, or overly cautious way.","zh":"mealymouthedly 指说话闪烁其词、含糊不清、过于谨慎而不直说。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an indirect, evasive, or overly cautious way, especially to avoid saying something clearly or honestly.","zh":"（尤指为避免说清楚或说实话而）含糊其辞地、支支吾吾地、闪烁其词地。"},"examples":[{"en":"The spokesperson answered mealymouthedly, avoiding any clear promise.","zh":"发言人含糊其辞地回答，刻意回避任何明确承诺。"},{"en":"When asked about the mistake, he spoke mealymouthedly and changed the topic.","zh":"当被问到那个错误时，他闪烁其词，还把话题岔开了。"},{"en":"She didn’t refuse directly; she responded mealymouthedly so no one would be offended.","zh":"她没有直接拒绝，而是委婉含糊地回应，以免得罪人。"}]}],"synonyms":["evasively","ambiguously","vaguely","noncommittally","indirectly"],"phonetic":"/ˈmiːli ˈmaʊðtli/","extraExplanation":["“mealy-mouthed”原意与“mealy（像面粉一样的、粉状的）”有关，形象地暗示说话“不硬朗”“不干脆”，像嘴里含着粉一样说不清楚。英语里常用来批评政治人物或公关话术：听起来温和，但信息不明确、缺乏担当。"]}
{"word":"mealymouthedness","summary":{"en":"Mealymouthedness is the habit or quality of speaking in a vague, overly cautious way to avoid being direct.","zh":"mealymouthedness 指为避免直说或表态而刻意含糊、过分谨慎的说话方式（贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of speaking in a deliberately vague, cautious, or indirect way, especially to avoid giving a clear opinion or to avoid offending people.","zh":"说话含糊其辞、模棱两可、过分谨慎（常为避免表态或避免得罪人）的特质。"},"examples":[{"en":"Voters were frustrated by the candidate’s mealymouthedness on the issue of taxes.","zh":"选民对这位候选人在税收问题上的含糊其辞感到沮丧。"},{"en":"Her mealymouthedness made it hard to know what she actually believed.","zh":"她的模棱两可让人很难知道她真正相信什么。"},{"en":"The company’s statement was full of mealymouthedness instead of a clear apology.","zh":"公司的声明充满含糊其辞，而不是明确的道歉。"}]}],"synonyms":["evasiveness","equivocation","weasel words","vagueness","hedging"],"phonetic":"/ˈmiːliˌmaʊðɪdnəs/","extraExplanation":["这个词带有明显的贬义，常用于批评政客、公司公关声明或任何“说了很多却不表态”的说法。","构词上来自 mealy-mouthed（“说话软弱含糊的”）+ -ness（表示“性质/状态”）。mealy 原意与“面粉/粉状”有关，引申为“软、没有棱角”，形容语言“不硬、不直接”。","写作中可用来强调“刻意回避明确立场”的感觉；如果只是“礼貌、委婉”，更中性的词可用 tact（圆融）或 diplomatic language（外交辞令）。"]}
{"word":"mealywing","summary":{"en":"Mealywing is another name for a whitefly— a tiny, powdery-winged insect that sucks plant sap and can damage plants.","zh":"Mealywing 指白粉虱一类昆虫：翅膀带粉状外观，吸食植物汁液，常造成植株受害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small plant-sucking insect (a type of whitefly) with wings that look powdery or “mealy,” often found on the undersides of leaves and known as a crop and houseplant pest","zh":"一种吸食植物汁液的小昆虫（白粉虱的一类），翅膀表面像撒了粉一样呈“粉状/面粉状”，常见于叶片背面，是农作物和观赏植物的常见害虫"},"examples":[{"en":"The gardener noticed mealywings on the underside of the leaves.","zh":"园丁发现叶片背面有粉虱（mealywings）。"},{"en":"Mealywings can weaken plants by sucking their sap.","zh":"粉虱会吸食汁液，导致植物变弱。"},{"en":"To control mealywings, she isolated the infected houseplant and washed the leaves.","zh":"为了控制粉虱，她把染虫的盆栽隔离，并清洗叶片。"}]}],"synonyms":["whitefly","mealy-winged fly"],"phonetic":"/ˈmiːliˌwɪŋ/","extraExplanation":["“mealy-”在英语里常表示“像面粉/粉末一样的、粉状的”（例如 mealybugs 粉蚧；mealy wings 指“有粉状翅膀”）。这种叫法来自昆虫翅膀或体表覆盖的白色蜡粉，看起来像撒了粉。","在园艺与农业语境中，mealywing 常与 whitefly（白粉虱）混用；更常见的说法是 whitefly 或 mealy-winged fly。"]}
{"word":"mean","summary":{"en":"Mean most often means “to have a meaning” or “to intend.” As an adjective it can mean “unkind” or “average,” and as a noun it can mean “an average (in math).”","zh":"mean 最常见是动词，表示“意思是/意味着”或“打算”。作形容词可表示“刻薄/小气”或“一般的”。作名词常指“平均值（数学/统计）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to have a particular meaning; to express or represent an idea","zh":"表示……的意思；意指；意味着"},"examples":[{"en":"What does this word mean?","zh":"这个单词是什么意思？"},{"en":"This sign means “No parking.”","zh":"这个标志表示“禁止停车”。"}]},{"partOfSpeech":"v.","definition":{"en":"to intend to do something; to plan or want to do something","zh":"打算；想要；计划（做某事）"},"examples":[{"en":"I mean to call you tonight.","zh":"我打算今晚给你打电话。"},{"en":"She didn’t mean to hurt your feelings.","zh":"她并不是故意要伤害你的感受。"}]},{"partOfSpeech":"adj.","definition":{"en":"average; not very good or very bad","zh":"平均的；一般的；中等的（不太好也不太差）"},"examples":[{"en":"The food was pretty mean for the price.","zh":"以这个价格来说，食物只能算一般。"}]},{"partOfSpeech":"adj.","definition":{"en":"unkind or cruel; sometimes also unwilling to share or spend money (informal)","zh":"刻薄的；不友善的；（口语）小气的、吝啬的"},"examples":[{"en":"Don’t be mean to your little brother.","zh":"别对你弟弟那么刻薄。"},{"en":"He’s too mean to buy a gift.","zh":"他太小气了，连礼物都不买。"}]},{"partOfSpeech":"n.","definition":{"en":"a middle point between two extremes; a way of doing something; (math) an average value","zh":"中间；折中；方法；（数学）平均值"},"examples":[{"en":"We need to find a mean between safety and speed.","zh":"我们需要在安全和速度之间找到一个折中。"},{"en":"The mean of 2, 4, and 6 is 4.","zh":"2、4、6 的平均值是 4。"}]}],"synonyms":["signify","indicate","intend","plan","unkind","cruel","average"],"phonetic":"/miːn/","extraExplanation":["“mean”有两个常见发音与词义群：/miːn/ 通常是动词“意思是/打算”；/miːn/ 也可作形容词“刻薄/小气”。名词“mean（平均值）”多见于数学或统计语境。","口语里 “I mean …” 常用来补充说明或纠正前面的话，类似“我的意思是……/我是说……”。例如：“It’s on Friday— I mean, Saturday.”（在周五——我是说周六。）"]}
{"word":"meananing","summary":{"en":"Meaning refers to what something (especially a word or action) expresses or signifies; it can also describe something as important or purposeful.","zh":"Meaning 指（尤其是词语或行为所表达的）含义/意义；也可作形容词，表示重要或有目的、富有意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the idea, message, or significance of a word, sentence, action, or event; what something expresses","zh":"（词语、句子、行为或事件的）含义；意思；意义"},"examples":[{"en":"What’s the meaning of this word?","zh":"这个单词是什么意思？"},{"en":"Her smile had a special meaning.","zh":"她的微笑有特殊的含义。"}]},{"partOfSpeech":"adj.","definition":{"en":"important or full of purpose; showing that something matters","zh":"有意义的；重要的；富有目的的"},"examples":[{"en":"He wants a more meaningful job.","zh":"他想要一份更有意义的工作。"},{"en":"They had a meaningful conversation.","zh":"他们进行了一次有意义的谈话。"}]}],"synonyms":["significance","sense","definition","message","importance"],"phonetic":"/ˈmiːnɪŋ/","extraExplanation":["你输入的“meananing”通常是“meaning”的拼写错误。正确拼写：meaning。","“meaning”作为名词时最常用；作为形容词时常用于搭配：meaningful（更常见）、meaningless（无意义的）。"]}
{"word":"meander","summary":{"en":"“Meander” means to wander without a clear direction, or (for rivers/paths) to wind in curves; as a noun it means a winding bend.","zh":"“meander”指漫步闲逛、无明确方向地走动；也指河流/小路蜿蜒曲折；作名词可指（河流的）曲流或弯道。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move or go in a slow, relaxed way without a clear direction; to wander","zh":"（无明确方向地）缓慢地走动；漫步；闲逛"},"examples":[{"en":"We meandered through the old town, stopping to look at small shops.","zh":"我们在老城区里漫步，时不时停下来看看小店。"},{"en":"The conversation meandered from travel to movies and then to work.","zh":"谈话从旅行聊到电影，后来又聊到工作。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a river or path) to follow a curving, winding course","zh":"（河流或小路）蜿蜒；曲折延伸"},"examples":[{"en":"A narrow river meanders across the valley.","zh":"一条狭窄的河流在山谷中蜿蜒流过。"},{"en":"A footpath meanders through the forest.","zh":"一条小径在森林中蜿蜒穿行。"}]},{"partOfSpeech":"n.","definition":{"en":"a winding curve or turn, especially in a river","zh":"（尤指河流的）曲流；弯道"},"examples":[{"en":"The boat disappeared behind a meander in the river.","zh":"小船在河流的一个弯道后消失了。"},{"en":"Farmers built near the river’s meanders for easy access to water.","zh":"农民在河流的曲流附近建房，便于取水。"}]}],"synonyms":["wander","stroll","roam","ramble","wind","snake"],"phonetic":"/miˈændɚ/","extraExplanation":["“meander”源自小亚细亚（今土耳其）的迈安德河（Meander River，古称 Maeander），以河道弯弯曲曲著名，因此这个词常用来形容“蜿蜒曲折”。","在写作中，用“meander”形容“谈话/故事”时，通常暗示节奏悠闲、话题跳跃、缺少明确主线；语气多为中性，有时也带一点“跑题”的意味。","相关表达：meander along（沿着……慢慢走）；meander through（在……中蜿蜒/漫步）；a meandering road/plot（蜿蜒的道路/曲折但不紧凑的情节）。"]}
{"word":"meandered","summary":{"en":"Meandered is the past tense of “meander,” meaning it moved in a winding way or went off-topic in an indirect, wandering manner.","zh":"meandered 是 meander 的过去式，表示“蜿蜒前行”或（谈话/思路）“绕圈子、跑题”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To move or go in a winding, curving way rather than in a straight line.","zh":"（道路、河流或人）蜿蜒、曲折前行；不走直线。"},"examples":[{"en":"We meandered along the riverside path and stopped to take photos.","zh":"我们沿着河边小路悠闲地蜿蜒前行，还停下来拍照。"},{"en":"A narrow road meandered through the mountains.","zh":"一条狭窄的道路在群山间蜿蜒穿行。"}]},{"partOfSpeech":"vi.","definition":{"en":"To talk, think, or write in a way that is not direct, often changing topics and taking a long time to reach the point.","zh":"（谈话、思路或文章）跑题、绕圈子；不够直截了当。"},"examples":[{"en":"His explanation meandered, and I wasn’t sure what he really meant.","zh":"他的解释绕来绕去，我不太确定他到底想表达什么。"},{"en":"The meeting meandered from one topic to another without a clear plan.","zh":"会议没有明确计划，话题从一个跳到另一个，越聊越散。"}]}],"synonyms":["wander","wind","snake","ramble","roam"],"phonetic":"/miˈændɚd/","extraExplanation":["“meander”原本指土耳其的迈安德河（Maeander River，古希腊语作Maiandros），以河道弯曲著名，所以这个词后来用来形容“像河流一样蜿蜒”。","语气通常偏中性或带一点“悠闲、随意”的感觉；描述谈话/文章时，有时会带轻微的负面含义（比如“啰嗦、没重点”）。"]}
{"word":"meanderer","summary":{"en":"A meanderer is someone who wanders or moves (or even speaks/writes) in an indirect, unplanned way.","zh":"meanderer 指喜欢漫步闲逛、走路不走直线的人，也可指说话或写作时东拉西扯、不按主线推进的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who moves, walks, talks, or writes in a relaxed way without a clear direct path or plan; someone who wanders","zh":"漫步者；闲逛者；（说话/写作）东拉西扯的人"},"examples":[{"en":"He’s a natural meanderer—he can turn a five-minute walk into an hour-long stroll.","zh":"他天生爱闲逛——五分钟的路能走成一个小时的散步。"},{"en":"As a meanderer in conversation, she often starts with one topic and ends up somewhere completely different.","zh":"她聊天时很爱绕圈子，经常从一个话题开始，最后跑到完全不相干的地方。"},{"en":"The essay felt like it was written by a meanderer, full of interesting details but not much structure.","zh":"这篇文章读起来像是“东拉西扯”的人写的，细节有趣但结构不太清晰。"}]}],"synonyms":["wanderer","roamer","drifter","stroller"],"phonetic":"/miˈændərər/","extraExplanation":["“meander”原指河流蜿蜒曲折，词源常与古代小亚细亚（今土耳其）的一条河——Maeander（迈安得河）有关，这条河以曲折著名；因此meanderer也常带有“走走停停、随意绕路”的画面感。","“meanderer”在英语里不算特别常用，更常见的是动词“meander”（蜿蜒/闲逛）或名词“meander”（曲折的路径/漫步）。"]}
{"word":"meanderers","summary":{"en":"“Meanderers” means people or things that wander, or (in geography) winding rivers/streams.","zh":"“meanderers”指漫步/闲逛的人（或蜿蜒移动的事物），也可指（地理上）蜿蜒曲折的河流/溪流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people (or things) that move or travel in a slow, wandering way without a clear direction","zh":"（人或事物）漫步者；闲逛者；（移动时）蜿蜒前行者"},"examples":[{"en":"The park was quiet, with only a few meanderers enjoying the late afternoon sun.","zh":"公园很安静，只有几位漫步者在享受傍晚的阳光。"},{"en":"We were just meanderers in the old town, stopping whenever something caught our eye.","zh":"我们在老城里随意闲逛，看到感兴趣的东西就停下来。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in geography) rivers or streams that curve and bend repeatedly","zh":"（尤用于地理）曲流的河流；蜿蜒反复的溪流"},"examples":[{"en":"From the hilltop, we could see the meanderers cutting through the valley.","zh":"从山顶望去，我们能看到那些曲流的河道穿过山谷。"},{"en":"These meanderers create rich farmland on their floodplains.","zh":"这些蜿蜒的河道在泛滥平原上形成了肥沃的农田。"}]}],"synonyms":["wanderers","strollers","ramblers","drifters"],"phonetic":"/miˈændərərz/","extraExplanation":["“meander”一词源自希腊语，和土耳其一条以曲折著名的河流有关（古称 Maeander）。因此它常用来形容“像河流一样蜿蜒、绕来绕去”的路线或写作风格。"]}
{"word":"meandering","summary":{"en":"Meandering means winding (like a river or road) or wandering in a relaxed, not-direct way; it can also describe speech or writing that is not concise.","zh":"meandering 表示（河流、道路等）蜿蜒曲折，或（人）悠闲地闲逛；也可形容讲话/写作不够简洁、容易离题。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Winding or curving in a relaxed way; not straight.","zh":"（路线、河流等）蜿蜒的；曲折的；不笔直的。"},"examples":[{"en":"A meandering path led through the forest.","zh":"一条蜿蜒的小路穿过森林。"},{"en":"We followed the meandering river for miles.","zh":"我们沿着那条蜿蜒的河走了好几英里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving or going from place to place slowly without a clear direction or hurry.","zh":"（人）漫步的；闲逛的；没有明确方向、慢慢走的。"},"examples":[{"en":"They spent the afternoon meandering around the old town.","zh":"他们下午在老城里随意闲逛。"},{"en":"I like meandering through bookstores on weekends.","zh":"我周末喜欢在书店里慢慢逛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not direct or well organized; (speech, writing, or thinking) that goes on in a wandering way.","zh":"（谈话、文章、思路）离题的；冗长曲折的；不够简洁直达主题的。"},"examples":[{"en":"His meandering explanation confused everyone.","zh":"他那段离题又冗长的解释把大家都弄糊涂了。"},{"en":"The novel has a meandering plot, but the characters are memorable.","zh":"这本小说情节发展比较曲折散漫，但人物很令人难忘。"}]}],"synonyms":["winding","twisting","curving","wandering","rambling"],"phonetic":"/miˈændərɪŋ/","extraExplanation":["“meander”最初指土耳其的一条以弯曲著名的河流（古希腊语中称 Maeander），后来就用来形容河流、道路“蜿蜒曲折”。因此它常带有“自然、悠闲、不急不躁”的感觉；但形容讲话或写作时，有时会带一点负面含义，表示“绕来绕去、离题”。"]}
{"word":"meanderingly","summary":{"en":"“Meanderingly” means “in a winding, indirect way,” about paths, writing, or speech.","zh":"“meanderingly”表示“蜿蜒地、迂回地”，可形容道路，也可形容说话或叙述绕来绕去。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that follows a winding, indirect path (literally or figuratively).","zh":"以蜿蜒、迂回的方式（可指实际路线或比喻说话/叙述不直截了当）。"},"examples":[{"en":"We walked meanderingly along the river, stopping to look at the birds.","zh":"我们沿着河边蜿蜒地走走停停，还停下来观察鸟。"},{"en":"He spoke meanderingly, taking a long time to get to the main point.","zh":"他说话很迂回，花了很久才讲到重点。"}]}],"synonyms":["indirectly","windingly","circuitously","ramblingly"],"phonetic":"/miˈændərɪŋli/","extraExplanation":["“meanderingly”来自动词/形容词“meander”（蜿蜒；漫步；离题）。词源常追溯到土耳其的门德雷斯河（古希腊语 Maeander），这条河以弯弯曲曲的河道闻名，所以“meander”就引申为“曲折、绕来绕去”。","语气上，“meanderingly”通常偏中性或略带批评：中性时强调轻松随意、慢慢走；带批评时强调不够聚焦、离题。正式写作中更常用“in a meandering way”来避免生硬。"]}
{"word":"meanders","summary":{"en":"“Meanders” can mean “wanders without a clear direction” (verb) or “winding river curves” (noun).","zh":"“meanders”既可作动词表示“漫步/蜿蜒、离题”，也可作名词表示“（河流的）曲流、弯道”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a person, conversation, or path) to wander or move in a relaxed way without a clear direction or plan.","zh":"（人、谈话或路线）漫步；蜿蜒前行；（内容）离题、东拉西扯。"},"examples":[{"en":"We meandered through the old town and stopped for coffee.","zh":"我们在老城区里随意漫步，顺便停下来喝了杯咖啡。"},{"en":"His speech meandered from topic to topic.","zh":"他的演讲从一个话题跳到另一个话题，有点离题。"}]},{"partOfSpeech":"n.","definition":{"en":"winding curves or loops, especially in a river.","zh":"（尤指河流的）曲流；蜿蜒的弯道。"},"examples":[{"en":"The river’s meanders create calm, shallow pools.","zh":"河流的曲流形成了平静、浅浅的水潭。"},{"en":"From above, you can see the wide meanders of the valley river.","zh":"从高处看，你能看到山谷河流宽大的曲流。"}]}],"synonyms":["wander","roam","stroll","ramble","zigzag","wind"],"phonetic":"/miˈændɚ/","extraExplanation":["“meander”源自土耳其境内古代的迈安德河（Maeander River），这条河以弯弯曲曲著名，因此这个词后来用来表示“蜿蜒、曲折前进”。","“meanders”既可能是动词第三人称单数（He/She meanders），也可能是名词复数（river meanders）。判断时看句子结构：前面有主语+动词→多半是动词；前面有冠词/形容词修饰→多半是名词。"]}
{"word":"meandrine","summary":{"en":"“Meandering” describes something that winds and turns, or speech/writing that is long and unfocused.","zh":"“Meandering”常指蜿蜒曲折，也可形容讲话或文章冗长散漫、没有重点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"moving in a winding, indirect way; not going straight","zh":"蜿蜒的；迂回的；不直线前进的"},"examples":[{"en":"We took a meandering path through the park.","zh":"我们走了一条穿过公园的蜿蜒小路。"},{"en":"A meandering river is often slower than a straight one.","zh":"蜿蜒的河流通常比笔直的河流流得更慢。"}]},{"partOfSpeech":"adj.","definition":{"en":"long and not well organized; going from topic to topic without a clear point","zh":"（说话/文章）冗长散漫的；离题的；没有重点的"},"examples":[{"en":"His meandering explanation confused everyone.","zh":"他那段散漫的解释把大家都弄糊涂了。"},{"en":"The novel has a meandering plot, but the characters are interesting.","zh":"这部小说情节有些拖沓散乱，但人物很有意思。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move or travel in a winding, relaxed way; to wander without a plan","zh":"（人/路/河流等）蜿蜒而行；漫步；闲逛"},"examples":[{"en":"We meandered around the old town after dinner.","zh":"晚饭后我们在老城里随意逛了逛。"},{"en":"The trail meanders along the coastline.","zh":"这条小径沿着海岸线蜿蜒延伸。"}]}],"synonyms":["winding","twisting","wandering","rambling"],"phonetic":"/miˈændərɪŋ/","extraExplanation":["你输入的 “meandrine” 不是常见英文拼写；最可能是 “meandering”（形容词/现在分词），来自动词 “meander”（蜿蜒、漫步、闲逛）。","这个词常用来形容“河流/道路”的弯弯曲曲，也常比喻“讲话/文章”绕来绕去没有重点。"]}
{"word":"meandriniform","summary":{"en":"Meandriniform means “meander-shaped”: winding and curving back and forth, often used in scientific descriptions.","zh":"meandriniform 表示“曲流状的”：像河流曲流那样蜿蜒回旋，常用于较学术/科学的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a winding, twisting shape like a meander (a curve that bends back and forth), especially like a winding river or similar natural pattern.","zh":"呈曲流状的；蜿蜒回旋的（像河流曲流那样反复弯曲的形状）。"},"examples":[{"en":"From above, the river looks meandriniform as it snakes across the floodplain.","zh":"从上方看，这条河在泛滥平原上蜿蜒曲折，呈曲流状。"},{"en":"The trail becomes meandriniform near the coast to avoid steep cliffs.","zh":"这条小径在海岸附近为了避开陡崖而变得蜿蜒回旋。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Meander-like in form, used to describe wavy or winding structures (for example, folds, ridges, or patterns in tissue).","zh":"（生物/医学）呈“曲流”样的；用于描述组织或结构中波状、蜿蜒的褶皱、脊或纹理。"},"examples":[{"en":"Under the microscope, the membrane shows a meandriniform pattern.","zh":"在显微镜下，这层膜呈现曲流状的纹理。"},{"en":"The report noted meandriniform folds along the surface of the specimen.","zh":"报告指出标本表面有曲流状的褶皱。"}]}],"synonyms":["meandering","sinuous","winding","serpentine","tortuous"],"phonetic":"/miˈændrɪnɪˌfɔrm/","extraExplanation":["这个词比较少见，常见于学术写作（地貌学、地质学、生物学/医学等）。日常英语里更常用的是 meandering（蜿蜒的）或 winding（弯曲的）。","词源上与“Meander（曲流）”相关：Meander 来自古代小亚细亚的一条以弯曲著名的河流（今土耳其境内的 Büyük Menderes 河），因此“meander”在英语里引申为“蜿蜒曲折”。"]}
{"word":"meandrite","summary":{"en":"Meander means to move or develop in a winding, indirect way; it can also mean a winding bend (especially in a river).","zh":"Meander 指“蜿蜒、迂回地前进/发展”，也可作名词表示“（尤指河流的）曲流、弯道”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to follow a winding, curving path; to wander without a clear direction or purpose","zh":"（道路/河流等）蜿蜒；（人/谈话等）漫无目的地走/进行"},"examples":[{"en":"The river meanders through the valley.","zh":"这条河蜿蜒流过山谷。"},{"en":"We meandered around the old town and discovered a small café.","zh":"我们在老城区随意逛着，发现了一家小咖啡馆。"},{"en":"His explanation meandered and never reached the main point.","zh":"他的解释东拉西扯，始终没有讲到重点。"}]},{"partOfSpeech":"n.","definition":{"en":"a winding curve or turn in a river, road, or other route","zh":"（河流/道路等的）曲流；迂回的弯道"},"examples":[{"en":"The map shows a long meander in the river near the village.","zh":"地图显示村子附近的河道有一段很长的曲流。"},{"en":"We stopped at a viewpoint to watch the river’s wide meanders.","zh":"我们在观景点停下来看河流宽阔的曲流。"}]}],"synonyms":["wander","wind","snake","ramble"],"phonetic":"/miˈændɚ/","extraExplanation":["你输入的“meandrite”在现代英语里非常少见，常见词是 **meander**（动词/名词）。如果你是在地质或古典历史语境中看到“meandrite”，请把原句发我，我可以根据上下文确认是否是专门术语或拼写变体。","词源小知识：**meander** 来自古希腊语，指小亚细亚的弯曲河流（今土耳其一带的 Büyük Menderes 河），因此这个词常用来形容“像河一样弯弯绕绕”。"]}
{"word":"meandrous","summary":{"en":"Meandrous means winding with many curves, or (figuratively) rambling and not direct.","zh":"meandrous 指“蜿蜒曲折的”，也可比喻“叙述离题、绕来绕去的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Winding and curving in a way that follows many bends, like a twisting river.","zh":"蜿蜒曲折的；像河流一样有许多弯道的。"},"examples":[{"en":"We followed a meandrous path through the hills.","zh":"我们沿着山间一条蜿蜒曲折的小路前行。"},{"en":"The river becomes meandrous as it enters the flat valley.","zh":"这条河进入平坦的山谷后变得更加蜿蜒。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Not direct; wandering from point to point, especially in speech or writing.","zh":"（比喻）不直接的；（说话或写作）离题、绕来绕去的。"},"examples":[{"en":"His explanation was so meandrous that I forgot the original question.","zh":"他的解释太绕了，我都忘了最初的问题是什么。"},{"en":"The novel has a meandrous plot that takes time to come together.","zh":"这本小说的情节发展比较迂回，需要时间才能串起来。"}]}],"synonyms":["winding","twisting","sinuous","rambling","roundabout"],"phonetic":"/miˈændrəs/","extraExplanation":["词源提示：meandrous 来自 meander（蜿蜒），而 meander 源于古希腊的迈安德洛斯河（Maeander，今土耳其境内），以“河道弯曲多”出名，所以这个词常用来形容“像河一样曲折”。","用法提醒：在日常英语里，更常见的是 meandering（adj.）或 meander (v.)；meandrous 稍显书面/文学色彩，用来写景或评价叙述风格很贴切。"]}
{"word":"meandrously","summary":{"en":"“Meandrously” means “in a winding, wandering way,” like a river with many curves.","zh":"“meandrously”表示“蜿蜒曲折地、绕来绕去地”，常像多弯的河流一样。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a winding, curving way; following a route that bends and turns rather than going straight.","zh":"以蜿蜒曲折的方式；路线不是直线，而是不断弯来绕去。"},"examples":[{"en":"The river flowed meandrously through the valley.","zh":"这条河蜿蜒曲折地流过山谷。"},{"en":"We walked meandrously through the old town, stopping whenever something caught our eye.","zh":"我们在老城区随意地东拐西绕地走着，看到有趣的东西就停下来。"},{"en":"Her story moved meandrously from one memory to another.","zh":"她的叙述从一个回忆跳到另一个回忆，曲曲折折地展开。"}]}],"synonyms":["windingly","circuitously","indirectly","zigzaggingly","wanderedly"],"phonetic":"/miˈændrəsli/","extraExplanation":["“meandrously”来自动词/名词“meander（蜿蜒；漫步；绕来绕去）”。“meander”一词与古代小亚细亚的迈安德河（Meander River，今土耳其境内）有关，这条河以河道弯曲著名，因此英语里用它来比喻“像河流一样曲折/不直接”。","在写作里，“meandrously”既可写真实的路径（河流、道路），也可写抽象的过程（谈话、叙事、思路）“不按直线推进、旁枝末节很多”。语气通常偏中性或略带委婉批评（例如觉得不够直接）。"]}
{"word":"meaned","summary":{"en":"“Meaned” is a nonstandard form of the past tense/past participle of “mean”; use “meant” in standard English.","zh":"“Meaned”通常是不规范的“mean”的过去式/过去分词；标准英语应使用“meant”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Used as the past tense or past participle of “mean,” but it is usually considered nonstandard; the standard form is “meant.”","zh":"作为“mean”的过去式或过去分词的用法，但通常被认为不规范；规范形式是“meant”。"},"examples":[{"en":"Nonstandard: I meaned to call you, but I forgot. (Standard: I meant to call you, but I forgot.)","zh":"不规范：I meaned to call you, but I forgot.（规范：I meant to call you, but I forgot.）"},{"en":"Nonstandard: What have you meaned by that? (Standard: What have you meant by that?)","zh":"不规范：What have you meaned by that?（规范：What have you meant by that?）"}]}],"phonetic":"/miːnd/","extraExplanation":["“Mean”的规则过去式看起来像应该加 -ed，但它是不规则动词：mean → meant。口语或学习者英语中偶尔会出现“meaned”，但在正式写作、考试和标准英语里应避免。","容易混淆：\n- meant to do = 打算做（I meant to help. 我本来想帮忙。）\n- meant = 意思是/意味着（What did you mean? 你什么意思？ / This means a lot. 这意义重大。）"]}
{"word":"meaner","summary":{"en":"“Meaner” means “more mean”: usually more unkind/cruel, or more stingy with money; less commonly, worse in quality.","zh":"“Meaner”表示“更 mean（更……）”：通常指更刻薄/更恶意，或更小气/更吝啬；较少见地也可指质量更差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more unkind, cruel, or nasty (comparative form of “mean”)","zh":"更刻薄的；更恶意的；更残忍的（“mean”的比较级）"},"examples":[{"en":"He’s gotten meaner since the argument.","zh":"自从那次争吵之后，他变得更刻薄了。"},{"en":"Don’t be meaner than you need to be—just explain the problem calmly.","zh":"没必要那么刻薄——平静地解释问题就好。"},{"en":"The comments online became meaner and more personal.","zh":"网上的评论变得更恶毒、更针对个人。"}]},{"partOfSpeech":"adj.","definition":{"en":"more stingy; less willing to spend or share (comparative form of “mean”)","zh":"更小气的；更吝啬的（“mean”的比较级）"},"examples":[{"en":"I used to be generous, but I’ve become meaner with money lately.","zh":"我以前挺大方的，但最近在钱方面变得更小气了。"},{"en":"He’s meaner about tips than his coworkers.","zh":"他给小费比同事更抠门。"}]},{"partOfSpeech":"adj.","definition":{"en":"worse in quality; more shabby or inferior (less common)","zh":"质量更差的；更寒酸的；更低劣的（较不常用）"},"examples":[{"en":"They moved to a meaner neighborhood to save rent.","zh":"为了省房租，他们搬到了条件更差的社区。"},{"en":"After the storm, the houses looked meaner and more damaged.","zh":"暴风雨后，这些房子看起来更破旧、损坏更严重。"}]}],"synonyms":["crueler","nastier","harsher","stingier","tighter","more miserly"],"phonetic":"ˈmiːnər","extraExplanation":["“mean”这个词在英语里有多个常见意思：①刻薄/恶意；②小气/吝啬；③（在数学里）平均数。只有前两种含义通常能变成“meaner”。如果你想表达“平均数更大/更小”，更自然的说法是：the mean is higher/lower。","口语里说某人“mean”多指“刻薄、爱讽刺”，比“strict（严格）”更带攻击性。","拼写提醒：meaner（更刻薄/更小气）不同于manner（礼貌、方式）或miner（矿工）。"]}
{"word":"meaners","summary":{"en":"“Meaners” can mean “more unkind” (comparative adjective) or “unkind people” (plural noun).","zh":"“meaners”可表示“更刻薄”（形容词比较级）或“刻薄的人”（名词复数）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of “mean” in the sense of unkind) more unkind, cruel, or hurtful.","zh":"（形容词 mean“刻薄/不友善”的比较级）更刻薄的、更苛刻的、更伤人的。"},"examples":[{"en":"He’s gotten meaner since the argument.","zh":"自从那次争吵后，他变得更刻薄了。"},{"en":"Don’t use meaner words when you’re angry.","zh":"你生气时别用更伤人的话。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) people who are mean; unkind people.","zh":"（名词复数）刻薄的人；不友善的人。"},"examples":[{"en":"Ignore the meaners online and focus on supportive comments.","zh":"别理网上那些刻薄的人，多关注支持你的评论。"},{"en":"The story has bullies and meaners, but also kind friends.","zh":"这个故事里有霸凌者和刻薄的人，也有善良的朋友。"}]}],"synonyms":["crueller","harsher","unkinder","bullies (similar, not exact)","jerks (informal)"],"phonetic":"ˈmiːnərz","extraExplanation":["“mean”这个词本身有好几种常见意思：①刻薄的/不友善的（mean to someone）；②吝啬的、小气的（mean with money）；③平均数（the mean）。因此“meaner(s)”在不同语境里可能是“更刻薄/更小气”，也可能与数学里的“平均数”有关（不过“meaner”用于数学很少见）。"]}
{"word":"meanest","summary":{"en":"“Meanest” is the superlative form of “mean,” most commonly meaning “the most unkind/cruel,” and sometimes “the most stingy.”","zh":"“meanest”是“mean”的最高级，最常见表示“最刻薄/最恶毒的”，有时也表示“最小气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “mean” (unkind or cruel): the most unkind.","zh":"“mean”（刻薄/恶意的）的最高级：最刻薄的，最恶毒的。"},"examples":[{"en":"That was the meanest thing anyone has ever said to me.","zh":"那是别人对我说过最刻薄的话。"},{"en":"He can be the meanest when he feels embarrassed.","zh":"他觉得尴尬时反而会变得最刻薄。"}]},{"partOfSpeech":"adj.","definition":{"en":"Superlative of “mean” (not generous; stingy): the most unwilling to spend or share.","zh":"“mean”（小气的）的最高级：最吝啬的，最不愿意花钱/分享的。"},"examples":[{"en":"Of all my roommates, he was the meanest with money.","zh":"在我所有室友里，他对钱最小气。"},{"en":"Don’t be the meanest person at the table—share the fries.","zh":"别当桌上最小气的人——分点薯条吧。"}]},{"partOfSpeech":"adj.","definition":{"en":"Superlative of “mean” (mathematics: average): the lowest/least favorable average value in a set.","zh":"“mean”（数学：平均值）的最高级：一组数据中最低/最不理想的平均值（较少见用法）。"},"examples":[{"en":"This group showed the meanest improvement in test scores.","zh":"这一组的平均提升幅度最小。"}]}],"synonyms":["cruelest","unkindest","nastiest","most spiteful","stingiest"],"phonetic":"/ˈmiːnɪst/","extraExplanation":["“meanest”通常出现在口语里，最常见是“最刻薄/最坏的”（unkind）。要表达“最厉害/最酷”，英语里一般不会用 meanest；更自然的是 “the best / the coolest / the toughest”（视语境而定）。","注意“mean”有多个常见含义：①刻薄的；②小气的；③表示“意味着”(verb)。所以看到“meanest”时，先根据上下文判断是在说“人很刻薄”还是“人很小气”。"]}
{"word":"meanie","summary":{"en":"“Meanie” is an informal word for someone who is being unkind or rude.","zh":"“Meanie”是口语词，指一个人很不友善、很刻薄（常带孩子气或随口抱怨的语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is unkind or rude, especially in a childish or casual way","zh":"刻薄鬼；坏家伙（常用于孩子气或随口的说法，指人很不友善）"},"examples":[{"en":"Stop being a meanie and share your toys.","zh":"别当小气刻薄鬼了，把玩具分享一下。"},{"en":"He teased her all day, and she called him a meanie.","zh":"他逗弄她一整天，她就叫他“坏家伙”。"}]}],"synonyms":["bully","jerk","cruel person","nasty person"],"phonetic":"/ˈmiːni/","extraExplanation":["“Meanie”语气通常比“mean person”更幼稚、更口语，常见于家长对孩子或孩子之间的对话。用在成人场合也可以，但往往带点开玩笑或轻微抱怨的感觉。","注意：这里的“mean”指“刻薄/不友善”，不是“意思是（mean = signify）”或“平均的（mean = average）”。"]}
{"word":"meanies","summary":{"en":"“Meanies” is the informal plural of “meanie,” meaning people who are unkind or bully others.","zh":"“meanies”是非正式用语，为“meanie”的复数，指刻薄的人或爱欺负别人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are unkind or cruel (informal).","zh":"刻薄的人；坏心眼的人（非正式用语）。"},"examples":[{"en":"Ignore the meanies online and focus on your friends.","zh":"别理网上那些刻薄的人，专注于你的朋友就好。"},{"en":"The kids called him names, but the teacher told the meanies to stop.","zh":"孩子们给他起外号，但老师让那些坏心眼的人停止。"}]},{"partOfSpeech":"n.","definition":{"en":"A plural form of “meanie,” someone who behaves in a mean or bullying way (often said by children).","zh":"“meanie”的复数；指行为刻薄或爱欺负人的人（常见于儿童用语）。"},"examples":[{"en":"Don’t be meanies—share the toys.","zh":"别当刻薄鬼——把玩具分享一下。"},{"en":"They’re not meanies; they just didn’t understand.","zh":"他们不是坏心眼，只是没理解。"}]}],"synonyms":["bullies","jerks","mean people","cruel people"],"phonetic":"ˈmiːniz","extraExplanation":["“meanie”来自形容词“mean”（刻薄的、卑鄙的），加上名词后缀“-ie”，语气更口语、更像小孩说法。","在成年人之间直接说“you’re a meanie”通常带有轻微玩笑或不太正式的责备；更正式的表达可用“bully”（霸凌者）、“unkind person”（不友善的人）、“cruel person”（残忍的人）。"]}
{"word":"meaning","summary":{"en":"I can explain the meaning, usage, and examples—but I need the specific word/phrase.","zh":"我可以解释词义、用法并给例句——但需要你提供具体要查的单词/短语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Please tell me the word or phrase you want the meaning of (you can also send a sentence or a photo).","zh":"请告诉我你想查“meaning”的哪个单词或短语（也可以发一句话或图片）。"},"examples":[{"en":"What’s the meaning of “serene”?","zh":"“serene”是什么意思？"},{"en":"In this sentence, what does “run into” mean?","zh":"在这句话里，“run into”是什么意思？"}]}],"synonyms":["definition","sense","significance"],"phonetic":"/ˈmiː.nɪŋ/"}
{"word":"meaningful","summary":{"en":"Meaningful describes something that has real purpose, importance, or a clear message; it can also mean “suggestive” (a meaningful look).","zh":"meaningful 指“有意义、有价值/目的明确”，也可指“意味深长、带暗示”的（如意味深长的眼神）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a clear purpose, importance, or value; not empty or trivial.","zh":"有意义的；有明确目的、重要性或价值的；不空洞、不肤浅的。"},"examples":[{"en":"She wants a meaningful job, not just a high salary.","zh":"她想要一份有意义的工作，而不只是高薪。"},{"en":"We had a meaningful conversation about what really matters in life.","zh":"我们进行了一次有意义的谈话，讨论人生中真正重要的事。"},{"en":"Volunteering can be a meaningful way to spend your time.","zh":"做志愿者可以是一种有意义的方式来度过你的时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"Intended to express a particular meaning; significant in what it shows or suggests.","zh":"意在表达特定含义的；意味深长的；能显示或暗示重要信息的。"},"examples":[{"en":"He gave her a meaningful look, as if he knew the secret.","zh":"他意味深长地看了她一眼，仿佛他知道那个秘密。"},{"en":"The pause was meaningful—everyone understood something was wrong.","zh":"那次停顿很耐人寻味——大家都明白出事了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Full of meaning; easy to interpret as communicating an idea or message.","zh":"富有含义的；表达清楚、传达信息明确的。"},"examples":[{"en":"Use meaningful names for your files so you can find them later.","zh":"给文件取有意义的名字，这样你以后更容易找到。"},{"en":"The chart is meaningful only if the data is accurate.","zh":"只有数据准确，这张图表才有意义。"}]}],"synonyms":["significant","purposeful","important","worthwhile","meaningful","suggestive","telling"],"phonetic":"/ˈmiːnɪŋfəl/","extraExplanation":["“meaningful”常见搭配：a meaningful life（有意义的人生）、a meaningful relationship（有意义/有深度的关系）、meaningful work（有意义的工作）、meaningful change（有实质意义的改变）、a meaningful gesture（有分量/有心意的举动）。","在口语里，“meaningful”既可以指“对你重要、有价值”，也可以指“意味深长、暗示某种信息”（meaningful look/smile）。需要根据语境判断。"]}
{"word":"meaningfully","summary":{"en":"Meaningfully means “in a way that truly matters or has real impact,” and it can also mean “significantly” in academic or formal contexts.","zh":"meaningfully 表示“有意义地、真正有影响地”；在学术/正式语境中也可表示“显著地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has clear purpose, importance, or real effect; not trivial or random.","zh":"有意义地；以有明确目的、重要性或实际效果的方式；不是琐碎或随意的。"},"examples":[{"en":"She volunteers meaningfully, choosing work that truly helps the community.","zh":"她做志愿服务很有意义，选择真正能帮助社区的工作。"},{"en":"To improve your English meaningfully, practice speaking in real-life situations.","zh":"要有意义地提高英语，就要在真实生活情境中练习口语。"}]},{"partOfSpeech":"adv.","definition":{"en":"(In research or statistics) To a degree that is important or noticeable, not just due to chance.","zh":"（科研或统计）显著地；达到重要或可察觉的程度，而不是偶然造成的。"},"examples":[{"en":"The new policy meaningfully reduced wait times at the clinic.","zh":"新政策显著缩短了诊所的等候时间。"},{"en":"Test scores increased meaningfully after the program was introduced.","zh":"引入该项目后，测试成绩有明显提升。"}]}],"synonyms":["significantly","substantially","purposefully","with meaning","in a meaningful way"],"phonetic":"/ˈmiːnɪŋfəli/","extraExplanation":["“meaningfully”常用来对比“superficially（表面上）/ nominally（名义上）”。比如：The company changed meaningfully（真正有实质变化），not just in name（不只是改个名字）。","日常英语里，它常搭配动词如: contribute, engage, connect, improve, change, reduce，强调“有实质影响/真正起作用”。"]}
{"word":"meaningfulness","summary":{"en":"Meaningfulness is the quality of being meaningful—having real value, purpose, or significance.","zh":"Meaningfulness 指“有意义”的特质——具有真实的价值、目的或重要性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being meaningful; importance, value, or significance","zh":"“有意义”的特质；重要性、价值或意义"},"examples":[{"en":"Volunteering gave her life a sense of meaningfulness.","zh":"志愿服务让她的生活有了意义感。"},{"en":"The meaningfulness of the ceremony was more important than the cost.","zh":"仪式的意义比花多少钱更重要。"},{"en":"He questioned the meaningfulness of doing work that harmed the environment.","zh":"他质疑做伤害环境的工作是否有意义。"}]},{"partOfSpeech":"n.","definition":{"en":"in language or symbols, the degree to which something clearly communicates meaning","zh":"（语言或符号中）表达意义的清晰程度；可理解性/语义性"},"examples":[{"en":"The teacher focused on the meaningfulness of the new words in real conversations.","zh":"老师强调让新单词在真实对话中变得更有意义、更好理解。"},{"en":"Without context, the slogan loses meaningfulness.","zh":"没有语境，这句口号就失去意义了。"}]}],"synonyms":["significance","importance","value","purpose","sense","worth"],"phonetic":"/ˈmiːnɪŋfʊlnəs/","extraExplanation":["“meaningfulness”由 meaningful（有意义的）+ -ness（名词后缀，表示“……的性质/状态”）构成，常用于讨论生活的意义、工作的价值、某件事的重要性。","常见搭配：a sense of meaningfulness（意义感）；the meaningfulness of life/work/relationships（生活/工作/关系的意义）。"]}
{"word":"meaningless","summary":{"en":"“Meaningless” describes something without meaning, purpose, or value, or words/information that don’t make sense.","zh":"“meaningless”表示没有意义、目的或价值的，也可指语言/信息不表达清楚、显得荒谬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no meaning, purpose, or value; not important.","zh":"无意义的；没有目的或价值的；不重要的。"},"examples":[{"en":"After the argument, their apology felt meaningless.","zh":"争吵之后，他们的道歉显得毫无意义。"},{"en":"Some people think chasing fame is meaningless.","zh":"有些人觉得追逐名声是没有意义的。"},{"en":"Don’t worry about meaningless comments online.","zh":"别为网上那些无意义的评论烦恼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language or information) Not communicating a clear idea; nonsensical.","zh":"（指语言或信息）表达不清、难以理解的；荒谬的。"},"examples":[{"en":"The sentence was meaningless because the words didn’t fit together.","zh":"这句话毫无意义，因为词语搭配不起来。"},{"en":"The chart is meaningless without labels.","zh":"没有标注，这张图表就没有意义。"}]}],"synonyms":["pointless","senseless","empty","hollow","nonsensical","trivial"],"phonetic":"/ˈmiːnɪŋləs/","extraExplanation":["“meaningless”通常带有较强的主观评价，语气可能偏负面。若想更委婉，可以用“not very meaningful（不太有意义）”“doesn’t really matter（没那么重要）”“not worth it（不值得）”。","词形拆解：meaning（意义）+ -less（没有……的）→ “没有意义的”。常见同类结构：careless（粗心的）、hopeless（无望的）、endless（无尽的）。"]}
{"word":"meaninglessly","summary":{"en":"“Meaninglessly” means “without meaning or purpose,” or “in a thoughtless, automatic way.”","zh":"“meaninglessly”表示“毫无意义地”，也可指“心不在焉地、机械地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no clear meaning, purpose, or value.","zh":"以没有明确意义、目的或价值的方式；毫无意义地。"},"examples":[{"en":"He scrolled meaninglessly through his phone while waiting.","zh":"他在等候时毫无意义地刷着手机。"},{"en":"The characters moved meaninglessly across the screen.","zh":"字符毫无意义地在屏幕上移动。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a thoughtless or automatic way, without real attention or feeling.","zh":"心不在焉地；机械地（没有真正的注意或情感）。"},"examples":[{"en":"She nodded meaninglessly, not really listening.","zh":"她心不在焉地点头，其实并没在听。"},{"en":"He apologized meaninglessly, as if it were a habit.","zh":"他机械地道歉，仿佛只是习惯动作。"}]}],"synonyms":["pointlessly","purposelessly","mindlessly","emptily","senselessly"],"phonetic":"/ˈmiːnɪŋləsli/","extraExplanation":["“meaninglessly”来自形容词“meaningless（无意义的）”+ 副词后缀“-ly”，表示“以……的方式”。常用来批评某个动作/话语/过程缺乏目的或真诚。与“meaningfully（有意义地）”形成对比。"]}
{"word":"meaninglessness","summary":{"en":"Meaninglessness is the state of lacking meaning, purpose, or significance; it can also describe empty or unimportant words or actions.","zh":"meaninglessness 指缺乏意义、目的或重要性的状态；也可指言行空洞、缺乏实质内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of having no meaning, purpose, or significance.","zh":"无意义；毫无目的或重要性。"},"examples":[{"en":"After losing his job, he felt a deep sense of meaninglessness.","zh":"失业后，他感到一种深深的无意义感。"},{"en":"The novel explores the meaninglessness of war and the cost to ordinary people.","zh":"这部小说探讨了战争的无意义以及普通人付出的代价。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being unclear, empty, or not communicating anything important.","zh":"（话语/行为）空洞、说不清重点；没有表达出重要内容。"},"examples":[{"en":"They talked for an hour, but the meaninglessness of the conversation left her tired.","zh":"他们聊了一个小时，但那段对话的空洞让她很疲惫。"},{"en":"He apologized, but his words had a certain meaninglessness because he didn’t change his behavior.","zh":"他道歉了，但由于没有改变行为，他的话显得有些空洞。"}]}],"synonyms":["pointlessness","emptiness","insignificance","futility","purposelessness"],"phonetic":"/ˈmiːnɪŋləsnəs/","extraExplanation":["“meaninglessness”常用于哲学与文学语境，尤其与存在主义（existentialism）相关，用来描述人在面对死亡、孤独或社会压力时产生的“人生无意义感”。","常见搭配：a sense of meaninglessness（无意义感）、feel/experience meaninglessness（感到/经历无意义）、the meaninglessness of life/war/suffering（生命/战争/苦难的无意义）。","近义词有 nuance 差别：emptiness 更偏“空虚”；pointlessness 更偏“做某事不值得/没用”；futility 常用于“努力徒劳”的语气。"]}
{"word":"meaningly","summary":{"en":"“Meaningly” means “in a meaningful or intentional way,” often used for looks or pauses that suggest something without saying it directly.","zh":"“Meaningly”表示“有意义地/有意地”，常用于描述意味深长的眼神、停顿等，暗示某事但不明说。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that shows clear meaning, significance, or intention; meaningfully","zh":"有意义地；意味深长地（以能清楚表达含义、重要性或意图的方式）"},"examples":[{"en":"She paused and looked at him meaninɡly, as if asking him to speak up.","zh":"她停顿了一下，意味深长地看着他，仿佛在示意他把话说清楚。"},{"en":"The teacher chose her words meaninɡly so the class would understand the lesson.","zh":"老师有意地选择措辞，让全班更容易理解这节课。"}]}],"synonyms":["meaningfully","significantly","pointedly","intentionally"],"phonetic":"/ˈmiːnɪŋli/","extraExplanation":["“meaningly”在现代英语中相对少见，更常用的是“meaningfully”。在写作中如果想表达“意味深长地/有意地”，用“meaningfully”会更自然。","常见搭配：look/glance/smile meaningly（意味深长地看/瞥/笑）。"]}
{"word":"meaningness","summary":{"en":"“Meaningness” is a rare/nonstandard noun meaning “the quality of having meaning.” In most cases, use “meaning,” “meaningfulness,” or “significance.”","zh":"“meaningness”是少见/不太标准的名词，表示“有意义的性质”。大多数情况下用“meaning / meaningfulness / significance”更自然。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having meaning or significance; how meaningful something feels. (This is not a standard/common word in modern English.)","zh":"“有意义/有含义”的性质；某事物的意义感。（该词在现代英语中并不常见，属于不太标准的用法。）"},"examples":[{"en":"Some writers talk about the “meaningness” of a poem, but most people would say “meaning” or “meaningfulness.”","zh":"有些作者会谈论一首诗的“meaningness（意义性）”，但大多数人会说“meaning（意义）”或“meaningfulness（意义感/有意义的程度）”。"},{"en":"I’m looking for more meaning in my work—not just a higher salary.","zh":"我想在工作中找到更多意义，而不只是更高的薪水。"}]}],"synonyms":["meaning","meaningfulness","significance","importance"],"phonetic":"/ˈmiːnɪŋnəs/","extraExplanation":["“meaningness”在主流英语里很少见，听起来像是临时造词（把 -ness 接到 meaning 上）。更自然的表达通常是：meaning（意义/含义）、meaningfulness（意义感/有意义的程度）、significance（重要性/意义）。","在学术或文学讨论里，偶尔有人会用“meaningness”强调“意义性”这一抽象特征，但日常写作和正式写作更建议用“meaningfulness”或“significance”。"]}
{"word":"meanings","summary":{"en":"Which word or phrase would you like the meanings for? Please type it (and a sentence if you have one).","zh":"你想查哪个单词或短语的意思？请把词/短语发我（如果有例句也一起发）。"}}
{"word":"meanish","summary":{"en":"Meanish means “a little mean or unkind,” usually in an informal, softer way than mean.","zh":"meanish 表示“有点刻薄/不友善”，通常是非正式用法，语气比 mean 更缓和。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat mean, unkind, or rude; not extremely bad, but a little unpleasant in attitude or behavior.","zh":"有点刻薄/不友善/不客气的；不算很严重，但态度或行为有些让人不舒服。"},"examples":[{"en":"He wasn’t truly cruel—just meanish when he was stressed.","zh":"他并不是真的残忍——只是压力大时有点刻薄。"},{"en":"Her comment sounded meanish, even if she didn’t mean to hurt anyone.","zh":"她的评论听起来有点刺耳，即使她并不想伤害任何人。"},{"en":"Don’t be meanish to your little brother; he’s trying to help.","zh":"别对你弟弟那么刻薄；他是在帮忙。"}]}],"synonyms":["slightly mean","unkind","a bit rude","snippy","sharp"],"phonetic":"/ˈmiːnɪʃ/","extraExplanation":["“-ish” 是英语里很常见的后缀，表示“有点……、带点……、大概……”。所以 meanish = mean（刻薄的） + ish（有点）。类似的还有 childish（孩子气的）、reddish（偏红的）、sixish（大概六点左右，口语）。","“meanish” 多用于口语或轻松的语境，语气比 mean（刻薄的）弱一些，常带有“不是很严重但不太好”的感觉。"]}
{"word":"meanless","summary":{"en":"Meaningless means ‘having no meaning or value; pointless.’","zh":"meaningless 指“没有意义或价值的；徒劳的、空洞的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having any meaning, purpose, or importance; empty or pointless.","zh":"没有意义的；没有目的或重要性的；空洞或无价值的。"},"examples":[{"en":"The argument became meaningless when no one listened to the facts.","zh":"当没人听事实时，这场争论就变得毫无意义。"},{"en":"He felt his job was meaningless without a chance to help others.","zh":"如果没有机会帮助别人，他觉得自己的工作毫无意义。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language or behavior) not communicating anything clear; hard to understand or senseless.","zh":"（指语言或行为）表达不清或无法理解的；无意义的、荒谬的。"},"examples":[{"en":"Her reply was so vague that it sounded almost meaningless.","zh":"她的回复太含糊了，听起来几乎毫无意义。"},{"en":"The baby made meaningless sounds before learning words.","zh":"宝宝在学会说词语之前会发出一些无意义的声音。"}]}],"synonyms":["pointless","senseless","empty","hollow","futile"],"phonetic":"/ˈmiːnɪŋləs/","extraExplanation":["你输入的 **meanless** 通常是拼写错误，正确拼写是 **meaningless**（有两个 i）。","常见搭配：**meaningless talk**（空谈）、**meaningless gesture**（没有实际作用的举动）、**feel meaningless**（感到没有意义）。","语气上，meaningless 往往带有较强的否定评价；如果想更委婉，可以用 **not very meaningful**（不太有意义的）。"]}
{"word":"meanly","summary":{"en":"“Meanly” means “in a cruel or unkind way,” and less commonly “in a poor or shabby way.”","zh":"“meanly”常指“刻薄地/不友善地”，较少见也可指“简陋地/寒酸地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cruel, unkind, or petty way; not generous or considerate.","zh":"刻薄地；卑鄙地；不友善地（带有小气、恶意或不厚道的感觉）。"},"examples":[{"en":"He spoke meanly to his sister and made her cry.","zh":"他刻薄地对妹妹说话，把她说哭了。"},{"en":"Don’t laugh meanly at someone’s mistakes.","zh":"不要刻薄地嘲笑别人的错误。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a poor, shabby, or low-quality way (about conditions or appearance).","zh":"简陋地；寒酸地；质量很差地（形容环境或外观）。"},"examples":[{"en":"They lived meanly in a small room with very little furniture.","zh":"他们住在一间很小的房间里，家具很少，生活很简陋。"},{"en":"The village was meanly built, with narrow streets and old houses.","zh":"这个村子建得很简陋，街道狭窄、房子老旧。"}]}],"synonyms":["unkindly","cruelly","rudely","pettily","stingily","shabbily"],"phonetic":"/ˈmiːnli/","extraExplanation":["“meanly”来自形容词“mean”。在现代日常英语里，表示“刻薄地/小气地”的用法更常见；表示“简陋地/寒酸地”的用法偏书面或较旧一些。","注意区分：meanly（adv. 刻薄地/寒酸地）≠ mainly（adv. 主要地）。这两个词拼写很像，但意思完全不同。","更自然的口语替代词常用：cruelly（残忍地）、unkindly（不友善地）、rudely（粗鲁地）；如果想表达“小气地”，也可说“stingily”。"]}
{"word":"meanness","summary":{"en":"Meanness means cruelty/unkindness, and it can also mean stinginess with money.","zh":"meanness 指“刻薄/恶意”，也可指“吝啬（在钱上小气）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"unkind or cruel behavior; a desire to hurt, embarrass, or deprive others.","zh":"刻薄、恶意；对他人不友善或残忍的行为（有意伤害、羞辱或刁难别人）。"},"examples":[{"en":"The meanness of the comment shocked everyone in the room.","zh":"那句评论的刻薄让房间里所有人都很震惊。"},{"en":"He apologized for his meanness and tried to be more respectful.","zh":"他为自己的刻薄道歉，并努力变得更尊重别人。"},{"en":"Don’t answer meanness with meanness; stay calm and polite.","zh":"不要用刻薄回击刻薄；保持冷静和礼貌。"}]},{"partOfSpeech":"n.","definition":{"en":"extreme stinginess; unwillingness to spend or share money.","zh":"吝啬；不愿意花钱或与人分享金钱。"},"examples":[{"en":"His meanness made it hard to enjoy meals together because he never wanted to split the bill fairly.","zh":"他的吝啬让大家很难一起吃饭，因为他从不愿意公平分摊账单。"},{"en":"She disliked the meanness of refusing to tip the server.","zh":"她不喜欢那种连小费都不愿意给的吝啬。"}]}],"synonyms":["unkindness","cruelty","spitefulness","malice","stinginess","miserliness"],"phonetic":"/ˈmiːnnəs/","extraExplanation":["“meanness”常见于两种意思：①“刻薄/恶意”（更常见，尤其描述言语或态度）；②“吝啬”（也常见，和 money/spend/share 等词一起出现时更明显）。语境不同，重点不同。","词根来自“mean”。注意：mean 作形容词既可表示“刻薄的”，也可表示“卑鄙的/不善良的”，还可表示“吝啬的”。但 mean 作动词则是“意思是/打算”，与 meanness（名词）无关。","近义词区分：cruelty 更偏“残忍”（伤害更严重）；rudeness 更偏“粗鲁无礼”（不一定带恶意）；stinginess/miserliness 更偏“吝啬”（金钱相关）。"]}
{"word":"meannesses","summary":{"en":"“Meannesses” is the plural of “meanness,” meaning unkindness/cruelty or stinginess; less commonly, it can mean shabbiness or poor quality.","zh":"“Meannesses”是“meanness”的复数，常指刻薄/恶意或吝啬；较少见时也可指寒酸或低劣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"unkind or cruel behavior; spitefulness.","zh":"刻薄；恶意；苛刻的行为。"},"examples":[{"en":"Her constant meannesses made the team feel unsafe.","zh":"她不断的刻薄行为让团队感到不安全。"},{"en":"He apologized for the meannesses he said during the argument.","zh":"他为争吵时说出的刻薄话道了歉。"}]},{"partOfSpeech":"n.","definition":{"en":"the habit of not wanting to spend money; stinginess.","zh":"吝啬；小气（不愿花钱的习惯）。"},"examples":[{"en":"His meannesses with tips annoyed the waiters.","zh":"他在小费上很小气，惹恼了服务员。"},{"en":"They criticized the company’s meannesses in employee benefits.","zh":"他们批评这家公司在员工福利上的吝啬。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) poor quality or a low, shabby condition.","zh":"（较少见）低劣；寒酸；简陋的状态。"},"examples":[{"en":"The room’s meannesses were obvious: broken chairs and thin blankets.","zh":"房间的寒酸很明显：破椅子和薄毯子。"}]}],"synonyms":["unkindness","cruelty","spite","malice","stinginess","miserliness","pettiness","shabbiness"],"phonetic":"ˈmiːn.nəs","extraExplanation":["“Meannesses”是名词复数，单数是“meanness”。它来自形容词“mean”。注意“mean”在现代英语里常见两条主线：一条是“刻薄/不友善”，另一条是“吝啬”；而“低劣/寒酸”这一义更偏旧式或文学语境。"]}
{"word":"means","summary":{"en":"Tell me the exact word/phrase or the sentence you saw, and I’ll explain its meaning with examples.","zh":"把你看到的具体单词/短语或整句话发给我，我会用例句帮你解释意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Please tell me the word or phrase you want to look up (e.g., a single word, an idiom, or a full sentence).","zh":"请告诉我你想查询的单词或短语（例如：一个单词、一个习语，或一句完整的话）。"},"examples":[{"en":"What does “means” mean in this sentence: “By all means, come in”?","zh":"在这句话里 “means” 是什么意思：“By all means, come in”（当然，请进）？"},{"en":"Can you explain what “means” means here: “We need a means of transport”?","zh":"你能解释一下这里的 “means” 吗：“We need a means of transport”（我们需要一种交通方式）？"}]}],"phonetic":"/minz/"}
{"word":"meanspirited","summary":{"en":"“Meanspirited” describes unkind, petty, or cruel behavior or comments meant to hurt or humiliate others.","zh":"“meanspirited”指刻薄、小气、带恶意的言行，常带有伤人或让人难堪的目的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Ungenerous, unkind, or cruel; showing a desire to hurt, embarrass, or put others down (often in small, petty ways).","zh":"小气刻薄的；不宽厚的；（常指以琐碎、卑劣的方式）故意伤人、羞辱或贬低他人的。"},"examples":[{"en":"That was a mean-spirited joke about her accent.","zh":"那个拿她口音开玩笑的段子很刻薄。"},{"en":"The review felt mean-spirited, focusing on personal attacks instead of the work.","zh":"那篇评论显得很恶毒，重点在攻击个人而不是作品。"},{"en":"Try to criticize the idea without sounding mean-spirited.","zh":"尽量批评观点本身，不要显得刻薄。"}]}],"synonyms":["unkind","spiteful","malicious","petty","cruel","nasty"],"phonetic":"/ˌmiːn ˈspɪrɪtɪd/","extraExplanation":["“mean-spirited”由 mean（刻薄的）+ spirited（有某种精神/气质的）构成，整体意思是“心胸狭窄、带恶意的”。常用于形容言语、评论、行为或态度，而不一定指一个人“天生坏”。","注意区分 mean-spirited 和 mean：mean 既可表示“刻薄的”，也可表示“吝啬的”；mean-spirited 更强调“带恶意、想让别人难堪/受伤”的那种刻薄。","常见搭配：mean-spirited remark/joke/comment/attack（刻薄的言论/玩笑/评论/攻击）。相近但语气不同：petty（小肚鸡肠的）、spiteful（怀恨报复的）、malicious（恶意的，偏正式、强烈）。"]}
{"word":"meanspiritedly","summary":{"en":"“Meanspiritedly” means “in a cruel or nasty way,” showing unkind intentions.","zh":"“meanspiritedly”表示“以刻薄、恶意的方式”，强调不友善、想伤人的态度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cruel, nasty, or unkind way; showing a small-minded desire to hurt or embarrass someone.","zh":"以刻薄、恶意、缺德的方式；带着狭隘的心态去伤害或羞辱别人。"},"examples":[{"en":"He mean-spiritedly mocked her accent in front of the whole class.","zh":"他在全班面前刻薄地嘲笑她的口音。"},{"en":"The article mean-spiritedly attacked the actor’s appearance instead of discussing the film.","zh":"那篇文章没有讨论电影，反而恶意攻击演员的外貌。"}]}],"synonyms":["cruelly","unkindly","spitefully","maliciously","nastily"],"phonetic":"/ˌmin ˈspɪrɪtədli/","extraExplanation":["“mean-spiritedly”来自形容词“mean-spirited”（刻薄的、心胸狭窄的）+ 副词后缀“-ly”。其中“mean”在这里不是“意思是”，而是“吝啬/卑鄙/刻薄”的意思（如：a mean comment 刻薄的评论）。","常见搭配：mean-spiritedly criticize/mock/attack/joke（刻薄地批评/嘲笑/攻击/开玩笑）。它常用来评价言行的“动机和态度”，强调“恶意”或“想伤人”。"]}
{"word":"meanspiritedness","summary":{"en":"Mean-spiritedness means a petty, unkind, often spiteful attitude or behavior.","zh":"Mean-spiritedness 指刻薄、卑劣、带恶意的态度或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being unkind, petty, or cruel in attitude or behavior, especially in a way that enjoys criticizing or hurting others","zh":"刻薄；卑劣；恶意（指态度或行为不善良、心胸狭隘，常带着喜欢挑剔或伤人的意味）"},"examples":[{"en":"Her success was met with mean-spiritedness instead of congratulations.","zh":"她的成功没有得到祝贺，反而遭遇了刻薄的冷嘲热讽。"},{"en":"The online comments were full of mean-spiritedness and personal attacks.","zh":"网上评论充满恶意和人身攻击。"}]}],"synonyms":["spitefulness","malice","pettiness","cruelty","vindictiveness"],"phonetic":"/ˌmiːnˈspɪrɪtɪdnəs/","extraExplanation":["mean-spiritedness 来自形容词 mean-spirited（刻薄的、心胸狭隘的）+ 名词后缀 -ness（表示“……的状态/性质”）。日常表达里也常用 cruelty（残忍）、spite（恶意）、pettiness（小气、斤斤计较）来描述相近的负面态度。","语气与使用场景：mean-spiritedness 往往强调“故意刁难/冷嘲热讽/不厚道”的社会性恶意，比单纯的 rudeness（无礼）更强；但通常又没有 violence（暴力）那种极端含义。常见搭配：a streak of mean-spiritedness（有一丝刻薄）、mean-spiritedness toward someone（对某人刻薄）、full of mean-spiritedness（充满恶意）。"]}
{"word":"meant","summary":{"en":"“Meant” is the past form of “mean”: it can show intention (“I meant to…”) or explain meaning (“What do you mean?”).","zh":"“meant”是“mean”的过去式/过去分词：可表示“本来打算”（I meant to…），也可表示“意思是/指的是”（What do you mean?）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Intended (used to show what someone wanted, planned, or was supposed to do).","zh":"打算的；意欲的（用于表示某人想做、计划做或应该做的事）。"},"examples":[{"en":"I meant to call you last night, but I fell asleep.","zh":"我昨晚本来打算给你打电话，但我睡着了。"},{"en":"This message is meant for you.","zh":"这条消息是给你的。"}]},{"partOfSpeech":"v.","definition":{"en":"Understood or implied (used to explain the real idea or message).","zh":"指的是；意思是（用于解释真正想表达的含义）。"},"examples":[{"en":"What do you mean by that?","zh":"你这话是什么意思？"},{"en":"I didn’t mean that you were wrong—I just had a different idea.","zh":"我不是说你错了——我只是有不同的想法。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “mean” (to intend; to signify).","zh":"“mean”的过去式和过去分词（表示“打算；意味着/意思是”）。"},"examples":[{"en":"I meant what I said.","zh":"我说到做到/我说的是真心话。"},{"en":"She meant no harm.","zh":"她没有恶意。"}]}],"synonyms":["intended","planned","signified","implied"],"phonetic":"/mɛnt/","extraExplanation":["“meant”是动词“mean”的过去式/过去分词。常见口语搭配：\n- mean to do sth = 本来打算做某事\n- mean by… = ……是什么意思/你指的是……\n- be meant to do sth = 被设计用来/按理说应该做……（例如：This key is meant to open the door. 这把钥匙是用来开门的。）","注意区分：mean（动词：打算/意味着）与 mean（形容词：刻薄的；吝啬的）。例如：He is mean.（他很刻薄/小气。）这里不是“meant”的用法。"]}
{"word":"meantes","summary":{"en":"“Meantes” isn’t standard English; it’s usually a misspelling of “meant” (past of mean): intended or meant ‘signified.’","zh":"“meantes”不是标准英语，通常是“meant”（mean 的过去式）的拼写错误：表示“本来打算”或“意思是/指的是”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually a misspelling of “meant” (past tense of “mean”).","zh":"不是标准英语单词；通常是把“meant”（“mean”的过去式）拼错了。"},"examples":[{"en":"I think you meant “meant,” not “meantes.”","zh":"我觉得你想写的是“meant”，不是“meantes”。"},{"en":"Sorry—I meant to text you earlier.","zh":"不好意思——我本来想早点给你发短信。"}]},{"partOfSpeech":"adj.","definition":{"en":"(meant) Intended; planned to do something.","zh":"（meant）打算的；原本计划要做某事的。"},"examples":[{"en":"I meant to call, but I got busy.","zh":"我本来想打电话的，但后来忙起来了。"},{"en":"This form is meant for new students.","zh":"这张表是给新学生用的。"}]},{"partOfSpeech":"v.","definition":{"en":"(meant) Was the meaning of; referred to.","zh":"（meant）意思是；指的是。"},"examples":[{"en":"What did you mean by that comment?","zh":"你那句话是什么意思？"},{"en":"When I said “fine,” I meant “okay,” not “great.”","zh":"我说“fine”的意思是“还行”，不是“很棒”。"}]}],"synonyms":["intended","planned","signified"],"phonetic":"/mɛnt/","extraExplanation":["“meant”是动词“mean”的过去式/过去分词，常见结构有：\n1) mean to do = 打算做某事（I meant to help.）\n2) be meant for = 为……准备/ предназнач（This is meant for children.）\n3) mean by = ……是什么意思（What do you mean by that?）\n如果你告诉我你看到“meantes”的完整句子，我也可以帮你判断你该用“meant”还是“means”。"]}
{"word":"meantime","summary":{"en":"Meantime means the period between events, or ‘during that period,’ similar to ‘meanwhile’ (often used in more formal writing).","zh":"Meantime 表示两件事之间的这段时间，或“在此期间/与此同时”，意思接近 meanwhile（更偏书面或正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time between two events; the period while something else is happening","zh":"两件事之间的时间；在另一件事发生期间的这段时间"},"examples":[{"en":"The repairs will take a week; in the meantime, we’ll stay with my sister.","zh":"维修要花一周；在此期间，我们先住在我姐姐家。"},{"en":"Dinner will be ready soon. In the meantime, help yourself to some tea.","zh":"晚饭很快就好。在此期间，你先喝点茶吧。"}]},{"partOfSpeech":"adv.","definition":{"en":"during the time between two events; meanwhile","zh":"在此期间；与此同时"},"examples":[{"en":"I’ll call the doctor. Meantime, keep him comfortable.","zh":"我去给医生打电话。与此同时，让他舒服一点。"},{"en":"The manager is in a meeting; meantime, please take a seat.","zh":"经理在开会；同时，请先坐一下。"}]}],"synonyms":["meanwhile","in the interim","for the time being"],"phonetic":"/ˈmiːn.taɪm/","extraExplanation":["“meantime”常见于较正式或书面语；日常口语里更常说“meanwhile”。两者意思非常接近。","固定搭配“in the meantime”极常用，表示“在这段时间里（先做别的）”，语气通常带有“等待/过渡”的感觉。"]}
{"word":"meantimes","summary":{"en":"Meantime(s) refers to the time between two events, often meaning “while waiting; meanwhile.”","zh":"Meantime(s)指两件事之间的这段时间，常表示“在此期间；与此同时”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"during the time between two events; while waiting for something else to happen","zh":"在两件事之间的这段时间里；与此同时（常用于等待某事发生时）"},"examples":[{"en":"The repair will take a week. In the meantime, you can use my laptop.","zh":"维修要花一周。与此同时，你可以用我的笔记本电脑。"},{"en":"I’ll call the doctor; meanwhile, please stay calm.","zh":"我去给医生打电话；与此同时，请保持冷静。"}]},{"partOfSpeech":"n.","definition":{"en":"the period of time between two events (often used in the phrase “in the meantime”)","zh":"两件事之间的间隔时间（常用于短语“in the meantime”）"},"examples":[{"en":"Our flight was delayed, so we read in the meantime.","zh":"我们的航班延误了，所以我们在这段时间里读书打发时间。"},{"en":"They moved temporarily; in the meantime, their house was being renovated.","zh":"他们暂时搬走了；在这段时间里，他们的房子正在翻新。"}]}],"synonyms":["meanwhile","in the meantime","during this time","for now"],"phonetic":"/ˈmiːn.taɪm/","extraExplanation":["“meantime”更常见于固定搭配“in the meantime”。你输入的“meantimes”通常表示口语/写作中强调“期间”的复数形式，但在现代英语里不如“meantime / meanwhile”常用。","“mean”在这里不是“意思是”，而是“中间的（middle）”这一层含义，整体就是“中间这段时间”。"]}
{"word":"meantone","summary":{"en":"Meantone refers to a historical tuning system (meantone temperament) that favors purer major thirds, commonly used in Renaissance/Baroque keyboard music.","zh":"Meantone 指一种历史性的调律体系（中全音律），通过调整五度来让大三度更纯，常见于文艺复兴/巴洛克键盘音乐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a system of musical tuning (temperament) that makes major thirds sound purer by slightly adjusting the sizes of fifths; often used for keyboard instruments in the Renaissance and Baroque periods","zh":"一种音乐调律（平均律/律制的一种）方法：通过把纯五度稍微调窄来换取更“纯”的大三度；常用于文艺复兴与巴洛克时期的键盘乐器调律"},"examples":[{"en":"The harpsichord was tuned in meantone temperament for the early music concert.","zh":"为了这场早期音乐音乐会，这台大键琴采用了中全音律（meantone temperament）调律。"},{"en":"In meantone, common keys can sound warm and sweet, but distant keys may sound harsh.","zh":"在中全音律里，常用调会显得温暖甜美，但较远的调可能会听起来刺耳。"}]},{"partOfSpeech":"n.","definition":{"en":"the meantone temperament itself (as a concept or tuning choice)","zh":"中全音律本身（作为一种调律概念或选择）"},"examples":[{"en":"Some organ builders still prefer meantone for Renaissance repertoire.","zh":"一些管风琴制作师在演奏文艺复兴曲目时仍偏好中全音律。"}]}],"synonyms":["meantone temperament","temperament"],"phonetic":"/ˈminˌtoʊn/","extraExplanation":["“Meantone”常见于术语“meantone temperament（中全音律）”。它的核心想法是：为了让大三度更接近“纯律”的和谐音程，会把若干个五度稍微调窄（不同版本的中全音律调窄程度不同，例如四分之一逗号中全音律）。","在这种调律下，常见调（如C、F、G等）和弦会非常悦耳，但某些远关系调会出现所谓的“狼五度/狼音程”（听起来特别不协和），所以作曲与转调范围会受到一定限制。","历史上，中全音律在16—17世纪很常见；后来为了能在更多调上自由转调，才逐渐发展并流行起各种“良好律”与现代“十二平均律”。"]}
{"word":"meanwhile","summary":{"en":"“Meanwhile” means “at the same time” or “during that period,” often used to shift attention to another action happening concurrently.","zh":"“Meanwhile”表示“与此同时”或“在此期间”，常用来把叙述转到另一件同时发生的事情上。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"at the same time; during the time something else is happening","zh":"与此同时；在另一件事发生的期间"},"examples":[{"en":"I’ll cook dinner; meanwhile, you can set the table.","zh":"我来做晚饭；与此同时，你可以摆桌子。"},{"en":"The doctors worked to save him. Meanwhile, his family waited outside.","zh":"医生们努力抢救他。与此同时，他的家人在外面等待。"}]},{"partOfSpeech":"n.","definition":{"en":"the time in between events; the intervening period","zh":"期间；其间；两件事之间的时间"},"examples":[{"en":"The repairs will take a week; in the meanwhile, we’ll stay with friends.","zh":"维修要花一周；在这期间，我们会住在朋友家。"}]}],"synonyms":["meantime","at the same time","in the meantime","during that time"],"phonetic":"/ˈmiːn.waɪl/","extraExplanation":["写作中常用“Meanwhile,”放在句首当作转场词，表示镜头切换到另一边正在发生的事（类似中文的“与此同时/另一边”），让叙事更流畅。","常见搭配：in the meanwhile / in the meantime（两者意思很接近，都表示“在此期间”。“meantime”更口语、更常见一些）。"]}
{"word":"meanwhiles","summary":{"en":"“Meanwhile” means “at the same time” (adverb) or “the time in between” (noun). “Meanwhiles” is uncommon; usually use “meanwhile.”","zh":"“meanwhile”表示“与此同时”（副词）或“间隙时间/期间”（名词）。“meanwhiles”很少用；通常写“meanwhile”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"during the same time; while something else is happening","zh":"与此同时；在此期间（当另一件事正在发生时）"},"examples":[{"en":"I’ll start cooking; meanwhile, you can set the table.","zh":"我来开始做饭；与此同时，你可以摆桌子。"},{"en":"The team worked on the design. Meanwhile, the engineers tested the materials.","zh":"团队在做设计。与此同时，工程师在测试材料。"}]},{"partOfSpeech":"n.","definition":{"en":"the time between now and a future event; the intervening period","zh":"（从现在到某个事件发生的）间隙时间；期间"},"examples":[{"en":"The new system will launch next month. In the meanwhile, we’ll use the old one.","zh":"新系统下个月上线。在此期间，我们先用旧系统。"},{"en":"The doctor will see you soon. Please wait in the meanwhile.","zh":"医生很快会见你。请先在这期间等一下。"}]}],"synonyms":["at the same time","in the meantime","during that time","while"],"phonetic":"/ˈmiːnwaɪl/","extraExplanation":["“meanwhiles”不是常见标准用法。大多数情况下你想写的是“meanwhile”。偶尔在非常旧的文学或风格化写法里会看到复数“meanwhiles”，表示“多次/多段期间”，但日常英语里几乎不用。","标点小提示：放在句首或句中作连接副词时，常用逗号隔开：“Meanwhile, …” 或 “…; meanwhile, …”。","固定搭配里常见“in the meantime / in the meanwhile”（意思相近，“meantime”更常见）。"]}
{"word":"meany","summary":{"en":"“Meany” is an informal word for a mean/unkind person, sometimes also used as an adjective meaning unkind.","zh":"“meany”是非正式说法，指“刻薄的人/坏家伙”，有时也可作形容词表示“刻薄的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an unkind or cruel person (informal, often used by children).","zh":"刻薄的人；坏家伙（非正式用法，常见于儿童口语）。"},"examples":[{"en":"Don’t be a meany—share your toys.","zh":"别当坏家伙——把玩具分享一下。"},{"en":"He called his sister a meany because she wouldn’t let him play.","zh":"他骂姐姐是坏家伙，因为姐姐不让他玩。"}]},{"partOfSpeech":"adj.","definition":{"en":"unkind; mean (informal).","zh":"刻薄的；不友善的（非正式）。"},"examples":[{"en":"That was a meany thing to say.","zh":"那句话说得太刻薄了。"}]}],"synonyms":["meanie","bully","jerk","mean person","unkind person"],"phonetic":"/ˈmiːni/","extraExplanation":["“meany”是从形容词“mean（刻薄的）”演变来的口语词，带有幼稚、撒娇或抱怨的语气，常用于家庭或儿童之间。正式写作里更常用“mean person / bully / unkind”。","注意拼写：常见的是“meanie”（更常见拼法），意思与“meany”几乎一样。"]}
{"word":"mear","summary":{"en":"Mear is an old or dialect word meaning a boundary or boundary marker.","zh":"mear 是古语或方言词，指“边界”或“界标”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or dialect) A boundary; a boundary marker or landmark (such as a stone) used to show where land ends.","zh":"（古语/方言）边界；界标（如界石），用来标示土地的分界线。"},"examples":[{"en":"The old map shows a mear between the two villages.","zh":"那张旧地图标出了两个村庄之间的一条界线（mear）。"},{"en":"They set a stone as a mear to mark the edge of the field.","zh":"他们立了一块石头作界标（mear），标出田地的边缘。"}]}],"synonyms":["boundary","border","marker","landmark","limit"],"phonetic":"/mɪr/","extraExplanation":["“mear”在现代英语中很少见，多出现在苏格兰英语或古英语/中古英语风格的文本里，意思接近“boundary（边界）”“landmark（界标）”。","不要与更常见的“mere”（仅仅的；湖泊/边界）或“mare”（母马；梦魇）混淆；这三个词拼写相近但含义不同。"]}
{"word":"mearc","summary":{"en":"“mearc” is an archaic Old English word meaning “boundary/landmark; mark,” and sometimes “border region.”","zh":"“mearc”是古英语的古义词，主要指“边界/界标；标记”，有时也指“边境地区”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/Old English) a boundary line or landmark; a mark that shows where something ends.","zh":"（古英语/古义）边界线；界标；表示某物终点的标记。"},"examples":[{"en":"In Old English texts, “mearc” often meant a boundary between lands.","zh":"在一些古英语文本里，“mearc”常指土地之间的边界。"},{"en":"They placed stones as a mear c to show where the field ended.","zh":"他们放置石头作界标，表示田地到哪里为止。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) a border region or territory around a boundary; a march.","zh":"（少见，历史用法）边境地区；边区（类似“march/边疆”）。"},"examples":[{"en":"The kingdom guarded its mear c against raiders.","zh":"王国守卫其边境地区以防袭击者。"},{"en":"A fortress stood on the mear c to protect trade routes.","zh":"一座堡垒建在边区，用来保护商路。"}]}],"synonyms":["mark","boundary","border","landmark","march (border region)"],"phonetic":"/mɑrk/","extraExplanation":["“mearc”是古英语词（现代英语里几乎不用），与现代英语的 mark（标记）同源；含义从“界标/边界”延伸到“边境地区”。如果你原本想查的是 march（行进；三月）或 mark（标记），告诉我我可以为你对比讲解。"]}
{"word":"meare","summary":{"en":"“Meare” is an archaic word meaning “boundary,” and it can also be a place name or surname.","zh":"“meare”主要是古语，意思是“边界/界限”，也可作地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a boundary or limit; a border marker (same idea as “mere” in old English).","zh":"（古语）边界；界限；边界标记（含义类似古英语里的 mere）"},"examples":[{"en":"In old records, a “meare” marked the edge of a village’s land.","zh":"在古老的记录里，“meare”用来标示村庄土地的边界。"},{"en":"They walked along the meare between the two fields.","zh":"他们沿着两块田地之间的边界走。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or place name (e.g., Meare, a village in Somerset, England).","zh":"人名/地名（如英国萨默塞特郡的 Meare 村）"},"examples":[{"en":"She grew up near Meare in Somerset.","zh":"她在萨默塞特郡的 Meare 附近长大。"}]}],"synonyms":["boundary","border","limit","frontier","edge"],"phonetic":"/mɪr/","extraExplanation":["“meare”是非常少见的拼写，多见于中世纪或早期英语文献。现代英语里更常见的是“mere”（古义：边界）或直接用“boundary / border”。","注意不要和常用词“mere”（仅仅的）或“mare”（母马）混淆：它们拼写接近，但意思不同。"]}
{"word":"mearstone","summary":{"en":"A mearstone is an old term for a stone that marks a land boundary.","zh":"mearstone 是较古旧的词，指用来标示土地边界的界石/界碑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a boundary stone used to mark the edge of a piece of land or an estate; a marker for property limits","zh":"界石；界碑（用来标示土地或地产边界的石头）"},"examples":[{"en":"The old mearstone still marks the boundary between the two farms.","zh":"那块旧界石仍然标示着两座农场之间的边界。"},{"en":"They found a mearstone mentioned in a 17th-century land record.","zh":"他们在一份17世纪的土地记录里找到了提到的界石。"}]}],"synonyms":["boundary stone","marker stone","property marker","boundary marker"],"phonetic":"/ˈmɪrˌstoʊn/","extraExplanation":["“mearstone”较为古旧（常见于英式历史文献与地契）。其中“mear”来自古英语/苏格兰英语，意思是“边界、界线”。现代更常用的说法有“boundary stone”“marker stone”或“property marker”。"]}
{"word":"meas","summary":{"en":"“meas” is usually an abbreviation for “measure/measurement(s)” (and less commonly “measles” in medical notes).","zh":"“meas”通常是“measure/measurement(s)”的缩写（在医学记录中较少见时也可指“measles/麻疹”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Short for “measure” or “measurement(s),” used in notes, lab reports, recipes, and technical writing.","zh":"（缩写）“measure/measurement(s)”的缩写，常见于笔记、实验报告、食谱和技术文件中，表示“测量/测量值/尺寸/用量”。"},"examples":[{"en":"Record all meas. in millimeters.","zh":"把所有测量值（meas.）都用毫米记录。"},{"en":"Add water according to the meas. on the cup.","zh":"按杯子上的刻度（meas.）加水。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) Short for “measles” in medical contexts.","zh":"（缩写，较少见）在医学语境中可作“measles（麻疹）”的缩写。"},"examples":[{"en":"Immunity checked: meas. IgG positive.","zh":"免疫检查：麻疹（meas.）IgG 阳性。"}]}],"synonyms":["measurement","measure","abbr."],"phonetic":"ˈmɛʒɚ","extraExplanation":["“meas.”这种缩写更常见于表格、清单、技术说明和手写笔记中；正式写作里通常直接写全“measure/measurement(s)”。","在医疗记录中，缩写因机构不同可能不一致；遇到“meas.”最好结合上下文（是否在谈尺寸/用量，还是在谈疾病或检验项目）来判断。"]}
{"word":"mease","summary":{"en":"“Mease” is a rare dialect word meaning “to soothe/appease,” and sometimes “a measure/amount.” In modern English it’s often a misspelling of “measure” or “measles.”","zh":"“mease”是罕见的方言词，可指“安抚/使平静”，有时也指“量/数量”。现代英语中它常是“measure”或“measles”的误拼。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(dialect, rare) To calm down; to soothe or appease someone.","zh":"（方言，罕见）使平静；安抚；缓和（某人的情绪）。"},"examples":[{"en":"She tried to mease the crying child with a gentle song.","zh":"她用轻柔的歌声安抚哭泣的孩子。"},{"en":"A few kind words can mease anger before it grows.","zh":"几句善意的话可以在怒气变大之前把它缓和下来。"}]},{"partOfSpeech":"n.","definition":{"en":"(dialect, rare) A measure; an amount (similar to “measure”).","zh":"（方言，罕见）量；数量（近似于 measure）。"},"examples":[{"en":"Add a mease of salt, then taste the soup.","zh":"加一点盐，然后尝尝汤的味道。"},{"en":"He took a small mease of flour from the bag.","zh":"他从袋子里取了一小份面粉。"}]}],"synonyms":["soothe","calm","appease","pacify","measure","amount"],"phonetic":"/miz/","extraExplanation":["“mease”在现代标准英语里非常少见，多见于方言或旧文本里；日常写作/考试中通常不用。","如果你是想拼“measure”（测量；措施）或“measles”（麻疹），那“mease”很可能是拼写错误：measure /ˈmɛʒɚ/，measles /ˈmiːzəlz/。","发音这里给的是较常见的读法，接近“meeze”。不同地区或文本可能会有不同拼读。"]}
{"word":"measle","summary":{"en":"“Measle” is usually a misspelling of “measles,” a contagious viral disease with fever and a red rash.","zh":"“measle”通常是“measles（麻疹）”的误拼，指一种会发烧并出现红色皮疹的传染性病毒病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in plural: measles) a contagious viral illness that causes fever and a red rash, common in children but preventable by vaccination.","zh":"（通常用复数：measles）麻疹：一种具有传染性的病毒性疾病，会引起发烧和红色皮疹，多见于儿童，可通过疫苗预防。"},"examples":[{"en":"The child stayed home because she had measles.","zh":"那个孩子因为得了麻疹而待在家里。"},{"en":"Measles can spread quickly in a classroom if people are not vaccinated.","zh":"如果没有接种疫苗，麻疹在教室里可能会迅速传播。"},{"en":"The doctor confirmed it was measles after seeing the rash and fever.","zh":"医生看到皮疹和发烧后确认是麻疹。"}]},{"partOfSpeech":"n.","definition":{"en":"A single spot or small mark (an older, uncommon meaning).","zh":"（较旧、少见）一个小斑点；小痕迹。"},"examples":[{"en":"The old text described a “measle” on the skin.","zh":"那本旧书描述皮肤上有一个“小斑点”。"}]}],"synonyms":["measles","rubeola (medical)"],"phonetic":"/ˈmiːzəl/","extraExplanation":["“measle”更常见是“measles（麻疹）”的误拼。现代英语里几乎总用复数形式“measles”来指这种疾病，尽管它表示一种病，语法上通常当作单数来用（例如：Measles is highly contagious）。","与麻疹相关的常见搭配：measles vaccine（麻疹疫苗）、a measles outbreak（麻疹暴发）、measles rash（麻疹皮疹）。"]}
{"word":"measled","summary":{"en":"Measled means speckled or covered with spots, like a measles rash (often figurative).","zh":"measled 指“布满斑点的、像麻疹疹子一样的”，也常用来比喻“充斥着小瑕疵/小问题”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with spots like a measles rash; speckled or blotched (often used figuratively).","zh":"像麻疹疹子一样布满斑点的；有斑驳点点的（常用于比喻）。"},"examples":[{"en":"The old paper was measled with brown stains from age.","zh":"那张旧纸因年代久远而布满褐色斑点。"},{"en":"Her face looked measled with freckles after a day in the sun.","zh":"晒了一天太阳后，她的脸看起来雀斑点点。"},{"en":"The report was measled with small errors.","zh":"这份报告里零星小错误到处都是。"}]}],"synonyms":["speckled","spotted","freckled","blotched"],"phonetic":"/ˈmiːzəld/","extraExplanation":["“measled”源自“measles（麻疹）”，最初指“像麻疹一样起疹/起斑点”。在现代英语里更常见的是比喻用法：形容表面或内容“布满小点、小瑕疵”。","注意：这是较少见、略带文学/描述性风格的词；日常更常用 speckled（有斑点的）、spotted（有点的）、blotched（有大块斑驳的）。"]}
{"word":"measledness","summary":{"en":"Measledness is a rare noun meaning stingy or paltry behavior, and sometimes a measles-like spotted appearance.","zh":"measledness 是个罕见名词，可指小气/寒酸的作风，也可指类似麻疹的斑点状外观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being very small, stingy, or inadequate; meanness or paltriness","zh":"吝啬、小气或不足的特质；寒酸、微不足道"},"examples":[{"en":"People criticized the company’s measledness in refusing to raise wages by even one dollar.","zh":"人们批评这家公司小气得连一美元的加薪都不肯给。"},{"en":"Her measledness with compliments made the team feel unappreciated.","zh":"她对赞美十分吝啬，让团队觉得不被重视。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a spotted or blotchy condition, as if marked by measles","zh":"（罕见）像麻疹一样的斑点/红疹状态；带斑驳的外观"},"examples":[{"en":"The old manuscript’s pages had a kind of measledness from age and moisture.","zh":"这份旧手稿的纸页因年代与潮气出现了类似“麻疹斑”的斑驳。"},{"en":"In the cold, his skin took on a temporary measledness.","zh":"在寒冷中，他的皮肤暂时出现了斑驳的红点。"}]}],"synonyms":["stinginess","meanness","paltriness","pettiness","shabbiness"],"phonetic":"/ˈmiːzəldnəs/","extraExplanation":["“measledness”由形容词“measled”（像麻疹一样起斑点的）加后缀“-ness”构成。现代英语里它非常少见，更常用的是“meanness / stinginess / paltriness”（小气、寒酸）来表达第一义。","“measled”最早与“麻疹造成的斑点”有关，后来也可引申为“带斑点、斑驳”的意思；再进一步，口语/修辞中可能借“看起来寒酸、可怜”来表达“微不足道”。"]}
{"word":"measles","summary":{"en":"Measles is a highly contagious viral illness that causes fever and a red rash.","zh":"Measles（麻疹）是一种传染性很强的病毒性疾病，常见症状为发烧和红色皮疹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a contagious viral disease that usually causes fever and a red rash; it mainly affects children but can affect anyone who is not vaccinated","zh":"一种传染性很强的病毒性疾病，常见症状包括发烧和红色皮疹；多见于儿童，但未接种疫苗的人也可能感染"},"examples":[{"en":"The child stayed home from school because he had measles.","zh":"那个孩子因为得了麻疹而待在家里不去上学。"},{"en":"Measles can spread quickly in places where many people gather.","zh":"麻疹在人员密集的地方可能会很快传播。"},{"en":"Vaccination is the best way to prevent measles.","zh":"接种疫苗是预防麻疹的最佳方式。"}]}],"synonyms":["rubeola"],"phonetic":"/ˈmiːzəlz/","extraExplanation":["在英语里，measles 通常当作名词使用，形式上看起来像复数（以 -s 结尾），但意义上多按“单数疾病”来理解：常说 “Measles is highly contagious.”（麻疹具有高度传染性）。","常见搭配：catch/get measles（得麻疹），have measles（患麻疹），measles outbreak（麻疹暴发/疫情），measles vaccine/MMR vaccine（麻疹疫苗/麻腮风三联疫苗）。","文化与公共卫生语境中，measles 常被用来讨论群体免疫（herd immunity）与疫苗接种率；在新闻报道里经常与“outbreak（暴发）”一起出现。"]}
{"word":"measlesproof","summary":{"en":"Measlesproof means protected against measles (immune/resistant), often in informal speech.","zh":"measlesproof 指“防麻疹的／对麻疹免疫的”，多用于非正式表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Protected against measles; immune or effectively resistant to measles (often used humorously or informally).","zh":"防麻疹的；对麻疹免疫的／有有效抵抗力的（常见于非正式或带幽默语气的用法）。"},"examples":[{"en":"After getting vaccinated, he joked that he was “measlesproof.”","zh":"打完疫苗后，他开玩笑说自己“防麻疹了”。"},{"en":"Hospitals aim to keep staff measlesproof to prevent outbreaks.","zh":"医院希望员工都能“防麻疹”，以预防暴发。"}]}],"synonyms":["immune to measles","protected against measles","resistant to measles"],"phonetic":"/ˈmiːzəlzˌpruːf/","extraExplanation":["“measlesproof”不是非常常见的标准词，更像是由“measles（麻疹）+ -proof（防……的）”临时组合出来的形容词。英语里类似结构很常见，例如：waterproof（防水的）、bulletproof（防弹的）。在严肃医学语境中，更常用“immune to measles（对麻疹免疫）”或“protected against measles（受麻疹保护）”。"]}
{"word":"measlier","summary":{"en":"“Measlier” means “more measly”: even smaller or more inadequate (often with a complaining tone).","zh":"“measlier”表示“更少、更寒酸、更不够用”，常带抱怨语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “measly”: smaller in amount, value, or importance; more stingy or inadequate.","zh":"“measly”的比较级：更少、更不值一提；更吝啬或更不够用。"},"examples":[{"en":"They offered a measlier discount than last year.","zh":"他们给的折扣比去年更少、更寒酸。"},{"en":"After working all day, he got an even measlier paycheck.","zh":"辛苦工作了一整天，他拿到的工资却更少、更不划算。"},{"en":"The portions looked measlier than the pictures online.","zh":"分量看起来比网上的图片更少、更寒碜。"}]}],"synonyms":["smaller","tinier","paltrier","skimpier","stingier","more inadequate"],"phonetic":"/ˈmizliər/","extraExplanation":["“measly”原本与“measles（麻疹）”有关，早期含义有“长麻疹般斑点的、病恹恹的”。后来引申为“可怜的、少得可笑的”，常带有抱怨或轻蔑的语气。","“measlier”在日常口语里不算特别常见，人们更常说“even more measly / even smaller / even worse”。"]}
{"word":"measliest","summary":{"en":"“Measliest” means “the most measly”: extremely small, paltry, or disappointing in amount or quality.","zh":"“measliest”意为“最寒酸/最少/最微不足道的”：在数量或质量上非常少、很差，常带抱怨或轻蔑语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of measly: the smallest, poorest, or most inadequate in amount, quality, or value.","zh":"measly 的最高级：数量最少、质量最差或价值最低的；最寒酸/最微不足道的。"},"examples":[{"en":"It was the measliest paycheck I’ve ever received.","zh":"那是我拿过最少的一次工资。"},{"en":"They offered the measliest excuse for being late.","zh":"他们为迟到找了个最站不住脚的借口。"},{"en":"He spent the measliest amount on the gift and still expected praise.","zh":"他在礼物上花了少得可怜的钱，却还想被夸。"}]}],"synonyms":["paltriest","stingiest","scantiest","skimpiest","miserablest"],"phonetic":"/ˈmiːzliɪst/","extraExplanation":["“Measly”最早与“measles（麻疹）”有关，原意是“长麻疹的、病恹恹的”，后来引申为“可怜的、寒酸的、少得不值一提的”。因此它常带有轻蔑或抱怨的语气。"]}
{"word":"measly","summary":{"en":"Measly means ‘disappointingly small’ (often with contempt), and less commonly ‘weak or sickly.’","zh":"Measly 表示“少得可怜、令人失望（常带轻蔑）”，较少见也可表示“虚弱、病恹恹的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very small in amount or value; not enough, and often disappointing or contemptible.","zh":"（数量或价值）少得可怜的；不足的；常带有令人失望或轻蔑的语气。"},"examples":[{"en":"They offered me a measly $10 for a whole day’s work.","zh":"他们让我干了一整天的活，却只给了我区区10美元。"},{"en":"He ate a measly sandwich and still felt hungry.","zh":"他只吃了一个少得可怜的三明治，还是觉得饿。"},{"en":"We got a measly two days off after the project ended.","zh":"项目结束后我们只休了可怜的两天假。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person) weak, sickly, or lacking strength; feeble.","zh":"（人）虚弱的；病恹恹的；无力的。"},"examples":[{"en":"After the flu, she felt measly and tired for a week.","zh":"得了流感后，她虚弱疲惫了一周。"},{"en":"The stray dog looked measly and underfed.","zh":"那只流浪狗看起来很虚弱，而且吃不饱。"}]}],"synonyms":["paltry","pitiful","tiny","scant","miserable"],"phonetic":"/ˈmiːzli/","extraExplanation":["“measly”常用来表达强烈的不满或轻蔑，尤其搭配金钱、数量或福利：a measly amount / a measly raise（少得可怜的加薪）。","词源上与“measles（麻疹）”有关，早期可指“像得了麻疹一样虚弱”，后来更常用来形容“少得让人不爽”的数量。","语气提示：在正式场合说某个报价或待遇是“measly”会显得很尖刻；想更中性可用“small”或“modest”。"]}
{"word":"measondue","summary":{"en":"“measondue” is not a recognized English word; it likely needs correction or context.","zh":"“measondue”不是可识别的英文词；需要更正拼写或提供上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a concatenation (two words typed together).","zh":"这不是一个标准的英文单词；可能是拼写错误，或把两个词连在一起输入了。"},"examples":[{"en":"I can’t find “measondue” in an English dictionary—did you mean a different word or phrase?","zh":"我在英语词典里找不到“measondue”；你是不是想写另一个单词或短语？"}]}],"extraExplanation":["“measondue”看起来像把两个词连在一起（例如“meas on due / mason due”），但在常见英语里都不成立。","你可能想写的是法语短语 **raison d’être**（英语里也常借用，意思是“存在的理由/根本目的”），或是 **Maison du ...**（法语“……之屋/……馆”，常见于店名、机构名）。","请你提供：①你看到它的完整句子/上下文；②是否是人名、店名或品牌名；③你想表达的中文意思。我就能给出准确释义与例句。"]}
{"word":"measur","summary":{"en":"Measure means to find the size/amount of something, or to judge something carefully; as a noun, it can mean a unit/standard or an action taken to improve a situation.","zh":"measure 可表示“测量”“衡量/评估”；作名词时可表示“度量标准/单位”或“措施/办法”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to find the size, amount, or degree of something (using a tool or a standard)","zh":"测量；量出（大小、数量或程度）（用工具或标准）"},"examples":[{"en":"Can you measure the table so we know what size tablecloth to buy?","zh":"你能量一下桌子的尺寸吗？这样我们就知道要买多大的桌布。"},{"en":"The nurse measured his temperature.","zh":"护士测了他的体温。"}]},{"partOfSpeech":"vt.","definition":{"en":"to judge or compare something carefully; to consider it in a sensible way","zh":"评估；衡量；慎重考虑"},"examples":[{"en":"It's important to measure the risks before you invest money.","zh":"投资前衡量风险很重要。"},{"en":"We should measure our words when speaking in public.","zh":"在公共场合讲话要斟酌措辞。"}]},{"partOfSpeech":"n.","definition":{"en":"a way of measuring; a unit or standard used for measurement","zh":"计量方式；度量单位；标准"},"examples":[{"en":"The metric system is a common measure used around the world.","zh":"公制是世界上常用的一种度量体系。"},{"en":"As a measure of progress, we track how many lessons you finish each week.","zh":"作为进步的衡量指标，我们会记录你每周完成多少课。"}]},{"partOfSpeech":"n.","definition":{"en":"an action taken to solve a problem or improve a situation","zh":"措施；办法（为解决问题或改善情况而采取的行动）"},"examples":[{"en":"The school introduced new safety measures.","zh":"学校推出了新的安全措施。"},{"en":"We need strong measures to reduce air pollution.","zh":"我们需要有力措施来减少空气污染。"}]}],"synonyms":["calculate","gauge","assess","estimate","evaluate","action","step"],"phonetic":"/ˈmɛʒɚ/","extraExplanation":["你输入的“measur”通常是拼写少了一个 e，正确拼写是 measure。","measure 同时可指“测量”和“措施”。学习时可用搭配来区分：measure the length/temperature（测量……）；take measures（采取措施）；safety measures（安全措施）。"]}
{"word":"measurability","summary":{"en":"Measurability means how easily and reliably something can be measured.","zh":"Measurability 指“可测量性”，即某事物能否被容易且可靠地衡量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being measurable; the degree to which something can be measured clearly and reliably","zh":"可测量性；（某事物）能够被清楚、可靠地测量的程度"},"examples":[{"en":"The measurability of customer satisfaction is tricky because feelings are hard to quantify.","zh":"顾客满意度的可测量性很棘手，因为感受很难量化。"},{"en":"We improved the measurability of the project by setting clear goals and deadlines.","zh":"我们通过设定清晰的目标和截止日期，提高了这个项目的可测量性。"}]}],"synonyms":["quantifiability","measurable quality","verifiability"],"phonetic":"/ˌmɛʒɚəˈbɪləti/","extraExplanation":["“measurability”常用于商业、科研、数据分析与管理语境，强调一个指标/目标是否“能用数据说清楚”。常见搭配：improve measurability（提高可测量性）、ensure measurability（确保可测量性）、measurability of results/impact（结果/影响的可测量性）。","词形来源：measure（测量）+ -able（可……的）→ measurable（可测量的）+ -ity（名词后缀，表示性质）→ measurability（……的性质）。","在写作里常与“可量化/可验证”一起出现：measurability ≈ quantifiability（可量化性）、verifiability（可验证性）。"]}
{"word":"measurable","summary":{"en":"Measurable means something can be measured or clearly shown with evidence (often numbers).","zh":"Measurable 指“可测量/可量化”，也常引申为“明显且有证据可证明（常用数据）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be measured or quantified (in size, amount, degree, time, etc.).","zh":"可测量的；可量化的（尺寸、数量、程度、时间等可用数据表示）。"},"examples":[{"en":"The new policy led to a measurable drop in traffic accidents.","zh":"新政策使交通事故数量出现了可衡量的下降。"},{"en":"We need measurable goals, like ‘reduce costs by 10% in six months.’","zh":"我们需要可衡量的目标，比如“六个月内成本降低10%”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Large enough to be clearly noticed; significant (often used with changes or effects).","zh":"明显的；显著的（常形容变化或影响大到能被清楚察觉）。"},"examples":[{"en":"There was a measurable improvement in her confidence after the course.","zh":"上完课程后，她的自信心有了明显的提升。"}]}],"synonyms":["quantifiable","measurable (in the sense of noticeable)","significant","detectable","verifiable"],"phonetic":"/ˈmɛʒərəbəl/","extraExplanation":["“measurable”常出现在商业与科研语境（例如 measurable results / measurable impact），强调“有数据支撑、可验证”。在写作中它往往暗示：不仅“感觉变好/变差”，而是“能用指标或证据证明”。"]}
{"word":"measurableness","summary":{"en":"Measurableness means the quality of being measurable or able to be quantified.","zh":"Measurableness 指“可测量性”，即某事物能够被测量或量化的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being measurable; the ability to be measured or quantified","zh":"可测量性；可量化的性质"},"examples":[{"en":"The measurableness of the results depends on using the same method each time.","zh":"结果是否具有可测量性，取决于每次都使用同一种方法。"},{"en":"In science, we prefer variables with clear measurableness so different researchers can compare data.","zh":"在科学研究中，我们偏好具有明确可测量性的变量，这样不同研究者才能比较数据。"}]}],"synonyms":["measurability","quantifiability"],"phonetic":"/ˈmɛʒərəbəlnəs/","extraExplanation":["“measurableness”在现代英语中非常少见、偏书面或较旧式；更常用的对应词是“measurability”（可测量性）。在学术写作中通常建议用“measurability”，在一般写作中也可用“how measurable something is”（有多可测量）。","构词：measure（测量）+ -able（可……的）+ -ness（……的性质）。因此它强调“具有可被测量的性质”。"]}
{"word":"measurably","summary":{"en":"“Measurably” means “to a degree that can be measured or clearly noticed,” often implying evidence or data.","zh":"“measurably”表示“达到可衡量或明显可察觉的程度”，常暗示有数据或证据支持。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be measured or noticed clearly; to a noticeable degree.","zh":"以可衡量、可明显察觉的方式；到显著的程度。"},"examples":[{"en":"The new policy measurably reduced waiting times.","zh":"新政策显著缩短了等待时间。"},{"en":"Her English has improved measurably since last semester.","zh":"从上学期以来，她的英语有了明显进步。"},{"en":"The air quality is measurably better after the rain.","zh":"下雨后空气质量明显变好了。"}]}],"synonyms":["noticeably","significantly","appreciably","observably"],"phonetic":"/ˈmɛʒɚəbli/","extraExplanation":["“measurably”常见于新闻、学术与商务写作，强调变化“有数据或证据支撑”，比“noticeably（明显地）”更偏向“可量化”。","常见搭配：measurably better/worse（明显更好/更差），measurably increase/decrease（显著增加/减少），measurably different（有明显差异）。"]}
{"word":"measurage","summary":{"en":"Measurage means measurement—the act of measuring or, in commerce, the measurement used to calculate charges.","zh":"Measurage 指“测量/量度”，也可指商业或航运中用于计算费用的计量数据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of measuring; measurement","zh":"测量；量度（测量的行为或过程）"},"examples":[{"en":"The measurage of the room showed it was too small for the table.","zh":"对房间的测量显示它太小，放不下那张桌子。"},{"en":"Accurate measurage is important when you buy curtains or carpet.","zh":"买窗帘或地毯时，准确测量很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in shipping/commerce) measurement of goods for calculating size, weight, or freight charges","zh":"（尤指航运/贸易）对货物进行计量，用于计算体积、重量或运费"},"examples":[{"en":"The port required measurage of the cargo before setting the final fee.","zh":"港口在确定最终费用前要求对货物进行计量。"},{"en":"Measurage records were kept for each shipment.","zh":"每批货物都有计量记录。"}]}],"synonyms":["measurement","measuring","gauge","quantification"],"phonetic":"/ˈmɛʒərɪdʒ/","extraExplanation":["“measurage”比较少见，日常英语里更常用“measurement”。在较老的文本或特定行业（如航运、关税、运费计算）中可能会看到。","词形上由“measure（测量）+ -age（表示行为/结果的后缀）”构成，类似的还有“breakage（破损量）”“shrinkage（缩水量/收缩）”。"]}
{"word":"measuration","summary":{"en":"Measuration is a formal word meaning the act of measuring, or (in geometry) calculating length, area, or volume.","zh":"measuration 是较正式的词，表示“测量的过程”，也可指几何中的“度量计算”（长度、面积、体积等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of measuring something (especially length, area, or volume).","zh":"测量；度量（尤指长度、面积或体积的测定过程）。"},"examples":[{"en":"Accurate measuration of the room is important before you buy new furniture.","zh":"在买新家具之前，准确测量房间尺寸很重要。"},{"en":"The survey required careful measuration of land boundaries.","zh":"这次测绘需要对土地边界进行细致的测量。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math, formal) The calculation of lengths, areas, or volumes using geometry.","zh":"（数学/正式）度量学；用几何方法计算长度、面积或体积。"},"examples":[{"en":"In classical geometry, students learn measuration of circles and triangles.","zh":"在古典几何中，学生会学习圆和三角形的度量计算。"},{"en":"The textbook includes a chapter on mensuration (measuration) of solids.","zh":"这本教材有一章讲立体的度量计算（mensuration/measuration）。"}]}],"synonyms":["measurement","measuring","mensuration"],"phonetic":"/ˌmɛʒəˈreɪʃən/","extraExplanation":["“Measuration”较正式、偏书面，在日常英语里更常说“measurement”（测量/测量结果）。在数学语境中，你也会看到“mensuration”，常指几何度量（面积、体积等）的计算。"]}
{"word":"measure","summary":{"en":"Measure can mean to find an amount/size, to evaluate, or (as a noun) a unit/standard, a protective action (measures), or a musical bar.","zh":"measure 可指测量（数量/大小）、衡量评估；作名词可指计量单位/尺度、措施（measures），或音乐中的小节。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To find the size, amount, or degree of something using a standard unit or method.","zh":"用标准单位或方法测量某物的大小、数量或程度。"},"examples":[{"en":"Can you measure the table to see if it will fit in the room?","zh":"你能量一下桌子，看看能不能放进房间吗？"},{"en":"The doctor measured his blood pressure.","zh":"医生测量了他的血压。"}]},{"partOfSpeech":"vt.","definition":{"en":"To judge or evaluate something (often more generally, not only with numbers).","zh":"衡量、评估某事（常指更广义的判断，不一定是数字）。"},"examples":[{"en":"It’s hard to measure success only by money.","zh":"只用金钱来衡量成功很难。"},{"en":"She tried to measure his reaction before speaking.","zh":"她开口前试着观察并判断他的反应。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of measuring; a unit, standard, or method used to compare amounts.","zh":"度量方式；计量单位、标准或方法。"},"examples":[{"en":"The meter is a measure of length.","zh":"米是长度的计量单位。"},{"en":"As a safety measure, please wear a helmet.","zh":"作为安全措施，请戴好头盔。"}]},{"partOfSpeech":"n.","definition":{"en":"An action taken to achieve a result or prevent a problem (often plural: measures).","zh":"（为达到目的或预防问题而采取的）措施（常用复数 measures）。"},"examples":[{"en":"The government introduced new measures to reduce pollution.","zh":"政府推出了新措施来减少污染。"},{"en":"We need stronger measures to protect children online.","zh":"我们需要更有力的措施来保护儿童的网络安全。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a bar: a section of time with a set number of beats.","zh":"（音乐）小节：包含固定拍数的一段节奏。"},"examples":[{"en":"Repeat the first four measures.","zh":"重复前四小节。"}]}],"synonyms":["gauge","calculate","assess","evaluate","meter","quantify"],"phonetic":"/ˈmɛʒɚ/","extraExplanation":["“measure”既可以是动词（测量/衡量），也可以是名词（计量/尺度/措施/音乐小节）。学习时可用搭配来区分：\n- measure + 尺寸/数据：measure the length/weight/temperature\n- measure + 抽象概念：measure success/impact/risk\n- safety/economic/strict measures：表示“措施”\n- in 4/4 time, one measure：表示“音乐小节”"]}
{"word":"measured","summary":{"en":"“Measured” most often means calm and controlled, or carefully determined by measuring; it is also the past form of “measure.”","zh":"“measured”常指“克制、冷静有分寸的”，也可指“量好的、测量得出的”，并且是“measure”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Careful, calm, and controlled; not extreme.","zh":"（言行、语气、反应）克制的；冷静而有分寸的；不过火的。"},"examples":[{"en":"She gave a measured response to the criticism.","zh":"她对批评做出了克制的回应。"},{"en":"He spoke in a measured tone during the meeting.","zh":"他在会议上用沉稳克制的语气说话。"},{"en":"Try to stay measured when you’re under stress.","zh":"压力大时尽量保持冷静克制。"}]},{"partOfSpeech":"adj.","definition":{"en":"Calculated or judged by measurement; having a particular size, amount, or length.","zh":"经过测量的；用测量确定的（尺寸、数量、长度等）。"},"examples":[{"en":"Add a measured amount of water to the flour.","zh":"往面粉里加入量好的水。"},{"en":"The nurse gave him a measured dose of medicine.","zh":"护士给了他一剂量好的药。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “measure” (to find the size/amount of something).","zh":"“measure”的过去式和过去分词（测量；估量）。"},"examples":[{"en":"We measured the room to see if the sofa would fit.","zh":"我们量了房间，看看沙发能不能放下。"},{"en":"The tailor measured my waist and shoulders.","zh":"裁缝量了我的腰围和肩宽。"}]}],"synonyms":["calm","controlled","moderate","restrained","careful","deliberate"],"phonetic":"/ˈmɛʒɚd/","extraExplanation":["“measured”表示“克制的”时，常用于正式或严肃语境，强调情绪与表达被控制在“合适的范围”内（measured response / measured tone）。","发音里常见的 /ʒ/ 音（像“vision”里的 s），是学习者容易读成 /z/ 的地方：measured /ˈmɛʒɚd/。"]}
{"word":"measuredly","summary":{"en":"“Measuredly” means calmly and deliberately, with controlled pace and emotion.","zh":"“Measuredly”指沉着、谨慎、有分寸地（说话或行动），强调节奏与情绪都受控制。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a calm, controlled, and unhurried way; with deliberate pacing (often to show careful thought or self-control).","zh":"以沉着、克制、不慌不忙的方式；有意放慢节奏（常用来表示深思或自控）。"},"examples":[{"en":"She spoke measuredly, choosing each word with care.","zh":"她说话不疾不徐，谨慎地选择每一个词。"},{"en":"He responded measuredly to the criticism instead of getting angry.","zh":"他对批评作出克制的回应，而不是发火。"},{"en":"The judge read the decision measuredly and clearly.","zh":"法官沉稳而清晰地宣读了裁决。"}]}],"synonyms":["calmly","deliberately","restrainedly","composedly","evenly"],"phonetic":"/ˈmɛʒɚdli/","extraExplanation":["“measuredly”来自形容词“measured”（有分寸的、慎重的），强调说话或行动像“量过一样”——节奏与力度都被控制好，因此常带有“冷静、理性、不过激”的语气色彩。","语体上偏正式，常见搭配：speak measuredly（沉稳地说）、respond measuredly（克制地回应）、act measuredly（稳妥行事）。与“slowly”不同，它不只是“慢”，更强调“有节制、有分寸”。"]}
{"word":"measuredness","summary":{"en":"Measuredness means calm, controlled moderation—especially in speech or reactions.","zh":"Measuredness 指（尤其在言语或反应上）冷静克制、适度有分寸的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being calm, controlled, and not extreme in speech, emotion, or behavior; moderation and restraint.","zh":"（言语、情绪或行为的）冷静克制；有分寸；适度"},"examples":[{"en":"Her measuredness in the meeting helped everyone stay focused on solutions.","zh":"她在会议上的冷静克制让大家把注意力集中在解决方案上。"},{"en":"The article’s measuredness made it feel fair, even to readers who disagreed.","zh":"这篇文章的措辞很有分寸，即使不同意的读者也觉得它比较公允。"},{"en":"He answered with measuredness rather than anger.","zh":"他以克制的态度回应，而不是发火。"}]},{"partOfSpeech":"n.","definition":{"en":"A careful, deliberate way of expressing or doing something, often to avoid exaggeration or conflict.","zh":"（表达或做事的）审慎、斟酌后的方式；避免夸张或冲突的语气/做法"},"examples":[{"en":"The CEO spoke with measuredness about the company’s future, avoiding big promises.","zh":"CEO 谈到公司的未来时语气谨慎克制，避免作出夸大的承诺。"},{"en":"Diplomats often use measuredness when responding to criticism.","zh":"外交官在回应批评时常常会保持审慎克制。"}]}],"synonyms":["moderation","restraint","self-control","calmness","prudence","composure"],"phonetic":"/ˈmɛʒɚdnəs/","extraExplanation":["“measuredness”来自形容词“measured”（克制的、慎重的）+ 名词后缀“-ness”（表示“……的特质/状态”）。常用于正式写作或评论中，强调“不过度、很有分寸”的态度。注意它不等于“measurability（可测量性）”，也不直接表示“被测量过”。"]}
{"word":"measureless","summary":{"en":"“Measureless” means without limit or too great to measure, often used in literary descriptions.","zh":"“measureless”指“无边无际、不可估量”，常用于文学性描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"So large, deep, or great that it seems to have no limit; immeasurable (often literary or poetic).","zh":"大得（深得、强得）仿佛没有尽头的；不可估量的（常见于文学或诗歌语境）。"},"examples":[{"en":"She felt a measureless grief after the loss.","zh":"失去之后，她感到难以估量的悲伤。"},{"en":"They stared at the measureless sky above the desert.","zh":"他们凝望着沙漠上方无边无际的天空。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not able to be measured in a clear, exact way.","zh":"无法用明确、精确的方式衡量的。"},"examples":[{"en":"The project’s success depends on measureless factors like trust and morale.","zh":"这个项目的成功取决于信任、士气等难以衡量的因素。"}]}],"synonyms":["immeasurable","boundless","limitless","infinite","incalculable"],"phonetic":"/ˈmɛʒərləs/","extraExplanation":["“measureless”由 measure（衡量）+ -less（没有……的）构成，字面意思是“没有尺度/无法衡量”。","它比常见的“immeasurable”更偏文学色彩，常用来描写情感（grief, joy）、自然景象（sea, sky）或宏大抽象概念（time, distance），营造“无限”“浩瀚”的氛围。","常见搭配：measureless ocean/sea（无垠海洋）、measureless sorrow/grief（无尽悲伤）、measureless time（漫长无尽的时间）。"]}
{"word":"measurelessly","summary":{"en":"Measurelessly means “without limit” or “to an immeasurable degree,” often in literary or formal writing.","zh":"Measurelessly 表示“没有限度、无法衡量地（极其）”，多见于文学或较正式的表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an immeasurable or unlimited way; extremely; without limit.","zh":"以无法衡量或没有限制的方式；极其；无边无际地。"},"examples":[{"en":"She felt measurelessly grateful for their help.","zh":"她对他们的帮助感到无比感激。"},{"en":"The ocean stretched measurelessly to the horizon.","zh":"大海无边无际地延伸到地平线。"}]}],"synonyms":["immeasurably","infinitely","boundlessly","limitlessly","endlessly"],"phonetic":"/ˈmɛʒɚləsli/","extraExplanation":["“measurelessly”较少用于日常口语，更常见于文学或较正式的写作，用来强调“多到无法计量/无穷无尽”的感觉。","词形上由“measure（衡量）+ -less（没有）+ -ly（副词）”构成，意思接近“immeasurably / infinitely”。"]}
{"word":"measurelessness","summary":{"en":"Measurelessness means the state of being without limits or something too vast to measure.","zh":"measurelessness 指“无边无际、不可测量”的状态或特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having no limit, boundary, or measurable amount; boundlessness.","zh":"无边无际；不可测量的状态；没有限制或界限的特质。"},"examples":[{"en":"In the desert at night, the measurelessness of the sky makes you feel small.","zh":"在沙漠的夜晚，天空的无边无际会让你觉得自己很渺小。"},{"en":"She spoke about love’s measurelessness, meaning it can’t be fully counted or contained.","zh":"她谈到爱的不可计量，意思是它无法被完全计算或装进某个范围里。"}]}],"synonyms":["limitlessness","boundlessness","immeasurability","infinitude","vastness"],"phonetic":"/ˈmɛʒɚləsnəs/","extraExplanation":["“measurelessness”比较少见，常见于诗歌、散文或较正式的写作中，用来强调“无尽”“无穷”的感觉，而不是做科学意义上的精确测量。更常见的近义表达有：“limitlessness / boundlessness / immeasurability”。","构词法：measure（测量、尺度）+ -less（没有）+ -ness（名词后缀，表示“……的状态/性质”）。因此字面意思就是“没有尺度可量的状态”。","文学/修辞上它常与自然意象或抽象概念搭配，如“the measurelessness of the sea / time / grief（大海/时间/悲伤的无边无际）”，用来制造宏大、深远或压倒性的氛围。"]}
{"word":"measurely","summary":{"en":"“Measurely” is not standard; it’s likely a misspelling of “measurably” or “measuredly.”","zh":"“measurely”不是规范用法；很可能是“measurably”或“measuredly”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “measurably” (in a measurable way) or “measuredly” (in a calm, controlled way).","zh":"不是标准英语单词。很可能是拼写错误，想写的是“measurably”（以可衡量的方式；显著地）或“measuredly”（冷静克制地；有分寸地）。"},"examples":[{"en":"This word doesn’t usually appear in dictionaries; you probably mean “measurably.”","zh":"这个词通常不见于词典；你可能想写“measurably”。"},{"en":"If you mean “calmly,” “measuredly” is a better choice than “measurely.”","zh":"如果你想表达“冷静地”，用“measuredly”比“measurely”更合适。"}]}],"synonyms":["measurably","measuredly","noticeably","calmly","deliberately"],"phonetic":"/ˈmɛʒɚli/","extraExplanation":["“measurably”常用于学术/数据语境，意思是“可被测量到的程度、明显地”（例如：measurably better）。","“measuredly”更偏文学或正式语体，描述说话/行动“克制、有分寸”，带有情绪控制的感觉（例如：He replied measuredly）。","如果你告诉我你看到“measurely”的句子原文，我可以帮你判断更接近“measurably”还是“measuredly”。"]}
{"word":"measurement","summary":{"en":"Measurement means the process of measuring something or the result (a measured number), often using standard units.","zh":"measurement 指“测量的过程”或“测量得到的数值/结果”，通常使用标准单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of finding the size, amount, or degree of something using a standard unit (like meters, seconds, or dollars).","zh":"用标准单位（如米、秒、美元等）来测定某物的大小、数量或程度的行为或过程。"},"examples":[{"en":"Accurate measurement is important in science experiments.","zh":"在科学实验中，精确的测量很重要。"},{"en":"The tailor took measurements of my waist and shoulders.","zh":"裁缝量了我的腰围和肩宽。"}]},{"partOfSpeech":"n.","definition":{"en":"A number or result that you get from measuring; a reading.","zh":"测量得到的数值或结果；读数。"},"examples":[{"en":"The blood pressure measurement was higher than last time.","zh":"这次的血压测量值比上次高。"},{"en":"We recorded the temperature measurements every hour.","zh":"我们每小时记录一次温度测量数据。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific system or standard used for measuring (often in the phrase “system of measurement”).","zh":"特定的计量体系或标准（常见于短语“system of measurement/计量体系”）。"},"examples":[{"en":"The U.S. mainly uses a different system of measurement from most countries.","zh":"美国主要使用与大多数国家不同的计量体系。"}]}],"synonyms":["measuring","measurement reading","dimension","gauge","quantification"],"phonetic":"/ˈmɛʒərmənt/","extraExplanation":["“measurement”既可以指“测量这个动作/过程”（不可数更常见），也可以指“测量结果/数值”（常可数，如 a measurement, several measurements）。","在服装场景里常用复数“measurements”表示“身体尺寸”，如 take your measurements（量尺寸）。","常见搭配：accurate/precise measurement（精确测量）、measurement error（测量误差）、unit of measurement（计量单位）、take a measurement（进行一次测量）。"]}
{"word":"measurements","summary":{"en":"Measurements are the numbers and units that describe size or amount, or the act of measuring.","zh":"Measurements 指描述大小或数量的“测量数据（数字+单位）”，也可指“测量的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The sizes, amounts, or dimensions of something (such as length, weight, or temperature), usually expressed with numbers and units.","zh":"（某物的）尺寸、数量或维度（如长度、重量、温度等），通常用数字和单位表示。"},"examples":[{"en":"Please write down the measurements of the room: length, width, and height.","zh":"请把房间的测量数据写下来：长、宽和高。"},{"en":"The recipe includes measurements in cups and teaspoons.","zh":"这份食谱包含用“杯”和“茶匙”表示的用量。"},{"en":"Accurate measurements are important in science experiments.","zh":"准确的测量数据对科学实验很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of measuring something.","zh":"测量的行为或过程。"},"examples":[{"en":"The doctor took measurements of his blood pressure.","zh":"医生测量了他的血压。"},{"en":"We need careful measurements before we cut the wood.","zh":"在切割木材之前我们需要仔细测量。"}]}],"synonyms":["dimensions","sizes","figures","readings","metrics","specifications"],"phonetic":"/ˈmɛʒərmənts/","extraExplanation":["“measurements”通常是可数名词复数，强调“多项数据/多种维度”（例如长宽高、胸围腰围臀围等）。如果只说一个概念或单次数据，也常用单数“a measurement”。","在不同语境里单位可能不同：美国日常常见英制（inches, feet, pounds, Fahrenheit），很多国家常见公制（centimeters, meters, kilograms, Celsius）。读写时注意单位换算与缩写（in., ft., lb., °F / cm, m, kg, °C）。"]}
{"word":"measurer","summary":{"en":"Measurer usually means a person who measures; less commonly, it can mean a measuring tool.","zh":"measurer 通常指“测量的人”；较少情况下也可指“测量工具”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to measure things, especially for construction, tailoring, or manufacturing.","zh":"测量员；量尺的人（尤指在建筑、裁缝或制造业中负责测量的人）。"},"examples":[{"en":"The measurer came to our house to measure the windows for new curtains.","zh":"量尺的人来我们家测窗户尺寸，好订做新窗帘。"},{"en":"Before cutting the fabric, the measurer double-checked the client’s measurements.","zh":"裁剪布料前，量尺的人再次核对了顾客的尺寸。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool or device used for measuring something (less common; more often people say “measuring device” or name the tool, like “tape measure”).","zh":"测量工具；测量器（较不常用；更常说“measuring device”，或直接说具体工具名，如“tape measure”卷尺）。"},"examples":[{"en":"In the lab, we used a measurer to check the length of the samples.","zh":"在实验室里，我们用测量器检查样本的长度。"},{"en":"If you don’t have a measurer, a ruler can work for small items.","zh":"如果你没有测量工具，小物件用尺子也可以。"}]}],"synonyms":["surveyor","measuring device","meter","tape measure"],"phonetic":"/ˈmɛʒɚɚ/","extraExplanation":["“measurer”由动词“measure（测量）+ -er（做某事的人/物）”构成，表示“负责测量的人”或“用来测量的东西”。日常英语里更常见的表达是：\n- 人：surveyor（测量员，偏土地/工程）、tailor（裁缝，会给人量尺寸）、meter reader（抄表员）\n- 工具：tape measure（卷尺）、ruler（直尺）、measuring cup/spoon（量杯/量勺）、meter（仪表）"]}
{"word":"measurers","summary":{"en":"Measurers usually means people who measure things; less commonly, it can mean measuring tools.","zh":"measurers通常指“测量的人”；较少情况下也可指“测量工具”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who measure something (such as length, weight, or amount), especially as a job or role.","zh":"测量者；计量人员（指测量长度、重量、数量等的人，常指工作或职责）。"},"examples":[{"en":"The measurers checked the land boundaries before the sale.","zh":"在出售之前，测量人员核对了土地边界。"},{"en":"In the lab, measurers must record results carefully.","zh":"在实验室里，测量者必须仔细记录结果。"}]},{"partOfSpeech":"n.","definition":{"en":"Tools or devices used to measure something (less common).","zh":"测量工具；计量器（较少用，多指用于测量的器具）。"},"examples":[{"en":"The kit includes measurers for flour and sugar.","zh":"这套工具包含用于面粉和糖的量具。"},{"en":"Bring measurers if you want accurate portions.","zh":"如果你想要精确分量，就带上量具。"}]}],"synonyms":["surveyors","gaugers","measuring devices","measuring tools"],"phonetic":"/ˈmɛʒərərz/","extraExplanation":["“measurers”是复数形式；单数是“measurer”。在日常英语里，表示“量具”更常用的是“measuring cups/spoons”或更泛的“measuring devices/tools”。","注意拼写与发音：中间的“s”发/ʒ/音（像“measure”里的音），不是/s/。"]}
{"word":"measures","summary":{"en":"“Measures” most often means actions/steps taken (especially official measures), and it can also mean units/ways of measurement, musical bars, or the verb form “measures” (he/she measures).","zh":"“measures”最常见指“措施”；也可指“度量/测量单位或方法”、音乐“小节”，或作为动词“measure”的第三人称单数（他/她测量、衡量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Actions or steps taken to deal with a problem or achieve a goal (often in official contexts).","zh":"为解决问题或达成目标而采取的措施、办法（常用于正式语境）。"},"examples":[{"en":"The government announced new measures to reduce inflation.","zh":"政府宣布了降低通货膨胀的新措施。"},{"en":"Strict safety measures are required in the lab.","zh":"实验室必须采取严格的安全措施。"}]},{"partOfSpeech":"n.","definition":{"en":"Standard units or ways of measuring size, amount, or degree.","zh":"衡量大小、数量或程度的标准单位或方法；度量。"},"examples":[{"en":"The recipe uses metric measures like grams and liters.","zh":"这份食谱使用克、升等公制度量单位。"},{"en":"We need accurate measures of air quality.","zh":"我们需要对空气质量进行准确测量。"}]},{"partOfSpeech":"n.","definition":{"en":"Bars in music—regular groups of beats in a piece of music.","zh":"（音乐）小节：乐曲中按节拍规律分组的段落。"},"examples":[{"en":"Play the first eight measures again, slower this time.","zh":"把前八小节再弹一遍，这次慢一点。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “measure”: to find the size/amount of something, or to judge it carefully.","zh":"动词 measure 的第三人称单数：测量（尺寸/数量）；衡量、评估。"},"examples":[{"en":"The nurse measures your blood pressure.","zh":"护士会测量你的血压。"},{"en":"He measures his words when speaking in public.","zh":"他在公众场合说话会斟酌用词。"}]}],"synonyms":["actions","steps","precautions","policies","rules","methods"],"phonetic":"/ˈmɛʒɚz/","extraExplanation":["“measures”最常见的意思是“措施”（可数名词）：take measures（采取措施）、safety measures（安全措施）、preventive measures（预防措施）。","作为动词时，“measures”是“measure”的第三人称单数：She measures…（她测量/衡量……）。注意名词复数“measures”和动词“measures”形式一样，要靠上下文判断。","音乐里的“measures”也常叫“bars”（英式/美式都常用），例如：eight bars = eight measures（八小节）。"]}
{"word":"measuring","summary":{"en":"Measuring means the process of finding size/amount, the -ing form of “measure,” or (as an adjective) careful and deliberate.","zh":"Measuring 可指“测量的过程”，也可作 measure 的 -ing 形式；作形容词时表示“慎重、克制、深思熟虑的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of finding the size, amount, or degree of something (using a tool or a standard)","zh":"测量；量度（用工具或标准来确定大小、数量或程度的过程）"},"examples":[{"en":"Accurate measuring is important when you bake bread.","zh":"烤面包时，准确的测量很重要。"},{"en":"The project begins with measuring the room and drawing a simple plan.","zh":"这个项目从测量房间并画一张简单的平面图开始。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “measure”) to find the size, length, amount, or level of something","zh":"（measure 的现在分词）测量；衡量（某物的大小、长度、数量或水平）"},"examples":[{"en":"She is measuring the table to see if it will fit by the window.","zh":"她正在量桌子，看看能不能放在窗边。"},{"en":"We are measuring customer satisfaction through short surveys.","zh":"我们通过简短问卷来衡量客户满意度。"}]},{"partOfSpeech":"adj.","definition":{"en":"careful, controlled, and showing deliberate judgment (often about words, reactions, or behavior)","zh":"慎重的；克制的；深思熟虑的（常指措辞、反应或行为）"},"examples":[{"en":"He gave a measuring reply instead of getting angry.","zh":"他给了一个慎重的回应，而不是发火。"},{"en":"She spoke in a calm, measuring tone.","zh":"她用冷静而克制的语气说话。"}]}],"synonyms":["measurement","measuring process","gauging","checking","careful","deliberate"],"phonetic":"/ˈmɛʒɚɪŋ/","extraExplanation":["“measuring”既可以是动词的 -ing 形式（表示“正在测量”），也可以当名词用（表示“测量这件事/这个过程”）。例如：We are measuring…（动词）；Measuring takes time.（名词）。","形容词用法“a measuring look/tone/reply”较偏书面，强调“审慎、带评估意味的”态度。"]}
{"word":"measuringworm","summary":{"en":"A measuringworm is a caterpillar (inchworm) that moves by arching its body, as if measuring the ground.","zh":"measuringworm 指一种尺蠖（inchworm），拱起身体爬行，像在量距离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small caterpillar that moves by arching its body, as if it is “measuring” the ground; also called an inchworm.","zh":"一种小毛毛虫（尺蠖/尺蠖虫），爬行时会拱起身体像在“量地”，也常叫 inchworm（尺蠖）。"},"examples":[{"en":"A measuringworm inched along the branch, bending and straightening its body.","zh":"一只尺蠖在树枝上慢慢前进，身体一弯一直。"},{"en":"The kids watched a measuringworm and laughed at the way it “measured” each step.","zh":"孩子们看着尺蠖前进的样子，觉得它像在一步步“量距离”，忍不住笑了。"}]}],"synonyms":["inchworm","looper","geometer caterpillar"],"phonetic":"/ˈmɛʒərɪŋˌwɝm/","extraExplanation":["“measuringworm”这个名字来自它的移动方式：身体先拱起再伸直，看起来像在用身体当尺子“测量”距离。英语里更常见的说法是单词 inchworm（字面是“英寸虫”）。在园艺语境中，它们有时会吃叶子，被视为轻度害虫。"]}
{"word":"meat","summary":{"en":"“Meat” most commonly means animal flesh eaten as food; it can also mean the main or most substantial part of an idea or issue.","zh":"“meat”最常指“肉/肉类”，也可比喻指“事情的核心、要点、干货”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The flesh of an animal used as food (often excluding fish in everyday use).","zh":"（通常指哺乳动物或家禽的）肉；肉类（日常用法里常不把鱼算作 meat）。"},"examples":[{"en":"We don’t eat meat, so we ordered vegetable dishes.","zh":"我们不吃肉，所以点了蔬菜菜。"},{"en":"Chicken is a kind of meat.","zh":"鸡肉是一种肉类。"},{"en":"The soup has chunks of meat and potatoes.","zh":"这汤里有肉块和土豆块。"}]},{"partOfSpeech":"n.","definition":{"en":"The main or most important part of something; the substance or core idea.","zh":"（比喻）要点；实质；核心内容。"},"examples":[{"en":"Let’s get to the meat of the problem.","zh":"我们来谈问题的核心吧。"},{"en":"The article has a lot of stories, but not much meat.","zh":"这篇文章故事很多，但干货不多。"}]}],"synonyms":["flesh","protein (food context)","substance (figurative)","core (figurative)"],"phonetic":"/mit/","extraExplanation":["常见搭配：red meat（红肉，如牛羊猪）、white meat（白肉，如鸡火鸡）、processed meat（加工肉，如香肠火腿）、lean meat（瘦肉）。","相关表达：the meat of something 表示“某事的核心/重点”，用于讨论、写作或演讲中。"]}
{"word":"meatal","summary":{"en":"“Meatal” is a medical adjective meaning “related to a body opening or passage (meatus),” such as the ear canal or urethral opening.","zh":"“meatal”是医学形容词，表示“与身体的开口或通道（meatus）有关”，例如外耳道或尿道口。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a meatus (a natural opening or passage in the body, such as the ear canal or the opening of the urethra).","zh":"与“孔道/开口（meatus）”有关的；指身体中的天然开口或通道（如外耳道、尿道口等）。"},"examples":[{"en":"The doctor examined the meatal area to check for irritation.","zh":"医生检查了孔口周围区域，以确认是否有刺激或发炎。"},{"en":"Meatal stenosis can make urination difficult.","zh":"尿道口狭窄可能会使排尿困难。"},{"en":"Ear pain may involve inflammation near the auditory meatal opening.","zh":"耳痛可能与外耳道开口附近的炎症有关。"}]}],"synonyms":["meatus-related","urethral (context-specific)","auditory (context-specific)"],"phonetic":"/ˈmiːtəl/","extraExplanation":["“meatal”是医学/解剖学用语，来自名词“meatus”（孔道、通道的开口）。日常英语里很少用到，通常出现在病历、检查报告或医学科普中。","常见搭配包括：meatal opening（孔口/开口）、urethral meatus（尿道口）、auditory meatus（外耳道/听道）、meatal stenosis（孔口狭窄，常指尿道口狭窄）。"]}
{"word":"meatball","summary":{"en":"A meatball is a small ball of seasoned ground meat used in many dishes; informally, it can also mean a silly/annoying person.","zh":"meatball 指肉丸；在口语里也可指“傻瓜/讨厌的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small ball of ground meat (often mixed with breadcrumbs, egg, and seasonings) cooked and served in dishes such as pasta, soup, or sandwiches.","zh":"肉丸；用绞肉（常加面包屑、鸡蛋和调味料）搅拌成小球后烹制，常配意面、汤或做三明治。"},"examples":[{"en":"We had spaghetti and meatballs for dinner.","zh":"我们晚餐吃了意大利面配肉丸。"},{"en":"Add the meatballs to the soup and simmer for 10 minutes.","zh":"把肉丸放进汤里，小火煮10分钟。"},{"en":"He ordered a meatball sub at the deli.","zh":"他在熟食店点了一份肉丸潜艇三明治。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A foolish or annoying person.","zh":"（非正式）傻瓜；讨厌的人。"},"examples":[{"en":"Don’t be a meatball—read the instructions first.","zh":"别当傻瓜——先把说明书读一遍。"},{"en":"Some guy cut in line like a total meatball.","zh":"有个人插队，简直讨厌透了。"}]}],"synonyms":["(food) meat dumpling","(slang) idiot","jerk"],"phonetic":"/ˈmiːt.bɔːl/","extraExplanation":["“meatball”作俚语时带一点吐槽的语气，多见于美式口语；对不熟的人使用可能显得不礼貌，和朋友开玩笑时更常见。","常见搭配：spaghetti and meatballs（经典美式意大利餐）、meatball sub（肉丸潜艇堡/三明治）、swedish meatballs（瑞典肉丸，常配奶油酱）。"]}
{"word":"meatballs","summary":{"en":"Meatballs are small seasoned balls of ground meat cooked in various ways, often served with sauce.","zh":"Meatballs 指把绞肉调味后做成小球并烹饪的肉丸，常搭配酱汁食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small balls of ground (minced) meat mixed with seasonings (and often breadcrumbs and egg), then cooked by frying, baking, or simmering in sauce.","zh":"肉丸；用绞肉（常加入调味料、面包屑和鸡蛋等）揉成小球后，通过煎、烤或在酱汁中炖煮而成的食物。"},"examples":[{"en":"We had spaghetti and meatballs for dinner.","zh":"我们晚餐吃了意大利面配肉丸。"},{"en":"She baked the meatballs and served them with tomato sauce.","zh":"她把肉丸烤好，配番茄酱一起端上桌。"},{"en":"These meatballs are made with beef and pork.","zh":"这些肉丸是用牛肉和猪肉做的。"}]}],"synonyms":["meatball (singular)","minced-meat balls","ground-meat balls"],"phonetic":"/ˈmiːtˌbɔlz/","extraExplanation":["“Meatballs”通常作复数名词使用（a meatball / some meatballs）。在美式语境里，“spaghetti and meatballs（意大利面配肉丸）”是非常常见、带有家庭式舒适感的菜名，也常出现在电影和动画里（如《小姐与流氓》里经典的“分享意大利面”场景常让人联想到肉丸）。","不同文化也有类似食物：瑞典肉丸（Swedish meatballs）常配奶油肉汁与果酱；中式肉丸（如狮子头）更偏松软或带汤汁。英语里可以用“Swedish meatballs / Italian-style meatballs”等来具体说明风格。"]}
{"word":"meatbird","summary":{"en":"“Meatbird” is an informal regional word for a muttonbird (a shearwater) that people have traditionally eaten.","zh":"“meatbird”是地区性非正式用语，通常指可食用的“muttonbird（羊肉鸟/剪水鹱）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An informal term (especially in Australia/New Zealand) for a muttonbird—a seabird (often a shearwater) traditionally harvested for food.","zh":"（非正式用语，尤见于澳大利亚/新西兰）指“muttonbird（羊肉鸟）”，一种海鸟（常指鹱/剪水鹱），传统上会被捕捞作为食物。"},"examples":[{"en":"In some coastal communities, people once relied on meatbirds as an important food source.","zh":"在一些沿海社区，人们过去曾依赖“meatbird（羊肉鸟）”作为重要食物来源。"},{"en":"The guide explained that “meatbird” is another name for muttonbird.","zh":"导游解释说，“meatbird”是“muttonbird（羊肉鸟）”的另一种叫法。"}]}],"synonyms":["muttonbird","shearwater"],"phonetic":"/ˈmitˌbɝd/","extraExplanation":["“meatbird”不是通用英语里的常见词，更常见、较中性的说法是“muttonbird”。在澳大利亚塔斯马尼亚等地，“muttonbirding（捕捞羊肉鸟）”与当地（含原住民）传统、季节性食物和社区生活有关；在现代语境中也会涉及保育、配额与可持续捕捞等话题。","如果你是在阅读小说或地方报道里看到“meatbird”，它多半是在强调这种鸟“可食用/作为肉类来源”的用途，而不是在做严格的鸟类学分类。"]}
{"word":"meatcutter","summary":{"en":"A meatcutter is someone who cuts and prepares meat for customers.","zh":"meatcutter 指为顾客切割、处理并准备肉类的工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to cut and prepare meat for sale, often in a grocery store or butcher shop","zh":"（在超市或肉铺）切割、分割并处理肉类的工作人员；肉类切割工"},"examples":[{"en":"The meatcutter trimmed the fat and sliced the beef into thin pieces.","zh":"肉类切割工把多余的脂肪修掉，并把牛肉切成薄片。"},{"en":"Ask the meatcutter if you want a thicker cut for grilling.","zh":"如果你想要适合烧烤的厚切肉，可以问问肉类切割工。"},{"en":"She trained as a meatcutter and learned how to break down whole chickens safely.","zh":"她接受过肉类切割工培训，学会了如何安全地分割整只鸡。"}]}],"synonyms":["butcher","meat cutter"],"phonetic":"/ˈmiːtˌkʌtər/","extraExplanation":["在美式英语里，meatcutter 常见于超市“肉类柜台（meat counter）”的岗位称呼，强调“分割、修整、切片”等具体操作；butcher（屠夫/肉铺老板）更常指在肉铺工作的人，也可能包含进货、销售等更广的职责。日常对话里两者常可互换。"]}
{"word":"meate","summary":{"en":"“Meate” is an archaic spelling (or a misspelling) of “meat.” Use “meat” in modern English.","zh":"“meate”是“meat”的古拼法（也可能是拼写错误）。现代英语中应使用“meat”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or misspelling) an old spelling of “meat,” meaning animal flesh used as food; also sometimes used more broadly to mean food in general.","zh":"（古拼法或拼写错误）“meat”的旧拼法，指肉（可食用的动物肌肉）；有时更广义也可指食物。"},"examples":[{"en":"In older texts, you may see “meate” where modern English would write “meat.”","zh":"在较早的文本中，你可能会看到“meate”，现代英语则写作“meat”。"},{"en":"They had bread and meate for supper. (archaic style)","zh":"他们晚餐吃了面包和肉。（古风表达）"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, via “meat”) the most important or substantial part of something.","zh":"（比喻义，源自“meat”）事物最重要、最充实的部分；核心内容。"},"examples":[{"en":"Let’s get to the meat of the discussion.","zh":"我们直奔讨论的核心吧。"},{"en":"The meat of the book is in the middle chapters.","zh":"这本书最精彩（最关键）的内容在中间几章。"}]}],"synonyms":["meat","food (older broad sense)","the core (figurative)","the essence (figurative)"],"phonetic":"/mit/","extraExplanation":["“meate”常见于中古英语/早期现代英语的拼写；现代标准拼写是“meat”。如果你是在写作或考试中使用，建议用“meat”。","现代英语里“meat”也常用作比喻，表示“核心/重点”（the meat of something）。"]}
{"word":"meated","summary":{"en":"“Meated” usually means “having/containing meat,” and more rarely “fleshy” or the past form of the rare verb “to meat” (to supply with meat).","zh":"“meated”通常表示“有肉/含肉的”，较少见时可指“肉质厚实的”，也可作罕见动词 meat（提供肉）的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having meat; containing meat (often used in older writing or specialized contexts)","zh":"有肉的；含肉的（多见于较旧的用法或特定语境）"},"examples":[{"en":"The stew was heavily meated, with big chunks of beef.","zh":"这锅炖菜肉很多，有大块的牛肉。"},{"en":"Some diners prefer a meated sauce rather than a vegetable-based one.","zh":"有些食客更喜欢含肉的酱汁，而不是以蔬菜为主的酱汁。"}]},{"partOfSpeech":"adj.","definition":{"en":"fleshy; having a thick, soft inner part (sometimes used for fruit or plant parts)","zh":"肉质的；果肉（或组织）厚实的（有时用于水果或植物部位）"},"examples":[{"en":"The fruit is small but meated and juicy.","zh":"这种水果个头不大，但果肉厚实而多汁。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of the rare verb “to meat”: to provide or supply with meat","zh":"罕见动词 meat 的过去式/过去分词：给……提供肉；用肉供应"},"examples":[{"en":"In older accounts, the servants were meated and paid for the journey.","zh":"在较旧的记载中，仆人一路上有肉吃并领取报酬。"}]}],"synonyms":["meaty","with meat","fleshy"],"phonetic":"/ˈmiːtɪd/","extraExplanation":["“meated”在现代英语里不常用，更常见的说法是“with meat / containing meat / meaty”。如果你在文学作品、历史文本或方言材料里看到“meated”，通常就是强调“有肉/肉很多”或“肉质厚实”。","注意不要和“met”（meet 的过去式，意思是“遇见/会见”）混淆：拼写和发音都不同。"]}
{"word":"meath","summary":{"en":"“meath” is usually a misspelling of “meat”: animal flesh as food, or figuratively the main point.","zh":"“meath”通常是“meat”的误拼：指食用的肉；也可比喻为事情的要点/核心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling: “meath”) the flesh of an animal eaten as food.","zh":"（常见误拼：meath）肉；（可食用的）动物肌肉。"},"examples":[{"en":"We don’t eat much meat at home.","zh":"我们家不怎么吃肉。"},{"en":"Chicken is a popular kind of meat.","zh":"鸡肉是一种很常见的肉类。"}]},{"partOfSpeech":"n.","definition":{"en":"the main or most important part of something (often: “the meat of the matter/story”).","zh":"（比喻）要点；核心内容（常用：the meat of the matter/story）。"},"examples":[{"en":"Let’s get to the meat of the problem.","zh":"我们来谈问题的核心。"},{"en":"The introduction is long, but the meat of the article is in the middle.","zh":"开头很长，但文章的重点在中间部分。"}]}],"synonyms":["flesh","protein","core","essence"],"phonetic":"/mit/","extraExplanation":["“meath”通常不是标准英文拼写。你可能想写的是 **meat**（肉）。","另外，**Meath**（大写）是爱尔兰的一个郡名（County Meath），属于专有名词，用法与“meat”无关。"]}
{"word":"meathe","summary":{"en":"“Meathe” is not standard modern English; it’s usually a misspelling or archaic form related to “meat.”","zh":"“meathe”不是现代标准英语，通常是“meat”的拼写错误或古拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form in modern English. It is most often intended to be “meat” (animal flesh used as food) or, in older texts, an archaic spelling related to “meat” meaning “food” more generally.","zh":"现代英语中不规范/常见拼写错误形式。通常是想写“meat”（肉类；供食用的动物肉）；在较老文本中也可能是与“meat”有关的古拼写，泛指“食物”。"},"examples":[{"en":"I think you meant “meat”: We bought meat for dinner.","zh":"我觉得你想写的是“meat”：我们买了肉当晚餐。"},{"en":"In older English, “meat” could mean “food” in general, not only animal flesh.","zh":"在较早的英语里，“meat”有时可泛指“食物”，不只指肉。"}]}],"synonyms":["meat","food (older sense)"],"phonetic":"/miːt/","extraExplanation":["“meathe”不是现代标准拼写。你如果是在聊天或作业里看到/写到它，最实用的做法是根据上下文改成“meat”。","小文化点：一些固定搭配保留了“meat=食物/主要内容”的老用法，比如“the meat of the story”（故事的核心/重点）。"]}
{"word":"meathead","summary":{"en":"“Meathead” is an informal, often insulting word for a muscular person seen as unintelligent, or for someone acting rude/aggressive.","zh":"“meathead”是非正式且常带侮辱的词，可指被认为“头脑简单的肌肉男/健身狂”，也可指行为粗鲁、好斗的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (often insulting) term for a person who is very muscular or focused on physical strength, and seen as not very intelligent or thoughtful.","zh":"（常带侮辱）指一个很壮、很在意力量或健身的人，但被认为不太聪明或不够有思想。"},"examples":[{"en":"He’s not a meathead—he just loves working out after work.","zh":"他不是“肌肉脑袋”——他只是下班后很喜欢健身。"},{"en":"The movie turns every athlete into a meathead, which feels unfair.","zh":"那部电影把每个运动员都塑造成“没脑子的肌肉男”，感觉不太公平。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who behaves in a rude, aggressive, or insensitive way; a “jerk.”","zh":"行为粗鲁、好斗或不体贴的人；类似“混蛋/讨厌鬼”。"},"examples":[{"en":"Don’t be a meathead—let people get off the train first.","zh":"别那么没素质——先让别人下车。"},{"en":"He acted like a meathead at the party and kept interrupting everyone.","zh":"他在派对上表现得很讨厌，一直打断别人说话。"}]}],"synonyms":["musclehead","jerk","lunk","dumb jock"],"phonetic":"/ˈmitˌhɛd/","extraExplanation":["“meathead”是非常口语、偏贬义的说法：把人比作“只有肉（肌肉）没有脑子”。有时也用来骂人粗鲁或缺乏同理心。对健身或运动的人使用可能带刻板印象，正式场合建议避免。","常见近义表达（语气从一般到更强）：“musclehead”（类似但更直接指健身刻板印象）、“dumb jock”（贬义，指“头脑简单的运动员”）、“jerk”（更常用、指行为讨厌）。"]}
{"word":"meatheads","summary":{"en":"“Meatheads” means people seen as very muscular but unintelligent; it’s informal and insulting.","zh":"“meatheads”指被认为“很壮但不聪明”的人，是非正式且带侮辱性的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rude, informal word for people (usually men) seen as very muscular but not very smart, often linked to heavy weightlifting or aggressive behavior.","zh":"（粗俗、非正式）指（多为男性）头脑简单、四肢发达的人，常与沉迷健身/举铁或好斗的形象相关。"},"examples":[{"en":"He thinks all the guys at the gym are meatheads, but many of them are actually friendly.","zh":"他以为健身房里的男生都是“肌肉笨蛋”，但其实很多人很友好。"},{"en":"The movie is full of loud meatheads who solve every problem with violence.","zh":"这部电影里都是一群吵闹的“肌肉莽汉”，什么事都用暴力解决。"}]}],"synonyms":["musclehead","blockhead","dumb jock","brute"],"phonetic":"/ˈmiːtˌhɛd/","extraExplanation":["“meathead”是明显带贬义和嘲讽的称呼：把人的“脑袋”说成只有“肉”，暗示没脑子。日常交流中对陌生人使用可能很冒犯；更中性的说法可以用“gym guy / big guy / bodybuilder”（视语境而定）。","在一些情境里也可被圈内人半开玩笑地自嘲使用（类似朋友间互损），但是否合适非常依赖关系和语气。"]}
{"word":"meathook","summary":{"en":"Meathook usually means a hook for hanging meat; informally it can mean a very hard hook punch or a very big hand.","zh":"meathook通常指“肉钩”；非正式用法可指“很重的勾拳”或“很大的手”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong metal hook used for hanging or carrying large pieces of meat (often in a butcher shop or meat locker).","zh":"（常见于肉铺或冷库的）肉钩；用来悬挂或搬运大块肉的结实金属钩。"},"examples":[{"en":"The butcher hung the beef on a meathook in the cold room.","zh":"屠夫把牛肉挂在冷库里的肉钩上。"},{"en":"Wear gloves—those meathooks are sharp.","zh":"戴上手套——那些肉钩很锋利。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A very powerful hook punch in boxing or fighting.","zh":"（非正式）拳击/格斗中非常有力的勾拳。"},"examples":[{"en":"He dropped his opponent with a left meathook.","zh":"他用一记强力左勾拳把对手击倒了。"},{"en":"Keep your guard up to avoid that meathook.","zh":"抬起防守，别吃他那记重勾拳。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A very large, rough hand.","zh":"（非正式）大而粗糙的手；“大手”。"},"examples":[{"en":"He grabbed the suitcase with his meathooks.","zh":"他用那双大手抓起了手提箱。"},{"en":"Don’t touch the cake with your meathooks—use a spatula.","zh":"别用你的“大手”去碰蛋糕——用刮刀。"}]}],"synonyms":["meat hook","hook","butcher’s hook","hook punch","left hook"],"phonetic":"ˈmiːtˌhʊk","extraExplanation":["“meathook”作俚语时语气往往偏粗犷，可能带一点贬义或夸张效果：形容人的手很大很粗，或形容拳头很“重”。在正式场合更建议用“large hands / powerful hook punch”等更中性的说法。"]}
{"word":"meathooks","summary":{"en":"Meathooks are strong hooks for hanging meat; informally, it can also mean big hands or a powerful hook punch in boxing.","zh":"Meathooks 指挂肉用的结实大钩子；口语里也可指“大手”，或拳击中很猛的摆拳/勾拳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, strong hook used for hanging or carrying pieces of meat (often in a butcher shop or meat-packing facility)","zh":"（常用于肉铺或屠宰/肉类加工场的）肉钩；挂肉用的大钩子"},"examples":[{"en":"The butcher hung the beef on a meathook to drain.","zh":"屠夫把牛肉挂在肉钩上沥干。"},{"en":"Wear gloves—those meathooks are sharp.","zh":"戴上手套——那些肉钩很锋利。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, figurative) a large hand, especially when someone’s hands look rough or powerful","zh":"（非正式，比喻）大手；粗壮有力的手"},"examples":[{"en":"He grabbed the suitcase with his meathooks and lifted it easily.","zh":"他用那双“大手”抓起行李箱，轻松就提起来了。"},{"en":"Don’t touch the cake with your meathooks—use a fork.","zh":"别用你的“大手”去碰蛋糕——用叉子。"}]},{"partOfSpeech":"n.","definition":{"en":"(boxing, informal) a wide, powerful hook punch","zh":"（拳击，非正式）一记又大又猛的摆拳/勾拳"},"examples":[{"en":"He dropped his opponent with a left meathook.","zh":"他用一记左摆拳把对手击倒了。"}]}],"synonyms":["meat hook","hook","butcher’s hook","big hands","paws","hook punch"],"phonetic":"/ˈmiːtˌhʊk/","extraExplanation":["“meathook(s)”做比喻时通常带一点调侃甚至轻微贬义，强调“手很大、很粗、很不灵巧”。在口语里也可能只是夸张说法，具体语气要看上下文。","拳击里的“meathook”不是正式术语，更像行话/口语，用来形容“抡得很大、力量很重”的勾拳。"]}
{"word":"meatic","summary":{"en":"Meatic is a rare adjective meaning “meaty” or “fleshy,” describing something that resembles meat in texture or substance.","zh":"Meatic 是一个很少见的形容词，意思是“肉质的/像肉的”，用来形容质地或感觉像肉一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) like meat; meaty; fleshy in texture or appearance.","zh":"（罕用）像肉的；多肉的；肉质的（指质地或外观）。"},"examples":[{"en":"The mushrooms had a meatic texture, almost like grilled chicken.","zh":"这些蘑菇口感很“肉质”，几乎像烤鸡肉。"},{"en":"He described the stew as rich and meatic.","zh":"他形容这道炖菜浓郁而“肉感十足”。"}]}],"synonyms":["meaty","fleshy","carnal"],"phonetic":"/ˈmiːtɪk/","extraExplanation":["“meatic”在现代英语里非常少见，更常用的表达是“meaty”（更常见、自然）或“fleshy”。在食物语境中，用“meaty texture / meaty flavor”最地道。","在文学或较旧的用法中，“meatic”可能用来强调“像肉一样的质感/实体感”，但日常写作通常不建议用，以免显得生僻或不自然。"]}
{"word":"meatier","summary":{"en":"“Meatier” means more substantial or detailed (especially of content), or having more meat (of food).","zh":"“meatier”表示（内容）更充实、更有料；也可表示（食物）肉更多、更厚实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More substantial, detailed, or richer in content (often about writing, information, or an argument).","zh":"（多指内容、信息或论点）更充实的、更有料的、更详细的。"},"examples":[{"en":"Can you make the report meatier with more data and examples?","zh":"你能把报告写得更充实一些，加更多数据和例子吗？"},{"en":"Her revised essay is meatier and easier to understand.","zh":"她修改后的文章更充实，也更容易理解。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having more meat; thicker or heavier in meat (about food or a part of the body).","zh":"（指食物或身体部位）肉更多的；更厚实的。"},"examples":[{"en":"Choose the meatier cuts for stew so it stays flavorful.","zh":"炖菜选更厚实、肉更多的部位，味道更香。"},{"en":"This fish has meatier fillets than the smaller ones.","zh":"这条鱼的鱼片比小一点的更厚实。"}]}],"synonyms":["more substantial","more detailed","richer","more robust","thicker"],"phonetic":"/ˈmiːtiər/","extraExplanation":["“meatier”是形容词“meaty”的比较级。英语里常用“meaty”来比喻“有实质内容、有分量”，就像“肉”象征“干货/精华”。在职场写作中，“a meatier email/proposal”通常指信息更具体、细节更充分。"]}
{"word":"meatiest","summary":{"en":"“Meatiest” means “having the most meat,” or informally “the most substantial/important part.”","zh":"“meatiest”表示“肉最多的”，也可引申为“最有分量、最关键的部分”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “meaty”: having the most meat; containing a lot of meat.","zh":"“meaty”的最高级：肉最多的；含肉量很高的。"},"examples":[{"en":"This is the meatiest burger on the menu.","zh":"这是菜单上肉最多的汉堡。"},{"en":"Pick the meatiest parts of the chicken for the soup.","zh":"做汤时选鸡肉最厚实的部位。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) The most substantial, important, or information-rich part of something (like a discussion, book, or report).","zh":"（非正式）最有分量的；最关键、信息最密集的（常指讨论、书、报告等中最“硬核”的部分）。"},"examples":[{"en":"The meatiest part of the article is the section on solutions.","zh":"这篇文章最有分量的部分是关于解决方案的那一节。"},{"en":"Let’s get to the meatiest points of the debate.","zh":"我们来谈辩论中最关键的几点。"}]}],"synonyms":["most meaty","meat-packed","thickest","heartiest","most substantial","most informative","most important"],"phonetic":"/ˈmiːtiɪst/","extraExplanation":["“meatiest”来自形容词“meaty”（多肉的；内容充实的）。拼写规则：以 -y 结尾的形容词变最高级时，常把 y 变成 i 再加 -est：meaty → meatier → meatiest。","第二个意思是比喻用法：把“肉多”引申为“内容厚实、有干货”。常见搭配：the meatiest part/section/points。"]}
{"word":"meatily","summary":{"en":"Meatily means “in a substantial, detail-rich way,” and less commonly “in a thick, solid (meaty) way,” especially about food.","zh":"meatily 常指“内容充实、信息量大地”，较少见也可指“厚实、肉感十足地”（多用于食物）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is full of substance, important details, or strong content (often about writing, arguments, or information).","zh":"（常指文章、论点或信息）内容充实、干货很多地；有实质内容地。"},"examples":[{"en":"The report is written meatily, with clear facts and very little filler.","zh":"这份报告写得很有料，事实清晰，几乎没有废话。"},{"en":"She answered meatily, giving specific reasons instead of vague opinions.","zh":"她回答得很有内容，用具体理由而不是笼统看法。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is thick, solid, or “meaty” in texture (often about food or physical things).","zh":"（常指食物或实体）厚实地；肉感十足地；质地饱满地。"},"examples":[{"en":"Cut the mushrooms meatily so they stay firm in the stew.","zh":"把蘑菇切得厚实些，这样在炖菜里还能保持口感。"},{"en":"The steaks were sliced meatily, not paper-thin.","zh":"牛排切得很厚实，不是薄如纸。"}]}],"synonyms":["substantively","solidly","richly","in detail","thickly"],"phonetic":"/ˈmiːtəli/","extraExplanation":["“meatily”来自形容词“meaty”（多肉的；内容充实的）+ 副词后缀“-ly”。在非字面意义上，英语里常用“meaty”来形容“有分量的观点/信息”，因此“meatily”常见于评论写作、新闻、学术或职场表达中（如：a meaty discussion / a meaty chapter）。","语气上，“meatily”带一点口语和形象化色彩：强调“有干货”，也可能暗含“说到点子上、不绕弯”。正式写作中有时也会用“substantively”“in detail”等更中性的表达。"]}
{"word":"meatiness","summary":{"en":"Meatiness means either rich, substantial content (the “meat” of an idea) or a physically meaty, thick texture (especially in food).","zh":"Meatiness既可指内容有分量、信息充实（抓住要点），也可指字面上的肉多/口感厚实（常用于食物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being full of substance or important information; richness in content (often used about writing, discussions, or evidence).","zh":"（多指文章、讨论、证据等）内容充实、有分量；信息量大。"},"examples":[{"en":"The report’s meatiness comes from the real data and clear comparisons.","zh":"这份报告之所以有分量，是因为它有真实数据和清晰对比。"},{"en":"I like podcasts with some meatiness, not just small talk.","zh":"我喜欢内容扎实的播客，而不是只聊天寒暄的那种。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being “meaty” in a physical sense—having a lot of meat or a thick, firm texture (about food or body parts).","zh":"（字面）肉多、肉厚；（食物）口感厚实有嚼劲。"},"examples":[{"en":"These ribs have great meatiness and don’t dry out easily.","zh":"这排肋骨肉很厚实，而且不容易烤干。"},{"en":"The stew has a satisfying meatiness even with simple seasoning.","zh":"这锅炖菜即使调味简单，也有很满足的“肉感”。"}]}],"synonyms":["substance","richness","heft","density","heartiness"],"phonetic":"/ˈmiːtɪnəs/","extraExplanation":["“meatiness”来自形容词“meaty”（多肉的；有实质内容的）。英语里常用“the meat of something”表示“核心/要点”，所以“meatiness”也常引申为“有干货、有重点”。","在写作与口语里，评价内容“meaty / with meatiness”通常是正面含义：不空泛、信息密度高。烹饪语境中则更偏向口感与肉量。"]}
{"word":"meatless","summary":{"en":"Meatless means “without meat,” often describing food or meals.","zh":"meatless 意为“无肉的、不含肉的”，常用来形容食物或餐食。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing no meat; made without meat (often for vegetarian/vegan diets).","zh":"不含肉的；无肉制作的（常用于素食/纯素饮食）。"},"examples":[{"en":"We ordered a meatless burger made from beans.","zh":"我们点了一个用豆子做的无肉汉堡。"},{"en":"She tries to cook meatless meals twice a week for health reasons.","zh":"出于健康原因，她每周尽量做两次无肉餐。"},{"en":"The cafeteria added more meatless options like tofu stir-fry.","zh":"食堂增加了更多无肉选择，比如豆腐炒菜。"}]}],"synonyms":["vegetarian (often, but not always the same)","no-meat","meat-free"],"phonetic":"/ˈmiːt.ləs/","extraExplanation":["“meatless”在英语里常用于食品包装、菜单和健康/环保话题中，例如“Meatless Monday（无肉星期一）”是一项鼓励人们每周至少一天不吃肉的活动。","“meatless”通常强调“没有肉”，但不一定等于“素食/纯素”：有些无肉食品仍可能含蛋、奶等动物制品。更严格的说法分别是“vegetarian（素食的）”和“vegan（纯素的）”。"]}
{"word":"meatloaf","summary":{"en":"Meatloaf is a loaf-shaped baked dish made from seasoned ground meat, usually sliced and served as a home-style meal.","zh":"meatloaf 指一种把调味绞肉做成“条状”烤制的美式家常菜，通常切片食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baked dish made from ground meat mixed with ingredients like eggs, breadcrumbs, onions, and seasonings, shaped like a loaf and sliced to serve.","zh":"肉饼（美式家常菜）：把绞肉拌入鸡蛋、面包屑、洋葱和调味料等，做成“面包状”烤制，切片食用。"},"examples":[{"en":"My mom makes meatloaf with ketchup on top.","zh":"我妈妈做的肉饼上面会抹番茄酱。"},{"en":"Meatloaf is often served with mashed potatoes and vegetables.","zh":"肉饼常常搭配土豆泥和蔬菜一起吃。"}]},{"partOfSpeech":"n.","definition":{"en":"A loaf-shaped mass of ground meat (before or after cooking).","zh":"（生的或熟的）做成条状/面包形的绞肉团。"},"examples":[{"en":"She shaped the meatloaf and put it in the oven.","zh":"她把绞肉团整形成肉饼形状，然后放进烤箱。"}]}],"synonyms":["loaf-style ground meat","baked ground-meat loaf"],"phonetic":"/ˈmiːtˌloʊf/","extraExplanation":["Meatloaf 是很典型的美国家常菜，常见于家庭晚餐或餐馆的“comfort food（家常暖心食物）”菜单。做法和各家配方差异很大：有人用牛肉，也有人混合牛+猪或火鸡肉；上面常刷番茄酱或甜酸酱汁。","注意大小写：meatloaf（菜名）一般小写；Meat Loaf（或 Meatloaf）也可能指美国摇滚歌手的艺名，在音乐语境中才会大写。"]}
{"word":"meatman","summary":{"en":"“Meatman” usually means a butcher/meat seller, and can also be an informal (sometimes rude) nickname; it’s not very common in everyday English.","zh":"“meatman”通常指屠夫/卖肉的人，也可作非正式（有时不礼貌）的绰号；在日常英语中并不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man who sells meat, especially a butcher (not very common; more often people say “butcher”).","zh":"卖肉的人，尤指屠夫（不太常用；更常说 butcher）。"},"examples":[{"en":"The meatman delivered fresh beef to the restaurant every morning.","zh":"卖肉的人每天早上把新鲜牛肉送到餐馆。"},{"en":"In old stories, the meatman sometimes also brought news from the market.","zh":"在一些旧故事里，卖肉的人有时也会从集市带来消息。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes rude) a nickname for a man strongly associated with meat (for example, by job, diet, or stereotype). Use with care because it can sound mocking.","zh":"（非正式，有时带讽刺/不礼貌）对“跟肉关系很大”的男性的绰号（比如工作、饮食或刻板印象）。使用时要小心，可能显得嘲笑。"},"examples":[{"en":"His friends jokingly called him “the meatman” because he always ordered a double burger.","zh":"朋友们开玩笑叫他“meatman”，因为他总点双层汉堡。"},{"en":"Don’t call strangers “meatman”—it can sound disrespectful.","zh":"别对陌生人叫“meatman”，听起来可能不尊重。"}]}],"synonyms":["butcher","meat seller","meat vendor"],"phonetic":"ˈmitˌmæn","extraExplanation":["“meatman”不是高频日常词。日常更自然的说法通常是 butcher（屠夫/肉店老板）或 meat seller / meat vendor（卖肉的人）。","如果你在歌词、网名、电影台词里看到 Meatman / Meat Man，它也可能只是外号、艺名或品牌名，具体含义取决于语境。"]}
{"word":"meatmen","summary":{"en":"“Meatmen” usually means men who sell or prepare meat (butchers), and it can also refer to the punk band The Meatmen.","zh":"“Meatmen”通常指卖肉/处理肉类的人（屠夫、肉贩）；也可能指朋克乐队 The Meatmen。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of meatman: men who sell, cut, or prepare meat; butchers or meat sellers.","zh":"meatman 的复数：卖肉、切肉或处理肉类的男人；屠夫/肉贩。"},"examples":[{"en":"The meatmen at the market start work early to prepare fresh cuts.","zh":"市场里的肉贩很早就开始干活，准备新鲜的肉块。"},{"en":"In older stories, the meatmen delivered meat from shop to door.","zh":"在一些较老的故事里，卖肉的人会把肉从店里送到家门口。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A U.S. punk rock band called The Meatmen.","zh":"（专有名词）美国朋克摇滚乐队 The Meatmen（“肉人乐队”）。"},"examples":[{"en":"He’s a fan of The Meatmen, an early American punk band.","zh":"他是 The Meatmen 的粉丝，那是一支早期的美国朋克乐队。"}]}],"synonyms":["butchers","meat sellers","meat vendors"],"phonetic":"/ˈmitmɛn/","extraExplanation":["“meatman/meatmen”在现代日常英语里不算常见；更常用的说法是 butcher（屠夫/肉铺老板）或 meat seller/vendor（肉类摊贩/商贩）。","如果你是在音乐、亚文化或网络语境里看到 Meatmen，可能指乐队名（The Meatmen）；作为专有名词时通常要大写。"]}
{"word":"meato","summary":{"en":"“Meato” isn’t standard English; it usually means “meat” or “meaty,” or it may be a name/username.","zh":"“meato”不是标准英语；通常是指“meat/肉”或“meaty/内容扎实的”，也可能是名字或网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard, informal) A playful or mistaken spelling that usually refers to “meat” (animal flesh used as food), or something “meaty” (full of substance).","zh":"（非标准、口语/网络用法）常见为一种玩笑式或误写的拼法，通常想表达“meat（肉）”或“meaty（内容很扎实的）”。"},"examples":[{"en":"I think you meant “meat,” not “meato.”","zh":"我觉得你想写的是“meat（肉）”，不是“meato”。"},{"en":"Let’s get some meat for tacos tonight.","zh":"今晚我们买点肉做塔可吧。"},{"en":"That article is really meaty—lots of useful details.","zh":"那篇文章内容很扎实——有很多有用的细节。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun, rare) A name/handle/brand; meaning depends on the person or product using it.","zh":"（专有名词，较少见）可能是人名/网名/品牌名；含义取决于具体指代对象。"},"examples":[{"en":"Meato is the username he uses online.","zh":"Meato 是他在网上用的用户名。"}]}],"synonyms":["meat","meaty"],"phonetic":"/ˈmiːtoʊ/","extraExplanation":["“meato”不是常见标准英语单词，词典里通常查不到。很多时候它只是把“meat”写错了，或在网络语境中故意写得好玩。","如果你是在某个特定句子/梗/品牌里看到“meato”，把原句发我，我可以帮你判断它在那个语境下的确切意思。"]}
{"word":"meatometer","summary":{"en":"Meatometer is a humorous, informal word meaning either a meat thermometer or (crude slang) a joking “meter” for sexual appeal/size.","zh":"Meatometer 是個幽默的非正式詞，可指「肉類溫度計」，也可作粗俗俚語，指用來評估性吸引力／尺寸的玩笑說法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, humorous) A “meat thermometer”; any device or gauge used to measure the internal temperature or doneness of meat while cooking.","zh":"（非正式、幽默）“肉類溫度計”；指用來測量烤肉／煎肉內部溫度或熟度的工具或裝置。"},"examples":[{"en":"I used the meatometer to check whether the chicken was fully cooked.","zh":"我用「meatometer」確認雞肉是不是已經熟透了。"},{"en":"A good meatometer helps you avoid dry steak.","zh":"好的「meatometer」能幫你避免牛排煎得太乾。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, crude) A joking “meter” for judging someone’s sexual appeal or sexual “size”; used as a humorous (often rude) metaphor.","zh":"（俚語、粗俗）開玩笑說用來評估某人的性吸引力或性「尺寸」的「測量表」；帶有粗俗幽默的比喻用法。"},"examples":[{"en":"That comment was basically him turning the conversation into a meatometer.","zh":"他那句話基本上是在把對話變成一個很粗俗的「meatometer」。"},{"en":"In the office, jokes like that meatometer stuff aren’t appropriate.","zh":"在辦公室，像那種「meatometer」式的玩笑不合適。"}]}],"synonyms":["meat thermometer","food thermometer","probe thermometer","(slang) size joke"],"phonetic":"/ˈmiːtəˌmɪtər/","extraExplanation":["這個詞多半是臨時造詞（meat + -ometer），不是正式字典常見詞。若你在食譜或烤肉情境看到，通常只是把「meat thermometer（肉類溫度計）」講得更搞笑。","第二個俚語義帶性暗示與物化意味，容易冒犯他人；在職場、學校或不熟的人面前建議避免使用。"]}
{"word":"meatorrhaphy","summary":{"en":"Meatorrhaphy is surgical repair of a body opening (especially the urethral opening) by suturing.","zh":"Meatorrhaphy 指通过缝合来修复（尤指尿道）道口的外科手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure in which a meatus (a natural body opening, especially the urethral opening) is repaired or narrowed by stitching (suturing).","zh":"一种外科手术：通过缝合来修复或缩小“口/道口”（身体的自然开口，尤指尿道口）。"},"examples":[{"en":"After the injury, the urologist recommended meatorrhaphy to repair the urethral opening.","zh":"受伤后，泌尿科医生建议做尿道口缝合修复术（meatorrhaphy）来修复尿道口。"},{"en":"Meatorrhaphy may be done to correct problems with the shape or size of the meatus.","zh":"meatorrhaphy 有时用于矫正尿道口形状或大小的问题。"}]}],"synonyms":["meatal repair","urethral meatus repair (context-dependent)"],"phonetic":"/ˌmiːəˈtɔːrəfi/","extraExplanation":["词源拆解：meato- 表示“道口/开口（meatus）”，-rrhaphy 表示“缝合术”。这是比较少见、较专业的医学词，常见于泌尿外科语境。","易混词：meatotomy（切开道口/尿道口切开术）与 meatoplasty（道口成形术/整形术）更常见；meatorrhaphy 强调“用缝线缝合修复/缩小”。"]}
{"word":"meatoscope","summary":{"en":"A rare technical word for a device used to examine meat.","zh":"一个较罕见的技术词，指用于检查肉类的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to examine meat (for example, to check quality, texture, or signs of disease), especially in food inspection or research contexts","zh":"肉类检视器；用于检查肉类（如质量、组织状态或疾病迹象）的仪器，常见于食品检验或研究语境"},"examples":[{"en":"The inspector used a meatoscope to examine the cut for abnormalities.","zh":"检验员用肉类检视器检查这块肉是否有异常。"},{"en":"In the lab, a meatoscope helped researchers compare muscle texture in different samples.","zh":"在实验室里，肉类检视器帮助研究人员比较不同样本的肌肉质地。"}]}],"synonyms":["meat inspection device","inspection scope","meat examiner"],"phonetic":"/ˈmiːtəˌskoʊp/","extraExplanation":["这是一个非常少见的词，通常只在专业或技术语境里出现。词源上可拆为 meat（肉）+ -scope（“观察/检查的工具”，如 microscope 显微镜、stethoscope 听诊器）。日常英语中更常说 inspect the meat（检查肉类）、meat inspection（肉类检验），或用更具体的设备名称。"]}
{"word":"meatoscopy","summary":{"en":"Meatoscopy is a medical inspection of a bodily opening (especially the external urethral opening).","zh":"Meatoscopy 指对身体自然开口的医学观察检查，尤指尿道外口检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical examination/inspection of the body’s meatus (a natural opening), especially the external urethral opening.","zh":"对身体的“口/开口”（meatus，自然开口）的医学检查；尤指对尿道外口的观察/检查。"},"examples":[{"en":"The urologist performed meatoscopy to check for narrowing of the urethral opening.","zh":"泌尿科医生进行了尿道口检查（meatoscopy），以确认尿道外口是否变窄。"},{"en":"Meatoscopy may be part of an exam when a patient reports pain during urination.","zh":"当病人诉说排尿疼痛时，meatoscopy 可能是检查的一部分。"}]}],"synonyms":["inspection of the meatus","meatal examination","urethral meatus inspection"],"phonetic":"/ˌmiːəˈtɑːskəpi/","extraExplanation":["词源：meato- 来自拉丁语 meatus（“通道、开口”），-scopy 来自希腊语 -skopia（“观察、检查”）。合起来就是“对开口进行观察检查”。","使用场景：多见于泌尿科语境，常与“尿道外口狭窄（meatal stenosis）”“炎症”“外伤或术后评估”等一起出现。日常英语中很少用，主要是医学术语。"]}
{"word":"meatotome","summary":{"en":"A rare medical term: a surgical tool used for a meatotomy (incision to widen the urethral opening).","zh":"少见的医学词：用于尿道口切开术（扩大尿道外口的小切开）的外科器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical instrument (a small knife or cutting tool) used to perform a meatotomy—making a small incision to widen the urethral opening (urinary meatus).","zh":"一种外科器械（小刀/切割工具），用于进行“尿道口切开术”（meatotomy）——在尿道外口做小切口以扩大尿道口。"},"examples":[{"en":"The urologist selected a meatotome for a precise incision at the urethral meatus.","zh":"泌尿科医生选用 meatotome，在尿道外口做精确切开。"},{"en":"In some older medical texts, a meatotome is listed among instruments for minor urethral procedures.","zh":"在一些较旧的医学文献中，meatotome 被列为用于轻微尿道操作的器械之一。"}]}],"synonyms":["meatotomy knife","urethral knife","surgical knife"],"phonetic":"/ˈmiːətoʊm/","extraExplanation":["这是非常少见、偏专业的医学词汇，多见于泌尿外科语境。常见的相关术语是 meatotomy（尿道口切开术）和 urethral meatus（尿道外口）。“-tome”来自希腊语，常表示“切割器械”（如 dermatome 皮肤刀）。如果你是在非医学语境看到这个词，也有可能是拼写误差或OCR识别错误。"]}
{"word":"meatotomy","summary":{"en":"Meatotomy is a small surgery to widen the urinary opening (urethral meatus).","zh":"Meatotomy 指通过切开来扩大尿道外口的一个小型手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a minor surgical procedure that makes an incision (small cut) to widen the urinary opening (the urethral meatus), often to relieve narrowing or improve urine flow","zh":"一种小型外科手术：在尿道外口（尿道口）做切开以扩大开口，常用于缓解尿道口狭窄或改善排尿通畅"},"examples":[{"en":"The urologist recommended a meatotomy to treat meatal stenosis.","zh":"泌尿科医生建议做尿道口切开术来治疗尿道口狭窄。"},{"en":"After the meatotomy, the patient reported a stronger urine stream.","zh":"做完尿道口切开术后，患者表示尿流更顺畅、更有力。"},{"en":"Meatotomy is usually performed as an outpatient procedure.","zh":"尿道口切开术通常可以在门诊完成。"}]}],"synonyms":["urethral meatotomy","meatal incision"],"phonetic":"/miˈætəˌtɑmi/","extraExplanation":["词源提示：meatotomy 由 meato-（“开口/通道”，这里指尿道外口 meatus）+ -tomy（“切开”）组成。","语境用法：这是专业医学术语，常见于泌尿科病历、检查报告或手术说明中；日常英语里较少使用。","相关词辨析：meatotomy 通常指“切开扩大尿道口”；meatoplasty 则更偏向“重建/成形”尿道口，含义更广、可能涉及更多修复。"]}
{"word":"meats","summary":{"en":"“Meats” usually means different kinds of animal flesh used as food (plural of “meat”).","zh":"“meats”通常指“肉类（多种/多类）”，是“meat”的复数，用于强调不同种类的肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the flesh of animals used as food; the plural form of “meat.”","zh":"（可食用的）动物肉；“meat”的复数形式。"},"examples":[{"en":"The market sells different meats like chicken, pork, and beef.","zh":"市场卖不同的肉类，比如鸡肉、猪肉和牛肉。"},{"en":"Some people don’t eat meats for health or religious reasons.","zh":"有些人因为健康或宗教原因不吃肉类。"}]},{"partOfSpeech":"n.","definition":{"en":"a plural surname: the family name “Meat(s)” (rare).","zh":"复数形式的姓氏：“Meat(s)”（较少见）。"},"examples":[{"en":"In the credits, two brothers were listed as the Meats.","zh":"在演职员表中，两兄弟被写作“Meats”。"}]}],"synonyms":["meat (general)","animal flesh","cuts of meat"],"phonetic":"/mits/","extraExplanation":["日常英语里，“meat”通常是不可数名词（I eat meat. 我吃肉）。当强调“种类/不同来源的肉”时，才常用复数“meats”（different meats 不同种类的肉）。","在更广义的用法中，“the meat of something”表示“要点/精华/最重要的部分”，但这种比喻通常仍用单数“meat”，不常说“meats”。"]}
{"word":"meature","summary":{"en":"Measure means to find the size/amount of something, or to judge it; as a noun, it can mean a unit/amount or a step taken to solve a problem.","zh":"measure 可表示“测量/衡量”；作名词可指“计量单位/数量”或“解决问题的措施”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to find the size, amount, or degree of something (using a tool or a standard)","zh":"（用工具或标准）测量、量出（尺寸、数量或程度）"},"examples":[{"en":"Can you measure the table before we buy a new tablecloth?","zh":"我们买新桌布前，你能先量一下桌子的尺寸吗？"},{"en":"The doctor measured my blood pressure.","zh":"医生测量了我的血压。"}]},{"partOfSpeech":"v.","definition":{"en":"to judge or evaluate something","zh":"评估；衡量（好坏、价值、影响等）"},"examples":[{"en":"It’s hard to measure the impact of the new policy.","zh":"新政策的影响很难衡量。"},{"en":"You can’t measure success only by money.","zh":"你不能只用金钱来衡量成功。"}]},{"partOfSpeech":"n.","definition":{"en":"an amount or unit used for measuring; a way of measuring","zh":"计量单位；度量方式"},"examples":[{"en":"Add two measures of sugar.","zh":"加两勺（两份量）的糖。"},{"en":"The meter is a measure of length.","zh":"米是长度单位。"}]},{"partOfSpeech":"n.","definition":{"en":"an action taken to deal with a problem; a step or plan (often plural)","zh":"措施；办法（常用复数 measures）"},"examples":[{"en":"The school introduced safety measures.","zh":"学校推出了安全措施。"},{"en":"We need stronger measures to reduce pollution.","zh":"我们需要更有力的措施来减少污染。"}]}],"synonyms":["gauge","calculate","assess","evaluate","meter (v.)"],"phonetic":"/ˈmɛʒər/","extraExplanation":["你输入的 “meature” 不是常见英文单词，最可能是拼写错误，通常想写的是 “measure”。常见拼写：m-e-a-s-u-r-e。","在日常英语里，“measures” 很常指“措施/办法”，例如：take measures（采取措施）、safety measures（安全措施）。"]}
{"word":"meatus","summary":{"en":"Meatus means a natural opening or passage in the body, used mainly in anatomy and medicine.","zh":"Meatus 指身体中的天然开口或通道，主要用于解剖和医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural opening or passage in the body (especially in anatomy/medicine).","zh":"（解剖/医学）身体里的天然开口或通道。"},"examples":[{"en":"The doctor examined the ear canal and the auditory meatus.","zh":"医生检查了耳道以及外耳道口（听道口）。"},{"en":"In anatomy class, we learned that a meatus is an opening that leads into a canal.","zh":"在解剖课上，我们学到 meatus 指通向管道的开口。"}]}],"synonyms":["opening","passage","orifice","canal opening"],"phonetic":"/miˈeɪtəs/","extraExplanation":["这是一个偏医学的拉丁来源词（源自拉丁语，意为“通道/入口”）。日常英语中不常用，更常见于医学报告或解剖学教材。","常见搭配：auditory meatus（外耳道口/听道口）、urinary meatus（尿道口）、nasal meatus（鼻道）。不同部位的 meatus 指的是不同的“开口/通道”。使用时通常需要前面加具体部位来避免歧义。"]}
{"word":"meatuses","summary":{"en":"“Meatuses” is the plural of “meatus,” meaning natural body openings or passages (anatomy term).","zh":"“Meatuses” 是 “meatus” 的复数，指人体天然的开口或通道（解剖学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of meatus) Natural openings or passages in the body, especially in anatomy (for example, the ear canal or the opening of the urethra).","zh":"（meatus 的复数）人体内天然的开口或通道，常用于解剖学（例如外耳道或尿道口）。"},"examples":[{"en":"The doctor examined the ear meatuses for signs of infection.","zh":"医生检查了外耳道的开口/通道是否有感染迹象。"},{"en":"Some conditions can cause swelling around the urethral meatuses.","zh":"有些疾病会导致尿道口周围肿胀。"}]}],"synonyms":["openings","passages","canals"],"phonetic":"/miˈeɪtəsɪz/","extraExplanation":["这是医学/解剖学用语，日常英语里不常见。最常见的搭配包括：external auditory meatus（外耳道）、nasal meatus（鼻道）、urethral meatus（尿道口）。","词源来自拉丁语 meatus，意为“通行、通道”。复数除了 meatuses 也可见到较少用的 meati。"]}
{"word":"meatworks","summary":{"en":"Meatworks means a factory where animals are slaughtered and meat is processed and packaged, especially in Australia and New Zealand.","zh":"meatworks 指肉类屠宰与加工包装的工厂，尤常见于澳大利亚和新西兰英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a factory where animals are slaughtered and the meat is processed and packaged for sale (a meat-processing plant)","zh":"（屠宰并加工、包装肉类的）肉类加工厂／屠宰加工厂"},"examples":[{"en":"He got a job at the meatworks as a cleaner.","zh":"他在肉类加工厂找了一份清洁工的工作。"},{"en":"The town grew around the meatworks and the rail line.","zh":"这个小镇是围绕肉类加工厂和铁路发展起来的。"},{"en":"After the meatworks closed, many families moved away.","zh":"肉类加工厂关闭后，许多家庭搬走了。"}]}],"synonyms":["meatpacking plant","meat-processing plant","slaughterhouse","abattoir"],"phonetic":"/ˈmiːtˌwɝːks/","extraExplanation":["“meatworks”在澳大利亚和新西兰英语中很常见，指大型肉类屠宰与加工厂。美式英语更常说“meatpacking plant”或“processing plant”，英式英语也常用“abattoir（屠宰场）”。","形式上常以复数结尾（works 表“工厂/厂区”），但在句子里可以当作一个整体来用（如：the meatworks is/was…），也可能按复数理解（the meatworks are…），具体取决于地区习惯和说话者的感觉。"]}
{"word":"meaty","summary":{"en":"Meaty means “full of meat” or, more commonly in figurative use, “substantial and full of important content.”","zh":"Meaty既可指“肉很多/肉感足”，也常比喻“内容扎实、信息量大、很有料”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a lot of meat; containing plenty of meat.","zh":"肉很多的；含肉量高的。"},"examples":[{"en":"The stew was thick and meaty, full of beef and vegetables.","zh":"这锅炖菜浓稠又很有肉感，里面满是牛肉和蔬菜。"},{"en":"He ordered a meaty sandwich with roast turkey.","zh":"他点了一份肉很多的三明治，夹着烤火鸡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of an argument, story, or topic) full of substance; rich in important details or ideas.","zh":"（论点/故事/话题）内容扎实的；信息量大、干货多的。"},"examples":[{"en":"The report is short, but it’s meaty—every paragraph matters.","zh":"这份报告不长，但很有料——每一段都很关键。"},{"en":"We had a meaty discussion about the novel’s themes.","zh":"我们就这部小说的主题进行了内容很扎实的讨论。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Strong, muscular, or thick; having substantial flesh.","zh":"（非正式）结实的；肌肉发达的；肉厚的。"},"examples":[{"en":"He has meaty hands from years of working with tools.","zh":"他常年做工具活儿，手掌又厚又结实。"}]}],"synonyms":["fleshy","brawny","substantial","solid","rich","weighty"],"phonetic":"/ˈmiːti/","extraExplanation":["“meaty”既可字面指“肉很多的”，也常用来比喻“有实质内容、信息量大”的东西（如 a meaty article / a meaty chapter），相当于口语里的“很有料/干货满满”。","写作或评论里用“meaty”通常是褒义：强调内容充实、值得细读；但在口感描述中，它更偏“肉感强、扎实”。"]}
{"word":"meaul","summary":{"en":"Meal means a time you eat (or the food you eat), and it can also mean coarsely ground grain like cornmeal.","zh":"meal 指“一餐/用餐时间或那顿饭”，也可指“谷物粗磨粉”（如 cornmeal）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A time when you eat food, or the food eaten at that time (breakfast, lunch, dinner).","zh":"（一）餐；用餐时间；在那段时间吃的食物（如早餐、午餐、晚餐）。"},"examples":[{"en":"We usually have dinner as our main meal.","zh":"我们通常把晚餐当作主餐。"},{"en":"Let’s grab a quick meal before the movie.","zh":"看电影前我们先去随便吃点东西吧。"},{"en":"School meals are free for some students.","zh":"有些学生可以免费吃学校餐。"}]},{"partOfSpeech":"n.","definition":{"en":"Coarsely ground grain used as food or for cooking, such as cornmeal or oatmeal.","zh":"（谷物）粗磨粉；粗粉（如玉米粉、燕麦粗粉）。"},"examples":[{"en":"Add a little cornmeal to prevent the dough from sticking.","zh":"加一点玉米粉可以防止面团粘住。"},{"en":"Oatmeal is made from oats that have been processed into meal.","zh":"燕麦粥是用加工成粗粉的燕麦做的。"}]}],"synonyms":["dinner","lunch","breakfast","dish","food"],"phonetic":"/mil/","extraExplanation":["“meaul”在英语里不是常见或标准拼写，最可能是想写“meal”。如果你是在抄写人名、品牌或其他语言词（例如法语拼写），可以告诉我上下文，我再帮你确认。"]}
{"word":"meaw","summary":{"en":"“Meow” means the sound a cat makes, or to make that sound.","zh":"“meow”指猫叫声，或（猫）发出喵叫。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a cat) to make the typical cat sound.","zh":"（猫）发出“喵”的叫声。"},"examples":[{"en":"The cat meowed at the door to be let in.","zh":"猫在门口喵喵叫，想让人放它进来。"},{"en":"I heard a kitten meowing outside my window.","zh":"我听到窗外有小猫在喵喵叫。"}]},{"partOfSpeech":"n.","definition":{"en":"the sound a cat makes.","zh":"猫叫声；“喵”的一声。"},"examples":[{"en":"A loud meow came from the hallway.","zh":"走廊里传来一声响亮的“喵”。"},{"en":"Her phone notification is set to a meow.","zh":"她把手机通知音设置成了猫叫声。"}]},{"partOfSpeech":"other","definition":{"en":"a playful written form of a cat sound, used online or in comics (also spelled “miaow”).","zh":"拟声词：用于网络或漫画里表示猫叫（也可拼作“miaow”）。"},"examples":[{"en":"He typed “meow” in the chat as a joke.","zh":"他在聊天里打了个“meow”开玩笑。"},{"en":"In the comic, the speech bubble says “MEOW!”","zh":"漫画里对话框写着“MEOW!”。"}]}],"synonyms":["miaow","mew"],"phonetic":"/miˈaʊ/","extraExplanation":["“meaw”不是常见标准拼写；你可能想写的是“meow”。在英式拼写里也常见“miaow”。","拟声词的拼写在不同语言/地区会有变化：中文常写“喵”，英语常写“meow”。"]}
{"word":"meazle","summary":{"en":"Meazle is usually a misspelling; the correct word is measles, a contagious viral illness that causes fever and a rash.","zh":"meazle 通常是拼写错误；正确拼写是 measles，指会引起发烧和皮疹的高传染性病毒性疾病（麻疹）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) an infectious viral disease that causes fever and a red rash; it spreads easily from person to person.","zh":"（通常用复数）麻疹：一种具有传染性的病毒性疾病，会引起发烧和红色皮疹，容易在人群中传播。"},"examples":[{"en":"My little brother caught measles and had to stay home for two weeks.","zh":"我弟弟得了麻疹，不得不在家休息了两周。"},{"en":"Measles can be dangerous for babies and older adults.","zh":"麻疹对婴儿和老年人可能很危险。"},{"en":"The school asked families to check vaccination records after a measles case was reported.","zh":"在出现一例麻疹病例后，学校要求家庭核对疫苗接种记录。"}]}],"synonyms":["rubeola","viral rash illness"],"phonetic":"/ˈmiːzəlz/","extraExplanation":["“meazle”通常被认为是拼写错误；标准拼写是 **measles**（麻疹）。偶尔也能见到单数形式 **measle**，但现代英语里几乎不用。","文化与公共卫生语境中，麻疹常与 **MMR vaccine**（麻疹-腮腺炎-风疹联合疫苗）一起被提到；新闻里常见表达有 “measles outbreak（麻疹暴发）”“measles case（麻疹病例）”。"]}
