{"word":"mecamylamine","summary":{"en":"Mecamylamine is a prescription drug that blocks nicotinic acetylcholine receptors, historically used for hypertension and sometimes studied for nicotine dependence.","zh":"mecamylamine（美卡胺）是一种处方药，可阻断烟碱型乙酰胆碱受体；历史上用于高血压治疗，也曾用于（或被研究用于）减轻尼古丁依赖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prescription medicine that blocks nicotine-type (nicotinic) acetylcholine receptors; it has been used to treat high blood pressure and, in some cases, to help reduce nicotine dependence","zh":"一种处方药，通过阻断“烟碱型乙酰胆碱受体”发挥作用；曾用于治疗高血压，并在部分情况下用于减轻尼古丁依赖"},"examples":[{"en":"Mecamylamine was originally used as an antihypertensive drug.","zh":"美卡胺最初被用作一种降压药。"},{"en":"Because mecamylamine can block nicotinic receptors, it may reduce some effects of nicotine.","zh":"由于美卡胺能阻断烟碱型受体，它可能减弱尼古丁的一些作用。"}]}],"synonyms":["Inversine","mecamylamine hydrochloride"],"phonetic":"/mɛˈkæmɪˌleɪmiːn/","extraExplanation":["美卡胺（mecamylamine）属于“神经节阻断剂”（ganglionic blocker），会抑制自主神经系统的部分信号传递，因此可能出现口干、便秘、头晕（体位性低血压）等副作用。","在临床上它如今较少作为一线降压药使用；如果用于研究或特殊适应证，应严格遵医嘱，并告知医生正在使用的其他药物与基础疾病。","常见商品名之一为 Inversine（部分地区/时期使用）。"]}
{"word":"mecaptera","summary":{"en":"Mecaptera is an insect order that includes scorpionflies and related insects.","zh":"Mecaptera 指昆虫分类中的长翅目，包含蝎蛉等相关类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of insects that includes scorpionflies and their relatives, usually with two pairs of clear wings and an elongated head; some species have a curled tip on the male abdomen that looks like a scorpion’s tail (but they are harmless).","zh":"昆虫纲中的一个“长翅目”（Mecaptera）：包括蝎蛉等类群，通常有两对透明翅和细长的头部；部分雄虫腹部末端会卷曲，看起来像蝎子尾巴，但一般无毒、对人无害。"},"examples":[{"en":"Scorpionflies belong to the order Mecaptera.","zh":"蝎蛉属于长翅目（Mecaptera）。"},{"en":"In our biology lab, we compared Mecaptera with flies to see differences in wing structure.","zh":"在生物实验课上，我们把长翅目（Mecaptera）和双翅目昆虫作比较，观察翅的结构差异。"}]}],"synonyms":["the order Mecaptera","scorpionfly order (informal)"],"phonetic":"/mɛˈkæptərə/","extraExplanation":["词源：来自希腊语 *mēkos*（“长”）+ *pteron*（“翅”），字面意思是“长翅”，反映了这类昆虫常见的翅形特征。","使用场景：这是生物分类学（昆虫学）术语，多见于教材、科普文章或学术语境；日常英语里更常听到具体成员名，如 *scorpionfly*（蝎蛉）。"]}
{"word":"mecate","summary":{"en":"Mecate means a rope/lariat used in ranching (and, less commonly, a regional Mexican unit of measure).","zh":"mecate指牧场常用的绳索/套索（较少见时也可指墨西哥地区性的计量单位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rope or lariat (especially in Mexico or the U.S. Southwest), often used for ranch work","zh":"（尤指墨西哥或美国西南地区的）绳索；套索（常用于牧场工作）"},"examples":[{"en":"He tied the horse to a post with a mecate.","zh":"他用一根mecate把马拴在柱子上。"},{"en":"The cowboy coiled the mecate and hung it on the saddle.","zh":"牛仔把mecate盘好，挂在马鞍上。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional, less common) a traditional Mexican unit of measure for length or for an area of land","zh":"（地区用法，较少见）墨西哥传统计量单位：可指长度，也可指一块土地的面积单位"},"examples":[{"en":"The land was described as several mecates in older records.","zh":"旧档案里把这块地描述为若干个mecate。"}]}],"synonyms":["rope","lasso","lariat","line"],"phonetic":"/meɪˈkɑːteɪ/","extraExplanation":["“mecate”是西班牙语借词，在英语中多见于美国西南部与牧场语境。","词源上常被认为与纳瓦特尔语（Nahuatl）有关，体现了墨西哥本土语言与西班牙语接触后的影响。","在现代日常英语里并不常用；更通用的词是“rope / lasso”。"]}
{"word":"mecati","summary":{"en":"“mecati” isn’t a recognized English vocabulary word; it’s likely a misspelling, a name, or a word from another language.","zh":"“mecati”不是常见英语词汇；更可能是拼写错误、人名，或其他语言的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语词。可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “mecati” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“mecati”——你能把它出现的句子发我吗？"},{"en":"Did you mean “macchiato” (a coffee drink) or “mercati” (Italian for “markets”)?","zh":"你是不是想写“macchiato”（一种咖啡）或“mercati”（意大利语“市场”的复数）？"}]}],"phonetic":"/meɪˈkɑːti/","extraExplanation":["“mecati”更像是外语词或拼写误差：\n- 可能是意大利语相关：接近“mercati”（市场，复数）但少了字母 r。\n- 也可能接近“macchiato”（/ˌmɑːkiˈɑːtoʊ/，常见咖啡饮品）但拼写差距较大。\n- 如果它是人名/用户名/品牌名，通常不会出现在英语词典里。\n把你看到它的原句、领域（咖啡/地名/游戏/社交媒体等）发来，我可以更准确判断。"]}
{"word":"Mecca","summary":{"en":"Mecca is the holiest city in Islam, and figuratively it can mean a place that strongly attracts people with a shared interest.","zh":"Mecca指伊斯兰教最神圣的城市“麦加”；也可作比喻，指某类人向往并聚集的“中心/圣地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the holiest city in Islam, in western Saudi Arabia; Muslims who are able are expected to travel there for the Hajj pilgrimage","zh":"麦加（伊斯兰教最神圣的城市，位于沙特阿拉伯西部；有条件的穆斯林应前往朝觐）"},"examples":[{"en":"Millions of Muslims travel to Mecca for the Hajj each year.","zh":"每年有数以百万计的穆斯林前往麦加朝觐。"},{"en":"He studied the history of Mecca and early Islam.","zh":"他研究了麦加与伊斯兰早期历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a place that attracts many people who share a particular interest; a center of activity","zh":"（比喻）某类人向往并聚集之地；活动中心"},"examples":[{"en":"Silicon Valley became a mecca for tech startups.","zh":"硅谷成了科技初创公司的“圣地”。"},{"en":"The small town is a mecca for jazz lovers in summer.","zh":"夏天这座小镇是爵士乐迷的“朝圣地”。"}]}],"synonyms":["(figurative) hub","(figurative) center","(figurative) hotspot","(figurative) magnet"],"phonetic":"/ˈmɛkə/","extraExplanation":["“Mecca”在英文里既可指伊斯兰圣城“麦加”，也常被借用作比喻，表示“某领域爱好者向往的中心/圣地”。在正式或跨文化语境中，使用比喻义时建议注意语气与场合，避免让人感觉在轻率地借用宗教圣地的意义。","与宗教相关的语境里，常见搭配：the Hajj（朝觐）、pilgrimage（朝圣）、holy city（圣城）。"]}
{"word":"mecca","summary":{"en":"Mecca is the holiest city in Islam, and in general English it can also mean a place that strongly attracts people with a shared interest.","zh":"Mecca 指伊斯兰教最神圣的城市“麦加”；在一般英语中也可比喻为某类人向往聚集的“圣地／中心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam) The holiest city in Islam, in western Saudi Arabia; Muslims face it when they pray, and many travel there for the Hajj pilgrimage.","zh":"（伊斯兰教）麦加：位于沙特阿拉伯西部的伊斯兰教最神圣城市；穆斯林礼拜时面向它，许多人前往参加朝觐（Hajj）。"},"examples":[{"en":"Millions of Muslims travel to Mecca for Hajj each year.","zh":"每年有数百万穆斯林前往麦加参加朝觐。"},{"en":"During prayer, Muslims around the world face Mecca.","zh":"礼拜时，世界各地的穆斯林都会面向麦加。"}]},{"partOfSpeech":"n.","definition":{"en":"A place that attracts many people who share a particular interest; a center or “hub.”","zh":"（比喻）圣地／中心：吸引许多同好聚集的地方；某种活动的中心或“枢纽”。"},"examples":[{"en":"Silicon Valley became a mecca for tech startups.","zh":"硅谷成了科技创业公司的“圣地”。"},{"en":"The small town is a mecca for jazz lovers every summer.","zh":"每到夏天，这个小镇就成了爵士乐迷的朝圣地。"}]}],"synonyms":["(figurative) hub","(figurative) center","(figurative) hotspot","(figurative) magnet"],"phonetic":"/ˈmɛkə/","extraExplanation":["在英语里把某地称为“a mecca for …”是常见的比喻用法，意思是“某类人向往并聚集的地方”。写作时建议小心语气：因为Mecca（麦加）对穆斯林非常神圣，随意或贬义的比喻可能被认为不尊重。","常见拼写区分：Mecca（首字母大写）通常指城市；mecca（小写）多用于比喻义。"]}
{"word":"meccan","summary":{"en":"Meccan means “of or from Mecca (Makkah).”","zh":"Meccan 意为“麦加的；来自麦加的；与麦加有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mecca (Makkah), a holy city in Saudi Arabia, or to its people and culture.","zh":"与麦加（Makkah，沙特阿拉伯的圣城）有关的；麦加的；麦加人的。"},"examples":[{"en":"Many Muslims hope to make a Meccan pilgrimage at least once in their lifetime.","zh":"许多穆斯林希望一生中至少去麦加朝觐一次。"},{"en":"The museum displayed Meccan manuscripts and photographs from the early 1900s.","zh":"博物馆展出了麦加的手稿以及20世纪初的照片。"}]}],"synonyms":["of Mecca","Makkah-related"],"phonetic":"/ˈmɛkən/","extraExplanation":["“Meccan”常与“Medinan（麦地那的）”对比使用：伊斯兰传统中，《古兰经》的一些章节会按启示地点被称为“Meccan surahs（麦加篇章）”或“Medinan surahs（麦地那篇章）”，两者在主题与语气上常被认为有所不同。"]}
{"word":"meccano","summary":{"en":"Meccano is a well-known construction toy system using metal parts and nuts and bolts to build models.","zh":"Meccano（麦卡诺）是一种著名的金属拼装玩具系统，用螺母螺栓等零件搭建模型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of metal construction toy (and sometimes any similar set) with perforated strips, plates, wheels, and nuts and bolts used to build models","zh":"（品牌名）麦卡诺：一种金属拼装玩具（有时也泛指类似套装），用带孔金属条/板、轮子以及螺母螺栓来搭建模型"},"examples":[{"en":"My grandfather built cranes and bridges from Meccano when he was a kid.","zh":"我爷爷小时候用麦卡诺拼过起重机和桥。"},{"en":"This museum has a working Meccano model of a steam engine.","zh":"这家博物馆有一个能运转的麦卡诺蒸汽机模型。"}]}],"synonyms":["construction set","model-building kit","Erector Set (similar)"],"phonetic":"/məˈkænoʊ/","extraExplanation":["Meccano 起源于英国，通常认为由 Frank Hornby 于 20 世纪初推广；它在英式英语里很有怀旧意味，常让人联想到“动手做/工程启蒙”的童年玩具。","在美国更常见的相近产品（或类比参照）是 Erector Set；两者都强调用金属零件和螺丝螺母进行结构拼装。"]}
{"word":"meccas","summary":{"en":"“Meccas” most often means famous places that attract many visitors for a special interest; it can also be the plural of the holy city Mecca in religious/historical writing.","zh":"“meccas”多指（比喻）吸引大量人前往的某领域“圣地/朝圣地”；也可作宗教/历史语境下“Mecca（麦加）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mecca”: a place that many people visit because it is famous or important for a particular activity, interest, or group.","zh":"“mecca”的复数：因对某种活动、兴趣或群体特别有名或重要，而吸引大量人前往的地方（“圣地/朝圣地”之意，常为比喻用法）。"},"examples":[{"en":"For film lovers, Sundance can be one of the meccas of independent cinema.","zh":"对影迷来说，圣丹斯可以算是独立电影的“圣地”之一。"},{"en":"The city has become one of the meccas for street food.","zh":"这座城市已成为街头美食爱好者的“朝圣地”之一。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “Mecca”: the holy city in Saudi Arabia, central to Islam (used in religious or historical contexts).","zh":"“Mecca（麦加）”的复数：沙特阿拉伯的伊斯兰教圣城（多用于宗教或历史语境；一般不常用复数）。"},"examples":[{"en":"In history texts, you may see references to Meccas and other major religious centers.","zh":"在历史教材中，你可能会看到对“麦加”等重要宗教中心的提及。"}]}],"synonyms":["centers","hubs","hotspots","capitals","pilgrimage sites"],"phonetic":"/ˈmɛkə/","extraExplanation":["“mecca”这个比喻用法来源于伊斯兰教圣城Mecca（麦加），因为穆斯林有朝觐传统，所以英语里把“很多人向往并前往的地方”称为a mecca。","书写上：指圣城时常大写Mecca；比喻用法通常小写mecca。注意在正式场合谈到宗教时用词要尊重、避免把宗教圣地随意戏谑化。"]}
{"word":"meccawee","summary":{"en":"“Meccawee” is not a common English word; it’s likely a name/username or a misspelling of a similar word (often “Mecca”).","zh":"“meccawee” 不是常见英语词；更可能是人名/网名，或是与其他词（常见为 “Mecca”）相近的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a proper name (e.g., a username or surname) or a misspelling/variant of another word.","zh":"不是常见英语词典里的标准词；更可能是专有名词（如用户名、姓氏）或其他词的拼写变体/误拼。"},"examples":[{"en":"My online handle is Meccawee.","zh":"我的网名是 Meccawee。"},{"en":"Did you mean “Mecca” (a place that attracts many visitors) instead of “meccawee”?","zh":"你是不是想写 “Mecca”（指吸引大量人前往的地方/圣地），而不是 “meccawee”？"}]}],"phonetic":"ˈmɛkəwiː","extraExplanation":["从拼写上看，meccawee 可能与 “Mecca”（麦加；引申义：某领域的“圣地/中心”）相近，也可能只是人名/网名的自造词。若你告诉我它出现的句子或来源（游戏、歌曲、社交媒体等），我可以更准确判断含义与更自然的读法/用法。"]}
{"word":"Mech","summary":{"en":"“Mech” most commonly means a sci‑fi battle robot (a mech). It can also mean a mechanic, or be short for “mechanical.”","zh":"“Mech”最常见指科幻/游戏中的“机甲”。也可指“机械师”，或作“mechanical（机械的）”的简写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A large, usually human-piloted robot or armored walking machine, common in science fiction and video games.","zh":"（非正式）机甲；（科幻/游戏中）通常由人驾驶的大型机器人或装甲步行机器。"},"examples":[{"en":"The game lets you customize your mech with new weapons.","zh":"这款游戏让你用新武器自定义你的机甲。"},{"en":"In the movie, the soldiers fight inside giant mechs.","zh":"电影里，士兵们在巨型机甲里作战。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A mechanic; someone who repairs machines or vehicles.","zh":"（非正式）机械师；修理机器或车辆的人。"},"examples":[{"en":"Ask the mech to check the brakes before the trip.","zh":"出发前让机械师检查一下刹车。"},{"en":"The local mech fixed my motorcycle in an hour.","zh":"本地的机械师一小时就修好了我的摩托车。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Short for “mechanical,” describing machines or machine-based systems.","zh":"（非正式）“mechanical”的缩写，表示“机械的/机电的”。"},"examples":[{"en":"It’s a mech issue, not a software problem.","zh":"这是机械问题，不是软件问题。"},{"en":"We studied mech engineering basics in class.","zh":"我们课上学了机械工程基础。"}]}],"synonyms":["mecha","robot (for the sci‑fi sense)","mechanic (for the job sense)","mechanical (as the full form)"],"phonetic":"/mɛk/","extraExplanation":["“mech=机甲”的用法在英语里很受日本“メカ（mecha）”文化与动漫/游戏影响（如《机动战士高达》、各类机甲射击游戏）。在这些语境中，mech通常指“可驾驶的战斗机甲”。","“mech=mechanic/机械师”更常见于口语、省略说法，正式场合一般说 mechanic。","“mech=mechanical”多见于工程或玩家/论坛的简写（如 mech engineering）。正式写作中建议用完整形式 mechanical。"]}
{"word":"mech","summary":{"en":"“Mech” most commonly means a sci‑fi combat robot/vehicle; it can also be an informal short form of mechanical/mechanic.","zh":"“mech”最常指科幻作品里的机甲/战斗机器人；也可作为 mechanical/mechanic 的非正式缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A large robot or piloted combat machine, especially in science fiction, anime, or video games.","zh":"（非正式）机甲；大型机器人或有人驾驶的战斗机械，常见于科幻、动漫或电子游戏。"},"examples":[{"en":"In the game, you can customize your mech with new weapons.","zh":"在游戏里，你可以给你的机甲更换并自定义新武器。"},{"en":"The movie’s final battle features two mechs fighting in the city.","zh":"这部电影的最终大战是两台机甲在城市里对战。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) Short for “mechanical” or “mechanic,” used mainly in technical or hobby contexts.","zh":"（非正式）“mechanical（机械的）”或“mechanic（机械师/技工）”的缩写，多见于技术或爱好圈的说法。"},"examples":[{"en":"I’m more interested in the mech side of cars than the design.","zh":"比起外观设计，我更关注汽车的机械部分。"},{"en":"Ask a mech to check the engine noise.","zh":"让一个修车技工检查一下发动机的异响。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, before a noun) Mechanical; relating to machines or machinery.","zh":"（非正式，作定语）机械的；与机器或机械装置有关的。"},"examples":[{"en":"He took a mech engineering course online.","zh":"他在网上上了一门机械工程课程。"}]}],"synonyms":["mecha","robot (context-dependent)","mechanical (abbr.)","mechanic (abbr.)"],"phonetic":"/mɛk/","extraExplanation":["“mech”在英文里常见于科幻与游戏语境，尤其指“机甲/战斗机器人”。这种用法常与日语里的“mecha（メカ）”文化有关（如高达类作品），因此在动漫圈、游戏圈非常普遍。","在工程或职业语境中，“mech”也可能只是口语或行话式缩写（mechanical / mechanic）。正式写作里通常不要用缩写，改用完整词更清晰。"]}
{"word":"mecha","summary":{"en":"a piloted giant robot or robotic suit in sci‑fi, especially Japanese media","zh":"科幻中（尤指日漫）常见的可驾驶巨大机器人/机甲"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large robot or robotic vehicle (often piloted by a person), especially as seen in Japanese anime, manga, games, and sci‑fi stories.","zh":"（尤指日漫/科幻作品中的）巨大机器人或机甲载具，常由人驾驶。"},"examples":[{"en":"My favorite anime features mecha battles in space.","zh":"我最喜欢的那部动画有太空中的机甲战斗。"},{"en":"In the game, you can customize your mecha with new armor and weapons.","zh":"在游戏里，你可以给机甲换装甲和武器。"},{"en":"The pilot climbed into the mecha before the city was attacked.","zh":"城市遭到攻击前，驾驶员爬进了机甲。"}]}],"synonyms":["mech","giant robot","robot suit","powered armor"],"phonetic":"/ˈmɛkə/","extraExplanation":["在英语语境里，mecha 常用来指一种“题材/类型”（genre element）：有驾驶舱、可变形或重装甲的机器人载具。常见代表包括《机动战士高达（Gundam）》等系列。","与 robot 相比，mecha 更强调“可驾驶的机械载具/机甲”，不一定具有人类智能。"],"etymology":"源自日语「メカ (meka)」，为英语“mechanical（机械的）”的外来缩略用法；后来在英语里固定指“（作品中的）机甲/巨大机器人”这一类型元素。","mnemonic":["把 mecha 想成「机械的」mechanical 的前半段：mech-a → 机甲（机械装甲）。","联想中文里常说的「机甲」「机体」，看到 mecha 就想到“有驾驶员的巨大机械”。"]}
{"word":"mechael","summary":{"en":"“Michael” is a very common male first name in English; it can also refer to the Archangel Michael in religious contexts.","zh":"“Michael” 是很常见的英文男性名字；在宗教语境中也可指大天使米迦勒。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common male given name in English (often shortened to “Mike”).","zh":"常见的英文男性名字（常缩写为“Mike”）。"},"examples":[{"en":"Michael is my older brother.","zh":"Michael 是我的哥哥。"},{"en":"You can call me Michael, or just Mike.","zh":"你可以叫我 Michael，或者直接叫我 Mike。"}]},{"partOfSpeech":"other","definition":{"en":"In Judaism, Christianity, and Islam, Michael is an archangel (a powerful angel), often described as a protector.","zh":"在犹太教、基督教和伊斯兰教中，Michael（米迦勒）是“大天使”（强大的天使），常被描述为守护者。"},"examples":[{"en":"In many stories, the Archangel Michael is shown as a защитник (protector).","zh":"在许多故事里，大天使 Michael 常被描绘成守护者。"},{"en":"Some churches have paintings of Saint Michael.","zh":"一些教堂里有圣米迦勒的画像。"}]}],"synonyms":["Mike","Mikey"],"phonetic":"/ˈmaɪkəl/","extraExplanation":["你输入的“mechael”通常是拼写错误；最常见的标准拼写是 **Michael**。","发音上常见读法是“MY-kəl”（第一音节重读），拼写里虽然有“cha”，但发音里不是 /tʃ/（不是“ch”音）。"]}
{"word":"mechan","summary":{"en":"mechan- is a word part meaning “machine/mechanical,” used in words like mechanical, mechanism, and mechanize.","zh":"mechan- 是表示“机器/机械”的构词成分，常见于 mechanical、mechanism、mechanize 等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Combining form) related to machines, mechanics, or mechanical processes; used at the beginning of many technical words.","zh":"（构词成分）与“机器、机械、力学/机械过程”有关；常用于许多技术词汇的词首。"},"examples":[{"en":"mechanical engineering","zh":"机械工程"},{"en":"to mechanize farming","zh":"使农业机械化"},{"en":"the mechanism of a lock","zh":"锁的机械结构/机制"}]}],"synonyms":["machin-"],"phonetic":"/ˈmɛkən/","extraExplanation":["“mechan”单独作为一个英文单词并不常见；更常见的是词根/词首形式 **mechan-**，出现在 *mechanical*（机械的）、*mechanism*（机制/机械装置）、*mechanize*（使机械化）等词里。","如果你本来想查的是 **mechanic**（修理工/技工；机械的），告诉我我可以也按那个词给你完整释义与例句。","词源上与希腊语 *mēkhanē*（机器、装置、巧计）有关，因此既可以指“机械装置”，也常引申到“运作方式/机制”（mechanism）。"]}
{"word":"mechanal","summary":{"en":"“Mechanal” is not a standard word; it is usually a misspelling of “mechanical,” meaning machine-related or routine/automatic.","zh":"“mechanal”不是标准英文词，通常是“mechanical”的拼写错误，意思是“机械的/与机器有关的”或“机械式、例行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) relating to machines, engines, or tools; using mechanical parts to do work.","zh":"（很可能是想写）机械的；与机器、发动机或工具有关的；用机械部件来完成工作的。"},"examples":[{"en":"I need a mechanical pencil for the exam.","zh":"我考试需要一支自动铅笔（机械铅笔）。"},{"en":"The car has a mechanical problem, so it won’t start.","zh":"这辆车有机械故障，所以启动不了。"},{"en":"Mechanical engineering is a popular major.","zh":"机械工程是很热门的专业。"}]},{"partOfSpeech":"adj.","definition":{"en":"done automatically or without real thought or feeling; routine and repetitive.","zh":"机械式的；不经思考或没有感情的；例行、重复的。"},"examples":[{"en":"He gave a mechanical smile and walked away.","zh":"他露出一个机械的笑容就走开了。"},{"en":"After a while, the work became mechanical.","zh":"过了一段时间，工作变得很机械、重复。"}]}],"synonyms":["machine-related","automatic","routine","repetitive"],"phonetic":"/məˈkænɪkəl/","extraExplanation":["“mechanal”不是常见英文单词，最常见的情况是把“mechanical”拼错了。正确拼写：mechanical。","常见搭配：mechanical engineer（机械工程师）、mechanical failure（机械故障）、mechanical pencil（自动铅笔/机械铅笔）。","在写作中，描述“没有感情、照本宣科”的行为时，用mechanical很自然：a mechanical response（机械式反应）。"]}
{"word":"mechanality","summary":{"en":"Mechanality means a mechanical, automatic quality—often stiff or emotionless.","zh":"Mechanality 指“机械式、自动化的特质”，常带“呆板、缺乏情感”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being mechanical; a stiff, automatic, or machine-like way of moving, speaking, or doing something (often suggesting a lack of feeling or creativity)","zh":"机械性；机械式的状态（常暗示动作、语言或做事呆板、自动化，缺乏情感或创造力）"},"examples":[{"en":"There was a mechanality in his smile, as if he had practiced it too many times.","zh":"他的笑容带着一种机械性，仿佛练习过太多次。"},{"en":"The mechanality of the dialogue made the characters feel unreal.","zh":"对话的机械感让人物显得不真实。"},{"en":"She tried to break the mechanality of her routine by taking a different route to work.","zh":"她试着通过换一条上班路线来打破日常的机械性。"}]}],"synonyms":["mechanicality","roboticness","automatism","stiffness"],"phonetic":"/ˌmɛkəˈnælɪti/","extraExplanation":["“mechanality”较少见，更常见的拼写是“mechanicality”。两者意思非常接近：都指“机械式、缺乏自然与情感的感觉”。在写作中若想更自然，通常用“mechanicality”，或用更常用的词如“roboticness”（更口语）/“automatism”（较正式）。","文学或评论中常用来批评表演、写作或行为“像机器一样”，强调缺少人味、灵活性或真实情感。"]}
{"word":"mechanalize","summary":{"en":"Mechanize means to use machines or automation to do work, often increasing efficiency; it can also imply becoming repetitive or less human.","zh":"Mechanize 意为“使机械化/用机器或自动化完成工作”，多指提高效率；有时也含“变得刻板、缺少人情味”的意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to introduce machines or automated systems to do work that was previously done by people or by hand","zh":"使机械化；用机器（或自动化系统）来完成原本由人工或手工完成的工作"},"examples":[{"en":"The factory mechanized its assembly line to produce more cars each day.","zh":"这家工厂将装配线机械化，以便每天生产更多汽车。"},{"en":"Many farms mechanized after World War II.","zh":"二战后，许多农场实现了机械化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a process more efficient by relying on machines or technology (sometimes used critically, implying work becomes repetitive or less human)","zh":"（有时带批评意味）使流程变得机械、重复；用机器或技术让工作更“程序化”"},"examples":[{"en":"Some people worry that education is becoming mechanized and less personal.","zh":"有人担心教育正在变得机械化，缺少人情味。"},{"en":"He felt his job had mechanized his daily routine.","zh":"他觉得工作让自己的日常变得机械、刻板。"}]}],"synonyms":["automate","industrialize","motorize","machine","computerize"],"phonetic":"/ˈmɛkəˌnaɪz/","extraExplanation":["“mechanalize”通常是拼写错误；标准拼写是 **mechanize**（美式常用）或 **mechanise**（英式常用）。","词根来自 **mechan-**（机器）+ **-ize**（使成为……），常见搭配：**mechanize agriculture/production/industry**（农业/生产/工业机械化）。","语气提示：在谈“工厂、农业、生产效率”时多为中性；在谈“生活、教育、人际互动”时可能带“变得不近人情、缺乏创造力”的批评色彩。"]}
{"word":"mechanic","summary":{"en":"“Mechanic” most often means a person who repairs machines (especially cars). It can also mean how a system or game works (often “mechanics”).","zh":"“mechanic”最常指修理机器（尤其汽车）的修理工；也可指系统或游戏的运作方式/机制（常用复数 mechanics）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to repair and maintain machines, especially cars and motorcycles.","zh":"（职业）机械修理工；（尤指）汽车/摩托车修理工。"},"examples":[{"en":"The mechanic fixed my car’s brakes in an hour.","zh":"修理工一小时就修好了我车的刹车。"},{"en":"She’s a skilled mechanic who can diagnose engine problems quickly.","zh":"她是一位技术娴熟的修理工，能很快诊断发动机问题。"}]},{"partOfSpeech":"n.","definition":{"en":"The way something works or the rules and processes of a system, game, or activity (often plural: mechanics).","zh":"（多用复数 mechanics）运作方式；机制；（游戏/活动的）规则与流程。"},"examples":[{"en":"The mechanics of the game are easy to learn but hard to master.","zh":"这个游戏的机制很容易上手，但很难精通。"},{"en":"We need to understand the mechanics of how the program saves data.","zh":"我们需要理解这个程序保存数据的机制。"}]}],"synonyms":["repairman","technician","auto mechanic","mechanisms","workings"],"phonetic":"/məˈkænɪk/","extraExplanation":["“mechanic”来自“machine（机器）”相关词源，核心概念是“与机器/机械运作有关”。日常最常见含义是“修理汽车的人”。","注意区分：mechanic（修理工/机制） vs. mechanics（力学这门学科；或某事的运作机制）。例如：He studies mechanics.（他学力学。）"]}
{"word":"mechanical","summary":{"en":"Mechanical most often means “related to machines,” and it can also mean “routine and emotionless, like a machine.”","zh":"Mechanical 最常指“与机器有关的”，也可指“像机器一样机械、刻板、缺乏情感的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to machines, tools, or physical devices (often involving moving parts).","zh":"与机器、工具或机械装置有关的；机械的（常指有运转部件）。"},"examples":[{"en":"Mechanical engineers design engines, robots, and other machines.","zh":"机械工程师设计发动机、机器人以及其他机器。"},{"en":"The car has a mechanical problem, not an electrical one.","zh":"这辆车是机械故障，不是电气故障。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done in a routine, automatic way, without careful thought or real feeling.","zh":"机械式的；照本宣科的；不经思考或缺乏感情的。"},"examples":[{"en":"She gave a mechanical smile and kept working.","zh":"她机械地笑了笑，就继续工作。"},{"en":"His apology sounded mechanical, as if he didn’t mean it.","zh":"他的道歉听起来很机械，仿佛并不真诚。"}]},{"partOfSpeech":"adj.","definition":{"en":"Based on the principles of physics and motion; not chemical, emotional, or creative in nature.","zh":"基于物理运动原理的；非化学的、非情感的或非创造性的。"},"examples":[{"en":"Breathing is partly mechanical: the lungs expand and contract.","zh":"呼吸在一定程度上是机械过程：肺部扩张和收缩。"}]}],"synonyms":["machine-related","machinelike","automatic","routine","formulaic"],"phonetic":"/məˈkænɪkəl/","extraExplanation":["“mechanical”除了“与机器有关”这个常见意思外，也常用来形容人的行为或表达“像机器一样”：动作重复、缺乏情绪或真诚。例如 mechanical voice（呆板的声音）、mechanical response（机械反应）。","常见搭配：mechanical engineering（机械工程）、mechanical failure/breakdown（机械故障）、mechanical parts（机械部件）、mechanical skills（动手修理/机械技能）。","在文学或叙述中，“mechanical”常用来塑造一种“人被工作或制度异化、变得像机器”的氛围，强调冷漠、重复、缺少人味。"]}
{"word":"mechanical engineer","summary":{"en":"A mechanical engineer is an engineer who works with machines and mechanical systems—designing, testing, and improving them.","zh":"机械工程师是从事机器与机械系统的设计、测试与改进工作的工程师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who designs, builds, tests, and improves machines and mechanical systems (such as engines, robots, heating/cooling systems, and manufacturing equipment)","zh":"机械工程师：设计、制造、测试并改进机器与机械系统的人（如发动机、机器人、暖通空调系统、制造设备等）"},"examples":[{"en":"My cousin is a mechanical engineer who designs parts for electric cars.","zh":"我表哥是一名机械工程师，负责为电动汽车设计零部件。"},{"en":"The mechanical engineer worked with the team to reduce noise and vibration in the new engine.","zh":"机械工程师与团队合作，降低新发动机的噪声和振动。"}]}],"synonyms":["ME","mechanical engineering professional"],"phonetic":"/məˈkænɪkəl ˌɛn.dʒəˈnɪr/","extraExplanation":["“Mechanical engineer”是一个职业称呼，常见于工程领域的职位名称（如R&D mechanical engineer 研发机械工程师、manufacturing mechanical engineer 制造机械工程师）。在日常英语中也常缩写为“ME”（在工程语境里更常见）。","机械工程涉及的核心概念常与“forces（力）”“motion（运动）”“materials（材料）”“thermodynamics（热力学）”相关，因此你会经常在相关描述里看到这些词。"]}
{"word":"mechanical system","summary":{"en":"A group of connected machine parts that work together to transmit force/motion and do a physical job.","zh":"由相互连接的机器部件组成、用于传递力或运动并完成物理功能的系统。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A set of connected parts (such as gears, levers, springs, and bearings) that work together to transmit force or motion and perform a physical function.","zh":"由相互连接的部件（如齿轮、杠杆、弹簧、轴承等）组成的整体，用来传递力或运动并完成某种物理功能。"},"examples":[{"en":"A bicycle’s chain, gears, and pedals form a simple mechanical system.","zh":"自行车的链条、齿轮和脚踏板构成一个简单的机械系统。"},{"en":"Engineers tested the mechanical system to make sure it could handle repeated stress.","zh":"工程师测试该机械系统，以确保它能承受反复的应力。"},{"en":"If one part fails, the whole mechanical system may stop working.","zh":"如果某个部件失效，整个机械系统可能就无法运转。"}]}],"synonyms":["machine system","mechanism","mechanical assembly","mechanical setup"],"phonetic":"/məˈkænɪkəl ˈsɪstəm/","extraExplanation":["在工程语境里，mechanical system 通常强调“以机械结构传递力/运动”的系统，常见于机械设计、动力传动、机器人机构等。与之相比，system 单独使用更宽泛；而 electromechanical system（机电系统）包含电机、传感器、控制电路等电气部分。","学习搭配：design/build/assemble a mechanical system（设计/制造/装配机械系统）；mechanical system failure（机械系统故障）；mechanical system dynamics（机械系统动力学）。"]}
{"word":"mechanical-looking","summary":{"en":"machine-like in appearance; stiff or industrial-looking","zh":"外观像机器；显得僵硬或偏工业机械风"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Appearing like a machine or robot; stiff, rigid, and not natural-looking.","zh":"看起来像机器或机器人；动作/外观僵硬、不自然。"},"examples":[{"en":"His smile was mechanical-looking, as if he had practiced it too much.","zh":"他的笑容看起来很机械，像是练过太多次。"},{"en":"The dancer’s mechanical-looking movements made the audience feel uneasy.","zh":"舞者机械般的动作让观众感到不安。"},{"en":"The room felt cold, with mechanical-looking furniture and harsh lights.","zh":"房间给人冷冰冰的感觉：家具很“机械感”，灯光也很刺眼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a design or surface that resembles industrial parts (metal, gears, sharp edges).","zh":"外观设计像工业零件（如金属、齿轮、硬朗线条）的；带“工业/机甲风”质感的。"},"examples":[{"en":"She chose a mechanical-looking watch with a visible gear design.","zh":"她选了一块机械感很强的表，能看到齿轮设计。"},{"en":"The sculpture is mechanical-looking, made from bolts and scrap metal.","zh":"那座雕塑很有机械感，用螺栓和废金属做成。"}]}],"synonyms":["robotic","machine-like","stiff","rigid","automatonic","industrial-looking"],"phonetic":"/məˈkænɪkəl ˈlʊkɪŋ/","extraExplanation":["-looking 常用来把“外观印象”变成形容词：friendly-looking（看起来友善的）、tired-looking（看起来疲惫的）。mechanical-looking 通常强调“缺乏自然感/人情味”或“工业机械风外观”。"],"etymology":"由 mechanical（“机械的”，源自希腊语 mēkhanē“机器、装置”）+ -looking（“看起来……的”）构成的复合形容词，用来描述“外观/感觉像……”的特征。","mnemonic":["把它拆开记：mechanical（机械的）+ looking（看起来）。=“看起来很机械”。","联想“机甲/机器人”：一眼看上去像机器、动作不自然，就用 mechanical-looking。"]}
{"word":"mechanicalism","summary":{"en":"Mechanicalism is the theory that life or mind can be explained entirely as a machine, by physical parts and forces.","zh":"Mechanicalism 指一种观点：生命或心灵完全可以像机器一样用物质部件与力来解释。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief or theory that living things, the mind, or the universe can be fully explained as a machine (only by physical parts and forces), without purpose, mind, or spirit","zh":"机械论；机械主义：认为生命、心灵或宇宙都可以完全像机器一样用物质部件与力来解释的观点（通常否认目的、心灵或精神因素）"},"examples":[{"en":"In philosophy of mind, mechanicalism argues that thought can be reduced to physical processes.","zh":"在心灵哲学中，机械论认为思维可以还原为物理过程。"},{"en":"Some critics say strict mechanicalism ignores human emotions and moral choices.","zh":"一些批评者认为严格的机械主义忽视了人的情感与道德选择。"},{"en":"The debate between vitalism and mechanicalism shaped early modern biology.","zh":"活力论与机械论之间的争论影响了近代早期的生物学。"}]}],"synonyms":["mechanicism","mechanism (philosophical sense)","reductionism (related)"],"phonetic":"/məˈkænɪkəˌlɪzəm/","extraExplanation":["“mechanicalism”在现代英语中比较少见，更常见的相关词是“mechanism”（机制/机械论）和“mechanicism”（机械论）。在学术语境里它通常指一种解释框架：把复杂系统（尤其是生命与心灵）当作可拆解、可计算的机器来理解。","语感提示：在日常英语里说“a mechanical view of life”（对生命的机械化看法）往往比直接用“mechanicalism”更自然。"]}
{"word":"mechanicalist","summary":{"en":"Mechanicalist: a person (or view) that explains things in machine-like, cause-and-effect physical terms.","zh":"Mechanicalist：指机械论者，或指用“像机器一样的因果与物质过程”来解释事物的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who explains nature, life, or the mind mainly in terms of physical parts, forces, and cause-and-effect (a supporter of mechanistic views)","zh":"用“机械论/机械主义”来解释自然、生命或心智的人；机械论者"},"examples":[{"en":"Some early scientists were mechanicalists who believed the universe worked like a giant clock.","zh":"一些早期科学家是机械论者，他们认为宇宙像一个巨大的钟表一样运作。"},{"en":"As a mechanicalist, he tried to explain emotion as a chain of chemical reactions.","zh":"作为机械论者，他试图把情感解释为一连串的化学反应。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the view that complex systems can be fully explained as machine-like processes (mechanistic)","zh":"与机械论观点有关的；（认为复杂系统可用“像机器一样的过程”完全解释的）机械论的"},"examples":[{"en":"The article takes a mechanicalist approach to human behavior.","zh":"这篇文章用机械论的方法来解释人类行为。"},{"en":"Critics argue that a purely mechanicalist explanation ignores meaning and culture.","zh":"批评者认为纯粹的机械论解释忽视了意义与文化。"}]}],"synonyms":["mechanist","mechanistic","reductionist"],"phonetic":"/məˈkænɪkəlɪst/","extraExplanation":["“mechanicalist”常用于哲学与科学史语境，接近“mechanistic（机械论的）/mechanist（机械论者）”。它强调用可测量的物质结构与因果规律解释世界，类似把自然看作“机器”。在讨论心灵哲学、生命科学时，有时会与“reductionism（还原论）”一起出现。"]}
{"word":"mechanicality","summary":{"en":"Mechanicality means the quality of being machine-like—either efficient and rule-based, or (more often) stiff and unnatural in style or behavior.","zh":"Mechanicality 指“像机器一样”的特质：既可指按规则高效运作的机械性，也常指表达或行为生硬、不自然的程式化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being mechanical; operation that follows fixed rules or a machine-like process","zh":"机械性；机械运作的特征；按固定规则或像机器一样运行的状态"},"examples":[{"en":"The mechanicality of the process makes the results consistent.","zh":"这个流程的机械性让结果保持一致。"},{"en":"Modern factories rely on mechanicality to reduce human error.","zh":"现代工厂依靠机械化/机械性来减少人为错误。"}]},{"partOfSpeech":"n.","definition":{"en":"a stiff, unnatural, or overly automatic manner (often used to criticize speech, writing, acting, or behavior)","zh":"生硬呆板；不自然的程式化（常用于批评说话、写作、表演或行为）"},"examples":[{"en":"There was a mechanicality in his smile, as if he had practiced it.","zh":"他的微笑带着一种机械式的生硬，仿佛练习过一样。"},{"en":"The actor worked to remove the mechanicality from her movements.","zh":"这位演员努力去掉动作里的机械感/程式化。"},{"en":"Readers may feel mechanicality in writing that follows a template too closely.","zh":"如果写作太照模板来，读者可能会感到机械感。"}]}],"synonyms":["mechanicalness","automatism","rigidity","stiffness","roboticness"],"phonetic":"/məˌkænɪˈkæləti/","extraExplanation":["“mechanicality”在批评语境里很常见，尤其谈表演、演讲、客服话术或流水线式写作时，意思接近“像机器一样、缺少自然情感”。","词形上来自“mechanical（机械的）+ -ity（……的性质）”。在正式写作中可用，但日常口语里更常说“mechanical / robotic / stiffness”。"]}
{"word":"mechanicalization","summary":{"en":"Mechanicalization means making work or systems operate with machines, or making something feel more machine-like and rigid.","zh":"Mechanicalization 指用机器取代人工实现机械化，也可指让事物变得更像机器般自动或僵化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of introducing machines or mechanical methods into work that was previously done by hand; mechanization","zh":"把原本靠人工完成的工作改为用机器或机械方式完成的过程；机械化"},"examples":[{"en":"The mechanicalization of farming increased production but reduced the need for manual labor.","zh":"农业的机械化提高了产量，但减少了对体力劳动的需求。"},{"en":"Rapid mechanicalization changed the way the factory operated.","zh":"快速的机械化改变了工厂的运作方式。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making something more machine-like, automatic, or rigid in style or behavior","zh":"使某事物更像机器那样自动化或僵化（在风格、行为或流程上）的做法"},"examples":[{"en":"Some critics worry about the mechanicalization of education, where testing replaces real learning.","zh":"一些批评者担心教育的“机械化”，即考试取代了真正的学习。"},{"en":"He resisted the mechanicalization of his daily routine and tried to keep it flexible.","zh":"他抗拒让日常作息变得“机械化”，努力保持弹性。"}]}],"synonyms":["mechanization","automation","industrialization","systematization"],"phonetic":"/məˌkænɪkəlaɪˈzeɪʃən/","extraExplanation":["“mechanicalization”在现代英语中不如“mechanization”常见，尤其在经济、工业与农业语境里，母语者更常用“mechanization”。“mechanicalization”有时会被用来强调“变得像机器一样（更僵硬/更自动）”的感觉。","常见搭配：mechanicalization of farming/industry/work/production；在更抽象的语境也可说 mechanicalization of life/education/behavior（强调“生活/教育/行为变得机械、程式化”）。"]}
{"word":"mechanicalize","summary":{"en":"“Mechanicalize” means to make something run using machines—often by automating a process or adding machinery.","zh":"“Mechanicalize”指让某事通过机器运作，常指把流程自动化或为其配备机械设备。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a process or system operate by machines; to automate","zh":"使某个过程或系统由机器运转；使自动化"},"examples":[{"en":"The factory mechanicalized the assembly line to produce cars faster.","zh":"这家工厂将装配线机械化，以更快地生产汽车。"},{"en":"Many farms mechanicalized planting and harvesting over the last century.","zh":"在过去一个世纪里，许多农场把播种和收割机械化了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to equip something with machinery or mechanical devices","zh":"为……配备机械或机械装置"},"examples":[{"en":"They mechanicalized the workshop by adding power tools and a small conveyor belt.","zh":"他们通过添置电动工具和一条小型传送带，把车间机械化了。"},{"en":"The company is mechanicalizing its warehouses with robots and sorting machines.","zh":"这家公司正在用机器人和分拣设备使仓库机械化。"}]}],"synonyms":["mechanize","automate","industrialize","computerize"],"phonetic":"/məˈkænɪkəˌlaɪz/","extraExplanation":["“mechanicalize”由“mechanical（机械的）+ -ize（使成为）”构成，常用于描述工业、农业或物流等领域用机器替代人工的趋势。","它的语气通常偏中性或技术性；如果强调“人情味减少、变得死板”，英语更常用“mechanize”或形容词“mechanical”来表达批评意味。"]}
{"word":"mechanically","summary":{"en":"“Mechanically” means either “by/with machines” or “in an automatic, unthinking way.”","zh":"“mechanically”既可指“用机械/与机器有关地”，也可指“机械地、自动地、不怎么动脑或带感情地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to machines or machinery; using mechanical parts or power rather than by hand.","zh":"以机械方式；与机器/机械装置有关；用机械动力或机械部件而不是手工完成。"},"examples":[{"en":"The car window is raised mechanically, not by hand.","zh":"车窗是用机械装置升起的，不是手动的。"},{"en":"The toy’s arms move mechanically when you press the button.","zh":"你按下按钮时，玩具的手臂会以机械方式 움직/运作。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a routine, automatic way, without thinking or feeling much; like a machine.","zh":"机械地；例行公事地；不怎么动脑或投入感情地（像机器一样）。"},"examples":[{"en":"He nodded mechanically, barely listening.","zh":"他机械地点了点头，几乎没在听。"},{"en":"She mechanically repeated the same apology.","zh":"她机械地重复着同一句道歉。"},{"en":"After hours of work, I was answering emails mechanically.","zh":"工作了好几个小时后，我回复邮件都变得机械化了。"}]}],"synonyms":["automatically","routinely","robotically","by machine"],"phonetic":"/məˈkænɪkli/","extraExplanation":["“mechanically”常带两种语气：中性（与机器有关/用机械方式）和略带负面（机械地、缺乏思考与情感）。写作里用来表现人物疲惫、麻木或情绪抽离：例如文学中常见的“smiled/nodded mechanically（机械地笑/点头）”。","搭配提示：mechanically inclined（有机械天赋、擅长修理/装配）；mechanically speaking（从机械角度来说，较口语）；mechanically separate/connected（机械连接/分离，偏技术语境）。"]}
{"word":"mechanicalness","summary":{"en":"Mechanicalness means the quality of being mechanical—automatic, fixed, and often lacking warmth or creativity.","zh":"Mechanicalness 指“机械性”：做事像机器一样自动、刻板，常带有缺乏温度或创造力的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being mechanical—done like a machine, in a fixed or automatic way, often without feeling or creativity","zh":"机械性；像机器一样的特质——按固定、自动的方式进行，常暗示缺乏情感或创造力"},"examples":[{"en":"People complained about the mechanicalness of his smile—it didn’t feel genuine.","zh":"人们抱怨他笑得很机械，感觉不真诚。"},{"en":"The mechanicalness of the training made students bored.","zh":"训练方式太机械，让学生感到无聊。"}]},{"partOfSpeech":"n.","definition":{"en":"the degree to which something depends on machines or mechanical parts (less common)","zh":"机械化程度；对机器或机械部件的依赖程度（较少见）"},"examples":[{"en":"The report discussed the mechanicalness of the production process.","zh":"报告讨论了生产流程的机械化程度。"}]}],"synonyms":["roboticness","automatism","woodenness","rigidity","mechanical quality"],"phonetic":"/məˈkænɪkəlnəs/","extraExplanation":["“mechanicalness”在现代英语中不算常用，更常见的表达是“mechanical quality”“mechanical nature”或“mechanical feel”。如果强调“缺乏情感/像背台词”，也常用“roboticness”“woodenness”“lack of spontaneity”。"]}
{"word":"mechanicals","summary":{"en":"working-class artisans; especially Shakespeare’s comic group of amateur worker-actors","zh":"工匠/技工等劳动者；尤指莎士比亚笔下那群滑稽的工匠业余演员"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) People who do manual or technical work; artisans, craftsmen, or workers in the “mechanical arts.”","zh":"（复数名词）做体力或技术性工作的工匠、手艺人、技术工人（常指“机械/工艺类行业”的从业者）。"},"examples":[{"en":"In older writing, “mechanicals” often meant ordinary working people like carpenters and weavers.","zh":"在较早的英文里，mechanicals 常指木匠、织工这类普通劳动者。"},{"en":"The town’s mechanicals built the stage sets and repaired tools.","zh":"镇上的工匠们搭建舞台布景并修理工具。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun, literary/theater) A group of comic working-class characters, especially the amateur actors in Shakespeare’s *A Midsummer Night’s Dream* (often called “the rude mechanicals”).","zh":"（复数名词，文学/戏剧）指一群带喜剧色彩的下层劳动者角色，尤指莎士比亚《仲夏夜之梦》中那群业余演员（常被称为 “the rude mechanicals”，意为“粗鄙的手艺人/工匠”）。"},"examples":[{"en":"The director cast the mechanicals as warm, clumsy, and lovable amateurs.","zh":"导演把那群“mechanicals”塑造成笨拙却可爱、很有人情味的业余演员。"},{"en":"In *A Midsummer Night’s Dream*, the mechanicals rehearse a play for the duke’s wedding.","zh":"在《仲夏夜之梦》中，那群工匠们为公爵婚礼排练一出戏。"}]}],"synonyms":["artisans","craftsmen","workers","tradespeople","handicraftsmen","mechanics"],"phonetic":"/məˈkænɪkəlz/","extraExplanation":["在莎士比亚时代，社会阶层观念更明显，“the rude mechanicals”里的 rude 更接近“粗俗、没受过训练（也带点滑稽）”，并不一定等于“坏”。现代演出里常把他们演成朴实、好心但笨拙的普通人。"],"etymology":"来自“mechanical（机械的/技工的）”，其词根可追溯到希腊语 mēkhanē（机器、巧计、装置）。早期英语里 mechanical 也可指“从事工艺/技艺的人”，因此出现名词复数 mechanicals 指“工匠/技工阶层”。","mnemonic":["把 mechanicals 记成“mechanic（修车/技工）+ -als（一群人）”：一群技工/工匠。","联想《仲夏夜之梦》：那群“工匠业余剧团”= mechanicals。"]}
{"word":"mechanician","summary":{"en":"A mechanician is a (somewhat formal) word for a skilled person who works with machines, especially repairing or making them.","zh":"mechanician 指从事机械相关工作的技术人员（较正式、略带历史用法），多指维修或制作机器的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who designs, builds, repairs, or operates machines; a skilled worker in mechanics.","zh":"机械师；机修工；从事机械设计、制造、维修或操作机器的技术人员。"},"examples":[{"en":"The mechanician repaired the broken conveyor belt in the factory.","zh":"机械师在工厂里修好了坏掉的传送带。"},{"en":"She trained as a mechanician and now maintains aircraft engines.","zh":"她接受了机械师培训，现在负责维护飞机发动机。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A specialist or expert in mechanical principles (similar to a mechanical engineer).","zh":"（较少用）机械原理方面的专家（近似“机械工程师”之意）。"},"examples":[{"en":"In the 19th century, a mechanician might also invent new tools and devices.","zh":"在19世纪，机械专家也可能发明新的工具和装置。"}]}],"synonyms":["mechanic","machinist","technician","mechanical engineer (context-dependent)"],"phonetic":"/ˌmɛkəˈnɪʃən/","extraExplanation":["“mechanician”在现代英语中不如“mechanic”常见，偏正式或带一点历史色彩；日常说“修车/修机器的人”更常用“mechanic”，“做机械设计与研发”的职业更常用“mechanical engineer”。","词根提示：来自“mechanic/mechanics（机械、力学）”，后缀“-ian”常表示“从事某职业的人”（如 musician 音乐家）。"]}
{"word":"mechanicism","summary":{"en":"a philosophy that explains nature as machine-like physical causes","zh":"用“像机器一样的物理因果”解释世界的机械论"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The view (especially in philosophy and science) that the world and living things can be fully explained as a machine—by physical parts, forces, and fixed laws, without needing purpose or mind.","zh":"（尤用于哲学与科学）机械论：认为世界与生命可完全像机器一样用物质部件、力与固定规律来解释，不需要诉诸目的、心灵或意志。"},"examples":[{"en":"In the 17th century, mechanicism became influential as scientists described nature in terms of matter and motion.","zh":"在17世纪，随着科学家用“物质与运动”来描述自然，机械论变得很有影响力。"},{"en":"Critics argue that strict mechanicism cannot fully explain consciousness and subjective experience.","zh":"批评者认为，严格的机械论无法充分解释意识与主观体验。"},{"en":"The essay contrasts mechanicism with more holistic approaches to biology.","zh":"这篇文章把机械论与更整体性的生物学方法作对比。"}]}],"synonyms":["mechanical philosophy","reductionism","physicalism","determinism"],"phonetic":"/məˈkænɪˌsɪzəm/","extraExplanation":["常见相关词：mechanism（机制/机械装置）是“怎么运作”；mechanicism（机械论）是“用机械来解释一切的观点/哲学立场”。","在学术写作里，mechanicism 往往带有“过度简化为物理因果”的批评语气；但在科学史语境中也可作中性描述。"],"etymology":"源自 mechan-（“机器、机械”）+ -ism（“主义、学说”）。在近代科学革命与笛卡尔、牛顿等人的影响下，“用机械规律解释自然”的观念逐渐固定为这一术语。","mnemonic":["把它拆开记：mechanic（机械的）+ -ism（主义）→“像机器一样解释世界的主义”。","联想中文：机械（jīxiè）+ 论（lùn）→ 机械论（mechanicism）。"]}
{"word":"mechanico","summary":{"en":"“Mechanico” is a rare, nonstandard English form, usually meaning “mechanic,” and sometimes used humorously to mean “mechanical.”","zh":"“mechanico”在英语中较少见且不太标准，通常指“修理工（mechanic）”，有时也幽默地表示“机械的（mechanical）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) A mechanic; someone who repairs machines, especially cars. Often used playfully or as a borrowing influenced by Spanish/Italian forms.","zh":"（非标准/少见用法）机械修理工；尤其指修车技师。常带有玩笑语气，或受西班牙语/意大利语形式影响的借用写法。"},"examples":[{"en":"I’m not a real mechanico—just someone who can change a tire.","zh":"我不是什么真正的“mechanico”，只是会换轮胎而已。"},{"en":"Ask the mechanico to check the brakes before the trip.","zh":"出发前让修车师傅检查一下刹车。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Mechanical in style or related to machinery; used humorously or in creative writing.","zh":"（非常少见）带有“机械感”的；与机器有关的（多用于幽默或创意写作）。"},"examples":[{"en":"The dance had a mechanico rhythm, like gears turning.","zh":"那段舞蹈有一种机械般的节奏，像齿轮在转动。"}]}],"synonyms":["mechanic","auto mechanic","technician","mechanical"],"phonetic":"/məˈkænɪkoʊ/","extraExplanation":["“mechanico”不是常见的标准英语拼写。日常英语里更常用的是 mechanic（名词：修理工）和 mechanical（形容词：机械的）。","如果你是在西语或意语语境（如招牌、昵称、网络ID）里看到“mechanico”，它可能是在模仿 mecánico（西语）或 meccanico（意语）的感觉。正式写作建议改用 mechanic / mechanical。"]}
{"word":"mechanicochemical","summary":{"en":"Mechanochemical means “involving chemical change caused by mechanical force.”","zh":"mechanochemical 指“由机械力引发或参与的化学变化/反应”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to chemical changes or reactions that are caused by mechanical force (such as grinding, milling, rubbing, pressure, or stretching).","zh":"与“机械力引发的化学变化或反应”有关的；由研磨、球磨、摩擦、挤压或拉伸等机械作用触发的化学（反应）。"},"examples":[{"en":"Mechanochemical reactions can occur during ball milling without adding any solvent.","zh":"在球磨过程中，即使不加入任何溶剂，也可能发生机械化学反应。"},{"en":"The team used a mechanochemical method to make the material faster and with less waste.","zh":"团队采用机械化学方法制备该材料，更快且废物更少。"},{"en":"Grinding the solids together produced a mechanochemical transformation.","zh":"将固体一起研磨会产生机械化学转化。"}]}],"synonyms":["mechano-chemical","mechanically induced (chemical)","tribochemical (related, narrower)"],"phonetic":"/məˌkænoʊˈkɛmɪkəl/","extraExplanation":["“mechanochemical”=“mechano-（机械的）+ chemical（化学的）”。常见于材料科学、固体化学与绿色化学语境，强调用机械能（而非主要依赖加热或溶剂）来驱动反应。","相关名词：mechanochemistry（机械化学，研究机械力与化学反应/结构变化之间关系的学科）。在科研写作中常见搭配：mechanochemical synthesis（机械化学合成）、mechanochemical reaction（机械化学反应）、mechanochemical activation（机械化学活化）。"]}
{"word":"mechanicocorpuscular","summary":{"en":"Mechanicocorpuscular means explaining nature by mechanical laws acting on tiny particles.","zh":"mechanicocorpuscular 指用机械规律作用于微粒来解释自然现象的观点（多见于科学史/哲学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a theory that explains natural phenomena through mechanical laws (like motion and impact) acting on tiny particles (corpuscles).","zh":"（多用于哲学或科学史）指用“机械规律（如运动、碰撞）+微小粒子（微粒/原子）”来解释自然现象的理论或观点。"},"examples":[{"en":"In the 17th century, many thinkers defended a mechanico-corpuscular view of matter.","zh":"在17世纪，许多思想家主张一种机械—微粒的物质观。"},{"en":"The book contrasts Aristotelian qualities with mechanico-corpuscular explanations based on particles and motion.","zh":"这本书把亚里士多德式的“性质”解释与基于粒子和运动的机械—微粒解释进行了对比。"}]}],"synonyms":["mechanistic","corpuscular","particle-based","atomistic"],"phonetic":"/məˌkænɪkoʊ kɔrˈpʌskjələr/","extraExplanation":["这个词常见于“mechanico-corpuscular philosophy（机械—微粒哲学）”，多出现在科学革命时期（约17世纪）的语境中，用来描述一种反对“以目的/本质解释自然”的思路：认为颜色、气味、热等现象可以追溯到微粒的形状、大小、排列与运动。","与之相关的人物/传统常被提到的有波义耳（Robert Boyle）等；它也与早期原子论、机械论自然哲学有亲缘关系。现代科学里更常用的说法通常是“mechanistic”或“particle-based / molecular”。"]}
{"word":"mechanicointellectual","summary":{"en":"Mechanico-intellectual means combining practical mechanical work with intellectual or theoretical thinking.","zh":"mechanico-intellectual 指把机械/动手实践与智力/理论思考结合起来的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to both mechanical skill (hands-on, practical work) and intellectual activity (thinking, theory); combining practical engineering with reasoning or scholarship.","zh":"与“机械/动手技能”和“智力/思考活动”都有关的；把实践性的工程技术与理论思考结合起来的。"},"examples":[{"en":"The course is designed to be mechanico-intellectual, mixing workshop training with problem-solving.","zh":"这门课程被设计成“机械—智力并重”，把车间训练与解题思维结合起来。"},{"en":"In the 19th century, some writers praised a mechanico-intellectual education for modern industry.","zh":"在19世纪，一些作者称赞适合现代工业的“机械—智力结合”的教育。"}]}],"synonyms":["practical and theoretical","technical-intellectual","hands-on and analytical"],"phonetic":"/məˌkænɪkoʊˌɪntəˈlɛktʃuəl/","extraExplanation":["这是一个较少见、带“旧式/书面”色彩的复合词，常写作 mechanico-intellectual（带连字符）。mechanico- 来自 mechanical（机械的），-intellectual 来自 intellectual（智力的）。多用于讨论教育、训练或工作性质，强调“动手实践 + 理论思维”两方面。"]}
{"word":"mechanicotherapy","summary":{"en":"A rare/older term for therapy using mechanical methods (massage, manipulation, exercise devices), similar to physical therapy.","zh":"较少见/较旧的术语，指用机械方式（按摩、手法、器械训练）进行治疗，概念接近物理治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of therapy that treats illness or injury by using mechanical means (such as massage, manipulation, or exercise machines), often considered an older/rare term related to physical therapy.","zh":"一种通过机械手段（如按摩、手法矫正或运动器械）来治疗疾病或损伤的疗法；多为较旧或少见用语，概念接近“物理治疗/理疗”。"},"examples":[{"en":"After his knee injury, the clinic offered mechanicotherapy using guided exercise machines.","zh":"膝盖受伤后，诊所提供使用引导式运动器械的mechanicotherapy（机械疗法）。"},{"en":"Early 20th-century texts sometimes describe massage and apparatus-based exercise as mechanicotherapy.","zh":"二十世纪初的一些文献会把按摩和器械辅助的运动称为mechanicotherapy（机械疗法）。"}]}],"synonyms":["mechanotherapy","physical therapy","physiotherapy","manual therapy"],"phonetic":"/məˌkænɪkoʊˈθɛrəpi/","extraExplanation":["该词由“mechanico-（机械的）+ therapy（治疗）”构成，历史上常与“mechanotherapy（机械疗法）”并见，但在现代医学英语里更常用的是“physical therapy / physiotherapy（物理治疗/物理疗法）”或更具体的“manual therapy（手法治疗）”“therapeutic exercise（治疗性运动）”。","在学术检索或阅读旧文献时可能遇到该词；日常医疗沟通中建议改用更常见的现代术语以避免误解。"]}
{"word":"mechanics","summary":{"en":"Mechanics most often means the science of motion and forces, or the practical way something works (including rules/technical details).","zh":"Mechanics常指“力学”，也可指“运作/操作方式”或“规则与技术细节（机制）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science that studies motion, forces, and how physical objects behave (a branch of physics/engineering)","zh":"力学；研究运动、力与物体行为的科学（物理/工程学的分支）"},"examples":[{"en":"She is studying mechanics and thermodynamics this semester.","zh":"这学期她在学习力学和热力学。"},{"en":"Newton’s laws are fundamental to classical mechanics.","zh":"牛顿定律是经典力学的基础。"}]},{"partOfSpeech":"n.","definition":{"en":"the practical parts of how something works or is done; the system of operations","zh":"运作方式；具体操作方法与流程"},"examples":[{"en":"The mechanics of the voting process are explained on the website.","zh":"网站上解释了投票流程的运作方式。"},{"en":"We need to work out the mechanics of scheduling and payments.","zh":"我们需要把排期和付款的具体操作细节敲定。"}]},{"partOfSpeech":"n.","definition":{"en":"the rules or technical details of a game, sport, or skill (how it functions)","zh":"（游戏/运动/技能的）规则与技术细节；机制"},"examples":[{"en":"The coach corrected the mechanics of his swing.","zh":"教练纠正了他挥棒动作的技术要领。"},{"en":"I like the story, but the mechanics of the game feel confusing.","zh":"我喜欢剧情，但游戏机制让人有点困惑。"}]}],"synonyms":["physics (context-dependent)","dynamics","operation","workings","process","system","rules","mechanism"],"phonetic":"/məˈkænɪks/","extraExplanation":["“Mechanics”常以复数形式出现，即使谈的是一个学科（study mechanics）。当指“修理工”时，常用单数“a mechanic”，复数为“mechanics”（修理工们）。","在写作/游戏语境里，“mechanics”常指可执行的规则与细节（如语法、标点、游戏机制）；而“strategy”更偏向策略与思路。"]}
{"word":"mechanicus","summary":{"en":"Mechanicus most often refers to the Warhammer 40K faction/organization called the Adeptus Mechanicus; outside that context it’s mainly a stylized Latin-like name.","zh":"Mechanicus最常见指《战锤40K》中的“机械教”（Adeptus Mechanicus）；脱离该语境时多为风格化的拉丁式名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually capitalized) The Adeptus Mechanicus: a fictional religious-tech organization in the Warhammer 40,000 universe, devoted to machines, engineering, and the “Machine God.”","zh":"（通常大写）机械教（Adeptus Mechanicus）：《战锤40K》世界观中的虚构宗教科技组织，崇拜机器与工程技术，并信奉“机魂/机神（Machine God）”。"},"examples":[{"en":"He painted an army of Mechanicus figures for his Warhammer 40K games.","zh":"他为自己的《战锤40K》游戏涂装了一支机械教模型军队。"},{"en":"In the lore, the Mechanicus controls much of the Imperium’s advanced technology.","zh":"在设定中，机械教掌控了帝国大量的先进科技。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; Latin-style form) A member of a mechanist group, or something related to mechanics; often used as a stylized name rather than standard English.","zh":"（罕见；仿拉丁形式）指机械主义团体成员，或与机械学有关的事物；多作为风格化名称使用，并非标准英语常用词。"},"examples":[{"en":"The band chose “Mechanicus” as an album title to give it a Latin, industrial feel.","zh":"乐队把“Mechanicus”作为专辑名，以营造拉丁式的工业感。"},{"en":"You’ll more commonly see “mechanic” or “mechanical” in everyday English.","zh":"在日常英语里更常见的是“mechanic（技工）”或“mechanical（机械的）”。"}]}],"synonyms":["Adeptus Mechanicus","mechanic","mechanical","mechanics"],"phonetic":"/məˈkænɪkəs/","extraExplanation":["“Mechanicus”带有拉丁语风格的词尾“-us”，在现代英语里不算常用普通词汇；最常见的用法来自《战锤40K》的专有名词（Adeptus Mechanicus）。","如果你想表达“机械的/机械相关的”，更地道的词通常是 mechanical（机械的）或 mechanics（力学/机械学）；“mechanic”则是“修理工/技工”。"]}
{"word":"mechanisation","summary":{"en":"Mechanisation means introducing machines to do work, replacing or reducing human/animal labor.","zh":"mechanisation 指用机器完成工作、替代或减少人力/畜力的“机械化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use of machines to do work that was previously done by people or animals; the process of introducing machines into a task, industry, or society","zh":"（以机器代替人力或畜力的）机械化；在某项工作、行业或社会中引入机器的过程"},"examples":[{"en":"Mechanisation in farming reduced the need for manual labor.","zh":"农业机械化减少了对体力劳动的需求。"},{"en":"The mechanisation of factories increased production but changed many workers’ jobs.","zh":"工厂的机械化提高了产量，但也改变了许多工人的工作内容。"},{"en":"Rapid mechanisation transformed the country’s economy within a few decades.","zh":"快速的机械化在几十年内改变了该国的经济。"}]}],"synonyms":["mechanization","automation (partly overlapping)","industrialization (broader)"],"phonetic":"/ˌmɛkənəˈzeɪʃən/","extraExplanation":["“mechanisation”是英式拼写（BrE），美式更常写作“mechanization”（AmE），含义相同。","这个词常用于讨论工业化、农业现代化、生产效率提升，以及与之相关的社会议题（例如岗位变化、技能需求转变）。"]}
{"word":"mechanise","summary":{"en":"Mechanise means to introduce or use machines so work is done mechanically rather than by hand (BrE spelling of mechanize).","zh":"mechanise 意为“使机械化；用机器完成工作”，是 mechanize 的英式拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE) To equip a process, farm, or factory with machines so the work is done by mechanical power rather than by hand.","zh":"（英式）使机械化；用机器装备（流程、农场或工厂），让工作由机械动力而不是人工完成。"},"examples":[{"en":"The company mechanised its production line to increase output.","zh":"公司将生产线机械化以提高产量。"},{"en":"Many farms mechanised after tractors became affordable.","zh":"在拖拉机变得负担得起之后，许多农场实现了机械化。"}]},{"partOfSpeech":"v.","definition":{"en":"To operate or perform something using machines; to make a particular task automatic or machine-driven.","zh":"用机器来操作/完成；使某项任务自动化或由机器驱动。"},"examples":[{"en":"The team mechanised the packaging process to reduce errors.","zh":"团队将包装流程机械化以减少错误。"}]}],"synonyms":["mechanize","automate","industrialize","equip","modernize"],"phonetic":"/ˈmɛkənaɪz/","extraExplanation":["“mechanise”是英式拼写；美式更常写作“mechanize”。两者意思相同。","词根“mechan-”与“machine（机器）”同源；“-ise”是英式常见动词后缀，表示“使变成……”。","在历史与社会语境中，“mechanise”常与工业化、农业现代化有关：效率提升的同时，也可能带来岗位变化、对技能要求的转变等讨论。"]}
{"word":"mechanism","summary":{"en":"Mechanism means either (1) the working parts of a machine or (2) the process/system that makes something happen.","zh":"mechanism既可以指（1）机器的机械装置，也可以指（2）使某事发生或运作的机制/原理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of moving parts in a machine (or something like a machine) that works together to make it operate.","zh":"（机器或类似机器的）机械装置；一套相互配合运作的零件系统。"},"examples":[{"en":"The clock’s mechanism is very delicate.","zh":"这个钟表的机械装置非常精密。"},{"en":"A simple mechanism lifts the lid automatically.","zh":"一个简单的机械结构会自动把盖子抬起来。"}]},{"partOfSpeech":"n.","definition":{"en":"The method or process by which something happens or works (often in science, psychology, or society).","zh":"（事情发生或起作用的）机制；原理；运作方式（常用于科学、心理或社会领域）。"},"examples":[{"en":"Scientists are still studying the mechanism of the disease.","zh":"科学家仍在研究这种疾病的发病机制。"},{"en":"Trust is an important mechanism for cooperation.","zh":"信任是促成合作的重要机制。"},{"en":"Humor can be a coping mechanism during stressful times.","zh":"在压力大的时候，幽默可以是一种应对机制。"}]}],"synonyms":["system","process","method","apparatus","device"],"phonetic":"/ˈmɛkəˌnɪzəm/","extraExplanation":["“Mechanism”在学术英语里很常见：在医学里常说“mechanism of disease（发病机制）”；在心理学里说“defense/coping mechanism（防御/应对机制）”；在社会科学里说“mechanism for…（实现某目标的机制/办法）”。","与“machine”相比，“mechanism”更强调“内部如何运作的结构或过程”；与“method/way”相比，“mechanism”更偏正式，也更强调“因果链条/原理”。"]}
{"word":"mechanism-of-action","summary":{"en":"How something produces its effects, especially a drug’s biological process.","zh":"产生效果的方式或原理，尤指药物的生物学作用过程。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"In pharmacology/biology, the specific biochemical process or target through which a drug, chemical, or treatment produces its effect.","zh":"（药理/生物）指药物、化学物质或治疗产生作用的具体生化过程或作用靶点（常写作 MOA）。"},"examples":[{"en":"The mechanism of action of aspirin involves inhibiting enzymes that produce inflammation-related chemicals.","zh":"阿司匹林的作用机制包括抑制产生炎症相关化学物质的酶。"},{"en":"Two drugs can treat the same disease but have different mechanisms of action.","zh":"两种药可能治疗同一种疾病，但作用机制不同。"},{"en":"Researchers are still clarifying the mechanism of action for the new antiviral.","zh":"研究人员仍在厘清这种新型抗病毒药的作用机制。"}]},{"partOfSpeech":"phrase","definition":{"en":"More generally, the way a system, method, or policy produces a particular outcome.","zh":"（更广义）指某个系统、方法或政策产生某种结果的方式或原理。"},"examples":[{"en":"The report explains the mechanism of action behind the new pricing policy.","zh":"报告解释了新定价政策背后的运作机制。"},{"en":"They tested several mechanisms of action to reduce noise in the engine.","zh":"他们测试了几种机制来降低发动机噪音。"}]}],"synonyms":["mode of action","working mechanism","how it works","biological pathway","means of action"],"phonetic":"/ˈmɛkəˌnɪzəm əv ˈækʃən/","extraExplanation":["在医学/药学里常用缩写 MOA。它通常强调“怎么起作用”（例如作用于哪个受体/酶、影响哪条信号通路），不同于 dosage（剂量）或 indication（适应症）。","相关但不同的概念：mode of action 有时用法接近，但在某些领域（如农药/抗菌研究）可能更偏“功能层面/表现层面”，而 mechanism of action 更偏“分子/生化层面的原因”。具体用法取决于学科与文献习惯。"],"etymology":"源自希腊语词根 mechane（机器、装置、巧计）发展出的 mechanism（机制），以及拉丁语 actio（行动、做事）形成的 action。合起来在科学语境中表示“产生效果的运作方式/原理”，在医学与药理学中固定搭配为“作用机制”。","mnemonic":["把它拆开记：mechanism=“机制/机器的运作”，action=“作用/行动”→“产生作用的机制”。","联想药品说明书：看到“MOA”就想到“它是怎么起效的”。"]}
{"word":"mechanismic","summary":{"en":"Mechanismic means related to mechanisms or a mechanistic, machine-like way of explaining things.","zh":"mechanismic 指“与机制有关的”或“以机械论、像机器一样的方式来解释事物的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a mechanism or to a “mechanistic” way of explaining things (as if they work like a machine, with fixed parts and predictable causes)","zh":"与机制有关的；（解释事物时）偏“机械论/机理化”的，把事物看作像机器一样由固定部件与可预测因果关系运作"},"examples":[{"en":"The paper offers a mechanismic explanation of how the drug affects the brain.","zh":"这篇论文用一种机制化（机械论）的方式解释了药物如何影响大脑。"},{"en":"A purely mechanismic view can overlook human feelings and social context.","zh":"纯粹机制化的观点可能忽视人的感受与社会语境。"}]}],"synonyms":["mechanistic","mechanical","system-based","reductionist"],"phonetic":"ˌmɛkəˈnɪzəmɪk","extraExplanation":["“mechanismic”在现代英语中比较少见，更常见的对应词是“mechanistic”。在学术语境里，它常用来形容一种把复杂现象（如心智、社会、生命）简化为“像机器一样运作”的解释框架（机械论）。在日常对话中通常会用“mechanistic”或“mechanical”来表达相近意思。"]}
{"word":"mechanisms","summary":{"en":"“Mechanisms” can mean the working parts inside a machine, or the way a process works and produces results.","zh":"“mechanisms”既可指机器内部的运作部件，也可指某种过程如何运作并产生结果的“机制/机理”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of parts that work together in a machine or system to make it operate; the working structure inside something.","zh":"（机器或系统的）机制；机件；使某物运转的内部结构。"},"examples":[{"en":"The clock’s mechanisms are very delicate.","zh":"这个钟表的机件非常精密。"},{"en":"Engineers studied the mechanisms inside the robot arm.","zh":"工程师研究了机器人手臂内部的运作机构。"}]},{"partOfSpeech":"n.","definition":{"en":"A way that something happens or works (often in science, medicine, psychology, or society).","zh":"（事物发生或起作用的）机制；机理（常用于科学、医学、心理学或社会学语境）。"},"examples":[{"en":"Scientists are still investigating the mechanisms of memory.","zh":"科学家仍在研究记忆的机理。"},{"en":"There should be a clear mechanism for handling complaints.","zh":"应该有一个清晰的投诉处理机制。"}]}],"synonyms":["systems","processes","workings","machinery","methods"],"phonetic":"/ˈmɛkəˌnɪzəmz/","extraExplanation":["“mechanisms”是名词复数，单数是“mechanism”。在学术写作里，mechanism常指“因果过程/运作机理”，比“reason（原因）”更强调“如何发生”。","常见搭配：biological mechanisms（生物机制）、defense mechanisms（心理防御机制）、market mechanisms（市场机制）、a mechanism for + V-ing（用于……的机制/办法）。"]}
{"word":"mechanismus","summary":{"en":"Mechanism means either the working parts inside a machine or the process/system that makes something happen.","zh":"Mechanism 既指机器内部的机械装置，也指促成某事发生的机制/运作方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of moving parts in a machine or device that work together to do a job; the mechanical system inside something.","zh":"（机器或装置内部的）机械装置；一套协同工作的部件。"},"examples":[{"en":"The clock’s mechanism stopped working after it got wet.","zh":"钟表的机械装置进水后就不走了。"},{"en":"A tiny mechanism opens the umbrella when you press the button.","zh":"你按下按钮时，一个小装置会把伞打开。"}]},{"partOfSpeech":"n.","definition":{"en":"A method or process by which something happens or is done; the way a system produces a result.","zh":"机制；机理；（事情发生或完成的）方法与过程。"},"examples":[{"en":"We need a mechanism to handle customer complaints quickly.","zh":"我们需要一种机制来快速处理客户投诉。"},{"en":"Scientists are still studying the mechanism behind the disease.","zh":"科学家仍在研究这种疾病背后的机理。"}]},{"partOfSpeech":"n.","definition":{"en":"In explanations (often academic), a specific causal pathway that links a cause to an effect (how A leads to B).","zh":"（学术表达）因果机制：把原因与结果连接起来的具体路径（A 如何导致 B）。"},"examples":[{"en":"The paper proposes a mechanism linking stress to poor sleep.","zh":"这篇论文提出了压力与睡眠差之间的因果机制。"},{"en":"Explain the mechanism by which the policy reduces inflation.","zh":"请解释该政策通过何种机制降低通货膨胀。"}]}],"synonyms":["system","process","method","device","machinery"],"phonetic":"/ˈmɛkəˌnɪzəm/","extraExplanation":["“Mechanismus”是德语/拉丁化拼写，对应英语更常见的形式是“mechanism”。在英语写作与考试中请用“mechanism”。","在日常英语里，“mechanism”既可以指“机器里的机械结构”，也常用于更抽象的“制度/处理办法/运作机制”。看到搭配“mechanism for (doing) … / mechanism behind … / by which …”通常是抽象义。"]}
{"word":"mechanist","summary":{"en":"A mechanist is either (1) a machine specialist/worker or (2) someone who holds a mechanistic, cause-and-effect view of nature or the mind.","zh":"mechanist既可指（1）从事机器制造/操作/维修的机械技师，也可指（2）主张用因果与物理机制解释世界或心智的机械论者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who builds, uses, or repairs machines; a skilled worker in machinery (often in industry)","zh":"机械工；机器技师（常指在工业领域从事制造、操作或维修机器的人）"},"examples":[{"en":"The factory hired a mechanist to maintain the printing machines.","zh":"工厂雇了一位机械技师来维护印刷机。"},{"en":"As a mechanist, she can take apart an engine and put it back together.","zh":"作为机械工，她能把发动机拆开再装回去。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who explains nature, life, or the mind mainly in terms of physical parts and cause-and-effect (a mechanistic view)","zh":"机械论者（倾向用物理部件与因果机制来解释自然、生命或心智的人）"},"examples":[{"en":"Some critics say his view of human behavior is too mechanist.","zh":"一些批评者说他对人类行为的看法太过机械论。"},{"en":"In the debate, the mechanist argued that complex systems can be understood by studying their parts.","zh":"在辩论中，机械论者认为研究各个部分就能理解复杂系统。"}]}],"synonyms":["mechanic","machine technician","engineer (general)","mechanical worker","mechanistic thinker"],"phonetic":"/ˈmɛkənɪst/","extraExplanation":["“mechanist”有时会被当作“mechanic（修理工）”的近义词，但语气更偏“从事机械/机器系统的专业人员”，也常见于较正式或学术语境。","在哲学与科学史中，“mechanist/mechanistic”常与“mechanism（机械论）”相关：强调用可测量的物理过程与因果关系解释现象。文学或评论中说某人“mechanist”也可能带有批评意味，暗示其观点过于冷硬、忽视情感与主观经验。"]}
{"word":"mechanistic","summary":{"en":"Mechanistic means “machine-like”: either a theory focused on parts and cause-and-effect, or a rigid, automatic way of doing something.","zh":"Mechanistic 意为“像机器一样”：既可指强调部件与因果机制的机械论解释，也可指做事刻板、自动、不够灵活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Explained or understood as a machine-like process, focusing on parts, steps, and physical causes rather than feelings or meaning.","zh":"（解释或理解方式）机械论的；把事物看作像机器一样的过程，强调部件、步骤和物理因果，而非情感或意义。"},"examples":[{"en":"Her mechanistic view of the brain compares thoughts to signals in a machine.","zh":"她对大脑的机械论观点把思想比作机器里的信号。"},{"en":"The film critic said the hero felt mechanistic, with little emotion or growth.","zh":"影评人说主角显得很“机械”，缺少情感和成长。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done in a rigid, automatic way, as if following instructions without thinking.","zh":"（做事方式）机械的；刻板自动的，像不动脑地照指令执行。"},"examples":[{"en":"He answered the questions in a mechanistic way, without listening carefully.","zh":"他回答问题很机械，没有认真听。"},{"en":"If you only memorize vocabulary mechanistically, you may forget it quickly.","zh":"如果你只是机械背单词，可能很快就忘。"}]}],"synonyms":["mechanical","machine-like","automatic","formulaic","reductionist"],"phonetic":"/ˌmɛkəˈnɪstɪk/","extraExplanation":["“mechanistic”常用于两类语境：\n1）科学/哲学：mechanistic explanation（机械论解释），强调“用可观察的部件与因果机制来解释现象”，常与“purpose/meaning（目的/意义）”形成对比。\n2）日常评价：形容人或表达方式“像机器一样”，通常带一点负面含义（缺乏灵活性、情感或创造力）。","常见搭配：mechanistic model（机械模型/机制模型），mechanistic approach（机械式方法/机制导向方法），a mechanistic view of life（对生命的机械论看法）。","近义辨析：\n- mechanical 更常见，偏“像机器运作/刻板重复”。\n- mechanistic 更强调“用机械论（机制、因果链）去解释/看待”，语气更学术一些。"]}
{"word":"mechanistically","summary":{"en":"Mechanistically means either ‘in a rigid, automatic way’ or ‘from a mechanism/cause-and-effect viewpoint,’ especially in science.","zh":"mechanistically既可指“机械地、照章行事地”，也可指“从机制/因果过程角度（尤用于科学）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that follows a fixed system of rules or a step-by-step process, often without considering broader meaning or context.","zh":"以机械式、照章行事的方式；按固定规则或步骤执行，常常不顾更广的意义或语境。"},"examples":[{"en":"He applied the checklist mechanistically, without noticing the unusual warning signs.","zh":"他机械地照着清单操作，却没注意到不寻常的警示迹象。"},{"en":"If you translate mechanistically, the sentences may sound unnatural in English.","zh":"如果你机械地翻译，句子在英语里可能会很不自然。"}]},{"partOfSpeech":"adv.","definition":{"en":"In terms of physical mechanisms or cause-and-effect processes (common in science), explaining something by how its parts work.","zh":"（尤用于科学）从机制/因果过程来解释；强调“部件如何运作”来说明现象。"},"examples":[{"en":"The paper describes mechanistically how the drug blocks the receptor.","zh":"这篇论文从机制层面说明了该药物如何阻断受体。"},{"en":"Scientists try to understand the disease mechanistically, not just by symptoms.","zh":"科学家试图从机制上理解这种疾病，而不仅仅停留在症状层面。"}]}],"synonyms":["automatically","routinely","mindlessly","formulaically","in mechanistic terms"],"phonetic":"/ˌmɛkəˈnɪstɪkli/","extraExplanation":["“mechanistically”来自“mechanistic（机制的；机械论的）+ -ally”。日常语境中常带一点批评意味：强调“像机器一样照做”，缺乏灵活性与思考（例如机械地遵守规则、机械地翻译）。","在学术写作中（生物、医学、化学、工程等）它通常是中性词，意思是“从机理上解释/阐明”，常见搭配有：mechanistically explain/understand, mechanistically linked, mechanistically distinct。"]}
{"word":"mechanists","summary":{"en":"Mechanists are people who explain things—especially life or the mind—mainly in machine-like, physical cause-and-effect terms.","zh":"Mechanists 指“机械论者”，倾向用类似机器的物理因果关系来解释事物（尤其是生命或心智）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that living things, minds, or society can be explained mainly as a machine—by physical parts, forces, and cause-and-effect.","zh":"机械论者；认为生命、心智或社会主要可以用“像机器一样”的物理部件与因果关系来解释的人。"},"examples":[{"en":"Some mechanists argue that the mind is the product of brain processes, like a complex machine.","zh":"一些机械论者认为，心智是大脑过程的产物，就像一台复杂的机器。"},{"en":"In the debate, mechanists focused on measurable causes rather than feelings or purpose.","zh":"在辩论中，机械论者关注可测量的原因，而不是情感或目的。"}]},{"partOfSpeech":"n.","definition":{"en":"(More generally) People who strongly favor mechanical or technical explanations and methods.","zh":"（更广义）偏好用机械、技术方式来解释或处理问题的人。"},"examples":[{"en":"The mechanists on the team wanted a clear model and data before making a decision.","zh":"团队里的“机械派”希望在决策前先有清晰模型和数据。"}]}],"synonyms":["mechanism supporters","reductionists","materialists","physicalists"],"phonetic":"/ˈmɛkənɪst/","extraExplanation":["“Mechanists”是“mechanist”的复数。mechanist常与哲学/科学史里的“mechanism（机械论）”相关：它强调自然现象可由物质结构与因果规律解释。17世纪科学革命后，这种思路影响很大（常与笛卡尔、霍布斯等人的讨论一起出现）。","在现代语境中，它有时带一点立场色彩：支持严格的可测量解释，可能被批评为忽视意识、意义、目的或主观体验。具体语气取决于上下文。"]}
{"word":"mechanizable","summary":{"en":"Mechanizable describes work or processes that can be done using machines or automation.","zh":"mechanizable 指某些工作或流程“可以用机器来完成/适合机械化或自动化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be done by machines or with mechanical methods; suitable for automation.","zh":"可机械化的；适合用机器完成的；可自动化处理的。"},"examples":[{"en":"Many farm tasks became mechanizable after the invention of the tractor.","zh":"拖拉机发明后，许多农场工作都变得可以机械化了。"},{"en":"The company looked for mechanizable steps to reduce repetitive manual work.","zh":"公司寻找可以机械化的步骤，以减少重复的人工劳动。"}]}],"synonyms":["automatable","machineable","industrializable"],"phonetic":"/məˈkænɪˌzaɪzəbəl/","extraExplanation":["“mechanizable”常用于农业、制造业、流程管理等语境，强调某个工作/流程能被机器替代或部分替代。它通常带有“提高效率、减少人力”的含义，但在社会讨论中也可能引出“岗位变化、技能转型”等话题。","词形结构：mechanize（使机械化）+ -able（可以……的）→ mechanizable（可被机械化的）。常见搭配：mechanizable tasks/processes/operations（可机械化的任务/流程/作业）。"]}
{"word":"mechanization","summary":{"en":"Mechanization means replacing or supporting human/animal work with machines, especially in farming and industry.","zh":"Mechanization 指用机器取代或辅助人/牲畜劳动的过程，常见于农业与工业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of using machines to do work that was previously done by people or animals, especially in farming or industry","zh":"机械化：用机器来完成以前由人或牲畜完成的工作（尤指农业或工业）"},"examples":[{"en":"Mechanization in agriculture allows farmers to plant and harvest much faster.","zh":"农业机械化让农民能够更快地播种和收割。"},{"en":"Factory mechanization reduced the need for manual labor on the assembly line.","zh":"工厂的机械化减少了流水线上对体力劳动的需求。"}]},{"partOfSpeech":"n.","definition":{"en":"the spread or increased use of machinery and automated methods in a place or system","zh":"机器/自动化方法的普及或使用增加（在某个地区或系统中）"},"examples":[{"en":"The mechanization of transportation changed how people travel and trade.","zh":"交通运输的机械化改变了人们出行和贸易的方式。"},{"en":"Mechanization has improved productivity, but it can also disrupt traditional jobs.","zh":"机械化提高了生产率，但也可能冲击传统工作岗位。"}]}],"synonyms":["automation","machine use","industrialization"],"phonetic":"/ˌmɛkənəˈzeɪʃən/","extraExplanation":["词根理解：mechanize（使机械化）+ -ation（名词后缀，表示“过程/结果”）。因此 mechanization 强调“变成依赖机器的过程”。","常见搭配：agricultural mechanization（农业机械化）、industrial mechanization（工业机械化）、the mechanization of + 名词（……的机械化）、drive/push mechanization（推动机械化）。","语境提示：在历史与社会讨论中，mechanization 常与 Industrial Revolution（工业革命）一起出现，用来谈生产效率提升、劳动力结构变化等影响。"]}
{"word":"mechanizations","summary":{"en":"“Mechanizations” means the use or introduction of machines/automation, or (figuratively) making something more routine and machine-like.","zh":"“mechanizations”指引入机器/自动化的机械化过程；也可引申为让事物变得更程式化、更“像机器”运作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of introducing machines or automated systems to do work that people used to do by hand","zh":"机械化；用机器或自动化系统来完成原本由人力完成的工作"},"examples":[{"en":"Farm mechanization increased harvests and reduced the need for manual labor.","zh":"农业机械化提高了产量，并减少了对体力劳动的需求。"},{"en":"The factory’s mechanizations made production faster and more consistent.","zh":"工厂的机械化措施让生产更快、质量更稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) the act of making a process or behavior more routine, automatic, or “machine-like”","zh":"（引申）使过程或行为变得程式化、自动化、像机器一样运作"},"examples":[{"en":"Some critics worry that the mechanization of customer service makes interactions feel cold.","zh":"一些批评者担心客服的“机械化”会让交流显得冷冰冰的。"},{"en":"He resisted the mechanizations of office life and tried to keep his work creative.","zh":"他抗拒办公室生活的程式化，努力让工作保持创造性。"}]}],"synonyms":["automation","mechanization","industrialization","computerization"],"phonetic":"/ˌmɛkənəˈzeɪʃən/","extraExplanation":["“Mechanizations”是复数形式，单数是“mechanization”。通常在讨论不同领域/多项措施时用复数，例如“the mechanizations of farming and manufacturing”（农业与制造业的机械化）。","英式拼写常见为“mechanisation”，美式拼写为“mechanization”。动词是“mechanize”（使机械化）。"]}
{"word":"mechanize","summary":{"en":"Mechanize means to use machines to do work that people used to do, often to increase speed and efficiency; it can also mean making something operate in an automatic, machine-like way.","zh":"Mechanize 指用机器来完成原本由人完成的工作，使其机械化、提高效率；也可指让某事以自动化、像机器一样的方式运作。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to equip a process, workplace, or system with machines so it can be done with less human labor","zh":"使（流程、工作场所或系统）机械化；用机器取代部分人工"},"examples":[{"en":"The factory mechanized its assembly line to increase output.","zh":"这家工厂将装配线机械化以提高产量。"},{"en":"Many farms mechanized after the war, using tractors instead of horses.","zh":"战后许多农场实现机械化，用拖拉机代替马匹。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a task operate automatically or in a machine-like way (sometimes implying less personal judgment or creativity)","zh":"使（工作）自动化或变得“像机器一样”运作（有时含“缺少人情味/判断力”的意味）"},"examples":[{"en":"The company mechanized customer service with chatbots and scripts.","zh":"公司用聊天机器人和话术脚本让客服流程自动化。"},{"en":"He felt the strict routine mechanized his teaching.","zh":"他觉得严格的流程让他的教学变得程式化、像机器一样。"}]}],"synonyms":["automate","modernize","industrialize","equip (with machinery)","robotize"],"phonetic":"/ˈmɛkəˌnaɪz/","extraExplanation":["“mechanize”常用于工业与农业语境，和工业革命、流水线生产联系紧密。它通常强调“用机器提高效率”，但在描述工作/生活方式时也可能带一点批评意味，表示“变得僵化、缺少人性”。","词形提示：mechanize（动词）→ mechanization（名词：机械化/自动化）；mechanized（形容词：机械化的）。英式拼写常见为 mechanise。"]}
{"word":"mechanized","summary":{"en":"Mechanized means done with or equipped with machines, often making work faster and more efficient.","zh":"mechanized 指“机械化的”，即用机器完成或配备机械装置，通常更快、更高效。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using machines to do work that people or animals used to do, often to make the work faster and more efficient.","zh":"使用机器来完成过去由人或动物完成的工作，通常使工作更快、更高效。"},"examples":[{"en":"Many farms became mechanized in the 20th century, using tractors instead of horses.","zh":"许多农场在20世纪实现了机械化，用拖拉机代替了马。"},{"en":"The factory is highly mechanized, so it needs fewer workers than before.","zh":"这家工厂高度机械化，所以比以前需要更少的工人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Equipped with mechanical parts or made to operate like a machine (often describing a system, process, or movement).","zh":"装有机械部件，或以类似机器的方式运作（常用来描述系统、流程或动作）。"},"examples":[{"en":"The assembly line follows a mechanized process with strict timing.","zh":"流水线遵循机械化的流程，时间控制非常严格。"},{"en":"His movements looked mechanized, as if he were following a script.","zh":"他的动作看起来很机械，仿佛在照着脚本走。"}]}],"synonyms":["machine-driven","machine-powered","industrialized","automated"],"phonetic":"/ˈmɛkəˌnaɪzd/","extraExplanation":["“mechanized”来自“mechanize”（使机械化）。它常用于农业、制造业、军队等语境：例如 mechanized farming（机械化农业）、mechanized production（机械化生产）、mechanized infantry（机械化步兵，指配备装甲车/运输车以提高机动性的部队）。","学习区分：mechanized 强调“由机器完成/配备机械”；automated 更强调“自动化”，即机器在更少人工控制下自动运行。两者有时可重叠，但 automated 的“自动”意味更强。"]}
{"word":"mechanizer","summary":{"en":"Mechanizer means a person or thing that makes work more machine-based or automated.","zh":"Mechanizer 指使工作变得更依赖机器或更自动化的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, company, or tool/device that introduces machines or automated methods to do work (to mechanize a process)","zh":"使某项工作“机械化/自动化”的人、公司或工具/设备"},"examples":[{"en":"The factory hired a mechanizer to speed up packaging and reduce manual labor.","zh":"这家工厂雇了一位机械化改造人员来加快包装速度并减少人工。"},{"en":"In modern farming, a mechanizer might replace hand tools with tractors and harvesters.","zh":"在现代农业中，“机械化推动者”可能会用拖拉机和收割机来替代手工工具。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) someone who strongly supports mechanization in society or industry","zh":"（较少见）强烈主张社会或工业机械化的人"},"examples":[{"en":"Early mechanizers argued that machines would improve productivity and living standards.","zh":"早期的机械化倡导者认为机器会提高生产力和生活水平。"}]}],"synonyms":["automation engineer","industrial engineer","mechanizer (device)","mechanization advocate"],"phonetic":"/ˈmɛkəˌnaɪzɚ/","extraExplanation":["“mechanizer”来自动词 mechanize（使机械化/自动化）。在日常英语里，这个名词不算特别常见；更常见的表达是 automation engineer（自动化工程师）、industrial engineer（工业工程师）、equipment supplier（设备供应商）等。","在历史语境中，mechanization（机械化）常与工业革命、流水线生产和农业机械化联系在一起；讨论时也可能涉及就业结构变化与劳动强度降低等社会影响。"]}
{"word":"mechanizers","summary":{"en":"Mechanizers are people/organizations—or less commonly machines—that make work mechanical by introducing machinery.","zh":"mechanizers 指推动把工作用机器完成的人/机构；较少见时也可指实现机械化的设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or companies that introduce machines to do work that was previously done by hand; those who mechanize a process.","zh":"把原本靠人工完成的工作改为用机器完成的人或公司；推进“机械化”的人。"},"examples":[{"en":"Farm mechanizers helped replace hand tools with tractors and harvesters.","zh":"农业机械化推动者帮助用拖拉机和收割机取代了手工工具。"},{"en":"The factory hired mechanizers to redesign the production line.","zh":"工厂雇佣了机械化改造人员来重新设计生产线。"}]},{"partOfSpeech":"n.","definition":{"en":"Machines or devices that make a task mechanical or automated (less common usage).","zh":"使某项工作变为机械化或自动化的机器或装置（较少见用法）。"},"examples":[{"en":"Mechanizers in the warehouse reduced the need for manual lifting.","zh":"仓库里的机械化设备减少了对人工搬运的需求。"}]}],"synonyms":["automation specialists","industrial engineers","modernizers","machinery operators","equipment"],"phonetic":"/ˈmɛkəˌnaɪzər/","extraExplanation":["“mechanizers”是复数形式，单数是“mechanizer”。它来自动词“mechanize”（使机械化/用机器替代人工）。在现代英语里，这个词不算特别常见，写作中更常用“automation specialists（自动化专家）”“industrial engineers（工业工程师）”或直接说“machines/equipment（机器/设备）”，取决于你指的是“人”还是“机器”。"]}
{"word":"mechanizes","summary":{"en":"“Mechanizes” means “makes something mechanical/automatic” or “equips it with machines.”","zh":"“mechanizes”表示“使……机械化/自动化”或“为……配备机器设备”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) to introduce machines or automation to a process or activity; to make something operate with machinery rather than by hand.","zh":"（第三人称单数）使某个过程或活动机械化/自动化；用机器替代人工来完成。"},"examples":[{"en":"The company mechanizes its packaging line to reduce costs.","zh":"公司将包装流水线机械化，以降低成本。"},{"en":"This new system mechanizes tasks that used to take hours by hand.","zh":"这个新系统把以前需要手工花好几个小时的任务自动化了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) to provide something with machines or equipment; to equip for machine use.","zh":"（第三人称单数）为……配备机器或机械设备；使其适合机器作业。"},"examples":[{"en":"The farm mechanizes its harvest with modern equipment.","zh":"农场用现代设备实现收割机械化。"},{"en":"As the industry grows, it mechanizes more of its production.","zh":"随着行业发展，它把更多生产环节实现机械化。"}]}],"synonyms":["automates","machine","industrializes","equip (with machinery)","modernize"],"phonetic":"/ˈmɛkənaɪz/","extraExplanation":["“mechanizes”是动词“mechanize”的第三人称单数形式（he/she/it mechanizes）。常见名词是“mechanization”（机械化）。","英式英语有时拼作“mechanise”，美式英语更常用“mechanize”。","“mechanize”常用于农业、制造业、办公室流程等语境，强调从“人手操作”转为“机器/自动系统操作”，有时也暗含效率提升，但也可能引发对就业变化的讨论。"]}
{"word":"mechanizing","summary":{"en":"Mechanizing means adding machines or automation to do work that used to be done by hand.","zh":"Mechanizing 指通过引入机器或自动化，让原本靠人工完成的工作改由机器完成。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"introducing machines or automation into a task, process, or industry; making something done by machines rather than by hand","zh":"在任务、流程或行业中引入机器或自动化；使原本靠人工完成的事情改由机器完成"},"examples":[{"en":"Mechanizing the farm reduced the need for manual labor.","zh":"农业机械化减少了对体力劳动的需求。"},{"en":"The company is mechanizing its packaging line to speed up production.","zh":"这家公司正在对包装生产线进行机械化，以加快产量。"},{"en":"Mechanizing data entry can lower errors, but it also changes job roles.","zh":"将数据录入流程机械化可以减少错误，但也会改变岗位职责。"}]}],"synonyms":["automating","industrializing","modernizing","using machinery"],"phonetic":"/ˈmɛkənaɪzɪŋ/","extraExplanation":["“mechanizing”是动词“mechanize”的现在分词/动名词形式，常用于描述“正在机械化/自动化”的过程（如：mechanizing agriculture）。","在历史语境中，它常与工业化相关：通过机器替代或辅助人工，提高效率与产量，但也可能带来就业结构变化与技能需求转变。"]}
{"word":"mechano-chemical","summary":{"en":"Driven by or involving mechanical force and chemical change together.","zh":"由机械力驱动或与机械作用和化学变化共同相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to chemical changes or reactions caused by mechanical forces such as grinding, milling, rubbing, pressure, or shear.","zh":"与“机械力（如研磨、球磨、摩擦、挤压、剪切等）引发的化学变化或反应”有关的。"},"examples":[{"en":"The team studied mechano-chemical reactions that occur during ball milling.","zh":"团队研究了在球磨过程中发生的机械化学反应。"},{"en":"Mechano-chemical processing can sometimes reduce the need for high temperatures or solvents.","zh":"机械化学加工有时能减少对高温或溶剂的需求。"}]}],"synonyms":["mechanochemical","mechanically induced","mechanically activated"],"phonetic":"/ˌmɛkənoʊˈkɛmɪkəl/","extraExplanation":["常见相关领域是 mechanochemistry（机械化学）：用机械能（研磨、挤压等）驱动或加速反应，常被认为更“绿色”，因为可能减少溶剂、降低能耗。","在材料科学里也常用来描述“力学—化学耦合”现象，例如摩擦导致表面发生化学反应（tribochemistry 也与此相关）。"],"etymology":"由 mechano-（源自希腊语 *mēkhanē*，意为“机器、机械装置”）+ chemical（化学的）构成，表示“机械作用与化学过程相互关联”。","mnemonic":["拆开记：mechano-（机械）+ chemical（化学）= “机械 + 化学”。想到“研磨（机械）把反应‘磨’出来（化学）”。","联想中文术语“机械化学”：看到 mechano-chemical 就把它当作“机械化学的”。"]}
{"word":"mechanochemical","summary":{"en":"Mechanochemical means “involving chemical change caused or driven by mechanical force.”","zh":"mechanochemical 指“由机械力引发或驱动的化学变化相关的；机化学的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to chemical changes that are caused or influenced by mechanical force (such as grinding, pressing, stretching, or milling).","zh":"与“机械力引发或影响的化学变化”有关的；机化学的（如研磨、挤压、拉伸、球磨等导致或促进反应）。"},"examples":[{"en":"Mechanochemical reactions can happen when powders are ground together.","zh":"把粉末一起研磨时，可能会发生机化学反应。"},{"en":"The team used a mechanochemical method to make the material without a solvent.","zh":"团队使用机化学方法在无溶剂条件下制备该材料。"}]}],"synonyms":["mechanochemistry-related","mechanically induced (chemical)","tribochemical"],"phonetic":"/ˌmɛkənoʊˈkɛmɪkəl/","extraExplanation":["“mechanochemical”常见于材料科学、化学与工程领域，搭配词很固定：mechanochemical reaction（机化学反应）、mechanochemical synthesis（机化学合成）、mechanochemical activation（机化学活化）。","它与“mechanics + chemical”相关，强调“机械作用→化学变化”的联系；在绿色化学语境中常被用来讨论“少/无溶剂（solvent-free）”的制备方式，例如球磨（ball milling）促进反应。"]}
{"word":"mechanochemistry","summary":{"en":"Chemistry of reactions and material changes driven by mechanical force (e.g., grinding or milling), often with minimal solvent.","zh":"由机械力驱动的反应与材料变化的化学领域，常少用或不用溶剂（如研磨、球磨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A branch of chemistry that studies chemical reactions and material changes caused or driven by mechanical force (such as grinding, milling, rubbing, or squeezing), often with little or no solvent.","zh":"机械化学：研究由机械力（如研磨、球磨、摩擦、挤压等）引发或推动的化学反应与材料变化的化学分支，常常少用或不用溶剂。"},"examples":[{"en":"Mechanochemistry can produce new compounds by grinding two solid powders together.","zh":"机械化学可以通过把两种固体粉末一起研磨来生成新化合物。"},{"en":"Researchers use mechanochemistry to reduce solvent waste in chemical synthesis.","zh":"研究人员用机械化学来减少化学合成中的溶剂废弃物。"},{"en":"Ball milling is a common technique in mechanochemistry.","zh":"球磨是机械化学中常见的技术。"}]}],"synonyms":["mechanical chemistry","tribochemistry","solid-state synthesis"],"phonetic":"/məˌkænoʊˈkɛmɪstri/","extraExplanation":["机械化学常与“绿色化学”相关，因为它可能在更少溶剂、更低能耗的条件下完成反应，减少环境负担。","在材料科学中，机械化学也用于制备新型晶体/共晶、改变固体结构（如多晶型转换），以及促进难以在溶液中进行的固相反应。"]}
{"word":"mechanochemistry-related","summary":{"en":"connected to chemistry involving mechanical force","zh":"与机械力参与的化学过程有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with mechanochemistry (chemical reactions driven or influenced by mechanical force, such as grinding, milling, or stretching materials)","zh":"与机械化学有关的（指由研磨、球磨、拉伸等机械力驱动或影响的化学反应/过程）"},"examples":[{"en":"The paper discusses mechanochemistry-related methods for solvent-free synthesis.","zh":"这篇论文讨论了与机械化学相关的无溶剂合成方法。"},{"en":"They observed mechanochemistry-related changes in the polymer after repeated stretching.","zh":"他们观察到该聚合物在反复拉伸后出现与机械化学相关的变化。"}]}],"synonyms":["mechanochemical","mechanochemistry-based","mechanochemistry-associated","mechanochemistry-driven"],"phonetic":"/məˌkænoʊˈkɛmɪstri rɪˈleɪtɪd/","extraExplanation":["mechanochemistry 常见于材料科学、固态化学与绿色化学语境：例如球磨（ball milling）促进固相反应、用研磨实现无溶剂反应等。写作中也常用同类结构：mechanochemistry-based（以机械化学为基础的）、mechanochemistry-driven（由机械化学驱动的）。"],"etymology":"由 mechanochemistry（mechanical“机械的”+ chemistry“化学”）与 related（“相关的”）组合而成，用于学术写作中把研究内容限定在“机械力参与的化学”这一领域。","mnemonic":["拆开记：mechano-≈“机械/力”，chemistry=“化学”，related=“相关的”→“机械力参与的化学相关”。"]}
{"word":"mechanolater","summary":{"en":"A mechanolater is someone who (often blindly) worships or over-admires machines and technology.","zh":"mechanolater 指对机器与技术抱有近乎盲目崇拜的人（多为贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships or excessively admires machines, technology, or mechanical progress (often used critically)","zh":"机械崇拜者；对机器或技术进步过度崇拜/迷信的人（常带批评意味）"},"examples":[{"en":"Some critics called him a mechanolater because he believed machines could solve every social problem.","zh":"一些批评者说他是个机械崇拜者，因为他相信机器能解决所有社会问题。"},{"en":"The essay warns against becoming mechanolaters who value efficiency more than human dignity.","zh":"这篇文章警告人们不要变成机械崇拜者，把效率看得比人的尊严更重要。"}]}],"synonyms":["technophile (often neutral)","tech-worshipper","machine-worshipper","mechanolatrist"],"phonetic":"/ˌmɛkəˈnɑːlətər/","extraExplanation":["这是一个较少见、带批评色彩的词，常出现在评论或学术写作里，用来讽刺对“技术万能”“机器至上”的盲目信仰。","词根来自 mechan-（机械）+ -latry（崇拜，如 idolatre 偶像崇拜）；对应名词 mechanolatry（机械崇拜）。"]}
{"word":"mechanolatrist","summary":{"en":"someone who worships machines or technology","zh":"把机器或科技当作崇拜对象的人"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who excessively admires or treats machines and technology as something to worship","zh":"（常带贬义）过度崇拜机器或科技的人；把技术当成“信仰”的人"},"examples":[{"en":"Some critics call Silicon Valley a culture of mechanolatrists who believe every problem has a technical fix.","zh":"一些批评者称硅谷是一种“机械崇拜者”的文化，认为所有问题都能靠技术解决。"},{"en":"The novel warns against mechanolatrists who value efficiency over human dignity.","zh":"这部小说警惕那种把效率看得比人的尊严更重要的“机械崇拜者”。"}]}],"synonyms":["technolater","technology worshiper","tech devotee","tech zealot"],"phonetic":"/ˌmɛkəˈnoʊlətrɪst/","extraExplanation":["这是一个非常少见、偏学术/批评语境的词，常用于讨论“技术至上”“科技乌托邦”或对技术的盲目信仰。语气多为讽刺或批判。","相关概念：technolatry（技术崇拜）、technophile（科技爱好者，语气更中性/正面）、Luddite（反对新技术的人）。"],"etymology":"来自希腊语词根 mechano-（机器、机械）+ -latry/-latrist（崇拜、礼拜；崇拜者），整体意为“崇拜机器的人”。","mnemonic":["拆开记：mechano-（机械/机器）+ -latrist（崇拜者）→“崇拜机器的人”。","联想中文“机械 + 祭拜/膜拜”→“机械崇拜者”。"]}
{"word":"mechanology","summary":{"en":"Mechanology means the study of machines and mechanical systems (a rare or old-fashioned term).","zh":"Mechanology 指研究机器与机械系统的学科（较少见、略偏旧的用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or science of machines and mechanical systems; an older or less common term similar to “mechanics” or “mechanical engineering.”","zh":"机械学；研究机器与机械系统的学科（较少见的用法，含义接近 mechanics 或 mechanical engineering）。"},"examples":[{"en":"He studied mechanology to understand how engines and gears work together.","zh":"他学习机械学，以理解发动机和齿轮如何协同运作。"},{"en":"The book is an introduction to mechanology for beginner engineers.","zh":"这本书是面向初学工程师的机械学入门。"}]}],"synonyms":["mechanics","mechanical engineering","machine science"],"phonetic":"/ˌmɛkəˈnɑːlədʒi/","extraExplanation":["“mechanology”在现代日常英语中不常用；更常见的说法是“mechanics”（偏物理学中的力学/机械原理）或“mechanical engineering”（机械工程，偏应用与设计）。","在一些科幻或较老的技术语境里，“mechanology”可能被用来泛指“关于机器的一切知识/学问”，语感比“mechanics”更像“机器学/机学”。"]}
{"word":"mechanomedical","summary":{"en":"connected to mechanical methods or devices used in medicine","zh":"与医学中的机械方法或装置相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the use of mechanical principles, forces, or devices in medicine (especially in diagnosis, treatment, rehabilitation, or medical device design).","zh":"与医学中的机械原理、力学作用或机械装置相关的（尤指用于诊断、治疗、康复或医疗器械设计）。"},"examples":[{"en":"The team is developing a mechanomedical device that helps patients regain hand strength after stroke.","zh":"团队正在研发一种机械医学装置，帮助中风患者恢复手部力量。"},{"en":"Mechanomedical research often connects engineering with rehabilitation therapy.","zh":"机械医学研究常把工程学与康复治疗联系起来。"}]}],"synonyms":["biomechanical","mechanotherapeutic","medical-engineering","rehabilitation-engineering"],"phonetic":"/ˌmɛkənoʊˈmɛdɪkəl/","extraExplanation":["该词不算日常英语高频词，更常见的相关领域用语有：biomechanical（生物力学的）、medical device engineering（医疗器械工程）、mechanotherapy（机械/物理方式治疗，如牵引、运动等）。在论文或项目介绍中，mechanomedical 往往强调“机械作用 + 医学应用”的结合。"],"etymology":"构词：mechano-（机械的、力学的）+ medical（医学的）。属于较少见的组合词，常见于跨学科语境（如生物力学、康复工程、医疗器械）。","mnemonic":["把它拆开记：mechano（机械）+ medical（医学）→“机械 + 医学”。","联想：康复器械、外骨骼、矫形支具这类“靠机械结构/力学帮助治疗”的东西，就是 mechanomedical 的应用场景。"]}
{"word":"mechanometry","summary":{"en":"measurement and study of mechanical quantities like force and motion","zh":"对力、运动等机械量的测定与研究"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement and study of mechanical forces, work, motion, or power (often in relation to machines or the human body)","zh":"机械测量学；对力、功、运动或功率等机械量的测定与研究（常用于机器或人体运动相关领域）"},"examples":[{"en":"The lab used mechanometry to quantify how much force the athletes produced during a jump.","zh":"实验室用机械测量学来量化运动员起跳时产生的力量。"},{"en":"In rehabilitation, mechanometry can help track changes in muscle strength over time.","zh":"在康复训练中，机械测量学可以帮助追踪肌力随时间的变化。"}]}],"synonyms":["biomechanics","dynamometry","force measurement","mechanical measurement"],"phonetic":"/ˌmɛkəˈnɑmətri/","extraExplanation":["这是一个相对少见、偏学术/技术的词。在实际英语里，更常见的相关表达有 biomechanics（生物力学）、force measurement（力的测量）、dynamometry（测力学/握力计测量）等。","在医学运动与康复领域，有时会用到相关仪器与测试（例如测力台、等速肌力测试等），这些都可以被归入“mechanometry”的范畴。"],"etymology":"词源来自希腊语构词：mechano-（机械、机器）+ -metry（测量）。整体意思就是“对机械量进行测量”。","mnemonic":["把它拆开记：mechano（机械）+ metry（测量）→ “机械的测量”。","联想中文“测量(ometry)”：比如 geometry（几何测量）→ mechanometry（机械测量）。"]}
{"word":"mechanomorphic","summary":{"en":"Mechanomorphic means “machine-like,” especially in form or in describing living processes as if they were machines.","zh":"mechanomorphic 指“像机器一样的”，尤其强调外形呈机械感，或用机器来类比生命与心智过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form, structure, or qualities of a machine; machine-like in appearance or behavior.","zh":"具有机器的形态、结构或特征的；看起来或表现得像机器一样的。"},"examples":[{"en":"The artist created mechanomorphic sculptures that look like human bodies made from gears and metal plates.","zh":"这位艺术家创作了“机械拟形”的雕塑，看起来像由齿轮和金属板组成的人体。"},{"en":"In the novel, the soldiers move in a mechanomorphic way—precise, repetitive, and emotionless.","zh":"在小说中，士兵的动作呈现“机械拟形”的特征——精准、重复、缺乏情感。"}]},{"partOfSpeech":"adj.","definition":{"en":"Explaining living beings or the mind as if they work like machines (often suggesting an overly simple view).","zh":"把生命体或心智解释得像机器在运作一样（常含“过度简化”的意味）。"},"examples":[{"en":"Some critics argue that a purely mechanomorphic view of learning ignores creativity and emotion.","zh":"一些评论者认为，把学习完全看成“机械拟形”的过程会忽视创造力和情感。"},{"en":"The psychologist warned against mechanomorphic metaphors when talking about the brain.","zh":"这位心理学家提醒，在谈论大脑时要警惕“机械拟形”的隐喻。"}]}],"synonyms":["machine-like","mechanical-looking","automaton-like","mechanistic"],"phonetic":"/ˌmɛkənoʊˈmɔrfɪk/","extraExplanation":["词源拆解：mechano-（机械）+ -morphic（形态/形变）。意思是“呈现机械形态”或“用机械来类比”。","使用场景：常见于艺术与设计（例如带齿轮、铆钉、装甲感的人形/生物形作品），以及哲学、心理学、科普写作中讨论“把人当机器解释”的倾向。","语感提示：mechanomorphic 往往比 mechanistic 更强调“外形/形态像机器”；mechanistic 更常指“解释方式很机械化、把复杂现象简化为因果机制”。"]}
{"word":"mechanomorphically","summary":{"en":"Mechanomorphically means “in a machine-like way,” describing something as having the form or behavior of a machine.","zh":"mechanomorphically 表示“以机器般的方式”，用来描述或呈现某物具有机器的形态或行为。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that gives something the form, qualities, or behavior of a machine (as if it were mechanical).","zh":"以“机械化/像机器一样”的方式；把某物描写或塑造得具有机器的形态、特性或行为。"},"examples":[{"en":"The robots were designed mechanomorphically, with visible gears and rigid movements.","zh":"这些机器人被设计得很“机械化”，齿轮清晰可见，动作也很僵硬。"},{"en":"In the novel, the city is described mechanomorphically, as if it breathes through pipes and engines.","zh":"在小说中，这座城市被以机械化的方式描写，仿佛通过管道和引擎在“呼吸”。"}]}],"synonyms":["mechanically","in a machine-like way","with mechanical qualities"],"phonetic":"/ˌmɛkənoʊˈmɔrfɪkli/","extraExplanation":["这个词不太常见，多出现在学术写作、艺术评论或科幻/文学分析中，用来表达“把人/自然/城市等用机器的意象来呈现”。","词形结构：mechano-（机械）+ -morphic（形态/形状的）+ -ally（以……方式）。理解后缀有助于猜词义：-morphic 常见于 anthropomorphic（拟人化）、biomorphic（生物形态的）。"]}
{"word":"mechanomorphism","summary":{"en":"Mechanomorphism is the idea or style of portraying living beings—especially humans—as machine-like.","zh":"mechanomorphism 指把生物（尤其是人）描绘成“像机器一样”的观念或艺术表现方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The attribution or portrayal of mechanical (machine-like) qualities, behaviors, or forms in living things (especially humans).","zh":"把机械（像机器一样）的特质、行为或外形赋予或描绘到生物（尤其是人）身上的做法。"},"examples":[{"en":"In some sci‑fi stories, mechanomorphism makes characters feel more like programmed machines than people.","zh":"在一些科幻故事里，机械拟态让角色看起来更像被编程的机器，而不像人。"},{"en":"The film’s mechanomorphism shows workers moving in rigid, repetitive patterns.","zh":"这部电影的机械拟态把工人表现为僵硬、重复的动作模式。"}]},{"partOfSpeech":"n.","definition":{"en":"An artistic or design style that uses machine imagery or structures to represent bodies, nature, or emotions.","zh":"一种艺术或设计风格：用机器的意象或结构来表现身体、自然或情感。"},"examples":[{"en":"The illustrator’s mechanomorphism turns birds into clockwork creatures.","zh":"这位插画师的机械拟态把鸟画成了发条驱动的生物。"},{"en":"Mechanomorphism is common in posters that blend human anatomy with gears and circuits.","zh":"在把人体解剖与齿轮、电路融合的海报中，机械拟态很常见。"}]}],"synonyms":["machine-like portrayal","mechanization of the human","cyborg imagery"],"phonetic":"/məˌkænəˈmɔrfɪzəm/","extraExplanation":["这个词由“mechano-（机械的）+ -morphism（形态/变形）”构成，常见于科幻、赛博朋克、艺术评论与文化研究语境。它强调“把生命按机器逻辑来理解或表现”，有时也带批评意味（例如批评把人当作可替换的零件）。","易混概念：anthropomorphism（拟人化）是“把人的特质给非人事物”；mechanomorphism（机械拟态）则是“把机器特质给人/生物”。"]}
{"word":"mechanophobia","summary":{"en":"Mechanophobia is an intense fear of machines or mechanical devices.","zh":"mechanophobia 指对机器或机械装置的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong fear of machines, mechanical devices, or complex mechanisms (sometimes including robots).","zh":"对机器、机械装置或复杂机械结构的强烈恐惧（有时也包括对机器人的恐惧）。"},"examples":[{"en":"He has mechanophobia, so elevators and escalators make him very anxious.","zh":"他有机械恐惧症，所以电梯和自动扶梯会让他非常焦虑。"},{"en":"Her mechanophobia started after a factory accident, and now she avoids heavy machinery.","zh":"她的机械恐惧症始于一次工厂事故，现在她会避开大型机械。"},{"en":"The film uses mechanophobia to create tension when the old robot suddenly powers on.","zh":"这部电影利用“机械恐惧”来制造紧张感：那台老机器人突然启动。"}]}],"synonyms":["fear of machines","machine phobia","specific phobia (mechanical devices)"],"phonetic":"/ˌmɛkəˈnoʊbiə/","extraExplanation":["词源：mechano- 来自希腊语，表示“机器/机械”，-phobia 表示“恐惧”。合起来就是“对机械的恐惧”。","与 technophobia（科技恐惧）相比，mechanophobia 更偏向“具体的机械装置、齿轮、引擎、机器人等”，而 technophobia 更广，可能包括软件、互联网、AI 等。","它在日常语境中常用来描述强烈的不适与回避；在医学语境中若影响生活功能，可能会被归入特定恐惧症（specific phobia）的讨论。"]}
{"word":"mechanoreception","summary":{"en":"Mechanoreception is sensing physical/mechanical stimuli like touch, pressure, and vibration.","zh":"Mechanoreception 指对触觉、压力、振动等机械刺激的感知能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability to sense mechanical forces such as touch, pressure, vibration, stretching, or body movement (often through specialized nerve endings)","zh":"机械感受：感知触觉、压力、振动、拉伸或身体运动等机械刺激的能力（通常通过特化的神经末梢）"},"examples":[{"en":"Mechanoreception helps you feel the vibration of your phone in your pocket.","zh":"机械感受让你能感觉到口袋里手机的震动。"},{"en":"In humans, mechanoreception in the skin is important for touch and texture.","zh":"在人类中，皮肤的机械感受对触觉和分辨质地很重要。"},{"en":"Fish use mechanoreception to detect tiny movements in the water.","zh":"鱼类利用机械感受来侦测水中的微小流动。"}]}],"synonyms":["tactile sensing","touch perception","mechanical sensation"],"phonetic":"/ˌmɛkənoʊˈsɛpʃən/","extraExplanation":["词源小提示：mechano- 表示“机械的、力学的”，-reception 表示“接收/感受”。合起来就是“接收机械刺激”。","常见相关词：mechanoreceptor（机械感受器，负责“接收”的结构，如皮肤中的感受器）、proprioception（本体感觉，感知身体位置与运动，常被视为与机械刺激相关的感觉系统之一）、nociception（伤害感受，偏向疼痛刺激）。"]}
{"word":"mechanoreceptive","summary":{"en":"Mechanoreceptive means related to sensing physical forces like touch, pressure, or vibration.","zh":"mechanoreceptive 指与感知触觉、压力、振动等机械刺激有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to sensing mechanical forces such as touch, pressure, vibration, or stretching (often describing nerves, cells, or sensory systems).","zh":"与感知机械刺激有关的；能感觉触觉、压力、振动或拉伸等（常用于描述神经、细胞或感觉系统）。"},"examples":[{"en":"The skin contains mechanoreceptive nerve endings that help you feel pressure and vibration.","zh":"皮肤中含有机械感受的神经末梢，帮助你感知压力和振动。"},{"en":"Scientists studied mechanoreceptive cells to understand how the body senses touch.","zh":"科学家研究机械感受细胞，以了解人体如何感知触觉。"}]}],"synonyms":["tactile","touch-sensitive","mechanosensory"],"phonetic":"/ˌmɛkənoʊrɪˈsɛptɪv/","extraExplanation":["“mechanoreceptive”来自“mechano-（机械的）+ receptive（可感受的）”。在生物学/神经科学里常与“mechanoreceptor（机械感受器）”“mechanoreception（机械感受）”一起出现。","常见的机械刺激包括：触碰（touch）、压力（pressure）、振动（vibration）、拉伸（stretch）。例如皮肤的触觉感受、耳朵对声波振动的感受等，都与机械感受相关。"]}
{"word":"mechanoreceptor","summary":{"en":"A mechanoreceptor is a sensory receptor that detects physical forces like touch, pressure, and vibration.","zh":"mechanoreceptor 指能感知触觉、压力、振动等机械刺激的感觉受体/感受器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized sensory cell or nerve ending that detects mechanical force such as touch, pressure, vibration, stretching, or sound","zh":"机械感受器；一种专门的感觉细胞或神经末梢，用来感知触觉、压力、振动、拉伸或声音等机械刺激"},"examples":[{"en":"Mechanoreceptors in your skin help you feel light touch and pressure.","zh":"皮肤中的机械感受器帮助你感受到轻触和压力。"},{"en":"Some mechanoreceptors respond strongly to vibration, which is why you can feel a phone buzzing.","zh":"有些机械感受器对振动反应很强，所以你能感觉到手机在震动。"},{"en":"In the ear, mechanoreceptors convert sound vibrations into nerve signals.","zh":"在耳朵里，机械感受器把声音的振动转化为神经信号。"}]}],"synonyms":["touch receptor","pressure receptor","stretch receptor"],"phonetic":"/ˌmɛkənoʊrɪˈsɛptər/","extraExplanation":["词源结构：mechano- 表示“机械的、力学的”，receptor 表示“受体/感受器”。合起来就是“感知机械刺激的受体”。","常见相关词：photoreceptor（光感受器，感知光）、chemoreceptor（化学感受器，感知味道/气味/血液化学变化）、thermoreceptor（温度感受器，感知冷热）、nociceptor（伤害感受器，感知疼痛）。","常见类型（了解即可）：触觉相关的如 Meissner’s corpuscles（轻触）、Pacinian corpuscles（振动/深压）、Merkel cells（持续压力/纹理）；肌肉和关节里的如 muscle spindles（肌梭，感知伸展）、Golgi tendon organs（腱器官，感知张力）。"]}
{"word":"mechanosensory","summary":{"en":"connected with sensing touch, pressure, stretch, or vibration","zh":"与感知触觉、压力、拉伸或振动有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to sensing physical forces such as touch, pressure, stretch, or vibration (often in biology and neuroscience).","zh":"与感知物理力量有关，如触觉、压力、拉伸或振动（常用于生物学与神经科学）。"},"examples":[{"en":"The skin contains mechanosensory nerve endings that detect light touch.","zh":"皮肤含有机械感觉的神经末梢，用来检测轻触。"},{"en":"Scientists studied mechanosensory pathways to understand how animals respond to vibration.","zh":"科学家研究机械感觉通路，以理解动物如何对振动作出反应。"}]}],"synonyms":["tactile","touch-sensitive","mechanical-sensing"],"phonetic":"/ˌmɛkənoʊˈsɛn.sɚ.i/","extraExplanation":["常见搭配：mechanosensory neuron（机械感觉神经元）、mechanosensory receptor（机械感觉受体）、mechanosensory system/pathway（机械感觉系统/通路）。","与 mechanoreceptor（机械感受器）关系密切：mechanosensory 更像形容“功能/性质”，mechanoreceptor 更像具体“受体/结构”。"],"etymology":"由 mechano-（机械的、与机械力有关，源自希腊语 mēkhanē“机器/装置”）+ sensory（感觉的，源自拉丁语 sensus“感觉”）构成，字面意思是“与机械刺激感觉有关的”。","mnemonic":["拆词记：mechano- ≈ “机械/力”，sensory = “感觉的”→ 合起来就是“对机械力有感觉的”。","联想：手机“震动”(vibration) 是一种机械刺激；能感到震动的就是 mechanosensory。"]}
{"word":"mechanotherapeutic","summary":{"en":"Mechanotherapeutic means related to treating the body using mechanical devices or controlled movements (mechanotherapy).","zh":"mechanotherapeutic 指与“机械疗法”相关：通过器械或可控运动进行治疗/康复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to mechanotherapy: treatment (often in physical therapy/rehabilitation) that uses mechanical means such as devices, apparatus, or controlled movements to help heal or improve body function.","zh":"与机械疗法（mechanotherapy）有关的：指在物理治疗/康复中使用器械、装置或可控运动来帮助治疗或改善身体功能。"},"examples":[{"en":"The clinic offered mechanotherapeutic exercises using pulley machines to improve shoulder mobility.","zh":"这家诊所提供使用滑轮器械的机械疗法训练，以改善肩关节活动度。"},{"en":"Mechanotherapeutic methods were discussed alongside massage and heat therapy.","zh":"人们在讨论按摩和热疗的同时，也讨论了机械疗法方法。"}]}],"synonyms":["mechanotherapeutical","device-assisted (rehabilitation)","mechanotherapy-based","physical-therapy (contextual)"],"phonetic":"/ˌmɛkənoʊˌθɛrəˈpjuːtɪk/","extraExplanation":["“mechanotherapeutic”多见于医学/康复学术写作，日常英语里更常用的表达是“physical therapy (PT) using machines/devices”或“device-assisted rehabilitation”。","词形拆解：mechano-（机械的）+ therapeutic（治疗的）。它强调“借助机械装置或机械原理的治疗”，而不一定指“药物治疗”。"]}
{"word":"mechanotherapeutical","summary":{"en":"related to treatment using mechanical methods or devices","zh":"与使用机械方式或器械进行治疗有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the treatment of disease or injury by mechanical methods (such as massage, exercise therapy, stretching, traction, or therapeutic devices).","zh":"与“机械疗法/力学疗法”有关的；指用按摩、运动训练、牵引或器械等机械方式来治疗疾病或损伤的。"},"examples":[{"en":"The clinic offers mechanotherapeutical rehabilitation after knee surgery.","zh":"这家诊所提供膝关节手术后的机械疗法康复训练。"},{"en":"Mechanotherapeutical exercises helped restore her shoulder mobility.","zh":"机械疗法训练帮助她恢复了肩部活动度。"}]}],"synonyms":["mechanotherapeutic","mechanotherapy-related","physical-therapy","rehabilitative","therapeutic"],"phonetic":"/ˌmɛkənoʊˌθɛrəˈpjuːtɪkəl/","extraExplanation":["这是一个非常少见、偏医学史/康复领域的词。在现代英文中，通常用 mechanotherapy（名词）或 mechanotherapeutic（形容词），很多时候也会直接用 physical therapy / physiotherapy（物理治疗/理疗）、manual therapy（手法治疗）、therapeutic exercise（治疗性运动）等更常用表达。"],"etymology":"来自 mechanotherapy（机械疗法/力学疗法）：mechano-（机械的）+ therapy（治疗）。mechanotherapeutical 是较少见的形容词形式，更常见的是 mechanotherapeutic。","mnemonic":["拆分记：mechano（机械）+ therapy（治疗）→ “用机械/器械来治疗”。","联想“mechanical（机械的）+ therapeutic（治疗的）”→ 两者合体就是“机械治疗相关的”。"]}
{"word":"mechanotherapeutics","summary":{"en":"Mechanotherapeutics means treating health problems using mechanical methods like massage, exercise, or devices.","zh":"mechanotherapeutics 指用按摩、运动或器械等机械手段进行治疗的“机械疗法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use of mechanical methods (such as massage, therapeutic exercise, stretching, or devices) to treat illness or injury; mechanical therapy","zh":"机械疗法；利用按摩、治疗性运动、牵拉或器械等“机械手段”来治疗疾病或损伤"},"examples":[{"en":"After the operation, the doctor recommended mechanotherapeutics to restore shoulder movement.","zh":"手术后，医生建议用机械疗法来恢复肩关节活动度。"},{"en":"In older medical texts, mechanotherapeutics often included massage and carefully guided exercises.","zh":"在较早的医学文献中，机械疗法常包括按摩和循序渐进的指导性运动。"}]}],"synonyms":["mechanotherapy","physical therapy","physiotherapy","rehabilitation therapy"],"phonetic":"/ˌmɛkənoʊˌθɛrəˈpjuːtɪks/","extraExplanation":["这是一个较少见、偏“旧式医学/学术”用语。现代更常用的相关表达包括 physical therapy（物理治疗/康复治疗）、physiotherapy（英式常用）、rehabilitation therapy（康复治疗），以及更具体的 massage therapy（按摩治疗）、therapeutic exercise（治疗性运动）、mechanical traction（机械牵引）等。","词形上可拆解为 mechano-（机械的）+ therapeutics（治疗学/疗法）。在19世纪末到20世纪早期的医疗语境里，它常与“瑞典体操/医学体操”等康复训练体系一起出现，强调通过运动、手法或器械来改善功能。"]}
{"word":"mechanotherapies","summary":{"en":"Mechanotherapies are treatments that use machines, devices, or mechanical forces to aid healing and rehabilitation.","zh":"mechanotherapies 指利用器械或机械力来促进治疗与康复的疗法（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"treatments that use mechanical means (machines, devices, or physical forces like pressure and movement) to help heal, rehabilitate, or improve body function.","zh":"利用机械方式（机器、器械或压力、牵引、运动等物理力）来治疗、康复或改善身体功能的疗法。"},"examples":[{"en":"After knee surgery, mechanotherapies like continuous passive motion can support early rehabilitation.","zh":"膝关节手术后，像“持续被动运动”这类机械疗法可帮助早期康复。"},{"en":"The clinic combines exercise with mechanotherapies such as traction and pneumatic compression.","zh":"这家诊所将运动训练与牵引、气压加压等机械疗法结合起来。"}]}],"synonyms":["mechanotherapy","physical therapy (broader)","rehabilitation therapy (broader)","device-based therapy"],"phonetic":"/ˌmɛkənoʊˈθɛrəpiz/","extraExplanation":["“mechanotherapies”是复数形式，单数为“mechanotherapy”。在医学与物理治疗语境中，它常用作较偏学术/专业的总称，涵盖牵引、压力/加压装置、康复训练器械、被动运动机等以“机械力”作用于身体的治疗方式。","词根“mechano-”表示“机械的/与机械力有关”，与“mechanical（机械的）”“mechanism（机制）”同源；“-therapy”表示“疗法”。"]}
{"word":"mechanotherapist","summary":{"en":"A mechanotherapist is a practitioner who treats patients using mechanical methods (exercise, massage, or devices) to improve function.","zh":"mechanotherapist 指使用运动、按摩或器械等“机械性方法”进行康复治疗、改善功能的治疗师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A healthcare practitioner who treats patients using mechanotherapy—therapy based on mechanical methods such as therapeutic exercise, massage techniques, or mechanical devices to improve movement and function.","zh":"机械疗法治疗师；使用“机械疗法”（如治疗性运动、手法按摩或机械装置等机械性方法）来改善活动能力与功能的医疗/康复从业者。"},"examples":[{"en":"After his injury, he worked with a mechanotherapist to rebuild strength and mobility.","zh":"受伤后，他在机械疗法治疗师的帮助下恢复力量和活动能力。"},{"en":"In that clinic, the mechanotherapist used exercise equipment and manual techniques to ease the patient’s stiffness.","zh":"在那家诊所里，机械疗法治疗师结合器械训练和手法技术来缓解患者的僵硬。"}]}],"synonyms":["physical therapist","physiotherapist","rehabilitation therapist"],"phonetic":"/ˌmɛkənoʊˈθɛrəpɪst/","extraExplanation":["“mechanotherapist”较偏历史/专业用语：19世纪末到20世纪早期在部分国家更常见，常与当时兴起的“mechanotherapy（机械疗法）”和早期物理治疗、康复训练的发展有关。现代英语里更常用的说法通常是“physical therapist（物理治疗师）/physiotherapist（英式更常见）”或更具体的“rehabilitation therapist（康复治疗师）”。","词形拆解：mechano-（机械的）+ therapist（治疗师）。读到旧文献或医学史材料时更容易遇到该词。"]}
{"word":"mechanotherapists","summary":{"en":"Mechanotherapists are therapists who treat patients using mechanical methods or devices, especially in rehabilitation.","zh":"mechanotherapists 指使用器械或机械性方法进行康复与治疗的治疗师（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a therapist (often a physical therapist) who uses mechanical methods or devices—such as exercise machines, braces, traction, or massage tools—to help treat injury, pain, or movement problems","zh":"（常指物理治疗师）使用机械性方法或器械（如训练器材、支具、牵引装置、按摩工具等）来治疗损伤、疼痛或运动功能问题的治疗师"},"examples":[{"en":"The clinic hired mechanotherapists to help patients recover strength after surgery.","zh":"诊所聘请了机械治疗师，帮助患者在术后恢复力量。"},{"en":"Mechanotherapists designed a safe exercise program using resistance machines and stretching devices.","zh":"机械治疗师使用阻力训练器械和拉伸装置设计了一套安全的训练方案。"}]}],"synonyms":["physical therapists","physiotherapists","rehabilitation therapists"],"phonetic":"/ˌmɛkənoʊˈθɛrəpɪsts/","extraExplanation":["“mechanotherapists”是复数形式，单数是“mechanotherapist”。这个词在现代英语里相对少见，更常见的相关职业名称是“physical therapist (PT)（物理治疗师）”或更宽泛的“physiotherapist”。","词根提示：mechano- 表示“机械的、器械的”，-therapist 表示“治疗师”。合起来强调“借助器械/机械方法的治疗”。在一些历史语境中，它可能与19世纪末到20世纪初流行的“mechanotherapy（机械疗法）”有关。"]}
{"word":"mechanotheraputic","summary":{"en":"Mechanotherapeutic means relating to therapy using mechanical methods or devices, and it is usually spelled “mechanotherapeutic.”","zh":"mechanotherapeutic 指与使用机械方法或器械进行治疗有关（你输入的 mechanotheraputic 通常是拼写误差）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(usually spelled “mechanotherapeutic”) relating to treatment that uses mechanical methods or devices (such as massage machines, exercise equipment, braces, or therapeutic movement).","zh":"（通常拼作“mechanotherapeutic”）指使用机械方法或器械进行治疗的；如借助按摩设备、运动器材、支具或治疗性动作来改善功能与症状。"},"examples":[{"en":"The clinic offers mechanotherapeutic exercises to help patients regain strength after surgery.","zh":"这家诊所提供机械治疗性训练，帮助患者在手术后恢复力量。"},{"en":"A mechanotherapeutic device was used to support the patient’s wrist during rehabilitation.","zh":"康复期间使用了一种机械治疗装置来支撑患者的手腕。"}]}],"synonyms":["physical-therapy-related","rehabilitative","therapeutic","mechanical"],"phonetic":"/ˌmɛkənoʊˌθɛrəˈpjuːtɪk/","extraExplanation":["你输入的“mechanotheraputic”常见为拼写错误；更常见、较标准的拼法是“mechanotherapeutic”。","该词多见于医学/康复学语境，强调“借助机械力或器械进行治疗”，与更常用的“physical therapy（物理治疗）”“rehabilitation（康复）”语域接近，但它更突出“机械装置/机械作用”的手段。"]}
{"word":"mechanotheraputically","summary":{"en":"Mechanotherapeutically means “in a way that uses mechanical or physical methods as treatment.”","zh":"mechanotherapeutically 指“以机械/物理方法进行治疗地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to treatment using physical or mechanical methods (such as massage, exercise, or therapeutic devices).","zh":"以机械治疗/物理机械方法进行的；指通过按摩、运动训练或治疗器械等方式来进行治疗。"},"examples":[{"en":"After the injury, the therapist worked with her mechanotherapeutically using gentle resistance exercises.","zh":"受伤后，治疗师以机械治疗的方式，用轻柔的抗阻练习帮助她康复。"},{"en":"The clinic treats some joint problems mechanotherapeutically rather than with medication.","zh":"这家诊所对某些关节问题主要采用机械治疗方式，而不是用药。"}]}],"synonyms":["physically","therapeutically","through physical therapy","by therapeutic exercise"],"phonetic":"/ˌmɛkənoʊˌθɛrəˈpjuːtɪkli/","extraExplanation":["你输入的拼写“mechanotheraputically”更常见的标准拼写是 mechanotherapeutically（中间是 -therapeut-）。","这个词在日常英语里很少见，更常见的表达是: with physical therapy / through therapeutic exercise / using mechanical therapy devices 等。","mechanotherapy（机械治疗）在医学语境中通常指用器械、手法或运动等“物理/机械力量”来辅助康复；不同科室（康复医学、骨科、运动医学）用法可能略有差异。"]}
{"word":"mechanotherapy","summary":{"en":"Mechanotherapy is therapy that uses mechanical force or physical techniques (e.g., massage, stretching, devices) to aid healing and restore movement.","zh":"mechanotherapy 指利用机械力或物理手段（如按摩、牵伸、器械等）来促进康复、恢复功能的治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Treatment that uses mechanical force or physical methods (such as massage, stretching, exercise devices, or braces) to improve movement, reduce pain, or help the body heal.","zh":"机械疗法：利用机械力或物理方式（如按摩、牵伸、运动器械、支具等）来改善活动能力、减轻疼痛或促进康复的治疗方法。"},"examples":[{"en":"After the knee surgery, her rehab program included mechanotherapy like guided stretching and resistance exercises.","zh":"膝盖手术后，她的康复计划包含机械疗法，例如指导性牵伸和阻力训练。"},{"en":"The therapist used mechanotherapy to increase the patient’s range of motion in the shoulder.","zh":"治疗师使用机械疗法来增加患者肩关节的活动范围。"}]}],"synonyms":["physical therapy","physiotherapy","rehabilitation therapy","therapeutic exercise","manual therapy"],"phonetic":"/ˌmɛkənoʊˈθɛrəpi/","extraExplanation":["该词多见于康复医学、物理治疗（physical therapy）或运动医学语境。它强调“通过机械刺激/力学负荷来促进功能恢复”，例如关节活动训练、牵引、器械训练、按摩等。日常英语里更常用的说法通常是 physical therapy / physiotherapy（物理治疗）或 rehabilitation（康复）。","构词法：mechano-（机械的、力学的）+ therapy（治疗）。发音中重音常落在“THAIR”（-therapy）部分。"]}
{"word":"mechanotherapy-based","summary":{"en":"Based on mechanotherapy (therapy using mechanical forces or devices).","zh":"以机械疗法（利用机械力或器械进行治疗）为基础的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed around, derived from, or using mechanotherapy (treatment that uses mechanical forces or devices, such as exercise equipment, manual techniques, or therapeutic machines).","zh":"以机械疗法为基础的；基于机械疗法设计或采用机械力/器械进行治疗的。"},"examples":[{"en":"The clinic introduced a mechanotherapy-based program for shoulder rehabilitation.","zh":"这家诊所推出了一个以机械疗法为基础的肩部康复项目。"},{"en":"Mechanotherapy-based exercises helped improve his range of motion after surgery.","zh":"术后，以机械疗法为基础的训练帮助他改善了关节活动范围。"},{"en":"Researchers compared mechanotherapy-based care with standard physical therapy.","zh":"研究人员比较了机械疗法为基础的治疗与标准物理治疗的效果。"}]}],"synonyms":["mechanotherapy-driven","mechanotherapy-centered","device-based","exercise-based","biomechanics-based"],"phonetic":"/ˌmɛkənoʊˈθɛrəpi beɪst/","extraExplanation":["mechanotherapy 通常指利用“机械刺激/机械负荷”（如牵伸、抗阻训练、器械训练、手法带来的力学作用等）来促进组织修复与功能恢复；在论文里 mechanotherapy-based 往往用来强调干预机制偏“力学/负荷驱动”。","写作中常见搭配：mechanotherapy-based rehabilitation/training/intervention/protocol/program。"],"etymology":"由 mechanotherapy（mechan- “机械的” + -therapy “治疗”）与 based（“以……为基础的”）构成的复合形容词。常见于康复医学、物理治疗与运动医学语境，用来说明“方案/训练/干预”主要依托机械力、器械或结构化运动刺激。","mnemonic":["拆开记：mechano- = 机械（联想“mechanic 机械师”）+ therapy = 治疗；mechanotherapy-based 就是“靠机械/力学治疗为基础的”。","把 based 理解成“站在……之上”：站在 mechanotherapy（机械疗法）之上的方案=以机械疗法为基础。"]}
{"word":"mechant","summary":{"en":"Merchant means a person/company that buys and sells goods; it can also describe business services for sellers.","zh":"Merchant 指买卖商品的商人/商家；也可作形容词表示“商家的/商户相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that buys and sells goods, especially in large amounts","zh":"商人；（尤指大量买卖货物的）商家；商号"},"examples":[{"en":"The merchant sells spices and tea to restaurants.","zh":"这位商家把香料和茶卖给餐馆。"},{"en":"In the past, merchants traveled by ship to trade overseas.","zh":"过去，商人常乘船出海做贸易。"}]},{"partOfSpeech":"adj.","definition":{"en":"(business) relating to buying and selling goods; used to describe services or accounts for sellers","zh":"（商业）商家的；用于描述商户服务或商家账户的"},"examples":[{"en":"Please contact our merchant support team if you have a payment issue.","zh":"如果你遇到支付问题，请联系我们的商家支持团队。"},{"en":"You can open a merchant account to accept card payments.","zh":"你可以开通商家账户以接受刷卡付款。"}]}],"synonyms":["trader","dealer","seller","businessperson"],"phonetic":"/ˈmɝːtʃənt/","extraExplanation":["你输入的 **mechant** 很可能是拼写错误；英语常见正确拼写是 **merchant**。","另外，法语里 **méchant**（带重音）意思是“坏的/刻薄的”，与英语 **merchant**（商人）不是同一个词。"]}
{"word":"mechatronic","summary":{"en":"combining mechanical parts with electronics and computer control","zh":"机械与电子及计算机控制相结合的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to systems or devices that combine mechanics, electronics, and computer control (often used in robotics and automated machines).","zh":"与机电一体化有关的；指把机械、电子与计算机控制结合在一起的（常见于机器人与自动化设备）。"},"examples":[{"en":"The company builds mechatronic systems for factory automation.","zh":"这家公司为工厂自动化制造机电一体化系统。"},{"en":"A mechatronic arm can sense force and adjust its movement in real time.","zh":"机电一体化机械臂能感知力并实时调整动作。"},{"en":"She’s taking a course on mechatronic design for robots.","zh":"她正在上机器人机电一体化设计课程。"}]}],"synonyms":["electromechanical","robotic","automated","cyber-physical"],"phonetic":"ˌmɛkəˈtrɑnɪk","extraExplanation":["在中文语境里常对应“机电一体化”。它强调的不只是“机械+电”，还包括传感器、控制算法与嵌入式软件，因此在机器人、数控机床、无人机、智能家电中很常见。"],"etymology":"由 mechanics（机械）+ electronics（电子）组合而来，相关领域名词常写作 mechatronics（机电一体化/机电工程）。形容词 mechatronic 用来描述这种“机械+电子+控制/计算”的综合系统。","mnemonic":["把它拆开记：mecha-（机械/机甲）+ -tronic（电子/电子化），合起来就是“机械+电子+控制”的感觉。","联想中文“机电一体化”：机(机械) + 电(电子) + 控制(程序)。"]}
{"word":"mechatronics","summary":{"en":"engineering that integrates mechanics, electronics, and computer control","zh":"融合机械、电子与计算机控制的工程领域"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an engineering field that combines mechanics, electronics, computer control, and systems design to create and improve smart machines and products","zh":"机电一体化（工程领域）：结合机械、电子、计算机控制与系统设计，用来设计与改进智能机器与产品"},"examples":[{"en":"Mechatronics is used to build robots and automated production lines.","zh":"机电一体化用于制造机器人和自动化生产线。"},{"en":"She studied mechatronics to work in automotive and robotics industries.","zh":"她学习机电一体化，想进入汽车与机器人行业工作。"},{"en":"A modern washing machine is a mechatronics product: motors, sensors, and software work together.","zh":"现代洗衣机就是机电一体化产品：电机、传感器和软件协同工作。"}]}],"synonyms":["automation engineering","electromechanical engineering","robotics","control engineering","systems engineering"],"phonetic":"/ˌmɛkəˈtrɑnɪks/","extraExplanation":["常见应用包括：工业机器人、无人机、智能家电、自动化仓储设备、汽车的ABS/ESP等控制系统。","学习内容常涵盖：机械设计、传感器与执行器（电机/气缸）、电路与嵌入式系统、控制理论（如PID）、编程与系统集成。","和 robotics（机器人学）关系密切：机器人学更聚焦“机器人”本身；机电一体化范围更广，很多“智能设备”都算。"],"etymology":"由 mechanics（机械）+ electronics（电子）组合而来；20世纪后期在工程领域逐渐固定为一个术语，用来强调“跨学科整合”的设计方法。","mnemonic":["把它拆开记：mecha-（机械）+ -tronics（电子/电气），就是“机械+电子=机电一体化”。","联想中文“机电”：看到带传感器、马达、程序控制的设备，就想到 mechatronics。"]}
{"word":"Mechelen","summary":{"en":"A Flemish city in northern Belgium between Brussels and Antwerp.","zh":"比利时北部弗拉芒地区、位于布鲁塞尔与安特卫普之间的城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Flanders (northern Belgium), located between Brussels and Antwerp; known for its historic architecture, carillon (bell) tradition, and as an important ecclesiastical center.","zh":"梅赫伦（比利时北部弗拉芒地区城市），位于布鲁塞尔与安特卫普之间；以历史建筑、钟琴（钟楼敲钟）传统及重要天主教教区地位闻名。"},"examples":[{"en":"We stopped in Mechelen on the train ride from Brussels to Antwerp.","zh":"我们从布鲁塞尔坐火车去安特卫普的路上，在梅赫伦停了一站。"},{"en":"Mechelen’s cathedral tower is famous for its carillon concerts.","zh":"梅赫伦的大教堂塔楼以钟琴音乐会而闻名。"},{"en":"She studied in Mechelen for a semester and loved the quiet old town.","zh":"她在梅赫伦学习了一个学期，很喜欢那座安静的古城。"}]}],"synonyms":["Malines"],"phonetic":"/ˈmɛkələn/","extraExplanation":["发音提示：荷兰语中常读作更接近 /ˈmɛxələ(n)/（含类似“h/kh”的摩擦音），但英语里常用近似读法 /ˈmɛkələn/。","文化小知识：梅赫伦在历史上与勃艮第-哈布斯堡尼德兰宫廷政治有关；今天也因“梅赫伦钟琴学校”（carillon school）与钟琴文化而广为人知。"],"etymology":"源自荷兰语地名 Mechelen；法语旧称为 Malines（马利讷）。中世纪文献中该地名有多种拼写形式，后逐渐固定为现代写法。","mnemonic":["可联想中文音译“梅-赫-伦”，三段读起来像在报站：梅(美)→赫(很)→伦(轮)，记住是比利时城市名。","把它拆成 Mech + elen：像“mechanical（机械）”的 mech，联想“钟楼机械装置敲钟”，对应其钟琴传统。"]}
{"word":"mechir","summary":{"en":"“mechir” isn’t a standard English word; it likely needs context or corrected spelling.","zh":"“mechir”不是标准英语词；很可能需要上下文或纠正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语单词；可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “mechir” in standard English dictionaries—could you tell me where you saw it?","zh":"我在常见英语词典里查不到“mechir”——你能告诉我你在哪里看到的吗？"},{"en":"If you meant “mechanic,” the spelling is different.","zh":"如果你想写的是“mechanic（机械师）”，拼写会不一样。"}]}],"extraExplanation":["“mechir”更像是拼写误差或专有名词。你可以把原句（包含前后文）发我，或告诉我它来自哪本书/哪段字幕/哪个游戏，我就能更准确判断。","常见的相近拼写（仅供排查）：mechanic（机械师/技工）、mecher（部分语言里的词形）、mechir（可能的人名/地名转写）。"]}
{"word":"Mechitarist","summary":{"en":"a monk or member of an Armenian Catholic scholarly order","zh":"亚美尼亚天主教学术修会的修士或成员"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mechitarist Order, an Armenian Catholic monastic congregation known especially for scholarship, printing, and preserving Armenian language and culture","zh":"梅希塔会（亚美尼亚天主教修会）成员；以学术研究、出版印刷与保存亚美尼亚语言文化著称的修会修士"},"examples":[{"en":"A Mechitarist monk helped publish early Armenian dictionaries and historical texts.","zh":"一位梅希塔会修士曾协助出版早期的亚美尼亚语词典与历史文献。"},{"en":"The library on San Lazzaro island is associated with the Mechitarists and their scholars.","zh":"圣拉扎罗岛上的图书馆与梅希塔会及其学者群体有关。"}]}],"synonyms":["Armenian Catholic monk","member of the Mechitarist Order"],"phonetic":"/mɛkˈɪtərɪst/","extraExplanation":["梅希塔会（Mechitarists）是一个亚美尼亚礼天主教修会，以教育与学术闻名；历史上在威尼斯的圣拉扎罗岛（San Lazzaro degli Armeni）与维也纳等地设有重要修院与出版机构。","在英语语境里，Mechitarist 常用于历史、宗教研究或图书馆/出版史相关文本中，多指“该修会的修士/学者”。"],"etymology":"来自亚美尼亚语人名“Մխիթար / Mekhitar（意为‘安慰者’）”，指17–18世纪创立该修会的梅希塔尔（Mekhitar of Sebaste）；英语后缀 -ist 表示“某团体/思想的成员”。","mnemonic":["把它拆成“Mechitar + -ist”：-ist = “某派/某组织的人”，所以整体就是“梅希塔尔这一派的人”。","联想“mechanic（机械师）”的开头 mech-：虽然意思无关，但能帮助记住拼写以 M-e-c-h 开头。"]}
{"word":"Mechitaristic","summary":{"en":"connected with the Armenian Catholic Mekhitarist congregation and its scholarly tradition","zh":"与亚美尼亚天主教米希塔里会及其学术传统有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Mechitarists (Mekhitarists), an Armenian Catholic monastic congregation founded by Mekhitar of Sebaste and known for scholarship, printing, and preserving Armenian language and culture.","zh":"与“米希塔里会（梅希塔里会）”有关的；指由塞巴斯特的梅希塔尔创立的亚美尼亚天主教修会，尤以学术研究、出版印刷与保存亚美尼亚语言文化著称。"},"examples":[{"en":"The library’s Mechitaristic collections include rare Armenian manuscripts and early printed books.","zh":"这座图书馆的米希塔里会相关馆藏包括罕见的亚美尼亚手稿和早期印刷书籍。"},{"en":"Her research focuses on Mechitaristic scholarship in Venice during the eighteenth century.","zh":"她的研究聚焦于十八世纪威尼斯的米希塔里会学术传统。"}]}],"synonyms":["Mekhitarist","Mechitarist","Armenian Catholic"],"phonetic":"/ˌmɛkɪtəˈrɪstɪk/","extraExplanation":["“Mechitarists / Mekhitarists（米希塔里会/梅希塔里会）”是亚美尼亚天主教的修会团体，历史上以在威尼斯圣拉扎罗岛（San Lazzaro degli Armeni）等地的出版、教育与语言文化保存工作而闻名。学术写作里也常见拼写 Mekhitarist（更常用）与 Mechitarist（变体）。"],"etymology":"源自专名 Mechitar / Mekhitar（梅希塔尔，为修会创始人之名）+ 英语形容词后缀 -istic（表示“与……有关的、具有……特征的”）。该词多见于历史、宗教与文献研究语境中。","mnemonic":["把 -istic 记成“某某风格/体系”：Mechitar + istic ≈ “梅希塔尔体系的、米希塔里会相关的”。","联想“印刷出版与学术”：看到 Mechitaristic，就想到修会以书籍、辞典、研究著称。"]}
{"word":"mechitaristican","summary":{"en":"“Mechitaristican” means “related to the Mechitarists,” an Armenian Catholic scholarly monastic order.","zh":"“Mechitaristican”意为“与米希塔里会有关的”，指一个以学术与文化保存著称的亚美尼亚天主教修会。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Mechitarists, an Armenian Catholic monastic congregation known for scholarship, printing, and preserving Armenian language and culture.","zh":"与“米希塔里会”（Mechitarists）有关的；指一个以学术研究、印刷出版、以及保存亚美尼亚语言与文化闻名的亚美尼亚天主教修会。"},"examples":[{"en":"A Mechitaristican press published many important Armenian dictionaries and histories.","zh":"米希塔里会的印刷所出版了许多重要的亚美尼亚语词典和历史著作。"},{"en":"She studies Mechitaristican manuscripts to understand how Armenian texts were preserved in Europe.","zh":"她研究米希塔里会的手稿，以了解亚美尼亚文本如何在欧洲得以保存。"}]}],"synonyms":["Mechitarist","Mechitaristic","Armenian Catholic (context-dependent)"],"phonetic":"/məˈkɪtəˌrɪstɪkən/","extraExplanation":["这个词非常少见，常见形式更可能是 **Mechitarist**（名词/形容词：米希塔里会成员；与米希塔里会有关的）或 **Mechitaristic**（形容词：米希塔里会式的/与其传统相关的）。你输入的 **mechitaristican** 可能是拼写变体或误写。","米希塔里会由 Mechitar（米希塔尔）在18世纪创立，著名分支长期在威尼斯的圣拉扎罗岛（San Lazzaro degli Armeni）与维也纳活动，对亚美尼亚学、印刷出版与文化保存影响很大。"]}
{"word":"mechitzah","summary":{"en":"Mechitzah means a partition—most commonly the screen separating men and women in an Orthodox synagogue, and sometimes any divider (literal or figurative).","zh":"Mechitzah 指“隔断/屏风”，最常见的是正统派犹太会堂中分隔男女的隔板；也可泛指任何（字面或比喻的）分隔物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A partition or screen (especially in an Orthodox Jewish synagogue) that separates men and women during prayer.","zh":"（尤指正统派犹太会堂中的）隔板/屏风，用来在祈祷时分隔男女。"},"examples":[{"en":"In many Orthodox synagogues, a mechitzah separates the men’s and women’s sections.","zh":"在许多正统派犹太会堂里，会用 mechitzah 把男区和女区分开。"},{"en":"They chose a synagogue with a mechitzah because that style of worship felt familiar to them.","zh":"他们选择了有 mechitzah 的会堂，因为这种礼拜方式让他们感到熟悉。"}]},{"partOfSpeech":"n.","definition":{"en":"Any barrier or divider, sometimes used figuratively to mean a separation between people or groups.","zh":"（引申）任何障碍物/分隔物；也可比喻人与人或群体之间的隔阂。"},"examples":[{"en":"Language can become a mechitzah that keeps communities apart.","zh":"语言可能会成为一种“mechitzah”，让不同社群彼此隔开。"},{"en":"They tried to remove the social mechitzah between longtime residents and newcomers.","zh":"他们试图消除老居民与新来者之间的社会隔阂（mechitzah）。"}]}],"synonyms":["partition","divider","screen","barrier"],"phonetic":"/mɛˈxɪt.sə/","extraExplanation":["该词来自希伯来语 מְחִיצָה（mechitzah），本义是“隔墙、隔断”。在犹太宗教语境中，它常指会堂里用于男女分区的实体隔板或帘幕。不同犹太社群对是否设置、以及隔断高度与形式的做法不完全一致；在一些自由派/改革派会堂通常不使用。","在英语文章里也可能看到拼写变体：mechitza、mechitza(h)。"]}
{"word":"mechitzoth","summary":{"en":"“Mechitzoth” means partitions (plural), especially the divider in some Orthodox synagogues separating men and women.","zh":"“Mechitzoth”指“隔板/隔断”（复数），尤指一些正统派犹太会堂中分隔男女的隔屏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) plural of “mechitza”: partitions or dividers, especially the screen/wall used in some Orthodox synagogues to separate men and women during prayer.","zh":"（犹太教）“mechitza”的复数：隔板、隔断；尤指一些正统派犹太会堂里用来在祈祷时分隔男女的隔屏或隔墙。"},"examples":[{"en":"In some Orthodox synagogues, mechitzoth separate the men’s and women’s sections.","zh":"在一些正统派犹太会堂里，mechitzoth 用来分隔男区和女区。"},{"en":"The community debated whether to keep the mechitzoth for the new sanctuary design.","zh":"社区讨论新会堂的设计是否要保留这些 mechitzoth（隔屏）。"}]}],"synonyms":["partitions","dividers","screens"],"phonetic":"/məˈhɪt.səθ/","extraExplanation":["这是从希伯来语/意第绪语借入英语的词，多见于宗教与文化语境。英语里也常见拼写变体 **mechitzot / mechitzos / mechitzas**（都表示复数），单数是 **mechitza**。在日常英语中一般不会用它来指普通“隔断”，更多是特指犹太会堂的那种隔屏。"]}
{"word":"mechlin","summary":{"en":"Mechlin is an older English name for the Belgian city of Mechelen, and it can also refer to the fine “Mechlin lace” associated with that city.","zh":"Mechlin 是比利时城市 Mechelen（梅赫伦）的旧英文名，也可指与该城相关的精细手工“Mechlin 花边”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mechlin: an older English name for the Belgian city of Mechelen, sometimes used in historical writing.","zh":"Mechlin：比利时城市 Mechelen（梅赫伦）的旧英文名称，常见于历史语境。"},"examples":[{"en":"The treaty was signed at Mechlin in the 16th century.","zh":"这项条约在16世纪于 Mechlin（梅赫伦）签署。"},{"en":"Some older books call the city Mechlin rather than Mechelen.","zh":"一些较早的书会用 Mechlin 来称呼这座城市，而不是 Mechelen。"}]},{"partOfSpeech":"n.","definition":{"en":"Mechlin (lace): a fine type of handmade lace traditionally associated with Mechlin/Mechelen, Belgium.","zh":"Mechlin（花边）：一种精细的手工花边，传统上与比利时的 Mechlin/Mechelen（梅赫伦）有关。"},"examples":[{"en":"She wore a veil trimmed with Mechlin lace.","zh":"她戴的面纱边缘饰有 Mechlin 花边。"},{"en":"Collectors value antique Mechlin lace for its delicate patterns.","zh":"收藏家珍视古董 Mechlin 花边，因为它的纹样非常精致。"}]}],"synonyms":["Mechelen","Mechlin lace"],"phonetic":"/ˈmɛklɪn/","extraExplanation":["“Mechlin”是英语里较旧的地名写法，常出现在历史、艺术史、旧地图或古籍中；现代更常用荷兰语形式“Mechelen”。","在纺织与服饰史里，“Mechlin lace”与17–18世纪欧洲上层服装（领口、袖口、头纱等）联系紧密，因此在文学或历史小说中偶尔作为“精致、昂贵、上流品味”的象征出现。"]}
{"word":"mechlorethamine","summary":{"en":"Mechlorethamine is a nitrogen-mustard chemotherapy drug, used either by injection (often in combinations) or as a topical gel for certain lymphomas.","zh":"美氯乙胺是一种氮芥类化疗药，可用于注射（常见于联合方案）或作为外用凝胶治疗某些淋巴瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemotherapy drug (a nitrogen mustard) used to treat certain cancers, such as lymphoma; it damages cancer cells’ DNA to stop them from growing","zh":"一种化疗药物（氮芥类），用于治疗某些癌症（如淋巴瘤）；通过破坏癌细胞的DNA来抑制其生长"},"examples":[{"en":"Mechlorethamine is sometimes used as part of combination chemotherapy for lymphoma.","zh":"美氯乙胺有时作为联合化疗方案的一部分用于治疗淋巴瘤。"},{"en":"Because it can irritate skin and tissues, mechlorethamine must be handled carefully by medical staff.","zh":"由于它可能刺激皮肤和组织，医护人员必须小心处理美氯乙胺。"}]},{"partOfSpeech":"n.","definition":{"en":"a topical (skin-applied) form used for some skin lymphomas, such as mycosis fungoides (a type of cutaneous T‑cell lymphoma)","zh":"一种外用（涂抹皮肤）的制剂，用于某些皮肤淋巴瘤，例如蕈样肉芽肿（皮肤T细胞淋巴瘤的一种）"},"examples":[{"en":"The doctor prescribed topical mechlorethamine gel for the patient’s cutaneous T‑cell lymphoma.","zh":"医生为患者的皮肤T细胞淋巴瘤开具了美氯乙胺凝胶外用药。"},{"en":"Patients using mechlorethamine on the skin should follow instructions to reduce irritation.","zh":"外用美氯乙胺的患者应遵医嘱使用，以减少刺激反应。"}]}],"synonyms":["mustine","mechlorethamine hydrochloride","nitrogen mustard"],"phonetic":"/ˌmɛkˌlɔːrˈɛθəˌmiːn/","extraExplanation":["“Mechlorethamine”常被称为“氮芥（nitrogen mustard）”类药物之一，名称中的“-amine（胺）”提示其含氮的有机化学结构。","它属于烷化剂（alkylating agent）一类抗癌药：通过与DNA发生反应来阻止细胞分裂，因此对快速分裂的癌细胞更敏感，但也可能影响正常细胞。","该药与“芥子气”相关的化学家族在历史上曾被研究；在医学语境中应理解为经过严格监管的处方药物，用于治疗目的，切勿自行接触或使用。"]}
{"word":"mechoacan","summary":{"en":"“Mechoacan” is usually a misspelling of “Michoacán,” a state in western Mexico.","zh":"“mechoacan”通常是对“Michoacán（米却肯州）”的误拼；米却肯州位于墨西哥西部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Michoacán: a state in western Mexico, on the Pacific coast (capital: Morelia).","zh":"米却肯州：墨西哥西部、濒临太平洋的一个州（首府：莫雷利亚）。"},"examples":[{"en":"Morelia is the capital city of Michoacán.","zh":"莫雷利亚是米却肯州的首府。"},{"en":"They traveled through Michoacán to see the Monarch butterfly migration.","zh":"他们穿越米却肯州去看帝王蝶迁徙。"}]},{"partOfSpeech":"other","definition":{"en":"A common misspelling of “Michoacán.” (Correct spelling includes the accent: Michoacán.)","zh":"“Michoacán（米却肯）”的常见拼写错误。（正确拼写带重音符号：Michoacán。）"},"examples":[{"en":"I wrote “mechoacan,” but the correct form is “Michoacán.”","zh":"我写成了“mechoacan”，但正确写法是“Michoacán”。"}]}],"synonyms":["Michoacán de Ocampo"],"phonetic":"/ˌmiːtʃoʊəˈkɑːn/","extraExplanation":["“Michoacán”来自纳瓦特尔语（Nahuatl），常被解释为“渔民之地/拥有鱼的人之地”之类的意思，因此在文化与历史语境里常与湖泊、渔业传统联系在一起。","西班牙语里的重音符号（á）提示重读在最后一音节：Mi-choa-CÁN。英文写作中有时会省略重音符号，但正式文本（尤其是西语语境）建议保留。"]}
{"word":"mechs","summary":{"en":"Large sci‑fi robots or, informally, mechanics.","zh":"科幻机甲；或（口语）修理工/机修人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large humanoid robots or piloted mechanical vehicles, especially in science fiction and video games (plural).","zh":"（复数）机甲；大型人形机器人或有人驾驶的机械载具（多见于科幻/游戏语境）。"},"examples":[{"en":"The game lets you customize different mechs for desert battles.","zh":"这款游戏让你定制不同的机甲来进行沙漠战斗。"},{"en":"The anime’s finale features two mechs fighting above the city.","zh":"那部动画的结局是两台机甲在城市上空对战。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: mechanics—people who repair machines or vehicles (plural).","zh":"（非正式，复数）修理工；机修人员。"},"examples":[{"en":"Ask the mechs to check the engine noise before the trip.","zh":"出发前让修理工检查一下引擎异响。"},{"en":"The mechs finished the inspection in under an hour.","zh":"机修人员不到一小时就完成了检查。"}]}],"synonyms":["mecha","robots","war machines","mechanics","technicians"],"phonetic":"/mɛks/","extraExplanation":["在英语流行文化里，mech/mechs 常指“机甲”而不只是“机械”。在正式写作中，表示“修理工”更常用 mechanics；mechs 更偏口语、行话或特定圈子用法。"],"etymology":"多为缩写：mech ← mechanical / mechanic。科幻语境里也常受日语「メカ（mecha，机械/机甲）」影响而流行。","mnemonic":["把 mech 记成 mechanical 的缩短：看到 mechs 就联想到“很多机械/机甲”。","联想中文“机甲”的“机”：mech ≈ 机械（mechan-）开头的感觉。"]}
{"word":"meck","summary":{"en":"“Meck” is not a common English word; it’s usually a name or a typo for a more common word.","zh":"“Meck”不是常见英文词；通常是人名/地名，或是更常见单词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common use; it most often appears as a name (surname/place name) or as a misspelling of another word.","zh":"不是常见的标准英文单词；更多时候作为人名/地名出现，或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “meck” in my dictionary—did you mean “mock” or “meek”?","zh":"我在词典里找不到“meck”——你是不是想写“mock（嘲笑）”或“meek（温顺的）”？ "},{"en":"Meck is also used as a family name in some contexts.","zh":"在一些语境中，Meck 也会作为姓氏使用。"}]}],"phonetic":"/mɛk/","extraExplanation":["“meck”很可能是拼写误差。常见的可能目标包括：\n- mock（v./n. 嘲弄；模仿）\n- meek（adj. 温顺的；谦和的）\n- neck（n. 脖子）\n- make（v. 制作；使得）\n\n如果你能给我一句完整的英文句子（包含 meck），我可以帮你判断最准确的词。"]}
{"word":"meckelectomy","summary":{"en":"Meckelectomy is surgery to remove a Meckel’s diverticulum.","zh":"Meckelectomy 指切除梅克尔憩室的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove a Meckel’s diverticulum (a small pouch in the small intestine present from birth).","zh":"切除梅克尔憩室（先天性小肠壁小囊状突起）的手术。"},"examples":[{"en":"The surgeon recommended a meckelectomy after repeated bleeding from a Meckel’s diverticulum.","zh":"由于梅克尔憩室反复出血，外科医生建议进行梅克尔憩室切除术。"},{"en":"After imaging confirmed the diagnosis, the patient was scheduled for a meckelectomy.","zh":"影像检查证实诊断后，患者被安排进行梅克尔憩室切除术。"}]}],"synonyms":["Meckel’s diverticulectomy","resection of a Meckel’s diverticulum","diverticulectomy (Meckel’s)"],"phonetic":"/ˌmɛkəlˈɛktəmi/","extraExplanation":["“meckelectomy”在实际医疗英语中较少见，更常见的表达是 **Meckel’s diverticulectomy**（梅克尔憩室切除术）或直接说 **resection of a Meckel’s diverticulum**。","梅克尔憩室源于胚胎期卵黄管残留，很多人终生无症状；但也可能引起出血、炎症、肠梗阻等，从而需要手术切除。","术式有时不仅切除憩室本身，也可能需要切除相邻一段小肠（例如出现溃疡、坏死或基底较宽时），具体取决于病变范围与外科评估。"]}
{"word":"Meckelian","summary":{"en":"related to Meckel or structures named after him","zh":"与梅克尔或以其命名的解剖结构相关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the anatomist Johann Friedrich Meckel and to anatomical structures named after him (especially in embryology and anatomy).","zh":"与解剖学家梅克尔（Johann Friedrich Meckel）及以他命名的解剖结构有关的（尤用于胚胎学与解剖学语境）。"},"examples":[{"en":"The surgeon suspected a Meckelian diverticulum as the source of bleeding.","zh":"外科医生怀疑出血来源是梅克尔憩室（Meckelian diverticulum）。"},{"en":"Meckelian cartilage is an embryonic structure involved in early jaw development.","zh":"梅克尔软骨是参与早期颌部发育的胚胎结构。"}]}],"synonyms":["Meckel's","Meckel-related"],"phonetic":"/mɛˈkiːliən/","extraExplanation":["常见搭配：Meckelian diverticulum（梅克尔憩室，临床上更常写作 Meckel’s diverticulum），是回肠末端先天性小囊状突起，可能引起出血、腹痛或肠梗阻等。","Meckelian cartilage（梅克尔软骨）是胚胎期下颌发育相关的软骨结构；在学习胚胎学/头颈解剖时会遇到。"],"etymology":"源自人名 Meckel（梅克尔），指德国解剖学家 Johann Friedrich Meckel；后缀 -ian 表示“与……有关的、属于……的”，因此 Meckelian 表示“与梅克尔（及其命名结构）相关的”。","mnemonic":["把 Meckelian 记成“Meckel + -ian（……的）”，看到 -ian 就想到“某某相关的”。","联想临床高频点：Meckel’s diverticulum（梅克尔憩室）→ Meckelian diverticulum（同一概念的形容词表达）。"]}
{"word":"meckelian","summary":{"en":"“Meckelian” means related to Meckel or a medical structure named after him, especially Meckel’s diverticulum.","zh":"“Meckelian”意为与梅克尔或以他命名的医学结构有关，尤指梅克尔憩室。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Johann Friedrich Meckel (a German anatomist) or to anatomical/medical structures named after him, especially Meckel’s diverticulum.","zh":"与德国解剖学家约翰·弗里德里希·梅克尔（Johann Friedrich Meckel）有关的；或指以他命名的解剖/医学结构，尤指“梅克尔憩室”（Meckel’s diverticulum）。"},"examples":[{"en":"The surgeon suspected a Meckelian diverticulum as the source of the patient’s bleeding.","zh":"外科医生怀疑患者出血的原因是梅克尔憩室。"},{"en":"A Meckelian scan can help detect ectopic gastric tissue in the small intestine.","zh":"梅克尔扫描可帮助检测小肠内的异位胃黏膜组织。"},{"en":"The report described inflammation near a Meckelian diverticulum.","zh":"报告描述了梅克尔憩室附近的炎症。"}]}],"synonyms":["Meckel’s (as an attributive form, e.g., Meckel’s diverticulum)"],"phonetic":"/mɛˈkiːliən/","extraExplanation":["“Meckelian”多见于医学英语，通常出现在“Meckelian diverticulum（梅克尔憩室）”“Meckelian scan（梅克尔扫描）”等搭配中。","梅克尔憩室是胚胎期卵黄管（vitelline duct）残留导致的小肠憩室；临床上可能无症状，也可能引起出血、腹痛或类似阑尾炎的表现。","由于属于专有名词派生的形容词，日常英语中很少单独使用，更多用于病历、影像学报告和外科/消化科讨论。"]}
{"word":"Mecklenburg","summary":{"en":"a German regional name; also a U.S. county place name","zh":"德国的一个地区名称；也常见于美国的县名等地名"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical region in northern Germany, now mainly part of the German state Mecklenburg-Vorpommern.","zh":"德国北部的历史地区，如今主要属于德国“梅克伦堡-前波美拉尼亚州”的一部分。"},"examples":[{"en":"Mecklenburg is known for its lakes, flat landscapes, and Baltic Sea coast nearby.","zh":"梅克伦堡以湖泊、平坦地形以及邻近波罗的海的海岸而闻名。"},{"en":"After German reunification, Mecklenburg became part of the state Mecklenburg-Vorpommern.","zh":"德国统一后，梅克伦堡成为梅克伦堡-前波美拉尼亚州的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used in the United States, especially for Mecklenburg County in North Carolina (and also Virginia).","zh":"美国的一种地名用法，尤指北卡罗来纳州的梅克伦堡县（也有弗吉尼亚州的同名县）。"},"examples":[{"en":"Charlotte is the largest city in Mecklenburg County, North Carolina.","zh":"夏洛特是北卡罗来纳州梅克伦堡县最大的城市。"},{"en":"She moved to Mecklenburg County for a new job.","zh":"她为了新工作搬到了梅克伦堡县。"}]}],"synonyms":["Mecklenburg-Vorpommern","Mecklenburg County"],"phonetic":"/ˈmɛklənˌbɝɡ/","extraExplanation":["这是典型的“专有名词/地名”，在英文里通常首字母大写。","在美国，许多地名来自欧洲移民带来的旧地名；Mecklenburg 作为县名很常见，最常被提到的是北卡的 Mecklenburg County（夏洛特所在）。"],"etymology":"源自德国地名，来自中古低地德语（Middle Low German）“Mikilinborg”，意为“伟大的城堡/大堡垒”（mikil=大；borg=堡垒、城堡）。后来演变为 Mecklenburg。","mnemonic":["把它拆成 Meck + len + burg：burg 常见于地名里表示“城堡/堡垒”（如 Hamburg），帮助记住它源于“城堡”相关的地名。","联想北卡最大城市 Charlotte 在 Mecklenburg County：记“梅克伦堡—夏洛特所在县”。"]}
{"word":"mecklenburgian","summary":{"en":"Mecklenburgian means “from or related to Mecklenburg,” and it can also mean a person from Mecklenburg.","zh":"Mecklenburgian 表示“来自或与梅克伦堡有关”，也可指“梅克伦堡人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mecklenburg (a region in northern Germany) or to a place named Mecklenburg (such as Mecklenburg County in North Carolina, USA); used to describe the people, culture, or things from there","zh":"与“梅克伦堡”（德国北部地区）或名为“Mecklenburg”的地方（如美国北卡罗来纳州梅克伦堡县）有关的；用于描述那里的人、文化或事物"},"examples":[{"en":"Mecklenburgian history is closely connected with the old duchies of northern Germany.","zh":"梅克伦堡地区的历史与德国北部旧公国密切相关。"},{"en":"She studied Mecklenburgian dialect words in local folk songs.","zh":"她研究当地民歌中的梅克伦堡方言词汇。"},{"en":"In Charlotte, some residents describe themselves as Mecklenburgian in local writing, though it’s less common than “Mecklenburg County resident.”","zh":"在夏洛特，一些人在本地写作中会自称为“Mecklenburgian”，不过这不如“梅克伦堡县居民”常见。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mecklenburg (Germany) or from a place named Mecklenburg","zh":"梅克伦堡人；来自名为“Mecklenburg”的地方的人"},"examples":[{"en":"Several Mecklenburgians moved to the city for work.","zh":"一些梅克伦堡人为了工作搬到这座城市。"},{"en":"He is a Mecklenburgian by birth but has lived abroad for years.","zh":"他出生于梅克伦堡，但在国外住了很多年。"}]}],"synonyms":["Mecklenburg (as an attributive noun)","from Mecklenburg"],"phonetic":"/məˌklɛmbɝˈɡiən/","extraExplanation":["“Mecklenburgian”是一个比较少见、偏正式的地域形容词/居民称呼（demonym）。在英文中，更常见的写法往往是“from Mecklenburg”或直接用更具体的地名（如“from Charlotte / Mecklenburg County”）。","德国的Mecklenburg常与“Mecklenburg-Vorpommern（梅克伦堡-前波美拉尼亚州）”相关；在美国语境中，Mecklenburg最常被理解为北卡的Mecklenburg County（夏洛特所在地），所以实际指向需要看上下文。"]}
{"word":"meclizine","summary":{"en":"Meclizine is an antihistamine medicine commonly used for motion sickness and dizziness/vertigo.","zh":"Meclizine（美克洛嗪）是一种抗组胺药，常用于晕动症以及头晕/眩晕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antihistamine medicine used to prevent or treat motion sickness (such as nausea, vomiting, and dizziness) and sometimes vertigo","zh":"一种抗组胺药，用于预防或治疗晕动症（如恶心、呕吐、头晕），有时也用于缓解眩晕"},"examples":[{"en":"I took meclizine before the boat trip to help prevent motion sickness.","zh":"我在坐船前吃了美克洛嗪，帮助预防晕船。"},{"en":"The doctor recommended meclizine for my dizziness and nausea.","zh":"医生建议我用美克洛嗪来缓解头晕和恶心。"}]}],"synonyms":["Antivert (brand name)","Bonine (brand name)","motion-sickness medicine"],"phonetic":"/ˈmɛkləˌzin/","extraExplanation":["美克洛嗪在美国常见的品牌名包括 Antivert 和 Bonine。","它可能引起嗜睡、口干等副作用；服用后通常不建议饮酒或驾驶/操作机械，除非医生确认安全。","在一些地区需要处方或按当地规定购买；孕期、青光眼、前列腺问题等情况用药前应咨询医生或药师。"]}
{"word":"MECO","summary":{"en":"the shutdown moment of a rocket’s main engines","zh":"火箭主发动机关闭的关键时刻"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Main Engine Cutoff: the moment when a rocket’s main engines are shut down, usually at the end of a powered flight phase.","zh":"主发动机关机：火箭主发动机关闭的时刻，通常发生在某段推进（点火）飞行阶段结束时。"},"examples":[{"en":"After MECO, the vehicle coasted in space before the next burn.","zh":"MECO 之后，飞行器在太空中滑行一段时间，再进行下一次点火。"},{"en":"The announcer called out MECO as the rocket reached orbital velocity.","zh":"当火箭达到入轨速度时，解说员报出了 MECO。"},{"en":"Engine performance is closely monitored leading up to MECO.","zh":"在接近 MECO 之前，会密切监测发动机性能。"}]}],"synonyms":["main engine shutdown","engine cutoff","cutoff"],"phonetic":"/ˈmiːkoʊ/","extraExplanation":["在发射直播里，MECO 往往是一个关键时间点：意味着某一段主推进结束，接下来可能进入滑行（coast）、分离（stage separation）、再点火（re-ignition）或上面级点火等流程。","不同任务也会出现类似缩写，如 SECO（Second Engine Cutoff，二级发动机关机）。"],"etymology":"这是航天领域的首字母缩略词，来自 Main Engine Cutoff（主发动机关机）。在 NASA 航天飞机时代以及后续火箭任务直播中很常见。","mnemonic":["把它记成“Main Engine Cut Off”的首字母：M-E-C-O；看到直播字幕里的 MECO，就联想到“主发动机停了”。","联想中文“没（ME）发动机（CO=cut off）了”→ 已经关机进入滑行阶段。"]}
{"word":"mecodont","summary":{"en":"A rare zoological adjective meaning “long, narrow, sharp-toothed,” especially referring to incisors.","zh":"一个罕见的动物学形容词，表示“牙齿细长而尖（尤指门齿）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, zoology) Having long, narrow, often sharp teeth (especially incisors), adapted for cutting.","zh":"（罕见，动物学）指牙齿（尤指门齿）细长、较尖，适合切割食物的。"},"examples":[{"en":"Some small mammals are described as mecodont because their front teeth are long and blade-like.","zh":"一些小型哺乳动物会被形容为 mecodont，因为它们的前牙细长、像刀片一样。"},{"en":"In older zoology notes, the species was listed as mecodont, suggesting a cutting-type diet.","zh":"在较早的动物学笔记里，这个物种被标注为 mecodont，暗示它的饮食方式偏“切割型”。"}]}],"synonyms":["sharp-toothed","long-toothed","needle-toothed"],"phonetic":"/ˈmɛkəˌdɑnt/","extraExplanation":["这个词非常少见，多见于较旧或较专业的动物学/形态学描述中；很多现代资料会改用更常见的表达（如 sharp-toothed、long-toothed，或更具体的牙齿类型术语）。","如果你是在论文、教材或标本说明里看到 mecodont，建议提供上下文（整句或出处），我可以帮你确认它是否为拼写变体或特定分类用语。"]}
{"word":"mecodonta","summary":{"en":"Mecodonta is a scientific genus name for certain moths.","zh":"Mecodonta 是某类蛾的科学属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for a group of moths (used in biological classification).","zh":"（生物分类学中）蛾类的一个属名（学名），用于指一类蛾的分类单位。"},"examples":[{"en":"Mecodonta is a genus name used in entomology (the study of insects).","zh":"Mecodonta 是昆虫学中使用的一个属名（研究昆虫的学科）。"},{"en":"The researcher identified the specimen as belonging to the genus Mecodonta.","zh":"研究人员将该标本鉴定为属于 Mecodonta 属。"}]}],"synonyms":["(no true synonyms; it is a taxonomic proper name)"],"phonetic":"/ˌmɛkəˈdɑːntə/","extraExplanation":["“Mecodonta”属于拉丁化的科学命名，常见于论文、物种名录、博物馆标本标签等正式语境；日常英语交流中几乎不会用到。","在生物分类中，“属（genus）”是比“种（species）”更高一级的单位；你可能会看到写法如：Mecodonta + 物种名（例如某个 species epithet），共同构成完整的双名法学名。"]}
{"word":"mecometer","summary":{"en":"A rare medical term for a device used to measure or assess meconium (a newborn’s first stool).","zh":"一个罕见的医学词，指用于测量或评估胎粪（新生儿首次排便）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, medical) An instrument used to measure or assess meconium (a newborn baby’s first stool), especially in clinical or research contexts.","zh":"（罕见，医学）用于测量或评估胎粪/胎便（新生儿出生后排出的第一次粪便）的仪器，多见于临床或研究语境。"},"examples":[{"en":"The researchers used a mecometer to quantify meconium in the sample.","zh":"研究人员使用 mecometer 来量化样本中的胎粪含量。"},{"en":"In some older medical reports, a mecometer is mentioned as a tool for evaluating meconium-stained fluid.","zh":"在一些较早的医学报告中，mecometer 被提到可用于评估胎粪污染的羊水。"}]}],"synonyms":["meconium analyzer","meconium test device"],"phonetic":"/miˈkɑmɪtɚ/","extraExplanation":["这个词在现代英语中非常少见，许多词典可能不收录；如果你是在论文、设备清单或医学史资料里看到它，通常与“meconium（胎粪）”的测量/评估有关。","也常有人把它误写/误读为 micrometer（千分尺，测微计）。如果你的语境是“测量长度/厚度/直径”，更可能想找的是 micrometer。建议你提供一句原文，我可以帮你确认到底是哪一个词以及更自然的表达。"]}
{"word":"mecometry","summary":{"en":"“Mecometry” is not a standard English word; it’s likely a misspelling or an extremely rare technical term.","zh":"“mecometry”不是标准英语词，更可能是拼写错误或极少见的专业术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard or commonly recognized English word. It is most likely a misspelling or a very rare technical term.","zh":"不是标准或常见的英语单词。更可能是拼写错误，或极少见的专业术语。"},"examples":[{"en":"I couldn’t find “mecometry” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里查不到“mecometry”——你能把它出现的句子发我吗？"},{"en":"If you meant “mechanometry,” that word relates to measuring mechanical force or motion.","zh":"如果你想写的是“mechanometry”，它和测量机械力或运动有关。"}]}],"synonyms":["mechanometry","metrology","measurement"],"phonetic":"/ˌmiˈkɑmətri/","extraExplanation":["“mecometry”在常用词典中几乎查不到，因此很可能是：\n1）拼写错误（例如想写 mechanometry / geometry / metrology 等以 -metry 结尾、表示“测量/度量”的词）；\n2）某个小领域里自造或极少用的术语（可能出现在论文、设备名、品牌名、用户名等）。\n\n如果你把原句/上下文贴出来（例如它在医学、工程、数学还是环境领域出现），我可以更准确判断它到底指什么，并给出对应的正确词和用法。"]}
{"word":"mecon","summary":{"en":"Mecon is either an informal medical short form of “meconium” (a newborn’s first stool) or a scientific word part meaning “poppy/opium-related.”","zh":"mecon 既可作医学口语中 meconium（胎粪）的简称，也可作表示“罂粟/与鸦片相关”的构词成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, informal) Short for “meconium,” the dark green/black first stool passed by a newborn baby.","zh":"（医学，非正式）“meconium（胎粪）”的简称，指新生儿出生后排出的深绿/黑色的第一批粪便。"},"examples":[{"en":"The nurse noted mecon in the diaper shortly after birth.","zh":"护士记录到宝宝出生不久尿布里有胎粪。"},{"en":"Mecon staining can be a sign the baby passed stool before delivery.","zh":"羊水胎粪污染可能提示宝宝在分娩前就排便了。"}]},{"partOfSpeech":"other","definition":{"en":"A word part (combining form) meaning “poppy” or “related to opium,” used in scientific terms (e.g., meconic acid).","zh":"（构词成分）表示“罂粟”或“与鸦片相关”，常见于科学/医学术语中（如 meconic acid）。"},"examples":[{"en":"Meconic acid is a compound historically associated with opium analysis.","zh":"Meconic acid（罂粟酸）是一种在早期鸦片分析中常被提到的化合物。"},{"en":"In older scientific vocabulary, mecon- often points to a connection with the poppy plant.","zh":"在较早的科学词汇中，mecon- 常提示与罂粟植物有关。"}]}],"synonyms":["meconium (for the medical meaning)"],"phonetic":"/ˈmɛkɑn/","extraExplanation":["“mecon-”来自希腊语 mēkōn（罂粟）。因此在一些较旧或专业的化学/药学词里，会用它来表示与罂粟或鸦片相关的概念。","临床口语里把 meconium 简称为 mecon，多见于产科/新生儿科记录或医护交流；日常英语里一般直接说 meconium。"]}
{"word":"meconate-related","summary":{"en":"connected with meconate or meconic-acid salts/esters","zh":"与麦康酸盐/酯（麦康酸相关）有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or involving a meconate (a salt or ester of meconic acid), often discussed in chemical or pharmacological contexts.","zh":"与“meconate（麦康酸盐/酯，即 meconic acid 麦康酸的盐或酯）”有关的；常用于化学或药理学语境。"},"examples":[{"en":"The report focuses on meconate-related compounds found in opium poppy extracts.","zh":"这份报告重点讨论在鸦片罂粟提取物中发现的与麦康酸盐相关的化合物。"},{"en":"Researchers tested meconate-related ions to confirm the presence of meconic acid derivatives.","zh":"研究人员检测了与麦康酸盐相关的离子，以确认是否存在麦康酸衍生物。"}]}],"synonyms":["meconate-associated","meconate-linked","meconic-acid-related"],"phonetic":"ˈmɛkəneɪt rɪˈleɪtɪd","extraExplanation":["meconic acid（麦康酸）是罂粟乳汁/鸦片中可检出的成分之一；在分析化学或法医学文献里，meconate/meconic acid 常作为与鸦片来源相关的指标之一（具体判定仍需结合其他证据与方法）。"],"etymology":"来自 meconate：词根源于希腊语 mēkōn（“罂粟”），因为麦康酸与鸦片/罂粟相关；后缀 -ate 常用于表示“……的盐/酯”。再加 related 构成“与……相关的”。","mnemonic":["把 mecon- 联想成“罂粟（鸦片）相关”的线索；-ate 常见于“盐/酯”（如 citrate 柠檬酸盐），所以 meconate≈“麦康酸盐/酯”。","meconate-related 可直译为“麦康酸盐相关”，看到 related 就想到“有关联/相关”。"]}
{"word":"meconial","summary":{"en":"connected with a newborn’s first stool","zh":"与新生儿胎粪（出生后首次排便）有关"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to meconium, the dark green first stool passed by a newborn baby (or found in the fetus).","zh":"与胎粪有关的；指新生儿出生后排出的深绿色第一泡大便（或胎儿期的胎粪）。"},"examples":[{"en":"The nurse noted meconial staining of the amniotic fluid during delivery.","zh":"分娩时，护士记录到羊水出现胎粪污染（胎粪染色）。"},{"en":"Doctors monitored the baby closely after signs of meconial aspiration.","zh":"出现胎粪吸入的迹象后，医生对婴儿进行了密切监测。"}]}],"synonyms":["meconium-related","meconium-stained"],"phonetic":"/məˈkoʊniəl/","extraExplanation":["这是医学用语，常见搭配有：meconial staining（胎粪染色/胎粪污染）、meconial aspiration（胎粪吸入）。日常英语里更常直接说 meconium-stained 或 meconium aspiration。"],"etymology":"源自医学名词 meconium（胎粪）+ 形容词后缀 -al（“……的”）。meconium 来自希腊语 mēkōn（罂粟），早期因胎粪的颜色与质地被联想到罂粟汁样而得名。","mnemonic":["记成“meconium 的形容词”：看到 -al 就想到“……的”，meconial = “胎粪的”。"]}
{"word":"meconic","summary":{"en":"“Meconic” means “related to meconic acid,” a compound found in opium, mostly used in chemistry or forensic contexts.","zh":"“meconic”表示“与麦康酸有关的”，麦康酸存在于鸦片中；该词多用于化学或法医等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to meconic acid, a chemical compound naturally found in opium (and used in chemistry to help identify the presence of opium).","zh":"与麦康酸（meconic acid）有关的；麦康酸是天然存在于鸦片中的一种化合物（在化学中可用于辅助检验鸦片的存在）。"},"examples":[{"en":"Meconic acid and other alkaloid-related substances can be detected in laboratory tests.","zh":"在实验室检测中可以检出麦康酸以及其他与生物碱相关的物质。"},{"en":"A classic chemical test for opium looks for meconic compounds or reactions.","zh":"一种经典的鸦片化学检测会寻找与麦康酸有关的物质或反应。"}]}],"synonyms":["meconate-related","meconic-acid (as a modifier in scientific writing)"],"phonetic":"/məˈkɑnɪk/","extraExplanation":["“meconic”来自希腊语 *mēkōn*，意为“罂粟”。因此它常出现在化学、药物分析或法医学语境里，日常英语中很少用到。","学习时可顺带记：*meconic acid*（麦康酸）是固定搭配；形容词“meconic”多用来修饰 acid、reaction、test、compound 等名词。"]}
{"word":"meconic-acid","summary":{"en":"an opium-related organic acid that gives a red reaction with ferric salts","zh":"存在于鸦片中的有机酸，与三价铁盐反应呈红色"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an organic acid found especially in opium; it can form a deep red color with iron (ferric) salts and is sometimes used as a chemical test for opium-related substances","zh":"一种有机酸，主要存在于鸦片中；与三价铁盐反应可生成深红色，因此有时用于与鸦片相关物质的化学检验"},"examples":[{"en":"In the lab, meconic acid is known for turning a ferric chloride solution red.","zh":"在实验室里，麦康酸因能使三氯化铁溶液变红而出名。"},{"en":"Older chemistry texts mention meconic acid as one clue that a sample may contain opium derivatives.","zh":"较早的化学教材提到，麦康酸可作为样品可能含有鸦片衍生物的线索之一。"}]}],"synonyms":["meconate"],"phonetic":"/məˈkɑnɪk ˈæsɪd/","extraExplanation":["在实际分析中，“三价铁盐显红色”并不等于“确定含鸦片”，因为某些其他物质也可能产生颜色反应；现代检测通常会结合更专门的仪器分析方法。"],"etymology":"词源来自希腊语 *mēkōn*（罂粟）+ “-ic”（表示“……的/与……有关的”），字面意思是“与罂粟有关的酸”。","mnemonic":["把 *mec-* 联想成“罂粟/鸦片（meconium 也常见于医学词里，读音相近便于记）”，*acid* 就是“酸”，合起来记为“与罂粟相关的一种酸”。","记反应特征：看到 *meconic acid* 就联想到 “Fe³⁺ → red（变红）”。"]}
{"word":"meconidium","summary":{"en":"Meconidium is a rare/obsolete form used for “meconium,” a newborn’s first stool.","zh":"meconidium 多为罕见/旧用写法，通常指“meconium（胎粪）”，即新生儿的第一次排便。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) A form sometimes used for “meconium,” the dark greenish first stool of a newborn baby.","zh":"（罕见/旧用）有时用作“meconium（胎粪）”的变体，指新生儿出生后排出的第一种深绿色或黑绿色粪便。"},"examples":[{"en":"The chart noted delayed passage of meconidium (meconium) after birth.","zh":"病历记录了出生后胎粪（meconidium/meconium）排出延迟。"},{"en":"In modern medical English, doctors almost always write “meconium,” not “meconidium.”","zh":"在现代医学英语中，医生几乎总是写“meconium”，而不是“meconidium”。"}]}],"synonyms":["meconium"],"phonetic":"/məˈkoʊniəm/","extraExplanation":["“Meconidium”在当代英语里非常少见，很多情况下是拼写变体、旧文献用法，或把常见词“meconium（胎粪）”写错了。临床或学术写作中建议使用标准拼写“meconium”。","词源上，“meconium”来自希腊语，和“罂粟（poppy）”相关的词根有关；古人因其颜色/外观而联想命名。"]}
{"word":"meconin","summary":{"en":"Meconin is a rare, technical chemistry word for a compound associated with opium-poppy–related substances, mainly used in research contexts.","zh":"Meconin 是一个少见且专业的化学词，指与罂粟/鸦片相关物质研究中出现的一种化合物，主要用于科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a neutral lactone) found among substances derived from opium poppy and related plant/alkaloid chemistry; mainly used as a research term in chemistry and pharmacognosy.","zh":"一种化学化合物（中性内酯），可在与罂粟/鸦片相关的植物成分及其衍生物研究中出现；主要用于化学与生药学等科研语境。"},"examples":[{"en":"The lab identified meconin in a sample related to opium-derived compounds.","zh":"实验室在与鸦片衍生物相关的样品中鉴定出了 meconin。"},{"en":"Meconin is a term you’ll mostly see in chemistry papers, not everyday English.","zh":"Meconin 这个词主要出现在化学论文里，而不是日常英语中。"}]}],"phonetic":"/ˈmɛkənɪn/","extraExplanation":["meconin 属于非常专业的化学词汇，日常交流几乎不会用到。常见于讨论罂粟相关天然产物、分离鉴定、或某些结构转化/降解产物的文献中。","如果你是在论文或检测报告里看到它，通常需要结合上下文（如：样品来源、反应条件、分析方法 GC/MS 或 NMR 等）来确定它在该研究中的具体角色。"]}
{"word":"meconioid","summary":{"en":"Meconioid means “meconium-like,” used in medical contexts to describe a dark, sticky appearance similar to a newborn’s first stool.","zh":"meconioid 意为“胎粪样的/类似胎粪的”，多用于医学语境，描述外观或质地像新生儿最初排出的深色黏稠胎粪。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling meconium (a newborn’s first dark, sticky stool); meconium-like.","zh":"类似胎粪的；呈胎粪样的（胎粪是新生儿排出的第一种深色、黏稠的粪便）。"},"examples":[{"en":"The nurse noted a meconioid discharge in the diaper.","zh":"护士记录到尿布里有胎粪样分泌物。"},{"en":"Doctors described the fluid as thick and meconioid in appearance.","zh":"医生形容该液体外观浓稠，呈胎粪样。"}]}],"synonyms":["meconium-like","meconium-stained","meconial"],"phonetic":"/məˈkoʊniɔɪd/","extraExplanation":["“meconioid”是医学用词，常用于病历或检查报告中，用来描述颜色（深绿/黑）、质地（黏稠）或外观“像胎粪”的分泌物/内容物。它是描述性形容词，并不等同于诊断。","词形拆解：meconium（胎粪）+ -oid（“……样的/类似……的”后缀）。在医学英语里，-oid很常见，如 thyroid（甲状腺的，原义“盾形的”）/ keloid（瘢痕疙瘩样）。"]}
{"word":"meconium","summary":{"en":"Meconium is a newborn’s first dark, sticky stool.","zh":"meconium 指新生儿最初排出的深色、黏稠的胎粪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A newborn baby’s first thick, dark green or black stool, passed in the first day or two after birth.","zh":"（新生儿）胎粪：婴儿出生后最初排出的粘稠、深绿或黑色的大便，通常在出生后1–2天内出现。"},"examples":[{"en":"The nurse checked that the baby passed meconium within 24 hours.","zh":"护士确认宝宝在24小时内排出了胎粪。"},{"en":"Meconium is usually sticky and very dark in color.","zh":"胎粪通常很黏稠，颜色也很深。"}]}],"synonyms":["newborn stool","first stool"],"phonetic":"/məˈkoʊniəm/","extraExplanation":["“meconium”是医学用语，日常口语里常直接说“the baby’s first poop/first stool（宝宝第一次大便）”。","临床上医生会关注是否“按时排胎粪”，因为延迟可能提示肠道问题；另外“meconium-stained amniotic fluid（羊水胎粪污染）”在产科中也很常见，表示胎粪混入羊水。","词源来自希腊语，原意与“罂粟汁/像罂粟一样黑”有关，用来形容它的深色外观。"]}
{"word":"meconium-eater","summary":{"en":"a very vile person (a rare, vulgar insult)","zh":"极其卑鄙的人（罕见而粗俗的辱骂）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, insulting) A very contemptible person; someone described with extreme disgust.","zh":"（罕见，侮辱性）极其卑鄙、令人作呕的人；用于强烈鄙视的骂人说法。"},"examples":[{"en":"The pamphlet was full of crude insults, calling his opponents “meconium-eaters.”","zh":"那份小册子充满粗鄙的辱骂，把对手称作“meconium-eaters（令人作呕的家伙）”。"},{"en":"It’s an archaic slur, so you’ll mostly see it in older satire rather than modern speech.","zh":"这是一种古旧的辱称，所以多见于旧时讽刺作品，而不常见于现代口语。"}]}],"synonyms":["wretch","scoundrel","miscreant","lowlife","degenerate","vermin"],"phonetic":"/məˈkoʊniəm ˌitɚ/","extraExplanation":["meconium 指新生儿出生后最初排出的深绿色黏稠排泄物（中文常译“胎粪”）。把它放进辱骂里，是为了制造强烈的恶心与贬损效果。","该词极不常用，带有粗俗与人身攻击色彩；在学习或写作中更适合“理解其含义”而非主动使用。"],"etymology":"来自 meconium（“胎粪/初生婴儿排出的第一种粪便”，源自希腊语 mēkōnion，与“罂粟”相关，因其颜色像罂粟汁）+ eater（“吃……的人”）。整体是一种夸张的污辱性复合词，用“吃胎粪”来表达极端厌恶。","mnemonic":["拆开记：meconium（胎粪）+ eater（吃的人）→“吃胎粪的人”→引申为“令人极度厌恶的家伙”。","联想中文骂法里用“脏/恶心”的意象来侮辱对方：这类词的功能更多是情绪攻击而非客观描述。"]}
{"word":"meconium-like","summary":{"en":"Having the appearance/consistency of a newborn’s first stool (thick, sticky, dark, tar-like).","zh":"外观或质地呈胎粪样（浓稠黏稠、深色、柏油样）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling meconium (a newborn’s first stool): thick, sticky, very dark green to black, and tar-like in appearance.","zh":"外观或质地像“胎粪”（新生儿第一次排出的粪便）：浓稠、黏稠、颜色深（深绿到黑），呈柏油样。"},"examples":[{"en":"The nurse noted meconium-like staining in the amniotic fluid.","zh":"护士记录到羊水中有类似胎粪的染色。"},{"en":"The discharge was described as meconium-like in color and thickness.","zh":"分泌物被描述为颜色和黏稠度都类似胎粪。"}]}],"synonyms":["tar-like","dark","thick","viscous","sticky"],"phonetic":"/məˈkoʊniəm laɪk/","extraExplanation":["这是偏医学/临床用语，多用于描述羊水、呕吐物、分泌物或粪便的“外观特征”。在新生儿相关语境里，“胎粪样”常提示需要进一步评估（例如胎儿应激等可能性），但具体意义取决于临床情况。"],"etymology":"由 meconium（胎粪，源自希腊语 mēkōnion，和“罂粟”相关的词根）+ -like（“像……一样”）构成，用于医学描述“外观/性质类似胎粪”。","mnemonic":["拆开记：meconium（胎粪）+ like（像）→ “像胎粪的”。","联想画面：胎粪常被形容为“又黑又黏、像柏油”，看到“tar-like/black-green and sticky”就更容易对应到这个词。"]}
{"word":"meconium-stained","summary":{"en":"mixed with a newborn’s first stool (meconium)","zh":"被胎粪污染/混有胎粪的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing amniotic fluid, the baby’s skin, or the baby at birth when it is mixed with meconium (the newborn’s first stool), often seen during labor and delivery.","zh":"形容羊水、胎儿皮肤或新生儿出生时被胎粪（新生儿第一次排便）污染/混有胎粪的，常见于分娩过程。"},"examples":[{"en":"The nurse noted meconium-stained amniotic fluid after the water broke.","zh":"破水后，护士记录到羊水呈胎粪污染。"},{"en":"Because the fluid was meconium-stained, the team prepared to monitor the baby’s breathing closely.","zh":"由于羊水胎粪污染，医疗团队准备密切观察宝宝的呼吸情况。"}]}],"synonyms":["meconium-contaminated","meconium-tinged","meconium-laced"],"phonetic":"/məˈkoʊniəm steɪnd/","extraExplanation":["在产科语境里，“meconium-stained amniotic fluid（羊水胎粪污染）”比较常见。它提示宝宝在子宫内排出了胎粪，可能与胎儿成熟或缺氧/应激有关，但并不一定代表严重问题。临床上通常会加强胎心与新生儿呼吸情况的观察，以防“胎粪吸入综合征（meconium aspiration syndrome）”。"],"etymology":"由医学词 meconium（胎粪）+ 过去分词形容词 stained（被染色/被污染的）构成的复合形容词，常用于产科记录与沟通。","mnemonic":["把它拆开记：meconium=胎粪，stained=被“弄脏/染上”的 → “被胎粪弄脏的（羊水/宝宝）”。","联想中文场景：分娩时医生说“羊水有胎粪”= meconium-stained fluid。"]}
{"word":"meconiums","summary":{"en":"Meconiums is the plural of meconium, meaning a newborn’s first stool.","zh":"Meconiums 是 meconium 的复数，指新生儿出生后排出的第一种粪便（胎粪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first thick, dark greenish-black stool passed by a newborn baby (or fetus), made of materials swallowed before birth","zh":"（新生儿或胎儿的）胎粪；出生后排出的第一种粪便，通常黏稠、深绿色至黑色"},"examples":[{"en":"The baby passed meconium within the first 24 hours after birth.","zh":"宝宝在出生后24小时内排出了胎粪。"},{"en":"Doctors noted meconium in the amniotic fluid during labor.","zh":"分娩过程中，医生发现羊水中有胎粪。"}]}],"synonyms":["first stool","newborn stool"],"phonetic":"/mɪˈkoʊniəm/","extraExplanation":["“Meconiums”是“meconium”的复数形式，但在医学写作中更常用不可数或单数来泛指“胎粪”。","临床上常提到“meconium-stained amniotic fluid（胎粪污染羊水）”，可能提示胎儿在子宫内曾经排便；是否危险需要由专业医护结合胎心监测、孕周等综合判断。"]}
{"word":"meconology","summary":{"en":"Meconology is a rare medical term meaning the study or testing of a newborn’s meconium.","zh":"Meconology 是一个较少见的医学词，指对新生儿胎粪进行研究或检测分析。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the medical study or analysis of meconium (a newborn baby’s first stool), often to check health or exposure to substances during pregnancy","zh":"（医学）胎粪学：对胎粪（新生儿出生后的第一次排便）进行研究或检测分析，常用于评估健康状况或孕期物质暴露"},"examples":[{"en":"The lab performed meconology tests to look for prenatal drug exposure.","zh":"实验室进行了胎粪学检测，以查找孕期药物暴露的证据。"},{"en":"In some hospitals, meconology can help clinicians understand a newborn’s condition.","zh":"在一些医院里，胎粪学有助于临床医生了解新生儿的状况。"}]}],"synonyms":["meconium analysis","study of meconium","meconium testing"],"phonetic":"/ˌmɛkəˈnɑlədʒi/","extraExplanation":["“meconology”非常少见，更常见的写法与说法是谈“meconium analysis”（胎粪检测）或直接用“meconium”（胎粪）。词根“mecon-”来自“meconium（胎粪）”，“-logy”表示“……学/研究”。"]}
{"word":"meconophagism","summary":{"en":"Meconophagism means eating meconium (a newborn’s first stool), a rare term used mainly in medical or veterinary writing.","zh":"Meconophagism 指“食用胎粪（新生儿第一次排出的粪便）”，属于较罕见的词，多见于医学或兽医学写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or practice of eating meconium (a newborn’s first stool)","zh":"食用胎粪（新生儿排出的第一次粪便）的行为或习惯"},"examples":[{"en":"In some mammals, researchers have observed meconophagism as part of postpartum cleaning behavior.","zh":"在一些哺乳动物中，研究者观察到食用胎粪可能是产后清理行为的一部分。"},{"en":"The paper discusses meconophagism in relation to how mothers remove birth-related waste from the nest.","zh":"这篇论文讨论了食用胎粪与母体如何清除巢穴中分娩相关废物之间的关系。"}]}],"synonyms":["meconophagy","coprophagy (broader/related)"],"phonetic":"/məˌkoʊnəˈfeɪdʒɪzəm/","extraExplanation":["这是一个非常少见、偏医学/兽医学的词，多用于学术语境。","词源上可拆为：mecono-（胎粪，meconium）+ -phag-（吃，源自希腊语“phagein”）+ -ism（行为/现象）。","易与更常见的 coprophagy（食粪）混淆：meconophagism 指“吃胎粪”，范围更窄、更具体。"]}
{"word":"meconophagist","summary":{"en":"A very rare term meaning an organism that eats meconium (a newborn’s first stool).","zh":"一个非常罕见的词，指吃胎便（新生儿出生后排出的第一种粪便）的人或动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or animal that eats meconium (a newborn’s first stool).","zh":"食粪胎便者；吃胎便（新生儿出生后排出的第一种粪便）的人或动物。"},"examples":[{"en":"In medical writing, a \"meconophagist\" would mean an organism that ingests meconium.","zh":"在医学写作中，“meconophagist”指摄食胎便的生物。"},{"en":"The term is extremely rare, so most writers would simply say “meconium-eater.”","zh":"这个词非常罕见，所以多数作者会直接说“meconium-eater（吃胎便者）”。"}]}],"synonyms":["meconium-eater","meconium ingester"],"phonetic":"/məˈkɑːnoʊˌfeɪdʒɪst/","extraExplanation":["词源构成：mecono- 来自 meconium（胎便），-phagist 来自希腊语 phagein（吃）。","使用场景：该词非常少见，多见于医学/生物学的术语化表达；日常英语里几乎不用，通常会改用更直白的说法（如 meconium-eater）。","注意：meconium 指“胎便”，不是普通意义上的粪便；它常出现在新生儿护理与产科相关语境中。"]}
{"word":"meconophagy","summary":{"en":"ingestion of a newborn’s first stool","zh":"吞食胎粪"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of eating or ingesting meconium (a newborn’s first stool); a rare medical term usually used in clinical or research contexts","zh":"食用或吞食胎粪（新生儿出生后最初排出的粪便）；较少见的医学用语，多见于临床或研究语境"},"examples":[{"en":"The case report mentioned possible meconophagy shortly after delivery.","zh":"该病例报告提到分娩后不久可能出现吞食胎粪的情况。"},{"en":"Researchers recorded meconophagy in newborn animals during the first hours of life.","zh":"研究人员记录到一些动物幼崽在出生后最初几小时内会吞食胎粪。"}]}],"synonyms":["meconium ingestion"],"phonetic":"/ˌmɛkəˈnɑfəˌdʒi/","extraExplanation":["Meconium 指“胎粪”，是一种深绿色、黏稠的物质，通常在出生后最初几次排便中出现。","该词不常用于日常英语，多见于医学写作；临床上更常见的相关表达是 meconium aspiration（胎粪吸入）或 meconium-stained fluid（胎粪污染的羊水），但它们与“吞食”不是同一概念。"],"etymology":"由 meconium（胎粪）+ -phagy（吞食）构成；-phagy 来自希腊语 phagein，意为“吃”。","mnemonic":["把词拆开记：meconium（胎粪）+ -phagy（吃）→“吃胎粪”。","联想常见后缀 -phagy：如 coprophagy（食粪），同样表示“吃……”。"]}
{"word":"mecoptera","summary":{"en":"Mecoptera is the insect order that includes scorpionflies and their relatives.","zh":"Mecoptera 指包含蝎蛉等类群的一个昆虫目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of insects that includes scorpionflies and hangingflies, known for long, narrow wings and (in some males) a tail-like, upturned abdomen.","zh":"一种昆虫“目”（昆虫分类等级之一），包括蝎蛉、垂蛉等，常见特征是细长的翅膀，以及部分雄虫腹部末端上翘、外形像“蝎尾”。"},"examples":[{"en":"Mecoptera are often called scorpionflies because some males have a curved, tail-like abdomen.","zh":"Mecoptera 常被称为“蝎蛉”，因为有些雄虫的腹部末端弯曲，看起来像“蝎尾”。"},{"en":"In a field guide, the insect was classified under the order Mecoptera.","zh":"在野外图鉴中，这种昆虫被归类为 Mecoptera 目。"}]}],"synonyms":["scorpionflies (common name for many members)","order Mecoptera"],"phonetic":"/mɛˈkɑːptərə/","extraExplanation":["这是一个生物分类学名词，写作首字母大写（Mecoptera）更常见；口语或科普语境中常用更直观的名称 scorpionflies（蝎蛉类）。","词源来自希腊语：mekos（长）+ ptera（翅膀），字面意思是“长翅”。","该类群并不是日常英语高频词，通常出现在生物学、昆虫学课程、科研论文或自然观察记录中。"]}
{"word":"mecopteran","summary":{"en":"A scientific word meaning “of the insect order Mecoptera” or “a member of Mecoptera.”","zh":"科学用语，指“长翅目（Mecoptera）的”或“长翅目昆虫（成员）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in zoology) Relating to the insect order Mecoptera (scorpionflies and their relatives).","zh":"（动物学）与长翅目（Mecoptera，含蝎蛉等）这种昆虫目有关的；长翅目的。"},"examples":[{"en":"The researcher compared mecopteran mouthparts with those of flies.","zh":"研究人员把长翅目昆虫的口器与苍蝇的口器进行了比较。"},{"en":"Mecopteran insects are often studied to understand insect evolution.","zh":"长翅目昆虫常被用来研究昆虫的演化。"}]},{"partOfSpeech":"n.","definition":{"en":"An insect that belongs to the order Mecoptera.","zh":"长翅目昆虫；长翅目成员。"},"examples":[{"en":"A mecopteran was resting on a leaf near the stream.","zh":"一只长翅目昆虫停在溪边的叶子上。"},{"en":"In this habitat, mecopterans appear mostly in spring.","zh":"在这种栖息地里，长翅目昆虫多在春季出现。"}]}],"synonyms":["(adj.) of Mecoptera","(n.) scorpionfly (common example)"],"phonetic":"/mɛˈkɑːptərən/","extraExplanation":["“mecopteran”来自“Mecoptera”（长翅目）的学名：meco-（希腊语，意为“长”）+ -ptera（“翅”）。常见的代表是蝎蛉（scorpionfly），因雄虫腹部末端上翘像“蝎尾”而得名，但并不是真正的蝎子。这个词多用于学术或科普语境。"]}
{"word":"mecopteron","summary":{"en":"A rare term for an insect of the order Mecoptera (e.g., a scorpionfly).","zh":"较少见的词，指长翅目（Mecoptera）的昆虫，例如蝎蛉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mecopteran insect (an insect belonging to the order Mecoptera), such as a scorpionfly","zh":"长翅目昆虫（隶属“长翅目 Mecoptera”的昆虫），例如蝎蛉（scorpionfly）"},"examples":[{"en":"A mecopteron is often recognized by its long, narrow wings.","zh":"长翅目昆虫常常可以从它细长的翅膀辨认出来。"},{"en":"In the lab, we examined a preserved mecopteron under a microscope.","zh":"在实验室里，我们用显微镜观察了一只保存好的长翅目昆虫标本。"}]}],"synonyms":["mecopteran","scorpionfly"],"phonetic":"/məˈkɑːptəˌrɑn/","extraExplanation":["“mecopteron”在现代英语中比较少见；更常见的说法是“mecopteran”（长翅目的）或直接用“a mecopteran insect”。","词源与“Mecoptera”有关，来自希腊语：mēkos（长）+ pteron（翅），字面意思接近“长翅”。"]}
{"word":"mecopterous","summary":{"en":"Mecopterous means “related to the insect order Mecoptera (scorpionflies).”","zh":"mecopterous 指“与昆虫的长翅目（蝎蛉类）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Entomology) Relating to the insect order Mecoptera (scorpionflies and their relatives).","zh":"（昆虫学）与长翅目（Mecoptera，常见为蝎蛉及其近缘类群）有关的；长翅目的。"},"examples":[{"en":"Mecopterous insects are often found in moist forests and near streams.","zh":"长翅目的昆虫常见于潮湿的森林和溪流附近。"},{"en":"The paper compared mecopterous mouthparts with those of flies and fleas.","zh":"这篇论文比较了长翅目昆虫的口器与蝇类和跳蚤的口器。"}]}],"synonyms":["mecopteran"],"phonetic":"/mɪˈkɑːptərəs/","extraExplanation":["“mecopterous”是学术用语，主要出现在昆虫分类与形态学的文章中；日常英语几乎不用。","词根来自“Mecoptera”：meco-（源自希腊语，意为“长”）+ -ptera（“翅”）。后缀 -ous 表示“具有……性质的/与……相关的”。","如果你在阅读中看到“mecopteran”，它也表示“长翅目的（昆虫）”，更常用；“mecopterous”更像偏形容词化的写法。"]}
{"word":"mecrobeproof","summary":{"en":"“Microbe-proof” means made to prevent microbes from growing on or passing through something.","zh":"“Microbe-proof”指“防微生物的/抗菌防护的”，强调阻止微生物滋生或穿透。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resistant to microbes; designed to prevent microbes (like bacteria or fungi) from growing on or passing through something","zh":"防微生物的；抗菌的；旨在防止细菌、真菌等微生物滋生或穿透的"},"examples":[{"en":"The hospital uses microbe-proof coatings on some high-touch surfaces.","zh":"医院在一些高频接触的表面使用防微生物涂层。"},{"en":"They advertised the mask as microbe-proof, but the label only said “antimicrobial.”","zh":"他们把口罩宣传成“防微生物”，但标签上只写了“抗菌”。"}]}],"synonyms":["antimicrobial","germ-resistant","bacteria-resistant","anti-bacterial"],"phonetic":"/ˈmaɪ.kroʊb.pruːf/","extraExplanation":["你输入的拼写“mecrobeproof”很可能是“microbe-proof”。也常写作“microbe proof”或“microbeproof”，但带连字符的“microbe-proof”更清晰。","注意区别：\n- microbe-proof（更强）：强调“能阻止/防止微生物进入或通过”，有“隔绝、阻挡”的含义。\n- antimicrobial / antibacterial（更常见）：强调“抑制或杀灭微生物/细菌”，不一定能完全阻挡微生物。","在产品宣传中，“microbe-proof”有时是营销用语；正式场景更常见的是“antimicrobial surface / antibacterial fabric / sterile barrier”等表述。"]}
{"word":"Mecum","summary":{"en":"Latin for “with me,” often linked to a portable guidebook idea.","zh":"拉丁语“与我一起”，常与“随身指南/手册”的含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin word meaning “with me,” most often seen in the phrase “vade mecum” (“go with me”).","zh":"拉丁语“与我一起／跟着我”的意思，最常见于短语“vade mecum”（意为“随身携带的指南／手册”）。"},"examples":[{"en":"The inscription reads “vade mecum,” suggesting the book should travel with its owner.","zh":"题词写着“vade mecum”，暗示这本书应当随主人同行、随身携带。"},{"en":"In older texts, “mecum” is used as Latin for “with me.”","zh":"在较早的文本中，“mecum”用作拉丁语，表示“和我一起”。"}]},{"partOfSpeech":"n.","definition":{"en":"a small handbook or guide kept close at hand; a ready reference (rare as a standalone word).","zh":"随身参考的小手册／指南（单独作为英语词使用较少，多由“vade mecum”引申）。"},"examples":[{"en":"He kept a mecum of common legal terms in his bag.","zh":"他包里常备一本常用法律术语的小手册。"},{"en":"For new nurses, the pocket mecum is useful during busy shifts.","zh":"对新护士来说，口袋版速查手册在忙碌的班次里很实用。"}]}],"synonyms":["with me","handbook","guide","manual","reference book","pocket guide"],"phonetic":"/ˈmiːkəm/","extraExplanation":["“vade mecum”在英语里常指“随身携带的指南/手册”，在医学、法律、礼仪等领域也会见到（如口袋参考书）。单独写“mecum”较少见，多是为了强调拉丁语色彩或作为缩略表达。"],"etymology":"源自拉丁语“me”（我）的一个形式加上介词“cum”（与……一起），合起来就是“与我一起”。英语里主要通过短语“vade mecum”（字面“跟我走”）进入，后来引申为“随身手册／速查指南”。","mnemonic":["把“me + cum”记成“我 + 跟我一起（cum≈come with）”，合起来就是“with me”。","联想到“vade mecum”=“走吧，跟我（随身）”，所以引申为“随身小手册”。"]}
{"word":"mecum","summary":{"en":"Mecum is a Latin word meaning “with me,” most often seen in the phrase “vade mecum,” meaning a handy guidebook or constant companion.","zh":"mecum 是拉丁语，意为“与我一起”，最常见于短语“vade mecum”，指“随身手册/指南”或“常伴之物”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used mainly in set phrases) “with me.”","zh":"（拉丁语；主要用于固定短语）“与我一起 / 跟我一起”。"},"examples":[{"en":"The motto “vade mecum” literally means “go with me.”","zh":"格言“vade mecum”字面意思是“与我同行 / 跟我一起走”。"},{"en":"You’ll rarely see mecum alone in modern English; it usually appears in Latin phrases.","zh":"在现代英语里，mecum 很少单独出现，通常出现在拉丁固定短语中。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension, in English) a constant companion or a handy guidebook—especially in the phrase “vade mecum.”","zh":"（引申义；英语中）随身常伴之物、随身手册/指南；尤用于短语“vade mecum”。"},"examples":[{"en":"This small grammar book is my vade mecum when I travel.","zh":"这本小语法书是我旅行时的随身手册。"},{"en":"For many nurses, a pocket drug reference becomes a daily vade mecum.","zh":"对许多护士来说，口袋装用药参考书会成为每天的随身指南。"}]}],"synonyms":["handbook","manual","guidebook","reference (book)","companion"],"phonetic":"ˈmiːkəm","extraExplanation":["mecum 来自拉丁语中 me（我）+ -cum（与……一起）构成的形式，意思是“与我一起”。英语里它几乎总是出现在 vade mecum（直译“与我同行”）这个固定搭配中，用来指“随身手册、案头指南、随身伴侣之物”。","在文学与学术语境中，vade mecum 常带一点“有学养/古典气”的书面风格；日常英语更常用 handbook、manual、guidebook、reference book 来表达。"]}
{"word":"mecums","summary":{"en":"“Mecums” usually refers to Mecum Auctions (Mecum’s), famous for collector-car auctions.","zh":"“mecums” 通常指 Mecum Auctions（Mecum’s），以收藏车拍卖闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) Referring to Mecum Auctions (often written “Mecum’s”), a well-known American auction company famous for selling collector cars, motorcycles, and memorabilia; “Mecums” can also mean Mecum events or auctions in general.","zh":"（专有名词）指美国知名拍卖公司 Mecum Auctions（常写作 “Mecum’s”），以拍卖收藏级汽车、摩托车和纪念品闻名；“mecums” 也可泛指 Mecum 的拍卖会/活动。"},"examples":[{"en":"We watched Mecum’s auction and saw a classic Mustang sell for a huge price.","zh":"我们看了 Mecum’s 的拍卖会，看到一辆经典野马卖出了很高的价格。"},{"en":"A lot of rare motorcycles show up at Mecums every year.","zh":"每年 Mecums 的拍卖会上都会出现很多稀有摩托车。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) The plural of the surname “Mecum,” meaning multiple people with that last name.","zh":"（较少见）姓氏 “Mecum” 的复数，指多位姓 Mecum 的人。"},"examples":[{"en":"The Mecums in our town have lived here for generations.","zh":"我们镇上姓 Mecum 的那几家人已经在这里住了好几代。"}]}],"synonyms":["Mecum","Mecum’s (auction)","collector-car auction (general)"],"phonetic":"/ˈmiːkəmz/","extraExplanation":["在真实语境里，你更常看到 “Mecum” 或 “Mecum’s”（表示“梅库姆的拍卖会/公司”）。口语或标题里有人会用 “Mecums” 来简写“梅库姆拍卖会”，类似于用 “Sotheby’s” 指苏富比拍卖行。","如果你本来想问的是别的拼写（例如 meccums / mecum），把完整句子或上下文贴出来，我可以帮你确认具体意思。"]}
{"word":"mecurial","summary":{"en":"Mercurial means changing quickly and unpredictably, especially moods; it can also mean lively and quick-moving.","zh":"Mercurial 指（尤指情绪）变化无常、难以预测；也可指活泼敏捷、变化快的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or mood) Changing quickly and often unpredictably; moody.","zh":"（形容人或情绪）变化无常的；喜怒不定的。"},"examples":[{"en":"Her mercurial moods made it hard to plan a long meeting.","zh":"她的情绪变化无常，很难安排一场长时间的会议。"},{"en":"He can be warm one minute and distant the next—very mercurial.","zh":"他上一分钟还很热情，下一分钟就很冷淡——非常喜怒无常。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of behavior or style) Lively, quick, and full of energy, sometimes in a hard-to-predict way.","zh":"（形容行为或风格）活泼敏捷、充满活力的（有时带点难以捉摸）。"},"examples":[{"en":"The interviewer’s mercurial style kept the conversation moving fast.","zh":"采访者灵活机敏的风格让对话节奏很快。"},{"en":"The film shifts in a mercurial way from comedy to sadness.","zh":"这部电影以一种难以捉摸的方式从喜剧转到悲伤。"}]}],"synonyms":["moody","temperamental","unpredictable","changeable","volatile","capricious"],"phonetic":"/mərˈkjʊriəl/","extraExplanation":["你写的“mecurial”常见拼写是 **mercurial**（多了一个 r）。","词源/文化背景：**mercurial** 来自 Mercury（罗马神祇墨丘利/水星）。墨丘利是“信使”，行动迅速、变化快，因此该词常用来形容性格或情绪“变得很快”。","注意区分：**mercurial**（变化无常的）≠ **mercury**（汞；水星）。在现代英语里，mercurial 通常不再直接表示“含汞的”，而更常指人的气质。"]}
{"word":"mecurialism","summary":{"en":"Mercurialism means mercury poisoning, especially from long-term exposure.","zh":"Mercurialism 指“汞中毒”，尤指长期接触汞导致的中毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Mercury poisoning, especially a long-term condition caused by exposure to mercury (for example at work, from contaminated food, or from certain chemicals).","zh":"（医学）汞中毒；尤指因长期接触汞而引起的慢性中毒（如职业暴露、受污染食物或某些化学品）。"},"examples":[{"en":"The doctor suspected mercurialism after hearing about his years working with mercury in a factory.","zh":"医生听说他在工厂多年接触汞后，怀疑他患有汞中毒。"},{"en":"Symptoms of mercurialism can include tremors, memory problems, and mood changes.","zh":"汞中毒的症状可能包括手抖、记忆问题以及情绪变化。"},{"en":"Better ventilation and protective equipment helped reduce cases of mercurialism in the workplace.","zh":"改善通风与防护装备有助于减少职场中的汞中毒病例。"}]}],"synonyms":["mercury poisoning","chronic mercury poisoning","hydrargyria"],"phonetic":"/mərˈkjʊriəˌlɪzəm/","extraExplanation":["你输入的 **mecurialism** 更常见的拼写是 **mercurialism**（和 mercury“汞”相关）。","词源来自 **Mercury**（拉丁语 *Mercurius*，罗马神墨丘利；同时也是英语里“汞”的名称）。这里的 *-ism* 表示“某种状态/病症”。","不要与 **mercurial**（adj. “善变的、反复无常的”）混淆：**mercurialism** 指的是“汞引起的中毒/病症”，不是性格善变。"]}

