{"word":"meh","summary":{"en":"an informal expression of indifference or mediocrity","zh":"口语中表示无所谓或“一般般”的态度"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show you are not interested, not impressed, or don’t care much (a feeling of indifference).","zh":"用于表示无所谓、不感兴趣或不太在意（冷淡/无感的态度）。"},"examples":[{"en":"“Do you want to watch the movie?” “Meh.”","zh":"“你想看那部电影吗？”“meh（无所谓/一般般）。”"},{"en":"I asked if he liked the new design, and he just said, “Meh.”","zh":"我问他喜不喜欢新设计，他就回了句：“meh（一般般）。”"}]},{"partOfSpeech":"adj.","definition":{"en":"Mediocre; not very good; only so-so.","zh":"一般般的；平平无奇的；不怎么样的。"},"examples":[{"en":"The food was meh—nothing special.","zh":"食物一般般——没什么特别的。"},{"en":"I had a meh day at work.","zh":"我工作的一天过得平平无奇。"}]}],"synonyms":["whatever","so-so","indifferent","unimpressive","blah"],"phonetic":"/mɛ/","extraExplanation":["语域：非常口语、很随意；在正式写作或正式场合尽量避免。","语气：通常带一点“懒得评价/不太买账”的感觉；对人使用可能显得不礼貌，更多用来评价事或表达心情。"],"etymology":"多用于美式口语与网络语气词。词源不十分确定；常见说法是受意第绪语（Yiddish）表达冷淡态度的语气影响，并在英语流行文化中（如《辛普森一家》）被广泛传播后固定为“无感/一般般”的用法。","mnemonic":["联想中文“嗯…（就这样吧）/随便啦”的语气：张口发一个短促的“meh”，就是“没感觉”。","把它想成“没(mei)→meh”：看到 meh 就记“没啥特别/没兴趣”。"]}
{"word":"mehalla","summary":{"en":"Mehalla (more commonly spelled mahalla) means a neighborhood or local community, and sometimes an administrative ward.","zh":"mehalla（更常见拼写为mahalla）指“街区/社区”，有时也指“基层行政区/坊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, Middle East) a neighborhood or local community within a town or city, often centered around shared social, religious, or family ties.","zh":"（南亚与中东）街区；社区（城市中的邻里单位，常因社会、宗教或家族关系而形成）"},"examples":[{"en":"She grew up in a close-knit mehalla where everyone knew each other.","zh":"她在一个关系很紧密的mehalla里长大，大家彼此都认识。"},{"en":"The wedding procession moved through the mehalla, and neighbors came out to watch.","zh":"迎亲队伍穿过mehalla，邻居们都出来观看。"}]},{"partOfSpeech":"n.","definition":{"en":"In some places, a local administrative unit or ward (a smaller area used for community organization or local government).","zh":"（某些地区）基层行政区；坊（用于社区组织或地方管理的较小区域）"},"examples":[{"en":"The city divided services by mehalla to make local support easier.","zh":"这座城市按mehalla划分公共服务，以便更方便地提供基层支持。"}]}],"synonyms":["neighborhood","community","district","ward"],"phonetic":"/məˈhɑːlə/","extraExplanation":["“mehalla”更常见的拼写是“mahalla”。它来自阿拉伯语（محلة，意为“居住地/落脚处”），在乌尔都语、波斯语、土耳其语及中亚语言中也很常见。","在南亚语境里，“mahalla/mehalla”常带有“熟人社会、邻里互助”的文化含义，不仅指地理上的街区，也暗示一种紧密的社区关系。"]}
{"word":"mehari","summary":{"en":"A mehari is a fast riding camel used in the Sahara, especially for travel or camel-mounted patrols.","zh":"mehari 指撒哈拉地区常用来快速骑乘、长途旅行或巡逻的骑乘骆驼（多为单峰骆驼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fast riding camel (usually a dromedary) used in North Africa and the Sahara, especially by desert travelers or camel troops","zh":"一种适合快速骑乘的骆驼（多为单峰骆驼），常见于北非与撒哈拉地区，常用于沙漠行旅或骆驼骑兵"},"examples":[{"en":"The guide saddled a mehari before we crossed the dunes.","zh":"向导在我们穿越沙丘前给一头梅哈里骑乘骆驼上了鞍。"},{"en":"In older accounts of the Sahara, meharis are described as swift and enduring.","zh":"在较早的撒哈拉记述中，梅哈里常被描写为迅捷而耐力惊人。"}]}],"synonyms":["riding camel","dromedary (often)","camel mount"],"phonetic":"/məˈhɑːri/","extraExplanation":["“mehari”常见拼写也有法语形式“méhari”。它是从法语借入英语的词，法语又来自阿拉伯语“mahārī”，原意与“优良、适合骑乘的骆驼（常指单峰骆驼）”有关。","在历史与旅行文字中，“mehari”常带有撒哈拉沙漠文化背景，尤其与图阿雷格人、沙漠邮递/巡逻、以及骆驼骑兵（méharistes）等主题相关。"]}
{"word":"meharis","summary":{"en":"Meharis are fast riding camels used especially in North African and Saharan deserts.","zh":"Meharis 指在北非与撒哈拉地区用于骑乘、速度较快的骆驼（多为单峰骆驼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"fast riding camels (especially dromedaries) used in North Africa and the Sahara, often for travel, patrols, or desert transport","zh":"（尤指北非与撒哈拉地区用于骑乘、巡逻或长途旅行的）快跑骑乘骆驼（多为单峰骆驼）"},"examples":[{"en":"The patrol crossed the dunes on meharis.","zh":"巡逻队骑着快跑骆驼穿越了沙丘。"},{"en":"In older travel writing, meharis are described as the “desert’s cavalry.”","zh":"在较早的游记中，快跑骑乘骆驼常被形容为“沙漠的骑兵”。"}]}],"synonyms":["riding camels","dromedaries"],"phonetic":"/məˈhɑːriz/","extraExplanation":["“meharis”是“mehari”的复数。该词常见于法语/英语的北非与撒哈拉语境：法语里有“méhariste”（骑乘骆驼的士兵/部队）一词，常指殖民时期在沙漠地区机动巡逻的骑兵式单位。","与一般用于驮运的骆驼相比，mehari更强调“速度快、适合长距离骑行与机动”。在文学与旅行书写中，它常带有沙漠探险与远行的色彩。"]}
{"word":"meharist","summary":{"en":"A meharist is a camel rider, especially a soldier or messenger who operates in desert regions.","zh":"meharist 指骑骆驼的人，尤指在沙漠地区骑骆驼执行军事或传信任务的士兵/信使。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a camel rider, especially a soldier or courier who travels and fights on a camel (common in North Africa and the Middle East)","zh":"骑骆驼的人；（尤指）骑骆驼作战或传递消息的士兵/信使（多见于北非和中东）"},"examples":[{"en":"In the desert, meharists could travel far faster than infantry.","zh":"在沙漠里，meharists 的行进速度比步兵快得多。"},{"en":"The novel describes a meharist patrol crossing the dunes at dawn.","zh":"小说描写了一支 meharist 巡逻队在黎明穿越沙丘。"},{"en":"Historically, some armies relied on meharists for scouting and long-distance messages.","zh":"历史上，一些军队依靠 meharists 进行侦察和远距离传信。"}]}],"synonyms":["camel rider","camel-mounted soldier","trooper (context-dependent)"],"phonetic":"/ˈmɛhəˌrɪst/","extraExplanation":["该词较少见，多出现在历史、军事或殖民时期北非题材的写作中。常与“camel corps（骆驼部队）”“desert patrol（沙漠巡逻）”等搭配。","词源与阿拉伯语中指“快速骆驼”的词有关，因此 meharist 往往暗示使用速度快、适合长途跋涉的骆驼。"]}
{"word":"mehelya","summary":{"en":"“mehelya” is not a standard English word; it’s likely a name or a misspelling/romanization from another language.","zh":"“mehelya”不是标准英语词，更可能是名字或来自其他语言的拼写/转写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word in English; most likely a personal name, username, or a misspelling/romanization of a word from another language.","zh":"不是标准英语词；更可能是人名、用户名，或其他语言词语的拼写/转写。"},"examples":[{"en":"I couldn’t find “mehelya” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里查不到“mehelya”——你能给我一个出现它的句子吗？"},{"en":"“Mehelya” might be a name used online.","zh":"“Mehelya”可能是网络上使用的名字。"}]}],"phonetic":"/məˈheɪliə/","extraExplanation":["“mehelya”看起来更像专有名词（人名/地名/账号名）或外语转写，而不是常见英语词汇。不同来源的读法可能不同，所以需要上下文才能更准确：它出自哪本书/哪门语言/哪个网站？","如果你想查的是发音相近的英语词，也可能是拼写误差。你可以告诉我你原本想表达的意思，或提供相近拼写（例如：Mehdi、Michaela、Mahalia 等），我可以帮你定位最可能的词。"]}
{"word":"MeHg","summary":{"en":"a highly toxic organic mercury compound that can accumulate in living organisms","zh":"一种会在生物体内累积、毒性很强的有机汞化合物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"methylmercury; an organic mercury compound (a mercury atom bonded to a methyl group) that can strongly affect the nervous system and can build up in fish and humans.","zh":"甲基汞；一种有机汞化合物（汞原子与甲基相连），对神经系统毒性很强，可在鱼类与人体内累积。"},"examples":[{"en":"MeHg levels were measured in fish to assess potential health risks.","zh":"研究人员检测鱼类中的 MeHg 含量，以评估潜在健康风险。"},{"en":"Pregnant people are often advised to limit high‑mercury fish because MeHg can harm fetal development.","zh":"通常会建议孕期人群减少食用高汞鱼类，因为 MeHg 可能影响胎儿发育。"},{"en":"The report distinguishes between inorganic mercury and MeHg found in seafood.","zh":"报告区分了无机汞与海鲜中常见的 MeHg。"}]}],"synonyms":["methylmercury","monomethylmercury"],"phonetic":"/ˌmɛθəlˈmɝːkjəri/","extraExplanation":["常见于环境科学、毒理学与食品安全文献中。日常语境里更常直接写 full form：methylmercury。","MeHg 具有“生物放大”现象：在食物链中逐级累积，因此大型掠食性鱼类（如金枪鱼、旗鱼等）含量往往更高。"],"etymology":"缩写来自化学记号：Me 表示 methyl（甲基），Hg 是 mercury（汞）的元素符号；合起来指“甲基汞”。","mnemonic":["记忆法：Me=甲基（methyl），Hg=汞（元素符号），拼在一起就是“甲基+汞”。","把 Hg 想成“汞”的化学符号，Me 想成“Me=甲”，合起来更容易联想到“甲基汞”。"]}
{"word":"mehitzah","summary":{"en":"A mehitzah is a partition used in Orthodox Jewish synagogues to separate men and women during prayer.","zh":"mehitzah指正统派犹太会堂中用来在祈祷时分隔男女的隔断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Orthodox Judaism, a physical partition (often a curtain or wall) used in a synagogue to separate men and women during prayer.","zh":"（犹太教正统派）会堂里用来在祈祷时分隔男女的隔板/帘子/隔墙。"},"examples":[{"en":"The synagogue installed a mehitzah so men and women could pray in separate sections.","zh":"这座会堂安装了mehitzah，让男女在不同区域祈祷。"},{"en":"Some communities prefer a low mehitzah, while others use a taller, less see-through one.","zh":"有些社群偏好较矮的mehitzah；也有社群使用更高、更不透明的隔断。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, any kind of barrier or divider, especially one connected to Jewish religious practice.","zh":"（引申）任何隔离物/分隔物，尤指与犹太宗教实践相关的隔断。"},"examples":[{"en":"Writers sometimes use “mehitzah” as a symbol of separation within a community.","zh":"写作者有时用“mehitzah”来象征社群内部的隔阂与分离。"}]}],"synonyms":["partition","divider","screen","barrier"],"phonetic":"/məˈhɪt.sə/","extraExplanation":["“mehitzah”也常拼作“mechitza / mechitzah”。词源来自希伯来语（מְחִיצָה），本义是“隔断、屏障”。在正统派会堂中，它与性别分区（gender separation）这一祈祷礼仪有关；不同犹太社群对mehitzah的高度、材质与透明度可能有不同做法。"]}
{"word":"mehitzoth","summary":{"en":"“mehitzoth” isn’t recognized as a standard English word; it may be a name, a misspelling, or a transliteration from another language.","zh":"“mehitzoth”不是标准英语词；可能是人名、误拼，或来自其他语言的音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or a transliteration from another language (e.g., Hebrew/Yiddish).","zh":"不是标准英语词；可能是拼写错误、用户名，或来自其他语言（如希伯来语/意第绪语）的音译。"},"examples":[{"en":"I couldn’t find “mehitzoth” in an English dictionary—where did you see it?","zh":"我在英语词典里找不到“mehitzoth”——你是在哪里看到的？"},{"en":"If it’s a name or a Hebrew word, the meaning depends on the original spelling.","zh":"如果它是名字或希伯来语词，含义取决于原始拼写。"}]}],"phonetic":"/mɛˈhɪtsoʊθ/","extraExplanation":["“mehitzoth”更像是外来语的拉丁字母拼写（transliteration）。如果你能提供来源句子、语言背景（比如是否来自宗教/犹太文化语境）、或原文拼写（希伯来字母），我可以更准确地解释含义与用法。","它也可能是某个英文单词的误拼。请告诉我你想表达的意思或发音（例如：me-HIT-zoth? meh-HI-thoth?），我可以帮你猜测对应词。"]}
{"word":"mehmandar","summary":{"en":"A mehmandar is a host/attendant who looks after guests, often referring to a (male) flight attendant in Persian/Urdu contexts.","zh":"mehmandar 指负责照顾与接待客人的人员，在波斯语/乌尔都语语境中也常指（男性）空乘/乘务员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Persian/Urdu use) a host or attendant who looks after guests; in modern contexts, often a (male) flight attendant or steward.","zh":"（波斯语/乌尔都语用法）接待客人的人员、招待员；在现代语境中常指（男性）空乘/乘务员（steward）。"},"examples":[{"en":"The airline hired a new mehmandar to assist passengers on international flights.","zh":"这家航空公司新聘了一名 mehmandar，在国际航班上协助乘客。"},{"en":"At the wedding, the mehmandar guided guests to their seats.","zh":"在婚礼上，mehmandar 引导客人入座。"}]}],"synonyms":["host","attendant","steward","flight attendant"],"phonetic":"ˌmeɪmənˈdɑr","extraExplanation":["这个词常见于波斯语（Persian）与乌尔都语（Urdu）语境。词根“mehman/مهمان”意为“客人”，后面的“-dar/دار”有“持有者、负责者”的意思，合起来就是“负责照看客人的人”。","英语里更常用的对应词是：host（主人/接待者）、steward/flight attendant（空乘）。在一些地区与旧式用法中，mehmandar 可能偏向“（男性）乘务员”，女性有时会用相关形式（因地区而异）。"]}
{"word":"mehndi","summary":{"en":"Temporary henna body art (or the henna paste used for it).","zh":"用海娜染出的暂时性皮肤彩绘（或其海娜膏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional temporary body art made by staining the skin with henna paste, especially for weddings and festivals in South Asia, the Middle East, and North Africa.","zh":"用海娜（指甲花）膏在皮肤上染出图案的传统暂时性身体彩绘，常见于南亚、中东、北非的婚礼与节庆。"},"examples":[{"en":"She got mehndi on her hands the night before her wedding.","zh":"她在婚礼前一晚在手上画了海娜彩绘（mehndi）。"},{"en":"The artist applied mehndi in delicate floral patterns.","zh":"艺术家用细致的花卉图案涂绘海娜彩绘。"},{"en":"Mehndi fades naturally after one to three weeks.","zh":"海娜彩绘通常在一到三周内自然褪色。"}]},{"partOfSpeech":"n.","definition":{"en":"The henna paste used to create this body art.","zh":"用于绘制此类彩绘的海娜（指甲花）膏。"},"examples":[{"en":"The mehndi needs time to dry before you cover it.","zh":"海娜膏需要晾干后才能覆盖。"},{"en":"They mixed the mehndi to get a darker stain.","zh":"他们调配海娜膏以获得更深的染色效果。"}]}],"synonyms":["henna","henna art","henna tattoo"],"phonetic":"/ˈmɛn.di/","extraExplanation":["在很多文化里，mehndi 常与婚礼、成年礼、开斋节（Eid）、排灯节（Diwali）等庆典相关，图案多画在手掌、手背与脚部。","它通常是“染色”而非真正的刺青：颜色会随皮肤角质代谢逐渐变淡。不同配方与停留时间会影响颜色深浅。","英语里也常把这种图案称为 “henna” 或 “henna tattoo”（虽然不是永久纹身）。"],"etymology":"源自印地语/乌尔都语“mehndi/ مہندی”，本义与“海娜（henna）”染色有关；英语中多用来指婚礼节庆常见的海娜彩绘或其用的染膏。","mnemonic":["记忆法：把 mehndi 想成“henna 的印度/南亚叫法”，看到婚礼手上精美花纹就联想到 mehndi。","发音联想：/MEN-dee/ 听起来像“门第”，联想到“婚礼讲门第、喜庆场合做彩绘”。"]}
{"word":"Mehran","summary":{"en":"a personal name (given name/surname) and, in some contexts, an older regional name linked to the Indus River area","zh":"常见人名（名/姓）；在部分语境中也指与印度河流域相关的旧称或地域称呼"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name and surname used especially in Iran and other Persian-speaking communities","zh":"常见于伊朗及波斯语文化圈的名字（可作名或姓）"},"examples":[{"en":"Mehran is a common male given name in Iran.","zh":"Mehran 是伊朗常见的男性名字。"},{"en":"I met someone named Mehran at the conference.","zh":"我在会议上认识了一个叫 Mehran 的人。"}]},{"partOfSpeech":"other","definition":{"en":"a historical or regional name associated with the Indus River/Sindh area in South Asia (seen in literature and place-based references)","zh":"与南亚印度河/信德地区相关的历史或地域名称（常见于文献或地名语境）"},"examples":[{"en":"Some older writings refer to the Indus as the Mehran.","zh":"一些较早的文字会把印度河称作 Mehran。"},{"en":"The story is set near the old Mehran riverlands.","zh":"故事发生在旧时被称作 Mehran 的河流地带附近。"}]}],"synonyms":["Mihran"],"phonetic":"/ˈmɛrɑn/","extraExplanation":["作为人名时，Mehran 常被理解为带有“温暖、光明、友爱”等积极含义的名字（具体解释会因家庭、地区与拼写变体而略有不同）。","拼写上可能见到变体如 Mihran、Mehrān（带长音标记），发音也会随语言环境（英语/波斯语/乌尔都语等）略有变化。"],"etymology":"多认为与波斯语词根“mehr/مهر”有关，含义可关联“太阳、爱、仁慈/友善”等文化意象；同时在南亚历史语境中也用作对印度河及其流域的称呼之一，带有地域与文献传统色彩。","mnemonic":["把 Mehran 里的 “mehr” 联想成“温暖的光/太阳”，记成“带来温暖的人”。","中文记忆：把它想成“美-然”（音近），像“美好自然、温和友善”的感觉。"]}
{"word":"mehrdad","summary":{"en":"Mehrdad is a Persian male given name, common among Iranians.","zh":"Mehrdad 是一个波斯语男性名字，在伊朗人中较常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Persian (Iranian) origin.","zh":"一个波斯语（伊朗）来源的男性名字。"},"examples":[{"en":"Mehrdad is my classmate from Iran.","zh":"Mehrdad 是我来自伊朗的同学。"},{"en":"Please ask Mehrdad to join the meeting at 3 p.m.","zh":"请让 Mehrdad 下午三点参加会议。"}]}],"phonetic":"/mɛrˈdɑd/","extraExplanation":["“Mehrdad”常见于伊朗等波斯语文化圈，也可转写为 Mehrdad / Mehrdād / Mihrdad。","名字的词源通常被解释为与古伊朗神祇“密特拉（Mithra/Mehr）”有关，整体含义常被理解为“（由密特拉）赐予的、给予的”。在不同转写体系中拼写会略有差异。"]}
{"word":"Mehri","summary":{"en":"the Mehri (Mahri) language, or things connected to it and its speakers","zh":"梅赫里语（或与该语言及其使用者相关的事物）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Modern South Arabian language spoken mainly in Oman and eastern Yemen","zh":"梅赫里语（现代南阿拉伯语支的一种语言，主要在阿曼与也门东部使用）"},"examples":[{"en":"Mehri is still spoken in parts of Dhofar, Oman.","zh":"在阿曼佐法尔地区的一些地方，梅赫里语仍在使用。"},{"en":"The researcher recorded stories in Mehri to help preserve the language.","zh":"研究者用梅赫里语录下故事，以帮助保存这门语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mehri language or the Mehri-speaking people","zh":"与梅赫里语或梅赫里语使用者（族群）有关的"},"examples":[{"en":"She studies Mehri grammar and vocabulary.","zh":"她研究梅赫里语的语法和词汇。"},{"en":"They collected Mehri folk songs from local communities.","zh":"他们从当地社区收集了梅赫里民歌。"}]}],"synonyms":["Mahri","Modern South Arabian language"],"phonetic":"/ˈmɛri/","extraExplanation":["梅赫里语属于“现代南阿拉伯语”（Modern South Arabian languages），与阿拉伯语同属闪语族（Semitic），但不是阿拉伯语方言；在词汇与语法上有不少独特之处。","在英语语境里，Mehri 既可指语言，也可作形容词指“与梅赫里语/梅赫里人相关”。学术文章中也常见拼写 Mahri。"],"etymology":"源自阿拉伯语中对马赫拉（Mahra/Mahrah）地区与其居民/语言的称呼；英语里常见拼写为 Mehri 或 Mahri，用来指该地区相关的语言与族群。","mnemonic":["把 Mehri 读成“MEH-ree”，联想“梅-赫-里”三个音节，对应中文音译“梅赫里”。","记法：Mehri 常与 Oman（阿曼）/Yemen（也门）一起出现——想到“阿曼/也门东部的少数语言”。"]}
{"word":"mehtar","summary":{"en":"Mehtar is a South Asian term meaning either a sanitation worker (dated usage) or, historically, a ruler’s title (especially in Chitral).","zh":"Mehtar 是南亚词语：可指（较旧用法）环卫/清洁工，也可指历史上的统治者头衔（尤指奇特拉尔的“统治者”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, dated) A sanitation worker; a sweeper.","zh":"（南亚英语，较旧用法）清洁工；扫地/清扫厕所的人。"},"examples":[{"en":"The alley was cleaned every morning by a mehtar.","zh":"这条小巷每天早上都会由一位清洁工来打扫。"},{"en":"The novel mentions a mehtar sweeping the courtyard at dawn.","zh":"小说里提到黎明时有位清洁工在院子里扫地。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, South Asia) A title meaning “chief/ruler,” especially the ruler of Chitral (in present-day Pakistan).","zh":"（历史用语，南亚）意为“首领/统治者”的头衔，尤指（今巴基斯坦）奇特拉尔的统治者称号。"},"examples":[{"en":"The Mehtar of Chitral maintained relations with neighboring states.","zh":"奇特拉尔的统治者与周边邦国保持往来。"},{"en":"The museum label refers to a treaty signed under the Mehtar.","zh":"博物馆说明牌提到一份在该统治者任内签署的条约。"}]}],"synonyms":["sanitation worker","cleaner","sweeper","chief","ruler"],"phonetic":"/ˈmɛtɑr/","extraExplanation":["“mehtar”在不同地区可能来自不同词源：一支常见解释是源自波斯语/乌尔都语中表示“更大者、首领”的词（如 *mihter* 一类），因此可作统治者头衔；但在英属印度时期的英语记录里，它也常被用来指从事清扫工作的劳动者。","注意文化语境：在印度/巴基斯坦等地，把“mehtar”用作“清洁工”有时带有阶层/种姓歧视色彩，现代正式表达更建议用中性说法，如 *sanitation worker*（环卫工人）或 *cleaner*（清洁工）。"]}
{"word":"mehtarship","summary":{"en":"Mehtarship means the office or tenure of a mehtar (a traditional ruler/chief, especially in Chitral).","zh":"Mehtarship 指 mehtar（传统统治者/首领，尤指奇特拉尔）的职位或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, title, or period of being a mehtar (a chief/ruler in parts of South Asia, especially Chitral; sometimes also the head servant in older usage).","zh":"“mehtar（梅赫塔尔）”的职位、头衔或任期（在南亚部分地区，尤指奇特拉尔 Chitral 的统治者/首领；旧式用法中也可指“大管家/首席仆役”）。"},"examples":[{"en":"After the previous ruler died, a dispute broke out over the mehtarship.","zh":"前任统治者去世后，关于梅赫塔尔之位（mehtarship）的继承引发了争端。"},{"en":"The book describes how the mehtarship shaped local politics in Chitral.","zh":"这本书描述了梅赫塔尔制度（mehtarship）如何影响奇特拉尔的地方政治。"}]}],"synonyms":["chieftainship","leadership","rule","reign","office","tenure"],"phonetic":"/ˈmɛh.tɑr.ʃɪp/","extraExplanation":["“Mehtarship”是由“mehtar + -ship”构成：-ship 常用来表示“身份/职位/状态/任期”（如 friendship 友谊，leadership 领导地位）。","mehtar 一词在南亚语境里多与历史政体有关，尤其指奇特拉尔（今巴基斯坦北部地区）传统统治者的称号；在部分旧式英语或殖民时期文献里，mehtar 也可能被用来指“首席仆役/管家”。阅读时可根据上下文判断。"]}

