{"word":"MEK","summary":{"en":"a common industrial cleaning and paint solvent (methyl ethyl ketone)","zh":"常见的工业清洗与油漆溶剂（甲基乙基酮/2-丁酮）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorless, strong-smelling industrial solvent used to dissolve paints, coatings, adhesives, and to clean equipment; short for methyl ethyl ketone (2-butanone).","zh":"一种无色、气味强烈的工业溶剂，用于溶解油漆、涂层、胶黏剂并清洗设备；为“methyl ethyl ketone（甲基乙基酮/2-丁酮）”的缩写。"},"examples":[{"en":"The technician cleaned the tools with MEK before the coating dried.","zh":"技师在涂层干掉之前用 MEK 清洗了工具。"},{"en":"Some adhesives list MEK as an ingredient, so use good ventilation.","zh":"有些胶水的成分里标有 MEK，所以要保持良好通风。"},{"en":"MEK can damage some plastics, so test it on a small area first.","zh":"MEK 可能会腐蚀某些塑料，所以先在小面积测试。"}]}],"synonyms":["methyl ethyl ketone","2-butanone","butanone"],"phonetic":"/mɛk/","extraExplanation":["常见于工业与实验室语境（油漆、涂料、树脂、胶黏剂、清洗剂）。日常交流中一般不会单独说 MEK，更多出现在产品标签或安全数据表（SDS）里。","属于易燃溶剂，使用时通常强调通风、远离火源并佩戴适当防护（如手套）。"],"etymology":"“MEK”是化学品名“methyl ethyl ketone”的首字母缩写；该物质也常用系统命名“2-butanone（2-丁酮）”。","mnemonic":["把 MEK 记成“抹一抹（M-E-K）就干净”：联想到它常用于清洗、去胶、溶解油漆。","记三字母：Methyl + Ethyl + Ketone → MEK。"]}
{"word":"mekanik","summary":{"en":"“Mekanik” is a nonstandard spelling; in English use “mechanic” (a repair worker) or “mechanical” (related to machines).","zh":"“mekanik”不是标准英语拼写；英语中应使用“mechanic”（修理工）或“mechanical”（机械的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Standard English spelling: mechanic) A person whose job is to repair and maintain machines, especially cars.","zh":"（标准英语拼写：mechanic）机械修理工；（尤指）汽车修理工。"},"examples":[{"en":"My car wouldn’t start, so I took it to a mechanic.","zh":"我的车发动不了，所以我把它送去找修理工。"},{"en":"The mechanic checked the engine and changed the oil.","zh":"修理工检查了发动机并换了机油。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The way something works; the rules or process behind an activity.","zh":"（较少见）运作方式；（活动的）机制、规则或流程。"},"examples":[{"en":"The mechanics of the game are easy to learn.","zh":"这个游戏的机制很容易学。"},{"en":"Let’s talk about the mechanics of how the plan will work.","zh":"我们来谈谈这个计划将如何运作的具体流程。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to machines or physical movement; mechanical.","zh":"（非正式/少见作形容词）与机器或物理运动有关的；机械的。"},"examples":[{"en":"He has a mechanic background and understands how engines work.","zh":"他有机械方面的背景，懂发动机的原理。"}]}],"synonyms":["repairman","technician","auto mechanic","mechanical"],"phonetic":"/məˈkænɪk/","extraExplanation":["“mekanik”不是标准英语拼写，常见于印尼语/土耳其语等语言中，对应英语的“mechanic”（修理工）或“mechanical”（机械的）。在英语写作和考试中建议使用标准拼写。","注意区分：mechanic（人：修理工） vs. mechanics（学科：力学/机械学，或“机制”） vs. mechanical（形容词：机械的）。"]}
{"word":"mekbuda","summary":{"en":"Mekbuda is mainly used as a feminine personal name; it is not a common English vocabulary word.","zh":"Mekbuda 主要作为女性人名使用，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (usually feminine) found in some Turkish- and Arabic-influenced cultures; often explained as meaning “beloved/accepted,” though spellings and meanings vary by region.","zh":"一个人名（多为女性名），见于部分受土耳其语和阿拉伯语影响的文化中；常被解释为“被爱的人/被接纳的人”，但不同地区的拼写与释义可能不一致。"},"examples":[{"en":"Mekbuda is my great-grandmother’s name.","zh":"Mekbuda 是我曾祖母的名字。"},{"en":"I’m not sure how to spell Mekbuda in English letters—there are several versions.","zh":"我不确定 Mekbuda 用英文拼写该怎么写——有好几种写法。"}]}],"synonyms":["(name)"],"phonetic":"/mɛkˈbuːdə/","extraExplanation":["“Mekbuda”更常见于姓名而非普通英语词汇。它可能是某些地区对阿拉伯语来源名字的转写（不同转写会出现 Makbuda/Meqbuda 等形式），含义常被民间解释为“受喜爱、被接纳”等。由于是音译名，准确含义往往需要结合原始拼写（阿拉伯字母/土耳其语拼写）与家族或地区用法。","如果你告诉我它出现的语境（例如：书里的人名、证件拼写、来自哪个国家/语言），我可以更准确地给出发音、可能的原文拼写与含义。"]}
{"word":"mekhitarist","summary":{"en":"Mekhitarist: a member of (or related to) an Armenian Catholic monastic order famous for scholarship and publishing.","zh":"mekhitarist：指麦希塔尔会的成员，或与该亚美尼亚天主教修会相关；以学术与出版著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mekhitarist Order, an Armenian Catholic congregation of monks known for scholarship, publishing, and preserving Armenian language and culture","zh":"麦希塔尔会（Mekhitarist Order）的成员；亚美尼亚天主教修会的修士团体，以学术研究、出版与保存亚美尼亚语言文化著称"},"examples":[{"en":"A Mekhitarist monk helped publish rare Armenian manuscripts.","zh":"一位麦希塔尔会修士协助出版了珍贵的亚美尼亚手稿。"},{"en":"The library was founded by the Mekhitarists and became a center for Armenian studies.","zh":"这座图书馆由麦希塔尔会创建，后来成为亚美尼亚研究的中心。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mekhitarist Order or its institutions (such as schools, monasteries, or publications)","zh":"与麦希塔尔会或其机构（如学校、修道院、出版物）相关的"},"examples":[{"en":"She visited a Mekhitarist monastery in Venice.","zh":"她参观了威尼斯的一座麦希塔尔会修道院。"},{"en":"The museum displayed Mekhitarist editions of Armenian classics.","zh":"博物馆展出了麦希塔尔会出版的亚美尼亚经典版本。"}]}],"synonyms":["Mekhitarist monk","member of the Mekhitarist Order","Armenian Catholic monk"],"phonetic":"/ˈmɛkɪtəˌrɪst/","extraExplanation":["“Mekhitarist”来自修会创立者Mekhitar（麦希塔尔，意为“慰藉者/安慰者”的传统解释之一）的名字。该修会18世纪初形成，后来在威尼斯圣拉扎罗岛（San Lazzaro degli Armeni）与维也纳等地发展出重要的印刷与学术中心。","在英文语境里，这个词多出现在历史、宗教研究、亚美尼亚学（Armenian studies）、图书馆与出版史等领域；常见搭配有“Mekhitarist monastery / library / press”。"]}
{"word":"mekilta","summary":{"en":"Mekilta is a rabbinic midrash (commentary) best known for interpreting the book of Exodus, often with a focus on Jewish law.","zh":"Mekilta（米基尔塔）是犹太拉比传统的米德拉什（经文释义）文献，最著名的是对《出埃及记》的诠释，且常偏重律法讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish rabbinic commentary (midrash), especially a collection of teachings that explains and interprets the book of Exodus, often focusing on Jewish law (halakhah).","zh":"犹太拉比传统中的《米基尔塔》（一种米德拉什/经文诠释文献），尤指对《出埃及记》的讲解与阐释汇编，常侧重犹太律法（哈拉卡）。"},"examples":[{"en":"In her class on Exodus, the professor assigned passages from the Mekilta.","zh":"在她讲授《出埃及记》的课上，教授布置了《米基尔塔》的节选阅读。"},{"en":"The Mekilta offers rabbinic interpretations that connect biblical verses to legal principles.","zh":"《米基尔塔》提供拉比式解读，把《圣经》经文与律法原则联系起来。"}]}],"synonyms":["midrash","rabbinic commentary","halakhic midrash"],"phonetic":"/məˈkɪl.tə/","extraExplanation":["“Mekilta”（更常见拼写为 Mekhilta）源自亚兰语/希伯来语传统用法，意思大致与“规条、度量、文本汇编/选编”相关；在学术语境中常指两部主要作品：Mekhilta de-Rabbi Ishmael（较常引用）与 Mekhilta de-Rabbi Shimon bar Yochai。","它属于“哈拉卡式米德拉什”（halakhic midrash）：不只是讲故事或道德劝勉，也常从经文细节推导出律法讨论，因此常出现在犹太经典与经文释义研究中。","英语语境里有时会把它泛称为“the Mekilta”，但在正式写作中最好标明具体版本（如 de-Rabbi Ishmael）。"]}
{"word":"Mekka","summary":{"en":"Mekka is an alternative spelling of Mecca, the holy city of Islam, and it can also mean a top destination or center for a particular interest.","zh":"Mekka 是 Mecca（麦加）的另一种拼写，既指伊斯兰教圣城，也可比喻某领域的中心或“必去之地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Another spelling of Mecca: the holy city in western Saudi Arabia, the birthplace of the Prophet Muhammad and the most sacred city in Islam.","zh":"（专有名词）Mecca 的另一种拼写：位于沙特阿拉伯西部的圣城，是先知穆罕默德的诞生地，也是伊斯兰教最神圣的城市。"},"examples":[{"en":"Millions of Muslims travel to Mekka (Mecca) for the Hajj each year.","zh":"每年都有数以百万计的穆斯林前往麦加（Mekka/Mecca）朝觐。"},{"en":"In Islam, prayers are directed toward Mekka.","zh":"在伊斯兰教中，礼拜时面向麦加。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A place seen as the most important center for a particular activity or group; a “must-visit” destination for fans or professionals.","zh":"（比喻）某个领域或群体心目中最重要的中心地；爱好者或从业者“必去”的地方。"},"examples":[{"en":"Silicon Valley is often called the Mekka of tech innovation.","zh":"硅谷常被称为科技创新的“麦加”。"},{"en":"For jazz lovers, New Orleans can feel like a Mekka.","zh":"对爵士乐迷来说，新奥尔良就像一座“麦加”。"}]}],"synonyms":["Mecca","(figurative) hub","(figurative) center"],"phonetic":"/ˈmɛkə/","extraExplanation":["“Mekka”常见于德语、斯堪的纳维亚语等语言环境中对“Mecca（麦加）”的转写；英语里更常用拼写是“Mecca”。","在英语中把某地称为“a mecca”属于常见比喻用法，但因“Mecca/麦加”具有强烈宗教意义，写作或公开场合使用时注意语境与尊重，避免轻佻或贬义。"]}
{"word":"mekometer","summary":{"en":"A mekometer is a high-precision electronic distance-measuring instrument used in surveying/metrology.","zh":"mekometer 指用于测绘/计量的高精度电子测距仪（常用于基线校准等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very precise electronic instrument used in surveying to measure distances (often for calibrating measurement baselines).","zh":"（测量/测绘用的）高精度电子测距仪；常用于测量基线校准。"},"examples":[{"en":"The survey team used a mekometer to measure the baseline with millimeter accuracy.","zh":"测量队用 mekometer 以毫米级精度测量基线。"},{"en":"Mekometers are often used in metrology labs to verify distance standards.","zh":"Mekometer 常用于计量实验室，用来校验距离标准。"}]}],"synonyms":["electronic distance meter (EDM)","distance meter","surveying rangefinder"],"phonetic":"/ˈmiːkəˌmɪtər/","extraExplanation":["“Mekometer”较常见于测绘与计量领域，多指某类高精度电子测距设备（EDM），在英文日常语境中并不常用。","词形可拆为“me(asure) + ko + meter”（不同资料解释略有差异），但核心含义就是“用于精密测距的仪器”。实际文本中也可能是品牌/型号名称，因此大小写与具体含义需要结合上下文判断（如某公司产品手册）。"]}
{"word":"Mekong","summary":{"en":"Mekong usually refers to the Mekong River in Southeast Asia, and sometimes to the wider Mekong region/basin.","zh":"Mekong 通常指东南亚的湄公河，也可指更广义的湄公河流域／地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major river in Southeast Asia that flows from China through Myanmar, Laos, Thailand, Cambodia, and Vietnam to the South China Sea.","zh":"湄公河：东南亚重要河流，源于中国，流经缅甸、老挝、泰国、柬埔寨与越南，最终注入南海。"},"examples":[{"en":"The Mekong is one of the longest rivers in Asia.","zh":"湄公河是亚洲最长的河流之一。"},{"en":"Many communities along the Mekong depend on fishing and farming.","zh":"湄公河沿岸许多社区依靠渔业与农业生活。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for the Mekong River basin/region, especially when talking about ecology, economy, or politics.","zh":"（引申）湄公河流域／地区：常用于讨论生态、经济或政治时对该区域的简称。"},"examples":[{"en":"Climate change is affecting the Mekong through droughts and rising temperatures.","zh":"气候变化正通过干旱与升温影响湄公河流域。"},{"en":"Several countries cooperate on development projects in the Mekong.","zh":"多国在湄公河地区合作推进发展项目。"}]}],"synonyms":["Mekong River"],"phonetic":"/ˈmeɪkɔŋ/","extraExplanation":["“Mekong”常见搭配是 Mekong River（湄公河）与 Mekong Delta（湄公河三角洲，位于越南南部）。","湄公河在不同国家有不同称呼：在中国常称“澜沧江”（上游河段）。因此在阅读新闻或地理文章时，可能会看到 Lancang–Mekong（澜湄）这样的写法。","它不仅是地理名词，也常出现在环境与国际合作语境中，例如水资源分配、水电站建设、生物多样性保护等议题。"]}
{"word":"Mekran","summary":{"en":"a coastal region in Iran and Pakistan, also known as Makran","zh":"伊朗与巴基斯坦交界的阿拉伯海沿岸地区（亦作 Makran/马克兰）"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a coastal region along the Arabian Sea, mainly in southwestern Pakistan (Balochistan) and southeastern Iran; often spelled “Makran.”","zh":"阿拉伯海沿岸的一个地区，主要位于巴基斯坦西南部（俾路支省）和伊朗东南部；常见拼写为“Makran（马克兰）”。"},"examples":[{"en":"Gwadar lies on the Mekran (Makran) coast of Pakistan.","zh":"瓜达尔位于巴基斯坦的梅克兰（马克兰）海岸。"},{"en":"Trade routes once connected the Mekran coast with the Persian Gulf and India.","zh":"过去，贸易路线把梅克兰海岸与波斯湾和印度连接起来。"}]}],"synonyms":["Makran"],"phonetic":"/məˈkrɑn/","extraExplanation":["在英文资料里更常见的是拼写“Makran”。如果你是在地图、新闻或历史书里看到“Mekran”，通常就是同一个地方名的不同拼法（转写差异）。","该地区在古代与中世纪的海上贸易、印度洋航线、以及俾路支文化历史中经常被提及。"],"etymology":"来自波斯语/历史地名“Makrān（马克兰）”，指伊朗与巴基斯坦之间的沿海地带；英语中常见拼写为 Makran，“Mekran”属于较少见的转写。","mnemonic":["把它记成“Me + kran”：看到“海岸/港口/俾路支/伊朗-巴基斯坦边境”这些线索，就联想到这个地名。","联想中文“马克兰（Makran）”更常见：Mekran≈Makran，读音和指向同一地区。"]}

