{"word":"mepacrine","summary":{"en":"Mepacrine (quinacrine) is an older antimalarial drug, especially known from World War II use.","zh":"Mepacrine（奎纳克林/quinacrine）是一种较早期的抗疟药，尤其因二战时期的使用而为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drug (also called quinacrine) once widely used to prevent or treat malaria; today it is less common because other antimalarial medicines are usually preferred.","zh":"一种药物（也叫 quinacrine/奎纳克林），过去常用于预防或治疗疟疾；如今较少使用，因为通常有更常用的抗疟药可选。"},"examples":[{"en":"During World War II, mepacrine was issued to many soldiers to help prevent malaria.","zh":"在第二次世界大战期间，mepacrine 曾发给许多士兵用于预防疟疾。"},{"en":"The doctor explained that mepacrine has largely been replaced by newer antimalarial drugs.","zh":"医生解释说，mepacrine 在很大程度上已被更新的抗疟药所取代。"}]}],"synonyms":["quinacrine"],"phonetic":"/ˈmɛp.ə.kriːn/","extraExplanation":["“mepacrine”是英式用名，更常见的通用名是“quinacrine（奎纳克林）”。它在20世纪（尤其二战时期）因抗疟需求而出名。","这类药物有时会让皮肤出现偏黄或黄绿色的染色，在历史记载中常被提到；但具体用药与安全性应以医生指导为准。"]}
{"word":"meperidine","summary":{"en":"Meperidine is a prescription opioid painkiller used for moderate to severe pain.","zh":"Meperidine（哌替啶）是一种用于中到重度疼痛的处方阿片类止痛药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong prescription pain medicine (an opioid) used to treat moderate to severe pain, often in hospitals.","zh":"一种强效处方止痛药（阿片类），用于缓解中到重度疼痛，常见于医院使用。"},"examples":[{"en":"The patient was given meperidine after surgery to manage severe pain.","zh":"病人在手术后使用哌替啶来控制剧烈疼痛。"},{"en":"Meperidine can cause drowsiness, so the nurse monitored his breathing.","zh":"哌替啶可能引起嗜睡，所以护士监测了他的呼吸。"}]}],"synonyms":["pethidine","Demerol"],"phonetic":"/məˈpɛrɪˌdin/","extraExplanation":["在美国，meperidine 是该药物的通用名；在一些地区你也可能见到名称 pethidine（哌替啶），指的是同一种药。","它属于阿片类镇痛药（opioid analgesic）。学习与就医沟通相关英语时，常与 side effects（副作用）、drowsiness（嗜睡）、nausea（恶心）、respiratory depression（呼吸抑制）等词一起出现。","这是医学/药学词汇，日常对话中并不常用；更多出现在病历、医嘱或医院场景中。"]}
{"word":"mephenytoin","summary":{"en":"Mephenytoin is an older anticonvulsant drug used for epilepsy, now rarely used due to safety risks.","zh":"Mephenytoin（美苯妥英）是一种较早期的抗癫痫药物，因安全风险如今很少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an anti-seizure (anticonvulsant) medicine, now rarely used because it can cause serious side effects","zh":"一种抗癫痫（抗惊厥）药物；由于可能引起严重副作用，如今很少使用"},"examples":[{"en":"Mephenytoin was once prescribed for epilepsy but is seldom used today.","zh":"美苯妥英曾用于治疗癫痫，但如今已很少使用。"},{"en":"Because of safety concerns, many doctors prefer newer anticonvulsants over mephenytoin.","zh":"由于安全性顾虑，许多医生更倾向使用较新的抗惊厥药，而不是美苯妥英。"}]}],"synonyms":["anticonvulsant","anti-seizure drug"],"phonetic":"/məˈfɛnaɪtɔɪn/","extraExplanation":["发音提示：这个词由前缀“me-”加上“phenytoin（苯妥英）”构成，常见于医学/药学语境。","用法提示：多出现在药物说明书、医学论文或药史背景中；日常英语里很少见。","安全背景（了解即可）：它与“苯妥英”属于同类抗癫痫药，但因不良反应风险较高而逐渐被淘汰。"]}
{"word":"mephisto","summary":{"en":"Mephisto is a well-known devilish tempter figure (from *Faust*), and it can also refer metaphorically to someone who tempts others—or to a Marvel villain.","zh":"Mephisto 是源自《浮士德》的著名“恶魔诱惑者”形象；也可比喻怂恿他人作恶的人，或指漫威中的同名反派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mephisto (short for Mephistopheles) is a famous devil figure who tempts humans, especially known from the Faust stories.","zh":"Mephisto（Mephistopheles 的简称）是著名的“恶魔/魔鬼”形象，常以诱惑人类著称，最有名的出处是《浮士德》相关故事。"},"examples":[{"en":"In Goethe’s *Faust*, Mephisto offers Faust knowledge and pleasure at a terrible cost.","zh":"在歌德的《浮士德》中，Mephisto 以可怕的代价为交换，向浮士德提供知识与享乐。"},{"en":"The film uses Mephisto as a symbol of temptation and moral compromise.","zh":"这部电影把 Mephisto 当作“诱惑”和“道德妥协”的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A modern reference to a devilish tempter or a person who encourages others to do something wrong (often used metaphorically).","zh":"现代用法中可比喻“像魔鬼般的诱惑者”，或指怂恿他人做坏事的人（多为比喻）。"},"examples":[{"en":"He joked that his friend was a real Mephisto, always pushing him to break the rules.","zh":"他开玩笑说朋友简直是个 Mephisto，总怂恿他破坏规则。"},{"en":"The story paints the charming salesman as a Mephisto figure.","zh":"故事把那个迷人的推销员刻画成“Mephisto 式”的人物。"}]},{"partOfSpeech":"n.","definition":{"en":"In comics (especially Marvel), Mephisto is the name of a powerful demon-like villain inspired by Mephistopheles.","zh":"在漫画（尤其是漫威）中，Mephisto 是一个强大的“恶魔式”反派名字，其灵感来自 Mephistopheles。"},"examples":[{"en":"Mephisto appears in some Marvel storylines as a supernatural antagonist.","zh":"在一些漫威剧情中，Mephisto 以超自然反派的身份登场。"}]}],"synonyms":["Mephistopheles","devil","tempter","demon"],"phonetic":"/məˈfɪstoʊ/","extraExplanation":["“Mephisto”源自“Mephistopheles（梅菲斯特/梅菲斯特费勒斯）”，在英语语境里常用作文化典故，指“引诱人出卖原则的人/力量”。","最经典的文学来源是歌德的《浮士德》（*Faust*）：Mephistopheles 与 Faust 之间关于欲望、知识与灵魂的交易，使这个名字成了“诱惑与代价”的象征。","大小写提示：作为专有名词通常大写（Mephisto）；若只是形容某人“像 Mephisto 一样”，也常保持大写以体现典故。"]}
{"word":"mephistophelean","summary":{"en":"Mephistophelean describes devil-like, tempting, morally corrupt bargains or anything related to Mephistopheles from the Faust legend.","zh":"Mephistophelean 指“墨菲斯托式/魔鬼式”的诱惑与道德败坏的交易，也可指与《浮士德》中墨菲斯托相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clever, tempting, and morally corrupt in a way associated with the Devil—especially involving bargains, manipulation, or trading one’s conscience for power or knowledge.","zh":"带有“魔鬼式”的诱惑与腐化意味；尤指以交易、操控、引诱他人出卖良知来换取力量或知识。"},"examples":[{"en":"The story’s villain makes a Mephistophelean offer: success in exchange for your integrity.","zh":"故事里的反派提出一个“墨菲斯托式”的交易：用成功来换取你的正直。"},{"en":"Her Mephistophelean charm pulled people into choices they later regretted.","zh":"她那种“魔鬼般的魅力”让人做出后来后悔的选择。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Mephistopheles, the devil-like character in the Faust legend (especially in Goethe’s and Marlowe’s versions).","zh":"与“墨菲斯托（Mephistopheles）”有关；他是《浮士德》传说中类似魔鬼的角色（尤指歌德或马洛的版本）。"},"examples":[{"en":"The play uses Mephistophelean imagery—contracts, firelight, and whispered promises.","zh":"这部戏使用了“墨菲斯托式”的意象——契约、火光与低声的承诺。"},{"en":"It’s a Mephistophelean figure who guides the hero toward danger.","zh":"引导主角走向危险的是一个“墨菲斯托式”的人物。"}]}],"synonyms":["diabolical","devilish","demonic","satanic","Faustian (related idea)"],"phonetic":"/ˌmɛfɪstəˈfiːliən/","extraExplanation":["“Mephistophelean”来自 Mephistopheles（墨菲斯托），最常见于“Faust（浮士德）”故事：一个学者为了知识/欲望，与魔鬼（或其代理人）订下交易。英语里用这个词，通常强调“诱人的条件+道德代价”，类似于中文里说“魔鬼的交易/诱惑”。","文学提示：在歌德《浮士德》与马洛《浮士德博士的悲剧》中，Mephistopheles 都象征狡黠的引诱者。现代语境也可用来形容“看似合理却暗藏代价”的商业/政治操作。","用法注意：它比 plain “evil” 更具体，常暗示“聪明、能言善辩、以利益引诱人越界”。语气偏正式，适合评论文学、电影、政治或道德议题。"]}
{"word":"mephistopheleanly","summary":{"en":"“Mephistopheleanly” means “in a devilishly clever, tempting, cynical way.”","zh":"“mephistopheleanly”表示“以狡黠而阴险、带诱惑与冷嘲的方式（如梅菲斯特）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a Mephistophelean way—cunningly or cynically tempting others toward wrongdoing; devilishly or sinisterly.","zh":"以“梅菲斯特式”的方式——狡黠、冷嘲式地引诱他人作恶；带有恶魔般、阴险的意味。"},"examples":[{"en":"He smiled mephistopheleanly, as if he already knew what I would choose.","zh":"他带着梅菲斯特式的微笑，仿佛早就知道我会怎么选。"},{"en":"The villain spoke mephistopheleanly, offering a “gift” that came with hidden costs.","zh":"反派用梅菲斯特式的语气说话，递出一份带有隐性代价的“礼物”。"}]}],"synonyms":["devilishly","sinisterly","cynically","sardonically","diabolically"],"phonetic":"/ˌmɛfəstəˈfiːliənli/","extraExplanation":["“Mephistopheleanly”来自 Mephistopheles（梅菲斯特），最著名的形象出现在德国传说与歌德《浮士德》中：他以机智、冷酷、嘲讽的方式诱惑人类，用交易与欲望把人引向堕落。","这个词在现代写作里多用于文学性或戏剧性的语境，强调“诱惑+讽刺/冷笑+邪恶算计”的气质，而不一定是真正的宗教意义上的“恶魔”。"]}
{"word":"mephistopheles","summary":{"en":"Mephistopheles is a famous devil figure from the Faust story, often symbolizing temptation and moral compromise; it can also be used figuratively for a person who tempts others.","zh":"Mephistopheles（梅菲斯特）是《浮士德》故事中著名的魔鬼形象，常象征诱惑与道德妥协；也可比喻指爱怂恿他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in European literature) a powerful demon or devil who tempts and bargains for a human soul, especially in the story of Faust.","zh":"（欧洲文学中）强大的恶魔/魔鬼形象，以诱惑人类、与人类交易灵魂著称，尤其见于《浮士德》故事。"},"examples":[{"en":"In Goethe’s *Faust*, Mephistopheles offers Faust knowledge and pleasure in exchange for his soul.","zh":"在歌德的《浮士德》中，梅菲斯特引诱浮士德，用知识与享乐来交换他的灵魂。"},{"en":"The character Mephistopheles is often used as a symbol of temptation and moral compromise.","zh":"“梅菲斯特”这一形象常被用作“诱惑”与“道德妥协”的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who behaves like a crafty tempter or cynical troublemaker (used figuratively).","zh":"（比喻）像“梅菲斯特”一样狡黠的诱惑者，或冷嘲的捣乱者/煽动者。"},"examples":[{"en":"He played Mephistopheles, quietly pushing his friend toward a reckless decision.","zh":"他像“梅菲斯特”一样在旁边推波助澜，悄悄把朋友推向鲁莽的决定。"},{"en":"She called him a Mephistopheles because he always tempted others into breaking the rules.","zh":"她说他像“梅菲斯特”，因为他总爱怂恿别人破坏规矩。"}]}],"synonyms":["the devil (literary)","tempter","seducer","bad influence","troublemaker (figurative)"],"phonetic":"/ˌmɛfɪˈstɑːfəliz/","extraExplanation":["“Mephistopheles”最有名的来源是德国作家歌德（Goethe）的戏剧《浮士德》（Faust），也是欧洲“浮士德传说”的核心角色之一：他以机智、讽刺和诱惑著称，常代表人性中的欲望、怀疑与道德滑坡。","英文里把某人称为“a Mephistopheles”通常带有文学化、书面语或略夸张的语气，适合在评论、写作或文学语境中使用。日常口语里更常说“a tempter / a devil on your shoulder / a bad influence”等。"]}
{"word":"mephistophelic","summary":{"en":"Mephistophelic describes a devilish, clever, cynically tempting charm linked to Mephistopheles from Faust.","zh":"mephistophelic 指“墨菲斯托式”的邪魅机智：带嘲讽与诱惑气质、迷人却危险。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clever, cynical, and temptingly mischievous in a way associated with the Devil (Mephistopheles), often suggesting a charming but sinister intelligence.","zh":"带有“墨菲斯托式”的：聪明却冷嘲、诱惑性强且带点邪气，常指一种迷人但阴暗、危险的机智。"},"examples":[{"en":"He gave a mephistophelic smile, as if he knew a secret he shouldn’t share.","zh":"他露出一个墨菲斯托式的微笑，仿佛知道一个不该说的秘密。"},{"en":"The novel’s villain is mephistophelic—witty, persuasive, and quietly cruel.","zh":"这部小说里的反派很“墨菲斯托式”——机智、善于蛊惑人心，却冷酷无情。"}]}],"synonyms":["diabolical","devilish","sardonic","cynical","mischievous"],"phonetic":"/ˌmɛfɪstəˈfɛlɪk/","extraExplanation":["“mephistophelic”来自 Mephistopheles（墨菲斯托），最著名的来源是歌德《浮士德》（Faust）中的恶魔形象：他不只是“吓人”，更像一个擅长辩论、用诱惑与嘲讽引人堕落的“聪明的引诱者”。所以这个词常用来描写带有邪魅魅力、冷幽默、玩世不恭但危险的人或气质。","语用提示：它通常带文学色彩（比较书面/文艺），比“evil/diabolical”更强调“狡黠、诱惑、嘲讽式的魅力”。可近似理解为“devilishly clever（邪魅地聪明）”。"]}
{"word":"mephistophelistic","summary":{"en":"Mephistophelistic means devilishly clever and temptingly cynical, like Mephistopheles from Faust.","zh":"mephistophelistic 指“梅菲斯特式的”：狡黠而邪恶、带诱惑与冷嘲的聪明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cleverly evil or devil-like; suggesting a cynical, tempting, or sinister intelligence (like Mephistopheles in the Faust legend).","zh":"狡黠而邪恶的；带有“恶魔式”诱惑与冷嘲的聪明劲（类似《浮士德》中的梅菲斯特）。"},"examples":[{"en":"The villain’s mephistophelistic smile made everyone uneasy.","zh":"反派那种梅菲斯特式的笑容让所有人都不自在。"},{"en":"Her mephistophelistic advice sounded helpful, but it pushed him toward trouble.","zh":"她的建议听起来很有用，却带着梅菲斯特式的味道，把他推向麻烦。"}]}],"synonyms":["devilish","diabolical","demonic","sinister","cynical","sardonic"],"phonetic":"/məˌfɪstəfəˈlɪstɪk/","extraExplanation":["这个词来自 Mephistopheles（梅菲斯特），是德语文学《浮士德》（Goethe）中以机智与讽刺诱惑人类、与人做交易的“魔鬼/诱惑者”形象。用 mephistophelistic 形容某种“聪明但阴险、带诱惑与冷酷嘲讽”的气质，常见于描写反派、危险的说服力或带毒的幽默。","拼写上也常见变体：Mephistophelian / mephistophelean（含义相近，较常出现在文学评论或正式写作中）。"]}
{"word":"mephitic","summary":{"en":"Mephitic means “foul and poisonous/suffocating,” usually describing bad-smelling gas or air; it can also mean “morally harmful” in a literary sense.","zh":"mephitic 指“恶臭且有毒/令人窒息的”，多形容气体或空气；也可作比喻，指“在道德或影响上有毒害性”的（文学/正式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a foul, poisonous, or suffocating smell (like gas from decay, sewage, or a swamp).","zh":"（气味）恶臭的；有毒的；令人窒息的（常指腐烂、污水、沼泽等产生的气体）。"},"examples":[{"en":"A mephitic odor rose from the drain.","zh":"下水道里飘出一股恶臭刺鼻的味道。"},{"en":"The hikers avoided the cave because of its mephitic air.","zh":"徒步者因为洞里空气呛人有毒而避开了那里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Harmful or morally corrupting; poisonous in effect (used more in formal/literary writing).","zh":"（比喻）有害的；败坏风气的；“毒害性”的（较正式/文学用法）。"},"examples":[{"en":"He wrote about the mephitic influence of hateful rumors.","zh":"他写到恶意谣言对人心的“毒害性”影响。"},{"en":"The novel portrays a mephitic politics of greed and fear.","zh":"这部小说描绘了一个被贪婪与恐惧污染的政治环境。"}]}],"synonyms":["noxious","foul","fetid","toxic","poisonous","rank"],"phonetic":"/məˈfɪtɪk/","extraExplanation":["词源提示：mephitic 来自拉丁语 Mephitis（罗马神话中与毒气/恶臭相关的女神之名），因此常用于形容“像毒气一样的臭味”。","使用场景：在现代英语里它偏书面、偏文学；日常口语更常用 foul / rancid / toxic / noxious。","搭配建议：mephitic fumes（毒臭烟气）、mephitic air（呛人的空气）、mephitic stench（恶臭）、mephitic swamp（恶臭沼泽，偏描写性表达）。"]}
{"word":"mephitical","summary":{"en":"Mephitical describes something giving off a foul, poisonous, or suffocating smell or vapor.","zh":"Mephitical 用来形容散发恶臭、有毒或令人窒息的气味/气体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a foul, poisonous, or suffocating smell or vapor (often from gases like methane or sulfur).","zh":"（气味或气体）恶臭的；有毒的；令人窒息的（常指沼气、硫化物等气体）。"},"examples":[{"en":"A mephitical odor rose from the swamp at dusk.","zh":"黄昏时分，沼泽里升起一股恶臭刺鼻的气味。"},{"en":"The workers evacuated because a mephitical gas was leaking in the tunnel.","zh":"由于隧道里泄漏出有毒窒息的气体，工人们紧急撤离。"}]}],"synonyms":["noxious","fetid","foul","toxic","stifling"],"phonetic":"/məˈfɪtɪkəl/","extraExplanation":["“mephitical”较为书面、偏文学或学术语体，常见搭配有 mephitical fumes / vapors / air / stench。日常英语里更常用的说法是 “toxic,” “noxious,” “foul-smelling,” “stifling.”","词源上与拉丁语中表示“有害气体/恶臭”的词根有关；在描写火山、沼泽、矿井等环境时尤常出现，带有阴郁、危险的氛围感。"]}
{"word":"mephitically","summary":{"en":"Mephitically means “in a foul, poisonous, noxious way,” often used in literary descriptions of air or smells.","zh":"mephitically 表示“以恶臭、有毒、有害的方式”，多用于文学描写空气、气味或氛围。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a foul-smelling, poisonous, or noxious way (often describing air, gas, or an atmosphere).","zh":"以恶臭、有毒或令人窒息/有害的方式（常形容空气、气体或氛围）。"},"examples":[{"en":"A mephitically sweet odor drifted from the drain.","zh":"下水道里飘出一种甜得发腻却带着毒感的恶臭。"},{"en":"The room felt mephitically hot, as if the air itself were unsafe to breathe.","zh":"房间热得让人窒息，仿佛空气本身就不安全。"}]}],"synonyms":["noxiously","toxically","foully","pestilentially"],"phonetic":"/məˈfɪtɪkli/","extraExplanation":["“mephitically”来自形容词“mephitic”（恶臭的；有毒的），词根与拉丁语 Mephitis（古罗马神话中与瘴气/毒气相关的女神名）有关，因此常带有“像瘴气一样有毒、令人作呕”的文学色彩。","这是一个比较少见、偏文学/修辞的词。日常表达更常用：“foul-smelling / toxic / noxious / suffocatingly”。"]}
{"word":"mephitinae","summary":{"en":"Mephitinae is the taxonomic subfamily that includes skunks.","zh":"Mephitinae 指包含臭鼬的生物分类单元“臭鼬亚科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of mammals that includes skunks (and close relatives)","zh":"（哺乳动物）臭鼬亚科：包含臭鼬及其近缘种的一类分类单元"},"examples":[{"en":"In many modern classifications, skunks are placed in the subfamily Mephitinae.","zh":"在许多现代分类中，臭鼬被归入臭鼬亚科（Mephitinae）。"},{"en":"The animals in Mephitinae are known for their strong defensive spray.","zh":"臭鼬亚科（Mephitinae）的动物以强烈的防御性喷雾而闻名。"}]}],"synonyms":["skunk subfamily","skunks"],"phonetic":"ˌmɛfəˈtaɪniː","extraExplanation":["“Mephitinae”是生物分类学（taxonomy）里的拉丁化名称，常见于学术文章、博物馆说明牌和科普资料中。","历史上臭鼬常被归入鼬科（Mustelidae），但不少现代系统将其单独划为臭鼬科（Mephitidae）；无论采用哪种体系，“Mephitinae”都指与臭鼬相关的这一支系。","词根与拉丁语“mephitis”（臭气、毒气）有关，因此名字本身就暗示了“有臭味的”这一典型特征。"]}
{"word":"mephitine","summary":{"en":"Mephitine means foul-smelling and poisonous or noxious, especially when describing air or fumes.","zh":"Mephitine 指“恶臭且有毒/令人窒息的”，常用于形容空气或烟气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Foul-smelling, poisonous, or noxious (usually describing air, gas, or vapors).","zh":"（多形容空气、气体或蒸气）恶臭的、有毒的、令人窒息的。"},"examples":[{"en":"The workers complained about mephitine fumes in the old tunnel.","zh":"工人们抱怨旧隧道里有恶臭有毒的烟气。"},{"en":"A mephitine odor rose from the swamp after the rain.","zh":"雨后沼泽里升起一股令人作呕的恶臭。"}]}],"synonyms":["mephitic","noxious","fetid","foul-smelling","poisonous","toxic"],"phonetic":"/məˈfɪtɪn/","extraExplanation":["“mephitine”较为罕见、偏文学或古风用法，更常见的近义词/近形词是“mephitic”（同样表示“恶臭/有毒的气体或空气”）。","词源来自拉丁语“mephitis”（有毒的恶臭气体；也与罗马神话中象征毒气与恶臭的女神 Mephitis 相关），因此常带有“地下、沼泽、硫磺、腐败气体”的氛围感，在哥特/恐怖或描写阴湿环境的文学里更容易出现。"]}
{"word":"mephitis","summary":{"en":"Mephitis means a foul, unpleasant odor, and it can also refer to a skunk (genus *Mephitis*) in biology.","zh":"mephitis 指“恶臭、臭气”，在生物学中也可指臭鼬（臭鼬属 *Mephitis*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, unpleasant smell; foul odor (a more literary or formal word).","zh":"恶臭；臭气（较文学或正式用法）"},"examples":[{"en":"The damp basement was filled with mephitis.","zh":"潮湿的地下室里充满了恶臭。"},{"en":"A mephitis rose from the trash after days in the heat.","zh":"垃圾在高温下放了好几天，散发出一股臭气。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) a skunk; especially a member of the genus *Mephitis*.","zh":"（生物）臭鼬；尤指臭鼬属（*Mephitis*）动物"},"examples":[{"en":"In North America, the striped skunk is often classified in the genus Mephitis.","zh":"在北美，条纹臭鼬常被归入臭鼬属（Mephitis）。"}]}],"synonyms":["stench","stink","foul smell","reek","malodor"],"phonetic":"/məˈfaɪtɪs/","extraExplanation":["词源来自拉丁语 *mephitis*，意为“有毒的臭气/瘴气”，古人常用它指火山口、沼泽等地冒出的刺鼻气体，因此在英文里带有一点“阴冷、令人不适”的文学色彩。","现代日常英语里更常用 *stench, stink, foul smell*；*mephitis* 多见于文学、学术或较正式的写作。"]}
{"word":"mephitises","summary":{"en":"“Mephitises” means noxious, foul-smelling fumes or vapors (plural of “mephitis”).","zh":"“mephitises”指恶臭且有害（有时有毒）的烟雾/气体，是“mephitis”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mephitis: foul-smelling, unhealthy (sometimes poisonous) vapors or odors; noxious fumes.","zh":"mephitis 的复数：恶臭且对健康有害（有时带毒）的气体/臭味；毒气、恶臭烟雾。"},"examples":[{"en":"The cave was filled with mephitises that made everyone cough.","zh":"洞里充满了恶臭的有害气体，弄得大家直咳嗽。"},{"en":"Old writers sometimes describe swamps as sending up mephitises.","zh":"一些旧时作家有时会写沼泽“冒出”有毒恶臭的气体。"}]}],"synonyms":["noxious fumes","foul vapors","stench","reek","miasma"],"phonetic":"/məˈfɪtɪs/","extraExplanation":["这个词很少见，多用于较文学化或较正式的描写，强调“恶臭 + 令人不适/不健康”的气息，而不只是普通“难闻的味道”。","词源来自拉丁语 mephitis（恶臭的气体/毒气）。常见的相关词是形容词 mephitic（恶臭的；有毒的），例如：mephitic air（恶臭/有毒的空气）。","日常英语里更常用 fumes、noxious fumes、stench、reek 等来表达类似意思；mephitises 作为复数形式更偏书面。"]}
{"word":"mephitism","summary":{"en":"Mephitism means a foul, poisonous smell or noxious vapor, and by extension an unhealthy, stifling atmosphere.","zh":"Mephitism 指恶臭的毒气／有害臭味，也可引申为不健康、令人窒息的空气氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foul, poisonous smell or noxious vapor (especially from decay, swamps, or underground gases)","zh":"（尤指腐烂、沼泽或地下气体产生的）恶臭的毒气／有害的臭味"},"examples":[{"en":"The miners feared mephitism in the tunnel, so they checked the air before going deeper.","zh":"矿工们担心隧道里有毒臭气，所以在深入之前先检测空气。"},{"en":"After the flood, the basement filled with mephitism from rotting debris.","zh":"洪水过后，地下室充满了腐烂杂物散发出的恶臭毒气。"}]},{"partOfSpeech":"n.","definition":{"en":"the condition or quality of being mephitic; an unhealthy, stifling atmosphere","zh":"具有“有毒恶臭、令人窒息”特征的状态；不健康、令人憋闷的空气环境"},"examples":[{"en":"The novel describes the city’s alleys as a place of mephitism and shadow.","zh":"小说把城市的小巷描写成充满窒息毒臭与阴影的地方。"},{"en":"Poor ventilation turned the room into mephitism, and everyone wanted to leave.","zh":"通风不良让房间变得又闷又呛，大家都想离开。"}]}],"synonyms":["noxious fumes","toxic vapor","foul smell","stench","miasma"],"phonetic":"/ˈmɛfɪˌtɪzəm/","extraExplanation":["这个词非常少见，语气偏文学/学术；日常英语里更常用 a foul smell、toxic fumes、noxious odor 等表达。","词源上与拉丁语 mephitis（“有毒的蒸气/恶臭”）有关，常让人联想到火山或地下逸出的有害气体（例如硫化氢一类）。在文学描写中，它常被用来营造“腐败、阴暗、令人窒息”的氛围。"]}
{"word":"meprobamate","summary":{"en":"Meprobamate is an older anti-anxiety tranquilizer that is now less commonly used.","zh":"Meprobamate（甲丙氨酯）是一种较早期的抗焦虑镇静药，如今使用较少。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug used to reduce anxiety and help people relax (an older tranquilizer; now used much less because of safer alternatives)","zh":"一种用于减轻焦虑、帮助镇静放松的药物（较早期的镇静安定药；因有更安全的替代药而较少使用）"},"examples":[{"en":"The doctor said meprobamate is rarely prescribed today because newer medicines are safer.","zh":"医生说如今很少再开美probamate（甲丙氨酯），因为有更安全的新药。"},{"en":"Meprobamate was once used to treat anxiety, but it can cause drowsiness.","zh":"美probamate（甲丙氨酯）曾用于治疗焦虑，但可能引起嗜睡。"}]}],"synonyms":["tranquilizer","sedative","anti-anxiety medication"],"phonetic":"/mɛˈproʊbəˌmeɪt/","extraExplanation":["“Meprobamate”常见于医学或药物说明语境。它属于较早一代的抗焦虑/镇静药，历史上曾以商品名 Miltown、Equanil 广为人知。","学习中更常见的相关词：tranquilizer（镇静剂/安定药）、anti-anxiety medication（抗焦虑药）、sedative（镇静药）、drowsiness（嗜睡）、dependence（依赖）。"]}

