{"word":"mew","summary":{"en":"“Mew” means a soft cat-like “meow,” or to make that sound; it can also describe weak or timid complaining speech.","zh":"“mew”指猫轻柔的喵叫声或发出这种声音；也可（多贬义）指人怯弱、软声地抱怨说话。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sound a cat makes; a soft, high “meow,” especially from a kitten","zh":"（猫的）喵叫声；（尤指小猫）轻柔、尖细的“喵”声"},"examples":[{"en":"We heard a tiny mew from the box and found a kitten inside.","zh":"我们听到盒子里传来一声细细的喵叫，发现里面有只小猫。"},{"en":"The cat gave a short mew at the door to be let in.","zh":"那只猫在门口短短地喵了一声，想让人放它进来。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a soft, high cat-like sound (to “meow,” often softly)","zh":"（猫）轻声喵叫；发出类似猫的细小叫声"},"examples":[{"en":"The kitten mewed when it got hungry.","zh":"小猫饿了就会喵喵叫。"},{"en":"She mewed softly to get the cat’s attention.","zh":"她轻轻学猫叫来吸引那只猫的注意。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a person) to speak in a weak, timid, or complaining way (often used critically)","zh":"（人）怯生生地说；软弱地抱怨（多带贬义）"},"examples":[{"en":"He mewed that the task was too hard, but everyone else kept working.","zh":"他怯怯地抱怨任务太难，可其他人还是继续干。"},{"en":"“I don’t want to go,” she mewed, hoping to stay home.","zh":"“我不想去。”她软软地嘟囔着，希望能留在家里。"}]}],"synonyms":["meow","purr (not the same sound)","whine (for the weak-complaining sense)"],"phonetic":"/mju/","extraExplanation":["“mew”作名词时常见于描写小猫或需要营造柔弱、细微气氛的叙述；比起更常用的“meow”，“mew”更偏文学/描写性，也更强调声音小、尖细。","注意区分：mew（喵叫）与 mew（=猫头鹰等猛禽的笼舍/围栏，较少见）同形异义；日常学习中最常遇到的是“猫叫”的用法。"]}
{"word":"meward","summary":{"en":"“meward” is an archaic adverb meaning “toward me.”","zh":"“meward”是古语副词，意思是“朝我这边/向我”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) Toward me; in my direction.","zh":"（古语）朝我；向我这边（我这方向）。"},"examples":[{"en":"Come meward and tell me what happened.","zh":"朝我这边走来，告诉我发生了什么。"},{"en":"He turned meward when he heard his name.","zh":"他听到自己的名字时转身朝我这边。"}]}],"synonyms":["toward me","towards me","in my direction"],"phonetic":"/ˈmiːwərd/","extraExplanation":["“meward”是非常少见的古体/文学用法，由“me + -ward（朝向……）”构成，意思相当于现代英语的“toward me / towards me”。在日常英语中几乎不用，读文学作品或古英语风格的文本时可能会遇到。","拼写提醒：如果你原本想查的是别的词，常见混淆有“reward（奖励）”“meadow（草地）”“awkward（尴尬的）”。你可以告诉我你看到它的句子，我能帮你确认具体想表达的词。"]}
{"word":"mewed","summary":{"en":"“Mewed” usually means “made a cat’s meow sound.” Less commonly (literary/old-fashioned), it can mean “confined or shut in.”","zh":"“mewed”通常指“发出猫叫声”。较少见的（文学/旧式）用法是“被关住、被困住”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense / past participle of “mew”) made the short, high sound a cat (or sometimes a small bird) makes.","zh":"（“mew”的过去式/过去分词）发出猫（有时也指小鸟）短而尖的叫声。"},"examples":[{"en":"The kitten mewed softly at the door.","zh":"小猫在门口轻轻地喵喵叫。"},{"en":"A hungry cat mewed until someone fed it.","zh":"一只饿猫喵喵叫个不停，直到有人喂它。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) kept shut in; confined or enclosed (often used in literary/old-fashioned writing).","zh":"（较少见）被关起来的；被限制在某处的（常见于文学或较旧的用法）。"},"examples":[{"en":"He felt mewed up in a tiny apartment all winter.","zh":"整个冬天他都觉得被困在一间很小的公寓里。"},{"en":"The birds were mewed in a cage.","zh":"鸟被关在笼子里。"}]}],"synonyms":["meowed","cried","called","cooped up","confined","shut in"],"phonetic":"/mjud/","extraExplanation":["“mew”除了表示猫叫声外，旧用法里还可指“猫笼/关动物的地方”（名词），因此发展出动词用法“mew up/in”=“关住、圈禁”。现代英语里更常见的表达是：cooped up / shut in / confined。"]}
{"word":"mewer","summary":{"en":"A rare noun meaning someone or something that makes a cat-like “mew” sound.","zh":"一个较少见的名词，指会发出猫一样“喵（mew）”声的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or animal that mews (makes the soft crying sound typical of a cat)","zh":"会“喵喵叫”的人或动物（发出猫常见的轻柔叫声）"},"examples":[{"en":"The kitten was a constant mewer when it was hungry.","zh":"小猫饿的时候就一直是个不停喵叫的“小喵叫者”。"},{"en":"In the quiet hallway, the tiny mewer was easy to hear.","zh":"安静的走廊里，那只小小的“喵叫者”很容易被听见。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) something that gives a mew-like sound","zh":"（罕见）发出类似“喵”声的东西"},"examples":[{"en":"The old door hinge had become a mewer in the night breeze.","zh":"那扇旧门的铰链在夜风里发出像“喵”一样的声音。"}]}],"synonyms":["meower (more common in casual use)","cat (in context)"],"phonetic":"/ˈmjuːɚ/","extraExplanation":["“mewer”并不算常用词；日常英语更常说“a cat/kitten meowing”或用名词“meow”（如：I heard a meow）。","词根来自动词“mew”（猫发出轻柔叫声）。注意不要和网络用语“mewing”（一种下颌线练习/梗）混淆；“mewer”一般只和“mew（猫叫）”相关。"]}
{"word":"mewing","summary":{"en":"“Mewing” most commonly means an online trend of tongue posture used to try to sharpen the jawline; it can also mean a cat making a soft “mew” sound.","zh":"“Mewing”最常见指网络上流行的“顶舌”口腔姿势练习，意在改善下颌线；也可指猫发出“喵”叫声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Internet slang) A practice where you keep your tongue pressed against the roof of your mouth (often with lips closed and teeth lightly together) to try to improve jawline or facial appearance.","zh":"（网络俚语）一种把舌头顶在上颚（通常闭唇、牙齿轻触）以期改善下颌线或面部外观的做法。"},"examples":[{"en":"He started mewing after seeing jawline videos on TikTok.","zh":"他在刷到抖音上的下颌线视频后开始“mewing”。"},{"en":"Some teens believe mewing will change their face shape over time.","zh":"一些青少年相信长期“mewing”会改变脸型。"}]},{"partOfSpeech":"other","definition":{"en":"The act of a cat (or similar animal) making a soft, high sound; the -ing form of “mew.”","zh":"猫（或类似动物）发出轻柔尖细叫声的动作；“mew”的 -ing 形式（现在分词/动名词）。"},"examples":[{"en":"The kitten kept mewing at the door.","zh":"小猫在门口一直喵喵叫。"},{"en":"I heard mewing from the alley behind our apartment.","zh":"我听到公寓后面的小巷里传来猫叫声。"}]}],"synonyms":["tongue posture","jawline exercise (informal)","mewing (cat sound)","mew"],"phonetic":"/ˈmjuːɪŋ/","extraExplanation":["“Mewing”作为网络用语，常与“looksmaxxing（颜值提升）”“jawline（下颌线）”等内容一起出现，源自正畸相关讨论中对“舌位/口腔姿势”的关注，但在社交媒体上往往被简化为“练下颌线”的技巧。","从健康角度看，网络上的夸大宣传很常见；是否有效、是否适合个人情况因人而异，遇到咬合、呼吸、颌面不适等问题更建议咨询牙医/正畸或相关专业人士。"]}
{"word":"mewl","summary":{"en":"Mewl means to cry or whimper softly (often like a baby or small animal).","zh":"mewl 指（婴儿或小动物）轻声哭泣、呜咽。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a baby or an animal) to cry or whimper softly, usually in a weak or complaining way.","zh":"（指婴儿或动物）轻声哭泣、呜咽，常带有虚弱或抱怨的感觉。"},"examples":[{"en":"The kitten mewled when it couldn’t find its mother.","zh":"小猫找不到妈妈时轻声喵呜地叫、呜咽着。"},{"en":"The baby mewled in her sleep and then became quiet again.","zh":"婴儿在睡梦中轻轻哭了几声，随后又安静下来。"},{"en":"He was too proud to mewl about his problems.","zh":"他太要强了，不愿为自己的问题哼哼唧唧地抱怨。"}]}],"synonyms":["whimper","whine","cry softly","mew"],"phonetic":"/ˈmjuːl/","extraExplanation":["“mewl”常见于文学或较正式/描写性的语境，比日常的“cry”更强调“细弱、可怜兮兮的呜咽声”。","与“mew”（猫的叫声）有关；“mewl”更像是“微弱地喵叫/哭叫”。","文学用例：莎士比亚《皆大欢喜》(As You Like It) 中有名句 “mewling and puking in the nurse’s arms”（在保姆怀里“呜咽又吐奶”的婴儿），使该词带有较强的文学色彩。"]}
{"word":"mewled","summary":{"en":"“Mewled” means “cried or whimpered weakly,” often like a kitten or a baby.","zh":"“mewled”表示“细声哭叫/呜咽”，常用来形容像小猫或婴儿那样的哭声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"cried with a weak, high-pitched sound (like a kitten), or whimpered like a baby.","zh":"发出细弱的尖声（像小猫叫）；（像婴儿一样）呜咽、啜泣。"},"examples":[{"en":"The kitten mewled for its mother.","zh":"小猫喵喵叫着找妈妈。"},{"en":"The baby mewled in his sleep.","zh":"婴儿在睡梦中发出呜咽声。"},{"en":"Hearing the thunder, the child mewled and hid behind the sofa.","zh":"听到雷声，孩子呜咽着躲到沙发后面。"}]}],"synonyms":["whimpered","cried","yelped","wailed","mewed"],"phonetic":"/mjuːld/","extraExplanation":["“mewled”是动词“mewl”的过去式/过去分词，语气偏文学、描写性，在日常口语里更常用“cried/whimpered”。","文学中最有名的用法来自莎士比亚《皆大欢喜》(As You Like It) 的“mewling and puking in the nurse’s arms”，用来形容婴儿阶段的哭闹与无助，因此该词常带有“微弱、可怜、幼小”的画面感。"]}
{"word":"mewler","summary":{"en":"A rare/old-fashioned noun meaning someone who cries or whines in a weak voice.","zh":"一个较少见/偏旧式的名词，指用细弱声音哭哭啼啼或爱抱怨的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (often a child) who mewls—cries or whines in a thin, weak voice; a whiner (rare/old-fashioned).","zh":"（常指小孩）发出像猫叫般细弱哭声的人；爱哼哼唧唧抱怨的人（较少见/偏旧式用法）。"},"examples":[{"en":"The baby was a constant mewler during the long flight.","zh":"在漫长的航班上，那个宝宝一直哭哭啼啼。"},{"en":"He didn’t want to be seen as a mewler, so he tried to handle the problem calmly.","zh":"他不想被人看成只会哼哼抱怨的人，所以尽量冷静地处理问题。"}]}],"synonyms":["whiner","crybaby","complainer"],"phonetic":"/ˈmjuːlər/","extraExplanation":["“mewler”来自动词“mewl”（像小猫一样发出细小的叫声；小声哭诉/抱怨）。这个词在现代英语中很少用，更常见的说法是“a whiner”“someone who keeps whining”。","在文学语境里它常带一点贬义或讽刺，暗示声音软弱、抱怨无力。与之相关的经典搭配是莎士比亚《皆大欢喜》里对人生阶段的描写：“the whining schoolboy … creeping like snail unwillingly to school”，其中“whining/mewling”都用来刻画爱哭诉的样子。"]}
{"word":"mewlers","summary":{"en":"Mewlers are people (often babies) who cry or whine in a weak, complaining way.","zh":"mewlers 指（常为婴儿）以微弱、哀怨方式哭闹或抱怨的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people (especially babies or young animals) who cry in a weak, complaining way; whiners","zh":"（尤指婴儿或幼小动物）发出微弱、哀怨哭声的人/物；爱抱怨哭哭啼啼的人"},"examples":[{"en":"The nursery was full of mewlers after the thunder woke everyone up.","zh":"雷声把大家吵醒后，托儿室里到处都是哭哭啼啼的孩子。"},{"en":"He dismissed the critics as mewlers who complained but offered no solutions.","zh":"他把批评者斥为只会抱怨却拿不出解决办法的“哭诉者”。"}]}],"synonyms":["whiners","complainers","crybabies","wailers"],"phonetic":"/ˈmjuːlərz/","extraExplanation":["“mewlers”是复数形式，单数是“mewler”，来自动词“mewl”（像小猫或婴儿那样呜咽、哭诉）。","这个词带有贬义色彩：不仅描述“哭”，还暗示“软弱、爱抱怨”。在文学或评论性文字中更常见。","相关词源/用法：莎士比亚《皆大欢喜》(As You Like It) 中有著名句子“mewling and puking in the nurse’s arms”（在保姆怀里咿呀哭闹），让“mewling”在文学语境里很有代表性。"]}
{"word":"mewling","summary":{"en":"Mewling describes a weak, high-pitched cry (like a baby’s or kitten’s), and it can also criticize someone as weakly complaining.","zh":"mewling 指婴儿或小动物发出微弱尖细的哭声（呜咽），也可比喻性地批评某人软弱地抱怨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a baby or small animal) making a weak, high-pitched crying sound; whimpering.","zh":"（婴儿或小动物）发出微弱、尖细的哭叫声；呜咽的。"},"examples":[{"en":"The mewling baby finally fell asleep in her mother’s arms.","zh":"那个呜咽哭闹的宝宝终于在妈妈怀里睡着了。"},{"en":"We heard a mewling kitten outside the door.","zh":"我们听到门外有一只小猫在细声叫唤。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a weak, high-pitched crying sound; to whimper (often used about babies or cats).","zh":"发出微弱、尖细的哭声；呜咽（常指婴儿或猫）。"},"examples":[{"en":"The newborn mewled softly when the room went quiet.","zh":"房间安静下来时，新生儿轻轻地呜咽。"},{"en":"A cat mewled at the window, asking to be let in.","zh":"一只猫在窗边细声叫唤，想让人放它进来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative, often criticizing) weak, complaining, or helpless in speech or behavior.","zh":"（比喻，常带批评）说话或行为软弱、爱抱怨、显得无助的。"},"examples":[{"en":"He gave a mewling apology that didn’t sound sincere.","zh":"他道了个软弱无力的歉，听起来并不真诚。"},{"en":"She was tired of his mewling complaints about small problems.","zh":"她厌倦了他对小事没完没了的软弱抱怨。"}]}],"synonyms":["whimpering","crying","wailing","sniveling","complaining"],"phonetic":"/ˈmjuːlɪŋ/","extraExplanation":["“mewling”最有名的出处之一是莎士比亚《皆大欢喜》（As You Like It）里描写人生七个阶段的台词：“mewling and puking in the nurse’s arms”（在保姆怀里又哭又吐），这里的“mewling”强调婴儿无力、细小的哭声。这个词在现代英语里不算常用，但在文学、评论或带讽刺的语境中很有表现力。","词源上与猫叫声有关：动词“mewl”常用来写小猫的细声叫唤，因此也很自然地被用来形容婴儿的“像小动物一样细弱的哭声”。"]}
{"word":"mewls","summary":{"en":"“Mewls” means making (or the sound of) a soft, weak cry, like a kitten or a baby.","zh":"“mewls”指（像小猫或婴儿一样）发出轻柔、微弱的哭叫声，或指这种微弱的哭声。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a baby, kitten, or small animal) to make a soft, weak crying sound; to whimper.","zh":"（婴儿、小猫或小动物）发出轻柔、微弱的哭叫声；呜咽。"},"examples":[{"en":"The kitten mewls when it’s hungry.","zh":"小猫饿了就会喵呜地叫。"},{"en":"The baby mewled in his sleep, then settled down.","zh":"宝宝在睡梦中轻轻地呜咽了一下，随后安静下来。"}]},{"partOfSpeech":"n.","definition":{"en":"a soft, weak cry (especially from a kitten or a baby).","zh":"轻柔、微弱的哭声（尤指小猫或婴儿的叫声）。"},"examples":[{"en":"A faint mewl came from under the bed.","zh":"床底下传来一声微弱的叫声。"}]}],"synonyms":["whimpers","cries softly","whines (softly)","yelps (faintly)"],"phonetic":"/mjulz/","extraExplanation":["“mewls”通常是动词“mewl”的第三人称单数（he/she/it mewls）或名词复数（mewls）。","“mewl”在现代英语里不算常用，比较常见于文学描写，用来营造“弱小、无助、惹人怜”的氛围。比如莎士比亚《皆大欢喜》(As You Like It) 里有著名的“mewling and puking in the nurse’s arms”（在奶妈怀里呜咽又呕吐）这一句。"]}
{"word":"mews","summary":{"en":"“Mews” most commonly means a historic row of stables (often now homes), especially in the UK; it can also be the plural of “mew” (a cat’s soft cry) or the verb meaning “to meow softly.”","zh":"“mews”最常见指（尤在英国）旧时一排马厩及其巷道（常改建成住宅）；也可作“mew（猫的轻柔叫声）”的复数，或作动词表示“轻声喵叫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a row of small stables (especially historic ones for horses), often converted into homes or shops; also used in street names in the UK","zh":"（尤指旧时的）马厩一排（常被改建成住宅或商铺）；也常见于英国的街名中"},"examples":[{"en":"They rented a tiny house in a quiet mews behind the main road.","zh":"他们在主干道后面一条安静的马厩巷（mews）里租了一间小房子。"},{"en":"The café is tucked away in the mews, so it’s easy to miss.","zh":"那家咖啡馆藏在马厩巷里，不注意很容易错过。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of “mew”: the soft cry/sound a cat makes","zh":"“mew”的复数：猫发出的轻柔叫声（喵叫）"},"examples":[{"en":"We heard mews from the box and knew the kittens were awake.","zh":"我们听到盒子里传来几声喵叫，知道小猫醒了。"},{"en":"Her cat answered with a few quiet mews.","zh":"她的猫用几声轻轻的喵叫回应。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a cat) to make a soft crying sound; to meow","zh":"（猫）发出轻柔的叫声；喵喵叫"},"examples":[{"en":"The cat mews at the door when it wants to come in.","zh":"猫想进来时会在门口喵喵叫。"}]}],"synonyms":["stable row","alley","lane","catcall","meow"],"phonetic":"/mjuz/","extraExplanation":["“mews（马厩巷）”的词源和皇家有关：中世纪英国里，mews 原指饲养、换羽期间安置猎鹰的地方（与法语 muer“换羽”有关）。后来这些地方也用来做马厩，再发展成城市里一排马厩及其后巷；很多如今被改造成住宅，因此英国街名里常见 “___ Mews”。","读到英国地址中的 “Mews” 时，通常不是“猫叫”，而是地名/巷名的意思；语境（地址、建筑、街道）能帮助判断。"]}

