{"word":"mexica","summary":{"en":"Mexica refers to the people at the center of the Aztec Empire, and it can also mean “related to” their culture and history.","zh":"Mexica 指阿兹特克帝国核心的墨西加人，也可作形容词表示与其文化和历史相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Indigenous people who founded Tenochtitlan and led the Aztec Empire (often called the “Aztecs,” but more specifically the Mexica).","zh":"墨西加人：建立特诺奇提特兰并领导阿兹特克帝国的原住民族（常被称为“阿兹特克人”，但更准确地说是墨西加人）。"},"examples":[{"en":"The Mexica founded Tenochtitlan, which later became the site of Mexico City.","zh":"墨西加人建立了特诺奇提特兰，后来这里成为墨西哥城的所在地。"},{"en":"Many museums describe Aztec history, but some scholars prefer the term Mexica for accuracy.","zh":"许多博物馆用“阿兹特克”来介绍历史，但一些学者为更准确而更偏好用“墨西加”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mexica people, their language, culture, or history.","zh":"（形容）与墨西加人及其语言、文化或历史有关的。"},"examples":[{"en":"The exhibit includes Mexica sculptures and ceremonial objects.","zh":"展览包含墨西加雕塑和祭祀器物。"},{"en":"She is studying Mexica myths in a world history class.","zh":"她在世界史课上学习墨西加神话。"}]}],"synonyms":["Aztec"],"phonetic":"/meɪˈʃiːkə/","extraExplanation":["“Mexica”常被视为“Aztec（阿兹特克）”更精确的称呼：Aztec有时是对多个纳瓦特尔语族群的统称，而Mexica特指以特诺奇提特兰为核心、在帝国中占主导地位的那一支。","词源上与纳瓦特尔语（Nahuatl）相关；英语里常见写法为Mexica，发音通常接近“may-SHEE-kə”。"]}
{"word":"mexical","summary":{"en":"“Mexical” usually refers to Mexicali, a border city in Baja California, Mexico, next to Calexico, California.","zh":"“Mexical”通常指 Mexicali（墨西卡利），墨西哥下加利福尼亚州的边境城市，紧邻美国加州的 Calexico。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of) Mexicali: a city in northwestern Mexico, the capital of Baja California, located on the U.S.–Mexico border next to Calexico, California.","zh":"（多半是拼写误差）Mexicali（墨西卡利）：墨西哥西北部城市，下加利福尼亚州首府，位于美墨边境，与美国加州的 Calexico 相邻。"},"examples":[{"en":"Mexicali is across the border from Calexico, California.","zh":"Mexicali（墨西卡利）与加州的 Calexico 隔着边境相对。"},{"en":"They drove to Mexicali for dinner and came back the same night.","zh":"他们开车去 Mexicali 吃晚饭，当晚就回来了。"}]}],"synonyms":["Mexicali"],"phonetic":"ˌmɛksɪˈkɑli","extraExplanation":["“Mexicali”这个地名常被认为是由“Mexico（墨西哥）”和“California（加利福尼亚）”两部分组合而来，用来体现它的边境位置与两地的文化联系。","如果你确实想查的是“Mexical”（没有 i），请告诉我它出现的句子或语境；英语里更常见的写法是“Mexicali”。"]}
{"word":"Mexican","summary":{"en":"“Mexican” describes something from Mexico, or it can mean a person from Mexico.","zh":"“Mexican”表示“墨西哥的”，也可作名词指“墨西哥人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to Mexico, its people, language, or culture","zh":"墨西哥的；与墨西哥、墨西哥人、语言或文化有关的"},"examples":[{"en":"Mexican food like tacos and mole is popular around the world.","zh":"像塔可和莫雷酱这样的墨西哥食物在世界各地都很受欢迎。"},{"en":"She studies Mexican history in school.","zh":"她在学校学习墨西哥历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mexico; someone of Mexican nationality or heritage","zh":"墨西哥人；具有墨西哥国籍或血统的人"},"examples":[{"en":"He is Mexican and grew up in Guadalajara.","zh":"他是墨西哥人，在瓜达拉哈拉长大。"},{"en":"Many Mexicans celebrate Día de los Muertos with family traditions.","zh":"许多墨西哥人会以家庭传统来庆祝亡灵节。"}]}],"synonyms":["from Mexico","Mexican (Spanish)"],"phonetic":"/ˈmɛksɪkən/","extraExplanation":["在表达上更礼貌、具体的说法是：a Mexican person（一个墨西哥人）或 people in Mexico（在墨西哥的人）。形容文化或事物时用 Mexican 作定语通常很自然，如 Mexican Spanish（墨西哥西班牙语）、Mexican culture（墨西哥文化）。","注意大小写：表示国籍/民族/语言时通常首字母大写 Mexican；作为一般形容词不用（但这一词通常都大写，因为来自专名 Mexico）。"]}
{"word":"mexican","summary":{"en":"“Mexican” means related to Mexico or a person from Mexico.","zh":"“Mexican”表示“墨西哥的；墨西哥人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Mexico, its people, language, or culture.","zh":"墨西哥的；与墨西哥、墨西哥人、语言或文化有关的。"},"examples":[{"en":"Mexican food often includes corn, beans, and chili peppers.","zh":"墨西哥菜常常包含玉米、豆类和辣椒。"},{"en":"She studies Mexican history in college.","zh":"她在大学学习墨西哥历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Mexico.","zh":"墨西哥人；来自墨西哥的人。"},"examples":[{"en":"He is a Mexican living in California.","zh":"他是一位住在加州的墨西哥人。"},{"en":"Many Mexicans celebrate Día de los Muertos in early November.","zh":"许多墨西哥人在11月初庆祝亡灵节（Día de los Muertos）。"}]}],"synonyms":["from Mexico","Mexican","Mexican person"],"phonetic":"/ˈmɛksɪkən/","extraExplanation":["在英语里，“Mexican”作形容词时可修饰文化事物（Mexican music/Spanish）、地点（Mexican border）、或身份（Mexican citizens）。作名词时指“墨西哥人”。如果谈到“Mexican American”，通常指在美国生活、具有墨西哥血统或文化背景的人。","注意文化敏感：用“Mexican”描述国籍/文化通常中性；避免把它当作刻板印象或贬义标签。谈饮食时也可以更具体，如 tacos（塔可）、mole（莫雷酱）、pozole（波索莱汤）等。"]}
{"word":"mexicanize","summary":{"en":"Mexicanize means to make something (or become) more Mexican in style, culture, or character.","zh":"Mexicanize 指使某物（或某事物）在风格、文化或特征上更具墨西哥特色。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something Mexican in style, character, or culture (for example, language, food, design, or customs)","zh":"使某物变得具有墨西哥风格/特色；使其“墨西哥化”（如语言、饮食、设计或习俗）"},"examples":[{"en":"The chef mexicanized the menu by adding salsa verde and corn tortillas.","zh":"这位主厨通过加入绿莎莎酱和玉米饼，让菜单更“墨西哥化”。"},{"en":"Some loanwords in local Spanish became mexicanized over time.","zh":"一些外来词在当地西班牙语中随着时间推移逐渐被“墨西哥化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become Mexican in style, character, or culture","zh":"变得具有墨西哥风格/特色；“墨西哥化”"},"examples":[{"en":"After years of living there, his cooking gradually mexicanized.","zh":"在那儿住了多年后，他的烹饪风格逐渐“墨西哥化”。"},{"en":"The neighborhood has mexicanized as new restaurants and festivals appeared.","zh":"随着新餐馆和节庆活动出现，这个社区变得更有墨西哥特色了。"}]}],"synonyms":["make Mexican","add Mexican influences","Mexican-style","Mexican-inspired"],"phonetic":"/ˈmɛksɪkəˌnaɪz/","extraExplanation":["“Mexicanize”由“Mexican（墨西哥的）+ -ize（使……化）”构成，和“modernize（现代化）”“globalize（全球化）”同类。语气通常是中性描述“风格/文化的影响与融合”，但在谈到族群与文化时，建议注意语境：如果带有“把原本的东西改得不像原来”或“同化”的暗示，可能会让人感觉不够尊重。更中性的替代表达包括“add Mexican influences（加入墨西哥元素）”“Mexican-inspired（墨西哥风格灵感）”。"]}
{"word":"Mexicanos","summary":{"en":"“Mexicanos” is Spanish for “Mexicans,” and it’s also famously used as a call of address in Mexico’s national anthem.","zh":"“Mexicanos”是西班牙语“墨西哥人”的复数，也常作为呼语出现，最著名的是在墨西哥国歌开头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mexicans; people from Mexico (Spanish plural form).","zh":"墨西哥人；来自墨西哥的人（西班牙语复数形式）。"},"examples":[{"en":"Many Mexicanos in the neighborhood speak both Spanish and English.","zh":"社区里许多墨西哥人都会说西班牙语和英语。"},{"en":"The documentary follows Mexicanos who moved to the U.S. for work.","zh":"这部纪录片讲述了为工作移居美国的墨西哥人。"}]},{"partOfSpeech":"int.","definition":{"en":"A direct address meaning “Mexicans!”—often recognized from the opening of Mexico’s national anthem: “Mexicanos, al grito de guerra …”","zh":"对“墨西哥人民！”的呼语——常见于墨西哥国歌开头：“Mexicanos, al grito de guerra …（墨西哥人啊，响应战争的号角……）”。"},"examples":[{"en":"The singer began with “Mexicanos,” echoing the first word of the national anthem.","zh":"歌手以“Mexicanos”开场，呼应了国歌的第一个词。"},{"en":"In the stadium, “Mexicanos” signaled the start of the anthem.","zh":"在体育场里，“Mexicanos”提示国歌即将开始。"}]}],"synonyms":["Mexicans","Mexican people"],"phonetic":"/mɛkˈsɪkənoʊs/","extraExplanation":["“Mexicanos”是西班牙语名词“mexicano”的复数；在西班牙语中，小写时通常泛指“墨西哥人”。英语里更常用“Mexicans”，但在引用西语语境（歌词、口号、文化标题）时也会保留“Mexicanos”。","在墨西哥国歌《Himno Nacional Mexicano》中，“Mexicanos,”是呼语，用来号召全国人民，因此常带有庄重、爱国、动员的语气。"]}
{"word":"mexicans","summary":{"en":"“Mexicans” means people from Mexico (plural noun).","zh":"“Mexicans”指“墨西哥人”（复数名词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Mexico; citizens or residents of Mexico (plural of “Mexican”).","zh":"墨西哥人；来自墨西哥的人；墨西哥的公民或居民（“Mexican”的复数）。"},"examples":[{"en":"Many Mexicans celebrate Independence Day on September 16.","zh":"许多墨西哥人在9月16日庆祝独立日。"},{"en":"The restaurant is popular with Mexicans and visitors alike.","zh":"这家餐厅在墨西哥人和游客中都很受欢迎。"},{"en":"Mexicans have diverse cultures, languages, and traditions across different regions.","zh":"墨西哥人因地区不同而拥有多样的文化、语言和传统。"}]}],"synonyms":["Mexican people","people from Mexico","citizens of Mexico"],"phonetic":"/ˈmɛksɪkənz/","extraExplanation":["“Mexican / Mexicans”通常要大写（Mexican, Mexicans），因为它是国籍/民族称呼。","它既可以作名词（a Mexican / Mexicans），也可以作形容词（Mexican food 墨西哥菜）。在谈论人群时，用词要尊重、具体：如“Mexican people（墨西哥人民）”“people in Mexico（在墨西哥的人们）”。"]}
{"word":"Mexico","summary":{"en":"Mexico is a North American country south of the United States; it can also refer to things related to that country in phrases.","zh":"Mexico 指北美洲的国家墨西哥（在美国以南）；在短语中也可指与墨西哥相关的人、文化或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in North America, officially called the United Mexican States, located south of the United States.","zh":"墨西哥：北美洲的一个国家，正式名称为“墨西哥合众国”，位于美国以南。"},"examples":[{"en":"Mexico shares a long border with the United States.","zh":"墨西哥与美国接壤，边境线很长。"},{"en":"She traveled to Mexico to visit Mexico City and Oaxaca.","zh":"她去墨西哥旅行，参观了墨西哥城和瓦哈卡。"}]},{"partOfSpeech":"n.","definition":{"en":"The people, culture, or things from Mexico (used as an adjective in phrases, though it is still the proper name).","zh":"（用于短语中作修饰语）墨西哥的；来自墨西哥的人、文化或事物。"},"examples":[{"en":"Mexico food traditions include tacos, tamales, and mole.","zh":"墨西哥的饮食传统包括塔可、玉米粽和莫雷酱。"},{"en":"Mexico music like mariachi is popular at festivals.","zh":"像马里亚奇这样的墨西哥音乐在节庆中很受欢迎。"}]}],"synonyms":["United Mexican States"],"phonetic":"/ˈmɛksɪkoʊ/","extraExplanation":["“Mexico”在英语中通常指国家；在名词短语里也常像形容词一样作修饰（如 Mexico City, Mexico border），但写法仍保持专有名词大写。","词源上与纳瓦特尔语（Nahuatl）有关，常见解释与阿兹特克（Mexica）人及其都城相关；在现代语境中，“Mexican”更常用来明确表示“墨西哥的/墨西哥人”。"]}
{"word":"mexico","summary":{"en":"Mexico is a North American country south of the United States.","zh":"Mexico 指北美洲国家“墨西哥”，位于美国以南。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a country in North America, officially the United Mexican States, located south of the United States and known for its rich history, diverse cultures, and Spanish as the main language","zh":"墨西哥（北美洲国家，全称“墨西哥合众国”，位于美国以南，以悠久历史、多元文化著称，主要语言为西班牙语）"},"examples":[{"en":"My friend is traveling to Mexico for a week.","zh":"我的朋友要去墨西哥旅行一周。"},{"en":"Mexico is famous for its food, music, and ancient ruins.","zh":"墨西哥以美食、音乐和古代遗址闻名。"},{"en":"She was born in Mexico City, the capital of Mexico.","zh":"她出生在墨西哥的首都墨西哥城。"}]}],"synonyms":["the United Mexican States"],"phonetic":"/ˈmɛksɪkoʊ/","extraExplanation":["“Mexico”在英语里通常指国家“墨西哥”。要表达“墨西哥的/来自墨西哥的”，常用形容词“Mexican”（如 Mexican food 墨西哥菜、Mexican culture 墨西哥文化）。","“Mexico City”（墨西哥城）是首都；“New Mexico”（新墨西哥州）则是美国的一个州，容易混淆。"]}
{"word":"mexitl","summary":{"en":"Mexitl is a rare spelling of Mexitli, a name linked to Aztec mythology and the legendary origin of “Mexico.”","zh":"Mexitl 是 Mexitli 的罕见拼写，与阿兹特克神话及“墨西哥”名称的传说来源有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare; historical) A variant spelling/romanization of Mexitli (also Mexihtli), a name associated with the Aztec deity Huitzilopochtli and sometimes mentioned in explanations of the legendary origin of the name “Mexico.”","zh":"（罕见；历史用语）Mexitli（亦作 Mexihtli）的另一种拼写/转写形式；与阿兹特克神祇“维齐洛波奇特利”（Huitzilopochtli）相关的称呼之一，也常出现在关于“Mexico（墨西哥）”名称传说来源的解释中。"},"examples":[{"en":"Some histories mention “Mexitl/Mexitli” in stories about how Mexico got its name.","zh":"一些史料会在“墨西哥”名称来源的传说中提到“Mexitl/Mexitli”。"},{"en":"The spelling varies a lot, so you may see Mexitli, Mexihtli, or Mexitl in different sources.","zh":"这种词的拼写差异很大，所以在不同资料里你可能会看到 Mexitli、Mexihtli 或 Mexitl。"}]}],"synonyms":["Mexitli","Mexihtli","Huitzilopochtli","Mexica"],"phonetic":"/ˈmɛk.sɪ.təl/","extraExplanation":["“Mexitl”不是现代英语里的常用词，更像是对纳瓦特尔语（Nahuatl）名称的旧式或非统一转写。不同作者会用不同字母来表示同一个发音（例如 x 在纳瓦特尔语转写里常对应类似英语“sh”的音），所以检索时建议同时尝试 Mexitli / Mexihtli / Mexiɫtli 等变体。","如果你是在特定文章、游戏设定或手稿里看到 Mexitl，最好提供一句原文上下文，我可以帮你判断它指的是神名、族名（Mexica）还是与“Mexico”词源相关的用法。"]}
{"word":"mexitli","summary":{"en":"Mexitli is a Nahuatl name linked to Aztec religion and sometimes cited in explanations of the name “Mexico.”","zh":"Mexitli 是一个与阿兹特克宗教相关的纳瓦特尔语名称，也常在“Mexico（墨西哥）”词源解释中被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mexitli (from Nahuatl) is an alternate/early name sometimes given for the Aztec deity Huitzilopochtli, and it is also discussed as a possible source for the name “Mexico/Mexica” in some historical accounts.","zh":"Mexitli（纳瓦特尔语词）有时被认为是阿兹特克神祇“维齐洛波奇特利”（Huitzilopochtli）的别名/早期名称；一些历史叙述也把它与“Mexico / Mexica（墨西哥/墨西加人）”这一名称的来源联系起来。"},"examples":[{"en":"Some texts mention Mexitli as another name for Huitzilopochtli.","zh":"一些文献会提到 Mexitli 是 Huitzilopochtli（维齐洛波奇特利）的另一个名字。"},{"en":"The term Mexitli is sometimes discussed when explaining the origin of the word “Mexico.”","zh":"在解释“Mexico（墨西哥）”一词的来源时，有时会讨论到 Mexitli。"}]}],"synonyms":["Huitzilopochtli"],"phonetic":"/meɪˈʃitli/","extraExplanation":["这是一个来自纳瓦特尔语（Nahuatl）的词/名称，不是常见英语词汇；在英语语境里多出现在历史、神话或词源讨论中。","纳瓦特尔语中的字母 x 常对应类似英语 “sh” 的音；词尾 -tli 也是纳瓦特尔语里常见的词尾组合。不同资料对其拼写、读法与词源解释可能不一致。","关于“Mexico/Mexica”的词源有多种学术观点；把 Mexitli 视为来源之一属于常见说法之一，但并非唯一或完全定论。"]}

