{"word":"mezail","summary":{"en":"“mezail” isn’t recognized as a standard English word; it’s probably a misspelling or a proper name.","zh":"“mezail”不是标准英语词，通常是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name (proper noun).","zh":"不是标准英语单词，可能是拼写错误或人名/地名等专有名词。"},"examples":[{"en":"I couldn’t find “mezail” in an English dictionary—did you mean “mezcal” or “email”?","zh":"我在英语词典里查不到“mezail”——你是不是想写“mezcal”（梅斯卡尔酒）或“email”（电子邮件）？"},{"en":"Please check the spelling of “mezail” and tell me the sentence you saw it in.","zh":"请确认“mezail”的拼写，并把你看到它的句子发我。"}]}],"phonetic":"/mɛˈzeɪl/","extraExplanation":["“mezail”在常见英语语料与主流词典中几乎没有收录记录，所以更像是：\n1）拼写错误：常见近形词有 mezcal（梅斯卡尔酒）、email（电子邮件）、metal（金属）、marshal（执法官/元帅，拼写差距较大但发音可能被误听）。\n2）专有名词：可能是人名、网名、品牌名或地名。\n如果你把它出现的上下文（整句/段落）或来源（截图、网页链接）发来，我可以更准确地判断它想表达的词。"]}
{"word":"mezair","summary":{"en":"“mezair” is not a standard English word; it may be a misspelling (often of “mezzanine”) or a proper name.","zh":"“mezair”不是标准英语词；可能是拼写错误（常见为“mezzanine”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It’s likely a misspelling or a name (proper noun). Common intended words include “mezzanine” (a partial floor between floors) or “mésaire” (rare; from French, meaning “to be displeasing”).","zh":"不是标准英语单词。更可能是拼写错误或专有名词（人名/地名）。常见的可能目标词包括“mezzanine”（夹层/中二层）或较少见的“mésaire”（法语来源，意为“令人不快/不合意”，在英语中极罕见）。"},"examples":[{"en":"I can’t find “mezair” in major English dictionaries—did you mean “mezzanine”?","zh":"我在主要英语词典里找不到“mezair”——你是不是想写“mezzanine”（夹层）？"},{"en":"If “Mezair” is a person or place name, the meaning depends on that specific context.","zh":"如果“Mezair”是人名或地名，它的含义需要看具体语境。"}]}],"extraExplanation":["“mezair”看起来像是把“mezzanine”（/ˈmɛz.əˌniːn/，夹层）拼错了：常见误写点包括少写一个 z、把 -nine 误写成 -air 等。","如果你能提供一句包含 mezair 的原句（或截图/出处），我可以更准确判断你想查的词，并给出正确释义和用法。"]}
{"word":"mezcal","summary":{"en":"Mezcal is a Mexican agave-based distilled spirit, often smoky; tequila is a type of mezcal.","zh":"Mezcal 是墨西哥以龙舌兰为原料的蒸馏烈酒，常带烟熏味；tequila 可视为 mezcal 的一种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Mexican distilled alcoholic drink made from roasted agave (the plant’s heart), often with a smoky flavor; tequila is a type of mezcal made from blue agave.","zh":"梅斯卡尔酒（墨西哥蒸馏烈酒）：用烤制的龙舌兰（植物“心”）发酵后蒸馏而成，常带烟熏风味；龙舌兰酒（tequila）可视为梅斯卡尔的一种（通常以蓝色龙舌兰酿制）。"},"examples":[{"en":"I tried mezcal for the first time, and it had a surprisingly smoky taste.","zh":"我第一次喝梅斯卡尔酒，味道出乎意料地有烟熏感。"},{"en":"Many cocktails use mezcal to add depth and a roasted aroma.","zh":"很多鸡尾酒会用梅斯卡尔酒来增加层次和烘烤香气。"},{"en":"Mezcal is traditionally produced in several regions of Mexico, especially Oaxaca.","zh":"梅斯卡尔酒传统上在墨西哥多个地区生产，尤其是瓦哈卡州（Oaxaca）。"}]}],"synonyms":["agave spirit","Mexican agave liquor"],"phonetic":"/mɛsˈkɑl/","extraExplanation":["“mezcal”一词来自纳瓦特尔语（Nahuatl）mēzcalli，意为“烤熟的龙舌兰”。传统工艺常把龙舌兰的“心”（piña）放在地下坑中用热石烘烤，这也是许多梅斯卡尔带烟熏味的原因。","文化语境：梅斯卡尔常与手工艺、小批量蒸馏、产地（如瓦哈卡）联系在一起。酒标上有时会写“artesanal（手工）”或“ancestral（古法）”来区分工艺风格。","常见说法：英语里人们会说“sip mezcal”表示慢慢品饮；点酒时也常说“a mezcal”指“一杯梅斯卡尔”。"]}
{"word":"mezcaline","summary":{"en":"Mescaline is a hallucinogenic drug known for producing strong changes in perception, traditionally linked to peyote cactus.","zh":"麦司卡林是一种致幻剂，以强烈改变知觉著称，传统上与佩奥特仙人掌相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a powerful hallucinogenic drug that can cause changes in perception, mood, and thinking; it is traditionally associated with the peyote cactus and some other cacti","zh":"一种强效致幻剂，可引起知觉、情绪与思维的改变；传统上与佩奥特仙人掌（peyote）及其他部分仙人掌有关"},"examples":[{"en":"Mescaline can cause vivid visual hallucinations and a distorted sense of time.","zh":"麦司卡林可能引起鲜明的视觉幻觉，并使时间感变得扭曲。"},{"en":"Some indigenous ceremonies have historically used peyote, which contains mescaline.","zh":"在历史上，一些原住民仪式使用过含有麦司卡林的佩奥特仙人掌。"},{"en":"Because of its risks and legal restrictions, mescaline is not a safe or legal choice in many places.","zh":"由于其风险与法律限制，麦司卡林在许多地区既不安全也不合法。"}]}],"synonyms":["hallucinogen","psychedelic"],"phonetic":"/ˈmɛskəˌlin/","extraExplanation":["“mescaline”是英语对该致幻成分的称呼，常见于医学、心理学与药物政策语境。它与“mezcal”（一种龙舌兰烈酒）长得像但不是同一种东西：mezcal来自龙舌兰；mescaline主要与某些仙人掌（如peyote）相关。","在文化层面，peyote在部分北美原住民宗教与疗愈传统中具有神圣地位。讨论相关内容时，通常会避免将其简化为“娱乐性毒品”，并尊重其仪式与社群意义。","20世纪以来，mescaline也常出现在文学与反主流文化作品的讨论中，用来描写意识改变与感知体验（例如有关迷幻体验的写作）。"]}
{"word":"mezcals","summary":{"en":"“Mezcals” is the plural of “mezcal,” a Mexican distilled spirit made from roasted agave, often known for its smoky flavor.","zh":"“Mezcals”是“mezcal”的复数，指由烘烤龙舌兰蒸馏而成的墨西哥烈酒，常带烟熏风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mexican distilled alcoholic drink made from roasted agave (the plural form of “mezcal”)","zh":"梅斯卡尔酒；一种由烘烤龙舌兰蒸馏而成的墨西哥烈酒（“mezcal”的复数）"},"examples":[{"en":"They ordered two mezcals and a plate of tacos.","zh":"他们点了两杯梅斯卡尔酒和一盘塔可。"},{"en":"The bar offers mezcals from different regions of Oaxaca.","zh":"这家酒吧提供来自瓦哈卡不同地区的梅斯卡尔酒。"},{"en":"I prefer mezcals with a smoky aroma.","zh":"我更喜欢带有烟熏香气的梅斯卡尔酒。"}]}],"synonyms":["agave spirit","Mexican agave liquor"],"phonetic":"/mɛsˈkɑl/","extraExplanation":["“Mezcal”常与“tequila（龙舌兰酒）”一起比较：tequila 通常特指用蓝色龙舌兰（blue agave）制作，并且多与哈利斯科州（Jalisco）相关；mezcal 的原料龙舌兰种类更广，且传统工艺常含“烘烤（roasting）”步骤，因此更容易出现“烟熏味（smoky）”。","有些瓶子里会出现“虫子（gusano）”，这是部分品牌的营销传统，并非所有 mezcal 都有，也不是品质好坏的必然标志。","英语里点酒时常说“a mezcal / two mezcals”。在菜单或酒吧语境中，“mezcals”也可泛指“各种不同款的梅斯卡尔酒（different varieties of mezcal）”。"]}
{"word":"mezentian","summary":{"en":"“mezentian” is not a standard English word; it is likely a misspelling of “mesenteric/mesentery,” relating to the tissue that supports the intestines.","zh":"“mezentian”不是标准英文单词；很可能是“mesenteric/mesentery”的拼写错误，指与肠系膜（支撑并固定肠道的组织）有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most likely you mean “mesenteric” (related to the mesentery) or “mesentery” (the fold of tissue that holds the intestines in place).","zh":"一种不规范拼写；你很可能想写的是“mesenteric”（与肠系膜有关的）或“mesentery”（肠系膜：固定肠道的组织褶皱）。"},"examples":[{"en":"I couldn’t find “mezentian” in a standard dictionary; did you mean “mesenteric”?","zh":"我在标准词典里找不到“mezentian”；你是不是想写“mesenteric”？"},{"en":"The doctor mentioned mesenteric lymph nodes on the scan report.","zh":"医生在影像报告里提到了肠系膜淋巴结。"}]}],"synonyms":["mesenteric","mesentery"],"phonetic":"/ˌmɛzənˈtɛri/","extraExplanation":["“肠系膜”相关词常见拼写：mesentery（名词，肠系膜），mesenteric（形容词，肠系膜的）。你写的“mezentian”把 s 写成了 z，而且结尾 -ian 也不常见于这个词族。","如果你是在医学报告、解剖学或生物课本里看到的词，建议把原句或截图发来，我可以帮你确认它到底是哪个词以及在句子里的意思。"]}
{"word":"mezentism","summary":{"en":"“Mezentism” is a very rare medical term, probably a variant of “mesenterism,” relating to a disorder of the mesentery (intestinal tissue).","zh":"“mezentism”是非常罕见的医学词，可能是“mesenterism”的变体拼写，指与肠系膜相关的病变/不适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/medical) A very uncommon term, likely a variant spelling of “mesenterism,” referring to a disorder involving the mesentery (the tissue that attaches the intestines to the abdominal wall), sometimes used loosely for abdominal/intestinal inflammation or pain.","zh":"（罕见/医学）一个极少见的词，可能是“mesenterism（肠系膜病/肠系膜相关病变）”的变体拼写，指与肠系膜（将肠道固定在腹壁上的组织）有关的疾病；有时也被宽泛地用于指腹部/肠道的炎症或疼痛。"},"examples":[{"en":"The clinician suspected a mesenteric problem, described in older notes as “mezentism.”","zh":"临床医生怀疑是肠系膜相关问题，在较旧的病历记录里被写作“mezentism”。"},{"en":"Because the word is rare, many readers will understand it only in a medical context.","zh":"由于这个词非常罕见，很多读者只能在医学语境下理解它。"}]}],"synonyms":["mesenterism","mesenteritis","mesenteric disorder"],"phonetic":"/məˈzɛn.tɪ.zəm/","extraExplanation":["“mezentism”几乎不见于现代英语词典和当代医学写作中，更常见的是：mesentery（肠系膜）、mesenteric（肠系膜的）、mesenteritis（肠系膜炎）。如果你是在文章/笔记里看到“mezentism”，它很可能是旧拼法、非常小众的术语，或是对上述词的误拼。","如果你能提供出现它的句子或出处（例如哪本书/哪篇论文），我可以更准确判断它在该语境下的具体含义。"]}
{"word":"mezentius","summary":{"en":"Mezentius is an Etruscan king in Virgil’s *Aeneid*, remembered as a cruel tyrant and enemy of Aeneas.","zh":"Mezentius（梅曾提乌斯）是维吉尔《埃涅阿斯纪》中的伊特鲁里亚国王形象，以残暴暴君、埃涅阿斯之敌而著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Roman mythology (especially Virgil’s *Aeneid*), an Etruscan king of Caere portrayed as a cruel tyrant and an enemy of Aeneas.","zh":"（罗马神话/文学人物，尤见于维吉尔《埃涅阿斯纪》）梅曾提乌斯：伊特鲁里亚城市卡厄雷（Caere）的国王，被刻画为残暴的暴君，是埃涅阿斯的敌人。"},"examples":[{"en":"In the *Aeneid*, Mezentius fights against Aeneas and the Trojans.","zh":"在《埃涅阿斯纪》中，梅曾提乌斯与埃涅阿斯和特洛伊人作战。"},{"en":"Mezentius is often used as a symbol of ruthless, arrogant tyranny in classical references.","zh":"在古典典故中，“梅曾提乌斯”常被用作残酷、傲慢暴政的象征。"}]}],"phonetic":"/məˈzɛnʃəs/","extraExplanation":["“Mezentius”主要是文学与神话语境中的专有名词，现代英语里一般不会当作日常词汇使用；更多出现在古典文学、神话学、或引用古罗马典故的写作中。","他在《埃涅阿斯纪》中以“暴君”形象著称：被放逐后与鲁图利人（Turnus 一方）结盟，对抗特洛伊人；故事里也涉及他与儿子 Lausus 的情节，使人物形象更复杂。","学习时可以把它当作“典故人物名”：当文章用 Mezentius 来比喻某人，通常是在暗示其残暴、专横或冷酷无情。"]}
{"word":"mezereon","summary":{"en":"Mezereon is an early-blooming, fragrant but poisonous shrub with red berries.","zh":"Mezereon指一种早春开花、花香但有毒、结红色浆果的小灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small shrub with purple-pink flowers and red berries, known for its fragrant blooms but poisonous parts.","zh":"瑞香属的一种小灌木（常指mezereon/“欧瑞香”），开紫粉色花、结红色浆果；花有香味但植株（尤其果实和树皮）有毒。"},"examples":[{"en":"Mezereon blooms very early in spring, sometimes before the leaves appear.","zh":"Mezereon常在早春很早开花，有时叶子还没长出来。"},{"en":"The bright red berries of mezereon look tempting, but they are poisonous.","zh":"Mezereon鲜红的浆果看起来很诱人，但它们有毒。"}]}],"synonyms":["Daphne mezereum","spurge olive"],"phonetic":"ˌmɛzəˈriːən","extraExplanation":["“mezereon”常指植物Daphne mezereum（瑞香属），在园艺语境里也可能泛指某些相近的瑞香属灌木。它的芳香花在欧洲文学与自然描写中偶尔被用来象征“早春的到来”，但也因毒性而带有“美丽却危险”的隐喻色彩。","发音中的 /ˌmɛzəˈriːən/ 以重读落在“-REE-”部分为主。"]}
{"word":"mezereons","summary":{"en":"Mezereons are poisonous flowering shrubs (and also refers to their bark).","zh":"Mezereons 指一种有毒的开花灌木（也可指其树皮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub (Daphne mezereum) with fragrant pink or purple flowers and bright red berries; the plant is poisonous if eaten.","zh":"瑞香属的一种灌木（Daphne mezereum，常称“mezereon”），开芳香的粉紫色花，结鲜红色浆果；误食有毒。"},"examples":[{"en":"Mezereons bloom early in spring, before many other shrubs leaf out.","zh":"mezereon 往往在早春开花，比许多灌木长叶更早。"},{"en":"The park sign warned visitors that mezereons have poisonous berries.","zh":"公园告示提醒游客：mezereon 的浆果有毒。"}]},{"partOfSpeech":"n.","definition":{"en":"the dried bark of the mezereon plant, historically used in traditional medicine (but it can be dangerous and is not for self-treatment).","zh":"mezereon 植物的干燥树皮，历史上曾用于传统药用（但具有刺激性/毒性，不建议自行使用）。"},"examples":[{"en":"Old herbals mention mezereon bark, though modern medicine treats it as unsafe.","zh":"一些古老的草药书会提到 mezereon 树皮，但现代医学一般认为它不安全。"}]}],"synonyms":["Daphne mezereum","spurge laurel (related Daphne species)"],"phonetic":"/məˈzɪriˌɑn/","extraExplanation":["“mezereons”是“mezereon”的复数形式。该词多见于植物学/园艺语境。","词源上经由法语进入英语，常用来指“Daphne mezereum”这一物种。","文化/安全提示：其浆果与树皮都有刺激性与毒性；阅读自然类书籍或逛植物园时常会看到相关警示。"]}
{"word":"mezereum","summary":{"en":"Mezereum is a poisonous European shrub (Daphne mezereum) with pink flowers and red berries.","zh":"mezereum 指一种有毒的欧洲瑞香属灌木（Daphne mezereum），粉紫花、红色浆果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small European shrub (Daphne mezereum) with pink-purple flowers and bright red berries; all parts are poisonous. It is also called spurge laurel.","zh":"瑞香属的一种欧洲灌木（Daphne mezereum，常见名 mezereum），开粉紫色花、结鲜红色浆果；全株有毒，也常被称为“spurge laurel（大戟桂/桂叶瑞香）”。"},"examples":[{"en":"The mezereum has beautiful flowers, but its berries are dangerously poisonous.","zh":"mezereum 的花很漂亮，但它的浆果毒性很强。"},{"en":"In the old garden, a mezereum shrub bloomed early in spring.","zh":"在那座老花园里，一丛 mezereum 在早春就开花了。"}]}],"synonyms":["Daphne mezereum","spurge laurel"],"phonetic":"/məˈzɪriəm/","extraExplanation":["“mezereum”多出现在园艺、植物学或文学描写中，属于较少见的词；读到时通常指这种瑞香属灌木本身，而不是普通生活用词。","该植物的树皮和浆果含有强刺激性与毒性成分（误食可能造成严重不适）；因此文学里有时借它“美丽却危险”的形象来烘托氛围。"]}
{"word":"mezereums","summary":{"en":"“Mezereums” means multiple mezereum shrubs (Daphne mezereum), a fragrant but poisonous plant.","zh":"“Mezereums”指多株 mezereum（Daphne mezereum）灌木，一种有香味但有毒的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mezereum: a shrub (Daphne mezereum) with fragrant pink-purple flowers and red berries; its bark and berries are poisonous and can irritate the skin.","zh":"mezereum 的复数：一种瑞香属灌木（Daphne mezereum），开有香味的粉紫色花并结红色浆果；其树皮和浆果有毒，且可能刺激皮肤。"},"examples":[{"en":"Mezereums bloom very early in spring, sometimes before the leaves appear.","zh":"Mezereums 往往在早春很早就开花，有时在长叶之前就开。"},{"en":"Do not touch mezereums without gloves—the plant can cause skin irritation and is poisonous if eaten.","zh":"不要徒手触碰 mezereums——这种植物可能刺激皮肤，误食也有毒。"}]}],"synonyms":["Daphne (mezereum)","February daphne"],"phonetic":"/məˈzɪriəm/","extraExplanation":["“Mezereum”常见于园艺、植物学或旧式英语文本中，属于较少见的词。它指“欧瑞香/瑞香属的一种”（Daphne mezereum）。该植物因花香而被观赏，但其红色浆果对儿童和宠物尤其危险。"]}
{"word":"mezo","summary":{"en":"Mezzo is a music term meaning “medium” (as in mezzo-forte) or a mezzo-soprano voice/singer.","zh":"Mezzo 是音乐用语，可表示“中等力度”（如 mezzo-forte），也可指“女中音/女中音歌唱者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(music) A mezzo-soprano: a female singing voice between soprano and contralto, or a singer with this voice type.","zh":"（音乐）女中音；指介于女高音与女低音之间的声部，或拥有这种嗓音的歌唱者。"},"examples":[{"en":"She trained as a mezzo and later sang leading opera roles.","zh":"她接受的是女中音训练，后来演唱了歌剧中的主角角色。"},{"en":"The choir needs one more mezzo-soprano for the harmony line.","zh":"合唱团的和声声部还需要一位女中音。"}]},{"partOfSpeech":"adj.","definition":{"en":"(music) Medium; used in dynamic markings such as mezzo-forte (moderately loud) and mezzo-piano (moderately soft).","zh":"（音乐）中等的；常用于力度标记，如 mezzo-forte（中强）与 mezzo-piano（中弱）。"},"examples":[{"en":"Play this section mezzo-forte, not too loud.","zh":"这一段用中强演奏，不要太响。"},{"en":"The composer writes mezzo-piano here to keep the mood gentle.","zh":"作曲家在这里写“中弱”，以保持氛围柔和。"}]},{"partOfSpeech":"other","definition":{"en":"Half; partly (seen in Italian-based terms like mezzo-soprano).","zh":"一半；部分地（常见于意大利语来源的词中，如 mezzo-soprano）。"},"examples":[{"en":"In music terms, mezzo often suggests something between two extremes.","zh":"在音乐术语里，mezzo 常表示介于两个极端之间。"}]}],"synonyms":["mezzo-soprano","medium (in music context)","mf (mezzo-forte)","mp (mezzo-piano)"],"phonetic":"/ˈmɛtsoʊ/","extraExplanation":["“mezo”在英语里不算常见拼写；你可能想找的是意大利语借词“mezzo”。在乐谱上最常见的是力度记号：mf（mezzo-forte，中强）与 mp（mezzo-piano，中弱）。","发音里“zz”通常读作 /ts/ 的音（类似“pizza”里的 -zz-）。"]}
{"word":"mezquit","summary":{"en":"Mezquit is usually a misspelling/variant of **mesquite**: a desert tree, and also the wood/smoke flavor used in barbecue.","zh":"Mezquit 通常是 **mesquite** 的误拼/变体：指一种沙漠树，也可指用于烧烤的木材或烟熏风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled **mesquite**) a desert tree/shrub native to the southwestern U.S. and Mexico, known for its tough wood and bean-like pods.","zh":"（常见拼写为 **mesquite**）一种原产于美国西南部和墨西哥的沙漠树/灌木，木质坚硬，会结类似豆荚的果实。"},"examples":[{"en":"Mesquite trees can survive long droughts in the desert.","zh":"豆科灌木（mesquite）能在沙漠里长时间干旱中存活。"},{"en":"We sat in the shade of a mesquite near the trail.","zh":"我们在小径旁一棵mesquite树的树荫下休息。"}]},{"partOfSpeech":"n.","definition":{"en":"Mesquite wood (or its smoke flavor), often used for grilling and barbecue.","zh":"用作烧烤/烟熏的mesquite木材（或其烟熏风味）。"},"examples":[{"en":"The ribs have a strong mesquite smoke flavor.","zh":"这排骨有很浓的mesquite烟熏味。"},{"en":"He grilled the steak over mesquite wood.","zh":"他用mesquite木炭/木柴烤牛排。"}]}],"synonyms":["mesquite","mesquite wood","smoke flavor"],"phonetic":"/məˈskiːt/","extraExplanation":["“mezquit”多半是把 **mesquite** 拼错或按西语习惯写出来的变体；英语里标准拼写是 **mesquite**。","词源来自纳瓦特尔语（墨西哥原住民语言）*mizquitl*，因此在美国西南部文化与墨西哥饮食语境中很常见，尤其是烧烤（BBQ）菜单上的“mesquite-smoked”。"]}
{"word":"mezquite","summary":{"en":"Mesquite is a hardy desert tree, and also the flavorful wood from that tree used for smoking or grilling.","zh":"Mesquite 指耐旱的沙漠树，也指这种树的木材，常用于熏烤食物并带来浓郁烟熏香味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a desert tree or shrub (common in the U.S. Southwest and Mexico) with long seed pods; it is hardy and grows in dry areas","zh":"（常见于美国西南部和墨西哥的）豆科沙漠树/灌木；耐旱，结长豆荚"},"examples":[{"en":"Mesquite grows well in hot, dry climates.","zh":"豆科沙漠树在炎热干燥的气候里长得很好。"},{"en":"We saw mesquite trees along the desert road.","zh":"我们在沙漠公路旁看到了豆科沙漠树。"}]},{"partOfSpeech":"n.","definition":{"en":"wood from the mesquite tree, often used for smoking or grilling food because it gives a strong, sweet flavor","zh":"（豆科沙漠树的）木材；常用于熏烤/烧烤，带有浓烈偏甜的烟熏香味"},"examples":[{"en":"The restaurant uses mesquite wood to smoke the ribs.","zh":"这家餐厅用豆科沙漠树木来熏排骨。"},{"en":"Mesquite smoke can be strong, so use it lightly with fish.","zh":"豆科沙漠树的烟熏味很重，所以烤鱼时要少用。"}]}],"synonyms":["mesquite tree","smoking wood"],"phonetic":"/məˈskiːt/","extraExplanation":["“mezquite”通常是“mesquite”的另一种拼写/误拼（受西班牙语影响更明显）。在北美语境里最常见的拼写是“mesquite”。","在美国南部与西南部烧烤文化中，mesquite 常与德州/墨西哥风味烤肉联系在一起；它的烟味更浓烈，常被拿来和较温和的 hickory、applewood 对比。"]}
{"word":"mezquites","summary":{"en":"Mezquites are mesquite trees—or the wood used for smoking/grilling—common in the U.S. Southwest and Mexico.","zh":"mezquites 指豆荚树（mesquite）的复数，也可指其用于烟熏/烧烤的木材，常见于美国西南与墨西哥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mesquite tree (a thorny desert tree of the pea family) common in the southwestern U.S. and Mexico, known for its sweet seed pods and hard wood","zh":"豆科的“豆荚树/相思豆树”（常见于美国西南与墨西哥的多刺荒漠树），以甜味豆荚和坚硬木材著称"},"examples":[{"en":"Mesquites can survive long droughts because their roots grow very deep.","zh":"豆荚树能熬过长期干旱，因为它们的根系扎得很深。"},{"en":"The ranch had a line of mezquites along the dry creek bed.","zh":"牧场在干涸的溪床旁种了一排豆荚树。"}]},{"partOfSpeech":"n.","definition":{"en":"wood from a mesquite tree, often used for smoking or grilling food because it adds a strong, smoky flavor","zh":"豆荚树木材（常用于烟熏或烧烤，能带来浓烈的烟熏风味）"},"examples":[{"en":"We smoked the brisket over mesquite for a bold flavor.","zh":"我们用豆荚木烟熏牛胸肉，味道更浓郁。"},{"en":"This restaurant grills chicken with mezquite wood.","zh":"这家餐厅用豆荚木来烤鸡。"}]}],"synonyms":["mesquite","mesquite tree","mesquite wood"],"phonetic":"/mɛˈskiːt/","extraExplanation":["“mezquite”是“mesquite”的另一种拼写，常见于受西班牙语影响的地区（尤其是美国西南部与墨西哥）。","词源来自纳瓦特尔语（Nahuatl）“mizquitl”，后来经西班牙语进入英语。","在美国饮食文化里，“mesquite/mezquite”常与德州烧烤（Texas BBQ）联系在一起；它的烟味通常比山核桃木（hickory）更强。"]}
{"word":"mezquits","summary":{"en":"Mesquites are mesquite trees (or their wood), common in the U.S. Southwest; the wood is popular for smoking and grilling.","zh":"Mesquites 指相思树（或其木材），常见于美国西南部；相思木常用于烟熏与烧烤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mesquite tree (a thorny tree common in the southwestern U.S. and Mexico)","zh":"豆科相思灌木/相思树（常见于美国西南部和墨西哥的一种多刺树）"},"examples":[{"en":"Mesquites grow well in hot, dry areas.","zh":"相思树在炎热干燥的地区长得很好。"},{"en":"We saw mesquites along the desert road.","zh":"我们在沙漠公路旁看到了相思树。"}]},{"partOfSpeech":"n.","definition":{"en":"wood from the mesquite tree, often used for smoking or grilling food because it has a strong flavor","zh":"相思木（常用于烟熏/烧烤，会带来浓烈的烟熏风味）"},"examples":[{"en":"The restaurant smokes its brisket with mesquite.","zh":"那家餐厅用相思木烟熏牛胸肉。"},{"en":"Mesquite gives the meat a bold, smoky taste.","zh":"相思木会让肉带有浓郁的烟熏味。"}]}],"synonyms":["mesquite (tree)","mesquite wood"],"phonetic":"/məˈskiːt/","extraExplanation":["你输入的 **mezquits** 通常是 **mesquites**（mesquite 的复数）的一种拼写变体/误拼。这个词来自西班牙语 **mezquite**，在英语里标准拼写多为 **mesquite**。"]}
{"word":"mezuza","summary":{"en":"A mezuzah is a Jewish scroll (and often its case) attached to a doorpost as a sign of faith.","zh":"mezuzah 指固定在门框上的犹太经文羊皮卷（及其经匣外壳），象征信仰并提醒宗教实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) A small parchment scroll inscribed with Hebrew verses (especially the Shema), placed in a protective case and attached to a doorpost as a sign of Jewish faith and a reminder of religious duties.","zh":"（犹太教）写有希伯来经文（尤其是《示玛》）的小羊皮卷，放入保护盒中并固定在门框上，作为犹太信仰的标志与宗教提醒。"},"examples":[{"en":"They placed a mezuzah on the front doorpost when they moved into the new home.","zh":"他们搬进新家时，在大门门框上安放了一个门框经匣（mezuzah）。"},{"en":"Before entering, he touched the mezuzah gently out of habit.","zh":"进门前，他习惯性地轻轻触碰门框经匣。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, the decorative case that holds the parchment scroll on the doorpost.","zh":"引申义：装在门框上的、用来盛放经文羊皮卷的装饰性匣子（经匣外壳）。"},"examples":[{"en":"She bought a mezuzah with a simple wooden case.","zh":"她买了一个带简约木质外壳的门框经匣。"}]}],"synonyms":["mezuzah case","doorpost scroll"],"phonetic":"/məˈzuːzə/","extraExplanation":["你写的拼法“mezuza”更常见的标准拼写是 **mezuzah**（也见 mezuzah/mezuzot）。它来自希伯来语，字面与“门框”相关。","在一些犹太家庭里，门框经匣通常斜贴在门框右侧上方；触碰经匣并亲吻手指是一种常见的个人虔敬习惯（不同家庭与传统做法可能不同）。","复数常见为 **mezuzot**（希伯来语复数），英语中也有人用 **mezuzahs**。"]}
{"word":"mezuzah","summary":{"en":"A mezuzah is a Jewish religious item—a Torah verse scroll in a case—attached to a doorframe.","zh":"mezuzah 指犹太教的门框经文匣：内含《妥拉》经文卷轴，安放在门框上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small parchment scroll with verses from the Torah (usually the Shema) placed inside a case and affixed to the doorframe of a Jewish home or room as a religious symbol and reminder.","zh":"（犹太教）门框经文匣：将写有《妥拉》经文（通常是《申命记》中的“示玛”）的羊皮纸卷放入匣中，固定在犹太人家或房间门框上，作为信仰象征与提醒。"},"examples":[{"en":"They placed a mezuzah on the front door when they moved into the new apartment.","zh":"他们搬进新公寓时，在大门门框上安放了一个门框经文匣。"},{"en":"In many Jewish homes, you may see people touch the mezuzah as they enter or leave.","zh":"在许多犹太人家中，你可能会看到人们进出时触碰门框经文匣。"}]}],"synonyms":["doorpost scroll","Jewish doorframe amulet (informal)"],"phonetic":"/məˈzuːzə/","extraExplanation":["发音与拼写：英语里常见拼写为 mezuzah（复数 mezuzot 或 mezuzahs）。","文化语境：mezuzah 源自希伯来语 מְזוּזָה（原意与“门框/门柱”相关）。它通常装在小盒里，斜贴在门框上方一侧（不同传统在角度与位置上可能略有差异）。","使用礼仪（了解即可）：有些人会轻触或亲吻手指以示敬意；是否这么做、以及如何做，取决于个人与家庭传统。参观时保持尊重即可，不必模仿。","相关词：kosher（合规的/符合犹太教规的）mezuzah 指内部羊皮纸经文的书写与制作需符合教规；Shema 指经文内容中的核心祷文。"]}
{"word":"mezuzahs","summary":{"en":"Mezuzahs are small cases on Jewish doorposts that contain sacred Hebrew verses.","zh":"Mezuzahs（门框经匣）是固定在犹太家庭门框上的小盒子，内装写有神圣希伯来经文的羊皮纸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small case containing a handwritten Hebrew parchment (with verses from the Torah) that Jewish people place on the doorposts of homes or rooms as a sign of faith and remembrance.","zh":"（犹太教）门框经匣：内装手写希伯来文羊皮纸（含《妥拉》经文）的小盒子，犹太人常把它固定在家中或房间门框上，作为信仰与纪念的标志。"},"examples":[{"en":"Many Jewish families attach mezuzahs to the doorposts of their homes.","zh":"许多犹太家庭会把门框经匣固定在家门的门框上。"},{"en":"Before entering, he touched the mezuzah briefly as a quiet reminder of his faith.","zh":"进门前，他轻轻触碰了一下门框经匣，作为对信仰的静默提醒。"},{"en":"The museum displayed mezuzahs from different eras and regions.","zh":"博物馆展出了来自不同时代与地区的门框经匣。"}]}],"synonyms":["mezuzot"],"phonetic":"/məˈzuːzəz/","extraExplanation":["“mezuzah”源自希伯来语，意为“门柱/门框”。其内的羊皮纸称为“klaf”，写有《申命记》中的“舍玛”（Shema）等经文。","复数形式常见两种：mezuzahs（英语化拼写）与 mezuzot（更接近希伯来语复数）。你输入的“mezuzahs”就是复数。","在许多传统中，mezuzah通常斜着固定在门框上；触碰或亲吻手指后再触碰mezuzah是一种常见但非强制的习俗。","书写与安放mezuzah有宗教规定与礼仪（例如由专业抄写员书写），但在日常英语里它也常被当作一种可见的文化与家庭象征来提及。"]}
{"word":"mezuzas","summary":{"en":"“Mezuzas” is the plural of “mezuzah,” a Jewish doorpost case containing a Torah scroll as a sign of faith and reminder of commandments.","zh":"“Mezuzas”是“mezuzah（门框经文盒）”的复数，指犹太人门框上的经文盒，内含《托拉》经文，用作信仰标记与诫命提醒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mezuzah: a small case fixed to the doorpost of a Jewish home, containing a parchment scroll with verses from the Torah (especially the Shema) as a sign of faith and reminder of God’s commandments.","zh":"mezuzah（门框经文盒）的复数：固定在犹太人住宅门框上的小盒子，内含写有《托拉》经文（尤其是《申命记》中的“示玛”段落）的羊皮卷，用来表达信仰并提醒遵行诫命。"},"examples":[{"en":"Many Jewish families place mezuzas on the doorposts of their homes.","zh":"许多犹太家庭会在家门框上安放mezuzas（门框经文盒）。"},{"en":"Before moving in, they checked that the mezuzas were securely attached and protected from the weather.","zh":"入住前，他们检查mezuzas是否牢固固定，并做好防风雨保护。"},{"en":"In the novel, the character touches the mezuzas when entering, a quiet daily ritual.","zh":"在小说里，人物进门时会触碰mezuzas，这是一个安静的日常仪式。"}]}],"synonyms":["mezuzah (singular)","doorpost scroll case","Jewish doorpost parchment (descriptive)"],"phonetic":"/məˈzuːzəz/","extraExplanation":["“mezuzah”来自希伯来语，原意与“门柱/门框”相关。传统做法是将写有经文的羊皮卷放入盒中，固定在门框上（通常在右侧），并常以倾斜方式安装；不同传统（如阿什肯纳兹与塞法迪）在安装角度等细节上可能有所差异。","在一些家庭中，人们进出时会轻触mezuzah并亲吻手指，以表达敬意与提醒自我；这是习俗而非所有人都必须遵循的做法。","书写经文的羊皮卷（klaf）需要由受过训练的抄写员按宗教规范书写；若受潮、破损或字迹不合规范，可能需要更换。"]}
{"word":"mezuzot","summary":{"en":"Mezuzot is the Hebrew plural of mezuzah—doorpost cases containing a parchment with Torah verses in Jewish practice.","zh":"Mezuzot 是 mezuzah 的希伯来语复数，指犹太传统中钉在门框上、内含《妥拉》经文羊皮纸的小盒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mezuzah: small cases (usually on doorposts) that contain a parchment with Hebrew verses from the Torah, placed in Jewish homes and buildings.","zh":"mezuzah 的复数：装有写着《妥拉》希伯来经文羊皮纸的小盒（通常钉在门框上），常见于犹太家庭或建筑入口处。"},"examples":[{"en":"They checked the mezuzot on each doorway before moving in.","zh":"搬进去之前，他们检查了每个门口的 mezuzot。"},{"en":"In some neighborhoods, you can spot mezuzot on many apartment doorframes.","zh":"在一些社区里，你可以在许多公寓门框上看到 mezuzot。"}]}],"synonyms":["mezuzahs"],"phonetic":"/məˈzuːzɑt/","extraExplanation":["“Mezuzot”来自希伯来语的复数形式；英语里也常见规则复数“mezuzahs”。在书面语或宗教语境中，“mezuzot”更常用、更贴近原语言习惯。","传统上，mezuzah 里的羊皮纸（klaf）写有《申命记》中的经文（包含“Shema”），象征信仰与对家宅的祝福。很多人进入/离开时会触摸它以示敬意（做法因家庭与传统而异）。"]}
{"word":"mezuzoth","summary":{"en":"Mezuzoth are mezuzahs—Jewish doorpost cases containing a parchment with Hebrew Torah verses.","zh":"Mezuzoth 是 mezuzah 的复数：犹太家庭门框上的经文盒，内含写有《妥拉》经文的羊皮卷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mezuzah: small parchment scroll (in a case) with Hebrew verses from the Torah, traditionally attached to the doorpost of a Jewish home.","zh":"mezuzah（门框经文盒）的复数：装有写着《妥拉》希伯来经文的小羊皮卷（通常放在盒中），按犹太传统钉在犹太家庭的门框上。"},"examples":[{"en":"Many Jewish families place mezuzoth on the doorposts of their homes.","zh":"许多犹太家庭会在家门框上安放 mezuzoth。"},{"en":"Before moving in, they checked whether the mezuzoth were properly affixed.","zh":"搬进去之前，他们检查 mezuzoth 是否正确固定。"}]}],"synonyms":["mezuzahs","mezuzot"],"phonetic":"/məˈzuːzoʊθ/","extraExplanation":["“mezuzoth”常见于较传统或学术性的拼写；现代英语里也常写作“mezuzot”或直接用英语复数“mezuzahs”。","mezuzah 源自希伯来语，意为“门框”。经文通常包括《申命记》6:4–9（含“Shema”）和 11:13–21，象征对信仰与家庭的提醒。","在文化语境中，mezuzah/mezuzoth 是犹太家庭生活与身份认同的标志之一；在写作中提到它往往带有“家、传统、归属感”等意涵。"]}
{"word":"mezzanine","summary":{"en":"A mezzanine is a partial intermediate floor between main floors, often a balcony-like level; in theaters it can also mean the lower balcony seating area.","zh":"mezzanine 指建筑中两层主楼层之间的夹层/中间层，常为可俯瞰下方的开放式楼层；在剧院中也可指下层阳台看台（夹层座位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A partial floor between two main floors of a building, often an open balcony level that overlooks the floor below.","zh":"夹层；（建筑中）两层主楼层之间的中间层，常为可俯瞰下方空间的开放式楼层/挑台层。"},"examples":[{"en":"Our seats are on the mezzanine, so we can see the whole stage.","zh":"我们的座位在夹层（看台），所以能看到整个舞台。"},{"en":"The café has a mezzanine with extra tables upstairs.","zh":"那家咖啡馆有一个夹层，上面多摆了一些桌子。"},{"en":"The office added a mezzanine to create more workspace without moving.","zh":"办公室加建了一个夹层，不用搬家就增加了工作空间。"}]},{"partOfSpeech":"n.","definition":{"en":"In theaters, the lower balcony level; seats located there.","zh":"（剧院用语）第一层楼座/下层阳台看台；夹层座位。"},"examples":[{"en":"We bought mezzanine tickets because they were cheaper than orchestra seats.","zh":"我们买了夹层票，因为比一楼池座便宜。"},{"en":"From the mezzanine, the sound was still clear.","zh":"从夹层看台听，声音依然很清晰。"}]}],"synonyms":["intermediate floor","balcony level","loft (sometimes)","gallery (sometimes)"],"phonetic":"ˈmɛzəˌnin","extraExplanation":["“mezzanine”常见于建筑、室内设计和剧院座位分区。它通常不是“完整的一层”，而是占据部分面积、与下方空间相通的中间层（例如商场或咖啡馆的挑空夹层）。","词源来自意大利语 *mezzano*（“中间的”），与 *middle* 的概念相近。常见搭配：*mezzanine level*（夹层楼面）、*mezzanine floor*（夹层楼）、*mezzanine seating*（夹层座位）。"]}
{"word":"mezzanines","summary":{"en":"Mezzanines are intermediate, partial levels—either a building’s in-between floor or a theater’s mid-level seating area.","zh":"mezzanines 指“中间的夹层/半层楼”，也可指剧院等场馆的“夹层座位区”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mezzanine: a partial floor between the main floors of a building (often an intermediate level that overlooks the floor below).","zh":"夹层；（建筑中）介于两层之间的半层楼（常可俯瞰下方空间）。"},"examples":[{"en":"The café has a mezzanine with extra seating above the main room.","zh":"这家咖啡馆有一个夹层，在主厅上方增加了座位。"},{"en":"We stored the archived files on the mezzanine level of the warehouse.","zh":"我们把归档文件存放在仓库的夹层。"}]},{"partOfSpeech":"n.","definition":{"en":"In theaters, arenas, or concert halls: a seating level above the ground floor but below the balcony.","zh":"（剧院/体育馆/音乐厅中）夹层座位区；位于底层之上、阳台之下的一层观众席。"},"examples":[{"en":"Our tickets are in the mezzanine, so we’ll have a clear view of the stage.","zh":"我们的票在夹层座位区，所以能清楚看到舞台。"},{"en":"The sound is often great from the mezzanine seats.","zh":"从夹层座位区听音效通常很好。"}]}],"synonyms":["intermediate level","entresol","loft (sometimes)","mezzanine level"],"phonetic":"/ˈmɛzəˌnin/","extraExplanation":["“Mezzanine”来自意大利语 mezzanino，和“mezzo”（意为“中间/半”）同源，所以它常带有“介于中间的半层/中间层”的概念。","在日常使用中，美式英语里建筑语境更常见；在演出场馆里也常用来指“mezzanine seating”。注意它一般不是完整的一层楼，而是“部分楼面/夹层”。"]}
{"word":"mezzavoce","summary":{"en":"Mezzavoce means speaking or singing in a restrained “half voice,” soft but still clear.","zh":"mezzavoce 指用克制的“半声”说话或演唱：声音较轻，但依然清晰可辨。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Music, stage direction) In a half voice; softly but still audible, as if speaking or singing with restraint.","zh":"（音乐/舞台指示）用“半声”演唱或说话；声音压低但仍听得清，带克制的轻声。"},"examples":[{"en":"The actor delivered the line mezzavoce, as if sharing a secret with the front row.","zh":"演员用半声说出那句台词，仿佛在向前排透露秘密。"},{"en":"Sing the opening phrase mezzavoce, then grow louder in the next measure.","zh":"开头乐句用半声唱，然后在下一小节逐渐增强音量。"}]}],"synonyms":["sotto voce","softly","quietly","in an undertone"],"phonetic":"/ˌmɛtsoʊˈvoʊtʃeɪ/","extraExplanation":["源自意大利语 mezzo（半）+ voce（声音）。在古典声乐与歌剧语境中，mezzavoce 常指“压住音量但保持音色与支撑”的演唱方式，不等同于单纯的“很小声”（那更接近 sotto voce / pianissimo）。","在文学或舞台描写里，它常用来营造克制、亲密、含蓄或神秘的氛围：说得轻，却让人听见。"]}
{"word":"mezzo","summary":{"en":"Mezzo is a music term meaning a mezzo-soprano voice/singer, and it can also mean “medium/half” in Italian musical markings like mezzo-forte.","zh":"Mezzo 是音乐用语，常指“女中音/女中音歌者”，也可表示“中等/半…”，常见于 mezzo-forte 等意大利语音乐标记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) A mezzo-soprano singer, or the mezzo-soprano voice type (between soprano and contralto).","zh":"（音乐）女中音歌唱家；或“女中音”这种声部（介于女高音与女低音之间）。"},"examples":[{"en":"She is a mezzo who often sings roles like Carmen.","zh":"她是女中音，经常演唱《卡门》这类角色。"},{"en":"The aria sits comfortably for a mezzo, not too high or too low.","zh":"这段咏叹调对女中音来说很舒服，不会太高也不会太低。"}]},{"partOfSpeech":"other","definition":{"en":"Used as a modifier meaning “medium” or “half,” especially in Italian musical terms (e.g., mezzo-forte).","zh":"作修饰语，表示“中等的/半…的”，常见于意大利语音乐术语中（如 mezzo-forte：中强）。"},"examples":[{"en":"Play it mezzo-forte, not too loud.","zh":"用中强力度演奏，不要太响。"},{"en":"The passage should be mezzo-piano, gentle but clear.","zh":"这一段应是中弱力度，温柔但清晰。"}]}],"synonyms":["mezzo-soprano","mf (mezzo-forte)","mp (mezzo-piano)"],"phonetic":"/ˈmɛtsoʊ/","extraExplanation":["“Mezzo”来自意大利语，意思是“中间/一半”。在古典音乐语境里，它常作为“mezzo-soprano（女中音）”的简称；在力度标记中常见于“mezzo-forte（mf，中强）”“mezzo-piano（mp，中弱）”。","在歌剧中，mezzo 常演唱两类典型角色：①成熟、性格强烈的女性（如《卡门》Carmen）；②“裤装角色”（trouser role），即由女中音扮演少年男性角色（如《费加罗的婚礼》Cherubino）。"]}
{"word":"mezzograph","summary":{"en":"Mezzograph is a rare term for a printing/photoengraving process (or the resulting print) known for smooth, mezzotint-like shading.","zh":"Mezzograph 是个较少见的词，指一种印刷/照相制版工艺（或其成品），以类似 mezzotint 的柔和渐层明暗著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a printing or photoengraving method (or a print made by it) designed to create soft, shaded tones similar to a mezzotint","zh":"一种印刷/照相制版方法（或用其制成的印刷品），用来产生类似“梅佐廷特（mezzotint）”那种柔和渐层的明暗效果"},"examples":[{"en":"The museum displayed a mezzograph with rich shadows and smooth transitions of tone.","zh":"博物馆展出了一幅 mezzograph 印刷品，阴影浓郁、明暗过渡非常平滑。"},{"en":"The publisher chose a mezzograph process to reproduce the painting’s subtle shading.","zh":"出版社选择了 mezzograph 工艺来再现这幅画细腻的明暗层次。"}]}],"synonyms":["mezzotint (related)","photogravure (related)","halftone (related)"],"phonetic":"/ˈmɛtsoʊˌɡræf/","extraExplanation":["“mezzograph”是较少见的词，多出现在印刷史、版画/制版技术或艺术复制的语境里。","词形由“mezzo-”（源自意大利语 mezzo，意为“半、中间”，常用来指介于明暗之间的中间调）+ “-graph”（书写/绘制/记录）构成，强调“中间调、渐层影调”的效果。","它与更常见的“mezzotint（梅佐廷特/黑白铜版凹版的一种）”在视觉效果上相近：都以细腻的灰阶与柔和阴影见长。阅读时如果看到这类词，通常是在描述图像复制的影调质量。"]}
{"word":"mezzolith","summary":{"en":"Mezzolith is a rare spelling of Mesolithic, the middle Stone Age period between the Paleolithic and Neolithic.","zh":"Mezzolith是Mesolithic（中石器时代）的少见拼写，指旧石器时代与新石器时代之间的石器时代中期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an alternative (less common) spelling of Mesolithic: the middle part of the Stone Age, between the Paleolithic and the Neolithic, known for hunter-gatherer life and the increasing use of small stone tools","zh":"Mesolithic（中石器时代）的另一种（较少见的）拼写：石器时代的中期阶段，介于旧石器时代与新石器时代之间，以狩猎采集生活方式及更多小型石器工具的使用为特征"},"examples":[{"en":"The report dates the campsite to the mezzolith based on the style of stone tools.","zh":"报告根据石器工具的风格将这处营地定年为中石器时代（mezzolith）。"},{"en":"In some older texts, you may see “mezzolith” where modern books use “Mesolithic.”","zh":"在一些较旧的文献中，你可能会看到用“mezzolith”，而现代书籍通常写作“Mesolithic”。"}]}],"synonyms":["Mesolithic","Middle Stone Age (context-dependent)"],"phonetic":"/ˌmɛzəˈlɪθ/","extraExplanation":["“mezzolith”在现代英语考古学写作中非常少见，更标准、最常用的写法是“Mesolithic”。如果你在论文、报告或学习中使用，建议优先用“Mesolithic”，并在需要时注明“also spelled mezzolith”。","中石器时代的具体年代会因地区而不同（例如欧洲常指冰期结束后到农业扩散前的一段时期）。它并不是全球统一的绝对年代标签，而是相对的文化/技术阶段称呼。"]}
{"word":"mezzolithic","summary":{"en":"Mesolithic: the Middle Stone Age between the Paleolithic and Neolithic.","zh":"Mesolithic：中石器时代，介于旧石器时代与新石器时代之间。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Mesolithic period: the Middle Stone Age, a time between the Paleolithic (Old Stone Age) and the Neolithic (New Stone Age), when people commonly lived as hunter-gatherers and used small stone tools.","zh":"与“中石器时代”有关的：介于旧石器时代与新石器时代之间的时期，人们多以狩猎采集为生，并常使用较小的石器工具。"},"examples":[{"en":"Archaeologists found Mesolithic tools near the river, suggesting people camped there seasonally.","zh":"考古学家在河边发现了中石器时代的工具，表明人们可能季节性地在此露营。"},{"en":"The museum has a small exhibit on Mesolithic life, including fishing hooks and stone blades.","zh":"博物馆有一个关于中石器时代生活的小展区，包括鱼钩和石刀片。"}]}],"synonyms":["Mesolithic"],"phonetic":"/ˌmɛzəˈlɪθɪk/","extraExplanation":["“Mesolithic（中石器时代）”是更常见的拼写；你输入的“mezzolithic”多半是拼写错误或少见变体。","词源提示：meso- 表示“中间”，-lithic 与“石头（lith-）”有关，因此字面意思是“中间的石器时代”。","使用场景：常见于考古学、史前史与博物馆展览说明中；在日常英语里不算常用词。"]}
{"word":"mezzos","summary":{"en":"“Mezzos” usually means mezzo-sopranos (female middle voice types) in music settings.","zh":"“Mezzos”通常指女中音（mezzo-soprano）的复数，在音乐/合唱语境中表示女中音声部或歌手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mezzo (short for mezzo-soprano): singers with a middle-to-low female voice range, between soprano and contralto.","zh":"mezzo（mezzo-soprano 的简称）的复数：指女中音歌手，音域介于女高音与女低音之间。"},"examples":[{"en":"The choir has two sopranos, three mezzos, and one alto.","zh":"合唱团有两位女高音、三位女中音和一位女低音。"},{"en":"The director asked the mezzos to sing the harmony more softly.","zh":"指挥让女中音把和声唱得更轻一些。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of mezzo used more generally in music to mean “medium” (e.g., medium volume or intensity).","zh":"mezzo 的复数，更广义地用于音乐中表示“中等”（如中等音量或力度）。"},"examples":[{"en":"Start at mezzo and build to forte by the end of the phrase.","zh":"从中等力度开始，在乐句末尾逐渐加强到强。"},{"en":"The conductor marked a few passages as mezzos rather than fortes.","zh":"指挥把几段标成中等力度，而不是强。"}]}],"synonyms":["mezzo-sopranos","mezzo singers","middle voices"],"phonetic":"/ˈmɛtsoʊz/","extraExplanation":["“mezzo-”来自意大利语，意思是“半、居中”。在声乐里最常见的是“mezzo-soprano（女中音）”，日常排练或合唱分声部时常直接说“mezzo / mezzos”。","注意不要和力度记号混淆：mf = mezzo-forte（中强），mp = mezzo-piano（中弱）。单独写“mezzo(s)”时，通常还是指声部/歌手，具体看上下文。"]}
{"word":"mezzotint","summary":{"en":"Mezzotint is a printmaking method (and a print made by it) known for soft gradations and deep, velvety blacks.","zh":"Mezzotint（美柔汀）是一种以柔和明暗层次和浓郁黑色著称的版画技法（也指其作品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printmaking technique that creates rich, soft tones (especially deep blacks) by roughening a metal plate and then smoothing parts of it to form lighter areas.","zh":"一种版画技法：先把金属版面整体“摇点/粗化”形成可印出深黑的底，再把要变亮的部分刮平、压光，产生柔和的明暗层次。"},"examples":[{"en":"The portrait was reproduced as a mezzotint with velvety shadows.","zh":"这幅肖像用美柔汀版画复制，阴影呈现出天鹅绒般的质感。"},{"en":"In the museum, we saw mezzotints that looked almost like charcoal drawings.","zh":"在博物馆里，我们看到的美柔汀作品看起来几乎像炭笔素描。"}]},{"partOfSpeech":"v.","definition":{"en":"To make an image using the mezzotint process.","zh":"用美柔汀技法制作（版画）；以美柔汀方式雕刻并印制。"},"examples":[{"en":"The artist mezzotinted the plate to achieve a smooth transition from dark to light.","zh":"艺术家用美柔汀处理版面，让明暗过渡非常平滑。"},{"en":"This scene was mezzotinted in the 18th century for popular prints.","zh":"这幅场景在18世纪被制作成美柔汀版画，用于大众印刷品。"}]}],"synonyms":["print","engraving","intaglio"],"phonetic":"/ˈmɛtsoʊˌtɪnt/","extraExplanation":["“Mezzotint”常被译为“美柔汀”或“黑地刻法”。它在17—18世纪的欧洲非常流行，特别适合复制油画式的光影与皮肤质感，因此常用于肖像和名画复制。","学习提示：mezzotint 的特点是“先全黑、再提亮”。与很多从白纸逐步加深的绘画思路相反，它是从深到浅塑造画面，这也解释了它为什么能做出浓郁、柔软的暗部。"]}
{"word":"mezzotinted","summary":{"en":"Mezzotinted means made by (or resembling) the mezzotint printmaking technique, known for rich, smooth shading.","zh":"mezzotinted 指用美柔汀法制作的（或呈现类似美柔汀的）效果，以浓郁、柔和的明暗层次著称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made using the mezzotint process (a printmaking technique that creates rich, soft shadows and smooth tones).","zh":"用“美柔汀法”（一种能呈现浓郁阴影与柔和层次的版画技法）制作的。"},"examples":[{"en":"The museum displayed a mezzotinted portrait with deep, velvety blacks.","zh":"博物馆展出了一幅美柔汀版画肖像，黑色深沉如天鹅绒。"},{"en":"She collects mezzotinted prints from the 18th century.","zh":"她收藏18世纪的美柔汀版画。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered or rendered with tone in a way that resembles a mezzotint (used descriptively, especially in art writing).","zh":"呈现出类似美柔汀版画的柔和明暗层次（多用于艺术描写）。"},"examples":[{"en":"The cloudy sky looked mezzotinted, fading from charcoal to silver.","zh":"多云的天空像美柔汀效果一样，从炭黑渐变到银灰。"},{"en":"His photographs have a mezzotinted softness around the edges.","zh":"他的照片边缘有一种美柔汀般的柔和感。"}]}],"synonyms":["mezzotint","engraved (context-dependent)","etched (context-dependent)","tonal (in art writing)"],"phonetic":"ˈmɛtsoʊˌtɪn.tɪd","extraExplanation":["“mezzotint（美柔汀法）”源自意大利语 mezzotinto，字面意思接近“半色调/半染色”。传统做法是先把铜版表面“摇点”成粗糙颗粒以获得整体深黑，再用刮刀与压光器逐步磨出亮部，因此特别擅长表现从深到浅的细腻过渡。","在英语里 mezzotinted 常见于艺术史、博物馆说明或文学性描写中；有时也会用来比喻“像被柔和阴影渲染过”的视觉效果。"]}
{"word":"mezzotinter","summary":{"en":"A mezzotinter is a printmaker who makes mezzotint engravings.","zh":"mezzotinter 指制作黑调法（美柔汀法）凹版版画的版画家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An artist or printmaker who creates mezzotints (prints made using a special engraving technique that produces rich, velvety tones).","zh":"凹版黑调刻印画家；黑调刻版画家（使用“黑调法/美柔汀法”制作版画的人，画面常有浓郁、柔和的明暗层次）。"},"examples":[{"en":"The museum acquired a portrait by an 18th‑century mezzotinter known for deep shadow and soft light.","zh":"博物馆收藏了一幅18世纪黑调刻版画家创作的肖像作品，以深沉阴影和柔和光线见长。"},{"en":"She trained as a mezzotinter to master subtle gradients from black to gray.","zh":"她学习成为一名黑调刻版画家，以掌握从黑到灰的细腻渐层。"}]}],"synonyms":["mezzotint engraver","printmaker","engraver"],"phonetic":"/ˌmɛtsoʊˈtɪntər/","extraExplanation":["“Mezzotint（黑调法/美柔汀法）”是一种凹版版画技法：先把铜版表面“起毛”成能印出整片深黑的粗糙面，再逐步刮磨、压光来做出亮部与层次，因此特别擅长表现柔和的明暗过渡（像油画的光影）。18世纪的英国肖像复制版画中很常见。"]}
{"word":"mezzotinting","summary":{"en":"Mezzotinting is the art/process of making prints with the mezzotint technique, known for deep blacks and smooth shading.","zh":"Mezzotinting 指用美柔汀版画技法进行制版/印刷的过程，以深黑与柔和明暗过渡见长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or technique of making a mezzotint print (an intaglio printmaking method that creates rich dark tones and soft gradients).","zh":"美柔汀版画法；美柔汀制版/印刷过程（一种凹版版画技法，以深沉黑色与柔和明暗渐变著称）。"},"examples":[{"en":"Mezzotinting allows an artist to produce smooth shadows without obvious lines.","zh":"美柔汀制版能让艺术家做出平滑的阴影，而不会出现明显线条。"},{"en":"She studied mezzotinting to recreate the dramatic lighting of old portraits.","zh":"她学习美柔汀技法来重现老肖像画那种戏剧性的光线效果。"}]},{"partOfSpeech":"v.","definition":{"en":"making images using the mezzotint technique; producing mezzotint prints.","zh":"使用美柔汀技法进行制版/印刷；制作美柔汀版画。"},"examples":[{"en":"He spent the afternoon mezzotinting a new plate for the exhibition.","zh":"他花了一下午用美柔汀技法处理一块新铜版，准备参展。"},{"en":"They are mezzotinting from a photograph to achieve a velvety black.","zh":"他们以照片为参考进行美柔汀制版，以获得天鹅绒般的黑色。"}]}],"synonyms":["mezzotint process","mezzotint printmaking","intaglio printmaking"],"phonetic":"/ˈmɛzəˌtɪntɪŋ/","extraExplanation":["“Mezzotint”源自意大利语 mezzo（半、部分）+ tint（色调），强调“半调/层次渐变”的效果。它在17–18世纪欧洲非常流行，常用于复制油画与肖像，因为能呈现浓郁黑位与细腻灰阶。","技法要点（便于理解词义）：先用摇纹刀（rocker）把金属版面打出密集粗糙点，整块版面本来会印出近乎纯黑；再用刮刀/压光器把需要变亮的区域“刮平、抛光”，越光滑印出来越浅，于是得到从黑到白的柔和过渡。","常见搭配：a mezzotint print（美柔汀版画成品）、a mezzotint plate（美柔汀版/铜版）、rich tonal range（丰富的明暗层次）、velvety blacks（天鹅绒般的黑）。"]}
{"word":"mezzotinto","summary":{"en":"Mezzotinto is a printmaking method (and the resulting print) known for very smooth, rich light-and-shadow shading.","zh":"Mezzotinto（美柔汀）是一种版画技法及其作品，以极其细腻、浓郁的明暗渐变著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printmaking technique and the print made from it, where an artist roughens a metal plate and then smooths areas to create rich dark-to-light tones (often used for portraits and dramatic lighting).","zh":"一种版画技法及其作品：先把金属版全面打粗形成深黑底，再将部分区域磨光以形成从深到浅的丰富明暗层次（常用于肖像与戏剧性光影）。"},"examples":[{"en":"The museum displayed a mezzotinto of a famous actor, with soft shadows and glowing highlights.","zh":"博物馆展出了一幅著名演员的美柔汀版画，阴影柔和、亮部发光。"},{"en":"She studied mezzotinto to learn how artists created smooth gradients before photography.","zh":"她学习美柔汀技法，以了解摄影出现之前艺术家如何做出平滑的明暗过渡。"}]}],"synonyms":["mezzotint","print","engraving","etching"],"phonetic":"/ˌmɛtsoʊˈtɪntoʊ/","extraExplanation":["“mezzotinto”源自意大利语 mez(o)（半、部分）+ tinto（染色、着色），意思接近“半色调/中间调”。这种方法在17—18世纪的欧洲非常流行，尤其适合再现油画般的深沉暗部与细腻灰阶。","学习时可把它和其他版画区分：蚀刻（etching）常见清晰线条；铜版雕刻（engraving）线条更硬朗；而美柔汀（mezzotinto）以“明暗块面与渐变”见长。"]}
