{"word":"mib","summary":{"en":"“mib/MIB” is usually an abbreviation meaning Men in Black, a network-management MIB (Management Information Base), or the data unit Mib (mebibit).","zh":"“mib/MIB”通常是缩写，常见指黑衣人（Men in Black）、网络管理信息库（Management Information Base），或数据单位 Mib（mebibit，二进制百万比特）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Men in Black: a term for mysterious government agents (real or fictional), especially from the sci‑fi series/films “Men in Black.”","zh":"（缩写）Men in Black（黑衣人）：指神秘的政府特工（真实传闻或虚构作品中），尤其常见于科幻作品/电影《黑衣人》系列。"},"examples":[{"en":"The tabloid claimed a MIB visited the witness after the UFO sighting.","zh":"那家小报声称在目击不明飞行物后，有黑衣人去找了证人。"},{"en":"I’m rewatching MIB tonight.","zh":"我今晚要重看《黑衣人》（MIB）。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, abbr.) Management Information Base: a database used to manage and monitor network devices, especially in SNMP (Simple Network Management Protocol).","zh":"（计算机/网络，缩写）Management Information Base（管理信息库）：用于管理与监控网络设备的数据库，尤其用于 SNMP（简单网络管理协议）。"},"examples":[{"en":"The router exposes performance counters through the SNMP MIB.","zh":"这台路由器通过 SNMP 的 MIB 提供性能计数器。"},{"en":"We updated the MIB so the monitoring system can read the new sensor values.","zh":"我们更新了 MIB，这样监控系统就能读取新的传感器数值。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, abbr.) mebibit (Mib): a unit of information equal to 2^20 bits (1,048,576 bits).","zh":"（计算机，缩写）mebibit（Mib，二进制百万比特）：信息单位，等于 2^20 比特（1,048,576 比特）。"},"examples":[{"en":"The spec lists the bitrate as 10 Mib/s.","zh":"规格表把比特率写为 10 Mib/s。"},{"en":"Don’t confuse Mib with Mb; one is binary-based and the other is often decimal-based.","zh":"别把 Mib 和 Mb 混淆：一个通常按二进制计算，另一个常按十进制理解。"}]}],"synonyms":["Men in Black","Management Information Base","mebibit"],"phonetic":"/ˌɛm aɪ ˈbiː/","extraExplanation":["在英文里“mib/MIB”几乎总是缩写，具体含义要看语境：看电影/流行文化多半是《黑衣人》；谈网络运维与 SNMP 则多半是“管理信息库”；谈带宽或比特率单位时，可能是 Mib（mebibit）。","大小写有时能提示含义：流行文化里常写 MIB；单位常写 Mib（只有 b 小写表示 bit）。但实际写法并不总严格，最好结合上下文判断。"]}
{"word":"mibound","summary":{"en":"“Mibound” isn’t a standard word; it’s usually a typo for “misbound” (a book bound incorrectly).","zh":"“mibound”不是标准词，通常是“misbound”的拼写错误，指书装订出错。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually a misspelling) “mibound” is not a standard English word. People often mean “misbound,” describing a book that was bound incorrectly (pages in the wrong order, upside down, or with the wrong cover).","zh":"（通常是拼写错误）“mibound”不是标准英语单词。人们常常想表达“misbound”，指书籍装订出错（页码顺序错、倒装、或封面装错等）。"},"examples":[{"en":"I think “mibound” is a typo—did you mean “misbound”?","zh":"我觉得“mibound”是打错了——你是想写“misbound”吗？"},{"en":"The first edition was misbound, so some chapters were out of order.","zh":"第一版装订出错，所以有些章节顺序乱了。"}]},{"partOfSpeech":"v.","definition":{"en":"Misbound (past participle of “misbind”): bound incorrectly; put together in the wrong way.","zh":"misbound（动词 misbind 的过去分词）：装订错误；以错误方式装配/捆绑在一起。"},"examples":[{"en":"Several copies arrived misbound and had to be replaced.","zh":"有几本寄到时装订错误，只能更换。"},{"en":"The booklet was misbound, with the cover attached backward.","zh":"这本小册子装订错了，封面反着装上去了。"}]}],"synonyms":["bound wrong","incorrectly bound","faultily bound"],"phonetic":"/ˌmɪsˈbaʊnd/","extraExplanation":["“misbound”最常见于出版、印刷与图书馆语境（如：misbound copy 装订错误的册）。日常口语里更常说：the pages are in the wrong order（页码顺序错了）或 the book was bound wrong（装订错了）。","如果你其实想表达“my bound / I’m bound（我一定会……）”或“unbound（未受束缚的）”，告诉我句子上下文，我可以帮你确定正确词。"]}
{"word":"mibs","summary":{"en":"“mibs” most often means “Men in Black” (plural), and in tech it can mean the plural of MIB (Management Information Base) used in networking.","zh":"“mibs”最常指“黑衣人”（Men in Black）的复数；在技术语境中也可指网络管理里的 MIB（管理信息库）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) “Men in Black”: secret government agents in the popular sci‑fi series, known for wearing black suits and dealing with aliens.","zh":"（复数）“黑衣人”：流行科幻作品中的秘密政府特工，以黑西装形象著称，负责处理外星相关事件。"},"examples":[{"en":"I rewatched Men in Black, and the MIBs are still hilarious.","zh":"我重看了《黑衣人》，里面的黑衣人还是很好笑。"},{"en":"In the movie, the MIBs erase witnesses’ memories with a special device.","zh":"在电影里，黑衣人用一种特殊装置消除目击者的记忆。"}]},{"partOfSpeech":"n.","definition":{"en":"(tech, plural) Management Information Bases: databases of network information used with SNMP (a network monitoring/control system).","zh":"（技术，复数）管理信息库：与 SNMP（网络监控/管理系统）配合使用的网络信息数据库。"},"examples":[{"en":"The monitoring tool pulls interface statistics from SNMP MIBs.","zh":"这个监控工具从 SNMP 的管理信息库里读取接口统计数据。"},{"en":"We updated the device’s MIBs so the network manager can recognize new sensors.","zh":"我们更新了设备的管理信息库，让网络管理系统能识别新的传感器。"}]}],"synonyms":["Men in Black","agents","management information bases"],"phonetic":"/mɪbz/","extraExplanation":["“MIBs”常见于两种语境：一是流行文化里的《Men in Black》（黑衣人）系列；二是网络工程语境中“MIB”的复数（Management Information Base）。具体含义通常靠上下文判断：谈电影/外星人多半是前者；谈SNMP/交换机/路由器多半是后者。"]}

