{"word":"mid","summary":{"en":"“Mid” means “in the middle” (time, place, or action), and it also appears as the prefix “mid-” in many common words.","zh":"“mid”表示“在中间/中期”，也常作前缀“mid-”出现在许多常见词里。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in the middle of; around the middle point or time","zh":"在……中间；在中段/中期左右"},"examples":[{"en":"We met in mid-July.","zh":"我们在七月中旬见面。"},{"en":"She woke up mid-conversation and looked confused.","zh":"她在谈话进行到一半时醒来，看起来很困惑。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle part; an abbreviation of “middle” (often in compounds)","zh":"中间部分；“middle”的缩写（常用于复合词中）"},"examples":[{"en":"The ball hit him in the midsection.","zh":"球打中了他的腹部（身体中段）。"},{"en":"They live in the midwest of the United States.","zh":"他们住在美国中西部。"}]},{"partOfSpeech":"prep.","definition":{"en":"(informal) in the middle of (something happening)","zh":"（非正式）在……进行到一半时；正当……的时候"},"examples":[{"en":"I was mid-sentence when the phone rang.","zh":"电话响时，我正说到一半。"}]}],"synonyms":["middle","central","intermediate","halfway"],"phonetic":"/mɪd/","extraExplanation":["“mid-”也常作为前缀使用，表示“中间的/中期的”，如 midterm（期中/中期的）、midday（正午）、midlife（中年）。写作中常用连字符：mid-July, mid-year；有些固定词不加连字符：midnight, Midwest。","口语或网络表达里，“mid- + 名词”常用来强调“正在做某事做到一半”：mid-game, mid-conversation。语气偏随意。"]}
{"word":"Mid-Autumn","summary":{"en":"Mid-Autumn most commonly refers to the Mid-Autumn Festival and its season, associated with the full moon and family reunions.","zh":"Mid-Autumn 最常指“中秋（节）”及其前后时节，常与满月、团圆等意象相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time around the Mid-Autumn Festival, a traditional East Asian harvest festival celebrated on the 15th day of the 8th lunar month (often in September or October), known for the full moon, mooncakes, and family reunions","zh":"中秋（节）前后：东亚传统的丰收节日，农历八月十五（通常在9月或10月），以赏满月、吃月饼和家人团圆为代表"},"examples":[{"en":"We usually go back to our hometown for Mid-Autumn to have dinner together.","zh":"我们通常在中秋回老家一起吃团圆饭。"},{"en":"During Mid-Autumn, people share mooncakes and watch the full moon.","zh":"中秋期间，人们会分享月饼、赏满月。"},{"en":"Mid-Autumn greetings often wish people a happy reunion and a bright moon.","zh":"中秋祝福常常祝人团圆、月圆人圆。"}]},{"partOfSpeech":"n.","definition":{"en":"mid-autumn; the middle part of the autumn season","zh":"仲秋；秋季的中期"},"examples":[{"en":"The weather is cool and dry in mid-autumn.","zh":"仲秋时节天气凉爽干燥。"},{"en":"By mid-autumn, the leaves start turning yellow.","zh":"到了仲秋，叶子开始变黄。"}]}],"synonyms":["the Mid-Autumn Festival","mid-autumn"],"phonetic":"/ˌmɪd ˈɔtəm/","extraExplanation":["英语里更常见的完整说法是 “the Mid-Autumn Festival”。单独说 “Mid-Autumn” 也能理解，但通常出现在节日语境（如问候、活动标题）。","常见搭配：Mid-Autumn Festival（中秋节）、Mid-Autumn moon（中秋月）、Mid-Autumn celebration（中秋庆祝活动）、moon-gazing（赏月）、family reunion（阖家团圆）。","文化提示：不同地区庆祝方式不完全相同（如中国、越南、韩国等），但“满月/团圆/丰收”的主题很常见。"]}
{"word":"midafternoon","summary":{"en":"Midafternoon means the middle part of the afternoon (often around 2–4 p.m.), and it can also describe something that happens at that time.","zh":"midafternoon 指“下午中段”（常在两点到四点左右），也可作形容词表示“发生在下午中段的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of the afternoon, usually around 2–4 p.m. (but it can vary).","zh":"下午中段；通常指下午两点到四点左右（时间可因语境而不同）。"},"examples":[{"en":"Let’s meet in midafternoon, around three.","zh":"我们下午中段见面吧，大概三点左右。"},{"en":"By midafternoon, the sun was still bright but less intense.","zh":"到了下午中段，太阳依然明亮，但没那么刺眼了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle part of the afternoon.","zh":"发生在下午中段的。"},"examples":[{"en":"We took a midafternoon break to get coffee.","zh":"我们下午中段休息了一下去买咖啡。"},{"en":"A midafternoon nap can help you feel more alert later.","zh":"下午中段小睡一会儿，之后会更精神。"}]}],"synonyms":["middle of the afternoon","mid-afternoon","later afternoon (less exact)"],"phonetic":"/ˌmɪdˌæf.tɚˈnun/","extraExplanation":["在书面语中也常写作“mid-afternoon”（加连字符）。日常口语里，人们也会用“around midafternoon”或更具体的时间（如“around 3 p.m.”）来避免含糊。"]}
{"word":"midair","summary":{"en":"Midair means “in the air” or “happening while in the air.”","zh":"midair 表示“在空中”或“发生在空中的/腾空时的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the air (not on the ground), especially while jumping or flying.","zh":"在空中（不在地面上），尤指跳起或飞行时。"},"examples":[{"en":"The basketball player caught the ball midair and scored.","zh":"那名篮球员在空中接住球并得分。"},{"en":"The two birds collided midair.","zh":"两只鸟在空中相撞。"},{"en":"She changed direction midair while doing a flip.","zh":"她在做空翻时在空中改变了方向。"}]},{"partOfSpeech":"adj.","definition":{"en":"Occurring while someone or something is in the air.","zh":"发生在空中（在飞行或腾空过程中）的。"},"examples":[{"en":"A midair explosion forced the plane to turn back.","zh":"一次空中爆炸迫使飞机返航。"},{"en":"The drone captured a midair view of the city.","zh":"无人机拍下了城市的空中景观。"}]}],"synonyms":["in the air","airborne","aloft"],"phonetic":"/ˌmɪdˈɛr/","extraExplanation":["“midair”由 mid-（中间）+ air（空气）构成，常见于体育解说、新闻报道（如空中相撞/爆炸）和科幻/动作场景描写。","拼写提示：常写作一个词 midair；有时也会看到 mid-air（带连字符），意义相同。"]}
{"word":"midairs","summary":{"en":"Midair means “in the air above the ground,” often used in “in midair,” and it can describe events happening before landing (e.g., a midair collision).","zh":"Midair 指“半空中/在空中”，常用于短语 in midair，也可作形容词表示“空中发生的”（如空中相撞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the air above the ground, not touching any surface; the space where something is flying or suspended","zh":"半空中；离地面的空中（不接触任何表面）"},"examples":[{"en":"The gymnast seemed to pause in midair for a second.","zh":"体操运动员似乎在半空中停顿了一秒。"},{"en":"The ball collided with another ball in midair.","zh":"两个球在半空中相撞了。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or located in the air above the ground, before landing","zh":"在空中发生的；在落地前的"},"examples":[{"en":"A midair collision forced the pilots to make an emergency landing.","zh":"一次空中相撞迫使飞行员紧急降落。"},{"en":"He performed a midair twist during the jump.","zh":"他在跳跃过程中做了一个空中转体。"}]},{"partOfSpeech":"adv.","definition":{"en":"in the air, not on the ground (often used in the phrase “in midair”)","zh":"在空中（常用于短语“in midair”）"},"examples":[{"en":"The bird hovered midair, wings beating fast.","zh":"那只鸟在空中悬停，翅膀快速拍动。"},{"en":"She stopped midair and then fell into the water.","zh":"她在半空中停了一下，然后落入水中。"}]}],"synonyms":["aloft","airborne","in the air"],"phonetic":"/ˌmɪdˈer/","extraExplanation":["你输入的“midairs”在实际英语里不太常见；更常见的是“midair”（不可数/作名词）或短语“in midair”。如果你想表达“在半空中（发生）”，通常说“in midair”。","拼写上常见两种：midair（美式常见）和 mid-air（带连字符，较正式或英式写法也可见）。","常见搭配：midair collision（空中相撞），midair refueling（空中加油），hang/suspend in midair（悬在半空）。"]}
{"word":"midas","summary":{"en":"Midas is the mythic king who could turn things into gold, and it also means a person with exceptional money-making success.","zh":"Midas 指神话中“点石成金”的迈达斯王，也可引申为特别会赚钱、很容易成功的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Greek mythology) a king whose wish turned everything he touched into gold; often used to refer to someone who makes money easily or seems to succeed at making things valuable.","zh":"（希腊神话）迈达斯王：他许愿后“点石成金”，触碰到的东西都会变成黄金；常用来指很会赚钱、似乎做什么都能变得很值钱的人。"},"examples":[{"en":"People say she has the Midas touch—every business she starts becomes profitable.","zh":"人们说她有“迈达斯之手”——每个她开始的生意都能赚钱。"},{"en":"The story of King Midas warns that greed can turn a blessing into a curse.","zh":"迈达斯王的故事提醒我们：贪婪会把祝福变成诅咒。"}]}],"synonyms":["King Midas","the Midas touch"],"phonetic":"/ˈmaɪdəs/","extraExplanation":["“Midas”来自希腊神话。最常见的版本里，他向酒神狄俄尼索斯许愿，希望“所触皆成金”。愿望实现后，他发现连食物和饮水也会变成黄金，无法进食，最后被迫请求解除。这个故事常用来讨论“贪婪的代价”。","英语里更常见的固定说法是 the Midas touch（迈达斯之手），多用于商业/投资语境，表示“特别会把事情变得赚钱/成功”；但有时也带一点提醒意味：过度追求金钱可能带来负面后果。"]}
{"word":"midatlantic","summary":{"en":"Mid-Atlantic usually describes either a U.S. region on the Atlantic coast or the middle part of the Atlantic Ocean.","zh":"Mid-Atlantic通常指美国大西洋沿岸的“中大西洋地区”，或指大西洋的中部区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Mid-Atlantic region of the United States (commonly including states such as New York, New Jersey, Pennsylvania, Delaware, Maryland, Washington, D.C., and sometimes Virginia and West Virginia)","zh":"与美国“中大西洋地区”（通常包括纽约州、新泽西州、宾夕法尼亚州、特拉华州、马里兰州、华盛顿特区；有时也包括弗吉尼亚州和西弗吉尼亚州）有关的"},"examples":[{"en":"She grew up in the Mid-Atlantic and moved to California after college.","zh":"她在美国中大西洋地区长大，大学毕业后搬去了加州。"},{"en":"Mid-Atlantic cities often have a mix of Northern and Southern cultural influences.","zh":"中大西洋地区的城市常常融合了美国北方和南方的文化影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"in or related to the middle part of the Atlantic Ocean","zh":"位于大西洋中部的；与大西洋中部有关的"},"examples":[{"en":"The storm formed in the mid-Atlantic and moved west.","zh":"这场风暴在大西洋中部生成，随后向西移动。"},{"en":"The ship made a mid-Atlantic stop to refuel.","zh":"这艘船在大西洋中部停靠加油。"}]}],"synonyms":["middle of the Atlantic","Mid-Atlantic region"],"phonetic":"/ˌmɪd.ətˈlæn.tɪk/","extraExplanation":["“Mid-Atlantic”通常要加连字符，尤其作形容词时（Mid-Atlantic region）。不加连字符写成“midatlantic”在正式写作中不常见，多见于标签、用户名、文件名等。","作为美国地理概念时，它的范围没有绝对统一标准：不同机构/媒体可能把某些州算进或算出，所以理解时可结合语境（例如新闻、市场报告或旅行指南的定义）。"]}
{"word":"midautumn","summary":{"en":"“Midautumn” usually means “mid-autumn” (the middle of the autumn season) or, in East Asian contexts, “Mid-Autumn (Festival),” a moon-and-harvest celebration.","zh":"“midautumn”通常指“仲秋”（秋季中段），或在东亚语境中指“中秋（节）”，即赏月与庆丰收的节日。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of the autumn season; relating to that time of year.","zh":"发生在秋季中段的；与仲秋时节有关的。"},"examples":[{"en":"The air turns cool and dry in mid-autumn.","zh":"仲秋时节空气会变得凉爽又干燥。"},{"en":"We took a mid-autumn trip to see the fall colors.","zh":"我们在仲秋去旅行看秋叶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in East Asian contexts) Connected to the Mid-Autumn Festival, a harvest-and-moon celebration.","zh":"（多用于东亚语境）与中秋节有关的（赏月与庆丰收的节日）。"},"examples":[{"en":"They shared mid-autumn mooncakes with neighbors.","zh":"他们和邻居分享中秋月饼。"},{"en":"Mid-autumn traditions often include admiring the full moon.","zh":"中秋传统常包括赏满月。"}]},{"partOfSpeech":"n.","definition":{"en":"Mid-Autumn Festival; a major traditional festival celebrated in many Chinese-speaking communities.","zh":"中秋节；在许多华语社群广泛庆祝的重要传统节日。"},"examples":[{"en":"Mid-Autumn is a time for family reunions.","zh":"中秋节是家人团圆的时刻。"},{"en":"We celebrate Mid-Autumn by eating mooncakes and lighting lanterns.","zh":"我们通过吃月饼、点灯笼来庆祝中秋。"},{"en":"She went home for Mid-Autumn to be with her parents.","zh":"她回家过中秋陪父母。"}]}],"synonyms":["mid-autumn","the Mid-Autumn Festival","Moon Festival"],"phonetic":"/ˌmɪd ˈɔtəm/","extraExplanation":["英语里更常见的写法是 **Mid-Autumn**（常加连字符：*Mid-Autumn*）或更完整的 **the Mid-Autumn Festival**。口语和媒体中也常说 **Moon Festival**（月亮节）。","文化语境里，“Mid-Autumn”通常指农历八月十五前后，强调“满月”“团圆”“丰收”。常见意象包括月饼、灯笼、桂花与赏月。","写作小提示：如果你只写 *mid-autumn*（小写），多半表示季节时间；如果写 *Mid-Autumn*（大写），更像在指节日或固定名称。"]}
{"word":"midaxillary","summary":{"en":"A medical term meaning “on the line down the side of the body through the middle of the armpit.”","zh":"医学用语，指“沿身体侧面穿过腋窝正中的那条线（腋中线）处/相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located along the midaxillary line (an imaginary vertical line down the side of the body passing through the middle of the armpit).","zh":"位于腋中线（沿身体侧面、穿过腋窝正中向下的假想垂直线）上的；腋中线的。"},"examples":[{"en":"The nurse placed the stethoscope at the midaxillary line to listen to lung sounds.","zh":"护士把听诊器放在腋中线处来听肺部呼吸音。"},{"en":"The doctor noted tenderness in the left midaxillary region.","zh":"医生记录到左侧腋中线区域有压痛。"}]}],"synonyms":["axillary (related to the armpit)","lateral (general: on the side)"],"phonetic":"/ˌmɪdˈæksəˌlɛri/","extraExplanation":["“midaxillary”常见于医学英语，尤其是体格检查、影像学描述和解剖定位（例如“midaxillary line/腋中线”）。它帮助医护人员用统一的方式描述身体位置。","词形拆解：mid-（中间）+ axillary（腋的、腋窝的）。常见相关线还有：midclavicular line（锁骨中线）、midsternal line（胸骨中线）。"]}
{"word":"midband","summary":{"en":"Midband means the middle frequencies in audio (between bass and treble), often important for vocal clarity.","zh":"Midband 指音频的中频段（介于低频与高频之间），常与人声清晰度密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle range of frequencies in an audio signal (between low/bass and high/treble).","zh":"（音频信号的）中频段；介于低频/低音与高频/高音之间的频率范围。"},"examples":[{"en":"Vocals usually sit in the midband, so if the singer sounds harsh, try reducing the midband a little.","zh":"人声通常位于中频段，所以如果歌手听起来刺耳，可以稍微降低一点中频。"},{"en":"This speaker has a clear midband, making dialogue easy to understand.","zh":"这款音箱的中频很清晰，因此对白很容易听清。"}]}],"synonyms":["midrange","middle frequencies"],"phonetic":"/ˈmɪdˌbænd/","extraExplanation":["在音频工程里，midband 常见于均衡器（EQ）或音箱评测。它不是严格固定的频率区间，但通常大致指中频（例如约 250 Hz–2 kHz 或更宽到 5 kHz，取决于语境和设备）。中频影响“清晰度、存在感、鼻音感、穿透力”等听感。","相关词：bass/low end（低频）、treble/high end（高频）、midrange（中频/中音，和 midband 很接近）、presence（存在感，常在较高的中频区域）。"]}
{"word":"midbody","summary":{"en":"Midbody means the middle/central part of a body or structure, often used in medical or biological descriptions.","zh":"midbody 指身体或结构的中部/中段，常见于医学或生物学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The central part of something; the middle portion of a body or structure.","zh":"某物的中部；身体或结构的中间部分。"},"examples":[{"en":"The fish has a dark stripe running along its midbody.","zh":"这条鱼的身体中部有一条深色条纹。"},{"en":"The injury was located on the midbody of the pancreas.","zh":"伤口位于胰腺的中部。"}]}],"synonyms":["midsection","middle part","central portion"],"phonetic":"/ˈmɪdˌbɑdi/","extraExplanation":["“midbody”是一个复合词：mid-（中间的）+ body（身体/主体）。在日常英语里更常见的说法通常是“the middle of the body”或“the central part”。","在医学与解剖学语境中，“midbody”常用来指某个器官或结构的“中段/中部”（例如胰腺、子宫、肌腱等）。在生物学描述（如鱼类、昆虫）中，也可用来指“身体中段”。","相关词：midsection（腹部/中段，更口语），middle part（中间部分，通用），central portion（中心部分，偏正式）。"]}
{"word":"midbrain","summary":{"en":"The midbrain is the middle part of the brainstem, important for reflexes, eye movement, alertness, and movement control.","zh":"中脑是脑干的中间部分，重要功能包括反射、眼球运动、警觉性与运动控制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of the brainstem, located between the pons and the diencephalon; it helps control eye movements, hearing/vision reflexes, alertness, and movement.","zh":"中脑：脑干的中间部分，位于脑桥与间脑之间；参与控制眼球运动、听觉/视觉反射、警觉性与运动等功能。"},"examples":[{"en":"The midbrain helps control reflexes related to vision and hearing.","zh":"中脑有助于控制与视觉和听觉相关的反射。"},{"en":"Damage to the midbrain can affect eye movement and alertness.","zh":"中脑受损可能会影响眼球运动和警觉性。"}]}],"synonyms":["mesencephalon"],"phonetic":"/ˈmɪdˌbreɪn/","extraExplanation":["中脑（midbrain）在解剖学上也常被称为“mesencephalon（中脑/中脑脑泡）”。它是脑干的一部分，常被分为顶盖（tectum）和被盖（tegmentum）等区域；学习时可把它理解为连接“更高层的脑（负责思考、感觉整合）”与“更低层的脑干/脊髓（负责基本生命与反射）”的重要通道与调控站。","在新闻或医学语境里，你可能会看到“midbrain dopamine system（中脑多巴胺系统）”，与奖赏、动机和某些运动控制有关；这类表述通常是更专业的神经科学用法。"]}
{"word":"midbrains","summary":{"en":"“Midbrains” means the plural form of “midbrain,” a part of the brainstem important for sensory processing and movement.","zh":"“Midbrains”是“midbrain（中脑）”的复数，指脑干中重要的一部分，和感觉处理与运动控制等功能相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of midbrain: the middle part of the brainstem, involved in vision, hearing, movement control, alertness, and reflexes.","zh":"midbrain（中脑）的复数：脑干的中间部分，参与视觉与听觉处理、运动控制、清醒程度以及一些反射活动。"},"examples":[{"en":"Researchers compared the midbrains of patients and healthy volunteers.","zh":"研究人员比较了患者与健康志愿者的中脑。"},{"en":"Damage to the midbrains can affect eye movement and attention.","zh":"中脑受损可能影响眼球运动和注意力。"}]}],"synonyms":["midbrains (plural)","mesencephala","mesencephalons"],"phonetic":"/ˈmɪdˌbreɪn/","extraExplanation":["“Midbrain”在解剖学中属于脑干（brainstem）的一部分，常见相关结构包括“tectum（顶盖）”和“tegmentum（被盖）”。在科普或医学写作中更常用单数“the midbrain”，只有在比较不同个体或动物时才常见复数“midbrains”。"]}
{"word":"midcarpal","summary":{"en":"Midcarpal means “related to the midcarpal joint in the wrist.”","zh":"midcarpal 指“与手腕的腕骨中关节有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the midcarpal joint, the joint in the wrist between the two rows of carpal (wrist) bones.","zh":"与腕骨中关节（腕部两排腕骨之间的关节）有关的。"},"examples":[{"en":"The doctor assessed midcarpal stability after the wrist injury.","zh":"医生在手腕受伤后评估了腕骨中关节的稳定性。"},{"en":"Midcarpal pain can increase when you bend or twist your wrist.","zh":"弯曲或扭转手腕时，腕骨中关节疼痛可能会加重。"}]}],"synonyms":["mid-carpal","of the midcarpal joint"],"phonetic":"/ˌmɪdˈkɑrpəl/","extraExplanation":["“midcarpal”主要用于医学英语（骨科、运动医学、物理治疗、影像报告）。其中 mid- 表示“中间的”，carpal 来自 carpus（腕），指“腕骨”。临床上常见搭配：midcarpal joint（腕骨中关节）、midcarpal instability（腕骨中关节不稳）、midcarpal arthrodesis（腕骨中关节融合术）。"]}
{"word":"midchannel","summary":{"en":"Midchannel means the middle part of a water channel, or something located there.","zh":"midchannel 指水道的中间部分，或指位于/经过该处的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of a river, canal, or sea channel (often where the water is deepest and boats travel)","zh":"（河道、运河或海峡的）中间水道；主航道的中段（常指水最深、船只常走的部分）"},"examples":[{"en":"The ferry slowed down when it reached midchannel.","zh":"渡轮到达航道中间时减速了。"},{"en":"A buoy marked the midchannel to guide ships safely.","zh":"一个浮标标出了航道中间，引导船只安全航行。"}]},{"partOfSpeech":"adj.","definition":{"en":"located in or moving through the middle of a channel","zh":"位于航道中间的；在航道中间行进的"},"examples":[{"en":"They kept to a midchannel course to avoid the rocks near shore.","zh":"他们保持在航道中间航行，以避开近岸的礁石。"},{"en":"The rescue team spotted a midchannel current pulling the boat outward.","zh":"救援队发现一股航道中间的水流把船往外拉。"}]}],"synonyms":["mid-channel","center channel","midstream (for rivers)"],"phonetic":"/ˈmɪdˌtʃænəl/","extraExplanation":["“midchannel”在现代英语中也常写作“mid-channel”（更常见，尤其在书面或航海/水文语境）。两种写法通常意思相同。","在航海英语里，midchannel 常暗示“主航道/深水区”，对比 nearshore（近岸）或 inshore（近海）更安全、也更适合大型船只通行。"]}
{"word":"midcourse","summary":{"en":"Midcourse means “in the middle of a course or process,” often implying an adjustment or review partway through.","zh":"midcourse 指“在过程/课程的中段”，常带有“中途复盘或调整”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in the middle part of a course, process, trip, or period of time","zh":"在一段课程、过程、旅程或时期的中段；中途的"},"examples":[{"en":"We made a midcourse adjustment to the schedule after the first week.","zh":"第一周结束后，我们对日程做了中途调整。"},{"en":"Midcourse feedback helps students improve before the final exam.","zh":"中期反馈能帮助学生在期末考试前改进。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle part of a course, process, or journey (often used in set phrases like “midcourse correction”)","zh":"课程、过程或旅程的中段（常用于固定搭配，如“midcourse correction”）"},"examples":[{"en":"The project needed a midcourse correction when costs rose.","zh":"成本上升时，这个项目需要一次中途纠偏。"},{"en":"At midcourse, the team reviewed its goals and progress.","zh":"在进程过半时，团队回顾了目标和进度。"}]}],"synonyms":["midway","middle","intermediate","halfway","in-progress"],"phonetic":"/ˈmɪdˌkɔrs/","extraExplanation":["“midcourse correction（中途修正/中途纠偏）”原本常见于航天与导弹领域，指飞行途中根据偏差进行轨道/方向修正；后来广泛用于商业、学习与人生规划中，表示在进行到一半时及时调整策略。","拼写提示：有时也写作“mid-course”，但现代英文中连写“midcourse”也常见；作为形容词多用于修饰名词（midcourse review/adjustment）。"]}
{"word":"midcult","summary":{"en":"Midcult is culture that seems serious and refined but is simplified to be widely popular—often viewed as a diluted form of high culture.","zh":"Midcult 指看似严肃高雅、但为了大众市场而被简化的文化作品，常被视为“稀释版”的高雅文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of culture (books, movies, art, etc.) that is more “serious” than mass entertainment but is made to be easy and popular, often seen as a watered-down version of high culture","zh":"“中间文化”：比大众娱乐更“严肃”，但为了受欢迎而更容易理解、可消费；常被批评为把“高雅文化”稀释成更好卖的版本"},"examples":[{"en":"Some critics call certain award-bait movies midcult because they feel important but avoid real risk.","zh":"一些评论家把某些“冲奖”电影称为 midcult，因为它们看起来很重要，但会回避真正的冒险。"},{"en":"He argues that midcult borrows the style of classic literature but simplifies the ideas for a broad audience.","zh":"他认为 midcult 借用了经典文学的外壳，但为了大众读者把思想简化了。"},{"en":"Whether a novel is midcult or genuinely literary can be a matter of taste.","zh":"一部小说是 midcult 还是更“纯文学”，有时取决于个人品味。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or typical of midcult","zh":"与“中间文化”有关的；具有 midcult 特征的"},"examples":[{"en":"The show has a midcult vibe: polished, meaningful-sounding, and easy to watch.","zh":"这部剧有种 midcult 的感觉：制作精良、听起来很有意义、而且很容易看。"},{"en":"She dislikes midcult criticism that judges popular art by elite standards.","zh":"她不喜欢那种带有 midcult 色彩的批评方式：用精英标准去评判流行艺术。"}]}],"synonyms":["middlebrow","popularized high culture","mainstream literary fiction (in a critical sense)"],"phonetic":"/ˈmɪdˌkʌlt/","extraExplanation":["“midcult”常见于文化批评语境，最著名的来源是美国评论家 Dwight Macdonald（20世纪中期）。他提出“Masscult（大众文化/工业化娱乐）—Midcult（中间文化）—High culture（高雅文化）”的区分，用来批评某些作品借用“严肃艺术”的外观和情绪，但把复杂性与挑战性削弱，以便更容易被市场接受。","这个词带有明显的评价色彩，使用时往往暗含“看似高级、实则迎合”的批评；在正式写作中最好说明你所指的标准（如叙事复杂度、语言风格、思想深度、市场导向等），避免把它当成简单的“好/坏”标签。"]}
{"word":"midcults","summary":{"en":"Midcult is culture that seems serious and refined but is simplified for mass appeal—between high culture and pop culture.","zh":"Midcult 指看似严肃高雅、但为迎合大众而被简化的文化产品，介于高雅文化与流行文化之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of culture (books, movies, music, etc.) that is made for a wide audience and looks “serious” or “highbrow,” but is simplified and designed to be easy to consume—often seen as being between high culture and mass culture","zh":"一种介于“高雅文化”和“大众文化”之间的文化类型：面向大众、外表看起来很“严肃/有品味”，但内容往往被简化、易于消费，因此常被批评为“装作高雅却不够深入”"},"examples":[{"en":"Some critics call certain award-season films midcult: serious themes, but safe storytelling.","zh":"一些评论家把某些颁奖季电影称为 midcult：主题严肃，但叙事方式很安全、保守。"},{"en":"She enjoys midcult novels—readable, emotional, and more polished than pure genre fiction.","zh":"她喜欢 midcult 小说：好读、情感充沛，也比纯类型小说更精致。"},{"en":"The museum’s new show was accused of midcult taste—accessible, but not very challenging.","zh":"博物馆的新展览被指是 midcult 品味：容易亲近，但不太有挑战性。"}]}],"synonyms":["middlebrow","popularized high culture","mainstream culture (in critical contexts)"],"phonetic":"/ˈmɪdˌkʌlt/","extraExplanation":["“midcult”常见于文化批评语境，最有名的来源之一是美国评论家 Dwight Macdonald 在 20 世纪中期对“Masscult（大众通俗文化）/Midcult（中间文化）/High Culture（高雅文化）”的区分。它通常带有批判色彩，强调“看起来像高雅文化、但被商业化与简化”。在实际使用中，有时也会更中性地表示“面向大众的高品质文化产品”。"]}
{"word":"midd","summary":{"en":"“midd” is usually not a real word; it’s most often a typo for “mid” or an informal shortening of “middle.”","zh":"“midd”通常不是正式单词；多半是把“mid”拼错，或非正式地缩写“middle”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “mid” or an informal shortening of “middle.”","zh":"不是标准英语单词；最常见是把“mid”拼错，或在非正式场合把“middle（中间）”缩写成“midd”。"},"examples":[{"en":"Did you mean “mid” (like “midterm”) or “middle” (like “in the middle”) instead of “midd”?","zh":"你想写的是“mid”（如 midterm 期中考试）还是“middle”（如 in the middle 在中间），而不是“midd”？"},{"en":"In casual notes, someone might write “midd” to mean “middle,” but it’s uncommon.","zh":"在随手记的便条里，有人可能用“midd”表示“middle”，但并不常见。"}]}],"synonyms":["mid","middle"],"phonetic":"/mɪd/","extraExplanation":["“mid”是常见前缀/词根，用来表示“中间的、半途的”，如：midday（正午）、midnight（午夜）、midterm（期中）。如果你想表达“中路/中线”（游戏或运动语境），标准写法通常也是“mid”。","如果你能告诉我你看到“midd”的句子或上下文（例如一整句话、聊天内容或文章片段），我可以更准确判断它到底指什么。"]}
{"word":"midday","summary":{"en":"Midday means the middle of the day—around noon—and it can be used as a noun or an adjective.","zh":"Midday表示“一天的中间时段”，大约在中午前后；既可作名词也可作形容词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle of the day; around noon","zh":"正午；中午时分（一天的中间时段）"},"examples":[{"en":"We usually have lunch around midday.","zh":"我们通常在中午左右吃午饭。"},{"en":"By midday, the streets were crowded.","zh":"到中午时，街道已经很拥挤了。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or existing around noon","zh":"中午的；正午前后的"},"examples":[{"en":"The midday sun can be very strong in summer.","zh":"夏天的正午阳光可能很强烈。"},{"en":"She took a midday break to rest her eyes.","zh":"她在中午休息了一下，让眼睛放松。"}]}],"synonyms":["noon","noontime","midday hours"],"phonetic":"/ˌmɪdˈdeɪ/","extraExplanation":["“midday”比“noon”语气更宽一些：noon更像“12点整”，而midday常指“中午这一段时间”（大约11点到1点，视语境而定）。","常见搭配：midday meal（午餐）、midday sun（正午的太阳）、at/by/around midday（在/到/大约中午）。"]}
{"word":"middays","summary":{"en":"“Midday” means the middle of the day, around noon.","zh":"“Midday”指一天的中间时段，即中午、正午前后。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of the day; around noon (about 12 p.m.)","zh":"中午；正午前后（大约12点左右）"},"examples":[{"en":"Let’s meet at midday for lunch.","zh":"我们中午一起吃午饭吧。"},{"en":"The sun is strongest around midday.","zh":"太阳在中午前后最强烈。"}]}],"synonyms":["noon","noontime","midday time"],"phonetic":"/ˈmɪdˌdeɪ/","extraExplanation":["“middays”是“midday”的复数形式，表示“好几个中午”或“在不同日子的中午”。更常见的单数拼写是“midday”。如果你想表达“在中午”，英语里常说“at midday”或“at noon”。"]}
{"word":"midde","summary":{"en":"Middle means the center part of something, or something that is in the center.","zh":"Middle 表示“中间/中央”，也可形容“位于中间的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central part or point of something; the area equally distant from the ends or edges","zh":"中间；中央；中心位置"},"examples":[{"en":"Please sit in the middle so everyone can see the screen.","zh":"请坐在中间，这样大家都能看到屏幕。"},{"en":"The café is right in the middle of town.","zh":"那家咖啡馆就在镇中心。"}]},{"partOfSpeech":"adj.","definition":{"en":"being in the center; not at either end","zh":"中间的；中部的；居中的"},"examples":[{"en":"Take the middle road if you want to avoid traffic.","zh":"如果你想避开堵车，就走中间那条路。"},{"en":"She is the middle child in her family.","zh":"她是家里的老二（中间的孩子）。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put or arrange something in the center (rare in everyday English)","zh":"把……放在中间；使居中（较少见）"},"examples":[{"en":"Middle the title on the page.","zh":"把标题放在页面正中间。"}]}],"synonyms":["center","midpoint","middle part","central"],"phonetic":"/ˈmɪdəl/","extraExplanation":["你输入的“midde”很可能是拼写错误，常见正确拼写是 **middle**（少一个 l、少一个 e）。如果你其实想查的是别的词（如 **midden**=垃圾堆/粪堆），告诉我语境我可以再确认。"]}
{"word":"middel","summary":{"en":"Middle means the center part or a position equally far from both ends; it can be a noun or an adjective.","zh":"middle 指“中间/中央”，可作名词或形容词，表示离两端等距的位置或部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the part that is equally far from the beginning and the end; the center area","zh":"中间部分；中央区域"},"examples":[{"en":"Please sit in the middle of the row.","zh":"请坐在这一排的中间。"},{"en":"The middle of the movie was a little slow.","zh":"电影的中段有点拖沓。"}]},{"partOfSpeech":"adj.","definition":{"en":"located at an equal distance from two sides or ends; central","zh":"中间的；中央的"},"examples":[{"en":"We live in the middle part of town.","zh":"我们住在城镇的中部。"},{"en":"She is the middle child in her family.","zh":"她是家里的老二（中间那个孩子）。"}]},{"partOfSpeech":"v.","definition":{"en":"to be in the middle; to form the middle part of something (less common)","zh":"位于中间；构成……的中间部分（较少用）"},"examples":[{"en":"A narrow river middles the valley.","zh":"一条狭窄的河流穿过山谷的中央。"}]}],"synonyms":["center","midpoint","middle part","central"],"phonetic":"/ˈmɪdəl/","extraExplanation":["你输入的“middel”通常不是标准英文拼写。最常见的正确拼写是“middle”（中间）。另一个容易混淆的词是“meddle”（/ˈmɛdəl/，意为“插手、干预”），含义不同。可以告诉我你想表达“中间”还是“插手”，我也可以帮你区分用法。"]}
{"word":"midden","summary":{"en":"A midden is a trash heap—often an ancient refuse pile studied by archaeologists (like a shell midden); it can also mean a manure/compost heap.","zh":"midden 指垃圾堆，常指考古中的古代废弃物堆（如贝冢）；也可指粪堆/堆肥堆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pile or area of old household waste (especially food scraps, shells, bones, etc.), often found at an archaeological site and used to learn about past daily life.","zh":"（尤指考古遗址中的）垃圾堆／贝冢：由食物残渣、贝壳、骨头等生活废弃物长期堆积而成，可用来研究古人日常生活。"},"examples":[{"en":"Archaeologists studied a shell midden to learn what people ate thousands of years ago.","zh":"考古学家研究一处贝冢，以了解数千年前人们吃什么。"},{"en":"The site included a midden filled with animal bones and broken pottery.","zh":"该遗址包含一处垃圾堆，里面有动物骨头和破碎的陶器。"}]},{"partOfSpeech":"n.","definition":{"en":"A heap of manure or compost; a dunghill.","zh":"（粪肥或堆肥的）堆；粪堆。"},"examples":[{"en":"They added straw to the midden to help it break down into compost.","zh":"他们往粪堆里加稻草，帮助分解成堆肥。"}]}],"synonyms":["refuse heap","trash heap","dump","dunghill","compost heap"],"phonetic":"/ˈmɪdən/","extraExplanation":["“midden”常见于考古与人类学语境，尤其是“shell midden”（贝冢）。通过其中的贝壳、骨头、炭屑、陶片等，研究者能推测当时的饮食结构、季节性活动、居住方式甚至环境变化。","词源来自古北欧语，意思与“粪堆/垃圾堆”有关；在现代英语里日常口语较少用，更偏学术或历史描写。"]}
{"word":"middens","summary":{"en":"Middens are piles of waste, especially ancient trash heaps studied by archaeologists.","zh":"middens 指废弃物堆，尤指考古学中研究的古代垃圾堆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Heaps or piles of waste (such as kitchen scraps, shells, bones, ash, or broken tools), especially those left by people in the past and studied by archaeologists.","zh":"垃圾堆；（尤指）古人留下、供考古学研究的废弃物堆（如厨余、贝壳、骨头、灰烬或破损工具等）。"},"examples":[{"en":"Archaeologists excavated shell middens to learn what people ate thousands of years ago.","zh":"考古学家发掘贝壳堆积（shell middens），以了解数千年前人们吃什么。"},{"en":"The site has several middens filled with animal bones and charcoal.","zh":"该遗址有好几处垃圾堆，里面有动物骨骼和木炭。"}]},{"partOfSpeech":"n.","definition":{"en":"Spots where everyday trash is dumped; refuse heaps (less formal, everyday use).","zh":"垃圾倾倒处；垃圾堆（较口语/日常用法）。"},"examples":[{"en":"Please keep the area clean—don’t leave food waste near the middens.","zh":"请保持环境清洁——不要把食物残渣丢在垃圾堆附近。"},{"en":"Rats gathered around the midden behind the old building.","zh":"老楼后面的垃圾堆周围聚集了老鼠。"}]}],"synonyms":["refuse heaps","trash heaps","dumps","debris piles"],"phonetic":"/ˈmɪdənz/","extraExplanation":["“middens”是“midden”的复数。这个词在考古学里非常常见，因为“垃圾”往往能保留日常生活的证据（吃什么、用什么工具、季节性活动等）。","常见搭配：shell midden（贝丘/贝冢，堆满贝壳的遗址）、kitchen midden（厨房垃圾堆/生活垃圾堆）、midden heap（垃圾堆）。"]}
{"word":"middenstead","summary":{"en":"Middenstead is a very rare, archaic word meaning “the middle/center; the midst.”","zh":"middenstead 是一个非常少见的古语，意思是“中间/中心；当中”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare/archaic) the middle place or central position; the midst.","zh":"（非常少见/古语）中间的位置；中心；当中。"},"examples":[{"en":"They gathered in the middenstead of the hall to hear the announcement.","zh":"他们聚在大厅的当中来听通知。"},{"en":"In the middenstead of the story, the tone shifts from calm to tense.","zh":"在故事的中段，语气从平静转为紧张。"}]}],"synonyms":["the middle","the center","the midst","midst"],"phonetic":"/ˈmɪdənˌstɛd/","extraExplanation":["这个词在现代英语里几乎不用，很多读者会觉得陌生。它看起来像由 midden（中间/当中；也可指“粪堆、垃圾堆”，但那是另一个常见义）+ stead（地方、位置，如 homestead）组合而成，因此整体可理解为“中间的位置”。","如果你是在手稿、家谱、地名或旧诗歌里见到 middenstead，它也可能是方言拼写或印刷/转写误差。常见的现代替代表达有: the middle, the center, the midst, in the middle of."]}
{"word":"middes","summary":{"en":"“Middes” isn’t standard English; it’s usually a typo for “middles” or “mids.”","zh":"“middes”不是标准英语词，通常是把“middles”或“mids”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or typo for “middles” (plural of middle) or “mids” (short for midterms/mid-).","zh":"不是标准英语词；多见于拼写错误，通常想写的是“middles”（middle 的复数）或“mids”（mid- 的缩写，如 midterms）。"},"examples":[{"en":"I think you meant “middles,” as in: “The middles of the books are slow.”","zh":"我猜你想写的是“middles”，例如：“那些书的中段节奏很慢。”"},{"en":"In school slang, “mids” can mean midterms: “I have mids next week.”","zh":"在校园口语里，“mids”可以指期中考试：“我下周要考期中（mids）。”"}]}],"synonyms":["middles","mids","middle","mid-"],"phonetic":"/mɪdz/","extraExplanation":["“middes”本身在常用词典中一般查不到；如果你是从文章、字幕或作业里看到的，可能是打字错误或OCR识别错误。你可以告诉我它出现的完整句子（前后各3–5个词），我就能更准确判断你想查的是哪个词（比如 middle / midst / mids / middies 等）。"]}
{"word":"middest","summary":{"en":"Middest is an archaic form meaning “the middle” or “in the middle of,” used mainly in literary or old-fashioned writing.","zh":"Middest 是古语形式，意思是“中间/在……中间”，主要用于文学或仿古写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) located in the middle of; surrounded by.","zh":"（古语/文学用语）在……中间的；被……包围的。"},"examples":[{"en":"In the middest of the crowd, she felt strangely alone.","zh":"在人群正中间，她却感到格外孤独。"},{"en":"He stood in the middest of the room and spoke calmly.","zh":"他站在房间中央，平静地说话。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) the middle part or center (often used after “in the”).","zh":"（古语）中间部分；中央（常与 in the 连用）。"},"examples":[{"en":"They met in the middest, between the two villages.","zh":"他们在两座村庄之间的中间地带会面。"},{"en":"A small fire burned in the middest of the camp.","zh":"营地中央燃着一小堆火。"}]}],"synonyms":["middle","center","midst","in the middle of","in the midst of"],"phonetic":"/ˈmɪdɪst/","extraExplanation":["“middest”是“middle”的古老形式，现代英语中很少在日常场合使用，多见于《圣经》（如 KJV 风格）、古典文学、戏剧或带古风效果的写作。","现代更自然的说法通常是：in the middle of… / in the midst of…（“in the midst of”也比“middest”更常见，语气偏正式或文学）。"]}
{"word":"middies","summary":{"en":"“Middies” is an informal plural meaning either mid-strength beers (especially in Australia/NZ), mediocre cannabis (“mids”), or midfield players in sports—context tells you which.","zh":"“middies”是口语复数，可指（尤指澳新）中度酒精啤酒、一般档的大麻（mids），或体育里的中场球员；具体含义看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Australian/New Zealand) mid-strength beers; beers with a lower alcohol content than regular beer.","zh":"（非正式，主要用于澳大利亚/新西兰）中度酒精啤酒；酒精度比普通啤酒低的啤酒。"},"examples":[{"en":"Let’s grab some middies so we can keep going all afternoon.","zh":"我们买点中度啤酒吧，这样下午还能继续聚。"},{"en":"He switched to middies because he was driving later.","zh":"他后来改喝中度啤酒，因为等会儿要开车。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) mediocre cannabis; marijuana of medium/low quality (short for “mids”).","zh":"（俚语）一般/中等偏差的大麻；质量不高不坏的“中档货”（“mids”的口语说法）。"},"examples":[{"en":"It’s not top-shelf—just middies, but it’ll do.","zh":"这不是顶级货——就一般的中档货，但也凑合。"},{"en":"They were complaining that the dispensary only had middies left.","zh":"他们在抱怨那家店只剩一般货了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sports) midfield players; people who play in the middle of the field.","zh":"（非正式，体育）中场球员；在场地中间位置踢球/比赛的人。"},"examples":[{"en":"Our middies need to track back more on defense.","zh":"我们的中场需要在防守时更多回撤。"},{"en":"The coach praised the middies for controlling the tempo.","zh":"教练表扬中场把比赛节奏控得很好。"}]}],"synonyms":["mid-strength beers","mids","midfielders"],"phonetic":"/ˈmɪdiz/","extraExplanation":["“middies”是非常口语的复数形式，意思取决于地区与语境。澳新最常见的是指“中度酒精啤酒”；在北美俚语里也可能指“大麻中等货（mids）”。","发音和拼写上，它来自“mid-（中间/中等）+ -ies（口语复数）”。在正式写作中通常避免使用。"]}
{"word":"middle","summary":{"en":"Middle means the central part or a position between two ends; it can also describe something that is not at either extreme.","zh":"Middle 指“中间、中央”或“介于两端之间的位置/程度”，也可作形容词表示“不偏不倚、在中间的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central part of something; a point or area that is equally far from the edges","zh":"中间；中央部分（离边缘等距的位置或区域）"},"examples":[{"en":"Put the vase in the middle of the table.","zh":"把花瓶放在桌子中间。"},{"en":"We stopped in the middle of the road to look at the map.","zh":"我们在路中间停下来查看地图。"}]},{"partOfSpeech":"adj.","definition":{"en":"neither at the beginning nor at the end; between two extremes","zh":"中间的；中部的；（程度上）不偏不倚的、介于两端之间的"},"examples":[{"en":"She is in her middle thirties.","zh":"她三十多岁（约三十五岁左右）。"},{"en":"Choose the middle option if you’re not sure.","zh":"如果你不确定，就选中间那个选项。"}]},{"partOfSpeech":"v.","definition":{"en":"to place or be positioned in the center; to take up a middle position","zh":"使位于中间；处在中间位置"},"examples":[{"en":"A large window is centered in the middle of the wall.","zh":"墙的正中间有一扇大窗户。"}]}],"synonyms":["center","midpoint","central part","between","intermediate"],"phonetic":"/ˈmɪdəl/","extraExplanation":["“in the middle of …”常有两种用法：①表示地点/时间上的“在……中间”（如 in the middle of the room / in the middle of the day）；②表示“正在……过程中”（如 I was in the middle of dinner. 我正吃到一半/正在吃饭）。","“middle”与“center”很像，但“middle”更强调“两端之间的那一段/那一部分”（beginning–middle–end），而“center”更强调“中心点/中心位置”。"]}
{"word":"middle name","summary":{"en":"A middle name is an extra given name placed between your first name and your last name.","zh":"middle name 指夹在名和姓之间的额外名字（中间名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a second given name (or one of the given names) that comes between a person’s first name and last name","zh":"（夹在名和姓之间的）中间名；第二个名字"},"examples":[{"en":"My first name is Maya, my middle name is Lee, and my last name is Chen.","zh":"我的名是 Maya，中间名是 Lee，姓是 Chen。"},{"en":"Do I have to write my middle name on this form?","zh":"这张表格我必须填写中间名吗？"},{"en":"His middle name is the same as his grandfather’s name.","zh":"他的中间名和他爷爷的名字一样。"}]}],"synonyms":["second given name","middle initial (when abbreviated)"],"phonetic":"/ˈmɪdəl neɪm/","extraExplanation":["在美国等英语国家，中间名很常见，但不是每个人都有。它常用于纪念亲友、延续家族传统，或作为父母喜欢的另一个名字。","正式文件上常见的写法包括：全写（middle name）或只写首字母（middle initial），例如：John F. Kennedy。","有些国家/文化的姓名结构不同：比如中文一般没有“middle name”的固定位置；西班牙语文化中常见双姓（父姓+母姓），概念也与“middle name”不完全相同。"]}
{"word":"middle school","summary":{"en":"Middle school is the school stage between elementary and high school, often grades 6–8 in the U.S.","zh":"Middle school指小学与高中之间的学校/教育阶段，在美国常为6—8年级。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a school for students in the years between elementary school and high school (often grades 6–8 in the U.S.)","zh":"（美国常指）介于小学与高中之间的学校阶段，通常是6—8年级"},"examples":[{"en":"My sister starts middle school next year.","zh":"我妹妹明年开始上初中（美国的middle school）。"},{"en":"In many U.S. towns, middle school includes grades 6 through 8.","zh":"在许多美国城镇，middle school通常包含6到8年级。"}]},{"partOfSpeech":"n.","definition":{"en":"the educational stage between elementary school and high school","zh":"小学与高中之间的教育阶段（初中阶段）"},"examples":[{"en":"Middle school can be a big change because students have different teachers for each subject.","zh":"初中阶段可能变化很大，因为学生每门课会有不同的老师。"}]}],"synonyms":["junior high (school)","intermediate school"],"phonetic":"/ˈmɪdəl skuːl/","extraExplanation":["在美国，“middle school”和“junior high school”有时都译作“初中”，但不完全等同：middle school更常见，通常是6–8年级；junior high在一些地区可能是7–9年级。","在英国等地区更常用“secondary school”（中学）来覆盖更长的阶段，所以翻译时最好结合国家和年级来理解。"]}
{"word":"middlebreaker","summary":{"en":"“Middlebreaker” is an uncommon compound noun meaning something that breaks in the middle or (figuratively) breaks a stalemate.","zh":"“middlebreaker”是不太常见的复合名词，可指把东西从中间弄断的人/物，也可比喻为打破僵局的关键因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that breaks something in the middle; a device or force that causes a split at the center.","zh":"把东西从中间弄断的人或物；使物体在中部断裂的装置或力量。"},"examples":[{"en":"The packaging was so weak that the bottle became a middlebreaker during shipping.","zh":"包装太薄弱，瓶子在运输中成了“从中间断裂”的受害者。"},{"en":"In the lab, they tested which material acted as a middlebreaker under pressure.","zh":"在实验室里，他们测试哪种材料在压力下会导致“中间断裂”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, informal) Something that breaks a stalemate or divides a group in the middle, forcing a decision or change.","zh":"（比喻，非正式）打破僵局的关键因素；把群体“从中间劈开”、迫使做决定的事物。"},"examples":[{"en":"The new evidence was a middlebreaker that ended weeks of debate.","zh":"新证据成了“破局点”，结束了数周的争论。"},{"en":"In the meeting, her question was the middlebreaker that shifted everyone’s opinion.","zh":"在会议上，她的问题成了“转折点”，让大家的看法发生了变化。"}]}],"synonyms":["breaker","splitter","deal-breaker","tie-breaker","turning point","game-changer"],"phonetic":"/ˈmɪdəlˌbreɪkər/","extraExplanation":["“middlebreaker”不是常见的标准英语词，更像是临时造词（compound coinage）：middle + breaker。读者通常能猜到大意，但在正式写作中不太推荐。","如果你想表达“打破僵局的关键点”，更自然的说法有：deal-breaker（决定成败的因素）、tie-breaker（决胜因素）、game-changer（改变局势的因素）、turning point（转折点）。","如果你是在某个特定领域（如运动、游戏、工程）看到它，欢迎告诉我上下文句子，我可以给出更准确的含义与更地道的替代表达。"]}
{"word":"middlebrow","summary":{"en":"“Middlebrow” describes culture that is popular and easy to enjoy but seen as not very deep; it can also mean a person with mainstream tastes.","zh":"“middlebrow”指介于高雅与通俗之间、好懂但被认为不够深刻的文化作品；也可指品味偏主流、较传统的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of art, books, movies, music, etc.) popular and fairly easy to understand, but not considered very original or intellectually deep; between “highbrow” and “lowbrow.”","zh":"（指艺术、书籍、电影、音乐等）大众化、较易理解，但通常被认为不够原创或思想深度不足；介于“高雅/高智”（highbrow）与“通俗/低俗”（lowbrow）之间。"},"examples":[{"en":"Some critics dismissed the novel as middlebrow entertainment.","zh":"一些评论家把这本小说贬为“中等品味”的消遣读物。"},{"en":"The film is middlebrow: accessible and emotional, but not very challenging.","zh":"这部电影算是中等品味：好懂、煽情，但不太有挑战性。"},{"en":"She enjoys middlebrow historical dramas on TV.","zh":"她喜欢看电视上的中等品味历史剧。"}]},{"partOfSpeech":"n.","definition":{"en":"A person with conventional, moderate tastes, especially in culture or the arts.","zh":"（尤指文化艺术方面）品味较传统、偏大众且不极端的人；“中间品味的人”。"},"examples":[{"en":"He called himself a middlebrow who just wants a good story.","zh":"他自称是个中间品味的人，只想看个好故事。"},{"en":"The magazine targets middlebrows interested in books and travel.","zh":"这本杂志面向对书籍和旅行感兴趣的中间品味读者。"}]}],"synonyms":["mainstream","accessible","conventional","popular"],"phonetic":"/ˈmɪdəlˌbraʊ/","extraExplanation":["“middlebrow”常带一点贬义或轻微的嘲讽，暗示作品“体面但不够深”。不过在很多语境里也可较中性，用来描述“面向大众、质量不错、但不走前卫路线”的文化产品。","相关词：highbrow（高雅/学术取向）、lowbrow（通俗甚至粗俗取向）、accessible（易懂的）、mainstream（主流的）、pretentious（装腔作势的，常用来批评某些“高大上但空洞”的作品）。"]}
{"word":"middlebrowism","summary":{"en":"Middlebrowism is a middle-of-the-road cultural taste that aims to seem intelligent and refined, often viewed as safe or conventional.","zh":"middlebrowism 指介于高雅与通俗之间、追求“显得有文化”的中等审美取向，常被认为偏安全、保守。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The taste, attitude, or style of being “middlebrow”: aiming to seem cultured and intelligent but in a safe, conventional, widely acceptable way (between highbrow and lowbrow).","zh":"“中产式品味/中等文化品味”的倾向或风格：想显得有文化、有格调，但通常选择安全、传统、容易被大众接受的方式（介于高雅与通俗之间）。"},"examples":[{"en":"Some critics call the movie’s message-heavy plot a kind of middlebrowism.","zh":"一些评论家把这部电影说教式的剧情称为一种“中等文化品味”的表现。"},{"en":"She enjoys serious topics, but she prefers middlebrowism over experimental art.","zh":"她喜欢严肃话题，但比起实验艺术更偏好“中产式的稳妥审美”。"}]}],"synonyms":["middlebrow taste","middlebrow culture","mainstream sophistication"],"phonetic":"/ˈmɪdəlˌbraʊˌɪzəm/","extraExplanation":["middlebrowism常带一点批评或讽刺意味：不是说“没有价值”，而是暗示它“看起来很高级，但不够大胆/不够深/不够原创”。","词根提示：highbrow（高雅、精英文化）+ lowbrow（通俗、大众文化）→ middlebrow（介于两者之间）。加上 -ism 表示一种“倾向/主义/风格”。","常见搭配与相关词：middlebrow novel（偏主流、可读性强的“严肃小说”）、middlebrow taste（中等文化品味）、middlebrow culture（中等文化消费）。对比词：highbrow, lowbrow, pretentious（装腔作势的）。"]}
{"word":"middlebrows","summary":{"en":"Middlebrow describes mainstream, moderately serious culture (and the people who like it), between popular entertainment and highbrow art.","zh":"middlebrow 指介于通俗娱乐与高雅艺术之间的“中间品味”（以及喜欢这类文化的人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of art, books, music, etc.) aimed at average, mainstream tastes—more serious than popular entertainment but not very experimental or intellectually demanding.","zh":"（文学、艺术、音乐等）“中间品味的”；面向主流大众、比通俗娱乐更“有文化”但不太前卫或不算很高深的。"},"examples":[{"en":"The novel is smart and readable, but some critics call it middlebrow.","zh":"这本小说既聪明又好读，但一些评论家称它为“中间品味”（middlebrow）。"},{"en":"She prefers middlebrow films—thoughtful stories without too much art-house style.","zh":"她更喜欢中间品味的电影——故事有深度，但不会太艺术片风格。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who likes middlebrow culture; a member of the mainstream educated audience.","zh":"喜欢“中间品味”文化的人；受过教育的主流观众/读者。"},"examples":[{"en":"The magazine was designed for middlebrows who wanted culture that felt accessible.","zh":"这本杂志面向“中间品味”读者——想要更有文化、但又容易理解的内容的人。"}]}],"synonyms":["mainstream","moderately serious","accessible","not too highbrow"],"phonetic":"/ˈmɪdəlˌbraʊ/","extraExplanation":["“middlebrow”常带一点评论色彩：说它“有品味但不够高雅/不够前卫”。它通常介于“lowbrow（通俗、偏大众娱乐）”和“highbrow（高雅、学术/艺术性强）”之间。","复数形式是 middlebrows。你输入的“middlebrows”多半指“这些中间品味的人/读者群体”。"]}
{"word":"middlebuster","summary":{"en":"“Middlebuster” is an informal American-football term for a run straight up the middle; it can also mean someone who breaks through the middle of a defense or group.","zh":"“middlebuster”是美式橄榄球里的非正式说法，指从中路直插的冲跑战术；也可引申指能从中路突破防线或人群的人/事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(American football, informal) A running play that goes straight up the middle of the offensive line to gain yards.","zh":"（美式橄榄球，非正式）一种冲跑战术：持球者从进攻线的中路直插推进争取码数。"},"examples":[{"en":"On third-and-short, the coach called a middlebuster to pick up the first down.","zh":"在第三挡短码数时，教练叫了一个“中路强攻”来拿到新的首攻。"},{"en":"Their middlebuster worked because the center and guards got a strong push.","zh":"他们的“中路强攻”之所以奏效，是因为中锋和护锋顶出了很强的推进。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, by extension) A person or thing that breaks through the middle of a group or defense.","zh":"（非正式，引申）能从人群或防线中路强行突破的人或事物。"},"examples":[{"en":"The fullback was a real middlebuster, always falling forward for extra yards.","zh":"这个全卫真是个“中路破阵者”，总能多顶出几码。"},{"en":"In the debate, she became the middlebuster who challenged the group’s comfortable assumptions.","zh":"在辩论中，她成了那个“从中路突破”的人，直接挑战大家习以为常的假设。"}]}],"synonyms":["inside run","dive (run)","up-the-middle run","power run (inside)"],"phonetic":"/ˈmɪdəlˌbʌstɚ/","extraExplanation":["这是美式橄榄球里的口语/俚语式复合词：middle（中间）+ buster（“打破者/破开者”，来自动词 bust，口语里有“打破、冲破”的意思）。常见于战术解说或球迷讨论中，不算正式术语。","在不同球队/地区，这个说法可能和“dive（中路冲刺）”“inside run（内侧跑动）”“A-gap/B-gap run（A/B缺口冲跑）”等更具体的叫法互相替换。"]}
{"word":"middleclass","summary":{"en":"Middle class refers to a social group between working and upper classes, and it can also describe a typical, comfortable, conventional lifestyle.","zh":"middle class 指介于工人阶级与上层阶级之间的社会群体，也可形容典型的中产生活方式（较舒适、传统、重视稳定）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the social group between the working class and the upper class, often including people with stable jobs, moderate income, and some education","zh":"中产阶级：介于工人阶级与上层阶级之间的社会群体，通常拥有较稳定的工作、适中的收入和一定教育水平"},"examples":[{"en":"Many middle-class families save money for college and retirement.","zh":"许多中产阶级家庭会为大学学费和退休存钱。"},{"en":"The neighborhood used to be mostly middle-class, but housing prices have risen a lot.","zh":"这个社区过去主要是中产阶级，但房价上涨了很多。"}]},{"partOfSpeech":"adj.","definition":{"en":"typical of the middle class; comfortable, conventional, and focused on economic security","zh":"中产阶级的；（常带语气）生活舒适而传统、重视经济稳定的"},"examples":[{"en":"They have a middle-class lifestyle: a small house, a car, and regular vacations.","zh":"他们过着典型的中产阶级生活：小房子、一辆车、定期度假。"},{"en":"Some writers criticize “middle-class values” as too cautious and conventional.","zh":"一些作家批评“中产阶级价值观”过于谨慎和保守。"}]}],"synonyms":["the bourgeoisie","white-collar (often related)","mainstream (context-dependent)"],"phonetic":"/ˌmɪdəl ˈklæs/","extraExplanation":["拼写提示：更常见的写法是 middle class（分开写）；作形容词时常用 middle-class（加连字符），如 middle-class family。","文化语境：不同国家对“中产阶级”的定义会随收入、职业、教育、资产（尤其是住房）等标准而变化，因此它既是经济概念，也常被用来讨论生活方式与社会价值观。"]}
{"word":"middled","summary":{"en":"“Middled” is an uncommon form meaning “placed in the middle,” and it can also be the past tense of the rare verb “to middle.”","zh":"“middled”较少见，常表示“被放在中间/居中”，也可作不常用动词“middle”的过去式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Placed in the middle; put in a central position.","zh":"（不常用）被放在中间的；置于中央位置的。"},"examples":[{"en":"The teacher middled the shy student between two friendly classmates.","zh":"老师把那位害羞的学生安排在两位友善的同学中间。"},{"en":"The photo was middled on the page to make it stand out.","zh":"照片被放在页面正中，以突出显示。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “middle”: to put or position something in the middle (rare in everyday English).","zh":"“middle”的过去式/过去分词：把某物放到中间（日常英语中较少用）。"},"examples":[{"en":"They middled the vase on the table as a centerpiece.","zh":"他们把花瓶放在桌子中央当作摆设中心。"},{"en":"The editor middled the headline for a balanced look.","zh":"编辑把标题居中排版，让版面更均衡。"}]}],"synonyms":["centered","placed in the middle","positioned centrally","centred"],"phonetic":"/ˈmɪdəld/","extraExplanation":["“middled”在现代英语里不太常见。表达“把……放在中间/居中”更自然的说法通常是：**put … in the middle**, **place … in the center**, **center (vt.)**（如：*Center the text.* 把文字居中）。","如果你想表达“中间的”，更常用 **middle**（如：*the middle seat* 中间座位；*middle school* 初中）。","拼写提醒：如果你本来想查的是 **middle**（不是“middled”），告诉我你的例句或语境，我可以按你要的词义详细解释。"]}
{"word":"middlehand","summary":{"en":"Middlehand is an uncommon noun meaning either an intermediary (like a middleman) or, in some card games, the second player to act.","zh":"middlehand 是不太常见的名词，可指“中间人”，也可指某些纸牌游戏中“第二个行动/出牌的玩家（中手）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intermediary; a person who passes messages or goods between two sides (an older or less common word for “middleman”).","zh":"中间人；居间转手或传话的人（较旧或不常用的说法，类似 middleman）。"},"examples":[{"en":"They used a middlehand to negotiate the deal.","zh":"他们找了一个中间人来谈成这笔交易。"},{"en":"In old documents, a “middlehand” might be someone who arranged trade between buyers and sellers.","zh":"在一些旧文献里，“middlehand”可能指撮合买卖双方交易的人。"}]},{"partOfSpeech":"n.","definition":{"en":"In some card games, the player who acts/plays second—between the first player (forehand) and the third (rearhand).","zh":"（某些纸牌游戏中）第二手/中手：出牌或行动顺序排第二的玩家（介于先手与后手之间）。"},"examples":[{"en":"As middlehand, you should watch what forehand leads before choosing your play.","zh":"作为中手，你要先看先手出什么，再决定怎么出。"},{"en":"Middlehand often has partial information, so careful observation matters.","zh":"中手往往信息不全，所以观察很重要。"}]}],"synonyms":["middleman","intermediary","go-between","broker","second player"],"phonetic":"/ˈmɪdəlˌhænd/","extraExplanation":["“middlehand”在现代英语里很少见，更常见的说法是 middleman（中间人）或 intermediary（中介）。","纸牌术语里的 forehand / middlehand / rearhand（先手/中手/后手）在一些欧洲传统牌戏或较旧的规则说明中更常见；日常英语里一般会直接说 first/second/third player。"]}
{"word":"middleland","summary":{"en":"“Middleland” is a rare, creative noun meaning an in-between place or state.","zh":"“middleland”是较少见的创意名词，指“介于两者之间的地带或状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an in-between place or region (not a common standard word; often used creatively to mean a space between two areas, states, or situations)","zh":"中间地带；介于两者之间的地区（不是常见的标准词，常带有文学/创意用法）"},"examples":[{"en":"The story is set in a middleland between dreams and reality.","zh":"故事发生在一个介于梦境与现实之间的“中间地带”。"},{"en":"After graduating, she felt stuck in a middleland—not a student anymore, but not settled into work yet.","zh":"毕业后，她感觉自己卡在一个“中间状态”：不再是学生，但也还没真正进入工作生活。"}]}],"synonyms":["in-between","borderland","limbo","middle ground"],"phonetic":"/ˈmɪdəlˌlænd/","extraExplanation":["“middleland”在英语里并不常见，很多时候是作者/说话者临时创造的词，用来强调“夹在中间、暧昧不清、过渡地带”的感觉。","如果你想表达真实存在的地区，更常见的是：the Midlands（英格兰中部地区）或 midland（中部地区）。","如果你要表达“折中立场/中间路线”，更地道的说法是：middle ground（折中、妥协的空间）或 in-between（介于两者之间的状态）。"]}
{"word":"middleman","summary":{"en":"A middleman is an intermediary who connects two sides—often in business deals—or relays messages between people.","zh":"middleman 指“中间人/中介”，在两方之间牵线交易或传递信息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that acts between two sides (such as a buyer and a seller) to help make a deal, often taking a fee or commission.","zh":"中间人；中介（在买卖双方等两方之间撮合交易，通常收取费用或佣金）。"},"examples":[{"en":"We bought the tickets directly online so we didn’t need a middleman.","zh":"我们直接在网上买票，所以不需要中间人。"},{"en":"The farmer earns more when he sells without a middleman.","zh":"农民不通过中间人出售时，赚得更多。"},{"en":"She worked as a middleman connecting small factories with overseas buyers.","zh":"她做中间人，把小工厂和海外买家联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who passes messages, negotiates, or manages contact between people who do not communicate directly.","zh":"传话人；调停者（在不直接沟通的人之间传递信息或进行协商）。"},"examples":[{"en":"I don’t want a middleman—please talk to me directly.","zh":"我不想要传话人——请直接跟我谈。"},{"en":"During the dispute, a trusted middleman helped both sides reach an agreement.","zh":"在争端期间，一位可信的调停者帮助双方达成了协议。"}]}],"synonyms":["intermediary","broker","go-between","agent","mediator"],"phonetic":"/ˈmɪdəlˌmæn/","extraExplanation":["middleman 常带有“增加成本/抽成”的语感，尤其在商业语境里（例如 cut out the middleman 表示“跳过中间商，直接交易”）。但在谈判、外交或冲突调解中，它也可以是中性甚至积极的角色（类似 mediator 调解人）。","相关常见表达：cut out the middleman（去掉中间环节）、go through a middleman（通过中间人）、middleman markup（中间商加价）。"]}
{"word":"middlemanism","summary":{"en":"Middlemanism means a system or practice where intermediaries (middlemen) stand between buyer and seller, often criticized for adding cost or taking profit.","zh":"middlemanism 指买卖双方之间依赖中间商的制度或做法，常带批评意味，强调增加成本或被抽取利润。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or system of using middlemen (intermediaries) in business or trade, especially when they take a share of profit without adding much value","zh":"“中间人制”；在商业或贸易中依赖中间商（中介）的做法或体系，尤指中间商拿走利润但增值不明显的情况"},"examples":[{"en":"The farmers complained that middlemanism kept food prices high while their income stayed low.","zh":"农民抱怨“中间人制”让食品价格居高不下，而他们的收入却很低。"},{"en":"The company tried to reduce middlemanism by selling directly to customers online.","zh":"这家公司试图通过线上直销给顾客来减少中间人环节。"}]},{"partOfSpeech":"n.","definition":{"en":"(more broadly) dependence on intermediaries in arranging deals, information, or services","zh":"（更广义）在促成交易、传递信息或提供服务时对中介/掮客的依赖"},"examples":[{"en":"In some industries, middlemanism can slow communication between producers and buyers.","zh":"在一些行业里，中间人过多会拖慢生产者与买家之间的沟通。"},{"en":"The reform aimed to cut middlemanism in public procurement.","zh":"这项改革旨在减少政府采购中的中间环节。"}]}],"synonyms":["intermediation","brokerage","middlemanship","go-between system","dealing through intermediaries"],"phonetic":"/ˈmɪdəlˌmænɪzəm/","extraExplanation":["“middlemanism”常带有批评色彩：说话者往往认为中间商“抽成/赚差价”过多，或在供应链中增加成本与不透明度。","在经济与社会评论中，它常与“direct-to-consumer（直达消费者）”“disintermediation（去中介化）”等概念对比出现。"]}
{"word":"middlemanship","summary":{"en":"Middlemanship means acting as a middleman or the costs/profits of intermediaries in trade.","zh":"middlemanship 指充当中间商的居间行为，或中间商在交易中收取的费用/赚取的差价。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The role or practice of acting as an intermediary (a “middleman”) between a buyer and a seller, often arranging deals or transactions.","zh":"居间（中间人）行为；充当买卖双方之间的中介、牵线搭桥以促成交易的做法。"},"examples":[{"en":"The company eliminated middlemanship by selling directly to customers online.","zh":"这家公司通过线上直销消除了中间商环节。"},{"en":"Some farmers rely on middlemanship to reach distant markets.","zh":"一些农民依靠中间商把产品卖到更远的市场。"}]},{"partOfSpeech":"n.","definition":{"en":"The fees, commissions, or profits earned by intermediaries for arranging transactions.","zh":"中间商赚取的费用/佣金/差价（居间收益）。"},"examples":[{"en":"The reform aimed to reduce middlemanship in the supply chain so prices would fall.","zh":"这项改革旨在减少供应链中的中间商差价，从而让价格下降。"},{"en":"Consumers complained that too much middlemanship was added to the final cost.","zh":"消费者抱怨最终成本里加了太多中间商的费用。"}]}],"synonyms":["intermediation","brokerage","middleman activity","go-between role"],"phonetic":"/ˈmɪdəlˌmænʃɪp/","extraExplanation":["“middlemanship”来自“middleman（中间商）+ -ship（表示身份/状态/职业）”。语气上常见于商业、经济和供应链语境，尤其在讨论“去中介化（disintermediation）”或“层层加价”时出现。","与“brokerage（经纪业务/经纪费）”相比，middlemanship更强调“中间环节/中介层级”本身，有时带一点批评意味（例如认为中间环节过多导致价格上涨）。"]}
{"word":"middlemen","summary":{"en":"Middlemen are intermediaries who connect two sides—especially in business deals—and may earn a fee or profit; the word can also mean go-betweens who help negotiations.","zh":"middlemen 指在双方之间牵线搭桥的中间人，尤其常见于商业交易中，可能收取费用或赚取差价；也可指帮助沟通或谈判的居间协调者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who act as intermediaries between two sides (such as buyers and sellers), often arranging deals and taking a fee or profit.","zh":"中间人；经纪人；掮客（在双方之间牵线搭桥，促成交易并从中收取费用或赚取差价的人）"},"examples":[{"en":"The farmers sell directly online to avoid middlemen.","zh":"农民在网上直接销售，以避开中间商。"},{"en":"Several middlemen handled the paperwork between the factory and the retailer.","zh":"工厂和零售商之间的手续由好几个中间人经手。"},{"en":"Too many middlemen can make the final price higher for customers.","zh":"中间环节太多会让顾客最终支付更高的价格。"}]},{"partOfSpeech":"n.","definition":{"en":"People who try to help two sides communicate or reach an agreement; go-betweens.","zh":"调解者；居间协调者（帮助双方沟通或达成一致的人）"},"examples":[{"en":"Community middlemen helped the neighbors settle the dispute.","zh":"社区调解员帮助邻里解决了纠纷。"},{"en":"She acted as a middleman between the two teams during negotiations.","zh":"谈判期间她充当两队之间的中间协调人。"}]}],"synonyms":["intermediaries","brokers","agents","go-betweens","middlepersons"],"phonetic":"/ˈmɪdəlˌmæn/","extraExplanation":["“middlemen”是“middleman”的复数。单数传统上用middleman，但现在也常用更中性的说法：intermediary（中介/中间人）、broker（经纪人）、go-between（传话人/牵线人）。","在商业语境里，“cut out the middleman/avoid the middlemen”常表示“减少中间环节、直接交易”，强调降低成本或提高效率；但在某些行业中，中间人也提供重要服务（信息、信用、物流、谈判等）。"]}
{"word":"middlemost","summary":{"en":"“Middlemost” means the most central or exactly in the middle.","zh":"“middlemost”表示“最居中的、正中间的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located exactly (or most nearly) in the middle; the most central.","zh":"位于正中间的；最居中的。"},"examples":[{"en":"Sit in the middlemost seat so everyone can see the screen.","zh":"坐在最中间的座位，这样大家都能看到屏幕。"},{"en":"The fountain stands in the middlemost part of the plaza.","zh":"喷泉位于广场的正中央。"},{"en":"She chose the middlemost line on the page to start her drawing.","zh":"她选择了页面正中间那一行开始画。"}]}],"synonyms":["central","centermost","inmost","midmost"],"phonetic":"/ˈmɪdəlˌmoʊst/","extraExplanation":["“middlemost”是一个相对少见、偏书面或强调用词，日常更常说“the middle”或“the very middle”。用“middlemost”通常是为了突出“最居中、最正中”的感觉。","构词很好理解：middle（中间的）+ -most（最……）。它表达的是在一组位置里“最靠中间”的那个。"]}
{"word":"middleness","summary":{"en":"Middleness means the quality or state of being in the middle or between extremes.","zh":"Middleness 指“处于中间”的状态或性质，也可指介于两端之间的处境或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being in the middle; being neither at one extreme nor the other","zh":"处于中间的状态或性质；不偏不倚、介于两端之间"},"examples":[{"en":"She preferred the middleness of the discussion—calm, practical, and not too emotional.","zh":"她更喜欢讨论的“中间状态”——冷静、务实，不过度情绪化。"},{"en":"The novel explores the middleness of everyday life rather than dramatic extremes.","zh":"这部小说探讨的是日常生活的“平常与居中”，而不是戏剧性的极端。"}]},{"partOfSpeech":"n.","definition":{"en":"a position or condition between two points, sides, or groups","zh":"两点、两方或两群体之间的中间位置或中间处境"},"examples":[{"en":"The country tried to keep a middleness between the two competing powers.","zh":"这个国家试图在两大竞争势力之间保持一种中间立场。"},{"en":"Living in the middleness between cultures can be confusing at times.","zh":"生活在两种文化之间的“中间地带”有时会让人困惑。"}]}],"synonyms":["in-betweenness","centrality","intermediacy","moderation"],"phonetic":"/ˈmɪd(ə)lnəs/","extraExplanation":["“middleness”在现代英语中不算常用，更常见的表达是“the middle（中间）/ being in the middle（处于中间）/ in-betweenness（介于两者之间的状态）/ centrality（中心性）”。它常带一点文学或哲学色彩，用来强调一种“既不极端也不偏向”的感觉。","在写作里，“middleness”有时不仅指空间位置，也指心理或社会状态：例如温和、折中、处在两种身份/文化之间等。"]}
{"word":"middler","summary":{"en":"A (less common) word for someone who interferes in other people’s business.","zh":"（较少见）指爱插手别人事情、干涉他人事务的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who gets involved in other people’s affairs, especially when it is not wanted; an interferer.","zh":"爱插手别人事情的人；多管闲事的人（通常不受欢迎）。"},"examples":[{"en":"He’s a middler who always tries to solve problems that aren’t his.","zh":"他很爱插手，总想去解决不关他的事。"},{"en":"Don’t be a middler—let them talk it out themselves.","zh":"别多管闲事，让他们自己谈清楚。"}]}],"synonyms":["meddler","interferer","busybody"],"phonetic":"/ˈmɪdlɚ/","extraExplanation":["“middler”在现代英语里比较少见；很多情况下人们想写的是更常用的“meddler”（爱管闲事的人）。两者意思非常接近，但“meddler”更标准、更常见。","如果你是在正式写作中使用，建议用“meddler”。在口语或非正式文本里偶尔也会看到“middler”作为变体拼写。"]}
{"word":"middlers","summary":{"en":"“Middlers” usually means people in a middle group or stage; it can also mean “middle-of-the-road” people who try to mediate.","zh":"“Middlers”通常指处在中间组/中间阶段的人；也可指偏“中间路线”、试图调停或不明确站队的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are in the middle group or middle stage (for example, middle-year students or a mid-level group), often used informally.","zh":"处于“中间”群体或阶段的人（例如中年级学生、某个层级的中等组），多为非正式用法。"},"examples":[{"en":"The school split the kids into juniors, middlers, and seniors for activities.","zh":"学校把孩子们分成低年级、中年级和高年级来参加活动。"},{"en":"Middlers usually have more responsibility than beginners but less pressure than seniors.","zh":"中间组通常比新手责任更多，但比高年级压力更小。"}]},{"partOfSpeech":"n.","definition":{"en":"People who try to be in the middle between two sides, especially by mediating or not fully taking either side (often slightly critical).","zh":"在两方之间保持“居中”的人，尤指调停或不完全站队的人（常带一点批评意味）。"},"examples":[{"en":"In every argument, a few middlers try to calm everyone down.","zh":"每次争吵时，总有几个“和事佬”试着让大家冷静下来。"},{"en":"Some saw him as a middler who avoided making a clear decision.","zh":"有人觉得他是个“中间派”，总是回避明确表态。"}]}],"synonyms":["middle group","mid-levels","moderates","mediators","middle-of-the-road people"],"phonetic":"/ˈmɪd.lɚz/","extraExplanation":["“middlers”并不是非常常见、非常标准的词；更多时候你会看到更常用的表达，比如：middle group（中间组）、middle schoolers（初中生）、mid-level students（中等水平学生）、moderates（温和派/中间派）、mediators（调停者）。","如果你是在某部作品、游戏、学校分组或特定社群里看到“Middlers”大写，它也可能是一个专有名词（某个组织/阵营/年级名称）。如果你告诉我上下文句子，我可以帮你确认具体指什么。"]}
{"word":"middles","summary":{"en":"“Middles” usually means the central parts of things (plural of “middle”). It can also be a rare verb form meaning “puts in the middle.”","zh":"“Middles”通常表示“中间部分”（middle 的复数）；也可作较少见的动词形式，表示“把……放在中间”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central parts of things; areas between the beginning and the end (plural of “middle”)","zh":"中间部分；中部；介于开始与结束之间的部分（“middle”的复数）"},"examples":[{"en":"The middles of the two books are missing.","zh":"那两本书的中间部分不见了。"},{"en":"We talked for hours, and I forgot the middles of his story.","zh":"我们聊了好几个小时，我把他故事的中间部分给忘了。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to place or position something in the middle; to put in the center (third-person singular of “middle”)","zh":"（较少用）把某物放在中间；使位于中央（“middle”的第三人称单数）"},"examples":[{"en":"She middles the chairs so everyone can see the screen.","zh":"她把椅子放到中间，让大家都能看到屏幕。"}]}],"synonyms":["centers","midpoints","middle parts","central areas"],"phonetic":"/ˈmɪdəl/","extraExplanation":["“middles”最常见是名词复数，表示多个事物的“中间部分”。在口语里更常说 the middle of… / the middle parts，而不是单独说 middles。","动词 middle 本身不常用；日常表达更自然的是 put … in the middle / place … in the center。"]}
{"word":"middlesail","summary":{"en":"A nautical term for the sail on a ship’s middle mast.","zh":"航海用语：指船上中桅（中间桅杆）上的帆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) A sail set on the middle mast of a ship (especially on ships with three masts).","zh":"（航海）船上中桅（中间那根桅杆）所挂的帆；尤指三桅船上的中桅帆。"},"examples":[{"en":"In a stiff breeze, the crew reefed the middlesail to reduce speed.","zh":"在强风中，船员把中桅帆收小（打缩帆）来降低航速。"},{"en":"The old illustration shows a ship with the fore sail, middlesail, and mizzen sail.","zh":"那幅老插图画的是一艘船，前桅帆、中桅帆和后桅帆都挂着。"}]}],"synonyms":["mainsail (often used more generally)","main course (historical, square-rig context)"],"phonetic":"/ˈmɪdəlˌseɪl/","extraExplanation":["“middlesail”是较少见、偏历史/航海文献中的词，多用于描述传统帆船（如三桅船）的帆装配置。现代日常英语里更常见的是更具体的帆名（如 mainsail 主帆、fore sail 前帆、mizzen 后帆），因此你可能主要在小说、航海史或旧式航海记录中见到它。"]}
{"word":"middlesplitter","summary":{"en":"A “middlesplitter” is something that splits or divides something into two parts down the middle.","zh":"“middlesplitter”指把某物从中间分成两半的东西（工具或部件等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something (a tool, part, or force) that splits or divides something down the middle","zh":"把某物从中间劈开或分成两半的东西（工具、部件或力量）"},"examples":[{"en":"The wedge worked like a middlesplitter, cracking the log straight down the center.","zh":"这个楔子就像一个“中间劈裂器”，把木头沿着中心线劈开。"},{"en":"In the diagram, the middlesplitter separates the flow into two equal channels.","zh":"在示意图中，这个“中间分流器”把流体分成两条相等的通道。"}]}],"synonyms":["splitter","divider","separator","wedge","cleaver"],"phonetic":"/ˈmɪdəlˌsplɪtər/","extraExplanation":["“middlesplitter”不是一个非常常见的标准词，更多见于口语临时造词、产品名、或技术语境。它是由 middle（中间）+ splitter（分裂器/分割器）组合而成，含义通常可以从构词直接推断。","在不同领域它可能指不同具体事物：机械/木工里可指把材料从中线劈开的装置；管道/电路/数据传输里可指把输入平均分成两路的分配部件。具体含义最好结合上下文或图片/说明书。"]}
{"word":"middletone","summary":{"en":"Midtone means the middle range of brightness (most common), or less commonly a medium pitch/sound between high and low.","zh":"Midtone 最常指影像中的“中间调”（亮度介于高光与阴影之间）；较少情况下也可指介于高低之间的中音/中等音色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A middle range of brightness between highlights (very bright areas) and shadows (very dark areas), especially in photography, film, and painting.","zh":"（尤指摄影、影视、绘画中的）中间调；介于高光与阴影之间的亮度范围。"},"examples":[{"en":"The photo looks flat because the midtones are too dark.","zh":"这张照片看起来很平，是因为中间调太暗了。"},{"en":"Try increasing contrast to bring out detail in the midtones.","zh":"试着提高对比度，把中间调里的细节拉出来。"}]},{"partOfSpeech":"n.","definition":{"en":"A medium pitch or sound quality between high and low tones (less common in everyday English).","zh":"（不太常用）中音；介于高音与低音之间的音高或音色。"},"examples":[{"en":"She spoke in a calm midtone, not too loud or too soft.","zh":"她用平稳的中等音量说话，不大也不小。"}]}],"synonyms":["middle tone","mid-range tone","middle value (art)","midrange (audio)"],"phonetic":"/ˈmɪdˌtoʊn/","extraExplanation":["更常见的拼写是 **midtone**（一个词）或 **mid-tone**（带连字符）。你输入的 **middletone** 不算标准拼写；如果用于摄影/修图语境，建议用 *midtone(s)*。","在摄影里常说“highlights / midtones / shadows”（高光/中间调/阴影）。很多修图软件也直接用这些标签。"]}
{"word":"middletown","summary":{"en":"Middletown is a common town name, and it can also mean a “typical” American community.","zh":"Middletown 既是常见的城镇名，也可引申指“典型的美国小城/社区”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town name used in many English-speaking places (especially the U.S.), usually meaning “a town in the middle” (between other towns or regions).","zh":"（专有名词）许多英语国家常见的城镇名（尤指美国），字面意思常为“位于中间的城镇”（夹在其他城镇或地区之间）。"},"examples":[{"en":"She grew up in Middletown, Connecticut, and moved to New York after college.","zh":"她在康涅狄格州的米德尔敦长大，大学毕业后搬到纽约。"},{"en":"There are several towns named Middletown in the U.S., so he had to specify the state.","zh":"美国有好几个叫米德尔敦的城镇，所以他得说明是哪个州的。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a “typical” American community, used in books and journalism to describe ordinary middle-class life and values.","zh":"（常大写）“典型的美国小城/社区”，在书籍和新闻中用来指代普通中产阶级的生活方式与价值观。"},"examples":[{"en":"The film is set in a kind of Middletown, where everyone seems to know each other.","zh":"这部电影设定在一种“典型美国小城”的环境里，大家好像彼此都认识。"},{"en":"The article asked how politics is changing in Middletown America.","zh":"这篇文章探讨政治在“典型美国”中如何变化。"}]}],"synonyms":["a typical American town","Main Street America","small-town America"],"phonetic":"/ˈmɪdəltaʊn/","extraExplanation":["“Middletown”作为“典型美国社会”的用法，和两位社会学家罗伯特·林德（Robert S. Lynd）与海伦·林德（Helen Merrell Lynd）在1920年代对印第安纳州曼西（Muncie）的研究有关，他们把该地当作观察美国日常生活的样本，并以《Middletown》为书名发表。后来媒体常借用“Middletown”来指代“普通美国”。"]}
{"word":"middlewards","summary":{"en":"“Middlewards” means “toward the middle/center,” and is relatively uncommon in everyday speech.","zh":"“middlewards”意为“朝向中间/中心”，在日常口语中较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the middle; in the direction of the center (of a place, group, or arrangement).","zh":"朝向中间；往中心方向。"},"examples":[{"en":"They moved middlewards to make room at the edges.","zh":"他们往中间挪了挪，好让两边腾出空间。"},{"en":"As the crowd grew, people were pushed middlewards.","zh":"人群越来越拥挤，人们被挤向中间。"}]}],"synonyms":["toward the middle","toward the center","inward","centrally"],"phonetic":"/ˈmɪdəlwɚdz/","extraExplanation":["“middlewards”较少见，语气偏书面或描写性。日常英语更常用“toward(s) the middle / toward the center”。","后缀“-wards”表示“朝……方向”（如：homewards, northwards）。美式英语里也常见“-ward”（如：homeward），但“middleward(s)”本身都不太常用。"]}
{"word":"middleway","summary":{"en":"Middle way means a balanced, moderate approach that avoids extremes; it can also refer specifically to Buddhism’s Middle Way.","zh":"Middle way 指避免极端的中庸/折中做法；也可特指佛教的“中道”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a moderate approach that avoids extreme opinions or actions; a compromise or balanced solution","zh":"中庸之道；走中间路线（避免极端的观点或做法）；折中方案"},"examples":[{"en":"We need a middle way between cutting the budget and spending more money.","zh":"我们需要在削减预算和增加支出之间找到一个中间路线。"},{"en":"She tried to find a middle way so both sides could agree.","zh":"她试图找到一个折中办法，让双方都能同意。"}]},{"partOfSpeech":"phrase","definition":{"en":"(especially in Buddhism) a path of practice that avoids self-indulgence and self-denial; the balanced route to wisdom","zh":"（尤指佛教）“中道”：避免纵欲与苦行两种极端的修行道路；通向智慧的平衡之路"},"examples":[{"en":"In Buddhism, the Middle Way teaches people to avoid extremes.","zh":"在佛教中，“中道”教导人们避免走极端。"},{"en":"He described meditation as part of the middle way toward a calmer mind.","zh":"他把冥想描述为通往更平静心灵的“中道”的一部分。"}]}],"synonyms":["compromise","moderation","balanced approach","the golden mean"],"phonetic":"/ˈmɪdəl weɪ/","extraExplanation":["“middle way / the Middle Way”常写作分开两词；连写“middleway”较少见，可能是非正式拼写或标题用法。","佛教语境中常译为“中道”（梵语 madhyamā-pratipad），源于释迦牟尼在体验极端苦行后提出：修行应避开“享乐主义”和“苦行主义”两端。","在日常英语里，它也可以用在政治、管理、家庭沟通等场景，表示“温和、务实的折中路线”，不一定带宗教含义。"]}
{"word":"middleweight","summary":{"en":"Middleweight refers to the middle weight class in sports (especially boxing/MMA), and more generally to something of medium weight or heaviness.","zh":"middleweight 指（尤指拳击/MMA）中量级这一体重级别或中量级选手；也可泛指“中等重量/中等厚度”的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A boxer (or fighter) in the middleweight division, a weight class with an upper limit set by a sport’s rules.","zh":"（拳击/格斗）中量级选手；一种按规则划分的体重级别（上限由赛事规定）。"},"examples":[{"en":"He moved up to middleweight after gaining muscle.","zh":"他增肌后升级到中量级比赛。"},{"en":"She won the middleweight title last year.","zh":"她去年赢得了中量级冠军头衔。"}]},{"partOfSpeech":"adj.","definition":{"en":"Belonging to the middleweight division (for a fighter or a match).","zh":"中量级的（指选手或比赛）。"},"examples":[{"en":"They’re watching a middleweight bout tonight.","zh":"他们今晚在看一场中量级比赛。"},{"en":"He is a middleweight champion.","zh":"他是中量级冠军。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of medium weight or strength; heavier than “lightweight” but not as heavy as “heavyweight.”","zh":"中等重量的；（广义）比“轻量”重，但不到“重量”。"},"examples":[{"en":"This jacket is a good middleweight option for spring.","zh":"这件夹克是春天很合适的中等厚度选择。"},{"en":"Choose a middleweight fabric that isn’t too thin or too bulky.","zh":"选一种中等厚度的面料，不要太薄也不要太厚。"}]}],"synonyms":["midweight","medium-weight","middle-class (sports division)"],"phonetic":"/ˈmɪdəlˌweɪt/","extraExplanation":["不同运动对“middleweight（中量级）”的具体体重范围不完全一样。例如拳击和综合格斗（MMA）的划分上限就可能不同；学习时可理解为“位于中间的体重级别”，具体数值以该赛事/项目规则为准。","词形结构：middle（中间的）+ weight（重量）。在日常英语里也常用来形容衣服、布料等“中等厚度/重量”，类似说法还有 lightweight（轻薄的）和 heavyweight（厚重的/强力的）。"]}
{"word":"middleweights","summary":{"en":"“Middleweights” most often means athletes in the middleweight division; more broadly it can mean medium-level people or things between lightweights and heavyweights.","zh":"“middleweights”最常指中量级运动员；也可泛指介于轻量级与重量级之间、实力或规模中等的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or competitor in the middleweight division, especially in boxing or other combat sports (often plural when talking about a group).","zh":"（尤指拳击等格斗运动中的）中量级选手；中量级选手群体（常用复数）"},"examples":[{"en":"The middleweights will fight in the third match of the night.","zh":"中量级选手将在当晚第三场比赛出战。"},{"en":"He moved up from welterweight to compete with the middleweights.","zh":"他从次中量级升级，去和中量级选手比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"In a general sense, people or things of medium size, strength, or importance—between “lightweights” and “heavyweights.”","zh":"泛指（规模、力量或重要性）中等的人或事物——介于“轻量级”和“重量级”之间"},"examples":[{"en":"In the tech industry, middleweights can grow fast if they find the right niche.","zh":"在科技行业里，中等规模的公司如果找对细分领域，也能快速成长。"},{"en":"The debate included a few heavyweights and several middleweights.","zh":"这场辩论里有几位重量级人物，也有不少中等影响力的人物。"}]}],"synonyms":["middleweight fighters","mid-tier competitors","mid-level players","mediumweights"],"phonetic":"/ˈmɪdəlˌweɪts/","extraExplanation":["“Middleweight”最常见于拳击等分级运动。不同运动对“中量级”的体重范围略有差别；例如职业拳击的middleweight通常是160磅（约72.6公斤）上限。","英语里常用lightweight / middleweight / heavyweight做比喻：lightweight偏“实力弱/不重要”，heavyweight偏“重量级人物/大公司/强者”，middleweight则是“中等实力或规模”。语气通常较中性。"]}
{"word":"middlewoman","summary":{"en":"A woman who serves as an intermediary or go-between, especially in deals or communication.","zh":"指在交易或沟通中充当（女性）中间人、牵线者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who acts as an intermediary between two people or groups, helping them communicate, negotiate, or do business.","zh":"（女性）中间人；居间者：在两方之间牵线、协调沟通或促成交易的人。"},"examples":[{"en":"The middlewoman arranged a meeting between the buyer and the seller.","zh":"这位女中间人安排了买卖双方见面。"},{"en":"In the story, a middlewoman carries messages between two families.","zh":"在故事里，一位女居间者在两个家族之间传话。"}]}],"synonyms":["intermediary","go-between","broker","agent","middleman"],"phonetic":"/ˈmɪdəlˌwʊmən/","extraExplanation":["“middlewoman”是“middleman”的女性形式，但现代英语中常用更中性的说法，如“intermediary”“go-between”“broker”“agent”，以避免强调性别。","在商业语境里，“middlewoman/ middleman”有时带一点负面色彩，暗示“中间赚差价”或“多一道环节”；但在需要协调资源、信息不对称的场景中也可以是中性甚至正面的角色。"]}
{"word":"middlewomen","summary":{"en":"Middlewomen are women who act as intermediaries—people who connect buyers and sellers or help make deals.","zh":"middlewomen 指“女中间人们”，即在买卖双方之间牵线搭桥、促成交易的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who acts as an intermediary in business or negotiations; someone who buys from one party and sells to another, or who helps two sides make a deal","zh":"（尤指商业或谈判中的）女中间人；从一方买入再转卖给另一方，或促成双方交易的人"},"examples":[{"en":"The farmers sold their coffee through a middlewoman who handled export paperwork.","zh":"农民通过一位女中间人出售咖啡，由她负责出口文件。"},{"en":"If you can buy directly from the producer, you may not need a middlewoman.","zh":"如果你能直接从生产者购买，可能就不需要中间人了。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural form) women who act as intermediaries; plural of “middlewoman”","zh":"（复数形式）女中间人们；“middlewoman”的复数"},"examples":[{"en":"Several middlewomen connected the artisans with shops in the city.","zh":"几位女中间人把手工艺人和城里的商店联系起来。"}]}],"synonyms":["intermediaries","brokers","agents","go-betweens"],"phonetic":"/ˈmɪdəlˌwʊmən/","extraExplanation":["“middlewomen”是“middlewoman”的复数，但在现代英语里更常见、也更中性包容的说法是“intermediaries”“brokers”或“middle people”。传统说法“middlemen”常被当作泛指（不一定只指男性），不过在正式写作中越来越多人会改用中性表达。"]}
{"word":"middling","summary":{"en":"Middling means average or only moderately good; it can also refer to average people/things.","zh":"middling表示“中等的、一般的”，也可指“中等水平的人或事物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Average or ordinary; not very good and not very bad.","zh":"中等的；一般的；不太好也不太差的。"},"examples":[{"en":"The restaurant was okay, but the service was middling.","zh":"这家餐厅还行，但服务一般。"},{"en":"He got a middling score on the test and wants to improve.","zh":"他这次考试得了中等分数，想要提高。"},{"en":"Her interest in the movie was middling, so she didn’t finish it.","zh":"她对这部电影兴趣一般，所以没看完。"}]},{"partOfSpeech":"n.","definition":{"en":"People or things that are average in quality or ability (often used with “the”).","zh":"（常与the连用）中等水平的人或事物；平平之辈/平常之物。"},"examples":[{"en":"The show celebrates excellence, not the middling.","zh":"这个节目赞美卓越，而不是平庸之辈。"},{"en":"He tried to rise above the middling in his field.","zh":"他努力在自己的领域里超越一般水平。"}]}],"synonyms":["average","medium","so-so","moderate","ordinary"],"phonetic":"/ˈmɪd(ə)lɪŋ/","extraExplanation":["“middling”来自“middle（中间）”，语感上常带一点“平平无奇、不过如此”的评价色彩，比中性词“average”更偏主观。","在商业语境里，名词“middling(s)”有时指“中等阶层/中产”（较旧或偏历史的用法），例如“the middling sort”。"]}
{"word":"middlingish","summary":{"en":"“Middlingish” means somewhat average/mediocre or medium—informal and a bit playful.","zh":"“middlingish”表示“有点普通/平庸”或“中等的”，属于非正式且带点俏皮的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Somewhat average or mediocre; not very good and not very bad.","zh":"（非正式）有点普通/平庸；不算好也不算差。"},"examples":[{"en":"The movie was middlingish—fine for a lazy afternoon, but nothing memorable.","zh":"这部电影有点平庸——用来打发一个慵懒的下午还行，但没什么令人难忘的。"},{"en":"My test score was middlingish, so I’ll study more next time.","zh":"我的考试成绩有点一般，所以下次我会多复习。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Medium in size, amount, or importance; neither small nor large.","zh":"（非正式）中等的；大小、数量或重要性处于中间。"},"examples":[{"en":"They live in a middlingish town—not tiny, not a big city either.","zh":"他们住在一个中等规模的小城——不算很小，也不是大城市。"},{"en":"We made a middlingish profit this quarter.","zh":"我们这个季度赚得不多不少，算是中等利润。"}]}],"synonyms":["average","mediocre","so-so","moderate","middle-of-the-road"],"phonetic":"/ˈmɪdəlɪŋɪʃ/","extraExplanation":["“middlingish”不是非常标准/常见的词，更像是口语里临时造出来的说法：在“middling（中等、普通）”后面加上后缀“-ish”，表达“有点……、带点……的感觉”。这种“-ish”的用法很常见，比如：greenish（有点绿）、tallish（有点高）、cheap-ish（有点便宜/差不多便宜）。","因为它带有一种轻松、带点玩笑或委婉的语气，所以更适合聊天、随笔、影评/餐评等非正式语境；正式写作里通常用“average / mediocre / moderate”更自然。"]}
{"word":"middlingly","summary":{"en":"“Middlingly” means “in an average/mediocre way.”","zh":"“middlingly”表示“以一般、平庸的方式（中等水平）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a mediocre or average way; not very well and not very badly.","zh":"以平庸/中等的方式；不好也不坏。"},"examples":[{"en":"He played middlingly in the first half but improved later.","zh":"他上半场表现平平，但后来有了起色。"},{"en":"The restaurant was reviewed middlingly—nothing special, but not terrible.","zh":"这家餐厅的评价一般——没什么特别，但也不算差。"}]}],"synonyms":["averagely","so-so","moderately","mediocrely"],"phonetic":"/ˈmɪdəlɪŋli/","extraExplanation":["“middlingly”来自形容词“middling”（中等的、普通的），在现代英语里不算常用；更常见的说法是“in an average way / so-so / moderately”。","在写作或书面语中用“middlingly”会显得有点文学或旧式，常带轻微的负面评价（偏“平平无奇”）。"]}
{"word":"middlingness","summary":{"en":"Middlingness means the state of being average or mediocre, and sometimes the condition of being socially/economically in the middle.","zh":"Middlingness 指“平庸/中等水平”的状态，有时也指社会或经济上处于“中间位置/中间阶层”的处境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being average; neither very good nor very bad; mediocrity","zh":"平庸；中等水平（既不很好也不很差的状态）"},"examples":[{"en":"The movie’s middlingness made it easy to forget.","zh":"这部电影的平庸让人很容易就忘记。"},{"en":"He was frustrated by the middlingness of his exam results.","zh":"他对自己中等水平的考试成绩感到沮丧。"},{"en":"The restaurant isn’t terrible, but its middlingness keeps people from recommending it.","zh":"这家餐厅不算差，但它的“中规中矩”让人不太愿意推荐。"}]},{"partOfSpeech":"n.","definition":{"en":"the condition of being in a middle position or category (especially socially or economically)","zh":"处于中间位置或中间阶层的状态（尤指社会或经济层面）"},"examples":[{"en":"The novel explores the anxieties of middlingness in a rapidly changing city.","zh":"这部小说探讨了在快速变化的城市里，中间阶层的焦虑。"},{"en":"They tried to escape the middlingness of their social standing through education.","zh":"他们试图通过教育摆脱自己社会地位的“不上不下”。"}]}],"synonyms":["mediocrity","averageness","ordinariness","middle-of-the-road quality","so-so-ness"],"phonetic":"ˈmɪdəlɪŋnəs","extraExplanation":["“middlingness”来自形容词“middling”（中等的、普通的）+ 名词后缀“-ness”（……的状态/性质）。它常带一点主观评价色彩，暗示“平平无奇、缺乏亮点”。","在历史与社会语境中，middling 也可指“中间阶层/中产倾向”（如早期近代英语里的“the middling sort”），所以“middlingness”有时不仅是“平均水平”，也会引申为“夹在上下之间的处境与心态”。"]}
{"word":"middlings","summary":{"en":"Middlings usually means middle-class people (often in older/literary English), and it can also mean a flour/grain byproduct from milling.","zh":"middlings 通常指（较旧/文学语境中的）中产阶层人士；也可指制粉过程中产生的次粉等副产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people of the middle social class; ordinary people who are neither very rich nor very poor (often used in older or literary writing)","zh":"（常用于较旧或文学语境）中产阶层的人；不富不贫的普通人"},"examples":[{"en":"In the novel, the middlings worry about keeping up appearances.","zh":"在小说里，中产阶层的人担心维持体面。"},{"en":"Politics began to reflect the interests of the middlings as cities grew.","zh":"随着城市发展，政治开始反映中产阶层的利益。"}]},{"partOfSpeech":"n.","definition":{"en":"a grade of flour or grain byproduct (especially wheat) used for food or animal feed","zh":"（尤指小麦的）次粉；制粉过程中的副产品（可作食品或饲料）"},"examples":[{"en":"The mill produced flour, bran, and middlings.","zh":"磨坊生产面粉、麸皮和次粉。"},{"en":"Farmers sometimes mix middlings into feed for livestock.","zh":"农民有时把次粉混入饲料喂家畜。"}]}],"synonyms":["the middle class","middle-class people","common people","middling sort","wheat middlings"],"phonetic":"/ˈmɪdlɪŋz/","extraExplanation":["“middlings”作“中产阶层的人”时，多见于历史写作或文学作品，现代更常说“the middle class”或“middle-class people”。","作制粉术语时，语境通常和mill（磨坊/制粉）、flour（面粉）、bran（麸皮）、feed（饲料）一起出现。"]}
{"word":"middorsal","summary":{"en":"Middorsal means ‘in the middle of the back (dorsal) side,’ often used in anatomy or biology.","zh":"middorsal 表示“背部（背侧）中间的/沿背部正中线的”，多用于解剖学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located on or relating to the middle of the back (dorsal) side of the body; along the midline of the back.","zh":"位于或与身体背侧（背部）中间相关的；沿背部正中线的。"},"examples":[{"en":"The incision was made at a middorsal position to avoid major blood vessels.","zh":"切口选择在背部正中位置，以避开主要血管。"},{"en":"The fish has a dark stripe running along the middorsal line.","zh":"这条鱼在背部正中线有一条深色条纹。"}]}],"synonyms":["mid-dorsal","dorsal midline","midline (dorsal)"],"phonetic":"ˌmɪdˈdɔrsəl","extraExplanation":["“mid-”表示“中间”， “dorsal”表示“背侧的/背部的”（与“ventral”腹侧相对）。因此“middorsal”常用于解剖学、生物学描述，用来指背部正中线附近的位置或结构。","这个词更常见于专业语境（如解剖学描述、动物形态特征），日常英语里较少单独使用。"]}
{"word":"middy","summary":{"en":"“Middy” usually means mid-grade marijuana in US slang; it can also mean a mid-range basketball shot, and in Australia/NZ it means a small beer.","zh":"“Middy”在美国俚语里多指中档大麻；也可指篮球中的中距离投篮；在澳大利亚/新西兰则指一小杯啤酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) Mid-grade marijuana; cannabis that is neither high-quality nor very low-quality.","zh":"（俚语）中档大麻；质量一般、不算顶级也不算很差的大麻。"},"examples":[{"en":"He said it was just middy, not top-shelf.","zh":"他说这只是中档货，不是顶级的。"},{"en":"Some dealers label it “middy” to mean average quality.","zh":"有些卖家用“middy”来表示品质一般。"}]},{"partOfSpeech":"n.","definition":{"en":"(basketball slang) A mid-range shot (not a layup and not a three-pointer).","zh":"（篮球俚语）中距离投篮（不是上篮，也不是三分）。"},"examples":[{"en":"She’s deadly from middy in the fourth quarter.","zh":"她在第四节的中距离特别准。"},{"en":"He pulled up for a quick middy.","zh":"他急停跳投投了个中距离。"}]},{"partOfSpeech":"n.","definition":{"en":"(Australia/New Zealand) A small glass of beer served in a pub; size varies by region.","zh":"（澳大利亚/新西兰）酒吧里的一小杯啤酒；容量因地区而异。"},"examples":[{"en":"I’ll have a middy, thanks.","zh":"我来一小杯啤酒，谢谢。"},{"en":"In some places, a middy is smaller than a schooner.","zh":"在一些地方，middy 比 schooner（中杯）更小。"}]}],"synonyms":["mid","mid-grade","average weed","mid-range jumper","midrange shot","small beer"],"phonetic":"/ˈmɪdi/","extraExplanation":["“middy”来自“mid”（中等）+ 口语化后缀 -y，表示“中等/一般的东西”。在美国网络语境里最常见的是指“中档大麻”；在篮球圈里常说“pull-up middy（急停中投）”。","澳新酒吧用语非常地域化：同样点“middy”，不同州/城市可能容量不一样；旅行时最好看酒单标注的毫升数。"]}
{"word":"mide","summary":{"en":"“Mide” is generally not a standard English word; it’s usually a misspelling of another word.","zh":"“mide”通常不是标准英语单词，多半是其他词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard word in modern English; most often seen as a misspelling or typo (commonly for “mite,” “mind,” or “mid”).","zh":"现代英语中不是标准词；多见于拼写错误/笔误（常见目标词可能是“mite（螨/一点点）”“mind（心智/介意）”或“mid（中间的）”）。"},"examples":[{"en":"I couldn’t find “mide” in the dictionary—did you mean “mite” or “mind”?","zh":"我在词典里找不到“mide”——你想写的是“mite”还是“mind”吗？"},{"en":"Please check the spelling: “mide” looks like a typo in this sentence.","zh":"请检查拼写：这个句子里的“mide”看起来像个笔误。"}]}],"phonetic":"/maɪd/","extraExplanation":["“mide”没有稳定、常用的英语词义。要确定你真正想表达的意思，最关键是看上下文（整句/前后句）。如果你把包含“mide”的句子发来，我可以帮你判断最可能的正确词，并解释其用法与例句。"]}
{"word":"mideast","summary":{"en":"“Mideast” is a shortened form of “the Middle East,” commonly used in news and informal contexts.","zh":"“Mideast”是“the Middle East（中东）”的缩写，常用于新闻和较非正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Middle East; a common shortened form used in news and informal writing","zh":"中东；常见的缩写形式，多用于新闻和非正式书写"},"examples":[{"en":"Tensions have risen in the Mideast in recent weeks.","zh":"近几周中东地区的紧张局势加剧。"},{"en":"She studied politics in the Mideast and North Africa.","zh":"她研究中东和北非的政治。"}]}],"synonyms":["the Middle East"],"phonetic":"/ˈmɪdˌiːst/","extraExplanation":["“Mideast”是“Middle East”的缩写，常见于英文媒体标题与报道（为了简短）。较正式的写作、学术论文或官方文件中通常更推荐使用“the Middle East”。","“Middle East/中东”并不是一个严格固定的地理边界概念，不同语境下可能涵盖不同国家与地区；阅读新闻时可留意报道所指的具体国家名单。"]}
{"word":"mider","summary":{"en":"“Mider” is not standard modern English; it’s usually a misspelling (often of “midair,” “minder,” or “miter”).","zh":"“mider”不是现代英语里的标准词，通常是拼写错误（常见可能是“midair / minder / miter”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern use; most often seen as a misspelling or typo (commonly for “midair,” “minder,” or “miter”).","zh":"现代英语中不是常见/标准词；多见于拼写错误或打字错误（常见可能是想写“midair（在半空中）”“minder（看护者/管理员）”或“miter（主教冠/斜接接头）”）。"},"examples":[{"en":"I couldn’t find “mider” in a dictionary—did you mean “midair”?","zh":"我在词典里找不到“mider”——你是不是想写“midair”？"},{"en":"If you meant “minder,” it refers to a person who takes care of someone or something.","zh":"如果你想写的是“minder”，它指“照看/看护的人”。"}]}],"phonetic":"/ˈmaɪdər/","extraExplanation":["“mider”本身在主流英语词典中通常不收录，所以最好的学习策略是先确认语境与原句：你是想表达“在空中”（midair）、“看护/照看的人”（minder）、还是与宗教/木工有关的“主教冠/斜接”（miter）？把你原句发我，我可以帮你精准判断并给出对应词条。"]}
{"word":"midevening","summary":{"en":"Mid-evening means the middle part of the evening or something happening at that time.","zh":"mid-evening 指“夜晚中段（晚间中间那段时间）”，也可形容“发生在夜晚中段的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of the evening; the time around the middle of the evening (often roughly 8–10 p.m., depending on context).","zh":"傍晚到夜晚之间的中段；夜晚中间那段时间（常大约指晚上8点到10点左右，视语境而定）。"},"examples":[{"en":"I’ll call you in the mid-evening, after dinner.","zh":"我会在夜晚中段、晚饭后给你打电话。"},{"en":"The streets get quieter by mid-evening.","zh":"到了夜晚中段，街上会安静不少。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening or done in the middle of the evening.","zh":"发生在夜晚中段的；在夜晚中间进行的。"},"examples":[{"en":"We had a mid-evening meeting to review the plan.","zh":"我们在夜晚中段开了个会来复盘计划。"},{"en":"She took a mid-evening walk to clear her mind.","zh":"她在夜晚中段散步，让自己清醒一下。"}]}],"synonyms":["middle of the evening","later in the evening","evening time"],"phonetic":"/ˌmɪdˈivnɪŋ/","extraExplanation":["“midevening”更常见的拼写是 **mid-evening**（常用连字符）。在非正式写作中也可能看到 **mid evening**（分开写），但带连字符的形式更清晰、更常见。","这个词通常用于比较具体的日程安排或叙述时间段；如果需要更精确的时间，最好直接写具体时刻（如 9 p.m.）。"]}
{"word":"midewin","summary":{"en":"Midewin is an Ojibwe term referring to the Midewiwin, a traditional spiritual and healing society (“Grand Medicine Society”).","zh":"Midewin 是奥吉布瓦语相关词，指 Midewiwin（米德威温），一种传统的灵性与疗愈社团（“大神医/大药社团”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Ojibwe culture) the Midewiwin; a traditional spiritual and healing society, often translated as the “Grand Medicine Society.”","zh":"（奥吉布瓦/阿尼希纳贝文化中）Midewiwin（米德威温）；一种传统的灵性与疗愈社团，常被译为“大神医（大药）社团/大医药会”。"},"examples":[{"en":"The museum exhibit explained the role of the Midewin in Ojibwe healing traditions.","zh":"博物馆展览介绍了 Midewin 在奥吉布瓦疗愈传统中的角色。"},{"en":"Some elders shared stories about Midewin teachings and community responsibilities.","zh":"一些长者分享了关于 Midewin 教导与社区责任的故事。"}]}],"synonyms":["Midewiwin","Grand Medicine Society"],"phonetic":"/ˈmiːdəwɪn/","extraExplanation":["“Midewin”常见为对“**Midewiwin**”的简写或不同拼写；在学术与博物馆资料中更常见完整拼写 **Midewiwin**。","这是一个与北美原住民（尤其奥吉布瓦/阿尼希纳贝）相关的文化词汇，使用时建议尊重语境：它不仅指“医术”，也涵盖仪式、伦理、知识传承与社区服务。","在英文写作中，通常会把它当作专有名词大写（Midewin/Midewiwin），并在首次出现时用一句话解释其文化背景。"]}
{"word":"midewiwin","summary":{"en":"Midewiwin is an Anishinaabe (Ojibwe) ceremonial and spiritual society, often translated as the “Grand Medicine Society.”","zh":"Midewiwin 是阿尼希纳贝（奥吉布瓦）传统的仪式与灵性团体，常译为“大神医会/大医药社团”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Anishinaabe (especially Ojibwe) ceremonial and spiritual society often translated as the “Grand Medicine Society,” focused on healing, teachings, songs, and community responsibilities.","zh":"一种阿尼希纳贝（尤其是奥吉布瓦）传统的仪式与灵性团体，常被译为“大神医会/大医药社团（Grand Medicine Society）”，与疗愈、教导、圣歌与社群责任密切相关。"},"examples":[{"en":"She is studying the Midewiwin to better understand Ojibwe healing traditions and community life.","zh":"她在研究 Midewiwin，以更好理解奥吉布瓦的疗愈传统与社群生活。"},{"en":"The museum consulted Anishinaabe elders to ensure its exhibit about the Midewiwin was respectful and accurate.","zh":"博物馆向阿尼希纳贝长者请教，确保关于 Midewiwin 的展览既尊重也准确。"}]}],"synonyms":["Grand Medicine Society","Midewiwin society"],"phonetic":"/ˌmɪdəˈwiːwɪn/","extraExplanation":["Midewiwin 是源自阿尼希纳贝语言与文化的专名（常见拼写也有 Midewin、Midewiwin 等），英语里通常首字母大写以示专称。","它并不等同于“药”或“巫术”的简单概念；更接近一个包含仪式、伦理、歌谣、疗愈知识与社会责任的传统体系。谈论时建议避免猎奇或神秘化措辞，并尽量依当事社群（Anishinaabe/Ojibwe）与长者的说法来描述。","在学术或写作中，常见英文译名是 “Grand Medicine Society”，但这只是近似翻译，无法完全覆盖其文化内涵。"]}
{"word":"midfacial","summary":{"en":"“Midfacial” means related to the middle area of the face, especially in medical contexts.","zh":"“midfacial”指与面部中部相关的，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the middle part of the face (the area around the nose, cheeks, and upper jaw).","zh":"与面部中部有关的（通常指鼻子、面颊和上颌附近区域）。"},"examples":[{"en":"The doctor examined the patient for midfacial swelling.","zh":"医生检查了患者是否有面中部肿胀。"},{"en":"Midfacial fractures often involve the nose and the upper jaw.","zh":"面中部骨折常常涉及鼻部和上颌。"}]}],"synonyms":["midface","middle facial","central facial"],"phonetic":"/ˌmɪdˈfeɪʃəl/","extraExplanation":["“midfacial”常用于医学语境（如口腔颌面外科、耳鼻喉科、整形外科、急诊创伤）。日常英语中更常见的说法是“the middle part of the face / midface area（面中部区域）”。","相关常见搭配：midfacial swelling（面中部肿胀）、midfacial trauma（面中部外伤）、midfacial fracture（面中部骨折）。"]}
{"word":"midfield","summary":{"en":"“Midfield” means the middle area of a sports field (especially in soccer) or the players who play there.","zh":"“midfield”指（尤指足球等）球场的中场区域，也可指中场球员整体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In sports such as soccer/football, field hockey, and rugby) the middle area of the playing field, between the defense and the attack.","zh":"（足球、曲棍球、橄榄球等运动中）球场的中场区域，位于防守与进攻之间。"},"examples":[{"en":"Most of the action happened in midfield during the first half.","zh":"上半场的大部分对抗都发生在中场。"},{"en":"They tried to keep possession in midfield to control the tempo.","zh":"他们试图在中场控球来掌控比赛节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"The group of players who play in the midfield area; the midfielders as a unit.","zh":"（整体）中场球员（群体）；中场线。"},"examples":[{"en":"Our midfield is strong, so we can win the ball back quickly.","zh":"我们的中场很强，所以能很快把球抢回来。"},{"en":"The coach changed the midfield to add more creativity.","zh":"教练调整了中场配置来增加创造力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located or happening in the middle part of a sports field.","zh":"位于（或发生在）球场中间区域的；中场的。"},"examples":[{"en":"He made a midfield pass to start the attack.","zh":"他送出了一脚中场传球发起进攻。"},{"en":"A midfield battle decided the match.","zh":"一场中场争夺决定了比赛走向。"}]}],"synonyms":["center field (sports context)","midfield area","midfield line"],"phonetic":"/ˈmɪdˌfiːld/","extraExplanation":["在足球语境里，“midfield”常和“defense（防线）/attack（锋线）”一起出现，强调它在连接进攻与防守、组织推进与反抢中的关键作用。","常见相关表达：midfielders（中场球员）、central midfield（中路/中场中路）、defensive midfield（防守型后腰）、attacking midfield（攻击型前腰）、win the midfield battle（赢下中场争夺）。"]}
{"word":"midfielder","summary":{"en":"A midfielder is a player who plays in the middle of the field, helping both defense and attack (especially in soccer).","zh":"midfielder 指在球场中间区域活动、连接防守与进攻的球员（尤指足球中场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a player in soccer (football) who plays mainly in the middle area of the field, linking defense and attack","zh":"（足球）中场球员：主要在球场中间区域活动，连接防守与进攻的球员"},"examples":[{"en":"She plays as a midfielder for the national team.","zh":"她在国家队担任中场球员。"},{"en":"A good midfielder can control the pace of the game.","zh":"优秀的中场能掌控比赛节奏。"},{"en":"He moved from defender to midfielder this season.","zh":"他这赛季从后卫改踢中场。"}]},{"partOfSpeech":"n.","definition":{"en":"a player in some other field sports (such as field hockey or lacrosse) who plays in the middle area and supports both offense and defense","zh":"（如曲棍球、长曲棍球等）中场球员：在中间区域活动，兼顾进攻与防守的球员"},"examples":[{"en":"Our midfielders pressed high to win the ball back quickly.","zh":"我们的中场高位逼抢，迅速把球抢回来。"},{"en":"The coach wants the midfielders to track back and help defend.","zh":"教练希望中场回撤协防。"}]}],"synonyms":["midfield player"],"phonetic":"/ˈmɪdˌfiːldɚ/","extraExplanation":["在足球语境中，midfielder 常按职责细分：defensive midfielder（后腰/防守型中场）、central midfielder（中前卫/中场中路）、attacking midfielder（前腰/进攻型中场）、wide midfielder（边前卫）。不同位置侧重点不同，但共同点是“衔接攻防、在中场组织”。","常见搭配：play in midfield（踢中场）、win the midfield battle（赢下中场争夺）、a box-to-box midfielder（覆盖面积大、往返能力强的中场）。"]}
{"word":"midfields","summary":{"en":"“Midfields” can mean the central midfield area(s) of a field, or (less commonly) the midfield players/positions.","zh":"“Midfields”可指球场的中场区域（可为复数多个中场），也可较少见地指中场球员/位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(sports) The central area of a playing field; the midfield zone.","zh":"（体育）球场的中场区域；场地中央地带。"},"examples":[{"en":"The team kept possession in the midfields and waited for an opening.","zh":"球队在中场控制住球权，等待破门机会。"},{"en":"Most of the match was played in the midfields, with few shots on goal.","zh":"比赛大多在中场展开，射门机会不多。"}]},{"partOfSpeech":"n.","definition":{"en":"(sports) Players or positions that operate in the midfield area; midfielders (plural, less common than “midfielders”).","zh":"（体育）在中场活动的球员或位置；中场球员（复数用法，但不如“midfielders”常见）。"},"examples":[{"en":"Their midfields pressed aggressively and disrupted our passing.","zh":"他们的中场逼抢很凶，打乱了我们的传球节奏。"},{"en":"We need faster midfields to support both defense and attack.","zh":"我们需要更快的中场球员来兼顾防守和进攻。"}]}],"synonyms":["midfield areas","midfield zone(s)","midfielders (common for players)"],"phonetic":"/ˈmɪdˌfiːldz/","extraExplanation":["“Midfield”在足球等运动里常作不可数/集合名词（the midfield），指“中场整体/中场区域”。要强调“球员”时，更自然的说法通常是“midfielders”。“Midfields”作为复数多见于：①谈不同比赛/不同球队的“中场区域”（the midfields of two teams）；②某些写作或口语中用来指“中场球员群”，但较不标准。"]}
{"word":"midforenoon","summary":{"en":"Midforenoon means the middle part of the morning before noon (mid-morning).","zh":"midforenoon 指中午之前上午的中段（约等于“mid-morning”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of the forenoon; mid-morning (roughly between about 9:00 and 11:00 a.m., depending on context)","zh":"上午的中段；接近上午中间的时段（大致约上午9点到11点之间，视语境而定）"},"examples":[{"en":"We can meet in the midforenoon, after your first class.","zh":"我们可以在上午中段见面，在你第一节课之后。"},{"en":"By midforenoon, the sun was already warm.","zh":"到了上午中段，太阳已经很暖了。"}]}],"synonyms":["mid-morning","late morning","forenoon"],"phonetic":"/ˌmɪdˌfɔrˈnuːn/","extraExplanation":["“midforenoon”是相对少见的词，更常见的写法是“mid-forenoon”或更口语的“mid-morning / late morning”。正式写作中如果担心读者不熟悉，用“mid-morning”会更自然。","“forenoon”主要见于较正式或较老派的英语（尤其在美式英语中仍可见），意思是“中午之前的时间段”。"]}
{"word":"midfrontal","summary":{"en":"Midfrontal describes the middle part of the frontal (front) area, especially the forehead or frontal brain region.","zh":"midfrontal 指额部（前部）中间区域，常用于描述前额正中部或大脑额叶的中线相关区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the middle part of the frontal region—especially the midline area of the forehead or the frontal (front) part of the brain.","zh":"与额部（前额）中间区域有关的；尤指前额正中部或大脑额叶（前部）的中线区域。"},"examples":[{"en":"The doctor noted mild pain in the midfrontal area of his forehead.","zh":"医生记录他前额正中部有轻微疼痛。"},{"en":"In the report, the abnormal signal was described as midfrontal.","zh":"在报告中，异常信号被描述为位于额部中间区域。"},{"en":"Some EEG studies focus on midfrontal activity during attention tasks.","zh":"一些脑电图研究会关注注意力任务中的额部中线（midfrontal）活动。"}]}],"synonyms":["medial frontal","central frontal","midline frontal"],"phonetic":"/ˌmɪdˈfrʌn.təl/","extraExplanation":["“mid-”表示“中间的”，“frontal”表示“额部/前部的”。在医学与神经科学语境里，midfrontal 常用来指额叶中线附近（如前扣带皮层一带）或头皮电极的额中线区域（例如 EEG 中常说的 midfrontal theta）。拼写多用于专业文献，日常英语里更常说 “middle of the forehead / central frontal area”。"]}
{"word":"midgard","summary":{"en":"Midgard is the human world in Norse mythology; today it’s also used in fantasy as the name of a human realm or “middle world.”","zh":"Midgard 指北欧神话中的人类世界；现代奇幻作品中也常用作人类国度或“中间世界”的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Norse mythology) the world of humans, located between the realm of the gods and the realm of giants.","zh":"（北欧神话）“人类的世界”，位于诸神的国度与巨人的国度之间。"},"examples":[{"en":"In Norse mythology, Midgard is the home of humankind.","zh":"在北欧神话中，Midgard 是人类的家园。"},{"en":"The story says Midgard is protected from giants by a great boundary.","zh":"传说中，Midgard 由一道巨大的屏障保护，以防巨人入侵。"}]},{"partOfSpeech":"n.","definition":{"en":"In modern fantasy and games, a name used for a human realm or a “middle world,” inspired by Norse mythology.","zh":"（现代奇幻作品/游戏中）受北欧神话启发，用来指代人类国度或“中间世界”的名称。"},"examples":[{"en":"The novel is set in Midgard, where ordinary people face magical threats.","zh":"这部小说以 Midgard 为背景，普通人要面对魔法威胁。"},{"en":"Many games use “Midgard” as the name of a central continent or human kingdom.","zh":"很多游戏会用“Midgard”来命名中心大陆或人类王国。"}]}],"synonyms":["the human world","Earth (in Norse mythology)","the mortal realm"],"phonetic":"/ˈmɪdˌɡɑrd/","extraExplanation":["“Midgard”来自古诺尔斯语 Miðgarðr：mið（中间）+ garðr（围墙、院落、区域）。因此它常被理解为“被围起来的中间之地”，强调人类世界处在诸界之间、并受到保护。","在北欧神话体系里，它通常与“Asgard（阿斯加德，诸神的国度）”和“Jotunheim（约顿海姆，巨人的国度）”等并列出现。现代流行文化（小说、游戏、影视）常借用这一名称来营造史诗感与北欧风格。"]}
{"word":"midge","summary":{"en":"A midge is a tiny flying insect (often near water), and it can also mean a small fly-fishing lure that imitates such insects.","zh":"midge 指一种很小的飞虫（常在水边，有些会叮咬），也可指飞钓中模仿这种小虫的假饵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small flying insect (a type of gnat), often found near water; some species bite","zh":"蠓虫；小飞虫（类似蚊/小蚋），常见于水边；有些会叮咬"},"examples":[{"en":"The midges were everywhere near the lake at sunset.","zh":"日落时湖边到处都是蠓虫。"},{"en":"Bring insect repellent—midges can be worse than mosquitoes.","zh":"带上驱虫剂——蠓虫有时比蚊子还烦。"}]},{"partOfSpeech":"n.","definition":{"en":"a small artificial fly used as fishing bait (fly-fishing)","zh":"（飞钓用的）小型仿虫假饵"},"examples":[{"en":"He tied on a midge and cast it upstream.","zh":"他系上一个蠓虫假饵，把线抛向上游。"},{"en":"Midge patterns work well when fish are feeding on tiny insects.","zh":"当鱼在吃小昆虫时，蠓虫型假饵很有效。"}]}],"synonyms":["gnat","tiny fly","(fishing) fly","lure"],"phonetic":"/mɪdʒ/","extraExplanation":["“midge”在英国（尤其苏格兰高地与湖区）很常见，常指成群出现、体型极小但很扰人的小飞虫；有些地区也会用“no-see-ums（小到几乎看不见）”来形容类似的叮咬小虫。"]}
{"word":"midges","summary":{"en":"Midges are very small flying insects, often near water, and many can bite.","zh":"midges 指蠓虫等很小的飞虫，常见于水边，很多会叮咬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small flying insects (often found near water); many species bite humans and animals.","zh":"蠓虫；小型飞虫（常见于水边）；很多种类会叮咬人和动物。"},"examples":[{"en":"The midges were so bad near the lake that we wore long sleeves.","zh":"湖边的蠓虫太多了，我们只好穿长袖。"},{"en":"In summer, midges can form clouds around lights at night.","zh":"夏天蠓虫常会在夜里围着灯聚成一团。"}]}],"synonyms":["gnats","biting midges","no-see-ums"],"phonetic":"/ˈmɪdʒɪz/","extraExplanation":["“midge”的复数是“midges”。在英式英语里，有时“midges”特指在苏格兰高地等地很出名、会叮人的小飞虫，常被形容为“a cloud of midges”（一团/一片蠓虫）。","容易混淆的词：mosquito（蚊子，通常更大、嗡嗡声更明显）、gnat（小飞虫的统称，未必会咬人）。“midge”更偏向更小、常群聚、部分会叮咬的种类。"]}
{"word":"midget","summary":{"en":"“Midget” is a term for a very short person, but it is widely considered offensive; prefer “little person” or “person with dwarfism.”","zh":"“midget” 指非常矮小的人，但普遍被认为冒犯；更建议用 “little person” 或 “person with dwarfism”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often considered offensive) a very short person, especially someone with dwarfism; many people prefer the terms “little person” or “person with dwarfism.”","zh":"（常被认为带有冒犯性）非常矮小的人，尤其指侏儒症患者；许多人更偏好使用 “little person（小个子人士）” 或 “person with dwarfism（侏儒症人士）”。"},"examples":[{"en":"The word “midget” is widely viewed as disrespectful, so it’s better to say “little person.”","zh":"“midget” 这个词普遍被认为不尊重，所以更好的说法是 “little person”。"},{"en":"He apologized for using an outdated term that can hurt people.","zh":"他为使用可能伤害他人的过时说法而道歉。"}]},{"partOfSpeech":"adj.","definition":{"en":"very small; miniature (now rare and often avoided because of the negative association with the noun).","zh":"很小的；微型的（如今较少使用，且常因与该名词的负面联想而被避免）。"},"examples":[{"en":"The brand once advertised a “midget radio,” but modern ads avoid that wording.","zh":"这个品牌曾经宣传过“midget radio（迷你收音机）”，但现代广告会避免这种措辞。"},{"en":"We bought a miniature model instead of using outdated labels.","zh":"我们买了一个微型模型，而不是使用过时的称呼。"}]}],"synonyms":["little person","person with dwarfism","small","miniature","tiny"],"phonetic":"/ˈmɪdʒɪt/","extraExplanation":["这个词在英语中带有强烈的贬义与歧视色彩，历史上也曾被马戏团等娱乐产业用来“猎奇式”展示身材矮小者，因此很多英语母语者会把它视为侮辱语。写作或日常交流中，通常建议使用更尊重的表达：little person / person with dwarfism（在医学或正式语境可用 dwarfism）。","在文化作品里，若你看到这个词，往往是在呈现角色的粗鲁、时代背景较旧，或在批判歧视语言；引用时可加引号并说明其冒犯性。"]}
{"word":"midgets","summary":{"en":"“Midgets” is the plural of “midget,” a term now widely considered offensive; use “little person” or “person with dwarfism” instead. It can also mean a very small version of something (less common).","zh":"“midgets”是“midget”的复数，现多被认为具有冒犯性；更建议用“little person”或“person with dwarfism”。也可指“迷你版／小型版”（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of **midget**) **OFFENSIVE / dated**: a very short person, especially a person with dwarfism. This word is widely considered insulting; many people prefer **“little person”** or **“person with dwarfism.”\nExamples: 1) Please don’t use the word “midget”; say “little person” instead. 2) The article explains why “midget” is harmful language.","zh":"（**midget** 的复数）**冒犯性／过时用语**：指非常矮小的人，尤其指侏儒症（矮人症）患者。该词在英语中普遍被认为具有侮辱性；更尊重的说法是 **“little person（小个子人士）”** 或 **“person with dwarfism（侏儒症人士）”。\n例句：1）请不要用 “midget”，可以说 “little person”。2）那篇文章解释了为什么 “midget” 属于伤人的用语。"},"examples":[{"en":"Please don’t use the word “midget”; say “little person” instead.","zh":"请不要用“midget”这个词，改说“little person”更合适。"},{"en":"The article explains why “midget” is harmful language.","zh":"那篇文章解释了为什么“midget”属于伤人的用语。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) a very small version of something.\nExamples: 1) They sell midget cars for kids at the amusement park. 2) He built a midget model of the ship.","zh":"（较少见）某物的“迷你版／小型版”。\n例句：1）游乐园里卖给孩子玩的迷你小车。2）他做了那艘船的迷你模型。"},"examples":[{"en":"They sell midget cars for kids at the amusement park.","zh":"游乐园里有卖给孩子玩的迷你小车。"},{"en":"He built a midget model of the ship.","zh":"他做了那艘船的迷你模型。"}]}],"synonyms":["little person (preferred)","person with dwarfism (preferred)","miniature","small-scale"],"phonetic":"/ˈmɪdʒɪt/","extraExplanation":["“midget”在英语里常被视为对身材矮小、尤其是侏儒症人士的贬义称呼；在新闻、学校、工作场合通常应避免使用。更中性、尊重的表达包括：little person / person with dwarfism。","在美国文化中，该词与早期“畸形秀（freak show）”等对残障人士的物化历史有关，因此容易触发不适或伤害。"]}
{"word":"midgety","summary":{"en":"“Midgety” means restless or fidgety; today it’s uncommon and often replaced by “fidgety/restless.”","zh":"“midgety”表示坐立不安、爱动；现在不太常用，常用“fidgety/restless”替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Restless or unable to stay still; fidgety or nervous in a small, quick way.","zh":"坐立不安的；爱动的；有点紧张、不断小动作的。"},"examples":[{"en":"I get midgety if I sit through a long meeting without a break.","zh":"如果开很久的会中间不休息，我就会坐立不安。"},{"en":"The children grew midgety while waiting for the bus.","zh":"孩子们等公交时越来越不安分。"}]}],"synonyms":["fidgety","restless","jittery","antsy","squirmy"],"phonetic":"/ˈmɪdʒəti/","extraExplanation":["“midgety”比较少见，更常用的词是“fidgety / restless”。它通常表示一种轻微但持续的坐立不安，常和等待、紧张、无聊或咖啡因摄入有关。","注意用词敏感性：midget在现代英语里常被认为对侏儒症/身材矮小的人不尊重，因此“midgety”在正式场合可能让人联想到不恰当的词源。想表达“坐立不安”，更推荐用“fidgety / jittery / restless”。"]}
{"word":"midgut","summary":{"en":"The middle section of the digestive tract, especially in insects and other animals studied in biology.","zh":"消化道的中段，尤其常用于生物学中描述昆虫等动物的解剖结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of an animal’s digestive tract, especially the section between the foregut and hindgut (common in biology and insect anatomy).","zh":"中肠；（动物消化道的）中段，尤指前肠与后肠之间的一段（生物学/昆虫解剖常用）。"},"examples":[{"en":"In insects, the midgut is where most digestion and nutrient absorption happen.","zh":"在昆虫中，中肠是大部分消化与营养吸收发生的地方。"},{"en":"Researchers examined the mosquito’s midgut to understand how the virus spreads.","zh":"研究人员检查了蚊子的中肠，以了解病毒如何传播。"}]}],"synonyms":["middle intestine","mid-intestine"],"phonetic":"/ˈmɪdˌɡʌt/","extraExplanation":["“midgut”常出现在生物学、昆虫学、寄生虫学与疾病传播研究中（如蚊子传播疟疾/登革热）。在昆虫体内，前肠多与摄食和储存相关；中肠常与酶消化、吸收相关；后肠常与水分回收、排泄相关。","医学语境里谈人类时更常用的是“small intestine（小肠）”“midgut (embryology)（胚胎学：中肠区）”。胚胎学中的“midgut”指由中肠发育而来的消化道部分，是更专业的用法。"]}
{"word":"midguts","summary":{"en":"Midguts = the plural of midgut, meaning the middle part of the digestive tract (especially in insects).","zh":"midguts 是 midgut 的复数，指（尤指昆虫等的）消化道中段——中肠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle section of the digestive tract (especially in insects and other animals), where most digestion and nutrient absorption happen","zh":"（尤指昆虫等动物的）中肠；消化道的中段，多数消化与营养吸收在此进行"},"examples":[{"en":"In many insects, the midgut is where enzymes break down food and nutrients are absorbed.","zh":"在许多昆虫体内，中肠是酶分解食物并吸收营养的部位。"},{"en":"The researchers compared bacteria found in the midguts of mosquitoes from different habitats.","zh":"研究人员比较了来自不同栖息地的蚊子中肠内的细菌。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of midgut; also used loosely to mean the stomach/belly area (informal, less common)","zh":"midgut 的复数；也可较口语地泛指“肚子/腹部”（较少见）"},"examples":[{"en":"The lab collected midguts from the larvae for microscopic analysis.","zh":"实验室收集中肠（样本）来自幼虫进行显微分析。"},{"en":"After the long run, he felt cramps in his midguts.","zh":"长跑后，他觉得肚子（腹部）抽筋。"}]}],"synonyms":["midgut","middle intestine","digestive tract (middle section)"],"phonetic":"/ˈmɪdˌɡʌts/","extraExplanation":["“midgut”在生物学、昆虫学论文里非常常见；写作时更常用单数 midgut，或用复数 midguts 指“多条/多个样本的中肠”。","在严格解剖学里，消化道常分 foregut（前肠）、midgut（中肠）、hindgut（后肠）；昆虫的分法尤其常见。","日常英语里人们更常说 stomach、belly、gut(s) 来表达“肚子/胃”，用 midguts 表示腹部不适会显得偏非正式或不太标准。"]}
{"word":"midgy","summary":{"en":"Midgy means either “very small” or “full of/bothered by midges (tiny biting flies),” especially in British/Scottish usage.","zh":"midgy 可指“很小的”，也可指“蠓虫很多/被蠓虫困扰的”（多见于英式/苏格兰用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very small; tiny (like a midge).","zh":"很小的；微小的（像小蠓虫一样）。"},"examples":[{"en":"The cabin was midgy, but it was warm and clean.","zh":"这间小木屋很小，但很暖和也很干净。"},{"en":"He wrote in a midgy notebook that fit in his pocket.","zh":"他用一本很小的笔记本写字，能放进口袋里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Full of midges; bothered by midges (small biting flies).","zh":"蠓虫很多的；被蠓虫困扰的。"},"examples":[{"en":"The lakeside gets midgy at dusk in summer.","zh":"夏天傍晚湖边蠓虫会很多。"},{"en":"We left early because the campsite was too midgy.","zh":"营地蠓虫太多，我们就提前离开了。"}]}],"synonyms":["tiny","small","minuscule","buggy","gnatty"],"phonetic":"/ˈmɪdʒi/","extraExplanation":["“midgy”常见于英式英语（尤其苏格兰/北英格兰口语）中，是由“midge（蠓虫）”派生出来的形容词。旅行/露营语境里说“it’s midgy”通常指傍晚水边蠓虫成群、会叮咬，让人很难受。","在美式英语中更常见的表达是“buggy”或“gnatty”（很多小虫/小飞虫）。"]}
{"word":"midheaven","summary":{"en":"Midheaven means the highest point in the sky; in astrology (MC), it’s the top of a birth chart and is often associated with career and public reputation.","zh":"Midheaven 指天空最高点；在占星学中（MC）指星盘顶部的“天顶”，常与事业与公众名声相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The highest point in the sky above you at a given moment; in astrology, the point at the top of a birth chart (the Medium Coeli/MC), often linked to career, public image, and life direction.","zh":"（天文学）某一时刻天空中的最高点；（占星学）星盘顶部的“天顶”（MC），常与事业、名声、社会形象和人生方向相关。"},"examples":[{"en":"In astrology, her Midheaven suggests she may be drawn to public-facing work.","zh":"在占星学里，她的天顶暗示她可能会被吸引去做更面向公众的工作。"},{"en":"The astrologer looked at the Midheaven to talk about his career goals.","zh":"占星师查看天顶来谈他的职业目标。"}]}],"synonyms":["MC","Medium Coeli","culmination","zenith"],"phonetic":"/ˈmɪdˌhiːvən/","extraExplanation":["在占星语境里，Midheaven 常写作 MC（Medium Coeli，拉丁语“天空的中点”），是四个重要角点之一（ASC 上升、DSC 下降、IC 天底、MC 天顶）。日常英语里不算常用词；更多见于占星、神秘学或相关文化讨论。","注意大小写：写成 Midheaven/MC 往往更强调占星含义；小写 midheaven 也可能泛指“天空最高处”。"]}
{"word":"MIDI","summary":{"en":"MIDI is a communication standard (and the data/files it produces) that carries musical instructions—not audio—between instruments and computers.","zh":"MIDI是一种通信标准（以及由此产生的数据/文件），在乐器与电脑之间传递音乐指令，而不是音频声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Musical Instrument Digital Interface: a standard that lets electronic musical instruments and computers communicate musical information (like notes, timing, and control changes). It does not transmit actual audio.","zh":"MIDI（乐器数字接口）：一种标准，用于让电子乐器与电脑传递音乐信息（如音符、节奏/时间、控制参数等）。它传输的不是声音音频本身。"},"examples":[{"en":"This keyboard sends MIDI to my laptop, and the laptop plays the piano sound.","zh":"这台键盘把MIDI发送到我的笔记本电脑，然后电脑发出钢琴的声音。"},{"en":"The producer edited the MIDI notes to fix the timing.","zh":"制作人编辑了MIDI音符来修正节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"A MIDI file or MIDI data used in music production (often a .mid file).","zh":"（常指）MIDI文件或用于音乐制作的MIDI数据（例如.mid文件）。"},"examples":[{"en":"Can you send me the MIDI for the chorus?","zh":"你能把副歌部分的MIDI发我吗？"},{"en":"I imported a MIDI file and changed the instrument to strings.","zh":"我导入了一个MIDI文件，然后把乐器换成了弦乐。"}]}],"synonyms":["Musical Instrument Digital Interface","MIDI data","MIDI file"],"phonetic":"/ˈmɪdi/","extraExplanation":["MIDI的核心是“指令/信息”而不是“声音”：它记录“按下了哪个音、按了多长、力度多大、踏板是否踩下”等，所以文件通常很小，也方便改调、改速度、换音色。","常见说法：MIDI controller（MIDI控制器，常不自带音色）、MIDI keyboard（带键盘的控制器）、MIDI interface（连接设备）、MIDI CC（Control Change，控制变化，如音量、滤波等）。","在日常写作中常写作全大写“MIDI”。口语里也有人读成“mid-ee”。"]}
{"word":"midi","summary":{"en":"MIDI is a standard way for instruments and computers to send musical instructions (notes, timing, controls), not recorded sound.","zh":"MIDI 是让乐器与电脑传递“音乐指令”（音符、时间、控制参数）的标准方式，不是录制好的音频声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a standard system (protocol) that lets electronic musical instruments and computers communicate musical information, such as notes, timing, and control changes (not actual recorded sound).","zh":"一种标准系统（通信协议），用于让电子乐器与电脑交换音乐信息（如音符、节奏/时间、控制参数变化等），传输的是“指令”而不是实际录制的声音。"},"examples":[{"en":"This keyboard can send MIDI to my laptop so I can record the notes.","zh":"这台键盘可以把 MIDI 发送到我的笔记本电脑，这样我就能录下音符信息。"},{"en":"The song file is MIDI, so it sounds different on different instruments.","zh":"这个歌曲文件是 MIDI，所以用不同音色/乐器播放时听起来会不一样。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to, using, or produced with MIDI data or devices.","zh":"与 MIDI 有关的；使用 MIDI 数据或设备的。"},"examples":[{"en":"I downloaded a MIDI controller app for practice.","zh":"我下载了一个 MIDI 控制器应用来练习。"},{"en":"Can you export a MIDI track from this project?","zh":"你能从这个工程导出一条 MIDI 轨道吗？"}]}],"synonyms":["Musical Instrument Digital Interface","MIDI protocol"],"phonetic":"/ˈmɪdi/","extraExplanation":["MIDI 是 Musical Instrument Digital Interface 的缩写，最早在 1980 年代初被制定为行业标准（常见说法是 1983 年发布），目的是让不同品牌的电子乐器“互相听懂”。","学习时记住：MIDI 不是音频（不是声音波形），更像是“乐谱/演奏指令”（例如：第几拍按下哪个音、力度多大、踏板开关等）。因此同一个 MIDI 文件在不同音源（音色库、合成器）上会听起来不同。","常见相关词：MIDI controller（MIDI 控制器，用来输入控制信息）、MIDI file（MIDI 文件）、MIDI track（MIDI 轨）、MIDI interface（MIDI 接口/连接设备）。"]}
{"word":"midianite","summary":{"en":"A Midianite is a person from the ancient people of Midian mentioned in the Bible; it can also mean “of Midian.”","zh":"Midianite 指《圣经》中提到的古代米甸民族的人，也可作形容词表示“米甸的/米甸人的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Midianites, an ancient people mentioned in the Hebrew Bible, traditionally associated with the region east of the Jordan River and the Sinai/northwest Arabian area","zh":"米甸人；《希伯来圣经/旧约》中提到的古代民族之一，传统上与约旦河以东以及西奈/阿拉伯西北地区有关"},"examples":[{"en":"In the Bible, Moses lived among the Midianites for a time after leaving Egypt.","zh":"在《圣经》中，摩西离开埃及后曾在米甸人中生活过一段时间。"},{"en":"Some stories describe conflicts between Israelites and Midianites.","zh":"一些故事描述了以色列人与米甸人之间的冲突。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Midian or the Midianites","zh":"米甸的；米甸人的"},"examples":[{"en":"The passage uses Midianite characters to show the political tensions of the time.","zh":"这段经文用米甸人角色来呈现当时的政治紧张局势。"},{"en":"Scholars debate the historical background of Midianite culture.","zh":"学者们会讨论米甸文化的历史背景。"}]}],"synonyms":["(historical/religious) member of Midian","(adj.) Midian (rare)"],"phonetic":"/ˈmɪdiəˌnaɪt/","extraExplanation":["“Midianite”主要出现在宗教与历史语境，尤其是《旧约》相关叙事中（如摩西与叶忒罗/耶特罗的故事等）。现代英语里它通常不是日常词汇，多见于圣经研究、历史地理或文学改写作品。","拼写提示：Midian（米甸）+ -ite（表示“……的人/……的”），类似的构词还有 Israelite（以色列人/以色列的）。"]}
{"word":"midianitish","summary":{"en":"“Midianitish” means “of or related to Midian/the Midianites,” mainly used in Bible-related or older literary contexts.","zh":"“midianitish”意为“米甸（人）的、与米甸人有关的”，多用于《圣经》相关或较旧的文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Midian or the Midianites, an ancient people mentioned in the Bible.","zh":"与米甸（Midian）或米甸人（Midianites）有关的；《圣经》中提到的古代民族的。"},"examples":[{"en":"The story describes a Midianitish camp in the desert.","zh":"故事描写了沙漠中的一个米甸人的营地。"},{"en":"Some older translations use “Midianitish” where modern ones prefer “Midianite.”","zh":"一些较早的译本用“Midianitish”，而现代译本更常用“Midianite（米甸人/米甸的）”。"}]}],"synonyms":["Midianite","of Midian"],"phonetic":"/ˌmɪdiəˈnaɪtɪʃ/","extraExplanation":["“Midianitish”是较少见、较偏旧式的形容词形式，更常见的是“Midianite”（既可作名词“米甸人”，也可作形容词“米甸的”）。","米甸在《旧约》中多次出现：例如摩西曾逃到米甸并在那里生活（出埃及记），以色列人与米甸人也发生过冲突（士师记）。因此该词多见于宗教、历史或文学语境。"]}
{"word":"midicoat","summary":{"en":"A midicoat is a midi-length (mid-calf) coat.","zh":"midicoat 指长度到小腿中部左右的中长款外套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coat with a midi length—usually falling below the knee and around mid-calf (between knee-length and ankle-length).","zh":"中长款外套；长度通常在膝盖以下、到小腿中部左右（介于及膝与及踝之间）。"},"examples":[{"en":"She wore a camel midicoat with ankle boots.","zh":"她穿了一件驼色中长外套，配踝靴。"},{"en":"A midicoat is practical in cool weather because it covers more than a short coat.","zh":"中长外套在凉爽天气很实用，因为它比短外套遮得更多。"}]}],"synonyms":["midi coat","midi-length coat","mid-calf coat","long coat"],"phonetic":"ˈmɪdi koʊt","extraExplanation":["“midi-”来自时尚里对长度的分类：mini（超短）、midi（中长）、maxi（超长）。midi 常指裙装或外套长度到小腿肚附近，因此 midicoat 多见于服装电商、穿搭博主或商品描述中。","拼写上也常见作 “midi coat”（分开写）或 “midi-length coat”。"]}
{"word":"mididae","summary":{"en":"Mydidae is the scientific name for the family of large flies known as mydas flies.","zh":"Mydidae（常被误写成 mididae）是“巨虻科”的学名，指一类体型较大的拟胡蜂样双翅目昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of large flies (order Diptera), often called mydas flies; many species look wasp-like and some adults visit flowers","zh":"（昆虫）巨虻科：双翅目中一类体型较大的苍蝇类昆虫，常称“拟胡蜂蝇/巨虻（mydas flies）”；许多种外形像胡蜂，成虫常到花上取食"},"examples":[{"en":"Mydidae are sometimes mistaken for wasps because of their size and color patterns.","zh":"巨虻科的昆虫因为体型和花纹，常常会被误认成胡蜂。"},{"en":"The naturalist photographed a Mydidae fly resting on a wildflower.","zh":"那位博物学家拍到一只巨虻科昆虫停在野花上。"}]}],"synonyms":["mydas flies","mydas fly family"],"phonetic":"/ˈmaɪdɪdiː/","extraExplanation":["你输入的“mididae”很可能是拼写误差；更常见的科学拼写是 **Mydidae**（巨虻科），读音接近“MY-dih-dee”。","在英文里，动物分类学中以 **-idae** 结尾通常表示“科”（family），如 Felidae（猫科）。","如果你原本想查的是神话中的 **Midas（迈达斯）** 或音乐里的 **MIDI**，告诉我具体语境，我可以改为对应词条。"]}
{"word":"midified","summary":{"en":"“Modified” means changed from the original, usually slightly, to improve or adapt it.","zh":"“modified”指在原来的基础上做了（通常是小幅的）修改或调整，以改进或适应需要。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changed slightly to improve it, make it fit a situation, or make it different from the original","zh":"（为改进或适应情况而）被修改的；改动过的"},"examples":[{"en":"This is a modified version of the original plan.","zh":"这是原计划的修改版。"},{"en":"We used a modified recipe to make it less sweet.","zh":"我们用了一个改过的食谱，让它没那么甜。"},{"en":"The car has a modified engine.","zh":"这辆车的发动机被改装过。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “modify”: to change something slightly","zh":"modify 的过去式/过去分词：对……作小幅修改；调整"},"examples":[{"en":"The teacher modified the assignment for younger students.","zh":"老师为年纪更小的学生调整了作业。"},{"en":"The document was modified after the meeting.","zh":"会议后文件被修改了。"}]}],"synonyms":["changed","adjusted","altered","revised","adapted"],"phonetic":"/ˈmɑːdɪˌfaɪd/","extraExplanation":["你输入的 **midified** 很可能是拼写错误，正确拼写通常是 **modified**。","词根是 **modify**（修改、调整），常见搭配：**modified version**（修改版）、**modified diet**（调整后的饮食）、**modified schedule**（调整后的时间表）、**genetically modified (GM)**（转基因的）。"]}
{"word":"midinette","summary":{"en":"Midinette means a (traditionally Parisian) young shopgirl or seamstress, stereotyped as romantic and naïve; it can also be a sometimes dismissive label for a fashion-focused young woman.","zh":"Midinette 指（传统上巴黎的）年轻女店员或女裁缝，常带“浪漫天真”的刻板印象；也可（有时带轻视）指偏时尚、爱浪漫幻想的年轻女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in France) a young working-class woman, often a shop assistant or seamstress, traditionally imagined as romantic and naïve.","zh":"（尤指法国）“小女工/小店员”，常指年轻的售货员或女裁缝，传统印象里较浪漫、天真。"},"examples":[{"en":"The novel portrays a Paris midinette dreaming of love and a better life.","zh":"小说刻画了一位巴黎“midinette”，梦想爱情与更好的生活。"},{"en":"In old films, the midinette is often shown leaving the atelier at lunchtime.","zh":"在老电影里，midinette 常被拍成中午从制衣作坊出来的女孩。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension, sometimes dismissive) a young woman whose style and interests are associated with fashion, light entertainment, and romantic ideals.","zh":"（引申义，有时带轻视）指兴趣与形象偏时尚、爱轻松娱乐与浪漫幻想的年轻女性。"},"examples":[{"en":"Some critics used the term midinette to dismiss her as shallow, though she was very capable.","zh":"一些评论者用 midinette 轻视她肤浅，但其实她很能干。"},{"en":"The magazine targeted midinettes with fashion tips and love stories.","zh":"这本杂志用穿搭建议和爱情故事吸引“midinettes”。"}]}],"synonyms":["shopgirl","seamstress","young working woman","grisette (historical/France)"],"phonetic":"/ˌmɪdɪˈnɛt/","extraExplanation":["这个词来自法语 midinette：midi（中午）+ dinette（小餐/小吃）。原指巴黎制衣女工中午短暂外出吃点东西的情景，后来逐渐成为一种带有时代色彩的社会形象标签。","语气提示：在英文里使用 midinette 往往有“旧时刻板印象”的味道，可能显得轻佻或带偏见；写作时可用更中性的表达，如 young shop assistant / seamstress / young working woman。"]}
{"word":"midinettes","summary":{"en":"Midinettes are (originally) young Parisian shopgirls or seamstresses, and by extension can mean a naïve, romantic young woman.","zh":"Midinettes 原指巴黎的年轻女店员或女裁缝，也可引申为天真浪漫的年轻女子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"young Parisian shopgirls or seamstresses (especially in fashion), traditionally imagined as modestly paid and going out at lunchtime","zh":"（尤指时尚行业的）巴黎年轻女店员或女裁缝；传统印象中收入不高、午休时外出用餐的女孩"},"examples":[{"en":"In early 20th-century Paris, midinettes often worked long hours in dressmaking shops.","zh":"在20世纪初的巴黎，midinettes 常常在制衣店里长时间工作。"},{"en":"The novel describes crowds of midinettes leaving the ateliers at noon.","zh":"小说描写了中午从工作室涌出的 midinettes 人潮。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) a young woman seen as naïve, romantic, or easily impressed","zh":"（引申）被认为天真、浪漫、容易受打动的年轻女性"},"examples":[{"en":"He spoke of her dreams with a midinette-like innocence.","zh":"他形容她的梦想带着一种“midinette式”的天真。"},{"en":"The film plays on the midinette stereotype of a girl falling for a glamorous life.","zh":"这部电影借用了“midinette刻板印象”：女孩向往并爱上浮华生活。"}]}],"synonyms":["shopgirl","seamstress","young woman","working girl (dated)"],"phonetic":"/ˌmɪdiˈnɛts/","extraExplanation":["这是从法语借词（单数 midinette，复数 midinettes）。词源常被解释为 midi（正午）+ dinette（小餐/小点心），暗示这些女工在中午短暂休息时去买便宜午餐。","在文化语境里，它既可指真实的巴黎服装业女工群体，也常带有时代性的“浪漫化/幼稚化”想象；现代写作中使用时要注意可能的刻板印象色彩。"]}
{"word":"midiron","summary":{"en":"A midiron is a middle-range golf iron used for medium-distance shots.","zh":"midiron 指高尔夫的中号铁杆，用于中距离击球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a golf club in the middle range of irons (roughly between a short iron and a long iron), used for medium-distance shots","zh":"（高尔夫）中号铁杆；介于短铁杆与长铁杆之间的铁杆，用于中距离击球"},"examples":[{"en":"He chose a midiron for the approach shot to the green.","zh":"他用一支中号铁杆来打进果岭的攻果岭球。"},{"en":"A midiron can help you control both distance and height on a mid-range shot.","zh":"中号铁杆能帮助你在中距离击球时同时控制距离和弹道高度。"}]}],"synonyms":["middle iron","mid-iron"],"phonetic":"/ˈmɪdˌaɪɚn/","extraExplanation":["“midiron”在现代高尔夫里不算特别常用的说法，更常见的是直接说“a 6-iron / 7-iron / 8-iron”等。它带有较传统的口吻，在旧式的高尔夫写作或讲解中更容易看到。","大致可以把“midiron”理解为中间编号的铁杆（常见约 5—8 号铁），用于中等距离、需要一定精准度与可控弹道的击球情境。"]}
{"word":"midirons","summary":{"en":"“Midirons” are medium-loft golf irons used for medium-distance shots, often around the 5–7 irons.","zh":"“Midirons”指中号铁杆，用于中等距离击球，常大致对应5～7号铁杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Golf) Irons with a medium loft, typically used for medium-distance approach shots (often around the 5–7 irons).","zh":"（高尔夫）中号铁杆：杆面倾角适中，常用于中等距离的攻果岭击球（通常指5～7号铁杆左右）。"},"examples":[{"en":"He hit a controlled shot with a midiron to land the ball on the front of the green.","zh":"他用一支中号铁杆打出可控的一击，让球落在果岭前部。"},{"en":"On this hole, a midiron is usually enough from the fairway.","zh":"在这个洞，从球道上用中号铁杆通常就够了。"}]}],"synonyms":["mid-irons","mid irons"],"phonetic":"ˈmɪdˌaɪərnz","extraExplanation":["“midirons”通常写作“mid-irons”或“mid irons”，是“mid-iron”的复数。高尔夫球杆中的铁杆一般按号数区分：号数越小（如3、4号）越“长”（倾角更小、距离更远），号数越大（如8、9号、挖起杆）越“短”（倾角更大、飞行更高、距离更短）。中号铁杆多用于攻果岭或需要兼顾距离与落点控制的场景。"]}
{"word":"midis","summary":{"en":"“Midis” can mean multiple MIDI music-data files, or multiple midi-length skirts/dresses (between knee and ankle).","zh":"“Midis”既可指多个 MIDI 音乐数据文件，也可指多件中长（膝盖到脚踝之间）长度的裙装/衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of MIDI: digital music data (often as “MIDI files”) used to control electronic instruments or music software, storing notes and performance instructions rather than recorded sound.","zh":"MIDI 的复数：指用于控制电子乐器或音乐软件的数字音乐数据（常说 “MIDI files”），记录音符与演奏指令，而不是直接录制的声音。"},"examples":[{"en":"I downloaded a few midis to practice the piano part.","zh":"我下载了几个 MIDI 文件来练习钢琴声部。"},{"en":"These midis work well with most music apps.","zh":"这些 MIDI 文件在大多数音乐应用里都能很好使用。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of midi: clothes (especially skirts or dresses) with a length between the knee and the ankle.","zh":"midi 的复数：指长度介于膝盖与脚踝之间的服装（尤指中长裙/连衣裙）。"},"examples":[{"en":"She prefers midis for work because they look polished.","zh":"她上班更喜欢穿中长款，因为看起来更利落得体。"},{"en":"Midis are popular in spring collections.","zh":"中长款在春季系列里很常见。"}]}],"synonyms":["MIDI files","sequencer files","midi skirts","midi dresses"],"phonetic":"/ˈmɪdi/","extraExplanation":["“MIDI”是缩写，来自 Musical Instrument Digital Interface（乐器数字接口）。日常写作里常全大写 MIDI；口语里也有人把它当普通名词说“a midi / some midis”。","在服装语境中，“midi”通常不大写，指“中长（长度）”，与 mini（超短）和 maxi（长款）相对。"]}
{"word":"midiskirt","summary":{"en":"A midi skirt is a mid-length skirt, usually between the knee and ankle.","zh":"midi skirt 指中长裙，长度通常在膝盖与脚踝之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A skirt with a hemline that falls between the knee and the ankle, often around the mid-calf (also written “midi skirt”).","zh":"中长裙：裙摆长度介于膝盖与脚踝之间，常见到小腿中部（也可写作“midi skirt”）。"},"examples":[{"en":"She wore a black midi skirt with a white blouse to the office.","zh":"她穿了一条黑色中长裙，配白衬衫去上班。"},{"en":"A midi skirt can look both casual with sneakers and dressy with heels.","zh":"中长裙搭运动鞋很休闲，搭高跟鞋又很正式。"}]}],"synonyms":["midi skirt","mid-length skirt","calf-length skirt"],"phonetic":"/ˈmɪdi skɝːt/","extraExplanation":["“Midi”来自表示“中间”的概念（mid-），在时尚里用来指介于迷你裙（mini）和长裙（maxi）之间的长度。","写法上更常见的是分开写“midi skirt”，而“midiskirt”较少见，多出现在商品标题或标签中。"]}
{"word":"midland","summary":{"en":"Midland means an inland central region; in the UK, “the Midlands” specifically refers to central England.","zh":"midland 指内陆的中部地区；在英国，“the Midlands”特指英格兰中部（米德兰兹）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in the middle of a country, away from the coast","zh":"（国家的）中部地区；内陆地区（远离海岸）"},"examples":[{"en":"Many factories moved from the coast to the Midlands.","zh":"许多工厂从沿海搬到了中部内陆地区。"},{"en":"She grew up in the midlands, far from the sea.","zh":"她在内陆中部地区长大，离海很远。"}]},{"partOfSpeech":"adj.","definition":{"en":"connected with the central part of a country; inland","zh":"中部的；内陆的（与国家中部相关的）"},"examples":[{"en":"A midland town can feel quieter than a coastal city.","zh":"一座内陆中部的小城可能比沿海城市更安静。"},{"en":"They took a midland route to avoid heavy traffic near the coast.","zh":"他们走了内陆中部路线，以避开沿海一带的拥堵。"}]},{"partOfSpeech":"n.","definition":{"en":"(Midlands) a major region of England, often divided into the West Midlands and East Midlands","zh":"（Midlands）英格兰的一个重要区域，常分为西米德兰兹和东米德兰兹"},"examples":[{"en":"Birmingham is a major city in the West Midlands.","zh":"伯明翰是西米德兰兹的重要城市。"},{"en":"They traveled across the Midlands by train.","zh":"他们乘火车穿越英格兰中部地区（米德兰兹）。"}]}],"synonyms":["inland","central","interior"],"phonetic":"/ˈmɪdlənd/","extraExplanation":["“midland”由 mid（中间的）+ land（土地）构成，字面意思就是“中间的土地/内陆”。","在英式英语中，“the Midlands”常特指英格兰中部地区，历史上与工业革命、制造业和工人阶级文化联系紧密。","大小写会影响含义：midlands（普通名词）泛指某国的内陆中部；Midlands（专有名词）多指英格兰的米德兰兹地区。"]}
{"word":"midlander","summary":{"en":"A Midlander is a person from the Midlands, especially central England.","zh":"Midlander 指来自中部地区的人，尤其常指来自英格兰中部（Midlands）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Midlands (the central region of a country, especially England).","zh":"（尤指英格兰）来自中部地区（Midlands）的人；中部地区居民。"},"examples":[{"en":"She’s a proud Midlander from Birmingham.","zh":"她是来自伯明翰的骄傲中部人。"},{"en":"Some Midlanders speak with accents that differ from London English.","zh":"一些中部地区的人说话口音与伦敦英语不同。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from a country’s central region (used more generally, though less common than the England-specific sense).","zh":"（较不常见）来自某国中部地区的人。"},"examples":[{"en":"He called himself a Midlander, meaning he grew up in the country’s central provinces.","zh":"他称自己为“中部人”，意思是他在该国的中部省份长大。"}]}],"synonyms":["Midlands resident","central English person","person from the Midlands"],"phonetic":"/ˈmɪdˌlændɚ/","extraExplanation":["“Midlands”在英国语境里最常指英格兰的中部地区（如伯明翰、诺丁汉、莱斯特等城市周边）。因此“Midlander”在英式英语中最常见的用法就是“英格兰中部人”。在其他国家语境里也可泛指“中部地区的人”，但需要上下文来明确是哪一个国家的中部。","有时“Midlander”也会带一点身份认同色彩，类似强调“我是中部地区长大的/代表中部地区的文化与口音”。"]}
{"word":"midlandize","summary":{"en":"Midlandize means to make something (especially speech) more like the Midlands, or to shift toward Midland dialect features.","zh":"midlandize 指使（尤指语言/口音）更像中部地区的特点，或语言使用向中部方言特征转变。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something characteristic of the Midlands (a central region), especially by adopting Midland accents, vocabulary, or other features","zh":"使（某事物）具有中部地区（Midlands）的特点；尤指在口音、用词等方面“中部化”"},"examples":[{"en":"The presenter gradually midlandized his accent to sound more local.","zh":"这位主持人逐渐把口音“中部化”，让自己听起来更像当地人。"},{"en":"Some writers midlandize dialogue to reflect where a character grew up.","zh":"有些作家会把人物对白“中部化”，用来体现角色的成长地区。"}]},{"partOfSpeech":"vi.","definition":{"en":"(linguistics) to shift toward Midland dialect patterns, rather than Northern or Southern ones","zh":"（语言学）向中部方言特征转变（相对北方或南方方言）"},"examples":[{"en":"In some communities, younger speakers have midlandized over time.","zh":"在一些社群里，年轻人的语言使用随着时间逐渐出现“中部化”的变化。"},{"en":"The study tracks how vowels midlandize across neighboring counties.","zh":"这项研究追踪相邻郡县之间元音如何发生“中部化”。"}]}],"synonyms":["regionalize","localize","standardize (context-dependent)","adopt a Midland accent","shift toward Midland features"],"phonetic":"/ˈmɪdləndˌaɪz/","extraExplanation":["“Midlands”常指英格兰的中部地区（如伯明翰一带）；在美国英语研究里，“Midland”也指美国中部的一些方言带（如宾夕法尼亚西部、俄亥俄等地区的部分口音/用法）。因此 midlandize 多见于讨论口音、方言、语言风格的语境。","词形结构：Midland + -ize（表示“使……化/使成为……”）。该词较少见，更常用的表达是 “adopt a Midland accent/dialect” 或 “shift toward Midland features”。"]}
{"word":"Midlands","summary":{"en":"The Midlands usually means the central region of England (West Midlands and East Midlands).","zh":"Midlands 通常指英格兰中部地区（分为西米德兰兹与东米德兰兹）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central part of England, often divided into the West Midlands and the East Midlands","zh":"英格兰的中部地区（常分为西米德兰兹与东米德兰兹）"},"examples":[{"en":"She grew up in the Midlands before moving to London.","zh":"她在米德兰兹地区长大，后来搬到伦敦。"},{"en":"The Midlands has many cities linked to Britain’s industrial history.","zh":"米德兰兹地区有许多与英国工业历史相关的城市。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle part of a country or region (used especially in names like “the Midlands”)","zh":"某个国家或地区的中部（多用于专有名称，如“the Midlands”）"},"examples":[{"en":"The storm is expected to move across the midlands overnight.","zh":"预计这场风暴将于夜间穿过中部地区。"}]}],"synonyms":["central England","the heart of England (informal)"],"phonetic":"/ˈmɪdləndz/","extraExplanation":["在英国语境中，“the Midlands”通常特指英格兰中部。常见分区是West Midlands（以伯明翰 Birmingham、考文垂 Coventry 等为代表）与East Midlands（如诺丁汉 Nottingham、莱斯特 Leicester、德比 Derby）。","该地区在18—19世纪工业革命中非常重要，因此在英国文化中常与“制造业、工业城市、运河与铁路发展”等历史印象联系在一起。"]}
{"word":"midlands","summary":{"en":"Midlands usually refers to central England (East/West Midlands). More generally, it can mean a country’s middle districts.","zh":"Midlands 通常指英格兰中部（东/西米德兰兹）；更广义时也可指某地的“中部地区”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A large region in central England, often divided into the West Midlands and the East Midlands.","zh":"（专有名词）英格兰中部的一个大区域，常分为西米德兰兹与东米德兰兹。"},"examples":[{"en":"She grew up in the Midlands before moving to London for work.","zh":"她在英格兰中部（米德兰兹）长大，后来为了工作搬到伦敦。"},{"en":"The Midlands has a long industrial history, especially around Birmingham and Coventry.","zh":"米德兰兹地区有悠久的工业历史，尤其是在伯明翰和考文垂一带。"}]},{"partOfSpeech":"n.","definition":{"en":"(general use, sometimes with “the”) The central area of a country or region; middle districts (less common than the UK meaning).","zh":"（一般用法，有时与 the 连用）某个国家或地区的中部地带；中部各区（不如“英格兰中部”这一含义常见）。"},"examples":[{"en":"Storms moved across the midlands overnight.","zh":"暴风雨在夜间横扫中部地区。"},{"en":"He covers farming news from the midlands and the southern counties.","zh":"他报道来自中部地区和南部郡的农业新闻。"}]}],"synonyms":["central England","the English Midlands","middle districts","central region"],"phonetic":"/ˈmɪd.ləndz/","extraExplanation":["在英国语境里，Midlands 往往默认指“英格兰中部”，是地理与文化概念：既包括重要城市（如 Birmingham 伯明翰、Nottingham 诺丁汉、Leicester 莱斯特），也常与工业革命、运河与制造业传统联系在一起。","写作中常见搭配：the East Midlands / the West Midlands；形容词形式可写作 Midland（如 Midland accent “米德兰兹口音”）。"]}
{"word":"midlandward","summary":{"en":"“Midlandward” means “toward the Midlands or inland,” and can be used as an adverb or an adjective.","zh":"“midlandward”表示“朝米德兰兹（英格兰中部）或朝内陆方向”，可作副词或形容词使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the Midlands (the central region of England), or toward the interior (inland), rather than toward the coast.","zh":"朝向英格兰的米德兰兹地区（中部），或更泛指朝内陆方向（远离海岸）。"},"examples":[{"en":"The storm system moved midlandward overnight, bringing rain to central counties.","zh":"这股风暴系统在夜间向内陆（中部）推进，给中部郡县带来降雨。"},{"en":"People fled from the shoreline, traveling midlandward to safer ground.","zh":"人们从海岸线撤离，向内陆方向前往更安全的地方。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located in or moving toward the Midlands; inland-facing.","zh":"位于米德兰兹（中部）或朝向中部/内陆的；面向内陆的。"},"examples":[{"en":"The midlandward side of the town was less affected by coastal winds.","zh":"小镇靠内陆的一侧较少受到海风影响。"},{"en":"They took a midlandward route to avoid the flooded coastal road.","zh":"他们选择了一条向内陆的路线，以避开被淹的沿海道路。"}]}],"synonyms":["inland","landward","toward the interior","toward central regions"],"phonetic":"/ˈmɪdləndwɚd/","extraExplanation":["“midlandward”是一个较少见、偏书面/地理描述的词，常见于天气报道、地形叙述或历史/文学性的描写。","构词思路：midland（中部/内陆）+ -ward（表示“朝……方向”）。类似的还有：seaward（向海的）、landward（向陆地的）、homeward（回家的）。","在英国语境里，“the Midlands”指英格兰中部地区；在更一般的语境中，它也可按“向内陆”来理解，具体以文本背景为准。"]}
{"word":"midlatitude","summary":{"en":"Midlatitude refers to the Earth’s temperate zone between the tropics and the poles (about 30°–60° N or S).","zh":"midlatitude 指地球上介于热带与极地之间的中纬度（约北纬/南纬30°–60°），多为温带地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the region of the Earth between the tropics and the polar areas (about 30°–60° north or south), where many temperate climates are found","zh":"（地理）中纬度地区：位于热带与极地之间的地带（约北纬/南纬30°–60°），常见温带气候"},"examples":[{"en":"Japan lies in the midlatitudes and has four distinct seasons.","zh":"日本位于中纬度地区，四季分明。"},{"en":"Most midlatitude weather is shaped by moving storm systems.","zh":"中纬度的大部分天气受移动的风暴系统影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the midlatitudes (about 30°–60° north or south)","zh":"中纬度的；与中纬度（约北纬/南纬30°–60°）有关的"},"examples":[{"en":"Midlatitude cyclones often bring rain and strong winds.","zh":"中纬度气旋常带来降雨和大风。"},{"en":"Scientists study midlatitude forests to understand climate change.","zh":"科学家研究中纬度森林以了解气候变化。"}]}],"synonyms":["temperate zone","middle latitudes"],"phonetic":"/ˌmɪdˈlætəˌtudz/","extraExplanation":["该词常见于气象与地理语境，也常写作 mid-latitude(s)。中纬度地区受“西风带”影响明显，因此天气变化较快、锋面与温带气旋活动频繁。","在学术写作中，midlatitudes 往往用复数，强调“这一整片纬度带”而非单一点位。"]}
{"word":"midleg","summary":{"en":"Midleg most commonly means an insect’s middle leg; more rarely it can refer to a mid-calf leg length (often written “mid-leg”).","zh":"midleg最常指昆虫的中足；较少情况下可指到小腿中部的长度（常写作“mid-leg”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle leg of an insect or other six-legged arthropod (the leg attached to the middle body segment)","zh":"（昆虫等六足节肢动物的）中足；中间那一对腿（连接在身体中段）"},"examples":[{"en":"Ants use the midleg to help stabilize their body while carrying food.","zh":"蚂蚁在搬运食物时会用中足来帮助稳定身体。"},{"en":"The researcher compared the front leg, midleg, and hind leg under a microscope.","zh":"研究人员在显微镜下比较了前足、中足和后足。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the middle part of a leg, or a trouser leg that ends around the middle of the lower leg","zh":"（较少用）腿的中段；（裤子）裤腿长度到小腿中部的款式"},"examples":[{"en":"These pants are cut at midleg, so they look shorter than full-length trousers.","zh":"这条裤子的裤腿到小腿中部，所以看起来比长裤短。"}]}],"synonyms":["middle leg","mid-leg","mesothoracic leg"],"phonetic":"/ˈmɪdˌlɛɡ/","extraExplanation":["“midleg”在日常英语中不常见，更常见的写法是带连字符的“mid-leg”，尤其在描述长度（例如裤腿长度）时。","在昆虫学/动物学语境中，“midleg”最常指“三对足”中的“中足”，常与“foreleg（前足）”“hind leg（后足）”一起使用；较正式的术语也可见“middle leg”或“mesothoracic leg（中胸足）”。"]}
{"word":"midlegs","summary":{"en":"“Midlegs” means the middle pair of an insect’s six legs.","zh":"“midlegs”指昆虫六足中间的那一对（中足）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle pair of legs on an insect or other six-legged animal (between the front legs and hind legs)","zh":"（昆虫等六足动物的）中足；位于前足与后足之间的那一对腿"},"examples":[{"en":"In grasshoppers, the hind legs are for jumping, while the midlegs help with walking and balance.","zh":"在蚱蜢中，后足用于跳跃，而中足帮助行走并保持平衡。"},{"en":"The insect cleaned its antennae using its front legs, then shifted its weight onto its midlegs.","zh":"这只昆虫用前足清理触角，然后把重心移到中足上。"}]}],"synonyms":["middle legs","mesothoracic legs"],"phonetic":"/ˈmɪdˌlɛɡz/","extraExplanation":["“midlegs”常见于生物学/昆虫学语境，通常与“forelegs（前足）”“hind legs（后足）”一起出现，用来描述昆虫三对足的不同功能与位置。","日常英语里更常写作“mid legs”或“middle legs”。在学术或科普材料中，为了简洁也会连写成“midlegs”。"]}
{"word":"midlenting","summary":{"en":"“Midlenting” is a rare word meaning “mid-Lent”—something happening in, or related to, the middle of Lent.","zh":"“midlenting”是个罕见词，大致相当于“mid-Lent（四旬期中期）”，指发生在四旬期中段或与其相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Happening in the middle of Lent; related to the mid-Lent period in the Christian calendar.","zh":"（罕见）发生在四旬期（Lent）中段的；与“四旬期中期/半四旬期”有关的。"},"examples":[{"en":"Some old church calendars mention midlenting services and readings.","zh":"一些旧式教会历（礼仪历）会提到“midlenting”的礼拜与读经安排。"},{"en":"They chose a midlenting Sunday for a quieter celebration.","zh":"他们选在四旬期中段的主日做一个更安静的庆祝。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The mid-Lent time or events held during it.","zh":"（罕见）四旬期中段这一段时间；或在此期间举行的活动。"},"examples":[{"en":"In the village record, “midlenting” was noted as a day of lighter fasting.","zh":"在村庄的记录里，“midlenting”被记为一个斋戒稍微放宽的日子。"}]}],"synonyms":["mid-Lent","Laetare Sunday (contextual)"],"phonetic":"/ˌmɪdˈlɛntɪŋ/","extraExplanation":["“midlenting”非常少见，更多时候会写作“mid-Lent”（四旬期中期）或直接说“Laetare Sunday”（四旬期第四主日）。在一些传统中，这一天象征斋期中短暂的喜乐与放宽（例如礼仪颜色可能用玫瑰色）。","如果你是在现代语境写作，通常用“mid-Lent”更自然；“midlenting”更像历史文本或地方性用法。"]}
{"word":"midlife","summary":{"en":"Midlife is the middle stage of adulthood (often 40–60), and it can also describe things related to that period.","zh":"midlife 指成年中期（常为40–60岁左右），也可作形容词表示“中年的、与中年有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle period of adulthood, usually about ages 40–60, when people often reassess goals, work, health, or family life.","zh":"中年时期；人生中段（通常指40–60岁左右），人们常会重新思考目标、工作、健康或家庭。"},"examples":[{"en":"In midlife, he started exercising more and sleeping better.","zh":"到了中年，他开始更多锻炼，睡得也更好了。"},{"en":"She made a midlife career change and became a teacher.","zh":"她在中年转行，成为了一名老师。"},{"en":"Many people in midlife think about what they want for the next chapter of life.","zh":"很多人在中年会思考人生下一个阶段想要什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the middle years of adulthood.","zh":"中年的；与人生中段有关的。"},"examples":[{"en":"He went through a midlife crisis and bought a sports car.","zh":"他经历了中年危机，买了一辆跑车。"},{"en":"Midlife health checks can help prevent future problems.","zh":"中年的健康检查有助于预防未来的问题。"}]}],"synonyms":["middle age","middle-aged years"],"phonetic":"/ˈmɪdˌlaɪf/","extraExplanation":["“midlife”常出现在固定搭配“midlife crisis”（中年危机）中：指人在中年因对衰老、成就、人生意义等焦虑而做出冲动改变（如突然换工作、买昂贵物品等）。但并不是每个人都会经历，现代语境也常强调“midlife transition / midlife renewal”（中年转型/重启），更偏积极。"]}
{"word":"midline","summary":{"en":"Midline means the central dividing line, especially the line down the middle of the body.","zh":"Midline 指中线，尤指身体正中将左右分开的那条假想线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An imaginary line that divides something into left and right halves, especially down the center of the body or an object.","zh":"（尤指身体或物体的）中线；将左右两侧分开的假想线。"},"examples":[{"en":"Keep your shoulders level and your head centered over your midline.","zh":"保持肩膀水平，头部居中对齐身体的中线。"},{"en":"The scar runs along the midline of his chest.","zh":"疤痕沿着他胸部的中线延伸。"}]},{"partOfSpeech":"n.","definition":{"en":"In anatomy and medicine, the central line of the body used to describe locations (for example, structures near the midline).","zh":"（解剖/医学）用于描述位置的身体中央基准线（如“靠近中线”的结构）。"},"examples":[{"en":"Pain near the midline can suggest a different cause than pain on one side.","zh":"靠近中线的疼痛可能提示与单侧疼痛不同的原因。"},{"en":"The doctor noted a midline swelling.","zh":"医生记录到一个位于中线的肿胀。"}]}],"synonyms":["center line","median line","midline axis"],"phonetic":"/ˈmɪdˌlaɪn/","extraExplanation":["midline 常见于运动训练、舞蹈、物理治疗、瑜伽等语境，强调“身体左右对称的中轴”。在儿童发展或康复训练中也会提到“跨越中线（cross the midline）”，指手或脚越过身体中央去完成动作（如右手去拿左边的物品），常被用来描述协调性与双侧整合能力。"]}
{"word":"midlines","summary":{"en":"Midlines are lines through the middle of something; in medicine they often mean the body’s center line.","zh":"midlines 指“中线/正中线”；在医学中常指身体的正中线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A line that runs through the middle of something, dividing it into two equal or nearly equal halves.","zh":"穿过某物中间、把它分成两个相等或大致相等部分的线（中线）。"},"examples":[{"en":"Draw a midline to split the shape into two equal parts.","zh":"画一条中线，把这个图形分成两个相等的部分。"},{"en":"The designer aligned the buttons along the shirt’s midline.","zh":"设计师把纽扣沿着衬衫的中线对齐。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy/medicine) An imaginary line down the center of the body, used to describe the position of organs or injuries (left/right of the midline).","zh":"（解剖/医学）身体正中间的一条想象线，用来描述器官或伤口在“中线左侧/右侧”的位置。"},"examples":[{"en":"The pain is just to the right of the midline.","zh":"疼痛点就在中线的右侧。"},{"en":"The scan shows the mass crossing the midline.","zh":"影像显示肿块跨过了中线。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports) A center dividing line on a playing court or field, used for positioning or rules.","zh":"（运动）球场/场地中间的分隔线，用于站位或比赛规则。"},"examples":[{"en":"Players must stay behind the midline during the serve.","zh":"发球时，队员必须站在中线后面。"}]}],"synonyms":["centerline","median line","center line"],"phonetic":"ˈmɪdˌlaɪn","extraExplanation":["“midlines”是名词复数，单数是“midline”。在医学语境里很常见的搭配是“left/right of the midline（在中线左/右）”和“cross the midline（跨过中线）”。","日常写作中也会用“centerline”表达类似意思；在技术/工程语境里，“midline”常强调“位于正中、用于对齐或测量的基准线”。"]}
{"word":"midlives","summary":{"en":"“Midlives” means the middle years of life (plural of “midlife”).","zh":"“midlives”指人生的中年阶段，是“midlife”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “midlife”: the middle period of people’s lives (roughly ages 40–60), often associated with reflection, change, or reassessment.","zh":"“midlife”的复数：人生的中年阶段（大约40—60岁），常与反思、变化或重新评估有关。"},"examples":[{"en":"Many people in their midlives start thinking more about health and long-term goals.","zh":"许多人在中年阶段会更常思考健康和长期目标。"},{"en":"The novel follows two friends through their midlives, showing how their priorities change.","zh":"这部小说描写两位朋友在中年时期的经历，展现他们的重心如何改变。"}]}],"synonyms":["middle age","middle years"],"phonetic":"/ˈmɪdˌlaɪvz/","extraExplanation":["“midlives”并不算非常常见的独立词条；更常见的是用“midlife”（单数）或表达年龄段时用“in one’s midlife / in middle age”。","写作中看到“mid-lives”（带连字符）时，常是作者为了强调“不同人的中年阶段”或“人生中段的各个时期”而做的修辞式复数用法。"]}
{"word":"midmain","summary":{"en":"A technical term meaning a middle point/section along the main line, especially in electrical power distribution (e.g., midmain breaker/bus).","zh":"一个偏技术的词，指主干线路（尤其是配电系统）中段的部位或中间配电点（如 midmain 断路器/母排）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(technical, especially electrical engineering) A branch or section connected partway along the main power feed (“main”)—often used in phrases like “midmain breaker/bus” to mean an intermediate distribution point.","zh":"（技术用语，尤指电气工程）在主供电干线（main）中段接入的支路或段落；常见于“midmain breaker/bus”等搭配，表示位于中间的配电点。"},"examples":[{"en":"The electrician added a midmain breaker to protect the downstream panels.","zh":"电工加装了一个 midmain 断路器来保护下游配电盘。"},{"en":"Power is routed from the main service to a midmain bus before reaching the subpanels.","zh":"电力从主进线先送到一个中间母排（midmain bus），再到各个分配电箱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Located in the middle of the main section; midway along the main part.","zh":"（少见）位于主要部分的中间；在主干/主体的中段。"},"examples":[{"en":"They placed the sensor at a midmain position along the pipeline.","zh":"他们把传感器安装在管线主干的中段位置。"}]}],"synonyms":["intermediate","midline","midpoint","in-line (technical)"],"phonetic":"ˈmɪdˌmeɪn","extraExplanation":["“midmain”不是日常英语常用词，更常见于行业文件或设备标注（尤其是配电系统）。写法有时会带连字符（mid-main）或作为复合词出现在名词前（midmain breaker / midmain bus）。如果你是在某个具体设备或图纸上看到它，提供上下文会更容易确定它指的是哪一种组件或位置。"]}
{"word":"midmandibular","summary":{"en":"An anatomical term meaning “in the middle of the lower jaw (mandible).”","zh":"解剖学术语，表示“位于下颌骨（下颌）中部的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in or relating to the middle part of the mandible (the lower jawbone).","zh":"位于或与下颌骨（下颌）中段相关的；下颌中部的。"},"examples":[{"en":"The X-ray showed a small cyst in the midmandibular region.","zh":"X光显示下颌中部区域有一个小囊肿。"},{"en":"The dentist injected anesthetic near the midmandibular area to reduce pain.","zh":"牙医在下颌中部附近注射麻醉剂以减轻疼痛。"}]}],"synonyms":["mid-mandibular","central mandibular"],"phonetic":"/ˌmɪdˌmænˈdɪbjələr/","extraExplanation":["这是一个医学/牙科常用的解剖学形容词：mid-（中间的）+ mandibular（下颌的）。在临床记录里更常见的写法是带连字符的“mid-mandibular”，也可能写作“mid mandibular”。","“mandible”指下颌骨（下牙所在的骨头）。描述病灶、疼痛、骨折位置或手术切口时，医生可能用“midmandibular”来指出更具体的部位。"]}
{"word":"midmonth","summary":{"en":"Midmonth means the middle part of a month (around the 15th), or something happening around that time.","zh":"midmonth 指月中的时段（大约15号左右），或发生在月中附近的事情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Occurring in or around the middle of a month (not at the beginning or the end).","zh":"发生在月中、接近一个月中间的（不是月初也不是月末）。"},"examples":[{"en":"The rent is due midmonth, on the 15th.","zh":"房租在月中到期，也就是15号。"},{"en":"We’ll get our schedule update midmonth.","zh":"我们会在月中收到日程更新。"}]},{"partOfSpeech":"n.","definition":{"en":"The middle part of a month; around the 15th day (usage is less common than “mid-month”).","zh":"一个月的中间时段；大约在15号左右（不如“mid-month”常见）。"},"examples":[{"en":"Sales usually pick up in midmonth.","zh":"销售通常会在月中回升。"},{"en":"By midmonth, most bills have been paid.","zh":"到月中时，大多数账单都已经付了。"}]}],"synonyms":["mid-month","middle of the month","around the 15th"],"phonetic":"/ˌmɪdˈmʌnθ/","extraExplanation":["在正式写作中，更常见、也更规范的拼写是“mid-month”（带连字符）。作为单词“midmonth”多见于非正式用法、内部邮件或排版简化。","“mid-”这个前缀表示“中间/半途”，常见搭配还有 midweek（周中）、midday（中午）、midyear（年中）。"]}
{"word":"midmonthly","summary":{"en":"“Midmonthly” means around the middle of the month, describing timing or schedule.","zh":"“midmonthly”指“月中（左右）”，用于描述时间点或安排。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening or done around the middle of the month.","zh":"发生在月中（左右）的；在月中进行的。"},"examples":[{"en":"We get a midmonthly sales report around the 15th.","zh":"我们大约在15号左右会收到一份月中销售报告。"},{"en":"The rent reminder is sent midmonthly.","zh":"房租提醒会在月中发送。"}]},{"partOfSpeech":"adv.","definition":{"en":"Around the middle of the month (used to describe when something happens).","zh":"在月中（左右）（用于说明事情发生的时间）。"},"examples":[{"en":"The newsletter usually goes out midmonthly.","zh":"简报通常在月中发送。"},{"en":"Midmonthly, the team reviews progress and updates the plan.","zh":"到了月中，团队会回顾进度并更新计划。"}]}],"synonyms":["mid-month","midmonth","mid-monthly","around mid-month"],"phonetic":"ˌmɪdˈmʌnθli","extraExplanation":["“midmonthly”并不是特别常见的标准词形；更常见的写法是“mid-month”或“mid-monthly”。写作时如果想更自然，可以用“in mid-month / around mid-month / mid-monthly”。","常见时间参照通常指每月15号前后，但具体取决于语境（例如账单周期或工资发放安排）。"]}
{"word":"midmonths","summary":{"en":"“Midmonths” refers to the middle part of a month (or the midpoints of multiple months), most commonly written as “mid-month/midmonth.”","zh":"“midmonths”指“月中”（或多个不同月份的月中），更常见的写法是“mid-month/midmonth”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of a month; the period around the 14th–16th day (often written as “mid-month” or “midmonth”)","zh":"月中；一个月的中间时段（常写作 mid-month 或 midmonth，通常指14—16日左右）"},"examples":[{"en":"Rent is due at mid-month as well as on the first.","zh":"房租除了月初，还要在月中缴一次。"},{"en":"The report will be ready by mid-month.","zh":"报告将在月中之前准备好。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening in the middle of a month","zh":"发生在月中（的）；在一个月中间（的）"},"examples":[{"en":"We have a mid-month deadline.","zh":"我们有一个月中的截止日期。"},{"en":"Mid-month sales often attract more shoppers.","zh":"月中促销常常吸引更多顾客。"}]}],"synonyms":["mid-month","midmonth","the middle of the month"],"phonetic":"ˌmɪdˈmʌnθ","extraExplanation":["“midmonths”本身不算常见的标准拼写；更常见的是带连字符的 **mid-month**（形容词/副词用法）或合写的 **midmonth**。如果你看到 **midmonths**，多半是指“几个不同月份的月中时段”（复数），或是非正式/排版习惯造成的写法。","时间表达上，**by mid-month** 通常表示“到月中为止/不晚于月中”；**in the middle of the month** 更口语、更明确。"]}
{"word":"midmorn","summary":{"en":"“midmorn” is an informal short form of “midmorning,” meaning the middle/late part of the morning.","zh":"“midmorn”是“midmorning”的非正式缩写，表示上午中段/接近中午前的时段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A shortened form of “midmorning,” meaning the time in the middle of the morning (roughly late morning, between early morning and noon).","zh":"（非正式）“midmorning（上午中段/接近中午前的时段）”的缩写，指早晨中间到中午前的时间（约上午较晚时段）。"},"examples":[{"en":"Let’s meet midmorn, around 10:30.","zh":"我们上午中段见面吧，大概10:30。"},{"en":"I usually feel hungry again by midmorn.","zh":"我通常到上午中段又会觉得饿。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Describing something happening in the middle of the morning.","zh":"（非正式）形容发生在上午中段的（事/安排）。"},"examples":[{"en":"We have a midmorn check-in on Fridays.","zh":"我们周五有一个上午中段的简短沟通会。"},{"en":"She took a midmorn break to grab coffee.","zh":"她上午中段休息了一下去买咖啡。"}]}],"synonyms":["midmorning","late morning","forenoon"],"phonetic":"/ˌmɪdˈmɔrnɪŋ/","extraExplanation":["“midmorn”常见于日程表、聊天、备忘录等快速记录的语境，属于缩写写法；正式写作更常用“midmorning”或“late morning”。","时间范围不一定固定，通常指9:30–11:00左右（因人因工作作息而异）。"]}
{"word":"midmorning","summary":{"en":"Midmorning means the middle part of the morning (often about 9–11 a.m.) or something that happens then.","zh":"midmorning 指“上午中段”（常约9–11点），也可作形容词表示“在上午中段发生的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of the morning, usually between early morning and noon (often around 9:00–11:00 a.m.).","zh":"上午的中段，通常指清晨之后到中午之前（常见大约在上午9点到11点之间）。"},"examples":[{"en":"Let’s meet in midmorning, around 10 a.m.","zh":"我们上午中段见吧，大概10点左右。"},{"en":"I usually get hungry in midmorning and have a small snack.","zh":"我通常在上午中段会饿，就吃点小零食。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of the morning.","zh":"发生在上午中段的；在上午中段进行的。"},"examples":[{"en":"She scheduled a midmorning call with the client.","zh":"她安排了一通上午中段和客户的电话。"},{"en":"A midmorning break helps me stay focused.","zh":"上午中段休息一下能帮助我保持专注。"}]}],"synonyms":["mid-morning","late morning"],"phonetic":"/ˌmɪdˈmɔrnɪŋ/","extraExplanation":["在美式英语里，midmorning 常写作一个词 midmorning，也常见写法 mid-morning（带连字符）。两种都对，正式写作有时更偏好 mid-morning。","它和 late morning（上午较晚）很接近，但 midmorning 更强调“中间那段”，而 late morning 更靠近中午。"]}
{"word":"midmost","summary":{"en":"“Midmost” means the exact middle or most central position, often in a slightly literary style.","zh":"“midmost”表示“正中间的/最居中的”，语气略偏文学或较旧式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the exact middle; the most central position (often used before a noun).","zh":"正中间的；最居中的（常用于名词前）"},"examples":[{"en":"She sat in the midmost seat of the front row.","zh":"她坐在前排正中间的座位上。"},{"en":"Place the vase on the midmost part of the table.","zh":"把花瓶放在桌子正中央的地方。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the exact middle; most centrally (less common today).","zh":"在正中间；最居中地（较少见）"},"examples":[{"en":"The target was painted midmost on the wall.","zh":"靶子被画在墙的正中央。"}]}],"synonyms":["central","middle","center-most","in the middle","right in the middle"],"phonetic":"/ˈmɪdˌmoʊst/","extraExplanation":["“midmost”听起来比较文学化或偏旧式，现代口语里更常用“middle”“central”“right in the middle”。在正式写作或描述空间布局时用它会显得更强调“正中央”的精确位置。"]}
{"word":"midmosts","summary":{"en":"Midmosts means the most central ones—things or people located in the very middle.","zh":"midmosts 指“最居中的那些（人或物）”，位于正中央。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Situated in the very middle; the most central.","zh":"位于正中央的；最居中的。"},"examples":[{"en":"They sat in the midmost seats of the theater.","zh":"他们坐在剧院最中间的座位上。"},{"en":"Place the vase on the midmost shelf so it looks balanced.","zh":"把花瓶放在正中间那层架子上，看起来更均衡。"}]},{"partOfSpeech":"n.","definition":{"en":"The things or people in the very middle (plural noun use).","zh":"正中间的人或物（复数名词用法）。"},"examples":[{"en":"The midmosts of the group were protected by those on the edges.","zh":"队伍正中间的人受到边缘成员的保护。"}]}],"synonyms":["central","middlemost","in the middle","center"],"phonetic":"/ˈmɪdˌmoʊst/","extraExplanation":["“midmost”由 mid（中间）+ most（最……的）构成，意思接近更常见的“middlemost / central”。“midmosts”作为复数形式比较少见，多见于较文学化、较旧式或刻意追求风格的表达。"]}
{"word":"midn","summary":{"en":"“midn.” is a common abbreviation for “midnight,” meaning 12:00 a.m.","zh":"“midn.”是“midnight（午夜）”的常见缩写，意思是凌晨12:00。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) midnight; used especially in schedules, logs, or short notes to mean 12:00 a.m.","zh":"（缩写）午夜；常用于时间表、记录或简短笔记中，表示凌晨12:00。"},"examples":[{"en":"The train arrives at 11:55 p.m. and departs at midn.","zh":"火车在晚上11:55到达，并在午夜（midn.）发车。"},{"en":"Report due: Fri., 11:59 p.m. (before midn.).","zh":"报告截止：周五晚11:59（午夜前）。"}]}],"synonyms":["midnight","12:00 a.m.","00:00"],"phonetic":"/ˈmɪd.naɪt/","extraExplanation":["“midn.”多见于表格、日程、航运/航空信息、日志等需要节省空间的场景；在正式写作里通常写全“midnight”或用“12:00 a.m.”更清楚。","有时为避免“12 a.m./12 p.m.”的歧义，人们更偏好写“midnight”或“00:00”。"]}
{"word":"midnight","summary":{"en":"“Midnight” most commonly means 12:00 a.m., the very middle of the night; it can also describe something happening very late at night or a very dark color (midnight blue).","zh":"midnight 最常指“午夜/凌晨12点”，也可作形容词表示“深夜发生的”或指很深的颜色（如 midnight blue 午夜蓝）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"12:00 a.m.; the middle of the night, when one day ends and the next begins.","zh":"午夜；凌晨12点；一天结束、另一天开始的时刻。"},"examples":[{"en":"The train arrives at midnight.","zh":"火车在午夜到达。"},{"en":"We stayed up until midnight talking.","zh":"我们聊到午夜才睡。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening at, near, or like midnight (very late at night; very dark).","zh":"发生在午夜（前后）的；像午夜一样的（很晚、很暗的）。"},"examples":[{"en":"They took a midnight walk along the beach.","zh":"他们在海边进行了一次午夜散步。"},{"en":"She wore a midnight-blue dress.","zh":"她穿了一条深夜蓝（午夜蓝）的裙子。"}]}],"synonyms":["twelve o’clock at night","12 a.m.","the middle of the night","witching hour (informal)"],"phonetic":"/ˈmɪdˌnaɪt/","extraExplanation":["常见搭配：at midnight（在午夜）、around/near midnight（午夜前后）、midnight oil（俚语：熬夜用功/加班，“burn the midnight oil”=开夜车）。","文化与文学中，midnight 常用来营造“神秘、安静、转折”的氛围；经典用例如 Edgar Allan Poe《The Raven》开头的 “Once upon a midnight dreary…（在一个沉郁的午夜……）”。"]}
{"word":"midnightly","summary":{"en":"“Midnightly” means at midnight/every midnight (adverb) or midnight-related/occurring at midnight (adjective), and it’s relatively rare in everyday modern English.","zh":"“midnightly”可作副词表示“在午夜/每到午夜”，也可作形容词表示“与午夜有关/在午夜发生的”，但在现代日常英语中较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Happening, done, or published at midnight or every midnight.","zh":"在午夜发生/进行/发布的；每逢午夜的。"},"examples":[{"en":"The radio station used to play a special program midnightly.","zh":"这家电台过去每到午夜都会播放一个特别节目。"},{"en":"She checked the baby midnightly during the first week.","zh":"第一周她每到半夜都会去看看宝宝。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to midnight; occurring at midnight.","zh":"与午夜有关的；在午夜发生的。"},"examples":[{"en":"A midnightly fog covered the streets.","zh":"一层“午夜般”的雾笼罩着街道。"},{"en":"They met in a midnightly hush, when the city was quiet.","zh":"他们在午夜般的寂静中见面，那时城市很安静。"}]}],"synonyms":["at midnight","every midnight","nightly","nocturnal"],"phonetic":"/ˈmɪdˌnaɪtli/","extraExplanation":["“midnightly”不是现代英语里很常见的日常用词，更常见的说法是：at midnight（在午夜）、every midnight（每到午夜）、nightly（每晚）、around midnight（午夜前后）。","在文学或较旧的文体中，“-ly”有时会加在表示时间的词后，形成带点诗意或古典色彩的表达，用来营造氛围（例如“midnightly hush”强调“像午夜一样的寂静”）。"]}
{"word":"midnights","summary":{"en":"“Midnights” is the plural of “midnight”: multiple times around 12:00 a.m., or figuratively, multiple dark or difficult periods.","zh":"“midnights”是“midnight”的复数：指多个午夜时刻（凌晨12点左右），也可比喻多段黑暗或艰难时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The times when it is 12:00 a.m. (the middle of the night); multiple occurrences of midnight.","zh":"多次的“午夜”（凌晨12点左右）；指多个午夜时刻。"},"examples":[{"en":"I’ve worked past midnight many times, but not on three midnights in a row.","zh":"我很多次工作到过午夜，但没有连续三个午夜都这样。"},{"en":"The city looks different at midnights—quieter, slower, and more mysterious.","zh":"在多个午夜时分，这座城市看起来不一样——更安静、更慢、更神秘。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Several very dark, difficult, or hopeless periods in life.","zh":"（比喻）多段黑暗、艰难或看不到希望的时期。"},"examples":[{"en":"During those midnights, she leaned on friends and kept going.","zh":"在那些黑暗时刻，她依靠朋友并坚持了下去。"},{"en":"His journal describes long midnights of doubt before success finally came.","zh":"他的日记写到成功到来前那一段段漫长的疑虑黑夜。"}]}],"synonyms":["late nights","the witching hours","dark times","bleak periods"],"phonetic":"/ˈmɪdˌnaɪt/","extraExplanation":["“midnight”的复数“midnights”在文学或歌词里常用来营造氛围：午夜象征安静、秘密、孤独，也常象征“黑暗时刻/低谷”。因此你会看到它既能指具体时间，也能指情绪或人生阶段。"]}
{"word":"midnoon","summary":{"en":"Midnoon is a rare, literary way to say “noon” or “midday.”","zh":"midnoon 是表示“正午/中午”的罕见、偏文学的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle of the day; noon (a rare or literary word).","zh":"正午；中午（较少见或文学性用法）。"},"examples":[{"en":"By midnoon, the streets were quiet in the heat.","zh":"到正午时，街道在炎热中变得安静。"},{"en":"They planned to meet at midnoon, when the sun was highest.","zh":"他们计划在正午见面，那时太阳最高。"}]}],"synonyms":["noon","midday","middaytime"],"phonetic":"/ˌmɪdˈnuːn/","extraExplanation":["“midnoon”并不是现代英语里常用的词，更常见的说法是“noon / midday”。它的构词方式类似“midnight（午夜）”，有时会出现在诗歌或较旧的文学作品中，用来营造更有画面感或更庄重的语气。"]}
{"word":"midnoons","summary":{"en":"“Midnoon(s)” is an uncommon, literary way to say “noon/midday.”","zh":"“midnoon(s)”是较少见、偏文学的说法，意思是“正午/中午”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon/poetic) noon; the middle of the day (around 12:00 p.m.).","zh":"（不常见/偏文学用法）正午；一天中间的时段（约中午12点左右）。"},"examples":[{"en":"We stopped to rest at midnoon, when the sun was highest.","zh":"我们在正午休息了一下，那时太阳升到最高。"},{"en":"The midnoon heat made walking across town exhausting.","zh":"正午的炎热让穿过城镇的步行变得很累。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) describing something happening at noon.","zh":"（文学用法）形容发生在正午的；正午的。"},"examples":[{"en":"They sat in the midnoon sun and ate lunch quietly.","zh":"他们坐在正午的阳光下，安静地吃午饭。"}]}],"synonyms":["noon","midday","noontime"],"phonetic":"/ˌmɪdˈnuːn/","extraExplanation":["“midnoon”在现代英语里很少用；更常见的说法是“noon / midday / noontime”。在较旧或诗歌/文学语境中可能出现。","你输入的“midnoons”通常是复数（poetic plural），表示“多个正午/许多天的正午时分”。也可能是拼写或用词不常见导致看起来像错误；若你想表达“中午”，用“noon”最自然。","有时也会写作“mid-noon”（带连字符），意思相同。"]}
{"word":"midocean","summary":{"en":"Mid-ocean means the middle part of the ocean, far from land.","zh":"mid-ocean 指“大洋中部”，即远离陆地的海域或位于海洋中部的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in or toward the middle of the ocean; far from land.","zh":"位于大洋中部的；远离陆地的。"},"examples":[{"en":"The sailors spotted a pod of dolphins in mid-ocean.","zh":"水手们在大洋中部看到了一群海豚。"},{"en":"A storm hit the ship while it was mid-ocean.","zh":"船在大洋中部航行时遭遇了风暴。"},{"en":"They planned a mid-ocean refueling stop.","zh":"他们计划在大洋中部进行一次补给加油。"}]},{"partOfSpeech":"n.","definition":{"en":"The middle part of an ocean (an area far from any coast).","zh":"大洋中部（水域中远离海岸的区域）。"},"examples":[{"en":"Shipping routes often cross the mid-ocean to save distance.","zh":"航运路线常常穿越大洋中部以缩短距离。"},{"en":"Life in the mid-ocean can be very different from life near the shore.","zh":"大洋中部的生物与近岸生物可能大不相同。"}]}],"synonyms":["open ocean","high seas","offshore","pelagic (context-dependent)"],"phonetic":"ˌmɪdˈoʊʃən","extraExplanation":["写法上常见两种：mid-ocean（较常见，作形容词/名词）和 mid ocean（较少见）。在正式写作里用连字符 mid-ocean 更清楚。","在科学语境中，mid-ocean 也常出现在术语里，如 mid-ocean ridge（大洋中脊），指海底板块张裂形成的海底山脉。"]}
{"word":"Midori","summary":{"en":"Midori most commonly refers to a bright green melon liqueur, and it can also be a Japanese given name or the Japanese word for “green.”","zh":"Midori 最常指一种鲜绿色的蜜瓜味利口酒；也可作日语人名，或在日式语境中表示日语的“绿色/绿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bright green, melon-flavored Japanese liqueur (brand name), often used in cocktails","zh":"（商标名）Midori 蜜瓜味日本利口酒，颜色鲜绿，常用于调酒"},"examples":[{"en":"She ordered a Midori Sour at the bar.","zh":"她在酒吧点了一杯 Midori Sour（蜜多莉酸酒）。"},{"en":"Midori adds a sweet melon flavor and a vivid green color to drinks.","zh":"Midori 会给饮品带来甜甜的蜜瓜味和鲜亮的绿色。"}]},{"partOfSpeech":"n.","definition":{"en":"a Japanese given name (more common for women), used in English as a personal name","zh":"日语人名“みどり”（较常用于女性名），在英语中作人名使用"},"examples":[{"en":"Midori introduced herself to the class.","zh":"Midori 向全班做了自我介绍。"},{"en":"I met Midori during my trip to Tokyo.","zh":"我在东京旅行时认识了 Midori。"}]},{"partOfSpeech":"other","definition":{"en":"the Japanese word meaning “green,” sometimes used in English in Japanese contexts","zh":"日语里“绿色/绿”的意思，有时在英语中用于日式语境"},"examples":[{"en":"The menu described the tea as “midori” (green).","zh":"菜单把这款茶写成“midori”（绿色/绿茶）。"}]}],"synonyms":["melon liqueur (for the drink sense)"],"phonetic":"/miˈdɔri/","extraExplanation":["“Midori”（みどり）在日语里本义是“绿色”。在英语环境中常见的用法主要有两种：① 作为蜜瓜味利口酒品牌名（通常首字母大写）；② 作为人名（同样首字母大写）。","作为酒名时，它常出现在鸡尾酒名称里，如 Midori Sour、Japanese Slipper 等。点单或写作时保留原名更自然。"]}
{"word":"midparent","summary":{"en":"Midparent is the average of two parents’ trait values, used as a reference point when evaluating offspring.","zh":"Midparent指双亲性状数值的平均值，常作为评估后代性状表现的参照。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics/plant & animal breeding) the average (mean) value of two parents’ traits (such as height or yield), used as a baseline to compare offspring.","zh":"（遗传学/动植物育种）双亲性状（如身高、产量）的平均值（均值），常用作比较后代表现的基准。"},"examples":[{"en":"The midparent value for plant height was 120 cm, but the hybrid grew to 135 cm.","zh":"植株高度的中亲值是120厘米，但杂交后代长到了135厘米。"},{"en":"Researchers compared offspring performance to the midparent mean to estimate heterosis.","zh":"研究人员将后代表现与中亲均值比较，以估算杂种优势。"}]}],"synonyms":["midparent mean","mid-parent value","parental mean"],"phonetic":"/ˈmɪdˌpɛrənt/","extraExplanation":["“midparent”多见于数量遗传学与育种学论文中，常与“midparent mean（中亲均值）/mid-parent value（中亲值）”连用，用来表示双亲表型（或数值性状）的平均水平。","当后代表现高于（或低于）中亲值时，研究者可能讨论“heterosis/ hybrid vigor（杂种优势）”或“midparent heterosis（相对于中亲的杂种优势）”。","写作中常见连字符形式“mid-parent”，但“midparent”也被广泛使用；具体以期刊或课程规范为准。"]}
{"word":"midparentage","summary":{"en":"Midparentage is a technical term meaning either mixed parentage (from two different parental lines) or the average of two parents’ trait values (mid-parent value) used in genetics.","zh":"midparentage 是技术性术语，既可指来自两条不同亲本谱系的“混合亲本来源”，也可指遗传学中“两亲性状的平均值”（中亲本值）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or fact of being from two parents of different lines (used in biology/breeding); mixed parentage","zh":"（生物学/育种用语）指来自两条不同品系/谱系的双亲；混合亲本来源"},"examples":[{"en":"The hybrids were evaluated for midparentage effects on height and yield.","zh":"研究人员评估了杂交后代在株高和产量上的中亲本（混合亲本）效应。"},{"en":"In the report, each sample’s midparentage was recorded before comparing growth rates.","zh":"在比较生长速率之前，报告记录了每个样本的中亲本来源（混合亲本信息）。"}]},{"partOfSpeech":"n.","definition":{"en":"(in genetics/statistics) the average of the two parents’ trait values, used as a reference point (often called the mid-parent value)","zh":"（遗传学/统计学）双亲性状数值的平均值，用作参照（常称“中亲本值/双亲均值”）"},"examples":[{"en":"The offspring exceeded the midparentage for body weight, suggesting hybrid vigor.","zh":"后代体重超过中亲本值，提示存在杂交优势。"},{"en":"We compared the child’s score to the midparentage to estimate inheritance patterns.","zh":"我们将孩子的分数与中亲本值比较，以估计遗传模式。"}]}],"synonyms":["mid-parent value","midparent value","mixed parentage","parental average"],"phonetic":"/ˌmɪdˈpɛrəntɪdʒ/","extraExplanation":["“midparentage”在日常英语里很少见，更常见的写法是“mid-parent value / midparent value（中亲本值）”或直接说“mixed parentage（混合血统/亲本来源）”。","在数量遗传学里，中亲本值通常指两位亲本表型值的平均数，用来衡量后代是否“超过亲本平均”（例如杂交优势，hybrid vigor / heterosis）。"]}
{"word":"midparental","summary":{"en":"Midparental means “based on the average of the two parents,” especially for estimating a child’s adult height.","zh":"midparental 指“基于父母双方平均值的”，尤用于估算孩子的成年身高（父母平均身高）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Genetics/medicine) Relating to the average of the two parents, especially used to estimate a child’s expected adult height (midparental height).","zh":"（遗传学/医学）与父母双方的平均值有关的，尤指用于估算孩子预期成年身高的“父母平均身高（midparental height）”。"},"examples":[{"en":"The pediatrician calculated the child’s midparental height to estimate the target height range.","zh":"儿科医生计算了孩子的父母平均身高，用来估算目标身高范围。"},{"en":"Midparental measurements are helpful, but they don’t guarantee a child will be tall or short.","zh":"父母平均值的测算很有参考价值，但并不能保证孩子一定会高或矮。"}]}],"synonyms":["parental average","average of parents","target-height (contextual)"],"phonetic":"/ˌmɪdˈpɛrəntl/","extraExplanation":["“midparental”最常见出现在短语 midparental height（父母平均身高）中，用于临床上粗略估算孩子的成年身高范围。常见做法是先把父亲和母亲身高换算到同一单位，再取平均，并根据孩子性别做一个小幅度调整（不同医院/指南的具体公式可能略有差异）。它只是统计学上的估计，会受到营养、健康状况、青春期发育时间、遗传组合等多种因素影响。"]}
{"word":"midpit","summary":{"en":"“Midpit” isn’t standard English; it’s usually an informal way to mean the middle of a pit.","zh":"“midpit”不是标准英语词，通常非正式地表示“坑/矿坑的中间部分”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard dictionary word in English. It is usually read as “mid-pit” and used informally to mean “the middle part of a pit” (a hole, excavation, or mining pit).","zh":"不是标准英语词典词。通常可按“mid-pit”理解，非正式地表示“坑/矿坑的中间部分”。"},"examples":[{"en":"The workers gathered at the midpit to check the pump.","zh":"工人们在坑的中间位置集合检查水泵。"},{"en":"Cracks appeared near the midpit area after the heavy rain.","zh":"暴雨后，坑中部附近出现了裂缝。"}]}],"synonyms":["the middle of the pit","the center of the pit","mid-pit","midpoint"],"phonetic":"ˈmɪdˌpɪt","extraExplanation":["“midpit”在正式写作中很少见，更常见的写法是加连字符的“mid-pit”，或直接说“the middle of the pit / the center of the pit”。","如果你想表达“中点/中间位置”，更常用的词是“midpoint”。如果你愿意，也可以告诉我你看到“midpit”的句子或领域（采矿/工程/游戏等），我可以按语境给出更准确的解释与替换说法。"]}
{"word":"midpoint","summary":{"en":"Midpoint means the exact middle between two ends (in space, time, or numbers).","zh":"Midpoint 指两端之间“正好在中间”的点（可用于空间、时间或数值）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle point between two places, times, or values; the point equally distant from both ends","zh":"中点；（两处/两端之间的）中间点；（时间/数值的）中间值"},"examples":[{"en":"Let’s meet at the midpoint between our two houses.","zh":"我们在两家之间的中点见面吧。"},{"en":"The midpoint of the semester is a good time to review your notes.","zh":"学期的中间是复习笔记的好时机。"},{"en":"Find the midpoint of 4 and 10: it’s 7.","zh":"求 4 和 10 的中间值：是 7。"}]},{"partOfSpeech":"adj.","definition":{"en":"located in the middle; halfway","zh":"在中间的；中途的；一半处的"},"examples":[{"en":"We stopped at a midpoint station to change trains.","zh":"我们在中途的车站停下来换乘。"},{"en":"The report gives a midpoint update on the project.","zh":"这份报告给出了项目的中期更新。"}]}],"synonyms":["middle point","center point","halfway point"],"phonetic":"/ˈmɪdˌpɔɪnt/","extraExplanation":["在数学/几何中，midpoint 常指线段的“中点”。若两点是 (x1, y1) 和 (x2, y2)，中点是 ((x1+x2)/2, (y1+y2)/2)。日常英语里也常用来表示“过程的一半”或“中途阶段”。"]}
{"word":"midpoints","summary":{"en":"“Midpoints” means the points halfway between two ends or two points, used in math and also figuratively for compromise positions.","zh":"“midpoints”指两端或两点之间的中点；既可用于数学/几何，也可引申为“折中点、平衡点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The points exactly halfway between two ends, sides, or positions (plural of “midpoint”).","zh":"（midpoint 的复数）两端、两边或两个位置之间正好在中间的点；中点。"},"examples":[{"en":"Mark the midpoints of each side of the square.","zh":"标出正方形每条边的中点。"},{"en":"The midpoints of the two cities are where the new rest stops will be built.","zh":"两座城市之间的中点位置将建设新的休息站。"}]},{"partOfSpeech":"n.","definition":{"en":"In mathematics, points that lie halfway between two given points (often used when dividing a line segment).","zh":"（数学）两点之间正好在中间的位置点（常用于把线段对半分）。"},"examples":[{"en":"Find the midpoints of the line segments using the midpoint formula.","zh":"用中点公式求这些线段的中点。"},{"en":"Connect the midpoints to form a smaller triangle inside the original one.","zh":"连接中点，在原三角形内形成一个更小的三角形。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, compromise positions or balanced solutions between two extremes.","zh":"（比喻）介于两种极端之间的折中立场；平衡的解决方案。"},"examples":[{"en":"We looked for midpoints between the two proposals to reach an agreement.","zh":"我们在两份提案之间寻找折中点，以达成一致。"},{"en":"Good managers often choose midpoints between strict rules and flexibility.","zh":"好的管理者常在严格规定与灵活处理之间找到平衡点。"}]}],"synonyms":["centers","middle points","halfway points","compromises","middle ground"],"phonetic":"/ˈmɪdˌpɔɪnts/","extraExplanation":["在英文写作里，midpoint 常用于几何与坐标问题；也常被引申为“折中点/平衡点”。","拼写通常是一个词 midpoint（复数 midpoints），有时也会看到 mid-point（较少见，偏旧式或特定出版风格）。"]}
{"word":"midrange","summary":{"en":"Midrange means the middle part of a range—often the middle sound frequencies—or describes something in the middle tier of price/quality.","zh":"midrange 指“范围的中间部分”（常指音频的中频），也可形容价格/品质处于中端档。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of a range, especially of sound frequencies (between bass/low and treble/high).","zh":"（尤指音频频率的）中频；介于低频（低音）与高频（高音）之间的部分。"},"examples":[{"en":"The vocals sound clearer after boosting the midrange slightly.","zh":"把中频稍微提升后，人声听起来更清晰了。"},{"en":"Cheap speakers often have weak bass and a harsh midrange.","zh":"便宜音箱常常低频弱，而且中频刺耳。"}]},{"partOfSpeech":"adj.","definition":{"en":"In the middle level of price, quality, or performance; neither budget nor premium.","zh":"中端的；价格、品质或性能处于中间档，既不是入门也不是高端。"},"examples":[{"en":"They bought a midrange laptop that’s good for school and light gaming.","zh":"他们买了一台中端笔记本，适合上学和轻度游戏。"},{"en":"This model targets midrange customers who want value without the luxury price.","zh":"这款机型面向追求性价比、又不想付奢侈价的中端用户。"}]}],"synonyms":["middle range","mid-level","middle-tier"],"phonetic":"/ˈmɪdˌreɪndʒ/","extraExplanation":["在音频里，midrange（中频）大致覆盖人声和许多乐器的主体“存在感”，所以调得太多会“鼻音/刺耳”，调得太少会“空、没精神”。不同领域的“中频/中端”具体范围会变，但核心意思都是“在中间那一段/那一档”。"]}
{"word":"midranges","summary":{"en":"Midranges are the middle parts of a range, or (in audio) the mid-frequency sounds between bass and treble.","zh":"midranges 指范围的中间部分；在音响语境中指介于低频与高频之间的中频（或中频单元）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle parts of a range (of values, levels, prices, etc.), not the lowest or the highest","zh":"（数值、水平、价格等）范围的中间部分；中档区间"},"examples":[{"en":"This model performs best in the midranges, not at the extremes.","zh":"这款型号在中档区间表现最好，不是在极端条件下。"},{"en":"Most of the results fell into the midranges of the scale.","zh":"大多数结果落在量表的中间区间。"}]},{"partOfSpeech":"n.","definition":{"en":"in audio/music, the middle frequencies (or the speakers that produce them), between bass and treble","zh":"（音频/音乐）中频（或负责播放中频的扬声器单元），介于低频与高频之间"},"examples":[{"en":"The vocals sound clearer when you boost the midranges slightly.","zh":"稍微提升一点中频后，人声会更清晰。"},{"en":"These headphones have strong bass but recessed midranges.","zh":"这副耳机低频很强，但中频偏弱。"},{"en":"A good mix keeps the midranges balanced so instruments don’t sound muddy.","zh":"好的混音会让中频保持平衡，避免乐器听起来浑浊。"}]}],"synonyms":["middle range","mid-levels","mid-frequency (audio)","mids"],"phonetic":"/ˈmɪdˌreɪndʒɪz/","extraExplanation":["“midrange”既常指“中间范围/中档”，也常见于音响领域指“中频”。写法上可见 midrange / mid-range；复数为 midranges / mid-ranges，两种都常用。"]}
{"word":"midrash","summary":{"en":"Midrash is Jewish interpretive teaching and storytelling that explains the Hebrew Bible through commentary and expanded meaning.","zh":"Midrash 指犹太传统的解经与阐释性故事/文献，用评注与延伸意义来解释《希伯来圣经》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A collection of Jewish teachings and stories that interpret and explain the Hebrew Bible, often adding commentary, lessons, and imaginative details.","zh":"米德拉什：犹太传统中对《希伯来圣经》（《塔纳赫》）的解释与阐释性文献与故事集，常加入评注、教训与想象性的细节。"},"examples":[{"en":"In her religion class, she read a midrash about Abraham to understand the biblical story more deeply.","zh":"在宗教课上，她读了一则关于亚伯拉罕的米德拉什，以更深入地理解圣经故事。"},{"en":"The rabbi used midrash to connect an ancient verse to modern life.","zh":"拉比运用米德拉什，把古老的经文与现代生活联系起来。"}]}],"synonyms":["rabbinic commentary","biblical interpretation","Jewish exegesis"],"phonetic":"/ˈmɪdˌræʃ/","extraExplanation":["“Midrash”来自希伯来语，核心意思与“探究、阐释”有关。它不是对经文的逐字翻译，而是通过解经、寓意与故事化补充来回答经文“为什么这样说/这里发生了什么”等问题。","常见的区分：**Midrash Halakhah**（偏向法律/规范层面的解经）与 **Midrash Aggadah**（偏向故事、伦理与精神启发的解读）。不少英语读者会把后者理解为“带寓意的扩展故事”。","用法提示：英语里通常说 **a midrash**（一则/一篇米德拉什）或 **midrashim**（复数）。也常见搭配 **midrash on [a passage]**（对某段经文的米德拉什阐释）。"]}
{"word":"midrashic","summary":{"en":"“Midrashic” means related to Midrash—rabbinic Jewish interpretation and storytelling based on biblical texts.","zh":"midrashic 指“与米德拉什有关的”，即犹太拉比传统中对圣经文本的解释与故事化阐释方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of Midrash—Jewish rabbinic interpretation and storytelling based on the Hebrew Bible (Tanakh).","zh":"与“米德拉什（Midrash）”有关的；具有米德拉什式（犹太拉比传统对《希伯来圣经》的解释与故事化阐释）特点的。"},"examples":[{"en":"The scholar offered a midrashic reading of the story of Moses.","zh":"这位学者对摩西的故事提出了一个米德拉什式的解读。"},{"en":"Her essay uses midrashic techniques to fill in the silence between verses.","zh":"她的文章用米德拉什式的手法去补足经文之间的“沉默空白”。"},{"en":"Some modern writers create midrashic retellings of biblical narratives.","zh":"一些现代作家会创作对《圣经》叙事的米德拉什式再讲述。"}]}],"synonyms":["exegetical","interpretive","rabbinic"],"phonetic":"/mɪˈdrɑʃɪk/","extraExplanation":["“Midrash”常指犹太教拉比传统中的释经与叙事：不仅解释经文含义，也会通过比喻、想象性补叙、对话等方式，把经文中未明说的动机与细节“讲出来”。因此 midrashic 在学术写作里常与“释经（exegesis）”“诠释（interpretation）”同场出现。","在文学与文化批评中，midrashic 也可更宽泛地指一种“以经典文本为起点、通过创造性补写来阐释意义”的写法；但它通常仍带有明确的犹太传统背景。"]}
{"word":"midrashim","summary":{"en":"Midrashim are rabbinic Jewish interpretations and teachings on the Hebrew Bible; it is the plural of “midrash.”","zh":"midrashim 是 midrash 的复数，指犹太教拉比传统对《希伯来圣经》的诠释与教导（常带故事与延伸解读）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of midrash: Jewish rabbinic interpretations and teachings on the Hebrew Bible, often expanding the text with stories, explanations, and moral lessons.","zh":"midrash（米德拉什）的复数：指犹太教拉比对《希伯来圣经》的诠释与讲授，常通过故事、补充说明与道德教训来拓展经文含义。"},"examples":[{"en":"In our class, we read several midrashim about Moses’ childhood.","zh":"在课堂上，我们读了几篇关于摩西童年的米德拉什（midrashim）。"},{"en":"These midrashim try to answer questions the biblical text leaves open.","zh":"这些midrashim试图回答经文中留下的空白与疑问。"}]},{"partOfSpeech":"n.","definition":{"en":"A collection or body of Midrash literature (taken together).","zh":"（总称）米德拉什文学：指一组或整体的米德拉什著作与传统。"},"examples":[{"en":"The library has a section devoted to classical midrashim.","zh":"图书馆有一个专区专门收藏古典midrashim。"},{"en":"Scholars compare midrashim from different periods to see how interpretations changed.","zh":"学者会比较不同时期的midrashim，以观察诠释如何演变。"}]}],"synonyms":["rabbinic interpretations","rabbinic commentaries","Midrash literature","Jewish exegetical writings"],"phonetic":"/mɪˈdrɑʃɪm/","extraExplanation":["“midrashim”是希伯来语复数形式；单数是“midrash”。英语学术写作中常直接用该复数，而不是加 -es。","Midrash 常分为偏叙事与伦理教导的“aggadic（寓教式/叙事式）”以及偏法律讨论的“halakhic（律法式）”。两者都属于拉比传统的重要解释方式。","在文化语境中，Midrash 不只是“注释”，也常是一种创造性的读经：通过补充背景、提出问题、讲故事来引导读者理解经文与价值观。"]}
{"word":"midrashoth","summary":{"en":"“Midrashoth” means Jewish interpretive writings (plural) that explain or creatively expand the Bible; it’s a less common plural spelling of “midrash.”","zh":"“midrashoth”指犹太教对《希伯来圣经》进行解释或创造性延伸的释经作品（复数），是 midrash 的一种较少见的复数拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) Jewish interpretive writings that explain, expand, or comment on the Hebrew Bible (the Tanakh), often through stories, moral lessons, and creative interpretation.","zh":"（复数）犹太教的“米德拉什”式释经作品：对《希伯来圣经》（《塔纳赫》）进行解释、延伸或评注的文献，常用故事、道德寓意与创造性的诠释来阐明经文。"},"examples":[{"en":"The scholar compared several midrashoth on the story of Moses.","zh":"这位学者比较了几篇关于摩西故事的米德拉什释经作品。"},{"en":"In class, we read midrashoth that fill in details the biblical text leaves unsaid.","zh":"课堂上，我们阅读了一些米德拉什作品，它们补充了圣经文本没有明说的细节。"}]}],"synonyms":["midrashim","midrashot"],"phonetic":"/mɪdˈrɑʃoʊθ/","extraExplanation":["“midrashoth”来自希伯来语，英文里更常见的单数是 midrash（米德拉什），复数常写作 midrashim（更常用）或 midrashot；“midrashoth”属于较传统/学术化的拼写方式。","米德拉什并不等同于“随意改写”，而是一种在犹太传统中有规则、有目的的释经方法：可能是解释经文难点、提出伦理教导，或用寓言/故事把经文思想讲得更生动。","常见搭配：Midrash Rabbah（《大米德拉什》）指一组重要的经典米德拉什汇编；学习相关内容时也会遇到“aggadic midrash”（偏叙事与伦理）与“halakhic midrash”（偏律法解释）等区分。"]}
{"word":"midrib","summary":{"en":"Midrib means the main central vein of a leaf.","zh":"midrib 指叶片中央的主脉（中脉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the main central vein of a leaf, running from the base to the tip and supporting smaller veins","zh":"（叶片的）主脉；中脉（从叶基到叶尖的主要叶脉，支撑并连接较小的叶脉）"},"examples":[{"en":"The midrib runs down the center of the leaf like a backbone.","zh":"叶片的中脉沿着中心向下延伸，像一根脊梁骨。"},{"en":"You can often identify a plant by the shape of its leaves and the thickness of the midrib.","zh":"你常常可以通过叶形以及中脉的粗细来辨认植物。"}]}],"synonyms":["main vein","primary vein"],"phonetic":"/ˈmɪdˌrɪb/","extraExplanation":["“midrib”是植物学常用词：mid-（中间的）+ rib（肋骨、支撑条），形象地把叶片中间最粗的叶脉比作“肋骨/骨架”。在一些资料里也会写作“midrib”或“midrib vein”。"]}
{"word":"midribbed","summary":{"en":"“Midribbed” describes a leaf with a clearly visible central vein (midrib).","zh":"“midribbed”形容叶片中肋（主脉）清晰可见、较突出。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a midrib (the main central vein) that is noticeable or prominent, especially in a leaf.","zh":"（尤指叶片）具明显中肋的；中脉突出的。"},"examples":[{"en":"The plant has long, midribbed leaves that are easy to identify.","zh":"这种植物的叶子又长又有明显的中肋，很容易辨认。"},{"en":"Look for midribbed leaflets when checking whether this is a citrus tree.","zh":"辨认这是不是柑橘树时，可以留意小叶是否有明显中肋。"}]}],"synonyms":["prominently veined","with a prominent midrib","ribbed"],"phonetic":"/ˈmɪdˌrɪbd/","extraExplanation":["“midrib”指叶片中央最粗的主脉（中肋/中脉）；“-ed”在这里表示“具有……的”（如：two-legged 两条腿的）。因此 midribbed 就是“有中肋的”。","常见于植物学/园艺描述，用来帮助区分叶形与叶脉特征。"]}
{"word":"midribs","summary":{"en":"“Midribs” is the plural of “midrib,” meaning the main central vein of a leaf.","zh":"“midribs”是“midrib”的复数，指叶片中间的主脉（主筋）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central vein (main rib) of a leaf or leaf-like part, from which smaller veins branch","zh":"叶片的主脉；叶中间最粗的“主筋”，其他细脉从它分出"},"examples":[{"en":"The midrib runs down the center of the leaf and supports it.","zh":"主脉沿着叶片中间延伸，为叶片提供支撑。"},{"en":"You can see tiny veins branching out from the midrib.","zh":"你可以看到细小的叶脉从主脉分出来。"}]}],"synonyms":["main vein","central vein"],"phonetic":"/ˈmɪdˌrɪbz/","extraExplanation":["“midrib”是植物学常用词：mid-（中间）+ rib（肋骨/支撑条），形象地把叶子的主脉比作“肋骨”。","形式上常见单数 midrib / 复数 midribs。作为可数名词使用：a midrib, the midrib, midribs."]}
{"word":"midriff","summary":{"en":"Midriff means the area between your chest and waist, and it can also mean the bare waist/stomach area shown by some clothing.","zh":"midriff 指胸与腰之间的腰腹部；也可指衣着露出的腰腹部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The area of the body between the chest and the waist; the stomach/belly area (often used for the front of the body).","zh":"身体胸部与腰部之间的部位；腹部/肚子（常指身体前侧）。"},"examples":[{"en":"He felt a sharp pain in his midriff after the long run.","zh":"长跑后他在腹部感到一阵剧痛。"},{"en":"The jacket was too tight around her midriff.","zh":"这件夹克在她的腰腹部位太紧了。"}]},{"partOfSpeech":"n.","definition":{"en":"In fashion, the bare area of the waist and stomach shown by certain clothes (for example, a crop top).","zh":"（时尚用语）衣着露出的腰腹部位（例如穿短上衣时露出的部分）。"},"examples":[{"en":"The costume leaves the midriff uncovered.","zh":"这套服装会露出腰腹部。"},{"en":"A midriff-baring top is common in summer outfits.","zh":"露腰腹的上衣在夏季穿搭中很常见。"}]}],"synonyms":["abdomen","belly","stomach","waist"],"phonetic":"/ˈmɪdˌrɪf/","extraExplanation":["“midriff”由“mid-（中间）+ riff（古义：身体/躯干的一部分）”发展而来，现代主要指胸与腰之间的区域。","在不同语境里它既可以偏医学/日常描述（腹部疼痛），也常见于时尚与媒体表达（midriff-baring 露腰腹的）。"]}
{"word":"midriffs","summary":{"en":"Midriffs means the plural of midriff: the waist-and-belly area between the chest and the waist.","zh":"midriffs 是 midriff 的复数，指胸部与腰部之间的腰腹区域（腹部一带）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of the body between the chest and the waist; the stomach/abdomen area.","zh":"（人体的）腰腹部；胸部与腰部之间的部位；腹部。"},"examples":[{"en":"The workout targets your midriff and lower back.","zh":"这套训练主要锻炼你的腰腹部和下背部。"},{"en":"She wore a top that showed her midriff.","zh":"她穿了一件露出腰腹部的上衣。"}]}],"synonyms":["abdomen","belly","stomach","waist"],"phonetic":"/ˈmɪd.rɪf/","extraExplanation":["“midriff” 的复数是 “midriffs”。在日常英语里，它常出现在服装（比如 crop top/露脐装）和健身训练（核心肌群）语境中。","相关词：abdomen（更医学/中性：腹部），waist（腰围/腰部），core（健身语境：核心肌群）。"]}
{"word":"mids","summary":{"en":"“Mids” is an informal plural meaning either midterm exams, naval academy midshipmen, or (slang) medium-quality marijuana, depending on context.","zh":"“mids”是非正式复数用法，常指期中考试、海军学院学员，或（俚语）中等品质的大麻，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Midterm exams; tests held around the middle of a school term.","zh":"（非正式）期中考试；学期中段进行的测验。"},"examples":[{"en":"I can’t go out this week—I have mids.","zh":"这周我不能出去——我要考期中。"},{"en":"After mids, the schedule gets a little easier.","zh":"期中考之后，安排会轻松一点。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially in the U.S.) Midshipmen; students at a naval academy (often the U.S. Naval Academy).","zh":"（非正式，尤指美国）海军军官学校学员；（常指）美国海军学院学员。"},"examples":[{"en":"The mids marched in formation across the yard.","zh":"学员们列队行进穿过操场。"},{"en":"He’s a mid at the Naval Academy.","zh":"他是海军学院的学员。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) Marijuana of medium quality; not top-shelf.","zh":"（俚语）中等品质的大麻；不算顶级。"},"examples":[{"en":"They said it was mids, so expectations were low.","zh":"他们说是“中等货”，所以大家没抱太高期待。"},{"en":"He doesn’t buy mids—only premium stuff.","zh":"他不买“中等货”——只买高品质的。"}]}],"synonyms":["midterms","midterm exams","midshipmen","mids (USNA)"],"phonetic":"/mɪdz/","extraExplanation":["“mids”在校园语境里常见于“midterms”的简写，是否表示“期中考试”要看上下文（如课程、复习、考试周等）。","在美国军事院校语境里，“mids”常指美国海军学院（USNA）的“midshipmen（学员）”，属于校园身份称呼。","俚语“大麻中等品质”这一义项带有地区与圈层色彩，正式写作中通常避免使用。"]}
{"word":"midscale","summary":{"en":"“Midscale” means mid-range—between budget and luxury—often used to describe hotels, products, or market segments.","zh":"“midscale”指“中档/中端”，介于低端与高端之间，常用于酒店、商品或市场细分的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the middle range of size, price, or quality; not budget/basic and not luxury/high-end.","zh":"中档的；处于规模、价格或品质的中间水平（非低端也非高端）。"},"examples":[{"en":"They stayed at a midscale hotel—comfortable but not expensive.","zh":"他们住在一家中档酒店——舒适但不贵。"},{"en":"The company targets midscale customers who want good value.","zh":"这家公司瞄准追求高性价比的中档消费者。"}]},{"partOfSpeech":"n.","definition":{"en":"A middle segment of a market, especially used in business for hotels, retail, or housing.","zh":"（尤用于商业语境）市场的中端区间/细分市场，如酒店、零售或住房领域。"},"examples":[{"en":"Midscale is growing faster than the luxury segment in this region.","zh":"在这个地区，中端市场增长比奢华市场更快。"},{"en":"Their new brand is positioned in the midscale.","zh":"他们的新品牌定位在中端市场。"}]}],"synonyms":["mid-range","middle-market","moderately priced","midpriced"],"phonetic":"/ˈmɪdˌskeɪl/","extraExplanation":["“midscale”常见于酒店与商业分类（如 economy/budget → midscale → upscale → luxury）。在日常口语里，人们也常用“mid-range（中档的）”“moderately priced（价格适中）”来表达相近意思。","写法上也常见“mid-scale”带连字符；作形容词时更常用。"]}
{"word":"midseason","summary":{"en":"Midseason means the middle part of a season, often used for weather, sports, or TV schedules.","zh":"midseason指“季节/赛季的中期”，常用于天气、体育和电视排期等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The middle part of a season (such as midwinter, midsummer), or the time about halfway through a sports or TV season.","zh":"某个季节的中期（如隆冬、盛夏），或体育赛季/电视剧一季进行到一半左右的时间。"},"examples":[{"en":"Midseason storms can be intense, so check the weather before traveling.","zh":"季节中期的风暴可能很强烈，所以出行前要查看天气。"},{"en":"The team made a midseason trade to strengthen their defense.","zh":"球队在赛季中期做了一笔交易来加强防守。"},{"en":"The show takes a break and returns with a midseason premiere in January.","zh":"这部剧中途会休更，并在一月以“季中回归首播”回归。"}]},{"partOfSpeech":"n.","definition":{"en":"The middle point or middle period of a season.","zh":"季节（或赛季）的中段/中期。"},"examples":[{"en":"By midseason, the days are noticeably longer.","zh":"到了季节中期，白天明显变长了。"},{"en":"In midseason, ticket prices often rise.","zh":"在赛季中期，票价常常会上涨。"}]}],"synonyms":["middle of the season","midseasonal"],"phonetic":"/ˌmɪdˈsiːzən/","extraExplanation":["在美式英语里，midseason常见于体育与电视行业：midseason trade（赛季中期交易）、midseason break/hiatus（季中休赛/停播）、midseason finale/premiere（季中大结局/回归首播）。拼写通常不加连字符：midseason（而不是mid-season）。"]}
{"word":"midsection","summary":{"en":"Midsection means the middle part—most commonly the waist-and-stomach area of the body, and more generally the middle part of something.","zh":"midsection指“中部”，最常见是指人体的腰腹部；也可泛指某物的中间部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of the body, especially the area around the waist and stomach; the torso between the chest and hips.","zh":"身体的中部，尤其指腰腹一带；介于胸部和臀部之间的躯干部分。"},"examples":[{"en":"He injured his midsection during the game.","zh":"他在比赛中伤到了腰腹部。"},{"en":"Exercises like planks can strengthen your midsection.","zh":"平板支撑这类训练可以增强你的核心/腰腹力量。"}]},{"partOfSpeech":"n.","definition":{"en":"The middle part of something (for example, a section of a story, building, or object).","zh":"某物的中间部分（例如故事、建筑或物体的中段）。"},"examples":[{"en":"The midsection of the movie is a little slow, but the ending is great.","zh":"电影的中段有点拖沓，但结尾很精彩。"},{"en":"There is a crack in the midsection of the wall.","zh":"墙的中段有一道裂缝。"}]}],"synonyms":["middle","midriff","waistline","center","middle part"],"phonetic":"/ˈmɪdˌsɛkʃən/","extraExplanation":["“midsection”在健身语境中常常接近“core（核心肌群）”，但不完全等同：core更强调深层稳定肌群（如腹横肌、竖脊肌等），而midsection更偏“腰腹这一片区域”的日常说法。"]}
{"word":"midsemester","summary":{"en":"Midsemester means the middle of a school semester or something happening at that time.","zh":"midsemester 指学期中段，或发生在学期中段的事情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening in the middle of a school semester (around the halfway point).","zh":"发生在学期中段的；接近学期一半时的。"},"examples":[{"en":"We have a midsemester exam in October.","zh":"我们十月有一次期中（学期中段）考试。"},{"en":"She felt stressed during the midsemester rush of projects.","zh":"在学期中段项目扎堆的时候，她感到压力很大。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle part of a school semester; the time around the midpoint of a semester.","zh":"学期中段；学期过半前后的一段时间。"},"examples":[{"en":"Midsemester is a good time to review your study plan.","zh":"学期中段是回顾学习计划的好时机。"},{"en":"At midsemester, many students start preparing for major exams.","zh":"到了学期中段，很多学生开始为重要考试做准备。"}]}],"synonyms":["mid-semester","midterm (context-dependent)","halfway through the semester"],"phonetic":"/ˌmɪdˈsɛmɪstɚ/","extraExplanation":["“midsemester”在美式英语里也常写作“mid-semester”（更常见、也更符合许多写作规范）。作形容词时通常放在名词前：mid(-)semester exam / mid(-)semester break。"]}
{"word":"midsentence","summary":{"en":"“Midsentence” means “in the middle of a sentence,” often describing an interruption or something occurring before the sentence is finished.","zh":"“midsentence”表示“在一句话的中间”，常用来描述说话/写作时被打断或句子尚未结束时发生的事情。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the middle of a sentence; occurring before the sentence is finished.","zh":"在一句话的中间；发生在句子尚未结束之前。"},"examples":[{"en":"He stopped midsentence when he realized he had said too much.","zh":"他话说到一半就停下了，因为他意识到自己说得太多了。"},{"en":"The phone rang midsentence, and she lost her train of thought.","zh":"电话在她讲到一半时响了，她一下子思路断了。"},{"en":"Please don’t interrupt me midsentence.","zh":"请不要在我说到一半时打断我。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening or placed in the middle of a sentence (often describing punctuation, capitalization, or an interruption).","zh":"发生在句子中间的（常用来描述标点、大写规则或中断）。"},"examples":[{"en":"You usually don’t capitalize a word mid-sentence unless it’s a name.","zh":"通常在句中你不会把单词首字母大写，除非它是专有名词。"},{"en":"Editors avoid dramatic line breaks mid-sentence.","zh":"编辑通常会避免在句子中间突然断行。"}]}],"synonyms":["mid-sentence","halfway through a sentence","in the middle of a sentence"],"phonetic":"/ˌmɪdˈsɛntəns/","extraExplanation":["更常见的拼写是 **mid-sentence**（带连字符），也常写作 **mid sentence**。写法取决于风格指南；作为形容词放在名词前时（如 mid-sentence interruption）更倾向用连字符。"]}
{"word":"midship","summary":{"en":"Midship means in or near the middle of a ship, or describing something located there.","zh":"midship 指“在船的中部/靠近船体中心”，也可作形容词表示“位于船中部的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"The middle part of a ship; the area around the center of the vessel.","zh":"船的中部；靠近船体中心的区域。"},"examples":[{"en":"The cabins are located midship, where the motion is usually gentler.","zh":"船舱位于船的中部，那里通常摇晃会小一些。"},{"en":"They loaded the heaviest cargo midship to keep the ship balanced.","zh":"他们把最重的货物装在船中部，以保持船只平衡。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located in the middle part of a ship.","zh":"位于船中部的。"},"examples":[{"en":"Our seats were in a midship section of the ferry.","zh":"我们的座位在渡轮的船中部区域。"},{"en":"A midship cabin is often preferred by travelers who get seasick easily.","zh":"容易晕船的旅客通常更喜欢船中部的舱房。"}]}],"synonyms":["amidships","in the middle of the ship","central"],"phonetic":"/ˈmɪdˌʃɪp/","extraExplanation":["在航海英语里，midship（或 amidships）常用于描述位置：例如“midship cabin（船中部船舱）”“midship section（船中部区域）”。把重物放在船中部有助于稳定与配重。","注意：midship 不等于 midshipman。midshipman 指“海军军官学员/见习军官”（尤其在美国海军学院或英国皇家海军语境中）。"]}
{"word":"midshipman","summary":{"en":"A midshipman is a naval officer in training; historically, a young officer associated with the middle of a ship.","zh":"midshipman 指海军军官学员；历史上也指帆船时代与船中部相关的青年见习军官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naval officer in training (especially in the U.S. Navy or the British Royal Navy); a student preparing to become an officer.","zh":"海军军官学员；（尤指美国海军或英国皇家海军的）军官见习生。"},"examples":[{"en":"Her brother is a midshipman at the U.S. Naval Academy.","zh":"她哥哥是美国海军学院的海军军官学员。"},{"en":"As a midshipman, he learned navigation, leadership, and life at sea.","zh":"作为一名海军军官学员，他学习航海、领导力以及海上生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A young officer on a sailing ship who worked and lived around the middle part of the ship (the midships area).","zh":"（历史）帆船时代的青年军官，常在船体中部（midships）一带工作和生活。"},"examples":[{"en":"In old naval stories, the midshipman often starts as a teenager learning under senior officers.","zh":"在早期海军故事中，midshipman 常常是十几岁，在资深军官带领下学习。"},{"en":"The novel describes a midshipman standing watch through a storm.","zh":"小说描写一名见习军官在暴风雨中值更。"}]}],"synonyms":["naval cadet","officer cadet","cadet"],"phonetic":"/ˈmɪdˌʃɪpmən/","extraExplanation":["词源上 midshipman 与 midships（船中部）有关：早期这类年轻军官常在船中部工作、住宿，因此得名。","在现代语境里，它通常指“军官学员/候补军官”，并不表示普通水手。阅读海军题材小说时常见此词（如以英国海军为背景的航海小说中）。"]}
{"word":"midshipmanship","summary":{"en":"Midshipmanship means the rank/status or the training period of being a midshipman in the navy.","zh":"midshipmanship 指海军见习军官的身份/军衔，或担任见习军官的训练阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The position, rank, or status of being a midshipman (a naval officer in training).","zh":"海军见习军官（midshipman）的身份、职位或军衔（指受训阶段）。"},"examples":[{"en":"He received his midshipmanship at the naval academy and began training at sea.","zh":"他在海军学院获得见习军官身份，并开始海上训练。"},{"en":"During her midshipmanship, she learned navigation, seamanship, and leadership.","zh":"在见习军官时期，她学习了航海、操舰技能和领导力。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of time someone serves as a midshipman.","zh":"担任海军见习军官的一段时期。"},"examples":[{"en":"His midshipmanship lasted two years before he became a commissioned officer.","zh":"他的见习军官期持续了两年，之后才正式授衔成为军官。"},{"en":"Stories from her midshipmanship often focus on strict routines and teamwork.","zh":"她讲述的见习军官时期的故事常常围绕严格的作息和团队合作。"}]}],"synonyms":["midshipman status","naval cadetship","cadetship"],"phonetic":"/ˈmɪdˌʃɪpmənˌʃɪp/","extraExplanation":["“midshipman”历史上常指在军舰上学习航海与作战的年轻军官学员；“midshipmanship”就是“成为/担任midshipman的身份或阶段”。不同国家海军制度略有差异，但核心含义都是“军官培养中的学员身份”。"]}
{"word":"midshipmen","summary":{"en":"Midshipmen are naval officer trainees (often academy students); historically, the term also referred to the ship’s middle area linked to their quarters.","zh":"Midshipmen 指海军见习军官/海军学院学员；历史上也可指与其住舱相关的船中部区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naval officer in training, usually a student at a naval academy or a junior officer candidate on a ship.","zh":"海军见习军官；（多指）海军学院学员；在舰上接受训练的初级军官候选人。"},"examples":[{"en":"She became a midshipman at the U.S. Naval Academy.","zh":"她进入美国海军学院，成为一名海军见习军官学员。"},{"en":"The midshipmen learned basic seamanship during their summer cruise.","zh":"见习军官们在暑期航训中学习了基本的航海技能。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) The area of a ship around the middle section, where junior officers once lived and worked.","zh":"（历史用法）船的中部区域；过去初级军官常居住与工作的船中部。"},"examples":[{"en":"In older ships, the midshipmen’s quarters were near the midships area.","zh":"在较早期的舰船上，见习军官的住舱常在船中部附近。"}]}],"synonyms":["naval cadet","officer cadet","cadet"],"phonetic":"/ˈmɪdˌʃɪpmən/","extraExplanation":["“Midshipman”来自“midships”（船中部）。早期英国海军中，见习军官常在船中部一带学习航海与舰务，因此得名。现代用法主要指海军学院学员或见习军官，不一定与船上具体位置有关。","英美军语中该词带有明确的制度背景：通常是正规培养体系里的“军官候补/学员”，与普通水兵（sailor）不同。不同国家的军衔体系略有差异，但“受训中的军官学员”这一核心含义相近。"]}
{"word":"midshipmite","summary":{"en":"An informal, often humorous word for a naval academy trainee (a midshipman), especially a very junior one.","zh":"非正式、常带调侃的说法，指海军学院学员/见习军官（midshipman），尤指资历很浅的新学员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A midshipman; a naval officer trainee, especially at a naval academy (often used humorously for a very junior cadet).","zh":"（非正式）海军军官学员；见习军官（尤指海军学院的学员，常带调侃意味，强调“很菜/很新”）。"},"examples":[{"en":"As a midshipmite, he spent most of his time learning basic seamanship and following orders.","zh":"作为一名“midshipmite”（海军学员），他大部分时间都在学基础航海技能、按命令做事。"},{"en":"The captain teased the midshipmites for their spotless uniforms and nervous salutes.","zh":"舰长打趣这些新学员：制服一尘不染，敬礼却紧张得不行。"}]}],"synonyms":["midshipman","naval cadet","officer trainee"],"phonetic":"/ˈmɪdˌʃɪpˌmaɪt/","extraExplanation":["“midshipmite”多见于口语或诙谐写法，可理解为在“midshipman”（海军学员/候补军官）基础上加了带“小不点儿/小家伙”感觉的后缀“-mite”，用来强调资历很浅、年纪很小或经验不足。","在美国语境中，“midshipman”常指美国海军学院（USNA）学员；在英国传统语境中也可指海军见习军官。写作时若需正式表达，通常用“midshipman”。"]}
{"word":"midships","summary":{"en":"Midships means in or near the middle part of a ship.","zh":"Midships 指在船体中部或靠近船的中间位置。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"the middle part of a ship (around the center, between the bow and the stern)","zh":"（船的）中部；船体中央（介于船头与船尾之间）"},"examples":[{"en":"The cabins are located midships, so the ride is usually steadier there.","zh":"船舱位于船体中部，所以在那里乘坐通常更平稳。"},{"en":"The lifeboats were stored midships on both sides of the vessel.","zh":"救生艇被存放在船体中部两侧。"}]},{"partOfSpeech":"adj.","definition":{"en":"located in the middle of a ship","zh":"位于船体中部的；船中部的"},"examples":[{"en":"They heard a loud bang from the midships area.","zh":"他们听到船体中部区域传来一声巨响。"},{"en":"A midships compartment is often used for storage or crew space.","zh":"船中部的舱室常用于储物或船员空间。"}]}],"synonyms":["amidships","in the middle of the ship","center of the ship"],"phonetic":"/ˈmɪdˌʃɪps/","extraExplanation":["“midships”常见于航海、海事新闻、小说或历史写作中，用来精确描述船上位置。与“in the middle of the ship”相比，它更简洁、更专业。","相关方位词：bow（船头）、stern（船尾）、port（左舷）、starboard（右舷）。读海事/冒险题材作品时，这些词常一起出现，帮助你在脑中“定位”场景。"]}
{"word":"midsize","summary":{"en":"Midsize means medium-sized—between small and large, often used for companies, cars, or products.","zh":"midsize 表示“中等规模的”，介于小和大之间，常用于公司、汽车或产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something, especially a company, car, or product) medium in size; between small and large.","zh":"（尤指公司、汽车或产品）中等规模的；介于小型和大型之间的。"},"examples":[{"en":"She works at a midsize tech company with about 500 employees.","zh":"她在一家中型科技公司工作，大约有500名员工。"},{"en":"We’re looking for a midsize SUV that’s easier to park than a full-size one.","zh":"我们在找一辆中型SUV，比全尺寸SUV更好停车。"},{"en":"Midsize cities can offer good jobs without the high costs of big cities.","zh":"中等城市可能既有不错的工作机会，又不像大城市那样生活成本高。"}]}],"synonyms":["medium-sized","mid-size","medium"],"phonetic":"/ˈmɪdˌsaɪz/","extraExplanation":["“midsize”也常写作“mid-size”。在商业语境中，“midsize company”通常指规模介于小企业和大型企业之间的公司，但不同国家/行业的具体人数或营收门槛不完全一致。","在汽车分类里，“midsize”常用于“midsize sedan / midsize SUV”，大致表示空间、油耗、价格都处于中间档位。"]}
{"word":"midspace","summary":{"en":"Midspace means an in-between or middle space, sometimes used figuratively for an in-between stage.","zh":"Midspace 指“中间/两者之间的空间”，也可比喻“过渡阶段”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle area or in-between space between two points, objects, or states; an intermediate region","zh":"中间的空间；两者之间的空隙；过渡地带"},"examples":[{"en":"The birds hovered in midspace between the cliff and the sea.","zh":"鸟儿盘旋在悬崖与大海之间的半空中。"},{"en":"A thin bridge of light seemed to hang in midspace.","zh":"一条细细的光带仿佛悬在半空中。"},{"en":"After the big change, she felt stuck in midspace—not the old life, not the new one yet.","zh":"经历巨大变化后，她觉得自己卡在过渡地带——既不是旧生活，也还没进入新生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the condition of being in the middle of a process or transition; an in-between stage","zh":"（较少见）处在过程中段；过渡期；“不上不下”的阶段"},"examples":[{"en":"The project is in midspace: the plan is clear, but the details aren’t finished.","zh":"项目正处在中间阶段：方案明确，但细节还没完成。"},{"en":"He described grief as a kind of midspace between what was and what will be.","zh":"他把悲伤描述为一种介于过去与未来之间的“中间地带”。"}]}],"synonyms":["in-between space","middle space","midair","intermediate area","limbo"],"phonetic":"/ˈmɪdˌspeɪs/","extraExplanation":["“midspace”在现代英语里不算常见，更常见的写法是“mid-space”（带连字符）或直接用“midair / in the middle / in-between space”等表达。","它常见于文学描写、科幻/奇幻语境或较具修辞色彩的写作，用来营造“悬浮、过渡、介于两者之间”的画面感。"]}
{"word":"midspaces","summary":{"en":"Midspaces means the in-between spaces or middle gaps between things (plural of midspace).","zh":"midspaces 指两者之间或中间的空隙/留白（midspace 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of midspace) spaces in the middle or in-between areas between two points, objects, or sections; an intermediate gap.","zh":"（midspace 的复数）位于中间的空间；两者之间的“中段空隙/过渡空间”。"},"examples":[{"en":"Leave some midspaces between the paragraphs to make the page easier to read.","zh":"段落之间留一些中间空白，会让页面更容易阅读。"},{"en":"The design uses midspaces to guide the eye from the title to the main text.","zh":"这个设计用中间留白把视线从标题引导到正文。"}]},{"partOfSpeech":"n.","definition":{"en":"In some technical or informal writing, midspaces can mean intermediate “slots” or “positions” within a range (for example, between low and high values).","zh":"在一些技术或非正式写法中，midspaces 也可指范围中的“中间档位/中间位置”（如低值与高值之间）。"},"examples":[{"en":"We tested the endpoints and a few midspaces to see how the system behaves.","zh":"我们测试了端点以及几个中间位置，看看系统如何表现。"}]}],"synonyms":["in-between spaces","gaps","intermediate spaces","whitespace","spacing"],"phonetic":"/ˈmɪdˌspeɪs/","extraExplanation":["“midspaces”不是非常常见的标准词，更多时候人们会写成“mid-spaces”或直接说“spaces in the middle / in-between spaces”。在正式写作里，如果指版面留白，可用“spacing / whitespace / gaps”；如果指范围中的中间值，可用“intermediate values / midpoints / middle positions”。"]}
{"word":"midspan","summary":{"en":"Midspan means the middle of a structural span (between supports), or something located there.","zh":"Midspan 指结构跨距（两支撑点之间）的中部/中点，也可作形容词表示“跨中的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle point or central area of a span (the distance between two supports), especially in a bridge, beam, or roof.","zh":"（两支撑点之间的）跨距中点或中部区域，尤指桥梁、梁或屋架等结构中的跨中。"},"examples":[{"en":"The crack appeared near midspan of the beam.","zh":"裂缝出现在梁的跨中附近。"},{"en":"Engineers measured the deflection at midspan during the load test.","zh":"工程师在荷载试验中测量了跨中挠度。"},{"en":"Place the sensor at midspan to capture the maximum bending response.","zh":"把传感器放在跨中以记录最大的弯曲响应。"}]},{"partOfSpeech":"adj.","definition":{"en":"located at or occurring at the middle of a span.","zh":"位于跨中（跨距中部）的；发生在跨中的。"},"examples":[{"en":"The midspan section needs extra reinforcement.","zh":"跨中截面需要额外加固。"},{"en":"They installed a midspan brace to reduce vibration.","zh":"他们安装了跨中支撑以减少振动。"}]}],"synonyms":["midpoint","center of the span","middle"],"phonetic":"/ˈmɪdˌspæn/","extraExplanation":["“midspan”常见于土木/结构工程语境。由于许多构件在跨中处弯矩或挠度往往最大，所以设计、监测与试验（如桥梁荷载试验）会特别关注“midspan deflection（跨中挠度）”“midspan moment（跨中弯矩）”等指标。"]}
{"word":"midst","summary":{"en":"Midst means “the middle” or “the time when something is happening,” often used in “in the midst of.”","zh":"Midst 表示“中间/当中”或“正当……之时”，最常见于短语 in the midst of。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle of a place, group, or situation; the part surrounded by others","zh":"（地方、群体或情境的）中间；当中；周围环绕之处"},"examples":[{"en":"She stood in the midst of the crowd and waved.","zh":"她站在人群当中挥手。"},{"en":"We found calm in the midst of chaos.","zh":"我们在混乱之中找到了平静。"}]},{"partOfSpeech":"n.","definition":{"en":"during the middle of an activity or event (often used in the phrase “in the midst of”)","zh":"在……之中；正当……的时候（常见于短语 “in the midst of”）"},"examples":[{"en":"In the midst of dinner, the power went out.","zh":"正吃晚饭时，停电了。"},{"en":"He called me in the midst of a meeting.","zh":"他在我开会的时候给我打电话。"}]}],"synonyms":["middle","center","heart","middle of"],"phonetic":"/mɪdst/","extraExplanation":["“midst”语气偏书面或文学，比“middle”更有画面感，常用于强调被某种环境包围：in the midst of chaos（在混乱之中）、in the midst of war（在战争之中）。","固定搭配最常见的是“in the midst of + 名词/动名词”：in the midst of a storm / in the midst of doing homework。口语里也常用“in the middle of”。"]}
{"word":"midstead","summary":{"en":"Midstead means the middle or central part—similar to “the midst.”","zh":"midstead 指“中间/中央”，相当于 the midst（较偏文学、少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part or central position of a place, area, or situation; the midst","zh":"（地方、区域或情境的）中央；中间；当中"},"examples":[{"en":"They stood in the midstead of the crowd, trying not to get separated.","zh":"他们站在人群的当中，尽量不走散。"},{"en":"A small fire burned in the midstead of the camp.","zh":"营地中央燃着一小堆火。"}]}],"synonyms":["the midst","the middle","center","middle ground"],"phonetic":"/ˈmɪdˌstɛd/","extraExplanation":["“midstead”较少见，语体偏古旧或文学化，常见同义表达是“the midst”“the middle”。在现代日常英语中更常用：in the middle (of), in the midst (of)。","词形可拆为 mid-（中间）+ stead（位置、地点；同源于古英语，和“instead”里的“stead”同根）。因此它字面意思就是“中间的位置”。"]}
{"word":"midstories","summary":{"en":"Midstories is an uncommon compound that can mean either the middle part of narratives or (less commonly) the middle floors of a building.","zh":"Midstories 是不太常见的合成写法，可指（1）故事的中段，或（2）较少见地指建筑的中间楼层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of stories (narratives), especially the section between the beginning and the ending","zh":"（故事/叙事的）中段；介于开头与结尾之间的部分"},"examples":[{"en":"The book is slow in the midstories but becomes exciting near the end.","zh":"这本书在中段节奏较慢，但接近结尾时变得很精彩。"},{"en":"She rewrote the midstories to make the characters’ choices clearer.","zh":"她重写了故事的中段，让人物的选择更清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle floors (stories) of a building (less common; usually written as “mid-stories” or said as “the middle stories”)","zh":"（建筑的）中间楼层（较少见；通常写作“mid-stories”或说“middle stories”）"},"examples":[{"en":"The fire was contained to the mid-stories of the office tower.","zh":"火势被控制在办公楼的中间楼层。"},{"en":"They rented a unit on the mid-stories for a better view and less street noise.","zh":"他们在中间楼层租了一套房，这样视野更好、街噪也更少。"}]}],"synonyms":["the middle of the story","middle chapters","midsection","middle floors","middle stories"],"phonetic":"/ˈmɪdˌstɔriz/","extraExplanation":["“midstories”不是非常常见的标准拼写，更常见的是分开写或加连字符（mid-stories / middle stories）。如果你是在写书评或剧情分析，用“the middle of the story / the middle chapters”会更自然。","如果你指的是建筑楼层，英语里“story”在美式英语中表示“楼层”，复数是“stories”。表达“中间楼层”通常说“the middle floors”或“the middle stories”。","如果“midstories”是品牌名、用户名或标题，也可能是刻意的创意拼写；这类用法通常不需要按常规词汇去解释。"]}
{"word":"midstory","summary":{"en":"Midstory (often mid-story) means “in the middle of a story” or “the middle part of a story.”","zh":"midstory（常写作 mid-story）表示“在故事中途/讲到一半”，也可指“故事的中段”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of a story, narrative, or event (often written with a hyphen: mid-story).","zh":"发生在故事、叙事或事件的中段（常写作带连字符的 mid-story）。"},"examples":[{"en":"I was midstory when the phone rang, so I lost my place.","zh":"我正讲到一半电话就响了，所以我一下子忘了讲到哪里了。"},{"en":"The author introduces a new character midstory to change the pace.","zh":"作者在故事中段引入新角色来改变节奏。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the middle of telling or reading a story; halfway through the narrative.","zh":"在讲故事或读故事的过程中间；讲到/读到一半。"},"examples":[{"en":"She stopped midstory and asked, “Do you get it?”","zh":"她讲到一半停下来问：“你明白吗？”"},{"en":"I had to leave midstory, so tell me how it ends later.","zh":"我得在你讲到一半时离开，之后再告诉我结局。"}]},{"partOfSpeech":"n.","definition":{"en":"The middle part of a story; the central section of a narrative (less common).","zh":"故事的中段；叙事的中间部分（较少见）。"},"examples":[{"en":"The midstory is slower, but the ending is exciting.","zh":"故事中段节奏比较慢，但结尾很精彩。"}]}],"synonyms":["mid-story","midway through the story","halfway through the story","in the middle of the story"],"phonetic":"/ˈmɪdˌstɔri/","extraExplanation":["“midstory / mid-story”不是特别固定的标准词，写作中更常见的是带连字符的“mid-story”，意思就是“在故事中途/讲到一半”。也可以用更常见的表达：“in the middle of the story / halfway through the story / midway through the story”。"]}
{"word":"midstout","summary":{"en":"“midstout” isn’t a standard word; you probably mean “midst” = the middle of / in the middle of something.","zh":"“midstout”不是标准单词；你很可能想写“midst”，意思是“在……之中/中间”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo for “midst” (meaning “the middle of”) or a mistaken combination like “mid(st) + stout.”","zh":"不是标准英语单词。它很可能是把“midst”（表示“在……之中/中间”）拼错了，或误把两个词（如 mid + stout）连在一起。"},"examples":[{"en":"Did you mean “midst” in “in the midst of trouble” (during a difficult time)?","zh":"你是不是想写“midst”，比如“in the midst of trouble”（在困难之中/困难时期）？"},{"en":"If you meant “mid + stout,” that would refer to a kind of dark beer (stout), but it’s not written as one word in standard English.","zh":"如果你想表达“mid + stout”，可能是在说一种黑啤（stout），但标准英语里不会写成一个词。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) “midst”: the middle of a place, group, or period of time; surrounded by something.","zh":"（可能你想写的词）“midst”：某个地方/人群/时间段的中间；在……之中，被……包围。"},"examples":[{"en":"She found herself in the midst of a crowd.","zh":"她发现自己在人群之中。"},{"en":"We had to make a decision in the midst of the crisis.","zh":"我们不得不在危机之中做决定。"},{"en":"He laughed amidst the noise (also written “amid”/“amidst”).","zh":"他在喧闹声中笑了（也可写作“amid”/“amidst”）。"}]}],"synonyms":["midst","middle","center","in the middle of","amid","amidst"],"phonetic":"/mɪdst/","extraExplanation":["“midst”常见搭配是“in the midst of + 名词/动名词”，意思是“在……过程中/在……之中”。例如：in the midst of a meeting（开会正进行时）。","“amid”与“amidst”意思相近；“amidst”更偏正式或文学一些。","如果你能提供你看到“midstout”的句子或上下文，我可以更准确判断你想表达的词。"]}
{"word":"midstream","summary":{"en":"Midstream means “in the middle of a river” or, more commonly, “in the middle of an ongoing process,” often implying that changing direction is difficult.","zh":"midstream指“在河中央”，更常见的引申义是“在事情进行到一半时”，常含有“中途改动不容易、风险较大”的语感。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in the middle of a process or activity (while it is happening)","zh":"在进行过程中；半途（事情正在发生时）"},"examples":[{"en":"We changed the plan midstream because the weather got worse.","zh":"因为天气变差，我们在进行过程中临时改了计划。"},{"en":"It’s hard to switch careers midstream, but it’s possible.","zh":"半途转行很难，但也不是不可能。"}]},{"partOfSpeech":"adv.","definition":{"en":"in the middle of a river or stream","zh":"在河流（或溪流）的中央"},"examples":[{"en":"The boat stopped midstream for a moment.","zh":"船在河中央停了一会儿。"},{"en":"A large rock rose midstream.","zh":"河中央露出一块大石头。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle part of a process, activity, or river","zh":"（过程、活动或河流的）中段；中途"},"examples":[{"en":"They joined the project in midstream.","zh":"他们在项目进行到一半时加入。"},{"en":"Midstream is not the best time to introduce new rules.","zh":"中途并不是引入新规则的最佳时机。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening in the middle of a process or activity","zh":"发生在进行中途的；半途的"},"examples":[{"en":"The company made a midstream adjustment to its budget.","zh":"公司在执行过程中对预算做了中途调整。"},{"en":"Midstream changes confused the team.","zh":"半途的变化让团队很困惑。"}]}],"synonyms":["halfway","in the middle","partway","midway","during"],"phonetic":"/ˈmɪdˌstriːm/","extraExplanation":["“midstream”既有字面意思“在河中央”，也常用作比喻，表示“事情进行到一半”。这种比喻来自“河流正在流动，人在水中间很难突然改变方向”，所以常带有“中途改变不容易、风险更高”的语感。","常见搭配：change/switch/adjust midstream（中途改变/转换/调整）；midstream change/shift/adjustment（中途的改变/转变/调整）。","写作或正式语境中也会看到引申用法，如：midstream correction（中途纠正）、midstream revision（中途修订）。"]}
{"word":"midstreams","summary":{"en":"Midstream means the middle of a river’s flow, or (more commonly in modern writing) the middle of an ongoing process.","zh":"midstream 指河流的中段/主流；也常比喻事情进行到一半、在中途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of a river or flowing stream; the main current","zh":"（河流/溪流的）中段；主流、水流最深或最急的地方"},"examples":[{"en":"The boat drifted into midstream and the current sped up.","zh":"小船漂到了河中央，水流变得更急了。"},{"en":"Stay near the bank—midstream can be dangerous.","zh":"靠近岸边——河中央可能很危险。"}]},{"partOfSpeech":"adv.","definition":{"en":"in the middle of a process, event, or activity (often implying it is already underway)","zh":"（事情/过程）进行到一半；在中途（常含“已经开始、难以停下或改变”之意）"},"examples":[{"en":"We changed the plan midstream because the weather got worse.","zh":"因为天气变差，我们在进行到一半时改了计划。"},{"en":"It’s hard to switch teachers midstream.","zh":"课程上到一半再换老师很难。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or done in the middle of an ongoing process","zh":"（在进行中的过程里）中途发生的；半途的"},"examples":[{"en":"A midstream correction saved the project.","zh":"一次中途纠正挽救了这个项目。"},{"en":"They made a midstream decision to leave early.","zh":"他们中途决定提前离开。"}]}],"synonyms":["middle of the river","main current","midway","in the middle","halfway through"],"phonetic":"ˌmɪdˈstriːm","extraExplanation":["“midstream(s)”既可用于字面意思（河中央），也常用作比喻，表示“事情做到一半时”。在商业、政策、学习等语境里很常见。","你输入的“midstreams”通常是名词复数（多条河流/多处河中央），或用于特定写作风格中；更常见的基本形式是“midstream”。"]}
{"word":"midstreet","summary":{"en":"Midstreet means “in/at the middle of a street,” usually describing where something is or happens.","zh":"midstreet 指“在街道中间”，通常用来描述某事物所在位置或发生地点。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in the middle of a street (often used to describe a position or movement)","zh":"在街道的中间（常用于描述位置或移动）"},"examples":[{"en":"A delivery truck stopped midstreet and blocked traffic.","zh":"一辆送货卡车停在街道中央，堵住了交通。"},{"en":"Don’t cross midstreet—use the crosswalk.","zh":"不要在街道中间横穿——请走人行横道。"}]},{"partOfSpeech":"adj.","definition":{"en":"located in or toward the middle of a street","zh":"位于街道中部的；朝向街道中部的"},"examples":[{"en":"The puddle formed midstreet after the storm.","zh":"暴风雨过后，街道中间积起了一滩水。"},{"en":"They painted a temporary midstreet line to guide drivers.","zh":"他们画了一条临时的街道中间标线来引导司机。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle part of a street","zh":"街道的中间部分"},"examples":[{"en":"Midstreet was covered with gravel during construction.","zh":"施工期间，街道中间部分铺满了碎石。"}]}],"synonyms":["in the middle of the street","mid-street","in the center of the street","midway across the street"],"phonetic":"/ˈmɪdˌstrit/","extraExplanation":["“midstreet”并不是非常常见的标准词；写作中更常见的是分开写或用连字符：in the middle of the street / mid-street。","在交通与安全语境里，更自然的表达通常是“midway across the street（走到马路中间）”“in the roadway（在车行道上）”“in the center of the street（在街道中心）”。"]}
{"word":"midstroke","summary":{"en":"Midstroke means “in the middle of a stroke,” often describing something happening during a movement like swimming, painting, or a machine’s cycle.","zh":"midstroke表示“在一次划动/一笔/一个动作行程的中间”，常用来描述游泳、绘画或机械运动过程中发生的变化或中断。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening or done in the middle of a stroke (a single movement or cycle, especially in swimming, rowing, painting, or a machine’s motion).","zh":"发生在“一次划动/一笔/一个动作周期”的中间（常见于游泳、划船、绘画或机械运动等语境）。"},"examples":[{"en":"The swimmer corrected her hand position midstroke.","zh":"游泳运动员在划水的中途调整了手的位置。"},{"en":"He paused midstroke, with the brush still touching the canvas.","zh":"他在落笔中途停住了，画笔还贴在画布上。"}]},{"partOfSpeech":"adv.","definition":{"en":"in the middle of making a stroke (used like an adverb).","zh":"在一次划动/一笔/一个动作进行到一半时（作副词用）。"},"examples":[{"en":"The engine cut out midstroke, and the machine stopped abruptly.","zh":"发动机在动作进行到一半时熄火了，机器突然停下。"},{"en":"She turned her head midstroke to check her lane.","zh":"她在划水中途转头确认自己的泳道。"}]}],"synonyms":["halfway through a stroke","in mid-motion","mid-action","mid-swing"],"phonetic":"/ˈmɪdˌstroʊk/","extraExplanation":["“mid-”表示“在……中间”，stroke常指“一次划动/一笔/一次击打/一个往复行程”。因此midstroke多用于描述动作正在进行到一半时发生的改变或中断。","在工程/机械语境里，stroke也可指活塞或机械部件的“行程”（一次往复移动）；midstroke表示“行程中段”。"]}
{"word":"midsts","summary":{"en":"“Midsts” is the plural of “midst,” meaning the middle or the center of a place, time, or situation.","zh":"“midsts”是“midst”的复数，表示某地、某段时间或某种处境的中间/中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “midst”) the middle part of something; the center of a place, time, or situation.","zh":"（“midst”的复数）某事物的中间部分；某地、某段时间或某种处境的中心。"},"examples":[{"en":"The hikers stopped in the midsts of the trees to rest.","zh":"徒步者在树林的中央停下来休息。"},{"en":"In the midsts of many changes, she stayed calm.","zh":"在许多变化的中心（/之中），她仍然保持冷静。"}]}],"synonyms":["centers","middles","hearts"],"phonetic":"/mɪdst/","extraExplanation":["“midsts”是名词“midst”的复数形式，但在日常英语中更常用单数“midst”，尤其是固定搭配“in the midst of + 名词/动名词”（意为“在……之中/在……期间”）。","“midst”语气比“middle”更书面、更强调“身处其中”的感觉：in the midst of a storm（在暴风雨中）、in the midst of a conversation（在谈话进行中）。"]}
{"word":"midstyled","summary":{"en":"Midstyled describes something designed in a mid-period style, most commonly mid-century (mid-century modern).","zh":"midstyled 指“中期风格”的，多数情况下特指 20 世纪中叶（mid-century / mid-century modern）风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"styled in a “mid-” period way (most often meaning mid-century style, especially mid-century modern design).","zh":"具有“中期/中世纪中叶（最常指20世纪中叶）”风格的；带有中期风格特点的（常用于室内设计、家具、服装等）。"},"examples":[{"en":"They furnished the apartment with midstyled chairs and a simple wooden table.","zh":"他们用中期风格的椅子和一张简洁的木桌布置了公寓。"},{"en":"The cafe feels midstyled, with warm wood tones and clean lines.","zh":"这家咖啡馆很有中期风格：温暖的木色和利落的线条。"}]}],"synonyms":["mid-century styled","mid-century","mid-century modern","retro-styled","vintage-inspired"],"phonetic":"/ˈmɪdˌstaɪld/","extraExplanation":["“midstyled”不是非常常见或固定的标准拼写。更常见的写法是加连字符：mid-styled。","在设计语境里，人们更常直接说“mid-century”或“mid-century modern”（中世纪中叶/中世纪现代主义风格），例如：mid-century furniture、mid-century modern sofa。","如果你是在商品标题或标签里看到“midstyled”，它往往是一种简写/营销用词，意思通常等同于“mid-century styled”。"]}
{"word":"midsummer","summary":{"en":"Midsummer means the middle of summer, often referring to the time around the summer solstice.","zh":"midsummer 指“仲夏、夏季中期”，常指夏至前后的一段时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of summer; the period around the summer solstice (around June 21 in the Northern Hemisphere)","zh":"仲夏；夏季的中期；（北半球）夏至前后的一段时间（约6月21日前后）"},"examples":[{"en":"In midsummer, the days are long and the evenings stay light.","zh":"在仲夏时，白天很长，傍晚也很晚才天黑。"},{"en":"They got married in midsummer when the weather was warm.","zh":"他们在仲夏结婚，那时候天气很暖和。"},{"en":"This plant flowers in midsummer.","zh":"这种植物在仲夏开花。"}]}],"synonyms":["mid-summer","the height of summer"],"phonetic":"/ˌmɪdˈsʌmɚ/","extraExplanation":["“Midsummer”在英语文化中常和“夏至（summer solstice）”联系在一起。北欧一些国家有“Midsummer”庆祝活动（如瑞典的仲夏节），常见元素包括花环、篝火、户外聚会等。","文学上最著名的相关作品是莎士比亚的喜剧《A Midsummer Night’s Dream》（《仲夏夜之梦》）。这里的“midsummer”带有“夏夜、魔法、梦幻”的文化联想。"]}
{"word":"midsummerish","summary":{"en":"Midsummerish means “like midsummer”—warm, bright, and strongly summer-like in mood.","zh":"midsummerish 指“像盛夏一样的”——温暖、明亮、具有浓厚夏日氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities of midsummer; warm, bright, and fully summer-like in feeling.","zh":"带有盛夏特征的；感觉温暖、明亮、很“夏天”的。"},"examples":[{"en":"The air felt midsummerish even though it was only late May.","zh":"虽然才五月下旬，空气却带着盛夏般的感觉。"},{"en":"We had a midsummerish evening—long light, soft breezes, and people eating outside.","zh":"我们度过了一个盛夏般的夜晚——天色很久才暗下来，微风轻拂，人们在户外用餐。"},{"en":"Her painting uses midsummerish colors: gold sunlight, deep greens, and bright blues.","zh":"她的画用了盛夏般的色彩：金色阳光、浓绿和明亮的蓝。"}]}],"synonyms":["summery","summerlike","warm","sunny"],"phonetic":"/ˌmɪdˈsʌmərɪʃ/","extraExplanation":["“midsummerish”由“midsummer（仲夏/盛夏）+ -ish”构成，-ish 常表示“有点像……、带……的感觉”，所以它通常带有一种主观氛围：不一定真在盛夏，只是“很像盛夏”。","在文学文化联想上，英语里“midsummer”常让人想到莎士比亚的《A Midsummer Night’s Dream（仲夏夜之梦）》，因此该词有时也会带一点梦幻、轻盈、浪漫的季节氛围。"]}
{"word":"midsummers","summary":{"en":"Midsummer means the middle of summer (around the summer solstice) and can also refer to the summer-solstice festival; it can be used as an adjective too.","zh":"midsummer 指盛夏（夏至前后），也可指夏至庆典（仲夏节）；还可作形容词表示“盛夏的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of summer; the period around the summer solstice (late June in the Northern Hemisphere)","zh":"盛夏；夏季中期；（尤指北半球）夏至前后的一段时间（约6月下旬）"},"examples":[{"en":"It can be unbearably hot at midsummer.","zh":"盛夏时可能热得让人受不了。"},{"en":"We usually take our vacation in midsummer.","zh":"我们通常在盛夏度假。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a traditional celebration held around the summer solstice, especially in Northern Europe","zh":"（常大写）仲夏节；夏至庆典（尤见于北欧等地）"},"examples":[{"en":"Sweden celebrates Midsummer with dancing and flower crowns.","zh":"瑞典会用跳舞和花环来庆祝仲夏节。"},{"en":"They lit bonfires for Midsummer night.","zh":"他们在仲夏之夜点起篝火。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening in, typical of, or related to midsummer","zh":"盛夏的；发生在盛夏的；与盛夏相关的"},"examples":[{"en":"The midsummer sun stays up late.","zh":"盛夏的太阳很晚才落下。"},{"en":"We had a midsummer picnic by the lake.","zh":"我们在湖边来了一次盛夏野餐。"}]}],"synonyms":["mid-summer","high summer","summer solstice (festival sense)"],"phonetic":"/ˌmɪdˈsʌmər/","extraExplanation":["“midsummers”通常是名词复数，用来指“多个盛夏/多个夏至季节”：e.g., They spent two midsummers in the countryside（他们在乡下度过了两个盛夏）。更常见的词形是单数“midsummer”。","在文学与文化中，“midsummer”常让人联想到莎士比亚喜剧《A Midsummer Night’s Dream》（《仲夏夜之梦》），因此也带有“夏夜、魔幻、浪漫”的联想色彩。"]}
{"word":"midsummery","summary":{"en":"Midsummery means “like midsummer”—warm, bright, and strongly summer-like.","zh":"midsummery 意为“像盛夏一样的”，用于形容温暖明亮、很有夏日气息的感觉或景象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the feeling, weather, or qualities of midsummer; typical of the middle of summer (warm, bright, lush).","zh":"具有盛夏（仲夏）特征的；像夏季中期那样温暖、明亮、草木繁茂的。"},"examples":[{"en":"We had a midsummery afternoon—hot sun, blue sky, and a warm breeze.","zh":"那天下午很有盛夏的感觉——太阳很毒、天空湛蓝、微风温暖。"},{"en":"The garden looked midsummery, full of thick green leaves and bright flowers.","zh":"花园一派盛夏景象，绿叶浓密、鲜花明艳。"}]}],"synonyms":["midsummer-like","summery","summerlike","warm","sunny"],"phonetic":"/ˌmɪdˈsʌməri/","extraExplanation":["“midsummery”不算常见，更常用的是“midsummer”（名词：仲夏/盛夏）或“midsummer-like”（形容词：像盛夏的）。如果你是想写节日或季节概念，可能更适合用“midsummer”。","文化提示：英语里常见“midsummer”与莎士比亚作品《A Midsummer Night’s Dream》（《仲夏夜之梦》）相关；“midsummery”则更偏描写氛围/天气的文学化用法。"]}
{"word":"midtap","summary":{"en":"“Midtap” usually means a midpoint tap/connection in an electrical component (often written “mid-tap” or “center tap”).","zh":"“midtap”通常指电子元件上的中点抽头/分接点（常写作“mid-tap”或“center tap”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(electronics) A connection (tap) made at the midpoint of a winding, resistor, or cable, so you can access an intermediate voltage or signal.","zh":"（电子/电工）在绕组、电阻或电缆的中点引出的一个“抽头/分接点”，用于取得中间电压或信号。"},"examples":[{"en":"This transformer has a midtap, so it can output either 12V or 24V.","zh":"这个变压器有中间抽头，所以它可以输出12伏或24伏。"},{"en":"Connect the midtap to ground to create a split power supply.","zh":"把中间抽头接地，可以形成正负分电源。"}]},{"partOfSpeech":"v.","definition":{"en":"To add or use a tap in the middle of something (especially an electrical winding or signal line).","zh":"在某物中间加一个抽头/从中点分接（尤指电气绕组或信号线）。"},"examples":[{"en":"They midtapped the coil to get a lower voltage.","zh":"他们在电感线圈中点分接，以得到较低的电压。"},{"en":"If you midtap the resistor chain, you can measure the midpoint reference.","zh":"如果你在电阻串中点分接，就能测到中点参考电压。"}]}],"synonyms":["center tap","tap","intermediate tap","midpoint connection"],"phonetic":"/ˈmɪdˌtæp/","extraExplanation":["“midtap”更常见的写法是“mid-tap”或“center tap/centre tap”。在电工与音频电路里很常见，用来提供“中间点”电位（例如做±电源的0V参考点）。","如果你是在别的领域看到 midtap（例如软件、游戏或产品名），它可能是专有名词或拼写变体；可以把原句发来，我能按语境解释。"]}
{"word":"midtarsal","summary":{"en":"“Midtarsal” means relating to the middle of the foot’s tarsal area, especially the midtarsal (midfoot) joint.","zh":"“Midtarsal”表示与足部跗骨区域的中段有关，尤指中跗（足中部）关节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the middle part of the tarsus (the group of bones in the back of the foot), especially the midtarsal joint (a joint in the midfoot).","zh":"与跗骨（足后部的一组骨头）的中部有关的，尤指中跗关节（足中部的一个关节）。"},"examples":[{"en":"The doctor checked for pain around the midtarsal joint.","zh":"医生检查了中跗关节周围是否疼痛。"},{"en":"Midtarsal motion is important for walking on uneven ground.","zh":"中跗部位的活动对在不平地面行走很重要。"}]}],"synonyms":["transverse tarsal","midfoot (related term)"],"phonetic":"/ˌmɪdˈtɑr.səl/","extraExplanation":["“midtarsal”常见于医学/解剖学与运动伤害（足踝）相关语境，普通日常英语中较少使用。","“midtarsal joint”也常被称为“transverse tarsal joint（横跗关节）”，通常涉及距舟关节与跟骰关节等结构，用于描述足中部的活动与稳定性。"]}
{"word":"midterm","summary":{"en":"Midterm most commonly means an exam in the middle of a course; it can also describe something happening at the midpoint of a term.","zh":"midterm 最常指期中考试；也可作形容词表示“期中的、在学期中段发生的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An exam or assessment given in the middle of a school term or course.","zh":"期中考试；学期中段进行的测验或评估。"},"examples":[{"en":"I have two midterms next week, so I need to start studying now.","zh":"我下周有两门期中考试，所以我得现在开始复习。"},{"en":"The midterm covers chapters 1–6.","zh":"期中考试考第1到第6章。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of a term, course, or time period.","zh":"发生在学期/课程/一段时间的中间；期中的。"},"examples":[{"en":"We got a midterm progress report from the teacher.","zh":"我们收到了老师发的期中学习进度报告。"},{"en":"There will be a midterm review session on Friday.","zh":"周五会有一次期中复习课。"}]}],"synonyms":["midterm exam","exam","test","assessment"],"phonetic":"/ˈmɪdˌtɝm/","extraExplanation":["在美国校园语境里，midterm 常指“期中考试”，也可以泛指“期中作业/测验/项目”。难度与占比因课程而异，常见搭配有 midterm exam, midterm review, midterm grade。","在美国政治语境中，the midterms 指“美国中期选举”（通常在总统任期的中间举行，选国会席位等）。例如：The midterms are in November.（中期选举在十一月。）"]}
{"word":"midterms","summary":{"en":"“Midterms” usually means exams in the middle of a semester, or the busy period when those exams happen.","zh":"“midterms”通常指学期中间的期中考试，也可指期中考试那段时间（期中考周）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Exams given around the middle of a school term/semester; also the period when these exams happen.","zh":"（学期）期中考试；也可指期中考试周/期中考期间。"},"examples":[{"en":"I have three midterms next week, so I’m studying every night.","zh":"我下周有三门期中考试，所以我每天晚上都在复习。"},{"en":"During midterms, the library is usually packed.","zh":"期中考试期间，图书馆通常人满为患。"},{"en":"She did well on her midterms and feels more confident now.","zh":"她期中考考得不错，现在更有信心了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the middle of a term, especially midterm exams or evaluations.","zh":"期中的；与期中考试或期中评估有关的。"},"examples":[{"en":"Our midterm project is due on Friday.","zh":"我们的期中项目周五截止。"},{"en":"The professor posted the midterm review sheet online.","zh":"教授把期中复习资料发到网上了。"}]}],"synonyms":["midterm exams","mid-term exams","exams","tests"],"phonetic":"/ˈmɪdˌtɝmz/","extraExplanation":["“midterms”是复数形式，最常见于美式校园语境：a midterm / midterms（期中考/期中考周）。英式英语里也会说“mid-term exams”。","口语里常把期中考试周当作一个时间段来用：比如“during midterms（期中考那阵子）”。"]}
{"word":"midtown","summary":{"en":"Midtown means the central area of a city; it often refers specifically to Midtown Manhattan in New York City.","zh":"Midtown 指城市的中部地区；在很多语境中特指纽约的曼哈顿中城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central part of a city, especially a main business and shopping area; in New York City, the area roughly in the middle of Manhattan (often called “Midtown Manhattan”).","zh":"城市的中部地区，常指主要的商业与购物区域；在纽约市特指曼哈顿中部一带（常称“曼哈顿中城”）。"},"examples":[{"en":"Our hotel is in midtown, so it’s easy to walk to restaurants and shops.","zh":"我们的酒店在市中心一带，所以走路去餐厅和商店很方便。"},{"en":"She works in Midtown Manhattan and takes the subway every day.","zh":"她在曼哈顿中城上班，每天坐地铁。"},{"en":"Traffic is usually heavy in midtown during rush hour.","zh":"高峰期时，中城一带通常很堵。"}]}],"synonyms":["city center","central district","downtown area (sometimes)","Midtown Manhattan (NYC)"],"phonetic":"/ˈmɪdˌtaʊn/","extraExplanation":["“midtown”在美国英语里最常见的专名用法是指纽约的Midtown Manhattan，因此在新闻、电影和旅游语境中出现频率很高。","很多城市也会用“midtown”指“介于downtown（市中心/老商业区）和uptown（较北/较高地势或住宅区）之间的中部区域”，但具体边界因城市而异。"]}
{"word":"midtowns","summary":{"en":"“Midtowns” means the central business areas of cities; it’s also the plural form referring to multiple midtown districts.","zh":"“midtowns”指多个城市的中城/市中心中段商业区；也是“midtown”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “midtown”: the central part(s) of a city, especially the business/commercial district (often used for Manhattan in New York City).","zh":"“midtown”的复数：城市的中部地区，尤指商业/办公集中的区域（在纽约市常特指曼哈顿中城）。"},"examples":[{"en":"Many companies moved their offices from downtowns to midtowns.","zh":"许多公司把办公室从市中心旧城区（downtown）搬到了各城市的中城（midtown）。"},{"en":"In New York City, tourists often compare Midtown and Downtown when planning a trip.","zh":"在纽约市，游客在规划行程时常会比较曼哈顿中城（Midtown）和下城（Downtown）。"}]}],"synonyms":["city centers","central districts","business districts","commercial centers"],"phonetic":"/ˈmɪdˌtaʊnz/","extraExplanation":["在英语里，“Midtown”常见于纽约语境：特指曼哈顿大约从34街到59街一带，包含时代广场、帝国大厦、洛克菲勒中心等地标。写作时若指纽约的地名，常用大写“Midtown”；泛指某城市的中部商业区则多用小写“midtown”。","“downtown / midtown / uptown”是一组常见的城市方位与功能分区说法：downtown常指更老的中心/金融区；midtown多指商业办公密集的中段；uptown常指更靠北或更偏住宅的区域（具体因城市而异）。"]}
{"word":"midvein","summary":{"en":"Midvein means the main central vein of a leaf.","zh":"midvein 指叶片中央的主脉（中脉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The main central vein of a leaf (also called the midrib), from which smaller veins branch out.","zh":"（叶片的）中脉；主脉（也常称 midrib），是叶子中央最主要的一条叶脉，其他小叶脉从它分支出来。"},"examples":[{"en":"The leaf’s midvein runs from the base to the tip.","zh":"叶子的中脉从叶基一直延伸到叶尖。"},{"en":"Look for a thick midvein—many smaller veins branch out from it.","zh":"找一条较粗的中脉——许多较细的叶脉会从它分出来。"},{"en":"The insect laid eggs along the midvein of the plant.","zh":"那只昆虫沿着植物的中脉产卵。"}]}],"synonyms":["midrib","main vein","primary vein"],"phonetic":"/ˈmɪd.veɪn/","extraExplanation":["在植物学里，midvein 通常指叶片中间最显眼、最粗的一条“主通道”，负责支撑叶片结构并运输水分与养分。很多教材也更常用 midrib（中肋）表示同一结构；两者在日常学习中可近似看作同义。"]}
{"word":"midventral","summary":{"en":"Midventral describes something positioned on the middle line of the belly/front side of the body.","zh":"midventral 指位于身体腹侧（腹部/前侧）中线位置的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located on or relating to the middle of the ventral (belly/front) side of a body or structure.","zh":"位于或与身体（或结构）腹侧（腹部/前侧）中线相关的；腹侧正中的。"},"examples":[{"en":"In anatomy class, we labeled the midventral line of the insect’s abdomen.","zh":"在解剖课上，我们标注了昆虫腹部的腹侧正中线。"},{"en":"The surgeon made a small incision along the midventral surface to reach the tissue safely.","zh":"外科医生沿着腹侧正中的表面做了一个小切口，以便安全地到达组织。"}]}],"synonyms":["ventromedian","ventral midline","median ventral"],"phonetic":"/ˌmɪdˈvɛntrəl/","extraExplanation":["“mid-”表示“中间的”，“ventral”表示“腹侧/腹部一侧”（相对“dorsal”背侧）。这个词多用于解剖学、生物学和医学写作，强调位置在腹侧的中线附近。","在不同动物身上，“ventral”不一定等同于“前面”：例如人类直立时通常把腹侧理解为“前侧”，但四足动物更常对应“腹部那一侧”。因此阅读学术文本时要结合动物体位理解方向。"]}
{"word":"midverse","summary":{"en":"“Midverse” means “in the middle of a verse,” or the middle section of a verse in a poem or song.","zh":"“midverse”表示“在一节诗句/歌词（verse）的中间”，也可指“一节的中段”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in the middle of a verse (a line or section of a poem, hymn, or song).","zh":"在一节诗句/歌词（verse）的中间；写到/唱到半截时。"},"examples":[{"en":"The singer paused midverse to catch his breath.","zh":"歌手唱到一半（在一节歌词中间）时停下来喘口气。"},{"en":"She changed the rhyme scheme midverse to surprise the listener.","zh":"她在一节诗句的中间改变押韵方式，让听众感到惊喜。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle part of a verse.","zh":"一节诗句/歌词的中段。"},"examples":[{"en":"The meaning becomes clearer in the midverse, after the first image.","zh":"到了这一节的中段，在第一个意象之后，意思就更清楚了。"},{"en":"Mark the midverse so you know where to take a breath.","zh":"把这一节的中段标出来，这样你就知道哪里该换气。"}]}],"synonyms":["mid-verse","halfway through the verse","in the middle of the verse"],"phonetic":"/ˈmɪdˌvɝs/","extraExplanation":["“midverse”不是非常常见的标准词，更常见的写法是带连字符的“mid-verse”。在音乐/说唱语境里，verse 指“一段主歌”，所以 mid-verse 也常指“主歌唱到一半”。写作中它带一点文学/创作色彩，用来强调动作发生在“句子或段落尚未结束”的那种突然感。"]}
{"word":"midward","summary":{"en":"“Midward” means “toward the middle/center” or “located toward the middle.”","zh":"“midward”表示“朝中间/中心方向”或“位于中部、靠近中心”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the middle; in the direction of the center (often of a ship, vehicle, or space).","zh":"向中间的；朝中心方向的（常用于船只、交通工具或空间的描述）。"},"examples":[{"en":"They moved the heavy boxes midward to balance the load.","zh":"他们把重箱子往中间挪，以便让载重更平衡。"},{"en":"Please step midward so everyone has room.","zh":"请往中间站一点，这样大家都有空间。"}]},{"partOfSpeech":"adj.","definition":{"en":"Situated toward the middle; central or nearer the center.","zh":"位于中部的；靠近中心的。"},"examples":[{"en":"The midward seats are usually quieter than the ones by the doors.","zh":"中间的座位通常比靠门的更安静。"},{"en":"A midward corridor connects the two wings of the building.","zh":"一条位于中部的走廊连接着大楼的两翼。"}]}],"synonyms":["toward the middle","toward the center","inward","central","middle"],"phonetic":"/ˈmɪd.wɚd/","extraExplanation":["“midward”属于比较少见、略带文学或旧式色彩的词。在现代英语中，人们更常说“toward the middle / toward the center”或用“central / middle”来表达相同意思。","在航海或军事语境里，类似表达有“midships”（在船的中部）与“amidships”（在船中央一带）。"]}
{"word":"midwatch","summary":{"en":"“Midwatch” is a nautical term for the midnight-to-4 a.m. watch (duty period), and it can also mean standing that watch.","zh":"“midwatch”是航海用语，指午夜到凌晨四点的值班（午夜更），也可作动词表示在这段时间值班。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(On a ship) the duty period or watch from midnight to 4 a.m.","zh":"（船上）“午夜更”，指从午夜到凌晨四点的值班/轮班时间。"},"examples":[{"en":"He had the midwatch, so he tried to sleep in the evening.","zh":"他值午夜更，所以他晚上尽量先睡一会儿。"},{"en":"During the midwatch, the sea was calm and the sky was full of stars.","zh":"在午夜更时，海面很平静，天空繁星点点。"}]},{"partOfSpeech":"v.","definition":{"en":"To stand duty on a ship during the midwatch (midnight–4 a.m.).","zh":"（船上）在午夜到凌晨四点期间值班。"},"examples":[{"en":"I’m midwatching tonight, so don’t expect a quick reply.","zh":"我今晚要值午夜更，所以别指望我很快回复。"},{"en":"She midwatched twice this week during training.","zh":"训练期间她这周值了两次午夜更。"}]}],"synonyms":["middle watch","graveyard watch (informal, similar idea)","night watch"],"phonetic":"/ˈmɪdˌwɑtʃ/","extraExplanation":["“watch”在航海语境里不是“手表”，而是“值班/轮班”的意思。传统上船员把一天分成几段固定时长（常见为4小时一班），例如：first watch（晚8点到午夜）、midwatch（午夜到凌晨4点）、morning watch（凌晨4点到早8点）。","在一些船上还会听到“dogwatch”（通常把傍晚的一段分成两个2小时短班），用来轮换班次，避免同一批人每天都上同一班。"]}
{"word":"midwatches","summary":{"en":"“Midwatches” means the midnight duty shifts, especially on a ship (about 12 a.m.–4 a.m.).","zh":"“midwatches”指（尤指船上）午夜到凌晨的值班班次，约 12 点到 4 点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) The watch/shift of duty around midnight, especially on a ship; the period when someone is on guard from about 12:00 a.m. to 4:00 a.m.","zh":"（常用复数）“午夜班/夜半班”，尤指船上的值班时段；通常指凌晨约 12 点到 4 点的守夜/值更时间。"},"examples":[{"en":"He drew the midwatches, so he slept during the day.","zh":"他被排到午夜班，所以白天补觉。"},{"en":"During the midwatches, the sea was quiet and the deck was dark.","zh":"在午夜班时段，海面很安静，甲板很昏暗。"},{"en":"The captain asked for extra lookouts on the midwatches because of fog.","zh":"因为有雾，船长要求在午夜班增加瞭望。"}]}],"synonyms":["midwatch","midnight watch","graveyard shift","night watch"],"phonetic":"/ˈmɪdˌwɑtʃ/","extraExplanation":["“watch”在航海/军队语境里不是“手表”，而是“值班、岗哨、轮班”的意思。传统航海值班常把一天分成若干个4小时左右的“watch”，其中“midwatch”指午夜到凌晨的那一班。不同船只/组织的具体时间划分可能略有差异。"]}
{"word":"midway","summary":{"en":"Midway means “halfway” or “in the middle,” usually describing the middle point of a place, time, or process.","zh":"Midway 意为“半途/中途/在中间”，常用来描述地点、时间或过程的中间位置。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"at an equal distance between two points; in the middle of a process, journey, or time period","zh":"在两点之间等距处；在过程、旅程或时间段的中途/中间"},"examples":[{"en":"We stopped for coffee midway between Boston and New York.","zh":"我们在波士顿和纽约之间的中途停下来喝了咖啡。"},{"en":"Midway through the meeting, the fire alarm rang.","zh":"会议进行到一半时，火警响了。"},{"en":"I realized midway that I had forgotten my wallet.","zh":"我走到一半才意识到忘带钱包了。"}]},{"partOfSpeech":"adj.","definition":{"en":"halfway between two places or at the middle point of something","zh":"在两地之间的中点；某物的中间位置"},"examples":[{"en":"There’s a small park at the midway point of the trail.","zh":"这条步道的中点有一个小公园。"},{"en":"Meet me at the midway of the bridge.","zh":"在桥的中间和我见面。"}]},{"partOfSpeech":"n.","definition":{"en":"a midway point or place; the middle of a route or process","zh":"中途点；路线或过程的中间位置"},"examples":[{"en":"At the midway of the hike, we took a long break.","zh":"徒步到中途时，我们休息了很久。"},{"en":"The project is at its midway, so we’re reviewing our progress.","zh":"项目进行到一半，所以我们在检查进度。"}]}],"synonyms":["halfway","in the middle","midpoint","partway"],"phonetic":"/ˌmɪdˈweɪ/","extraExplanation":["“midway”由 mid（中间）+ way（路/方向）构成，字面意思是“在路的中间”。日常写作里常见搭配是 “midway through + 名词”（例如 midway through the semester）。","在美国文化语境中，Midway 也可能是专有名词：例如芝加哥大学附近的 “Midway Plaisance”（一条著名的绿地带）；另外在嘉年华/游乐园里，“the midway”常指摆满游戏摊位和小吃摊的主通道。"]}
{"word":"midways","summary":{"en":"“Midways” most commonly means multiple carnival/fair “midway” areas (games, rides, food). Less commonly, it can mean “halfway,” but “midway” is preferred.","zh":"“Midways”最常见指多个嘉年华/集市的“游乐区（有游戏摊、游乐设施和食物）”。较少见时可表示“半路上/中途”，但更常用 midway。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “midway”: the area at a fair, carnival, or amusement park where you find games, rides, food stalls, and shows.","zh":"“midway”的复数：嘉年华/游乐园里集中游戏摊、游乐设施、食物摊和表演的区域。"},"examples":[{"en":"We met on the midways between the rides and the food stands.","zh":"我们在游乐设施和小吃摊之间的游乐区（midway）碰面了。"},{"en":"The festival had two midways—one for kids’ rides and one for big thrill rides.","zh":"这个节庆有两条游乐区：一条是儿童项目，一条是刺激的大型项目。"}]},{"partOfSpeech":"adv.","definition":{"en":"Less common: “midways” can be used like an adverb meaning “halfway; in the middle,” but “midway” is much more common.","zh":"较少见：midways 有时可作副词用，表示“在中途/在中间”；但更常用的是 midway。"},"examples":[{"en":"They stopped midways through the hike to rest.","zh":"他们在徒步途中（半路上）停下来休息。"}]}],"synonyms":["carnival area","fairground","amusement strip","halfway (less common for midways)"],"phonetic":"/ˈmɪdˌweɪz/","extraExplanation":["在美国文化里，midway 常让人联想到“county fair（县集市）/carnival（嘉年华）”的热闹区域：套圈、投球等游戏摊位、棉花糖和热狗、以及各种灯光和音乐。这个词在游乐场语境下很固定，所以看到 midways 多半是在描述“多个游乐区/多条游乐通道”。"]}
{"word":"midweek","summary":{"en":"Midweek means the middle of the week (often around Wednesday) or something that happens then.","zh":"midweek 指“一周中间（常指周三前后）”，也可作形容词表示“周中的、发生在周中的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle of the week (especially around Wednesday).","zh":"一周的中间（尤指周三前后）。"},"examples":[{"en":"Our team has a midweek meeting every Wednesday.","zh":"我们团队每周三都有一次周中会议。"},{"en":"Midweek is usually the busiest time for me at work.","zh":"周中通常是我工作最忙的时候。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of the week.","zh":"发生在一周中间的；周中的。"},"examples":[{"en":"There will be a midweek update in your inbox.","zh":"你的收件箱里会有一封周中更新邮件。"},{"en":"We took a midweek trip to avoid the weekend crowds.","zh":"我们选在周中出行，以避开周末人潮。"}]}],"synonyms":["the middle of the week","Wednesday (context-dependent)","midweekday"],"phonetic":"/ˈmɪdˌwiːk/","extraExplanation":["在英语里，“midweek”常指周三附近，但在不同国家/文化中一周的起始日可能不同：美国日常语境里常把周日算作一周的开始（周三是中间），而很多国际标准和不少地区把周一算作一周开始（周三仍常被视为“周中”的核心）。日常使用中一般不必过于纠结，理解为“工作周的中间”即可。"]}
{"word":"midweekly","summary":{"en":"“Midweekly” means “in the middle of the week” and can be used as an adjective or adverb.","zh":"“midweekly”表示“在一周中间/周中”，可作形容词或副词使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of the week (around Tuesday to Thursday).","zh":"发生在一周中间（通常指周二到周四左右）的。"},"examples":[{"en":"We have a midweekly meeting every Wednesday afternoon.","zh":"我们每周三下午都有一次周中会议。"},{"en":"Midweekly traffic is usually lighter than Monday morning traffic.","zh":"周中的交通通常比周一早高峰更顺畅。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the middle of the week.","zh":"在一周的中间（周中）。"},"examples":[{"en":"The report is due midweekly, not at the end of the week.","zh":"报告要在周中交，不是到周末。"},{"en":"She usually feels most productive midweekly.","zh":"她通常在周中效率最高。"}]}],"synonyms":["midweek","midweek(ly)","in the middle of the week"],"phonetic":"/ˌmɪdˈwiːkli/","extraExplanation":["“midweekly”不是最常见的说法；日常英语里更常用“midweek”（名词/形容词/副词）或“midweek(ly)”（形容词/副词）。例如：midweek meeting / meet midweek。","拼写提示：它由 mid-（中间）+ weekly（每周的）构成，多用于较正式或需要强调“每周中间那个时间点/那段时间”的语境。"]}
{"word":"midweeks","summary":{"en":"Midweek means the middle part of the week, and it can also describe something that happens then. “Midweeks” is the plural form but is less common.","zh":"midweek 指一周的中间时段，也可作形容词表示“周中的”。midweeks 是其复数形式，但不太常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of the week (often around Wednesday; sometimes used more loosely for Tuesday–Thursday)","zh":"一周的中间时段（常指周三附近；也可宽泛指周二到周四）"},"examples":[{"en":"I usually feel most productive in midweek.","zh":"我通常在周中最有干劲。"},{"en":"The report is due by midweek.","zh":"报告要在周中之前交。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening in the middle of the week","zh":"发生在周中（工作日中间）的"},"examples":[{"en":"We have a midweek meeting every Wednesday.","zh":"我们每周三都有一次周中会议。"},{"en":"A midweek flight is often cheaper than a weekend one.","zh":"周中的航班通常比周末的更便宜。"}]}],"synonyms":["middle of the week","midweek period","Wednesday (context-dependent)"],"phonetic":"/ˌmɪdˈwiːk/","extraExplanation":["“midweek”在英式英语和美式英语里都常见。具体指哪一天会因地区和语境而不同：很多人默认是周三（Wednesday），但在日程安排里也可能泛指周二到周四这一段。","复数“midweeks”较少见，通常出现在描述“多个周中时段/好几个星期的周中”时，例如：over several midweeks（连续几个星期的周中）。"]}
{"word":"Midwest","summary":{"en":"The Midwest is the central-northern region of the U.S.; it can also describe things from that region.","zh":"Midwest 指美国中北部的“中西部”地区，也可用作形容词表示“中西部的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central-northern region of the United States, often including states such as Illinois, Ohio, Michigan, Indiana, Wisconsin, Minnesota, Iowa, and Missouri","zh":"美国中北部的一个地区，常包括伊利诺伊、俄亥俄、密歇根、印第安纳、威斯康星、明尼苏达、爱荷华、密苏里等州"},"examples":[{"en":"Chicago is a major city in the Midwest.","zh":"芝加哥是美国中西部的重要城市。"},{"en":"Winters in the Midwest can be very cold.","zh":"美国中西部的冬天可能非常寒冷。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Midwest region of the United States","zh":"与美国中西部地区有关的；中西部的"},"examples":[{"en":"She has a Midwest accent.","zh":"她有美国中西部口音。"},{"en":"Midwest farmers grow a lot of corn and soybeans.","zh":"美国中西部的农民种植大量玉米和大豆。"}]}],"synonyms":["the American Midwest","the heartland"],"phonetic":"/ˌmɪdˈwɛst/","extraExplanation":["“Midwest（中西部）”是一个常见但边界不完全固定的区域概念。日常用法里常包含“五大湖周边的工业州”和“中部大平原的农业州”，因此有时也会看到细分：Great Lakes（五大湖区）与 Great Plains（大平原）。","文化印象方面，“Midwest”在美国语境里常联想到：友善、务实、生活节奏相对稳定（但这是刻板印象，不适用于所有人或所有城市）。","在文学与流行文化中，“Midwest”常被用来象征“美国的心脏地带（the heartland）”，用来描写小镇生活、成长经历或与大城市（如纽约、洛杉矶）对比的价值观与氛围。"]}
{"word":"midwest","summary":{"en":"Midwest: the north-central U.S. region; also used as an adjective meaning “from or related to that region.”","zh":"Midwest：美国北部偏中间的“中西部”地区；也可作形容词，表示“中西部的/来自中西部的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Midwest: a region in the north-central United States, often associated with states like Illinois, Indiana, Iowa, Michigan, Minnesota, Missouri, Ohio, Wisconsin, and nearby areas","zh":"（the Midwest）美国中西部：美国北部偏中间的一大片地区，常指伊利诺伊、印第安纳、爱荷华、密歇根、明尼苏达、密苏里、俄亥俄、威斯康星等州及周边地区"},"examples":[{"en":"She grew up in the Midwest and moved to New York for work.","zh":"她在美国中西部长大，后来为了工作搬到纽约。"},{"en":"Winters in the Midwest can be long and very cold.","zh":"美国中西部的冬天可能很漫长，而且非常冷。"},{"en":"The Midwest is known for agriculture and big lakes nearby.","zh":"美国中西部以农业闻名，而且附近有一些大湖。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Midwest region of the United States","zh":"中西部的；与美国中西部有关的"},"examples":[{"en":"They serve classic Midwest comfort food at this diner.","zh":"这家小餐馆供应典型的中西部家常暖心食物。"},{"en":"His Midwest accent is noticeable when he says “about.”","zh":"他说“about”的时候，中西部口音很明显。"}]}],"synonyms":["the Midwest","Middle West","Midwestern"],"phonetic":"/ˌmɪdˈwɛst/","extraExplanation":["在美国文化里，“Midwest”常让人联想到：农业与玉米/大豆产区、小城镇与郊区生活、较直接友好的沟通风格（常被称为“Midwest nice”）、以及靠近五大湖的城市（如芝加哥、底特律、明尼阿波利斯等）。不过这是一种概括，不代表所有中西部州或所有人。","拼写与用法：最常见写法是专有名词“The Midwest”。作形容词时常写作“Midwestern”（如：Midwestern culture / a Midwestern accent）。日常写“midwest”全小写也能见到，但正式写作建议首字母大写。"]}
{"word":"Midwestern","summary":{"en":"Midwestern means “from or related to the U.S. Midwest,” and it can also mean “a person from the Midwest.”","zh":"Midwestern 指“来自/与美国中西部有关的”，也可指“美国中西部的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Midwest region of the United States (for example, Illinois, Indiana, Iowa, Kansas, Michigan, Minnesota, Missouri, Nebraska, North Dakota, Ohio, South Dakota, Wisconsin).","zh":"与美国中西部地区有关的（例如伊利诺伊、印第安纳、爱荷华、堪萨斯、密歇根、明尼苏达、密苏里、内布拉斯加、北达科他、俄亥俄、南达科他、威斯康星等州）。"},"examples":[{"en":"She grew up in a Midwestern town and moved to New York after college.","zh":"她在一个中西部小镇长大，大学毕业后搬到了纽约。"},{"en":"Midwestern winters can be long and very cold.","zh":"美国中西部的冬天可能很长而且非常冷。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Midwest of the United States.","zh":"美国中西部地区的人。"},"examples":[{"en":"As a Midwestern, he missed wide open spaces and friendly small talk.","zh":"作为一个中西部人，他想念开阔的空间和友好的寒暄。"}]}],"synonyms":["Midwest (adj./n.)","from the Midwest","heartland (often broader/less exact)"],"phonetic":"/ˌmɪdˈwɛstɚn/","extraExplanation":["“Midwestern”常让人联想到一些文化印象：重视务实与礼貌、社区感强、口音相对“中性”。但这些都是概括，每个州、城市与个人差异很大。","写法上可作形容词（Midwestern values 中西部价值观）或名词（a Midwestern 一个中西部人）。注意首字母通常大写，因为指特定地区。"]}
{"word":"midwestern","summary":{"en":"Midwestern means “from or related to the U.S. Midwest,” and it can also mean a person from that region.","zh":"midwestern 表示“来自/与美国中西部有关的”，也可指“美国中西部地区的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Midwest, a large region in the north-central United States (often including states like Illinois, Indiana, Iowa, Kansas, Michigan, Minnesota, Missouri, Nebraska, North Dakota, Ohio, South Dakota, and Wisconsin).","zh":"与美国中西部地区有关的（常指美国北部中间地带，如伊利诺伊、印第安纳、爱荷华、堪萨斯、密歇根、明尼苏达、密苏里、内布拉斯加、北达科他、俄亥俄、南达科他、威斯康星等州）。"},"examples":[{"en":"Midwestern cities like Chicago and Detroit played an important role in American industry.","zh":"像芝加哥、底特律这样的中西部城市在美国工业发展中起过重要作用。"},{"en":"She has a Midwestern accent that sounds friendly and straightforward.","zh":"她带有中西部口音，听起来友好而直爽。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Midwest region of the United States.","zh":"美国中西部地区的人。"},"examples":[{"en":"As a Midwesterner, he grew up around farms and small towns.","zh":"作为一个中西部人，他在农场和小镇的环境中长大。"},{"en":"Many Midwesterners value community and practicality.","zh":"许多中西部人重视社区感与务实。"}]}],"synonyms":["Midwest (adj./n.)","of the Midwest","Midwestern American"],"phonetic":"/ˌmɪdˈwɛstɚn/","extraExplanation":["“Midwestern”在美国文化中常带有一些刻板印象式的联想，比如“务实、朴实、友好、脚踏实地”等；在口语里也常听到“Midwestern nice”（中西部式的礼貌/友善）。这些是文化标签，不一定适用于每个人。","“the Midwest”并没有完全统一的官方边界：不同机构或不同人的理解可能略有差别，但大体指美国中北部的内陆地区。"]}
{"word":"midwesterner","summary":{"en":"A Midwesterner is someone from the U.S. Midwest.","zh":"Midwesterner 指来自美国中西部地区的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Midwest region of the United States","zh":"美国中西部地区的人；中西部居民"},"examples":[{"en":"She’s a Midwesterner who grew up in Iowa.","zh":"她是个中西部人，在爱荷华州长大。"},{"en":"Many Midwesterners are known for being friendly and down-to-earth.","zh":"很多中西部人以友好、朴实著称。"}]}],"synonyms":["Midwestern person","Midwest resident"],"phonetic":"/ˌmɪdˈwɛstɚnɚ/","extraExplanation":["“Midwesterner”指美国“Midwest（中西部）”的人。常被认为包括伊利诺伊、印第安纳、俄亥俄、密歇根、威斯康星、明尼苏达、艾奥瓦、密苏里、堪萨斯、内布拉斯加、南/北达科他等州；不同语境下范围可能略有差异。","这是一个身份/地域称呼，有时会带有刻板印象色彩（如“很随和、重视家庭、说话直接”等）。在正式写作中，用于说明出身即可；在评价性语境中要注意尊重与准确。"]}
{"word":"midwesterners","summary":{"en":"“Midwesterners” means people from the Midwestern United States.","zh":"“Midwesterners”指来自或居住在美国中西部的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who are from, live in, or are strongly connected to the Midwestern United States","zh":"美国中西部（Midwest）的人；来自、居住在或与美国中西部关系密切的人"},"examples":[{"en":"Many Midwesterners grow up with strong community ties and a love of local sports.","zh":"许多中西部人从小就有很强的社区归属感，也很喜欢本地体育运动。"},{"en":"Midwesterners often travel to big cities like Chicago for work or entertainment.","zh":"中西部人常去芝加哥这样的大城市工作或娱乐。"},{"en":"The story follows a Midwesterner moving to the East Coast for college.","zh":"故事讲的是一位中西部人去美国东海岸上大学。"}]}],"synonyms":["people from the Midwest","Midwest residents","Midwest Americans"],"phonetic":"/ˌmɪdˈwɛstɚnɚz/","extraExplanation":["“Midwesterner”是“Midwest（美国中西部）+ -er（表示某地的人）”构成的词。复数是“Midwesterners”。","美国中西部通常包括伊利诺伊、印第安纳、俄亥俄、密歇根、威斯康星、明尼苏达、爱荷华、密苏里、堪萨斯、内布拉斯加、南/北达科他等州（不同语境下划分可能略有差异）。","在文化印象上，Midwesterners常被描述为友好、务实、重视家庭与社区；但这是概括性的刻板印象，个体差异很大。"]}
{"word":"midwestward","summary":{"en":"Midwestward means “toward the U.S. Midwest,” used mainly in writing (news, weather, geography).","zh":"midwestward 表示“朝向美国中西部”，多见于书面语（新闻、天气、地理等）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the Midwest region of the United States.","zh":"朝向（美国）中西部地区；往中西部方向。"},"examples":[{"en":"As the storm moved midwestward, the heaviest rain shifted into Iowa and Missouri.","zh":"随着风暴向中西部移动，最强降雨转移到了爱荷华州和密苏里州。"},{"en":"Many families traveled midwestward in search of farmland and work.","zh":"许多家庭为了寻找农田和工作而向中西部迁移。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located in, or moving toward, the Midwest (used before a noun).","zh":"中西部方向的；通往中西部的（多用于名词前作定语）。"},"examples":[{"en":"The airline added more midwestward flights during the holiday season.","zh":"这家航空公司在假期增加了更多通往中西部的航班。"},{"en":"A midwestward route can avoid the worst coastal traffic.","zh":"走一条偏向中西部的路线可以避开最拥堵的沿海交通。"}]}],"synonyms":["toward the Midwest","to the Midwest","in a Midwestern direction"],"phonetic":"/ˌmɪdˈwɛstwɚd/","extraExplanation":["这个词由“Midwest（美国中西部）+ -ward（朝……方向）”构成，和 eastward / westward / homeward 的构词方式一样。","在日常口语中更常见的说法是“toward the Midwest”或“to the Midwest”。“midwestward”在新闻报道、天气预报、地理/历史叙述里更常见，语气更书面。"]}
{"word":"midwife","summary":{"en":"A midwife is a trained professional who supports pregnancy, childbirth, and postpartum care; it can also mean helping a new idea or project be born.","zh":"midwife 指受过训练的助产专业人员，负责孕期、分娩及产后护理；也可作动词，表示促成某个新事物（如理念或项目）诞生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trained person (often a nurse or health professional) who helps a woman during pregnancy, labor, and childbirth, and gives care after the baby is born","zh":"助产士；接生婆（受过训练的专业人员，帮助孕期、分娩及产后护理）"},"examples":[{"en":"The midwife checked the baby’s heartbeat and coached the mother through breathing.","zh":"助产士检查了宝宝的心跳，并指导妈妈如何呼吸。"},{"en":"In many places, midwives provide prenatal care and education for families.","zh":"在许多地方，助产士会为家庭提供产前护理和相关教育。"}]},{"partOfSpeech":"v.","definition":{"en":"to help create, develop, or bring something new into existence (used especially about ideas, projects, or social change)","zh":"促成；推动……诞生（尤指理念、项目或社会变革的出现）"},"examples":[{"en":"Community leaders helped midwife the new health program into existence.","zh":"社区领袖帮助推动新的健康项目诞生。"},{"en":"The editor midwifed the young writer’s first book, guiding it to completion.","zh":"编辑“助产”了那位年轻作家的第一本书，指导它完成。"}]}],"synonyms":["birth attendant","accoucheuse","obstetric nurse","deliver (a baby)","facilitate"],"phonetic":"/ˈmɪdˌwaɪf/","extraExplanation":["“midwife”来自古英语：mid（与……在一起）+ wif（女人），原意接近“陪在女人身边的人”。现代语境中更强调受训与专业性（如在医院或产房工作）。","在不同文化与国家，助产士的执业范围和资格认证差异很大；英语里也常见相关词：doula（陪产员，偏情感与支持，不一定提供医疗服务）与 obstetrician/OB-GYN（产科医生）。"]}
{"word":"midwifed","summary":{"en":"**Midwifed** means “helped a baby be born,” or (figuratively) “helped something new come into existence.”","zh":"**midwifed** 表示“助产、协助分娩”，也可比喻“促成新事物诞生”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of **midwife**) to help a baby be born; to assist during childbirth as a midwife.","zh":"（**midwife** 的过去式/过去分词）助产；作为助产士协助分娩。"},"examples":[{"en":"A trained nurse midwifed the birth at the rural clinic.","zh":"一位受过训练的护士在乡村诊所为这次分娩助产。"},{"en":"She has midwifed hundreds of babies over her career.","zh":"她在职业生涯中助产过数百名婴儿。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to help something new start or develop; to guide a process into existence.","zh":"（比喻）促成某事诞生；推动并引导一个新事物形成。"},"examples":[{"en":"They midwifed the project from an idea into a working program.","zh":"他们把这个项目从想法一步步促成了可运行的方案。"},{"en":"Her editor midwifed the book through many revisions.","zh":"她的编辑帮助这本书经历多次修改最终成形。"}]}],"synonyms":["assisted (in childbirth)","delivered","helped","facilitated","guided","ushered in"],"phonetic":"/ˈmɪdwaɪfd/","extraExplanation":["“midwife”既是名词（助产士），也可以作动词，强调“帮助…诞生”。动词用法在正式或文学语境里更常见。","比喻义很常用于写作、科研、政治等场景：把新想法、新制度或新作品“接生”出来，突出“陪伴、支持、引导”的过程感。"]}
{"word":"midwiferies","summary":{"en":"Midwifery is the profession and practice of supporting women through pregnancy and childbirth; “midwiferies” is the plural used mainly for services or programs.","zh":"Midwifery 指助产学/助产实践；“midwiferies”是其复数，多用于指多个助产服务或项目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually uncountable) The profession and practice of helping women during pregnancy, childbirth, and the first weeks after birth.","zh":"（通常不可数）助产学；助产士的职业与实践：在怀孕、分娩及产后初期为产妇和新生儿提供照护与支持。"},"examples":[{"en":"She studied midwifery and now works in a hospital maternity ward.","zh":"她学习了助产学，现在在医院产科病房工作。"},{"en":"Midwifery focuses on supporting healthy pregnancies and safe births.","zh":"助产学强调支持健康妊娠与安全分娩。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, countable) A midwifery service, unit, or program, especially in organizations or systems.","zh":"（较少见，可数）助产服务/部门/项目（常用于机构或系统语境）。"},"examples":[{"en":"The city expanded its community midwiferies to improve prenatal care access.","zh":"这座城市扩展了社区助产服务项目，以改善产前护理的可及性。"}]}],"synonyms":["maternity care","obstetric care (broader)","childbirth care"],"phonetic":"/mɪdˈwɪfəri/","extraExplanation":["你输入的“midwiferies”通常是“midwifery”的复数拼写，但在日常英语里“midwifery”多作不可数名词（说“study/work in midwifery”）。如果要表达“多个助产服务/机构/项目”，才可能用复数“midwiferies”。","常见相关词：midwife（助产士，名词）；midwifery care（助产照护）；maternity care（产科/孕产照护）。"]}
{"word":"midwifery","summary":{"en":"Midwifery is the profession of caring for people during pregnancy, childbirth, and after birth.","zh":"midwifery 指在孕期、分娩及产后为孕产者与新生儿提供照护的助产专业与实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The health profession and practice of caring for people during pregnancy, childbirth, and the weeks after birth, including supporting normal (low-risk) births and monitoring the parent and baby’s health.","zh":"助产学；助产护理：在怀孕、分娩及产后数周为孕产者与新生儿提供照护的医疗专业与实践，包括支持正常（低风险）分娩并监测母婴健康。"},"examples":[{"en":"She studied midwifery and now works in a community hospital.","zh":"她学习了助产学，现在在一家社区医院工作。"},{"en":"Midwifery often focuses on continuous emotional support as well as medical care.","zh":"助产护理常常不仅重视医疗照护，也重视持续的情感支持。"},{"en":"In some places, midwifery is provided at hospitals, birth centers, or at home.","zh":"在一些地区，助产服务可以在医院、分娩中心或家中提供。"}]}],"synonyms":["maternity care","obstetric care (broader)"],"phonetic":"/ˌmɪdˈwɪfəri/","extraExplanation":["“midwifery”来自古英语短语“mid wif”（意为“与女人同在的人”），强调助产士陪伴与支持产妇的角色，而不只是“接生”。","不同国家/地区对助产士（midwife）的资格与执业范围规定差异很大：有的可独立接生，有的需在医生或医院体系下合作。学习时可留意你所在地区的法律与职业称谓。","常见相关词：midwife（助产士，名词），to deliver a baby（接生/分娩），prenatal care（产前护理），postpartum care（产后护理）。"]}
{"word":"midwifes","summary":{"en":"Midwife is a trained birth assistant; as a verb, it means to help deliver a baby. The plural noun form is midwives.","zh":"midwife 指受过训练的助产士；作动词可表示“接生/协助分娩”。其名词复数是不规则形式 midwives。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person trained to help women during pregnancy, childbirth, and the weeks after birth","zh":"助产士；接生婆（受过训练，帮助孕期、分娩及产后护理的人）"},"examples":[{"en":"The midwife stayed with her through the entire labor.","zh":"助产士在整个分娩过程中一直陪着她。"},{"en":"In many communities, midwives provide prenatal checkups and education.","zh":"在许多社区里，助产士会提供产前检查和健康教育。"}]},{"partOfSpeech":"vt.","definition":{"en":"to assist (a mother) in giving birth; to deliver (a baby) as a midwife","zh":"为……接生；协助……分娩（通常指以助产士身份）"},"examples":[{"en":"She midwifed hundreds of births during her career.","zh":"她在职业生涯中接生了数百个孩子。"},{"en":"The clinic midwifes many low-risk births each year.","zh":"这家诊所每年为许多低风险分娩提供助产服务。"}]}],"synonyms":["birth attendant","obstetric nurse","deliver (a baby)","assist with childbirth"],"phonetic":"ˈmɪdwaɪf","extraExplanation":["你输入的 **midwifes** 多半是拼写混淆：\n- 名词复数应为 **midwives**（不规则变化：wife → wives）。\n- **midwifes** 也可能是动词 **midwife** 的第三人称单数（He/She midwifes ...），但在日常英语中更常见的表达是 *works as a midwife* 或 *delivers babies*。"]}
{"word":"midwifing","summary":{"en":"“Midwifing” means assisting childbirth as a midwife, or (figuratively) helping a new idea or project come into being.","zh":"“midwifing”指助产、协助分娩；也可比喻促成新想法或项目的诞生。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"helping a woman give birth; working as a midwife (present participle of “midwife”).","zh":"助产；作为助产士协助分娩（“midwife”的现在分词）。"},"examples":[{"en":"She is midwifing a home birth tonight.","zh":"她今晚在为一场居家分娩助产。"},{"en":"The clinic has been midwifing babies in this community for decades.","zh":"这家诊所几十年来一直在这个社区为新生儿接生。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) helping something new begin or develop, especially an idea, project, or change.","zh":"（比喻）促成新事物诞生或发展，尤指想法、项目或变革。"},"examples":[{"en":"She played a key role in midwifing the new policy through the committee.","zh":"她在促使新政策在委员会中成形方面发挥了关键作用。"},{"en":"Good teachers often end up midwifing students’ confidence.","zh":"好老师常常会“助产”学生的自信心。"}]}],"synonyms":["assisting","delivering (a baby)","attending a birth","facilitating","guiding","helping bring about"],"phonetic":"/ˈmɪdˌwaɪfɪŋ/","extraExplanation":["“midwife”既是名词（助产士），也可作动词（助产、促成）。因此“midwifing”是动词的现在分词/动名词形式。","拼写上你可能也会看到“midwifing”和“midwiving”（较少见）；都来自名词“midwife”。学术或正式场合更常见名词“midwifery”（助产学/助产工作）。","比喻用法在文学和社会评论中很常见：把“新思想/新制度的诞生”类比为“接生”，强调支持、引导与促成，而不是直接“创造”。"]}
{"word":"midwinter","summary":{"en":"Midwinter means the middle part of winter, often the coldest/darkest time, and it can also describe something that happens then.","zh":"midwinter 指“隆冬/冬季正中间”，常含“最冷或最黑暗时段”的意味，也可作形容词表示“发生在隆冬的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle of winter; the coldest or darkest part of the winter season.","zh":"隆冬；冬季正中间（通常指最冷或最黑暗的时段）。"},"examples":[{"en":"Many animals conserve energy in midwinter when food is scarce.","zh":"许多动物会在隆冬食物匮乏时节省能量。"},{"en":"The lake usually freezes over by midwinter.","zh":"湖面通常到隆冬就会完全结冰。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of winter.","zh":"发生在隆冬时节的；冬季正中间的。"},"examples":[{"en":"A midwinter storm shut down several roads.","zh":"一场隆冬暴风雪导致多条道路关闭。"},{"en":"They took a midwinter trip to visit family.","zh":"他们在隆冬时节出行去探亲。"}]}],"synonyms":["the depths of winter","the heart of winter","wintertime (broader)","mid-season (more general)"],"phonetic":"/ˌmɪdˈwɪntɚ/","extraExplanation":["在英语里，mid- 是一个常见前缀，表示“中间/中期”（如 midterm 期中、midnight 午夜）。midwinter 常用于书面或较正式的叙述，也常出现在带有季节氛围的描写中。","文化与文学语境：midwinter 往往让人联想到一年中最寒冷、最漫长的夜晚。许多英语读者会想到北半球的冬至前后；在一些传统中也与“Yule（尤尔节）”等冬季节庆的意象相连。"]}
{"word":"midwinterly","summary":{"en":"“Midwinterly” means “of or like the middle of winter,” often used for weather or atmosphere.","zh":"“midwinterly”意为“隆冬的/像隆冬一样的”，常用来形容天气或氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in or typical of the middle of winter; very wintry.","zh":"发生在或典型属于隆冬的；非常冬季般的。"},"examples":[{"en":"We took a midwinterly walk through the quiet, snow-covered park.","zh":"我们在安静、被雪覆盖的公园里进行了一次隆冬般的散步。"},{"en":"A midwinterly chill settled over the city after sunset.","zh":"日落后，城市笼罩在隆冬般的寒意中。"}]}],"synonyms":["wintry","midwinter","winterlike"],"phonetic":"/ˌmɪdˈwɪn.tɚ.li/","extraExplanation":["“midwinterly”由 midwinter（隆冬）+ -ly 构成，这里的 -ly 不是副词常见的“方式”用法，而是形容词后缀，表示“具有……特征的/属于……的”（类似：friendly, kingly）。","这个词在现代日常口语中不算常见，更常见的表达是 “midwinter” 作名词/形容词用法，或用 “wintry / in midwinter”。在文学描写、新闻写作或更正式的叙述中，使用 “midwinterly” 会显得更有画面感。","相关近义表达：wintry（冬天般的/阴冷的）、in midwinter（在隆冬时）、at midwinter（在隆冬时）。反义倾向表达：summery（夏日般的）、springlike（春天般的）。"]}
{"word":"midwinters","summary":{"en":"Midwinters means the middle (often coldest) part of winter, sometimes referring to midwinter festivals.","zh":"Midwinters 指冬季的中段（常为最寒冷的时候），有时也指隆冬时节的节庆活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle part of winter; the coldest, darkest period around the winter solstice","zh":"隆冬；冬季的中段（常指接近冬至时最寒冷、最黑暗的时期）"},"examples":[{"en":"In many places, midwinters are cold and windy, so people stay indoors more.","zh":"在很多地方，隆冬时节又冷又多风，所以人们更常待在室内。"},{"en":"The lake often freezes over during the midwinters of the north.","zh":"在北方的隆冬时节，湖面常常会结冰。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) winter festivals or celebrations held in the middle of winter","zh":"（较少见）冬季中期举行的节庆；冬至前后或隆冬的庆祝活动"},"examples":[{"en":"Some communities hold midwinters with music, lights, and hot food.","zh":"有些社区会在隆冬举办节庆活动，有音乐、灯光和热食。"}]}],"synonyms":["midwinter","the depths of winter","wintertime"],"phonetic":"/ˌmɪdˈwɪntərz/","extraExplanation":["“midwinters”通常是名词复数，单数更常见的是“midwinter”。也常写作“mid-winter”（较传统的拼写）。","在英美文化语境里，“midwinter”常让人联想到冬至前后（12月下旬）的意象：漫长黑夜、严寒、节日灯火等。文学里常用来营造清冷、肃穆或反思的氛围。"]}
{"word":"midwintry","summary":{"en":"“Midwintry” means “of the middle of winter,” often describing very cold, wintry weather in a literary tone.","zh":"“midwintry”意为“隆冬（冬季中段）的”，常用来形容非常寒冷、冬日般的天气，语气较文学化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Typical of the middle of winter; very cold or wintry.","zh":"典型的隆冬（冬季中段）的；非常寒冷的；冬日般的。"},"examples":[{"en":"A midwintry wind swept across the fields.","zh":"一阵隆冬般的寒风掠过田野。"},{"en":"We stayed inside on that midwintry afternoon.","zh":"在那个隆冬的午后，我们待在室内。"}]}],"synonyms":["midwinter","wintry","icy","freezing"],"phonetic":"/ˌmɪdˈwɪntri/","extraExplanation":["“midwintry”较文学化、较少用于日常口语；口语里更常说“midwinter”或“in the middle of winter”。","常见搭配：midwintry cold（隆冬的寒冷）、midwintry wind（隆冬的寒风）、midwintry gloom（隆冬的阴沉）。","写作提示：用于营造氛围（萧瑟、冷清、沉静等），比单说“cold”更有画面感。"]}
{"word":"midwise","summary":{"en":"“Midwise” means “in the middle” or “midway,” and it’s rare/old-fashioned in modern English.","zh":"midwise 意为“在中间/半途”，在现代英语中较少用，常用 midways 或 in the middle 替代。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"At or toward the middle; midway (a rare or old-fashioned word).","zh":"在中间；朝中间；半途（较少用/偏旧式的词）。"},"examples":[{"en":"Midwise through the hike, we stopped to drink water.","zh":"徒步走到半途时，我们停下来喝水。"},{"en":"The trail bends midwise and then climbs sharply.","zh":"小路在中段拐弯，然后陡然上升。"}]}],"synonyms":["midway","in the middle","halfway"],"phonetic":"/ˈmɪdˌwaɪz/","extraExplanation":["“midwise”里的 -wise 表示“以……方式/朝……方向/在……方面”（如 lengthwise 纵向地、clockwise 顺时针地）。因此 midwise 字面意思是“朝中间/在中间的方向”。","这个词在现代英语里很少见，更常用的是 “midway” 或 “in the middle”。在正式或文学化描写中偶尔会用来营造古典/书面语感。"]}
{"word":"midwived","summary":{"en":"“Midwived” means “assisted at a birth” (or figuratively, “helped bring something new into being”).","zh":"“midwived”表示“助产、接生”（也可比喻“促成新事物诞生”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “midwife”: helped a woman give birth; assisted at a birth as a midwife.","zh":"“midwife”的过去式/过去分词：助产；作为助产士协助分娩。"},"examples":[{"en":"She midwived hundreds of births in rural clinics.","zh":"她在乡村诊所助产了数百次分娩。"},{"en":"The baby was midwived by an experienced nurse-midwife.","zh":"这名婴儿由一位经验丰富的助产护士接生。"}]},{"partOfSpeech":"v.","definition":{"en":"helped bring something new into existence (used figuratively).","zh":"（比喻）促成、推动某个新事物诞生。"},"examples":[{"en":"A small team midwived the new policy through months of debate.","zh":"一个小团队经过数月辩论，促成了新政策的出台。"},{"en":"The editor midwived the book from draft to publication.","zh":"编辑把这本书从初稿一路推进到出版。"}]}],"synonyms":["delivered (a baby)","assisted (at a birth)","brought about","helped usher in"],"phonetic":"/ˈmɪdˌwaɪvd/","extraExplanation":["“midwife”既可以是名词（助产士），也可以当动词用（助产、促成）。动词用法在正式写作或学术语境里更常见；日常口语中更常说“deliver a baby / help someone give birth”。","拼写提示：动词过去式通常写作“midwifed”（更常见）或“midwived”（也可见，较少）。两者读音相同。"]}
{"word":"midwives","summary":{"en":"“Midwives” is the plural of “midwife,” meaning trained professionals who support pregnancy, childbirth, and early postpartum care.","zh":"“midwives”是“midwife”的复数，指在孕期、分娩及产后早期提供专业照护与支持的助产士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A midwife is a trained health professional who supports people during pregnancy, childbirth, and the early period after birth.","zh":"助产士是受过专业训练的医疗人员，在怀孕、分娩以及产后早期为产妇及新生儿提供护理与支持。"},"examples":[{"en":"In many countries, midwives provide most routine care during pregnancy and birth.","zh":"在许多国家，助产士负责孕期和分娩期间的大部分常规护理。"},{"en":"The midwife helped her manage breathing and stay calm during labor.","zh":"助产士帮助她在产程中调整呼吸、保持镇定。"}]},{"partOfSpeech":"n.","definition":{"en":"A female midwife (traditional usage; today, “midwife” can be any gender).","zh":"女助产士（传统用法；如今“midwife”可指任何性别的助产士）。"},"examples":[{"en":"Historically, the village relied on a trusted midwife for births at home.","zh":"历史上，村里常常依靠一位值得信赖的女助产士在家中接生。"}]}],"synonyms":["birth attendants","certified nurse-midwives (CNMs)","midwifery practitioners"],"phonetic":"/ˈmɪdˌwaɪvz/","extraExplanation":["“midwives”是“midwife”的复数形式。词源上“mid”（古英语里有“与……在一起”之意）+“wife”（早期可泛指“女人”），原意接近“与产妇在一起的人”。","现代医疗体系中，助产士常与产科医生（obstetrician/OB-GYN）、护士（nurse）协作：助产士多负责低风险、以自然分娩为主的照护，并提供分娩教育、产后哺乳与心理支持等。不同国家/地区的执业范围与称谓可能不同。"]}
{"word":"midwiving","summary":{"en":"“Midwiving” means providing midwife care (helping with childbirth). It can also be the -ing form of “midwife,” including a figurative sense of helping something come into being.","zh":"“midwiving”指助产工作（协助分娩、照护母婴），也可作动词 midwife 的 -ing 形式；还可比喻“促成某事诞生/落地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the work or practice of helping a woman give birth and caring for her and the baby around childbirth","zh":"（助产）帮助孕产妇分娩，并在分娩前后照护母婴的工作或实践"},"examples":[{"en":"She is studying midwiving and hopes to work in a community clinic.","zh":"她正在学习助产，希望以后在社区诊所工作。"},{"en":"Midwiving includes emotional support as well as medical checks during labor.","zh":"助产不仅包括医疗检查，也包括在产程中的情绪支持。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “midwife”: to assist a woman during childbirth; to help bring something into existence (figurative)","zh":"“midwife”的现在分词：助产、协助分娩；（比喻）促成某事诞生/出现"},"examples":[{"en":"Experienced nurses were midwiving births at the rural health center.","zh":"在乡村卫生中心，有经验的护士在协助分娩。"},{"en":"She helped write the policy, midwiving the project from idea to reality.","zh":"她参与撰写政策，把项目从想法一路促成到落地。"}]}],"synonyms":["midwifery","childbirth support","birth assistance","deliver (a baby)"],"phonetic":"/ˌmɪdˈwaɪvɪŋ/","extraExplanation":["“midwiving”在英语里常见但也有人更常用拼写“midwifing”（来自动词 midwife）。作为专业领域，更常见的名词形式是“midwifery”（助产学/助产工作）。","英美语境中，midwife既可指“助产士”（名词），也可作动词表示“助产、协助分娩”。比喻用法“to midwife an idea/project”强调在关键阶段给予推动与支持，让事物顺利“诞生”。"]}
{"word":"midyear","summary":{"en":"Midyear means the middle of the year, used as an adjective (midyear review) or a noun (by midyear).","zh":"midyear表示“年中/年中时期”，既可作形容词（如年中评估），也可作名词（如到年中时）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in the middle of the year, or related to that time (around June/July).","zh":"发生在年中（大约6月/7月）的；与年中有关的。"},"examples":[{"en":"We have a midyear review to discuss your progress.","zh":"我们有一次年中评估来讨论你的进展。"},{"en":"The company released its midyear financial report in July.","zh":"公司在七月发布了年中财务报告。"}]},{"partOfSpeech":"n.","definition":{"en":"The middle point of the year; the time around the middle of a calendar or school year.","zh":"年中的时间点；一年（或学年）中间的那段时间。"},"examples":[{"en":"By midyear, most students feel more confident.","zh":"到年中时，大多数学生会更有自信。"},{"en":"They plan to finish the project by midyear.","zh":"他们计划在年中之前完成这个项目。"}]}],"synonyms":["middle of the year","mid-year"],"phonetic":"/ˌmɪdˈjɪr/","extraExplanation":["“midyear”常见于职场与学校语境，比如“midyear review（年中评估）”“midyear report（年中报告）”。也常写作“mid-year”（加连字符），两种都常见，取决于写作风格指南。"]}
{"word":"midyears","summary":{"en":"Midyears means the middle period of life or the middle part of a longer time span.","zh":"Midyears 指人生的中年阶段，或某个较长时期中的中段几年。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the middle years of a person’s life; the period between youth and old age (often similar to “middle age”)","zh":"人生的中年阶段；介于年轻与年老之间的时期（常接近“中年/中年期”）"},"examples":[{"en":"In her midyears, she began training for a marathon.","zh":"在中年时，她开始为马拉松训练。"},{"en":"He wrote most of his novels in his midyears.","zh":"他大部分小说是在中年时期写成的。"}]},{"partOfSpeech":"n.","definition":{"en":"the middle years of a longer time period (such as a project, reign, or decade)","zh":"较长时期中的中段几年（如项目、统治期或某个十年的中间几年）"},"examples":[{"en":"The company changed its strategy in the midyears of the project.","zh":"公司在项目的中期改变了策略。"},{"en":"In the midyears of the decade, prices began to rise quickly.","zh":"在那个十年的中期，物价开始快速上涨。"}]}],"synonyms":["middle age","midlife","middle years","mid-period","in-between years"],"phonetic":"/ˈmɪdˌjɪrz/","extraExplanation":["“midyears”在现代英语中不算非常常见，更常见的写法是分开的“mid years”或带连字符的“mid-years”。作名词用时通常需要限定词（如“her mid years”“the mid-years of the project”）。如果你想表达年龄段，日常更常说“middle age / in midlife”。"]}

