{"word":"miharaite","summary":{"en":"Miharaite is a rare mineral name used mainly in geology/mineralogy.","zh":"Miharaite 是一种稀有矿物的名称，主要用于地质学/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral species (used mainly in geology/mineralogy); not a common everyday English word","zh":"一种稀有矿物名称（主要用于地质学/矿物学领域）；不是日常英语常用词"},"examples":[{"en":"Miharaite is listed as a rare mineral in some mineralogy references.","zh":"在一些矿物学资料中，miharaite 被列为一种稀有矿物。"},{"en":"The sample was tentatively identified as miharaite based on its composition.","zh":"根据其成分，这个样品被初步鉴定为 miharaite。"}]}],"synonyms":["(no common synonyms; it is a specific mineral name)"],"phonetic":"/miːhəˈraɪaɪt/","extraExplanation":["“miharaite”属于矿物命名的一类词：通常以发现地点、矿山、或人物命名，再加后缀 -ite（表示“矿物”）。因此它多出现在学术论文、矿物目录、博物馆标牌等语境中。","如果你是在某篇文章/标本标签里看到 miharaite，建议同时提供上下文（例如产地、化学式或所在句子），我可以帮你更准确地解释它指的具体矿物与相关背景。"]}
{"word":"mihirung","summary":{"en":"an extinct giant Australian flightless bird.","zh":"已灭绝的澳大利亚巨型不会飞的鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large extinct Australian flightless bird (a dromornithid), sometimes described as a “giant thunder bird.”","zh":"（澳大利亚）一种已灭绝的巨型不会飞的鸟类（恐鸟科/德罗莫鸟类 dromornithid），有时被形容为“巨型雷鸟”。"},"examples":[{"en":"Scientists study mihirung fossils to learn what Australia’s ancient ecosystems were like.","zh":"科学家研究“mihirung”的化石，以了解澳大利亚古代生态系统的样貌。"},{"en":"A mihirung may have stood taller than many people and had a powerful beak.","zh":"“mihirung”可能比许多人还高，并且有很强壮的鸟喙。"}]}],"synonyms":["dromornithid","giant flightless bird","thunder bird"],"phonetic":"/ˈmɪhɪrʊŋ/","extraExplanation":["在科普文章中，mihirung常被用来泛指恐鸟科（Dromornithidae）的大型鸟类，其中一些生活在数百万年前的澳大利亚。","有些英文媒体会用更夸张的外号来形容它们（例如把某些种称作“demon duck”一类），但学术写作中更常用“dromornithid”。"],"etymology":"多见于澳大利亚英语，用来指代已灭绝的巨型不会飞的鸟类（恐鸟科/德罗莫鸟类）。词源通常被认为与澳大利亚原住民语言有关，但在不同资料中拼写与来源说法可能不完全一致。","mnemonic":["把它拆成“mi-hi-rung”，联想成“米（mi）很（hi=high，高）壮（rung=一节梯子，很高的一节）”，记住它是“很高很大的鸟”。","联想中文“雷鸟/巨鸟”，看到mihirung就想到澳洲古代的巨型不会飞的鸟。"]}
{"word":"mihrab","summary":{"en":"A mihrab is the prayer-direction niche in a mosque wall pointing toward Mecca, often richly decorated.","zh":"mihrab 指清真寺墙上指示麦加方向的礼拜龛，常有精美装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A niche (often semicircular) in the wall of a mosque that shows the direction of Mecca (the qibla), which Muslims face during prayer.","zh":"（清真寺墙上的）米哈拉布／礼拜龛：通常为半圆形凹壁，用来指示麦加方向（朝向），穆斯林礼拜时面向此方向。"},"examples":[{"en":"The imam stood near the mihrab to lead the congregational prayer.","zh":"伊玛目站在米哈拉布附近带领会礼。"},{"en":"Visitors admired the mihrab’s carved stone and colorful tilework.","zh":"参观者赞叹米哈拉布精美的石雕和彩色瓷砖装饰。"}]},{"partOfSpeech":"n.","definition":{"en":"In Islamic architecture and art history, the decorated architectural element that frames or emphasizes this niche (sometimes used more broadly for the whole prayer-focus area).","zh":"（伊斯兰建筑／艺术史）米哈拉布装饰构件：指围绕或强调礼拜龛的装饰性建筑元素（有时也泛指整个礼拜焦点区域）。"},"examples":[{"en":"The museum label described the mihrab as a masterpiece of medieval tile design.","zh":"博物馆说明牌把这座米哈拉布称为中世纪瓷砖设计的杰作。"},{"en":"Scholars compared the mihrab decorations from different dynasties.","zh":"学者比较了不同王朝的米哈拉布装饰风格。"}]}],"synonyms":["prayer niche","qibla niche"],"phonetic":"/ˈmiːrɑːb/","extraExplanation":["“mihrab”常见于旅行、建筑史与宗教文化语境。它的功能不是“祭坛”，而是“指示方向”的礼拜焦点：穆斯林礼拜时面向麦加方向（qibla），米哈拉布用建筑形式把这个方向清楚地标示出来。","许多著名清真寺（如伊斯坦布尔、科尔多瓦等地的历史建筑）都有极其华丽的米哈拉布，常以几何纹样、书法与植物纹饰装饰；这些装饰也常被写入艺术史与文学旅行文字中。","相关词：qibla（朝向/麦加方向），minbar（宣礼台/讲坛，常在米哈拉布附近）。"]}
{"word":"mihrabs","summary":{"en":"Mihrabs are the prayer niches in mosques that show the direction of Mecca (qibla).","zh":"Mihrabs 指清真寺中指示麦加方向（qibla）的礼拜壁龛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mihrab: a decorated niche in the wall of a mosque that indicates the direction of Mecca (the qibla), which Muslims face during prayer.","zh":"mihrab 的复数：清真寺墙壁上常有装饰的壁龛，用来指示麦加方向（朝向 qibla），穆斯林礼拜时面向该方向。"},"examples":[{"en":"Many historic mosques have beautifully tiled mihrabs.","zh":"许多历史清真寺都有铺着精美瓷砖的 mihrabs（礼拜壁龛）。"},{"en":"The guide explained that the mihrabs mark the qibla, the direction Muslims face when praying.","zh":"导游解释说，mihrabs 用来标示 qibla，也就是穆斯林礼拜时面向的方向。"}]}],"synonyms":["prayer niches","qibla niches"],"phonetic":"/ˈmiːrɑːbz/","extraExplanation":["“Mihrab”源自阿拉伯语（محراب）。在伊斯兰建筑中，mihrab 通常位于礼拜殿正墙的中央，是宗教与艺术结合的重要空间元素，常见装饰有几何纹样、书法与马赛克等。","英语里也常直接用单数形式 mihrab 来指这种“礼拜壁龛”；复数为 mihrabs（也有人用较少见的外来语复数形式 mihrab(s) 以外的拼法，但 mihrabs 最常见）。"]}
{"word":"Mihran","summary":{"en":"A male personal name; also the name of a historical Iranian noble house.","zh":"男性人名；也可指伊朗历史上的贵族家族名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name, used especially in Armenian and Iranian contexts.","zh":"男性名字，常见于亚美尼亚与伊朗等语境。"},"examples":[{"en":"Mihran is a common Armenian boy’s name.","zh":"Mihran 是一个常见的亚美尼亚男孩名字。"},{"en":"Mihran introduced himself and explained how to pronounce his name.","zh":"Mihran 做了自我介绍，并解释了他的名字怎么读。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) The name of a prominent noble house/clan in Iranian history, associated with the House of Mihran.","zh":"（历史）伊朗历史上著名贵族家族/氏族名称之一，常指“米赫兰家族（House of Mihran）”。"},"examples":[{"en":"The House of Mihran appears in accounts of late antique Iran and the Caucasus.","zh":"在关于古代晚期伊朗与高加索地区的记载中，常会提到米赫兰家族。"}]}],"synonyms":["Mehran","Mihrān"],"phonetic":"/miːˈrɑːn/","extraExplanation":["这是一个专名（proper noun）。在英文里作人名时通常不翻译其“字面意思”，但在介绍文化背景时会提到它与 Mihr/Mithra 的渊源。","拼写上也常见变体：Mehran（在伊朗语境更常见的转写之一），Mihrān（带长音标记的学术转写）。"],"etymology":"源自中古伊朗语/中古波斯语 Mihrān，与 Mihr（同源于古伊朗的 Mithra/密特拉）有关；Mihr 在传统中可与“太阳、誓约、友爱/守信”等观念相关，因此该名带有古伊朗文化背景色彩。","mnemonic":["联想“Mihr”≈“meer/米尔(音)”＋“-an/安”：记成“米尔安”，中文音译感强，便于记住是人名。","把 Mihr 和“密特拉 Mithra（与太阳/誓约相关的古伊朗词源）”联系起来：看到 Mihran 就想到“有古伊朗文化背景的名字”。"]}
{"word":"miht","summary":{"en":"“Might” most commonly expresses possibility or a polite suggestion; as a noun, it means strength or power. “Miht” is likely a misspelling of “might.”","zh":"“Might”最常用来表示“可能性”或礼貌建议；作名词表示“力量/威力”。“Miht”很可能是“might”的拼写错误。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"Used to say something is possible (but not certain), or to make a polite suggestion.","zh":"（情态助动词）表示“可能但不确定”，也可用于礼貌地提出建议。"},"examples":[{"en":"It might rain later, so bring an umbrella.","zh":"等会儿可能会下雨，所以带把伞。"},{"en":"You might want to talk to your teacher about it.","zh":"你也许可以和老师谈谈这件事。（更礼貌的建议）"}]},{"partOfSpeech":"n.","definition":{"en":"Great physical strength, power, or force.","zh":"力量；强大权力；威力。"},"examples":[{"en":"The army advanced with all its might.","zh":"军队以全部力量推进。"},{"en":"He pushed the door with all his might.","zh":"他用尽全力推门。"}]}],"synonyms":["may (aux., for possibility)","could (aux., possibility)","power","strength","force"],"phonetic":"/maɪt/","extraExplanation":["你输入的“miht”通常是把“might”拼错了（常见的字母顺序错误）。正确拼写是 might。","might 是 may 的过去式形式之一，但在现代英语里更常用来表示“可能性较小/更不确定”，语气往往比 may 更委婉：It may rain（可能性更大/更直接） vs. It might rain（也许会下，没那么确定）。","固定搭配：with all one’s might = “用尽全力”。在写作或文学语境里更常见。"]}

