{"word":"mim","summary":{"en":"“Mim” is a rare dialect adjective meaning overly prim or affectedly proper; “MIM/MiM” is also used as an abbreviation in different fields.","zh":"“mim”可作少见的方言形容词，指过分拘谨、装端庄；“MIM/MiM”也常作为不同领域的缩写使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scotland/Northern England, informal/old-fashioned) very proper and quiet in a way that seems affected; prim; demure.","zh":"（苏格兰/英格兰北部方言，较旧/口语）过分拘谨、装得很端庄的；矫饰的；假正经的。"},"examples":[{"en":"She looked all mim at the dinner table, barely speaking.","zh":"她在餐桌上显得特别拘谨，几乎不怎么说话。"},{"en":"Stop being so mim—just laugh and enjoy yourself.","zh":"别那么假正经了——笑一笑，放松点。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for several things (often written MIM), depending on the field—for example, metal injection molding or a Master in International Management.","zh":"（常写作 MIM）多种术语的缩写，含义取决于领域，例如“金属注射成形”或“国际管理硕士”。"},"examples":[{"en":"This part is made using MIM to achieve fine details.","zh":"这个零件用 MIM 工艺制造，以实现更精细的细节。"},{"en":"She’s applying to a MiM program in Europe.","zh":"她正在申请欧洲的 MiM 项目（国际管理硕士）。"}]}],"synonyms":["prim","demure","stiff","proper"],"phonetic":"/mɪm/","extraExplanation":["“mim”作为形容词在现代通用英语里不常见，更多见于苏格兰或英格兰北部的口语/文学描写中，带一点评价色彩：不是单纯“安静”，而是“过分拘谨、做作”。","写成大写 MIM/MiM 时通常按字母读（如“em-eye-em”），多用于专业语境（制造业、教育项目名称等）。"]}
{"word":"mima","summary":{"en":"“mima” is commonly used (via Mandarin pinyin) to mean “password,” though English usually says “password” or “passcode.”","zh":"“mima”常作为中文拼音用来表示“密码”，但英文里通常说“password”或“passcode”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Mandarin pinyin) “mima” means a password or passcode used to log in to an account or unlock a device.","zh":"（源自中文拼音）“mima”指“密码/口令”，用于登录账户或解锁设备。"},"examples":[{"en":"I forgot my mima, so I can’t log in.","zh":"我忘了 mima（密码），所以没法登录。"},{"en":"Don’t share your mima with anyone.","zh":"不要把 mima（密码）告诉任何人。"}]},{"partOfSpeech":"n.","definition":{"en":"Mima (proper name): used as a place name or a personal name in some contexts.","zh":"Mima（专有名词）：在某些语境中可作地名或人名。"},"examples":[{"en":"They visited the Mima Mounds in Washington State.","zh":"他们参观了华盛顿州的 Mima 土丘。"}]}],"synonyms":["password","passcode","PIN","login code"],"phonetic":"/ˈmiː.mɑː/","extraExplanation":["“mima”本身不是标准英语单词，更常见于华语使用者用拼音在英文聊天、游戏或社群里表达“密码”。在正式英文中更自然的说法是 password / passcode / PIN。","如果你指的是中文“密码”，更准确的拼音是 mì mǎ（带声调）；英文交流通常不写声调，所以常看到 mima。"]}
{"word":"mimamsa","summary":{"en":"Mimamsa is a Hindu philosophical school centered on interpreting the Vedas, especially ritual duty and textual meaning.","zh":"弥曼萨是印度教哲学学派，核心是诠释《吠陀》，尤其强调祭仪义务与文本意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Indian philosophy) a school of Hindu thought focused on interpreting the Vedas, especially the ritual and ethical meaning of Vedic texts (often called “Purva Mimamsa”).","zh":"（印度哲学）弥曼萨学派：印度教哲学的重要流派之一，重在对《吠陀》经典的解释，尤其强调祭仪与行为伦理的意义（常称“前弥曼萨/前弥曼差”）。"},"examples":[{"en":"She took a course on Mimamsa to understand how Vedic rituals were interpreted.","zh":"她选修了弥曼萨课程，以了解人们如何诠释吠陀祭仪。"},{"en":"Mimamsa argues that correct ritual action has real consequences.","zh":"弥曼萨认为，正确的祭仪行为会带来真实的结果。"}]}],"synonyms":["Purva Mimamsa","Mīmāṃsā","Mimansa"],"phonetic":"/mɪˈmɑːmsə/","extraExplanation":["“Mimamsa”常见学术拼写为带变音符的梵语转写“Mīmāṃsā”。在英语里也会写作“Mimansa/ Mīmāṃsā”，读音可能略有差异。","弥曼萨常与“Vedanta（吠檀多）”并列讨论：前者更侧重《吠陀》前部的祭仪与义务（dharma），后者更侧重奥义书等关于终极实在的哲学思考。"]}
{"word":"mimbar","summary":{"en":"Mimbar is a mosque pulpit used for sermons, especially the Friday sermon.","zh":"mimbar 指清真寺里的讲坛/讲道台，用于宣讲讲道，尤指主麻日讲道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In a mosque) a raised pulpit or platform where an imam delivers a sermon, especially the Friday sermon (khutbah).","zh":"（清真寺内的）讲坛/讲道台；伊玛目在其上讲道，尤指主麻日讲道（库特拜）。"},"examples":[{"en":"The imam climbed the mimbar to deliver the Friday sermon.","zh":"伊玛目登上讲坛，宣讲主麻日讲道。"},{"en":"During the khutbah, people listened quietly as the speaker stood on the mimbar.","zh":"在库特拜期间，人们安静聆听讲者站在讲坛上讲话。"}]}],"synonyms":["pulpit","minbar","platform","rostrum"],"phonetic":"/ˈmɪm.bɑr/","extraExplanation":["“mimbar”常见于马来语/印尼语语境，也可见作“minbar”（源自阿拉伯语“منبر”）。在伊斯兰文化中，它通常位于清真寺的米哈拉布（mihrab，礼拜龛）旁边，用于宗教讲道。","不要与“lectern（讲台/读经台）”完全等同：mimbar带有明确的宗教与清真寺场景含义。"]}
{"word":"mimbars","summary":{"en":"“Mimbars” usually means the plural of “minbar,” the pulpit in a mosque used for sermons.","zh":"“mimbars”通常指“minbar”的复数：清真寺里用于讲道的讲坛/高台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of minbar: a raised platform or pulpit in a mosque, where the imam delivers the Friday sermon (khutbah).","zh":"minbar（宣礼台/讲坛）的复数：清真寺内的高台或讲坛，伊玛目常在此发表主麻日讲道（khutbah）。"},"examples":[{"en":"The guide explained that the imam speaks from the minbar during Friday prayers; this mosque has two historic minbars.","zh":"导游解释说，伊玛目会在主麻日礼拜时站在minbar上讲道；这座清真寺有两座历史悠久的minbar。"},{"en":"Visitors were asked not to step onto the minbars out of respect.","zh":"出于尊重，工作人员请游客不要踏上这些minbar。"}]}],"synonyms":["pulpits","platforms"],"phonetic":"/ˈmɪnˌbɑr/","extraExplanation":["“minbar”一词源自阿拉伯语（منبر），常见于伊斯兰建筑与宗教场景中。它通常位于礼拜大殿的前方，靠近“mihrab（壁龛/圣龛）”，象征性地指向礼拜方向（麦加方向）。在一些历史清真寺里，minbar会有精美的木雕或石刻装饰。"]}
{"word":"mimble","summary":{"en":"“Mimble” is usually a misspelling of “nimble” (quick and agile).","zh":"“mimble”通常是“nimble”（敏捷的、灵活的）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form of “nimble.” In standard English, use “nimble.”","zh":"“nimble”的非标准拼写或拼写错误。标准英语中应写作“nimble”。"},"examples":[{"en":"Correct: She is nimble on her feet.","zh":"正确：她脚步很灵活。"},{"en":"Many learners accidentally write “mimble,” but the standard spelling is “nimble.”","zh":"很多学习者会不小心写成“mimble”，但标准拼写是“nimble”。"}]}],"synonyms":["nimble","agile","quick","spry"],"phonetic":"/ˈnɪmbəl/","extraExplanation":["“mimble”通常不被主流词典当作标准单词收录；在正式写作、考试或工作邮件中建议避免使用。","如果你想表达“动作敏捷、反应快”，正确词是 nimble（也可用 agile / quick）。","有时“mimble”可能出现在人名、品牌名或网络昵称中，这种情况下属于专有名词用法，并非普通词汇。"]}
{"word":"mimbreno","summary":{"en":"“mimbreno” isn’t standard English; it likely means “membrane,” a thin separating or covering layer.","zh":"“mimbreno”不是标准英语；很可能指“membrane（膜）”，即覆盖或分隔的薄层。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“mimbreno” is not a standard English word. It is most likely a misspelling of “membrane.”","zh":"“mimbreno”不是标准英语单词，很可能是把“membrane”（膜）拼错了。"},"examples":[{"en":"I couldn’t find “mimbreno” in an English dictionary—did you mean “membrane”?","zh":"我在英语词典里找不到“mimbreno”——你是不是想写“membrane”？"}]},{"partOfSpeech":"n.","definition":{"en":"a thin layer of tissue or material that covers, separates, or lines something","zh":"（生物或材料的）膜；薄层，用来覆盖、分隔或衬在某物表面"},"examples":[{"en":"Cell membranes control what enters and leaves the cell.","zh":"细胞膜控制哪些物质进入或离开细胞。"},{"en":"A waterproof membrane keeps rain out but lets sweat escape.","zh":"防水膜能挡雨，但能让汗气排出。"}]}],"synonyms":["film","layer","skin","sheet"],"phonetic":"/ˈmɛm.breɪn/","extraExplanation":["“membrane”在生物学里非常常见（如 cell membrane 细胞膜、mucous membrane 黏膜）。在材料/服装领域也常指“防水透气膜”。","如果你能提供“mimbreno”出现的句子或来源语言（比如西班牙语/葡萄牙语/姓名/品牌），我可以更准确判断它的意思。"]}
{"word":"mime","summary":{"en":"A mime is a silent performer, and to mime means to act something out or imitate using gestures instead of words.","zh":"mime 指“哑剧演员/哑剧表演”；作动词时表示“用动作表演或模仿（不靠语言）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a performer who tells a story or expresses feelings using silent gestures and body movement (often with a painted face)","zh":"哑剧演员；用无声动作和肢体表演来讲故事或表达情感的人（常见白脸妆）"},"examples":[{"en":"The mime pretended to be trapped inside an invisible box.","zh":"哑剧演员假装被困在一个看不见的盒子里。"},{"en":"We watched a mime perform in the park.","zh":"我们在公园里看了一场哑剧表演。"}]},{"partOfSpeech":"n.","definition":{"en":"the art or performance of acting without speaking, using gestures and movement","zh":"哑剧（艺术/表演形式）：不说话，只用动作和姿态表演"},"examples":[{"en":"She studied mime at a theater school.","zh":"她在戏剧学校学习哑剧。"},{"en":"Mime can communicate emotions very clearly without words.","zh":"哑剧不用语言也能很清楚地传达情绪。"}]},{"partOfSpeech":"v.","definition":{"en":"to copy someone’s actions or expressions, often in an exaggerated way (sometimes to make people laugh)","zh":"模仿（某人的动作或表情）；（常为夸张地）学样、逗乐"},"examples":[{"en":"He mimed the teacher’s strict voice and posture.","zh":"他模仿老师严厉的声音和站姿。"},{"en":"She mimed opening a heavy door to show what happened.","zh":"她用动作比划开一扇很重的门，来说明发生了什么。"}]},{"partOfSpeech":"v.","definition":{"en":"to act out something without speaking; to show an action using gestures","zh":"（不说话地）用动作表演；用手势示意"},"examples":[{"en":"He mimed eating to say he was hungry.","zh":"他用“吃饭”的动作表示自己饿了。"},{"en":"The actor mimed a phone call.","zh":"那位演员用动作表演打电话。"}]}],"synonyms":["pantomime","imitate","mimic","act out","gesture"],"phonetic":"/maɪm/","extraExplanation":["“mime”来自希腊语/拉丁语中表示“模仿者、表演者”的词根，核心含义一直与“用动作模仿、表演”有关。","在日常英语里，动词 mime 常用于“用动作示意”（例如 mimed drinking），不一定和街头白脸哑剧演员有关。"]}
{"word":"mimed","summary":{"en":"“Mimed” means communicated or performed silently using gestures, or closely imitated someone/something.","zh":"“mimed”表示用肢体动作无声地表达/表演，或指对他人（或事物）进行模仿。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to communicate or act something out using gestures, facial expressions, and body movements without speaking; acted as a mime","zh":"（不说话）用手势、表情和肢体动作来表演或传达；做哑剧表演"},"examples":[{"en":"She mimed opening an umbrella to show what she meant.","zh":"她用动作比划着打开雨伞，来说明她的意思。"},{"en":"The actor mimed fear with wide eyes and shaking hands.","zh":"那位演员用瞪大的眼睛和颤抖的手来“演出”害怕。"},{"en":"He mimed a phone call to ask her to call him later.","zh":"他做了个打电话的手势，示意她晚点打给他。"}]},{"partOfSpeech":"v.","definition":{"en":"copied or imitated something closely (often someone’s actions, voice, or style)","zh":"模仿；仿效（某人的动作、声音或风格等）"},"examples":[{"en":"The child mimed his father’s walk for fun.","zh":"孩子为了好玩，模仿爸爸走路的样子。"},{"en":"She mimed the teacher’s accent, and everyone laughed.","zh":"她模仿老师的口音，大家都笑了。"}]}],"synonyms":["gestured","acted out","pantomimed","imitated","copied"],"phonetic":"/maɪmd/","extraExplanation":["“mimed”通常是动词“mime”的过去式/过去分词。它既可以指“做哑剧（不说话靠动作表达）”，也可以泛指“模仿”。","“mime”也可作名词，指“哑剧演员”或“哑剧表演”（a mime / mime performance）。在英语文化中，mime常让人联想到法式舞台哑剧传统（比如想象“被困在看不见的箱子里”的经典动作）。"]}
{"word":"mimeo","summary":{"en":"“Mimeo” means a mimeograph or a copy made by it; it can also mean to duplicate documents using that older method.","zh":"“mimeo”指油印机或油印件；也可作动词，指用油印方式复制文件（较旧用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mimeograph (an older machine or method used to make many copies of a document, often with purple/blue ink); also a copy made this way","zh":"油印机；（用油印方式制作的）油印件（常见紫蓝色油墨）"},"examples":[{"en":"The teacher handed out mimeos of the quiz.","zh":"老师发了测验的油印卷。"},{"en":"Before photocopiers, schools often used mimeos for worksheets.","zh":"在复印机普及之前，学校常用油印来做练习纸。"}]},{"partOfSpeech":"v.","definition":{"en":"to duplicate (a document) using a mimeograph; more generally, to make many copies of something (older usage)","zh":"用油印机复制（文件）；（较旧用法）大量复印/复制"},"examples":[{"en":"They mimeoed the newsletter and mailed it to everyone.","zh":"他们把通讯油印出来，寄给了所有人。"},{"en":"We used to mimeo flyers for club events.","zh":"我们以前会把社团活动传单油印出来。"}]}],"synonyms":["mimeograph","duplicate","photocopy","print out"],"phonetic":"ˈmɪmioʊ","extraExplanation":["“mimeo”是“mimeograph”的口语缩写。在英语里常见于较老的校园、教会或社团语境；现代更常用“photocopy / print out / duplicate”。","油印（mimeograph）通常用蜡纸（stencil）和滚筒把油墨转印到纸上，因此很多油印件呈紫色或蓝紫色。"]}
{"word":"mimeoed","summary":{"en":"“Mimeoed” means “copied using a mimeograph,” an older type of duplicating machine.","zh":"“mimeoed”指“用油印机油印/誊写版复印出多份副本”（也可引申为快速大量复制）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) made copies using a mimeograph machine (an older stencil duplicator).","zh":"（过去式/过去分词）用油印机（誊写版复印机）油印、印刷出多份副本。"},"examples":[{"en":"The teacher mimeoed the quiz for the whole class.","zh":"老师把小测验油印了出来，发给全班。"},{"en":"The handouts were mimeoed on thin, purple-ink paper.","zh":"讲义是用薄薄的、紫色油墨的纸油印出来的。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, older) copied or reproduced something quickly, often in large quantities.","zh":"（非正式、较旧）快速复制/大量复印（不一定强调使用油印机）。"},"examples":[{"en":"Rumors get mimeoed online in minutes.","zh":"谣言在网上几分钟就会被“复制传播”开来。"}]}],"synonyms":["duplicated","copied","reproduced","printed","ran off"],"phonetic":"/ˈmɪmiˌoʊd/","extraExplanation":["“mimeo”来自“mimeograph”（油印机）。在复印机普及前，学校、教会、办公室常用它批量印资料；成品常带有淡紫色或蓝色油墨的味道与质感。如今多见于回忆性写作、老电影/文学语境中，用来营造“旧式办公/校园”的时代感。"]}
{"word":"mimeograph","summary":{"en":"A mimeograph is an older machine for making copies using an inked stencil; as a verb it means to copy that way (or to copy something unoriginally).","zh":"mimeograph 指旧式用模板油印的誊写机/油印机；作动词指用其复印，或引申为缺乏新意地照搬重复。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine that makes many copies of a document using an inked stencil (common before photocopiers)","zh":"誊写机；油印机（用蜡纸/模板蘸墨印刷，多用于复印机出现之前）"},"examples":[{"en":"The teacher mimeographed worksheets for the whole class.","zh":"老师油印了全班的练习纸。"},{"en":"Old school newsletters were often made on a mimeograph machine.","zh":"老式的学校通讯常常用油印机制作。"}]},{"partOfSpeech":"v.","definition":{"en":"to copy or print something using a mimeograph machine; by extension, to reproduce something in a repetitive, unoriginal way","zh":"用油印机誊写/印刷；（引申）机械地照搬、重复（缺乏新意）"},"examples":[{"en":"Before the meeting, she mimeographed the agenda.","zh":"开会前，她把议程油印出来。"},{"en":"The essay just mimeographs the textbook without adding new ideas.","zh":"这篇文章只是照搬课本，没有加入新观点。"}]}],"synonyms":["duplicator","stencil machine","reproduce","duplicate","copy"],"phonetic":"/ˈmɪmiəˌɡræf/","extraExplanation":["“Mimeograph”在20世纪的学校、教会和小型组织里很常见，因为它比正式印刷便宜，能快速复制资料。很多人对它的记忆包括：纸张带点墨味、文字边缘略模糊、甚至会弄脏手。","词源上，“mim(e)-”有“模仿”的意思，“-graph”与“书写/记录”有关，所以它既能指一种复制机器，也能引申为“照本宣科式的复制”。"]}
{"word":"mimeographed","summary":{"en":"“Mimeographed” means copied/printed using an old mimeograph duplicating machine; it’s also the past form of “mimeograph.”","zh":"“mimeographed”指用旧式油印/誊写版机器复制或印刷出来的；也可作“mimeograph”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Copied or printed using a mimeograph machine (an older duplicating device that made many copies from a stencil).","zh":"用誊写版/油印机（mimeograph，一种较早的复印印刷设备）复制或印刷出来的。"},"examples":[{"en":"The teacher handed out mimeographed worksheets to the whole class.","zh":"老师把油印的练习题发给全班同学。"},{"en":"We found a stack of mimeographed newsletters from the 1970s.","zh":"我们找到一叠1970年代油印的通讯简报。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mimeograph”: to make copies with a mimeograph machine.","zh":"“mimeograph”的过去式/过去分词：用油印机（誊写版）复印、印刷。"},"examples":[{"en":"They mimeographed the notices and posted them around campus.","zh":"他们把通知油印出来，贴在校园各处。"},{"en":"The poem was mimeographed and shared among friends.","zh":"那首诗被油印出来，在朋友之间传阅。"}]}],"synonyms":["duplicated","stenciled","copied"],"phonetic":"/ˈmaɪmiəˌɡræft/","extraExplanation":["“mimeograph（油印/誊写版）”在20世纪的学校、教会、小型社团里很常见，用蜡纸刻写成“版”再滚筒印刷。它常让人联想到紫色油墨、略带酒精味的纸张，以及“自制、草根出版（zines/小刊物）”的氛围。随着复印机普及，这个词逐渐变得较少见，更多出现在回忆、档案或复古语境中。"]}
{"word":"mimeographic","summary":{"en":"Mimeographic means “made by or related to a mimeograph,” an older stencil-copy machine; it can also mean “to copy using a mimeograph.”","zh":"mimeographic 指“油印的/与油印机有关的”，也可作动词表示“用油印机复制”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a mimeograph (a machine used to make many copies from a stencil), or made using it; duplicated in a simple, mass-copy way.","zh":"与油印机（用蜡纸刻写后批量复制的机器）有关的；用油印方式制作的；（比喻）以简易方式大量复制的。"},"examples":[{"en":"The teacher handed out mimeographic worksheets to the whole class.","zh":"老师把油印的练习题发给全班同学。"},{"en":"The report circulated in mimeographic form long before it was officially published.","zh":"这份报告在正式出版前很久就以油印的形式在内部流传。"}]},{"partOfSpeech":"v.","definition":{"en":"To duplicate (documents) using a mimeograph; to reproduce from a stencil.","zh":"用油印机复制（文件）；用蜡纸模板批量印刷。"},"examples":[{"en":"In the 1960s, many schools mimeographed newsletters for parents.","zh":"在20世纪60年代，许多学校会用油印机为家长印通讯。"},{"en":"They mimeographed the meeting agenda and placed copies on every chair.","zh":"他们把会议议程油印出来，在每张椅子上放了一份。"}]}],"synonyms":["stenciled","duplicated","photocopied"],"phonetic":"/ˌmɪmiəˈɡræfɪk/","extraExplanation":["“Mimeograph（油印机）”在复印机普及之前非常常见，尤其在学校、教会与小型组织里。油印品常带有淡紫色墨迹与特殊气味，因此在一些英语语境中会唤起“老式讲义/内部传单”的年代感。","现代英语里更常见的说法是“photocopied / duplicated / printed”，而“mimeographic”偏复古或带历史色彩。"]}
{"word":"mimeographically","summary":{"en":"“Mimeographically” means “by using a mimeograph,” an old stencil-based copying method.","zh":"“mimeographically”指“用油印（mimeograph）这种旧式誊写版复制方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is produced or copied using a mimeograph machine (an older duplicating device that used stencils).","zh":"以油印（mimeograph）方式；用誊写版/蜡纸油印机复制出来地。"},"examples":[{"en":"The club newsletter was mimeographically printed and handed out at meetings.","zh":"社团简报是用油印方式印出来的，并在会议上发放。"},{"en":"The teacher distributed mimeographically duplicated worksheets to the class.","zh":"老师把油印复制的练习纸发给全班。"}]}],"synonyms":["by mimeograph","stencil-duplicated","duplicated by stencil"],"phonetic":"/ˌmaɪmiəˈɡræfɪkli/","extraExplanation":["“mimeograph”在20世纪（尤其是学校、教会、社团）很常见，用蜡纸刻写（stencil）再用滚筒上墨复制，通常会有一种独特的油墨味。如今多被“photocopied / printed”取代，因此“mimeographically”带有明显的时代感，常出现在回忆性文字或历史语境中。"]}
{"word":"mimeographing","summary":{"en":"“Mimeographing” means making copies using an old stencil-based duplicating machine (a mimeograph).","zh":"“mimeographing”指用旧式的誊写版/油印机（通过模板与油墨）来复制文件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making copies with a mimeograph machine (an older duplicating machine that uses a stencil and ink)","zh":"用誊写版（油印机）进行复制的行为或过程（用蜡纸/模板加油墨来印刷的旧式复印方式）"},"examples":[{"en":"The teacher spent the evening mimeographing worksheets for the next day.","zh":"老师晚上一直在油印第二天要用的练习单。"},{"en":"Before photocopiers were common, mimeographing was a cheap way to duplicate handouts.","zh":"在影印机普及以前，油印是一种便宜的讲义复制方式。"}]},{"partOfSpeech":"v.","definition":{"en":"duplicating (something) with a mimeograph machine","zh":"用誊写版（油印机）来复制（某物）"},"examples":[{"en":"She is mimeographing a notice for the community meeting.","zh":"她正在油印一张社区会议通知。"},{"en":"They were mimeographing newsletters in the back room.","zh":"他们在后屋油印通讯简报。"}]}],"synonyms":["duplicating","copying","reproducing","stenciling"],"phonetic":"/ˈmɪmiəˌɡræfɪŋ/","extraExplanation":["“Mimeograph”在20世纪学校、教会、小型组织里很常见，因为成本低、操作相对简单。后来被复印机与打印机取代。","油印出来的纸张常带有紫色或蓝紫色墨迹（取决于油墨/耗材），在英语里有时会被当作一种“时代感”的细节来描写。"]}
{"word":"mimeographist","summary":{"en":"A mimeographist is someone who makes copies using a mimeograph machine, an older pre-photocopier duplicating method.","zh":"mimeographist 指使用油印机进行复制的人；属于较早期（复印机出现前常见）的工作称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes copies using a mimeograph machine (an older duplicating device used before modern photocopiers).","zh":"使用油印机（mimeograph，一种早期复印设备）进行复制的人；油印员。"},"examples":[{"en":"Before photocopiers, a mimeographist prepared stacks of classroom handouts.","zh":"在复印机普及之前，油印员会准备成堆的课堂讲义。"},{"en":"The school hired a mimeographist to duplicate newsletters quickly and cheaply.","zh":"学校雇了一位油印员来快速、低成本地复制简报。"}]}],"synonyms":["mimeograph operator","duplicator operator","copy operator"],"phonetic":"/ˈmɪm.i.əˌɡræf.ɪst/","extraExplanation":["“mimeographist”属于较旧的职业称呼，常见于20世纪中期的学校、教会、社区组织等场景。mimeograph（油印）通过蜡纸刻写形成模板，再用滚筒把油墨转印到纸上，常带有特有的油墨味道。","词形上，mimeograph + -ist（表示从事某种工作的人），类似于“typist（打字员）”“pianist（钢琴家）”。现代英语中更常用的表达是“copy operator（复印员）”或直接说“someone who ran the mimeograph machine（操作油印机的人）”。"]}
{"word":"mimeographs","summary":{"en":"“Mimeographs” means oil-printed copies (or, less commonly, the machines) and can also be the verb form meaning “makes copies by mimeograph.”","zh":"“mimeographs”可指油印件（或较少见地指油印机），也可作动词形式表示“用油印机复制/印刷”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mimeograph: copies made with a mimeograph machine, or the machines themselves (older usage).","zh":"mimeograph 的复数：指用油印机（誊写版印刷机）印出来的油印件；也可指油印机（较旧用法）。"},"examples":[{"en":"The teacher handed out mimeographs of the quiz.","zh":"老师发下了测验的油印件。"},{"en":"In the archives, we found stacks of faded mimeographs from the 1960s.","zh":"在档案馆里，我们找到一摞摞20世纪60年代褪色的油印资料。"}]},{"partOfSpeech":"vt.","definition":{"en":"Third-person singular form of mimeograph: to make copies using a mimeograph machine; more generally, to duplicate by an old stencil-based method.","zh":"mimeograph 的第三人称单数：用油印机印刷、复制；也可泛指用旧式誊写版方法进行复印。"},"examples":[{"en":"She mimeographs the flyers for the club meeting.","zh":"她把社团会议的传单用油印机印出来。"},{"en":"Before photocopiers, offices often mimeographed memos for everyone.","zh":"在复印机普及之前，办公室常用油印来给所有人复制备忘录。"}]}],"synonyms":["stencil copies","duplications","handouts (context)","stencil-print","duplicate"],"phonetic":"/ˈmɪmiəˌɡræfs/","extraExplanation":["“mimeograph（油印）”在20世纪的学校与办公室非常常见：先在蜡纸/誊写纸上刻写出字，再用滚筒把油墨压印到纸上。因为成本低、速度快，它常与“课堂讲义、社团传单、内部通知”等场景联系在一起。如今多被 photocopy / print 取代，但在历史材料、文学回忆或复古语境中仍会出现。"]}
{"word":"mimeography","summary":{"en":"Mimeography is an old stencil-and-ink method for making copies, and it can also mean the copies made that way.","zh":"Mimeography 指用蜡纸模板和油墨进行的旧式油印/誊写复制方法，也可指用这种方式印出的油印件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making copies with a mimeograph machine (an older duplicating method using stencils and ink)","zh":"誊写复制（用誊写版/油印机通过蜡纸刻写模板和油墨来复印的旧式方法）"},"examples":[{"en":"Before photocopiers were common, many schools used mimeography to copy worksheets.","zh":"在复印机普及之前，许多学校用油印来复制作业单。"},{"en":"The club relied on mimeography to produce hundreds of flyers cheaply.","zh":"这个社团靠油印以低成本制作了数百张传单。"}]},{"partOfSpeech":"n.","definition":{"en":"copies produced by a mimeograph machine; mimeographed pages","zh":"油印件；誊写复制出来的页面/资料"},"examples":[{"en":"He found a stack of mimeography from the 1970s in the archive.","zh":"他在档案室里找到一摞20世纪70年代的油印资料。"},{"en":"The mimeography was faded, but the text was still readable.","zh":"油印件有些褪色，但文字仍然清晰可读。"}]}],"synonyms":["mimeographing","stencil duplication","duplicating"],"phonetic":"ˌmaɪmiˈɑːɡrəfi","extraExplanation":["“mimeography”与“mimeograph”相关。mimeograph（油印机/誊写复制机）在20世纪中期的学校、教会、社团里非常常见，因为它比正式印刷便宜、又比手抄快。常见特征是纸面上会有紫色或蓝紫色的油墨味道与轻微晕染。","现代英语中更常用“mimeograph”（作名词或动词）来指设备或“油印/誊写复制”这个动作；“mimeography”偏书面或用于描述这种复制方式本身。"]}
{"word":"mimeoing","summary":{"en":"“Mimeoing” means making copies with a mimeograph (or, loosely, duplicating papers quickly).","zh":"“mimeoing”指用油印机印制文件；也可泛指快速大量复制资料。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make copies of a document using a mimeograph machine (an older duplicating method); by extension, to duplicate handouts quickly","zh":"用油印机（mimeograph，一种旧式复印/誊写设备）印制文件；也可引申为快速大量复制讲义/资料"},"examples":[{"en":"The teacher spent the evening mimeoing worksheets for the class.","zh":"老师晚上一直在油印（复印）给全班用的练习纸。"},{"en":"Before photocopiers were common, schools often mimeoed tests and notices.","zh":"在复印机普及之前，学校常用油印来印试卷和通知。"}]}],"synonyms":["duplicate","reproduce","photocopy","copy","run off","mimeograph"],"phonetic":"ˈmɪmiˌoʊɪŋ","extraExplanation":["“mimeo”来自“mimeograph（油印机）”，在20世纪的学校和办公室很常见：用蜡纸刻写后上机滚印，通常会有紫色或蓝紫色墨迹和一种特殊的油墨味。现在多被“photocopy / print”取代，因此带一点复古/年代感。","现代英语里更常见的写法是“mimeographing”或直接说“copying/photocopying”。“mimeoing”也能理解，但更口语、更非正式。"]}
{"word":"mimeos","summary":{"en":"“Mimeos” usually means mimeographed copies/handouts (old-fashioned duplicates).","zh":"“mimeos”通常指“油印件/油印讲义”（较老式的批量复制品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mimeo”: a copy or handout made with a mimeograph (an older duplicating machine).","zh":"“mimeo”的复数：用油印机（早期的复印/印刷式复写机）制作的油印件、讲义。"},"examples":[{"en":"The teacher passed out mimeos of the worksheet to the whole class.","zh":"老师把练习题的油印讲义发给全班同学。"},{"en":"I found a box of old mimeos in the school storeroom.","zh":"我在学校储藏室里发现了一箱旧的油印件。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) Third-person singular of “mimeo”: to duplicate something using a mimeograph; more generally, to make multiple copies (old-fashioned).","zh":"（少见）“mimeo”的第三人称单数：用油印机复写；泛指把材料复印成多份（较老派用法）。"},"examples":[{"en":"He mimeos the reading list before the meeting.","zh":"他在开会前把阅读清单油印/复印成多份。"}]}],"synonyms":["handouts","copies","photocopies","duplicates"],"phonetic":"/ˈmɪmioʊ/","extraExplanation":["“mimeo”源自“mimeograph（油印机）”。在复印机普及之前，学校和办公室常用油印机批量复制资料；油印件常带有淡紫色/蓝色墨迹的复古观感。现代英语里这个词偏怀旧或特定场景使用，日常更常说“handouts / copies / photocopies”。"]}
{"word":"mimer","summary":{"en":"“Mimer” usually means a mime performer; rarely it can mean to mime (to act silently).","zh":"“mimer”通常指“哑剧演员”；很少情况下也可作动词，表示“用哑剧表演/无声模仿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who performs mime (a silent performance using gestures and facial expressions) or who imitates actions without speaking.","zh":"哑剧演员；用动作和表情进行无声表演的人；也可指用肢体模仿动作的人。"},"examples":[{"en":"The street mimer drew a crowd with a funny pretend struggle against the wind.","zh":"那位街头哑剧演员用“假装被风吹走”的搞笑表演吸引了一群人。"},{"en":"As a child, she loved watching a mimer tell a whole story without words.","zh":"小时候，她很喜欢看哑剧演员不用一句话就讲完整个故事。"}]},{"partOfSpeech":"v.","definition":{"en":"To perform or express something through mime; to imitate silently (rare in modern English).","zh":"（较少用）用哑剧表演；无声地模仿、表演。"},"examples":[{"en":"He mimed/mimered opening an invisible door to start the lesson.","zh":"他用动作表演“打开一扇看不见的门”，作为课堂开场。"}]}],"synonyms":["mime","pantomimist","mimic","imitator"],"phonetic":"/ˈmaɪmər/","extraExplanation":["“mimer”在英语里不算常用词，更常见的是“mime”（名词/动词）和“mimer”（名词，指哑剧演员）。如果你是在法语语境里看到“mimer”，它常见的意思是“模仿、学……的样子”，对应英语多用“to imitate”或“to mimic”。"]}
{"word":"mimers","summary":{"en":"“Mimers” means people who perform mime (silent acting) or imitate actions; it’s the plural of “mimer.”","zh":"“mimers”指哑剧表演者或模仿者；是“mimer”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who perform mime (silent acting with gestures), or people who imitate others’ actions or behavior","zh":"哑剧表演者；（较少见）模仿他人动作或行为的人"},"examples":[{"en":"The street festival featured several mimers performing in front of the subway station.","zh":"街头艺术节上有几位哑剧演员在地铁站前表演。"},{"en":"Kids gathered around the mimers and tried to copy their movements.","zh":"孩子们围在哑剧演员旁边，试着模仿他们的动作。"},{"en":"Some online mimers recreate famous movie scenes without speaking.","zh":"有些网络上的“模仿者”会不说话地重现经典电影片段。"}]}],"synonyms":["mimes","pantomimists","imitators"],"phonetic":"/ˈmaɪmɚz/","extraExplanation":["“mimers”通常是名词“mimer”的复数形式（= mime actor，哑剧演员）。日常英语里更常用“mime”（/maɪm/）或“mime artist”，而“mimer”相对少见。","如果你想表达“模仿”的动作，更常用动词“mime”或“imitate”。例如：He mimed opening a door.（他用动作比划出开门。）","另外注意：北欧神话里有专名“Mímir”（智慧之泉的守护者）。若你看到“Mimir’s”多为所有格（米米尔的），不一定是复数“mimers”。"]}
{"word":"mimes","summary":{"en":"“Mimes” can mean (1) mime performers (plural noun) or (2) “copies/acts out silently” (verb form of “mime”).","zh":"“mimes”既可指“哑剧演员们”（名词复数），也可作动词，表示“模仿/用动作无声表现”（第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who entertains by acting silently, using gestures and facial expressions instead of words","zh":"哑剧演员；用手势与表情无声表演来娱乐的人"},"examples":[{"en":"We watched mimes perform in the park, pretending to be trapped in invisible boxes.","zh":"我们在公园看哑剧演员表演，他们假装被困在看不见的盒子里。"},{"en":"The street mimes drew a crowd without saying a single word.","zh":"街头的哑剧演员一言不发，却吸引了许多人围观。"}]},{"partOfSpeech":"v.","definition":{"en":"to copy someone’s actions, expressions, or speech (often in an exaggerated or playful way)","zh":"模仿（某人的动作、表情或说话方式，常带夸张或逗趣意味）"},"examples":[{"en":"He mimes his teacher’s voice to make his friends laugh.","zh":"他模仿老师的声音来逗朋友笑。"},{"en":"The actor mimes opening a door, even though there isn’t one.","zh":"演员做出开门的动作，尽管那里并没有门。"}]},{"partOfSpeech":"v.","definition":{"en":"to represent an action silently through gestures, especially in theater","zh":"用动作无声地表现（某个行为），尤用于戏剧表演"},"examples":[{"en":"She mimes drinking from a cup to show she’s thirsty.","zh":"她用动作比出喝水，表示她口渴。"},{"en":"In the rehearsal, the dancers mimed the story before adding music.","zh":"彩排时，舞者先用动作无声演出故事，之后再加入音乐。"}]}],"synonyms":["pantomimes","imitates","copies","acts out","pantomime"],"phonetic":"/maɪmz/","extraExplanation":["“mime”既可以指“哑剧演员”（名词），也可以指“模仿/用动作表现”（动词）。拼写上，名词复数是 mimes；动词第三人称单数现在时也是 mimes（如：He mimes）。","文化上，英语里常见的“French mime（法国哑剧）”会让人联想到穿条纹衫、戴贝雷帽、脸上涂白的街头表演形象；这是流行文化中的典型形象，但现实中的哑剧表演风格很多样。"]}
{"word":"mimesis","summary":{"en":"Mimesis means imitation or representation of real life in art and literature.","zh":"Mimesis 指艺术与文学中对现实生活的模仿或再现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The imitation or representation of real life in art, literature, or performance.","zh":"（艺术、文学、表演中）对现实生活的模仿或再现。"},"examples":[{"en":"Many novels use mimesis to make characters feel like real people.","zh":"许多小说通过“摹仿（mimesis）”让人物显得像真实的人。"},{"en":"In drama class, we practiced mimesis by copying everyday gestures.","zh":"在戏剧课上，我们通过模仿日常动作来练习摹仿。"}]},{"partOfSpeech":"n.","definition":{"en":"A work, style, or technique that closely copies another work or the real world.","zh":"一种高度贴近现实或仿照他作的作品、风格或技巧。"},"examples":[{"en":"The film’s handheld camera style is a kind of mimesis of documentary footage.","zh":"这部电影的手持摄影风格是一种对纪录片影像的摹仿。"},{"en":"Her painting is less about mimesis and more about expressing emotion.","zh":"她的画更少追求写实的摹仿，更强调情感表达。"}]}],"synonyms":["imitation","representation","realism","verisimilitude","mimicry"],"phonetic":"/mɪˈmiːsɪs/","extraExplanation":["“mimesis”来自古希腊语，常见于文学与美学讨论，尤其与柏拉图和亚里士多德有关：柏拉图有时把艺术看作对现实的“再摹仿”，态度较谨慎；亚里士多德则认为摹仿是人类学习与艺术创作的自然方式。","在现代批评中，mimesis常与“realism（现实主义）”相关，但不完全等同：mimesis强调“呈现得像真实”，而不一定要求作品在风格上就是传统意义的写实。"]}
{"word":"mimesises","summary":{"en":"Mimesis means imitation or representation—especially how art depicts real life.","zh":"mimesis 指「摹仿／再現」，特別用來談藝術如何呈現現實生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literature & art) Imitation or representation of real life in art, especially the idea that art “copies” or reflects nature and human actions.","zh":"（文學與藝術）摹仿；再現現實。指藝術對自然、人生與人類行為的模擬或呈現，常用於討論藝術如何「反映」現實。"},"examples":[{"en":"In Aristotle’s view, tragedy is a form of mimesis of human action.","zh":"在亞里斯多德看來，悲劇是一種對人類行動的摹仿（mimesis）。"},{"en":"The novel’s vivid details create a strong sense of mimesis, as if the characters were real people.","zh":"這部小說的細節非常生動，帶來很強的再現感（mimesis），彷彿角色是真實存在的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(More general) Copying someone’s behavior, speech, or style; mimicry.","zh":"（較一般）模仿他人的行為、說話方式或風格；仿效。"},"examples":[{"en":"Children learn a lot through mimesis, repeating what adults say and do.","zh":"孩子常透過模仿（mimesis）來學習，重複大人說的話、做的事。"}]}],"synonyms":["imitation","representation","mimicry","depiction"],"phonetic":"/mɪˈmiːsɪs/","extraExplanation":["你輸入的「mimesises」通常被理解為「mimesis」的複數拼法，但更常見的複數是 **mimeses**（讀音不同於單數）。在學術寫作中也常直接用單數 **mimesis** 作為不可數概念來談。","詞源來自希臘語，常與古典美學相關：**Plato（柏拉圖）**常把藝術的摹仿看成「距離真理更遠」；**Aristotle（亞里斯多德）**則更強調摹仿能揭示人類行動與情感的普遍性。"]}
{"word":"mimester","summary":{"en":"“Mimester” isn’t standard English; you probably mean “semester” or “trimester.”","zh":"“mimester”不是标准英语；你可能想写“semester”或“trimester”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “semester” (half-year school term) or “trimester” (three-month period, or a school term in a three-term system).","zh":"不是标准英语单词。很可能是把“semester”（学期；半年一学期的学制）或“trimester”（三个月；三学期制中的一学期/孕期的三个月阶段）拼错了。"},"examples":[{"en":"Correct: Our semester ends in May.","zh":"正确：我们的学期在五月结束。"},{"en":"Correct: She is in her second trimester of pregnancy.","zh":"正确：她正处于怀孕的第二孕期（第二个三个月）。"}]}],"synonyms":["semester","trimester"],"phonetic":"ˈsɛmɪstɚ","extraExplanation":["“mimester”在常见词典与正规语料中几乎不作为英语单词出现。若你是在学校语境里想表达“学期”，通常用 semester；若是“三学期制”或“孕期分段”，则常用 trimester。","如果你愿意，可以告诉我你看到这个词的句子或具体场景（学校/怀孕/其他），我可以帮你确认最贴切的正确词。"]}
{"word":"mimetene","summary":{"en":"“mimetene” isn’t a standard English word; you may mean “mimetic” (imitative).","zh":"“mimetene”不是标准英语词；你可能想写“mimetic”（模仿的）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a specialized term/name. Common intended word: “mimetic” (related to imitation).","zh":"不是标准英语单词；很可能是拼写错误或某个专业术语/名称。常见的目标词可能是 “mimetic”（与“模仿”有关）。"},"examples":[{"en":"I couldn’t find “mimetene” in standard dictionaries—did you mean “mimetic”?","zh":"我在常见词典里找不到“mimetene”——你是不是想写“mimetic”？"},{"en":"In literature classes, people use the word “mimetic” to talk about art that imitates real life.","zh":"在文学课上，人们会用“mimetic”来谈论“模仿真实生活”的艺术。"}]}],"synonyms":["imitative","copying","representational"],"phonetic":"/mɪˈmɛtɪk/","extraExplanation":["“mimetic”是更常见的词，意思是“模仿的、拟态的”，来自希腊语 mimēsis（模仿）。如果你是在化学/生物学论文里看到“mimetene”，也可能是某种化合物名、商品名或专有名词；请提供上下文句子或来源，我可以帮你准确判断。","你也可以检查：是否把 mimetene 写成了 mimetene/mimetine/mimetene 等；英语里一个字母差异可能会从常用词变成不存在的词。"]}
{"word":"mimetesite","summary":{"en":"Mimetesite is a lead arsenate chloride mineral, usually yellow-brown, often found in oxidized lead deposits.","zh":"Mimetesite（砷铅矿）是一种含氯的砷酸铅矿物，常呈黄褐色，多见于铅矿床氧化带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A yellow to brown mineral made of lead arsenate chloride, often found in the oxidized zones of lead ore deposits.","zh":"一种黄色到棕色的矿物，主要成分为氯砷酸铅（铅-砷酸盐-氯化物），常见于铅矿床的氧化带。"},"examples":[{"en":"Mimetesite often forms small hexagonal crystals in old lead mines.","zh":"砷铅矿常在老铅矿中形成小的六方晶体。"},{"en":"Because mimetesite contains lead and arsenic, it should be handled with care.","zh":"由于砷铅矿含有铅和砷，接触时应小心处理。"}]}],"synonyms":["mimetite (variant spelling)","lead arsenate chloride (descriptive name)"],"phonetic":"/mɪˈmɛtəˌsaɪt/","extraExplanation":["词源与命名：mimetesite 来自希腊语 mimētēs（“模仿者”），因为它的外观常与另一种矿物 pyromorphite（磷氯铅矿）非常相似，早期矿物学家认为它“像在模仿”对方。","使用语境：这个词主要出现在地质学、矿物学、博物馆标本介绍和矿物收藏圈。日常英语中很少用到。","安全提示（常识性背景）：标本可能含有有毒元素（铅、砷）。通常不建议打磨、吸入粉尘或用手直接接触后不洗手；收藏与展示时保持清洁、密封更安全。"]}
{"word":"mimetic","summary":{"en":"Mimetic means “imitative,” especially describing art or writing that represents real life, or behavior learned by copying others.","zh":"mimetic 意为“模仿的/再现的”，常用于文学艺术中指对现实的再现，也可指通过模仿他人而形成的学习或行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Imitating real life, nature, or another work of art (often in order to represent it).","zh":"模仿真实生活、自然或其他艺术作品的（常指再现、描绘）。"},"examples":[{"en":"The novel has a mimetic style, describing everyday life in careful detail.","zh":"这部小说具有模仿现实的风格，细致描写日常生活。"},{"en":"Traditional realist painting is often described as mimetic because it aims to look like what we see.","zh":"传统的写实绘画常被称为“模仿性的”，因为它旨在呈现我们所见的样子。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to imitation as a way of learning or behaving (copying what others do).","zh":"与模仿式学习或行为有关的（通过学别人来学习/行动）。"},"examples":[{"en":"Children develop many social skills through mimetic learning.","zh":"儿童通过模仿式学习发展出许多社交技能。"},{"en":"His mimetic gestures made it obvious he was copying his teacher.","zh":"他模仿性的手势让人一看就知道他在学老师。"}]}],"synonyms":["imitative","representational","realistic","copying"],"phonetic":"/məˈmɛtɪk/","extraExplanation":["词源：来自希腊语 mimētikos（“善于模仿的”），与 mimesis（“模仿/再现”）同源。在文学与艺术评论中，mimetic 常与“realistic（写实的）”相关，但更强调“再现现实的方式/理念”，不一定等同于“看起来完全像真的”。","常见搭配：mimetic art（模仿性艺术/再现性艺术）、mimetic desire（模仿性欲望：人会想要别人想要的东西——常见于法国思想家勒内·吉拉尔 René Girard 的理论语境）、mimetic learning（模仿学习）。"]}
{"word":"mimetical","summary":{"en":"Mimetical means “imitative,” especially in art or literature that represents real life.","zh":"mimetical 意为“模仿的/摹拟的”，尤指文学或艺术对现实生活的再现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Imitative; describing art, writing, or behavior that copies real life or another model (often used in literary/art criticism).","zh":"模仿的；摹拟的（常用于文学/艺术评论，指模仿现实或某个范本的表现方式）。"},"examples":[{"en":"The novel uses mimetical details to make the city feel real.","zh":"这部小说用摹拟现实的细节让城市显得很真实。"},{"en":"Her mimetical style is close to documentary film, focusing on everyday life.","zh":"她的模仿式风格接近纪录片电影，关注日常生活。"},{"en":"Some critics prefer symbolic art to mimetical representation.","zh":"一些评论家更喜欢象征性艺术，而不是摹拟式的再现。"}]}],"synonyms":["mimetic","imitative","representational","naturalistic"],"phonetic":"/mɪˈmɛtɪkəl/","extraExplanation":["“mimetical”比较正式，常见于文学、艺术、戏剧理论里；日常英语更常用“mimetic”。","词源与“mimesis（摹仿/模仿现实的艺术观念）”相关，源自希腊语，常用来讨论艺术如何“再现”现实。"]}
{"word":"mimetically","summary":{"en":"Mimetically means “by imitation,” and it can also mean “in a realistic, life-representing way” in art and literature.","zh":"mimetically 意为“以模仿的方式”；在艺术与文学语境中也可指“以贴近现实、模仿再现的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that imitates or copies something (often by gesture, behavior, style, or representation).","zh":"以模仿的方式；模仿地（常指通过动作、行为、风格或表现来复制某物）。"},"examples":[{"en":"The actor moved mimetically, copying the teacher’s strict posture.","zh":"那位演员以模仿的方式行动，复制了老师严厉的站姿。"},{"en":"Children learn mimetically by watching and repeating what adults do.","zh":"孩子常通过观察并重复大人的行为来进行模仿式学习。"}]},{"partOfSpeech":"adv.","definition":{"en":"(In art or literature) In a way that aims to represent real life realistically; mimetically means “as mimesis.”","zh":"（艺术或文学）以再现现实生活的方式；模仿再现地（即“摹仿/模仿再现”）。"},"examples":[{"en":"The novel describes the city mimetically, with details that feel true to everyday life.","zh":"这部小说以模仿再现的方式描写城市，细节让人感觉非常贴近日常生活。"},{"en":"Some critics praise the film for working mimetically rather than symbolically.","zh":"有些评论家称赞这部电影更偏向模仿再现，而不是象征表达。"}]}],"synonyms":["imitatively","by imitation","copyingly","realistically (in art/lit context)"],"phonetic":"/mɪˈmɛtɪkli/","extraExplanation":["“mimetically”来自“mimetic（模仿的）”，根源可追溯到希腊语“mimesis（摹仿/再现）”。在日常英语中更常见的说法是“imitatively”或直接用“by imitation”。","在文学与艺术批评里，“mimetic”常用来谈作品是否“像现实”（realistic/true to life），与更强调象征或观念的表达方式相对。"]}
{"word":"mimetism","summary":{"en":"Mimetism usually means biological mimicry—copying another organism or the environment for survival; it can also mean imitation in art/literature, though that sense is rarer.","zh":"mimetism通常指生物学上的“拟态/拟 mimicry”，即模仿其他生物或环境以求生；也可指艺术/文学中的模仿，但较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In biology, the ability of an animal or plant to imitate another organism or its surroundings (for example, in color or shape) to avoid danger or gain an advantage; mimicry.","zh":"（生物学）拟态；指动物或植物通过模仿其他生物或周围环境（如颜色、形状）来躲避天敌或获得生存优势。"},"examples":[{"en":"The leaf insect’s mimetism makes it look like a real leaf, helping it hide from predators.","zh":"叶䗛的拟态让它看起来像一片真的叶子，从而躲避捕食者。"},{"en":"Many butterflies show mimetism, copying warning colors to discourage birds.","zh":"许多蝴蝶具有拟态，会模仿警戒色来吓退鸟类。"}]},{"partOfSpeech":"n.","definition":{"en":"In art and literature, imitation of reality or of another style (a less common use; often replaced by “mimesis” or “mimicry”).","zh":"（艺术/文学）对现实或他人风格的模仿（较少用法；常用“mimesis”或“mimicry”替代）。"},"examples":[{"en":"The critic discussed the novel’s mimetism as a way of reflecting everyday speech.","zh":"评论家讨论了这部小说的“模仿性”，认为它反映了日常口语。"}]}],"synonyms":["mimicry","mimesis","imitation","camouflage"],"phonetic":"/ˈmɪməˌtɪzəm/","extraExplanation":["“mimetism”在英语里更偏学术、也更少见；在生物学语境中更常见的词是“mimicry（拟态）”。","相关概念：Batesian mimicry（贝氏拟态：无毒的模仿有毒的）、Müllerian mimicry（缪勒氏拟态：多个有毒/危险物种互相“共享”警戒信号）。","词源上与希腊语“mimesis（模仿）”有关，因此在艺术理论中也可能出现类似用法，但现代英语中“mimesis”更标准。"]}
{"word":"mimetite","summary":{"en":"Mimetite is a yellow-to-brown mineral found in oxidized lead ore deposits.","zh":"砷酸氯铅是一种常见于铅矿床氧化带、颜色多为黄色到褐色的矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (lead arsenate chloride) that is usually yellow to orange-brown and forms in the oxidized zones of lead ore deposits","zh":"一种矿物（砷酸氯铅），常呈黄色到橙褐色，多形成于含铅矿床的氧化带"},"examples":[{"en":"Mimetite often appears as small, bright yellow crystals in old lead mines.","zh":"砷酸氯铅常在老铅矿中以小而鲜黄的晶体出现。"},{"en":"The collector labeled the specimen as mimetite from an oxidized lead deposit.","zh":"收藏者把这块标本标注为产自氧化带铅矿床的砷酸氯铅。"}]}],"synonyms":["lead arsenate chloride"],"phonetic":"/ˈmɪməˌtaɪt/","extraExplanation":["“mimetite”源自“mimetic（模仿的）”，因为它常与另一种矿物“pyromorphite（磷氯铅矿）”外观相似，容易混淆。","含砷矿物可能具有毒性风险；在野外或收藏时应避免吸入粉尘、避免入口，并在接触后洗手。"]}
{"word":"mimetites","summary":{"en":"Mimetite is a yellow-orange lead mineral found in oxidized lead ore deposits; “mimetites” is its plural form.","zh":"砷铅矿是一种黄橙色的含铅矿物，常见于铅矿床的氧化带；“mimetites”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow-to-orange mineral (lead chlorarsenate) that forms in the oxidized zones of lead ore deposits.","zh":"一种黄色到橙色的矿物（氯砷酸铅），常形成于铅矿床的氧化带中。"},"examples":[{"en":"The collector added a small mimetite specimen to her mineral cabinet.","zh":"这位收藏家把一小块砷铅矿标本加入了她的矿物柜。"},{"en":"Mimetite is often found with other secondary lead minerals.","zh":"砷铅矿常与其他次生铅矿物伴生。"}]}],"synonyms":["lead chlorarsenate"],"phonetic":"ˈmɪməˌtaɪt","extraExplanation":["“mimetites”通常是 **mimetite** 的复数形式（多个砷铅矿标本/晶体）。","词源来自希腊语 *mimētēs*（“模仿者”），因为它的晶体外观常会“像”某些其他矿物（例如磷铅矿 pyromorphite），容易在外观上混淆。"]}
{"word":"Mimi","summary":{"en":"Mimi is most commonly a female name or nickname; it can also be a cute pet name, and rarely a baby-talk word for “sleep.”","zh":"Mimi 最常见是女性名字或昵称；也可作可爱的宠物名；极少情况下可作儿语表示“睡觉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name or nickname (often short for names like Miriam, Michelle, or Minami).","zh":"女性名字或昵称（常见作 Miriam、Michelle、Minami 等名字的简称）。"},"examples":[{"en":"Mimi is coming to dinner tonight.","zh":"Mimi 今晚会来吃饭。"},{"en":"My aunt Mimi lives in Los Angeles.","zh":"我阿姨 Mimi 住在洛杉矶。"}]},{"partOfSpeech":"n.","definition":{"en":"a pet name for a cat or small animal.","zh":"宠物名（常用于猫或小型动物）。"},"examples":[{"en":"Our cat Mimi always sleeps on the sofa.","zh":"我们的猫 Mimi 总是在沙发上睡觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(baby talk, uncommon) sleep; bedtime.","zh":"（婴儿语/儿语，不常见）睡觉；睡觉时间。"},"examples":[{"en":"Time for mimi—let’s go to bed.","zh":"该“睡睡”了——我们上床吧。"}]}],"synonyms":["(name) Miriam","(name) Michelle","(pet name) kitty (not equivalent; just similar context)"],"phonetic":"/ˈmiːmi/","extraExplanation":["“Mimi”在英语里主要被当作人名/昵称使用，因此通常首字母大写。作为昵称时带有亲昵、可爱的语气。","在西方文化中，“Mimi”也常让人联想到普契尼歌剧《波希米亚人》（La Bohème）里的女主角 Mimì（带重音符号），在英文讨论歌剧时也会见到这种拼法。","表示“睡觉”的“mimi”更像儿语或借自法语/多语言的童语表达，在正式英语中不常用。"]}
{"word":"mimi","summary":{"en":"Mimi is most commonly a female name or a family nickname for a grandmother; it can also refer to the opera character Mimi in La bohème.","zh":"Mimi 最常见是女性人名或对奶奶/外婆的亲昵称呼；也可指歌剧《波希米亚人》中的角色 Mimi。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a personal name)","zh":"（女性）名字；人名"},"examples":[{"en":"Mimi is a common nickname for names like Miriam or Michelle.","zh":"Mimi 常用作 Miriam 或 Michelle 之类名字的昵称。"},{"en":"Mimi Chen will present the project next week.","zh":"Mimi Chen 下周将展示这个项目。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a nickname for a grandmother, used by children and families","zh":"（非正式）奶奶/外婆的昵称（家人、孩子常用）"},"examples":[{"en":"We’re visiting Mimi this weekend.","zh":"我们这周末要去看 Mimi（奶奶/外婆）。"},{"en":"Mimi baked cookies for the grandkids.","zh":"Mimi 给孙辈/外孙辈烤了饼干。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known character name in Western culture, especially Mimi in the opera La bohème","zh":"（文化语境）经典角色名，尤其指歌剧《波希米亚人》中的 Mimi"},"examples":[{"en":"She sang the role of Mimi in La bohème.","zh":"她在《波希米亚人》中演唱了 Mimi 这个角色。"},{"en":"Mimi is often portrayed as gentle and tender in the story.","zh":"在故事里，Mimi 常被塑造成温柔细腻的形象。"}]}],"synonyms":["(grandmother) grandma","nana","granny","(given name) nickname"],"phonetic":"/ˈmiːmi/","extraExplanation":["在英语里，Mimi 多数情况下是人名或家族称呼，不是普通词汇；含义要靠语境判断。","作为“奶奶/外婆”的称呼时，各家写法不同（如 Mimi / Mimy 等），通常带有亲昵感。","在西方艺术语境里，Mimi 也可能让人联想到《波希米亚人》（La bohème）及其改编作品（如音乐剧《吉屋出租》Rent 的相关角色原型）。"]}
{"word":"mimiambi","summary":{"en":"Mimiambi are short comic poems from ancient Greek literature that imitate everyday speech and scenes, usually written in iambic meter.","zh":"Mimiambi 指古希腊文学中的短篇喜剧诗，常用抑扬格，模仿日常口语与生活场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “mimiambus”: short comic poems (often in iambic meter) that imitate everyday speech and scenes, especially in ancient Greek literature.","zh":"“mimiambus（拟哑剧抑扬格短诗）”的复数：一种短小的喜剧性诗作（常用抑扬格），模仿日常口语与生活场景，常见于古希腊文学。"},"examples":[{"en":"Herodas is best known for his mimiambi, which portray ordinary people in lively dialogue.","zh":"赫罗达斯最著名的是他的 mimiambi，以生动对话描绘普通人的生活。"},{"en":"In class, we compared a Greek mime with the mimiambi to see how both reflect everyday life.","zh":"课上我们把希腊哑剧与 mimiambi 作比较，看它们如何共同反映日常生活。"}]}],"synonyms":["mimiambuses (plural)","mimiambs (less common)"],"phonetic":"/ˌmɪmiˈæmbaɪ/","extraExplanation":["“mimiambi”比较少见，多出现在古典文学或文学史研究中。词源可拆为：mimos（μίμος，模仿/哑剧）+ iambos（ἴαμβος，抑扬格诗）。在英语里更常见的单数形式是 “mimiambus”，也有人直接用 “mimiamb”（较少）。","如果你原本想查的是别的词（比如人名、网名或拼写相近的单词），可以告诉我出现它的句子或语境，我能帮你确认真正的目标词。"]}
{"word":"mimiambic","summary":{"en":"“Mimiambic” means relating to a short dramatic poem (a mimiamb) written in iambic meter, often comic or satirical.","zh":"“mimiambic”指与一种用抑扬格写成、常带喜剧或讽刺色彩的短小戏剧式诗体（mimiamb）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a mimiamb—a short, often humorous or satirical dramatic sketch written in iambic meter (especially in ancient Greek poetry).","zh":"与“拟哑剧短诗/哑剧小品诗（mimiamb）”有关的；指一种用抑扬格（iambic meter）写成、常带幽默或讽刺色彩的短小戏剧式诗歌（尤见于古希腊作品）。"},"examples":[{"en":"Herodas is famous for mimiambic poems that portray everyday life with sharp humor.","zh":"赫罗达斯（Herodas）以描写日常生活、幽默犀利的 mimiambic 诗作而闻名。"},{"en":"The play’s dialogue uses a mimiambic rhythm to create a lively, conversational tone.","zh":"这部戏的对白运用了 mimiambic 的节奏，让语气更活泼、像日常对话。"}]}],"synonyms":["iambic (related in meter)","mime-like (in style, loosely)"],"phonetic":"/ˌmɪmiˈæmbɪk/","extraExplanation":["“mimiambic”来自“mimiamb”。mimiamb 可理解为“mime（模仿/哑剧式表演）+ iamb（抑扬格）”的结合：内容常像小舞台短剧，语言偏口语、情境感强。","该词非常学术、文学研究语境中才常见；日常英语里更常说“iambic”（抑扬格的）或直接说“a mimiamb”（一种体裁）。","容易拼写混淆：mimiambic（形容词）↔ mimiamb（名词）。"]}
{"word":"mimiambics","summary":{"en":"Mimiambics are poems (or the genre) made of short, often humorous dramatic sketches written in iambic meter.","zh":"mimiambics 指以抑扬格写成的短小拟剧诗作，或指这一体裁本身，常带幽默/讽刺与日常对话感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poems written in the mimiambic style (short, often humorous or realistic dramatic sketches written in iambic meter).","zh":"以“滑稽抑扬格短剧诗”（mimiambic）体写成的诗作（常为短小、带戏剧性、偏写实或诙谐，以抑扬格为主）。"},"examples":[{"en":"In the literature class, we read a few mimiambics to see how everyday speech can become poetry.","zh":"在文学课上，我们读了几首mimiambics，看看日常口语如何变成诗。"},{"en":"Herodas is famous for mimiambics that portray ordinary people and their sharp conversations.","zh":"赫罗达斯（Herodas）以描写小人物与犀利对话的mimiambics闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"The mimiambic genre or mode as a whole (mimic/dramatic sketches in iambic verse).","zh":"“mimiambic”这一体裁/风格本身（以抑扬格写成的拟剧式短场景、对话体小品）。"},"examples":[{"en":"The poet experimented with mimiambics, mixing drama and rhythm in a playful way.","zh":"这位诗人尝试mimiambics，用俏皮的方式把戏剧性和节奏感混在一起。"}]}],"synonyms":["mimiambs","iambic sketches","dramatic iambics"],"phonetic":"/ˌmɪmiˈæmbɪk/","extraExplanation":["“mimiambic / mimiambics”来自希腊语：mimos（模仿、拟剧的短场景）+ iambos（抑扬格诗）。它常用来指古希腊化时期的一种诗体/作品类型，最常被提到的作家是Herodas（赫罗达斯）。","读到这个词时，可以把它理解成“用抑扬格写成的生活小剧场”：人物对话感强，题材偏日常、讽刺或幽默。"]}
{"word":"mimic","summary":{"en":"Mimic means to imitate someone or something; it can also mean a person/thing that imitates.","zh":"mimic 表示模仿某人或某物；也可指模仿者或仿制物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to copy someone’s actions, speech, or behavior, often to be funny or to show criticism","zh":"模仿（某人的动作、说话方式或行为），常带搞笑或讽刺意味"},"examples":[{"en":"He can mimic his teacher’s voice perfectly.","zh":"他能把老师的声音模仿得惟妙惟肖。"},{"en":"The comedian mimicked the politician’s gestures to make the audience laugh.","zh":"那位喜剧演员模仿政客的手势，把观众逗笑了。"}]},{"partOfSpeech":"v.","definition":{"en":"to resemble or imitate something in appearance or effect (often about nature, technology, or design)","zh":"（在外观或效果上）像……；模仿（常用于自然现象、科技或设计）"},"examples":[{"en":"Some insects mimic leaves to avoid being seen.","zh":"有些昆虫会“拟态”成叶子来避免被发现。"},{"en":"This fabric is designed to mimic the feel of real leather.","zh":"这种布料被设计成模仿真皮的触感。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that imitates another","zh":"模仿者；仿制物"},"examples":[{"en":"He’s a mimic who can copy many accents.","zh":"他是个模仿高手，能模仿多种口音。"}]}],"synonyms":["imitate","copy","parody","impersonate","echo"],"phonetic":"/ˈmɪmɪk/","extraExplanation":["“mimic”既可指人（模仿表演者），也常见于生物学里的“mimicry（拟态）”：动物通过外形或行为像另一种生物来获得保护。","语气提示：mimic 有时暗含“取笑/嘲讽”的感觉；如果你只是中性地说“学习、仿照”，常用 imitate / copy。"]}
{"word":"mimical","summary":{"en":"Mimical means “imitative,” describing copying in speech/behavior or mimicry in appearance.","zh":"mimical 意为“模仿的”，可指言行上的模仿，也可指外形或行为上的拟态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Imitative; relating to copying someone’s actions, speech, or style (like a mimic).","zh":"模仿的；与模仿他人的动作、说话方式或风格有关的（像“模仿者”一样）。"},"examples":[{"en":"The comedian’s mimical voice made the audience laugh.","zh":"那位喜剧演员模仿式的嗓音把观众逗笑了。"},{"en":"Children learn language through a lot of mimical behavior.","zh":"孩子通过大量的模仿行为来学习语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"In biology or art, resembling something else in appearance or behavior; showing mimicry.","zh":"（生物或艺术中）拟态的；在外形或行为上像另一种事物的；表现出“拟态/模仿”的。"},"examples":[{"en":"Some insects have mimical coloring to avoid predators.","zh":"一些昆虫有拟态的颜色来躲避捕食者。"},{"en":"The painting uses mimical forms to echo natural shapes.","zh":"这幅画用拟态的形态来呼应自然的造型。"}]}],"synonyms":["imitative","mimicking","copying","mimetic"],"phonetic":"/ˈmɪmɪkəl/","extraExplanation":["“mimical”在现代英语里比较少见，更常用的是“mimic”（作动词/名词/形容词）或“mimetic”（尤其在生物学、艺术与文学评论中更常见）。","词源上与“mimic（模仿）”同根，来自希腊语“mimos（模仿者、演员）”，所以常带有“像演员表演那样模仿”的感觉。"]}
{"word":"mimically","summary":{"en":"“Mimically” means “in a mimicking/imitating way.”","zh":"mimically 表示“以模仿（仿效）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that copies someone’s actions, speech, or style (often to resemble them closely, sometimes for humor or imitation).","zh":"以模仿的方式（复制他人的动作、说话方式或风格；常用于让自己更像对方，有时带幽默或仿效意味）。"},"examples":[{"en":"The actor spoke mimically, copying the teacher’s accent and pauses.","zh":"那位演员用模仿的方式说话，复制了老师的口音和停顿。"},{"en":"She smiled mimically, trying to match the expressions in the photo.","zh":"她以模仿的方式微笑，试着对上照片里的表情。"},{"en":"He moved mimically behind his friend, making everyone laugh.","zh":"他在朋友身后模仿着动作，把大家都逗笑了。"}]}],"synonyms":["imitatively","in imitation","mockingly","parrot-like"],"phonetic":"/mɪˈmɪkli/"}
{"word":"mimicism","summary":{"en":"Mimicism means imitation—copying someone’s behavior or style, sometimes with a sense of being unoriginal.","zh":"Mimicism 指“模仿”，即模仿他人的行为或风格，有时带有“缺乏原创”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or habit of copying another person’s actions, speech, style, or behavior; imitation (often without much originality).","zh":"模仿行为；模仿习惯（常指缺乏原创性的照搬他人的动作、说话方式、风格或行为）。"},"examples":[{"en":"In some comedy, mimicism is used to imitate a celebrity’s voice and gestures.","zh":"在一些喜剧里，会用模仿来学名人的声音和动作。"},{"en":"Her mimicism helped her learn pronunciation quickly, but she still needed to develop her own speaking style.","zh":"她的模仿能力让她很快学会了发音，但她仍需要发展自己的表达风格。"}]},{"partOfSpeech":"n.","definition":{"en":"A style of art, writing, or performance that closely imitates another style or model.","zh":"一种艺术、写作或表演风格：对某种既有风格或范本进行高度模仿。"},"examples":[{"en":"The novel’s early chapters feel like mimicism of classic detective stories.","zh":"这本小说的前几章读起来像是在模仿经典侦探故事。"}]}],"synonyms":["imitation","mimicry","copying","aping"],"phonetic":"/ˈmɪmɪˌsɪzəm/","extraExplanation":["“mimicism”较少见，更常用的词是“mimicry（模仿/拟态）”或“imitation（模仿）”。在学习语境中，若你想表达“通过模仿来学习”，通常用“imitation”或“learning by imitation”。","词源上与“mimic（模仿者；模仿）”同根，来自希腊语“mimos（模仿者/演员）”。在表达上，“mimicism”有时带一点“只会照搬”的轻微贬义，需要注意语气。"]}
{"word":"mimicked","summary":{"en":"“Mimicked” means “copied/imitated,” either a person’s behavior or something’s look/effect.","zh":"“mimicked”意为“模仿/仿效”，可指模仿人的言行，也可指仿出某物的外观或效果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"copied someone’s actions, speech, or behavior (often to be funny, to learn, or to tease).","zh":"模仿了某人的动作、说话方式或行为（常为搞笑、学习或取笑）。"},"examples":[{"en":"He mimicked his teacher’s accent for laughs.","zh":"他模仿老师的口音逗大家笑。"},{"en":"Children often mimicked the adults around them.","zh":"孩子们常常模仿身边的大人。"}]},{"partOfSpeech":"v.","definition":{"en":"closely resembled or imitated the appearance or effect of something.","zh":"（外观或效果）非常像、仿效了某物。"},"examples":[{"en":"The fabric mimicked the look of real leather.","zh":"这种布料仿出了真皮的外观。"},{"en":"The new lights mimicked natural daylight.","zh":"新灯光模拟了自然日光的效果。"}]}],"synonyms":["imitated","copied","parodied","apened","simulated"],"phonetic":"/ˈmɪmɪkt/","extraExplanation":["“mimicked”是动词“mimic”的过去式/过去分词。常见搭配：mimic someone’s voice/accent/gesture（模仿某人的声音/口音/手势）；mimic the sound of…（模仿……的声音）；mimic nature（仿生、模拟自然）。","语气上，“mimic”有时带“学人精/嘲讽”的感觉；更中性的说法可用“imitate”（更偏学习/复制），科技或医学语境常用“simulate”（模拟）。"]}
{"word":"mimicker","summary":{"en":"A mimicker is someone (or an animal) that imitates voices, sounds, or behavior.","zh":"mimicker 指会模仿声音、声音效果或行为的人（或动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or animal that copies someone’s voice, accent, sounds, behavior, or style, often for fun, performance, or deception.","zh":"模仿者；（人或动物）模仿他人的声音、口音、行为或风格的人/动物，常用于娱乐、表演或欺骗。"},"examples":[{"en":"He’s a talented mimicker who can copy famous actors’ voices.","zh":"他很会模仿，能模仿许多著名演员的声音。"},{"en":"Some birds are natural mimickers and can imitate human speech.","zh":"有些鸟天生就会模仿，甚至能模仿人类说话。"}]}],"synonyms":["mimic","imitator","copycat","impersonator"],"phonetic":"/ˈmɪmɪkɚ/","extraExplanation":["“mimicker”来自动词 mimic（模仿）+ 表示“做……的人”的后缀 -er。日常英语里更常见的是“mimic”（既可作动词也可作名词）；“mimicker”较少用，但意思更强调“以模仿为特点的人”。","语气上，“mimicker/mimic”通常是中性或带玩笑、称赞（如表演天赋）的；但在某些语境也可能含有负面（例如为了嘲讽或欺骗而模仿）。"]}
{"word":"mimickers","summary":{"en":"“Mimickers” means people or animals that imitate others (plural of mimicker).","zh":"“mimickers”指“模仿者”（mimicker 的复数），可指人或动物模仿他人的言行或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or animals that copy another person’s voice, actions, or style; imitators.","zh":"模仿者；学人精（指模仿他人的声音、动作或风格的人或动物）。"},"examples":[{"en":"The parrot is one of nature’s best mimickers and can repeat short phrases.","zh":"鹦鹉是大自然里最会模仿的动物之一，能重复一些短句。"},{"en":"Online mimickers copied the singer’s accent and gestures for fun.","zh":"一些网络模仿者为了好玩，模仿那位歌手的口音和动作。"},{"en":"Good mimickers notice tiny details that others miss.","zh":"擅长模仿的人往往能注意到别人忽略的细节。"}]}],"synonyms":["imitators","copycats","impersonators"],"phonetic":"/ˈmɪmɪkɚz/","extraExplanation":["“mimickers”是“mimicker”的复数。单数形式更常用来指“模仿者”，也常用于动物（如parrot 鹦鹉）或表演者（如impersonator 模仿秀演员）。","语气提示：在日常语境里可以是中性或夸赞（擅长模仿），但也可能带一点贬义，暗示“只会跟风、缺乏原创”。"]}
{"word":"mimicking","summary":{"en":"Mimicking means copying how someone or something looks, moves, or sounds—sometimes to learn or entertain, and sometimes in a mocking way.","zh":"mimicking表示模仿人或事物的外貌、动作或声音；可用于学习或娱乐，也可能带嘲弄意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"copying someone’s actions, speech, or style (often to be funny, to learn, or sometimes to make fun).","zh":"模仿某人的动作、说话方式或风格（常为搞笑、学习；有时也带嘲弄意味）。"},"examples":[{"en":"The toddler kept mimicking her dad’s gestures.","zh":"那个幼儿一直在模仿爸爸的手势。"},{"en":"He was mimicking the teacher’s accent, which felt disrespectful.","zh":"他在模仿老师的口音，让人觉得不太尊重。"},{"en":"Actors spend hours mimicking real people to sound believable.","zh":"演员会花好几个小时模仿真人，让表演更可信。"}]},{"partOfSpeech":"adj.","definition":{"en":"imitating the appearance or behavior of something (used especially for animals, nature, or design).","zh":"模仿某物的外观或行为（尤用于动物、自然现象或设计）。"},"examples":[{"en":"The robot moved in a way mimicking human walking.","zh":"这个机器人以模仿人类走路的方式移动。"},{"en":"Some insects survive by mimicking leaves.","zh":"有些昆虫靠模仿树叶来生存。"}]}],"synonyms":["imitating","copying","aping","parroting","echoing"],"phonetic":"/ˈmɪmɪkɪŋ/","extraExplanation":["“mimicking”通常是动词mimic的现在分词：可以表示正在发生的“模仿”，也常作形容词放在名词前（如“mimicking behavior/voice”）。","语气上，mimic/mimicking有时带“学人说话、带点取笑”的感觉；如果想表达更中性或更礼貌的“模仿”，也可以用imitate / imitation（更正式）、copy（更口语）。"]}
{"word":"mimicries","summary":{"en":"“Mimicries” means multiple acts or instances of imitation; in biology, multiple cases of mimicry used for survival.","zh":"“mimicries”指多种/多次“模仿”；在生物学中指多种“拟态”现象，用于生存。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Actions, behaviors, or copies that imitate someone or something else (plural of “mimicry”).","zh":"模仿的行为或产物；仿效；仿造品（“mimicry”的复数）。"},"examples":[{"en":"The comedian’s mimicries of famous actors were surprisingly accurate.","zh":"那位喜剧演员对著名演员的模仿非常逼真。"},{"en":"In the play, the character uses mimicries to fit in with a richer group.","zh":"在那部戏里，角色用各种模仿来融入更富有的圈子。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology, cases where one organism resembles another (or its surroundings) to gain a survival advantage (plural of “mimicry”).","zh":"（生物）拟态；指一种生物在外形/行为上像另一种生物或环境，以获得生存优势（“mimicry”的复数）。"},"examples":[{"en":"Scientists study mimicries in insects to understand how predators are fooled.","zh":"科学家研究昆虫的拟态现象，以理解捕食者是如何被欺骗的。"},{"en":"Some mimicries make harmless species look dangerous.","zh":"有些拟态会让无害的物种看起来很危险。"}]}],"synonyms":["imitations","impersonations","copies","parodies","mockery","mimicry (biology: camouflage-related)"],"phonetic":"/ˈmɪmɪkriz/","extraExplanation":["“mimicries”在日常英语里不算特别常见，更常用不可数的“mimicry”（如：Her mimicry is impressive. 她的模仿很厉害）。当你强调“多种模仿/多次模仿/不同类型的拟态”时，才更可能看到复数“mimicries”。","生物学里常见的相关概念包括：Batesian mimicry（贝茨氏拟态：无害装有害）和 Müllerian mimicry（缪勒氏拟态：多种有害长得像，强化警戒效果）。"]}
{"word":"mimicry","summary":{"en":"Mimicry means copying someone or something; in biology, it also means an organism resembling another to survive.","zh":"mimicry 指模仿；在生物学中也指拟态，即生物通过像另一种生物/物体来生存。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of copying someone’s behavior, voice, or style, often for humor, practice, or criticism","zh":"模仿；（对他人行为、声音或风格的）仿效，常用于幽默、练习或讽刺"},"examples":[{"en":"Her mimicry of the teacher’s voice made the whole class laugh.","zh":"她模仿老师的声音，把全班都逗笑了。"},{"en":"Actors study mimicry to copy accents and body language convincingly.","zh":"演员会学习模仿技巧，以便更逼真地复制口音和肢体语言。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) a way an animal or plant looks or behaves like something else to avoid danger or to catch prey","zh":"（生物）拟态；生物在外形或行为上像另一种东西，以躲避天敌或捕食"},"examples":[{"en":"Some harmless snakes survive through mimicry, resembling dangerous species.","zh":"一些无毒蛇通过拟态生存，它们看起来像有毒的危险物种。"},{"en":"The insect’s leaf-like wings are a form of mimicry that helps it hide.","zh":"这种昆虫像叶子一样的翅膀是一种拟态，能帮助它躲藏。"}]}],"synonyms":["imitation","impersonation","copying","parody","mimesis"],"phonetic":"/ˈmɪmɪkri/","extraExplanation":["“mimicry”来自“mimic”（模仿的人/模仿），常见搭配有：do mimicry（做模仿表演）、mimicry of someone’s voice（对某人声音的模仿）。在生物学里常与“camouflage（伪装/保护色）”一起出现：camouflage强调“融入环境”，mimicry强调“像另一种生物或物体”。"]}
{"word":"mimics","summary":{"en":"“Mimics” can mean people/things that imitate, or it can be the verb form “mimic” (he/she/it mimics).","zh":"“mimics”既可指“模仿者/模仿物”（名词复数），也可作动词“mimic”的第三人称单数（他/她/它在模仿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that imitate someone or something else, often copying behavior, speech, or style.","zh":"模仿者；模仿物（指模仿他人或他物的行为、说话方式或风格的人或事物）。"},"examples":[{"en":"On social media, celebrities often have many mimics who copy their style.","zh":"在社交媒体上，名人常常有很多模仿者，会照搬他们的风格。"},{"en":"The bird’s mimics in the forest can sound like other animals.","zh":"森林里那只鸟的“模仿声”能听起来像其他动物。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “mimic”: to imitate someone or something, usually to look or sound like them.","zh":"“mimic”的第三人称单数：模仿；学…的样子（通常指在外观或声音上像）。"},"examples":[{"en":"He mimics his teacher’s accent to practice pronunciation.","zh":"他模仿老师的口音来练习发音。"},{"en":"This app mimics the experience of writing on paper.","zh":"这个应用模拟在纸上书写的体验。"}]}],"synonyms":["imitators","copycats","imitates","copies"],"phonetic":"/ˈmɪmɪks/","extraExplanation":["“mimic”既可表示“模仿（动词）”，也可指“模仿者/仿制品（名词）”。有时“mimic”带一点“学人说话、学人做事”的意味，可能是中性（练习、模仿学习），也可能带轻微贬义（嘲弄式模仿），要看语境。","相关词：imitate（更常用、更中性“模仿”）；mock（更偏“嘲笑式模仿”）；impersonate（冒充某人，语气更严重/正式）。"]}
{"word":"mimidae","summary":{"en":"Mimidae is the bird family that includes mockingbirds and thrashers, known for varied songs and imitation.","zh":"Mimidae 指包含嘲鸫与拟鹟鸟（thrashers）在内的一科鸟类，以多变鸣唱和模仿能力著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family of North and Central American songbirds that includes mockingbirds and thrashers, known for varied songs and (in some species) vocal imitation.","zh":"拟鹟科（嘲鸫科）：一种分布于北美和中美洲的鸣禽科，包括嘲鸫与拟鹟鸟（如鶇鹛类/拟鹟类中的“thrashers”），以多变的鸣唱著称，部分种类还会模仿其他声音。"},"examples":[{"en":"The northern mockingbird belongs to the family Mimidae.","zh":"北美嘲鸫属于拟鹟科（Mimidae）。"},{"en":"Many Mimidae are famous for complex, repeated phrases in their songs.","zh":"许多拟鹟科鸟类的歌声以复杂、反复的乐句而闻名。"}]}],"synonyms":["mockingbird family"],"phonetic":"/ˈmɪməˌdiː/","extraExplanation":["“Mimidae”是拉丁化的生物学科名（family name），常用于学术写作；日常英语里更常说“mockingbirds and thrashers”（嘲鸫和拟鹟鸟/拟鹟鹛类）。","词源上与“mimic（模仿）”同源，呼应了嘲鸫等鸟类善于“模仿”其他鸟鸣或环境声音的特点。"]}
{"word":"miminae","summary":{"en":"“miminae” isn’t a recognized English word; it’s likely a name, typo, or a non-English form.","zh":"“miminae”不是常见英文词，更可能是名字、拼写错误或非英文词形。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “miminae” is most likely a typo, a username/proper name, or a form from another language (often seen in Latin-style endings).","zh":"不是标准英文单词。“miminae”更可能是拼写错误、用户名/专有名词，或来自其他语言的词形（常见于类似拉丁语的词尾变化）。"},"examples":[{"en":"I couldn’t find “miminae” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里找不到“miminae”——你能把看到它的句子发我吗？"},{"en":"“Miminae” might be a screen name rather than a vocabulary word.","zh":"“Miminae”可能是网名，而不是词汇单词。"}]}],"phonetic":"/ˌmɪmɪˈneɪ/","extraExplanation":["如果你是想查某个英文单词，可能是拼错了。常见的相近拼法包括：\n- **mimic**（模仿）\n- **mime**（哑剧演员；用动作表演）\n- **mimesis**（模仿/拟态，多用于文学艺术语境）\n把原句或上下文贴出来，我可以更准确判断你要找的是哪个词。"]}
{"word":"mimine","summary":{"en":"“Mime” is a silent performance or the act of expressing something without speaking, using gestures and facial expressions.","zh":"“mime”指哑剧（无台词表演）或用动作表情不说话地表达意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a performer who tells a story or expresses ideas using gestures, facial expressions, and body movement, usually without speaking","zh":"（通常不说话、用动作和表情讲故事的）哑剧演员"},"examples":[{"en":"We watched a mime perform in the park.","zh":"我们在公园看了一位哑剧演员表演。"},{"en":"The mime pretended to be trapped inside an invisible box.","zh":"那位哑剧演员假装被困在一个看不见的盒子里。"}]},{"partOfSpeech":"v.","definition":{"en":"to act something out without words, using only movement and expression","zh":"用动作和表情（不说话）表演；做哑剧"},"examples":[{"en":"She mimed opening an umbrella to show what she meant.","zh":"她用动作比划着打开雨伞，来说明她的意思。"},{"en":"He mimed a phone call to ask me to call him back.","zh":"他用动作比划打电话，示意我给他回电。"}]}],"synonyms":["pantomime","act out","gesture"],"phonetic":"/maɪm/","extraExplanation":["“mimine”在英语里不是常见单词，很多时候可能是拼写错误。你可能想查的是：\n- “mime”（哑剧；做哑剧）\n- “mimic”（模仿，常指模仿声音/口音/行为，可能带一点戏仿意味）\n如果你告诉我你看到“mimine”的句子或上下文，我也可以帮你判断最可能是哪一个词。"]}
{"word":"miming","summary":{"en":"“Miming” means imitating someone or acting something out with gestures, often without speaking.","zh":"“miming”指模仿他人，或用手势动作（常不说话）把事情演出来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of copying someone’s actions, expressions, or voice (often for humor, acting, or practice)","zh":"模仿（他人的动作、表情或声音；常用于表演、搞笑或练习）"},"examples":[{"en":"His miming of the teacher’s voice made the whole class laugh.","zh":"他模仿老师的声音，把全班都逗笑了。"},{"en":"She learned the dance step by watching and miming the instructor.","zh":"她通过观察并模仿教练来学会那个舞步。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “mime”: copying actions or gestures without speaking, or imitating someone","zh":"“mime”的现在分词：用无声的动作表演；或模仿他人"},"examples":[{"en":"He was miming opening a heavy door to show how hard it was.","zh":"他用动作表演“打开一扇很重的门”，来说明有多难。"},{"en":"The actor kept miming the singer’s moves behind the scenes.","zh":"那位演员在后台一直模仿歌手的动作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) relating to a mime or miming","zh":"（较少见）与哑剧表演或模仿有关的"},"examples":[{"en":"The show included a short miming routine between songs.","zh":"演出在歌曲之间穿插了一段短的哑剧表演。"}]}],"synonyms":["imitating","copying","mimicry","pantomime"],"phonetic":"/ˈmaɪmɪŋ/","extraExplanation":["“miming”常见于表演语境：mime（哑剧演员）用肢体和表情讲故事，通常不说话。与“mocking（嘲弄）”不同，miming不一定带恶意；是否冒犯取决于语气、场合和对象。","相关词：mime（n. 哑剧演员；v. 模仿/无声表演）、mimic（v. 模仿；n. 模仿者，常更强调“像”或“学得很像”）、pantomime（n. 哑剧/舞台哑剧，英式语境也可指圣诞家庭喜剧“panto”。）"]}
{"word":"miminypiminy","summary":{"en":"“miminypiminy” is not a standard English word; it’s likely a made-up, playful sound with no fixed meaning.","zh":"“miminypiminy”不是标准英语词汇；多半是随口编造的顺口音，没有固定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or invented word with no widely accepted meaning in English; it may be used playfully for sound, rhythm, or as a personal nickname/inside joke.","zh":"英语中并非规范或常见词汇；通常是人为编造的拟声/顺口词，可能用于玩笑、押韵、节奏感，或作为昵称、暗号等。"},"examples":[{"en":"He wrote “miminypiminy” in his notebook just because it sounded funny.","zh":"他在笔记本里写了“miminypiminy”，只是觉得读起来好玩。"},{"en":"“Miminypiminy” doesn’t have a dictionary meaning, but you can use it as a silly placeholder word.","zh":"“miminypiminy”没有词典里的固定含义，但你可以把它当作一个搞笑的占位词。"}]}],"synonyms":["gibberish","nonsense word","made-up word","placeholder word"],"phonetic":"ˌmɪmɪniˈpɪmɪni","extraExplanation":["这是典型的“编造词 / 无意义词”（nonce word），英语里常见于儿童语言、歌词、绕口令、游戏ID或朋友间的暗号。","如果你是在某个视频/歌曲/故事里看到它，它可能只是在模仿某种节奏或口音；提供出处（哪一段台词/哪首歌）会更容易判断是否有特定含义。"]}
{"word":"mimir","summary":{"en":"Mimir is a figure from Norse mythology known for great wisdom, linked to the Well of Mímir that Odin visits to gain knowledge.","zh":"Mimir（弥米尔）是北欧神话中的智慧人物，与“弥米尔之井”相关，奥丁为求智慧而向其寻求帮助。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) A wise being (often called a giant) associated with profound knowledge and the Well of Mímir; the god Odin seeks his counsel and drinks from his well to gain wisdom.","zh":"（北欧神话）弥米尔：与深邃智慧相关的智者（常被称为巨人），守护“弥米尔之井”；奥丁为求智慧向他请教，并从井中饮水以获得知识。"},"examples":[{"en":"In Norse myths, Odin sacrifices an eye for a drink from Mimir’s well to gain wisdom.","zh":"在北欧神话里，奥丁为从弥米尔之井饮水以获得智慧而献出一只眼睛。"},{"en":"The story of Mimir often appears in retellings of Viking legends and modern fantasy.","zh":"弥米尔的故事常见于维京传说的改写版本与现代奇幻作品中。"}]}],"synonyms":["(no direct synonyms; related: Norse mythology, the Well of Mímir, Odin)"],"phonetic":"/ˈmiːmɪr/","extraExplanation":["“Mímir”中的“í”常见于古诺尔斯语转写；英文里多写作 Mimir 或 Mímir。","弥米尔与“智慧/记忆”意象联系紧密：他守护的井（Well of Mímir）象征知识的代价与获取。","在流行文化中（如部分漫画、游戏或影视改编），Mimir 的形象可能被重新演绎，但核心设定通常仍与“智慧顾问/知识之源”相关。"]}
{"word":"mimish","summary":{"en":"“Mimish” is an informal, rare word meaning “somewhat mime-like or imitative.”","zh":"“mimish”是非正式且少见的说法，意思是“有点像哑剧或模仿的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, rare) Somewhat like a mime or like mimicking; imitative in an obvious or playful way.","zh":"（非正式，少见）有点像哑剧表演或模仿的；带有明显或玩笑式模仿意味的。"},"examples":[{"en":"His “robot walk” was mimish, but it made everyone laugh.","zh":"他那种“机器人走路”的动作很有模仿感，但把大家都逗笑了。"},{"en":"The skit turned mimish when the actors started copying the teacher’s voice.","zh":"当演员开始模仿老师的声音时，小品变得很“模仿秀”。"}]}],"synonyms":["mime-like","imitative","mimicking","copycat-like"],"phonetic":"/ˈmɪmɪʃ/","extraExplanation":["“mimish”不是常见标准英语词，更常见的表达有：mimic (v./n. 模仿)、mime (n./v. 哑剧/用动作表达)、mimicry (n. 模仿行为)、mime-like（像哑剧的）、imitative（爱模仿的）。\n如果你是在聊天或写作里看到“mimish”，它多半是把“mime/mimic + -ish（有点……的）”拼出来的自造词，用来表达“有点像在做夸张模仿/哑剧”。","如果你想查的是别的词（例如 mimesis /mɪˈmiːsɪs/，文学与艺术中的“摹仿/再现”），把原句发我，我可以按语境帮你确定。"]}
{"word":"mimly","summary":{"en":"Mimic means to copy or closely imitate someone/something, sometimes for humor, or to simulate in a realistic way.","zh":"mimic 指模仿或高度仿真某人/某物；可带幽默嘲讽，也可中性地表示“模拟/拟态”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to copy someone’s actions, speech, or style, often in a humorous or mocking way","zh":"（常带幽默或嘲讽地）模仿某人的动作、说话方式或风格"},"examples":[{"en":"He can mimic his teacher’s voice perfectly.","zh":"他能把老师的声音模仿得惟妙惟肖。"},{"en":"The comedian mimicked the president during the show.","zh":"那位喜剧演员在演出中模仿了总统。"}]},{"partOfSpeech":"vt.","definition":{"en":"to closely imitate or resemble something in appearance or behavior","zh":"（外观或行为上）与……非常相似；仿效；模拟"},"examples":[{"en":"The app is designed to mimic real conversations.","zh":"这个应用的设计是为了模拟真实对话。"},{"en":"Some insects mimic leaves to avoid being seen.","zh":"有些昆虫会拟态成叶子来避免被发现。"}]},{"partOfSpeech":"v.","definition":{"en":"to imitate someone or something (general use)","zh":"模仿（泛指）"},"examples":[{"en":"Children often mimic what adults do.","zh":"孩子经常模仿大人做的事。"}]}],"synonyms":["imitate","copy","parody","simulate","echo"],"phonetic":"/ˈmɪmɪk/","extraExplanation":["“mimic”既可指表演式的“模仿”（可能带一点取笑），也常用于更中性的“模拟/仿真”（如科技、设计）或生物学里的“拟态”（动物或昆虫为了生存而像环境或其他生物）。语境不同，语气差别很大。","词形提示：mimic（动词/形容词）→ mimicry（名词：模仿；拟态）。"]}
{"word":"mimmation","summary":{"en":"Imitation means copying someone or something, or a copy made to look like the original.","zh":"Imitation 指模仿（行为/表演），也指仿制品（看起来像原物的复制品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of copying someone or something; a copy or something made to look like the original","zh":"模仿；仿制；仿制品（看起来像原物的复制品）"},"examples":[{"en":"Children learn a lot through imitation of adults.","zh":"孩子会通过模仿大人学到很多东西。"},{"en":"The restaurant serves imitation crab, not real crab meat.","zh":"这家餐厅用的是仿蟹肉，不是真蟹肉。"}]},{"partOfSpeech":"n.","definition":{"en":"a performance or behavior that copies someone (often to entertain or joke)","zh":"（常为逗乐或开玩笑的）模仿表演；模仿行为"},"examples":[{"en":"He did a funny imitation of his teacher’s voice.","zh":"他搞笑地模仿了老师的声音。"}]}],"synonyms":["copying","mimicry","replica","fake","counterfeit"],"phonetic":"/ˌɪməˈteɪʃən/","extraExplanation":["“mimmation”不是常见的英语单词，很可能是把 **imitation**（模仿/仿制）拼错了。正确拼法是 *imitation*（中间是 *-mit-*，不是 *-mm-*）。","常见相关词：**imitate** (v. 模仿)、**mimic** (v./n. 模仿，尤指模仿动作或说话方式)、**mimicry** (n. 模仿；也可指生物的拟态)。","用法提示：**imitation** 常用于“仿制品/假货”（imitation leather 人造革），也可用于“模仿行为/表演”。"]}
{"word":"mimmed","summary":{"en":"“Mimmed” is usually a misspelling of “mimed” (past of “mime”: to act out or imitate with gestures, often without words).","zh":"“mimmed”通常是“mimed”的误拼写；“mimed”是“mime”的过去式，指用手势表演或模仿，常常不说话。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A common misspelling of “mimed,” the past tense of “mime” (to act out or copy something using gestures, often without speaking).","zh":"（非标准拼写）常见的误拼写，正确通常是“mimed”，即“mime”的过去式（用手势表演或模仿，常常不说话）。"},"examples":[{"en":"He mimed opening a heavy door to show what happened.","zh":"他用手势表演“推开一扇很重的门”，来说明发生了什么。"},{"en":"The actor mimed brushing his teeth without any props.","zh":"那位演员没有任何道具，只用动作表演“刷牙”。"}]}],"synonyms":["acted out","gestured","imitated","mimicked"],"phonetic":"/maɪm/","extraExplanation":["“mimmed”在标准英语里不常见；多数情况下你想写的是“mimed”（/maɪm/）。","“mime”既可以表示“哑剧演员/哑剧表演”（名词），也可以表示“用动作模仿、用手势表演”（动词）。动词过去式和过去分词一般写作“mimed”。","如果你的意思是“模仿某人的说话方式/口音/语气”，更常用的动词是“mimicked”（例如：He mimicked her accent. 他模仿她的口音）。"]}
{"word":"mimmest","summary":{"en":"“Mimmest” isn’t standard modern English; it likely means the archaic “(thou) mimest” = “you mime/imitate.”","zh":"“mimmest” 不是现代标准英语；多半指古体 “(thou) mimest”，意思是“你用动作表演/模仿”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/rare form (likely a misspelling) of “mimest,” an archaic second-person singular form of “mime,” meaning “you mime/imitate (someone or something).”","zh":"非标准/罕见形式（很可能是拼写错误），通常指 “mimest”（古体第二人称单数）——动词 “mime”的形式，意思是“你用哑剧模仿/模拟（某人或某事）”。"},"examples":[{"en":"In older-style writing you might see: “Thou mimest my voice,” meaning “You imitate my voice.”","zh":"在较古旧的文体里可能会看到：“Thou mimest my voice,” 意思是“你在模仿我的声音。”"},{"en":"If you meant modern English, you can say: “You mime the actions without speaking.”","zh":"如果用现代英语，可以说：“You mime the actions without speaking.”（你不说话，只用动作表演/模仿。）"}]}],"synonyms":["mime","mimic","imitate","parody","copy"],"phonetic":"/maɪm/","extraExplanation":["“-est” 是早期英语里表示第二人称单数（thou）的动词词尾：thou walkest / thou sayest。现代英语基本不用这种变化，通常改为 “you walk / you say”。","“mime” 更常见的用法是表示“用哑剧表演、用动作模仿”，而 “mimic” 更偏向“模仿声音/行为（不一定是哑剧）”。如果你想表达“学某人的样子/学腔”，多用 mimic/imitate。"]}
{"word":"mimming","summary":{"en":"“Miming” means communicating or acting without speaking, using gestures and facial expressions.","zh":"“miming”指不说话、用手势和表情等肢体动作来表达或表演（哑剧）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of using gestures, facial expressions, and body movement to communicate without speaking; silent acting","zh":"哑剧表演；用手势、表情和肢体动作在不说话的情况下表达意思"},"examples":[{"en":"The actor told the story through miming instead of dialogue.","zh":"这位演员用哑剧表演而不是台词来讲故事。"},{"en":"In class, we practiced miming everyday actions like brushing teeth.","zh":"在课堂上，我们练习用肢体动作表演刷牙等日常动作。"}]},{"partOfSpeech":"v.","definition":{"en":"to act out something without words, using only movement and expression","zh":"用哑剧方式表演；用动作和表情无声地模仿/表达"},"examples":[{"en":"She mimed opening an umbrella to show it was raining.","zh":"她用动作表演打开雨伞，表示正在下雨。"},{"en":"He mimed a phone call to ask me to call him later.","zh":"他用动作比划打电话，意思是让我晚点打给他。"}]}],"synonyms":["mime","pantomime","act out","gesture"],"phonetic":"/ˈmaɪmɪŋ/","extraExplanation":["“mimming”通常是拼写错误，更常见的正确拼写是 **miming**（美式英语更常用）或 **miming/mime**（英式也常见）。名词常用 **mime**（哑剧演员/哑剧表演）或 **miming**（哑剧式表演这一行为）。","相关词：**mime**（n. 哑剧演员；v. 用哑剧表演）、**pantomime**（n. 哑剧；也可指夸张的舞台表演）。"]}
{"word":"mimmock","summary":{"en":"“Mimmock” is not a standard English word; it’s usually a misspelling of “mimic” or “mock.”","zh":"“mimmock”不是标准英语词，通常是“mimic”或“mock”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form, most often intended to mean “mimic” (to copy someone’s actions, voice, or style, sometimes humorously) or “mock” (to make fun of).","zh":"非标准或拼写错误的形式，最常见是想表达“mimic（模仿）”或“mock（嘲弄/取笑）”。"},"examples":[{"en":"I think you meant “mimic,” not “mimmock.”","zh":"我想你要写的是“mimic”，不是“mimmock”。"},{"en":"He can mimic the teacher’s voice really well.","zh":"他很会模仿老师的声音。"},{"en":"Please don’t mock her accent.","zh":"请不要嘲笑她的口音。"}]}],"synonyms":["mimic","imitate","copy","mock","tease","parody"],"phonetic":"/ˈmɪmɪk/","extraExplanation":["“mimmock”在现代英语里不是常见词，通常出现在打字错误、非母语拼写、或口语化/戏仿式写法中。","如果你想表达“模仿”，标准拼写是 mimic；如果想表达“取笑/嘲弄”，常用 mock。也有人把两者混在一起写成类似“mimmock”的形式，但不建议在正式写作中使用。","如果你是在某本书/游戏/名字里看到 mimmock，它也可能是专有名词（人名、网名、角色名）。你可以把原句发我，我能根据上下文判断更准确的意思。"]}
{"word":"mimmocking","summary":{"en":"“Mimicking” means copying someone’s voice, actions, or style.","zh":"“Mimicking”表示模仿某人的声音、动作或风格。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “mimic”: copying someone’s voice, actions, or style (often to entertain, practice, or sometimes tease).","zh":"“mimic”的现在分词：模仿某人的声音、动作或风格（常用于娱乐、练习，也可能带一点取笑）。"},"examples":[{"en":"She was mimicking her teacher’s accent for fun.","zh":"她在模仿老师的口音取乐。"},{"en":"The child kept mimicking his older brother’s gestures.","zh":"那个孩子一直在模仿哥哥的手势。"},{"en":"Try mimicking the speaker to improve your pronunciation.","zh":"试着跟读模仿讲话者来提高发音。"}]}],"synonyms":["imitating","copying","aping","parroting"],"phonetic":"/ˈmɪmɪkɪŋ/","extraExplanation":["你写的“mimmocking”不是常见的英语拼写。最可能是想写：\n1) mimicking（模仿）；\n2) mocking（嘲笑/取笑）；\n3) mimic + mock 的混写。\n如果你告诉我你要表达的中文意思（“模仿”还是“嘲笑”），我可以给你更准确的词和用法对比。","mimic（模仿）不一定是负面的；mock（嘲笑）通常带负面、让人难堪的语气。比如：He mimicked my accent.（可能只是模仿） vs. He mocked my accent.（明显在嘲笑）。"]}
{"word":"mimmocky","summary":{"en":"“mimmocky” is not a standard English word; it likely refers to “mimicky” or “mimicry.”","zh":"“mimmocky” 不是标准英语词；很可能是 “mimicky” 或 “mimicry” 的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/unknown spelling; it is not a common English word in dictionaries. It is most likely a misspelling of “mimicky” (mimic-like) or “mimicry” (the act of copying).","zh":"非标准/不常见的拼写；通常不被词典收录。很可能是 “mimicky”（像在模仿的）或 “mimicry”（模仿；拟态）的拼写错误。"},"examples":[{"en":"I couldn’t find “mimmocky” in a dictionary—did you mean “mimicky” or “mimicry”?","zh":"我在词典里找不到 “mimmocky”——你是不是想写 “mimicky” 或 “mimicry”？"},{"en":"Her tone sounded mimicky, like she was copying the teacher.","zh":"她的语气听起来像在模仿，好像在学老师说话。"},{"en":"In nature, mimicry helps some animals avoid predators.","zh":"在自然界里，拟态（mimicry）能帮助一些动物躲避捕食者。"}]}],"synonyms":["imitative","copycat","parroting","mimicry"],"phonetic":"ˈmɪmɪki","extraExplanation":["“mimmocky” 不是常见单词，比较可能的目标词：\n1) mimicky（adj.）：像在模仿的、模仿式的（常带一点负面含义，如“学人说话、装腔作势”）。\n2) mimicry（n.）：模仿；（生物）拟态。\n如果你能提供原句或上下文（例如一整句话/来自哪里），我可以更准确判断你想表达的词。"]}
{"word":"mimmood","summary":{"en":"“mimmood” is not a standard English word; it’s likely a typo or a name. You may mean “mood.”","zh":"“mimmood”不是标准英语词，可能是拼写错误或专有名称；你可能想写“mood（情绪/氛围）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or uncommon spelling that is not recognized as a standard English word. It is most likely a typo or a username/brand name. Many people who type “mimmood” may be trying to write “mood” or “meme mood.”","zh":"一种非标准或不常见的拼写，通常不被当作标准英语单词。它很可能是拼写错误，或是用户名/品牌名。很多人输入“mimmood”可能是想写“mood（情绪/氛围）”或“meme mood（梗图氛围/心情）”。"},"examples":[{"en":"I can’t find “mimmood” in a dictionary—did you mean “mood”?","zh":"我在词典里找不到“mimmood”——你是不是想写“mood”？"},{"en":"That might be a username, not a real English word.","zh":"那可能是用户名，而不是真正的英语单词。"}]}],"phonetic":"/ˈmɪmˌmud/","extraExplanation":["“mimmood”看起来像把“mim-”（可能来自 mimic 模仿 / meme 梗图）和“mood”（情绪/氛围）拼在一起，但英语里并没有固定用法。","如果你告诉我它出现的句子/平台（比如聊天、游戏、短视频标题），我可以更准确判断它是拼写错误、网络用语，还是专有名词。","你可能想找的常用词：mood（情绪；氛围）；in the mood（有心情/想要）；mood swing（情绪波动）；meme（梗图/网络梗）。"]}
{"word":"mimmoud","summary":{"en":"“mimmoud” isn’t a recognized English word; it’s likely a misspelling or a name.","zh":"“mimmoud”不是常见英语词；更可能是拼写错误或人名/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling or a proper name (e.g., a person’s name, a username, or a place name).","zh":"不是标准英语单词；可能是拼写错误，或是专有名词（例如人名、用户名或地名）。"},"examples":[{"en":"I couldn’t find “mimmoud” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里查不到“mimmoud”——你能把你看到它的句子发我吗？"},{"en":"It might be a name, so the meaning depends on who or what it refers to.","zh":"它也可能是名字，所以含义取决于它指的是谁或什么。"}]}],"phonetic":"/mɪˈmuːd/","extraExplanation":["“mimmoud”看起来像拼写误差。你可以检查是否想写：\n1) mammoth（巨大的；猛犸象）\n2) Mahmoud/Mahmūd（常见阿拉伯人名，英文常写作 Mahmoud）\n3) mime / mimic 相关词（如 mimic：模仿）\n\n把原句贴出来（或告诉我它来自哪里：聊天、游戏ID、歌曲、作业等），我就能更准确判断并给出词义与用法。"]}
{"word":"mimmouthed","summary":{"en":"Mum-mouthed means speaking unclearly or not expressing something openly.","zh":"Mum-mouthed 指说话含糊不清，或不把话说开、表达不明确。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Speaking in a quiet, unclear, or muffled way; not speaking openly or clearly.","zh":"说话含糊不清、声音闷闷的；也可指不把话说开、不直说。"},"examples":[{"en":"He gave a mum-mouthed apology that nobody could really understand.","zh":"他含含糊糊地道了个歉，大家都没太听懂。"},{"en":"Stop being mum-mouthed and tell us what happened.","zh":"别再吞吞吐吐了，把发生的事说清楚。"}]}],"synonyms":["muffled","inaudible","inarticulate","mumbling","tongue-tied"],"phonetic":"/ˈmʌmˌmaʊðd/","extraExplanation":["你输入的“mimmouthed”很可能是拼写误差。英语里更常见的是 **mum-mouthed**（也常写作 **mummouthed**），意思是“口齿不清/说话不清楚”或“说话不坦率”。","词源上，**mum** 有“发出‘嗯/呣’的声音、沉默或含糊其辞”的感觉，和“嘴里含着话说不清”这一形象有关。"]}
{"word":"mimmouthedness","summary":{"en":"Mimmouthedness means affected primness or overly proper, tight-lipped behavior (an archaic/rare word).","zh":"mimmouthedness 指做作的端庄、过度拘谨或“嘴紧”的假正经（古旧且少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) An affectedly modest, prim, or overly proper manner—often shown in someone’s facial expression or the way they speak (as if keeping the mouth tightly controlled).","zh":"（古/较少用）假装端庄、过分拘谨或过度“正经”的样子——常体现在表情或说话方式上（仿佛把嘴巴刻意收得很紧）。"},"examples":[{"en":"Her apology sounded sincere, but there was a hint of mimmouthedness in her careful wording.","zh":"她的道歉听起来真诚，但措辞过于小心，透着一点假端庄的味道。"},{"en":"The character’s mimmouthedness made him seem judgmental rather than kind.","zh":"这个角色那种拘谨做作的“正经劲儿”让他显得更爱评判而不够友善。"}]}],"synonyms":["primness","prudishness","demureness","affected modesty","stuffiness"],"phonetic":"ˈmɪmˌmaʊðd.nəs","extraExplanation":["这个词非常少见，常见形式是 **mim-mouthed**（形容词）和 **mim-mouthedness**（名词）。有时也会看到不带连字符的拼写（如你输入的 *mimmouthedness*）。","**mim-mouthed** 大致相当于 *prim / demure in an affected way*（做作的端庄、假装矜持）。它常带轻微的讽刺意味，用来批评一种“装正经”“过分拿捏”的姿态。"]}
{"word":"mimodrama","summary":{"en":"Mimodrama is a story-driven stage performance told mainly through mime and gestures, with little or no speech.","zh":"mimodrama 指主要通过哑剧动作与肢体语言叙事、几乎不说话的戏剧表演。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theatrical performance that tells a story mainly through mime (silent acting and gestures), sometimes with music and minimal spoken words.","zh":"一种以哑剧动作为主来讲故事的戏剧表演，通常不说话或台词很少，可能配合音乐。"},"examples":[{"en":"The festival included a short mimodrama about a lost traveler, performed entirely in silence.","zh":"艺术节上演了一段关于迷路旅人的短篇哑剧戏剧，全程无台词。"},{"en":"In mimodrama, the actor’s gestures must be clear enough for the audience to follow the plot.","zh":"在哑剧戏剧中，演员的动作必须足够清晰，观众才能看懂剧情。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A scripted stage piece written specifically to be performed as mime.","zh":"（较少见）专为哑剧表演而写的有剧本的舞台作品。"},"examples":[{"en":"She studied an old mimodrama manuscript and adapted it for modern audiences.","zh":"她研究了一份古老的哑剧戏剧手稿，并改编给现代观众观看。"}]}],"synonyms":["mime drama","pantomime","mime","silent theater"],"phonetic":"/ˌmiːmoʊˈdrɑːmə/","extraExplanation":["“mimodrama”由表示“哑剧演员/模仿者”的词根（mimo-，可追溯到希腊语 mimos）和“戏剧”drama 组合而来。英语里更常见的说法是 “mime drama” 或 “pantomime”。","在欧洲戏剧史中，这类以动作叙事的舞台形式常与音乐、舞台效果结合，用来强化故事的可视性；现代语境里也可能指偏艺术化的“肢体剧场/哑剧剧场”作品。"]}
{"word":"mimographer","summary":{"en":"A mimographer is someone who makes copies using a mimeograph machine (an older duplicating method).","zh":"mimographer 指使用油印机（誊写版）进行复印的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who operates a mimeograph machine or makes copies using mimeograph stencils (an older method of duplicating documents).","zh":"使用油印机（誊写版）来复印文件的人；油印操作员。"},"examples":[{"en":"Before photocopiers were common, our school had a mimographer who duplicated tests for every class.","zh":"在复印机普及之前，我们学校有一位油印员为每个班油印试卷。"},{"en":"The mimographer prepared the stencil and ran off fifty copies for the meeting.","zh":"油印员先刻好蜡纸（誊写版），然后为会议印了五十份。"}]}],"synonyms":["mimeograph operator","duplicator","copyist"],"phonetic":"/ˈmɪməˌɡræfər/","extraExplanation":["“mimographer”来自“mimeograph”（油印机/誊写版复印法）。这种技术在20世纪很常见：先在蜡纸（stencil）上刻写，再把油墨压印到纸上，常见于学校讲义、教会公告、社团传单等。如今多已被复印机和打印机取代，所以这个词带有一点“旧时代办公设备”的感觉。"]}
{"word":"mimography","summary":{"en":"Mimography is a rare word meaning mimeography—copying documents using a stencil duplicator; very rarely, it can also mean imitation in writing or style.","zh":"mimography是个少见词，通常指mimeography（用誊写版/油印方式复制文件）；极少情况下也可指写作或风格上的模仿式描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The process or method of making copies using a stencil duplicator (a “mimeograph”); mimeography.","zh":"（少见）用誊写版/蜡纸刻写后通过油墨印刷来复制文件的方法；即“mimeography（誊写版印刷/油印）”。"},"examples":[{"en":"Before photocopiers were common, schools used mimography to produce quizzes and handouts.","zh":"在复印机普及之前，学校常用mimography（油印/誊写版印刷）来印测验和讲义。"},{"en":"The office stored the stencils and ink needed for mimography in a locked cabinet.","zh":"办公室把做mimography所需的蜡纸版和油墨锁在柜子里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) Writing or description that imitates something closely; imitation in style or expression.","zh":"（非常少见）对事物的逼真模仿式描写；在风格或表达上的模仿。"},"examples":[{"en":"His parody relied on careful mimography of the author’s formal tone.","zh":"他的讽仿靠的是对那位作者正式语气的细致mimography（模仿式再现）。"},{"en":"The play’s humor comes from mimography of everyday conversation.","zh":"这出戏的幽默来自对日常对话的模仿式呈现。"}]}],"synonyms":["mimeography","mimeographing","stencil duplication","duplication","imitation","mimicry"],"phonetic":"/ˌmaɪmiˈɑːɡrəfi/","extraExplanation":["这个词在现代英语里非常罕见；多数情况下人们用更常见的拼写“mimeography”。它与“mimeograph”（油印机/誊写版印刷机）同源，曾在学校、办公室用于批量复制讲义、表格等。","词根可理解为“模仿（mime-）+ 书写/记录（-graphy）”。因此它既可指“用誊写版复制”，也可能被少数作者用来指“模仿式描写/仿写”，但后者更少见。"]}
{"word":"mimologist","summary":{"en":"A mimologist is someone who specializes in mime or in imitating others, often in performance.","zh":"mimologist 指专攻默剧或擅长模仿他人的人，常见于表演相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, performs, or specializes in mime (acting through gesture and facial expression without words).","zh":"默剧演员；研究或专攻默剧（用肢体动作与表情而非语言表演）的人。"},"examples":[{"en":"The mimologist trained for years to tell stories using only movement and silence.","zh":"这位默剧演员训练多年，只靠动作与沉默来讲故事。"},{"en":"In the workshop, a mimologist taught students how to express emotions with their faces.","zh":"在工作坊里，一位默剧专家教学生如何用表情表达情绪。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who closely imitates others’ speech, behavior, or style (often as a performer).","zh":"善于模仿他人言谈、举止或风格的人（常指表演者）。"},"examples":[{"en":"He’s a talented mimologist who can copy a celebrity’s voice almost perfectly.","zh":"他是个很有天赋的模仿者，几乎能完美复制名人的声音。"},{"en":"The comedian worked as a mimologist, switching accents to match different characters.","zh":"这位喜剧演员靠模仿为生，通过切换口音来贴合不同角色。"}]}],"synonyms":["mime artist","mime","impressionist","impersonator","imitator"],"phonetic":"/maɪˈmɑlədʒɪst/","extraExplanation":["词源小提示：mimologist 由 mime（默剧/模仿）+ -logist（“……学者/专门研究者”）构成，常用于较正式或艺术/学术语境中。日常英语里更常说 mime artist（默剧演员）或 impressionist/impersonator（模仿者）。"]}
{"word":"mimosa","summary":{"en":"Mimosa most commonly means a brunch cocktail of sparkling wine and orange juice, and it can also mean a plant with fluffy flowers (sometimes one that folds its leaves when touched).","zh":"mimosa最常指用起泡酒和橙汁调制的早午餐鸡尾酒；也可指开绒球花的植物（有些被触碰会合拢叶片）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cocktail made with champagne (or other sparkling wine) and orange juice, often served at brunch.","zh":"一种鸡尾酒，通常由香槟（或其他起泡酒）与橙汁调制，常在早午餐时饮用。"},"examples":[{"en":"We ordered mimosas for brunch.","zh":"我们早午餐点了含羞草鸡尾酒（mimosa）。"},{"en":"A classic mimosa is sparkling wine mixed with orange juice.","zh":"经典的mimosa是把起泡酒和橙汁混合。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of plant with delicate leaves and fluffy, ball-shaped flowers; some kinds fold their leaves when touched.","zh":"一种叶片细小、花朵呈绒球状的植物；有些品种被触碰时会合拢叶片。"},"examples":[{"en":"The mimosa tree produces bright, fluffy flowers in summer.","zh":"合欢（mimosa）在夏天会开出明亮、绒球状的花。"},{"en":"In science class, we watched a mimosa plant fold its leaves when touched.","zh":"在科学课上，我们观察到含羞草（mimosa）被碰到时会合拢叶子。"}]}],"synonyms":["champagne cocktail","sparkling wine cocktail"],"phonetic":"/mɪˈmoʊzə/","extraExplanation":["“mimosa”这个词在英语里常有两种高频含义：一种是“早午餐鸡尾酒”，另一种是“植物名”。不同地区对植物的对应中文名可能不同：常见包括“合欢”（常指树，粉色绒球花）以及“含羞草”（指会闭合叶片的那种）。看到语境里有brunch、champagne、orange juice，多半就是鸡尾酒；看到tree、plant、leaves、flowers，多半就是植物。","鸡尾酒“mimosa”名称据说与一种黄色小花（也常被叫作mimosa）颜色相似有关，因此得名；它在西方文化里常与周末早午餐、轻松社交场景联系在一起。"]}
{"word":"mimosaceae","summary":{"en":"Mimosaceae is an older botanical family name for plants like mimosa and acacia, now usually treated as part of the legume family.","zh":"Mimosaceae 是植物学上的旧科名，指含羞草、金合欢等类群；现代多并入豆科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former plant family name (now usually treated as a subfamily within the legume family) that includes mimosa, acacia, and related trees and shrubs, often with small clustered flowers and sometimes thorns","zh":"豆科的一个旧分类名称（现多视为豆科含羞草亚科/相关类群），包括含羞草、金合欢等近缘的乔木或灌木，常见小而成簇的花，有些种类带刺"},"examples":[{"en":"Acacia was traditionally placed in the family Mimosaceae.","zh":"金合欢传统上被归入含羞草科（Mimosaceae）。"},{"en":"Many Mimosaceae plants have fluffy, ball-shaped flowers.","zh":"许多含羞草科（Mimosaceae）植物的花看起来像蓬松的球状花序。"}]}],"synonyms":["Mimosoideae","legume family (Fabaceae) (broader term)"],"phonetic":"/ˌmɪmoʊˈseɪsiˌiː/","extraExplanation":["“Mimosaceae（含羞草科）”在较新的分类系统中常被并入豆科（Fabaceae），通常对应“含羞草亚科（Mimosoideae）”。因此你在新旧教材、百科或植物志里可能会看到不同叫法。","词源来自属名 Mimosa（含羞草属）。在日常英语里，这个词多出现在植物学、园艺或科普文章中，而不是一般对话。"]}
{"word":"mimosaceous","summary":{"en":"A botanical adjective meaning “of or like mimosa-type plants.”","zh":"植物学形容词，表示“与含羞草类植物有关或相似”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or resembling plants of the mimosa group (especially the mimosa subfamily of the legume family), often having fern-like leaves and puffball-like flower heads.","zh":"与含羞草类（尤其指豆科含羞草亚科）植物有关的；或外形类似含羞草类植物的（常见特征包括羽状、蕨状叶与绒球状花序）。"},"examples":[{"en":"Some mimosaceous trees have delicate, feathery leaves that fold in strong wind.","zh":"一些含羞草类树木有细致的羽状叶，在强风中会合拢。"},{"en":"The park planted several mimosaceous species to attract bees with their fluffy blossoms.","zh":"公园种了几种含羞草类植物，用它们蓬松的花朵来吸引蜜蜂。"}]}],"synonyms":["mimosa-like","mimosa-related","mimosoid"],"phonetic":"/ˌmɪməˈseɪʃəs/","extraExplanation":["“mimosaceous”是植物学用语，常用于描述“与含羞草类（mimosa group）有关/相似”的植物特征。现代分类里，含羞草类多被归入豆科（Fabaceae）的含羞草亚科（Mimosoideae），因此该词多出现在科普、植物志或园艺文章中，而不太常用于日常口语。","常见相关植物包括：mimosa（含羞草/合欢类的俗称之一）、acacia（相思树/金合欢）、albizia（合欢属）。不同地区的中文俗名可能有差异，阅读时可结合拉丁学名更准确。"]}
{"word":"mimosas","summary":{"en":"“Mimosas” usually means the brunch cocktail (sparkling wine + orange juice), and it can also mean the plural of the plant “mimosa.”","zh":"“mimosas”通常指早午餐常喝的含羞草鸡尾酒（起泡酒+橙汁），也可指植物“mimosa”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cocktail made with sparkling wine (often champagne or prosecco) mixed with citrus juice, usually orange juice.","zh":"一种鸡尾酒，用起泡葡萄酒（常见为香槟或普罗塞克）加柑橘汁（通常是橙汁）调制而成。"},"examples":[{"en":"We had mimosas at brunch on Sunday.","zh":"我们周日早午餐时喝了含羞草鸡尾酒。"},{"en":"She ordered a mimosa with extra orange juice.","zh":"她点了一杯橙汁多一点的含羞草鸡尾酒。"},{"en":"Many cafés offer mimosas as a weekend special.","zh":"很多咖啡馆周末会推出含羞草鸡尾酒特供。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “mimosa,” a plant name; often refers to a small tree/shrub with soft, feathery leaves and fluffy flowers (in the U.S., commonly the silk tree).","zh":"“mimosa”的复数；一种植物名，常指叶子细软如羽、花朵绒球状的小乔木/灌木（在美国常见指合欢/丝绸树）。"},"examples":[{"en":"Mimosas bloom in late spring and early summer.","zh":"含羞草（合欢）在晚春到初夏开花。"},{"en":"The street was lined with pink mimosas.","zh":"街道两旁种满了粉色的合欢树（mimosas）。"}]}],"synonyms":["orange juice and champagne (cocktail description)","brunch cocktail"],"phonetic":"/mɪˈmoʊzəz/","extraExplanation":["在美国语境里，mimosa 最常见的含义是“橙汁+起泡酒”的早午餐鸡尾酒；在菜单或对话中看到 mimosas，通常就是指饮料。","词源来自拉丁语 *mimosa*，与“mime（模仿）”同源，最初用于指某些叶片会“合拢/像在回应触碰”的植物（与“含羞草”意象相关）。不同地区把不同植物叫 mimosa，所以植物含义有时会因地而异。"]}
{"word":"mimosis","summary":{"en":"Mimosis is an uncommon word for the touch-sensitive folding reaction seen in plants like Mimosa pudica.","zh":"mimosis 是個較少見的詞，指像含羞草那樣被觸碰後葉片會合攏的敏感反應。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, uncommon) A touch-sensitive reaction in plants, especially the kind seen in the sensitive plant (Mimosa pudica), where leaves fold or droop when touched.","zh":"（植物學，較少見）植物對觸碰的敏感反應，尤指含羞草（Mimosa pudica）那種被碰觸後葉片合攏或下垂的現象。"},"examples":[{"en":"The researcher demonstrated mimosis by lightly touching the leaflets, which closed within seconds.","zh":"研究人員輕觸小葉來示範 mimosis，葉片在幾秒內就合攏了。"},{"en":"In the greenhouse, mimosis was easier to observe on warm, sunny days.","zh":"在溫室裡，天氣溫暖、陽光充足時更容易觀察到 mimosis。"}]}],"synonyms":["touch sensitivity (in plants)","sensitive-plant response"],"phonetic":"/mɪˈmoʊsɪs/","extraExplanation":["「mimosis」在一般英文中很少用，較常見的是「mimosa」：可以指含羞草這類植物，也常指「mimosa（雞尾酒）」＝香檳/氣泡酒加柳橙汁。若你想查的是飲料或植物本身，請告訴我你要的是哪一個，我可以補上更常用的詞條與例句。"]}
{"word":"mimosite","summary":{"en":"“Mimosite” is not a standard English word; it’s likely a misspelling of “mimosa.”","zh":"“mimosite”不是标准英语词；更可能是把“mimosa”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “mimosa” (a plant) or “mimosa” (a brunch cocktail).","zh":"不是标准英语单词。很可能是 “mimosa”（含羞草/金合欢等植物）或 “mimosa”（早午餐鸡尾酒）的拼写错误。"},"examples":[{"en":"I can’t find “mimosite” in most dictionaries—did you mean “mimosa”?","zh":"大多数词典里找不到 “mimosite”——你是不是想写 “mimosa”？"},{"en":"At brunch, she ordered a mimosa (orange juice with sparkling wine).","zh":"早午餐时，她点了一杯 mimosa（橙汁加起泡酒）。"}]}],"phonetic":"ˈmɪməˌsaɪt","extraExplanation":["“mimosite”在常见英语语料与主流词典中非常少见或不收录，因此更像拼写错误。","如果你想表达“植物”，更常见的是：mimosa（含羞草/金合欢类植物的俗称之一）。如果你想表达“饮品”，mimosa 指橙汁+香槟/起泡酒的鸡尾酒。","如果你能提供一句包含该词的原句（或你看到它的网页/书籍片段），我可以帮你确认它是否为专有名词、品牌名、或某个学科里的罕见术语。"]}
{"word":"mimotannic","summary":{"en":"*Mimotannic* is a rare, mostly historical term meaning “related to mimotannic acid/tannins,” and it may also be a nonstandard or mistaken spelling depending on context.","zh":"*mimotannic* 是较罕见、偏历史的用语，通常指“与某类鞣酸/鞣质（mimotannic acid）有关”；在部分语境下也可能是非标准用法或拼写误写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, chemistry/botany) Relating to *mimotannic acid*—a tannin (astringent plant compound) historically described as coming from *Mimosa* (acacia) bark or similar plant sources.","zh":"（罕见，化学/植物学）与“mimotannic acid（拟/含羞草鞣酸）”有关的；指一种历史上被认为来自含羞草属（或金合欢等）树皮等植物来源的鞣质（有收敛性的植物化合物）。"},"examples":[{"en":"Some older texts mention *mimotannic* substances when describing tannins extracted from bark.","zh":"一些较旧的文献在描述从树皮中提取的鞣质时，会提到 *mimotannic* 类物质。"},{"en":"The solution’s *mimotannic* compounds can give it an astringent taste.","zh":"溶液中的 *mimotannic* 化合物可能会带来涩味（收敛感）。"}]},{"partOfSpeech":"other","definition":{"en":"Not a common modern English word; often appears only in specialized or historical writing, and it may also be a misspelling or an uncommon variant of another term.","zh":"不是现代英语中的常用词；多见于专业或历史文献，也可能是拼写错误或某个术语的罕见变体。"},"examples":[{"en":"If you saw *mimotannic* in a paper, check whether the author meant “tannic” or a specific tannin name.","zh":"如果你在文章里看到 *mimotannic*，可以核对作者是否想表达 “tannic（鞣酸的）” 或某种特定鞣质的名称。"}]}],"synonyms":["tannic","astringent","tannin-related"],"phonetic":"/ˌmɪmoʊˈtænɪk/","extraExplanation":["这个词在现代词典里很少作为常用词条出现，更像是“mimotannic acid（某类鞣酸/鞣质）”的派生形容词，用于较早期的化学或植物提取物描述。","如果你是从标签、论文、或配方里看到它，建议提供上下文（句子或截图），我可以帮你判断它是专门术语、品牌/人名，还是想写的其实是另一个更常见的词（如 *tannic*, *mimetic* 等）。"]}
{"word":"mimotype","summary":{"en":"Mimotype means a mimic form/type; in biotech it can mean a molecule (often a peptide) that mimics an epitope.","zh":"mimotype 指“拟态型/模仿的类型”；在生物技术中也可指“模仿表位的分子（常为肽）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type or form that mimics (imitates) another organism, object, or pattern; a mimic type","zh":"拟态型；模仿另一种生物、物体或图案的类型/形态"},"examples":[{"en":"Some butterflies have a mimotype that resembles toxic species, which helps them avoid predators.","zh":"有些蝴蝶具有一种拟态型，外形像有毒物种，从而帮助它们躲避捕食者。"},{"en":"In design, the app’s new icons feel like a mimotype of older desktop symbols.","zh":"在设计中，这款应用的新图标给人一种“拟态型”的感觉，像是早期桌面符号的翻版。"}]},{"partOfSpeech":"n.","definition":{"en":"(specialized, immunology/biotech) a molecule—often a peptide—selected or engineered to mimic an epitope (the part of an antigen recognized by antibodies)","zh":"（专门用语，免疫/生物技术）模仿表位的分子（常为肽），用于模拟抗原上可被抗体识别的部位"},"examples":[{"en":"Researchers used a mimotype to study how antibodies bind to the virus without using the whole virus.","zh":"研究人员使用模仿表位的分子来研究抗体如何与病毒结合，而不必使用完整病毒。"},{"en":"A mimotype can help map which parts of a protein trigger an immune response.","zh":"模仿表位的分子可帮助定位蛋白质中哪些部分会触发免疫反应。"}]}],"synonyms":["mimic type","mimic form","mimicry form","mimotope (biotech)"],"phonetic":"/ˈmɪməˌtaɪp/","extraExplanation":["“mimotype”不是日常高频词，更常见于学术语境（尤其是免疫学/生物技术）或在讨论“拟态/模仿风格”时使用。","在免疫学文献中，你也可能更常看到拼写为“mimotope”（意为“模仿表位的肽/分子”）。有些作者会把“mimotype”当作近义或变体用法，但具体含义最好根据上下文判断。"]}
{"word":"mimotypic","summary":{"en":"Mimotypic describes something (often a peptide or antibody) that mimics an antigenic site and can produce a similar immune response.","zh":"mimotypic 指（常见于肽或抗体）能模拟某个抗原表位，并可能引发类似免疫反应的特性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Immunology) Resembling or imitating a specific molecular shape or antigenic site (epitope), so it can trigger a similar immune response.","zh":"（生物/免疫学）指在结构或功能上模拟某种分子形状或抗原决定簇（表位），从而可能引发类似免疫反应的。"},"examples":[{"en":"Researchers designed a mimotypic peptide that imitates a viral epitope.","zh":"研究人员设计了一种拟表位（mimotypic）肽，用来模拟病毒表位。"},{"en":"A mimotypic antibody can mimic an antigen and help scientists study immune recognition.","zh":"拟抗原（mimotypic）抗体可以模拟抗原，帮助科学家研究免疫识别过程。"}]}],"synonyms":["mimetic","imitative","epitope-mimicking"],"phonetic":"/ˌmɪməˈtɪpɪk/","extraExplanation":["“mimotypic”多见于免疫学与疫苗/抗体研究语境，常与“mimotope（拟表位）”“epitope（表位）”“antibody（抗体）”搭配。它强调的是“像到足以被免疫系统当成同一个目标”这一点，而不只是外观相似。"]}
{"word":"mimp","summary":{"en":"“Mimp” is a rare, old-fashioned word meaning to act primly or whine in an affected way; it can also mean a fussy, prim person.","zh":"“mimp”是罕用的古语，可指装矜持、矫情地抱怨/哼哼，也可指一个过分矫情、挑剔的人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(archaic, rare) To speak or act in an affected, prim, or overly delicate way; to whine or fuss softly.","zh":"（古语/罕用）装腔作势、故作矜持地说话或行动；（小声）哼哼唧唧地抱怨、娇气地闹。"},"examples":[{"en":"He started to mimp about the weather, as if a little rain were a tragedy.","zh":"他开始为天气哼哼唧唧地抱怨，好像下点雨就是悲剧。"},{"en":"Don’t mimp—tell me clearly what you need.","zh":"别再娇气地闹了——清楚告诉我你需要什么。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic, rare) A prim, affected person; someone who is overly fussy or delicate.","zh":"（古语/罕用）装模作样、过分矫情的人；很爱挑剔、很娇气的人。"},"examples":[{"en":"The character is written as a mimp, always worried about manners.","zh":"这个角色被写得很矫情，总是在担心礼节问题。"}]}],"synonyms":["whine","fuss","act prim","complain","pout"],"phonetic":"/mɪmp/","extraExplanation":["“mimp”在现代英语里非常少见，多见于旧文本或带戏谑语气的写作中。日常表达里更常用：whine（抱怨/哼哼）、fuss（瞎忙/小题大做）、act prim（装矜持）、be picky（挑剔）。","如果你是在技术语境里看到的“mimp”，也可能是拼写误差或缩写；例如图形学里的“mipmap”（纹理的多级渐远贴图）。可以告诉我原句，我帮你判断。"]}
{"word":"mimpei","summary":{"en":"“mimpei” isn’t a recognized English vocabulary word; it likely needs context or a corrected spelling.","zh":"“mimpei”不是常见英语词汇；可能需要语境或更正拼写才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a name, or a word from another language.","zh":"不是标准英语单词；更可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “mimpei” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英文词典里找不到“mimpei”，你能把它出现的句子发我吗？"},{"en":"If you meant “mimic,” the spelling is different.","zh":"如果你想写的是“mimic（模仿）”，拼写不一样。"}]}],"phonetic":"/mɪmˈpeɪ/","extraExplanation":["“mimpei”看起来像拼写变体或外来词/人名。比较常见、可能被写错的相近英语词有：mimic（动词/名词：模仿；模仿者）、mimicry（名词：模仿；拟态）、mimic + pay（误分词）等。","如果你告诉我它出现的语境（整句/截图/是哪门语言的文本），我可以帮你确认它到底是什么词，以及正确的含义和用法。"]}
{"word":"mimsey","summary":{"en":"Mimsy (often misspelled “mimsey”) means weak or flimsy, sometimes affectedly prim; it’s best known from Lewis Carroll’s “Jabberwocky.”","zh":"Mimsy（常被误拼为 mimsey）指软弱单薄、缺乏精神（有时也指装模作样地拘谨）；最出名的出处是刘易斯·卡罗尔《Jabberwocky》。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary or playful) weak, flimsy, or lacking spirit; sometimes overly proper or prim in an affected way.","zh":"（文学或俏皮用法）软弱无力的、单薄不结实的；有时指装模作样地拘谨、假正经的。"},"examples":[{"en":"The excuse sounded mimsy, as if it would fall apart under one question.","zh":"这个借口听起来很“mimsy”，仿佛被问一句就会崩掉。"},{"en":"He gave a mimsy little smile and avoided the topic.","zh":"他露出一个软弱又做作的小笑容，避开了话题。"},{"en":"The character is drawn as mimsy and timid, easily pushed around.","zh":"这个角色被刻画得软弱胆怯，很容易被人摆布。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, mainly in wordplay) a person or thing that seems weak, timid, or insubstantial.","zh":"（罕见，多见于文字游戏）软弱胆小或给人单薄感的人或事物。"},"examples":[{"en":"In the story, the bully calls him a “mimsy” to mock his shyness.","zh":"在故事里，恶霸用“mimsy”嘲笑他的害羞。"}]}],"synonyms":["flimsy","weak","feeble","timid","puny","insubstantial","prim (in some contexts)"],"phonetic":"/ˈmɪmzi/","extraExplanation":["“mimsy”最出名的来源是刘易斯·卡罗尔（Lewis Carroll）《镜中奇遇记》中的诗《Jabberwocky》（常译《咕噜咕噜怪》）里的“mimsy were the borogoves”。它是卡罗尔式的“混成词/仿造词”（nonsense word），常被解释为把“miserable（可怜的）”和“flimsy（不结实的）”的感觉揉在一起，因此带有童话、俏皮、略荒诞的语气。","你输入的“mimsey”多半是拼写误差；标准拼写是“mimsy”。在现代英语里它不算常用，出现时往往带一点讽刺或文学感。"]}
{"word":"mimsy","summary":{"en":"Mimsy means weak or overly delicate, and it can also be a playful literary word from Lewis Carroll suggesting something flimsy or pitiful.","zh":"mimsy 指软弱或过分娇弱；也可作文学/俏皮用语（源自刘易斯·卡罗尔），带“轻飘、可怜兮兮”的荒诞色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or thing) weak, timid, or too delicate in a way that seems silly or affected.","zh":"（人或事物）软弱的、胆怯的；（有时带贬义）过分娇弱/矫揉造作的。"},"examples":[{"en":"He gave a mimsy excuse for being late, and no one believed him.","zh":"他用一个软弱无力的借口解释迟到，没人相信。"},{"en":"The book critic called the main character mimsy and indecisive.","zh":"书评人说主角懦弱又优柔寡断。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literary, playful) flimsy, miserable, or pathetic—used for a whimsical mood rather than a precise description.","zh":"（文学/俏皮用法）轻飘飘的、可怜兮兮的、令人同情的；更多是营造荒诞气氛，而非严谨描述。"},"examples":[{"en":"The poem paints a mimsy little world that feels dreamlike.","zh":"这首诗描绘了一个虚幻又有点可怜的“小世界”。"},{"en":"In a playful style, the author describes the creature as mimsy and lost.","zh":"作者用俏皮笔调写那生物“mimsy”又迷路。"}]}],"synonyms":["feeble","timid","delicate","flimsy","wishy-washy","wimpy"],"phonetic":"/ˈmɪmzi/","extraExplanation":["“mimsy”最有名的来源是刘易斯·卡罗尔（Lewis Carroll）的《Jabberwocky》（《爱丽丝镜中奇遇记》中的无意义诗）。它是卡罗尔创造的词，常被认为融合了 *miserable*（悲惨的）和 *flimsy*（脆弱的/不结实的）的感觉，因此带有童话式、荒诞又略显可怜的色彩。","现代英语里它偶尔用来带点讽刺地说某人“太软弱/太娇气”，语气通常不太客气；正式写作中不常见，更偏文学或幽默语境。"]}
{"word":"mimulus","summary":{"en":"Mimulus is a monkeyflower-type plant, often with bright, tube-shaped flowers.","zh":"mimulus 指猴面花一类植物，常见特征是鲜艳的筒状花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the monkeyflower group (formerly the genus *Mimulus*), known for bright, tube-shaped flowers; some species grow in wet places.","zh":"猴面花属（旧分类为 *Mimulus* 属）的一类植物，花色鲜艳、花冠呈筒状；部分品种喜湿地环境。"},"examples":[{"en":"We saw wild mimulus growing along the stream.","zh":"我们在溪流边看到野生的猴面花（mimulus）在生长。"},{"en":"Mimulus is often planted in gardens for its colorful blooms.","zh":"猴面花常被种在花园里，因为它开花颜色很漂亮。"}]}],"synonyms":["monkeyflower"],"phonetic":"/ˈmɪmjələs/","extraExplanation":["“Mimulus”常见英文俗名是 “monkeyflower（猴面花）”。在近年的植物分类里，传统的 *Mimulus* 有一部分被重新划分到其他属（如 *Erythranthe*、*Diplacus*），但在园艺与日常英语中仍常用 mimulus 来指这一类猴面花。","词源上与拉丁语 *mimus*（模仿者/小丑）有关，指花朵的形状与斑纹像“脸”（因此中文也常译作“猴面花”）。"]}
{"word":"mimus","summary":{"en":"Mimus usually refers to the bird genus that includes mockingbirds; more rarely, it can mean a historical “mime/imitator” performer.","zh":"Mimus 通常指包含嘲鸫的鸟类属名；较少见时可指历史上的“哑剧/拟剧”演员（模仿者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of New World birds that includes the mockingbirds (for example, the northern mockingbird).","zh":"（鸟类）拟鸫属：新大陆的一属鸟类，包含嘲鸫（如北美嘲鸫）。"},"examples":[{"en":"The northern mockingbird’s scientific name is Mimus polyglottos.","zh":"北美嘲鸫的学名是 Mimus polyglottos。"},{"en":"Several species in the genus Mimus are known for copying other birds’ songs.","zh":"拟鸫属的若干物种以模仿其他鸟的鸣唱而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, historical) a mime or comic actor, especially in ancient Roman contexts.","zh":"（罕见，历史用法）哑剧演员／滑稽戏演员，尤指古罗马语境中的“拟剧演员”。"},"examples":[{"en":"In Roman entertainment, a mimus might perform short comic scenes.","zh":"在古罗马娱乐中，mimus 可能表演短小的滑稽片段。"},{"en":"The term mimus comes from a word meaning “imitator.”","zh":"mimus 一词源自表示“模仿者”的词。"}]}],"synonyms":["mockingbird (related)","mime (rare/historical, related)"],"phonetic":"/ˈmaɪməs/","extraExplanation":["“Mimus”常见于生物学/观鸟语境，是拉丁化的属名，通常首字母大写并用斜体（如 *Mimus polyglottos*）。","词源上与“mime（哑剧）/mimic（模仿）”同源，核心概念都是“模仿”。"]}
{"word":"mimusops","summary":{"en":"Mimusops is a botanical genus name for certain tropical evergreen trees in the sapodilla family.","zh":"Mimusops 是一个植物学属名，指山榄科中的一些热带常绿树木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical evergreen trees and shrubs in the sapodilla family (Sapotaceae), found mainly in Africa and Asia; some species are grown for hard wood, shade, or edible fruit.","zh":"山榄属（Mimusops）：山榄科（Sapotaceae）的一属热带常绿乔木或灌木，主要分布于非洲与亚洲；部分物种用于木材、绿化遮荫或果实食用。"},"examples":[{"en":"Mimusops species are common in coastal forests in parts of southern Africa.","zh":"在非洲南部一些沿海森林里，山榄属植物很常见。"},{"en":"The botanical garden labels this tree as Mimusops, a member of the Sapotaceae family.","zh":"这座植物园把这棵树标注为 Mimusops（山榄属），属于山榄科。"}]}],"synonyms":["Sapotaceae (family name, related term)"],"phonetic":"/ˈmɪməˌsɑps/","extraExplanation":["“Mimusops”是植物学中的拉丁化属名，日常英语里多用于学术或园艺语境；在写作中常以属名+种加词的形式出现（如 *Mimusops elengi*）。","不同地区会把某些山榄属植物称为“milkwood（乳木）”等俗名，但“milkwood”并不只指这一属，具体含义要看地区与物种。"]}
{"word":"mimzy","summary":{"en":"Mimzy is a playful, rare word meaning soft/weak and a bit silly, and it’s also used as the name “Mimzy” in sci‑fi references.","zh":"mimzy 是个较少见、带玩笑语气的词，表示软弱怯生、略显傻气；也可作科幻作品中的专名“Mimzy”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Soft, weak, and a little silly or affected in a cute way (often used playfully).","zh":"软弱的、怯生生的、有点傻气或装可爱的（常带玩笑语气）。"},"examples":[{"en":"He gave a mimzy little wave and hid behind his mom.","zh":"他怯生生地挥了个小手，就躲到妈妈身后了。"},{"en":"The movie’s humor is intentionally mimzy and gentle.","zh":"这部电影的幽默是刻意走软萌、温和路线的。"}]},{"partOfSpeech":"n.","definition":{"en":"A name or reference to “Mimzy,” especially in science-fiction contexts (e.g., a character or creature).","zh":"“Mimzy”的名称或指代，尤用于科幻语境（如角色或生物名）。"},"examples":[{"en":"In The Last Mimzy, Mimzy is connected to a strange future message.","zh":"在《The Last Mimzy》中，Mimzy 与来自未来的神秘信息有关。"}]}],"synonyms":["mimsy","feeble","wishy-washy","silly","affected"],"phonetic":"/ˈmɪmzi/","extraExplanation":["“mimzy”常被认为是对 Lewis Carroll《Through the Looking-Glass》（《爱丽丝镜中奇遇记》）里诗句“mimsy were the borogoves”的变体拼写；原词更常见写作“mimsy”。Carroll 喜欢创造带有声音和感觉的“拟声/拟态”词，所以它更像一种氛围词，表达“软弱、怯生、略显可笑/装腔”的感觉。","现代流行文化中，“Mimzy”也因科幻短篇《Mimsy Were the Borogoves》及其改编电影《The Last Mimzy》而被更多人当作专有名词来使用。"]}

