{"word":"miqra","summary":{"en":"Miqra means the Hebrew Bible (Tanakh), with an emphasis on Scripture as something read aloud; it can also mean a recitation/reading.","zh":"Miqra 指希伯来圣经（塔纳赫），强调经文作为“被朗读/诵读”的传统；也可指一次诵读/朗读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) the Hebrew Bible, especially as read aloud in public; often another name for the Tanakh (the Jewish Scriptures).","zh":"（犹太教）希伯来圣经，尤其指在公共场合诵读的经文；常作为《塔纳赫》（犹太经典）的别称。"},"examples":[{"en":"In a weekly service, passages from the miqra are read and discussed.","zh":"在每周的礼拜中，会诵读并讨论《米克拉》（希伯来圣经）的章节。"},{"en":"Some scholars use “Miqra” to emphasize the text as a tradition of reading aloud.","zh":"一些学者使用“Miqra”一词，是为了强调经文作为“朗读传统”的特性。"}]},{"partOfSpeech":"n.","definition":{"en":"a reading or recitation (especially of Scripture), focusing on the act of reading aloud rather than the book itself.","zh":"（尤指经文的）朗读、诵读；强调“读出来/诵读”的行为，而不只是书本本身。"},"examples":[{"en":"The teacher asked students to prepare a miqra of the passage for class.","zh":"老师让学生为课堂准备对该段落的诵读（miqra）。"},{"en":"Clear pronunciation matters in miqra because listeners follow the meaning by ear.","zh":"在诵读（miqra）中，清晰发音很重要，因为听众主要通过听来理解意思。"}]}],"synonyms":["Tanakh","Hebrew Bible","Scripture","recitation","reading"],"phonetic":"/mɪkˈrɑː/","extraExplanation":["“Miqra”（常见转写：Mikra/Miqra）源自希伯来语词根 ק־ר־א（q-r-ʾ），与“呼喊、宣告、朗读/读出”有关，所以它不仅指“经书”，也隐含“公开诵读的经文传统”。","在现代语境中，你可能会在书名或学术写作里看到《Mikraot Gedolot》（“大汇编/大注释本圣经”）等用法，其中 Mikra 指“经文”。"]}
{"word":"miquelet","summary":{"en":"A historical term for a Catalan/Spanish irregular soldier or militia member, often a guerrilla fighter.","zh":"历史用语：指加泰罗尼亚/西班牙的非正规士兵或民兵，常带游击队意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Catalan or Spanish irregular soldier or militia member (often a guerrilla fighter), especially in the 17th–18th centuries.","zh":"（尤指17—18世纪）加泰罗尼亚或西班牙的非正规士兵／民兵成员（常指游击战士）。"},"examples":[{"en":"The novel mentions miquelets who knew the mountain paths better than the royal troops.","zh":"小说提到一些miquelets，他们比王室军队更熟悉山路。"},{"en":"Local miquelets gathered quickly to resist the occupying army.","zh":"当地的miquelets迅速集结，抵抗占领军。"}]}],"synonyms":["irregular soldier","militiaman","guerrilla (approx.)"],"phonetic":"/ˌmiːkəˈlɛt/","extraExplanation":["“Miquelet”来自加泰罗尼亚语/西班牙语历史称呼（复数常见为 miquelets / miqueletes），多指在伊比利亚半岛作战的地方民兵或游击队式的非正规武装，常与山地、边境防卫、反占领等背景相关。","在英语里它是较少见的历史词，常出现在历史书、历史小说或关于西班牙/加泰罗尼亚战争史（如“西班牙王位继承战争”等）的叙述中。"]}
{"word":"miquelets","summary":{"en":"Miquelets are Catalan irregular soldiers/militia (historically), and sometimes the term also refers to firearms or a flintlock mechanism linked to them.","zh":"Miquelets 指历史上加泰罗尼亚一带的非正规士兵/民兵；在某些语境中也可指与其相关的火器或“米克莱特式”燧发击发机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Irregular soldiers or militia from Catalonia and nearby regions (Spain), especially active from the 1600s to 1800s; often used for scouting, ambushes, and guerrilla-style fighting.","zh":"（复数）米克莱特兵：来自西班牙加泰罗尼亚及周边地区的非正规士兵/民兵，尤指17至19世纪活跃，常用于侦察、伏击与游击式作战。"},"examples":[{"en":"In the history book, the miquelets are described as skilled mountain fighters.","zh":"在那本历史书里，米克莱特兵被描述为擅长山地作战的战士。"},{"en":"The army hired miquelets to guide troops through difficult terrain.","zh":"军队雇用米克莱特兵带路，让部队穿越复杂地形。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) In some historical writing, firearms (especially flintlock guns) associated with these troops; also called a “miquelet lock.”","zh":"（复数）在一些历史文献中，指与这些部队相关的火器（尤指燧发枪），也可指“米克莱特式击发机构（miquelet lock）”。"},"examples":[{"en":"The museum label mentions miquelets with a distinctive flintlock mechanism.","zh":"博物馆的说明牌提到一种带有独特燧发机构的“miquelets”。"},{"en":"Collectors study the miquelet lock because it differs from later flintlocks.","zh":"收藏家研究米克莱特式击发机构，因为它和后来的燧发枪结构不同。"}]}],"synonyms":["irregulars","militia","guerrillas","partisans"],"phonetic":"/ˌmiːkəˈlɛts/","extraExplanation":["“Miquelets”源自加泰罗尼亚语/西班牙语语境，常与伊比利亚半岛的地方武装、边境冲突和山地游击传统联系在一起。英语里多见于历史叙述、军事史、或博物馆/兵器收藏领域。","拼写上常以复数 miquelets 出现；单数是 miquelet。阅读史料时要根据上下文判断是指“士兵/民兵”还是指“与之相关的燧发枪/击发机构”。"]}

