{"word":"mir","summary":{"en":"“Mir” most commonly refers to the Soviet/Russian space station; it can also be the Russian word “mir” meaning “peace” (sometimes “world”), or an abbreviation like “mid-infrared (MIR).”","zh":"“Mir”最常见指苏联/俄罗斯的和平号空间站；也可能是俄语“mir（мир）”表示“和平”（有时为“世界”），或作为缩写如“中红外（MIR）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mir: a Soviet/Russian space station that orbited Earth from 1986 to 2001.","zh":"“Mir（和平号）”：苏联/俄罗斯的空间站，1986年至2001年在地球轨道运行。"},"examples":[{"en":"Many astronauts lived and worked on Mir for months at a time.","zh":"许多宇航员曾在和平号上连续生活和工作数月。"},{"en":"Mir was a major step toward international cooperation in space.","zh":"和平号是迈向国际航天合作的重要一步。"}]},{"partOfSpeech":"n.","definition":{"en":"mir: a transliteration of the Russian word “мир,” meaning “peace,” and sometimes “world” (often seen in names and cultural references).","zh":"“mir”：俄语“мир”的拉丁转写，意思是“和平”，有时也可指“世界”（常见于名字或文化语境中）。"},"examples":[{"en":"The word mir appears in Russian slogans about peace.","zh":"“mir”这个词常出现在俄语关于和平的标语中。"},{"en":"In some contexts, mir can mean “world,” depending on the sentence.","zh":"在某些语境里，mir根据句子也可能表示“世界”。"}]},{"partOfSpeech":"other","definition":{"en":"MIR: an abbreviation used in some fields, especially science, for “mid-infrared.”","zh":"“MIR”：在某些领域（尤其科学）中使用的缩写，常指“中红外（mid-infrared）”。"},"examples":[{"en":"The sensor measures MIR wavelengths to analyze materials.","zh":"该传感器测量中红外波段来分析材料。"}]}],"synonyms":["space station (for the proper noun meaning)","mid-infrared (for the abbreviation meaning)"],"phonetic":"/mɪr/","extraExplanation":["英语里单独写“mir”通常不是常用词，最常见的是专有名词“Mir（和平号空间站）”。如果你是在文章里看到“mir”，很可能是俄语“мир”的转写或某个专业缩写。","俄语“мир”之所以容易让人困惑，是因为它既可以表示“和平”，也可以表示“世界/人世”，具体取决于上下文。"]}
{"word":"mira","summary":{"en":"Mira is most commonly a personal name; it can also refer to a well-known variable star, or be borrowed from Spanish to mean “look!”","zh":"Mira 最常见是人名；也可指著名变星“米拉星”；或从西班牙语借用表示“看！”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (also used as a surname)","zh":"女性名字（也可作姓氏）"},"examples":[{"en":"Mira moved to Chicago for a new job.","zh":"Mira 为了新工作搬到了芝加哥。"},{"en":"I met Mira at a language exchange event.","zh":"我在一次语言交换活动上认识了 Mira。"}]},{"partOfSpeech":"n.","definition":{"en":"(astronomy) a famous variable star in the constellation Cetus; its brightness changes noticeably over time","zh":"（天文学）位于鲸鱼座的著名变星“米拉星”；其亮度会随时间明显变化"},"examples":[{"en":"In astronomy class, we learned why Mira brightens and fades.","zh":"在天文课上，我们学习了为什么米拉星会变亮又变暗。"},{"en":"Mira is often mentioned as an example of a long-period variable star.","zh":"米拉星常被用作长周期变星的例子。"}]},{"partOfSpeech":"int.","definition":{"en":"(from Spanish) an informal command meaning “look!”; sometimes used in English conversation to add a Spanish flavor","zh":"（源自西班牙语）非正式的感叹/命令，意思是“看！”；英语口语中有时借用来带点西语风格"},"examples":[{"en":"Mira—there’s the bus!","zh":"Mira——公交车来了！"},{"en":"He joked, “Mira, I can finally roll my R’s,” while practicing Spanish.","zh":"他练习西班牙语时开玩笑说：“Mira，我终于会颤音 R 了。”"}]}],"synonyms":["(name) —","(Spanish “look!”) look","see","check it out"],"phonetic":"/ˈmɪrə/","extraExplanation":["“Mira”在不同语境里读音通常相同，但含义差别很大：在英语里最常见的是人名；在天文学里指“米拉星”（Mira，学名 Omicron Ceti）；在西班牙语里则是动词 mirar（看）的命令式（对 tú）。","米拉星之所以有名，是因为它的亮度变化很显著，历史上帮助人们理解“变星”这一类天体。"]}
{"word":"mirabel","summary":{"en":"Mirabel is most commonly used as a female name; it can also refer to a small yellow plum, more often spelled “mirabelle.”","zh":"Mirabel 最常见是女性名字；也可指一种黄色小李子，但英语中更常拼作 mirabelle。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (used as a person’s name)","zh":"女性名字（人名）"},"examples":[{"en":"Mirabel is my cousin’s name.","zh":"Mirabel 是我表妹的名字。"},{"en":"In the movie *Encanto*, Mirabel is the main character.","zh":"在电影《魔法满屋》（*Encanto*）里，Mirabel 是主角。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of small yellow plum (often spelled “mirabelle” in English)","zh":"一种小的黄色李子（英语中更常拼作 mirabelle）"},"examples":[{"en":"She made jam from mirabel (mirabelle) plums.","zh":"她用 mirabel（mirabelle）李子做了果酱。"},{"en":"Mirabelle plums are popular in parts of France.","zh":"Mirabelle 李子在法国的一些地区很受欢迎。"}]}],"synonyms":["Mirabelle"],"phonetic":"/ˈmɪrəˌbɛl/","extraExplanation":["Mirabel 作为名字在近年更常被英语学习者看到，是因为迪士尼动画电影《Encanto》（中文常译《魔法满屋》）的主角叫 Mirabel Madrigal。","表示“黄色小李子”时，英语里更常见拼写是 mirabelle（法语来源），在食谱、果酱、甜点等语境中出现较多。"]}
{"word":"mirabell","summary":{"en":"Mirabelle is most commonly a small sweet yellow plum; it can also refer to the place name Mirabell, especially Mirabell Palace in Salzburg.","zh":"Mirabelle 最常指一种小而甜的黄色李子；也可指专名 Mirabell，尤指萨尔茨堡的米拉贝尔宫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, sweet yellow plum (a type of plum tree and its fruit), often used for jams, tarts, and brandy","zh":"蜜拉贝尔黄李（小而甜的黄色李子；也指这种李子树及其果实），常用于果酱、馅饼和白兰地等"},"examples":[{"en":"She made mirabelle jam from the plums she bought at the market.","zh":"她用在市场买的蜜拉贝尔黄李做了果酱。"},{"en":"Mirabelles are often baked into tarts in parts of France.","zh":"在法国的一些地区，人们常把蜜拉贝尔黄李烤进水果挞里。"},{"en":"The dessert was topped with fresh mirabelle plums.","zh":"这道甜点上点缀着新鲜的蜜拉贝尔黄李。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) a name used for places and buildings, especially “Mirabell Palace” in Salzburg, Austria","zh":"（专有名词）用作地名或建筑名，尤指奥地利萨尔茨堡的“米拉贝尔宫（Mirabell Palace）”"},"examples":[{"en":"We walked through the gardens of Mirabell Palace in Salzburg.","zh":"我们在萨尔茨堡的米拉贝尔宫花园里散步。"},{"en":"The concert was held near Mirabell Palace.","zh":"音乐会在米拉贝尔宫附近举行。"}]}],"synonyms":["plum","yellow plum","cherry plum"],"phonetic":"/ˌmɪrəˈbɛl/","extraExplanation":["“mirabelle”一词常见于法语文化语境，尤其与法国洛林（Lorraine）地区的甜黄李有关；在英文菜单、烘焙食谱里常直接借用该名称。","拼写上更常见的是 **mirabelle**（双写 l）；你输入的 **mirabell** 也可能是在指奥地利萨尔茨堡的 **Mirabell**（宫殿/花园）这一专名拼写。"]}
{"word":"mirabelle","summary":{"en":"Mirabelle most commonly means a small sweet yellow plum, and it can also be a female first name.","zh":"Mirabelle最常指一种小而甜的黄色李子（米拉贝尔黄李），也可用作女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, sweet yellow plum (a type of plum) commonly used for jams, desserts, and fruit brandy.","zh":"米拉贝尔黄李（又称“黄李子/小黄梅”），一种小而甜的黄色李子，常用于果酱、甜点和水果白兰地。"},"examples":[{"en":"She made mirabelle jam from the fruit she bought at the market.","zh":"她用在市场上买的米拉贝尔黄李做了果酱。"},{"en":"Mirabelle plums are often baked into tarts and pastries.","zh":"米拉贝尔黄李常被用来烤成塔类点心或酥点。"},{"en":"In some regions, mirabelles are distilled into a fragrant fruit brandy.","zh":"在一些地区，人们会把米拉贝尔黄李蒸馏成带香气的水果白兰地。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name.","zh":"（女性）名字：Mirabelle（米拉贝尔）。"},"examples":[{"en":"Mirabelle introduced herself and shook my hand.","zh":"米拉贝尔自我介绍并和我握手。"}]}],"synonyms":["plum","mirabelle plum","yellow plum"],"phonetic":"/ˈmɪrəˌbɛl/","extraExplanation":["“Mirabelle”在饮食文化里常让人联想到法国洛林（Lorraine）地区的特产“Mirabelle de Lorraine”，很常见于果酱（jam）、馅饼（tart）与果酒/蒸馏酒（eau-de-vie, brandy）。","词形上，mirabelle常见作不可数/可数名词：可说“mirabelles”指一堆果子；在菜单或食谱中也常见“mirabelle plum(s)”。"]}
{"word":"mirabile","summary":{"en":"Mirabile means “wonderful” or “astonishing,” and it’s often seen in Latin phrases like mirabile dictu (“wonderful to relate”).","zh":"mirabile 表示“奇妙的、令人惊叹的”，现代英语中较少单独使用，常见于拉丁短语如 mirabile dictu（“说来真奇妙”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wonderful or astonishing; deserving admiration","zh":"奇妙的；令人惊叹的；值得赞叹的"},"examples":[{"en":"The rescue was mirabile—everyone survived against the odds.","zh":"这次营救真是奇迹般的——在不利情况下所有人都活了下来。"},{"en":"She delivered a mirabile performance that left the audience silent for a moment.","zh":"她的表演令人惊叹，观众一时间都安静了下来。"}]}],"synonyms":["wonderful","astonishing","marvelous","remarkable"],"phonetic":"/mɪˈræbəli/","extraExplanation":["“mirabile”源自拉丁语 mirabilis（意为“令人惊奇的、奇妙的”），在现代英语里较少单独使用，更常出现在拉丁短语中：\n- mirabile dictu：说来真奇妙（强调“难以置信却是真的”）\n- mirabile visu：看起来真奇妙（强调“景象令人惊叹”）\n常见于较正式、文学性或学术性的语境。"]}
{"word":"mirabilia","summary":{"en":"Mirabilia means “marvels” or “wonders,” especially in historical or literary contexts (often medieval travel writing).","zh":"Mirabilia 指“奇观/奇事”，常见于历史或文学语境，尤其中世纪旅行与见闻写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"marvels or wonderful things; surprising sights, events, or objects (often used in a historical or literary way).","zh":"奇观；奇事；令人惊叹之物（常用于历史或文学语境）。"},"examples":[{"en":"The museum’s catalog highlights the mirabilia collected by early explorers.","zh":"博物馆的目录重点介绍了早期探险家收集的各种奇观。"},{"en":"Medieval travel stories were full of mirabilia—strange animals, distant cities, and unbelievable landscapes.","zh":"中世纪的游记故事里充满了奇观——怪异的动物、遥远的城市和难以置信的地貌。"}]},{"partOfSpeech":"n.","definition":{"en":"(in medieval and early writing) a set or genre of “wonders” described in travel, geography, or religious texts.","zh":"（中世纪及早期写作中）“奇观/奇迹”的汇编或体裁，常见于游记、地理或宗教文本。"},"examples":[{"en":"The author organizes the book as mirabilia, listing wonders from one region after another.","zh":"作者把这本书按“奇观集”的方式编排，逐地列出各种奇异见闻。"},{"en":"Some chronicles mix history with mirabilia to entertain and instruct readers.","zh":"有些编年史把历史与“奇观”混写，以兼具娱乐与教化读者的作用。"}]}],"synonyms":["marvels","wonders","curiosities","phenomena","oddities"],"phonetic":"/ˌmɪr.əˈbɪl.i.ə/","extraExplanation":["“mirabilia”源自拉丁语，原意是“值得惊奇的事物”，在拉丁语里本来是复数形式（相当于“许多奇事/奇观”）。现代英语中也常把它当作复数概念使用。","在欧洲中世纪，“mirabilia”常与旅行文学、地理见闻录、朝圣记录等相关：作者会记录遥远之地的“奇异事物”，其中有真实见闻，也常夹杂传闻与想象。阅读这类文本时，可以把它理解为“奇观录/异闻集”的风格。"]}
{"word":"mirabiliary","summary":{"en":"A mirabiliary is a collection (often displayed like a cabinet) of unusual or wondrous objects.","zh":"mirabiliary 指“奇珍异物的收藏/奇物柜”，即为展示而聚集的稀奇或令人惊奇的物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a collection or cabinet of curiosities; a set of strange, rare, or wonderful objects gathered for display","zh":"奇珍异物的收藏（奇物柜）；为展示而收集的一组稀奇、罕见或令人惊奇的物品"},"examples":[{"en":"The museum began as a mirabiliary assembled by a wealthy traveler.","zh":"这家博物馆最初是一位富有旅行者收集的奇珍异物柜。"},{"en":"Her study looks like a mirabiliary, filled with fossils, shells, and odd antiques.","zh":"她的书房像个奇物收藏室，满是化石、贝壳和古怪的古董。"}]}],"synonyms":["cabinet of curiosities","collection of curiosities","wonder-cabinet","curio collection"],"phonetic":"/ˌmɪrəˈbɪliˌɛri/","extraExplanation":["这是一个较罕见、带点书面/古风色彩的词，常用来指类似“奇物柜（cabinet of curiosities）”那种收藏：在近代早期的欧洲，一些学者与贵族会把自然标本、异域物件、艺术品等混合陈列，以展示世界的“奇观”。","词源上与拉丁语 mirabilis（“令人惊奇的”）有关；因此它强调“奇妙/惊异”的感觉，而不仅仅是“收藏品很多”。"]}
{"word":"mirabilis","summary":{"en":"Mirabilis means “wonderful/remarkable,” often in formal writing or in scientific Latin names.","zh":"Mirabilis 意为“奇妙的/非凡的”，常见于正式文体或拉丁学名中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal, literary) Wonderful; remarkable; amazing.","zh":"（正式/文学）奇妙的；非凡的；令人惊叹的。"},"examples":[{"en":"It was a mirabilis achievement for such a small team.","zh":"对这样一个小团队来说，这是一次非凡的成就。"},{"en":"She described the night sky in mirabilis detail.","zh":"她以令人惊叹的细节描写了夜空。"}]},{"partOfSpeech":"adj.","definition":{"en":"(specialized, biology) Used in scientific Latin names to mean “remarkable” or “marvelous.”","zh":"（专业/生物）用于拉丁学名中，表示“奇特的/卓越的”。"},"examples":[{"en":"Mirabilis jalapa is a flowering plant often called the four o’clock flower.","zh":"Mirabilis jalapa 是一种开花植物，常被称为“夜来香/四点花”。"},{"en":"In taxonomy, mirabilis can signal that a species was considered striking by the person who named it.","zh":"在分类学中，mirabilis 常暗示命名者认为该物种很醒目或特别。"}]}],"synonyms":["marvelous","remarkable","wonderful","extraordinary","astonishing"],"phonetic":"/mɪˈræbəlɪs/","extraExplanation":["“mirabilis”来自拉丁语，核心意思是“令人惊奇的”。在英语里它不算日常用词，更多见于文学语体或学术语境（尤其是生物学命名）。","常见相关表达：**annus mirabilis**（拉丁语短语，意为“奇迹之年/非凡之年”），用来形容某个人或某个领域成就特别突出的年份（如牛顿的1666年，或爱因斯坦的1905年）。"]}
{"word":"mirabilite","summary":{"en":"Mirabilite is a mineral: hydrated sodium sulfate (Na₂SO₄·10H₂O), often forming white crystals in salty, evaporating environments.","zh":"Mirabilite（芒硝矿）是一种矿物：十水硫酸钠（Na₂SO₄·10H₂O），常在盐湖等蒸发环境中形成白色晶体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring mineral form of sodium sulfate decahydrate (Na₂SO₄·10H₂O), often found as colorless to white crystals in salty lakes and dry regions","zh":"芒硝矿；天然含水硫酸钠矿物（Na₂SO₄·10H₂O），常见于盐湖与干旱地区，晶体多为无色或白色"},"examples":[{"en":"Mirabilite crystals can form along the edges of salty lakes as water evaporates.","zh":"随着水分蒸发，盐湖边缘可能会形成芒硝矿晶体。"},{"en":"The sample was identified as mirabilite because it contained hydrated sodium sulfate.","zh":"该样品因含有含水硫酸钠而被鉴定为芒硝矿。"}]}],"synonyms":["hydrated sodium sulfate","sodium sulfate decahydrate"],"phonetic":"/mɪˈræbɪˌlaɪt/","extraExplanation":["“mirabilite”来自拉丁语词根，含“奇妙的、令人惊异的”之意，早期矿物学中常用来给外观或形成过程“很特别”的矿物命名。","芒硝矿容易在较低温度下稳定，天气变暖时可能脱水转变为无水硫酸钠（常称 thenardite），所以在野外观察时会随季节或温度变化而“变样”。","在地质与环境科学语境中，它常和蒸发岩（evaporites）、盐湖（saline lakes）、以及干旱区沉积作用一起出现。"]}
{"word":"mirable","summary":{"en":"“mirable” isn’t standard English; it’s usually a misspelling of “admirable.”","zh":"“mirable”不是标准英语用法；通常是把“admirable”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or incorrect spelling in English; most often a typo for “admirable” (meaning worthy of respect or praise).","zh":"英语中的非标准/错误拼写；最常见是把“admirable”（值得敬佩或称赞的）误写成“mirable”。"},"examples":[{"en":"Your spelling “mirable” is not standard; did you mean “admirable”?","zh":"“mirable”不是标准拼写；你是不是想写“admirable”？"},{"en":"She did an admirable job on the project.","zh":"她把这个项目做得很出色，值得称赞。"}]}],"synonyms":["admirable","commendable","praiseworthy"],"phonetic":"/ˈædmərəbəl/","extraExplanation":["“admirable”常见的拼写错误之一，是把开头的前缀“ad-”漏掉了，写成“mirable”。正式写作中应使用“admirable”。","如果你是在学西班牙语等其他语言，“mirable”可能会出现在不同语境里；但在英语词典中它通常不作为标准词条出现。"]}
{"word":"mirac","summary":{"en":"mirac- is a root meaning “wonder/amaze,” used in words like miracle and miraculous.","zh":"mirac- 是表示“惊奇/惊叹”的词根，常见于 miracle、miraculous 等词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A word root (not a standalone English word) meaning “wonder” or “amaze,” seen in words like miracle and miraculous.","zh":"一个词根（不是独立的英语单词），表示“惊奇、惊叹”，常见于 miracle（奇迹）、miraculous（奇迹般的）等词中。"},"examples":[{"en":"The root mirac- appears in miracle and miraculous.","zh":"词根 mirac- 出现在 miracle 和 miraculous 中。"},{"en":"Miraculous means “like a miracle” or “amazing in a way that seems impossible.”","zh":"Miraculous 意为“像奇迹一样的”或“惊人得似乎不可能的”。"}]}],"synonyms":["wonder (as a meaning)","awe (as a meaning)"],"phonetic":"/məˈræk/","extraExplanation":["mirac- 来自拉丁语词根（与 mirari“惊叹/赞叹”有关）。英语里它通常不会单独使用，而是作为构词成分出现在 miracle（奇迹）、miraculous（奇迹般的）、miraculously（奇迹般地）等词中。","如果你本来想查的是 miracle 或 miraculous，请告诉我，我可以给出更完整的常用释义、搭配和例句。"]}
{"word":"mirach","summary":{"en":"Mirach is the traditional name of the star Beta Andromedae in the constellation Andromeda.","zh":"Mirach 是仙女座中 β仙女座（Beta Andromedae）这颗恒星的传统名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) A bright red giant star in the constellation Andromeda; the traditional name of Beta Andromedae.","zh":"（天文学）仙女座中的一颗明亮红巨星；β仙女座（Beta Andromedae）的传统名称。"},"examples":[{"en":"On a clear autumn night, you can spot Mirach in the constellation Andromeda.","zh":"在晴朗的秋夜，你可以在仙女座中找到Mirach（米拉赫星）。"},{"en":"Astronomy apps often label Mirach as Beta Andromedae.","zh":"天文类应用常把Mirach标注为β仙女座。"},{"en":"The Andromeda Galaxy is located in the same general area of sky as Mirach.","zh":"仙女座星系与Mirach大致位于天空的同一区域附近。"}]}],"synonyms":["Beta Andromedae","β Andromedae"],"phonetic":"/ˈmaɪræk/","extraExplanation":["Mirach 是一颗偏红色的红巨星，在英文天文语境中常作为“恒星专名”出现，因此通常首字母大写。","它的传统名称来自阿拉伯语星名传统（许多亮星的英语名称都源于阿拉伯语），这反映了中世纪伊斯兰世界对天文学命名与观测的深远影响。","学习天文英文时，你会同时看到“传统星名（Mirach）”与“拜耳命名法（Beta Andromedae）”并用：前者更口语/科普，后者更学术/目录化。"]}
{"word":"miracicidia","summary":{"en":"Miracidium (plural miracidia) is the free-swimming larval stage of certain flukes that infects a snail host.","zh":"Miracidium（复数 miracidia）指某些吸虫的游泳幼虫期，通常会感染螺类宿主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a free-swimming larval stage of certain parasitic flatworms (especially flukes), which hatches from an egg and usually infects a snail as the next host","zh":"（寄生虫学）某些寄生扁形动物（尤其是吸虫）的游泳幼虫期；由虫卵孵化后通常会感染螺类作为下一宿主"},"examples":[{"en":"Under a microscope, the miracidium swims quickly using tiny hair-like cilia.","zh":"在显微镜下，毛蚴会用细小的纤毛快速游动。"},{"en":"After hatching, the miracidium must find a suitable snail host to continue its life cycle.","zh":"孵化后，毛蚴必须找到合适的螺类宿主才能继续其生活史。"}]}],"synonyms":["larva (general)","trematode larva"],"phonetic":"/ˌmɪrəˈsɪdiəm/","extraExplanation":["你输入的“miracicidia”很可能是拼写错误。常见术语是单数 **miracidium**（毛蚴），复数 **miracidia**。","毛蚴常见于血吸虫、肝吸虫等吸虫的生活史中：虫卵入水→孵化出毛蚴→侵入螺→在螺内发育成其他幼虫阶段→再感染下一宿主或人。"]}
{"word":"miracidia","summary":{"en":"Miracidia are the free-swimming larval forms of certain parasitic flatworms (trematodes), plural of miracidium.","zh":"Miracidia 指某些寄生吸虫的自由游动幼虫阶段，是 miracidium 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the free-swimming larval stage of a parasitic flatworm (a trematode), which often must enter a snail to continue its life cycle; plural of miracidium","zh":"寄生扁形动物（吸虫）的自由游动幼虫阶段，常需要进入螺类（蜗牛）等中间宿主才能继续生命周期；为 miracidium 的复数"},"examples":[{"en":"Scientists observed miracidia swimming toward the snail host in the water.","zh":"科学家观察到 miracidia 在水中游向螺类宿主。"},{"en":"If the miracidia cannot find a suitable snail, the parasite’s life cycle stops.","zh":"如果 miracidia 找不到合适的螺类中间宿主，寄生虫的生命周期就会中断。"}]}],"synonyms":["miracidium (singular form)","trematode larvae","fluke larvae"],"phonetic":"/ˌmɪrəˈsɪdiə/","extraExplanation":["Miracidia 常出现在寄生虫学（parasitology）与公共卫生语境中，尤其与血吸虫（schistosomes）等吸虫的传播有关。","读音与拼写提示：单数是 miracidium；复数按拉丁化形式变为 miracidia（类似 bacterium → bacteria）。"]}
{"word":"miracidial","summary":{"en":"“Miracidial” means “related to a miracidium,” a free-swimming larval stage of certain parasitic flukes.","zh":"“miracidial”意为“与毛蚴有关的”，毛蚴是某些寄生吸虫的自由游泳幼虫阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a miracidium (the free-swimming larval stage of certain parasitic flatworms, especially flukes).","zh":"与毛蚴（某些寄生扁形动物，尤其是吸虫的自由游泳幼虫阶段）有关的；毛蚴的。"},"examples":[{"en":"Miracidial larvae hatch from eggs and swim to find a snail host.","zh":"毛蚴幼虫会从卵中孵化出来，并游向螺类宿主。"},{"en":"Researchers measured miracidial survival in different water temperatures.","zh":"研究人员测量了毛蚴在不同水温下的存活率。"}]}],"synonyms":["miracidium-related","miracidial-stage (used in context)"],"phonetic":"/ˌmaɪrəˈsɪdiəl/","extraExplanation":["“miracidial”多见于寄生虫学、兽医学与公共卫生相关文献，常与“snail host（螺类宿主）”“trematode/fluke（吸虫）”“schistosomiasis（血吸虫病）”等词一起出现。","词根来自“miracidium（毛蚴）”，指吸虫生活史中离开卵后短暂在水中游动、寻找中间宿主（通常是螺）的阶段，因此它常用于描述与该阶段相关的行为、形态或研究指标（如存活率、运动性、感染力）。"]}
{"word":"miracidium","summary":{"en":"A miracidium is a free-swimming larva of some parasitic flatworms that hatches from an egg and infects a snail.","zh":"miracidium 指某些寄生扁形动物（常见为吸虫）从卵孵化出的可游动幼体，会去感染螺类宿主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A free-swimming larval stage of certain parasitic flatworms (especially flukes), which hatches from an egg and then infects a snail as the next host.","zh":"（某些寄生扁形动物，尤指吸虫的）毛蚴：从虫卵孵化出来、能自由游动的幼体阶段，之后会感染螺类作为下一阶段的宿主。"},"examples":[{"en":"Schistosome eggs hatch into a miracidium that must find a freshwater snail.","zh":"血吸虫卵孵化成毛蚴，必须找到淡水螺作为宿主。"},{"en":"Under the microscope, the miracidium moves quickly through the water.","zh":"在显微镜下，毛蚴在水中游动得很快。"}]}],"synonyms":["larva","trematode larva","fluke larva"],"phonetic":"/ˌmɪrəˈsɪdiəm/","extraExplanation":["“miracidium”常见于寄生虫学与公共卫生语境，尤其与血吸虫病（schistosomiasis）相关。它是吸虫生活史中的关键阶段：毛蚴必须在较短时间内找到合适的螺类，否则就会死亡。","词源来自拉丁语 miracidium（“奇异之物”之意），反映早期显微观察者对这种会游动的微小幼虫的惊讶。"]}
{"word":"miracle","summary":{"en":"Miracle means an extraordinary event that seems impossible—often linked to divine power—or, more casually, an amazingly lucky or impressive result.","zh":"Miracle 指看似不可能发生的“奇迹/神迹”，也可在口语中指非常幸运或惊人的结果、了不起的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extraordinary event that seems impossible and is believed to be caused by a divine power or something beyond natural laws.","zh":"奇迹；神迹：看似不可能发生、被认为由神力或超自然力量造成、超越自然规律的事件。"},"examples":[{"en":"Many people believe the recovery was a miracle.","zh":"很多人认为这次康复是个奇迹。"},{"en":"In the Bible, miracles are signs of divine power.","zh":"在《圣经》中，神迹被视为神力的标志。"}]},{"partOfSpeech":"n.","definition":{"en":"A very lucky or surprisingly good result that feels almost impossible, even if it has a natural explanation.","zh":"奇迹般的好运／结果：虽然可能有现实原因，但好到让人觉得不可思议的结果。"},"examples":[{"en":"It was a miracle we caught the last train.","zh":"我们赶上最后一班火车真是奇迹。"},{"en":"Given the limited budget, finishing on time felt like a miracle.","zh":"在预算有限的情况下还能按时完成，简直像奇迹一样。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that is exceptionally impressive, good, or successful (often used in casual speech).","zh":"了不起的人／事物：非常出色、令人惊叹的东西（较口语）。"},"examples":[{"en":"This little machine is a miracle—it saves me hours every week.","zh":"这台小机器太神了——每周能帮我省好几个小时。"},{"en":"She’s a miracle worker in the kitchen.","zh":"她在厨房里简直是“奇迹制造者”。"}]}],"synonyms":["wonder","marvel","phenomenon","act of God","stroke of luck"],"phonetic":"/ˈmɪrə.kəl/","extraExplanation":["“miracle”常出现在宗教语境中，尤其指上帝（God）施行的超自然事件；但在现代日常英语里也经常被夸张化使用，表示“难以置信的好运/结果”。使用时注意语气：在严肃宗教讨论中更强调“神迹”，在口语中更多是“太不可思议了”。","固定搭配：a miracle happens（奇迹发生），work a miracle（创造奇迹/起死回生），it’s a miracle (that)...（……真是奇迹），miracle worker（能解决难题的人）。"]}
{"word":"miracled","summary":{"en":"Miracled is a rare form meaning “brought about as if by a miracle,” often used for surprising success or survival.","zh":"Miracled 是较少见的用法，表示“仿佛靠奇迹促成的”，常用来强调惊人的成功或幸存。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle, rare) to cause something to happen in a way that seems impossible or beyond normal explanation; to bring about as if by a miracle.","zh":"（过去式/过去分词，较少用）以奇迹般的方式促成某事发生；仿佛靠奇迹实现。"},"examples":[{"en":"The doctors worked all night, but it was her determination that seemed to have miracled her recovery.","zh":"医生们忙了一整夜，但似乎是她的意志力奇迹般地促成了康复。"},{"en":"Some fans say the new coach miracled the team into the finals.","zh":"一些球迷说新教练奇迹般地把球队带进了决赛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, rare) made possible by a miracle; produced in a miraculous way.","zh":"（形容词，较少用）由奇迹促成的；奇迹般产生的。"},"examples":[{"en":"They celebrated her miracled survival after the accident.","zh":"他们庆祝她在事故后奇迹般地活了下来。"},{"en":"In the story, a miracled child appears at the village gate.","zh":"在故事里，一个奇迹般出现的孩子出现在村口。"}]}],"synonyms":["miraculously saved","brought about","achieved","made possible","worked a miracle"],"phonetic":"/ˈmɪrəkəld/","extraExplanation":["“miracled”作为动词形式在现代英语里比较少见，更常见的是用“perform/work a miracle”“work miracles”或用形容词“miraculous”。在写作中用“miracled”会带一点文学/修辞色彩，强调“不可思议地发生”。"]}
{"word":"miraclemonger","summary":{"en":"A (usually critical) word for someone who sells or promotes claims of miracles, often for attention or profit.","zh":"（多含贬义）指兜售或宣扬“奇迹”神迹的人，常带牟利或博关注的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who claims to perform miracles or promotes belief in miracles, especially in a way that seems dishonest, exaggerated, or meant to profit from people’s faith.","zh":"（尤指带有欺骗、夸大或牟利意味的）自称能行神迹的人；兜售“奇迹”信仰的人。"},"examples":[{"en":"The journalist accused him of being a miraclemonger who used people’s hope to raise money.","zh":"那位记者指责他是个“神迹贩子”，利用人们的希望来募款。"},{"en":"Some critics called the healer a miraclemonger, while his followers believed he was sincere.","zh":"一些批评者称那位治疗者是“神迹贩子”，而追随者则相信他是真诚的。"}]}],"synonyms":["charlatan","fraud","faith healer (sometimes)","quack (informal)","peddler (figurative)"],"phonetic":"/ˈmɪrəkəlˌmʌŋɡər/","extraExplanation":["这是一个带强烈批评色彩的词：monger 表示“兜售者/贩子”（如 fishmonger 卖鱼的人、warmonger 主战者），合起来暗示“把奇迹当商品推销”。","常见于新闻评论、宗教争议或揭露骗局的语境中；用它形容他人通常比较尖锐，需注意礼貌与文化敏感性。"]}
{"word":"miraclemongering","summary":{"en":"Miraclemongering means sensationally promoting or spreading miracle claims, often in a manipulative way.","zh":"Miraclemongering 指以耸动、带操纵意味的方式宣扬或散布“奇迹”说法（多含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of promoting, exaggerating, or spreading stories of miracles—often in a sensational or manipulative way (usually disapproving).","zh":"（通常含贬义）宣扬、夸大或散布“奇迹”故事的行为，常带有耸动或操纵意味。"},"examples":[{"en":"The journalist criticized the influencer’s miraclemongering during the health crisis.","zh":"那位记者批评这名网红在健康危机期间进行“奇迹宣传”。"},{"en":"Some leaders used miraclemongering to gain trust and donations.","zh":"有些领袖利用“奇迹宣扬”来获取信任和捐款。"},{"en":"The documentary contrasts genuine faith with modern miraclemongering.","zh":"这部纪录片对比了真诚的信仰与现代的“奇迹炒作”。"}]}],"synonyms":["miracle-peddling","sensationalism","fearmongering (related pattern)","rumor-mongering (related pattern)"],"phonetic":"/ˈmɪrəkəlˌmʌŋɡərɪŋ/","extraExplanation":["这个词由 miracle（奇迹）+ mongering（兜售/散布）构成。mongering 常出现在带负面色彩的词里，如 rumor-mongering（散布谣言）、fearmongering（散布恐惧）。因此 miraclemongering 通常暗示“把奇迹当作噱头来卖”，而不只是单纯谈论宗教或信仰。","语境上常见于新闻评论、社会批判或学术讨论，用来指出某些人借“奇迹”制造热度、牟利或影响公众判断。"]}
{"word":"miracles","summary":{"en":"“Miracles” is the plural of “miracle,” meaning supernatural wonders or extremely surprising lucky outcomes.","zh":"“miracles”是“miracle”的复数，指“神迹/奇迹”，也可指“几乎不可能发生的幸运好结果”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extraordinary event that seems impossible by natural laws and is often believed to be caused by God or a supernatural power.","zh":"奇迹；神迹：看似违背自然规律、难以解释的非凡事件，常被认为由上帝或超自然力量造成。"},"examples":[{"en":"Many people believe the healing was a miracle.","zh":"许多人相信那次康复是个奇迹。"},{"en":"In the Bible, Jesus is said to perform miracles.","zh":"《圣经》中说耶稣行过许多神迹。"}]},{"partOfSpeech":"n.","definition":{"en":"A very lucky or surprising good result that feels almost impossible.","zh":"奇迹般的幸运/好结果：非常幸运或出人意料的好结果，让人觉得几乎不可能发生。"},"examples":[{"en":"It’s a miracle we arrived on time in that traffic.","zh":"那样的堵车我们还能准时到，简直是奇迹。"},{"en":"Finishing the project in one day would be a miracle.","zh":"一天之内完成这个项目简直是奇迹。"}]}],"synonyms":["wonder","marvel","phenomenon","blessing"],"phonetic":"/ˈmɪrəkəlz/","extraExplanation":["“miracle”既可以用于宗教语境（神迹），也常用于日常夸张表达（“简直是奇迹”）来强调事情非常罕见或难以做到。","常见搭配：a miracle happens（奇迹发生）；work miracles（创造奇迹/带来惊人效果）；it’s a miracle (that)...（……真是奇迹）。"]}
{"word":"miracling","summary":{"en":"“Miracling” is an uncommon literary form meaning “performing miracles” or “seeming miraculous.”","zh":"“Miracling”较少见，多为文学/修辞用法，表示“施行奇迹”或“奇迹般的、不可思议的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “to miracle”) performing miracles; making something happen in a way that seems impossible or wonderfully unexpected.","zh":"（动词 miracle 的现在分词）施行奇迹；以看似不可能或出乎意料的方式促成某事。"},"examples":[{"en":"In the old stories, saints are miracling—healing the sick and calming storms.","zh":"在古老的故事里，圣徒在“施行奇迹”——治病、平息风暴。"},{"en":"The novel describes the doctor as “miracling” a cure when everyone had given up.","zh":"小说把那位医生描写成在所有人都放弃时“奇迹般地”治好了病。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjectival/poetic use) having the quality of a miracle; astonishing or magical.","zh":"（形容词性/诗性用法）带有奇迹般特质的；令人惊叹或近乎魔法般的。"},"examples":[{"en":"They spoke of a miracling light after the storm.","zh":"他们谈到暴风雨后那道奇迹般的光。"},{"en":"Her survival felt like a miracling turn of fate.","zh":"她的幸存像命运的奇迹般转折。"}]}],"synonyms":["performing miracles","working miracles","miraculous","wonder-working"],"phonetic":"/ˈmɪrəkəlɪŋ/","extraExplanation":["“miracling”在现代日常英语里并不常见，更常见的表达是：“perform miracles / work miracles（创造奇迹）”“a miracle happened（奇迹发生了）”“miraculously（奇迹般地）”。","作为动词的“to miracle”多见于文学、宗教语境或带夸张修辞的写法，用来营造“超越常理、难以解释”的效果。"]}
{"word":"miraclist","summary":{"en":"“Miraclist” is not a standard English word; it is probably a misspelling of “miraculist” or “miraculous.”","zh":"“miraclist”不是标准英语词；多半是“miraculist”或“miraculous”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling of “miraculist” (a person who believes in or claims the occurrence of miracles) or “miraculous” (having the quality of a miracle).","zh":"（非标准用法）很可能是拼写错误，可能想写“miraculist”（相信或宣称奇迹发生的人）或“miraculous”（奇迹般的）。"},"examples":[{"en":"I couldn’t find “miraclist” in a standard dictionary—did you mean “miraculist” or “miraculous”?","zh":"我在常见词典里找不到“miraclist”——你是想写“miraculist”还是“miraculous”？"},{"en":"Some critics called him a miraculist because he insisted the events were supernatural.","zh":"一些批评者称他为“miraculist”，因为他坚持认为这些事件是超自然的。"}]}],"synonyms":["miraculist","miracle believer","miraculous"],"phonetic":"/mɪˈrækjəlɪst/","extraExplanation":["“miraclist”不是常见英语单词，通常不会出现在权威词典里。最接近的常见相关词有：\n1) miraculist（名词）：多用于宗教/神学语境，指主张或相信“奇迹真实发生”的人。\n2) miraculous（形容词）：更常用，表示“像奇迹一样的、不可思议的”，既可字面（宗教奇迹），也可引申（极其幸运或惊人的结果）。\n如果你能提供原句（上下文），我可以帮你判断最合适的词。"]}
{"word":"miracular","summary":{"en":"“Miracular” is a rare/nonstandard form meaning “miraculous.” Use “miraculous” in most situations.","zh":"“miracular”是少见/非标准形式，意思相当于“miraculous（奇迹般的）”。多数场合建议用“miraculous”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) like a miracle; extremely surprising or wonderful. Usually written as “miraculous.”","zh":"（非标准用法）像奇迹一样的；非常令人惊讶或美妙的。通常写作“miraculous”。"},"examples":[{"en":"The word “miracular” is uncommon; most writers would say “miraculous.”","zh":"“miracular”这个词不常见；大多数写作者会用“miraculous”。"},{"en":"They called her recovery miraculous after the accident.","zh":"事故后她的康复被称为“奇迹般的”。"}]}],"synonyms":["miraculous","amazing","incredible","wonderful"],"phonetic":"/məˈrækjəlɚ/","extraExplanation":["“miracular”在现代英语里多被视为少见变体或拼写误用；在正式写作、考试、工作邮件中建议使用更常见、更标准的“miraculous”。","词根提示：miracle（奇迹）+ -ous（形容词后缀，表示“充满……的/具有……性质的”）→ miraculous（奇迹般的）。"]}
{"word":"miraculist","summary":{"en":"A miraculist is someone who believes in or defends the reality of miracles.","zh":"miraculist 指相信或维护“神迹真实存在”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes in miracles or argues that miracles really happen (especially in religious or philosophical debates).","zh":"相信神迹（奇迹）或主张神迹真实存在的人（尤用于宗教或哲学讨论中）。"},"examples":[{"en":"In the debate, the skeptic demanded evidence, while the miraculist defended reports of healing miracles.","zh":"在辩论中，怀疑者要求证据，而那位相信神迹的人为治愈神迹的报道辩护。"},{"en":"Some historians describe him as a miraculist because he accepted supernatural events as historical facts.","zh":"一些历史学家称他为“神迹论者”，因为他把超自然事件当作历史事实来接受。"}]}],"synonyms":["believer in miracles","supernaturalist","credent"],"phonetic":"/məˈrækjəlɪst/","extraExplanation":["“miraculist”属于较少见的词，更常见的表达是“someone who believes in miracles / a believer in miracles”。在神学、宗教史或哲学讨论里，它常与“skeptic（怀疑者）”“rationalist（理性主义者）”对比使用。","词形来自 miracle（神迹、奇迹）+ -ist（……主义者/……论者/……信奉者），语气通常较中性，但在批评性语境中也可能带一点“立场标签”的感觉。"]}
{"word":"miraculize","summary":{"en":"A rare verb meaning to portray something as a miracle or (less commonly) to perform miracles.","zh":"一个较少见的动词，指把某事描绘成奇迹，或（更少见）施行神迹。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To present, describe, or treat something as a miracle; to make it seem miraculous (often in a rhetorical or religious context).","zh":"把某事描绘成奇迹；以“奇迹”的方式解释或处理（常见于修辞或宗教语境）。"},"examples":[{"en":"Some articles miraculize the athlete’s comeback, ignoring years of training.","zh":"有些文章把这位运动员的复出“奇迹化”，却忽略了多年的训练。"},{"en":"In the sermon, the storyteller tended to miraculize ordinary events.","zh":"在布道中，讲述者倾向于把平常的事情说成奇迹。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause miracles to happen; to work miracles (rare).","zh":"创造奇迹；施行神迹（较少见）。"},"examples":[{"en":"The legend says the saint could miraculize in times of need.","zh":"传说那位圣人在需要时能够施行神迹。"}]}],"synonyms":["mythologize","idealize","glorify","romanticize","exaggerate"],"phonetic":"/məˈrækjəˌlaɪz/","extraExplanation":["“miraculize”在现代英语中比较少见，更多时候人们会用更自然的表达：例如“make something sound miraculous（让某事听起来像奇迹）”“treat it as a miracle（把它当作奇迹）”“mythologize（神话化）”“romanticize（浪漫化）”。","它由“miracle（奇迹）+ -ize（使……化）”构成，常带有“夸大/包装”的语气，尤其在媒体报道、传记叙述或宗教叙事中。写作时如果担心生硬，可以优先改用上面更常见的替代说法。"]}
{"word":"miraculosity","summary":{"en":"Miraculosity means the quality of being miraculous—having the feel of a miracle or extraordinary supernatural/divine action.","zh":"Miraculosity 指“奇迹性”，即某事具有奇迹般、超自然或神圣介入的特质与氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being miraculous; the sense that something involves a miracle or extraordinary divine/supernatural action.","zh":"奇迹性；神迹的特质；（让人感觉）涉及奇迹或超自然/神圣力量的性质。"},"examples":[{"en":"In the novel, the hero’s survival is described with a sense of miraculosity.","zh":"在小说里，作者用一种“奇迹性”的语气来描写主角的生还。"},{"en":"Some people see healings as evidence of miraculosity, while others look for medical explanations.","zh":"有些人把痊愈视为“奇迹性”的证据，而另一些人会寻找医学解释。"}]}],"synonyms":["miraculousness","the sense of the miraculous","wonder","awe"],"phonetic":"/ˌmɪrəˈkjuləsəti/","extraExplanation":["“miraculosity”并不是日常高频词，更常见的表达是：miraculousness（奇迹性）、a sense of the miraculous（奇迹感）、miracle-like quality（如奇迹般的特质）。","词根提示：miracle（奇迹）+ -osity（表示“性质/状态”的名词后缀，如 curiosity 好奇心、generosity 慷慨）。","语体与语境：常见于宗教讨论、文学评论、哲学/神学写作，用来强调“像奇迹一样令人惊异”的氛围或性质。","相关词：miraculous（adj. 奇迹般的）；miracle（n. 奇迹）；wonder（n. 惊奇；奇观）；awe（n. 敬畏）。"]}
{"word":"miraculous","summary":{"en":"Miraculous means something amazingly unlikely, as if caused by a miracle.","zh":"Miraculous 指“奇迹般的、不可思议的”，像是由奇迹促成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extraordinary and seemingly impossible; like something that happens by a miracle.","zh":"奇迹般的；非凡到近乎不可能的；仿佛由奇迹发生的。"},"examples":[{"en":"It was miraculous that no one was hurt in the accident.","zh":"这场事故中没有人受伤，真是奇迹般的。"},{"en":"Doctors called her recovery miraculous.","zh":"医生称她的康复是奇迹般的。"},{"en":"They made a miraculous comeback in the final minutes of the game.","zh":"他们在比赛最后几分钟实现了奇迹般的逆转。"}]}],"synonyms":["incredible","astonishing","remarkable","wondrous","unbelievable"],"phonetic":"/məˈrækjələs/","extraExplanation":["“miraculous”常用于新闻、体育、医疗等场景，强调“极小概率却发生了”的结果；语气比“amazing”更强，更带“不可思议/像奇迹”的感觉。","词源来自“miracle（奇迹）”。在宗教语境中，它也可能暗示“神的力量”，但日常英语里更多是夸张表达，并不一定有宗教含义。","在文学作品里，“miraculous”常用来营造命运转折或超自然色彩，例如描写“奇迹般的幸存”“不可思议的相遇”等。"]}
{"word":"miraculously","summary":{"en":"Miraculously means “in an amazingly surprising way,” sometimes suggesting a religious or supernatural miracle.","zh":"miraculously 表示“奇迹般地、令人难以置信地”，有时带有宗教或超自然“神迹”的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is very surprising and seems impossible; as if by a miracle.","zh":"奇迹般地；出乎意料地（好像发生了奇迹一样）。"},"examples":[{"en":"Miraculously, no one was hurt in the accident.","zh":"奇迹般地，这场事故中没有人受伤。"},{"en":"The lost dog miraculously found its way home after three weeks.","zh":"那只走失的狗在三周后奇迹般地自己找回了家。"},{"en":"The team miraculously won in the last minute.","zh":"球队在最后一分钟奇迹般地赢了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is believed to be caused by God or a supernatural power.","zh":"神迹般地；被认为是由上帝或超自然力量导致地。"},"examples":[{"en":"Some people said she was miraculously healed.","zh":"有人说她被神迹般地治愈了。"},{"en":"The statue was said to miraculously produce water.","zh":"据说那座雕像会神迹般地流出水来。"}]}],"synonyms":["surprisingly","amazingly","incredibly","remarkably","against all odds"],"phonetic":"/məˈrækjələsli/","extraExplanation":["“miraculously”来自动词/名词“miracle”（奇迹），常用于新闻报道或故事叙述来强调“极小概率却发生了”的结果。","在日常英语里，它不一定表示宗教意义；很多时候只是夸张地表达“太不可思议了”。如果要更中性、更科学，可以用“surprisingly / incredibly / against all odds”。"]}
{"word":"miraculousness","summary":{"en":"Miraculousness means the quality of seeming like a miracle—extremely surprising or extraordinary.","zh":"Miraculousness 指“像奇迹一样”的特质或状态，强调极其惊人、非同寻常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being miraculous; the state of seeming like a miracle (very surprising, extraordinary, or beyond normal expectation).","zh":"奇迹般的特质；奇妙、不可思议的状态（非常令人惊讶、非同寻常，仿佛超出常理）。"},"examples":[{"en":"People spoke about the miraculousness of her recovery after the accident.","zh":"人们谈论她在事故后的康复是多么奇迹。"},{"en":"The story focuses less on science and more on the miraculousness of faith.","zh":"这个故事强调的不是科学，而是信仰带来的奇迹感。"}]}],"synonyms":["miracle","wonder","marvel","extraordinary nature","astonishingness"],"phonetic":"/məˈrækjələsnəs/","extraExplanation":["“miraculousness”是由形容词“miraculous（奇迹般的）”加名词后缀“-ness”构成，用来把“性质/状态”名词化：miraculous → miraculousness（奇迹性、奇妙之处）。","在日常英语里，这个词偏正式，常见替代表达有：“how miraculous it is / the miracle of … / something feels like a miracle”。"]}
{"word":"miraculum","summary":{"en":"Miraculum is a Latin word meaning “miracle” or “wonder,” mostly used in Latin quotations or scholarly/religious contexts rather than everyday English.","zh":"Miraculum 是拉丁语，意思是“奇迹/奇观”，主要用于拉丁语引文或学术、宗教语境，而非日常英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin) a miracle; a wondrous event or thing.","zh":"（拉丁语）奇迹；令人惊叹的事件或事物。"},"examples":[{"en":"In medieval Latin texts, miraculum often refers to a saint’s miracle.","zh":"在中世纪拉丁文献中，miraculum 常指圣人的奇迹。"},{"en":"The inscription uses miraculum to describe an event believed to be beyond natural explanation.","zh":"这段铭文用 miraculum 来描述一个被认为超越自然解释的事件。"}]}],"synonyms":["miracle","wonder","marvel"],"phonetic":"/mɪˈrækjʊləm/","extraExplanation":["miraculum 是拉丁语名词，来自词根 mir-（与“惊奇、观看”相关），也与英语 miracle（奇迹）同源。","在现代英语中，miraculum 并不是常用词；你更常见到的是 miracle。miraculum 多出现在拉丁语引用、宗教/历史研究、碑铭或学术语境中。","读拉丁语借词时，英语写作里通常用斜体（miraculum）或在文中注明“Latin for ‘miracle’”。"]}
{"word":"mirador","summary":{"en":"Mirador means a lookout/viewpoint—often a scenic observation spot or a viewing balcony/tower, especially in Spanish-speaking contexts.","zh":"Mirador 指“观景点/瞭望处”，常见于西语国家语境，也可指带窗的观景阳台、塔楼或观景凸窗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lookout place, balcony, or tower designed for enjoying a wide view.","zh":"观景台；瞭望处；（可远眺的）阳台或塔楼。"},"examples":[{"en":"We climbed to the mirador to watch the sunset over the city.","zh":"我们爬到观景台上，看夕阳落在城市上空。"},{"en":"From the mirador, you can see the river winding through the valley.","zh":"从观景台可以看到河流在山谷中蜿蜒流过。"}]},{"partOfSpeech":"n.","definition":{"en":"(Architecture, especially in Spanish/Latin American contexts) An enclosed or partly enclosed viewing bay, often with windows, attached to a building.","zh":"（建筑用语，常见于西班牙/拉美语境）附在建筑上的观景凸窗/观景室，常带窗、半封闭或封闭。"},"examples":[{"en":"The old house had a mirador with large windows facing the sea.","zh":"那栋老房子有一个面向大海、带大窗户的观景凸窗。"},{"en":"In some historic towns, a mirador was built to catch breezes and views.","zh":"在一些历史古城里，人们建观景室来纳凉并欣赏景色。"}]}],"synonyms":["viewpoint","overlook","lookout","observation deck","belvedere"],"phonetic":"/ˈmɪrəˌdɔr/","extraExplanation":["“Mirador”来自西班牙语，源自动词“mirar”（看）。在旅行语境里，你常会在地图或景点标牌上看到“Mirador de + 地名”，意思是“某地观景点/瞭望台”。","英语里也会直接借用“mirador”（尤其谈到西语国家的景点或建筑时）。更通用的英语说法包括：viewpoint, overlook, observation deck。"]}
{"word":"miradors","summary":{"en":"Miradors means “viewpoints/lookout platforms,” the plural of mirador, often used for scenic spots in Spanish- or Portuguese-speaking places.","zh":"miradors 指“观景点/观景台”，是 mirador 的复数，常用于指西班牙语或葡萄牙语地区的景观观景点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mirador: a lookout point or viewing platform (often a tower or terrace) built so people can enjoy a wide view, especially of nature or a city.","zh":"mirador 的复数：观景点/观景台（常为塔、平台或露台），供人远眺欣赏自然景色或城市全景。"},"examples":[{"en":"We stopped at several miradors to take photos of the valley.","zh":"我们在好几个观景点停下来拍山谷的照片。"},{"en":"The guide recommended the miradors along the coastal road for sunset views.","zh":"导游推荐沿海公路上的观景台看日落。"}]}],"synonyms":["viewpoints","lookouts","observation decks","overlooks"],"phonetic":"/ˈmɪrəˌdɔr/","extraExplanation":["“Mirador”来自西班牙语/葡萄牙语，源于动词 mirar（看）。在西语地区旅行时，路牌上的“Mirador”通常指官方设置的观景台或瞭望点，有时也指带观景功能的塔楼（如城堡或海岸瞭望塔）。","英语中常直接借用该词，尤其在谈论西班牙、拉美或葡语地区的景点时；更通用的英语说法还有 viewpoint / lookout / observation deck。"]}
{"word":"mirage","summary":{"en":"A mirage is either a heat-caused optical illusion (like “water” in a desert) or, figuratively, a false hope or misleading appearance.","zh":"mirage 指（1）由热和折射造成的海市蜃楼；（2）比喻意义上的“幻影/虚假的希望或假象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An optical illusion (often seen in hot places) where light bends in the air, making distant objects or water-like reflections appear where they are not.","zh":"（常见于炎热地区的）海市蜃楼；一种光学幻象，因空气折射而让远处看起来像有水面或物体出现在不存在的地方。"},"examples":[{"en":"We thought we saw a lake in the desert, but it was just a mirage.","zh":"我们以为在沙漠里看到了一片湖，但那只是海市蜃楼。"},{"en":"Heat rising from the road can create a mirage that looks like water ahead.","zh":"公路上升起的热气会造成一种像前方有水的海市蜃楼。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that seems real or achievable but is actually false or impossible; a misleading hope or impression.","zh":"幻影；看似真实或可实现、其实是虚假的（或不可能的）希望/印象。"},"examples":[{"en":"For many, “overnight success” is a mirage—years of work are usually behind it.","zh":"对许多人来说，“一夜成名”是个幻影——背后通常是多年的努力。"},{"en":"The promise of easy money turned out to be a mirage.","zh":"轻松赚钱的承诺最后证明只是个幻影。"}]}],"synonyms":["illusion","optical illusion","phantom","hallucination (figurative)","delusion (figurative)","chimera (literary)"],"phonetic":"/məˈrɑːʒ/","extraExplanation":["“mirage”来自法语 mirage，和“to mirror（映照）”有同源关系，强调“看见的像反射/镜像，但并不真实”。","文学或新闻里常用作比喻：把“mirage”当作“虚幻的希望/假象”，语气比单纯的“dream（梦想）”更偏“误导、并不存在”。"]}
{"word":"mirages","summary":{"en":"“Mirages” is the plural of “mirage”: a heat-and-light illusion you can see (like “water” on a road), or a metaphor for a false hope that only seems real.","zh":"mirages 是 mirage 的复数：既可指因热与光折射产生的可见幻象（如公路上的“水面”），也可比喻看似真实却不切实际的希望或目标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Illusions that look like real things (often water or distant objects), caused by light bending in the air, especially in hot places.","zh":"由光在空气中折射造成的“看似真实”的幻象（常像水面或远处物体），多发生在炎热环境中。"},"examples":[{"en":"We thought we saw water on the road, but it was just a mirage.","zh":"我们以为在路上看到了水，其实只是海市蜃楼。"},{"en":"In the desert, mirages can make distant landforms look closer than they are.","zh":"在沙漠里，海市蜃楼会让远处的地形看起来比实际更近。"}]},{"partOfSpeech":"n.","definition":{"en":"A hope or belief that seems real but is actually false or impossible.","zh":"看似真实却不切实际的希望或想法；幻影般的期待。"},"examples":[{"en":"Their promise of quick success turned out to be a mirage.","zh":"他们承诺的快速成功，结果只是一个幻影。"},{"en":"For him, total control was a mirage—life stayed unpredictable.","zh":"对他来说，完全的掌控只是幻影——生活依然充满不确定。"}]}],"synonyms":["illusion","optical illusion","hallucination","delusion","chimera"],"phonetic":"/mɪˈrɑːʒɪz/","extraExplanation":["单数是 mirage，复数是 mirages（你输入的就是复数）。发音上，复数结尾的 -es 通常读作 /ɪz/。","“海市蜃楼”常用来翻译 mirage，但日常英文里 mirage 不一定发生在“海边”，也常见于公路或沙漠等高温环境。","在文学与新闻写作中，mirage 常被用作隐喻，强调“看起来很接近/很真实，但其实不可得”的感觉。常见搭配：a mirage of success / a political mirage / the mirage fades."]}
{"word":"miragy","summary":{"en":"Mirage: an optical illusion (often seen in heat) or, figuratively, a false hope/idea.","zh":"Mirage：海市蜃楼（光学幻象）；也可比喻虚幻的希望或想法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word: “mirage”) An optical illusion caused by heat or atmospheric conditions that makes you see something that isn’t really there (often water on a road or distant shapes in a desert).","zh":"（你可能想写的是“mirage”）海市蜃楼；由高温或大气条件造成的光学幻象，让人看到并不存在的景象（常见于公路上“有水”、沙漠里远处的影像）。"},"examples":[{"en":"We thought we saw water on the highway, but it was just a mirage.","zh":"我们以为高速公路上有水，其实只是海市蜃楼。"},{"en":"In the desert, distant trees can look real, but they may be a mirage.","zh":"在沙漠里，远处的树看起来很真实，但可能只是幻象。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that seems real or achievable but is actually false or impossible (a misleading hope or idea).","zh":"（比喻）看似真实或可实现，但其实是假的或不可能的东西；虚幻的希望/想法。"},"examples":[{"en":"His dream of quick success turned out to be a mirage.","zh":"他快速成功的梦想最终证明只是幻想。"},{"en":"The promise of “free money” online is often a mirage.","zh":"网上所谓“免费送钱”的承诺往往是骗局/幻想。"}]}],"synonyms":["illusion","optical illusion","hallucination (informal/stronger)","fantasy","chimera"],"phonetic":"/məˈrɑʒ/","extraExplanation":["“miragy”不是常见英语拼写，最接近的标准词是“mirage”。如果你想表达“像海市蜃楼一样的/虚幻的”，英语更常用形容词短语：mirage-like，或用形容词 illusory（虚幻的）、deceptive（迷惑性的）。"]}
{"word":"mirak","summary":{"en":"“mirak” is not standard English; it’s usually a misspelling of “miracle” or a transliterated proper name.","zh":"“mirak”不是标准英语；通常是“miracle”的拼写错误或某些语言的人名音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling of “miracle,” or a transliterated name (a proper noun) in some languages.","zh":"不是标准英语单词。最常见情况是把“miracle（奇迹）”拼错了，或是某些语言的人名音译（专有名词）。"},"examples":[{"en":"I can’t find “mirak” in most English dictionaries—did you mean “miracle”?","zh":"大多数英语词典里找不到“mirak”——你是不是想写“miracle（奇迹）”？"},{"en":"Mirak can be a person’s name in some cultures, so it may appear in names or place names.","zh":"“Mirak”在一些文化中可能是人名，所以可能出现在姓名或地名里。"}]}],"synonyms":["(If you meant “miracle”): wonder","(If you meant “miracle”): marvel","(If you meant “miracle”): godsend"],"phonetic":"/ˈmiːræk/","extraExplanation":["“mirak”如果你是想表达“奇迹”，标准拼法是 **miracle**（美式音标 /ˈmɪrək(ə)l/）。常见搭配：a miracle, work a miracle（创造奇迹），It’s a miracle!（真是奇迹！）","如果你能告诉我“mirak”出现的句子或语境（例如小说、歌曲、聊天内容），我可以帮你判断它到底是拼写错误、名字，还是某个缩写。"]}
{"word":"miramolin","summary":{"en":"Miramolin is a scientific term for a neem-derived natural compound studied for insect-related effects.","zh":"Miramolin 是科研用语，指一种来自印度楝（Neem）的天然化合物，常与驱虫/抑虫作用相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical (a limonoid) found in the neem tree, studied for its insect-repellent or insect growth–disrupting effects","zh":"一种天然化学物质（柠檬苦素类），存在于印度楝（Neem）中，被研究用于驱虫或干扰昆虫生长发育"},"examples":[{"en":"Some studies list miramolin among the bioactive compounds extracted from neem seeds.","zh":"一些研究把 miramolin 列为从印度楝种子中提取的生物活性成分之一。"},{"en":"Miramolin is discussed mainly in scientific papers, not in everyday English.","zh":"Miramolin 主要出现在科研论文中，而不是日常英语里。"}]}],"synonyms":["neem compound","limonoid"],"phonetic":"/ˌmɪrəˈmoʊlɪn/","extraExplanation":["“Miramolin”属于科研语境中的专有名词，常见于植物化学（phytochemistry）与天然产物、农药学相关文献。","它通常与印度楝（neem）中的其他成分一起被提到，例如 azadirachtin（印楝素）等；在实际应用与媒体报道中，更常见的是直接说“neem extract / neem oil（印楝提取物/印楝油）”。","如果你是在产品标签或文章里看到这个词，也可能存在拼写差异或OCR识别错误；给我上下文句子我可以帮你核对。"]}
{"word":"mirana","summary":{"en":"Mirana is mainly used as a proper name, most famously for a Dota 2 character.","zh":"Mirana 主要作为专有名词使用，最知名的是《Dota 2》中的角色名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name used in fiction and games; most commonly recognized as the name of a character in the Dota/Dota 2 universe.","zh":"一个用于虚构作品与游戏中的女性名字；最常见的用法是指《Dota / Dota 2》世界观中的角色名。"},"examples":[{"en":"Mirana is a hero in Dota 2 known for riding a white tiger.","zh":"Mirana 是《Dota 2》里的英雄之一，以骑着白虎著称。"},{"en":"Some players call her “Mirana” even when they mean the character’s in-game role, like “support Mirana.”","zh":"有些玩家会用“Mirana”直接代指她的打法或定位，比如“辅助 Mirana”。"}]},{"partOfSpeech":"other","definition":{"en":"In some fantasy settings, a variant spelling/usage of “Mirana” can appear as a character name in fan works, usernames, or role-play.","zh":"在一些奇幻语境中，“Mirana”也可能作为角色名的变体用法，常见于同人作品、用户名或角色扮演。"},"examples":[{"en":"Her online handle is Mirana, inspired by a game character.","zh":"她的网名是 Mirana，灵感来自某个游戏角色。"}]}],"phonetic":"/mɪˈrɑːnə/","extraExplanation":["“Mirana”在英语里通常不作为普通词汇使用，而是作为专有名词（角色名/人名）更常见。","Dota/Dota 2 中的 Mirana 早期与《魔兽争霸3》的自定义地图（Warcraft III mod）文化有关，因此在玩家语境里辨识度很高。"]}
{"word":"miranda","summary":{"en":"Miranda is commonly a female name; it can also refer to U.S. “Miranda rights” or the Shakespeare character in The Tempest.","zh":"Miranda 常见为女性名字；也可指美国的“米兰达权利”，或莎士比亚《暴风雨》中的角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a proper noun), used for people; it can also refer to well-known fictional or cultural figures named Miranda.","zh":"（专有名词）女性名字“Miranda”，用于人名；也可指代一些著名的虚构或文化人物“Miranda”。"},"examples":[{"en":"Miranda is starting a new job next week.","zh":"Miranda 下周要开始一份新工作。"},{"en":"I met Miranda through a friend from college.","zh":"我通过一位大学朋友认识了 Miranda。"}]},{"partOfSpeech":"n.","definition":{"en":"(in U.S. law) “Miranda rights”: the legal warning police must give a suspect in custody, including the right to remain silent and the right to an attorney.","zh":"（美国法律）“米兰达权利”：警方在拘留讯问嫌疑人时必须告知的权利，包括保持沉默权和聘请律师权。"},"examples":[{"en":"The officer read him his Miranda rights before questioning.","zh":"警官在讯问前向他宣读了米兰达权利。"},{"en":"She asked for a lawyer after hearing her Miranda rights.","zh":"她听到米兰达权利后要求见律师。"}]},{"partOfSpeech":"n.","definition":{"en":"a main character named Miranda in Shakespeare’s play The Tempest.","zh":"莎士比亚戏剧《暴风雨》中的主要角色之一，名叫 Miranda。"},"examples":[{"en":"In The Tempest, Miranda grows up isolated on an island.","zh":"在《暴风雨》中，Miranda 在一座岛上与世隔绝地长大。"},{"en":"We discussed Miranda’s innocence and curiosity in class.","zh":"课堂上我们讨论了 Miranda 的天真与好奇心。"}]}],"synonyms":["Miranda rights","Miranda warning"],"phonetic":"/məˈrændə/","extraExplanation":["“Miranda rights”来自美国最高法院1966年的判例 Miranda v. Arizona（米兰达诉亚利桑那州）。因此这里的 Miranda 是一个人的姓氏，后来变成法律术语。","名字 Miranda 常被认为源自拉丁语“mirandus”，有“令人惊奇、值得赞叹”的含义；在英语文化中因莎士比亚《暴风雨》而更为人熟知。"]}
{"word":"mirandous","summary":{"en":"Mirandous is a very rare, literary adjective meaning “wonderful” or “amazing.”","zh":"Mirandous 是一个非常少见、偏文学的形容词，意思是“令人惊叹的/美妙的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare, literary) Wonderful; causing admiration or amazement; worthy of being wondered at.","zh":"（非常少见，文学用语）令人惊叹的；引起赞叹或惊奇的；值得惊叹的。"},"examples":[{"en":"The poem describes a mirandous city shining above the sea.","zh":"这首诗描写了一座在海面上闪耀的、令人惊叹的城市。"},{"en":"To the children, the snowfall felt mirandous and new.","zh":"对孩子们来说，这场雪仿佛新奇而令人惊叹。"}]}],"synonyms":["marvelous","amazing","wonderful","astonishing"],"phonetic":"/məˈrændəs/","extraExplanation":["“mirandous”在现代英语中几乎不用，更常见的是marvelous / amazing / wonderful，或表示“奇迹般的”用miraculous。","词源上可联系拉丁语mirandus（“值得惊叹的”），同根词还有admire（钦佩）等。"]}
{"word":"miranha","summary":{"en":"“Miranha” is usually a meme nickname for Spider-Man (from Portuguese), or a misspelling of “piranha.”","zh":"“miranha”通常是源自葡语的“蜘蛛侠”网络梗称呼，也可能是把“piranha（食人鱼）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang, mainly in Brazilian Portuguese communities) A humorous misspelling/pronunciation of “Homem-Aranha” (“Spider-Man”), used as a meme nickname for Spider-Man.","zh":"（网络俚语，主要见于巴西葡语圈）对“Homem-Aranha”（蜘蛛侠）的搞笑误拼/误读，用作蜘蛛侠的梗称呼。"},"examples":[{"en":"People in the comments kept calling Spider-Man “Miranha.”","zh":"评论区里大家一直叫蜘蛛侠“miranha”。"},{"en":"That clip turned into the “Miranha” meme overnight.","zh":"那段视频一夜之间变成了“miranha”的梗。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling of “piranha” (a sharp-toothed South American fish).","zh":"“piranha（食人鱼）”的拼写错误。"},"examples":[{"en":"Did you mean “piranha,” the fish?","zh":"你是不是想写“piranha（食人鱼）”？"},{"en":"The documentary showed a school of piranhas in the river.","zh":"纪录片展示了一群食人鱼在河里游动。"}]}],"synonyms":["Spider-Man (meme use)","piranha (intended word)"],"phonetic":"/miˈɾɐ̃ɲɐ/","extraExplanation":["“Miranha”作为梗，常见于巴西网络文化：因为口误/方言音变/搞笑字幕等原因，把“Aranha（蜘蛛）”听成或写成“Miranha”。它通常带有亲切、搞笑的语气，并不属于标准英语词汇。","如果你是在英语学习或正式写作中想表达“食人鱼”，正确拼写是“piranha”。"]}
{"word":"miranhan","summary":{"en":"Not a standard English word; likely a name, username, or misspelling.","zh":"非标准英语单词；更可能是人名/用户名或拼写误差。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“miranhan” is not a standard English word. It most likely functions as a proper name (a username, surname, brand name) or a misspelling/variant of another word or name.","zh":"“miranhan” 不是标准英语单词，更可能是专有名词（用户名、姓氏、品牌名）或其他词/名字的拼写变体。"},"examples":[{"en":"My contact name is “miranhan” on the app.","zh":"在这个应用里，我的联系人名是“miranhan”。"},{"en":"I couldn’t find a dictionary entry for “miranhan.”","zh":"我在词典里找不到“miranhan”的词条。"}]}],"phonetic":"/ˈmɪrənˌhæn/","extraExplanation":["这个词在英语常用词典中没有固定释义。如果你是在某个语境里看到它（例如游戏ID、社交账号、小说角色名、公司名），把完整句子或来源发我，我可以帮你判断它更像：\n1）人名/姓氏（以及可能的语言来源）；\n2）两个词拼在一起（如 Miran + Han）；\n3）你想查的其实是相近拼写的英文词（例如某个单词打错了）。\n也可以告诉我你希望它怎么读（或你听到的发音）。"]}
{"word":"mirare","summary":{"en":"Mirare is a Latin/Italian verb meaning “to admire or look at with wonder,” and in Italian it can also mean “to aim at.”","zh":"mirare 是拉丁语/意大利语动词，常指“惊叹地欣赏、钦佩”，在意大利语中也可指“瞄准、旨在”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin/Italian) to admire; to look at with wonder or amazement.","zh":"（拉丁语/意大利语）钦佩；惊叹地注视。"},"examples":[{"en":"In Latin poetry, people often mirare the beauty of nature.","zh":"在拉丁诗歌里，人们常常会对大自然之美感到惊叹（mirare）。"},{"en":"Tourists stopped to mirare the cathedral’s huge stained-glass windows.","zh":"游客停下来惊叹地欣赏大教堂巨大的彩色玻璃窗。"}]},{"partOfSpeech":"v.","definition":{"en":"(Italian) to aim at; to direct something toward a target or goal.","zh":"（意大利语）瞄准；把……指向某个目标。"},"examples":[{"en":"He tried to mirare at the center of the target.","zh":"他试着瞄准靶心。"},{"en":"The campaign mirare at improving public safety.","zh":"这项行动旨在提升公共安全。"}]}],"synonyms":["admire","marvel (at)","gaze (at)","aim (at)","target"],"phonetic":"/mɪˈrɑːreɪ/","extraExplanation":["“mirare”在拉丁语里常见义是“惊叹、赞叹地看”，来自词根 *mir-*（与英语里的 *miracle* 奇迹、*miraculous* 奇迹般的同源）。","它也常被用来帮助理解英语词源：*admire*（钦佩）可追溯到拉丁语 *ad-*（向）+ *mirari*（惊叹）。","意大利语里的“mirare”除了“钦佩”之外，还很常用作“瞄准/对准”。在英文学术或文学讨论中偶尔会直接引用该词来制造古典或诗意的语感。"]}
{"word":"mirari","summary":{"en":"*mirari* is a Latin verb meaning “to wonder at” or “to admire.”","zh":"*mirari* 是拉丁语动词，意思是“惊叹；赞赏/钦佩”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to wonder at; to marvel; to admire.","zh":"（拉丁语）惊叹；感到好奇；钦佩、赞赏。"},"examples":[{"en":"In Latin, *mirari* means “to wonder at” or “to admire.”","zh":"在拉丁语里，*mirari* 的意思是“惊叹”或“钦佩”。"},{"en":"She couldn’t help but wonder at the view.","zh":"她忍不住对眼前的景色感到惊叹。"},{"en":"Many people admire his courage.","zh":"很多人钦佩他的勇气。"}]}],"synonyms":["wonder","marvel","admire"],"phonetic":"/mɪˈrɑri/","extraExplanation":["*mirari* 是拉丁语动词，常见意思是“惊奇、赞赏”。它和英语词源关系很紧密：**admire** 来自拉丁语 *ad-*（向、对）+ *mirari*（惊叹）= “对……感到钦佩”。","相关英语词根/同源联想：*mir-* 常与“惊奇、奇迹”有关，可联想到 **miracle**（奇迹）、**marvel**（奇观/惊叹，虽非同源但意义接近）。"]}
{"word":"mirat","summary":{"en":"“Mirat” is not a common modern English word; it’s usually a misspelling or a proper name.","zh":"“Mirat”不是现代英语中的常用词；通常是拼写错误或专有名词（如人名/地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern dictionaries; most often seen as a misspelling or as a proper name (e.g., a surname or place name).","zh":"在现代英语词典中不是常见/标准词；更常见于拼写错误，或作为专有名词（如姓氏、地名）。"},"examples":[{"en":"I couldn’t find “mirat” in an English dictionary—did you mean “mirage” or “mirror”?","zh":"我在英语词典里找不到“mirat”——你是想写“mirage（海市蜃楼）”还是“mirror（镜子）”吗？"},{"en":"Mirat is also used as a name in some contexts, so it may be a person’s name rather than a vocabulary word.","zh":"“Mirat”在某些语境中也可用作名字，所以它可能是人名而不是词汇。"}]}],"phonetic":"/ˈmɪræt/","extraExplanation":["如果你能提供一句包含“mirat”的原句（或告诉我你想表达的意思/语言来源），我可以帮你判断最可能的正确拼写与对应词义。常见的相近英文词包括：mirror（镜子）、mirage（海市蜃楼）、admire（钦佩，动词）。"]}
{"word":"mirate","summary":{"en":"Migrate means to move to a new place (people/animals) or to move systems/data (technology).","zh":"migrate 表示（人/动物）迁移、移居，或（技术层面）系统/数据迁移。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to move from one place to another, especially to live or work there for a long time (often from one country or region to another)","zh":"（尤指为长期居住或工作而）迁移，移居（常指从一个国家或地区到另一个）"},"examples":[{"en":"Many people migrate to big cities for better jobs.","zh":"很多人为了更好的工作迁移到大城市。"},{"en":"Her family migrated from Mexico to the United States in the 1990s.","zh":"她的家人在20世纪90年代从墨西哥移居到美国。"},{"en":"In winter, some birds migrate south to find warmer weather.","zh":"冬天，一些鸟会向南迁徙以寻找更温暖的气候。"}]},{"partOfSpeech":"v.","definition":{"en":"to move data, software, or services from one computer system to another","zh":"（把数据、软件或服务）迁移到另一套计算机系统"},"examples":[{"en":"The company migrated its email system to the cloud.","zh":"这家公司把邮件系统迁移到了云端。"},{"en":"We need to migrate the old database before the new app launches.","zh":"在新应用上线前，我们需要迁移旧数据库。"}]}],"synonyms":["move","relocate","immigrate","emigrate","shift","transfer"],"phonetic":"/ˈmaɪˌɡreɪt/","extraExplanation":["你输入的“mirate”通常是“migrate”的拼写错误。常见相关词：immigrate（移入/移民到某国）、emigrate（移出/从某国移民出去）、migration（迁移/迁徙）。","用法提示：migrate 常强调“移动/迁移的过程”；如果强调“成为某国居民的法律身份”，更常用 immigrate。"]}
{"word":"mirbane","summary":{"en":"“Mirbane” is not a common English word; it is likely a name or a misspelling.","zh":"“mirbane”不是常见英语词；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often it appears as a proper name (e.g., a username, character name, or surname) or a misspelling of another word.","zh":"不是常见英语词典里的标准词；多见于专有名词（如用户名、角色名、姓氏）或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “mirbane” in a dictionary—where did you see it?","zh":"我在词典里找不到“mirbane”——你是在哪里看到的？"},{"en":"“Mirbane” seems to be a character name in that story, not a regular English word.","zh":"“Mirbane”看起来是那个故事里的角色名，并不是常规英语词。"}]}],"phonetic":"/ˈmɪr.beɪn/","extraExplanation":["“mirbane”很可能是：1）拼写误差（你可以检查是否想写 *migrane/migraine*、*bane* 等）；2）小说/游戏/同人作品中的自造词或专名；3）人名/地名/网名。","如果你把它出现的句子或上下文贴出来（前后各一两句），我可以帮你判断它在该语境里的具体含义、读音更像哪一种，以及可能对应的正确拼写。"]}
{"word":"mircrobicidal","summary":{"en":"Microbicidal means “able to kill microorganisms.”","zh":"microbicidal 意为“能杀死微生物的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to kill microorganisms (such as bacteria, viruses, or fungi).","zh":"能杀死微生物（如细菌、病毒或真菌）的；具杀微生物作用的。"},"examples":[{"en":"The label says the spray is microbicidal and can kill common germs on surfaces.","zh":"标签上写着这款喷雾具有杀微生物作用，可以杀死表面常见病菌。"},{"en":"Hospitals often use microbicidal disinfectants for high-touch areas like doorknobs.","zh":"医院常在门把手等高频接触区域使用具杀微生物作用的消毒剂。"}]}],"synonyms":["germicidal","antimicrobial (often broader)","disinfecting","germ-killing"],"phonetic":"/ˌmaɪ.kroʊ.bəˈsaɪ.dəl/","extraExplanation":["你输入的拼写“mircrobicidal”更常见的正确拼写是 **microbicidal**（microbe + -cidal，“杀……的”）。","**microbicidal** 通常用于医学、公共卫生和清洁产品说明中，语气偏正式。日常口语里更常见说 **germ-killing**（杀菌的）或 **disinfecting**（消毒的）。","相关词：**bactericidal**（杀菌的，特指细菌）、**virucidal**（杀病毒的）、**fungicidal**（杀真菌的）。注意：**antimicrobial** 多指“抑制/杀灭微生物”，不一定强调“杀死”。"]}
{"word":"mird","summary":{"en":"“mird” is not a standard English word; it’s usually a typo (often for “mired” or “mild”) or the acronym MIRD in nuclear medicine.","zh":"“mird”不是标准英语词；通常是拼写错误（常见为“mired”或“mild”），或指核医学中的缩写MIRD。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a common English word; often a misspelling of another word (especially “mired” or “mild”).","zh":"不是常见英语单词；常见于拼写错误（尤其可能想写“mired”或“mild”）。"},"examples":[{"en":"I couldn’t find “mird” in a standard dictionary—did you mean “mired” or “mild”?","zh":"我在常见词典里找不到“mird”——你是不是想写“mired”或“mild”？"}]},{"partOfSpeech":"other","definition":{"en":"MIRD (acronym): Medical Internal Radiation Dose, a method/committee name used in nuclear medicine for calculating internal radiation dose.","zh":"MIRD（首字母缩略词）：Medical Internal Radiation Dose（医学内部辐射剂量），用于核医学中计算体内辐射剂量的方法/委员会名称。"},"examples":[{"en":"The report used the MIRD schema to estimate the absorbed dose in organs.","zh":"该报告使用MIRD方案来估算器官的吸收剂量。"},{"en":"MIRD calculations are common in nuclear medicine dosimetry.","zh":"MIRD计算在核医学剂量学中很常见。"}]}],"synonyms":["MIRD (acronym)"],"phonetic":"/mɝd/","extraExplanation":["“mird”本身在日常英语中几乎不使用。如果你是在句子里看到的，最常见是把 **mired**（陷入困境/泥沼）或 **mild**（温和的/不严重的）拼错。","如果你指的是全大写 **MIRD**，它是医学领域的缩写（核医学/剂量学）。如果能提供原句，我可以帮你判断具体想表达哪个词。"]}
{"word":"mirdaha","summary":{"en":"“mirdaha” is not recognized as a standard English word; it’s likely a name or a transliteration.","zh":"“mirdaha”不是标准英语词汇；更可能是名字或外语音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a personal name, place name, brand name, or a transliteration from another language (e.g., South Asian or Middle Eastern languages).","zh":"不是标准英语词汇。更可能是人名、地名、品牌名，或来自其他语言的音译（例如南亚或中东语言）。"},"examples":[{"en":"I couldn’t find “mirdaha” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里找不到“mirdaha”——你能把它出现的句子发我吗？"},{"en":"Mirdaha might be a name, so the spelling could vary across sources.","zh":"Mirdaha 可能是一个名字，所以不同来源的拼写可能不一样。"}]}],"phonetic":"/mɝˈdɑːhə/","extraExplanation":["“mirdaha”在主流英语语料与词典中几乎没有记录，因此无法像常见英语单词那样给出稳定词义。最有效的方式是：\n1）提供上下文句子/截图；2）说明它来自哪种语言或地区；3）确认大小写与拼写（例如是否应为两词：Mir Daha，或是否与“Mir”（头衔/姓氏）+ 其他词根相关）。\n如果你愿意，也可以告诉我你想查的是“含义”、还是“发音/拼写纠正”。"]}
{"word":"mirdha","summary":{"en":"Mirdha is mainly used as a South Asian surname or historical title (especially in Bengali/Bangladeshi contexts), not a common English vocabulary word.","zh":"Mirdha 主要是南亚姓氏或历史称号（尤见于孟加拉语/孟加拉国语境），并非常见英文词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Mirdha: a South Asian (especially Bengali) surname and historical title used among Muslim communities, sometimes associated with local leaders, landholders, or respected families (usage varies by region and family history).","zh":"Mirdha：南亚（尤指孟加拉地区）常见的姓氏与历史称号，多见于穆斯林社群；在一些地方与地方头人、地主/土地管理者或受尊敬的家族有关（具体含义因地区与家族史而异）。"},"examples":[{"en":"My classmate’s last name is Mirdha, and his family is from Bangladesh.","zh":"我同学姓 Mirdha，他家来自孟加拉国。"},{"en":"In some records, Mirdha appears as a title rather than a personal name.","zh":"在一些史料里，Mirdha 更像一种称号，而不是个人名字。"}]}],"synonyms":["(no direct English synonym; proper name/title)"],"phonetic":"/ˈmɪrdə/","extraExplanation":["“Mirdha”在英语语境里通常作为专有名词（姓氏/称号）出现，因此不像普通英文单词那样有固定、统一的词义。不同地区可能有不同的社会含义与家族背景。","常见的相关拼写/转写包括：Mirdha, Mirdah；也有人会与“Mirza”等不同词混淆（两者并不等同）。如果你是从某段文字看到这个词，提供上下文我可以帮你更准确判断。"]}
{"word":"mire","summary":{"en":"“Mire” means deep mud or, figuratively, a hard-to-escape difficult situation; as a verb, it means to get stuck or be trapped.","zh":"“mire”指“泥沼/泥地”，也可比喻“难以摆脱的困境”；作动词表示“陷入（泥里或麻烦中）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a muddy, wet area of ground that is hard to walk through; deep mud or bog","zh":"泥沼；湿软难行的泥地（常指泥坑、沼泽）"},"examples":[{"en":"The horse got stuck in the mire after the heavy rain.","zh":"大雨过后，那匹马陷进了泥沼里。"},{"en":"We had to walk around the mire to keep our shoes clean.","zh":"我们不得不绕开那片泥地，免得鞋子弄脏。"}]},{"partOfSpeech":"n.","definition":{"en":"a difficult or unpleasant situation that is hard to escape (often used like “in a mire”)","zh":"困境；泥潭（比喻难以摆脱的麻烦或糟糕处境）"},"examples":[{"en":"The company is in a financial mire and needs new leadership.","zh":"公司陷入财务泥潭，需要新的领导层。"},{"en":"He tried to help, but the project sank deeper into a mire of delays.","zh":"他想帮忙，但项目在拖延中越陷越深。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone or something to become stuck in mud or trapped in difficulties","zh":"使陷入泥沼；使陷入困境（常用于被动或比喻）"},"examples":[{"en":"Their car was mired in mud on the country road.","zh":"他们的车在乡间路上陷进了泥里。"},{"en":"The investigation was mired in paperwork.","zh":"调查被大量文书工作拖住了。"}]}],"synonyms":["bog","mud","swamp","quagmire","predicament","entangle"],"phonetic":"/maɪr/","extraExplanation":["“mire”作比喻时很常见，尤其在新闻/评论里：be mired in bureaucracy（陷入官僚程序）、mired in controversy（陷入争议）。语气往往偏负面，强调“越挣扎越难脱身”。","搭配提示：in a mire（在困境中）、mired in + 名词（被……拖住/困住）。"]}
{"word":"mired","summary":{"en":"Mired means stuck in mud or, more commonly, trapped in a difficult situation or slow progress.","zh":"mired 指“陷在泥里”，更常用来比喻“陷入困境/进展受阻”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stuck in mud or wet ground; unable to move easily.","zh":"陷在泥里或湿地里；难以移动的。"},"examples":[{"en":"After the storm, our car was mired in the muddy road.","zh":"暴风雨过后，我们的车陷在泥泞的路上了。"},{"en":"The truck got mired and needed to be pulled out.","zh":"卡车陷住了，需要被拖出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"Stuck in a difficult situation or slow progress; unable to move forward.","zh":"陷入困境或进展缓慢；难以前进的。"},"examples":[{"en":"The project is mired in paperwork and delays.","zh":"这个项目陷在繁琐文件和拖延里。"},{"en":"She felt mired in debt and couldn’t see a way out.","zh":"她觉得自己陷入债务，看不到出路。"},{"en":"The debate became mired in details instead of solutions.","zh":"辩论陷在细节里，而不是解决方案。"}]}],"synonyms":["stuck","bogged down","trapped","entangled","embroiled"],"phonetic":"/maɪrd/","extraExplanation":["mired 来自 mire（泥沼、困境）。既可以字面表示“陷在泥里”，也常用作比喻，表示“被问题、官僚程序、争议等拖住”。常见搭配：be mired in bureaucracy / controversy / problems（陷入官僚主义/争议/问题中）。","在新闻与写作中，mired 往往带有“越陷越深、难以脱身”的语气，比 stuck 更正式、更强调困住的状态。"]}
{"word":"mireor","summary":{"en":"Mirror means a reflective surface (or device) for seeing images, and it can also mean something that reflects or represents another thing; as a verb, it means to reflect or closely match.","zh":"Mirror 指镜子/反射影像的装置，也可作比喻表示“写照、反映”；作动词表示“映照、反射”或“与……相似”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surface (usually glass) that reflects an image; also, a device or object used for seeing your reflection","zh":"镜子；（通常是玻璃的）反射影像的表面；也指用于照出影像的装置或物体"},"examples":[{"en":"She looked in the mirror and fixed her hair.","zh":"她照了照镜子，整理了一下头发。"},{"en":"The car has side mirrors on both doors.","zh":"那辆车两侧车门上都有后视镜。"}]},{"partOfSpeech":"n.","definition":{"en":"something that shows what something else is like; a reflection of behavior, society, or feelings","zh":"（比喻）映照；写照；反映某事物本质或状态的东西"},"examples":[{"en":"Art can be a mirror of society.","zh":"艺术可以成为社会的一面镜子。"},{"en":"His face was a mirror of his emotions.","zh":"他的脸是他情绪的写照。"}]},{"partOfSpeech":"v.","definition":{"en":"to reflect or show something clearly, like a mirror does","zh":"反射；映照；（像镜子一样）清楚地反映或呈现"},"examples":[{"en":"The calm lake mirrored the mountains.","zh":"平静的湖面映出了群山。"},{"en":"Her actions mirrored her father’s habits.","zh":"她的行为和她父亲的习惯如出一辙。"}]}],"synonyms":["looking glass","reflector","reflection","echo","replicate"],"phonetic":"/ˈmɪrər/","extraExplanation":["你输入的“mireor”很可能是拼写错误，常见正确拼写是 **mirror**。这个词里有两个 r：**mir-ror**。","文化/文学用法中，**mirror** 常用作“自我认识”“真相”“社会写照”的象征，比如说 *hold up a mirror to society*（给社会照镜子，揭示问题）。"]}
{"word":"mirepois","summary":{"en":"Mirepoix is a French aromatic vegetable base (onion, carrot, celery) used to build flavor in many dishes.","zh":"Mirepoix 指法式香味蔬菜底料（洋葱、胡萝卜、西芹），用于为多种菜肴打底增香。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Cooking) A classic French mix of diced vegetables—usually onion, carrot, and celery—cooked gently to build flavor for soups, stocks, sauces, stews, and braises.","zh":"（烹饪）法式经典香味蔬菜底料，通常由洋葱、胡萝卜和西芹切丁组成，先慢火炒香，用来为汤、高汤、酱汁、炖菜等打底增香。"},"examples":[{"en":"Start the soup by sweating a mirepoix in butter until the onions turn translucent.","zh":"先用黄油把一份香味蔬菜底料慢慢炒软炒香，洋葱变透明后再开始做汤。"},{"en":"The stock tastes deeper when you roast the mirepoix before simmering it with bones.","zh":"把底料先烤香再和骨头一起熬，高汤味道会更浓郁。"}]}],"synonyms":["aromatic base","vegetable base","soup base","soffritto (similar concept)","holy trinity (similar concept)"],"phonetic":"/ˌmɪr.əˈpwɑː/","extraExplanation":["你输入的“mirepois”常见于拼写错误；标准拼写是 **mirepoix**（法语词）。","“mirepoix”据说来源于18世纪法国的米尔普瓦公爵（Duc de Mirepoix）之名。","在不同菜系里有相似概念：如意大利常见“soffritto”，美国南部烹饪有“holy trinity”（洋葱/青椒/西芹），用途都是做“风味底座”。"]}
{"word":"mirepoix","summary":{"en":"Mirepoix is a classic French mix of diced onion, carrot, and celery used as a flavorful cooking base.","zh":"Mirepoix 指经典法式香味蔬菜底（洋葱、胡萝卜、芹菜切丁），用来打底增香。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mixture of finely diced vegetables—usually onion, carrot, and celery—cooked gently in fat to build flavor as the base for soups, stews, sauces, and stocks.","zh":"（法式料理的）香味蔬菜底：通常由洋葱、胡萝卜和芹菜切丁后，用油或黄油小火炒香，用作汤、炖菜、酱汁或高汤的风味基础。"},"examples":[{"en":"Start the soup by sweating a mirepoix in butter until soft.","zh":"做这道汤先用黄油把一份mirepoix小火炒软、炒出香味。"},{"en":"The chef added a mirepoix to the pot to deepen the flavor of the stock.","zh":"主厨往锅里加入mirepoix，让高汤的味道更浓更有层次。"},{"en":"Dice the vegetables evenly so the mirepoix cooks at the same rate.","zh":"把蔬菜切得大小一致，这样mirepoix受热才会同步。"}]}],"synonyms":["aromatic base","vegetable base","soffritto (related)"],"phonetic":"/ˈmɪr.ə.pwɑː/","extraExplanation":["“mirepoix”是法语词，英语里多用于烹饪语境，指“香味蔬菜底”。常见经典比例大约是洋葱:胡萝卜:芹菜 = 2:1:1（按重量），但会因菜品而调整。","通常做法是用油/黄油“sweat”（小火煸软出香，不刻意上色）；若需要更深的颜色与焦糖风味，也会炒到微微金黄。","相关概念：意大利的 soffritto（常含洋葱、胡萝卜、芹菜，做法相近）；美国路易斯安那“holy trinity”（洋葱、芹菜、甜椒）。"]}
{"word":"mires","summary":{"en":"“Mires” is the plural of “mire” (muddy bog; difficult situation) or the third-person singular of the verb “mire” (to get stuck or become trapped, literally or figuratively).","zh":"“mires”是名词“mire”的复数（泥沼；困境），也可作动词“mire”的第三人称单数（使陷住；陷入泥潭，字面或比喻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wet, muddy ground; a bog or swamp where you can sink or get stuck.","zh":"泥泞的湿地；沼泽地（人或车可能陷进去、被困住）。"},"examples":[{"en":"After the storm, the trail turned into a mire of thick mud.","zh":"暴风雨过后，小路变成了一片厚泥的泥沼。"},{"en":"The horse struggled to cross the mire.","zh":"那匹马艰难地穿过泥沼。"}]},{"partOfSpeech":"n.","definition":{"en":"A difficult, unpleasant, or complicated situation that is hard to escape.","zh":"困境；泥潭（比喻：难以摆脱的复杂或糟糕局面）。"},"examples":[{"en":"The project fell into a financial mire.","zh":"这个项目陷入了资金泥潭。"},{"en":"He tried to avoid the legal mire of a long court case.","zh":"他尽量避免卷入漫长官司带来的法律泥潭。"}]},{"partOfSpeech":"v.","definition":{"en":"To cause someone or something to get stuck in mud, or to become stuck.","zh":"使（某人/某物）陷入泥中；（某人/某物）陷住、动弹不得。"},"examples":[{"en":"The truck got mired in the soft ground.","zh":"卡车陷在松软的地面里了。"},{"en":"Heavy rain mired the road and slowed traffic.","zh":"大雨把路面变得泥泞，交通因此变慢。"}]},{"partOfSpeech":"v.","definition":{"en":"To involve someone or something deeply in a difficult situation, so progress becomes slow or impossible.","zh":"使陷入困境；把……拖进泥潭（比喻：让进展变慢或难以推进）。"},"examples":[{"en":"The discussion was mired in small details.","zh":"讨论陷在琐碎细节里出不来。"},{"en":"They became mired in debt after losing their jobs.","zh":"失业后他们陷入债务泥潭。"}]}],"synonyms":["bog","swamp","mud","quagmire","predicament","mess","entangle","trap","bog down"],"phonetic":"/maɪr/","extraExplanation":["“mires”常见两种用法：①名词复数（many mires，许多泥沼/困境）；②动词第三人称单数（He/She/It mires…，使……陷住/使……陷入泥潭）。","固定搭配很常见：be/get mired in（陷入……），mire something in（使某事陷入……）。","文学或新闻中常用“mire”作比喻，强调“越挣扎越难前进”的感觉，比如 political mire（政治泥潭）、bureaucratic mire（官僚主义泥潭）。"]}
{"word":"miresnipe","summary":{"en":"A (rare) word for a snipe found in marshy, muddy wetlands.","zh":"一个较少见的词，指生活在沼泽泥地等湿地环境中的丘鹬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A snipe (a type of wading bird) that lives in wet, muddy places such as marshes and bogs; sometimes used as a name for a marsh-dwelling snipe.","zh":"丘鹬（一种涉禽）中生活在沼泽、泥地等潮湿环境里的品种；有时用作“沼泽里的丘鹬”的称呼。"},"examples":[{"en":"We spotted a miresnipe feeding along the edge of the marsh.","zh":"我们看到一只丘鹬在沼泽边觅食。"},{"en":"The miresnipe’s long bill helps it probe the mud for insects.","zh":"丘鹬的长喙能帮助它在泥里探寻昆虫。"}]}],"synonyms":["snipe","marsh snipe"],"phonetic":"/ˈmaɪərˌsnaɪp/","extraExplanation":["miresnipe 是由 mire（泥沼、沼泽地）+ snipe（丘鹬）组成的复合词，字面意思就是“泥沼里的丘鹬”。在现代日常英语中很少见，更常见的说法是直接用 snipe，或在需要更具体时说 marsh snipe（沼泽丘鹬）等。","snipe 在文化里也常出现在狩猎与自然观察的语境；此外还衍生出俚语/引申义（如军事中的 “sniper” 与 “snipe hunt” 的说法），但 miresnipe 通常仅用于鸟类/自然语境。"]}
{"word":"mirex","summary":{"en":"Mirex is a persistent organochlorine pesticide/flame retardant that is now widely banned due to environmental and health risks.","zh":"Mirex是一种难降解、易生物累积的有机氯杀虫剂/阻燃剂，因环境与健康风险而在许多地区被禁用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic organochlorine chemical that was once used as an insecticide (especially against fire ants) and as a flame retardant, but is now widely banned or strictly restricted because it persists in the environment and can build up in living organisms.","zh":"一种合成的有机氯化学物质，曾用作杀虫剂（尤其用于防治火蚁）及阻燃剂；由于在环境中难以降解、会在生物体内累积，如今在许多国家已被禁用或严格限制。"},"examples":[{"en":"Mirex was used in the 1960s and 1970s to control fire ants in parts of the southern United States.","zh":"在20世纪60到70年代，mirex曾在美国南部一些地区用于防治火蚁。"},{"en":"Because mirex can accumulate in the food chain, scientists monitor it in fish from contaminated waters.","zh":"由于mirex可能在食物链中累积，科学家会监测受污染水域鱼类中的该物质。"}]}],"synonyms":["organochlorine pesticide","persistent organic pollutant (POP)"],"phonetic":"/ˈmaɪrɛks/","extraExplanation":["“Mirex”是商品名/化学名常用写法，属于持久性有机污染物（POP）的一类；它在环境中稳定、脂溶性强，容易在动物脂肪组织中富集，并可能造成长期生态与健康风险。","在许多地区，mirex已被禁止或列入严格管制清单；学习相关报道时常见搭配有：ban/prohibit (禁止)、restrict (限制)、persistent pollutant (持久性污染物)、bioaccumulate (生物累积)、food chain (食物链)。"]}
{"word":"mirexes","summary":{"en":"Mirexes are amounts or types of mirex, a persistent pesticide/chemical now widely banned or tightly controlled.","zh":"Mirexes 指多份/多种 mirex（灭蚁灵），一种难降解的杀虫化学品，现多已禁用或严控。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mirex: a man‑made chlorinated chemical once used mainly as an insecticide (especially to control fire ants) and sometimes as a flame retardant; now widely banned or strictly controlled because it persists in the environment.","zh":"mirex 的复数：一种人造含氯化学物质，曾主要用作杀虫剂（尤其用于防治火蚁），有时也用作阻燃剂；由于在环境中难以分解、危害较大，如今在许多国家已被禁用或严格管制。"},"examples":[{"en":"Scientists studied how mirexes stayed in lake sediments for many years.","zh":"科学家研究 mirexes 如何在湖泊沉积物中多年不分解。"},{"en":"The report noted that old stockpiles of mirexes must be disposed of safely.","zh":"报告指出旧存的 mirexes 必须以安全方式处理。"}]}],"synonyms":["chlorinated pesticide","persistent organic pollutant (POP)"],"phonetic":"/ˈmaɪrɛks/","extraExplanation":["Mirex 常见于环境与公共卫生语境：它属于“持久性有机污染物（POPs）”，容易在食物链中累积，可能影响野生动物与人体健康。","在英文资料中常见写法是大写“**Mirex**”（作为化学品名称）；复数可写 **mirex** 或 **mirexes**，但实际文本里更常用“mirex (residues)”来表达“残留的灭蚁灵”。"]}
{"word":"mirfak","summary":{"en":"Mirfak is the brightest star in the constellation Perseus (Alpha Persei).","zh":"Mirfak是英仙座中最亮的恒星（英仙座α）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mirfak: the brightest star in the constellation Perseus (also called Alpha Persei), seen in the northern sky.","zh":"Mirfak（米尔法克星）：英仙座中最亮的恒星（又称英仙座α），在北半球夜空中较容易观测到。"},"examples":[{"en":"On a clear winter night, you can spot Mirfak in Perseus above the horizon.","zh":"在晴朗的冬夜，你可以在地平线上方的英仙座里找到Mirfak。"},{"en":"The guide pointed out Mirfak and explained it helps locate the Perseus constellation.","zh":"向导指着Mirfak，说它能帮助人们辨认英仙座。"}]}],"synonyms":["Alpha Persei"],"phonetic":"/ˈmɝfɑk/","extraExplanation":["“Mirfak”常见于天文学、观星指南和星图中，是英仙座α（Alpha Persei）的传统恒星名。","名称来源与阿拉伯语有关，许多亮星的传统英文名都保留了中世纪阿拉伯天文学的命名痕迹。","学习提示：在英文里它通常作为专有名词使用，首字母大写（Mirfak）；也常和“Alpha Persei（英仙座α）”并列出现。"]}
{"word":"miri","summary":{"en":"“Miri” most commonly refers to a city in Sarawak, Malaysia; it can also refer to an ethnic group/language in Northeast India in older usage, or be used as a personal name.","zh":"“Miri”最常见指马来西亚砂拉越州的城市米里；也可能在较旧用法中指印度东北的相关族群/语言，或用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coastal city in Sarawak, Malaysia, known for oil and gas industry and as a gateway to nearby national parks.","zh":"（马来西亚）砂拉越州的海滨城市米里，以石油天然气产业闻名，也是前往周边国家公园的门户。"},"examples":[{"en":"We flew into Miri before visiting Gunung Mulu National Park.","zh":"我们先飞到米里，然后去姆鲁山国家公园。"},{"en":"Miri has long been important to Malaysia’s energy industry.","zh":"米里长期以来对马来西亚的能源产业很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"a people (and related languages) traditionally associated with Arunachal Pradesh in Northeast India; sometimes used in older sources for the Mising people/language.","zh":"（印度）东北部阿鲁纳恰尔邦相关的族群及其语言；在较旧资料中有时用来指米辛（Mising）族/语言的旧称。"},"examples":[{"en":"Some older books use “Miri” when referring to the Mising people.","zh":"一些较旧的书会用“Miri”来指米辛族。"},{"en":"It’s better to check what community the speaker identifies with when you see the term “Miri.”","zh":"看到“Miri”这个词时，最好确认当事人或资料指的是哪个社群的自称。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or surname (usage varies by culture).","zh":"人名或姓氏（不同文化中用法不一）。"},"examples":[{"en":"Miri emailed the draft to the team.","zh":"米里把草稿通过邮件发给了团队。"}]}],"phonetic":"/ˈmɪri/","extraExplanation":["“Miri”作为地名时通常重读在第一音节，英语里常读作 /ˈmɪri/（类似“MIH-ree”）。","指印度东北族群/语言时，“Miri”在部分语境里可能是较旧或外部使用的称呼；在跨文化交流中更稳妥的做法是使用对方社群偏好的自称（例如“米辛 Mising”）。"]}
{"word":"Miriam","summary":{"en":"Miriam is a common female first name. It is also the name of Moses’s sister in the Bible.","zh":"Miriam 是常见的女性英文名；同时也是《圣经》中摩西的姐姐（米利暗）的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a first name), used in many English-speaking and other cultures","zh":"（女性）名字；常见的英文名（名）"},"examples":[{"en":"Miriam is starting a new job next week.","zh":"Miriam 下周开始一份新工作。"},{"en":"I met Miriam at a language exchange event.","zh":"我在一次语言交换活动上认识了 Miriam。"}]},{"partOfSpeech":"n.","definition":{"en":"in the Bible (Old Testament), the sister of Moses and Aaron","zh":"《圣经·旧约》中摩西与亚伦的姐姐（米利暗）"},"examples":[{"en":"In the Old Testament, Miriam is described as a leader among the Israelites.","zh":"在《旧约》中，Miriam 被描述为以色列人中的一位领袖。"},{"en":"The story of Miriam appears in the Book of Exodus.","zh":"Miriam 的故事出现在《出埃及记》中。"}]}],"synonyms":["Mary","Maria"],"phonetic":"/ˈmɪriəm/","extraExplanation":["“Miriam”源自希伯来语“Mirjam/ Miriam（מִרְיָם）”，常被认为与“Mary（玛丽）”同源或互为变体，因此在不同语言里会出现接近的形式（如 Mary、Maria 等）。","作为人名时，英语里通常重读在第一音节：MI-ri-am。书写时首字母大写。"]}
{"word":"miriam","summary":{"en":"Miriam is a female first name; it is also the name of a biblical figure, the sister of Moses and Aaron.","zh":"Miriam 是女性名字；也指《圣经》中摩西与亚伦的姐姐“米利暗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Miriam is starting a new job next week.","zh":"Miriam 下周开始一份新工作。"},{"en":"I met Miriam at a community book club.","zh":"我是在社区读书会认识 Miriam 的。"}]},{"partOfSpeech":"n.","definition":{"en":"(in the Bible) the sister of Moses and Aaron; she is described as a prophet and leader of the Israelites.","zh":"（《圣经》中）米利暗：摩西和亚伦的姐姐，被描写为先知与以色列人的领袖之一。"},"examples":[{"en":"In the Book of Exodus, Miriam leads the women in song after crossing the sea.","zh":"在《出埃及记》中，米利暗在过海后带领妇女歌唱。"},{"en":"The story of Miriam is often discussed in lessons about leadership and faith.","zh":"米利暗的故事常在关于领导力与信仰的课程中被讨论。"}]}],"synonyms":["Miryam","Mary","Maria"],"phonetic":"/ˈmɪriəm/","extraExplanation":["“Miriam”来自希伯来语名字“מִרְיָם (Miryam)”。其确切词源含义有多种学术观点（如与“苦”、 “反叛”等相关的解释），但在英语文化里通常把它当作传统的圣经女性名使用。","在英语语境中，人名一般不翻译；在中文里常译作“米利暗/米利亚姆”。如果对方自己有偏好的拼法或译名，通常以对方为准。"]}
{"word":"miriamne","summary":{"en":"Miriamne is a rare female name; it can also refer to Mariamne I, a Hasmonean princess and wife of Herod the Great.","zh":"Miriamne 是较少见的女性名字；也可指历史人物玛丽亚姆妮一世——哈斯蒙尼公主、希律大帝之妻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a variant spelling of **Mariamne/Mariamne**, ultimately related to **Miriam**).","zh":"女性名字（**Mariamne/Mariamne** 的变体拼写，词源上与 **Miriam** 同源/相关）。"},"examples":[{"en":"Miriamne is a rare name, so people may ask how to spell it.","zh":"Miriamne 是个比较少见的名字，所以别人可能会问怎么拼。"},{"en":"They chose Miriamne because it sounds classical and elegant.","zh":"他们选了 Miriamne，因为它听起来很古典、很优雅。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) **Mariamne I** (often spelled *Mariamne*), a Hasmonean princess and the second wife of **Herod the Great** in 1st‑century BCE Judea.","zh":"（历史）**玛丽亚姆妮一世**（常拼作 *Mariamne*）：哈斯蒙尼王朝的公主，公元前1世纪犹太地**希律大帝**的第二任妻子。"},"examples":[{"en":"Mariamne’s story is often used to discuss power and jealousy in Herod’s court.","zh":"Mariamne 的故事常被用来讨论希律宫廷里的权力与嫉妒。"},{"en":"The play focuses on Mariamne and the tensions in the royal family.","zh":"这部戏以 Mariamne 为中心，描写王室家庭内部的紧张关系。"}]}],"synonyms":["Mariamne","Mariamne","Miriam"],"phonetic":"/ˌmɪriˈæmni/","extraExplanation":["“Miriamne”更常见的历史拼写是 **Mariamne**（也可见 **Mariamne** 等形式）。如果你是想查圣经常见名 **Miriam（米利暗）**，那是更常用、更标准的拼写。","文学中，围绕该历史人物的作品常用 *Mariamne/Mariamne*：例如英文悲剧 **The Tragedy of Mariam**（伊丽莎白·凯里 Elizabeth Cary）以她为核心人物之一。"]}
{"word":"mirid","summary":{"en":"A mirid is a small plant bug in the Miridae family; some are crop pests and some are helpful predators.","zh":"mirid 指盲蝽科的植物蝽；有些会危害作物，有些则能捕食害虫、对农业有益。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small plant bug (family Miridae) that feeds on plants; some species are agricultural pests and some are beneficial predators of other insects","zh":"盲蝽科昆虫；一种体型较小的植食性“植物蝽”，有些种类是农业害虫，也有些会捕食其他小昆虫而对农业有益"},"examples":[{"en":"Farmers monitored mirids in the cotton field to prevent crop damage.","zh":"农民监测棉田里的盲蝽，以防作物受损。"},{"en":"Some mirid species help control pests by feeding on small insects and eggs.","zh":"有些盲蝽种类会捕食小昆虫和虫卵，帮助控制害虫。"}]}],"synonyms":["plant bug","capsid bug"],"phonetic":"/ˈmɪrɪd/","extraExplanation":["“Mirid”常见于农业、昆虫学与园艺语境，指“盲蝽科（Miridae）”的昆虫。日常英语里更常说 plant bug（植物蝽）或用更具体的物种名（如 cotton mirid 等）。","词源上来自拉丁化的分类名 Miridae；在科学写作中常见复数形式 mirids（许多盲蝽）。"]}
{"word":"miridae","summary":{"en":"Miridae: the insect family known as plant bugs (true bugs), including many plant-feeding species and some crop pests.","zh":"Miridae：即“植蝽/盲椿象科”，一种半翅目昆虫类群，很多以植物为食，部分为作物害虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of insects (true bugs) commonly called plant bugs, many of which feed on plants; some are important agricultural pests.","zh":"（昆虫）盲椿象科／植蝽科：一类常被称为“植蝽（plant bugs）”的半翅目昆虫，很多以植物为食；其中一些是重要的农业害虫。"},"examples":[{"en":"Many Miridae feed by piercing plant tissues and sucking out juices.","zh":"许多盲椿象科昆虫会刺穿植物组织并吸食汁液。"},{"en":"The farmer asked an entomologist to identify whether the pest belonged to Miridae.","zh":"农民请昆虫学家鉴定这种害虫是否属于盲椿象科。"}]}],"synonyms":["plant bugs","capsid bugs"],"phonetic":"/ˈmɪrɪdiː/","extraExplanation":["“Miridae”是生物分类学中的“科（family）”名，常见英文俗名包括 plant bugs（植蝽）与 capsid bugs（旧称：盲椿象/盲椿象类）。在科研或农业语境中常用拉丁化名称“Miridae”，日常英语更可能说“plant bugs”。","作为科名时，英文里既可当作单数（The Miridae is a large family.），也常按复数理解（Miridae are widespread.）；写作中通常根据句子把它当作“一个类群/一整个科”来处理。"]}
{"word":"mirier","summary":{"en":"“Mirier” means “more miry”: more muddy, or (figuratively) more messy/unpleasant.","zh":"“Mirier”是“miry”的比较级：更泥泞的；（比喻）更混乱、更糟糕/更不光彩的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of “miry”) more muddy or boggy; covered with wet dirt.","zh":"（“miry”的比较级）更泥泞的；被湿泥覆盖的。"},"examples":[{"en":"After the rain, the trail got even mirier than yesterday.","zh":"下雨后，这条小路比昨天更泥泞了。"},{"en":"Wear boots—this field is mirier near the river.","zh":"穿靴子吧——河边这片地更泥泞。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) more unpleasant, messy, or morally “dirty” (often describing a situation, topic, or story).","zh":"（比喻）更糟糕、更混乱，或更“不干净/不光彩”（常形容局势、话题或故事）。"},"examples":[{"en":"The argument grew mirier as more rumors spread online.","zh":"随着更多谣言在网上扩散，争论变得更混乱、更难看了。"},{"en":"Once money got involved, the situation became mirier.","zh":"一牵扯到钱，情况就变得更复杂、更难处理了。"}]}],"synonyms":["muddier","boggier","sloppier","messier","murkier"],"phonetic":"ˈmaɪriər","extraExplanation":["“mirier”来自形容词“miry”（泥泞的），其名词相关词是“mire”（泥潭；困境）。在书面语中，“miry/mirier”常用来营造一种阴冷、潮湿、脏乱的氛围；比喻用法则强调“纠缠不清、越描越黑”。"]}
{"word":"miriest","summary":{"en":"“Miriest” means “the most muddy/wet and soft.”","zh":"“miriest” 表示“最泥泞的、最湿软的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of miry: the most muddy, wet, and soft underfoot; full of mud.","zh":"miry 的最高级：最泥泞的；又湿又软、满是泥的。"},"examples":[{"en":"After the storm, the trail’s lowest section was the miriest part of the hike.","zh":"暴风雨过后，小径最低的那一段成了徒步中最泥泞的部分。"},{"en":"Wear boots for the miriest fields, or you’ll get stuck.","zh":"去最泥泞的田地要穿靴子，不然你可能会陷进去。"}]}],"synonyms":["muddiest","boggiest","sloppiest","muckiest"],"phonetic":"/ˈmaɪriəst/","extraExplanation":["“miriest” 来自形容词 “miry（泥泞的）”，构成最高级时通常把 y 变成 i，再加 -est：miry → miriest。也可以说 “the most miry”，但在写作中 “miriest” 更简洁。"]}
{"word":"mirific","summary":{"en":"Mirific means “wonderful or astonishing,” often in a literary or formal style.","zh":"mirific 表示“奇妙的、令人惊叹的”，多用于文学或较正式的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Wonderful, astonishing, or impressive in a way that causes admiration.","zh":"（文学用语）奇妙的；令人惊叹的；极其出色的（让人赞叹的）。"},"examples":[{"en":"The museum’s mirific collection drew visitors from around the world.","zh":"博物馆里那批令人惊叹的藏品吸引了来自世界各地的游客。"},{"en":"She described the night sky in mirific detail.","zh":"她以极其精彩的细节描写了夜空。"},{"en":"It was a mirific performance—quiet, precise, and deeply moving.","zh":"那是一场奇妙的演出——安静、精准、且非常感人。"}]}],"synonyms":["wonderful","amazing","marvelous","astonishing","magnificent","splendid"],"phonetic":"/məˈrɪfɪk/","extraExplanation":["“mirific”比较少见，偏书面/文学语气；日常英语里更常用 wonderful / amazing / marvelous / terrific 等。","词源来自拉丁语 mirificus（mirus“奇异的”+ -ficus“造成……的”），字面意思接近“引发惊奇的”。常用于较正式的赞美或带有文艺感的描写。"]}
{"word":"mirifical","summary":{"en":"“Mirifical” is a rare/nonstandard form, usually intended to mean “mirific”: wonderful, astonishing, or extremely impressive.","zh":"“mirifical”是罕见/非标准用法，通常想表达“mirific”的意思：极好、令人惊叹、非常出色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Likely a misspelling or variant of “mirific,” meaning wonderful or astonishing; extremely impressive.","zh":"（非标准/罕见）多半是“mirific”的拼写错误或变体，意思是“极好的、令人惊叹的；非常出色的”。"},"examples":[{"en":"The fireworks were mirific—everyone stopped to watch.","zh":"烟花太惊艳了——大家都停下来观看。"},{"en":"She did a mirific job on the presentation.","zh":"她的展示做得非常出色。"}]}],"synonyms":["wonderful","amazing","remarkable","marvelous","astonishing","excellent"],"phonetic":"/məˈrɪfɪk/","extraExplanation":["“mirifical”在现代英语里几乎不用，词典中更常见的是“mirific”。“mirific”来自拉丁语词根，和“miracle（奇迹）”同源，带有“像奇迹一样令人惊叹”的感觉。","使用建议：正式写作里更推荐用常见词如“wonderful / amazing / remarkable”，或用“mirific”来增加文风（但会显得较文学/较少见）。"]}
{"word":"miriki","summary":{"en":"“Miriki” isn’t a standard English word; it’s likely a name, username, or a term from another language.","zh":"“miriki”不是标准英语词；更可能是人名/网名或外来语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In English, “miriki” is most often seen as a personal name, a username, or a term from another language, so its meaning depends on context.","zh":"不是标准英语单词。在英语里，“miriki”更常见于人名、网名或外来语，因此含义取决于具体语境。"},"examples":[{"en":"I couldn’t find a reliable English dictionary meaning for “miriki.” Where did you see it?","zh":"我在可靠的英语词典里找不到“miriki”的释义。你是在哪里看到的？"},{"en":"Miriki is used here as a screen name, not an English vocabulary word.","zh":"这里的 Miriki 是网名，并不是英语词汇。"}]}],"phonetic":"mɪˈriki","extraExplanation":["“miriki”看起来可能是：\n1) 人名/昵称（例如游戏ID、社交媒体用户名）；\n2) 其他语言的词（需要来源语言与语境才能准确解释）；\n3) 拼写误写：你是否想写 “milky”（牛奶般的）、“miracle”（奇迹）、或 “myriad”（无数的）？\n\n如果你把原句（前后各1–2句）或截图发来，我可以按语境给出最准确的解释与更地道的英文表达。"]}
{"word":"miriness","summary":{"en":"Miriness means muddiness or the state of being stuck in a mire; it can also mean a hard-to-escape situation.","zh":"Miriness 指泥泞/陷入泥沼的状态，也可比喻难以摆脱的困境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being muddy, boggy, or stuck in wet dirt (mire)","zh":"泥泞的状态；沼泽般的黏陷（陷入泥沼的感觉）"},"examples":[{"en":"After the storm, the field’s miriness made it impossible to drive through.","zh":"暴风雨过后，田地一片泥泞，根本无法开车穿过。"},{"en":"The miriness of the trail slowed everyone down.","zh":"小路的泥泞让大家都走得很慢。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a difficult, unpleasant situation that feels hard to escape","zh":"（比喻）困境；让人难以脱身的麻烦局面"},"examples":[{"en":"They tried to pull the project out of the miriness of delays and confusion.","zh":"他们努力把项目从拖延和混乱的困境中拉出来。"},{"en":"He felt trapped in the miriness of debt.","zh":"他觉得自己被债务的困境困住了。"}]}],"synonyms":["muddiness","bogginess","marshiness","quagmire (figurative)","predicament (figurative)"],"phonetic":"/ˈmaɪri.nəs/","extraExplanation":["“miriness”来自“mire”（泥沼、困境）+ 名词后缀“-ness”。在现代英语里更常见的是直接用“mire”或“muddiness”。“miriness”较少用，偏文学/描写性写法。","比喻用法很常见：把麻烦或停滞描述成“像陷进泥里一样”难以前进，例如 be stuck in a mire / get bogged down。"]}
{"word":"mirinesses","summary":{"en":"“Mirinesses” means muddy, wet, messy conditions (plural of “miriness”).","zh":"“mirinesses”指泥泞、湿烂、脏乱的状况（“miriness”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being muddy, wet, and messy; bogginess","zh":"泥泞、湿烂、脏乱的状态；泥地感"},"examples":[{"en":"After the storm, the field’s mirinesses made it hard to walk without slipping.","zh":"暴风雨过后，田地一片泥泞，很难不打滑地走过去。"},{"en":"The hikers turned back because of the mirinesses along the riverbank.","zh":"徒步者因为河岸一路泥泞而决定折返。"}]}],"synonyms":["muddiness","bogginess","marshiness","murk","slush"],"phonetic":"/ˈmaɪrinəsɪz/","extraExplanation":["“mirinesses”是名词“miriness”的复数形式，来源于形容词“miry（泥泞的）”+后缀“-ness（……的状态/性质）”。实际使用中更常见的是不可数的“miriness”或直接用“mud/muddiness”。"]}
{"word":"miring","summary":{"en":"“Miring” means getting stuck in mud or (figuratively) getting bogged down in problems and slow progress.","zh":"“miring”指陷入泥沼或（比喻）陷入问题而停滞、难以前进。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “mire”) getting stuck in mud or soft ground; or causing someone/something to get stuck.","zh":"（动词“mire”的现在分词）陷入泥沼或松软地面；或使（人/物）陷入、被困。"},"examples":[{"en":"The truck kept miring in the wet clay after the storm.","zh":"暴风雨过后，卡车在湿黏土里不停陷住。"},{"en":"Heavy rain is miring traffic on the rural roads.","zh":"大雨让乡村道路的交通陷入拥堵、难以前行。"}]},{"partOfSpeech":"v.","definition":{"en":"becoming slowed down or trapped in a difficult situation (often used figuratively).","zh":"（常作比喻）陷入困境而进展缓慢；被琐事/问题拖住。"},"examples":[{"en":"The project is miring in paperwork and delays.","zh":"这个项目被文件流程和延期拖住了。"},{"en":"They feared the talks were miring in disagreements.","zh":"他们担心谈判会陷入分歧而停滞。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of getting bogged down; a situation where progress is stuck.","zh":"陷住、受困的过程；进展停滞的状态。"},"examples":[{"en":"Weeks of miring turned a simple repair into a major job.","zh":"连续几周的拖沓让原本简单的维修变成了大工程。"}]}],"synonyms":["bogging down","getting stuck","mired","stalled","snagged"],"phonetic":"ˈmaɪrɪŋ","extraExplanation":["“mire”原义是“泥沼、烂泥地”，所以“miring”常带有“越挣扎越难前进”的画面感。英语里很常用它来比喻：事情不是立刻失败，而是被细节、争执、官僚流程等慢慢拖住。"]}
{"word":"mirish","summary":{"en":"“mirish” is not a common English word; it’s usually a name or a misspelling.","zh":"“mirish”不是常见英语词；通常是人名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most often appears as a proper name (e.g., a surname) or as a misspelling of another word.","zh":"不是标准英语单词。它最常见的用法是作为专有名词（如姓氏），或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “mirish” in the dictionary—did you mean “mirage” or “mirth”?","zh":"我在词典里找不到“mirish”——你是不是想写“mirage（海市蜃楼）”或“mirth（欢乐）”？"},{"en":"Dr. Mirish will speak at the conference tomorrow.","zh":"Mirish 医生将于明天在会议上发言。"}]}],"synonyms":["(name)","(possible misspelling) mirage","mirth","Irish"],"phonetic":"/ˈmɪrɪʃ/","extraExplanation":["“mirish”在常见英语词典里通常不作为一个固定词条出现。如果你是在阅读/听力中遇到它，很可能是：\n1）人名/姓氏（需结合上下文判断首字母是否大写）；\n2）拼写误差。常见的可能目标包括：\n- mirage /mɪˈrɑʒ/（海市蜃楼；幻象）\n- mirth /mɝθ/（欢乐；笑声）\n- Irish /ˈaɪrɪʃ/（爱尔兰的；爱尔兰人）\n如果你能提供原句，我可以帮你精准判断。"]}
{"word":"mirk","summary":{"en":"“Mirk” means darkness or gloom, and can also mean “dark/gloomy,” mainly in literary or Scottish usage.","zh":"“mirk”指“黑暗/阴沉、昏暗”，也可作形容词表示“黑暗的/阴郁的”，多用于文学或苏格兰语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"darkness or deep gloom; dim light (often literary or Scottish English).","zh":"黑暗；阴沉、昏暗（多见于文学或苏格兰英语）。"},"examples":[{"en":"The boat disappeared into the mirk as the fog thickened.","zh":"雾越来越浓，小船消失在昏暗的迷雾中。"},{"en":"She waited in the mirk of early morning, before the sun rose.","zh":"她在黎明前的昏暗中等待，直到太阳升起。"}]},{"partOfSpeech":"adj.","definition":{"en":"dark; gloomy; hard to see clearly (often literary or Scottish English).","zh":"黑暗的；阴沉的；看不清的（多见于文学或苏格兰英语）。"},"examples":[{"en":"They walked along a mirk path through the woods.","zh":"他们沿着林中一条昏暗的小路行走。"},{"en":"In that mirk room, I could barely make out his face.","zh":"在那间昏暗的房间里，我几乎看不清他的脸。"}]}],"synonyms":["darkness","gloom","murk","dimness","shadow"],"phonetic":"/mɝk/","extraExplanation":["“mirk”在现代日常英语中不算常用，更常出现在苏格兰语境、诗歌/小说等偏文学的描写里，用来营造阴郁、雾气、暮色等氛围。","近义词里“darkness”更中性，“gloom”更强调情绪上的阴沉；“mirk”常同时带有“看不清、迷蒙”的画面感。"]}
{"word":"mirker","summary":{"en":"“Mirker” means “darker” or “more gloomy,” a literary/Scottish comparative of “mirk.”","zh":"“mirker”意为“更黑暗的/更阴沉的”，是带文学或苏格兰色彩的“mirk”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"darker; more gloomy or shadowy (comparative form of “mirk,” a literary/Scottish word meaning “dark”).","zh":"更黑暗的；更阴沉的（“mirk”的比较级；“mirk”常见于文学或苏格兰英语，意为“黑暗的”）。"},"examples":[{"en":"The clouds grew mirker as the storm moved in.","zh":"暴风雨逼近时，云层变得更阴沉了。"},{"en":"In the mirker corners of the old house, the air felt cold and still.","zh":"在老房子更幽暗的角落里，空气又冷又静。"}]}],"synonyms":["darker","dimmer","gloomier","murkier"],"phonetic":"/ˈmɝkɚ/","extraExplanation":["“mirk /mɝk/”在现代日常英语中不常用，更常见于文学描写、诗歌或带有苏格兰（Scots）色彩的表达，用来营造阴暗、神秘、压抑的氛围。","常见近义表达在现代英语里会用：darker, dimmer, gloomier, murkier（更口语/更常见）。注意：murky（昏暗浑浊的）与mirk（黑暗的）含义接近，但murky更常用于“水浑浊/光线昏暗”。"]}
{"word":"mirkest","summary":{"en":"“Mirkest” means “the darkest” and is an archaic/poetic form.","zh":"“mirkest”意为“最黑暗的”，属于古语/诗歌用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most dark; the darkest (an archaic/poetic superlative of “mirk,” meaning dark or gloomy).","zh":"最黑暗的；最阴沉的（“mirk”的最高级，用法多见于古语/诗歌）。"},"examples":[{"en":"In the mirkest night, the lighthouse still shone.","zh":"在最黑暗的夜里，灯塔依然闪耀。"},{"en":"He walked through the mirkest woods without a map.","zh":"他没有地图，穿过最阴暗的树林。"}]}],"synonyms":["darkest","gloomiest","blackest","dim mest"],"phonetic":"/ˈmɝkɪst/","extraExplanation":["“mirk”常见于苏格兰英语与古英语/诗歌语境，意为“黑暗的、阴郁的”。“mirkest”是其最高级，相当于现代英语里的“darkest / gloomiest”。","在现代日常英语中几乎不用；如果想写得更古典、更有文学感（例如哥特氛围、史诗叙事），才会选择“mirk / mirkest”。"]}
{"word":"mirkier","summary":{"en":"“Mirkier” means “more murky”: either more dark/cloudy or more unclear/confusing.","zh":"“mirkier”意为“更昏暗/更浑浊”，也可指“更不清楚、更令人困惑”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “murky”: darker or less clear (often used for water, air, or light).","zh":"“murky”的比较级：更昏暗的；更浑浊的（常用于水、空气或光线）。"},"examples":[{"en":"After the storm, the river looked even mirkier than usual.","zh":"暴风雨过后，这条河看起来比平时更浑浊。"},{"en":"The fog grew mirkier as the sun went down.","zh":"太阳落山后，雾变得更浓更暗。"}]},{"partOfSpeech":"adj.","definition":{"en":"More difficult to understand; more confusing or unclear (used for situations, explanations, plans, etc.).","zh":"更难理解的；更令人困惑的、不清晰的（用于情况、解释、计划等）。"},"examples":[{"en":"His explanation only made the situation mirkier.","zh":"他的解释反而让情况更扑朔迷离。"},{"en":"The rules get mirkier when you add exceptions.","zh":"一旦加上例外，规则就变得更不清楚了。"}]}],"synonyms":["murkier","cloudier","dimmer","darker","muddier","more obscure","more confusing"],"phonetic":"/ˈmɝkiɚ/","extraExplanation":["“mirkier”是比较级，来自形容词“murky”（浑浊的；不清楚的），常见结构是：murky → murkier → murkiest。","词根“mirk-”与苏格兰英语里的“mirk”（黑暗、昏暗）有关，所以它常带有“阴沉、看不清”的画面感。","写作中它有时用于营造氛围（雾、夜色、阴影），比单说“darker”更有“迷蒙、不明朗”的感觉。"]}
{"word":"mirkiest","summary":{"en":"Mirkiest means the darkest/most shadowy, or (figuratively) the least clear and most confusing.","zh":"Mirkiest 表示最昏暗、最阴沉的；也可比喻为最不清楚、最令人困惑的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “mirky”) the darkest or most gloomy, with very little light; dim and shadowy.","zh":"（“mirky”的最高级）最昏暗的、最阴沉的；光线很少、阴影重重的。"},"examples":[{"en":"The forest was mirkiest at dusk, when the sun slipped behind the hills.","zh":"黄昏时森林最昏暗，太阳落到山后之后更显阴沉。"},{"en":"In the mirkiest corner of the room, I could barely see the old chair.","zh":"在房间最昏暗的角落里，我几乎看不清那把旧椅子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) the least clear or most confusing; hardest to understand.","zh":"（比喻）最不清楚的、最令人困惑的；最难理解的。"},"examples":[{"en":"The mirkiest part of the plan is how we will pay for it.","zh":"这个计划最不清楚的部分是我们要怎么支付费用。"},{"en":"His explanation got mirkiest when he started changing the dates.","zh":"他一开始改日期时，他的解释就变得最含糊不清。"}]}],"synonyms":["darkest","dimmest","gloomiest","murkiest","haziest","most obscure"],"phonetic":"/ˈmɝkiɪst/","extraExplanation":["“mirkiest”来自形容词“mirky”（阴暗的、朦胧的）的最高级形式：mirky → mirkier → mirkiest。","“mirky”在现代英语中不如“murky”常见，更带一点文学/地域色彩（常见于苏格兰英语影响的用法）。在日常表达里，用“murkiest”更常见；两者意思非常接近。"]}
{"word":"mirkily","summary":{"en":"“Mirkily” means “in a dark, gloomy, dim way,” and more rarely “in an unclear way,” often in literary style.","zh":"“mirkily”表示“昏暗地、阴沉地、在暗处”，较少也可指“含混不清地”，多见于文学语体。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a dark, gloomy, or dim way; in near-darkness.","zh":"昏暗地；阴沉地；在几乎看不清的黑暗中。"},"examples":[{"en":"The streetlights flickered, and the alley lay mirkily quiet.","zh":"路灯闪烁着，那条小巷在昏暗中显得格外安静。"},{"en":"Through the fog, the harbor appeared mirkily, with only a few shapes visible.","zh":"穿过浓雾，港口在昏暗中若隐若现，只能看见几个轮廓。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an unclear or hard-to-understand way (used rarely, often in literary style).","zh":"含混不清地；难以理解地（较少见，多用于文学风格）。"},"examples":[{"en":"He spoke mirkily about the plan, leaving everyone unsure of the details.","zh":"他含混不清地谈起计划，让大家都不确定细节。"}]}],"synonyms":["darkly","dimly","gloomily","murkily","obscurely"],"phonetic":"/ˈmɝːkɪli/","extraExplanation":["“mirkily”来自形容词/名词“mirk”（昏暗、黑暗），带有苏格兰英语与文学色彩；在现代日常英语里更常用“darkly / dimly / gloomily”。","在文学描写中，“mirkily”常用来营造气氛（如雾、暮色、阴影），比普通的“darkly”更有一种“阴沉、迷蒙”的质感。"]}
{"word":"mirkiness","summary":{"en":"Mirkiness means darkness or unclear, hard-to-see (or hard-to-understand) conditions.","zh":"mirkiness 指“昏暗/朦胧不清”，也可比喻“信息不透明、难以理解”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Darkness, dimness, or obscurity (often because something is hard to see or understand).","zh":"黑暗；昏暗；朦胧不清（也可指事情难以看清或难以理解的“晦暗”）。"},"examples":[{"en":"The mirkiness of the alley made it hard to see who was there.","zh":"小巷里一片昏暗，很难看清是谁在那里。"},{"en":"There was a mirkiness to the story—important details were missing.","zh":"这个故事有些晦暗不明——关键细节缺失。"}]}],"synonyms":["darkness","dimness","gloom","obscurity","murkiness","haze","unclearness"],"phonetic":"/ˈmɝkinəs/","extraExplanation":["“mirkiness”来自形容词“murky /ˈmɝki/”（昏暗的、浑浊的、含糊不清的）加名词后缀“-ness”。它比常见的“darkness”更有“阴沉、朦胧、看不清/说不明”的感觉，常用于描写气氛、光线，也可比喻信息不透明。","在文学或较正式的描写中更常见；日常口语里人们更常说“darkness”“dimness”或“uncertainty/unclearness”。"]}
{"word":"mirkish","summary":{"en":"Mirkish means somewhat dark or gloomy, and can also mean slightly unclear (rare, literary/Scottish).","zh":"mirkish 指“有点黑暗/阴沉”，也可引申为“有点不清楚”（较少见，偏文学/苏格兰语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat dark or dim; a little gloomy.","zh":"有点黑暗的；昏暗的；略显阴沉的。"},"examples":[{"en":"The hallway was mirkish, so I turned on the light.","zh":"走廊有点昏暗，所以我把灯打开了。"},{"en":"At dusk the room felt mirkish and quiet.","zh":"黄昏时房间显得有点阴暗而安静。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figuratively, slightly unclear or hard to understand.","zh":"（比喻）有点不清楚的；略难理解的。"},"examples":[{"en":"His explanation was a bit mirkish to me.","zh":"他的解释对我来说有点不太清楚。"},{"en":"The rules are mirkish unless you read the examples.","zh":"如果不看例子，这些规则会显得有点难懂。"}]}],"synonyms":["dim","gloomy","dusky","murky","shadowy"],"phonetic":"/ˈmɝː.kɪʃ/","extraExplanation":["“mirkish”比较少见，多见于苏格兰英语/文学语境。它来自“mirk”（意为“黑暗、昏暗”）加上“-ish”（表示“有点……的”），所以整体就是“有点暗/有点阴沉”。在现代日常英语里，更常用的替代词有：dim, gloomy, dusky, murky。","文学上，“mirk”常用于营造阴郁氛围（如苏格兰题材作品或古风叙述）。如果你在诗歌、奇幻或历史小说里看到“mirkish”，通常是在强调一种“微暗但还没到完全黑”的感觉。"]}
{"word":"mirkly","summary":{"en":"Mirkly is a rare (often Scottish/literary) word meaning “darkly, dimly, gloomily,” and sometimes “somewhat dark.”","zh":"mirkly 是一个较少见（常见于苏格兰/文学）的词，表示“昏暗地、阴沉地、朦胧地”，有时也可作形容词表示“有些昏暗的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a dark, gloomy, or dim way; obscurely (rare, chiefly Scottish or literary).","zh":"以昏暗、阴沉或光线不足的方式；朦胧地（较少见，多见于苏格兰用法或文学语境）。"},"examples":[{"en":"The alley was lit so mirkly that we could barely see the steps.","zh":"小巷光线昏暗得很，我们几乎看不清台阶。"},{"en":"In the old tale, the forest loomed mirkly behind the village.","zh":"在那则古老故事里，森林在村庄后方阴沉沉地逼近。"}]},{"partOfSpeech":"adj.","definition":{"en":"Somewhat dark or shadowy; dim (rare).","zh":"有些黑暗的；阴影重的；昏暗的（较少见）。"},"examples":[{"en":"A mirkly evening settled over the coast.","zh":"海岸上落下一个昏暗的傍晚。"}]}],"synonyms":["darkly","dimly","gloomily","obscurely","murkily"],"phonetic":"/ˈmɝkli/","extraExplanation":["“mirkly”来自“mirk”（意为“黑暗、阴沉”，常见于苏格兰英语）。在现代日常英语里更常用的是“murkily”（adv. 朦胧地、昏暗地）或“darkly / dimly”。","如果你是想表达“水很浑、看不清”，通常用“murkily / murky”；“mirkly”更偏向文学描写的“天色/环境阴暗”。"]}
{"word":"mirkness","summary":{"en":"Mirkness means darkness or deep gloom, mainly used in literary or Scottish contexts.","zh":"Mirkness 指“黑暗/幽暗/阴沉”，多用于文学语境或带苏格兰英语色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"darkness or deep gloom; a state of little or no light (often literary or Scottish in flavor).","zh":"黑暗；幽暗；阴沉（常见于文学语境或带有苏格兰英语色彩）。"},"examples":[{"en":"The lantern was out, and we had to feel our way through the mirkness.","zh":"灯笼熄了，我们只好在黑暗中摸索前行。"},{"en":"In the mirkness of the forest, every sound seemed louder.","zh":"在森林的幽暗中，每一种声音都显得更响。"},{"en":"She stared into the mirkness beyond the window, lost in thought.","zh":"她望着窗外的昏暗，陷入沉思。"}]}],"synonyms":["darkness","gloom","dimness","murk","shadow","blackness"],"phonetic":"/ˈmɝːknəs/","extraExplanation":["“mirkness”源自“mirk”（意为“昏暗的、黑的”），在现代日常英语中较少使用，更常见的是“darkness”“gloom”。在苏格兰英语或文学写作里，它能营造更古朴、阴郁的氛围。","在诗歌/文学中，“mirkness”不仅指物理上的黑暗，也常隐喻困惑、忧郁或不安的心理状态（类似“gloom”）。"]}
{"word":"mirks","summary":{"en":"“Mirks” usually refers to dark, gloomy darkness (plural of “mirk”), and can also be the rare verb form meaning “become/make dark.”","zh":"“mirks”通常指“昏暗、阴沉的黑暗”（mirk 的复数），也可作较少见的动词形式，意为“变暗/使变暗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural form) Dark, dimness, or gloom; especially in Scottish or poetic English.","zh":"（复数形式）黑暗、昏暗、阴沉；尤用于苏格兰用语或诗歌/文学语体。"},"examples":[{"en":"The hills disappeared into the mirks after sunset.","zh":"日落后，群山消失在昏暗里。"},{"en":"In old stories, travelers fear the mirks of the forest.","zh":"在古老故事里，旅人害怕森林的阴暗。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular) To make dark; to grow dark (rare/poetic).","zh":"（第三人称单数）使变暗；变暗（较少见/偏诗性）。"},"examples":[{"en":"A storm rolls in and the sky mirks quickly.","zh":"暴风雨袭来，天空很快变得阴沉。"},{"en":"Smoke from the fire mirks the room.","zh":"火烟把房间熏得昏暗。"}]}],"synonyms":["darkness","gloom","dimness","murk","shadow"],"phonetic":"/mɝk/","extraExplanation":["“mirk”更常见于苏格兰英语与文学语境，现代日常英语里通常用“darkness / gloom / dimness”。","在诗歌或奇幻/哥特风格文本中，“mirk(s)”常用来营造阴森、神秘的氛围。"]}
{"word":"mirksome","summary":{"en":"Mirksome means annoying or troublesome in a slightly literary way.","zh":"mirksome 指“令人烦恼的、麻烦的”，语气较偏书面/文学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"annoying or troublesome; causing irritation or discomfort","zh":"令人烦恼的；麻烦的；让人不舒服的"},"examples":[{"en":"The mirksome delay made everyone impatient.","zh":"这段令人烦恼的延误让大家都不耐烦了。"},{"en":"He found the paperwork mirksome and tried to finish it quickly.","zh":"他觉得这些文书工作很麻烦，所以想快点做完。"}]}],"synonyms":["annoying","troublesome","irksome","irritating","vexing"],"phonetic":"/ˈmɝːksəm/","extraExplanation":["“mirksome”比较少见，语气略带书面或文学感，表示“令人厌烦/让人觉得不快”。日常口语里更常用 annoying / troublesome / irritating。","词源上与古英语/中古英语中表示“黑暗、阴郁”的词根（mirky）有关，因此也带一点“让人心情阴沉、压抑”的联想（但现代用法主要就是“烦人”。）"]}
{"word":"mirky","summary":{"en":"Mirky means dark and hard to see, or dirty/clouded; it can also mean unclear or confusing.","zh":"Mirky 指昏暗难辨或浑浊不清，也可引申为含糊不明、令人困惑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Dark, gloomy, and hard to see through; not clear because of low light or something blocking light.","zh":"昏暗的；阴沉的；（因光线不足或遮挡而）看不清的。"},"examples":[{"en":"We walked home in the mirky light after the streetlamps went out.","zh":"路灯熄灭后，我们在昏暗的光线中走回家。"},{"en":"The room felt mirky, so she opened the curtains.","zh":"房间很昏暗，所以她拉开了窗帘。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of liquid, air, or water) Dirty or clouded, making it hard to see clearly.","zh":"（指液体、空气或水）浑浊的；污浊的；不清澈的。"},"examples":[{"en":"After the storm, the river turned mirky and brown.","zh":"暴风雨过后，河水变得浑浊发褐。"},{"en":"Smoke made the air mirky inside the small kitchen.","zh":"烟雾让小厨房里的空气变得污浊。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of an idea or situation) Unclear, confusing, or difficult to understand.","zh":"（指想法或情况）不清楚的；含糊的；令人困惑的。"},"examples":[{"en":"The instructions were mirky, so I asked for a clearer explanation.","zh":"说明写得很含糊，所以我要求更清楚的解释。"},{"en":"Their motives remained mirky.","zh":"他们的动机仍然不明朗。"}]}],"synonyms":["murky","dim","gloomy","shadowy","cloudy","unclear","obscure"],"phonetic":"/ˈmɝːki/","extraExplanation":["“mirky”常见于英式英语与文学描写，氛围感很强，常用来渲染“阴沉、模糊、带点不安”的场景。日常口语里更常用的近义词是“dark / gloomy / dim”（昏暗）和“murky”（浑浊、阴暗）。","拼写上容易和“murky”混淆：两者意思非常接近；“murky”更常用，尤其用来形容水、空气或局势“浑浊/不透明”。"]}
{"word":"mirled","summary":{"en":"“Mirled” is a dialect word meaning “mottled/speckled,” often used in Scottish or Irish contexts.","zh":"“mirled”是方言词，意为“斑驳的/有斑点的”，常见于苏格兰或爱尔兰语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish/Irish English, dialect) Speckled or streaked with different colors; mottled.","zh":"（苏格兰/爱尔兰英语方言）带斑点的；有不同颜色条纹的；斑驳的。"},"examples":[{"en":"She wore a mirled sweater with gray and white threads.","zh":"她穿着一件灰白交织、带斑驳纹理的毛衣。"},{"en":"The sheep had a mirled face, darker around the eyes.","zh":"那只羊的脸是花斑的，眼睛周围颜色更深。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of the dialect verb “mirl”: to mark or mix with streaks or spots of color.","zh":"方言动词“mirl”的过去式/过去分词：使出现条纹或斑点；使颜色混杂成斑驳状。"},"examples":[{"en":"The fabric was mirled with blue dye.","zh":"那块布被蓝色染料染出了斑驳的纹理。"}]}],"synonyms":["mottled","speckled","streaked","marbled","dappled"],"phonetic":"/mɝld/","extraExplanation":["“mirled”在现代标准英语里不常见，更常见的对应表达是：mottled（斑驳的）、speckled（有斑点的）、streaked（有条纹的）、marbled（大理石纹的）。","在苏格兰语境里，“mirl/mirled”常用来形容羊的毛色或衣物的花纹；在文学或民俗描写中也会出现，用来营造质朴的地方色彩。"]}
{"word":"mirligo","summary":{"en":"“mirligo” is not a recognized English word; it’s likely a misspelling or a proper name.","zh":"“mirligo”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/proper name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/专有名词，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “mirligo” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“mirligo”——你能把它出现的句子发我吗？"},{"en":"If you meant “miracle,” the spelling is different.","zh":"如果你想写的是“miracle（奇迹）”，拼写是不一样的。"}]}],"extraExplanation":["“mirligo”在常见英语词典与语料中几乎没有记录，所以更像是：拼写误差（打字/听写导致）、专有名词（人名、地名、品牌、账号）、或外来词的音译。","你可以告诉我它出现的语境（整句/截图/来源语言），我就能更准确判断它可能对应哪个词。","一些可能的近似目标（按字形/读音猜测，不保证正确）：miracle（奇迹）、mirage（海市蜃楼）、Milagro（西语“奇迹”，常作人名/品牌名）、Merlino/Merlino（姓氏）、mirliton（法语来源词，指一种简易笛/糕点，在英语里较少见）。"]}
{"word":"mirliton","summary":{"en":"Mirliton can mean a kazoo-like instrument, a filled pastry shell, or (in Louisiana) the chayote squash.","zh":"mirliton 可指类似卡祖笛的嗡鸣乐器、可填馅的酥壳点心，或（在路易斯安那）指佛手瓜/合掌瓜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small musical instrument that makes a buzzing, kazoo-like sound when you hum or sing into it.","zh":"一种小型乐器，吹（或哼唱）进去会发出嗡嗡声，类似卡祖笛。"},"examples":[{"en":"He played a simple melody on a mirliton during the parade.","zh":"游行时他用mirliton吹了一段简单的旋律。"},{"en":"The child laughed at the funny buzzing sound of the mirliton.","zh":"孩子听到mirliton滑稽的嗡嗡声笑了起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(In cooking, especially French-influenced) A crisp pastry shell, sometimes shaped like a small tube, used to hold a sweet or savory filling.","zh":"（烹饪用语，尤指受法式影响）一种酥脆的点心外壳，有时做成小管状，用来填入甜或咸的馅料。"},"examples":[{"en":"For dessert, they served mirlitons filled with vanilla cream.","zh":"甜点端上来的是填了香草奶油的mirlitons。"},{"en":"The chef piped a savory filling into the mirliton shell.","zh":"厨师把咸味馅料挤进mirliton酥壳里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Regional, especially Louisiana) The chayote squash (a light-green pear-shaped vegetable).","zh":"（地区用法，尤指美国路易斯安那）佛手瓜/合掌瓜（一种浅绿色梨形蔬菜）。"},"examples":[{"en":"She made a Louisiana-style casserole with mirliton and shrimp.","zh":"她做了一道路易斯安那风味的佛手瓜（mirliton）虾仁砂锅。"},{"en":"In the market, mirlitons were piled next to okra and peppers.","zh":"市场里佛手瓜（mirlitons）堆在秋葵和辣椒旁边。"}]}],"synonyms":["kazoo (for the instrument sense)","chayote (for the Louisiana vegetable sense)"],"phonetic":"/ˈmɝːlɪtɑːn/","extraExplanation":["“mirliton”这个词在不同语境里意思差异很大：在音乐里常指类似卡祖笛的“嗡鸣膜”乐器；在烹饪里可指一种可填馅的酥壳点心；在路易斯安那等地日常用语里则常直接指“佛手瓜/合掌瓜（chayote）”。遇到它时，最可靠的方法是看上下文：parade/music → 乐器；dessert/pastry/filling → 点心酥壳；Louisiana/recipe/squash/shrimp → 佛手瓜。"]}
{"word":"mirlitons","summary":{"en":"“Mirlitons” can mean a kazoo-like buzzing instrument, a cream-filled pastry, or (in Louisiana) chayote used as a vegetable.","zh":"“mirlitons”可指类似卡祖笛的嗡嗡乐器、夹奶油的甜点，或（路易斯安那用法）佛手瓜（chayote）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small wind instrument (often a toy) that makes a buzzing sound when you hum or sing into it; similar to a kazoo.","zh":"一种小型吹奏玩具乐器，你对着它哼唱或说话时会发出“嗡嗡”的共鸣声；类似卡祖笛。"},"examples":[{"en":"The kids played mirlitons at the parade and made a loud buzzing sound.","zh":"孩子们在游行中吹着卡祖笛（mirlitons），发出很响的嗡嗡声。"},{"en":"She sang into a mirliton, turning her voice into a funny, nasal buzz.","zh":"她对着mirliton唱歌，把声音变成滑稽的鼻音嗡嗡声。"}]},{"partOfSpeech":"n.","definition":{"en":"A pastry (often a small, rolled puff pastry) filled with cream or other sweet filling.","zh":"一种甜点（常见为卷起的酥皮点心），通常内填奶油或其他甜馅。"},"examples":[{"en":"For dessert, they served mirlitons filled with vanilla cream.","zh":"甜点端上了夹着香草奶油的mirlitons。"},{"en":"The bakery’s mirlitons are flaky and lightly sweet.","zh":"那家面包店的mirlitons酥脆、甜度很轻。"}]},{"partOfSpeech":"n.","definition":{"en":"In Louisiana cooking, a vegetable also called chayote (a pale green squash-like fruit used as a vegetable).","zh":"（路易斯安那用法）一种蔬菜，也叫佛手瓜（chayote），浅绿色、像南瓜类的瓜果，常当蔬菜烹调。"},"examples":[{"en":"He made a Cajun dish with mirlitons, shrimp, and spices.","zh":"他用佛手瓜（mirlitons）、虾和香料做了一道卡真菜。"},{"en":"Stuffed mirlitons are a classic New Orleans side dish.","zh":"酿佛手瓜（stuffed mirlitons）是新奥尔良很经典的配菜。"}]}],"synonyms":["kazoo (instrument sense)","chayote (Louisiana sense)"],"phonetic":"/ˈmɝːlɪˌtɑːn/","extraExplanation":["“mirliton”这个词在不同地区/语境里指的东西不一样：在一般英语里较常见的是“玩具乐器（类似kazoo）”；在法国语境里也可指一种甜点；而在美国路易斯安那（尤其新奥尔良）则常指“佛手瓜（chayote）”。读到时可以根据上下文（音乐/甜点/烹饪）判断。"]}
{"word":"mirly","summary":{"en":"“Mirly” is not a standard modern English word; it’s usually a misspelling (often of “merely” or “miry”).","zh":"“mirly”通常不是现代英语标准单词，多半是拼写错误（常见可能是“merely”或“miry”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern dictionaries; most often a misspelling or a name. In everyday writing, it is likely meant to be “merely” (only/just) or “miry” (muddy).","zh":"现代英语里一般不算标准单词；更常见的是拼写错误或人名。在日常写作中，它很可能想写的是“merely”（仅仅/只是）或“miry”（泥泞的）。"},"examples":[{"en":"I couldn’t find “mirly” in a dictionary—did you mean “merely” or “miry”?","zh":"我在词典里找不到“mirly”——你想写的是“merely”还是“miry”？"},{"en":"If you mean “merely”: It was merely a joke.","zh":"如果你想写“merely”：那只是个玩笑。"},{"en":"If you mean “miry”: The path was miry after the rain.","zh":"如果你想写“miry”：下雨后小路很泥泞。"}]}],"synonyms":["(If you meant merely) just","(If you meant merely) only","(If you meant miry) muddy","(If you meant miry) boggy"],"phonetic":"/ˈmɝli/","extraExplanation":["“mirly”按拼读可能读作 /ˈmɝli/，但它本身不属于常见标准词汇，所以更关键的是结合语境判断你真正想表达的词：\n- 想表达“只是、仅仅”→ usually 用 merely\n- 想表达“泥泞的、沾满泥的”→ 用 miry\n如果你把包含“mirly”的整句话发我，我可以帮你精确判断应当改成哪个词。"]}
{"word":"mirna","summary":{"en":"Mirna is usually a female given name; it can also be a place name (notably in Slovenia).","zh":"Mirna 通常是女性人名；也可作地名（尤其与斯洛文尼亚有关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a personal name).","zh":"女性名字（人名）。"},"examples":[{"en":"Mirna introduced herself at the start of the meeting.","zh":"Mirna 在会议开始时做了自我介绍。"},{"en":"I’m not sure how to spell Mirna—M-I-R-N-A, right?","zh":"我不确定 Mirna 怎么拼——是 M-I-R-N-A 吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in some regions, such as Mirna (a town/municipality in Slovenia) and the Mirna River in Slovenia.","zh":"地名：在一些地区使用的名称，例如斯洛文尼亚的 Mirna（城镇/市镇）以及斯洛文尼亚的 Mirna 河。"},"examples":[{"en":"They traveled through Mirna while visiting Slovenia.","zh":"他们在游览斯洛文尼亚时途经 Mirna。"},{"en":"The Mirna River is part of the local landscape in central Slovenia.","zh":"Mirna 河是斯洛文尼亚中部当地景观的一部分。"}]}],"synonyms":["(name variants) Myrna","(related idea) Mira"],"phonetic":"/ˈmɪr.nə/","extraExplanation":["“Mirna”在斯拉夫语族的一些语言里常让人联想到“平静、安宁”（如与“mir/мир”相关的词根）。因此作为人名时，常带有“温和、平静”的联想。不过不同文化与家庭取名的来源可能不同。"]}
{"word":"miro","summary":{"en":"Miro most commonly means an online collaborative whiteboard tool; it can also refer to the Spanish artist Joan Miró.","zh":"Miro 最常指在线协作白板工具；也可以指西班牙艺术家胡安·米罗（Joan Miró）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Miro (also written “MIRO”) is an online collaborative whiteboard tool used for brainstorming, planning, and visual teamwork.","zh":"Miro（也常写作“MIRO”）是一款在线协作白板工具，用于头脑风暴、项目规划和可视化团队协作。"},"examples":[{"en":"We used Miro to brainstorm ideas for our presentation.","zh":"我们用 Miro 来为演讲做头脑风暴。"},{"en":"The designer shared a Miro board with the whole team.","zh":"设计师把一个 Miro 白板分享给了整个团队。"},{"en":"Can you add your notes to the Miro board before the meeting?","zh":"你能在开会前把你的笔记补充到 Miro 白板上吗？"}]},{"partOfSpeech":"n.","definition":{"en":"Miró usually refers to Joan Miró, a famous Spanish (Catalan) artist known for colorful, imaginative modern art.","zh":"Miró 通常指胡安·米罗（Joan Miró），一位著名的西班牙（加泰罗尼亚）艺术家，以色彩鲜明、富有想象力的现代艺术作品闻名。"},"examples":[{"en":"We studied Miró in art class this week.","zh":"我们这周在美术课上学习了米罗。"},{"en":"That painting reminds me of Miró’s playful shapes and colors.","zh":"那幅画让我想起米罗作品里俏皮的形状和色彩。"}]}],"synonyms":["online whiteboard","collaborative whiteboard"],"phonetic":"/miˈroʊ/","extraExplanation":["“Miro”（工具）是品牌名，发音常读作 /miˈroʊ/。","艺术家名字常写作 “Miró”（有重音符号 ó），英语里也常近似读作 /miˈroʊ/；中文一般译为“米罗”。"]}
{"word":"mirounga","summary":{"en":"Mirounga is the scientific genus name for elephant seals, and it can also be used to mean an elephant seal in formal contexts.","zh":"Mirounga 是“象海豹属”的科学名称；在正式语境中也可用来指“象海豹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus (group) of very large seals known as elephant seals","zh":"象海豹属（一个生物分类“属”，包含体型巨大的象海豹）"},"examples":[{"en":"Scientists study Mirounga to understand deep diving in marine mammals.","zh":"科学家研究象海豹属（Mirounga），以了解海洋哺乳动物的深潜能力。"},{"en":"Mirounga includes the northern and southern elephant seals.","zh":"象海豹属（Mirounga）包括北象海豹和南象海豹。"}]},{"partOfSpeech":"n.","definition":{"en":"an elephant seal (especially when used in scientific writing)","zh":"象海豹（尤其用于科学写作或正式语境中）"},"examples":[{"en":"A Mirounga bull can weigh several tons.","zh":"一只雄性象海豹（Mirounga）体重可达数吨。"},{"en":"The Mirounga hauled out on the beach to rest and molt.","zh":"这只象海豹（Mirounga）上岸到海滩休息并换毛。"}]}],"synonyms":["elephant seal","genus Mirounga"],"phonetic":"/məˈrʊŋɡə/","extraExplanation":["Mirounga 是拉丁化的科学名称，常见于动物学、生态学论文或纪录片解说中。日常英语里更常说 elephant seal（象海豹）。","象海豹属主要有两个现生物种：北象海豹（Mirounga angustirostris）与南象海豹（Mirounga leonina）。它们以“雄性鼻部像象鼻一样膨大”而得名。"]}
{"word":"mirror","summary":{"en":"“Mirror” means a reflective glass surface, and it can also mean to reflect or closely resemble something.","zh":"“mirror”既指“镜子”，也可作动词表示“映照/反映”，还可比喻为“写照、映像”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A smooth surface (usually glass) that reflects light and shows an image of what is in front of it.","zh":"镜子；一种光滑的（通常为玻璃）反射表面，能照出前方物体的影像。"},"examples":[{"en":"She looked in the mirror to fix her hair.","zh":"她照了照镜子，整理头发。"},{"en":"The bathroom mirror was foggy after the shower.","zh":"洗完澡后，浴室镜子起雾了。"}]},{"partOfSpeech":"v.","definition":{"en":"To reflect or show something clearly, like a mirror does.","zh":"反映；映照（像镜子一样清楚地呈现）。"},"examples":[{"en":"The calm lake mirrored the mountains.","zh":"平静的湖面映照出群山。"},{"en":"His actions mirror his father’s behavior.","zh":"他的行为反映出他父亲的作风。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation, place, or thing that reflects the qualities of another; a close copy or representation.","zh":"（比喻）映像；写照；与另一事物非常相似的复制品或体现。"},"examples":[{"en":"The novel is a mirror of life in that period.","zh":"这部小说是那个时代生活的写照。"}]}],"synonyms":["reflector","reflection","reflect","resemble"],"phonetic":"/ˈmɪrɚ/","extraExplanation":["“mirror”常用于比喻：a mirror of society（社会的一面镜子/写照）。英语里也常说“hold up a mirror to...”表示“揭示、让人看清现实或问题”。","文学里常把镜子当作象征：自我认识、真相与幻象、身份变化等主题（例如童话与哥特文学中常见的“镜中世界”意象）。"]}
{"word":"mirror image","summary":{"en":"A mirror image is either a left-right reversed reflection or something that is almost exactly the same as something else.","zh":"mirror image 可指镜子里的左右反向图像，也可引申为几乎一模一样的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reversed copy of something, as it would appear in a mirror (left and right are swapped).","zh":"镜像；像照镜子一样的反向图像（左右对调）。"},"examples":[{"en":"The text looked like a mirror image, so I held it up to a mirror to read it.","zh":"文字看起来像镜像一样，所以我把它对着镜子读。"},{"en":"In the mirror image, his raised right hand looked like his left hand.","zh":"在镜像里，他举起的右手看起来像左手。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone or something that is almost exactly the same as another person or thing; a very close match.","zh":"几乎一模一样的人或物；极其相似的对应物。"},"examples":[{"en":"Her new apartment is a mirror image of her old one—same layout, same light.","zh":"她的新公寓和旧公寓几乎一模一样——同样的格局，同样的采光。"},{"en":"The two reports are mirror images: they reach the same conclusions with different wording.","zh":"这两份报告几乎是镜像版本：措辞不同，但结论一致。"}]}],"synonyms":["reflection","reversed image","counterpart","near-duplicate","twin"],"phonetic":"/ˈmɪrɚ ˈɪmɪdʒ/","extraExplanation":["常见搭配：mirror-image reversal（镜像翻转）、mirror-image symmetry（镜面对称/镜像对称）、mirror-image letters（镜像字母）。","使用场景：在数学与科学里常说“左右互换”的反射；在日常表达里也常引申为“几乎完全相同”。","文化提示：英语里谈到“镜像世界/镜中世界”时，有时会联想到刘易斯·卡罗尔《Through the Looking-Glass》（《爱丽丝镜中奇遇记》）中“镜子另一边”的想象。"]}
{"word":"mirrored","summary":{"en":"“Mirrored” means “like a mirror image” (symmetrical or reflected), or it can be the past form of “mirror,” meaning “reflected or closely matched.”","zh":"“mirrored”可表示“镜像的/对称的/被反射的”，也可作动词 mirror 的过去式/过去分词，表示“反映或高度相似”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a mirror image; matching or symmetrical as if reflected in a mirror.","zh":"镜像的；对称的；像镜子反射出来一样相互对应的。"},"examples":[{"en":"The building has mirrored wings on both sides of the entrance.","zh":"这栋建筑在入口两侧有镜像般对称的两翼。"},{"en":"They wore mirrored outfits for the dance performance.","zh":"他们为舞蹈表演穿了镜像般一致的服装。"},{"en":"The lake created a mirrored view of the mountains.","zh":"湖面映出了群山的镜像景色。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mirror”: to reflect, copy, or closely match someone or something.","zh":"“mirror”的过去式/过去分词：反映；模仿；与……高度一致。"},"examples":[{"en":"Her tone mirrored her mother’s calm voice.","zh":"她的语气与母亲平静的声音如出一辙。"},{"en":"The new policy mirrored what other countries had already done.","zh":"这项新政策与其他国家早已采取的做法非常相似。"}]}],"synonyms":["reflected","symmetrical","matching","corresponding","echoed","duplicated"],"phonetic":"/ˈmɪrərd/","extraExplanation":["拼写小提示：美式英语里常见两种过去式拼写 “mirrored” 和 “mirrored”（更常用的是 “mirrored”，双写 r 来保持短元音 /ɪ/ 的读音）。"]}
{"word":"mirroring","summary":{"en":"Mirroring means copying or reflecting something—often another person’s behavior in communication, or making an exact data copy in technology.","zh":"Mirroring 指“镜像/模仿/映照”：常见于沟通中的镜像模仿，也指科技中的数据镜像备份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(communication/psychology) The act of copying another person’s words, tone, or body language to build connection or show empathy.","zh":"（沟通/心理学）“镜像模仿”：通过模仿对方的用词、语气或肢体语言来建立亲近感或表达共情。"},"examples":[{"en":"The counselor used mirroring to show she understood the client’s feelings.","zh":"咨询师用“镜像模仿”来表示她理解来访者的感受。"},{"en":"In interviews, subtle mirroring can make conversations feel more natural.","zh":"在面试中，轻微的镜像模仿能让对话更自然。"},{"en":"Be careful—too much mirroring can seem fake.","zh":"要注意——模仿过度可能显得不真诚。"}]},{"partOfSpeech":"n.","definition":{"en":"(technology) Keeping an exact copy of data on another device or server; data replication for backup or reliability.","zh":"（科技）“镜像/镜像备份”：在另一台设备或服务器上保留数据的完全副本，用于备份或提高可靠性。"},"examples":[{"en":"The company set up mirroring so the website wouldn’t go down if one server failed.","zh":"公司做了镜像配置，这样即使一台服务器故障，网站也不会宕机。"},{"en":"Disk mirroring protects files by writing the same data to two drives.","zh":"磁盘镜像通过把同一份数据写入两块硬盘来保护文件。"}]},{"partOfSpeech":"v.","definition":{"en":"The action of reflecting or showing something as if in a mirror; also the present participle of “mirror.”","zh":"（像镜子一样）反映/映照；也可作动词 mirror 的现在分词。"},"examples":[{"en":"The calm lake was mirroring the mountains.","zh":"平静的湖面映照着群山。"},{"en":"Her writing is mirroring the changes in society.","zh":"她的写作反映了社会的变化。"}]}],"synonyms":["imitation","reflection","mimicry","matching","replication","copying"],"phonetic":"/ˈmɪrərɪŋ/","extraExplanation":["“Mirroring（镜像模仿）”在跨文化沟通中要更谨慎：有些文化对“模仿”更敏感，尤其是明显模仿手势、口音或说话节奏，可能被理解为嘲讽或不尊重。更安全的做法是轻度同步：用相近的语速、简短复述对方的关键词（例如“你是说……对吗？”），而不是复制对方的口音或夸张动作。","在心理咨询与谈判语境里，mirroring 常与“active listening（积极倾听）”一起出现：通过复述（paraphrasing）、情绪命名（labeling emotions）来体现理解，比单纯模仿动作更自然、也更不易冒犯。"]}
{"word":"mirrorize","summary":{"en":"Mirrorize means to make something mirror-like, to reflect/represent clearly, or to imitate closely.","zh":"Mirrorize 指使某物具有镜面效果、清晰地反映/呈现，或对某物进行模仿。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make something act like a mirror; to give it a reflective, mirror-like surface or quality.","zh":"使某物具有镜子般的特性；使其表面或效果呈现反光、镜面感。"},"examples":[{"en":"The designer mirrorized the wall with a glossy finish to brighten the room.","zh":"设计师用高光泽的处理把墙面做成“镜面效果”，让房间更明亮。"},{"en":"Some photo apps can mirrorize an image so it looks like a reflection.","zh":"一些修图软件可以把图片“镜像化”，让它看起来像倒影。"}]},{"partOfSpeech":"vt.","definition":{"en":"To reflect or show something clearly, as if in a mirror; to represent closely.","zh":"如同镜子般清晰地反映或呈现；逼真地再现。"},"examples":[{"en":"The novel mirrorizes the loneliness of city life.","zh":"这部小说如同一面镜子，映照出都市生活的孤独。"},{"en":"Her expression mirrorized his fear.","zh":"她的表情清楚地映出了他的恐惧。"}]},{"partOfSpeech":"vt.","definition":{"en":"To imitate or copy the style, behavior, or structure of something.","zh":"模仿；照搬（风格、行为或结构）。"},"examples":[{"en":"New creators sometimes mirrorize popular trends to gain attention.","zh":"新创作者有时会照搬热门趋势来获得关注。"},{"en":"Don’t just mirrorize your classmates—develop your own voice.","zh":"别只是一味模仿同学——要形成自己的表达风格。"}]}],"synonyms":["reflect","mirror","mirror-image","make reflective","imitate","copy","echo"],"phonetic":"ˈmɪr.ə.raɪz","extraExplanation":["“mirrorize”不是最常见的日常用词，更常见的替代说法有：make reflective（让其有反光效果）、mirror / mirror-image（镜像化）、reflect（反映）、imitate / copy（模仿）。在设计、摄影/图像处理、或文学评论里更可能见到它。"]}
{"word":"mirrorlike","summary":{"en":"Mirrorlike means “like a mirror”: smooth and highly reflective.","zh":"mirrorlike 意为“像镜子一样的”：表面光滑、反光强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a mirror; very smooth, shiny, and reflective.","zh":"像镜子一样的；非常光滑、明亮并能清晰反光的。"},"examples":[{"en":"The lake was mirrorlike in the early morning, reflecting the mountains perfectly.","zh":"清晨时湖面像镜子一样平静，把群山倒映得一清二楚。"},{"en":"Her mirrorlike sunglasses hid her eyes.","zh":"她那副镜面般反光的太阳镜遮住了她的眼睛。"}]}],"synonyms":["reflective","glassy","shiny","polished"],"phonetic":"/ˈmɪrərˌlaɪk/","extraExplanation":["这个词常写作 mirror-like（带连字符），也可写作 mirrorlike（合写）。它多用于描写自然景物（如湖面、海面）或表面材质（如金属、玻璃、漆面）的“镜面反射”效果。","在文学描写中，mirrorlike 常用来营造“静、冷、清晰”的画面感；比如“mirrorlike water”不仅强调平滑，也暗示一种安静到几乎不真实的氛围。"]}
{"word":"mirrors","summary":{"en":"“Mirrors” can mean reflective surfaces (plural of mirror) or the verb “mirrors,” meaning reflects or closely matches.","zh":"“mirrors”既可指“镜子”（mirror 的复数），也可作动词表示“反射/映照”或“与……高度相似”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Reflective glass surfaces you look into to see your image; also devices used to reflect light or show a view.","zh":"（名词复数）镜子；也可指用于反射光线或观察视野的反射装置。"},"examples":[{"en":"There are mirrors on both sides of the hallway.","zh":"走廊两边都有镜子。"},{"en":"Bikes should have mirrors for safety.","zh":"自行车应配备后视镜以保证安全。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) Reflects an image or light; or closely matches/copies something (often an idea, feeling, or situation).","zh":"（动词第三人称单数）反射（影像或光线）；也指与某事高度相似/复制（常指想法、情绪或情境）。"},"examples":[{"en":"The lake mirrors the mountains at sunrise.","zh":"日出时，湖面倒映着群山。"},{"en":"Her story mirrors my own experience.","zh":"她的故事与我的经历很相似。"}]}],"synonyms":["reflect","show","duplicate","echo","resemble"],"phonetic":"ˈmɪrərz","extraExplanation":["“mirror”除了“镜子”的字面意思，也常用于比喻：a mirror of society（社会的一面镜子）表示某种作品或现象反映社会真实状况。","在写作里常见搭配：mirror + feelings/thoughts/reality（映照情绪/想法/现实），强调“反映”而不一定是“复制”。"]}
{"word":"mirrorscope","summary":{"en":"A mirrorscope is a mirror-based device—often a toy—that creates repeated reflections or patterns when viewed through it.","zh":"mirrorscope 指一种基于镜子的装置（常见为玩具），从中观看会产生重复反射或图案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or toy that uses mirrors to create repeated reflections or changing patterns when you look through it (often similar to a kaleidoscope).","zh":"一种利用镜子产生重复反射或变化图案的装置或玩具（常类似万花筒）。"},"examples":[{"en":"The child peered into the mirrorscope and watched the colors multiply into patterns.","zh":"孩子往镜像镜筒里一看，颜色被反射成一片片图案。"},{"en":"Artists sometimes use a mirrorscope to explore symmetry and repeated shapes.","zh":"艺术家有时会用镜像装置来探索对称与重复的形状。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) Any viewing or inspection instrument that relies on mirrors to help you see from a different angle or to examine something indirectly.","zh":"（较少见/技术用法）泛指任何依靠镜子改变视角、间接观察或检查的观测仪器。"},"examples":[{"en":"A simple mirrorscope can help inspect hard-to-see areas inside a machine.","zh":"一个简单的镜像观察器可以帮助检查机器内部难以看到的部位。"}]}],"synonyms":["kaleidoscope","mirror viewer","optical toy","periscope (in some contexts)"],"phonetic":"/ˈmɪrərskoʊp/","extraExplanation":["“mirrorscope”不是特别常见的通用词，更多时候会出现在产品名称、玩具名称，或较宽泛的描述里。日常英语里，如果指“用镜片/镜子看出图案”的玩具，人们更常说“kaleidoscope（万花筒）”。如果指“用镜子改变视线来观察”的工具，也可能用更具体的词，如“periscope（潜望镜）”或“inspection mirror（检视镜）”。"]}
{"word":"mirrory","summary":{"en":"Mirrory means “mirror-like” or “reflective.”","zh":"mirrory 指“像镜子一样的、能反光的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a mirror; reflective, shiny, or glassy in a way that shows clear reflections.","zh":"像镜子一样的；有反光效果的；光亮得能映出影像的。"},"examples":[{"en":"The lake looked mirrory at dawn, reflecting the mountains perfectly.","zh":"黎明时湖面像镜子一样，完美地倒映着群山。"},{"en":"After the rain, the street became mirrory under the streetlights.","zh":"雨后街道在路灯下变得亮得像镜面一样。"}]}],"synonyms":["mirror-like","reflective","shiny","glassy"],"phonetic":"/ˈmɪrəri/","extraExplanation":["“mirrory”在现代英语里比较少见，带一点文学/描写性（descriptive）色彩，常用来描绘水面、玻璃、金属等“像镜面一样反射”的质感。更常见的替代说法是“mirror-like”或“reflective”。"]}
{"word":"mirs","summary":{"en":"“mirs” most often means Russian village communes (plural of mir). Less commonly, it can mean multiple references to the space station Mir.","zh":"“mirs”最常指俄国的农民村社/公社（mir 的复数）；较少情况下可指对“和平号”空间站 Mir 的多次/多个提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mir: traditional Russian peasant village communes (especially in Imperial Russia), where land and some decisions were managed collectively.","zh":"mir 的复数：传统俄国（尤指沙俄时期）的农民村社/公社制度，由村社集体管理土地并共同决策部分事务。"},"examples":[{"en":"In some history books, you’ll read about mirs controlling how farmland was divided.","zh":"在一些历史书里，你会读到村社（mirs）如何决定农田的分配。"},{"en":"The reforms weakened the power of the mirs in many regions.","zh":"这些改革在许多地区削弱了村社（mirs）的权力。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of Mir: used to refer to more than one thing named “Mir,” most commonly the Soviet/Russian space station Mir (in comparisons or multiple references).","zh":"Mir 的复数：用于指多个名为“Mir”的事物；最常见是在对苏联/俄罗斯“和平号”空间站进行多次或多项提及/对比时使用。"},"examples":[{"en":"The documentary compared several Mir missions, and casually called them “the Mirs.”","zh":"纪录片对比了几次和平号（Mir）的任务，并口语化地称它们为“the Mirs”。"}]}],"synonyms":["communes","village communes"],"phonetic":"/mɪrz/","extraExplanation":["“mir”是从俄语借入英语的词。在俄语里“мир”常见义有“和平、世界”，但在英语历史语境中，mir更常特指一种俄国农村的“村社/公社”制度；因此mirs多出现在历史、社会制度相关的英文阅读中。"]}
{"word":"mirth","summary":{"en":"Mirth means cheerful amusement and laughter.","zh":"mirth 指欢乐的逗趣与笑声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Amusement and happy laughter; a light, joyful feeling that makes people smile or laugh.","zh":"欢乐与笑声；一种轻松愉快、让人想笑的心情。"},"examples":[{"en":"The room was filled with mirth after his silly joke.","zh":"他说了个傻傻的笑话后，房间里充满了欢乐的笑声。"},{"en":"Her face showed mirth as she watched the children play.","zh":"她看着孩子们玩耍，脸上露出愉快的笑意。"},{"en":"Their friendly teasing brought mirth to the long meeting.","zh":"他们友善的打趣给漫长的会议带来了轻松的欢乐。"}]}],"synonyms":["joy","laughter","amusement","glee","merriment"],"phonetic":"/mɝθ/","extraExplanation":["“mirth”常见于较正式或文学性的语境，比“fun / happiness”更强调“笑声、逗乐、轻松的欢乐气氛”。常见搭配：full of mirth（充满欢乐）、with mirth（愉快地）、bring mirth to...（给……带来欢乐）。在文学中常与“merry（欢乐的）”“glee（欢欣）”等词并列出现，用来描写节庆或热闹场景。"]}
{"word":"mirthful","summary":{"en":"Mirthful means full of happy laughter and cheerful amusement.","zh":"mirthful 指“充满欢笑、愉快逗乐的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of happy laughter; cheerfully amused.","zh":"充满欢笑的；愉快逗乐的。"},"examples":[{"en":"The room became mirthful after someone told a funny story.","zh":"有人讲了个有趣的故事后，房间里变得充满欢笑。"},{"en":"She gave a mirthful laugh when she saw the playful puppy.","zh":"看到那只爱玩的幼犬时，她开心地笑了起来。"}]}],"synonyms":["joyful","cheerful","jovial","merry","gleeful"],"phonetic":"/ˈmɝːθfəl/","extraExplanation":["“mirth”意为“欢笑、欢乐”，mirthful 就是“充满欢乐/笑声的”。语气比 happy 更偏向“笑出来的快乐”，常用于描写气氛（a mirthful crowd）或笑声（a mirthful laugh）。","常见搭配：mirthful laughter（笑声欢快）、mirthful mood（愉快的心情）、mirthful celebration（欢乐的庆祝）。","近义词细微区别：joyful 更偏“喜悦”；cheerful 更偏“心情明朗、乐观”；jovial 更偏“外向热情、爱开玩笑”（有点热闹）。"]}
{"word":"mirthfully","summary":{"en":"“Mirthfully” means “in a cheerful, amused way,” often with laughter.","zh":"“mirthfully”表示“愉快地、带着笑意地”，常强调轻松的欢乐与逗乐。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a happy, amused way; with cheerful laughter or lighthearted joy.","zh":"愉快地；带着逗乐或轻松的欢笑地。"},"examples":[{"en":"She laughed mirthfully at the joke.","zh":"她听到笑话后愉快地笑了起来。"},{"en":"The children ran mirthfully through the yard.","zh":"孩子们在院子里欢快地跑来跑去。"},{"en":"He spoke mirthfully, trying to ease the tension in the room.","zh":"他用轻松愉快的语气说话，想缓解房间里的紧张气氛。"}]}],"synonyms":["cheerfully","joyfully","gleefully","happily","laughingly"],"phonetic":"/ˈmɝːθfəli/","extraExplanation":["“mirthfully”来自名词“mirth”（欢乐、欢笑）。它比常见的“happily”更强调“笑意、逗乐、轻松的喜感”，常见于书面语或较文艺的表达。","语气提示：在正式或文学描写中用“mirthfully”很自然；日常口语里更常用“happily / cheerfully / with a laugh”。"]}
{"word":"mirthfulness","summary":{"en":"Mirthfulness means a light, cheerful happiness shown through smiling or laughter.","zh":"mirthfulness 指带着笑意的轻松愉快与欢乐气氛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cheerful amusement and light, happy laughter; a joyful mood","zh":"愉快的嬉笑与轻松的欢乐；一种充满笑意的心情"},"examples":[{"en":"Her mirthfulness made the whole room feel warmer and more welcoming.","zh":"她的愉快笑意让整个房间都显得更温暖、更友好。"},{"en":"The children’s mirthfulness turned a boring afternoon into a fun one.","zh":"孩子们的欢笑把一个无聊的下午变得很有趣。"},{"en":"He spoke with quiet mirthfulness, teasing his friend without being unkind.","zh":"他说话带着温和的愉悦感，开朋友玩笑却不刻薄。"}]}],"synonyms":["cheerfulness","merriment","jollity","good humor","joyfulness"],"phonetic":"/ˈmɝːθ.fəl.nəs/","extraExplanation":["“mirthfulness”较偏书面与文学色彩，常用来描写一种轻快、善意的欢乐气氛（而不一定是大笑）。日常口语里更常说“cheerfulness / happiness / good humor”。","词根提示：mirth（欢乐、嬉笑）+ -ful（充满……的）+ -ness（名词后缀），整体意思是“充满欢乐的状态”。","近义词细微差别：mirthfulness 更强调“嬉笑/逗趣的快乐”；cheerfulness 更像“持续的好心情”；joy 更偏“强烈的喜悦”。"]}
{"word":"mirthfulnesses","summary":{"en":"“Mirthfulnesses” is the plural form of “mirthfulness,” meaning multiple instances or kinds of cheerful, lighthearted laughter and good humor.","zh":"“mirthfulnesses”是“mirthfulness”的复数，指多种或多次出现的欢笑、愉快与轻松幽默的氛围/特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mirthfulness: the qualities or instances of being full of mirth (happy laughter, cheerfulness, and lighthearted humor).","zh":"mirthfulness（欢笑、愉快、轻松幽默的气氛/性格）的复数：指多种“充满欢乐与笑意”的特质或表现。"},"examples":[{"en":"The room’s mirthfulnesses rose and fell with each joke.","zh":"房间里的欢笑气氛随着每个笑话而起起落落。"},{"en":"In the novel, her quiet mirthfulnesses help soften tense conversations.","zh":"在小说中，她那种含蓄的欢快笑意缓和了紧张的对话。"}]}],"synonyms":["cheerfulness","joviality","merriment","good humor","lightheartedness"],"phonetic":"/ˈmɝθfʊlnəsɪz/","extraExplanation":["“mirthfulnesses”比较少见，通常更常用的是单数“mirthfulness”或不可数用法（例如：There was mirthfulness in the air. 空气中充满欢乐）。当作者想强调“多种表现/不同场合的欢乐感”时，才可能用复数。","词形结构：mirth（欢笑）+ -ful（充满……的）+ -ness（名词后缀）→ mirthfulness（欢乐/欢笑的特质）；再加复数 -es → mirthfulnesses。"]}
{"word":"mirthless","summary":{"en":"Mirthless means lacking joy or genuine laughter, often describing a forced or humorless mood.","zh":"mirthless 指缺乏欢乐或真诚笑意，常形容勉强的笑或毫无幽默、沉闷的氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not happy or amused; lacking laughter, warmth, or cheer.","zh":"不快乐的；不觉得好笑的；缺乏欢笑与愉快气氛的。"},"examples":[{"en":"He gave a mirthless laugh and changed the subject.","zh":"他干笑了一声（毫无喜色），然后换了话题。"},{"en":"The party felt quiet and mirthless after the bad news.","zh":"坏消息传来后，聚会变得安静而沉闷，没有欢乐。"}]}],"synonyms":["joyless","humorless","cheerless","gloomy","somber"],"phonetic":"/ˈmɝːθləs/","extraExplanation":["词源提示：mirth 表示“欢乐、笑声”，-less 表示“缺少……的”。所以 mirthless 直观含义就是“没有欢乐/笑声的”。","语气与使用场景：mirthless 常用来描写“笑但不真心”“表面轻松但内心沉重”的感觉，比 simply “sad” 更强调“缺乏欢快、幽默感”。","文学/叙述中常见搭配：mirthless laugh（干笑）、mirthless smile（勉强的微笑）、mirthless tone（冷淡无趣的语气）。"]}
{"word":"mirthlessly","summary":{"en":"“Mirthlessly” means “without joy or laughter; not cheerfully.”","zh":"“mirthlessly”表示“毫无欢乐或笑意地；不开心地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows no amusement, joy, or laughter; without cheer.","zh":"毫无欢乐地；不带笑意地；冷冷地（表现出没有开心或笑意）。"},"examples":[{"en":"He listened to the joke mirthlessly and changed the subject.","zh":"他面无笑意地听完那个笑话，就把话题岔开了。"},{"en":"She gave a mirthlessly polite smile and walked away.","zh":"她礼貌却毫无笑意地笑了笑，转身走开。"}]}],"synonyms":["joylessly","grimly","sombrely","without amusement"],"phonetic":"/ˈmɝːθləsli/","extraExplanation":["“mirth”意为“欢乐、笑声”，加上后缀“-less”（没有……的）变成“mirthless”（不快乐的），再加“-ly”构成副词“mirthlessly”。它常用来描写一种尴尬、勉强、或带点冷淡/讽刺的氛围。","语气对比：mirthlessly 表示“缺少欢乐”，不一定是愤怒；如果是更强烈的情绪，可以用 angrily（愤怒地）、bitterly（苦涩地）、coldly（冷淡地）。","写作中它常与 laugh/smile（笑）搭配，如 “laughed mirthlessly / smiled mirthlessly”，强调“笑了但并不开心”，有时带有黑色幽默或疲惫感。"]}
{"word":"mirthlessness","summary":{"en":"Mirthlessness means a lack of joy or laughter; a serious, humorless mood.","zh":"mirthlessness 指缺乏欢笑与愉快的状态，带有严肃、无幽默感的氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having no laughter, joy, or lightheartedness; humorlessness","zh":"缺乏欢笑或愉快的状态；不幽默、无欢乐"},"examples":[{"en":"There was a mirthlessness in his voice that made the joke fall flat.","zh":"他声音里带着一种缺乏欢乐的感觉，让这个笑话一点也不好笑。"},{"en":"The meeting’s mirthlessness showed how worried everyone was about the deadline.","zh":"会议上毫无轻松气氛，说明大家都很担心截止日期。"}]}],"synonyms":["joylessness","humorlessness","somberness","gloom","seriousness"],"phonetic":"/ˈmɝːθləsnəs/","extraExplanation":["“mirthlessness”来自名词 mirt h（欢乐、笑声）+ 后缀 -less（没有……的）+ 名词后缀 -ness（……的状态）。因此它强调的是一种“缺少欢乐/轻松氛围”的整体气氛或心理状态，常用于描写场景（room, meeting）或语气（tone, voice）。","在文学或叙事中，这个词常用来营造冷淡、压抑或严肃的氛围，与 warmth（温暖）、levity（轻松）形成对比。语感上比简单的 “sadness（悲伤）” 更偏向“没有笑意、没有幽默感”。"]}
{"word":"mirths","summary":{"en":"“Mirths” means happy laughter or cheerful joy (plural of “mirth”), often used in a slightly literary style.","zh":"“mirths”表示欢笑、愉快（“mirth”的复数），带一点书面/文学色彩，偶尔用来强调多次或不同的欢笑时刻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Happy laughter; amusement; cheerful joy (plural form of “mirth”).","zh":"欢笑；愉快；逗乐（“mirth”的复数形式）。"},"examples":[{"en":"The room was filled with mirths after his funny story.","zh":"他讲了个有趣的故事后，房间里充满了欢笑。"},{"en":"Holiday mirths echoed through the house.","zh":"节日的欢笑声在屋子里回荡。"}]},{"partOfSpeech":"n.","definition":{"en":"Separate occasions or expressions of mirth (less common; emphasizes different moments of laughter).","zh":"不同的欢笑时刻／各类欢乐的表达（较少见；强调“多次/多种”欢笑）。"},"examples":[{"en":"Their journey had its mirths and its troubles.","zh":"他们的旅程有欢笑，也有烦恼。"},{"en":"In the play, brief mirths interrupt the tension.","zh":"在这部戏里，短暂的欢笑打断了紧张气氛。"}]}],"synonyms":["laughter","merriment","joy","cheer","gaiety"],"phonetic":"/mɝːθs/","extraExplanation":["“mirth”是比较偏书面、文学感的词，比常见的“laughter / fun / joy”更典雅，常用来描写一种轻松、热闹、带笑声的快乐气氛。","“mirths”作为复数并不常见；多数时候英语更自然地说“mirth”（不可数）或直接用“laughter”。当你看到“mirths”时，通常是在文学或修辞里强调“多次欢笑/不同欢乐时刻”。"]}
{"word":"mirthsome","summary":{"en":"Mirthsome means cheerful and full of laughter; pleasantly humorous.","zh":"mirthsome 指“愉快、充满笑声的；带点幽默逗趣的”，语气较书面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of cheerful laughter; pleasantly funny or lighthearted.","zh":"充满欢笑的；愉快而有趣的；令人发笑的。"},"examples":[{"en":"The host’s mirthsome stories made everyone relax.","zh":"主持人那些逗趣的故事让大家都放松了。"},{"en":"They shared a mirthsome moment after a long, stressful day.","zh":"在漫长又紧张的一天之后，他们分享了一个愉快的瞬间。"},{"en":"Her mirthsome tone helped lighten the mood in the room.","zh":"她轻快逗趣的语气缓和了房间里的气氛。"}]}],"synonyms":["cheerful","merry","jovial","jocular","lighthearted"],"phonetic":"/ˈmɝːθsəm/","extraExplanation":["“mirthsome”来自名词“mirth”（欢乐、笑声）+ 形容词后缀“-some”（表示“充满……的”）。语气偏书面或文雅，比常见的“funny / cheerful / joyful”更有文学感。","常见搭配：mirthsome laughter（笑声欢快）、mirthsome mood（愉快的心情）、mirthsome tale/story（逗趣的故事）。"]}
{"word":"mirthsomeness","summary":{"en":"Mirthsomeness means cheerful, lighthearted happiness, often with laughter.","zh":"Mirthsomeness 指带着笑意的轻松愉快、欢笑的开心感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cheerful amusement; a lively, lighthearted happiness that often shows in laughter or joking","zh":"欢笑愉快；轻松活泼的开心情绪，常常会表现为笑声或玩笑"},"examples":[{"en":"Her mirthsomeness made the long meeting feel shorter.","zh":"她的欢快让冗长的会议显得没那么漫长。"},{"en":"The room filled with mirthsomeness as everyone started telling stories.","zh":"大家开始讲故事后，房间里充满了欢笑与愉悦。"},{"en":"Even on difficult days, he tried to keep a sense of mirthsomeness.","zh":"即使在艰难的日子里，他也努力保持一种轻松愉快的心情。"}]}],"synonyms":["cheerfulness","merriment","joviality","gaiety","good humor"],"phonetic":"/ˈmɝθsəmnəs/","extraExplanation":["“mirthsomeness”由“mirth（笑声、欢乐）+ -some（充满……的）+ -ness（名词后缀）”构成，语气偏正式或文学性，日常口语里更常用“cheerfulness / joy / humor”。"]}
{"word":"mirv","summary":{"en":"MIRV is a missile system where one ballistic missile carries multiple warheads that can strike different targets.","zh":"MIRV 指一枚弹道导弹携带多个可分别攻击不同目标的核弹头的分导系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of missile payload system in which one ballistic missile carries several nuclear warheads that can be aimed at different targets","zh":"（导弹的）多弹头分导系统：一枚弹道导弹携带多个核弹头，并可分别瞄准不同目标"},"examples":[{"en":"During the Cold War, both the U.S. and the USSR developed MIRVs to increase their nuclear striking power.","zh":"冷战时期，美国和苏联都发展了MIRV，以增强核打击能力。"},{"en":"Arms-control talks often discussed limits on MIRV-capable missiles.","zh":"军备控制谈判中常常讨论对具备MIRV能力的导弹设限。"}]}],"synonyms":["multiple-warhead missile","MIRV system","MIRVed missile"],"phonetic":"/mɝv/","extraExplanation":["MIRV 是缩写，全称为 Multiple Independently targetable Reentry Vehicle，常译为“多弹头分导再入飞行器/分导式多弹头”。这里的 reentry vehicle 指弹头在弹道末段“再入”大气层的部分。","MIRV 技术在历史上与核威慑、第二次打击能力以及“军备竞赛”密切相关，因为一枚导弹可对多个目标造成威胁，也使反导系统更难拦截。"]}
{"word":"mirvs","summary":{"en":"MIRVs are multiple warheads on one missile, each able to hit a different target.","zh":"MIRVs指一枚导弹搭载多个可分别攻击不同目标的弹头/再入飞行器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"MIRVs: multiple independently targetable reentry vehicles—technology where one ballistic missile carries several nuclear warheads that can be aimed at different targets.","zh":"MIRVs：多弹头独立再入飞行器（技术）——一种弹道导弹可携带多个核弹头，并能分别攻击不同目标。"},"examples":[{"en":"During the Cold War, both sides developed missiles with MIRVs.","zh":"冷战期间，双方都发展了搭载MIRVs的导弹。"},{"en":"Arms-control talks often discussed limits on MIRVs because they increased strike capability.","zh":"军控谈判常常讨论限制MIRVs，因为它会提高打击能力。"}]}],"synonyms":["multiple-warhead missiles","MIRV technology"],"phonetic":"/ˈmɝvz/","extraExplanation":["“MIRVs”通常以复数形式出现（读作“mirves”），因为它指的是“一枚导弹上携带的多个再入飞行器/弹头”的配置。","这是军事与国际关系语境中的缩写词：MIRV（单数）较少用；更常见写法是MIRVs（复数）。","在新闻与学术讨论中，MIRVs常与“核威慑”“军备竞赛”“战略稳定”“军控条约”等话题一起出现。"]}
{"word":"miry","summary":{"en":"Miry means very muddy, and in literary use it can also mean unpleasantly dirty or morally degraded.","zh":"miry 指“非常泥泞的”；在文学语境中也可引申为“肮脏不堪或道德卑劣的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with mud; muddy, wet, and dirty (often describing ground or roads).","zh":"泥泞的；沾满泥的（常形容地面或道路又湿又脏）。"},"examples":[{"en":"After the rain, the path became miry and hard to walk on.","zh":"下雨后，小路变得泥泞，走起来很困难。"},{"en":"Their shoes were miry from crossing the field.","zh":"他们穿过田地后，鞋子上沾满了泥。"},{"en":"We avoided the miry lane and took the paved road instead.","zh":"我们避开那条泥泞的小路，改走铺好的公路。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Unpleasantly messy or morally “dirty”; shameful or degrading.","zh":"（文学用法）肮脏不堪的；（引申）卑劣的、可耻的、令人堕落的。"},"examples":[{"en":"He wanted to escape the miry politics of the city.","zh":"他想逃离这座城市里肮脏的政治。"},{"en":"The novel describes characters trapped in miry corruption.","zh":"这部小说描写人物困在肮脏的腐败之中。"}]}],"synonyms":["muddy","boggy","swampy","sloppy","filthy (figurative)"],"phonetic":"/ˈmaɪri/","extraExplanation":["“miry”来自名词/动词“mire”（泥沼；使陷入泥沼），常见搭配有：miry road/path（泥泞的路）、miry boots/shoes（沾满泥的靴子/鞋）。在文学里，“mire/miry”也常被用作隐喻，表示“陷入困境或道德污浊”。"]}
{"word":"miryachit","summary":{"en":"“miryachit” is not a recognized standard English word; it’s likely a misspelling or a non-English term/name.","zh":"“miryachit”不是标准英语词；更可能是拼写错误或非英语词/名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word found in major dictionaries; it may be a misspelling, a name, or a word from another language/transliteration.","zh":"不是主流英语词典中的标准词；可能是拼写错误、人名，或来自其他语言/音译。"},"examples":[{"en":"I couldn’t find “miryachit” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“miryachit”——你能提供它出现的句子吗？"},{"en":"If you meant “myriad,” the spelling is different and the meaning changes.","zh":"如果你想写的是“myriad（无数的）”，拼写不同，意思也会变。"}]}],"extraExplanation":["“miryachit”看起来不像常见英语单词，可能是：\n1）拼写误差（例如你想写的是其他相近拼写的词）；\n2）人名/地名/网名；\n3）其他语言的音译（例如南亚语言、斯拉夫语言等的罗马化拼写）。\n\n如果你把它出现的上下文句子发来，或告诉我你想表达的中文意思/主题（比如“很多”“辛辣”“名字”等），我可以帮你锁定最可能的英文词，并给出标准拼写与用法。"]}
{"word":"Miryam","summary":{"en":"Miryam is a feminine given name, a variant spelling of Miriam/Maryam.","zh":"Miryam 是女性名字，是 Miriam/Maryam 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name; a spelling variant of Miriam/Maryam, used in several languages and cultures","zh":"女性名字；Miriam/Maryam（米利暗/玛丽亚姆）的拼写变体，在多种语言与文化中使用"},"examples":[{"en":"Miryam introduced herself and spelled her name for the receptionist.","zh":"米尔娅姆做了自我介绍，并为前台拼写了她的名字。"},{"en":"In the story, Miryam is a brave older sister who protects her family.","zh":"在故事里，米尔娅姆是一位勇敢的姐姐，保护着家人。"}]}],"synonyms":["Miriam","Maryam","Mariam"],"phonetic":"/ˈmɪriəm/","extraExplanation":["“Miryam”常被视为“Mir(i)am / Miriam / Maryam”的另一种转写方式；在不同语言里会出现不同拼法（如 Maryam、Mariam）。","该名字源自希伯来语“Mir(y)am”，在《圣经》中米利暗（Miriam）是摩西的姐姐；在犹太—基督教传统中较常见，而在阿拉伯语与伊斯兰文化圈里更常见对应形式“Maryam”（玛丽亚姆，亦指耶稣之母玛利亚）。","在英文语境中，别人可能更熟悉“Miriam”；使用“Miryam”时，口头或书面上常需要补充拼写以避免误读。"]}
{"word":"mirza","summary":{"en":"“Mirza” is a historical Persian-derived title for a prince/nobleman (and sometimes a scribe), and it is also used as a male name.","zh":"“Mirza”是源自波斯语的历史头衔（可指王子/贵族，有时也指文书），也常用作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical title in Persian- and Turkic-influenced cultures (especially in Iran and South Asia), used for a prince, nobleman, or high-ranking gentleman; in some contexts it can also mean a learned scribe or secretary.","zh":"（历史用语）“米尔扎”：波斯语及受突厥文化影响地区（尤指伊朗与南亚）的一种头衔，可指王子、贵族或地位较高的绅士；在某些语境中也可指受过教育的书记、文书或秘书。"},"examples":[{"en":"In old Mughal-era texts, “Mirza” is often placed before a nobleman’s name.","zh":"在莫卧儿时代的旧文献里，“Mirza”常放在贵族姓名之前。"},{"en":"The letter was signed by Mirza Karim, indicating his social rank.","zh":"信件由Mirza Karim署名，暗示他的社会身份或头衔。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name (and sometimes a family name), especially among Persian, Urdu, and related language communities.","zh":"男性名字（有时也作姓氏），在使用波斯语、乌尔都语及相关语言的社群中较常见。"},"examples":[{"en":"Mirza is a common first name in several South Asian communities.","zh":"Mirza在一些南亚社群中是常见的名字。"},{"en":"The author Mirza Asadullah Khan Ghalib is famous for Urdu poetry.","zh":"作家Mirza Asadullah Khan Ghalib因乌尔都诗歌而闻名。"}]}],"synonyms":["prince","nobleman","lord","title"],"phonetic":"/ˈmɪrzə/","extraExplanation":["“Mirza”源自波斯语传统称谓体系，历史上常与宫廷、官僚与贵族阶层相关。不同地区对它的位置与含义略有差异：有的放在名字前当作头衔，有的逐渐固定为姓氏或名字。","在南亚文化语境里，你可能会在文学与历史人物中见到它，例如乌尔都诗人“Mirza Ghalib（米尔扎·伽利布）”。"]}
{"word":"mirzas","summary":{"en":"“Mirzas” is the plural of “mirza,” a historical Persian/South Asian title for a noble, prince, or high official.","zh":"“Mirzas”是“mirza”的复数，指波斯/南亚历史语境中的头衔，可表示贵族、王子或高级官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of mirza) A nobleman, prince, or high-ranking official in Persian- and South Asian history; also used as an honorific title (similar to “sir” in some contexts).","zh":"（mirza 的复数）在波斯与南亚历史中指贵族、王子或高级官员；也可作敬称头衔（在某些语境下类似“先生/阁下”）。"},"examples":[{"en":"The old documents mention several mirzas serving at the Mughal court.","zh":"旧文献提到有几位 mirzas 在莫卧儿宫廷任职。"},{"en":"People addressed him respectfully as Mirza, but the record lists the mirzas who attended the meeting.","zh":"人们尊称他为 Mirza，但记录中列出了出席会议的 mirzas。"}]}],"synonyms":["nobleman","prince","court official","honorific title"],"phonetic":"/ˈmɪr.zə/","extraExplanation":["“Mirza”常见于波斯语世界以及南亚（如莫卧儿时期）的历史语境。它既可能表示出身/地位（如王族或贵族），也可能作为对有身份或受教育人士的称呼。不同地区、不同年代用法会有差异：有时更偏“头衔”，有时更接近“姓名的一部分”。","在英语文学与历史书写中，你可能会在关于波斯、印度次大陆、莫卧儿帝国或殖民时期的叙述里看到 mirza(s)；它通常带有时代与文化色彩，因此在现代日常英语里不算常用。"]}

