{"word":"MIT","summary":{"en":"MIT is the abbreviation for the Massachusetts Institute of Technology.","zh":"MIT是“麻省理工学院”（Massachusetts Institute of Technology）的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Massachusetts Institute of Technology, a world-known private research university in Cambridge, Massachusetts (near Boston), especially famous for science, engineering, and technology.","zh":"麻省理工学院（Massachusetts Institute of Technology），位于美国马萨诸塞州剑桥市（靠近波士顿）的著名私立研究型大学，以理工科、工程与科技领域闻名。"},"examples":[{"en":"She studies computer science at MIT.","zh":"她在麻省理工学院（MIT）读计算机科学。"},{"en":"MIT is well known for engineering and research.","zh":"MIT以工程与科研著称。"},{"en":"He attended an MIT lecture on artificial intelligence.","zh":"他去听了一场MIT关于人工智能的讲座。"}]}],"synonyms":["Massachusetts Institute of Technology"],"phonetic":"/ˌɛm aɪ ˈtiː/","extraExplanation":["“MIT”在英语里通常直接读字母：/ˌɛm aɪ ˈtiː/，日常交流中也常被称作“the Institute”（学院）。","校园在查尔斯河（Charles River）旁边，对面是波士顿市区；很多科技公司与实验室在周边聚集，因此“MIT”常和创新、创业（startups）、科研（research）联系在一起。","常见搭配：MIT Press（MIT出版社）、MIT Media Lab（媒体实验室）、MIT OpenCourseWare/OCW（开放课程）。"]}
{"word":"Mit","summary":{"en":"“mitt” most commonly means a thick glove (often for warmth or baseball). “MIT” (all caps) refers to the Massachusetts Institute of Technology.","zh":"“mitt”常指厚手套（多用于保暖或棒球）。“MIT”（全大写）指麻省理工学院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, thick glove (often without separate fingers) worn for warmth or for sports such as baseball","zh":"（保暖或运动用的）连指手套；（尤指棒球）手套"},"examples":[{"en":"Put on your mitts—it's freezing outside.","zh":"把连指手套戴上——外面冷得要命。"},{"en":"The catcher raised his mitt to receive the pitch.","zh":"捕手举起手套接投球。"}]},{"partOfSpeech":"n.","definition":{"en":"(MIT) the Massachusetts Institute of Technology, a well-known university in the U.S.","zh":"（MIT）麻省理工学院（美国著名大学）"},"examples":[{"en":"She studied computer science at MIT.","zh":"她在麻省理工学院学习计算机科学。"},{"en":"MIT is famous for engineering and research.","zh":"麻省理工学院以工程和科研闻名。"}]}],"synonyms":["glove","baseball glove"],"phonetic":"/mɪt/","extraExplanation":["“mitt”作“手套”时一般小写；“MIT”作学校名称时必须大写，读作字母：M-I-T。","“mitt”常见搭配：baseball mitt（棒球手套）、catcher’s mitt（捕手手套）。"]}
{"word":"mit","summary":{"en":"MIT usually refers to the Massachusetts Institute of Technology, a top U.S. university known for science and engineering.","zh":"MIT通常指“麻省理工学院”，是一所以理工科见长的美国顶尖大学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Massachusetts Institute of Technology, a well-known private research university in Cambridge, Massachusetts (near Boston).","zh":"麻省理工学院：美国马萨诸塞州剑桥市（波士顿附近）的一所著名私立研究型大学。"},"examples":[{"en":"She got accepted to MIT to study computer science.","zh":"她被麻省理工学院录取，去读计算机科学。"},{"en":"MIT is famous for engineering, science, and technology research.","zh":"麻省理工学院以工程、科学和科技研究闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Short for an MIT-related person, program, or campus context, depending on the sentence.","zh":"（非正式）可指与麻省理工相关的人、项目或校园语境，具体看句子。"},"examples":[{"en":"He’s MIT ’24 (Class of 2024).","zh":"他是麻省理工2024届毕业生。"},{"en":"An MIT lab published a new paper on robotics.","zh":"麻省理工的一家实验室发表了一篇新的机器人论文。"}]}],"synonyms":["Massachusetts Institute of Technology"],"phonetic":"/ˌɛm.aɪˈtiː/","extraExplanation":["“MIT”是首字母缩略词，读作字母：M-I-T（/ˌɛm aɪ ˈtiː/），不是读成一个单词。","在美国语境里，“MIT”几乎总是指“麻省理工学院”。如果你在德语或网络聊天中看到“mit”，它也可能是德语介词“with（和、与）”，但这不属于英语用法。"]}
{"word":"MIT's","summary":{"en":"“MIT’s” means “of MIT / belonging to MIT.”","zh":"“MIT’s”表示“MIT的 / 属于MIT的”。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"belonging to or related to MIT (the Massachusetts Institute of Technology); the possessive form of “MIT.”","zh":"属于或与麻省理工学院（MIT）有关的；“MIT”的所有格形式。"},"examples":[{"en":"MIT's campus is in Cambridge, Massachusetts.","zh":"MIT 的校园位于马萨诸塞州剑桥市。"},{"en":"MIT's researchers published a new study on robotics.","zh":"MIT 的研究人员发表了一项关于机器人技术的新研究。"},{"en":"I’m applying to MIT's graduate program.","zh":"我正在申请 MIT 的研究生项目。"}]}],"synonyms":["of MIT","MIT (as an attributive noun, e.g., MIT labs)"],"phonetic":"ˌɛm aɪ ˈti","extraExplanation":["“MIT’s”是缩写“MIT”加上所有格“’s”，用来表示所属关系，相当于“MIT的”或“of MIT”。","当缩写以字母读出时（M-I-T），写法仍然直接加“’s”：MIT’s labs（MIT的实验室）。在正式写作里也常见替换表达：the labs at MIT / the MIT labs。"]}
{"word":"mitaine","summary":{"en":"Mitaine means a fingerless glove (a French loanword often used in fashion or historical contexts).","zh":"mitaine 指“无指手套/露指手套”（源自法语，常见于时尚或历史服饰语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fingerless glove, often a knitted or soft glove that covers the hand and wrist but leaves the fingers (or fingertips) free","zh":"露指手套；无指手套（常为针织或柔软材质，包住手掌与手腕但露出手指或指尖）"},"examples":[{"en":"She wore wool mitaines so she could text without taking her gloves off.","zh":"她戴着羊毛无指手套，这样就能不脱手套发短信。"},{"en":"In the museum, the costume display included lace mitaines from the 1800s.","zh":"博物馆里，那套服饰展品包含一副19世纪的蕾丝无指手套。"}]}],"synonyms":["fingerless glove","fingerless gloves","hand-warmer","wristlet"],"phonetic":"/miˈtɛn/","extraExplanation":["“mitaine”来自法语，英语中多用于较“文艺/时尚”的语境，尤其指露指（fingerless）款；日常英语更常说“fingerless gloves”。","有时会把“mitaines”与“mittens”混淆：mittens（连指手套）通常把四根手指合在一个袋状空间里，而mitaines强调露出手指或指尖，便于写字、做手工、使用手机等。"]}
{"word":"mitakshara","summary":{"en":"Mitakshara refers to a famous Sanskrit legal commentary on the Yajnavalkya Smriti and also to the Hindu-law school/tradition associated with it, especially concerning inheritance and joint-family property.","zh":"Mitakshara 指一部著名的梵文法学注释（为《耶若那伐迦法典》作注），也指与该著作相关的印度教法学派/传统，尤涉及继承与家族共有财产制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hindu law) An influential medieval Sanskrit legal commentary on the Yājñavalkya Smṛti, traditionally attributed to Vijñāneśvara, especially known for explaining rules of inheritance (including the idea of inheritance by birth).","zh":"（印度教法）一部重要的中古梵文法学注释书，通常认为出自维吉尼耶什瓦拉（Vijñāneśvara），为《耶若那伐迦法典》（Yājñavalkya Smṛti）作注，尤以阐释继承规则（如“出生即享继承权”的观念）而著名。"},"examples":[{"en":"The Mitakshara is often studied to understand classical Hindu inheritance rules.","zh":"人们常通过《Mitakshara》来了解古典印度教继承规则。"},{"en":"In many textbooks, Mitakshara is introduced as a key commentary on the Yajnavalkya Smriti.","zh":"在许多教材中，Mitakshara 被介绍为《耶若那伐迦法典》的关键注释书。"}]},{"partOfSpeech":"n.","definition":{"en":"The Mitakshara school: a major tradition (school) of Hindu law associated with that commentary, historically contrasted with the Dayabhaga school, and linked with joint-family (coparcenary) property principles.","zh":"密多迦沙罗学派（Mitakshara school）：与该注释书相关的一大印度教法传统（学派），历史上常与 Dayabhaga 学派相对照，并与“联合家庭/共有家产（coparcenary）”原则相关。"},"examples":[{"en":"Under the Mitakshara school, ancestral property was traditionally treated as jointly owned within the family.","zh":"在 Mitakshara 学派下，祖产传统上被视为家族共同共有。"},{"en":"Courts and scholars often discuss Mitakshara and Dayabhaga as two classic approaches to succession.","zh":"法院与学者常把 Mitakshara 与 Dayabhaga 作为两种经典继承体系来讨论。"}]}],"synonyms":["Mitakshara school","Mitākṣarā","Hindu law (context-specific)"],"phonetic":"ˌmɪtəkˈʃɑːrə","extraExplanation":["Mitakshara 常见异拼为 Mitākṣarā（带长音与下加点等梵文转写符号）。英语资料里通常不加音标符号，直接写 Mitakshara。","它不仅指“一本书”，也常指“以该书为权威来源的一套法学传统/学派”。阅读语境中要看是讲文本（commentary）还是讲制度（school）。","在印度法律史语境里，Mitakshara 常与 Dayabhaga 并列比较，尤其涉及家族共有财产、继承/继嗣（succession）等概念。"]}
{"word":"mitanni","summary":{"en":"Mitanni was a Bronze Age kingdom in northern Mesopotamia/Syria, influential in Near Eastern politics.","zh":"米坦尼是青铜时代位于美索不达米亚北部/叙利亚一带的王国，在古代近东政治中影响很大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient kingdom in northern Mesopotamia and Syria (c. 16th–13th century BCE), known for a Hurrian-speaking population and strong influence in Near Eastern politics","zh":"米坦尼王国：古代近东的一个王国，位于美索不达米亚北部与叙利亚一带（约公元前16—13世纪），以胡里特人（Hurrian）为主体，并在当时的国际政治中有重要影响"},"examples":[{"en":"The Mitanni kingdom competed with Egypt and the Hittites for power in the region.","zh":"米坦尼王国曾与埃及和赫梯争夺该地区的势力。"},{"en":"Some ancient texts refer to Mitanni by another name: Hanigalbat.","zh":"一些古代文献用另一个名称指代米坦尼：哈尼加尔巴特（Hanigalbat）。"},{"en":"Archaeologists study Mitanni to better understand the Bronze Age Near East.","zh":"考古学家研究米坦尼，以更好理解青铜时代的古代近东。"}]}],"synonyms":["Hanigalbat"],"phonetic":"/mɪˈtɑːni/","extraExplanation":["“Mitanni”是一个历史专名，常出现在古代近东史（Ancient Near East）与青铜时代（Bronze Age）的阅读材料中。","米坦尼与赫梯（Hittites）、埃及（Egypt）以及亚述（Assyria）等强权之间的外交与战争很频繁，因此在历史叙述里常作为“地区霸权竞争”的代表案例。","语言与族群上，米坦尼多与胡里特人（Hurrians）相关；同时也常被提到其统治阶层可能带有印欧语系（Indo-European）名称元素，这一点在学术讨论中较常见。"]}
{"word":"mitannian","summary":{"en":"Mitannian means “a Mitanni person” or “related to the ancient Mitanni kingdom/culture.”","zh":"Mitannian 指“米坦尼人”，也可作形容词表示“米坦尼的/与米坦尼王国或文化相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the ancient kingdom/people known as the Mitanni (a Bronze Age state in northern Mesopotamia).","zh":"米坦尼人；指古代“米坦尼”（青铜时代、位于美索不达米亚北部一带）的居民/族人。"},"examples":[{"en":"Some tablets mention Mitannians alongside Egyptians and Hittites.","zh":"一些泥板文书把米坦尼人与埃及人、赫梯人并列提及。"},{"en":"Archaeologists study how Mitannians traded horses and chariots.","zh":"考古学家研究米坦尼人如何进行马匹与战车相关的贸易。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mitanni kingdom, its people, language, or culture.","zh":"米坦尼的；与米坦尼王国、其人民、语言或文化有关的。"},"examples":[{"en":"The museum has a small Mitannian seal impression on display.","zh":"博物馆展出了一个小型的米坦尼印章封泥。"},{"en":"She wrote a paper on Mitannian influence in Late Bronze Age diplomacy.","zh":"她写了一篇关于晚青铜时代外交中米坦尼影响的论文。"}]}],"synonyms":["Mitanni (in some contexts, as a label for the people/kingdom)"],"phonetic":"/mɪˈtæniən/","extraExplanation":["“Mitannian”是由“Mitanni（米坦尼）+ -an（英语常见后缀，表示‘……的/……人’）”构成的学术用词，常见于历史、考古与古代近东研究。","米坦尼王国通常被认为活跃于公元前二千纪中期，地理大致在今天叙利亚北部与土耳其东南一带；因此在通俗英语里不常见，但在学术文章里较常出现。"]}
{"word":"mitannish","summary":{"en":"Mitannish means “related to the ancient Mitanni (people/kingdom),” and rarely can also mean “the Mitanni language.”","zh":"Mitannish 指“与古代米坦尼（民族/王国）有关的”，少数情况下也可指“米坦尼人的语言”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Mitanni—an ancient kingdom/people in northern Mesopotamia and northern Syria (Late Bronze Age).","zh":"与米坦尼（Mitanni）有关的；指古代米坦尼王国/民族（青铜时代晚期，北美索不达米亚与叙利亚一带）的。"},"examples":[{"en":"The museum displayed Mitannish seals and jewelry from northern Mesopotamia.","zh":"博物馆展出了来自北美索不达米亚的米坦尼式（Mitannish）印章与珠宝。"},{"en":"Researchers compare Mitannish royal names with neighboring cultures’ naming patterns.","zh":"研究者把米坦尼的王名与周边文化的命名规律进行对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The language associated with the Mitanni people (used mainly in academic discussion).","zh":"（较少见）米坦尼人的语言；多用于学术语境。"},"examples":[{"en":"Only a small amount of evidence survives for studying Mitannish.","zh":"用于研究米坦尼语（Mitannish）的材料留存不多。"}]}],"synonyms":["Mitannian"],"phonetic":"/məˈtɑnɪʃ/","extraExplanation":["“Mitannish”比较少见，更多学术写作会用 **Mitannian**（同样表示“米坦尼的”）。","Mitanni（也常写作 Mittani）是青铜时代晚期的一个重要政权/族群，研究常涉及古代近东历史、楔形文字文献与人名/神名等。"]}
{"word":"mitapsis","summary":{"en":"Mitapsis is a rare biology term meaning the fusion of chromatin during cell conjugation, similar to synapsis.","zh":"Mitapsis 是一个很少见的生物学术语，指细胞接合过程中染色质的融合阶段，含义与 synapsis（联会）相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, biology) The fusion of chromatin during cell conjugation—essentially a late “joining” stage similar in meaning to synapsis.","zh":"（罕见，生物）细胞接合（conjugation）过程中染色质的融合阶段；意义上与“联会/结合”（synapsis）相近，指晚期的“合并”过程。"},"examples":[{"en":"In some older biology texts, mitapsis is described as the final fusion of chromatin after conjugation.","zh":"在一些较早的生物学文献中，mitapsis 被描述为接合后染色质的最终融合。"},{"en":"The author used mitapsis as a near-synonym of synapsis, focusing on the moment chromatin threads unite.","zh":"作者把 mitapsis 当作几乎等同于 synapsis 的词，强调染色质丝状结构结合的那一刻。"}]}],"synonyms":["synapsis","chromatin fusion"],"phonetic":"/maɪˈtæp.sɪs/","extraExplanation":["这个词非常少见，多见于较早期（偏历史性的）细胞学/原生生物学语境；现代教材里更常用的是 synapsis（联会）或直接描述“chromatin fusion（染色质融合）”。","词形可拆为 mita-（与 mitosis 同源，来自希腊语 mitos“线/经线”，暗示丝状结构）+ -apsis（“结合/连接”的含义），因此字面上有“线状结构的结合”之意。","如果你原本想查的是更常见的拼写，可能是 mitosis（有丝分裂）或 metaphase（中期）。你可以告诉我你是在课本、论文还是游戏里看到的，我也能帮你确认具体指哪个概念。"]}
{"word":"mitate","summary":{"en":"“Mitate” is usually a misspelling of “imitate,” meaning to copy someone or something.","zh":"“mitate”通常是“imitate”的误写，意思是模仿某人或某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to copy someone’s actions, speech, or style, often in order to learn, fit in, or entertain","zh":"模仿（他人的动作、说话方式或风格），常用于学习、融入或娱乐"},"examples":[{"en":"Children often imitate their parents’ behavior.","zh":"孩子常常会模仿父母的行为。"},{"en":"He tried to imitate the actor’s accent for fun.","zh":"他为了好玩试着模仿那位演员的口音。"},{"en":"The design imitates the look of natural stone.","zh":"这个设计模仿了天然石材的外观。"}]}],"synonyms":["imitate","mimic","copy","mirror","echo"],"phonetic":"/ˈmɪteɪt/","extraExplanation":["“mitate”在现代英语里通常被视为“imitate”的误写或少见变体。日常写作与考试中建议使用标准拼写“imitate”。"]}
{"word":"mitch","summary":{"en":"“Mitch” is most commonly a person’s name (short for Mitchell). In UK informal English, it can also mean to skip school/work without permission.","zh":"“Mitch”最常见是人名（Mitchell 的昵称）。在英式非正式用法中，也可指“逃学/旷工”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (a nickname for Mitchell); also used as a family name","zh":"男性名字（常为 Mitchell 的昵称）；也可作姓氏"},"examples":[{"en":"Mitch said he’d call me after work.","zh":"Mitch 说他下班后会给我打电话。"},{"en":"My neighbor Mitch is a firefighter.","zh":"我的邻居 Mitch 是一名消防员。"}]},{"partOfSpeech":"v.","definition":{"en":"(mainly UK, informal) to skip school or work without permission; to play truant","zh":"（主要英式，非正式）逃学；擅自旷工"},"examples":[{"en":"He mitched school to play video games.","zh":"他逃学去打电子游戏。"},{"en":"If you mitch work again, you could get in trouble.","zh":"如果你再旷工，可能会惹麻烦。"}]}],"synonyms":["Mitchell","skip (school)","play hooky","ditch (class)"],"phonetic":"/mɪtʃ/","extraExplanation":["在美国英语里，Mitch 最常见是人名（Mitchell 的昵称）。动词 mitch（“逃学/旷工”）更偏英式用法；在美式口语中更常说 skip school / play hooky / ditch class。","作为人名时，它通常给人比较口语、亲切的感觉；正式场合有时会用全名 Mitchell。"]}
{"word":"mitchboard","summary":{"en":"A rare nautical word for a deck support that holds a lowered mast.","zh":"一个罕见的航海词：指甲板上用于支撑放倒桅杆的托架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nautical) An upright timber or support on a ship’s deck that forms a crutch for holding a mast when it is lowered.","zh":"（航海／船舶用语）船甲板上的竖立木材或支架，用作“托架／叉架”，在桅杆放倒时用来支撑桅杆。"},"examples":[{"en":"When the crew lowered the mast, they rested it on the mitchboard to keep it steady.","zh":"船员把桅杆放倒后，把它搁在 mitchboard 上以保持稳定。"},{"en":"The old fishing boat still had a mitchboard near the fore end, used when the mast was down.","zh":"那艘老渔船前部仍有一个 mitchboard，用于桅杆放倒时支撑它。"}]}],"synonyms":["mast crutch","crutch (nautical)","mast support"],"phonetic":"/ˈmɪtʃˌbɔrd/","extraExplanation":["这是一个很冷门、偏历史的航海词，日常英语里几乎不会用到，更多见于船舶构造、航海史、模型船制作等语境。","有时会写成分开的形式 “mitch board”。如果你是在非航海语境里看到这个词，也可能是拼写误差（例如想写 whiteboard）。"]}
{"word":"Mitchell","summary":{"en":"Mitchell is most commonly a surname, and it is also used as a first name and as a place name.","zh":"Mitchell 最常见是姓氏，也可作名字，并用于一些地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname): a person’s last name.","zh":"（姓氏）米切尔：用作人的“姓”（最后的名字）。"},"examples":[{"en":"Her last name is Mitchell.","zh":"她的姓是米切尔。"},{"en":"Dr. Mitchell will see you at 3 p.m.","zh":"米切尔医生会在下午三点见你。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for boys and sometimes for girls.","zh":"（名字）米切尔：常见于男性、有时也用于女性的“名”（第一名字）。"},"examples":[{"en":"Mitchell goes by Mitch.","zh":"Mitchell 通常用昵称 Mitch。"},{"en":"Mitchell is a common first name in the U.S.","zh":"Mitchell 在美国是比较常见的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in English-speaking countries (for example, towns or counties called Mitchell).","zh":"（地名）米切尔：英语国家中一些城镇或地区的名称。"},"examples":[{"en":"They drove through Mitchell on their way west.","zh":"他们向西开车途中经过了米切尔镇。"}]}],"synonyms":["Mitch (nickname)"],"phonetic":"/ˈmɪtʃəl/","extraExplanation":["“Mitchell”最初多见于英语姓氏，来源与古法语/中古英语有关，常被解释为源自人名“Michael”（迈克尔）的变体，含义常被引申为“像上帝一样的人？”（Who is like God?）。","文化提示：这是非常常见的英美姓氏。你可能会见到一些知名人物使用该姓，例如作家 Margaret Mitchell（《飘/乱世佳人》作者）等。"]}
{"word":"mitchell","summary":{"en":"Mitchell is most commonly a surname, and it can also be a first name (often shortened to Mitch).","zh":"Mitchell 最常见是姓氏，也可以作名字（常简称 Mitch）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common English-language family name (surname), used to identify a person’s family line; it also appears in many place names, schools, and businesses.","zh":"常见的英语姓氏（家族姓），用于表示一个人的家族来源；也常见于地名、学校名和公司名中。"},"examples":[{"en":"My teacher’s last name is Mitchell.","zh":"我老师的姓是 Mitchell。"},{"en":"Have you met Dr. Mitchell yet?","zh":"你见过 Mitchell 医生了吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), more common for males but sometimes used for females.","zh":"名字（名），更常用于男性，但有时也用于女性。"},"examples":[{"en":"Mitchell is starting college this fall.","zh":"Mitchell 今年秋天要上大学。"},{"en":"Her name is Mitchell, but she goes by Mitch.","zh":"她叫 Mitchell，不过大家叫她 Mitch。"}]}],"phonetic":"/ˈmɪtʃəl/","extraExplanation":["“Mitchell”多源自中古英语/古法语形式（如 Michel），在一些语源解释中与“大的、伟大的”相关；在苏格兰等地区也可能与人名“Michael”的变体有关。","常见昵称：Mitch（更口语、更亲近）。写邮件或正式场合，通常用 Mitchell 更稳妥。"]}
{"word":"mitchella","summary":{"en":"Mitchella is a plant genus (best known for partridgeberry), and it can also mean a plant from that genus or the dried herb used historically.","zh":"Mitchella 指一种植物属（最有名的是鹧鸪莓），也可泛指该属植物，或旧时指其干燥草药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of low, creeping evergreen plants (in the coffee family, Rubiaceae), best known for the species partridgeberry (Mitchella repens)","zh":"（大写）一种匍匐生长的常绿植物属（茜草科/咖啡科同科：Rubiaceae），其中最有名的是“鹧鸪莓”（Mitchella repens）"},"examples":[{"en":"In botany class, we learned that Mitchella is a genus in the coffee family (Rubiaceae).","zh":"在植物学课上，我们学到 Mitchella 属属于茜草科（Rubiaceae）。"},{"en":"Mitchella repens spreads as a small groundcover in shady forests.","zh":"Mitchella repens 会在林下阴处作为小型地被植物匍匐扩展。"}]},{"partOfSpeech":"n.","definition":{"en":"any plant belonging to the genus Mitchella (especially partridgeberry)","zh":"Mitchella 属的任何一种植物（尤指鹧鸪莓）"},"examples":[{"en":"A patch of mitchella was growing under the pine trees.","zh":"松树下长着一片鹧鸪莓（mitchella）。"}]},{"partOfSpeech":"n.","definition":{"en":"the dried plant of partridgeberry, historically used in herbal medicine","zh":"（药用旧称）鹧鸪莓的干燥全草，过去曾用于草药用途"},"examples":[{"en":"Older herbals mention mitchella as a traditional remedy, though modern use varies.","zh":"一些早期草药书会提到 mitchella 作为传统用药，但现代使用情况不一。"}]}],"synonyms":["partridgeberry","Mitchella repens"],"phonetic":"/mɪˈtʃɛlə/","extraExplanation":["拼写提示：作为植物属名时常写作大写 **Mitchella**；作为普通名（泛指该属植物或干燥药材）可以小写 **mitchella**。","词源背景：Mitchella 这个属名来自 18 世纪的植物学家 John Mitchell，用于纪念他对北美植物研究与交流的贡献。"]}
{"word":"mite","summary":{"en":"Mite usually means a very tiny arachnid (like dust mites). Informally, it can also mean a very small amount.","zh":"mite 通常指“螨”（非常微小的蛛形动物，如尘螨）。非正式用法中也可表示“一点点/小不点儿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small creature related to spiders (an arachnid), often living in dust, soil, plants, or on animals; some types can cause allergies or irritation","zh":"螨（与蜘蛛同类的节肢动物）；非常微小，常见于灰尘、土壤、植物或动物身上；有些会引发过敏或皮肤刺激"},"examples":[{"en":"Dust mites can trigger allergies in some people.","zh":"尘螨会引发一些人的过敏。"},{"en":"The vet checked the dog for ear mites.","zh":"兽医检查了这只狗有没有耳螨。"},{"en":"These plants were damaged by spider mites.","zh":"这些植物被叶螨（红蜘蛛）损害了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a tiny amount or a very small person/thing","zh":"（非正式）一点点；小不点儿（指非常小的人或事物）"},"examples":[{"en":"Add just a mite more sugar.","zh":"再加一点点糖。"},{"en":"He was only a mite when he started playing the piano.","zh":"他开始弹钢琴时还是个小不点儿。"}]}],"synonyms":["(animal) acarid","(informal: small amount) bit","(informal: small amount) little","(informal: small amount) smidgen"],"phonetic":"/maɪt/","extraExplanation":["“mite”作为“螨”时是常见科学/生活用词：dust mite（尘螨）常与过敏相关；spider mite（叶螨/红蜘蛛）常见于园艺语境；ear mite（耳螨）常见于宠物护理。","“a mite”表示“一点点”较口语化，带轻松语气；在更正式的表达中可用“a little”“a bit”。"]}
{"word":"mitella","summary":{"en":"Mitella most commonly refers to a plant genus called miterwort/bishop’s caps; more rarely (from Latin) it can mean a headband or an arm sling.","zh":"Mitella 最常指一种植物属（miterwort/bishop’s caps）；更少见时（源自拉丁语）可指头带或手臂吊带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually capitalized) A genus of small flowering plants in the saxifrage family (Saxifragaceae), commonly called **miterwort** or **bishop’s caps**.","zh":"（通常首字母大写）一种虎耳草科（Saxifragaceae）的小型开花植物属，英文常称 **miterwort** 或 **bishop’s caps（主教帽花）**。"},"examples":[{"en":"Mitella species often grow in cool, moist woodlands.","zh":"Mitella 属的植物常生长在凉爽、湿润的林地里。"},{"en":"The wildflower guide listed Mitella (miterwort) as a spring-blooming plant.","zh":"野花图鉴把 Mitella（miterwort）列为春季开花植物。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare; from Latin) A small head covering/headband; also used historically to mean a **sling** (a bandage used to support an injured arm).","zh":"（罕见；源自拉丁语）小型头巾/头带；也曾用于指 **吊带**（托住受伤手臂的绷带带子）。"},"examples":[{"en":"In older medical Latin, mitella could refer to an arm sling.","zh":"在较早的医学拉丁语里，mitella 可以指手臂吊带。"}]}],"synonyms":["miterwort","bishop’s caps"],"phonetic":"/məˈtɛlə/","extraExplanation":["在英语里你更常见到的是 **Mitella（首字母大写）**，因为它是植物的“属名”（学名的一部分）。小写 **mitella** 多半是在讨论其拉丁语词源或非常专业/历史性的用法。","词源上常解释为“**小主教帽**”（来自 *mitra* 加上指小的词尾 *-ella*），因为花或果实形状被认为像主教的帽子。"]}
{"word":"miteproof","summary":{"en":"Miteproof means designed to keep mites—especially dust mites—out of materials like bedding or fabric.","zh":"Miteproof 指“防螨的”，常用于寝具或布料，表示能阻止（尘）螨进入或滋生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent mites (especially dust mites) from getting into or living in something, such as fabric, bedding, or a cover","zh":"防螨的；能阻止螨虫（尤其是尘螨）进入或滋生于某物（如布料、寝具或罩套）"},"examples":[{"en":"We bought a miteproof mattress cover to reduce dust-mite allergies.","zh":"我们买了防螨床垫套来减少尘螨过敏。"},{"en":"The pillowcase is labeled miteproof and washable.","zh":"这个枕套标注为防螨且可清洗。"}]}],"synonyms":["mite-resistant","dust-mite-proof","allergen-barrier (for dust mites)"],"phonetic":"/ˈmaɪtˌpruːf/","extraExplanation":["“miteproof”常见于商品说明（如床垫套、枕套、羽绒被内胆外层布料）。它通常表示织物孔隙更细密，或经过特殊处理，从而让尘螨不易穿透、藏匿或繁殖；但并不等于“完全无尘螨”，仍需配合清洗、控湿等措施。"]}
{"word":"miter","summary":{"en":"Miter (also spelled mitre) means a bishop’s ceremonial hat, or an angled joint/cut used to fit two pieces together neatly; it can also be a verb meaning “to cut at an angle.”","zh":"miter（也写作 mitre）既可指主教的礼冠，也可指木工/装修中的“斜接/斜切”，并可作动词表示“把……斜切”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a special head covering (often tall and pointed) worn by some Christian bishops during religious ceremonies","zh":"（某些基督教）主教在宗教仪式中佩戴的礼冠（常为高而尖的帽子）"},"examples":[{"en":"In the ceremony, the bishop wore a mitre and carried a staff.","zh":"在仪式中，主教戴着礼冠，手持牧杖。"},{"en":"The painting shows a saint in a mitre, which suggests he was a bishop.","zh":"这幅画里圣人戴着礼冠，暗示他是一位主教。"}]},{"partOfSpeech":"n.","definition":{"en":"a joint where two pieces meet at an angle, cut so their ends fit neatly together (common in picture frames and trim)","zh":"斜接（两个部件以角度相接的接合处；常见于画框、装饰线条等）"},"examples":[{"en":"The corners of the frame are held together with tight miter joints.","zh":"画框的四角用紧密的斜接缝拼合在一起。"},{"en":"He measured carefully so the miter would line up perfectly at 45 degrees.","zh":"他仔细测量，确保斜接能以45度完美对齐。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cut or form an angled edge so two pieces can join neatly","zh":"把……斜切（使两个部件能整齐拼接）"},"examples":[{"en":"They mitered the trim at the corners to make a clean finish.","zh":"他们在转角处把装饰条斜切，使收口更利落。"},{"en":"If you miter the ends, the joint will look smoother than a straight cut.","zh":"如果把两端斜切，接缝会比直切看起来更平整。"}]}],"synonyms":["mitre","miter joint","bevel (related)","angled joint","diagonal cut"],"phonetic":"/ˈmaɪtɚ/","extraExplanation":["拼写提示：英式拼法常写作 **mitre**（多见于“主教礼冠”的宗教含义）；美式拼法更常写作 **miter**（在木工/装修里的“斜接”含义尤其常见）。两种拼法通常都能理解，但在不同语境里会有偏好。","读音与重音：重音在第一个音节（MI-ter）。","相关词：**miter box**（斜切盒/斜切槽盒）、**miter saw**（斜切锯/斜切锯台）、**miter joint**（斜接缝/斜接榫）。"]}
{"word":"mitered","summary":{"en":"Mitered means cut or joined at an angle (often 45°) so pieces meet neatly at a corner; it’s also the past form of miter.","zh":"mitered 指（常为45度）斜切/斜接，使材料在拐角处整齐对接；也可作动词 miter 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cut or joined at an angle (usually 45°) so two pieces fit together neatly, especially at a corner.","zh":"（通常以45度）斜切或斜接，使两块材料在拐角处严密、整齐地拼接在一起。"},"examples":[{"en":"The picture frame has mitered corners, so the edges meet cleanly.","zh":"这个相框是斜接角的，所以边缘拼得很整齐。"},{"en":"We used mitered joints for the baseboards to make the corner look smooth.","zh":"我们用踢脚线的斜接来处理拐角，让整体看起来更顺。"},{"en":"A mitered border can make the design look more polished.","zh":"斜接的边框能让设计看起来更精致。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “miter” (also spelled “mitre”): to cut or join at an angle so pieces meet at a corner.","zh":"动词 miter（英式拼写 mitre）的过去式/过去分词：把材料斜切或斜接，使其在角部对接。"},"examples":[{"en":"He mitered the trim pieces before installing them around the door.","zh":"他先把装饰线条斜切好，再安装到门框四周。"},{"en":"The carpenter had mitered both ends to match the angle of the corner.","zh":"木匠把两端都斜切了，以匹配拐角的角度。"}]}],"synonyms":["beveled","angled","joined at an angle"],"phonetic":"ˈmaɪtərd","extraExplanation":["“mitered / mitred”常见于木工、装修、装框、瓷砖收边与裁缝（如布料边角处理）等语境。美式英语更常写 miter/mitered，英式英语更常写 mitre/mitred。","在日常学习里可以把 mitered 理解为“斜角拼接的”。它强调的是“角度切割＋在拐角处无缝对齐”的效果，而不只是单纯的“斜着切”。","相关常见搭配：mitered corners（斜接角）、mitered joint（斜接）、miter saw（斜切锯/角度锯）。"]}
{"word":"miterer","summary":{"en":"miterer = a tool/machine (or person) that makes miter (angled) cuts to form neat corner joints.","zh":"miterer 指用于做斜角（对接斜切）切割的工具/机器，或指从事斜角接合、斜切的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tool or machine used to make miter (angled) cuts, especially for forming miter joints in woodworking.","zh":"（木工等）用来做斜角（对接斜切）切割的工具或机器，常用于制作斜角接合。"},"examples":[{"en":"He used a miterer to cut perfect 45-degree corners for the picture frame.","zh":"他用一台斜角切割工具把相框的四个角切成完美的 45 度。"},{"en":"This miterer makes cleaner cuts than my old hand saw.","zh":"这台斜角切割工具比我旧的手锯切得更干净。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who miters—someone who makes miter joints or cuts angles to fit pieces together.","zh":"做斜角接合的人；把材料切成斜角以拼接的人。"},"examples":[{"en":"A skilled miterer can make the seams look almost invisible.","zh":"熟练的斜角接合工能让接缝看起来几乎看不见。"}]}],"synonyms":["miter saw","miter box","miter-cutting tool","mitering machine"],"phonetic":"/ˈmaɪtərər/","extraExplanation":["“miterer”来自动词/名词“miter”（英式常拼作“mitre”）+ “-er”（表示“做……的人/物”）。在美式英语里，木工语境更常见的是说具体工具名，如“miter saw（斜切锯）”“miter box（斜切盒）”，而“miterer”相对少见，但在词典中是规范词。","“miter”还有“主教礼帽”的意思（宗教用语），但“miterer”通常不指与礼帽相关的人或物，更多还是指木工斜切/斜角接合的工具或操作者。"]}
{"word":"miterers","summary":{"en":"Miterers are (1) people who wear a ceremonial miter (often bishops), or (2) people who make miter joints in carpentry.","zh":"miterers 指（1）戴主教冠的人（常指主教等），或（2）制作斜接的人（木工/装裱等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who wear a miter (a tall ceremonial hat), especially bishops or other high-ranking clergy.","zh":"戴主教冠（高尖礼帽）的人，尤指主教或其他高级神职人员。"},"examples":[{"en":"In the painting, the miterers stand near the altar during the ceremony.","zh":"在这幅画里，戴主教冠的人在仪式中站在祭坛附近。"},{"en":"The procession included miterers and other clergy in formal robes.","zh":"游行队伍里有戴主教冠的人，以及穿着礼服的其他神职人员。"}]},{"partOfSpeech":"n.","definition":{"en":"People who cut or form a miter joint (a 45-degree angled joint), especially in carpentry or framing.","zh":"制作斜接（通常为45度）的人，尤指木工或装裱/框架制作人员。"},"examples":[{"en":"Skilled miterers can make corners meet cleanly with almost no gap.","zh":"熟练的斜接工能让转角严丝合缝，几乎没有缝隙。"},{"en":"The shop hired two miterers to speed up picture-frame production.","zh":"那家工坊雇了两名斜接工来加快画框生产。"}]}],"synonyms":["bishops","clergy","carpenters","framers","joiners"],"phonetic":"/ˈmaɪtərərz/","extraExplanation":["“miterers”是复数形式，单数常写作 **miterer**（也可见拼写 **mitrer**）。它来自名词/动词 **miter**。","宗教含义里，**miter/mitre**指主教等在礼仪场合佩戴的帽子；英式拼写更常见 **mitre**，美式更常见 **miter**。","木工含义里，**to miter**表示把材料切成斜角以做“斜接”，例如相框、踢脚线、门框的转角。"]}
{"word":"miterflower","summary":{"en":"Miterflower is a (less common) name for miterwort—small woodland wildflowers, often in the genus Mitella.","zh":"miterflower 是（较少见的）俗称，通常指 miterwort（主教帽草／主教帽花），多为 Mitella 属的林下小型野花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A plant known as a miterwort, especially a species in the genus *Mitella* (small woodland plants with tiny, often fringed flowers).","zh":"（植物）“主教帽花／主教帽草”（miterwort），尤指*Mitella*（米特拉草属）的一些林下小型开花植物，花常很小、花瓣边缘呈细裂流苏状。"},"examples":[{"en":"In early spring, you might spot miterflowers blooming on shady forest floors.","zh":"早春时，你可能会在阴湿的林地地面看到 miterflower 开花。"},{"en":"The guide labeled this white, fringed wildflower as a miterflower (miterwort).","zh":"图鉴把这种白色、流苏状花瓣的野花标注为 miterflower（miterwort）。"}]},{"partOfSpeech":"n.","definition":{"en":"More specifically, the common name for particular North American wildflowers such as two-leaved miterwort (*Mitella diphylla*), also called “bishop’s cap.”","zh":"更具体地说：一些北美野花的俗名，例如二叶主教帽草（*Mitella diphylla*），也常被叫作“bishop’s cap（主教帽）”。"},"examples":[{"en":"Two-leaved miterflower (*Mitella diphylla*) thrives in moist, rich woodland soil.","zh":"二叶 miterflower（*Mitella diphylla*）适合生长在湿润、肥沃的林地土壤里。"}]}],"synonyms":["miterwort","mitrewort","bishop’s cap","Mitella"],"phonetic":"/ˈmaɪtərˌflaʊər/","extraExplanation":["“miter- / mitre-”指主教戴的尖顶礼帽（mitre），这些植物的果实或花形被认为像“主教帽”，所以出现了 bishop’s cap、miterwort 等名字。","在英语里更常见的叫法通常是 **miterwort**（英式拼写 **mitrewort**）或直接用学名 **Mitella**；**miterflower** 相对少见，很多时候只是把“miter + flower”当作直观的别名来用。","如果你是在自然观察/园艺语境里看到这个词，通常指林下耐阴的小型多年生野花；具体是哪一种，往往需要结合地区与拉丁学名确认。"]}
{"word":"mitergate","summary":{"en":"A mitergate is a two-leaf canal lock gate that closes in a V-shape pointing upstream.","zh":"mitergate 指船闸里由两扇门叶组成、合拢成朝上游“V”形的人字闸门。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of canal lock gate made of two hinged leaves that swing shut to meet in a V-shape pointing upstream, using water pressure to help seal the gate.","zh":"（运河等的）人字闸门；由两扇门叶组成的船闸闸门，关闭时在中间合拢成朝上游方向的“V”形，利用水压帮助密封。"},"examples":[{"en":"The lock operator closed the mitergate, and the water pressure held the two leaves tightly together.","zh":"闸门管理员关上了人字闸门，水压把两扇门叶紧紧压合在一起。"},{"en":"Engineers inspected the mitergate hinges before allowing boats to pass through the canal.","zh":"工程师检查了人字闸门的铰链后，才允许船只通过船闸。"}]}],"synonyms":["miter gate","mitre gate","lock gate"],"phonetic":"ˈmaɪtɚˌɡeɪt","extraExplanation":["“mitergate”也常写作分开的 **miter gate**；英式拼写通常是 **mitre gate**。","它属于船闸（lock）结构的一部分：两扇门从两侧向中间转动合拢，形成“人”字/“V”字形，水流压力会把门叶越压越紧，从而更容易保持不漏水。","不要和动词 **mitigate**（减轻、缓和）混淆：两者拼写相近，但意思完全不同。"]}
{"word":"mitering","summary":{"en":"Mitering is cutting/joining pieces at matching angles (often 45°) so they fit neatly at a corner.","zh":"Mitering 指把材料切成相配的斜角（常为45°），以便在拐角处整齐拼接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of cutting or joining two pieces at an angle (usually 45°) so they fit together neatly, especially for corners in wood trim or picture frames","zh":"“斜角拼接”的过程：把两段材料切成斜角（常见为45°），让它们在拐角处严丝合缝地拼在一起（常用于木线条、相框边框等）"},"examples":[{"en":"Careful mitering makes the corners of the frame look clean and professional.","zh":"仔细的斜角拼接能让相框的拐角看起来干净又专业。"},{"en":"The carpenter double-checked the mitering before gluing the pieces together.","zh":"木匠在把木条粘合前又检查了一遍斜角是否切得准确。"}]},{"partOfSpeech":"vt.","definition":{"en":"present participle of “miter”: to cut the ends of two pieces at matching angles so they meet at a corner","zh":"动词“miter”的现在分词：把两段材料的末端切成相配的斜角，使其在拐角处拼接"},"examples":[{"en":"He is mitering the baseboards to fit the room’s corners.","zh":"他正在把踢脚线切成斜角，好贴合房间的拐角。"},{"en":"When you’re mitering, measure twice and cut once.","zh":"切斜角时，要“量两次再切一次”。"}]}],"synonyms":["miter cut","angle cutting","miter jointing"],"phonetic":"/ˈmaɪtərɪŋ/","extraExplanation":["“mitering”多见于木工、装修、相框制作等场景，核心概念是“斜切后在角上拼接”。最常见的是两段各切45°，拼成90°的拐角。","美式拼写通常是 miter / mitering；英式拼写常见 mitre / mitring。两者意思相同，只是拼写地区差异。","注意不要和“metering”（计量、配给/控制流量，如 fuel metering）混淆；两者发音和意思都不同。"]}
{"word":"miters","summary":{"en":"“Miters” usually means angled corner joints in carpentry (like picture frames); it can also mean bishops’ ceremonial hats, or the verb form “miters” = makes a miter joint.","zh":"“Miters”通常指木工里的**斜接角/斜接处**（如相框拐角）；也可指主教戴的**主教冠**；作动词时表示“做斜接”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **miter**: a corner joint where two pieces meet at an angle (often 45°), common in picture frames, trim, and molding.","zh":"（miter 的复数）**斜接/斜角接合**：两块材料以一定角度（常见为 45°）拼接成拐角的接合方式，常用于相框、踢脚线、线条等。"},"examples":[{"en":"The carpenter cut perfect **miters** for the door trim.","zh":"木工为门边线条切出了非常标准的**斜接角**。"},{"en":"This frame has tight **miters** with no gaps.","zh":"这个相框的**斜接处**很紧密，没有缝隙。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of **miter**: a tall ceremonial hat worn by bishops and some other church leaders.","zh":"（miter 的复数）**主教冠**：主教及部分教会领袖在仪式中佩戴的高帽。"},"examples":[{"en":"In the ceremony, the bishops wore white **miters**.","zh":"在仪式上，主教们戴着白色的**主教冠**。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of **miter** (verb): to join two pieces by cutting matching angled ends.","zh":"（动词 miter 的第三人称单数）**做斜接**：把两块材料的末端切成相配的角度并拼接起来。"},"examples":[{"en":"He **miters** the corners before he nails the trim in place.","zh":"他先把角**斜接好**，再把线条钉上去。"}]}],"synonyms":["miter joints","mitred corners","angled joints","bevel joints","mitres (UK spelling)"],"phonetic":"/ˈmaɪtɚ/","extraExplanation":["“miter”在美式英语中更常见；英式拼写常写作“mitre”。两者意思相同，发音也通常相同。","木工语境里常见搭配：miter joint（斜接）、miter cut（斜切）、miter saw（斜切锯/斜切锯台）。","教会语境里的 miter 源自宗教服饰传统；日常英语里更常见的还是木工/装修的用法。"]}
{"word":"miterwort","summary":{"en":"Miterwort is a small woodland wildflower (often *Mitella*), also called bishop’s cap.","zh":"Miterwort 指一种林下小野花（常为 *Mitella*），也叫“主教帽”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small woodland wildflower (especially in the genus *Mitella*) with tiny, often fringed flowers; also called “bishop’s cap.”","zh":"一种林地野花（尤指锦葵草属 *Mitella* 等），花朵细小、常呈流苏状；也常被称为“主教帽（bishop’s cap）”。"},"examples":[{"en":"We spotted miterwort along the shaded stream bank in early spring.","zh":"我们在初春时沿着阴凉的溪岸看到了 miterwort。"},{"en":"Miterwort is easy to miss because its flowers are small but delicate.","zh":"miterwort 很容易被忽略，因为它的花很小却很精致。"}]}],"synonyms":["bishop’s cap","mitrewort"],"phonetic":"ˈmaɪtərˌwɝt","extraExplanation":["“miterwort”由“miter/mitre（主教冠、礼冠）+ wort（古英语中指‘植物/草药’）”组成。它之所以叫这个名字，常被解释为其果实或结构在形状上让人联想到主教的礼冠；“wort”在许多植物名里都出现（如 St. John’s wort）。","在北美语境里，miterwort 常特指 *Mitella*（锦葵草属/虎耳草科相关类群）的林下小花；在自然观察或园艺文章中也可能写作 “mitrewort”。"]}
{"word":"mites","summary":{"en":"Mites are tiny spider-like creatures; the word can also mean “a tiny amount,” mainly in “not a mite.”","zh":"mites 指螨虫（极小的类蜘蛛生物）；也可指“丝毫、一点点”，多见于“not a mite”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Very small creatures related to spiders and ticks (tiny arachnids). Some live on plants or animals; others live in dust inside homes.","zh":"螨虫（与蜘蛛、蜱同类的极小型节肢动物）。有的生活在植物或动物身上，有的生活在室内灰尘中。"},"examples":[{"en":"Dust mites can trigger allergies for some people.","zh":"尘螨可能会引发一些人的过敏。"},{"en":"The gardener treated the roses for spider mites.","zh":"园丁给玫瑰处理了红蜘蛛（叶螨）的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A very small amount of something (used mostly in the phrase “not a mite”).","zh":"一点点、丝毫（多用于短语“not a mite”，表示“一点也不”）。"},"examples":[{"en":"He didn’t worry a mite about the exam.","zh":"他对考试一点也不担心。"}]}],"synonyms":["tiny arachnids","dust mites","spider mites","a tiny bit (sense 2)"],"phonetic":"/maɪts/","extraExplanation":["“mite”表示“螨虫”时，常见搭配有：dust mites（尘螨，常与过敏相关）、spider mites（叶螨/红蜘蛛，常危害植物）。日常生活里最常听到的是 dust mites。","“not a mite”属于较老派、带点口语或文学色彩的用法，相当于“not at all / not one bit（一点也不）”。现代口语更常说“not at all / not a bit”。"]}
{"word":"mithan","summary":{"en":"Mithan is a large ox (gayal/mithun) from South & Southeast Asia, related to the gaur.","zh":"Mithan指一种大型牛（gayal/mithun），分布于南亚与东南亚，和印度野牛（gaur）近缘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large ox (gayal/mithun), native to the hilly forests of South and Southeast Asia, often considered a semi-domesticated form related to the gaur","zh":"一种大型牛科动物（也叫gayal / mithun），分布于南亚与东南亚的丘陵森林地区，常被认为与印度野牛（gaur）近缘、带有半驯化特征"},"examples":[{"en":"In Northeast India, some communities traditionally keep mithan as valuable livestock.","zh":"在印度东北部，一些社群传统上饲养mithan，把它当作很有价值的家畜。"},{"en":"The mithan is closely related to the gaur and looks like a sturdy wild ox.","zh":"mithan与gaur关系很近，看起来像一头结实的野牛。"}]}],"synonyms":["gayal","mithun"],"phonetic":"ˈmɪθən","extraExplanation":["“mithan”也常见拼作 **mithun**，指同一种动物（中文资料里有时译作“米塘牛/密坦牛”，也有人直接用“gayal”音译）。","在一些地区，这种动物不只是经济用途，也带有社会文化意义（例如作为财富象征、礼物或仪式中的祭牲）。","如果你是在别的语境里看到“mithan”（例如人名、地名、公司名），告诉我原句/上下文，我可以帮你判断是不是同一个意思。"]}
{"word":"mither","summary":{"en":"“Mither” usually means to pester or nag someone (especially in Scottish/British English). It can also mean a fuss/worry, and in Scottish dialect it can mean “mother.”","zh":"“mither”通常指（尤指苏格兰/英式口语中）烦扰、纠缠、唠叨别人；也可指烦恼/慌乱；在苏格兰方言里还可表示“母亲”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(mainly British, especially Scottish English) to annoy, bother, or pester someone—often by talking repeatedly, worrying, or asking again and again; to “nag.”","zh":"（主要英式，尤指苏格兰英语）烦扰、纠缠、唠叨（常指反复说、反复问、一直担心而让别人心烦）；相当于“nag / bother”。"},"examples":[{"en":"Stop mithering me—I said I’ll do it later.","zh":"别一直烦我了——我说了我会晚点做。"},{"en":"She kept mithering her brother about borrowing his bike.","zh":"她一直缠着她哥哥，想借他的自行车。"},{"en":"Don’t mither your guests with too many questions.","zh":"别用太多问题去打扰客人。"}]},{"partOfSpeech":"n.","definition":{"en":"a fuss, worry, or troublesome bother; a state of being upset or agitated (often in phrases like “in a mither”).","zh":"烦恼、麻烦、焦虑；（常用于短语）一阵慌乱/心烦（如 in a mither）。"},"examples":[{"en":"There’s no need to make a mither about it.","zh":"没必要为这事大惊小怪/瞎烦恼。"},{"en":"He was in a right mither when he couldn’t find his keys.","zh":"他找不到钥匙时可慌了/烦得很。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) “mother.”","zh":"（苏格兰方言）母亲；“mother”的方言形式。"},"examples":[{"en":"I’m going to see my mither this weekend.","zh":"我这周末要去看我妈。"}]}],"synonyms":["bother","pester","nag","harass","fuss"],"phonetic":"/ˈmɪðɚ/","extraExplanation":["“mither”最常见的学习价值是动词用法：表示“（用反复唠叨/纠缠）去烦某人”。语气通常偏口语、带一点不耐烦，适合用在熟人之间，但在正式场合不太常用。","名词用法常出现在固定搭配里：in a mither（心烦意乱/手忙脚乱），make a mither（小题大做、为小事烦恼）。","在苏格兰英语里，mither 还可以直接表示“mother（母亲）”。这个用法更偏方言与文化语境，阅读英剧/苏格兰题材作品时更容易遇到。注意别把它和标准英语 mother 混用到正式写作里。"]}
{"word":"mithers","summary":{"en":"“Mithers” most commonly means “bothers/pesters” in Northern English/Scottish informal speech; it can also mean a person who keeps fussing.","zh":"“mithers”最常见是在英格兰北部/苏格兰方言里表示“烦扰/纠缠（第三人称单数）”；也可指“爱唠叨、爱烦人的人”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(chiefly Northern England & Scotland, informal) to annoy, pester, or fuss over someone; to bother someone with small worries or repeated talk.","zh":"（主要用于英格兰北部和苏格兰，非正式）烦扰、纠缠；为小事反复唠叨/瞎操心而打扰别人。"},"examples":[{"en":"Stop mithering me—I’m trying to study.","zh":"别一直烦我——我在学习。"},{"en":"She kept mithering about the trip details all week.","zh":"她一整周都在为旅行细节唠叨个不停。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who keeps bothering others or fussing repeatedly (often used jokingly).","zh":"爱烦人、爱唠叨的人（常带玩笑语气）。"},"examples":[{"en":"Don’t be a mither—let them decide.","zh":"别当个烦人精——让他们自己决定。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname; also widely recognized as “(Waylon) Smithers,” a character from *The Simpsons* (note: that is “Smithers,” not “Mithers”).","zh":"姓氏；也常让人联想到《辛普森一家》里的“史密瑟斯（Smithers）”（注意：那是 Smithers，不是 Mithers）。"},"examples":[{"en":"People sometimes mishear “Smithers” as “Mithers.”","zh":"有人会把“Smithers”听成“Mithers”。"}]}],"synonyms":["bother","pester","nag","fuss","harass"],"phonetic":"/ˈmɪðərz/","extraExplanation":["“mither”在英式方言里很常见（尤其英格兰北部、苏格兰），语气通常是抱怨对方“老来烦我/别唠叨了”。美式英语里不算常用，所以在美国语境中看到“mithers”时，也可能是拼写、听写错误（例如把“Smithers”写错）。","词形上：mither（原形）→ mithers（第三人称单数：He/She mithers…；或名词复数：two mithers）。"]}
{"word":"mithra","summary":{"en":"Mithra is an ancient Indo-Iranian deity name, often associated with covenants and sometimes linked to the Roman figure Mithras.","zh":"Mithra（密特拉）是古代印欧—伊朗体系的神名，常与契约相关；也常被拿来与罗马时期的 Mithras（密特拉斯）联系比较。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mithra: an ancient Indo-Iranian deity associated with agreements (covenants), friendship, and later (in some traditions) the sun/light.","zh":"密特拉：古代印欧—伊朗体系中的神祇，常与契约（盟约）、友谊相关；在部分传统中也与太阳/光明联系在一起。"},"examples":[{"en":"In some ancient Iranian traditions, Mithra was seen as a protector of oaths and agreements.","zh":"在一些古代伊朗传统中，密特拉被视为誓言与契约的守护者。"},{"en":"The name Mithra appears in discussions of Indo-Iranian mythology and early religious history.","zh":"“Mithra（密特拉）”这个名字常出现在印欧—伊朗神话与早期宗教史的讨论中。"}]},{"partOfSpeech":"n.","definition":{"en":"Mithra (often connected with Mithras): a figure linked to the Roman mystery religion commonly called Mithraism.","zh":"密特拉（常与 Mithras/密特拉斯相关）：与罗马时期的神秘宗教（常称“密特拉教”）有关的人物/神祇形象。"},"examples":[{"en":"Some Roman-era inscriptions refer to Mithras, a name closely related to Mithra.","zh":"一些罗马时期的铭文提到 Mithras（密特拉斯），这个名字与 Mithra（密特拉）密切相关。"},{"en":"Researchers compare Mithra in Iranian contexts with Mithras in Roman contexts.","zh":"研究者会对比伊朗语境中的 Mithra 与罗马语境中的 Mithras。"}]}],"synonyms":["Mithras","Mitra"],"phonetic":"/ˈmɪθrə/","extraExplanation":["“Mithra”多见于学术/历史语境，是专有名词，常写作首字母大写。","名称在不同文化与时代里会出现不同拼写与形象：如梵语/古印度语境常见 Mitra（米特拉），罗马语境常见 Mithras（密特拉斯）。","如果你是在游戏、小说或现代作品里看到“mithra”，它也可能是借用该神名的角色/组织名；可以把你看到的句子发来，我可以按语境解释。"]}
{"word":"mithraea","summary":{"en":"Mithraea are Mithraic temples/shrines (plural of mithraeum), often underground and cave-like in design.","zh":"Mithraea 是密特拉教神庙/神龛的复数（mithraeum 的复数），常见于地下、洞穴式空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **mithraeum**: a temple or shrine used by followers of the Roman mystery cult of Mithras, often built underground to resemble a cave.","zh":"**mithraeum** 的复数：供奉罗马神秘宗教“密特拉教”(Mithras) 的神庙/神龛，常建于地下并模拟洞穴形态。"},"examples":[{"en":"Archaeologists have discovered several **mithraea** beneath modern cities.","zh":"考古学家在一些现代城市的地下发现了多处 **mithraea**（密特拉神庙遗址）。"},{"en":"Many Roman military sites along the frontiers contained small **mithraea**.","zh":"许多罗马帝国边境的军事驻地里都有规模不大的 **mithraea**。"}]}],"synonyms":["Mithras shrines","Mithraic temples","temples of Mithras"],"phonetic":"mɪˈθriə","extraExplanation":["**mithraea** 是拉丁语/新拉丁语形式的复数（单数是 **mithraeum**）。在英文写作里，它多见于考古、古典学、宗教史语境。","密特拉教的礼拜空间常被描述为“像洞穴一样的密室”，因此很多 **mithraea** 具有地下、狭长空间与两侧长凳等特征；不过在一般英语日常交流中很少用到这个词。"]}
{"word":"mithraeum","summary":{"en":"A mithraeum is a temple or ritual meeting place used by followers of the Roman mystery religion Mithraism.","zh":"mithraeum 指密特拉教信徒使用的神庙或举行仪式的聚会场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A temple or sacred meeting place used by followers of Mithraism (the ancient Roman mystery religion centered on the god Mithras).","zh":"密特拉教（罗马时期以密特拉神为中心的神秘宗教）的神庙或秘密聚会场所。"},"examples":[{"en":"Archaeologists uncovered a mithraeum beneath the modern city streets.","zh":"考古学家在现代城市街道下发现了一座密特拉神庙。"},{"en":"The mithraeum was designed like a cave, reflecting Mithras’s mythical setting.","zh":"这座密特拉神庙被设计成洞穴的样子，呼应了密特拉神话中的场景。"}]}],"synonyms":["Mithraic temple","Mithras temple","shrine (general)"],"phonetic":"/mɪθˈreɪ.əm/","extraExplanation":["“mithraeum”来自拉丁语（mitra- 与密特拉相关）+ 场所后缀 -eum，指“用于……的地方”。复数常写作 mithraea（也可见 mithraeums）。","密特拉教在罗马帝国时期相当流行，尤其与军队与商旅圈子有关。密特拉神庙通常较小、较隐蔽，常建在地下或仿洞穴空间里，两侧有长凳，便于仪式与共同用餐。","学习提示：它是非常特定的考古/宗教史术语，日常英语很少用；常出现在博物馆说明牌、学术文章或历史小说里。"]}
{"word":"mithraic","summary":{"en":"Mithraic means “connected with Mithras or the religion of Mithraism,” especially in Roman history and archaeology.","zh":"Mithraic 指“与密特拉或密特拉教有关的”，多见于罗马史、宗教史与考古语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mithras or Mithraism (a mystery religion practiced especially in the Roman Empire).","zh":"与密特拉（Mithras）或密特拉教（Mithraism，尤指罗马帝国时期的神秘宗教）有关的。"},"examples":[{"en":"Archaeologists found a Mithraic temple beneath the modern city.","zh":"考古学家在现代城市地下发现了一座密特拉教神庙。"},{"en":"The book describes Mithraic rituals as secret and symbolic.","zh":"这本书把密特拉教的仪式描述为秘密且充满象征意义。"},{"en":"A Mithraic inscription was carved into the stone altar.","zh":"石质祭坛上刻着一段密特拉教铭文。"}]}],"synonyms":["Mithraistic"],"phonetic":"/mɪˈθreɪ.ɪk/","extraExplanation":["“Mithraic”多用于学术或考古语境，常见搭配有 Mithraic cult（密特拉教崇拜）、Mithraic mysteries（密特拉秘仪）、Mithraic temple / mithraeum（密特拉教神庙/密特拉神殿）。","密特拉教在罗马帝国时期较流行，尤其与军人社群有关；相关遗迹中常见“屠牛图”（Mithras slaying a bull）的图像主题。"]}
{"word":"mithraicism","summary":{"en":"Mithraicism (more commonly Mithraism) was a secret initiation-based religion in the Roman Empire focused on the god Mithras.","zh":"Mithraicism（更常见为 Mithraism）指罗马帝国时期以密特拉为中心、以秘密入会仪式为特征的秘仪宗教。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mystery religion in the Roman Empire centered on the god Mithras, known for secret initiation rituals and underground temples (mithraea); also spelled “Mithraism.”","zh":"一种罗马帝国时期以密特拉（Mithras）为中心的“秘仪宗教”（神秘宗教），以秘密入会仪式和地下神庙（密特拉神庙，mithraeum）著称；也常拼作 Mithraism（密特拉教）。"},"examples":[{"en":"Some historians study Mithraicism to understand private religious life in the Roman Empire.","zh":"一些历史学者研究密特拉教，以了解罗马帝国时期的私人宗教生活。"},{"en":"Archaeologists have found many mithraea, which offer clues about Mithraicism’s rituals.","zh":"考古学家发现了许多密特拉神庙，为密特拉教的仪式提供了线索。"},{"en":"Mithraicism is often described as a secretive cult, but much of it is reconstructed from images and inscriptions.","zh":"密特拉教常被描述为神秘的崇拜团体，但我们对它的认识多是根据图像与铭文重建出来的。"}]}],"synonyms":["Mithraism","Roman Mithraism","the cult of Mithras"],"phonetic":"/ˈmɪθrəˌɪzəm/","extraExplanation":["“Mithraicism”在英语里较少见，更常用的词是“Mithraism”。两者通常指罗马时期的“罗马密特拉教”（Roman Mithraism）。","它被称为“mystery religion（秘仪宗教）”，因为入会与仪式不公开，成员通过分级的入会仪式加入；因此我们对其细节了解有限。","艺术与考古中最具代表性的图像是密特拉屠牛（tauroctony）场景：密特拉刺杀公牛，常见于神庙壁画、浮雕等。","学术上常讨论它与古伊朗/波斯的密特拉（与契约、誓言相关的神祇）之间的关系：名字有关联，但罗马密特拉教并不等同于波斯宗教的直接“原样移植”。"]}
{"word":"mithraicist","summary":{"en":"A mithraicist is a follower (or, less commonly, a scholar) of Mithraism, the ancient cult of Mithras.","zh":"mithraicist 指密特拉教（密特拉秘仪／密特拉崇拜）的信徒；较少见时也可指研究密特拉教的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower or member of the ancient Mithraic mysteries (the cult of Mithras), especially in the Roman Empire","zh":"密特拉教（密特拉秘仪／密特拉崇拜）的信徒；尤指罗马帝国时期的密特拉教成员"},"examples":[{"en":"Archaeologists think this underground room may have been used by Mithraicists for initiation rites.","zh":"考古学家认为，这间地下房间可能被密特拉教信徒用于入会仪式。"},{"en":"Some Roman soldiers may have been Mithraicists, based on inscriptions found near forts.","zh":"根据在要塞附近发现的铭文，一些罗马士兵可能曾是密特拉教信徒。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person who studies Mithraism or Mithraic religion and symbolism","zh":"（较少见）研究密特拉教及其象征、仪式的人；密特拉教研究者"},"examples":[{"en":"She is a Mithraicist who focuses on temple architecture and iconography.","zh":"她是一位研究密特拉教的学者，专注于神庙建筑与图像学。"}]}],"synonyms":["Mithraist","adherent of Mithraism","follower of Mithras"],"phonetic":"/mɪˈθreɪ.ɪ.kɪst/","extraExplanation":["这是一个比较少见的词，更常见的说法是 **Mithraist**（密特拉教信徒）或用形容词 **Mithraic**（密特拉教的）来描述相关事物。","密特拉教（Mithraism）通常被描述为罗马帝国时期的“秘仪宗教”（mystery cult）：仪式具有保密性，常在称为 *mithraeum* 的地下或半地下空间举行。","词形构成上：**Mithraic**（/mɪˈθreɪ.ɪk/）+ **-ist**（表示“……的人”）→ **Mithraicist**。在学术写作里，有时会用它来强调“密特拉教体系（Mithraic）”而不是更宽泛的“密特拉（Mithra）”。"]}
{"word":"mithraicize","summary":{"en":"Mithraicize (rare) means “to make something Mithraic” or “to convert/adapt it toward Mithraism.”","zh":"mithraicize（罕用）指“使某物具有密特拉教色彩”，或“使其改宗/转向密特拉教并按其方式改造”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something Mithraic; to give it the style, symbols, or beliefs associated with Mithraism (the cult of Mithras in the Roman world).","zh":"使某物呈现密特拉教（Mithraism，密特拉崇拜）色彩；赋予其与密特拉斯相关的风格、象征或信仰。"},"examples":[{"en":"Some scholars argue that a few Roman military rituals were later “mithraicized” in popular imagination, even when the evidence is thin.","zh":"一些学者认为，某些罗马军队仪式在大众想象中后来被“密特拉教化”，尽管证据并不充分。"},{"en":"The novelist mithraicizes the underground temple scene by adding a bull-slaying image and secret initiations.","zh":"这位小说家通过加入“屠牛”图像与秘密入会仪式，把地下神庙的场景“密特拉教化”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to convert or adapt someone/something toward Mithraism (used rarely).","zh":"（罕用）使（人或事物）改宗或转向密特拉教；按密特拉教方式改造。"},"examples":[{"en":"The play imagines a governor trying to mithraicize his troops to strengthen loyalty.","zh":"该剧虚构了一位总督试图让士兵“密特拉教化”以增强忠诚。"},{"en":"It’s hard to tell whether the community was truly mithraicized or simply influenced by nearby cults.","zh":"很难判断这个群体是否真的被“密特拉教化”，还是只是受到邻近崇拜的影响。"}]}],"synonyms":["make Mithraic","give (something) a Mithraic character","Mithraize (rare variant)"],"phonetic":"/ˈmɪθreɪəˌsaɪz/","extraExplanation":["这个词非常少见，通常属于学术写作或文学创作中的“临时造词”。它由 **Mithraic**（密特拉教的）+ 动词后缀 **-ize** 组成，结构上类似 *Christianize*（使基督教化）、*Hellenize*（希腊化）。","实际写作中，更常见的表达是 **to make X Mithraic / to give X a Mithraic character**，或直接用 **Mithraic** 作形容词来描述。"]}
{"word":"mithraism","summary":{"en":"Mithraism is an ancient Roman mystery religion focused on the god Mithras.","zh":"密特拉教是古罗马时期以密特拉神为核心的秘仪宗教。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mystery religion (secretive religious cult) of the Roman Empire centered on the god Mithras, popular especially among soldiers and merchants, with initiation rituals and symbolic ceremonies.","zh":"密特拉教：罗马帝国时期一种带有“秘仪/秘密入会”性质的宗教崇拜，以神祇密特拉（Mithras）为中心，常见于士兵与商旅群体，强调入会仪式与象征性宗教礼仪。"},"examples":[{"en":"Historians study Mithraism to understand religious life in the Roman Empire.","zh":"历史学者研究密特拉教，以理解罗马帝国时期的宗教生活。"},{"en":"Many Mithraism temples were small underground shrines called mithraea.","zh":"许多密特拉教的祭所是小型地下神殿，常被称为“密特拉洞穴神殿”（mithraea）。"}]}],"synonyms":["cult of Mithras","Roman Mithraism","mystery cult"],"phonetic":"/ˈmɪθreɪˌɪzəm/","extraExplanation":["“Mithraism”通常专指罗马帝国时期的“密特拉秘仪”（Roman Mithraism），而不等同于更早的伊朗—印度传统中的“密特拉/密特罗”（Mitra/Mithra）崇拜。两者相关但不完全一样。","在英语里它常出现在历史、考古、宗教学语境中，语气中性、偏学术。日常对话较少用。","学习记忆：-ism 常表示“某种思想/主义/体系”（如 Buddhism, feminism），所以 Mithra + -ism = “密特拉（相关）的宗教体系”。"]}
{"word":"mithraist","summary":{"en":"Mithraist means “related to Mithraism,” and it can also mean “a follower of Mithraism.”","zh":"Mithraist既可指“与密特拉教有关的”，也可指“密特拉教徒”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mithraism, an ancient mystery religion centered on the god Mithras that was practiced in parts of the Roman Empire (especially among some soldiers) from about the 1st to 4th centuries CE.","zh":"与密特拉教（Mithraism）有关的；密特拉教是罗马帝国时期流行的一种古代秘密宗教，崇拜密特拉神（Mithras），约盛行于公元1至4世纪（在部分士兵群体中尤为常见）。"},"examples":[{"en":"Archaeologists found a mithraist temple (a mithraeum) beneath the modern street.","zh":"考古学家在现代街道下发现了一座密特拉教神庙（密特拉神殿，mithraeum）。"},{"en":"The museum’s mithraist artifacts include carvings of Mithras slaying the bull.","zh":"博物馆的密特拉教文物包括“密特拉屠牛”题材的雕刻。"}]},{"partOfSpeech":"n.","definition":{"en":"A follower or adherent of Mithraism; a person who practiced the Mithraic religion.","zh":"密特拉教徒；信奉并实践密特拉教的人。"},"examples":[{"en":"Some historians argue the mithraists formed small, close-knit groups.","zh":"一些历史学者认为，密特拉教徒往往组成规模不大但联系紧密的团体。"},{"en":"In the novel, the soldier is revealed to be a secret mithraist.","zh":"在小说中，这名士兵被揭示为一位秘密的密特拉教徒。"}]}],"synonyms":["Mithraic"],"phonetic":"ˈmɪθreɪɪst","extraExplanation":["“Mithraist”常见于历史、考古与宗教学语境。英语中也常用更直接的说法：*Mithraic*（更偏“密特拉教的、密特拉式的”形容词）与 *Mithraist*（既可形容也可指“教徒”）。","密特拉教属于“秘密宗教”（mystery religion），很多仪式与等级信息来自遗址与图像（如密特拉屠牛场景），而非大量成体系的教义文本，因此学界对其细节仍有讨论空间。"]}
{"word":"mithraistic","summary":{"en":"Mithraistic means “related to Mithraism,” an ancient Roman mystery religion of Mithras.","zh":"Mithraistic 指“与密特拉教有关的”，即古罗马时期以密特拉神为中心的神秘宗教。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mithraism (also called the Mithraic mysteries), an ancient mystery religion in the Roman Empire centered on the god Mithras.","zh":"与密特拉教（又称“密特拉秘仪”）有关的；指古罗马帝国时期以密特拉神（Mithras）为中心的一种神秘宗教。"},"examples":[{"en":"Archaeologists found a Mithraistic temple (a mithraeum) beneath the modern city.","zh":"考古学家在现代城市地下发现了一座密特拉教的神庙（mithraeum，密特拉神庙）。"},{"en":"The book discusses Mithraistic rituals alongside other Roman mystery cults.","zh":"这本书把密特拉教的仪式与其他罗马神秘宗教一起讨论。"}]}],"synonyms":["Mithraic"],"phonetic":"/ˌmɪθrəˈɪstɪk/","extraExplanation":["“Mithraistic”是学术语境里常见的形容词，常用于宗教学、古典学、考古学写作，描述与密特拉教相关的遗址（如密特拉神庙 mithraeum）、图像（如“杀牛图”场景）或仪式传统。","日常英语里更常见的说法是“Mithraic”（如 Mithraic mysteries / Mithraic cult）。两者意义相近，但“Mithraic”更简洁、更常用。","词源上来自“Mithras”（密特拉）+ 形容词后缀“-istic”，表示“属于……体系/风格/思想的”。"]}
{"word":"mithraitic","summary":{"en":"mithraitic: a rare spelling meaning “Mithraic”—related to Mithraism or the god Mithras.","zh":"mithraitic：较少见的拼写，意思同 Mithraic——与密特拉教或密特拉神有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mithraism, a mystery religion (cult) in the ancient Roman world.","zh":"与密特拉教（古罗马时期的一种神秘宗教/密仪宗教）有关的。"},"examples":[{"en":"Archaeologists uncovered a Mithraitic temple beneath the modern street.","zh":"考古学家在现代街道下方发现了一座密特拉教神庙。"},{"en":"The book discusses Mithraitic initiation rituals in the late Roman Empire.","zh":"这本书讨论了罗马帝国晚期的密特拉教入会仪式。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Mithras (the god worshipped in Mithraism) or to things connected with that worship (symbols, art, ceremonies).","zh":"与密特拉神（密特拉教所崇拜的神祇）或与其崇拜相关的事物（象征、艺术、仪式）有关的。"},"examples":[{"en":"A Mithraitic relief shows Mithras in a symbolic scene.","zh":"一幅密特拉教浮雕展示了密特拉神的象征性场景。"},{"en":"Some museums display Mithraitic artifacts such as altars and carvings.","zh":"一些博物馆展出密特拉教器物，如祭坛与雕刻品。"}]}],"synonyms":["Mithraic","mithraistic"],"phonetic":"/mɪˈθreɪ.ɪk/","extraExplanation":["“mithraitic”在英语里很少见，常见、标准的拼写通常是 **Mithraic**（与密特拉教/密特拉神有关）。你也可能会看到 **mithraistic**，意思基本相同。","词源上来自“Mithras/密特拉神”的名称；学术写作里更常用“Mithraic studies（密特拉教研究）”“Mithraic temple（密特拉教神庙）”等固定搭配。"]}
{"word":"mithraize","summary":{"en":"“mithraize” is a very rare verb meaning “to make something Mithraic / related to Mithraism.”","zh":"“mithraize” 是很少见的动词，大意是“使某事呈现密特拉教（Mithraism）的色彩／与密特拉相关”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Very rare / nonstandard) To make something connected with Mithra or Mithraism; to interpret or present something in a “Mithraic” way.","zh":"（非常少见／非标准用法）使某事与密特拉（Mithras）或密特拉教（Mithraism）相关；以“密特拉教的”方式来诠释或呈现。"},"examples":[{"en":"Some writers tried to mithraize Christian symbols by linking them to Mithraic rituals.","zh":"一些作者试图把基督教符号“密特拉化”，把它们与密特拉教仪式联系起来。"},{"en":"The novel’s sun imagery feels mithraized, echoing ancient Roman mystery religions.","zh":"这部小说的太阳意象带有“密特拉化”的色彩，呼应了古罗马的神秘宗教。"}]}],"synonyms":["make Mithraic","Mithraize (rare)","interpret as Mithraic"],"phonetic":"/ˈmɪθreɪz/","extraExplanation":["这个词在现代英语里几乎不常用，很多词典不收录；你更常见到的是形容词 **Mithraic**（“与密特拉教有关的”）。([dictionary.cambridge.org](https://dictionary.cambridge.org/us/dictionary/english/mithraic?utm_source=openai))","也很容易与 **mithridatize** 混淆：mithridatize 指“用逐渐加大的剂量让人对毒物产生耐受（米特里达梯化）”。两者拼写很像，但来源和意思完全不同。([collinsdictionary.com](https://www.collinsdictionary.com/us/dictionary/english/mithridatize?utm_source=openai))"]}
{"word":"mithras","summary":{"en":"Mithras is a god worshiped in the Roman mystery religion Mithraism.","zh":"Mithras（密特拉斯）是羅馬神祕宗教「密特拉教」所崇拜的神祇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a god worshiped in the Roman mystery religion called Mithraism (often linked with the Persian deity Mithra); sometimes called the “Unconquered Sun” (Sol Invictus) in Roman contexts.","zh":"密特拉斯：羅馬神祕宗教「密特拉教」（Mithraism）所崇拜的神祇，常被認為與波斯（伊朗）神祇「密特拉」（Mithra）有關；在羅馬語境中有時也與「不敗之日神」（Sol Invictus）相聯。"},"examples":[{"en":"Archaeologists found a small temple (a mithraeum) dedicated to Mithras near the old military camp.","zh":"考古學家在舊軍營附近發現一座獻給密特拉斯的小神殿（mithraeum）。"},{"en":"In his paper, the historian compares images of Mithras with other Roman religious art.","zh":"在論文中，這位歷史學家把密特拉斯的圖像與其他羅馬宗教藝術作比較。"}]}],"synonyms":["Mithra (related name/context)"],"phonetic":"/ˈmɪθrəs/","extraExplanation":["「Mithras」是專有名詞，常出現在羅馬帝國時期的宗教史、考古與藝術史文章中。密特拉教屬於「神祕宗教」（mystery religion），通常有入會儀式與祕密的象徵系統，相關遺址常見於軍事與城市環境。","藝術與考古最常見的主題之一是「屠牛圖」（tauroctony）：密特拉斯刺殺公牛的場景，常被解讀為象徵宇宙秩序、再生或宗教寓意（不同學者有不同解釋）。","拼寫提示：英語中多寫作 Mithras；形容詞常見 mithraic（密特拉教的、與密特拉教相關的）。"]}
{"word":"mithratic","summary":{"en":"“mithratic” is probably a misspelling of **Mithraic**, meaning ‘related to Mithraism or Mithras.’","zh":"“mithratic”很可能是 **Mithraic** 的误拼，意思是“与密特拉教或密特拉神有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: **Mithraic**) relating to Mithraism (a mystery religion in the Roman Empire) or to the god Mithras.","zh":"（很可能你想写的是 **Mithraic**）与密特拉教（罗马帝国时期的一种秘密宗教）或其神祇密特拉（Mithras）有关的。"},"examples":[{"en":"Archaeologists found a **Mithraic** temple near the old Roman fort.","zh":"考古学家在古罗马要塞附近发现了一座**密特拉教的**神庙。"},{"en":"The museum displayed **Mithraic** symbols carved in stone.","zh":"博物馆展出了刻在石头上的**密特拉教的**符号。"}]}],"synonyms":["Mithraistic","Mithraism-related"],"phonetic":"/mɪˈθreɪ.ɪk/","extraExplanation":["“mithratic”本身并不是英语里常见/规范的拼写；在学术或历史语境里，人们通常用 **Mithraic**（更常见）或 **Mithraistic** 来表达“与密特拉教有关的”。","容易混淆的另一个词是 **mithridatic**（与米特里达梯、或“通过逐渐增量摄入毒物而获得的耐毒性”相关），它和 Mithraic 不是同一个词根、意思也完全不同。"]}
{"word":"mithriac","summary":{"en":"“mithriac” is usually a misspelling of **Mithraic**: an adjective meaning “related to Mithras or Mithraism.”","zh":"“mithriac”通常是 **Mithraic** 的误拼：形容词，表示“与密特拉或密特拉教有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled **Mithraic**) relating to Mithras or Mithraism (a mystery religion that spread in the Roman Empire).","zh":"（通常拼作 **Mithraic**）与密特拉（Mithras）或密特拉教（Mithraism，古罗马时期流行的神秘宗教）有关的。"},"examples":[{"en":"Archaeologists uncovered a small **Mithraic** temple near the old military camp.","zh":"考古学家在旧军营附近发现了一座小型的密特拉教神庙。"},{"en":"The novel uses **Mithraic** symbols to suggest secrecy and initiation rituals.","zh":"这部小说用密特拉教符号来暗示秘密与入会仪式。"}]}],"synonyms":["Mithraic","Mithraistic"],"phonetic":"/mɪˈθreɪ.ɪk/","extraExplanation":["“mithriac”在现代英语里很少见，最常见的是你想写 **Mithraic**（/mɪˈθreɪ.ɪk/）。许多词典与学术写作都用 Mithraic 来表示“与密特拉/密特拉教有关”。","历史上也能见到拉丁语形式 **mithriacus**（意为“属于密特拉神的”），可能会让人误以为英语也常用 mithriac 这种拼法；但在当代英语中，标准拼写仍以 **Mithraic** 为主。","在流行文化里，“Mithraic”有时也会被借用作虚构宗教/派系名称（例如科幻作品设定中），用法仍延续“与密特拉相关”的核心含义。"]}
{"word":"mithridate","summary":{"en":"Mithridate is a historical word for a supposed universal antidote to poison.","zh":"Mithridate 指一种历史上流行、被认为能解百毒的“万能解毒剂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, dated) A medicine believed to protect against poisoning; especially a mixed “universal antidote” made from many ingredients.","zh":"（历史用语/旧式用法）一种被认为能防毒的药；尤指由多种成分混合而成、号称“万能解毒剂”的配方药。"},"examples":[{"en":"In medieval Europe, some people took mithridate as a general antidote to poison.","zh":"在中世纪欧洲，有些人服用 mithridate 作为通用的解毒剂。"},{"en":"The apothecary’s records mention mithridate alongside other famous remedies.","zh":"药剂师的账簿里把 mithridate 和其他著名药方并列记载。"}]}],"synonyms":["antidote","panacea","cure-all","elixir"],"phonetic":"ˈmɪθrɪˌdeɪt","extraExplanation":["词源与文化背景：mithridate 这个词来自古代本都王米特里达梯六世（Mithridates VI）。传说他为了防止被毒杀，长期少量服毒以获得耐受力；因此英语里也有 **mithridatism**（“通过逐渐加量而获得对毒物的耐受”）这个相关词。","历史用法提示：今天在日常英语里 **mithridate** 很少使用，更常见的表达是 **antidote**（解毒剂）或比喻用的 **cure-all / panacea**（万灵药）。在文学或历史语境中看到 mithridate，多半指“古代/中世纪流行的复方解毒药”。"]}
{"word":"mithridatic","summary":{"en":"Mithridatic means connected to Mithridates and the idea of building resistance to poison; it can also mean an antidote.","zh":"mithridatic 指与米特里达梯传说相关、通过少量服毒来增强抗毒性；也可指解毒剂（偏古旧/文学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Mithridates VI of Pontus, especially his (legendary) practice of taking small doses of poison to build resistance; by extension, relating to protection against poison or developing immunity to it.","zh":"与本都国米特里达梯六世有关的，尤指传说中他通过少量服毒来增强抗毒性的做法；引申为与“防毒/抗毒、逐渐获得免疫力”有关的。"},"examples":[{"en":"The novel describes a mithridatic routine: tiny doses taken daily to prevent a future poisoning.","zh":"小说描写了一种“米特里达梯式”的做法：每天服用极少量，以防将来被下毒。"},{"en":"Scientists sometimes use the mithridatic story as a historical reference when discussing gradual tolerance.","zh":"科学家有时会用“米特里达梯式”的故事作为历史参照来讨论逐渐形成的耐受性。"}]},{"partOfSpeech":"n.","definition":{"en":"A remedy or antidote against poison; something believed to protect against poisoning (often used historically or figuratively).","zh":"解毒剂；（尤用于历史或比喻语境）被认为能防止中毒的东西。"},"examples":[{"en":"The apothecary advertised a mithridatic for travelers afraid of tainted food.","zh":"药剂师为担心食物被污染的旅人推销一种“解毒剂”。"},{"en":"For her, humor was a mithridatic against fear.","zh":"对她而言，幽默是一种对抗恐惧的“解毒剂”。"}]}],"synonyms":["antidotal","antidote","protective","immunizing"],"phonetic":"/ˌmɪθrɪˈdætɪk/","extraExplanation":["这个词来自历史人物“米特里达梯六世（Mithridates VI）”的传说：他担心被毒杀，于是长期服用极小剂量的毒物，试图让身体逐渐产生“抗毒性”。因此 **mithridatic** 常用于两类语境：①“逐步建立耐受/免疫”的做法（形容词）；②“解毒剂/防毒药”的概念（名词，较偏古旧或文学化）。","现代科学里“逐渐耐受（tolerance）/脱敏（desensitization）”有更精确的用词；而 **mithridatic** 往往带一点历史典故或文学色彩。"]}
{"word":"mithridatise","summary":{"en":"Mithridatise means to make someone resistant to a poison by gradually increasing doses (and, figuratively, to make someone less sensitive through repeated exposure).","zh":"mithridatise 指通过逐渐增加剂量使人对毒物产生耐受/免疫；也可比喻为因反复接触而变得麻木、不敏感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(BrE spelling) To make someone resistant or immune to a poison by giving gradually increasing doses; to induce mithridatism in someone.","zh":"（英式拼写）使（某人）通过逐渐增加剂量而对某种毒物产生耐受/免疫；使产生“密特里达梯式耐毒性”（mithridatism）。"},"examples":[{"en":"The king tried to mithridatise himself against assassination by poison.","zh":"国王试图让自己“密特里达梯化”，以防被人用毒暗杀。"},{"en":"In the story, the physician mithridatised the patient with tiny doses over months.","zh":"在故事里，医生用数月的极小剂量让病人逐渐产生耐受。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To make someone less sensitive to something harmful or shocking through repeated small exposures.","zh":"（比喻）通过反复、少量接触，让（某人）对有害或令人震惊的事物变得不那么敏感。"},"examples":[{"en":"Constant bad news can mithridatise people to suffering they would once have found unbearable.","zh":"持续不断的负面新闻可能会让人们对痛苦逐渐麻木，而这些痛苦原本难以承受。"},{"en":"He felt mithridatised to criticism after years in public life.","zh":"多年公众生活后，他觉得自己对批评已经“免疫/麻木”了。"}]}],"synonyms":["mithridatize","immunize (against)","inoculate (figurative)","desensitize"],"phonetic":"/mɪˈθrɪdəˌtaɪz/","extraExplanation":["“mithridatise / mithridatize”来自本都国王米特里达梯六世（Mithridates VI）的传说：他为防被毒杀，长期服用微量毒物以建立耐受，因此英语里用他的名字来指“通过逐渐增加剂量获得耐毒性”。","拼写上，英式英语常用 -ise（mithridatise），美式英语更常用 -ize（mithridatize）。两者意思相同。","这个概念也常出现在文学与流行文化中，作为“逐渐适应/对毒或伤害免疫”的情节装置或隐喻（如用于描写对痛苦、暴力、舆论的麻木）。"]}
{"word":"mithridatised","summary":{"en":"Mithridatised means ‘made immune to a poison by gradually increasing doses,’ and figuratively ‘gradually desensitized.’","zh":"mithridatised 指“通过逐渐加量而对毒物产生耐受/免疫”，也可比喻“逐渐麻木、不再敏感”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(BrE) past tense/past participle of **mithridatise**: made resistant (immune) to a poison by giving (or taking) gradually increasing doses.","zh":"（英式拼写）**mithridatise** 的过去式/过去分词：通过（给予或服用）逐渐增加剂量的毒物，使（某人）对该毒物产生耐受/免疫。"},"examples":[{"en":"The researcher claimed the lab animals had been mithridatised against the toxin through tiny, controlled doses.","zh":"研究人员声称，这些实验动物通过微量、可控的剂量，已经对这种毒素实现了“逐步耐毒”。"},{"en":"In old stories, some rulers tried to become mithridatised to avoid assassination by poison.","zh":"在一些古老传说中，有些统治者试图“逐步耐毒”，以避免遭人下毒暗杀。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) gradually desensitized or hardened to something unpleasant through repeated small exposures.","zh":"（比喻）因反复、逐步接触不愉快之事而变得麻木/不再敏感。"},"examples":[{"en":"After years of harsh criticism, she felt almost mithridatised to online insults.","zh":"经历多年严厉批评后，她几乎对网络辱骂“逐步麻木”了。"},{"en":"The team became mithridatised to bad news as layoffs continued month after month.","zh":"随着裁员一月接一月地发生，团队对坏消息逐渐变得麻木。"}]}],"synonyms":["desensitized","inured","hardened","immunized"],"phonetic":"/ˈmɪθrɪdəˌtaɪzd/","extraExplanation":["这个词来自“米特里达梯（Mithridates VI）”的传说：据说他为了防止被毒杀，从小开始少量服毒，逐渐形成耐受；相关名词有 **mithridatism（逐步耐毒/耐受性）**。","拼写说明：美式更常见 **mithridatized**（-ize），英式更常见 **mithridatised**（-ise）。这类词在日常英语里很罕见，更常用的近义表达是 **desensitized / inured / immunized**（视语境而定）。"]}
{"word":"mithridatising","summary":{"en":"Mithridatising means gradually building resistance by taking small increasing doses of a poison (or, figuratively, becoming less affected by repeated small exposures).","zh":"mithridatising 指通过逐渐增加的小剂量接触来形成耐受（本义为对毒物耐受；也可比喻对负面事物逐渐“免疫”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE spelling) taking small, gradually increasing doses of a poison (or harmful substance) to build up resistance; practicing mithridatism.","zh":"（英式拼写）通过逐渐增加剂量地少量摄入毒物（或有害物质）来获得耐受/免疫；实行“密特里达梯化”（逐步耐毒法）。"},"examples":[{"en":"In the novel, the prince survives an assassination attempt by mithridatising for years.","zh":"在小说里，那位王子因为多年进行逐步耐毒法而在暗杀中幸存。"},{"en":"Some stories claim he was mithridatising with tiny doses of venom to protect himself.","zh":"有些传说称他用极微量的毒液逐步建立耐受来保护自己。"}]},{"partOfSpeech":"v.","definition":{"en":"(Figurative) becoming less affected by something unpleasant through repeated small exposures (for example, criticism, bad news, or stress).","zh":"（比喻）通过一次次少量接触而对不愉快的事变得不那么敏感/更能承受（如批评、坏消息或压力）。"},"examples":[{"en":"After months in the spotlight, she was mithridatising herself against online criticism.","zh":"在聚光灯下待了几个月后，她逐渐对网络批评产生“耐受”。"},{"en":"The team joked they were mithridatising to rejection by sending applications every day.","zh":"团队开玩笑说他们每天投申请，是在对被拒“逐步耐受”。"}]}],"synonyms":["mithridatizing","mithridatise (base form)","mithridatize (base form)","building up tolerance","developing resistance"],"phonetic":"/ˈmɪθrɪdəˌtaɪzɪŋ/","extraExplanation":["“mithridatising”多见于英式拼写，对应美式更常见的“mithridatizing”。词根来自本都国王Mithridates VI（密特里达梯六世）的传说：他为防被毒杀而长期少量服毒以获得耐受。","相关名词是“mithridatism”（逐步耐毒法/耐毒性）。这个词在现代英语里很少见，常用于文学、历史或修辞性的比喻表达。"]}
{"word":"mithridatism","summary":{"en":"Mithridatism means building resistance to poison by taking tiny doses over time, and it can also be used figuratively for becoming less affected by repeated harmful experiences.","zh":"Mithridatism 指通过长期少量摄入毒物来逐渐产生抗性；也可作比喻，表示因反复接触而对伤害或不适变得不那么敏感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of protecting yourself against a poison by taking very small amounts over time, so your body gradually builds resistance","zh":"通过长期少量摄入毒物来逐渐产生抗性（耐受）的做法"},"examples":[{"en":"According to the legend, the king relied on mithridatism to survive assassination attempts by poisoning.","zh":"据传说，这位国王依靠“米特里达梯式抗毒法”来躲过多次下毒暗杀。"},{"en":"Mithridatism is often mentioned in stories about courts and intrigue, where poison was a constant threat.","zh":"在宫廷阴谋的故事里，人们常提到“米特里达梯式抗毒法”，因为毒杀始终是威胁。"}]},{"partOfSpeech":"n.","definition":{"en":"a figurative idea: becoming less affected by something harmful or unpleasant through repeated small exposures","zh":"比喻义：因反复、逐渐的接触而对某种伤害或不适变得不那么敏感"},"examples":[{"en":"After years of harsh reviews, she developed a kind of mithridatism toward criticism.","zh":"经历多年严厉的评价后，她对批评产生了一种“逐渐免疫”的状态。"},{"en":"Some people talk about ‘news mithridatism’—getting numb to alarming headlines.","zh":"有些人说自己对新闻产生了“米特里达梯式麻木”——对耸动标题逐渐无感。"}]}],"synonyms":["immunization (figurative)","desensitization","tolerance"],"phonetic":"ˌmɪθrɪˈdeɪtɪzəm","extraExplanation":["词源与背景：Mithridatism 来自本都王米特里达梯六世（Mithridates VI）的传说。据说他担心被毒杀，长期少量服用多种毒物以培养耐受力。","用法提示：这个词在现代多见于历史叙述、文学评论或比喻表达，不是日常高频词；写作中常用来形容“对伤害逐渐麻木/适应”。","文化联想：在英语写作里，它常与“宫廷阴谋、暗杀、毒药”这类主题一起出现，也可用于心理层面的“逐渐免疫”。"]}
{"word":"mithridatize","summary":{"en":"Mithridatize means to build resistance to poison (or metaphorically, to harm) by gradual, repeated small exposures.","zh":"Mithridatize 指通过长期少量、反复接触而逐渐获得对毒物（或比喻意义上的伤害）的耐受/抗性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make (someone) resistant to poison or a harmful substance by giving small doses over time; to build up tolerance by gradual exposure","zh":"通过长期少量接触（毒物或有害物质）使（某人）逐渐产生抗性；使逐步耐受"},"examples":[{"en":"The legend says the king tried to mithridatize himself by taking tiny doses of poison each day.","zh":"传说这位国王每天服用极少量的毒药，试图让自己逐渐“耐毒”。"},{"en":"Some writers use the word metaphorically: repeated exposure can mithridatize people to harsh language.","zh":"有些作者把这个词用作比喻：反复接触会让人对刺耳的言语逐渐“麻木/耐受”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become resistant to poison or harm through gradual exposure (less common use)","zh":"因逐渐接触而变得对毒物或伤害具有抗性（较少见用法）"},"examples":[{"en":"Over time, he claimed he had mithridatized to the bitter medicine.","zh":"久而久之，他声称自己已经对那种苦药“耐受”了。"}]}],"synonyms":["build up tolerance","immunize (figurative/loose)","inure (to)"],"phonetic":"/ˈmɪθrɪdəˌtaɪz/","extraExplanation":["这个词来自古代本都国王“米特里达梯六世”（Mithridates VI）。据说他担心被毒杀，于是长期少量服毒以获得免疫力；这种“逐步耐毒”的做法后来被称为 mithridatism，而动词 mithridatize 就由此而来。","现代英语里它非常书面、少见，常出现在历史叙述或带文学色彩的比喻中（例如对暴力、侮辱、恐惧等逐渐麻木）。"]}
{"word":"mithridatized","summary":{"en":"Mithridatized means made resistant or numb through gradual exposure, originally to poison.","zh":"Mithridatized 指通过逐步接触而产生耐受/“麻木”，本义与逐渐适应毒药有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made resistant (or less sensitive) to a poison, drug, or harmful influence by exposure in small, gradually increasing amounts","zh":"（通过少量、逐步增加的接触）使对毒药、药物或有害影响产生耐受/免疫"},"examples":[{"en":"After months of tiny doses, the animal was said to be mithridatized against the toxin.","zh":"经过数月的微量投喂后，据说这只动物对该毒素已经产生了耐受（被“米特里达梯化”了）。"},{"en":"He felt mithridatized to harsh criticism and barely reacted anymore.","zh":"他觉得自己对尖刻批评已经“麻木”了，几乎不再有反应。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of mithridatize) to build up resistance to a poison or harmful effect by taking small, increasing doses","zh":"（mithridatize 的过去式/过去分词）通过逐步增加的小剂量摄入，使对毒物或伤害产生耐受"},"examples":[{"en":"The ruler mithridatized himself by swallowing tiny amounts of poison each day.","zh":"这位统治者每天吞服微量毒药，使自己逐渐产生耐受。"}]}],"synonyms":["immunized","inured","desensitized","hardened"],"phonetic":"/ˈmɪθrɪdəˌtaɪzd/","extraExplanation":["这个词来自本都王米特里达梯六世（Mithridates VI）的传说：他担心被毒杀，据说长期服用微量毒物来“练出免疫”。因此 mithridatize / mithridatized 常用于“通过逐步接触而产生耐受”。","现代更常见的是比喻用法：指对负面事物（比如恶评、暴力新闻、丑闻）因为反复接触而变得不敏感、麻木。语气通常偏书面、文学化。"]}
{"word":"mithridatizing","summary":{"en":"Mithridatizing = gradually building resistance to a poison (or figuratively, to something unpleasant) through repeated small exposures.","zh":"Mithridatizing 指通过逐步、少量反复接触来获得对毒物的耐受；也可比喻逐渐对不愉快事物“麻木/习惯”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of **mithridatize**: building (or causing someone to build) resistance to a poison/toxin by taking very small amounts and gradually increasing the dose.","zh":"**mithridatize** 的现在分词：通过从极小剂量开始、逐步加量的方式，使自己（或使他人）对毒物/毒素产生耐受（抗毒性）。"},"examples":[{"en":"In the story, the king was **mithridatizing** himself against poison to avoid assassination.","zh":"在故事里，那位国王通过逐步服用毒药来让自己产生耐受，以避免被毒杀。"},{"en":"Some writers use **mithridatizing** metaphorically to mean becoming less sensitive to criticism through repeated exposure.","zh":"有些作者会把 **mithridatizing** 用作比喻，指通过反复接触批评而变得不那么在意。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) gradually becoming less affected by something unpleasant or harmful through repeated small exposures.","zh":"（比喻）通过反复、少量地接触不愉快或有害的事物而逐渐“习惯”、变得不那么受影响。"},"examples":[{"en":"After years in the industry, she was **mithridatizing** to constant rejection.","zh":"在这个行业多年后，她对持续的拒绝逐渐“习惯”了。"}]}],"synonyms":["build tolerance","develop resistance","immunize","inure (to)","acclimate (to)"],"phonetic":"/ˈmɪθrɪˌdeɪtaɪz/","extraExplanation":["这个词来自本都国王米特里达梯六世（Mithridates VI）的传说：据说他为了防毒杀而长期服用微量毒物，逐渐获得耐受（名词：mithridatism）。","英文里它很少见，多出现在历史/文学或修辞性表达中；日常表达更常用 *build tolerance (to)*、*develop resistance (to)*、*immunize*。","提醒：现实中“通过服毒获得免疫/耐受”非常危险，不应模仿；该词在现代多用于比喻语境。"]}
{"word":"miticidal","summary":{"en":"Miticidal means “killing mites,” often describing pesticides or medical/veterinary treatments.","zh":"Miticidal 指“杀螨的”，常用于农药或医疗/兽医处理（如杀螨药、洗剂等）的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to kill mites; used to describe a chemical, treatment, or product that kills mites (tiny arachnids).","zh":"能杀死螨虫的；用于描述能杀螨的化学品、处理方法或产品。"},"examples":[{"en":"The vet prescribed a miticidal shampoo to treat the dog’s mange.","zh":"兽医开了一种杀螨洗剂来治疗这只狗的疥癣。"},{"en":"Farmers may use miticidal sprays when spider mites damage crops.","zh":"当红蜘蛛（叶螨）危害作物时，农民可能会使用杀螨喷剂。"}]}],"synonyms":["acaricidal","mite-killing"],"phonetic":"/ˌmaɪtəˈsaɪdəl/","extraExplanation":["“miticidal”主要见于农业、兽医和杀虫剂/杀螨剂说明书等语境。词根来自 mite（螨虫）+ -cidal（“杀……的”，也见于 suicidal 自杀的、pesticidal 杀虫的）。","使用此类产品时要特别注意安全与法规：不同地区对杀螨成分的允许范围、使用方式、以及对宠物/人体/作物的风险提示可能不同。"]}
{"word":"miticide","summary":{"en":"Miticide means a substance used to kill mites, often in farming, gardening, or animal care.","zh":"Miticide 指“杀螨剂”，用于杀死螨虫，常见于农业、园艺或动物护理/防治害虫语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical (or biological agent) used to kill mites (tiny spider-like pests), especially on crops, animals, or in stored products.","zh":"杀螨剂：用于杀死螨类（微小的类蜘蛛害虫）的化学品（或生物制剂），常用于农作物、动物或储藏产品。"},"examples":[{"en":"The farmer applied a miticide to protect the strawberries from spider mites.","zh":"农民使用杀螨剂来保护草莓免受红蜘蛛（叶螨）的危害。"},{"en":"Always follow the label directions when using a miticide around pets.","zh":"在宠物周围使用杀螨剂时，一定要遵循标签说明。"}]}],"synonyms":["acaricide","mite killer","mite treatment"],"phonetic":"/ˈmaɪtɪsaɪd/","extraExplanation":["“miticide”由“mite（螨虫）+ -cide（杀……的药剂/物质）”构成；类似构词还有 insecticide（杀虫剂）、herbicide（除草剂）。","在日常英文里，miticide 多用于农业、园艺、兽医或害虫防治语境；普通家庭场景更常见的说法是 “mite spray（除螨喷雾）” 或直接说 “treatment for mites（治螨处理）”。","有时你会看到更具体的分类词：acaricide（杀蜱/杀螨剂，范围更广，针对蜱和螨；mites 属于 arachnids），而 miticide 更强调“螨”。","使用这类药剂常与抗药性（resistance）相关：同一种药反复使用可能效果变差，因此专业场景会轮换不同作用机制的药剂。"]}
{"word":"miticides","summary":{"en":"Miticides are chemicals used to kill mites.","zh":"Miticides 指“杀螨剂”，用于杀死螨虫的药剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Chemicals (especially pesticides) used to kill mites (tiny arachnids that can damage plants, stored products, or affect animals).","zh":"杀螨剂；用于杀死螨虫的化学药剂（通常属于农药），可用于植物、储藏物或动物相关的螨害防治。"},"examples":[{"en":"The grower applied miticides to control spider mites on the tomatoes.","zh":"种植者使用杀螨剂来控制番茄上的红蜘蛛（叶螨）。"},{"en":"Overusing miticides can lead to mite resistance, making treatment less effective later.","zh":"过度使用杀螨剂会导致螨虫产生抗药性，使之后的防治效果变差。"}]}],"synonyms":["acaricides"],"phonetic":"/ˈmaɪtɪˌsaɪdz/","extraExplanation":["miticide 是由 mite（螨虫）+ -cide（杀……的药/剂，如 insecticide 杀虫剂、herbicide 除草剂）构成的词。复数是 miticides。","学习小提示：日常园艺或农业语境里，人们有时会把它当作“专门杀螨的农药”。不过实际用药需要遵循标签说明与当地法规；并且常见建议是轮换不同作用机制的药剂，以降低抗药性风险。"]}
{"word":"mitier","summary":{"en":"**mitier** is a rare adjective meaning “more infested with mites” (the comparative form of *mity*).","zh":"**mitier** 是一个很少见的形容词，意思是“更有螨虫的/更受螨虫侵扰的”（*mity* 的比较级）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of *mity*) more infested with mites; having more mites than something else.","zh":"（*mity* 的比较级）更有螨虫的；比别的东西更“长螨/生螨”的。"},"examples":[{"en":"The older mattress was **mitier** than the newer one.","zh":"那张旧床垫比新床垫更容易长螨。"},{"en":"In the damp corner, the stored blankets became **mitier** over time.","zh":"在潮湿的角落里，存放的毯子久而久之变得更容易滋生螨虫。"}]}],"synonyms":["more mity","more mite-infested","more mite-ridden"],"phonetic":"/ˈmaɪtiɚ/","extraExplanation":["“mitier”是一个非常少见的词，主要见于词典条目或拼字游戏（如 Scrabble）。它来自形容词“mity”（有螨虫的；被螨虫侵扰的），所以“mitier”就是“更有螨虫的”。([merriam-webster.com](https://www.merriam-webster.com/dictionary/mitier))","很多学习者把“mitier”误当成法语借词“métier / metier”（意为“擅长的领域；本行；拿手的事”）。如果你想表达“专长/强项”，你可能要找的是“métier”。([britannica.com](https://www.britannica.com/dictionary/m%C3%A9tier?utm_source=openai))"]}
{"word":"mitiest","summary":{"en":"**mitiest** means “most infested with mites.” It’s the superlative form of **mity**.","zh":"**mitiest** 表示“螨虫最多、最被螨虫侵扰的”，是 **mity** 的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of **mity**) most infested with mites (tiny insects/arachnids).","zh":"（**mity** 的最高级）最“长螨/被螨虫侵扰”的；螨虫最多的。"},"examples":[{"en":"Of all the old blankets, this one is the **mitiest** and should be washed in hot water.","zh":"在所有旧毯子里，这条是**最长螨**的，应该用热水清洗。"},{"en":"The vet checked which kennel was the **mitiest** and treated all the dogs for mites.","zh":"兽医检查哪间狗舍**螨虫最多**，并给所有狗做了驱螨处理。"}]}],"synonyms":["most mity","most mite-infested","most infested (with mites)"],"phonetic":"/ˈmaɪtiəst/","extraExplanation":["“mitiest”很少在日常英语里出现，更常见于字典/拼字游戏（如 Scrabble）或较技术性的语境；它来自形容词 “mity”（长螨的、被螨虫侵扰的），而 “mity” 来自名词 “mite”（螨虫）。([scrabble.merriam.com](https://scrabble.merriam.com/finder/mitiest?utm_source=openai))","注意：**mitiest** 和更常见的 **mightiest**（“最强大的”）拼写非常像，而且在美式英语里常常**读音相同** /ˈmaɪtiəst/。如果你想表达“最强大”，通常应拼作 **mightiest**（mighty 的最高级）。([merriam-webster.com](https://www.merriam-webster.com/dictionary/mighty?utm_source=openai))"]}
{"word":"mitigable","summary":{"en":"Mitigable means “able to be reduced or made less severe.”","zh":"Mitigable 的意思是“可以被减轻、缓和或降低严重性”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be made less harmful, severe, or intense; able to be reduced or softened","zh":"可减轻的；可缓和的；可降低严重性的"},"examples":[{"en":"Some of the project’s risks are mitigable if the team plans early and tests often.","zh":"如果团队尽早规划并经常测试，这个项目的一些风险是可减轻的。"},{"en":"The damage was partly mitigable through quick action, like shutting off the water immediately.","zh":"通过迅速采取行动（例如立刻关掉水源），损失在一定程度上是可减轻的。"},{"en":"Her anxiety felt overwhelming, but it was mitigable with support and practical coping skills.","zh":"她的焦虑感令人难以承受，但在支持与实用应对技巧的帮助下是可以缓和的。"}]}],"synonyms":["reducible","alleviable","manageable","lessenable"],"phonetic":"/ˈmɪtɪɡəbəl/","extraExplanation":["“mitigable”来自动词“mitigate”（减轻、缓和）。在日常英语里，人们更常用“can be mitigated”或“manageable / preventable / reducible”等表达；“mitigable”比较偏正式、书面，常见于风险管理、法律或政策文本。","常见搭配：mitigable risk（可缓解的风险）、mitigable harm（可减轻的伤害）、mitigable factors（可减轻因素）。"]}
{"word":"mitigant","summary":{"en":"A mitigant is a factor that reduces the severity, harm, or blame of something, often used in legal or formal contexts.","zh":"Mitigant 指“减轻因素/缓和情况”，常用于法律或正式语境，表示让事情不那么严重、伤害更小或责任更轻的因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something (such as a fact, action, or circumstance) that makes a situation less harmful, severe, or blameworthy; a mitigating factor.","zh":"减轻因素；缓和情况（使问题的伤害、严重性或责任变小的事实、行为或情形）。"},"examples":[{"en":"The judge considered several mitigants before deciding the sentence.","zh":"法官在判刑前考虑了几项减轻因素。"},{"en":"A sincere apology can be a mitigant in a workplace conflict.","zh":"真诚的道歉在职场冲突中可能是一种缓和因素。"}]}],"synonyms":["mitigating factor","extenuating circumstance","alleviating factor","modifier"],"phonetic":"/ˈmɪtɪɡənt/","extraExplanation":["“Mitigant”常见于法律与正式写作中，尤其是“mitigating circumstances（酌情减轻情节）”。日常口语里更常说“a mitigating factor”或直接用动词“mitigate（减轻）”。","词源与“mild（温和的）”有亲缘关系，核心意思都是“让…变得不那么严重/不那么坏”。"]}
{"word":"mitigate","summary":{"en":"“Mitigate” means to reduce the harmful effects or seriousness of something bad.","zh":"“Mitigate”表示减轻不良影响或严重性，使情况更可控。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something less harmful, serious, or painful; to reduce the bad effects of something","zh":"减轻（伤害/严重性/痛苦）；缓解（不良影响）"},"examples":[{"en":"Wearing a seatbelt can mitigate injuries in a car accident.","zh":"系安全带可以减轻车祸中的伤害。"},{"en":"The government introduced new policies to mitigate inflation.","zh":"政府推出新政策来缓解通货膨胀。"},{"en":"He apologized to mitigate the tension in the room.","zh":"他道歉以缓解房间里的紧张气氛。"}]}],"synonyms":["reduce","lessen","alleviate","ease","soften"],"phonetic":"/ˈmɪtəˌɡeɪt/","extraExplanation":["“mitigate”常用于较正式的语境（新闻、学术、职场），强调“把负面影响降到更可控/更小”。常见搭配：mitigate risk（降低风险）、mitigate damage（减轻损失）、mitigate harm（减少伤害）、mitigate the impact/effects（缓解影响/后果）。","词源来自拉丁语“mitis”（温和的）相关词根，带有“使变得更温和”的感觉。","易混词对比：reduce 更中性=减少数量/程度；alleviate 常指缓解痛苦/压力（pain, suffering）；mitigate 强调减轻负面后果（risk, damage, impact）。"]}
{"word":"mitigated","summary":{"en":"Mitigated means “made less severe or harmful,” and it is also the past form of mitigate.","zh":"mitigated表示“被减轻/被缓和的”，也可作为动词mitigate的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made less severe, serious, or harmful (often used for risks, damage, or negative effects).","zh":"（使）减轻了的；缓和了的；降低危害/严重性的（常用于风险、损害或负面影响）。"},"examples":[{"en":"The company said the impact of the outage was mitigated by backup systems.","zh":"公司表示，备用系统减轻了这次中断带来的影响。"},{"en":"Her apology mitigated the tension in the room.","zh":"她的道歉缓和了房间里的紧张气氛。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mitigate”: to make something less bad or less harmful.","zh":"“mitigate”的过去式/过去分词：使某事变得不那么糟或不那么有害。"},"examples":[{"en":"They mitigated the risk by diversifying their investments.","zh":"他们通过分散投资来降低风险。"},{"en":"The city mitigated flooding by improving drainage.","zh":"这座城市通过改善排水系统来减轻洪水问题。"}]}],"synonyms":["reduced","lessened","alleviated","eased","softened"],"phonetic":"/ˈmɪtɪˌɡeɪtɪd/","extraExplanation":["“mitigated”常见于正式/书面语，尤其是新闻、学术、法律与职场语境：mitigated risk（降低风险）、mitigated damage（减轻损害）、mitigated impact（减轻影响）。","常见搭配：mitigated by（通过……得到缓解/减轻）、fully/partly mitigated（完全/部分缓解）。","近义词辨析：reduce（减少，最通用）、ease（缓和，偏感受/压力）、alleviate（缓解痛苦/压力，较正式）、attenuate（衰减，偏技术/信号/影响）。"]}
{"word":"mitigatedly","summary":{"en":"Mitigatedly means “in a way or to a degree that lessens something bad,” and it’s relatively formal and uncommon.","zh":"Mitigatedly 意为“以减轻负面影响的方式/在一定程度上缓和”，语气较正式且不太常见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that reduces the severity, harmfulness, or bad effects of something; with the negative impact made smaller.","zh":"以减轻的方式；在某种程度上降低（问题、伤害或负面影响）的严重性。"},"examples":[{"en":"The new safety rules mitigatedly improved working conditions, though problems still remained.","zh":"新的安全规定在一定程度上改善了工作条件，不过问题仍然存在。"},{"en":"She spoke mitigatedly about the scandal, focusing on what had been fixed rather than what went wrong.","zh":"她以较为缓和的方式谈论那起丑闻，重点放在已经修复的部分，而不是出错之处。"}]},{"partOfSpeech":"adv.","definition":{"en":"To a limited degree; somewhat (used to signal partial improvement or partial reduction, often in a formal style).","zh":"在有限程度上；稍微（常用于较正式语境，强调只是部分改善或部分减轻）。"},"examples":[{"en":"The heat was mitigatedly less intense after sunset.","zh":"日落后，炎热在一定程度上没那么强烈了。"},{"en":"His fear was mitigatedly eased by the doctor’s explanation.","zh":"医生的解释在一定程度上缓解了他的恐惧。"}]}],"synonyms":["somewhat","to some extent","partly","partially","in part","moderately"],"phonetic":"/ˈmɪtɪɡeɪtɪdli/","extraExplanation":["“mitigatedly”来自动词 mitigate（减轻、缓和）+ 副词后缀 -ly。它在现代英语里比较少见，很多时候母语者更常用 partly / somewhat / to some extent，或直接用动词结构：the policy helped mitigate the harm（该政策有助于减轻伤害）。","注意与形容词“mitigated”区分：a mitigated disaster 通常表示“已被减轻的灾难”，而口语里更常见的是“an unmitigated disaster”（彻头彻尾的灾难，毫无缓和）。"]}
{"word":"mitigates","summary":{"en":"“Mitigates” means “makes something less harmful or less severe.”","zh":"“Mitigates”表示“减轻、缓和不良影响或严重程度”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something less harmful, less severe, or less painful; to reduce the bad effects of something","zh":"减轻；缓和（不良影响/伤害/严重程度）"},"examples":[{"en":"Wearing sunscreen mitigates the risk of sunburn.","zh":"涂防晒霜可以减轻晒伤的风险。"},{"en":"The new policy is meant to mitigate the impact of rising prices on low-income families.","zh":"新政策旨在减轻物价上涨对低收入家庭的影响。"},{"en":"Good communication can mitigate misunderstandings in a team.","zh":"良好的沟通能减少团队中的误会。"}]},{"partOfSpeech":"v.","definition":{"en":"to lessen the seriousness of a punishment or judgement (often in legal contexts)","zh":"（法律语境）从轻处理；减轻（处罚/责任）的严重性"},"examples":[{"en":"The judge considered factors that might mitigate the sentence.","zh":"法官考虑了可能减轻刑期的因素。"},{"en":"His lack of prior offenses may mitigate the penalty.","zh":"他没有前科可能会减轻处罚。"}]}],"synonyms":["reduce","lessen","alleviate","ease","soften","diminish"],"phonetic":"/ˈmɪtɪˌɡeɪts/","extraExplanation":["“mitigates”是动词“mitigate”的第三人称单数（he/she/it mitigates）。常见搭配：mitigate the risk/impact/damage/harm/effects（减轻风险/影响/损害/伤害/后果）。","语气上比“reduce（减少）”更强调“把坏影响变轻”，不一定是把数量变少；也常用于正式写作（学术、新闻、政策、法律）。","近义词对比：alleviate 更常搭配“痛苦/压力”（alleviate pain/stress）；ease 语气更口语；lessen 比较中性；offset 更像“抵消一部分”。"]}
{"word":"mitigating","summary":{"en":"Mitigating means reducing harm or making something less severe, often by taking practical actions.","zh":"Mitigating 指通过采取措施来减轻伤害或降低严重程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"reducing harm, seriousness, or intensity (often by taking actions that make a situation less bad)","zh":"减轻（伤害/严重性/强度）；缓和（常指采取措施让情况没那么糟）"},"examples":[{"en":"Wearing a seat belt is a simple way of mitigating injury in a crash.","zh":"系安全带是减轻车祸伤害的一种简单方法。"},{"en":"The company is mitigating risk by backing up its data every day.","zh":"公司通过每天备份数据来降低风险。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of reducing harm or making something less severe; present participle of “mitigate”","zh":"减轻、缓和（的行为）；“mitigate”的现在分词形式"},"examples":[{"en":"They are mitigating the damage by responding quickly.","zh":"他们通过快速回应来减轻损害。"},{"en":"We’re mitigating the problem, but we haven’t solved it yet.","zh":"我们在缓解这个问题，但还没有彻底解决。"}]}],"synonyms":["reducing","lessening","easing","alleviating","softening","minimizing"],"phonetic":"/ˈmɪtɪˌɡeɪtɪŋ/","extraExplanation":["“Mitigating”常见于正式语境（法律、商业、医疗、环境、工程），比“reducing / lessening”更强调“采取措施来把负面影响降到最低”。","常见搭配：mitigating risk（降低风险）、mitigating factors（从轻/减轻情节）、mitigating circumstances（可减轻责任的情况）、mitigating damage（减轻损害）、mitigating climate change（缓解气候变化）。","注意区别：mitigate（缓和、减轻）不等于 solve（解决）。你可以mitigate a problem（让它没那么严重），但问题可能仍然存在。"]}
{"word":"mitigation","summary":{"en":"Mitigation means reducing the severity or harm of something; in law it can mean facts that lessen punishment, and in climate talk it often means cutting emissions to limit warming.","zh":"Mitigation 指“减轻、缓解”某事的严重性或伤害；在法律中可指从轻情节；在气候语境中常指通过减排来减缓变暖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making something harmful, serious, or painful less severe","zh":"缓解；减轻（伤害、严重性或痛苦）的行为"},"examples":[{"en":"The new policy is a mitigation measure to reduce air pollution.","zh":"这项新政策是一项减轻空气污染的缓解措施。"},{"en":"Wearing a seat belt is simple mitigation against injury in a crash.","zh":"系安全带是降低车祸受伤风险的简单缓解措施。"},{"en":"After the argument, he offered an apology in mitigation of her anger.","zh":"争吵后，他道歉以缓解她的怒气。"}]},{"partOfSpeech":"n.","definition":{"en":"(law) reasons or facts that make a punishment less severe, even if someone is guilty","zh":"（法律）减轻处罚的理由或情节（即使有罪也可从轻处理）"},"examples":[{"en":"The judge considered mitigation before sentencing.","zh":"法官在宣判前考虑了减轻处罚的情节。"},{"en":"His lack of prior offenses was presented as mitigation.","zh":"他没有前科被作为从轻情节提出。"}]},{"partOfSpeech":"n.","definition":{"en":"(environment/business) actions that reduce the causes of a problem—especially reducing greenhouse-gas emissions to limit climate change","zh":"（环境/商业）减排与控制成因的行动；尤指减少温室气体以限制气候变化（气候“减缓/缓解”）"},"examples":[{"en":"The company invests in carbon mitigation by using renewable energy.","zh":"公司通过使用可再生能源投资于减碳减缓措施。"},{"en":"Climate mitigation and adaptation are both necessary.","zh":"气候减缓与适应都很必要。"}]}],"synonyms":["reduction","relief","alleviation","lessening","moderation","risk control"],"phonetic":"/ˌmɪtəˈɡeɪʃən/","extraExplanation":["词源：mitigation 来自拉丁语 mitigare，意为“使柔和、使变轻”，所以核心感觉是“把强烈的东西变得不那么强”。","常见搭配：mitigation measures（缓解/减缓措施），risk mitigation（风险缓释），in mitigation of...（为了减轻……）。","易混点（气候语境）：mitigation 通常指“减缓/减排（解决原因）”，adaptation 指“适应（应对影响）”。"]}
{"word":"mitigations","summary":{"en":"Mitigations are measures that reduce harm or risk; in legal contexts, they can mean reducing seriousness or punishment due to special circumstances.","zh":"Mitigations 指用于降低危害或风险的措施；在法律语境中也可指因特殊情况而减轻严重性或减轻处罚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Actions or measures that reduce harm, risk, or negative effects (often used in topics like climate change, disasters, safety, cybersecurity, or medicine).","zh":"减轻危害/风险/负面影响的措施（常用于气候变化、灾害、安全、网络安全、医疗等话题）。"},"examples":[{"en":"The city added flood mitigations, such as higher seawalls and better drainage.","zh":"这座城市增加了防洪减灾措施，比如加高海堤和改善排水系统。"},{"en":"Cybersecurity mitigations include strong passwords and two-factor authentication.","zh":"网络安全的缓解/防护措施包括使用强密码和双重验证。"}]},{"partOfSpeech":"n.","definition":{"en":"In law, a reduction in the seriousness or punishment of something because of special circumstances.","zh":"（法律）由于特殊情况而减轻严重性或减轻处罚。"},"examples":[{"en":"The judge considered mitigating factors when deciding the sentence.","zh":"法官在判刑时考虑了从轻情节。"},{"en":"The defense argued for mitigation based on the defendant’s age.","zh":"辩方主张基于被告的年龄给予减轻处罚。"}]}],"synonyms":["protective measures","safeguards","countermeasures","risk controls","remedies"],"phonetic":"/ˌmɪtɪˈɡeɪʃənz/","extraExplanation":["“mitigations”是名词复数，单数是“mitigation”。在技术/工程语境里很常见，意思接近“防护措施、缓解措施”。","常见搭配：risk mitigations（风险缓解措施）、damage mitigation（减灾/减损）、mitigation measures（缓解措施）、mitigation strategy（缓解策略）。","易混词：mitigation（减轻影响）vs. prevention（预防、阻止发生）。很多情况下是“先预防，无法完全预防时再做mitigation”。"]}
{"word":"mitigative","summary":{"en":"Mitigative (adj.) means intended to reduce harm or negative effects; used mainly in formal contexts like risk and safety.","zh":"Mitigative（形容词）指“用于减轻伤害或负面影响的”，多见于风险、安全等正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to reduce harm, seriousness, or a negative effect; serving as mitigation.","zh":"旨在减轻伤害、严重性或负面影响的；起到“缓解/减轻（mitigation）”作用的。"},"examples":[{"en":"The company adopted mitigative measures to reduce the risk of data loss.","zh":"公司采取了减轻性措施，以降低数据丢失的风险。"},{"en":"Mitigative strategies can help limit the damage during a crisis.","zh":"缓解性策略可以在危机期间帮助把损害降到更低。"}]}],"synonyms":["mitigating","ameliorative","remedial","preventive"],"phonetic":"/ˈmɪtɪˌɡeɪtɪv/","extraExplanation":["“mitigative”在英语里能用，但整体上偏少见、偏正式，常见于风险管理、工程、安全、政策等语境。很多时候更自然的表达是“mitigation measures / risk mitigation / mitigating factors”。","常见搭配：mitigative measures（减轻性措施）、mitigative action（缓解行动）、mitigative effect（缓解效果）。如果你写学术或报告，也可以考虑用“mitigating”作定语（如 mitigating measures），更地道。"]}
{"word":"mitigator","summary":{"en":"A mitigator is something (or someone) that reduces harm, severity, or risk.","zh":"mitigator 指“能减轻伤害/严重性/风险的人、事物或措施”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, thing, or action that reduces the harm, severity, or negative effects of something","zh":"缓解者；减轻因素；用于降低某事的伤害、严重性或负面影响的人、事物或措施"},"examples":[{"en":"Regular stretching can be a mitigator of back pain for some people.","zh":"对一些人来说，规律拉伸可以作为缓解背痛的方式。"},{"en":"Wearing a seat belt is an important mitigator of injury in car accidents.","zh":"系安全带是降低车祸受伤风险的重要措施。"},{"en":"In negotiations, a sincere apology can be a mitigator that reduces conflict.","zh":"在谈判中，真诚的道歉可能成为缓和矛盾的因素。"}]},{"partOfSpeech":"n.","definition":{"en":"in business or risk management, a measure used to lower risk or limit damage","zh":"（商业/风险管理）风险缓释措施；用于降低风险或限制损失的手段"},"examples":[{"en":"Insurance is a common mitigator for financial risk.","zh":"保险是常见的金融风险缓释手段。"},{"en":"Having backups is a mitigator against data loss.","zh":"做备份是防止数据丢失的缓释措施。"}]}],"synonyms":["alleviator","buffer","moderator","countermeasure","risk reducer"],"phonetic":"/ˈmɪtɪˌɡeɪtər/","extraExplanation":["“mitigator”来自动词“mitigate”（减轻、缓和）。英语里更常见的搭配是“risk mitigator（风险缓释因素/措施）”或“a mitigator of + 名词”。在日常表达中，人们也常用更口语的说法，比如“something that helps reduce…”（能帮助减少……的东西）。","学习提示：不要和“mediator（调解人）”混淆。mediator是“在双方之间调解的人”，而mitigator强调“把坏影响变小”的人/因素/措施。"]}
{"word":"mitigators","summary":{"en":"Mitigators are people, factors, or measures that reduce harm or risk; in law, they can mean circumstances that lessen punishment.","zh":"Mitigators 指能降低危害或风险的人/因素/措施；在法律语境中也可指减轻处罚的情节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that make a harmful situation less severe (for example, reducing risk, damage, or negative effects).","zh":"（人或事物）用于缓解、减轻危害或负面影响的因素；减灾/降风险措施。"},"examples":[{"en":"Vaccines and good ventilation are important mitigators of infectious disease spread.","zh":"疫苗接种和良好通风是减缓传染病传播的重要缓解因素。"},{"en":"In the report, the researchers listed mitigators such as training, protective equipment, and clear rules.","zh":"在报告中，研究人员列出了培训、防护装备和明确规则等缓解措施。"}]},{"partOfSpeech":"n.","definition":{"en":"In law or discipline, facts or actions that reduce how serious a punishment or judgment should be (often called “mitigating factors”).","zh":"（法律/纪律领域）可降低处罚或责任严重程度的情节（常称“减轻情节/从轻因素”）。"},"examples":[{"en":"The judge considered several mitigators before deciding the sentence.","zh":"法官在量刑前考虑了若干减轻情节。"},{"en":"A sincere apology can be a mitigator, though it may not erase the harm.","zh":"真诚道歉可能成为减轻情节，但并不一定能消除伤害。"}]}],"synonyms":["reducers","buffers","protective factors","safeguards","countermeasures","mitigating factors"],"phonetic":"/ˈmɪtɪˌɡeɪtərz/","extraExplanation":["“Mitigators”来自动词 mitigate（减轻、缓和）。日常写作中更常见的搭配是 mitigation measures（缓解/减灾措施）、risk mitigators（风险缓释因素）、mitigating factors（减轻情节）。","这个词常用于较正式的语境（科研、政策、风险管理、法律）。口语里人们更常说 things that help / ways to reduce the risk（能帮上忙的办法/降低风险的方式）。"]}
{"word":"mitigatory","summary":{"en":"Mitigatory means “reducing the severity or harmful effect of something.”","zh":"Mitigatory 意为“用于减轻严重性或不良影响的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to reduce the severity of something (such as a punishment, criticism, or a harmful effect); serving to lessen the impact.","zh":"用于减轻某事的严重性（如惩罚、批评或不良影响）；起到缓和作用的。"},"examples":[{"en":"The judge considered several mitigatory factors before deciding the sentence.","zh":"法官在决定量刑前考虑了几项减轻情节。"},{"en":"The company offered a refund as a mitigatory measure after the service failure.","zh":"服务出问题后，公司提供退款作为一种缓解措施。"}]}],"synonyms":["mitigating","ameliorative","palliative","alleviating"],"phonetic":"/ˈmɪtɪɡəˌtɔri/","extraExplanation":["“Mitigatory”在现代英语中属于较不常见的用法，更常见的是“mitigating”（减轻的）或“mitigative”（缓和的）。在法律语境里，人们尤其常说“mitigating factors”（减轻情节）。","词根来自拉丁语“mitigare”，核心含义是“使变得温和、减轻”。因此它常与惩罚、责任、伤害、后果等搭配。","使用建议：如果你在写作中想更自然，通常用“mitigating”更地道；“mitigatory”也正确，但会显得更书面、偏专业或偏旧式。"]}
{"word":"miting","summary":{"en":"“Miting” is most commonly a Philippine-English word meaning a public (often political) meeting or rally; in standard dictionaries it can also mean the rare present participle of “mite.”","zh":"“miting”最常见于菲律宾英语，表示（常为政治性的）公众集会/造势；在标准词典里它也可指“mite”的罕见现在分词形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philippine English; borrowed from English “meeting”) a public meeting or rally, especially for politics or social issues.","zh":"（菲律宾英语；源自英语 meeting）集会；（尤指政治或社会议题的）群众大会/造势活动。"},"examples":[{"en":"The candidates held a miting in the town plaza.","zh":"候选人在镇广场举行了一场集会。"},{"en":"We joined the miting to show support for the new policy.","zh":"我们参加集会来表达对新政策的支持。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare; dictionary form) present participle of “mite” (to remove mites; to infest with mites).","zh":"（罕见；词典用法）mite（除螨/长螨）的现在分词：miting。"},"examples":[{"en":"The vet recommended treating the animals and then checking if they are still miting.","zh":"兽医建议先给动物治疗，再检查是否仍在长螨（或受螨虫侵扰）。"}]}],"synonyms":["rally","public meeting","assembly","demonstration","meeting"],"phonetic":"/ˈmaɪtɪŋ/","extraExplanation":["“miting”在美国英语里非常少见；你更常见到的是“meeting”。在菲律宾（以及部分受英语影响的语境里），“miting”常专指政治集会/造势活动，语感更接近“rally”。","如果你本来想拼的是“meeting”（会议/见面），告诉我你的句子，我可以帮你选用“meeting / rally / assembly / demonstration”等更自然的词。"]}
{"word":"mitis","summary":{"en":"*mitis* is a Latin word meaning “mild/gentle,” commonly used in scientific (species) names.","zh":"*mitis* 是拉丁语，意思是“温和/轻微”，常用于生物的学名（种加词）中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in scientific names) “mild,” “gentle,” or “soft.” Often appears as a species name (a *specific epithet*) to describe an organism’s characteristics.","zh":"（拉丁语；常用于学名）“温和的 / 柔和的 / 轻微的”。常作为生物学命名中的“种加词”，用来描述生物的特征。"},"examples":[{"en":"In Latin, *mitis* can describe something gentle or mild.","zh":"在拉丁语中，*mitis* 可用来形容“温和的、轻微的”。"},{"en":"In biology, *mitis* is used in names like *Streptococcus mitis*.","zh":"在生物学中，*mitis* 常出现在学名里，例如 *Streptococcus mitis*（缓症链球菌）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Used as a label in taxonomy) the second word in a scientific name that identifies the species (e.g., *mitis* in *X mitis*).","zh":"（分类学用法）学名中的第二个词，用来标识物种（例如 *X mitis* 里的 *mitis*）。"},"examples":[{"en":"In *Streptococcus mitis*, “*mitis*” is the species epithet.","zh":"在 *Streptococcus mitis* 中，“*mitis*” 是种加词。"}]}],"synonyms":["mild","gentle","soft"],"phonetic":"/ˈmaɪtɪs/","extraExplanation":["*mitis* 不是常见的现代英语单词，更常见于拉丁语语境或科学/医学写作中（尤其是生物分类命名）。","如果你是在课本、论文或医学检验报告里看到 *mitis*，通常不需要把它当作“英语词汇”来背，而是理解它在学名里表达“温和/轻微”的描述性含义即可。"]}
{"word":"mitises","summary":{"en":"“Mitises” is a rare word meaning the plural of “mitis” (a type of wrought iron). Many people actually mean “mitoses” (plural of mitosis).","zh":"“Mitises”很少见，表示“mitis”的复数（某种熟铁/锻铁的类型）。很多人其实想写的是“mitoses”（mitosis“有丝分裂”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **mitis** (a type of wrought iron).","zh":"**mitis** 的复数形式（指一种熟铁/锻铁的类型）。"},"examples":[{"en":"The catalog listed several mitises used for decorative gates.","zh":"目录里列出了几种用于装饰门的 mitises（不同类型的熟铁）。"},{"en":"Older metalworking notes sometimes mention mitises alongside other iron types.","zh":"一些较旧的金工笔记会把 mitises 和其他铁材类型一起提到。"}]}],"synonyms":["wrought iron"],"phonetic":"/ˈmaɪtɪsɪz/","extraExplanation":["“mitises”在日常英语里非常少见，多数人看到会以为你想写的是 **mitoses**（**mitosis** 的复数，指“有丝分裂”）。如果你是在生物课/作业里用词，正确拼写通常是：**mitosis → mitoses**（不是 mitises）。","“mitis”还有一个较专业的医学形容词用法，表示“毒力较弱/较不致病的”（如某些细菌株）；不过那个用法的复数一般不会写成“mitises”，而是根据语法写作相应形式。"]}
{"word":"mitochondria","summary":{"en":"Mitochondria are cell organelles that produce energy (ATP) through respiration.","zh":"线粒体是细胞内负责通过细胞呼吸产生能量（ATP）的细胞器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organelle inside most plant and animal cells that produces most of the cell’s usable energy (ATP) through respiration; often called the “powerhouse of the cell.”","zh":"线粒体：存在于大多数动植物细胞内的一种细胞器，通过细胞呼吸产生细胞可用的大部分能量（ATP）；常被称为“细胞的能量工厂/动力工厂”。"},"examples":[{"en":"Muscle cells contain many mitochondria because they need lots of energy.","zh":"肌肉细胞含有大量线粒体，因为它们需要很多能量。"},{"en":"In biology class, we learned that mitochondria make ATP during cellular respiration.","zh":"在生物课上，我们学到线粒体在细胞呼吸中制造ATP。"},{"en":"Some diseases affect how mitochondria function, leading to low energy in the body.","zh":"有些疾病会影响线粒体的功能，导致身体能量不足。"}]}],"synonyms":["powerhouse of the cell (nickname)","organelle"],"phonetic":"ˌmaɪtəˈkɑndriə","extraExplanation":["“Mitochondria”是复数形式；单数是“mitochondrion”（线粒体，单个）。日常写作中，人们有时会用“mitochondria”泛指整体，也很常见。","线粒体有自己的DNA（mtDNA），并且通常主要通过母系遗传；这也是“母系线粒体DNA”常用于追踪家族谱系/人群迁徙研究的原因之一。","网络梗“mitochondria is the powerhouse of the cell”源自美国中学/高中生物课的高频考点，因此常被用来玩笑式地表示“这题我会”。"]}
{"word":"mitochondrial","summary":{"en":"Mitochondrial means “related to mitochondria,” the energy-producing parts of cells.","zh":"mitochondrial 意为“与线粒体有关的”，线粒体是细胞内负责产能的重要结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to mitochondria (the small parts inside most cells that produce energy).","zh":"与线粒体有关的（线粒体是细胞内产生能量的重要结构）。"},"examples":[{"en":"Doctors ordered a mitochondrial DNA test to check for certain inherited conditions.","zh":"医生安排了线粒体 DNA 检测，以排查某些遗传性疾病。"},{"en":"The researcher studied mitochondrial function in muscle cells after exercise.","zh":"研究人员观察运动后肌肉细胞的线粒体功能。"},{"en":"Some rare diseases are caused by mitochondrial disorders that affect how cells make energy.","zh":"一些罕见疾病由线粒体疾病引起，会影响细胞产生能量的方式。"}]}],"synonyms":["mitochondrial (rare)"],"phonetic":"/ˌmaɪtoʊˈkɑːndrɪəl/","extraExplanation":["“mitochondrial”来自名词“mitochondrion / mitochondria（线粒体/线粒体们）”。它常见于生物、医学语境，比如“mitochondrial DNA（线粒体DNA）”。","在遗传学里常会提到“mitochondrial inheritance（线粒体遗传）”，因为线粒体DNA通常主要来自母亲（因此也常说“maternal inheritance 母系遗传”）。","学习搭配：mitochondrial function（线粒体功能）、mitochondrial disease/disorder（线粒体疾病/障碍）、mitochondrial membrane（线粒体膜）、mitochondrial genome（线粒体基因组）。"]}
{"word":"mitochondrion","summary":{"en":"A mitochondrion is a cell part that makes energy (ATP) through cellular respiration.","zh":"mitochondrion 指“线粒体”，是细胞内制造能量（ATP）的细胞器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organelle inside most eukaryotic cells that produces energy (ATP) through cellular respiration; often called the “powerhouse of the cell.”","zh":"线粒体：存在于大多数真核细胞内的细胞器，通过细胞呼吸产生能量（ATP），常被称为“细胞的能量工厂”。"},"examples":[{"en":"Muscle cells contain many mitochondria because they need lots of energy.","zh":"肌肉细胞含有许多线粒体，因为它们需要大量能量。"},{"en":"During cellular respiration, the mitochondrion helps convert nutrients into ATP.","zh":"在细胞呼吸过程中，线粒体帮助把营养物质转化为ATP。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often used in plural) The specific mitochondria in a cell or tissue, discussed as a group (e.g., “mitochondria in the liver”).","zh":"（常用复数）指某个细胞或组织中的线粒体群体，例如“肝脏中的线粒体”。"},"examples":[{"en":"Scientists studied mitochondria in brain tissue to better understand aging.","zh":"科学家研究脑组织中的线粒体，以更好地理解衰老。"}]}],"synonyms":["mitochondria (plural form)","organelle (broader term)"],"phonetic":"/ˌmaɪ.toʊˈkɑn.dri.ən/","extraExplanation":["补充记忆：单数是 *mitochondrion*，复数是 *mitochondria*（很多学生容易混淆）。","词源提示：来自希腊语 *mitos*（线）+ *chondrion*（小颗粒），与早期显微镜下看到的形状有关。","文化小知识：你可能在网络上见过“the powerhouse of the cell”的梗，这句话常出现在美国中学生物课里，因此成了流行的学习梗。"]}
{"word":"mitogen","summary":{"en":"A mitogen is a substance that stimulates cells to divide (especially by triggering mitosis).","zh":"mitogen 指能刺激細胞分裂（尤其啟動有絲分裂）的物質。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (such as a protein or chemical) that triggers a cell to start dividing, especially by stimulating mitosis.","zh":"（生物學）促使細胞開始分裂的物質（如蛋白質或化學物質），尤其是透過刺激有絲分裂（mitosis）來促進細胞增殖。"},"examples":[{"en":"In the lab, scientists added a mitogen to make the immune cells divide faster.","zh":"在實驗室裡，科學家加入一種促分裂原（mitogen），讓免疫細胞分裂得更快。"},{"en":"Some mitogens are used to test how strongly a person’s lymphocytes respond.","zh":"某些促分裂原可用來測試一個人的淋巴細胞反應有多強。"}]}],"synonyms":["mitotic stimulant","cell-division stimulator","proliferation signal"],"phonetic":"/ˈmaɪtəˌdʒɛn/","extraExplanation":["字根提示：mitogen 可拆成 mito-（和「有絲分裂」mitosis 有關）+ -gen（產生、引發）。所以它的核心意思是「引發細胞分裂的東西」。","常見語境：免疫學與細胞生物學中很常見，特別是在培養淋巴細胞時，用某些 mitogens 來『刺激細胞增殖』，方便觀察或做檢測。","易混詞：mitogen（促進細胞分裂的刺激物）不等於 carcinogen（致癌物）。有些物質可能同時具有促增殖作用並提高癌變風險，但兩個詞在意義上不必然等同。"]}
{"word":"mitogenetic","summary":{"en":"Mitogenetic means “related to or stimulating mitosis (cell division).” It can also refer historically to the controversial idea of “mitogenetic radiation” from dividing cells.","zh":"Mitogenetic 指“与有丝分裂有关或能促进细胞分裂的”。它也可指历史上颇具争议的“促分裂辐射（mitogenetic radiation）”概念。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Related to, producing, or stimulating mitosis (cell division); mitosis-inducing.","zh":"（生物学）与有丝分裂有关的；能引起或促进细胞有丝分裂的；促分裂的。"},"examples":[{"en":"Certain growth factors have a strong mitogenetic effect on lymphocytes.","zh":"某些生长因子对淋巴细胞具有很强的促分裂作用。"},{"en":"Researchers tested whether the compound was mitogenetic in cultured cells.","zh":"研究人员测试该化合物在培养细胞中是否具有促分裂性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Historical/biophysics) Relating to “mitogenetic radiation,” a proposed ultra-weak radiation (often described as ultraviolet) thought to be emitted by dividing cells and to stimulate division in other cells.","zh":"（历史/生物物理）与“促分裂辐射（mitogenetic radiation）”有关：一种曾被提出的极微弱辐射（常被描述为紫外线），被认为由分裂中的细胞发出，并能刺激其他细胞分裂。"},"examples":[{"en":"Early 20th-century papers discussed mitogenetic rays and their possible biological effects.","zh":"20世纪早期的论文讨论了促分裂射线及其可能的生物学效应。"},{"en":"The mitogenetic-radiation hypothesis became controversial after many failed replications.","zh":"在多次重复实验未能证实后，促分裂辐射假说变得颇具争议。"}]}],"synonyms":["mitogenic","mitosis-inducing","proliferative"],"phonetic":"/ˌmaɪtoʊdʒəˈnɛtɪk/","extraExplanation":["“mitogenetic”常见于两类语境：\n1）现代细胞生物学里，多用来表示“促使细胞进入有丝分裂”的作用，意思接近 *mitogenic*。\n2）历史上与俄/苏生物学家 Alexander Gurwitsch（古尔维奇）在1920年代提出的“mitogenetic radiation（促分裂辐射/射线）”相关：他认为分裂细胞会发出极弱的（常说是紫外）辐射，从而影响附近细胞分裂。后来大量实验重复多为阴性或结果不一致，因此在英美学界逐渐被搁置；此后在“超弱光子发射/生物光子（biophotons）”研究中偶有被重新讨论，但“能特异性促分裂”的原始主张依然属于争议话题。"]}
{"word":"mitogenic","summary":{"en":"Mitogenic means “causing cells to begin dividing and multiplying.”","zh":"Mitogenic 指“促使细胞开始分裂增殖的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing cells (especially immune or other body cells) to start dividing and multiplying.","zh":"促使细胞（尤其是免疫细胞或其他体细胞）开始分裂增殖的。"},"examples":[{"en":"The researchers tested whether the compound had a mitogenic effect on human T cells.","zh":"研究人员检测这种化合物是否对人类T细胞具有促分裂（促增殖）作用。"},{"en":"Some growth factors are strongly mitogenic in certain tissues.","zh":"一些生长因子在某些组织中具有很强的促分裂作用。"}]}],"synonyms":["proliferative","growth-promoting"],"phonetic":"/ˌmaɪtəˈdʒɛnɪk/","extraExplanation":["“mitogenic”来自“mitosis（有丝分裂）+ -genic（引起……的）”，常见于生物学、免疫学与肿瘤学语境。","相关常见搭配：mitogenic signal（促分裂信号）、mitogenic stimulus（促分裂刺激）、mitogenic activity（促分裂活性）、mitogenic pathway（促分裂通路）。","近义表达（语感接近但不完全等同）：proliferative（促增殖的）、growth-promoting（促进生长的）。其中“mitogenic”更强调“触发细胞进入分裂周期”。"]}
{"word":"mitogenicity","summary":{"en":"Mitogenicity means how strongly something can make cells start dividing and increase in number.","zh":"Mitogenicity 指某种物质让细胞开始分裂并增殖的能力或强度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of a substance (or factor) to trigger mitosis (cell division) and stimulate cell proliferation","zh":"（物质或因子）诱导有丝分裂并促进细胞增殖的能力"},"examples":[{"en":"Researchers tested the mitogenicity of the new growth factor in human lymphocytes.","zh":"研究人员在人体淋巴细胞中测试了这种新生长因子的促分裂活性。"},{"en":"Low mitogenicity is often desirable for biomaterials used in long-term implants.","zh":"用于长期植入的生物材料通常希望具有较低的促分裂活性。"}]}],"synonyms":["mitogenic potential","proliferative activity","cell proliferation–inducing activity"],"phonetic":"/ˌmaɪtəˌdʒɛˈnɪsɪti/","extraExplanation":["“mitogenicity”常见于生物医学与毒理学语境，用来评估某种蛋白、化学物、材料或提取物是否会让细胞“更爱分裂”。在免疫学中也会用来描述某些刺激物对淋巴细胞增殖的影响（例如做细胞增殖实验、剂量反应曲线）。","词形上可联想：mitogen（促分裂原）+ -ic（……的）+ -ity（性质/程度）。因此它强调的是“促分裂的性质/强度”，而不只是“发生了细胞增殖”。","注意区分：mitogenicity（促分裂能力）≠ mutagenicity（致突变性）。前者是让细胞分裂增多，后者是引起DNA突变；两者在安全性评估中意义不同。"]}
{"word":"mitogens","summary":{"en":"Mitogens are substances that trigger cells (especially immune cells) to start dividing and multiplying.","zh":"Mitogens 指能促使细胞（尤其免疫细胞）启动分裂与增殖的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (such as certain proteins or chemicals) that stimulate cells—especially immune cells—to begin dividing and multiplying.","zh":"（有丝分裂）促进物：能刺激细胞（尤其是免疫细胞）开始分裂、增殖的物质（如某些蛋白质或化学物）。"},"examples":[{"en":"In the lab, mitogens can be used to make lymphocytes divide so scientists can study them.","zh":"在实验室里，促有丝分裂物可用来让淋巴细胞分裂，方便科学家进行研究。"},{"en":"Doctors and researchers measure how strongly cells respond to mitogens to evaluate immune function.","zh":"医生和研究人员会测量细胞对促有丝分裂物的反应强度，以评估免疫功能。"}]}],"synonyms":["cell-growth stimulant","proliferation inducer","mitotic stimulant"],"phonetic":"ˈmaɪtəˌdʒɛn","extraExplanation":["词源提示：mitogen = mito-（与“有丝分裂 mitosis”相关）+ -gen（“引发/产生”）。所以它字面意思就是“引发细胞分裂的东西”。","常见语境：该词多见于免疫学与细胞生物学实验，例如用某些植物凝集素或抗体作为“mitogen”来刺激T细胞/ B细胞增殖，再观察细胞活性、信号通路或药物效果。","注意区分：mitogen（促进细胞分裂的刺激物）不等同于 carcinogen（致癌物）。有些刺激细胞增殖的因素在特定条件下可能与肿瘤研究相关，但两者不是同一个概念。"]}
{"word":"mitokoromono","summary":{"en":"Mitokoromono is a Japanese term for a coordinated set of three matching sword fittings (kozuka, kōgai, and a pair of menuki).","zh":"Mitokoromono（日本刀装术语）指“三所物”：三件风格一致、成套的刀装小配件（小柄、笄与一对目贯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Japanese art / arms) A set of three matching sword fittings, typically consisting of a kozuka (handle of a small by-knife), a kōgai (hairdressing tool), and a pair of menuki (ornamental grip fittings).","zh":"（日本美术／武具）三所物：一套三件成组、风格一致的日本刀装小配件，通常包括小柄（kozuka，小刀柄）、笄（kōgai，发饰工具）以及目贯一对（menuki，刀柄装饰件）。 ([metmuseum.org](https://www.metmuseum.org/art/collection/search/34765?utm_source=openai))"},"examples":[{"en":"The museum displayed a mitokoromono with the same floral design across the kozuka, kōgai, and menuki.","zh":"博物馆展出了一套三所物，小柄、笄和目贯上都是同样的花卉纹样。"},{"en":"Collectors value a mitokoromono because the three pieces are designed as one coordinated set.","zh":"收藏家重视三所物，因为三件配件是按“同一套”统一设计的。"}]}],"synonyms":["three-piece set of sword fittings","(Japanese) 三所物"],"phonetic":"/ˌmiːtoʊˌkɔːroʊˈmoʊnoʊ/","extraExplanation":["「Mitokoromono」是日语罗马字拼写，常写作「三所物」。它属于日本刀装（tōsōgu，刀的金工配件）领域的用语，强调“三件为一组、题材与工艺统一”的搭配概念。 ([metmuseum.org](https://www.metmuseum.org/art/collection/search/34765?utm_source=openai))","在英文语境中它多出现在博物馆说明牌、拍卖图录或收藏圈文章里，通常不作为日常词汇使用。 ([metmuseum.org](https://www.metmuseum.org/art/collection/search/34765?utm_source=openai))"]}
{"word":"mitome","summary":{"en":"Mitome is a rare biology term for a supposed fine network in cell protoplasm, mainly used in older scientific texts.","zh":"Mitome 是一个较罕见的生物学术语，指被认为存在于细胞原生质中的细微网状结构，多见于较早期文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, rare/old term) A supposed threadlike or fibrillar network (“reticulum”) within cell protoplasm; an early idea about cell structure found in older scientific writing.","zh":"（生物学；较少见/偏旧用法）指一种被认为存在于细胞原生质中的丝状/纤维状网状结构（“网状体”）；常见于较早期的细胞结构理论或文献中。"},"examples":[{"en":"Some early microscopy texts described a *mitome* as a fine network inside the cell’s protoplasm.","zh":"一些早期显微学教材把 *mitome* 描述为细胞原生质内部的细微网状结构。"},{"en":"Modern cell biology doesn’t usually use the term *mitome*; it appears mainly in historical discussions.","zh":"现代细胞生物学通常不再使用 *mitome* 这个词；它多出现在历史回顾类讨论中。"}]}],"phonetic":"/ˈmaɪtˌoʊm/","extraExplanation":["这个词在现代英语里非常罕见，主要见于旧式细胞学/显微学语境；如果你是在现代生物或医学材料里看到，更常见的是 *mitosome*（另一术语）或与“mitochondria（线粒体）”相关的词，但 *mitome* 本身并不等同于“线粒体”。","如果你输入的“mitome”其实是日语罗马字，常见对应是动词「認める（mitomeru）」的词干，意思接近“承认、认可、同意、认出”；另外「認め印（mitome-in）」是日本日常使用的印章类型（未登记的个人印章）。"]}
{"word":"mitomycin","summary":{"en":"Mitomycin is a chemotherapy drug used to slow or stop cancer cell growth and is sometimes used in eye surgery to reduce scarring.","zh":"丝裂霉素是一种化疗药物，用于抑制癌细胞生长，也有时用于眼科手术以减少瘢痕增生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemotherapy drug (an antitumor antibiotic) used to stop cancer cells from growing; it is used in some cancers and also sometimes applied directly during certain eye surgeries to reduce scarring","zh":"丝裂霉素：一种化疗药物（抗肿瘤抗生素），用于抑制癌细胞生长；也可在某些眼科手术中局部使用以减少瘢痕增生"},"examples":[{"en":"The doctor explained that mitomycin may be used as part of a chemotherapy plan.","zh":"医生解释说，丝裂霉素可能会作为化疗方案的一部分使用。"},{"en":"In some eye procedures, a tiny amount of mitomycin is applied to help prevent scarring.","zh":"在一些眼科手术中，会局部使用少量丝裂霉素来帮助预防瘢痕形成。"}]}],"synonyms":["mitomycin C","chemotherapy drug","antitumor antibiotic"],"phonetic":"/ˌmaɪtoʊˈmaɪsɪn/","extraExplanation":["丝裂霉素（mitomycin，常见为 mitomycin C）属于“抗肿瘤抗生素”类药物，既有抗生素的来源背景，但临床上主要用于抗癌而不是抗感染。","它通过与 DNA 结合并形成交联来阻止细胞复制，因此对快速分裂的细胞影响更明显；这也是化疗药物常见作用机制之一。","在医学英语里它通常作为不可数名词使用（例如：receive mitomycin / treatment with mitomycin）。"]}
{"word":"mitoses","summary":{"en":"“Mitoses” is the plural of “mitosis,” meaning cell divisions that produce two genetically identical daughter cells.","zh":"“mitoses”是“mitosis（有丝分裂）”的复数，指产生两个遗传信息几乎相同子细胞的多次细胞分裂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mitosis**: the process in which one cell divides to produce two genetically identical daughter cells (used for growth, repair, and asexual reproduction in many organisms).","zh":"**mitosis（有丝分裂）**的复数：指一个细胞分裂形成两个遗传信息几乎完全相同的子细胞的过程（常用于生长、修复，以及许多生物的无性繁殖）。"},"examples":[{"en":"Under the microscope, the students counted several **mitoses** in the tissue sample.","zh":"在显微镜下，学生们在组织样本中数到了好几个**有丝分裂**的细胞。"},{"en":"Rapid cell growth can involve many **mitoses** happening in a short time.","zh":"细胞快速生长时，可能会在短时间内发生很多次**有丝分裂**。"},{"en":"Doctors sometimes look for abnormal **mitoses** when evaluating possible cancer.","zh":"医生在评估是否可能为癌症时，有时会观察是否存在异常的**有丝分裂**。"}]}],"synonyms":["cell division (in context)"],"phonetic":"/maɪˈtoʊsɪs/","extraExplanation":["“mitoses”通常出现在生物学/医学语境里，强调“发生了多次有丝分裂”或“看到多个处于分裂期的细胞”。单数是 **mitosis**，复数才写 **mitoses**（拼写变化：-is → -es）。","有丝分裂与 **meiosis（减数分裂）**不同：mitosis 产生两个几乎相同的子细胞；meiosis 通常与产生配子（精子/卵子）相关，会导致染色体数减半。"]}
{"word":"mitosis","summary":{"en":"Mitosis is a type of cell division that makes two identical cells, used for growth and repair.","zh":"Mitosis（有丝分裂）是产生两个几乎完全相同子细胞的细胞分裂方式，主要用于生长和修复。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process in which one cell divides to form two genetically identical daughter cells (mainly for growth, repair, and asexual reproduction in some organisms).","zh":"（有丝分裂）一种细胞分裂过程：一个细胞分裂形成两个遗传信息几乎完全相同的子细胞（主要用于生长、修复；部分生物也用于无性繁殖）。"},"examples":[{"en":"Human skin cells use mitosis to replace damaged cells.","zh":"人体皮肤细胞通过有丝分裂来替换受损细胞。"},{"en":"During childhood, mitosis happens frequently because the body is growing fast.","zh":"在童年时期，由于身体快速生长，有丝分裂发生得很频繁。"},{"en":"Mistakes in mitosis can sometimes contribute to diseases like cancer.","zh":"有丝分裂过程中出现错误有时会与癌症等疾病有关。"}]}],"synonyms":["cell division","mitotic division"],"phonetic":"/maɪˈtoʊsɪs/","extraExplanation":["有丝分裂（mitosis）常被拿来和减数分裂（meiosis）对比：mitosis 产生**两个**几乎相同的细胞，染色体数目通常不变；meiosis 主要用于产生精子/卵子，产生**四个**细胞，染色体数目减半。","mitosis 这个词来自希腊语 *mitos*（“线”），因为在显微镜下，染色体在分裂时看起来像细细的线。","课堂里常见的阶段记忆是 PMAT：prophase（前期）、metaphase（中期）、anaphase（后期）、telophase（末期）。日常英文里也会说 a cell is undergoing mitosis（细胞正在进行有丝分裂）。"]}
{"word":"mitosome","summary":{"en":"A mitosome is a mitochondria-derived organelle found in some microorganisms; it is a reduced “mitochondrion” that usually cannot produce ATP.","zh":"mitosome（线粒体残迹）是某些微生物中由线粒体演化而来的简化细胞器，通常不能产生ATP。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tiny organelle in some eukaryotic microorganisms that evolved from mitochondria but has lost most typical mitochondrial functions (such as making ATP).","zh":"某些真核微生物细胞内的一种微小细胞器，由线粒体演化而来，但已丧失大多数典型线粒体功能（如产生ATP）。"},"examples":[{"en":"Microsporidia do not have normal mitochondria; instead, they contain mitosomes.","zh":"微孢子虫没有正常的线粒体；相反，它们含有线粒体残迹（mitosomes）。"},{"en":"A mitosome is mitochondria-derived, but it cannot perform oxidative phosphorylation.","zh":"线粒体残迹来源于线粒体，但不能进行氧化磷酸化。"}]}],"synonyms":["mitochondria-derived organelle","reduced mitochondrion"],"phonetic":"/ˈmaɪtəˌsoʊm/","extraExplanation":["“Mitosome”常被译为“线粒体残迹”（也有人译作“线粒体体/线粒体小体”），强调它是线粒体的“退化/简化版本”。","它常见于一些寄生或生活环境特殊的真核生物（例如微孢子虫、某些贾第虫相关生物）。这些生物在演化过程中不再需要典型线粒体的能量产生途径，于是线粒体被大幅“精简”。","虽然线粒体残迹通常不负责产生ATP，但往往仍保留对细胞很关键的功能，比如与铁-硫簇（Fe–S clusters）相关的代谢步骤（不同生物可能有所差异）。","词源构成：mito-（指线粒体）+ -some（“体/小体”，表示结构或颗粒），因此从字面可理解为“线粒体样的小体”。"]}
{"word":"mitotic","summary":{"en":"Mitotic means “related to mitosis,” especially cell division in growth/repair, and in medicine it can describe tissue with many dividing cells.","zh":"Mitotic 指“与有丝分裂有关”，多用于生长/修复的细胞分裂；在医学中也可指组织里分裂细胞很多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to mitosis: the process in which a cell divides to produce two genetically identical daughter cells (common in growth and tissue repair).","zh":"与有丝分裂有关的：细胞分裂产生两个遗传物质相同的子细胞（常见于生长与组织修复）。"},"examples":[{"en":"Skin cells are constantly replaced through mitotic division.","zh":"皮肤细胞会通过有丝分裂不断更新。"},{"en":"The lab measured mitotic activity to estimate how fast the cells were growing.","zh":"实验室测量有丝分裂活性来估算细胞生长速度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In medicine/biology) Describing cells or tissues that show many cells undergoing mitosis (often discussed in cancer and pathology).","zh":"（医学/生物学）形容细胞或组织中有很多细胞正在进行有丝分裂（常用于癌症与病理学讨论）。"},"examples":[{"en":"The biopsy showed a high mitotic rate.","zh":"活检显示有丝分裂率较高。"},{"en":"Doctors sometimes describe aggressive tumors as having many mitotic figures.","zh":"医生有时会把有许多“有丝分裂象”的肿瘤描述为更具侵袭性。"}]}],"synonyms":["mitosis-related","mitotic (cell) division (common phrase)"],"phonetic":"/maɪˈtɑːtɪk/","extraExplanation":["“mitotic”来自“mitosis”（有丝分裂），而“mitosis”源自希腊语 *mitos*（线、纱），因为分裂时染色体看起来像线一样。","常见搭配：mitotic division（有丝分裂）、mitotic rate/index（有丝分裂率/指数）、mitotic figure（有丝分裂象，显微镜下看到的分裂形态）。","易混词：meiotic（减数分裂的）。有丝分裂→两个相同细胞；减数分裂→产生生殖细胞，染色体数目减半。"]}
{"word":"mitotically","summary":{"en":"Mitotically means “in a way related to mitosis,” usually describing how cells divide or how active they are in division.","zh":"mitotically 表示“以与有丝分裂相关的方式”，常用于描述细胞如何分裂或分裂活动的程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to mitosis (the process in which one cell divides to form two genetically identical cells).","zh":"以与有丝分裂相关的方式（有丝分裂是一个细胞分裂形成两个遗传信息相同细胞的过程）。"},"examples":[{"en":"These tissue cells divide mitotically to repair damage.","zh":"这些组织细胞通过有丝分裂来修复损伤。"},{"en":"The drug targets cells that are growing mitotically fast.","zh":"这种药物针对那些通过有丝分裂快速增殖的细胞。"}]}],"synonyms":["by mitosis","in a mitotic manner"],"phonetic":"/maɪˈtɑːtɪkli/","extraExplanation":["“mitotically”是副词，来自“mitotic（有丝分裂的）+ -ally”。在生物/医学写作中常见，用来说明细胞分裂发生的方式或与细胞周期相关的特征。","常见搭配：divide mitotically（进行有丝分裂）、mitotically active（有丝分裂活跃的）、mitotically arrested（有丝分裂停滞的，常见于药物作用描述）。"]}
{"word":"mitra","summary":{"en":"Mitra most commonly means “friend/ally” (from Sanskrit and South Asian languages) and can also refer to a Vedic deity named Mitra.","zh":"Mitra最常见的意思是“朋友/盟友”（源自梵语及南亚语言），也可指吠陀传统中的神祇Mitra。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South Asian word (from Sanskrit) meaning “friend” or “ally,” often used as a respectful form of address or as a surname/given name","zh":"（源自梵语的南亚词）意为“朋友 / 盟友”，也常用作尊称或姓氏/名字"},"examples":[{"en":"In Hindi, “mitra” can mean a friend or companion.","zh":"在印地语里，“mitra”可以表示朋友或同伴。"},{"en":"He introduced Mitra as his longtime collaborator and friend.","zh":"他介绍Mitra是他多年的合作伙伴和朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"in Hindu tradition, a Vedic deity associated with friendship, agreements, and social harmony (often mentioned together with Varuna)","zh":"（印度教/吠陀传统）与友谊、契约与社会秩序相关的神祇（常与伐楼那Varuna并提）"},"examples":[{"en":"Mitra is sometimes described as a guardian of friendship and promises.","zh":"Mitra有时被描述为守护友谊与诺言的神。"},{"en":"In some hymns, Mitra and Varuna appear as a pair.","zh":"在一些赞歌中，Mitra与Varuna常成对出现。"}]},{"partOfSpeech":"n.","definition":{"en":"a variant spelling related to Mithra/Mithras, an ancient Indo-Iranian deity later associated with Roman mystery religion","zh":"与Mithra/Mithras相关的拼写变体：古代印伊神祇，后来与罗马密仪宗教有关联"},"examples":[{"en":"Some sources use “Mitra” when discussing Indo-Iranian mythology.","zh":"有些资料在讨论印伊神话时会使用“Mitra”这个写法。"}]}],"synonyms":["friend","ally","companion","pal"],"phonetic":"/ˈmiːtrə/","extraExplanation":["“mitra”在英语语境里常见两种用法：①作为外来词表示“朋友/盟友”（多见于南亚语言背景）；②作为专有名词（神名或人名/姓氏）。如果写作人名或神名，通常首字母大写：Mitra。","发音上，英语里常读作“MEET-ruh”（/ˈmiːtrə/）。不同地区/语言背景可能会有细微差别。","相关词：Mithra / Mithras（更常见于古波斯与罗马密仪宗教的拼写与用法）；也可把它理解为与“friend / ally”语义相近的文化对应词。"]}
{"word":"mitraille","summary":{"en":"mitraille = grapeshot / small cannon projectiles; also (rarely) a smoked pearl.","zh":"mitraille 常指“葡萄弹/炮用散弹”；也可（少见）指“烟色珍珠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Artillery) Small projectiles (e.g., iron balls or metal fragments) packed together and fired from a cannon to spread out and hit people at short range; grapeshot.","zh":"（炮兵）装填在炮内、发射后会散开的许多小弹丸（如铁球或金属碎片），用于近距离杀伤人员；葡萄弹（grapeshot）。"},"examples":[{"en":"The cannon was loaded with mitraille to break up the infantry charge.","zh":"大炮装填了葡萄弹，用来打散步兵冲锋。"},{"en":"In older warfare, mitraille was terrifying at close range.","zh":"在早期战争中，近距离的葡萄弹杀伤力极其可怕。"}]},{"partOfSpeech":"n.","definition":{"en":"A smoked pearl (a pearl intentionally given a grayish, “smoky” color).","zh":"（较少用）烟色珍珠；经过处理呈灰黑“烟熏”色的珍珠。"},"examples":[{"en":"The jeweler described the strand as mitraille rather than bright white pearls.","zh":"珠宝商把这串珍珠描述为烟色珍珠，而不是亮白珍珠。"}]}],"synonyms":["grapeshot","canister shot","shot","small shot"],"phonetic":"/miˈtraɪ/","extraExplanation":["“mitraille”来自法语，本义与“金属碎片、零散小金属”相关，后来在军事语境中常指像霰弹一样散射的炮弹装药（英语里常用grapeshot来解释）。","法语里的mitrailleuse（机枪）与mitraille同源：最初与“散射式弹丸/密集弹雨”的概念相关，所以现代法语中mitrailleuse可以泛指机枪。"]}
{"word":"mitrailleur","summary":{"en":"Mitrailleur means “machine gunner” (and in older texts sometimes “machine gun”), used mainly as a French loanword in war/history writing.","zh":"mitrailleur 常指“机枪手”（旧文本中偶尔也指“机枪”），多作为带法语色彩的外来词用于战争/军史写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine gunner (a soldier who operates a machine gun), especially in French military contexts; sometimes also used to mean the machine gun itself (older usage).","zh":"机枪手（操作机枪的士兵），多见于法语或与法军相关的语境；较旧用法中也可指“机枪”本身。"},"examples":[{"en":"The novel describes a young mitrailleur crouching behind sandbags, waiting for the signal.","zh":"小说描写一名年轻的机枪手蜷缩在沙袋后，等待信号。"},{"en":"In some older war memoirs, “mitrailleur” can refer to the weapon as well as the gunner.","zh":"在一些较早的战争回忆录里，“mitrailleur”既可能指武器本身，也可能指操作武器的人。"}]}],"synonyms":["machine gunner","gunner"],"phonetic":"/ˌmiːtrəˈjɜːr/","extraExplanation":["“mitrailleur”来自法语，与“mitraille”（意为“霰弹、散弹、碎弹”）同源，后来引申到“机枪/机枪火力”的概念。英语里它多作为外来词出现在一战/二战题材的历史、回忆录或文学作品中，带有明显的时代与地域（法语）色彩。","更常见、日常的英语表达是：machine gunner（机枪手）或 gunner（炮手/射手，语境决定）。如果你在英文文本里看到“mitrailleur”，通常是在刻意保留法语氛围或军史语感。"]}
{"word":"mitrailleuse","summary":{"en":"Mitrailleuse means “machine gun,” especially a French (often WWI-era) one; historically it can also refer to an early rapid-fire gun that came before modern machine guns.","zh":"mitrailleuse 指“机关枪”，尤指法式（常见于一战时期）机关枪；历史上也可指现代机关枪出现前的早期速射武器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine gun (especially one of French design, often mentioned in World War I contexts).","zh":"机关枪（尤指法国式设计的机关枪；常见于第一次世界大战相关语境）。"},"examples":[{"en":"The museum displays a World War I mitrailleuse and explains how it changed battlefield tactics.","zh":"博物馆展出了一挺一战时期的 mitrailleuse，并讲解它如何改变战场战术。"},{"en":"In the novel, the soldiers froze when they heard the rattle of a mitrailleuse from the ridge.","zh":"小说里，士兵们听到山脊上传来机关枪的连发声，顿时僵住了。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) an early rapid-fire weapon that fired many bullets in quick succession; a predecessor to modern machine guns.","zh":"（历史）早期的速射武器，可在短时间内连续发射多发子弹；被视为现代机关枪的前身之一。"},"examples":[{"en":"Some 19th-century armies experimented with the mitrailleuse before automatic machine guns became common.","zh":"在自动机关枪普及前，一些 19 世纪的军队曾试用过 mitrailleuse。"}]}],"synonyms":["machine gun","automatic gun","rapid-fire gun"],"phonetic":"ˌmɪtrəˈljuːz","extraExplanation":["这是法语外来词，来自法语 *mitraille*（意为“弹丸/散弹、碎弹”一类的“弹雨”概念），因此带有“密集弹雨”的联想。英语里多见于历史/军事写作，尤其在描述法国武器或一战背景时。","英语文本中它常带一点“年代感”或“异国（法式）军事术语”的色彩：作者用它往往不只是说“machine gun”，也在营造特定历史氛围。读到时可根据上下文理解为“机关枪/早期机关枪”。"]}
{"word":"mitral","summary":{"en":"Mitral means “related to the mitral valve,” the heart valve between the left atrium and left ventricle.","zh":"mitral 意为“与二尖瓣有关的”，二尖瓣是位于左心房与左心室之间的心脏瓣膜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the mitral valve, the heart valve between the left atrium and the left ventricle.","zh":"与二尖瓣有关的；指心脏中位于左心房与左心室之间的瓣膜。"},"examples":[{"en":"The doctor heard a heart murmur and ordered tests to check for mitral valve problems.","zh":"医生听到心脏杂音，于是安排检查以确认是否有二尖瓣问题。"},{"en":"Mitral regurgitation means blood leaks backward through the mitral valve.","zh":"二尖瓣反流指血液经二尖瓣向后倒流。"}]}],"synonyms":["bicuspid (valve) (in anatomy)"],"phonetic":"/ˈmaɪ.trəl/","extraExplanation":["“Mitral”来自拉丁语 mitra（意为“主教冠/头饰”），因为二尖瓣的形状被认为像这种头饰，因此英文里把它称为 mitral valve（也常叫 bicuspid valve，意为“二尖/二叶瓣”）。","常见搭配：mitral valve（二尖瓣）、mitral stenosis（二尖瓣狭窄）、mitral regurgitation / insufficiency（二尖瓣反流/关闭不全）、mitral prolapse（二尖瓣脱垂）。这些多用于医学语境。"]}
{"word":"mitrate","summary":{"en":"Mitrate is a rare adjective meaning “miter-shaped.” It can also be a noun in paleontology for an extinct echinoderm called a mitrate.","zh":"mitrate 作形容词较罕见，意为“主教冠形的”。在古生物学中也可作名词，指一种称为 mitrate 的已灭绝棘皮动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Shaped like, resembling, or having the form of a miter (a tall, pointed ceremonial hat).","zh":"（罕用）呈主教冠（miter/mitre）形的；像主教冠那样的；具有尖顶帽形的。"},"examples":[{"en":"The shell has a mitrate outline, narrowing to a pointed top.","zh":"这个贝壳的轮廓呈主教冠形，上端逐渐收尖。"},{"en":"In the illustration, the mitrate cap helps identify the figure as a bishop.","zh":"在插图里，这顶主教冠形的帽子帮助辨认出人物是主教。"}]},{"partOfSpeech":"n.","definition":{"en":"(Paleontology) An extinct echinoderm (a member of the group commonly called mitrates).","zh":"（古生物）一种已灭绝的棘皮动物（常称为“mitrates”的一类成员）。"},"examples":[{"en":"The fossil was identified as a mitrate based on its plated body and tail-like structure.","zh":"研究人员根据其装甲状骨板的身体和尾状结构，将该化石鉴定为一种 mitrate。"}]}],"synonyms":["miter-shaped","mitre-shaped","pointed","conical"],"phonetic":"/ˈmaɪˌtreɪt/","extraExplanation":["“mitrate”很容易被误看成“nitrate（硝酸盐）”。如果你想表达化学里的“硝酸盐/硝化物”，正确拼写通常是 nitrate，而不是 mitrate。","形容词 mitrate 来自拉丁语词根，含义与“mitra（头巾/冠帽）”有关；在现代英语里非常少见，更常见的是用 miter-shaped / mitre-shaped 来表达“主教冠形的”。"]}
{"word":"mitre","summary":{"en":"Mitre (US: miter) most commonly means a bishop’s ceremonial hat; it can also mean (and as a verb, make) a diagonal corner joint in carpentry/architecture.","zh":"mitre（美式多拼作 miter）最常指“主教冠”；也可指（或作动词）木工/建筑中的“斜接（斜角对接）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ceremonial headdress (tall hat) worn by some Christian bishops and abbots, especially in the Catholic, Orthodox, and some Anglican traditions.","zh":"（宗教）主教冠：一些基督宗教传统中（尤其天主教、东正教及部分圣公会）主教、修院院长在礼仪场合佩戴的高帽。"},"examples":[{"en":"The bishop wore a mitre during the procession.","zh":"主教在游行仪式中戴着主教冠。"},{"en":"In the painting, the saint is shown with a mitre and a staff.","zh":"在这幅画里，圣人被描绘为戴着主教冠、手持牧杖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Architecture) A diagonal joint where two sloping parts meet, especially in an arch or vault; also used in terms like “mitre joint.”","zh":"（建筑）斜接/斜接缝：两段倾斜构件相接形成的对角接合处；也常见于“mitre joint（斜接）”等术语。"},"examples":[{"en":"The stonework shows a neat mitre at the corner of the arch.","zh":"拱角的石工斜接处理很整齐。"},{"en":"They cut the molding at 45 degrees to make a clean mitre joint.","zh":"他们把线条以45度切割，做出干净的斜接。"}]},{"partOfSpeech":"v.","definition":{"en":"To join two pieces by cutting matching diagonal edges (to make a mitre joint).","zh":"把……做斜接；用斜切边把两段材料对接起来（做成斜接接头）。"},"examples":[{"en":"You need to mitre the corners so the frame fits tightly.","zh":"你需要把四角做斜接，这样框架才能严丝合缝。"},{"en":"He mitred the trim before nailing it in place.","zh":"他先把装饰条斜接切好，再钉上去固定。"}]}],"synonyms":["bishop’s hat","miter/mitre joint","diagonal joint"],"phonetic":"ˈmaɪtɚ","extraExplanation":["拼写提示：英式拼法常写作 **mitre**，美式更常见 **miter**（意思相同）。如果你在木工/装修语境里看到，多半是“斜接（miter/mitre joint）”；在宗教艺术或新闻里看到，多半指“主教冠”。","词源小知识：这个词来自希腊语 *mitra*，原意与“头带/头巾”相关，后来在基督教礼仪中专指主教的礼帽；在工艺与建筑中则引申为“斜接”的概念。","文化语境：在西方绘画与雕塑中，戴着主教冠（mitre）常用来辨认某位圣人或主教身份，比如与“牧杖（crosier）”一起出现。"]}
{"word":"mitred","summary":{"en":"Mitred means either (1) wearing or shaped like a bishop’s ceremonial hat (a mitre), or (2) made with a mitre joint—two pieces cut at an angle to fit neatly at a corner.","zh":"Mitred可指（1）戴着/呈主教冠形状的；也可指（2）做成斜接角拼接的（木工、装修常用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a mitre (a tall ceremonial hat), or shaped like a mitre; often used about bishops or church decoration in some Christian traditions.","zh":"戴着主教冠（高而尖的礼仪帽）的；或形状像主教冠的；常用于描述某些基督教传统中的主教或教堂装饰。"},"examples":[{"en":"The mitred bishop led the procession into the cathedral.","zh":"戴着主教冠的主教带领队伍走进大教堂。"},{"en":"The shield in the painting is topped with a mitred figure.","zh":"画中的盾徽上方有一个戴主教冠的人物图案。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having been fitted with a mitre joint (a corner cut at an angle, often 45°, so two pieces meet neatly).","zh":"（木工等）做成斜接的；已做斜角拼接的（通常切成约45°，使两块材料在角上严丝合缝）。"},"examples":[{"en":"They used mitred corners for the picture frame.","zh":"他们用斜接角来做相框的四个角。"},{"en":"The trim was neatly mitred at the doorway.","zh":"门口的线条装饰在拐角处斜接得很整齐。"}]}],"synonyms":["bishop-hatted","mitered","mitre-jointed","bevelled (in some contexts)"],"phonetic":"ˈmaɪtərd","extraExplanation":["“mitred”常见于两类语境：①宗教（主教戴的礼仪帽mitre/mitra），因此在新闻、历史、文学里会写“mitred bishop（戴主教冠的主教）”；②木工/装修（mitre joint 斜接/斜角拼接），比如相框、踢脚线、门框线条的转角。两种用法拼写相同，但领域完全不同。","拼写提示：英式也常写作“mitred”，美式有时写作“mitered”（对应名词/动词mitre vs. miter）。你看到“mitred”多半是偏英式拼写或宗教语境。"]}
{"word":"mitreflower","summary":{"en":"Mitreflower is a small woodland wildflower (often *Mitella*) known for its tiny, delicate, fringe-like flowers.","zh":"Mitreflower 指一种小型林地野花（常为帽花属 *Mitella*），以细小、流苏状的花为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small woodland wildflower (often in the genus *Mitella*) with delicate, fringe-like petals; also used for similar plants in the saxifrage family.","zh":"一种小型林地野花（常指*Mitella*属，即“帽花属”），花瓣细碎像流苏；也可泛指虎耳草科中外形相近的植物。"},"examples":[{"en":"We spotted mitreflower along the shaded creek trail in early spring.","zh":"我们在早春沿着阴凉的溪边小径看到了帽花。"},{"en":"Mitreflower thrives in moist, shady woods and blooms with tiny, starry flowers.","zh":"帽花喜欢潮湿、阴凉的林地，会开出细小的星状花。"}]}],"synonyms":["Mitella (as a plant name)","bishop’s cap (regional/common name)"],"phonetic":"/ˈmaɪtɚˌflaʊɚ/","extraExplanation":["“mitreflower”这个名字来自“mitre（主教法帽）”，因为它的种子蒴果或花的形状在某些角度看起来像帽子；在北美语境里，常见是指林地里很小、颜色偏白或淡粉、花瓣像细流苏的野花。","日常写作里更常见的拼写是分开的“mitre flower / mitre-flower”；美式英语也常用“miter”作另一种拼写（miter flower）。"]}
{"word":"mitrer","summary":{"en":"“Mitrer” is likely a misspelling. In English, the common word is **miter/mitre** (a bishop’s ceremonial hat; or an angled corner joint in woodworking). **Miterer** is a tool/machine that makes miter cuts.","zh":"“mitrer” 很可能是拼写错误。英语里常用的是 **miter/mitre**（主教礼帽；或木工里的“斜接/斜接缝”）。**miterer** 指用于斜切、做斜接的工具或机器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) **miter / mitre**: a tall, pointed ceremonial hat worn by some Christian bishops and abbots.","zh":"（较可能是你想写的词）**miter / mitre**：一些基督教主教、修道院院长在礼仪中戴的高而尖的礼帽（主教冠）。"},"examples":[{"en":"The bishop wore a gold miter during the ceremony.","zh":"主教在仪式上戴着金色的主教冠。"},{"en":"In many churches, the miter is a symbol of a bishop’s authority.","zh":"在许多教会里，主教冠象征主教的权威。"}]},{"partOfSpeech":"n.","definition":{"en":"**miter / mitre**: an angled joint (often 45°) where two pieces meet neatly, common in frames and trim; also called a *miter joint*.","zh":"**miter / mitre**：（常为45°的）斜接接缝；两块材料以斜角拼接，常用于相框、门窗线条等；也叫 *miter joint*（斜接）。"},"examples":[{"en":"They cut the wood at 45 degrees to make a clean miter.","zh":"他们把木头切成45度来做出整齐的斜接。"},{"en":"The picture frame has tight miters at each corner.","zh":"这个相框四个角的斜接非常紧密。"}]},{"partOfSpeech":"v.","definition":{"en":"To cut or fit pieces together at an angle to form a miter joint.","zh":"把材料切成斜角并拼接成斜接缝。"},"examples":[{"en":"Miter the corners before you glue the frame.","zh":"上胶之前先把四个角斜接好。"},{"en":"He mitered the trim so the corners would meet perfectly.","zh":"他把装饰条做了斜接，让拐角能完美贴合。"}]},{"partOfSpeech":"n.","definition":{"en":"**miterer**: a tool or machine used for making miter (angled) cuts.","zh":"**miterer**：用于切割斜角（做斜接）的工具或机器。"},"examples":[{"en":"A power miterer can speed up framing work.","zh":"电动斜切设备能加快做框架的工作。"},{"en":"He used a miterer to form accurate corner angles.","zh":"他用斜切工具做出精确的拐角角度。"}]}],"synonyms":["mitre","miter joint","bevel (related)","angled joint"],"phonetic":"/ˈmaɪtər/","extraExplanation":["你输入的 **“mitrer”** 不是常见英语拼写。英语里最接近、最常用的是 **miter/mitre**（主教礼帽；或木工“斜接”），以及名词 **miterer**（做斜接的工具/机器）。([britannica.com](https://www.britannica.com/topic/miter?utm_source=openai))","另外，**mitrer** 在法语里确实是一个动词，常见释义包括“给主教戴上主教冠/授予主教职位”（以及某些引申用法）。如果你是在学法语或在法语语境里见到它，可以告诉我句子，我再按法语来解释更准确。([linternaute.fr](https://www.linternaute.fr/dictionnaire/fr/definition/mitrer/?utm_source=openai))"]}
{"word":"mitres","summary":{"en":"“Mitres” is the plural of “mitre/miter.” It most commonly means bishops’ ceremonial hats, and it can also mean angled corner joints in woodworking; as a verb it means to cut/join at an angle (or to place a mitre on someone).","zh":"“Mitres” 是 “mitre/miter” 的复数。最常见指主教等在仪式中戴的高帽；也可指木工中的斜接角；作动词可表示斜切/斜接（或为某人授予主教冠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of **mitre/miter**: a tall ceremonial hat worn by some Christian bishops and other church leaders","zh":"**mitre/miter** 的复数：一些基督教主教等教会领袖在仪式中佩戴的高帽（主教冠）"},"examples":[{"en":"In the painting, the bishops wear gold mitres during the ceremony.","zh":"在这幅画里，主教们在仪式上戴着金色的主教冠。"},{"en":"The museum displayed several old mitres from different centuries.","zh":"博物馆展出了几个不同时代的古老主教冠。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of **mitre/miter**: a corner joint made by cutting two pieces at an angle (often 45°) so they fit together neatly","zh":"**mitre/miter** 的复数：斜接角接合（常把两块材料各切成 45° 以在拐角处拼接整齐）"},"examples":[{"en":"The picture frames have clean mitres at each corner.","zh":"这些画框的每个角都有很整齐的斜接角。"},{"en":"If the mitres don’t line up, the corner will show a gap.","zh":"如果斜接角对不齐，拐角处就会露出缝隙。"}]},{"partOfSpeech":"v.","definition":{"en":"the plural form of the verb **to mitre/miter**: to cut or join at an angle to form a neat corner; (in a church context) to place a ceremonial hat (a mitre) on someone","zh":"**to mitre/miter** 的动词复数形式：把材料斜切或斜接以形成整齐的拐角；（教会语境）为某人加冠/授予主教冠"},"examples":[{"en":"They mitres the trim so the corners meet perfectly.","zh":"他们把饰条斜切，让拐角能完美对接。"},{"en":"In some traditions, new bishops are formally mitred during a ceremony.","zh":"在一些传统中，新主教会在仪式上被正式加冠（授予主教冠）。"}]}],"synonyms":["bishop's hat","miter joint","mitre joint","angled joint","bevel joint"],"phonetic":"/ˈmaɪtər/","extraExplanation":["拼写提示：美式英语更常写 **miter / miters**，英式英语更常写 **mitre / mitres**。意思相同，只是拼写不同。","词源与文化：这个词来自希腊语/拉丁语传统，先常用于宗教服饰（主教冠），后来也被借用到木工/装修领域表示“斜接角”。"]}
{"word":"mitrewort","summary":{"en":"Mitrewort is a small wildflower (Mitella) named for a fruit/seed capsule shaped like a bishop’s mitre.","zh":"Mitrewort 指一种小型野花（Mitella 属），因其果荚形状像主教的法冠而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small wild plant (genus *Mitella*, saxifrage family) with flowers and a seed capsule that looks like a bishop’s mitre (a pointed ceremonial hat)","zh":"一种小型野生草本植物（*Mitella* 属，虎耳草科），其花或果荚形状像主教的法冠（尖顶礼帽）"},"examples":[{"en":"We saw mitrewort growing in the damp, shady woods near the stream.","zh":"我们在溪流附近阴湿的林地里看到了帽草（mitrewort）。"},{"en":"Mitrewort is sometimes called bishop’s-cap because of the shape of its seed capsule.","zh":"帽草有时也叫“bishop’s-cap（主教帽）”，因为它的果荚形状像主教的帽子。"}]}],"synonyms":["miterwort","bishop’s-cap"],"phonetic":"/ˈmaɪtərˌwɝt/","extraExplanation":["你输入的 **mitrewort** 很可能是正确拼写；它也常见作 **miterwort**（美式拼写里 *mitre/miter* 这类词常有两种拼法）。","这个词比较少见，主要出现在植物学、野花图鉴或自然观察文章里。词尾 **-wort** 是古英语里“植物/草药”的常见构词成分（如 *St. John’s wort*）。","在北美常见相关属名是 **Mitella**；有些地区也会把近缘植物用相似俗名来称呼，所以在不同图鉴里可能略有差异。"]}
{"word":"mitridae","summary":{"en":"Mitridae is a taxonomic family of sea snails, often called mitre shells.","zh":"Mitridae 指一种海洋海螺的分类“科”，常叫“主教冠螺/冠螺（mitre shells）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine gastropod mollusks (sea snails), commonly called mitre shells, known for their smooth, often brightly patterned, spindle-shaped shells.","zh":"一种海洋腹足类软体动物（海螺/海蜗牛）的“科”（分类单位），常称为“主教冠螺/冠螺（mitre shells）”，以外壳多呈纺锤形、表面较光滑、花纹常较鲜艳而闻名。"},"examples":[{"en":"Mitridae are often collected for their beautifully patterned shells.","zh":"冠螺科（Mitridae）的贝壳常因花纹漂亮而被收藏。"},{"en":"The museum’s display includes several Mitridae from tropical reefs.","zh":"博物馆展柜里有几种来自热带珊瑚礁的冠螺科（Mitridae）标本。"}]}],"synonyms":["mitre shells","mitrids"],"phonetic":"/ˈmɪtrɪdiː/","extraExplanation":["这是一个生物分类学名称：结尾 -idae 通常表示“某某科”（family）。","Mitridae 的英文俗名 mitre shells 来自 mitre（主教冠/礼冠）：这些海螺的壳形在外观上像尖顶的礼冠，因此得名。","作为学名时常大写（Mitridae）；在科普或一般写作中也会用小写（mitrids / mitre shells）来指这一类动物。"]}
{"word":"mitriform","summary":{"en":"Mitriform means “shaped like a miter (bishop’s hat),” often used in scientific descriptions.","zh":"mitriform 指“主教冠形的”，常用于科学语境中的形态描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a miter (mitre)—a tall, pointed ceremonial hat traditionally worn by bishops; used especially in scientific descriptions (e.g., shells, flowers, or anatomical parts).","zh":"呈主教冠（mitre）形的；（尤用于科学描写）形状像主教冠的（如贝壳、花或某些解剖结构）。"},"examples":[{"en":"The malacologist described the shell as mitriform, tapering to a sharp point at the top.","zh":"软体动物学家把这种贝壳描述为“mitriform”，顶部逐渐收尖。"},{"en":"In the field guide, several orchids are noted for their mitriform buds.","zh":"在野外图鉴中，有几种兰花以其“主教冠形”的花蕾而著称。"},{"en":"Under the microscope, the structure looks mitriform rather than rounded.","zh":"在显微镜下，这个结构看起来是主教冠形的，而不是圆形的。"}]}],"synonyms":["miter-shaped","mitre-shaped","conical (often)","tapering (often)"],"phonetic":"/ˈmaɪtrəˌfɔrm/","extraExplanation":["“mitriform”来自“mitre/mitra（主教冠）+ -form（形状）”。它常见于生物学、植物学、动物学和解剖学的形态描述中，用来强调“上部尖、整体像主教帽”的外形。","英式拼写常见“mitre”，美式更常见“miter”；但“mitriform”这个形容词在学术语境里两种拼写体系的人都能理解。"]}
{"word":"mitring","summary":{"en":"Mitring means making angled cuts so two pieces join neatly at a corner (a miter joint).","zh":"Mitring 指把材料切成斜角以便在拐角处拼接成斜接（miter joint）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of **miter/mitre**) cutting or shaping the ends/edges of material at an angle (often 45°) so two pieces fit together neatly at a corner.","zh":"（**miter/mitre** 的现在分词）把材料的端部/边缘切成斜角（常见为 45°），让两块材料在拐角处严丝合缝地拼接。"},"examples":[{"en":"He’s **mitring** the picture-frame corners to make the joints look seamless.","zh":"他在给相框的角做**斜接切割**，让接缝看起来更无缝。"},{"en":"Take your time when **mitring** trim—small angle mistakes show up quickly.","zh":"做线条/踢脚线的**斜切拼角**要慢一点，小小的角度误差很快就会被看出来。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of making a miter (mitre) joint; mitering.","zh":"制作斜接（mitre）拼角的动作/过程；斜接加工。"},"examples":[{"en":"Good **mitring** is the key to a clean-looking frame.","zh":"好的**斜接加工**是让画框看起来干净利落的关键。"}]}],"synonyms":["mitering","beveling","making a miter joint"],"phonetic":"/ˈmaɪtərɪŋ/","extraExplanation":["“mitring”常见于木工/装修语境；美式拼法多写 **mitering**，英式常写 **mitring/mitre**。","这个词来自 **miter/mitre**：原义之一是主教戴的高尖帽（mitre），后来也用来指类似形状的斜角拼接（miter joint）。"]}
{"word":"mitsukurina","summary":{"en":"Mitsukurina is the scientific genus name for the goblin shark lineage, including the living species Mitsukurina owstoni.","zh":"Mitsukurina 是“哥布林鲨”这一谱系的科学属名，现生代表为 Mitsukurina owstoni。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of deep-sea mackerel sharks (family Mitsukurinidae), best known for containing the living species the goblin shark (Mitsukurina owstoni).","zh":"一种深海鲭鲨类（鼬鲨目）鲨鱼的属名（鼬鲨科 Mitsukurinidae），最著名的是其现生物种“哥布林鲨/妖精鲨”（Mitsukurina owstoni）。"},"examples":[{"en":"The goblin shark’s scientific genus is Mitsukurina.","zh":"哥布林鲨的学名属是 Mitsukurina。"},{"en":"Researchers compared fossil teeth to modern Mitsukurina specimens.","zh":"研究人员将化石牙齿与现代 Mitsukurina 标本进行比较。"},{"en":"Mitsukurina owstoni is currently the only living species in the genus Mitsukurina.","zh":"Mitsukurina 属目前仅有一种现生物种：Mitsukurina owstoni。"}]}],"synonyms":["goblin shark (common name; for Mitsukurina owstoni)","Mitsukurina owstoni","Mitsukurinidae (related family name)"],"phonetic":"ˌmɪt.suː.kʊˈriː.nə","extraExplanation":["“Mitsukurina”是拉丁化的学名（属名），通常用于生物分类语境；日常英语里更常说 goblin shark（哥布林鲨）。","词源背景：该属名是为纪念日本动物学家（或相关学术人物）Kakichi Mitsukuri；属由美国鱼类学家 David Starr Jordan 于 1898 年建立并命名。","发音提示：重音常落在靠后的音节（-REE-），可近似读作 “MIT-soo-koo-REE-nuh”。"]}
{"word":"mitsukurinidae","summary":{"en":"Mitsukurinidae is the scientific family name for sharks such as the goblin shark.","zh":"Mitsukurinidae 是包含哥布林鲨（妖精鲨）等在内的鲨鱼“科名”（生物分类单位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family of deep-sea sharks that includes the goblin shark (Mitsukurina owstoni).","zh":"（生物分类）鼠鲨科/米津鲨科（Mitsukurinidae）：一种深海鲨鱼的科级分类单位，包含“哥布林鲨/妖精鲨”（Mitsukurina owstoni）等。"},"examples":[{"en":"The goblin shark belongs to the family Mitsukurinidae.","zh":"哥布林鲨（妖精鲨）属于鼠鲨科（Mitsukurinidae）。"},{"en":"Scientists rarely observe Mitsukurinidae in the wild because they live in deep water.","zh":"由于生活在深海，科学家很少在野外直接观察到鼠鲨科（Mitsukurinidae）的成员。"}]}],"synonyms":["goblin shark family"],"phonetic":"ˌmɪt.suːˈkʊr.ɪ.nɪ.diː","extraExplanation":["这是一个拉丁化的学名（科名），常用于学术写作与科普文章中，日常英语对话里很少直接使用。","词尾 -idae 表示“科”（family）的分类等级；看到类似形式（如 Felidae 猫科）通常都是动物分类学的“科名”。","名称 Mitsukurinidae 来自属名 Mitsukurina（哥布林鲨所属的属），而属名又与日本学者三宅/箕作（Mitsukuri）相关的命名传统有关。"]}
{"word":"mitsumata","summary":{"en":"Mitsumata is a Japanese shrub whose bark fibers are used to make traditional high-quality paper.","zh":"Mitsumata 指一种日本灌木，其树皮纤维用于制作传统的高品质纸张（如和纸）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese shrub (Edgeworthia chrysantha) whose bark fibers are traditionally used to make high-quality paper, especially washi and some Japanese banknote paper.","zh":"一种日本灌木（三椏／三叉树皮，学名 Edgeworthia chrysantha），其树皮纤维传统上用来制作高品质纸张，尤其是和纸，以及部分日本纸币用纸。"},"examples":[{"en":"Mitsumata fibers are valued for making strong, smooth paper.","zh":"三椏（mitsumata）的纤维因能造出结实、细滑的纸而受到重视。"},{"en":"The artisan demonstrated how mitsumata bark is processed for washi.","zh":"匠人示范了如何处理三椏树皮来制作和纸。"}]}],"synonyms":["Edgeworthia","Edgeworthia chrysantha","paperbush"],"phonetic":"/ˌmɪt.suːˈmɑː.tə/","extraExplanation":["「mitsumata（みつまた）」在日语里常被写作「三椏／三叉」，字面意思与枝条常呈“三分叉”有关，因此得名。","它常与「楮（こうぞ，kozo）」和「雁皮（がんぴ，gampi）」并列，被视为传统和纸的重要原料之一；学习日本手工纸文化时经常会遇到这个词。","英语里也有人称它为 paperbush（纸灌木）或直接用学名 Edgeworthia。"]}
{"word":"mitsvah","summary":{"en":"Mitzvah (also spelled mitsvah) means a Jewish commandment, and in everyday English it can also mean a good deed or charitable act.","zh":"Mitzvah（也可拼作 mitsvah）既指犹太教的“诫命/戒律”，在日常英语中也常引申为“善行/好事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) a commandment or religious obligation in Jewish law (traditionally counted as 613 in the Torah).","zh":"（犹太教）“诫命/戒律”；犹太律法中的宗教义务（传统上认为《托拉》中共有613条）。"},"examples":[{"en":"Keeping Shabbat is an important mitzvah in Judaism.","zh":"守安息日（Shabbat）是犹太教中一条重要的诫命（mitzvah）。"},{"en":"Some mitzvot are about rituals, while others focus on ethical behavior.","zh":"有些诫命与宗教仪式有关，另一些则强调道德行为。"}]},{"partOfSpeech":"n.","definition":{"en":"a good deed; a kind, charitable act (common in everyday English usage).","zh":"善行；好事（当代英语里常用来指“做了件好事/行善”）。"},"examples":[{"en":"It was a mitzvah to help her carry the groceries.","zh":"帮她提购物袋是一件善行（mitzvah）。"},{"en":"Donating warm clothes in winter is a simple mitzvah.","zh":"冬天捐赠保暖衣物是一种简单的善行（mitzvah）。"}]}],"synonyms":["commandment","good deed","charitable act","act of kindness"],"phonetic":"/ˈmɪts.və/","extraExplanation":["“mitsvah”通常是“mitzvah”的另一种拼写；更常见、也更标准的英语拼法是 **mitzvah**。","来自希伯来语 **מצוה**（mitzvah），字面意思是“命令/诫命”。在口语里，很多英语使用者把它引申为“善行、好事”。","复数常见写法是 **mitzvot**（也会见到 mitzvahs / mitzvoth）。另外 **bar mitzvah / bat mitzvah** 指男孩/女孩达到宗教成年礼（也可指庆祝仪式）。"]}
{"word":"mitsvahs","summary":{"en":"“Mitzvahs” means Jewish commandments or, more broadly, good deeds/kind acts.","zh":"“Mitzvahs” 指犹太教的诫命，也可泛指善行、好事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mitzvah**: (in Judaism) a commandment or religious duty; more generally, a morally good deed or act of kindness.","zh":"**mitzvah** 的复数：在犹太教中指“诫命/宗教义务”；也常泛指“善行、好事（帮助他人的行为）”。"},"examples":[{"en":"In Jewish tradition, there are many mitzvahs that guide daily life.","zh":"在犹太传统中，有许多诫命（mitzvahs）指导日常生活。"},{"en":"Donating food to the shelter is one of the mitzvahs she tries to do each week.","zh":"向收容所捐赠食物是她每周都努力做的一件善行（mitzvahs）之一。"},{"en":"He said helping a neighbor is a mitzvah, not just a favor.","zh":"他说帮助邻居是一种善行（mitzvah），不只是帮个忙。"}]}],"synonyms":["commandments","good deeds","acts of kindness"],"phonetic":"/ˈmɪtsvəz/","extraExplanation":["“mitzvah”（源自希伯来语 מצווה）本意是“诫命”。英语里既可以指具体的宗教戒律，也常被用作日常语境里的“做件好事”。","复数在英语里常写 **mitzvahs**；在更贴近希伯来语/宗教场合的写法中，也会见到 **mitzvot**（同义复数形式）。","注意不要和 **bar mitzvah / bat mitzvah**（成年礼）混淆：那里的 mitzvah 指“诫命”，但整句话指的是一种宗教仪式与人生阶段。"]}
{"word":"mitsvoth","summary":{"en":"Mitsvoth means “mitzvot,” the plural of *mitzvah*: Jewish commandments; informally it can also refer to good deeds.","zh":"Mitsvoth 相当于 “mitzvot”，是 *mitzvah* 的复数：指犹太教的诫命；口语里也可泛指善行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of *mitzvah*: the Jewish religious commandments (especially those found in the Torah), traditionally counted as 613.","zh":" *mitzvah*（诫命）的复数：指犹太教的诫命/戒律（尤其指《妥拉》中的诫命），传统上共计613条。"},"examples":[{"en":"Some mitzvoth are about ethics (like honesty), while others are about rituals (like holiday practices).","zh":"有些 mitsvoth 与伦理有关（比如诚实），也有一些与宗教仪式有关（比如节日做法）。"},{"en":"She studied the mitzvoth to better understand Jewish life and tradition.","zh":"她学习 mitsvoth，以更好地理解犹太人的生活与传统。"}]},{"partOfSpeech":"n.","definition":{"en":"in everyday English, charitable or morally good acts (using *mitzvah/mitzvoth* in a broader, informal sense).","zh":"在日常英语中，也可泛指慈善或道德上值得称赞的善行（把 *mitzvah/mitzvoth* 作更宽泛、口语化理解）。"},"examples":[{"en":"Volunteering at the shelter felt like doing mitzvoth for the community.","zh":"在收容所做志愿者让我感觉是在为社区行善（做 mitsvoth）。"}]}],"synonyms":["mitzvot","mitzvahs","commandments","good deeds"],"phonetic":"/ˈmɪts.vɑθ/","extraExplanation":["“mitsvoth”是“mitzvot”的另一种拼写（也常见作 mitzvahs）。在现代英语里，拼写“mitzvot”更常用；“-oth”这种写法有时更偏传统/旧式的转写风格。","词源来自希伯来语，核心意思是“命令/诫命”。在犹太传统中常说有613条 mitzvot（复数），涵盖道德规范与宗教礼仪等不同类型。","口语里人们常把 mitzvah 用来指“做了一件好事”。但在较严格的宗教语境中，它首先指“诫命/应遵行的命令”，不一定等同于一般意义上的“善举”。"]}
{"word":"mitt","summary":{"en":"A mitt is a thick glove, especially a baseball glove or an oven glove; informally, it can mean a hand.","zh":"mitt 指厚手套，常见于棒球手套或隔热手套；口语中也可指“手”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, thick glove, especially one used in baseball (a fielder’s glove or catcher’s glove)","zh":"（尤指棒球用的）手套；（接球手/外野手用的）棒球手套"},"examples":[{"en":"He forgot his baseball mitt at home.","zh":"他把棒球手套忘在家里了。"},{"en":"The catcher’s mitt is wider to help catch fast pitches.","zh":"捕手手套更宽，便于接住快速投球。"}]},{"partOfSpeech":"n.","definition":{"en":"an oven mitt; a thick glove used to protect your hand from heat when handling hot dishes","zh":"隔热手套（烤箱手套）；用于拿热盘、热锅的厚手套"},"examples":[{"en":"Use an oven mitt to take the tray out of the oven.","zh":"用隔热手套把烤盘从烤箱里拿出来。"},{"en":"She grabbed the pot with a mitt so she wouldn’t burn her hand.","zh":"她戴上隔热手套去拿锅，免得烫到手。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a hand, especially a large hand","zh":"（非正式）手（尤指大手）"},"examples":[{"en":"Get your mitts off my phone!","zh":"把你的手从我手机上拿开！"}]}],"synonyms":["glove","baseball glove","catcher’s mitt","oven mitt","hand (informal)"],"phonetic":"/mɪt/","extraExplanation":["在美式英语里，棒球语境中常说 mitt（如 catcher’s mitt）。日常穿戴的手套更常用 glove。厨房里则常说 oven mitt。","mitts（复数）在口语里可带点调侃或不耐烦的语气，表示“手”，例如 “Keep your mitts to yourself.”（别乱动/别动手动脚）。"]}
{"word":"mittatur","summary":{"en":"*Mittatur* is a Latin term used mainly in legal writing meaning “let it be sent/issued.”","zh":"*mittatur* 是主要见于法律语境的拉丁语用语，意思是“令其送出／令其发出”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, used in English mainly in legal writing) “let it be sent / let it be issued.” Often appears in old court records or orders to mean that a writ, document, or message should be sent out officially.","zh":"（拉丁语，英语中主要见于法律文书）“令其送出／令其发出”。常见于旧式法院记录或命令中，表示应正式发出某份令状、文件或通知。"},"examples":[{"en":"The judge wrote “mittatur” to indicate that the writ should be sent to the lower court.","zh":"法官写下“mittatur”，表示该令状应送交下级法院。"},{"en":"In older legal documents, “mittatur” can function like an instruction: “send it out.”","zh":"在较旧的法律文件中，“mittatur”常像一道指示：‘把它发出去。’"}]},{"partOfSpeech":"other","definition":{"en":"(Latin grammar) third-person singular present subjunctive passive of *mittere* (“to send”), literally “may it be sent.”","zh":"（拉丁语语法）动词 *mittere*（“发送”）的“第三人称单数 现在时 虚拟式 被动语态”，字面义为“愿它被送出／令其被送出”。"},"examples":[{"en":"As a Latin form, “mittatur” literally means “may it be sent.”","zh":"作为拉丁语形式，“mittatur”字面意思是“愿它被送出”。"}]}],"synonyms":["let it be sent","let it be issued","send it out"],"phonetic":"/mɪˈtætər/","extraExplanation":["“mittatur”不是现代英语常用词，而是拉丁语形式在英语法律传统中的“指令用语”。英语法律文书长期沿用拉丁语（类似的还有 *habeas corpus*、*subpoena* 等），所以你可能在旧判例、法庭命令或档案里看到它。","发音方面，英语环境里多用“英语化读法”；在学术拉丁语课堂里可能会按拉丁语规则读得略有不同。"]}
{"word":"mittelhand","summary":{"en":"Mittelhand is a rare German loanword meaning either the metacarpus (middle of the hand) or, in some card games, the middle player/hand between forehand and rearhand.","zh":"Mittelhand 是罕见的德语借词：可指解剖学上的“掌部/掌骨区”，也可指某些纸牌游戏中介于先手与末手之间的“中手/中位玩家”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The middle part of the hand between the wrist and the fingers; the metacarpus.","zh":"（解剖）手的中间部分，位于手腕与手指之间；即掌部/掌骨区（metacarpus）。"},"examples":[{"en":"The fracture was located in the mittelhand, not the fingers.","zh":"骨折位置在掌部（mittelhand），而不是手指。"},{"en":"Pain in the mittelhand can make gripping difficult.","zh":"掌部疼痛会让握东西变得困难。"}]},{"partOfSpeech":"n.","definition":{"en":"(Card games, from German) The player/hand that plays after the first player (forehand) and before the last player (rearhand).","zh":"（纸牌游戏，源自德语）在先手（forehand）之后、末手（rearhand）之前出牌的“中手/中位”玩家（或其手牌位置）。"},"examples":[{"en":"As mittelhand, you have to react to forehand’s lead.","zh":"作为中手（mittelhand），你必须应对先手的出牌。"},{"en":"In some German card games, mittelhand often has less control of the first trick.","zh":"在一些德式纸牌游戏中，中手（mittelhand）往往对第一墩的掌控更少。"}]}],"synonyms":["metacarpus","metacarpal region","middle hand","middle player"],"phonetic":"/ˈmɪtəlˌhɑnt/","extraExplanation":["“mittelhand”是一个非常少见的英语借词，来自德语“mittel + Hand”（字面义：middle hand）。在英语里多见于引用德式纸牌游戏术语时；而在德语语境中，“Mittelhand”也常用作解剖学名词，指手腕与手指之间的掌部（相当于英语 metacarpus）。","如果你是在解剖课/医学语境里看到它，通常更标准的英语说法是“metacarpus / metacarpal (bones)”。如果是在纸牌游戏（如德语区常见的玩法）里看到它，它指的是出牌顺序中的“中位”。"]}
{"word":"mittelmeer","summary":{"en":"“Mittelmeer” is German for the Mediterranean Sea.","zh":"“Mittelmeer”是德语，意思是“地中海”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Mediterranean Sea (the sea between southern Europe, North Africa, and the Middle East)","zh":"地中海（位于南欧、北非与中东之间的海域）"},"examples":[{"en":"Germany calls the Mediterranean Sea the “Mittelmeer.”","zh":"在德语里，“地中海”叫作“Mittelmeer”。"},{"en":"Many countries along the Mittelmeer have warm, dry summers.","zh":"地中海沿岸许多国家夏季温暖干燥。"}]}],"synonyms":["Mediterranean Sea","the Mediterranean"],"phonetic":"ˌmɛdɪtəˈreɪniən siː","extraExplanation":["“Mittelmeer”是德语词：Mittel- 表示“中间的”，Meer 表示“海”，字面意思就是“中间的海”。英语对应说法是 Mediterranean Sea（地中海）。","英语里 “Mediterranean” 常用来组成词组：Mediterranean climate（地中海气候）、Mediterranean diet（地中海饮食）。"]}
{"word":"mitten","summary":{"en":"A mitten is a warm hand covering with one space for the four fingers and a separate thumb; it can also mean a padded sports glove (e.g., in boxing).","zh":"mitten 指“连指手套”（四指同套、拇指分开）；也可指某些运动用的厚垫手套（如拳击手套）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warm covering for your hand with one section for all four fingers and a separate section for the thumb (often made of wool or similar fabric).","zh":"连指手套；一种保暖手套，四个手指在同一个套里，拇指单独分开（常见于羊毛等材质）。"},"examples":[{"en":"It’s freezing—don’t forget your mittens.","zh":"外面冷得要命——别忘了戴上连指手套。"},{"en":"She lost one mitten on the bus.","zh":"她在公交车上丢了一只连指手套。"}]},{"partOfSpeech":"n.","definition":{"en":"a thick padded glove used in sports (especially boxing) to protect the hand and reduce injury.","zh":"（体育用）拳击手套等厚垫手套；用于保护手部、降低受伤风险。"},"examples":[{"en":"The boxer tightened his mittens before the match.","zh":"拳击手在比赛前把拳击手套系紧。"}]}],"synonyms":["handwear","glove (related)","boxing glove (sports meaning)"],"phonetic":"/ˈmɪtən/","extraExplanation":["日常生活中，mitten 通常指“连指手套”，与 glove（分指手套）相对：glove 的每个手指都有独立的指套，而 mitten 的四指共用一个空间，因此更保暖但灵活度略低。","在美式英语里，表示“拳击手套”更常用 boxing glove；mitten 也能这么用，但语境通常会说明是体育用途。"]}
{"word":"mittened","summary":{"en":"Mittened means wearing mittens or having hands covered by mittens.","zh":"Mittened 指“戴着连指手套的；手被连指手套包着的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing mittens; covered with mittens.","zh":"戴着连指手套的；被连指手套覆盖的。"},"examples":[{"en":"The mittened children built a snowman in the yard.","zh":"戴着连指手套的孩子们在院子里堆雪人。"},{"en":"She held the hot mug with her mittened hands.","zh":"她用戴着连指手套的手捧着热杯子。"}]}],"synonyms":["gloved","muffled"],"phonetic":"/ˈmɪtənd/","extraExplanation":["“mittened”是由名词“mitten（连指手套）”加上形容词后缀“-ed”构成，表示“穿戴着……的/被……包裹的”。它常见于描写冬季场景的叙述性文字中，比直接说“wearing mittens”更简洁、更有画面感。","相关的类似构词还有：gloved（戴着手套的）、booted（穿着靴子的）、hooded（戴着兜帽的）。写作中这类词常用来快速营造人物外观与季节氛围。"]}
{"word":"mittenlike","summary":{"en":"Mittenlike means “shaped like a mitten,” usually rounded and without clearly separated fingers.","zh":"Mittenlike 指“像连指手套一样的”，通常圆钝、包裹、手指分隔不明显。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a mitten in shape or appearance (often rounded, enclosed, and without clearly separated fingers).","zh":"像连指手套的；形状或外观类似连指手套的（通常圆钝、包裹性强、没有明显分开的手指）。"},"examples":[{"en":"The toddler wore mittenlike gloves that kept his fingers together and warm.","zh":"小孩戴着像连指手套一样的手套，把手指裹在一起更保暖。"},{"en":"The cat’s paws looked mittenlike in the snow, leaving soft, rounded prints.","zh":"猫爪在雪里看起来像小连指手套，留下柔软圆圆的脚印。"}]}],"synonyms":["mitten-shaped","rounded","glove-like"],"phonetic":"/ˈmɪtənˌlaɪk/","extraExplanation":["“mittenlike”是由“mitten（连指手套）+ -like（像……一样）”组成的形容词，常用于描写外形（如手套、爪子、叶片、岩石突起等）呈现“圆、厚、包裹、分叉不明显”的感觉。","这个词多见于描述性写作（自然描写、服饰/设计、儿童用品等）。如果你要更正式一点，也可以用“mitten-shaped（连指手套形状的）”。"]}
{"word":"mittens","summary":{"en":"Mittens are warm hand coverings with the fingers together (except the thumb), and the word can also be a cute way to refer to an animal’s paws.","zh":"mittens 指连指手套（除拇指外四指合在一起），也可作爱称指动物的前爪（小爪子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of glove with one section for the thumb and one larger section for the other four fingers together.","zh":"连指手套（拇指单独一格，其余四指合在一起的一种手套）。"},"examples":[{"en":"It’s freezing—don’t forget your mittens.","zh":"天很冷——别忘了带上你的连指手套。"},{"en":"These mittens are warmer than my gloves because my fingers stay together.","zh":"这些连指手套比我的分指手套更暖和，因为手指可以聚在一起保暖。"},{"en":"The child dropped one mitten in the snow.","zh":"那个孩子把一只连指手套掉在雪里了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Usually in plural) The front paws of some animals, especially cats, spoken of in a cute or affectionate way.","zh":"（多用复数，昵称说法）某些动物的前爪，尤指猫的“爪爪/小爪子”。"},"examples":[{"en":"The kitten tucked its mittens under its chest and fell asleep.","zh":"小猫把小爪子收在胸前睡着了。"},{"en":"Look at her white mittens—she has “socks” on her paws!","zh":"看看她那白白的小爪子——像穿了“袜子”一样！"}]}],"synonyms":["gloves","handwear"],"phonetic":"/ˈmɪtənz/","extraExplanation":["“mittens”几乎总是以复数出现（a pair of mittens 一副连指手套）。单数形式是 mitten。","文化小提示：在英语童谣和儿童文学里，mittens 经常出现，比如《The Three Little Kittens》里有“lost their mittens（弄丢了手套）”。"]}
{"word":"mittent","summary":{"en":"A mitten is a glove with a separate thumb but fingers together.","zh":"mitten 指拇指分开、其余四指连在一起的连指手套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of glove with a separate thumb but no separate fingers (the fingers are together in one part).","zh":"连指手套（拇指分开，其余四指合在同一个套里的一种手套）。"},"examples":[{"en":"It was freezing, so she put on her wool mittens.","zh":"天气很冷，所以她戴上了羊毛连指手套。"},{"en":"I can’t text well with mittens on.","zh":"戴着连指手套我不太好打字。"},{"en":"The child dropped one mitten in the snow.","zh":"孩子把一只连指手套掉进雪里了。"}]}],"synonyms":["mitt"],"phonetic":"/ˈmɪtən/","extraExplanation":["拼写提醒：正确拼写通常是 **mitten**（单数）/ **mittens**（复数）。你输入的 **mittent** 很可能是拼写错误；英语里 *mittent* 不是常用词。","用法区分：**mitten** 指“连指手套”；**glove** 指“五指分开的手套”。另外 **mitt** 常指“露指手套/运动用手套”（如棒球手套 *baseball mitt*）。","词源小知识：*mitten* 来自法语相关词（与手套/小手套的概念有关），在英语里多用于寒冷天气穿戴的场景。"]}
{"word":"mittere","summary":{"en":"*Mittere* is a Latin verb meaning “to send,” and by extension “to release” or “to emit.” It is the root of many English words like transmit, emit, and commit.","zh":"*mittere* 是拉丁语动词，核心意思是“发送/派遣”，并引申为“释放/放开”或“发出/散发”。它是许多英语词（如 transmit、emit、commit）的词根。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Latin) to send; to dispatch (someone or something)","zh":"（拉丁语）派遣；送出（某人或某物）"},"examples":[{"en":"In Latin, *mittere* means “to send,” and it is the root of words like *transmit*.","zh":"在拉丁语中，*mittere* 的意思是“发送/传递”，也是 *transmit*（传送）的词根。"},{"en":"The general ordered the troops to be sent (Latin: *mittere*).","zh":"将军下令派遣（拉丁语：*mittere*）部队。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Latin) to let go; to release; to drop","zh":"（拉丁语）放开；释放；放下"},"examples":[{"en":"The idea can also mean “to release,” as in letting someone go free.","zh":"这个词也可表示“释放”，例如放人自由。"},{"en":"He released the rope (Latin: *mittere*) and the boat drifted away.","zh":"他放开（拉丁语：*mittere*）绳子，小船漂走了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Latin) to send out (a sound, a smell, light, etc.); to emit","zh":"（拉丁语）发出（声音、气味、光等）；散发"},"examples":[{"en":"From this sense we get English *emit* (“send out”).","zh":"由这个义项衍生出英语 *emit*（“发出/排放”）。"},{"en":"The flowers seemed to emit a sweet scent (Latin: *mittere*).","zh":"花朵似乎散发出（拉丁语：*mittere*）甜美的香气。"}]}],"synonyms":["send","dispatch","release","emit"],"phonetic":"/ˈmɪtɛreɪ/","extraExplanation":["*mittere* 是非常常见的拉丁语动词词根，进入英语后常以词缀形式出现：\n- **trans- + mit** → *transmit* 传递（把东西“送过去”）\n- **e- + mit** → *emit* 发出/排放（把东西“送出来”）\n- **com- + mit** → *commit* 承诺/犯（把自己“交付/送入”某事）\n- **re- + mit** → *remit* 汇款/免除（把钱“送回去”，或把责任“放下/解除”）\n相关名词也来自同源：*mission*（使命/派遣）、*missile*（投射物，原意与“送出/发射”有关）。"]}
{"word":"mittimus","summary":{"en":"Mittimus is a formal legal word meaning a written order to commit someone to detention, usually jail.","zh":"Mittimus 是非常正式的法律用语，指书面拘押/收监命令（通常送入监狱或看守所）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a written legal order (warrant) that sends someone to prison or orders an official detention","zh":"（法律）拘押令；收监令（书面命令，要求将某人拘禁/送入监狱）"},"examples":[{"en":"The judge issued a mittimus committing the defendant to county jail.","zh":"法官签发了收监令，将被告送入县监狱。"},{"en":"Without a valid mittimus, the jail could not lawfully hold him.","zh":"没有有效的拘押令，监狱就不能合法拘留他。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, historical) a written order sending someone away or dismissing someone from a position","zh":"（罕见/旧用法）遣送令；解职令（书面命令，命人离开或免去职务）"},"examples":[{"en":"In older records, a mittimus could refer to an order of dismissal from office.","zh":"在较早的档案中，mittimus 有时指解职令。"}]}],"synonyms":["commitment order","warrant","commitment warrant","detention order"],"phonetic":"/ˈmɪtɪməs/","extraExplanation":["这个词非常正式且偏法律文书用语，在现代日常英语里几乎不会出现；更常见的说法是 warrant（逮捕令/拘押令）或 commitment order（收监令）。","词源来自拉丁语 mittimus，意思是“我们送出/我们派遣”（源自动词 mittere“发送”）。因此它常指“把人送去某处”的书面命令，尤其是“送去拘押”。","阅读美国法律或法院文件时，如果看到 mittimus，通常是在描述“法院向监狱/看守所发出的正式收押指令”，属于程序性文件。"]}
{"word":"mittimuses","summary":{"en":"“Mittimuses” is the plural of “mittimus,” a court order to commit someone to custody or prison.","zh":"“mittimuses”是“mittimus”的复数，指法院签发的拘押/收押令，用于将某人送入或继续关押。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mittimus**: a legal written order (warrant) directing that someone be taken to prison or kept in custody.","zh":"**mittimus** 的复数：一种法律文书（拘押令/收押令），指示将某人送入监狱或继续羁押。"},"examples":[{"en":"After the hearing, the judge signed the **mittimuses** sending the defendants to county jail.","zh":"听证结束后，法官签署了这些**收押令**，将被告送往县监狱。"},{"en":"The clerk prepared the **mittimuses** based on the court’s decision.","zh":"书记员根据法院裁决起草了这些**拘押令**。"}]}],"synonyms":["commitment order","warrant of commitment","commitment warrant"],"phonetic":"/ˈmɪtɪməs/","extraExplanation":["“mittimus”源自拉丁语，意思大致是“我们送交/我们移送”。在英美法语境里，它指法院出具的书面指令，用来把人“移交”到监狱或看守所。","日常英语中很少用到这个词，更多出现在法律文件或历史文献里。更常见、易懂的表达包括：**commitment order**, **warrant of commitment**, **commitment warrant**（具体用法因司法辖区而异）。","拼写提示：复数通常写作 **mittimuses**（也有人写作 *mittimi*，但在现代英语里不如 *mittimuses* 常见）。"]}
{"word":"mittle","summary":{"en":"“mittle” is a Scottish verb meaning “to injure badly; to maim or mutilate.”","zh":"“mittle”是一个主要用于苏格兰英语的动词，意思是“重伤；使残废/毁伤”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Scottish English, transitive) to injure badly; to maim or mutilate.","zh":"（苏格兰英语，及物）重伤；使残废；残害、毁伤。"},"examples":[{"en":"He fell into the machinery and nearly mittled his hand.","zh":"他摔进机器里，差点把手给毁伤了。"},{"en":"The dog mittled the sheep before the farmer could stop it.","zh":"农夫还没来得及阻止，狗就把羊咬得遍体鳞伤。"}]}],"synonyms":["injure","hurt","maim","mutilate","maul"],"phonetic":"/ˈmɪtəl/","extraExplanation":["“mittle”是较少见的词，主要见于苏格兰英语/苏格兰方言（Scots）语境，在现代标准美式英语里不常用；在日常写作里更常用的对应词是“hurt / injure / maim / mutilate”。","词源上有资料认为它可能与法语“mutiler（使残缺、毁伤）”有关。","也有人会把它误看成“middle（中间）”的拼写错误，或与德语“mittel（中间的/方法、手段）”混淆；如果你是在德语句子里看到“mittle”，它可能只是“mittel”的一种变形。"]}
{"word":"mitts","summary":{"en":"“Mitts” is the plural of “mitt”: either warm, fingerless-style gloves (mittens) or padded sports gloves (especially baseball or boxing).","zh":"“mitts”是“mitt”的复数：可指保暖用的连指手套，也可指加厚的运动手套（尤其棒球或拳击）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of glove (often thicker and without separate fingers) used especially to keep hands warm.","zh":"连指手套；（通常较厚、手指不分开的）保暖手套。"},"examples":[{"en":"It was so cold that I wore wool mitts on my walk.","zh":"天气太冷了，我散步时戴了羊毛连指手套。"},{"en":"Don’t forget your hat and mitts when you go outside.","zh":"你出门时别忘了帽子和连指手套。"}]},{"partOfSpeech":"n.","definition":{"en":"A large, padded glove used in sports, especially baseball (for catching) and boxing (as protective gloves).","zh":"（运动用）手套；尤指棒球手套（接球用）或拳击手套（护具）。"},"examples":[{"en":"He grabbed his mitts and headed to baseball practice.","zh":"他拿起棒球手套就去训练了。"},{"en":"The boxer put on his mitts before sparring.","zh":"拳击手在对练前戴上了拳击手套。"}]}],"synonyms":["mittens","gloves","baseball glove"],"phonetic":"/mɪts/","extraExplanation":["“mitts”通常是“mitt”的复数。日常口语里，“mitts”也可以泛指“手套”，但更常让人联想到“连指手套”（保暖用）或“棒球手套/拳击手套”（运动用）。","和“gloves”对比：gloves一般是每根手指分开的；mittens/mitts通常把四根手指放在同一个空间里（拇指单独）。因此mitten更保暖，但做精细动作没那么方便。","在美式英语里，棒球场景中更常说“baseball mitt / glove”。有时“mitt”特指接球手（catcher）的加厚手套，但很多人也会用它泛指棒球手套。"]}
{"word":"mitty","summary":{"en":"Mitty refers to Walter Mitty (a fictional character) and, by extension, a person who often escapes into heroic daydreams.","zh":"Mitty 既可指虚构人物 Walter Mitty，也可引申指爱做英雄式白日梦、爱幻想的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who often escapes into heroic or adventurous daydreams; a fantasist (from the character Walter Mitty)","zh":"常常沉浸在自己英雄式、冒险式白日梦里的人；爱幻想的人（源自人物 Walter Mitty）"},"examples":[{"en":"He’s a bit of a Mitty—always imagining he’s saving the day.","zh":"他有点像个“Mitty”，总爱幻想自己在拯救世界。"},{"en":"During boring meetings, she turns into a Mitty and drifts into elaborate fantasies.","zh":"开无聊会议时，她就变成了“Mitty”，飘进很复杂的幻想里。"}]},{"partOfSpeech":"n.","definition":{"en":"Walter Mitty, the main character in the short story “The Secret Life of Walter Mitty”","zh":"Walter Mitty：短篇小说《沃尔特·米蒂的秘密生活》中的主角"},"examples":[{"en":"In the story, Walter Mitty’s real life contrasts with his bold inner adventures.","zh":"在故事里，Walter Mitty 的现实生活与他脑内的大胆冒险形成对比。"}]}],"synonyms":["daydreamer","fantasist","dreamer"],"phonetic":"/ˈmɪti/","extraExplanation":["“Mitty”这个用法来自美国作家 James Thurber 1939 年的短篇小说《The Secret Life of Walter Mitty》。Walter Mitty 表面上是普通人，但内心常把自己想象成飞行员、外科医生等“英雄”。因此英语里会用 “a Walter Mitty / a Mitty” 来形容爱做英雄梦、常沉浸在白日梦里的人。","语气提示：在日常对话中说某人 “a Mitty” 往往带一点调侃（不是很严厉的骂人），更像是在说对方“爱幻想、爱脑补”。"]}
{"word":"mitu","summary":{"en":"“mitu” most often appears as a rare word for a South American curassow (or the genus *Mitu*). “Mitú” is more commonly a proper noun: a city in Colombia or a Latino media brand.","zh":"“mitu”在英语里多见于较罕见的“南美凤冠雉/凤冠雉属（*Mitu*）”。更常见的是专有名词“Mitú”：哥伦比亚的一座城市，或一个拉丁裔数字媒体品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A curassow (a large, turkey-like bird) from Brazil; also the genus name *Mitu*.","zh":"（罕见）一种产自巴西的凤冠雉类大型鸟；也可指其属名 *Mitu*（凤冠雉属）。"},"examples":[{"en":"In older zoology books, “mitu” refers to a South American curassow.","zh":"在较早的动物学书里，“mitu”用来指一种南美的凤冠雉。"},{"en":"The genus *Mitu* includes several black curassows found in tropical forests.","zh":"*Mitu* 属包括几种生活在热带雨林中的黑色凤冠雉。"}]},{"partOfSpeech":"n.","definition":{"en":"Mitú: the capital city of Vaupés Department in southeastern Colombia (Amazon region).","zh":"Mitú：哥伦比亚东南部沃佩斯省（Vaupés）的省会城市（亚马孙地区）。"},"examples":[{"en":"Mitú is one of Colombia’s most isolated departmental capitals.","zh":"Mitú 是哥伦比亚最偏远的省会城市之一。"}]},{"partOfSpeech":"n.","definition":{"en":"Mitú (also written MiTu): a Latino-focused digital media/entertainment company brand based in the U.S.","zh":"Mitú（也常写作 MiTu）：一家面向拉丁裔受众的美国数字媒体/娱乐品牌。"},"examples":[{"en":"She discovered the show through Mitú’s social media channels.","zh":"她通过 Mitú 的社交媒体账号看到了那档节目。"}]}],"synonyms":["curassow","genus name","proper noun"],"phonetic":"/ˈmiːtuː/","extraExplanation":["“mitu”和“Mitú”常被混淆：带重音符号的 **Mitú** 通常是地名（哥伦比亚城市）或品牌名；小写 **mitu** 在英语词典里更多见于“鸟/鸟属”的罕见用法。","如果你其实想输入的是 **#MeToo（我也是）** 运动的拼写，它是 **Me Too**（两个词），读音和“mitu”不同。"]}
{"word":"mitua","summary":{"en":"Mitua is a rare word, used for a South American curassow (a large bird), and sometimes as a name connected with the Guayabero people.","zh":"Mitua 是个很罕见的词，可指一种南美的凤冠雉类大型鸟，也有时用作与哥伦比亚 Guayabero 人群相关的称名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A large South American bird: a curassow; in Brazilian usage it can refer to birds like the mutum/curassow group.","zh":"（罕见）一种南美大型鸟类：凤冠雉（curassow）一类；在巴西用法中可指与“mutum（巴西常称的凤冠雉类）”相关的鸟。"},"examples":[{"en":"In older sources on Brazilian wildlife, you may see **mitua** used for a kind of curassow.","zh":"在一些较旧的巴西野生动物资料里，你可能会看到 **mitua** 用来指某种凤冠雉。"},{"en":"The guide said the forest is home to curassows, sometimes called **mitua** in regional writing.","zh":"向导说这片森林里有凤冠雉，在一些地区性的文字里也会叫 **mitua**。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun, less common) A name used for the Guayabero people (an Indigenous group in Colombia), as used by neighboring groups.","zh":"（专有名词，较少见）对哥伦比亚 Guayabero（瓜亚贝罗）族/人群的一种称呼（多为邻近族群对他们的称名）。"},"examples":[{"en":"Some resources list **Mitua** as an alternate name connected with the Guayabero people.","zh":"一些资料会把 **Mitua** 列为与 Guayabero 人群相关的别称。"}]}],"synonyms":["curassow","mutum","Guayabero"],"phonetic":"/mɪˈtuːə/","extraExplanation":["“mitua”在英语里非常罕见，更多见于地区性/学术性资料（例如南美动物名称或族群称名）。\n\n你输入的 **mitua** 也很可能是拼写想写 **minutia /məˈnuːʃiə/**（意思是“细枝末节、琐碎细节”）。如果你告诉我你是在什么句子里看到/想用这个词，我可以帮你判断到底是哪一个。"]}
{"word":"mitvoth","summary":{"en":"Mitzvot/mitzvoth are the plural of mitzvah: Jewish commandments; more broadly, good deeds.","zh":"mitzvot/mitzvoth 是 mitzvah 的复数：指犹太教诫命；也可泛指善行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) The plural of mitzvah: commandments or religious duties in Jewish law (from the Torah); in everyday English, it can also mean “good deeds.”","zh":"（犹太教）mitzvah 的复数：指犹太律法中的诫命、宗教义务（源自《妥拉》）；在日常英语里也常泛指“善行/好事”。"},"examples":[{"en":"Many Jews try to observe the mitzvot related to Shabbat.","zh":"许多犹太人努力遵守与安息日（Shabbat）有关的各项诫命。"},{"en":"Volunteering at the food pantry felt like doing a mitzvah—really, several mitzvot.","zh":"在食物救济站做志愿者感觉像是在行善——严格说，是做了好几件“mitzvot（善行）”。"}]}],"synonyms":["commandments","precepts","religious duties","good deeds"],"phonetic":"/ˈmɪts.voʊt/","extraExplanation":["你输入的 **mitvoth** 很可能是拼写变体或误拼；更常见的拼法是 **mitzvoth** 或 **mitzvot**（都是“mitzvah 的复数”）。","在宗教语境里它更准确地指“诫命/命令”；但在美式英语口语中，人们常把 **a mitzvah** 用来指“一件好事/善举”，因此复数 **mitzvot/mitzvoth** 有时也会被理解为“许多善行”。","常见相关词：**bar mitzvah / bat mitzvah**（成人礼；字面意思与“诫命”相关，但在英语里主要指仪式/庆典）。"]}
{"word":"mity","summary":{"en":"“Mighty” means very strong/powerful, and it can also mean “very” for emphasis.","zh":"“mighty”表示“强大/有力量的”，也可作副词表示“非常”，用于强调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very strong, powerful, or important; having great strength or influence.","zh":"非常强大/有力量的；有巨大影响力的。"},"examples":[{"en":"It took a mighty effort to finish the project on time.","zh":"为了按时完成项目，我们付出了巨大的努力。"},{"en":"The mighty river flooded after days of heavy rain.","zh":"连日大雨后，这条大河泛滥了。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used to emphasize the degree of something (often meaning “very” or “extremely”).","zh":"用于强调程度（常表示“非常”“极其”）。"},"examples":[{"en":"That’s a mighty big suitcase for a weekend trip.","zh":"周末出行你这箱子也太大了。"},{"en":"She was mighty proud of her first speech in English.","zh":"她对自己第一次用英语演讲感到非常自豪。"}]}],"synonyms":["powerful","strong","great","formidable","very"],"phonetic":"/ˈmaɪti/","extraExplanation":["“mity”本身不是常见的标准英语单词；多数情况下是把 **mighty** 拼错了（少一个 *gh*）。如果你是在小说/方言里看到“mity”，也可能是作者为了口语效果的非常规拼写。"]}
{"word":"mitzvah","summary":{"en":"A Jewish commandment; also commonly used to mean a good deed or kind act.","zh":"犹太教的诫命；也常用来泛指善行或好事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Judaism, a commandment (a religious duty) in the Torah; more broadly, any good deed done as a moral or religious obligation.","zh":"（犹太教）诫命、戒律（《妥拉》中的宗教义务）；也可泛指出于道德或宗教责任而做的善行。"},"examples":[{"en":"Helping a neighbor in need can be seen as a mitzvah.","zh":"帮助有需要的邻居可以被视为一种 mitzvah（善行）。"},{"en":"Some mitzvot are about justice and kindness, not only rituals.","zh":"有些 mitzvot（诫命）强调公义与仁爱，不仅是宗教仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"In everyday American English, a particularly good or kind thing to do (often used informally, sometimes humorously).","zh":"（美式英语口语）指“特别好的/很贴心的一件事”（常带轻松或略幽默的语气）。"},"examples":[{"en":"It would be a mitzvah if you could drive me to the airport.","zh":"如果你能送我去机场，那真是帮了大忙（简直是个 mitzvah）。"},{"en":"Fixing the printer today was a real mitzvah—thanks!","zh":"你今天把打印机修好真是太给力了——谢谢！"}]}],"synonyms":["good deed","kind act","commandment","charitable act"],"phonetic":"/ˈmɪtsvə/","extraExplanation":["“mitzvah”来自希伯来语 מִצְוָה（mitzváh），原义是“命令/诫命”。在犹太传统里常提到“613条诫命”（mitzvot 是复数形式）。","你可能见过“bar mitzvah / bat mitzvah”：分别指男孩/女孩在犹太传统中达到宗教意义上的成人阶段（常伴随仪式与庆祝）。这里的 mitzvah 更偏“责任/义务”的含义。","在非宗教语境里用 mitzvah 时，一般是借用了“做善事、行好事”的感觉；写正式文章时，最好确保读者能理解这是一个带犹太文化背景的借词。"]}
{"word":"mitzvahs","summary":{"en":"Mitzvahs are Jewish commandments, and in everyday English the word can also mean good deeds or acts of kindness.","zh":"Mitzvahs 指犹太教的诫命；在日常英语中也常用来指善行或好事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewish religious commandments or obligations (plural of *mitzvah*).","zh":"犹太教的诫命、戒律或宗教义务（*mitzvah* 的复数）。"},"examples":[{"en":"In Judaism, there are 613 traditional mitzvahs (commandments) discussed in the Torah.","zh":"在犹太教传统中，《妥拉》中常谈到有 613 条 mitzvahs（诫命）。"},{"en":"They studied the mitzvahs related to charity and fairness.","zh":"他们学习了与慈善和公正有关的 mitzvahs（诫命）。"}]},{"partOfSpeech":"n.","definition":{"en":"Good deeds—acts of kindness or charity done because they are the right thing to do.","zh":"善行——出于道德与善意而做的好事（常含慈善、帮助他人之意）。"},"examples":[{"en":"Helping an elderly neighbor can feel like doing a mitzvah.","zh":"帮助年长的邻居会让人觉得是在做一件 mitzvah（善行）。"},{"en":"She said volunteering was her way of doing small mitzvahs every week.","zh":"她说做志愿者是她每周做一些小 mitzvahs（善行）的方式。"}]}],"synonyms":["commandments","good deeds","acts of kindness","charitable acts"],"phonetic":"/ˈmɪtsvəz/","extraExplanation":["“Mitzvah”来自希伯来语，核心意思是“诫命/命令”。在日常英语里，人们也常把它用作“善行、好事”，带有文化色彩：强调不仅是“做好事”，还包含“这是我应当做的事”的道德责任感。","复数在英文中常写作 **mitzvahs**（更英文化的拼写）。在犹太社群或更贴近希伯来语的语境里，也会看到 **mitzvot**（希伯来语复数）或 **mitzvos**（受意第绪语影响的拼写）。"]}
{"word":"mitzvoth","summary":{"en":"Mitzvoth (more commonly spelled mitzvot) is the plural of mitzvah, meaning Jewish commandments or, more broadly, religious duties and good deeds.","zh":"Mitzvoth（更常见拼法为 mitzvot）是 mitzvah 的复数，指犹太教的诫命；也可泛指宗教义务或善行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Judaism, the commandments (traditionally counted as 613) found in the Torah; more broadly, religious duties or good deeds done as part of Jewish practice.","zh":"（犹太教）诫命；（传统上称《托拉》中有613条）也可泛指宗教义务，或作为犹太实践的一种“行善/善行”。"},"examples":[{"en":"Keeping kosher and observing Shabbat are examples of mitzvot in Jewish life.","zh":"守洁食规与遵守安息日是犹太生活中的一些诫命（mitzvot）的例子。"},{"en":"She volunteers every week; in her community, that’s seen as doing a mitzvah.","zh":"她每周都做志愿服务；在她的社群里，这被视为在行一件“善行/功德”（mitzvah）。"}]}],"synonyms":["mitzvot","commandments","good deed"],"phonetic":"ˈmɪtsvɑt","extraExplanation":["“mitzvoth”是希伯来语复数的英语转写拼法之一，更常见的拼法是“mitzvot”。单数是“mitzvah”。不同拼法主要来自不同的转写传统，不影响意思。","在日常英语里，尤其在北美，“do a mitzvah”常被用来表示“做一件好事/善行”，语气通常积极、带有文化语境（犹太社群或受其影响的语境）。","不要把“mitzvot/mitzvoth（诫命）”和“bar/bat mitzvah（成人礼，字面是‘诫命之子/女’）”混为一谈：后者是仪式/人生阶段名称，而前者是“诫命/义务”的复数。"]}
