{"word":"mix","summary":{"en":"“Mix” means to combine things together (verb) or a combination/blend of things (noun). It can also mean to socialize with others.","zh":"“mix”既可作动词表示“混合、搅拌；交往”，也可作名词表示“混合物；组合”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to combine or blend things together so they become one mixture","zh":"把事物混合在一起，形成一种混合物"},"examples":[{"en":"Mix the flour and water until it becomes smooth.","zh":"把面粉和水混合，直到变得顺滑。"},{"en":"She mixed blue and yellow to make green.","zh":"她把蓝色和黄色混合成绿色。"}]},{"partOfSpeech":"vi.","definition":{"en":"to socialize or spend time with other people (often used with “with”)","zh":"（常与with连用）与人交往、相处"},"examples":[{"en":"He doesn’t mix much with his coworkers after work.","zh":"他下班后不太和同事来往。"},{"en":"It’s good to mix with people from different backgrounds.","zh":"和不同背景的人交往是件好事。"}]},{"partOfSpeech":"n.","definition":{"en":"a combination of different things; a blend","zh":"混合；混合物；多种事物的组合"},"examples":[{"en":"The city is a mix of old buildings and new towers.","zh":"这座城市是老建筑和新高楼的混合。"},{"en":"This snack mix has nuts, raisins, and chocolate.","zh":"这种零食混合包里有坚果、葡萄干和巧克力。"}]}],"synonyms":["blend","combine","merge","stir","mingle"],"phonetic":"/mɪks/","extraExplanation":["常见搭配：mix A with B（把A和B混合）；mix up（弄混/搞错：I mixed up the names 我把名字弄混了；也可指“把事情打乱/搅乱”）；mix in（把……拌进去：Mix in the onions 把洋葱拌进去）。","在口语里，“a mix of …”很常用，表示“……的组合/混合”，语气中性，可用于人、文化、风格、口味等。"]}
{"word":"mix-and-match","summary":{"en":"combine different items freely to make new combinations","zh":"把不同物品自由搭配成新的組合"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to combine different things—often from different sets or styles—in various ways to create a new combination","zh":"把不同來源或風格的東西自由搭配，組合出新的搭配方式"},"examples":[{"en":"You can mix-and-match these tops and skirts to create different outfits.","zh":"你可以把這些上衣和裙子混搭，搭出不同的穿搭。"},{"en":"The app lets you mix-and-match filters until the photo looks right.","zh":"這個 App 讓你自由混搭濾鏡，直到照片看起來剛好。"},{"en":"We mix-and-match ideas from different teams to solve the problem.","zh":"我們把不同團隊的點子混搭起來解決問題。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of items) designed so their parts can be combined with other parts easily","zh":"（物品）採用可互換、可自由搭配的設計"},"examples":[{"en":"The furniture set is mix-and-match, so you can choose different colors for each piece.","zh":"這套家具是可混搭的，所以每件你都能選不同顏色。"},{"en":"They sell mix-and-match earrings, so you don’t need a perfectly identical pair.","zh":"他們賣可混搭的耳環，所以不需要完全一模一樣的一對。"}]}],"synonyms":["mix","match","combine","pair","coordinate","interchange","swap around"],"phonetic":"/ˌmɪks ən ˈmætʃ/","extraExplanation":["常見於購物、時尚、家居、軟體功能介紹等情境，強調「不用一整套也能搭」與「自由組合」。","寫法上：作動詞片語時常見 mix and match（不一定加連字號）；作形容詞放在名詞前時常見 mix-and-match（如 mix-and-match outfits）。"],"etymology":"源自英文動詞片語 mix and match（把不同東西混合並配對）。20 世紀在零售與時尚語境中特別常見，後來常用連字號變成形容詞或名詞式的用法（如 mix-and-match wardrobe）。","mnemonic":["把它想成「mix（混）+ match（配）」＝「混著配」＝「混搭」。","聯想中文常說的「混搭風」「自由搭配」，看到連字號就記得是固定搭配/形容詞用法。"]}
{"word":"mix-and-matchers","summary":{"en":"People who like to combine different things into one set or style.","zh":"喜欢把不同东西混搭成一套风格的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who combine different items (like clothes, furniture, or ideas) from various sources to create a new, pleasing, or useful combination.","zh":"喜欢把来自不同来源的东西（如衣服、家具或点子）混搭起来，组成新颖且好看的组合的人。"},"examples":[{"en":"The design team is full of mix-and-matchers who blend modern and vintage styles.","zh":"这个设计团队里有很多混搭达人，会把现代风和复古风融合在一起。"},{"en":"As a mix-and-matcher, she rarely buys a full set; she picks pieces that work together.","zh":"作为混搭派，她很少整套购买；她会挑能搭在一起的单品。"}]}],"synonyms":["mixers","stylists","curators","tastemakers","collage artists"],"phonetic":"/ˌmɪks ən ˈmætʃərz/","extraExplanation":["这个词带一点口语、轻松的语气，常用于称赞某人“会搭配、会整合资源”。也可用于更抽象的场景，比如“把不同想法拼起来做方案”的人。"],"etymology":"来自短语“mix and match”（把不同东西混合搭配）；后加表示“人”的后缀 -er（mix-and-matcher），再变复数 -s。常用于时尚、家居与创意表达场景。","mnemonic":["把它拆开记：mix（混）+ match（配）+ -er（做这件事的人）→“混搭的人”。","联想中文“混搭达人/混搭党”，看到 -ers 就想到“这些人（复数）”。"]}
{"word":"mix-up","summary":{"en":"a confusion or mistake caused by mixing things up","zh":"因混淆而导致的弄错或混乱"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mistake caused by confusing people or things; a situation where details get mixed and end up wrong.","zh":"（因把人或事物搞混而造成的）弄错；混淆导致的错误或状况。"},"examples":[{"en":"There was a mix-up with the reservations, so our table wasn’t ready.","zh":"订位出了点混乱（弄错了），所以我们的桌子还没准备好。"},{"en":"Sorry—I thought you were Alex. It was a mix-up.","zh":"抱歉——我以为你是 Alex，是我搞混了。"},{"en":"The mail mix-up meant she received her neighbor’s package.","zh":"邮件弄错了，她收到了邻居的包裹。"}]},{"partOfSpeech":"n.","definition":{"en":"A brief argument or fight.","zh":"（短暂的）争吵；打斗。"},"examples":[{"en":"He got into a mix-up outside the bar.","zh":"他在酒吧外卷入了一场小冲突。"},{"en":"The two teammates had a mix-up during practice but apologized later.","zh":"两位队友训练时起了争执，但后来道歉了。"}]}],"synonyms":["confusion","mistake","misunderstanding","mix-up","snafu","mess","blunder","tangle"],"phonetic":"/ˈmɪksˌʌp/","extraExplanation":["拼写上常见两种：mix-up（带连字符）与 mixup（合写）。两者意思相同；写作中用 mix-up 更常见、更清晰。","不要和动词短语“mix up”混淆：I mixed up the names.（我把名字搞混了。）名词则是：It was a mix-up.（这是个误会/弄错。）"],"etymology":"源自短语动词“mix up”（把……混在一起/弄乱），后来名词化为“mix-up”，表示“混淆造成的错误/混乱”，也可引申为“小冲突”。","mnemonic":["把 mix（混合）+ up（弄乱、搞到一起）连起来记：东西一“混”就容易“乱”，就会出现 mix-up（弄错/误会）。","联想中文“搞混了”：mix ≈ 混，up ≈ 乱起来 → “混乱/混淆”= mix-up。"]}
{"word":"mix-ups","summary":{"en":"a confusion-caused mistake or a messy, disorganized situation","zh":"因混淆造成的错误；混乱局面"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mistake caused by confusing one person or thing with another.","zh":"（把人或事物）搞混而导致的错误；弄错。"},"examples":[{"en":"There was a mix-up with the names, so the wrong person got the email.","zh":"名字弄混了，所以邮件发给了错误的人。"},{"en":"Sorry—this is just a mix-up. Your order is still on the way.","zh":"抱歉——这只是个小乌龙。你的订单还在路上。"}]},{"partOfSpeech":"n.","definition":{"en":"A confusing situation in which plans, information, or responsibilities are not organized correctly.","zh":"混乱局面；安排或信息对不上导致的混乱。"},"examples":[{"en":"The schedule change created a mix-up at the station.","zh":"行程一改，车站那边就乱成一团。"},{"en":"We need one contact person to avoid mix-ups.","zh":"我们需要一个对接人来避免混乱。"}]}],"synonyms":["confusion","mistake","misunderstanding","mixing","tangle","mess","blunder"],"phonetic":"ˈmɪksˌʌp","extraExplanation":["常用搭配：a mix-up with sth（在某事上弄错）；a mix-up between A and B（把A和B搞混）。","口语里 mix-up 常译作“乌龙”“搞错”“弄混”，语气通常不算很严重。"],"etymology":"来自短语动词 mix up（把……混在一起/弄乱），mix（混合）+ up（强调“完全、乱掉”）。后来名词化为 mix-up，表示“混淆造成的错误/混乱”。","mnemonic":["把 mix（混合）+ up（乱起来）联想成“越混越乱”，就容易记住“乌龙/弄错/混乱”。"]}
{"word":"mixability","summary":{"en":"Mixability means how well things can mix together, especially liquids, and can also mean how smoothly ingredients or styles blend.","zh":"Mixability 指“可混合性/融合度”，既可用于液体等物质是否容易混合，也可引申为配料或风格是否搭配、融合得好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability of two or more substances (especially liquids) to mix well and form a uniform mixture.","zh":"（尤指液体等物质的）可混合性；相互混合并形成均匀混合物的能力。"},"examples":[{"en":"Oil and water have low mixability, so they separate into layers.","zh":"油和水的可混合性很低，所以会分层。"},{"en":"Ethanol has high mixability with water, which is why they blend easily.","zh":"乙醇与水的可混合性很高，所以很容易混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"The ease with which ingredients, styles, or elements combine smoothly and work well together (often in cooking, cocktails, music, or design).","zh":"（引申）成分、风格或元素能否顺畅融合、搭配得好（常用于烹饪、调酒、音乐或设计）。"},"examples":[{"en":"The bartender tested the mixability of citrus juice with different spirits.","zh":"调酒师测试了柑橘汁与不同烈酒的融合度（可混合性）。"},{"en":"Their sound is known for the mixability of jazz and electronic music.","zh":"他们的风格以爵士与电子乐的融合性（可混搭性）著称。"}]}],"synonyms":["miscibility","blendability","compatibility","mixing ability"],"phonetic":"/ˌmɪksəˈbɪləti/","extraExplanation":["“mixability”常见于化学、材料与食品/饮料领域：强调两种物质能否在一定条件下（温度、比例、搅拌、溶剂等）形成稳定且均匀的体系。需要注意它更偏“性质/能力”（a property），而不仅是一次性的“混合动作”。","与“miscibility”对比：在化学语境里，“miscibility”更专业、也更常用，通常特指两种液体在任意比例下都能互溶（如乙醇与水）；“mixability”更口语化/应用化，既可讲科学性质，也常用于烹饪、调酒等“好不好混、容不容易混”的讨论。","搭配建议：常用说法有“high/low mixability”“mixability with + 名词”“test/measure/improve mixability”。在日常表达中，也可以用更自然的词替换，如“how well they mix”“how easily it blends”。"]}
{"word":"mixable","summary":{"en":"Mixable means “able to be mixed (with something else),” often used for paints, foods, or materials.","zh":"Mixable 表示“可混合的/适合混合的”，常用于颜料、食物或材料等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be mixed (with something else) easily or well.","zh":"可混合的；容易（或适合）与其他东西混合的。"},"examples":[{"en":"This paint is mixable with water, so cleanup is easy.","zh":"这种颜料可以和水混合，所以清理很方便。"},{"en":"Choose a mixable base so you can create different flavors.","zh":"选择一种可混合的基底，这样你就能调出不同口味。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing, informal) Able to be combined with other software pieces or modules.","zh":"（计算机领域，非正式）可与其他软件组件/模块组合使用的。"},"examples":[{"en":"The library is designed to be mixable with different frameworks.","zh":"这个库被设计为可以与不同框架组合使用。"}]}],"synonyms":["blendable","combinable","mix-and-match (informal)","compatible (context-dependent)"],"phonetic":"/ˈmɪk.sə.bəl/","extraExplanation":["“mixable”通常用于产品说明或配方语境，意思是“可以混在一起/适合混合”。常见搭配：mixable with water（可与水混合）、mixable colors（可调配的颜色）。","它和“miscible”不一样：miscible多用于科学语境，特指两种液体能完全互溶（如酒精和水）；mixable更日常、更宽泛，不一定表示“完全互溶”。"]}
{"word":"mixableness","summary":{"en":"Mixableness means the quality of being mixable—how easily something can be mixed or blended (literally or figuratively).","zh":"mixableness 指“可混合性/可融合性”，强调某物（或人/想法）混在一起是否容易、是否协调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be mixed or blended together; how easily something combines with something else.","zh":"可混合性；指某物与其他物质/事物混合或融合的容易程度。"},"examples":[{"en":"The mixableness of the powder improves when you add a little warm water.","zh":"加一点温水后，这种粉末的可混合性会变好。"},{"en":"She tested the mixableness of the colors before starting the painting.","zh":"她在开始作画前测试了这些颜色的可混合性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) The ability of people, ideas, or styles to blend well together without conflict.","zh":"（引申）人、观点或风格之间的“好融合/好相处”的特性，不容易产生冲突。"},"examples":[{"en":"The team’s success depended on the mixableness of their working styles.","zh":"团队的成功取决于他们工作风格之间的融合度。"},{"en":"The author praised the mixableness of tradition and innovation in the design.","zh":"作者称赞这个设计把传统与创新融合得很好。"}]}],"synonyms":["mixability","miscibility","blendability","compatibility"],"phonetic":"/ˈmɪksəb(ə)lnəs/","extraExplanation":["“mixableness”是由形容词 mixable（可混合的）+ 后缀 -ness（……的性质）构成的名词，但在现代英语里相对少见；更常用的名词是 mixability。","在较偏理工/化学语境里，如果说两种液体“能互相完全混合”，更常见、更专业的词是 miscibility / miscible（可互溶性/可互溶的）。","日常表达里，如果你想说“好搭配、好融合”，也可以用更自然的说法：how well they mix / blend well / compatibility（兼容性）。"]}
{"word":"mixblood","summary":{"en":"“mixblood” (more often “mixed-blood”) is a dated term for a person or community described as having mixed ancestry; it can be offensive, so modern alternatives like “multiracial” are preferred.","zh":"“mixblood”（更常见写作“mixed-blood”）是描述混合血统的过时说法，可能带冒犯性；现代更常用“multiracial”等较尊重人的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated; often offensive) A person said to have mixed ancestry (especially in older writing about Indigenous and European ancestry).","zh":"（过时；常带冒犯性）指被认为具有混合血统的人（尤见于旧时关于原住民与欧洲血统混合的说法）。"},"examples":[{"en":"The novel uses the word “mixed-blood,” but today many readers find it disrespectful.","zh":"这部小说里用了“mixed-blood”这个词，但如今很多读者觉得它不尊重人。"},{"en":"In modern writing, it’s usually better to say “multiracial” or “of mixed heritage.”","zh":"在现代写作中，通常更适合说“multiracial（多种族）”或“of mixed heritage（混合族裔背景）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(dated) Having mixed ancestry; of mixed heritage.","zh":"（过时）具有混合血统的；混合族裔背景的。"},"examples":[{"en":"The article discusses mixed-blood communities in the 1800s.","zh":"这篇文章讨论了19世纪的混血社区。"}]}],"synonyms":["multiracial","mixed-race","of mixed heritage","biracial"],"phonetic":"/ˈmɪkst blʌd/","extraExplanation":["“mixed-blood / mixblood”更常见的写法是“mixed-blood”。它属于历史语境中的用词，常与殖民时期的种族分类、血统观念相关，因此在当代英语里容易被认为带有物化、贬义或歧视色彩。","如果你是在阅读历史文献或文学作品，保留原词用于引用是可以的，但在日常表达或正式写作中，通常建议改用更尊重人的说法，如“multiracial（多种族）”“mixed-race（混合种族）”“of mixed heritage（混合族裔背景）”。"]}
{"word":"Mixcoatl","summary":{"en":"An Aztec/Nahua hunting and sky deity, often associated with the Milky Way and the image of a cloud serpent.","zh":"纳瓦/阿兹特克体系中与狩猎与天空（银河）相关的神祇，常以“云蛇”形象著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Aztec/Nahua religion) A god associated with hunting, the Milky Way, and the night sky; often described as a “Cloud Serpent” and linked to the Chichimec peoples.","zh":"（阿兹特克/纳瓦宗教）与狩猎、银河与夜空相关的神祇，常被称为“云蛇”，也与奇奇梅克人群/传统有联系。"},"examples":[{"en":"In some Nahua traditions, Mixcoatl is connected to hunting and the Milky Way.","zh":"在一些纳瓦传统中，他与狩猎以及银河有关。"},{"en":"The name is often translated as “Cloud Serpent,” reflecting his sky-related symbolism.","zh":"这个名字常被译为“云蛇”，体现其与天空相关的象征意义。"},{"en":"Mythology lessons sometimes mention him when discussing Aztec gods beyond the more famous deities.","zh":"在讲到不那么“知名”的阿兹特克神祇时，神话课程有时会提到他。"}]}],"synonyms":["Cloud Serpent"],"phonetic":"/miʃˈkoʊɑːtəl/","extraExplanation":["发音提示：词尾的 Nahuatl “tl” 在原语中是一个较紧的舌尖边擦音，英语里常被读成接近 “tuhl/til”的音，因此在英语语境中会出现不同读法。","文化提示：不同地区与不同时期的纳瓦/阿兹特克传统对神祇的职责与谱系记载可能不完全一致；在阅读资料时可留意来源（编年史、考古研究或神话文本）。"],"etymology":"源自纳瓦特尔语（Nahuatl）：*mixtli* 表示“云”，*coātl* 表示“蛇”。合起来常被理解为“云蛇/云之蛇”。在西班牙语与英语文献中多以拉丁字母拼写形式流传。","mnemonic":["把它拆成“mixtli（云）+ coatl（蛇）”，记成“云 + 蛇 = 云蛇”。","联想：银河在一些文化里像一条横跨天空的“云带/白色长蛇”，帮助记住其与夜空、银河的关联。"]}
{"word":"mixdown","summary":{"en":"the final balancing and combining of multiple audio tracks into one finished version","zh":"把多轨音频合并并平衡成最终成品版本的缩混过程"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of combining and balancing recorded tracks (vocals, instruments, effects) into a final stereo or surround version","zh":"（音乐/影视后期）把多轨录音（人声、乐器、效果等）合并并调整平衡，做成最终立体声或环绕声版本的过程"},"examples":[{"en":"After tracking the vocals, we spent two days on the mixdown.","zh":"录完人声后，我们花了两天做混音缩混。"},{"en":"The mixdown needs more vocal clarity and less bass.","zh":"这版缩混需要人声更清晰、低频少一点。"}]},{"partOfSpeech":"v.","definition":{"en":"to combine and balance multiple audio tracks into a final version","zh":"（对多轨音频）进行混音缩混，合成最终版本"},"examples":[{"en":"Can you mixdown the song by Friday?","zh":"你能在周五前把这首歌缩混出来吗？"},{"en":"He mixdowns in his home studio using headphones and reference speakers.","zh":"他在家用耳机和监听音箱做缩混。"}]}],"synonyms":["mix","mixing","final mix","bounce","render"],"phonetic":"/ˈmɪksˌdaʊn/","extraExplanation":["在音乐制作流程里，mixdown 通常发生在“录音/编曲完成之后、母带处理（mastering）之前”。它常包含音量平衡、声像（左右位置）、EQ（均衡）、压缩、混响/延迟等效果处理。","日常口语里也可能写作 mix down（分开写），意思基本相同；在专业场景中 mixdown 更常见。"],"etymology":"来自 mix（混合）+ down（在录音棚语境里有“把多轨压到更少轨/最终输出”的含义）。最初常指把多轨录音“缩到”立体声母带的步骤，后来也泛指完成最终混音的过程。","mnemonic":["把它拆开记：mix（混）+ down（压下去/收尾输出）→“把各轨混在一起并压成最终版本”。","联想中文“缩混”：有“缩（down）到最终两轨/一版”的感觉，对应 mixdown。"]}
{"word":"mixe","summary":{"en":"Mixe refers to an Indigenous people of Mexico and the language(s) they speak.","zh":"Mixe 指墨西哥的墨西族（原住民）以及他们所说的墨西语（或相关语言）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Zoquean Indigenous people living mainly in Oaxaca (and nearby areas) in Mexico","zh":"墨西族：主要居住在墨西哥瓦哈卡州（及邻近地区）的一个原住民族群（属米赫-索克语系相关族群）"},"examples":[{"en":"The Mixe have maintained many cultural traditions in the Sierra Mixe region.","zh":"墨西族在“墨西高地地区”（Sierra Mixe）保留了许多文化传统。"},{"en":"She is doing research on Mixe communities in Oaxaca.","zh":"她正在研究瓦哈卡州的墨西族社区。"}]},{"partOfSpeech":"n.","definition":{"en":"the language (or group of closely related languages) spoken by the Mixe people","zh":"墨西语：墨西族所使用的语言（或一组关系密切的语言）"},"examples":[{"en":"He is learning Mixe to communicate with elders in the village.","zh":"他在学习墨西语，好与村里的长者交流。"},{"en":"The radio program includes announcements in Spanish and Mixe.","zh":"这个广播节目包含西班牙语和墨西语的公告。"}]}],"phonetic":"/ˈmiˌheɪ/","extraExplanation":["“Mixe”在英语里通常是专有名词（民族/语言），不是动词“mix”。如果你想查的是“mix”（混合），告诉我我可以再给你“mix”的词条（含动词/名词用法与常见搭配）。","发音常被读作“MEE-hay”（近似‘米-黑’）。词典中也会提到其名称与当地语言/西语转写有关。"]}
{"word":"mixed","summary":{"en":"“Mixed” most often means “combined from different things” or “having conflicting feelings”; it can also be the past form of “mix.”","zh":"mixed 常指“混合的”或“感受矛盾的/褒贬不一的”；也可作 mix 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing two or more different things combined; not pure or not all the same.","zh":"混合的；由两种或多种不同事物组合而成的；不纯的／不完全一致的。"},"examples":[{"en":"I like mixed nuts better than just peanuts.","zh":"我更喜欢混合坚果，而不只是花生。"},{"en":"The class has mixed levels, so the teacher uses different activities.","zh":"这个班水平参差不齐，所以老师会用不同的活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having uncertain or conflicting feelings; not clear or not fully positive/negative.","zh":"复杂矛盾的（感受）；又喜又忧的；不太明确的。"},"examples":[{"en":"I have mixed feelings about moving to a new city.","zh":"对于搬到新城市，我的心情很复杂。"},{"en":"The movie got mixed reviews—some people loved it, others didn’t.","zh":"这部电影评价褒贬不一——有人很喜欢，也有人不喜欢。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mix”; combined different things together.","zh":"mix 的过去式/过去分词：混合了；搅拌了；把……混在一起。"},"examples":[{"en":"She mixed flour and water to make dough.","zh":"她把面粉和水混合起来做面团。"},{"en":"The files got mixed up, so I can’t find the right one.","zh":"文件被弄乱/混在一起了，所以我找不到正确的那份。"}]}],"synonyms":["combined","blended","varied","conflicting"],"phonetic":"/mɪkst/","extraExplanation":["常见搭配：mixed up（弄乱、搞混；也可指“心烦意乱”）、mixed feelings（复杂的心情）、mixed bag（好坏参半的情况/事物）、mixed blessing（有利有弊的事）。","文化/用法提醒：在谈论“种族/族裔”时，mixed 也可指“混血的/多族裔的”（mixed-race / mixed-ethnicity）。这类话题较敏感，语境中更常用更具体、尊重的表达，如 “multiracial” 或直接说明背景。"]}
{"word":"mixed-acid","summary":{"en":"a strong-acid mixture used in chemical processes","zh":"用于化学过程的强酸混合物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mixture of strong acids (most commonly nitric acid and sulfuric acid) used in chemical reactions such as nitration","zh":"混酸；由强酸混合而成的酸性混合物（最常见为硝酸与硫酸），常用于硝化等反应"},"examples":[{"en":"In nitration, mixed-acid is often used to introduce a nitro group into an organic molecule.","zh":"在硝化反应中，常用混酸把硝基引入有机分子。"},{"en":"The lab prepared mixed-acid by carefully combining sulfuric acid and nitric acid in a controlled setup.","zh":"实验室在受控条件下，小心地把硫酸与硝酸混合来配制混酸。"}]},{"partOfSpeech":"adj.","definition":{"en":"containing or made from a mixture of acids","zh":"混酸的；含有多种酸混合而成的"},"examples":[{"en":"The mixed-acid bath must be handled with proper protective equipment.","zh":"这种混酸浴必须在做好防护的情况下操作。"}]}],"synonyms":["acid mixture","nitrating mixture","nitration mixture"],"phonetic":"/ˌmɪkst ˈæsɪd/","extraExplanation":["在英文化学语境里，mixed-acid 常特指“硝酸 + 硫酸”的混合体系：硫酸起到强脱水与增强硝酸活性的作用，使反应更容易进行，因此在有机化学的“硝化（nitration）”章节很常见。","该词多用于技术/学术写作；日常英语里一般不会说到。具体配方会随工艺变化，阅读资料时可留意是否给出比例或成分。"],"etymology":"由 mixed（混合的）+ acid（酸）构成的复合词；作为化学术语，用来指“由多种酸配制的酸性混合物”，在涉及硝化等工业/实验过程的语境中尤为常见。","mnemonic":["把它直译成“混合的酸”就很好记：mixed（混合）+ acid（酸）= 混酸。","联想化学实验：两种强酸“混在一起”的就是 mixed-acid。"]}
{"word":"mixed-age","summary":{"en":"made up of or open to people of different ages","zh":"由不同年龄层组成的；对多个年龄段开放的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Including people from different age groups (for example, children and adults together).","zh":"由不同年龄层的人组成的；混龄的（例如儿童与成人在一起）。"},"examples":[{"en":"The community center offers mixed-age art classes.","zh":"社区中心提供混龄的美术课。"},{"en":"A mixed-age team can share different strengths.","zh":"混龄团队可以互补各自的优势。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed for or open to participants from various ages.","zh":"面向多个年龄段开放的；适合不同年龄参加的。"},"examples":[{"en":"This playground encourages mixed-age play.","zh":"这个游乐场鼓励不同年龄的孩子一起玩。"},{"en":"They ran a mixed-age workshop for families.","zh":"他们举办了一个适合家庭参加的混龄工作坊。"}]}],"synonyms":["multigenerational","intergenerational","all-ages","age-diverse","cross-age"],"phonetic":"/ˌmɪkst ˈeɪdʒ/","extraExplanation":["常见搭配：mixed-age class/group/team/play（混龄班/群体/团队/游戏）。","写法提示：作定语时常用连字符 mixed-age（mixed-age class）；作表语或放在名词后也可能见到不加连字符的写法（less common），但连字符更标准、清晰。"],"etymology":"由 mixed（混合的）+ age（年龄）构成的复合形容词；常见于教育、社区活动与团队组织语境，用来强调“不同年龄一起”。","mnemonic":["把它拆开记：mixed=混合，age=年龄；合起来就是“年龄混合”。","联想中文“混龄”：一看到连字符，就像把两部分“绑在一起”，表示一个整体概念。"]}
{"word":"mixed-atom","summary":{"en":"containing more than one kind of atom or element","zh":"含有多种原子或元素的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing more than one kind of atom or element; not made of only one element.","zh":"（化学）含有不止一种原子或元素的；不是单一元素构成的。"},"examples":[{"en":"Water is a mixed-atom molecule because it contains hydrogen and oxygen.","zh":"水是“混合原子”的分子，因为它含有氢和氧。"},{"en":"The researchers studied mixed-atom clusters made from gold and silver.","zh":"研究人员研究了由金和银组成的混合原子团簇。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance or structure that contains more than one kind of atom (often used in technical writing).","zh":"（多用于科技写作）含有多种原子的物质或结构。"},"examples":[{"en":"This catalyst is a mixed-atom material designed to improve reaction speed.","zh":"这种催化剂是一种混合原子材料，用来提高反应速度。"}]}],"synonyms":["heteroatomic","heteronuclear","multi-element","mixed-element"],"phonetic":"/ˌmɪkst ˈætəm/","extraExplanation":["在化学英语里，更常见的说法是 heteroatomic（多种原子组成的）或 heteronuclear（不同核种/不同元素的，常见于核磁、光谱等语境）。mixed-atom 属于较直观、说明性较强的写法，常出现在材料科学、团簇化学或催化相关论文中。"],"etymology":"由 mixed（混合的）+ atom（原子）构成的合成词；在科技语境中用来强调“由不同元素的原子共同组成”。","mnemonic":["mixed = 混合；atom = 原子 → 直接记成“混合的原子（组合）”。","联想“mixed nuts（混合坚果）”：里面有多种“颗粒”，对应“多种原子/元素混在一起”。"]}
{"word":"mixed-breed","summary":{"en":"not purebred; having parents from different breeds","zh":"混种的；非纯种的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having parents of two or more different breeds; not purebred (often said of dogs or cats)","zh":"（多指狗、猫等）混种的；不是纯种的"},"examples":[{"en":"They adopted a mixed-breed dog from the shelter.","zh":"他们从收容所领养了一只混种狗。"},{"en":"Mixed-breed cats are often very healthy and adaptable.","zh":"混种猫通常很健康，也更能适应环境。"}]},{"partOfSpeech":"n.","definition":{"en":"an animal that comes from two or more different breeds","zh":"混种动物（由两种或以上不同品种繁殖而来）"},"examples":[{"en":"Our puppy is a mixed-breed, so we’re not sure how big he’ll get.","zh":"我们的小狗是混种，所以不太确定长大后会有多大。"},{"en":"The vet sees many mixed-breeds every day.","zh":"兽医每天都会看很多混种动物。"}]}],"synonyms":["mongrel","mutt","crossbreed","hybrid","mixed breed"],"phonetic":"/ˌmɪkst ˈbrid/","extraExplanation":["在英语里，谈到宠物时 mixed-breed 常被认为比 mutt 更中性、更礼貌。正式场合（如兽医记录、收容所）也常用 mixed-breed 或 mixed breed。","注意：用于描述人时要非常谨慎。对人说 mixed-breed 往往不礼貌、带冒犯意味；谈人时更常见且更尊重的说法是 mixed-race（混血的）或 multiracial（多种族的）。"],"etymology":"由 mixed（混合的）+ breed（品种/繁殖）组成；原本 breed 指“繁殖/品种”，与 mixed 组合后常用于描述“非纯种”的动物。","mnemonic":["mixed = 混合，breed = 品种/繁殖 → “混合品种”= 混种。","联想：一只狗看起来像“混搭”，就想到 mixed-breed。"]}
{"word":"mixed-breeds","summary":{"en":"from more than one breed; not purebred","zh":"由多个品种混合而来；非纯种"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animals (especially dogs or cats) that come from two or more different breeds; not purebred","zh":"（尤指狗或猫）由两种或多种不同品种混合繁育的动物；非纯种"},"examples":[{"en":"Many mixed-breeds are healthier than some purebred dogs.","zh":"很多混种狗可能比某些纯种狗更健康。"},{"en":"The shelter has a lot of mixed-breeds waiting to be adopted.","zh":"收容所有很多混种动物在等人领养。"}]},{"partOfSpeech":"adj.","definition":{"en":"having parents from different breeds; not purebred","zh":"（动物）混种的；非纯种的"},"examples":[{"en":"They adopted a mixed-breed puppy.","zh":"他们领养了一只混种小狗。"},{"en":"A mixed-breed cat can have many different coat patterns.","zh":"混种猫可能会有很多不同的毛色花纹。"}]}],"synonyms":["crossbreed","mixed breed","mutt","mongrel","hybrid"],"phonetic":"/ˌmɪkst ˈbrid/","extraExplanation":["常见用法多指宠物：mixed-breed dog/cat。也有人用 mongrel（杂种狗），但语气可能更不客气；日常更中性的说法是 mixed-breed 或 mixed dog。","用于描述人时不常见且可能冒犯；谈到族裔/血统更推荐用 mixed-race（混血的）或 multiracial（多族裔的），并注意当事人的偏好。"],"etymology":"由 mixed（混合的）+ breed（品种；繁育）构成。最常用在动物语境中，与 purebred（纯种）相对。","mnemonic":["mixed = 混合；breed = 品种/繁育 → “混合品种”的动物。","把 breed 联想成“breed（繁育）出不同品种”，mixed-breed 就是“混着繁育出来的”。"]}
{"word":"mixed-cell","summary":{"en":"containing more than one type of cell; sometimes, a combination of different battery cells","zh":"包含不止一种细胞类型；有时也指不同电芯的组合"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Made up of more than one kind of cell in the same sample, tissue, or growth.","zh":"（生物/医学）由多种不同类型的细胞混合组成（同一样本、组织或生长物中）。"},"examples":[{"en":"The biopsy showed a mixed-cell pattern, with several immune cell types present.","zh":"活检显示为混合细胞模式，存在多种免疫细胞类型。"},{"en":"Researchers separated the mixed-cell culture to study each cell type more clearly.","zh":"研究人员分离了混合细胞培养物，以更清楚地研究每一种细胞类型。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Engineering) Involving a system that uses more than one electrochemical cell type or a combination of cells.","zh":"（工程）涉及使用不止一种电化学电池类型，或由不同电池组合而成的系统。"},"examples":[{"en":"The device uses a mixed-cell battery pack to balance cost and performance.","zh":"该设备使用混合电芯电池包，以平衡成本与性能。"},{"en":"Mixed-cell designs can be harder to manage because the cells age differently.","zh":"混合电芯设计更难管理，因为不同电芯的老化速度不一样。"}]}],"synonyms":["heterogeneous","multicellular","mixed culture","hybrid","combination"],"phonetic":"/ˈmɪkst sɛl/","extraExplanation":["在医学文献中，mixed-cell 常用来描述“组织学/细胞学表现为多种细胞成分并存”，例如某些炎症或肿瘤的描述中会出现类似搭配。","在电池语境里，cell 常指“电芯”，mixed-cell 往往与 pack（电池包）、chemistry（化学体系）、configuration（配置）等词连用。"],"etymology":"由 mixed（“混合的”）+ cell（“细胞/电芯”）构成的复合词；常作为定语使用，用来强调“成分不单一”。","mnemonic":["mixed=混在一起；cell=细胞/电芯 → “混在一起的细胞/电芯”。","把它想成中文里的“混合细胞/混用电芯”，看到 mixed 就联想到“混搭”。"]}
{"word":"mixed-cropped","summary":{"en":"grown together with another crop in the same field","zh":"与其他作物在同一块地里一起种植的（混作/间作）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of farmland or a crop) grown together with another crop in the same field; intercropped.","zh":"（指农田或作物）与另一种作物在同一块地里一起种植的；混作的／间作的。"},"examples":[{"en":"The farmer planted mixed-cropped corn and beans to make better use of the land.","zh":"农民把玉米和豆类混作种植，以更好地利用土地。"},{"en":"Mixed-cropped fields can help reduce pests by increasing plant diversity.","zh":"混作田通过提高植物多样性，有助于减少虫害。"}]}],"synonyms":["intercropped","companion-planted","polyculture"],"phonetic":"/ˌmɪkst ˈkrɑpt/","extraExplanation":["mixed-cropped 常用于较正式或技术性的写法；日常更常见的表达是 intercropped 或 mixed cropping（名词短语，指“混作这种做法”）。"],"etymology":"由 mixed（混合的）+ cropped（种植的／作物的，来自 crop“作物；种植”）构成；常见于农业与环境科学语境，用来描述“混作/间作”的耕作方式。","mnemonic":["把它拆开记：mixed（混在一起）+ crop（作物/种植）→ “作物混在一起种”。","联想中文“混作/间作”：看到 mixed 就想到“混”，看到 cropped 就想到“作物/种植”。"]}
{"word":"mixed-ethnicity","summary":{"en":"having more than one ethnic background","zh":"具有多个族裔背景的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made up of, or involving, people from two or more different ethnic backgrounds.","zh":"由两个或以上不同族裔背景组成的；涉及不同族裔背景的。"},"examples":[{"en":"Their school has a growing mixed-ethnicity student population.","zh":"他们学校的混合族裔学生人数正在增加。"},{"en":"She comes from a mixed-ethnicity family and celebrates multiple traditions.","zh":"她来自一个混合族裔家庭，会庆祝多种传统。"}]}],"synonyms":["multiethnic","mixed-ethnic","multicultural","diverse"],"phonetic":"/ˌmɪkst ɛθˈnɪsəti/","extraExplanation":["用 mixed-ethnicity 强调“族裔背景的多样与组合”。在美国语境里，ethnicity 通常指文化/族裔认同（如 Latino, Han Chinese 等），不一定等同于 race（种族分类）。日常写作中也常见 mixed-ethnic 或 multiethnic；若指个人身份，也会见到 mixed-race（更偏“种族分类”）。选择哪个词取决于你想强调文化族裔还是种族分类。","表达身份时要尊重个体自我认同：有的人更愿意用具体族裔名称（如 “Chinese and Mexican American”），而不只用笼统的 mixed-ethnicity。"],"etymology":"由 mixed（混合的）+ ethnicity（族裔身份、族裔归属）构成的复合形容词；常用连字符 mixed-ethnicity 来修饰名词（如 family, couple, group）。","mnemonic":["mixed=混合；ethnicity=族裔身份。合起来就是“族裔混合”。","记联想：ethnic（族裔的）+ -ity（名词后缀）→ ethnicity（族裔身份/归属）；mixed-ethnicity 就是“混合的族裔背景”。"]}
{"word":"mixed-feeders","summary":{"en":"those that take food from more than one main source (often grass and browse), or babies fed with both breast milk and formula","zh":"从不止一种主要来源进食的个体（常指草与灌木叶等），或同时母乳与配方奶喂养的婴儿"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animals (especially herbivores) that regularly eat more than one main plant type, typically both grass (grazing) and leaves/shrubs (browsing).","zh":"（尤指草食动物）经常吃不止一种主要植物来源的动物，常见是既吃草（啃食）也吃树叶/灌木（取食）。"},"examples":[{"en":"Many deer are mixed-feeders, switching between grass and shrubs depending on the season.","zh":"很多鹿是混合取食者，会根据季节在吃草和吃灌木之间切换。"},{"en":"Researchers compared grazers, browsers, and mixed-feeders in the same habitat.","zh":"研究人员在同一栖息地比较了纯啃食者、纯取食者和混合取食者。"}]},{"partOfSpeech":"n.","definition":{"en":"babies who receive both breast milk and formula (or other milk) as part of their feeding routine.","zh":"（育儿语境）同时接受母乳与配方奶（或其他奶）喂养的婴儿。"},"examples":[{"en":"Some mixed-feeders take breast milk at night and formula during the day.","zh":"有些混合喂养的宝宝夜里吃母乳，白天喝配方奶。"},{"en":"The nurse explained how to track intake for mixed-feeders.","zh":"护士说明了如何记录混合喂养宝宝的摄入量。"}]}],"synonyms":["omnivores","generalist feeders","mixed grazers","combination feeders","mixed feeding"],"phonetic":"ˈmɪkst ˌfiːdərz","extraExplanation":["生态学里 mixed-feeders 常用来细分草食动物的取食策略：grazers 主要吃草；browsers 主要吃树叶、嫩枝；mixed-feeders 两者都吃，比例会随季节与资源变化。"],"etymology":"由 mixed（混合的）+ feeder（取食者/喂养对象）构成的复合词；在生态学中指“混合取食”，在育儿语境中引申为“混合喂养”。","mnemonic":["把 mixed 记成“混着吃”，feeder 记成“吃的人/被喂的人”，合起来就是“混合取食者/混合喂养对象”。","联想中文“混合喂养/混合取食”，几乎是直译。"]}
{"word":"mixed-flowering","summary":{"en":"Having different flower types or an overlapping, extended blooming pattern.","zh":"花的类型混合或花期重叠延长的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having different types of flowers on the same plant or in the same cluster (for example, male and female flowers, or fertile and sterile flowers).","zh":"（植物）混合花的；同一株植物或同一花序上有不同类型的花（如雄花与雌花，或可育花与不育花）。"},"examples":[{"en":"Some mixed-flowering plants produce both male and female flowers on the same branch.","zh":"一些混合花的植物在同一枝条上同时产生雄花和雌花。"},{"en":"The species is described as mixed-flowering in the field guide.","zh":"这本野外图鉴把该物种描述为混合花的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a flowering period that combines early and late blooms, so flowers appear over a long, overlapping season.","zh":"混合花期的；把早花与晚花叠加在一起、开花时间拉得更长的。"},"examples":[{"en":"Gardeners like mixed-flowering varieties because the bed stays colorful longer.","zh":"园丁喜欢混合花期的品种，因为花坛能更久保持色彩。"},{"en":"This shrub is mixed-flowering, with blossoms appearing in several waves.","zh":"这种灌木属于混合花期，会分几波开花。"}]}],"synonyms":["heterogamous","mixed-blooming","multi-flowering"],"phonetic":"/ˌmɪkst ˈflaʊərɪŋ/","extraExplanation":["这是一个相对专业的描述性词语，常见于植物学论文、物种鉴定说明、园艺品种介绍等语境。不同作者对它的使用可能偏向两种意思之一：①“花的类型混合”（如雄/雌或可育/不育）；②“花期混合、延长”。阅读时可结合上下文（是否在谈花的性别/结构，还是在谈开花时间）判断。"],"etymology":"由 mixed（“混合的”）+ flowering（“开花的/花期的”）构成的复合形容词。多见于园艺与植物学描述，用来强调“花的类型或花期呈混合状态”。","mnemonic":["mixed = 混合；flowering = 开花。合在一起就记成“混合着开花/混合花（类型或花期）”。","把它联想成“同一株上花不止一种/不止一波开”，就能对应两种常见用法。"]}
{"word":"mixed-font","summary":{"en":"using more than one typeface in one design or text","zh":"在同一设计或文本中使用多种字体"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using more than one typeface (font) in the same piece of text, design, or document.","zh":"在同一段文字、设计或文档中混用多种字体（字形）。"},"examples":[{"en":"The poster looks busy because it uses a mixed-font style.","zh":"这张海报看起来很杂乱，因为它采用了混合字体风格。"},{"en":"Try to avoid mixed-font headings unless you have a clear design reason.","zh":"除非有明确的设计目的，否则尽量避免标题混用多种字体。"},{"en":"The brand guide allows mixed-font logos only in special campaigns.","zh":"品牌规范只允许在特别活动中使用混合字体的标志。"}]}],"synonyms":["multiple fonts","mixed fonts","multifont","varied typography"],"phonetic":"/ˌmɪkst ˈfɑnt/","extraExplanation":["在设计中，混用字体并不一定“错误”，但需要控制：通常建议同一作品里使用 2 种左右字体（例如一款用于标题，一款用于正文），并通过字重、字号、行距建立层级；如果混得太多，读者会觉得不专业或难读。","在英文里也常见写法：mixed fonts（名词短语）、mixed-font design/style（形容词用法）、multiple fonts（更直白）。"],"etymology":"由 mixed（混合的）+ font（字体）组合而成的现代合成词/描述性写法；常见于排版、平面设计与UI设计语境中。","mnemonic":["把 mixed 理解为“混搭”，font 就是“字体”：mixed-font = 字体混搭。","联想中文排版常说的“不要乱用字体”：一乱用就成 mixed-font。"]}
{"word":"mixed-gender","summary":{"en":"including people of different genders","zh":"包含不同性别成员的；男女混合的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Including or made up of both males and females (or people of different genders).","zh":"男女都有的；包含不同性别成员的。"},"examples":[{"en":"The club is mixed-gender, so everyone is welcome to join.","zh":"这个社团是男女都有的，所以欢迎所有人加入。"},{"en":"They formed a mixed-gender team for the project.","zh":"他们为这个项目组建了一支男女混合的团队。"}]}],"synonyms":["coed","mixed-sex","gender-mixed","coeducational"],"phonetic":"/ˌmɪkst ˈdʒɛn.dɚ/","extraExplanation":["在当代英语里，gender 有时更强调“性别认同/社会性别”，不只等同于 biological sex（生理性别）。在正式或包容性语境中，mixed-gender 可用于指包含多种性别的人群；也常见表达 mixed-sex（更偏生理性别、略显旧）或 coed（口语、带校园色彩）。"],"etymology":"由 mixed（“混合的”）+ gender（“性别”）组成的复合形容词。常用连字符 mixed-gender 来修饰名词，表示成员构成包含不同性别。","mnemonic":["把它拆开记：mixed=“混在一起”，gender=“性别” → “不同性别混在一起”。","联想“混合双打/混双”=男+女一起比赛，对应 mixed-gender team。"]}
{"word":"mixed-genre","summary":{"en":"blending multiple genres in one work","zh":"将多种体裁/类型融合在同一作品中"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Combining elements from more than one genre (for example, mixing fiction with memoir, poetry with essay, or mystery with romance).","zh":"混合多种体裁的；把两种或多种“类型/文类”元素结合在一起的（如小说+回忆录、诗歌+随笔、悬疑+爱情等）。"},"examples":[{"en":"The book is a mixed-genre work that blends memoir, history, and travel writing.","zh":"这本书是混合体裁作品，把回忆录、历史和游记写作融合在一起。"},{"en":"Many modern films are mixed-genre, combining comedy and action.","zh":"很多现代电影是混合类型的，把喜剧和动作结合在一起。"}]}],"synonyms":["genre-blending","cross-genre","hybrid","multigenre"],"phonetic":"/ˌmɪkst ˈʒɑːnrə/","extraExplanation":["genre 在文学中常指“文类/体裁”（如诗、戏剧、散文、小说）；在电影/音乐中常指“类型”（如动作片、恐怖片、爵士乐）。mixed-genre 就是跨越或融合这些分类。","常见近义表达：genre-blending（类型融合的）、cross-genre（跨类型的）。写作时有时也会写作 mixed genre（不加连字符），但作定语时加连字符更常见：a mixed-genre novel。"],"etymology":"由 mixed（“混合的”）+ genre（“体裁/类型”，源自法语 genre）构成的复合形容词；常用连字符表示“混合体裁/类型”的概念。","mnemonic":["把它拆开记：mixed=混合；genre≈“类型/体裁”（可联想“真-热”音近：不同类型混在一起会“热闹”）。"]}
{"word":"mixed-grade","summary":{"en":"including more than one level or grade","zh":"包含多个年级或等级的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing people, classes, or items of more than one grade or level (often used in schools for students of different ages/years learning together).","zh":"由多个年级/水平组成的（常指学校里不同年级或年龄的学生在同一班学习）。"},"examples":[{"en":"The rural school has a mixed-grade classroom with first and second graders.","zh":"这所乡村学校有一个混合年级的班级，一年级和二年级一起上课。"},{"en":"Teachers in mixed-grade settings often plan lessons with different difficulty levels.","zh":"在混合年级的教学环境里，老师常常需要准备不同难度层次的课程。"},{"en":"The program offers mixed-grade activities so older students can help younger ones.","zh":"这个项目提供混合年级活动，让高年级学生可以帮助低年级学生。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made from or including different grades of quality (especially in materials or goods).","zh":"由不同等级/品质混合而成的（尤指材料或商品）。"},"examples":[{"en":"The factory uses mixed-grade plastic to reduce costs.","zh":"工厂使用混合等级的塑料来降低成本。"},{"en":"Mixed-grade rice can have grains of different sizes and quality.","zh":"混合等级的大米可能包含不同大小和品质的米粒。"}]}],"synonyms":["multigrade","mixed-age","multi-level","heterogeneous"],"phonetic":"/ˌmɪkst ˈɡreɪd/","extraExplanation":["教育领域里也常见近义表达 multi-grade（多年级）或 mixed-age（混龄）。在一些国家/地区，小规模学校会用 mixed-grade class 来解决学生人数不足的问题。"],"etymology":"由 mixed（混合的）+ grade（等级/年级）组合而成的复合形容词；在教育语境中常指“混龄/混年级编班”。","mnemonic":["把它拆开记：mixed=混在一起；grade=年级/等级 → “混在一起的年级/等级”。","联想“Mix（混）+ Grade（年级）= 混合年级班”。"]}
{"word":"mixed-grain","summary":{"en":"containing several kinds of grains","zh":"含多种谷物的；杂粮的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made from or containing several different kinds of grains (such as rice, wheat, oats, barley, millet, etc.)","zh":"由多种谷物（如米、小麦、燕麦、大麦、小米等）混合制成的；含多种谷物的"},"examples":[{"en":"I usually buy mixed-grain bread for breakfast.","zh":"我早餐通常买杂粮面包。"},{"en":"This mixed-grain porridge is filling and easy to digest.","zh":"这碗杂粮粥很顶饱，而且容易消化。"},{"en":"Try mixed-grain rice instead of white rice.","zh":"可以试试杂粮饭，代替白米饭。"}]},{"partOfSpeech":"n.","definition":{"en":"a mixture of different grains, especially sold or used for cooking","zh":"（用于烹饪或售卖的）杂粮混合物；混合谷物"},"examples":[{"en":"The recipe calls for mixed-grain and water.","zh":"这个食谱需要杂粮和水。"},{"en":"I keep a bag of mixed-grain in the pantry.","zh":"我在食品储藏柜里常备一袋杂粮。"}]}],"synonyms":["multigrain","multi-grain","mixed grains","grain blend"],"phonetic":"/ˌmɪkst ˈɡreɪn/","extraExplanation":["用法提示：在美式英语里，mixed-grain 常作定语形容词，放在名词前（mixed-grain bread / mixed-grain cereal）。如果当名词用，语境通常是“杂粮（混合物）”，有时也会写作 mixed grains（不加连字符，作复数）。","相关概念：multi-grain（多谷物）在包装上也很常见，含义接近；whole-grain（全谷物）强调“未精制、保留麸皮和胚芽”，不一定是“混合多种”。"],"etymology":"由 mixed（混合的）+ grain（谷物）构成的复合词；在食品包装与菜单中常用作修饰语（如 mixed-grain bread / rice / cereal）。","mnemonic":["mixed = 混合；grain = 谷物 → 直接联想“杂粮”。","把它想成菜单里的固定搭配：mixed-grain + bread/rice/porridge（杂粮面包/杂粮饭/杂粮粥）。"]}
{"word":"mixed-handed","summary":{"en":"using both hands, or having mixed hand preference across activities","zh":"左右手都能用，或在不同活动中用手偏好不一致"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to use both hands well; not strongly right-handed or left-handed.","zh":"双手都用得比较好；不明显偏右手或左手。"},"examples":[{"en":"She’s mixed-handed, so she can write with either hand when she needs to.","zh":"她是混合惯用手，所以需要时左右手都能写字。"},{"en":"Being mixed-handed helped him in sports that require quick changes of grip.","zh":"混合惯用手让他在需要快速换握法的运动中更占优势。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a mix of hand preference across tasks (for example, writing with the right hand but throwing with the left).","zh":"在不同任务上手的偏好不一致（例如右手写字、左手投掷）。"},"examples":[{"en":"He is mixed-handed: right-handed for writing, but left-handed for throwing.","zh":"他是混合惯用手：写字用右手，但投掷用左手。"},{"en":"Some children appear mixed-handed while they are still developing coordination.","zh":"有些孩子在协调能力发展阶段会表现出混合惯用手的情况。"}]}],"synonyms":["ambidextrous","both-handed","two-handed","switch-handed"],"phonetic":"ˌmɪkstˈhændɪd","extraExplanation":["学习提示：日常英语里更常说 ambidextrous（双手灵巧的）。mixed-handed 更像描述“任务不同、用手不同”的情况。","在运动语境里，人们有时会用更具体的说法，例如 switch-hitter（棒球左右开弓的打者）或 switch-handed（可左右手切换）。"],"etymology":"由 mixed（混合的）+ handed（与用手习惯有关的）构成的复合形容词；字面义为“手的使用习惯是混合的”。在现代英语中较少见，常见替代表达是 ambidextrous 或 mixed-handedness（名词）。","mnemonic":["把它拆开记：mixed=混合，handed=用手习惯 → “用手习惯是混合的”。","联想“左右都行”：遇到需要换手的事也能应付。"]}
{"word":"mixed-heritage","summary":{"en":"having or relating to more than one ancestral cultural background","zh":"具有不止一种祖先文化背景的；混合血统的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having parents or ancestors from different ethnic, racial, or cultural backgrounds","zh":"（父母或祖先）来自不同族裔、种族或文化背景的；混合血统的"},"examples":[{"en":"She is proud of her mixed-heritage identity.","zh":"她为自己的混合血统身份感到自豪。"},{"en":"The school created a club for mixed-heritage students to share experiences.","zh":"学校成立了一个社团，让混合血统的学生交流经历。"},{"en":"His mixed-heritage family celebrates holidays from more than one tradition.","zh":"他的混合血统家庭会庆祝不止一种传统的节日。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who has parents or ancestors from different ethnic, racial, or cultural backgrounds","zh":"混合血统的人；来自不同族裔/种族/文化背景的人"},"examples":[{"en":"As a mixed-heritage, he sometimes felt he didn’t fully belong in either community.","zh":"作为混合血统的人，他有时觉得自己在两个社群里都不算完全“属于”。"},{"en":"The documentary interviews mixed-heritage people about family history.","zh":"这部纪录片采访混合血统的人，了解他们的家族史。"}]}],"synonyms":["multiracial","biracial","multiethnic","mixed-race","of mixed descent"],"phonetic":"/ˌmɪkst ˈhɛrɪtɪdʒ/","extraExplanation":["语境上，mixed-heritage 常被认为比“mixed-race”更强调文化/家庭传承（heritage），不只聚焦“种族”这一点；在写作或沟通中更温和、更包容。","有些人更偏好具体说法（例如 “Chinese and Mexican heritage”），以尊重个体自我认同；若不确定，可先询问对方更喜欢的表达。"],"etymology":"由 mixed（混合的）+ heritage（传承、传统、血统/家族背景）组成；现代英语中常用作更中性、更强调文化与家庭背景的表达。","mnemonic":["记忆：heritage ≈ “herit（继承）+ age（时代）”→ 代代相传的东西；mixed-heritage 就是“混合的传承/背景”。","联想中文：把它当作“混合 + 传承（家族文化）”，强调不止一种文化根。"]}
{"word":"mixed-language","summary":{"en":"using more than one language together","zh":"混用多种语言的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"using two or more languages together in the same text, speech, or setting","zh":"（文本、口语或场景中）混用两种或以上语言的；多语混杂的"},"examples":[{"en":"Her posts are mixed-language: English for work updates and Chinese for family news.","zh":"她的帖子是混合语言的：工作动态用英文，家庭消息用中文。"},{"en":"The meeting became mixed-language when the overseas team joined the call.","zh":"海外团队加入电话会议后，会议变成了混合语言的。"}]}],"synonyms":["bilingual","multilingual","code-switched","macaronic"],"phonetic":"/ˌmɪkst ˈlæŋɡwɪdʒ/","extraExplanation":["在语言学里，这类现象常与 code-switching（语码转换）相关：人们在一句话、一个段落或不同场合之间切换语言，原因可能是表达更准确、身份认同、礼貌策略或词汇习惯等。"],"etymology":"由 mixed（“混合的”）+ language（“语言”）构成的复合形容词；常见于语言学习、教育与社交媒体语境中，用来描述“混用语言”的表达方式或材料。","mnemonic":["把它拆开记：mixed = 混在一起；language = 语言 → “语言混在一起”。","联想常见场景：中英夹杂的聊天/字幕/笔记，就是 mixed-language。"]}
{"word":"mixed-leaved","summary":{"en":"having different kinds or shapes of leaves","zh":"叶型/叶种混合的、叶子多样的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having more than one kind of leaf on the same plant, or made up of plants with different kinds of leaves (used especially in gardening and botany).","zh":"（尤用于园艺/植物学）“混叶的；多种叶形的”：同一植株上有不止一种叶子/叶形，或由不同叶型植物混合构成。"},"examples":[{"en":"The shrub is mixed-leaved, with both narrow and broad leaves on the same branches.","zh":"这株灌木是混叶的：同一枝条上既有细长叶也有宽叶。"},{"en":"They planted a mixed-leaved hedge to create a more textured look.","zh":"他们种了一道混叶树篱，让整体质感更丰富。"}]}],"synonyms":["varied-leaved","diverse-leaved","heterophyllous"],"phonetic":"/ˌmɪkst ˈliːvd/","extraExplanation":["leaved 在这里不是动词 leave（离开）的过去式，而是形容词后缀式用法，表示“具有某种叶子/叶形的”。园艺与植物学写作中常见类似结构：broad-leaved（阔叶的）、needle-leaved（针叶的）。"],"etymology":"由 mixed（混合的）+ leaved（有……叶的，常见于复合形容词，如 broad-leaved“阔叶的”）构成；字面义即“混合叶子的”。","mnemonic":["把它拆开记：mixed（混合）+ leaved（有叶的）→ “叶子混在一起/叶形多样”。","联想“mixed salad（什锦沙拉）”：沙拉里叶菜种类多 → mixed-leaved（叶子种类/叶形多）。"]}
{"word":"mixed-line","summary":{"en":"hybrid; combining different types within one line or route","zh":"混合型的；在同一条线路/流程中结合不同类型"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made up of different kinds mixed together; hybrid (often used before a noun like “line,” meaning a route/series/queue/production line that combines different types).","zh":"由不同类型混合组成的；混合型的（常作定语修饰“线路/队列/生产线”等，表示把不同类别合在一起）。"},"examples":[{"en":"The factory runs a mixed-line system, producing several models on the same line.","zh":"这家工厂采用混合型生产线，在同一条线上生产多个型号。"},{"en":"We’re testing a mixed-line schedule that combines local and express services.","zh":"我们正在测试一种混合型时刻表，把普通车和快车服务结合起来。"},{"en":"The report separates pure freight routes from mixed-line routes.","zh":"报告把纯货运线路与混合型线路区分开来。"}]},{"partOfSpeech":"n.","definition":{"en":"A route, service, or production line that combines different kinds (for example, passenger and freight, or multiple product types).","zh":"混合线路/混合线路服务；混合生产线（把不同类型合并在同一条线路或同一套流程中）。"},"examples":[{"en":"This railway was built as a mixed-line to carry both passengers and goods.","zh":"这条铁路最初建成时就是混合线路，可同时运送旅客和货物。"},{"en":"They upgraded the mixed-line to reduce delays between different trains.","zh":"他们升级了混合线路，以减少不同列车之间的延误。"}]}],"synonyms":["hybrid","blended","combined","integrated","multitype"],"phonetic":"/ˌmɪkst ˈlaɪn/","extraExplanation":["连字符 mixed-line 常见于技术/行业写作（交通运输、制造业、排产、运营管理等），用来把它当作一个固定修饰语；在更口语或一般写作中也可能写作 mixed line。"],"etymology":"由 mixed（混合的）+ line（线；线路；生产线）构成的复合词。作为定语时常用连字符 mixed-line，强调“作为一个整体概念的混合型线路/生产线”。","mnemonic":["把它拆开记：mixed=混合，line=线/线路/生产线 → “混合的线”。","联想“同一条线/一路上装了不一样的东西”，比如同一生产线做多款产品。"]}
{"word":"mixed-marble","summary":{"en":"made of different marbles or showing a marbled, mixed-color look","zh":"由不同大理石混合/拼接而成或呈混色大理石纹的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made from, containing, or decorated with more than one type or color of marble; having a marbled (swirled/veined) look.","zh":"由多种大理石（或不同颜色/纹理的大理石）混合制成或装饰的；呈大理石纹（旋涡状/纹理交错）效果的。"},"examples":[{"en":"The lobby floor is mixed-marble, with white and green stone side by side.","zh":"大堂地面是混色大理石的，白色和绿色的石材并排铺设。"},{"en":"She chose a mixed-marble countertop to match the warm tones of the kitchen.","zh":"她选了混色大理石台面来搭配厨房的暖色调。"},{"en":"The vase has a mixed-marble pattern that looks like natural stone veins.","zh":"这个花瓶有混合大理石纹，看起来像天然石材的纹理。"}]}],"synonyms":["marbled","variegated","multicolored","veined","mottled"],"phonetic":"/ˌmɪkst ˈmɑr.bəl/","extraExplanation":["在材料与设计领域，描述石材时常见类似结构：color-marble（某色大理石）、veined-marble（有纹理的大理石）、mixed-marble（混色/混拼大理石）。有时也可泛指“仿大理石纹”的装饰效果，但更常用于真实石材或石材拼接。"],"etymology":"由“mixed（混合的）+ marble（大理石）”构成的复合形容词，多用于建筑与室内设计语境；含义直观：强调材质/颜色/纹理的“混搭”或“杂色大理石纹”效果。","mnemonic":["把它拆开记：mixed=混合的，marble=大理石；合起来就是“混合的大理石/混色大理石”。","联想装修场景：不同颜色的大理石拼在一起（mixed），铺出来的效果就叫 mixed-marble。"]}
{"word":"mixed-marriage","summary":{"en":"Marriage between partners from different backgrounds.","zh":"不同背景伴侣之间的婚姻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A marriage between two people from different racial, ethnic, cultural, national, or religious backgrounds (wording can feel outdated; “intermarriage” or “intercultural marriage” is often preferred).","zh":"不同种族、族裔、文化、国籍或宗教背景的两个人之间的婚姻（此说法有时显得过时；更常用 intermarriage / intercultural marriage）。"},"examples":[{"en":"They are in a mixed marriage—she’s Chinese and he’s Irish American.","zh":"他们是跨文化婚姻——她是中国人，他是爱尔兰裔美国人。"},{"en":"In some families, a mixed marriage can bring both curiosity and tension at first.","zh":"在一些家庭里，跨背景婚姻起初可能既带来好奇，也带来紧张。"}]}],"synonyms":["intermarriage","intercultural marriage","interfaith marriage","interracial marriage","cross-cultural marriage"],"phonetic":"/ˌmɪkst ˈmærɪdʒ/","extraExplanation":["语体与礼貌：mixed marriage 过去较常见，但“mixed”有时会让人联想到“掺杂/不纯”等不必要的价值判断，因此在当代英语里，很多人更偏好更中性的说法：intercultural marriage（跨文化婚姻）、interfaith marriage（跨宗教婚姻）、interracial marriage（跨种族婚姻）。","使用时建议具体化：如果你指的是宗教差异，用 interfaith marriage；指国籍/文化差异，用 intercultural marriage；指种族差异，用 interracial marriage。"],"etymology":"由 mixed（混合的）+ marriage（婚姻）构成，用来强调双方背景不同。如今在更正式或更尊重的语境里，常改用 intermarriage / intercultural marriage / interracial marriage（更具体）。","mnemonic":["mixed = 混合；marriage = 婚姻 → “混合背景的婚姻”，联想到中文“跨国/跨文化/跨宗教婚姻”。"]}
{"word":"mixed-mating","summary":{"en":"mating across different groups, often producing hybrids","zh":"不同群体间的交配，常产生杂交后代"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mating between individuals from different groups (such as different populations, breeds, or sometimes species), often leading to hybrids or mixed ancestry.","zh":"不同群体（如不同族群、种群、品系，甚至有时不同物种）之间的交配，常导致杂交后代或混合血统。"},"examples":[{"en":"In the study, mixed-mating increased genetic diversity in the offspring.","zh":"在这项研究中，混合交配提高了后代的遗传多样性。"},{"en":"The biologists tracked mixed-mating between wild and domesticated animals near the village.","zh":"生物学家追踪了村庄附近野生动物与家养动物之间的混合交配。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving mating across different groups (mixed ancestry or hybrid pairing).","zh":"与不同群体之间交配有关的；涉及杂交或混合配对的。"},"examples":[{"en":"The report discusses mixed-mating patterns in urban bird populations.","zh":"报告讨论了城市鸟类种群中的混合交配模式。"},{"en":"They found mixed-mating behavior was more common after habitat changes.","zh":"他们发现栖息地改变后，混合交配行为更常见。"}]}],"synonyms":["interbreeding","hybridization","crossbreeding","outcrossing","mixed pairing"],"phonetic":"ˌmɪkst ˈmeɪtɪŋ","extraExplanation":["在生态与进化语境里，mixed-mating 常用于讨论“基因流动（gene flow）”“杂交（hybridization）”以及它们对物种形成、适应性和遗传多样性的影响。","有些领域也会用到“混合交配系统（mixed mating system）”，指同一物种既会自交（selfing）也会异交（outcrossing）的繁殖方式；是否是这个意思需要看上下文。"],"etymology":"由 mixed（混合的）+ mating（交配）构成的合成词；学术写作中常用连字符表示作为一个整体概念。","mnemonic":["把它拆开记：mixed=混在一起；mating=配对/交配 → “混着配”。","联想“混血/杂交”：mixed（混）+ mate（配偶/配对）→ 混合配对产生混合血统。"]}
{"word":"mixed-media","summary":{"en":"Combining different materials or artistic media in one artwork.","zh":"在同一件作品中结合多种媒材/媒介。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using more than one kind of material or artistic medium in a single artwork (for example, paint plus collage or photography).","zh":"（艺术）混合媒材的；在同一件作品中同时使用多种材料或媒介（如绘画加拼贴、摄影等）。"},"examples":[{"en":"She creates mixed-media portraits with acrylic paint, fabric, and old photographs.","zh":"她用丙烯颜料、布料和旧照片创作混合媒材肖像。"},{"en":"The gallery is featuring a mixed-media installation made of sound, video, and recycled plastic.","zh":"画廊正在展出一个由声音、影像和回收塑料构成的混合媒材装置作品。"}]},{"partOfSpeech":"n.","definition":{"en":"An artwork or artistic style that combines different materials or media.","zh":"混合媒材作品；以混合媒材为特征的作品或风格。"},"examples":[{"en":"Her latest mixed-media was inspired by city life and street posters.","zh":"她最新的混合媒材作品灵感来自城市生活和街头海报。"},{"en":"For the assignment, students must submit one mixed-media using at least two materials.","zh":"这次作业要求学生提交一件至少使用两种材料的混合媒材作品。"}]}],"synonyms":["multimedia","intermedia","collage","assemblage","multidisciplinary art"],"phonetic":"/ˌmɪkst ˈmiːdiə/","extraExplanation":["在当代艺术里，mixed-media 常与 collage（拼贴）、assemblage（综合材料拼装）、installation（装置艺术）相关，但 mixed-media 更强调“多种媒介并用”，范围更广。","写法上常见 mixed-media（带连字符）作形容词：a mixed-media piece/project；作名词时也常写 mixed media 或 mixed-media。"],"etymology":"由“mixed（混合的）+ media（媒介/材料；media 是 medium 的复数）”构成。艺术语境里指把不同“媒介/材料”（如颜料、纸张、照片、金属、声音、影像等）组合到同一件作品中；常写作 mixed-media，并可作定语。","mnemonic":["把它拆开记：mixed=混合；media=媒介/材料 → “混合媒材”。","联想常见组合：paint + paper + photo（画 + 纸 + 照片）= mixed-media。"]}
{"word":"mixed-meter","summary":{"en":"using more than one metrical pattern in a single poem or song","zh":"在同一首诗/歌中混用多种格律"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In poetry or song) using more than one metrical pattern in the same work, such as alternating line lengths or stress patterns.","zh":"（诗歌/歌词）在同一作品中混用不止一种格律（节奏与音步模式），例如交替使用不同长短或重音结构的诗行。"},"examples":[{"en":"The poem is written in mixed-meter, shifting between short, punchy lines and longer, flowing ones.","zh":"这首诗采用混合格律，在短促有力的诗行与较长、流动感更强的诗行之间切换。"},{"en":"Many folk songs use mixed-meter to match the natural rhythm of speech.","zh":"许多民歌用混合格律来贴合自然口语的节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"A poem, hymn, or song text that uses mixed meter.","zh":"（作品）采用混合格律的诗、圣歌或歌曲文本。"},"examples":[{"en":"The editor grouped the mixed-meters in a separate section of the anthology.","zh":"编辑把混合格律作品单独归到选集的一个部分。"},{"en":"This hymn is a mixed-meter, so it can be sung to more than one tune.","zh":"这首圣歌属于混合格律，因此可以配不止一种曲调来唱。"}]}],"synonyms":["polymetric","irregular meter","variable meter"],"phonetic":"/ˌmɪkst ˈmiːtɚ/","extraExplanation":["meter 在诗歌里指“重读与非重读的规律排列”（格律/音步），不等同于日常说的“米/计量表”。","在英文圣歌（hymnody）里，Mixed Meter 常被简写为 MM，用来提示歌词不严格遵循常见的 CM（Common Meter）或 LM（Long Meter）等固定格式。"],"etymology":"由 mixed（混合的）+ meter（格律/韵律；英式拼写 metre）构成；在诗歌与圣歌传统中用来标记“同一作品中不固定一种格律”的写法。","mnemonic":["把它拆开记：mixed = 混在一起；meter = 格律/节拍 → “格律混在一起”就是混合格律。","联想中文：一首诗里“长短句穿插”，就很像 mixed-meter。"]}
{"word":"mixed-metered","summary":{"en":"using more than one poetic rhythm pattern","zh":"采用多种诗歌格律/节奏模式"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having more than one poetic meter (rhythmic pattern) within a poem, stanza, or line; using varied metrical patterns rather than a single regular one.","zh":"（诗歌）在同一首诗/同一节/同一行中混用两种或以上格律（节奏模式）；不固定在单一规则格律。"},"examples":[{"en":"The poem is mixed-metered, shifting from iambic lines to a faster, songlike rhythm.","zh":"这首诗是混合格律的，从抑扬格的行句转到更快、更像歌曲的节奏。"},{"en":"Her mixed-metered verse mirrors the speaker’s changing emotions.","zh":"她的混合格律诗句呼应了说话者不断变化的情绪。"}]}],"synonyms":["polymetric","heterometric","mixed-meter","varied-meter"],"phonetic":"/ˌmɪkst ˈmiːtərd/","extraExplanation":["常见于文学批评、诗歌分析与课程讨论中，用来描述一首诗不遵循单一格律（如全篇都为抑扬格五音步），而是刻意在不同段落或行句间变换节奏，以制造情绪起伏、口语感或音乐感。","相关术语：meter（格律）、iambic（抑扬格）、trochaic（扬抑格）、anapestic（抑抑扬格）、free verse（自由诗，通常不以固定格律为主，但也可能出现局部格律）。"],"etymology":"由 mixed（混合的）+ metered（有格律的/有节拍的）构成；meter 指诗歌的“格律/韵律节奏”，-ed 表示“具有……特征”。","mnemonic":["把它拆开记：mixed（混合）+ metered（有“节拍/格律”的）。= “格律是混着来的”。","联想中文：朗读时节奏忽快忽慢、忽长忽短——“混合节拍/混合格律”。"]}
{"word":"mixed-microbial","summary":{"en":"involving more than one microorganism type together","zh":"涉及多种微生物共同存在或共同作用的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or involving more than one type of microorganism (such as different bacteria, fungi, or viruses) in the same sample, community, or process.","zh":"含有或涉及多种微生物（如不同细菌、真菌或病毒）在同一样本、群落或过程中共同存在。"},"examples":[{"en":"The researchers tested the antibiotic in a mixed-microbial culture rather than a single-species culture.","zh":"研究人员在混合微生物培养物中测试该抗生素，而不是在单一物种培养物中。"},{"en":"Mixed-microbial communities in the gut can affect digestion and immunity.","zh":"肠道中的混合微生物群落会影响消化和免疫。"},{"en":"A mixed-microbial biofilm is often harder to remove than a biofilm formed by one species.","zh":"混合微生物生物膜通常比单一物种形成的生物膜更难清除。"}]}],"synonyms":["polymicrobial","multi-microbial","mixed flora","mixed community"],"phonetic":"/ˌmɪkst maɪˈkroʊbiəl/","extraExplanation":["在生命科学/医学论文里，mixed-microbial 常用来对比 single-species（单一物种）或 mono-microbial（单一微生物）条件，用于描述“多种微生物共同作用”的环境，如 mixed-microbial infection（混合微生物感染）、mixed-microbial flora（混合微生物菌群）、mixed-microbial culture（混合微生物培养）。","写作上也常见不加连字符的 mixed microbial（尤其当作表语或较口语的表达）。是否加连字符多取决于期刊风格与是否放在名词前作定语。"],"etymology":"由 mixed（“混合的”）+ microbial（“微生物的”）构成的复合形容词；常用连字符强调两部分共同修饰名词，在科研写作中尤常见。","mnemonic":["记忆法：mixed=“混合”，microbial=“微生物的”，合起来就是“混合的微生物（环境/群落）”。","把它联想到“杂菌/混菌”这一中文说法：不是单一菌，而是多种微生物混在一起。"]}
{"word":"mixed-origin","summary":{"en":"having more than one source or background","zh":"具有多重来源或背景的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Coming from two or more different origins (such as ethnic, cultural, national, or linguistic backgrounds).","zh":"来自两种或多种不同“出身/来源”（如族裔、文化、国家或语言背景）的。"},"examples":[{"en":"She is of mixed-origin heritage, with one parent from Mexico and the other from Korea.","zh":"她的血统是混合来源的：一位家长来自墨西哥，另一位来自韩国。"},{"en":"The neighborhood has a mixed-origin population and many languages are spoken there.","zh":"这个社区的人口来源多元，那里通行很多种语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made by combining elements from different sources or traditions.","zh":"由不同来源或传统的元素混合而成的。"},"examples":[{"en":"The museum displayed mixed-origin artifacts collected from several regions.","zh":"博物馆展出了从多个地区收集来的混合来源文物。"},{"en":"His cooking style is mixed-origin, blending Italian techniques with local spices.","zh":"他的烹饪风格是混合来源的，把意大利技法和本地香料融合在一起。"}]}],"synonyms":["multiracial","multiethnic","mixed-heritage","of mixed background","multisource","hybrid"],"phonetic":"/ˌmɪkst ˈɔrɪdʒɪn/","extraExplanation":["用来描述“人”的时候，语气通常偏中性、客观（如 mixed-origin family / background）。但谈到身份时，不同人对称呼偏好不同；在正式写作或自我介绍中，按当事人习惯使用（例如 mixed heritage、multiracial、of mixed background 等）。"],"etymology":"由 mixed（“混合的”）+ origin（“起源、来源”）构成的复合形容词；常用连字符 mixed-origin 来强调“来源不止一个”。","mnemonic":["把它拆开记：mixed=混合，origin=起源 → “混合起源/来源”。","联想中文“混血/多元背景/多来源”，看到连字符就想到“两个概念合成一个形容词”。"]}
{"word":"mixed-race","summary":{"en":"having ancestry from more than one racial or ethnic group","zh":"具有不止一种种族或族裔背景的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having parents or ancestry from more than one racial or ethnic group.","zh":"（人）具有不止一种种族或族裔背景的；混血的。"},"examples":[{"en":"She is mixed-race, with a Korean mother and a Mexican father.","zh":"她是混血，妈妈是韩国人，爸爸是墨西哥人。"},{"en":"The book follows a mixed-race teenager learning to navigate identity and belonging.","zh":"这本书讲述一位混血青少年如何理解自我身份与归属感。"},{"en":"Many mixed-race people feel pressure to “choose” one side, but identity can be complex.","zh":"很多混血者会感到被迫“选边站”，但身份认同往往很复杂。"}]}],"synonyms":["biracial","multiracial","multiethnic","mixed heritage","of mixed ancestry"],"phonetic":"/ˌmɪkst ˈreɪs/","extraExplanation":["在英语里，race 常与社会历史相关（不仅是生物概念），所以 mixed-race 既指“血统/家族背景”，也常涉及“社会如何看待你、你如何认同自己”。","语气上 mixed-race 通常是中性描述，但谈到个人身份时，最好尊重当事人更偏好的说法（例如 biracial, multiracial, mixed heritage, multiethnic 等）。","在一些国家/地区语境中，也可能看到较旧或带历史负担的词（如 mulatto 等）；学习与使用时应避免，以免冒犯。"],"etymology":"由 mixed（混合的）+ race（种族；族群）组成的复合形容词。现代用法更强调个人身份与社会语境，有时也会用更宽泛的 multiethnic（多族裔的）来表达。","mnemonic":["mixed=混合；race=种族/族群背景：字面直译就是“混合种族”。","联想“mix（调饮料）把不同原料混在一起”→ mixed-race 把不同族裔背景“混在一起”（仅作记忆联想，不是价值判断）。"]}
{"word":"mixed-register","summary":{"en":"blending formal and informal language in one context","zh":"在同一语境中混用正式与非正式语言风格"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"using a blend of formal and informal language styles in the same piece of speech or writing","zh":"（语体）混合使用正式与非正式风格；同一段话/文章里夹杂不同语域"},"examples":[{"en":"The article’s tone is mixed-register: it includes academic terms but also casual jokes.","zh":"这篇文章的语气是混合语体：既有学术术语，也穿插随意的玩笑。"},{"en":"Try to avoid mixed-register language in your cover letter; keep it consistently formal.","zh":"求职信里尽量避免混合语体；保持整体正式更合适。"},{"en":"His mixed-register dialogue makes the character sound realistic, like a real person switching styles.","zh":"他写的混合语体对话让角色听起来更真实，就像真人会在不同风格间切换一样。"}]}],"synonyms":["code-switching","style-mixing","hybrid style","mixed style","inconsistent tone"],"phonetic":"/ˌmɪkst ˈrɛdʒɪstər/","extraExplanation":["register 常译为“语域/语体”。比如：课堂报告偏正式（formal register），和朋友聊天偏随意（informal register）。mixed-register 指把这些不同风格混在一起，有时能制造幽默或人物真实感，但在正式写作中可能显得不协调。","常见场景：广告文案、社交媒体长文、小说对白、演讲中为拉近距离而在正式论述里穿插口语。"],"etymology":"由 mixed（“混合的”）+ register（语言学中指“语域/语体/语体风格”）构成；register 在语言学里常用来描述“在不同场合说话/写作的风格选择”，如正式、随意、专业、口语等。","mnemonic":["把 register 记成“场合用语的档位/频道”：正式=高档位，随意=低档位；mixed-register 就是“档位混着开”。","联想中文：一段话里既有“因此、综上所述”，又有“哈哈、真的很绝”，就是典型混合语体。"]}
{"word":"mixed-sex","summary":{"en":"containing both male and female participants","zh":"男女混合的；包含两种性别参与者的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"including or involving both males and females (or both men and women) in the same group or activity","zh":"男女混合的；包含男性和女性的（同一群体或活动中）"},"examples":[{"en":"The university offers mixed-sex housing for upperclass students.","zh":"这所大学为高年级学生提供男女混住宿舍。"},{"en":"They formed a mixed-sex team to compete in the relay race.","zh":"他们组建了一支男女混合队参加接力赛。"},{"en":"Some sports have different rules for mixed-sex events.","zh":"有些运动对男女混合项目有不同规则。"}]}],"synonyms":["coed","mixed-gender","coeducational","mixed"],"phonetic":"/ˌmɪkst ˈsɛks/","extraExplanation":["在英语里，sex 在此多指“性别（male/female）”，属于较正式或学术的用法；日常口语中也常用 mixed-gender 表达同样意思，语气更中性一些。","写作时注意 hyphen（连字符）：作定语放在名词前时通常写 mixed-sex（如 mixed-sex team）；若放在名词后作表语也常见不加连字符（如 The class is mixed sex），但加连字符更统一。"],"etymology":"由 mixed（“混合的”）+ sex（这里指“性别”）组合而成；常用于社会学、教育、体育等语境，强调同一场合同时包含两种性别。","mnemonic":["mixed=“混着”，sex=“性别”，合起来就是“性别混着的”→男女混合。","记成“mix+sex”：把男生女生“mix”在一起。"]}
{"word":"mixed-size","summary":{"en":"containing a variety of sizes","zh":"包含多种尺寸；大小不一"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having items in more than one size; containing a variety of sizes.","zh":"由不同尺寸混合组成的；大小不一的。"},"examples":[{"en":"The store sells mixed-size socks in one bundle.","zh":"这家店把不同尺码的袜子打包一起卖。"},{"en":"Use a mixed-size box of screws so you can choose the right one.","zh":"用一盒混合规格的螺丝，这样你就能挑到合适的。"},{"en":"We received a mixed-size shipment, so sorting took extra time.","zh":"我们收到了一批大小混合的货，所以分类多花了时间。"}]}],"synonyms":["assorted","varied","mixed","multisize","mixed-dimension","assorted-size"],"phonetic":"/ˌmɪkstˈsaɪz/","etymology":"由 mixed（混合的）+ size（尺寸）构成的复合形容词；常用于商品包装、库存、物流等场景，表示“包含多种尺寸”。","mnemonic":["记成“mixed（混合）+ size（尺寸）”，直译就是“尺寸混在一起”。","联想中文常见说法“混码/混尺码”，对应的英文表达就是 mixed-size。"]}
{"word":"mixed-style","summary":{"en":"using more than one style together","zh":"多种风格混合在一起的；混搭的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Combining two or more different styles in one thing (such as design, writing, music, or fashion).","zh":"把两种或多种不同风格混合在同一事物中（如设计、写作、音乐或穿搭）。"},"examples":[{"en":"Her apartment has a mixed-style look: modern furniture with vintage lamps.","zh":"她的公寓是混搭风：现代家具配复古台灯。"},{"en":"The restaurant’s mixed-style menu includes both street food and fine-dining dishes.","zh":"这家餐厅的混合风格菜单既有小吃也有精致料理。"},{"en":"He prefers mixed-style writing that blends humor with serious ideas.","zh":"他喜欢混合风格的写作，把幽默和严肃观点融合在一起。"}]}],"synonyms":["eclectic","hybrid","fusion","mix-and-match","multistyle"],"phonetic":"/ˈmɪkst ˌstaɪl/","extraExplanation":["常见近义表达：mixed-style / mixed style / mix-and-match。前两者偏“多风格融合”的描述；mix-and-match 更强调“把不同元素拿来搭配”。","书写上既可用连字符（mixed-style），也可不用（mixed style）；作定语放在名词前时，用连字符更常见：a mixed-style outfit（更清晰）。"],"etymology":"由 mixed（混合的）+ style（风格）构成的复合形容词，常用连字符 mixed-style 来强调“风格的混合”。","mnemonic":["把 mixed 想成“拌一拌、混一混”，style 就是“风格”，合起来就是“风格拌在一起＝混搭”。"]}
{"word":"mixed-subunit","summary":{"en":"composed of different types of subunits in one complex","zh":"由不同类型亚基组成的复合体/结构"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made of different kinds of subunits (parts) within one complex or assembly","zh":"由不同类型的“亚基/子单元”组成的（同一复合体或组装体中）"},"examples":[{"en":"The receptor is a mixed-subunit complex made from two different protein chains.","zh":"这种受体是一个混合亚基复合体，由两种不同的蛋白质链组成。"},{"en":"Researchers compared mixed-subunit enzymes with single-subunit forms.","zh":"研究人员比较了混合亚基酶与单一亚基形式。"}]}],"synonyms":["heteromeric","heterogeneous","hybrid","chimeric"],"phonetic":"/mɪkst ˈsʌb.jə.nɪt/","extraExplanation":["在生物学里，mixed-subunit 常用来描述“异源多聚体（heteromeric）”——也就是由不同基因/不同类型的蛋白亚基拼成的复合物；相对的是“同源多聚体（homomeric）”，由同一种亚基重复组成。","写作上常作定语：mixed-subunit receptor/complex/enzyme；也可写作 mixed subunit（不加连字符），但作复合定语时加连字符更常见、更清晰。"],"etymology":"由 mixed（混合的）+ subunit（亚基；组成部分）构成的复合形容词；常见于生物化学、分子生物学与材料科学语境，用来强调“组成单元不止一种类型”。","mnemonic":["把它拆开记：mixed=混在一起；subunit=子单元/亚基 → “混着的亚基组合”。","联想“混合口味拼盘”：不是一种配料（单一亚基），而是多种配料拼在一起（混合亚基）。"]}
{"word":"mixed-type","summary":{"en":"combining more than one kind or category","zh":"混合多种类型或类别的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made up of two or more different kinds; combining features from different categories","zh":"由两种或多种不同类型组成的；混合不同类别特征的"},"examples":[{"en":"The survey included mixed-type questions: multiple-choice and short-answer.","zh":"这份问卷包含混合题型：选择题和简答题。"},{"en":"Doctors described it as a mixed-type tumor, with cells showing more than one pattern.","zh":"医生将其描述为混合型肿瘤，细胞呈现不止一种形态模式。"},{"en":"We use a mixed-type model to handle both numbers and categories.","zh":"我们使用混合类型模型来同时处理数值和类别数据。"}]}],"synonyms":["hybrid","combined","composite","multitype","multi-category","mixed-category"],"phonetic":"/ˌmɪkst ˈtaɪp/","extraExplanation":["写作小提示：在名词前作定语时常用连字符（mixed-type questions / mixed-type tumor）。放在系动词后作表语时，有时也会写成 mixed type（The questions are mixed type），但很多领域仍保留连字符以避免歧义。","常见语境：医学（mixed-type tumor/cancer）、统计与机器学习（mixed-type data/features）、教育测评（mixed-type items/questions）。"],"etymology":"由 mixed（“混合的”，源自拉丁语 miscēre“混合”）+ type（“类型”，源自希腊语 typos“印记/模型”）构成；用连字符 mixed-type 常见于技术或学术写作中，用来把两部分当作一个复合形容词。","mnemonic":["把它拆开记：mixed=“混在一起”，type=“类型” → “混合类型”。","联想中文“混合型”：看到连字符就当成一个整体形容词来用。"]}
{"word":"mixed-typeface","summary":{"en":"using multiple typefaces in one design","zh":"在同一设计中混用多种字体"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using more than one typeface (font family) in the same design, page, or piece of text.","zh":"在同一份设计、页面或文本中混用两种或以上的字体（字族/字体风格）。"},"examples":[{"en":"The poster uses a mixed-typeface layout: a bold sans serif for headings and a serif for body text.","zh":"这张海报采用混合字体排版：标题用粗体无衬线字，正文用衬线字。"},{"en":"Mixed-typeface designs can look modern, but too many fonts make the page feel messy.","zh":"混合字体的设计可以很现代，但字体太多会让页面显得杂乱。"},{"en":"The brand guide limits mixed-typeface use to two families to keep a consistent look.","zh":"品牌规范把混合字体限制在两种字族以内，以保持视觉一致。"}]}],"synonyms":["mixed fonts","multiple typefaces","font mixing","typeface mix"],"phonetic":"ˌmɪkst ˈtaɪpˌfeɪs","extraExplanation":["在英文排版语境里，typeface 更偏“字族/字体设计”（如 Helvetica），font 常指具体字重字号（如 Helvetica Bold 12pt）。日常交流中两者也常被混用。","常见搭配策略是“标题一套字体 + 正文一套字体”，并用字号、字重、行距来建立层级；初学者通常建议最多 2–3 套字体，以免信息层级混乱。"],"etymology":"由 mixed（混合的）+ typeface（字族/字体）构成的复合形容词，常用连字符表示“混用字体的”。","mnemonic":["把它拆开记：mixed（混的）+ typeface（字体）→ “混字体”。","联想中文排版：一段里同时出现“宋体+黑体+手写体”就是 mixed-typeface。"]}
{"word":"mixed-up","summary":{"en":"confused or disordered; sometimes involved in trouble","zh":"困惑或杂乱；也可指卷入麻烦"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Confused; not thinking clearly; unable to understand something well.","zh":"困惑的；脑子乱的；不太明白的。"},"examples":[{"en":"I’m a little mixed-up about the schedule—what time do we start?","zh":"我对时间安排有点搞不清——我们几点开始？"},{"en":"The instructions were so long that I got mixed-up halfway through.","zh":"说明太长了，我看到一半就看糊涂了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Disordered or messy; not arranged in a clear or correct way.","zh":"混乱的；杂乱的；没有理顺的。"},"examples":[{"en":"My notes are mixed-up, so I can’t find the right page.","zh":"我的笔记很乱，所以找不到正确那一页。"},{"en":"The files got mixed-up during the move.","zh":"搬家时文件被弄乱了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involved in a complicated situation, often trouble or conflict (usually with “in”).","zh":"卷入（通常是不好的）复杂情况里（常与 in 搭配）。"},"examples":[{"en":"He got mixed-up in a fight he didn’t start.","zh":"他被卷进了一场并非他挑起的争吵。"},{"en":"She doesn’t want to be mixed-up in office politics.","zh":"她不想卷入办公室政治。"}]}],"synonyms":["confused","puzzled","mixed","muddled","disorganized","messy","entangled","involved"],"phonetic":"/ˌmɪkst ˈʌp/","extraExplanation":["拼写上常见两种：mixed up（更常见的普通写法）与 mixed-up（作定语放在名词前时更常用连字符），例如：a mixed-up story（一个混乱的故事）；I’m mixed up.（我搞糊涂了）。"],"etymology":"由动词短语 mix up（把……混在一起/弄乱/弄混）演变而来；加上形容词后缀式用法 mixed-up，用来描述“处于被弄混/混乱的状态”。","mnemonic":["把它拆开记：mix（混合）+ up（弄起来/弄乱了）→ “混到一块儿就乱了/搞不清了”。","联想中文口语“我被搞混了/我脑子有点乱”，就是 mixed-up 的常见感觉。"]}
{"word":"mixed-use","summary":{"en":"Combining multiple functions (e.g., living, working, shopping) in one place.","zh":"在同一地点结合居住、办公、商业等多种功能的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a building or area) designed to combine different functions, such as housing, offices, shops, and entertainment, in one place.","zh":"（指建筑或区域）把多种功能（如住宅、办公、零售、娱乐等）融合在同一地点的。"},"examples":[{"en":"They plan a mixed-use development with apartments above street-level stores.","zh":"他们计划建设一个混合用途项目：临街是商店，上面是公寓。"},{"en":"Mixed-use neighborhoods often make it easier to walk to daily needs.","zh":"混合用途社区通常更方便步行满足日常需求。"},{"en":"The old warehouse district is being rebuilt into a mixed-use complex.","zh":"老仓储区正在改造成一个混合用途综合体。"}]}],"synonyms":["multifunctional","multiuse","combined-use","integrated","hybrid"],"phonetic":"/ˌmɪkstˈjus/","extraExplanation":["常见搭配：mixed-use development（混合用途开发/项目）、mixed-use building（混合用途建筑）、mixed-use zoning（混合用途分区/区划）。","语义重点是“功能混合在同一地块/建筑内或同一片区”，与“multi-use（多用途）”相比，更强调不同用途（尤其居住+商业+办公）的组合，以及城市规划/地产开发背景。"],"etymology":"由 mixed（混合的）+ use（用途）构成；20世纪城市规划与房地产语境中逐渐固定为复合形容词，常用连字符 mixed-use 修饰 development / building / project 等名词。","mnemonic":["把它拆开记：mixed=混在一起，use=用途 → “用途混在一起”。","联想“楼下商场+楼上住宅/办公室”的常见场景，就是 mixed-use。"]}
{"word":"mixed-variance","summary":{"en":"with unequal variability across groups or parts of data","zh":"不同组或数据部分的波动程度不相同（方差不齐）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having more than one variance level; showing that variability differs across groups, conditions, or parts of a dataset (common in statistics and data analysis).","zh":"（统计/数据分析）具有多种方差水平的；表示不同组别、条件或数据部分的波动程度不相同。"},"examples":[{"en":"The results were analyzed with methods that handle mixed-variance data across age groups.","zh":"这些结果使用能处理不同年龄组“混合方差”数据的方法来分析。"},{"en":"Because the sample showed mixed-variance, the team avoided tests that assume equal variance.","zh":"由于样本呈现混合方差，团队避免使用假设方差相等的检验。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation in which a dataset contains a combination of different variances (for example, some groups have small spread while others have large spread).","zh":"（统计）混合方差现象；指同一数据集中存在不同方差并存的情况（如有的组很集中，有的组很分散）。"},"examples":[{"en":"Mixed-variance can distort simple comparisons if you ignore it.","zh":"如果忽略混合方差，简单比较可能会被扭曲。"},{"en":"The plot suggests mixed-variance: later measurements are much more spread out.","zh":"图形显示出混合方差：后期测量值分布更分散。"}]}],"synonyms":["heteroscedastic","unequal-variance","non-constant variance","heterogeneous variance"],"phonetic":"ˌmɪkst ˈvɛriəns","extraExplanation":["在统计检验里，很多方法（如经典 t 检验、ANOVA 的某些形式）常假设“方差齐性”（各组方差相等）。出现 mixed-variance（方差不齐/不等方差）时，常会改用更稳健的方法（如 Welch’s t-test）或对数据做变换/建模。","不要把 mixed-variance 与 “mixed-effects（混合效应）模型” 混为一谈：前者说的是误差/数据的波动大小不一致；后者说的是模型里同时有固定效应与随机效应。"],"etymology":"由 mixed（混合的）+ variance（方差/变异度）构成，属于统计学语境中的组合用法；用来强调“不同部分的波动程度不一致”。","mnemonic":["把 variance 记成“方差=波动大小”；mixed-variance 就是“波动大小混在一起、不统一”。","联想中文常说的“有的组很稳，有的组很飘”，就是 mixed-variance 的直观画面。"]}
{"word":"mixedly","summary":{"en":"“Mixedly” means “in a mixed way,” but it is uncommon; “in a mixed way/manner” is usually more natural.","zh":"“mixedly”意为“以混合的方式”，但较少见；更自然的表达通常是“in a mixed way/manner”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a mixed manner; with different things, qualities, or people combined together rather than kept separate.","zh":"以混合的方式；把不同的事物、特质或人混在一起，而不是分开。"},"examples":[{"en":"The students were seated mixedly, not in separate groups.","zh":"学生们混合就座，没有分成不同的小团体。"},{"en":"In the photo, the colors are mixedly arranged, giving a lively feeling.","zh":"在这张照片里，颜色被混合地排列，给人一种活泼的感觉。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a partly clear and partly unclear way; with mixed feelings or mixed results (less common).","zh":"以复杂/矛盾的方式；带着复杂情绪或呈现混合结果（较不常见）。"},"examples":[{"en":"He spoke mixedly about the plan—excited but also worried.","zh":"他谈到这个计划时情绪很复杂——既兴奋也担心。"},{"en":"The reviews were mixedly positive: many praised the acting, but some disliked the ending.","zh":"评价算是褒贬参半：很多人称赞演技，但也有人不喜欢结尾。"}]}],"synonyms":["in a mixed way","in a mixed manner","together","intermixedly","heterogeneously"],"phonetic":"/ˈmɪkstli/","extraExplanation":["“mixedly”这个词在现代英语里比较少见，很多时候母语者更常用：\n- “in a mixed way / in a mixed manner”（更自然、更正式）\n- “mixed”（作副词用法较口语/简略，如：They were mixed together.）\n- 表示“褒贬参半/结果不一”时，更常见的是 “mixed” 或 “mixed feelings / mixed reviews”，而不是 “mixedly”。\n\n写作建议：如果你是在作文或正式写作中，优先用 “in a mixed way/manner” 会更地道。"]}
{"word":"mixedness","summary":{"en":"Mixedness means the quality of being mixed, and in academic/social use it often refers to mixed racial/ethnic/cultural identity or experience.","zh":"mixedness 指“混合性/混合状态”；在学术与社会语境中常指混血、跨族裔或多文化的身份与经历。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being mixed—made from different parts, elements, or types.","zh":"混合状态；混合性（由不同部分、成分或类型构成的状态）。"},"examples":[{"en":"The recipe’s mixedness made it hard to describe—sweet, spicy, and sour at the same time.","zh":"这道菜的混合性很难形容——又甜、又辣、又酸。"},{"en":"The mixedness of the materials affected how the paint dried.","zh":"材料的混合程度影响了油漆的干燥方式。"}]},{"partOfSpeech":"n.","definition":{"en":"In academic or social contexts, the condition of having mixed racial, ethnic, cultural, or ancestral background; the experience of being seen as or identifying as “mixed.”","zh":"（学术/社会语境）混血或多族裔/多文化背景的状态；作为“混合身份者”的经历与处境。"},"examples":[{"en":"The author writes about mixedness as both a personal identity and a social label.","zh":"作者将混合身份写成既是个人认同，也是社会标签。"},{"en":"In class, we discussed how mixedness can be celebrated in some places but questioned in others.","zh":"课堂上我们讨论了混合身份在一些地方会被赞美，但在另一些地方却会被质疑。"}]}],"synonyms":["mixture","blendedness","hybridity","diversity","multiracial identity"],"phonetic":"/ˈmɪkstnəs/","extraExplanation":["“mixedness”不是日常最常用的词，更常见的表达是“mixture / diversity / being mixed / mixed identity / mixed-race identity”等；但在社会学、文化研究、文学研究里，“mixedness”常被用来讨论身份、归属、他人凝视（how others see you）等议题。","谈到种族/族裔时，用词需要注意尊重与语境：有些人更偏好“mixed-race”“multiracial”“multiethnic”或直接描述具体背景（例如“Black and Korean”），以避免把人简化成抽象概念。"]}
{"word":"mixen","summary":{"en":"Mixen is a rare (mainly British dialect) noun meaning a heap of dung/manure or refuse.","zh":"Mixen 是较少见的（主要为英国方言）名词，指粪堆/肥堆或废物堆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly in English dialects) a heap/pile of dung, manure, or refuse; a manure heap.","zh":"（主要见于英国方言）粪堆；肥堆；（也可泛指）垃圾堆。"},"examples":[{"en":"The farmer carted the waste to the mixen behind the barn.","zh":"农夫把废弃物运到谷仓后面的粪堆里。"},{"en":"In the old village story, the fox was said to hide near the mixen at night.","zh":"在那则古老的乡村故事里，据说狐狸夜里会躲在粪堆附近。"}]}],"synonyms":["manure heap","dung heap","midden","compost heap","refuse heap"],"phonetic":"/ˈmɪksən/","extraExplanation":["“mixen”是很古老、带地域色彩的英语词（常见于英国乡村语境），现代日常英语里很少用；更常见的对应词是“manure heap / dung heap / midden / compost heap”。","注意：在德语/荷兰语里也能见到“mixen”作动词，意思是“to mix（混合、调配）”，这是外来词用法，不等同于英语里这个方言名词。"]}
{"word":"mixer","summary":{"en":"A “mixer” is most commonly a machine for mixing food, but it can also mean a social person/event, a drink-mixing container, or an audio mixing device.","zh":"“mixer”最常指厨房搅拌机，也可指爱社交的人/联谊活动、调酒混合杯，或音频调音台（混音器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kitchen or bakery machine used to mix ingredients (often with beaters or a dough hook)","zh":"（厨房/烘焙用）搅拌机；和面机（常配打蛋头或和面钩）"},"examples":[{"en":"I used a stand mixer to make bread dough.","zh":"我用台式搅拌机来揉面做面包。"},{"en":"Don’t overmix the batter—use the mixer on low speed.","zh":"别把面糊搅过头——用低速搅拌。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that mixes people, things, or ideas together; someone who socializes a lot","zh":"混合者；把人/事物/想法“搅在一起”的事物；爱社交的人"},"examples":[{"en":"At parties, she’s a natural mixer who talks to everyone.","zh":"在派对上，她很会社交，能和每个人聊天。"},{"en":"The event was a good mixer for students from different majors.","zh":"这个活动很适合不同专业的学生互相认识、交流。"}]},{"partOfSpeech":"n.","definition":{"en":"a container or device used to combine drinks, sometimes a mixing glass for cocktails","zh":"（调酒用）混合杯；调配饮料的容器/工具"},"examples":[{"en":"Pour the ingredients into a mixer with ice and stir.","zh":"把材料倒进装有冰块的混合杯里搅拌。"}]},{"partOfSpeech":"n.","definition":{"en":"an audio device that combines multiple sound signals into one output (used in music, recording, or broadcasting)","zh":"（音频）混音器；调音台（把多路声音信号合成输出）"},"examples":[{"en":"The singer’s mic is connected to the mixer.","zh":"歌手的麦克风连接到调音台。"},{"en":"He adjusted the levels on the mixer during the live show.","zh":"现场演出时他在调音台上调节音量电平。"}]}],"synonyms":["blender (food/drinks)","stand mixer","hand mixer","mixing console","soundboard","social mixer (event)"],"phonetic":"/ˈmɪksɚ/","extraExplanation":["“Mixer”在日常生活里最常见的是厨房电器（stand mixer 台式搅拌机；hand mixer 手持打蛋器）。在社交语境里，a mixer 常指“联谊/交流活动”，比如 student mixer（新生联谊）。在音乐领域里，mixer 指“调音台/混音器”，也常说 mixing console 或 soundboard。"]}
{"word":"mixeress","summary":{"en":"“Mixeress” is a rare, old-fashioned word meaning a female bartender (a woman who mixes drinks). In modern English, people usually say “bartender” or “mixologist.”","zh":"“mixeress”是一个罕见且偏旧式的词，指“女调酒师／女性调酒者”。现代英语通常用更中性的“bartender”或“mixologist”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, dated) A woman who mixes and serves alcoholic drinks; a female bartender.","zh":"（罕见／过时）调制并提供酒精饮料的女性；女调酒师。"},"examples":[{"en":"The novel mentions a “mixeress” working behind the bar, but today we would simply say “bartender.”","zh":"小说里提到一位在吧台工作的“mixeress”，但如今我们通常直接说“bartender（调酒师）”。"},{"en":"The word “mixeress” can sound old-fashioned and gendered, so many people avoid it.","zh":"“mixeress”听起来比较老派而且带性别标记，所以很多人会避免使用。"}]}],"synonyms":["bartender","mixologist","barmaid (dated)","cocktail maker"],"phonetic":"/ˈmɪk.sɚ.əs/","extraExplanation":["“mixeress”并不是现代英语里的常用词，更像是由“mixer（调配者／调酒者）+ -ess（表示女性的后缀）”拼出来的过时用法。现在英语更倾向用不带性别的职业称呼，例如 bartender、mixologist。","后缀“-ess”（如 waitress, actress）在现代语境中有时会被认为不必要或带刻板印象，因此不少场合会改用中性词（server, actor 等）。在酒吧场景里，用 bartender 最自然、最安全。"]}
{"word":"mixers","summary":{"en":"“Mixers” is the plural of “mixer”: a mixing machine (often in the kitchen), a sociable person, a social networking event, or an audio mixing device.","zh":"“mixers”是“mixer”的复数：可指搅拌器/混合器、善于交际的人、社交联谊活动，或调音台等混音设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine or tool that mixes substances together, especially a kitchen appliance used to mix ingredients.","zh":"搅拌器；混合器（尤指厨房里用来搅拌食材的电器）。"},"examples":[{"en":"I used a hand mixer to beat the eggs.","zh":"我用手持搅拌器把鸡蛋打匀。"},{"en":"Add the flour slowly while the mixer is running.","zh":"搅拌机运转时慢慢加入面粉。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who likes to talk with many people and socialize easily.","zh":"善于交际的人；社交活跃的人。"},"examples":[{"en":"She’s a natural mixer at parties.","zh":"她在聚会上天生就很会和人打成一片。"},{"en":"He’s not much of a mixer, so he stayed near the door.","zh":"他不太擅长社交，所以一直待在门边。"}]},{"partOfSpeech":"n.","definition":{"en":"A social event or gathering where people meet and chat, often for networking.","zh":"社交聚会；联谊活动（常带有建立人脉、交流的目的）。"},"examples":[{"en":"The company hosted a mixer for new employees.","zh":"公司为新员工举办了联谊活动。"},{"en":"There’s a campus mixer on Friday night.","zh":"周五晚上有一场校园社交聚会。"}]},{"partOfSpeech":"n.","definition":{"en":"A device used to combine and control sound signals in music, film, or broadcasting (a mixing console/board).","zh":"调音台；混音器（用于音乐、影视或广播的声音混合与控制设备）。"},"examples":[{"en":"The engineer adjusted the vocals on the mixer.","zh":"录音师在调音台上调整了人声。"},{"en":"Plug the microphone into channel one of the mixer.","zh":"把麦克风插到调音台的第一路。"}]}],"synonyms":["blender","beater","mixing machine","socializer","networking event","mixing console"],"phonetic":"/ˈmɪksər/","extraExplanation":["“mixers”是复数形式，表示多个搅拌器/聚会等：Two mixers were on sale（两个搅拌器在打折）/ We went to several mixers（我们参加了好几场联谊活动）。在口语里，指“联谊活动”时很常见于校园或公司新人社交场合。"]}
{"word":"mixes","summary":{"en":"“Mixes” usually means “combines/blends” (he/she/it mixes). It can also mean “socializes,” or it can be the plural noun “mixtures/mixes.”","zh":"“mixes”通常表示“混合/调配”（第三人称单数：他/她/它 mixes）。也可表示“社交/与人交往”，或作名词复数表示“混合物/混音等”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “mix”) to combine two or more things together so they become blended or used together.","zh":"（动词 mix 的第三人称单数）把两种或多种东西混合在一起，使它们融合或一起使用。"},"examples":[{"en":"She mixes flour and water to make dough.","zh":"她把面粉和水混合来做面团。"},{"en":"He mixes paint colors to get the right shade.","zh":"他把不同颜色的颜料混在一起，调出合适的色调。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “mix”) to spend time with or interact socially with people, often in a friendly way.","zh":"（动词 mix 的第三人称单数）与人交往；社交（常指友好地互动）。"},"examples":[{"en":"At work, she mixes well with people from different teams.","zh":"在工作中，她和不同团队的人相处得很好。"},{"en":"He doesn’t mix much at parties.","zh":"他在派对上不太社交。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural of “mix”) combinations or blends of ingredients, sounds, or elements; mixtures.","zh":"（名词 mix 的复数）混合物；（材料、声音或元素的）组合。"},"examples":[{"en":"They sell cake mixes in the baking aisle.","zh":"他们在烘焙区卖蛋糕预拌粉。"},{"en":"The DJ shared two new mixes online.","zh":"那位 DJ 在网上分享了两段新的混音作品。"}]}],"synonyms":["blends","combines","stirs","merges","mingles"],"phonetic":"/ˈmɪksɪz/","extraExplanation":["“mixes”是“mix”的第三人称单数形式：I/you/we/they mix；he/she/it mixes。动词以 -x 结尾时，第三人称单数通常加 -es（如 fix→fixes，box→boxes）。"]}
{"word":"mixhill","summary":{"en":"Mixhill (dialectal English) means a dungheap or manure pile.","zh":"mixhill（英格兰方言）指粪堆、堆肥的粪堆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, England) A dungheap; a pile of manure (a “mixen”).","zh":"（英格兰方言）粪堆；堆积的粪肥（同 mixen）。"},"examples":[{"en":"In older rural writing, a “mixhill” was kept behind the barn to make fertilizer.","zh":"在较早的乡村写作中，“mixhill”常指谷仓后面用来做肥料的粪堆。"},{"en":"The yard smelled worse near the mixhill after the rain.","zh":"下雨后，靠近粪堆的院子气味更重。"}]}],"synonyms":["mixen","dunghill","dungheap","manure pile"],"phonetic":"/ˈmɪksˌhɪl/","extraExplanation":["“mixhill”是一个比较少见的词，主要见于英格兰方言或旧文本；现代英语里更常用 dungheap / manure pile 等表达。","词源大意：mix（古英语相关词，意为粪/污秽）+ hill（小丘/堆），字面就是“粪堆”。","注意不要和专有名词混淆：例如美国公司名 “Mixon Hill” 或一些商号 “Mixhill” 可能只是品牌/公司名称，并不是这个方言词的用法。"]}
{"word":"mixian","summary":{"en":"Mixian is a Chinese rice noodle, especially associated with Yunnan-style noodle soups.","zh":"mixian 指“米线”，一种中国米制面条，尤常见于云南风味的米线汤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of Chinese rice noodle, usually thin and round, commonly used in soups or stir-fries (especially in Yunnan cuisine).","zh":"（中国）米线；一种用大米制成的细圆形米制面条，常用于汤粉或炒粉，尤以云南菜常见。"},"examples":[{"en":"I ordered a bowl of mixian soup with beef and pickled vegetables.","zh":"我点了一碗牛肉酸菜米线。"},{"en":"For a lighter meal, try mixian with chicken broth and fresh herbs.","zh":"想吃清淡一点，可以试试鸡汤米线配新鲜香草。"},{"en":"The restaurant’s Yunnan-style mixian is spicy and fragrant.","zh":"这家店的云南风味米线又辣又香。"}]}],"synonyms":["rice noodles","rice vermicelli (sometimes)","Yunnan rice noodles"],"phonetic":"/miːˈʃjɛn/","extraExplanation":["“mixian（米线）”是普通话拼音的音译词，在英文菜单或海外中餐馆里常见，尤其与“Yunnan rice noodles（云南米线）”一起出现。","云南名菜“过桥米线（crossing-the-bridge noodles）”常用米线：汤底很烫，配料分碟上桌，按顺序下锅，口感和仪式感都很强。","英文里也可能看到写法“mi xian / mi-xian / mixian”。点餐时可以补充说明：thin rice noodles（细米粉）或 rice noodle soup（米粉汤）。"]}
{"word":"mixible","summary":{"en":"Mixible is a less common spelling of mixable, meaning “able to be mixed,” and in science it can mean “miscible” (mixing evenly without separating).","zh":"Mixible 是 mixable 的少见拼写，意思是“可混合的”；在理工科语境中也可指“可互溶的（miscible）”，即混合后不分层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Variant spelling of **mixable**: able to be mixed or combined easily.","zh":"（**mixable** 的异体拼写）可混合的；容易与其他东西混在一起的。"},"examples":[{"en":"This paint is mixible with water, so clean-up is easy.","zh":"这种颜料可与水混合，所以清理起来很方便。"},{"en":"Choose mixible ingredients if you want a smooth sauce.","zh":"如果你想要顺滑的酱汁，就选容易混合的食材。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/physics) **Miscible**: capable of mixing evenly to form one uniform liquid mixture (not separating into layers).","zh":"（化学/物理）**可互溶的**：能均匀混合成单一液体混合物（不会分层）。"},"examples":[{"en":"Alcohol is mixible with water.","zh":"酒精与水可互溶。"},{"en":"If two liquids are mixible, you won’t see a clear boundary between them.","zh":"如果两种液体可互溶，你不会看到明显的分界线。"}]}],"synonyms":["mixable","miscible","blendable","combinable"],"phonetic":"/ˈmɪksəbəl/","extraExplanation":["“mixible”在现代英语里比较少见，更常写作 **mixable**；在科技/化学语境中也常用更标准的术语 **miscible（可互溶的）** 来表达第二个意思。","注意：**Mixible** 也可能是专有名词（例如媒体/品牌名）。如果你是在文章或节目名称里看到的，它不一定是在用“可混合的”这个词义。"]}
{"word":"mixilineal","summary":{"en":"Likely intended spelling: mixtilineal. A rare anthropology term meaning “traced through both the mother’s and father’s lines.”","zh":"你可能想写的是 mixtilineal。它是较少见的人类学用语，指“血统/亲属/继承同时按母系与父系两条线追溯”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anthropology, rare) Describing descent, kinship, or inheritance traced through both the mother’s and the father’s lines (i.e., not strictly matrilineal or patrilineal).","zh":"（人类学，较少见）指血统、亲属关系或继承同时通过母系与父系来追溯（即不单是母系或父系）。"},"examples":[{"en":"In a mixtilineal kinship system, rights and duties may come from both parents’ families.","zh":"在混合系亲属制度中，权利与义务可能同时来自父母双方的家族。"},{"en":"The community’s rules created a mixtilineal pattern of inheritance rather than a purely patrilineal one.","zh":"该社群的规则形成了混合系的继承模式，而不是纯粹的父系继承。"}]}],"synonyms":["bilateral","cognatic","ambilineal","non-unilineal"],"phonetic":"/ˌmɪk.stəˈlɪn.i.əl/","extraExplanation":["你输入的 **mixilineal** 很可能是拼写少了一个 **t**，更常见的形式是 **mixtilineal**。","**mixtilineal** 在现代英语里非常少见，谈“血统/亲属/继承”时，更常用的词往往是 **bilateral / cognatic / ambilineal**（不同学科会偏好不同术语）。","注意别和 **mixtilinear**（几何/线条：由直线与曲线等“混合线条”构成）混淆：一个多用于人类学亲属制度，一个多用于数学/艺术/建筑描述线条。"]}
{"word":"mixing","summary":{"en":"“Mixing” means the process of combining things, or the action of mix (often in cooking or music).","zh":"“mixing”表示“混合/搅拌的过程”，也可作 mix 的 -ing 形式，常见于烹饪或音乐“混音”语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of combining two or more things so they become blended together","zh":"（把两种或多种东西）混合在一起的行为或过程"},"examples":[{"en":"Proper mixing helps the ingredients turn into a smooth batter.","zh":"充分搅拌有助于食材变成顺滑的面糊。"},{"en":"The recipe says the mixing should take about two minutes.","zh":"食谱说搅拌大约需要两分钟。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “mix”) combining things or people; blending","zh":"（mix 的现在分词）正在混合；把东西或人群混在一起"},"examples":[{"en":"She is mixing flour and water in a bowl.","zh":"她正在碗里把面粉和水混在一起。"},{"en":"The teacher encourages mixing students from different groups.","zh":"老师鼓励把不同小组的学生混合编组。"}]},{"partOfSpeech":"n.","definition":{"en":"combining sounds, tracks, or channels to create a final audio version","zh":"（音频）混音：把不同声音/音轨合成为最终版本"},"examples":[{"en":"He spent the evening mixing the song in the studio.","zh":"他在录音棚里花了一晚上给这首歌做混音。"},{"en":"Good mixing makes the vocals clear and the bass balanced.","zh":"好的混音能让人声清晰、低音更均衡。"}]}],"synonyms":["blending","combining","stirring","merging","mixdown"],"phonetic":"/ˈmɪksɪŋ/","extraExplanation":["“mixing”既可以是名词（表示“混合/搅拌这个过程”），也可以是动词 mix 的 -ing 形式（表示“正在混合”）。在厨房语境里常指“搅拌”；在音乐制作里常指“混音”。"]}
{"word":"mixite","summary":{"en":"Mixite is a rare blue‑green mineral (a copper–bismuth arsenate).","zh":"Mixite 是一种罕见的蓝绿色矿物（铜—铋砷酸盐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a hydrous basic copper–bismuth arsenate) that often appears blue‑green and forms needle-like crystals.","zh":"一种较罕见的矿物（含水的碱式铜—铋砷酸盐），常呈蓝绿色，晶体多为针状。"},"examples":[{"en":"The museum’s mineral display included a bright blue-green sample of mixite.","zh":"博物馆的矿物展里有一块亮蓝绿色的 mixite（米克赛特矿）标本。"},{"en":"Geologists reported mixite forming as a secondary mineral in an oxidized copper deposit.","zh":"地质学家报告说，在氧化的铜矿床中出现了 mixite，属于次生矿物。"}]}],"synonyms":["(no common everyday synonyms; mineral name)"],"phonetic":"/ˈmɪkˌsaɪt/","extraExplanation":["“mixite”主要用于矿物学语境，不是日常英语里表示“混合/混合性”的词。它的词源与19世纪一位名叫 A. Mixa 的捷克矿业人员有关，后缀 -ite 常见于矿物名称（如 calcite 方解石、malachite 孔雀石）。"]}
{"word":"mixo","summary":{"en":"mixo- is a scientific word part meaning “mixed,” and in chemistry it can mean “a mixture of isomers.”","zh":"mixo- 是常见于科学术语的构词成分，表示“混合的”；在化学中也可表示“某化合物异构体的混合物”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (combining form) meaning “mixed” or “mixing,” used to form scientific terms","zh":"（构词成分）表示“混合的 / 混合”，常用于构成科学术语"},"examples":[{"en":"Some algae are described as mixotrophic because they can both photosynthesize and consume other organisms.","zh":"有些藻类被称为 mixotrophic（混合营养的），因为它们既能光合作用，也能摄食其他生物。"},{"en":"The paper discusses mixo- forms that signal a mixed biological strategy.","zh":"这篇论文讨论了用 mixo- 构成的词，用来表示“混合的生物策略”。"}]},{"partOfSpeech":"other","definition":{"en":"in chemistry, a word part meaning “a mixture of isomers of (a specified compound)”","zh":"（化学）表示“某种化合物的异构体混合物”"},"examples":[{"en":"In older chemical naming, mixooctane referred to a mixture of octane isomers.","zh":"在较早的化学命名中，mixooctane 指的是辛烷异构体的混合物。"}]}],"synonyms":["mixed","hybrid","combined"],"phonetic":"/ˈmɪksoʊ/","extraExplanation":["mixo- 通常不是一个单独使用的“词”，而是一个前置的构词成分（combining form），更常见于生物学、化学等领域（如 mixotrophic）。","你在网络上也可能看到大写的 “Mixo” 作为专有名词（例如某些产品/网站或应用的名称）；这种情况下它是品牌名，不属于通用词义。"]}
{"word":"mixobarbaric","summary":{"en":"Mixobarbaric (rare) describes people or things viewed as a mix of Greek and non-Greek (“barbarian”) elements, or more broadly something partly civilized and partly barbaric.","zh":"Mixobarbaric（罕见）多指被视为希腊与非希腊成分混合的人群；也可更宽泛地指“半文明半野蛮”的混合特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to people who were seen (in Ancient Greek usage) as “mixed”—partly Greek and partly non-Greek.","zh":"（古希腊语境中）指被视为“混合的”人群——部分为希腊血统/文化、部分为非希腊血统/文化。"},"examples":[{"en":"Some ancient writers used the label mixobarbaric for communities living on the Greek frontier.","zh":"一些古代作者用 mixobarbaric 这个标签来指称生活在希腊边缘地带的群体。"},{"en":"The text describes a mixobarbaric population with ties to Greek culture and neighboring peoples.","zh":"该文本描述了一个 mixobarbaric 的人群：既与希腊文化有关联，也与周边民族相连。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Broader, rare) Not fully “barbaric”; showing some influence of civilization, culture, or refined art.","zh":"（更宽泛、较少见）并非完全“野蛮”；在“野蛮”之中带有一定文明、文化或艺术的影响。"},"examples":[{"en":"The author calls the style mixobarbaric—rough in places, yet clearly shaped by learned tradition.","zh":"作者称这种风格为 mixobarbaric：有些地方粗砺，但明显受过学术传统的塑造。"},{"en":"He mocked the architecture as mixobarbaric, mixing classical motifs with cruder elements.","zh":"他嘲讽这种建筑为 mixobarbaric：把古典母题与更粗陋的元素混在一起。"}]}],"synonyms":["mixed","hybrid","semi-barbaric","Greco-non-Greek"],"phonetic":"/ˌmɪksoʊˌbɑrˈbærɪk/","extraExplanation":["这个词来自古希腊语 mixo-（“混合”）+ barbaros（古希腊人对“非希腊语者/外族”的称呼）。在现代英语里它非常罕见，最常见于古典学/历史研究中。","需要注意文化语感：barbarian / barbaric 在英语里常带有贬义（“野蛮的”）。在古代希腊语境里，它也带有“非希腊人/外来者”的区分意味；现代写作中使用时，最好明确是历史术语，而不是对某个民族的贬损评价。","相关名词常见作 mixobarbaroi（复数，指“混合的蛮族/半蛮族”这一类人群的称呼）。学术写作里也可能讨论其如何反映古代“我们/他们”的身份边界。"]}
{"word":"mixochromosome","summary":{"en":"A (rare) genetics term meaning a chromosome formed by fusion of parts of two or more chromosomes.","zh":"一个较少见的遗传学术语，指由两个或多个染色体的部分或全部融合形成的“混合”染色体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics) A chromosome thought to be formed by the fusion of all or part of two or more chromosomes, creating a single “mixed” chromosome.","zh":"（遗传学）混合染色体；指被认为由两个或多个染色体的全部或部分融合而成的一条染色体。"},"examples":[{"en":"The karyotype suggested a mixochromosome formed by fusion of two chromosome segments.","zh":"核型分析提示可能存在由两段染色体片段融合形成的混合染色体。"},{"en":"Researchers used the term mixochromosome to describe a chromosome with material from more than one original chromosome.","zh":"研究人员用“mixochromosome”来描述一条包含多条原始染色体遗传物质的染色体。"}]}],"synonyms":["chimeric chromosome","composite chromosome","fusion chromosome","derivative chromosome (context-dependent)"],"phonetic":"/ˌmɪksoʊˈkroʊməˌsoʊm/","extraExplanation":["这个词在现代教材/论文里并不算常见；实际研究与临床报告中更常用的相关表述往往是：chromosome fusion（染色体融合）、translocation（易位）、derivative chromosome / der( )（衍生染色体）、rearranged chromosome（重排染色体）、或 chimeric chromosome（嵌合/杂合染色体，视语境而定）。","词缀 mixo- 来自希腊语，表示“混合、掺杂”；因此 mixochromosome 字面意思就是“混合的染色体”。","学习上可以把它理解成一种“由不同来源拼在一起”的染色体概念，但在严格写作时，最好根据具体机制选用更精确的术语（例如是否是易位、融合、倒位或其他重排）。"]}
{"word":"mixodectes","summary":{"en":"Mixodectes is the scientific (genus) name of an extinct mammal from North America, mainly known from Paleocene fossils.","zh":"Mixodectes 是一种已灭绝哺乳动物的属名，化石主要见于北美，主要来自古新世。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Paleontology) A genus of extinct mammals (family Mixodectidae) known from fossils in North America, living mainly in the Paleocene epoch.","zh":"（古生物）一种已灭绝哺乳动物的属名（混齿兽科 Mixodectidae），化石主要发现于北美，主要生活在古新世。"},"examples":[{"en":"Mixodectes is an extinct mammal genus known from Paleocene fossils in North America.","zh":"Mixodectes 是一种已灭绝的哺乳动物属，化石出自北美古新世地层。"},{"en":"Scientists described a remarkably complete Mixodectes skeleton to better understand early tree-dwelling mammals.","zh":"科学家描述了一具相当完整的 Mixodectes 骨骼，以更好理解早期树栖哺乳动物。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some dictionaries/older descriptions) An extinct group described as insectivore-like mammals with very large incisors, based on early fossil interpretations.","zh":"（部分词典/较早描述）曾被描述为“类似食虫类”的已灭绝哺乳动物群，以巨大门齿等特征为依据的早期解读。"},"examples":[{"en":"Some references describe Mixodectes as an extinct insectivore-like mammal.","zh":"有些资料会把 Mixodectes 描述成“类似食虫类”的已灭绝哺乳动物。"}]}],"synonyms":["mixodectid (related term: a member of the family Mixodectidae)"],"phonetic":"ˌmɪksoʊˈdɛktiz","extraExplanation":["这是一个属名（genus），通常首字母大写：Mixodectes。","词源常分析为 mixo-（“混合的”）+ -dectes（“咬者/咬食者”），可理解为“混合的咬者”。","关于它与哪些现代类群更接近（如与灵长类、鼯猴/皮翼目等的亲缘关系），学界曾长期存在争论；近年的更完整骨骼材料让“树栖生活方式”等推断更有依据。"]}
{"word":"mixodectid","summary":{"en":"an extinct North American Paleocene–Eocene mammal of the Mixodectidae family","zh":"北美古新世—始新世时期的混齿兽科已灭绝哺乳动物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an extinct family of small, tree-dwelling mammals (Mixodectidae) known from the Paleocene–early Eocene of North America","zh":"混齿兽科（Mixodectidae）的一员；一种已灭绝的小型、偏树栖的哺乳动物，主要发现于北美古新世至早始新世地层"},"examples":[{"en":"Paleontologists identified the jaw as belonging to a mixodectid.","zh":"古生物学家判断这块颌骨属于一种混齿兽科动物。"},{"en":"Mixodectids likely ate leaves and fruit in forested habitats.","zh":"混齿兽科动物可能生活在森林环境中，以叶子和果实为食。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Mixodectidae or to these extinct mammals","zh":"与混齿兽科或这类已灭绝哺乳动物有关的"},"examples":[{"en":"The museum displayed several mixodectid fossils from Wyoming.","zh":"博物馆展出了数件来自怀俄明州的混齿兽科化石。"}]}],"synonyms":["mixodectid mammal","Mixodectidae member"],"phonetic":"/ˌmɪksoʊˈdɛktɪd/","extraExplanation":["这是一种“科名→成员名”的常见构词：例如 felid（猫科动物）、canid（犬科动物）。mixodectid 也是同样模式。","关于其系统发育位置（与灵长类、啮齿类或其他早期真兽类的关系）在研究史上有过争论；阅读科普或论文时可能会看到不同归类观点。"],"etymology":"来自分类学命名：Mixodectidae（混齿兽科）→ mixodectid（其成员）。Mixodect- 源自希腊语词根 mixo-（“混合”）+ -dectes（“咬者/咬合者”之意的构词成分），-id 表示“某类/某科的成员”。","mnemonic":["把它拆开记：mixo-（像“mix 混合”）+ -dect-（联想“牙齿/咬”）→ “混合型咬合的古老小哺乳动物”。","记住后缀 -id：看到 -id 常表示“某科的成员”（猫科 felid、犬科 canid），mixodectid 同理。"]}
{"word":"mixodectidae","summary":{"en":"Mixodectidae = an extinct family of Paleocene placental mammals (mixodectids), discussed as possible close relatives of early primate/colugo-related groups.","zh":"Mixodectidae 指“混齿兽科/混咬齿科”：古新世时期的已灭绝胎盘类哺乳动物一科（mixodectids），常被讨论为可能与灵长类/鼯猴相关的早期近亲类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(paleontology, zoology) An extinct family of early placental mammals known as mixodectids, mainly from the Paleocene of North America (and sometimes discussed in relation to other early euarchontans such as primates and colugos).","zh":"（古生物学 / 动物学）已灭绝的一科早期胎盘类哺乳动物，称为“混齿兽科/混咬齿科”（mixodectids），主要发现于北美古新世地层；其系统位置常被讨论，常与灵长类、鼯猴（colugo）等“真灵长总目（Euarchonta）”类群的早期演化联系在一起。"},"examples":[{"en":"Mixodectidae is an extinct mammal family known mostly from fossil teeth and jaws.","zh":"Mixodectidae 是一个已灭绝的哺乳动物科，很多信息主要来自牙齿和下颌的化石。"},{"en":"Some studies argue mixodectids were close relatives of primates and colugos within Euarchonta.","zh":"一些研究认为 mixodectids 可能是灵长类与鼯猴在 Euarchonta（真灵长总目）内部的近亲。"}]}],"synonyms":["mixodectids (members of Mixodectidae)"],"phonetic":"/ˌmɪksoʊˈdɛktɪdiː/","extraExplanation":["“Mixodectidae”是生物分类学里的“科”名后缀 **-idae**，英文里常读作 /-ɪdiː/（类似“ih-dee”）。因此整词常被读成“mixo-DEC-ti-dee”。","词源常解释为源自希腊语成分：**mixo-**（“混合的”）+ **-dectes**（与“咬/咬者”相关）。在学术与科普文章中，你也会看到形容词/成员名 **mixodectid(s)**（“混齿兽科成员/混咬齿科成员”）。","该类群的系统位置长期存在争议；较新的化石与系统发育分析（例如对 Mixodectes 更完整骨骼的研究）倾向支持它们与 Euarchonta（包括灵长类、鼯猴、树鼩等相关分支）有较近关系，但具体落点仍可能随研究更新而调整。"]}
{"word":"mixodectids","summary":{"en":"extinct Paleocene–Eocene North American mammals in the family Mixodectidae","zh":"古新世—早始新世北美已灭绝的混咬兽科哺乳动物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct group of small mammals (family Mixodectidae) that lived in North America mainly in the Paleocene and early Eocene; they are often discussed in relation to early primates and other archaic mammals.","zh":"一类已灭绝的小型哺乳动物（混咬兽科 Mixodectidae），主要生活在北美的古新世至早始新世；常在研究早期灵长类与其他原始哺乳动物时被提及。"},"examples":[{"en":"Fossils of mixodectids are mostly found in Paleocene and early Eocene deposits in North America.","zh":"混咬兽类的化石多见于北美古新世与早始新世的地层。"},{"en":"Some researchers compare mixodectids with early primate relatives when discussing mammal evolution after the dinosaurs.","zh":"在讨论恐龙灭绝后的哺乳动物演化时，有些研究者会把混咬兽类与早期灵长类近亲作比较。"}]}],"synonyms":["Mixodectida","mixodectid mammals"],"phonetic":"ˌmɪksoʊˈdɛktɪdz","extraExplanation":["读到学术文章里的 mixodectids，通常指“混咬兽科成员（复数）”；单数是 mixodectid。","它们不是现代动物的直接“日常同类”，更多出现在古生物学、演化生物学与灵长类起源相关的讨论中。"],"etymology":"源自拉丁化的科学命名：Mixodectidae（科名）来自属名 Mixodectes，加上动物分类学常用后缀 -idae（表示“某某科”）。属名常被解释为由希腊语成分 mixo-（“混合”）等构成，用来表达其特征“像是混合了不同类群的特征”。","mnemonic":["把它拆成 mix + -id：mix（混合）+（一类动物的）-id，联想到“特征看起来有点混合”的古老小哺乳动物。"]}
{"word":"mixologies","summary":{"en":"**mixologies** = plural of **mixology** (cocktail-mixing skill or approaches).","zh":"**mixologies** 是 **mixology（调酒学/调酒技艺）**的复数，可指多种调酒技艺或不同调酒方法体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mixology**: the craft or skill of mixing cocktails (especially in a creative or professional way).","zh":"**mixology** 的复数：指**调制鸡尾酒的技艺/学问**（常强调创意或专业性）。"},"examples":[{"en":"Modern bars often highlight different **mixologies** to show their creativity.","zh":"现代酒吧常展示不同的**调酒风格与技法**来体现创意。"},{"en":"The class compared classic and modern **mixologies** from different countries.","zh":"这门课比较了不同国家的经典与现代**调酒技法/体系**。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, **mixologies** can mean different systems, theories, or “approaches” to mixing drinks (used more in writing or discussion than everyday speech).","zh":"较少见用法：指不同的**调酒体系/理论/方法论**（更常见于讨论或写作，而非日常口语）。"},"examples":[{"en":"The book traces several **mixologies**—from punch traditions to molecular cocktails.","zh":"这本书梳理了多种**调酒体系**——从潘趣酒传统到分子鸡尾酒。"},{"en":"Their menu blends two **mixologies**: Japanese precision and tropical rum culture.","zh":"他们的酒单融合了两种**调酒理念**：日式的精准与热带朗姆文化。"}]}],"synonyms":["cocktail-making techniques","bartending approaches","cocktail styles","mixology approaches"],"phonetic":"mɪkˈsɑːlədʒiz","extraExplanation":["“mixologies”在实际口语中不算常见；更自然的说法通常是：\n- “mixology”作不可数名词：e.g., *I’m studying mixology.*（我在学调酒。）\n- “cocktail styles / approaches / techniques”来表达“不同流派/方法”：e.g., *different cocktail styles*。\n如果你想说“很多杯鸡尾酒的配方/混合物”，一般不用mixologies，而会说 *cocktails*, *recipes*, *drink mixes* 等。"]}
{"word":"mixologist","summary":{"en":"A mixologist is a cocktail expert—someone skilled at creating and mixing drinks, often with a creative or professional focus.","zh":"mixologist 指“鸡尾酒专家/创意调酒师”，强调专业与研发、创意调配鸡尾酒的能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is skilled at making mixed drinks (cocktails), especially in a professional or creative way","zh":"调酒师；（尤指）擅长或以创意著称的鸡尾酒调制师"},"examples":[{"en":"The bar hired a mixologist to design a new cocktail menu.","zh":"这家酒吧聘请了一位调酒师来设计新的鸡尾酒菜单。"},{"en":"She’s known as a mixologist who uses fresh herbs and house-made syrups.","zh":"她以使用新鲜香草和自制糖浆的创意调酒而出名。"},{"en":"Ask the mixologist for something not too sweet.","zh":"可以请调酒师帮你调一杯不要太甜的。"}]}],"synonyms":["bartender","cocktail maker","cocktail specialist"],"phonetic":"/ˌmɪkˈsɑːlədʒɪst/","extraExplanation":["“Mixologist”通常带有“更讲究、更有创意/更专业”的语气，和更中性的“bartender（酒保/酒吧调酒员）”相比，常暗示会研发配方、讲究技法与呈现。","词源上来自“mix（混合）+ -logist（研究/专门从事……的人）”。在现代语境里，有时也会被用来开玩笑或略带调侃，暗示“把调酒说得很高深”。","相关表达：craft cocktail（精酿/手工鸡尾酒）、signature cocktail（招牌鸡尾酒）、cocktail menu（鸡尾酒单）、to mix drinks（调酒）。"]}
{"word":"mixologists","summary":{"en":"skilled cocktail makers (plural).","zh":"擅长调制鸡尾酒的专业人士（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (especially a bartender) who is skilled at creating and mixing cocktails, often with careful attention to flavors, technique, and presentation.","zh":"（尤指酒吧调酒师）擅长设计与调制鸡尾酒的人，常注重风味、技法与呈现。"},"examples":[{"en":"The mixologists at this bar can recommend a cocktail based on your favorite flavors.","zh":"这家酒吧的调酒师会根据你喜欢的风味推荐鸡尾酒。"},{"en":"Two mixologists competed to create the most original drink using local ingredients.","zh":"两位调酒师比赛用本地食材调制最有创意的饮品。"}]},{"partOfSpeech":"n.","definition":{"en":"The plural form of “mixologist.”","zh":"“mixologist”的复数形式。"},"examples":[{"en":"Several mixologists were invited to host a cocktail workshop.","zh":"多位调酒师受邀主持鸡尾酒工作坊。"}]}],"synonyms":["bartenders","cocktail makers","drink mixers","barmen","barmaids"],"phonetic":"/mɪkˈsɑlədʒɪsts/","etymology":"由 mix（混合、调制）+ -ologist（表示“……学/……专家”的后缀）构成；属于较现代的职业称呼，用来强调“调酒的专业与创意”。","mnemonic":["把它拆开记：mix（混合）+ ologist（专家）= “混合饮品的专家”→ 调酒师。","联想中文：鸡尾酒要“mix（混）”出层次感，能做到的人就是“mixologist（调酒专家）”。"]}
{"word":"mixology","summary":{"en":"Mixology means the skill or art of mixing drinks—especially cocktails—often with attention to balance and technique.","zh":"Mixology 指调制饮品（尤指鸡尾酒）的技艺/艺术，常强调风味平衡与制作技巧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The skill or practice of mixing drinks, especially cocktails, by combining spirits, liqueurs, mixers, and other ingredients in a balanced way.","zh":"调酒学；调制饮品（尤指鸡尾酒）的技艺与实践，强调配方、风味平衡与制作方法。"},"examples":[{"en":"She took a weekend class in mixology to learn how to make classic cocktails like the Margarita and the Old Fashioned.","zh":"她参加了一个周末调酒课，学习如何制作玛格丽特和古典鸡尾酒等经典款。"},{"en":"Good mixology isn’t just about alcohol—it’s about balance, aroma, and texture.","zh":"好的调酒不只是把酒混在一起，更讲究风味平衡、香气与口感。"}]},{"partOfSpeech":"n.","definition":{"en":"A creative approach to making cocktails, often involving new ingredients, techniques, or presentation.","zh":"（更偏口语）创意调酒：用新食材、新技法或新呈现方式来制作鸡尾酒。"},"examples":[{"en":"The bar is known for modern mixology, using herbs and house-made syrups.","zh":"这家酒吧以现代创意调酒闻名，会用香草和自制糖浆。"},{"en":"He’s experimenting with mixology—smoke, citrus peels, and unusual bitters.","zh":"他在尝试创意调酒：烟熏、柑橘皮、还有一些少见的苦精。"}]}],"synonyms":["cocktail making","bartending","cocktail craft"],"phonetic":"/mɪkˈsɑlədʒi/","extraExplanation":["“mixology”由“mix（混合）+ -logy（……学/……研究）”组成。它听起来更“专业/讲究”，有时用来强调鸡尾酒制作的技术性与审美（比如比例、香气结构、冰的形态、摇和搅的差别等）。","语气区别：在日常对话里，“bartending（酒吧调酒/酒保工作）”更偏工作与服务；“mixology”更偏“精致调酒/鸡尾酒技艺”。有些人觉得“mixology”略带“卖弄/营销感”，但在高端鸡尾酒吧或课程里也很常用。","相关词：mixologist（调酒师/鸡尾酒调配者，更偏“鸡尾酒专家”的感觉）、cocktail craft（鸡尾酒工艺）、craft cocktails（精酿/手工鸡尾酒）。"]}
{"word":"Mixolydian","summary":{"en":"a major-like musical mode with a lowered seventh","zh":"类似大调但降第七级的调式"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a musical mode (scale pattern) like a major scale but with a lowered 7th note; common in folk, rock, blues, and jazz","zh":"（音乐）混合利底亚调式：类似大调，但第七级音降低半音；常见于民谣、摇滚、布鲁斯与爵士"},"examples":[{"en":"Many blues and rock riffs sound Mixolydian because they use a flat seventh.","zh":"很多布鲁斯和摇滚的即兴段听起来像混合利底亚调式，因为它们用了降七级音。"},{"en":"In G Mixolydian, the notes are like G major, but F is natural instead of F-sharp.","zh":"G混合利底亚的音和G大调很像，但用的是F自然音，而不是F升（F#）。"},{"en":"The teacher asked the class to improvise over a Mixolydian groove.","zh":"老师让同学们在混合利底亚风格的律动上即兴演奏。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or written in the Mixolydian mode","zh":"（形容）与混合利底亚调式有关的；以混合利底亚调式写成的"},"examples":[{"en":"That melody has a distinctly Mixolydian color.","zh":"那段旋律带有很明显的混合利底亚色彩。"},{"en":"Try a Mixolydian scale over a dominant seventh chord.","zh":"在属七和弦上试试混合利底亚音阶。"}]}],"synonyms":["mode","musical mode","Mixolydian mode"],"phonetic":"/ˌmɪk.səˈlɪd.i.ən/","extraExplanation":["学习提示：把它当作“属七和弦的常用音阶”。例如在C7上常用C Mixolydian（相当于F大调音阶从C开始），因为它包含B♭（降七级），更贴合C7的音色。"],"etymology":"源自希腊语 Mixolydios（与古希腊“Lydia 利底亚”相关的调式名称），后来在中世纪与近现代音乐理论中被用来指一种“类似大调但降第七级”的调式。","mnemonic":["记法：Mixolydian = Major（大调）+ lowered 7th（降七级）。看到“Mix-”就联想到“混合”：大调里“混进来”一个降七级音。","口诀：大调把“7”降一格 → 就是Mixolydian（混合利底亚）。"]}
{"word":"mixolydian","summary":{"en":"Mixolydian usually means the musical mode that sounds like a major scale with a lowered 7th (and it can also refer to music written in that mode).","zh":"Mixolydian 通常指“混合利底亚调式”：类似大调但第七音降低；也可指使用该调式的音乐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Mixolydian mode: a musical scale like the major scale but with a lowered (flattened) 7th note.","zh":"与“混合利底亚调式（Mixolydian）”有关：一种音阶，类似大调音阶，但第七音降低（降七度音）。"},"examples":[{"en":"Many blues and rock riffs use a Mixolydian sound, especially over a dominant seventh chord.","zh":"很多布鲁斯和摇滚乐句会用到 Mixolydian 的感觉，尤其是在属七和弦上。"},{"en":"In G Mixolydian, the notes are like G major, but F♯ becomes F natural.","zh":"G Mixolydian 的音与 G 大调很像，但会把 F♯ 变成 F 自然音。"},{"en":"The melody feels bright, but slightly bluesy because of the lowered 7th.","zh":"旋律整体明亮，但因为降七音会带一点布鲁斯/摇滚的味道。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece, passage, or style of music that uses the Mixolydian mode.","zh":"使用混合利底亚调式（Mixolydian）的乐段、乐曲或音乐风格。"},"examples":[{"en":"That chorus is basically in Mixolydian.","zh":"那段副歌基本上就是 Mixolydian 调式。"},{"en":"The guitarist switched to Mixolydian for the solo to match the V7 harmony.","zh":"吉他手在独奏时改用 Mixolydian，以配合属七（V7）和声。"}]}],"synonyms":["Mixolydian mode","dominant scale"],"phonetic":"/ˌmɪk.səˈlɪd.i.ən/","extraExplanation":["记忆小技巧：Mixolydian = “大调音阶 + 降7”。例如 C Mixolydian：C D E F G A B♭ C。","在流行/摇滚里很常见：当和声是“属七和弦”（如 G7）而主音却停在 G 时，用 G Mixolydian 会特别贴合。","词源提示：名称来自古希腊调式命名传统；现代音乐理论里的 Mixolydian 属于七种教会调式之一（Ionian、Dorian、Phrygian、Lydian、Mixolydian、Aeolian、Locrian）。"]}
{"word":"mixoploid","summary":{"en":"Mixoploid describes an organism or tissue that contains a mixture of cells with different chromosome set numbers (different ploidy levels).","zh":"mixoploid 指同一個體或組織中含有不同倍性（不同染色體組數）的細胞，呈現倍性混合／嵌合狀態。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having two or more different chromosome numbers (ploidy levels) within the same individual or tissue; containing a mixture of cells with different ploidy.","zh":"（生物學）指同一個個體或組織中同時存在兩種或以上不同倍性（染色體組數）的細胞；細胞倍性混合的。"},"examples":[{"en":"The plant is mixoploid, so some root-tip cells are diploid while others are polyploid.","zh":"這株植物是倍性嵌合（mixoploid）的，所以有些根尖細胞是二倍體，另一些則是多倍體。"},{"en":"Researchers checked for mixoploid tissues to avoid confusing the genetic results.","zh":"研究人員檢查是否存在倍性嵌合的組織，以免影響基因結果的判讀。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, of an organism) Being a mixoploid individual; an individual whose cells show mixed ploidy.","zh":"（生物學）指「倍性嵌合的個體」；其細胞呈現混合倍性的個體。"},"examples":[{"en":"Some regenerated seedlings turned out to be mixoploid after tissue culture.","zh":"有些再生出的幼苗在組織培養後被證實是倍性嵌合個體（mixoploid）。"}]}],"synonyms":["mosaic (ploidy mosaic)","mixoploid (ploidy-mixed)","heteroploid (broader/less specific)"],"phonetic":"/ˌmɪksoʊˈplɔɪd/","extraExplanation":["「mixoploid」由「mixo-（混合）」+「-ploid（倍性）」組成，常見於植物細胞學與組織培養、誘導多倍體（例如用秋水仙素）之後的檢測。","它和「mosaic（嵌合／馬賽克）」概念相關：mixoploid 強調的是「倍性」的差異（染色體組數不同），不一定是基因序列不同。","相關名詞：mixoploidy（名詞，倍性嵌合／倍性混合狀態）。常見搭配：mixoploid plant/tissue/cells（倍性嵌合的植物／組織／細胞）。"]}
{"word":"mixoploidy","summary":{"en":"Mixoploidy means having cells with different ploidy levels (different chromosome-set numbers) within the same organism.","zh":"Mixoploidy 指同一个体内存在倍性不同（染色体组数不同）的细胞群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(genetics/cell biology) The condition in which one organism contains two or more groups of cells with different chromosome-set numbers (different ploidy levels), such as some cells being diploid and others being triploid or tetraploid.","zh":"（遗传学/细胞生物学）混倍体现象：同一个个体内同时存在两种或多种细胞群，它们的染色体组数（倍性）不同，例如一部分细胞为二倍体，另一部分为三倍体或四倍体。"},"examples":[{"en":"The lab reported mixoploidy when chromosome counts differed between tissues from the same individual.","zh":"当同一个体不同组织的染色体计数不一致时，实验室报告为混倍体（mixoploidy）。"},{"en":"In plants, mixoploidy can appear after treatments that disrupt normal cell division.","zh":"在植物中，干扰正常细胞分裂的处理之后可能出现混倍体现象。"}]}],"synonyms":["ploidy mosaicism","chromosomal mosaicism (broadly)"],"phonetic":"/ˌmɪksoʊˈplɔɪdi/","extraExplanation":["词源拆解：mixo- 表示“混合/混杂”，-ploidy 表示“倍性（染色体组数）”。合起来就是“倍性混合”。","易混概念：mixoploidy 常被放在“嵌合/镶嵌（mosaicism）”的讨论中。通俗理解：一个个体里出现了不同“染色体份数”的细胞群。","常见语境：植物细胞学与育种文献中较常见；医学遗传学里也会提到（例如出现 46/69 或 46/92 等不同细胞系的情况），但属于偏专业术语。"]}
{"word":"mixopterygium","summary":{"en":"a botanical genus in the spindle-tree family.","zh":"卫矛科的一个植物属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (spindle-tree family) found mainly in tropical regions of the Americas.","zh":"（植物）一种卫矛科的开花植物属，主要分布于美洲热带地区。"},"examples":[{"en":"The specimen was identified as Mixopterygium based on its fruit structure.","zh":"研究人员根据果实结构把该标本鉴定为 Mixopterygium 属。"},{"en":"Some Mixopterygium species are studied for their chemical compounds.","zh":"一些 Mixopterygium 属的物种因其化学成分而被研究。"}]}],"phonetic":"/ˌmɪk.soʊpˈtɛr.ɪ.dʒi.əm/","extraExplanation":["这是一个学名（属名），常见于植物分类学论文、标本标签、植物志（flora）等语境中。学名通常用斜体书写，属名首字母大写，如 Mixopterygium sp.（表示该属的某个未定种）。"],"etymology":"源自新拉丁语的植物学命名：mixo- 来自希腊语，表示“混合的”；pteryg- 来自希腊语 pteryx/pterygion，表示“翅、翼”；-ium 是拉丁化属名常见结尾，整体含义大致为“有混合翅状特征的（植物）”。","mnemonic":["把它拆开记：mixo-（mix=混合）+ ptery-（类似“翼/翅”）→“混合翅”的植物属名。","联想中文：mix（混）+ ptery（翅）→“混翅植物”。"]}
{"word":"mixosaurus","summary":{"en":"Mixosaurus is an extinct Triassic ichthyosaur (marine reptile) genus; the name means “mixed lizard.”","zh":"Mixosaurus（混蜥龙属）是三叠纪已灭绝的鱼龙类海生爬行动物属；名称意为“混合的蜥蜴/爬行动物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of small marine reptiles (ichthyosaurs) from the Middle Triassic period, with fin-like limbs and a body form seen as “mixed” between earlier eel-shaped and later dolphin-shaped ichthyosaurs","zh":"混蜥龙属：一种已灭绝的海生爬行动物属（鱼龙类），生活在三叠纪中期；其体型与鳍状四肢被认为呈现“混合”特征，介于早期鳗形鱼龙与后期海豚形鱼龙之间"},"examples":[{"en":"Mixosaurus was an ichthyosaur that lived in the Triassic seas.","zh":"混蜥龙是一种生活在三叠纪海洋中的鱼龙类动物。"},{"en":"Fossils of Mixosaurus help scientists understand how ichthyosaurs evolved over time.","zh":"混蜥龙化石帮助科学家理解鱼龙类如何随着时间演化。"}]}],"synonyms":["(no true synonym; taxonomic name)","ichthyosaur (broader group)"],"phonetic":"ˌmɪksoʊˈsɔrəs","extraExplanation":["“Mixosaurus”来自新拉丁语：mixo- 表示“混合的”，-saurus 表示“蜥蜴/爬行动物”。因此常被译作“混蜥龙”，也有人按意译写成“混合蜥蜴”。","在科普语境里它常被描述为“过渡型”鱼龙：既保留一些较原始的特征，又出现一些更接近后期鱼龙的特征（例如更像“鳍”的前肢结构）。"]}
{"word":"mixotrophic","summary":{"en":"Mixotrophic describes an organism that can both produce its own food and obtain nutrients by consuming organic matter.","zh":"mixotrophic 指“兼性营养的”：生物既能自养（合成有机物），也能异养（摄取有机物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to get energy and nutrients in two ways: by making its own food (like using sunlight or chemical energy) and by consuming organic matter from other organisms.","zh":"（生物）兼性营养的；既能“自养”（如利用光能或化学能合成有机物），又能“异养”（通过摄取其他生物的有机物）来获取能量和养分。"},"examples":[{"en":"Many algae are mixotrophic, so they can photosynthesize and also absorb nutrients from the water.","zh":"许多藻类是兼性营养的，因此既能进行光合作用，也能从水中吸收营养。"},{"en":"In low light, a mixotrophic organism may rely more on eating or absorbing organic material.","zh":"在光照不足时，兼性营养生物可能更依赖摄食或吸收有机物。"},{"en":"Some protists become mixotrophic depending on the environment.","zh":"一些原生生物会因环境条件而表现为兼性营养。"}]}],"synonyms":["mixotrophous","facultatively heterotrophic (context-dependent)","facultatively autotrophic (context-dependent)"],"phonetic":"/ˌmɪk.soʊˈtrɑː.fɪk/","extraExplanation":["词源上可拆解为 mixo-（混合）+ -trophic（营养的、取食方式的）。因此它强调“营养来源是混合的”。","学习时可以和两个对照概念一起记：autotrophic（自养的）指主要靠自己制造有机物；heterotrophic（异养的）指主要靠摄取他者获得有机物；mixotrophic 介于两者之间，会随环境（光照、营养盐、猎物多少）切换比例。","常见语境在生态学/微生物学：湖泊、海洋中的浮游生物（如某些藻类、甲藻、原生生物）在不同季节或水层条件下可能更偏向“光合”或更偏向“摄食”。"]}
{"word":"mixotrophous","summary":{"en":"having both autotrophic and heterotrophic nutrition","zh":"兼具自养与异养的（混合营养的）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to obtain energy and carbon both by making its own food (like photosynthesis) and by consuming organic matter (like eating or absorbing other organisms).","zh":"（生物）既能自养（如光合作用）又能异养（摄食或吸收有机物）获取能量与碳源的。"},"examples":[{"en":"Many protists are mixotrophous, switching between photosynthesis and feeding depending on light.","zh":"许多原生生物是混合营养的，会根据光照条件在光合作用与摄食之间切换。"},{"en":"In nutrient-poor waters, mixotrophous algae may survive by absorbing dissolved organic compounds.","zh":"在贫营养水域，混合营养藻类可能通过吸收溶解的有机化合物来存活。"}]}],"synonyms":["mixotrophic","facultative heterotrophic","facultative autotrophic"],"phonetic":"/mɪkˈsɑːtrəfəs/","extraExplanation":["该词多用于生态学、微生物学与海洋生物学语境，常用来描述某些藻类、原生生物或细菌在不同环境条件下“既能光合也能取食”的生存策略。","拼写提示：mixotrophous 在学术写作中相对少见，更常见的是 mixotrophic；两者意义相同。"],"etymology":"源自希腊语构词：mixo-（混合）+ troph-（营养、取食）+ -ous（形容词后缀）。常见同义形为 mixotrophic。","mnemonic":["把它拆开记：mixo=“混合”，troph=“营养/吃”，合起来就是“混合营养”。","联想中文：混（mix）+营养（troph），环境变了就“混着吃”。"]}
{"word":"mixt","summary":{"en":"“Mixt” is an archaic/poetic form of “mixed,” meaning combined or blended.","zh":"“mixt”是“mixed”的古语/诗歌用法，意思是“混合的、融合的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or poetic) mixed; combined from different things.","zh":"（古语或诗歌用法）混合的；由不同事物结合而成的。"},"examples":[{"en":"In older poems, you may see “mixt” where modern English would use “mixed.”","zh":"在较早的诗歌里，你可能会看到“mixt”，而现代英语会用“mixed”。"},{"en":"The air was mixt with smoke and sea-salt.","zh":"空气中混杂着烟味和海盐味。"}]},{"partOfSpeech":"v.","definition":{"en":"(Archaic) past participle form of “mix,” meaning “to mix.”","zh":"（古语）“mix”的过去分词形式，意为“混合；搅拌”。"},"examples":[{"en":"The ingredients are well mixt before baking.","zh":"烘烤前把配料充分混合。"},{"en":"He mixt truth with rumor in his story.","zh":"他在故事里把真相和传闻混在一起。"}]}],"synonyms":["mixed","blended","combined","mingled"],"phonetic":"/mɪkst/","extraExplanation":["“mixt”是“mixed”的旧式拼写/旧式过去分词，常见于17–19世纪的文学、诗歌或宗教文本中。现代标准英语通常用“mixed”。","之所以会出现“mixt”，与早期英语中用“-t”表示过去式/过去分词的习惯有关（类似于“blest”=“blessed”、“drest”=“dressed”），在诗歌里也常用于贴合韵律与节奏。"]}
{"word":"mixte","summary":{"en":"“Mixte” is a French-borrowed word meaning “mixed,” used mostly in formal or bilingual contexts.","zh":"“mixte”是借自法语的词，意思相当于“mixed（混合的）”，多用于正式或双语语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Borrowed from French) mixed; made up of different types or groups (often used in official names or descriptions, e.g., “commission mixte,” “équipe mixte”).","zh":"（源自法语）混合的；由不同类型或群体组成的（常用于正式名称或描述中，如“commission mixte（联合委员会）”“équipe mixte（混合队/男女混合队）”）。"},"examples":[{"en":"The two countries formed a commission mixte to manage the border project.","zh":"两国成立了一个commission mixte（联合委员会）来管理边境项目。"},{"en":"She competed in the mixed doubles event, sometimes listed as “double mixte” in French materials.","zh":"她参加了混合双打项目，在法语资料里有时写作“double mixte”。"}]}],"synonyms":["mixed","coed","combined"],"phonetic":"/mɪkst/","extraExplanation":["“mixte”在英语里不算常用词，更多是出现在法语影响较强的语境中（如加拿大、国际组织文件、双语公告、赛事项目名称等）。在普通英语表达中，通常直接用“mixed”（如 mixed team / mixed commission / mixed housing）。","发音上英语使用者一般按“mixed”的简化读法来念（类似“mikst”）。如果你是在读法语文本，“mixte”的法语发音会不同。"]}
{"word":"mixtec","summary":{"en":"Mixtec refers to (1) a Mixtec person, (2) the Mixtec languages, or (3) something related to Mixtec culture.","zh":"Mixtec 可指（1）米斯特克人，（2）米斯特克语（群），或（3）与米斯特克文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people from the Mixteca region of southern Mexico (mainly Oaxaca, Puebla, and Guerrero).","zh":"米斯特克人；来自墨西哥南部米斯特卡（Mixteca）地区的原住民族群成员（主要在瓦哈卡、普埃布拉与格雷罗一带）。"},"examples":[{"en":"Many Mixtec families have lived in Oaxaca for generations.","zh":"许多米斯特克家庭在瓦哈卡世世代代生活。"},{"en":"The museum exhibit includes Mixtec textiles and goldwork.","zh":"博物馆展览包含米斯特克的纺织品与金工艺术。"}]},{"partOfSpeech":"n.","definition":{"en":"any of several closely related Indigenous languages spoken by Mixtec communities; often called “Mixtec” collectively.","zh":"米斯特克语（群）；米斯特克社区使用的一组彼此相关的原住民语言，常统称为“Mixtec”。"},"examples":[{"en":"She speaks Mixtec at home and Spanish at school.","zh":"她在家说米斯特克语，在学校说西班牙语。"},{"en":"The clinic offers interpretation in Mixtec.","zh":"这家诊所提供米斯特克语口译服务。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mixtec people, languages, or culture.","zh":"米斯特克的；与米斯特克人、语言或文化有关的。"},"examples":[{"en":"He’s researching Mixtec history and migration.","zh":"他在研究米斯特克的历史与迁移。"},{"en":"They organized a Mixtec cultural festival.","zh":"他们举办了米斯特克文化节。"}]}],"synonyms":["Mixteco (Spanish)","Mixtec language(s)","Mixtec people"],"phonetic":"/ˈmiːstɛk/","extraExplanation":["“Mixtec”常见读音类似“米—斯特克”（MEE-stek）。在社区与学术语境中，“Mixtec languages（米斯特克语群）”很常用，因为不同地区的米斯特克语差异可能很大，未必彼此完全互通。","有些米斯特克人也会用自己语言中的称呼来指代族群与语言，例如“Tu’un Savi”（常被解释为“雨之语/雨之人”的相关含义）。在尊重当事人自称的前提下，使用他们偏好的名称通常更得体。","在美国的医疗、学校、法律服务等场景里，你可能会看到“Mixtec interpreter（米斯特克语口译员）”或“Mixtec-speaking（说米斯特克语的）”这样的表达；如果需要更准确，最好询问对方具体是哪一种米斯特克变体（来自哪个城镇/地区）。"]}
{"word":"mixtecan","summary":{"en":"Mixtecan refers to the Mixtec people’s languages/culture, and also to the Mixtecan language family in Mexico.","zh":"Mixtecan 可指与米斯特克人语言/文化有关的，也可指墨西哥的米斯特坎语系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Mixtec people of southern Mexico, especially their languages and culture.","zh":"与墨西哥南部的米斯特克人（Mixtec）有关的，尤指其语言与文化。"},"examples":[{"en":"She is learning a Mixtecan language spoken in Oaxaca.","zh":"她正在学习一种在瓦哈卡州使用的米斯特坎语系语言。"},{"en":"The museum displayed Mixtecan artwork and manuscripts.","zh":"博物馆展出了米斯特坎艺术品和手稿。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mixtecan language family (a group of related Indigenous languages of Mexico), including Mixtec and related languages.","zh":"米斯特坎语系（墨西哥的一个原住民语言语系），包括米斯特克语及其近缘语言。"},"examples":[{"en":"Mixtecan includes many distinct languages, not just one.","zh":"米斯特坎并不只是一种语言，而是包含许多不同的语言。"}]}],"synonyms":["Mixtec (often used more generally)"],"phonetic":"/mɪkˈstiːkən/","extraExplanation":["“Mixtecan”常见于语言学与人类学语境：它通常指一个“语系/语族”（language family），而不是单一语言。日常生活里更常见的说法是“Mixtec（米斯特克人/米斯特克语）”。","写法提示：专名一般要大写（Mixtecan）。在学术写作中可见搭配如“Mixtecan languages（米斯特坎语系诸语言）”、“Mixtecan-speaking communities（讲米斯特坎语系语言的社区）”。"]}
{"word":"mixtiform","summary":{"en":"Mixtiform means “having a mixed form or character,” often used in formal description.","zh":"mixtiform 指“具有混合形态或混合性质的”，多用于较正式的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a mixed form or character; made up of different kinds or elements.","zh":"混合形态的；具有混合性质的；由不同成分构成的。"},"examples":[{"en":"The museum’s newest exhibit is mixtiform, combining sculpture, sound, and digital projection.","zh":"博物馆最新的展览呈混合形态，把雕塑、声音和数字投影结合在一起。"},{"en":"Her essay takes a mixtiform approach—part personal story, part academic analysis.","zh":"她的文章采用混合式写法——一部分是个人叙事，一部分是学术分析。"}]}],"synonyms":["mixed","hybrid","composite","heterogeneous","multiform"],"phonetic":"/ˈmɪkstiˌfɔrm/","extraExplanation":["“mixtiform”比较少见，常见于较正式或描述性写作中。意思接近“mixed / hybrid”，但语气更书面、强调“形态或性质是混合的”。","构词上可理解为 mixt-（来自 mix / Latin mixtus“混合的”）+ -form（“形状/形式”）。因此它字面上就是“混合形态的”。","它不是常见的拼字游戏（如 Scrabble）标准词条，但在一些词典/词汇表里确实能查到。"]}
{"word":"mixtilineal","summary":{"en":"Mixtilineal means “made from a mix of straight and curved lines,” and it’s a rare variant of mixtilinear.","zh":"Mixtilineal 指“由直线与曲线等混合线条构成的”，是 mixtilinear 的较罕见异体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(geometry, architecture) Made of or combining different kinds of lines—especially straight and curved lines.","zh":"（几何/建筑）由不同类型的线条构成或组合而成的，尤指直线与曲线混合。"},"examples":[{"en":"The window frame has a mixtilineal outline, with straight sides that flow into a gentle curve at the top.","zh":"这个窗框的轮廓是混合线形的：两侧是直线，上端过渡为柔和的弧线。"},{"en":"A mixtilineal angle can be formed by a straight line meeting a curve.","zh":"混合线角可以由一条直线与一条曲线相交形成。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Same as mixtilinear; containing mixed straight and curved parts.","zh":"（罕用）同 mixtilinear；含有直线与曲线等混合部分的。"},"examples":[{"en":"Older dictionaries sometimes list mixtilineal as a variant spelling of mixtilinear.","zh":"一些较早的词典会把 mixtilineal 作为 mixtilinear 的异体拼写收录。"}]}],"synonyms":["mixtilinear","mixed-line","curvilinear (partly, depending on context)"],"phonetic":"/ˌmɪk.stɪˈlɪn.i.əl/","extraExplanation":["这个词在现代英语里很少见，更多时候会用 **mixtilinear**（更常用）来表达同一个意思。","它常出现在较旧的几何/建筑语境中：例如描述一种装饰性的“混合线形拱”（mixtilinear arch），其内缘由直线段与曲线段拼接而成。","词源可拆成：拉丁语 **mixtus**（混合的）+ 英语 **lineal/linear**（线的）。"]}
{"word":"mixtilinear","summary":{"en":"Mixtilinear means “combining straight and curved lines,” often used in geometry (e.g., a mixtilinear incircle).","zh":"mixtilinear 表示“直线与曲线混合构成的”，常用于几何语境（如混合线形内切圆）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made of a mixture of straight lines and curved lines; having a boundary that combines linear and curved parts","zh":"由直线与曲线混合构成的；边界同时包含直线段与曲线段的"},"examples":[{"en":"The design uses a mixtilinear outline—straight edges connected by smooth arcs.","zh":"这个设计采用混合线形的轮廓——直边与平滑的弧线相连。"},{"en":"A mixtilinear figure can look more natural than a purely polygonal one.","zh":"混合线形的图形看起来可能比纯多边形更自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"(geometry) describing a circle or region related to a triangle that is bounded partly by line segments (from the triangle’s sides) and partly by a circular arc (from the triangle’s circumcircle), as in a mixtilinear incircle","zh":"（几何）指与三角形有关、边界一部分来自三角形的边（直线段），另一部分来自三角形外接圆（圆弧）的圆或区域；如“混合线形内切圆（mixtilinear incircle）”"},"examples":[{"en":"In an Olympiad problem, the mixtilinear incircle is tangent to two sides of the triangle and to the circumcircle’s arc.","zh":"在竞赛题中，混合线形内切圆同时与三角形两边以及外接圆的一段圆弧相切。"},{"en":"The mixtilinear region is bounded by two sides and an arc of the circumcircle.","zh":"这个混合线形区域由两条边和外接圆的一段圆弧围成。"}]}],"synonyms":["curvilinear-and-linear","mixed-line","mixed linear-curved"],"phonetic":"/ˌmɪkstiˈlɪniɚ/","extraExplanation":["这个词最常见于几何（尤其是竞赛几何）。拆开看：mix（混合）+ linear（线性的）→ 表示“直线与曲线混在一起”。所以它强调的是“边界的构成方式”，而不是形状有多复杂。","在三角形几何里常见搭配是 mixtilinear incircle（混合线形内切圆）：它与三角形的两条边相切，同时也与外接圆的一段圆弧相切，因此相关区域的边界自然就是“直线段 + 圆弧”的组合。","注意不要和 multilinear（多重线性的，常见于代数/机器学习）混淆：multi- 是“多”，mix- 是“混合”。"]}
{"word":"mixtilion","summary":{"en":"Mixtilion is an obsolete word meaning mixed grain, especially rye and wheat together.","zh":"Mixtilion 是一个已废用的词，意思是混合谷物，尤指黑麦与小麦的混合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Obsolete) A mixture of grains (especially rye and wheat) grown or used together.","zh":"（已废用）混合谷物，尤指黑麦与小麦的混合（一起种植或一起使用）。"},"examples":[{"en":"In some older farming records, farmers sowed mixtilion to reduce the risk of crop failure.","zh":"在一些较早的农业记录里，农民会播种 mixtilion，以降低歉收风险。"},{"en":"The mill bought a small amount of mixtilion—rye and wheat mixed in the same sack.","zh":"那家磨坊收购了一小批 mixtilion——一袋里把黑麦和小麦混在一起。"}]}],"synonyms":["meslin","mixed grain","grain mixture"],"phonetic":"/mɪkˈstɪliən/","extraExplanation":["这是一个很少见、偏历史语境的词（标注为 obsolete）。现代英语里更常见的对应说法是 **meslin**（指黑麦与小麦的混合谷物/混播）。","容易和 **mixtion**（“混合；混合物”，也偏古旧/专门用法）或更常见的 **mixture**（“混合；混合物”）混淆：mixtilion 专指“混合谷物”这一类东西。","如果你是在写作或考试中想表达“混合谷物/杂粮”，更自然的现代说法通常是：mixed grain(s)、a mix of rye and wheat，或直接用 meslin（更书面/历史）。"]}
{"word":"mixtion","summary":{"en":"Mixtion is an uncommon, often archaic word meaning “mixing” or “a mixture,” and it can also mean a gilding adhesive used for gold leaf.","zh":"Mixtion 是较少见、常属古用的词，意思是“混合/混合物”；在贴金工艺中也可指“贴金用黏合剂（贴金胶）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) the act or process of mixing; the state of being mixed","zh":"（古义）混合的行为或过程；混合的状态"},"examples":[{"en":"The recipe requires careful mixtion of flour and water.","zh":"这份配方需要把面粉和水仔细混合。"},{"en":"In older writing, “mixtion” can mean the process of blending things together.","zh":"在较早的文字中，“mixtion”可以指把事物混合在一起的过程。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) a mixture; something produced by mixing","zh":"（古义）混合物；混合后形成的东西"},"examples":[{"en":"The potion was a strange mixtion of herbs and spices.","zh":"那种药水是由草药和香料组成的奇怪混合物。"},{"en":"The essay describes a mixtion of old and new ideas.","zh":"这篇文章描述了新旧观念的混合。"}]},{"partOfSpeech":"n.","definition":{"en":"(art / gilding) an adhesive (often amber- or oil-based) used to attach gold leaf","zh":"（艺术/贴金）用于粘贴金箔的黏合剂（常见为琥珀或油性配方）"},"examples":[{"en":"The frame was gilded with gold leaf applied over mixtion.","zh":"这个画框用金箔贴金，金箔是涂在贴金胶（mixtion）之上的。"}]}],"synonyms":["mixture","mixing","blend","combination","amalgamation"],"phonetic":"/ˈmɪkstʃən/","extraExplanation":["“mixtion”在现代英语里很少见，常被标注为 obsolete/archaic（过时/古用）。日常表达通常用“mixture”（混合物）或“mixing”（混合过程）。","在艺术领域（尤其是“oil gilding”油贴金/贴金工艺）里，“mixtion”更像一个技术词，指用来“粘住金箔”的贴金胶/黏结层，因此你可能在工艺书、修复说明或欧洲传统技法里见到。","词源来自拉丁语 mixtio（混合），与“mix / mixture”同源；拼写上容易被误认为是“mixture”的变体。"]}
{"word":"mixtura","summary":{"en":"Mixtura is a rare Latin-based word meaning a mixture, especially a compounded medicinal liquid.","zh":"Mixtura 是一个较少见、源自拉丁语的词，意思是“混合物”，尤指配制的液体合剂（药水）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; pharmacy/Latin) a medicinal mixture, especially a liquid medicine made by combining several ingredients; essentially “mixture.”","zh":"（少见；药学/拉丁语）药剂混合物，尤指把多种成分配成的液体药水；相当于“mixture（混合剂/合剂）”。"},"examples":[{"en":"The prescription was labeled “Mixtura,” indicating a compounded liquid medicine.","zh":"处方上标注“Mixtura”，表示这是一种配制的液体合剂。"},{"en":"In older medical texts, a cough mixtura might include several soothing ingredients.","zh":"在较早的医学文献中，止咳合剂（mixtura）可能会包含多种舒缓成分。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, general) a mixture or blend of different things.","zh":"（少见，泛指）混合物；混合搭配。"},"examples":[{"en":"The dish is a mixtura of sweet and spicy flavors.","zh":"这道菜是甜味与辣味的混合。"},{"en":"Her playlist is a mixtura of pop, jazz, and classical music.","zh":"她的歌单是流行、爵士和古典的混搭。"}]}],"synonyms":["mixture","blend","compound","concoction"],"phonetic":"/mɪkˈstʃʊrə/","extraExplanation":["“mixtura”源自拉丁语，常见于旧式处方或药学拉丁文中，现代英语里更常用“mixture”或更具体的剂型名称（如 syrup, solution, suspension）。","在一些语境里它带有“较正式/古典/专业”的色彩；日常表达建议用“mixture / blend”。"]}
{"word":"mixture","summary":{"en":"Mixture means a blend of different substances or a combination of different qualities or feelings.","zh":"Mixture 指不同物質的混合物，也可指不同特質或情緒的交織與結合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A combination of two or more substances or things blended together.","zh":"（兩種或以上物質或事物的）混合物；混合體。"},"examples":[{"en":"The recipe calls for a mixture of flour, sugar, and eggs.","zh":"這個食譜需要把麵粉、糖和雞蛋混合在一起。"},{"en":"The air is a mixture of gases.","zh":"空氣是多種氣體的混合物。"}]},{"partOfSpeech":"n.","definition":{"en":"A combination of different qualities, feelings, or types within one person or situation.","zh":"（性格、情緒、特質或情況的）混合；交織。"},"examples":[{"en":"She felt a mixture of excitement and nervousness before the interview.","zh":"面試前她感到又興奮又緊張。"},{"en":"The city is a mixture of old traditions and modern life.","zh":"這座城市融合了古老傳統與現代生活。"}]}],"synonyms":["blend","combination","mix","medley"],"phonetic":"/ˈmɪkstʃɚ/","extraExplanation":["「mixture」常和介系詞 of 搭配：a mixture of A and B / a mixture of A, B, and C。","在科學語境裡，「mixture（混合物）」通常指不發生化學反應、成分仍各自存在的組合；相對地，「compound（化合物）」是經由化學反應形成的新物質。"]}
{"word":"mixtures","summary":{"en":"“Mixtures” is the plural of “mixture”: combinations of substances or different elements (like people, ideas, or qualities).","zh":"“mixtures”是“mixture”的复数：指物质的混合物，或不同元素（人、观点、品质等）的混合/交融。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A combination of two or more substances or things put together, where each part is still present (not chemically changed into a new substance).","zh":"（两种或多种物质/事物的）混合物；混合体（各成分仍然存在，未化学反应生成新物质）。"},"examples":[{"en":"The salad is a mixture of fresh vegetables and herbs.","zh":"这份沙拉是新鲜蔬菜和香草的混合。"},{"en":"Air is a mixture of different gases.","zh":"空气是多种气体的混合物。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular blend of different types of people, ideas, qualities, or activities.","zh":"（不同人群/观点/品质/活动的）混合；交融。"},"examples":[{"en":"The city has a mixture of old traditions and modern lifestyles.","zh":"这座城市融合了古老传统与现代生活方式。"},{"en":"Her speech was a mixture of humor and seriousness.","zh":"她的演讲既幽默又严肃。"}]}],"synonyms":["blends","combinations","mixes"],"phonetic":"/ˈmɪkstʃɚz/","extraExplanation":["“mixture”常用于科学与日常语境。科学里常对比：mixture（混合物）vs. compound（化合物）。混合物可以用物理方法分离（如过滤、蒸发），化合物通常需要化学方法分解。","在烹饪里很常见：cake mix（蛋糕预拌粉）、spice mixture（香料混合）、trail mix（什锦坚果/果干）。","数词搭配很地道：a mixture of A and B（A和B的混合）；a mixture of emotions（复杂情绪）。"]}
{"word":"mixtus","summary":{"en":"Mixtus is a Latin-based term meaning “mixed,” used mainly in specialized or quoted contexts.","zh":"mixtus 是拉丁语词，意为“混合的”，多用于专业语境或引用中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English in academic, legal, medical, or scientific contexts) mixed; mingled; combined from different parts.","zh":"（拉丁语；在英语的学术/法律/医学/科学语境中使用）混合的；掺杂的；由不同部分组成的。"},"examples":[{"en":"The phrase “status mixtus” is sometimes used to describe a mixed or transitional legal status.","zh":"短语“status mixtus”有时用来描述一种混合的或过渡性的法律身份。"},{"en":"In older medical writing, “mixtus” may appear to mean a medicine made from several ingredients.","zh":"在较早的医学写作中，“mixtus”可能用来表示由多种成分配制的药剂。"}]},{"partOfSpeech":"n.","definition":{"en":"a mixture (rare; mainly in Latin quotations or specialized writing).","zh":"混合物（较少见；主要出现在拉丁文引语或专业写作中）。"},"examples":[{"en":"The manuscript uses Latin terms, including “mixtus,” to label a mixture.","zh":"这份手稿使用拉丁术语，包括用“mixtus”来标注一种混合物。"}]}],"synonyms":["mixed","mingled","combined","mixture"],"phonetic":"/ˈmɪkstəs/","extraExplanation":["“mixtus”源自拉丁语动词“miscēre”（混合）。它不是现代英语里常用的日常词汇，更常见于拉丁短语、旧式处方或学术文本中。","在一些旧式处方/药学语境里，你可能会看到缩写“mixt.”，表示“mixture（合剂/混合药剂）”。现代英语更常用的是“mixed”“mixture”等。"]}
{"word":"mixup","summary":{"en":"Mix-up means a mistake or confusion caused by mixing things up (like times, names, or information).","zh":"Mix-up 指因为把事情弄混而造成的“差错/混乱”，常见于时间、名字或信息等被搞错的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mistake or confusion where two or more things are mixed incorrectly (for example, people, names, times, or information).","zh":"把两件或多件事弄混、弄错（例如把人、名字、时间或信息搞混）。"},"examples":[{"en":"There was a mix-up with my appointment time, so I came an hour early.","zh":"我的预约时间出了个差错，所以我早到了一小时。"},{"en":"Sorry for the mix-up—I emailed the wrong person.","zh":"抱歉弄错了——我把邮件发给了不该发的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation in which things become disorganized or confusing because they are mixed together or handled incorrectly.","zh":"由于混在一起或处理不当而导致的混乱、乱套的情况。"},"examples":[{"en":"The labels fell off the boxes, causing a mix-up in the warehouse.","zh":"箱子上的标签掉了，导致仓库里出现了混乱。"},{"en":"The new system reduced mix-ups in customer orders.","zh":"新系统减少了客户订单的出错与混乱。"}]}],"synonyms":["confusion","mistake","mixing-up","misunderstanding","error"],"phonetic":"/ˈmɪkˌsʌp/","extraExplanation":["“mix-up”通常指“弄错/搞混”带来的小事故或不便，语气一般比“disaster（灾难）”轻很多，常用于道歉或解释原因：Sorry for the mix-up.","写法上常见两种：mix-up（带连字符）和 mixup（不带连字符）。在比较正式的写作里，mix-up 更常见；口语或非正式文本里 mixup 也很常见。","搭配很常用：a mix-up with…（在……上出了差错/搞混了），例如 a mix-up with the schedule（时间表弄错了）。"]}
{"word":"mixups","summary":{"en":"Mixups are confusions or mistakes caused by things getting mixed or misunderstood.","zh":"mixups 指因混淆、误解或调度混乱造成的差错/乌龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation where people or things get confused, swapped, or misunderstood, causing a mistake or an awkward result.","zh":"（人或事物）被弄混、搞错或误会而造成的错误/尴尬局面。"},"examples":[{"en":"There was a mix-up with the reservations, so we didn’t get a table.","zh":"订位出了差错，所以我们没拿到座位。"},{"en":"Because of a mix-up in emails, both teams went to the wrong address.","zh":"由于邮件沟通出了岔子，两组人都去了错误的地址。"},{"en":"Sorry about the mix-up—I thought you meant Friday, not Thursday.","zh":"抱歉弄错了——我以为你说的是周五，不是周四。"}]}],"synonyms":["confusion","mistake","misunderstanding","mix-up","error"],"phonetic":"/ˈmɪkˌsʌps/","extraExplanation":["“mix-up”更常见的写法是带连字符的 mix-up（复数 mix-ups）。口语里也常写成不带连字符的 mixup，意思相同。","常见搭配：a mix-up with sth（某事出了差错/弄混了）；a mix-up between A and B（把A和B搞混）；clear up a mix-up（澄清误会/纠正差错）。","语气通常比“mistake”更轻一些，常暗示是沟通、安排或信息上的混乱导致的，并非严重过错。"]}
{"word":"mixy","summary":{"en":"Mixy is an uncommon adjective meaning either “suitable for mixing” or (informally) “friendly and sociable.”","zh":"mixy 是一个不太常见的形容词，可指“适合混合的”，也可在非正式语境中指“外向合群的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(mainly UK) suitable for mixing; designed so different things can be mixed together.","zh":"（主要英式）适合混合的；为“混合在一起”而设计或改装的。"},"examples":[{"en":"Use a mixy paint that blends well with other colors.","zh":"用一种很“mixy”的颜料，这样更容易和其他颜色融合。"},{"en":"The recipe needs a mixy batter so the chocolate spreads evenly.","zh":"这个食谱需要一种容易搅拌融合的面糊，这样巧克力才能均匀分布。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) friendly and outgoing; sociable (someone who likes to mingle).","zh":"（非正式）爱社交的；外向合群的（喜欢与人打成一片）。"},"examples":[{"en":"She’s very mixy at parties and makes everyone feel included.","zh":"她在聚会上特别合群，会让每个人都感觉被接纳。"},{"en":"He’s not that mixy with strangers, but warms up quickly.","zh":"他对陌生人没那么外向，但很快就会放开。"}]}],"synonyms":["mixed","blended","combined","sociable","outgoing"],"phonetic":"/ˈmɪksi/","extraExplanation":["“mixy”不是高频词，更常见的表达是 **mixed**（混合的）或 **sociable/outgoing**（外向的）。在不同语境里，“Mixy”也可能是品牌名/产品名/用户名（例如应用、饮品相关产品等），这时通常不按词义翻译，而是当作专有名词使用。"]}

