{"word":"mizar","summary":{"en":"Mizar is the traditional name of a star in Ursa Major (the Big Dipper). It can also be used as a rare personal name.","zh":"Mizar 是大熊座（北斗七星）中一颗恒星的传统名称（中文常译“开阳”）；也可作为较少见的人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a star in the constellation Ursa Major (in the Big Dipper), traditionally called Mizar","zh":"位于大熊座（北斗七星“斗柄”附近）的一颗恒星，传统名称为“开阳星（Mizar）”"},"examples":[{"en":"On a clear night, you can try to find Mizar in the Big Dipper.","zh":"在晴朗的夜晚，你可以试着在北斗七星里找到开阳星（Mizar）。"},{"en":"Mizar and Alcor are often mentioned together in skywatching guides.","zh":"在观星指南里，开阳星（Mizar）和辅星（Alcor）经常被一起提到。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (used rarely), taken from the star’s name","zh":"人名（较少见），取自这颗恒星的名称"},"examples":[{"en":"Their baby’s name, Mizar, was inspired by astronomy.","zh":"他们给宝宝取名“Mizar”，灵感来自天文学。"}]}],"synonyms":["Mizar (proper name; no true synonym)","the Mizar star"],"phonetic":"/ˈmaɪzɑr/","extraExplanation":["“Mizar”常见于天文语境中，在中文里常译作“开阳”。它在北斗七星里很容易作为定位点使用。","观星时，人们常把“Mizar”和旁边较暗的“Alcor（辅星）”一起看：在光污染较少的地方，能否用肉眼分辨它们曾被当作视力好坏的趣味测试。","词源来自阿拉伯语传统星名，许多亮星的英文名称都保留了阿拉伯语音译的痕迹。"]}
{"word":"mize","summary":{"en":"“Mize” is South African slang meaning either “ignore (someone)” or “chill/hang out.”","zh":"“mize”是南非英语俚语，常指“无视某人”，也可指“放松/待着/消磨时间”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal, South African English) To deliberately ignore someone or something; to act like you didn’t see/hear them.","zh":"（非正式，南非英语俚语）故意无视某人或某事；装作没看见/没听见。"},"examples":[{"en":"I said hi, but she mized me.","zh":"我跟她打招呼，但她直接无视我。"},{"en":"Don’t mize your emails—reply when you can.","zh":"别无视邮件——有空就回一下。"},{"en":"He waved at them and got mized.","zh":"他向他们挥手，结果被无视了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal, South African English) To chill, relax, or hang out (usually somewhere).","zh":"（非正式，南非英语俚语）放松、消磨时间、待着/聚会（常指在某处）。"},"examples":[{"en":"We’re just mizing at home tonight.","zh":"我们今晚就宅家放松。"},{"en":"They were mizing outside after class.","zh":"他们下课后在外面闲聊放松。"}]}],"synonyms":["ignore","snub","blank (someone)","ghost (someone)","chill","hang out","relax"],"phonetic":"/maɪz/","extraExplanation":["“mize”主要见于南非英语口语/俚语（Mzansi slang）。在美国英语里不常用，所以如果你在美国语境使用，别人可能听不懂或以为是拼写错误。","常见变体/写法有：miza、maiza；常见词形：mized（过去式）、mizing（进行式）。","别和法语“miser”（/miˈze/，意为“下注”）混淆；另外“Mize”也常见作姓氏或地名。"]}
{"word":"mizen","summary":{"en":"Mizen is a less common spelling of mizzen: the rear sail (or the rear mast) on a sailing ship.","zh":"mizen 是 mizzen 的较少见拼写：指帆船上的后桅帆，或后桅（后方的那根桅杆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fore-and-aft sail set on the mizzenmast (the rear mast) of a sailing vessel","zh":"（帆船上）装在后桅（mizzenmast / mizenmast）上的纵帆（前后向的帆）"},"examples":[{"en":"On the ketch, they raised the mizen to help the boat balance in a crosswind.","zh":"在双桅帆船上，他们升起后桅帆来帮助船在侧风中保持平衡。"},{"en":"The crew trimmed the mizen sail to steady the helm.","zh":"船员调整后桅帆，使舵感更稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"the mizzenmast itself; the mast aft (toward the back) of the mainmast on certain sailing ships","zh":"后桅；（某些帆船上）位于主桅后方、靠船尾的那根桅杆"},"examples":[{"en":"A light was hung near the mizen to make the boat visible at night.","zh":"一盏灯挂在后桅附近，让船在夜里更显眼。"},{"en":"He climbed the mizen mast carefully to check the rigging.","zh":"他小心地爬上后桅检查索具。"}]},{"partOfSpeech":"adj.","definition":{"en":"of or relating to the mizzenmast or its sail/rigging","zh":"后桅的；与后桅（及其帆/索具）有关的"},"examples":[{"en":"The mizen boom swung slightly as the wind shifted.","zh":"风向变化时，后桅横桁轻轻摆动。"}]}],"synonyms":["mizzen","mizzenmast","mizenmast"],"phonetic":"/ˈmɪzən/","extraExplanation":["“mizen”是“mizzen”的较少见拼写（航海用语里更常见的是 mizzen）。两者读音与意思相同。","它常出现在船只装备/索具的搭配里：mizen/mizzen mast（后桅）、mizen/mizzen sail（后桅帆）、mizen/mizzen boom（后桅横桁）等。"]}
{"word":"mizenmast","summary":{"en":"A mizzenmast is the rearmost mast on a sailing ship.","zh":"mizzenmast 指帆船上最靠船尾的那根桅杆（后桅）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"On a sailing ship, the mast that is farthest toward the back (stern).","zh":"在帆船上，位于最后方（靠近船尾）的桅杆。"},"examples":[{"en":"The crew hoisted a small sail on the mizzenmast to help balance the boat in strong wind.","zh":"船员在后桅上升起一面小帆，帮助船只在大风中保持平衡。"},{"en":"From the deck, you could see the mainmast rising in the middle and the mizzenmast nearer the stern.","zh":"从甲板上看，主桅立在船体中部，而后桅更靠近船尾。"}]}],"synonyms":["mizzen mast (variant spelling)","aft mast"],"phonetic":"/ˈmɪzənˌmæst/","extraExplanation":["拼写提示：更常见的拼写是 **mizzenmast**（两个 z）。有时也会看到较少用的写法，但在词典与航海资料中以 mizzenmast 为主。","使用场景：这个词主要出现在航海、历史船只或文学描写中。现代人日常对话里不常用，但读到海洋题材小说时很常见。","相关词：**mainmast（主桅）**通常在中部；**foremast（前桅）**在前部；**mizzen（后桅帆/后部的）**常用作形容词或名词（如 mizzen sail）。"]}
{"word":"mizens","summary":{"en":"**mizens** = plural of *mizen/mizzen* (a rear sail, or less commonly a rear mast, on a sailing ship).","zh":"**mizens** 是 *mizen/mizzen* 的复数：指帆船上的后帆（较少见时也可指后桅）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) plural of **mizen/mizzen**: the aft (rear) sail set on a ship’s mizzenmast (the mast toward the back).","zh":"（航海）**mizen/mizzen** 的复数：指设置在后桅（mizzenmast）上的后帆（通常为纵帆）。"},"examples":[{"en":"The crew trimmed the **mizens** to balance the ship in a strong crosswind.","zh":"船员调整**后帆（mizens）**，让船在强侧风中保持平衡。"},{"en":"On older sailing ships, different **mizens** could be set depending on the weather.","zh":"在较早的帆船上，会根据天气配置不同的**后帆（mizens）**。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) plural of **mizen/mizzen**: the mizzenmasts themselves (the aft masts on certain sailing vessels).","zh":"（较少见）**mizen/mizzen** 的复数：指后桅（mizzenmasts）本身，即船尾部的桅杆。"},"examples":[{"en":"The old schooner’s **mizens** were inspected for damage after the storm.","zh":"暴风雨后，人们检查了那艘老式纵帆船的**后桅（mizens）**是否受损。"}]}],"synonyms":["mizzen sails","aft sails"],"phonetic":"/ˈmɪzənz/","extraExplanation":["“mizens” 不是常见日常词，多见于航海/帆船语境，也常出现在拼字游戏（如 Scrabble）的词表里。","拼写上 **mizen** 和 **mizzen** 都对；现代英语里 **mizzen** 更常见，**mizen** 属于变体拼写。"]}
{"word":"mizmaze","summary":{"en":"Mizmaze means a maze/labyrinth; in some British dialects it can also mean a confused state.","zh":"mizmaze 指“迷宫/曲径迷宫”；在英国部分方言中也可指“困惑、迷惘的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A maze; a labyrinth (sometimes used for a maze-like pattern with one winding path).","zh":"迷宫；曲径式迷宫（有时指只有一条蜿蜒路径的“迷路/迷宫图案”）。"},"examples":[{"en":"The garden path turned into a mizmaze of hedges and stone walls.","zh":"花园小路变成了树篱和石墙交织的迷宫。"},{"en":"We wandered through an old mizmaze cut into the grass on the hilltop.","zh":"我们在山顶草地上刻出的古老“草坪迷宫”里走来走去。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dialectal, England) A state of confusion or bewilderment.","zh":"（英格兰方言）困惑；迷惘；一团乱。"},"examples":[{"en":"After the sudden news, I was all in a mizmaze and couldn’t think clearly.","zh":"突如其来的消息让我一时迷惘，脑子转不过来。"},{"en":"The instructions left everyone in a mizmaze.","zh":"这些说明把大家都弄糊涂了。"}]}],"synonyms":["maze","labyrinth","tangle","confusion"],"phonetic":"ˈmɪzˌmeɪz","extraExplanation":["“mizmaze”是由“maze”重叠、变形而来的老词（带一点俏皮/民间口语感），在现代英语里很少见。","在英国，“Mizmaze”也常被当作专名：指某些历史性的草坪迷宫（turf maze / turf labyrinth），例如汉普郡（Hampshire）一带的山顶草坪迷宫。它们通常更接近“labyrinth（单一路径）”而非有分叉死路的“maze”。","学习用法上：日常写作更常用 maze / labyrinth；mizmaze 多见于文学、古语风格或与英国草坪迷宫相关的语境。"]}
{"word":"mizpah","summary":{"en":"Mizpah is most commonly a farewell blessing meaning “May God watch over us while we are apart,” and it can also be a biblical place name meaning “watchtower.”","zh":"Mizpah最常见的意思是“离别祝福语”（愿我们分离时上帝看顾），也可以指意为“瞭望台/守望楼”的《圣经》地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in jewelry or as a message) A farewell blessing meaning “May God watch over us while we are apart.”","zh":"（常见于首饰或留言中）一种离别祝福语，意思是“我们分离时，愿上帝看顾我们。”"},"examples":[{"en":"He gave her a ring engraved with “Mizpah” before they went to different colleges.","zh":"在他们去不同的大学前，他送给她一枚刻着“Mizpah”的戒指。"},{"en":"She wrote “Mizpah” at the end of the letter as a way to say goodbye with a blessing.","zh":"她在信末写下“Mizpah”，用祝福的方式道别。"},{"en":"Some couples use “Mizpah” as a promise to remember each other from far away.","zh":"有些情侣把“Mizpah”当作异地时彼此惦念的承诺。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name in the Bible meaning “watchtower” (also spelled “Mizpeh”); used for several locations.","zh":"《圣经》中的地名，意为“瞭望台 / 守望楼”（也拼作“Mizpeh”）；可指多个地点。"},"examples":[{"en":"In the Bible, Mizpah is mentioned as a gathering place in some stories.","zh":"在《圣经》中，Mizpah在一些故事里被提到是人们聚集的地方。"},{"en":"The map notes Mizpah (Mizpeh) as one of the ancient sites in the region.","zh":"地图把Mizpah（Mizpeh）标注为该地区的一处古代遗址。"}]}],"synonyms":["farewell blessing","parting blessing","blessing","watchtower (literal meaning)"],"phonetic":"/ˈmɪtspə/","extraExplanation":["“Mizpah”来自《圣经·创世记》31:49 中的祝福语（常被意译为“我们彼此离别时，愿耶和华在你我之间鉴察/看顾”）。因此它在英语文化里常被当作带宗教色彩的离别祝福，尤其流行于19世纪末到20世纪初的刻字首饰（如戒指、项链、胸针）。","学习提示：它既可以指“离别祝福语”，也可以指“圣经地名”。在日常英语里更常见的是前者（作为刻字或留言的象征用法）。"]}
{"word":"mizrach","summary":{"en":"Mizrach is a Jewish term meaning “east,” and it also refers to a plaque marking the direction of Jerusalem (or the east wall of a synagogue).","zh":"Mizrach 是犹太语境中的“东方”之意，也可指标示耶路撒冷方向的牌匾，或会堂的东墙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) A decorative or sacred plaque/picture placed on the east-facing wall of a home or synagogue to mark the direction of Jerusalem, indicating which way to face for prayer.","zh":"（犹太教）挂在家中或会堂东向墙上的装饰性或神圣牌匾/图片，用来标示耶路撒冷的方向，提醒祈祷时面向的方位。"},"examples":[{"en":"In many traditional homes, a mizrach hangs on the wall to show which way to face during prayer.","zh":"在许多传统家庭里，墙上会挂一块 mizrach，用来提示祈祷时该面向哪个方向。"},{"en":"They placed a beautiful paper-cut mizrach near the dining table.","zh":"他们在餐桌旁挂了一幅漂亮的剪纸 mizrach。"}]},{"partOfSpeech":"n.","definition":{"en":"(Judaism) The east wall of a synagogue (the side oriented toward Jerusalem in many communities).","zh":"（犹太教）会堂的东墙（在许多社群中，通常是朝向耶路撒冷的一侧）。"},"examples":[{"en":"The honored seats were close to the mizrach.","zh":"贵宾席位靠近 mizrach（会堂东墙一侧）。"},{"en":"He stood near the mizrach wall during the service.","zh":"礼拜时他站在 mizrach（东墙）附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(Jewish English, from Hebrew) The direction “east,” especially the direction one faces toward Jerusalem when praying.","zh":"（犹太英语，源自希伯来语）“东方”的方向，尤指祈祷时面向耶路撒冷的方向。"},"examples":[{"en":"If you stand by the window, you’ll be facing mizrach.","zh":"你站在窗边的话，就会面向 mizrach（东方/耶路撒冷方向）。"}]}],"synonyms":["mizrah","mizrakh","mizrach sign","east (in Jewish prayer context)"],"phonetic":"/ˈmɪz.rɑx/","extraExplanation":["“mizrach”来自希伯来语 מזרח（mizrach），本义是“东方/日出之处”。在许多犹太社群里，祈祷时要面向耶路撒冷，因此住在以色列以西地区的人常会面向“东”，于是家里或会堂东墙上常挂“mizrach”牌匾作为提示。","常见拼写变体：mizrah、mizrakh。词尾的“kh”通常表示类似德语 Bach 那种较重的喉音（英语里常用 kh 来标）。"]}
{"word":"mizrah","summary":{"en":"Mizrah is a Jewish term meaning “east,” especially the direction toward Jerusalem for prayer; it can also mean a decorative sign showing that direction or the east wall of a synagogue.","zh":"Mizrah 是与犹太传统相关的词，意思是“东方”，尤指祷告时面向耶路撒冷的方向；也可指提示该方向的装饰牌，或会堂的东墙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the direction of east—especially the direction toward Jerusalem that Jews face during prayer","zh":"东方；（尤指）犹太人祷告时面向耶路撒冷的方向"},"examples":[{"en":"Before we start praying, we turn to the mizrah (east), toward Jerusalem.","zh":"开始祷告前，我们会转向 mizrah（东方），也就是朝向耶路撒冷。"},{"en":"In many synagogues, people arrange seating with the mizrah wall in mind.","zh":"在许多会堂里，人们会根据 mizrah 那面墙的方向来安排座位。"}]},{"partOfSpeech":"n.","definition":{"en":"an ornamental or sacred sign/picture placed on a wall (often the east wall) to show the direction of prayer toward Jerusalem","zh":"（常挂在东墙、用于提示祷告方向的）“向东”装饰牌/宗教画/标志"},"examples":[{"en":"They hung a mizrah on the wall to mark the direction of Jerusalem.","zh":"他们在墙上挂了一个 mizrah，用来标示耶路撒冷的方向。"},{"en":"The old mizrah was beautifully decorated with Hebrew calligraphy.","zh":"那块旧 mizrah 上有精美的希伯来书法装饰。"}]},{"partOfSpeech":"n.","definition":{"en":"the eastern wall of a synagogue (the wall that faces toward Jerusalem)","zh":"（会堂内）朝向耶路撒冷的东墙"},"examples":[{"en":"The rabbi’s seat was near the mizrah.","zh":"拉比的座位靠近 mizrah（东墙）。"}]}],"synonyms":["east","eastern wall","prayer direction (toward Jerusalem)"],"phonetic":"/ˈmɪz.rɑx/","extraExplanation":["“mizrah”也常写作 mizrach / mizrakh，源自希伯来语 מזרח，基本意思是“东、日出之处”。在犹太传统中，它常与“面向耶路撒冷祈祷”的方向有关，所以既可以指“东方/祈祷方向”，也可以指“标示方向的牌子”，甚至引申指“会堂朝东的那面墙”。","别和 “Mizrahi（米兹拉希）” 混淆：Mizrahi 是形容词/族群称呼，字面意思是“东方的”，常指中东与北非等地区的犹太社群（Mizrahi Jews）。两者词根相关，但用法不同。"]}
{"word":"mizraim","summary":{"en":"Mizraim is an older biblical name for Egypt, and it can also refer to a biblical ancestor associated with Egypt.","zh":"Mizraim是《圣经》中对“埃及”的古称，也可指与埃及相关的圣经家谱人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biblical) Egypt; the ancient land and people referred to by this name in the Hebrew Bible.","zh":"（《圣经》用语）埃及；希伯来圣经中对古埃及（及其人民/地区）的称呼。"},"examples":[{"en":"In some Bible translations, Egypt is called “Mizraim.”","zh":"在一些圣经译本或注释中，埃及会被称为“Mizraim”。"},{"en":"The story describes a journey from Canaan into Mizraim during a famine.","zh":"故事描述了在饥荒时期从迦南进入“Mizraim（埃及）”的旅程。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biblical genealogy) A person named Mizraim, presented as an ancestor connected with Egypt.","zh":"（《圣经》家谱）名为Mizraim的人物；在圣经家谱中被描写为与埃及有关的祖先。"},"examples":[{"en":"In biblical genealogies, Mizraim is listed among the descendants of Ham.","zh":"在圣经家谱中，Mizraim被列为含（Ham）的后代之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(Freemasonry, less common) A name used in the title of the “Rite of Mizraim,” a Masonic rite associated with Egyptian-themed symbolism.","zh":"（共济会用语，较少见）用于“Rite of Mizraim（米兹拉因仪式）”这一共济会仪式名称；常与埃及主题象征有关。"},"examples":[{"en":"He read about the Rite of Mizraim in a history of Masonic rituals.","zh":"他在一本关于共济会仪式的历史书里读到“Rite of Mizraim”。"}]}],"synonyms":["Egypt (common modern name)","Mitzrayim (Hebrew-based spelling)"],"phonetic":"/mɪzˈreɪ.ɪm/","extraExplanation":["“Mizraim”来自希伯来语 מִצְרַיִם（常转写为 *Mitzrayim*），这是希伯来语里“埃及”的名称；现代希伯来语中也仍用该词表示“埃及”。","这个词在形式上常被解释为带有“二/双”的语法痕迹，因此有时会被联系到“上埃及/下埃及”的概念（即古埃及的两部分）。在英文语境里，“Mizraim”多见于宗教、圣经研究或较文学化的指称中。"]}
{"word":"mizzen","summary":{"en":"Mizzen means the aft (rear) mast on a sailing ship, and it can also describe things related to that mast or its sail.","zh":"mizzen 指帆船上的后桅（靠船尾的桅杆），也可作形容词表示“后桅的/后部的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(On a sailing ship) the third mast, usually the mast behind the mainmast (the aft mast).","zh":"（帆船上）后桅；通常指位于主桅后方的第三根桅杆（靠船尾的那根桅）。"},"examples":[{"en":"On a three-masted ship, the mizzen stands behind the mainmast.","zh":"在三桅帆船上，后桅位于主桅的后方。"},{"en":"The crew adjusted the mizzen sail to help the ship turn more smoothly.","zh":"船员调整后桅帆，使船只转向更顺畅。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the mizzen mast or its sail; located toward the rear (aft) of a ship.","zh":"后桅的；后桅帆的；位于船尾方向（后部）的。"},"examples":[{"en":"They repaired the mizzen sail before the storm arrived.","zh":"暴风雨来临前，他们修好了后桅帆。"},{"en":"The mizzen mast carried a smaller sail than the mainmast.","zh":"后桅上挂的帆通常比主桅的小。"}]}],"synonyms":["mizzenmast","aft mast"],"phonetic":"/ˈmɪzən/","extraExplanation":["“mizzen”常见于航海与历史题材（海盗、探险、帆船时代）文本中。发音里的 /z/ 很容易被误读成 /s/，注意是清晰的“mizz-”。","结构上常与另外两根桅并列出现：foremast（前桅）、mainmast（主桅）、mizzenmast（后桅）。在一些船型（如ketch、yawl）里，后桅及其帆常用于平衡船身、辅助操纵与转向，而不一定承担主要推进力。","相关常用搭配：mizzenmast（后桅）、mizzen sail（后桅帆）、aft（船尾方向）、stern（船尾）。"]}
{"word":"mizzenmast","summary":{"en":"A mizzenmast is the mast located behind a ship’s mainmast.","zh":"mizzenmast 指帆船上位于主桅后方的后桅杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The mast on a sailing ship that is behind the mainmast (often the third mast on a three‑masted ship). It commonly carries the mizzen sail(s).","zh":"帆船上位于主桅（mainmast）后方的桅杆（在三桅帆船上通常是第三根桅），通常悬挂后桅帆（mizzen sail）。"},"examples":[{"en":"The crew raised the mizzenmast sail to help balance the ship in strong wind.","zh":"船员升起后桅帆，以便在大风中帮助船只保持平衡。"},{"en":"From the deck, you could see the mizzenmast rising behind the mainmast.","zh":"从甲板上你可以看到后桅杆在主桅后方竖立着。"}]}],"synonyms":["mizzen mast","after mast"],"phonetic":"/ˈmɪzənˌmæst/","extraExplanation":["“mizzen-”常用来表示“后面的、靠船尾的”（与帆装有关），所以 mizzenmast 指的就是“后桅”。在不同帆船类型中，后桅的位置与高度可能不同，但核心概念是：它位于主桅之后，主要用于调整船的平衡与操控。"]}
{"word":"mizzenmastman","summary":{"en":"Mizzenmastman is an old nautical word for a sailor who works on the mizzenmast (the aft mast) and handles its sail and rigging.","zh":"Mizzenmastman 是较古老的航海词，指负责后桅及其帆具、索具操作与维护的水手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical nautical) A sailor assigned to work on or look after the mizzenmast (the aft mast) and its sail/rigging.","zh":"（历史/航海用语）负责后桅（mizzenmast）及其帆具、索具的水手。"},"examples":[{"en":"In the logbook, the mizzenmastman was ordered aloft to secure the sail before the squall hit.","zh":"在航海日志里，后桅水手被命令上桅，在阵风来袭前把帆固定好。"},{"en":"The mizzenmastman checked the lines on the stern mast while the rest of the crew handled the mainmast.","zh":"后桅水手检查船尾桅杆的缆索，而其他船员处理主桅。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) Any crewman whose regular station is at the mizzenmast area (aft rigging and sail-handling).","zh":"（引申）常驻后桅岗位、主要在船尾操帆与处理索具的船员。"},"examples":[{"en":"As a mizzenmastman, he spent most of his watch working near the stern.","zh":"作为后桅岗位的船员，他值更时大多在船尾工作。"}]}],"synonyms":["mizzen sailor","aft-mast sailor","crewman stationed at the mizzenmast"],"phonetic":"/ˈmɪz.ənˌmæst.mən/","extraExplanation":["这个词非常少见，多见于旧式帆船时代的岗位称呼。结构上是复合词：mizzenmast（后桅）+ -man（从事某岗位的人）。现代英语里更常说的是 crew member on the mizzen / sailor stationed at the mizzenmast，或直接用更通用的岗位词（如 deckhand、topman 等，视船型与上下文而定）。","拼写上你也可能会看到连字符或分写形式（如 mizzen-mast man / mizzen mast man），但含义基本一致。"]}
{"word":"mizzenmasts","summary":{"en":"“Mizzenmasts” means the back masts of sailing ships (plural of mizzenmast).","zh":"“mizzenmasts” 是“后桅”的复数，指帆船上靠近船尾的桅杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mizzenmast**: the mast on a sailing ship that is closest to the back (stern), especially the third mast on a three-masted ship.","zh":"**mizzenmast（后桅）**的复数：帆船上最靠近船尾（stern）的桅杆；尤其指三桅帆船上的第三根桅杆。"},"examples":[{"en":"On a three-masted ship, the mizzenmasts are the ones nearest the stern.","zh":"在三桅帆船上，mizzenmasts 指的是最靠近船尾的那根桅杆。"},{"en":"The crew inspected the mizzenmasts after the storm for cracks and loose rigging.","zh":"暴风雨过后，船员检查后桅是否有裂缝，以及索具是否松动。"}]}],"synonyms":["aft masts","mizzen masts"],"phonetic":"/ˈmɪzənˌmæsts/","extraExplanation":["“mizzen-”来自航海用语，常与船尾方向相关。传统三桅帆船通常有 foremast（前桅）、mainmast（主桅）、mizzenmast（后桅）。有些船型还会出现第四根桅（如 jigger mast），位置会更靠近船尾。","拼写提示：**mizzenmast**（单数）→ **mizzenmasts**（复数）。发音里常把 mizzen 读成类似 “MIH-zən”。"]}
{"word":"mizzens","summary":{"en":"“mizzens” is the plural of “mizzen,” meaning the aft (rear) mast of a sailing ship or the sail on it.","zh":"“mizzens”是“mizzen”的复数，指帆船最靠船尾的桅杆，或指该桅杆上的帆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mizzen**: the mast set farthest toward the back (stern) of a sailing ship; also used to mean the sail attached to that mast.","zh":"**mizzen** 的复数：帆船上最靠近船尾（后方）的那根桅杆；也可指装在该桅杆上的帆。"},"examples":[{"en":"On a three-masted ship, the **mizzens** are toward the stern, behind the mainmast.","zh":"在三桅帆船上，**mizzens（后桅）**位于船尾方向，在主桅之后。"},{"en":"As the wind shifted, the crew adjusted the **mizzens** to keep the ship steady.","zh":"风向变化时，船员调整**mizzens（后桅帆）**来保持船只稳定。"}]}],"synonyms":["mizzen masts","aft masts","mizzen sails"],"phonetic":"/ˈmɪzənz/","extraExplanation":["“mizzen”是航海用语，常见于古典航海、海事文学与历史船只描述中。现代英语里更常见单数“mizzen mast（后桅）”“mizzen sail（后桅帆）”；“mizzens”多出现在复数指多艘船/多处结构，或在更口语/简略的写法里泛指后桅及其帆。","拼写提示：有些学习者会把它和“mis-”开头的词混淆（如misunderstand），但“mizzen”与“mistake（错误）”无关，来源与船只部件有关。"]}
{"word":"mizzentop","summary":{"en":"Mizzentop usually means the platform on a ship’s mizzenmast (mizzen-top), but it can also be a proper name (e.g., a school in New York).","zh":"Mizzentop 通常指帆船后桅上的平台（mizzen-top），也可能是专有名称（例如纽约的一所学校）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nautical) A platform (top) on the mizzenmast of a sailing ship, used as a working or lookout area; sometimes written “mizzen-top.”","zh":"（航海）帆船上后桅（mizzenmast）上的桅楼/平台（top），用于作业或瞭望；也常写作“mizzen-top”。"},"examples":[{"en":"The sailor climbed to the mizzentop to watch for land.","zh":"水手爬上后桅平台（mizzentop）瞭望陆地。"},{"en":"From the mizzen-top, the crew could handle rigging more easily.","zh":"在后桅平台上，船员更容易操作索具。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) The name of some places or organizations, especially “Mizzentop Day School” (a private school in Pawling, New York).","zh":"（专有名词）一些地点或机构的名称，尤其指纽约州帕灵（Pawling）的“Mizzentop Day School”（一所私立学校）。"},"examples":[{"en":"She teaches at Mizzentop Day School in Pawling, New York.","zh":"她在纽约州帕灵的 Mizzentop Day School 任教。"},{"en":"We drove past Mizzentop on our way into town.","zh":"我们进城路上开车经过了名为 Mizzentop 的地方。"}]}],"synonyms":["mizzen-top","mizzen top","top (on a mast)"],"phonetic":"/ˈmɪzənˌtɑp/","extraExplanation":["“mizzentop”更常见的航海拼写是“mizzen top”或加连字符“mizzen-top”。其中 mizzen 指“后桅/后桅帆”，top 在传统帆船里指桅杆上的平台（如 fore-top、main-top、mizzen-top）。","如果你是在读小说/海事史资料里看到这个词，通常是航海义；如果出现在地址、学校或社区介绍中，则多半是专有名词（如纽约州的 Mizzentop Day School）。"]}
{"word":"mizzentopman","summary":{"en":"A mizzentopman is a sailor who works in the mizzen top (high on the mizzenmast) on a sailing ship.","zh":"mizzentopman 指帆船上负责在后桅（mizzenmast）桅盘/桅楼（mizzen top）区域作业的水手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sailor assigned to work in the mizzen top (the platform high on the mizzenmast) on a sailing ship","zh":"（帆船上）负责在后桅（mizzenmast）的桅楼/桅盘（mizzen top）工作的水手"},"examples":[{"en":"The mizzentopman climbed to the mizzen top to reef the sail before the storm hit.","zh":"暴风雨来临前，那名后桅桅楼水手爬上后桅的桅盘去收帆。"},{"en":"As a mizzentopman, he spent much of the day aloft checking lines and rigging.","zh":"作为后桅桅楼水手，他一天中有很长时间都在桅杆上方检查绳索和索具。"}]}],"synonyms":["mizzen-topman","topman"],"phonetic":"/ˈmɪzənˌtɑpmən/","extraExplanation":["“mizzentopman”是比较古典/航海史语境中的词，常见于帆船时代的描写（小说、航海回忆录、历史材料）。","词形可拆成：mizzen（后桅/后桅帆相关）+ top（桅盘/桅楼平台）+ man（做这项工作的人）。在传统帆船上，topman 指专门上桅作业的水手，因此 mizzentopman 就是“负责后桅桅盘区域的 topman”。","现代日常英语里很少用到；更常见的写法也可能见到带连字符的形式：mizzen-topman。"]}
{"word":"mizzentopmen","summary":{"en":"Mizzentopmen are sailors who work in the mizzen top (high on the mizzenmast), handling sails and rigging.","zh":"mizzentopmen 指在后桅楼（后桅上部平台）工作的水手，负责高处的帆具与索具操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical, historical) Sailors stationed in the mizzen top (the platform high on the mizzenmast) who work aloft handling sails, rigging, and lookout duties there.","zh":"（航海用语，历史）在后桅楼（mizzen top，后桅上方的平台）值勤的水手，负责在高处操作帆具与索具、协助瞭望等工作。"},"examples":[{"en":"In rough weather, the mizzentopmen were sent aloft to shorten sail and secure the rigging.","zh":"在恶劣天气里，会派后桅楼水手上桅收帆并加固索具。"},{"en":"The captain called for the mizzentopmen to stand by, ready to make repairs high on the mizzenmast.","zh":"船长命令后桅楼水手待命，准备到后桅高处进行修理。"}]}],"synonyms":["mizzen-topmen","mizzen topmen","mizzen-top sailors","topmen"],"phonetic":"/ˈmɪzənˌtɑp.mən/","extraExplanation":["这个词常见于大帆船（尤其三桅方帆船）时代的分工体系：topmen 泛指“在桅楼/桅顶部位干活的水手”，mizzentopmen 则特指负责后桅（mizzenmast）桅楼那一组人。","拼写上也常见连字符形式 **mizzen-topmen**；你输入的 **mizzentopmen** 属于把复合词连写的写法。","相关词：**mizzen**（后桅/后桅帆）、**mizzentop / mizzen top**（后桅楼平台）、**topman / topmen**（桅楼水手，通常指擅长高空作业的老练水手）。"]}
{"word":"mizzle","summary":{"en":"Mizzle means to drizzle very lightly—like fine misty rain.","zh":"Mizzle 指非常细、像雾一样的毛毛雨（轻微的细雨）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of rain) to fall as a fine mist or very light drizzle; to drizzle gently.","zh":"（雨）下成细小的雨雾；轻轻地下毛毛雨。"},"examples":[{"en":"It started to mizzle just as we left the subway station.","zh":"我们刚离开地铁站，天就开始飘起毛毛雨了。"},{"en":"A grey sky and a mizzling rain made the streets look quieter than usual.","zh":"灰蒙蒙的天空加上细雨，让街道显得比平时更安静。"}]}],"synonyms":["drizzle","sprinkle","mist"],"phonetic":"/ˈmɪzəl/","extraExplanation":["“mizzle”是比较口语、带点地域色彩的词，在英式英语里更常见（尤其用来形容阴冷潮湿、细雨蒙蒙的天气）。在美式英语中更常用的是“drizzle / mist”。","它有时会被用来营造气氛：比起普通的“rain”，mizzle 更强调“细、轻、连绵、带雾感”的雨，常见于描写阴郁或安静的场景。"]}
{"word":"mizzled","summary":{"en":"“Mizzled” usually means “rained lightly / drizzled” (past tense of mizzle). It can also be a noun for fine rain, and in informal British use it may mean “leave quickly.”","zh":"“mizzled”通常表示“下了毛毛雨/飘了细雨”（mizzle的过去式）。它也可作名词指细雨；在非正式英式用法中还可表示“赶紧离开”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to rain lightly; to drizzle (often a fine, misty rain).","zh":"下毛毛雨；飘细雨（常指很细、像雾一样的小雨）。"},"examples":[{"en":"It started to mizzle just as we left the house.","zh":"我们刚出门就开始飘起了毛毛雨。"},{"en":"The sky was gray and mizzling all afternoon.","zh":"天空灰蒙蒙的，整个下午都在下着细雨。"}]},{"partOfSpeech":"n.","definition":{"en":"a light, misty rain; drizzle.","zh":"毛毛雨；细雨。"},"examples":[{"en":"A cold mizzle hung in the air.","zh":"空气里飘着一层冷冷的细雨。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal, chiefly British) to leave quickly; to go away.","zh":"（非正式，主要英式）迅速离开；走开。"},"examples":[{"en":"It’s getting late—let’s mizzle.","zh":"太晚了——我们撤吧。"}]}],"synonyms":["drizzle","sprinkle","mist","spit (rain)","shower (light)"],"phonetic":"/ˈmɪzəl/","extraExplanation":["“mizzled”是动词“mizzle”的过去式/过去分词。最常见的意思是“下毛毛雨”，在英式英语、苏格兰/北英格兰等地区色彩更强；美式英语里更常用drizzle、sprinkle。","写作里“mizzle”常用来营造阴冷、潮湿、灰蒙蒙的氛围（比drizzle更“雾状”、更黏在空气里）。","“离开”的用法更偏口语与地区用法，在正式写作中不常见；如果你在美式语境里用，可能需要上下文帮助读者理解。"]}
{"word":"mizzler","summary":{"en":"“Mizzler” is rare slang meaning a habitual complainer; in older slang it can also mean a shabby, ragged person.","zh":"“mizzler”是較少見的俚語，指愛抱怨的人；在更早期的俚語裡也可指寒酸、衣衫襤褸的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian/rare slang) A person who complains a lot; a whiner.","zh":"（澳洲／較少見的俚語）愛抱怨的人；愛發牢騷的人。"},"examples":[{"en":"Stop being a mizzler and help us fix the problem.","zh":"別一直發牢騷了，來一起把問題解決。"},{"en":"He’s not mean—just a bit of a mizzler when he’s tired.","zh":"他不是刻薄，只是累的時候有點愛抱怨。"}]},{"partOfSpeech":"n.","definition":{"en":"(Old/rare slang) A shabby, ragged-looking person (often in the phrase “needy-mizzler”).","zh":"（古老／少見的俚語）衣衫襤褸、寒酸的人（常見於片語“needy-mizzler”）。"},"examples":[{"en":"In the old slang list, “needy-mizzler” meant a very poor, ragged person.","zh":"在早期俚語表中，“needy-mizzler”指非常窮、衣著破舊的人。"}]}],"synonyms":["complainer","whiner","grumbler","whinger"],"phonetic":"/ˈmɪzlər/","extraExplanation":["“mizzler”不是現代英語中的常用字，更多出現在澳洲英文的俚語記錄中，意思接近 whinger/complainer（愛抱怨的人）。","你可能也想查的是拼字相近的 **rizzler**（網路俚語：很有魅力、很會撩的人），或是 **mizzle**（細雨／毛毛雨）。如果你告訴我你在哪裡看到這個字（影片、歌詞、聊天、標題等），我可以幫你判斷最可能的意思。"]}
{"word":"mizzles","summary":{"en":"“Mizzles” means there is (or happens) a fine, light drizzle; it’s a less common word for “drizzles.”","zh":"“mizzles”表示“飘着细雨/下毛毛雨”，是比较少见、偏文学或方言色彩的“drizzles”的说法。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(verb, 3rd person singular) rains in a fine, light drizzle; drizzles.","zh":"（动词第三人称单数）下毛毛雨；飘着细雨。"},"examples":[{"en":"It mizzles all morning, so the streets stay damp.","zh":"整个早上都在飘毛毛雨，所以街道一直湿湿的。"},{"en":"If it mizzles again, we’ll bring a light rain jacket.","zh":"如果又下毛毛雨，我们就带一件薄雨衣。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) light drizzles; periods of fine misty rain (rare).","zh":"（名词复数）毛毛雨；细雨的几阵（较少见用法）。"},"examples":[{"en":"After a few mizzles, the air felt cool and clean.","zh":"下了几阵毛毛雨后，空气变得凉爽清新。"}]}],"synonyms":["drizzles","sprinkles","mists","rains lightly"],"phonetic":"/ˈmɪzəlz/","extraExplanation":["“mizzle”是比较少见的词，多见于英式或文学/方言色彩的表达，意思接近“drizzle / mist（细雨、雾雨）”。日常英语里更常用drizzle或light rain。","拼写是m-i-z-z-l-e；“mizzles”通常是动词第三人称单数（it mizzles）或名词复数。"]}
{"word":"mizzling","summary":{"en":"Mizzling means there is very light, fine rain (a drizzle). It can also be the -ing form of “mizzle.”","zh":"mizzling 指下着很小很细的雨（毛毛雨/雾雨），也可以是动词 mizzle 的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Raining very lightly; a fine drizzle or misty rain (often used in British English).","zh":"（雨）下得很小；细细的毛毛雨/雾雨（常见于英式英语）。"},"examples":[{"en":"It was mizzling all morning, so the streets stayed damp but not soaked.","zh":"整个早上都在飘毛毛雨，所以街道一直潮湿，但没有湿透。"},{"en":"Don’t worry about an umbrella—it's just mizzling.","zh":"不用担心带伞——只是飘点小雨。"}]},{"partOfSpeech":"v.","definition":{"en":"The act or process of raining in a fine drizzle; present participle of “mizzle.”","zh":"细雨飘落的过程；“mizzle”的现在分词形式。"},"examples":[{"en":"It started mizzling right after we left the café.","zh":"我们刚离开咖啡馆就开始飘起细雨。"}]}],"synonyms":["drizzling","misting","spitting (rain)","sprinkling"],"phonetic":"/ˈmɪzəlɪŋ/","extraExplanation":["“mizzling / mizzle”在英式英语（尤其在英国北部、苏格兰等地区的语感里）更常见，带一点口语、地方色彩；美式英语里更常用“drizzling”“misting”“spitting (rain)”。","它描述的是“雨丝很细、很轻、像雾一样”的感觉：不至于让你立刻全身湿透，但会让空气潮冷、路面发暗发湿。写作中用它能营造一种阴冷、灰蒙蒙的氛围。"]}
{"word":"mizzly","summary":{"en":"Mizzly means “drizzly or misty,” describing weather with very fine rain.","zh":"mizzly 指“毛毛雨的、细雨蒙蒙的”，用来形容下着很细小雨滴的天气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of weather) raining in very small drops; misty and drizzly.","zh":"（天气）下着很细的小雨；细雨蒙蒙、毛毛雨的。"},"examples":[{"en":"It was a gray, mizzly day, so we stayed indoors.","zh":"那是个灰蒙蒙、细雨飘的日子，所以我们待在室内。"},{"en":"Bring a light jacket—it’s mizzly out, not a real downpour.","zh":"带件薄外套吧——外面在下毛毛雨，不是那种大雨。"},{"en":"The trail gets slippery in mizzly weather.","zh":"毛毛雨天气里，小路会变得很滑。"}]}],"synonyms":["drizzly","misty","showery","damp","wet"],"phonetic":"/ˈmɪzəli/","extraExplanation":["“mizzly”是方言/地域用词（常见于苏格兰英语、部分英式方言，也可见于美式方言用法），在日常标准英语里不算常用，但在描写天气的文学或叙述性写作中很形象。","词源上可理解为 mizzle（细雨、毛毛雨）+ 形容词后缀 -y，意思就是“像细雨那样的/带细雨的”。常与 gray（灰蒙蒙的）、damp（潮湿的）等词搭配。"]}
{"word":"mizzonite","summary":{"en":"Mizzonite is a mineral in the scapolite group, intermediate between meionite and marialite.","zh":"Mizzonite 是方柱石族的一种矿物，成分介于 meionite 与 marialite 之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral in the scapolite group; a mixed/intermediate variety between the endmembers meionite (calcium-rich) and marialite (sodium-rich)","zh":"一种方柱石族（scapolite group）矿物；成分介于钙端元 meionite 与钠端元 marialite 之间的中间成员"},"examples":[{"en":"The sample was identified as mizzonite, an intermediate scapolite mineral.","zh":"这块标本被鉴定为 mizzonite（一种方柱石族的中间矿物）。"},{"en":"Mizzonite can form in metamorphic rocks, especially where limestone has been altered.","zh":"mizzonite 可形成于变质岩中，尤其是在石灰岩发生变质改造的环境里。"}]},{"partOfSpeech":"n.","definition":{"en":"(more specific) a volcanic variety of mizzonite that occurs as clear crystals","zh":"（更具体）一种火山成因的 mizzonite，常以清澈晶体出现"},"examples":[{"en":"Collectors value clear volcanic mizzonite crystals for their appearance.","zh":"收藏者很看重清澈的火山成因 mizzonite 晶体的观赏性。"}]}],"synonyms":["scapolite"],"phonetic":"/ˈmɪzəˌnaɪt/","extraExplanation":["mizzonite 是一个偏“矿物学/地质学”用词，不是日常英语词汇。常见的大类叫 scapolite（方柱石族/方柱石类），而 mizzonite 通常指在成分上介于 meionite（钙更高）与 marialite（钠更高）之间的混合成员。","词源上可追溯到希腊语 meizōn（“更大”）+ 德语 -it（对应英语 -ite，常见于矿物名称后缀，意为“某某石/矿物”）。"]}
{"word":"mizzy","summary":{"en":"Mizzy most commonly means “confused or dizzy” (informal, mainly British). It can also rarely mean “a bog/quagmire,” and it’s sometimes used as a nickname/name.","zh":"Mizzy 最常见意思是“迷糊、头脑不清楚”（非正式，偏英式）。也可很少见地指“沼泽/泥泞湿地”，并且有时用作昵称或名字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, chiefly British) Confused, dizzy, or unable to think clearly; muddle-headed.","zh":"（非正式用法，主要见于英式英语）迷糊的、晕乎乎的；头脑不清楚的。"},"examples":[{"en":"After the long flight and no sleep, I felt totally mizzy.","zh":"长途飞行又没睡觉后，我整个人都晕晕的、很迷糊。"},{"en":"The instructions were so complicated that I got mizzy and made mistakes.","zh":"说明太复杂了，我一下子就懵了，结果出了错。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A bog or quagmire; muddy, marshy ground.","zh":"（罕见）沼泽地；泥泞的湿地。"},"examples":[{"en":"The cart wheels sank into a mizzy near the river.","zh":"车轮陷进了河边一片泥泞湿地里。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, as a name) A nickname or given name (sometimes a variant spelling of “Mitzi/Mizzi”).","zh":"（作人名，非正式）昵称或名字（有时是 Mitzi/Mizzi 的变体拼写）。"},"examples":[{"en":"Mizzy is a nickname she uses online.","zh":"Mizzy 是她在网上用的昵称。"}]}],"synonyms":["confused","dizzy","muddled","disoriented","bewildered"],"phonetic":"/ˈmɪzi/","extraExplanation":["“mizzy（迷糊的）”这个形容词在英式英语/英国俚语环境里更常见，在拼字游戏词典（如 SOWPODS/TWL）里也能看到。美式英语里更常用的近义词是 confused / dizzy / disoriented。","网络上 “Mizzy” 也可能是某些人的网名或艺名（例如英国社媒创作者的称呼），此时属于专有名词，用法和“形容词 mizzy”无关；需要结合上下文判断。"]}

