{"word":"moa","summary":{"en":"“moa” usually means an extinct, large flightless bird from New Zealand. “MOA” can also be an acronym with different meanings depending on context.","zh":"“moa”通常指新西兰已灭绝的大型不会飞的鸟——恐鸟；“MOA”也常作缩写，但具体含义要看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, flightless bird from New Zealand that is now extinct.","zh":"（已灭绝的）恐鸟：新西兰原生的大型不会飞的鸟类。"},"examples":[{"en":"Scientists study moa bones to learn about New Zealand’s ancient ecosystems.","zh":"科学家研究恐鸟的骨骼，以了解新西兰古老的生态系统。"},{"en":"The moa became extinct after humans arrived in New Zealand.","zh":"在人类到达新西兰之后，恐鸟逐渐灭绝。"}]},{"partOfSpeech":"n.","definition":{"en":"(often written MOA) an abbreviation used for different things, depending on context (for example, “memorandum of agreement,” “museum of art,” or “Master of Arts”).","zh":"（常写作 MOA）缩写：具体含义取决于语境（例如“协议备忘录”“艺术博物馆/美术馆”“文学硕士”等）。"},"examples":[{"en":"They signed an MOA to outline what each side would do.","zh":"他们签署了一份 MOA，用来说明双方各自要做什么。"},{"en":"She earned an MA (Master of Arts); some places may refer to related programs with acronyms like MOA, but meanings vary.","zh":"她获得了 MA（文学硕士）；有些地方也会用类似 MOA 这样的缩写，但含义不一定一致。"}]}],"synonyms":["(bird sense) ratite (general family term)","(acronym sense) abbreviation"],"phonetic":"/ˈmoʊə/","extraExplanation":["“moa”最常见的词义指新西兰的恐鸟（复数也常写 moas 或 moa）。它们在毛利文化与新西兰历史叙述中经常被提到，现代英语里也常出现在自然史、考古与生态相关的语境。","如果你看到大写“MOA”，通常是在当作缩写使用，而且不同领域含义差别很大：政府/商业文件里常见 memorandum of agreement（协议备忘录）；学校与文化机构里可能指 Museum of Art（美术馆/艺术博物馆）等。遇到缩写时最好结合上下文或查看全称。"]}
{"word":"Moab","summary":{"en":"Moab can refer to an ancient biblical region/kingdom and its people (the Moabites), or a modern city in Utah, USA.","zh":"Moab 可指《圣经》中的古代摩押地区/王国及其民族（摩押人），也可指美国犹他州的现代城市摩押。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient kingdom/region east of the Dead Sea, often mentioned in the Bible.","zh":"摩押：死海以东的古代王国/地区，常见于《圣经》记载。"},"examples":[{"en":"In the Old Testament, Moab is described as a neighbor and sometimes an enemy of Israel.","zh":"在《旧约》中，摩押被描写为以色列的邻邦，有时也是敌对势力。"},{"en":"The prophet’s message was directed against Moab for its pride.","zh":"先知的信息曾因摩押的骄傲而指向它。"}]},{"partOfSpeech":"n.","definition":{"en":"The people of Moab (the Moabites), traditionally linked in the Bible to Moab, a son of Lot.","zh":"摩押人（Moabites）：《圣经》传统中与罗得之子“摩押”相关的民族。"},"examples":[{"en":"Ruth is introduced as a Moabite woman who becomes part of Israel’s story.","zh":"路得被介绍为一位摩押女子，后来成为以色列故事的一部分。"},{"en":"Some passages describe restrictions on Moabites entering the assembly.","zh":"有些经文提到对摩押人进入会众的限制。"}]},{"partOfSpeech":"n.","definition":{"en":"A city in eastern Utah, USA, known as a gateway to Arches and Canyonlands National Parks.","zh":"美国犹他州东部的城市“摩押”（Moab），以拱门国家公园和峡谷地国家公园的门户而闻名。"},"examples":[{"en":"We stayed in Moab before visiting Arches National Park.","zh":"我们去拱门国家公园之前住在摩押。"},{"en":"Moab is popular for hiking, mountain biking, and off-road trips.","zh":"摩押很适合徒步、山地骑行和越野旅行。"}]}],"synonyms":["(biblical) Moabites (for the people)","(US place) Moab, Utah"],"phonetic":"/ˈmoʊ.æb/","extraExplanation":["“Moab”源自希伯来语（מואב），在英语里既可能指《圣经》中的古地名/民族，也可能指美国犹他州的同名城镇。阅读时可以根据上下文判断：宗教/历史文本多指古摩押；旅行/地理语境多指犹他州的Moab。"]}
{"word":"moabite","summary":{"en":"Moabite means a person from ancient Moab, or something related to Moab (its people, culture, or language).","zh":"Moabite 指古代摩押国的人（摩押人），或与摩押及其人民、文化、语言有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Moab (an ancient kingdom east of the Dead Sea), especially as mentioned in the Bible","zh":"摩押人；（尤指《圣经》中提到的）古代摩押国的人"},"examples":[{"en":"Ruth is described in the Bible as a Moabite woman.","zh":"《圣经》中描述路得是一位摩押女子。"},{"en":"Archaeologists study Moabite culture to better understand the region’s history.","zh":"考古学家研究摩押文化，以更好地了解该地区的历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Moab or its people, culture, or language","zh":"摩押的；与摩押人、摩押文化或摩押语有关的"},"examples":[{"en":"The museum displayed a Moabite inscription.","zh":"博物馆展出了一段摩押语铭文。"},{"en":"The story includes Moabite customs that differ from Israelite ones.","zh":"故事中包含与以色列习俗不同的摩押习俗。"}]}],"synonyms":["Moabian (less common)","of Moab (paraphrase for the adjective)"],"phonetic":"/ˈmoʊ.əˌbaɪt/","extraExplanation":["“Moabite”常见于宗教与历史语境，尤其是《旧约圣经》。Moab（摩押）是古代近东的一个地区/王国，大致位于死海以东（今约旦一带）。","学习时可注意它既可作名词（一个摩押人），也可作形容词（摩押的：Moabite language / Moabite inscription）。","在英语文化里，提到 Moabite 常会让人联想到《路得记》中的 Ruth（路得），因此在文学、宗教讨论中出现频率更高。"]}
{"word":"moabitess","summary":{"en":"“Moabitess” means a woman from Moab (a Moabite woman), mainly used in biblical or literary contexts, especially about Ruth.","zh":"“Moabitess”指“摩押女子/摩押人的女性”，主要见于《圣经》或文学语境，尤其常用来指路得。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman from Moab (an ancient kingdom east of the Dead Sea), or a woman belonging to the Moabite people; often used in the Bible or religious/literary writing (e.g., Ruth).","zh":"摩押女子；摩押人（古代死海以东的摩押国/摩押族）的女性；常见于《圣经》或宗教/文学语境（如路得）。"},"examples":[{"en":"Ruth is described as a Moabitess in the Hebrew Bible.","zh":"在《希伯来圣经》中，路得被描述为一位摩押女子。"},{"en":"The story highlights how a Moabitess became part of Israel’s history through loyalty and love.","zh":"这个故事强调：一位摩押女子因忠诚与爱而进入以色列的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally (often figurative or old-fashioned): a foreign woman, especially one seen as coming from a neighboring or rival people.","zh":"（较泛、带修辞或旧式用法）外族女子，尤指被视为来自邻近或敌对族群的女性。"},"examples":[{"en":"In older sermons, the term “Moabitess” may be used to symbolize an outsider who is welcomed in.","zh":"在较早的讲道中，“Moabitess”有时用来象征被接纳的“外来者”。"}]}],"synonyms":["Moabite woman","female Moabite","(older) Moabitess"],"phonetic":"/moʊˈæbətəs/","extraExplanation":["“Moabitess”是“Moabite（摩押人）+ -ess（表示女性）”的构词方式，属于较旧的英语性别标记形式；现代英语更常用“Moabite woman / a Moabite”来表达，以避免不必要的性别区分。","该词最常与《路得记》（Ruth）相关：路得是摩押女子，后来加入以色列群体，因此在宗教与文学中常被用来讨论“外来者、归属、忠诚、跨文化婚姻”等主题。","复数是“Moabitesses”。如果你是在写作中使用，通常把首字母大写为“Moabitess”（专名/族名）。"]}
{"word":"moabitic","summary":{"en":"Moabitic means “related to the ancient Moabites or their language.”","zh":"Moabitic 指“与古代摩押人或其语言有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Of or relating to the Moabites (an ancient people of Moab) or their language.","zh":"摩押人的；与古代摩押（Moab）民族或其语言有关的。"},"examples":[{"en":"The inscription is written in a Moabitic dialect closely related to ancient Hebrew.","zh":"这段铭文使用的是一种摩押语方言，与古希伯来语关系很近。"},{"en":"Scholars compare Moabitic vocabulary with other Northwest Semitic languages.","zh":"学者会把摩押语词汇与其他西北闪米特语言进行比较。"}]}],"synonyms":["Moabite","Moabitish"],"phonetic":"/moʊ.əˈbɪtɪk/","extraExplanation":["“Moabitic”在现代英语中相对少见，更常见的说法是 **Moabite**（可作名词或形容词）或 **Moabitish**（较少见的形容词变体）。","“Moabites（摩押人）”在《圣经》与古代近东历史语境中出现较多；“Moabitic / Moabite language（摩押语）”通常指一种已消亡的迦南语支（闪米特语族）语言，与古希伯来语、腓尼基语等有亲缘关系。","使用场景多见于历史、考古、宗教学与古文字研究写作中（例如讨论铭文、出土文物或语言比较时）。"]}
{"word":"moabitish","summary":{"en":"Moabitish means “Moabite”—related to Moab or the Moabites; it’s a somewhat old-fashioned form mainly seen in biblical or historical writing.","zh":"Moabitish 的意思是“摩押人的/与摩押有关的”，相当于 Moabite；用法较古旧，多见于《圣经》或历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Moabites (an ancient people who lived east of the Dead Sea, often mentioned in the Hebrew Bible/Old Testament).","zh":"与摩押人有关的；摩押人的（摩押人是古代居住在死海以东的民族，常见于《希伯来圣经/旧约》）。"},"examples":[{"en":"In the story of Ruth, she is sometimes described as a Moabitish woman (a woman from Moab).","zh":"在《路得记》的故事里，她有时会被称为“Moabitish woman”（来自摩押的女子）。"},{"en":"The book discusses Moabitish culture and neighboring Israelite traditions.","zh":"这本书讨论了摩押人的文化，以及与之相邻的以色列传统。"}]}],"synonyms":["Moabite","Moabitic"],"phonetic":"/ˈmoʊ.əˌbaɪ.tɪʃ/","extraExplanation":["“Moabitish”比较偏古风/旧式用法，现代英语更常用“Moabite”作形容词（也可作名词：a Moabite）。","你可能是在阅读《圣经》（尤其是《路得记》）或古典/历史写作时见到这个词：例如旧译本里会用“the Moabitish damsel/maiden”（摩押女子）。","注意拼写与大小写：通常写作“Moabitish”（首字母大写），因为它来自专有名词 Moab（摩押）。"]}
{"word":"moan","summary":{"en":"Moan means a low sound (or making that sound) showing pain, sadness, tiredness, or sometimes repeated complaining.","zh":"Moan 指（发出）低沉的呻吟声，常表达疼痛、悲伤、疲惫，也可指反复抱怨（尤指英式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low sound showing pain, sadness, tiredness, or strong physical feeling","zh":"（因疼痛、悲伤、疲惫或强烈身体感受而发出的）低声呻吟"},"examples":[{"en":"A soft moan came from the next room.","zh":"隔壁房间传来一声轻轻的呻吟。"},{"en":"His moans showed how much pain he was in.","zh":"他的呻吟显示他有多痛。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a low sound because you are in pain, unhappy, or very tired","zh":"（因疼痛、不开心或很累而）呻吟，呜咽"},"examples":[{"en":"She moaned when she tried to stand up.","zh":"她试着站起来时呻吟了一声。"},{"en":"He lay on the couch, moaning about his headache.","zh":"他躺在沙发上，因头痛而呻吟抱怨。"}]},{"partOfSpeech":"v.","definition":{"en":"to complain in an annoying or repeated way (often used in British English)","zh":"（常用于英式英语）抱怨，发牢骚（带有反复、让人烦的感觉）"},"examples":[{"en":"Stop moaning and help me fix the problem.","zh":"别再抱怨了，来帮我把问题解决掉。"},{"en":"He’s always moaning about the weather.","zh":"他总是在抱怨天气。"}]}],"synonyms":["groan","whimper","complain"],"phonetic":"/moʊn/","extraExplanation":["“moan”在英语里既可以比较中性地表示“疼痛/难受的呻吟”，也可能在特定语境中带有成人意味（如“sexual moan”）。日常学习或正式场合一般用在“疼痛、疲惫、悲伤或抱怨”的意思更安全。","与“groan（呻吟/叹息）”相比：groan 常更像“压抑的、较大声的叹气/呻吟”（也常表示对无聊或不满的反应）；moan 更偏“持续、低沉”的声音。"]}
{"word":"moaned","summary":{"en":"“Moaned” means made a long, low sound (often from pain, sadness, tiredness) or complained in a tired/annoyed way.","zh":"“moaned”指发出低沉拉长的声音（常因疼痛、悲伤、疲惫等），也可指以疲惫/不满的语气抱怨。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of moan) to make a long, low sound showing pain, sadness, tiredness, or pleasure.","zh":"（moan 的过去式/过去分词）发出持续、低沉的声音，表示疼痛、悲伤、疲惫或愉悦。"},"examples":[{"en":"He moaned in pain when he tried to stand up.","zh":"他试着站起来时疼得呻吟了一声。"},{"en":"The old door moaned as it opened.","zh":"旧门打开时发出低沉的吱呀声。"},{"en":"“I’m so tired,” she moaned.","zh":"“我太累了，”她抱怨/哼哼道。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of moan) to complain in an unhappy, tired, or annoyed way.","zh":"（moan 的过去式/过去分词）以不开心、疲惫或恼火的语气抱怨。"},"examples":[{"en":"He moaned about the long meeting all afternoon.","zh":"他整个下午都在抱怨会议太长。"},{"en":"They moaned that the bus was late again.","zh":"他们抱怨公交车又迟到了。"}]}],"synonyms":["groaned","whined","complained","lamented"],"phonetic":"/moʊnd/","extraExplanation":["“moaned”除了表示“呻吟”，也常用于写作里描写风声、门轴等发出的低沉拉长的声音，带有一种阴郁或疲惫的氛围。","在某些语境中，“moan”也可能带有亲密/性暗示的“低声喘吟”含义；如果不确定语境，日常表达中用“groaned（痛苦/不满地哼声）”或“complained（抱怨）”会更中性。"]}
{"word":"moaner","summary":{"en":"A moaner is usually someone who complains a lot; informally, it can also mean someone who moans aloud.","zh":"moaner 通常指“爱抱怨的人”；在非正式语境中也可指“会发出呻吟声的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who complains a lot, especially in an annoying way.","zh":"爱抱怨的人；总是发牢骚的人（常带贬义，觉得很烦）。"},"examples":[{"en":"Don’t be such a moaner—let’s try to solve the problem.","zh":"别老抱怨了——我们来想办法解决问题。"},{"en":"He’s known as a moaner at work because he complains about everything.","zh":"他在公司里出了名爱抱怨，因为什么都要吐槽。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Someone who makes low sounds (moans), for example because of pain or pleasure.","zh":"（非正式）发出呻吟声的人（例如因为疼痛或愉悦）。"},"examples":[{"en":"In the next room, a moaner kept everyone awake.","zh":"隔壁房间里一直有人呻吟，吵得大家睡不着。"}]}],"synonyms":["complainer","whiner","grumbler"],"phonetic":"/ˈmoʊnɚ/","extraExplanation":["在英式英语里，moaner 很常见，常指“爱抱怨的人”，语气通常不太友好。美式英语里也能用，但更常见的说法是 complainer。","注意语境：在医疗/疼痛语境里 moaner 可能仅指“呻吟的人”；但在日常对话中更常被理解为“爱抱怨的人”。根据场合选择更中性的词（如 someone who complains a lot）。"]}
{"word":"moanful","summary":{"en":"Moanful means “full of moaning” or “sounding sadly/complainingly,” and it’s rare/old-fashioned in modern English.","zh":"moanful 指“充满呻吟/哀叹的、听起来悲伤或抱怨的”，在现代英语中较少见、偏旧式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of moaning; expressing sadness, pain, or complaint in a low, mournful way.","zh":"充满呻吟声的；带有哀伤、痛苦或抱怨的（低沉）呻吟意味的。"},"examples":[{"en":"A moanful wind moved through the empty hallway.","zh":"哀哀如诉的风穿过空荡的走廊。"},{"en":"He gave a moanful sigh when he saw the bill.","zh":"他看到账单时发出一声带着抱怨与无奈的叹息。"},{"en":"The song has a moanful tone that makes it feel heartbreaking.","zh":"这首歌的基调低回哀怨，让人觉得很揪心。"}]}],"synonyms":["mournful","plaintive","woeful","sorrowful","lamenting"],"phonetic":"/ˈmoʊn.fəl/","extraExplanation":["“moanful”在现代英语里非常少见，更多时候人们会用“mournful / plaintive / sorrowful”来表达类似意思。你也可能想写的是“mournful”（更常用，意思是“悲伤的、哀悼的”）。","构词上它是“moan（呻吟、哀叹）+ -ful（充满……的）”，语气通常偏文学化，带有“声音上的哀怨/低吟”感觉，而不一定是正式的“哀悼”。"]}
{"word":"moanfully","summary":{"en":"“Moanfully” means ‘in a moaning, plaintive way,’ often suggesting pain, sorrow, or complaint.","zh":"“Moanfully”意为“呻吟般地、哀怨地”，常暗示痛苦、悲伤或抱怨的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a moaning, plaintive, or sorrowful way; as if making low sounds of pain, grief, or complaint.","zh":"以呻吟的、哀怨的方式；带着痛苦、悲伤或抱怨的语气（仿佛在发出低沉的呻吟声）。"},"examples":[{"en":"The injured man spoke moanfully, barely able to finish a sentence.","zh":"受伤的男人呻吟般地说话，几乎连一句话都说不完。"},{"en":"The wind moved through the empty house moanfully, like a sad song.","zh":"风穿过空荡的房子，发出哀怨的声音，像一首悲伤的歌。"},{"en":"The puppy whined moanfully at the door, wanting to be let in.","zh":"小狗在门口哀鸣般地呜咽着，想让人把它放进来。"}]}],"synonyms":["plaintively","sadly","sorrowfully","mournfully","piteously"],"phonetic":"/ˈmoʊn.fəli/","extraExplanation":["“moanfully”是由形容词“moanful（哀怨的、充满呻吟的）”加上副词后缀“-ly”构成，意思很直观，但在现代英语里相对少见。","日常写作中更常用的是“mournfully（悲伤地、哀悼地）”，侧重“内心的悲伤/哀悼”；而“moanfully”更强调“发出呻吟/哀声的感觉”，常用于描写声音、风声、人的说话方式等带有“呻吟般”的效果。"]}
{"word":"moanification","summary":{"en":"“Moanification” is a humorous, nonstandard word meaning “the process of making something into moaning/complaining (or making it sound like a moan).”","zh":"“moanification”是一个幽默的非标准词，大意是“让某事变成呻吟/抱怨的状态（或让某物发出类似呻吟的声音）的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Humorous, nonstandard) the process of turning something into a moan (a low sound of pain/pleasure) or into moaning/complaining behavior; making something more “moan-like.”","zh":"（幽默、非标准用法）把某事变成“呻吟/哼哼”或让人不断抱怨、哼哼唧唧的过程；使某物更“像在呻吟/抱怨”。"},"examples":[{"en":"The movie’s trailer felt like pure moanification—everyone was sighing and complaining instead of talking normally.","zh":"那部电影的预告片简直是“moanification”——所有人都在叹气抱怨，没人好好说话。"},{"en":"Stop the moanification of this meeting and tell us the plan in one sentence.","zh":"别把这次会议搞成“moanification”了，用一句话把计划说清楚。"},{"en":"In the novel, the wind’s moanification makes the house feel alive and uneasy.","zh":"在小说里，风的“moanification（被写得像在呻吟）”让房子显得有生命又令人不安。"}]}],"synonyms":["(nonstandard) complainification","moaning","complaining","(possible intended word) modification"],"phonetic":"/ˌmoʊn.ə.fɪˈkeɪ.ʃən/","extraExplanation":["“moanification”不是常见、规范的英语词，在主流词典里一般查不到；更像是把 moan（呻吟/抱怨）+ -ification（“……化/使成为/……的过程”）临时拼出来的戏谑词。","如果你是想写“modification”（修改、改造），拼写非常接近：moanification（m-o-a-n-…） vs modification（m-o-d-…）。"]}
{"word":"moaning","summary":{"en":"Moaning is a long, low sound—or the act of making it—often showing pain, sadness, tiredness, or complaint.","zh":"moaning 指（发出）长而低的呻吟/哀叹声，常表达痛苦、难过、疲惫或抱怨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, low sound showing pain, unhappiness, tiredness, or frustration.","zh":"（因疼痛、不开心、疲惫或沮丧而发出的）呻吟声、低声哀叹。"},"examples":[{"en":"I heard moaning coming from the next room.","zh":"我听到隔壁房间传来呻吟声。"},{"en":"His moaning showed he was still in pain.","zh":"他的呻吟表明他仍然很痛。"}]},{"partOfSpeech":"v.","definition":{"en":"Making a long, low sound to show pain, unhappiness, tiredness, or frustration.","zh":"（因疼痛、不开心、疲惫或沮丧而）呻吟、低声哀叹。"},"examples":[{"en":"She was moaning softly in her sleep.","zh":"她在睡梦中轻轻地呻吟。"},{"en":"He kept moaning about how unfair it was.","zh":"他一直抱怨这太不公平了。"}]}],"synonyms":["groaning","whining","complaining","lamenting"],"phonetic":"/ˈmoʊnɪŋ/","extraExplanation":["“moan”既可以指真实的身体疼痛或难过时发出的声音，也常用于口语里表示“抱怨、牢骚”（moan about）。在英式英语中，“to moan”表示“抱怨”更常见一些。","文学作品里常用“moaning wind / moaning trees”（呜咽的风/树）来描写带有悲凉、阴郁气氛的自然声音，这是一种拟人化表达。注意语境：在成人语境中，“moaning”也可能指性快感的声音；日常学习与写作时，用前两种含义最安全、最常见。"]}
{"word":"moaningly","summary":{"en":"Moaningly means ‘in a moaning way,’ either making a low sound of pain/sadness or speaking in a complaining tone.","zh":"moaningly 表示“像呻吟那样地”，可指发出痛苦/悲伤的低声，也可指用抱怨、哀怨的语气说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that sounds like a moan (a low, long sound showing pain, sadness, tiredness, or pleasure).","zh":"以呻吟（低沉、拖长的声音）方式；发出呻吟般地。"},"examples":[{"en":"He called her name moaningly, as if he were in pain.","zh":"他呻吟般地呼唤她的名字，仿佛很痛苦。"},{"en":"The injured dog lay on the ground, breathing moaningly.","zh":"受伤的狗躺在地上，喘息声像在呻吟。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that expresses repeated complaining or unhappy feelings (often through a moaning tone).","zh":"（多指语气）抱怨地；哀怨地；带着不满地。"},"examples":[{"en":"“It’s not fair,” she said moaningly.","zh":"“这不公平，”她用哀怨的语气抱怨道。"},{"en":"He spoke moaningly about how hard everything was.","zh":"他带着抱怨的语气说一切都很难。"}]}],"synonyms":["complainingly","plaintively","mournfully","wretchedly","dolorously"],"phonetic":"/ˈmoʊnɪŋli/","extraExplanation":["“moaningly”来自动词“moan”（呻吟/哀鸣/抱怨）+ 副词后缀“-ly”。在现代英语里不算特别常见，更常见的表达是“with a moan”“in a moaning voice”或直接用“moaning”作副词用法（例如：He said, moaning, ...）。","写作中它常用来营造情绪（痛苦、疲惫、哀伤或抱怨的语气）。正式写作里可以用“complainingly / plaintively”来替换，以避免重复“moan”的声音感。"]}
{"word":"moanless","summary":{"en":"Moanless means “without a moan”—not groaning or complaining (rare in modern use).","zh":"moanless 表示“无呻吟地/不抱怨地”（现代用法较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Not making a moan; without a moan (without groaning or complaining).","zh":"（罕见）不发出呻吟；无呻吟地（也可指不抱怨地）。"},"examples":[{"en":"He endured the painful treatment moanless, refusing to alarm his family.","zh":"他无声地忍受着痛苦的治疗，不想让家人担心。"},{"en":"The injured dog lay moanless in the corner, too weak to cry.","zh":"受伤的狗无声地蜷在角落里，虚弱得连叫都叫不出来。"},{"en":"She carried the extra workload moanless, even when it felt unfair.","zh":"即使觉得不公平，她也不抱怨地扛下了额外的工作。"}]}],"synonyms":["without a moan","silent","uncomplaining","without complaint","wordless"],"phonetic":"/ˈmoʊn.ləs/","extraExplanation":["“moanless”由“moan（呻吟/抱怨）+ -less（没有……的）”构成，但在现代英语里非常少见，很多时候更自然的表达是“without a moan / without complaint / silently / without a sound”。","写作中用它会带一点文学或刻意的色彩，适合强调“强忍、克制、无声承受”的感觉。"]}
{"word":"moans","summary":{"en":"“Moans” can mean repeated low sounds of pain/sadness (noun), or it can be the verb form meaning “makes such a sound” or “complains.”","zh":"“Moans”既可以指“呻吟声”（名词复数），也可以作动词表示“发出呻吟/吱呀声”或“抱怨”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"low, long sounds showing pain, sadness, tiredness, or pleasure (plural form of \"moan\")","zh":"表示疼痛、悲伤、疲惫或愉悦的低沉、拖长的声音（“moan”的复数名词）"},"examples":[{"en":"We heard moans coming from the next room.","zh":"我们听到隔壁房间传来呻吟声。"},{"en":"The hospital corridor was filled with moans and whispers.","zh":"医院走廊里充满了呻吟和低语。"}]},{"partOfSpeech":"v.","definition":{"en":"makes a low, long sound because of pain, sadness, tiredness, or pleasure (third-person singular of \"moan\")","zh":"因疼痛、悲伤、疲惫或愉悦而发出低沉、拖长的声音（“moan”的第三人称单数）"},"examples":[{"en":"He moans when he tries to stand up.","zh":"他一试着站起来就会呻吟。"},{"en":"The old door moans in the wind.","zh":"那扇旧门在风中吱呀作响。"}]},{"partOfSpeech":"v.","definition":{"en":"complains in a tired or annoying way (third-person singular of \"moan\")","zh":"用疲惫或让人烦的方式抱怨（“moan”的第三人称单数）"},"examples":[{"en":"She always moans about the weather.","zh":"她总是抱怨天气。"},{"en":"He moans that the work is too hard, but he never asks for help.","zh":"他抱怨工作太难，但从不求助。"}]}],"synonyms":["groans","whimpers","cries","complains","whines"],"phonetic":"/moʊnz/","extraExplanation":["“moan”常指更持续、更柔弱的“呻吟/哀叹”，而“groan”通常更粗重，常带有用力、痛苦或厌烦的感觉。","“The door moans”这类用法是拟人化（personification），把物体发出的吱呀声写得像人在呻吟，常见于文学描写氛围。"]}
{"word":"moaria","summary":{"en":"Moaria is usually a rare personal name or a spelling variant (often of Moira or Moriah), not a common English vocabulary word.","zh":"Moaria 通常是少见的人名或拼写变体（常见于 Moira 或 Moriah），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare personal name (given name). It is not a common standard English word; in English contexts it is usually treated as a name or a creative spelling.","zh":"一个较少见的人名（名字）。它不是常见的标准英语单词；在英语语境中通常被当作姓名或创意拼写来使用。"},"examples":[{"en":"Moaria moved to Seattle last year for a new job.","zh":"Moaria 去年搬到西雅图开始了一份新工作。"},{"en":"I’m not sure how to pronounce Moaria—could you say it for me?","zh":"我不太确定 Moaria 怎么读——你可以读一下吗？"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling or variant spelling of similar-looking names/words such as **Moira** (a name; also “fate/destiny” in Greek mythology) or **Moriah** (a biblical place name used as a given name).","zh":"常见于对相近拼写的名字/词的误拼或变体拼写，例如 **Moira**（人名；在希腊神话中也有“命运”的含义）或 **Moriah**（《圣经》中的地名，也常用作人名）。"},"examples":[{"en":"Did you mean Moira instead of Moaria?","zh":"你想写的是 Moira 而不是 Moaria 吗？"},{"en":"Some people spell the name in different ways, so Moaria may be a variant.","zh":"有些人会用不同拼写写同一个名字，所以 Moaria 可能是一种变体。"}]}],"synonyms":["Moira","Moriah","Maria"],"phonetic":"/moʊˈɑːriə/","extraExplanation":["“moaria”在主流英语词典里通常找不到作为普通词汇的条目，更常见的情况是：它是一个少见名字、创意拼写，或把“Moira / Moriah / Maria”等词拼错了。","如果你能告诉我它出现的句子（或你想表达的意思/来源国家），我可以更准确判断：是人名、地名，还是你原本要查的其他单词。"]}
{"word":"moarian","summary":{"en":"Moarian (adj.) is a rare technical word meaning ‘related to a hypothetical ancient continent represented today mainly by New Zealand and nearby Polynesian areas.’","zh":"Moarian（形容词）是很少见的学术用词，表示“与一种假设的古大陆有关；该大陆如今主要由新西兰及附近的波利尼西亚地区所代表”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a hypothetical ancient continent (sometimes called *Moaria*) thought to have included what is now New Zealand and nearby parts of Polynesia.","zh":"（形容词）与一种假设的古大陆（有时称为 *Moaria*）有关；该大陆被认为曾包含如今的新西兰及波利尼西亚附近的一些地区。"},"examples":[{"en":"Some older geology texts mention a Moarian landmass to explain patterns in New Zealand’s plants and animals.","zh":"一些较早的地质学书籍会提到“Moarian 古陆”，用来解释新西兰动植物分布的模式。"},{"en":"The paper compares Moarian biogeography with other southern-hemisphere continental fragments.","zh":"这篇论文把“Moarian 生物地理”与其他南半球大陆碎片进行比较。"}]}],"synonyms":["Zealandian (rare/technical)","New Zealand–related (general)"],"phonetic":"/moʊˈɑriən/","extraExplanation":["“Moarian”是一个非常少见、偏学术的词，主要出现在较早的地质学/生物地理学语境里，用来指一个“假设存在过的大陆区域”。现代研究更常用“Zealandia（西兰大陆/西兰迪亚）”等术语来讨论新西兰所属的大陆地壳块。","词源上，它与英文“moa（恐鸟，新西兰已灭绝的大型鸟类）”有关，再加上表示“……的/与……有关”的后缀 -an，因此带有“与（moa/新西兰古陆概念）相关”的色彩。","如果你是在写作或日常对话中遇到的“moarian”，也可能是拼写错误（例如想写：Māorian / Maori（毛利人的/毛利语的）或 Mauritanian（毛里塔尼亚的））。如果你告诉我上下文句子，我可以帮你确认。"]}
{"word":"moas","summary":{"en":"“Moas” most commonly means the plural of “moa,” an extinct, large flightless bird from New Zealand. In some contexts, it can also be the plural of the abbreviation “MOA,” depending on the field.","zh":"“moas”最常见指“moa（恐鸟）”的复数：一种新西兰已灭绝的大型不会飞的鸟。在某些语境中也可能是缩写“MOA”的复数，具体含义取决于领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **moa**: a very large, flightless bird that once lived in New Zealand and is now extinct.","zh":"**moa（恐鸟）**的复数：一种曾生活在新西兰、体型很大且不会飞的鸟类，现已灭绝。"},"examples":[{"en":"Scientists study **moas** to understand how New Zealand’s ecosystems changed after humans arrived.","zh":"科学家研究**恐鸟（moas）**，以了解人类到来后新西兰生态系统如何变化。"},{"en":"The museum has fossils of **moas** from different regions of New Zealand.","zh":"博物馆收藏了来自新西兰不同地区的**恐鸟化石**。"}]},{"partOfSpeech":"other","definition":{"en":"An informal plural form used for **MOA** (an abbreviation) in some fields, meaning more than one “MOA.” The exact meaning depends on the context.","zh":"在一些领域里作为缩写 **MOA** 的复数写法，表示多个“MOA”。具体指什么取决于语境。"},"examples":[{"en":"The shooter adjusted the scope by a few **MOAs** to correct the aim.","zh":"射手把瞄准镜调整了几**MOA**来修正瞄准点。"},{"en":"Different companies track their marketing results with different **MOAs**, depending on their internal terms.","zh":"不同公司会用不同的 **MOA**（内部术语不一）来追踪营销结果。"}]}],"synonyms":["moa (plural: moas)"],"phonetic":"/ˈmoʊ.ə/","extraExplanation":["“moas”最常见的词义是新西兰“恐鸟（moa）”的复数。moa 是英语里一个比较有文化与自然史色彩的词，常出现在博物馆、考古、生态与新西兰相关主题中。","如果你是在特定领域看到 “MOAs/moas”，它可能是缩写：例如射击与弹道学里 MOA 常指 *minute of angle*（角分，用来描述瞄准误差/调整量）。也可能是某个组织或项目名称的缩写。你可以告诉我你看到它的句子/场景，我能给出最准确的释义。"]}
{"word":"moat","summary":{"en":"A moat is a defensive ditch around a castle; figuratively, it means a protective advantage that keeps rivals out.","zh":"moat 指城堡周围的护城河；引申为能抵御竞争、保护自身的优势或壁垒（“护城河”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A deep, wide ditch (often filled with water) around a castle or fortress to make it harder for enemies to enter.","zh":"（城堡或要塞周围的）护城河；（常）有水的深而宽的壕沟，用来阻止敌人进入。"},"examples":[{"en":"The castle was protected by a wide moat.","zh":"这座城堡由一条宽阔的护城河保护。"},{"en":"They crossed the moat on a wooden bridge.","zh":"他们通过一座木桥跨过护城河。"},{"en":"In many fairy tales, a moat keeps danger away from the princess’s castle.","zh":"在许多童话里，护城河让危险远离公主的城堡。"}]},{"partOfSpeech":"n.","definition":{"en":"A strong advantage or barrier that keeps something safe from competitors or threats (often in business or strategy).","zh":"（比喻）“护城河”：能保护自己免受竞争或威胁的强大优势或壁垒（常用于商业/战略语境）。"},"examples":[{"en":"A trusted brand can be a company’s moat.","zh":"值得信赖的品牌可以成为一家公司的“护城河”。"},{"en":"High switching costs create a moat against competitors.","zh":"较高的转换成本会形成抵御竞争者的“护城河”。"}]}],"synonyms":["ditch","trench","defensive barrier","(figurative) advantage","(figurative) protective barrier"],"phonetic":"/moʊt/","extraExplanation":["“moat”最常见于中世纪城堡语境；现代英语里常被借用作商业隐喻（例如投资人说“economic moat/经济护城河”），强调“防御性优势”。","相关搭配：a water-filled moat（有水的护城河）, a dry moat（干护城河）, cross the moat（跨过护城河）, build/maintain a moat（建立/维持护城河）。"]}
{"word":"moated","summary":{"en":"Moated means surrounded by a moat; figuratively, it can mean strongly protected from competition.","zh":"moated 表示“有护城河围绕的”；也可比喻“有强大防御优势、难以被竞争”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Surrounded or protected by a moat (a deep, wide ditch, often filled with water).","zh":"被护城河（常为深而宽、可能蓄水的沟渠）环绕或保护的。"},"examples":[{"en":"The old castle is moated, with a stone bridge leading to the gate.","zh":"那座古堡有护城河，石桥通向城门。"},{"en":"They toured a moated manor house in the countryside.","zh":"他们参观了乡间一座有护城河的庄园宅邸。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Strongly protected or hard to compete with, often because of a special advantage.","zh":"（比喻）防护很强、难以竞争的（常因拥有独特优势）。"},"examples":[{"en":"Investors like moated businesses that can defend profits over time.","zh":"投资者喜欢“护城河深”的企业，因为它们能长期守住利润。"},{"en":"A widely trusted brand can be a moated advantage.","zh":"广受信任的品牌可能就是一种“护城河”式优势。"}]}],"synonyms":["surrounded","fortified","protected","defended","defensible"],"phonetic":"/ˈmoʊtɪd/","extraExplanation":["“moated”来自“moat（护城河）”。在历史语境里，护城河常用于防御城堡或庄园；在现代商业语境里，“economic moat（经济护城河）”很常见，指企业能长期抵御竞争的优势（例如品牌、网络效应、专利、规模成本等）。","文学/历史写作中常见搭配：moated castle（有护城河的城堡）、moated manor（有护城河的庄园）。比喻用法常与“defensible（可防守的）”“hard to replicate（难以复制的）”一起出现。"]}
{"word":"moathill","summary":{"en":"Moathill is usually an Irish place name (a townland), especially in County Meath; it can also refer locally to a “moat hill,” a mound/earthwork rather than a water-filled moat.","zh":"Moathill 通常是爱尔兰地名（townland），常见于米斯郡；也可能在当地语境中指“堡丘/土丘遗址”（并非一定有水的护城河）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A place name in Ireland—most commonly a small rural land division (a “townland”) called **Moathill** in County Meath (near Navan).","zh":"（专有名词）爱尔兰的地名——最常见指**米斯郡（County Meath）纳文（Navan）附近**一个名为 **Moathill** 的小型乡村土地分区（townland）。"},"examples":[{"en":"My family records mention a farm in Moathill, near Navan in County Meath.","zh":"我家的族谱资料提到在米斯郡纳文附近的 Moathill 有一处农场。"},{"en":"The Navan motte is often discussed in connection with Moathill.","zh":"谈到 Moathill 时，人们常会提到纳文的土堡（motte）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, context-based) A spelling/label sometimes used locally for **“moat hill”**—a raised mound/earthwork (often a motte or ancient mound) associated with an old fortification or landmark.","zh":"（较少见，依语境）有时被当作 **“moat hill（土丘/堡丘）”** 的写法或标签——指与古代防御工事或地标相关的隆起土丘（土筑遗址，常见为 motte 或更古老的土冢）。"},"examples":[{"en":"On the map, “Moathill” refers to the old moat hill where the earthwork once stood.","zh":"在地图上，“Moathill”指的是那座曾有土筑遗址的“堡丘”。"},{"en":"Visitors asked why the area is called Moathill when there’s no water moat.","zh":"游客会问：那里没有护城河，为什么还叫 Moathill？"}]}],"synonyms":["Moat Hill","Navan Moat (related place name)","motte (related term)","townland (related term)"],"phonetic":"ˈmoʊtˌhɪl","extraExplanation":["“Moathill”更像是**地名/专名**，不是日常英语词汇。你如果是在文章、地图或家谱里看到它，通常应理解为爱尔兰的一个具体地点（例如米斯郡纳文附近的 townland）。","在爱尔兰语境里，**moat** 有时并不指“有水的护城河”，而会被民间用来称呼某些**土丘、古堡丘或土筑遗址**（例如 motte）。所以 Moathill 也可能与“某个土丘/堡丘地标”有关。","它也容易与英语词组 **moot hill**（古英格兰集会用的山丘）混淆；两者拼写相近，但含义与历史背景不同。若你告诉我你看到“moathill”的句子/截图，我可以帮你判断到底是地名还是在说土丘遗址。"]}
{"word":"moating","summary":{"en":"“Moating” means building/adding a moat for defense, or (figuratively) creating a strong protective barrier—often used in business for building a competitive “moat.”","zh":"“Moating”指修建/增设护城河以防御；也可作比喻，指建立难以逾越的保护性壁垒（商业中常指打造竞争“护城河”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of digging, building, or adding a moat (a deep, wide ditch, often filled with water) around a place for protection","zh":"挖掘、建造或增设护城河（通常很深很宽，常蓄水）以保护某处的行为"},"examples":[{"en":"Medieval castles sometimes relied on moating to slow down attackers.","zh":"中世纪的城堡有时会依靠修建护城河来拖慢进攻者。"},{"en":"The museum’s renovation included moating the inner garden to guide foot traffic.","zh":"博物馆翻修时在内庭周围设置了“护城河式”的水渠，用来引导人流。"}]},{"partOfSpeech":"v.","definition":{"en":"surrounding something with a moat; (more broadly) protecting something by creating a strong barrier that is hard to cross","zh":"用护城河环绕某物；（引申）通过建立难以跨越的“屏障”来保护某物"},"examples":[{"en":"The fortress was moating its walls to make a direct assault difficult.","zh":"要塞在城墙外挖护城河，使正面进攻更困难。"},{"en":"The company is moating its core product with patents and exclusive partnerships.","zh":"这家公司用专利和独家合作来为核心产品建立“护城河”。"},{"en":"Some neighborhoods feel like they’re moating themselves off from the rest of the city.","zh":"有些社区给人的感觉像是在把自己与城市其他区域“隔离开来”。"}]}],"synonyms":["fortifying","protecting","ring-fencing","shielding","entrenching"],"phonetic":"/ˈmoʊtɪŋ/","extraExplanation":["“moating”多半是动词“moat”的现在分词/动名词形式。名词“moat”本义是“护城河”。","商业语境里常说“economic moat（经济护城河）”，指企业长期竞争优势（如品牌、网络效应、成本优势、专利等）。因此“moating a business/product”就是“打造护城河、提高竞争壁垒”。","写作中它也常用于比喻：不一定真有水沟，而是用各种方式把某物“围起来”，让别人更难进入、接近或攻击。"]}
{"word":"moatlike","summary":{"en":"“Moatlike” means “like a moat,” often describing something shaped like a moat or acting as a protective barrier.","zh":"“moatlike”意为“像护城河的”，常形容外形像护城河或起到隔离、防护作用的东西。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a moat (a deep, wide ditch, often filled with water, that surrounds a castle or wall).","zh":"像护城河的；类似护城河（护城河是城堡或城墙周围又深又宽、常有水的沟）。"},"examples":[{"en":"The fortress sat behind a moatlike trench that made the entrance hard to reach.","zh":"那座堡垒后面有一条护城河般的壕沟，让入口很难接近。"},{"en":"Tall hedges formed a moatlike barrier around the garden.","zh":"高高的树篱在花园周围形成了护城河般的屏障。"}]}],"synonyms":["moat-like","ditchlike","trenchlike","protective"],"phonetic":"/ˈmoʊtˌlaɪk/","extraExplanation":["“moatlike”是由名词“moat（护城河）”加后缀“-like（像……一样）”构成的形容词，常用于写作中做比喻：不一定真的有水或是护城河，而是强调“把某物隔开、保护起来、让人难以接近”的感觉。","搭配提示：moatlike + trench/ditch/barrier/defenses（壕沟/沟渠/屏障/防御）。","近义表达（语气更常见）：“like a moat”“moat-like”（也常写作带连字符的形式）。"]}
{"word":"moats","summary":{"en":"Moats usually means the ditches around castles for defense, and it can also mean strong competitive advantages that protect a company.","zh":"Moats 通常指城堡周围用于防御的护城河；也可比喻公司抵御竞争的强大优势（“护城河”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deep, wide ditches (often filled with water) built around a castle or town wall to make it harder for enemies to attack.","zh":"（常有水的）护城河；围绕城堡或城墙挖的又深又宽的沟，用来防御敌人进攻。"},"examples":[{"en":"The medieval castle was protected by high walls and a wide moat.","zh":"这座中世纪城堡由高墙和宽阔的护城河保护。"},{"en":"They crossed the moat on a wooden bridge to reach the gate.","zh":"他们走过一座木桥跨越护城河到达城门。"}]},{"partOfSpeech":"n.","definition":{"en":"A strong advantage that protects a business or organization from competitors (often used in finance and business).","zh":"（商业/投资）“护城河”：能抵御竞争对手的强大优势。"},"examples":[{"en":"A well-known brand and loyal customers can be a company’s moat.","zh":"知名品牌和忠实客户可以成为公司的“护城河”。"},{"en":"Investors often look for companies with moats such as patents or network effects.","zh":"投资者常寻找拥有“护城河”的公司，例如专利或网络效应。"}]},{"partOfSpeech":"v.","definition":{"en":"To surround or protect something by creating a barrier, as if building a moat (less common).","zh":"（较少见）像挖护城河一样把……围起来/隔离起来以保护。"},"examples":[{"en":"The palace was moated to make it harder to invade.","zh":"这座宫殿周围挖了护城河，使其更难被攻入。"}]}],"synonyms":["ditch","trench","defensive barrier","competitive advantage"],"phonetic":"/moʊts/","extraExplanation":["“moats”是“moat”的复数形式，也可以是动词第三人称单数（He moats...），但日常最常见是名词复数。","商业语境里的“moat（护城河）”是比喻用法：把公司的竞争优势想象成护城河，让对手更难“攻进来”。这个说法在投资圈很常见。"]}
{"word":"moattalite","summary":{"en":"Moattalite is a rare spelling meaning a Mu'tazilite (a member of the Mu'tazila school of Islamic theology).","zh":"Moattalite 是很少见的拼写，意思是 Mu'tazilite：穆尔太齐赖派（Mu'tazila）伊斯兰神学思想流派的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A member of the Mu'tazila (Mu'tazilite) school of Islamic theology; a Mu'tazilite.","zh":"（罕见用法）穆尔太齐赖派（Mu'tazila／Mu'tazilite，伊斯兰神学思想流派）的成员；穆尔太齐赖派信徒/学者。"},"examples":[{"en":"Some older English writings refer to Mu'tazilites as Moattalites.","zh":"一些较早的英文著作会把 Mu'tazilites 写作 Moattalites。"},{"en":"The Moattalite tradition is often discussed in the context of early Islamic theology.","zh":"谈到早期伊斯兰神学时，常会提及穆尔太齐赖派（Moattalite／Mu'tazilite）的传统。"}]}],"synonyms":["Mu'tazilite","Mu'tazila member"],"phonetic":"/ˈmoʊ.ə.təˌlaɪt/","extraExplanation":["“moattalite”更常见于较旧或不规范的拼写法，在现代英文里通常写作 **Mu'tazilite**（指 Mu'tazila 学派的成员）。([en.wiktionary.org](https://en.wiktionary.org/wiki/Moattalite))","Mu'tazila 通常被描述为早期伊斯兰历史中的“理性主义（rationalist）神学”传统之一，常与 *kalām*（思辨神学）讨论相关。([en.wikipedia.org](https://en.wikipedia.org/wiki/Mu%27tazilism?utm_source=openai))","如果你是在阅读历史/宗教学术文本，遇到“Moattalite”，一般可以直接等同理解为“Mu'tazilite”。平时写作和检索建议用更通行的拼写 **Mu'tazilite / Mu'tazila**，更容易查到资料。"]}

