{"word":"mob","summary":{"en":"Mob means a large, often unruly crowd, or the act of crowding around someone aggressively.","zh":"mob 指（常带负面意味的）一大群人/暴民，也可作动词表示蜂拥围住某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large crowd of people, especially one that may become noisy, angry, or violent.","zh":"（尤指可能变得吵闹、愤怒或暴力的）一大群人，乌合之众。"},"examples":[{"en":"A mob gathered outside the courthouse after the verdict.","zh":"判决宣布后，一群人聚集在法院外。"},{"en":"The police formed a line to keep the mob back.","zh":"警察排成一列把人群挡住。"}]},{"partOfSpeech":"v.","definition":{"en":"To crowd around someone or something in an excited or aggressive way.","zh":"（兴奋或带攻击性地）围住；蜂拥而上。"},"examples":[{"en":"Fans mobbed the singer as she left the hotel.","zh":"歌迷在歌手离开酒店时一拥而上把她围住。"},{"en":"Reporters mobbed the actor for a comment.","zh":"记者蜂拥而上想让那位演员发表评论。"}]}],"synonyms":["crowd","throng","rabble","horde","swarm"],"phonetic":"/mɑb/","extraExplanation":["“mob”常带有负面语气：不仅是“很多人”，还暗示缺乏秩序、情绪容易失控。中性表达“人群”更常用 crowd。","文化语境中常见搭配：mob violence（暴力骚乱）、mob rule（多数人的暴政/暴民统治）、lynch mob（私刑暴徒）。在新闻或历史文本里出现较多。","词源提示：mob 来自拉丁语短语“mobile vulgus”（意为“易变的群众”），所以它常暗示“情绪化、容易被煽动”。"]}
{"word":"mobable","summary":{"en":"“Mobable” isn’t standard English. It’s usually a misspelling of **movable** (able to be moved) or sometimes **mobile** (moving/phone-related).","zh":"“mobable”不是标准英语词，通常是 **movable（可移动的）** 的拼写错误，有时也可能想写 **mobile（移动的/手机相关的）**。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not a standard word) Likely a misspelling of **movable**: able to be moved; not fixed in one place.","zh":"（非标准英语词）很可能是 **movable** 的拼写错误：可移动的；不固定的。"},"examples":[{"en":"This shelf is movable, so you can change the room layout easily.","zh":"这个架子是可移动的，所以你可以很容易地调整房间布局。"},{"en":"Use a movable divider to create a little study area.","zh":"用一个可移动的隔断来隔出一个小学习区。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Not a standard word) Sometimes used when someone means **mobile**: able to move or be moved easily; also ‘related to phones/portable devices’ in modern English.","zh":"（非标准英语词）有时是想写 **mobile**：可移动的；也可指“手机/移动设备相关的”（现代英语常用义）。"},"examples":[{"en":"Mobile workers often travel between different job sites.","zh":"移动办公的人常常在不同的工作地点之间奔波。"},{"en":"Our website is mobile-friendly.","zh":"我们的网站对手机端很友好。"}]},{"partOfSpeech":"v.","definition":{"en":"Note: **moble** (without “-a-”) is a real but **archaic** verb meaning ‘to wrap or muffle the head (as with a hood).’ This is different from what most people intend when they type “mobable.”","zh":"提示：**moble**（不带 -a-）确实是一个真实单词，但属于**古语**动词，意思是“用兜帽等把头包住/蒙住”。这通常不是大家打出 “mobable” 时想表达的意思。"},"examples":[{"en":"In older writing, someone might be described as mobled in a hood.","zh":"在较老的文字里，可能会写某人用兜帽把头蒙住（mobled）。"}]}],"synonyms":["movable","mobile","portable","removable","shiftable"],"phonetic":"/ˈmuːvəbəl/","extraExplanation":["“mobable”在常见词典里通常找不到，最常见的两种目标词是 movable（可移动的）或 mobile（移动的/手机端的）。你可以告诉我你看到它的句子（原句一整句），我可以帮你判断到底应该用哪一个。","拼写小提示：movable 来自 move + -able（表示“能够……”）；mobile 常用来形容“可移动的/流动的”，以及“移动设备、手机端（mobile app / mobile-friendly）”。"]}
{"word":"mobbable","summary":{"en":"Mobbable means “easy to mob”—easy to be surrounded or attacked by a crowd (or, in gaming, by many enemies).","zh":"mobbable 指“容易被围住/围攻的”；也可用于游戏语境，表示“容易被一堆怪或敌人群殴的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, rare) Able to be mobbed (surrounded, crowded, or attacked by a large group).","zh":"（非正式、较少见）可能被“围住/围攻”的；容易被一大群人包围或冲上来对待的。"},"examples":[{"en":"Celebrities in public places can feel very mobbable if security is light.","zh":"名人在公共场所如果安保不够，可能会觉得自己很容易被人群围住。"},{"en":"That narrow hallway is mobbable—everyone rushes through it at the same time.","zh":"那条狭窄的走廊很容易被人群挤爆——大家会同时往那里冲。"}]},{"partOfSpeech":"adj.","definition":{"en":"(gaming slang) Able to be swarmed or attacked by mobs/enemies; easy for multiple enemies to gang up on.","zh":"（游戏俚语）容易被怪/敌人群殴、围攻的；会被一堆怪同时拉仇恨的。"},"examples":[{"en":"If you pull in that area alone, you’re very mobbable.","zh":"你一个人在那片区域开怪，很容易被一群怪围殴。"},{"en":"This build is tanky, so it’s less mobbable in crowded fights.","zh":"这个配装更肉，所以在人多的混战里不太容易被围攻。"}]}],"synonyms":["likely to be mobbed","crowdable","easy to swarm","vulnerable to attack","targetable"],"phonetic":"/ˈmɑbəbl̩/","extraExplanation":["“mobbable”多半是临时造词（nonce word），由 mob（人群/暴民；也可指游戏里的怪）+ -able（“能够……的/容易……的”）组成，因此语感上就是“容易被一群人/一堆怪围上来”。","它不是常见标准词；正式写作里更常用：likely to be mobbed / vulnerable to being mobbed（容易被围住/围攻）或 easily swarmed（容易被蜂拥而上）。","不要和 moble 混淆：moble 是很古老的词，意思更接近“用头巾/兜帽把头包住、裹住”。"]}
{"word":"mobbed","summary":{"en":"“Mobbed” means “was crowded around” (often by excited fans) or “was attacked/overwhelmed by a mob.”","zh":"“Mobbed”表示“被一群人围住/蜂拥而上”（常指粉丝等），也可表示“被暴民围攻/压倒”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of mob) To crowd around someone in an excited or aggressive way, often making it hard for them to move.","zh":"（mob 的过去式/过去分词）一群人激动或带攻击性地围住某人，常使其难以行动。"},"examples":[{"en":"The actor was mobbed by fans outside the theater.","zh":"那位演员在剧院外被粉丝团团围住。"},{"en":"As soon as the store opened, customers mobbed the entrance.","zh":"商店一开门，顾客就涌到门口。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of mob) To attack or overwhelm someone or something as a mob.","zh":"（mob 的过去式/过去分词）成群结队地袭击或压倒某人/某物。"},"examples":[{"en":"The protesters mobbed the vehicle and forced it to stop.","zh":"抗议者围攻那辆车，迫使它停下。"},{"en":"He was mobbed and robbed in the crowded street.","zh":"他在拥挤的街上被一群人围攻并抢劫。"}]}],"synonyms":["swarmed","surrounded","besieged","crowded around","assailed","attacked"],"phonetic":"/mɑbd/","extraExplanation":["“mobbed”常用被动语态（be mobbed by…）来强调“被围住/被蜂拥而上”，尤其在明星、运动员等语境中未必是暴力，而是“热情围堵”。","注意与“crowded around”相比：mobbed 更强调人数多、场面失控或带压力；在新闻语境里也可能暗示危险或暴力。"]}
{"word":"mobber","summary":{"en":"A mobber is a person who joins a mob or group harassment, often to intimidate or attack someone.","zh":"mobber 指参与暴民行动或群体骚扰的人，常带有恐吓、攻击他人的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who takes part in a mob (a large, often noisy or angry crowd), especially someone who helps intimidate, harass, or attack others as part of the crowd","zh":"参与暴民/乌合之众的人；（尤指）在群体中帮忙恐吓、骚扰或攻击他人的人"},"examples":[{"en":"The mobbers surrounded the reporter and tried to grab his camera.","zh":"那群暴民围住了记者，试图抢走他的相机。"},{"en":"Online mobbers flooded her account with insults after the rumor spread.","zh":"谣言传开后，网络暴民涌入她的账号辱骂她。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person who pressures or bullies someone together with a group; a group harasser","zh":"（非正式）跟着一群人一起施压或霸凌他人的人；群体骚扰者"},"examples":[{"en":"He wasn’t the leader, but he acted like a mobber whenever the group picked on someone.","zh":"他不是带头的，但每当大家欺负别人时，他就像个跟风霸凌者。"}]}],"synonyms":["mob member","bully","harasser","intimidator","ringleader (if leading)","troll (online, similar context)"],"phonetic":"/ˈmɑːbɚ/","extraExplanation":["“mobber”来自“mob”（暴民/人群）+ “-er”（做某事的人）。在现代语境里，它也常被用来形容“网暴/跟风围攻”的参与者（online mobbing）。\n\n用法提醒：英文里更常见的说法是“member of a mob / mob participant / harasser / bully”，而“mobber”相对少见，语气也更偏指责。"]}
{"word":"mobbers","summary":{"en":"Mobbers are people in a mob—often those who harass or attack as a group, or who crowd around someone intrusively.","zh":"mobbers 指“乌合之众/暴民”中的人，常指结伙骚扰或攻击的人，也可指过度簇拥、打扰他人的围观者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who form part of a mob, especially those who harass, threaten, or attack someone as a group.","zh":"参与暴民/乌合之众的人；（尤指）结伙骚扰、威胁或攻击他人的人。"},"examples":[{"en":"The police tried to separate the mobbers from the protesters to prevent violence.","zh":"警方试图将那些闹事的结伙者与抗议者分开，以防止暴力发生。"},{"en":"Online mobbers flooded the comment section with insults and threats.","zh":"网络结伙攻击者在评论区刷屏辱骂和威胁。"}]},{"partOfSpeech":"n.","definition":{"en":"People who crowd around someone or something, often in an overexcited or intrusive way.","zh":"围拢、簇拥（某人/某物）的人；（常含）过于激动或打扰的意味。"},"examples":[{"en":"Reporters and fans became mobbers outside the courthouse, pushing for a closer look.","zh":"法院外记者和粉丝围作一团，争相靠近观看。"},{"en":"The singer asked the crowd not to be mobbers and to give everyone space.","zh":"歌手请求人群不要一拥而上，给大家留出空间。"}]}],"synonyms":["mob members","rioters","thugs","harassers","attackers"],"phonetic":"/ˈmɑbɚz/","extraExplanation":["“mobbers”是复数形式，单数是“mobber”。它来自动词/名词“mob”（一群人围攻、蜂拥；暴民）。在现代英语里，“mobber”不算最常见的标准词；更常见的表达是“mob members / a mob”或描述行为的“harassers / attackers / rioters”。","在网络语境中，“mobbers”常指“集体围攻/网暴”的参与者（类似于中文的“跟风网暴者/集体出征的人”），语气通常带明显负面评价。"]}
{"word":"mobbie","summary":{"en":"“Mobbie” is not a common standard word. It may mean a Caribbean bark-based drink (variant of “mauby”), or it may be vulgar Australian slang (avoid). It can also be used as a name/brand.","zh":"“mobbie”并非常见标准词。它可能指加勒比地区的树皮饮料（mauby 的变体拼写），也可能是澳大利亚粗俗俚语（不建议使用），另外也可作人名/品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Caribbean, rare) A frothy drink made by boiling certain tree bark; a variant spelling of **mauby/maubi/mobby**.","zh":"（加勒比地区用法，较少见）一种用树皮煮制而成、带泡沫的饮料；常见拼写为 **mauby/maubi/mobby** 的变体。"},"examples":[{"en":"In some Caribbean communities, people drink **mobbie** (mauby) chilled.","zh":"在一些加勒比社区，人们会喝冰镇的 **mobbie**（mauby）。"},{"en":"I’ve only seen the spelling **mobbie** in informal word lists; **mauby** is more common.","zh":"我只在一些非正式词表里见过 **mobbie** 这种拼写；更常见的是 **mauby**。"}]},{"partOfSpeech":"n.","definition":{"en":"(Australian slang, vulgar/sexual; avoid) A woman described in a degrading way as someone who allows group sex.","zh":"（澳大利亚俚语，粗俗/性相关；不建议使用）以贬损方式指“允许多人性行为的女性”。"},"examples":[{"en":"That word is considered vulgar and disrespectful—don’t use it in polite conversation.","zh":"这个词被认为粗俗且不尊重他人——在正式或礼貌场合不要使用。"}]},{"partOfSpeech":"other","definition":{"en":"(Name/brand, informal) A nickname or a business/artist name (e.g., a company or a musician).","zh":"（名字/品牌，非正式）可作为昵称，或用作公司名、艺名等专有名称。"},"examples":[{"en":"Mobbie is also used as a brand or stage name in some contexts.","zh":"在某些语境中，Mobbie 也会被用作品牌名或艺名。"}]}],"synonyms":["mauby","maubi","mobby"],"phonetic":"/ˈmɑbi/","extraExplanation":["“mobbie”不是常见的标准英语词，含义非常依赖语境：在加勒比语境里可能指一种饮料（更常见拼写是 mauby/maubi）；在澳大利亚俚语里则是带有侮辱性的粗俗词（不建议使用）。","如果你想表达“手机”，更常见的非正式词是英式英语里的 “mobie”（mobile phone 的口语说法）。如果你想表达“群体排挤/职场霸凌”，常见词是 “mobbing”。你可以告诉我你看到它的句子，我能帮你判断具体意思。"]}
{"word":"mobbing","summary":{"en":"Mobbing usually means group bullying—especially at work—where several people repeatedly target someone. It can also mean a crowd surrounding someone, or (in biology) animals attacking a predator as a group.","zh":"Mobbing 常指“群体霸凌/围攻式欺凌”（尤其职场），即多人反复针对同一人；也可指人群围堵某人，或（动物学）动物群体围攻捕食者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Workplace bullying by a group: repeated, hostile behavior (often by several coworkers) meant to isolate, humiliate, or push someone out of a job.","zh":"（职场）“群体霸凌/围攻式欺凌”：多人反复以敌意行为孤立、羞辱或逼迫某人离开工作岗位。"},"examples":[{"en":"She reported mobbing after months of coworkers spreading rumors and excluding her from meetings.","zh":"她在同事们连续几个月散布谣言、把她排除在会议之外之后，举报了职场群体霸凌。"},{"en":"The company updated its policy to address mobbing, not just one-on-one bullying.","zh":"公司更新了制度来处理群体霸凌，而不仅仅是一对一的欺凌。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation where a group crowds around someone or something, often in a noisy or excited way (e.g., fans around a celebrity).","zh":"（人群）一群人围住某人或某物，常带有喧闹、激动的气氛（如粉丝围住名人）。"},"examples":[{"en":"Security stepped in to stop the mobbing outside the theater.","zh":"保安介入，制止了剧院外的人群围堵。"}]},{"partOfSpeech":"n.","definition":{"en":"In animal behavior, a group of smaller animals (especially birds) attacking or harassing a predator to drive it away.","zh":"（动物行为）一群较小的动物（尤其是鸟）围攻或骚扰捕食者，把它赶走。"},"examples":[{"en":"We watched crows mobbing an owl until it flew off.","zh":"我们看到乌鸦围攻一只猫头鹰，直到它飞走。"}]}],"synonyms":["workplace bullying","harassment","ganging up (on someone)","group bullying","crowding"],"phonetic":"/ˈmɑbɪŋ/","extraExplanation":["“mobbing”在日常英语里常见于职场语境，强调“多人一起”针对同一个人，和 one-on-one “bullying（单独欺凌）”不同。","在欧洲（尤其德语区的研究与媒体），“mobbing”作为“职场围攻/排挤”的术语更常见；美式英语里也会用，但也常直接说 “workplace bullying” 或 “harassment”。","动物行为里的 “mobbing” 是中性术语，指小型动物群体驱赶捕食者的策略；不要和职场含义混淆。"]}
{"word":"mobbish","summary":{"en":"Mobbish (adj.) describes rude, aggressive, threatening behavior or an atmosphere like a disorderly crowd (a mob).","zh":"mobbish（形容词）指粗鲁、咄咄逼人、带威胁性的言行或氛围，像失控的乌合之众（暴民）一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Rude, aggressive, and unpleasant in a way associated with a noisy crowd; behaving like a threatening mob.","zh":"像乌合之众一样粗鲁、咄咄逼人、令人不快；带有“暴民式”威胁感的。"},"examples":[{"en":"The actor left through a back door to avoid the mobbish crowd.","zh":"那位演员从后门离开，以躲开那群带有暴民气息的拥挤人群。"},{"en":"Some comments became mobbish and intimidating, so the moderators stepped in.","zh":"一些评论变得像暴民一样咄咄逼人、带有恐吓意味，所以版主介入了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to, typical of, or resembling a mob (a disorderly crowd), especially in behavior or atmosphere.","zh":"与暴民/骚乱人群有关的；典型的；在行为或氛围上类似乌合之众的。"},"examples":[{"en":"There was a mobbish mood outside the courthouse after the verdict.","zh":"判决之后，法院外的气氛带有一种暴民式的躁动。"},{"en":"He disliked the mobbish excitement of the tabloids.","zh":"他不喜欢小报那种群氓式的亢奋。"}]}],"synonyms":["rowdy","thuggish","loutish","unruly","aggressive"],"phonetic":"/ˈmɑbɪʃ/","extraExplanation":["“mobbish”来自“mob（暴民；乌合之众）+ -ish（有点像……的）”。因此它常带强烈贬义：不仅是“人多”，而是“人群失控、粗暴、跟风攻击、容易威胁他人”的感觉。","在现代语境里，它也常用来形容网络上的“围攻/群起而攻之”的氛围（例如评论区集体辱骂、带节奏），强调的是群体压力与攻击性，而不一定真的发生街头暴力。","相关近义词有：“rowdy（吵闹的）”“loutish（粗野的）”“thuggish（流氓式的）”。其中“mobbish”更强调“像一群人结成的攻击性力量”。"]}
{"word":"mobbishly","summary":{"en":"“Mobbishly” means behaving in a rude, aggressive, disorderly way like a mob, or joining in group bullying/pressure.","zh":"“mobbishly”表示像暴民一样粗暴、好斗、失序地行事，或以群体围攻/霸凌的方式对待他人。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rude, aggressive, or disorderly way, like a hostile crowd (a “mob”).","zh":"以粗鲁、好斗或骚乱的方式；像“暴民/乌合之众”那样行事。"},"examples":[{"en":"A group of fans behaved mobbishly outside the stadium, shouting at strangers.","zh":"一群球迷在体育场外表现得很暴民化，对陌生人大喊大叫。"},{"en":"The protesters pushed mobbishly toward the entrance, ignoring the guards’ warnings.","zh":"抗议者无视保安警告，粗暴地向入口处挤过去。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that imitates or supports mob behavior—pressuring, bullying, or attacking someone as a group.","zh":"以模仿或助长群体围攻的方式；以群体压力、霸凌或围攻某人的方式。"},"examples":[{"en":"Online, people sometimes react mobbishly, piling on a person before checking the facts.","zh":"在网上，人们有时会暴民式反应，在核实事实前就对某个人群起而攻之。"},{"en":"The class laughed mobbishly when one student made a mistake.","zh":"有位同学犯错时，全班以一种“群体起哄”的方式哄笑。"}]}],"synonyms":["aggressively","disorderly","riotously","roughly","thuggishly","bullyingly"],"phonetic":"/ˈmɑbɪʃli/","extraExplanation":["“mobbishly”来自形容词“mobbish”（暴民化的、乌合之众式的）+ 副词后缀“-ly”。它常带强烈的批评语气，用来强调“像一群人失控/围攻一样”的行为，而不只是“人多”。","语体上偏正式、书面或评论性写法（新闻评论、社会观察、文学叙述中较常见）；日常口语更常用“like a mob / in a mob-like way / aggressively”。"]}
{"word":"mobbishness","summary":{"en":"Mobbishness means the quality of acting like a mob—group rudeness, aggression, or bullying, often targeting outsiders.","zh":"mobbishness 指“像暴民一样”的特质：群体性的粗暴、好斗或欺凌，常针对被排斥的“外人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of behaving like a mob: rude, aggressive, or bullying in a group, especially toward someone seen as an outsider.","zh":"（带贬义）“像暴民一样”的特质：常指在群体中表现得粗鲁、好斗、欺凌，尤其针对被视为“外人”的人。"},"examples":[{"en":"The debate turned ugly, and the mobbishness of the crowd drowned out any thoughtful discussion.","zh":"辩论变得难看起来，人群的“暴民式”粗暴与起哄压过了任何理性的讨论。"},{"en":"She resigned after months of mobbishness in the office—whisper campaigns, piling on, and public humiliation.","zh":"在办公室经历了数月的群体欺压（造谣、围攻、当众羞辱）后，她选择辞职。"}]},{"partOfSpeech":"n.","definition":{"en":"A snobbish, “one of the crowd” attitude that looks down on people who seem different, unconventional, or not socially acceptable.","zh":"一种带势利意味的“随大流/站队”心态：鄙视或排斥看起来不同、非主流或不合群的人。"},"examples":[{"en":"Their mobbishness showed in the jokes they made about anyone who dressed differently.","zh":"他们对穿着不同的人开嘲笑的玩笑，暴露了那种随众排外的心态。"},{"en":"The novel criticizes the mobbishness of polite society—cruelty hidden behind manners.","zh":"这部小说批判“体面社会”的从众排外：礼貌背后藏着的残酷。"}]}],"synonyms":["mob mentality","lynch-mob spirit","rabble behavior","group bullying","thuggishness"],"phonetic":"/ˈmɑbɪʃnəs/","extraExplanation":["词形拆解：mobbish（像暴民一样的、带群体欺凌/起哄意味的）+ -ness（名词后缀，表示“……的状态/性质”）。因此 mobbishness 常用来批评一种“人多就胆大”的粗暴行为或群体围攻的氛围。","语感提示：mobbishness 比单纯的 rudeness（无礼）更强调“群体效应”和“围攻/起哄”的攻击性；也比 bullying 更突出“像人群/暴民那样”的集体性。","搭配常见：the mobbishness of the crowd / media mobbishness / a tone of mobbishness。写作里常用于批评舆论围剿、网络围攻、或群体在公共场合对弱势者的压迫。"]}
{"word":"mobbism","summary":{"en":"Mobbism means mob-like behavior—rude, aggressive, or irrational group conduct.","zh":"mobbism 指“暴民式作风/行为”，即粗鲁、攻击性或非理性的群体行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"behavior that is typical of a mob, especially rude, aggressive, or irrational group behavior.","zh":"暴民式行为；具有“乌合之众”特征的举动（常指粗鲁、攻击性强或缺乏理性的群体行为）。"},"examples":[{"en":"The speaker warned that online outrage can quickly turn into mobbism.","zh":"演讲者警告说，网络上的愤怒很容易迅速演变成暴民式行为。"},{"en":"The court criticized the mobbism that followed the rumor.","zh":"法院批评了谣言之后出现的暴民式举动。"}]}],"synonyms":["mob behavior","mob mentality","crowd violence","herd mentality"],"phonetic":"/ˈmɑˌbɪzəm/","extraExplanation":["“mobbism”在现代英语里很少见，更常见的说法是“mob behavior / mob mentality（群体暴走/从众式非理性）”。","注意不要和“mobbing（职场/学校里的群体霸凌、围攻某个人）”混淆：mobbing强调长期、反复地针对某个受害者；mobbism更泛指“像暴民一样的作风/行为”。","构词上可理解为 mob（暴民、乌合之众）+ -ism（……主义/作风/现象），所以语气通常偏负面，带批判意味。"]}
{"word":"mobbist","summary":{"en":"A rare word meaning someone who supports or participates in mob behavior; a mob member.","zh":"一个罕用词，指支持或参与暴民行为的人；暴民一员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, often old-fashioned) A person who supports or takes part in mob behavior (mobbism); a member of a mob, especially in a disorderly or violent crowd.","zh":"（罕用，常较旧式）支持或参与“暴民行为/乌合之众行为（mobbism）”的人；（尤指在骚乱或暴力人群中的）暴民一员。"},"examples":[{"en":"The article condemned the mobbists who tried to intimidate voters outside the polling place.","zh":"那篇文章谴责了那些在投票站外试图恐吓选民的暴民分子。"},{"en":"He warned that mobbists can drown out reasonable discussion when emotions run high.","zh":"他警告说，当情绪高涨时，暴民式的人群很容易淹没理性的讨论。"}]}],"synonyms":["rioter","mobber","hooligan","rabble-rouser"],"phonetic":"/ˈmɑːbɪst/","extraExplanation":["“mobbist”这个词在现代英语里非常少见，多见于词典或较旧的文本；日常写作更常用“rioter”（暴乱者）、“hooligan”（流氓/闹事者）或直接说“member of a mob”。","很多学习者会把“mobbist”误写成“lobbyist”（游说者）。两者意思完全不同：lobbyist 是从事政治/商业游说的人，不含“暴民”含义。"]}
{"word":"mobble","summary":{"en":"Mobble (rare/archaic) means to wrap or muffle someone’s head or face, usually with cloth or a hood.","zh":"Mobble（罕见/古义）指用布或兜帽把人的头或脸包住、裹住（遮住或保暖）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(archaic) To wrap or muffle someone’s head or face (often with cloth, a hood, or a veil).","zh":"（古义）用布、兜帽或面纱把人的头或脸包住、裹住（使其被遮住或保暖）。"},"examples":[{"en":"She mobbled her head in a shawl before going out into the cold wind.","zh":"她出门前用披肩把头裹住，以挡寒风。"},{"en":"The traveler was mobbled up to keep the dust from his mouth and nose.","zh":"旅人把脸包得严严实实，以免灰尘进入口鼻。"}]}],"synonyms":["muffle","wrap up","veil","cover"],"phonetic":"/ˈmɑbəl/","extraExplanation":["“mobble”在现代英语里非常罕见；更常见的词形是 **moble**（同义、同读法），属于古英语/文学用词。","权威词典（如 Merriam‑Webster）收录的是 **moble**：意思是“把头包起来/用兜帽或布遮住”。因此你看到的 **mobble** 很可能是历史上的变体拼写或误拼。","在文学语境里，它常带有“被纱/布柔和地遮住、朦胧地包裹”的画面感，类似 *muffle*（裹住、捂住）或 *wrap*（包裹）。","注意：**Mobble** 也可能是专有名词（如产品/公司名）。若你是在某个句子或文章里看到它，我可以根据上下文判断到底是“古义动词”还是“专有名词”。"]}
{"word":"mobby","summary":{"en":"Mobby is an uncommon word. It most often refers to a traditional fermented alcoholic drink (Caribbean/older usage), and more rarely to fermented fruit juice used for brandy in the US; it can also mean “rowdy, mob-like” in uncommon UK slang.","zh":"Mobby 是个不常见的词。最常见指传统发酵酒（加勒比地区/较旧用法），更少见指美国用于酿白兰地的发酵果汁；在少见的英式俚语里也可表示“吵闹、像暴民一样”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Caribbean; old-fashioned) An alcoholic drink made by fermenting sweet potatoes or ginger.","zh":"（加勒比地区；较旧用法）用红薯或姜发酵制成的酒精饮料。"},"examples":[{"en":"In some Caribbean communities, people once brewed mobby at home for celebrations.","zh":"在一些加勒比社区，人们过去会在家自酿 mobby 来庆祝。"},{"en":"The guide mentioned mobby as a traditional fermented drink.","zh":"导游提到 mobby 是一种传统发酵饮料。"}]},{"partOfSpeech":"n.","definition":{"en":"(US; rare) Fermented peach-and-apple juice used to make brandy, or a punch/brandy made from it.","zh":"（美国；少见）桃子与苹果的发酵汁，用于酿白兰地；也指用这种发酵汁调制的潘趣酒/白兰地饮品。"},"examples":[{"en":"The recipe called for mobby as a base for a strong punch.","zh":"这份配方把 mobby 当作烈性潘趣酒的基底。"},{"en":"Historically, mobby could refer to fermented fruit juice used in brandy-making.","zh":"在历史语境中，mobby 可指用于酿白兰地的发酵果汁。"}]},{"partOfSpeech":"adj.","definition":{"en":"(UK slang; uncommon) Rowdy, disorderly, or behaving like a mob.","zh":"（英式俚语；不常见）吵闹的、乱哄哄的，或“像乌合之众一样”的。"},"examples":[{"en":"The crowd got mobby after the controversial call.","zh":"那次有争议的判罚后，人群变得很“mobby”（吵闹失控）。"},{"en":"Police moved in when the protest turned mobby.","zh":"当抗议活动变得“mobby”（骚乱化）时，警方介入了。"}]}],"synonyms":["mauby","maubi","mob-like","rowdy","disorderly"],"phonetic":"/ˈmɑbi/","extraExplanation":["“mobby”在日常英语里并不常见；你更可能看到拼写变体 **mauby/maubi**（在加勒比地区更常见），或在词典里把它标为方言/旧用法。","如果你是在聊天里看到的 **mobby**，也可能是把 **Moby**（人名/昵称）或 **mob**（乌合之众/暴民）写成了 mobby；给我一句上下文，我可以帮你判断是哪一种。"]}
{"word":"mobcap","summary":{"en":"A mobcap is a soft cap worn by women indoors in the 18th–19th centuries, and the word is also used today for a hygiene hair-covering cap in workplaces like labs or food production.","zh":"mobcap 指18–19世纪常见的女式室内软布帽；现代也可指实验室、食品/制药等场所为卫生而戴的包发工作帽/头套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman’s soft indoor cap (especially common in the 18th–early 19th centuries), usually with a full/ruffled crown and sometimes ties under the chin","zh":"（尤指18世纪至19世纪初常见的）女式室内软布帽，帽顶蓬松/带褶边，常可在下巴处系带"},"examples":[{"en":"In the period drama, the maid wears a white mobcap and apron as part of her uniform.","zh":"在那部年代剧里，女仆把白色的mobcap（女仆帽）和围裙当作制服的一部分。"},{"en":"She pinned her hair up and put on a mobcap before serving tea.","zh":"她把头发盘好别住，然后戴上mobcap再去端茶。"}]},{"partOfSpeech":"n.","definition":{"en":"a disposable or washable hair-covering cap worn for hygiene in places like food production, labs, pharmacies, or clean rooms","zh":"（为卫生目的）在食品加工、实验室、制药或洁净室等场所佩戴的一次性或可清洗头套/工作帽"},"examples":[{"en":"Everyone entering the clean room must wear a mobcap to keep hair contained.","zh":"进入洁净室的人都必须戴mobcap，把头发包好。"},{"en":"The bakery staff put on gloves, masks, and mobcaps before starting work.","zh":"面包房员工开工前会戴手套、口罩和mobcap。"}]}],"synonyms":["bonnet","cap","hairnet (modern use)","disposable bouffant cap (modern use)"],"phonetic":"/ˈmɑbˌkæp/","extraExplanation":["“mobcap”也常写作“mob cap”或“mob-cap”。历史上它与18世纪欧洲（尤其英法）家庭与仆役服饰形象关联很强，因此在文学、戏剧和历史题材影视中经常出现。","词源里“mob”在旧用法中可指“随意的家居装束/不正式打扮（dishabille）”，加上“cap（帽子）”组合成该词。","现代工业语境里说的“mobcap”更接近“头发防护帽/发网帽”的功能概念，外形可能像带松紧边的圆形头套。"]}
{"word":"mobcaps","summary":{"en":"“mobcaps” means more than one mobcap: traditional women’s indoor caps (18th–19th c.), or modern hygiene hair-covering caps.","zh":"“mobcaps”是mobcap的复数：可指18–19世纪女性常戴的室内布帽，也可指现代用于卫生防护的护发帽/发罩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **mobcap**: soft cloth caps (often with a ruffled edge) traditionally worn indoors by women, especially in the 18th–early 19th centuries; modern versions can also mean disposable hair-covering caps used for hygiene (e.g., in food or medical settings).","zh":"**mobcap** 的复数：一种柔软的布帽（常带褶边/荷叶边），传统上多为18世纪至19世纪初女性在室内佩戴；现代也可指为卫生需要使用的一次性护发帽（如食品、医疗等场所）。"},"examples":[{"en":"In the museum painting, the woman is wearing a white mobcaps-and-apron style typical of the period.","zh":"在博物馆那幅画里，那位女性戴着白色的传统室内帽（mobcaps）并系着围裙，很符合当时的风格。"},{"en":"Workers put on mobcaps before entering the clean room to keep hair covered.","zh":"工人进入无尘室前会戴上 mobcaps，把头发完全遮住。"}]}],"synonyms":["caps","bonnets","hair covers","hair nets"],"phonetic":"ˈmɑbˌkæps","extraExplanation":["“mobcaps”是“mobcap”的复数形式；更常见的单数拼写是 **mobcap**（也可写作 mob cap / mob-cap）。","历史语境里，mobcap常与女仆、护士等制服形象相关；现代语境里，它也常指类似“发罩/卫生帽”的一次性帽子，用于食品加工、制药、洁净室等场所。","词源里“mob-”与早期英语中表示“家居/便装（dishabille）”的用法有关，因此最初带有“室内、随意穿着”的语境色彩。"]}
{"word":"mobed","summary":{"en":"Mobed is a noun meaning a Zoroastrian (Parsi) priest.","zh":"mobed 是名词，指琐罗亚斯德教（帕西人）的祭司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Zoroastrian (Parsi) priest; in some sources, a priest of a particular rank.","zh":"琐罗亚斯德教（帕西人）祭司；在一些资料中也指特定等级的祭司。"},"examples":[{"en":"The mobed led the prayers during the ceremony.","zh":"这位 mobed 在仪式中带领大家祈祷。"},{"en":"In the Parsi community, a mobed is a respected religious leader.","zh":"在帕西社群中，mobed 是备受尊敬的宗教领袖。"}]}],"synonyms":["Zoroastrian priest","Parsi priest"],"phonetic":"/ˈmoʊbəd/","extraExplanation":["“mobed”也常见拼写为 **mobad / mowbed**。如果你原本想写的是英语动词过去式 **mobbed**（“被人群围住/蜂拥而上”），那它的拼写是 *mobbed*，读音和意思都不同。","另外，近年也有名为 **MobED** 的机器人/移动平台产品名（首字母大写），那属于专有名词，不是这个宗教称谓。"]}
{"word":"mobil","summary":{"en":"“Mobil” is mainly a brand name for gasoline/oil products (now under ExxonMobil).","zh":"“Mobil”主要是汽油/机油等产品的品牌名（现属于埃克森美孚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mobil: a brand name (proper noun) historically used by an American oil and gasoline company, now part of ExxonMobil; you may see it on gas stations, motor oil, and fuel products.","zh":"Mobil：一个品牌名（专有名词），原为美国石油与汽油公司名称，现为埃克森美孚（ExxonMobil）旗下品牌；常见于加油站、机油与燃油产品。"},"examples":[{"en":"We stopped at a Mobil station to get gas.","zh":"我们在一家 Mobil 加油站停下来加油。"},{"en":"He changed the car’s oil using Mobil 1.","zh":"他用 Mobil 1 给车换了机油。"}]}],"synonyms":["ExxonMobil (company name)","Mobil station (gas station)","Mobil 1 (motor oil brand)"],"phonetic":"/moʊˈbiːl/","extraExplanation":["“mobil”在英语里不是常见的普通词：多数情况下人们要么指品牌名 **Mobil**，要么其实想拼写 **mobile**（美式常读 /ˈmoʊbaɪl/），意思是“可移动的/手机”。如果你告诉我你想表达的语境（比如“手机”还是“加油站”），我可以给出对应词条与用法。","另外，在印尼语/马来语里 **mobil** 常用来表示“汽车”。英语里“汽车”通常说 **car**。"]}
{"word":"mobile","summary":{"en":"“Mobile” most commonly means “able to move easily” or “related to mobile phones.” It can also mean “a cellphone” (especially in British English) or a hanging moving art piece.","zh":"“mobile”最常见意思是“可移动的”或“与手机/移动通信有关的”。它也可指“手机”（多见于英式英语）或“悬挂会动的装饰/艺术装置”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to move easily; not fixed in one place.","zh":"可移动的；不固定在一个地方的。"},"examples":[{"en":"The museum has a mobile display that travels to different schools.","zh":"博物馆有一个可移动的展览，会到不同学校巡回展示。"},{"en":"Because the shelves are mobile, we can rearrange the room quickly.","zh":"因为这些架子是可移动的，我们可以很快重新布置房间。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to mobile phones or wireless communication.","zh":"与手机或移动通信有关的。"},"examples":[{"en":"Many people do their banking on mobile apps.","zh":"很多人用手机应用来办理银行业务。"},{"en":"The website is mobile-friendly, so it’s easy to read on a phone.","zh":"这个网站对手机很友好，所以在手机上阅读很方便。"}]},{"partOfSpeech":"n.","definition":{"en":"A mobile phone; a cellphone (common in British English).","zh":"手机（英式英语常用，相当于美式英语的 cellphone）。"},"examples":[{"en":"I left my mobile at home, so I couldn’t call you.","zh":"我把手机落在家里了，所以没法给你打电话。"},{"en":"Can I borrow your mobile for a second?","zh":"我能借用一下你的手机吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A hanging piece of art with balanced parts that move gently in the air (often seen above a baby’s bed).","zh":"（悬挂式）动感装饰/风动装置（常见于婴儿床上方）。"},"examples":[{"en":"She hung a colorful mobile above the baby’s crib.","zh":"她在婴儿床上方挂了一个彩色的风铃式动感装饰。"},{"en":"The mobile turned slowly when the window was open.","zh":"窗户打开时，那个悬挂装饰会慢慢转动。"}]}],"synonyms":["portable","movable","cell phone (US)","cellphone (US)"],"phonetic":"/ˈmoʊbəl/","extraExplanation":["“mobile”在美式英语里最常见是形容词：mobile device（移动设备）、mobile data（移动数据）、mobile payment（移动支付）。名词表示“手机”在英式英语更常见；在美国更常说“cell phone / cellphone”。","艺术意义上的“mobile”常指由多片轻质材料平衡悬挂而成、可随空气流动而摆动的艺术装置，常与雕塑家 Alexander Calder（亚历山大·考尔德）的作品联系在一起。"]}
{"word":"mobiles","summary":{"en":"“Mobiles” most commonly means mobile phones; it can also mean moving hanging sculptures (mobiles).","zh":"“mobiles”最常指“手机（复数）”；也可指“风动装置/悬挂会动的雕塑（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) mobile phones; cell phones.","zh":"（复数）手机；移动电话。"},"examples":[{"en":"Many students aren’t allowed to use mobiles in class.","zh":"很多学校不允许学生在课堂上用手机。"},{"en":"Please turn your mobiles off during the meeting.","zh":"开会期间请把手机关机。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) hanging sculptures made of balanced pieces that move gently in the air.","zh":"（复数）风动装置；会随气流轻轻摆动的悬挂雕塑。"},"examples":[{"en":"The baby stared at the mobiles above the crib.","zh":"宝宝盯着婴儿床上方的风铃式吊饰看。"},{"en":"The art museum displayed colorful mobiles in the modern art room.","zh":"美术馆在现代艺术展厅展出了色彩鲜艳的风动装置。"}]}],"synonyms":["cell phones","phones","handsets","smartphones","kinetic sculptures"],"phonetic":"/ˈmoʊbaɪl/","extraExplanation":["“mobile”在美式英语里表示“手机”时常读 /ˈmoʊbaɪl/。在艺术语境中指“风动装置（雕塑）”时，也常听到另一种读法 /ˈmoʊbiːl/（更偏向法语影响的读音）。","“mobile（风动装置）”常与美国雕塑家 Alexander Calder（亚历山大·考尔德）联系在一起，他让这种会随空气流动而移动的悬挂雕塑变得非常有名。"]}
{"word":"mobilia","summary":{"en":"Mobilia is a rare word in English meaning “furniture,” and in legal/Latin-based contexts it can mean “movable (personal) property.”","zh":"Mobilia 在英语中很少用，常指“家具”；在法律/拉丁语系语境中也可指“动产（个人财产）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare in English) Furniture; the movable items that furnish a home or room.","zh":"（英语中较少用）家具；用于布置房屋或房间的可移动物品。"},"examples":[{"en":"The apartment is rented without mobilia, so you’ll need to buy a bed and a table.","zh":"这套公寓不含家具出租，所以你需要自己买床和桌子。"},{"en":"They packed the mobilia carefully before moving across town.","zh":"他们搬家前把家具仔细打包。"}]},{"partOfSpeech":"n.","definition":{"en":"(law / Latin-based usage) Movable property (personal property), as opposed to land or buildings.","zh":"（法律/拉丁语系用法）动产（个人财产）；与土地或建筑等不动产相对。"},"examples":[{"en":"In some legal writing, mobilia refers to goods that can be moved from place to place.","zh":"在一些法律文本中，mobilia 指可以从一处搬到另一处的财物。"},{"en":"The dispute concerned the division of mobilia rather than real estate.","zh":"这场纠纷涉及动产的分配，而不是不动产。"}]}],"synonyms":["furniture","furnishings","movable property","personal property","chattels"],"phonetic":"/moʊˈbiːliə/","extraExplanation":["“Mobilia”在日常英语里非常少见，更常见于意大利语/葡萄牙语中表示“家具”（例如意大利语 mobilia、葡萄牙语 mobília），或出现在拉丁语法律表达里，表示“动产”。在普通英语写作中，通常直接用 furniture / furnishings / personal property。","词源上常被解释为来自拉丁语 mobilia（意为“可移动的东西”）。在法律语境中，你还可能看到类似“bona mobilia（动产）”这样的拉丁短语。"]}
{"word":"mobilian","summary":{"en":"Mobilian most commonly means a person from Mobile, Alabama, or something related to Mobile. In linguistics/history, it can also refer to Mobilian Jargon, a historic Indigenous trade language of the U.S. Gulf Coast.","zh":"Mobilian 最常见指“美国阿拉巴马州莫比尔市的人/与莫比尔有关的”。在语言学/历史语境中，也可指“莫比尔通用语”（Mobilian Jargon），一种曾在美国墨西哥湾沿岸使用的原住民贸易通用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Mobile, Alabama (USA); a resident of Mobile","zh":"（美国）阿拉巴马州莫比尔市（Mobile）的居民"},"examples":[{"en":"She’s a proud Mobilian who knows every Mardi Gras tradition in Mobile.","zh":"她是一位自豪的莫比尔人，对莫比尔的狂欢节传统了如指掌。"},{"en":"Many Mobilians spend weekends on Mobile Bay.","zh":"许多莫比尔人周末会去莫比尔湾一带活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Mobile, Alabama, or to its people and local culture","zh":"与（美国）阿拉巴马州莫比尔市或其居民、地方文化有关的"},"examples":[{"en":"Mobilian food often features Gulf Coast seafood.","zh":"莫比尔当地的饮食常以墨西哥湾沿岸海鲜为特色。"},{"en":"He wrote a Mobilian history column for the local paper.","zh":"他为当地报纸写了一栏关于莫比尔历史的专栏。"}]},{"partOfSpeech":"n.","definition":{"en":"short for “Mobilian Jargon”: a historic Indigenous trade language (a pidgin) used along the U.S. Gulf Coast and Mississippi Valley, based largely on Choctaw/Chickasaw","zh":"“莫比尔通用语/莫比尔行话”（Mobilian Jargon）的简称：一种历史上的原住民贸易通用语（皮钦语），曾在美国墨西哥湾沿岸与密西西比河流域使用，主要以乔克托语/奇克索语词汇为基础"},"examples":[{"en":"Researchers have collected word lists from Mobilian used in early trade records.","zh":"研究者从早期贸易记录中整理出莫比尔通用语的词汇表。"},{"en":"Mobilian helped different communities communicate during the 18th and 19th centuries.","zh":"在18与19世纪，莫比尔通用语帮助不同社群进行交流。"}]}],"synonyms":["(demonym) Mobile resident","(linguistics) Mobilian Jargon","Mobilian trade language"],"phonetic":"/moʊˈbiːliən/","extraExplanation":["“Mobilian”最常见的日常用法是指“莫比尔（Mobile, Alabama）的人/与莫比尔有关的事”。在历史与语言学语境里，它也常用来指“Mobilian Jargon（莫比尔通用语）”，一种曾在美国东南部沿海广泛使用的贸易通用语。([britannica.com](https://www.britannica.com/topic/Mobilian-Jargon?utm_source=openai))","如果你看到的“mobilian”出现在公司/产品名里（例如某些科技公司或网站名），那通常是专有名词用法，含义取决于具体品牌，并不等同于上面的“莫比尔人/莫比尔通用语”。([hr.linkedin.com](https://hr.linkedin.com/company/mobilian-ltd?utm_source=openai))"]}
{"word":"mobilianer","summary":{"en":"**mobilianer** is a rare (mainly German) noun meaning a North American freshwater turtle, usually linked to the taxon *Pseudemys mobiliensis*.","zh":"**mobilianer** 是一个较少见（主要见于德语）的名词，指一种北美淡水龟，通常对应分类单元 *Pseudemys mobiliensis*。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology; rare, chiefly in German) a North American freshwater turtle: the Mobilian cooter, usually classified as **Pseudemys mobiliensis** (often treated as a subspecies of river cooter).","zh":"（动物学；较少见，主要见于德语）一种北美淡水龟：常指“莫比尔拟水龟/莫比尔水龟”，通常归为 **Pseudemys mobiliensis**（也常被当作河拟水龟的一个亚种）。"},"examples":[{"en":"In older zoology sources, **Mobilianer** refers to a large freshwater turtle in the genus *Pseudemys*.","zh":"在一些较早的动物学资料里，**Mobilianer** 指的是 *Pseudemys* 属的一种大型淡水龟。"},{"en":"The word **Mobilianer** is uncommon in everyday German; you’ll mainly see it in species lists or dictionaries.","zh":"**Mobilianer** 在日常德语中并不常见，更多出现在物种名录或词典里。"}]}],"synonyms":["freshwater turtle","cooter (general group name for *Pseudemys*)","Pseudemys (genus name)"],"phonetic":"ˌmoʊbɪliˈænɚ","extraExplanation":["这个词很容易和英语 **Mobilian** 搞混：英语里 *Mobilian* 既可指“美国阿拉巴马州莫比尔（Mobile）的居民”，也可指一种历史上的贸易通用语 *Mobilian Jargon*（莫比尔皮钦语/行话）。而你写的 **mobilianer**（德语名词）更常见的解释是动物学里的“某种北美淡水龟”。","如果你是在生物/宠物龟语境里看到它，建议你把出现它的那句话或网页截图发来，我可以帮你确认它到底对应哪一个现代学名（有些资料会把它当作 *Pseudemys floridana mobiliensis* 之类的写法）。"]}
{"word":"mobiliary","summary":{"en":"Mobiliary is a formal adjective meaning “related to movable property,” and sometimes “related to household furniture.”","zh":"mobiliary 是较正式的形容词，意为“与动产有关的”，有时也指“与家用家具/陈设有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(law, formal) Relating to movable property (things you can move, not land or buildings).","zh":"（法律/正式用语）与动产有关的（可移动的财产，不包括土地或建筑物）。"},"examples":[{"en":"The contract listed the company’s mobiliary assets, such as vehicles and equipment.","zh":"合同列出了公司的动产资产，例如车辆和设备。"},{"en":"In some legal systems, mobiliary property is treated differently from real estate.","zh":"在一些法律体系中，动产与不动产的处理方式不同。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to household furniture or furnishings.","zh":"与家用家具或室内陈设有关的。"},"examples":[{"en":"They insured the mobiliary contents of the apartment, including the sofa and dining set.","zh":"他们为公寓内的家具陈设投保，包括沙发和餐桌椅。"},{"en":"The museum displayed mobiliary objects from the period—chairs, cabinets, and tables.","zh":"博物馆展出了那个时期的家具类物品——椅子、柜子和桌子。"}]}],"synonyms":["movable","portable","personal-property (related)","furnishing (related)"],"phonetic":"/moʊˈbɪliˌɛri/","extraExplanation":["“mobiliary”比较少见，主要出现在法律、保险、历史或学术写作中；日常英语里更常用 movable property / personal property（动产）或 furniture / furnishings（家具/陈设）。","词源来自法语 mobiliaire，进一步可追溯到拉丁语词根 mobil-（与“移动”有关），和 mobile（可移动的）是同源词。","考古学里常见搭配是 mobiliary art（便携式艺术/可移动艺术），指史前人类制作的可携带装饰品（与洞穴壁画等“不可移动”的艺术相对）。"]}
{"word":"mobilis","summary":{"en":"Mobilis is a Latin word meaning “movable/mobile,” used mostly in scientific names to suggest motility.","zh":"mobilis 是拉丁词，意为“可移动/可运动的”，多用于科学命名中暗示“有运动能力”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English mainly in science) “movable; mobile,” describing something that can move or be moved.","zh":"（拉丁语；在英语中多见于科学用语）“可移动的；有运动能力的”，用于描述能移动或能被移动的事物。"},"examples":[{"en":"In a species name, mobilis often signals that the organism is motile (able to move).","zh":"在物种学名中，mobilis 常暗示该生物“有运动能力”（能移动）。"},{"en":"Researchers compared a non-motile strain with a mobilis (motile) strain.","zh":"研究人员比较了一个不运动的菌株与一个 mobilis（可运动的）菌株。"}]},{"partOfSpeech":"n.","definition":{"en":"A Latin word used as a species epithet in scientific names (e.g., in biology), meaning “mobile/motile.”","zh":"一个用于生物等科学命名中的拉丁词（作种加词），意为“可移动/可运动的”。"},"examples":[{"en":"The paper describes a bacterium labeled with the epithet mobilis.","zh":"这篇论文描述了一种带有种加词 mobilis 的细菌。"}]}],"synonyms":["mobile","movable","motile"],"phonetic":"ˈmoʊbɪlɪs","extraExplanation":["mobilis 是拉丁语形容词，英语里通常不会在日常对话中单独使用；你更可能在生物学、医学或分类学的拉丁学名中见到它（作为“种加词”）。","在现代英语里表达同样意思，最常用的词是 mobile（可移动的）或 motile（生物学：可运动的）。如果你是在论文/物种名里看到 mobilis，一般可理解为“能动、会动”。"]}
{"word":"mobilisable","summary":{"en":"Mobilisable means “able to be mobilized; able to be organized and made ready for action or use.”","zh":"Mobilisable 意为“可被动员的；可被组织并准备投入行动或使用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be mobilized (organized and made ready for action or use), such as people, troops, money, or resources","zh":"可被动员的；可被组织起来并准备投入行动或使用的（如人员、军队、资金或资源）"},"examples":[{"en":"The country reviewed its mobilisable workforce in case of an emergency.","zh":"该国评估了可动员的劳动力，以应对紧急情况。"},{"en":"They tried to identify mobilisable resources for disaster relief.","zh":"他们试图找出可动员的资源用于灾害救援。"}]}],"synonyms":["mobilizable","deployable","call-up (able)","available","ready"],"phonetic":"/ˈmoʊbəˌlaɪzəbəl/","extraExplanation":["“mobilisable”是英式拼写，对应美式拼写“mobilizable”。意思相同，只是拼写不同（常见差异：-ise/-ize，-isable/-izable）。","这个词常见于较正式的语境，尤其是军事、政府管理、应急响应、经济与公共政策中，强调“能够在需要时被集中、组织、投入使用”。"]}
{"word":"mobilisation","summary":{"en":"Mobilisation (BrE; AmE mobilization) means organizing and preparing people or resources for action, especially in war, emergencies, or big social/political efforts.","zh":"mobilisation（英式；美式为mobilization）指为行动而组织与准备人员或资源，常用于战争、紧急状况或大型社会/政治行动的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(BrE spelling) the act of organizing and preparing people, resources, or forces for action, especially for war, emergency response, or a major campaign.","zh":"（英式拼写）动员：为行动而组织并准备人员、资源或力量的过程，尤指战争、紧急事件应对或大型行动。"},"examples":[{"en":"The government announced the mobilisation of the army after the border conflict.","zh":"边境冲突后，政府宣布军队动员。"},{"en":"In a disaster, rapid mobilisation of volunteers can save lives.","zh":"在灾害中，迅速动员志愿者可能挽救生命。"},{"en":"The campaign relied on the mobilisation of young voters.","zh":"这场竞选依靠动员年轻选民。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of encouraging and bringing people together to support an idea, protest, or social movement.","zh":"（社会/政治语境）号召与组织群众参与：促使人们联合起来支持某种理念、抗议或社会运动的过程。"},"examples":[{"en":"Online mobilisation helped the protest spread quickly.","zh":"线上动员帮助抗议迅速扩散。"},{"en":"Community mobilisation is key to improving public health.","zh":"社区动员是改善公共健康的关键。"}]}],"synonyms":["mobilization","organization","deployment","activation","call-up"],"phonetic":"ˌmoʊbəlaɪˈzeɪʃən","extraExplanation":["“mobilisation”是英式拼写；美式英语更常写作“mobilization”。两者意思相同，只是拼写差异（-s- vs. -z-）。","词根来自“mobile（可移动的）”，核心含义是“让人/资源变得可调动、可行动”。常与of连用：the mobilisation of troops/resources/support（对军队/资源/支持的动员）。","常见搭配：rapid/large-scale mobilisation（迅速/大规模动员）、mass mobilisation（群众性动员）、wartime mobilisation（战时动员）。相近词：activation（启动/激活，较中性、技术感强）、call-up（征召，偏军队）、rallying（号召/鼓舞，偏情绪动员）。"]}
{"word":"mobilise","summary":{"en":"Mobilise means to get people or resources organized and ready to act, often for a cause, a military response, or recovery/therapy.","zh":"Mobilise 指把人或资源组织起来并准备行动，常用于社会动员、军事动员或康复治疗中促进活动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to organize and prepare people or resources for action toward a goal","zh":"动员；组织并准备人力或资源去采取行动（为达成某个目标）"},"examples":[{"en":"The community mobilised volunteers to clean up the park.","zh":"社区动员志愿者去清理公园。"},{"en":"The campaign quickly mobilised supporters online.","zh":"这场竞选很快在网上动员了支持者。"}]},{"partOfSpeech":"v.","definition":{"en":"(military/government) to call people into active service and get forces ready to act","zh":"（军队/政府）征召并使进入战备状态；动员军队"},"examples":[{"en":"The country mobilised its army after the border incident.","zh":"边境事件后，这个国家动员了军队。"},{"en":"Reservists were mobilised within days.","zh":"预备役人员在几天内就被动员起来了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(medicine/health) to help someone move more freely, especially after illness or surgery","zh":"（医学/健康）使（病人）活动起来；促进恢复活动能力"},"examples":[{"en":"The therapist helped mobilise his shoulder after surgery.","zh":"治疗师帮助他在手术后活动肩关节。"},{"en":"Early walking can mobilise patients and reduce complications.","zh":"尽早行走能帮助病人活动起来并减少并发症。"}]}],"synonyms":["mobilize","organize","rally","activate","marshal","galvanize"],"phonetic":"/ˈmoʊbəˌlaɪz/","extraExplanation":["“mobilise”是英式拼写；美式英语更常写作“mobilize”，含义相同。","在社会与政治语境中常见搭配：mobilise support/opinion/resources（动员支持/舆论/资源）。","在医疗语境里，mobilise常与关节或身体部位连用（mobilise the ankle/shoulder），意思是“促进活动度/让关节动起来”。"]}
{"word":"mobilised","summary":{"en":"“Mobilised” (UK spelling) means made ready/organized for action; it’s the same as US “mobilized.”","zh":"“mobilised”（英式拼写）表示“被动员、被组织调配以便行动”，与美式“mobilized”同义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made ready for action or organized for a particular purpose (often about an army, resources, or people).","zh":"被动员起来、为行动做好准备（常用于军队、资源或人力）。"},"examples":[{"en":"Emergency teams were mobilised within hours after the storm.","zh":"暴风雨过后数小时内，应急队伍就被动员起来了。"},{"en":"The government mobilised medical supplies to remote areas.","zh":"政府调配并动员医疗物资送往偏远地区。"}]},{"partOfSpeech":"v.","definition":{"en":"British spelling of “mobilized,” the past tense/past participle of “mobilise/mobilize” (to prepare and organize).","zh":"英式拼写，相当于 “mobilized”，是动词 “mobilise/mobilize”（动员、组织、调配）的过去式/过去分词。"},"examples":[{"en":"Thousands of volunteers have mobilised to support the relief effort.","zh":"成千上万的志愿者已经动员起来支持救援工作。"},{"en":"The army was mobilised at dawn.","zh":"军队在黎明时分完成了动员。"}]}],"synonyms":["organized","prepared","activated","deployed","rallied"],"phonetic":"/ˈmoʊbəˌlaɪzd/","extraExplanation":["“mobilised”是英式拼写；美式更常写作“mobilized”。意思相同，只是拼写不同。","常见搭配：mobilise troops（动员军队）、mobilise resources（调配资源）、mobilise support/opposition（动员支持/反对力量）、be mobilised（被动员/被调配）。","在新闻和历史写作里常见：例如“mobilised for war”（为战争动员）、“mass mobilised”（大规模动员）。"]}
{"word":"mobiliser","summary":{"en":"A mobiliser is someone or something that gets people organized and ready to take action.","zh":"mobiliser 指“动员者/组织者”，让人们组织起来并准备行动的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, group, or thing that organizes people or resources and gets them ready to act (especially in politics, community work, or business)","zh":"动员者；组织者：把人或资源组织起来并促使其准备行动的人、团体或事物（尤用于政治、社区或商业语境）"},"examples":[{"en":"Community mobilisers encouraged neighbors to vote in the local election.","zh":"社区动员者鼓励邻居在地方选举中投票。"},{"en":"The campaign hired mobilisers to knock on doors and talk with voters.","zh":"竞选团队雇了动员人员挨家挨户与选民交谈。"},{"en":"In a crisis, social media can become a powerful mobiliser.","zh":"在危机中，社交媒体可能成为强有力的动员工具。"}]}],"synonyms":["mobilizer","organizer","recruiter","rallying force","catalyst"],"phonetic":"/ˈmoʊbəˌlaɪzər/","extraExplanation":["“mobiliser”是英式拼写；美式英语更常写作“mobilizer”。两者意思相同。","在政治与公益语境中，mobiliser常指负责“拉票/组织活动/号召参与”的一线工作人员或组织者；也可更广泛指任何能促使人们采取行动的力量（如媒体、事件、口号）。"]}
{"word":"mobilises","summary":{"en":"“Mobilises” means organizes or activates people/resources to take action (UK spelling of “mobilizes”); it can also mean calling forces into active military service.","zh":"“mobilises”意为动员/组织或调动人力资源以采取行动（英式拼写，对应美式“mobilizes”）；也可指动员军队进入战备或现役。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(UK spelling) to organize people or resources so they are ready to act, especially for a big task like a campaign, protest, or emergency; also: to make something active or start moving/working.","zh":"（英式拼写）动员；组织人力或资源以便采取行动，尤指为一项大型任务（如竞选、抗议或紧急情况）；也可指使某事开始运转/发挥作用。"},"examples":[{"en":"The charity mobilises volunteers within hours after a natural disaster.","zh":"发生自然灾害后，这家慈善机构能在数小时内动员志愿者。"},{"en":"The new policy mobilises extra funding for public schools.","zh":"这项新政策为公立学校调动了额外资金。"},{"en":"Local leaders mobilised the community to clean up the river.","zh":"当地领导动员社区一起清理河流。"}]},{"partOfSpeech":"v.","definition":{"en":"(Usually passive) to be called up and prepared for military service; to put armed forces on active duty.","zh":"（多用于被动）征召并进入战备状态；使军队进入现役/动员状态。"},"examples":[{"en":"Many reservists were mobilised during the crisis.","zh":"危机期间，许多预备役人员被动员入伍。"},{"en":"The country mobilised its forces along the border.","zh":"该国在边境动员了部队。"}]}],"synonyms":["organizes","rallies","activates","marshals","calls up"],"phonetic":"/ˈmoʊbəˌlaɪzɪz/","extraExplanation":["“mobilises”是第三人称单数现在时（he/she/it mobilises）。美式拼写通常写作“mobilizes”（-ize），英式拼写常见“mobilises”（-ise）。意思相同。","词根与“mobile（可移动的）”相关，核心意象是“让人/资源从静止状态变成可以行动的状态”。","常见搭配：mobilise support（动员支持）、mobilise voters（动员选民）、mobilise resources（调动资源）、mobilise an army/forces（动员军队）。"]}
{"word":"mobilising","summary":{"en":"Mobilising means organizing and preparing people or resources to act (British spelling of mobilizing).","zh":"mobilising 指动员、组织并准备人力或资源采取行动（mobilizing 的英式拼写）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE spelling) to organize people or resources so they are ready to act, often quickly (e.g., for work, a campaign, an emergency, or war).","zh":"（英式拼写）动员；组织人力或资源，使其准备好行动，常指迅速行动（如工作、活动、紧急情况或战争）。"},"examples":[{"en":"The city is mobilising extra staff to deal with the snowstorm.","zh":"这座城市正在动员额外人员来应对暴风雪。"},{"en":"Local volunteers are mobilising to help families after the fire.","zh":"当地志愿者正在动员起来，在火灾后帮助受影响的家庭。"}]},{"partOfSpeech":"v.","definition":{"en":"(Biology/medicine) to cause something in the body to move into circulation or become available for use.","zh":"（生物/医学）使体内某物被“调动”进入循环或变得可供使用。"},"examples":[{"en":"Exercise can mobilise fat stores for energy.","zh":"运动可以动员脂肪储备来供能。"},{"en":"Treatment may help mobilise stem cells into the bloodstream.","zh":"治疗可能有助于将干细胞动员到血液中。"}]}],"synonyms":["mobilizing","organizing","rallying","marshalling","assembling"],"phonetic":"/ˈmoʊbəˌlaɪzɪŋ/","extraExplanation":["“mobilising”是现在分词/动名词形式（-ing），也可作形容词用（较少见）。例如：a mobilising message（能号召大家行动的信息）。","英式拼写是 mobilise / mobilising；美式拼写更常见的是 mobilize / mobilizing。两者意思相同，只是拼写差异。","常见搭配：mobilise support（动员支持）、mobilise resources（调配资源）、mobilise troops（动员部队）、mobilise voters（动员选民）、mobilise against sth（动员起来反对某事）。"]}
{"word":"mobilities","summary":{"en":"“Mobilities” is the plural of “mobility,” meaning different kinds of ability/opportunity to move or change position; in academic contexts it can mean the study of many forms of movement and flow (people, goods, information).","zh":"“mobilities”是“mobility”的复数，表示多种行动/流动能力或社会经济等方面的流动性；在学术语境中也可指对多种移动与流动（人、货物、信息等）的研究与概念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of **mobility**: the ability to move easily, or the ability/opportunity to change position (socially, economically, or geographically).","zh":"**mobility** 的复数：指（身体/交通上的）流动与行动能力，或（社会/经济/地域上的）流动性与上升/变动的机会。"},"examples":[{"en":"Public transportation improves urban mobilities by making it easier for people to get to work and school.","zh":"公共交通通过让人们更容易去上班和上学，提升了城市的多种出行/流动能力。"},{"en":"Researchers compare different mobilities, such as commuting, migration, and online movement through social networks.","zh":"研究者会比较不同的“移动/流动”形式，比如通勤、迁移，以及通过社交网络产生的线上流动。"}]},{"partOfSpeech":"n.","definition":{"en":"in academic writing (especially sociology and geography), **mobilities** refers to different kinds of movement and flow in modern life (people, goods, information, and ideas).","zh":"在学术写作中（尤其是社会学与地理学）**mobilities** 常指现代生活中多种“移动与流动”的整体研究对象：人、货物、信息与观念等的流动。"},"examples":[{"en":"The course examines mobilities in a globalized world, from tourism to supply chains.","zh":"这门课研究全球化世界中的多种流动性：从旅游到供应链。"},{"en":"Digital mobilities changed how communities form and spread news.","zh":"数字化流动改变了社群形成的方式以及新闻传播的路径。"}]}],"synonyms":["movement","motion","transportation","accessibility","social mobility"],"phonetic":"/moʊˈbɪləˌtiz/","extraExplanation":["“mobilities”最常见的日常用法就是“mobility”的复数（多种流动性/行动能力）。但在一些论文、课程大纲里，它也可能是一个学科术语，强调“移动/流动”不只发生在身体移动上，还包括信息、资本、商品与观念的流动。","拼写提示：mobility → mobilities（以 -y 结尾，变复数时把 y 变成 i 再加 -es）。"]}
{"word":"mobility","summary":{"en":"Mobility means the ability to move freely, or (in society) the ability to move up or change social/economic status.","zh":"Mobility 指行动/移动的能力，也可指社会或经济地位的流动性（如向上流动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability to move easily; how freely a person or object can move","zh":"（人或物）行动/移动的能力；机动性"},"examples":[{"en":"After the surgery, she worked with a therapist to improve her mobility.","zh":"手术后，她和治疗师一起训练来改善行动能力。"},{"en":"This lightweight suitcase is designed for better mobility in airports.","zh":"这款轻便行李箱为在机场更方便移动而设计。"}]},{"partOfSpeech":"n.","definition":{"en":"the ability to change one’s social or economic position (for example, moving to a higher-paying job or a higher social class)","zh":"（社会/经济）流动性（如获得更高收入工作或社会阶层上升的可能性）"},"examples":[{"en":"Education can increase social mobility.","zh":"教育可以提高社会流动性。"},{"en":"Many people move to big cities in search of upward mobility.","zh":"很多人去大城市寻找向上流动的机会。"}]}],"synonyms":["movement","freedom of movement","motility","social mobility","upward mobility"],"phonetic":"/moʊˈbɪləti/","extraExplanation":["“mobility”常和不同领域搭配使用：\n- health/medical：reduced mobility（行动不便）、mobility aid（助行器）\n- business/tech：mobile devices & mobility（移动设备与移动办公）\n- society：social mobility（社会流动性）、upward mobility（向上流动）\n语气通常偏正式，写作与新闻中很常见。"]}
{"word":"mobiliz","summary":{"en":"“Mobiliz” is usually a misspelling of **mobilize**: to mobilize people or resources for action; also to mobilize an army.","zh":"“mobiliz”通常是 **mobilize** 的误拼：指动员人群或资源采取行动；也可指军事动员。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually spelled **mobilize**) to organize people for action, especially for a shared goal (e.g., a campaign, protest, or community effort).","zh":"（通常拼作 **mobilize**）动员、组织人们采取行动，尤其为了共同目标（如竞选、抗议或社区行动）。"},"examples":[{"en":"The group mobilized volunteers to help after the storm.","zh":"该团体动员志愿者在暴风雨后提供帮助。"},{"en":"Students mobilized quickly to raise funds for a classmate.","zh":"学生们迅速动员起来为一位同学募款。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Usually spelled **mobilize**) to prepare and put resources (money, equipment, information, support) into active use.","zh":"（通常拼作 **mobilize**）调动、整合并投入资源（资金、设备、信息、支持等）以便立即使用。"},"examples":[{"en":"The company mobilized its staff and equipment to restore service.","zh":"公司调动员工和设备来恢复服务。"},{"en":"We need to mobilize public support for the new policy.","zh":"我们需要动员公众支持这项新政策。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Military) to call up and make an army ready for war or emergency duty.","zh":"（军事）动员军队（征召、集结并使其进入战备或应急状态）。"},"examples":[{"en":"The country mobilized its reserve forces during the crisis.","zh":"危机期间，该国动员了预备役部队。"}]},{"partOfSpeech":"vi.","definition":{"en":"To begin organizing and moving into action (without an object).","zh":"开始动员并投入行动（不及物用法）。"},"examples":[{"en":"Local communities mobilized to protect the river.","zh":"当地社区动员起来保护这条河流。"}]}],"synonyms":["organize","rally","marshal","activate","call up"],"phonetic":"/ˈmoʊbəˌlaɪz/","extraExplanation":["你输入的 **mobiliz** 在英语里通常不是标准拼写；最常见的正确形式是 **mobilize**（美式），英式常拼作 **mobilise**。","词根和 **mobile**（可移动的）有关，核心感觉是“让人/资源从静止变为可行动的状态”。","注意区分：**mobilize (for/against sth)** 强调“动员起来去做”，而 **organize** 更偏“安排组织结构/流程”。"]}
{"word":"mobilizable","summary":{"en":"Mobilizable describes people, resources, or reserves that can be organized and made ready for action or use.","zh":"mobilizable 指“可动员的”，用于描述能够被组织调配并准备投入行动或使用的人员、资源或储备。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be mobilized (organized and made ready for action or use), especially people, resources, or forces.","zh":"可动员的；可被组织起来并准备投入行动或使用的（尤指人员、资源或力量）。"},"examples":[{"en":"The company keeps a mobilizable workforce for emergency repairs.","zh":"公司保留一支可随时动员的队伍来应对紧急维修。"},{"en":"The city created a list of mobilizable volunteers before hurricane season.","zh":"该市在飓风季之前建立了一份可动员志愿者名单。"}]},{"partOfSpeech":"adj.","definition":{"en":"In biology/chemistry: able to be released or made available for movement or use (such as nutrients, energy, or stored substances).","zh":"（生物/化学）可被释放或转为可利用状态的（如营养、能量或储存物质）。"},"examples":[{"en":"Some calcium is mobilizable from bones when the body needs it.","zh":"当身体需要时，一部分钙可从骨骼中被动员出来。"},{"en":"Stress can increase mobilizable energy reserves.","zh":"压力可能会增加可动员的能量储备。"}]}],"synonyms":["deployable","call-up (adj.)","available for mobilization","activatable","usable"],"phonetic":"/ˈmoʊbəˌlaɪzəbəl/","extraExplanation":["词形拆解：mobilize（动员/调动）+ -able（“能够被……”的形容词后缀），因此 mobilizable = “能够被动员/调动的”。","常见搭配：mobilizable resources（可动员资源）、mobilizable personnel/workforce（可动员人员/劳动力）、mobilizable volunteers（可动员志愿者）、mobilizable reserves（可动员储备）。","语域提示：mobilizable 偏正式，常见于政府、军事、管理、学术写作；日常口语里更常用 ready to be mobilized / can be mobilized。"]}
{"word":"mobilizably","summary":{"en":"Mobilizably means “in a way that can be mobilized”—organized or ready to be brought into action quickly.","zh":"Mobilizably 表示“以可动员的方式”：能够被组织起来并迅速投入行动或使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be mobilized (able to be organized, gathered, or made ready for action or use).","zh":"以可动员的方式；以能够被组织、召集或准备投入行动/使用的方式。"},"examples":[{"en":"The resources were not mobilizably arranged, so the team lost time when the emergency began.","zh":"这些资源没有以“可动员的方式”进行配置，所以紧急情况开始时团队浪费了时间。"},{"en":"The data must be stored mobilizably so it can be quickly shared during a crisis.","zh":"数据必须以“可快速调配/动员”的方式存储，才能在危机中迅速共享。"}]}],"synonyms":["in a mobilizable way","so as to be mobilized","in a readily deployable manner","in a way that can be organized quickly"],"phonetic":"/ˈmoʊbəˌlaɪzəbli/","extraExplanation":["“mobilizably”非常少见，多数情况下英语更自然的说法是用短语来表达，例如：“in a way that can be mobilized / in a readily mobilizable manner”。","它来自形容词“mobilizable（可动员的）”加上副词后缀“-ly”。常见语境包括：军事/政府动员（troops, civilians）、组织管理（staff, volunteers）、资源调配（funds, supplies）、以及信息系统的快速部署（data, systems）。"]}
{"word":"mobilization","summary":{"en":"Mobilization means the process of organizing and preparing people or resources for action, often in war or emergencies; it can also refer to therapeutic movement in medicine.","zh":"Mobilization 指为行动而对人力物力进行组织与准备的过程（常用于战争或紧急事件）；也可指医学上的活动/松动治疗等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of organizing and preparing people, resources, or equipment for action (especially for war, an emergency, or a big project)","zh":"动员；调动；（为行动而进行的）组织与准备（尤指战争、紧急事件或大型项目）"},"examples":[{"en":"The government announced the mobilization of emergency teams after the earthquake.","zh":"地震后，政府宣布动员应急队伍。"},{"en":"Rapid mobilization of supplies saved many lives.","zh":"物资的快速调配挽救了许多生命。"},{"en":"Community mobilization helped the city clean up the river.","zh":"社区动员帮助城市清理了河流。"}]},{"partOfSpeech":"n.","definition":{"en":"in medicine, the movement of something (such as a joint) to restore function, or the movement of a substance within the body","zh":"（医学）活动/松动治疗（如关节的活动以恢复功能）；（体内物质的）移动"},"examples":[{"en":"After surgery, gentle mobilization of the shoulder reduced stiffness.","zh":"手术后，对肩部进行轻柔的活动训练可以减轻僵硬。"},{"en":"The therapist focused on joint mobilization to improve range of motion.","zh":"治疗师通过关节松动术来改善活动范围。"}]}],"synonyms":["organization","deployment","activation","marshalling","call-up"],"phonetic":"/ˌmoʊbəlaɪˈzeɪʃən/","extraExplanation":["词源与构词：mobilization 来自 mobilize（动员/调动）+ -ation（名词后缀，表示“行为/过程”）。因此它常强调“把分散的人力物力组织起来并投入使用”的过程。","常见搭配：mass/rapid/full mobilization（大规模/迅速/全面动员）；mobilization of troops/resources/voters（军队/资源/选民的动员）。在新闻语境里常与 national defense、emergency response、election campaign 等主题一起出现。"]}
{"word":"mobilizations","summary":{"en":"“Mobilizations” means multiple acts or events of organizing people/resources to act, often in military, emergency, or social/political contexts.","zh":"“Mobilizations”指多次/多种“动员或调动”，常用于军事、紧急事务或社会/政治行动等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of organizing people or resources so they are ready to act (plural of “mobilization”)","zh":"动员；调动（人力或资源，使其准备行动）（“mobilization”的复数）"},"examples":[{"en":"The emergency required rapid mobilizations of medical teams and supplies.","zh":"这场紧急事件需要迅速动员医疗队伍和物资。"},{"en":"The company’s disaster plan includes mobilizations across multiple regions.","zh":"该公司的灾难预案包括对多个地区的调动与动员。"}]},{"partOfSpeech":"n.","definition":{"en":"military call-ups and preparations for war or large operations (plural)","zh":"军事动员；征召与备战（复数）"},"examples":[{"en":"Historians compare the different mobilizations that took place before the war.","zh":"历史学家会比较战争爆发前发生的不同军事动员。"},{"en":"Several mobilizations were announced as tensions rose along the border.","zh":"随着边境紧张局势加剧，官方宣布了数次军事动员。"}]},{"partOfSpeech":"n.","definition":{"en":"organized efforts to bring large groups into action for social or political goals (plural)","zh":"社会/政治动员；组织群众行动（复数）"},"examples":[{"en":"The campaign relied on local mobilizations to increase voter turnout.","zh":"该运动依靠地方动员来提高投票率。"},{"en":"Online mobilizations can spread quickly, but they don’t always lead to lasting change.","zh":"线上动员传播很快，但不一定带来持久改变。"}]}],"synonyms":["call-ups","deployments","organization","coordination","rallying","activation"],"phonetic":"ˌmoʊbəlaɪˈzeɪʃən","extraExplanation":["“mobilizations”是名词复数，表示“多次动员/多种动员”。如果你指一个总体过程，常用单数“mobilization”（例如：the mobilization of resources）。","常见搭配：mass mobilizations（大规模动员）、military mobilizations（军事动员）、rapid mobilizations（快速动员）、nationwide mobilizations（全国动员）。","相关词形：mobilize（v. 动员/调动）、mobilized（adj. 已动员的）、mobilization（n. 动员）。注意与“motivation（动机）”不要混淆。"]}
{"word":"mobilize","summary":{"en":"Mobilize means to organize and activate people or resources so they are ready to act, often on a large scale.","zh":"Mobilize 指“动员/调动”，把人力或资源组织起来并投入行动，常用于较大规模的任务。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To organize and prepare people or resources for action, especially for a major task or campaign.","zh":"动员；组织并准备人力或资源去采取行动，尤指为重大任务或活动做准备。"},"examples":[{"en":"Community leaders mobilized volunteers to clean up the park.","zh":"社区领袖动员志愿者去清理公园。"},{"en":"The company mobilized its teams to respond to the crisis.","zh":"公司调动各团队来应对危机。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something able to move or be used; to bring resources into active use.","zh":"使可移动；使资源投入使用、变得可用。"},"examples":[{"en":"The body mobilizes energy when you exercise.","zh":"运动时，身体会调动能量。"},{"en":"The government tried to mobilize funding for public housing.","zh":"政府试图调动资金用于公共住房。"}]},{"partOfSpeech":"v.","definition":{"en":"To prepare a country’s armed forces for war (often used with 'for' or 'against').","zh":"（军事）动员军队进入备战状态（常与 for/against 连用）。"},"examples":[{"en":"The nation mobilized for war after the attack.","zh":"遭到袭击后，这个国家开始为战争动员。"}]}],"synonyms":["organize","rally","marshal","activate","deploy"],"phonetic":"/ˈmoʊbəˌlaɪz/","extraExplanation":["词根提示：mobilize 来自 mobile（可移动的）+ -ize（使……化/使成为）。核心感觉是“让人或资源动起来、用起来”。","常见搭配：mobilize support/resources/volunteers；mobilize for action/against something；be mobilized to do something（被动员去做某事）。","易混词对比：motivate 更偏“激励某人想做”；mobilize 更偏“组织起来并开始行动”，通常涉及群体或资源调配。"]}
{"word":"mobilized","summary":{"en":"Mobilized means organized and made ready for action (often people, teams, or resources).","zh":"mobilized 指把人力或资源组织起来并准备好立即行动（常用于团队、物资、救援或军事等）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of mobilize) to organize and prepare people or resources for action, especially quickly.","zh":"（mobilize 的过去式/过去分词）动员并准备人力或资源去采取行动，尤指迅速地。"},"examples":[{"en":"The government mobilized emergency teams after the earthquake.","zh":"地震后，政府动员了应急队伍。"},{"en":"Local volunteers mobilized to deliver food to older neighbors.","zh":"当地志愿者迅速动员起来，为年长的邻居送食物。"},{"en":"The company mobilized extra staff to handle the holiday rush.","zh":"公司调动了额外员工来应对节日高峰。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective) brought into an active, ready-to-use state; assembled and prepared to act.","zh":"（作形容词）已被调动并处于可立即行动/可投入使用的状态。"},"examples":[{"en":"By morning, a fully mobilized workforce was on site.","zh":"到早晨，一支已动员到位的队伍已在现场。"},{"en":"They needed mobilized support from the community.","zh":"他们需要来自社区的已组织起来的支持力量。"}]}],"synonyms":["activated","organized","assembled","deployed","rallied","marshaled"],"phonetic":"/ˈmoʊbəˌlaɪzd/","extraExplanation":["“mobilize / mobilized”最常见的语境是军事与公共危机（如战时动员、救灾动员），但在商业、社会运动中也很常用，表示“迅速组织资源并投入行动”。","在写作中，mobilized 往往暗示“有目的地集中力量”，比单纯的 “gathered（聚集）”更强调组织与准备。"]}
{"word":"mobilizer","summary":{"en":"A mobilizer is someone (or something) that helps organize and move people or resources into action.","zh":"mobilizer 指“动员者”或“动员工具/手段”，用于组织并推动人或资源采取行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that organizes and encourages people to take action, especially in politics, social movements, or community work.","zh":"（尤指在政治、社会运动或社区工作中）动员他人采取行动的人或团体。"},"examples":[{"en":"She worked as a community mobilizer, helping neighbors register to vote.","zh":"她担任社区动员者，帮助邻居登记投票。"},{"en":"Student mobilizers organized a peaceful march on campus.","zh":"学生动员者在校园里组织了一场和平游行。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool, device, or method that helps move something or makes people/resources ready for use.","zh":"用于帮助移动某物或使人员/资源进入可用状态的工具、装置或方法。"},"examples":[{"en":"The app became a mobilizer for donations after the disaster.","zh":"灾后这款应用成了捐款动员工具。"},{"en":"In rehab, a knee mobilizer can help support movement during recovery.","zh":"在康复治疗中，膝关节支具（mobilizer）可在恢复期间帮助支撑活动。"}]}],"synonyms":["organizer","advocate","activist","campaigner","coordinator"],"phonetic":"/ˈmoʊbəˌlaɪzɚ/","extraExplanation":["“mobilizer”来自动词“mobilize”（动员、调动），常见于政治竞选、社区组织、公益倡导等语境中，强调“把分散的人/资源组织起来并推动行动”。","在医疗与康复语境里，“mobilizer”有时指帮助关节活动或支撑身体部位的装置/辅助器具；不过更常见的说法可能是具体器具名称（如 brace, splint, immobilizer 等）。"]}
{"word":"mobilizers","summary":{"en":"Mobilizers are people or forces that rally others to take action; in some technical contexts, it can also mean things that help something move or become usable.","zh":"Mobilizers 指动员他人行动的人或力量；在部分技术语境中也可指促进移动或使之可用的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People, groups, or tools that organize and motivate others to take action (especially in politics, community work, or social movements).","zh":"动员者；动员力量：组织并激励他人采取行动的人、团体或工具（尤指政治、社区工作或社会运动中）。"},"examples":[{"en":"Volunteer mobilizers knocked on doors to encourage people to vote.","zh":"志愿动员者挨家挨户敲门，鼓励大家去投票。"},{"en":"The campaign trained mobilizers to talk with undecided voters respectfully.","zh":"竞选团队培训动员者，以尊重的方式与未决定的选民沟通。"}]},{"partOfSpeech":"n.","definition":{"en":"Things or substances that cause movement or make something ready for use (common in technical or medical contexts, depending on the field).","zh":"促动剂；使……可动/可用之物：促使移动或让某物进入可使用状态的东西（在技术或医学语境中较常见，视领域而定）。"},"examples":[{"en":"In this therapy program, gentle stretches act as mobilizers for stiff joints.","zh":"在这套康复方案里，温和的拉伸起到“促动”僵硬关节的作用。"},{"en":"Some devices include small mobilizers that help reposition the equipment safely.","zh":"有些设备配有小型促动装置，帮助安全地重新定位器材。"}]}],"synonyms":["organizers","activists","advocates","recruiters","campaign workers"],"phonetic":"/ˈmoʊbəˌlaɪzərz/","extraExplanation":["“mobilizers”是“mobilizer”的复数。英语里常见于组织动员语境，如选举（get-out-the-vote）、工会、社区倡议等，强调“把人组织起来并促成行动”。","在更专业的语境（如康复/物理治疗或工程描述）中，“mobilizer(s)”也可能指帮助“活动/移动”的方法或装置；具体含义通常要看所在领域与上下文。"]}
{"word":"mobilizes","summary":{"en":"“Mobilizes” means “organizes or activates people/resources to take action” (and can also mean “makes something able to move or be used”).","zh":"“mobilizes”表示“动员/组织人力或资源去行动”，也可表示“使……能够活动或被利用”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to organize people or resources for a specific purpose (especially for action, work, or war); third-person singular form of “mobilize”","zh":"动员；组织人力或资源以达成特定目的（尤指采取行动、开展工作或备战），“mobilize”的第三人称单数形式"},"examples":[{"en":"The government mobilizes emergency teams when a major storm is expected.","zh":"预计会有强风暴时，政府会动员应急队伍。"},{"en":"The nonprofit mobilizes volunteers to clean up parks every weekend.","zh":"这个非营利组织每个周末动员志愿者清理公园。"}]},{"partOfSpeech":"v.","definition":{"en":"to bring support together and encourage people to take action (often used in politics or social movements); third-person singular form of “mobilize”","zh":"发动、号召并凝聚支持，促使人们采取行动（常用于政治或社会运动语境），“mobilize”的第三人称单数形式"},"examples":[{"en":"The candidate mobilizes young voters through campus events and social media.","zh":"这位候选人通过校园活动和社交媒体发动年轻选民。"},{"en":"The community leader mobilizes neighbors to oppose the plan.","zh":"社区领袖号召邻居们反对这项计划。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something able to move or be used (common in medicine/biology, e.g., mobilizing a joint or mobilizing stored energy); third-person singular form of “mobilize”","zh":"使……能够活动或被利用（常见于医学/生物学，如关节松动/活动训练，或调动体内储备能量），“mobilize”的第三人称单数形式"},"examples":[{"en":"Physical therapy mobilizes the shoulder to improve range of motion.","zh":"物理治疗会对肩关节进行活动训练以改善活动范围。"},{"en":"During fasting, the body mobilizes stored fat for energy.","zh":"禁食期间，身体会调动储存的脂肪来供能。"}]}],"synonyms":["organizes","rallies","deploys","activates","marshals"],"phonetic":"/ˈmoʊbəˌlaɪzɪz/","extraExplanation":["“mobilize”来自“mobile（可移动的）”，核心感觉是“让人/资源动起来、用起来”。在新闻里常见于“mobilize troops（动员军队）”“mobilize voters（发动选民）”“mobilize resources（调集资源）”。","语气区别：mobilize 往往暗示“有组织、有目标、规模较大”的动员；比起 “gather（聚集）/call（叫来）”，更强调“协调、部署、促成行动”。"]}
{"word":"mobilizing","summary":{"en":"Mobilizing means organizing people or resources so they are ready to take action, often quickly and for a specific goal.","zh":"Mobilizing 指为行动迅速组织、动员或调配人力与资源，常服务于具体目标。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of mobilize) organizing people, resources, or support so they can act quickly and effectively, often for a specific goal (e.g., a campaign, emergency response, or war).","zh":"（mobilize 的现在分词）动员；调动（人力、资源或支持），使其能迅速有效地采取行动，常用于某个明确目标（如竞选、应急或战争）。"},"examples":[{"en":"The city is mobilizing emergency crews after the storm.","zh":"暴风雨过后，这座城市正在动员应急人员。"},{"en":"Community leaders are mobilizing volunteers to clean up the park.","zh":"社区领袖正在动员志愿者清理公园。"},{"en":"The campaign is mobilizing young voters online.","zh":"该竞选团队正在通过网络动员年轻选民。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an effort that is actively gathering people or resources to take action.","zh":"（作形容词用）指正在积极组织人力或资源以采取行动的；动员中的。"},"examples":[{"en":"They launched a mobilizing message that encouraged neighbors to help each other.","zh":"他们发布了一条具有动员作用的信息，鼓励邻里互相帮助。"},{"en":"Her speech had a mobilizing effect on the audience.","zh":"她的演讲对听众起到了动员作用。"}]}],"synonyms":["organizing","rallying","marshaling","activating","calling up"],"phonetic":"ˈmoʊbəˌlaɪzɪŋ","extraExplanation":["“mobilizing”常见于三类语境：\n1）军事：mobilizing troops（动员军队）；\n2）公共事务/危机：mobilizing resources（调配资源）；\n3）社会运动/政治：mobilizing support/voters（动员支持者/选民）。\n在日常英语里，它通常比“gathering（聚集）”更强调“为了行动而组织起来”。"]}
{"word":"mobilometer","summary":{"en":"Mobilometer is a rare technical noun for an instrument used to measure material consistency or, more broadly, mobility/viscosity.","zh":"Mobilometer 是一个较少见的技术名词，指用于测定材料稠度的仪器；广义上也可指测量移动性/黏度的装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used in materials testing to determine the consistency (flow/thickness) of plastic or other semi-solid materials","zh":"一种用于材料测试的仪器，用来测定塑料或其他半固体材料的稠度（流动性/黏稠程度）"},"examples":[{"en":"The lab used a mobilometer to compare the consistency of two plastic batches before production.","zh":"实验室使用 mobilometer 来比较两批塑料在投产前的稠度差异。"},{"en":"If the mobilometer reading is too high, the material may be harder to shape during molding.","zh":"如果 mobilometer 的读数过高，这种材料在模塑时可能更难成形。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader/less common) an instrument for measuring how easily something moves or flows; a device for measuring mobility or viscosity","zh":"（更宽泛/较少见）用于测量某物移动或流动难易程度的仪器；测量“移动性/黏度”等的装置"},"examples":[{"en":"Researchers tracked changes in the fluid’s viscosity using a mobilometer.","zh":"研究人员使用 mobilometer 追踪该液体黏度的变化。"}]}],"synonyms":["viscometer","rheometer","consistometer","flow meter"],"phonetic":"/ˌmoʊbəˈlɑːmɪtər/","extraExplanation":["这个词在日常英语里非常少见，更多出现在材料科学/工业测试等技术语境中；一般对话里人们更常说 viscometer（黏度计）或 rheometer（流变仪）。","词源上可拆解为 mobility（可动性/流动性）+ -o- + -meter（测量仪），字面意思就是“测量可动性/流动性的仪器”。","注意不要和一些品牌名或应用名混淆：例如有些“记录出行/移动行为”的产品会用类似拼写（如 MobiMeter），但那通常不是英语词典里的 mobilometer。"]}
{"word":"mobily","summary":{"en":"“Mobily/mobily” can mean (rarely) “in a mobile way,” or it can be a telecom company name (Mobily).","zh":"“Mobily/mobily”可（罕见地）表示“以可移动的方式”，也可作为电信公司名称（Mobily）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare) In a mobile way; with the ability to move or be moved easily.","zh":"（罕用）以可移动的方式；灵活移动地。"},"examples":[{"en":"The units were designed to work mobily, so they could be moved between classrooms.","zh":"这些设备被设计成可灵活移动的，所以可以在不同教室之间搬运使用。"},{"en":"In disaster response, teams must operate mobily and adapt quickly.","zh":"在灾害救援中，队伍必须机动行动并快速适应。"}]},{"partOfSpeech":"n.","definition":{"en":"Mobily (proper noun): a major telecommunications brand/company name (commonly used in Saudi Arabia).","zh":"Mobily（专有名词）：一家电信品牌/公司名称（在沙特阿拉伯较常见）。"},"examples":[{"en":"I bought a Mobily SIM card when I arrived in Riyadh.","zh":"我到利雅得后买了一张 Mobily 的SIM卡。"},{"en":"Mobily’s network coverage varies by region.","zh":"Mobily 的网络覆盖会因地区而不同。"}]}],"synonyms":["in a mobile way","flexibly","with mobility"],"phonetic":"/ˈmoʊbəli/","extraExplanation":["“mobily”作为副词在现代英语里非常少见；更常见的说法是“in a mobile way / in a mobile manner”或用更具体的词如“flexibly（灵活地）”“with mobility（具备机动性地）”。","如果你看到的是首字母大写“Mobily”，通常指沙特的电信品牌，而不是英语里常用的副词。"]}
{"word":"moble","summary":{"en":"Moble is an archaic verb meaning “to wrap or muffle the head/face,” often with a hood, veil, or scarf.","zh":"Moble 是一个很少见的古语动词，意思是“用兜帽/面纱/围巾等把头或脸包住、遮住”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to wrap or muffle the head or face (for example, with a hood, veil, or scarf).","zh":"（古语）用兜帽、面纱或围巾等把头部/脸部包住、遮住（使其保暖或隐蔽）。"},"examples":[{"en":"She mobled her head with a scarf against the cold wind.","zh":"她用围巾把头裹住，抵挡寒风。"},{"en":"The traveler mobled his face before stepping into the storm.","zh":"旅行者在走进暴风雨前把脸遮了起来。"}]}],"synonyms":["muffle","wrap","cover","shroud","veil"],"phonetic":"/ˈmɑbəl/","extraExplanation":["“moble”在现代英语中非常少见，属于古语（archaic）。日常写作/口语里几乎不用；多数情况下人们想写的是拼写更常见的“mobile”（可移动的；手机的）。","词源上一般认为它是“muffle”（裹住/捂住/使声音闷住）的变体拼写；在一些文学语境里会用来营造“被纱/雾/布料轻轻遮住”的画面感。"]}
{"word":"moblike","summary":{"en":"Moblike means “like a mob”: disorderly, uncontrolled, and sometimes aggressive or lawless (often used critically).","zh":"moblike 表示“像暴民/乌合之众一样”：混乱、失控，常带有攻击性或无视规则（多用于批评）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a mob; showing the chaotic, aggressive, or lawless behavior often associated with a large unruly crowd.","zh":"像暴民/乌合之众的；带有群体失控、混乱、攻击性或无视规则的特征。"},"examples":[{"en":"The peaceful march turned moblike when a few people started throwing bottles.","zh":"原本和平的游行在少数人开始扔瓶子后，变得像暴民一样失控。"},{"en":"Online comments can become moblike, with people piling on without checking facts.","zh":"网络评论有时会变得“暴民式”，大家不核实事实就一拥而上攻击。"}]}],"synonyms":["mobbish","disorderly","lawless","unruly","chaotic"],"phonetic":"/ˈmɑbˌlaɪk/","extraExplanation":["“moblike”通常写作 **mob-like**（带连字符），意思是“像mob（暴民/乌合之众）一样”。常用于批评某种群体氛围或行为，暗含“跟风、失去理性、容易升级为暴力/违法”的感觉。","常见搭配：**moblike behavior**（暴民式行为）、**moblike mentality**（暴民心理/群体盲从心态）。","近义词：**mobbish**（更常见、更固定的形容词）；相关表达：**mob mentality**（从众式的暴民心理）、**pile-on**（网络上群起围攻，口语）。"]}
{"word":"mobocracies","summary":{"en":"“Mobocracies” means situations or societies where power is driven by mob pressure instead of law and institutions.","zh":"“mobocracies”指“暴民统治”的局面或社会，即以群众压力取代法治与制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rule or control by an angry crowd (rather than by law or elected institutions); situations where public decisions are driven by mob pressure, intimidation, or violence.","zh":"暴民统治；指不是靠法律或正式制度，而是靠愤怒人群的压力、恐吓或暴力来左右公共决定的局面。"},"examples":[{"en":"When leaders give in to threats, democracy can slide into mobocracies.","zh":"当领导人屈服于威胁时，民主可能会滑向暴民统治。"},{"en":"The article warns that online harassment can create new kinds of mobocracies.","zh":"那篇文章警告说，网络骚扰可能制造出新形式的暴民统治。"}]},{"partOfSpeech":"n.","definition":{"en":"A society or political environment characterized by mob rule.","zh":"以暴民统治为特征的社会或政治环境。"},"examples":[{"en":"The novel describes a city that becomes one of the mobocracies after the courts collapse.","zh":"那部小说描写了法院体系崩溃后，一座城市变成了暴民统治之地。"}]}],"synonyms":["mob rule","ochlocracy","rule by the crowd","lynch law (context-dependent)","crowd domination"],"phonetic":"/ˌmɑːˈbɑːkrəsiz/","extraExplanation":["“mobocracies”是“mobocracy”的复数：mob（暴民、人群）+ -cracy（统治形式，如democracy）。这个词通常带强烈贬义，用来批评“情绪化的群众压力”取代了法治与程序正义。","在现代语境里，它既可指街头暴力与恐吓造成的“暴民政治”，也常被用来讨论网络舆论围攻、取消文化等现象（强调“被人群裹挟”的决策）。使用时要注意语气很强，容易被理解为在指责对方群体。"]}
{"word":"mobocracy","summary":{"en":"Mobocracy means mob rule—control by an unruly crowd instead of lawful government.","zh":"Mobocracy 指“暴民政治/暴民统治”，即由失控群众而非依法治理的权力与秩序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Government or political control by a mob (an angry or unruly crowd), rather than by law or elected institutions.","zh":"暴民政治；由暴民（愤怒或失控的群众）而不是由法律或民选机构来支配的政治状态。"},"examples":[{"en":"The mayor warned that violence in the streets could lead to mobocracy instead of lawful debate.","zh":"市长警告说，街头暴力可能会让社会走向暴民政治，而不是依法进行的公共讨论。"},{"en":"When courts are ignored and rumors decide punishments, a community risks sliding into mobocracy.","zh":"当法院被无视、谣言决定惩罚时，一个社区就有滑向暴民政治的风险。"}]}],"synonyms":["mob rule","ochlocracy","lynch law"],"phonetic":"/mɑˈbɑːkrəsi/","extraExplanation":["词源上可拆为 mob（乌合之众、暴民）+ -cracy（“统治、政体”，也见于 democracy 民主、bureaucracy 官僚体制）。因此 mobocracy 字面就是“暴民统治”。","语气与用法：这是一个强烈的贬义词，常用于批评“以情绪和群体压力取代法治与程序正义”的现象；写作中常与 rule of law（法治）、due process（正当程序）对比。","近义表达常见有 mob rule（暴民统治）、lynch law（私刑/以私刑代替法律），但 lynch law 更强调“私刑处置”的行为，而 mobocracy 更强调“政治/社会秩序层面的统治状态”。"]}
{"word":"mobocrat","summary":{"en":"A mobocrat is a person who supports—or takes part in—mob rule (mobocracy).","zh":"mobocrat 指主张或参与“暴民统治（mobocracy）”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or advocates mob rule (government controlled by an angry crowd rather than by law and institutions).","zh":"主张“暴民统治/民众暴力施压式统治”的人（由愤怒人群而不是法律与制度来掌控政治）。"},"examples":[{"en":"Some commentators accused the speakers of being mobocrats because they encouraged the crowd to intimidate officials.","zh":"一些评论者指责这些演讲者是“mobocrats”，因为他们鼓动人群去恐吓官员。"},{"en":"In the essay, the author warns that a society can slide from democracy into mobocracy when mobocrats are rewarded.","zh":"文章警告说，当“mobocrats”受到奖励时，社会可能从民主滑向暴民统治。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of a mob that effectively dominates public life (for example, by violence or threats).","zh":"实际上通过暴力或威胁左右公共事务的暴民成员。"},"examples":[{"en":"The judge described the attackers as mobocrats who tried to replace justice with fear.","zh":"法官把袭击者形容为“mobocrats”，试图用恐惧取代正义。"}]}],"synonyms":["advocate of mob rule","supporter of mobocracy","ochlocrat (formal)"],"phonetic":"/ˈmɑːbəˌkræt/","extraExplanation":["这是一个贬义词，词形由 mob（暴民、人群）+ -crat（“……统治者/支持者”，见 democrat、bureaucrat）构成，意思与 mobocracy（暴民统治）直接相关。","在现实语境里，它常用于政治评论/社论中，带有强烈指责色彩：暗示用情绪、恐吓与群体压力取代法治与程序。","相关近义概念：mob rule / mobocracy；更书面、更学术的同义词是 ochlocracy（“乌合之众政治/暴民政治”）。注意不要与游戏名《Mobocratic》或形容词 mobocratic（与暴民统治有关的）混淆。"]}
{"word":"mobocratic","summary":{"en":"Mobocratic describes situations where an unruly crowd holds excessive power, often overriding law and institutions.","zh":"mobocratic 指“暴民统治式”的局面：失序的人群拥有过大影响力，往往压倒法律与制度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of a society or political situation where a disorderly crowd (“the mob”) has too much power or influence, often ignoring laws and institutions.","zh":"与“暴民统治/多数暴力”（由情绪化、失序的人群左右局势）有关的；具有暴民统治特征的（常指无视法律与制度）。"},"examples":[{"en":"The speaker warned that public anger could turn the debate mobocratic, drowning out reasoned discussion.","zh":"演讲者警告说，公众愤怒可能让辩论走向“暴民式”的局面，使理性讨论被淹没。"},{"en":"Some critics described the online harassment campaign as mobocratic pressure rather than democratic participation.","zh":"一些批评者把那场网络骚扰行动称为“暴民式压力”，而不是民主参与。"}]}],"synonyms":["mob-rule","populist (sometimes, context-dependent)","lawless","vigilante-style (context-dependent)"],"phonetic":"/ˌmɑbəˈkrætɪk/","extraExplanation":["这个词来自 mobocracy（暴民统治）+ -ic（“……的”）。它通常带强烈贬义，强调“群众情绪/围攻”取代法治与程序，并不等同于 democracy（民主）。","mobocratic 比较少见，更常见的表达有 mob rule（暴民统治）、vigilante justice（私刑/义警式执法）、rule by the crowd（被人群左右）。"]}
{"word":"mobocratical","summary":{"en":"Mobocratical (rare) means “mobocratic”: related to mobocracy—control by a crowd, often implying disorderly or emotional pressure instead of lawful governance.","zh":"mobocratical（罕见）意为“mobocratic”：与暴民政治有关，常含贬义，强调以情绪化的群体压力取代法治或制度治理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard/rare form of **mobocratic**: relating to *mobocracy*—rule or control by a crowd (often implying disorderly or emotional public pressure rather than lawful, representative government).","zh":"非标准/罕见形式，等同于 **mobocratic**：与“暴民政治/群众失控式统治（mobocracy）”有关，常带贬义，强调以喧闹、情绪化的群体压力取代理性、法治或代议制度。"},"examples":[{"en":"The writer condemned the protests as **mobocratical**, claiming the crowd was overriding the courts.","zh":"作者把抗议谴责为 **mobocratical**，称人群正在凌驾于法院之上。"},{"en":"Some critics warn that online outrage can create a **mobocratical** kind of decision-making.","zh":"一些批评者警告说，网络群体愤怒可能导致一种 **mobocratical** 的决策方式。"}]}],"synonyms":["mobocratic","populist (sometimes, context-dependent)","ochlocratic (very formal/rare)"],"phonetic":"/ˌmoʊbəˈkrætɪkəl/","extraExplanation":["“mobocratical”在现代英语里很少见，通常更自然、更常用的是 **mobocratic**。","构词提示：**mob**（乌合之众/人群）+ **-cracy**（统治形式，如 democracy）→ **mobocracy**（暴民政治）；**mobocratic** 表示“与 mobocracy 有关的”。“mobocratical”像是在 mobocratic 后又加了 -al，属于不太标准的变体。","语气与使用：这个词往往带强烈批评意味，用来指“被人群情绪裹挟、绕开制度程序”的做法；写作时注意避免把合法的集会或抗议一概贴上贬义标签。"]}
{"word":"mobocrats","summary":{"en":"Mobocrats = people who support mob rule; a strongly negative term.","zh":"mobocrats 指“支持暴民统治的人”，通常是强烈贬义用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who support or favor “mob rule” (government or control by an angry crowd rather than by lawful, orderly processes).","zh":"支持“暴民统治/乌合之众统治”的人（由愤怒的人群以威胁、暴力或舆论压力主导，而不是通过合法、有序的程序来治理）。"},"examples":[{"en":"The speaker warned that giving in to threats would encourage mobocrats.","zh":"演讲者警告说，向威胁屈服会助长那些支持暴民统治的人。"},{"en":"In the editorial, the protesters were unfairly dismissed as mobocrats.","zh":"在那篇社论里，抗议者被不公平地打成“暴民统治的拥护者”。"}]}],"synonyms":["supporters of mob rule","ochlocrats","mob-rule advocates"],"phonetic":"/ˈmɑbəˌkræt/","extraExplanation":["“mobocrats”是复数形式，单数是“mobocrat”。它来自“mobocracy”（暴民统治、乌合之众统治）这个词，语气通常是贬义，用来指责某些人不尊重法治与程序、倾向用人群压力或骚乱来达成政治目的。","注意不要把它误读成“Democrats（民主党人）”。两者拼写相似，但“mobocrat”指“支持暴民统治的人”，而不是任何正式政党成员。"]}
{"word":"mobolatry","summary":{"en":"Mobolatry means treating the crowd (the masses) as something to worship or follow blindly, often as a criticism of “follow-the-crowd” thinking.","zh":"mobolatry 指把大众/乌合之众当成值得崇拜并盲目追随的对象，常用来批评“随大流”的思维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the worship, excessive admiration, or blind following of “the mob” (the crowd or masses), especially when people treat popular opinion as always right","zh":"对“乌合之众/大众”的崇拜、过度敬仰或盲目追随，尤指把“多数人的声音”当成永远正确"},"examples":[{"en":"The columnist warned that politics can slide into mobolatry, where shouting crowds replace careful debate.","zh":"这位专栏作家警告说，政治可能滑向“民众崇拜”，喧嚣的群众会取代谨慎的辩论。"},{"en":"Online mobolatry can pressure people to agree with the loudest group, even when facts are unclear.","zh":"网络上的“群体崇拜”会逼迫人们附和最吵的那一群，即使事实并不清楚。"}]}],"synonyms":["worship of the masses","crowd-worship","populist idolization (context-dependent)"],"phonetic":"ˌmoʊbəˈlætri","extraExplanation":["“mobolatry”由 mob（乌合之众/大众）+ -latry（“崇拜、祭拜”，同源于 idolatry“偶像崇拜”）构成，整体带明显贬义，常用于批评“跟风”“多数暴政/暴民政治”的心态。","它通常不指一般的“受欢迎”，而是指把“人多/声大/趋势”当作道德或真理依据。可联想：mob rule（暴民统治）、mobocracy（暴民政治）、tyranny of the majority（多数人的暴政）。"]}
{"word":"mobproof","summary":{"en":"“Mobproof” means designed to resist attack or forced entry by a mob (a violent crowd).","zh":"“mobproof”指“防暴的”，即能抵御暴民/骚乱人群冲击、破坏或闯入的设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to damage, attack, or entry by a crowd (a mob); riot-proof.","zh":"能抵御暴民/人群（骚乱人群）的破坏、攻击或闯入的；防暴的。"},"examples":[{"en":"The storefront installed mobproof shutters after the riot.","zh":"那家店在骚乱后安装了防暴卷帘门。"},{"en":"They designed the gate to be mobproof, with reinforced steel and tamper-resistant locks.","zh":"他们把大门设计成防暴的，用了加固钢材和防撬锁。"}]}],"synonyms":["riot-proof","vandal-proof","attack-resistant","crowd-resistant"],"phonetic":"/ˈmɑbˌpruf/","extraExplanation":["“mobproof”比较少见，多用于描述建筑、门窗、车辆、围栏等在骚乱或暴力人群冲击下仍能保持安全的设计。","构词上是 mob（暴民/乌合之众）+ -proof（“防……的/不受……影响的”），和更常见的 riot-proof、vandal-proof、bombproof 属于同一类表达。","在日常英语里更常用 riot-proof（防暴）或 crowd-control measures（人群控制措施）；“mobproof”有时会显得偏新闻/描述性用语。"]}
{"word":"mobs","summary":{"en":"“Mobs” most commonly means large crowds (often emotional or out of control). It can also be a verb meaning to surround someone in a pushy crowd.","zh":"“mobs”常指（情绪激动、可能失控的）一大群人；也可作动词，表示人群蜂拥围住某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, often angry or excited crowd (plural of “mob”)","zh":"一大群人（常带有愤怒或激动情绪的“暴民/乌合之众”；“mob”的复数）"},"examples":[{"en":"Police tried to control the mobs outside the stadium.","zh":"警察试图控制体育场外的人群。"},{"en":"Mobs gathered after the controversial decision.","zh":"在那项有争议的决定之后，人群聚集了起来。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a crowd) to surround someone and move toward them in a pushy, uncontrolled way, often to get attention, photos, or autographs","zh":"（人群）围住并蜂拥向某人（常为追星、拍照、要签名等），场面混乱"},"examples":[{"en":"Fans mobbed the singer when she left the hotel.","zh":"歌手离开酒店时，粉丝一拥而上把她围住了。"},{"en":"Reporters mobbed the politician with questions.","zh":"记者们围住那位政治人物，连珠炮似地提问。"}]},{"partOfSpeech":"n.","definition":{"en":"criminal gangs or organized groups (informal plural use, depending on context)","zh":"犯罪团伙/黑帮（口语用法，视语境而定）"},"examples":[{"en":"The city has struggled with rival mobs for years.","zh":"这座城市多年来一直受对立黑帮势力困扰。"}]}],"synonyms":["crowds","hordes","throngs","masses","gangs (context-dependent)","swarm (as a verb/metaphor)"],"phonetic":"/mɑbz/","extraExplanation":["“mob”既可以指一般的“大群人”，也常带有“失控、情绪化、可能有危险”的含义；因此在新闻语境里，mobs 往往比 crowds 更负面。","网络语境中常说 online mobs（网暴人群/网络围攻），表示很多人同时在网上攻击、指责某个人或某个群体。","“flash mob（快闪）”是相对中性的固定搭配，指人们事先约好在公共场合短暂聚集做表演或活动，然后迅速散去。"]}
{"word":"mobship","summary":{"en":"“Mobship” is a rare, nonstandard noun meaning the state of acting like a mob (crowd mentality).","zh":"“mobship”是个罕见、非标准名词，指像暴民一样行动的状态（群体心态/跟风失控）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) the state or condition of being part of a mob; mob-like behavior or crowd mentality.","zh":"（罕见、非标准用法）处于“暴民/乌合之众”的状态；暴民式行为或群体心态。"},"examples":[{"en":"Online arguments can quickly turn into mobship when people pile on without checking facts.","zh":"网络争论很容易在大家不核实事实就跟风围攻时变成“mobship”（群体失控/围攻心态）。"},{"en":"The article warns that mobship can drown out individual judgment.","zh":"这篇文章警告说，“mobship”会淹没个人判断。"}]}],"synonyms":["mob mentality","crowd mentality","groupthink","collective frenzy","pack mentality"],"phonetic":"/ˈmɑbʃɪp/","extraExplanation":["“mobship”并不是常见词，很多主流词典里找不到；更像是把 mob（暴民、乌合之众）+ 后缀 -ship（表示“状态/性质/身份”，如 friendship, leadership）临时组合出来的词，用来强调“群体失控、跟风围攻”的状态。","如果你是在别处看到的拼写，可能也想确认是不是打错字：常见的相近词有 **mobcap**（一种女帽）或 **mothership**（母舰/母体）。你可以把句子发我，我能帮你判断最合适的词。"]}
{"word":"mobsman","summary":{"en":"Mobsman means a member of a mob; in older British usage it can mean a well-dressed thief (a “swell-mobsman”).","zh":"mobsman 指“暴民的一员”；在较旧的英式用法中也可指“衣着体面、装作绅士的扒手/骗子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of a mob (a violent or disorderly crowd, or a group acting together, often illegally).","zh":"暴民的一员；乌合之众中的一员（常指一起行动、可能带有违法或暴力性质的人群）。"},"examples":[{"en":"Police tried to separate the mobsmen before the fight spread.","zh":"警方试图把暴民分开，以免斗殴蔓延。"},{"en":"Several mobsmen were arrested after the riot.","zh":"骚乱后，多名暴民被逮捕。"}]},{"partOfSpeech":"n.","definition":{"en":"(British, old-fashioned) A “swell-mobsman”: a well-dressed thief or swindler who pretends to be a gentleman.","zh":"（英式，旧用）“swell-mobsman”：衣着体面、装作绅士的扒手或骗子。"},"examples":[{"en":"In the Victorian story, a mobsman blended in with wealthy shoppers.","zh":"在那篇维多利亚时代的故事里，一个“体面扒手”混在富人购物人群中。"}]}],"synonyms":["mob member","rioter","thug","pickpocket (older British sense)"],"phonetic":"/ˈmɑbz.mən/","extraExplanation":["这个词在现代英语里比较少见，多见于较老的英式文本或词典释义。日常口语里更常用 mob member（暴民/团伙成员）或更具体的词。","注意不要和 mobster 混淆：mobster 通常指“有组织犯罪（黑帮、黑手党）成员”，而 mobsman 更偏“暴民/乌合之众的一员”，或旧时英式语境里的“体面扒手”。"]}
{"word":"mobsmen","summary":{"en":"**Mobsmen** is the plural of **mobsman**: usually “members of a mob,” and in older British usage, “respectably dressed criminals (often pickpockets).”","zh":"**mobsmen** 是 **mobsman** 的复数：常指“暴民的一员”；在较旧的英式用法中，也可指“打扮体面以便作案的罪犯（常为扒手）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of **mobsman**) a member of a mob; someone who belongs to a disorderly or lawbreaking crowd.","zh":"（**mobsman** 的复数）暴民/乌合之众的一员；属于闹事或违法群体的人。"},"examples":[{"en":"Police formed a line to keep the mobsmen from breaking into the building.","zh":"警方排成人墙，防止那群暴民成员闯入大楼。"},{"en":"The report described several mobsmen throwing bottles at the windows.","zh":"报告称有几名暴民成员朝窗户扔瓶子。"}]},{"partOfSpeech":"n.","definition":{"en":"(British, old-fashioned) criminals—especially pickpockets—who dress and act respectably for professional purposes (similar to **swell-mobsmen**).","zh":"（英式、旧用法）为“行当”需要而穿着体面、举止像正派人的罪犯（尤指扒手），类似 **swell-mobsmen**。"},"examples":[{"en":"In the novel, the gangs include swell mobsmen who steal without looking suspicious.","zh":"小说里，那些帮派里有些“体面扒手”，偷东西时看起来一点也不惹人怀疑。"},{"en":"Old crime stories sometimes mention mobsmen working in groups on busy streets.","zh":"旧式犯罪故事里有时会提到成群结队在繁忙街道活动的“扒手同伙”。"}]}],"synonyms":["members of a mob","rioters","mobsters (related, but not the same)","pickpockets (in the older British sense)"],"phonetic":"/ˈmɑbz.mən/","extraExplanation":["“mobsmen”很少见，更多时候你会看到单数 **mobsman**（复数变为 -men）。","现代英语里如果想表达“黑帮成员/有组织犯罪分子”，更常用 **mobster**；而“mobsman/mobsmen”要么泛指“暴民的一员”，要么是英式旧词，指打扮体面以便行窃的罪犯。","注意有些地方（如乐队名 The Mobsmen）会把它当作专有名词使用，这不一定等同于词典义。"]}
{"word":"mobster","summary":{"en":"A mobster is a gangster—someone involved in organized crime; it can also describe a “gangster-like” style.","zh":"mobster 指黑帮成员、与有组织犯罪有关的人；也可作形容词表示“黑帮式的/黑帮风格的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of an organized crime gang (often connected with the Mafia) who takes part in illegal activities such as extortion, gambling, or smuggling.","zh":"（有组织犯罪团伙的）匪徒、黑帮成员（常与黑手党有关），从事敲诈、赌博、走私等非法活动。"},"examples":[{"en":"The movie is about a mobster who tries to leave crime behind.","zh":"这部电影讲的是一个黑帮成员想金盆洗手、远离犯罪。"},{"en":"Police arrested a mobster for running an illegal gambling ring.","zh":"警方逮捕了一名黑帮成员，罪名是经营非法赌博团伙。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or characteristic of organized crime gangsters.","zh":"与黑帮/有组织犯罪相关的；具有黑帮匪徒特征的。"},"examples":[{"en":"He wore a mobster-style suit and hat for the party.","zh":"他在派对上穿了黑帮风格的西装和帽子。"},{"en":"The novel has a mobster atmosphere—dark deals and secret meetings.","zh":"这部小说有一种黑帮氛围——黑暗交易和秘密会面。"}]}],"synonyms":["gangster","mafioso","hoodlum","goon"],"phonetic":"/ˈmɑbstɚ/","extraExplanation":["“mobster”来自“mob”（乌合之众、暴民；后来也可指黑帮）+ “-ster”（表示从事某种活动的人）。在美式语境中，它常让人联想到20世纪的禁酒令时期、意大利裔美国黑手党，以及相关影视作品（如《教父》这类黑帮题材）。","语气提示：在新闻或严肃语境里更常用“gangster”“organized crime figure/suspect”；“mobster”带有较强的流行文化色彩，常见于电影、小说或口语描述。"]}
{"word":"mobsters","summary":{"en":"Mobsters are members of organized crime groups (the mob).","zh":"Mobsters 指有组织犯罪集团（黑手党/黑帮）成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of a mob (an organized crime group), especially someone involved in illegal activities such as extortion, gambling, trafficking, or violence.","zh":"黑帮成员；（尤指）有组织犯罪集团的成员，常从事敲诈、非法赌博、走私/贩运或暴力等犯罪活动。"},"examples":[{"en":"The movie tells the story of mobsters fighting for control of the city.","zh":"这部电影讲的是黑帮成员为争夺城市控制权而斗争的故事。"},{"en":"Police arrested several mobsters after a long investigation.","zh":"经过长期调查，警方逮捕了几名黑帮成员。"}]}],"synonyms":["gangsters","organized criminals","mafiosi"],"phonetic":"ˈmɑbstər","extraExplanation":["“mobster”多见于美国英语，常让人联想到20世纪早期到中期的美国有组织犯罪（例如禁酒令时期的地下酒类交易）。在影视与新闻语境里，它既可指真实的犯罪分子，也常被用作“黑帮片”的类型化称呼。","语气上，“mobster”通常比更中性的“criminal（罪犯）”更具体，强调“团伙/组织性”；也往往比“gangster（匪徒/黑帮分子）”更让人联想到“有组织犯罪（organized crime）”而不只是街头帮派。"]}
{"word":"mobula","summary":{"en":"Mobula is a noun meaning a large ocean ray related to manta rays; it can also refer to the genus *Mobula* (devil rays).","zh":"mobula 是名词，指与蝠鲼相近的一类大型海洋鳐鱼；也可指其属名“魔鬼鳐属（*Mobula*）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of large ocean ray (a kind of fish) related to manta rays; also used for the genus name *Mobula* (devil rays).","zh":"一种大型海洋鳐鱼（鱼类），与蝠鲼/魔鬼鱼同类；也可指其属名 *Mobula*（魔鬼鳐属）。"},"examples":[{"en":"We spotted a mobula ray gliding near the surface.","zh":"我们看到一条魔鬼鳐在水面附近滑翔。"},{"en":"Mobulas sometimes leap out of the water, which looks like they are flying.","zh":"魔鬼鳐有时会跃出水面，看起来像在“飞”。"},{"en":"The documentary compared manta rays and mobulas.","zh":"纪录片对比了蝠鲼和魔鬼鳐。"}]}],"synonyms":["devil ray","mobula ray","flying ray"],"phonetic":"/moʊˈbjuːlə/","extraExplanation":["“Mobula”是魔鬼鳐属（devil rays）的拉丁学名，日常英语里常把“a mobula”当作“魔鬼鳐/蝠鲼近亲的一种鳐鱼”来用；更具体地说时，你也会看到“mobula ray（魔鬼鳐）”。","它们和manta ray（蝠鲼）外形相近：都有宽大的“翼状胸鳍”。区别在于分类与一些体型特征；很多科普内容会把它们放在同一类群里一起介绍。"]}
{"word":"mobulidae","summary":{"en":"Mobulidae is the biological family that includes manta rays and devil rays.","zh":"Mobulidae 指包含蝠鲼与魔鬼鱼/蝠鳐等的大型鳐鱼“科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of large rays (cartilaginous fish) that includes manta rays and devil rays, known for wing-like pectoral fins and filter-feeding on plankton.","zh":"一种大型鳐鱼（软骨鱼）的科，包含蝠鲼（manta rays）与魔鬼鱼/蝠鳐（devil rays），以“翅膀状”的胸鳍和滤食浮游生物而闻名。"},"examples":[{"en":"Mobulidae includes manta rays, which are famous for their graceful swimming.","zh":"Mobulidae（蝠鲼科）包含蝠鲼，它们以优雅的游动姿态而闻名。"},{"en":"Some Mobulidae species migrate long distances to follow plankton-rich waters.","zh":"一些蝠鲼科物种会长距离迁徙，以追随浮游生物丰富的海域。"},{"en":"Researchers study Mobulidae to understand ocean ecosystems and conservation needs.","zh":"研究人员研究蝠鲼科，以了解海洋生态系统与保护需求。"}]}],"synonyms":["manta rays and devil rays (family)","manta ray family (informal)"],"phonetic":"/moʊˈbjuːlədiː/","extraExplanation":["“Mobulidae”是生物分类学里的“科”（family）名称，不是日常口语词。日常表达更常说：manta ray（蝠鲼）或 devil ray（魔鬼鱼/蝠鳐）。","词源上与属名 Mobula 有关（常见译名“蝠鳐属/蝠鲼属”一类），因此拼写里会看到 mobul- 这一词根。","分类在科学研究中可能会随证据更新而调整；如果你在不同资料里看到某些物种被归在不同属/科，通常与最新的分类修订有关。"]}
{"word":"moby","summary":{"en":"“Moby” is usually a proper noun: the musician Moby, or a nickname for *Moby-Dick* (the novel/whale). Very rarely, it can mean “very big.”","zh":"“Moby” 通常是专有名词：指音乐人 Moby，或《白鲸》（小说/白鲸）的简称。极少数情况下可口语表示“非常大”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name used most commonly to refer to the American electronic musician and producer Moby (stage name of Richard Melville Hall).","zh":"专有名词：最常见指美国电子音乐人、制作人 Moby（艺名；本名 Richard Melville Hall）。"},"examples":[{"en":"Moby became widely known for the album *Play*.","zh":"Moby 因专辑《Play》而广为人知。"},{"en":"I heard a Moby track in a coffee shop and recognized his style right away.","zh":"我在咖啡店听到一首 Moby 的歌，一下就认出他的风格。"}]},{"partOfSpeech":"other","definition":{"en":"a common nickname for *Moby-Dick*, Herman Melville’s famous novel, or for the great white whale in the story.","zh":"常用昵称：指赫尔曼·麦尔维尔（Herman Melville）的名著《白鲸》（*Moby-Dick*），或故事中的那条大白鲸。"},"examples":[{"en":"I’m finally reading *Moby-Dick*—people just call it “Moby” sometimes.","zh":"我终于开始读《白鲸》了——有时人们会直接叫它 “Moby”。"},{"en":"The film keeps the focus on Moby, the whale, rather than the whole voyage.","zh":"这部电影更聚焦于白鲸 Moby，而不是整段航程。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, rare) describing something as very big; used like “huge” in casual speech in some contexts.","zh":"（非正式、较少见）形容非常大；在某些口语语境里类似 “huge（巨大）”。"},"examples":[{"en":"That truck is moby—there’s no way it fits in this parking space.","zh":"那辆卡车大得离谱——根本不可能停进这个车位。"}]}],"synonyms":["Moby-Dick","the white whale","huge","massive","giant"],"phonetic":"/ˈmoʊbi/","extraExplanation":["“Moby” 作为《白鲸》的简称，来自书名 *Moby-Dick*。在英语里，人们常把经典作品用一个更短的昵称来称呼（类似把 *The Great Gatsby* 叫 “Gatsby”）。","音乐人 Moby 的艺名据说与作家 Herman Melville 有亲缘关系的说法有关；因此他选择了与《白鲸》相关的名字，带有文化联想。","如果你在句子里看到 “Moby” 且首字母大写，通常是专有名词（人名/作品名）。若不大写并用来修饰名词（如 “moby truck”），才可能是在用那个较少见的“很大”的意思。"]}
{"word":"mobywords","summary":{"en":"Moby Words is the name of a well-known public-domain word-list resource from the Moby Project, widely used in language and software tools.","zh":"Moby Words 是 Moby Project（莫比项目）中的公有领域大型英语词表资源名，常用于语言与软件工具。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a large public-domain English word list (and related word-list files) from the Moby Project, often used in spelling checkers, word games, NLP, and other language tools.","zh":"“Moby Words”（莫比词表）：Moby Project（莫比项目）中的大型英语词表/词库（含多种词表文件），属公有领域资源，常用于拼写检查、文字游戏、自然语言处理等语言工具。"},"examples":[{"en":"For the prototype spell-checker, the developer loaded the Moby Words list as a basic dictionary.","zh":"为了做拼写检查原型，开发者把 Moby Words 词表当作基础词典导入。"},{"en":"The crossword generator filters candidate answers using Moby Words and a smaller common-words list.","zh":"这个填字游戏生成器会用 Moby Words 和一个更小的常用词表来筛选候选答案。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal, by extension) a dataset or file package of word lists labeled “moby words” in software projects.","zh":"（非正式引申）在软件项目中被标注为“moby words”的词表数据集或文件包。"},"examples":[{"en":"I found a file named mobywords.txt in the repo, and it’s used to validate usernames.","zh":"我在仓库里发现一个 mobywords.txt 文件，它被用来校验用户名。"},{"en":"If you need more coverage, swap in a bigger mobywords list.","zh":"如果你需要更高的覆盖率，可以换用更大的 mobywords 词表。"}]}],"synonyms":["word list","wordlist","dictionary file","lexicon","vocabulary list"],"phonetic":"/ˈmoʊbi wɝːdz/","extraExplanation":["“Moby Words”通常指 Grady Ward 编纂的 Moby Project 词汇资源中的词表集合之一（常见镜像在 Project Gutenberg 等站点）。它不只是“一个单词的意思”，更像是“一个词库/语料资源”的名称。","学习者容易把它当作普通英语词汇来查发音/词义；但在真实语境里，它多出现在编程、数据处理、文字游戏等场景，表示“用某个权威/大型词表来做匹配、过滤或生成”。"]}
