{"word":"moc","summary":{"en":"“MOC” is an abbreviation most commonly meaning “Member of Congress,” and in technical workplaces it can mean “Management of Change.” It can also informally mean a moccasin-style shoe (“moc”).","zh":"“MOC”是缩写，最常见指“国会议员（Member of Congress）”；在技术/工厂语境中也常指“变更管理（Management of Change）”。非正式用法里也可指莫卡辛式鞋（moc）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Member of Congress (a person elected to the U.S. Senate or House of Representatives).","zh":"（缩写）国会议员（美国参议院或众议院的民选议员）。"},"examples":[{"en":"Constituents wrote to their MOC about the new bill.","zh":"选民就这项新法案写信给他们的国会议员。"},{"en":"The advocacy group met with several MOCs on Capitol Hill.","zh":"该倡议团体在国会山与多位国会议员会面。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., workplace/engineering) Management of Change: a formal process for reviewing and approving changes to equipment, procedures, or systems to reduce risk.","zh":"（缩写，职场/工程）变更管理（MOC）：对设备、流程或系统的变更进行评审与批准的正式流程，用于降低风险。"},"examples":[{"en":"Before replacing the chemical pump, we have to complete the MOC paperwork.","zh":"更换化学泵之前，我们必须完成变更管理（MOC）文件。"},{"en":"The incident review found the change was made without an MOC.","zh":"事故复盘发现，这项变更在没有进行MOC的情况下就实施了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A moc: a moccasin-style shoe; often used in phrases like “moc toe” (a boot with a stitched toe).","zh":"（非正式）moc：莫卡辛式鞋（软底便鞋）；常见于“moc toe”（缝线鞋头的靴子）。"},"examples":[{"en":"He wore leather mocs around the house.","zh":"他在家里穿着皮质莫卡辛鞋。"},{"en":"These work boots have a moc toe design.","zh":"这双工靴是moc toe（缝线鞋头）设计。"}]}],"synonyms":["Member of Congress","congressperson","Management of Change","moccasin"],"phonetic":"/ˌɛm oʊ ˈsiː/","extraExplanation":["“MOC”是首字母缩略词，具体含义高度依赖语境：\n- 在美国政治新闻/社运语境里，最常见是“Member of Congress”。\n- 在工厂安全、化工、工程管理语境里，“Management of Change”也非常常见。\n看到句子里有“Capitol Hill, constituents, bill”等词，多半指国会议员；有“process, safety, equipment, procedure”等词，多半指变更管理。"]}
{"word":"moca","summary":{"en":"MoCA most commonly refers to a Museum of Contemporary Art, or (in healthcare) the Montreal Cognitive Assessment test.","zh":"MoCA 最常指“当代艺术博物馆”的缩写；在医疗语境中也可指“蒙特利尔认知评估”量表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually written **MoCA**) an abbreviation for **Museum of Contemporary Art**; used in the names of contemporary art museums (for example, “MOCA Los Angeles”).","zh":"（通常写作 **MoCA**）**当代艺术博物馆**（Museum of Contemporary Art）的缩写；常用于各地当代艺术博物馆的名称中（如“洛杉矶当代艺术博物馆 MOCA”）。"},"examples":[{"en":"We spent the afternoon at MOCA looking at contemporary installations.","zh":"我们在 MOCA 逛了一下午，看当代装置艺术。"},{"en":"MOCA is hosting a new exhibition this weekend.","zh":"MOCA 这周末将举办一个新展览。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine; usually written **MoCA**) **Montreal Cognitive Assessment**, a short test used by clinicians to screen for possible cognitive impairment (for example, memory and attention problems).","zh":"（医学；通常写作 **MoCA**）**蒙特利尔认知评估**（Montreal Cognitive Assessment），临床上常用的简短测验，用来筛查可能的认知功能受损（如记忆力、注意力问题）。"},"examples":[{"en":"The doctor asked him to take the MoCA during the appointment.","zh":"医生在就诊时让他做了 MoCA 测验。"},{"en":"Her MoCA score suggested she needed further evaluation.","zh":"她的 MoCA 分数提示需要进一步评估。"}]}],"synonyms":["Museum of Contemporary Art","Montreal Cognitive Assessment","cognitive screening test"],"phonetic":"ˈmoʊkə","extraExplanation":["“MoCA”常见于两类语境：艺术圈（当代艺术博物馆的名称）和医疗/心理评估（认知筛查量表）。看到句子里是否在谈“展览/美术馆”，还是在谈“分数/医生/评估”，通常就能判断是哪一种。","注意大小写：表示缩写时多写作 MoCA / MOCA；如果你本来想问的是饮料“mocha（摩卡）”，拼写是 **mocha**。"]}
{"word":"moccasin","summary":{"en":"Moccasin most commonly means a soft leather shoe with Native American origins; it can also mean a venomous snake, especially the water moccasin (cottonmouth).","zh":"moccasin 最常指源自北美原住民传统的柔软皮鞋；也可指毒蛇，尤指水莫卡辛蛇（棉口蝮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft shoe, traditionally made of leather, originally worn by many Native American peoples","zh":"莫卡辛鞋；一种柔软的鞋（多为皮革制），最初由许多北美原住民民族穿着"},"examples":[{"en":"He bought a pair of moccasins for a comfortable indoor shoe.","zh":"他买了一双莫卡辛鞋，当作舒适的室内鞋。"},{"en":"The museum displayed moccasins decorated with beadwork.","zh":"博物馆展出了用珠饰装饰的莫卡辛鞋。"}]},{"partOfSpeech":"n.","definition":{"en":"a venomous North American pit viper (often called a “cottonmouth” in the water), such as the water moccasin","zh":"（北美）毒蛇之一，响尾蛇科的蝮蛇类；如“水莫卡辛蛇”（常被称为棉口蝮/棉口蛇）"},"examples":[{"en":"Be careful near the marsh—water moccasins may be present.","zh":"在沼泽附近要小心——可能有水莫卡辛蛇出没。"},{"en":"The guide pointed out the difference between a harmless snake and a moccasin.","zh":"向导讲解了无毒蛇与莫卡辛蛇的区别。"}]}],"synonyms":["slipper","loafer","water moccasin","cottonmouth"],"phonetic":"/ˈmɑkəˌsɪn/","extraExplanation":["“moccasin（莫卡辛鞋）”一词来自北美原住民语言（常被认为经由阿尔冈昆语族传入英语）。在当代使用时，谈到传统工艺或文化展品应保持尊重，避免把它仅当作“异域风格”来消费或刻板化。","在美国英语里，说蛇时更常见的固定搭配是“water moccasin”（水莫卡辛蛇），也常称“cottonmouth”。单独说“moccasin”指鞋更常见。"]}
{"word":"moccasins","summary":{"en":"Moccasins are soft, flexible shoes; the word can also specifically refer to traditional Indigenous North American footwear.","zh":"moccasins 指柔软贴脚的休闲鞋；也可特指北美原住民的传统鞋履。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft shoe, often made of leather (or suede), that fits closely around the foot and usually has a flexible sole","zh":"（常指）软底皮鞋／鹿皮鞋；一种贴合脚型、通常鞋底柔软的鞋"},"examples":[{"en":"He wore moccasins around the house because they were comfortable and quiet.","zh":"他在家里穿莫卡辛鞋，因为很舒服，而且走路很安静。"},{"en":"Many brands sell moccasins as casual slip-on shoes.","zh":"很多品牌把莫卡辛鞋当作休闲一脚蹬鞋来卖。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional style of footwear associated with many Indigenous peoples of North America, originally made for practical outdoor use","zh":"（历史与文化语境）北美许多原住民民族的传统鞋款（最初用于户外实用穿着）"},"examples":[{"en":"In the museum, we saw beadwork moccasins made by Indigenous artists.","zh":"在博物馆里，我们看到了原住民艺术家制作的串珠莫卡辛鞋。"},{"en":"Different Nations have different moccasin styles, materials, and decoration.","zh":"不同的原住民族群有不同的莫卡辛鞋式样、材料和装饰。"}]}],"synonyms":["loafers (similar casual style)","slippers (similar comfort, not the same shoe type)"],"phonetic":"ˈmɑkəˌsɪnz","extraExplanation":["“moccasin(s)”这个词来自阿尔冈昆语族相关语言的词形，经由早期殖民时期英语进入现代英语。它既可以指“传统原住民鞋履”，也常被现代商业用来指一种“柔软贴脚的休闲鞋款”。在文化语境里，若你在谈博物馆、传统工艺、原住民艺术家作品等场景，用“moccasins”更贴切；若在日常购物或穿搭语境里，也很常见。","用法小提示：英语里常说一双鞋用复数形式（a pair of moccasins），但也可以用单数指一种鞋型（a moccasin style / a moccasin）。","注意不要把“moccasin”只理解成某个单一民族的鞋；不同原住民民族/部族在材料（鹿皮、麋鹿皮等）、鞋帮高度、装饰（串珠、刺绣）等方面差异很大。"]}
{"word":"moccenigo","summary":{"en":"Mocenigo is a Venetian Italian surname, especially famous as the name of a noble family in the Republic of Venice; it can also refer to things named after that family.","zh":"Mocenigo 是威尼斯地区的意大利姓氏，尤以威尼斯共和国时期的贵族家族闻名；也可指以该家族命名的相关事物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Mocenigo (often misspelled as “moccenigo”) is a Venetian Italian surname, best known as the name of a powerful noble family in the former Republic of Venice (many members were elected doge, the chief magistrate).","zh":"Mocenigo（常被误拼为 moccenigo）是一个威尼斯地区的意大利姓氏，最著名的是威尼斯共和国时期的一个显赫贵族家族（家族成员中多人当选为总督 doge）。"},"examples":[{"en":"Palazzo Mocenigo is named after the Mocenigo family.","zh":"帕拉佐·莫切尼戈（Palazzo Mocenigo）因莫切尼戈家族而得名。"},{"en":"In Venetian history, several doges came from the House of Mocenigo.","zh":"在威尼斯历史上，莫切尼戈家族出过多位总督。"}]},{"partOfSpeech":"other","definition":{"en":"By extension, Mocenigo can refer to things named after the family (for example, places, palaces, or historical references connected to Venice).","zh":"引申来说，Mocenigo 也可指以该家族命名的事物（例如与威尼斯相关的地名、宫殿或历史称谓）。"},"examples":[{"en":"We visited a museum section dedicated to the Mocenigo name and Venetian fashion history.","zh":"我们参观了一个与“莫切尼戈”之名及威尼斯服饰史相关的博物馆展区。"}]}],"synonyms":["House of Mocenigo","Mocenigo (family)"],"phonetic":"/ˌmoʊtʃəˈniːɡoʊ/","extraExplanation":["你输入的 “moccenigo” 更可能是在写 **Mocenigo**（常见的标准拼法）。意大利语里双写辅音（如 cc）会改变发音与拼写习惯，但这个姓通常写作 Mocenigo。","Mocenigo 是威尼斯历史里很有代表性的贵族姓氏；如果你是在读欧洲史、威尼斯共和国、或威尼斯建筑/家族谱系资料时看到它，基本上就是指这个家族（或以其命名的建筑与相关事物）。","有时也会看到较古老或地区性的拼法变体（例如与威尼斯方言/旧拼写相关的形式）；如果你愿意，可以把你看到它的句子或出处贴出来，我可以帮你判断具体指的是“姓氏/家族”、还是某个特定地点或人物。"]}
{"word":"mocchen","summary":{"en":"“Mocchen” isn’t a recognized English word; it’s probably a misspelling (often “moccasin” or “mocha”).","zh":"“mocchen” 不是常见或标准英语单词；多半是拼写错误（常见可能是 “moccasin” 或 “mocha”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of another word (commonly “moccasin” or “mocha,” depending on context).","zh":"不是标准英语单词；很可能是其他单词的拼写错误（常见可能是 “moccasin（软皮鞋/莫卡辛鞋）” 或 “mocha（摩卡）”，取决于语境）。"},"examples":[{"en":"I can’t find “mocchen” in an English dictionary—did you mean “moccasin” (a soft leather shoe)?","zh":"我在英语词典里找不到 “mocchen”——你是不是想写 “moccasin”（一种软皮鞋）？"},{"en":"If you meant the coffee flavor, the usual spelling is “mocha,” not “mocchen.”","zh":"如果你想表达咖啡口味，常见拼写是 “mocha”，不是 “mocchen”。"}]}],"phonetic":"/ˈmɑkən/","extraExplanation":["“mocchen” 这个拼写在常见英语语料和词典中基本不存在。要准确判断你想表达的意思，需要你提供一句上下文（例如：它出现在鞋子、咖啡、名字/品牌、游戏/小说设定里？）。","如果你告诉我你看到它的句子或图片来源，我可以帮你：1）判断是否是拼写错误；2）给出正确拼写与发音；3）解释该词在语境中的含义。"]}
{"word":"mocha","summary":{"en":"Mocha most commonly means a coffee drink that combines espresso, milk, and chocolate; it can also refer to Yemeni-origin coffee or a dark brown color.","zh":"Mocha最常指“巧克力+咖啡”的摩卡饮品；也可指与也门摩卡港相关的咖啡（或巧克力般风味），以及“摩卡色”的深棕色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coffee drink made with espresso and milk plus chocolate (such as chocolate syrup, cocoa powder, or melted chocolate); often called a “mocha latte.”","zh":"一种加入巧克力（如巧克力酱、可可粉或融化巧克力）的牛奶咖啡饮品，通常以浓缩咖啡为底；常被称为“摩卡拿铁”。"},"examples":[{"en":"I’ll have a hot mocha with oat milk, please.","zh":"请给我一杯热摩卡，用燕麦奶。"},{"en":"She ordered an iced mocha because she wanted something sweet.","zh":"她点了冰摩卡，因为她想喝点甜的。"},{"en":"This café’s mocha tastes more like cocoa than coffee.","zh":"这家咖啡馆的摩卡喝起来更像可可而不是咖啡。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of coffee bean, traditionally from Mocha (al-Makha) in Yemen, known historically in coffee trade; now often used more broadly for a chocolatey coffee flavor.","zh":"一种咖啡豆/咖啡风味的称呼，历史上与也门的摩卡港（Mocha / al-Makha）有关；如今也常泛指带“巧克力般”风味的咖啡。"},"examples":[{"en":"The bag says “Yemen Mocha,” which is a classic origin in coffee history.","zh":"这袋写着“也门摩卡”，在咖啡史上是很经典的产地。"},{"en":"I like mocha notes in coffee—nutty, cocoa-like, and rich.","zh":"我喜欢咖啡里的摩卡风味——坚果感、像可可一样、很醇厚。"}]},{"partOfSpeech":"adj.","definition":{"en":"A dark brown color, like coffee mixed with chocolate.","zh":"一种深棕色（摩卡色），像咖啡和巧克力混合的颜色。"},"examples":[{"en":"He chose a mocha sweater because it goes with everything.","zh":"他选了件摩卡色毛衣，因为很好搭。"},{"en":"The walls are painted mocha to make the room feel warm.","zh":"墙面刷成摩卡色，让房间显得更温暖。"}]}],"synonyms":["caffè mocha","mocha latte","chocolate coffee","(color) dark brown"],"phonetic":"/ˈmoʊkə/","extraExplanation":["“Mocha”这个词和也门红海沿岸的港口城市（更准确说是港口）al-Makha 有历史联系。早期咖啡贸易中，很多咖啡从这里出口到世界各地，所以“mocha”逐渐成了咖啡的一种代称。后来在饮品里加入巧克力的做法流行，“mocha”在日常英语里最常指“巧克力风味的拿铁/咖啡”。","点单时常见搭配：hot/iced mocha（热/冰摩卡）、mocha latte（摩卡拿铁）、white mocha（白摩卡：用白巧克力）、mocha sauce（摩卡酱/巧克力酱）。不同店的“mocha”甜度差异很大，可以说：“Not too sweet, please.”（别太甜）。"]}
{"word":"mochas","summary":{"en":"“Mochas” usually means more than one mocha: an espresso drink flavored with chocolate and often milk; it can also refer to a mocha-brown color.","zh":"“mochas”通常指多杯摩卡：一种带巧克力风味、常加牛奶的浓缩咖啡饮品；也可指“摩卡棕”的颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coffee drink that mixes espresso with chocolate (often syrup or cocoa) and usually milk; also called a “mocha latte.”","zh":"一种把浓缩咖啡与巧克力（常为糖浆或可可）混合、通常再加入牛奶的咖啡饮品；也常叫“摩卡拿铁”。"},"examples":[{"en":"I’ll have an iced mocha with oat milk, please.","zh":"请给我一杯加燕麦奶的冰摩卡。"},{"en":"She ordered a mocha because she likes a hint of chocolate in her coffee.","zh":"她点了摩卡，因为她喜欢咖啡里带一点巧克力味。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “mocha” (the drink).","zh":"“mocha（摩卡咖啡）”的复数形式。"},"examples":[{"en":"Two mochas, one hot and one iced.","zh":"两杯摩卡，一杯热的，一杯冰的。"}]},{"partOfSpeech":"adj.","definition":{"en":"A rich brown color, similar to coffee mixed with chocolate.","zh":"一种浓郁的棕色，像咖啡与巧克力混合的颜色。"},"examples":[{"en":"The walls are painted mocha, which makes the room feel warm.","zh":"墙刷成摩卡棕，让房间显得很温暖。"}]}],"synonyms":["mocha latte","chocolate coffee","caffè mocha"],"phonetic":"ˈmoʊkə","extraExplanation":["“mocha”这个词和也门的港口城市“Mocha（摩卡）”有关。历史上那里曾是重要的咖啡贸易港口之一，因此“mocha”常与咖啡联系在一起。现代咖啡店里的“mocha”通常指“咖啡 + 巧克力 +（常见）牛奶”的风味组合。","日常点单时：如果你说“a mocha”，在美国咖啡店多半默认是“espresso + chocolate + milk”。想更准确可以说“mocha latte / hot mocha / iced mocha”，并说明牛奶种类（whole / skim / oat / almond 等）和甜度。"]}
{"word":"moche","summary":{"en":"Moche most commonly refers to an ancient civilization on Peru’s north coast, or related Peruvian place names; it can also be a French informal word meaning “ugly/awful.”","zh":"Moche 最常指秘鲁北海岸的古代莫切文明或相关地名；也可能是法语口语，表示“难看/糟糕”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The Moche: an ancient Andean civilization (also called Mochica) that lived on the northern coast of present-day Peru, famous for irrigation systems, monumental temple structures (huacas), and highly realistic ceramics and metalwork.","zh":"莫切文化／莫奇卡文化：秘鲁北部沿海地区的古代安第斯文明，以灌溉系统、宏伟的神庙遗址（huacas）以及写实精美的陶器和金属工艺闻名。"},"examples":[{"en":"The museum has a gallery of Moche pottery with lifelike portrait vessels.","zh":"那家博物馆有一个莫切陶器展厅，里面有非常写实的肖像陶器。"},{"en":"Archaeologists study Moche burials to learn about religion and social hierarchy.","zh":"考古学家通过研究莫切人的墓葬来了解他们的宗教与社会阶层。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name in Peru (e.g., Moche city/district/valley/river near Trujillo), connected historically to the Moche civilization.","zh":"秘鲁的地名（如特鲁希略附近的莫切城／区／河谷／河流），与莫切文明在历史上密切相关。"},"examples":[{"en":"They stayed near Moche, just outside Trujillo, to visit nearby archaeological sites.","zh":"他们住在特鲁希略郊外的莫切附近，方便参观周边的考古遗址。"}]},{"partOfSpeech":"adj.","definition":{"en":"(From French, informal) ugly, awful, or unpleasant; used mainly when quoting or code-switching in French contexts rather than standard English.","zh":"（源自法语，口语）难看、糟糕、令人不快；多见于夹用法语或引用法语的语境中，并非标准英语常用词。"},"examples":[{"en":"In her French caption she wrote, “C’est moche,” meaning the color looked awful.","zh":"她在法语配文里写了“C’est moche”，意思是颜色很难看／很糟。"}]}],"synonyms":["Mochica"],"phonetic":"/ˈmoʊ.tʃeɪ/","extraExplanation":["在英语里，**Moche**最常见是专有名词（文明或地名），通常读作近似“MOH-chay”。如果你是在学法语，**moche**是很常用的口语形容词，意思类似“难看/糟糕/不爽”。","同形词还可能指菲律宾甜点 **moche**（糯米团点心），但在一般英语学习语境下不如“莫切文明/地名”常见。"]}
{"word":"mochel","summary":{"en":"Mochel is most often Jewish-English slang meaning “to forgive” or “to waive (a debt/claim),” usually said as “be mochel.” It can also be a surname.","zh":"Mochel 多见于犹太英语口语，常表示“原谅”或“免掉（债务/追讨）”，常说成“be mochel”。它也可以是一个姓氏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Jewish English; usually in the phrase “be mochel”) to forgive someone; to let go of resentment.","zh":"（犹太英语；常用于短语“be mochel”）原谅某人；放下怨气。"},"examples":[{"en":"I was upset, but I’m mochel—you don’t need to apologize again.","zh":"我当时很不高兴，但我已经原谅你了——你不用再道歉了。"},{"en":"He asked his friend to be mochel after the argument.","zh":"吵完架后，他请求朋友原谅他。"}]},{"partOfSpeech":"v.","definition":{"en":"(Jewish English) to waive or give up a claim—especially to forgive a debt or money owed.","zh":"（犹太英语）放弃追讨；（尤指）免掉欠款、债务。"},"examples":[{"en":"Could you be mochel the $20 I owe you?","zh":"我欠你的那20美元，你能不能就算了（免了）？"},{"en":"She was mochel on the late fee this time.","zh":"这次她把逾期费给免了。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), found in forms like Mochel / Möchel.","zh":"姓氏：Mochel / Möchel 等形式。"},"examples":[{"en":"Mochel is her last name.","zh":"Mochel 是她的姓。"}]}],"synonyms":["forgive","pardon","let it go","waive","remit"],"phonetic":"/ˈmoʊxəl/","extraExplanation":["“mochel / moichel / moychel”等拼写常见于北美的犹太英语（尤其正统派社群）里，来源与希伯来语/意第绪语中表示“宽恕、赦免”的词有关。它在口语里经常以短语“be mochel”出现，语气通常比正式的“forgive”更口语、更带社群文化色彩。"]}
{"word":"mochica","summary":{"en":"Mochica is another name for the Moche civilization/people of ancient Peru, and it can also refer to the Mochica (Muchik) language.","zh":"Mochica 既可指秘鲁古代莫切文明/族群（Moche）的别称，也可指莫奇卡语（Muchik）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"another name for the Moche (an ancient civilization and people on the north coast of Peru)","zh":"莫切（秘鲁北部海岸的古代文明与族群）的别称；亦作 Mochica"},"examples":[{"en":"Many museum labels use “Moche,” but you may also see the name “Mochica.”","zh":"许多博物馆标签用 “Moche（莫切）”，但你也可能会看到 “Mochica（莫奇卡）”。"},{"en":"Mochica ceramics are famous for realistic portrait vessels.","zh":"莫奇卡（莫切）陶器以写实的人像器闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mochica language (also called Muchik), an extinct Indigenous language once spoken on Peru’s northern coast","zh":"莫奇卡语（亦称 Muchik），曾在秘鲁北部海岸使用、现已消亡的原住民语言"},"examples":[{"en":"Researchers study Mochica to better understand the region’s pre-Columbian history.","zh":"研究者会研究莫奇卡语，以更好理解该地区的前哥伦布时期历史。"},{"en":"Some sources use “Muchik” instead of “Mochica” when talking about the language.","zh":"有些资料谈到这种语言时会用 “Muchik”，而不是 “Mochica”。"}]}],"synonyms":["Moche","Muchik","Muchic","Yunga (in some historical sources for the language)"],"phonetic":"/moʊˈtʃiːkə/","extraExplanation":["“Mochica”在英文资料里常见于考古与历史语境：既可以指莫切文明/人群（Moche，也叫 Mochica），也可以专指他们相关的语言（Mochica / Muchik）。读到时可看上下文：如果谈陶器、金工、遗址，多半是文明；如果谈语法、词汇、语系，多半是语言名称。","拼写上：Moche（更常见）与 Mochica（较传统/另一种叫法）常被交替使用；语言名称也常写作 Muchik。"]}
{"word":"mochila","summary":{"en":"Mochila means “backpack,” often a school bag or daypack in Spanish-speaking contexts.","zh":"Mochila 的意思是“背包/双肩包”，也常指“书包”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a backpack; a bag carried on your back with shoulder straps","zh":"背包；双肩包（背在背上的包，通常有两条肩带）"},"examples":[{"en":"I carry my laptop in my mochila every day.","zh":"我每天都把笔记本电脑放在我的 mochila（背包）里。"},{"en":"Don’t forget your mochila for the hike.","zh":"去徒步别忘了带你的 mochila（背包）。"}]},{"partOfSpeech":"n.","definition":{"en":"a school bag/backpack used by students (common in Spanish-speaking countries)","zh":"书包；学生用的背包（在西语国家很常见的说法）"},"examples":[{"en":"The kids left their mochilas in the classroom.","zh":"孩子们把书包（mochilas）留在教室里了。"}]}],"synonyms":["backpack","schoolbag","rucksack","knapsack"],"phonetic":"/moʊˈtʃiːlə/","extraExplanation":["“mochila”是西班牙语常用词，西语地区一般就用它来指“背包/书包”。英语里更常见的对应词是 backpack（美式）或 rucksack（更偏英式/户外）。","读音在西班牙语里大致是“mo-CHEE-la”（重音在中间），其中“ch”类似英语的“ch”音。"]}
{"word":"mochilas","summary":{"en":"“Mochilas” means “backpacks” (plural of Spanish “mochila”).","zh":"“mochilas”意思是“背包”（西班牙语“mochila”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Backpacks (plural of Spanish “mochila”): bags carried on the back with shoulder straps, often used for school, travel, or hiking.","zh":"背包（西班牙语“mochila”的复数）：带肩带、背在背上的包，常用于上学、旅行或徒步。"},"examples":[{"en":"The students put their books in their mochilas before class.","zh":"学生们上课前把书放进他们的背包里。"},{"en":"We packed our mochilas with water and snacks for the hike.","zh":"我们把水和零食装进背包，准备去徒步。"}]}],"synonyms":["backpacks","rucksacks","schoolbags"],"phonetic":"/moʊˈtʃiːlɑːz/","extraExplanation":["“mochilas”是西班牙语复数形式，单数是“mochila”。很多西班牙语名词用“-s / -es”构成复数。","在英语里也偶尔会借用“mochila”这个词（尤其在旅行、户外或拉美文化语境中），但更常见的说法仍是“backpack”。"]}
{"word":"mochras","summary":{"en":"“mochras” most commonly refers to an astringent plant gum-resin from the silk-cotton tree (Bombax ceiba). It can also be the name of a peninsula in Wales (Shell Island).","zh":"“mochras”最常见的意思是指来自木棉树（Bombax ceiba）的收敛性树胶/胶脂；它也可以是威尔士一处半岛（Shell Island/贝壳岛）的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(herbal medicine) An astringent gum-resin (a gummy exudate) obtained from the silk-cotton tree (Bombax ceiba, also known as Bombax malabaricum), traditionally used in South Asia.","zh":"（草药/传统医学）木棉属（吉贝/木棉树，Bombax ceiba，又称 Bombax malabaricum）分泌的收敛性树胶/胶脂（胶状渗出物），在南亚传统用药中使用。"},"examples":[{"en":"In some traditional remedies, mochras is added in small amounts for its astringent effect.","zh":"在一些传统配方里，会少量加入 mochras 来利用它的收敛作用。"},{"en":"The label lists mochras as a plant gum derived from Bombax ceiba.","zh":"标签上写着 mochras，是来源于 Bombax ceiba 的植物树胶。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name: Mochras, a peninsula in Gwynedd, Wales, also known as Shell Island.","zh":"地名：Mochras，位于威尔士（Gwynedd）的一个半岛，也被称为“Shell Island（贝壳岛）”。"},"examples":[{"en":"They camped at Mochras (Shell Island) on the Welsh coast.","zh":"他们在威尔士海岸的 Mochras（贝壳岛）露营。"},{"en":"Mochras is known for its beach and shells.","zh":"Mochras 以海滩和贝壳闻名。"}]}],"synonyms":["gum-resin","plant gum","resin","astringent (substance)","Shell Island (proper name)"],"phonetic":"/ˈmoʊ.krəs/","extraExplanation":["“mochras”在英语里相对少见：在草药/民俗医药语境中多指木棉树（Bombax ceiba）相关的“树胶/胶脂”，常见于一些印度草药或阿育吠陀产品描述；在地理语境中则是威尔士的一个地名（也叫 Shell Island）。","如果你本来想查的是别的词（比如拼写接近的 moochers / mochas / monarchs 等），把原句或上下文发我，我可以帮你精确判断。"]}
{"word":"mochudi","summary":{"en":"Mochudi is mainly a place name: a large village/town in Botswana; it’s also explained as a Setswana term linked to hospitality.","zh":"Mochudi主要是地名：博茨瓦纳的一座较大村镇；同时也常被解释为茨瓦纳语中与“好客款待”相关的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large village/town in southeastern Botswana, about 37 km (23 miles) northeast of the capital, Gaborone","zh":"博茨瓦纳东南部的一个较大的村镇，位于首都哈博罗内东北约37公里"},"examples":[{"en":"She grew up in Mochudi, a village northeast of Gaborone. ([en.wikipedia.org](https://en.wikipedia.org/wiki/Mochudi?utm_source=openai))","zh":"她在莫丘迪长大，那是哈博罗内东北方向的一座村镇。([en.wikipedia.org](https://en.wikipedia.org/wiki/Mochudi?utm_source=openai))"},{"en":"Tourists visit Mochudi for local history and culture, including the Phuthadikobo Museum. ([en.wikipedia.org](https://en.wikipedia.org/wiki/Mochudi?utm_source=openai))","zh":"游客会到莫丘迪体验当地历史与文化，例如参观普图哈迪科博博物馆。([en.wikipedia.org](https://en.wikipedia.org/wiki/Mochudi?utm_source=openai))"}]},{"partOfSpeech":"n.","definition":{"en":"in Setswana, a word associated with hospitality—literally described as “a person who dishes out food from a pot”","zh":"在茨瓦纳语（Setswana）中，与好客相关的词义，直译可理解为“从锅里盛食物给人的人”"},"examples":[{"en":"The name Mochudi is sometimes explained as a Setswana reference to welcoming guests with food. ([universalium.en-academic.com](https://universalium.en-academic.com/279418/Mochudi?utm_source=openai))","zh":"“Mochudi”这个名字有时被解释为茨瓦纳语中“以食物款待来客”的含义。([universalium.en-academic.com](https://universalium.en-academic.com/279418/Mochudi?utm_source=openai))"}]}],"phonetic":"/moʊˈtʃuːdi/","extraExplanation":["“Mochudi”更常见的是专有名词（地名）。如果你是在读小说（例如《The No. 1 Ladies' Detective Agency》系列）或看非洲地理资料时遇到，它通常指博茨瓦纳的那个地方名。([en.wikipedia.org](https://en.wikipedia.org/wiki/Mochudi?utm_source=openai))","在英语语境里，它一般不当作普通名词使用；若要表达“好客/款待”，英语更常用 hospitality、welcome、treat guests 等说法。"]}
{"word":"mochy","summary":{"en":"Mochy (Scottish) means warm and damp/muggy, often misty; less commonly it can mean damp or slightly mouldy.","zh":"Mochy（苏格兰方言）主要指天气湿热、闷热，常带雾；较少见时也可指潮湿或微微发霉的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish, of weather/air) moist, warm, and unpleasantly humid; often misty or muggy.","zh":"（苏格兰方言，形容天气/空气）潮湿而温暖、闷热；常带雾气或湿热感。"},"examples":[{"en":"It’s a mochy morning—warm, damp, and a bit foggy.","zh":"今天早上很 mochy——又暖又潮，还有点起雾。"},{"en":"After the rain, the valley can feel mochy for hours.","zh":"下过雨后，山谷里会潮闷好几个小时。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scottish, less common) damp or slightly mouldy/musty.","zh":"（苏格兰方言，较少见）潮湿的；有点发霉/霉味的。"},"examples":[{"en":"The old cupboard smelled mochy after being closed all winter.","zh":"旧柜子整个冬天都关着，打开后有点 mochy 的霉味。"}]}],"synonyms":["muggy","humid","damp","clammy","misty","musty"],"phonetic":"/ˈmɑki/","extraExplanation":["“mochy”是苏格兰英语里的词，在美国英语里很少见。它通常用来形容又湿又暖、闷闷的天气（有时也可指带点雾气）。","发音里“ch”常接近苏格兰语/德语那种喉音（像英文借词“loch”的ch），很多学习者会用更容易的/k/来近似。","很多人输入“mochy”其实是想写日本点心“mochi（麻糬）”。如果你指的是食物“mochi”，我也可以给你那一条的词义与用法。"]}
{"word":"mock","summary":{"en":"“Mock” most commonly means to ridicule someone, or to imitate something to show it is silly; it can also mean a practice or simulated version of something real.","zh":"“mock”常指嘲笑/讥讽，或用模仿来显得可笑；也可指“模拟的”或“模拟活动/演练”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To tease or make fun of someone in an unkind way; to ridicule.","zh":"（以不友善的方式）嘲笑、戏弄某人；奚落。"},"examples":[{"en":"Some kids mocked him for his accent.","zh":"有些孩子因为他的口音而嘲笑他。"},{"en":"It’s not okay to mock someone’s appearance.","zh":"嘲笑别人的外表是不对的。"}]},{"partOfSpeech":"vt.","definition":{"en":"To imitate something in order to make it seem silly or show disapproval (often by copying the voice, behavior, or style).","zh":"模仿（声音、行为或风格）来显得可笑或表达不赞同。"},"examples":[{"en":"He mocked the teacher’s voice, and the class laughed.","zh":"他模仿老师的声音，全班都笑了。"},{"en":"The comedian mocked the politician’s speaking style.","zh":"那位喜剧演员模仿并讽刺了那名政客的讲话风格。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not real but made to look like the real thing; fake in a useful or humorous way.","zh":"仿制的；模拟的；看起来像真的（常用于实用或搞笑的场合）。"},"examples":[{"en":"They held a mock trial in class to learn how courts work.","zh":"他们在课堂上举行了一场模拟审判来学习法院如何运作。"},{"en":"The company ran a mock interview to help students practice.","zh":"公司组织了模拟面试来帮助学生练习。"}]},{"partOfSpeech":"n.","definition":{"en":"A practice version of a real event, used for training or preparation.","zh":"模拟（演练）活动；用于训练或准备的“预演版”。"},"examples":[{"en":"We did a mock exam before the final test.","zh":"期末考试前我们做了一次模拟考。"},{"en":"The school organized a mock election.","zh":"学校组织了一次模拟选举。"}]}],"synonyms":["ridicule","tease","make fun of","imitate","parody","simulated","practice"],"phonetic":"/mɑk/","extraExplanation":["“mock”既可以表示“嘲笑/讥讽”（动词），也可以表示“模拟的/仿真的”（形容词）或“模拟活动”（名词）。学习时可以用语境来区分：mock someone（嘲笑某人） vs. mock exam/mock trial（模拟考试/模拟审判）。","语气与礼貌：动词 mock 通常带负面评价，接近 insult/tease 的不友善用法；在校园或职场语境中，建议用更中性的表达，如 “joke about” 或 “make a light comment,” 以避免冒犯。"]}
{"word":"mock-up","summary":{"en":"A mock-up is a model or early version made to show or test a design; it can also mean to create such a model.","zh":"mock-up 指用于展示或测试设计的模型/样稿/样机；也可作动词，指制作这种模型或初步版本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a model or full-size replica used to show what something will look like or how it will be arranged (often before the final version is made)","zh":"（用于展示外观或布局的）模型；样机；（设计）样稿/效果稿"},"examples":[{"en":"The designer showed a mock-up of the new app screen before coding began.","zh":"在开始编程之前，设计师先展示了新应用界面的效果稿。"},{"en":"We built a cardboard mock-up of the kitchen to test the layout.","zh":"我们用纸板做了一个厨房的等比例模型来测试布局。"}]},{"partOfSpeech":"v.","definition":{"en":"to create a model or early version of something to test or demonstrate it","zh":"制作模型；做出初步版本（用于测试或演示）"},"examples":[{"en":"Let’s mock up a quick landing page to see how it feels.","zh":"我们先快速做一个落地页原型，看看感觉如何。"},{"en":"The team mocked up the product packaging for a focus group.","zh":"团队为焦点小组制作了产品包装的样稿。"}]}],"synonyms":["model","prototype","demo","layout","draft"],"phonetic":"/ˈmɑkˌʌp/","extraExplanation":["“mock-up”常用于设计、工程、广告与产品开发语境，强调“先做个可视化的版本来沟通和验证”，不一定能正常运作（如只是外观/布局）。如果强调可点击或可运行的早期版本，更常说“prototype（原型）”。","书写上既可写作“mock-up”，也常见“mockup”。口语里有时直接说“a mock”表示“样稿/样机”（多见于设计与印刷行业）。"]}
{"word":"mockable","summary":{"en":"Mockable means “able to be mocked.” Most often in software, it means code can be replaced with a mock for testing; more generally, it can mean “easy to imitate/parody.”","zh":"mockable 意为“可被 mock/模拟的”。在软件领域最常指代码/依赖可用 mock 替换以便测试；更一般也可指“容易被模仿/戏仿的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be replaced with a mock (a fake substitute) in tests, so the code can be tested independently from real services or dependencies.","zh":"（在测试中）可被 mock（模拟对象/假替身）替换的；使代码能脱离真实服务或依赖而独立测试。"},"examples":[{"en":"We redesigned the database layer to be mockable, so unit tests don’t need a real database.","zh":"我们把数据库层重新设计得可 mock，这样单元测试就不需要真实数据库了。"},{"en":"If the HTTP client is mockable, you can simulate slow networks and errors easily.","zh":"如果 HTTP 客户端可 mock，你就能轻松模拟慢网络和各种错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suitable for being imitated or parodied (often said about a style, performance, or person).","zh":"（风格/表演/人物等）容易被模仿或戏仿的；很“好模仿”的。"},"examples":[{"en":"His exaggerated accent is highly mockable, so comedians copy it a lot.","zh":"他夸张的口音很容易被模仿，所以喜剧演员常常学他。"},{"en":"The character’s dramatic pauses are mockable in a funny way.","zh":"这个角色戏剧化的停顿点很适合用来搞笑模仿。"}]}],"synonyms":["testable","mock-friendly","easily imitated","imitable"],"phonetic":"ˈmɑkəbəl","extraExplanation":["在软件工程里，mockable 通常是“为了可测试性而设计”的一种特质：把外部依赖（数据库、网络、时间、随机数、第三方 API）抽象成接口/可注入的组件，这样测试时就能用 mock/stub/fake 替换真实实现。常见搭配：mockable design（可 mock 的设计）、make it mockable（让它可 mock）、dependency injection（依赖注入）。","词形上是 mock + -able（“能够被……的”）。在日常英语里也能用来表示“很容易被人拿来模仿/吐槽”的意思，但在技术语境中更常见的是第一义。"]}
{"word":"mockado","summary":{"en":"Mockado is a historical fabric made to imitate velvet; it can also (old-fashioned) mean something inferior or tawdry.","zh":"Mockado 指一种历史上的仿天鹅绒织物；也可作（旧式用法）“劣质、俗气的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fabric (especially in the 16th–17th centuries) usually made of wool and designed to imitate velvet","zh":"（尤指16–17世纪）一种多用羊毛制作、模仿天鹅绒质感的织物（仿天鹅绒）"},"examples":[{"en":"The museum displayed a doublet made of mockado, a cheaper alternative to velvet.","zh":"博物馆展出了一件用mockado（仿天鹅绒）制成的紧身上衣，它是天鹅绒更便宜的替代品。"},{"en":"The chair was upholstered in mockado to give it a velvet-like look.","zh":"这把椅子用mockado做了软包面料，让它看起来像天鹅绒。"}]},{"partOfSpeech":"n.","definition":{"en":"(obsolete) inferior or showy but low-quality material; trumpery","zh":"（已过时）劣质的东西；华而不实的杂物"},"examples":[{"en":"He dismissed the decorations as mere mockado.","zh":"他把那些装饰品贬为不过是些华而不实的东西。"}]}],"synonyms":["imitation velvet","mock velvet","(obsolete) trumpery","(obsolete) inferior stuff"],"phonetic":"/məˈkɑdoʊ/","extraExplanation":["这个词和“mock（仿造/嘲弄）”长得很像，但在历史上它首先指一种“仿天鹅绒的布料”；后来才引申出“廉价、俗气的东西”这种贬义用法。","注意：现在网上也有叫 Mockado 的产品/网站名称（例如与“mockup/模拟”相关的工具）。如果你是在某个应用或网站里看到的 mockado，它可能是品牌名，而不是这个传统英语词。"]}
{"word":"mockage","summary":{"en":"Mockage means “mockery”—the act of mocking or ridiculing someone or something.","zh":"Mockage 的意思是“嘲弄/嘲笑”，相当于 mockery，指取笑或讥讽某人或某事的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mockery; the act of mocking (making fun of someone or something in a contemptuous way).","zh":"嘲弄；嘲笑（以轻蔑、贬低的方式取笑某人或某事的行为）。"},"examples":[{"en":"His rude comments were pure mockage, not friendly teasing.","zh":"他那些粗鲁的话完全是嘲弄，不是友好的逗趣。"},{"en":"The online mockage quickly turned the mistake into a public embarrassment.","zh":"网络上的嘲弄很快把这个错误变成了公开的尴尬。"},{"en":"She ignored their mockage and kept practicing.","zh":"她无视他们的嘲弄，继续练习。"}]}],"synonyms":["mockery","ridicule","derision","jeering","scoffing"],"phonetic":"/ˈmɑkɪdʒ/","extraExplanation":["“mockage”是由“mock（嘲弄）+ -age（构成名词的后缀）”形成，意思接近“mockery”。","在现代英语里它相对少见，日常写作和口语更常用“mockery”。在较早的英语（如16–17世纪）中它更常见。","语气通常偏负面，表示带轻蔑的取笑；如果是轻松、不伤人的玩笑，更常用“teasing / joking”。"]}
{"word":"mockbird","summary":{"en":"Mockbird is a rare/dialect word meaning a bird that imitates sounds—usually a mockingbird; in some British regional use it can also mean a sedge warbler or blackcap.","zh":"mockbird 是较少见的方言词，指会模仿声音的鸟，通常就是嘲鸫（mockingbird）；在部分英式地区用法中也可指苇莺或黑顶林莺等鸣禽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, rare) A bird that “mocks” (imitates sounds), especially a mockingbird.","zh":"（方言，用法较少）会“模仿/学叫”的鸟，尤指嘲鸫（mockingbird）。"},"examples":[{"en":"In some dialects, people used to call a mockingbird a mockbird.","zh":"在一些方言里，人们过去会把 mockingbird 叫作 mockbird。"},{"en":"We heard a mockbird copying other birds near the yard.","zh":"我们听到院子附近有只“mockbird”在学其他鸟叫。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional, chiefly British) A sedge warbler or a blackcap (small songbirds known for varied songs).","zh":"（地区用法，主要英式）指苇莺（sedge warbler）或黑顶林莺（blackcap）等鸣禽（以多变的鸣唱著称）。"},"examples":[{"en":"Older regional guides sometimes list the sedge warbler as a “mockbird.”","zh":"一些较旧的地方鸟类指南会把苇莺列作“mockbird”。"}]}],"synonyms":["mockingbird","mimic bird","songbird"],"phonetic":"/ˈmɑkˌbɝd/","extraExplanation":["“mockbird”不是现代英语里最常见的标准词，更常用的是“mockingbird”（嘲鸫，北美常见、擅长模仿其他鸟鸣）。","因为它少见，你在阅读文学作品或较旧的资料时遇到“mockbird”，通常可以先按“mockingbird（会模仿的鸟）”理解，再结合上下文判断是否指某种具体鸣禽。"]}
{"word":"mocked","summary":{"en":"“Mocked” usually means “laughed at/ridiculed” (past of mock). It can also relate to something imitated or simulated, though English more often uses “mock” (mock exam) or “mocked up” (made a model).","zh":"“mocked”通常指“被嘲笑/讥讽”（mock 的过去式/过去分词）。也可涉及“模拟/仿制”的含义，但更常见说法是“mock+名词”（如 mock exam）或“mocked up”（做出模型/样机）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mock”: made fun of someone or something in an unkind way; ridiculed.","zh":"“mock”的过去式/过去分词：嘲笑、讥讽某人或某事；奚落。"},"examples":[{"en":"Some classmates mocked his accent, which really hurt him.","zh":"有些同学嘲笑他的口音，这让他很受伤。"},{"en":"She felt mocked when people laughed at her question.","zh":"别人笑她的问题时，她觉得自己被嘲弄了。"},{"en":"The comedian mocked the politician’s promises during the show.","zh":"那位喜剧演员在演出中讽刺了那位政客的承诺。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describes something that has been imitated or created as a model for practice or testing (often used with nouns like “mocked” in context, but more common as “mock” + noun, e.g., “mock exam,” or as “mocked up”).","zh":"形容“仿制的/模拟的/用来演练或测试的”（在语境中可用“mocked”表达，但更常见的是“mock+名词”，如“mock exam”，或用“mocked up”表示“做出模型/样机”）。"},"examples":[{"en":"They practiced with a mocked scenario before the real interview.","zh":"正式面试前，他们用一个模拟情景练习。"},{"en":"The team mocked up a simple prototype to show how the app would work.","zh":"团队做了一个简单的样机来展示应用如何运行。"}]}],"synonyms":["ridiculed","teased","taunted","jeered at","made fun of"],"phonetic":"/mɑkt/","extraExplanation":["“mocked”最常见是动词过去式/过去分词，常用于被动：be mocked (by someone) = “被嘲笑”。语气通常偏负面。","表达“模拟/仿真”时，英语里更地道的是用“mock”作定语（mock exam/mock interview/mock trial），或用短语“mock up”（做模型、做样机）。"]}
{"word":"mocker","summary":{"en":"A mocker is a person who makes fun of others in a rude or hurtful way; it can also mean to mock (to ridicule).","zh":"“mocker”指刻薄地嘲笑别人的人；也可对应动词含义“嘲笑/讥讽”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes fun of someone or something in a cruel or disrespectful way; someone who jeers","zh":"嘲笑者；讥讽者（以刻薄、不尊重的方式取笑别人或事物的人）"},"examples":[{"en":"The bullies were mockers who laughed at his accent.","zh":"那些霸凌者是嘲笑者，拿他的口音取笑。"},{"en":"Ignore the mockers and keep practicing.","zh":"别理那些嘲笑你的人，继续练习。"}]},{"partOfSpeech":"v.","definition":{"en":"to make fun of someone or something, often in a hurtful or insulting way","zh":"嘲笑；讥讽（常带伤人或侮辱意味）"},"examples":[{"en":"Some people mock others to feel superior.","zh":"有些人嘲笑别人，是为了让自己显得更优越。"},{"en":"He mocked her idea instead of listening.","zh":"他没有倾听，反而嘲笑她的想法。"}]}],"synonyms":["ridiculer","teaser","jeerer","scoffer"],"phonetic":"/ˈmɑkɚ/","extraExplanation":["“mocker”来自动词“mock”（嘲笑、讥讽）。语气通常偏负面，强调不尊重或带恶意的取笑。","在一些宗教或文学语境里，“the mockers / scorners（嘲笑者）”常指轻蔑真理或道德劝告的人（例如《圣经》英译中常出现“mockers/scorners”这一类词）。"]}
{"word":"mockeries","summary":{"en":"“Mockeries” means cruel or disrespectful jokes/insults—acts of mocking someone; it’s the plural of “mockery.”","zh":"“mockeries”指“嘲弄/讥笑”的复数形式，强调带羞辱性的取笑或侮辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Acts or words that make fun of someone or something in a cruel or disrespectful way; insults meant to shame or laugh at someone.","zh":"嘲弄、讥笑：用刻薄或不尊重的言语/行为取笑别人，带有羞辱意味的侮辱。"},"examples":[{"en":"He ignored the mockeries from the crowd and kept speaking calmly.","zh":"他无视人群的嘲弄，仍然冷静地继续讲话。"},{"en":"Online mockeries can hurt more than people realize.","zh":"网络上的嘲讽往往比人们意识到的更伤人。"},{"en":"Her success was the best answer to their mockeries.","zh":"她的成功就是对他们嘲弄最好的回应。"}]}],"synonyms":["taunts","jeers","ridicule","derision","jibes"],"phonetic":"/ˈmɑkəriz/","extraExplanation":["“mockeries”是名词“mockery”的复数。语气通常偏负面，强调带羞辱感的取笑；如果只是轻松开玩笑，更常用“teasing/joking”。","常见搭配：face/endure mockeries（面对/忍受嘲弄）、subject someone to mockeries（让某人遭受嘲弄）、mockery of…（对……的嘲讽/亵渎式模仿）。"]}
{"word":"mockernut","summary":{"en":"Mockernut is a noun meaning a North American hickory tree (Carya tomentosa) or the nut it produces.","zh":"mockernut 作名词，指美国东部常见的一种山核桃类树（Carya tomentosa）或它结的坚果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American hickory tree (Carya tomentosa) native to the eastern U.S., known for hard wood and thick-shelled nuts","zh":"（北美）一种山核桃属的胡桃科树木（学名 Carya tomentosa，常见于美国东部），木材坚硬，果实外壳很厚"},"examples":[{"en":"We identified the tall tree as a mockernut by its hickory-type leaves and hard nuts.","zh":"我们通过它典型的山核桃复叶和坚硬的坚果辨认出那是一棵 mockernut（假山核桃）。"},{"en":"Mockernut hickory is common in many forests across the eastern United States.","zh":"在美国东部的许多森林里，mockernut hickory 很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"the thick-shelled nut produced by the mockernut hickory tree","zh":"假山核桃树结的坚果（外壳很厚、较难剥开）"},"examples":[{"en":"Squirrels cracked open mockernuts and carried the kernels away.","zh":"松鼠嗑开 mockernut，把果仁叼走了。"},{"en":"The mockernut is edible, but it can be frustrating to open.","zh":"mockernut 的果仁可以吃，但壳很难打开，挺让人挫败。"}]}],"synonyms":["mockernut hickory","Carya tomentosa","(less common) white hickory","(less common) black hickory"],"phonetic":"/ˈmɑkɚˌnʌt/","extraExplanation":["“mockernut”这个名字常被解释为：壳很厚、很难敲开，但里面的果仁相对不大，让人觉得“白费劲、被戏弄（mock）了”。","在美国语境里，你也会看到更完整的名称 **mockernut hickory**（假山核桃/胡桃科的山核桃类树）。它的木材常被用于需要强度和韧性的用途；在饮食文化中，“hickory”也常与烟熏风味联想在一起，但日常并不常把 mockernut 的果仁当作主要食用坚果。"]}
{"word":"mockers","summary":{"en":"“Mockers” means people who mock—who make fun of others in a mean or disrespectful way.","zh":"“mockers”指“嘲笑者/讥讽者”，以刻薄或不尊重的方式取笑他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who mock (make fun of) someone or something in a rude or unkind way.","zh":"嘲笑者；讥讽别人的人（以不友善的方式取笑某人或某事）。"},"examples":[{"en":"Online mockers spread cruel comments under the video.","zh":"网络嘲笑者在视频下面散布刻薄的评论。"},{"en":"She ignored the mockers and kept speaking confidently.","zh":"她无视那些嘲笑者，继续自信地发言。"},{"en":"The coach told the team not to become mockers when others make mistakes.","zh":"教练告诉队员：别人犯错时不要变成嘲笑者。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A person who imitates something in a way meant to ridicule it.","zh":"（较少见）用模仿来讽刺/嘲弄的人。"},"examples":[{"en":"The comedian played a mocker of celebrity interviews.","zh":"那位喜剧演员用模仿来讽刺名人采访。"}]}],"synonyms":["scoffers","ridiculers","jeerers","teasers (when not mean)","hecklers"],"phonetic":"/ˈmɑkər/","extraExplanation":["“mockers”是“mocker”的复数。常见搭配有：mockers and scoffers（嘲笑者与讥讽者）、ignore the mockers（无视嘲笑者）。","语气提示：mocker通常带强烈负面评价，表示“刻薄地取笑”。如果只是轻松友善的玩笑，更常用tease（开玩笑/逗弄）或joke around（闹着玩）。"]}
{"word":"mockery","summary":{"en":"Mockery means cruel teasing or disrespectful jokes; it can also mean treating something serious as a joke (often in “make a mockery of…”).","zh":"Mockery 指刻薄的嘲弄/挖苦；也可指把严肃的事情当成笑话（常见于 make a mockery of…）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cruel or unkind teasing, jokes, or comments that show disrespect.","zh":"嘲弄；奚落；挖苦（带有侮辱或不尊重的玩笑或言语）"},"examples":[{"en":"He faced mockery at school because of his accent.","zh":"因为口音，他在学校里遭到嘲弄。"},{"en":"Her success was met with mockery by a few jealous coworkers.","zh":"她的成功被几个嫉妒的同事嘲笑。"},{"en":"Online mockery can hurt people more than you think.","zh":"网络嘲弄对人的伤害可能比你想的更大。"}]},{"partOfSpeech":"n.","definition":{"en":"An act of making fun of someone or something in a cruel way.","zh":"嘲笑（某人/某事的行为，常带刻薄意味）"},"examples":[{"en":"Their imitation was a mockery of the singer’s style.","zh":"他们的模仿是在刻薄地嘲笑那位歌手的风格。"},{"en":"He responded to the criticism with mockery instead of facts.","zh":"他用嘲讽回应批评，而不是拿出事实。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation or thing that shows no respect for something serious; something that makes a serious idea seem meaningless.","zh":"对严肃事物的亵渎/嘲讽；使严肃理念显得毫无意义的事物（常用于固定表达）"},"examples":[{"en":"The corruption made a mockery of the justice system.","zh":"腐败让司法系统成了一场笑话。"},{"en":"When rules are never enforced, it makes a mockery of the policy.","zh":"如果规定从不执行，那就等于把政策当笑话。"}]}],"synonyms":["ridicule","derision","taunting","scorn","jeering"],"phonetic":"/ˈmɑkəri/","extraExplanation":["“mockery”语气通常比“joking”更负面，强调伤人、轻蔑或刻薄。常见搭配：face/receive/suffer mockery（遭受嘲弄）；be subjected to mockery（受到嘲笑）；make a mockery of…（把……变成笑话/亵渎……的严肃性）。","词源上与“mock（嘲弄）”相关，写作中常用来表达对不公、虚伪或制度失灵的强烈批评，例如“make a mockery of justice（把正义当笑话）”。"]}
{"word":"mocketer","summary":{"en":"“Mocketer” is not standard English; it’s likely a misspelling of “mocker” or “marketer.”","zh":"“mocketer”不是标准英语词，通常是“mocker”或“marketer”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling of **mocker** (someone who makes fun of others) or **marketer** (someone who promotes/sells products).","zh":"不是标准英语单词。通常是 **mocker**（嘲笑别人的人）或 **marketer**（市场营销人员、推广/销售产品的人）的拼写错误。"},"examples":[{"en":"I couldn’t find “mocketer” in a standard dictionary—did you mean “mocker” or “marketer”?","zh":"我在标准词典里找不到“mocketer”——你想写的是“mocker”还是“marketer”？"},{"en":"If you mean “mocker,” it describes a person who laughs at or insults someone.","zh":"如果你指的是“mocker”，它指“嘲笑或侮辱别人的人”。"},{"en":"If you mean “marketer,” it refers to someone who works in marketing or advertising.","zh":"如果你指的是“marketer”，它指“从事市场营销或广告推广的人”。"}]}],"synonyms":["mocker","marketer","mockery","mock"],"phonetic":"/ˈmɑkətər/","extraExplanation":["“mocketer”在常见权威词典中一般查不到，因此更像拼写错误或个人造词。你可以告诉我它出现的句子/上下文（例如一整句话或你想表达的意思），我就能更准确判断你要用的是 **mocker**（嘲讽者）、**marketer**（营销人员），还是其他相近词（如 **mockery** 嘲弄、**mock** 嘲笑/模仿）。"]}
{"word":"mockful","summary":{"en":"Mockful means “mocking; scornful,” and it is rare/old-fashioned in modern English.","zh":"mockful 意为“嘲弄的、轻蔑的”，在现代英语中较少见，略带古风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"full of mocking or scorn; showing a desire to laugh at someone unkindly.","zh":"充满嘲弄或轻蔑的；带着刻薄取笑意味的。"},"examples":[{"en":"He answered with a mockful smile that made her feel small.","zh":"他带着嘲弄的微笑回答，让她觉得很难堪。"},{"en":"The crowd’s mockful laughter silenced the speaker.","zh":"人群嘲笑般的笑声让演讲者说不下去了。"}]}],"synonyms":["mocking","scornful","derisive","scoffing","taunting"],"phonetic":"/ˈmɑk.fəl/","extraExplanation":["“mockful”比较少见，带有古风/文学色彩；现代英语里更常用的是“mocking”“scornful”或“derisive”。","构词上可理解为 mock（嘲弄）+ -ful（充满……的），语气往往偏负面，暗示不友善的取笑。"]}
{"word":"mockfully","summary":{"en":"“Mockfully” means “in a mocking way,” but it’s uncommon today; “mockingly” is more natural.","zh":"“mockfully”表示“讥讽地/嘲弄地”，但现代英语中较少见；更常用的是“mockingly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a mocking or scornful way; in a manner that makes fun of someone or something.","zh":"以嘲弄、讥讽的方式；用取笑或轻蔑的态度说话/做事。"},"examples":[{"en":"He smiled mockfully when she made a small mistake.","zh":"她犯了个小错误时，他带着嘲弄的笑容笑了。"},{"en":"“Oh, sure,” she said mockfully, pretending to agree.","zh":"“哦，当然啊，”她讥讽地说，假装同意。"}]}],"synonyms":["mockingly","sarcastically","scornfully","derisively"],"phonetic":"/ˈmɑk.fə.li/","extraExplanation":["“mockfully”这个副词在现代英语里比较少见；更常用、更自然的说法通常是“mockingly”（讥讽地）或“in a mocking way”。","构词上是 mock（嘲弄）+ -ful（充满……的）+ -ly（……地）。因为“mockful”本身就不太常用，所以“mockfully”也显得更书面或更罕见。"]}
{"word":"mockground","summary":{"en":"mockground is not a standard English word; it’s likely a name, a made-up term, or a misspelling.","zh":"mockground 不是标准英语单词；更可能是名称、自造词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"**Not a standard English word.** *mockground* does not appear in major dictionaries and is not established as common English vocabulary. It is most likely a **made-up term**, a **username/project name**, or a **misspelling** (for example, “mock ground” or “mocking ground”).","zh":"**不是标准英语单词。** *mockground* 通常不见于主流词典与常用英语用法中，更可能是**自造词**、**用户名/项目名**，或是**拼写错误**（例如想写 “mock ground” 或 “mocking ground”）。"},"examples":[{"en":"I couldn’t find a dictionary entry for *mockground*—is it a brand name or a project name?","zh":"我查不到 *mockground* 的词典释义——它是品牌名还是项目名？"},{"en":"If you meant **mock ground**, it could refer to a practice area used for training or testing.","zh":"如果你想写的是 **mock ground**，它可能指用于训练或测试的“模拟场地/练习场”。"}]}],"phonetic":"/ˈmɑkˌɡraʊnd/","extraExplanation":["从构词上看，*mock* 常见意思是“嘲笑；模仿；（测试中）模拟”，*ground* 是“地面；场地；根据”。把它们拼在一起 *mockground* 在英语里并不是固定搭配，所以读者通常会把它当作专有名词（项目/账号/游戏ID等）。","如果你是在编程/测试语境里看到的，它可能是某个团队自定义的命名，表示“用于 mock（模拟）的环境/场地”。如果你把原句发我（前后各一两句），我可以帮你判断它在那里的确切含义与更自然的英文表达。"]}
{"word":"mocking","summary":{"en":"“Mocking” describes unkindly making fun of someone, or the act of doing so.","zh":"“mocking”表示“嘲笑的/嘲讽的”，也可表示“嘲笑（的行为）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making fun of someone or something in an unkind way; showing scorn through imitation or jokes.","zh":"嘲笑的；以不友善的方式取笑（某人/某事）的；带有轻蔑意味的模仿或玩笑。"},"examples":[{"en":"His mocking tone made her feel embarrassed.","zh":"他那种嘲讽的语气让她感到很尴尬。"},{"en":"They posted a mocking meme about the singer online.","zh":"他们在网上发了一张嘲弄那位歌手的梗图。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of making fun of or imitating someone or something to show disrespect (present participle/gerund of “mock”).","zh":"嘲笑；嘲弄；以模仿来表示轻视（“mock”的现在分词/动名词）。"},"examples":[{"en":"Mocking others is not acceptable in our classroom.","zh":"在我们的课堂上，嘲笑别人是不可接受的。"},{"en":"She was mocking his accent, which upset him.","zh":"她在模仿并嘲笑他的口音，这让他很难过。"}]}],"synonyms":["ridiculing","taunting","jeering","sarcastic","derisive"],"phonetic":"/ˈmɑkɪŋ/","extraExplanation":["“mocking”常用来形容语气（mocking tone）、笑容（mocking smile）、评论（mocking remarks）。注意它通常带负面评价，表示“嘲讽/挖苦”，不等于友善的玩笑（teasing）。"]}
{"word":"mockingbird","summary":{"en":"A mockingbird is a North American songbird known for imitating many sounds; in literature (especially American), it can symbolize innocence that should not be harmed.","zh":"mockingbird 指北美的“嘲鸫”，以善于模仿各种声音著称；在文学语境（尤指美国）中也常象征“无辜与不该被伤害”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American songbird (often gray-brown) famous for copying the sounds and songs of other birds and even machines","zh":"（北美）嘲鸫；一种以“模仿”其他鸟鸣乃至环境声音而闻名的鸣禽"},"examples":[{"en":"The mockingbird copied the calls of three different birds in a few minutes.","zh":"这只嘲鸫在几分钟内模仿了三种不同鸟类的叫声。"},{"en":"We heard a mockingbird outside the window late at night.","zh":"我们深夜在窗外听到了嘲鸫的叫声。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a symbol of innocence and harmlessness; someone or something that should not be hurt","zh":"（比喻）“无辜与无害”的象征；指不该被伤害的人或事物"},"examples":[{"en":"In the story, the child is treated like a mockingbird—innocent and undeserving of cruelty.","zh":"在故事里，这个孩子像“嘲鸫”一样——无辜，不该遭受残酷对待。"}]}],"synonyms":["mimic","songbird"],"phonetic":"/ˈmɑkɪŋˌbɝd/","extraExplanation":["在美国文化里，“mockingbird（嘲鸫）”常因哈珀·李小说《To Kill a Mockingbird》（《杀死一只知更鸟》）而被广泛认识。书名里的 mockingbird 不是“知更鸟”，而是“嘲鸫”。中文早期译名沿用“知更鸟”更顺口，但鸟类并不准确。","小说中有一句核心观点：嘲鸫只会唱歌、带来快乐，不会破坏庄稼，因此“杀死一只嘲鸫是罪过”象征伤害无辜者是不义的。"]}
{"word":"mockingbirds","summary":{"en":"Mockingbirds are birds (plural) known for imitating many sounds, especially other birds’ songs.","zh":"Mockingbirds（复数）指“嘲鸫”，以善于模仿多种声音（尤其是其他鸟的鸣叫）而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mockingbird: a North American songbird that imitates (copies) the sounds of other birds and even some human-made noises.","zh":"mockingbird 的复数：一种北美鸣禽，以善于模仿（复制）其他鸟类的叫声，甚至某些人造声音而闻名。"},"examples":[{"en":"We heard mockingbirds copying car alarms and other birds in the neighborhood.","zh":"我们听到嘲鸫在模仿附近的汽车警报声和其他鸟的叫声。"},{"en":"Mockingbirds often sing loudly at night in spring.","zh":"春天时，嘲鸫常常在夜里大声歌唱。"}]}],"synonyms":["mimic birds","songbirds (general)"],"phonetic":"/ˈmɑkɪŋˌbɝdz/","extraExplanation":["“mockingbird”里有 mock（嘲弄、模仿）+ bird（鸟）。这里的 mock 更接近“模仿”的意思，不是“取笑”。所以 mockingbird 指“会模仿声音的鸟”。","在美国文化里，mockingbird 常象征“纯真、善良、无辜”，很大程度上来自小说《To Kill a Mockingbird》（常译《杀死一只知更鸟》，但更准确是“嘲鸫”）。书名的意思是：伤害无辜的人，就像“杀死一只只会唱歌、不伤害人的鸟”。"]}
{"word":"mockingly","summary":{"en":"“Mockingly” means doing or saying something in a scornful, teasing way that is meant to make fun of someone.","zh":"“Mockingly”表示以嘲弄、轻蔑的方式做事或说话，带有取笑他人的意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows scorn or makes fun of someone or something in an unkind or disrespectful manner.","zh":"以嘲弄的方式；带着轻蔑或不友善地取笑（某人或某事）。"},"examples":[{"en":"He smiled mockingly when I made a mistake.","zh":"我犯错时，他带着嘲弄地笑了。"},{"en":"“Sure you can,” she said mockingly.","zh":"“当然你可以啊，”她嘲讽地说。"}]}],"synonyms":["sarcastically","scornfully","derisively","sneeringly"],"phonetic":"/ˈmɑkɪŋli/","extraExplanation":["“mockingly”来自动词“mock”（嘲笑、戏弄），常用于描写语气、表情或说话方式，带有让对方难堪的意味。","语气强弱对比：friendly teasing（善意打趣）通常不伤人；mockingly（嘲弄地/嘲讽地）更偏负面，常暗含不尊重或轻视。","常见搭配：smile/laugh mockingly（嘲弄地笑）、say/speak mockingly（嘲讽地说）、look at someone mockingly（嘲弄地看着某人）。"]}
{"word":"mockingstock","summary":{"en":"Mockingstock means an object of ridicule (an old-fashioned word for “laughingstock”).","zh":"mockingstock 指“被嘲笑的对象、笑柄”（较古旧的说法，相当于 laughingstock）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A person or thing that people laugh at, make fun of, or treat as an object of ridicule.","zh":"（古义）被人嘲笑、取笑的对象；笑柄。"},"examples":[{"en":"After the rumor spread, he became the mockingstock of the whole town.","zh":"谣言传开后，他成了全镇的笑柄。"},{"en":"She refused to be made a mockingstock for speaking up.","zh":"她拒绝因为发声而被当作嘲笑对象。"}]}],"synonyms":["laughingstock","butt (of jokes)","object of ridicule","object of derision"],"phonetic":"/ˈmɑkɪŋˌstɑk/","extraExplanation":["“mockingstock”是较古老/书面化的用法，现代英语里更常说 **laughingstock**（笑柄）。在旧式文本中也可能写作 **mocking-stock**（带连字符）。","构词可理解为：**mocking**（嘲弄）+ **stock**（这里类似“固定展示的东西/对象”），合起来就是“被固定当作取笑对象的人或事”。","语气提示：这个词带有明显的贬义与羞辱感；写作时要注意场合与礼貌。"]}
{"word":"mockish","summary":{"en":"Mockish means “slightly mocking” in tone or attitude.","zh":"mockish 指“略带嘲讽/挖苦的（语气或态度）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat mocking; showing a slight, playful, or not fully serious kind of ridicule.","zh":"有点嘲讽的；带着轻微、半开玩笑式的挖苦或不太严肃的讥笑。"},"examples":[{"en":"He gave a mockish smile, like he didn’t really believe what he was hearing.","zh":"他露出一种有点嘲讽的笑容，像是不太相信自己听到的话。"},{"en":"Her mockish tone made the compliment sound like an insult.","zh":"她那种略带嘲讽的语气让称赞听起来像是在骂人。"}]}],"synonyms":["mocking","sarcastic","teasing","derisive","scoffing"],"phonetic":"/ˈmɑkɪʃ/","extraExplanation":["“mockish”由“mock（嘲弄、模仿）+ -ish（有点……的、略带……的）”构成，意思通常是“带点嘲弄/讥讽的”。","它不是特别常见的日常词，更常见的表达有“mocking / sarcastic / teasing”。写作里用“mockish”会显得更口语化、带一点轻微和暧昧：不一定是恶意的嘲笑，也可能是打趣。"]}
{"word":"mocks","summary":{"en":"“mocks” usually means “makes fun of” (from the verb mock). In British English, “mocks” can also mean practice exams.","zh":"“mocks”通常表示“嘲笑/讥讽”（动词 mock 的第三人称单数）。在英式英语中，“mocks”也可指“模拟考试”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “mock”) to laugh at, tease, or make fun of someone or something in an unkind way.","zh":"（mock 的第三人称单数）嘲笑；讥讽；取笑（人或事）"},"examples":[{"en":"He mocks her accent, which is hurtful and rude.","zh":"他嘲笑她的口音，这很伤人也很没礼貌。"},{"en":"Some people mocked the idea at first, but it later worked.","zh":"有些人起初嘲笑这个想法，但后来事实证明可行。"}]},{"partOfSpeech":"v.","definition":{"en":"to imitate someone or something in a way that shows disrespect or ridicule.","zh":"（带贬义地）模仿；学样（以表达轻蔑或嘲弄）"},"examples":[{"en":"The comedian mocks famous singers on stage.","zh":"那位喜剧演员在台上模仿并嘲弄知名歌手。"},{"en":"The parrot mocks the sound of the doorbell.","zh":"那只鹦鹉会模仿门铃声。"}]},{"partOfSpeech":"n.","definition":{"en":"(British English, informal) practice exams taken before the real exam.","zh":"（英式英语，非正式）模拟考试；“模考”"},"examples":[{"en":"We have mocks next week, so I’m revising every day.","zh":"我们下周有模拟考试，所以我每天都在复习。"},{"en":"Her mocks results were better than she expected.","zh":"她的模考成绩比预期更好。"}]}],"synonyms":["teases","ridicules","makes fun of","mimics","parodies","practice exams"],"phonetic":"/mɑks/","extraExplanation":["“mocks”表示“模拟考试”主要见于英式英语校园语境（如 GCSE / A-level）。美式英语更常说“practice tests/exams”或“mock exam(s)”。","动词 mock 既可以是恶意的“嘲笑”，也可以是中性语境的“仿效/模拟”（尤其是机器、动物对声音的模仿）。如果强调不礼貌，语气通常更负面。"]}
{"word":"mockup","summary":{"en":"A mockup is a model or draft that shows how something will look; it can also mean to create that model.","zh":"mockup 指用来展示外观或布局的样稿/模型；也可作动词，表示制作样稿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a model (often a simple or not fully working one) that shows what a product, design, webpage, or app will look like","zh":"（常指较简化或未完全可用的）模型/样稿，用来展示产品、设计、网页或应用将会长什么样"},"examples":[{"en":"The designer showed a mockup of the new homepage before writing any code.","zh":"设计师在写任何代码之前先展示了新版首页的样稿。"},{"en":"Can you send me a mockup of the packaging so I can check the colors?","zh":"你能发我一个包装的样稿吗？我想确认一下颜色。"}]},{"partOfSpeech":"v.","definition":{"en":"to create a model or draft version of something (especially a design)","zh":"（尤指为设计）制作样稿/模型；把……做成草图或初稿"},"examples":[{"en":"I mocked up a quick layout to show the idea to the team.","zh":"我快速做了一个版式样稿，给团队展示这个想法。"}]}],"synonyms":["model","prototype","draft","layout"],"phonetic":"/ˈmɑkˌʌp/","extraExplanation":["在设计/产品语境里，mockup 通常比 sketch（草图）更“像成品”，但又不一定可点击或可运行；如果强调“可点击的原型”，更常用 prototype。"]}
{"word":"mockups","summary":{"en":"Mockups are visual models that show how a design will look before it’s built; as a verb, to mock up means to create such a model.","zh":"Mockups指在正式制作前用于展示设计外观的效果图/样机；作动词时表示制作这类效果图/样机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A model or full-size design used to show what something (especially a website, app, ad, or product) will look like before it is made.","zh":"（尤指网站、App、广告或产品的）样机/效果图；用于在正式制作前展示外观与布局的模型。"},"examples":[{"en":"The designer shared three homepage mockups for feedback.","zh":"设计师分享了三个首页效果图来征求反馈。"},{"en":"These mockups show the layout and colors, but the buttons don’t work yet.","zh":"这些效果图展示了布局和配色，但按钮还不能使用。"}]},{"partOfSpeech":"v.","definition":{"en":"To create a mockup (a visual model) of something.","zh":"制作（某物的）效果图/样机；把想法做成可视化模型。"},"examples":[{"en":"I’ll mock up a new menu screen by tomorrow.","zh":"我明天之前会把新的菜单界面先做个效果图。"},{"en":"We mocked up the packaging to test different fonts.","zh":"我们做了包装样机来测试不同的字体。"}]}],"synonyms":["mock-up","visual design","design comp","prototype (related)","wireframe (related)"],"phonetic":"/ˈmɑkˌʌps/","extraExplanation":["在产品/界面设计里，mockup通常比wireframe（线框图）更“像真的”（有颜色、图片、字体等视觉细节），但一般还不是可点击的成品。更接近可操作的是prototype（原型）。","口语里也常说“a mock-up”。在团队沟通中，mockup的重点是快速对齐“长什么样”，方便收集反馈、减少返工。"]}
{"word":"Mocky","summary":{"en":"“Mocky” is an informal adjective meaning “mocking/teasing in a scornful way,” or “mock-like” (jokingly fake).","zh":"“Mocky”是非正式形容词，常指“带嘲弄/取笑意味的”，也可指“像模仿出来的、玩笑式的假装的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Showing ridicule or scorn; teasing in a way that is not respectful.","zh":"（非正式）带嘲弄或轻蔑的；用不尊重的方式取笑的。"},"examples":[{"en":"His mocky tone made it hard to take the feedback seriously.","zh":"他那种嘲弄的语气让人很难把反馈当回事。"},{"en":"She gave a mocky laugh when she heard the excuse.","zh":"听到那个借口，她发出一声带嘲讽的笑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling a mock or imitation; fake in a joking way.","zh":"像仿造/模仿出来的；带玩笑意味的“假装的”。"},"examples":[{"en":"They held a mocky award ceremony for fun.","zh":"他们为了好玩办了一个“假装”的颁奖典礼。"},{"en":"He wore a mocky crown made of paper.","zh":"他戴着一顶纸做的“假”王冠。"}]}],"synonyms":["mocking","sarcastic","derisive","teasing","snide"],"phonetic":"/ˈmɑki/","extraExplanation":["“mocky”不算特别标准或常见的词，更常见的是“mocking”（嘲弄的）或“mock”（动词/名词）。口语里有人会用“-y”把词变成形容词，表示“带点……的感觉”（如 rainy, funny），所以 mock + y → mocky = “有点嘲讽/爱取笑的感觉”。"]}
{"word":"mocmain","summary":{"en":"Mocmain is an obsolete word for a light, elastic white fiber from a silk-cotton tree (Bombax).","zh":"mocmain 是一个古旧词，指一种来自丝棉树（木棉属 Bombax）的轻、富弹性的白色纤维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(obsolete) A light, elastic, white fiber obtained from a silk-cotton tree (Bombax).","zh":"（古旧用语）从木棉属（Bombax）的“丝棉树/木棉树”获得的一种轻、富弹性、白色的纤维。"},"examples":[{"en":"In old trade writings, mocmain was praised for being very light and springy.","zh":"在一些旧时的贸易/记载文献中，mocmain 因“很轻且有弹性”而受到称赞。"},{"en":"The museum label notes that the stuffing may include mocmain from a silk-cotton tree.","zh":"博物馆的说明牌写道，这种填充物可能包含来自丝棉树的 mocmain。"}]}],"synonyms":["silk-cotton fiber","plant fiber"],"phonetic":"/ˈmɑk.meɪn/","extraExplanation":["这个词在现代英语里非常罕见，通常被标注为 obsolete（已废用/古旧用语），多见于较老的词典或资料（例如对植物纤维的描述）。","mocmain 很容易被误看成拼写错误：不少学习者其实想查的是 moccasin（鹿皮软鞋/莫卡辛鞋）。如果你告诉我你看到 mocmain 的句子或出处（书名/页面截图），我可以帮你确认它在那段语境里是不是这个“纤维”的意思。"]}
{"word":"moco","summary":{"en":"“moco/MoCo” most commonly means Montgomery County (U.S.), but it can also be the Spanish word for mucus/snot, a science abbreviation (molybdenum cofactor), or a rodent name.","zh":"“moco/MoCo”最常见是美国对 Montgomery County 的简称；也可能是西班牙语“鼻涕/黏液”，或科学缩写“钼辅因子”，以及一种南美啮齿动物的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, U.S.) Abbreviation/nickname for **Montgomery County** (often Montgomery County, Maryland).","zh":"（非正式，美国）**Montgomery County（蒙哥马利县）**的简称/昵称（常指马里兰州的蒙哥马利县）。"},"examples":[{"en":"I grew up in **MoCo**, so I’m used to taking the Metro into D.C.","zh":"我在**MoCo（蒙哥马利县）**长大，所以习惯坐地铁去华盛顿特区。"},{"en":"There are lots of great food spots in **MoCo**.","zh":"**MoCo**有很多很棒的美食去处。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish word; used in English contexts) **Mucus; snot; a booger** (informal).","zh":"（西班牙语词；在英语语境中也会出现）**黏液、鼻涕；鼻屎**（口语）。"},"examples":[{"en":"In Spanish, **moco** can mean “snot.”","zh":"在西班牙语里，**moco**可以指“鼻涕/鼻屎”。"},{"en":"The kid had **moco** on his nose (very informal).","zh":"小孩鼻子上有**鼻涕/鼻屎**（很口语）。"}]},{"partOfSpeech":"n.","definition":{"en":"(science) Short for **molybdenum cofactor** (often written “MoCo”), a molecule needed for certain enzymes to work.","zh":"（科学）**钼辅因子**（常写作“MoCo”）的简称，是一些酶正常工作所必需的分子。"},"examples":[{"en":"This enzyme needs **MoCo** to function properly.","zh":"这种酶需要**MoCo（钼辅因子）**才能正常发挥作用。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology) A **moco / mocó**, a South American rodent (rock cavy).","zh":"（动物）**moco / mocó**，一种南美洲啮齿动物（岩豚鼠/石豚鼠）。"},"examples":[{"en":"The **moco** is closely related to guinea pigs.","zh":"**moco**和豚鼠是近亲。"}]}],"synonyms":["MoCo","Montgomery County","mucus","snot","booger"],"phonetic":"/ˈmoʊkoʊ/","extraExplanation":["“moco/MoCo”在现实里经常是**大小写决定意思**：在美国口语里写作 **MoCo** 时，很多人会理解为“Montgomery County”；在生物化学文章里 **MoCo** 常指“钼辅因子”。","作为西班牙语的 **moco**，含义比较“身体/脏话边缘”的口语（鼻涕、鼻屎），和不熟的人使用可能显得不礼貌；更中性说法可用 *mucosidad*（黏液）。","如果你指的是某个特定地方（例如马里兰州/密苏里州的 Montgomery County）或某个专业语境（生物/医学论文），告诉我上下文，我可以帮你判断这里的“moco”到底是哪一种用法。"]}
{"word":"mocoa","summary":{"en":"“Mocoa” can mean (1) a rare word for an old covered carriage (a coche), or (2) the Colombian town Mocoa (capital of Putumayo).","zh":"“mocoa/Mocoa”既可指（1）罕见的旧式有顶马车（coche），也可指（2）哥伦比亚城镇 Mocoa（普图马约省省会）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A coche; an old-fashioned, covered horse-drawn carriage.","zh":"（罕见）一种“coche（四轮有篷马车）”；旧式的有顶马车。"},"examples":[{"en":"In the old travel journal, the governor arrived in a mocoa pulled by two horses.","zh":"在那本旧旅行日记里，总督乘坐一辆两匹马拉的 mocoa 到达。"},{"en":"The museum’s display includes a mocoa similar to those used in colonial times.","zh":"博物馆的展品里有一辆 mocoa，样式与殖民时期使用的马车相似。"}]},{"partOfSpeech":"n.","definition":{"en":"Mocoa: a town in southern Colombia; the capital of the Putumayo Department.","zh":"Mocoa：哥伦比亚南部城镇，普图马约省（Putumayo）的省会。"},"examples":[{"en":"After several days in the Andes, they continued their trip toward Mocoa.","zh":"在安第斯山脉待了几天后，他们继续向 Mocoa 出发。"},{"en":"Mocoa is a regional commercial center near the Amazon basin.","zh":"Mocoa 是靠近亚马孙流域的区域商贸中心。"}]}],"synonyms":["coche","carriage","coach"],"phonetic":"/məˈkoʊ.ə/","extraExplanation":["这个词有两个常见用法方向：\n1）小写 mocoa 在现代英语里非常少见，主要见于词典或历史语境，意思是“coche（旧式马车）”。\n2）大写 Mocoa 更常见，是哥伦比亚的地名。\n\n如果你想查的是常见饮品/口味“mocha（摩卡）”，拼写是 mocha，不是 mocoa。你可以告诉我你的语境（句子/想表达什么），我也可以帮你确认。"]}
{"word":"mocoan","summary":{"en":"Mocoan is a cultural term for a traditional (often sung) manuscript-recitation practice in Indonesia, especially among the Osing community in East Java.","zh":"mocoan 是一个文化术语，指印尼（尤其东爪哇 Osing 社群）传统的手稿诵读/吟唱习俗。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Indonesian culture) A traditional practice—especially among the Osing people of Banyuwangi, East Java—of reading/reciting (often sung-chanting) classical manuscripts (lontar).","zh":"（印尼文化）一种传统诵读/吟唱手抄本（多为棕榈叶手稿 lontar）的习俗，尤见于东爪哇外南梦（Banyuwangi）的 Osing 社群。"},"examples":[{"en":"During the ceremony, elders performed mocoan by singing verses from a lontar manuscript.","zh":"在仪式中，长者以 mocoan 的方式吟唱棕榈叶手稿中的诗句。"},{"en":"The village invited a mocoan group to recite the story as part of the annual ritual.","zh":"村里邀请了一支 mocoan 团队，把诵读故事作为年度仪式的一部分。"}]}],"synonyms":["manuscript recitation","sung recitation","lontar chanting"],"phonetic":"/moʊˈkoʊ.ən/","extraExplanation":["“mocoan”多被视为印尼地方文化术语，而不是常见英语词。它与爪哇语词根有关，常被解释为“读/诵读”，但在实际表演里往往是带旋律的吟诵（不是单纯朗读）。","相关写法与称呼可能会因地区与研究者而不同，例如有时也会看到与“lontar（手稿）”或“lontaran”等词一起出现。","如果你原本想查的是英语单词、地名或人名（例如拼成 *Mohican* / *Mocoa* / *Mokoan* 等），告诉我你看到它的句子或来源（书、视频、聊天内容），我可以帮你确认正确拼写与含义。"]}
{"word":"mocock","summary":{"en":"Mocock is a rare noun meaning a birch-bark box/basket traditionally used to store or carry food.","zh":"mocock 是个较少见的名词，指传统上用桦树皮做的盒/篮，用来装食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small box or basket, often made of birch bark, traditionally used by some Indigenous peoples in North America to store or carry food (such as maple sugar, wild rice, or berries).","zh":"（常用桦树皮制作的）小盒或小篮；北美一些原住民传统上用来存放或携带食物（如枫糖、野米或浆果）的容器。"},"examples":[{"en":"She kept the dried berries in a birch-bark mocock.","zh":"她把晒干的浆果放在一个桦树皮做的 mocock 里。"},{"en":"The trader recorded receiving maple sugar packed in mococks.","zh":"那位商人记录说收到了用 mocock 装着的枫糖。"}]}],"synonyms":["birch-bark box","bark container","basket (general)"],"phonetic":"/məˈkɑk/","extraExplanation":["这个词比较罕见，多见于历史记载、人类学/民族志文本，或描写北美原住民物质文化（traditional material culture）的语境里。","词源一般认为来自阿尔冈昆语系（Algonquian languages），与奥吉布瓦语（Ojibwe）里表示“盒子/容器”的词（如 makak）有关。不同文献里也会出现拼写变体（如 mocuck、makak/makuk 等）。","发音在词典里常标作 /məˈkɑk/（美式），重音在第二个音节；因为是借词且较少见，实际读音也可能有轻微差异。"]}
{"word":"mocomoco","summary":{"en":"“Mocomoco” is most often used as a romanized form of Japanese もこもこ, meaning soft, puffy, fluffy (often thick/voluminous). It can also be a place name in Bolivia; “moko-moko” is also a Māori-derived lizard name in English.","zh":"“mocomoco”多用来表示日语 もこもこ（moko moko），意思是柔软、鼓鼓的、蓬松厚实。它也可能是玻利维亚的地名；另外英语里“moko-moko”还可指一种源自毛利语称呼的新西兰小蜥蜴。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from Japanese もこもこ, usually written “moko moko”) describing something that is fluffy, puffy, or thickly “bulging” in a soft way (often clothing, fur, clouds, foam).","zh":"（源自日语 もこもこ，常写作 “moko moko”）形容柔软而鼓鼓的、蓬松厚实的状态（常用于衣服、毛发、云朵、泡沫等）。"},"examples":[{"en":"After washing, the towel feels mocomoco—soft and puffy.","zh":"洗完之后，这条毛巾摸起来很“mocomoco”——柔软又蓬松。"},{"en":"He wore a mocomoco down jacket and looked extra warm.","zh":"他穿了一件很“mocomoco”的羽绒服，看起来特别暖和。"},{"en":"The cat’s fur is so mocomoco that you just want to hug it.","zh":"这只猫的毛太“mocomoco”了，让人忍不住想抱抱。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name: Mocomoco (also seen as “Moco Moco”), a town/municipality in the La Paz Department of Bolivia.","zh":"地名：Mocomoco（也常见作 “Moco Moco”），玻利维亚拉巴斯省的一个城镇/市镇名。"},"examples":[{"en":"Mocomoco is a locality in Bolivia’s La Paz Department.","zh":"Mocomoco 是玻利维亚拉巴斯省的一个地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(spelled “moko-moko”) a small lizard from New Zealand; the term is from Māori.","zh":"（拼作 “moko-moko”）一种新西兰的小蜥蜴；词源来自毛利语。"},"examples":[{"en":"The guide pointed out a moko-moko resting on a warm rock.","zh":"向导指给我们看一只 moko-moko 正趴在温热的岩石上。"}]}],"synonyms":["fluffy","puffy","woolly","plush","lumpy","bulky"],"phonetic":"/ˌmoʊkoʊ ˈmoʊkoʊ/","extraExplanation":["你写的 **mocomoco** 更像是把日语拟态词 **もこもこ（moko moko）** 连写后的拼法；在英文语境里更常见的写法是 **moko moko**（分开）或日文假名/片假名 **もこもこ／モコモコ**。它常用来描述“蓬松到有体积感、鼓起来”的那种软绒感，比如羽绒服穿得很厚、羊毛卷卷的、泡沫一团一团冒出来等。([romajidesu.com](https://www.romajidesu.com/dictionary/meaning-of-%E3%83%A2%E3%82%B3%E3%83%A2%E3%82%B3.html?utm_source=openai))","synonyms=[","fluffy","puffy","woolly","plush","lumpy","bulky"]}
{"word":"mocquer","summary":{"en":"“Mocquer” is a rare/archaic spelling meaning “mocker” (noun) or “to mock” (verb). Modern English uses “mocker” and “mock.”","zh":"“mocquer”是罕见/古拼写，可表示名词“嘲讽者”或动词“嘲笑”。现代英语一般用“mocker”和“mock”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/archaic spelling) a person who mocks; a \"mocker.\"","zh":"（非标准/古拼写）嘲笑他人的人；“嘲讽者/讥笑者”（同 mocker）。"},"examples":[{"en":"In some older texts, you may see “mocquer” used where modern English would write “mocker.”","zh":"在一些较早的文本里，你可能会看到用 “mocquer” 来表达现代英语中的 “mocker”。"},{"en":"Don’t be a mocquer—listen first before you judge.","zh":"别当个嘲讽者——先听清楚再下结论。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) to mock; to laugh at someone in an unkind way.","zh":"（罕见/古义）嘲笑；以不友善的方式取笑某人（同 mock）。"},"examples":[{"en":"They mocquered his accent, which hurt his feelings.","zh":"他们嘲笑他的口音，这伤害了他的感受。"},{"en":"It’s unkind to mocquer people for making mistakes in a new language.","zh":"因为别人用外语犯错就去嘲笑，是不友善的。"}]}],"synonyms":["mocker","scoffer","teaser","ridiculer","mock"],"phonetic":"/ˈmɑkər/","extraExplanation":["“mocquer”在现代英语里几乎不用，多见于早期英语文本中的拼写变体，来源上与法语 *se moquer (de)*（嘲笑）有关。学习和写作时建议使用现代标准形式：动词用 **mock**，名词用 **mocker**。"]}
{"word":"mocuck","summary":{"en":"Mocuck is a rare noun meaning a birch-bark box/container, traditionally associated with Native North American craft and daily use.","zh":"Mocuck 是较少见的名词，指一种桦树皮制成的小盒／容器，传统上与北美原住民的工艺与日常使用有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small box-like container made of birch bark (traditionally made by some Native American/First Nations peoples), used as a receptacle—for example, for storing sugar or other small goods.","zh":"一种用桦树皮制作的小盒状容器（传统上见于部分北美原住民／第一民族的手工器物），用来盛放或储存物品，例如糖等小件。"},"examples":[{"en":"She bought a handmade birch-bark mocuck at the craft market.","zh":"她在手工艺集市上买了一个手工制作的桦树皮 mocuck。"},{"en":"Historically, a mocuck could be used as a practical storage container.","zh":"从历史上看，mocuck 可以作为实用的储物容器使用。"}]}],"synonyms":["mocock","birch-bark container","bark box"],"phonetic":"/ˈmoʊ.kʌk/","extraExplanation":["这个词比较少见，常见于历史、人类学、工艺品与词典条目中。不同资料里也会出现拼写变体 **mocock**（意思相近）。","词源一般认为来自阿尔冈昆语系（常被提到与奥吉布韦语 *makak* 相关），指一种“半硬的容器／桦树皮盒”。如果你是在网络对话里看到它，也有可能是把别的词打错了（例如 *muck*、*mock* 等）。"]}

