{"word":"mod","summary":{"en":"“Mod” commonly means a modification (especially a game mod), a moderator online, or the 1960s British mod subculture; it can also mean “modern” in informal use.","zh":"“mod”常指（尤指游戏）模组/改装，也可指网络版主，或英国60年代“摩登族”亚文化；非正式语境下还可表示“现代的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a modification (a change made to improve or alter something), especially to a computer, car, or game","zh":"（尤指对电脑、汽车或游戏的）改装；修改；模组"},"examples":[{"en":"I installed a mod to improve the game’s graphics.","zh":"我安装了一个模组来提升游戏画质。"},{"en":"His car has a few mods, like new lights and a louder exhaust.","zh":"他的车做了一些改装，比如新车灯和更响的排气。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who moderates an online community (short for “moderator”)","zh":"（网络社区的）版主；管理员（moderator 的缩写）"},"examples":[{"en":"Ask a mod if your post was removed by mistake.","zh":"如果你觉得帖子被误删了，可以问一下版主。"},{"en":"The mods will ban users who break the rules.","zh":"版主会封禁违反规则的用户。"}]},{"partOfSpeech":"n.","definition":{"en":"a style or person from the British “mod” youth culture (1960s), known for sharp fashion and scooters","zh":"（英国 1960 年代的）摩登族；摩登派青年（以讲究穿着、骑踏板车著称）"},"examples":[{"en":"He dressed like a 1960s mod, with a neat suit and boots.","zh":"他穿得像 1960 年代的摩登族：合身西装配靴子。"},{"en":"The movie showed the rivalry between mods and rockers.","zh":"电影展现了摩登族和摇滚族之间的对立。"}]},{"partOfSpeech":"v.","definition":{"en":"to modify something, especially a game or device (often used in gaming/tech)","zh":"改装；修改（尤用于游戏/科技语境）"},"examples":[{"en":"Some players mod their consoles to run custom software.","zh":"一些玩家会改装主机来运行自定义软件。"},{"en":"It’s fun to mod the game, but be careful with online rules.","zh":"改游戏很有趣，但要注意线上规则。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to “modern” style (informal, short for “modern”)","zh":"现代风格的（非正式，modern 的缩写）"},"examples":[{"en":"I like the mod look—clean lines and simple colors.","zh":"我喜欢现代风：线条干净、配色简单。"}]}],"synonyms":["modification","customization","add-on","patch","moderator","admin"],"phonetic":"/mɑd/","extraExplanation":["“mod”有多个来源：在英国文化里，mod 原本是 modernist（现代派/摩登派）的简称，常指 1960 年代的青年亚文化（穿着讲究、喜欢灵魂乐/摩登摇滚、骑 Vespa/Lambretta 踏板车）。在科技与游戏领域，mod 多由 modify/modification（修改/改装）缩写而来，常见于“game mods（游戏模组）”。在网络社区里，mod 也常用作 moderator（版主/管理员）的简称。具体含义通常要看上下文。"]}
{"word":"Moda","summary":{"en":"“Moda” usually means “fashion” in Spanish/Italian; in English it’s often used in those cultural contexts. “MODA” in all caps may be an acronym with a context-specific meaning.","zh":"“Moda”通常是西班牙语/意大利语里的“时尚”，英语中多在相关文化语境里借用；全大写“MODA”可能是缩写，含义需看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish/Italian) fashion; a style that is popular at a particular time.","zh":"（源自西班牙语/意大利语）时尚；某一时期流行的风格。"},"examples":[{"en":"In Spanish, “moda” means “fashion,” as in “la moda de París” (Paris fashion).","zh":"在西班牙语里，moda 的意思是“时尚”，例如“la moda de París”（巴黎时尚）。"},{"en":"She loves reading about moda and new clothing trends.","zh":"她喜欢阅读关于 moda（时尚）和新服装潮流的内容。"}]},{"partOfSpeech":"n.","definition":{"en":"(often written as MODA) an abbreviation used in some fields; its meaning depends on the context (e.g., a company, organization, or technical term).","zh":"（常写作 MODA）在某些领域中作为缩写使用；具体含义取决于语境（例如公司名、组织名或技术术语）。"},"examples":[{"en":"In this document, MODA is an acronym, so check the first page for its full meaning.","zh":"在这份文件里，MODA 是一个缩写，所以要看第一页它的全称是什么。"}]}],"synonyms":["fashion","style","trend"],"phonetic":"ˈmoʊdə","extraExplanation":["在英语里，**moda** 本身不是最常见的日常词；更多是出现在西班牙语/意大利语语境（旅游、时尚杂志、品牌名）中，借用来表达“时尚”。","如果看到全大写 **MODA**，更可能是“缩写/专有名词”，需要根据所在行业或上下文确认具体指什么。"]}
{"word":"modal","summary":{"en":"Modal most commonly means “related to modality,” especially in grammar (modal verbs). It can also mean “related to the mode (most frequent value)” in statistics, or “based on musical modes” in music.","zh":"Modal 最常见指与“情态”有关（尤其是语法里的情态动词）。它也可指统计学中的“众数相关”，或音乐中“调式相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar/Linguistics) relating to modality—showing possibility, necessity, permission, ability, etc.; often used in “modal verb.”","zh":"（语法/语言学）与“情态”有关的；表示可能性、必要性、许可、能力等，常见于“情态动词”。"},"examples":[{"en":"In English, “can,” “must,” and “might” are modal verbs.","zh":"在英语中，can、must 和 might 都是情态动词。"},{"en":"A modal meaning can express obligation, like “You must wear a seat belt.”","zh":"情态意义可以表达义务，例如：You must wear a seat belt（你必须系安全带）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Statistics) describing the mode (the most frequent value) in a set of data.","zh":"（统计学）与“众数”（出现次数最多的值）有关的。"},"examples":[{"en":"The modal age in the survey was 25.","zh":"这项调查的众数年龄是25岁。"},{"en":"We calculated the mean, median, and modal value.","zh":"我们计算了平均数、中位数和众数。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Music) using musical modes (scales other than major/minor), or based on them; e.g., “modal jazz.”","zh":"（音乐）使用或基于“调式”（不同于大/小调的音阶体系）的；如“调式爵士（modal jazz）”。"},"examples":[{"en":"The melody has a modal sound, like a folk tune.","zh":"这段旋律有一种调式的感觉，像民谣。"},{"en":"Miles Davis explored modal jazz in the album “Kind of Blue.”","zh":"迈尔斯·戴维斯在专辑《Kind of Blue》中探索了调式爵士。"}]},{"partOfSpeech":"n.","definition":{"en":"(Logic/Linguistics) a word or expression that marks modality, such as necessity or possibility (often referring to modal verbs or modal operators).","zh":"（逻辑/语言学）表示情态（如必然、可能）的词或表达；常指情态动词或情态算子。"},"examples":[{"en":"In the sentence “She may come,” “may” is the modal.","zh":"在句子“She may come（她可能会来）”中，may 是情态词。"},{"en":"In logic, “necessarily” and “possibly” can be treated as modals.","zh":"在逻辑中，“necessarily（必然地）”和“possibly（可能地）”可被当作情态表达。"}]}],"synonyms":["(grammar) auxiliary","(grammar) modally related","(statistics) mode-related","(music) mode-based"],"phonetic":"/ˈmoʊdəl/","extraExplanation":["在英语语法里，modal 最常见搭配是 modal verb（情态动词）。情态动词通常不随人称变化（如不加 -s），后面接动词原形：She can swim（不是 *can swims）。常见情态动词包括 can/could, may/might, must, shall/should, will/would。","在日常学习中，modal 也常出现在 “modal auxiliary（情态助动词）” 和 “semi-modal（半情态动词）” 里；半情态动词如 have to, need to, be able to，形式更像普通动词，但意义接近情态。"]}
{"word":"modalism","summary":{"en":"Modalism is a theological belief that God is one person who shows up in different modes (Father, Son, Holy Spirit), not three distinct persons.","zh":"Modalism（形态论）是一种神学观点：认为上帝只有一位格，只是以不同样态（父、子、圣灵）显现，而非三个位格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Christian theology) The belief that God is one person who appears in different “modes” (for example, as Father, Son, and Holy Spirit) rather than three distinct persons.","zh":"（基督教神学）一种观点：认为上帝只有“一位格”，只是以不同“样态/形态”（如父、子、圣灵）来显现，而不是三个位格彼此区别的三一。"},"examples":[{"en":"In many church history textbooks, modalism is discussed as a major debate about the Trinity.","zh":"在许多教会历史教材里，都会把“形态论（modalism）”作为三一论的重要争论来讨论。"},{"en":"Some Christians reject modalism because it does not clearly distinguish the Father and the Son.","zh":"一些基督徒反对形态论，因为它没有清楚地区分圣父与圣子。"}]}],"synonyms":["Sabellianism","modalistic monarchianism"],"phonetic":"/ˈmoʊdəˌlɪzəm/","extraExplanation":["“Modalism”常被中文译作“形态论/样态论/形相论”。它通常与“撒伯流主义（Sabellianism）”联系在一起（但在不同学术语境中二者有时会被更细分）。","在传统主流基督教（如尼西亚传统）的表述中，三一强调“一体三位格”（one God in three persons）：上帝是一位，但父、子、圣灵在位格上彼此区别；而形态论更强调“同一位”以不同方式或角色显现。","学习这个词时要注意语境：它多出现在神学、教会历史、宗教研究或讨论三一论的文章中；在日常英语里并不常用。"]}
{"word":"modalist","summary":{"en":"**Modalist** means a person who follows (or something that relates to) **modalism**, a Christian theological view about God’s “modes.”","zh":"**modalist** 指「形態論（modalism）的信奉者」，或「與形態論相關／支持形態論的」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Christian theology) A person who believes in **modalism**—the view that God is one person who appears in different “modes” (e.g., Father, Son, Holy Spirit), rather than three distinct persons.","zh":"（基督教神學）**形態論（modalism）**的信奉者；認為上帝是一位，在不同時刻以不同「樣式／形態」（如父、子、聖靈）顯現，而非三個彼此區分的位格。"},"examples":[{"en":"Some early Christian writers argued against modalists because they believed the Father and the Son are distinct persons.","zh":"一些早期基督教作者反對形態論者，因為他們相信父與子是彼此區分的位格。"},{"en":"The speaker clarified that being a modalist is different from holding a traditional Trinitarian view.","zh":"講者澄清：成為形態論者（modalist）與傳統的三位一體觀不同。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or supporting modalism in Christian theology.","zh":"（基督教神學）與形態論（modalism）有關的；支持形態論的。"},"examples":[{"en":"The article discusses a modalist interpretation of the Trinity.","zh":"這篇文章討論一種形態論式（modalist）的三位一體詮釋。"},{"en":"He criticized what he called a modalist reading of certain biblical passages.","zh":"他批評他所稱的、對某些聖經段落的形態論式（modalist）解讀。"}]}],"synonyms":["Sabellian","adherent of modalism"],"phonetic":"/ˈmoʊdəlɪst/","extraExplanation":["「modalist」在日常英文中很少見，主要出現在神學與教會史的討論裡。常見相關詞包括 **modalism**（形態論）與 **Sabellianism**（撒伯流主義）。","不要把「modalist」和音樂裡的「modal」（調式的，如多利亞調式 Dorian mode）混淆；音樂領域通常會說 *modal jazz*、*modal harmony*，較少用 *modalist* 來指人。"]}
{"word":"modalistic","summary":{"en":"Modalistic = relating to Modalism, a theological view that God is one person appearing in different modes (Father/Son/Spirit).","zh":"modalistic＝与样式论（Modalism）相关：认为上帝是一位，以不同样式（父/子/灵）显现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to **Modalism**: the belief that God is one person who appears in different “modes” (for example, as Father, Son, and Holy Spirit), rather than three distinct persons in the Trinity.","zh":"（神学）与**形态论/样式论（Modalism）**有关：认为上帝只有一个位格，只是以不同“样式/模式”（如圣父、圣子、圣灵）显现，而非三个位格的三位一体。"},"examples":[{"en":"Some early Christian writers argued strongly against **modalistic** teachings.","zh":"一些早期基督教作者强烈反对**样式论式的**教导。"},{"en":"The debate was whether the language sounded **modalistic** or truly trinitarian.","zh":"争论点在于这些表述听起来是否偏向**样式论**，还是确实符合三位一体。"}]}],"synonyms":["modalist","Sabellian (often used historically, sometimes more specific)"],"phonetic":"/ˌmoʊdəlˈɪstɪk/","extraExplanation":["“modalistic”多见于宗教学/神学写作，语气通常较学术或带批评色彩，用来指出某种说法“听起来像样式论”。","相关概念：Modalism（样式论/形态论）在基督教历史中常被视为与主流三位一体教义不一致；因此在神学语境里，这个词往往不是中性标签。","用法提示：日常英语里很少用到，通常出现在教会历史、系统神学、教义辩论等文本中。"]}
{"word":"modalities","summary":{"en":"Modalities means “different methods or forms,” and it’s used in general contexts (ways of doing/learning), medicine (types of therapy), and logic/grammar (possibility, necessity, obligation).","zh":"Modalities 表示“不同方式/形式”，常用于一般语境（做事/学习方式）、医学（疗法类型）以及逻辑/语法（可能、必然、义务等模态意义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Different ways or methods of doing something, communicating, or experiencing something.","zh":"（做事、沟通或体验的）不同方式、方法或形式。"},"examples":[{"en":"The course uses multiple modalities, including lectures, group discussion, and online videos.","zh":"这门课使用多种形式，包括讲授、小组讨论和在线视频。"},{"en":"Some people learn better through visual modalities than through reading alone.","zh":"有些人通过视觉形式学习，比只靠阅读学得更好。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medicine) Types of treatment or therapeutic methods used to help a patient.","zh":"（医学）治疗手段；疗法类型。"},"examples":[{"en":"Physical therapy and heat therapy are common modalities for back pain.","zh":"物理治疗和热疗是治疗背痛的常见手段。"}]},{"partOfSpeech":"n.","definition":{"en":"(Philosophy/Linguistics) Categories describing how something is true or necessary, such as possibility, necessity, or obligation.","zh":"（哲学/语言学）“模态”类别，用来表达可能性、必然性或义务等。"},"examples":[{"en":"In logic, modalities like necessity and possibility help describe different kinds of truth.","zh":"在逻辑学中，“必然”和“可能”等模态用来描述不同类型的真。"},{"en":"Words like can, must, and should often express modality in English.","zh":"英语中的 can、must、should 等词常用来表达模态意义。"}]}],"synonyms":["methods","approaches","modes","forms","means"],"phonetic":"/moʊˈdælɪtiz/","extraExplanation":["“Modality”的核心意思是“方式/形式”。单数 modality 常指一种方式；复数 modalities 指多种方式（你输入的 modalities 就是复数）。","在教育与科技语境里，modalities 很常见：例如 visual（视觉）、auditory（听觉）、text（文本）、video（视频）、touch/gesture（触摸/手势）等；也可以指“线上/线下/混合”等授课形式。","在英语语法里，modality 常和情态动词（modal verbs）一起出现：can/could（能力/可能）、may/might（可能/许可）、must（必须/推断）、should（建议/义务）等。"]}
{"word":"modality","summary":{"en":"Modality means a method or type of doing something; in grammar it also means how speakers express possibility, necessity, permission, or certainty.","zh":"Modality 指做事的方法/类型；在语法中也指情态，即表达可能性、必要性、许可或确定性的方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a way or method of doing something, or a particular form/type of something","zh":"做事的方法或方式；某事物的形式/类型"},"examples":[{"en":"Online learning is a popular modality for working adults.","zh":"在线学习是上班族常用的一种学习方式。"},{"en":"Doctors may recommend different treatment modalities depending on the patient’s needs.","zh":"医生会根据病人的需要推荐不同的治疗方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(in language/grammar) the speaker’s attitude toward how possible, necessary, allowed, or certain something is (often shown by modal verbs like can, must, might)","zh":"（语言/语法）情态：说话者对事情的可能性、必要性、许可或确定性的态度（常由 can、must、might 等情态动词表达）"},"examples":[{"en":"In 'You must leave now,' the modality expresses strong necessity.","zh":"在“You must leave now”中，情态表达了强烈的必要性。"},{"en":"Using 'might' lowers the modality and sounds less certain.","zh":"使用“might”会降低情态的力度，听起来更不确定。"}]},{"partOfSpeech":"n.","definition":{"en":"(in philosophy/logic) a category describing how a statement is true: possible, necessary, or actual","zh":"（哲学/逻辑）模态：描述命题为真的方式，如可能、必然或现实"},"examples":[{"en":"Modal logic studies necessity and possibility.","zh":"模态逻辑研究必然性与可能性。"}]}],"synonyms":["method","approach","mode","means","type"],"phonetic":"/moʊˈdæləti/","extraExplanation":["词根提示：modality 来自 modal（“情态的/模式的”）。在一般写作里，它常指“方式/类型”（如治疗方式、教学方式）；在语言学里，它更专指“说话者态度/语气强度”（如 must 比 might 更强）。","常见搭配：a modality of communication（交流方式）、treatment modalities（治疗方式，医学里很常见）、learning modalities（学习方式）。"]}
{"word":"modalize","summary":{"en":"“Modalize” means to express or rewrite a statement using modal meaning (possibility, necessity, obligation, etc.), often to sound less direct or less certain.","zh":"“Modalize”指用情态意义（可能、必然、义务等）来表达或改写一句话，常用于让语气更委婉或不那么确定。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Linguistics/logic) To express a statement using a modal verb or modal meaning (such as possibility, necessity, permission, or obligation).","zh":"（语言学/逻辑）用情态动词或情态意义来表达一个陈述（如：可能性、必然性、许可或义务）。"},"examples":[{"en":"The editor asked the writer to modalize the sentence to sound less certain.","zh":"编辑让作者把句子“情态化”，让语气听起来不要那么确定。"},{"en":"In this exercise, you will modalize factual statements with may, might, must, or should.","zh":"在这个练习中，你要用 may、might、must 或 should 把事实陈述改写成情态表达。"},{"en":"Researchers sometimes modalize claims to avoid overstating conclusions.","zh":"研究者有时会用情态表达来弱化断言，避免把结论说得过满。"}]},{"partOfSpeech":"vt.","definition":{"en":"To add a sense of modality to language—making it sound more tentative, polite, indirect, or cautious.","zh":"给语言加入“情态/语气”色彩，使表达更委婉、谨慎、间接或礼貌。"},"examples":[{"en":"Instead of “You are wrong,” she modalized it as “You might be mistaken.”","zh":"她没有说“你错了”，而是用情态化表达：“你可能弄错了。”"},{"en":"Customer service messages are often modalized to sound polite: “Could you please…?”","zh":"客服话术常常会情态化以显得礼貌：“Could you please…?”"}]}],"synonyms":["add modality","hedge","qualify","express in modal terms","soften"],"phonetic":"ˈmoʊdəˌlaɪz","extraExplanation":["“modalize”主要出现在语言学、语用学、逻辑或写作分析中，日常口语里不算常见。它强调把一句话从“直接断言”变成带有“可能/必须/应该/允许”等态度的表达。","常见的情态资源包括：情态动词（may/might/must/should/can/could/would）、副词（probably/possibly）、以及委婉句式（It seems that… / There is a chance that…）。"]}
{"word":"modally","summary":{"en":"Modally means “in terms of a mode or modality,” often used in grammar (modal meaning) or modal logic (necessity/possibility).","zh":"modally 表示“从模式/情态的角度来说”，常用于语法（情态意义）或情态逻辑（必然/可能）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a particular mode or method; according to a mode.","zh":"以某种“模式/方式”而言；按照某种方式（mode）来。"},"examples":[{"en":"The software is designed modally, so each tool works in its own mode.","zh":"这个软件按“模式”来设计，因此每个工具都在各自的模式下运行。"},{"en":"We can describe the system modally—by focusing on how it behaves in different modes.","zh":"我们可以从模式角度来描述这个系统——关注它在不同模式下的表现。"}]},{"partOfSpeech":"adv.","definition":{"en":"With respect to modality, especially in grammar (modal verbs) or meaning (possibility/necessity).","zh":"从“情态”（modality）的角度，尤指语法中的情态动词或意义上的“可能/必要”等。"},"examples":[{"en":"The sentence is marked modally by the word “might,” which shows uncertainty.","zh":"这句话通过“might”体现情态，表达不确定性。"},{"en":"Some languages express tense less clearly but express meaning modally in rich ways.","zh":"有些语言对时态表达不那么明确，但在情态意义上表达得很丰富。"}]},{"partOfSpeech":"adv.","definition":{"en":"In modal logic: in terms of necessity and possibility (often using operators like ◻ ‘necessarily’ and ◇ ‘possibly’).","zh":"在情态逻辑中：从“必然/可能”的角度来（常用符号如 ◻ ‘必然’、◇ ‘可能’）。"},"examples":[{"en":"The claim is not true outright, but it may be true modally—possibly true in some situations.","zh":"这个断言并非直接为真，但在情态意义上可能为真——在某些情境下“可能”为真。"},{"en":"Philosophers often analyze statements modally to separate what is necessary from what is merely possible.","zh":"哲学家常用情态方式分析陈述，以区分“必然”为真和“仅仅可能”为真。"}]}],"synonyms":["in a modal way","by mode","in terms of modality","from a modal perspective"],"phonetic":"/ˈmoʊd(ə)li/","extraExplanation":["“modally”来自形容词“modal”（情态的/模式的）加副词后缀“-ly”。因此它常见于较正式或学术语境。","在英语语法里，“modally”常与情态动词相关，如 can/could, may/might, must, should, will/would，用来表达能力、许可、可能性、义务、推测等情态意义。","在日常口语中，人们更常直接说“in a modal way / in terms of mode / from a modal perspective”，而“modally”更常见于语言学、逻辑学、音乐理论或技术文档。"]}
{"word":"modder","summary":{"en":"A modder is someone who creates or uses software/game modifications (mods).","zh":"modder 指制作或使用（软件/游戏）修改内容（mod/模组）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes or uses a “mod” (a modification) for a video game, app, or other software—often changing graphics, characters, rules, or features.","zh":"（软件/游戏）模组作者；做或使用“mod（修改内容/模组）”的人，常用来改变画面、角色、规则或功能。"},"examples":[{"en":"The modder added new missions to the game.","zh":"这位模组作者给游戏加了新的任务。"},{"en":"Some modders fix bugs faster than official updates.","zh":"有些模组作者修复漏洞的速度比官方更新还快。"},{"en":"She became a well-known modder in the Skyrim community.","zh":"她在《上古卷轴5：天际》的社区里成了很有名的模组作者。"}]}],"synonyms":["mod creator","mod maker","mod developer"],"phonetic":"/ˈmɑdɚ/","extraExplanation":["“modder”来自“mod（modification 的缩写，意为‘修改/改造’）+ -er（做某事的人）”。常见于游戏文化：modder 可能制作新皮肤、地图、剧情，甚至把游戏机制大改。","语气上多为中性或正面，强调创作与社区贡献；但在某些语境里也可能和“破解/作弊”被混淆。想表达合法的创作，常搭配：community modder（社区模组作者）、modding tools（模组制作工具）。"]}
{"word":"mode","summary":{"en":"Mode most commonly means a way something works or is set to operate (especially in tech), and it can also mean a verb mood in grammar.","zh":"Mode最常指“模式/运行方式（尤其在科技语境）”，也可指语法中的“语气”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A way or method of doing something; a particular style of operation or behavior.","zh":"方式；方法；运作/行为的模式。"},"examples":[{"en":"The app has a dark mode that’s easier on the eyes at night.","zh":"这个应用有深色模式，晚上看起来更不伤眼。"},{"en":"The machine runs in automatic mode most of the time.","zh":"这台机器大部分时间在自动模式下运行。"}]},{"partOfSpeech":"n.","definition":{"en":"In grammar and linguistics, the form of a verb that shows the speaker’s attitude, purpose, or level of certainty (for example, indicative, imperative, subjunctive).","zh":"（语法/语言学）语气：动词形式用来表达说话者的态度、目的或确定程度（如陈述语气、祈使语气、虚拟语气）。"},"examples":[{"en":"English uses the imperative mode for commands like “Close the door.”","zh":"英语用祈使语气来表达命令，比如“Close the door.”（把门关上。）"}]},{"partOfSpeech":"n.","definition":{"en":"A temporary fashion or trend in music, art, or behavior.","zh":"（较不常用）一时的风尚；潮流。"},"examples":[{"en":"That hairstyle was the mode in the early 2000s.","zh":"那种发型在 2000 年代初很流行。"}]}],"synonyms":["method","way","setting","state","mood (grammar)"],"phonetic":"/moʊd/","extraExplanation":["“mode”在日常科技语境里非常常见，常与功能开关搭配使用，如“airplane mode（飞行模式）”“silent mode（静音模式）”“sleep mode（睡眠模式）”。这里的“mode”更接近“状态/设置选项”。","词源来自拉丁语“modus”，意思是“度量、方式”。因此它常带有“按某种方式运作”的感觉。"]}
{"word":"model","summary":{"en":"Model can mean a simplified representation (like a bridge model), a person who poses for art or fashion, an example to copy (a role model), or the act of creating/showing these.","zh":"model 可以指“模型（简化的代表）”、 “模特”、 “榜样/范例”，也可作动词表示“建模”或“展示（走秀/摆拍）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A representation of something (often smaller or simpler than the real thing), used to explain, test, or show how it works.","zh":"（常比真实事物更小或更简化的）模型；用来解释、测试或展示事物如何运作的代表性形式。"},"examples":[{"en":"The students built a model of a bridge to test its strength.","zh":"学生们做了一个桥的模型来测试它的强度。"},{"en":"This model shows how the solar system moves.","zh":"这个模型展示了太阳系如何运动。"}]},{"partOfSpeech":"n.","definition":{"en":"A person whose job is to show clothes, products, or poses for photos, art, or advertising.","zh":"模特；以展示服装、产品或姿势为工作的拍摄/绘画对象。"},"examples":[{"en":"She worked as a model for a local clothing brand.","zh":"她为一家本地服装品牌做模特。"},{"en":"The artist asked his friend to be the model for the painting.","zh":"画家请朋友当这幅画的模特。"}]},{"partOfSpeech":"n.","definition":{"en":"An example or pattern to copy; an ideal standard of behavior or quality.","zh":"榜样；范例；可供模仿的标准（行为或品质）。"},"examples":[{"en":"He is a model student who always does his homework.","zh":"他是个模范学生，总是按时完成作业。"},{"en":"The company tries to be a model of good customer service.","zh":"这家公司努力成为优质客户服务的典范。"}]},{"partOfSpeech":"v.","definition":{"en":"To create a model (a simplified representation) of something, often to understand or predict it.","zh":"建模；用模型来表示某事物（常用于理解或预测）。"},"examples":[{"en":"Scientists model climate patterns to predict future changes.","zh":"科学家通过气候模型来预测未来变化。"}]},{"partOfSpeech":"v.","definition":{"en":"To show or present something by posing, especially clothing for others to see.","zh":"（尤指穿着衣服）展示、走秀；摆姿势供人观看。"},"examples":[{"en":"He modeled the new jacket in the store window.","zh":"他在橱窗里展示那件新夹克。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something that is an excellent example to follow; exemplary.","zh":"模范的；典范的；值得效仿的。"},"examples":[{"en":"She gave a model answer to the interview question.","zh":"她对面试问题给出了标准范例式的回答。"}]}],"synonyms":["example","pattern","prototype","representation","role model"],"phonetic":"/ˈmɑdəl/","extraExplanation":["“model”在学术和科技语境中很常见，比如“statistical model（统计模型）”“business model（商业模式）”“role model（榜样）”。这些用法的核心都是“用来理解/解释/模仿的模式或代表”。","在文学或日常表达中，“a model of + 名词”常表示“……的典范”，例如：a model of patience（耐心的典范）。"]}
{"word":"modeled","summary":{"en":"“Modeled” is the past form of “model,” meaning shaped/created or based on an example; it can also describe items shown by someone wearing them.","zh":"“modeled” 是 “model” 的过去式/过去分词，表示塑造、建模或以某范例为蓝本；也可作形容词，指由人穿戴展示的商品。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of model: to make a model of something; to shape or form something; to plan or build something based on a model or example.","zh":"model 的过去式和过去分词：制作模型；塑造/形成；以某个范例为蓝本来设计或建立。"},"examples":[{"en":"The architect modeled the new library using 3D software.","zh":"建筑师用 3D 软件为新图书馆建模。"},{"en":"Her teaching style was modeled on her mentor’s approach.","zh":"她的教学风格以导师的方法为蓝本。"},{"en":"The clay was modeled into a small bird.","zh":"黏土被塑造成一只小鸟。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of clothes, jewelry, etc.) shown by someone who is wearing them.","zh":"（衣服、首饰等）由某人穿戴并展示的。"},"examples":[{"en":"The website shows modeled dresses so you can see the fit.","zh":"网站展示了模特穿着的连衣裙，方便你看版型。"},{"en":"Modeled shoes often look different than shoes photographed alone.","zh":"模特上脚展示的鞋子常常与单独拍摄的效果不同。"}]}],"synonyms":["shaped","formed","fashioned","based on","simulated","posed in"],"phonetic":"/ˈmɑdəld/","extraExplanation":["美式英语通常拼作 modeled；英式英语常见拼作 modelled（双写 l）。两者意思相同，只是拼写习惯不同。"]}
{"word":"modeler","summary":{"en":"Modeler usually means a person who builds or uses models (scientific, financial, data, or 3D), not a fashion model.","zh":"Modeler 通常指“做模型/建模的人”（科学、金融、数据或3D等领域），一般不指时尚模特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes or uses models (for example, a scientist, engineer, or designer who builds simplified representations to understand or predict something)","zh":"建模者；制作或使用模型的人（例如科学家、工程师或设计师，用简化的模型来理解或预测事物）"},"examples":[{"en":"The climate modeler tested different scenarios to predict future temperatures.","zh":"气候建模者测试了不同情景来预测未来气温。"},{"en":"As a financial modeler, she builds spreadsheets to estimate a company’s value.","zh":"作为金融建模者，她会建立电子表格来估算公司的价值。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who creates 3D models for games, animation, or visual effects (also written as 3D modeler)","zh":"三维建模师（为游戏、动画或影视特效制作3D模型的人，也常写作 3D modeler）"},"examples":[{"en":"The studio hired a 3D modeler to design realistic characters.","zh":"工作室聘请了一位三维建模师来设计逼真的角色。"},{"en":"A good modeler pays attention to shape, proportion, and detail.","zh":"优秀的建模师会关注形状、比例和细节。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who makes statistical or machine-learning models to analyze data and make predictions","zh":"统计/机器学习建模人员（用数据建立统计或机器学习模型进行分析与预测的人）"},"examples":[{"en":"The data modeler cleaned the dataset before training the model.","zh":"数据建模人员在训练模型前先清洗了数据。"},{"en":"Modelers often evaluate accuracy using a test set.","zh":"建模人员常用测试集来评估准确率。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who models clay, wax, or other materials into shapes (especially in art or sculpture)","zh":"塑形者；捏塑者（把黏土、蜡等材料塑造成形，常见于艺术或雕塑）"},"examples":[{"en":"The artist is a skilled modeler who can shape clay quickly.","zh":"这位艺术家是一名熟练的塑形者，能很快把黏土捏出形。"},{"en":"In sculpture class, each modeler created a small bust.","zh":"在雕塑课上，每位塑形者都制作了一个小胸像。"}]}],"synonyms":["model maker","3D artist","simulator (context-specific)","analyst (context-specific)"],"phonetic":"/ˈmɑːdələr/","extraExplanation":["“modeler”在美式英语里更常写作“modeler”（英式拼写常见“modeller”）。","如果你指“走秀/拍照的模特”，英语通常说“model”，而不是“modeler”。“modeler”强调“做模型/建模的人”。","常见搭配：financial modeler（金融建模师）、data modeler（数据建模人员/数据建模师）、climate modeler（气候建模者）、3D modeler（三维建模师）。"]}
{"word":"modelers","summary":{"en":"“Modelers” means people who model for art/ads, people who build physical/3D models, or specialists who create scientific/data models—depending on context.","zh":"“Modelers”是“modeler”的复数，可指模特、模型制作人/3D建模人员，或建立科学/数据模型的专业人士，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to show clothes, products, or poses for photos, art, or advertising (plural of “modeler/modeler”).","zh":"（modeler 的复数）指以展示服装、产品或姿势为工作的人，用于摄影、艺术或广告。"},"examples":[{"en":"The brand hired several modelers for the new clothing campaign.","zh":"这个品牌为新的服装宣传活动雇了几位模特。"},{"en":"Art modelers need to hold a pose for a long time.","zh":"人体写生模特需要长时间保持一个姿势。"}]},{"partOfSpeech":"n.","definition":{"en":"People who build or create models, such as miniature airplanes, architecture models, or 3D designs (plural of “modeler”).","zh":"（modeler 的复数）指制作“模型”的人，比如微缩飞机模型、建筑模型或3D设计模型。"},"examples":[{"en":"The museum invited modelers to display miniature trains.","zh":"博物馆邀请模型制作爱好者来展示微缩火车。"},{"en":"Architectural modelers created a scale model of the new campus.","zh":"建筑模型师制作了新校区的比例模型。"}]},{"partOfSpeech":"n.","definition":{"en":"In tech and science, people who create mathematical, statistical, or computer models to describe or predict real-world behavior (plural of “modeler”).","zh":"在科技或科学领域中，指建立数学、统计或计算机模型，用来描述或预测现实情况的人。"},"examples":[{"en":"Climate modelers study how temperature might change over time.","zh":"气候建模人员研究气温可能如何随时间变化。"},{"en":"Data modelers worked with engineers to improve the prediction system.","zh":"数据建模师与工程师合作改进预测系统。"}]}],"synonyms":["models","model makers","builders","3D artists","data modelers","simulators"],"phonetic":"/ˈmɑːdəlɚz/","extraExplanation":["“modelers”是“modeler”的复数。英语里更常见的拼写是“modeler”（美式）；英式有时写作“modeller / modellers”。","语境很关键：在时尚/艺术里常接近“models（模特）”；在手工/工程里更像“model builders（模型制作人）”；在数据/科学里常见搭配是“data modelers / climate modelers”。"]}
{"word":"modeless","summary":{"en":"Modeless means “not tied to a fixed mode,” especially in computing/UI design—often describing tools or dialogs that don’t block other actions.","zh":"Modeless 意为“无模式的、非模态的”，常用于计算机/界面设计中，指不把用户锁定在某个模式里（例如不会阻塞其他操作的窗口或工具）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(computing) Able to work or run without a graphical interface, typically by using text commands (for example, in a command-line environment).","zh":"（计算机）无界面的；通常指不通过图形界面，而通过文本命令（如命令行环境）来运行或操作。"},"examples":[{"en":"The server is running in a modeless environment, so you manage it through the terminal.","zh":"这台服务器运行在无界面环境中，所以你需要通过终端来管理。"},{"en":"Some tools offer a modeless mode for faster keyboard-based control.","zh":"有些工具提供无界面模式，方便更快地用键盘操作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(general) Not limited to one fixed mode or state; not “mode-based.”","zh":"（一般）不受单一固定模式或状态限制的；非“模式化”的。"},"examples":[{"en":"A modeless workflow lets you switch tasks without changing settings first.","zh":"无模式的工作流让你无需先切换设置就能转换任务。"},{"en":"The app aims for a modeless design so actions feel continuous.","zh":"这个应用追求无模式设计，让操作感觉更连贯。"}]}],"synonyms":["non-modal","unrestricted","unblocked"],"phonetic":"/ˈmoʊdləs/","extraExplanation":["“modeless”常见于人机交互/软件界面设计语境，和“modal（模态的）”相对：modal 常指会“锁定”用户操作的对话框/状态（例如弹窗出现后必须先处理它），而 modeless 强调不会把你困在某个模式里，操作更自由、不中断。","如果你看到的是“modeless dialog（无模式对话框）”，意思是这个窗口打开后，你仍然可以继续操作主窗口（不必先关掉它）。"]}
{"word":"modelessness","summary":{"en":"Modelessness means being mode-free—actions behave consistently without hidden state changes (common in UI design).","zh":"Modelessness 指「無模式性」：不靠隱藏狀態切換來改變操作意義，常見於 UI 設計語境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in user-interface design) the quality of being **modeless**—not having “modes” where the same action means different things depending on a hidden or special state.","zh":"（尤指使用者介面設計）**無模式性**：介面不依賴「模式」這種狀態切換；同一個操作不會因為隱藏/特殊狀態不同而產生不同結果。"},"examples":[{"en":"Good modelessness reduces errors because your keystrokes don’t suddenly change meaning.","zh":"良好的無模式性可以減少錯誤，因為你的按鍵不會突然改變意思。"},{"en":"The app improved modelessness by avoiding tools that trap you in a single editing mode.","zh":"這個 App 透過避免讓你「被困在某個編輯模式」的工具，提升了無模式性。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally: the state of being modeless (not tied to a particular mode).","zh":"更一般地：處於「無模式／不受特定模式限制」的狀態。"},"examples":[{"en":"In this workflow, modelessness lets you switch tasks without closing pop-ups.","zh":"在這個流程中，無模式性讓你不必先關掉彈窗就能切換任務。"}]}],"synonyms":["non-modality","modeless interaction","mode-free design","non-modal interaction"],"phonetic":"/ˈmoʊdləsnəs/","extraExplanation":["詞源結構：mode（模式/狀態）+ -less（無…的）+ -ness（名詞化）。所以 modelessness 字面意思就是「沒有模式的性質」。","在介面設計裡，mode 常指「你不一定看得見、但會改變輸入意義的狀態」。經典例子是某些軟體在不同模式下，同一個按鍵/點擊會做完全不同的事；無模式性強調讓操作意義更一致、可預測。","別和“modal / modeless dialog（模態/非模態對話框）”混淆：模態對話框通常會阻止你操作其他部分；非模態對話框不會把你卡住，通常被視為提升無模式性的做法之一。"]}
{"word":"modeling","summary":{"en":"Modeling most often means creating a simplified model to understand or predict something; it can also mean working as a fashion model or demonstrating behavior as an example.","zh":"Modeling 最常指“建模”（用模型理解或预测事物）；也可指“做模特”或“示范行为/树立榜样”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of creating a model (a simplified representation) to explain, test, or predict how something works","zh":"建模；用简化的“模型”来解释、测试或预测事物如何运作的过程"},"examples":[{"en":"Scientists use climate modeling to predict future temperatures.","zh":"科学家用气候建模来预测未来气温。"},{"en":"In business, modeling can help estimate costs and profits.","zh":"在商业中，建模可以帮助估算成本和利润。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity of working as a fashion model (showing clothes, posing for photos, etc.)","zh":"模特工作；（时尚行业中）走秀、拍摄等工作"},"examples":[{"en":"She started modeling in college to earn extra money.","zh":"她大学时开始做模特来赚些外快。"},{"en":"He’s modeling for a sportswear brand this season.","zh":"这季他在为一个运动服品牌做模特。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of showing a good example so that others can learn from it","zh":"示范；通过自身行为作榜样，让别人学习"},"examples":[{"en":"Parents’ modeling of respectful language shapes children’s habits.","zh":"父母示范尊重的语言会影响孩子的习惯。"},{"en":"The teacher focused on modeling how to write a clear topic sentence.","zh":"老师重点示范了如何写出清晰的主题句。"}]}],"synonyms":["model building","simulation","representation","fashion modeling","demonstration","role-modeling"],"phonetic":"/ˈmɑd(ə)lɪŋ/","extraExplanation":["“modeling”来自“model（模型/模特/榜样）”。在不同语境里含义差很大：\n- 科学/工程/数据领域：常指用数学、统计或计算机来“建模”，如 mathematical modeling, statistical modeling, 3D modeling。\n- 时尚行业：modeling 指“当模特”。\n- 教育/心理学：modeling 指“示范行为”，常见于课堂教学或行为训练。","常见搭配：\n- data/modeling：predictive modeling（预测建模）, risk modeling（风险建模）, machine-learning modeling（机器学习建模）\n- 设计/影视：3D modeling（三维建模）, character modeling（角色建模）\n- 教育：behavior modeling（行为示范）, role modeling（榜样作用）"]}
{"word":"modelings","summary":{"en":"“Modelings” usually means multiple types/examples of modeling (often in technical writing). In everyday English, “modeling” is more common.","zh":"“modelings”通常指多种/多个“建模（modeling）”的类型或实例（多见于技术语境）；日常英语更常用“modeling”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Different acts, examples, or types of **modeling** (creating or using a model to represent something).","zh":"（复数）不同的**建模/模型化**行为、实例或类型（用模型来表示或模拟某事物）。"},"examples":[{"en":"The paper compares several **modelings** of the same system to see which predicts best.","zh":"这篇论文比较了同一系统的几种**建模方式**，看哪一种预测效果最好。"},{"en":"Engineers tested two **modelings** of the bridge before choosing a final design.","zh":"工程师在选定最终设计前测试了这座桥的两种**建模方案**。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Activities where someone works as a fashion or commercial model; **modeling jobs**.","zh":"（复数）从事时尚或商业模特的活动；**模特工作**（较少见的复数表达）。"},"examples":[{"en":"Her early **modelings** led to opportunities in advertising.","zh":"她早期的一些**模特工作**让她获得了广告机会。"},{"en":"He listed his past **modelings** on his portfolio website.","zh":"他在作品集网站上列出了自己过去的**模特经历**。"}]},{"partOfSpeech":"n.","definition":{"en":"The **-ing** form of **model** used as a noun: the process of building a representation (e.g., 3D modeling, data modeling). In modern English this is usually written as **modeling** (without -s).","zh":"动词 **model** 的 **-ing** 名词用法：指建立某种表示/模拟的过程（如 3D 建模、数据建模）。现代英语里通常写作 **modeling**（一般不加 -s）。"},"examples":[{"en":"**Modeling** helps us understand how a disease might spread.","zh":"**建模**能帮助我们理解疾病可能如何传播。"},{"en":"She enjoys **3D modeling** for games.","zh":"她喜欢为游戏做**3D 建模**。"}]}],"synonyms":["modeling","modelling","simulation","representation","3D modeling","data modeling"],"phonetic":"ˈmɑdəlɪŋz","extraExplanation":["“modelings”在日常英语中不算常见：多数情况下用不可数名词“modeling”（如 data modeling / 3D modeling）。当你想表达“多种建模方法/多个建模实例”时，才可能见到“modelings”。","如果你指“模特（人）”的复数，通常说“models”，而不是“modelings”。例如：Fashion models are walking the runway.","英美拼写差异：美式更常见“modeling”，英式常见“modelling”。但“modelings”两种拼写都相对少见。"]}
{"word":"modelist","summary":{"en":"A modelist is a person who makes models, especially scale models.","zh":"modelist 指“制作模型的人”，尤其是制作比例模型的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes models (especially small or scale models, e.g., airplanes, buildings, prototypes)","zh":"模型制作人员；（尤指制作飞机、建筑等）比例模型的人"},"examples":[{"en":"My uncle is a modelist who builds detailed model airplanes.","zh":"我叔叔是个模型制作爱好者，会做很精细的飞机模型。"},{"en":"The museum hired a modelist to create a scale model of the ancient city.","zh":"博物馆雇了一位模型制作人员来制作那座古城的比例模型。"},{"en":"As a modelist, she often works from engineering drawings and photos.","zh":"作为模型制作人员，她经常根据工程图纸和照片来制作模型。"}]}],"synonyms":["model maker","modeler","scale-model builder"],"phonetic":"/ˈmɑdlɪst/","extraExplanation":["“modelist”在现代英语里不算常见，更常用的说法是“model maker”或“modeler”。在爱好圈（如航模、铁道模型、战争模型等）里会更常见。","注意大小写：首字母大写“Modelist”也可能是品牌/公司名（例如某些3D打印文件管理软件或投资服务机构），这时不再是普通名词“modelist（模型制作人员）”。"]}
{"word":"modelize","summary":{"en":"Modelize means to build or express something as a model, especially in scientific or technical contexts.","zh":"Modelize 指把某事建立成模型或用模型来表述，常用于科学或技术语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to create a simplified representation (a model) of something—often using math, data, or a computer program—to better understand, predict, or explain it","zh":"把某事物建立成（简化的）模型——常用数学、数据或计算机程序来理解、预测或解释它"},"examples":[{"en":"Scientists modelize climate patterns to predict future temperatures.","zh":"科学家把气候模式建立成模型，以预测未来气温。"},{"en":"We need to modelize the customer journey before we change the app design.","zh":"在更改应用设计之前，我们需要把客户旅程建成模型。"}]},{"partOfSpeech":"vt.","definition":{"en":"to express something in the form of a model or set of assumptions (often in academic or technical writing)","zh":"用模型或一组假设来表述某事（常见于学术或技术写作）"},"examples":[{"en":"The paper modelizes decision-making as a trade-off between risk and reward.","zh":"这篇论文把决策过程建模为风险与收益之间的权衡。"}]}],"synonyms":["model","represent","formulate","idealize","simulate"],"phonetic":"/ˈmɑːdəˌlaɪz/","extraExplanation":["“modelize”在美式英语里不如“model”（动词）常见，很多场合用“model”更自然：例如“model the system / model the data”。","拼写上你也可能看到英式拼法“modelise”。在工程、数学、数据科学等语境中，“modelize”更偏正式、偏学术。","和“simulate”不同：modelize强调“建立模型/抽象表示”，simulate强调“用模型去运行/模拟过程”。"]}
{"word":"modell","summary":{"en":"Model can mean a physical copy, an abstract system description, an example to follow, a product version, or the act of demonstrating/posing.","zh":"Model 可以指实体模型、抽象模型（解释/预测）、榜样、产品型号，也可以作动词表示示范/建模或当模特展示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a smaller copy of something (like a building, machine, or system), used to show how it looks or works","zh":"（实体）模型；缩小版，用来展示外观或工作原理"},"examples":[{"en":"The museum has a model of the spaceship.","zh":"博物馆里有一艘宇宙飞船的模型。"},{"en":"We built a model to test the new bridge design.","zh":"我们做了一个模型来测试新的桥梁设计。"}]},{"partOfSpeech":"n.","definition":{"en":"a simple description of how something works, often used in science, math, business, or computers","zh":"（抽象）模型；用来解释或预测事物运作方式的简化描述（常用于科学/数学/商业/计算机）"},"examples":[{"en":"This model predicts how prices may change.","zh":"这个模型可以预测价格可能如何变化。"},{"en":"Scientists use climate models to study future weather patterns.","zh":"科学家用气候模型来研究未来的天气模式。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is an excellent example to copy","zh":"榜样；典范；值得效仿的人或事"},"examples":[{"en":"She is a model of patience.","zh":"她是耐心的典范。"},{"en":"The company became a model for others in the industry.","zh":"这家公司成了行业内其他公司的榜样。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular type or version of a product (often a car, phone, or machine)","zh":"（产品的）型号；款式；版本"},"examples":[{"en":"This phone model has a better camera.","zh":"这个手机型号的相机更好。"},{"en":"We bought the newest model of the washing machine.","zh":"我们买了最新款的洗衣机。"}]},{"partOfSpeech":"vt.","definition":{"en":"to show something by making a copy or example, or by demonstrating how it should be done","zh":"示范；用模型展示；演示（应该如何做）"},"examples":[{"en":"The teacher modeled the correct pronunciation.","zh":"老师示范了正确的发音。"},{"en":"They modeled the new design in 3D software.","zh":"他们在3D软件里建立了新设计的模型。"}]},{"partOfSpeech":"vi.","definition":{"en":"to wear clothes or pose so that people can see them (for photos, art, or fashion)","zh":"当模特；展示服装或摆姿势（用于拍照/艺术/时尚）"},"examples":[{"en":"He models for a local clothing brand.","zh":"他为一家本地服装品牌当模特。"},{"en":"She modeled the dress for the photographer.","zh":"她为摄影师展示了那条裙子。"}]}],"synonyms":["prototype","pattern","example","template","simulation","version"],"phonetic":"/ˈmɑːdəl/","extraExplanation":["你输入的“modell”更像是拼写错误，英文里更常见的是“model”。另外，“Modell/ modell”在德语、瑞典语等语言里就是英文“model”的拼写。"]}
{"word":"modelled","summary":{"en":"“Modelled” is the past tense/past participle of “model,” meaning made a model/simulation, shaped something, or demonstrated behavior as an example (UK spelling).","zh":"“modelled”是“model”的过去式/过去分词，可指建模/模拟、塑形成型，或以身作则作示范（英式拼写）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “model”: to make a copy, plan, or representation of something (often on a smaller scale or in a computer).","zh":"“model”的过去式/过去分词：制作某物的模型或模拟（常为缩小版或电脑模型）。"},"examples":[{"en":"The architect modelled the new museum in 3D software.","zh":"建筑师用3D软件为新博物馆建了模型。"},{"en":"Scientists modelled how the disease might spread.","zh":"科学家模拟了这种疾病可能如何传播。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “model”: to shape or form a material into a particular figure or design.","zh":"“model”的过去式/过去分词：把材料塑形/成型为某种形状或设计。"},"examples":[{"en":"She modelled the clay into a small bowl.","zh":"她把黏土塑成了一个小碗。"},{"en":"The artist modelled the statue’s face with great care.","zh":"艺术家非常细致地塑造了雕像的脸部。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “model”: to behave in a way that others can copy; to demonstrate a good example.","zh":"“model”的过去式/过去分词：以身作则，展示可供他人模仿的行为。"},"examples":[{"en":"The teacher modelled respectful language for the class.","zh":"老师为全班示范了尊重他人的表达方式。"},{"en":"He modelled good teamwork during the project.","zh":"他在项目中示范了良好的团队合作。"}]}],"synonyms":["modeled","represented","simulated","shaped","formed","demonstrated","exemplified"],"phonetic":"/ˈmɑdəld/","extraExplanation":["“modelled”是英式拼写；美式通常写作“modeled”（只写一个l）。两者意思相同。","在学术与职场写作中，“to model”常指“建立模型/进行模拟”（如model a process, model data），不只是“做一个实体模型”。"]}
{"word":"modeller","summary":{"en":"Modeller is a British spelling of modeler: someone who makes or creates models (physical, 3D, or system/data models), and less commonly someone who poses as a model.","zh":"Modeller 是 modeler 的英式拼写：指制作/创建模型的人（实体模型、三维模型或系统/数据模型），较少情况下也可指摆姿势的模特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes models (small copies of things) or designs models, especially for art, engineering, or hobbies","zh":"模型制作者；制作或设计模型的人（常用于艺术、工程或模型爱好）"},"examples":[{"en":"The modeller built a detailed model of the bridge for the museum.","zh":"那位模型制作者为博物馆制作了一个精细的桥梁模型。"},{"en":"She works as a scale modeller and sells her miniature buildings online.","zh":"她是一名比例模型制作者，在网上出售微缩建筑模型。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who models clothing, products, or poses for art (a less common meaning in American English; more common spelling: model)","zh":"模特（在美式英语中较少用这种说法；更常用 model）"},"examples":[{"en":"The artist hired a modeller to pose for the painting.","zh":"画家雇了一位模特为这幅画摆姿势。"}]},{"partOfSpeech":"n.","definition":{"en":"someone (or a software tool) that creates models of systems, data, or 3D objects, especially in computing or science","zh":"建模者；建模工具（尤指计算机、科学中的系统/数据/三维建模）"},"examples":[{"en":"The 3D modeller created the characters for the game.","zh":"那位三维建模师为游戏制作了角色模型。"},{"en":"This modeller helps predict how traffic will change during construction.","zh":"这个建模工具能帮助预测施工期间交通如何变化。"}]}],"synonyms":["modeler","model maker","3D artist","model builder"],"phonetic":"/ˈmɑd(ə)lər/","extraExplanation":["“modeller”多见于英式拼写；美式英语更常写作“modeler”。意思通常不变，只是拼写习惯不同（英式常保留双写 -ll-）。","在科技/职场语境里，“3D modeller”常指三维建模师；而在更日常的语境里，表示“模特”时，美国英语通常直接说“model”。"]}
{"word":"modellers","summary":{"en":"“Modellers” means people who make models or build simulations; it can also mean fashion/photo models, but that meaning is less common in this spelling.","zh":"“modellers”主要指制作模型或进行建模/模拟的人；也可指模特，但用这种拼写表示“模特”较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural noun meaning people who make models, especially for art/design/engineering (such as scale models) or for computer simulations (such as mathematical or 3D models).","zh":"复数名词，指“建模者/模型制作者”：制作模型的人（如比例模型、工程/设计模型），或进行计算机/数学/三维建模与模拟的人。"},"examples":[{"en":"The museum hired modellers to recreate the ancient city in miniature.","zh":"博物馆雇了模型制作者，用微缩模型重现那座古城。"},{"en":"Climate modellers use data to simulate how temperatures might change.","zh":"气候建模人员用数据来模拟气温可能如何变化。"}]},{"partOfSpeech":"n.","definition":{"en":"A plural noun meaning people whose job is to show clothes, products, or poses for art/photography (common spelling: “models”; “modellers” is less common for this meaning).","zh":"复数名词，指“模特”：展示服装、产品或为艺术/摄影摆姿势的人（更常见的拼写是 models；modellers 用作此义较少见）。"},"examples":[{"en":"The photographer worked with two modellers during the shoot.","zh":"摄影师在拍摄时和两位模特合作。"}]}],"synonyms":["modelers","model makers","3D modelers","simulation specialists"],"phonetic":"ˈmɑd(ə)lərz","extraExplanation":["“modellers”是英式拼写（BrE），对应美式更常见的“modelers”。在美国语境里：做模型/建模的人通常写 modelers；职业“模特”更常写 models。","在学术与科技语境中，modellers/modelers 常指“建模人员”（例如 climate modelers、economic modelers、3D modelers），不一定和“模特”有关。"]}
{"word":"modelling","summary":{"en":"Modelling most often means creating or using models to represent something (especially in science/engineering), and it can also mean working as a fashion model.","zh":"Modelling 常指（尤在科学/工程中）通过模型来表示或模拟事物的“建模”，也可指从事时尚广告等“模特工作”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of making or using models (physical or computer) to represent something","zh":"建模；用模型（实体或电脑）来表示某事物的活动"},"examples":[{"en":"Climate modelling helps scientists predict future weather patterns.","zh":"气候建模帮助科学家预测未来的天气模式。"},{"en":"Engineers use computer modelling to test designs before building them.","zh":"工程师用电脑建模在动工前测试设计。"}]},{"partOfSpeech":"n.","definition":{"en":"the work of posing for photos, fashion shows, or advertisements","zh":"（时尚/广告）模特工作；走秀与拍摄"},"examples":[{"en":"She started modelling for a local clothing brand.","zh":"她开始为一家本地服装品牌做模特。"},{"en":"Modelling can involve long hours and frequent travel.","zh":"模特工作可能需要长时间工作并经常出差。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “model”: to show how something should be done, or to create a model of something","zh":"“model”的现在分词：示范；（为…）建模/制作模型"},"examples":[{"en":"The teacher is modelling good pronunciation for the class.","zh":"老师正在给全班示范正确发音。"},{"en":"They are modelling the bridge in 3D software.","zh":"他们正在用3D软件对这座桥进行建模。"}]}],"synonyms":["modeling","simulation","model-making","fashion modeling"],"phonetic":"/ˈmɑdəlɪŋ/","extraExplanation":["英式拼写常见为 modelling（双写 l），美式更常写 modeling（单写 l）。意思通常相同，差别主要是拼写习惯。","在学术与工程语境里，modelling 多指“用简化的方式描述现实系统”，例如数学建模、计算机建模；在娱乐与广告语境里则多指“当模特”。"]}
{"word":"modellingly","summary":{"en":"Modellingly means “in an exemplary, model-like way,” or more rarely “in a way related to building/using a model.”","zh":"modellingly 指“以示范性的、堪为典范的方式”，较少见时也可指“以建模/做模型的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that serves as a model or example; exemplarily.","zh":"以榜样/典范的方式；堪为示范地。"},"examples":[{"en":"She acted modellingly, putting the team’s needs before her own.","zh":"她的行为堪为表率，把团队的需要放在个人之前。"},{"en":"The school responded modellingly to the crisis, communicating clearly and quickly.","zh":"学校对危机的应对很有示范性，沟通清晰而迅速。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to building or using a model (for example, in science, math, design, or fashion).","zh":"以建模/做模型的方式（如在科学、数学、设计或时尚领域）。"},"examples":[{"en":"The problem can be approached modellingly by simulating different outcomes.","zh":"这个问题可以用建模的方法来处理，通过模拟不同结果。"},{"en":"The designer worked modellingly, testing several miniature versions before the final piece.","zh":"设计师以做模型的方式工作，在定稿前测试了好几个微缩版本。"}]}],"synonyms":["exemplarily","model-like","by modeling","in a model way"],"phonetic":"/ˈmɑdəlɪŋli/","extraExplanation":["“modellingly”很少见，更常见的拼写是美式 “modelingly”（少一个 l）。在正式写作中，如果想表达“具有示范性”，更自然的替代说法有：“in an exemplary way / as a model”。如果指“建模的方法”，常用 “through modeling / by modeling”。"]}
{"word":"modellus","summary":{"en":"“Modellus” isn’t a common standard English word; it’s usually a coined/proper name, and many people actually mean “modulus” or “model.”","zh":"“Modellus”不是常见的标准英语词；多为自造词/专名，很多情况下其实想写的是“modulus”或“model”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word in modern English; most often seen as a Latin-looking name (e.g., a brand, a username, or a coined term). In everyday English, people usually mean “modulus” (math) or “model” instead.","zh":"现代英语里很少见、也不算规范的词；更常见于拉丁化的名字（例如品牌名、用户名或自造词）。在日常英语中，人们更可能想表达的是“modulus（模数/模量）”或“model（模型/模特/范例）”。"},"examples":[{"en":"I couldn’t find a standard dictionary entry for “Modellus”; is it a product name or a username?","zh":"我在标准词典里找不到“Modellus”；它是产品名还是用户名？"},{"en":"If you meant the math term, the usual spelling is “modulus.”","zh":"如果你想表达数学术语，通常拼写是“modulus”。"}]}],"synonyms":["modulus","model","prototype","template"],"phonetic":"moʊˈdɛləs","extraExplanation":["“Modellus”看起来像拉丁语风格的造词：词根 model-（模型/范例）+ 拉丁语常见的 -us 结尾，会让它像学名或专有名词。因为缺少稳定的通用用法，它在英语里通常不作为普通词汇讲解。","如果你能告诉我它出现的语境（句子、学科、文章/游戏/品牌），我可以更准确判断它指的是专名、拼写错误，还是某个领域的术语。"]}
{"word":"modelmaker","summary":{"en":"A modelmaker is a person who builds physical models, often for films, design prototypes, or hobbies.","zh":"Modelmaker 指制作实体模型的人，常见于影视布景/道具、设计原型或模型爱好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes models, especially small physical models (for example, of buildings, vehicles, or characters) for display, design testing, film/TV props, or hobbies.","zh":"模型制作者；（尤指）制作实体小型模型的人（如建筑、交通工具、角色模型），用于展示、设计验证、影视道具或兴趣爱好。"},"examples":[{"en":"The studio hired a modelmaker to build miniature sets for the movie.","zh":"片场雇了一位模型制作者，为电影搭建微缩布景。"},{"en":"As a modelmaker, she creates detailed prototypes before the final product is manufactured.","zh":"作为模型制作者，她会在量产前先制作精细的原型。"}]}],"synonyms":["model builder","prototype maker","miniature builder"],"phonetic":"/ˈmɑdəlˌmeɪkɚ/","extraExplanation":["“Modelmaker / model maker”在英美语境里常见于影视特效与道具行业（制作微缩模型、场景模型），也常见于工业设计与工程领域（制作原型与验证模型）。有时也指爱好者做“拼装模型/比例模型”（如飞机、坦克、汽车）。","拼写上既可写作一个词“modelmaker”，也常见分开写作“model maker”；两者含义基本相同。"]}
{"word":"modelmaking","summary":{"en":"Modelmaking is the craft or work of building physical models, often for hobbies, design planning, display, or special effects.","zh":"Modelmaking 指製作實體模型的工藝或工作，常用於興趣嗜好、設計規劃、展示或特效製作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or craft of making models (small or simplified copies of things), such as vehicles, buildings, characters, or prototypes","zh":"模型製作；製作模型的活動或工藝（把事物做成縮小或簡化的模型，如車輛、建築、人物或原型）"},"examples":[{"en":"He got into modelmaking by building plastic airplane kits.","zh":"他從組裝塑膠飛機模型套件開始接觸模型製作。"},{"en":"Modelmaking is useful in design because it helps people test ideas before building the real thing.","zh":"模型製作在設計中很有用，因為它能讓人們在打造實物前先測試想法。"}]},{"partOfSpeech":"n.","definition":{"en":"a field of work in film, theater, architecture, or product design where physical models are built for planning, display, or special effects","zh":"（電影、劇場、建築或產品設計中的）模型製作工作／領域；為規劃、展示或特效而製作實體模型"},"examples":[{"en":"She works in modelmaking for film sets, creating miniature streets and buildings.","zh":"她在電影場景的模型製作部門工作，製作縮小版的街道和建築。"},{"en":"The museum hired a modelmaking team to build a scale model of the city.","zh":"博物館聘請模型製作團隊，做出這座城市的比例模型。"}]}],"synonyms":["model building","model-making","miniature making","prototyping"],"phonetic":"/ˈmɑdəlˌmeɪkɪŋ/","extraExplanation":["「modelmaking」常寫成兩個字「model making」，或用連字號「model-making」。作為名詞時多指「這門技藝／工作」，也可泛指「做模型這件事」。","相關領域常見詞：scale model（比例模型）、miniature（微縮模型）、prototype（原型）、maquette（小型草模／設計模型，藝術與建築常用）。","常見搭配：modelmaking materials（模型材料）、modelmaking tools（模型工具）、modelmaking workshop（模型工作坊）、modelmaking for film/theater（影視／劇場模型製作）。"]}
{"word":"models","summary":{"en":"“Models” can mean people who pose for photos, simplified representations used to explain or predict things, or product types/versions; it can also be the verb form meaning “shows/demonstrates.”","zh":"“Models” 可指模特儿、用于解释/预测的模型，或产品的型号/款式；也可作动词，表示“示范/做榜样”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who show clothes, products, or poses for photos, art, or advertising (plural of “model”)","zh":"模特儿；（为摄影、艺术或广告）展示服装/产品/姿势的人（model 的复数）"},"examples":[{"en":"The brand hired several models for the photo shoot.","zh":"这个品牌为这次拍摄雇了几位模特儿。"},{"en":"Many models start their careers very young.","zh":"很多模特儿很年轻就开始职业生涯。"}]},{"partOfSpeech":"n.","definition":{"en":"simplified representations used to explain, test, or predict something (e.g., scientific or mathematical models)","zh":"模型；（用于解释、测试或预测的）简化表示（如科学模型、数学模型）（model 的复数）"},"examples":[{"en":"Scientists use climate models to study future temperature changes.","zh":"科学家用气候模型来研究未来的气温变化。"},{"en":"These models are helpful, but they can’t capture every detail of real life.","zh":"这些模型很有帮助，但无法涵盖现实生活的每个细节。"}]},{"partOfSpeech":"n.","definition":{"en":"different versions or types of a product, especially a car, phone, or machine (plural of “model”)","zh":"（产品的）型号；款式（尤指汽车、手机或机器）（model 的复数）"},"examples":[{"en":"This phone comes in two models: standard and pro.","zh":"这款手机有两种型号：标准版和专业版。"},{"en":"Older models are usually cheaper.","zh":"较旧的型号通常更便宜。"}]},{"partOfSpeech":"v.","definition":{"en":"to show how something should be done or how someone should behave (third-person singular of “model”)","zh":"示范；做榜样（model 的第三人称单数形式）"},"examples":[{"en":"She models respectful disagreement in meetings.","zh":"她在会议中示范如何有礼貌地表达不同意见。"},{"en":"The teacher models the pronunciation for the class.","zh":"老师为全班示范发音。"}]}],"synonyms":["mannequins","representations","simulations","types","versions","demonstrates","shows"],"phonetic":"/ˈmɑdəlz/","extraExplanation":["“models” 常见有三大语境：时尚/广告里的「模特儿」、科学与统计里的「模型」、消费品里的「型号/款式」。遇到句子时可用线索判断：有 photo shoot / runway 多半是模特；有 predict / simulate / data 多半是科学模型；有 phone / car / version 多半是产品型号。"]}
{"word":"Modem","summary":{"en":"A modem is a device (or sometimes a function) that converts signals to connect your network to the internet.","zh":"Modem 指“调制解调器”，用于转换信号，把你的网络接入互联网（有时也可作动词指进行调制解调传输）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that connects your home or office network to the internet service provider (ISP) by converting signals between your local network and the phone/cable/fiber line.","zh":"调制解调器：一种把你的家庭/办公室网络连接到互联网服务提供商（ISP）的设备，通过在本地网络与电话线/有线电视线/光纤线路之间转换信号来实现上网。"},"examples":[{"en":"The internet is down—try restarting the modem.","zh":"网络断了——试着重启一下调制解调器。"},{"en":"Our cable modem supports faster download speeds.","zh":"我们的有线调制解调器支持更快的下载速度。"},{"en":"The modem connects to the wall, and the router shares Wi‑Fi in the house.","zh":"调制解调器连墙上的线路，路由器在家里分发 Wi‑Fi。"}]},{"partOfSpeech":"v.","definition":{"en":"To transmit data by converting digital information into signals suitable for a communication line (and back again).","zh":"调制解调：把数字信息转换成适合通信线路传输的信号（并在接收端再转换回来）；用调制解调方式传输数据。"},"examples":[{"en":"Early computers used phone lines to modem data.","zh":"早期的电脑用电话线通过调制解调来传输数据。"},{"en":"The device modems the signal before sending it across the line.","zh":"设备在把信号沿线路发送之前会先进行调制解调处理。"}]}],"synonyms":["modulator-demodulator","cable modem","DSL modem","fiber modem (ONT)"],"phonetic":"/ˈmoʊdəm/","extraExplanation":["“modem”来自“modulator-demodulator”的缩写，中文常译为“调制解调器”。","日常口语里常把“modem（猫）”和“router（路由器）”混着叫，但严格来说：modem 负责“接入运营商线路”，router 负责“把网络分给多台设备（含 Wi‑Fi）”。很多一体机把两者合在一起。","上世纪90年代常见的“拨号上网（dial-up）”就是通过电话线的 modem 连接互联网，会发出典型的“拨号声音”。"]}
{"word":"modem","summary":{"en":"A modem is the device that connects you to the internet by converting data into transmittable signals (and back).","zh":"Modem（调制解调器）是通过信号转换来把设备连接到互联网的上网设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that connects your computer or local network to the internet by converting digital data to signals that can travel over phone/cable/fiber lines (and back)","zh":"调制解调器：一种把数字数据转换成可在电话线/有线电视线/光纤等线路上传输的信号（并再转换回来）的设备，用于让电脑或局域网连接互联网"},"examples":[{"en":"Our modem stopped working, so we couldn’t get online.","zh":"我们的调制解调器坏了，所以没法上网。"},{"en":"You may need a new modem if you upgrade your internet plan.","zh":"如果你升级网速套餐，可能需要换一个新的调制解调器。"},{"en":"The technician replaced the modem and the connection became stable.","zh":"技术员换了调制解调器后，网络连接就稳定了。"}]},{"partOfSpeech":"v.","definition":{"en":"to send or receive data by using a modem; to convert data into signals suitable for transmission","zh":"（用调制解调器）调制/解调；通过调制解调器发送或接收数据"},"examples":[{"en":"Early computers modemed data over telephone lines.","zh":"早期的电脑通过电话线用调制解调器传输数据。"},{"en":"The system modems the signal before sending it over the line.","zh":"系统在把信号发到线路上之前会先进行调制处理。"}]}],"synonyms":["modulator-demodulator","internet modem","gateway (when combined with a router)"],"phonetic":"/ˈmoʊdəm/","extraExplanation":["“modem”来自“modulator-demodulator”（调制器-解调器）的缩写，所以中文常译为“调制解调器”。","日常家用网络里常把“modem”和“router（路由器）”混用：modem负责“接入运营商线路”，router负责“把网络分给多台设备并提供Wi‑Fi”。很多家庭用的是二合一设备（网关/gateway）。"]}
{"word":"modeming","summary":{"en":"“Modeming” isn’t a standard word; you likely mean “modem.”","zh":"“modeming”不是标准用词；你可能想写“modem（调制解调器）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or misspelled form; “modeming” is not a common English word. People usually mean “modem” (a device for connecting to the internet) or “modem-ing” (rare: using a modem).","zh":"非标准或拼写错误形式；“modeming”不是常见英语单词。通常人们想写的是“modem”（调制解调器，用于连接互联网），或很少见的“modem-ing”（用调制解调器上网）。"},"examples":[{"en":"I think you meant “modem.” My router is connected to the modem.","zh":"我觉得你想写的是“modem”。我的路由器连接着调制解调器。"},{"en":"“Modeming” isn’t commonly used; we usually say “using a modem.”","zh":"“modeming”不常用；我们通常说“using a modem（使用调制解调器）”。"}]}],"synonyms":["modem","router (related)","gateway (related)"],"phonetic":"/ˈmoʊdəm/","extraExplanation":["“modem”来自“modulator-demodulator（调制器-解调器）”的缩写，用来把电脑/网络信号与电话线、有线电视或光纤网络等传输方式之间进行转换。日常使用中常见搭配是：cable modem（有线调制解调器）、DSL modem（数字用户线调制解调器）、modem/router（调制解调器/路由器一体机）。"]}
{"word":"modems","summary":{"en":"“Modems” is the plural of “modem,” a device that connects you to the internet by converting data into signals and back.","zh":"“modems”是“modem”的复数，指调制解调器：通过把数据与信号相互转换来连接互联网的设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that connects a computer or router to the internet by converting digital data into signals that can travel over a phone line, cable line, fiber network, or cellular network (and back again).","zh":"调制解调器：一种把数字数据转换成可在电话线、有线电视线、光纤网络或蜂窝网络中传输的信号（并再转换回来）的设备，用来让电脑或路由器连接互联网。"},"examples":[{"en":"Our internet stopped working because the modem lost its signal.","zh":"我们的网络断了，因为调制解调器丢失了信号。"},{"en":"The technician replaced the old modem with a faster one.","zh":"技术人员把旧的调制解调器换成了更快的。"},{"en":"In many homes, the modem connects to the router with an Ethernet cable.","zh":"在很多家庭里，调制解调器用网线连接到路由器。"}]}],"synonyms":["modem-router (combo)","cable modem","DSL modem","cellular modem","ONT (fiber terminal)"],"phonetic":"/ˈmoʊdəmz/","extraExplanation":["“modem”来自“modulator-demodulator（调制器-解调器）”的缩写，核心意思就是“把信息调制成可传输的信号，再解调回数据”。","日常口语里人们有时会把“modem”和“router（路由器）”混用；但严格说：modem 负责“连上运营商网络”，router 负责“把网络分给多台设备并管理 Wi‑Fi”。很多运营商提供的是二合一的“modem-router”。"]}
{"word":"modena","summary":{"en":"Modena is a city in northern Italy; in food, it can also refer to Modena’s famous balsamic vinegar.","zh":"Modena 指意大利北部城市摩德纳；在美食语境中也可指摩德纳著名的香醋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northern Italy (Emilia-Romagna), known for its historic center, food culture, and car-making heritage.","zh":"意大利北部（艾米利亚-罗马涅大区）的一座城市，以历史城区、美食文化与汽车工业传统闻名。"},"examples":[{"en":"Modena is famous for traditional balsamic vinegar.","zh":"摩德纳以传统香醋闻名。"},{"en":"She studied music near Modena, where Luciano Pavarotti was born.","zh":"她在摩德纳附近学习音乐，那里是卢恰诺·帕瓦罗蒂的出生地。"},{"en":"We spent a day in Modena visiting museums and cafés.","zh":"我们在摩德纳逛了一天，参观博物馆、去咖啡馆。"}]},{"partOfSpeech":"n.","definition":{"en":"(in food context) short for “Aceto Balsamico Tradizionale di Modena,” a protected traditional balsamic vinegar associated with Modena.","zh":"（美食语境）“摩德纳传统香醋”（Aceto Balsamico Tradizionale di Modena）的简称，一种与摩德纳相关、受保护的传统香醋。"},"examples":[{"en":"Drizzle a little Modena balsamic over strawberries.","zh":"在草莓上淋一点摩德纳香醋。"},{"en":"This recipe uses Modena-style balsamic for a sweet-sour finish.","zh":"这道菜用摩德纳风味香醋来做出酸甜的收尾。"}]}],"synonyms":["the city of Modena","Modena balsamic (vinegar)","Modenese (adj., related word)"],"phonetic":"/moʊˈdeɪnə/","extraExplanation":["“Modena”在英语里通常读作 /moʊˈdeɪnə/，重音在第二个音节（-DAY-）。中文常译为“摩德纳”。","在文化联想上，Modena 常让人想到意大利“汽车谷”（如跑车品牌与相关博物馆/工厂）、歌剧与美食（尤其是香醋、意面等）。","如果你在菜单或食谱里看到 “Modena”，往往是在说“摩德纳香醋/摩德纳风味香醋”；正式名称可能更长，包装上也常见意大利语标注。"]}
{"word":"modenese","summary":{"en":"Modenese means “from Modena, Italy” or “a person from Modena.”","zh":"Modenese 表示“来自意大利摩德纳的；摩德纳人/居民”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is from Modena (a city in northern Italy), or who lives there","zh":"摩德纳（意大利北部城市）人；摩德纳居民"},"examples":[{"en":"Luciano Pavarotti was a famous Modenese singer.","zh":"卢恰诺·帕瓦罗蒂是一位著名的摩德纳人歌唱家。"},{"en":"She met a Modenese student while studying in Italy.","zh":"她在意大利留学时认识了一位摩德纳学生。"}]},{"partOfSpeech":"adj.","definition":{"en":"from Modena; relating to Modena, Italy","zh":"摩德纳的；与意大利摩德纳有关的"},"examples":[{"en":"They tried Modenese food and local cheeses.","zh":"他们品尝了摩德纳风味的食物和当地奶酪。"},{"en":"He is researching Modenese history and culture.","zh":"他正在研究摩德纳的历史与文化。"}]}],"synonyms":["of Modena","from Modena"],"phonetic":"/ˌmoʊdəˈniːz/","extraExplanation":["你输入的是“modenese”。更常见的写法是 **Modenese**（首字母大写），因为它通常是表示“某地的人/某地的”的专名形容词/名词（demonym）。","词尾 **-ese** 很常见，用来构成“某地的/某地人”，类似 **Japanese（日本的/日本人）**、**Portuguese（葡萄牙的/葡萄牙人）**。","在语境里，Modenese 也可能指与摩德纳相关的事物，比如“Modenese dialect（摩德纳方言）”或某些以摩德纳命名的地方与物种；具体含义要看上下文。"]}
{"word":"moder","summary":{"en":"“moder” most often means an online moderator (informal). It can also refer to the Moder River in France or a humus type in soil science.","zh":"“moder”最常见是指网络社区的版主／管理员（非正式）。它也可以指法国的 Moder 河，或土壤学中的一种腐殖质类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, online) A moderator; someone who enforces rules and manages posts or users in an online community.","zh":"（非正式，网络用语）版主／管理员；在网络社区中负责管理发帖、执行规则的人。"},"examples":[{"en":"Ask a moder if you’re not sure whether your post follows the rules.","zh":"如果你不确定帖子是否符合规则，可以问一下 moder（版主）。"},{"en":"The moder removed spam and warned repeat offenders.","zh":"版主删除了垃圾内容，并警告了屡次违规的人。"}]},{"partOfSpeech":"n.","definition":{"en":"Moder: a river in northeastern France that flows to the Rhine.","zh":"Moder：法国东北部的一条河流，流入莱茵河。"},"examples":[{"en":"The Moder is a tributary of the Rhine in northeastern France.","zh":"Moder 是法国东北部汇入莱茵河的一条支流。"}]},{"partOfSpeech":"n.","definition":{"en":"moder (soil science): a type of forest-floor humus, intermediate between “mor” and “mull.”","zh":"（土壤学）moder：一种森林地表腐殖质类型，介于 mor 与 mull 之间。"},"examples":[{"en":"In some forests, moder forms under conditions that slow down decomposition.","zh":"在一些森林里，分解较慢的条件下会形成 moder 这种腐殖质层。"}]}],"synonyms":["moderator","mod (informal)"],"phonetic":"/ˈmoʊdər/","extraExplanation":["“moder”在标准英语里不算常用词；在论坛、Discord、游戏社区里更常见，通常是“moderator”的口语缩写。更常见的缩写其实是“mod”。","如果指法国那条河，通常要大写成“Moder”（专有名词）；而表示腐殖质类型时一般小写“moder”。"]}
{"word":"moderant","summary":{"en":"Moderant (rare) means something or someone that moderates—makes things less extreme or more balanced.","zh":"moderant（较罕见）指“起调节/缓和作用的人或事物”，使情况不那么极端、更平衡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something (or someone) that moderates—i.e., makes something less extreme, less intense, or more balanced","zh":"起调节作用的事物（或人）；使事情不那么极端、更平衡的因素/角色"},"examples":[{"en":"A good night’s sleep can be a moderant for stress.","zh":"充足的睡眠可以成为缓解压力的“调节因素”。"},{"en":"In a heated meeting, humor sometimes acts as a moderant.","zh":"在气氛紧张的会议中，幽默有时能起到“缓和剂”的作用。"}]}],"synonyms":["moderator","regulator","moderating factor","balancer","moderating influence"],"phonetic":"/ˈmɑdərənt/","extraExplanation":["“moderant”在现代英语里非常少见，更常用的是 **moderator**（主持人/版主）或 **moderating factor**（调节因素）。如果你想表达“主持/控场的人”，通常用 moderator；如果想表达“温和的、适度的”，通常用 moderate（形容词）。","词形上它由 moderate（调节、缓和）+ -ant（表示“……者/……物”）构成，因此字面意思就是“起调节作用的东西/人”。","如果你是在写作或考试中使用，建议优先用更常见的表达（moderator / moderating influence / moderating factor），除非你刻意追求较古旧或罕见的词汇风格。"]}
{"word":"moderantism","summary":{"en":"Moderantism means a moderate political approach (avoiding extremes), and it can also refer specifically to a 19th‑century Spanish liberal movement.","zh":"Moderantism 指（政治上的）温和路线、避免极端；也可特指19世纪西班牙自由主义中的“温和派”思潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a policy or approach that favors moderation, especially in politics (avoiding extremes).","zh":"（尤指政治上的）温和路线；主张中庸、避免极端的政策或立场。"},"examples":[{"en":"The new party’s platform is built on moderantism rather than radical change.","zh":"这个新政党的纲领建立在温和主义之上，而不是激进变革。"},{"en":"In a polarized election, moderantism can appeal to voters who are tired of conflict.","zh":"在两极分化的选举中，温和主义可能吸引那些厌倦冲突的选民。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) one of the main currents of Spanish liberalism in the 19th century, associated with the Moderate Party (Partido Moderado).","zh":"（历史）19世纪西班牙自由主义的重要派别之一，与“温和党”（Partido Moderado）相关。"},"examples":[{"en":"Moderantism played a major role in Spanish politics during the reign of Isabella II.","zh":"在伊莎贝拉二世统治时期，温和主义在西班牙政治中扮演了重要角色。"},{"en":"Some historians contrast moderantism with progressivism in 19th-century Spain.","zh":"一些历史学者把19世纪西班牙的温和主义与进步主义作对比。"}]}],"synonyms":["moderation","centrism","moderate politics","political moderation"],"phonetic":"/ˈmɑdərənˌtɪzəm/","extraExplanation":["这个词在现代英语里很少见，更常见的对应表达是 **moderation**（节制/温和）、**moderate politics**（温和政治）或 **centrism**（中间路线）。","词源来自法语 *modérantisme*（“温和主义”），由 *modérer*（使温和、调和）+ *-isme*（……主义）构成。","历史语境里它常指西班牙19世纪的“温和派/温和党”政治思潮；在一般语境中则可泛指“温和政策/不走极端的路线”。"]}
{"word":"moderantist","summary":{"en":"Moderantist = a supporter of moderate, non-extreme views (a moderate/centrist).","zh":"moderantist 指“温和主义/中间路线”的支持者（相当于 moderate/centrist）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports moderantism (a preference for moderate, non-extreme views, especially in public affairs).","zh":"主张“温和主义 / 中庸立场”的人（倾向于较温和、不走极端的观点，尤指在公共事务中）。"},"examples":[{"en":"In a polarized debate, she spoke as a moderantist, urging compromise.","zh":"在两极化的辩论中，她以温和派的立场发言，呼吁各方妥协。"},{"en":"The group was led by moderantists who preferred gradual change over radical reform.","zh":"该团体由温和派领导，他们更偏好循序渐进的改变，而不是激进改革。"}]}],"synonyms":["moderate","centrist","middle-of-the-roader"],"phonetic":"/ˈmɑdərəntɪst/","extraExplanation":["“moderantist”是个相对少见的词，在现代英语里更常见、更自然的说法通常是 **moderate**（温和派/中间派）或 **centrist**（中间派）。","它的核心意思是“支持温和立场的人”。词典里常用的解释是“an adherent of moderantism（温和主义的拥护者）”。 ([merriam-webster.com](https://www.merriam-webster.com/dictionary/moderantist?utm_source=openai))","容易与 **moderationist** 混淆：moderationist 更直观地表示“主张适度的人”，在政治语境也可指温和派。 ([dictionary.com](https://www.dictionary.com/browse/moderationist?utm_source=openai))"]}
{"word":"moderat","summary":{"en":"Moderate means “not extreme” (adj.) or “to make less extreme” (v.).","zh":"Moderate 可表示“适度的、不极端的”（形容词），也可表示“使缓和、使减轻”（动词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Not extreme; within reasonable limits; average in amount, size, or intensity.","zh":"（形容词）不过分的；适度的；在合理范围内的；中等的。"},"examples":[{"en":"She exercises at a moderate pace so she doesn’t get injured.","zh":"她用适中的速度锻炼，这样就不会受伤。"},{"en":"The city has a moderate climate—neither very hot nor very cold.","zh":"这座城市气候温和——既不很热也不很冷。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) To make something less extreme; to reduce or soften.","zh":"（动词）使缓和；使减轻；使变得不那么极端。"},"examples":[{"en":"Try to moderate your tone during the discussion.","zh":"讨论时尽量把语气放缓。"},{"en":"The government took steps to moderate inflation.","zh":"政府采取措施来抑制通货膨胀。"}]}],"synonyms":["reasonable","mild","temperate","average","restrain","reduce","soften"],"phonetic":"/ˈmɑːdərət/","extraExplanation":["你输入的“moderat”常见于拼写漏掉字母e，正确拼写是 **moderate**。","发音上要注意：形容词 **moderate** 的重音在第一个音节（MOD-er-ate），作动词时也常保持相同读音。","搭配很常见：**moderate amount/level/pace/price**（适度的数量/水平/速度/价格），以及 **moderate (one’s) behavior/tone**（约束/缓和行为或语气）。"]}
{"word":"moderate","summary":{"en":"“Moderate” most often means “not extreme; medium,” and it can also mean “to make less intense” or “a political centrist.”","zh":"“moderate”最常用意思是“中等的/适度的”；也可表示“使缓和/减轻”，或指“政治上的温和派（中间派）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not extreme; average in size, amount, degree, or intensity","zh":"中等的；适度的；不极端的（在大小、数量、程度或强度上）"},"examples":[{"en":"Exercise at a moderate pace so you can keep going for 30 minutes.","zh":"以适中的速度运动，这样你才能坚持30分钟。"},{"en":"The soup is moderately spicy—most people can handle it.","zh":"这汤是“适度辣”，大多数人都能接受。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something less extreme or intense; to be less extreme","zh":"使（某事）缓和、减轻；（自身）变得不那么极端"},"examples":[{"en":"Try to moderate your tone during the meeting.","zh":"开会时尽量缓和你的语气。"},{"en":"As he got older, his views moderated.","zh":"随着年龄增长，他的观点变得温和了。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who holds middle-of-the-road opinions, especially in politics","zh":"温和派；中间派（尤指政治立场不极端的人）"},"examples":[{"en":"Moderates in the party supported the compromise.","zh":"党内温和派支持这一妥协方案。"}]}],"synonyms":["reasonable","medium","temperate","balanced","restrained"],"phonetic":"/ˈmɑdərət/","extraExplanation":["“moderate”常见搭配：moderate exercise（适度运动）、moderate temperature（温和/适中的气温）、moderate risk（中等风险）、moderate drinking（适量饮酒）。","在政治语境中，a moderate 通常指“立场温和、不走极端”的人；与 extremist（极端主义者）形成对比。"]}
{"word":"moderated","summary":{"en":"“Moderated” means “made less extreme” or “managed by a moderator,” and it’s also the past form of “moderate.”","zh":"“moderated”可指“被调节得不那么极端/更温和”，也可指“由主持人/版主管理的”，同时它也是动词“moderate”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Kept within reasonable limits; not extreme in amount, strength, or opinion.","zh":"适度的；温和的；不极端的（在数量、强度或观点上保持在合理范围内）。"},"examples":[{"en":"The report takes a moderated tone to avoid blaming anyone.","zh":"这份报告采用了较为克制的语气，以避免指责任何人。"},{"en":"After some discussion, she offered a moderated response.","zh":"讨论之后，她给出了更为温和的回应。"}]},{"partOfSpeech":"adj.","definition":{"en":"Controlled or guided by a moderator; reviewed and managed to keep conversation safe and on-topic (often online).","zh":"由版主/主持人管理的；经过审核与引导的（常指网络讨论），以保持安全并紧扣主题。"},"examples":[{"en":"This is a moderated forum, so abusive comments will be removed.","zh":"这是一个有版主管理的论坛，因此辱骂性评论会被删除。"},{"en":"The Q&A session was moderated by a senior journalist.","zh":"问答环节由一位资深记者主持。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “moderate”: to make something less extreme, or to serve as a moderator in a discussion.","zh":"“moderate”的过去式/过去分词：使……缓和、减轻；或担任主持人/版主来引导讨论。"},"examples":[{"en":"The teacher moderated the debate so everyone had a chance to speak.","zh":"老师主持了辩论，让每个人都有机会发言。"},{"en":"They moderated their language after receiving feedback.","zh":"收到反馈后，他们让措辞更为克制。"}]}],"synonyms":["tempered","restrained","balanced","regulated","managed","supervised"],"phonetic":"/ˈmɑdəˌreɪtɪd/","extraExplanation":["“moderated”常见于两类场景：\n1）语气/立场：a moderated tone（克制的语气）、moderated views（温和的观点）。\n2）网络与活动：a moderated forum（有审核/有版主管理的论坛）、a moderated discussion（有主持的讨论）。\n语境不同，含义侧重也不同：前者强调“不极端”，后者强调“有人管理与把关”。"]}
{"word":"moderately","summary":{"en":"“Moderately” means “to a medium degree”—not too much and not too little.","zh":"“moderately”表示“适度地/中等程度地”，既不太多也不太少。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"To a medium or average degree; not extremely.","zh":"适度地；中等程度地；不算很（极端）"},"examples":[{"en":"The soup is moderately spicy, so most people can handle it.","zh":"这汤辣度适中，大多数人都能接受。"},{"en":"She exercises moderately—about three times a week.","zh":"她运动适度——大约每周三次。"},{"en":"The hotel is moderately priced for this area.","zh":"就这个地区来说，这家酒店价格中等。"}]}],"synonyms":["to a moderate degree","fairly","reasonably","somewhat"],"phonetic":"/ˈmɑdərətli/","extraExplanation":["“Moderately”常用于给出温和、客观的评价，语气比“slightly（稍微）”更强，但远弱于“very/extremely（非常/极其）”。常见搭配有：moderately + adj.（moderately difficult/expensive/spicy）以及动词短语（eat/drink/exercise moderately：适度饮食/饮酒/运动）。"]}
{"word":"moderateness","summary":{"en":"“Moderateness” is an uncommon noun meaning moderation: staying within reasonable limits and avoiding extremes; it can also mean a moderate (centrist) attitude.","zh":"“moderateness”是不太常用的名词，主要表示“适度/节制、不过分”，也可指“温和（中间派）立场”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The quality of being moderate—showing self-control, avoiding extremes, and keeping things within reasonable limits.","zh":"（不常用）适度；中庸；不过分——指克制自我、避免走极端，把事物控制在合理范围内。"},"examples":[{"en":"The doctor recommended moderateness in eating and drinking.","zh":"医生建议在饮食和饮酒方面要适度。"},{"en":"Moderateness in spending helps you avoid debt.","zh":"花钱适度能帮助你避免负债。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A political or social attitude that favors gradual, balanced change rather than radical action.","zh":"（不常用）温和立场；中间路线——在政治或社会议题上倾向于循序渐进、较为平衡的改变，而非激进做法。"},"examples":[{"en":"Her moderateness made her a bridge between the two sides.","zh":"她的温和立场让她成了两派之间的桥梁。"},{"en":"The party tried to project moderateness during the campaign.","zh":"该党在竞选期间试图展现温和形象。"}]}],"synonyms":["moderation","temperance","restraint","balance","prudence","middle ground"],"phonetic":"ˈmɑd(ə)rɪtnəs","extraExplanation":["“moderateness”在现代英语里比较少见，更常用的是“moderation”（适度、节制）或“moderate”作形容词（温和的/适度的）与名词（温和派）。如果你在写作中想表达“适度”，用“moderation”更自然：e.g., “in moderation”（适量地）。"]}
{"word":"moderatenesses","summary":{"en":"“Moderatenesses” is the rare plural of “moderateness,” meaning “moderation; the quality of being not extreme.”","zh":"“moderatenesses” 是较少见的复数形式，来自 “moderateness”，意思是“适度；中庸；不过分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the qualities or states of being moderate (not extreme in amount, behavior, opinion, or style); moderation","zh":"适度；中庸；不过分（在数量、行为、观点或风格上不走极端的特质或状态）"},"examples":[{"en":"The plan’s strength is its moderateness—it avoids risky extremes.","zh":"这个计划的优势在于它的适度——它避免了冒险的极端做法。"},{"en":"He was respected for the moderateness of his tone during disagreements.","zh":"他在分歧中语气克制、适度，因此受到尊重。"},{"en":"The report praises the moderatenesses shown by both sides in the negotiation.","zh":"报告称赞双方在谈判中表现出的克制与适度。"}]}],"synonyms":["moderation","temperance","restraint","balance","reasonableness"],"phonetic":"/ˈmɑdərət.nəs/","extraExplanation":["“moderatenesses” 是名词 “moderateness” 的复数形式，但在现代英语中非常少见。多数情况下，母语者更常用 “moderation”（更常见、自然）或 “moderate views / a moderate approach”（用形容词/短语表达）。","复数形式 “moderatenesses” 通常只在需要强调“多种不同方面/多处出现的适度”时才可能使用，例如在学术写作里谈到不同政策、不同语境下的“适度”。"]}
{"word":"moderates","summary":{"en":"“Moderates” can mean (1) people with moderate views, or (2) “moderates” as a verb meaning “makes less extreme / moderates a discussion,” depending on the sentence.","zh":"“moderates” 既可指（1）温和派/中间派，也可作动词（第三人称单数）表示“使缓和、主持/调节讨论”，具体看句子结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who hold moderate views (not extreme), especially in politics or social issues","zh":"（尤指政治/社会议题中）立场温和、不极端的人；中间派"},"examples":[{"en":"The moderates in the party tried to reach a compromise.","zh":"党内的温和派试图达成妥协。"},{"en":"Moderates often prefer gradual change over sudden reform.","zh":"温和派往往更倾向于循序渐进的改变，而不是突然的改革。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something less extreme, intense, or severe; to become less extreme","zh":"使（程度/情绪/立场）缓和、减轻；（自身）变得不那么激烈"},"examples":[{"en":"The chair moderates the discussion to keep it respectful.","zh":"主持人调节讨论，让大家保持尊重。"},{"en":"His tone moderates when he realizes he sounded too harsh.","zh":"他意识到自己说得太刻薄后，语气缓和了下来。"}]},{"partOfSpeech":"v.","definition":{"en":"to serve as a moderator (for a meeting, debate, or online forum)","zh":"主持（会议/辩论）；担任（论坛等的）版主/管理员"},"examples":[{"en":"She moderates the panel on climate policy.","zh":"她主持有关气候政策的小组讨论。"},{"en":"He moderates a large online community.","zh":"他管理着一个大型线上社群。"}]}],"synonyms":["centrists","middle-of-the-road","temper","soften","regulate"],"phonetic":"/ˈmɑːdəreɪts/","extraExplanation":["“moderates” 常见于两种情况：\n1）作名词复数：the moderates = “温和派/中间派”（通常与 the conservatives / the liberals / the radicals 对比）。\n2）作动词第三人称单数：He/She moderates... = “他/她主持/调节/管理……”。\n看到句子结构最容易判断：前面有 the + moderates（名词） vs. 主语是 he/she/it + moderates（动词）。","词根提示：moderate 的核心意思是“保持适度（not too much）”。所以动词 moderates 常带“让事情不过火”的感觉，比如 moderates a debate（控制节奏、保持礼貌）、moderates criticism（缓和批评）。"]}
{"word":"moderating","summary":{"en":"Moderating usually means (1) hosting/overseeing a discussion to keep it fair and orderly, or (2) making something less intense; it can also describe a calming influence.","zh":"Moderating 通常指（1）主持/管理讨论以保持公平有序，或（2）使强度减弱、缓和；也可形容“起调和作用的影响”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of moderate) Leading or overseeing a discussion or event, making sure it stays fair, orderly, and on-topic.","zh":"（moderate 的现在分词）主持或管理讨论/活动，确保过程公平、有序并围绕主题。"},"examples":[{"en":"She is moderating the panel on climate policy.","zh":"她正在主持关于气候政策的小组讨论。"},{"en":"Thanks for moderating the meeting and keeping everyone on schedule.","zh":"谢谢你主持会议并让大家按时推进。"},{"en":"He has experience moderating online forums.","zh":"他有管理网络论坛的经验。"}]},{"partOfSpeech":"v.","definition":{"en":"Making something less extreme, intense, or strong; reducing or softening.","zh":"使某事不那么极端/强烈；减弱或缓和。"},"examples":[{"en":"Drinking water helps with moderating body temperature after exercise.","zh":"运动后喝水有助于调节体温。"},{"en":"They are moderating their criticism to avoid hurting feelings.","zh":"他们在缓和批评，以免伤到别人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a calming or balancing effect (often used before a noun).","zh":"起到冷静或平衡作用的（常用于名词前）。"},"examples":[{"en":"Her moderating influence helped the team reach an agreement.","zh":"她的调和作用帮助团队达成了协议。"},{"en":"A moderating voice in the debate can lower tension.","zh":"辩论中一个温和的声音可以降低紧张气氛。"}]}],"synonyms":["facilitating","chairing","overseeing","managing","regulating","controlling","tempering","softening"],"phonetic":"ˈmɑdəˌreɪtɪŋ","extraExplanation":["在网络社区里，moderating 常指“版主/管理员进行内容审核与秩序维护”：比如删除违规内容（remove posts）、提醒用户遵守规则（enforce rules）、锁帖（lock a thread）、禁言/封号（mute/ban a user）。","在会议或活动场景中，moderate 更接近“主持”：引导提问、控制时间、让每个人都有机会发言（give everyone a chance to speak）。","moderate 还常见于“温和派/中间派”的语境（a moderate politician），但 moderating 更常用来强调“在调和、控制强度或主持管理”的动作。"]}
{"word":"moderation","summary":{"en":"Moderation means keeping things within reasonable limits; online, it also means managing and reviewing content to enforce rules and safety.","zh":"Moderation 指“保持适度、不过度”；在网络语境中也指“对内容与行为进行管理/审核，以执行规则并维护安全”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something less extreme or strict; keeping things within reasonable limits","zh":"（使）适度；节制；调和；把事物控制在合理范围内的过程"},"examples":[{"en":"Moderation in eating and drinking is good for your health.","zh":"饮食适度有益健康。"},{"en":"The teacher asked for moderation in the debate so everyone could speak respectfully.","zh":"老师要求辩论中保持克制，让每个人都能尊重地发言。"}]},{"partOfSpeech":"n.","definition":{"en":"(online) the act of reviewing and managing user content and behavior to keep a community safe and follow rules","zh":"（网络）内容/社区管理与审核；通过检查内容和行为来维护安全并遵守规则"},"examples":[{"en":"The forum improved after stronger moderation of hateful comments.","zh":"加强对仇恨言论的管理与审核后，论坛环境变好了。"},{"en":"Content moderation can remove spam, but it may also accidentally block harmless posts.","zh":"内容审核可以清除垃圾信息，但也可能误拦截无害的帖子。"}]}],"synonyms":["restraint","self-control","temperance","balance","content moderation","community moderation"],"phonetic":"/ˌmɑːdəˈreɪʃən/","extraExplanation":["“moderation”来自拉丁语词根 *moder-*（意为“控制、衡量”），与 *moderate*（适度的；调节）同源。","在英语文化中，“in moderation”是常见搭配，表示“适量、别过度”，常用于健康、饮食、饮酒等语境。","在互联网语境里，“moderation”常指平台或管理员执行规则（如删除违规内容、封禁账号、标记敏感内容）。它通常需要在“安全/秩序”与“表达自由”之间取得平衡。"]}
{"word":"moderationism","summary":{"en":"Moderationism means an ideology or attitude that supports moderation and avoids extremes, especially in politics (and more rarely in some religious discussions about “acceptable in moderation”).","zh":"Moderationism 指主张温和、避免极端的理念或态度，常见于政治语境（更少见地也可用于宗教中“适度即可”的讨论）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Politics, society) The belief, attitude, or policy of favoring moderate positions and avoiding extremes; support for gradual, balanced reform rather than radical change.","zh":"（政治/社会）主张温和立场、避免走极端的观念或政策；倾向于渐进、平衡的改革而非激进变革。"},"examples":[{"en":"In a polarized election, her moderationism appealed to voters who wanted compromise.","zh":"在两极分化的选举中，她的温和主义吸引了希望妥协的选民。"},{"en":"The party’s moderationism shaped its platform: steady reforms instead of sweeping promises.","zh":"该党的温和主义塑造了其政纲：强调稳步改革，而不是大刀阔斧的承诺。"}]},{"partOfSpeech":"n.","definition":{"en":"(Religion, less common) The view that certain behaviors are acceptable if practiced in moderation (for example, some Christian discussions about alcohol allow drinking but forbid drunkenness).","zh":"（宗教用法，较少见）认为某些行为“适度即可接受”的观点（例如部分基督教关于酒精的讨论：可以饮酒，但禁止酗酒）。"},"examples":[{"en":"Some writers defended moderationism, arguing that the problem is excess, not the drink itself.","zh":"一些作者为温和主义辩护，认为问题在于过度，而不在于饮品本身。"}]}],"synonyms":["moderatism","centrism","middle-of-the-road politics","temperance (in behavior)"],"phonetic":"ˌmɑd(ə)ˈreɪʃəˌnɪzəm","extraExplanation":["“moderationism”在现代英语里相对少见，写作中更常见的是 **moderatism**（温和主义/中间路线的思想）或 **moderation**（节制、适度）以及 **moderate politics**（温和政治）。","构词上：**moderation + -ism**，表示“一种理念/主义”。如果你想表达“主张温和的人”，更常用 **moderate** 或 **moderationist**。","在宗教语境里提到的“适度饮酒可以、醉酒不行”等观点，并不等于所有宗派共同立场；它更多是用来概括“允许适度、反对过量”的思路。"]}
{"word":"moderationist","summary":{"en":"A moderationist is someone who supports moderate, non-extreme views, often seeking compromise.","zh":"moderationist 指主张温和立场、避免极端、常寻求妥协与共识的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports moderate views or policies, avoiding extremes (often in politics, religion, or social issues).","zh":"温和派人士；主张中间立场、避免极端观点或政策的人（常用于政治、宗教或社会议题）。"},"examples":[{"en":"In the debate, the moderationists tried to find a solution both sides could accept.","zh":"在辩论中，温和派试图找到一个双方都能接受的解决方案。"},{"en":"She’s a moderationist who prefers gradual reform instead of sudden change.","zh":"她是温和派，更偏好循序渐进的改革，而不是突然的改变。"}]}],"synonyms":["moderate","centrist","moderate-minded person"],"phonetic":"/ˌmɑːdəˈreɪʃənɪst/","extraExplanation":["“moderationist”多见于政治评论或历史语境，常用来对比“hardliner（强硬派）”“radical（激进派）”。它强调“立场温和、愿意妥协或寻求共识”，并不一定表示“没有原则”，而是指偏好折中与渐进方式。","相关表达：moderate（温和的/温和派）更常用；moderationist听起来更“书面/学术”，在新闻或论文中更可能出现。"]}
{"word":"moderations","summary":{"en":"“Moderations” is the plural of “moderation,” meaning either keeping things within reasonable limits or the management of discussions/online content by rules.","zh":"“Moderations”是“moderation”的複數，可指「適度／節制、避免極端」，也可指「討論或線上內容的管理／審核方式」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of keeping something within reasonable limits; avoiding extremes (plural form of “moderation”).","zh":"節制；適度；把事情控制在合理範圍內、避免走向極端（“moderation”的複數）。"},"examples":[{"en":"Doctors often recommend moderations in sugar and salt to protect your heart.","zh":"醫生常建議在糖和鹽的攝取上要適度，以保護心臟。"},{"en":"The team made several moderations to the plan after reviewing the risks.","zh":"團隊在檢視風險後，對計畫做了幾項調整，使其更合理。"}]},{"partOfSpeech":"n.","definition":{"en":"the work of managing discussions or online spaces by guiding conversation and enforcing rules (plural form, often used in tech/media contexts).","zh":"（討論或網路社群的）主持／管理；依規範引導對話並執行規則（複數，用於科技／媒體語境常見）。"},"examples":[{"en":"Different moderations may apply on different platforms, so the same post can be treated differently.","zh":"不同平台可能採用不同的內容管理方式，因此同一篇貼文可能被不同處理。"},{"en":"The forum improved safety by adding clearer moderations and reporting tools.","zh":"該論壇透過更清楚的管理規範與檢舉工具提升了安全性。"}]}],"synonyms":["restraint","self-control","temperance","balance","limits","oversight","content moderation","community management"],"phonetic":"/ˌmɑːdəˈreɪʃənz/","extraExplanation":["“Moderations”是“moderation”的複數，但在日常英文中更常見的是不可數用法（例如：Eat in moderation.「適量飲食。」）。只有在強調「多種不同的節制方式／多項調整／不同平台的管理做法」時，才比較會用到複數“moderations”。","在網路語境裡，moderation常指“content moderation（內容審核／社群管理）”。這個意思在近年很常見，和傳統的“節制、適度”是兩個常見語境。"]}
{"word":"moderatism","summary":{"en":"Moderatism means a preference for moderate, non-extreme positions (often in politics) or a general attitude of moderation.","zh":"Moderatism 指偏好温和、不极端的立场（常见于政治语境），也可指生活或判断上的适度与克制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief or approach that prefers moderate (not extreme) opinions, policies, or actions—especially in politics or public debate.","zh":"（尤指政治或公共议题中的）温和主义；主张中间路线、反对极端立场的观点或作风。"},"examples":[{"en":"Her moderatism helped the two sides reach a compromise.","zh":"她的温和立场帮助双方达成了妥协。"},{"en":"In a polarized climate, moderatism can be hard to defend.","zh":"在两极分化的环境中，温和主义可能很难被坚持或捍卫。"},{"en":"The party tried to appeal to voters who value moderatism over ideology.","zh":"该党试图吸引那些更重视温和立场而非意识形态的选民。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal habit or principle of behaving with moderation; avoiding excess or extremes in lifestyle or judgment.","zh":"（个人层面的）适度原则；克制不过度的处世方式或判断风格。"},"examples":[{"en":"He practiced moderatism in spending and rarely bought luxury items.","zh":"他在花钱方面奉行适度原则，很少购买奢侈品。"},{"en":"Their advice emphasized moderatism rather than strict rules.","zh":"他们的建议强调适度，而不是严苛的规则。"}]}],"synonyms":["moderation","political moderation","centrism","middle-of-the-road politics","temperance"],"phonetic":"/ˈmɑdərətɪzəm/","extraExplanation":["“moderatism”这个词在日常英语里不算特别常见；更常见的表达是“moderation（节制/适度）”或“political moderation（政治温和）”。不过在讨论政治立场、意识形态光谱时，“moderatism”会显得更“学术/评论化”，更强调一种立场或思潮。","词形提示：moderate（温和的/适度的）→ moderation（节制、适度）/ moderatism（温和主义）。当你想表达“提倡克制”时，多用 moderation；当你想表达“主张中间路线的政治立场”时，用 moderatism 更贴切。"]}
{"word":"moderatist","summary":{"en":"A moderatist is a person who supports moderate, non-extreme views (often in politics), aiming for balance and compromise.","zh":"moderatist 指温和派人士：主张不极端的观点（常见于政治语境），倾向平衡与妥协。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports moderation, especially in politics or religion; someone who avoids extreme positions","zh":"温和派人士；主张中庸、反对极端立场的人（尤指政治或宗教领域）"},"examples":[{"en":"In a polarized election, moderatists often try to build compromise between the two sides.","zh":"在两极化的选举中，温和派人士常常努力在双方之间促成妥协。"},{"en":"She is a moderatist who prefers practical solutions over ideological debates.","zh":"她属于温和派，更偏好务实的解决方案，而不是意识形态争论。"}]}],"synonyms":["moderate","centrist","middle-of-the-road (informal)","moderationist (less common)"],"phonetic":"/ˈmɑdərətɪst/","extraExplanation":["“moderatist”不是最常见的词，更常见的说法是“moderate”（可作名词）或“centrist”（中间派）。例如：He’s a moderate. / She’s a centrist.","语气与搭配：在政治语境里，“moderatist”强调“倾向温和、反对极端”，常出现在讨论“polarization（两极化）”“compromise（妥协）”“bipartisan（两党合作）”等话题时。","词形提示：来自“moderate（温和的/适度的）+ -ist（…主义者/…派的人）”。因此它表示“主张温和立场的人”。"]}
{"word":"moderato","summary":{"en":"Moderato is a musical term meaning “at a moderate tempo,” used as a tempo marking or to describe how to play a passage.","zh":"Moderato 是音乐术语，表示“中速”，可作为速度标记或用来描述演奏方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(music) At a moderate speed; not too fast and not too slow.","zh":"（音乐）以中等速度；不快也不慢。"},"examples":[{"en":"Play this passage moderato, keeping the rhythm steady.","zh":"这一段请用 moderato（中速）来演奏，并保持节奏稳定。"},{"en":"The conductor asked for a moderato tempo in the opening.","zh":"指挥要求开头用 moderato 的速度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(music) Describing a piece or section that should be performed at a moderate tempo.","zh":"（音乐）形容某段/某乐章应以中速演奏的。"},"examples":[{"en":"The second movement is marked Moderato.","zh":"第二乐章标注为 Moderato（中速）。"},{"en":"Choose a moderato interpretation so the melody can sing.","zh":"选择偏 moderato 的处理，让旋律更有歌唱性。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) A tempo marking meaning “moderate tempo.”","zh":"（音乐）速度术语/标记，意为“中速”。"},"examples":[{"en":"In the score, “Moderato” appears above the first line of music.","zh":"在总谱里，“Moderato”写在第一行乐谱上方。"}]}],"synonyms":["at a moderate tempo","moderately","medium tempo"],"phonetic":"/ˌmɑdəˈrɑtoʊ/","extraExplanation":["“moderato”来自意大利语，意思是“适度的、不过分的”。在乐谱里常写作首字母大写的 **Moderato**，表示演奏速度要保持“适中”。","它不是一个精确的固定速度（不像秒表那样），更像是给演奏者的风格指引：既要有流动感，又不要急促。不同作品、不同风格下，具体快慢会略有变化。"]}
{"word":"moderator","summary":{"en":"A moderator is a person who guides and controls a discussion (often online) or chairs a debate; it can also mean someone with moderate views. The verb is “moderate.”","zh":"moderator 指引导并管理讨论的人（常见于网络版主/主持人），也可指温和派人士；动词形式为 moderate（主持/管理/调节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who manages a discussion (especially online) by guiding conversation, enforcing rules, and removing harmful or off-topic content","zh":"（尤指网络上的）版主；主持人：负责引导讨论、执行规则，并删除有害或跑题内容的人"},"examples":[{"en":"A moderator deleted the spam posts and reminded everyone to be respectful.","zh":"版主删除了垃圾广告帖，并提醒大家要尊重他人。"},{"en":"Please contact a moderator if someone is harassing you in the forum.","zh":"如果有人在论坛里骚扰你，请联系版主。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who chairs a meeting or debate and makes sure it stays orderly and on time","zh":"（会议/辩论的）主持人；司仪：确保流程有序、按时进行的人"},"examples":[{"en":"The moderator introduced each speaker and kept the debate moving.","zh":"主持人介绍了每位发言者，并让辩论顺利进行。"},{"en":"As moderator, she asked the audience to save questions for the end.","zh":"作为主持人，她请观众把问题留到最后。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who avoids extremes; a person with moderate views or habits","zh":"温和派；持中间立场的人：观点或行为不过于极端的人"},"examples":[{"en":"He’s a moderator in politics, preferring compromise over confrontation.","zh":"他在政治上偏温和，喜欢妥协而不是对抗。"}]},{"partOfSpeech":"v.","definition":{"en":"to act as a moderator by guiding discussion and enforcing rules","zh":"主持；担任版主：引导讨论并执行规则"},"examples":[{"en":"She will moderate the panel discussion tonight.","zh":"她今晚将主持小组讨论。"},{"en":"The platform moderates comments to reduce hate speech.","zh":"该平台会审核/管理评论，以减少仇恨言论。"}]}],"synonyms":["host","chairperson","panel chair","forum mod","content reviewer","referee"],"phonetic":"/ˈmɑdəˌreɪtər/","extraExplanation":["“moderator”来自拉丁语 *moderari*（控制、调节）。在网络语境中常译为“版主/管理员”，但“administrator (admin)”通常权限更大、负责系统设置；“moderator (mod)”更侧重内容与秩序管理。","常见搭配：moderator of a debate（辩论主持人）、forum moderator（论坛版主）、content moderation（内容审核/内容管理）。"]}
{"word":"moderatorial","summary":{"en":"Moderatorial means “relating to a moderator or the role of presiding over a discussion/assembly,” often in formal or church settings.","zh":"moderatorial 意为“与主持人（moderator）或主持职责相关的”，多用于正式或教会等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a moderator (a person who presides over a meeting, discussion, or assembly), or to the role/powers of a moderator.","zh":"与“主持人/会议主席/调解者（moderator）”有关的；与主持人的职责、权力或工作相关的。"},"examples":[{"en":"The committee reviewed the chair’s moderatorial duties before the vote.","zh":"委员会在投票前审查了主席的主持职责。"},{"en":"Her moderatorial style kept the discussion respectful and focused.","zh":"她的主持风格让讨论保持尊重且聚焦。"}]},{"partOfSpeech":"adj.","definition":{"en":"Especially in some church contexts (such as Presbyterian governance): relating to a moderator, an official who presides over an assembly.","zh":"（尤用于某些教会语境，如长老会治理）与“大会主持官/议会主持人（moderator）”相关的。"},"examples":[{"en":"The minister carried out moderatorial responsibilities during the synod.","zh":"那位牧师在宗会期间履行了大会主持职责。"}]}],"synonyms":["moderator's","presiding","chairing","chair's"],"phonetic":"/ˌmɑdəˈtɔriəl/","extraExplanation":["“moderatorial”比较正式、偏书面，日常英语里更常用“moderator’s”或“moderator-related”（例如：the moderator’s role / moderator duties）。","词源上来自“moderator”（主持人、调解者），加上形容词后缀“-ial”，表示“……的/与……相关的”。因此它的核心意思就是“与主持/调解这一角色相关”。"]}
{"word":"moderators","summary":{"en":"“Moderators” are people who manage discussions or communities, keeping order and enforcing rules.","zh":"“moderators”指负责管理讨论或社区的人，维持秩序并执行规则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who manages a discussion or activity by keeping order, guiding what happens, and making sure rules are followed (for example, in an online community, a meeting, or a debate).","zh":"主持或管理讨论/活动的人，负责维持秩序、引导流程，并确保规则被遵守（如网络社区、会议或辩论）。"},"examples":[{"en":"The moderators removed comments that broke the community rules.","zh":"版主删除了违反社区规则的评论。"},{"en":"During the debate, the moderator asked each speaker to stay within the time limit.","zh":"在辩论中，主持人要求每位发言者遵守时间限制。"}]}],"synonyms":["admins","moderator","host","facilitators"],"phonetic":"/ˈmɑːdəˌreɪtərz/","extraExplanation":["“moderators”是“moderator”的复数形式。常见场景：网络论坛/社群里通常译作“版主/管理员”；在会议、座谈、辩论等场合更常译作“主持人”。","词根与“moderate（适度的；调节）”相关，核心感觉是“让事情保持在合理范围内”：控制节奏、降温冲突、执行规则。","搭配很常用：moderators enforce rules（执行规则）、remove posts/comments（删除帖子/评论）、approve submissions（审核通过投稿）、lock a thread（锁帖）、ban a user（封禁用户）。"]}
{"word":"moderatorship","summary":{"en":"Moderatorship means the role or term of being a moderator—managing discussions and enforcing rules.","zh":"Moderatorship 指担任版主/主持人的职位或任期，即管理讨论并执行规则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The role, position, or term of service of a moderator (someone who manages discussions, enforces rules, and keeps order in a group, forum, meeting, or community).","zh":"版主／主持人／仲裁者的职位、身份或任期（负责管理讨论、执行规则、维持秩序）。"},"examples":[{"en":"She accepted the moderatorship of the online community to help reduce harassment.","zh":"她接受了这个线上社群的版主职位，以帮助减少骚扰。"},{"en":"During his moderatorship, the forum introduced clearer rules and faster responses to reports.","zh":"在他担任版主期间，论坛制定了更明确的规则，并更快处理举报。"}]}],"synonyms":["moderator role","moderator position","moderator tenure","moderation (context-dependent)"],"phonetic":"/ˈmɑːdəˌreɪtərˌʃɪp/","extraExplanation":["“moderatorship”是由 moderator（版主／主持人）+ -ship（表示“身份、职位、状态或任期”的后缀）构成，语气相对正式，常见于社群管理、学术会议或组织治理语境。","近义表达常用更自然的说法包括：the role of a moderator（版主的职责/角色）、moderator position（版主职位）、being a moderator（当版主）。","相关词：moderation（管理/节制；在社群语境也可指“内容审核”）、moderate（主持/调停；或“适度的”）。"]}
{"word":"moderatos","summary":{"en":"**Moderatos** is the plural of **moderato**, a music term meaning a moderate tempo or a section played at a moderate speed.","zh":"**Moderatos**是**moderato**的复数，指“中等速度”或“以中速演奏的乐段/乐章”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(music) a piece, movement, or section marked to be played at a moderate speed (neither fast nor slow). Plural: **moderatos**.","zh":"（音乐）标注为中等速度（不快不慢）演奏的乐段、乐章或乐曲；复数：**moderatos**。"},"examples":[{"en":"The sonata opens with a calm **Moderato**.","zh":"这首奏鸣曲以平静的**中速段（Moderato）**开场。"},{"en":"We practiced the **moderatos** first before trying the faster movements.","zh":"我们先练习这些**中速段（moderatos）**，再练更快的乐章。"}]},{"partOfSpeech":"adj.","definition":{"en":"(music) moderate in tempo; used in sheet music as a tempo marking.","zh":"（音乐）中等速度的；用于乐谱中作为速度标记。"},"examples":[{"en":"Play the second theme **moderato**—don’t rush it.","zh":"第二主题要以**中速**演奏——不要抢拍。"},{"en":"The score says **Allegro moderato**, meaning a restrained, less fast Allegro.","zh":"乐谱写着 **Allegro moderato**，意思是“较克制、没那么快的快板”。"}]},{"partOfSpeech":"adv.","definition":{"en":"(music) at a moderate tempo.","zh":"（音乐）以中等速度（不快不慢）地。"},"examples":[{"en":"The entire movement should be performed **moderato**.","zh":"整段乐章都应当以**中速**来演奏。"}]}],"synonyms":["moderate","medium tempo","at a moderate tempo"],"phonetic":"/ˌmɑː.dɚˈɑː.toʊ/","extraExplanation":["“moderato”是意大利语音乐术语，来自拉丁语词根，和英语“moderate（适度的）”同源，所以很好记。","在实际演奏中，moderato对应的具体BPM（每分钟节拍数）会因时代、作品风格和指挥/演奏者选择而变化；关键概念是“保持适中、不极端”。","你输入的“moderatos”通常就是把名词“moderato”复数化：比如在讨论一首作品里多个中速乐段时会用到。"]}
{"word":"moderatrix","summary":{"en":"Moderatrix means a woman who moderates a discussion, meeting, or forum (a female moderator).","zh":"Moderatrix 指“女性主持人/管理者”，即负责主持讨论、会议或论坛的人（女性 moderator）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who moderates a discussion or debate; a female moderator.","zh":"（女性）主持人；（女性）讨论/辩论的调解者、管理者。"},"examples":[{"en":"The moderatrix guided the panel so everyone had a chance to speak.","zh":"这位女主持人引导座谈会，让每个人都有发言机会。"},{"en":"On the forum, a moderatrix removed posts that broke the rules.","zh":"在论坛里，一位女版主删除了违反规则的帖子。"}]},{"partOfSpeech":"n.","definition":{"en":"A female official who presides over a meeting or an organization (often used in formal, academic, or church contexts).","zh":"（女性）会议主席；（女性）主持某机构事务的负责人（常见于正式、学术或教会语境）。"},"examples":[{"en":"She served as moderatrix of the association’s annual meeting.","zh":"她担任该协会年会的女主席。"}]}],"synonyms":["female moderator","moderator","chairwoman","chair (neutral)","forum moderator"],"phonetic":"/ˈmɑːdəˌreɪtrɪks/","extraExplanation":["“moderatrix”是“moderator”的阴性形式，来源于拉丁语词根 *moderari*（意为“调节、管理、控制”）。现代英语里更常用中性用法“moderator”，因此“moderatrix”带有较强的正式感或强调“女性身份”的色彩；在一些机构（例如特定教会或学术组织）中仍可能作为正式头衔出现。"]}
{"word":"moderatus","summary":{"en":"Moderatus is a Latin word meaning “moderate; restrained,” seen mainly in scientific (taxonomic) names and rarely as an English noun.","zh":"moderatus 是拉丁语词，意为“适度的；克制的”，主要见于生物学学名中，作为英语名词使用较少。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English mostly in scientific names) moderate; restrained; kept within limits.","zh":"（拉丁语；在英语中多见于学名）适度的；克制的；有节制的。"},"examples":[{"en":"The species name moderatus suggests the animal has a relatively moderate size or behavior.","zh":"学名中的 moderatus 暗示这种动物的体型或行为相对“适度/温和”。"},{"en":"In Latin, moderatus describes something controlled rather than extreme.","zh":"在拉丁语里，moderatus 形容某事是被控制的，而不是极端的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare in modern English) a person who is moderate in opinions or behavior.","zh":"（现代英语中较少见）温和派；持中庸观点的人。"},"examples":[{"en":"He presented himself as a moderatus, avoiding harsh language in the debate.","zh":"他把自己塑造成温和派，在辩论中避免使用激烈措辞。"}]}],"synonyms":["moderate","restrained","measured","temperate"],"phonetic":"/ˌmɑdəˈrɑtəs/","extraExplanation":["“moderatus”源自拉丁语动词 moderari（控制、调节），相当于英语的 “moderate”。在现代英语里，它多作为生物学分类/物种命名中的拉丁词出现，而不是日常词汇。","如果你在论文或报告中想用更自然的现代英语表达，通常用 “moderate / restrained / measured”。"]}
{"word":"modern","summary":{"en":"Modern means “of the present time” or “not old-fashioned,” and can also refer to the historical period from about the 1500s to today.","zh":"modern 指“现代的、当代的、不守旧的”，也可指历史上的“近代/现代”时期（约16世纪至今）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"belonging to the present time; not old-fashioned; using or influenced by current ideas, styles, or technology","zh":"现代的；当代的；不守旧的；受当前观念、风格或科技影响的"},"examples":[{"en":"Modern phones can translate speech in real time.","zh":"现代手机可以实时翻译语音。"},{"en":"The museum mixes modern art with classical paintings.","zh":"这家博物馆把现代艺术与古典绘画结合在一起。"},{"en":"She prefers a modern style of furniture—simple and clean.","zh":"她更喜欢现代风格的家具——简洁干净。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Modern) relating to the period from about the 1500s to the present, especially in European history; often contrasted with “medieval” (Middle Ages)","zh":"（Modern，大写）近代的/现代的：通常指约16世纪（1500年左右）至今的历史时期（尤指欧洲史），常与“medieval（中世纪）”相对"},"examples":[{"en":"They’re studying early modern Europe in class.","zh":"他们在课堂上学习欧洲近代早期史。"},{"en":"The novel is set in modern times, not the medieval period.","zh":"这部小说以现代时期为背景，而不是中世纪。"}]}],"synonyms":["contemporary","current","up-to-date","present-day","new-fashioned"],"phonetic":"/ˈmɑdɚn/","extraExplanation":["在日常英语里，modern 常常带有“新、先进、符合当下潮流”的感觉，但不一定等同于“最新的（latest）”。例如 modern design 可能指“当代风格/现代主义风格”，而不是“刚发布的设计”。","在艺术与建筑语境中，Modern/Modernism 常指“现代主义”流派（约19世纪末至20世纪中期），与 “contemporary（当代的）”不完全相同：contemporary 更强调“此时此刻正在发生的”。"]}
{"word":"moderne","summary":{"en":"“Moderne” usually means the Art Moderne design style (sleek, streamlined, 1930s–40s). It can also be a rare, French-styled spelling meaning “modern,” often used in names or branding.","zh":"“Moderne”通常指“Art Moderne（现代派/流线型现代）”设计风格（多见于20世纪30–40年代）。也可作为带法语感的拼写，少见地表示“现代的/时髦的”，常用于命名或品牌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in the style of Art Moderne (a sleek, streamlined design style popular in the 1930s–1940s, especially in architecture and product design)","zh":"（尤指建筑或设计）属于“现代派（Art Moderne）”风格的；线条流畅、强调流线型与简洁感（多见于20世纪30–40年代）"},"examples":[{"en":"The hotel’s Moderne façade features smooth curves and long horizontal lines.","zh":"这家酒店的现代派立面有圆滑的曲线和长长的水平线条。"},{"en":"She loves Moderne posters with bold shapes and minimal detail.","zh":"她很喜欢现代派海报：形状大胆、细节极简。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) modern; fashionable in a contemporary way (a French-looking spelling sometimes used for style or branding)","zh":"（较少见）现代的；时髦的（带法语拼写的感觉，常用于风格描写或品牌命名）"},"examples":[{"en":"The café chose the name “Moderne” to suggest a fresh, stylish image.","zh":"这家咖啡馆取名“Moderne”，是为了传达清新时髦的形象。"}]}],"synonyms":["Art Moderne","Streamline Moderne","streamlined","sleek","modern (general)"],"phonetic":"/moʊˈdɝːn/","extraExplanation":["“Moderne”在英语里最常见的用法是指“Art Moderne（现代派/流线型现代风格）”，与“Art Deco（装饰艺术）”有关但不完全相同：Moderne更强调流线型、速度感、工业化材料与简化装饰；你也会看到“Streamline Moderne（流线型现代风格）”这个更具体的说法。","拼写上，“moderne”带有法语气息（法语“moderne”= 现代的）。英语里用这个拼写往往是为了营造复古设计感或高级感；一般写作里更常用“modern”。","在阅读中看到“a Moderne building/chair/poster”时，通常不是泛指“现代”，而是在暗示一种特定的20世纪上半叶设计审美。"]}
{"word":"moderner","summary":{"en":"“Moderner” means “more modern,” but “more modern” is usually more common and natural in English.","zh":"“moderner”表示“更现代”，但英语中更常用、更自然的说法通常是“more modern”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More modern; newer or more up-to-date in style, design, technology, or ideas (comparative form of “modern”).","zh":"更现代的；更新的；在风格、设计、技术或观念上更与时代接轨的（“modern”的比较级）。"},"examples":[{"en":"This phone is moderner than my old one.","zh":"这部手机比我旧的那部更现代。"},{"en":"They built a moderner library with more computers and study rooms.","zh":"他们建了一座更现代的图书馆，配有更多电脑和自习室。"},{"en":"Her artwork looks moderner because she uses digital tools.","zh":"她的作品看起来更现代，因为她使用了数字工具。"}]}],"synonyms":["more modern","newer","more up-to-date","more contemporary"],"phonetic":"/ˈmɑːdərnər/","extraExplanation":["“moderner”是“modern”的比较级，但在现代英语里更常见也更自然的说法通常是“more modern”，尤其在正式写作中。","如果你想表达“更先进/更新”，也可以根据语境用“newer”“more up-to-date”“more contemporary”（更当代的）等。","注意：如果你是在拼写检查或写作中看到“moderner”，它有时会被标记为不太常用，并不一定是错误，但更推荐用“more modern”。"]}
{"word":"modernest","summary":{"en":"“Modernest” means “the most modern,” but it’s uncommon; “most modern” is usually preferred.","zh":"“modernest”表示“最现代的”，但不常用；通常更推荐用“most modern”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"The superlative form of “modern,” meaning “the most modern; the newest or most up-to-date.”","zh":"“modern”的最高级，意思是“最现代的；最新的；最符合当下潮流或技术的”。"},"examples":[{"en":"This is the modernest design in our catalog, with the latest safety features.","zh":"这是我们目录里最现代的设计，配有最新的安全功能。"},{"en":"They wanted the modernest kitchen possible—smart appliances, clean lines, and bright lighting.","zh":"他们想要尽可能最现代的厨房——智能家电、简洁线条和明亮照明。"}]}],"synonyms":["most modern","newest","most up-to-date","cutting-edge","state-of-the-art","contemporary"],"phonetic":"/ˈmɑdɚnɪst/","extraExplanation":["“modernest”在日常英语里不常见。因为“modern”是多音节形容词，通常更自然的说法是“most modern”（例如：the most modern building）。","当人们用“modernest”时，常带一点幽默感、夸张感，或出现在较旧/较文学化的写法中。","如果你在写正式英文（论文、报告、商务邮件），更推荐用“most modern / newest / most up-to-date”。"]}
{"word":"modernicide","summary":{"en":"Modernicide means destroying modern things or modernity itself; it can also mean a person who does this.","zh":"modernicide 指“对现代事物/现代性”的摧毁（多为比喻），也可指“这样做的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the destruction or elimination of modern things, ideas, or styles (often used figuratively)","zh":"对“现代事物/观念/风格”的摧毁或抹除（常为比喻用法）"},"examples":[{"en":"Some locals fear that the new policy will lead to modernicide—replacing contemporary art with only traditional designs.","zh":"一些当地人担心新政策会导致“现代毁灭”——用纯传统设计取代当代艺术。"},{"en":"The writer accused the city of modernicide after it removed many new public murals.","zh":"这位作者指责这座城市在拆除许多新的公共壁画后，犯了“现代毁灭”。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who destroys or tries to get rid of modern things, ideas, or styles","zh":"摧毁或试图清除现代事物/观念/风格的人"},"examples":[{"en":"He was labeled a modernicide for campaigning to ban modern architecture downtown.","zh":"他因倡议在市中心禁建现代建筑而被贴上“现代毁灭者”的标签。"}]}],"synonyms":["destruction of modernity","erasure of modern culture","backlash against modernity","anti-modernism"],"phonetic":"/ˌmɑː.dɚ.nəˈsaɪd/","extraExplanation":["“modernicide”不是日常高频词，更常见于评论、讽刺或修辞场景。它由 modern（现代的）+ 后缀 -cide（“杀/灭”的意思，常见于 homicide, genocide 等）构成，因此语气往往更强烈，暗示“彻底消灭”。","可数/不可数两种用法：不可数指一种“毁灭现代性的行为/现象”；可数指“实施这种行为的人”。写作中若担心过于夸张，可换成更中性的表达，如 erasure of modern culture / backlash against modernity。"]}
{"word":"modernisation","summary":{"en":"Modernisation means the process of making something more modern.","zh":"Modernisation 指把某事物变得更现代的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something more modern, especially by using new technology, methods, or ideas","zh":"现代化；使更现代的过程（尤指采用新技术、新方法或新观念）"},"examples":[{"en":"The modernisation of the railway system reduced travel time across the country.","zh":"铁路系统的现代化缩短了全国的出行时间。"},{"en":"The museum began a modernisation project to improve lighting and accessibility.","zh":"博物馆启动了现代化项目，以改善照明和无障碍设施。"}]}],"synonyms":["modernization","upgrading","renewal","revamp","reform"],"phonetic":"/ˌmɑːdərnəˈzeɪʃən/","extraExplanation":["“modernisation”是英式拼写，美式拼写更常见为“modernization”。两者意思相同。","常见搭配：modernisation of + 名词（the modernisation of education/industry/the military）；a modernisation program/plan/project（现代化计划/项目）。","语境上它往往带有“升级、效率提高、与当代接轨”的积极含义，但在社会议题中也可能引发对传统流失、成本上升、冲击就业等担忧。"]}
{"word":"modernise","summary":{"en":"Modernise means to update something to make it more modern or better suited to today.","zh":"Modernise 表示把某物更新升级，使其更现代或更符合当今需求。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something more modern by updating it (its design, equipment, methods, or style).","zh":"使现代化；通过更新设计、设备、方法或风格，让某物更现代。"},"examples":[{"en":"The city plans to modernise the public transport system.","zh":"这座城市计划使公共交通系统现代化。"},{"en":"We modernised the website so it works better on phones.","zh":"我们把网站现代化升级了，让它在手机上更好用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to adapt something old to fit present-day needs while keeping some of its original character.","zh":"在保留部分原貌的同时，使旧事物适应当代需求；改造升级。"},"examples":[{"en":"They modernised the old house but kept the original wooden floors.","zh":"他们改造了老房子，但保留了原来的木地板。"},{"en":"The company is modernising its training to meet new safety standards.","zh":"公司正在升级培训内容，以符合新的安全标准。"}]}],"synonyms":["modernize","update","upgrade","revamp","renovate"],"phonetic":"/ˈmɑdərˌnaɪz/","extraExplanation":["“modernise”是英式拼写；美式英语更常写作“modernize”。两者意思相同，只是拼写习惯不同。","在商业/政府语境中很常见：modernise often implies making systems more efficient or aligned with current standards (e.g., “modernise infrastructure / modernise legislation”)."]}
{"word":"modernised","summary":{"en":"“Modernised” (UK spelling) means made more modern; in US English it’s usually spelled “modernized.”","zh":"“modernised”（英式拼写）指“使……现代化/变得更现代”；美式英语通常拼作“modernized”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changed or updated to be more modern in style, design, technology, or methods.","zh":"被现代化的；经过更新以符合现代风格、技术或做法的。"},"examples":[{"en":"The museum has been modernised with interactive screens and better lighting.","zh":"博物馆经过现代化改造，新增了互动屏幕并改善了照明。"},{"en":"They modernised the old software so it works smoothly on new devices.","zh":"他们把旧软件现代化升级，让它在新设备上运行更顺畅。"}]},{"partOfSpeech":"v.","definition":{"en":"(UK spelling) Past form of “modernise”: to make something more modern.","zh":"（英式拼写）“modernise”的过去式/过去分词：使……现代化。"},"examples":[{"en":"The city modernised its bus system in the 2010s.","zh":"这座城市在2010年代对公交系统进行了现代化改造。"},{"en":"Many factories were modernised to improve safety.","zh":"许多工厂进行了现代化升级以提高安全性。"}]}],"synonyms":["modernized","updated","upgraded","refurbished","renovated"],"phonetic":"ˈmɑːdərnˌaɪzd","extraExplanation":["“modernised”是英式拼写；美式英语更常见的是“modernized”。两者意思完全一样。","常见搭配：modernised/modernized system（系统现代化）、modernised building（建筑翻新升级）、modernised infrastructure（基础设施现代化）。","写作提示：它通常表示“改造升级”，不一定等于“变得更时髦”；语气偏中性、偏功能性（技术/管理/设施等）。"]}
{"word":"moderniser","summary":{"en":"A moderniser is someone (or something) that makes something more modern; it’s the British spelling of “modernizer.”","zh":"moderniser 指使某事现代化的人或事物；是“modernizer”的英式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, group, or organization that makes something more modern (by updating ideas, methods, technology, or style)","zh":"使……现代化的人；推动现代化的团体/机构（通过更新观念、方法、技术或风格）"},"examples":[{"en":"The mayor was seen as a moderniser who improved public transportation and digital services.","zh":"市长被视为一位现代化推动者，他改善了公共交通并升级了数字化服务。"},{"en":"Some praised the moderniser of the school system, while others worried about losing traditions.","zh":"有人称赞这位教育体系的现代化改革者，也有人担心传统会流失。"}]}],"synonyms":["modernizer","reformer","updater","innovator"],"phonetic":"/ˈmɑdərˌnaɪzər/","extraExplanation":["“moderniser”是英式拼写，对应美式更常见的“modernizer”。英式英语里常见 -ise/-iser（modernise/moderniser），而美式英语更常见 -ize/-izer（modernize/modernizer）。两者意思相同，只是拼写习惯不同。","词根上，“modern-”表示“现代的”，后缀“-iser/-izer”表示“做某事的人/使某事发生的事物”。因此它通常用来描述“推动改革、更新制度或技术的人/机构”，语气可以是褒义（改革者）也可能带争议（过度改动者）。"]}
{"word":"modernish","summary":{"en":"Modernish means “somewhat modern”—a casual way to say something looks or feels a bit modern, but not completely.","zh":"Modernish 表示“有点现代的”，是一种较口语的说法，用来表达“看起来/感觉有些现代，但不完全现代”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat modern in style; having a slightly modern look or feel (but not fully modern).","zh":"有点现代的；带有一些现代风格的（但不算完全现代）。"},"examples":[{"en":"The apartment is modernish—new lights and paint, but the kitchen is still old.","zh":"这套公寓算是有点现代——灯和墙面是新的，但厨房还是很旧。"},{"en":"She prefers modernish furniture that feels updated without looking too trendy.","zh":"她更喜欢“有点现代”的家具：看起来更新，但不会太追潮流。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used more loosely to mean “kind of/sort of modern,” often in casual speech or writing.","zh":"（更口语）大概算现代吧；有点像现代（常用于随意表达）。"},"examples":[{"en":"It’s modernish, I guess—definitely not classic, but not super sleek either.","zh":"我觉得它大概算现代吧——肯定不是经典款，但也没那么极简高级。"}]}],"synonyms":["somewhat modern","kind of modern","sort of modern","semi-modern","contemporary-ish"],"phonetic":"ˈmɑːdɚnɪʃ","extraExplanation":["“modernish”不是非常正式的词，更常见于口语、评论、聊天或轻松的写作语气里。","后缀“-ish”常用来表示“有点……”“大概……”“不完全……”。除了形容词（modern → modernish），也能接在时间或数字后面：例如 six-ish（六点左右）、thirtyish（三十来岁）。","语气上，“-ish”往往带一点随意、模糊或轻微保留的态度：既承认相似，也暗示“还差一点”。"]}
{"word":"modernising","summary":{"en":"“Modernising” means making something modern or updating it to suit the present time (UK spelling of “modernizing”).","zh":"“modernising”指使某物现代化、更新以适应当代（英式拼写，对应美式“modernizing”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something modern or more suitable for the present time by updating its design, technology, system, or style","zh":"使现代化；通过更新设计、技术、制度或风格，使之更符合当代需求"},"examples":[{"en":"The city is modernising its public transport system to reduce traffic and pollution.","zh":"这座城市正在使公共交通系统现代化，以减少交通拥堵和污染。"},{"en":"We’re modernising the website so it works better on mobile phones.","zh":"我们正在升级网站，使它在手机上运行得更好。"},{"en":"Some schools are modernising their classrooms with new technology.","zh":"一些学校正在用新技术让教室现代化。"}]},{"partOfSpeech":"v.","definition":{"en":"(UK spelling) present participle of “modernise,” meaning “updating” or “making modern” while the action is in progress","zh":"（英式拼写）“modernise”的现在分词，表示“正在现代化/正在更新”的过程"},"examples":[{"en":"They are modernising the factory, so production will be faster next year.","zh":"他们正在对工厂进行现代化改造，因此明年生产会更快。"},{"en":"Modernising old rules can take time because people disagree about what should change.","zh":"让旧规则现代化可能需要时间，因为人们对该改什么常常有分歧。"}]}],"synonyms":["modernizing","upgrading","updating","revamping","renovating"],"phonetic":"ˈmɑdərˌnaɪzɪŋ","extraExplanation":["“modernising”是英式拼写；美式拼写通常是“modernizing”。两者意思相同，只是拼写规则不同（英式常用 -ise，美式常用 -ize）。","常见搭配：modernise/modernize a system（使系统现代化）、modernise/modernize infrastructure（更新基础设施）、modernise/modernize methods（改进方法）、modernising reforms（现代化改革）。","相关词：modernisation/modernization（现代化；更新）、moderniser/modernizer（推动现代化的人或机构）。"]}
{"word":"Modernism","summary":{"en":"Modernism is a movement and style that breaks from tradition and experiments with new forms to express modern life.","zh":"现代主义是一种打破传统并尝试新形式、用以表达现代生活经验的思潮与风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cultural and artistic movement (late 1800s–mid-1900s) that deliberately broke with traditional styles and experimented with new forms to express modern life.","zh":"现代主义：一种文化与艺术思潮（约19世纪末至20世纪中期），刻意打破传统形式，通过新的表达方式来呈现“现代生活”的体验。"},"examples":[{"en":"Modernism in art often uses bold shapes and simplified forms instead of realistic detail.","zh":"艺术中的现代主义常用大胆的形状与简化的形式，而不是写实的细节。"},{"en":"In literature, Modernism frequently shows fragmented thoughts and shifting viewpoints.","zh":"在文学中，现代主义常呈现破碎的思绪与不断变化的视角。"}]},{"partOfSpeech":"n.","definition":{"en":"Modernist ideas, style, or characteristics in a particular field (such as architecture, literature, music, or design).","zh":"（某一领域中的）现代主义风格/特征：指建筑、文学、音乐、设计等领域里带有现代主义理念与审美的做法或特征。"},"examples":[{"en":"The building’s clean lines and lack of decoration reflect Modernism.","zh":"这栋建筑的简洁线条与克制装饰体现了现代主义风格。"},{"en":"Some readers find the novel’s Modernism challenging but rewarding.","zh":"一些读者觉得这部小说的现代主义风格有难度，但很值得读。"}]}],"synonyms":["modernist movement","modernist style","avant-garde"],"phonetic":"/ˈmɑdərˌnɪzəm/","extraExplanation":["现代主义常与“工业化、城市化、科技加速、传统价值受到冲击”相关；它不只是“新”，更强调对旧规则的质疑与重建。","文学现代主义常见技巧：意识流（stream of consciousness）、非线性叙事、碎片化结构、互文与象征；代表作者常被提到的有 James Joyce、Virginia Woolf、T. S. Eliot。","不要与 postmodernism（后现代主义）混淆：后现代主义通常更强调戏仿、拼贴、对“真理/叙事”的怀疑与游戏感。"]}
{"word":"modernism","summary":{"en":"Modernism is a late-19th/early-20th-century movement in art and literature that rejected traditional forms and experimented with new ones.","zh":"现代主义是19世纪末至20世纪初的艺术与文学思潮，反对传统形式并进行创新与实验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cultural and artistic movement (especially in literature, art, and architecture) in the late 19th and early 20th centuries that broke with traditional forms and experimented with new styles and ideas","zh":"现代主义：19世纪末至20世纪初在文学、艺术与建筑等领域兴起的一种文化与艺术思潮，强调打破传统形式、进行风格与观念上的创新与实验"},"examples":[{"en":"Modernism in literature often uses fragmented storytelling and shifts in point of view.","zh":"文学中的现代主义常常使用碎片化叙事，并不断切换视角。"},{"en":"In architecture, modernism favors clean lines and practical design over decoration.","zh":"在建筑中，现代主义偏好简洁线条与实用设计，而不是繁复装饰。"}]},{"partOfSpeech":"n.","definition":{"en":"the ideas or style typical of modernist artists and writers","zh":"现代主义风格/理念：现代主义艺术家与作家常见的观念与审美特点"},"examples":[{"en":"Some readers find the modernism of that novel challenging but rewarding.","zh":"有些读者觉得那部小说的现代主义风格有挑战，但很值得。"},{"en":"Her poems show modernism through bold imagery and an emphasis on inner feelings.","zh":"她的诗通过大胆意象与对内心感受的强调体现出现代主义风格。"}]}],"synonyms":["modernist movement","avant-garde (often related)","experimental art/literature"],"phonetic":"/ˈmɑdərˌnɪzəm/","extraExplanation":["“modernism”通常指特定历史时期的“现代主义运动”，而“modern”只是“现代的”。因此“modern art（现代艺术）”不一定等同于“modernist art（现代主义艺术）”。","现代主义常与工业化、城市化、第一次世界大战前后社会巨变相关；在文学中常见“意识流（stream of consciousness）”、非线性叙事与对传统权威的怀疑。代表人物常被提到的有T. S. Eliot、James Joyce、Virginia Woolf等（不同领域代表会不同）。","相关词：modernist（现代主义者/现代主义的）；modernity（现代性，偏社会历史语境）；postmodernism（后现代主义，通常指之后的反思与延伸）。"]}
{"word":"modernist","summary":{"en":"Modernist means a Modernism supporter/creator (noun) or something in the Modernist style (adjective).","zh":"modernist 可指“现代主义者”（名词），也可指“现代主义风格的”（形容词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (especially a writer, artist, or architect) who supports or creates work in the Modernist style, often experimenting with new forms and breaking from traditional rules.","zh":"现代主义者（尤指作家、艺术家或建筑师）：支持或创作现代主义风格作品的人，常通过新形式与实验手法，打破传统规范。"},"examples":[{"en":"Virginia Woolf is often described as a modernist because of her experimental writing style.","zh":"弗吉尼亚·伍尔夫常被称为现代主义者，因为她的写作风格很具实验性。"},{"en":"Many modernists wanted art to reflect the fast changes of the early 20th century.","zh":"许多现代主义者希望艺术能反映20世纪初社会的快速变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Modernism; using modernist ideas or styles in art, literature, music, or architecture.","zh":"现代主义的；与现代主义相关的（在艺术、文学、音乐或建筑中采用现代主义理念或风格）。"},"examples":[{"en":"The novel uses modernist techniques like stream of consciousness.","zh":"这部小说使用了现代主义手法，比如“意识流”。"},{"en":"They live in a modernist building with clean lines and simple shapes.","zh":"他们住在一栋现代主义建筑里，线条简洁、造型简单。"}]}],"synonyms":["Modernism supporter","avant-garde artist","experimental (in style)"],"phonetic":"/ˈmɑːdɚnɪst/","extraExplanation":["“Modernism（现代主义）”常指19世纪末到20世纪中期在西方兴起的一系列艺术与思想潮流，强调创新与“打破旧形式”。文学中常见特征包括：碎片化叙事、视角跳跃、内心独白/意识流等。","常见的现代主义作家/诗人：James Joyce、T. S. Eliot、Virginia Woolf；建筑里常与极简线条、功能主义相联系。","注意区分：modern（现代的）是普通形容词；modernist（现代主义的/现代主义者）带有特定艺术史与风格含义。"]}
{"word":"modernistic","summary":{"en":"Modernistic usually means “connected to modernism” (a style/movement), and sometimes means “overly modern-looking” with a slight negative tone.","zh":"Modernistic通常指“现代主义的（与现代主义运动相关）”，有时也可指“过于现代化的”并带轻微负面语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to modernism (an early-20th-century movement in art, literature, architecture, and design that emphasized new forms, experimentation, and a break from traditional styles).","zh":"与“现代主义”（20世纪初的艺术、文学、建筑与设计运动）有关的；强调创新形式、实验性，并与传统风格决裂。"},"examples":[{"en":"The museum displayed modernistic paintings with bold shapes and unusual colors.","zh":"博物馆展出了现代主义风格的绘画，造型大胆、配色新奇。"},{"en":"Her modernistic writing uses fragmented scenes instead of a simple, linear story.","zh":"她的现代主义写作使用碎片化场景，而不是简单的线性叙事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a style that looks modern or “too modern,” sometimes with a slight negative feeling (suggesting it is modern in a showy or unnatural way).","zh":"看起来很“现代”的；有时带轻微贬义，暗示现代得有些刻意、浮夸或不自然。"},"examples":[{"en":"The old neighborhood felt less cozy after the modernistic glass building was built.","zh":"那座现代感十足的玻璃大楼建成后，这个老社区显得没那么温馨了。"},{"en":"Some readers find the design modernistic and cold.","zh":"有些读者觉得这个设计过于现代、显得冷冰冰的。"}]}],"synonyms":["modernist","modernist-style","contemporary (context-dependent)"],"phonetic":"/ˌmɑːdɚˈnɪs.tɪk/","extraExplanation":["“modernistic”和“modern”不完全一样：modern通常只是“现代的/当代的”；modernistic更常指“现代主义（modernism）风格的”，尤其在艺术、文学、建筑里使用更准确。","在批评语境中，modernistic有时带一点“为了显得现代而现代”的意味（轻微负面），所以要看上下文语气。","相关词：modernism（现代主义，名词）、modernist（现代主义者/现代主义风格的）、modernize（使现代化）。"]}
{"word":"modernists","summary":{"en":"Modernists are people connected to modernism—especially early-20th-century art and literature—or more generally people who prefer modern ideas over tradition.","zh":"Modernists指现代主义者：多指与20世纪初现代主义艺术/文学相关的人；也可泛指偏好现代观念而非传统的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who support or create modernism, especially in art, literature, music, or architecture (often in the early 20th century).","zh":"现代主义者：支持或创作现代主义的人，尤指艺术、文学、音乐或建筑领域（常指20世纪初）。"},"examples":[{"en":"Many modernists experimented with new styles to show the speed and anxiety of modern life.","zh":"许多现代主义者用新的风格做实验，以表现现代生活的速度与焦虑。"},{"en":"In literature class, we read modernists like T. S. Eliot and Virginia Woolf.","zh":"在文学课上，我们阅读了T. S. 艾略特和弗吉尼亚·伍尔夫等现代主义者的作品。"}]},{"partOfSpeech":"n.","definition":{"en":"People who favor modern ideas, methods, or design instead of traditional ones.","zh":"崇尚现代观念/方法/设计的人（相对于传统派）。"},"examples":[{"en":"The modernists on the committee wanted a simpler logo and a cleaner website.","zh":"委员会里的现代派希望用更简洁的标志和更清爽的网站。"},{"en":"The debate was between traditionalists and modernists in the organization.","zh":"这场争论发生在组织中的传统派与现代派之间。"}]}],"synonyms":["modernism supporters","avant-garde artists","innovators","reformers"],"phonetic":"/ˈmɑdərnɪsts/","extraExplanation":["“modernists”是“modernist”的复数。常见语境是“文学现代主义/艺术现代主义”，大致指19世纪末到20世纪中期的一批创作者与思想潮流，特点包括：打破传统叙事与形式、强调主观体验、碎片化结构、语言与视角的创新等。","容易混淆：modern（现代的）≠ modernist（现代主义的/现代主义者）。modernist更像一个“流派/立场”标签，而不只是“很现代”。"]}
{"word":"modernities","summary":{"en":"Modernities is the plural of modernity: (1) the quality of being modern, and (2) different forms of modern life, often in academic contexts.","zh":"Modernities 是 modernity 的复数：可指（1）“现代性/现代化特质”，也可指（2）不同形态的现代社会与现代生活方式（多用于学术语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being modern (using new ideas, styles, or technology)","zh":"现代性；现代化的状态或特质（采用新的观念、风格或技术）"},"examples":[{"en":"The city’s modernities are visible in its high-speed trains and digital payment systems.","zh":"这座城市的现代性体现在高速列车和数字支付系统上。"},{"en":"Some people love the modernities of online shopping, while others miss small local stores.","zh":"有些人喜欢网购这种现代化便利，也有人怀念小型本地商店。"}]},{"partOfSpeech":"n.","definition":{"en":"modern societies, cultures, or ways of life (often used in academic writing, especially when comparing different paths to being “modern”)","zh":"不同形态的现代社会/文化/生活方式（常见于学术语境，强调“走向现代”的多种路径）"},"examples":[{"en":"The book compares Asian and European modernities rather than treating modern life as one single model.","zh":"这本书比较了亚洲与欧洲的不同现代性，而不是把现代生活当作单一模式。"},{"en":"Historians debate how colonialism shaped local modernities in the 20th century.","zh":"历史学者讨论殖民主义如何在20世纪塑造了各地不同的现代性。"}]}],"synonyms":["modernity","modernization","contemporary life","modern ways"],"phonetic":"/məˈdɝːnəti/","extraExplanation":["“modernities”是“modernity”的复数形式。在日常英语里更常见的是单数“modernity”（强调“现代性”这种整体概念）。","复数“modernities”多见于社会学、历史学、文化研究等写作，用来强调“现代性不是一种”，而是不同地区、不同文化可能出现“多种现代性”（multiple modernities）。","若你只是想表达“现代的东西/现代设备”，口语中通常用更自然的说法：modern conveniences（现代便利设施）、modern technology（现代科技）、modern features（现代化功能）。"]}
{"word":"modernity","summary":{"en":"Modernity means the state of being modern or the cultural-historical era of modern society.","zh":"Modernity 指“现代性/现代特质”，也可指现代社会所处的历史文化阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or quality of being modern, especially in ideas, styles, or technology; being up to date with the present time","zh":"现代性；现代特质（尤指思想、风格或科技上的“现代”、与当下接轨）"},"examples":[{"en":"The city balances tradition and modernity in its architecture.","zh":"这座城市在建筑上平衡了传统与现代性。"},{"en":"Social media has become a symbol of modernity for many young people.","zh":"对许多年轻人来说，社交媒体已成了现代性的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical and cultural period associated with modern society and its values (such as industrialization, secular life, and rapid change)","zh":"现代社会/现代时代（与工业化、世俗化、快速变迁等价值与生活方式相关的历史文化阶段）"},"examples":[{"en":"Many novels explore how people feel lost in modernity.","zh":"许多小说探讨人们在现代社会中感到迷失的体验。"},{"en":"The museum exhibit focuses on art and design in modernity.","zh":"这场博物馆展览聚焦现代时代的艺术与设计。"}]}],"synonyms":["modernness","contemporaneity","the modern age","the modern era"],"phonetic":"/məˈdɝnəti/","extraExplanation":["“modernity”常出现在人文社科语境中，强调“现代生活方式与价值观”带来的变化（如城市化、科技进步、个人主义、节奏加快）。它不一定是褒义：既可表示进步与便利，也可指疏离感与焦虑。","区分：modern（形容词）=“现代的/新式的”；modernism（名词）=“现代主义”（艺术文学流派）；modernization（名词）=“现代化”（过程/政策/发展）。"]}
{"word":"modernizable","summary":{"en":"Modernizable means “able to be modernized or updated.”","zh":"Modernizable 的意思是“可被现代化改造/可升级的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be modernized; capable of being updated to a newer, more modern form, style, or system.","zh":"可被现代化的；能够升级为更现代的形式、风格或系统的。"},"examples":[{"en":"The old factory is modernizable if the owners invest in safer machines and cleaner energy.","zh":"这座老工厂如果业主投资更安全的机器和更清洁的能源，是可以现代化改造的。"},{"en":"We chose software that is modernizable, so it won’t become outdated quickly.","zh":"我们选择了可升级、可现代化的软件，这样它不会很快过时。"}]}],"synonyms":["upgradable","updateable","renewable","refurbishable"],"phonetic":"/ˈmɑːdərˌnaɪzəbəl/","extraExplanation":["“modernizable”由 modern（现代的）+ -ize（使……化）+ -able（可……的）构成，意思是“可以被现代化/升级的”。常见于讨论建筑、系统、设备、法规或流程的“改造与升级”。","更常见的表达是 “can be modernized / capable of being modernized”。“modernizable”本身较少见，更偏书面或技术语境。"]}
{"word":"modernization","summary":{"en":"Modernization means updating something to be more modern, or the broader social change toward a modern industrial society.","zh":"Modernization 指把事物更新为更现代，或指社会走向现代工业社会的更广泛转型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something modern by updating its systems, design, or methods","zh":"现代化；使（某事物）变得更现代的过程（更新制度、设计或方法等）"},"examples":[{"en":"The modernization of the subway system improved safety and reduced delays.","zh":"地铁系统的现代化提高了安全性并减少了延误。"},{"en":"Modernization often includes new technology and new ways of working.","zh":"现代化通常包括新技术以及新的工作方式。"}]},{"partOfSpeech":"n.","definition":{"en":"social and economic change in which a society becomes more industrial, urban, and influenced by modern ideas","zh":"（社会层面的）现代化：社会在经济与文化上转向更工业化、更城市化，并受到现代观念影响的变化过程"},"examples":[{"en":"Rapid modernization changed the town into a busy city within a generation.","zh":"快速的现代化在一代人之内把小镇变成了繁忙的城市。"},{"en":"Some people worry that modernization can weaken local traditions.","zh":"有人担心现代化会削弱本地传统。"}]}],"synonyms":["upgrading","renewal","revamp","innovation","development"],"phonetic":"/ˌmɑː.dɚ.nəˈzeɪ.ʃən/","extraExplanation":["“Modernization”常用于政策、公共设施与企业管理语境，如 modernization of infrastructure（基础设施现代化）、digital modernization（数字化现代化）。","在社会学与历史写作中，modernization 也常指一整套长期转型（工业化、教育普及、城市化、官僚制度等），有时带有价值判断色彩；写作时可用语境说明是“技术更新”还是“社会转型”。"]}
{"word":"modernizations","summary":{"en":"Modernizations means the process of making something modern, or the specific upgrades that modernize it.","zh":"Modernizations 指“使之现代化的过程”，也可指“具体的现代化升级/改造措施”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something modern (by updating design, equipment, methods, or systems)","zh":"现代化；使变得更现代的过程（更新设计、设备、方法或系统）"},"examples":[{"en":"The city planned modernizations of its subway system to improve safety and reduce delays.","zh":"这座城市计划对地铁系统进行现代化改造，以提高安全性并减少延误。"},{"en":"Many schools need modernizations, such as faster internet and updated science labs.","zh":"许多学校需要现代化升级，比如更快的网络和更新的科学实验室。"}]},{"partOfSpeech":"n.","definition":{"en":"specific updates or improvements that make something more modern","zh":"（复数）现代化改进措施；升级项目"},"examples":[{"en":"The modernizations include new software, better cybersecurity, and redesigned workflows.","zh":"这些现代化升级包括新软件、更好的网络安全以及重新设计的工作流程。"},{"en":"After the modernizations, the factory could produce more with less waste.","zh":"现代化改造后，这家工厂能以更少浪费生产更多产品。"}]}],"synonyms":["upgrades","updates","improvements","renewals","revamps"],"phonetic":"/ˌmɑː.dɚ.nəˈzeɪ.ʃənz/","extraExplanation":["“modernizations”是“modernization”的复数形式，常见于政府/城市建设、交通、学校、工厂、IT系统等语境，强调“升级换代”。","常见搭配：infrastructure modernizations（基础设施现代化）、technology modernizations（技术升级）、defense modernizations（国防现代化）、system modernizations（系统改造/升级）。","语气上通常偏正式，写作中如果想更口语，可用“upgrades”“updates”“improvements”。"]}
{"word":"modernize","summary":{"en":"Modernize means to make something more modern or to become modern by adopting updated methods or technology.","zh":"Modernize 指“使现代化/更新”，也可指“变得现代化”，通常强调采用新方法或新技术以适应当下。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to update something so it is more modern, efficient, or suitable for the present time","zh":"使现代化；更新（某物），使其更现代、更高效或更适合当下"},"examples":[{"en":"The company modernized its website to make it faster and easier to use.","zh":"公司对网站进行了现代化改造，让它更快、更好用。"},{"en":"The city plans to modernize the subway system over the next five years.","zh":"这座城市计划在未来五年内对地铁系统进行现代化升级。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become modern or adopt modern methods","zh":"变得现代化；采用现代方法"},"examples":[{"en":"Many farms have modernized by using new machines and digital tools.","zh":"许多农场通过使用新机器和数字工具实现了现代化。"}]}],"synonyms":["update","upgrade","renew","revamp","refit"],"phonetic":"/ˈmɑːdərˌnaɪz/","extraExplanation":["“modernize”常用于谈论系统、设备、机构等的升级改造，不仅是“变新”，更强调让它符合当代需求（例如更安全、更环保、更高效）。","常见搭配：modernize a system/industry/army/school/curriculum/building；modernize operations/infrastructure."]}
{"word":"modernized","summary":{"en":"“Modernized” means updated or made more modern; it can also be the past form of “modernize.”","zh":"“modernized”意为“现代化的/更新过的”，也可作动词“modernize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made more modern; updated to fit current styles, technology, or needs.","zh":"现代化的；更新过的；使更符合当代风格、技术或需求的。"},"examples":[{"en":"The hotel has been modernized with faster Wi‑Fi and keyless entry.","zh":"这家酒店进行了现代化改造，配备了更快的无线网络和无钥匙入住。"},{"en":"They modernized the old factory to meet today’s safety standards.","zh":"他们把旧工厂改造得更现代，以符合当今的安全标准。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “modernize”: to make something more modern or up to date.","zh":"“modernize”的过去式/过去分词：使某物现代化；使与时俱进。"},"examples":[{"en":"The city modernized its subway system over the past decade.","zh":"在过去十年里，这座城市对地铁系统进行了现代化升级。"},{"en":"Many schools have modernized their classrooms with tablets and smart boards.","zh":"许多学校用平板电脑和智能白板让教室实现了现代化。"}]}],"synonyms":["updated","upgraded","renovated","revamped","refreshed"],"phonetic":"/ˈmɑdərnˌaɪzd/","extraExplanation":["“modernize”的核心含义是“让旧的东西更符合当代”。常见搭配：modernized system/technology/building（现代化的系统/技术/建筑）。在写作中，它通常带有“升级、改造”的积极语气，但也可能引发“保留传统 vs. 追求现代”的讨论。"]}
{"word":"modernizer","summary":{"en":"A modernizer is someone who makes things more modern, especially a reformer who brings modern ideas to a society, organization, or system.","zh":"modernizer 指使事物现代化的人，尤指在社会、组织或制度中推动改革、引入现代观念的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that makes something more modern (for example, updating systems, methods, or ideas).","zh":"使……现代化的人（或团体）；推动更新制度、方法或观念的人。"},"examples":[{"en":"The new mayor was seen as a modernizer who wanted to update public transportation.","zh":"新市长被视为一位现代化推动者，想要升级公共交通。"},{"en":"Some modernizers argued that schools should teach more technology skills.","zh":"一些现代化推动者认为学校应该教授更多科技技能。"}]},{"partOfSpeech":"n.","definition":{"en":"a leader or reformer who introduces modern ideas into a country, organization, or tradition, often in politics or society.","zh":"（政治/社会语境中）推行现代观念的领导者或改革者；现代化改革派。"},"examples":[{"en":"He was praised as a modernizer for opening the economy and reforming outdated rules.","zh":"他因开放经济、改革陈旧规定而被称赞为现代化改革者。"},{"en":"The party split between traditionalists and modernizers.","zh":"该党分裂为传统派与现代化派。"}]}],"synonyms":["reformer","updater","innovator","progressive"],"phonetic":"/ˈmɑː.dɚn.aɪ.zɚ/","extraExplanation":["“modernizer”来自动词“modernize”（使现代化）+ 表示“做某事的人”的后缀“-er”。因此它通常指“推动现代化的人/派别”。","常见搭配：a political modernizer（政治改革派）、economic modernizers（经济现代化推动者）、traditionalists vs. modernizers（传统派 vs 现代化派）。","语气提示：在新闻或历史语境里，“modernizer”常带正面含义（更新、改革）；但在保守或传统语境中也可能带有批评色彩，暗示“过度西化/破坏传统”。"]}
{"word":"modernizers","summary":{"en":"Modernizers are people who push for modernization—new ideas, systems, or technology.","zh":"Modernizers 指推动现代化的人，即倡导引入新观念、新制度或新技术的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who introduce or support modern ideas, methods, or technology in a place, system, or organization","zh":"推动或支持在某个地方、制度或组织中引入现代观念、方法或技术的人；现代化推动者"},"examples":[{"en":"The modernizers in the ministry pushed for digital services to replace paper forms.","zh":"该部门里的现代化推动者主张用数字化服务取代纸质表格。"},{"en":"In the novel, modernizers clash with traditional leaders over education reform.","zh":"在小说中，现代化推动者与传统派领袖因教育改革发生冲突。"}]}],"synonyms":["reformers","progressives","innovators","change agents","updaters"],"phonetic":"/ˈmɑːdərˌnaɪzərz/","extraExplanation":["“modernizer”来自“modernize（使现代化）”，常用于政治、社会改革或组织变革的语境中，强调“推动改变的人”。在历史写作里也常见，比如描述某国的“modernizers vs. traditionalists（现代化派 vs. 保守派/传统派）”。","注意它通常带有“评价色彩”：在支持改革的文章里是褒义（进步、更新），在反对改革的语境里可能带有贬义（破坏传统、过度西化）。"]}
{"word":"modernizes","summary":{"en":"“Modernizes” means “makes something more modern” and is the third-person singular form of “modernize.”","zh":"“modernizes”表示“使……现代化/更新”，是“modernize”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something more modern by updating its style, technology, or methods","zh":"使现代化；通过更新风格、技术或方法让某事物更符合现代需求"},"examples":[{"en":"The company modernizes its website every few years to improve speed and usability.","zh":"这家公司每隔几年就会更新网站，使其速度更快、更好用。"},{"en":"The city modernizes old public buildings without destroying their historic character.","zh":"这座城市在不破坏历史风貌的前提下，让老旧的公共建筑实现现代化。"}]}],"synonyms":["update","renew","revamp","upgrade","refurbish"],"phonetic":"/ˈmɑːdərˌnaɪzɪz/","extraExplanation":["“modernizes”是动词“modernize”的第三人称单数（he/she/it modernizes）。常见搭配：modernize a system/industry/factory/website；modernize laws/education/military。","语气上通常是中性或褒义，强调“升级、改进以适应当下”。如果你想表达“为了迎合潮流而改得太过头”，可以用“over-modernize”或加上评价词（e.g., modernize it too much）。","和“upgrade”相比：upgrade更偏“提升等级/性能”（常用于设备、软件）；modernize更强调“变得更现代”（可能涉及外观、流程、观念等更全面的更新）。"]}
{"word":"modernizing","summary":{"en":"Modernizing means updating something to make it more modern, efficient, or suitable for today.","zh":"Modernizing 指通过更新让某事物更现代、更高效或更符合当今需求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something modern by updating its design, system, or methods","zh":"使现代化；通过更新设计、系统或方法让某事物变得更现代的过程"},"examples":[{"en":"The company is modernizing its website to make it faster and easier to use.","zh":"公司正在把网站现代化，让它更快、更好用。"},{"en":"Modernizing public transportation can reduce traffic and pollution.","zh":"交通系统现代化可以减少拥堵和污染。"}]},{"partOfSpeech":"v.","definition":{"en":"updating something to be modern; bringing something up to date","zh":"使……现代化；更新……使其跟上时代"},"examples":[{"en":"They are modernizing the factory with new machines.","zh":"他们正在用新机器让工厂现代化。"},{"en":"The city plans to modernize its power grid.","zh":"这座城市计划更新电网系统，实现现代化。"}]},{"partOfSpeech":"adj.","definition":{"en":"being updated to become modern (often used before a noun)","zh":"正在被现代化的；正在更新以变得更现代的（常用于名词前）"},"examples":[{"en":"Modernizing efforts are improving service in rural areas.","zh":"现代化措施正在改善农村地区的服务。"},{"en":"The modernizing economy creates new types of jobs.","zh":"正在现代化的经济创造了新的工作类型。"}]}],"synonyms":["updating","upgrading","renovating","revamping","refurbishing"],"phonetic":"/ˈmɑːdɚˌnaɪzɪŋ/","extraExplanation":["“modernize”是美式拼写；英式常写作“modernise”。“modernizing”可以作动名词/现在分词（表示“现代化这个过程”），也常作形容词使用（如 modernizing reforms）。"]}
{"word":"modernly","summary":{"en":"Modernly means “in a modern way,” and less commonly “nowadays/in modern times.”","zh":"modernly 表示“以现代方式”，较少见的用法是“如今/在现代”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a modern way; using modern styles, ideas, or technology.","zh":"以现代的方式；采用现代的风格、观念或技术。"},"examples":[{"en":"The apartment is modernly furnished with simple lines and light colors.","zh":"这套公寓以现代风格布置，线条简洁、颜色明亮。"},{"en":"The museum is modernly designed, with glass walls and open space.","zh":"这座博物馆采用现代化设计，有玻璃墙和开放空间。"}]},{"partOfSpeech":"adv.","definition":{"en":"In modern times; nowadays (less common and often sounds formal or old-fashioned).","zh":"在现代；如今（较少用，听起来偏正式或略显旧式）。"},"examples":[{"en":"Modernly, many people work remotely at least part of the week.","zh":"如今，许多人一周至少有部分时间远程办公。"},{"en":"Modernly speaking, social media strongly shapes public opinion.","zh":"从现代的角度说，社交媒体强烈影响公众舆论。"}]}],"synonyms":["in a modern way","in a modern style","with modern methods","nowadays","these days","in modern times"],"phonetic":"/ˈmɑdərnli/","extraExplanation":["“modernly”在日常英语里不算常用。表达“以现代方式”时更自然的替代说法包括：“in a modern way / in a modern style / with modern methods”。表达“如今/当今”更常用：“nowadays / these days / in modern times”。"]}
{"word":"modernness","summary":{"en":"Modernness means the quality of being modern; it’s understandable but less common than “modernity.”","zh":"modernness 指“现代的特质/状态”；能用但不如 modernity 常见、自然。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being modern (new, current, or using recent ideas, styles, or technology)","zh":"现代性；现代（新潮、当代、采用新观念/新风格/新技术）的特质或状态"},"examples":[{"en":"The museum’s modernness comes from its interactive digital exhibits.","zh":"这家博物馆的现代感来自它的互动式数字展品。"},{"en":"Some people like the modernness of the design, while others prefer a classic look.","zh":"有些人喜欢这种设计的现代感，另一些人更偏爱经典风格。"},{"en":"The apartment’s modernness is obvious in its open layout and smart lighting.","zh":"这套公寓的现代感很明显：开放式格局和智能照明。"}]}],"synonyms":["modernity","up-to-dateness","contemporariness","newness"],"phonetic":"/ˈmɑdɚn.nəs/","extraExplanation":["“modernness”由 modern + “-ness”（表示“性质/状态”的名词后缀）构成，意思清楚，但在日常英语里相对少见。更常用、更自然的对应词是 “modernity”（现代性/现代风格）。","语境上，“modernness”常出现在讨论设计、建筑、艺术或产品风格时，用来强调“看起来/感觉很现代”。在学术或文化讨论里，人们更倾向用 “modernity”。"]}
{"word":"modernnesses","summary":{"en":"“Modernnesses” is the rare plural of “modernness,” meaning multiple aspects or instances of being modern.","zh":"“Modernnesses”是“modernness”的少见复数形式，表示“现代性”的多个方面或多个体现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the qualities or features of being modern (plural form, often used to talk about several kinds or aspects of “modernness” in different things)","zh":"现代性的特质或特征（复数形式，常用于讨论不同事物中“现代”的多个方面）"},"examples":[{"en":"The museum’s new wing has the modernnesses of glass walls, open space, and digital guides.","zh":"博物馆的新馆翼展现出多种现代特质：玻璃墙、开放空间和数字导览。"},{"en":"Different cities show different modernnesses—some focus on technology, others on design and public transit.","zh":"不同城市呈现不同的现代特质——有的强调科技，有的强调设计与公共交通。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being modern in multiple cases or situations (rare; “modernness” is more common than “modernnesses”)","zh":"在多个情况/场景中的“现代”状态（较少见；通常用 modernness，而不是 modernnesses）"},"examples":[{"en":"Her essays compare the modernnesses of early 20th-century architecture and today’s minimalist style.","zh":"她的文章对比了20世纪初建筑与当代极简风格在“现代性”上的不同体现。"}]}],"synonyms":["modernity","contemporaneity","modern qualities","modern features","modern elements"],"phonetic":"/ˈmɑːdɚn.nə.sɪz/","extraExplanation":["“modernnesses”是“modernness”的复数，但在实际英语里非常少见，因为“modernness”本身多半当作不可数名词来用。","如果你想表达更自然、更常见的“现代性”，通常会用 **modernity**；如果强调“现代特征/现代元素”，也常用 **modern features / modern elements**。","把它写成复数（modernnesses）往往是在刻意强调“现代”的多个具体面向（例如科技、设计、生活方式等），属于比较“写作/学术化”的用法。"]}
{"word":"moderns","summary":{"en":"“Moderns” is the plural noun form of “modern,” meaning modern people or modern works/styles (often contrasted with “the ancients”).","zh":"“moderns”是“modern”的复数名词形式，常指“现代人”或“现代派作品/风格”，常与“the ancients（古人）”对比使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people of the modern era (contrasted with people from earlier times, such as the ancients)","zh":"现代人；近现代的人（常与“古人/古代人”相对）"},"examples":[{"en":"The author compares the ancients with the moderns in their views on education.","zh":"作者把古人和现代人在教育观念上的差异作了比较。"},{"en":"Some critics say the moderns value speed more than depth.","zh":"一些评论家说，现代人更重视速度而不是深度。"}]},{"partOfSpeech":"n.","definition":{"en":"modern works, styles, or artists (especially in art and literature)","zh":"现代派作品/风格/艺术家（尤指艺术与文学领域）"},"examples":[{"en":"The museum added several moderns to its collection this year.","zh":"这家博物馆今年把几件现代派作品收入馆藏。"},{"en":"She prefers the classics, but her brother studies the moderns.","zh":"她更喜欢古典作品，但她弟弟研究现代派作品。"}]}],"synonyms":["modern people","contemporaries","people today","modern artists","modern works"],"phonetic":"/ˈmɑːdɚn/","extraExplanation":["“moderns”通常是“modern”的复数名词用法，常见于对比结构：the ancients vs. the moderns（古人 vs. 现代人）。在艺术语境里，也可指“现代派作品/现代派艺术家”。","注意：日常英语里更常说“modern people / modern society / modern art”。单独用“moderns”更偏书面、评论或学术语境。"]}
{"word":"modernus","summary":{"en":"Modernus means “modern; of the present time,” mainly as a Latin/academic borrowing rather than everyday English.","zh":"modernus意为“现代的；当代的”，主要作为拉丁语/学术借用语出现，并非常见日常英语词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"modern; belonging to the present time (often used in Latin, academic, or humorous English contexts).","zh":"现代的；当代的（常见于拉丁语、学术语境或带点幽默的英语用法）。"},"examples":[{"en":"Some scholars use Latin labels like “antiquus” (ancient) and “modernus” (modern) to compare historical periods.","zh":"一些学者会用“antiquus（古代的）”和“modernus（现代的）”这样的拉丁语标签来对比不同历史时期。"},{"en":"The exhibit contrasts styles: classicus versus modernus.","zh":"这个展览对比两种风格：classicus（古典）与modernus（现代）。"}]},{"partOfSpeech":"n.","definition":{"en":"a modern person; someone aligned with modern ideas (rare, mostly in scholarly or playful use).","zh":"现代人；思想偏现代的人（较少见，多用于学术或玩笑式表达）。"},"examples":[{"en":"In the satire, the author mocks both the antiquus and the modernus.","zh":"在这篇讽刺作品中，作者既嘲笑“古人派”，也嘲笑“现代人派”。"}]}],"synonyms":["modern","contemporary","present-day"],"phonetic":"/mɑˈdɝnəs/","extraExplanation":["“modernus”是拉丁语词，来自“modo”（意为“刚才、现在、当下”）。在英语里它并不是常用日常词汇，更多出现在学术写作（如中古/近代史研究）、拉丁语格言式表达，或为了营造“古典/学院派”语气的文字里。","日常英语更常用的表达是“modern”（现代的）或“contemporary”（当代的）。当你在英文文章里看到“modernus”，通常是在借用拉丁语来做风格化对比，例如“antiquus vs. modernus”。"]}
{"word":"modes","summary":{"en":"“Modes” is the plural of “mode,” meaning different ways of doing something or different settings/operations (especially on devices); it can also mean a transportation method, the most frequent value in data, or a musical scale type.","zh":"“modes”是“mode”的复数，常指不同的方式/模式或（设备上的）工作模式；也可指交通方式、统计学中的众数或音乐中的调式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Different ways or forms of doing something; types or styles of operation or behavior.","zh":"（做某事的）方式；形式；模式；类型"},"examples":[{"en":"The app has different modes for studying: practice mode and test mode.","zh":"这个应用有不同的学习模式：练习模式和测试模式。"},{"en":"Her mood changes depending on the mode of conversation—formal or casual.","zh":"她的情绪会随着谈话方式的不同而变化——正式或随意。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular setting on a machine, device, or software that changes how it works.","zh":"（机器/设备/软件的）模式；档位；工作状态"},"examples":[{"en":"Turn on airplane mode before the flight.","zh":"飞行前请打开飞行模式。"},{"en":"Switch the camera to night mode for low light.","zh":"光线较暗时把相机切换到夜景模式。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of living, acting, or traveling; a method of transportation.","zh":"生活方式；做事方式；（交通）方式"},"examples":[{"en":"Biking is my favorite mode of transportation in the city.","zh":"在城市里，我最喜欢的交通方式是骑自行车。"}]},{"partOfSpeech":"n.","definition":{"en":"In statistics, the value that appears most often in a set of data.","zh":"（统计学）众数（出现频率最高的数值）"},"examples":[{"en":"In the list 2, 3, 3, 5, the mode is 3.","zh":"在数列 2、3、3、5 中，众数是 3。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a type of scale (such as Dorian or Mixolydian) used to create a particular sound.","zh":"（音乐）调式（如多利亚调式、混合利底亚调式等）"},"examples":[{"en":"This melody uses a mode common in folk music.","zh":"这段旋律使用了一种民谣中常见的调式。"}]}],"synonyms":["methods","ways","manner","forms","settings","options","types"],"phonetic":"/moʊdz/","extraExplanation":["“mode(s)”最常见的意思是“模式/方式”。在科技语境里尤其常见：airplane mode（飞行模式）、dark mode（深色模式）、silent mode（静音模式）。","注意拼写：mode（单数）；modes（复数）。","常见搭配：in … mode（处于……模式）；switch/change/turn to … mode（切换到……模式）；mode of transportation（交通方式）。"]}
{"word":"modest","summary":{"en":"Modest usually means humble and not showy; it can also mean fairly small or moderate, or (in cultural contexts) decently dressed.","zh":"modest 常指“谦虚、不张扬”；也可指“规模/程度不大、适中”；在文化语境中还可指“穿着端庄得体”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not too proud about your abilities or achievements; not trying to attract attention or praise.","zh":"（人）谦虚的；不炫耀的；不刻意引人注意或邀功的。"},"examples":[{"en":"She’s very modest about her success and rarely talks about awards.","zh":"她对自己的成功很谦虚，很少谈论获奖的事。"},{"en":"He gave a modest reply when people praised him.","zh":"别人夸他时，他回答得很谦逊。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not large, expensive, or extreme; fairly small or moderate.","zh":"（数量、规模、价格等）不大的；适中的；不夸张的。"},"examples":[{"en":"We live in a modest apartment near the station.","zh":"我们住在车站附近一套不大的公寓里。"},{"en":"He made a modest profit from the business.","zh":"他从生意中获得了不算高的利润。"}]},{"partOfSpeech":"adj.","definition":{"en":"Following social rules about not showing too much of the body, especially in clothing (often used in discussions of culture, religion, or personal values).","zh":"（衣着、行为）端庄的；得体的；不暴露的（常见于文化、宗教或个人价值观的语境）。"},"examples":[{"en":"The school asks students to dress modestly for the ceremony.","zh":"学校要求学生在典礼上穿着得体。"},{"en":"In some communities, modest dress is an important tradition.","zh":"在一些社群中，端庄的穿着是一项重要传统。"}]}],"synonyms":["humble","unassuming","low-key","moderate","small","simple"],"phonetic":"/ˈmɑːdɪst/","extraExplanation":["“modest”常见三类用法：①形容人的性格（谦虚、不张扬）；②形容量或程度（不大、适中）；③形容衣着行为的“端庄/得体”。第三种用法带有文化与价值观色彩，使用时注意尊重不同背景与习惯。","常见搭配：modest about (对……很谦虚)；a modest amount/price/income (不多的数量/不高的价格/一般的收入)；modest clothing/dress (端庄的衣着)。","文学与常见表达里常用“modest”来营造“低调、朴素”的气质，例如形容“a modest home（朴素的家）”“a modest beginning（平凡/不起眼的开端）”。"]}
{"word":"modester","summary":{"en":"Modester means “more modest” (either simpler/smaller, or more humble). In modern English, “more modest” is more common.","zh":"modester 表示“更 modest”（更朴素/更少，或更谦虚）。现代英语里更常用 more modest。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of modest) more modest: less showy or less expensive; smaller in size or amount.","zh":"（modest 的比较级）更朴素的／更不铺张的；（规模、数量、价格等）更小的／更少的。"},"examples":[{"en":"We chose a modester hotel to save money.","zh":"为了省钱，我们选了一家更朴素（更便宜）的酒店。"},{"en":"A modester budget means we need to cut some extras.","zh":"预算更少意味着我们得削减一些额外开支。"}]},{"partOfSpeech":"adj.","definition":{"en":"(comparative of modest) more modest: less likely to boast; more humble about your achievements.","zh":"（modest 的比较级）更谦虚的；更不爱炫耀的。"},"examples":[{"en":"He became modester after winning the award.","zh":"获奖后他变得更谦虚了。"},{"en":"She gave a modester answer and credited the whole team.","zh":"她回答得更谦逊，把功劳归于整个团队。"}]}],"synonyms":["more modest","more humble","less showy","more restrained"],"phonetic":"/ˈmɑːdəstər/","extraExplanation":["“modester”语法上是对的（modest → modester → modestest），但在现代英语里更常见的说法是用 **more modest**（尤其在正式写作中）。","另外，“Modester”在一些地区也可能是人名（如基督教语境中的美德名），这时首字母常大写：**Modester**。如果你指的是人名，请告诉我语境。"]}
{"word":"modestest","summary":{"en":"Modestest means “the most modest” (most humble, least showy), and can also mean the smallest/least or most conservative in dress/behavior.","zh":"Modestest 意为“最 modest 的”：通常指“最谦虚的”，也可指“最少/最小/最有限的”，或“衣着行为最端庄保守的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"superlative of **modest**: the **most humble**; least likely to brag or draw attention to your achievements","zh":"形容词 **modest** 的最高级：**最谦虚的**；最不爱炫耀、最不爱夸耀自己的"},"examples":[{"en":"She’s the modestest person on the team, even though she’s the top scorer.","zh":"她是队里最谦虚的人，尽管她是得分最高的。"},{"en":"Of all the nominees, he gave the modestest speech.","zh":"在所有提名者中，他的发言最谦逊。"}]},{"partOfSpeech":"adj.","definition":{"en":"the **smallest / least** in size, amount, or degree (a superlative use of *modest*)","zh":"（*modest* 的最高级用法）在大小、数量或程度上**最小的 / 最少的 / 最有限的**"},"examples":[{"en":"We’ll start with the modestest budget and expand later if it works.","zh":"我们先用最小的预算开始，如果有效再扩大。"},{"en":"He made the modestest improvement, but it was still progress.","zh":"他的进步幅度最小，但仍然是进步。"}]},{"partOfSpeech":"adj.","definition":{"en":"the **most conservative/covered** in clothing or behavior (the most “proper” by traditional standards)","zh":"（衣着或行为）最**保守/最遮掩/最端庄**的（符合传统标准的“得体”程度最高）"},"examples":[{"en":"She chose the modestest outfit for the religious ceremony.","zh":"她为宗教仪式选了最端庄的那套衣服。"}]}],"synonyms":["most modest","humblest","least boastful","most unassuming","most moderate","least showy"],"phonetic":"/ˈmɑdɪstɪst/","extraExplanation":["“modestest”在日常英语里比较少见，更自然的说法通常是 **the most modest**。不过在拼字游戏（如 Scrabble）或为了强调、对称句式时，你可能会看到“modestest”。","拼写是 **modest + -est**（最高级），所以会出现双重“-est”连在一起的视觉效果：modest-est → modestest。"]}
{"word":"modestia","summary":{"en":"Modestia means modesty or decency (mainly used in Spanish/Latin contexts; English usually uses “modesty”).","zh":"modestia 意为“谦逊”或“端庄得体”（主要见于西语/拉丁语语境；英语通常用 modesty）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish/Latin) modesty; a humble, not-showy attitude about yourself and your achievements.","zh":"（西语/拉丁语）谦逊；不张扬的态度，对自己的成就保持低调。"},"examples":[{"en":"In her speech, she spoke with modestia and thanked the whole team.","zh":"在演讲中，她以谦逊的态度发言，并感谢了整个团队。"},{"en":"The essay praises modestia as a virtue in leadership.","zh":"这篇文章称赞“谦逊”是领导力中的一种美德。"}]},{"partOfSpeech":"n.","definition":{"en":"Decency; respectful behavior, especially about clothing, privacy, or sexual matters (more common in Spanish contexts).","zh":"端庄/得体；在穿着、隐私或性相关话题上保持尊重与克制（更常见于西语语境）。"},"examples":[{"en":"The school asked students to dress with modestia during the ceremony.","zh":"学校要求学生在仪式上穿着端庄得体。"},{"en":"He discussed the topic with modestia and avoided rude jokes.","zh":"他以得体的方式讨论这个话题，避免了粗俗玩笑。"}]}],"synonyms":["modesty","humility","reserve","decency","restraint"],"phonetic":"/moʊˈdɛstiə/","extraExplanation":["“modestia”来自拉丁语 modestia（克制、适度、谦逊），在西班牙语中是常用词。英语里更常见的对应词是 modesty；“modestia”多出现在西语文本、文学/宗教语境，或作为人名/品牌名。","在一些文化语境里，“modestia”既可指性格上的谦逊，也可指行为与穿着的端庄得体；具体含义通常要看上下文。"]}
{"word":"modesties","summary":{"en":"Modesties = plural of modesty; usually means acts/expressions of modesty (often in formal phrases like “the usual modesties”), and less commonly rules/ideas about being proper in dress or behavior.","zh":"Modesties 是 modesty 的复数；通常指多种谦逊的表现（如固定搭配 the usual modesties 表示客套话/谦辞），较少情况下指关于端庄得体的观念或规范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"**Modesties** is the plural form of **modesty**. It most often means different **acts/expressions of modesty** (humble or not showy behavior), and it can also mean different **forms of “properness”** in behavior or dress.","zh":"**modesties** 是 **modesty** 的复数形式。最常见指不同的**谦逊表现/谦让之举**；也可指不同行为或穿着上的**端庄/得体**。"},"examples":[{"en":"In her speech, she began with the usual modesties, thanking everyone for their support.","zh":"在演讲中，她先按惯例表达了谦逊与感谢，感谢大家的支持。"},{"en":"Their modesties made it hard to accept praise, even when they deserved it.","zh":"他们的谦逊让他们很难接受赞美，即使那是他们应得的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) **modesties** can refer to rules or feelings about being **proper/covered** in behavior or clothing.","zh":"（较少见）**modesties** 也可指关于行为或穿着**端庄/遮掩得体**的规范或观念。"},"examples":[{"en":"The guide explained local modesties and suggested bringing a shawl for certain places.","zh":"导游讲解了当地对端庄得体的习俗，并建议去某些地方时带条披肩。"}]}],"synonyms":["humility","reserve","unpretentiousness","self-effacement","decorum","propriety"],"phonetic":"/ˈmɑdəsti/","extraExplanation":["“modesties”在现代英语里相对少见；更常见的是不可数用法“modesty”（如：Her modesty is admirable. 她的谦逊令人敬佩）。当你想强调“多次/多种谦逊的举动或客套话”时，才更可能用复数“modesties”。","在固定表达里，“the usual modesties”常指“客套话/礼貌性的谦辞”（比如先道谢、先自谦）。这是一种比较正式或略带文气的用法。","“modesty”既可指性格上的谦逊，也可指衣着行为的端庄得体；在跨文化语境中，后者的标准差异很大，使用时注意尊重不同文化与个人选择。"]}
{"word":"modestly","summary":{"en":"Modestly means (1) in a humble, not showy way, or (2) to a small/moderate degree; it can also mean dressing/acting in a socially modest, respectful way.","zh":"Modestly 表示（1）谦虚地、不炫耀地；（2）小幅/适度地；也可指穿着或举止端庄得体。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a humble way; without showing off or boasting.","zh":"谦虚地；不炫耀地；不自夸地。"},"examples":[{"en":"She accepted the award modestly and thanked her team.","zh":"她谦虚地接受了奖项，并感谢了她的团队。"},{"en":"He spoke modestly about his achievements.","zh":"他谦虚地谈到自己的成就。"}]},{"partOfSpeech":"adv.","definition":{"en":"To a small or moderate degree; not very much.","zh":"适度地；不太；在不大的程度上。"},"examples":[{"en":"The company’s profits increased modestly this year.","zh":"公司今年的利润小幅增长。"},{"en":"We made modestly good progress in a short time.","zh":"我们在短时间内取得了还算不错的进展。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that follows social rules of modesty (for example, not revealing too much of the body).","zh":"端庄地；得体地（例如穿着不暴露）。"},"examples":[{"en":"Visitors are asked to dress modestly in the temple.","zh":"参观者被要求在寺庙里穿着得体。"},{"en":"She modestly covered her shoulders with a scarf.","zh":"她用围巾端庄地遮住了肩膀。"}]}],"synonyms":["humbly","unassumingly","simply","moderately","slightly","respectfully"],"phonetic":"/ˈmɑːdəstli/","extraExplanation":["“modestly”常见有两条主线含义：①性格/态度上的“谦虚”，②程度上的“小幅、适度”。新闻或商业语境里常用第二种，比如“profits rose modestly（利润小幅上升）”。","与“humblely”相比，“modestly”更常用于“不过分、不夸张”的行为方式或程度描述；与“slightly”相比，“modestly”通常比“slightly”更正式，也暗含“合理、适度”的感觉。"]}
{"word":"modestness","summary":{"en":"Modestness means the quality of being humble and not showing off; it can also mean being proper or not too revealing, but “modesty” is more common.","zh":"modestness 指“谦逊、不张扬”的品质；也可指“端庄得体、不暴露”，但现代英语里更常用 modesty。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being modest: not bragging, not showing off, and having a humble view of your own abilities or importance.","zh":"谦逊；不自夸；对自己的能力或重要性保持低调、谦虚的态度。"},"examples":[{"en":"Her modestness made her praise feel sincere rather than arrogant.","zh":"她的谦逊让她的赞美显得真诚，而不是傲慢。"},{"en":"He spoke about his achievements with modestness, focusing on the team instead of himself.","zh":"他谦逊地谈论自己的成就，把重点放在团队而不是自己身上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The quality of being modest in appearance or behavior, especially in clothing or in situations involving privacy (similar to “modesty”).","zh":"（较少用）端庄；得体；在穿着或涉及隐私的情境中保持不暴露、不冒犯的分寸（类似 modesty）。"},"examples":[{"en":"The school asked students to dress with modestness during the ceremony.","zh":"学校要求学生在典礼上穿着端庄得体。"},{"en":"In some cultures, modestness in public behavior is highly valued.","zh":"在一些文化中，人们非常重视公共场合行为的端庄得体。"}]}],"synonyms":["modesty","humility","unpretentiousness","reserve","decorum"],"phonetic":"/ˈmɑːdɪstnəs/","extraExplanation":["“modestness”这个词能用，但在现代英语里更常见、更自然的名词是 **modesty**（谦逊/端庄）。因此写作或正式表达中通常建议用 modesty。","词形来源：modest（谦虚的、端庄的）+ -ness（构成名词，表示“……的性质/状态”）。在表达“谦逊”时，modesty 的使用频率明显更高。"]}
{"word":"modestus","summary":{"en":"*Modestus* is a Latin adjective meaning “modest, moderate, restrained,” and it also appears in scientific names to mean “plain/unshowy.”","zh":"*Modestus* 是拉丁语形容词，意为“谦逊、适度、克制”，也常出现在生物学名中表示“朴素/不显眼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin adjective) modest; moderate; restrained; keeping within proper limits.","zh":"（拉丁语形容词）谦逊的；适度的；克制的；守分寸的。"},"examples":[{"en":"In Latin, *modestus* describes someone who behaves with restraint and good judgment.","zh":"在拉丁语中，*modestus* 用来形容一个人举止克制、判断得当。"},{"en":"A *vir modestus* is “a modest (humble) man.”","zh":"*vir modestus* 的意思是“谦逊的男人”。"},{"en":"The writer praises a *modestus* lifestyle—simple and not excessive.","zh":"作者称赞一种 *modestus* 的生活方式——朴素、不铺张。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In scientific Latin) used as a species name meaning “modest” or “plain,” often referring to an unshowy appearance.","zh":"（科学拉丁语）用作物种名，意为“朴素的/不张扬的”，常指外观不显眼。"},"examples":[{"en":"In a Latin species epithet, *modestus* often suggests the animal or plant looks fairly plain.","zh":"在拉丁学名的种加词里，*modestus* 常暗示该动植物外观比较朴素。"},{"en":"Researchers may choose *modestus* to contrast with a closely related species that is more colorful.","zh":"研究者可能用 *modestus* 来对比一个更鲜艳的近缘物种。"}]}],"synonyms":["modest","moderate","restrained","temperate"],"phonetic":"/ˈmɑdɛstəs/","extraExplanation":["词源上，*modestus* 来自拉丁语 *modus*（“尺度、限度、方式”）。核心概念是“不过度、合乎分寸”。","在英语里你更常见到同源词 *modest*（谦虚的；适度的）。在生物分类命名中，*modestus* 常作为拉丁化的描述词出现。"]}
{"word":"modesty","summary":{"en":"Modesty most often means being humble and not bragging; it can also mean dressing or behaving in a way that is socially considered decent and not attention-seeking.","zh":"Modesty最常指“谦虚、不自夸”；也可指“端庄得体”的穿着或行为，避免引人注目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a humble attitude about your own abilities or importance; not bragging","zh":"谦虚；对自己的能力或重要性保持低调，不自夸"},"examples":[{"en":"She accepted the award with modesty and thanked her team.","zh":"她谦虚地接受了奖项，并感谢了她的团队。"},{"en":"His modesty makes him easy to work with.","zh":"他的谦虚让他很容易相处、合作。"}]},{"partOfSpeech":"n.","definition":{"en":"behavior or clothing that avoids attracting sexual attention; being covered in a socially acceptable way","zh":"端庄；（行为或穿着）避免引起性方面的注意，在社会可接受范围内保持遮掩得体"},"examples":[{"en":"In some places, modesty in dress is expected in religious sites.","zh":"在一些地方，进入宗教场所时通常会要求穿着端庄得体。"},{"en":"The school asked students to follow a modesty policy for clothing.","zh":"学校要求学生遵守着装端庄的规定。"}]}],"synonyms":["humility","unpretentiousness","reserve","decency"],"phonetic":"/ˈmɑdɪsti/","extraExplanation":["“modesty”在英语文化中常被视为一种美德，常与“humility（谦逊）”接近，但语气更偏向“不过分强调自己、不张扬”。在第二个含义（端庄）中，不同文化与场景的标准差异很大，使用时注意尊重当地习俗与个人选择。","文学中常出现“modesty”来塑造人物品格，例如简·奥斯汀等作品里常用它来对比“pride（傲慢）”或“vanity（虚荣）”。常见搭配：with modesty（谦虚地）、a modesty about…（对……保持低调）、modesty in dress（穿着端庄）。"]}
{"word":"modge","summary":{"en":"“Modge” can mean (1) in British dialect, “to botch/mess up,” or (2) online (especially Twitch), an emote/word meaning “thinking hard.”","zh":"“modge”既可指（1）英式方言里“搞砸/弄得很糟”，也可指（2）网络直播语境中表示“沉思/在想”的表情梗。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(British dialect) to do something badly or carelessly; to botch it; to make a mess of it.","zh":"（英式方言）把某事做得很糟/很马虎；搞砸；弄得一团糟。"},"examples":[{"en":"I tried to fix the shelf myself and completely modged it.","zh":"我想自己修架子，结果彻底搞砸了。"},{"en":"Don’t modge the paint job—take your time and do it neatly.","zh":"别把刷漆弄得乱七八糟——慢慢来，刷整齐点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Internet slang, Twitch/Discord) an emote/word used to show you’re thinking hard, pondering, or “deep in thought” (sometimes jokingly or sarcastically).","zh":"（网络俚语，Twitch/Discord）用来表示“在认真思考/沉思”的表情或用语（有时带调侃或反讽）。"},"examples":[{"en":"Chat: Modge… how did we lose that round?","zh":"弹幕：Modge……我们这局怎么会输？"},{"en":"He said it was “easy,” so everyone spammed Modge sarcastically.","zh":"他说“很简单”，所以大家就反讽式刷起了 Modge。"}]}],"synonyms":["botch","mess up","bungle","muddle","ponder"],"phonetic":"/mɑdʒ/","extraExplanation":["很多人会把手工胶水/封层产品“Mod Podge”误写成“Modge Podge”。这属于常见拼写混淆：品牌名通常是 Mod Podge（而不是 modge）。","如果你是在做手工语境里看到“modge”，它很可能只是把 Mod Podge 写错了；但在直播/弹幕语境里，“Modge”更常指“沉思”的表情梗。"]}
{"word":"modi","summary":{"en":"“Modi” is most commonly a surname—often referring to India’s prime minister, Narendra Modi; rarely, it can be the Latin plural of “modus.”","zh":"“Modi”最常见是姓氏，常用来指代印度总理纳伦德拉·莫迪；较少情况下也可作拉丁语“modus”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A common Indian surname; most internationally recognized today because of Narendra Modi, the Prime Minister of India (since 2014).","zh":"（专有名词）印度常见的姓氏；在国际上最广为人知的是因纳伦德拉·莫迪（Narendra Modi）——自2014年起担任印度总理。"},"examples":[{"en":"Modi met with the leaders during the summit.","zh":"莫迪在峰会期间会见了各国领导人。"},{"en":"Many news headlines simply say “Modi” to refer to the Indian prime minister.","zh":"许多新闻标题只写“Modi”来指代印度总理。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Plural of Latin “modus,” meaning “ways” or “modes.”","zh":"（罕见）拉丁语“modus”的复数，意思是“方式/方法”或“模式”。"},"examples":[{"en":"In some academic writing, you may see “modi” used as the plural of “modus.”","zh":"在一些学术写作中，你可能会看到“modi”作为“modus”的复数出现。"}]}],"synonyms":["(name) Narendra Modi","(rare Latin sense) modes","ways"],"phonetic":"/ˈmoʊdi/","extraExplanation":["在英语新闻与日常语境中，“Modi”几乎总是指印度总理纳伦德拉·莫迪；这是“姓氏当作代称”的常见用法（类似用“Biden/Obama”指代美国总统）。","“modi”作为拉丁语复数多出现在语言学、哲学、古典学等学术文本里；普通英语交流中很少需要用到。"]}
{"word":"modiation","summary":{"en":"Modiation is a rare historical noun meaning either a medieval English wine-import duty or, more broadly in old usage, measuring by a standard volume (like a bushel).","zh":"Modiation 是很罕见的历史名词，可指中世纪英格兰对进口葡萄酒征收的一种税，也可指古义上的“按斗/蒲式耳等标准容积进行计量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, law/commerce) A duty (tax) once paid in England on each “tierce” (large cask) of imported wine; later replaced by a different wine duty called butlerage.","zh":"（历史用语，法律/贸易）英格兰曾对每一“tierce”（大酒桶）进口葡萄酒征收的一种税（酒税）；后来被另一种酒税 butlerage 所取代。"},"examples":[{"en":"In medieval England, merchants paid modiation when they brought wine into the country.","zh":"在中世纪的英格兰，商人把葡萄酒运入国内时需要缴纳 modiation（酒税）。"},{"en":"Records mention modiation as one of several duties on imported wine.","zh":"史料中提到，modiation 是进口葡萄酒的多种税费之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) The act of measuring by a bushel (or by a similar standard measure), sometimes said of liquids as well as dry goods.","zh":"（古义）用“斗/蒲式耳”等标准容积单位进行计量的行为；有时也用于描述对液体的计量。"},"examples":[{"en":"The old dictionary notes modiation as a kind of measuring by the bushel.","zh":"旧词典里把 modiation 记作一种“按斗/蒲式耳计量”的说法。"},{"en":"In older texts, modiation may refer to standardized measuring rather than taxation.","zh":"在较早的文本中，modiation 有时指“标准化计量”，而不一定指税收。"}]}],"synonyms":["tariff","import duty","wine duty","levy"],"phonetic":"ˌmoʊdiˈeɪʃən","extraExplanation":["这个词非常罕见，现代英语里几乎不用；你在日常学习中基本不会遇到。","你输入的“modiation”也可能是拼写误差：很多学习者本来想写的是 **mediation**（调解/斡旋）、**modification**（修改）、或 **motivation**（动机）。如果你告诉我你的句子语境，我可以帮你确认你真正想用的词。","词源上常被认为与拉丁语 **modius**（一种容积量器/单位，类似“斗”）有关，所以既能发展出“计量”的含义，也可能在历史贸易语境中转指与酒类计量相关的税费。"]}
{"word":"modica","summary":{"en":"Modica is mainly a proper noun: a city in Sicily, Italy; it can also refer to Modica chocolate or be a surname.","zh":"Modica主要是专有名词：意大利西西里的一座城市；也可指莫迪卡巧克力，或用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in southeastern Sicily, Italy, known for its Baroque old town and traditional “Modica chocolate.”","zh":"（专有名词）莫迪卡：意大利西西里岛东南部的一座城市，以巴洛克风格的古城区和传统“莫迪卡巧克力”闻名。"},"examples":[{"en":"We spent a day in Modica to see the Baroque churches and hilltop views.","zh":"我们在莫迪卡待了一天，去看巴洛克教堂和山城风景。"},{"en":"Modica is one of the Late Baroque towns in the Val di Noto area recognized by UNESCO.","zh":"莫迪卡是瓦尔·迪·诺托地区被联合国教科文组织认可的晚期巴洛克城镇之一。"}]},{"partOfSpeech":"n.","definition":{"en":"short for “Modica chocolate” (cioccolato di Modica): a grainy Sicilian chocolate style traditionally made with a low-heat process that keeps sugar crystals noticeable.","zh":"（常用作定语/名词）“莫迪卡巧克力”的简称：一种西西里传统巧克力，以低温加工著称，口感常带明显的砂糖颗粒感。"},"examples":[{"en":"I brought back Modica chocolate as a souvenir.","zh":"我带了莫迪卡巧克力当纪念品。"},{"en":"If you like a less-melted, grainier texture, try Modica-style chocolate.","zh":"如果你喜欢不那么顺滑、颗粒感更明显的口感，可以试试莫迪卡风格的巧克力。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), found especially among people with Italian heritage.","zh":"（姓氏）莫迪卡：一种姓，常见于有意大利血统的人群中。"},"examples":[{"en":"Dr. Modica will speak at the conference tomorrow.","zh":"莫迪卡博士将于明天在会议上发言。"}]}],"synonyms":["(place) Ragusa area","(place) Val di Noto","(food) cioccolato di Modica"],"phonetic":"/ˈmoʊdiˌkɑ/","extraExplanation":["“Modica”在英语里通常是专有名词（地名/姓氏），不是常见的普通词汇；写作首字母大写更常见：Modica。","发音上英语使用者常读成“MOH-dee-kah”，更贴近意大利语的重音位置。","旅行与饮食语境里，你可能会看到“Modica chocolate / cioccolato di Modica（莫迪卡巧克力）”，用来指该地的特色巧克力。"]}
{"word":"modicity","summary":{"en":"Modicity (archaic) means moderation or a small/modest amount.","zh":"Modicity（古义）指“适度”，也可指“少量/微薄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) the quality of being moderate; not too much or too extreme.","zh":"（古义）适度；不过分；中庸。"},"examples":[{"en":"They praised the modicity of his spending habits—careful, restrained, and never showy.","zh":"他们称赞他花钱的适度——谨慎克制，从不铺张。"},{"en":"In older literature, “modicity” can describe a moderate amount, especially of money or comfort.","zh":"在较早的文学作品中，modicity 常用来形容一种“不过分的数量”，尤其指金钱或生活舒适度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) a small or modest amount; limited size or degree.","zh":"（古义）少量；微薄；程度不高。"},"examples":[{"en":"The modicity of the apartment’s rent made it a rare find in the city.","zh":"那套公寓房租的低廉让它在城里很难得。"},{"en":"She accepted the modicity of the reward, valuing the work more than the payment.","zh":"她接受了这份微薄的报酬，更看重工作本身而不是钱。"}]}],"synonyms":["moderation","moderateness","modesty","smallness","a modest amount","a modest sum"],"phonetic":"/moʊˈdɪsəti/","extraExplanation":["“modicity”在现代英语里非常少见，常被标注为 archaic（古义/过时用法）。日常表达更常用 moderation（适度）、modesty（朴素/不张扬）、a small amount（少量）、a modest sum（不多的一笔钱）等。","词源上它来自法语 modicité，进一步追溯到拉丁语词根 modicus（“适度的”）。","它在文学语境中更可能出现。例如亨利·詹姆斯（Henry James）的作品里用它来形容“房租的低廉/适中”（the modicity of her rent）。"]}
{"word":"modicum","summary":{"en":"Modicum means a small, limited amount—often just enough to matter.","zh":"modicum 指“少量、一点点”，常暗含“虽不多但有用/起作用”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small amount of something, especially something helpful or positive","zh":"少量；一点点（尤指有帮助或积极的事物）"},"examples":[{"en":"He showed a modicum of respect by arriving on time.","zh":"他准时到达，至少表现出了一点尊重。"},{"en":"A modicum of patience can make difficult conversations easier.","zh":"一点点耐心能让艰难的对话更容易进行。"},{"en":"Even a modicum of progress is encouraging.","zh":"哪怕只有一点进展也令人鼓舞。"}]}],"synonyms":["a little","a bit","a small amount","a trace","a hint"],"phonetic":"/ˈmɑdɪkəm/","extraExplanation":["词源来自拉丁语 modicus（“适度的、不过分的”），所以 modicum 常带有“虽然不多，但足够让情况好一点”的语感。","搭配很常见：a modicum of + 抽象名词（patience, respect, comfort, dignity, common sense 等）。","语体偏正式，写作或较正式的口语中更常见；日常口语里常用 a little / a bit 来替代。"]}
{"word":"modicums","summary":{"en":"“Modicums” means small amounts (plural of “modicum”).","zh":"“modicums”表示“少量；一点点”，是“modicum”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of **modicum**) small amounts; very small or limited quantities (often of something good or desirable).","zh":"（**modicum** 的复数）少量；一点点（常指某种好的、可取的东西的少量存在）。"},"examples":[{"en":"Even the best plans need **modicums** of flexibility.","zh":"即使是最好的计划也需要**一点点**灵活性。"},{"en":"The report offers **modicums** of evidence, but nothing conclusive.","zh":"这份报告提供了**些许**证据，但并不具有决定性。"},{"en":"They showed **modicums** of progress after weeks of practice.","zh":"经过几周练习后，他们表现出**一点点**进步。"}]}],"synonyms":["small amounts","bits","tiny quantities","iotas","traces","specks"],"phonetic":"/ˈmɑdɪkəmz/","extraExplanation":["“modicums”在现代英语里不算常见。更常见的表达是把**modicum**当作单数来用：**a modicum of + 名词**（例如 *a modicum of respect / success / truth*），强调“哪怕只有一点点也算有”。","词源来自拉丁语 *modicus*（适度的），与“尺度/分寸”（*modus*）相关，因此这个词带有“数量不大、但可被衡量的一点点”的正式语气。"]}
{"word":"modif","summary":{"en":"“modif” is a common abbreviation for “modification,” meaning a change or an update (often used in notes, logs, or forms).","zh":"“modif”常用作“modification”的缩写，表示“修改/变更”（多见于备注、日志或表格等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) modification; a change made to something.","zh":"（缩写）modification；（对某物做出的）修改、变更。"},"examples":[{"en":"I uploaded the latest modif to the document.","zh":"我把这份文件的最新修改上传了。"},{"en":"Please review the modif notes before you sign.","zh":"签字前请先查看变更说明。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., used in labels/notes) indicates that something has been modified or that a modification is being discussed (common in technical notes, logs, or forms).","zh":"（缩写，用于标签/备注）表示“已修改”或“关于修改/变更”的内容（常见于技术备注、日志或表格中）。"},"examples":[{"en":"Status: modif pending approval.","zh":"状态：变更待批准。"},{"en":"Field name (modif): use the new format.","zh":"字段名（已变更）：使用新格式。"}]}],"synonyms":["modification","change","amendment","revision","update"],"phonetic":"/ˈmɑdɪf/","extraExplanation":["“modif”在英语里通常不是一个完整单词，而是“modification”的缩写，常见于空间有限的场景：表格栏位、系统日志、工程/项目记录、文件修订说明等。正式写作里一般写全“modification”。","不要和“mod”混淆：在游戏/网络语境里“mod”更常见，可作名词（a mod）或动词（to mod a game）。而“modif”更像是记录用的缩写。"]}
{"word":"modifiability","summary":{"en":"Modifiability means how easy something is to change or adapt, especially in design and software.","zh":"Modifiability 指事物“有多容易被修改或适应”，常用于设计与软件等技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to change, adjust, or adapt without causing many problems (often used in engineering, design, and software)","zh":"可修改性；易变更性（指事物容易被更改、调整或适应，而不会引发很多问题；常用于工程、设计与软件领域）"},"examples":[{"en":"High modifiability makes the system easier to update when requirements change.","zh":"高可修改性让系统在需求变化时更容易更新。"},{"en":"The designer focused on modifiability so the product could be improved over time.","zh":"设计师强调可修改性，让产品能随着时间不断改进。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) the degree to which a structure, rule, or plan can be altered while keeping its main function or stability","zh":"（技术用语）在保持主要功能或稳定性的前提下，结构、规则或方案可被调整的程度"},"examples":[{"en":"Engineers tested the bridge design for strength and modifiability.","zh":"工程师测试了桥梁设计的强度与可修改性。"},{"en":"A modular layout increases modifiability without rewriting everything.","zh":"模块化布局能在不全部重写的情况下提高可修改性。"}]}],"synonyms":["changeability","adaptability","flexibility","maintainability","revisability"],"phonetic":"/ˌmɑːdɪfaɪəˈbɪləti/","extraExplanation":["“modifiability”来自“modify（修改）+ -ability（……的能力）”，常见于软件工程/架构讨论，和“maintainability（可维护性）”“flexibility（灵活性）”相关但不完全相同：可修改性更强调“改动是否容易、代价是否低、影响范围是否可控”。","在写作中它偏正式、学术/技术场景更常见；日常口语里更可能说“how easy it is to change”或“easy to update”。"]}
{"word":"modifiable","summary":{"en":"Modifiable means “able to be changed or adjusted.”","zh":"modifiable 意为“可被更改或调整的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be changed, adjusted, or altered (often to fit a new purpose or condition).","zh":"可修改的；可调整的；可更改的（常指为了适应新用途或新情况）。"},"examples":[{"en":"The contract is modifiable if both sides agree in writing.","zh":"如果双方书面同意，这份合同是可以修改的。"},{"en":"This lesson plan is modifiable for different age groups.","zh":"这份教案可以根据不同年龄段进行调整。"},{"en":"We need a modifiable design so we can add new features later.","zh":"我们需要一个可修改的设计，这样以后才能添加新功能。"}]}],"synonyms":["changeable","adjustable","alterable","editable","customizable"],"phonetic":"/ˈmɑdɪˌfaɪəbəl/","extraExplanation":["“modifiable”来自动词“modify”（修改、调整）+ 形容词后缀“-able”（能够……的），字面意思是“能够被修改的”。","常见搭配：modifiable contract/plan/design/settings（可修改的合同/计划/设计/设置）。在科技语境中也常指“可配置、可定制”的意思。"]}
{"word":"modifiableness","summary":{"en":"Modifiableness means the state or quality of being modifiable—able to be changed or edited.","zh":"Modifiableness 表示“可修改性”，即事物能够被更改或编辑的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being able to be changed, adjusted, or edited; being modifiable","zh":"可修改性；可调整性；可更改的性质（指能够被修改、调整或编辑的状态）"},"examples":[{"en":"The modifiableness of the schedule makes it easier to handle unexpected problems.","zh":"日程安排的可修改性让我们更容易应对突发问题。"},{"en":"In software design, modifiableness is important because requirements often change over time.","zh":"在软件设计中，可修改性很重要，因为需求常常会随着时间改变。"},{"en":"They chose a simple contract for its modifiableness if the project scope expanded.","zh":"他们选择了一份较简单的合同，以便在项目范围扩大时更容易修改。"}]}],"synonyms":["modifiability","changeability","editability","flexibility","malleability"],"phonetic":"/ˌmɑːdəˈfaɪəbəlnəs/","extraExplanation":["“modifiableness”是由形容词“modifiable（可修改的）”加名词后缀“-ness”构成，意思是“……的性质/状态”。在现代英语里，这个词比较少见；更常用、更自然的表达是“modifiability（可修改性）”或直接说“the ability to modify / be modified（修改/被修改的能力）”。","使用场景多见于技术写作、工程或学术语境，用来讨论系统、代码、规则、计划等是否“容易改、允许改、改起来代价低”。日常对话中通常不会用这个词。"]}
{"word":"modifiably","summary":{"en":"“Modifiably” means “in a way that can be modified or changed.” It’s uncommon and often replaced by simpler phrasing.","zh":"“modifiably”表示“以可被修改/可被更改的方式”。它较少见，常用更简单的说法替代。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be changed, adjusted, or revised (i.e., not fixed or final).","zh":"以可以被改变、调整或修订的方式（即并非固定不变或最终定稿）。"},"examples":[{"en":"The schedule is modifiably flexible if the client requests changes.","zh":"如果客户提出变更，这个日程安排是可以调整的。"},{"en":"These settings are modifiably stored, so you can update them later.","zh":"这些设置以可修改的方式保存，因此你之后可以更新。"}]}],"synonyms":["changeably","adjustably","flexibly","subject to modification","in a modifiable way"],"phonetic":"/ˈmɑː.də.faɪ.ə.bli/","extraExplanation":["“modifiably”在日常英语里比较少见，更多时候人们会说“in a way that can be modified”“subject to modification”或直接用形容词“modifiable”（如：The plan is modifiable）。","构词上是 modifiable（可修改的）+ -ly（副词后缀），通常出现在技术写作、合同条款或学术表达中，用来强调“可被修改/可调整”这一性质。","写作建议：如果是一般交流，用更自然的表达会更清楚，例如：“The plan can be changed later.”（这个计划之后可以改。）"]}
{"word":"modificability","summary":{"en":"“Modificability” is usually a nonstandard spelling of **modifiability**: the ability/ease of being modified, especially in systems or software.","zh":"「modificability」通常是 **modifiability（可修改性）** 的非標準拼寫：指可被修改的能力／容易程度，尤常見於系統或軟體語境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) The quality of being able to be modified; **modifiability**.","zh":"（非標準拼寫）可被修改的性質；即 **modifiability（可修改性）**。"},"examples":[{"en":"Good software architecture improves a system’s modifiability.","zh":"良好的軟體架構能提升系統的可修改性。"},{"en":"The contract’s terms have limited modifiability after signing.","zh":"合約簽署後條款的可修改性有限。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in software/engineering) How easily and safely a system can be changed without causing defects or reducing quality.","zh":"（尤指軟體／工程）系統在不引入缺陷、且不降低品質的情況下，被有效率地更改的程度。"},"examples":[{"en":"Teams measure modifiability by the time and risk required to implement a change.","zh":"團隊會用完成變更所需的時間與風險來衡量可修改性。"}]}],"synonyms":["modifiability","changeability","mutability","flexibility","adaptability"],"phonetic":"ˌmɑdəˌfaɪəˈbɪləti","extraExplanation":["「modificability」在一般英語中很少見，多數情況是把 **modifiability** 拼錯或誤寫；正式寫作（尤其學術與技術文件）建議使用 **modifiability**。","在軟體品質語境中，modifiability 常與 maintainability（可維護性）、changeability（可變更性）、flexibility（彈性）一起討論；意思偏向「改動的成本、速度、風險」而不只是「能不能改」。"]}
{"word":"modificable","summary":{"en":"“Modificable” is not standard English; the usual English word is “modifiable,” meaning “able to be changed or adjusted.”","zh":"“modificable”不是规范英语；英语通常用“modifiable”，表示“可被改变或调整的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard in English) Capable of being modified; able to be changed or adjusted. In correct English, this is usually written as **modifiable**.","zh":"（在英语中不规范/少见）可被修改的；可更改、可调整的。规范英语通常写作 **modifiable**。"},"examples":[{"en":"The settings are modifiable, so you can adjust them later.","zh":"这些设置是可修改的，所以你之后可以再调整。"},{"en":"We need a modifiable plan in case the schedule changes.","zh":"我们需要一个可调整的计划，以防日程有变。"}]}],"synonyms":["modifiable","changeable","adjustable","alterable","editable"],"phonetic":"/ˈmɑːdɪˌfaɪəbəl/","extraExplanation":["“modificable”更常见于西班牙语（以及部分其他罗曼语）里，意思是“可被修改的”。如果你是在写英语，通常应写 **modifiable**。","英语里 **modifiable** 常见搭配：modifiable settings / modifiable template / modifiable risk factors（医学里常说“可改变的风险因素”）。","近义词常用：**changeable**, **adjustable**, **alterable**；反义词：**fixed**, **unchangeable**。"]}
{"word":"modificand","summary":{"en":"A modificand is the word or phrase that receives modification (the “thing being modified”).","zh":"modificand 指“被修饰的词/短语”，也就是接受修饰的对象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(grammar/linguistics) The word or phrase that is being modified by another word or phrase (the modifier).","zh":"（语法/语言学）被另一个词或短语（修饰语）修饰的词或短语。"},"examples":[{"en":"In the phrase “red car,” the modificand is “car,” and “red” is the modifier.","zh":"在短语“red car（红色的车）”中，modificand 是 “car”，而 “red” 是修饰语。"},{"en":"In “very quickly,” “quickly” is the modificand and “very” is the modifier.","zh":"在“very quickly（非常快地）”中，“quickly”是 modificand，“very”是修饰语。"},{"en":"When analyzing a noun phrase, identify the head noun as the modificand and then list its modifiers.","zh":"分析名词短语时，把中心名词当作 modificand，再列出修饰它的成分。"}]}],"synonyms":["head","head word","head noun","modified element"],"phonetic":"/ˌmɑː.də.fɪˈkænd/","extraExplanation":["modificand 常见于语言学、语法分析或句法学教材里，日常英语里很少用。更常见的说法是 head（中心词/中心语）或 head word（中心词）。","在不同结构里，modificand 不一定是名词：也可能是动词、形容词或副词（例如 very + adj/adv 结构中，被 very 修饰的那个词就是 modificand）。"]}
{"word":"Modificare","summary":{"en":"“Modificare” is an Italian verb meaning “to modify; to change/adjust.”","zh":"“Modificare”是意大利语动词，意思是“修改；改变/调整”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Italian) to change or adjust something; to modify.","zh":"（意大利语）修改；改变；调整。"},"examples":[{"en":"Can you modificare the document before sending it?","zh":"你能在发送前修改一下这份文件吗？"},{"en":"They decided to modificare the recipe to make it less sweet.","zh":"他们决定调整配方，让它没那么甜。"}]}],"synonyms":["modify","change","adjust","amend","alter"],"phonetic":"/ˌmoʊdɪfɪˈkɑreɪ/","extraExplanation":["“Modificare”不是常见英语单词，而是意大利语动词原形（不定式），意思相当于英语的 modify / change / adjust。","词源可追溯到拉丁语 modificare，与英语 modify（修改）是同源词，因此在学术或多语言语境中看到它并不罕见。","如果你是在英语写作中使用，通常应改用英语动词：modify / change / amend；除非是在引用意大利语原文或做语言学讨论。"]}
{"word":"modificare","summary":{"en":"“Modificare” is an Italian verb meaning “to modify, adjust, or change.” In English writing, the usual equivalent is “modify.”","zh":"“modificare”是意大利语动词，意思是“修改、调整、改变”。在英文写作中通常用“modify”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Italian) to modify; to change something slightly, especially to improve it or make it fit a new situation.","zh":"（意大利语）修改；调整；（尤指为改进或适应新情况而）小幅改变某物。"},"examples":[{"en":"Can you modificare the document before we send it?","zh":"你能在我们发送之前把这份文件修改一下吗？"},{"en":"They had to modificare the plan to match the new budget.","zh":"他们不得不调整计划以符合新的预算。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Italian) to transform/alter; to make something become different in form, character, or condition.","zh":"（意大利语）改变；使发生变化；使在形式、性质或状态上变得不同。"},"examples":[{"en":"Time can modificare people’s priorities.","zh":"时间会改变人们的优先顺序。"},{"en":"The heat modificare the color of the material.","zh":"高温改变了材料的颜色。"}]}],"synonyms":["modify","change","alter","adjust","amend"],"phonetic":"/ˌmoʊdɪfɪˈkɑːreɪ/","extraExplanation":["“modificare”是意大利语动词，来自拉丁语词根，和英语的 modify / modification 同源（都与“改变、调整”有关）。在英语语境里更常用的是 modify（动词）和 modification（名词）；“modificare”多见于意大利语文本、音乐术语说明、或在讨论意大利语时作为引用词出现。","用法提示：意大利语里它可用于日常“修改文件/计划”，也可用于较抽象的“改变性格/状态”。如果你是在写英文，通常改用 modify / amend（正式文件）/ alter（变化更明显）。"]}
{"word":"modification","summary":{"en":"Modification means a change or the process of changing something, often to improve it; in grammar, it can mean the act of describing/limiting another word.","zh":"Modification 指对某物做出的改动或修改的过程，常含“为改进或适配而调整”的意味；在语法中也可指“修饰（关系）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a change made to something, usually to improve it or make it suitable for a new purpose","zh":"对某物做出的改动（通常为了改进或使其适用于新的用途）"},"examples":[{"en":"We need to make a few modifications to the design before production.","zh":"在投入生产前，我们需要对设计做一些修改。"},{"en":"The house has been updated with modern modifications.","zh":"这栋房子经过改造，加入了现代化的改动。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of changing something; altering","zh":"修改的行为或过程；变更"},"examples":[{"en":"The modification of the schedule caused some confusion.","zh":"时间表的调整引起了一些困惑。"},{"en":"Language changes through constant modification over time.","zh":"语言会随着时间在不断的变化与调整中演变。"}]},{"partOfSpeech":"n.","definition":{"en":"(grammar) a word or phrase that describes or limits the meaning of another word; the relationship of “modifying”","zh":"（语法）修饰（关系）：用词或短语对另一个词进行描述或限定其意思"},"examples":[{"en":"In “a very cold day,” “very” is a modification of “cold.”","zh":"在 “a very cold day” 中，“very” 修饰 “cold”。"}]}],"synonyms":["change","alteration","adjustment","revision","amendment","tweak"],"phonetic":"/ˌmɑːdɪfɪˈkeɪʃən/","extraExplanation":["常见搭配：make a modification（做出修改）、minor/major modification（小/重大修改）、design modification（设计变更）、without modification（不加改动）。","词源提示：modification 来自 modify（修改）+ -cation（名词后缀，表示“过程/结果”）。在正式写作中常用，比 change 更强调“经过调整后的版本/改动点”。"]}
{"word":"modificationist","summary":{"en":"A modificationist is someone who supports changing an existing system or ideas; the word can be neutral (reform-minded) or critical (accused of revising orthodoxy).","zh":"modificationist 指主张对既有制度或观念进行改变的人；可中性表示“改良派”，也可作贬义标签指“修正正统者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports changing (modifying) a traditional system, belief, law, or practice—usually by reforming it rather than keeping it unchanged","zh":"主张对传统制度、信仰、法律或做法进行改变（改良）的人；改良主义者"},"examples":[{"en":"Some party members called her a modificationist because she wanted to update the constitution instead of replacing it.","zh":"一些党内成员称她为改良主义者，因为她主张更新宪法，而不是彻底推翻重写。"},{"en":"The debate was framed as traditionalists versus modificationists.","zh":"这场辩论被描述为传统主义者对改良主义者之争。"}]},{"partOfSpeech":"n.","definition":{"en":"a person (especially within a movement or ideology) seen as “revising” or softening official ideas; often used as a critical label by opponents","zh":"（尤指在某种运动或意识形态内部）被认为在“修正”或淡化官方/正统观点的人；常为对立者带贬义的标签"},"examples":[{"en":"Hardliners accused him of being a modificationist after he questioned the group’s founding principles.","zh":"他质疑该组织的创立原则后，强硬派指责他是“修正派”。"},{"en":"In polemical writing, “modificationist” can function as a political insult.","zh":"在论战性文章中，“modificationist”有时会被当作政治性贬称。"}]}],"synonyms":["reformer","revisionist","moderate","progressive","revising-minded"],"phonetic":"/ˌmɑːdɪfɪˈkeɪʃənɪst/","extraExplanation":["“modificationist”来自 modification（修改、改良）+ -ist（……主义者/支持者）。日常英语里更常见的近义表达有 reformer（改革者）、revisionist（修正主义者/修订者，语气可能更尖锐）、moderate（温和派）。","语体上它偏正式、偏政治或思想争论场景使用；在新闻与学术语境里可相对中性，但在对立阵营的口号或批评中往往带负面色彩。","搭配提示：常见结构是 “a modificationist approach/agenda”（改良式的方法/议程）或 “be labeled/accused as a modificationist”（被贴上/被指为修正派）。"]}
{"word":"modifications","summary":{"en":"“Modifications” means changes or adjustments made to improve or adapt something, often used in formal, legal, or technical contexts.","zh":"“modifications”指为改进或适应需要而做出的改动/调整，常见于正式、法律或技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Changes made to something (often to improve it or make it fit a new purpose).","zh":"对某物做出的改动（常为改进或使其适应新用途）。"},"examples":[{"en":"We made a few modifications to the design to reduce cost.","zh":"我们对设计做了几处修改，以降低成本。"},{"en":"The building needs modifications to be accessible for wheelchair users.","zh":"这栋楼需要做一些改造，才能方便轮椅使用者通行。"}]},{"partOfSpeech":"n.","definition":{"en":"In official or legal contexts, changes to an agreement, plan, or rule; amendments.","zh":"（正式或法律语境）对协议、计划或规定的变更；修订。"},"examples":[{"en":"Any modifications to the contract must be in writing.","zh":"对合同的任何变更都必须以书面形式进行。"},{"en":"The policy includes modifications based on public feedback.","zh":"该政策包含根据公众反馈做出的调整。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing or engineering, changes to a system, software, or machine (often after the original version is made).","zh":"（计算机/工程）对系统、软件或机器的改动（常指在原版本基础上进行）。"},"examples":[{"en":"The app works better after several modifications.","zh":"经过几次修改后，这个应用运行得更好了。"},{"en":"Unauthorized modifications may void the warranty.","zh":"未经授权的改动可能导致保修失效。"}]}],"synonyms":["changes","adjustments","alterations","revisions","amendments","updates"],"phonetic":"/ˌmɑdəfəˈkeɪʃənz/","extraExplanation":["“modifications”是复数，常用来强调“多处改动/多项调整”。单数“modification”指“一处改动/一项调整”。","搭配很常见：make modifications to…（对……做修改/调整）；minor/major modifications（小幅/重大改动）；design/software modifications（设计/软件修改）。","在无障碍语境中，modifications 有时更接近“改造/适配”（例如为残障人士提供便利的设施调整）。"]}
{"word":"modificative","summary":{"en":"Modificative means “serving to modify,” especially in grammar/linguistics; it is less common than “modifying” or “modifier.”","zh":"modificative 意为“起修饰作用的”，多用于语法/语言学语境；日常更常用 modifying 或 modifier。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar/Linguistics) Used to describe a word, phrase, or clause that modifies something else (adds information about it).","zh":"（语法/语言学）用于描述“修饰”别的成分的词、短语或从句（为其补充信息）。"},"examples":[{"en":"In “a very old house,” “very” is a modificative adverb that modifies “old.”","zh":"在 “a very old house（一个非常老的房子）” 中，“very” 是修饰性副词，用来修饰 “old”。"},{"en":"The teacher asked us to label the modificative phrases in the sentence.","zh":"老师让我们标出句子中的修饰性短语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the function of changing, limiting, or qualifying something; serving as a modifier (general use, less common than “modifying” or “modifier”).","zh":"具有改变、限制或限定某物的作用；起修饰作用的（一般用法，但不如 “modifying / modifier” 常见）。"},"examples":[{"en":"This remark was meant as a modificative comment, not a criticism.","zh":"这句话是想起到补充修饰的作用，并不是批评。"},{"en":"Some writers prefer simpler wording instead of the more modificative style.","zh":"有些作者更喜欢更简洁的表达，而不是更偏修饰性的写法。"}]}],"synonyms":["modifying","descriptive","qualifying","restrictive","attributive"],"phonetic":"/ˈmɑdɪfɪˌkeɪtɪv/","extraExplanation":["“modificative”在现代英语里偏少见，更多出现在语法/语言学或较正式的写作中。日常表达里更常用：\n- modifying（正在修饰的）\n- modifier（修饰语/修饰成分）\n例如：a modifying phrase（修饰性短语），an adjective modifier（形容词作修饰语）。","在语法标注中，“modificative”常与“predicative（表语性的）”对比：\n- modificative：放在名词前后，起修饰作用（a happy child；the child in the yard）\n- predicative：放在系动词后，说明主语状态（The child is happy）。"]}
{"word":"modificator","summary":{"en":"“Modificator” is a rare word meaning something that modifies or changes something else; in most contexts, “modifier” is the natural choice.","zh":"“modificator”是个少见词，意为“起修饰/改变作用的人或事物”；多数语境下更地道的说法是“modifier”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonstandard) something or someone that modifies, changes, or adjusts something else; essentially the same idea as a “modifier.”","zh":"（少见/不太规范）指“起修饰、改变或调整作用的人或事物”；意思基本等同于 modifier（修饰语/修饰成分；改性剂）。"},"examples":[{"en":"In some older or technical writing, a substance may be called a modificator because it changes a material’s properties.","zh":"在一些较老或偏技术的写法中，某种物质可能被称为 modificator，因为它会改变材料的性质。"},{"en":"In grammar, people usually say “modifier,” not “modificator.”","zh":"在语法里，人们通常说“modifier”，而不是“modificator”。"}]}],"synonyms":["modifier","agent of change","altering factor"],"phonetic":"/ˈmɑːdɪfəˌkeɪtɚ/","extraExplanation":["“modificator”在现代英语里很少见，很多情况下会被认为是不自然或不规范的用词。更常见、更地道的表达是：\n- 语法/语言学：modifier（修饰语；修饰成分）\n- 化学/材料：modifier（改性剂；改质剂）\n- 一般语境：something that modifies / an agent that modifies（起改变作用的东西/因素）","词源上与 modify（修改、改变）同源：来自拉丁语词根（mod- 表“衡量/方式”，与 change/adjust 的概念相关）。但在现代英语里，-ator 结尾（如 operator, accelerator）虽常见，“modificator”并没有像“modifier”那样固定成高频标准词。"]}
{"word":"modificatory","summary":{"en":"“Modificatory” means “intended to make changes,” especially in formal or legal contexts.","zh":"“modificatory”表示“用于作出修改/变更的”，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to change, adjust, or make alterations to something (often in formal or legal writing).","zh":"用于对某事进行修改、调整或变更的（常见于正式或法律语境）。"},"examples":[{"en":"The committee proposed modificatory changes to the policy before voting.","zh":"委员会在投票前提出了对该政策的修改性调整。"},{"en":"The contract includes a modificatory clause that allows updates to the terms.","zh":"合同包含一条修改性条款，允许更新条款内容。"}]}],"synonyms":["modifying","amending","altering","revisional","corrective"],"phonetic":"/ˈmɑdɪfəˌkeɪtəri/","extraExplanation":["“modificatory”较偏正式，日常英语里更常用“modifying”“amending”或“revisional”。在法律与行政文件中，它常用来描述“具有修改效力的”条款、意见或措施。","词源上与“modify（修改）”同源，后缀“-tory”常表示“具有……作用/性质的”（如“explanatory”“mandatory”），因此“modificatory”强调“起到修改作用”。"]}
{"word":"modified","summary":{"en":"Modified means changed from the original, usually slightly, to improve it or make it suitable for a new purpose.","zh":"Modified 指从原本状态被改动（常为小幅度），以改进或适应新的用途。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changed slightly (or in some way) to improve something or make it suitable for a new purpose","zh":"（为改进或适应新用途而）被修改的；调整过的"},"examples":[{"en":"We used a modified version of the plan to fit the smaller budget.","zh":"我们使用了这个计划的修改版，以适应更小的预算。"},{"en":"The car has a modified engine, so it’s faster than the standard model.","zh":"这辆车的发动机被改装过，所以比标准款更快。"}]},{"partOfSpeech":"adj.","definition":{"en":"not in its original or pure form; changed by something else (common in science/medical contexts)","zh":"（常用于科学/医学语境）非原始/纯粹形态的；被改变过的"},"examples":[{"en":"The patient was given a modified diet after surgery.","zh":"手术后，病人被安排了改良饮食。"},{"en":"Scientists studied a modified protein to see how it behaves.","zh":"科学家研究了一种被改造的蛋白质，看它如何表现。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “modify”: to change something, usually slightly, to improve it or make it fit","zh":"“modify”的过去式/过去分词：修改；调整（通常是小幅度地）"},"examples":[{"en":"I modified the email to sound more polite.","zh":"我把邮件改了一下，让语气更礼貌。"},{"en":"The rules were modified to make the game safer.","zh":"规则被修改了，让比赛更安全。"}]}],"synonyms":["changed","adjusted","altered","revised","adapted"],"phonetic":"/ˈmɑːdɪˌfaɪd/","extraExplanation":["“modified”常作形容词使用，表示“已经被改过/调整过”。在搭配上很常见：modified plan（修改后的计划）、modified schedule（调整后的时间表）、modified version（修改版）。","在语法里，modify 也可指“修饰”：例如 adjectives modify nouns（形容词修饰名词）。不过日常中说“a modified noun”不如说“a modified plan/version”常见。"]}
{"word":"modifier","summary":{"en":"A modifier is a word/phrase that adds description or limits meaning; more generally, it’s something that changes or influences something else.","zh":"modifier 指“修饰语”（对词语作描述或限定）；也可泛指“改变或影响其他事物的东西/因素”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Grammar) A word or phrase that describes, limits, or gives more information about another word (often a noun or verb).","zh":"（语法）修饰语：用来描述、限定或补充说明另一个词的词或短语（常修饰名词或动词）。"},"examples":[{"en":"In the phrase “a very tall building,” “very” is a modifier of “tall.”","zh":"在短语“a very tall building（非常高的建筑）”中，“very”是修饰“tall”的修饰语。"},{"en":"The words “on the table” work as a modifier telling us where the book is.","zh":"“on the table（在桌上）”起修饰作用，说明书在哪里。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that changes, adjusts, or influences something else.","zh":"（泛指）修改物／调节因素：能改变、调整或影响其他事物的东西（或因素）。"},"examples":[{"en":"Heat can be a modifier that changes how a material behaves.","zh":"热量可能是一种会改变材料表现的调节因素。"},{"en":"In photography, light is an important modifier of mood.","zh":"在摄影中，光线是影响氛围的重要调节因素。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A key used together with another key to change what it does (for example, Shift, Ctrl, or Alt).","zh":"（计算机）修饰键：与其他按键一起使用，用来改变其功能的键（如 Shift、Ctrl、Alt）。"},"examples":[{"en":"Hold the Shift key as a modifier to type a capital letter.","zh":"按住 Shift 作为修饰键来输入大写字母。"},{"en":"Ctrl is commonly used as a modifier for shortcuts.","zh":"Ctrl 常作为修饰键用于快捷键操作。"}]}],"synonyms":["qualifier","descriptor","adjuster","influence"],"phonetic":"/ˈmɑːdɪˌfaɪər/","extraExplanation":["在英语语法里，modifier（修饰语）范围很广：可以是形容词（a red car）、副词（run quickly）、介词短语（the man in a hat）、分词短语（students studying abroad）等。","英语里常强调“修饰语位置很重要”。放错位置会产生歧义，这叫 misplaced modifier（错置修饰）。例如：“I saw the man with binoculars.” 可能表示“我用望远镜看见那个人”，也可能表示“我看见了拿着望远镜的人”。"]}
{"word":"modifiers","summary":{"en":"Modifiers are descriptive words or phrases that add detail to another word.","zh":"modifiers 指用来增加细节、让意思更具体的修饰语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word, phrase, or clause that describes or gives more information about another word (often making the meaning more specific).","zh":"修饰语：用来描述或补充说明另一个词的词、短语或从句（常让意思更具体）。"},"examples":[{"en":"In “a very cold day,” “very cold” is a modifier of “day.”","zh":"在 “a very cold day” 中，“very cold” 修饰 “day”。"},{"en":"The phrase “with a red cover” modifies “book.”","zh":"短语 “with a red cover” 修饰 “book”。"}]},{"partOfSpeech":"n.","definition":{"en":"In some fields (like biology or genetics), something that changes the effect, behavior, or expression of something else (for example, a “modifier gene”).","zh":"（某些领域如生物/遗传学）修饰因子：会改变另一个因素的作用、表现或结果的东西（如“修饰基因”）。"},"examples":[{"en":"Scientists studied a modifier gene that affects how strongly a trait appears.","zh":"科学家研究了一种修饰基因，它会影响某个性状表现得有多明显。"}]}],"synonyms":["descriptors","qualifiers","modifying words","adjuncts"],"phonetic":"/ˈmɑːdɪˌfaɪərz/","extraExplanation":["在英语语法里，modifier（修饰语）常见类型包括：形容词修饰名词（a quiet room）、副词修饰动词/形容词/副词（run quickly / very quiet / incredibly fast）、介词短语修饰名词或动词（the man in the hat / sleep on the sofa）、以及定语从句修饰名词（the book that I bought）。","学习时要特别注意“修饰语位置”会影响理解：有些修饰语放错位置会产生歧义或搞笑的“悬垂修饰语”（dangling modifier），例如：Walking down the street, the trees looked beautiful.（好像树在走路）更自然是：Walking down the street, I thought the trees looked beautiful."]}
{"word":"modifies","summary":{"en":"“Modifies” means (1) makes a small change or adjustment, or (2) in grammar, describes another word.","zh":"“modifies”表示（1）对事物做小改动/调整；（2）在语法中表示“修饰”另一个词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"changes something slightly (to improve it or make it more suitable); makes an adjustment","zh":"（对某事物）稍作改变或调整（使其更好或更合适）"},"examples":[{"en":"She modifies the recipe by using less sugar.","zh":"她把食谱稍作修改，少放糖。"},{"en":"The school modifies its schedule during exam week.","zh":"考试周期间，学校会调整作息时间。"},{"en":"This plan modifies the original idea to fit the budget.","zh":"这个方案在原想法基础上做了调整，以符合预算。"}]},{"partOfSpeech":"v.","definition":{"en":"(grammar) describes or gives more information about a word or phrase","zh":"（语法）修饰（某个词或短语），提供更多信息"},"examples":[{"en":"In “very cold,” the word “very” modifies “cold.”","zh":"在“very cold”中，“very”修饰“cold”。"},{"en":"The adjective modifies the noun it comes before.","zh":"形容词修饰它后面的名词。"}]}],"synonyms":["changes","adjusts","alters","revises","adapts"],"phonetic":"/ˈmɑdəˌfaɪz/","extraExplanation":["“modifies”是动词“modify”的第三人称单数现在时：He/She/It modifies...；否定：doesn’t modify；疑问：Does it modify...?","在语法里，常见搭配是“modify + noun/verb/adjective”，例如：adverb modifies a verb（副词修饰动词）。"]}
{"word":"modify","summary":{"en":"Modify means to make small changes to improve, adapt, or adjust something; in grammar, it means to describe or limit another word’s meaning.","zh":"Modify 指对某物做小幅度的修改/调整以改进或适应；在语法中指“修饰”其他词语、限定其意义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change something slightly, usually to improve it or make it more suitable for a new purpose","zh":"（通常指小幅度地）修改、调整（使其更好或更适用）"},"examples":[{"en":"We need to modify the schedule because the meeting time changed.","zh":"会议时间变了，我们需要修改日程表。"},{"en":"The teacher asked me to modify my essay to make the main idea clearer.","zh":"老师让我修改作文，让中心思想更清楚。"}]},{"partOfSpeech":"vt.","definition":{"en":"to change the form or details of something; to adapt","zh":"改变某物的形式或细节；使适应（某种情况）"},"examples":[{"en":"The company modified the product for the Asian market.","zh":"公司为了亚洲市场对产品做了调整。"},{"en":"You can modify this recipe by using less sugar.","zh":"你可以把糖放少一点来改这个食谱。"}]},{"partOfSpeech":"vt.","definition":{"en":"(grammar) to describe or limit the meaning of a word, usually by adding extra information","zh":"（语法）修饰；限定（一个词的意义，通常通过补充信息）"},"examples":[{"en":"In “a very cold day,” “very” modifies “cold.”","zh":"在“a very cold day”中，“very”修饰“cold”。"},{"en":"Adjectives often modify nouns.","zh":"形容词常用来修饰名词。"}]}],"synonyms":["adjust","revise","alter","adapt","edit"],"phonetic":"/ˈmɑːdɪˌfaɪ/","extraExplanation":["“modify”来自拉丁语词根 *mod-*（表示“尺度/方式”），原意带有“按某种方式调整”的感觉，所以常指“改一点点、让它更合适”，而不是彻底推翻重来。","在日常用法里，“modify”通常比“change”更正式，也更强调“局部调整/优化”。例如软件更新说明里常写“modified settings（已调整设置）”。"]}
{"word":"modifying","summary":{"en":"“Modifying” means changing or adjusting something (often slightly) to improve it or make it fit a need. It can be a verb form (“is modifying”) or an adjective (“modifying phrase”).","zh":"“modifying”表示对某物进行改变或调整（通常幅度不大），以改进或让它更符合需求。它既可作动词形式（进行时），也可作形容词（如“modifying phrase 修饰语”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changing something (often slightly) to improve it or make it suitable for a particular purpose; adjusting","zh":"对某物进行（通常是小幅）改变以改进或使其适合特定用途；调整"},"examples":[{"en":"We are modifying the plan to fit the new budget.","zh":"我们正在修改计划，以适应新的预算。"},{"en":"The teacher suggested modifying my essay’s introduction.","zh":"老师建议我修改作文的开头。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of changing something; revision; adjustment","zh":"修改的行为或过程；修订；调整"},"examples":[{"en":"Modifying the settings can improve the app’s performance.","zh":"修改设置可以提升这个应用的性能。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “modify”: changing or adjusting something","zh":"“modify”的现在分词：正在改变或调整某物"},"examples":[{"en":"She is modifying the design so it’s easier to use.","zh":"她正在修改设计，让它更容易使用。"}]}],"synonyms":["adjusting","changing","altering","revising","editing"],"phonetic":"/ˈmɑː.dəˌfaɪ.ɪŋ/","extraExplanation":["“modifying”常见于两种语法位置：\n1) 作动词（现在分词/进行时）：They are modifying the code.\n2) 作形容词：a modifying phrase（修饰语）。在语法里，“modifying”也可以指“修饰”的概念，例如 modifying words/phrases（修饰词/短语）。","与“edit / revise / change”对比：\n- modify：强调“调整、改动”（不一定大改），使之更合适。\n- edit：更像“编辑、润色”（尤其是文字、影片）。\n- revise：常指“修订、改稿”，可能幅度更大，常用于写作或计划。\n- change：最通用，大小变化都可能。"]}
{"word":"modili","summary":{"en":"“Moduli” is the plural of “modulus,” used mainly in math (a modulus in modular arithmetic) and in science/engineering (material stiffness values like elastic moduli).","zh":"“Moduli” 是 “modulus” 的复数，主要用于数学（模运算的模数）以及理工领域（材料刚度相关的模量，如弹性模量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **modulus** (math): a number used in modular arithmetic; two numbers are considered equivalent if they leave the same remainder when divided by this number.","zh":"（数学）**modulus** 的复数：模数；在模运算中用来做除法比较的数；若两个数除以它的余数相同，就认为它们同余。"},"examples":[{"en":"In clock arithmetic, we often work with moduli like 12 or 24.","zh":"在“钟表算术”（模运算）里，我们常用的模数有 12 或 24。"},{"en":"Different moduli can produce very different patterns of remainders.","zh":"不同的模数会产生非常不同的余数规律。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of **modulus** (science/engineering): numerical measures (coefficients) describing a material’s stiffness or resistance to deformation (e.g., elastic moduli such as Young’s modulus).","zh":"（理工）**modulus** 的复数：描述材料刚度或抗变形能力的系数/数值（如弹性模量，包括杨氏模量等）。"},"examples":[{"en":"Metals and plastics have very different elastic moduli.","zh":"金属和塑料的弹性模量差别很大。"},{"en":"Engineers compare moduli to choose a material for a flexible part.","zh":"工程师会比较各种模量来选择适合做柔性零件的材料。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of **modulus** (math): absolute values or magnitudes, especially of complex numbers.","zh":"（数学）**modulus** 的复数：绝对值/模（常指复数的模，即大小）。"},"examples":[{"en":"Two complex numbers can have the same moduli but different angles.","zh":"两个复数可以有相同的模，但辐角不同。"}]}],"synonyms":["modulus (plural form)","elastic moduli","Young’s moduli"],"phonetic":"/ˈmɑːdʒəˌlaɪ/","extraExplanation":["你输入的 **modili** 不是常见英文词形；很可能你想查的是 **moduli**（/ˈmɑːdʒəˌlaɪ/），它是 **modulus** 的复数形式，在数学（模运算）和工程（弹性模量）里都很常见。","如果你其实想找的是 **“Modilie/Modilying”**（网络政治梗、非正式造词）或 **modillion**（建筑术语），告诉我你看到它的语境/句子，我可以按那个词来解释。"]}
{"word":"modillion","summary":{"en":"A modillion is an architectural bracket under a cornice, used mainly as decoration in classical styles.","zh":"modillion 指古典建筑檐口下的装饰性托座/托檐，多用于装饰（也带“支撑”视觉效果）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In classical architecture, a decorative bracket (often carved) placed under the projecting edge of a cornice, especially in Corinthian and other richly detailed styles.","zh":"（古典建筑）檐口下方的装饰性托座/托檐（常带雕刻），用来支撑或装饰外挑的檐口，常见于科林斯式等华丽风格。"},"examples":[{"en":"The museum’s cornice is lined with modillions carved like acanthus leaves.","zh":"博物馆的檐口下排布着一圈托檐，雕成了莨苕叶的样子。"},{"en":"During the restoration, several cracked modillions had to be replaced.","zh":"修复过程中，有几块开裂的托檐需要更换。"}]}],"synonyms":["bracket","console","corbel (similar but not identical)"],"phonetic":"/məˈdɪljən/","extraExplanation":["你输入的 **modillion** 很可能是拼写误差；标准拼法是 **modillion**（单词中间是 *-illi-*）。它属于建筑术语，常用于描述古典风格建筑屋檐下那一排“齿状/托座”装饰，但与更小更密的 **dentil（檐口小齿饰）** 不同，modillion 通常更大、更像“托架”。","词源上常追溯到意大利语（与古典建筑装饰术语相关），在英文中多见于建筑史、修复工程、以及对古典立面细部的描写。"]}
{"word":"modiolar","summary":{"en":"Modiolar means “related to the modiolus,” the central bony core of the cochlea in the inner ear.","zh":"modiolar 指“与耳蜗轴有关的”，耳蜗轴是内耳耳蜗的中央骨性核心结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the *modiolus*—the central, cone-shaped bony core of the cochlea in the inner ear (around which the cochlear canal winds).","zh":"与*耳蜗轴（modiolus）*有关的；指内耳耳蜗中央呈圆锥状的骨性核心结构（耳蜗管绕其盘旋）。"},"examples":[{"en":"The CT report noted a modiolar defect in the cochlea.","zh":"CT 报告指出耳蜗的耳蜗轴区域存在缺损。"},{"en":"Modiolar involvement can affect the auditory nerve fibers traveling through the cochlea.","zh":"耳蜗轴受累可能影响在耳蜗内行进的听神经纤维。"}]}],"synonyms":["modiolus-related","cochlear (context-dependent)"],"phonetic":"/ˌmoʊdiˈoʊlər/","extraExplanation":["“modiolar”多见于医学/解剖学与耳鼻喉科（ENT）语境，常用来修饰影像学或手术相关结构位置（如 modiolar region/plate）。","词根来自拉丁语 *modiolus*（“小轮毂/小轴心”之意），用来形容耳蜗的“中心轴”很形象：耳蜗像螺旋，耳蜗轴像螺旋的轴心。"]}
{"word":"modioli","summary":{"en":"**modioli** is the plural of **modiolus**, most commonly referring to the central bony column of the cochlea (inner ear).","zh":"**modioli** 是 **modiolus** 的复数，最常指耳蜗（内耳）中央的骨性轴柱结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of **modiolus**: the central bony, cone-shaped column inside the cochlea (inner ear).","zh":"**modiolus** 的复数：指耳蜗（内耳）中央的圆锥形骨性“轴柱/骨柱”。"},"examples":[{"en":"In cochlear anatomy, the spiral structure winds around the **modioli**.","zh":"在耳蜗解剖学中，螺旋结构围绕着这些 **modioli（耳蜗中央骨柱）** 盘绕。"},{"en":"Damage near the **modioli** can affect hearing because important nerve structures pass through that area.","zh":"靠近 **modioli** 的损伤可能影响听力，因为重要的神经结构会经过该区域。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the plural of **modiolus** meaning a fibromuscular “knot” at the corner of the mouth where several facial-expression muscles meet.","zh":"（较少见）**modiolus** 的复数：指口角处的纤维肌性“肌结/汇合点”，多条面部表情肌在此交汇。"},"examples":[{"en":"Several muscles of facial expression converge on the mouth corners at the **modioli**.","zh":"多条面部表情肌在口角的 **modioli** 处汇合。"}]}],"synonyms":["cochlear central pillar (context-specific)","cochlear axis (context-specific)"],"phonetic":"/məˈdaɪəlaɪ/","extraExplanation":["“Modioli”来自拉丁语名词的复数形式：很多以 **-us** 结尾的拉丁名词，复数会变成 **-i**（如 modiolus → modioli）。","词源上 *modiolus* 与“轮子的轮毂/轴心”有关，因此在解剖学里常用来比喻“中心轴柱”这类结构（例如耳蜗中央骨柱）。","如果你本来想查的是拼写相近但不同的词（例如人名、品牌名或其他术语），可以把上下文句子发我，我能帮你确认正确拼写与意思。"]}
{"word":"modiolus","summary":{"en":"Modiolus most commonly means the central spiral bony core of the cochlea in the inner ear; more broadly, it can also mean a central axis in certain biological or botanical structures.","zh":"Modiolus 最常指内耳耳蜗的中央螺旋状骨性核心（耳蜗轴）；广义上也可指某些生物或植物结构的中心轴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The central, spiral bony core of the cochlea (inner ear) that the cochlear canal winds around.","zh":"（解剖）耳蜗内的中央螺旋状骨性轴（耳蜗轴），耳蜗管绕其盘旋。"},"examples":[{"en":"Damage near the modiolus can affect hearing because it is close to important nerve fibers.","zh":"靠近耳蜗轴（modiolus）的损伤可能影响听力，因为那里邻近重要的神经纤维。"},{"en":"The cochlear implant electrodes are often positioned along the modiolus to stimulate auditory nerves effectively.","zh":"人工耳蜗的电极常沿耳蜗轴放置，以更有效地刺激听神经。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/Botany) A central axis or core of a structure, especially the main axis of certain flower clusters (inflorescences) or fruit structures.","zh":"（生物/植物）某些结构的中心轴或核心，尤指一些花序或果实结构的主轴。"},"examples":[{"en":"In some flowers, the individual parts are attached around a central modiolus.","zh":"在一些花中，各个小部分会围绕中央的花轴（modiolus）附着。"},{"en":"The botanist described how the florets were arranged along the modiolus.","zh":"植物学家描述了小花如何沿着花轴（modiolus）排列。"}]}],"synonyms":["cochlear axis","central axis","core","columella"],"phonetic":"ˌmoʊdiˈoʊləs","extraExplanation":["这个词来自拉丁语，原意有“轮毂/小轴心”的感觉，所以在不同学科里都指“中心的轴/核心”。在医学语境里最常见的是耳蜗的“耳蜗轴”。","学习时可以把它和 axis（轴）、core（核心）联系起来：modiolus 往往就是“结构绕着它盘旋或围着它排列”的那根中心轴。"]}
{"word":"modish","summary":{"en":"“Modish” means trendy or fashionable, often with a hint that it’s only popular for the moment.","zh":"“modish”表示“时髦/赶潮流”，常暗示这种流行可能只是暂时的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fashionable in a trendy way; following the current style (often used in a slightly critical tone).","zh":"时髦的；赶潮流的（常带一点轻微的批评意味）。"},"examples":[{"en":"That café is very modish right now, so it’s always crowded.","zh":"那家咖啡馆现在很时髦，所以总是很拥挤。"},{"en":"She wears modish clothes, but she doesn’t chase every new trend.","zh":"她穿得很时髦，但并不会追每一个新潮流。"}]}],"synonyms":["trendy","fashionable","in vogue","stylish"],"phonetic":"/ˈmoʊdɪʃ/","extraExplanation":["“modish”来自“mode”（时尚、风尚），语气比“fashionable”更强调“跟风、图一时新鲜”，因此在评论里有时会暗示“不够经典/不够持久”。","常见搭配：modish restaurants（时髦餐厅）、modish neighborhood（时髦街区）、modish haircut（流行发型）。","近义词：trendy, fashionable, in vogue（更中性）；反义：old-fashioned, out of date。","语体提示：口语和媒体里更常用“trendy / fashionable”；“modish”更偏书面或评论用语。"]}
{"word":"modishly","summary":{"en":"“Modishly” means “in a fashionable, trend-following way,” sometimes with a slightly critical tone.","zh":"“modishly”表示“以时髦、跟潮流的方式”，有时带一点轻微的“跟风”意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a fashionable way; in a style that is currently popular (often used with a slightly critical tone, suggesting it is done to follow trends).","zh":"以时髦的方式；以当下流行的风格（常带一点点批评意味，暗示只是跟风）。"},"examples":[{"en":"She dressed modishly for the opening, but her speech was thoughtful and original.","zh":"她为开幕式穿得很时髦，但她的发言却很有深度而且有原创性。"},{"en":"The café was modishly decorated with concrete walls and minimalist lights.","zh":"这家咖啡馆用水泥墙和极简灯具装饰得很“潮”。"},{"en":"He modishly adopted the new slang without really understanding it.","zh":"他很跟风地用了新俚语，却并不太懂它的真正含义。"}]}],"synonyms":["fashionably","stylishly","trendily","chicly"],"phonetic":"/ˈmoʊdɪʃli/","extraExplanation":["“modishly”来自形容词“modish”（时髦的、赶时髦的），再加副词后缀“-ly”。它比“fashionably”更容易带出“为了显得时髦而时髦”的语气，所以在写作里常用来表达轻微讽刺或距离感。","常见搭配：dress modishly（穿得时髦）、decorate/furnish modishly（装潢得很时髦）、modishly named/labelled（名字起得很潮、很跟风）。"]}
{"word":"modishness","summary":{"en":"“Modishness” means trendiness—the quality of being fashionable or up-to-date in style.","zh":"“modishness”指“时髦/流行的程度”，强调追随最新风格的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being fashionable or following the latest style; trendiness","zh":"时髦；流行（的特质）；追随新潮（的程度）"},"examples":[{"en":"The café’s modishness attracted influencers, but some locals missed its old, quiet feel.","zh":"这家咖啡馆的时髦感吸引了网红，但一些本地人怀念它以前安静朴素的氛围。"},{"en":"Her writing had a certain modishness, using trendy words that may not age well.","zh":"她的写作带着某种“时髦感”，用了不少流行词，但这些词未必经得起时间考验。"}]}],"synonyms":["trendiness","fashionableness","chicness","stylishness"],"phonetic":"/ˈmoʊdɪʃnəs/","extraExplanation":["“modishness”来自形容词“modish（时髦的）”，再加名词后缀“-ness”表示“……的性质/状态”。整体语气常带一点评价色彩：可能是中性（很潮），也可能略带讽刺（过于追逐潮流）。","在正式或学术写作中，你也可以用更常见的词替换：neutral用“fashionableness / trendiness”，带批评意味可用“fad-chasing（追逐一时风尚）”。"]}
{"word":"modist","summary":{"en":"A modist is an old-fashioned word for a hat maker/seller (similar to “milliner”), especially from earlier periods.","zh":"modist 是较旧的词，指（过去常见的）女帽制作或销售者，意思接近 milliner（女帽师）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (traditionally a woman) whose job is making or selling women’s hats and other fashion items, especially in the past","zh":"（多指过去的）女帽制作/销售者；（亦可指）女装时尚用品的制作者或店主"},"examples":[{"en":"In the old neighborhood, the modist’s shop displayed hand-trimmed hats in the window.","zh":"在老街区里，那家女帽师的店橱窗里陈列着手工装饰的帽子。"},{"en":"She apprenticed with a modist before opening her own small boutique.","zh":"她曾跟女帽师当学徒，后来开了自己的小精品店。"}]}],"synonyms":["milliner","hatmaker","hatter (less specific; can be any hat maker)","dressmaker (broader; not just hats)"],"phonetic":"/ˈmoʊdɪst/","extraExplanation":["“modist”在现代英语里比较少见，阅读旧小说、历史资料或谈到19世纪/20世纪早期的时尚行业时更常遇到。更常用的现代说法是“milliner（女帽师）”。","词源上与法语的“mode（时尚）”有关，所以它带有“做时尚/做流行款式的人”的历史色彩。"]}
{"word":"modiste","summary":{"en":"Modiste means a (usually old-fashioned) dressmaker or seller of women’s fashionable clothing; less commonly, a women’s hat maker/seller.","zh":"Modiste 指（多为旧时用法）为女性制作或销售时装的人；较少见也可指女帽制作者/女帽商。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (especially in the past) who makes or sells women’s fashionable clothes; a dressmaker.","zh":"（尤指过去）为女性制作或出售时装的人；女装裁缝。"},"examples":[{"en":"In the novel, she visits a Parisian modiste to order a new dress for the ball.","zh":"在小说里，她去拜访一位巴黎的女装裁缝，订做参加舞会的新礼服。"},{"en":"The modiste measured her carefully and suggested a simpler neckline.","zh":"那位女装裁缝仔细为她量尺寸，并建议把领口设计得更简洁。"}]},{"partOfSpeech":"n.","definition":{"en":"a maker or seller of women’s hats; a milliner (less common).","zh":"（较少见）女帽制作者或销售者；女帽商。"},"examples":[{"en":"She stopped at the modiste’s shop to choose a hat with ribbon trim.","zh":"她在女帽店停下，挑了一顶带丝带装饰的帽子。"}]}],"synonyms":["dressmaker","couturier","seamstress","milliner"],"phonetic":"/moʊˈdiːst/","extraExplanation":["“modiste”是法语借词（来自法语 *modiste*），和 *mode*（时尚）同源。英语里它带一点“旧时/文学/历史语境”的味道，常出现在描写19世纪到20世纪早期上流社会生活的小说或影视中。","现代英语更常用的对应词是 *dressmaker*（做衣服的人）或 *designer*（设计师）；做帽子更常说 *milliner*。用“modiste”会显得更复古、更有法式时尚氛围。"]}
{"word":"modistes","summary":{"en":"“Modistes” is the plural of “modiste”: an old-fashioned word for a woman’s fashion dressmaker or seller (sometimes a hat maker).","zh":"“modistes”是“modiste”的复数：旧称，指制作或售卖时髦女装（有时也指女帽）的裁缝/店家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a maker or seller of fashionable women’s clothing, especially dresses (old-fashioned); sometimes also used for a maker of women’s hats","zh":"（旧用）女装时装的制作者或销售者，尤指连衣裙；有时也指女帽制作者"},"examples":[{"en":"In the 1800s, wealthy women often visited a modiste to order custom dresses.","zh":"在19世纪，富裕女性常去找时装女裁缝订做礼服。"},{"en":"She worked as a modiste, sewing fine details by hand.","zh":"她做时装女裁缝的工作，用手工缝制精细的细节。"}]}],"synonyms":["dressmaker","seamstress","couturière","milliner"],"phonetic":"/moʊˈdiːst/","extraExplanation":["“modistes”是名词复数，单数是“modiste”。这个词来自法语，带有“巴黎时尚/高级定制”的历史氛围，因此在现代英语里常见于文学作品、历史语境或复古风格的描述中。","现代更常用的近义表达：做女装的可说“dressmaker / seamstress（偏缝纫）/ fashion designer（设计师）”；做帽子的更直接是“milliner（女帽设计/制作者）”。注意：不同词强调点不同，modiste更偏“时髦女装店/女装裁缝（旧称）”。"]}
{"word":"modistry","summary":{"en":"Modistry is an old-fashioned word meaning “fashionable things” or “whatever is trendy.”","zh":"Modistry 是一个较为过时的词，意思是“时髦的东西/流行之物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(obsolete) Something that is fashionable; anything trendy or in vogue.","zh":"（过时）时髦的东西；流行之物。"},"examples":[{"en":"In that era, the elite chased every new modistry from Paris.","zh":"在那个时代，上流社会追逐每一种来自巴黎的新潮流。"},{"en":"Her salon was filled with the latest modistry—new cuts, colors, and ornaments.","zh":"她的沙龙里满是最新的时尚玩意儿——新的剪裁、颜色和装饰。"}]}],"synonyms":["fashion","vogue","trend","trendiness","latest thing"],"phonetic":"/ˈmoʊdɪstri/","extraExplanation":["这个词在现代英语里几乎不用，属于“书面/历史语境”更可能见到的词。","容易和 **modiste**（法语借词，指“女装裁缝/时装女帽店主”）或 **modist**（从事时装制作/销售的人）混淆；**modistry** 更偏向“时髦之物/时尚潮流本身”。","另外，现实中也有人把 **Modistry** 当作品牌名/网站名使用（如手表或游戏相关服务），那属于专有名词，不等同于词典义。"]}
{"word":"modius","summary":{"en":"Modius is a Latin-derived term meaning a Roman dry-measure (and the measuring container), and sometimes a cylindrical headdress shaped like that vessel.","zh":"Modius 源自拉丁语，主要指古罗马的干量单位（及其量器），有时也指形似量器的圆筒形头饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Roman unit of dry volume (used for grain and other dry goods), and also the container/basket used to measure that amount.","zh":"古罗马的干量容量单位（常用于谷物等干货），也可指用来量取该容量的量器/桶。"},"examples":[{"en":"The inscription records a donation of ten modii of wheat to the temple.","zh":"铭文记载向神庙捐赠了十莫狄乌斯（modii）的小麦。"},{"en":"Merchants argued about whether the modius was filled level or heaped.","zh":"商人们争论莫狄乌斯的计量应当是“刮平”还是“堆尖”。"}]},{"partOfSpeech":"n.","definition":{"en":"A tall, cylindrical headdress shaped like a measuring vessel, especially in some ancient depictions (e.g., of certain goddesses).","zh":"一种高而圆筒形的头饰，形状像量器；常见于部分古代艺术形象（如某些女神的塑像/壁画）。"},"examples":[{"en":"In the statue, the goddess wears a modius on her head as a symbolic crown.","zh":"在这尊雕像中，女神头戴莫狄乌斯式头饰，作为象征性的冠饰。"}]}],"synonyms":["dry measure","measuring vessel"],"phonetic":"/ˈmoʊdiəs/","extraExplanation":["“modius”是拉丁语借词，常出现在古罗马历史、考古、古典学读物里，尤其与粮食税收、军粮配给、市场交易等语境相关。","在英文写作中它多用于学术或历史叙述；日常英语里很少说。需要表达现代近似量时，有时会用“a bushel/peck (approx.)”来帮助读者理解，但精确换算会因时期与地区而不同。"]}
{"word":"modo","summary":{"en":"Modo means a way or method of doing something, often borrowed from Spanish/Italian contexts; in English, “way/method” is more common.","zh":"Modo 表示“方式/方法/做事风格”，多见于借自西/意语的语境；英语里通常用 way/method 更常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish/Italian) a way, manner, or style of doing something; someone’s way of acting.","zh":"（源自西/意语）方式；做事的样子；行为举止的风格。"},"examples":[{"en":"She has a calm modo that makes people trust her.","zh":"她做事很沉稳的风格，让人很信任她。"},{"en":"I don’t like his modo of speaking to customers.","zh":"我不喜欢他跟顾客说话的方式。"}]},{"partOfSpeech":"n.","definition":{"en":"a method or practical way to do something (often used in bilingual contexts).","zh":"方法；实现某事的具体做法（常见于双语语境）。"},"examples":[{"en":"What’s the best modo to get to the airport?","zh":"去机场最好的方法是什么？"},{"en":"Try a different modo—this one isn’t working.","zh":"换个方法试试——这个不管用。"}]}],"synonyms":["way","manner","method","mode"],"phonetic":"ˈmoʊdoʊ","extraExplanation":["“modo”本身不是最常见的英语词；在英语里更常见的是 **mode**（模式）或 **method/way**（方法/方式）。如果你是在英文写作中想表达“方式/方法”，通常用 **way / manner / method** 更自然。","在西班牙语里，**modo** 很常用，意思是“方式/方法/举止”。常见搭配有：**de ningún modo**（绝不/没门），**de todos modos**（不管怎样/反正），**a mi modo de ver**（依我看）。","英语里也会在固定短语 **grosso modo** 中看到 *modo*（大意上/粗略地说），属于较正式、带拉丁/意大利语色彩的表达。"]}
{"word":"modoc","summary":{"en":"Modoc most commonly refers to the Modoc people (and their language) from northern California and southern Oregon; it can also describe something related to them or refer to the Modoc War (1872–1873).","zh":"Modoc常指莫多克族（及其语言），源自加州北部与俄勒冈州南部；也可作形容词表示“与莫多克有关”，或在历史语境中指莫多克战争（1872—1873）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people originally from the area around northern California and southern Oregon (especially near Tule Lake and the Lost River).","zh":"莫多克族：美国原住民部族之一，传统居住在加利福尼亚州北部与俄勒冈州南部一带（尤指图利湖与失落河附近）。"},"examples":[{"en":"The Modoc are an Indigenous people of the Pacific Northwest region.","zh":"莫多克族是太平洋西北地区的原住民之一。"},{"en":"Some historical accounts describe Modoc life around Tule Lake.","zh":"一些历史记载描述了莫多克族在图利湖一带的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally spoken by the Modoc people (closely related to Klamath).","zh":"莫多克语：莫多克族传统使用的语言（与克拉马斯语关系密切）。"},"examples":[{"en":"The Modoc language is closely related to Klamath.","zh":"莫多克语与克拉马斯语关系很近。"},{"en":"Language revitalization efforts may include Modoc words and stories.","zh":"语言复兴工作可能会收集莫多克语的词汇与故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) the Modoc War (1872–1873), a conflict between the United States and a group of Modoc people, often discussed in U.S. Western history.","zh":"（历史）莫多克战争（1872—1873）：美国与一部分莫多克族人之间的冲突，常见于美国西部史讨论中。"},"examples":[{"en":"The Modoc War of 1872–1873 is sometimes studied in U.S. history classes.","zh":"莫多克战争（1872—1873）有时会在美国历史课中被学习。"},{"en":"Several landmarks in the Lava Beds area are connected to the Modoc War.","zh":"拉瓦床（Lava Beds）地区的一些地标与莫多克战争有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Modoc people, their language, or culture.","zh":"莫多克的：与莫多克族、莫多克语或其文化有关的。"},"examples":[{"en":"The museum hosts a Modoc cultural program each year.","zh":"这家博物馆每年都会举办莫多克文化活动。"},{"en":"She is researching Modoc traditions and oral histories.","zh":"她在研究莫多克族的传统与口述历史。"}]}],"phonetic":"/ˈmoʊdɑk/","extraExplanation":["“Modoc”在英语里通常是专有名词，首字母大写更常见（Modoc）。既可以指“莫多克族/莫多克语”，也常出现在历史语境中指“莫多克战争（1872—1873）”。","如果你在地理语境里看到它，可能还指“Modoc County（莫多克县，加州）”或“Modoc Plateau（莫多克高原）”。这些属于地名用法，含义是“以莫多克之名命名的”。"]}
{"word":"modred","summary":{"en":"Modred is a name from Arthurian legend, referring to the knight who betrays King Arthur.","zh":"Modred 是亚瑟王传说中的人物名，指背叛亚瑟王并导致其覆灭的圆桌骑士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Arthurian legend) A knight of the Round Table—often described as King Arthur’s nephew—who betrays Arthur and helps bring about Arthur’s downfall.","zh":"（亚瑟王传说）圆桌骑士之一，常被说成亚瑟王的外甥；他背叛亚瑟王，并促成亚瑟王的覆灭。"},"examples":[{"en":"In some versions of the legend, Modred seizes the throne while Arthur is away at war.","zh":"在某些版本的传说里，亚瑟王出征在外时，Modred 夺取了王位。"},{"en":"The final battle between Arthur and Modred is one of the best-known moments in Arthurian stories.","zh":"亚瑟王与 Modred 的最后决战，是亚瑟王故事中最著名的情节之一。"}]}],"synonyms":["Mordred"],"phonetic":"/ˈmoʊdrɛd/","extraExplanation":["“Modred”常见于较早或特定传统的拼写；现代更常见的写法是“Mordred”。两者通常指同一位亚瑟王传说人物，但不同作品（如中古英语、法语传统与现代改写/影视/漫画）对他的身世（外甥、私生子等）与性格动机会有差异。","读亚瑟王题材时，可以把 Modred/Mordred 理解为“背叛者/内乱的引爆点”这一角色原型：他象征理想王国（Camelot）的裂痕与崩塌。"]}
{"word":"mods","summary":{"en":"“Mods” most commonly means either (1) modifications (especially game/software/car changes) or (2) moderators in an online community; context tells you which.","zh":"“mods”最常见有两种意思：（1）改装/修改（尤其游戏模组、软件修改、汽车改装）；（2）网络社区的版主/管理员；具体看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Modifications—changes made to something (especially software, games, cars, or devices) to improve it or make it different.","zh":"（非正式）改装／修改——对某物（尤其是软件、游戏、汽车或设备）做出的更改，用来提升性能或改变外观/功能。"},"examples":[{"en":"I installed a few mods to improve the graphics in the game.","zh":"我装了几个模组来提升游戏画质。"},{"en":"The car has engine mods and a new exhaust system.","zh":"这辆车做了发动机改装，还换了新的排气系统。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, online) Moderators—people who manage an online community by enforcing rules and removing harmful content.","zh":"（非正式，网络）版主／管理员——管理线上社区的人，负责执行规则、处理违规内容。"},"examples":[{"en":"Ask the mods if your post keeps getting removed.","zh":"如果你的帖子总被删，可以问问版主原因。"},{"en":"The mods locked the thread after the argument got too heated.","zh":"争吵太激烈后，管理员把这个讨论串锁了。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) Modernists—students at some universities (especially in the UK) who study Modern Languages.","zh":"（较少见）现代语言专业学生——在一些大学（尤指英国）里，学习现代语言的人。"},"examples":[{"en":"Mods often take courses in French, Spanish, or German.","zh":"现代语言专业的学生常常会学习法语、西班牙语或德语等课程。"}]}],"synonyms":["modifications","game mods","patches","tweaks","moderators","admins"],"phonetic":"/mɑdz/","extraExplanation":["“mods”在游戏语境里常指“modifications”的缩写，中文里经常翻成“模组”。注意：有些模组只改变外观/玩法，有些会影响平衡或稳定性，安装前最好看说明与兼容性。","在论坛/Reddit/Discord等社区里，“mods”也很常用来指“moderators（管理员/版主）”。具体含义通常看上下文：谈到“install/enable/disable”等动词多半是“模组”；谈到“rules/ban/remove/lock”等多半是“版主/管理员”。"]}
{"word":"modul","summary":{"en":"A module is a separate unit or part of a larger system, especially in education or computing.","zh":"module 指整体中的一个独立单元/模块，常用于课程与计算机领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit or part of a larger system, designed to work together with other units","zh":"（整体系统中的）模块；组成单元"},"examples":[{"en":"This product is built from several modules that can be replaced easily.","zh":"这个产品由几个模块组成，且可以轻松更换。"},{"en":"The space station is made of separate modules connected in orbit.","zh":"空间站由多个在轨道上连接的独立舱段（模块）组成。"}]},{"partOfSpeech":"n.","definition":{"en":"a section of a course (especially in college or training) that focuses on one topic","zh":"（课程中的）单元；模块（常指大学或培训课程的一个主题部分）"},"examples":[{"en":"We have a safety module before we start using the lab.","zh":"在开始使用实验室之前，我们要先学一个安全模块。"},{"en":"She passed every module in her first semester.","zh":"她第一学期通过了所有课程单元。"}]},{"partOfSpeech":"n.","definition":{"en":"a self-contained part of a computer program that can be used, added, or removed independently","zh":"（计算机）程序模块；可独立使用/添加/移除的代码部分"},"examples":[{"en":"Install the payment module to accept credit cards.","zh":"安装支付模块以支持信用卡付款。"},{"en":"The bug is in the login module.","zh":"这个漏洞在登录模块里。"}]}],"synonyms":["unit","component","section","part","segment"],"phonetic":"/ˈmɑːdʒuːl/","extraExplanation":["“modul”本身在英语里不算常见标准拼写，很多时候是把 **module** 拼短了，或受其他语言（如德语/法语）与地区用法影响（某些软件、教材或非英语环境里会写“modul”）。在正式英语写作与考试中通常建议用 **module**。"]}
{"word":"modula","summary":{"en":"Modula is best known as the name of a modular programming language (and sometimes the Modula language family).","zh":"Modula 最常见是指一种强调模块化的编程语言名称（有时也泛指 Modula 语言家族）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a programming language (created by Niklaus Wirth at ETH Zurich in the mid-1970s) designed to support modular, structured programming through the use of “modules.”","zh":"一种编程语言（由尼克劳斯·维尔特 Niklaus Wirth 于20世纪70年代中期在苏黎世联邦理工学院 ETH Zurich 开发），强调用“模块（modules）”来组织程序，实现模块化与结构化编程。"},"examples":[{"en":"Modula introduced a clear module system, which later influenced newer languages.","zh":"Modula 引入了清晰的模块系统，后来影响了许多更新的语言。"},{"en":"This paper compares Pascal and Modula in terms of program organization.","zh":"这篇论文从程序组织方式上比较了 Pascal 和 Modula。"},{"en":"Some older systems software was written in Modula or its successors, like Modula-2.","zh":"一些较早的系统软件曾用 Modula 或它的后继语言（如 Modula-2）编写。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) the Modula family of languages, especially Modula-2 and Modula-3.","zh":"（引申用法）指 Modula 语言家族，尤其是 Modula-2、Modula-3。"},"examples":[{"en":"He learned Modula in school, starting with Modula-2.","zh":"他在学校学过 Modula，从 Modula-2 开始。"},{"en":"The team migrated from Modula-3 to a more modern language.","zh":"团队从 Modula-3 迁移到了更现代的语言。"}]}],"synonyms":["Modula-2","Modula-3"],"phonetic":"/ˈmɑdʒələ/","extraExplanation":["“Modula”在英语里最常见是计算机领域的专有名词（编程语言名）。如果你其实想查的是数学里的“modulo / modulus（取模/模数）”，或写的是“module（模块）”，告诉我你想表达的语境（数学/编程/日常写作），我可以给你对应词条与用法对比。"]}
{"word":"modulability","summary":{"en":"Modulability means the capability of being modulated (especially for sounds/signals), and in some technical writing it can also mean how easily something can be made modular.","zh":"Modulability 指“可调制性”（多用于声音/信号），在部分技术语境中也可指“模块化的容易程度/模块化能力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of something (especially a sound, signal, or wave) to be modulated (changed in pitch, frequency, amplitude, etc.)","zh":"（尤指声音、信号或波）可被调制的能力；可调制性（如改变音高、频率、振幅等）"},"examples":[{"en":"This synthesizer has great modulability, so you can shape the tone in many subtle ways.","zh":"这台合成器的可调制性很强，所以你可以用很多细微方式塑造音色。"},{"en":"Engineers tested the modulability of the radio signal under noisy conditions.","zh":"工程师在噪声环境下测试了无线电信号的可调制性。"}]},{"partOfSpeech":"n.","definition":{"en":"(extended/technical) the degree to which a system or design can be organized into modules so parts can be adjusted, replaced, or recombined without redesigning everything","zh":"（引申/技术用法）系统或设计被模块化的程度；各部分可独立调整、替换或重组而无需整体重做的能力"},"examples":[{"en":"High modulability makes the software easier to update feature by feature.","zh":"高模块化能力让软件更容易按功能逐步更新。"},{"en":"The product was redesigned for modulability, so components could be swapped quickly.","zh":"该产品为提高模块化能力而重新设计，使组件能快速更换。"}]}],"synonyms":["modifiability","flexibility","adaptability","modularity"],"phonetic":"/ˌmɑːdʒələˈbɪləti/","extraExplanation":["“modulability”在权威词典中常见的核心义是“可被调制的能力”（来自 *modulate*）。在工程与音乐语境里更自然。","有时也会被用来表达“模块化程度/可模块化能力”，这层意思更接近 *modularity*（模块化）或 *modifiability*（可修改性）。写作时如果担心读者误解，可以直接用更常见的 *modularity*。"]}
{"word":"modulant","summary":{"en":"“Modulant” is a rare technical word meaning something that modifies or regulates another thing; it can also describe something that causes modulation (smooth variation).","zh":"“modulant”是较少见的技术词，指“起调节/改变作用的东西”；也可作形容词表示“引起调制/转调、使平滑变化的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(technical, rare) Something that modifies or regulates the activity of something else (often used in science/medicine, e.g., an immune modulant).","zh":"（技术用语，较少见）起到调节、改变另一事物作用的东西（常用于科学/医学语境，如“免疫调节剂”）。"},"examples":[{"en":"Some supplements are marketed as immune modulants, but evidence varies by product.","zh":"一些补充剂被宣传为“免疫调节剂”，但不同产品的证据强弱不一。"},{"en":"In the model, temperature acts as a modulant of reaction speed.","zh":"在该模型中，温度作为反应速度的调节因素。"}]},{"partOfSpeech":"adj.","definition":{"en":"(technical, rare) Causing modulation; adjusting or varying smoothly (especially in music/engineering contexts).","zh":"（技术用语，较少见）引起“调制/调性转换”的；使……平滑变化的（尤用于音乐/工程语境）。"},"examples":[{"en":"The synth uses a modulant signal to shape the tone over time.","zh":"这台合成器用一个调制信号让音色随时间变化。"},{"en":"A modulant passage leads the music into a new key.","zh":"一段“转调”的乐句把音乐带入新的调性。"}]}],"synonyms":["modulator","regulator","modifier","modulating factor"],"phonetic":"/ˈmɑːdʒələnt/","extraExplanation":["“modulant”在现代英语里非常少见，多出现在专业写作中，意思接近“modulator（调制器）/ modulating factor（调节因素）”。日常表达更常用“modulator”“regulator”或“modifying factor”。","它也常被当作法语单词使用：法语里“modulant”是动词 moduler（调节/转调/调制）的现在分词，意思相当于英语的“modulating”。","另外，“Modulant”还是一家公司的名称（专有名词），如果你是在文章/网页里看到首字母大写，可能指公司而不是普通词义。"]}
{"word":"modular","summary":{"en":"Modular means built from separate modules that can be mixed, replaced, or expanded easily.","zh":"Modular 指由多个可独立组合、替换或扩展的模块组成的（模块化的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a system, product, or design) made of separate parts (modules) that can be combined, replaced, or rearranged easily.","zh":"（系统、产品或设计）由可独立组合、替换或重新排列的模块组成的。"},"examples":[{"en":"The software has a modular design, so you can add new features without rewriting everything.","zh":"这个软件是模块化设计，所以你可以添加新功能而不必重写全部。"},{"en":"We chose modular furniture because it fits small apartments and can be reconfigured.","zh":"我们选择模块化家具，因为它适合小户型，而且可以重新组合。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a mathematical “module” (a standard unit used for measurement or scaling).","zh":"与数学中的“模/模数（module）”有关的；指用作度量或缩放的标准单位。"},"examples":[{"en":"Engineers use a modular system to keep parts in standard sizes.","zh":"工程师使用模数（模块）制来让零件尺寸标准化。"}]}],"synonyms":["module-based","component-based","flexible","reconfigurable","interchangeable"],"phonetic":"/ˈmɑːdʒələr/","extraExplanation":["“modular”来自“module（模块）”。在日常英语里最常见的是“模块化设计”的意思：把复杂的东西拆成可管理的小部分，方便维护、升级和替换。常见搭配：modular design（模块化设计）, modular approach（模块化方法）, modular system（模块化系统）, modular building/housing（模块化建筑/住房）, modular arithmetic（模运算，偏数学）。"]}
{"word":"modularities","summary":{"en":"“Modularities” means multiple cases or degrees of modularity—how something is built from separate, interchangeable parts; in technical fields it can also mean modularity (module-degree) measurements in networks.","zh":"“modularities”是“modularity（模块化程度/模块结构）”的复数，表示多个模块化特性或不同程度的模块化；在技术领域也可指网络中的“模块度”指标的多个值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being modular: built from separate parts (modules) that can be combined, replaced, or reorganized easily","zh":"模块化程度；由多个可独立组合/替换的“模块”构成的特性"},"examples":[{"en":"The phone’s modularities make it easy to repair by swapping a damaged part.","zh":"这部手机的模块化特性让维修更容易，只要更换损坏的部件即可。"},{"en":"Designers look for modularities in the system so they can upgrade one section without breaking the rest.","zh":"设计师会寻找系统中的模块化结构，这样就能在不影响其他部分的情况下升级某一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) multiple kinds or degrees of modular structure within something, especially in engineering, software, biology, or networks","zh":"（术语）多种/多层次的模块结构（常见于工程、软件、生物或网络结构中）"},"examples":[{"en":"The paper compares modularities across different network models.","zh":"这篇论文比较了不同网络模型的模块化程度。"},{"en":"Researchers measured modularities to see how strongly the network forms separate communities.","zh":"研究人员测量模块化指标，以了解网络形成不同社群的强度。"}]}],"synonyms":["modularity (plural form)","modular structure(s)","degree(s) of modularity","component-based design","plug-and-play design"],"phonetic":"/ˌmɑdʒəˈlærɪtiz/","extraExplanation":["“modularities”是名词“modularity”的复数形式，常用于：① 指多个系统/产品各自的模块化程度；② 指同一系统里存在的多种模块化结构。日常表达里更常见单数“modularity”。","在网络科学/社区发现（community detection）领域里，modularity 还可指一个具体的“模块度”指标（衡量网络被划分成社群的好坏）。此时复数 modularities 常表示不同划分方案或不同网络的指标值。"]}
{"word":"modularity","summary":{"en":"Modularity means being organized into separate, interchangeable parts (modules), making a system easier to change, repair, or expand.","zh":"Modularity 指“模块化特性/模块化程度”：由可独立替换、组合的部分组成，使系统更易修改、维护或扩展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being built from separate parts (modules) that can be combined, replaced, or rearranged easily","zh":"模块化特性；由若干独立“模块”组成，便于组合、替换或重新排列的性质"},"examples":[{"en":"The app’s modularity lets the team update one feature without breaking the whole system.","zh":"这个应用的模块化特性让团队可以只更新某个功能，而不影响整个系统。"},{"en":"We chose this furniture for its modularity—you can add pieces as your space changes.","zh":"我们选这套家具是因为它很模块化——空间变化时可以继续加组件。"}]},{"partOfSpeech":"n.","definition":{"en":"a design approach (especially in engineering, software, or product design) that organizes something into clear, independent units","zh":"（尤指工程、软件或产品设计中的）模块化设计思想；把整体组织成清晰、相对独立的单元"},"examples":[{"en":"Good modularity makes the codebase easier to test and maintain.","zh":"良好的模块化会让代码更容易测试和维护。"},{"en":"The course structure has modularity: each unit can be studied on its own.","zh":"这门课程的结构很模块化：每个单元都可以单独学习。"}]}],"synonyms":["modular design","component-based design","separation (into parts)"],"phonetic":"/ˌmɑː.dʒəˈlær.ə.ti/","extraExplanation":["词源提示：modularity 来自 module（模块）+ -arity/-ity（名词后缀），常见于软件工程、系统设计、制造业与教育课程设计等语境。","使用建议：在英文里常和 increase/improve/enhance modularity（提高模块化）、modularity of the system（系统的模块化程度）、high/low modularity（高/低模块化）连用。","相关词：module（模块），modular（模块化的，adj.），modularize（使模块化，v.），modularization（模块化过程，n.）。"]}
{"word":"modularization","summary":{"en":"Modularization means splitting something complex into smaller independent modules so it’s easier to build, test, change, or reuse.","zh":"Modularization 指把复杂事物拆成较小、相对独立的模块，以便更易开发、测试、修改与复用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of dividing a large system (such as software, a product, or an organization) into smaller, independent parts (modules) that can be designed, built, tested, and changed more easily.","zh":"把一个大型系统（如软件、产品或组织）拆分成更小、相对独立的部分（模块）的过程，以便更容易设计、开发、测试与维护。"},"examples":[{"en":"Modularization makes the codebase easier to maintain because each module has a clear responsibility.","zh":"模块化能让代码库更容易维护，因为每个模块的职责更清晰。"},{"en":"After modularization, the team could update the payment module without changing the rest of the app.","zh":"模块化之后，团队可以只更新支付模块，而不必改动应用的其他部分。"}]},{"partOfSpeech":"n.","definition":{"en":"In manufacturing or product design, an approach where a product is built from standardized parts (modules) that can be mixed, matched, or replaced.","zh":"在制造或产品设计中，使用标准化部件（模块）来组装产品，使部件可互换、可替换或可组合。"},"examples":[{"en":"Furniture modularization lets customers add shelves or drawers later.","zh":"家具模块化让顾客以后可以再加层板或抽屉。"},{"en":"Car modularization can reduce costs by reusing the same modules across different models.","zh":"汽车模块化可以在不同车型间复用相同模块，从而降低成本。"}]}],"synonyms":["modular design","decomposition","componentization","partitioning"],"phonetic":"/ˌmɑː.dʒə.lɚ.əˈzeɪ.ʃən/","extraExplanation":["“modularization”常用于技术语境（尤其是软件工程）。核心思想是把复杂问题拆小：每个模块尽量“高内聚、低耦合”（模块内部功能集中、模块之间依赖更少），这样更容易测试、复用与扩展。","常见搭配：software modularization（软件模块化）、code modularization（代码模块化）、system modularization（系统模块化）、design for modularization（为模块化而设计）。","易混词：modularity（模块化特性/程度，偏“状态/属性”） vs. modularization（模块化的“过程/行动”）。例如：“Improve modularity”强调提升模块化程度；“Do modularization”强调进行拆分与重构。"]}
{"word":"modularize","summary":{"en":"To modularize means to divide something into separate modules so it’s easier to build, test, change, or reuse.","zh":"modularize 指把某物拆分成独立模块，便于开发、测试、修改或复用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(especially in software or system design) to divide something into smaller, independent parts (modules) that can be developed, tested, or replaced separately.","zh":"（尤指软件或系统设计）把某物拆分成更小、相对独立的部分（模块），以便分别开发、测试或替换。"},"examples":[{"en":"We should modularize the codebase so each feature can be updated without breaking the whole app.","zh":"我们应该把代码库模块化，这样每个功能都能独立更新，而不会影响整个应用。"},{"en":"The team modularized the payment system into separate modules for billing, refunds, and fraud checks.","zh":"团队把支付系统模块化，拆成计费、退款和风控检查等独立模块。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something built from modules; to design something in a modular way.","zh":"使某物以模块方式构建；以模块化方式来设计某物。"},"examples":[{"en":"The manufacturer modularized the product line so customers can add parts later.","zh":"制造商把产品线做成模块化，让客户之后可以再加装部件。"},{"en":"They want to modularize the course content into short units for self-paced learning.","zh":"他们想把课程内容模块化，拆成短单元，方便自学进度安排。"}]}],"synonyms":["divide","break down","separate","partition","componentize","refactor (context-dependent)","decouple (context-dependent)"],"phonetic":"ˈmɑdʒəˌləˌraɪz","extraExplanation":["“modularize”常见于科技与工程语境，来源于“module（模块）”。写作中也常用被动语态：be modularized（被模块化）。","在软件工程里，modularize 的目的通常是提高可维护性、可测试性与复用性；与之相关的常见词还有：refactor（重构）、decouple（解耦）、componentize（组件化，偏前端/产品设计语境）。"]}
{"word":"modularized","summary":{"en":"“Modularized” means arranged into separate modules, or changed by dividing something into independent modules.","zh":"“modularized”表示“模块化的”，也可指“把某物拆分并改造成独立模块”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or organized as separate, interchangeable parts (“modules”) that can be combined, replaced, or upgraded easily.","zh":"以“模块”为单位来设计或组织的；由可互换的独立部分组成，便于组合、替换或升级。"},"examples":[{"en":"The app is modularized, so we can add new features without rewriting everything.","zh":"这个应用是模块化的，所以我们可以在不重写全部代码的情况下添加新功能。"},{"en":"We modularized the training course into short lessons for beginners.","zh":"我们把培训课程模块化，拆成适合初学者的短课时。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past form) Broke something into modules; reorganized it into independent parts.","zh":"（过去式/过去分词）把某物拆分成模块；将其重新组织为相互独立的部分。"},"examples":[{"en":"They modularized the old system to make maintenance easier.","zh":"他们把旧系统模块化，让维护更容易。"},{"en":"After we modularized the process, each team owned one step.","zh":"在我们把流程模块化之后，每个团队负责其中一个步骤。"}]}],"synonyms":["modular","component-based","partitioned","segmented","decomposed"],"phonetic":"ˈmɑːdʒəˌlaɪzd","extraExplanation":["“modularized”既可以当形容词（描述“已经是模块化的”），也常见于被动结构（is/was modularized）。在技术写作里，它通常对应“modularize”（美式拼写），英式也常见“modularise”。","常见搭配：modularized design（模块化设计）、modularized system（模块化系统）、modularize code / course / process（把代码/课程/流程模块化）。与“component-based（基于组件的）”相近，但“module（模块）”通常强调更清晰的边界与可替换性。"]}
{"word":"modularizes","summary":{"en":"“Modularizes” means breaks something into separate modules to make it easier to build, change, or reuse.","zh":"“modularizes”表示把某物拆分成独立模块，使其更易构建、修改或复用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to break something (such as a system, product, or piece of work) into separate modules so it is easier to build, change, test, or reuse","zh":"把某个系统、产品或工作内容拆分成多个“模块”，以便更容易构建、修改、测试或复用"},"examples":[{"en":"The team modularizes the code so each feature can be updated without changing the whole program.","zh":"团队把代码模块化，这样每个功能都能单独更新，而不必改动整个程序。"},{"en":"She modularizes the course into short units to help beginners study step by step.","zh":"她把课程模块化成短单元，帮助初学者循序渐进地学习。"}]}],"synonyms":["break down","divide","separate","structure","componentize"],"phonetic":"/ˈmɑː.dʒə.lɚ.aɪ.zɪz/","extraExplanation":["“modularizes”是动词“modularize”的第三人称单数（he/she/it modularizes）。常见于工程、软件开发、产品设计与课程设计等语境。","英式拼写常见为“modularise”。在学术或技术写作中，它通常带有“为了提高可维护性/可扩展性而结构化拆分”的含义。"]}
{"word":"modularizing","summary":{"en":"“Modularizing” means dividing something into independent modules or designing it as standardized units so it’s easier to build, change, and reuse.","zh":"“modularizing”指把某物拆分成独立模块，或把它设计成可拼装的标准化单元，从而更易构建、修改与复用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Breaking something into separate, smaller parts (modules) that can be built, changed, or used independently.","zh":"把某物拆分成彼此独立、较小的部分（模块），以便分别构建、修改或重复使用。"},"examples":[{"en":"We’re modularizing the app so each feature can be updated without changing the whole system.","zh":"我们正在把这个应用模块化，这样每个功能都能在不改动整个系统的情况下更新。"},{"en":"Modularizing the lesson plan makes it easier to reuse activities for different classes.","zh":"把课程计划模块化，会更容易把活动复用于不同的班级。"}]},{"partOfSpeech":"v.","definition":{"en":"Making a product, building, or system “modular” by designing it as standardized units that can be combined in different ways.","zh":"通过把产品、建筑或系统设计成可标准化拼装的单元，使其变成“模块化”的。"},"examples":[{"en":"The company is modularizing its furniture line to reduce shipping costs and improve customization.","zh":"这家公司正在把家具产品线模块化，以降低运输成本并提升定制性。"}]}],"synonyms":["breaking down","decomposing","segmenting","dividing","componentizing"],"phonetic":"/ˈmɑːdʒələˌraɪzɪŋ/","extraExplanation":["“modularizing”通常是动词“modularize”的现在分词/动名词形式：\n- 现在分词：They are modularizing the code.（他们正在把代码模块化。）\n- 动名词：Modularizing the code takes time.（把代码模块化需要时间。）","使用场景很常见于软件开发（modularizing code/system）、工程设计、课程/流程设计等，核心好处是：更易维护、可复用、可扩展、彼此解耦。"]}
{"word":"modularly","summary":{"en":"Modularly means “in a modular way,” usually by building something from interchangeable parts; in math/computing it can mean “using modular arithmetic (remainders).”","zh":"modularly 指「以模組化的方式」，常指用可替換、可組合的部分來建立系統；在數學／電腦中也可指「用模運算（餘數）來處理」。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses modules (separate parts) that can be combined, replaced, or rearranged easily.","zh":"以模組化的方式；把系統拆成可獨立更換、組合或重組的部分來設計或運作。"},"examples":[{"en":"They built the app modularly, so new features can be added without rewriting everything.","zh":"他們以模組化的方式開發這個應用程式，所以能在不全部重寫的情況下加入新功能。"},{"en":"The course is designed modularly: each unit can be studied on its own.","zh":"這門課以模組化方式設計：每個單元都可以單獨學習。"}]},{"partOfSpeech":"adv.","definition":{"en":"In mathematics or computing, in a way related to modular arithmetic (working with remainders, like clock time).","zh":"（數學／電腦）以「模運算」的方式；以餘數規則來計算（像時鐘時間那樣循環）。"},"examples":[{"en":"The program checks values modularly to keep them within a fixed range.","zh":"程式用模運算方式檢查數值，讓它們保持在固定範圍內。"},{"en":"You can think modularly: after 12 o’clock, the clock returns to 1.","zh":"你可以用模運算的方式理解：過了12點，時鐘會回到1。"}]}],"synonyms":["in a modular way","with a modular design","component-wise","modulo (math/computing)"],"phonetic":"/ˈmɑː.dʒə.lɚ.li/","extraExplanation":["「modularly」來自形容詞 modular（模組化的），加上副詞字尾 -ly，意思是「以模組化的方式」。日常英文中最常見於工程、軟體、產品設計、課程設計等情境。","要注意它有兩個常見語境：① 工程／設計上的「模組化」；② 數學上的「模（mod）運算」。如果你在程式或數學文章裡看到 modularly，常常是在講第二種。","更自然的替代表達（依語境）：in a modular way / using a modular design；數學語境可用：modulo / mod（例如 “compute x mod 10”）。"]}
{"word":"modulate","summary":{"en":"“Modulate” means to adjust something gradually—often your voice, tone, or intensity; it can also mean changing musical key or regulating a signal.","zh":"modulate 指“逐渐调整”（常指语气/声音/强度）；也可指音乐“转调”或技术上的“调制/调节信号”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to change or adjust something gradually, especially to make it less strong or more suitable (such as tone, voice, or intensity).","zh":"（尤指语气、声音或强度）逐渐改变或调整，使之更柔和/更合适。"},"examples":[{"en":"Try to modulate your voice so you don’t sound angry.","zh":"试着调整你的声音语气，这样听起来就不会像在生气。"},{"en":"The teacher modulated her tone to keep the class calm.","zh":"老师调整了语气，让全班保持冷静。"}]},{"partOfSpeech":"v.","definition":{"en":"to vary or regulate a signal or system in a controlled way (common in music and technology).","zh":"（在音乐或科技中）以可控方式改变/调节（信号或系统）。"},"examples":[{"en":"In the song, the music modulates to a new key near the end.","zh":"这首歌在结尾附近转调到新的调。"},{"en":"Radio stations modulate a carrier wave to send information.","zh":"电台通过调制载波来传递信息。"}]}],"synonyms":["adjust","vary","alter","regulate","temper","tone down"],"phonetic":"ˈmɑdʒəˌleɪt","extraExplanation":["在日常英语里，modulate 常搭配 voice / tone / volume / intensity，含义是“把表达调得更合适”，语气偏正式，常见于演讲、沟通建议或写作点评。","在音乐里，modulate 指“转调”（从一个调转到另一个调）。在通信领域里则是“调制”，例如 AM（调幅）和 FM（调频）。"]}
{"word":"modulated","summary":{"en":"Modulated means “carefully adjusted or varied,” especially about voice/tone; it can also mean “changed key” in music or “signal-modified” in technology.","zh":"modulated 表示“经过控制地调整或变化的”，常指声音/语气；也可指音乐“转调的”，或技术上“经调制的信号”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changed or adjusted in a controlled way (for example, the strength, speed, or tone of something).","zh":"以可控的方式被改变或调整（例如强度、速度或语气）。"},"examples":[{"en":"Her voice was calm and carefully modulated.","zh":"她的声音很平静，语调控制得很得体。"},{"en":"The teacher modulated his tone to keep students’ attention.","zh":"老师调整语气来保持学生的注意力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(music) changed from one key to another; shifted in musical key.","zh":"（音乐）转调的；从一个调性变到另一个调性的。"},"examples":[{"en":"The melody modulated from C major to G major.","zh":"旋律从C大调转到了G大调。"},{"en":"In the middle of the song, it becomes more emotional as it modulates.","zh":"歌曲进行到中段转调后，情绪变得更强烈。"}]},{"partOfSpeech":"adj.","definition":{"en":"(technology) varied a signal to carry information (for example, in radio or internet communication).","zh":"（技术）对信号进行调制以承载信息（如无线电或网络通信）。"},"examples":[{"en":"The data is sent as a modulated radio signal.","zh":"数据以调制过的无线电信号发送。"},{"en":"A modulated carrier wave can transmit sound or digital information.","zh":"经过调制的载波可以传输声音或数字信息。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past tense and past participle of “modulate.”","zh":"“modulate”的过去式和过去分词。"},"examples":[{"en":"He modulated his speech for a more formal audience.","zh":"他为更正式的听众调整了讲话方式。"}]}],"synonyms":["adjusted","controlled","varied","regulated","tempered"],"phonetic":"/ˈmɑːdʒəˌleɪtɪd/","extraExplanation":["“modulate”源自拉丁语 modulat-，与“measure/调节”有关，所以常带有“有节制地调整”的感觉。日常英语里最常见的搭配是：modulated voice/tone（控制过的声音/语气）、carefully/well modulated（控制得很好）。在音乐里“modulate”专指“转调”；在通信技术里指“调制（信号）”。"]}
{"word":"modulates","summary":{"en":"“Modulates” means changes or adjusts something in a controlled way; it can also mean changing musical keys or varying a voice/signal.","zh":"“modulates”指有控制地调整或改变；也可指音乐“转调”，或对声音/信号进行“调制”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to change or adjust something gradually or slightly to achieve a desired effect (such as making it stronger, weaker, faster, slower, etc.)","zh":"（为达到某种效果而）逐渐或轻微地调整、改变（强度、速度、程度等）"},"examples":[{"en":"The thermostat modulates the heat to keep the room comfortable.","zh":"恒温器会调节热量，让房间保持舒适。"},{"en":"She modulates her spending when money is tight.","zh":"手头紧的时候，她会调整开支。"}]},{"partOfSpeech":"v.","definition":{"en":"(music) to change from one key to another; to shift keys","zh":"（音乐）转调；换调"},"examples":[{"en":"The song modulates from C major to G major near the end.","zh":"这首歌在结尾附近从C大调转到G大调。"},{"en":"The composer modulates smoothly to create a brighter mood.","zh":"作曲家通过顺畅转调来营造更明亮的氛围。"}]},{"partOfSpeech":"v.","definition":{"en":"(voice/communication) to vary a signal or voice in pitch, tone, or frequency to convey information or emotion","zh":"（声音/通信）调制；改变音高、语气或频率以传递信息或情绪"},"examples":[{"en":"Good speakers modulate their voice to keep listeners engaged.","zh":"优秀的演讲者会调节语调以吸引听众。"},{"en":"Radio systems modulate a carrier wave to transmit sound.","zh":"无线电系统会对载波进行调制来传输声音。"}]}],"synonyms":["adjusts","varies","regulates","tunes","shifts","alters"],"phonetic":"/ˈmɑːdʒəˌleɪts/","extraExplanation":["“modulates”是动词“modulate”的第三人称单数现在时（he/she/it modulates）。在日常英语里最常见的意思是“调节、调整”；在音乐里特指“转调”；在通信领域常见搭配是“modulate a signal / carrier wave（调制信号/载波）”。"]}
{"word":"modulating","summary":{"en":"Modulating means adjusting or changing something gradually and in a controlled way—especially your voice, a musical key, or a signal.","zh":"Modulating 指以可控方式逐步调节或变化——常用于声音/语气、音乐转调或信号调制。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"changing something gradually (such as sound, light, speed, or feelings) to achieve a desired effect; adjusting or varying in a controlled way","zh":"（为达到某种效果而）逐渐调节、调整或改变（如声音、光线、速度或情绪等）"},"examples":[{"en":"She was modulating her voice so everyone could hear clearly.","zh":"她在调节自己的音量，让每个人都能听清楚。"},{"en":"The therapist helped him practice modulating his anger during disagreements.","zh":"治疗师帮助他练习在争执中调节自己的愤怒。"}]},{"partOfSpeech":"v.","definition":{"en":"(music) changing from one key to another; shifting the tonal center","zh":"（音乐）转调；从一个调性转换到另一个调性"},"examples":[{"en":"The song keeps modulating to higher keys near the end.","zh":"这首歌在结尾处不断转到更高的调。"},{"en":"The composer used modulating harmonies to build tension.","zh":"作曲家用转调的和声来增强紧张感。"}]},{"partOfSpeech":"v.","definition":{"en":"(technology) varying a carrier signal to transmit information (for example, AM or FM radio)","zh":"（技术）对载波进行调制以传递信息（如 AM/ FM 广播）"},"examples":[{"en":"The device is modulating the signal to reduce noise during transmission.","zh":"该设备正在对信号进行调制，以减少传输中的噪声。"},{"en":"FM works by modulating frequency rather than amplitude.","zh":"FM 的工作方式是调制频率而不是振幅。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) gradually changing or being adjusted in a controlled way","zh":"（形容词）可调的；在逐渐变化/被调节的"},"examples":[{"en":"He spoke in a calm, modulating tone.","zh":"他说话语气平静而富于变化。"},{"en":"The film’s modulating light makes the scene feel dreamlike.","zh":"电影中逐渐变化的光线让场景显得梦幻。"}]}],"synonyms":["adjusting","varying","altering","shifting","regulating","fine-tuning"],"phonetic":"/ˈmɑːdʒəˌleɪtɪŋ/","extraExplanation":["“modulating”来自动词“modulate”。日常英语里常见于谈“声音/语气/情绪”的控制与变化（例如 public speaking 里强调 modulate your voice，让表达更清晰、有感染力）。","音乐里的“转调（modulation）”通常用于制造推进感或情绪上升，因此你会在流行歌副歌升调时听到“modulating to a higher key”。","工程/通讯里的“调制”是专业义：把信息（声音、数据）“编码”到载波上，才方便远距离传输。常见例子是 AM（调幅）与 FM（调频）。"]}
{"word":"modulation","summary":{"en":"Modulation means a purposeful change—most commonly in voice/sound, in music (changing key), or in technology (changing a carrier signal).","zh":"Modulation 指“有目的的变化/调整”，常见于嗓音与声音、音乐转调，以及技术中的信号调制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a change or adjustment in something (especially sound, voice, or the way something is expressed) to make it more effective or pleasant","zh":"（尤指声音、嗓音或表达方式的）改变/调整，使其更有效、更悦耳或更合适"},"examples":[{"en":"Good public speakers use voice modulation to keep the audience interested.","zh":"优秀的演讲者会运用嗓音的抑扬变化来吸引听众。"},{"en":"The app offers modulation settings to reduce harsh noise.","zh":"这款应用提供调制/调整设置来降低刺耳的噪音。"}]},{"partOfSpeech":"n.","definition":{"en":"in music, a change from one key to another","zh":"【音乐】转调；从一个调性转到另一个调性"},"examples":[{"en":"The song’s modulation in the final chorus makes it feel more dramatic.","zh":"歌曲在最后副歌的转调让情绪更有戏剧张力。"}]},{"partOfSpeech":"n.","definition":{"en":"in radio/technology, the process of varying a carrier wave to carry information (like sound or data)","zh":"【无线电/技术】调制；通过改变载波来传递信息（如声音或数据）的过程"},"examples":[{"en":"FM is a type of modulation used for broadcasting audio signals.","zh":"调频（FM）是一种用于广播音频信号的调制方式。"}]}],"synonyms":["adjustment","variation","shift","change","inflection","transition"],"phonetic":"/ˌmɑːdʒəˈleɪʃən/","extraExplanation":["词源小提示：modulation 来自拉丁语 modul-（“度量、节奏、方式”相关）。因此它的核心感觉是“按某种方式做出细微而有目的的变化”。在日常英语里，最常见的搭配是 voice modulation（嗓音抑扬/语调变化）与 tone modulation（语气/音色调整）。","文学与修辞里也常把 modulation 当作“语气的转变”，例如叙述从轻松变得严肃、从讽刺变得真诚；这种变化能影响读者/听众的情绪与理解。"]}
{"word":"modulations","summary":{"en":"“Modulations” means controlled changes or variations; in music it means key changes; in electronics it means signal modulation (AM/FM).","zh":"“modulations”指有控制的变化/起伏；在音乐中指转调；在通信电子中指（AM/FM 等）信号调制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"changes or variations, especially in the level, strength, or character of something (often used for sound, light, voice, or emotion).","zh":"（某事物的）变化或起伏；（尤指）在强度、水平或特征上的调节与变化（常用于声音、光线、语气、情绪等）。"},"examples":[{"en":"The modulations in her voice made the story feel warm and personal.","zh":"她声音里的抑扬变化让故事听起来温暖而亲切。"},{"en":"Small modulations of light in the room made the painting look different at different times of day.","zh":"房间里光线的细微变化让那幅画在一天的不同时段呈现出不同的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"in music, changes from one key to another (key changes).","zh":"【音乐】转调；从一个调（主调/调性）转换到另一个调（调性变化）。"},"examples":[{"en":"The song uses modulations to build excitement before the chorus.","zh":"这首歌用转调在副歌前逐步营造兴奋感。"},{"en":"Classical pieces often have smooth modulations between related keys.","zh":"古典作品常在相关调之间进行自然的转调。"}]},{"partOfSpeech":"n.","definition":{"en":"in communication and electronics, the process of changing a carrier signal to transmit information (for example, AM or FM).","zh":"【通信/电子】调制；通过改变载波信号来传递信息（如调幅 AM、调频 FM）。"},"examples":[{"en":"FM radio relies on frequency modulations to carry sound clearly.","zh":"FM 广播依靠频率调制来清晰传递声音。"},{"en":"Different modulations can affect how well a signal travels through noise.","zh":"不同的调制方式会影响信号在噪声环境中的传输效果。"}]}],"synonyms":["variations","shifts","changes","adjustments","fluctuations","key changes","modulation schemes"],"phonetic":"/ˌmɑːdʒəˈleɪʃənz/","extraExplanation":["“modulations”是“modulation”的复数。它常见于三类语境：①日常表达（语气/情绪/光线的“起伏变化”）；②音乐（“转调”）；③通信工程（“调制”）。看上下文里的关键词能快速判断：voice/tone/light/emotion → 一般变化；key/chord/chorus → 音乐转调；signal/carrier/AM/FM → 通信调制。","词源上来自拉丁语“modulus（尺度、节律）”，所以核心感觉是“按某种尺度进行调整/变化”，强调变化不是乱变，而是有控制、有方向的变化。"]}
{"word":"modulative","summary":{"en":"Modulative means “able to modulate”—it adjusts or regulates an effect, tone, activity, or (in technical contexts) a signal.","zh":"Modulative 表示“可调节/起调节作用的”，用于描述对效果、语调、活动或（技术语境中）信号进行调制或调节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to modulate; serving to adjust, regulate, or change something (such as strength, tone, activity, or effect).","zh":"可调节的；起调制/调节作用的；用于改变或控制（强度、语调、活动或效果等）的。"},"examples":[{"en":"Some medicines have a modulatory (modulative) effect on the immune system.","zh":"有些药物对免疫系统有调节（modulative）作用。"},{"en":"He spoke in a modulatory/modulative voice, lowering his tone to calm the room.","zh":"他说话时用了调节语气的方式，压低声调让大家冷静下来。"}]},{"partOfSpeech":"adj.","definition":{"en":"In technical writing (e.g., electronics or acoustics), relating to modulation: the process of varying a signal to carry information.","zh":"（技术语境，如电子/声学）与“调制”有关的：通过改变信号来承载信息的过程。"},"examples":[{"en":"They tested a modulatory/modulative circuit to improve signal transmission.","zh":"他们测试了一个调制相关的电路来改善信号传输。"},{"en":"Frequency modulation uses modulatory changes in a carrier wave.","zh":"调频会对载波进行调制性的变化。"}]}],"synonyms":["modulatory","regulating","adjusting","modifying","altering"],"phonetic":"/ˈmɑːdʒəˌleɪtɪv/","extraExplanation":["“modulative”在现代英语里相对少见，更常见的是“modulatory”。两者意思非常接近，很多场合可互换，但学术论文（尤其医学/生物学）里通常更偏好用“modulatory”。","词源上来自“modulate”（调节、调制）+ 形容词后缀“-ive”，核心含义就是“起到调节/改变作用的”。如果你在写作中想更自然，优先考虑用“modulatory”或更通用的“regulating / modifying”。"]}
{"word":"modulator","summary":{"en":"A modulator is something (usually a device, sometimes a substance) that changes or controls a signal or process.","zh":"modulator 指“调制器/调节器”：通常是改变或控制信号的装置；在医学/生物中也可指调节某过程的物质或因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or component that changes (controls) a signal—such as its amplitude, frequency, or phase—to carry information or achieve a desired effect.","zh":"调制器：一种装置或部件，用来改变（控制）信号（如振幅、频率或相位），以传递信息或实现特定效果。"},"examples":[{"en":"In a radio transmitter, the modulator adds the audio signal to the carrier wave.","zh":"在无线电发射机中，调制器把音频信号叠加到载波上。"},{"en":"The engineer replaced the modulator to reduce noise in the communication system.","zh":"工程师更换了调制器，以降低通信系统中的噪声。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine or biology, a substance or factor that changes how a process works, especially by increasing or decreasing activity (often used in phrases like “immune modulator” or “neuromodulator”).","zh":"（医学/生物）调节剂/调制因子：能改变某一过程如何运作的物质或因素，常指增强或降低活动（常见搭配如“免疫调节剂”“神经调节物质”）。"},"examples":[{"en":"Melatonin can act as a modulator of sleep–wake cycles.","zh":"褪黑素可以作为睡眠—觉醒周期的调节因子。"},{"en":"Researchers tested a new immune modulator to help the body respond to infection.","zh":"研究人员测试了一种新的免疫调节剂，以帮助身体应对感染。"}]}],"synonyms":["controller","regulator","signal processor","modifier"],"phonetic":"/ˈmɑːdjəˌleɪtər/","extraExplanation":["在工程语境里，modulator 最常和“carrier wave（载波）”“transmitter（发射机）”“AM/FM/PM（调幅/调频/调相）”一起出现：它的核心作用是把“信息”放到信号上，便于传输。","在医学论文或新闻里，modulator 常出现在复合词中（如 receptor modulator 受体调节剂），强调“调节/改变强度”，不一定是“完全开启或关闭”。"]}
{"word":"modulators","summary":{"en":"“Modulators” are devices, substances, or factors that adjust or modify something in a controlled way, especially in engineering and biology/medicine.","zh":"“modulators”指以可控方式对某事物进行改变/调节的装置、物质或因素，常见于工程以及生物/医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that change something (such as a signal, sound, light, or a biological process) in a controlled way.","zh":"以可控方式改变某事物（如信号、声音、光线或生物过程）的人或物；调制器/调节器。"},"examples":[{"en":"In radio communication, modulators help put voice information onto a carrier wave.","zh":"在无线电通信中，调制器帮助把语音信息加载到载波上。"},{"en":"Some medications act as immune modulators, meaning they adjust how the immune system responds.","zh":"有些药物属于免疫调节剂，意思是它们会调节免疫系统的反应方式。"}]}],"synonyms":["regulators","controllers","adjusters","modifying agents"],"phonetic":"/ˈmɑːdʒəˌleɪtərz/","extraExplanation":["“modulators”是复数形式，单数是“modulator”。它来自动词“modulate”（调制/调节）：在工程里常指对信号的幅度、频率或相位做变化；在医学与生物学里常指“调节某个系统的强弱或方式”，比如“immune modulator（免疫调节剂）”。","不同领域的常见搭配：signal modulators（信号调制器）、audio modulators（音频调制器）、light modulators（光调制器）、neuromodulators（神经调质/神经调节物质，如多巴胺、血清素等）。"]}
{"word":"modulatory","summary":{"en":"Modulatory means “adjusting or regulating how something works,” especially in scientific or academic contexts.","zh":"Modulatory 指“起调节/调控作用的”，常用于科学或学术语境，强调对过程强弱或方式的微调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the function of adjusting, regulating, or fine-tuning how something works (rather than starting it or stopping it completely)","zh":"具有“调节/调控/微调”功能的（通常指改变某个过程的强度、速度或方式，而不是直接启动或完全停止）"},"examples":[{"en":"Sleep has a modulatory effect on mood and attention.","zh":"睡眠对情绪和注意力有调节作用。"},{"en":"The drug is not a strong blocker; it has a modulatory role in the immune response.","zh":"这种药不是强效“阻断剂”；它更多是在免疫反应中起调节作用。"},{"en":"Teachers can play a modulatory role by adjusting the pace to match students’ needs.","zh":"老师可以通过调整课堂节奏来起到调节作用，以适应学生的需求。"}]}],"synonyms":["regulatory","modulating","adjustive","tuning","fine-tuning"],"phonetic":"/ˈmɑːdʒəˌleɪtəri/","extraExplanation":["“modulatory”常见于科学与学术语境（神经科学、药理学、免疫学、心理学、工程控制等）。它强调“改变一个系统的参数/强度/倾向”，而不是“直接造成主要动作”。例如：某种物质不一定“引发”疼痛或“消除”疼痛，但能“调节”疼痛信号的传递强弱。","词源上与“modulate（调节、变调、调制）”同源。学习时可对比：inhibitory（抑制性的，往下压）/excitatory（兴奋性的，往上推）/modulatory（调节性的，既可能增强也可能减弱，取决于情境）。","搭配很固定：modulatory effect（调节作用）、modulatory role（调节角色/功能）、modulatory influence（调节性影响）、modulatory mechanism（调节机制）。在日常口语中更常用“regulatory/adjusting”来表达。"]}
{"word":"modulatus","summary":{"en":"Modulatus is a rare Latin-derived word meaning “modulated” or “shaped with rhythmic/tonal variation,” mostly used in scholarly or literary contexts.","zh":"Modulatus 是一个较罕见的拉丁语借词，意为“经调制的/有抑扬变化的”，多用于学术或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, Latin-derived) Modulated; shaped or varied in tone, pitch, intensity, or rhythm—especially in music or speech.","zh":"（罕见，源自拉丁语）“经调制的；有抑扬变化的”。尤指音乐或言语中音高、强弱、节奏等被加以变化与塑形。"},"examples":[{"en":"The singer’s modulatus phrasing made the melody feel alive.","zh":"歌手那种有抑扬变化的（modulatus）乐句处理让旋律更有生命力。"},{"en":"In the poem, a modulatus voice shifts from calm to urgent.","zh":"在这首诗里，叙述的声音带着抑扬变化（modulatus），从平静转为急切。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Latin grammar) The past participle of Latin modulor (“to measure, sing, modulate”), meaning “having been modulated/sung in measured rhythm.”","zh":"（拉丁语语法）拉丁语 modulor（“按节律歌唱/调制”）的过去分词，意为“已经被调制/按节律歌唱过的”。"},"examples":[{"en":"The manuscript glosses modulatus as “sung with measured rhythm.”","zh":"手稿注释将 modulatus 解释为“按节律歌唱”。"}]}],"synonyms":["modulated","measured","rhythmic","intoned"],"phonetic":"ˌmɑːdʒəˈleɪtəs","extraExplanation":["“modulatus”并不是现代英语里的常用词，更常见的对应表达是 **modulated**（如 *a modulated voice* “抑扬顿挫的声音”）。它多见于拉丁文原文引用、古典音乐/修辞讨论或学术写作中，用来制造古典、庄重的语感。","词源上来自拉丁语 **modulor**（与 *mode, module, modulate* 同源），核心概念是“度量、尺度、节律”，所以它常带有“有分寸、有节制、符合节奏”的意味。"]}
{"word":"Module","summary":{"en":"A module is a separate unit of a course or a self-contained part of a larger system, designed to work as a component.","zh":"module 指课程中的一个独立单元，或大型系统中可独立工作的组件/模块，强调可拆分与组合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit or section of a course, training program, or textbook, usually focused on one topic.","zh":"（课程、培训或教材中的）单元/模块，通常围绕一个主题。"},"examples":[{"en":"This semester we have a module on academic writing.","zh":"这学期我们有一个关于学术写作的课程模块。"},{"en":"You need to pass all modules to complete the program.","zh":"你需要通过所有模块才能完成这个项目。"}]},{"partOfSpeech":"n.","definition":{"en":"A self-contained part of a larger system (especially in software, electronics, or machinery) that can be added, removed, or replaced.","zh":"（系统中的）可独立运作的组成部分/组件（尤指软件、电子或机械），可被添加、移除或替换。"},"examples":[{"en":"The app has a payment module and a messaging module.","zh":"这个应用有支付模块和消息模块。"},{"en":"Replace the faulty memory module in the computer.","zh":"把电脑里有故障的内存条（内存模块）换掉。"}]},{"partOfSpeech":"n.","definition":{"en":"A standard unit used for measuring or designing parts so they fit together (used in engineering, architecture, and manufacturing).","zh":"（工程、建筑、制造中用于统一尺寸的）模数/标准单位，使部件能匹配装配。"},"examples":[{"en":"The design uses a 100-mm module to standardize the panel sizes.","zh":"该设计采用100毫米的模数来统一面板尺寸。"}]}],"synonyms":["unit","component","section","part","block"],"phonetic":"/ˈmɑːdʒuːl/","extraExplanation":["“module”来自拉丁语 modulus（“小尺度/度量标准”），所以它常带有“标准化、可组合”的感觉：不管是课程单元还是软件组件，都是“可拆分、可组合”的部分。","在英语学习与工作场景里，module 很常见于教育（course module）、编程与产品（software module）、硬件（memory module）。口语里有时也会说 unit，但 module 更强调“一个相对独立、可插拔的部分”。"]}
{"word":"module","summary":{"en":"A module is a separate unit or component of a larger whole, especially in courses, software, or modular design.","zh":"module 指整体中的一个独立单元/组件，常见于课程结构、软件编程以及模块化设计等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part or unit of a larger system that has a specific function and can often be replaced or combined with other parts.","zh":"（系统的）模块；部件；功能单元（可组合、可替换，负责特定功能）"},"examples":[{"en":"This course is divided into eight modules.","zh":"这门课程分成八个模块。"},{"en":"If the payment module fails, the app can’t complete orders.","zh":"如果支付模块出故障，应用就无法完成下单。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing/programming, a self-contained piece of software (code and related resources) that can be imported or used by other programs.","zh":"（计算机/编程）模块（可被导入或复用的一段独立代码/软件组件）"},"examples":[{"en":"Install the module and then import it in your script.","zh":"安装这个模块，然后在脚本里导入它。"},{"en":"The team wrote a logging module to record errors.","zh":"团队写了一个日志模块来记录错误。"}]},{"partOfSpeech":"n.","definition":{"en":"In engineering or design, a standardized building block made to fit with others (for example, in furniture, machines, or architecture).","zh":"（工程/设计）标准化组件；模组（按统一规格制作，便于拼装）"},"examples":[{"en":"The kitchen cabinets use modular units, so you can rearrange them easily.","zh":"这套橱柜用的是模块化单元，所以可以很容易重新组合。"},{"en":"They replaced one broken module instead of rebuilding the whole machine.","zh":"他们只更换了一个损坏的模块，而不是重建整台机器。"}]}],"synonyms":["unit","component","section","part","block","package","plug-in"],"phonetic":"/ˈmɑːdʒuːl/","extraExplanation":["“module”常和“modular（模块化的）”一起出现：modular design（模块化设计）强调用标准部件拼装，便于扩展、维修与升级。","在不同语境里它的“核心概念”一致：独立、可复用、可组合的单元；区别主要在领域（课程/软件/工程）。"]}
{"word":"modules","summary":{"en":"Modules are separate, connectable parts of a larger system (common in courses, software, and engineering).","zh":"modules（modules 为 module 的复数）指系统中的可独立、可连接的“模块”，常见于课程、软件与工程等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A module is a separate part of a larger system, designed to work on its own but also connect with other parts.","zh":"module 指“模块”，是较大系统中的一个独立部分，既能单独运作，也能与其他部分连接配合。"},"examples":[{"en":"The course is divided into six modules.","zh":"这门课程分成六个模块。"},{"en":"Engineers tested each module before assembling the whole machine.","zh":"工程师先测试每个模块，再组装整台机器。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A self-contained unit of code or software that can be added, removed, or reused in a program.","zh":"（计算机）可独立运行的一段代码或软件单元，可以在程序中添加、移除或重复使用。"},"examples":[{"en":"We imported a module to handle dates and times.","zh":"我们导入了一个模块来处理日期和时间。"},{"en":"This app lets you enable or disable modules in the settings.","zh":"这个应用允许你在设置里启用或禁用各个模块。"}]},{"partOfSpeech":"n.","definition":{"en":"(Electronics/engineering) A packaged component or unit that can be plugged into a larger device or system.","zh":"（电子/工程）封装好的组件或单元，可插入更大的设备或系统中使用。"},"examples":[{"en":"The technician replaced the power module.","zh":"技术员更换了电源模块。"},{"en":"The station is built from modules that can be expanded later.","zh":"这个站点由多个模块组成，之后还能扩建。"}]}],"synonyms":["components","units","sections","parts","blocks"],"phonetic":"/ˈmɑdʒuːl/","extraExplanation":["“modules”是“module”的复数形式。这个词常和“modular（模块化的）”一起出现：模块化设计强调把复杂系统拆成若干可替换、可升级的部分，便于维护与扩展。","在学习场景中，module常指课程的“单元/章节”；在编程里，module常指“模块/库”（例如Python的module）。"]}
{"word":"moduli","summary":{"en":"*Moduli* is the plural of *modulus*, used mainly in math (absolute value or “mod” number) and in science/engineering (elastic moduli).","zh":"*moduli* 是 *modulus* 的复数，主要用于数学（绝对值或“mod”的模数）以及理工科（各种弹性模量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of *modulus*: in mathematics, a modulus can mean the **absolute value** of a number, or a **number used in modular arithmetic** (e.g., “mod 7”).","zh":"*modulus* 的复数：在数学中，*modulus* 可以指一个数的**绝对值**，也可以指模运算（同余运算）里使用的**模数**（如“模 7 / mod 7”）。"},"examples":[{"en":"In modular arithmetic, two numbers are equivalent if they have the same remainder for a given modulus (plural: moduli).","zh":"在模运算中，如果两个数对同一个模数（复数：moduli）取余的结果相同，就认为它们同余。"},{"en":"We often use small moduli like 10 to study last digits.","zh":"我们常用像 10 这样的较小模数（moduli）来研究个位数（最后一位数字）。"}]},{"partOfSpeech":"n.","definition":{"en":"In engineering/science, plural of *modulus*: values that measure a material’s stiffness or deformation behavior (e.g., **Young’s modulus**, **shear modulus**).","zh":"在工程/材料科学中，*modulus* 的复数：表示材料刚度或变形特性的各种**弹性模量**（如**杨氏模量**、**剪切模量**）。"},"examples":[{"en":"Metals and polymers can have very different elastic moduli.","zh":"金属和聚合物的弹性模量（moduli）可能差异很大。"},{"en":"The report lists the tensile strength and the relevant moduli for each sample.","zh":"报告列出了每个样品的抗拉强度以及相关的模量（moduli）。"}]}],"synonyms":["modulus (singular)","absolute value (math sense)","mod (informal, modular arithmetic sense)","elastic modulus (engineering sense)"],"phonetic":"/ˈmɑːdʒəˌlaɪ/","extraExplanation":["“moduli”是拉丁语复数形式（比英语规则复数“modulus → moduluses”更常见、更正式，尤其在数学与工程领域）。","数学里常见两种相关概念：① modulus = 绝对值（例如 |−3| 的 modulus 是 3）；② modulus = 模数（例如“mod 7”里的 7）。这两个中文都可能翻成“模”，容易混淆，建议根据语境判断。"]}
{"word":"modulidae","summary":{"en":"Modulidae is a taxonomic family of small marine sea snails (gastropods), also called modulids.","zh":"Modulidae 指一种小型海洋海螺（腹足类）的生物分类“科”，俗称 modulids。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of small marine sea snails (gastropod mollusks), commonly called modulids.","zh":"（生物分类）一种小型海洋海螺（腹足纲软体动物）的“科”，常见英文俗名为 modulids（模螺科/模螺类海螺）。"},"examples":[{"en":"Scientists recorded several species in the family Modulidae along the tropical coastline.","zh":"科学家在热带海岸记录到了数种属于 Modulidae（模螺科）的物种。"},{"en":"In a field guide, Modulidae is listed under marine gastropods.","zh":"在一本野外图鉴里，Modulidae 被归在海洋腹足类之下。"}]}],"synonyms":["modulids","modulid snails"],"phonetic":"ˌmɑːdʒəˈlaɪdiː","extraExplanation":["“Modulidae”是拉丁化的生物分类名称（科名），在英文里通常首字母大写（Modulidae），斜体与否取决于写作风格与期刊规范。","它不是日常英语词汇；更常见的说法是用俗名“modulids”或直接说“a modulid snail”。","相关词：gastropod（腹足类）、mollusk/mollusc（软体动物）、sea snail（海螺/海洋蜗牛）、Modulus（该科中一个属名）。"]}
{"word":"modulize","summary":{"en":"“Modulize” means to make something modular by dividing it into separate parts (modules), often used in engineering and software.","zh":"“Modulize”指把某物模块化：拆分成独立的模块（常见于工程与软件领域）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to organize or design something so it is made of separate, standardized parts (modules) that can be built, replaced, or used independently","zh":"把某物设计或组织成由独立、标准化的部分（模块）组成，以便可以独立建造、替换或单独使用"},"examples":[{"en":"The company decided to modulize the product so customers could upgrade only one part at a time.","zh":"公司决定把产品模块化，这样客户每次只需要升级其中一个部件。"},{"en":"We should modulize the course materials into short units for easier learning.","zh":"我们应该把课程资料模块化，拆成短单元，方便学习。"}]},{"partOfSpeech":"vt.","definition":{"en":"(especially in software) to break a system, program, or process into smaller components that have clear responsibilities","zh":"（尤指软件领域）把系统、程序或流程拆分为职责清晰的较小组件"},"examples":[{"en":"The team modulized the codebase to make testing and maintenance faster.","zh":"团队把代码库模块化，以便更快测试和维护。"},{"en":"If we modulize the workflow, each step can be improved without changing the whole process.","zh":"如果我们把工作流程模块化，就能在不改动整体的情况下优化每一步。"}]}],"synonyms":["modularize","standardize","divide into modules","componentize"],"phonetic":"/ˈmɑːdʒəˌlaɪz/","extraExplanation":["“modulize”在英语里能用、也能被理解，但更常见、更标准的拼写是“modularize”（尤其在美式英语的工程/软件语境中更常见）。","搭配建议：modulize a product/system/course/codebase（把产品/系统/课程/代码库模块化）；也常与into连用：modulize something into modules（把……拆成模块）。"]}
{"word":"modulo","summary":{"en":"Modulo is used in math/computing to talk about remainders: either the operation of taking a remainder, or the idea of comparing numbers by their remainders (modular arithmetic).","zh":"Modulo 用于数学/计算机中与“余数”相关：既可以指取余（取模）运算，也可以指“以某个模为准”来比较数（模运算/同余）。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"in modular arithmetic: “with respect to a modulus”; used to say numbers are compared by their remainders (e.g., congruent modulo 5).","zh":"（模运算中）“以某个模为准”；表示用余数来比较数（如“模 5 同余”）。"},"examples":[{"en":"17 is congruent to 2 modulo 5 because they have the same remainder when divided by 5.","zh":"17 与 2 在模 5 意义下同余，因为它们除以 5 的余数相同。"},{"en":"We work modulo 12 when we do clock arithmetic.","zh":"做钟表运算时，我们是在模 12 的体系下计算。"}]},{"partOfSpeech":"n.","definition":{"en":"the modulo operation (often written “mod”): finding the remainder after division.","zh":"取模（常写作 mod）：计算除法后的余数。"},"examples":[{"en":"17 modulo 5 equals 2.","zh":"17 对 5 取模等于 2。"},{"en":"In many programming languages, a % b means “a modulo b.”","zh":"在很多编程语言里，a % b 表示“a 对 b 取模”。"}]}],"synonyms":["mod","remainder (in this context)"],"phonetic":"/ˈmɑːdʒəˌloʊ/","extraExplanation":["“modulo”来自拉丁语，和“modulus（模数）”是同一词根。学习时可把 modulus 记为“那个用来取模的数（比如 mod 5 里的 5）”，而 modulo/mod 则更像“取模这个动作/规则”。","在数学写法里常见：a ≡ b (mod n)。读作“a 与 b 模 n 同余”。意思是 (a − b) 能被 n 整除，也等价于 a 和 b 除以 n 的余数相同。","在编程里要注意：有些语言对负数取模的结果规则不同（例如 -1 % 5 可能得到 -1 或 4），具体要看语言定义。"]}
{"word":"modulus","summary":{"en":"Modulus most commonly means absolute value in math, and it can also mean the number used for “mod” (the cycle size) or a material’s stiffness (modulus).","zh":"Modulus 最常指数学中的绝对值；也可指模运算的模数（循环大小），或材料的模量（刚度）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In mathematics, the absolute value of a number; the distance from 0 (always nonnegative).","zh":"（数学）绝对值；到 0 的距离（总是非负）。"},"examples":[{"en":"The modulus of −7 is 7.","zh":"−7 的 modulus（绝对值）是 7。"},{"en":"Take the modulus before you compare the sizes of the numbers.","zh":"比较数字大小之前先取绝对值。"}]},{"partOfSpeech":"n.","definition":{"en":"In modular arithmetic, a number that sets the size of a repeating cycle; you work “mod” this number.","zh":"（同余/模运算）模数；决定循环重复范围的数，计算时“对这个数取模”。"},"examples":[{"en":"In clock math, we often use modulus 12.","zh":"在“钟表算术”里，我们常用模数 12。"},{"en":"Compute 17 mod 5: the result is 2, with modulus 5.","zh":"计算 17 mod 5：结果是 2，模数是 5。"}]},{"partOfSpeech":"n.","definition":{"en":"In engineering, a measure of a material’s stiffness (e.g., elastic modulus).","zh":"（工程/材料）模量；材料“硬度/刚度”的度量（如弹性模量）。"},"examples":[{"en":"Steel has a higher elastic modulus than rubber.","zh":"钢的弹性模量比橡胶高。"},{"en":"The design depends on the material’s modulus.","zh":"这个设计取决于材料的模量。"}]}],"synonyms":["absolute value","mod","modulo","elastic modulus","Young’s modulus"],"phonetic":"/ˈmɑːdʒələs/","extraExplanation":["“modulus”来自拉丁语 *modulus*（“小尺度/标准”），与“measure（测量）/mode（方式）/modify（修改）”有同源关系。","常见搭配：*absolute value*（绝对值）在很多教材里比“modulus”更常用；而在同余里你会更常看到“mod n”。","易混点：*modulus*（名词：模数/绝对值/模量） vs. *modulo*（介词/副词/形容词：以……为模，如 “modulo 5”）。"]}
{"word":"modumite","summary":{"en":"“Modumite” doesn’t appear to be a standard English word; it’s probably a misspelling or a name. Share the context and I’ll identify the intended word.","zh":"“modumite”看起来不是标准英语词，更可能是拼写错误或某种名称。把上下文发我，我可以帮你确认真正要查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; likely a misspelling, a username/product name, or a rare proper noun.","zh":"不是主流英语词典中的标准词；更可能是拼写错误、用户名/产品名，或罕见专有名词。"},"examples":[{"en":"I can’t find a dictionary meaning for “modumite.” Where did you see it?","zh":"我在词典里找不到“modumite”的释义。你是在哪里看到的？"},{"en":"If you meant “mordenite,” that’s a mineral name.","zh":"如果你想写的是“mordenite”，那是一个矿物名称。"}]}],"phonetic":"/ˈmoʊdjuːmaɪt/","extraExplanation":["“modumite”在常见词库里基本查不到，网上更多只把它当作一串字母（比如用于变位词/字母重组的页面）。([en.anagramme-expert.com](https://en.anagramme-expert.com/modumite/?utm_source=openai))","它很像一些矿物名的拼写（尤其是以 -nite / -dite / -mite 结尾的词）。例如 **mordenite** 是一种沸石族矿物。([britannica.com](https://www.britannica.com/science/mordenite?utm_source=openai))","你可以告诉我：你看到它的句子、领域（游戏/化学/地质/品牌/人名）、以及是否可能拼错了。只要给我上下文，我就能更准确地帮你确认你真正想查的词。"]}
{"word":"modus","summary":{"en":"Modus means a method or way of doing something, usually in Latin phrases like modus operandi or modus vivendi.","zh":"Modus 指“方法、方式”，通常出现在拉丁短语中，如 modus operandi（做事方式/作案手法）或 modus vivendi（相处之道/临时妥协）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(formal) A method, manner, or way of doing something, most often used in fixed Latin phrases.","zh":"（正式用语）做事的方法、方式；多用于固定拉丁短语中。"},"examples":[{"en":"The police are trying to identify the burglar’s modus operandi.","zh":"警方正试图辨认这名入室盗窃者的作案手法（惯用手段）。"},{"en":"They reached a modus vivendi to work together despite disagreements.","zh":"尽管存在分歧，他们还是达成了一种“相处之道”，以便合作。"}]}],"synonyms":["method","manner","approach","way","procedure"],"phonetic":"/ˈmoʊdəs/","extraExplanation":["“modus”源自拉丁语，意思是“方式、尺度”。在现代英语里很少单独使用，更常见于：\n- modus operandi（常缩写为 M.O.）：做事方式；（尤指）作案手法、惯用手段。\n- modus vivendi：临时的妥协安排；（也可指）彼此能和平共处的相处方式。\n在写作中，它带有较强的书面、正式或学术语气。"]}
{"word":"mody","summary":{"en":"“MODY” usually means a rare inherited type of diabetes; “Mody” can also be a surname.","zh":"“MODY”通常指一种罕见的遗传性糖尿病；“Mody”也可以是姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medical) An abbreviation for “maturity-onset diabetes of the young,” a rare inherited (genetic) form of diabetes, often diagnosed in teens or young adults.","zh":"（医学）“青年型成人发病糖尿病”的缩写，一种较少见的遗传性（基因）糖尿病，常在青少年或年轻成人期被诊断。"},"examples":[{"en":"The doctor suspects MODY, so she recommended genetic testing.","zh":"医生怀疑是 MODY，所以建议做基因检测。"},{"en":"MODY can be mistaken for type 1 or type 2 diabetes.","zh":"MODY 可能会被误认为 1 型或 2 型糖尿病。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), sometimes spelled like “Modi/Mody,” used in different regions and cultures.","zh":"一个姓氏（家族名），有时也写作 Modi/Mody，在不同地区与文化中都有人使用。"},"examples":[{"en":"Her last name is Mody.","zh":"她的姓是 Mody。"}]}],"synonyms":["maturity-onset diabetes of the young"],"phonetic":"/ˈmoʊdi/","extraExplanation":["“MODY”通常会全部大写，因为它是医学缩写；口语里一般按单词读作 /ˈmoʊdi/（像“MOH-dee”），而不是逐个字母读。","如果你本来想查的是 **moody**（“情绪多变的；阴郁的”）或 **modify**（“修改”），告诉我你想要哪个，我可以把对应词条也给你。"]}

