{"word":"mofette","summary":{"en":"A mofette is a cold volcanic vent (or the gases from it) that releases mainly carbon dioxide.","zh":"mofette 指低温火山逸气喷口（或其逸出的气体），主要成分为二氧化碳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cold volcanic vent or fissure that releases mainly carbon dioxide (often in the late stage of volcanic activity)","zh":"（地质）低温火山气体喷口；主要喷出二氧化碳的地面裂隙/通气孔（常见于火山活动的末期或休眠期）"},"examples":[{"en":"Scientists measured carbon dioxide levels near a mofette to assess ongoing underground degassing.","zh":"科学家在一处 mofette 附近测量二氧化碳浓度，以评估地下是否仍在排气。"},{"en":"Because CO₂ is heavier than air, gas from a mofette can pool in low areas.","zh":"由于二氧化碳比空气重，mofette 释放的气体可能会在低洼处聚集。"}]},{"partOfSpeech":"n.","definition":{"en":"the noxious gases (especially carbon dioxide) emitted from such a vent","zh":"（尤指二氧化碳等）从该喷口逸出的有害气体"},"examples":[{"en":"On still days, the mofette can linger close to the ground and pose a risk to animals.","zh":"在无风的日子里，这种 mofette 气体会贴近地面停留，对动物造成风险。"}]}],"synonyms":["cold fumarole","gas vent","volcanic vent","fumarole (related)"],"phonetic":"/moʊˈfɛt/","extraExplanation":["这个词在日常英语里很少见，多用于地质/火山学语境；更常见的相关词是 **fumarole**（喷气孔/火山喷气口，一般更“热”）。","词源上与法语 **mofette**（有毒的恶臭气体）有关；在法语（尤其加拿大法语）里相近拼写 **mouffette** 还可指“臭鼬（skunk）”，但英语里的 **mofette** 通常指火山气体喷口/逸出气体，而不是动物。","安全提示：mofette 以 CO₂ 为主，CO₂ 无色无味且比空气重，可能在坑洼处“积气”导致缺氧窒息，因此在火山/温泉区看到地面冒气或“无风却气体沉积”的地方应保持距离、避免进入低洼处。"]}
{"word":"mofettes","summary":{"en":"Mofettes are small natural vents that release cold, CO₂-rich gas, often in volcanic regions, and can be hazardous in low-lying areas.","zh":"Mofettes 指喷出低温、富含二氧化碳气体的天然小喷口，多见于火山地区；气体在低洼处聚集时可能有危险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small natural vents (often in volcanic areas) that release cold, carbon-dioxide–rich gas; the gas can collect in low places and be dangerous to breathe.","zh":"（多见于火山地区的）喷出低温、富含二氧化碳气体的天然小喷口/气孔；气体易在低洼处聚集，吸入可能有危险。"},"examples":[{"en":"In the volcanic field, researchers mapped several mofettes where carbon dioxide seeped from the ground.","zh":"在这片火山区，研究人员绘制了多处 mofettes 的分布图，这些地方会从地面渗出二氧化碳。"},{"en":"Warning signs told hikers not to linger near mofettes, because the heavy gas can pool close to the soil.","zh":"警示牌提醒徒步者不要在 mofettes 附近久留，因为较重的气体会在地表附近积聚。"}]}],"synonyms":["gas vent","CO₂ vent","gas seep"],"phonetic":"/moʊˈfɛts/","extraExplanation":["“mofettes”是复数形式，单数是“mofette”。在地质/火山学语境中更常见；它强调的是“冷的气体喷口”，不同于喷出高温蒸汽或热水的喷气孔（fumarole）。","词源上常被认为与意大利语/法语中表示“有害气体、臭气”的词有关，因此带有“窒息风险”的含义；二氧化碳无色无味，但会挤占氧气，尤其在坑洼或洞穴等低处更危险。"]}
{"word":"moff","summary":{"en":"“Moff” is most commonly known as a Star Wars title for an Imperial governor; it can also be a surname.","zh":"“moff”最常见的用法是《星球大战》中帝国总督类官职头衔；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Star Wars) a title for a high-ranking Imperial official who governs a sector/region (e.g., “Grand Moff,” “Moff”).","zh":"（《星球大战》）帝国高级官员的头衔，通常指负责统治某个星域/区域的总督（如“Grand Moff / 大总督”“Moff / 总督”）。"},"examples":[{"en":"Moff Gideon is an Imperial leader in *The Mandalorian*.","zh":"莫夫·吉迪恩（Moff Gideon）是《曼达洛人》里的帝国势力首领之一。"},{"en":"Grand Moff Tarkin is one of the most famous characters with this title.","zh":"“大总督塔金（Grand Moff Tarkin）”是拥有这一头衔最知名的角色之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏（人名中的姓）。"},"examples":[{"en":"Her last name is Moff.","zh":"她姓 Moff。"},{"en":"Dr. Moff will speak at the conference.","zh":"Moff 博士将在会议上发言。"}]}],"synonyms":["(Star Wars) governor","(Star Wars) Imperial official"],"phonetic":"/mɔf/","extraExplanation":["“Moff”在日常英语里并不是常用词，最常见的来源是《星球大战》宇宙中的官职头衔，带有“帝国体制/军政权力”的文化语境。"]}
{"word":"moffette","summary":{"en":"Moffette (more commonly spelled mofette) is a rare geology word for a ground vent—or the gas from it—that releases mainly carbon dioxide in areas of late-stage volcanic activity.","zh":"moffette（更常見拼作 mofette）是罕見的地質用語，指火山活動晚期釋放以二氧化碳為主的地表噴氣孔，或指從該孔逸出的氣體。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a volcanic vent/opening in the ground that releases gases (especially carbon dioxide), often in the late or nearly extinct stage of volcanic activity","zh":"（火山活動晚期或近乎停止時的）噴氣孔／地表裂縫，主要釋放二氧化碳等氣體"},"examples":[{"en":"The hikers were warned not to step into low areas near the moffette, where carbon dioxide can collect.","zh":"有人提醒健行者不要走進靠近 moffette 的低窪地帶，因為二氧化碳可能會聚積。"},{"en":"Scientists measured gas flow at a moffette to better understand the area’s volcanic history.","zh":"科學家在一處 moffette 測量氣體流量，以更了解該地區的火山歷史。"}]},{"partOfSpeech":"n.","definition":{"en":"the noxious gaseous exhalation itself (mainly carbon dioxide) that escapes from such a vent","zh":"（由噴氣孔逸出的）有害氣體逸散物，本質上多為二氧化碳"},"examples":[{"en":"The moffette was invisible, but it made small animals in the hollow dangerously drowsy.","zh":"moffette 看不見，但它會讓低窪處的小動物陷入危險的昏沉狀態。"},{"en":"In old geology writing, “moffette” can refer to the gas as well as the opening.","zh":"在較早期的地質文獻中，moffette 既可指氣體，也可指噴氣的孔口。"}]}],"synonyms":["mofette","gas vent","volcanic vent","fumarole"],"phonetic":"/moʊˈfɛt/","extraExplanation":["這個字在英文裡很少見，常見拼法是 **mofette**（你輸入的 **moffette** 也是可用的變體）。它來自法語／義大利語，原本和「臭氣、惡臭」的概念有關，所以帶有「刺鼻、有害氣體」的語感。","容易混淆：法語 **mouffette** 指的是「臭鼬（skunk）」；而英文姓氏 **Moffett** 則是人名／姓氏，和火山噴氣孔無關。"]}
{"word":"moffettes","summary":{"en":"“Moffettes” means CO₂-rich cold volcanic gas vents (plural of “mofette”).","zh":"“moffettes”指富含二氧化碳的冷火山逸气喷口（“mofette”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **mofette**: cold volcanic gas vents (or the gas from them), usually rich in carbon dioxide (CO₂).","zh":"**mofette（莫费特气孔/冷喷气孔）**的复数：指温度较低的火山气体喷口（或其喷出的气体），通常以二氧化碳（CO₂）为主。"},"examples":[{"en":"The hikers were warned not to sleep near the **moffettes**, because CO₂ can collect in low areas.","zh":"徒步者被警告不要在**moffettes**附近低洼处过夜，因为二氧化碳可能在低处聚集。"},{"en":"Scientists measured soil chemistry around **moffettes** to study long-term CO₂ effects on ecosystems.","zh":"科学家测量了**moffettes**周围的土壤化学性质，以研究长期二氧化碳对生态系统的影响。"}]}],"synonyms":["mofettes","mofette vents","cold CO₂ vents","(related) fumaroles"],"phonetic":"/moʊˈfɛts/","extraExplanation":["“moffettes”在英语里通常是法语复数拼法，对应单数 **mofette / moffette**，指富含CO₂的“冷”火山逸气喷口；和更常见、温度更高的 **fumarole（喷气孔/火山气孔）**不完全一样。","这个词源自法语 **mofette**，再往前与意大利语 **mofeta**有关，词根与“臭气/霉味”相关；因此早期也常带有“有害气体逸散”的感觉。","文化与现实用法补充：在一些欧洲火山区（如喀尔巴阡山等），“mofette/干式CO₂浴”也会出现在疗养与温泉医疗语境里；但从地质角度它本质仍是CO₂逸散，若通风差或在凹地聚集，确有窒息风险。"]}
{"word":"moffle","summary":{"en":"“Moffle” most commonly refers to a Japanese mochi waffle (mochi cooked in a waffle iron). It can also be a rare spelling variant of “maffle.”","zh":"“moffle”最常指日式“年糕华夫”（把年糕放进华夫机烤制）。它也可能是罕见的“maffle”拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese snack/dessert made by cooking mochi (glutinous rice cake) in a waffle iron, creating a crisp outside and chewy inside","zh":"一种日式点心/小吃：把年糕（糯米糍、mochi）放进华夫饼机里烤成“年糕华夫”，外脆内糯"},"examples":[{"en":"For breakfast, we made moffles and topped them with fruit and honey.","zh":"早餐我们做了 moffles，上面加了水果和蜂蜜。"},{"en":"A moffle tastes like a waffle, but it’s much chewier because it’s made from mochi.","zh":"moffle 吃起来有点像华夫，但因为是用年糕做的，所以更有嚼劲。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a spelling variant of “maffle” (a dialect word); in most everyday writing, “moffle” is more often used for the Japanese food","zh":"（罕见）“maffle”的一种拼写变体（方言词）；在日常英文里，moffle 更常指日式“年糕华夫”"},"examples":[{"en":"I only saw “moffle” used this way in a dictionary note, not in everyday conversation.","zh":"这种用法我只在词典注释里见过，日常对话里几乎不用。"}]}],"synonyms":["mochi waffle","moffles"],"phonetic":"/ˈmɑfəl/","extraExplanation":["“moffle”在美食语境里通常是“mochi + waffle”的合成词，指把年糕放进华夫机烤出来的点心。在菜单、食谱、YouTube/美食文章里更常见。","容易混淆：\n1) **muffle** /ˈmʌfəl/ 是常用词，意思是“把声音压低/闷住”。\n2) **moffie** 是南非英语里的侮辱性俚语，含冒犯意味；请避免使用。"]}
{"word":"mofussil","summary":{"en":"Mofussil means the rural/provincial areas of India outside major cities; it can be a noun (“the mofussil”) or an adjective (“mofussil towns”).","zh":"mofussil 指印度大城市之外的外省/乡村地区；既可作名词（the mofussil），也可作形容词（mofussil towns）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(India, chiefly historical or formal) the provincial or rural districts outside major cities; the countryside.","zh":"（印度语境，尤指历史或正式用法）大城市以外的外省/乡村地区；“内地”、乡下。"},"examples":[{"en":"After years in Mumbai, he was posted to the mofussil to run a small district office.","zh":"在孟买工作多年后，他被派到 mofussil（外省/内地）去负责一个小县的办事处。"},{"en":"Newspapers in the capital often ignore problems faced in the mofussil.","zh":"首都的报纸常常忽视外省地区面临的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"provincial; rural; outside a major city (often used before a noun).","zh":"外省的；乡镇/乡村的；非大城市的（常作定语放在名词前）。"},"examples":[{"en":"She grew up in a mofussil town before moving to Delhi for college.","zh":"她在一个外省小城长大，后来去德里上大学。"},{"en":"The company is expanding into mofussil markets.","zh":"这家公司正在向外省市场扩张。"}]}],"synonyms":["countryside","the provinces","rural districts","hinterland","outskirts"],"phonetic":"/moʊˈfʌsəl/","extraExplanation":["“mofussil”多见于英印时期及南亚英语（South Asian English）。在英属印度的行政语境里，它常用来对比大城市/省会与“外省地区”（在今日语感里接近“the provinces / the hinterland”）。","这个词有时会带一点“地方、非都市、没那么现代化”的暗示，但并不必然贬义；在不同语境里可能是中性描述，也可能被用来强调城乡差异。","词源一般认为经由印地语/乌尔都语形式进入英语，进一步追溯到阿拉伯语词根，原义与“分开/划分”有关，后来引申为“（主城之外）分区、外省”。"]}
{"word":"mofussilite","summary":{"en":"**mofussilite** (n.) is a historical term for someone who lives in the provincial districts/smaller towns outside the main city centers in (colonial) India.","zh":"**mofussilite**（名词）是历史用语，指（殖民时期）印度主要大城市/行政中心之外的外省地区、小镇或乡间的居民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, India) A person who lives in the **mofussil**—that is, the provincial districts or smaller towns outside the main colonial/administrative city centers.","zh":"（历史用语，印度）住在 **mofussil**（即主要殖民/行政大城市以外的省城、小镇或乡间地区）的人。"},"examples":[{"en":"In old colonial writing, a Calcutta-based official might call himself a “ditcher” and people outside the city “mofussilites.”","zh":"在早期殖民时期的写作里，住在加尔各答城内的官员可能自称“ditcher”，而把城外的人称为“mofussilites”。"},{"en":"He was dismissed as a mere mofussilite—someone from the provinces rather than the metropolis.","zh":"他被贬称为一个“mofussilite”——来自外省而非大都会的人。"}]}],"synonyms":["provincial (person)","country dweller","non-metropolitan resident"],"phonetic":"/moʊˈfʌsəˌliːt/","extraExplanation":["“mofussilite”来自 **mofussil**（英属印度时期常用词），大致指“（主要城市/首府之外的）外省地区、乡间或小城镇”。因此 **mofussilite** 就是“外省人/住在外省地区的人”。","语境上它常见于殖民时期或历史讨论中；在现代语感里可能带一点“非大城市、较不‘都市化’”的对比意味，使用时注意避免贬义。","早期在加尔各答（Calcutta/Kolkata）的语境中，有说法把城内与城外（例如马拉塔壕沟 Maratha Ditch 之外）的人区分开来，城外者被称为 mofussilites。"]}
