{"word":"mog","summary":{"en":"“Mog” is an informal word meaning either “to dominate/defeat easily” (common online/UK slang) or, less commonly, “a cat.”","zh":"“mog”是非正式用语：常指“轻松碾压/完胜”，较少见时也可指“猫”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal, especially British English) to defeat or outperform someone easily; to make someone look weak or inferior by comparison.","zh":"（非正式，尤指英式英语）轻松击败/碾压某人；通过对比让对方显得很弱、很逊。"},"examples":[{"en":"Their team totally mogged us in the second half.","zh":"他们下半场完全把我们碾压了。"},{"en":"She mogged everyone in the class on the final exam.","zh":"期末考试她把全班都甩开了。"},{"en":"He tried to brag, but the results mogged his claims.","zh":"他想吹牛，但结果让他的说法显得很打脸。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a cat (often heard in British English, related to “moggie”).","zh":"（非正式）猫（多见于英式用法，和“moggie”有关）。"},"examples":[{"en":"There’s a friendly mog that hangs around our building.","zh":"我们楼附近有只很亲人的猫常常出没。"},{"en":"That mog is always sleeping in the sun.","zh":"那只猫总爱在太阳底下睡觉。"}]}],"synonyms":["dominate","crush","outclass","beat","show up"],"phonetic":"/mɑɡ/","extraExplanation":["“mog”作动词时是很口语、带点挑衅意味的说法，常见于网络、运动或游戏语境，接近“碾压/吊打/完胜”。正式写作中不建议用。","名词用法表示“猫”相对少见，更常听到的是英式口语“moggie”（杂猫、家猫的随口叫法）。"]}
{"word":"mogador","summary":{"en":"Mogador most commonly means the former name of the Moroccan city Essaouira; in textiles (often lowercase), it can also mean a ribbed fabric used for items like ties.","zh":"Mogador 最常见指摩洛哥城市 Essaouira（索维拉/埃萨维拉）的旧称；在纺织领域（常用小写）也可指一种有棱纹的面料，常用于领带等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) The former European name for the Moroccan Atlantic port city now called **Essaouira**.","zh":"（专有名词）摩洛哥大西洋海岸港口城市 **Essaouira（索维拉/埃萨维拉）** 的旧称（旧欧洲称呼）。"},"examples":[{"en":"We spent two days in Essaouira, which was once known as Mogador.","zh":"我们在索维拉待了两天，这座城市过去也被称为莫加多尔。"},{"en":"The UNESCO site is listed as “Medina of Essaouira (formerly Mogador).”","zh":"联合国教科文组织的遗产名录写作“索维拉麦地那（旧称莫加多尔）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(textiles, usually lowercase) **mogador / mogadore**: a ribbed woven fabric, traditionally with a silk (or rayon) warp and a cotton or linen filling, often used for neckties.","zh":"（纺织；常用小写）**mogador / mogadore（莫加多尔布）**：一种有明显横棱（罗纹感）的机织布料，传统上经线为丝或人造丝、纬线为棉或亚麻，常用于领带等。"},"examples":[{"en":"He chose a mogador tie for the formal dinner.","zh":"他为正式晚宴选了一条莫加多尔布领带。"},{"en":"The shop described the necktie fabric as mogadore.","zh":"店里把这条领带的面料描述为 mogadore（莫加多尔布）。"}]}],"synonyms":["Essaouira","mogadore"],"phonetic":"/ˌmɑɡəˈdɔr/","extraExplanation":["“Mogador”在英语里最常见是地名旧称：指今天的 Essaouira（索维拉）。在旅游、历史、联合国教科文组织（UNESCO）材料中常见“formerly Mogador（旧称莫加多尔）”这种写法。","词源常被解释为与腓尼基语 *Migdol*（意为“小堡垒/小要塞”）有关；也有人把它与当地地名/圣人名的转写联系起来。作为学习者，你可以把它理解为“一个历史旧地名，被欧洲语言长期沿用”。","小写的 *mogador/mogadore* 是纺织品名，属于比较专业的用法；日常对话里不常见，但在男装、领带面料描述中可能会遇到。"]}
{"word":"mogadore","summary":{"en":"Mogadore is usually a place name (a village in Ohio). In some contexts it’s also a variant spelling of mogador (a ribbed fabric) and may be confused with Mogador, the former name of Essaouira in Morocco.","zh":"Mogadore 通常指地名（美国俄亥俄州的一个村庄）。在少数语境中它也可作 mogador 的拼写变体（指一种横纹布料），并且容易与摩洛哥索维拉（Essaouira）的旧称 Mogador 混淆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A village in northeast Ohio, U.S. (in Summit and Portage counties), near Akron.","zh":"（专有名词）美国俄亥俄州东北部的一个村庄（位于萨米特县与波蒂奇县），靠近阿克伦市。"},"examples":[{"en":"I grew up in Mogadore, just outside Akron.","zh":"我在莫加多尔长大，就在阿克伦市旁边。"},{"en":"The event will be held at Mogadore High School this Saturday.","zh":"这场活动将于本周六在莫加多尔高中举行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun, less common) A spelling variant of **mogador**, meaning a ribbed fabric (often used for neckties).","zh":"（名词，较少见）**mogador** 的一种拼写变体：一种有明显横纹的布料（常用于领带等）。"},"examples":[{"en":"The tie is made from mogadore (mogador) fabric with a subtle rib.","zh":"这条领带用的是 mogadore（mogador）面料，带有细微的横纹。"},{"en":"That textured weave is typical of mogador-style cloth.","zh":"那种有纹理的织法很典型，属于 mogador 风格的布料。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun, related spelling) Often confused with **Mogador**, the former name of Essaouira, Morocco.","zh":"（专有名词，相关拼写）常与 **Mogador** 混淆；Mogador 是摩洛哥城市索维拉（Essaouira）的旧称。"},"examples":[{"en":"Older texts may call Essaouira “Mogador.”","zh":"较早的文本里可能会把索维拉称为“莫加多尔（Mogador）”。"},{"en":"Mogadore is in Ohio; Mogador is the older name tied to Morocco.","zh":"Mogadore 在俄亥俄州；Mogador 则是与摩洛哥相关的旧名称。"}]}],"synonyms":["Mogador","Essaouira (for the Morocco place-name sense)"],"phonetic":"/ˌmɑɡəˈdɔr/","extraExplanation":["“Mogadore”在英语里最常见是美国俄亥俄州的地名；而在词典中更常见的形式是“mogador / Mogador”。","俄亥俄州的 Mogadore 这个名字据说与摩洛哥的 Mogador（今 Essaouira）有关，因此容易出现 Mogadore / Mogador 的拼写混用或误认。","如果你是在阅读布料/服饰语境（如领带、纹理织物），通常你要找的是“mogador（织物）”；如果是地理/旅行语境，则要看是“Ohio 的 Mogadore”还是“Morocco 的 Mogador/Essaouira”。"]}
{"word":"mogdad","summary":{"en":"**mogdad** is rare in modern English; it’s mainly found in the old term **mogdad coffee** (coffee senna). It can also appear as a personal name.","zh":"**mogdad** 在现代英语中较少见；主要见于旧称 **mogdad coffee**（指 coffee senna/番泻）。它也可能用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in the phrase **mogdad coffee**) an old term for **coffee senna** (a senna plant product sometimes used as a laxative).","zh":"（多用于短语 **mogdad coffee**）一个较旧的说法，指 **coffee senna（咖啡番泻/番泻）**，一种有时用作泻药的番泻类植物制品。"},"examples":[{"en":"In older herbal guides, *mogdad coffee* is listed as a type of senna.","zh":"在一些较旧的草药指南里，*mogdad coffee* 被列为一种番泻。"},{"en":"The recipe warned that mogdad coffee could be too strong for some people.","zh":"配方提醒说，mogdad coffee 对某些人来说可能太刺激。"}]},{"partOfSpeech":"other","definition":{"en":"A personal name (seen as a spelling variant in some communities).","zh":"人名（在一些社群中可见的拼写变体）。"},"examples":[{"en":"Mogdad is used as a given name in some Arabic-speaking communities.","zh":"Mogdad 在一些阿拉伯语社群中被用作名字。"}]}],"synonyms":["coffee senna","senna","mogdad coffee","Miqdad (name variant)"],"phonetic":"/ˈmɑɡˌdæd/","extraExplanation":["“mogdad”單獨出現時，最常見是出現在固定搭配 **mogdad coffee**（較古舊/詞典用法），而不是現代日常英文常用詞。","詞源說法之一是它來自西非塞內加爾的某個本地名稱，因此它帶有地域與歷史色彩，現代英文中並不常見。","如果你其實想查的是 **Mogadishu（摩加迪沙）**、**Mughal/Mogul**、或網路俚語 **mog/mogging**，把你看到的完整句子貼出來，我可以幫你判斷是哪一個。"]}
{"word":"moggan","summary":{"en":"“moggan” is a Scottish word meaning a stocking—especially a long stocking leg without a foot, worn like a legging or gaiter.","zh":"“moggan”是苏格兰用词，指长袜；尤指没有脚部的袜腿，可像护腿/绑腿一样保暖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish) a stocking; especially the leg part of a long stocking without a foot (like a knitted legging/gaiter).","zh":"（苏格兰用语）长袜；尤指没有“脚部”的长袜腿（像针织护腿/绑腿）。"},"examples":[{"en":"He pulled on thick wool moggans to keep his calves warm on the moor.","zh":"他穿上厚羊毛的moggan来保暖小腿，在荒原上行走更不怕冷。"},{"en":"In older rural Scots clothing, a moggan could be worn like a gaiter over the lower leg.","zh":"在较早期的苏格兰乡村穿着里，moggan可以像绑腿一样套在小腿外。"}]}],"synonyms":["stocking","legging","gaiter"],"phonetic":"/ˈmɑɡən/","extraExplanation":["“moggan”主要见于苏格兰英语/苏格兰方言语境，指袜子或“袜筒（袜腿）”，尤其是没有脚掌那一段，功能上接近“护腿/绑腿（gaiter）”。","容易和网络俚语“mog / mogging（压过别人、比别人更帅更强）”混淆；那是另一个词根与用法，和这里的衣物名词“moggan”无关。"]}
{"word":"mogged","summary":{"en":"“Mogged” is internet slang meaning you were outshone or dominated—often by someone’s looks or presence, sometimes by skill or status.","zh":"“mogged”是网络俚语，指被别人比下去/压过风头——常指外貌或气场，有时也指能力或地位上的碾压。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slang (often online): outshone or dominated—especially in physical appearance (e.g., height, face, muscles) or social status—so that you look worse by comparison.","zh":"俚语（多见于网络）：被（他人）比下去、碾压——尤其指外貌（身高、颜值、身材等）或社会地位上的对比，让你显得更逊。"},"examples":[{"en":"He walked in and I felt totally mogged by his height and style.","zh":"他一走进来，我就觉得被他的身高和穿搭彻底比下去了。"},{"en":"Posting that selfie next to a model is basically asking to get mogged.","zh":"把那张自拍和模特放在一起发，基本就是在自找被碾压。"}]},{"partOfSpeech":"adj.","definition":{"en":"Slang: defeated, embarrassed, or made to look inferior in a situation (not only about looks).","zh":"俚语：在某个场合被压制、被打脸或显得不如人（不一定只指外貌）。"},"examples":[{"en":"I tried to argue, but she had the facts—I got mogged.","zh":"我想反驳，但她证据很足——我直接被打脸了。"},{"en":"Our team got mogged in the second half.","zh":"我们队下半场被彻底压着打。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of the slang verb “mog”: to outshine or dominate someone (often by looks or presence).","zh":"俚语动词“mog”的过去式/过去分词：把某人比下去、在气场/外貌等方面压过对方。"},"examples":[{"en":"He mogged everyone in the photo without even trying.","zh":"他在照片里不费力就把所有人都比下去了。"},{"en":"She mogged me at the interview—her answers were so sharp.","zh":"面试时她把我比下去了——她的回答太犀利了。"}]}],"synonyms":["outshone","overshadowed","outclassed","shown up","dominated"],"phonetic":"/mɑːɡd/","extraExplanation":["“mog / mogged”是强烈的网络口语，常见于外貌比较、健身、约会与社交地位讨论中，语气通常带夸张和嘲讽色彩。","这个词在某些圈子（如“looksmax”等外貌焦虑相关社群）里更常出现，可能会强化对外貌的过度评价；在正式场合或不熟的人面前使用，容易显得冒犯或不成熟。","更中性/礼貌的替代表达：outshone（被比下去）、overshadowed（被盖过风头）、outclassed（被碾压）、they looked more confident（对方更自信/更有气场）。"]}
{"word":"moggies","summary":{"en":"“Moggies” means ordinary (usually mixed-breed) pet cats, mainly in informal British English.","zh":"“moggies”指普通的（通常是混种的）家猫，主要用于英式英语的非正式表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cats—especially ordinary, non-pedigree (mixed-breed) pet cats (informal, chiefly British).","zh":"猫；尤指普通的、非纯种（混种）的家猫（非正式用语，主要见于英式英语）。"},"examples":[{"en":"She grew up with two moggies that loved sleeping on the sofa.","zh":"她从小家里养了两只普通家猫，特别爱在沙发上睡觉。"},{"en":"The shelter is full of friendly moggies looking for a home.","zh":"收容所里有很多亲人的普通家猫在等一个家。"}]}],"synonyms":["cats","house cats","mixed-breed cats","domestic cats"],"phonetic":"/ˈmɑɡiz/","extraExplanation":["“moggies”是“moggy”的复数形式，多用于英式口语里，常带一点亲昵、随意的语气，强调“不是名贵纯种猫”。在美式英语中更常说“cats”“mixed-breed cats”或“domestic shorthair/longhair（家猫短毛/长毛）”。"]}
{"word":"mogging","summary":{"en":"Mogging means outshining or dominating someone—especially in looks—so they seem worse by comparison.","zh":"Mogging 指在外貌等方面碾压别人，让对方在对比下显得更差。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(slang, internet) To outshine or dominate someone—especially in appearance (height, face, physique, style)—so they look worse by comparison; to “show them up.”","zh":"（网络俚语）在外貌（身高、脸、身材、穿搭等）上压过/碾压别人，让对方在对比下显得更差；相当于“把人比下去/让人相形见绌”。"},"examples":[{"en":"He’s mogging everyone in the photo—he’s a head taller than the rest.","zh":"他在照片里把所有人都“mog”了——比别人高出一大截。"},{"en":"She wore a formal gown to a casual party and ended up mogging the host.","zh":"她穿着礼服去参加休闲聚会，结果把主人都比下去了。"},{"en":"Don’t try to mog your friends; it comes off as insecure.","zh":"别想着去“mog”朋友，那样看起来很没安全感。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of outshining/dominating someone (often used as a noun: “the mogging”).","zh":"（常作名词）指“碾压式的对比/把人比下去”这一行为。"},"examples":[{"en":"The mogging in that group selfie is wild.","zh":"那张合照里的“mogging”太夸张了。"}]}],"synonyms":["outshine","show up","dwarf (someone)","make (someone) look bad by comparison","one-up (someone)"],"phonetic":"/ˈmɑɡɪŋ/","extraExplanation":["“mogging”通常带有调侃甚至有点刻薄的语气，常见于外貌比较的语境（如身高、下颌线、肩宽、穿搭）。在更友好的场合，人们会用更中性的说法，比如 “outshine” 或 “make someone look bad by comparison”。","词源上多被认为来自网络俚语 “mog”（常被解释为 “alpha male of the group / AMOG” 圈子里的用法），后来在健身、穿搭与“looksmaxxing（外貌提升）”相关社区里更流行，逐渐泛化为“在外形上压过别人”。","用法提示：常见结构是 “mog someone” 或 “be mogging everyone”。因为语气可能冒犯，现实交流中对不熟的人慎用。"]}
{"word":"moggio","summary":{"en":"Moggio is mainly an Italian word meaning a historical measure (especially for grain) and, in some contexts, a historical land measure; it can also be a place name or surname.","zh":"Moggio 主要是意大利语词，指旧时的容量单位（多用于粮食），有时也指旧时的农地面积单位；另外也可作地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical Italian unit of measure for dry goods (especially grain), with the exact amount varying by region (often compared to a “bushel”).","zh":"（意大利）旧时用于量取谷物等干货的容量单位；各地数值不同（常类比为“蒲式耳”bushel）。"},"examples":[{"en":"In old records, wheat was sold by the moggio rather than by kilograms.","zh":"在旧文献里，小麦常按 moggio 来卖，而不是按公斤计。"},{"en":"Because each city had its own standard, a moggio in one place could differ from a moggio elsewhere.","zh":"由于各城标准不同，一个地方的 moggio 可能和另一个地方的 moggio 不一样。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical agricultural land measure in Italy, sometimes understood as the amount of land that could be sown with one moggio of grain (values varied by area).","zh":"（意大利）旧时的农地面积单位；有时指“能播下一 moggio 谷物的土地面积”（各地不同）。"},"examples":[{"en":"The contract described a field of two moggi of land.","zh":"契约里写着那块田地有两 moggi。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for places and people (e.g., Moggio is the name of a municipality in Lombardy, Italy; Moggio also appears as a surname).","zh":"专有名词：用于地名或人名（例如 Moggio 是意大利伦巴第大区的一个市镇名；也可作姓氏）。"},"examples":[{"en":"They spent the summer in Moggio, a small town in northern Italy.","zh":"他们在意大利北部的小镇 Moggio 度过了夏天。"},{"en":"Moggio is also seen as a family name in some contexts.","zh":"在某些语境中，Moggio 也会作为姓氏出现。"}]}],"synonyms":["bushel","modius"],"phonetic":"/ˈmɔdʒoʊ/","extraExplanation":["“moggio”是意大利语词，和拉丁语“modius”（古罗马的容量单位）有关，因此常被解释为“旧时量粮食的单位”。","它还出现在《圣经》相关的固定表达里：意大利语常说“mettere la fiaccola/la lucerna sotto il moggio”，对应英语习语“hide one’s light under a bushel”（把才能/优点藏起来不让人知道）。"]}
{"word":"moggy","summary":{"en":"“Moggy” is British informal English for an ordinary pet cat (often not a pedigree).","zh":"“moggy”是英式口语，指普通的家猫（常指非纯种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British English, informal) A cat, especially an ordinary (non-pedigree) pet cat.","zh":"（英式英语，非正式）猫；尤指普通的（非纯种的）家猫。"},"examples":[{"en":"She rescued a little moggy from the shelter.","zh":"她从收容所救了一只小猫。"},{"en":"Our moggy sleeps on the sofa all day.","zh":"我们家的猫整天都在沙发上睡觉。"}]}],"synonyms":["cat","kitty","house cat","mutt cat (informal)"],"phonetic":"ˈmɑɡi","extraExplanation":["“moggy”主要是英式口语，在美国不太常用；在美式英语里更常说 cat / kitty / domestic shorthair（偏正式）。","语气通常是亲切、随意的，有时也带一点调侃，指“不是名贵品种、很普通但很可爱”的猫。","词源不太确定；现代用法里常与“pedigree（纯种猫）”形成对比。"]}
{"word":"moghan","summary":{"en":"Moghan is usually a place name—especially the Moghan (Mughan) Plain in northwestern Iran—and it can also be the name of several Iranian villages or a surname tied to that region.","zh":"Moghan 通常是地名（尤其指伊朗西北部的莫甘/穆甘平原），也可能是伊朗多个村庄的名称，或源自该地区的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), most commonly referring to the Moghan/Mughan Plain—a fertile lowland region in northwestern Iran near the Aras River and the border area with the South Caucasus.","zh":"专有名词（地名），最常指伊朗西北部的“莫甘/穆甘平原”（Moghan/Mughan Plain）——靠近阿拉斯河、邻近南高加索边境的一片肥沃低地。"},"examples":[{"en":"The Moghan Plain is known for farming and grazing.","zh":"莫甘平原以农业种植和放牧闻名。"},{"en":"They traveled through Moghan on their way toward Ardabil Province.","zh":"他们在前往阿尔达比勒省的路上经过了莫甘地区。"}]},{"partOfSpeech":"n.","definition":{"en":"a village name in Iran (there are multiple places officially romanized as Moghan in different provinces).","zh":"伊朗的村庄地名（伊朗不同省份中有多个地点的英文转写为 Moghan）。"},"examples":[{"en":"Moghan is the name of several villages in Iran, so you may need the province to be specific.","zh":"Moghan 也是伊朗多个村庄的名字，所以通常需要加上省份才能指得更清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or identity label derived from the place name (meaning someone is from the Moghan/Mughan region).","zh":"由地名演变而来的姓氏或身份标记（表示此人来自莫甘/穆甘地区）。"},"examples":[{"en":"In some contexts, Moghan can function like a toponym-based family name.","zh":"在某些语境里，Moghan 可以作为“地名来源的姓氏”来使用。"}]}],"synonyms":["Mughan","Mughān","Muğan"],"phonetic":"/ˈmoʊɡɑːn/","extraExplanation":["“Moghan”常见于英文对波斯语/阿塞拜疆语地名的转写；你也可能看到拼写变体：Mughan、Mughān、Muğan。不同地图或资料采用的转写系统不同，所以拼法会变。","英文里读法常按拼写读作 /ˈmoʊɡɑːn/（重音在前），但如果你指的是某个具体人名/姓氏或当地读音，实际读法可能会不一样。","如果你告诉我你看到“moghan”的上下文（例如：地图、姓氏、文章标题、还是一段句子），我可以帮你锁定最准确的含义与用法。"]}
{"word":"moghul","summary":{"en":"Moghul (more commonly spelled mogul) means a powerful, influential person (a “big boss”), and it can also refer to the Mughal Empire and its culture (often capitalized in that historical sense).","zh":"moghul（更常见拼写为 mogul）可指有权势、有影响力的人（大亨），也可指莫卧儿帝国及其文化（历史义常大写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very powerful or influential person, especially in business or the media/entertainment industry","zh":"（尤指商界或媒体/娱乐业中）有权势、有影响力的人；大亨"},"examples":[{"en":"She became a real tech moghul after her company went global.","zh":"她的公司走向全球后，成了真正的科技大亨。"},{"en":"A media moghul bought several newspapers and a TV network.","zh":"一位媒体大亨收购了几家报纸和一家电视网。"}]},{"partOfSpeech":"adj.","definition":{"en":"a Mughal: relating to the Muslim dynasty that ruled much of the Indian subcontinent (16th–19th centuries); also a person from that empire (often capitalized in this meaning)","zh":"莫卧儿（王朝/帝国）的：指16—19世纪统治印度次大陆大部分地区的穆斯林王朝；也可指莫卧儿人（此义常需大写）"},"examples":[{"en":"The museum displayed Moghul-era miniature paintings.","zh":"博物馆展出了莫卧儿时期的细密画。"},{"en":"They studied Moghul architecture, including grand forts and tombs.","zh":"他们研究莫卧儿建筑，包括宏伟的堡垒与陵墓。"}]}],"synonyms":["tycoon","magnate","power broker","bigwig","kingpin"],"phonetic":"/ˈmoʊɡəl/","extraExplanation":["“moghul”是“mogul”的较少见拼写变体；在现代英语里更常用“mogul”表示“（商界/媒体）大亨”。","这个词最早与“莫卧儿（Mughal）帝国”有关，因此当表示历史上的王朝/文化时，英语里常写作“Mughal”或“(the) Mughals”，且通常要大写；表示“某行业大亨”时一般不大写（a mogul）。"]}
{"word":"mogigraphia","summary":{"en":"Mogigraphia is a rare term meaning writer’s cramp or cramped, painful/difficult writing.","zh":"mogigraphia 是个较罕见的词，指“书写痉挛（写字手）”，也可指因痉挛导致的拘紧、吃力的字迹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, rare) Writer’s cramp: painful or difficult writing caused by hand/forearm muscle spasms or fatigue.","zh":"（医学，较罕见）书写痉挛／写字手：因手部或前臂肌肉痉挛、疲劳等导致写字疼痛或困难。"},"examples":[{"en":"After hours of note-taking, she developed mogigraphia and had to stop writing.","zh":"连续记了好几个小时的笔记后，她出现了书写痉挛，只好停下来。"},{"en":"The clinician suspected mogigraphia because the pain appeared only during writing.","zh":"临床医生怀疑是书写痉挛，因为疼痛只在写字时出现。"}]},{"partOfSpeech":"n.","definition":{"en":"Cramped, strained, or difficult handwriting (writing that looks tight or forced, often because the hand is cramping).","zh":"（引申）拘紧、吃力的字迹：写出来的字显得紧绷、勉强，常与手部抽筋或紧张有关。"},"examples":[{"en":"His signature became mogigraphia—small, tense strokes that were hard to read.","zh":"他的签名变得很“拘紧吃力”，笔画又小又紧，难以辨认。"},{"en":"She switched to typing to avoid mogigraphia during long exams.","zh":"她改用打字来避免在长时间考试中出现“写字手/字迹拘紧”。"}]}],"synonyms":["writer’s cramp","graphospasm"],"phonetic":"ˌmoʊdʒɪˈɡræfiə","extraExplanation":["这个词非常少见，主要出现在医学或较“书卷气”的词汇列表里，日常更常说 writer’s cramp 或 hand cramp。","词源可拆成希腊语 mogis（“费力地、困难地”）+ -graphia（“书写”）。","相关词对比：dysgraphia 更偏“书写能力障碍/书写困难”的统称；micrographia 指“字越写越小”（常见于某些神经系统疾病）；graphospasm 是 mogigraphia 的同义词，强调“痉挛/抽搐”。"]}
{"word":"mogigraphic","summary":{"en":"“mogigraphic” isn’t a standard word; it’s usually a misspelling (often of “micrographic”), or a very rare specialist form related to “mogigraphia” (writer’s cramp).","zh":"“mogigraphic”不是标准词汇；多半是拼写错误（常见为“micrographic”），或在极少见的专业语境中与“mogigraphia（书写痉挛）”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard / likely a misspelling. “mogigraphic” is not a common or well‑recognized English word in major dictionaries. People who write this often mean a different word (see below).","zh":"非标准/很可能是拼写错误。“mogigraphic”并不是主流词典中常见或公认的英语单词，通常是想写别的词（见下）。"},"examples":[{"en":"I couldn’t find “mogigraphic” in a standard dictionary—did you mean “micrographic” or something else?","zh":"我在常见词典里找不到“mogigraphic”——你是不是想写“micrographic”或其他词？"}]},{"partOfSpeech":"adj.","definition":{"en":"(Most likely intended) **micrographic** (adj.): relating to micrography, or to images made with a microscope (micrographs).","zh":"（最可能想表达）**micrographic**（形）：与显微摄影有关的；或与通过显微镜获得的图像（显微照片）有关的。"},"examples":[{"en":"The report included micrographic images of the tissue sample.","zh":"报告中包含了该组织样本的显微照片。"},{"en":"Micrographic analysis helped confirm the material’s structure.","zh":"显微图像分析帮助确认了材料的结构。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare medical term, related form) **mogigraphia** (n.): a rare name for writer’s cramp (hand cramp or difficulty writing due to muscle spasms). If you saw “mogigraphic,” it might have been an adjective made from this term in a specialized context.","zh":"（罕见医学术语，相关形式）**mogigraphia**（名）：“写字痉挛/书写痉挛”（写字时手部肌肉不自主痉挛导致疼痛或难以书写）的罕见叫法。若你见到“mogigraphic”，可能是在非常专业的语境中由该词派生出的形容词。"},"examples":[{"en":"He was evaluated for mogigraphia after developing pain and spasms while writing.","zh":"他因写字时出现疼痛与痉挛而接受“书写痉挛（mogigraphia）”相关评估。"}]}],"synonyms":["micrographic","microscopic","micrography-related"],"phonetic":"/ˌmoʊdʒɪˈɡræfɪk/","extraExplanation":["“mogigraphic”本身不常见：如果你是在阅读论文/医学资料时遇到它，很可能是（1）拼写误差，（2）非常小众的派生形容词。","最实用的做法：回到原句或原文截图给我，我可以根据上下文判断你到底需要的是“micrographic（显微的/显微摄影的）”、还是与“mogigraphia（书写痉挛）”相关的医学表达。"]}
{"word":"mogigraphy","summary":{"en":"Mogigraphy is a rare word meaning “writer’s cramp,” pain or cramping in the hand from writing a lot.","zh":"mogigraphy是个很少见的词，意思是“书写痉挛/写字手抽筋”，指因长时间书写导致的手部疼痛或痉挛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Writer’s cramp; physical difficulty or cramping when writing (especially from prolonged handwriting or repetitive hand use).","zh":"书写痉挛；写字时手部因疲劳或重复动作而出现的痉挛/不适（常见于长时间手写）。"},"examples":[{"en":"After pages of copying notes by hand, she developed mogigraphy and had to rest her fingers.","zh":"手抄了好几页笔记后，她出现了mogigraphy（书写痉挛），只好让手指休息。"},{"en":"The doctor said his pain looked like mogigraphy rather than an injury from sports.","zh":"医生说他的疼痛更像是mogigraphy（书写痉挛），而不是运动造成的外伤。"}]}],"synonyms":["writer’s cramp","mogigraphia","graphospasm"],"phonetic":"ˌmɑː.dʒəˈɡræf.i","extraExplanation":["“mogigraphy”非常罕见，更常见的拼写是 **mogigraphia**，意思基本相同；日常英语里通常直接说 **writer’s cramp**。","词源来自希腊语词根 **mogis**（“艰难地/费力地”）+ **-graph-**（“书写”相关），所以字面感觉就是“费力书写导致的问题”。"]}
{"word":"mogilalia","summary":{"en":"Mogilalia is a rare medical term for difficulty or hesitancy in speaking (often like stuttering).","zh":"mogilalia 是一个少见的医学术语，指说话困难或迟疑不流利（常类似口吃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical/psychology) A speech disorder in which speaking is difficult, hesitant, or disrupted—especially stuttering or stammering; a type of speech disfluency. ([dictionary.com](https://www.dictionary.com/browse/mogilalia?utm_source=openai))","zh":"（医学/心理）一种言语障碍，说话时出现困难、犹豫或不连贯，尤指口吃/结巴等言语不流利现象。 ([dictionary.com](https://www.dictionary.com/browse/mogilalia?utm_source=openai))"},"examples":[{"en":"After the accident, he experienced mogilalia and needed speech therapy to speak more smoothly.","zh":"事故之后，他出现了说话困难（mogilalia），需要通过语言治疗来改善流利度。"},{"en":"The clinician noted mogilalia (stuttering-like hesitations) during the assessment.","zh":"临床评估时，医生记录到他有类似口吃的迟疑现象（mogilalia）。"}]},{"partOfSpeech":"n.","definition":{"en":"Difficulty pronouncing certain letters or syllables (a narrow/older descriptive use). ([en.wiktionary.org](https://en.wiktionary.org/wiki/mogilalia?utm_source=openai))","zh":"（较狭义/偏旧的描述用法）难以发准某些字母音或音节。 ([en.wiktionary.org](https://en.wiktionary.org/wiki/mogilalia?utm_source=openai))"},"examples":[{"en":"In older descriptions of speech problems, mogilalia could refer to trouble with particular sounds.","zh":"在较早的言语问题描述中，mogilalia 有时指对某些特定语音的发音困难。"},{"en":"The child’s mogilalia made “r” and “l” sounds hard to produce clearly.","zh":"孩子的发音困难（mogilalia）让他很难把“r”和“l”发清楚。"}]}],"synonyms":["stuttering","stammering","speech disfluency","speech impediment","molilalia"],"phonetic":"/ˌmɑdʒəˈleɪliə/","extraExplanation":["这是一个非常少见、偏医学/心理学文献的词，日常英语里更常用 stuttering（口吃）、speech disfluency（言语不流利）、speech impediment（言语障碍）等更直观的表达。 ([dictionary.com](https://www.dictionary.com/browse/mogilalia?utm_source=openai))","词源来自希腊语：mogi- 表示“困难地/费力地”，-lalia 表示“言语/说话”。 ([dictionary.com](https://www.dictionary.com/browse/mogilalia?utm_source=openai))","你可能会看到同义词 molilalia（更少见的变体/别称）。 ([dictionary.psychologydb.com](https://dictionary.psychologydb.com/index.php/mogilalia?utm_source=openai))"]}
{"word":"mogilalism","summary":{"en":"Mogilalism is a rare, dated term for difficulty or hesitancy in speaking (speech disfluency).","zh":"Mogilalism 是一个罕见且偏旧的词，指说话困难、迟疑或不流畅等言语不流畅现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/dated) A speech disorder involving difficulty, hesitancy, or impaired fluency in speaking (for example, stuttering or severe disfluency).","zh":"（罕见/旧用）指说话时出现困难、迟疑或不流畅的言语障碍（如口吃等言语不流畅）。"},"examples":[{"en":"The clinician noted signs consistent with mogilalism (severe hesitancy in speech).","zh":"临床记录指出该来访者表现出符合 mogilalism（严重言语迟疑）的特征。"},{"en":"In older texts, mogilalism may appear as a label for speech disfluency.","zh":"在较早的文献中，mogilalism 有时被用来指称言语不流畅。"}]}],"synonyms":["mogilalia","speech disfluency","stuttering","stammering"],"phonetic":"/ˌmoʊdʒəˈleɪlɪzəm/","extraExplanation":["“mogilalism”在现代英语里非常少见，常被认为是“mogilalia”的罕见变体/替代写法；在较新的语境里通常会改用更常见、更具体的术语（如 stuttering、speech disfluency 等）。","词源上与希腊语表示“困难地”之意的词根（mogi-）和“说话/言语”相关成分（-lalia）有关，因此整体含义与“说话困难”相连。","如果你是在作业/文章里遇到它，通常可以用更常见的 mogilalia 或直接写 speech disfluency，并在括号里说明这是旧术语，以便读者理解。"]}
{"word":"mogiphonia","summary":{"en":"Mogiphonia is a rare medical term for difficulty producing a loud/strong voice, especially after overusing the voice (e.g., singing or public speaking).","zh":"Mogiphonia 是一个较少见的医学词，指在用嗓过度后（如唱歌、演讲）难以发出响亮有力的声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) Difficulty producing a strong/loud voice (especially when singing or public speaking), often due to vocal fatigue or spasms in the larynx (voice box). Normal quiet speech may be less affected.","zh":"（医学用语，较少见）在唱歌或公开演讲等需要大声发声时，难以发出有力/响亮的声音，常与声带疲劳或喉部（发声器官）痉挛有关；日常较轻声的讲话可能影响较小。"},"examples":[{"en":"After several speeches in one day, the teacher developed mogiphonia and could no longer project her voice.","zh":"一天连讲了好几场后，那位老师出现了 mogiphonia（发声困难），再也无法把声音“推出去”。"},{"en":"The singer’s mogiphonia worsened during rehearsals, even though her quiet speaking voice sounded almost normal.","zh":"那位歌手在排练时 mogiphonia 加重，虽然她小声说话时听起来几乎正常。"}]}],"synonyms":["voice strain","vocal fatigue","laryngeal spasm (in some contexts)","difficulty projecting the voice"],"phonetic":"/ˌmoʊ.dʒəˈfoʊ.ni.ə/","extraExplanation":["这个词在现代英语里非常少见，更多见于旧一些的医学/病理学词汇表。日常表达里，人们更常说“voice strain（用嗓过度）”“vocal fatigue（发声疲劳）”或直接描述“说大声/唱高声时发不出来”。","词源来自希腊语：mogis（“费力地/困难地”）+ -phonia（“声音”）。它与 mogigraphia（写字痉挛，writer’s cramp）这类用“-mogi-”表示“困难/费力”的构词方式同源。","历史上它也曾被用来描述一种逐渐发展的发声障碍，并与后来更常提到的“spasmodic dysphonia（痉挛性发声障碍）”等概念有交叉；但在当代临床语境中，是否使用该词以及具体诊断边界可能因来源而异。"]}
{"word":"mogitocia","summary":{"en":"Mogitocia is a rare medical word meaning difficult childbirth (dystocia).","zh":"Mogitocia 是一个罕见的医学词，意思是“难产”（dystocia）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, medical) difficult childbirth; labor that is hard or obstructed (similar to **dystocia**).","zh":"（罕见，医学）难产；分娩过程困难或受阻（类似 **dystocia**“难产”）。"},"examples":[{"en":"The report described **mogitocia** caused by a mismatch between the baby’s size and the mother’s pelvis.","zh":"报告描述了因胎儿大小与产妇骨盆不匹配而导致的**难产（mogitocia）**。"},{"en":"In modern clinical writing, doctors usually say **dystocia** rather than **mogitocia**.","zh":"在现代临床写作中，医生通常用 **dystocia**，而不是 **mogitocia**。"}]}],"synonyms":["dystocia","difficult labor","obstructed labor","difficult parturition"],"phonetic":"/ˌmoʊdʒɪˈtoʊʃiə/","extraExplanation":["你输入的 **“mogitocia”** 很可能是在指 **mogitocia**（一个非常少见的医学术语）。它来自希腊语词根：**mogi-**（“困难地、费力地”）+ 与“分娩/生产”相关的词根（与 *tokos* “birth”同源）+ **-ia**（名词后缀）。","在当代英语里，这个词几乎不常用；更常见、更标准的说法是 **dystocia**（难产）或 **obstructed labor**（梗阻性/受阻分娩）。如果你是在医学教材或旧文献里看到它，这种“偏旧/偏术语化”的风格比较常见。"]}
{"word":"mogo","summary":{"en":"“mogo” most commonly means an Australian stone hatchet (a small axe with a stone head). It can also be a proper name (e.g., in comics or brand names).","zh":"“mogo”最常见的意思是（澳大利亚语境中的）“石斧/石制斧头”。它也可能是专有名词（如漫画角色名或品牌名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly Australia) a stone hatchet; a small axe with a stone head.","zh":"（主要用于澳大利亚英语）石斧；石制斧头（斧刃为石头制成的小斧）。"},"examples":[{"en":"Archaeologists found a mogo near the riverbank.","zh":"考古学家在河岸附近发现了一把石斧。"},{"en":"The museum display included a mogo and other traditional tools.","zh":"博物馆展柜里陈列着一把石斧和其他传统工具。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name used for several modern entities (for example, a DC Comics character and various organizations/brands).","zh":"专有名词：用于若干现代名称（例如 DC 漫画角色名，以及一些机构/品牌名）。"},"examples":[{"en":"In Green Lantern stories, Mogo is a living planet.","zh":"在《绿灯侠》的故事里，Mogo 是一颗“活着的行星”。"},{"en":"I saw MoGo bikes downtown in Detroit.","zh":"我在底特律市中心看到过 MoGo 的共享单车。"}]}],"synonyms":["stone hatchet","stone axe","hatchet","axe"],"phonetic":"/ˈmoʊɡoʊ/","extraExplanation":["“mogo”作为普通词（小写）在词典里最常见的释义是澳大利亚语境中的“石斧/石制斧头”，词源来自澳大利亚新南威尔士州的原住民语言记录；英文词典也给出其最早用例可追溯到 1798 年。([merriam-webster.com](https://www.merriam-webster.com/dictionary/mogo?utm_source=openai))","你可能也见过大写的 **Mogo/MoGo**：例如 DC 漫画《绿灯侠》里有角色 **Mogo the Living Planet**（“活体行星 Mogo”）。([en.wikipedia.org](https://en.wikipedia.org/wiki/Mogo?utm_source=openai))","另外，**MoGo** 还是美国密歇根州底特律的公共自行车共享系统名称；而 **Mogo Inc.** 则是一家加拿大金融科技公司名称。([en.wikipedia.org](https://en.wikipedia.org/wiki/MoGo?utm_source=openai))","如果你是从聊天、游戏、App 或公司名里看到“mogo”，更可能是专名/品牌而不是“石斧”的意思；你可以告诉我你在哪里看到它（句子或截图），我可以帮你判断具体指哪一个。"]}
{"word":"mogographia","summary":{"en":"Mogigraphia (often misspelled as “mogographia”) is a rare word meaning writer’s cramp—hand/wrist pain or cramping from prolonged handwriting.","zh":"Mogigraphia（常被误拼为“mogographia”）是个很罕见的词，意思是“书写痉挛/写字手”——长时间手写引起的手部或手腕疼痛、抽筋或痉挛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Writer’s cramp: pain, cramping, or spasm in the hand/wrist from prolonged handwriting.","zh":"书写痉挛（写字手）：因长时间手写而导致的手部/手腕疼痛、抽筋或痉挛。"},"examples":[{"en":"After filling out forms for two hours, I started to feel mogigraphia in my right hand.","zh":"连续填表两小时后，我右手开始出现书写痉挛。"},{"en":"He switched to typing because mogigraphia made long handwriting sessions painful.","zh":"他改用打字，因为书写痉挛让长时间手写很痛。"}]}],"synonyms":["writer’s cramp","graphospasm"],"phonetic":"/ˌmoʊdʒəˈɡræfiə/","extraExplanation":["你输入的 **mogographia** 很可能是拼写误差；常见（但非常罕用）的词是 **mogigraphia**，意思是“写字写到手抽筋/疼痛”（writer’s cramp）。","这个词多见于较旧或专业（医学/词汇学）语境；现代更常说 **writer’s cramp**，或提到与手腕相关的疼痛时说 **RSI**（重复性劳损）或 **carpal tunnel syndrome**（腕管综合征），但它们不完全等同。","词源上，mogi- 来自古希腊语，含“费力、困难”的意思，-graphia 与“书写”有关，所以整体就是“费力书写导致的问题”。"]}
{"word":"mogollon","summary":{"en":"Mogollon usually refers to a prehistoric Southwestern culture (and related artifacts), and it also appears in U.S. place names like the Mogollon Rim.","zh":"Mogollon通常指美国西南部的史前“莫戈永文化”（及其相关遗物），也常用于地名，如莫戈永边缘（Mogollon Rim）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prehistoric Indigenous culture of the U.S. Southwest (especially parts of present-day New Mexico and Arizona), known for distinctive pottery and settled village life (c. 200–1400 CE).","zh":"（通常大写）美国西南部的史前原住民文化之一（主要在今新墨西哥州、亚利桑那州一带），以特色陶器与定居村落生活闻名（约公元200—1400年）。"},"examples":[{"en":"Archaeologists studied Mogollon pottery styles to understand trade and daily life.","zh":"考古学家研究莫戈永文化的陶器风格，以了解贸易与日常生活。"},{"en":"The museum has a section on Mogollon and other Southwestern cultures.","zh":"这家博物馆设有莫戈永文化及其他西南文化的展区。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mogollon culture or its artifacts.","zh":"（通常大写）与莫戈永文化或其遗物有关的。"},"examples":[{"en":"They found Mogollon-era houses built with stone and adobe.","zh":"他们发现了莫戈永时期用石头和土坯建造的房屋。"},{"en":"The exhibit features Mogollon ceramics and tools.","zh":"展览展出了莫戈永陶器与工具。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in U.S. geography, especially for places like the Mogollon Rim (Arizona) or the Mogollon Mountains (New Mexico).","zh":"（通常大写）美国地理名称用法，常见于莫戈永边缘（亚利桑那州）或莫戈永山脉（新墨西哥州）等地名中。"},"examples":[{"en":"We drove along the Mogollon Rim to see the forests and cliffs.","zh":"我们沿着莫戈永边缘行驶，欣赏森林与峭壁。"}]}],"synonyms":["Mogollon culture","Southwestern prehistoric culture (general)"],"phonetic":"ˌmoʊɡəˈjoʊn","extraExplanation":["“Mogollon”在英语里通常读作“moh-guh-YOHN”，多见于考古与美国西南地区地理语境，通常首字母大写。","这个名称来自西班牙语姓氏“Mogollón”，常被认为与西班牙殖民时期官员的姓有关；因此它并不是某个单一部族的自称，而是后来的学术分类与地名用语。","学习提示：在博物馆、国家公园介绍牌或历史读物中，你可能会看到“Mogollon culture（莫戈永文化）”“Mogollon Rim（莫戈永边缘）”这类固定搭配。"]}
{"word":"mogos","summary":{"en":"Mogos is the plural of mogo, meaning traditional Aboriginal Australian stone hatchets (stone axes).","zh":"Mogos 是 mogo 的复数，指澳大利亚原住民传统使用的石斧（石制斧头）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mogo**: stone hatchets (stone axes) traditionally used by Aboriginal peoples in Australia.","zh":"**mogo** 的复数：石斧（石制短柄斧），传统上为澳大利亚原住民使用。"},"examples":[{"en":"The museum displayed several mogos alongside other Aboriginal tools.","zh":"博物馆把几把 mogos 和其他原住民工具一起展出。"},{"en":"In older Australian writing, you may see the word mogos used for stone hatchets.","zh":"在较早的澳大利亚英文作品里，你可能会看到 mogos 用来指石斧。"}]}],"synonyms":["stone hatchets","stone axes","stone tools"],"phonetic":"ˈmoʊɡoʊz","extraExplanation":["“mogo / mogos” 是较少见、带地域色彩的词，常见于澳大利亚语境（尤其是人类学、历史或博物馆说明）。","词源一般认为来自澳大利亚原住民语言（如 Dharuk 一带）的词，后来进入英语。","学习与使用时注意文化敏感：更合适的表述通常会具体说明为 “Aboriginal stone hatchet/axe”（原住民石斧/石斧头），并放在历史与文化背景中介绍。"]}
{"word":"mogote","summary":{"en":"A mogote is a steep, isolated limestone hill found in karst regions, especially in the Caribbean.","zh":"Mogote 指岩溶地区常见的孤立陡峭石灰岩山丘/峰，尤见于加勒比地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a steep, isolated hill or small mountain—often rounded or tower-like—made of limestone and formed by erosion in karst landscapes (common in the Caribbean, especially Cuba and Puerto Rico)","zh":"（岩溶地貌中的）孤立陡峭山丘/小山峰，常由石灰岩构成，因溶蚀与侵蚀形成（加勒比地区常见，尤以古巴、波多黎各著名）"},"examples":[{"en":"The valley was dotted with mogotes rising abruptly from the farmland.","zh":"山谷里点缀着一座座mogote，陡然从农田中拔地而起。"},{"en":"Puerto Rico’s northern karst region is known for its mogotes and sinkholes.","zh":"波多黎各北部的岩溶区以mogote和天坑（塌陷洼地）闻名。"}]}],"synonyms":["karst tower","haystack hill","tower karst hill"],"phonetic":"ˈmoʊɡoʊteɪ","extraExplanation":["“Mogote”是西班牙语借词，在英语里多用于地理/地貌语境，指岩溶地区（karst）里突兀孤立的石灰岩丘或塔状峰。","学习搭配：常见说法有“mogote hills / mogote landscape / mogote karst”。","相关概念：mogote 常与“sinkhole（天坑/塌陷洞）”“cave（溶洞）”“karst（岩溶）”一起出现；外形相近的通用英语也会说“karst tower”或“haystack hill（草垛山）”，但 mogote 更带有加勒比地区的地域色彩。"]}
{"word":"mograbi","summary":{"en":"Mograbi is usually a surname meaning “from the Maghreb (the West)”; it can also refer to the filmmaker Avi Mograbi.","zh":"Mograbi 通常是一个姓氏，含义接近“来自马格里布（西方/北非西北）”；也可指纪录片导演 Avi Mograbi。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (also spelled Mughrabi/Moghrabi/Mograby, etc.) originally meaning “from the Maghreb” (Northwest Africa); from Arabic, related to “the West.”","zh":"一个姓氏（也可拼作 Mughrabi/Moghrabi/Mograby 等），本义是“来自马格里布（北非西北部）的人”；源自阿拉伯语，与“西方”之意相关。"},"examples":[{"en":"Her last name is Mograbi, and her family history traces back to North Africa.","zh":"她姓 Mograbi，家族史可追溯到北非。"},{"en":"You may also see the same surname written as Mughrabi or Moghrabi in English.","zh":"在英文中，你也可能看到同一个姓写成 Mughrabi 或 Moghrabi。"}]},{"partOfSpeech":"other","definition":{"en":"(by reference) Avi Mograbi, an Israeli documentary filmmaker; “Mograbi” may be used when discussing his films or work.","zh":"（指人名）以色列纪录片导演 Avi Mograbi；在谈论其电影或作品时可能直接用 “Mograbi” 指代他。"},"examples":[{"en":"We watched a film by Mograbi in our documentary cinema class.","zh":"我们在纪录片电影课上看了一部 Mograbi 的作品。"},{"en":"Mograbi’s documentaries often mix personal voice and political themes.","zh":"Mograbi 的纪录片常把个人视角与政治主题结合在一起。"}]}],"synonyms":["Mughrabi","Moghrabi","Maghrebi"],"phonetic":"/ˈmoʊɡrəbi/","extraExplanation":["“Mograbi / Mughrabi / Maghrebi（阿拉伯语常见写法：al-Maghribi）”这类姓氏通常是“出身地/来源”型称呼，字面意思接近“西方来的、来自马格里布的人”。马格里布（Maghreb）在阿拉伯语里与“西方”有关，常指摩洛哥、阿尔及利亚、突尼斯一带（有时也包含更广的北非地区）。","拼写差异多来自把阿拉伯语音（如 gh、ḥ 等）转写成英文时的不同习惯，所以同一姓氏会出现多种英文拼法。"]}
{"word":"mogrebbin","summary":{"en":"*mogrebbin* is a rare, old-fashioned spelling meaning “Maghrebi; a person from the Maghreb (Northwest Africa).”","zh":"*mogrebbin* 是一个罕见的旧式拼写，意思是“马格里布人/来自北非西部（马格里布）的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic/rare) An old spelling of **Maghrebin/Maghrebi**—a person from the **Maghreb** (Northwest Africa, especially Morocco, Algeria, Tunisia, etc.).","zh":"（古旧/罕见）**Maghrebin/Maghrebi** 的旧拼写：指来自**马格里布**（北非西部地区，如摩洛哥、阿尔及利亚、突尼斯等）的人。"},"examples":[{"en":"In some older travel writing, you may see *Mogrebbin* used where modern English would say *Maghrebi*.","zh":"在一些较早的游记/旅行文献里，你可能会看到用 *Mogrebbin*，而现代英语通常写 *Maghrebi*。"},{"en":"The museum’s catalog updated the label from *Mogrebbin* to *Maghrebi* for clarity.","zh":"博物馆的目录为了更清楚，把标签从 *Mogrebbin* 改成了 *Maghrebi*。"}]}],"synonyms":["Maghrebi","Maghrebin","North African (broad)","Moroccan (if specifically Morocco)"],"phonetic":"/moʊˈɡrɛbɪn/","extraExplanation":["这个词非常少见，更多时候是“拼写变体/旧式拼法”，现代写作与新闻里几乎不会用。","*Maghreb*（马格里布）来自阿拉伯语，常指非洲西北部地区。","有些旧文献可能把 *Mogrebbin* 与 *Moor* 等历史称呼混用；但 *Moor* 在现代语境里含义复杂、可能带历史刻板印象，因此更推荐使用更准确的 *Maghrebi* 或直接写具体国籍/族群（如 Moroccan）。"]}
{"word":"mogs","summary":{"en":"“Mogs” usually means “outshines/outclasses,” especially in looks or presence (internet slang).","zh":"「mogs」通常指「比別人更出眾、把別人比下去」，特別是外貌或氣場（網路俚語）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(internet slang) to outclass or outshine someone—especially by looking noticeably more attractive or impressive in comparison.","zh":"（網路俚語）在比較中「碾壓、勝過」某人，特別指外貌或氣場更出眾，讓對方顯得相形失色。"},"examples":[{"en":"In that photo, he totally mogs everyone standing next to him.","zh":"在那張照片裡，他站在旁邊的人全都被他「碾壓」了。"},{"en":"She mogs me in every selfie—her lighting is always perfect.","zh":"她每張自拍都把我比下去——她的光線永遠剛剛好。"},{"en":"That new haircut mogs the old one.","zh":"那個新髮型比舊的好看太多了。"}]},{"partOfSpeech":"v.","definition":{"en":"(dialect, less common) to move away or leave (often used with off/on).","zh":"（方言，較少見）離開、走開（常與 off/on 搭配）。"},"examples":[{"en":"They mogged off before we could say goodbye.","zh":"我們還沒來得及道別，他們就走開了。"},{"en":"Come on—mog on, we’re going to be late.","zh":"走吧——趕快走，我們要遲到了。"}]},{"partOfSpeech":"v.","definition":{"en":"(dialect, less common) to walk along slowly and steadily.","zh":"（方言，較少見）緩慢而穩定地走。"},"examples":[{"en":"After lunch, they mogged along the river path.","zh":"午餐後，他們沿著河邊小路慢慢走著。"}]}],"synonyms":["outshine","outclass","upstage","surpass","dominate"],"phonetic":"/mɑɡz/","extraExplanation":["「mogs」通常是動詞「mog」的第三人稱單數（he/she/it mogs）或現在式用法。在社群媒體上最常見的意思是「在外貌/氣場/表現上把別人比下去」，常帶有玩笑、比較文化的語氣。","注意別和大寫縮寫「MOG」混淆：有些圈子會用 MOG 表示「man of God（敬虔的人/信徒）」；但在外貌比較的語境裡，通常指的是俚語動詞 mog。"]}
{"word":"moguey","summary":{"en":"“Moguey” is usually a misspelling of “maguey,” meaning an agave plant (or its fiber).","zh":"“moguey”通常是“maguey”的误拼，指一种龙舌兰植物（或其纤维）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of agave plant with thick, fleshy leaves (often associated with Mexico); some species are used to make drinks like mezcal/tequila or to wrap and cook food","zh":"一种龙舌兰属植物，叶片厚实多汁（常与墨西哥相关）；某些品种可用于制作梅斯卡尔酒/龙舌兰酒，或用叶片包裹烹饪食物"},"examples":[{"en":"In Oaxaca, maguey plants are central to making mezcal.","zh":"在瓦哈卡，maguey（龙舌兰）是制作梅斯卡尔酒的核心原料。"},{"en":"The meat was wrapped in maguey leaves before cooking.","zh":"肉在烹饪前会用龙舌兰叶包起来。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong fiber made from certain maguey/agave plants, used for rope, mats, and similar materials","zh":"由某些龙舌兰植物提取的坚韧纤维，可用于制作绳索、垫子等"},"examples":[{"en":"They used maguey fiber to make a durable rope.","zh":"他们用龙舌兰纤维做出很耐用的绳子。"}]}],"synonyms":["agave","century plant","sisal (fiber-related)"],"phonetic":"/məˈɡeɪ/","extraExplanation":["你输入的 **moguey** 通常被认为是 **maguey** 的拼写误差；英语里更常见、也更标准的拼写是 **maguey**。","**maguey** 源自西班牙语（再往上可追溯到加勒比地区原住民语言），在英语语境里常用来指“龙舌兰（尤其在墨西哥文化与饮食/蒸馏酒语境中）”。","文化小提示：在墨西哥，不同种类的龙舌兰（agave）用途很多——既可能与蒸馏酒相关，也常出现在传统烹饪（如用叶片包裹、蒸烤）与手工材料（纤维）中。"]}
{"word":"mogul","summary":{"en":"A mogul is a powerful, wealthy industry leader; historically, it can also mean a Mughal emperor.","zh":"mogul 指行业中有权势又富有的大亨；历史上也可指莫卧儿帝国的君主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very powerful and wealthy person in business or a particular industry.","zh":"（某行业中）有权势且非常富有的大亨；巨头。"},"examples":[{"en":"She became a media mogul after building a global news network.","zh":"她建立起全球新闻网络后，成了媒体大亨。"},{"en":"Tech moguls often influence public policy and culture.","zh":"科技巨头常常影响公共政策和文化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A ruler in the Mughal Empire in South Asia.","zh":"（历史）莫卧儿帝国的统治者；莫卧儿王朝的君主。"},"examples":[{"en":"The Taj Mahal was commissioned by the Mughal mogul Shah Jahan.","zh":"泰姬陵由莫卧儿皇帝沙·贾汗下令修建。"},{"en":"European travelers wrote about the wealth of the moguls in India.","zh":"欧洲旅行者曾记述印度莫卧儿君主的财富。"}]}],"synonyms":["tycoon","magnate","baron","power broker"],"phonetic":"/ˈmoʊɡəl/","extraExplanation":["“mogul”在现代英语里最常用的是比喻义：指在某个行业里“呼风唤雨”的大人物（如 media mogul、real-estate mogul）。","词源与历史用法有关：它来自对“莫卧儿（Mughal）”统治者的称呼。因为莫卧儿帝国以富庶与权势闻名，这个词后来在英语中引申为“富有且有影响力的人”。","常见搭配：media/film/music/tech mogul；也常与 billionaire（亿万富翁）、tycoon（大亨）一起出现，但 mogul 更强调行业影响力与地位。"]}
{"word":"moguls","summary":{"en":"Moguls are powerful, wealthy, influential people—especially top leaders in business (e.g., tech or media).","zh":"moguls 指在某个行业里非常富有、权势很大、影响力很强的“大亨/巨头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very powerful, wealthy, and influential person in a particular business or industry (often media, entertainment, finance, or technology).","zh":"（某个行业里）权势很大、非常富有且有影响力的人（常见于媒体、娱乐、金融或科技等行业）。"},"examples":[{"en":"Several tech moguls attended the conference to discuss AI safety.","zh":"几位科技巨头出席了会议，讨论人工智能安全。"},{"en":"The film studio was run by a Hollywood mogul known for taking big risks.","zh":"这家电影制片厂由一位以敢于冒险著称的好莱坞大亨掌管。"}]},{"partOfSpeech":"n.","definition":{"en":"A ruler or important leader, especially in historical contexts (less common in everyday modern English).","zh":"统治者或重要领袖（多用于历史语境；现代日常英语中较少见）。"},"examples":[{"en":"The region was once controlled by local moguls.","zh":"这个地区曾一度由当地统治者控制。"}]}],"synonyms":["tycoon","magnate","industry leader","bigwig"],"phonetic":"ˈmoʊɡəl","extraExplanation":["“mogul”最早与“蒙古/莫卧儿（Mughal）”相关：英语里曾用它指印度的莫卧儿皇帝或强权统治者。后来意义扩展成“权势很大的人”，尤其指商业领域的“巨头/大亨”。","语感上，“mogul”带一点“呼风唤雨、资源巨大”的色彩，比“boss（老板）”更强调行业影响力；也可略带褒贬取决于上下文（如“media mogul”可能暗示掌控舆论的力量）。","常见搭配：tech mogul（科技巨头）、media mogul（媒体大亨）、real-estate mogul（房地产大亨）、Hollywood mogul（好莱坞大亨）。复数形式是 moguls。"]}
{"word":"mogulship","summary":{"en":"Mogulship is a rare, informal word meaning “the status or lifestyle of a mogul,” and it’s also sometimes used as a brand-like name.","zh":"Mogulship 是个较少见的非正式用词，可指“大亨的地位/生活方式”，也常被用作品牌式名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, informal) The status, power, or lifestyle associated with being a mogul (a very rich and influential business person).","zh":"（罕见，非正式）“巨头/大亨”的地位、权势，或与之相关的生活方式。"},"examples":[{"en":"After selling his startup, he slipped into mogulship—private jets, big acquisitions, and constant media attention.","zh":"卖掉创业公司后，他迅速进入了“大亨模式”——私人飞机、大型收购、以及持续的媒体关注。"},{"en":"She’s not chasing mogulship; she just wants a stable company with a healthy culture.","zh":"她并不追求“大亨地位”；她只想要一家稳定、文化健康的公司。"}]},{"partOfSpeech":"other","definition":{"en":"(Also used as a name) A made-up or brand-like word used for projects, websites, or communities related to entrepreneurs and business leaders.","zh":"（也可作名称使用）一种偏“品牌词/造词”的用法，常见于与创业者、商业领袖相关的项目、网站或社群名称。"},"examples":[{"en":"They launched Mogulship as a community for first-time founders.","zh":"他们推出“Mogulship”，作为一个面向首次创业者的社群。"},{"en":"Search results for “Mogulship” may refer to a brand name rather than a dictionary word.","zh":"搜索“Mogulship”的结果可能更多指向品牌名，而不一定是词典里的常见词。"}]}],"synonyms":["tycoon status","moguldom","power","influence","wealth"],"phonetic":"/ˈmoʊ.ɡəl.ʃɪp/","extraExplanation":["“mogulship”不是常见的标准词汇，更像是由 mogul（商业巨头/大亨）+ 后缀 -ship 构成的“造词”。-ship 常表示“身份/状态/性质”（如 friendship 友谊、leadership 领导力、membership 会员身份），所以 mogulship 可以理解为“成为/像大亨那样的身份与状态”。","如果你是在某个特定语境（文章、公司名、社群名）里看到它，告诉我原句，我可以帮你判断它是想表达“权势地位”，还是单纯的品牌名称。"]}
{"word":"moguntine","summary":{"en":"Moguntine means “related to Moguntiacum (Roman Mainz).”","zh":"moguntine 指“与罗马时期的美因茨（Moguntiacum）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"**(rare)** Of or relating to **Moguntiacum** (the Roman name for modern **Mainz, Germany**), especially in historical/archaeological writing.\nExample: *a Moguntine fort on the Rhine*.\n例句：*莱茵河畔的一座“莫贡廷（即美因茨罗马时期）”要塞*。","zh":"**（罕用）** 与“莫贡提亚库姆（Moguntiacum）”（今德国**美因茨 Mainz**的罗马时期名称）有关的；多用于历史或考古语境。\n例：*Moguntine inscriptions*（美因茨罗马时期相关的铭文）。"},"examples":[{"en":"Archaeologists compared Moguntine pottery styles with finds from nearby Roman towns.","zh":"考古学家把“莫贡廷（美因茨罗马时期相关的）”陶器风格与附近罗马城镇的出土物进行了比较。"},{"en":"The museum label described the coin as a Moguntine artifact from the early empire.","zh":"博物馆标签将这枚硬币描述为帝国早期的“莫贡廷（美因茨地区罗马时期）”文物。"}]}],"synonyms":["Mainzian (rare)","of Mainz (paraphrase)"],"phonetic":"ˌmoʊɡənˈtiːn","extraExplanation":["这个词在现代英语里非常少见，常见于学术写作（如罗马史、考古报告、博物馆说明）。","词源上来自拉丁语 **Moguntiacum**（罗马时期对美因茨的称呼）+ 英语形容词后缀 **-ine**（表示“与……有关/来自……”）。","如果你是在别的语境里看到 *moguntine*（例如游戏名、用户名、品牌名等），也可能是借用或拼写变体；你可以把原句/截图发我，我可以帮你判断具体含义。"]}

