{"word":"moha","summary":{"en":"Moha is a religious-philosophical term meaning delusion (and sometimes worldly attachment) that blocks clear understanding.","zh":"Moha 是宗教哲学术语，主要指“迷妄/迷惑”，有时也指对世俗的“执著”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism and Hinduism) delusion or confusion that clouds the mind and prevents clear understanding; often linked to ignorance and emotional attachment.","zh":"（佛教、印度教语境）迷妄；迷惑：使人看不清真相、无法明辨的心理状态，常与“无明/愚痴”和执著相关。"},"examples":[{"en":"In Buddhist teachings, *moha* is a mental fog that leads to unwise choices.","zh":"在佛教教义中，*moha* 指一种“心的迷雾”，会让人做出不明智的选择。"},{"en":"He realized his jealousy came from *moha*, not from reality.","zh":"他意识到自己的嫉妒来自 *moha*（迷妄），而非现实本身。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in Sikh/Punjabi usage) attachment to worldly things or relationships; clinging.","zh":"（尤指锡克教/旁遮普语用法）对世俗事物或关系的执著；贪恋、黏着。"},"examples":[{"en":"The teacher warned that *moha*—clinging to status—can cause suffering.","zh":"老师提醒说，*moha*——对地位的执著——会带来痛苦。"}]}],"synonyms":["delusion","confusion","ignorance","attachment","clinging"],"phonetic":"/ˈmoʊhə/","extraExplanation":["“moha/मोह（梵语；也见于巴利语）”常被译作“迷妄、迷惑、愚痴”，在佛教里常与“贪（rāga）”“嗔（dveṣa）”并列为导致痛苦的根源之一；在一些印度宗教语境中，它也可指对“幻相/世俗”的执著。","在英语中，*moha* 多出现在宗教、哲学、冥想/瑜伽、印度学相关文本里；日常英语对话里并不常用。若你是在聊天或游戏里看到“moha”，也可能是人名/地名/缩写，需要具体上下文才能确定。"]}
{"word":"mohabat","summary":{"en":"*Mohabat* (more commonly spelled *mohabbat*) is a loanword meaning “love/affection,” and can also mean “tender kindness.”","zh":"*mohabat*（更常见拼写为 *mohabbat*）是外来词，意思是“爱/爱情/深情”，也可引申为“温情的关怀与慈爱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian & Persian loanword) love; affection; deep fondness.","zh":"（南亚语言与波斯语借词）爱；爱情；深情；喜爱。"},"examples":[{"en":"In Urdu poetry, *mohabat* often means a deep, painful kind of love.","zh":"在乌尔都诗歌里，*mohabat* 常指一种很深、带着痛感的爱情。"},{"en":"Their friendship grew into *mohabat* over time.","zh":"他们的友谊随着时间慢慢变成了*爱情/深情*。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) a warm, kind attitude; tenderness; caring.","zh":"（引申）温情；慈爱；关怀；善意。"},"examples":[{"en":"She treated the children with *mohabat* and patience.","zh":"她用*慈爱*和耐心对待孩子们。"},{"en":"Speak with *mohabat*, not anger.","zh":"说话要带着*温情*，不要带着怒气。"}]}],"synonyms":["love","affection","fondness","tenderness","kindness"],"phonetic":"/moʊˈhɑːbət/","extraExplanation":["“mohabat”更常见的标准拼写是 **mohabbat**（双写 b），来源于阿拉伯语 **maḥabba/maḥabbah（محبة）**，进入波斯语后常写作 **mohabbat（محبت）**，再通过乌尔都语/印地语传播。英语/拉丁字母转写没有唯一标准，所以也会看到 *muhabbat / mahabbat / mohabat* 等写法。","在南亚文化语境里，*mohabbat* 常出现在：① 乌尔都语“加扎勒”(ghazal)与苏菲诗歌（既可指人间爱情，也可指神圣之爱）；② 电影/电视剧/歌曲标题中，用来表达“爱情/情深”的主题。若你是在搜歌名或影视剧名，也可能指作品标题而不是普通词义。"]}
{"word":"mohair","summary":{"en":"Mohair is a shiny, slightly fuzzy fiber (and fabric) made from the hair of the Angora goat.","zh":"Mohair 指来自安哥拉山羊的有光泽、略蓬松的纤维及其织物（马海毛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, shiny fiber (and fabric made from it) that comes from the hair of the Angora goat, often used for sweaters, coats, scarves, and upholstery.","zh":"马海毛；（也指用其制成的）马海毛织物：一种柔软、有光泽的纤维，来自安哥拉山羊的毛，常用于毛衣、大衣、围巾和家具装饰面料等。"},"examples":[{"en":"She wore a mohair sweater that looked slightly fuzzy in the sunlight.","zh":"她穿着一件马海毛毛衣，在阳光下看起来有点蓬松。"},{"en":"The vintage chair was reupholstered in a durable mohair fabric.","zh":"那把复古椅子用耐磨的马海毛面料重新包了面。"}]}],"synonyms":["Angora goat hair","wool (general)","yarn"],"phonetic":"/ˈmoʊ.her/","extraExplanation":["“Mohair”来自安哥拉山羊（Angora goat）的毛，不要和“Angora rabbit”（安哥拉兔）产生的“angora wool/安哥拉兔毛”混淆：两者都蓬松柔软，但来源动物不同。","在服装语境里，mohair 常带有“带光泽、略微毛茸茸（fuzzy/halo）”的触感联想；在家居语境里则强调“耐磨、质感高级”。","英语里还有一个常见搭配是 “mohair sweater/coat”，有时会与“itchy（扎皮肤）”并列出现，因为部分人对羊毛类纤维较敏感。"]}
{"word":"mohairs","summary":{"en":"“Mohairs” is the plural of “mohair,” usually referring to mohair materials or types of mohair fabric; “mohair” is a soft, shiny fiber from the Angora goat.","zh":"“mohairs”是“mohair”的复数，常用于纺织语境指马海毛材质/面料种类；“mohair”指来自安哥拉山羊的柔软、有光泽的纤维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually uncountable) A soft, shiny fiber made from the hair of the Angora goat, used to make yarn and fabric.","zh":"（通常不可数）马海毛；安哥拉山羊毛（一种柔软、有光泽的纤维，用来纺线或织布）"},"examples":[{"en":"This sweater contains 30% mohair, so it feels warm and slightly fuzzy.","zh":"这件毛衣含有30%的马海毛，所以摸起来很暖、还有点绒绒的。"},{"en":"Mohair yarn is often blended with wool to add softness and shine.","zh":"马海毛纱线常和羊毛混纺，以增加柔软度和光泽。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural form: mohairs) Types or pieces of fabric/clothing made of mohair; mohair materials (more common in textile/fashion contexts).","zh":"（复数：mohairs）马海毛织物/衣料的种类或布料/成品（多见于纺织、服装语境）"},"examples":[{"en":"The designer showcased several mohairs in muted winter colors.","zh":"设计师展示了几款低饱和冬季色调的马海毛面料。"},{"en":"The shop specializes in tweeds and mohairs for suits.","zh":"这家店专营粗花呢和马海毛西装面料。"}]}],"synonyms":["Angora goat fiber","mohair yarn","mohair fabric","wool blend"],"phonetic":"/ˈmoʊheər/","extraExplanation":["“mohair”多为不可数名词，日常更常说“mohair sweater / mohair yarn / mohair fabric”。当你看到复数“mohairs”，通常是在面料行业里，指“不同种类的马海毛面料”或“马海毛材质的布料/成品”。","“mohair”来自安哥拉山羊（Angora goat）的毛，不等同于“Angora rabbit”的毛（那种通常叫“angora”）。两者都很柔软，但来源动物不同。"]}
{"word":"mohalim","summary":{"en":"“mohalim” means “mohels” — people who perform Jewish ritual circumcisions (brit milah).","zh":"“mohalim”是“mohel”的复数，指执行犹太割礼仪式（brit milah）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **mohel**: people trained to perform the Jewish ritual circumcision ceremony (brit milah).","zh":"**mohel（行割礼者）** 的复数：指受过训练、在犹太传统中执行**割礼仪式（brit milah）**的人。"},"examples":[{"en":"The family invited two **mohalim** and chose the one they felt most comfortable with.","zh":"这家人邀请了两位**mohalim（行割礼者）**，并选择了让他们最安心的一位。"},{"en":"In some communities, **mohalim** are also medical doctors with additional religious training.","zh":"在一些社群里，**mohalim** 也可能是医生，并接受过额外的宗教仪式训练。"}]}],"synonyms":["mohels","ritual circumcisers"],"phonetic":"ˌmoʊ.hɑˈlim","extraExplanation":["“mohalim”来自希伯来语，是英语里对“mohel”的一种常见复数形式（也有人用 mohels / mohelim）。","在文化语境上，mohel/mohalim 通常与犹太人生礼仪中的 brit milah（婴儿出生第八天左右举行的割礼仪式）相关；写作或讨论时适合保持尊重与中性表述。"]}
{"word":"mohammad","summary":{"en":"Mohammad is a common male name and a spelling variant of Muhammad; it can also refer to the Prophet Muhammad in Islam.","zh":"Mohammad 是常见男性名字，是 Muhammad（穆罕默德）的音译拼写变体；也可指伊斯兰教的先知穆罕默德。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, commonly used in Muslim communities; a spelling variant (transliteration) of **Muhammad**","zh":"男性名字；常见于穆斯林社群；是 **Muhammad（穆罕默德）** 的一种英文拼写/音译变体"},"examples":[{"en":"Mohammad is a very common first name in many countries.","zh":"Mohammad 在许多国家都是很常见的名字。"},{"en":"Her colleague Mohammad moved to the U.S. for graduate school.","zh":"她的同事 Mohammad 来美国读研究生。"}]},{"partOfSpeech":"n.","definition":{"en":"as a reference to **the Prophet Muhammad** in Islam (the founder figure of Islam); in English writing, this meaning is usually spelled **Muhammad**, but **Mohammad** is also seen","zh":"指伊斯兰教中的 **先知穆罕默德**；英文中更常写作 **Muhammad**，但也常见 **Mohammad** 这种拼写"},"examples":[{"en":"Many Muslims say “Peace be upon him” after mentioning Muhammad.","zh":"许多穆斯林在提到穆罕默德后会说“愿主赐他平安”。"}]}],"synonyms":["Muhammad","Mohammed","Mohamad","Mohamad"],"phonetic":"/ˌmoʊˈhɑːməd/","extraExplanation":["“Mohammad / Muhammad / Mohammed / Mohamad”等多种拼写主要来自把阿拉伯语名字音译到英文时的差异（地区口音、历史拼写习惯、护照/官方文件写法等），不代表对错。","作为人名时，英文里通常首字母大写（Mohammad）。如果是指宗教人物，很多英文写作会偏好“Prophet Muhammad”这一形式，也常见在名字后加尊称缩写（如 PBUH），体现尊重。"]}
{"word":"mohammed","summary":{"en":"Mohammed is a common male name, and it can also refer to the Prophet of Islam; it has many spelling variants (e.g., Muhammad).","zh":"Mohammed 既可作常见男性名字，也可指伊斯兰教先知；英文有多种常见拼写变体（如 Muhammad）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name used widely in Muslim communities (and beyond), with many spelling variants.","zh":"男性名字，在穆斯林社群及其他地区广泛使用；英文拼写有多种变体。"},"examples":[{"en":"Mohammed is a very common name in many countries.","zh":"Mohammed 在许多国家都是很常见的名字。"},{"en":"My classmate Mohammed moved to Chicago last year.","zh":"我的同学 Mohammed 去年搬到了芝加哥。"}]},{"partOfSpeech":"other","definition":{"en":"the Prophet of Islam (c. 570–632 CE), also commonly spelled Muhammad.","zh":"伊斯兰教的先知（约公元570—632年），英文也常写作 Muhammad。"},"examples":[{"en":"Muslims regard Mohammed (Muhammad) as the final prophet.","zh":"穆斯林认为 Mohammed（Muhammad）是最后一位先知。"},{"en":"Many biographies of Mohammed focus on his life in Mecca and Medina.","zh":"许多关于 Mohammed 的传记会聚焦于他在麦加和麦地那的经历。"}]}],"synonyms":["Muhammad","Mohammad","Mohamed"],"phonetic":"/moʊˈhɑːməd/","extraExplanation":["“Mohammed / Muhammad / Mohammad”等都是同一个阿拉伯语名字的不同拉丁字母转写（音译），因为阿拉伯语发音与英语拼写并非一一对应，所以会出现多种常见拼法；在正式写作中，通常以当事人证件或本人偏好为准。","在宗教语境里提到先知时，很多英语文章更常用拼法“Muhammad”。不同社群对称呼与拼写可能有偏好；保持尊重、使用对方/文本所采用的写法通常最稳妥。"]}
{"word":"mohammedan","summary":{"en":"“Mohammedan” is an old term for “Muslim/Islamic” and is now widely considered inaccurate and often offensive; use “Muslim” (people) or “Islamic” (related to Islam) instead.","zh":"“Mohammedan”是指“穆斯林/伊斯兰的”的旧称，如今多被认为不准确且常带冒犯性；建议改用“Muslim”（指人）或“Islamic”（指与伊斯兰相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, often offensive) A Muslim; a person who follows Islam.","zh":"（过时，且常被认为带有冒犯性）穆斯林；信奉伊斯兰教的人。"},"examples":[{"en":"This term appears in older English texts, but today most writers use “Muslim” instead.","zh":"这个词常见于较早的英文文本，但如今多数写作者会用“Muslim（穆斯林）”来替代。"},{"en":"The museum updated the label to remove “Mohammedan” and use “Islamic” and “Muslim” for accuracy.","zh":"博物馆更新了说明牌，去掉了“Mohammedan”，改用“Islamic（伊斯兰的）”和“Muslim（穆斯林）”以更准确。"}]},{"partOfSpeech":"adj.","definition":{"en":"(dated, often offensive) Relating to Islam or Muslims.","zh":"（过时，且常被认为带有冒犯性）与伊斯兰教或穆斯林有关的。"},"examples":[{"en":"In modern English, “Islamic art” is preferred over older phrases like “Mohammedan art.”","zh":"在现代英语中，“Islamic art（伊斯兰艺术）”更常用，而不是较旧的说法如“Mohammedan art”。"}]}],"synonyms":["Muslim","Islamic (adj.)","Islam (when referring to the religion, not a person)"],"phonetic":"/moʊˈhæmədən/","extraExplanation":["“Mohammedan”来自把伊斯兰教误解为“崇拜穆罕默德（Muhammad）”的旧式西方称呼（类似“Christian—Christ”这种构词类比）。但伊斯兰教强调只崇拜真主（Allah），穆罕默德是先知而不是被崇拜的对象，所以这个词在准确性上有问题。","因此在当代英语里，这个词通常被视为不尊重或带偏见，尤其用来称呼个人时更容易冒犯。更合适的用法是：指人用“Muslim（穆斯林）”；指宗教/文化/艺术用“Islamic（伊斯兰的）”。","如果你在古书、历史文献或旧译本里遇到它，理解为“穆斯林/伊斯兰的”即可；但在写作、对话、新闻或学术表达中建议避免使用。"]}
{"word":"mohammedanism","summary":{"en":"Mohammedanism is an outdated term for Islam and is often seen as inaccurate and offensive; use “Islam” instead.","zh":"Mohammedanism 是指“伊斯兰教”的过时旧称，常被认为不准确且带冒犯性；建议改用 “Islam”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old-fashioned term formerly used to mean Islam; now widely considered inaccurate and often offensive","zh":"一种过时的旧称，曾被用来指“伊斯兰教（Islam）”；如今普遍被认为不准确，且常被视为冒犯"},"examples":[{"en":"The textbook used the term “Mohammedanism,” but modern writers usually say “Islam.”","zh":"那本教材用了“Mohammedanism”，但现代写作通常说“Islam（伊斯兰教）”。"},{"en":"Many Muslims dislike the word because it can suggest Muslims worship Muhammad, which Islam does not teach.","zh":"许多穆斯林不喜欢这个词，因为它可能暗示穆斯林崇拜穆罕默德，但伊斯兰教并不这样教导。"}]}],"synonyms":["Islam (preferred)","the Islamic faith","Islamic religion (less common)"],"phonetic":"/moʊˈhæmədənɪzəm/","extraExplanation":["这个词在英语里主要出现在较早期的欧洲文献中，是从“Mohammedan（穆罕默德的/穆斯林的）+ -ism（主义/宗教体系）”构成的旧说法。","之所以被认为不准确：它容易让人误以为伊斯兰教像“基督教（Christianity）”崇拜基督一样崇拜穆罕默德；但伊斯兰教强调只崇拜真主（Allah），穆罕默德被视为先知而非神。","在当代正式或尊重的语境中，建议用“Islam（伊斯兰教）”“Muslim(s)（穆斯林）”“Islamic（伊斯兰的）”。如果在阅读历史文本时遇到该词，可理解为时代用语，并在自己的写作中避免使用。"]}
{"word":"mohammedanization","summary":{"en":"Mohammedanization means the (historical) process of converting to Islam or adopting Islamic customs, but the term is outdated and often avoided today; “Islamization” is usually preferred.","zh":"Mohammedanization 指（历史语境中）改宗伊斯兰教或采用伊斯兰习俗的过程，但该词已过时且常被避免使用；通常更推荐用 Islamization。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making people, a society, or an institution adopt Islam (i.e., converting to Islam), or adopting Islamic customs; now usually considered outdated and potentially offensive in modern English","zh":"使人群、社会或机构接受伊斯兰教（即改宗伊斯兰教）的过程，或采用伊斯兰文化/习俗的过程；在现代英语中通常被视为过时且可能带冒犯性"},"examples":[{"en":"Some older history books described the spread of Islam as “Mohammedanization,” but modern writers usually avoid this word.","zh":"一些较旧的历史书把伊斯兰教的传播称为“Mohammedanization”，但现代作者通常避免使用这个词。"},{"en":"In contemporary academic writing, terms like “Islamization” are preferred for clarity and respect.","zh":"在当代学术写作中，为了更清晰且更尊重，通常更倾向使用“Islamization（伊斯兰化）”等说法。"}]}],"synonyms":["Islamization","conversion to Islam","Islamification"],"phonetic":"/məˌhæmɪˌdænəˈzeɪʃən/","extraExplanation":["这个词来自较早期的英语用法，把伊斯兰教误称为“Mohammedan(ism)”（好像是“穆罕默德教”）。但伊斯兰教并不崇拜穆罕默德本人，而是崇拜真主（Allah），穆罕默德被视为先知。因此，“Mohammedanization”在观念上容易造成误解，也常被认为不尊重。","现代英语更中性的对应词通常是 “Islamization”（伊斯兰化/伊斯兰教化）。若你是在描述历史时期的行政、法律或文化变化，也可以更具体地写成 “the adoption of Islamic law/customs” 或 “conversion to Islam”，以避免歧义与冒犯。"]}
{"word":"mohammedanize","summary":{"en":"“Mohammedanize” is an archaic verb meaning “to convert to Islam” or “to make something more Islamic,” but it’s usually avoided today because it comes from the outdated term “Mohammedan.”","zh":"“Mohammedanize”是古旧动词，意为“使改信伊斯兰教/使更具伊斯兰色彩”，但因源自过时且常被认为不恰当的“Mohammedan”，如今通常不建议使用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to convert someone to Islam; to make a person, group, or society adopt Islamic beliefs or practices (archaic and often considered offensive because it is based on the outdated term “Mohammedan”)","zh":"使（某人）改信伊斯兰教；使（个人、群体或社会）采纳伊斯兰信仰或习俗（用法古旧，且常被认为不恰当/冒犯，因为源自过时的“Mohammedan”一词）"},"examples":[{"en":"Some older colonial-era writings used the verb “Mohammedanize” to describe converting local communities to Islam.","zh":"一些殖民时代的旧文献会用“Mohammedanize”来描述使当地社群改信伊斯兰教。"},{"en":"Modern academic writing usually avoids “Mohammedanize” and instead says “Islamize” or “convert to Islam.”","zh":"现代学术写作通常避免用“Mohammedanize”，而会说“Islamize”或“convert to Islam（改信伊斯兰教）”。"}]},{"partOfSpeech":"v.","definition":{"en":"to give something an Islamic character or style (used rarely)","zh":"使某物带有伊斯兰色彩或风格（较少使用）"},"examples":[{"en":"The author claimed the region was being “Mohammedanized,” meaning its laws and public customs were becoming more Islamic.","zh":"作者声称该地区正在被“Mohammedanized”，意指其法律与公共习俗变得更具伊斯兰色彩。"}]}],"synonyms":["Islamize","convert to Islam"],"phonetic":"/məˈhɑːməˌdæn.aɪz/","extraExplanation":["“Mohammedanize”来自“Mohammedan（穆罕默德教徒）”这一旧称。该旧称暗示伊斯兰教像“崇拜穆罕默德”的宗教，但伊斯兰教的核心是崇拜真主（Allah），穆罕默德被视为先知而非神。因此在当代英语里，“Mohammedan”及其派生词往往被认为不准确、带有殖民时期色彩，甚至可能冒犯。","更中性、常见的替代表达是：动词用“Islamize”（使伊斯兰化）或“convert (someone) to Islam”（使改信伊斯兰教）；名词/形容词用“Islamic”或“Muslim”。在正式写作中，通常建议使用这些替代词。"]}
{"word":"mohammedism","summary":{"en":"“Mohammedism” is a dated and often offensive word for Islam; use “Islam” instead.","zh":"“Mohammedism”是对伊斯兰教的过时且常带冒犯性的称呼；更建议用“Islam（伊斯兰教）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dated term for Islam, based on the mistaken idea that Muslims worship Muhammad; now generally considered inaccurate and often offensive.","zh":"对“伊斯兰教”的过时称呼，基于“穆斯林崇拜穆罕默德”的错误理解；如今通常被认为不准确且常带冒犯性。"},"examples":[{"en":"The author used the term “Mohammedism,” but modern writing prefers “Islam.”","zh":"作者用了“Mohammedism”这个词，但现代写作更常用“Islam（伊斯兰教）”。"},{"en":"Many style guides advise avoiding “Mohammedism” because it can sound disrespectful.","zh":"许多写作指南建议避免使用“Mohammedism”，因为它听起来可能不尊重。"}]}],"synonyms":["Islam (preferred)","Muhammadanism (dated)"],"phonetic":"/moʊˈhæmədˌɪzəm/","extraExplanation":["这个词常见于早期西方文献（尤其是殖民时期或传教士写作）中，把伊斯兰教类比成“以穆罕默德为核心的宗教”（类似“基督教=基督”那样的逻辑）。但伊斯兰教强调只崇拜真主（Allah），穆罕默德被视为先知而不是神明，因此该称呼在概念上不准确。","在现代英语里更中性、准确的说法是 Islam（伊斯兰教）、Muslims（穆斯林）。在正式写作或跨文化交流中，建议避免使用 Mohammedism。"]}
{"word":"mohammedist","summary":{"en":"“Mohammedist” is a dated term for a Muslim and is often considered offensive; use “Muslim” instead.","zh":"“Mohammedist”是指“穆斯林”的过时用语，且常被视为冒犯；现代应使用“Muslim”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated; often offensive) A Muslim; a follower of Islam (based on the mistaken idea that Muslims “follow Muhammad” rather than worshiping God).","zh":"（过时；常被视为冒犯）穆斯林；伊斯兰教信徒（源于误解：认为穆斯林“追随穆罕默德”，而不是崇拜真主/上帝）。"},"examples":[{"en":"The word “Mohammedist” appears in some older books, but it is usually considered offensive today.","zh":"“Mohammedist”在一些旧书里会出现，但在今天通常被认为带有冒犯性。"},{"en":"Modern writing uses “Muslim” instead of “Mohammedist.”","zh":"现代写作会用“Muslim（穆斯林）”而不是“Mohammedist”。"}]}],"synonyms":["Muslim (preferred)","follower of Islam"],"phonetic":"/moʊˈhæmədɪst/","extraExplanation":["这个词属于历史用语，带有强烈的“外部标签”色彩，很多穆斯林会觉得被误称或被矮化，因此在当代英语里应避免使用。更中性、准确的说法是 **Muslim**（个人身份）或 **Islamic**（形容与伊斯兰相关的事物）。","词形上，-ist 常表示“某种主义/思想的信奉者”（如 Buddhist, socialist）。但把 Islam 表述成 “Mohammed-” 开头的体系，会暗示“以穆罕默德为崇拜对象”，这与伊斯兰的核心信仰不符。"]}
{"word":"mohammedization","summary":{"en":"*Mohammedization* is a dated (often offensive) word meaning “Islamization,” i.e., the spread or increasing influence of Islam.","zh":"*Mohammedization* 是一个过时且常被认为带冒犯性的词，意思相当于“Islamization（伊斯兰化）”，指伊斯兰教的传播或影响增强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated; often considered offensive) The process of Islamizing a person, community, or society; the spread or increasing influence of Islam.","zh":"（过时；常被认为带冒犯性）使个人、群体或社会“伊斯兰化”的过程；伊斯兰教影响的传播或增强。"},"examples":[{"en":"Some older writings use *Mohammedization* to mean the Islamization of a region.","zh":"一些较早的著作会用 *Mohammedization* 来表示某个地区的伊斯兰化过程。"},{"en":"In modern academic and news writing, people usually avoid the word *Mohammedization* and use *Islamization* instead.","zh":"在现代学术和新闻写作中，人们通常避免使用 *Mohammedization*，而改用 *Islamization*。"}]}],"synonyms":["Islamization","Islamisation","Islamifying","spread of Islam"],"phonetic":"/moʊˌhæmɪdəˈzeɪʃən/","extraExplanation":["这个词通常由“Mohammed/Muhammad（穆罕默德）+ -ization”构成，但在英语里把伊斯兰教称为“Mohammedanism”（字面像“穆罕默德教”）属于历史上西方常见、如今不被穆斯林使用且常被认为不准确的说法，因为伊斯兰教崇拜的是上帝（Allah），穆罕默德是先知而不是被崇拜对象。","因此在正式、尊重且中性的表达中，建议用 **Islamization / Islamisation（伊斯兰化）**，或根据语境用 **spread of Islam（伊斯兰教的传播）**。如果你在旧书或带强烈立场的文本里看到 *Mohammedization*，往往也暗示作者的语气可能偏批评或政治化，需要留意语境。"]}
{"word":"mohammedize","summary":{"en":"“Mohammedize” is a rare, mostly historical verb meaning to convert someone to Islam or to make something seem Muslim/Islamic—often with biased or outdated tone.","zh":"“mohammedize”是很少见、偏历史用法的动词，指使人皈依伊斯兰教或使某事物呈现伊斯兰色彩，但常带过时或偏见语气。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(often historical) to convert (someone) to Islam; to make Muslim.","zh":"（常见于历史语境）使（某人）皈依伊斯兰教；使成为穆斯林。"},"examples":[{"en":"Some older histories used the verb “mohammedize” to mean converting a population to Islam.","zh":"一些较早的史书会用动词“mohammedize”来表示让一群人皈依伊斯兰教。"},{"en":"The author claimed the region was “mohammedized,” though modern writers would usually say “Islamized” or “converted to Islam.”","zh":"作者称该地区被“mohammedized”，但现代作者通常会说“Islamized（伊斯兰化）”或“converted to Islam（皈依伊斯兰教）”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something resemble what the speaker imagines as “Muhammadan/Muslim” customs or culture (often biased or polemical usage).","zh":"使某事物呈现出说话者所想象的“穆斯林/伊斯兰”习俗或文化色彩（常带偏见或论战色彩）。"},"examples":[{"en":"Critics accused the ruler of trying to “mohammedize” the court’s laws and rituals.","zh":"批评者指责统治者试图“mohammedize”宫廷的法律与仪式。"}]}],"synonyms":["convert to Islam","Islamize"],"phonetic":"/məˈhæməˌdaɪz/","extraExplanation":["这个词很少在现代日常英语中使用，更多出现在旧文献、宗教论战或殖民时期写作里。","它来自把伊斯兰教称为“Mohammedanism”（把伊斯兰误当成“穆罕默德教”）的旧称；这种叫法在今天通常被认为不准确、也可能冒犯。更中性常用的表达是“convert to Islam（皈依伊斯兰教）”或“Islamize（伊斯兰化）”。"]}
{"word":"mohar","summary":{"en":"Mohar is a historical Nepalese silver or gold coin (and a unit of value). It can also appear as a variant spelling of “mohur,” a South Asian historical gold coin.","zh":"Mohar 指尼泊尔历史上的银币或金币（也可指相应的货币单位）。它有时也被用作“mohur”的异拼，指南亚历史上的金币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silver or gold coin of Nepal; also the unit of value based on that coin","zh":"尼泊尔曾使用的银币或金币；也指以该硬币为基础的货币单位"},"examples":[{"en":"The museum displayed several Nepalese coins, including a half-mohar piece.","zh":"博物馆展出了几枚尼泊尔硬币，其中包括一枚半莫哈尔（mohar）硬币。"},{"en":"In old records, prices were sometimes listed in mohars rather than rupees.","zh":"在旧档案里，价格有时用莫哈尔（mohar）而不是卢比来标注。"}]},{"partOfSpeech":"n.","definition":{"en":"a spelling variant of “mohur,” a historical gold coin used in parts of South Asia (especially in Mughal and British India)","zh":"“mohur”的另一种拼写：南亚部分地区（尤其莫卧儿时期与英属印度）历史上使用过的金币名称"},"examples":[{"en":"Some books use mohar as an alternate spelling of mohur.","zh":"有些书把 mohar 当作 mohur 的另一种拼法。"},{"en":"Collectors sometimes describe a ‘mohar/mohur’ when discussing old Indian coinage.","zh":"收藏家谈论旧印度铸币时，有时会写作“mohar/mohur”。"}]}],"synonyms":["mohur","mohor"],"phonetic":"/ˈmoʊhər/","extraExplanation":["在英文里 **mohar** 最常见的用法与尼泊尔旧货币有关；但在一些资料里它也会被当作 **mohur** 的异拼（与南亚历史金币相关）。","注意：在圣经希伯来语研究中也有 **mohar**（מֹהַר）表示“聘礼/新娘价（bride-price）”的术语，但那是另一套语言体系里的词源与用法，和英语里表示“硬币”的 mohar 不是同一个词。"]}
{"word":"moharram","summary":{"en":"Moharram (Muharram) is the first month of the Islamic lunar calendar; it can also refer to the mourning/commemoration period held during that month in some regions.","zh":"Moharram（Muharram）是伊斯兰阴历的第一个月；在一些地区也可指该月期间举行的哀悼与纪念活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Muharram (also spelled Moharram): the first month of the Islamic (Hijri) lunar calendar, considered a sacred month in Islam.","zh":"穆哈兰姆月（也拼作 Moharram）：伊斯兰（希吉来）阴历的第一个月，在伊斯兰教中被视为神圣的月份。"},"examples":[{"en":"Many Muslims begin the Islamic New Year with the month of Muharram (Moharram).","zh":"许多穆斯林以穆哈兰姆月（Moharram）作为伊斯兰新年的开始。"},{"en":"Our community center shared the dates for Muharram and its main events.","zh":"我们的社区中心公布了穆哈兰姆月及其主要纪念活动的日期。"}]},{"partOfSpeech":"n.","definition":{"en":"In many contexts (especially in South Asia), Moharram can also refer to the period of religious mourning and commemorations held during Muharram, especially around Ashura.","zh":"在许多语境中（尤其在南亚），Moharram 也可指穆哈兰姆月期间的哀悼与纪念活动（特别是围绕阿舒拉日 Ashura 的纪念）。"},"examples":[{"en":"Roads may be closed during Moharram processions in some cities.","zh":"在一些城市，Moharram 游行期间道路可能会临时封闭。"},{"en":"They attended Moharram gatherings to remember historical events.","zh":"他们参加 Moharram 集会来纪念历史事件。"}]}],"synonyms":["Muharram"],"phonetic":"/moʊˈhɑːrəm/","extraExplanation":["“Moharram” 是 “Muharram” 的另一种英文拼写，常见于南亚英语/拼写习惯；在正式英文资料里更常见 “Muharram”。","Muharram 是伊斯兰历第一个月；其中第十天称为 “Ashura（阿舒拉日）”。不同穆斯林群体会以不同方式纪念这一天与这一个月：有的强调禁食与反思，有的会举行悼念活动与集会（在部分地区也会有游行）。","使用这个词时注意语境与尊重：对很多人来说，它不仅是“月份名称”，也与宗教记忆与情感有关。"]}
{"word":"mohatra","summary":{"en":"Mohatra is a rare legal-historical term for a sale-and-buyback trick used to hide an interest-bearing loan (often seen in the phrase “mohatra contract”).","zh":"Mohatra 是一个罕见的历史法律用语，指用“先卖后回购/先赊购后回售”的手法把计息借贷伪装成买卖（常见于短语“mohatra contract”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(historical, law) Describing a scheme that avoids anti-usury (anti–interest) laws by disguising a loan as two quick sales: one sale on credit, then an immediate buyback for cash at a lower price (the difference acts like “interest”).","zh":"（历史用语；法律）指一种为规避“禁止高利贷/利息”的法律而设计的手法：把借款伪装成两次迅速的买卖——先赊购（信用购买），再立刻以更低的现金价回售/回购，差价相当于“利息”。"},"examples":[{"en":"In some old legal texts, a “mohatra” transaction is treated as a disguised interest-bearing loan.","zh":"在一些早期法律文献中，“mohatra”式交易被视为把计息借贷伪装起来的做法。"},{"en":"The court argued that the mohatra sale was only a formality, because the parties intended a loan from the start.","zh":"法院认为这笔“mohatra”式买卖只是形式，因为双方从一开始的真实意图就是借贷。"}]},{"partOfSpeech":"n.","definition":{"en":"(in the phrase “mohatra contract”) A contract using this sale-and-buyback method to create a loan-like result.","zh":"（多用于短语“mohatra contract”）指采用“先赊购、再立即回售/回购”的方式，以达到类似借贷效果的合同/安排。"},"examples":[{"en":"A mohatra contract can make a loan look like a normal trade of goods.","zh":"mohatra contract 能把借款伪装成普通的商品交易。"}]}],"synonyms":["disguised loan","sham sale","sale-and-repurchase scheme","usurious arrangement"],"phonetic":"/moʊˈhɑːtrə/","extraExplanation":["“mohatra”是非常罕见的英语词，主要出现在历史法律/经济学语境里。日常英语里更常说：a disguised loan（伪装的借贷）、a sham sale（虚假买卖）、a sale-and-repurchase scheme（售后回购式安排）。","词源一般追溯到阿拉伯语 مُخَاطَرَة（muḵāṭara，常与“冒险/风险”相关的词根），后经法语/西班牙语/拉丁语进入欧洲语言；因此它带有明显的历史与跨文化金融背景。"]}
{"word":"mohave","summary":{"en":"Mohave is a common variant spelling of Mojave, referring most often to the Mojave Desert, and sometimes to the Mohave people and their language.","zh":"Mohave 是 Mojave 的常见拼写变体，最常指莫哈韦（莫哈维）沙漠，也可指莫哈韦族及其语言。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a spelling variant of **Mojave**; most commonly used as a proper name for the Mojave Desert region in the southwestern United States (especially parts of California, Nevada, Arizona, and Utah).","zh":" **Mojave** 的一种拼写变体；最常指美国西南部的**莫哈韦（莫哈维）沙漠**及其周边地区（主要在加州、内华达、亚利桑那、犹他部分地区）。"},"examples":[{"en":"Death Valley lies within the broader Mohave (Mojave) Desert region.","zh":"死亡谷位于更广义的莫哈韦（莫哈维）沙漠地区之内。"},{"en":"They drove across the Mohave on their way to Las Vegas.","zh":"他们在去拉斯维加斯的路上穿越了莫哈韦沙漠。"}]},{"partOfSpeech":"other","definition":{"en":"the **Mohave (Mojave) people**, a Native American people traditionally associated with the lower Colorado River region.","zh":" **莫哈韦（莫哈维）族**：一个与科罗拉多河下游地区传统上密切相关的美洲原住民族群。"},"examples":[{"en":"The museum has an exhibit on Mohave history and culture.","zh":"博物馆有一个关于莫哈韦族历史与文化的展览。"}]},{"partOfSpeech":"other","definition":{"en":"the **Mohave (Mojave) language**, the traditional language of the Mohave people.","zh":" **莫哈韦（莫哈维）语**：莫哈韦族的传统语言。"},"examples":[{"en":"Some community programs support learning the Mohave language.","zh":"一些社区项目支持学习莫哈韦语。"}]}],"synonyms":["Mojave"],"phonetic":"/moʊˈhɑːvi/","extraExplanation":["“Mohave”和“Mojave”在英文里常被视为同一名称的两种拼写；现代地图、媒体与旅游信息中更常见 **Mojave**，但在地名、机构名称、历史文献里仍可能看到 **Mohave**。","发音上两者通常一样：重音在第二音节（mo-HAA-vee）。","中文常见译名有“莫哈韦/莫哈维”。不同译法多与音译习惯有关，指的通常是同一地区或相关族群。"]}
{"word":"Mohawk","summary":{"en":"Mohawk can mean a Native American people (and their language/culture), or a hairstyle with shaved sides and a central strip of longer hair.","zh":"Mohawk 可指莫霍克族（及其语言/文化），也可指两侧剃短、中间留长的一种“莫霍克头”发型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people (a nation of the Haudenosaunee/Iroquois Confederacy), originally from the Mohawk River Valley and surrounding areas in what is now New York State and parts of Canada","zh":"莫霍克族（北美原住民族之一，海登诺绍尼／易洛魁联盟成员），传统上居住在今日纽约州莫霍克河谷及加拿大部分地区"},"examples":[{"en":"The Mohawk are one of the Six Nations of the Haudenosaunee Confederacy.","zh":"莫霍克族是海登诺绍尼联盟（六族联盟）之一。"},{"en":"She visited a museum exhibit about Mohawk history and culture.","zh":"她参观了一个关于莫霍克族历史与文化的博物馆展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mohawk language, spoken by some Mohawk people","zh":"莫霍克语（莫霍克族使用的语言）"},"examples":[{"en":"He is learning Mohawk to reconnect with his family’s heritage.","zh":"他在学习莫霍克语，以重新连接家族的文化传承。"}]},{"partOfSpeech":"n.","definition":{"en":"a hairstyle with the sides of the head shaved and a strip of longer hair down the middle, often worn upright","zh":"“莫霍克头”（一种发型：两侧剃短/剃光，中间留一条较长的头发，常竖起）"},"examples":[{"en":"He got a mohawk haircut before the concert.","zh":"他在演唱会前剪了个莫霍克头。"},{"en":"In punk fashion, a mohawk is often styled with gel to stand up.","zh":"在朋克风格里，莫霍克头常用发胶把中间的头发定型竖起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mohawk people, their language, or their culture","zh":"莫霍克族的；与莫霍克语或莫霍克文化有关的"},"examples":[{"en":"They attended a Mohawk cultural event.","zh":"他们参加了一场莫霍克文化活动。"}]}],"synonyms":["Haudenosaunee (related term)","mohawk haircut","mohican (often confused term)"],"phonetic":"/ˈmoʊˌhɔk/","extraExplanation":["“mohawk（发型）”这个用法在英语里很常见，但它与原住民族名称相同。使用时在语境上要注意尊重：谈论民族/语言/文化时尽量具体、准确；谈发型时则通常是中性描述。","关于“发型名称从何而来”在不同来源中说法不一；现代大众语境里它更多与朋克文化的造型相关，而不等同于真实的莫霍克传统发式。"]}
{"word":"mohawk","summary":{"en":"Mohawk most commonly means a mohawk hairstyle; it can also refer to the Mohawk people or their language.","zh":"Mohawk 最常指“莫霍克头”这种发型；也可指莫霍克族或莫霍克语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hairstyle with a strip of hair left long down the middle of the head (often standing up), with the sides shaved or cut very short","zh":"莫霍克头（中间留一条较长的头发，常竖起，两侧剃光或剪得很短的发型）"},"examples":[{"en":"He showed up with a bright green mohawk for the concert.","zh":"他为了音乐会顶着一头亮绿色的莫霍克头出现。"},{"en":"In some punk scenes, a mohawk became a symbol of rebellion.","zh":"在一些朋克圈子里，莫霍克头成了反叛的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Mohawk Nation, one of the Haudenosaunee (Iroquois) peoples of North America","zh":"莫霍克族人（北美豪登诺绍尼／易洛魁联盟的民族之一）"},"examples":[{"en":"She learned about Mohawk history in a course on Indigenous nations.","zh":"她在一门关于原住民民族的课程中学习了莫霍克族的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mohawk language","zh":"莫霍克语"},"examples":[{"en":"The community offers classes to help children learn Mohawk.","zh":"社区开设课程帮助孩子学习莫霍克语。"}]}],"synonyms":["mohican (hairstyle)","punk cut (informal)"],"phonetic":"/ˈmoʊhɔk/","extraExplanation":["“Mohawk”作发型名时，英语里也常叫“mohican”（尤其在英式用法里），与电影《The Last of the Mohicans（最后的莫希干人）》带来的文化联想有关；但“Mohican（莫希干族）”与“Mohawk（莫霍克族）”是不同的原住民族群。把发型直接等同于某个族群有时会引发文化误解，较尊重的表达是明确说“a mohawk hairstyle”。","作民族名时常大写 Mohawk；作发型名时多写作小写 mohawk（但在标题或品牌名中可能仍大写）。"]}
{"word":"mohawkian","summary":{"en":"Mohawkian means “related to the Mohawk people/culture/language,” and is sometimes used in linguistics for Mohawk and its closest relatives (often the Mohawk–Oneida subgroup).","zh":"Mohawkian 指“与莫霍克族/其文化或语言有关”，在语言学中有时也指莫霍克语及其最近亲的相关语言（常指莫霍克—奥奈达亚群）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the Mohawk people (Kanienʼkehá꞉ka), their culture, or their language.","zh":"与莫霍克族（Kanienʼkehá꞉ka）及其文化或语言有关的。"},"examples":[{"en":"The museum worked with Mohawk community members to ensure the exhibit was truly Mohawkian in perspective.","zh":"博物馆与莫霍克社区成员合作，确保展览真正体现莫霍克人的视角（具有 Mohawkian 的观点）。"},{"en":"She’s doing research on Mohawkian place names in northern New York.","zh":"她正在研究纽约州北部与莫霍克相关（Mohawkian）的地名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Related to Mohawk and closely related languages within the Northern Iroquoian family (often treated as the Mohawk–Oneida subgroup).","zh":"（语言学）与北易洛魁语族中的莫霍克语及其近亲语言有关（常被视为“莫霍克—奥奈达”亚群）。"},"examples":[{"en":"The paper compares Mohawkian and Seneca verb morphology.","zh":"这篇论文比较了莫霍克语支相关语言（Mohawkian）与塞内卡语的动词构词。"},{"en":"Some sources group Mohawk and Oneida together as a Mohawkian subgroup.","zh":"一些资料把莫霍克语和奥奈达语归为同一莫霍克语支相关（Mohawkian）的亚群。"}]}],"synonyms":["Mohawk","Mohawk-related","Kanienʼkehá꞉ka-related"],"phonetic":"/moʊˈhɔːkiən/","extraExplanation":["“Mohawkian”在日常英语里比较少见，更常用的是“Mohawk”（如 Mohawk culture / Mohawk language / Mohawk community）。如果你是在写作或学术语境中想表达“与莫霍克相关”，用“Mohawk”通常更自然；用“Mohawkian”则显得更书面或更强调“带有莫霍克视角/特征”。","涉及原住民群体时，表达上尽量具体、尊重：例如用“Mohawk people / Mohawk Nation / Kanienʼkehá꞉ka”，并避免把“Mohawkian”只理解成发型或朋克符号（那是“mohawk (hairstyle)”这一不同词义）。"]}
{"word":"mohawkite","summary":{"en":"Mohawkite is a rare copper–arsenic ore/rock mixture (often in quartz), originally from Michigan’s Mohawk Mine, sometimes cut and polished for jewelry.","zh":"Mohawkite 指一种罕见的铜—砷矿石/岩石混合物（常与石英共生），源自密歇根州 Mohawk 矿，有时会被切磨用于首饰装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare copper–arsenic ore/rock mixture (a metallic mass, often in white quartz) originally found at the Mohawk Mine on Michigan’s Keweenaw Peninsula; it can include copper arsenides such as domeykite and algodonite, sometimes with other metals.","zh":"一种罕见的铜—砷矿石/岩石混合物（常呈金属光泽团块，常包裹在白色石英中），最早发现于美国密歇根州基威诺半岛的 Mohawk 矿；常含铜砷化物（如 domeykite、algodonite），有时还混有其他金属。"},"examples":[{"en":"The collector bought a polished piece of mohawkite set in quartz.","zh":"这位收藏家买了一块镶在石英中的抛光 mohawkite（莫霍克矿石）。"},{"en":"Mohawkite can show brassy yellow to gray colors with a bluish-green tarnish.","zh":"mohawkite 的颜色可从黄铜色到金属灰不等，表面有时会出现蓝绿色的氧化变色。"}]},{"partOfSpeech":"n.","definition":{"en":"(lapidary/jewelry) a decorative stone material made from mohawkite-bearing ore, cut and polished for cabochons or inlays (handle with care because of arsenic content).","zh":"（宝石加工/首饰）含 mohawkite 的装饰性矿石材料，可切磨成蛋面或镶嵌用材（因可能含砷，需谨慎处理）。"},"examples":[{"en":"The artisan used mohawkite for an inlay, but wore gloves while polishing it.","zh":"工匠用 mohawkite 做镶嵌，但在打磨时戴了手套。"},{"en":"That ring features a mohawkite cabochon with metallic gold and silver tones.","zh":"那枚戒指镶了一颗 mohawkite 蛋面，带有金银色的金属光泽。"}]}],"synonyms":["copper arsenide ore (general)","mohawk copper-arsenide mixture"],"phonetic":"/ˈmoʊ.hɔː.kaɪt/","extraExplanation":["Mohawkite 这个名字来自美国密歇根州基威诺半岛（Keweenaw Peninsula）的 Mohawk Mine（莫霍克矿）。它常被描述为“矿物/矿石”，但在矿物学上更准确地说，它被认为是多种铜—砷化物等矿物的“混合物”，因此曾作为独立矿物种的地位后来被否定（discredited）。([en.wikipedia.org](https://en.wikipedia.org/wiki/Mohawkite?utm_source=openai))","因为可能含砷（arsenic），加工或打磨时不建议吸入粉尘；若用于首饰或收藏，务必注意安全与规范处理。([en.wikipedia.org](https://en.wikipedia.org/wiki/Mohawkite?utm_source=openai))"]}
{"word":"mohawks","summary":{"en":"Mohawks most commonly means the mohawk hairstyle; it can also mean the Mohawk people (an Indigenous nation).","zh":"mohawks 最常指“莫霍克头”这种发型；也可以指“莫霍克人”（北美原住民族之一）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hairstyle with the sides of the head shaved (or cut very short) and a strip of longer hair left in the middle, often worn upright","zh":"（发型）两侧剃光或剪得很短，中间留一条较长的头发，常常竖起的“莫霍克头 / 鸡冠头”"},"examples":[{"en":"He showed up with a bright green mohawk for the concert.","zh":"他为了演唱会顶着一撮亮绿色的莫霍克头出现了。"},{"en":"Her mohawk was styled into sharp spikes.","zh":"她的莫霍克头被做成了尖尖的刺状。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Mohawk people, an Indigenous nation originally from the northeastern part of North America","zh":"（族群）莫霍克人（北美东北部的原住民族之一）"},"examples":[{"en":"He is Mohawk and is learning the language from his grandparents.","zh":"他是莫霍克人，正在跟祖父母学习族语。"},{"en":"Mohawk communities have a long history in the region.","zh":"莫霍克社群在这一地区有着悠久的历史。"}]}],"synonyms":["Mohawk haircut","mohawk hairstyle","spiked strip haircut"],"phonetic":"/ˈmoʊˌhɔk/","extraExplanation":["“mohawk”作发型名称时，在日常英语里非常常见；但它也指莫霍克族（Mohawk people）。在正式或尊重文化语境中，谈到族群时通常会大写 Mohawk；谈发型时常写作 mohawk / Mohawk haircut。也有人更偏好用更中性的说法（如 “strip hairstyle” 或直接说 “Mohawk haircut”）来避免把族群名称过度标签化。"]}
{"word":"mohegan","summary":{"en":"Mohegan refers to a Native American people from present-day southeastern Connecticut, their traditional language, or something related to their culture.","zh":"Mohegan 指莫希干人（美国康涅狄格州一带的原住民部族）、莫希干语，或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people originally from what is now southeastern Connecticut (U.S.).","zh":"（莫希干人）美国原住民部族之一，历史上主要居住在今美国康涅狄格州东南部一带。"},"examples":[{"en":"The Mohegan have a long history in New England.","zh":"莫希干人在新英格兰地区有悠久的历史。"},{"en":"She visited a museum exhibit about Mohegan culture and traditions.","zh":"她参观了一个关于莫希干文化与传统的博物馆展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language traditionally spoken by the Mohegan people (sometimes grouped with closely related Algonquian languages).","zh":"（莫希干语）莫希干人传统使用的原住民语言（有时与近亲的阿尔冈昆语系语言一起讨论）。"},"examples":[{"en":"The class introduced a few Mohegan words and their meanings.","zh":"课程介绍了几个莫希干语词汇及其含义。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mohegan people, their language, or their culture.","zh":"莫希干人的；与莫希干语言或文化相关的。"},"examples":[{"en":"They attended a Mohegan cultural event.","zh":"他们参加了一个莫希干文化活动。"},{"en":"The museum displayed Mohegan artifacts.","zh":"博物馆展出了莫希干人的文物。"}]}],"synonyms":["Mohegan people","Mohegan language"],"phonetic":"/moʊˈhiːɡən/","extraExplanation":["“Mohegan”在美国日常语境里也常指与莫希干部族相关的现代机构或品牌名，例如“Mohegan Sun”（度假赌场综合体的名称），这属于专有名词用法。","学习时要注意不要和“Mahican / Mohican（马希干人）”混淆：两个词拼写和发音相近，历史与地理背景也不同，但在流行文化里常被混用。"]}
{"word":"mohel","summary":{"en":"A mohel is the person in Judaism who performs ritual circumcision, typically during a brit milah.","zh":"mohel 指犹太教中在割礼仪式（brit milah）里施行宗教性割礼的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Judaism, a person (often specially trained) who performs the ritual circumcision of a baby boy, usually as part of the brit milah ceremony.","zh":"（犹太教）行割礼者；在“割礼仪式（brit milah）”中为男婴施行宗教性包皮环切的人（通常受过专门训练）。"},"examples":[{"en":"The family invited a mohel to perform the brit milah on the eighth day after the baby was born.","zh":"家人请来一位 mohel，在婴儿出生后的第八天为他主持割礼仪式。"},{"en":"In many communities, the mohel is also trained to follow medical safety practices.","zh":"在许多社群中，mohel 也会接受培训，以遵循医疗安全规范。"}]}],"synonyms":["ritual circumciser"],"phonetic":"/ˈmoʊhɛl/","extraExplanation":["mohel（复数常写作 mohalim 或 mohels）是犹太宗教与文化语境中特定的角色，通常与“brit milah（割礼仪式）”一起出现。谈论该词时，注意它涉及宗教传统与身体医疗话题，表达上宜保持尊重与中性措辞。","词源来自希伯来语，常见发音在美式英语里重音在第一音节（MOH-hel）。"]}
{"word":"mohelim","summary":{"en":"Mohelim are trained Jewish practitioners who perform ritual circumcision (brit milah).","zh":"Mohelim 指受训的犹太传统执行者，负责进行宗教割礼仪式（brit milah）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **mohel**: a trained Jewish person who performs the ritual circumcision (**brit milah**) for a baby boy.","zh":"**mohel** 的复数：受过训练、在犹太传统中为男婴进行宗教割礼仪式（**brit milah**）的人。"},"examples":[{"en":"The family invited two **mohelim** to discuss the ceremony and answer questions.","zh":"这家人邀请了两位 **mohelim** 来讨论仪式并回答问题。"},{"en":"In some communities, experienced **mohelim** are well known and often recommended by families.","zh":"在一些社区里，经验丰富的 **mohelim** 很有名，常常被家庭推荐。"}]}],"synonyms":["mohels","ritual circumcisers"],"phonetic":"/ˈmoʊhɛlɪm/","extraExplanation":["“mohelim”来自希伯来语/意第绪语传统用法，是“mohel”的复数形式。单数是 **mohel**，复数常写作 **mohelim**（也可见到拼写变体）。","该词多出现在犹太宗教与文化语境中（如 brit milah）。谈论时通常保持尊重与中性表达；如果是在医学或公共场合语境，也可能会用更一般的说法如 “ritual circumciser”（但“mohel”更具体、也更常用）。"]}
{"word":"mohels","summary":{"en":"Mohels means more than one mohel—people trained to perform Jewish ritual circumcisions (brit milah).","zh":"Mohels 是 mohel 的复数，指受训执行犹太教割礼仪式（brit milah）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **mohel**: people trained to perform **brit milah**, the Jewish ritual circumcision ceremony.","zh":"**mohel** 的复数：受过训练、负责执行 **brit milah（犹太教割礼仪式）** 的人。"},"examples":[{"en":"The family invited two **mohels** and chose the one they felt most comfortable with.","zh":"这家人请来了两位 **mohels（割礼执行者）**，最后选了让他们最放心的一位。"},{"en":"In some communities, **mohels** receive both religious and medical training.","zh":"在一些社群里，**mohels** 会同时接受宗教与医学方面的训练。"}]}],"synonyms":["circumcisers","ritual circumcisers"],"phonetic":"/ˈmɔɪ.əlz/","extraExplanation":["“mohels” 是英文名词复数，单数是 **mohel**。在犹太传统中，**brit milah（也常拼作 bris）** 通常在男婴出生后第八天举行，由受训的 mohel 执行仪式与相关祝福。","你也可能在拼字游戏（如 Scrabble）里看到 **MOHELS**：它通常被标注为 **mohel 的复数**。","在宗教语境中，这个词有时也会出现不规则复数形式 **mohalim / mohelim**（源自希伯来语/意第绪语的用法）。"]}
{"word":"mohican","summary":{"en":"Mohican refers to a member of the Mohican (Mahican) Native American people or their language; it’s also used in the phrase “the last of the Mohicans” to mean the last remaining one of a disappearing group.","zh":"Mohican 指莫希干（Mahican）原住民民族成员或其语言；也常用于短语“the last of the Mohicans”，比喻某个逐渐消失群体中的“最后一个/最后一批”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mohican (Mahican) people, a Native American nation historically from the Hudson River Valley area (around present-day New York and nearby regions)","zh":"莫希干（也常写作 Mahican）人：历史上主要居住在哈德逊河流域（今纽约州及周边）的美洲原住民民族成员"},"examples":[{"en":"The exhibit includes Mohican baskets and tools from the 18th century.","zh":"展览包括18世纪的莫希干编篮和工具。"},{"en":"She is researching Mohican history and community life.","zh":"她正在研究莫希干人的历史与社区生活。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mohican (Mahican) language","zh":"莫希干语（莫希干/玛希坎语）"},"examples":[{"en":"A few recordings preserve Mohican words and pronunciation.","zh":"一些录音保存了莫希干语的词汇与发音。"}]},{"partOfSpeech":"phrase","definition":{"en":"(often in the phrase “the last of the Mohicans”) the last person or thing of a group that is disappearing or becoming rare","zh":"（常见于短语“the last of the Mohicans”）某个逐渐消失/日渐稀少群体中的“最后一个/最后一批”"},"examples":[{"en":"He joked that he was the last of the Mohicans who still wrote letters by hand.","zh":"他开玩笑说，自己是仍然手写信件的“最后一批人”。"},{"en":"That bookstore feels like the last of the Mohicans in the neighborhood.","zh":"那家书店在这个社区里像是“硕果仅存”的老店。"}]}],"synonyms":["Mahican","the last remaining one","the last of its kind"],"phonetic":"/moʊˈhiːkən/","extraExplanation":["“Mohican”在美国文化中常因小说与电影《The Last of the Mohicans（最后的莫希干人）》而被熟知，因此也引申出“最后的……、仅存的……”的比喻用法。","注意拼写与族名：Mohican 常与 Mohegan（莫希根）混淆；它们是不同的原住民群体（虽然历史上都在美国东北地区活动）。在正式写作中，若谈历史民族，常见写法也包括 Mahican。","使用比喻“the last of the Mohicans”时，最好避免把它用在真实的原住民群体上当作玩笑；更适合用来形容某种习惯、行业或事物“日渐稀少”。"]}
{"word":"mohineyam","summary":{"en":"“mohineyam” is most likely a misspelling/variant of **Mohiniyattam**, a classical dance from Kerala meaning “dance of the enchantress.”","zh":"“mohineyam” 很可能是 **Mohiniyattam（莫希尼亚坦舞）** 的误拼或转写变体，常被解释为“魅惑者之舞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A likely misspelling or variant romanization of **Mohiniyattam** (also spelled Mohiniattam), a classical Indian dance form from Kerala; the name is commonly explained as meaning “dance of the enchantress,” from *Mohini* (an enchanting female form in Hindu mythology) + *aattam/attam* (“dance” or “graceful movement”).","zh":"很可能是 **Mohiniyattam / Mohiniattam（莫希尼亚坦舞）** 的拼写或转写变体：印度喀拉拉邦的古典舞蹈之一。其名称常被解释为“魅惑仙女之舞/妖娆者之舞”，来自 *Mohini*（印度神话中具有迷惑力的女性形象）+ *aattam/attam*（“舞蹈/优雅的动作”）。"},"examples":[{"en":"She studied Mohiniyattam, a classical dance tradition from Kerala.","zh":"她学习了 Mohiniyattam（喀拉拉邦的古典舞传统）。"},{"en":"The performance highlighted the soft, flowing style that Mohiniyattam is known for.","zh":"这场演出突出了 Mohiniyattam 以柔美、流动感著称的风格。"}]},{"partOfSpeech":"adj.","definition":{"en":"In some informal contexts, a romanized form like **mohiniyam / mohineyam** may be used more loosely to mean “enchanting” or “charming,” by association with *Mohini* (“enchantress”).","zh":"在一些非正式用法中，类似 **mohiniyam / mohineyam** 的拉丁转写有时会被更宽泛地用来表示“迷人/魅惑”，借自 *Mohini*（“魅惑者/仙女”）的联想。"},"examples":[{"en":"The singer’s voice felt mohiniyam—soft, sweet, and captivating.","zh":"这位歌手的嗓音很 mohiniyam——柔和、甜美、很抓人。"}]}],"synonyms":["Mohiniyattam","Mohiniattam"],"phonetic":"/moʊˌhɪniˈjɑːtəm/","extraExplanation":["“mohineyam”并不是英语里的常见词条，更像是南亚语言（尤其与喀拉拉邦/马拉雅拉姆语文化相关）的拉丁字母转写；不同人会写成 Mohiniyattam / Mohiniattam / mohiniyam 等。","Mohiniyattam 通常被介绍为印度“八大古典舞”之一，源自喀拉拉邦；名称常拆解为 Mohini（神话中的魅惑女性形象）+ aattam/attam（舞/动作），所以常见释义是“魅惑者之舞”。","如果你能告诉我你是在什么场景看到的（歌曲歌词、舞蹈名、电影台词、还是人名/网名），我可以把拼写、准确含义和更自然的英文表达帮你对齐。"]}
{"word":"mohism","summary":{"en":"Mohism is a Chinese philosophy founded by Mozi that promotes impartial care, practical benefit for society, and opposition to aggressive war.","zh":"墨家（Mohism）是墨子创立的中国哲学，主张兼爱、重视社会整体利益，并反对侵略战争。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Chinese philosophical and ethical tradition founded by Mozi (Mo Tzu), emphasizing “impartial care” (treating people fairly), opposition to aggressive war, and practical, merit-based governance.","zh":"中国先秦时期由墨子（Mozi）创立的哲学与伦理传统，强调“兼爱”（公平关怀他人）、反对侵略战争，以及务实、尚贤（任人唯贤）的治理理念。"},"examples":[{"en":"Mohism argues that rulers should promote policies that benefit the most people, not just the powerful.","zh":"墨家认为统治者应推行让最多人受益的政策，而不只是照顾权贵。"},{"en":"In Chinese philosophy, Mohism is often contrasted with Confucianism on issues like ritual and social hierarchy.","zh":"在中国哲学中，墨家常与儒家对比，尤其在礼仪与社会等级等问题上。"}]},{"partOfSpeech":"n.","definition":{"en":"The body of teachings, texts, and followers associated with the Mohist school.","zh":"与墨家学派相关的一整套思想、典籍与追随者（墨者）体系。"},"examples":[{"en":"Some chapters of the Mozi preserve early discussions of logic and argumentation within Mohism.","zh":"《墨子》的一些篇章保留了墨家关于逻辑与论证的早期讨论。"}]}],"synonyms":["Mohist philosophy","the Mohist school"],"phonetic":"/ˈmoʊ.ɪzəm/","extraExplanation":["“Mohism”来自“Mozi（墨子）+ -ism（……主义）”。墨家活跃于战国时期，常以务实、重结果著称。","墨家核心观念之一是“兼爱”（可理解为不偏私的关怀/普遍关爱），并主张“非攻”（反对侵略战争）、“尚贤”（以才能与品德选拔人才）、“节用/节葬”（节俭、反对奢侈与厚葬）。","历史上墨者也以守城与工程技术闻名：典籍与传说中常描写他们帮助弱小国家防御侵略，体现其“非攻”的实践取向。"]}
{"word":"mohnseed","summary":{"en":"Mohnseed means “poppy seed,” especially in contexts influenced by German or Central/Eastern European cuisine.","zh":"mohnseed 指“罂粟籽”，多见于受德语或中欧/东欧饮食文化影响的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"poppy seed; the small edible seed of the poppy plant, used in cooking and baking.","zh":"罂粟籽；罂粟植物的小型可食用种子，常用于烹饪和烘焙。"},"examples":[{"en":"She sprinkled mohnseed on top of the bread before baking.","zh":"她在烤之前把罂粟籽撒在面包表面。"},{"en":"This pastry has a sweet mohnseed filling.","zh":"这款点心里面有甜的罂粟籽馅。"}]}],"synonyms":["poppy seed","poppyseed"],"phonetic":"ˈmoʊnˌsid","extraExplanation":["“mohnseed”比较少见，更常见的写法是 **poppy seed / poppyseed**。它来自德语 **Mohn**（罂粟）+ seed（种子），在中欧/东欧烘焙里很常见（例如用作馅料或撒在面包表面）。","文化与实用提示：食用罂粟籽通常是合法的、也不会让人“上瘾”，但在少数情况下可能含极微量生物碱，曾有报道会对某些药检造成影响；如果你有药检或职业规定，最好提前确认相关规则。"]}
{"word":"moho","summary":{"en":"Moho is the geological boundary between Earth’s crust and mantle (short for the Mohorovičić discontinuity).","zh":"Moho 指地壳与地幔之间的地质分界面（莫霍洛维奇不连续面的简称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) The boundary between Earth’s crust and the mantle, identified by a sudden change in seismic-wave speed; short for the “Mohorovičić discontinuity.”","zh":"（地质）地壳与地幔之间的分界面，因地震波速度在此处突然变化而被识别；“莫霍洛维奇不连续面（莫霍面）”的简称。"},"examples":[{"en":"Scientists used earthquake data to estimate the depth of the Moho beneath the mountain range.","zh":"科学家利用地震数据估算这座山脉下方莫霍面的深度。"},{"en":"Oceanic crust is thinner, so the Moho is usually closer to the seafloor than it is under continents.","zh":"海洋地壳更薄，因此莫霍面通常比在大陆之下更靠近海底。"}]}],"synonyms":["Mohorovičić discontinuity","crust–mantle boundary"],"phonetic":"/ˈmoʊhoʊ/","extraExplanation":["“Moho”来自克罗地亚地震学家 Andrija Mohorovičić（安德里亚·莫霍洛维契奇）的姓氏。他在1909年通过分析地震波记录发现：地震波在地下某一深度会突然加速，从而推断地壳与地幔之间存在明显边界。","在科普或课堂中，人们常直接说“the Moho”，相当于说“地壳—地幔边界”。它不是一条可直接“看见”的线，而是用地震波等地球物理方法“推出来”的结构界面。"]}
{"word":"mohock","summary":{"en":"mohock is an old, rare spelling linked to “Mohocks,” meaning a violent night ruffian; it can also be a misspelling/variant of Mohawk.","zh":"mohock 是较少见的旧拼法，常与“Mohocks”相关，指夜间施暴的恶少/流氓；也可能只是 Mohawk 的异拼或误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a violent, drunken young ruffian (especially in early-18th-century London), associated with the so-called “Mohocks” who attacked people at night","zh":"（尤指18世纪初伦敦）夜间滋事、酗酒施暴的纨绔恶少；常指传说中的“Mohocks”那类人"},"examples":[{"en":"Newspapers warned people not to walk home alone at night because of the Mohocks.","zh":"报纸警告人们夜里不要独自走路回家，以免遇到“Mohocks”那样的滋事者。"},{"en":"In that old satire, the rich boys behave like Mohocks, turning cruelty into entertainment.","zh":"在那篇旧讽刺作品里，那些富家子弟像“Mohocks”一样，把残忍当成娱乐。"}]},{"partOfSpeech":"n.","definition":{"en":"a variant spelling of Mohawk (the Native nation/language; also the hairstyle), though this spelling is uncommon today","zh":"Mohawk 的异拼（指莫霍克族/语言；也可指“莫霍克发型”），但如今很少这样拼"},"examples":[{"en":"Did you mean “Mohawk” (the people or the hairstyle) instead of “mohock”?","zh":"你想写的是“Mohawk”（族名或发型）而不是“mohock”吗？"}]}],"synonyms":["ruffian","hooligan","thug","lout","rake"],"phonetic":"/ˈmoʊhɑk/","extraExplanation":["“Mohock/Mohocks”最常见于历史语境：指1712年前后伦敦流传的一类“夜间结伙施暴的上层青年”。很多记载带有当时小报与传闻的夸张色彩，但这个词因此变成“恶少、流氓”的标签。","需要文化敏感：这一用法的名称来自 Mohawk（莫霍克族）这一族名，属于把原住民名称拿来当“野蛮/暴力”象征的历史用法。现代写作中如果只是指族群或发型，建议用标准拼写“Mohawk”。"]}
{"word":"mohockism","summary":{"en":"Mohockism means violent ruffian behavior, named after the early-1700s London “Mohocks.”","zh":"Mohockism 指暴力流氓式滋事行为，名称源自18世纪初伦敦传闻的“Mohocks”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"violent street-ruffian behavior, especially like that of the “Mohocks,” a notorious (possibly exaggerated) gang of well-born young men who attacked people in London in the early 1700s","zh":"（尤指仿效“Mohocks”之类的）街头暴力滋事行为；流氓式的恶行（常指18世纪初伦敦的暴力闹事风潮）"},"examples":[{"en":"Newspapers of the time warned the public about nightly attacks and the spread of mohockism.","zh":"当时的报纸警告民众夜间袭击事件频发，mohockism（暴力滋事风气）正在蔓延。"},{"en":"The play uses mohockism as a symbol of rich young men abusing power without consequences.","zh":"这部戏把 mohockism 当作“富家子弟滥用权势且不必承担后果”的象征。"}]}],"synonyms":["hooliganism","thuggery","street violence","ruffianism","rowdyism"],"phonetic":"/ˈmoʊˌhɑːkɪzəm/","extraExplanation":["这个词来自 *Mohocks*（“莫霍克帮/莫霍克党”），指18世纪初（约1711–1712年前后）伦敦街头被传闻的一群上层年轻人夜间袭击路人的风潮。","需要注意文化敏感性：*Mohocks* 这个名称是对 *Mohawk*（莫霍克族，北美原住民族群名）的变体借用，当时的英国社会把“美洲部族名”当作“野蛮/暴力”的标签使用，与真实的莫霍克族文化没有直接对应关系，带有殖民时期的刻板印象色彩。"]}
{"word":"mohoohoo","summary":{"en":"“Mohoohoo” isn’t standard English; it’s usually a made-up sound/misspelling (often of “woohoo”). Online, it can also appear as a vulgar adult slang term.","zh":"“mohoohoo”不是标准英语词，通常是乱拼/拟声或把“woohoo”拼错；在网络上也可能被用作粗俗的成人向俚语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often it’s just a made-up/typed sound or a misspelling of a similar word (like “woohoo”).","zh":"不是标准英语单词。多数情况下只是随手打出来的拟声/乱拼，或是把类似词（如“woohoo”）拼错了。"},"examples":[{"en":"I can’t find “mohoohoo” in a normal dictionary—what context did you see it in?","zh":"在一般词典里找不到“mohoohoo”——你是在哪种语境里看到的？"},{"en":"If you meant “woohoo,” it’s a cheer people say when they’re excited.","zh":"如果你想写的是“woohoo”，它表示兴奋时的欢呼。"}]},{"partOfSpeech":"other","definition":{"en":"(Internet slang, vulgar/adult) A term found in Urban Dictionary: a pubic-hair style shaped like a mohawk (a “landing strip” style). Not commonly used in everyday conversation.","zh":"（网络俚语，粗俗/成人向）在 Urban Dictionary 上出现的说法：指把阴毛修成“莫霍克头”（中间一条、两侧剃短的“落地跑道/landing strip”风格）。日常对话中并不常见。"},"examples":[{"en":"That word can be vulgar online, so it’s better to avoid using it in polite settings.","zh":"这个词在网上可能带粗俗含义，所以正式/礼貌场合最好别用。"},{"en":"If someone uses it as a joke, they’re likely referring to an adult slang meaning.","zh":"如果有人拿它开玩笑，多半是在指成人向的俚语含义。"}]}],"synonyms":["woohoo"],"phonetic":"/moʊˌhuːˈhuː/","extraExplanation":["这个拼法在主流英语词典里基本查不到；它更像是随手打出来的声音，或把“woohoo”（兴奋时的欢呼）拼错了。","另外它在 Urban Dictionary 上有成人向、较粗俗的释义；这种来源不代表“标准用法”，但确实可能在某些网络语境里被拿来开黄腔。","如果你告诉我它出现的句子/平台（聊天、游戏、歌词、评论区等），我可以帮你判断你看到的到底是哪一种意思。"]}
{"word":"mohos","summary":{"en":"**Mohos** usually means the plural of **Moho**, the boundary between Earth’s crust and mantle; it can also refer to the extinct Hawaiian bird genus *Moho* or be a surname.","zh":"**Mohos** 通常是 **Moho** 的复数，指地壳与地幔的分界面；也可能指已灭绝的夏威夷鸟类属 *Moho*，或作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **Moho**: the boundary between Earth’s crust and mantle (short for the *Mohorovičić discontinuity*).","zh":"**Moho** 的复数：指地球**地壳与地幔之间的分界面**（*莫霍洛维奇不连续面* 的简称）。"},"examples":[{"en":"Seismologists used earthquake waves to estimate the depths of the **Mohos** beneath different regions.","zh":"地震学家利用地震波来估算不同地区下方 **Mohos** 的深度。"},{"en":"Maps show that the **Mohos** are much shallower under oceans than under continents.","zh":"地图显示海洋下方的 **Mohos** 通常比大陆下方更浅。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, proper noun) plural of **Moho**: the extinct Hawaiian bird genus *Moho* (Hawaiian honeyeaters).","zh":"（较少见，专有名词）**Moho** 的复数：指已灭绝的夏威夷鸟类属 *Moho*（夏威夷吸蜜鸟类之一类）。"},"examples":[{"en":"The **Mohos** are often discussed in studies of human-driven extinctions on islands.","zh":"在关于人类活动导致岛屿物种灭绝的研究中，经常会提到 **Mohos**。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), e.g., **Mohos** (Hungarian).","zh":"姓氏：**Mohos**（如匈牙利姓）。"},"examples":[{"en":"In the program, **Mohos** appears as the speaker’s last name.","zh":"在节目单里，**Mohos** 作为演讲者的姓氏出现。"}]}],"synonyms":["Mohorovičić discontinuities (for the geology sense)","crust–mantle boundary (for the geology sense)"],"phonetic":"/ˈmoʊhoʊz/","extraExplanation":["“Moho”是地质学里非常常见的简称，来自克罗地亚地震学家 Andrija Mohorovičić 的姓。英语里复数通常直接加 -s 变成 **Mohos**。","如果你其实想查的是 **mojos**（“魔力 / 魅力 / 好运”）或 **Mohs**（莫氏硬度 / 莫氏手术），告诉我你所在的语境（地质/医学/日常口语），我可以帮你对比区分。"]}
{"word":"mohr","summary":{"en":"Mohr is usually a surname, and it also appears in science/engineering terms like Mohr’s circle and the Mohr method.","zh":"Mohr 通常是姓氏，也常见于科学/工程术语中，如莫尔圆（Mohr’s circle）和莫尔法（Mohr method）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). In English-speaking contexts, it’s often pronounced like “more.”","zh":"姓氏（家族姓）。在英语语境中常读作类似“more”的发音。"},"examples":[{"en":"Dr. Mohr will present the results at the conference.","zh":"Mohr 医生将在会议上报告研究结果。"},{"en":"Her last name is Mohr.","zh":"她的姓是 Mohr。"}]},{"partOfSpeech":"other","definition":{"en":"A name used in technical terms, especially in engineering and chemistry (e.g., Mohr’s circle in mechanics; Mohr method in chemistry; Mohr salt).","zh":"用于技术术语中的名称，尤指工程与化学领域（如材料力学中的莫尔圆 Mohr’s circle；化学中的莫尔法 Mohr method；莫尔盐 Mohr salt）。"},"examples":[{"en":"We used Mohr’s circle to find the principal stresses.","zh":"我们用莫尔圆来求主应力。"},{"en":"The lab manual mentions the Mohr method for chloride titration.","zh":"实验手册提到用莫尔法进行氯离子滴定。"}]}],"phonetic":"/mɔr/","extraExplanation":["“Mohr”在工程/材料力学里最常见的是“Mohr’s circle（莫尔圆）”，用于把平面应力/应变的变换关系用图形方式表示，方便读出主应力、最大剪应力等。","在分析化学里，“Mohr method（莫尔法）”常指用硝酸银滴定氯离子、以铬酸盐作指示剂的一种经典方法；“Mohr salt（莫尔盐）”则是常见的亚铁铵硫酸盐（常用于标准溶液/还原剂）。","文化提示：在德语历史语境中，“Mohr”曾与“摩尔人/黑人”等旧称相关，带有时代性甚至可能引发不适；但在现代英语里你看到的“Mohr”通常只是姓氏或科学术语中的人名。"]}
{"word":"mohrodendron","summary":{"en":"Mohrodendron is a botanical genus name (often treated as a synonym of Halesia) for snowdrop trees in the storax family.","zh":"Mohrodendron 是植物学属名（常被视为 Halesia 的异名），指安息香科的雪铃树类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"**Mohrodendron**: a scientific (Latin) genus name for certain small trees in the storax family (**Styracaceae**), commonly known as **snowdrop trees**; in many modern classifications it is treated as a **synonym of _Halesia_**.","zh":"**Mohrodendron**：一个植物学（拉丁语）属名，指安息香科（**Styracaceae**）中一类常见名为**雪铃树 / 雪花树（snowdrop tree）**的小乔木；在不少较新的分类处理中常被视为 **_Halesia_（雪铃树属）** 的异名（同物异名）。"},"examples":[{"en":"_Mohrodendron carolinum_ is often listed today under the genus _Halesia_.","zh":"_Mohrodendron carolinum_ 现在常被归入 _Halesia_（雪铃树属）。"},{"en":"In older botany books, you may see the snowdrop tree called **Mohrodendron**.","zh":"在较早的植物学书籍里，你可能会看到雪铃树被称作 **Mohrodendron**。"}]}],"synonyms":["Halesia (in many classifications)"],"phonetic":"ˌmoʊroʊˈdɛndrən","extraExplanation":["这个词更像是“学名/属名”，日常英语里很少当普通词使用。","词源可拆成两部分理解：**Mohr**（纪念植物学家/药剂师 Carl Theodor Mohr） + 希腊语 **dendron**（“树”）。所以大意是“以 Mohr 命名的树”。","如果你是在文章或标本标签里看到它，通常是在谈某个物种（例如 _Mohrodendron carolinum_ / _M. dipterum_），而不是在讲一般意义上的“树”。"]}
{"word":"mohur","summary":{"en":"Mohur usually means a historic South Asian gold coin; in South Asian usage it can also mean a seal or official stamp.","zh":"Mohur 通常指南亚历史上的金币；在南亚语境中也可指“印章/官印”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic gold coin used in parts of South Asia (especially in Mughal India and later under some Indian states and the British period).","zh":"一种历史上的南亚金币（尤指莫卧儿印度时期，后来一些印度土邦及英属时期也使用）。"},"examples":[{"en":"The museum displayed a Mughal mohur alongside silver rupees.","zh":"博物馆展出了一枚莫卧儿时期的莫胡尔金币，旁边还有银卢比。"},{"en":"Collectors pay high prices for mohurs in good condition.","zh":"品相好的莫胡尔金币在收藏市场上价格很高。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia) a seal or official stamp; a signet.","zh":"（南亚用法）印章；官印；图章。"},"examples":[{"en":"The document needed the office mohur before it was valid.","zh":"文件需要盖上办公室的印章（mohur）才生效。"},{"en":"He pressed his mohur into the wax to mark the letter.","zh":"他把印章压进蜡封里，为信件作标记。"}]}],"synonyms":["gold coin","coin","seal","stamp","signet"],"phonetic":"/moʊˈhʊr/","extraExplanation":["“mohur”常见于历史、钱币学（numismatics）或南亚语境的英文资料中。它与“rupee（卢比）”等货币单位一起出现时，通常指一种高价值的金币。","该词也与波斯语/乌尔都语等语源有关，和“muhr/mehr（印章、封印）”同源或相关，因此在南亚英语里也能表示“印章、盖章”。具体含义往往要靠上下文判断：谈收藏、金银币=金币；谈文件、手续=印章。"]}
{"word":"mohurs","summary":{"en":"Mohurs is the plural of mohur: a historical gold coin from India (and parts of Persia), traditionally worth about 15 rupees.","zh":"mohurs 是 mohur 的复数形式：一种历史上的印度（及部分波斯地区）金币，传统上约值15卢比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A former gold coin used in India and parts of Persia (especially under Mughal and later British-era systems), traditionally valued at about 15 rupees.","zh":"（历史用语）莫霍尔金币：曾在印度及部分波斯地区（尤其莫卧儿时期及后来的英属体系中）流通的一种金币，传统上约等于15卢比。"},"examples":[{"en":"The merchant demanded payment in mohurs rather than silver rupees.","zh":"商人要求用莫霍尔金币付款，而不是银卢比。"},{"en":"The museum displayed a collection of Mughal mohurs from the 1600s.","zh":"博物馆展出了一批17世纪的莫卧儿莫霍尔金币。"}]}],"synonyms":["gold coin","historical coin"],"phonetic":"/ˈmoʊ.ər/","extraExplanation":["“mohurs”是复数形式；单数是“mohur”。","词源与波斯语 muhr（意为“印章/封印”）有关，因此在历史语境里它常让人联想到“带有王权印记的正式货币”。","现代英语里这个词不常用于日常支付场景，更常见于历史、钱币收藏（numismatics）或博物馆说明文字中。"]}
{"word":"mohwa","summary":{"en":"mohwa = a less common spelling of mahua, referring to the mahua tree or its flowers (often used as an ingredient).","zh":"mohwa 是 mahua 的较少见拼写，指 mahua 树或其花（常被采集用作食材/原料）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of **mahua**: a South Asian tree (Madhuca longifolia) and/or its sweet-smelling flowers.","zh":" **mahua** 的一种拼写变体：指南亚的一种树（学名 *Madhuca longifolia*，常见名 mahua），也可指它芳香、含甜味花朵。"},"examples":[{"en":"In some older English texts about India, you may see **mohwa** instead of **mahua**.","zh":"在一些较早的英文印度题材文本中，你可能会看到 **mohwa**，用来代替 **mahua**。"},{"en":"The forest was fragrant with **mohwa** blossoms in spring.","zh":"春天时，森林里弥漫着 **mohwa** 花的香气。"}]},{"partOfSpeech":"n.","definition":{"en":"the flowers of the mahua tree, especially when collected and used as an ingredient (for food or fermentation).","zh":"指采集下来的 mahua（mohwa）花，尤指作为食材或发酵原料使用的花。"},"examples":[{"en":"They dried **mohwa** flowers for later use.","zh":"他们把 **mohwa** 花晒干，留着之后用。"},{"en":"Some communities ferment **mohwa** to make a traditional drink.","zh":"一些社群会发酵 **mohwa** 来制作传统饮品。"}]}],"synonyms":["mahua","mohua"],"phonetic":"/ˈmoʊwə/","extraExplanation":["“mohwa”在现代通用英语里不算常见，更常见的拼写是 **mahua**（也会见到 **mohua**）。很多时候这是地区转写差异：同一种树/花在不同语言或罗马字拼写里会出现不同形式。","这种树在印度等地与民俗和日常生活联系很深：花有甜香，常被采集、晒干，用于食物、药用传统或发酵用途。读到“mohwa”时通常是在民族志、旅行记、殖民时期或较早的英文资料里。"]}
