{"word":"moi","summary":{"en":"“Moi” usually means “me/myself” (from French), often used jokingly in English; it can also be an abbreviation for “moment of inertia.”","zh":"“moi”通常源自法语，表示“我/我自己”，在英语中常带玩笑或“法式”语气；也可作“转动惯量（moment of inertia）”的缩写。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(from French) “me” or “myself”; used to emphasize the speaker or as the object form of “I.” In English it sometimes appears playfully to sound French.","zh":"（源自法语）“我/我自己”；用于强调说话者，或作“I”的宾格形式。在英语里有时会用来开玩笑，营造“法式”语气。"},"examples":[{"en":"‘Who, moi?’ he joked, pretending to be innocent.","zh":"“谁，我吗？”他开玩笑装无辜。"},{"en":"In French, “moi” can mean “me,” as in “c’est moi.”","zh":"在法语里，“moi”可表示“我/我”，例如“c’est moi（是我）”。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for “moment of inertia,” a physics term meaning how strongly an object resists rotational change.","zh":"“moment of inertia（转动惯量）”的缩写；物理学术语，指物体对转动变化的抗拒程度。"},"examples":[{"en":"The engineer calculated the MOI of the beam.","zh":"工程师计算了梁的转动惯量（MOI）。"}]}],"synonyms":["me","myself","MOI (moment of inertia)"],"phonetic":"/mwɑ/","extraExplanation":["在英语里单独写“moi”通常是借用法语来制造幽默或“装作很法式”的语气；正式场合更常用“me / myself”。","法语里“moi”常用于强调：例如“Moi, je pense que…”（至于我/我认为……），带有对比或强调意味。"]}
{"word":"moid","summary":{"en":"“Moid” is most commonly a derogatory internet slang word meaning “man.” It can also be a proper name/brand in some contexts.","zh":"“Moid”最常见的意思是贬义网络俚语，指“男人”。在一些语境中它也可能是人名或品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(internet slang, derogatory) A man—used to insult or dehumanize men, especially in some hostile online gender/dating communities.","zh":"（网络俚语，贬义）指“男人”，常用于辱骂或去人格化男性，尤其见于部分对立的网络性别/约会社群。"},"examples":[{"en":"Some posts use “moid” as a cheap insult instead of just saying “man.”","zh":"有些帖子会用“moid”当作低级的侮辱词，而不是直接说“man（男人）”。"},{"en":"I muted that account because it kept calling random guys “moids.”","zh":"我把那个账号静音了，因为它一直把路人男生叫“moids”。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name or brand name (e.g., a person named Moid or a company/label called MOID).","zh":"专有名词：人名或品牌名（例如名叫 Moid 的人，或名为 MOID 的公司/品牌）。"},"examples":[{"en":"Moid is used as a first name by some people.","zh":"Moid 也会被一些人用作名字。"},{"en":"I saw “MOID” on a clothing label—here it’s a brand name.","zh":"我在衣服标签上看到“MOID”——这里它是品牌名。"}]}],"synonyms":["man","guy","male"],"phonetic":"/mɔɪd/","extraExplanation":["“moid”作为俚语时语气很冲，常带有仇恨或挑衅色彩；在正式写作、课堂、职场沟通里不建议使用。","它的用法多出现在少数对立的网络亚文化里；如果你只是想表达“男人/男性”，更中性安全的词是 man / men, male（视语境而定）。","如果你是在某个具体语境（例如一条评论、视频字幕、游戏聊天）看到“moid”，把那句话贴出来我可以帮你判断它到底是在骂人、开玩笑，还是只是名字/品牌。"]}
{"word":"moider","summary":{"en":"Moider means (in dialect, mainly British) to confuse/bewilder someone, or to bother/distract them; it can also mean to ramble or act in a muddled way.","zh":"moider（方言，主要英式）指“把人搞糊涂/迷惑”，也可指“烦扰、打扰”；还可作不及物动词表示“迷迷糊糊地胡扯或乱转”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Dialect, mainly British) to confuse or bewilder someone; to throw someone into a mentally unsettled state.","zh":"（方言，主要为英式）使某人困惑、迷糊；把人搞得心神不宁。"},"examples":[{"en":"All those financial terms moidered me, so I had to ask again.","zh":"那些金融术语把我搞得一头雾水，所以我只好再问一遍。"},{"en":"Don’t try to moider him with too many instructions at once.","zh":"别一下子给他太多指令，把他弄糊涂了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Dialect, mainly British) to bother or distract someone, often by constant talk or fuss.","zh":"（方言，主要为英式）烦扰、打扰（常指喋喋不休或瞎折腾造成的干扰）。"},"examples":[{"en":"The kids kept moidering me while I was on a work call.","zh":"我在开工作电话时，孩子们一直来烦我。"},{"en":"Stop moidering her—she’s trying to concentrate.","zh":"别再烦她了——她在专心。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Dialect) to ramble confusedly or act in a muddled way; sometimes, to wander about aimlessly.","zh":"（方言）胡言乱语、迷迷糊糊地折腾；有时也指漫无目的地乱走。"},"examples":[{"en":"After the fever, he was moidering and didn’t recognize anyone.","zh":"发烧之后，他迷迷糊糊地胡言乱语，谁也认不出来。"},{"en":"I was moidering around the house, forgetting what I came in for.","zh":"我在家里迷迷糊糊地转来转去，忘了自己进来要干嘛。"}]}],"synonyms":["confuse","bewilder","perplex","bother","distract","fluster"],"phonetic":"/ˈmɔɪdər/","extraExplanation":["“moider”是比较少见的方言词，在现代标准英语里不常用；更常见的拼写变体是“moither”。在一些英式方言里，它既可以表示“把人搞糊涂/搞烦”，也可以作不及物动词表示“迷迷糊糊地胡扯、乱转”。","注意不要和“murder（谋杀）”混淆：因为某些口音（尤其是夸张的美式口音表演）里，“murder”有时会被戏谑地说成听起来像“moider”。但词义上它们完全不同。"]}
{"word":"moidore","summary":{"en":"Moidore is an old word for a historic Portuguese gold coin.","zh":"Moidore 是一个旧词，指历史上的葡萄牙金币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former Portuguese gold coin (also spelled **moydore**), used historically in Portugal and sometimes mentioned in older English literature","zh":"（旧称）葡萄牙旧时使用的金币（也拼作 **moydore**），在历史语境与较早的英文文学作品中偶尔出现"},"examples":[{"en":"In the novel, the sailor paid with a handful of moidores.","zh":"在小说里，那名水手用一把葡萄牙金币（moidore）付款。"},{"en":"The old chest was said to contain doubloons, guineas, and moidores.","zh":"那只旧箱子据说装着达布隆金币、几尼金币和葡萄牙金币（moidore）。"}]}],"synonyms":["moydore","Portuguese gold coin"],"phonetic":"/ˈmɔɪˌdɔr/","extraExplanation":["这个词在现代日常英语里非常少见，更多出现在历史、钱币收藏（numismatics）或文学作品的语境中。","词源一般认为来自葡萄牙语 **moeda de ouro**，字面意思是“金币”。","在英语文学中偶尔能见到（例如海盗/航海题材或18–19世纪作品中用来表现“财富、异国金币”的氛围）。"]}
{"word":"moidores","summary":{"en":"Moidores means “Portuguese gold coins” (plural of moidore), a historical term.","zh":"moidores 指“葡萄牙旧金币”（moidore 的复数），属于历史用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of moidore: an old Portuguese gold coin (also used in Portugal’s colonies, such as Brazil).","zh":"moidore 的复数：旧时葡萄牙的金币（也在葡萄牙殖民地如巴西等地流通）。"},"examples":[{"en":"In the novel, the pirate bragged about a chest filled with moidores.","zh":"在小说里，海盗吹嘘自己有一箱子 moidores（葡萄牙金币）。"},{"en":"Collectors study moidores to learn about Portugal’s early modern trade.","zh":"收藏家研究 moidores，以了解葡萄牙近代早期的贸易史。"}]}],"synonyms":["moydores"],"phonetic":"/ˈmɔɪˌdɔrz/","extraExplanation":["“Moidores” 是一个比较古旧/历史向的英语词，常见于历史文本、海盗题材作品或钱币学（numismatics）语境里；现代日常英语中很少用。","也常见拼写变体 **moydore(s)**。词源来自葡萄牙语 *moeda de ouro*，字面意思是“金币”。"]}
{"word":"moier","summary":{"en":"Moier is most commonly a surname or a place name, not a standard English vocabulary word.","zh":"Moier 通常是姓氏或地名，不是标准的英语常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); not a common English vocabulary word","zh":"（姓氏）“Moier”主要作为人名/姓氏出现，不是常见英语词汇"},"examples":[{"en":"Moier is a surname you may see in German-language or Baltic historical records.","zh":"Moier 这个姓氏可能会出现在德语地区或波罗的海地区的历史记录中。"},{"en":"The article mentions Johann Christian Moier as a person with this surname.","zh":"资料中提到 Johann Christian Moier 这一人物使用了这个姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (toponym), used for a small locality (Austria)","zh":"（地名）“Moier”也可作地名，用于奥地利的一个小地名/地区名"},"examples":[{"en":"Moier is listed as a locality connected to Sankt Josef in Styria, Austria.","zh":"Moier 被列为奥地利施泰尔马克州（Styria）Sankt Josef 相关的一个小地名。"}]}],"phonetic":"/ˈmɔɪ.ər/","extraExplanation":["“moier”看起来更像是专有名词（姓氏/地名），而不是英语常用词。德语维基条目把 Moier 解释为：一位人物（Johann Christian Moier）以及奥地利施泰尔马克州的一个地名。([de.wikipedia.org](https://de.wikipedia.org/wiki/Moier?utm_source=openai))","如果你其实想查的是 **moire / moiré**（常见于“布料的波纹效果”或“摩尔纹/干涉条纹”），那是另一个词，英语里更常用、也更容易在衣料、印刷或屏幕纹理语境中见到。([merriam-webster.com](https://www.merriam-webster.com/dictionary/moire?utm_source=openai))","你可以告诉我：你是在哪里看到“moier”的（人名、地址、还是布料/屏幕相关内容）？我可以帮你确认你想查的到底是哪一个词。"]}
{"word":"moiest","summary":{"en":"“Moistest” means “the most slightly wet” or, in food, “the softest/least dry.”","zh":"“moistest”表示“最湿润的/最潮湿的”；在食物里常指“最松软多汁、不干的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of **moist**: having the greatest amount of slight wetness (not dry, but not soaked).","zh":"**moist（微湿的）** 的最高级：表示“最湿润的 / 最潮湿的（但通常不是湿透）”。"},"examples":[{"en":"This corner of the garden is the **moistest**, so ferns grow well here.","zh":"花园的这个角落**最湿润**，所以蕨类植物在这里长得很好。"},{"en":"Keep the cake in an airtight container to make it stay the **moistest**.","zh":"把蛋糕放进密封盒里，能让它保持**最湿润**。"},{"en":"After the rain, the **moistest** soil is usually under the shade.","zh":"下雨后，**最潮湿**的土壤通常在阴凉处。"}]},{"partOfSpeech":"adj.","definition":{"en":"In cooking/food writing: having the softest, most tender, not-dry texture (often used positively).","zh":"在烹饪/美食语境中：口感**最松软、最多汁、不干**（通常是褒义）。"},"examples":[{"en":"For the **moistest** chicken, don’t overcook it.","zh":"想要鸡肉**最嫩最多汁**，就别把它煮过头。"},{"en":"Add a little yogurt for the **moistest** muffins.","zh":"加一点酸奶能让松饼变得**最松软湿润**。"}]}],"synonyms":["wettest","dampest","most humid","most tender (food)","juiciest (food)"],"phonetic":"/ˈmɔɪstɪst/","extraExplanation":["“moiest”一般是拼写错误或非标准拼写。标准拼写是 **moistest**（最湿润的）。","拼写规则小提示：以 **-st** 结尾的最高级直接加在形容词后（moist → moist**est**），不需要改 y 或双写字母。"]}
{"word":"moieter","summary":{"en":"Moiety means “one half” or, more generally, “a part/component” of something; it can also refer to one of two complementary social groups in anthropology.","zh":"Moiety 常指“一半”，也可泛指“部分/成分”；在人类学中还可指社会或部落中互补的两大分组之一（半族）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"one of two equal (or roughly equal) parts; half","zh":"（两等份之一）一半；半份"},"examples":[{"en":"She inherited a moiety of the property, while her brother inherited the other half.","zh":"她继承了这处财产的一半，而她哥哥继承了另一半。"},{"en":"Only a moiety of the budget was approved at first.","zh":"最初只批准了预算的一半。"}]},{"partOfSpeech":"n.","definition":{"en":"a part or component of something (often used in technical or scientific writing)","zh":"（整体中的）部分；组成成分（常见于技术或科学语境）"},"examples":[{"en":"In chemistry, a molecule can be described as having different functional moieties.","zh":"在化学中，一个分子可以被描述为由不同的官能“部分/基团”组成。"}]},{"partOfSpeech":"n.","definition":{"en":"one of two complementary social groups within a tribe or society (anthropology)","zh":"（人类学）社会/部落中互补的两大分组之一（氏族二分制中的“半族”）"},"examples":[{"en":"The community is organized into two moieties with different ceremonial roles.","zh":"这个社区被分成两个半族，在仪式中承担不同角色。"}]}],"synonyms":["half","portion","part","component","share"],"phonetic":"/ˈmɔɪ.ə.ti/","extraExplanation":["你输入的 **moieter** 不是常见的标准英语拼写；最接近且最常见的单词通常是 **moiety**（意为“一半/部分”）。","如果你其实想写的是 **moither**（英式英语口语，意思是“烦扰；使困惑；絮叨”），或德语 **Mieter**（“房客/租户”），告诉我你要哪个，我可以分别给出词条与例句。"]}
{"word":"moieties","summary":{"en":"Moieties are “two halves” or one half of something; the word is also used for social groups split into two parts and for parts of molecules in chemistry.","zh":"moieties 指“两半中的一半/两等份之一”；也可指被二分的社会群体中的一支，或（化学）分子中的某个结构片段/基团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of two equal parts of something (an older or formal use).","zh":"（较正式/较旧用法）一件事物的两等份之一。"},"examples":[{"en":"The estate was divided into two moieties, one for each sibling.","zh":"这份遗产被分成两等份，兄妹各得一份。"},{"en":"They agreed to split the profits into equal moieties.","zh":"他们同意把利润平均分成两份。"}]},{"partOfSpeech":"n.","definition":{"en":"A part or division of a group, especially when the group is split into two parts.","zh":"（尤指分成两部分时）群体的一部分/一支。"},"examples":[{"en":"The tribe was organized into two moieties with different ceremonial roles.","zh":"这个部落被组织成两个“半部族”，各自承担不同的仪式角色。"},{"en":"In some societies, marriage rules depend on a person’s moiety membership.","zh":"在一些社会中，婚姻规则取决于一个人属于哪一“半部族”。"}]},{"partOfSpeech":"n.","definition":{"en":"In chemistry, a specific part of a molecule (a functional group or structural unit).","zh":"（化学）分子中的某个特定部分（如官能团或结构单元）。"},"examples":[{"en":"This drug contains a sugar moiety that helps it dissolve in water.","zh":"这种药物含有一个糖基“基团”，有助于它溶于水。"},{"en":"Chemists modified the aromatic moiety to change the compound’s behavior.","zh":"化学家改变了芳香环“基团”，以改变该化合物的性质。"}]}],"synonyms":["half","one of two parts","portion","division","component","molecular fragment"],"phonetic":"/ˈmɔɪ.ə.ti/","extraExplanation":["“moiety”来自拉丁语，核心意思是“半、两份之一”。所以 moieties 常常暗示“分成两半”的结构（不一定永远严格相等，但典型含义是两等份）。","在人类学里，moiety 指把一个社会/氏族划分为两大“半部”，常与宗教仪式、婚配规则、身份认同等相关；中文有时会译作“半部族/二分制群体”。","在化学语境中，moiety 更像“分子片段/基团”的意思：它强调“这是分子里的哪一块”，而不强调是否正好占一半。"]}
{"word":"moiety","summary":{"en":"Moiety means a half share (especially in law or anthropology), or more generally a portion; in chemistry it means a distinct part of a molecule.","zh":"moiety 可指“一半/半份”（法律、人类学常用），也可泛指“部分”；在化学中指分子中的一个结构单元（基团）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of two equal parts of something (especially a share of property or an organization divided into two matching halves).","zh":"（尤指财产或组织）被平均分成两半时的其中一半；半份。"},"examples":[{"en":"She inherited a moiety of the family estate, and her brother received the other half.","zh":"她继承了家族地产的一半，她哥哥继承了另一半。"},{"en":"In some traditional systems, the tribe is divided into two moieties that organize marriage and rituals.","zh":"在一些传统社会里，部落会分成两个对偶的“半部”，用来安排婚姻与仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"A part or portion of something (used in formal writing; often means a significant share, not necessarily half).","zh":"（正式用语）部分；一份（不一定是“一半”，常指相当的一部分）。"},"examples":[{"en":"A moiety of the budget was redirected to emergency repairs.","zh":"预算中的一部分被转用于紧急维修。"},{"en":"Only a moiety of the evidence was made public at first.","zh":"起初只有部分证据被公开。"}]},{"partOfSpeech":"n.","definition":{"en":"In chemistry, a distinct part of a molecule (a chemical group) that contributes to its structure or function.","zh":"（化学）基团；分子中的一个结构单元（对结构或功能有贡献的部分）。"},"examples":[{"en":"The sugar moiety affects how the drug is absorbed in the body.","zh":"糖基部分会影响药物在体内的吸收。"},{"en":"Researchers modified the aromatic moiety to improve stability.","zh":"研究人员改造了芳香基团部分以提高稳定性。"}]}],"synonyms":["half","portion","part","share","component"],"phonetic":"/ˈmɔɪəti/","extraExplanation":["词源上来自拉丁语 *medietas*（“一半”），所以在法律或人类学语境里常常更接近“对等的半份”。但在一般正式英文里，它也可能只是“相当的一部分”，不必严格等于 50%。","用法提示：它比较书面、正式，日常口语更常用 *half*（一半）或 *part/portion*（部分）。","人类学里的 *moiety* 指社会被分成两个互补的“对偶群体”（如婚配、仪式分工），常见搭配：*dual moiety system*（双半部制度）。"]}
{"word":"moil","summary":{"en":"Moil means to work busily and often anxiously, or to stir liquid into a muddy, turbulent state; as a noun it can mean tiring, troubled work.","zh":"Moil 指忙乱而辛苦地奔忙（常带焦虑），也可指搅动液体使其浑浊翻腾；作名词可表示辛苦而烦扰的劳作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to work hard and keep busy, often with a sense of worry, confusion, or pressure","zh":"忙乱；奔忙（常带有焦虑、混乱或压力感）"},"examples":[{"en":"She moiled all day in the kitchen, trying to finish dinner for the guests.","zh":"她在厨房里忙乱了一整天，想赶在客人到来前把晚餐做好。"},{"en":"Don’t moil over every small mistake—take a break and try again tomorrow.","zh":"别为每个小错误都焦虑纠结，休息一下，明天再试。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stir up or mix (especially water or liquid) so it becomes muddy or turbulent","zh":"搅动（尤指水或液体），使其变浑浊或翻腾"},"examples":[{"en":"The oars moiled the river, turning the clear water brown near the boat.","zh":"船桨搅动了河水，把船边清澈的水搅成了棕色。"}]},{"partOfSpeech":"n.","definition":{"en":"hard, tiring work; busy, troubled activity","zh":"辛苦的劳作；忙乱而烦扰的活动"},"examples":[{"en":"After years of moil, he finally had time to rest.","zh":"经过多年的辛劳奔波，他终于有时间休息了。"}]}],"synonyms":["toil","labor","struggle","fret","stir","agitate"],"phonetic":"/mɔɪl/","extraExplanation":["“moil”在现代英语里比较少见，常带有文学或正式语气。它既可以指“辛苦忙乱地干活”，也可以引申为“在烦恼/焦虑中折腾”。","在文学语境中，“moil”常与“turmoil（动荡/混乱）”“toil（辛劳）”放在一起，形成强调忙乱与疲惫的效果。"]}
{"word":"moile","summary":{"en":"**moile** is a rare spelling of **moil**, meaning “to work very hard” or “to move in confused agitation,” and as a noun it can mean “drudgery” or “turmoil.”","zh":"**moile** 是 **moil** 的罕见拼写，可表示“苦干/辛苦劳作”或“混乱地忙乱穿梭、翻腾”，作名词时可指“苦工”或“动荡纷扰”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare spelling of **moil**) to work very hard; to do difficult, tiring work (to drudge).","zh":"（罕见拼写，等同于 **moil**）辛苦劳作；苦干；做艰苦乏味的工作（苦力般地干）。"},"examples":[{"en":"They moiled all day in the fields to finish the harvest before the storm.","zh":"他们在田里辛苦干了一整天，想在暴风雨来临前把收成赶完。"},{"en":"After years of moiling at low-paid jobs, she finally started her own business.","zh":"在低薪工作里苦干多年后，她终于开始创业。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare spelling of **moil**) to move in a busy, confused, or agitated way; to churn or swirl.","zh":"（罕见拼写，等同于 **moil**）混乱地忙乱穿梭；翻腾；打旋。"},"examples":[{"en":"People moiled around the station after the announcement was canceled.","zh":"公告取消后，人们在车站里一片忙乱地走动。"},{"en":"The water moiled under the bridge after the heavy rain.","zh":"大雨过后，桥下的水翻腾涌动。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare; dialect/old-fashioned) to make something wet, dirty, or muddy.","zh":"（罕见；方言/旧式）把……弄湿、弄脏或弄得泥泞。"},"examples":[{"en":"His boots were moiled with mud after the hike.","zh":"徒步后他的靴子被泥巴弄得很脏。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a noun; from **moil**) hard work; drudgery; also: confusion or turmoil.","zh":"（作名词；源自 **moil**）苦工；苦差；也可指混乱、动荡。"},"examples":[{"en":"He wanted a quiet weekend away from the moil of city life.","zh":"他想找个安静的周末，远离城市生活的喧嚣与纷扰。"}]}],"synonyms":["toil","drudge","labor","grind","churn","swirl","turmoil"],"phonetic":"/mɔɪl/","extraExplanation":["“moile”在现代英语里非常少见，多数情况下是“moil”的变体拼写或拼写错误；日常写作更建议用“moil”。","注意别和犹太文化里的“mohel”（行割礼的宗教人士）混淆：在部分阿什肯纳兹/意第绪语影响的发音里，mohel 可能被读成接近“moyl”，因此有人也会写成“moil/moil(e)”。"]}
{"word":"moiled","summary":{"en":"Moiled is the past form of moil, meaning to toil hard or struggle busily; in older/literary use it can also mean to soil or make muddy.","zh":"Moiled 是 moil 的过去式/过去分词，常指辛苦劳作或在忙乱困难中奔忙；较旧或文学用法中也可指把……弄脏、弄得泥泞。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of **moil**: to work very hard for a long time; to toil.","zh":"**moil** 的过去式/过去分词：长时间非常辛苦地工作；苦干。"},"examples":[{"en":"She **moiled** for years to support her family.","zh":"她为了养家糊口辛苦劳作了很多年。"},{"en":"They had **moiled** all day and were exhausted by night.","zh":"他们忙了一整天，到了晚上精疲力尽。"}]},{"partOfSpeech":"v.","definition":{"en":"to struggle or move about in a busy, confused way; to labor in difficulties (often used with **in**: *moil in*).","zh":"在忙乱或困难中挣扎、奔忙（常与 **in** 连用：*moil in*）。"},"examples":[{"en":"Reporters **moiled** in the crowd, trying to reach the entrance.","zh":"记者们在人群中奔忙，试图挤到入口处。"},{"en":"He **moiled** in paperwork and never felt caught up.","zh":"他陷在一堆文书工作里，怎么都忙不完。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common, literary/old-fashioned) to make something dirty or muddy; to soil.","zh":"（较少见，文学/旧式用法）把……弄脏、弄得泥泞；玷污。"},"examples":[{"en":"His boots were **moiled** with wet clay.","zh":"他的靴子被湿泥弄得很脏。"},{"en":"The wheels **moiled** the road with mud after the storm.","zh":"暴风雨后，车轮把泥浆带得到处都是。"}]}],"synonyms":["toiled","labored","slaved","struggled","worked","soiled (older sense)"],"phonetic":"/mɔɪld/","extraExplanation":["“moiled”在现代英语里不算常用，更常见的是“toiled / labored / worked hard”。你可能会在文学作品、旧新闻写法或较正式的表达里看到“moil / moiled”。","“moil”常带有“辛苦+忙乱/困顿”的感觉，不只是“忙”，还有“累、艰难、被琐事缠住”的意味。","如果你看到形容人的用法（例如“moiled and weary”），通常是在强调“辛苦劳作后又脏又累/疲惫不堪”的画面感。"]}
{"word":"moiler","summary":{"en":"A moiler is a person who works very hard, especially at tiring or dull work; a drudge.","zh":"moiler 指辛苦劳作、做繁重或枯燥工作的人；可译为“苦力/埋头苦干的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works very hard, especially doing tiring or boring work; a drudge.","zh":"辛苦劳作的人；苦力；做繁重或枯燥工作的人。"},"examples":[{"en":"After weeks of overtime, he felt like a moiler who never got a day off.","zh":"连续加班好几周后，他觉得自己像个永远休不了假的苦力。"},{"en":"She was tired of being a moiler in an office where no one noticed her efforts.","zh":"在一个没人注意到她付出的办公室里，她厌倦了当一个埋头苦干的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who makes a great effort, often in a dull or unglamorous way.","zh":"（常指）默默拼命的人；苦干型努力者（不一定体力劳动）。"},"examples":[{"en":"He wasn’t a natural star—just a moiler who practiced every day.","zh":"他不是天生的明星，只是一个每天练习、默默努力的人。"}]}],"synonyms":["drudge","toiler","workhorse","laborer","hard worker"],"phonetic":"/ˈmɔɪlər/","extraExplanation":["“moiler”比较少见，语气往往带一点同情或贬义：强调“辛苦、枯燥、看不到回报的努力”。在现代英语里更常用的说法是“hard worker”“drudge”或“workhorse”。","它和动词“to moil”有关，后者有“辛苦劳作、忙得团团转”的意思；因此“moiler”可理解为“长期在辛苦劳作中的人”。"]}
{"word":"moilers","summary":{"en":"“Moilers” means people who toil or drudge—hard workers doing tiring, often unglamorous labor.","zh":"“moilers”指辛苦劳作的人，尤指做繁重、乏味却不太体面的工作的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **moiler**: a person who works very hard, especially doing dull or tiring work; a drudge.","zh":"**moiler** 的复数：辛苦劳作的人；做繁重、乏味工作的人；苦力。"},"examples":[{"en":"After years as factory **moilers**, they finally saved enough to start their own shop.","zh":"在工厂当了多年辛苦劳作的工人后，他们终于攒够钱开了自己的店。"},{"en":"The novel sympathizes with the city’s **moilers**—people whose labor is rarely noticed.","zh":"这部小说同情城市里的辛苦劳作者——那些劳动常常被忽视的人。"}]}],"synonyms":["hard workers","laborers","toilers","drudges"],"phonetic":"ˈmɔɪlərz","extraExplanation":["这个词比较少见、偏书面/古旧，来自动词 **moil**（辛苦劳作；苦干），常见近义词更口语的是 **hard workers, laborers, drudges, toilers**。","如果你是在玩拼字游戏（如 Scrabble）看到 **MOILERS**：它确实是一个可用词，对应的单数是 **moiler**。"]}
{"word":"moiles","summary":{"en":"**moiles** is a rare plural form of *moil*, meaning either hard work/drudgery or confusion/turmoil.","zh":"**moiles** 很少见，通常是古旧词 *moil* 的复数，可指“辛苦劳作/苦工”或“混乱/动荡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) Hard, tiring work; drudgery (the plural of **moil**, an old-fashioned word).","zh":"（复数名词）辛苦的劳作；苦工（**moil** 的复数，用法较古旧）。"},"examples":[{"en":"After years of moiles at low-paying jobs, she finally started her own business.","zh":"在低薪工作里辛苦打拼多年后，她终于开始创业。"},{"en":"He wanted a life with fewer moiles and more time for family.","zh":"他想要一种少些辛劳、更多陪伴家人的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural noun) Confusion, commotion, or turmoil (another meaning of **moil**; uncommon in modern daily speech).","zh":"（复数名词）混乱；骚动；动荡（**moil** 的另一个意思；现代日常口语中不常见）。"},"examples":[{"en":"She stepped away from the city’s moiles to rest for a week.","zh":"她离开城市的纷扰，休息了一周。"},{"en":"In the moiles of the meeting, the key decision was forgotten.","zh":"在会议的一片混乱中，关键决定被遗忘了。"}]}],"synonyms":["drudgery","hard work","toil","labor","turmoil","commotion","confusion"],"phonetic":"/mɔɪlz/","extraExplanation":["“moiles”本身非常少见；更常见的是单数 **moil**（/mɔɪl/），以及固定搭配 **toil and moil**（辛苦劳作）。","如果你本来想打的是 **miles**（英里）或 **moles**（鼹鼠/痣/物质的量单位），告诉我语境（句子）我可以帮你确认正确拼法与意思。"]}
{"word":"moiley","summary":{"en":"Moiley is a dialect word meaning a hornless cow (like “muley”). Less commonly in Scottish dialect, it can mean a mild, good-natured person.","zh":"Moiley 是方言词，常指“无角的母牛”（类似 muley）。较少见时在苏格兰方言里也可指“温和好脾气的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hornless cow (and sometimes a hornless goat or ox); a dialect form of **muley**.","zh":"（方言）无角的母牛（有时也指无角的山羊或公牛/牛）。相当于 **muley**。"},"examples":[{"en":"They kept a moiley cow because it was safer around children.","zh":"他们养了一头无角母牛，因为在孩子身边更安全。"},{"en":"In old rural stories, a “moiley” is simply a cow with no horns.","zh":"在一些古老的乡村故事里，“moiley”就是指没有角的牛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish dialect, less common) a gentle, mild, good-natured person.","zh":"（苏格兰方言，较少见）性情温和、好脾气的人。"},"examples":[{"en":"Everyone liked him—he was a real moiley.","zh":"大家都喜欢他——他真是个温和的好人。"}]}],"synonyms":["muley","moily","mooley"],"phonetic":"/ˈmɔɪli/","extraExplanation":["“moiley”主要见于爱尔兰/苏格兰及其移民影响下的方言用法，在现代日常英语里不常见；更常见的标准写法/对应词是 **muley**（指无角的牛）。","词源常被解释为与盖尔语中表示“无角/光秃”的词根有关，因此也会出现在一些地区性的民俗、乡村叙事或方言词汇记录中。","如果你是在聊天或社交媒体里看到“moiley”，也有可能是拼写误差（例如人名 **Miley**）。如果你告诉我上下文句子，我可以帮你判断具体意思。"]}
{"word":"moiling","summary":{"en":"**Moiling** means (1) working very hard in tiring, often messy tasks, or (2) churning/restlessly swirling (especially water, mud, or crowds).","zh":"**Moiling** 指（1）辛苦忙碌地干活，常带“又累又脏/忙乱”的感觉；（2）（水、泥、人群等）翻腾涌动、搅动不安。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"working very hard; doing tiring, messy work (present participle of **moil**).","zh":"辛苦劳作；忙碌做吃力或脏乱的工作（**moil** 的现在分词）。"},"examples":[{"en":"She spent the afternoon moiling in the garden, pulling weeds and hauling soil.","zh":"她整个下午都在花园里辛苦干活，拔杂草、搬土。"},{"en":"They were moiling away to finish the project before the deadline.","zh":"他们拼命忙活，想在截止日期前完成项目。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving around in a restless, swirling way; churning (often of water, mud, smoke, or crowds).","zh":"翻腾、搅动；混乱地涌动（常指水、泥、烟或人群）。"},"examples":[{"en":"The river was moiling after the storm, brown with mud.","zh":"暴风雨后河水翻腾，夹着泥沙变成褐色。"},{"en":"A moiling crowd pressed toward the gate.","zh":"人群涌动着挤向大门。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of stirring up or making something muddy or confused (the action of **moiling**).","zh":"搅动、搅浑；把事物弄得混乱（**moiling** 这一动作）。"},"examples":[{"en":"The moiling of the water made it hard to see the fish.","zh":"水被搅浑了，很难看清鱼。"}]}],"synonyms":["toiling","laboring","struggling","churning","swirling","seething"],"phonetic":"/ˈmɔɪ.lɪŋ/","extraExplanation":["“moiling”来自动词 **moil**，在现代英语里偏文学/书面，用来表现“辛苦劳作”或“翻滚搅动”的画面感。日常口语更常用 **working hard / toiling / struggling / churning**。","描写自然时，“moiling water/sea”常带有“浑浊、翻腾、让人不安”的氛围；描写人时，“moil/moiling”强调忙乱、劳累，甚至带一点“焦躁的奔波”。"]}
{"word":"moilingly","summary":{"en":"Moilingly means “in a hard-working, laborious way” (literary), and more rarely “in a turbulent, confused way.”","zh":"moilingly 指“辛苦费力地（文学用法）”，更少见时也可指“动荡混乱地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves hard, tiring work; laboriously (literary/old-fashioned).","zh":"以辛苦劳作的方式；费力地（文学/较旧式用法）。"},"examples":[{"en":"He worked moilingly from dawn to dusk to finish the harvest.","zh":"为了收完庄稼，他从黎明忙到黄昏，辛苦地劳作。"},{"en":"The team moved moilingly through paperwork before the project could begin.","zh":"项目开始前，团队不得不在文件流程里费力地推进。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a confused, churning, or troubled way; amid turmoil (rare).","zh":"以混乱翻搅、动荡不安的方式；在纷乱中（罕见）。"},"examples":[{"en":"The crowd shifted moilingly, restless and loud.","zh":"人群躁动地翻涌着，喧闹不安。"}]}],"synonyms":["laboriously","strenuously","with great effort","tirelessly","wearily"],"phonetic":"/ˈmɔɪlɪŋli/","extraExplanation":["“moilingly”来自动词“moil”，有“辛苦劳作、苦干”之意，因此这个副词常带有一种文学色彩，强调“累、脏、费力”的劳动感（例如在描写农活、体力活或漫长繁琐的事务时）。","现代英语中更常用的表达是“laboriously / with great effort / tirelessly”，所以你在日常写作或口语里用这些会更自然；“moilingly”更适合想要复古、书面、带画面感的句子。"]}
{"word":"moils","summary":{"en":"**Moils** usually means “works very hard” (verb) or “hard, tiring work” (plural noun), and it can also mean “makes something muddy” (less common).","zh":"**Moils** 常指“辛苦劳作”（动词）或“辛劳/繁重劳动”（名词复数）；较少见时也可指“搅浑、弄脏”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"**moils**: works very hard; struggles or labors with continuous effort (3rd-person singular of *moil*).","zh":"**moils**：辛苦劳作；费力挣扎、持续用力地干活（动词 *moil* 的第三人称单数）。"},"examples":[{"en":"She moils in the kitchen all day to prepare for the holiday dinner.","zh":"她一整天都在厨房里辛苦忙活，为节日晚餐做准备。"},{"en":"He moils away at his studies, even when everyone else is resting.","zh":"即使别人都在休息，他也仍埋头苦读、辛苦用功。"}]},{"partOfSpeech":"n.","definition":{"en":"**moils**: periods or situations of hard, tiring work; heavy labor (plural of the noun *moil*).","zh":"**moils**：辛劳的时光/处境；繁重而令人疲惫的劳动（名词 *moil* 的复数）。"},"examples":[{"en":"After years of moils, they finally saved enough to buy a small house.","zh":"经历多年辛劳后，他们终于攒够钱买了一套小房子。"},{"en":"The novel focuses on the moils of factory life.","zh":"这部小说聚焦工厂生活的艰辛。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) **moils**: makes something muddy or messy; dirties by mixing or stirring (3rd-person singular of *moil*).","zh":"（较少见）**moils**：把……弄脏/弄浑；搅动使其变得泥泞或混乱（动词 *moil* 的第三人称单数）。"},"examples":[{"en":"The storm moils the river, turning the clear water brown.","zh":"暴风雨搅浑了河水，把清澈的水变成了褐色。"},{"en":"Mud moils the snow along the roadside in early spring.","zh":"早春路边的雪被泥水弄得很脏。"}]}],"synonyms":["toil","labor","struggle","grind","drudge","slave away"],"phonetic":"/mɔɪl/","extraExplanation":["“moil(s)”在现代英语里偏书面、带一点文学色彩，常用来强调“辛苦、劳碌、费力”的感觉，比常见的“work hard”更有“劳作到疲惫”的语气。","常见搭配：**moil away**（埋头苦干/苦学），**moil in/at**（在……中辛苦忙碌）。语体上更像叙述、描写，不太像日常口语。"]}
{"word":"moilsome","summary":{"en":"Moilsome means very tiring and labor-intensive; it describes work or a journey that takes a lot of effort.","zh":"Moilsome 指“十分辛苦、费力的”，常形容需要大量体力或长期努力的工作或旅程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving hard, tiring work; requiring a lot of effort over time.","zh":"辛苦的；费力的；需要长时间付出努力的。"},"examples":[{"en":"They made a moilsome journey on foot through the mountains.","zh":"他们徒步穿越群山，旅程十分辛苦。"},{"en":"Cleaning the house by hand every day can be moilsome work.","zh":"每天都靠手工打扫房子会是很辛苦的工作。"},{"en":"The team spent months on the moilsome task of checking every record.","zh":"团队花了几个月做逐条核对记录的辛苦工作。"}]}],"synonyms":["laborious","tiring","arduous","grueling","toilsome"],"phonetic":"/ˈmɔɪl.səm/","extraExplanation":["“moilsome”比较偏文学/书面语，日常口语里更常用 tiring, laborious, grueling, backbreaking 等来表达“很累、很辛苦”。","它来自动词 “moil”（辛苦劳作、忙碌），所以 moilsome 常带有“费力且耗时”的感觉，常用来形容旅程、任务、劳动。"]}
{"word":"moineau","summary":{"en":"Moineau is French for “sparrow,” mostly used in English in French titles or names.","zh":"Moineau 是法语“麻雀”，在英语中多用于法语标题或人名/姓氏等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A French word meaning “sparrow.” In English, it’s mainly seen in French names, titles, menus, or as a surname rather than as an everyday English word.","zh":"法语词，意思是“麻雀”。在英语里多出现在法语姓名、书名/片名、菜单或作为姓氏中，而不是日常常用英语词。"},"examples":[{"en":"The painting was titled *Le Moineau* (“The Sparrow”).","zh":"这幅画的标题是 *Le Moineau*（“麻雀”）。"},{"en":"In the lyrics, *moineau* is used as an image of a small, ordinary bird.","zh":"在歌词里，*moineau* 被用作一只渺小、普通的鸟的意象。"},{"en":"Her last name, Moineau, is French in origin.","zh":"她的姓 Moineau 源自法语。"}]}],"synonyms":["sparrow"],"phonetic":"/mwɑˈnoʊ/","extraExplanation":["在英语环境里，*moineau* 通常被当作“保留法语拼写的外来词”来使用（尤其在书名、艺术作品名、人名/地名里），写作时一般会斜体或保留原文格式。","读音提示：法语中结尾的 -eau 常发接近 /o/ 的音；英语里借用时常被读成接近“mwah-NO”。如果你是要在英语口语里说，/mwɑˈnoʊ/ 是比较容易被理解的读法。"]}
{"word":"moingwena","summary":{"en":"Moingwena is a historical tribal name (Miami-Illinois/Illini Confederacy), also seen as a spelling variant of Moingona and linked to early naming around Des Moines.","zh":"Moingwena 是一个历史部族/族群名称（迈阿密-伊利诺伊/伊利尼联盟），也常被视为 Moingona 的异拼，并与得梅因（Des Moines）相关地名来源讨论有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A historic Miami-Illinois / Illini Confederacy group (often linked with the Peoria) living near the Des Moines River area in what is now Iowa; the group later merged with the Peoria and no longer existed as a separate tribe.","zh":"（专有名词）北美迈阿密-伊利诺伊（Miami-Illinois）/ 伊利尼联盟（Illini Confederacy）中的一个历史族群（常与皮奥里亚族 Peoria 关系密切），活动区域与今美国爱荷华州的得梅因河（Des Moines River）一带有关；后来并入皮奥里亚族，不再作为独立部族存在。"},"examples":[{"en":"The name “Moingwena” appears on some early French maps of the Mississippi River region.","zh":"“Moingwena”这个名称出现在一些早期法国人绘制的密西西比河流域地图上。"},{"en":"Some historians connect the place name “Des Moines” to the Moingwena/Moingona people.","zh":"一些历史研究认为地名“Des Moines（得梅因）”与Moingwena/Moingona族群名称有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(Variant spelling) Another spelling of Moingona, used in some historical sources (especially in French-era spellings) for the same group or for related geographic naming.","zh":"（异拼）Moingona 的另一种拼写形式；在一些历史资料（尤其是法语时代的拼写）中用于指同一族群，或用于相关地理名称的来源。"},"examples":[{"en":"You may see Moingwena spelled as Moingona in different books.","zh":"在不同书籍里，你可能会看到Moingwena也写作Moingona。"}]}],"synonyms":["Moingona"],"phonetic":"ˌmɔɪŋˈweɪnə","extraExplanation":["Moingwena 不是现代英语里的常用词，更像是“历史人群名称/部族名”（ethnonym）。它常出现在早期探险记录与地图学资料中，和今日美国爱荷华州的 Des Moines River（得梅因河）名称来源讨论有关。","关于词源（这个名字“到底本来是什么意思”）在学界与大众资料里有争议：有些说法认为是地理/族群称呼的转写；也有资料把它解释成带侮辱色彩的外号。学习时建议把它当作专名使用，避免把争议性解释当作确定含义。"]}
{"word":"moio","summary":{"en":"Moio is usually an obsolete Portuguese unit of measure (especially for grain), and it can also be a place name (notably in Italy).","zh":"Moio 通常指已废弃的葡萄牙旧计量单位（多用于谷物），也可作地名（意大利较常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical Portuguese unit of measurement (mainly for grain or other dry goods, sometimes liquids), whose exact size varied by region and time; now obsolete","zh":"（葡萄牙历史上的）一种计量单位（多用于谷物等干货，有时也用于液体），其具体大小因地区与时代而异；现已废弃不用"},"examples":[{"en":"In old Portuguese records, grain might be listed in moios rather than kilograms.","zh":"在旧的葡萄牙文献里，谷物可能用 moio 来记账，而不是用千克。"},{"en":"Because a moio was not perfectly standardized, historians often explain which region’s moio they mean.","zh":"由于 moio 并非完全统一的标准单位，历史学者常会说明他们指的是哪个地区的 moio。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) used for several towns/municipalities, especially in Italy","zh":"地名（专有名词）：用于若干城镇/市镇名称，尤见于意大利"},"examples":[{"en":"Moio de’ Calvi is a small municipality in northern Italy.","zh":"Moio de’ Calvi 是意大利北部的一个小市镇。"}]}],"synonyms":["modius (historical, related)"],"phonetic":"/ˈmɔɪ.oʊ/","extraExplanation":["“moio”与拉丁语“modius”（古罗马的容量单位）有关，因此在英语资料中常被解释为一种“旧的容量/粮食计量单位”。","因为不同地区与不同时期的“moio”换算差异很大，所以阅读史料时更重要的是看上下文：它属于哪一地的度量体系、用于计量什么商品。"]}
{"word":"moir","summary":{"en":"Moir usually refers to a moiré (interference) pattern or a moiré fabric/finish; it can also be a Scottish surname.","zh":"Moir 通常指“摩尔纹（干涉条纹）”或“带莫尔纹效果的面料/整理”，也可作苏格兰姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a moiré pattern; a shimmering or wavy “interference” effect that can appear when two regular patterns (like grids, stripes, or screen pixels) overlap or are viewed/printed at certain resolutions","zh":"摩尔纹；当两种规则图案（如网格、条纹或屏幕像素）叠加或在特定分辨率下显示/打印时出现的闪烁、波纹状“干涉”图案"},"examples":[{"en":"When I took a photo of my laptop screen, a strange moir appeared across the image.","zh":"我拍笔记本屏幕时，图片上出现了奇怪的摩尔纹。"},{"en":"The designer changed the stripe spacing to avoid a moir effect on camera.","zh":"设计师调整了条纹间距，避免在镜头里出现摩尔纹效果。"}]},{"partOfSpeech":"n.","definition":{"en":"(textiles) moiré (fabric/finish); cloth—often silk or synthetic—with a watery, rippled, wood-grain-like sheen","zh":"（纺织）波纹绸/木纹绸（莫尔纹效果的面料或整理效果）；表面呈水波纹、木纹般光泽的织物（常见于丝绸或化纤）"},"examples":[{"en":"Her evening bag was covered in black moir that caught the light.","zh":"她的晚宴手包是黑色波纹绸材质，在灯光下很闪。"},{"en":"The ribbon has a moir finish, so it looks like it has soft waves.","zh":"这条缎带做了莫尔纹整理，所以看起来有柔和的波纹。"}]},{"partOfSpeech":"n.","definition":{"en":"a Scottish surname (family name)","zh":"苏格兰姓氏（人名）"},"examples":[{"en":"His last name is Moir, spelled M-O-I-R.","zh":"他的姓是 Moir，拼作 M-O-I-R。"}]}],"synonyms":["moiré","moire","interference pattern","watered silk"],"phonetic":"/mɔɪr/","extraExplanation":["“moir”在现代英语里更常见的拼写是 **moire** 或带变音符的 **moiré**。在设计/摄影/显示屏语境里通常指“摩尔纹”；在服装与面料语境里多指“波纹绸/木纹绸（moiré finish）”。","发音会因拼写与地区而变：**moir/moire** 常读作类似“moyr”，而 **moiré** 常读作“mwah-RAY”。如果你告诉我你看到它的具体拼写（moir / moire / moiré）和上下文（屏幕？布料？人名？），我可以帮你选最准确的意思与读音。"]}
{"word":"moira","summary":{"en":"Moira can mean “fate/destiny” in Greek mythology, and it is also used as a female given name.","zh":"Moira 可指希腊神话中的“命运/宿命”，也常作为女性名字使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) fate or destiny; also one of the three Fates (the Moirai) who control a person’s life.","zh":"（希腊神话）命运；也可指“三位命运女神”（Moirai）之一，掌管人的生命进程。"},"examples":[{"en":"In Greek myth, no one can fully escape Moira.","zh":"在希腊神话里，没有人能完全逃脱命运（Moira）。"},{"en":"The hero’s Moira seems fixed from the beginning of the story.","zh":"这个英雄的命运（Moira）似乎从故事一开始就注定了。"}]},{"partOfSpeech":"n.","definition":{"en":"a female given name (used in English-speaking countries).","zh":"女性名字（英语国家中使用）。"},"examples":[{"en":"Moira introduced herself and offered to help.","zh":"莫伊拉（Moira）自我介绍后表示愿意帮忙。"},{"en":"Moira is a common character name in novels and TV shows.","zh":"Moira 常被用作小说和电视剧中的人物名字。"}]}],"synonyms":["fate","destiny"],"phonetic":"/ˈmɔɪrə/","extraExplanation":["“Moira”来自古希腊语，常与“命运”相关；复数形式是 “Moirai”（三位命运女神）。在阅读英文文学或神话改写作品时，你可能会看到作者用 Moira/Moirai 来营造“宿命感”。","作为人名时，Moira 也常被认为与爱尔兰语传统有关（常见解释是与 Mary 的变体相关）。在日常交流里，如果它是人名，通常不带“命运”的含义，需要靠上下文判断。"]}
{"word":"moirai","summary":{"en":"Moirai = the three Greek Fates who control destiny and lifespan.","zh":"Moirai 指希腊神话中掌管命运与寿命的“三位命运女神”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The three Fates who control a person’s destiny and the length of life (Clotho, Lachesis, and Atropos).","zh":"（希腊神话）“命运三女神”，掌管人的命运与寿命（克洛托、拉刻西斯、阿特洛波斯）。"},"examples":[{"en":"In Greek myth, the Moirai decide how long each person will live.","zh":"在希腊神话中，Moirai 决定每个人能活多久。"},{"en":"The hero begs the Moirai to change his fate, but they rarely do.","zh":"英雄恳求 Moirai 改变他的命运，但她们很少这么做。"},{"en":"Some writers use the Moirai as a symbol of forces beyond human control.","zh":"一些作家把 Moirai 当作“人力无法掌控的力量”的象征。"}]}],"synonyms":["the Fates","Fates"],"phonetic":"/ˈmɔɪraɪ/","extraExplanation":["Moirai 是希腊语音译，通常被理解为“命运/份额”的概念，常用复数来指三位女神：Clotho（纺线、开启生命）、Lachesis（量线、分配人生）、Atropos（剪线、终结生命）。","英语里常把 Moirai 译作“the Fates（命运女神）”。在阅读时如果看到单数 moira，往往更偏“个人的命运/份额”；看到复数 Moirai，则多指“三女神”本身。","在文学与文化中，Moirai 常象征：命运的不可抗拒、生命的有限、以及人对未来的不确定感。"]}
{"word":"moire","summary":{"en":"Moiré means a watery, wavy pattern—either a fabric design or an interference pattern seen in images when fine lines overlap.","zh":"Moiré 指“水波纹”般的波纹图案：既可指面料上的水波纹花纹，也可指影像中细密线条叠加产生的干扰纹（摩尔纹）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rippled, wavy pattern (often on silk or other fabric) that looks like watered lines.","zh":"（常见于丝绸等面料上的）波纹状、像“水波纹”的花纹。"},"examples":[{"en":"She chose a moiré silk ribbon for the gift wrap.","zh":"她选了一条有水波纹图案的丝绸缎带来包装礼物。"},{"en":"The tie has a subtle moiré pattern that shines under light.","zh":"这条领带有很淡的水波纹，在灯光下会泛光。"}]},{"partOfSpeech":"n.","definition":{"en":"An unwanted interference pattern that appears in photos, videos, printing, or screens when fine lines or grids overlap (for example, when photographing a monitor or tightly patterned clothing).","zh":"（摄影、视频、印刷或屏幕中）因细密线条/网格叠加而产生的干扰纹（例如拍屏幕或密集条纹衣服时出现的彩色波纹/条纹）。"},"examples":[{"en":"The shirt’s tiny stripes created moiré on camera.","zh":"那件衬衫的细条纹在镜头里产生了摩尔纹。"},{"en":"Try changing the distance or angle to reduce moiré in the shot.","zh":"试着改变拍摄距离或角度，来减少画面里的摩尔纹。"}]}],"synonyms":["watered pattern","rippled pattern","interference pattern"],"phonetic":"/mwɑːˈreɪ/","extraExplanation":["“moiré”来自法语，常写作带重音符号的“moiré”，英语里也常见不带重音的“moire”。两种写法都对，意思通常相同。","在影像领域，“摩尔纹”常因为两组规则细线（例如相机传感器像素网格与衣服细条纹/屏幕像素）叠加产生。日常处理方法包括：换角度、拉远/靠近、轻微失焦、改变缩放比例，或在后期用去摩尔纹（de-moiré）工具。"]}
{"word":"moireed","summary":{"en":"“Moireed” is a rare form meaning “made to have a moiré (wavy/shimmering) pattern,” especially on fabric or in images.","zh":"“moireed” 很少见，大意是“呈现摩尔纹/水波纹闪纹效果的（或被处理成这种效果的）”，常见于织物或图像。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Past tense/past participle of **to moiré / to moire**: to give something a moiré (watered, wavy, shimmering) pattern or finish—often on fabric, or as an unwanted interference pattern in printing/scanning.","zh":"（罕见）**to moiré / to moire** 的过去式/过去分词：使某物呈现“波纹绸/水波纹（moiré）”般的起伏闪纹效果；也可指在印刷、扫描等过程中产生（常不希望出现的）干涉条纹。"},"examples":[{"en":"The designer **moireed** the silk to create a watery, rippled sheen.","zh":"设计师把丝绸**压出水波纹（moireed）**，让它呈现起伏的光泽。"},{"en":"The scanned image looked **moireed**, with strange shimmering lines across the page.","zh":"扫描后的图片看起来像出现了**摩尔纹（moireed）**，页面上有奇怪的闪动条纹。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a moiré pattern or finish; showing rippling/shimmering lines.","zh":"带有摩尔纹/水波纹效果的；表面有起伏、闪动条纹的。"},"examples":[{"en":"Under the stage lights, the dress appeared slightly **moireed**.","zh":"在舞台灯光下，那条裙子看起来有点**水波纹闪纹（moireed）**。"}]}],"synonyms":["moiréed","moired","watered (fabric)","rippling","shimmering"],"phonetic":"/mwaˈreɪd/","extraExplanation":["“moireed”在现代英语里非常少见；更常见的拼写与形式是 **moiré**（名词/形容词）或 **moired**（形容词）。","在纺织领域，moiré 常指通过压光等工艺做出的“水波纹/木纹感”表面；在影像与印刷领域，moiré pattern 指两组规则线条/网点叠加后产生的干涉条纹。"]}
{"word":"moireing","summary":{"en":"Moireing is a textile finishing process (and the resulting finish) that creates a shiny, wavy “watered” moiré effect on fabric.","zh":"Moireing 指纺织品的一种后整理工艺（也可指其效果），通过高压压纹让布面呈现有光泽的“水波纹/莫尔纹”效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Textiles) a finishing process that presses fabric (often with engraved rollers) to create a wavy, “watered,” shiny light-and-dark effect (a moiré effect).","zh":"（纺织）“压花起波纹”的后整理工艺：通过高压（常用刻纹滚筒）压扁/挤压纱线，使布面出现像“水波纹”一样明暗变化的光泽（莫尔纹效果）。"},"examples":[{"en":"The designer chose moireing to give the acetate lining a rich, watered look.","zh":"设计师选用 moireing，让醋酸纤维里料呈现更高级的“水波纹”光泽。"},{"en":"Moiréing is often used on silk to create a shimmering pattern for formal wear.","zh":"在丝绸上常会用 moireing 来做出适合礼服的闪烁波纹效果。"}]},{"partOfSpeech":"n.","definition":{"en":"The moiré finish or watered appearance produced by that process.","zh":"由该工艺产生的莫尔纹/水波纹表面效果（成品外观）。"},"examples":[{"en":"You can see the moireing most clearly when the fabric catches the light.","zh":"布料一反光，moiréing（水波纹效果）就最明显。"}]}],"synonyms":["moiré finish","moirage","watermarking","watered finish"],"phonetic":"/mwɑːˈreɪ.ɪŋ/","extraExplanation":["这个词很少见，主要出现在纺织/面料后整理领域；很多日常英语里更常见的是 **moiré**（名词：莫尔纹、莫尔绸/水波纹效果）。","不要和摄影/扫描里的 **moiré pattern**（两组细密规则纹理叠加产生的干扰条纹）混淆：原理相似（视觉干涉），但语境不同。","拼写上你输入的 **moireing** 很可能对应英式/行业写法；在法语里常见相关词是 **moirage**（莫尔化/起莫尔纹的工艺）。"]}
{"word":"moires","summary":{"en":"Moires most commonly means the plural of moire, a fabric or pattern with a wavy, water-like look; less commonly, it can be a variant spelling for the Greek Fates (Moirai).","zh":"Moires 最常见是 moire 的复数，指带水波纹效果的布料或纹样；较少见时也可作为希腊神话“命运三神（Moirai）”的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of **moire**: a fabric (often silk or similar) with a wavy, water-like pattern, or the wavy pattern itself","zh":"**moire（波纹绸/波纹图案）**的复数：指带有水波纹般花纹的布料（常见于丝绸等），或指这种波纹图案本身"},"examples":[{"en":"The designer chose dark blue **moires** for the evening gowns.","zh":"设计师为晚礼服选用了深蓝色的**波纹绸**面料。"},{"en":"In the museum, you can see historical dresses made from rich **moires**.","zh":"在博物馆里，你可以看到用华丽**波纹绸**制作的历史服装。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a variant spelling of **Moirai**, the three Fates in Greek mythology","zh":"（较少见）**Moirai（摩伊赖）**的变体拼写：希腊神话中掌管命运的三女神（命运三神）"},"examples":[{"en":"In some older translations, the **moires** decide a hero’s fate.","zh":"在一些较旧的译本里，**命运三神**决定英雄的命运。"}]}],"synonyms":["watered silk","moiré pattern"],"phonetic":"/mwɑr/","extraExplanation":["“moire”常来自法语，读音在英语里通常是 /mwɑr/；但如果你看到拼写为“moiré”（带重音符号é），更常用于描述视觉上的“摩尔纹/干涉条纹”现象（比如拍摄细条纹衣服或屏幕时出现的波浪纹）。","“Moirai”（命运三神）是希腊神话用语：Clotho（纺线）、Lachesis（量线）、Atropos（剪断）。有时英语文本里会用较少见的拼写“moires”来指她们。"]}
{"word":"moirette","summary":{"en":"Moirette is a fabric or finish with a fine, rippling “watered” pattern, similar to moiré.","zh":"Moirette 指带有细致“水纹”波纹效果的织物或织物纹理，类似 moiré（波纹绸）但更细腻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fabric (or fabric finish) with a small, wavy “watered” pattern, like moiré but usually finer and more delicate","zh":"一种带有细小波纹“水纹”效果的织物（或织物整理效果）；类似波纹绸（moiré），但纹路通常更细、更柔和"},"examples":[{"en":"The ribbon was made of moirette, so it shimmered with a soft, rippling pattern in the light.","zh":"这条丝带是用 moirette 做的，所以在光下会泛出柔和起伏的水纹光泽。"},{"en":"She chose a moirette trim for the dress to give it a classic, formal look.","zh":"她给裙子选了 moirette 饰边，让整体看起来更经典、正式。"}]}],"synonyms":["moiré","watered silk","watered fabric"],"phonetic":"/mwɑːˈrɛt/","extraExplanation":["“moirette”多见于服装、丝带、内衬等语境，指一种比“moiré（波纹绸/水纹绸）”更细碎、轻柔的水纹效果。现实中有时也会被当作“moiré”的一种变体来使用。","词源上与法语有关（常被视为从 moiré 派生的称呼），所以在时装、纺织品描述里更常出现，而在日常口语里比较少见。"]}
{"word":"moise","summary":{"en":"Moise is usually a personal name equivalent to “Moses.” In French, “moïse” can also mean a “Moses basket” (a baby basket).","zh":"Moise 通常是人名，相当于“摩西（Moses）”。在法语里，moïse 也可指“摩西篮”（婴儿提篮/睡篮）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (and sometimes a surname), a form of “Moses” used in several languages (e.g., Romanian “Moise,” French “Moïse”).","zh":"（人名）男性名字（也可作姓氏），相当于“摩西（Moses）”在不同语言中的形式，如罗马尼亚语 Moise、法语 Moïse。"},"examples":[{"en":"Moise is named after Moses in his family’s tradition.","zh":"Moise 这个名字来自他家族传统里的“摩西（Moses）”。"},{"en":"In the class roster, Moise appears as a first name, not a nickname.","zh":"在班级名单里，Moise 是正式名字，不是昵称。"}]},{"partOfSpeech":"n.","definition":{"en":"(French) “moïse”: a baby basket or carrycot (a “Moses basket”).","zh":"（法语）moïse：婴儿提篮/睡篮（即“摩西篮”）。"},"examples":[{"en":"She placed the newborn in a moïse beside the bed.","zh":"她把新生儿放在床边的婴儿提篮（moïse）里。"}]}],"synonyms":["Moses","Moïse","Moisés","Moshe","Musa"],"phonetic":"/mɔɪz/","extraExplanation":["“Moise / Moïse”多用于人名，英语里常被读成接近“moyz”。如果是法语带变音符的“Moïse”，读音会更偏法语规则。","词源上通常与圣经人物 Moses（摩西）相关；不同语言会有不同拼写：法语 Moïse、西语 Moisés、希伯来语 Moshe、阿语 Musa 等。","注意区分：不带变音符的“Moise”（常见于英文环境的人名拼写）与法语名词“moïse”（婴儿提篮/摩西篮）。"]}
{"word":"moism","summary":{"en":"Moism (more commonly spelled Mohism) is an ancient Chinese philosophy founded by Mozi, known for “impartial care,” frugality, and opposition to aggressive war.","zh":"Moism（更常写作 Mohism）指墨家/墨学：墨子创立的先秦思想，以“兼爱”、节俭与反对侵略战争著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Chinese philosophy) Mohism: an ancient Chinese school of thought founded by Mozi, emphasizing practical benefit, frugality, opposition to aggressive war, and “impartial care” (caring for people without favoritism).","zh":"（中国哲学）墨家/墨学：由墨子创立的先秦思想流派，强调务实功利、节俭、反对侵略战争，以及“兼爱”（不偏私地关怀他人）。"},"examples":[{"en":"Mohism (Moism) challenged Confucian ideas about putting family first.","zh":"墨家（墨学）曾挑战儒家“以家族为本位”的思想。"},{"en":"In class we compared Moism’s “impartial care” with Confucian “graded love.”","zh":"课堂上我们把墨家的“兼爱”与儒家的“差等之爱”作了比较。"}]}],"synonyms":["Mohism","Mojism","Mojia"],"phonetic":"/ˈmoʊ.ɪzəm/","extraExplanation":["你输入的 **moism** 通常是 **Mohism** 的另一种拼写（也写作 **Moism**），都指“墨家/墨学”。英语里更常见的拼写是 **Mohism**。","不要和 **Mosaism** 混淆：Mosaism 指“摩西律法体系/犹太教古代的宗教法律体系”，词形相近但含义完全不同。"]}
{"word":"moison","summary":{"en":"Moison is mainly a French word/name: historically a rent paid in produce, and (rarely) an animal’s molting period; it’s also a French surname.","zh":"Moison 主要是法语词/人名：历史上指用农产品缴纳的地租/租赋；（较少见）也可指动物换羽/蜕皮期；另外它也是法国姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French, historical) A payment/rent made “in kind” (e.g., grain, wine, or other goods) owed by a tenant to a landowner; a kind of levy or due paid with produce rather than money. ([quod.lib.umich.edu](https://quod.lib.umich.edu/e/eebo2/A50820.0001.001/393%3A5.11?utm_source=openai))","zh":"（法语，历史用法）以实物（如谷物、葡萄酒等）缴纳的地租/贡赋；指用农产品等而非现金支付的租赋。"},"examples":[{"en":"In some older French records, a farmer might be listed as paying a moison in grain to the landlord.","zh":"在一些较古老的法国档案里，可能会写某位农夫以谷物缴纳 moison 给地主。"},{"en":"The contract specified payment partly in cash and partly as a moison of produce.","zh":"合同规定部分用现金支付，部分以农产品作为 moison 支付。"}]},{"partOfSpeech":"n.","definition":{"en":"(French, rare) The molting/shedding period in certain animals, especially birds and snakes. ([lalanguefrancaise.com](https://www.lalanguefrancaise.com/dictionnaire/definition/moison?utm_source=openai))","zh":"（法语，较少见）某些动物（尤其鸟类与蛇类）的换羽/蜕皮期。"},"examples":[{"en":"The bird looks scruffy during its moison.","zh":"这只鸟在换羽期（moison）看起来毛躁凌乱。"},{"en":"Some reptiles become less active during the moison.","zh":"有些爬行动物在蜕皮期（moison）活动会减少。"}]},{"partOfSpeech":"n.","definition":{"en":"A French surname (family name), sometimes written with a diaeresis as Moïson. ([rfgenealogie.com](https://www.rfgenealogie.com/noms/moison?utm_source=openai))","zh":"法国姓氏（家族姓），有时写作带分音符的 Moïson。"},"examples":[{"en":"Her last name is Moison, and her family is originally from France.","zh":"她的姓是 Moison，家族最初来自法国。"}]}],"synonyms":["in-kind rent","produce rent","levy","due","molting","shedding","family name","surname"],"phonetic":"/mwɑˈzɔ̃/","extraExplanation":["“moison”并不是常见英语词；如果你是在写英语，可能是拼错了：\n- **moisson**（法语）更常见，意思是“收获/收割（harvest）”。([en.pons.com](https://en.pons.com/translate/french-english/moisson?utm_source=openai))\n- **monsoon**（英语）是“季风/雨季”。\n- **mason**（英语）是“泥瓦匠/石匠”。\n如果你告诉我你看到它的句子（或你想表达的意思），我可以帮你判断到底应该用哪个词。"]}
{"word":"moissanite","summary":{"en":"Moissanite is a lab-grown gemstone that looks like a diamond and is commonly used in jewelry.","zh":"莫桑石是一种实验室培育的宝石，外观类似钻石，常用于珠宝首饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lab-grown gemstone made of silicon carbide (SiC) that looks similar to a diamond and is often used in jewelry","zh":"一种由碳化硅（SiC）制成的实验室培育宝石，外观类似钻石，常用于珠宝首饰"},"examples":[{"en":"She chose a moissanite ring because it looks like a diamond but costs less.","zh":"她选择莫桑石戒指，因为它看起来像钻石，但价格更低。"},{"en":"Moissanite can show colorful flashes of light in bright sunlight.","zh":"莫桑石在强烈阳光下可能会呈现出彩色的闪光。"}]}],"synonyms":["silicon carbide (gemstone)"],"phonetic":"/ˈmɔɪ.sə.naɪt/","extraExplanation":["“Moissanite”中文常译为“莫桑石”，名字来自法国科学家 Henri Moissan（亨利·莫桑）。他在陨石中发现了这种矿物的天然形态；不过市面上用于首饰的莫桑石几乎都是实验室培育的。","学习者常把 moissanite 和 diamond（钻石）混淆：它们外观相近，但材质不同。日常表达里，你可以说 “a moissanite stone / a moissanite ring / moissanite jewelry”。","发音提示：重音通常在第一音节 MOY-，中间的 -ss- 发 /s/ 音，结尾 -nite 读作 /naɪt/，和 “night” 同音。"]}
{"word":"moist","summary":{"en":"“Moist” means slightly wet or pleasantly not dry, and it can also describe tearful eyes or an emotional tone.","zh":"“moist”表示“微湿/湿润”，也可形容“眼眶湿润、带泪的（情绪）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slightly wet; having a small amount of water or liquid (not dry, but not soaking).","zh":"微湿的；带有少量水分的（不干，但也不是湿透）。"},"examples":[{"en":"The cake stayed moist even after two days.","zh":"这块蛋糕放了两天仍然很湿润。"},{"en":"Wipe your hands on a moist towel.","zh":"用一条微湿的毛巾擦擦手。"},{"en":"The soil should be moist, not muddy.","zh":"土壤应保持湿润，但不要变成泥浆。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of eyes or voice) showing strong emotion, often sadness or tenderness.","zh":"（指眼睛或声音）含泪的；流露出强烈情绪（常为悲伤或温柔）。"},"examples":[{"en":"She gave a moist smile as she thanked everyone.","zh":"她含着泪微笑着感谢大家。"},{"en":"His eyes were moist when he spoke about his mother.","zh":"他说起母亲时眼睛湿润了。"}]}],"synonyms":["damp","humid","wet","dewy"],"phonetic":"/mɔɪst/","extraExplanation":["在英语里，moist在日常中常用于食物（moist cake / moist chicken）和皮肤护理（moisturizer 保湿霜）。它强调“有水分、柔润”，通常是正面含义。","在网络文化里，moist有时会被少数人觉得“听起来不舒服”，但在正式英语和大多数语境中它非常普通、常用，不需要刻意回避。"]}
{"word":"moisten","summary":{"en":"Moisten means to make something slightly wet or to become slightly wet.","zh":"moisten 指“使……稍微变湿/湿润”，也可指“变得湿润”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something slightly wet; to add a small amount of water or liquid","zh":"使（某物）稍微变湿；给……加一点水或液体"},"examples":[{"en":"Moisten the cloth before you wipe the screen.","zh":"擦屏幕之前先把布稍微弄湿。"},{"en":"She moistened her lips with a sip of water.","zh":"她喝了一小口水润了润嘴唇。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become slightly wet","zh":"变得稍微湿润"},"examples":[{"en":"The soil will moisten after the rain.","zh":"下雨后土壤会变得湿润。"},{"en":"His eyes moistened when he talked about his family.","zh":"他谈到家人时眼睛湿润了。"}]}],"synonyms":["dampen","wet","humidify"],"phonetic":"/ˈmɔɪsən/","extraExplanation":["“moisten”通常表示“稍微湿润”，比“wet”更轻、更温和，常用于日常动作（如弄湿布、润唇）或较含蓄的情感描写（eyes moistened 表示“眼眶湿润/快哭了”但不一定真的流泪）。","常见搭配：moisten a cloth/towel（把布/毛巾弄湿）、moisten your lips（润唇）、moisten the soil（湿润土壤）。"]}
{"word":"moistened","summary":{"en":"“Moistened” means slightly wet (dampened) or describes something that has been made a little wet.","zh":"“moistened”表示“微微湿润的/被弄湿的”，也可作“moisten（使湿润）”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made slightly wet; dampened (often used to describe food, a surface, air, or eyes).","zh":"被弄湿的；潮湿的；稍微湿润的（常用来形容食物、表面、空气或眼睛）。"},"examples":[{"en":"Wipe the table with a moistened cloth before you eat.","zh":"吃饭前用湿布把桌子擦一擦。"},{"en":"Add a little water until the soil is evenly moistened, not soaked.","zh":"加一点水，让土壤均匀湿润，但不要泡得太湿。"},{"en":"His voice softened and his eyes looked moistened with emotion.","zh":"他的声音柔和下来，眼睛也像是因情绪而湿润了。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “moisten”: to make something slightly wet or less dry.","zh":"“moisten”的过去式/过去分词：使……变湿；使……不那么干。"},"examples":[{"en":"She moistened the sponge and cleaned the stain.","zh":"她把海绵弄湿，然后把污渍擦掉了。"},{"en":"He moistened his lips before speaking.","zh":"他说话前润了润嘴唇。"}]}],"synonyms":["damp","dampened","slightly wet","wet (often stronger)","humid (for air)"],"phonetic":"/ˈmɔɪsənd/","extraExplanation":["“moistened”常见两种用法：①作形容词（moistened cloth/soil/air/eyes），强调“微微湿润”；②作动词的过去式/过去分词（moistened the sponge / lips），表示“把……弄湿”。","语气上，“moistened”通常比“wet”更轻、更温和：wet可能表示很湿甚至湿透；moistened更接近“dampened / slightly wet”。","与“eyes moistened”相关的表达比较含蓄，英语里常用来描述“快要哭/感动到眼眶湿润”，比直接说“crying”更委婉。"]}
{"word":"moistener","summary":{"en":"Moistener means something that adds moisture, but it’s less common than moisturizer (skin) or humidifier (air).","zh":"Moistener 指“增加水分/湿度的东西”，但日常更常说护肤用 moisturizer、空气用 humidifier。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A product or device that adds moisture to something (such as skin, air, or a material).","zh":"给某物增加水分/湿度的产品或装置（如皮肤、空气或材料）。"},"examples":[{"en":"This room feels dry in winter, so we use a moistener to improve the air.","zh":"这个房间冬天很干，所以我们用加湿装置来改善空气。"},{"en":"Apply a moistener to your hands after washing them.","zh":"洗完手后在手上涂一点保湿产品。"}]}],"synonyms":["moisturizer","humidifier","hydrator"],"phonetic":"/ˈmɔɪsənər/","extraExplanation":["“moistener”在日常英语里不算常见。谈护肤品时，更常用的是“moisturizer”（保湿霜/乳）。谈空气湿度时，更常用的是“humidifier”（加湿器）。","构词上，“moisten”（使潮湿）+“-er”（做某事的人/物）→“moistener”（使变湿的东西）。虽然意思清楚，但母语者通常会选更固定、更常用的词。"]}
{"word":"moisteners","summary":{"en":"Moisteners are things (often products or devices) that add moisture or make something slightly wet.","zh":"Moisteners 指用来增加水分或使某物稍微变湿的东西（常见为产品或装置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A product or substance used to add moisture to something (such as skin, hair, air, or soil).","zh":"用于给某物增加水分的产品或物质（如皮肤、头发、空气或土壤）。"},"examples":[{"en":"These moisteners help keep the skin from drying out in winter.","zh":"这些保湿产品有助于在冬天防止皮肤变干。"},{"en":"Farmers may use soil moisteners during very dry seasons.","zh":"在非常干旱的季节，农民可能会使用土壤保湿剂。"}]},{"partOfSpeech":"n.","definition":{"en":"People or things that moisten something (make it slightly wet).","zh":"使某物变湿（稍微弄湿）的“人或事物”。"},"examples":[{"en":"In the factory, special machines act as moisteners for the paper before printing.","zh":"在工厂里，特殊机器在印刷前会作为纸张的加湿装置。"}]}],"synonyms":["moisturizers","humidifiers","dampeners","wetting agents"],"phonetic":"/ˈmɔɪsənɚz/","extraExplanation":["“moistener”来自动词“moisten”（使变湿、润湿）。日常英语里更常见的说法往往是“moisturizer”（护肤保湿霜/乳）或“humidifier”（加湿器）。如果你想表达“护肤保湿产品”，通常用“moisturizer(s)”更自然。"]}
{"word":"moistening","summary":{"en":"Moistening means adding a little liquid to make something slightly wet or less dry, often in care, cleaning, cooking, or health contexts.","zh":"Moistening 指加入少量液体，让某物变得微湿或不那么干，常见于护理、清洁、烹饪或健康相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something slightly wet or less dry; adding a small amount of water or other liquid","zh":"使某物变得微湿/不那么干的行为或过程；加入少量水或其他液体"},"examples":[{"en":"Moistening the cloth first makes it easier to wipe dust off the table.","zh":"先把抹布稍微弄湿，会更容易把桌上的灰擦掉。"},{"en":"The doctor recommended moistening the air in the room to ease her cough.","zh":"医生建议把房间空气加湿，以缓解她的咳嗽。"}]},{"partOfSpeech":"other","definition":{"en":"making something slightly wet; the action of wetting (often used in instructions)","zh":"把某物稍微弄湿的动作（常用于说明/步骤）"},"examples":[{"en":"After moistening the paper towel, place it over the dough to prevent drying.","zh":"把纸巾稍微弄湿后盖在面团上，防止变干。"},{"en":"Moistening your lips before speaking can help if your mouth feels dry.","zh":"说话前先润一下嘴唇，如果口干会有帮助。"}]}],"synonyms":["dampening","wetting","humidifying","hydrating"],"phonetic":"/ˈmɔɪs.nɪŋ/","extraExplanation":["“moistening”通常是动词“moisten”的现在分词（-ing），在句子里常用作：①名词（表示“湿润/加湿的过程”）；②形容词式用法（修饰名词，如“moistening spray”=“保湿喷雾”）；③进行时的一部分（He is moistening…=“他正在弄湿……”）。","常见搭配：moistening lotion（保湿乳/润肤露）、moistening spray（保湿喷雾）、moistening the air（加湿空气）、moistening your lips（润唇）。","易混词：moistening（弄湿/润湿，一般是“少量、轻微”） vs. soaking（浸透，很多水） vs. wetting（弄湿，较中性）。"]}
{"word":"moistens","summary":{"en":"“Moistens” means “makes something a little wet” or “becomes slightly wet.”","zh":"“moistens”表示“使……稍微变湿/润湿”，或“（自己）变得湿润”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something slightly wet or damp; to add a little moisture","zh":"使（某物）稍微变湿；给……增加少量水分"},"examples":[{"en":"She moistens the cloth before wiping the table.","zh":"她先把布稍微弄湿，再擦桌子。"},{"en":"The nurse moistens the patient’s lips with water.","zh":"护士用水润湿病人的嘴唇。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of eyes or weather) to become slightly wet","zh":"（指眼睛或天气）变得湿润；微微潮湿"},"examples":[{"en":"His eyes moistened when he heard the news.","zh":"他听到消息时，眼睛湿润了。"},{"en":"The air moistens near the coast at night.","zh":"夜里靠海的空气会变得更潮湿。"}]}],"synonyms":["dampens","wets","hydrates","humidifies"],"phonetic":"ˈmɔɪsənz","extraExplanation":["“moistens”是动词“moisten”的第三人称单数（he/she/it moistens），常见于说明步骤、习惯动作或一般事实。","情感语境里常用“eyes moistened”（眼眶湿润），比“cry”更含蓄，强调只是开始有泪意、未必真的哭出来。"]}
{"word":"moister","summary":{"en":"“Moister” means “more moist”—slightly wetter or more lightly damp than something else.","zh":"“moister”表示“更湿润/更潮”，即比另一事物更湿一点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “moist”: slightly more wet or lightly damp than something else.","zh":"“moist”的比较级：比另一事物更湿润、稍微更潮。"},"examples":[{"en":"Keep the cake in an airtight container so it stays moister.","zh":"把蛋糕放在密封盒里，这样能保持更湿润。"},{"en":"After the rain, the soil is moister near the river.","zh":"下雨后，河边的土壤更湿一些。"},{"en":"This towel is moister than that one, so let it dry longer.","zh":"这条毛巾比那条更潮，所以要晾久一点。"}]}],"synonyms":["more moist","wetter","damp(er)","more humid"],"phonetic":"/ˈmɔɪstər/","extraExplanation":["在日常英语里，“moister”最常见于对比说明湿度（如食物口感、皮肤、空气、土壤）。","文化小提醒：有些英语母语者会觉得“moist”这个词听起来不舒服（网络上常被提到），但在正式或中性场合它仍然很常用，尤其在烘焙、美妆、医学等语境。若想更中性，也可用“more humid”（更潮湿，偏空气）或“more damp”（更潮，偏物体表面）。"]}
{"word":"moistest","summary":{"en":"“Moistest” means “the most moist,” used to compare several things.","zh":"“moistest”表示“最湿润的”，用于在多者之间进行比较。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of moist: having the most slight wetness; the least dry compared with other things.","zh":"moist 的最高级：最湿润的；在比较中最不干燥的。"},"examples":[{"en":"Of all the cakes, this one stayed the moistest after two days.","zh":"在所有蛋糕里，这个放了两天后仍然最湿润。"},{"en":"Keep the towels in a sealed bag so they remain the moistest.","zh":"把毛巾放在密封袋里，这样它们能保持最湿润。"}]}],"synonyms":["most moist","dampest","least dry","most succulent"],"phonetic":"/ˈmɔɪstɪst/","extraExplanation":["“moistest”是规则变化：moist → moister → moistest。口语里也有人用“most moist”，但一般写作与考试更偏好“moistest”。","在英语文化里，“moist”有时会因为网络梗被少数人觉得“听起来怪”，但在烘焙、护肤、气象等语境中非常常见且中性；“moistest”多见于比较不同食物口感（蛋糕、面包、烤鸡等）。"]}
{"word":"moistful","summary":{"en":"Moistful (rare) means slightly wet or damp; it sounds literary or old-fashioned.","zh":"moistful（少见）表示“微湿、潮湿”，语气偏文学或旧式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slightly wet; moist or damp (rare, literary/old-fashioned).","zh":"微湿的；潮湿的（较少见，多用于文学或旧式表达）。"},"examples":[{"en":"The morning air felt moistful after the light rain.","zh":"小雨过后，清晨的空气带着微微的潮湿。"},{"en":"She pressed a moistful cloth to his forehead.","zh":"她把一块微湿的布按在他的额头上。"},{"en":"A moistful wind drifted in from the sea.","zh":"一阵带着潮气的海风吹了过来。"}]}],"synonyms":["moist","damp","humid","dewy"],"phonetic":"/ˈmɔɪstfəl/","extraExplanation":["“moistful”在现代英语里非常少用，更多见于较旧的文本或刻意的文学化表达。日常英语更常用“moist / damp / humid”。","构词上可理解为“moist + -ful（充满……的）”，意思接近“充满湿气的”。不过因为不常见，用在正式写作里可能显得怪或不自然。","如果你想表达“含水分很多/湿度很高”，可用：humid（湿热/湿度大）、clammy（又湿又黏，常指皮肤/空气不舒服）、soggy（湿透、泡软）。"]}
{"word":"moistify","summary":{"en":"Moistify means to make something damp or add moisture to it. It is understandable but not very common; moisten/dampen/moisturize are used more often.","zh":"Moistify 的意思是“使变湿/增加水分”。这个词能理解但不太常用，更常见的是 moisten、dampen，护肤语境常用 moisturize。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something slightly wet or damp; to add moisture","zh":"使（某物）变湿；使潮湿；增加水分"},"examples":[{"en":"Moistify a clean cloth before you wipe the screen.","zh":"先把干净的布稍微弄湿，再擦屏幕。"},{"en":"The steam can moistify the air in a dry room.","zh":"蒸汽可以让干燥的房间空气变得更湿润。"}]}],"synonyms":["moisten","dampen","humidify","moisturize"],"phonetic":"/ˈmɔɪstɪˌfaɪ/","extraExplanation":["“moistify”是由形容词 moist（潮湿的）+ 动词后缀 -ify（使……变成……）构成，意思就是“使变得潮湿”。","在日常英语里，人们更常用的说法是 moisturize（用于皮肤/护肤品）、dampen（轻轻弄湿）、moisten（使变湿）。因此“moistify”虽然能理解，但相对少见，写作或口语中建议优先用更常见的词。"]}
{"word":"moistiness","summary":{"en":"“Moistiness” means the quality of being slightly wet or containing some moisture, especially in food, skin, or air.","zh":"“Moistiness”指“湿润/微湿的状态或程度”，常用于食物口感、皮肤保湿或空气湿润感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being slightly wet; a small amount of water or liquid in something (often pleasant or useful, not soaking wet).","zh":"微湿、湿润的状态或程度；含有少量水分（通常不是“湿透”，而是舒服或有益的那种湿润）。"},"examples":[{"en":"The moistiness of the cake kept it soft even the next day.","zh":"蛋糕的湿润度让它到第二天还是很松软。"},{"en":"A little moistiness in the air can make the room feel warmer.","zh":"空气里有一点湿润感，会让房间感觉更暖和。"},{"en":"The moisturizer adds moistiness to dry skin.","zh":"保湿霜能给干燥的皮肤增加湿润感。"}]},{"partOfSpeech":"n.","definition":{"en":"In food, the amount of moisture that affects texture and freshness (similar to “moisture content”).","zh":"（尤指食物）影响口感与新鲜度的含水量或湿润程度（类似“含水量/水分含量”）。"},"examples":[{"en":"Bread with the right moistiness doesn’t crumble easily.","zh":"湿润度合适的面包不容易掉渣。"},{"en":"Too much moistiness can make cookies lose their crunch.","zh":"湿润度太高会让饼干不再酥脆。"}]}],"synonyms":["moisture","dampness","humidity","wetness"],"phonetic":"ˈmɔɪstnəs","extraExplanation":["“moistiness”来自形容词“moist（湿润的）”，加名词后缀“-ness”表示“……的状态/性质”。日常更常用的是“moisture（湿气/水分）”或“humidity（湿度）”。","语感上，“moistiness”常带有“刚刚好、柔软、舒适”的湿润感（比如蛋糕、皮肤、空气），而不是“wetness”那种更明显的“湿/湿透”。","在不同场景可替换：谈空气常用“humidity”；谈材料或食物的水分含量常用“moisture content”；谈皮肤护理常用“moisture”或“hydration”。"]}
{"word":"moistish","summary":{"en":"Moistish means “a little moist”—slightly wet, in an informal way.","zh":"moistish 表示“有点潮湿/略微湿润”，属于比较口语的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Somewhat moist; a little wet, but not fully wet.","zh":"（非正式）有点潮湿的；微微湿的，但还没到“很湿/湿透”的程度。"},"examples":[{"en":"The cake is moistish—soft, but it could be a bit juicier.","zh":"这个蛋糕有点湿润——口感软，但还可以再多一点汁水/湿润感。"},{"en":"My hair is still moistish after the rain.","zh":"淋过雨后，我的头发还是有点潮。"},{"en":"Wipe the counter again; it’s moistish and might attract dust.","zh":"再擦一下台面；还有点潮，可能会更容易粘灰。"}]}],"synonyms":["slightly moist","somewhat damp","a bit wet","dampish","humidish"],"phonetic":"/ˈmɔɪs.tɪʃ/","extraExplanation":["“moistish” = moist（潮湿的/湿润的）+ -ish（表示“有点、差不多、略微”）。英语里很多口语都会用“-ish”来让语气更随意、也更不绝对，比如: smallish（有点小）、greenish（略绿）、sixish（大概六点左右）。","它通常用于轻松的口语/聊天/吐槽，不太适合正式写作。更正式一点可以用 “slightly moist / somewhat damp”。","注意语感：moistish 往往表示“介于干和湿之间”，含有“还没到完全湿”的意思；如果是“湿到黏/湿透”，更常用 soaking wet / soggy。"]}
{"word":"moistishness","summary":{"en":"Moistishness is an informal, playful word meaning “slight moistness” or “a kind-of-moist quality.”","zh":"Moistishness 是一种非正式、带点玩笑感的说法，表示“微微潮湿/有点湿润的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A humorous or informal made-up noun meaning “a slight degree of moisture” or “the quality of being kind of moist.”","zh":"一个幽默或非正式的自造名词，意思是“有点潮湿的程度”或“有点湿润的状态”。"},"examples":[{"en":"The cake had a pleasant moistishness, not too wet and not too dry.","zh":"这个蛋糕有一种恰到好处的“微湿感”，不太湿也不太干。"},{"en":"After the rain, the air had a cool moistishness that made the park smell fresh.","zh":"雨后空气里有一种清凉的“微潮感”，让公园闻起来很清新。"}]}],"synonyms":["slight dampness","a hint of moisture","mild moistness","light humidity"],"phonetic":"/ˈmɔɪstɪʃnəs/","extraExplanation":["“moistishness”不是标准词典里常见的正规词，更像是口语里为了表达“有点……但不完全……”而临时造出来的词。","构词方式很直观：moist（潮湿的）+ -ish（“有点、稍微”）→ moistish（有点潮的）+ -ness（把形容词变名词，表示“……的状态/性质”）→ moistishness（微潮/微湿的状态）。","在正式写作中更自然的表达通常是：a slight dampness / a hint of moisture / mild moistness。"]}
{"word":"moistless","summary":{"en":"Moistless means “without moisture; very dry.” It is uncommon in everyday English.","zh":"moistless 意为“无水分的；很干燥的”，但在日常英语中较少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without moisture; not moist (very dry).","zh":"无水分的；不湿润的（很干燥的）。"},"examples":[{"en":"After days in the sun, the soil became moistless and cracked.","zh":"在太阳下晒了好几天后，土壤变得无水分并出现裂缝。"},{"en":"The air in the cabin felt moistless, so we used a humidifier.","zh":"小屋里的空气感觉很干燥几乎无湿气，所以我们用了加湿器。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/literary) Lacking freshness or softness that comes from moisture; parched.","zh":"（少见/文学用法）缺少因水分带来的柔润或新鲜感；干枯的。"},"examples":[{"en":"Her lips were moistless from the cold wind.","zh":"她的嘴唇被冷风吹得干裂。"}]}],"synonyms":["dry","very dry","parched","arid","moistureless"],"phonetic":"/ˈmɔɪstləs/","extraExplanation":["“moistless”在现代英语里不太常见，日常更自然的说法通常是“dry / very dry / parched”，或更书面一些用“moistureless”。","构词上是“moist（湿润的）+ -less（没有……的）”，意思直观，但因为习惯表达的原因，母语者更常用上面那些替代词。"]}
{"word":"moistly","summary":{"en":"Moistly means “in a moist (slightly wet) way,” and it’s a relatively uncommon adverb in modern English.","zh":"moistly 意为“以微湿/潮湿的方式”，是现代英语中相对少见的副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a moist way; slightly wet rather than dry","zh":"以潮湿的方式；微湿而不干燥"},"examples":[{"en":"The towel felt moistly cool against my skin.","zh":"毛巾贴在皮肤上，带着微湿的凉意。"},{"en":"The soil looked moistly dark after the rain.","zh":"雨后土壤看起来湿润发黑。"}]},{"partOfSpeech":"adv.","definition":{"en":"(less common) in a humid or damp atmosphere","zh":"（较少见）在潮湿、湿热的环境中"},"examples":[{"en":"The air hung moistly over the bay in the morning.","zh":"清晨，海湾上空的空气潮湿地弥漫着。"}]}],"synonyms":["damply","wetly","humidly"],"phonetic":"/ˈmɔɪstli/","extraExplanation":["“moistly”在现代英语里比较少用，更常见的是用“moist”作形容词（e.g., moist air / moist skin）或用短语表达（e.g., in a moist way）。","在流行文化里，“moist”这个词有时会被拿来开玩笑说“听起来不舒服”，但在正式写作或日常描述食物、皮肤、空气湿度时，它是正常且准确的词。"]}
{"word":"moistness","summary":{"en":"Moistness means the state or degree of being slightly wet, or a small wet feeling (often on skin or in the air).","zh":"Moistness 指“湿润/微湿的状态或程度”，也可指（皮肤或空气中）轻微的湿意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being slightly wet; a small amount of water in something.","zh":"湿润；微湿的状态或性质；（某物中的）少量水分。"},"examples":[{"en":"The moistness of the soil helps the seeds grow.","zh":"土壤的湿润有助于种子生长。"},{"en":"I could feel the moistness in the air after the rain.","zh":"雨后我能感觉到空气中的湿气。"},{"en":"Check the cake’s moistness by inserting a toothpick.","zh":"用牙签插入蛋糕来检查它的湿润程度。"}]},{"partOfSpeech":"n.","definition":{"en":"A slight wetness on a surface, especially on skin (often from sweat or humidity).","zh":"（表面，尤指皮肤上的）微微湿意；（常由汗或潮湿空气造成）。"},"examples":[{"en":"There was a moistness on his forehead from the heat.","zh":"炎热让他的额头微微出汗，带着湿意。"},{"en":"She wiped away the moistness on her hands before shaking hands.","zh":"她在握手前擦掉手上的湿意。"}]}],"synonyms":["moisture","dampness","wetness","humidity"],"phonetic":"/ˈmɔɪstnəs/","extraExplanation":["“moistness”来自形容词“moist（湿润的）”加名词后缀“-ness（……的状态/性质）”。日常更常用“moisture（水分/湿气）”，比如“skin moisture（皮肤水分）”“moisture in the air（空气湿度）”。“moistness”更强调“湿润程度/湿润这一特性”，常见于描述土壤、蛋糕口感、空气、皮肤等。","文化用法提示：在一些英语语境里，“moist”这个词偶尔会被当作“让人不舒服的词”（多为玩笑或个人偏好），但在烘焙、护肤、气象等正式或中性场景中非常常用、完全正常。"]}
{"word":"moistnesses","summary":{"en":"“Moistnesses” is the plural of “moistness,” meaning different degrees/amounts of slight wetness; it’s uncommon in everyday English—“moisture levels” is more natural.","zh":"“Moistnesses”是“moistness”的复数，表示不同程度/不同量的潮湿；日常英语较少用，通常说“moisture levels（湿度水平）”更自然。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being slightly wet; the amount of moisture in something (plural)","zh":"潮湿（略湿）的状态或程度；湿气/水分的含量（复数）"},"examples":[{"en":"Different moistnesses in the soil can affect how fast seeds grow.","zh":"土壤里不同的湿润程度会影响种子生长的速度。"},{"en":"The recipe works best with small moistnesses in the cake crumbs, not dryness.","zh":"这个配方在蛋糕碎屑略带湿润时效果最好，而不是很干的时候。"}]}],"synonyms":["moisture levels","degrees of moistness","dampness (levels)","humidity (levels)"],"phonetic":"/ˈmɔɪstnəsɪz/","extraExplanation":["“Moistnesses”是“moistness”的复数形式，但在日常英语里不太常见。多数时候英语更喜欢用不可数名词“moisture”（湿气/水分）或用“levels of moisture / degrees of moistness”（湿度水平/湿润程度）来表达。","更自然的替换：\n- scientific/technical：moisture content（含水量）, humidity levels（湿度水平）\n- everyday：how damp/wet it is（有多潮/多湿）\n在写作中如果你想强调“不同类型/不同程度的湿润”，用“different levels of moisture”通常比“moistnesses”更地道。"]}
{"word":"moisture","summary":{"en":"Moisture means a small amount of water or wetness, especially in air, soil, skin, or on surfaces.","zh":"Moisture 指“水分/湿气/潮气”，常用于空气、土壤、皮肤或表面上的少量湿润。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small amount of water or wetness in the air, on a surface, or in something.","zh":"少量的水分；潮气；湿气（存在于空气、表面或物体中）。"},"examples":[{"en":"Plants need enough moisture in the soil to grow well.","zh":"植物需要土壤中有足够的水分才能长得好。"},{"en":"There was moisture on the window in the morning.","zh":"早晨窗户上有一层湿气（水珠）。"},{"en":"This cream helps your skin keep moisture.","zh":"这款面霜能帮助皮肤锁住水分。"}]}],"synonyms":["dampness","wetness","humidity (in the air)","water content"],"phonetic":"/ˈmɔɪstʃər/","extraExplanation":["“moisture”是不可数名词时最常见，常搭配：moisture in the air（空气湿度）、retain/lock in moisture（保湿/锁水）、moisture content（含水量）。","相关形容词是“moist”（潮湿的），名词“humidity”更偏“空气的湿度（气象概念）”，而“moisture”既可指空气中的潮气，也可指物体/皮肤/土壤里的水分。"]}
{"word":"moistureless","summary":{"en":"Moistureless means completely without moisture; very dry.","zh":"Moistureless 指“没有水分的；非常干燥的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no moisture; completely dry.","zh":"没有水分的；完全干燥的。"},"examples":[{"en":"The air in the desert can feel moistureless, especially at noon.","zh":"沙漠里的空气会让人感觉很干燥，尤其是中午。"},{"en":"After sitting under the heater all day, my skin became moistureless and tight.","zh":"在暖气下待了一整天后，我的皮肤变得很干、发紧。"},{"en":"Store the powder in a moistureless place to prevent clumping.","zh":"把粉末存放在干燥处，避免结块。"}]}],"synonyms":["dry","parched","arid","moisture-free"],"phonetic":"/ˈmɔɪstʃɚləs/","extraExplanation":["“moistureless”不是最常见的日常用词，更常见的说法是“dry”“very dry”或“moisture-free”。在说明书、护肤品文案或技术描述（如存储条件）里更可能见到。","常见搭配：moistureless skin（极干皮/缺水的皮肤）、moistureless air（干燥空气）、a moistureless environment/place（干燥环境/地点）。"]}
{"word":"moistureproof","summary":{"en":"“Moistureproof” means designed to keep moisture (dampness or water vapor) out, especially in packaging and storage.","zh":"“moistureproof”指“防潮的”，常用于包装和储存，强调阻隔湿气（潮气）进入。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to stop moisture (water vapor) from getting in or passing through; waterproof against dampness.","zh":"防潮的；能阻止湿气（水蒸气）进入或渗透的。"},"examples":[{"en":"Keep the medicine in a moistureproof container.","zh":"把药品放在防潮容器里保存。"},{"en":"The cookies come in a moistureproof package to stay fresh.","zh":"饼干用防潮包装来保持新鲜。"}]}],"synonyms":["moisture-resistant","damp-proof","humidity-resistant","sealed"],"phonetic":"/ˈmɔɪstʃərˌpruːf/","extraExplanation":["“moistureproof”常见于包装、储存与材料说明（如药品、食品、电子产品、墙体材料）。它强调“防湿气/防潮”，不一定等同于“waterproof（防水）”；waterproof更偏向防液态水，而moistureproof更偏向防潮气和湿度。","构词：moisture（湿气）+ proof（防……的）。在美国英语里也常写作“moisture-proof”（带连字符），意思相同。"]}
{"word":"moistures","summary":{"en":"“Moistures” is the plural of “moisture,” used mostly in technical contexts to mean water content or dampness in different samples/places.","zh":"“moistures” 是 “moisture” 的复数，主要用于技术/科研语境，表示不同样品或不同位置的含水量/潮气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of **moisture**: small amounts of water or dampness (often in air, on surfaces, or in materials); in science, it can mean the water content of something","zh":"**moisture** 的复数：指少量的水分、潮气（常见于空气、表面或材料中）；在科学语境中也可指某物的含水量"},"examples":[{"en":"Different **moistures** in the soil can affect how well plants grow.","zh":"土壤中不同程度的**水分**会影响植物的生长情况。"},{"en":"The engineer measured the **moistures** of the samples before testing them.","zh":"工程师在测试前测量了样品的**含水量（复数）**。"}]}],"synonyms":["dampness","humidity","water content"],"phonetic":"/ˈmɔɪstʃər/","extraExplanation":["在日常英语里，**moisture** 通常是不可数名词（uncountable），更常说：*There is moisture in the air.*（空气里有湿气。）","用 **moistures**（复数）多见于技术/科研/农业等语境，表示“不同样品/不同位置的含水量”或“多处的水分状况”。日常表达里一般不需要用复数。","如果你想表达“保湿产品”，英语里更常说 **moisturizer**（保湿霜/润肤乳），而不是 *moistures*。"]}
{"word":"moisturise","summary":{"en":"Moisturise means to add moisture or to apply lotion/cream to prevent dryness, especially for skin.","zh":"moisturise 指给……补水或涂抹乳液/面霜来防止干燥，尤指皮肤保湿。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add moisture to something; to make it less dry (especially skin).","zh":"给……增加水分；使不那么干（尤指皮肤）。"},"examples":[{"en":"This lotion helps moisturise dry hands in winter.","zh":"这款乳液能在冬天滋润干燥的双手。"},{"en":"Moisturise your face after washing it.","zh":"洗完脸后给脸部保湿。"}]},{"partOfSpeech":"vi.","definition":{"en":"to use a cream or lotion on your skin to keep it soft and hydrated.","zh":"（给皮肤）涂抹面霜/乳液以保持柔软和水润。"},"examples":[{"en":"I moisturise every night before bed.","zh":"我每晚睡前都会做保湿。"},{"en":"If your skin feels tight, moisturise more often.","zh":"如果皮肤觉得紧绷，就更频繁地保湿。"}]}],"synonyms":["hydrate","moisten","condition (skin/hair)","use lotion"],"phonetic":"/ˈmɔɪstʃəˌraɪz/","extraExplanation":["“moisturise”是英式拼写；美式拼写更常见的是“moisturize”。两者意思和用法相同，只是拼写差异。","常见搭配：moisturise your skin/face/hands；moisturising cream/lotion（保湿霜/乳液）。"]}
{"word":"moisturiser","summary":{"en":"A (UK-spelled) skin-care product used to keep skin soft and prevent dryness.","zh":"（英式拼写）用于滋润皮肤、防止干燥的护肤品（保湿霜/润肤乳等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(UK spelling) A skin-care product (cream, lotion, etc.) you put on your skin to keep it soft and prevent dryness; also called “moisturizer” in American English.","zh":"（英式拼写）保湿霜/润肤乳等护肤品，用于滋润皮肤、防止干燥；美式拼写为“moisturizer”。"},"examples":[{"en":"I use a moisturiser every night because my skin gets dry in winter.","zh":"我每晚都会用保湿霜，因为冬天皮肤会变干。"},{"en":"This moisturiser is fragrance-free, so it’s better for sensitive skin.","zh":"这款保湿霜不含香精，所以更适合敏感肌。"},{"en":"Don’t forget sunscreen in the morning—even if your moisturiser feels protective.","zh":"早上别忘了防晒——即使你的保湿霜用起来感觉很“保护”。"}]}],"synonyms":["moisturizer","skin cream","lotion","hydrating cream"],"phonetic":"/ˈmɔɪs.tʃəˌraɪ.zɚ/","extraExplanation":["“moisturiser / moisturizer”是英式/美式拼写差异：英式常用 -iser（moisturiser），美式常用 -izer（moisturizer）。两者意思相同。","护肤语境里常见相关词：lotion（乳液，较轻薄）、cream（面霜，通常更厚重）、hydrating（补水的，偏“增加水分”）、moisturizing（保湿的，偏“锁住水分”）。"]}
{"word":"moisturize","summary":{"en":"Moisturize means to keep skin (or something else) from drying out by adding or locking in moisture, often by applying lotion or cream.","zh":"Moisturize 指通过涂乳液/面霜等增加或锁住水分，让皮肤（或其他事物）不干燥。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to put a substance (like lotion or cream) on skin to keep it soft and prevent it from becoming dry","zh":"给皮肤涂抹（乳液、面霜等）以保持柔软、避免干燥"},"examples":[{"en":"I moisturize my face every night after washing it.","zh":"我每天晚上洗完脸都会给脸部保湿。"},{"en":"This lotion moisturizes quickly without feeling greasy.","zh":"这款乳液保湿很快，而且不会觉得油腻。"},{"en":"If your hands crack in winter, moisturize after you wash them.","zh":"如果冬天手容易裂，洗完手后要及时保湿。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something (such as air, soil, or a product) contain more moisture; to add moisture","zh":"使某物（如空气、土壤或产品）含有更多水分；增加湿度/水分"},"examples":[{"en":"A humidifier can help moisturize the air in a dry room.","zh":"加湿器可以帮助让干燥房间里的空气更湿润。"},{"en":"Some shampoos are designed to moisturize dry hair.","zh":"有些洗发水专为滋润干燥头发而设计。"}]}],"synonyms":["hydrate","moisten","condition","apply lotion"],"phonetic":"/ˈmɔɪs.tʃəˌraɪz/","extraExplanation":["在护肤语境里，moisturize 常常直接表示“涂保湿霜/乳液”，而不是“让东西变湿”。如果你想强调“补水”的感觉，也会看到 hydrate（补水）这个词；日常口语中两者常被混用，但护肤品牌有时会区分：hydrate 更偏“补水”，moisturize 更偏“锁水、减少干燥”。","常见搭配：moisturize your face/skin/hands；moisturizer（保湿霜/乳液，名词）；moisturizing（保湿的，形容词）。"]}
{"word":"moisturized","summary":{"en":"“Moisturized” means “made less dry by adding moisture,” especially for skin; it can also be the past form of “moisturize.”","zh":"“moisturized”表示“已经补水/保湿、不那么干燥（多指皮肤）”，也可作动词“moisturize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had moisture added; made less dry (often used for skin, hair, or the air).","zh":"已补水/已保湿的；不再干燥的（常用于皮肤、头发或空气）。"},"examples":[{"en":"My hands feel much better now that they’re moisturized.","zh":"我的手保湿后舒服多了。"},{"en":"Use a gentle lotion to keep your face moisturized in winter.","zh":"冬天用温和的乳液让脸保持保湿。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “moisturize”: to add moisture to something, especially skin.","zh":"“moisturize”的过去式/过去分词：给……补水、保湿（尤指皮肤）。"},"examples":[{"en":"I moisturized after showering to prevent dryness.","zh":"我洗完澡后做了保湿，防止皮肤干燥。"},{"en":"She moisturized her elbows because they were getting rough.","zh":"她给手肘做了保湿，因为那里变得有点粗糙。"}]}],"synonyms":["hydrated","moistened","conditioned"],"phonetic":"/ˈmɔɪs.tʃəˌraɪzd/","extraExplanation":["“moisturized”在美式英语里最常见的两种用法：\n1）作形容词：be moisturized（处于“保湿了”的状态）；\n2）作动词过去式：I moisturized…（我给……保湿了）。\n口语里谈护肤时，形容词用法非常高频：keep your skin moisturized（让皮肤保持保湿）。","拼写提示：美式常用 moisturize / moisturized（-ize），英式也常见 moisturise / moisturised（-ise）。意思相同。"]}
{"word":"moisturizer","summary":{"en":"A moisturizer is a skin-care product that helps keep your skin from getting dry.","zh":"Moisturizer 指保湿护肤品，用来给皮肤补水、防止干燥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cream, lotion, or gel you put on your skin to add moisture and prevent dryness","zh":"保湿霜／润肤乳：涂在皮肤上用来补水并防止干燥的乳霜、乳液或凝胶"},"examples":[{"en":"I use a moisturizer every night before bed.","zh":"我每晚睡前都会用保湿霜。"},{"en":"This moisturizer is good for dry skin in winter.","zh":"这款保湿霜很适合冬天干性皮肤。"},{"en":"After washing your face, apply moisturizer while your skin is still slightly damp.","zh":"洗完脸后趁皮肤还微微湿润时涂保湿产品。"}]}],"synonyms":["lotion","cream","skin cream","hydrating lotion"],"phonetic":"/ˈmɔɪs.tʃəˌraɪ.zɚ/","extraExplanation":["在美式英语里，moisturizer 常指“面部或身体的保湿产品”（lotion/cream/gel 都可能）。日常搭配很常见：face moisturizer（面部保湿）、body moisturizer（身体乳）、oil-free moisturizer（无油配方）、fragrance-free moisturizer（无香精）、for sensitive skin（适合敏感肌）。","发音和拼写提示：moisturizer 在美式拼法里用 -izer；英式常见拼法是 moisturiser（-iser）。两者意思相同。"]}
{"word":"moisturizers","summary":{"en":"Moisturizers are skin-care products that add moisture or help the skin keep moisture, preventing dryness.","zh":"Moisturizers 指保湿护肤品，用于补水或锁水，防止皮肤干燥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Products (such as creams, lotions, or ointments) used to keep skin soft and prevent it from becoming dry by adding or locking in moisture.","zh":"保湿产品（如面霜、乳液或软膏），用于让皮肤保持柔软，防止干燥，通过补水或锁水来维持皮肤水分。"},"examples":[{"en":"In winter, many people use heavier moisturizers to protect their skin from cold, dry air.","zh":"冬天很多人会用更滋润的保湿霜，来保护皮肤免受寒冷干燥空气的影响。"},{"en":"After washing your face, apply a moisturizer while your skin is still slightly damp.","zh":"洗完脸后趁皮肤还微微湿润时涂保湿乳/面霜。"},{"en":"This moisturizer is fragrance-free, so it’s a good choice for sensitive skin.","zh":"这款保湿产品不含香精，所以很适合敏感肌。"}]}],"synonyms":["skin cream","lotion","hydrating cream","emollient"],"phonetic":"/ˈmɔɪs.tʃəˌraɪ.zɚz/","extraExplanation":["“Moisturizer”通常是可数名词；你说“moisturizers”是复数，表示“多种保湿产品/几款保湿霜”。日常口语里也常说：I need a moisturizer（我需要一款保湿霜）。","常见搭配：face moisturizer（面部保湿霜）、body moisturizer（身体乳/身体保湿）、oil-free moisturizer（无油配方保湿）、daily moisturizer（日常保湿）、heavy/light moisturizer（厚重/清爽型保湿）。","“Moisturize”是动词：moisturize your skin（给皮肤保湿）；“moisturizing”作形容词：a moisturizing lotion（保湿乳液）。"]}
{"word":"moisturizes","summary":{"en":"“Moisturizes” means “adds moisture; makes something less dry,” and it’s the third-person singular form of “moisturize.”","zh":"“moisturizes”表示“使滋润/保湿、减少干燥”，也是动词“moisturize”的一般现在时第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add moisture to something; to make skin, hair, or another surface less dry","zh":"使……滋润；给……补水；让皮肤、头发或表面不那么干燥"},"examples":[{"en":"This lotion moisturizes dry hands quickly.","zh":"这款乳液能很快滋润干燥的双手。"},{"en":"A good conditioner moisturizes your hair and makes it softer.","zh":"好的护发素会滋润头发，让头发更柔软。"}]},{"partOfSpeech":"other","definition":{"en":"(third-person singular present) of “moisturize”: used when the subject is he/she/it or a singular noun","zh":"“moisturize”的一般现在时第三人称单数形式：主语是 he/she/it 或单数名词时使用"},"examples":[{"en":"It moisturizes while you sleep.","zh":"它会在你睡觉时持续保湿。"},{"en":"This cream moisturizes and protects sensitive skin.","zh":"这款面霜既保湿又能保护敏感肌。"}]}],"synonyms":["hydrates","conditions","softens","soothes"],"phonetic":"/ˈmɔɪs.tʃə.raɪz/","extraExplanation":["“moisturize”常见于护肤/美妆广告语：*moisturizes*（保湿/滋润）常和 *hydrates*（补水）一起出现。日常口语里也可以更简单地说：*It makes my skin less dry.*（它让我的皮肤不那么干。）","拼写小提示：美式英语常见 *moisturize*（-ize），英式英语也常见 *moisturise*（-ise），意思相同。"]}
{"word":"moisturizing","summary":{"en":"“Moisturizing” most often describes skincare or haircare products that help add/lock in moisture and prevent dryness; it can also mean the act of applying moisture.","zh":"“Moisturizing”最常用来形容护肤/护发产品具有保湿、防干燥的作用；也可以指“保湿”这一行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a product or ingredient) adding moisture to the skin or hair; helping prevent dryness.","zh":"（指产品或成分）为皮肤或头发补充水分的；帮助防止干燥的。"},"examples":[{"en":"This moisturizing lotion helps my hands feel soft in winter.","zh":"这款保湿乳液让我的手在冬天也很柔软。"},{"en":"Look for a moisturizing shampoo if your scalp feels dry.","zh":"如果你的头皮觉得干，找一款保湿洗发水。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of adding moisture (water or hydration) to skin, hair, or something that has become dry.","zh":"保湿；补充水分（给皮肤、头发或变干的东西增加水分）的行为。"},"examples":[{"en":"Moisturizing after a shower can help reduce dryness.","zh":"洗澡后保湿可以帮助减轻干燥。"},{"en":"Daily moisturizing is common in many skincare routines.","zh":"每天保湿是很多护肤流程里的常见步骤。"}]}],"synonyms":["hydrating","moistening","conditioning"],"phonetic":"ˈmɔɪs.tʃəˌraɪ.zɪŋ","extraExplanation":["在护肤语境里，**moisturizing（保湿）**通常强调“把水分留住/减少水分流失”，不一定等同于“补水”。很多英文里会把“hydrating（补水）”和“moisturizing（保湿）”区分开：hydrating偏向增加含水量；moisturizing偏向用油脂/保湿剂把水分锁住。","常见相关表达：**moisturizer（保湿霜/乳液）**、**moisturizing cream/lotion（保湿面霜/乳液）**、**deeply moisturizing（深层保湿）**、**non-greasy moisturizing（清爽不油腻的保湿）**。"]}
{"word":"moistus","summary":{"en":"“moistus” isn’t standard English; you probably mean “moist” (slightly wet) or “moisture” (water/dampness).","zh":"“moistus”不是标准英语；你多半想写“moist”（湿润的）或“moisture”（水分/湿气）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“moistus” is not a standard English word; it is most likely a misspelling of “moist” (adjective) or “moisture” (noun).","zh":"“moistus”不是标准英语单词；更可能是把“moist”（形容词：湿润的）或“moisture”（名词：水分/湿气）拼错了。"},"examples":[{"en":"I think you meant “moist”: The cake is still moist after two days.","zh":"我猜你想写的是“moist”：这个蛋糕放了两天还是很湿润。"},{"en":"Or you may have meant “moisture”: Plants need enough moisture to grow.","zh":"或者你想写的是“moisture”：植物生长需要足够的水分。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “moist”) slightly wet; not dry, often pleasantly damp (especially for food, skin, air, soil).","zh":"（如果你想写“moist”）微湿的；不干，常指“湿润但不至于湿透”（常用于食物、皮肤、空气、土壤等）。"},"examples":[{"en":"Keep the towel moist, not dripping wet.","zh":"让毛巾保持湿润，不要滴水。"},{"en":"This climate is warm and moist in summer.","zh":"这里夏天温暖而潮湿。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “moisture”) a small amount of water in the air or in something; humidity; dampness.","zh":"（如果你想写“moisture”）空气中或物体中的水分；湿气；潮气。"},"examples":[{"en":"Wipe away any moisture on the phone before charging it.","zh":"给手机充电前先擦掉表面的水分。"},{"en":"High moisture in the air can make it feel hotter.","zh":"空气湿度高会让人感觉更热。"}]}],"synonyms":["damp","slightly wet","humid","wetness","humidity"],"phonetic":"/mɔɪst/","extraExplanation":["“moist”在口语里常用来形容食物“松软不干”（moist cake / moist bread），也常用于护肤（moist skin）与天气（moist air）。","如果你是在输入法或拼写检查中看到“moistus”，也可能是把“moist + us”误拼在一起；英文里不这样构词。"]}
{"word":"moisty","summary":{"en":"Moisty means slightly wet or pleasantly damp (often about food), and it can also describe eyes that are almost tearful.","zh":"moisty 表示“微湿/湿润”（常用于食物保持湿润），也可形容“眼睛含泪、快哭了”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slightly wet; having a small amount of water or liquid on the surface or in the air.","zh":"微湿的；有少量水分的（表面或空气中含有一点湿气）。"},"examples":[{"en":"The towels are still moist, so they won’t dry your hands well.","zh":"毛巾还是有点湿，所以不太能把手擦干。"},{"en":"Keep the cake covered so it stays moist.","zh":"把蛋糕盖好，这样能保持湿润。"},{"en":"The air felt warm and moist after the rain.","zh":"雨后空气温暖而潮湿。"}]},{"partOfSpeech":"adj.","definition":{"en":"(About eyes/skin/voice) Showing or caused by emotion, especially when tears are present or almost present.","zh":"（指眼睛/皮肤/声音）含泪的；带有情绪波动的（快要哭或刚哭过）。"},"examples":[{"en":"Her eyes became moist when she thanked her teacher.","zh":"她感谢老师时，眼睛有点湿润（含泪）。"},{"en":"He spoke in a moist voice as he said goodbye.","zh":"他告别时声音带着哽咽，像要哭一样。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, some people find it unpleasant) Having a damp or clammy feeling.","zh":"（非正式；有些人觉得不舒服）湿黏的；潮乎乎、黏答答的。"},"examples":[{"en":"My hands get moist when I’m nervous.","zh":"我紧张的时候手会出汗，变得湿黏。"},{"en":"The basement feels moist and a bit musty.","zh":"地下室感觉潮乎乎的，还有点霉味。"}]}],"synonyms":["moist","damp","humid","dewy","slightly wet"],"phonetic":"/ˈmɔɪ.st/","extraExplanation":["在英语文化里，“moist”常用来形容食物“湿润但不油、不干”（如moist cake）。不过在日常口语中，一部分母语者觉得这个词的发音或联想（黏湿的体感）有点“恶心/不舒服”，所以会开玩笑说讨厌这个词；正式写作中它依然很常见、很正常。","和wet的区别：wet更直接=“湿了/水很多”；moist更偏“略湿、含水分、保持湿润”。比如moist soil（湿润的土）常常是好状态，但wet socks（湿透的袜子）通常是不舒服。","近义词小提示：damp（潮湿、偏冷/不太舒服），humid（闷热潮湿，多指空气/天气），clammy（湿冷黏，常形容手或皮肤，带不适感）。"]}
{"word":"moit","summary":{"en":"Moit is a rare word meaning a bit of foreign matter in wool, or the act of removing such bits from wool.","zh":"moit 是个少见词，指“羊毛里的杂质”，也可作动词表示“把羊毛里的杂质拣掉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small piece of plant matter or other foreign material (such as a burr, twig, or seed) found in wool","zh":"（羊毛中的）杂质；（如）刺果、细枝、种子等异物"},"examples":[{"en":"The mill rejected the fleece because it contained too many moits.","zh":"这家纺厂拒收那批羊毛，因为里面杂质（moits）太多。"},{"en":"Skilled workers can spot moits quickly during wool sorting.","zh":"熟练的工人在分拣羊毛时能很快发现这些杂质。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove moits (foreign particles) from wool; to pick/clean wool","zh":"从羊毛中去除杂质；拣净（羊毛）"},"examples":[{"en":"They moit the wool before spinning it into yarn.","zh":"他们在纺成毛线之前先把羊毛拣净（moit）。"},{"en":"The fleece was carefully moited and washed.","zh":"这批羊毛被仔细拣净并清洗。"}]}],"synonyms":["burr","mote","speck","impurity","debris"],"phonetic":"/mɔɪt/","extraExplanation":["“moit”在现代英语里非常少见，主要出现在纺织/羊毛加工语境，日常交流中几乎不用。","词源上常被认为与“mote（微粒/尘埃）”有关，表示“混在羊毛里的小异物”。如果你是想表达“潮湿的”，更常用的是“moist”。"]}
{"word":"moither","summary":{"en":"Moither (British dialect) means to pester/bother or to confuse someone; it can also mean to ramble in a confused way.","zh":"moither（英式方言）指纠缠/烦扰或把人弄糊涂；也可指说话颠三倒四、絮叨不清。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(British dialect) To pester, bother, or overwhelm someone; to confuse or bewilder (often used in the passive: “be moithered”).","zh":"（英式方言）纠缠/烦扰某人；使人不知所措、困惑（常用被动：be moithered）。"},"examples":[{"en":"Stop moithering me—I’m trying to finish this report.","zh":"别一直烦我了——我在赶这份报告。"},{"en":"I was so moithered by all the instructions that I didn’t know what to do first.","zh":"那些指示把我搞得很懵，我都不知道先做什么。"},{"en":"Don’t moither yourself about it; it’s already taken care of.","zh":"别为这事费心了；已经处理好了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(British dialect) To speak in a rambling, muddled way; to go on and on without being clear.","zh":"（英式方言）说话颠三倒四、含糊不清；絮叨但不清楚。"},"examples":[{"en":"He started moithering about the past, and nobody could follow his point.","zh":"他开始胡乱扯以前的事，大家都听不懂他要表达什么。"},{"en":"She was tired and moithering, so I suggested we talk tomorrow.","zh":"她累得说话都不清楚了，我就建议明天再聊。"}]}],"synonyms":["bother","pester","hassle","confuse","bewilder","mither"],"phonetic":"ˈmɔɪðɚ","extraExplanation":["“moither”是英国一些地区（如英格兰北部/中部、威尔士部分地区）更常见的方言词，语气上很口语，常带一点不耐烦：stop moithering me≈“别烦我/别缠着我”。","它也常和“mither”（更广为人知的英式口语：worry/pester）联系在一起；一些词典把“moither”视为“moider”的变体。","不要和“mutter”（小声嘟囔）混淆：mutter强调“声音小、含糊”，而moither更强调“把人烦到/扰乱到/说得乱”。"]}
{"word":"moitier","summary":{"en":"**moitier** is an extremely rare word meaning “more moity” (more full of worms/maggots). People often mean **moiety** (“half; a share”) or French **moitié** (“half”).","zh":"**moitier** 极其罕见，意为“更 moity”（更生虫/更有蛆）。更多情况下，人们其实想写 **moiety**（“一半；份额”）或法语 **moitié**（“一半”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(very rare) Comparative form of **moity**, meaning “more moity” (i.e., more full of *moits*—maggots/worms).","zh":"（非常罕见）形容词 **moity** 的比较级：更“moity”（即更充满 *moits*——蛆/虫）。"},"examples":[{"en":"After a few hot days, the meat smelled worse and looked moitier than before.","zh":"几天高温后，肉闻起来更臭，看起来也比之前更“moity”（更生虫/更有蛆）了。"},{"en":"The fisherman threw away the moitier bait.","zh":"渔夫把更“moity”的饵料扔掉了。"}]}],"synonyms":["moiety","half","share"],"phonetic":"/ˈmɔɪtiər/","extraExplanation":["“moitier”在现代英语里几乎不用；你更可能想写的是 **moiety**（/ˈmɔɪəti/，意为“半；份额”，常见于法律/学术语境），或法语 **moitié**（意为“一半”）。","Collins 英语词典把 *moitier* 记录为 *moity* 的比较级，但 *moity* 本身也属方言/极少见词。若你告诉我上下文句子，我可以帮你判断你真正想表达的是哪个词。"]}
{"word":"moitiest","summary":{"en":"“Moitiest” is a very rare word meaning “most moist / dampest.”","zh":"“moitiest”非常少见，意思是“最潮湿的 / 最湿的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) The superlative form of **moity**: **most moist; dampest**.","zh":"（非常少见）**moity** 的最高级：**最潮湿的；最湿润的**。"},"examples":[{"en":"After the rain, the shaded corner of the yard was the **moitiest** spot.","zh":"下雨后，院子里背阴的角落是**最潮湿的**地方。"},{"en":"This towel feels **moitiest** near the bottom edge.","zh":"这条毛巾靠近下边缘的地方感觉**最湿**。"}]}],"synonyms":["moistest","dampest","wettest"],"phonetic":"/ˈmɔɪtiəst/","extraExplanation":["“moitiest”在现代英语里几乎不用；日常更常说 **moistest**（最潮湿的）。","很多人输入“moitiest”其实是想写 **moieties**（moiety 的复数，意为“两半之一/一部分”，也有化学义“分子片段”）。如果你想查的是这个意思，请告诉我，我可以按“moieties/moiety”再给你一份词条。"]}
{"word":"moity","summary":{"en":"Moiety (often misspelled “moity”) means one half or a portion/share; in chemistry, it’s a defined part of a molecule.","zh":"Moiety（常误拼为 moity）指“一半”或“份额/部分”；在化学中指“分子中一个特定的结构部分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"**moiety** (often misspelled as *moity*) means one of two equal parts (a half). It can also mean a portion or share of something.","zh":"**moiety**（常被拼错成 *moity*）指“两等份中的一份”（即“一半”）。也可指“某物的一部分/份额”。"},"examples":[{"en":"They agreed to split the profits into two equal moieties.","zh":"他们同意把利润平分成两份。"},{"en":"A moiety of the land was left to her sister in the will.","zh":"遗嘱把那块土地的一部分（常指一半）留给了她妹妹。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A moiety is a specific part of a molecule, often a functional group or sub-structure within a larger compound.","zh":"（化学）moiety 指分子中的一个特定“结构部分/基团”，常指较大的化合物中的某个子结构。"},"examples":[{"en":"This drug contains a sugar moiety that affects how it dissolves in water.","zh":"这种药物含有一个糖基部分，会影响它在水中的溶解性。"}]}],"synonyms":["half","portion","share","part"],"phonetic":"/ˈmɔɪ.ə.ti/","extraExplanation":["你输入的 **moity** 通常是拼写错误，标准拼写是 **moiety**。","**moiety** 在正式/法律英语里很常见，常用来表达“平分的一半”或“份额”（比 everyday English 的 *half* 更正式）。","词源来自古法语 *moitié*（意为“一半”），所以它带有较强的“分成两等份”的感觉。"]}

