{"word":"mol","summary":{"en":"“mol” most commonly means the chemistry unit mole (amount of substance).","zh":"“mol”最常见指化学单位“摩尔”（物质的量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a standard scientific unit for the amount of substance (the SI base unit), used in chemistry; the symbol is “mol”","zh":"（化学）物质的量的国际单位制基本单位；符号为“mol”（摩尔）"},"examples":[{"en":"Water has a molar mass of about 18 grams per mol.","zh":"水的摩尔质量大约是每摩尔 18 克。"},{"en":"We added 0.50 mol of NaCl to the solution.","zh":"我们向溶液中加入了 0.50 mol 的氯化钠。"},{"en":"The lab report must show your answer in mol, not in grams.","zh":"实验报告必须用 mol（摩尔）表示答案，而不是用克。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation sometimes used in notes for “molecule/molecular” (less formal; depends on context)","zh":"（较不正式）在笔记中有时作为“molecule / molecular（分子/分子的）”的缩写（取决于语境）"},"examples":[{"en":"Mol wt is short for molecular weight in some older notes.","zh":"在一些较旧的笔记里，Mol wt 是 molecular weight（分子量）的简写。"},{"en":"This is a mol model of methane.","zh":"这是一个甲烷的分子模型（mol 作为缩写）。"}]}],"synonyms":["mole (unit)"],"phonetic":"/moʊl/","extraExplanation":["“mol”是“mole（摩尔）”的单位符号，不是英语里常见的完整单词拼写。读的时候通常按“mole”来读（/moʊl/）。","1 mol 大致对应 6.022×10^23 个基本粒子（如原子、分子、离子等）；在化学计量（stoichiometry）题目里非常常见。","如果你是在聊天或某个特定圈子里看到“mol”，也可能是该圈子的自定义缩写；你可以把原句发我，我能按上下文更准确解释。"]}
{"word":"mola","summary":{"en":"Mola most commonly means a traditional, brightly patterned textile panel made by the Guna people of Panama.","zh":"Mola 最常见的意思是巴拿马古纳族制作的、图案鲜艳的传统布艺拼贴画（纺织装饰片）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorful textile panel made with layered fabric (often using reverse appliqué), traditionally made by the Guna (Kuna) people of Panama and used on clothing or as wall art","zh":"一种色彩鲜艳的布艺拼贴画（常用“反向贴布/反向拼布”工艺），源自巴拿马的古纳（库纳）族传统，可做衣服装饰或挂画"},"examples":[{"en":"She bought a mola at the market and framed it as wall art.","zh":"她在市场买了一块莫拉布艺拼贴画，并装框当作墙面装饰。"},{"en":"The museum’s exhibit features molas with animal and geometric designs.","zh":"博物馆的展览展示了带有动物与几何图案的莫拉作品。"},{"en":"A traditional blouse was decorated with two molas on the front and back.","zh":"一件传统女衫的前后各装饰了两块莫拉布艺拼贴画。"}]}],"synonyms":["textile panel","appliqué (art)","fabric art"],"phonetic":"/ˈmoʊlə/","extraExplanation":["“mola”在英语里多指巴拿马古纳族（Guna/Kuna）的传统纺织艺术：把多层布叠在一起，再把上层剪开、翻折并缝合，露出下层颜色，形成复杂图案（常见题材有动物、植物、几何图形、甚至现代元素）。","注意：在西班牙语口语里，“mola”还常表示“很酷/很棒”（相当于英语的 “It’s cool.”），但那属于西语用法，不是标准英语词义。"]}
{"word":"molal","summary":{"en":"Molal means “related to molality,” a concentration defined as moles of solute per kilogram of solvent.","zh":"molal 指“与质量摩尔浓度（molality）有关的”，即以每千克溶剂中溶质的摩尔数来定义的浓度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to **molality** (concentration measured as moles of solute per kilogram of solvent).","zh":"（化学）与**质量摩尔浓度（molality）**有关的；指以“每千克溶剂中的溶质摩尔数”来表示的浓度。"},"examples":[{"en":"A 1 molal (1 m) NaCl solution contains 1 mole of NaCl per kilogram of water.","zh":"1 molal（1 m）的氯化钠溶液表示：每 1 千克水（溶剂）中含 1 摩尔 NaCl（溶质）。"},{"en":"Molal concentration is useful because it does not change with temperature as much as molarity does.","zh":"molal 浓度很实用，因为它不像摩尔浓度（molarity）那样容易随温度变化。"}]}],"synonyms":["molality-based","of molality"],"phonetic":"/ˈmoʊləl/","extraExplanation":["“molal”常见于化学与溶液计算中，和“molar（摩尔浓度的）”很容易混淆：molarity（M）= 每升溶液的摩尔数；molality（m）= 每千克溶剂的摩尔数。","因为体积会随温度改变（热胀冷缩），所以以“每升溶液”为基础的 molarity 可能随温度波动；而“每千克溶剂”为基础的 molality 通常更稳定，特别常用于涉及沸点升高/冰点降低等依数性（colligative properties）的题目。","拼写提示：molal（形容词）来自 molality；单位常写作 m（小写），而 molarity 的单位常写作 M（大写）。"]}
{"word":"molala","summary":{"en":"Molala usually refers to a Native American people of Oregon and their (now extinct) language; it can also be a historical spelling variant of “Molalla.”","zh":"Molala 通常指俄勒冈州的原住民族群“莫拉拉人”及其（已消亡的）语言；也可作为 “Molalla” 的历史拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people whose traditional homeland was in the Cascade Mountains of present-day Oregon (U.S.).","zh":"（莫拉拉人）美国原住民族群之一，传统居住地在现今俄勒冈州的喀斯喀特山脉一带。"},"examples":[{"en":"The Molala lived in the forests and foothills of the Oregon Cascades.","zh":"莫拉拉人曾生活在俄勒冈州喀斯喀特山脉的森林与山麓地带。"},{"en":"Some descendants of the Molala are enrolled in tribes in Oregon today.","zh":"如今在俄勒冈州的一些部落中，有部分成员有莫拉拉血统。"}]},{"partOfSpeech":"n.","definition":{"en":"the (now extinct) language once spoken by the Molala people.","zh":"（莫拉拉语）莫拉拉人曾使用、现已消亡的一种语言。"},"examples":[{"en":"Researchers recorded word lists of the Molala language in the 1800s.","zh":"研究者在19世纪记录过莫拉拉语的词表。"},{"en":"Molala is often discussed in studies of languages of the Pacific Northwest.","zh":"在研究美国西北部语言时，莫拉拉语经常被提及。"}]},{"partOfSpeech":"n.","definition":{"en":"a spelling variant of “Molalla,” seen in some historical sources (also used in names like Molalla, Oregon).","zh":"“Molalla”的一种拼写变体，常见于部分历史资料（也出现在地名中，如俄勒冈州的 Molalla）。"},"examples":[{"en":"Older documents may spell the name as Molala or Molalla.","zh":"较早的文献里，这个名称可能写作 Molala 或 Molalla。"},{"en":"Molalla, Oregon was named using a related spelling of the same word.","zh":"俄勒冈州的 Molalla 城市名称与该词属于同一来源的不同拼写。"}]}],"synonyms":["Molalla (variant spelling)"],"phonetic":"/moʊˈlɑːlə/","extraExplanation":["“Molala / Molalla / Molallie”等拼写在历史文献中都出现过，通常指同一族群或与其相关的地名。现代更常见的拼写是 **Molala（族群/语言）** 与 **Molalla（地名）**。","谈到原住民族名称时，尽量使用当事族群或当代常用的称呼与拼写，并避免把族群名称当作普通形容词随意使用，这样更尊重也更准确。"]}
{"word":"molalities","summary":{"en":"“Molalities” means amounts of concentration measured in moles of solute per kilogram of solvent (plural of molality).","zh":"“molalities”指“质量摩尔浓度”的复数：以每千克溶剂中溶质的摩尔数来表示的浓度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **molality**: a chemistry unit of concentration meaning the number of moles of solute per kilogram of solvent (symbol: **m**).","zh":"**molality（质量摩尔浓度）** 的复数：化学中的浓度单位，表示**每千克溶剂**中所含溶质的物质的量（摩尔数）（符号：**m**）。"},"examples":[{"en":"The table lists the molalities of salt solutions used in the experiment.","zh":"表格列出了实验中使用的盐溶液的质量摩尔浓度（molalities）。"},{"en":"At higher molalities, the freezing point dropped more noticeably.","zh":"在更高的质量摩尔浓度下，凝固点下降更明显。"}]}],"synonyms":["molality","m (molality, in chemistry notation)"],"phonetic":"/moʊˈlælɪtiz/","extraExplanation":["“molality”常与“molarity（摩尔浓度，mol/L）”对比：molality 用 **kg 溶剂**作分母，通常不随温度引起的体积变化而改变；molarity 用 **L 溶液**作分母，体积会随温度变化，因此在温度变化较大时，molality 往往更稳定、更常用于讨论沸点升高/凝固点降低等依数性。","拼写提示：molality（-ality）→ 复数 molalities（-alities）。"]}
{"word":"molality","summary":{"en":"Molality is a concentration unit: moles of solute per kilogram of solvent (mol/kg).","zh":"Molality（质量摩尔浓度）是浓度单位：每千克溶剂中溶质的摩尔数（mol/kg）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A measure of concentration equal to the number of moles of solute dissolved in 1 kilogram of solvent (unit: mol/kg).","zh":"一种浓度单位，表示每 1 千克溶剂中所溶解的溶质的物质的量（单位：mol/kg）。"},"examples":[{"en":"A solution with 0.50 mol of sugar dissolved in 1.0 kg of water has a molality of 0.50 m.","zh":"将 0.50 mol 的糖溶解在 1.0 kg 的水中，该溶液的质量摩尔浓度为 0.50 m。"},{"en":"Molality is often used when temperature changes, because it depends on mass, not volume.","zh":"当温度变化时常用质量摩尔浓度，因为它取决于质量而不是体积。"}]}],"synonyms":["molal concentration"],"phonetic":"/moʊˈlælɪti/","extraExplanation":["molality 常用符号是 **m**（读作 “molal” 相关），单位是 **mol/kg**。注意不要和 **molarity（摩尔浓度，M）** 混淆：molarity 是“每升溶液的摩尔数（mol/L）”，会随温度引起的体积变化而变化；molality 以质量为基准，通常不随温度变化而改变。","在讨论**依数性**（如沸点升高、凝固点降低、渗透压）时，molality 很常见，因为这些现象更直接与溶质粒子数和溶剂质量相关。"]}
{"word":"molar","summary":{"en":"“Molar” most commonly means a back tooth used for grinding, and it can also mean “related to moles” in chemistry (e.g., molar mass, molar concentration).","zh":"“Molar”最常见指“臼齿（后牙，用于磨碎食物）”，在化学中也可指“摩尔的”（如摩尔质量、摩尔浓度）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, flat tooth at the back of the mouth used for grinding food.","zh":"臼齿：位于口腔后部、用于把食物磨碎的大牙。"},"examples":[{"en":"I have a cavity in my back molar.","zh":"我后面的臼齿蛀牙了。"},{"en":"Molars are important for chewing tough foods.","zh":"臼齿对咀嚼较硬的食物很重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to moles; in chemistry, describing a concentration based on moles (especially in the phrase “molar concentration”).","zh":"摩尔的；（化学）以“摩尔”为基础的（常见于短语“molar concentration/摩尔浓度”）。"},"examples":[{"en":"The molar mass of water is about 18 grams per mole.","zh":"水的摩尔质量约为每摩尔 18 克。"},{"en":"We calculated the molar concentration of the solution.","zh":"我们计算了该溶液的摩尔浓度。"}]}],"synonyms":["grinding tooth","molar tooth","mole-based (chemistry)"],"phonetic":"/ˈmoʊ.lɚ/","extraExplanation":["“molar”这个词有两个常见来源与用法：一个来自拉丁语 molaris（与磨碎有关），所以在牙齿里指“臼齿”；另一个与化学中的 mole（摩尔）相关，所以在化学里常用来表示“摩尔的/以摩尔计的”。看到句子里出现 teeth、dentist、cavity 多半是“臼齿”；出现 mass、concentration、solution 多半是“摩尔的”。"]}
{"word":"molariform","summary":{"en":"Molariform means “molar-shaped,” describing teeth that are broad and made for grinding, especially in animals.","zh":"molariform 表示“臼齿形的”，常指宽大、适合研磨的牙齿外形或功能（多用于动物牙齿描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape or function of a molar tooth (broad, with multiple rounded points), especially used to describe certain teeth in animals.","zh":"（尤用于描述动物的牙）呈臼齿形的；像臼齿一样宽大、适合研磨的（常指带有多个圆钝牙尖的形状或功能）。"},"examples":[{"en":"Many herbivores have molariform teeth that help them grind tough plant material.","zh":"许多食草动物有臼齿形的牙，能帮助它们磨碎坚韧的植物。"},{"en":"The fossil shows a molariform premolar adapted for crushing food.","zh":"这块化石显示出一颗臼齿形的前臼齿，适合用来压碎食物。"}]}],"synonyms":["molar-shaped","molar-like"],"phonetic":"/moʊˈlɛrɪfɔrm/","extraExplanation":["词源上可拆为 molar（臼齿）+ -iform（“……形的”）。因此 molariform 直译就是“臼齿形的”。","它常见于生物学、古生物学与牙科学的描述里：不一定是真正的“臼齿”（molar），也可能是别的牙（如前臼齿 premolar）演化出类似臼齿的外形与研磨功能，所以会用 molariform 来强调“像臼齿一样”。","学习提示：-iform 这个后缀很常用，表示“形状像……”。例如: leafiform（叶形的）、clubiform（棒状的）。"]}
{"word":"molarimeter","summary":{"en":"A rare, old milling term for a thermometer that measures the temperature of ground meal as it leaves a mill.","zh":"一个非常少见的旧式制粉行业词，指测量磨坊出料粉料温度的专用温度计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a special thermometer used in a flour mill to measure the temperature of meal (ground grain) as it comes out of the mill spout, often with a protective “jacket/chute” that guides the flowing meal around the bulb for a more accurate reading.","zh":"（旧式磨坊用语）一种专门的温度计，用来测量磨坊出料口流出的粉料/粗粉（meal，指磨碎的谷物）温度；常带有护套或导流槽，使粉料流经并包住温包以便更准确测温。"},"examples":[{"en":"The miller used a molarimeter to check whether the freshly ground meal was overheating.","zh":"磨坊工用 molarimeter 检查刚磨出的粉料有没有过热。"},{"en":"If the molarimeter reading rises too quickly, the millstones may need adjustment.","zh":"如果 molarimeter 的读数上升得太快，可能需要调整磨石。"}]}],"synonyms":["mill thermometer","process thermometer","temperature probe"],"phonetic":"/ˌmoʊ.ləˈrɪm.ɪ.tɚ/","extraExplanation":["这个词非常少见，容易让人误以为与化学里的 molar（摩尔浓度）有关，但这里的 molarimeter 其实来自较早的磨坊/制粉行业语境：测的是“meal（谷物粗粉/粉料）”从出料口流出时的温度。现代语境中更常直接说 thermometer、temperature probe，或用具体设备名称（如 process thermometer）。"]}
{"word":"molarities","summary":{"en":"“Molarities” means multiple values of molarity—solution concentrations measured in mol/L (M).","zh":"“molarities”指多个“摩尔浓度”数值，即以 mol/L（M）表示的溶液浓度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of molarity: concentrations expressed as moles of solute per liter of solution (mol/L), often written as “M”.","zh":"molarity（摩尔浓度）的复数：指溶液浓度，以“每升溶液中溶质的摩尔数”（mol/L）表示，常写作“M”。"},"examples":[{"en":"The lab compared the molarities of three salt solutions.","zh":"实验室比较了三种盐溶液的摩尔浓度。"},{"en":"We prepared solutions with molarities of 0.1 M and 1.0 M.","zh":"我们配制了摩尔浓度为 0.1 M 和 1.0 M 的溶液。"}]}],"synonyms":["concentrations (in mol/L)","molar concentration(s)"],"phonetic":"/moʊˈlærɪtiz/","extraExplanation":["“Molarity（摩尔浓度）”的计算公式：M = n / V，其中 n 是溶质的物质的量（mol），V 是溶液体积（L）。注意是“溶液”的体积，不是溶剂的体积。","单位常写作 mol/L 或符号 M（例如 0.5 M HCl）。英语里说 “a 0.5 molar solution” 或直接说 “0.5 M solution”。","容易混淆：molar（形容词，表示“摩尔的/摩尔浓度为…的”）与 molarity（名词，表示“摩尔浓度”）。例如：a 1 M solution（1 molar solution）；the molarity is 1 M（molarity 是名词）。"]}
{"word":"molarity","summary":{"en":"Molarity is a way to express solution concentration: moles of solute per liter of solution (mol/L).","zh":"molarity 指溶液的摩尔浓度：每升溶液中溶质的摩尔数（mol/L）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The concentration of a solution measured as moles of solute per liter of solution (mol/L), often written as “M.”","zh":"（化学）摩尔浓度：用“每升溶液中溶质的摩尔数”来表示的浓度，单位为 mol/L，常写作 “M”。"},"examples":[{"en":"A 1.0 M NaCl solution contains 1.0 mole of NaCl in 1 liter of solution.","zh":"1.0 M 的氯化钠溶液表示：1 升溶液中含有 1.0 摩尔的 NaCl。"},{"en":"If you dilute the solution, its molarity decreases because the volume increases.","zh":"如果把溶液稀释，摩尔浓度会降低，因为体积变大了。"},{"en":"We calculated the molarity by dividing moles of solute by liters of solution.","zh":"我们用溶质的摩尔数除以溶液的升数来计算摩尔浓度。"}]}],"synonyms":["molar concentration","molarity (M)"],"phonetic":"məˈlærɪti","extraExplanation":["摩尔浓度（molarity）的核心公式：M = n / V，其中 n 是溶质的物质的量（mol），V 是溶液体积（L）。要注意是“溶液体积”，不是“溶剂体积”。","常见相关词：\n- molar（adj.）摩尔的；（如 molar mass：摩尔质量）\n- molality（n.）质量摩尔浓度（mol/kg，按溶剂质量算），与 molarity 不同\n- dilute / dilution（v./n.）稀释 / 稀释过程","在实验室里，标注 “0.50 M HCl” 的意思是每 1 L 溶液中含 0.50 mol 的 HCl。若温度变化导致体积变化，molarity 也会随之变化（因为它依赖体积）。"]}
{"word":"molars","summary":{"en":"Molars are the large back teeth used for chewing and grinding food.","zh":"molars 指位于口腔后部、用于咀嚼和磨碎食物的磨牙（臼齿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large back teeth used mainly for chewing and grinding food.","zh":"臼齿；磨牙（位于口腔后部，主要用来咀嚼、磨碎食物的大牙）。"},"examples":[{"en":"Use your molars to grind tougher foods like nuts and meat.","zh":"用你的磨牙来磨碎比较硬的食物，比如坚果和肉。"},{"en":"The dentist said one of my molars has a cavity.","zh":"牙医说我的一颗磨牙蛀了。"}]}],"synonyms":["back teeth"],"phonetic":"ˈmoʊlərz","extraExplanation":["“Molar”来自拉丁语 *molaris*，与 *mola*（磨石）有关，所以它的核心概念就是“用来磨碎食物的牙”。","按位置和长牙时间常见分法：第一、第二磨牙（通常儿童/青少年期长出）；第三磨牙常被叫作“智齿”（wisdom tooth），很多人会因为空间不足而需要拔除或处理。","在日常英语里，人们也会说“back teeth”（后牙）来泛指磨牙区域，但更专业的说法是 molars。"]}
{"word":"molary","summary":{"en":"Molary (rare) means “molar-like” or “used for grinding,” especially referring to back teeth.","zh":"Molary（较少用）表示“像臼齿的”或“用于研磨的”，多与后牙相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Adapted for grinding food; having the function or shape of a molar (back) tooth.","zh":"（较少用）适于磨碎食物的；具有臼齿（后牙）那样的功能或形状的。"},"examples":[{"en":"Cows have strong molary teeth for grinding tough grass.","zh":"牛有强壮的臼齿，用来磨碎坚韧的草。"},{"en":"The molary surface of the tooth helps break food down before swallowing.","zh":"牙齿的臼齿状咬合面能在吞咽前帮助把食物磨碎。"}]}],"synonyms":["molar","grinding"],"phonetic":"/ˈmoʊləri/","extraExplanation":["“molary”在现代英语里很少见，更常用的是“molar”（既可作名词“臼齿”，也可作形容词“臼齿的/研磨的”）。如果你是在写作或考试中想表达“臼齿的”，通常用“molar”更自然。","词源上与拉丁语 mola（磨石/磨盘）有关，因此它的核心意象是“像磨石一样用来研磨”。"]}
{"word":"molas","summary":{"en":"Molas are most commonly colorful Guna reverse-appliqué textile panels; less commonly, “molas” is the plural of mola (ocean sunfish).","zh":"molas 通常指古纳人的反向贴布工艺装饰布片；较少情况下也可作 mola（翻车鱼）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Colorful, layered textile panels made using reverse appliqué, traditionally crafted by the Guna (Kuna) Indigenous people of Panama and Colombia; often sewn onto blouses and sold as folk art.","zh":"一种色彩丰富的多层布艺拼贴（反向贴布）装饰片，传统上由巴拿马与哥伦比亚的古纳（库纳）原住民制作；常缝在女式上衣上，也作为民间艺术品出售。"},"examples":[{"en":"She bought two molas at the market in Panama City.","zh":"她在巴拿马城的市场买了两块莫拉布艺。"},{"en":"The blouse was decorated with bright molas showing birds and flowers.","zh":"那件上衣上装饰着鲜艳的莫拉布艺，图案是鸟和花。"},{"en":"In the museum, the molas were displayed like paintings.","zh":"在博物馆里，这些莫拉布艺像画作一样被展示。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “mola” meaning a type of large ocean sunfish (though this use is less common in everyday English).","zh":"“mola”的复数：一种大型海洋翻车鱼（此义在日常英语中较少见）。"},"examples":[{"en":"Ocean researchers recorded several molas near the surface.","zh":"海洋研究人员记录到多条翻车鱼在海面附近活动。"},{"en":"Molas sometimes bask in the sun, which is why they’re called sunfish.","zh":"翻车鱼有时会在阳光下“晒太阳”，因此它们被叫作太阳鱼。"}]}],"synonyms":["textile panels","reverse appliqué (technique)","Guna textiles","folk art"],"phonetic":"/ˈmoʊləz/","extraExplanation":["“mola（莫拉布艺）”最常指古纳人服饰上的装饰布片：把多层不同颜色的布叠在一起，再把上层剪开、翻折缝合，让下面的颜色显现，形成图案（常见动物、植物、几何图形，也会出现现代元素）。","文化语境里常把“molas”当作可收藏的手工艺品来谈；而指“翻车鱼”的 mola/molas 多见于海洋生物、纪录片或科研语境。"]}
{"word":"molasse","summary":{"en":"Molasse is a geology term for thick foreland-basin sediment (sandstone, shale, conglomerate) formed from erosion of rising mountains—especially well known from the Alps/Switzerland.","zh":"Molasse（磨拉石/磨拉石层）是地质学术语，指在山脉隆起时由侵蚀物在前陆盆地堆积形成的厚层碎屑沉积（常见砂岩、页岩、砾岩），以阿尔卑斯山—瑞士地区最典型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) A thick sequence of sandstones, shales (mudstones), and conglomerates deposited in front of a rising mountain range (in a foreland basin), formed from material eroded off the growing mountains.","zh":"（地质）“磨拉石（层）”：在造山运动期间或之后，山脉前缘的前陆盆地中堆积的厚层碎屑沉积物，常见为砂岩、页岩（泥岩）与砾岩，主要来自新生山地的侵蚀物。"},"examples":[{"en":"Geologists mapped molasse deposits along the foreland basin north of the Alps.","zh":"地质学家绘制了阿尔卑斯山以北前陆盆地的磨拉石沉积分布图。"},{"en":"The river cut through molasse, revealing layers of sandstone and conglomerate.","zh":"河流切穿了磨拉石地层，露出了砂岩与砾岩的层理。"}]},{"partOfSpeech":"n.","definition":{"en":"(More specific use) The fossil-bearing sedimentary deposits in and near Switzerland, especially of Miocene age (and sometimes including Upper Oligocene beds).","zh":"（更具体用法）瑞士及其周边地区的含化石沉积岩系，主要为中新世地层（有时也包括上渐新世地层）。"},"examples":[{"en":"Some classic Swiss field sites expose Miocene molasse rich in fossils.","zh":"瑞士一些经典的野外地点出露含丰富化石的中新世磨拉石地层。"}]}],"synonyms":["foreland-basin deposits","orogenic clastic wedge","molasse deposits"],"phonetic":"/məˈlæs/","extraExplanation":["“molasse”容易与“molasses（糖蜜）”混淆：两者拼写和发音相近，但含义完全不同。molasse是地质学术语，molasses是食物（糖蜜）。","词源来自法语（与“柔软/松软”的含义相关），最早用于描述瑞士一带较“软”的砂岩与相关沉积物；后来概念扩展为更一般的“造山带前缘的碎屑沉积序列”。","在地质语境里，molasse常与“flysch（复理层）”对比：flysch通常指造山带前缘较深水环境、造山运动早期/进行时的沉积；molasse更偏向浅海到陆相环境、来自山地侵蚀的粗碎屑沉积。"]}
{"word":"molasses","summary":{"en":"Molasses is a thick, dark sweet syrup from making sugar; it’s also used informally to mean “very slow.”","zh":"Molasses 指制糖产生的浓稠深色甜糖浆；口语里也可用来形容“非常慢”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, dark, sweet syrup made during the process of making sugar (especially from sugarcane or sugar beets), often used in baking and cooking.","zh":"（糖蜜）制糖过程中产生的浓稠深色甜糖浆（多由甘蔗或甜菜制成），常用于烘焙和烹饪。"},"examples":[{"en":"Gingerbread cookies often taste better with molasses.","zh":"姜饼干加糖蜜通常更好吃。"},{"en":"This recipe calls for a tablespoon of molasses to add a deep, caramel-like flavor.","zh":"这个食谱需要一汤匙糖蜜来增加浓郁的焦糖风味。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Used to describe something that moves very slowly, like thick syrup.","zh":"（非正式）用来形容动作非常慢，像浓稠糖浆一样。"},"examples":[{"en":"Traffic was moving like molasses during rush hour.","zh":"高峰期的车流慢得像糖蜜一样。"},{"en":"My old laptop runs like molasses when I open too many tabs.","zh":"我旧笔记本开太多标签页时慢得像糖蜜。"}]}],"synonyms":["treacle","syrup (general)"],"phonetic":"/məˈlæsɪz/","extraExplanation":["“like molasses”是美式英语里很常见的夸张比喻，用糖蜜“又黏又慢”的特点来形容速度慢。常见搭配：move/run/flow like molasses。","在美国南方与加勒比地区，糖蜜与甘蔗种植、制糖历史关系密切；传统食物里常见，如gingerbread（姜饼）、baked beans（焗豆）和某些烧烤酱。"]}
{"word":"molasseses","summary":{"en":"“Molasseses” is the plural of “molasses,” used when talking about different kinds or batches of molasses.","zh":"“molasseses”是“molasses（糖蜜）”的复数，用于谈论不同种类或不同批次的糖蜜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **molasses**: a thick, dark, sweet syrup made during sugar production, often used in baking and cooking.","zh":"**molasses（糖蜜／糖浆）**的复数：制糖过程中产生的浓稠、深色、甜味糖浆，常用于烘焙与烹饪。"},"examples":[{"en":"Different **molasseses** can vary in color and bitterness depending on how many times the sugar has been boiled.","zh":"不同种类的**糖蜜**在颜色和苦味上会有差异，这取决于糖浆被煮浓（提炼）了多少次。"},{"en":"The recipe compares two **molasseses** to show how flavor changes from light to blackstrap.","zh":"这份食谱对比了两种**糖蜜**，说明从浅色到黑糖蜜风味如何变化。"}]}],"synonyms":["molasses (plural)","syrups (general)","treacle (UK)"],"phonetic":"/məˈlæsɪzɪz/","extraExplanation":["“molasseses”在日常生活中不算常见，因为“molasses”本身多用作不可数名词（例如：Some molasses）。当你在讨论“不同类型／不同批次的糖蜜”时，才会用复数“molasseses”。","常见分类包括 light molasses（浅色糖蜜）、dark molasses（深色糖蜜）、blackstrap molasses（黑糖蜜，味道更浓、更苦、矿物质更高）。在烘焙里它们会影响颜色、甜度与风味。"]}
{"word":"molassied","summary":{"en":"Molassied (rare) means ‘like molasses’—thick, sticky, dark, and sweet; it can also be used figuratively for slow or overly sweet language.","zh":"molassied（较罕见）表示“像糖蜜一样的”——浓稠、黏、深色且甜；也可比喻动作迟缓或言辞过分甜腻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Covered with, made with, or tasting/smelling like molasses; thick, dark, and very sweet.","zh":"（罕见用法）涂了糖蜜的；用糖蜜做的；或带有糖蜜那种浓稠、深色、很甜的味道/气味。"},"examples":[{"en":"The cookies were molassied and fragrant, filling the kitchen with a warm sweetness.","zh":"饼干带着糖蜜般的甜香，浓郁的气味让厨房充满温暖的甜味。"},{"en":"He liked his oatmeal molassied, not plain.","zh":"他喜欢燕麦粥加上糖蜜的甜味，而不是清淡原味。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) Syrupy or sticky in texture; sometimes used to describe slow, heavy movement or overly sweet writing/speech.","zh":"（比喻）像糖浆一样黏稠的；也可形容动作缓慢沉重，或文字/话语甜腻到有点过头。"},"examples":[{"en":"The heat made the air feel molassied, thick and hard to breathe.","zh":"炎热让空气像被糖浆黏住一样浓稠，让人觉得呼吸困难。"},{"en":"Her molassied compliments felt a little forced.","zh":"她那些甜腻的恭维听起来有点刻意。"}]}],"synonyms":["syrupy","treacly","sticky","gooey","honeyed","cloying","sluggish"],"phonetic":"/məˈlæs.id/","extraExplanation":["“molassied”比较少见，更常见的表达是“molasses-coated / molassesy / syrupy / treacly”。它通常带一点文学化或口语化的夸张色彩，用来强调“浓稠、黏、甜、慢”的感觉。","Molasses（糖蜜）在美式语境里常和烘焙（如 gingerbread、molasses cookies）、南方/乡村风味甜点联系在一起，所以这个词有时也会带一点“家常、温暖、怀旧”的氛围。"]}
{"word":"molassy","summary":{"en":"Molassy means “like molasses”—thick and sticky, or (figuratively) very slow and heavy.","zh":"Molassy 指“像糖蜜一样”黏稠甜腻；也可比喻节奏很慢、很拖沓。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Like molasses in texture or taste—thick, sticky, dark, and sweet.","zh":"（非正式）像糖蜜一样的——黏稠、粘腻、颜色较深、味道甜。"},"examples":[{"en":"The sauce turned molassy after it simmered for an hour.","zh":"那酱汁小火煮了一小时后变得像糖蜜一样黏稠。"},{"en":"She loves molassy flavors like gingerbread and dark brown sugar.","zh":"她喜欢姜饼和深红糖这类带“糖蜜味”的浓郁甜香。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Very slow, heavy, or sluggish; sometimes overly sweet or sentimental in style.","zh":"（比喻）非常缓慢、沉重、拖沓；有时也指风格甜腻、煽情过头。"},"examples":[{"en":"The meeting moved at a molassy pace.","zh":"会议进展得慢得要命。"},{"en":"The movie’s molassy romance scenes felt a bit too sugary for me.","zh":"电影里那些甜腻的爱情桥段对我来说有点过头。"}]}],"synonyms":["syrupy","sticky","viscous","sluggish","honeyed"],"phonetic":"/məˈlæsi/","extraExplanation":["“molassy”不是最常见的标准拼写；很多人想写的是 **molasses（糖蜜）**。molasses 指制糖过程中分离出来的深色浓稠糖浆。([merriam-webster.com](https://www.merriam-webster.com/dictionary/molasses?utm_source=openai))","比喻用法常借助英语表达 **slow as molasses**（慢得像糖蜜一样），强调“黏、慢、拖沓”的感觉。([vocabulary.com](https://www.vocabulary.com/dictionary/molasses?utm_source=openai))","相关文化小知识：在英式英语里，molasses 常与 **treacle**（糖浆/黑糖浆）有关联；在烘焙里，molasses 也常用于姜饼、烘焙豆等食物来增加颜色与风味层次。([britannica.com](https://www.britannica.com/topic/molasses?utm_source=openai))"]}
{"word":"molave","summary":{"en":"Molave is a Philippine/Southeast Asian timber tree (especially *Vitex parviflora*) and also the durable hardwood made from it.","zh":"Molave 指菲律宾/东南亚的用材乔木（尤指 *Vitex parviflora*），也指其坚硬耐用的木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large tropical timber tree native to the Philippines and nearby parts of Southeast Asia, especially the species *Vitex parviflora* (also called the molave tree)","zh":"一种产于菲律宾及东南亚附近地区的热带用材乔木，尤指小花荆属树种 *Vitex parviflora*（常称“莫拉韦树 / molave tree”）"},"examples":[{"en":"Molave trees are often planted along roads because they can provide wide shade.","zh":"Molave 树常被种在路边，因为树冠开阔，能提供大片树荫。"},{"en":"The molave tree is valued in the Philippines for its strong, durable timber.","zh":"在菲律宾，molave 树因木材坚硬耐用而备受重视。"}]},{"partOfSpeech":"n.","definition":{"en":"the heavy, durable hardwood produced from molave trees, used for construction, furniture, and other long-lasting wood products","zh":"molave 树所产的一种沉重、耐久的硬木，常用于建筑、家具等需要耐用性的木制品"},"examples":[{"en":"They chose molave for the door frame because it resists rot and insects.","zh":"他们选用 molave 做门框，因为它更耐腐、也更抗虫蛀。"},{"en":"Traditional boats and posts were sometimes made from molave wood.","zh":"传统的船只和柱材有时会用 molave 木制作。"}]}],"synonyms":["molave tree","molave wood","smallflower chastetree"],"phonetic":"/moʊˈlɑːveɪ/","extraExplanation":["“Molave”这个词常见于菲律宾语境：词源经西班牙语转写，来自他加禄语 *mulawin*（指这种树）。","在资料里，“molave”有时会指不同的荆属（*Vitex*）树种及其木材；在日常与园艺/林业语境中，多数人用它指 *Vitex parviflora* 或其木材。","注意：Molave 也可能是地名（菲律宾三宝颜半岛的一个城镇名），以及部分热带气旋/台风的名称；但作为英文词条时，最常见义还是“树/木材”。"]}
{"word":"mold","summary":{"en":"Mold most commonly means fungus that grows in damp places or on old food; it can also mean a container used to shape materials, or the verb “to shape/transform.”","zh":"mold 最常指“霉/霉菌”；也可指“模具”，或作动词表示“塑造、使成形”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, fuzzy growth of tiny organisms (fungi) that appears on old food or in damp places.","zh":"霉；霉菌（潮湿或食物变质时长出的真菌，常呈绒毛状）。"},"examples":[{"en":"There’s mold on the bread, so we should throw it away.","zh":"面包上长霉了，所以我们应该把它扔掉。"},{"en":"Mold can grow in bathrooms with poor ventilation.","zh":"通风不好的浴室里容易滋生霉菌。"}]},{"partOfSpeech":"n.","definition":{"en":"A hollow container or shape used to form a material (like clay, plastic, or metal) into a particular shape.","zh":"模具；铸模（用来把材料塑造成特定形状的器具）。"},"examples":[{"en":"Pour the melted chocolate into the mold and let it cool.","zh":"把融化的巧克力倒进模具里，等它冷却。"},{"en":"The statue was made using a metal mold.","zh":"这座雕像是用金属模具制作的。"}]},{"partOfSpeech":"vt.","definition":{"en":"To shape or form something into a particular form, often over time or with effort.","zh":"塑造；使成形（常指经过时间、努力或训练形成某种样子）。"},"examples":[{"en":"Good teachers can mold students into confident learners.","zh":"好老师能把学生塑造成自信的学习者。"},{"en":"Her experiences molded her character.","zh":"她的经历塑造了她的性格。"}]}],"synonyms":["mildew","fungus","mould","form","shape"],"phonetic":"/moʊld/","extraExplanation":["英式拼写常见为 mould（尤其在“模具/塑造”的意思上），美式通常写 mold；在医学或日常语境里说“霉菌”时，美式也多用 mold。","在健康与居住环境中，mold 常与潮湿（damp/moisture）、过敏（allergies）和通风（ventilation）一起出现；如果是大面积霉斑，通常需要专业处理。"]}
{"word":"moldability","summary":{"en":"Moldability means how easily something—especially a material—can be shaped or formed into a desired shape.","zh":"Moldability 指材料被塑造、成形的容易程度，即“可塑性/易成形性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being easy to shape or form (often used for materials such as plastic, metal, clay, or dough).","zh":"（材料的）可塑性；易成形性（常用于塑料、金属、黏土或面团等）。"},"examples":[{"en":"This plastic’s moldability makes it useful for making phone cases.","zh":"这种塑料的可塑性很强，适合用来做手机壳。"},{"en":"When the clay is warm and moist, its moldability improves.","zh":"当黏土温暖且湿润时，它的可塑性会更好。"}]},{"partOfSpeech":"n.","definition":{"en":"In engineering and manufacturing: how well a material can be formed into a mold or into complex shapes without cracking or breaking.","zh":"（工程与制造）材料在不龟裂或断裂的情况下被压制进模具或加工成复杂形状的能力。"},"examples":[{"en":"Engineers test moldability to decide whether a polymer can be used for injection molding.","zh":"工程师会测试可塑性，以决定某种聚合物是否适合注塑。"},{"en":"Good moldability can reduce defects during production.","zh":"良好的可塑性可以减少生产过程中的瑕疵。"}]}],"synonyms":["plasticity","formability","workability","pliability"],"phonetic":"/ˌmoʊl.dəˈbɪl.ə.ti/","extraExplanation":["“moldability”多见于材料科学、制造业与产品设计语境。日常英文里，表达“可塑性”也常用更常见的词，如“flexibility”（柔韧性/灵活性，含义更广）或“plasticity”（可塑性，偏技术/学术）。","词形拆解：mold（模具；塑造）+ -able（能够…的）+ -ity（名词后缀，表示性质）→ “能够被塑造的性质”。","注意拼写差异：美式英语常写“mold”，英式英语常写“mould”；对应名词也可能见到“mouldability”。"]}
{"word":"moldable","summary":{"en":"Moldable means easy to shape (materials) or easy to change (plans/ideas/people).","zh":"moldable 指“容易塑形”（材料）或“容易改变/调整”（计划、想法、人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be shaped or formed easily, especially when soft or warm; flexible and can change shape without breaking.","zh":"（尤指柔软或受热时）容易塑形的；可弯曲、可改变形状而不易断裂的。"},"examples":[{"en":"This clay is moldable, so you can make small bowls or figures by hand.","zh":"这种黏土很容易塑形，所以你可以用手做小碗或小人偶。"},{"en":"Use a moldable plastic that softens slightly with heat.","zh":"使用一种受热会稍微软化、便于塑形的塑料。"},{"en":"The material stays moldable for about ten minutes before it hardens.","zh":"这种材料在变硬之前大约有十分钟的可塑时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"Easy to influence or change (used about ideas, plans, or people).","zh":"（指想法、计划或人）容易受影响的；可被改变的。"},"examples":[{"en":"At the beginning of the project, our plan was still moldable.","zh":"项目刚开始时，我们的计划仍然很容易调整。"},{"en":"A child’s habits can be moldable with patient guidance.","zh":"在耐心引导下，孩子的习惯更容易被塑造。"}]}],"synonyms":["pliable","malleable","flexible","adaptable","adjustable"],"phonetic":"/ˈmoʊl.də.bəl/","extraExplanation":["“moldable” 来自动词 “mold”（塑造、成形）+ 形容词后缀 “-able”（能够……的），字面意思就是“能够被塑造成形的”。","常见搭配：moldable clay（可塑黏土）、moldable plastic（可塑塑料）、moldable putty（可塑腻子/补土）、moldable plan（可调整的计划）。","近义词（偏“物理可塑”）：pliable, malleable, flexible；近义词（偏“可调整/可改变”）：adaptable, adjustable。注意：malleable 更常用于金属在压力下可被锤打成形；pliable 更强调柔软可弯。"]}
{"word":"moldableness","summary":{"en":"Moldableness means the quality of being easy to shape or influence (often said more naturally as moldability, flexibility, or adaptability).","zh":"Moldableness 指“可塑性/易被塑造的特质”，但更常见的表达是 moldability（材料）或 flexibility/adaptability（人或想法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to be shaped or formed easily (physically or figuratively); flexibility","zh":"可塑性；可被轻易塑造或成形的特质（可指物理上的，也可指性格/想法上的）"},"examples":[{"en":"The moldableness of clay makes it easy for beginners to create simple bowls.","zh":"黏土的可塑性很强，所以初学者也能轻松做出简单的碗。"},{"en":"In the first months of training, the team valued her moldableness—she learned new routines quickly.","zh":"在培训的头几个月，团队很看重她的“可塑性”——她学新流程很快。"}]}],"synonyms":["moldability","flexibility","adaptability","plasticity","pliability"],"phonetic":"/ˈmoʊldəbəlnəs/","extraExplanation":["“moldableness”并不是特别常见的标准词汇；更常见、更自然的说法通常是 **moldability**（材料的可塑性）或 **flexibility / adaptability**（人的灵活性/适应力）。","构词上它来自 **moldable（可塑的）+ -ness（名词后缀，表示‘……的状态/性质’）**，意思通常不难猜，但在正式写作里用更常见的同义词会更地道。"]}
{"word":"moldasle","summary":{"en":"“moldasle” is not a recognized English word; it’s likely a misspelling. Tell me the sentence you saw it in, and I’ll help you find the correct word.","zh":"“moldasle” 不是可识别的英语单词，很可能是拼写错误。把它出现的句子发我，我可以帮你确定正确词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"**moldasle** is **not a standard English word** (no reliable dictionary entry found). It is likely a **misspelling** or a **random letter string**.","zh":"**moldasle** 不是**标准英语单词**（在可靠词典中找不到对应词条）。它更可能是**拼写错误**或**随机字母组合**。"},"examples":[{"en":"I couldn’t find “moldasle” in a dictionary—did you mean **models**?","zh":"我在词典里找不到 “moldasle”——你是不是想写 **models**（模特/模型，或“建模”）？"},{"en":"If you meant **mademoiselle** (French), it’s used like “Miss” for a young woman.","zh":"如果你想写 **mademoiselle**（法语），它常用作对年轻女性的称呼，类似英语里的 “Miss”。"},{"en":"If you meant **mold** or **mould**, it can mean “fungus” or “to shape something.”","zh":"如果你想写 **mold/mould**，它可以指“霉菌”，也可以作动词表示“塑形/成型”。"}]}],"extraExplanation":["我用网络检索了 “moldasle”，结果主要是一些“查不到该词”的页面和字母重排（anagram）工具，说明它很可能不是常见词汇，而是拼写输入错误。","你可以告诉我：你是在什么句子/场景里看到或想写这个词？我就能更准确判断你真正想要的单词（比如 models / mademoiselle / mold 等）。"]}
{"word":"moldavian","summary":{"en":"Moldavian usually means “related to Moldova” (similar to Moldovan), and less commonly “a person from Moldova.” It can also refer to the historical region of Moldavia.","zh":"Moldavian 通常指“与摩尔多瓦有关”（近似 Moldovan），较少指“摩尔多瓦人”。也可指历史上的摩尔达维亚地区（Moldavia）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Moldova, its people, or its culture; often used as another name for “Moldovan.”","zh":"与摩尔多瓦（Moldova）、其人民或文化有关的；常用作“摩尔多瓦的 / 摩尔多瓦人”的另一种说法。"},"examples":[{"en":"She studies Moldavian folk music and dance.","zh":"她研究摩尔多瓦的民间音乐和舞蹈。"},{"en":"We tried a traditional Moldavian dish at the festival.","zh":"我们在节日上尝了一道传统的摩尔多瓦菜。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Moldova (less common than “Moldovan”).","zh":"摩尔多瓦人（不如“Moldovan”常见）。"},"examples":[{"en":"He’s a Moldavian living in the United States.","zh":"他是一位住在美国的摩尔多瓦人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the historical region of Moldavia (a region split today mainly between Romania and Moldova); in this sense it can overlap with “Moldavian/Moldavian” used in Romanian contexts.","zh":"与历史上的“摩尔达维亚（Moldavia）地区”有关（该地区如今主要分属罗马尼亚与摩尔多瓦）；此义项常出现在罗马尼亚相关语境中。"},"examples":[{"en":"They visited Moldavian monasteries in northeastern Romania.","zh":"他们参观了罗马尼亚东北部的摩尔达维亚修道院。"}]}],"synonyms":["Moldovan","of Moldova","from Moldova"],"phonetic":"/moʊlˈdeɪviən/","extraExplanation":["用法提示：在现代英语里，谈“国家”时更常见的是 **Moldovan**（摩尔多瓦的/摩尔多瓦人）。**Moldavian** 有时会被理解为更偏历史或地区（Moldavia）含义，尤其在涉及罗马尼亚东北部“摩尔达维亚地区”的语境中。","语言文化背景：你也可能见到 **Moldavian language** 这个说法；在很多现代语言学与国际用法中，更常称为 **Romanian**（罗马尼亚语），但在部分政治/历史语境里仍会使用“摩尔多瓦语/摩尔达维亚语”的称呼。学习时可根据场景选择更中性、常用的表达。"]}
{"word":"moldavite","summary":{"en":"Moldavite is a rare green natural glass formed by a meteorite impact, mainly found in the Czech Republic and used as a gemstone.","zh":"摩尔达维石是一种罕见的绿色天然玻璃，由陨石撞击形成，主要产自捷克，常用于珠宝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of green natural glass (a tektite) formed by a meteorite impact, found mainly in the Czech Republic and used as a gemstone","zh":"一种绿色天然玻璃（陨石冲击玻璃/玻陨石），由陨石撞击形成，主要产自捷克，常被当作宝石使用"},"examples":[{"en":"She bought a small piece of moldavite and wore it as a pendant.","zh":"她买了一小块摩尔达维石，把它做成吊坠戴着。"},{"en":"Moldavite is often described as a tektite rather than a typical mineral crystal.","zh":"摩尔达维石常被描述为玻陨石（tektite），而不是典型的矿物晶体。"}]}],"synonyms":["tektite","impact glass"],"phonetic":"/ˈmoʊl.dəˌvaɪt/","extraExplanation":["“Moldavite（摩尔达维石）”这个名字来自捷克的摩尔达河（Vltava，德语旧称 Moldau）流域，因为早期发现地点与该地区有关。","它属于 tektite（玻陨石/陨石冲击玻璃）：高能撞击把地表物质瞬间熔融并抛射到空中，冷却后形成玻璃状碎块，因此常见表面有“蚀刻/起伏”的纹理。","在水晶与身心灵文化中，moldavite 常被赋予“能量很强、带来改变”等说法；这些属于个人信仰与文化现象，不等同于科学或医学结论。"]}
{"word":"moldboard","summary":{"en":"A moldboard is the curved plate on a plow that turns over the soil; it also describes tools that use this design.","zh":"moldboard 指犁上用来翻转土壤的弯曲犁壁/犁板，也可作形容词表示“犁壁式的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A curved metal plate on a plow that turns over (flips) the soil after it is cut.","zh":"（犁的）犁壁；犁板：犁上弯曲的金属板，用来把被切开的土壤翻转过来。"},"examples":[{"en":"The farmer replaced the worn moldboard before plowing the field.","zh":"农夫在犁地前把磨损的犁壁更换了。"},{"en":"Wet soil can stick to the moldboard and make plowing harder.","zh":"湿土容易黏在犁壁上，让翻地更费劲。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or used as a moldboard, especially in farming tools (e.g., “moldboard plow”).","zh":"犁壁式的；与犁壁有关的（常用于农具名称中，如“moldboard plow”犁壁犁）。"},"examples":[{"en":"A moldboard plow is designed to turn the soil over completely.","zh":"犁壁犁的设计目的就是把土壤彻底翻过来。"},{"en":"They switched from a moldboard plow to a no-till system to reduce erosion.","zh":"他们从犁壁犁改为免耕系统，以减少水土流失。"}]}],"synonyms":["plowshare (related)","plow blade (related)","mouldboard (British spelling)"],"phonetic":"/ˈmoʊldˌbɔrd/","extraExplanation":["“moldboard”最常见于农业语境，尤其是固定搭配“moldboard plow（犁壁犁）”。它的核心功能是把表层土翻到下面、把下层土翻到上面，常用于翻埋杂草或残茬。","词源上，mould/mold 有“模具、形状”的意思，board 是“板”。moldboard 可以理解为“用来塑形/翻形的板”，形象地对应它把土壤“翻出新形状”的作用。"]}
{"word":"moldboards","summary":{"en":"Moldboards are the curved plates (usually on a plow) that turn over soil; the word can also refer to similar curved plates on earthmoving machines.","zh":"moldboards 指（多为犁上的）弧形翻土板，用来把土翻转；也可指土方或道路设备上类似的弧形导板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The curved metal plate on a plow that turns over the soil after it is cut (plural form).","zh":"（犁上的）翻土板；把切开的土翻转过来的弧形金属板（复数）"},"examples":[{"en":"The farmer replaced the worn moldboards before spring planting.","zh":"春耕前，农夫把磨损的翻土板换掉了。"},{"en":"Different moldboards can change how finely the soil is turned.","zh":"不同的翻土板会影响翻土的细碎程度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also used more broadly) Curved plates on some earthmoving or road-maintenance equipment that guide and roll material aside (plural form).","zh":"（引申）某些土方/道路维护设备上的弧形导板，用来引导并推移泥土或碎石（复数）"},"examples":[{"en":"The grader’s moldboards pushed gravel back toward the center of the road.","zh":"平地机的导板把碎石推回到路中间。"}]}],"synonyms":["plowshare (related part)","curved plow plate","turning board"],"phonetic":"/ˈmoʊldˌbɔrd/","extraExplanation":["“moldboard”常见于农业机械语境，指犁上负责“翻起并翻转土壤”的关键部件。英式拼写常见为“mouldboard”。","词源上可理解为“mold/mould（塑形、成型）+ board（板）”，意思是把土“翻成形”的那块板。"]}
{"word":"molde","summary":{"en":"Molde means a mold or template used to shape something or serve as a pattern.","zh":"Molde 指“模具”或“模板/样板”，用于塑形或作为参照。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish/Portuguese) a mold or template used to shape something; a pattern or form to follow.","zh":"（西语/葡语）模具；模板；（可用来塑形或作为参照的）样板/形式。"},"examples":[{"en":"Use this molde to shape the clay into a bowl.","zh":"用这个模具把黏土塑形成一个碗。"},{"en":"The baker poured the chocolate into a heart-shaped molde.","zh":"面包师把巧克力倒进心形模具里。"},{"en":"This training program is a molde for new employees to follow.","zh":"这个培训项目是新员工可以遵循的模板。"}]}],"synonyms":["mold","template","pattern","form"],"phonetic":"/ˈmoʊldeɪ/","extraExplanation":["“Molde”常见于西班牙语和葡萄牙语语境中，英文里更常用对应词“mold”（美式）或“mould”（英式）。在手工、烘焙、制造等场景里多指“模具”，在学习/写作/流程等抽象场景里可引申为“模板、范式”。"]}
{"word":"molded","summary":{"en":"“Molded” means shaped into a form, or influenced/developed by something; it’s also the past form of “mold.”","zh":"“molded”表示“被塑造成某种形状的”或“被影响/被塑造的”；也是动词“mold”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped or formed into a particular shape, often using a mold (a hollow container) or by hand.","zh":"（常借助模具或手工）被塑造成某种形状的。"},"examples":[{"en":"The toy is made of molded plastic.","zh":"这个玩具是用模压成型的塑料做的。"},{"en":"She poured the chocolate into a tray and waited for it to become molded pieces.","zh":"她把巧克力倒进托盘里，等它凝固成一块块成型的巧克力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Strongly influenced or developed by something (such as experiences, education, or culture).","zh":"（性格、观念、能力等）被某些经历、教育或文化深刻影响并塑造的。"},"examples":[{"en":"His leadership style was molded by years of teamwork.","zh":"他的领导风格是多年团队合作塑造出来的。"},{"en":"A child’s habits are often molded by family routines.","zh":"孩子的习惯常常会被家庭日常所塑造。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mold”: to shape, form, or influence someone or something.","zh":"“mold”的过去式/过去分词：塑造；使成形；影响并培养。"},"examples":[{"en":"The artist molded the clay into a small bowl.","zh":"艺术家把黏土捏成一个小碗。"},{"en":"The program molded new employees into confident communicators.","zh":"这个培训项目把新员工培养成自信的沟通者。"}]}],"synonyms":["shaped","formed","fashioned","cast","influenced","conditioned"],"phonetic":"/ˈmoʊldɪd/","extraExplanation":["英式拼写常见为 moulded（美式 molded）。两者意思相同。","mold 既可指“模具/塑造”，也可指“霉菌”。molded 在日常里通常与“塑形/塑造”相关；若要表达“长霉”，更常说 be covered in mold 或 get moldy。"]}
{"word":"molder","summary":{"en":"Molder means to slowly rot/decay (often in damp conditions), and figuratively to be left unused or neglected for a long time.","zh":"molder 指（多因潮湿而）慢慢腐烂、朽坏；也可比喻长期被忽视而荒废、闲置。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To slowly decay or break down over time, especially because of dampness; to rot.","zh":"（因潮湿等原因）慢慢腐烂、朽坏；发霉般地变质。"},"examples":[{"en":"The bread began to molder in the warm, damp kitchen.","zh":"面包在温暖潮湿的厨房里开始慢慢变质。"},{"en":"Old papers can molder if they’re stored in a humid basement.","zh":"旧文件如果放在潮湿的地下室，会逐渐朽坏。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become neglected or inactive for a long time, as if “rotting away” without use or attention.","zh":"（比喻）长期被忽视、闲置、无所作为地“荒废”。"},"examples":[{"en":"He didn’t want his talent to molder in a job with no challenges.","zh":"他不想让自己的才能在毫无挑战的工作里被荒废。"},{"en":"The idea moldered for years before anyone took it seriously.","zh":"这个想法搁置多年后才有人认真对待。"}]}],"synonyms":["decay","rot","decompose","deteriorate","languish"],"phonetic":"/ˈmoʊldər/","extraExplanation":["拼写提醒：molder 是美式常见拼写；英式也常见 mould(er)。意思与 “mold（发霉）”相关，但 molder 更强调“逐渐腐朽/荒废”的过程。","文学与写作中常用作阴郁或哥特氛围的动词：如 “moldering ruins”（正在朽坏的废墟）、“moldering manuscripts”（逐渐朽坏的手稿）。"]}
{"word":"moldered","summary":{"en":"Moldered means “decayed slowly,” often from dampness; figuratively, it can mean “declined or sat unused for a long time.”","zh":"moldered 指“慢慢腐烂、朽坏”（常因潮湿）；比喻时可指“衰退或长期搁置荒废”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of something, especially wood, paper, or food) to become rotten or break down slowly, often because of dampness and time.","zh":"（尤指木头、纸张或食物）因潮湿和时间而慢慢腐烂、朽坏。"},"examples":[{"en":"The old books had moldered in a damp basement.","zh":"那些旧书在潮湿的地下室里慢慢朽坏了。"},{"en":"Bread left in a warm, wet place quickly moldered.","zh":"面包放在温暖潮湿的地方很快就腐坏了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(figurative) to decline, weaken, or be left unused for a long time.","zh":"（比喻）衰退、逐渐变差；或长期闲置不用。"},"examples":[{"en":"His talents moldered because he stopped practicing.","zh":"因为他停止练习，他的才能渐渐荒废了。"},{"en":"The plan moldered on the shelf for years.","zh":"这个计划在架子上搁置多年，逐渐被人遗忘。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to decay or rot (less common; usually you say “let something molder”).","zh":"使某物腐烂、朽坏（较少用；更常说“让某物molder”）。"},"examples":[{"en":"The leak moldered the wooden floor over time.","zh":"漏水久而久之把木地板弄朽坏了。"}]}],"synonyms":["decayed","rotted","decomposed","deteriorated","crumbled","languished"],"phonetic":"/ˈmoʊldərd/","extraExplanation":["“moldered”是动词“molder”的过去式/过去分词。英式拼法常见为“moulder”。两者意思相同。","这个词常带有文学色彩，常用于描写“被时间和潮湿慢慢侵蚀”的画面感（如旧纸张、古宅、被遗忘的物品）。"]}
{"word":"moldering","summary":{"en":"Moldering means slowly decaying—often in damp, musty conditions—or (figuratively) being left unused for a long time.","zh":"moldering 指在潮湿霉味环境中慢慢腐朽、霉烂；也可比喻长期被搁置不用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something organic, like wood, paper, food, or cloth) slowly decaying, often becoming musty because of damp conditions.","zh":"（多指木头、纸张、食物、布料等有机物）在潮湿环境中缓慢腐朽、霉烂，常带霉味。"},"examples":[{"en":"The books were moldering in a damp basement.","zh":"这些书在潮湿的地下室里慢慢发霉腐坏。"},{"en":"We found moldering leaves under the old fence.","zh":"我们在旧栅栏下面发现了正在腐烂的落叶。"}]},{"partOfSpeech":"v.","definition":{"en":"slowly decaying or breaking down; to decay gradually (often used for objects or remains).","zh":"逐渐腐朽、慢慢分解；（使）慢慢腐烂（常指物品或遗骸）。"},"examples":[{"en":"Old wooden beams can molder if they stay wet for years.","zh":"老木梁如果多年受潮，可能会逐渐腐朽。"},{"en":"The abandoned house was left to molder over time.","zh":"那座废弃的房子被任其日渐破败。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) left unused or forgotten for a long time, as if “rotting” in place.","zh":"（比喻）长期被搁置、被遗忘，仿佛“在原地烂掉”。"},"examples":[{"en":"His application sat moldering in a drawer for months.","zh":"他的申请材料在抽屉里被搁置了好几个月。"},{"en":"Great ideas can’t succeed if they’re moldering on the shelf.","zh":"好点子如果一直被束之高阁，就难以成功。"}]}],"synonyms":["decaying","rotting","decomposing","musty","deteriorating","languishing"],"phonetic":"/ˈmoʊldərɪŋ/","extraExplanation":["“moldering”常见于描写阴暗、潮湿、衰败氛围的语境（如哥特文学、悬疑或废墟场景）。比起一般的“decaying”，它更强调“缓慢”“潮湿导致的霉腐/霉味（musty）”。","拼写上美式常见 molder，英式也常见 mould(er)/mouldering（与英式拼写 mould = 霉菌有关）。"]}
{"word":"molders","summary":{"en":"“Molders” usually means “slowly decays/rots” (as a verb form), and it can also mean “people who mold materials” (plural noun).","zh":"“molders”通常指“慢慢腐朽/腐烂”（动词形式），也可指“模制工/塑形的人”（复数名词）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(third-person singular of “molder”) to slowly decay or break down, often from age, moisture, or neglect; to rot or crumble gradually.","zh":"（“molder”的第三人称单数）慢慢腐朽、变质或风化；（因时间、潮湿或疏于照料而）逐渐腐烂、碎裂。"},"examples":[{"en":"The old books molder in the damp basement.","zh":"旧书在潮湿的地下室里慢慢发霉腐朽。"},{"en":"Without care, wooden fences molder over time.","zh":"如果不维护，木栅栏会随着时间慢慢腐烂。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) people who make shapes or parts by molding a material (such as clay, plastic, or metal).","zh":"（复数名词）模制工；用模具将材料（如黏土、塑料或金属）塑形的人。"},"examples":[{"en":"The factory hired experienced molders to make the parts.","zh":"工厂雇了有经验的模制工来生产零件。"},{"en":"In the art studio, molders shape clay into bowls and figures.","zh":"在艺术工作室里，制模者把黏土塑成碗和雕塑小像。"}]}],"synonyms":["decays","rots","crumble","decompose","molders (workers): mold-makers","formers"],"phonetic":"ˈmoʊldər","extraExplanation":["“molder（腐朽）”常见于描写被遗忘的事物：旧纸张、木头、食物在潮湿环境中慢慢变坏，语气带有“长期无人照料”的画面感。","不要和“mold（霉菌/模具）”混淆：mold作名词常指“霉”或“模具”，作动词常指“塑形”。而molder更偏“逐渐腐朽”。在英式拼写中也常见“moulder”。"]}
{"word":"moldery","summary":{"en":"“Moldery” means moldy—covered with mold or smelling musty from dampness or decay.","zh":"“moldery”意思接近“moldy”，指发霉的、霉味重的，常因潮湿或腐坏造成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with or smelling of mold; slightly decayed because of dampness or age.","zh":"发霉的；有霉味的；因潮湿或时间而略微腐坏的。"},"examples":[{"en":"The bread was moldery, so we threw it away.","zh":"面包发霉了，所以我们把它扔掉了。"},{"en":"Old books in a wet basement can get moldery.","zh":"潮湿地下室里的旧书可能会变得发霉。"}]}],"synonyms":["moldy","musty","mildewed","stale"],"phonetic":"/ˈmoʊldəri/","extraExplanation":["“moldery”在现代英语中不算常见；更常用的是“moldy”。两者意思基本相同。","英美拼写差异：美式多用“mold / moldy”，英式常见“mould / mouldy”。“moldery”有时也会被当作“mouldery”的变体来用。","词根提示：mold/mould与“潮湿导致的霉菌、生锈、腐坏”相关；也与动词“to molder”（慢慢腐朽、崩解）同源，带有“逐渐变坏”的感觉。"]}
{"word":"moldier","summary":{"en":"Molder means to slowly decay or crumble; as a noun, it can mean a worker who makes molds.","zh":"molder 指慢慢腐朽或崩解；作名词时可指制模工。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to slowly decay or break down into dust; to crumble over time","zh":"（慢慢）腐朽、分解成粉末；逐渐崩解"},"examples":[{"en":"The old books were left in a damp basement and began to molder.","zh":"那些旧书被放在潮湿的地下室里，开始慢慢腐朽。"},{"en":"Without care, wooden furniture can molder in a wet climate.","zh":"如果不保养，木制家具在潮湿气候里会慢慢腐烂。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is to make molds (especially in metal casting)","zh":"制模工；（尤指金属铸造中的）造型工"},"examples":[{"en":"The molder shaped a sand mold before the molten metal was poured in.","zh":"在倒入熔融金属之前，制模工先做好了砂型。"}]}],"synonyms":["decay","rot","crumble","deteriorate"],"phonetic":"/ˈmoʊldər/","extraExplanation":["“moldier”不是常见的标准拼写；你很可能想写的是 **molder**（美式拼写），英式常写作 **moulder**。","动词 **molder/moulder** 常用于描述“在潮湿、被遗忘的环境里逐渐腐坏”的感觉，语气上带一点“被时间吞没、无人照料”的画面感。"]}
{"word":"moldiest","summary":{"en":"“Moldiest” means “the most moldy,” literally covered with the most mold, or figuratively the most stale/old-fashioned.","zh":"“moldiest” 表示“最发霉的”，字面指霉菌最多；也可比喻“最陈旧/最老套的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of moldy: having the most mold, or covered with mold more than anything else in a group.","zh":"moldy 的最高级：最发霉的；在一组事物中霉菌最多/最严重的。"},"examples":[{"en":"Throw away the moldiest bread and keep the fresh slices.","zh":"把最发霉的面包扔掉，留下新鲜的几片。"},{"en":"The moldiest corner of the bathroom needs cleaning right away.","zh":"浴室里最发霉的角落需要马上清理。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, informal) The most stale, old-fashioned, or out of date.","zh":"（比喻；非正式）最陈旧的、最过时的、最老套的。"},"examples":[{"en":"That’s the moldiest joke I’ve ever heard.","zh":"那是我听过最老套的笑话。"},{"en":"His ideas sounded moldiest compared with the new plan.","zh":"和新方案比起来，他的想法显得最过时。"}]}],"synonyms":["most moldy","stalest","mustiest","most outdated"],"phonetic":"/ˈmoʊldiəst/","extraExplanation":["拼写提示：moldy 变最高级时，通常把 y 变成 i 再加 -est → moldiest。","用法提示：字面意思常与食物、潮湿的房间等相关；比喻用法常形容“陈腐的笑话/观点”。"]}
{"word":"moldiness","summary":{"en":"Moldiness means the condition of being moldy or having a musty smell caused by mold.","zh":"moldiness 指“发霉/有霉味的状态”，通常由潮湿导致霉菌滋生而产生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being moldy; the musty smell or damp condition caused by mold (a type of fungus).","zh":"发霉的状态；由霉菌（真菌）引起的霉味或潮湿变质的情况。"},"examples":[{"en":"The bread was thrown away because of its moldiness.","zh":"面包因为发霉被扔掉了。"},{"en":"A musty moldiness hung in the basement after the rain.","zh":"下雨后，地下室里弥漫着一股霉味。"}]}],"synonyms":["mustiness","mildew","dampness"],"phonetic":"/ˈmoʊldi.nəs/","extraExplanation":["“moldiness”常用于描述食物、衣物、墙面或地下室等因潮湿而滋生霉菌后的气味与状态。日常英语里更常见的说法是用形容词“moldy”或短语“smells moldy / has mold on it”。","近义表达：mustiness（霉味、陈腐味）更偏“气味”的感觉；mildew（霉菌/霉斑）常见于衣物或潮湿墙面。"]}
{"word":"moldinesses","summary":{"en":"“Moldinesses” is the plural of “moldiness,” meaning multiple instances or kinds of moldy condition or mustiness.","zh":"“moldinesses”是“moldiness”的复数，指多处或多种“发霉/霉味”的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being moldy (having mold); damp, musty quality—plural form","zh":"发霉的状态或性质（长霉菌）；潮湿、霉味的感觉——复数形式"},"examples":[{"en":"The inspector noted moldinesses in several corners of the basement.","zh":"检查员注意到地下室几个角落都有发霉现象。"},{"en":"Different moldinesses can create different smells, from musty to sour.","zh":"不同程度或类型的霉变会产生不同气味，从霉味到酸味不等。"}]}],"synonyms":["mildewiness","mustiness","mold","mildew"],"phonetic":"/ˈmoʊldiˌnɛsɪz/","extraExplanation":["“moldinesses”是名词“moldiness”的复数，但在日常英语里很少用复数；更常见的表达是不可数用法“moldiness”（例如：There is moldiness on the wall.）或直接用可数名词“mold / molds”（例如：There are molds on the bread.）。","英美拼写差异：美式更常写“mold”，英式常写“mould”。因此你也可能见到“mouldiness / mouldinesses”。"]}
{"word":"molding","summary":{"en":"Molding most commonly means decorative trim in buildings, and it can also mean the process of shaping material into a form.","zh":"molding 常指装修中的装饰线条，也可指把材料塑造成某种形状的成型过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative strip of wood, plaster, or other material used to add detail and cover edges (often around ceilings, doors, or windows).","zh":"（建筑/装修）装饰线条；压边条（常用于天花板、门窗周围，用来装饰并遮住接缝/边缘）。"},"examples":[{"en":"They added crown molding to make the living room look more elegant.","zh":"他们加装了顶角线条，让客厅看起来更雅致。"},{"en":"The baseboard molding is chipped near the hallway.","zh":"走廊附近的踢脚线条有缺口。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of shaping a material in a mold or by hand; making something into a particular form.","zh":"（制作）模塑过程；成型（把材料放入模具或用手塑造成某种形状的过程）。"},"examples":[{"en":"The molding of the plastic parts takes only a few minutes.","zh":"这些塑料零件的模塑只需要几分钟。"},{"en":"In art class, we practiced the molding of clay into small bowls.","zh":"在美术课上，我们练习把黏土捏成小碗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaping something; forming it (often used before a noun).","zh":"正在塑形的；用于塑造的（常作定语）。"},"examples":[{"en":"She used a molding tool to create the pattern.","zh":"她用塑形工具做出花纹。"},{"en":"Molding hands-on habits takes time and patience.","zh":"培养动手习惯需要时间和耐心。"}]}],"synonyms":["trim","moulding","cast","shaping","forming"],"phonetic":"ˈmoʊldɪŋ","extraExplanation":["美式拼写通常是 molding；英式拼写多为 moulding（意思基本相同）。","在家装语境里，molding 常指各种“线条/收边”：如 crown molding（顶角线）、baseboard molding（踢脚线）、door/window molding（门窗套线）。","注意区分 molding（线条/成型）与 mold（霉菌；模具）。molding 也可表示“塑造/培养”某种能力或性格（比喻用法）。"]}
{"word":"moldings","summary":{"en":"“Moldings” usually means decorative trim in buildings; it can also mean molded parts made by shaping material in a mold.","zh":"“moldings”通常指建筑中的装饰线条；也可指用模具成型的部件/成型物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative strips of wood, plaster, or other material used to cover edges or add detail, especially around ceilings, floors, doors, or windows (e.g., crown molding, baseboard).","zh":"（建筑/装修）装饰线条；用于遮盖边缘或增加细节的木条、石膏条等，常见于天花板、地板、门窗周围（如顶角线、踢脚线）。"},"examples":[{"en":"The old house has beautiful moldings around the doors and windows.","zh":"这栋老房子的门窗周围有很漂亮的装饰线条。"},{"en":"We painted the walls white and kept the moldings a warm cream color.","zh":"我们把墙刷成白色，把装饰线条保留为暖米色。"},{"en":"Crown moldings can make a room look more elegant.","zh":"顶角线能让房间看起来更高雅。"}]},{"partOfSpeech":"n.","definition":{"en":"The process or act of shaping something in a mold; the materials made by that process (plural of “molding”).","zh":"（制造）用模具成型的过程；或由此制成的成型物（“molding”的复数）。"},"examples":[{"en":"These plastic moldings are used to protect the edges of the panels.","zh":"这些塑料成型件用于保护面板的边缘。"},{"en":"The factory produces rubber moldings for car doors.","zh":"这家工厂生产汽车车门用的橡胶成型件。"}]}],"synonyms":["trim","decorative trim","architectural molding","(manufacturing) molded parts"],"phonetic":"/ˈmoʊldɪŋz/","extraExplanation":["“moldings”在美式英语里常指室内装修的装饰线条；在英式英语里拼写常见为“mouldings”。","常见搭配：crown molding（顶角线）、baseboard molding（踢脚线）、door/window molding（门/窗套线）、decorative molding（装饰线条）。"]}
{"word":"moldmade","summary":{"en":"Mold-made describes something formed in a mold, often mass-produced and uniform.","zh":"Mold-made指“用模具成型制作的”，常带有批量生产、外观较一致的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made by shaping material in a mold (rather than by hand); mass-produced using a mold","zh":"用模具成型制作的（而非手工制作的）；通过模具大量生产的"},"examples":[{"en":"The parts are mold-made, so each one is nearly identical.","zh":"这些零件是模具成型的，所以每个几乎都一模一样。"},{"en":"She preferred handmade pottery to mold-made cups.","zh":"比起模具成型的杯子，她更喜欢手工陶器。"}]}],"synonyms":["molded","machine-made","mass-produced","cast","injection-molded"],"phonetic":"ˈmoʊldˌmeɪd","extraExplanation":["“mold-made”更常见的写法是带连字符的形容词（mold-made）。你写的“moldmade”通常会被看作拼写或排版省略。","常见于制造与材料语境：塑料注塑（injection-molded）、铸造（cast）、压模（molded）。在日常表达里，人们也常用更具体的词，如 injection-molded（注塑成型的）或 machine-made（机器制造的）。"]}
{"word":"moldproof","summary":{"en":"“Moldproof” means resistant to mold, or to treat something so it won’t grow mold.","zh":"“moldproof”表示“防霉的”，也可作动词表示“给……做防霉处理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to mold (fungus) growth; designed to prevent mold.","zh":"防霉的；抗霉的；不易长霉的。"},"examples":[{"en":"This bathroom paint is moldproof, so it’s good for humid areas.","zh":"这种浴室涂料是防霉的，所以很适合潮湿环境。"},{"en":"Choose moldproof fabric for curtains in a damp room.","zh":"在潮湿的房间里，窗帘最好选用防霉面料。"}]},{"partOfSpeech":"vt.","definition":{"en":"To treat or make something resistant to mold, usually by adding a protective chemical or coating.","zh":"（通过药剂或涂层）使……防霉；对……进行防霉处理。"},"examples":[{"en":"They moldproofed the wooden shelves before storing them in the basement.","zh":"他们在把木架放到地下室前先做了防霉处理。"},{"en":"You can moldproof the wall with a special primer.","zh":"你可以用专用底漆给墙面做防霉处理。"}]}],"synonyms":["mold-resistant","anti-mold","mildew-resistant","fungus-resistant"],"phonetic":"/ˈmoʊldˌpruːf/","extraExplanation":["“moldproof”也常写作“mold-proof”。在日常语境里，它常出现在产品说明中（如 paint/primer/fabric/packing）。另外，mold（霉菌）与 mildew（霉斑、霉味）在口语里常混用，但“mold”更常作为泛称。"]}
{"word":"molds","summary":{"en":"“Molds” can mean fungi (plural), forming containers (plural), or the verb “molds” meaning shapes/influences—or (for food) becomes moldy.","zh":"“molds”可指“霉菌（复数）”“模具（复数）”，也可作动词，表示“塑造/使成形”，或指（食物等）“发霉变质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mold”: a soft, fuzzy growth (a fungus) that can appear on food or in damp places.","zh":"“mold”的复数：霉菌；在潮湿环境或食物上长出的绒毛状真菌。"},"examples":[{"en":"There are molds on the bread, so we should throw it away.","zh":"面包上有霉菌，所以我们应该把它扔掉。"},{"en":"Bathrooms can grow molds if they don’t dry well.","zh":"浴室如果不容易干，就可能长霉。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “mold”: a hollow container or shape used to form something (e.g., metal, chocolate, plastic).","zh":"“mold”的复数：模具；用来把材料做成特定形状的容器或模型（如金属、巧克力、塑料）。"},"examples":[{"en":"The factory uses different molds to make bottle caps.","zh":"工厂用不同的模具来制作瓶盖。"},{"en":"Pour the melted chocolate into the molds and let it cool.","zh":"把融化的巧克力倒进模具里，放凉定型。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “mold”: to shape or influence something; to form it into a particular shape.","zh":"“mold”的第三人称单数：塑造；使成形；对（人/事）产生影响并加以塑造。"},"examples":[{"en":"A good teacher molds students’ confidence over time.","zh":"好的老师会随着时间塑造学生的自信。"},{"en":"She molds the clay into a small bowl.","zh":"她把黏土捏成一个小碗。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become covered with mold; to spoil by growing fungus (often used with food).","zh":"发霉；（常指食物）因长霉菌而变质。"},"examples":[{"en":"Food molds quickly in a warm, humid room.","zh":"在温暖潮湿的房间里，食物很快就会发霉。"}]}],"synonyms":["mildew","fungus","mold (AmE) / mould (BrE)","cast","form","shape","fashion"],"phonetic":"/moʊldz/","extraExplanation":["美式英语常拼作 mold；英式英语更常见拼作 mould（意思通常相同：霉菌/模具/塑造）。","在健康与居家语境里，mold(s) 常指“霉菌问题”（如墙角、浴室、地下室）。在工业或烘焙语境里，mold(s) 更常指“模具”。要结合上下文判断。"]}
{"word":"moldwarp","summary":{"en":"Moldwarp is an old word for a mole, a small underground digging animal.","zh":"moldwarp 是“鼹鼠”的古旧说法，指会在地下挖洞的小动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) A mole: a small animal that lives underground and digs tunnels.","zh":"（古旧用法）鼹鼠：一种生活在地下、会挖掘地道的小动物。"},"examples":[{"en":"In the old poem, a moldwarp tunnels under the field.","zh":"在那首古诗里，一只鼹鼠在田地下打洞。"},{"en":"The garden soil was full of little hills, as if a moldwarp had been working all night.","zh":"花园土里到处是小土堆，好像鼹鼠忙了一整夜。"}]}],"synonyms":["mole","mole rat (not the same animal)","burrowing mammal"],"phonetic":"/ˈmoʊld.wɔrp/","extraExplanation":["“moldwarp”是非常少见的古词，更多见的现代英语是“mole”。它来自中古英语，常被解释为“earth-thrower（把土拱起来的东西）”，形容鼹鼠打洞时把土往上推，形成小土丘。","在文学或旧文本里看到“moldwarp”，通常只是作者为了营造古风或方言色彩；日常交流中用“mole”更自然。"]}
{"word":"moldwarps","summary":{"en":"Moldwarps is the plural of moldwarp: an old word for “mole,” and by extension an old insult meaning a dull or foolish person.","zh":"moldwarps 是 moldwarp 的复数：一个较古老的“鼹鼠”说法，也可引申为旧式侮辱语，指愚笨或迟钝的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mole (a small burrowing mammal)","zh":"鼹鼠（会在地下打洞的小型哺乳动物）"},"examples":[{"en":"The gardener blamed the moldwarps for the new tunnels in the lawn.","zh":"园丁把草坪上新出现的地道归咎于鼹鼠。"},{"en":"In old writings, “moldwarp” is another word for a mole.","zh":"在较古老的文字里，“moldwarp”是“鼹鼠”的另一种说法。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, insulting) a dull or foolish person","zh":"（旧式、带侮辱）愚笨的人；蠢人"},"examples":[{"en":"He called his rival a moldwarp, meaning he was slow and stupid.","zh":"他骂对手是个“moldwarp”，意思是对方迟钝又愚蠢。"},{"en":"The word is harsh today, so it’s better to avoid using it about people.","zh":"这个词用在当代语境里很刻薄，所以最好不要用来形容人。"}]}],"synonyms":["mole","dunce","fool","idiot"],"phonetic":"/ˈmoʊldˌwɔrp/","extraExplanation":["“moldwarp”是古英语/中古英语里对“鼹鼠”的称呼之一，和“mold”（土、泥）有关，强调它在土里钻行的习性。","这个词在文学作品（例如莎士比亚戏剧）里偶尔会出现，用来骂人“像鼹鼠一样蠢/迟钝”。现代英语里很少用，多见于文学、历史语境或仿古表达。","你写的“moldwarps”是复数形式；单数是“moldwarp”。"]}
{"word":"moldy","summary":{"en":"Moldy means covered with mold (spoiled), and informally it can mean old-fashioned or stale.","zh":"moldy 意为“发霉的、变质的”；口语里也可指“陈旧老套的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with mold (a type of fungus), usually because something is old, damp, or not stored well; spoiled.","zh":"长霉的；发霉的（通常因食物或物品放久、受潮或保存不当而变质）。"},"examples":[{"en":"The bread smells sour—it’s moldy.","zh":"面包闻起来酸酸的——它发霉了。"},{"en":"Throw away any moldy fruit so it doesn’t spread to the rest.","zh":"把发霉的水果扔掉，免得霉菌扩散到其他水果上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Old-fashioned, stale, or boring, as if it has “gone bad” with age.","zh":"（非正式）陈旧的；老套的；乏味的（比喻像“放坏了”一样）。"},"examples":[{"en":"He keeps telling the same moldy jokes.","zh":"他老是讲同样那些老掉牙的笑话。"}]}],"synonyms":["mildewed","mold-covered","stale","musty"],"phonetic":"/ˈmoʊldi/","extraExplanation":["日常生活里更常用的搭配是：moldy bread（发霉的面包）、moldy cheese（发霉的奶酪）、moldy smell（霉味）、a moldy room（潮湿发霉的房间）。","注意区分：moldy（长霉/发霉） vs. musty（霉味、陈旧的味道，未必真的长霉）。","安全提示（常识）：很多情况下发霉食物不只是表面问题，霉菌可能深入内部；除非是特定可安全食用的发酵/蓝纹奶酪等，否则一般建议丢弃。"]}
{"word":"mole","summary":{"en":"Mole most commonly means a small spot on the skin, an underground digging animal, or a hidden spy inside a group.","zh":"mole 常见意思包括：皮肤上的痣、会打洞的鼹鼠，以及组织内部的卧底/内鬼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dark spot on the skin (a beauty mark); sometimes a medical concern if it changes shape or color","zh":"（皮肤上的）痣；（若形状或颜色变化）可能需要就医检查"},"examples":[{"en":"She has a small mole on her left cheek.","zh":"她左脸颊上有一颗小痣。"},{"en":"If a mole suddenly grows or changes color, see a doctor.","zh":"如果痣突然变大或变色，最好去看医生。"}]},{"partOfSpeech":"n.","definition":{"en":"a small underground animal with very small eyes and strong front paws for digging","zh":"鼹鼠（生活在地下、眼睛很小、擅长挖洞的动物）"},"examples":[{"en":"A mole dug tunnels under the garden.","zh":"一只鼹鼠在花园下面挖了很多地道。"},{"en":"Moles are hard to spot because they live mostly underground.","zh":"鼹鼠很难看到，因为它们大多生活在地下。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who secretly gives information to an enemy or rival group; a spy planted inside an organization","zh":"内鬼；卧底；（暗中提供情报的）间谍"},"examples":[{"en":"The police suspected there was a mole inside the team.","zh":"警方怀疑团队里有内鬼。"},{"en":"They spent months trying to identify the mole.","zh":"他们花了几个月试图找出那个卧底。"}]}],"synonyms":["beauty mark (skin)","nevus (medical)","mole (animal: no close everyday synonym)","spy","informant","plant"],"phonetic":"/moʊl/","extraExplanation":["“mole”表示“内鬼/卧底”的意思在新闻、间谍小说和职场语境里很常见，强调“隐藏在内部、长期潜伏”的人。","“mole”表示“痣”时很日常；在健康语境里常见搭配有：check a mole（检查痣）、a changing mole（变化的痣）。","注意不要和“mole”作化学单位（物质的量，mol）混淆；它的拼写相同，但属于科学术语，这里不作为常用日常义重点。"]}
{"word":"molebut","summary":{"en":"“molebut” is not a recognized English word; it’s likely a misspelling or a proper name.","zh":"“molebut”不是公认的英语单词；很可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/handle. If you share the sentence or the intended meaning, I can help identify the correct word.","zh":"不是标准英语单词。更可能是拼写错误，或是人名/网名/专有名词。若你提供所在句子或想表达的意思，我可以帮你判断你想写的正确单词。"},"examples":[{"en":"I can’t find “molebut” in major English dictionaries—could you give me a sentence with it?","zh":"我在主要英语词典里找不到“molebut”——你能给我一个包含它的句子吗？"},{"en":"Did you mean “mole” (a small animal / a skin spot / a spy)?","zh":"你是不是想写“mole”（鼹鼠 / 痣 / 内奸、间谍）？"}]}],"extraExplanation":["“molebut”很像把两个词拼在一起（mole + but）或把某个词打错了。常见相近目标可能是：\n- mole：鼹鼠；（皮肤上的）痣；（组织里的）内线/间谍\n- molet / mole-：一些科技或化学词的前缀（但“molebut”本身不常见）\n如果你告诉我：①你在哪里看到它（游戏ID/文章/聊天）②前后句内容③你想表达的中文意思，我就能更准确地给出正确拼写和用法。"]}
{"word":"molecast","summary":{"en":"Molecast means the soil mound made by a mole’s digging, and (less commonly) the act of pushing that soil up.","zh":"molecast 指鼹鼠挖洞拱到地表的土堆（常见），也可指拱土形成土堆的行为（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small mound or ridge of earth pushed up to the surface by a mole digging underground (also called a molehill).","zh":"（鼹鼠在地下挖洞时）拱到地表的土堆/土脊；鼹鼠丘（也可称 molehill）。"},"examples":[{"en":"The lawn was dotted with molecasts after the rain.","zh":"雨后草坪上到处都是鼹鼠拱出的土堆。"},{"en":"He kicked the molecast flat before mowing the grass.","zh":"他在修剪草坪前把鼹鼠土堆踢平了。"}]},{"partOfSpeech":"v.","definition":{"en":"to push soil up to the surface while digging like a mole; to form molecasts.","zh":"（像鼹鼠一样在地下挖掘时）把土拱到地表；形成鼹鼠土堆。"},"examples":[{"en":"Moles can molecast overnight, leaving fresh soil on the lawn.","zh":"鼹鼠可能一夜之间就把新土拱到草坪表面。"}]}],"synonyms":["molehill","mound","soil heap","earth mound"],"phonetic":"/ˈmoʊlˌkæst/","extraExplanation":["“molecast”在园艺/草坪管理语境中更常见，指鼹鼠挖掘时把地下土壤“顶”到地面的那一堆（或一串）松土。它常被用来判断鼹鼠活动是否频繁。"]}
{"word":"molecu","summary":{"en":"A molecule is a tiny unit of matter made from atoms bonded together; informally, it can mean a very tiny amount.","zh":"molecule 指由原子结合而成的“分子”；口语中也可指“极少量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small unit made of two or more atoms bonded together; the smallest unit of a chemical substance that still has that substance’s properties","zh":"由两个或以上原子结合而成的极小单位；能保留该物质化学性质的最小粒子（分子）"},"examples":[{"en":"A water molecule is made of two hydrogen atoms and one oxygen atom (H₂O).","zh":"一个水分子由两个氢原子和一个氧原子组成（H₂O）。"},{"en":"Perfume molecules spread through the air, so you can smell them from far away.","zh":"香水分子会在空气中扩散，所以你在远处也能闻到味道。"},{"en":"Scientists use models to show how molecules are shaped.","zh":"科学家用模型来展示分子的形状。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) an extremely small amount of something","zh":"（非正式）极少量；一丁点"},"examples":[{"en":"There wasn’t a molecule of truth in his story.","zh":"他的故事里一点真实都没有。"},{"en":"She didn’t show a molecule of interest.","zh":"她一点兴趣都没有表现出来。"}]}],"synonyms":["particle","atom (not the same as molecule)","tiny amount (informal sense)"],"phonetic":"/ˈmɑlɪˌkjul/","extraExplanation":["你输入的“molecu”通常是单词 **molecule** 的不完整拼写。","词源上，*molecule* 来自拉丁语 *moles*（“质量、块”）的指小形式，原意有“很小的一块/小粒子”的感觉，因此也引申出“极少量”的口语用法。"]}
{"word":"molecula","summary":{"en":"“Molecula” is usually a misspelling in English; the correct word is “molecule,” meaning a group of atoms bonded together—the smallest unit of a substance with its chemical properties.","zh":"“molecula”在英语中通常是拼写不规范；正确词为“molecule（分子）”，指由原子键合形成、仍保持物质化学性质的最小单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A molecule: the smallest unit of a substance that still has the chemical properties of that substance, made of two or more atoms joined together.","zh":"分子：由两个或更多原子结合在一起构成的、仍然保持该物质化学性质的最小单位。"},"examples":[{"en":"A water molecule is made of two hydrogen atoms and one oxygen atom (H₂O).","zh":"一个水分子由两个氢原子和一个氧原子组成（H₂O）。"},{"en":"Scientists study how molecules interact to create new materials.","zh":"科学家研究分子如何相互作用来制造新材料。"}]}],"synonyms":["chemical compound (general)","particle (general)"],"phonetic":"/ˈmɑlɪˌkjuːl/","extraExplanation":["“molecula”在英语里通常不是标准拼写；最常见的正确拼写是 **molecule**。在一些语言（如西班牙语、葡萄牙语）中，*molécula/molécula* 对应英语的 *molecule*，因此可能是拼写或输入法影响。","词源上，*molecule* 来自拉丁语 *molecula*（意为“微小的质量/小块”），所以你输入的形式更接近它的词源形态。"]}
{"word":"molecular","summary":{"en":"Molecular means “related to molecules,” often used in science (e.g., molecular biology, molecular structure).","zh":"molecular 表示“与分子有关的”，常用于科学领域，如分子生物学、分子结构等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to molecules (the smallest units of a chemical substance) or the structure and behavior of molecules.","zh":"与分子有关的；涉及分子的结构、性质或行为的。"},"examples":[{"en":"Scientists study molecular structure to understand how a drug works.","zh":"科学家研究分子结构，以理解药物如何起作用。"},{"en":"Molecular biology explains how genes and proteins function inside cells.","zh":"分子生物学解释基因和蛋白质如何在细胞内发挥作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely small; on a very tiny scale (often used in scientific contexts).","zh":"极其微小的；在非常微观的尺度上（多用于科学语境）。"},"examples":[{"en":"There are molecular differences between the two samples.","zh":"这两份样本之间存在微观（分子层面）的差异。"}]}],"synonyms":["chemical (context-dependent)","microscopic (sometimes)","nanoscale (related in meaning)"],"phonetic":"/məˈlɛkjələr/","extraExplanation":["词源上，molecular 来自 molecule（分子）+ -ar（形容词后缀，“……的”）。在学术写作里常见搭配有：molecular level（分子层面）、molecular mechanisms（分子机制）、molecular weight（分子量）。","在日常英语中，molecular 通常用于科学/医学语境；如果只想表达“非常小”，更常用 tiny、minute、microscopic，而 molecular 会显得更“专业”。"]}
{"word":"molecularist","summary":{"en":"A molecularist is a scientist who studies molecules and molecular-level processes.","zh":"molecularist 指研究分子及分子层面过程的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist or researcher who specializes in studying molecules and molecular processes (especially in chemistry or molecular biology).","zh":"分子学研究者；研究分子及其过程的科学家（尤指化学或分子生物学领域）。"},"examples":[{"en":"The molecularist analyzed how a small drug molecule binds to a protein.","zh":"这位分子学研究者分析了一种小药物分子如何与蛋白质结合。"},{"en":"In the lab, the molecularist used spectroscopy to identify the compound’s structure.","zh":"在实验室里，这位分子学研究者用光谱技术来鉴定化合物的结构。"}]}],"synonyms":["molecular scientist","molecular biologist","chemist"],"phonetic":"/məˈlɛkjələrɪst/","extraExplanation":["“molecularist”在日常英语中不算常见，更常用的说法是“molecular biologist（分子生物学家）”“chemist（化学家）”或“molecular scientist（分子科学家）”。","词尾“-ist”通常表示“从事某领域的人/信奉某种观点的人”，如“biologist（生物学家）”“chemist（化学家）”“artist（艺术家）”。"]}
{"word":"molecularity","summary":{"en":"Molecularity is the number of reacting particles involved in one elementary reaction step.","zh":"molecularity 指一个基元反应步骤中参与反应的粒子数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The number of reacting particles (molecules, atoms, ions, etc.) that collide in a single elementary reaction step.","zh":"（化学）在一个基元反应步骤中参与碰撞并发生反应的反应粒子数（如分子、原子、离子等）。"},"examples":[{"en":"For an elementary step A + B → products, the molecularity is 2 (bimolecular).","zh":"对于基元步骤 A + B → 生成物，其分子数（molecularity）为 2（双分子反应）。"},{"en":"A decomposition step like A → products has molecularity 1 (unimolecular).","zh":"像 A → 生成物 这样的分解基元步骤分子数为 1（单分子反应）。"}]}],"synonyms":["(in kinetics) unimolecularity","bimolecularity","termolecularity"],"phonetic":"/məˌlɛkjəˈlærɪti/","extraExplanation":["molecularity（分子数）只用于“基元反应（elementary step）”，表示该一步里真正同时参与的粒子数；常见只有 1（单分子）、2（双分子），3（三分子）很少见，因为三体同时有效碰撞的概率很低。","不要把 molecularity 和 reaction order（反应级数）混为一谈：反应级数来自速率方程与实验数据；只有当反应是单一步的基元反应时，分子数才可能与反应级数相同。"]}
{"word":"molecularly","summary":{"en":"“Molecularly” means “at the level of molecules; in terms of molecular structure or processes.”","zh":"“molecularly”表示“在分子层面；就分子结构或分子过程而言”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to molecules (the smallest units of a chemical substance).","zh":"以分子层面地；与分子有关地（从化学物质的最小单位角度）。"},"examples":[{"en":"The two drugs are similar molecularly, but they affect the body differently.","zh":"这两种药物在分子层面很相似，但对人体的作用不同。"},{"en":"Scientists studied the disease molecularly to understand how it begins.","zh":"科学家从分子层面研究这种疾病，以了解它如何开始。"}]}],"synonyms":["at the molecular level","on a molecular level","chemically (context-dependent)"],"phonetic":"/məˈlɛkjələrli/","extraExplanation":["常见搭配：molecularly similar（分子层面相似）、molecularly distinct（分子层面不同）、analyze/study something molecularly（从分子层面分析/研究）。","多用于科学写作或科普语境，强调“在分子这个层级上”，常与biologically（生物学上）、genetically（遗传上）、chemically（化学上）并列对比。"]}
{"word":"molecule","summary":{"en":"A molecule is a group of atoms bonded together; it can also mean “a tiny amount,” especially in phrases like “not a molecule of truth.”","zh":"molecule 指由原子结合而成的“分子”；也可引申为“极少量”，常见于“not a molecule of …（一点也没有）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The smallest unit of a substance (or compound) that still has the chemical properties of that substance; it is made of two or more atoms bonded together.","zh":"分子：由两个或更多原子通过化学键结合而成的最小单位，仍然保持该物质（或化合物）的化学性质。"},"examples":[{"en":"A water molecule has two hydrogen atoms and one oxygen atom.","zh":"一个水分子由两个氢原子和一个氧原子组成。"},{"en":"Heating the liquid makes the molecules move faster.","zh":"加热液体会让分子运动得更快。"},{"en":"Oxygen in the air usually exists as O₂ molecules.","zh":"空气中的氧通常以 O₂ 分子的形式存在。"}]},{"partOfSpeech":"n.","definition":{"en":"A very small amount or part of something (often used for emphasis, usually in negative statements).","zh":"（引申）一点点、丝毫（常用于强调，尤其是否定句中）。"},"examples":[{"en":"There isn’t a molecule of truth in that rumor.","zh":"那个谣言没有一丝真实性。"},{"en":"He didn’t show a molecule of doubt.","zh":"他没有表现出丝毫怀疑。"}]}],"synonyms":["particle (general)","compound (in some contexts)","tiny amount (figurative)"],"phonetic":"/ˈmɑːlɪkjuːl/","extraExplanation":["“molecule”在科学语境里常与“atom（原子）”一起出现：原子是基本单位之一；分子通常由多个原子组成，比如 H₂O、CO₂。注意：像氦（He）这类惰性气体常以单个原子存在，不一定形成分子。","日常英语里用“not a molecule of …”属于夸张说法，表达“完全没有、一点也不”，语气比“not a bit”更书面、更强调。"]}
{"word":"molecules","summary":{"en":"“Molecules” is the plural of “molecule,” meaning groups of atoms bonded together—the basic units of many substances.","zh":"“molecules”是“molecule”的复数，指由原子通过化学键结合而成的分子，是许多物质的基本单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A molecule: a group of two or more atoms chemically bonded together; the smallest unit of a substance that still has that substance’s chemical properties.","zh":"分子：由两个或多个原子通过化学键结合而成；仍能保持该物质化学性质的最小单位。"},"examples":[{"en":"Water molecules are made of two hydrogen atoms and one oxygen atom (H₂O).","zh":"水分子由两个氢原子和一个氧原子组成（H₂O）。"},{"en":"Perfume spreads because its molecules move through the air.","zh":"香水会扩散，是因为它的分子在空气中运动。"},{"en":"DNA is a very large molecule that carries genetic information.","zh":"DNA 是一种非常大的分子，携带遗传信息。"}]},{"partOfSpeech":"n.","definition":{"en":"Molecules (in biology/chemistry): specific chemical substances in living things or reactions (for example, sugar molecules, protein molecules).","zh":"（生物/化学语境）分子类物质：指生物体或反应中的特定化学物质（如糖分子、蛋白质分子）。"},"examples":[{"en":"Your body breaks food down into smaller molecules for energy.","zh":"你的身体把食物分解成更小的分子来获得能量。"},{"en":"Scientists study signaling molecules that help cells communicate.","zh":"科学家研究帮助细胞交流的信号分子。"}]}],"synonyms":["chemical compounds","particles"],"phonetic":"/ˈmɑləkjʊlz/","extraExplanation":["“Molecules”是“molecule”的复数形式。日常英文里常见搭配：molecule of water（二氧化氢/水分子）、molecular level（分子层面）、molecular biology（分子生物学）。","区分：atom（原子）是更小的单位；molecule（分子）由原子组成。并非所有物质都以“分子”形式存在，例如食盐在固体中常描述为离子晶格（ions）。"]}
{"word":"molehead","summary":{"en":"Molehead usually means a mound of soil made by a mole; in engineering, it can mean the cutting head of a tunneling “mole.”","zh":"molehead通常指鼹鼠挖洞拱出的土堆；在工程领域也可指地下穿孔/顶管设备的切削头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small mound of earth pushed up by a mole while digging underground","zh":"鼹鼠在地下挖洞时拱起地面形成的小土堆（鼹鼠土堆）"},"examples":[{"en":"The lawn was covered with moleheads after the rain.","zh":"下雨后，草坪上到处都是鼹鼠拱出的土堆。"},{"en":"He leveled the moleheads with a rake.","zh":"他用耙子把鼹鼠土堆耙平。"}]},{"partOfSpeech":"n.","definition":{"en":"the front part (cutting end) of a tunneling device sometimes called a “mole,” used for making underground holes for pipes or cables","zh":"（有时称为“mole”的）顶管/地下穿孔装置的前端切削部分，用来打地下孔铺设管线或电缆"},"examples":[{"en":"The crew replaced the worn molehead before starting the next bore.","zh":"施工队在开始下一段钻进前更换了磨损的切削头。"},{"en":"A heavier molehead can help in hard soil.","zh":"在硬土中，更重的切削头可能更有帮助。"}]}],"synonyms":["molehill","mound","tunneling head","boring head"],"phonetic":"/ˈmoʊlˌhɛd/","extraExplanation":["“molehead”在日常英语里不算常用；谈草坪害兽时更常见的是“molehill”（鼹鼠土堆）。如果你是在园艺/草坪管理语境看到它，通常指鼹鼠拱出的土堆。","工程语境里的“molehead”偏专业，多见于地下顶管、穿越施工等领域，指设备的切削/钻进前端。"]}
{"word":"moleheap","summary":{"en":"A moleheap is a small pile of soil made by a mole digging underground.","zh":"moleheap 指鼹鼠挖洞时拱到地面上的小土堆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pile of loose soil pushed up from underground by a mole (often called a “molehill”).","zh":"鼹鼠在地下挖洞时拱出地面的土堆（也常叫 molehill）。"},"examples":[{"en":"The lawn was dotted with moleheaps after the rainy night.","zh":"下过雨的夜晚后，草坪上布满了一个个鼹鼠土堆。"},{"en":"Be careful where you step—those moleheaps can hide soft ground.","zh":"走路小心点——鼹鼠土堆下面的地面可能很松。"}]}],"synonyms":["molehill","mound","small mound of earth"],"phonetic":"/ˈmoʊlˌhip/","extraExplanation":["“moleheap”由 mole（鼹鼠）+ heap（土堆）组成，语感比较直白、偏英式用法；在日常英语里更常见的说法是 “molehill”。","相关文化用法：英语里有习语 “make a mountain out of a molehill”（把小事夸大， 小题大做）。虽然这里用的是 molehill，但理解 moleheap 也能帮助你理解这个习语的画面感。"]}
{"word":"molehill","summary":{"en":"A molehill is a small mound of dirt made by a mole, and it can also mean a minor issue that someone exaggerates.","zh":"molehill 指鼹鼠拱出的土堆；也可比喻“小事/小问题”，尤指被夸大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, low mound of earth made by a mole digging underground.","zh":"鼹鼠掘洞时拱出的土堆；鼹鼠丘。"},"examples":[{"en":"There were several molehills scattered across the lawn.","zh":"草坪上零散地有好几个鼹鼠土堆。"},{"en":"The gardener flattened the molehill and repaired the grass.","zh":"园丁把土堆压平并修补了草皮。"}]},{"partOfSpeech":"n.","definition":{"en":"Something minor or unimportant (often used in the phrase “make a mountain out of a molehill”).","zh":"小事；不重要的问题（常见于短语“make a mountain out of a molehill”中）。"},"examples":[{"en":"It was just a small mistake—don’t turn a molehill into a mountain.","zh":"只是个小错误——别小题大做。"},{"en":"They argued for hours over a molehill of a problem.","zh":"他们为了一个小问题争论了好几个小时。"}]}],"synonyms":["mound","hillock","small problem","trifle"],"phonetic":"/ˈmoʊlˌhɪl/","extraExplanation":["“molehill”既是字面意思的“鼹鼠土堆”，也常用来比喻“很小的事”。最常见的相关表达是：make a mountain out of a molehill（把小事夸大成大事），也可以说 turn a molehill into a mountain。"]}
{"word":"molehillish","summary":{"en":"Molehillish means “like a molehill”: small, low, mound-like, or minor.","zh":"molehillish 表示“像鼹鼠土堆一样”：小、小土堆状，或指事情很小、不重要。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a molehill; small, low, or mound-like (often suggesting something is minor or not very important).","zh":"像鼹鼠土堆的；小小的、低矮的、土堆状的（常暗示事情很小、不重要）。"},"examples":[{"en":"The trail rises over a few molehillish bumps before reaching the lake.","zh":"小路先越过几个像小土堆一样的隆起，然后才到湖边。"},{"en":"It was a molehillish problem, but he treated it like a disaster.","zh":"那只是个很小的问题，但他却把它当成了灾难。"}]}],"synonyms":["small","minor","trivial","insignificant","mound-like","hummocky"],"phonetic":"/ˈmoʊlˌhɪlɪʃ/","extraExplanation":["“molehillish”由“molehill（鼹鼠土堆）+ -ish（有点像……的）”构成，属于较少见、偏口语/创意写法的形容词。","它常让人联想到习语“make a mountain out of a molehill”（小题大做）：用“molehillish”形容某事很小，强调不值得夸大。"]}
{"word":"molehills","summary":{"en":"Molehills are small piles of earth made by moles; figuratively, they can mean a tiny problem.","zh":"molehills 指鼹鼠拱起的小土堆；也可比喻不重要的小问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small mound (little hill) of soil pushed up by a mole (a small burrowing animal).","zh":"鼹鼠丘；鼹鼠拱起的小土堆。"},"examples":[{"en":"The lawn was covered with molehills after the rain.","zh":"下雨后，草坪上到处都是鼹鼠丘。"},{"en":"We carefully flattened the molehills to make the yard smooth again.","zh":"我们小心把鼹鼠丘压平，让院子重新平整。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A very small problem or issue that is not as serious as it seems.","zh":"（比喻）小问题；不值得大惊小怪的事情。"},"examples":[{"en":"It’s just a molehill—don’t treat it like a disaster.","zh":"这只是个小问题——别把它当成灾难。"},{"en":"They argued for hours over a molehill.","zh":"他们为了一点小事争论了好几个小时。"}]}],"synonyms":["small mound","little hill","trifle","minor issue"],"phonetic":"/ˈmoʊlˌhɪl/","extraExplanation":["“molehill”常出现在习语 **make a mountain out of a molehill** 中，意思是“把小题大做；小事夸大”。常用来劝人冷静、别过度反应。"]}
{"word":"molehilly","summary":{"en":"“Molehilly” means uneven or bumpy like ground covered with many molehills.","zh":"“molehilly”指像布满鼹鼠土堆一样起伏不平、坑坑洼洼的（少见用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of small hills or bumps like molehills; lumpy or uneven (rare).","zh":"像鼹鼠土堆一样到处都是小土丘的；坑坑洼洼、不平坦的（较少见）。"},"examples":[{"en":"The field was molehilly after weeks of digging animals.","zh":"几周以来动物到处打洞，田地变得坑坑洼洼。"},{"en":"We walked carefully over the molehilly grass.","zh":"我们小心翼翼地走过那片起伏不平的草地。"}]}],"synonyms":["bumpy","uneven","lumpy","hummocky","moundy"],"phonetic":"/ˈmoʊlˌhɪli/","extraExplanation":["“molehilly”不是很常见，更常用的表达是：a molehill-strewn lawn（布满鼹鼠土堆的草坪）或 bumpy/uneven ground（凹凸不平的地面）。","它来自名词 molehill（鼹鼠土堆）+ 形容词后缀 -y，表示“多……的/有……特征的”。","注意别和习语 “make a mountain out of a molehill”（小题大做）混淆；后者是比喻用法，不是形容地面真的不平。"]}
{"word":"moleism","summary":{"en":"“Moleism” is not a standard English word; it may be an informal/incorrect coinage related to the chemistry unit “mole.”","zh":"“moleism”不是标准英语词；可能是与化学单位“摩尔”相关的非正式或误用的臆造词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare / nonstandard) A coined term that could mean a way of thinking, measuring, or speaking based on the chemical unit “mole.” In real chemistry English, people usually say “mole concept,” “amount of substance,” or “molarity,” not “moleism.”","zh":"（非常少见/非标准用法）一种臆造词，可能指“以化学单位 mole（摩尔）为基础的思维、计量或表述方式”。但在真实的化学英语里一般不用 moleism，更常说 “mole concept（摩尔概念）”“amount of substance（物质的量）”或 “molarity（摩尔浓度）”。"},"examples":[{"en":"Our teacher explained the mole concept (not “moleism”) to help us convert grams to moles.","zh":"老师讲解了摩尔概念（而不是“moleism”）来帮助我们把克转换成摩尔。"},{"en":"If you meant concentration in moles per liter, the correct word is “molarity.”","zh":"如果你指的是“每升多少摩尔”的浓度，正确的词是 molarity（摩尔浓度）。"}]}],"synonyms":["(none in standard usage)"],"phonetic":"/ˈmoʊlɪzəm/","extraExplanation":["“moleism”在常见词典与学术写作中几乎不出现；更像是把 “mole（摩尔）+ -ism（……主义/……风格）” 临时组合出来的说法。","如果你是在听课或读化学资料时看到/听到这个词，最可能的目标词包括：molarity（摩尔浓度）、mole concept（摩尔概念）、molality（质量摩尔浓度）、molar（摩尔的/摩尔浓度的）。","也有可能是拼写或听辨误差：moralism（道德主义）与 /ˈmɔrəlɪzəm/ 的发音与拼写更常见。你可以提供一句原句，我能帮你精确判断。"]}
{"word":"molelike","summary":{"en":"“Molelike” means resembling a mole, especially by digging or staying hidden.","zh":"“molelike”意为“像鼹鼠的”，常指爱挖掘、在地下活动或行事隐秘。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a mole (the small burrowing animal), especially in appearance or behavior; often suggesting digging, living underground, or avoiding light.","zh":"像鼹鼠的；（外貌或行为）具有鼹鼠特征的，常含“挖掘、住在地下、避光”的意思。"},"examples":[{"en":"The old garden had molelike tunnels under the lawn.","zh":"老花园的草坪下面有像鼹鼠打出来的地道。"},{"en":"He worked in a molelike way, staying hidden and focusing on one task at a time.","zh":"他做事很“鼹鼠式”：保持低调专注，一次只做一件事。"}]}],"synonyms":["mole-like","burrowing","subterranean","secretive","reclusive"],"phonetic":"/ˈmoʊlˌlaɪk/","extraExplanation":["“molelike”通常带一点形象化的语气：要么是字面上“像鼹鼠一样打洞/地下活动”，要么是比喻“隐秘、躲在暗处做事”。注意不要与同形的“mole（痣）”混淆；这里一般指动物“鼹鼠”。"]}
{"word":"molendinar","summary":{"en":"A rare adjective meaning “related to a mill or milling.”","zh":"一个非常少见的形容词，意为“与磨坊或碾磨有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a mill (especially a grain mill); connected with milling.","zh":"与磨坊（尤指碾谷磨坊）有关的；与碾磨作业相关的。"},"examples":[{"en":"The historian found a molendinar record describing who could use the village mill.","zh":"历史学者找到一份与磨坊相关的记录，描述谁可以使用村里的磨坊。"},{"en":"Molendinar rights were sometimes listed separately from other land rights.","zh":"与磨坊相关的权利有时会与其他土地权利分开列出。"}]}],"synonyms":["mill-related","milling","molendinary"],"phonetic":"/məˈlɛn.dɪ.nɚ/","extraExplanation":["这个词在现代英语中非常罕见，多见于历史、法律或地名研究语境，用来描述“与磨坊/碾磨有关的”事物（如税赋、权利、契约、记录）。","词源上通常与拉丁语 molendinum（磨坊）有关；现代更常见的对应词是 molendinary（同义但也偏罕见），日常表达更常用 mill / milling 相关说法。"]}
{"word":"molendinary","summary":{"en":"Molendinary means “related to a mill” (rarely, “a miller”).","zh":"molendinary 指“与磨坊有关的”（少见时也可指“磨坊工/磨坊主”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Related to a mill, especially a grain mill; used for milling or connected with millers.","zh":"（形容词）与磨坊（尤其是谷物磨坊）有关的；用于碾磨的；与磨坊行业/磨坊工人有关的。"},"examples":[{"en":"The museum displays molendinary tools once used to grind wheat into flour.","zh":"博物馆展出了过去用来把小麦磨成面粉的磨坊用具。"},{"en":"Records of molendinary work help historians understand local food production.","zh":"关于磨坊工作的记录能帮助历史学家了解当地的粮食生产。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A miller; a person who operates a mill (rare).","zh":"（名词）磨坊主；磨坊操作工（较罕见）。"},"examples":[{"en":"In older writing, a molendinary might be mentioned alongside bakers and farmers.","zh":"在较早的文字中，可能会把磨坊工与面包师、农民并列提到。"}]}],"synonyms":["milling","mill-related","miller (for the noun sense)"],"phonetic":"/məˈlɛn.dəˌnɛr.i/","extraExplanation":["这个词非常少见，多用于历史、文学或学术语境。词根来自拉丁语 *molendinum*（磨坊）与 *mola*（磨石、磨盘）。日常英语里更常用的是 **mill**（磨坊）、**miller**（磨坊主/磨坊工）以及 **milling**（碾磨；磨粉）。"]}
{"word":"molengraaffite","summary":{"en":"Molengraaffite is a rare uranium-bearing oxide mineral name used mainly in geology/mineralogy.","zh":"Molengraaffite 指一种罕见的含铀氧化物矿物名称，主要用于地质/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a type of uranium-containing oxide mineral) found in some uranium deposits.","zh":"一种罕见矿物（含铀的氧化物类矿物），可见于部分铀矿床中。"},"examples":[{"en":"Molengraaffite is a rare mineral that may occur in uranium-rich veins.","zh":"Molengraaffite 是一种罕见矿物，可能出现在富铀矿脉中。"},{"en":"The report lists molengraaffite among the minor uranium minerals identified under the microscope.","zh":"报告把 molengraaffite 列为在显微镜下鉴定出的次要含铀矿物之一。"}]}],"phonetic":"/ˌmoʊlənˈɡrɑːfaɪt/","extraExplanation":["这是一个矿物学专名，日常英语中几乎不会用到，主要出现在地质学、矿物学和矿床学的论文或矿物目录里。","该名称通常来源于人名（常见做法是用学者/探险家/地质学家的姓氏命名矿物）；不同资料对其化学组成与分类细节的表述可能略有差异，建议以权威矿物数据库或最新文献为准。"]}
{"word":"moleproof","summary":{"en":"Moleproof means made to prevent moles from entering or causing damage, especially in gardens or lawns.","zh":"moleproof 指“防鼹鼠的”，多用于园艺/草坪，表示能阻止鼹鼠进入或破坏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed or made so that moles (small burrowing animals) cannot get in, dig through, or damage it; resistant to moles","zh":"（设计或制作成）防鼹鼠的；不易被鼹鼠钻入、挖穿或破坏的"},"examples":[{"en":"We installed a moleproof barrier under the lawn to stop new tunnels.","zh":"我们在草坪下面装了防鼹鼠隔离层，防止出现新的地道。"},{"en":"Use moleproof wire mesh around young trees to protect the roots.","zh":"在幼树周围用防鼹鼠的金属网保护树根。"}]}],"synonyms":["mole-resistant","mole-repellent","mole-tight"],"phonetic":"/ˈmoʊlˌpruːf/","extraExplanation":["“moleproof”常见写法也包括带连字符的“mole-proof”。在园艺语境里通常指用金属网（wire mesh）、地下隔离板（barrier）等材料来阻止鼹鼠从地下打洞进入。注意这里的mole是“鼹鼠”，不是“痣”或“间谍”。"]}
{"word":"moler","summary":{"en":"“Moler” is not a common English word; it most often appears as the Spanish verb meaning “to grind,” or as a name.","zh":"“moler”不是常见英语词；多见于引用西班牙语时表示“研磨/磨碎”，或作为人名/姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare in English) A word you may see in Spanish meaning “to grind” (as a verb). In English writing, it usually appears only when people are quoting Spanish or mixing languages.","zh":"（英语中很少用）你可能会在西班牙语里见到的词，意思是“研磨/磨碎”（动词）。在英语里通常只在引用西语或中英西混用时出现。"},"examples":[{"en":"In the recipe, the Spanish verb “moler” means “to grind” the spices.","zh":"在食谱里，西班牙语动词“moler”意思是把香料“研磨”。"},{"en":"The instructor wrote: “moler el café,” meaning “grind the coffee.”","zh":"老师写了：“moler el café”，意思是“把咖啡磨碎/研磨咖啡豆”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Name) A surname or username; not a standard English vocabulary word.","zh":"（姓名/网名）可作为姓氏或用户名；不是标准英语词汇。"},"examples":[{"en":"Dr. Moler will present the results tomorrow.","zh":"Moler 医生将于明天展示结果。"}]}],"synonyms":["grind (when used as Spanish meaning)"],"phonetic":"/ˈmoʊlər/","extraExplanation":["在标准英语里更常见的可能是你想查的拼写：\n1) molar /ˈmoʊlər/（臼齿；磨牙；也可作形容词“臼齿的”）；\n2) molder/moulder /ˈmoʊldər/（腐朽；发霉；逐渐瓦解）。\n如果你告诉我你想表达的中文意思或句子语境，我可以帮你确定最合适的词。"]}
{"word":"moles","summary":{"en":"“Moles” can mean skin spots, burrowing animals, hidden spies, or the chemistry unit (plural).","zh":"“moles”可指皮肤的痣、鼹鼠、潜伏的内鬼/间谍，或化学单位“摩尔”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small dark spots on the skin (plural of “mole”), usually harmless.","zh":"（皮肤上的）痣、黑痣（“mole”的复数），通常无害。"},"examples":[{"en":"She has a small mole on her cheek.","zh":"她脸颊上有一颗小痣。"},{"en":"If your moles change in size or color, see a doctor.","zh":"如果你的痣在大小或颜色上发生变化，去看医生。"}]},{"partOfSpeech":"n.","definition":{"en":"Small burrowing mammals (plural of “mole”) that live underground.","zh":"（动物）鼹鼠（“mole”的复数），生活在地下、善于挖洞。"},"examples":[{"en":"Moles can leave little piles of soil in the yard.","zh":"鼹鼠会在院子里留下小土堆。"},{"en":"The garden was damaged by moles digging tunnels.","zh":"花园被鼹鼠打洞挖通道弄坏了。"}]},{"partOfSpeech":"n.","definition":{"en":"Secret agents inside an organization (plural of “mole” meaning a spy).","zh":"（间谍）内鬼、潜伏者（“mole”的复数，指潜伏在组织内部的人）。"},"examples":[{"en":"The police believed there were moles leaking information.","zh":"警方认为有内鬼在泄露信息。"},{"en":"The journalist’s sources warned about moles in the office.","zh":"记者的消息源警告说办公室里有潜伏者。"}]},{"partOfSpeech":"n.","definition":{"en":"A unit for amount of substance in chemistry (plural of “mole,” symbol: mol).","zh":"（化学）摩尔，表示物质的量的单位（“mole”的复数，符号 mol）。"},"examples":[{"en":"Water is about 55.5 moles per liter.","zh":"水大约是每升 55.5 摩尔。"},{"en":"We calculated the moles of salt needed for the solution.","zh":"我们计算了配制溶液所需的盐的摩尔数。"}]}],"synonyms":["beauty marks (skin, informal)","nevi (medical, skin)","spies","informants","agents","mol (chemistry abbreviation)"],"phonetic":"/moʊlz/","extraExplanation":["“mole”是一个多义词：日常生活里最常见的是“痣”和“鼹鼠”；在新闻/职场语境中，“a mole”常指“内鬼/潜伏的间谍”；在理科语境里，“mole”是化学单位“摩尔”。判断含义主要看上下文（皮肤/花园/组织泄密/化学计算）。"]}
{"word":"moleskin","summary":{"en":"Moleskin is usually either a tough, suede-like cotton fabric or a small pocket notebook (often Moleskine®).","zh":"moleskin 通常指一种耐磨、绒面感的棉布，或指随身口袋笔记本（常与 Moleskine® 品牌相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, soft cotton fabric with a smooth, suede-like surface, often used for work clothes","zh":"一种结实柔软的棉织物，表面光滑、像麂皮（绒面）一样，常用于工作服等耐磨衣物"},"examples":[{"en":"He wore moleskin trousers for hiking because they’re tough and warm.","zh":"他徒步时穿灯芯绒般的 moleskin 裤子，因为耐磨又保暖。"},{"en":"The jacket is made of moleskin fabric, so it feels soft but lasts a long time.","zh":"这件夹克是 moleskin 面料做的，所以摸起来柔软，但很耐穿。"}]},{"partOfSpeech":"n.","definition":{"en":"a pocket notebook (often referring to the Moleskine® brand or similar notebooks)","zh":"随身口袋笔记本（常指 Moleskine® 品牌或类似款式的笔记本）"},"examples":[{"en":"She keeps a moleskin in her bag to write down new words.","zh":"她包里常带一本 moleskin，用来记新单词。"},{"en":"I filled a moleskin with travel notes and sketches.","zh":"我用一本 moleskin 写满了旅行笔记和速写。"}]}],"synonyms":["cotton twill (fabric context)","suede-like fabric","pocket notebook","notebook","journal"],"phonetic":"/ˈmoʊlˌskɪn/","extraExplanation":["“moleskin”原意是“鼹鼠皮”，但现代英语里通常不是指真的鼹鼠皮，而是指一种棉质绒面布料，因触感像动物皮毛而得名。","表示“笔记本”时，多与意大利品牌 Moleskine 相关；日常口语中也有人用它泛指这种风格的随身本。"]}
{"word":"moleskins","summary":{"en":"Moleskins are (1) thick, smooth cotton fabric, or (2) trousers made from that fabric (especially in British English).","zh":"moleskins 可指（1）鼹鼠皮布（厚实光滑的棉布），也可指（2）用这种布做的裤子（英式英语较常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick, soft cotton fabric with a smooth surface, used especially for sturdy clothing","zh":"鼹鼠皮布（厚实柔软、表面光滑的棉布，常用于耐穿衣物）"},"examples":[{"en":"He wore a jacket made of moleskin to stay warm and comfortable.","zh":"他穿了一件鼹鼠皮布做的夹克，又保暖又舒服。"},{"en":"Moleskin is often used for work pants because it’s tough and long-lasting.","zh":"鼹鼠皮布常用来做工装裤，因为它结实耐穿。"}]},{"partOfSpeech":"n.","definition":{"en":"pants/trousers made from moleskin fabric (common in British English)","zh":"鼹鼠皮裤（用鼹鼠皮布做的裤子；英式英语中较常见）"},"examples":[{"en":"In the countryside, he often wore moleskins and heavy boots.","zh":"在乡下，他经常穿鼹鼠皮裤和厚靴子。"},{"en":"She bought a pair of moleskins for hiking in cool weather.","zh":"她买了一条鼹鼠皮裤，准备在凉爽天气里徒步时穿。"}]}],"synonyms":["moleskin fabric","heavy cotton","workwear trousers"],"phonetic":"/ˈmoʊlˌskɪn/","extraExplanation":["“moleskin”字面意思是“鼹鼠皮”，但现代用法通常指一种棉质织物，不是真的动物皮。它的表面经过处理，摸起来像绒面一样细腻，因此得名。","注意拼写差异：法国笔记本品牌常写作“Moleskine”（末尾多一个e），发音相近但不是同一个词形。"]}
{"word":"molest","summary":{"en":"Molest can mean to harass or bother someone, but in modern English it very often refers to sexual assault (especially of a child). Use with care.","zh":"Molest 可指“骚扰/烦扰”，但现代英语中更常指“性侵/猥亵（尤其儿童）”，使用时要格外谨慎。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to harm, bother, or annoy someone (often by repeatedly bothering them)","zh":"骚扰、烦扰某人（常指反复打扰、纠缠）"},"examples":[{"en":"The dog was molested by a group of boys throwing stones.","zh":"那只狗被一群男孩扔石头骚扰/欺负。"},{"en":"Tourists were molested by aggressive vendors near the station.","zh":"车站附近咄咄逼人的小贩不断骚扰游客。"}]},{"partOfSpeech":"vt.","definition":{"en":"to sexually assault or abuse someone (especially a child)","zh":"对他人实施性侵害/性虐待（尤指儿童）"},"examples":[{"en":"He was arrested for molesting a child.","zh":"他因猥亵/性侵儿童而被逮捕。"},{"en":"The school has strict policies to prevent children from being molested.","zh":"学校有严格政策来防止儿童遭到性侵害。"}]}],"synonyms":["harass","bother","pester","abuse","sexually assault"],"phonetic":"/məˈlɛst/","extraExplanation":["在现代英语里，molest 最常让人联想到“性侵/猥亵”，尤其在新闻、法律语境中（如 child molester）。因此在日常表达“打扰/骚扰”时，很多母语者会避免用 molest，以免造成误会。","如果你想表达“烦扰、打扰”，更安全常用的词是 bother、harass、pester；表达“性侵/猥亵”则常用 sexually assault、abuse、molest（法律/新闻语感更强）。"]}
{"word":"molestation","summary":{"en":"“Molestation” most commonly means serious sexual abuse (often in legal contexts, frequently involving a child). In older or less common usage, it can mean harassment or disturbance.","zh":"“molestation”最常指严重的性侵害/猥亵（常见于法律语境，常涉及儿童）。较旧或较少见的用法可指“骚扰/打扰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sexual abuse, especially unwanted sexual touching or assault (often used in legal contexts, frequently involving a child)","zh":"性侵害；猥亵（尤指不受欢迎的性触摸或性侵犯；常见于法律语境，常涉及儿童）"},"examples":[{"en":"The school reported the allegation of molestation to the police.","zh":"学校将“猥亵”的指控上报给了警方。"},{"en":"He was arrested on suspicion of child molestation.","zh":"他因涉嫌猥亵儿童而被逮捕。"},{"en":"The case involved repeated molestation over several months.","zh":"该案件涉及数月内反复发生的猥亵行为。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the act of bothering, harassing, or disturbing someone","zh":"（较少见）骚扰；打扰"},"examples":[{"en":"In the novel, the travelers complained of constant molestation by thieves.","zh":"在小说中，旅人抱怨不断被盗贼骚扰。"},{"en":"The old law prohibited the molestation of merchants on the road.","zh":"旧法律禁止在路上骚扰商人。"}]}],"synonyms":["sexual abuse","sexual assault","child abuse","indecent assault","harassment","disturbance"],"phonetic":"/ˌmoʊlɛˈsteɪʃən/","extraExplanation":["“molestation”在现代英语里最常指性侵害/猥亵，语气非常严重，很多时候与儿童相关；在正式报道、法律文件中常见。日常表达如果要更具体、清晰，可能会用“sexual assault（性侵）”“sexual abuse（性虐待/性侵害）”“inappropriate touching（不当触摸）”“harassment（骚扰）”等，但需根据事实与语境谨慎选择。","较旧或文学性的“molestation”可表示“打扰/骚扰”，但在当代语境中容易被理解为性犯罪含义，因此除非语境非常明确，一般不建议用来表示普通的“打扰”。"]}
{"word":"molestations","summary":{"en":"“Molestations” means acts of unwanted or abusive touching/harassment, often sexual in nature, especially used in legal or news contexts.","zh":"“molestations”指不当或不受欢迎的触碰/骚扰/侵害行为，常带性侵或猥亵含义，多见于法律或新闻语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Unwanted or improper touching, harassment, or interference with someone—often referring to sexual abuse or assault, especially in legal or news contexts.","zh":"对他人的不当或不受欢迎的触碰、骚扰或侵害——常指性侵害/性骚扰，尤其用于法律或新闻语境。"},"examples":[{"en":"The report included several allegations of molestations involving minors.","zh":"报告中包含了数起涉及未成年人的猥亵/性侵指控。"},{"en":"She spoke about workplace molestations and the need for safer reporting systems.","zh":"她谈到职场性骚扰/侵害，以及建立更安全的举报机制的必要性。"},{"en":"The case focused on repeated molestations over many years.","zh":"该案件聚焦于多年反复发生的侵害行为。"}]}],"synonyms":["sexual abuse","sexual assault","harassment","groping","indecent assault"],"phonetic":"/ˌmoʊləˈsteɪʃənz/","extraExplanation":["“molestation(s)”在当代英语里高度敏感、语义偏重，常与“性侵、猥亵、性骚扰”相关；日常口语中人们更常用“sexual assault / sexual abuse / harassment / groping”等更明确的词。","法律与新闻语境里，“molestation(s)”可能是指控或罪名描述的一部分，但具体含义会因地区法律不同而变化；翻译成中文时常根据上下文选择“猥亵”“性侵”“性骚扰”“侵害”等更贴切的词。","如果只是一般意义的“打扰/干扰”，现代英语较少用“molestation”；更自然的表达是“harassment, disturbance, interference”。"]}
{"word":"molested","summary":{"en":"“Molested” most commonly means “sexually abused/assaulted”; less commonly, it can mean “harassed or bothered.”","zh":"“molested”最常见指“遭到性侵/性虐待”；较少情况下可指“被骚扰/纠缠/打扰”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “molest”) to touch or attack someone in a sexual way without their consent; to sexually abuse.","zh":"（动词“molest”的过去式/过去分词）在未经同意的情况下对他人进行带有性目的的触碰或侵犯；性侵/性骚扰/性虐待。"},"examples":[{"en":"The child said they had been molested by a neighbor.","zh":"那个孩子说自己曾被一位邻居性侵。"},{"en":"The investigation began after several students reported being molested.","zh":"在几名学生举报遭到性侵后，调查随即展开。"}]},{"partOfSpeech":"v.","definition":{"en":"(More general) to bother, harass, or disturb someone, sometimes repeatedly.","zh":"（较一般）骚扰、纠缠或打扰某人（有时指反复发生）。"},"examples":[{"en":"He was molested by aggressive reporters outside the courthouse.","zh":"他在法院外被咄咄逼人的记者纠缠骚扰。"},{"en":"Tourists complained that they were molested by street vendors.","zh":"游客抱怨自己被街头商贩纠缠。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective use) having been sexually abused or attacked.","zh":"（形容词用法）遭受过性侵/性虐待的。"},"examples":[{"en":"The report focused on support services for molested children.","zh":"报告聚焦于为遭受性侵的儿童提供的支持服务。"}]}],"synonyms":["sexually abused","sexually assaulted","abused","harassed","bothered","pestered"],"phonetic":"/məˈlɛstɪd/","extraExplanation":["“molested”在现代英语里最常见、最强烈的含义与性侵害相关，语气非常严肃，日常场合尽量避免用它来表示普通的“打扰”。如果只是“烦扰/纠缠”，更中性的替代词有：bothered, harassed, pestered。","在新闻、法律或心理健康语境中，molest/molested 常用于描述犯罪或严重伤害；如需更明确区分，“sexually abused/assaulted”也很常见。"]}
{"word":"molester","summary":{"en":"“Molester” usually means a person who sexually abuses or assaults someone; the non-sexual sense (“harasser”) is rare today.","zh":"“Molester”通常指性侵/猥亵他人的人；表示“普通骚扰者”的用法如今较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who sexually assaults or abuses someone, especially a child","zh":"性侵者；猥亵者（对他人实施性侵或性骚扰的人，尤指对儿童）"},"examples":[{"en":"The police arrested a suspected child molester.","zh":"警方逮捕了一名疑似猥亵儿童的嫌疑人。"},{"en":"The school has strict rules to protect students from sexual predators and molesters.","zh":"学校有严格规定来保护学生免受性掠夺者和猥亵者的侵害。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person who harasses, attacks, or bothers others","zh":"（较少见）骚扰者；滋扰者（骚扰、攻击或不断打扰他人的人）"},"examples":[{"en":"In older writing, “molester” can mean someone who repeatedly harasses another person.","zh":"在较旧的写法中，“molester”也可指反复骚扰他人的人。"}]}],"synonyms":["sex offender","sexual abuser","predator","child abuser","harasser (rare sense)"],"phonetic":"/məˈlɛstər/","extraExplanation":["“molester”在现代英语中几乎总是与性侵/猥亵相关，语气非常严重且带有强烈负面含义。日常表达中，若只是“一般骚扰/纠缠”，更常用 harasser / bully / stalker / nuisance 等词。","在新闻与法律语境里常见搭配有 suspected/alleged molester（疑似/被指控的猥亵者）。alleged 表示“被指控但尚未定罪”，用于避免直接认定事实。"]}
{"word":"molesters","summary":{"en":"“Molesters” means people who sexually abuse or harass others without consent (plural of “molester”).","zh":"“Molesters”指性侵/猥亵/性骚扰他人的施害者，是“molester”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “molester”: a person who sexually attacks, touches, or harasses someone (often a child) without consent.","zh":"“molester”的复数：指对他人（常指儿童）进行性侵、猥亵或性骚扰的施害者。"},"examples":[{"en":"The school reported the suspected molesters to the police.","zh":"学校把疑似的猥亵/性侵施害者举报给了警方。"},{"en":"News reports sometimes use the term “child molesters” for people accused or convicted of abusing children.","zh":"新闻报道有时用“child molesters（儿童性侵施害者）”来指被指控或已定罪的虐待儿童者。"}]}],"synonyms":["sexual abusers","sexual predators","child abusers"],"phonetic":"/məˈlɛstɚz/","extraExplanation":["这个词语义非常严肃，日常对话中使用要谨慎：在英语里它通常特指“性方面的侵害/猥亵”，并带有强烈的负面与犯罪含义。","法律与新闻语境中常见搭配：suspected/alleged molester（疑似/被指控的施害者）、convicted molester（已定罪的施害者）。如果案件未定，英语里常用 alleged/suspected 以避免直接定性。","注意不要把它当作泛指“骚扰者”。泛指“骚扰/打扰”更常用 harasser、bully、stalker 或 annoy（动词）。"]}
{"word":"molestful","summary":{"en":"“Molestful” is a rare, old-fashioned adjective meaning troublesome or annoying.","zh":"“Molestful”是罕见且较古旧的形容词，意为“令人烦扰的、恼人的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Troublesome; causing annoyance, discomfort, or disturbance. (Rare/old-fashioned)","zh":"令人烦扰的；使人不安或困扰的。（罕见/较古旧）"},"examples":[{"en":"The paperwork became a molestful delay for the whole project.","zh":"这些文书工作成了整个项目令人烦扰的拖延。"},{"en":"In older writing, a “molestful noise” can mean an annoying sound.","zh":"在较早的文字中，“molestful noise”可指恼人的噪音。"}]}],"synonyms":["annoying","troublesome","bothersome","disturbing","irksome"],"phonetic":"/məˈlɛstfəl/","extraExplanation":["“molestful”在现代英语里非常少见，更多见于旧文体/古英语风格中，意思接近“troublesome / annoying / bothersome”。","注意：现代英语中“molest”常指“性骚扰/猥亵”，但“molestful”这个形容词在旧用法里通常只是“烦扰、打扰”的意思。为了避免误解，现代写作更建议用“annoying / troublesome / disturbing”等。"]}
{"word":"molestfully","summary":{"en":"“Molestfully” is a rare adverb meaning “in a molesting (often sexually abusive) way,” or more loosely “in an annoying/harassing way.”","zh":"“molestfully”是一个很少见的副词，表示“以侵害（常指性侵/猥亵）方式”，也可较宽泛地指“以烦扰/骚扰方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that molests someone; in a harassing or sexually abusive manner","zh":"以骚扰他人或性侵害的方式；以猥亵/侵害的方式"},"examples":[{"en":"The witness said the man touched the child molestfully, and the police were called.","zh":"证人说那名男子以猥亵方式触碰了孩子，于是报警了。"},{"en":"Any behavior that treats someone molestfully is unacceptable and may be illegal.","zh":"任何以侵害/骚扰他人的方式对待他人的行为都是不可接受的，并且可能违法。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare) in a way that bothers, annoys, or interferes with someone","zh":"（罕见）以打扰、烦扰或妨碍他人的方式"},"examples":[{"en":"The insects buzzed molestfully around the lamp, keeping everyone awake.","zh":"昆虫在灯周围嗡嗡作响，烦扰得大家睡不着。"},{"en":"He kept calling at night, molestfully interrupting her rest.","zh":"他夜里不停打电话，烦扰地打断了她的休息。"}]}],"synonyms":["harassingly","abusively","annoyingly","inappropriately"],"phonetic":"/məˈlɛstfəli/","extraExplanation":["“molestfully”在现代英语中非常少见，很多母语者也几乎不会使用。表达“性侵/猥亵地”时，更常见的是“sexually”或“in a sexually abusive/harassing way”；表达“一直打扰地/烦扰地”时，更自然的是“annoyingly”“harassingly”或“in a disturbing way”。","注意：在美式英语里，“molest”常强烈指向对儿童或他人的性侵害语境，用词时要谨慎并考虑情境的严肃性。"]}
{"word":"molestie","summary":{"en":"A rare Latin-based word meaning “trouble” or “annoyance,” sometimes seen in placeholder text.","zh":"一个源自拉丁语、较罕见的词，意为“麻烦/困扰”，有时出现在占位文本中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; from Latin) trouble, annoyance, or inconvenience; a nuisance.","zh":"（罕见；源自拉丁语）麻烦、困扰、不便；令人烦扰的事。"},"examples":[{"en":"The report mentions delays and other molestie caused by the storm.","zh":"报告提到暴风雨造成的延误以及其他困扰。"},{"en":"They hoped to finish the project without further molestie.","zh":"他们希望在没有更多麻烦的情况下完成项目。"}]}],"synonyms":["trouble","annoyance","nuisance","inconvenience","bother"],"phonetic":"/moʊˈlɛsti/","extraExplanation":["“molestie”在现代英语中非常少见，更多时候你会在“Lorem ipsum”占位文本里看到类似的形式（更常见的是拉丁语复数“molestiae”），大意是“烦恼/麻烦”。","注意不要与英语常用动词“molest”（常指性骚扰/猥亵）混淆：两者词源相关，但现代英语里“molest”带有强烈的法律与性侵语境，而这里的“molestie”更接近“trouble / nuisance”的中性含义。"]}
{"word":"molesting","summary":{"en":"“Molesting” most commonly means committing sexual abuse or illegal sexual touching; less commonly, it means repeatedly bothering someone.","zh":"“molesting”最常指进行性侵/猥亵（非法性触碰或性骚扰）；较少见时也可指反复打扰他人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “molest”) sexually attacking, touching, or bothering someone in an illegal and harmful way, especially a child.","zh":"（molest 的现在分词）以非法且有害的方式对他人进行性侵犯或猥亵（尤其指对儿童），包括强行触摸、骚扰等。"},"examples":[{"en":"He was arrested for molesting a minor.","zh":"他因猥亵未成年人而被逮捕。"},{"en":"The school has strict rules to prevent anyone from molesting students.","zh":"学校有严格规定，防止任何人对学生进行猥亵或性侵。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) repeatedly bothering, harassing, or interfering with someone.","zh":"（较少见）反复打扰、骚扰或干扰某人。"},"examples":[{"en":"Stop molesting me with questions while I’m working.","zh":"我工作时别用问题一直打扰我。"}]}],"synonyms":["sexually abusing","assaulting","groping","harassing","bothering"],"phonetic":"/məˈlɛstɪŋ/","extraExplanation":["“molest”在现代英语里最常指性侵/猥亵；如果只是“打扰”，更常用 annoy / bother / harass，以避免造成严重误解。","在新闻或法律语境中常见搭配：molest a child/minor（猥亵儿童/未成年人）、allegedly accused of molesting（被指控猥亵）、sexual molestation（性侵/猥亵）。"]}
{"word":"molestious","summary":{"en":"“Molestious” is not a standard modern English word; it’s likely a misspelling of rare “molestous” (“troublesome/annoying”).","zh":"“molestious”不是现代英语的规范词；很可能是罕见词“molestous”（意为“惹麻烦的/烦扰的”）的拼写错误。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard / likely misspelling. Usually intended to mean “troublesome; annoying; causing disturbance,” but this form is rare in modern English.","zh":"非标准拼写／很可能是拼写错误。通常想表达“令人烦扰的；惹麻烦的；造成干扰的”，但这种形式在现代英语中很少见。"},"examples":[{"en":"This word is not commonly used today; writers usually choose “annoying” or “troublesome” instead.","zh":"这个词在今天并不常用；写作时一般会用“annoying”或“troublesome”来替代。"},{"en":"If you meant “causing trouble,” the more standard adjective is “molestous” (very rare) or simply “bothersome.”","zh":"如果你想表达“惹麻烦的”，更规范的形容词是“molestous”（也很少见），或者直接用“bothersome”。"}]}],"synonyms":["annoying","bothersome","troublesome","disruptive","disturbing"],"phonetic":"/məˈlɛs.təs/","extraExplanation":["“molestious”在主流词典里通常查不到，多半是把古旧形容词“molestous”（意为“烦扰的、令人不安的”）拼错了。","要注意：动词“molest”在现代英语里最常见的含义是“性骚扰/猥亵”，语气非常严重、法律含义很强；因此用类似“molest-”开头的词很容易让人误解。想表达“烦人/打扰”，更安全常用的是：annoying, bothersome, troublesome, disruptive。"]}
{"word":"molests","summary":{"en":"“Molests” means “sexually assaults/abuses” (most common today) or, more formally/older, “harasses or bothers repeatedly.”","zh":"“molests”通常指“性侵/猥亵”；较正式或较旧的用法也可指“反复骚扰、侵扰”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to sexually assault or abuse someone (often a child); to force unwanted sexual contact","zh":"性侵、猥亵（常指对儿童）；强迫对方发生不受欢迎的性接触"},"examples":[{"en":"The report says he molests children and should not be allowed near schools.","zh":"报告称他猥亵儿童，不应被允许靠近学校。"},{"en":"If someone molests you, try to get to a safe place and tell a trusted adult or call the police.","zh":"如果有人性侵你，尽量先到安全的地方，并告诉可信任的成年人或报警。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bother, harass, or attack someone repeatedly (older or more formal use)","zh":"骚扰、纠缠、不断侵扰（较正式或较旧的用法）"},"examples":[{"en":"On the way home, the travelers were molestsed by thieves. (formal/older)","zh":"在回家的路上，旅行者遭到盗贼侵扰。（较正式/较旧）"},{"en":"Strangers on the street molests her with rude comments.","zh":"街上的陌生人用粗鲁的评论骚扰她。"}]}],"synonyms":["sexually abuse","assault","grope","harass","bother","torment"],"phonetic":"/məˈlɛsts/","extraExplanation":["“molest(s)”在现代英语里最常见、最敏感的含义是“性侵/猥亵”。如果你只是想表达“一般的打扰/骚扰”，更常用且更安全的词是 harass, bother, annoy。","拼写提示：过去式/过去分词是 molested（只有一个 s）；现在分词是 molesting。"]}
{"word":"molet","summary":{"en":"“Molet” is not standard English; it’s usually a misspelling of “mullet” or a mistaken form of French “mollet.”","zh":"“molet”不是标准英语；多半是把“mullet”拼错，或误写了法语“mollet”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling. People often mean “mullet” (a fish or a hairstyle) or “mollet” (French for “calf,” the back of the lower leg).","zh":"不是标准英语单词；通常是拼写错误。人们常想写的是“mullet”（一种鱼或一种发型）或“mollet”（法语“calf”，指小腿肚）。"},"examples":[{"en":"I think you meant “mullet,” not “molet.”","zh":"我觉得你想写的是“mullet”，不是“molet”。"},{"en":"In anatomy notes, “calf” is the usual English word (French: “mollet”).","zh":"在解剖学笔记里，常用的英语是“calf”（法语是“mollet”）。"}]}],"phonetic":"/ˈmoʊlɛt/","extraExplanation":["“molet”在英语词典里一般找不到，常见于拼写失误或把法语“mollet”直接写成英语的情况。","如果你告诉我你想表达的是“发型/鱼/小腿/其他意思”，我可以给出对应的正确单词、发音和更多例句。"]}
{"word":"molewarp","summary":{"en":"Molewarp is an old/dialect word for a mole, and sometimes for the soil mound a mole makes.","zh":"molewarp 是“鼹鼠”的方言/旧词，有时也指鼹鼠拱出的土堆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, old-fashioned) A mole: a small burrowing mammal that lives underground.","zh":"（方言/旧用法）鼹鼠：一种生活在地下、善于掘洞的小型哺乳动物。"},"examples":[{"en":"The farmer blamed the molewarp for the ridges of soil in the field.","zh":"农夫把田里一条条土脊怪在鼹鼠（molewarp）身上。"},{"en":"In older country speech, people might call a mole a “molewarp.”","zh":"在较旧的乡村说法里，人们可能把鼹鼠叫作“molewarp”。"}]},{"partOfSpeech":"n.","definition":{"en":"The mound or disturbed soil made by a mole while digging (less common).","zh":"（较少见）鼹鼠挖洞时拱出的土堆/翻起的土。"},"examples":[{"en":"Watch your step—the lawn is dotted with molewarps after last night’s rain.","zh":"小心点——昨晚下雨后，草坪上到处是鼹鼠拱出的土堆（molewarps）。"}]}],"synonyms":["mole","moldwarp","molehill (for the mound)"],"phonetic":"/ˈmoʊlˌwɔrp/","extraExplanation":["“molewarp”更常见的拼写是“moldwarp / molewarp”，属于英语方言和古词。词源常被解释为“earth (mold)”+“thrower/turner（翻土者）”，形象地指“会把泥土拱起来的动物”。现代英语里通常直接说“mole”。"]}
{"word":"molge","summary":{"en":"“molge” isn’t a standard English word; it’s likely a misspelling or a name.","zh":"“molge”不是标准英语单词；更可能是拼写错误或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a username/brand.","zh":"不是标准英语单词；可能是拼写错误、人名，或网名/品牌名。"},"examples":[{"en":"I couldn’t find a dictionary meaning for “molge.”","zh":"我在词典里找不到“molge”的释义。"},{"en":"Molge is my gamer tag online.","zh":"Molge 是我的游戏昵称。"}]}],"phonetic":"/moʊldʒ/","extraExplanation":["“molge”在常见英语词典中通常查不到。如果你是想查某个正确拼写，可能是以下之一：\n- **mole**（鼹鼠；痣；间谍）\n- **mold**（模具；霉菌；塑造）\n- **merge**（合并）\n- **molt**（蜕皮/换毛）\n你可以告诉我它出现的句子/语境，或你想表达的中文意思，我就能帮你锁定正确单词。"]}
{"word":"molgula","summary":{"en":"Molgula is a scientific genus name for certain sea squirts (tunicates).","zh":"Molgula 是某类海鞘（被囊动物）的属名，属于科学学名用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of sea squirts (small marine animals) in the group called tunicates; often found attached to rocks or other surfaces in the ocean","zh":"海鞘属（被囊动物的一类小型海洋动物）；常附着在岩石或其他海中物体表面"},"examples":[{"en":"Scientists studied Molgula to understand how simple marine animals develop.","zh":"科学家研究海鞘属（Molgula），以了解简单海洋动物的发育过程。"},{"en":"A Molgula sea squirt can look like a small, rounded blob on a rock.","zh":"海鞘属的一种海鞘看起来可能像岩石上的一个小圆团。"}]}],"synonyms":["sea squirt (general term)","tunicate (broader group)"],"phonetic":"/mɑlˈɡjuːlə/","extraExplanation":["“Molgula”通常是生物学中的拉丁学名，作为属名一般要首字母大写：Molgula。日常英语里不常见，多出现在论文、科普或海洋生物相关语境中。","如果你原本想查的是拼写相近的常用词，可能是：molecule（分子）或 molecular（分子的、分子层面的）。你想查哪一个？"]}
{"word":"molidae","summary":{"en":"Molidae is the scientific family name for ocean sunfishes, including the genus *Mola*.","zh":"Molidae 是“翻车鱼科”的学名，指包括翻车鱼属（*Mola*）在内的一类海洋翻车鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of large marine fish known as ocean sunfishes (including the genus *Mola*), famous for their round, flattened bodies.","zh":"翻车鱼科；一类大型海洋鱼类的分类群（包括翻车鱼属 *Mola* 等），以圆盘状、侧扁的体形而著名。"},"examples":[{"en":"The ocean sunfish belongs to the family Molidae.","zh":"翻车鱼属于翻车鱼科（Molidae）。"},{"en":"Researchers recorded a Molidae species near the surface, basking in the sun.","zh":"研究人员记录到一条翻车鱼科的鱼在海面附近晒太阳。"}]}],"synonyms":["ocean sunfish family","sunfish (context-dependent)"],"phonetic":"/ˈmoʊləˌdiː/","extraExplanation":["这是生物分类学里的“科名”（family name），常见于科普文章、海洋生物学教材与学术写作；日常英语对话中更常说 *ocean sunfish* 或 *sunfish*（不过 *sunfish* 也可能指淡水的太阳鱼类，需要结合语境）。","词形上，*-idae* 是动物“科”的常见拉丁化后缀（如 *Felidae* 猫科、*Canidae* 犬科）。"]}
{"word":"moliere","summary":{"en":"Molière: a major 17th-century French comic playwright famous for sharp social satire.","zh":"莫里哀：17世纪法国重要喜剧作家，以犀利的社会讽刺著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous French playwright and actor (1622–1673), known for satirical comedies that criticize hypocrisy and social pretension; his real name was Jean-Baptiste Poquelin.","zh":"莫里哀（1622–1673），法国著名剧作家与演员，以讽刺喜剧闻名，常批判伪善与社会虚荣；本名让-巴蒂斯特·波克兰。"},"examples":[{"en":"In literature class, we read Molière’s comedy The Misanthrope.","zh":"在文学课上，我们读了莫里哀的喜剧《恨世者》。"},{"en":"Molière used humor to expose hypocrisy in high society.","zh":"莫里哀用幽默揭露上流社会的伪善。"},{"en":"Tartuffe is one of Molière’s most famous plays.","zh":"《伪君子》（Tartuffe）是莫里哀最著名的剧作之一。"}]}],"synonyms":["Jean-Baptiste Poquelin"],"phonetic":"/moʊˈljɛr/","extraExplanation":["“Molière”是他的艺名（舞台名）。他对法语戏剧影响极大，作品常以日常口语般的对白和锋利的社会讽刺见长。","他的一些剧作在英语世界也很常见：Tartuffe（《伪君子》）、The Misanthrope（《恨世者》）、The Imaginary Invalid（《无病呻吟》）。"]}
{"word":"molies","summary":{"en":"“Molies” is usually a misspelling of “mollies,” meaning either multiple people named Molly, or (slang) MDMA. A historical meaning is now offensive and should be avoided.","zh":"“molies”通常是“mollies”的误拼：可指多个叫Molly的人，或（俚语）指毒品MDMA。另有历史贬义用法，现今通常冒犯，建议避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of the female name “Molly.”","zh":"女性名字“Molly”的复数（指多位叫Molly的人）。"},"examples":[{"en":"There are three Mollies in my class this year.","zh":"今年我们班里有三个叫Molly的人。"},{"en":"I invited Mollies from two different teams.","zh":"我邀请了来自两个不同队的Molly们。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal slang) MDMA, a party drug; also spelled “Molly.”","zh":"（非正式俚语）指摇头丸成分之一的毒品MDMA，也常写作“Molly”。"},"examples":[{"en":"The police said the tablets were being sold as “molly.”","zh":"警方说这些药片被当作“molly”（MDMA）在出售。"},{"en":"Some festivals warn people about drugs like molly.","zh":"一些音乐节会提醒人们注意像molly这样的毒品。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, now offensive) A term used in 18th–19th century England for an effeminate man; avoid using it.","zh":"（历史用法，现今带冒犯性）18—19世纪英格兰曾用来指“女性化的男性”的词；建议避免使用。"},"examples":[{"en":"The word appears in some historical documents, but it’s considered offensive today.","zh":"这个词会出现在一些历史文献里，但如今通常被认为带冒犯性。"}]}],"synonyms":["Molly (name)","MDMA (slang: molly)"],"phonetic":"/ˈmɑliz/","extraExplanation":["你输入的是“molies”。更常见的拼法是“mollies”（如名字Molly的复数）或“molly”（俚语指MDMA）。在正式写作中，如果指人名请用大写“Mollies”。","第二、三条含义都涉及敏感话题：毒品与贬义历史用语。学习时了解即可，日常交流中要根据语境谨慎选择词汇，必要时用更中性的表达。"]}
{"word":"molified","summary":{"en":"“Mollified” means calmed or made less angry/worried; it’s the past form of “mollify.”","zh":"“mollified”表示“被安抚、怒气/担忧减轻”，也是“mollify”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Calmed down or made less angry, upset, or worried.","zh":"（形容词）被安抚的；怒气或焦虑减轻的。"},"examples":[{"en":"She was mollified after he apologized sincerely.","zh":"他真诚道歉后，她的怒气消了不少。"},{"en":"The customers were mollified by a full refund.","zh":"全额退款让顾客们平静下来。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Past tense/past participle of “mollify”: to calm someone or make something less severe.","zh":"（动词）“mollify”的过去式/过去分词：安抚（某人）；缓和（某事）。"},"examples":[{"en":"The manager mollified the team by explaining the changes clearly.","zh":"经理把变动解释清楚后，安抚了团队情绪。"},{"en":"A warm drink mollified his sore throat a little.","zh":"一杯热饮稍微缓解了他的喉咙痛。"}]}],"synonyms":["calmed","appeased","soothed","placated","pacified"],"phonetic":"/ˈmɑləˌfaɪd/","extraExplanation":["你输入的“molified”通常是拼写错误；标准拼写是 **mollified**（双写 l）。","词根来自拉丁语 *mollis*（柔软的），所以 *mollify* / *mollified* 常带有“让情绪变软、变缓和”的感觉。","常见搭配：**mollified by**（因……而被安抚/缓和）；也常用来形容投诉、争执后情绪被平息。"]}
{"word":"molify","summary":{"en":"Mollify means to calm someone down or make something less severe.","zh":"mollify 指“安抚（使人不那么生气）”或“缓和（使情况不那么严重）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To calm someone down or make them less angry or upset; to soothe.","zh":"使（某人）平静下来；安抚；缓和（愤怒或不满）。"},"examples":[{"en":"She tried to mollify her upset friend with an apology.","zh":"她用道歉来安抚那位不开心的朋友。"},{"en":"A small refund helped mollify the customer.","zh":"一小笔退款有助于平息顾客的不满。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something less severe or intense; to soften.","zh":"减轻；缓和（程度或强度）；使更温和。"},"examples":[{"en":"The new policy was meant to mollify the harsh effects of the rule.","zh":"新政策旨在缓和这条规定带来的严厉影响。"},{"en":"Nothing could mollify the shock of the bad news.","zh":"没有什么能减轻这则坏消息带来的震惊。"}]}],"synonyms":["soothe","pacify","appease","calm","assuage"],"phonetic":"/ˈmɑləˌfaɪ/","extraExplanation":["你输入的“molify”通常是拼写错误；标准拼写是 **mollify**（中间有两个 l）。","词源来自拉丁语 *mollis*（意为“柔软的、温和的”），所以它常带有“把情绪/局势变得更柔和”的感觉。","常见搭配：mollify **someone**（安抚某人），mollify **anger/criticism/tension**（缓和愤怒/批评/紧张气氛）。"]}
{"word":"molifying","summary":{"en":"Mollifying means calming someone down or making a situation less tense.","zh":"Mollifying 指“安抚、缓和”，让人冷静或让局势不那么紧张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making someone less angry or upset; calming (often by saying or doing something to reduce tension)","zh":"（通过言语或行动）使人不那么生气/不安；安抚的；缓和的"},"examples":[{"en":"She offered a mollifying apology after the argument.","zh":"争吵之后，她给了一个安抚性的道歉。"},{"en":"His calm tone had a mollifying effect on the crowd.","zh":"他冷静的语气对人群起到了缓和作用。"},{"en":"They made a mollifying gesture to show respect.","zh":"他们做了一个安抚性的举动来表示尊重。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of making someone calmer or less angry; calming or soothing","zh":"使人平静/不那么生气的行为；安抚、缓和"},"examples":[{"en":"The manager tried mollifying the customer with a refund.","zh":"经理试图用退款来安抚顾客。"},{"en":"He spent the evening mollifying his friend after the misunderstanding.","zh":"误会之后，他花了一整晚安抚朋友。"}]}],"synonyms":["calming","soothing","appeasing","pacifying","placating"],"phonetic":"/ˈmɑlɪˌfaɪɪŋ/","extraExplanation":["你输入的“molifying”通常是拼写错误，正确拼写更常见的是 **mollifying**（双写 l）。它来自动词 **mollify**，意思是“安抚、缓和”。","常见搭配：**mollifying apology**（安抚性的道歉）、**mollifying tone**（缓和的语气）、**mollify someone**（安抚某人）。","近义词细微区别：**soothe** 更偏“抚慰、减轻痛苦/不适”，**placate** 常含“为了让对方别生气而顺着/迁就”的意味，有时带一点负面色彩。"]}
{"word":"molilalia","summary":{"en":"Molilalia means abnormally slow or delayed speech (a clinical term).","zh":"Molilalia 指“言语异常缓慢／迟缓”（一种临床术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Abnormally slow or delayed speech; speaking very slowly, often as a symptom of a neurological or psychiatric condition.","zh":"（医学）言语异常缓慢／迟缓；说话速度很慢，常见于某些神经系统或精神方面的疾病症状。"},"examples":[{"en":"After the head injury, the doctor noted molilalia during the speech assessment.","zh":"头部受伤后，医生在言语评估中记录到他说话出现“言语迟缓”（molilalia）。"},{"en":"The patient answered questions with molilalia, pausing a long time before each word.","zh":"这位病人以明显的言语迟缓回答问题，每个词前都停顿很久。"}]}],"synonyms":["slow speech","slowed speech","delayed speech","bradylalia"],"phonetic":"/ˌmoʊlɪˈleɪliə/","extraExplanation":["词源：来自希腊语词根，lalia 表示“说话／言语”，前半部分与“缓慢”有关，因此整体含义指“说话异常慢”。","学习提示：molilalia 是偏专业的临床术语，日常英语更常用 slow speech / slowed speech 或 delayed speech 来表达。","相关区分：echolalia 指“鹦鹉学舌式重复他人话语”，palilalia 指“反复重复自己的词语”；molilalia 侧重“速度慢”。"]}
{"word":"molimen","summary":{"en":"Molimen is a rare literary noun meaning a great, strenuous effort or laborious undertaking.","zh":"Molimen 是一个罕见的文学名词，表示“巨大的、费力的努力”或“艰难的事业”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, literary) a great effort, attempt, or strenuous exertion; a laborious undertaking.","zh":"（罕见/文学用语）巨大的努力、尝试或费力的行动；艰难的事业。"},"examples":[{"en":"After years of research, the team’s molimen finally produced a workable vaccine design.","zh":"经过多年的研究，团队的巨大努力终于产出了可行的疫苗设计。"},{"en":"In the novel, the hero’s molimen to cross the desert becomes a test of will.","zh":"在小说里，主角穿越沙漠的艰苦努力成了意志的考验。"}]}],"synonyms":["effort","struggle","endeavor","exertion","undertaking"],"phonetic":"/ˈmɑːlɪmən/","extraExplanation":["“molimen”在现代英语里非常少见，多见于学术写作或文学风格中，用来强调“费力、艰难、需要付出巨大能量的努力”。日常表达通常用 effort、struggle、endeavor 等更常见的词。","词源来自拉丁语 molimen（意为“努力、尝试、艰难的举动”），与表示“负担/重量”的词根含义相关，因此带有“沉重、吃力”的语感。"]}
{"word":"moliminous","summary":{"en":"Moliminous is a rare adjective meaning ‘requiring great effort’ or ‘busy and strenuous.’","zh":"moliminous 是一个罕见形容词，意思是“费力的、艰难的”，也可指“忙碌而紧张的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Involving great effort; laborious; difficult and strenuous.","zh":"（罕见）需要付出很大努力的；费力的；艰难而吃力的。"},"examples":[{"en":"Writing the thesis was a moliminous task that took months of revision.","zh":"写论文是一项很费力的工作，需要数月反复修改。"},{"en":"They made a moliminous attempt to move the heavy piano upstairs.","zh":"他们费了很大劲儿才试着把沉重的钢琴搬到楼上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Full of busy, strenuous activity; vigorously bustling.","zh":"（罕见）忙碌而费劲的；充满紧张活动的。"},"examples":[{"en":"The factory floor was moliminous before the holiday deadline.","zh":"假期截止日期前，工厂车间一片忙碌紧张。"}]}],"synonyms":["laborious","strenuous","arduous","toilsome","effortful"],"phonetic":"/məˈlɪmɪnəs/","extraExplanation":["这个词很少见，现代英语里更常用的表达是 laborious（费力的）、strenuous（费劲的）、difficult（困难的）、hard work（辛苦的事）。","词源来自拉丁语 molimen（努力、艰辛的劳作），也与英文单词 immolate/“mole”无关，容易让人误会是拼写错误。","如果你本来想表达“体积大/篇幅长”，更常见的词是 voluminous（大量的；厚的）。"]}
{"word":"molinary","summary":{"en":"Molinary is a rare adjective meaning “related to a mill or milling.”","zh":"molinary 是个较少见的形容词，意思是“与磨坊或碾磨/制粉有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a mill or the work of milling (grinding grain, processing with a mill).","zh":"（较少见）与磨坊/工厂的碾磨、制粉等“磨”相关的；磨坊的。"},"examples":[{"en":"The museum has molinary tools used to grind wheat into flour.","zh":"这座博物馆里有用于把小麦磨成面粉的磨坊工具。"},{"en":"Records of molinary activity show how the village economy developed.","zh":"关于磨坊生产活动的记录显示了这个村庄经济是如何发展的。"}]}],"synonyms":["milling","mill-related","flour-mill"],"phonetic":"/ˈmɑːləˌnɛri/","extraExplanation":["“molinary”在现代英语里非常少见，更多时候你会看到更常用的说法：mill / milling / flour-mill / mill-related 等。","它有时也会作为姓氏出现（例如 Molinary）。如果你是在某篇文章或人名里看到的，可能不是普通词汇用法。","如果你本来想查的是“culinary（烹饪的）”或“mollinary”等相近拼写，也可以把完整句子发我，我可以帮你确认。"]}
{"word":"moline","summary":{"en":"Moline is most commonly a U.S. place name, especially the city of Moline, Illinois.","zh":"Moline 最常见是美国地名，尤指伊利诺伊州的莫林市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in northwestern Illinois, USA, on the Mississippi River (part of the “Quad Cities” region).","zh":"（美国）伊利诺伊州西北部密西西比河畔的一座城市（“四城地区”Quad Cities 的一部分）。"},"examples":[{"en":"John Deere has major facilities in Moline, Illinois.","zh":"约翰迪尔（John Deere）在伊利诺伊州的莫林（Moline）设有重要设施。"},{"en":"We drove through Moline on our way along the Mississippi River.","zh":"我们沿着密西西比河行驶时经过了莫林（Moline）。"}]}],"synonyms":["Moline, Illinois","the Quad Cities (region)"],"phonetic":"/moʊˈliːn/","extraExplanation":["“Moline”常见于美国地名，最常指伊利诺伊州的 Moline（莫林）。它与 Davenport、Rock Island、Bettendorf 等城市一起构成“Quad Cities（四城地区）”。","在美国文化语境里，Moline 常与农业机械品牌 John Deere 联系在一起，因为其历史与当地工业发展关系密切。"]}
{"word":"molinet","summary":{"en":"Molinet (more commonly spelled *moulinet*) usually means a circular sword flourish in fencing; it can also refer to a small rotating device like a reel or windmill-like spinner in older or French-influenced contexts.","zh":"Molinet（更常见拼法为 *moulinet*）通常指击剑中的圆形甩剑动作；在较旧或受法语影响的语境中，也可指卷线器或类似小风车的旋转装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Fencing) a circular, whipping motion of the sword (or arm) used to build momentum or to feint before a cut.","zh":"（击剑）剑（或手臂）的圆形甩动动作，用来积蓄力量或在劈砍前做佯攻。"},"examples":[{"en":"The coach told her to add a quick moulinet before the downward cut.","zh":"教练让她在下劈前加一个快速的圆形甩剑动作。"},{"en":"His moulinet made the attack look larger and harder to read.","zh":"他的甩剑动作让进攻看起来更夸张、更难判断。"}]},{"partOfSpeech":"n.","definition":{"en":"A small windmill-like device or a rotating reel/winch (in some contexts, especially influenced by French usage).","zh":"类似小风车的旋转装置；（某些语境中，受法语影响）卷线器/绞盘等旋转轮装置。"},"examples":[{"en":"In old descriptions, the current was measured with a small moulinet that spun in the water.","zh":"在一些旧的描述里，人们用一种在水中旋转的小装置来测量水流。"},{"en":"He repaired the moulinet on his fishing gear before the trip.","zh":"出发前他修好了钓具上的卷线轮。"}]}],"synonyms":["moulinet","flourish","circular swing","sword whirl"],"phonetic":"/ˌmuːlɪˈneɪ/","extraExplanation":["“Molinet”常被当作“moulinet”的变体拼写；更常见、标准的拼法是 **moulinet**（来自法语，和 *moulin*「磨坊/风车」同源，带有“小风车般旋转”的意象）。","在英语里最常见的用法是击剑术语：指剑尖/剑刃做圆周甩动的“甩剑”动作（很多击剑教材与训练口令会用这个词）。"]}
{"word":"moling","summary":{"en":"“Molding” most commonly means the process of shaping something (or the shaping itself), or decorative trim in buildings.","zh":"“molding”常指“（用模具）成型/塑造的过程”，也指建筑装修中的“装饰线条/饰条”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of shaping a soft material (like clay, plastic, or metal) in a mold; also the act of forming something","zh":"（用模具）把软材料（如黏土、塑料、金属等）塑造成形的过程；也指“塑造/形成”的行为"},"examples":[{"en":"The factory uses injection molding to make plastic parts.","zh":"这家工厂用注塑成型来制造塑料零件。"},{"en":"Education plays a big role in the molding of a child’s character.","zh":"教育在孩子性格的塑造中起很大作用。"}]},{"partOfSpeech":"n.","definition":{"en":"a shaped strip of wood, plaster, or plastic used as decorative trim (for example, around doors, windows, ceilings, or floors)","zh":"（装饰用的）线条/饰条（如门窗、天花板或地脚线周围的装饰条）"},"examples":[{"en":"They painted the walls white and kept the dark wood molding.","zh":"他们把墙刷成白色，保留了深色木质线条。"},{"en":"The picture frame has simple molding around the edge.","zh":"这个相框边缘有简洁的装饰线条。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “mold”: shaping or forming something, often over time","zh":"“mold”的现在分词：正在塑形/塑造；常指逐渐形成"},"examples":[{"en":"The artist is molding the clay into a small bowl.","zh":"艺术家正在把黏土捏成一个小碗。"},{"en":"The coach is molding the team into a stronger unit.","zh":"教练正在把球队塑造成更强的整体。"}]}],"synonyms":["shaping","forming","casting","trim","decorative trim","moulding (UK)"],"phonetic":"/ˈmoʊldɪŋ/","extraExplanation":["“moling”通常被认为是拼写错误，更常见的拼法是 **molding**（美式）或 **moulding**（英式）。两者意思基本相同，但在建筑/装修语境中常指“装饰线条/饰条”。","注意区分 **molding/moulding（装饰线条）** 和 **mold/mould（霉菌）**：拼写接近，但意思不同。"]}
{"word":"molinia","summary":{"en":"Molinia: a genus of grasses, especially purple moor-grass, often used as an ornamental plant.","zh":"Molinia：一种草属，尤指紫色沼泽草，常作观赏草栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tuft-forming grasses (moor-grasses), especially the ornamental grass known as purple moor-grass.","zh":"一种丛生型禾本科草属（沼泽草属）；常指作观赏草栽培的“紫色沼泽草”（purple moor-grass）。"},"examples":[{"en":"Molinia is often planted in gardens for its airy flower heads and fall color.","zh":"Molinia 常被种在花园里，因为它的花序轻盈、秋色好看。"},{"en":"In wet heathland, Molinia can form large clumps.","zh":"在潮湿的石南荒原上，Molinia 可能形成很大的草丛。"}]}],"synonyms":["purple moor-grass","moor-grass"],"phonetic":"/moʊˈlɪniə/","extraExplanation":["“Molinia”是植物学中的属名，通常在园艺与生态学语境出现；日常英语里更常说具体种名，如“purple moor-grass（紫色沼泽草）”。","发音上重音通常落在第二音节：mo-LIN-ee-uh。"]}
{"word":"molinism","summary":{"en":"Molinism is a theological view that explains how God can be all-knowing while humans still have real free will.","zh":"莫利尼主义是一种神学观点，用来解释上帝全知与人类真实自由意志如何并存。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian theological view (often linked to the Jesuit thinker Luis de Molina) that tries to reconcile God’s complete knowledge and control with genuine human free will, using the idea that God knows what any person would freely choose in any situation.","zh":"一种基督教神学观点（常与耶稣会神学家路易斯·德·莫利纳 Luis de Molina 相关），试图调和“上帝完全的全知与主权”与“人真实的自由意志”，核心工具是：上帝知道人在任何处境下“会自由地如何选择”这一类反事实知识。"},"examples":[{"en":"Molinism argues that God can guide history without forcing people’s choices.","zh":"莫利尼主义认为，上帝可以引导历史进程，但不必强迫人的选择。"},{"en":"In debates about predestination, some Christians adopt Molinism to defend human responsibility.","zh":"在关于预定论的讨论中，有些基督徒会采用莫利尼主义来捍卫人的责任。"}]}],"synonyms":["Molinist theology","the doctrine of middle knowledge"],"phonetic":"/ˈmoʊlɪnɪzəm/","extraExplanation":["“Molinism”常译作“莫利尼主义/莫利纳主义”。它最常与“中间知识（middle knowledge）”一起出现：除了知道一切可能发生与实际发生的事，上帝还知道“如果某人处在某个情境中，他会自愿做出什么选择”。","常见对比：加尔文主义（Calvinism）强调上帝的预定与恩典；阿民念主义（Arminianism）强调人的回应与自由。莫利尼主义试图在两者之间提出一种解释框架。","使用场景多在神学、宗教哲学、自由意志与恶的问题（the problem of evil）等讨论中；在日常英语里不常见。"]}
{"word":"molinist","summary":{"en":"A Molinist is someone who supports Molinism, a theological view about God’s foreknowledge and human free will; it can also mean “related to Molinism.”","zh":"molinist 指支持莫利那主义的人；也可作形容词，表示“与莫利那主义有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows or supports Molinism (a Catholic theological view about how God’s foreknowledge and human free will work together)","zh":"莫利那主义者；支持“莫利那主义”（一种天主教神学观点，讨论上帝的预知与人的自由意志如何并存）的人"},"examples":[{"en":"Some Christian philosophers describe themselves as Molinists because they want to defend human free will.","zh":"一些基督教哲学家自称为莫利那主义者，因为他们希望捍卫人的自由意志。"},{"en":"In the debate, the Molinist argued that God can know what people would freely choose in any situation.","zh":"在辩论中，这位莫利那主义者主张：上帝能够知道人在任何情境下会自由地做出怎样的选择。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Molinism or its ideas","zh":"与莫利那主义或其思想有关的"},"examples":[{"en":"The paper compares Molinist and Calvinist views of providence.","zh":"这篇论文比较了莫利那主义与加尔文主义对“神的护理/摄理”的看法。"},{"en":"They discussed a Molinist explanation of God’s foreknowledge.","zh":"他们讨论了一种莫利那主义式的“上帝预知”解释。"}]}],"synonyms":["Molinism supporter","adherent of Molinism"],"phonetic":"/ˈmoʊlɪnɪst/","extraExplanation":["“Molinist / Molinism”来自16世纪西班牙耶稣会神学家 Luis de Molina（路易斯·德·莫利纳）。他提出“中知（middle knowledge）”的概念：上帝不仅知道将来会发生什么，也知道人在各种可能情境中“会自由地如何选择”。这一观点常用于解释：既保留上帝的全知与掌权，又保留人的自由意志。","这个词多见于神学、宗教哲学与教会历史讨论中，日常英语里很少用；写作中通常需要上下文说明。"]}
{"word":"molinistic","summary":{"en":"Molinistic means “connected with Molinism,” a theological/philosophical view about God’s foreknowledge and human free will.","zh":"molinistic 指“与莫林主义有关的”，常用于讨论上帝预知与人的自由意志如何并存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to Molinism, a Christian theological view about how God’s foreknowledge and human free will can both be true","zh":"与“莫林主义（Molinism）”有关的；一种基督教神学观点，试图解释上帝的预知与人的自由意志如何能同时成立"},"examples":[{"en":"Some philosophers defend a Molinistic solution to the problem of divine foreknowledge.","zh":"一些哲学家为“莫林主义式”的解决方案辩护，用来处理上帝预知的问题。"},{"en":"In a Molinistic framework, God knows what a person would freely choose in many possible situations.","zh":"在莫林主义框架下，上帝知道一个人在许多可能情境中“会自由地”做出什么选择。"}]}],"synonyms":["Molinist","Molinism-related"],"phonetic":"/ˌmoʊlɪˈnɪstɪk/","extraExplanation":["“Molinistic”来自16世纪西班牙耶稣会神学家路易斯·德·莫利纳（Luis de Molina）。莫林主义最常被提到的核心概念是“中知识（middle knowledge）”：上帝不仅知道将来会发生什么，也知道在不同假设情境下，人会如何自由选择（常被称为“反事实的自由选择”）。","在英语学术写作中更常见的名词是“Molinism”（莫林主义）；形容词除了“Molinistic”，也可能见到“Molinist”（如“Molinist view/position”）。这类词多用于哲学与神学讨论，日常口语中很少用。"]}
{"word":"molition","summary":{"en":"Molition is a rare formal noun meaning effort or deliberate planning/undertaking to achieve something.","zh":"Molition 是罕见的正式名词，指为达成目标所做的努力或周密的筹划/行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, formal) An effort, attempt, or careful planning to achieve something; a scheme or undertaking.","zh":"（罕见，正式）为达成某事所做的努力或尝试；（尤指）周密的筹划、谋划或行动。"},"examples":[{"en":"Through years of political molition, the group finally gained legal recognition.","zh":"经过多年的政治谋划与努力，这个团体终于获得了合法身份。"},{"en":"The project failed not because of a lack of molition, but because the budget ran out.","zh":"项目失败不是因为缺少努力，而是因为预算用尽了。"}]}],"synonyms":["effort","attempt","endeavor","undertaking","scheme","planning"],"phonetic":"/məˈlɪʃən/","extraExplanation":["“molition” 是非常少见的词，多见于较旧或非常正式的写作。它来自拉丁语词根 *moliri*（意为“费力去做、筹划、着手进行”），所以常带有“用力推进/周密筹划”的语气。","学习中更常用的近义表达有：effort（努力）、attempt（尝试）、endeavor（努力尝试，较正式）、scheme/plot（计谋/策划，语气更负面）、planning（计划）。","注意别和 “mollition” 混淆：*mollition*（更少见）指“软化、缓和”，来源不同。"]}
{"word":"molka","summary":{"en":"“Molka” is mainly used as a name in English, not a common dictionary word.","zh":"“Molka”在英语中主要作为名字使用，并非常见词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname or place name). It is not a common vocabulary word in standard English.","zh":"专有名词（多作姓氏或地名）。“Molka”不是标准英语里常见的词汇。"},"examples":[{"en":"Dr. Molka will present the research results tomorrow.","zh":"Molka 医生明天将展示研究结果。"},{"en":"They visited a small town called Molka during their trip.","zh":"旅行中他们参观了一个叫 Molka 的小镇。"}]}],"phonetic":"/ˈmoʊlkə/","extraExplanation":["“Molka”在英语里通常被当作人名/姓氏或地名使用，而不是有固定词义的普通单词。","如果你是想查饮品相关的词，可能是拼写接近的 **mocha**（摩卡）或 **moka**（摩卡壶）。如果你能提供一句包含“molka”的原句或它出现的语境（书名、游戏、品牌、语言），我可以更准确地解释。"]}
{"word":"moll","summary":{"en":"“Moll” usually means (1) a gangster’s girlfriend/associate (slang, sometimes insulting), or (2) “minor” in music (from German).","zh":"“moll”通常指（1）黑帮分子的女友/同伙（俚语，可能带贬义），或（2）音乐中的“小调”（源自德语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A gangster’s girlfriend or a woman who spends time with criminals; sometimes used as a dismissive word for a woman.","zh":"（俚语）黑帮分子的女友/同伙；也可泛指与罪犯来往的女人，有时带有轻蔑意味。"},"examples":[{"en":"In old crime movies, the gangster is often shown with his moll.","zh":"在老式犯罪电影里，黑帮分子常常带着他的“情妇/女伴”（moll）。"},{"en":"That word can sound insulting today, so be careful using it.","zh":"这个词在今天可能显得冒犯，用的时候要小心。"}]},{"partOfSpeech":"adj.","definition":{"en":"(music, from German) “Minor” as in a minor key; used especially in some music writing (often contrasted with “dur” for major).","zh":"（音乐，源自德语）“小调/小调式”；在某些音乐文字中使用（常与表示大调的 dur 相对）。"},"examples":[{"en":"The piece shifts from dur (major) to moll (minor).","zh":"这首曲子从 dur（大调）转到 moll（小调）。"},{"en":"It’s written in moll to create a sadder mood.","zh":"它用小调写作，以营造更忧伤的氛围。"}]}],"synonyms":["gangster's girlfriend","criminal associate","minor (music)"],"phonetic":"/mɑl/","extraExplanation":["“moll”（黑帮女伴）常见于19–20世纪的英美黑帮与侦探小说、电影语境中；现代日常英语里并不常用，而且可能带性别偏见或贬义，写作或对话中建议用更中性的说法（如 girlfriend/partner/associate）。","音乐意义的“moll”来自德语：moll=小调，dur=大调；在英语音乐教材中更常见的仍是 minor/major。"]}
{"word":"molla","summary":{"en":"“Molla” is a less common spelling of “mullah,” meaning a Muslim religious leader or scholar; it can also be used insultingly in some contexts.","zh":"“Molla”是不太常见的“mullah”拼写变体，指穆斯林宗教领袖或学者；在某些语境中也可能带贬义、具冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling of “mullah”) a Muslim religious leader or scholar, especially in Iran and other parts of the Middle East and South Asia.","zh":"（“mullah”的变体拼写）穆斯林宗教领袖或学者（尤指伊朗及中东、南亚部分地区）。"},"examples":[{"en":"In the village, people asked the molla for advice on religious questions.","zh":"在村里，人们向这位molla请教宗教问题。"},{"en":"The book describes how some mollas influenced local politics.","zh":"这本书描述了一些molla如何影响地方政治。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some contexts) used informally to refer to a very strict or narrow-minded religious person; often offensive or disrespectful.","zh":"（在某些语境中）非正式用法，指非常严苛或狭隘的宗教人士；常带冒犯或不尊重的含义。"},"examples":[{"en":"Be careful: using “molla” this way can sound insulting.","zh":"注意：这样使用“molla”可能听起来很侮辱人。"}]}],"synonyms":["mullah","Islamic cleric","religious scholar"],"phonetic":"/ˈmʊlə/","extraExplanation":["“molla”在英语中不如“mullah”常见，多见于对中东/南亚语境的转写或特定地区的拼写习惯。","语气提醒：在新闻或学术写作里通常用中性词“mullah”。把它当作贬义称呼时容易引发文化与宗教敏感问题，建议避免。"]}
{"word":"mollah","summary":{"en":"Mollah (more commonly mullah) means a Muslim religious leader or scholar.","zh":"mollah（更常见拼写为 mullah）指穆斯林宗教领袖或学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled mullah) A Muslim religious leader or scholar, especially one trained in Islamic law and theology.","zh":"（也拼作 mullah）穆斯林宗教领袖或学者，尤指受过伊斯兰教法与神学训练的人。"},"examples":[{"en":"In some communities, the mullah leads prayers and gives religious advice.","zh":"在一些社区里，毛拉会带领祷告并提供宗教建议。"},{"en":"The villagers asked the mullah to help settle a dispute fairly.","zh":"村民请毛拉帮助公正地调解纠纷。"}]}],"synonyms":["mullah","Islamic cleric","religious scholar"],"phonetic":"/ˈmʊlə/","extraExplanation":["“mollah”是“mullah”的另一种拼写，英语里更常见的是“mullah”。","不同地区对“mullah/毛拉”的使用范围不完全一致：有时泛指伊斯兰宗教学者或教师；在某些语境（尤其新闻报道）中也可能指有宗教影响力的保守派人士。使用时注意语境与语气，避免把它当作贬义词。"]}
{"word":"mollahs","summary":{"en":"Mollahs are Muslim religious leaders or scholars (plural of mullah).","zh":"mollahs 是 mullah（毛拉）的复数，指穆斯林宗教领袖或宗教学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mullah: a Muslim religious leader or scholar, especially in countries such as Iran, Afghanistan, and parts of South Asia.","zh":"mullah（伊斯兰教宗教领袖/学者）的复数：指穆斯林宗教人士或学者，常见于伊朗、阿富汗及南亚部分地区。"},"examples":[{"en":"In the village, local mollahs taught children to read the Qur’an.","zh":"在那个村庄，当地的毛拉教孩子们诵读《古兰经》。"},{"en":"Some news reports discuss the influence of mollahs on politics in Iran.","zh":"一些新闻报道讨论了毛拉在伊朗政治中的影响。"}]}],"synonyms":["mullahs","Islamic clerics","religious scholars","ulama"],"phonetic":"/ˈmʊlə/","extraExplanation":["“mullah/毛拉”在不同国家和语境中地位不完全相同：有时指受过宗教教育的学者或教师，有时也可指在社区中主持宗教事务的人。","在英语媒体里，mullah（及其复数 mollahs）有时会带有政治色彩或刻板印象；写作或讨论时，最好根据具体地区与角色准确表述（如“religious scholar/cleric（宗教学者/神职人员）”）。"]}
{"word":"molland","summary":{"en":"“Molland” is usually a proper noun, most often a surname, and sometimes a Scandinavian place name.","zh":"“Molland”通常是专有名词，多为姓氏，也可能是斯堪的纳维亚地区的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); not a common English vocabulary word","zh":"（专有名词）姓氏；不是常见的英语词汇"},"examples":[{"en":"Her last name is Molland.","zh":"她的姓是 Molland。"},{"en":"I found a researcher named Molland in the article’s references.","zh":"我在文章的参考文献里看到一位姓 Molland 的研究者。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in Scandinavia (used as a proper noun in some locations)","zh":"（专有名词）斯堪的纳维亚地区的一些地名"},"examples":[{"en":"They visited Molland during their trip in southern Norway.","zh":"他们在挪威南部旅行时去了 Molland。"}]}],"synonyms":["(surname)","(place name)"],"phonetic":"/ˈmɑːlənd/","extraExplanation":["“Molland”在英语里通常作为专有名词出现（人名/地名），而不是可自由变化的普通词汇，所以一般不会有常见的动词、形容词等用法。","如果你是在阅读中遇到“molland”，也可能是拼写误差；常见相近拼写包括：Moland（更常见的姓/地名拼写）、mulled（深思/反复考虑）、molar（臼齿的/摩尔的）。如果你能提供原句，我可以帮你判断最准确的意思。"]}
{"word":"mollberg","summary":{"en":"Mollberg is typically used as a last name (surname), not as a general English word.","zh":"Mollberg 通常是姓氏用法，并非通用英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name); not a common English vocabulary word.","zh":"一个姓氏（家族姓）；不是常见的英语词汇。"},"examples":[{"en":"Dr. Mollberg will speak at the conference tomorrow.","zh":"Mollberg 博士明天将在会议上发言。"},{"en":"I found an article by someone named Mollberg.","zh":"我找到了一篇作者姓 Mollberg 的文章。"}]}],"synonyms":["family name","surname","last name"],"phonetic":"/ˈmɑl.bɝɡ/","extraExplanation":["“Mollberg”更常见于人名（姓氏），可能带有北欧（如瑞典/芬兰）或德语区的拼写风格；在英语里通常不会作为普通名词、动词等来使用。","如果你是在书名、论文、地名或品牌里看到它，含义通常取决于具体指代对象（某个人、某个机构或某个地点）。可以告诉我你看到它的句子，我可以帮你判断具体用法。"]}
{"word":"molle","summary":{"en":"“Molle” is mainly seen in botanical Latin, especially in *Schinus molle* (the Peruvian pepper tree), and it means “soft.”","zh":"“molle”主要见于植物学拉丁语，尤其在 *Schinus molle*（秘鲁胡椒树）中出现，含义是“柔软的/软的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Botany) Used as a species name (a Latin epithet) meaning “soft,” and commonly seen in the tree name *Schinus molle* (the Peruvian pepper tree).","zh":"（植物学）作物种名中的拉丁“种加词”，意为“柔软的/软的”；常见于 *Schinus molle*，即“秘鲁胡椒树/粉红胡椒树”。"},"examples":[{"en":"The Peruvian pepper tree is listed in some books as *Schinus molle*.","zh":"秘鲁胡椒树在一些书里标注为 *Schinus molle*。"},{"en":"In botanical Latin, *molle* can describe a plant with soft leaves or soft texture.","zh":"在植物拉丁语里，*molle* 可用来描述叶片或质地“柔软”的植物。"}]},{"partOfSpeech":"n.","definition":{"en":"A short form people sometimes use informally to refer to the Peruvian pepper tree (*Schinus molle*).","zh":"（非正式用法）有时用作简称，指代秘鲁胡椒树（*Schinus molle*）。"},"examples":[{"en":"That “molle” by the sidewalk drops lots of little pink berries.","zh":"人行道旁那棵“molle”会掉很多小粉色浆果。"}]}],"synonyms":["Peruvian pepper tree","pink pepper tree","*Schinus molle*"],"phonetic":"/ˈmɑli/","extraExplanation":["“molle”本身不是常见英语单词，更多出现在学名里（拉丁语/新拉丁语）。在学名中它通常表示某种特征，比如“柔软”。","*Schinus molle* 的果实常被称为 “pink peppercorns（粉红胡椒）”，但它们并不是真正的黑胡椒（*Piper nigrum*）；在饮食或过敏体质方面有时需要注意。"]}
{"word":"molles","summary":{"en":"Molles is most commonly a Latin plural form meaning “soft/gentle,” not a standard English word.","zh":"Molles 多见于拉丁语，作复数形式表示“柔软的/温和的”，并非标准英语词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, plural adjective) “soft,” “gentle,” or “tender” (used to describe multiple people or things).","zh":"（拉丁语，形容词复数）“柔软的 / 温和的 / 娇嫩的”，用于形容多个事物或人。"},"examples":[{"en":"In Latin poetry, *molles* often describes “soft” winds or “gentle” feelings.","zh":"在拉丁诗歌里，*molles* 常用来形容“柔和的”风或“温柔的”情感。"},{"en":"A glossary might explain *molles* as the plural form of *mollis* (“soft”).","zh":"词汇表里可能会说明 *molles* 是 *mollis*（“柔软的”）的复数形式。"}]},{"partOfSpeech":"other","definition":{"en":"A rare proper name (surname/place name) in some contexts.","zh":"在某些语境中可作为专有名词（姓氏或地名），但较少见。"},"examples":[{"en":"“Molles” appears as a family name in some records.","zh":"“Molles” 在一些资料中会作为姓氏出现。"}]}],"synonyms":["soft","gentle","tender","pliant"],"phonetic":"/ˈmɑ.leɪz/","extraExplanation":["*molles* 主要不是英语单词；它更常见于拉丁语学习、古典文学注释或辞典里。","语法提示：*molles* 通常是拉丁语形容词 *mollis* 的复数形式（常见于阴性/阳性主格复数，或某些格的复数形式），用来修饰复数名词。","如果你本来想查英语里的 “moles / molls / mollies”，告诉我句子或上下文，我可以帮你确认正确拼写与含义。"]}
{"word":"mollescence","summary":{"en":"Mollescence means “softening” or “the process of becoming soft,” usually in formal or technical writing.","zh":"Mollescence 指“软化”或“变软的过程”，多用于较正式或技术性写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming soft; softening (often in technical or literary contexts)","zh":"变软；软化的过程（常见于技术或文学语境）"},"examples":[{"en":"Heat and moisture can cause mollescence in certain plastics over time.","zh":"随着时间推移，热和潮气会导致某些塑料发生软化（mollescence）。"},{"en":"In the humid air, the clay showed a slow mollescence and began to lose its sharp edges.","zh":"在潮湿的空气中，黏土慢慢软化（mollescence），开始失去清晰的棱角。"}]}],"synonyms":["softening","softness","pliability","mollification"],"phonetic":"/ˌmɑːˈlɛsəns/","extraExplanation":["该词很少见，来自拉丁语词根 mollis（“柔软的”）。因此 mollescence 指“变得柔软的状态/过程”，有时会出现在医学、生物学或材料学写作中，用来描述组织或材料的“软化”。","常见的、更日常的替换说法包括 softening（软化）、becoming softer（变得更软）。"]}
{"word":"mollescent","summary":{"en":"Mollescent means “becoming soft; gradually softening.”","zh":"Mollescent 表示“正在变软；逐渐软化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"becoming soft; softening gradually (often used in scientific or literary writing)","zh":"正在变软的；逐渐软化的（常见于科学或文学语境）"},"examples":[{"en":"Warm water made the wax mollescent within minutes.","zh":"温水让蜡在几分钟内逐渐变软。"},{"en":"The fruit’s flesh turns mollescent as it ripens.","zh":"水果成熟时，果肉会逐渐变软。"},{"en":"In the poem, the winter light becomes mollescent, losing its sharp edge.","zh":"在诗中，冬日的光线变得柔和，失去了锋利感。"}]}],"synonyms":["softening","becoming softer","mellowing","relaxing"],"phonetic":"/mɑˈlɛsənt/","extraExplanation":["这个词比较少见，更多出现在技术性写作（如生物学、材料学）或偏文学的描写中，用来强调“正在发生的变化”（从硬到软的过程），比 soft 更有“逐渐变软”的动态感。","词源来自拉丁语 *mollis*（柔软的）与 *mollescere*（变软），与 mollify（安抚；使缓和）、malleable（可塑的；有延展性的）在词根上有联系。"]}
{"word":"molleton","summary":{"en":"Molleton is a soft, thick brushed cotton fabric used for warmth, lining, or padding.","zh":"Molleton指一种厚实柔软、表面起绒的棉织物，常用于保暖、做衬里或垫料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, thick cotton fabric with a raised (brushed) surface, often used for padding, lining, or making garments feel warmer and more comfortable","zh":"（一种）厚实柔软、表面起绒的棉织物，常用于做衬里、垫料或让衣物更保暖舒适"},"examples":[{"en":"The tailor added a layer of molleton to the coat to make it warmer.","zh":"裁缝在大衣里加了一层molleton，让它更保暖。"},{"en":"Molleton is often used as a soft lining in jackets and uniforms.","zh":"Molleton常被用作夹克和制服的柔软内衬。"}]}],"synonyms":["cotton flannel","flannel","brushed cotton","padding cloth"],"phonetic":"/ˌmɔləˈtɑn/","extraExplanation":["“molleton”来自法语，词根与“柔软（mou / mol-）”有关；在纺织品语境里通常指“起绒的棉布/棉法兰绒”这一类材料。","在英语里它多见于服装、室内装饰、裁缝与纺织行业用语；日常口语更常用“flannel (cotton flannel)”或直接说“soft brushed cotton”。"]}
{"word":"mollichop","summary":{"en":"A rare word for someone considered too soft or pampered.","zh":"一个罕见词，指被认为太娇气或被惯坏的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, informal, often dialect) A person seen as overly soft, timid, or pampered; a weakling.","zh":"（罕见、非正式，常见于方言）指过于娇气、胆小或被惯坏的人；软弱的人。"},"examples":[{"en":"Stop acting like a mollichop and try again.","zh":"别这么娇气，再试一次。"},{"en":"He was teased as a mollichop because he hated getting his hands dirty.","zh":"因为他讨厌弄脏手，大家就笑他很娇气。"}]}],"synonyms":["weakling","milksop","softy","wimp","mollycoddle"],"phonetic":"/ˈmɑliˌtʃɑp/","extraExplanation":["“mollichop”不是现代标准英语里的常用词，更可能出现在方言、旧文本，或作为拼写变体出现。很多情况下，人们想写的可能是更常见的词 **mollycoddle**（动词：过分娇惯；名词：被娇惯的人）。如果你能提供一句原文语境（出现它的句子/出处），我可以帮你更准确判断含义。"]}
{"word":"mollicrush","summary":{"en":"“mollicrush” isn’t a recognized English dictionary word; it’s likely a name/username or a misspelling.","zh":"“mollicrush”不是常见的词典英语词；更可能是名字/用户名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username/handle, or a made-up name (e.g., “MolliCrush”). If you meant a different word, please share the context or the correct spelling.","zh":"不是标准英文单词。更可能是拼写错误、网名/用户名，或人为造的名字（如“MolliCrush”）。如果你想查的是别的词，请提供上下文或正确拼写。"},"examples":[{"en":"I couldn’t find “mollicrush” in a dictionary; it may be a username or a typo.","zh":"我在词典里找不到“mollicrush”，它可能是用户名或拼写错误。"},{"en":"Can you paste the sentence where you saw “mollicrush”?","zh":"你能把看到“mollicrush”的句子贴出来吗？"}]}],"phonetic":"/ˈmɑliˌkrʌʃ/","extraExplanation":["这个词看起来像是由“Molli/Molly + crush”拼起来的自造词或账号名。不同场景含义可能完全不同（比如昵称、品牌名、游戏ID等）。如果你告诉我它出现的句子/领域（社交媒体、歌曲、小说、游戏等），我可以更准确地解释。","如果你其实想查常见单词，可能是：\n- mollycoddle（过分溺爱/娇惯）\n- mollusc（软体动物）\n- crush（迷恋/暗恋；压碎）\n请确认拼写。"]}
{"word":"mollie","summary":{"en":"Mollie is usually a female name (a spelling of Molly), but in slang it can also refer to MDMA (“molly”).","zh":"Mollie 通常是女性名字（Molly 的一种拼写），但在俚语中也可能指 MDMA（molly）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a variant spelling of Molly).","zh":"女性名字（Molly 的一种拼写变体）。"},"examples":[{"en":"Mollie is starting college this fall.","zh":"Mollie 今年秋天要开始上大学。"},{"en":"I met Mollie through a friend at work.","zh":"我通过工作上的朋友认识了 Mollie。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) MDMA, an illegal drug often called “molly.”","zh":"（俚语）摇头丸/MDMA，一种常被叫作“molly”的非法毒品。"},"examples":[{"en":"Some people use “mollie” to mean the drug MDMA.","zh":"有些人用“mollie”来指代毒品 MDMA。"},{"en":"The festival warned attendees about the dangers of illegal drugs like molly.","zh":"音乐节提醒观众注意像 molly 这类非法药物的危险。"}]}],"synonyms":["Molly","MDMA (slang: molly)"],"phonetic":"/ˈmɑli/","extraExplanation":["“Mollie”通常是女性名，常见形式是“Molly”，历史上多被视为“Mary”的昵称/爱称拼写之一。","在当代口语里，“molly/ Mollie”也可能指 MDMA（毒品）。“Molly”原本暗示“纯的（纯净的）MDMA”，但现实中成分常不可靠，因此相关表达带有明显的社会与安全风险语境。"]}
{"word":"mollienisia","summary":{"en":"“Mollienesia” is an older scientific name for molly fish, now usually classified as Poecilia.","zh":"“Mollienesia”是摩利鱼（molly）的旧学名，如今通常归入Poecilia（花鳉属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical livebearing fish (a molly); “Mollienesia” is an older scientific name once used for mollies, now usually classified in the genus Poecilia.","zh":"一种热带胎生鱼（摩利鱼/玛丽鱼，即“molly”）；“Mollienesia”曾是摩利鱼使用过的较早学名，如今多归入Poecilia（花鳉属）。"},"examples":[{"en":"Many aquarium keepers raise mollies; older books may call them Mollienesia.","zh":"很多水族爱好者会饲养摩利鱼；一些旧书可能把它们称为Mollienesia。"},{"en":"The black molly was once listed under Mollienesia in some references.","zh":"黑摩利在某些资料里曾被列在Mollienesia这个名称之下。"}]}],"synonyms":["molly","Poecilia (modern genus name)"],"phonetic":"/ˌmɑliəˈniːziə/","extraExplanation":["“Mollienesia”常见于较旧的水族书籍或分类资料中，现在更常见的学名体系把摩利鱼归到Poecilia（花鳉属）。如果你是在标签、论文或旧书里看到这个词，多半就是指常见的“molly（摩利鱼）”。","拼写提示：你输入的“mollienisia”很可能是在指“Mollienesia”（少一个字母、且结尾不同）。在查资料时可同时用两种拼写搜索以确认来源。"]}
{"word":"mollient","summary":{"en":"Mollient means “softening or soothing,” especially in formal or medical contexts; it can also (rarely) mean a soothing substance.","zh":"mollient 指“使柔软/舒缓的”，多用于正式或医学语境；也可罕见地指“柔润剂/缓和剂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Softening or soothing; making something less harsh, painful, or irritating (often used in medical or formal writing).","zh":"（使）变柔软的；缓和的；减轻刺激或疼痛的（常见于医学或正式用语）。"},"examples":[{"en":"A mollient cream can help soothe dry, irritated skin.","zh":"润肤（缓和）乳霜可以帮助舒缓干燥、受刺激的皮肤。"},{"en":"The doctor recommended a mollient ointment for the rash.","zh":"医生建议用一种具有缓和作用的软膏来治疗皮疹。"}]},{"partOfSpeech":"n.","definition":{"en":"A softening or soothing substance (rare).","zh":"柔润剂；缓和剂（罕见用法）。"},"examples":[{"en":"In older medical texts, various oils were listed as mollients for the skin.","zh":"在较早的医学文本中，各种油类被列为皮肤用的柔润剂。"}]}],"synonyms":["soothing","softening","mild","lenitive","emollient"],"phonetic":"/ˈmɑl.i.ənt/","extraExplanation":["“mollient”较少出现在日常英语中，更常见的是近义词或相关词：emollient（润肤的/润肤剂）、soothing（舒缓的）、softening（使柔软的）。在护肤品语境里，emollient远比mollient常用。","词源来自拉丁语 mollire（使变软），与“mild（温和的）”在语感上相近，但并非同一个词根。"]}
{"word":"molliently","summary":{"en":"“Molliently” means “gently; in a soothing or softening way,” and it is quite rare in modern English.","zh":"“molliently”意为“温和地；以舒缓或软化的方式”，在现代英语中较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a softening, soothing, or calming way; gently (often in a medicinal or figurative sense).","zh":"以使柔软、舒缓或镇静的方式；温和地（常用于医学或比喻语境）。"},"examples":[{"en":"She spoke molliently, trying to calm the child’s fear.","zh":"她温和地说话，试图安抚孩子的恐惧。"},{"en":"The lotion was applied molliently to relieve the dry, irritated skin.","zh":"乳液被轻柔地涂抹，以缓解干燥、受刺激的皮肤。"}]}],"synonyms":["gently","softly","soothingly","mildly","tenderly"],"phonetic":"/ˈmɑːliəntli/","extraExplanation":["“molliently”在现代英语中非常少见，更常用的词是“gently / soothingly / softly”，在护理或护肤语境里也常见“emollient（润肤的）”。","词源上与拉丁语“mollire（使柔软）”有关，因此它带有“使变软、使缓和”的核心含义；既可指物理上的“软化”，也可指情绪或态度上的“缓和”。"]}
{"word":"mollies","summary":{"en":"“Mollies” most commonly means either (1) several molly fish or (2) multiple people named Molly; in slang, it can also mean MDMA drugs.","zh":"“mollies”最常见是指（1）多条摩利鱼/玛丽鱼，或（2）多个名叫 Molly 的人；在俚语中也可指 MDMA 等毒品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of molly: a small tropical aquarium fish (often black, orange, or spotted)","zh":"molly 的复数：摩利鱼／玛丽鱼（一种常见的热带观赏鱼，常见黑色、橙色或斑点）"},"examples":[{"en":"I keep mollies and guppies in a freshwater tank.","zh":"我在淡水鱼缸里养摩利鱼和孔雀鱼。"},{"en":"Mollies are popular beginner fish because they are usually hardy.","zh":"摩利鱼很受新手欢迎，因为它们通常比较好养。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of Molly: a female given name (informal form of Mary)","zh":"Molly 的复数：女性名字（Mary 的常见昵称/非正式形式）"},"examples":[{"en":"There are two Mollies in my class.","zh":"我们班里有两个叫 Molly 的同学。"},{"en":"The invitation was addressed to the Mollies in the family.","zh":"请柬写给家里几位名叫 Molly 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal slang) plural of molly: MDMA/ecstasy as a street drug","zh":"（非正式俚语）molly 的复数：指 MDMA/“摇头丸”等街头毒品"},"examples":[{"en":"The school warned students about the dangers of “mollies.”","zh":"学校提醒学生注意所谓“mollies”的危险性。"},{"en":"He said the pills were mollies, but you can’t know what’s really in them.","zh":"他说那些药片是“mollies”，但你无法确定里面到底有什么成分。"}]}],"synonyms":["molly fish","Molly (name)","MDMA (slang sense)"],"phonetic":"/ˈmɑliz/","extraExplanation":["“molly”在俚语里常被当作“纯MDMA”的说法，但现实中非法药物常被掺假或成分不明，因此相关表达多出现在安全警示、新闻或对话中。写作或正式场合建议避免使用该俚语，或明确用“MDMA”表达。"]}
{"word":"mollifiable","summary":{"en":"Mollifiable means “able to be calmed or persuaded to soften,” especially after anger or conflict.","zh":"mollifiable 指“可被安抚/可被说服而缓和态度的”，多用于较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be calmed, soothed, or made less angry or upset","zh":"可被安抚的；可被缓和怒气或情绪的"},"examples":[{"en":"The child was upset at first, but she was mollifiable with a gentle voice and a snack.","zh":"孩子一开始很生气，但用温柔的语气再给点零食就能安抚下来。"},{"en":"Some customers are mollifiable if you apologize and offer a quick solution.","zh":"有些顾客只要你道歉并迅速给出解决方案，就能被安抚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(formal) open to persuasion or compromise; willing to soften a position","zh":"（正式）可被说服的；愿意妥协、软化立场的"},"examples":[{"en":"After a long discussion, the manager became mollifiable and agreed to a revised schedule.","zh":"经过长时间讨论，经理态度缓和，接受了修改后的时间表。"},{"en":"The committee seemed mollifiable once the risks were explained clearly.","zh":"风险解释清楚后，委员会看起来就比较愿意让步了。"}]}],"synonyms":["appeasable","soothable","pacifiable","placable","amenable"],"phonetic":"/ˈmɑːlɪˌfaɪ.ə.bəl/","extraExplanation":["词源提示：mollifiable 来自动词 mollify（安抚、平息），其根源可追溯到拉丁语 mollis，意为“柔软的”。因此这个词带有“把情绪/态度变柔和”的形象含义。","语体与使用：mollifiable 比较少见，偏正式/书面语。日常表达中更常用 easier to calm, easy to appease, can be soothed 等。"]}
{"word":"mollification","summary":{"en":"Mollification means soothing or reducing the severity of something—like pain, anger, or strict rules.","zh":"mollification 指“缓和、减轻、安抚”，常用于减轻痛苦、平息愤怒或放宽严厉规定等正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making something less harsh, severe, painful, or upsetting; soothing or calming","zh":"缓和；减轻（严厉、痛苦或不快）；安抚"},"examples":[{"en":"The new policy was meant as a mollification of the earlier, stricter rules.","zh":"新政策旨在缓和先前更严格的规定。"},{"en":"A sincere apology can be a mollification, but it doesn’t erase the mistake.","zh":"真诚的道歉可以起到安抚作用，但并不会抹去错误。"},{"en":"The medicine provided some mollification of the pain.","zh":"这种药在一定程度上减轻了疼痛。"}]}],"synonyms":["soothing","relief","mitigation","alleviation","appeasement"],"phonetic":"/ˌmɑːləfəˈkeɪʃən/","extraExplanation":["词根提示：mollification 来自动词 mollify（使……缓和/安抚），其拉丁语词根 mollis 意为“柔软的”。所以它常带有“让情绪/措施变得更软、更不尖锐”的感觉。","常见搭配：a mollification of + 名词（对……的缓和）；offer/seek mollification（提供/寻求安抚或缓和措施）。语气偏正式，常见于新闻、评论、法律或公共政策语境。","近义词辨析：mollification 强调“缓和强度、降低冲突”；consolation 更偏“安慰（失落、悲伤的人）”；appeasement 常含“为平息对方而让步”的政治色彩，有时带负面意味（可能助长对方）。"]}
{"word":"mollifications","summary":{"en":"Mollifications are actions or words that soothe tension or make something seem less severe.","zh":"Mollifications 指用言行来安抚、缓和紧张，或让事情显得没那么严重。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making something less severe, painful, or intense; soothing or calming (often after conflict or criticism)","zh":"（使某事）变得不那么严重、痛苦或激烈；安抚、缓和（常用于冲突或批评之后）"},"examples":[{"en":"The manager offered mollifications to calm the angry customers.","zh":"经理做出一些安抚措施来平息愤怒的顾客。"},{"en":"After the argument, a sincere apology was the best mollification.","zh":"争吵之后，真诚的道歉是最好的缓和方式。"}]},{"partOfSpeech":"n.","definition":{"en":"a mild explanation or statement meant to reduce blame or make a negative situation sound less bad","zh":"（为减轻责任或弱化负面影响而作的）缓和性解释；辩解式的安抚说法"},"examples":[{"en":"His mollifications didn’t change the fact that he missed the deadline.","zh":"他的那些缓和性解释并不能改变他错过截止日期的事实。"},{"en":"She added a few mollifications, saying the mistake was understandable.","zh":"她补充了几句缓和的话，说这个错误可以理解。"}]}],"synonyms":["appeasements","soothing words","concessions","pacifications","mitigations"],"phonetic":"/ˌmɑləfəˈkeɪʃənz/","extraExplanation":["“mollification”来自拉丁语 mollis（柔软的），核心含义是“使变软、使变温和”。在现代英语中多用于正式场合，指用道歉、让步、解释或安抚性举措来“缓和紧张局势”。","你输入的是复数形式 mollifications，单数是 mollification；可数或不可数都常见（e.g., offer mollification / offer mollifications）。"]}
{"word":"mollified","summary":{"en":"Mollified means “calmed down or made less angry,” and it’s also the past form of mollify.","zh":"mollified 表示“被安抚、情绪被缓和”，也是动词 mollify 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"calmed down; made less angry or upset","zh":"被安抚的；情绪被缓和的（不那么生气或难过）"},"examples":[{"en":"She was mollified by the apology and agreed to talk again.","zh":"她被道歉安抚了，愿意再谈一次。"},{"en":"A small refund mollified some of the customers.","zh":"一小笔退款让一些顾客的情绪缓和了。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “mollify”: to calm someone and reduce anger or anxiety","zh":"“mollify”的过去式/过去分词：安抚（某人），缓解愤怒或焦虑"},"examples":[{"en":"The manager mollified the guests with a sincere explanation.","zh":"经理用真诚的解释安抚了客人。"},{"en":"He tried to mollify his friend after the argument.","zh":"争吵后他试图安抚朋友。"}]}],"synonyms":["calmed","soothed","appeased","placated","pacified"],"phonetic":"/ˈmɑl.ə.faɪd/","extraExplanation":["“mollify”常用于比较正式的语境，尤其是写作或新闻里，强调“让强烈的不满/愤怒变得没那么尖锐”。","词源来自拉丁语 *mollis*（“柔软的”），引申为“使态度/情绪变柔和”。","近义词区分：*calm* 偏“让情绪平静”；*appease* 更像“用让步/满足要求来平息（可能带有‘息事宁人’的感觉）”；*placate* 也常指“为了不让对方生气而安抚”，语气更强。"]}
{"word":"mollifiedly","summary":{"en":"“Mollifiedly” means “in a soothed or appeased way,” after someone’s anger or upset feelings have been calmed.","zh":"“mollifiedly”表示“被安抚后语气/态度变缓和地”，强调原本生气或不满的人情绪被平息。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a mollified way; in a calmer, less angry, or more satisfied manner after being upset","zh":"（在被安抚后）语气/态度变得缓和地；不再生气地；较为满意地"},"examples":[{"en":"After the manager apologized, she nodded mollifiedly and agreed to continue the meeting.","zh":"经理道歉后，她缓和地点了点头，同意继续开会。"},{"en":"He listened to the explanation and replied mollifiedly, no longer arguing.","zh":"他听完解释后语气缓和地回应，不再争辩。"},{"en":"The child accepted the toy mollifiedly and stopped crying.","zh":"孩子被哄好后平静地接过玩具，不再哭了。"}]}],"synonyms":["appeasedly","placatedly","soothingly","calmly"],"phonetic":"ˈmɑːləˌfaɪdli","extraExplanation":["“mollifiedly”来自动词“mollify”（安抚、使平息），词根可追溯到拉丁语 *mollis*（柔软的），带有“把情绪变柔和”的形象感。","该词比较书面、偏文学/叙述风格；日常口语里更常用“calmly / more calmly / in a calmer tone / less angrily”等来表达类似意思。"]}
{"word":"mollifier","summary":{"en":"A mollifier is something that softens or soothes—literally (like a skin-softening ingredient) or figuratively (like an action that calms tension).","zh":"mollifier 指能“使之变柔、变缓和”的东西：既可指润肤/柔软成分，也可比喻指安抚、缓和矛盾的举措。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or ingredient that softens, smooths, or soothes (especially the skin or a surface).","zh":"（尤指护肤或材料用的）润肤剂；柔软剂；缓和刺激的成分。"},"examples":[{"en":"This cream contains a mollifier that helps reduce dryness.","zh":"这款面霜含有润肤成分，有助于减轻干燥。"},{"en":"Adding a mollifier can make the fabric feel less rough.","zh":"加入柔软剂能让布料摸起来不那么粗糙。"}]},{"partOfSpeech":"n.","definition":{"en":"something (such as a remark or action) that calms anger or eases tension; a pacifying influence.","zh":"（言语或行为等）缓和矛盾的事物；安抚手段。"},"examples":[{"en":"His apology was meant as a mollifier after the argument.","zh":"争吵之后，他的道歉是为了缓和局面。"},{"en":"The small discount acted as a mollifier for unhappy customers.","zh":"小折扣起到了安抚不满顾客的作用。"}]}],"synonyms":["emollient","softener","soothing agent","calming influence","pacifier"],"phonetic":"/ˈmɑlɪˌfaɪər/","extraExplanation":["词源上与拉丁语 *mollis*（“柔软的”）有关，所以 **mollifier** 的核心感觉是“让东西变柔、变顺、变不刺激”。在护肤品语境里常接近 **emollient**（润肤剂），但 *mollifier* 更强调“缓和/减少刺激”的作用。","在写作或新闻里，*mollifier* 的比喻用法常指“安抚公众/对方的举措”，语气偏正式。"]}
{"word":"mollifiers","summary":{"en":"Mollifiers are things that soften (especially skin) or calm down tension and conflict.","zh":"mollifiers 指能软化（尤其是皮肤）或用来缓和紧张与冲突的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (often creams or oils) used to soften, soothe, or protect the skin; emollients.","zh":"（常指乳霜或油类）用于软化、舒缓或保护皮肤的物质；润肤剂。"},"examples":[{"en":"This lotion contains mollifiers that help dry skin feel softer.","zh":"这款乳液含有润肤剂，能让干燥的皮肤感觉更柔软。"},{"en":"Doctors often recommend gentle mollifiers for eczema.","zh":"医生常建议湿疹患者使用温和的润肤剂。"}]},{"partOfSpeech":"n.","definition":{"en":"Things (such as words, actions, or policies) that reduce anger, tension, or conflict; something that calms or appeases.","zh":"（如言语、行动或政策等）用来缓和怒气、紧张或冲突的东西；安抚手段。"},"examples":[{"en":"The manager offered a sincere apology as a mollifier after the mistake.","zh":"经理在出错后真诚道歉作为安抚手段。"},{"en":"Small concessions can act as mollifiers in a heated negotiation.","zh":"在激烈的谈判中，小让步可以起到缓和作用。"}]}],"synonyms":["emollients","soothers","softeners","appeasers","pacifiers"],"phonetic":"/ˈmɑːlɪˌfaɪər/","extraExplanation":["“mollifiers”是复数形式，单数为“mollifier”。在护肤语境里它常与“emollient（润肤剂）”接近；在社会或职场语境里则更偏“缓和矛盾的措施/话语”。","词源与拉丁语 mollis（柔软的）有关，因此核心感觉是“让事情/皮肤变得更柔和”。"]}
{"word":"mollifies","summary":{"en":"“Mollifies” means “calms or soothes,” especially by reducing anger or making something less harsh.","zh":"“mollifies”意为“安抚、使平静；缓和、减轻（严厉或不利影响）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to calm someone down or make them less angry or upset; to soothe","zh":"使（某人）平静下来；安抚；缓和（怒气或不满）"},"examples":[{"en":"A sincere apology mollifies her, and she starts listening again.","zh":"一句真诚的道歉安抚了她，她又开始愿意听了。"},{"en":"The manager offered a refund to mollify the customer.","zh":"经理提出退款来安抚那位顾客。"},{"en":"Nothing mollifies him when he feels he has been treated unfairly.","zh":"当他觉得自己被不公平对待时，什么都无法安抚他。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something less severe, harsh, or painful; to soften","zh":"减轻；缓和；使（情况/语气/影响）不那么严厉或痛苦"},"examples":[{"en":"The new policy is meant to mollify the impact of rising prices.","zh":"这项新政策旨在缓和物价上涨带来的影响。"},{"en":"She tried to mollify her tone so she wouldn’t sound rude.","zh":"她努力缓和语气，以免听起来无礼。"}]}],"synonyms":["soothes","calms","pacifies","appeases","placates","assuages","softens"],"phonetic":"/ˈmɑləˌfaɪz/","extraExplanation":["“mollifies”是动词“mollify”的第三人称单数现在时（he/she/it mollifies）。常见搭配：mollify someone / mollify anger / mollify fears / mollify the impact。","词源提示：来自拉丁语 mollis（“柔软的”），因此它常带有“把情绪或局面‘软化’”的感觉。"]}
{"word":"mollify","summary":{"en":"Mollify means to calm someone down or to make something less harsh.","zh":"Mollify 指安抚情绪、平息怒气，也可指缓和某事的严厉或强度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone less angry or upset; to calm or soothe feelings","zh":"安抚；平息（某人的愤怒或不满）；使情绪缓和"},"examples":[{"en":"She tried to mollify her boss by apologizing and offering a solution.","zh":"她通过道歉并提出解决方案来安抚老板。"},{"en":"A small refund helped mollify the angry customer.","zh":"一小笔退款帮助平息了愤怒顾客的情绪。"},{"en":"Nothing he said could mollify the crowd after the delay.","zh":"延误之后，他说什么都无法平息人群的怒气。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something less severe, harsh, or intense; to soften","zh":"缓和；减轻（严厉程度、强度或影响）；使变得不那么苛刻"},"examples":[{"en":"The new policy was meant to mollify the effects of rising prices.","zh":"新政策旨在缓和物价上涨带来的影响。"},{"en":"Adding humor can mollify the harsh tone of a message.","zh":"加入幽默可以缓和信息中生硬的语气。"}]}],"synonyms":["calm","soothe","pacify","placate","appease","soften"],"phonetic":"/ˈmɑləˌfaɪ/","extraExplanation":["词源上来自拉丁语 *mollis*（“柔软的”），所以 **mollify** 的核心感觉是“把情绪/态度变软”。","用法提示：**mollify** 常用于“安抚对方情绪”，语气比 *calm* 更正式，常出现在新闻、商务沟通、写作中。","近义词区别：*appease* 往往强调“让对方满意以避免麻烦”（有时带“讨好/息事宁人”的负面含义）；*placate* 也很像但更强调“平息怒气”；*soothe* 更偏“温柔地安抚、抚慰”。"]}
{"word":"mollifying","summary":{"en":"Mollifying means calming anger or easing tension—making something feel less harsh or intense.","zh":"mollifying 表示安抚情绪、缓和紧张，让人或事情不那么激烈或尖锐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Calming someone who is angry or upset; making a tense situation feel less severe.","zh":"（使人或局势）平静下来；安抚、缓和（愤怒或紧张）。"},"examples":[{"en":"She spoke in a mollifying tone to calm the customer down.","zh":"她用安抚的语气说话，让顾客冷静下来。"},{"en":"A quick apology can be mollifying when feelings are hurt.","zh":"当感情受伤时，一句及时的道歉往往能起到安抚作用。"},{"en":"He offered a mollifying explanation to reduce the tension in the room.","zh":"他给出一个缓和性的解释，降低了房间里的紧张气氛。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “mollify”: to calm or soothe someone; to make something less harsh or intense.","zh":"“mollify”的现在分词：安抚（某人）；使（事物）缓和、减轻尖锐或激烈程度。"},"examples":[{"en":"He was mollifying his friend with jokes and reassurance.","zh":"他用玩笑和安慰在安抚朋友。"},{"en":"The manager kept mollifying the crowd as they waited longer than expected.","zh":"经理在大家等待超出预期时不断安抚人群。"}]}],"synonyms":["calming","soothing","appeasing","placating","pacifying"],"phonetic":"/ˈmɑːləˌfaɪɪŋ/","extraExplanation":["“mollify”来自拉丁语词根 *mollis*（柔软的），核心感觉是“把硬的、冲的、尖锐的变软”。所以它既可指安抚人的情绪，也可指让语气、态度、规则等“变得不那么严厉”。","常见搭配：mollify someone / mollify one’s anger / a mollifying gesture, tone, smile（安抚性的动作/语气/微笑）。","与近义词区别：soothe 更偏“抚慰、安慰（像哄孩子或安抚疼痛）”；pacify 常指“平息冲突、镇压式地让人安静”，语气更强；appease 常带“通过让步来平息不满”的意味。"]}
{"word":"mollifyingly","summary":{"en":"Mollifyingly means “in a soothing, calming way that reduces anger or tension.”","zh":"mollifyingly 表示“以安抚、缓和情绪（怒气或紧张）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a calming or soothing way, especially to reduce someone’s anger, worry, or tension.","zh":"以安抚的方式；（尤指）以缓和怒气、焦虑或紧张的方式。"},"examples":[{"en":"She spoke mollifyingly, trying to calm the angry customer.","zh":"她以安抚的语气说话，试图让愤怒的顾客冷静下来。"},{"en":"He raised his hands mollifyingly and said, “Let’s talk.”","zh":"他安抚性地举起双手，说：“我们谈谈。”},{"}]}],"synonyms":["soothingly","calmingly","placatingly","reassuringly","gently"],"phonetic":"/ˈmɑləˌfaɪɪŋli/","extraExplanation":["词源提示：mollifyingly 来自动词 mollify（安抚、缓和），mollify 源于拉丁语 mollis（“柔软的”）。因此这个词常带有“把情绪变柔和”的画面感。","语用提醒：mollifyingly 常用来描写说话的语气、手势或态度（mollifyingly + spoke/said/smiled/gestured），通常表示“缓和局面”，不一定意味着真正解决问题。"]}
{"word":"mollifyingness","summary":{"en":"“Mollifyingness” means the quality of being calming or soothing, especially in a tense situation.","zh":"“mollifyingness”指安抚性，即在紧张局面中起到缓和、平息作用的特质或效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being mollifying; a calming or soothing effect that reduces anger, tension, or conflict","zh":"（较少用）安抚性；缓和、平息怒气或紧张气氛的特质或效果"},"examples":[{"en":"Her mollifyingness helped the team continue the discussion without arguing.","zh":"她的安抚性让团队能继续讨论而不吵起来。"},{"en":"A sincere apology has a quiet mollifyingness that can lower people’s defenses.","zh":"真诚的道歉有一种安静的缓和力量，能降低人们的防备。"},{"en":"He spoke with mollifyingness, trying to cool everyone down.","zh":"他说话带着安抚的语气，想让大家冷静下来。"}]}],"synonyms":["mollification","soothing quality","calming effect","pacification"],"phonetic":"ˈmɑl.əˌfaɪ.ɪŋ.nəs","extraExplanation":["“mollifyingness”并不是常见词，更自然的表达通常是：the mollifying effect（安抚的效果）、mollification（安抚/缓和）、soothing quality（抚慰的特质），或直接用形容词 mollifying（安抚的）。","构词上，它来自动词 mollify（安抚、平息）→ 形容词 mollifying（起安抚作用的）→ 名词后缀 -ness（……的性质/状态）。在正式写作里更常用 mollification。"]}
{"word":"molligrant","summary":{"en":"Molligrant means (archaically) grumbly, complaining, or sulky.","zh":"molligrant（古用）指爱抱怨、嘟囔不满或闷闷不乐的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Complaining or grumbling in a low, dissatisfied way; peevish or sulky.","zh":"（古用）爱抱怨的；低声嘟囔、不满的；闷闷不乐、脾气不好的。"},"examples":[{"en":"He grew molligrant after waiting for hours with no news.","zh":"等了好几个小时都没消息，他变得很molligrant（开始抱怨、不高兴）。"},{"en":"Don’t be molligrant—tell me what’s bothering you.","zh":"别闹情绪、别老抱怨——告诉我你在烦什么。"}]}],"synonyms":["grumpy","grouchy","peevish","sulky","querulous"],"phonetic":"/ˈmɑləɡrənt/","extraExplanation":["这是一个较少见、偏古老的词（现代英语里几乎不用），意思接近“爱嘟囔/爱抱怨、情绪低落、闷闷不乐”。日常表达更常用：grumpy（脾气坏的）、grouchy（爱发牢骚的）、complainy（爱抱怨的）、sulky（闷闷不乐的）。","你可能会在老小说、戏剧对白或模仿“古风/方言”的写法中见到它，用来刻画人物的不满情绪。"]}
{"word":"molligrubs","summary":{"en":"Molligrubs means feeling sad or gloomy (an old-fashioned word).","zh":"molligrubs 指“情绪低落、忧郁”，是一个很古旧的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) a feeling of sadness, gloom, or low spirits.","zh":"（古旧用法）忧郁、沮丧、闷闷不乐的情绪。"},"examples":[{"en":"I’ve got the molligrubs today, so I’d rather stay home and rest.","zh":"我今天有点“molligrubs”（情绪低落），所以更想待在家里休息。"},{"en":"A long stretch of rainy weather can give some people the molligrubs.","zh":"连续的阴雨天会让一些人感到心情郁闷。"}]}],"synonyms":["the blues","low spirits","gloom","melancholy","feeling down"],"phonetic":"/ˈmɑliˌɡrʌbz/","extraExplanation":["这是一个非常少见、带点幽默感的古词（多见于18–19世纪的英语），现代口语里几乎不用。更常见的表达是：the blues, feeling down, in low spirits。","拼写常见为复数 molligrubs，但表达的是一种“情绪状态”，用法上类似于 the blues。"]}
{"word":"mollipilose","summary":{"en":"Mollipilose means “covered with soft, fine hair,” mainly used in scientific descriptions.","zh":"mollipilose 指“覆盖着柔软细毛的”，主要用于科学/学术描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having soft, fine hair; softly hairy (often describing plants or animals).","zh":"（常用于描述植物或动物）长有柔软细毛的；软毛覆盖的。"},"examples":[{"en":"The botanist noted the mollipilose surface of the leaves under the microscope.","zh":"植物学家在显微镜下观察到叶片表面覆盖着柔软细毛。"},{"en":"Some desert plants are mollipilose to reduce water loss and reflect sunlight.","zh":"一些沙漠植物长有柔软细毛，以减少水分流失并反射阳光。"}]}],"synonyms":["downy","soft-haired","softly hairy","pubescent"],"phonetic":"/ˌmɑːləˈpaɪloʊs/","extraExplanation":["这个词非常少见，多见于植物学、动物学等偏学术的描述性语境。","词源上可拆成 molli-（“柔软”，来自拉丁语 mollis）+ pilose（“多毛的”，与拉丁语 pilus“毛”有关），合起来就是“柔毛的/软毛覆盖的”。","常见近义表达在日常英语里更可能用 downy（覆绒毛的/像绒毛一样的）或 softly hairy（柔毛的）。"]}
{"word":"mollisiaceae","summary":{"en":"Mollisiaceae is a scientific name for a family of fungi, often small cup/disc-shaped species found on plant material.","zh":"Mollisiaceae 是真菌的一个科名（小盘菌科），常见为小型杯状/盘状真菌，多与植物材料相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of fungi (in the order Helotiales) that includes small, often cup- or disc-shaped species, many of which live on decaying plant material or as plant-associated fungi","zh":"（真菌分类）小盘菌科：一类隶属于盘菌目（Helotiales）的真菌科，常见为小型杯状或盘状子实体；许多种类生活在腐烂植物材料上，或与植物相关（如内生、弱寄生等）"},"examples":[{"en":"Mollisiaceae is a family of ascomycete fungi commonly studied in forest litter and plant tissues.","zh":"小盘菌科（Mollisiaceae）属于子囊菌，常见于森林枯落物和植物组织中，研究时经常会遇到。"},{"en":"In a taxonomy paper, the author compared DNA sequences across several genera in Mollisiaceae.","zh":"在一篇分类学论文中，作者比较了小盘菌科多个属之间的 DNA 序列。"}]}],"phonetic":"/ˌmɑlɪsiˈeɪʃiˌi/","extraExplanation":["这是一个“拉丁化的科学名称”（taxonomic name），通常在学术写作中首字母大写（Mollisiaceae），且多用斜体或保持统一格式（不同期刊规范略有差异）。","此类名称主要用于生物分类与检索：比“属（genus）”更高一级，比“目（order）”更低一级。日常英语对话中很少使用，更多见于真菌学、生态学与植物病理学文献。"]}
{"word":"mollisiose","summary":{"en":"“mollisiose” is not a standard English word; it’s likely a misspelling or a non-English/technical term.","zh":"“mollisiose”不是标准英语词；很可能是拼写错误或外语/专业术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a non-English/technical term. If you share the sentence where you saw it, I can identify the intended word and explain it.","zh":"不是标准英语单词。很可能是拼写错误，或来自其他语言/专业领域的词。如果你提供它出现的句子，我可以帮你判断原词并解释含义。"},"examples":[{"en":"I couldn’t find “mollisiose” in an English dictionary—could you show me the context?","zh":"我在英语词典里找不到“mollisiose”——你能把它出现的上下文发我吗？"},{"en":"It may be a typo; words like “mollify” or “mellifluous” sometimes get misspelled.","zh":"它可能是拼写错误；像“mollify（安抚）”或“mellifluous（甜美悦耳的）”这类词有时会被拼错。"}]}],"phonetic":"/ˌmɑləˈsiːoʊz/","extraExplanation":["“mollisiose”看起来像把拉丁词根（moll-，与“柔软”相关）和英语/医学后缀（-osis）混在一起，但英语里没有这个常用词条。","你可以核对：1）是否为“mollusc…（软体动物相关）”一类的拼写；2）是否为“mellifluous（声音甜美悦耳的）”或“mollify（安抚、缓和）”的误拼；3）是否来自法语/意大利语/葡语等外来语。把原句贴出来通常能立刻确定。"]}
{"word":"mollisol","summary":{"en":"Mollisol: a very fertile, dark grassland soil with a thick organic-rich top layer.","zh":"Mollisol：一种典型草原肥沃土壤，表层厚、深色、富含有机质（常译“黑钙土”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rich, dark, grassland soil with a thick, fertile top layer (high in organic matter), common in prairies and other temperate regions; a major soil type in U.S. soil classification.","zh":"一种肥沃、颜色较深的草原土壤，表层（腐殖质层）厚、含有机质高，常见于温带草原；也是美国土壤分类体系中的重要土纲。"},"examples":[{"en":"Much of the U.S. Corn Belt is built on highly productive mollisols.","zh":"美国玉米带的许多地区都分布着高产的黑钙土（Mollisols）。"},{"en":"Because mollisols are naturally fertile, they are widely used for farming.","zh":"由于黑钙土天然肥沃，它们被广泛用于农业种植。"},{"en":"Grass roots help form the thick, dark topsoil typical of mollisols.","zh":"草类的根系有助于形成黑钙土典型的厚而深色的表土层。"}]}],"synonyms":["black soil","prairie soil","grassland soil"],"phonetic":"/ˈmɑlɪˌsɔl/","extraExplanation":["Mollisol 是美国土壤分类（USDA Soil Taxonomy）里的一个“土纲（soil order）”名称，常译为“黑钙土”。它的核心特征之一是有一个较厚、颜色较深、富含有机质的表层（常称为 mollic epipedon）。","这个词多用于地理、农学、环境科学等语境；日常英语里较少见。发音里重音通常在第一个音节：MOL-li-sol。"]}
{"word":"mollities","summary":{"en":"Mollities is a rare formal word meaning abnormal softness (often medical), and sometimes moral weakness.","zh":"mollities 是一个罕见的正式用词，主要指（医学上）异常柔软/软化，也可引申为（道德或意志上的）软弱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, formal) Softness or lack of firmness (especially of body tissue); sometimes used for weakness or “over-delicacy.”\nExamples: \n• The doctor noted the mollities of the tissue. / 医生注意到组织异常柔软。\n• Some older writers used “mollities” to criticize moral weakness. / 一些旧时作家用 mollities 批评意志薄弱。","zh":"（罕见；正式）柔软、缺乏坚实度（尤指身体组织的软化）；有时也引申指软弱或“过于娇弱”。\n例：\n• 医生注意到组织的 mollities（异常柔软/软化）。\n• 一些旧时作者用 mollities 来批评道德或意志上的软弱。"},"examples":[{"en":"The examination suggested mollities of the affected tissue.","zh":"检查显示患处组织有软化现象。"},{"en":"In older moral writing, mollities could mean a kind of self-indulgent weakness.","zh":"在较早的道德写作中，mollities 可指一种放纵式的软弱。"}]}],"synonyms":["softness","flaccidity","softening","weakness","effeminacy (older/critical use)"],"phonetic":"/ˈmɑlɪˌtiz/","extraExplanation":["这个词来自拉丁语 mollities（意为“柔软、软弱”），与 mollis（“柔软的”）同源。英语里非常少见，多见于旧式/学术表达或医学语境。","医学史上常见搭配如 mollities ossium（字面“骨的软化”），与“骨软化症（osteomalacia）”相关。现代英语更常用 plain words：softness、flaccidity、tissue softening 等。"]}
{"word":"mollitious","summary":{"en":"Mollitious means “soft or soothing; gentle and calming” (a rare word).","zh":"mollitious 意为“柔软的、温和舒缓的”（很罕见的词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Soft, smooth, or gentle; tending to make something less harsh or more soothing.","zh":"（罕见）柔软的；温和的；有缓和、抚慰作用的。"},"examples":[{"en":"A mollitious breeze cooled the hot afternoon.","zh":"一阵温柔的微风给炎热的下午带来凉意。"},{"en":"Her mollitious words eased the tension in the room.","zh":"她温和的言语缓解了房间里的紧张气氛。"},{"en":"The cream has a mollitious effect on dry skin.","zh":"这种乳霜对干燥皮肤有柔润、舒缓的作用。"}]}],"synonyms":["soothing","gentle","soft","calming","mollifying","mollient"],"phonetic":"/məˈlɪʃəs/","extraExplanation":["“mollitious”是非常少见的词，来自拉丁语词根 *mollis*（柔软的），常见同根词包括 “mollify”（缓和、安抚）和 “mollient”（润肤的、缓和的）。","学习时要注意不要和常见词 “malicious”（恶意的）混淆：两者拼写相近，但意思相反。写作中通常用更常见的词替代，如 “soothing / gentle / soft / calming”。"]}
{"word":"mollitude","summary":{"en":"Mollitude means softness or gentleness, especially in someone’s tone or character (sometimes implying weakness).","zh":"Mollitude 指“柔和/温柔”，尤指语气或性格上的柔软（有时含“软弱”之意）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"softness or tenderness in feeling, character, or expression; gentleness (sometimes used critically to suggest weakness).","zh":"（性格、情感或表达上的）柔和、温柔；（有时带贬义）软弱、缺乏刚强。"},"examples":[{"en":"Her voice had a quiet mollitude that calmed the room.","zh":"她的声音带着一种安静的柔和感，让整个房间都平静下来。"},{"en":"The critic argued that the novel’s mollitude weakened its message.","zh":"评论家认为这部小说的“过度柔软”削弱了它的主旨。"}]},{"partOfSpeech":"n.","definition":{"en":"physical softness; a lack of firmness.","zh":"（物理上的）柔软；不够坚实。"},"examples":[{"en":"The fabric’s mollitude made it comfortable to wear.","zh":"这块布料的柔软让它穿起来很舒服。"}]}],"synonyms":["gentleness","softness","tenderness","mildness"],"phonetic":"/ˈmɑlɪˌtuːd/","extraExplanation":["“mollitude”较少见，常见于较文学化或正式的语境。它来自拉丁语词根 *mollis*（柔软的），与 “mollify”（安抚、使缓和）和 “mollusk”（软体动物，原意与“柔软”相关）同源。","语气提示：用它形容人的“温柔”多半偏书面；若用于批评，常暗含“过于软弱、不够坚定”的评价。"]}
{"word":"molls","summary":{"en":"“Molls” is the plural of “moll,” usually meaning a gangster’s female companion in old crime contexts; a second, dated meaning is insulting and best avoided.","zh":"“molls”是“moll”的复数，通常指老式犯罪语境中黑帮的女性同伴；另一个含义带侮辱性且已过时，建议避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A female companion or girlfriend of a gangster or criminal; often used in old crime stories.","zh":"（俚语）黑帮或罪犯的女性同伴/女友；常见于老式犯罪故事。"},"examples":[{"en":"In the movie, the gangster and his molls flee the city after the robbery.","zh":"在电影里，黑帮和他的女伴们抢劫后逃离了城市。"},{"en":"The detective questioned the moll about where the gang was hiding.","zh":"侦探盘问那位黑帮女伴，问她帮派藏在哪里。"}]},{"partOfSpeech":"n.","definition":{"en":"(dated, often offensive) A woman described as sexually promiscuous. (Be careful: this sense can be insulting.)","zh":"（过时且常带冒犯）用来贬低女性“随便/放荡”的说法。（注意：可能很无礼）"},"examples":[{"en":"That word is dated and insulting, so it’s better to avoid using it.","zh":"这个词既过时又带侮辱性，最好避免使用。"}]}],"synonyms":["girlfriend (context-dependent)","companion","associate (in crime context)"],"phonetic":"/mɑl/","extraExplanation":["“moll”常出现在20世纪早期的犯罪小说、黑色电影（film noir）和新闻报道里，带有浓厚的时代与类型片色彩。现代英语里更常用更中性的说法，如 “girlfriend/partner/associate”。","“molls”也可能在某些语境里被误写或简写成“mollusks/molluscs（软体动物）”的意思；如果你看到的是生物学或海洋主题文本，建议回看上下文确认。"]}
{"word":"molluginaceae","summary":{"en":"Molluginaceae: the carpetweed family, a botanical plant family name.","zh":"Molluginaceae：地毯草科，一个植物学上的“科”级分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the carpetweed family) that includes small flowering plants such as carpetweeds, often found in warm or dry regions","zh":"一种植物科（地毯草科），包含地毯草等小型开花植物，常见于温暖或干燥地区"},"examples":[{"en":"Carpetweed is a common plant in the Molluginaceae family.","zh":"地毯草（carpetweed）是地毯草科（Molluginaceae）里较常见的一种植物。"},{"en":"In botany class, we learned how Molluginaceae species can tolerate dry soil.","zh":"在植物学课上，我们学习了地毯草科的一些物种如何耐受干旱土壤。"}]}],"synonyms":["carpetweed family"],"phonetic":"/ˌmɑl.juːˈɡɪn.eɪ.siːˌiː/","extraExplanation":["Molluginaceae 是植物分类学中的“科名”，常见中文名是“地毯草科”。这类词多用于学术写作、植物志、标本标签或园艺资料中，日常英语里不常用。","科名通常来自代表属名（这里与 Mollugo 等属有关），并以 -aceae 结尾，这是植物科名的常见拉丁化后缀（表示“……科”）。"]}
{"word":"mollugo","summary":{"en":"Mollugo is a botanical genus name for carpetweeds—low, spreading plants often considered weeds.","zh":"Mollugo 是植物学上的属名，指地毯草一类贴地蔓生、常被视为杂草的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the genus Mollugo (carpetweeds), usually a low-growing weed with small flowers, found in warm or temperate regions","zh":"一种“粘毛菜属（Mollugo）”植物（常称地毯草/地毯状杂草），多为贴地生长的小型杂草，开细小花，常见于温暖或温带地区"},"examples":[{"en":"Carpetweed (Mollugo verticillata) can spread quickly across dry, sandy soil.","zh":"地毯草（Mollugo verticillata）能在干燥的沙质土壤上快速蔓延。"},{"en":"The gardener pulled up mollugo from between the paving stones.","zh":"园丁把石板缝里的粘毛菜属杂草拔掉了。"}]}],"synonyms":["carpetweed"],"phonetic":"/məˈluːɡoʊ/","extraExplanation":["“Mollugo”多用于植物学语境，是一个拉丁化的属名；日常英语里更常用的名称是“carpetweed（地毯草）”，尤其在北美讨论草坪或庭院杂草时。"]}
{"word":"mollusc","summary":{"en":"A mollusc is a soft-bodied animal like a snail, clam, squid, or octopus (often with a shell).","zh":"mollusc 指软体动物，如蜗牛、蛤、鱿鱼或章鱼（常常有壳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft-bodied animal, usually with a shell, such as a snail, clam, mussel, squid, or octopus","zh":"软体动物（通常身体柔软，很多种类有壳），如蜗牛、蛤、贻贝、鱿鱼或章鱼"},"examples":[{"en":"Octopuses and squids are molluscs, even though they don’t have external shells.","zh":"章鱼和鱿鱼都是软体动物，尽管它们没有外部的硬壳。"},{"en":"The beach was covered with mollusc shells after the storm.","zh":"暴风雨过后，海滩上满是软体动物的贝壳。"}]}],"synonyms":["mollusk","shellfish (common but not exact)"],"phonetic":"/ˈmɑl.əsk/","extraExplanation":["“mollusc/ mollusk”是同一个词的两种拼写：英式英语常用mollusc，美式英语更常用mollusk。","词源来自拉丁语mollus（“柔软的”），所以这个词强调“身体柔软”的特征。","在生物分类上，软体动物门（Mollusca）包含“有壳的”如蛤蜊、蜗牛，也包含“无外壳或内壳的”如鱿鱼、章鱼。日常英语里也常用来指“贝类/海鲜”中的这些动物。"]}
{"word":"mollusca","summary":{"en":"Mollusca is the biological phylum that includes soft-bodied animals like snails, clams, and octopuses.","zh":"Mollusca 指软体动物门，包含蜗牛、蛤蜊、章鱼等软体动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major group (phylum) of invertebrate animals that usually have a soft body; many have a shell, such as snails, clams, and octopuses","zh":"软体动物门（无脊椎动物的一大类），通常身体柔软；许多有外壳，如蜗牛、蛤蜊和章鱼"},"examples":[{"en":"Snails and clams belong to Mollusca.","zh":"蜗牛和蛤蜊属于软体动物门。"},{"en":"The ocean has many kinds of mollusks, including squid and octopuses.","zh":"海洋里有很多种软体动物，包括鱿鱼和章鱼。"}]}],"synonyms":["mollusks","molluscs"],"phonetic":"/məˈlʌskə/","extraExplanation":["“Mollusca”是拉丁化的科学名称，在英文科普中更常见的普通用法是“mollusks / molluscs（软体动物）”。","发音里常见两种读法：/məˈlʌskə/（常用于mollusk）和 /məˈlʌskə/ 类似的读法用于“Mollusca”；日常交流中你一般不必用到“Mollusca”，更多出现在生物分类或学术语境。"]}
{"word":"molluscacide","summary":{"en":"A molluscicide is a chemical used to kill snails, slugs, and other mollusks.","zh":"molluscicide 指用于杀死蜗牛、蛞蝓等软体动物的化学药剂（杀螺剂/灭软体动物剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical used to kill mollusks (especially snails and slugs), often to protect crops or reduce pests that spread disease","zh":"杀螺剂；灭软体动物剂（用于杀死蜗牛、蛞蝓等软体动物，常用于保护农作物或控制传播疾病的害虫）"},"examples":[{"en":"The farmer applied a molluscicide to protect young lettuce from slugs.","zh":"农民使用杀螺剂来保护幼生菜免受蛞蝓危害。"},{"en":"In some areas, molluscicides are used to reduce snails that transmit parasites.","zh":"在一些地区，会使用杀螺剂来减少传播寄生虫的螺类。"}]}],"synonyms":["snail killer","slug killer","pesticide (broad, not exact)"],"phonetic":"/məˈlʌskəˌsaɪd/","extraExplanation":["词形小提示：molluscicide = mollusc（软体动物）+ -cide（“杀死……的东西/行为”，如 insecticide 杀虫剂、herbicide 除草剂）。","使用语境：常见于农业、园艺与公共卫生文本。日常英语更常直接说 “snail/slug killer” 或具体产品名。","拼写说明：美式拼写常见 molluscicide；有时也会看到 molluscicide / molluscacide 的混写，但以 molluscicide 更标准。"]}
{"word":"molluscan","summary":{"en":"“Molluscan” means “related to mollusks,” such as snails, clams, squid, and octopuses.","zh":"“molluscan”意为“与软体动物有关的”，如蜗牛、蛤类、鱿鱼和章鱼等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to mollusks (animals such as snails, clams, oysters, squid, and octopuses).","zh":"（形容词）与软体动物有关的（如蜗牛、蛤、牡蛎、鱿鱼、章鱼等）。"},"examples":[{"en":"Molluscan shells can be found along many beaches.","zh":"许多海滩上都能找到软体动物的贝壳。"},{"en":"The museum has a molluscan exhibit featuring octopuses and clams.","zh":"博物馆有一个软体动物展区，展示章鱼和蛤类。"},{"en":"Scientists study molluscan evolution to understand how shells and tentacles developed.","zh":"科学家研究软体动物的演化，以了解贝壳和触手如何发展而来。"}]}],"synonyms":["mollusk-related","of mollusks"],"phonetic":"/məˈlʌskən/","extraExplanation":["“molluscan”来自“mollusk”（软体动物），常见于生物学、海洋学等学术或科普语境；日常对话里更常说“mollusk/mollusks”。","拼写提示：英式常见 mollusc /məˈlʌsk/，美式常见 mollusk；对应形容词多写 molluscan（两种拼写体系都常用）。","相关词：mollusk（名词：软体动物）、molluscan biology（软体动物学/相关研究）、molluscan shellfish（软体贝类，如蛤、牡蛎等）。"]}
{"word":"molluscans","summary":{"en":"Molluscans are mollusks—animals like snails, clams, and octopuses; the word can also describe things related to mollusks.","zh":"molluscans 指软体动物（如蜗牛、蛤、章鱼等）；也可作形容词表示“与软体动物有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) animals in the group Mollusca (mollusks), such as snails, clams, oysters, mussels, octopuses, and squids.","zh":"（复数）软体动物门的动物，如蜗牛、蛤、牡蛎、贻贝、章鱼和鱿鱼等。"},"examples":[{"en":"Many molluscans live in the ocean, but some, like snails, live on land.","zh":"许多软体动物生活在海洋里，但也有一些（如蜗牛）生活在陆地上。"},{"en":"The museum display compares molluscans and crustaceans using shells and models.","zh":"博物馆的展览用贝壳和模型来对比软体动物和甲壳动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to mollusks (Mollusca).","zh":"与软体动物（软体动物门）有关的。"},"examples":[{"en":"Scientists study molluscan shells to learn about ancient oceans.","zh":"科学家研究软体动物的贝壳来了解古代海洋。"},{"en":"The octopus has a molluscan body plan with no internal skeleton.","zh":"章鱼属于软体动物的身体结构类型，没有内骨骼。"}]}],"synonyms":["mollusks","molluscs"],"phonetic":"/məˈlʌskən/","extraExplanation":["“molluscan”既可作名词也可作形容词；“molluscans”通常指复数名词“软体动物们”。","英式拼写常见 mollusc / molluscan；美式更常见 mollusk / molluscan。两者意思相同。","属于软体动物的常见特征包括身体柔软、许多种类有贝壳；章鱼、鱿鱼等虽无外壳，但仍属于软体动物。"]}
{"word":"molluscicidal","summary":{"en":"Molluscicidal means “killing mollusks,” especially chemicals used to kill snails/slugs.","zh":"molluscicidal 指“杀死软体动物的（尤指杀蜗牛/蛞蝓的化学药剂）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to kill mollusks (such as snails and slugs); used especially for chemicals that destroy snails that spread disease or damage crops.","zh":"能杀死软体动物（如蜗牛、蛞蝓等）的；尤指用于消灭传播疾病或危害农作物的蜗牛类的化学药剂。"},"examples":[{"en":"The health program applied a molluscicidal chemical to reduce snail populations that carry parasites.","zh":"该公共卫生项目使用杀螺剂来减少携带寄生虫的蜗牛数量。"},{"en":"Farmers may use molluscicidal bait to protect young seedlings from slugs.","zh":"农民可能使用杀螺诱饵来保护幼苗免受蛞蝓侵害。"}]},{"partOfSpeech":"n.","definition":{"en":"A mollusc-killing substance (a molluscicide).","zh":"杀软体动物的药剂（杀螺剂）。"},"examples":[{"en":"The team tested a new molluscicidal to see if it was effective and safe.","zh":"团队测试了一种新的杀螺剂，以评估其效果与安全性。"}]}],"synonyms":["mollusc-killing","molluscicide","snail-killing (informal)"],"phonetic":"/ˌmɑləˈsɪsɪdəl/","extraExplanation":["词源小提示：mollusc（软体动物）+ -cide（杀死，如 insecticide 杀虫剂、herbicide 除草剂）+ -al（形容词后缀）。所以 molluscicidal 常见于公共卫生与农业语境，尤其与“杀螺/灭螺”相关。","实际使用中更常见的名词是 molluscicide（杀螺剂）；molluscicidal 多作形容词，修饰 chemical / agent / bait / activity 等词。"]}
{"word":"molluscicide","summary":{"en":"A molluscicide is a substance used to kill snails, slugs, and other mollusks, often for crop protection or disease control.","zh":"molluscicide 指用于杀死蜗牛、蛞蝓等软体动物的药剂，常用于作物保护或疾病防控。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical or substance used to kill mollusks such as snails and slugs, especially to protect crops or reduce disease risk","zh":"杀螺剂；灭软体动物剂：用于杀死软体动物（如蜗牛、蛞蝓等）的化学品或物质，常用于保护作物或降低疾病传播风险"},"examples":[{"en":"The farmer applied a molluscicide to control slugs in the vegetable field.","zh":"农民施用杀螺剂来控制菜地里的蛞蝓。"},{"en":"In some regions, molluscicide is used to reduce freshwater snails that can spread disease.","zh":"在一些地区，会使用杀螺剂来减少可能传播疾病的淡水螺。"}]}],"synonyms":["slug killer","snail killer"],"phonetic":"/məˈlʌskəˌsaɪd/","extraExplanation":["词源拆分：mollusc（软体动物）+ -cide（“杀死”之意，来自拉丁语 caedere“杀、砍”）。同类构词还有 insecticide（杀虫剂）、herbicide（除草剂）、pesticide（杀虫/农药的总称）。","使用场景提示：农业里多用于防治蛞蝓、蜗牛；公共卫生场景有时用于控制传播血吸虫等疾病的中间宿主螺类。不同产品对环境与非目标生物（如宠物、鸟类、水生生物）风险不同，实际使用通常需要遵循当地法规与说明。"]}
{"word":"molluscivorous","summary":{"en":"Molluscivorous describes animals that eat mollusks (snails, clams, mussels, etc.).","zh":"molluscivorous 指“以软体动物（如蜗牛、蛤蜊、贻贝等）为食的（动物）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal) feeding on mollusks such as snails, clams, and mussels; mollusk-eating.","zh":"（动物）以软体动物为食的；食螺类/贝类等软体动物的。"},"examples":[{"en":"Some sea birds are molluscivorous and crack open shells to eat the animal inside.","zh":"一些海鸟是食软体动物的，会敲开贝壳来吃里面的肉。"},{"en":"The researcher compared the teeth of molluscivorous fishes with those of other predators.","zh":"研究人员比较了食软体动物鱼类与其他捕食者的牙齿差异。"}]}],"synonyms":["mollusk-eating","shellfish-eating","malacophagous"],"phonetic":"/məˌlʌskˈɪvərəs/","extraExplanation":["这是一个比较偏生物学/动物学的书面词，日常英语更常说“mollusk-eating”或“feeds on mollusks”。","词形构成：mollusc（软体动物）+ -vorous（以……为食的）。同一类后缀还常见于：carnivorous（食肉的）、herbivorous（食草的）、omnivorous（杂食的）、insectivorous（食虫的）。","英美拼写常见两种：mollusk（美式）/ mollusc（英式）；但“molluscivorous”也常保留 -sc- 的拼写。"]}
{"word":"molluscoid","summary":{"en":"Molluscoid means “mollusk-like,” and can also refer to something that resembles a mollusk.","zh":"molluscoid 意为“像软体动物的”，也可指“软体动物状的东西/生物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Resembling a mollusk (a soft-bodied animal such as a snail, clam, or octopus); mollusk-like.","zh":"（形容词）像软体动物的；具有软体动物特征的（如蜗牛、蛤蜊、章鱼等）。"},"examples":[{"en":"The fossil showed a molluscoid shell shape, similar to early snails.","zh":"这块化石呈现出类似软体动物的壳形，像早期的蜗牛。"},{"en":"In the story, the alien creature had a molluscoid body and moved slowly across the rocks.","zh":"在故事里，那种外星生物身体像软体动物一样，慢慢地爬过岩石。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) Something that resembles a mollusk; a mollusk-like organism or form.","zh":"（名词）类似软体动物的东西；软体动物状的生物或形态。"},"examples":[{"en":"The researcher described the specimen as a molluscoid rather than a true mollusk.","zh":"研究人员把该标本描述为“软体动物状生物”，而不是真正的软体动物。"}]}],"synonyms":["mollusk-like","shell-like","invertebrate-like"],"phonetic":"/məˈlʌs.kɔɪd/","extraExplanation":["“molluscoid”由“mollusc（软体动物）+ -oid（……状的）”构成；“-oid”常见于表示“外形/特征类似”的词，如“humanoid（类人形的）”“asteroid（小行星，原义为星状的）”。","该词多用于生物学、古生物学或科幻描写中，日常英语里不常见。"]}
{"word":"molluscoida","summary":{"en":"Molluscoida is an old zoological term for several marine invertebrate groups once thought to be related to mollusks; it is not used as a valid group in modern taxonomy.","zh":"Molluscoida 是旧时动物学用语，指一批曾被认为与软体动物相近的海洋无脊椎动物群；现代分类学通常不再把它当作有效类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, historical) A former group name for several small marine animal phyla once thought to be related to mollusks (often including bryozoans, brachiopods, and phoronids).","zh":"（动物学·历史用语）旧时的分类名称，指一类曾被认为与软体动物相近的海洋无脊椎动物群（常包括苔藓动物、腕足动物与帚虫等）。"},"examples":[{"en":"In older zoology books, Molluscoida was used as a broad group for bryozoans and brachiopods.","zh":"在较早的动物学书籍中，Molluscoida 常被用作涵盖苔藓动物和腕足动物的较大类群。"},{"en":"Modern taxonomy no longer treats Molluscoida as a valid scientific group.","zh":"现代分类学不再把 Molluscoida 视为有效的科学类群。"}]}],"synonyms":["molluscoids","(roughly) lophophorates (in some contexts)"],"phonetic":"/məˌlʌsˈkɔɪdə/","extraExplanation":["“Molluscoida”属于较老的分类体系（19世纪常见）。当时科学家主要依据外形相似性来分组，认为这些动物与软体动物（mollusks）相近。后来随着解剖学与分子系统学的发展，学界发现它们并不是一个自然的“单系群”，因此该名称多被视为过时或不再正式使用。","相关现代说法常会分别使用各自的门名（如 Bryozoa、Brachiopoda、Phoronida），或在某些语境下提到“lophophorates（具触手冠动物）”作为功能形态上的集合称呼。"]}
{"word":"molluscoidal","summary":{"en":"Molluscoidal describes a smooth, shell-like curved fracture surface, especially in stone or glass.","zh":"molluscoidal 指（石头或玻璃等）断口呈光滑弧形的贝壳状纹理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a fracture surface, especially in stone or glass) having smooth, curved, shell-like ripples, like the inside of a mollusk shell.","zh":"（尤指石头或玻璃的断裂面）呈贝壳状的、光滑弧形波纹的；贝壳状断口的。"},"examples":[{"en":"Obsidian often breaks with a molluscoidal surface, leaving sharp edges.","zh":"黑曜石常常呈贝壳状断口破裂，从而形成非常锋利的边缘。"},{"en":"The archaeologist identified the flake by its molluscoidal fracture pattern.","zh":"考古学家通过贝壳状断裂的纹理识别出这片石片。"}]}],"synonyms":["conchoidal","shell-like","curved"],"phonetic":"/məˌlʌsˈkɔɪdəl/","extraExplanation":["“molluscoidal”常见于地质学、考古学（石器打制）等语境，常与“fracture（断裂/断口）”“surface（表面）”“conchoidal（贝壳状的）”搭配使用。日常英语里很少见，更常用的近义词是 conchoidal。"]}
{"word":"molluscoidan","summary":{"en":"Molluscoidan is a sulfated polysaccharide from some mollusks, similar to seaweed fucoidan and mainly used as a research term.","zh":"Molluscoidan 指部分软体动物中的硫酸化多糖，类似于褐藻 fucoidan，主要作为科研术语使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sulfated polysaccharide (a complex sugar) found in some mollusks, chemically similar to fucoidan from brown seaweed; studied for potential biological activities","zh":"（生物化学）一种存在于部分软体动物中的硫酸化多糖（复杂糖类），在化学性质上类似于褐藻中的褐藻多糖（fucoidan）；常用于研究其潜在生物活性"},"examples":[{"en":"Researchers isolated molluscoidan from a marine mollusk and analyzed its structure.","zh":"研究人员从一种海洋软体动物中分离出 molluscoidan，并分析了其结构。"},{"en":"Molluscoidan is sometimes compared with fucoidan because both are sulfated polysaccharides.","zh":"molluscoidan 有时会与 fucoidan 作比较，因为两者都是硫酸化多糖。"}]}],"synonyms":["fucoidan (related compound)","molluscan fucoidan (descriptive term)"],"phonetic":"/məˌlʌskɔɪˈdeɪn/","extraExplanation":["这是一个较少见、偏学术的术语，通常出现在海洋天然产物、糖生物学或药理学相关论文中。","词形上可理解为 mollusc（软体动物）+ -oid-（类似……的）+ -an（多糖命名中常见的后缀），整体含义可概括为“来自软体动物/与软体动物相关的（类）fucoidan 多糖”。","注意：不同文献对该词的使用并不完全统一；有时作者会用它来强调来源于软体动物的“fucoidan-like”硫酸化多糖。"]}
{"word":"molluscoidea","summary":{"en":"Molluscoidea is an old zoological term for a “mollusk-like” group (often brachiopods and bryozoans) that is rarely used today.","zh":"Molluscoidea 是动物学中的旧术语，指曾被视为“类似软体动物”的一组无脊椎动物（常指腕足动物、苔藓动物等），现代已较少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, historical) A former taxonomic group of invertebrates once thought to be “mollusk-like,” especially brachiopods and bryozoans; the term is now largely outdated in modern biology.","zh":"（动物学·历史用语）一种旧的无脊椎动物分类群，曾被认为“类似软体动物”，主要指腕足动物和苔藓动物等；在现代生物分类中多已不再使用。"},"examples":[{"en":"In older zoology textbooks, Brachiopoda and Bryozoa were sometimes placed in Molluscoidea.","zh":"在较早的动物学教材中，腕足动物门和苔藓动物门有时会被归入“类软体动物”（Molluscoidea）。"},{"en":"The category Molluscoidea has largely been replaced by more accurate evolutionary groupings.","zh":"“Molluscoidea”这一类群在很大程度上已被更符合演化关系的分类方式所取代。"}]}],"synonyms":["molluscoids","(related) lophophorates"],"phonetic":"/ˌmɑləˈskɔɪdiə/","extraExplanation":["词源上可拆为 mollusc（软体动物）+ -oidea（“……样的/类似……的”），体现了早期分类学依据外形相似性来归类的思路。","该名称在历史上常与“具总担（lophophore，总担）”的动物联系在一起；现代分类更常用更精确的门级名称（如 Brachiopoda 腕足动物门、Bryozoa/ Ectoprocta 苔藓动物门），或在特定语境下提及“lophophorates（总担动物）”作为讨论对象。"]}
{"word":"molluscoidean","summary":{"en":"A rare biology adjective meaning “related to or resembling mollusks.”","zh":"一个较少见的生物学形容词，表示“与软体动物有关的；像软体动物的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Relating to or resembling mollusks (soft-bodied animals such as snails, clams, and octopuses); mollusk-like.","zh":"（生物）与软体动物有关的；类似软体动物的（如蜗牛、蛤、章鱼等）。"},"examples":[{"en":"Early zoology books sometimes used “molluscoidean” to describe animals that seemed mollusk-like.","zh":"早期的动物学书籍有时用“molluscoidean”来描述看起来像软体动物的动物。"},{"en":"The researcher compared molluscoidean body features such as a soft mantle and a muscular foot.","zh":"研究者比较了软体动物样的身体特征，例如柔软的外套膜和肌肉质的足。"}]}],"synonyms":["molluscan","mollusk-like","molluskan"],"phonetic":"/məˌlʌskɔɪˈdiən/","extraExplanation":["“molluscoidean”是一个较少见、偏旧的学术用语，常见于早期动物分类与形态学描述。现代写作中更常用的是“molluscan / molluskan”（意为“软体动物的”）或直接说“mollusk-like”（意为“像软体动物一样的”）。","词源上来自“mollusc”（软体动物）+ 后缀“-oidean”（表示“……样的/类似……的”）。"]}
{"word":"molluscous","summary":{"en":"Molluscous means “mollusk-like” or “related to mollusks”; more rarely, it can describe molluscum-type skin lesions.","zh":"molluscous 指“软体动物的/像软体动物的”；较少见时也可指“软疣样的（皮肤病灶）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Like a mollusk; relating to mollusks (soft-bodied animals such as snails, clams, and octopuses).","zh":"（生物）像软体动物的；与软体动物（如蜗牛、蛤、章鱼等）有关的。"},"examples":[{"en":"Scientists studied molluscous creatures living on the rocky shore.","zh":"科学家研究了生活在岩石海岸上的软体动物类生物。"},{"en":"The diver photographed a molluscous animal with a soft body and no bones.","zh":"潜水员拍到一种软体动物：身体柔软，没有骨骼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine, less common) Relating to or resembling molluscum (a skin condition that causes small, raised bumps).","zh":"（医学，较少见）与传染性软疣等“软疣”（会引起小而隆起皮疹的皮肤病）有关的；呈软疣样的。"},"examples":[{"en":"The doctor noted molluscous lesions on the patient’s arm.","zh":"医生记录患者手臂上有软疣样病灶。"}]}],"synonyms":["molluscan","mollusklike","soft-bodied"],"phonetic":"/məˈlʌskəs/","extraExplanation":["“molluscous”在现代英语里相对少见，写作与学术语境中更常用的是“molluscan”（软体动物的）。","词源上与拉丁语 mollis（“柔软的”）有关，因此这个词自带“柔软、无骨、软体”的联想。"]}
{"word":"molluscousness","summary":{"en":"Molluscousness means an unusually soft, limp, or flabby quality—like something “mollusk-like,” often said jokingly or critically.","zh":"molluscousness 指一种异常柔软、松弛或软塌塌的特质，像“软体动物一样软”，常带调侃或批评语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being soft, flabby, or lacking firmness; a “mollusk-like” softness (often used humorously or critically).","zh":"（罕用）柔软、松弛、缺乏硬度或坚实感的特质；带有“像软体动物一样软”的感觉（常带调侃或批评意味）。"},"examples":[{"en":"After weeks without exercise, he complained about the molluscousness of his arms.","zh":"几周不运动后，他抱怨自己的手臂变得松松垮垮。"},{"en":"The old sofa had a tired molluscousness that swallowed you when you sat down.","zh":"那张旧沙发疲软塌陷，一坐下去就把人“吞”进去。"}]}],"synonyms":["softness","flabbiness","limpness","mushiness","sogginess"],"phonetic":"/məˈlʌskəsnəs/","extraExplanation":["这是由形容词 molluscous（“软体动物的；柔软的”）+ 名词后缀 -ness（“……的性质/状态”）构成的抽象名词。","molluscous 本身就很少见；molluscousness 更罕用，多见于夸张描写（如形容肌肉松弛、质地过软），日常英语更常用 softness / flabbiness / limpness。","注意与 mollusc（软体动物）以及 molluscum（“传染性软疣”；医学术语）区分：molluscousness 通常不是医学诊断词。"]}
{"word":"molluscs","summary":{"en":"Molluscs are soft-bodied animals such as snails, clams, and octopuses.","zh":"molluscs 指软体动物，如蜗牛、蛤蜊和章鱼等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Animals with soft bodies (usually without a backbone), often protected by a shell; this group includes snails, clams, oysters, octopuses, and squids.","zh":"软体动物：身体柔软（通常无脊椎），常有外壳保护；包括蜗牛、蛤蜊、牡蛎、章鱼和鱿鱼等。"},"examples":[{"en":"Snails and clams are molluscs.","zh":"蜗牛和蛤蜊都是软体动物。"},{"en":"Many molluscs live in the ocean, but some live on land.","zh":"许多软体动物生活在海洋里，但也有一些生活在陆地上。"}]}],"synonyms":["mollusks"],"phonetic":"/ˈmɑləsks/","extraExplanation":["“mollusc”在英式英语中更常见拼写为 mollusc；美式英语更常见 mollusk。两者意思相同。","词源来自拉丁语 mollis（“柔软的”），因此这个类群名称与“身体柔软”的特征有关。","日常语境里，章鱼和鱿鱼也属于软体动物（头足类），虽然它们没有外部硬壳，这点常让学习者感到意外。"]}
{"word":"molluscum","summary":{"en":"“Molluscum” most commonly refers to a contagious viral skin bump (molluscum contagiosum). Less commonly, it can mean a mollusk (a soft-bodied animal like a snail).","zh":"“molluscum”最常指由病毒引起、可传染的皮肤小突起（传染性软疣）；较少情况下可指软体动物（如蜗牛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, raised skin growth caused by a common viral infection (molluscum contagiosum), often seen in children; it can spread by close skin contact.","zh":"由常见病毒感染（传染性软疣，molluscum contagiosum）引起的皮肤小突起/小疙瘩，儿童较常见，可通过密切皮肤接触传播。"},"examples":[{"en":"The doctor said the bumps were molluscum and should go away over time.","zh":"医生说这些小疙瘩是传染性软疣，通常过一段时间会自行消退。"},{"en":"Molluscum can spread through skin-to-skin contact, so try not to scratch it.","zh":"软疣可能通过皮肤接触传播，所以尽量不要抓挠。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology, less common in everyday speech) a mollusk: an animal group that includes snails, clams, and octopuses.","zh":"（生物学中，日常较少用）软体动物：包括蜗牛、蛤蜊、章鱼等的一类动物。"},"examples":[{"en":"A snail is a molluscum in the broad biological sense.","zh":"从广义生物学角度看，蜗牛属于软体动物。"}]}],"synonyms":["molluscum contagiosum","mollusk","mollusc"],"phonetic":"/məˈlʌskəm/","extraExplanation":["“molluscum”来自拉丁语 *molluscus*，意为“柔软的”，与“软体动物/皮肤柔软的小突起”的概念相关。","在英语医疗语境里，单独说“molluscum”通常就是指“molluscum contagiosum（传染性软疣）”。在更严谨的生物分类里，常见拼写是“mollusk”（美式）或“mollusc”（英式），而“molluscum”更像是较少见的泛称或与医学用法相关。"]}
{"word":"mollusk","summary":{"en":"A mollusk is a soft-bodied animal, often with a shell, such as a snail, clam, oyster, or octopus.","zh":"mollusk 指软体动物，身体柔软，常有贝壳，如蜗牛、蛤、牡蛎或章鱼等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft-bodied animal that usually has a shell (such as a snail, clam, oyster, or octopus)","zh":"软体动物（通常身体柔软，常有贝壳；如蜗牛、蛤、牡蛎或章鱼等）"},"examples":[{"en":"Clams and oysters are mollusks that live in the ocean.","zh":"蛤和牡蛎是生活在海洋里的软体动物。"},{"en":"An octopus is a mollusk, even though it doesn’t have a hard outer shell.","zh":"章鱼是软体动物，即使它没有坚硬的外壳。"},{"en":"Some mollusks protect themselves by closing their shells tightly.","zh":"一些软体动物会把贝壳紧紧合上来保护自己。"}]}],"synonyms":["shellfish (common in food contexts, not exact)","invertebrate (broader category)"],"phonetic":"/ˈmɑl.əsk/","extraExplanation":["“mollusk”来自拉丁语 mollis，意思是“柔软的”。因此它指的是“身体柔软”的一大类动物。","常见分类（了解即可）：双壳类（clams, oysters）、腹足类（snails）、头足类（octopus, squid）。在日常英语里，你只需要记住它是“软体动物”的统称。","拼写提示：美式英语常写 mollusk；英式英语也常见 mollusc（多一个 c）。"]}
{"word":"molluskan","summary":{"en":"Molluscan (also seen as “molluskan”) means “related to mollusks,” and it can also mean “a mollusk.”","zh":"Molluscan（也可见写作 molluskan）表示“与软体动物有关的”，也可作名词指“软体动物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Relating to mollusks (animals like snails, clams, and octopuses).","zh":"（形容词）与软体动物有关的（如蜗牛、蛤蜊、章鱼等）。"},"examples":[{"en":"Molluscan shells can show beautiful spiral patterns.","zh":"软体动物的贝壳可能呈现漂亮的螺旋纹理。"},{"en":"The museum has a small molluscan exhibit with snails and clams.","zh":"博物馆有一个小型软体动物展区，展示蜗牛和蛤蜊。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) A mollusk; an animal in the phylum Mollusca.","zh":"（名词）软体动物；软体动物门的动物。"},"examples":[{"en":"The octopus is a molluscan with eight arms.","zh":"章鱼是一种有八条腕的软体动物。"},{"en":"Many molluscans live in the ocean, but some live on land.","zh":"许多软体动物生活在海洋里，但也有一些生活在陆地上。"}]}],"synonyms":["mollusk","molluscan (adj./n.)"],"phonetic":"/məˈlʌskən/","extraExplanation":["“molluskan”常见于非标准或个别地区的拼写；标准英语更常写作 **molluscan**（英式也常见 **molluscan/molluscan** 用法一致）。在生物学语境里，它用来描述与“软体动物门（Mollusca）”有关的特征。"]}
{"word":"mollusklike","summary":{"en":"“Mollusklike” means resembling a mollusk in appearance, texture, or movement.","zh":"mollusklike 意为“像软体动物的”，可指外形、质感或移动方式相似。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling a mollusk (such as a snail, clam, octopus, or slug) in shape, texture, or behavior","zh":"像软体动物的；具有软体动物特征的（如蜗牛、蛤、章鱼或蛞蝓）"},"examples":[{"en":"The creature had a mollusklike body with a soft, flexible surface.","zh":"这种生物的身体像软体动物一样，表面柔软而有弹性。"},{"en":"The robot moved in a slow, mollusklike way across the floor.","zh":"机器人以缓慢、像软体动物一样的方式在地板上移动。"},{"en":"Some science fiction describes aliens with mollusklike tentacles.","zh":"一些科幻作品会描写外星人长着像软体动物一样的触手。"}]}],"synonyms":["mollusk-like","sluglike","snail-like","shellfishlike","tentacled (context-specific)"],"phonetic":"ˈmɑləsk laɪk","extraExplanation":["这个词更常见的写法是 **mollusk-like**（带连字符），在学术写作或科普文章里更规范；不带连字符的 **mollusklike** 也能见到，但较少。","mollusk 指“软体动物”，常见成员包括 snail（蜗牛）、clam（蛤/贝类）、octopus（章鱼）、squid（鱿鱼）和 slug（蛞蝓）。因此 mollusk-like 往往是在形态（柔软、无骨/无壳或有壳）、运动方式（缓慢滑行、触手伸缩）或质地（黏滑、湿润）上作类比。"]}
{"word":"mollusks","summary":{"en":"Mollusks are soft-bodied animals such as snails, clams, and octopuses.","zh":"mollusks 指软体动物，如蜗牛、蛤蜊和章鱼等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large group of soft-bodied animals, usually with a shell, such as snails, clams, oysters, and octopuses.","zh":"软体动物（大类群）：身体柔软的动物，通常有壳，例如蜗牛、蛤蜊、牡蛎和章鱼等。"},"examples":[{"en":"Many mollusks live in the ocean, like clams and squid.","zh":"许多软体动物生活在海洋里，比如蛤蜊和鱿鱼。"},{"en":"The science museum has a section on mollusks and their shells.","zh":"科学博物馆有一个关于软体动物及其贝壳的展区。"}]}],"synonyms":["molluscs","shellfish (some kinds)"],"phonetic":"/ˈmɑləsks/","extraExplanation":["“mollusks”是“mollusk”的复数。英式拼写常见为“molluscs”。","软体动物包含几大常见类群：腹足类（snails 蜗牛）、双壳类（clams 蛤蜊/oysters 牡蛎）、头足类（octopus 章鱼/squid 鱿鱼）。有些（如章鱼）没有外壳。"]}
{"word":"Molly","summary":{"en":"“Molly” is most commonly a female first name, and it can also mean MDMA (slang).","zh":"“Molly”最常见是女性名字，也可作俚语指 MDMA（摇头丸成分）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common female given name (a diminutive form of Mary)","zh":"常见的女性名字（Mary 的昵称/简写之一）"},"examples":[{"en":"Molly is my cousin’s name.","zh":"Molly 是我表妹的名字。"},{"en":"Molly moved to Chicago for a new job.","zh":"Molly 为了新工作搬去了芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) MDMA, a synthetic drug also called ecstasy; often seen in the phrase “molly” at parties","zh":"（俚语）摇头丸成分 MDMA 的俗称，也常被称为 ecstasy；派对语境中常见"},"examples":[{"en":"The club posted warnings about “molly” and other drugs.","zh":"那家夜店张贴了关于 “molly” 等毒品的警示。"},{"en":"In health class, we learned that MDMA (“molly”) can be dangerous.","zh":"在健康课上我们学到，MDMA（“molly”）可能很危险。"}]}],"synonyms":["(slang) MDMA","(slang) ecstasy"],"phonetic":"/ˈmɑli/","extraExplanation":["作人名时，Molly 多被认为源自 Mary 的昵称形式，在英语国家相当常见，语气亲切、日常。","作俚语时，“molly”在流行文化（音乐歌词、派对语境）里常出现，但现实中所谓“molly”可能掺杂其他物质，存在较大健康风险；正式写作中建议用“MDMA”并避免随意使用俚语。","文学文化小提示：爱尔兰作家詹姆斯·乔伊斯（James Joyce）的小说《尤利西斯》（Ulysses）中有著名角色 Molly Bloom。"]}
{"word":"molly","summary":{"en":"Molly is most commonly a female name; it can also mean MDMA in slang, and more rarely an old term for a maid.","zh":"Molly 最常见是女性名字；也可作俚语指 MDMA；较少见的旧式用法指女仆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common female given name (short for Mary or used as an independent name)","zh":"常见的女性名字（可作 Mary 的昵称，也可独立作为名字）"},"examples":[{"en":"Molly is starting college this fall.","zh":"Molly 今年秋天开始上大学。"},{"en":"We invited Molly and her sister to dinner.","zh":"我们邀请了 Molly 和她姐姐来吃晚饭。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) MDMA, a psychoactive party drug often sold as powder or crystals","zh":"（俚语）MDMA（摇头丸/“迷魂药”），一种常见于派对场景的致幻/兴奋类毒品，常以粉末或晶体售卖"},"examples":[{"en":"The police reported finding molly at the festival.","zh":"警方通报在音乐节现场发现了“molly”（MDMA）。"},{"en":"Some people wrongly think molly is always pure.","zh":"有些人误以为 molly 总是纯的。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) a young woman who works as a servant or maid","zh":"（旧式用法）女仆；侍女"},"examples":[{"en":"In the old story, a molly worked in a rich household.","zh":"在那则旧故事里，一位女仆在富人家里干活。"}]}],"synonyms":["(name) —","(slang drug) MDMA","(slang drug) ecstasy"],"phonetic":"/ˈmɑli/","extraExplanation":["“Molly” 作毒品含义在美式英语里很常见，尤其出现在音乐节、夜店等语境；它通常指 MDMA，但街头售卖的成分可能掺杂其他危险物质，因此媒体与公共卫生语境常强调其风险。","作为人名时，Molly 往往给人亲切、随和的感觉；在文学或影视里也常用作普通、可亲的女性角色名。"]}
{"word":"mollycoddle","summary":{"en":"Mollycoddle means to overprotect or pamper someone, or a person who is pampered too much.","zh":"mollycoddle 指对某人过度溺爱/过度保护；也可指被过度照顾、被惯坏的人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat someone too kindly and protectively, so they are not allowed to face normal difficulties or become independent","zh":"过度溺爱（某人）；把某人当成“温室里的花”一样保护，导致不够独立"},"examples":[{"en":"Some parents mollycoddle their children and do everything for them.","zh":"有些父母太溺爱孩子，什么都替他们做。"},{"en":"If you mollycoddle new employees, they may not learn to solve problems on their own.","zh":"如果你对新员工过度照顾，他们可能学不会独立解决问题。"},{"en":"The coach refused to mollycoddle the team; mistakes had consequences.","zh":"教练拒绝惯着球队；犯错就要承担后果。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is treated with too much care and protection","zh":"被过度照顾的人；被惯坏的人"},"examples":[{"en":"He’s not a mollycoddle—he can handle tough situations.","zh":"他不是那种被惯坏的人——他能应付艰难局面。"},{"en":"Stop acting like a mollycoddle and take responsibility.","zh":"别像个被宠坏的人一样，承担起责任来。"}]}],"synonyms":["pamper","coddle","spoil","baby","overprotect"],"phonetic":"/ˈmɑliˌkɑdəl/","extraExplanation":["这个词常带批评语气，强调“保护得过头”会让人缺乏抗压能力或独立性。","词源上与“molly”（旧时对女性/姑娘的称呼）和“coddle”（娇养、溺爱）有关，所以整体语感也有点“把人当小孩/当宝贝养”的意思。"]}
{"word":"mollycoddled","summary":{"en":"“Mollycoddled” means overly coddled or protected, often so the person becomes spoiled or less resilient.","zh":"“mollycoddled”指被过度呵护或纵容，常含批评意味，暗示因此被宠坏或不够坚强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Treated someone too gently or protectively, so they are spoiled or not prepared to deal with difficulties.","zh":"对某人过度呵护或纵容，导致其被宠坏或缺乏应对困难的能力。"},"examples":[{"en":"He was mollycoddled as a child, so he struggles to handle criticism at work.","zh":"他小时候被过度呵护，所以在工作中很难接受批评。"},{"en":"Don’t mollycoddle the new interns—give them real tasks so they can learn.","zh":"别过度照顾新实习生——给他们真正的任务，他们才能学会。"}]},{"partOfSpeech":"v.","definition":{"en":"To coddle or baby someone; to treat someone with too much attention or protection.","zh":"溺爱、娇惯某人；给予过多关注或保护。"},"examples":[{"en":"Some parents mollycoddle their kids and solve every problem for them.","zh":"有些父母会溺爱孩子，替他们解决每一个问题。"},{"en":"The coach refused to mollycoddle the team after the loss.","zh":"输球后，教练拒绝再娇惯队员。"}]}],"synonyms":["coddled","spoiled","pampered","babied","overprotected"],"phonetic":"/ˈmɑliˌkɑdld/","extraExplanation":["“mollycoddle”常带有批评语气：说话者认为这种“照顾”过头了，反而让人变得依赖或不够坚强。","词源上，“molly”曾用来指“娘娘腔/过于柔弱的男性”（现代使用时可能带有性别刻板印象），而“coddle”是“娇惯、溺爱”。因此在表达时更适合用来批评“过度保护/过度纵容”，而不是单纯的“关心照顾”。","相关表达：spoil（宠坏）、coddle（溺爱）、baby someone（把某人当宝宝一样对待）；反义倾向：toughen someone up（让某人变坚强）、be strict with（对……严格）。"]}
{"word":"mollycoddler","summary":{"en":"“Mollycoddler” is a person (or the act) of overprotecting or pampering someone, often in a way that prevents independence.","zh":"“mollycoddler”指对人过分娇惯/过度保护的人（或这种行为），常含批评意味，暗示会妨碍独立成长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who treats someone too gently or protectively, so they don’t learn to be independent or tough","zh":"对人过分娇惯、过度保护的人（使对方难以独立、变得不够坚强）"},"examples":[{"en":"Stop mollycoddling him—he’s old enough to do it himself.","zh":"别再娇惯他了——他已经大到可以自己做了。"},{"en":"Some parents don’t realize that mollycoddling can make kids less confident.","zh":"有些父母没意识到，过度保护会让孩子更缺乏自信。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat someone too gently or protectively; to pamper","zh":"过分娇惯；过度保护；溺爱"},"examples":[{"en":"They mollycoddled the new employee instead of training her properly.","zh":"他们对新员工过度照顾，而不是好好培训她。"},{"en":"He was mollycoddled as a child and struggled when he went to college.","zh":"他小时候被溺爱，到了大学反而很不适应。"}]}],"synonyms":["coddler","pamperer","overprotector","spoil","coddle","pamper"],"phonetic":"/ˈmɑliˌkɑdəl/","extraExplanation":["这个词常带有批评意味，暗示“好心但方式不对”：短期看是在照顾，长期可能让对方缺少锻炼、抗压或独立能力。","词源上，molly 是女性名字的常见昵称，coddle 表示“娇养/溺爱”。合在一起有“像哄小孩一样照顾”的感觉。"]}
{"word":"mollycoddlers","summary":{"en":"“Mollycoddlers” means people who pamper or overprotect others too much.","zh":"“mollycoddlers”指过度溺爱、过度保护他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of mollycoddler) People who are overly protective and treat someone too gently, as if they cannot handle normal difficulties.","zh":"（mollycoddler 的复数）过度保护他人的人；把别人照顾得太娇、太软弱的人（好像对方无法承受正常困难）。"},"examples":[{"en":"Some critics say schools shouldn’t become mollycoddlers and should let students solve problems on their own.","zh":"一些批评者认为学校不该变成“过度保护者”，而应让学生自己解决问题。"},{"en":"He thought the new rules turned parents into mollycoddlers.","zh":"他觉得这些新规定把家长变成了过度保护孩子的人。"}]},{"partOfSpeech":"n.","definition":{"en":"People who “mollycoddle” others—who pamper or overprotect them.","zh":"指那些会“mollycoddle（溺爱、过度呵护）”他人的人。"},"examples":[{"en":"If managers are mollycoddlers, employees may not learn from mistakes.","zh":"如果管理者总是过度呵护，员工可能学不会从错误中成长。"}]}],"synonyms":["overprotectors","pamperers","coddling people","hovering parents"],"phonetic":"/ˈmɑliˌkɑdəlɚ/","extraExplanation":["“mollycoddler”常带批评语气，强调“过度照顾/溺爱”导致对方缺乏独立性。","词源上常被解释为由女性名“Molly”和“coddle（娇惯、溺爱）”组合而来；因此在现代使用时要注意语气与场合，避免对特定性别产生刻板印象。"]}
{"word":"mollycoddles","summary":{"en":"“Mollycoddles” usually means “treats someone too protectively or spoils them.” It can also refer to a person who has been spoiled and becomes dependent.","zh":"“mollycoddles”通常表示“过度保护或溺爱某人”。它也可指因被娇惯而变得依赖、软弱的人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat someone too gently or protectively; to spoil them by doing too much for them","zh":"过度溺爱；过分照顾（把某人当成需要被保护的孩子）"},"examples":[{"en":"She worries that the school mollycoddles students instead of helping them become independent.","zh":"她担心学校过度保护学生，而不是帮助他们变得独立。"},{"en":"Don’t mollycoddle him—let him try solving the problem first.","zh":"别太惯着他——先让他自己试着解决问题。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is treated too gently and becomes dependent or weak as a result","zh":"被过度照顾而变得依赖、软弱的人"},"examples":[{"en":"He was no mollycoddle; he learned to handle things on his own.","zh":"他一点也不娇气；他学会了自己处理事情。"}]}],"synonyms":["coddle","spoil","pamper","baby","overprotect"],"phonetic":"/ˈmɑliˌkɑdəl/","extraExplanation":["“mollycoddle”常带批评意味，暗示这种照顾会让人缺乏独立性或抗压能力。","词源上可理解为“molly（女性名/指柔弱的人）+ coddle（溺爱、娇惯）”，所以语气里往往有“把人当成小孩/太软”的感觉。"]}
{"word":"mollycoddling","summary":{"en":"Mollycoddling means excessive pampering or overprotection that can prevent someone from becoming independent.","zh":"mollycoddling 指对人过分溺爱或保护，可能让对方缺乏独立与抗压能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"to treat someone too gently or protectively, in a way that may stop them from becoming independent or resilient","zh":"过分溺爱；过度娇惯；对某人保护得太多，以至于妨碍其独立或变得坚强"},"examples":[{"en":"Some parents worry that too much mollycoddling can leave children unprepared for real-world challenges.","zh":"有些父母担心过度溺爱会让孩子对现实世界的挑战毫无准备。"},{"en":"He felt his boss was mollycoddling him instead of trusting him with harder tasks.","zh":"他觉得老板是在娇惯他，而不是信任他、交给他更难的任务。"}]},{"partOfSpeech":"v.","definition":{"en":"to pamper or overprotect someone excessively","zh":"（对某人）过分娇惯；过度保护"},"examples":[{"en":"Don’t mollycoddle him—let him try to fix it himself first.","zh":"别太娇惯他——先让他自己试着解决。"},{"en":"The coach refused to mollycoddle the team and pushed them to practice in tough conditions.","zh":"教练不愿意对球队过度照顾，而是逼他们在艰苦条件下训练。"}]}],"synonyms":["pampering","coddling","overprotecting","babying","spoiling"],"phonetic":"/ˈmɑliˌkɑd(ə)lɪŋ/","extraExplanation":["“mollycoddle”常带批评语气，暗示“好心但不利于成长”。在职场、教育、育儿话题里很常见。","词源上可理解为“molly（旧时对女性/女孩的昵称）+ coddle（娇养、溺爱）”。因此这个词在表达上也常被用来讽刺某人“被当成小孩一样照顾”。","相关表达：pamper（宠爱/款待，语气不一定批评）；spoil（把人宠坏，批评更强）；overprotect（过度保护，更中性、偏描述）。"]}
{"word":"mollycosset","summary":{"en":"“Mollycosset” means to pamper someone too much (and sometimes the pampered person).","zh":"“mollycosset”指过度溺爱/娇惯某人（有时也指被宠坏的人）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pamper or overprotect someone; to treat someone too gently so they become less independent","zh":"（过度）溺爱、娇惯；把某人保护得太周全以致不够独立"},"examples":[{"en":"His grandparents mollycosset him whenever he visits, so he never learns to do things himself.","zh":"他每次去看望祖父母都会被过度宠着，所以一直学不会自己做事。"},{"en":"Try not to mollycosset new staff—give them support, but also real responsibility.","zh":"别把新员工过度“护着”——可以支持他们，但也要给真正的责任。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is overly pampered or overprotected","zh":"被过度溺爱/过度保护的人"},"examples":[{"en":"He grew up a mollycosset and found it hard to handle setbacks.","zh":"他从小被宠坏，遇到挫折就很难应对。"}]}],"synonyms":["mollycoddle","cosset","pamper","spoil","coddle"],"phonetic":"/ˈmɑliˌkɑsət/","extraExplanation":["“mollycosset”较少见，多被当作“mollycoddle（溺爱、娇惯）”的变体或创造性用法，也可理解为把“mollycoddle”与“cosset（溺爱）”融合在一起的说法。正式写作中更常用“mollycoddle”或“cosset”。"]}
{"word":"mollycot","summary":{"en":"“mollycot” is a rare, old-fashioned noun meaning an effeminate man (often insulting).","zh":"“mollycot”是很少见的旧式名词，指“娘娘腔的男人”，常带贬义/侮辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An effeminate man; a “sissy” (old-fashioned and often insulting).","zh":"（旧式用法，常带侮辱）娘娘腔的男人；“娘炮”。"},"examples":[{"en":"In old novels, a bully might sneer that a gentle boy was a mollycot.","zh":"在一些旧小说里，恶霸可能会嘲笑一个温和的男孩是个“mollycot”。"},{"en":"The term is dated and can be offensive, so it’s better avoided in polite conversation.","zh":"这个词很过时，也可能冒犯他人，所以在礼貌场合最好避免使用。"}]}],"synonyms":["sissy (often offensive)","effeminate man","mollycoddle (related)"],"phonetic":"/ˈmɑliˌkɑt/","extraExplanation":["“mollycot”是非常少见的旧词，意思接近更常见的“mollycoddle”（把人宠得软弱、过分娇惯）或“sissy”（更口语、同样可能带贬义）。它常出现在19世纪前后的文字里，用来嘲讽男性“不够阳刚”。现代英语里谈论性别气质时，更推荐使用中性、尊重的表达（如“gentle”“soft-spoken”），避免把特质当作羞辱。"]}
{"word":"mollyhawk","summary":{"en":"Mollyhawk is an informal word for a softer, playful mohawk-style haircut, often said about kids or pets.","zh":"Mollyhawk 是非正式说法，指较柔和、俏皮的莫霍克头造型，常用于形容孩子或宠物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a playful, informal term for a mohawk-style haircut (often a softer or cuter version, sometimes used for kids or pets).","zh":"一种俏皮、非正式的说法，指“莫霍克头”（mohawk）风格的发型（常指更柔和、更可爱的版本，也常用于孩子或宠物的造型）。"},"examples":[{"en":"He asked the barber for a mollyhawk—like a mohawk, but not too extreme.","zh":"他让理发师给他剪一个“mollyhawk”——像莫霍克头，但别太夸张。"},{"en":"The groomer gave the dog a little mollyhawk for the holiday photos.","zh":"美容师给狗狗做了个小小的“mollyhawk”，好拍节日照片。"}]}],"synonyms":["mohawk","fauxhawk","hawk (haircut, informal)"],"phonetic":"/ˈmɑliˌhɔk/","extraExplanation":["“mollyhawk”并不是非常标准或普遍的词，更像是口语里的创意说法。很多人用它来表达“mohawk（莫霍克头）”的可爱版、弱化版，语气比直接说mohawk更轻松。","在实际使用中，你也可能更常看到 fauxhawk（假莫霍克头/仿莫霍克头）来表示“没那么夸张的莫霍克造型”。"]}
{"word":"mollymawk","summary":{"en":"A mollymawk is an ocean-going seabird, often a fulmar or a small albatross.","zh":"mollymawk指一种远洋海鸟，常指暴风鹱或较小型的信天翁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seabird (often a type of fulmar or a small albatross) found over oceans, known for long gliding flight and following ships","zh":"一种海鸟（常指暴风鹱或较小型的信天翁），生活在大洋上，以长时间滑翔、常跟随船只而闻名"},"examples":[{"en":"A mollymawk circled the ship for hours, riding the wind just above the waves.","zh":"一只mollymawk在船周围盘旋了好几个小时，贴着浪尖乘风滑翔。"},{"en":"Sailors used to watch mollymawks to judge changes in the weather at sea.","zh":"过去水手常观察mollymawk来判断海上的天气变化。"}]}],"synonyms":["fulmar","albatross"],"phonetic":"ˈmɑːliˌmɔːk","extraExplanation":["“mollymawk”是较旧或带海员色彩的词，在不同地区可能指不同的远洋海鸟：常见解释是“暴风鹱（fulmar）”，在一些语境里也可泛指某些较小型的信天翁。","词源一般认为与荷兰语/德语中表示海鸟的词有关（常被解释为“愚笨的海鸥/海鸟”之类的俗称），因此带一点口语与航海传统的味道。"]}
{"word":"molman","summary":{"en":"Molman usually refers to “Moleman” from *The Simpsons* (Hans Moleman), or it can be an informal/misspelled form of “moleman” in jokes or fantasy contexts.","zh":"Molman 通常指《辛普森一家》里的“鼹鼠人”（Hans Moleman）；也可能是 “moleman” 的非正式/误拼，在玩笑或奇幻语境中使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pop-culture name used for Hans Moleman, a minor character from the American TV show *The Simpsons*; often used online as a reference or meme.","zh":"流行文化用法：指美国动画《辛普森一家》（*The Simpsons*）中的配角“汉斯·鼹鼠人”（Hans Moleman），网络上常用来做梗或引用。"},"examples":[{"en":"That joke feels like something Hans Moleman would say.","zh":"那个笑话很像“鼹鼠人”会说的。"},{"en":"People kept posting “Moleman” clips in the comments.","zh":"大家一直在评论区发“鼹鼠人”的片段。"}]},{"partOfSpeech":"n.","definition":{"en":"A misspelling or informal spelling of “moleman” (a man associated with moles or imagined as living underground), used in jokes or fantasy contexts.","zh":"“moleman”的非正式/误拼：在玩笑或奇幻语境里指“与鼹鼠有关的人”或“住在地下的人”。"},"examples":[{"en":"In the story, a molman lives in tunnels under the city.","zh":"在故事里，一个“molman”住在城市地下的隧道中。"}]}],"synonyms":["Moleman","Hans Moleman"],"phonetic":"/ˈmoʊlˌmæn/","extraExplanation":["更常见的拼写是 **Moleman**（或 **Hans Moleman**）。在《辛普森一家》中他通常被塑造成“年纪很大、很脆弱、常常倒霉”的喜剧配角，因此在网络语境里常用来表达“可怜但好笑的倒霉蛋/边缘角色”的感觉。","如果你是在别的作品、游戏ID、姓氏或品牌里看到 **Molman**，也可能只是专有名词（名字/用户名），意思需要结合具体上下文。你可以把原句发我，我可以帮你判断。"]}
{"word":"molmen","summary":{"en":"“Molmen” is usually a proper name, not a standard English vocabulary word; it may also be a misspelling of “moleman/mole men.”","zh":"“Molmen”通常是专有名词，并非标准英语词汇；也可能是“moleman / mole men”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly seen as a proper name (a surname or place/name in some contexts).","zh":"不是标准英语词汇；最常见的用法是专有名词（姓氏或某些语境中的名称/地名等）。"},"examples":[{"en":"Dr. Molmen will speak at the conference tomorrow.","zh":"Molmen 博士明天将在会议上发言。"},{"en":"I found the name “Molmen” in an old family record.","zh":"我在一份旧的家族记录里看到了“Molmen”这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"Possible misspelling of “moleman / mole men” (an imaginary underground-dwelling person in stories or jokes).","zh":"可能是 “moleman / mole men”（“鼹鼠人/住在地下的人”的虚构形象，常见于故事、漫画或玩笑）的拼写错误。"},"examples":[{"en":"In the cartoon, the mole men live under the city.","zh":"在这部动画里，鼹鼠人住在城市地下。"},{"en":"He joked that the missing keys were taken by mole men.","zh":"他开玩笑说丢掉的钥匙是被鼹鼠人拿走了。"}]}],"synonyms":["moleman","mole men","proper name"],"phonetic":"/ˈmoʊlmən/","extraExplanation":["“Molmen”在常见英语词典里通常找不到作为普通词汇的收录，因此更可能是人名/姓氏，或是某个作品、游戏、社群里的专有名词。","如果你是在句子里看到的，请把原句发我；我可以根据上下文判断它是人名、地名，还是想写“moleman/mole men”等词。"]}
{"word":"molmutian","summary":{"en":"Molmutian means “connected with the legendary King Molmutius, especially the traditional Molmutian (Molmutine) Laws.”","zh":"Molmutian 指“与传说中的莫尔穆提乌斯君王有关，尤指传统上的‘莫尔穆提安/莫尔穆提因法’。”"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Molmutius (a legendary ancient king of Britain) or to the “Molmutine/Molmutian Laws” traditionally attributed to him","zh":"与（传说中的）英国古代君王莫尔穆提乌斯（Molmutius）有关的；尤指传统上归于他的“莫尔穆提安/莫尔穆提因法”（Molmutian/Molmutine Laws）"},"examples":[{"en":"Some medieval writers mention the Molmutian Laws as an early foundation of British law.","zh":"一些中世纪作者把“莫尔穆提安法”提到为英国法律的早期基础。"},{"en":"The chronicle calls him a wise ruler and credits him with Molmutian reforms.","zh":"编年史称他为贤明的统治者，并把一些“莫尔穆提安式”的改革归功于他。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, text, or tradition connected with Molmutius or the Molmutian Laws (rare)","zh":"与莫尔穆提乌斯或“莫尔穆提安法”相关的人、文本或传统（较少见）"},"examples":[{"en":"The author quotes a Molmutian to support his argument.","zh":"作者引用了一段“莫尔穆提安”的材料来支持论点。"}]}],"synonyms":["Molmutine"],"phonetic":"/mɑlˈmjuːʃən/","extraExplanation":["“Molmutian”源自拉丁化人名Molmutius（莫尔穆提乌斯）。他常见于中世纪拉丁文与英语史书/传说中（例如与Geoffrey of Monmouth《不列颠诸王史》相关的传统），被说成制定了“Molmutine/Molmutian Laws”。这些法律多被视为传说或后世附会，但在文学与历史叙述里常用来营造“古老、奠基性的法治传统”的氛围。","拼写上常见变体是“Molmutine”，两者在很多语境下可互换；学术写作中常按所引用版本的拼写为准。"]}
{"word":"moloch","summary":{"en":"Moloch is an ancient deity linked to child sacrifice, and by extension a metaphor for any cruel system that demands human sacrifice.","zh":"Moloch 指与献童相关的古代神祇；引申为比喻：任何要求人作出巨大牺牲、极其残酷的体制或力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in the Bible and ancient Near Eastern contexts) an ancient deity associated with child sacrifice, often described as a false god.","zh":"（《圣经》及古代近东语境中）摩洛（Moloch），与献童祭祀相关的古代神祇，常被描述为“假神”。"},"examples":[{"en":"Some biblical passages condemn people who offered children to Moloch.","zh":"一些《圣经》段落谴责人们把孩子献给摩洛。"},{"en":"The poem mentions Moloch as a symbol of cruel worship.","zh":"这首诗提到摩洛，用来象征残酷的崇拜。"}]},{"partOfSpeech":"n.","definition":{"en":"a powerful and destructive system or force that demands great sacrifice from people (often: war, industry, greed, or an inhumane institution).","zh":"（比喻）需要人们付出巨大代价、吞噬生命与良知的强大而毁灭性的体系或力量（常指战争、工业机器、贪婪或非人道制度）。"},"examples":[{"en":"He said the company had become a Moloch that consumed workers’ lives.","zh":"他说这家公司已经变成了一个“摩洛”，吞噬工人的生活。"},{"en":"In the novel, the city is portrayed as a modern Moloch.","zh":"在小说里，这座城市被描绘成现代的“摩洛”。"},{"en":"They refused to feed the Moloch of endless war.","zh":"他们拒绝继续为无休止的战争这一“摩洛”提供牺牲。"}]}],"synonyms":["idol","false god","monster","devouring force","war machine","inhumane system"],"phonetic":"/ˈmoʊlɑk/","extraExplanation":["“Moloch/摩洛”这个词的文化重量很强：它来自《旧约》传统中对某些祭祀行为的谴责，因此在英语里常带有“残酷、非人道、以生命换取利益”的强烈道德评价。","文学中最著名的现代用法之一出现在艾伦·金斯堡（Allen Ginsberg）的诗《嚎叫》（Howl）第二部分：反复呼喊“Moloch!”来象征冷酷的工业文明、资本与体制对人的吞噬。","拼写有时会见到小写 moloch，表示“吞噬性的力量”；大写 Moloch 更像专名，指那位古代神祇。"]}
{"word":"molochize","summary":{"en":"Molochize means to sacrifice or destroy something as if offering it to the cruel god Moloch; figuratively, to devour or ruin like a monstrous force.","zh":"molochize 指把人或物像献给“摩洛”那样残酷地牺牲或毁掉；也可比喻为像怪物般吞噬、摧残。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to sacrifice (someone or something) to Moloch; to destroy or give up in a cruel, ritual-like way","zh":"把（人或物）献祭给摩洛；以残酷、近似献祭的方式毁掉或牺牲"},"examples":[{"en":"In the old legend, the king molochized his enemies as an offering.","zh":"在古老传说里，国王把敌人献祭给摩洛。"},{"en":"The factory’s hunger for profit seemed to molochize workers’ health.","zh":"工厂对利润的贪婪仿佛把工人的健康当作祭品吞噬。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to consume, ruin, or devour as if by a monstrous force","zh":"（比喻）像怪物一样吞噬、毁坏、摧残"},"examples":[{"en":"War molochized a whole generation’s hopes.","zh":"战争吞噬了一整代人的希望。"},{"en":"Endless online outrage can molochize real conversation.","zh":"无休止的网络愤怒会摧残真实的对话。"}]}],"synonyms":["sacrifice","immolate","devour","consume","destroy","ruin"],"phonetic":"/məˈlɑːk.aɪz/","extraExplanation":["“Moloch”源自《圣经》相关传统中与儿童献祭联系在一起的神祇形象；因此 molochize 常带有“以极端残酷的方式把人当作代价”的强烈贬义色彩。","在英语文学里，Moloch 常被用作“吞噬生命的巨兽/机器”的象征（如弥尔顿《失乐园》中将其描绘为嗜战的恶魔形象；近现代写作中也常借此指代战争、工业或制度对人的碾压）。","该词非常罕见，正式写作中更常用 sacrifice, immolate, destroy, devour 等词；若用 molochize，语气会更文学化、更尖锐。"]}
{"word":"molochs","summary":{"en":"Moloch (plural: molochs) refers to an ancient deity associated with horrific sacrifice, and more commonly a metaphor for a destructive power that demands human sacrifice or suffering.","zh":"Moloch（复数：molochs）既可指与骇人祭祀相关的古代神祇，也更常用作比喻，指要求人付出痛苦代价的毁灭性力量或制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually capitalized) An ancient Canaanite deity later described in some biblical and historical sources as being worshiped with extreme rites, including (in some accounts) child sacrifice.","zh":"（通常大写）古代迦南地区的神祇；在一些《圣经》和历史文献中被描述为与极端祭祀相关（部分记载称包括儿童献祭）。"},"examples":[{"en":"Some texts portray Moloch as a symbol of cruel sacrifice.","zh":"一些文本把摩洛（Moloch）描绘成残酷牺牲的象征。"},{"en":"In literature, writers sometimes reference Moloch to evoke fear or moral horror.","zh":"在文学中，作家有时用“摩洛”来唤起恐惧或道德上的震撼。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A powerful system, institution, or desire that consumes people’s lives and demands painful sacrifices.","zh":"（比喻）吞噬人的强大体系／机构／欲望，迫使人付出沉重代价与牺牲。"},"examples":[{"en":"He called the endless work culture a modern Moloch.","zh":"他把无休止的加班文化称为现代的“摩洛”。"},{"en":"War can become a Moloch that devours a generation.","zh":"战争可能成为吞噬一代人的“摩洛”。"},{"en":"She refused to sacrifice her health to that corporate Moloch.","zh":"她拒绝把健康献给那个企业“摩洛”。"}]}],"synonyms":["devourer","monster","juggernaut","oppressive system","idol"],"phonetic":"/ˈmoʊlɑːk/","extraExplanation":["“molochs”是“Moloch”的复数形式，常用于比喻义：多个“吞噬性的力量/体系”。","文化提示：在英语文学与社会批评中，“Moloch”常象征冷酷的工业文明、金钱至上或非人化的制度。著名例子是艾伦·金斯堡（Allen Ginsberg）的诗《嚎叫》（Howl）中反复呼喊“Moloch!”，用来批判压迫性的社会机器。","拼写与用法：作比喻时可小写moloch，但专指神祇通常大写Moloch。"]}
{"word":"molochship","summary":{"en":"A rare noun meaning the Moloch-like character of a cruel system that demands heavy sacrifices.","zh":"一个罕见名词，指“摩洛式”的残酷特质：像吞噬人的制度一样要求巨大的牺牲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The state, character, or spirit of a “Moloch” (a cruel power or system that demands great sacrifice), especially blind devotion to such a force.","zh":"（罕见）“摩洛”（指残酷、吞噬人的力量或制度）的状态或特质；尤指对这种力量的盲目崇拜与献祭式服从。"},"examples":[{"en":"The novel portrays war as a kind of molochship that consumes the young.","zh":"这部小说把战争描写成一种“摩洛式”的存在，吞噬年轻人的生命。"},{"en":"He rejected the molochship of endless work and chose a simpler life.","zh":"他拒绝那种把人献给无尽工作的“摩洛式”生活方式，转而选择更简单的生活。"}]}],"synonyms":["moloch-like cruelty","sacrificial system","devouring machine","ruthlessness"],"phonetic":"/ˈmoʊlɑːkʃɪp/","extraExplanation":["“Moloch”源自《圣经》语境中的摩洛/摩莱克（Molech），常与“以儿童献祭的偶像崇拜”联系在一起。英语里 Moloch 常被引申为“要求人付出巨大代价的残酷机器/制度”（如战争、极端资本逐利、压迫性体制）。-ship 表示“状态/性质”，所以 molochship 可理解为“摩洛式的献祭性与吞噬性”。","该词非常少见，写作中更常用 moloch-like（摩洛般的）或 a Moloch（一个吞噬人的怪物/制度）来表达。"]}
{"word":"molocker","summary":{"en":"“molocker” is not a recognized English word; it’s likely a proper name or a misspelling/abbreviation involving “locker.”","zh":"“molocker”不是标准英语词；多半是专有名词，或与“locker（柜子/寄存柜）”相关的拼写/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a username, brand, product name) or a misspelling of another word.","zh":"不是标准英语词汇。更可能是专有名称（如用户名、品牌、产品名）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “molocker” in an English dictionary—could it be a brand or a username?","zh":"我在英语词典里找不到“molocker”——它会不会是品牌名或用户名？"},{"en":"If you meant “MO locker,” please tell me what MO stands for in your context.","zh":"如果你想写的是“MO locker”，请告诉我在你的语境里 MO 代表什么。"}]}],"synonyms":["locker","storage locker","parcel locker"],"phonetic":"/moʊˈlɑkər/","extraExplanation":["“molocker”看起来像是由“mo + locker”拼在一起的写法，但在英语里并不是常见词。可能的情况：\n1）拼写想写的是 locker（储物柜/寄存柜）或更常见的组合如 parcel locker（快递柜）、storage locker（储物柜）。\n2）是缩写+名词：例如某个系统里的“MO locker”（MO 可能是某部门/州名/业务缩写）。\n3）是专有名词：公司名、App 名、游戏ID等。\n如果你告诉我它出现的句子/领域（学校、物流、软件、游戏等），我可以帮你判断最可能的含义并给出更准确的释义。"]}
{"word":"moloid","summary":{"en":"Moloid is a rare technical adjective meaning “molar-shaped” (like a molar tooth).","zh":"moloid 是罕见的术语形容词，意思是“臼齿状的（像臼齿一样适合研磨）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, technical) Resembling a molar tooth; having a broad, grinding shape like a molar.","zh":"（罕见/术语）类似臼齿的；呈宽大、用于研磨的“臼齿状”。"},"examples":[{"en":"Some mammals have moloid teeth adapted for grinding tough plants.","zh":"一些哺乳动物有臼齿状（moloid）的牙齿，适合研磨坚韧的植物。"},{"en":"The fossil shows a moloid chewing surface, suggesting an herbivorous diet.","zh":"这块化石显示出臼齿状的咀嚼面，暗示它可能以植物为食。"}]}],"synonyms":["molar-shaped","molariform","molar"],"phonetic":"/ˈmoʊlɔɪd/","extraExplanation":["这个词非常少见，多出现在解剖学、动物学或牙科学的描述中。构词上可以理解为“molar（臼齿）+ -oid（……状的）”。日常英语里更常用的表达是 molar / molar-shaped / molariform。","注意不要和 mongoloid（一个带有历史争议、如今多被避免的旧式人类分类用词）混淆；两者词形相近但意义无关。"]}
{"word":"moloker","summary":{"en":"“Moloker” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“moloker”不是标准英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username. Common nearby possibilities include “Moloch” (a destructive force; also a biblical/Canaanite deity) or “mole catcher.”","zh":"不是标准英语单词。很可能是拼写错误，或是人名/用户名。可能接近的词包括 “Moloch”（象征毁灭性力量；亦指《圣经》/迦南文化中的神祇）或 “mole catcher”（捕鼹鼠的人）。"},"examples":[{"en":"I searched for “moloker” in an English dictionary, but it didn’t appear.","zh":"我在英语词典里查了“moloker”，但没有这个词。"},{"en":"Did you mean “Moloch” or another word with a similar spelling?","zh":"你是不是想写“Moloch”或其他拼写相近的词？"}]}],"phonetic":"/ˈmoʊloʊkər/","extraExplanation":["“moloker”本身在常见英语语料与主流词典中不收录。如果你是在小说、游戏、网名或特定社群里看到它，它可能是：①专有名词（人名/地名/角色名）；②外来词的转写；③对某个词（如 Moloch / molar / mole 等）的误拼。","如果你能补充一句原文语境（它出现在什么句子里、指人还是物、是褒义还是贬义、来自哪部作品/哪种语言），我可以更准确判断它可能对应的正确词以及含义。"]}
{"word":"molompi","summary":{"en":"“molompi” is not a standard English word; it’s likely a name or a misspelling and needs context to define accurately.","zh":"“molompi”不是标准英语词；更可能是专有名词或拼写误差，需要上下文才能准确定义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Unknown or not recognized as a standard English word; it may be a misspelling, a name, or a term from a specific language/community.","zh":"非标准英语词汇；可能是拼写错误、人名/地名，或某个特定语言/圈子里的用语。"},"examples":[{"en":"I couldn’t find “molompi” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“molompi”，你能把它出现的句子发我吗？"},{"en":"It might be a name or a brand rather than an English vocabulary word.","zh":"它可能是名字或品牌，而不是英语词汇。"}]}],"phonetic":"/ˈmoʊlɑmpi/","extraExplanation":["“molompi”看起来不像常见英文单词。我可以更准确地帮你：\n1) 你在哪里看到它（书/歌曲/游戏/社交媒体）？\n2) 能否提供一句原句或截图？\n3) 你想查的是不是类似拼写：如“mollify / monopoly / molar / molo …”？\n有了上下文，我可以判断它到底是拼写误差、专有名词，还是其他语言的词。"]}
{"word":"molosse","summary":{"en":"A molosse is a large, strong mastiff-type dog (a molosser).","zh":"molosse 指大型、强壮的獒犬/马士提夫类型犬（莫洛瑟犬类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, powerful mastiff-type dog (a “molosser”), often used for guarding; in French and some English contexts, this word refers to big, heavy-built breeds like mastiffs.","zh":"一种体型巨大、肌肉发达的獒犬/马士提夫类型犬（“莫洛瑟犬”类），常用于看护或护卫；在法语及部分英语语境中，常泛指獒犬等大型壮犬。"},"examples":[{"en":"That rescue center specializes in molosse breeds like mastiffs and bullmastiffs.","zh":"那家救援中心专门救助莫洛瑟犬类，比如马士提夫和斗牛獒。"},{"en":"Because it’s a molosse, early training and socialization are important.","zh":"因为它属于獒犬型（molosse），所以尽早训练和社会化很重要。"}]}],"synonyms":["mastiff","molosser","mastiff-type dog"],"phonetic":"/moʊˈlɔːs/","extraExplanation":["“molosse”常见于法语（也偶见于英语宠物/犬种讨论中），对应英语更常用的说法是“mastiff-type dog / molosser”。词源与古希腊伊庇鲁斯地区的莫洛西亚人（Molossians）有关，据说他们饲养大型护卫犬，因此这种“獒犬型”后来以其族名命名。"]}
{"word":"molosses","summary":{"en":"Molasses is a thick, dark sweet syrup from sugar-making; it’s also used informally to describe something moving very slowly.","zh":"Molasses（糖蜜）是制糖过程中产生的浓稠深色甜糖浆；也可非正式地形容“进展很慢”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled **molasses**) a thick, dark, sweet syrup left over after sugar is made from sugarcane or sugar beets.","zh":"（通常拼作 **molasses**）一种浓稠、深色、甜的糖浆，是用甘蔗或甜菜制糖后剩下的副产品。"},"examples":[{"en":"This gingerbread recipe uses molasses for a deep, rich flavor.","zh":"这份姜饼配方用糖蜜来增加浓郁、厚重的风味。"},{"en":"She stirred molasses into oatmeal to sweeten it.","zh":"她把糖蜜拌进燕麦粥里让它更甜。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) very slow movement or progress.","zh":"（非正式）动作或进展非常缓慢。"},"examples":[{"en":"Traffic was moving like molasses after the accident.","zh":"事故发生后，车流慢得像糖蜜一样。"},{"en":"The paperwork moved at molasses speed.","zh":"文书流程慢得离谱。"}]}],"synonyms":["treacle (BrE)","syrup (general)","slow as molasses (idiom)"],"phonetic":"/məˈlæsɪz/","extraExplanation":["你输入的 **molosses** 在英语里不常见；大多数情况下这是 **molasses**（糖蜜）的误拼或非常少见的变体拼写。","在美国文化与饮食里，molasses 常见于烘焙（如 gingerbread、cookies）以及某些烤肉/酱汁配方中；颜色越深通常风味越强、微苦味更明显。","“like molasses / at a molasses pace” 是常见比喻，用糖蜜的黏稠来形容“慢吞吞”。"]}
{"word":"molossian","summary":{"en":"Molossian means “connected to the ancient Molossians of Epirus,” and can also refer to the people themselves or (historically) to a large mastiff-like dog.","zh":"Molossian 指“与伊庇鲁斯的古代摩罗西亚人有关的”，也可指摩罗西亚人本人；在历史语境中还可指一种体型巨大的、类似獒犬的犬类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Molossians, an ancient Greek tribe from Epirus (in today’s northwestern Greece and southern Albania).","zh":"与摩罗西亚人（Molossians）有关的；摩罗西亚人的——古希腊伊庇鲁斯地区（今希腊西北部与阿尔巴尼亚南部一带）的一个部族。"},"examples":[{"en":"Ancient writers mention Molossian kings who ruled in Epirus.","zh":"古代作家提到过统治伊庇鲁斯的摩罗西亚国王。"},{"en":"The museum has coins from a Molossian settlement.","zh":"博物馆里有来自摩罗西亚人聚居地的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"a Molossian person; a member of the ancient Molossian tribe.","zh":"摩罗西亚人；摩罗西亚部族的成员。"},"examples":[{"en":"The historian described the Molossians as part of the wider Greek world.","zh":"这位历史学家把摩罗西亚人描述为更广泛希腊世界的一部分。"}]},{"partOfSpeech":"adj.","definition":{"en":"(historical) relating to a large, powerful type of dog (a “Molossian hound”), often considered an ancestor of modern mastiff-type breeds.","zh":"（历史用法）指一种体型大、力量强的犬（“摩罗西亚猎犬”），常被认为与现代獒犬类（mastiff-type）祖先有关。"},"examples":[{"en":"Roman texts sometimes praise the strength of Molossian dogs.","zh":"罗马文献有时会称赞摩罗西亚犬的力量。"},{"en":"In art, a Molossian hound is often shown as a large guard dog.","zh":"在艺术作品中，摩罗西亚猎犬常被画成大型看门犬。"}]}],"synonyms":["Epirote","Epirus-related","mastiff-like (for the dog sense)"],"phonetic":"/məˈlɑʃən/","extraExplanation":["“Molossian”来自拉丁语/希腊语对“Molossus/Molossos（摩罗索斯）”的称呼。Molossians生活在伊庇鲁斯（Epirus），在古代希腊世界中有一定影响力。","历史上常提到伊庇鲁斯国王皮洛士（Pyrrhus of Epirus），他出身于摩罗西亚王族；英语里“Pyrrhic victory（皮洛士式胜利）”就与他有关。","“Molossian hound（摩罗西亚犬）”更多是古典文献里的类型称呼，而不是现代犬种的正式名称；现代常见的“mastiff（獒犬）”一词与这种“强壮大型犬”的传统形象相关。"]}
{"word":"molossic","summary":{"en":"Molossic means “related to the ancient Molossians” or, in poetry, “having a molossus rhythm (— — —).”","zh":"molossic 意为“与古代摩洛西亚人相关的”，或在诗歌格律中指“具有摩洛斯格（三个长音节 — — —）节奏的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Molossians (an ancient Greek people of Epirus) or to things associated with them.","zh":"与摩洛西亚人（古希腊伊庇鲁斯地区的一个民族）或其相关事物有关的。"},"examples":[{"en":"The museum displayed Molossic coins from ancient Epirus.","zh":"博物馆展出了来自古代伊庇鲁斯的摩洛西亚钱币。"},{"en":"Historians debate how Molossic leaders influenced regional politics.","zh":"历史学家讨论摩洛西亚统治者如何影响地区政治。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Poetry/metrics) Having the rhythm of a molossus: three long syllables (— — —).","zh":"（诗歌/格律）具有“摩洛斯格”（三个长音节 — — —）节奏的。"},"examples":[{"en":"The line briefly shifts into a Molossic pattern to slow the pace.","zh":"这一行诗短暂转为摩洛斯格节奏，使语速变慢。"},{"en":"In classical metrics, a Molossic foot is rare but striking.","zh":"在古典格律中，摩洛斯格音步不常见，但效果醒目。"}]}],"synonyms":["Molossian (historical sense)","molossus-like (metrics sense)","metrical (broad sense)"],"phonetic":"/məˈlɑːsɪk/","extraExplanation":["“molossic”来自“Molossian”（摩洛西亚人）以及格律术语“molossus（摩洛斯格音步）”。在英语里它属于较少见、偏学术/文献用词，常见于古史、古典学、或诗歌格律分析。","格律意义上的“molossus”指三个长音节（— — —）。在英语诗歌学习中更常见的是 iamb（抑扬格）等；“molossic”多用于讨论希腊、拉丁诗歌的节奏与效果。"]}
{"word":"molossidae","summary":{"en":"Molossidae is the bat family called free-tailed (mastiff) bats.","zh":"Molossidae 指“犬吻蝠科/自由尾蝠科”，即自由尾（犬蝠）类蝙蝠的一个科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of bats known as free-tailed (or mastiff) bats, found in many warm regions and named for their tail extending beyond the tail membrane","zh":"犬吻蝠科（又称“自由尾蝠科/犬蝠科”）：一类蝙蝠的科，常见于温暖地区，其特征之一是尾巴常伸出尾膜之外"},"examples":[{"en":"Many Molossidae bats hunt insects in open air using fast, direct flight.","zh":"许多犬吻蝠科蝙蝠会在开阔空中以快速、直线飞行捕食昆虫。"},{"en":"Scientists recorded echolocation calls to identify which Molossidae species lived near the cave.","zh":"科学家录下回声定位的叫声，以确定洞穴附近生活着哪些犬吻蝠科物种。"}]}],"synonyms":["free-tailed bats","mastiff bats"],"phonetic":"/məˈlɔsɪdi/","extraExplanation":["“Molossidae”是生物分类学中的“科”名，常见中文译名为“犬吻蝠科”。“free-tailed bats（自由尾蝠）”是常用英文俗名，强调其尾巴末端常伸出尾膜这一外形特征。","词源上与拉丁化的属名有关（如 Molossus），而 Molossus 又与古希腊地区/部族名“Molossians”相关；在动物命名中这类借用常用于表达“体型壮、像獒犬”等联想。"]}
{"word":"molossine","summary":{"en":"Molossine is a rare word meaning “Molossian”: related to the ancient Molossians of Epirus, sometimes especially their large guard dogs.","zh":"Molossine 是个罕见词，意思大致等同于 Molossian：与古代伊庇鲁斯的摩罗西亚人有关，有时尤指他们的大型护卫犬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to the Molossians (Molossi), an ancient Greek tribe from Epirus; sometimes used especially in reference to their large guard dogs (Molossian-type dogs).","zh":"（罕见）与“摩罗西亚人/摩罗西人”（古希腊伊庇鲁斯地区的部族）有关的；有时尤指他们饲养的体型大、用于守卫的犬类（“摩罗西亚型”犬）。"},"examples":[{"en":"Ancient writers described Molossine dogs as powerful guardians.","zh":"古代作家把摩罗西亚型犬描写成强壮的护卫犬。"},{"en":"The museum label mentioned a Molossine tribe from Epirus.","zh":"博物馆的说明牌提到了来自伊庇鲁斯的摩罗西亚部族。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A Molossian person; less commonly, a Molossian-type dog.","zh":"（罕见）摩罗西亚人；较少见地指摩罗西亚型犬。"},"examples":[{"en":"The historian wrote about the Molossines who lived in Epirus.","zh":"这位历史学家写到居住在伊庇鲁斯的摩罗西亚人。"}]}],"synonyms":["Molossian","Epirote (context-dependent)","Molossus (related term)"],"phonetic":"/məˈlɔːsaɪn/","extraExplanation":["“Molossine”在现代英语中非常少见，更常见的拼写是 **Molossian**（与摩罗西亚人有关的）或 **Molossus**（可指“摩罗西亚犬”，也可指诗歌格律中的“长长长”音步 *molossus*）。","“Molossian / molosser”常出现在犬类史或犬种分类里，用来泛指獒犬类、护卫犬等“摩罗西亚型”大型犬（并非单一现代品种）。"]}
{"word":"molossoid","summary":{"en":"Molossoid most commonly describes mastiff-like dogs (or a dog of that type); more rarely it refers to the ancient Greek Molossians.","zh":"molossoid 最常指“獒犬型/獒犬般的”或“獒犬型犬”；较少见时指古希腊莫洛西亚人相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dog classification) Relating to or resembling the molosser-type dogs—large, strong dogs like mastiffs and bulldogs.","zh":"（犬类分类）指“莫洛索犬型（獒犬型）”的，或外形/特征类似这类大型强壮犬（如獒犬、斗牛犬）的。"},"examples":[{"en":"The shelter listed him as a molossoid mix with a broad head and heavy build.","zh":"收容所把它登记为獒犬型混种犬，头部宽、体格厚实。"},{"en":"Molossoid breeds often have powerful jaws and muscular bodies.","zh":"獒犬型犬种通常颚部有力、肌肉发达。"}]},{"partOfSpeech":"n.","definition":{"en":"A molosser-type dog; a dog with the typical heavy, powerful build of mastiff-like breeds.","zh":"獒犬型犬；指体格厚重、力量感强、类似獒犬的狗。"},"examples":[{"en":"As a molossoid, the dog needed early training and careful socialization.","zh":"作为獒犬型犬，这只狗需要尽早训练并谨慎进行社会化。"},{"en":"Some people confuse any large dog with a molossoid, but not all big dogs are in this type.","zh":"有些人把任何大狗都当成獒犬型犬，但并不是所有大型犬都属于这一类型。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Historical, rare) Relating to the Molossians, an ancient Greek people of Epirus; or a person from that group.","zh":"（历史用语，较少见）与古希腊伊庇鲁斯地区的莫洛西亚人（Molossians）有关的；或指莫洛西亚人。"},"examples":[{"en":"The text mentions molossoid dogs associated with the Molossians of Epirus.","zh":"文献提到与伊庇鲁斯莫洛西亚人有关的獒犬型犬。"}]}],"synonyms":["molosser (common in dog contexts)","mastiff-like","mastiff-type"],"phonetic":"/məˈlɑːsɔɪd/","extraExplanation":["词源上，molossoid 来自 Molossus / Molossians（莫洛西亚/莫洛西亚人）。古典文献里常提到“Molossian hounds”（莫洛西亚猎犬/战犬），后来在动物学与犬类学中演变为一种体型分类：獒犬型（molosser / molossoid）。","在犬类语境中，molossoid 更偏“体型/头骨结构的类型”而不是具体某一个品种；常见相关品种会被归入或接近这一类型（例如 mastiff 类、部分 bulldog 类等）。"]}
{"word":"molossus","summary":{"en":"Molossus most often means a classical metrical foot of three long/stressed syllables; it can also refer to an ancient Greek person from Epirus or, less commonly, a large mastiff-like dog.","zh":"Molossus 最常指古典格律中的“三长音节音步”；也可指古希腊伊庇鲁斯的摩洛西亚人，或较少见地指獒犬类的大型猛犬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetry & meter) A metrical foot of three long (stressed) syllables: — — —.","zh":"（诗歌与格律）“摩洛苏斯格”（molossus）：由三个长音节（通常相当于三个重读）组成的音步：— — —。"},"examples":[{"en":"In classical meter, a molossus is three long syllables in a row.","zh":"在古典格律中，molossus 指连续三个长音节。"},{"en":"The line briefly slows down when it includes a molossus.","zh":"当诗行里出现 molossus 时，节奏会短暂变得更沉缓。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) A member of the Molossians, an ancient Greek people from Epirus.","zh":"（历史）摩洛西亚人：古希腊伊庇鲁斯（Epirus）地区的一个民族的成员。"},"examples":[{"en":"Ancient sources mention the Molossus as part of Epirus.","zh":"古代文献提到摩洛西亚人属于伊庇鲁斯地区的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A large, powerful Molossian-type dog; by extension, a mastiff-like dog.","zh":"（较少见）摩洛西亚型大型猛犬；引申指獒犬/獒犬类的大型犬。"},"examples":[{"en":"The novel describes a guard dog as a molossus at the gate.","zh":"小说把守门的护卫犬描写成一只 molossus。"}]}],"synonyms":["(meter) long-long-long foot","(dog sense) mastiff","Molossian dog"],"phonetic":"/məˈlɑsəs/","extraExplanation":["“molossus”源自拉丁语，最终来自希腊语，和“Molossians（摩洛西亚人）”有关。古代作者常把伊庇鲁斯地区的强壮猎犬/护卫犬与摩洛西亚人联系起来，因此在英语里也出现了“molossus”指大型猛犬的用法。","格律术语里的 molossus 多见于古典诗歌研究（希腊、拉丁诗），现代英语诗歌课堂中较少遇到，但在讲“音步（foot）”与节奏效果时很有代表性：三个重读连在一起，会让节奏显得厚重、庄严、推进缓慢。"]}
{"word":"molothrus","summary":{"en":"Molothrus is the scientific genus name for cowbirds, birds famous for brood parasitism (laying eggs in other birds’ nests).","zh":"Molothrus 指“牛鹂属”的学名（属名），这些鸟以“巢寄生”（把卵产在其他鸟巢中）而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of cowbirds (New World blackbirds) known for laying their eggs in other birds’ nests (brood parasitism).","zh":"牛鹂属（Molothrus）：一种产于美洲的新大陆黑鸟类群，以把卵产在其他鸟类巢中、由“寄主”抚育幼鸟的“巢寄生”行为而闻名。"},"examples":[{"en":"The brown-headed cowbird is Molothrus ater.","zh":"褐头牛鹂的学名是 Molothrus ater。"},{"en":"Some Molothrus species reduce the breeding success of smaller songbirds by parasitizing their nests.","zh":"一些牛鹂属的物种会通过巢寄生降低体型较小鸣禽的繁殖成功率。"}]}],"synonyms":["cowbird (genus)","brood parasite (bird)"],"phonetic":"/məˈlɑːθrəs/","extraExplanation":["“Molothrus”是鸟类学与生物分类学中常见的拉丁化属名，用于正式、学术场景（如论文、野外记录、物种名录）。日常英语里更常说“cowbird（牛鹂）”。","牛鹂属最广为人知的行为是“brood parasitism（巢寄生）”：雌鸟把卵产在别的鸟巢里，让寄主鸟代为孵化和喂养。这会影响寄主雏鸟的存活，因此在生态保护与管理讨论中常被提及。"]}
{"word":"molpe","summary":{"en":"Molpe is a rare name from Greek mythology, usually referring to a Siren associated with alluring song.","zh":"Molpe 是一个较少见的希腊神话名字，通常指与迷人歌声相关的塞壬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A Siren—one of the mythical sea beings whose beautiful singing lured sailors to danger.","zh":"（希腊神话）塞壬之一——以迷人的歌声引诱水手、使其陷入危险的海上妖灵。"},"examples":[{"en":"In some tellings of Greek myth, Molpe is named as one of the Sirens who sang to passing sailors.","zh":"在一些希腊神话版本中，Molpe 被称为塞壬之一，会对经过的水手歌唱。"},{"en":"The poem compares the city’s nightlife to Molpe’s song—sweet, tempting, and risky.","zh":"这首诗把城市夜生活比作 Molpe 的歌声——甜美、诱人，也充满风险。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, literary) A poetic name for “song” or “singing,” used as a mythic symbol of seductive music.","zh":"（罕见，文学用法）“歌/歌唱”的诗性称呼，用作“迷人歌声”的神话象征。"},"examples":[{"en":"He wrote of Molpe echoing through the hall, meaning not a person but the power of song.","zh":"他写道“Molpe 在大厅回响”，指的并非某个人，而是歌声的力量。"}]}],"synonyms":["Siren","sea nymph","temptress (figurative)","enchanting song (literary sense)"],"phonetic":"/ˈmoʊlpi/","extraExplanation":["Molpe 这个名字来自古希腊语，常被解释为与“歌声、旋律”相关，因此在文学里有时会被借用来象征“诱惑性的歌声”。","“Siren（塞壬）”在现代英语里也可以指“危险而诱人的人/事物”（a siren), 这种引申义就来自类似 Molpe 这样的神话形象。"]}
{"word":"molrooken","summary":{"en":"“Molrooken” is not a recognized English word; it’s likely a misspelling or a proper name.","zh":"“molrooken”不是常见或公认的英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it appears to be a misspelling or a made-up term, so there is no widely accepted dictionary meaning.","zh":"不是标准英语单词；看起来像拼写错误或自造词，因此没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “molrooken” in a dictionary—could you check the spelling or share the context?","zh":"我在词典里查不到“molrooken”——你能检查一下拼写或提供一下上下文吗？"},{"en":"If “molrooken” is a name (a person, place, or brand), its meaning may depend on where you saw it.","zh":"如果“molrooken”是名字（人名、地名或品牌名），它的含义可能取决于你在哪里看到的。"}]}],"phonetic":"/ˌmoʊlˈrʊkən/","extraExplanation":["如果你把它出现的句子（或一张截图）发来，我可以根据上下文推断它可能想表达的词。","它也可能是某个词的误拼。常见的排查方法：对照原文、尝试相近拼写（比如更换一个字母/交换相邻字母）、或用发音去猜可能的目标词。"]}
{"word":"mols","summary":{"en":"“mols” most commonly means the plural of “mol,” a chemistry unit for amount of substance.","zh":"“mols”最常见是“mol（摩尔）”的复数，用于表示物质的量（化学单位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mol: the SI unit for amount of substance in chemistry (6.022×10²³ particles).","zh":"mol 的复数：化学中“物质的量”的国际单位（约等于 6.022×10²³ 个粒子）。"},"examples":[{"en":"The solution contains 2 mols of sodium chloride.","zh":"该溶液含有 2 摩尔的氯化钠。"},{"en":"We used 0.5 mols of oxygen in the reaction.","zh":"这次反应中我们使用了 0.5 摩尔的氧气。"}]}],"synonyms":["moles (plural of mol)"],"phonetic":"/moʊl/","extraExplanation":["“mols”在日常英语里不常单独作为词出现，最常见是在化学/理科语境中作为“mol”的复数（也常写作“moles”）。","注意不要和“moles（痣/鼹鼠）”混淆：那是“mole”的复数，读音不同、含义也不同。"]}
{"word":"molst","summary":{"en":"“molst” is probably a misspelling of “molest,” meaning to harass or disturb someone—often with a sexual-abuse meaning in modern usage.","zh":"“molst”很可能是“molest”的拼写错误，意思是骚扰或打扰某人；在现代语境中常带有性侵/性骚扰的含义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely misspelling) to harass, bother, or disturb someone; in common modern use, it often refers to sexual abuse or unwanted sexual contact.","zh":"（很可能是拼写错误）骚扰、烦扰或打扰某人；在现代常见用法中，常特指性侵/性骚扰或不受欢迎的性接触。"},"examples":[{"en":"He was arrested for molesting a child.","zh":"他因猥亵/性侵儿童而被逮捕。"},{"en":"If someone is molesting you or making you feel unsafe, seek help from a trusted adult or authorities.","zh":"如果有人在骚扰你或让你感到不安全，请向可信赖的成年人或相关机构求助。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Older or more formal) to pester, trouble, or interfere with someone or something.","zh":"（较旧或较正式）纠缠、打扰、妨碍（人或事）。"},"examples":[{"en":"The hikers were told not to molest the wildlife.","zh":"徒步者被告知不要打扰野生动物。"},{"en":"He didn’t want to be molested by constant phone calls.","zh":"他不想被不停的电话打扰。"}]}],"synonyms":["harass","bother","disturb","pester","abuse"],"phonetic":"/məˈlɛst/","extraExplanation":["“molst”不是标准英文拼写；最常见的目标词是“molest”。","“molest”在当代英语里很敏感，很多语境下默认与性侵/性骚扰有关；如果你只是想表达“打扰/烦扰”，更安全常用的词是：bother, disturb, harass（骚扰）, pester（纠缠）。"]}
{"word":"molt","summary":{"en":"Molt means to shed old feathers, fur, or skin (or the period when this happens).","zh":"molt 指（动物）蜕毛、蜕皮、换羽，或指这一过程/时期。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to shed old feathers, fur, or skin so that new growth can replace it (common with birds, insects, and reptiles)","zh":"（鸟类、昆虫、爬行动物等）蜕毛；蜕皮；脱去旧的羽毛/毛发/外皮以长出新的"},"examples":[{"en":"Many birds molt after the breeding season.","zh":"许多鸟类会在繁殖季结束后换羽（蜕羽）。"},{"en":"The snake is molting, so its skin looks dull and loose.","zh":"这条蛇正在蜕皮，所以它的皮看起来暗淡、松松的。"},{"en":"Some insects molt several times as they grow.","zh":"一些昆虫在生长过程中会蜕皮好几次。"}]},{"partOfSpeech":"n.","definition":{"en":"the process or period of shedding old feathers, fur, or skin","zh":"蜕毛/蜕皮的过程；换羽期"},"examples":[{"en":"During the molt, the bird may be less able to fly.","zh":"在换羽期，这只鸟可能不太能飞。"},{"en":"The vet said the lizard’s molt looked normal.","zh":"兽医说这只蜥蜴的蜕皮情况很正常。"}]}],"synonyms":["shed","slough","moult"],"phonetic":"/moʊlt/","extraExplanation":["“molt”常用于自然与动物语境；也可以比喻“摆脱旧习惯或旧身份，进入新阶段”，例如：He finally molted his old fears.（他终于摆脱了旧日的恐惧。）","在美式英语里，“molt”比英式“moult”更常见；含义相同，拼写不同。"]}
{"word":"molted","summary":{"en":"“Molted” means an animal shed old feathers/skin (or figuratively, left something old behind).","zh":"“molted”表示（动物）换羽/蜕皮；也可比喻“摆脱旧的、换上新的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “molt”: to shed old feathers, fur, or skin (and often grow new ones).","zh":"“molt”的过去式/过去分词：（动物）蜕去旧的羽毛、毛皮或外皮（通常会长出新的）。"},"examples":[{"en":"The bird molted in late summer and grew brighter feathers.","zh":"那只鸟在夏末换羽，长出了更鲜艳的羽毛。"},{"en":"Our pet snake molted last week, leaving its old skin in one piece.","zh":"我们的宠物蛇上周蜕皮了，旧皮完整地留了下来。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to cast off something old and take on something new, like habits, roles, or a former image.","zh":"（比喻）脱去旧的东西并换上新的，比如习惯、角色或旧形象。"},"examples":[{"en":"After moving to a new city, she molted her shy persona and became more confident.","zh":"搬到新城市后，她摆脱了害羞的形象，变得更自信。"},{"en":"The company molted its outdated brand and launched a modern design.","zh":"这家公司抛弃了过时的品牌形象，推出了现代化设计。"}]}],"synonyms":["shed","slough","cast off","peel off"],"phonetic":"/ˈmoʊltɪd/","extraExplanation":["“molt”常用于鸟类换羽、蛇和昆虫蜕皮等生物学语境；“molted”是其过去式/过去分词。美式英语里也常用“shed”表达类似意思，但“molt”更偏“周期性、自然发生的更换”。","发音与拼写提示：词尾 -ed 在 /t/ 后通常读作 /ɪd/，所以 molted 读作 /ˈmoʊltɪd/。"]}
{"word":"molten","summary":{"en":"“Molten” means melted by very high heat, especially for metal, rock, or glass.","zh":"“molten”指因高温而熔化成液体的，尤用于金属、岩石或玻璃。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made liquid by great heat; melted (usually used for metal, rock, or glass).","zh":"因高温而变成液体的；熔化的（常用于金属、岩石或玻璃）。"},"examples":[{"en":"Lava is molten rock that flows from a volcano.","zh":"熔岩是从火山流出的熔化岩石。"},{"en":"Workers poured molten steel into a mold to make parts.","zh":"工人把熔融的钢水倒进模具里制作零件。"},{"en":"Be careful—molten glass can cause severe burns.","zh":"小心——熔融玻璃会造成严重烧伤。"}]},{"partOfSpeech":"adj.","definition":{"en":"The past participle of “melt”; became liquid because of heat.","zh":"“melt”的过去分词：因受热而融化成液体。"},"examples":[{"en":"The ice cream had molten before we got home.","zh":"我们到家之前冰淇淋就已经融化了。"},{"en":"The butter is molten—turn off the heat now.","zh":"黄油已经融化了——现在把火关掉。"}]}],"synonyms":["melted","liquid","liquefied","fused"],"phonetic":"/ˈmoʊltən/","extraExplanation":["“molten”在英语里更常搭配“金属/岩石/玻璃”等高温熔化物（molten iron/steel/lava/glass），强调“炽热、可流动”的质感；日常食物或冰用“melted”更自然（melted butter/ice cream）。","常见搭配：molten lava（熔岩）、molten metal（熔融金属）、molten core（地核熔融层/熔融核心）、molten chocolate（融化巧克力，常见于甜点“molten chocolate cake”流心巧克力蛋糕）。"]}
{"word":"moltenly","summary":{"en":"“Moltenly” means “in a molten (melted by heat) way,” but it is very uncommon in everyday English.","zh":"“moltenly”意为“以熔融（被热融化）般的方式”，但在日常英语中非常少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a molten (melted, liquid-from-heat) way; like something that has been melted by heat.","zh":"以熔融（被加热融化成液体）的方式；呈现出像被热融化后的状态。"},"examples":[{"en":"Lava flowed moltenly down the volcano’s slope.","zh":"熔岩以熔融般的姿态沿着火山坡流下。"},{"en":"The metal shone moltenly in the furnace’s intense heat.","zh":"金属在熔炉的高温中闪着熔融般的光。"}]}],"synonyms":["in a molten way","like molten metal","in a molten state"],"phonetic":"ˈmoʊltənli","extraExplanation":["“moltenly”在现代英语里非常少见，更多时候人们会用形容词“molten”（例如：molten metal / molten lava）或用更自然的副词表达（如“like molten metal”“in a molten state”）。如果你写作想要更地道，可以考虑改写成：“The metal shone like molten gold.”（金属像熔化的金子一样发光。）"]}
{"word":"molter","summary":{"en":"A molter is an animal (or figuratively a person/thing) that is shedding an outer layer, like feathers or skin.","zh":"molter指正在换羽、蜕皮或脱壳的动物；也可比喻正在摆脱旧状态、进入新阶段的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an animal (or a person/thing, figuratively) that molts—i.e., sheds feathers, fur, skin, or an outer layer.","zh":"会换羽 / 蜕皮 / 脱壳的动物（也可作比喻：正在“脱去旧壳”、进入新阶段的人或事物）。"},"examples":[{"en":"A molter may look scruffy for a few weeks while new feathers grow in.","zh":"处于换羽期的鸟（molter）可能会邋遢几周，直到新羽毛长出来。"},{"en":"In late summer, many ducks are molters and can’t fly well for a short time.","zh":"夏末时许多鸭子在换羽（是molters），短时间内飞得不太好。"},{"en":"After changing careers, he felt like a molter—awkward at first, but becoming stronger.","zh":"转行后他觉得自己像个“molter”——起初别扭，但慢慢变强。"}]}],"synonyms":["animal that is molting","shedder","molting animal"],"phonetic":"/ˈmoʊltər/","extraExplanation":["“molter”来自动词“molt（换羽/蜕皮/脱壳）+ -er（做……的人/物）”。日常英语里更常说“an animal that is molting”或直接用形容词“molting”。","生物学上，鸟类换羽会更换羽毛；蛇会蜕皮；昆虫和甲壳类会“脱壳/蜕皮”。在换“外层”的期间，它们可能显得毛乱、颜色不均，或暂时更脆弱。"]}
{"word":"molters","summary":{"en":"“Molters” means animals (or individuals) that shed old feathers, skin, or an outer layer—i.e., those that molt.","zh":"“molters”指会蜕皮、换毛或换羽的动物（或个体），即“正在或会进行蜕变外层”的蜕皮者/换毛者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or animals that molt (shed old feathers, skin, or an outer layer) as part of natural growth or seasonal change","zh":"会蜕皮/换毛/换羽的动物（或个体）；蜕皮者、换毛者"},"examples":[{"en":"Birds are molters, replacing old feathers with new ones after the breeding season.","zh":"鸟类会换羽，通常在繁殖季后用新羽毛替换旧羽毛。"},{"en":"The zookeeper separated the molters so they could rest without being bothered.","zh":"饲养员把正在蜕皮（换毛）的动物分开安置，让它们安静休息、不受打扰。"}]}],"synonyms":["animals in molt","shedders","molting animals"],"phonetic":"/ˈmoʊltər/","extraExplanation":["“molters”是“molter”的复数，来自动词“molt”（蜕皮/换毛/换羽）。在自然纪录片、动物学或饲养语境里很常见，比如说某些鸟类、昆虫、爬行动物在特定季节或生长阶段会molt。","日常英语里更常说“animals that are molting / in molt（正在蜕皮/换毛的动物）”，而“molter(s)”更偏书面或分类描述。"]}
{"word":"molting","summary":{"en":"Molting is the act or period of shedding and replacing feathers, skin, hair, or a shell.","zh":"Molting 指动物蜕皮、换羽或脱壳并长出新的外层的过程或时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of shedding and replacing feathers, hair, skin, or an outer shell (common in birds, insects, and reptiles)","zh":"（鸟类、昆虫、爬行动物等）蜕皮／换羽／脱壳并长出新的外层的过程"},"examples":[{"en":"Many birds stop flying well during molting because they are replacing their feathers.","zh":"很多鸟在换羽期飞得不太好，因为它们正在更换羽毛。"},{"en":"The crab hides under rocks while molting, when its shell is soft.","zh":"螃蟹在蜕壳时外壳很软，常躲在岩石下面。"}]},{"partOfSpeech":"adj.","definition":{"en":"shedding and replacing feathers, hair, skin, or an outer shell (used as an -ing form, often before a noun)","zh":"正在蜕皮／换羽／脱壳的（-ing形式，常作定语）"},"examples":[{"en":"A molting snake may look dull and have cloudy eyes.","zh":"正在蜕皮的蛇可能看起来颜色暗淡，眼睛也会发白浑浊。"},{"en":"Molting birds can be more vulnerable to cold weather.","zh":"换羽中的鸟更容易受寒冷天气影响。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “molt”: to shed and replace feathers, hair, skin, or an outer shell","zh":"“molt”的现在分词：蜕皮／换羽／脱壳"},"examples":[{"en":"The geese are molting in late summer.","zh":"这些鹅在夏末换羽。"},{"en":"Some insects die soon after molting into their adult form.","zh":"有些昆虫在蜕变成成虫后不久就会死亡。"}]}],"synonyms":["shedding","moulting (BrE)","sloughing (esp. skin, technical)"],"phonetic":"/ˈmoʊltɪŋ/","extraExplanation":["“molting”在美式英语中常见拼写是 molt / molting；英式英语里也常见 moulting（多了一个u）。","在生物学语境里，molt 常用于鸟类“换羽”、蛇类“蜕皮”、甲壳类“蜕壳”；人类皮肤“脱皮”更常说 peeling 而不是 molting（除非是比喻或文学化表达）。"]}
{"word":"molto","summary":{"en":"Molto means “very/much,” most commonly used in musical directions to intensify the following term.","zh":"Molto 表示“非常/很”，最常见于乐谱指示中，用来加强后面的音乐术语。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(especially in music) very; much; to a great degree.","zh":"（尤用于音乐术语）非常；很；在很大程度上。"},"examples":[{"en":"Play it molto legato—make the notes connect smoothly.","zh":"按 molto legato 来演奏——让音与音之间连接得很顺。"},{"en":"The second movement is marked molto adagio.","zh":"第二乐章标注为 molto adagio（非常缓慢）。"},{"en":"She spoke molto softly, almost like a whisper.","zh":"她说话非常轻，几乎像耳语一样。"}]}],"synonyms":["very","much","greatly","highly"],"phonetic":"/ˈmoʊltoʊ/","extraExplanation":["“molto”来自意大利语，原意是“很多/非常”。英语里主要出现在乐谱的速度、力度和表情标记中，用来加强后面的词：如 molto allegro（非常快）、molto forte（非常强）、molto cresc.（强很多/明显渐强）。在日常英语中单独用“molto”比较少见，更多见于音乐语境或借用意大利语的表达。"]}
{"word":"molts","summary":{"en":"“molts” is the plural of “molt” (shedding periods or shed coverings) or the third-person singular verb meaning “sheds old skin/feathers/fur.”","zh":"“molts”是“molt”的复数（蜕换期或蜕下来的覆盖物），也可作动词第三人称单数，表示“蜕皮/换羽/换毛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Times when an animal sheds its skin, feathers, fur, or shell; the shed covering itself can also be called a “molt.”","zh":"（名词复数）动物蜕皮、换羽、换毛或脱壳的时期；也可指蜕下来的皮/羽/毛/壳。"},"examples":[{"en":"Birds often go through molts after the breeding season.","zh":"鸟类常在繁殖季结束后进入换羽期。"},{"en":"We found snake molts near the rocks.","zh":"我们在岩石旁发现了蛇蜕下来的皮。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) She/He/It sheds old skin, feathers, or fur to grow new ones.","zh":"（动词第三人称单数）它（动物）蜕皮、换羽或换毛，以长出新的覆盖物。"},"examples":[{"en":"This species molts twice a year.","zh":"这种物种一年蜕换两次。"},{"en":"The crab molts and becomes vulnerable for a short time.","zh":"螃蟹脱壳后会在短时间内变得更脆弱。"}]}],"synonyms":["sheds","casts off","sloughs (off)"],"phonetic":"/moʊlts/","extraExplanation":["“molt”常用于生物学语境：鸟类换羽、蛇类蜕皮、甲壳类动物（如螃蟹、龙虾）脱壳都可以用“molt”。\n学习提示：不要和“melt（融化）”混淆；拼写和意思都不同。"]}
{"word":"moltten","summary":{"en":"“Molten” means melted into liquid by heat, especially for lava or metal.","zh":"“Molten”指被高温融化成液体的，尤指熔岩或熔融金属。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spelling note) The correct word is usually “molten,” meaning made liquid by heat; melted.","zh":"（拼写提示）正确拼写通常是“molten”，意思是被高温融化成液体的；熔化的。"},"examples":[{"en":"The correct spelling is “molten,” as in “molten lava.”","zh":"正确拼写是“molten”，比如“molten lava（熔岩）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made liquid by high heat; melted (often used for metal, rock, or glass).","zh":"被高温融化成液体的；熔化的（常用于金属、岩石或玻璃）。"},"examples":[{"en":"Molten lava flowed down the side of the volcano.","zh":"熔岩沿着火山的山坡流下。"},{"en":"The workers poured molten steel into a mold.","zh":"工人把熔化的钢水倒进模具里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Extremely intense, hot, or glowing, like it is melting.","zh":"（比喻）极其炽热、强烈或发光的，像要融化一样。"},"examples":[{"en":"Under the molten afternoon sun, we stayed in the shade.","zh":"在炽热的午后太阳下，我们待在阴凉处。"}]}],"synonyms":["melted","liquid","liquefied"],"phonetic":"/ˈmoʊl.tən/","extraExplanation":["“molten”常见搭配：molten lava（熔岩）、molten metal（熔融金属/金属熔液）、molten glass（熔融玻璃）、molten core（熔融的地核）。","拼写提醒：英语里双写t的“moltten”不常见，通常是把“molten”误写了。"]}
{"word":"molu","summary":{"en":"“Molu” is usually used as a name or nickname rather than a common English word.","zh":"“Molu”通常作为人名或昵称使用，而不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name or nickname used in some cultures (not a standard English vocabulary word).","zh":"人名或昵称（不属于标准英语词汇）。"},"examples":[{"en":"Molu is my classmate; she moved here last year.","zh":"Molu 是我的同学；她去年搬到这里。"},{"en":"People call him Molu for short.","zh":"大家简称他为 Molu。"}]}],"phonetic":"/ˈmoʊlu/","extraExplanation":["“molu”在英语词典里通常不是常见词条；更常见的是作为人名/网名出现。","如果你想查的是某个英文单词，可能是拼写接近的：mole（痣/鼹鼠/间谍）、moll（旧时指“帮派女友/情妇”，语气可能带贬义）、或 Moluccas（摩鹿加群岛，印度尼西亚）。你可以告诉我你想表达的意思或给我一个句子，我可以帮你确认。"]}
{"word":"molucca","summary":{"en":"Molucca most commonly refers to the Moluccas (Molucca Islands), Indonesia’s historic “Spice Islands.”","zh":"Molucca通常指摩鹿加群岛（马鲁古群岛），印度尼西亚历史上的“香料群岛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of islands in eastern Indonesia, historically famous for producing cloves and nutmeg; also called the Moluccas or the Spice Islands.","zh":"印度尼西亚东部的一组岛屿，历史上以盛产丁香和肉豆蔻闻名；也称“马鲁古群岛/摩鹿加群岛”，又称“香料群岛”。"},"examples":[{"en":"European traders once sailed long distances to reach the Moluccas for spices.","zh":"过去欧洲商人曾远航前往摩鹿加群岛购买香料。"},{"en":"The Molucca Islands played a major role in the global spice trade.","zh":"摩鹿加群岛在全球香料贸易中曾扮演重要角色。"}]}],"synonyms":["the Moluccas","Molucca Islands","Spice Islands"],"phonetic":"/məˈlʌkə/","extraExplanation":["“Molucca”常指“the Moluccas / Molucca Islands（摩鹿加群岛）”，在历史书里也常见“the Spice Islands（香料群岛）”。","由于丁香与肉豆蔻在16—17世纪极其珍贵，摩鹿加群岛与欧洲殖民扩张、海上贸易史密切相关。"]}
{"word":"moluccan","summary":{"en":"Moluccan describes something from the Moluccas (Maluku Islands) in Indonesia, or a person from there.","zh":"Moluccan 指与印尼摩鹿加（马鲁古）群岛有关的事物，或来自该地的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Moluccas (Maluku Islands) in eastern Indonesia, or to the people, culture, or languages from there","zh":"与摩鹿加群岛（马鲁古群岛，印尼东部）有关的；或指摩鹿加当地的人、文化或语言的"},"examples":[{"en":"Moluccan music blends local traditions with influences from other Indonesian islands.","zh":"摩鹿加音乐把本地传统与印尼其他岛屿的影响融合在一起。"},{"en":"She studies Moluccan history, especially the spice trade period.","zh":"她研究摩鹿加历史，尤其是香料贸易时期。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Moluccas (Maluku Islands)","zh":"摩鹿加人；来自摩鹿加群岛（马鲁古群岛）的人"},"examples":[{"en":"Many Moluccans live in different parts of Indonesia and abroad.","zh":"许多摩鹿加人生活在印尼各地以及海外。"}]}],"synonyms":["Malukan (less common in English)","from Maluku"],"phonetic":"/məˈlʌkən/","extraExplanation":["“Moluccan”来自英语对“Moluccas（摩鹿加群岛）”的形容词形式。该地区在世界史中常与“香料群岛（Spice Islands）”联系在一起，因为丁香、肉豆蔻等香料曾推动欧洲列强的海上贸易与殖民扩张。","在写作中，你也可能看到“Malukan / Maluku”作为相关用法；“Moluccan”偏向英语传统地名“Moluccas”的派生词。"]}
{"word":"moluccella","summary":{"en":"Moluccella is a plant genus best known for “bells of Ireland,” a popular green ornamental flower.","zh":"Moluccella 是一种植物属，最知名的是“爱尔兰钟花/铃铛花”，常见的绿色观赏花材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aromatic plants in the mint family (Lamiaceae), especially known for the species commonly called “bells of Ireland,” grown as an ornamental flower","zh":"一种唇形科（薄荷科）的芳香植物属，尤其以常作观赏花卉栽培的“爱尔兰钟花 / 爱尔兰铃铛花（bells of Ireland）”最为人熟知"},"examples":[{"en":"Moluccella is often grown for its tall green spikes used in floral arrangements.","zh":"Moluccella 常因其高高的绿色花序而被栽培，用于插花花艺。"},{"en":"The florist paired moluccella with white roses to add height and fresh green color.","zh":"花艺师把 moluccella 和白玫瑰搭配在一起，增加层次高度和清新的绿色。"}]}],"synonyms":["bells of Ireland","Moluccella laevis"],"phonetic":"/məˌlʌkˈsɛlə/","extraExplanation":["Moluccella 在日常英语里更常见的名字是 bells of Ireland（爱尔兰钟花/铃铛花），但它并非原产于爱尔兰，通常被认为原产于西亚一带。之所以得名，多与其绿色“钟形萼片”外观和文化联想有关。","发音提示：重音通常在倒数第二音节（-cel-）附近，读起来像 “muh-LUHK-sel-uh”。"]}
{"word":"moluche","summary":{"en":"“Moluche” is a historical/less common term for the Mapuche people of Chile and Argentina, sometimes referring to western groups.","zh":"“Moluche”是指智利与阿根廷马普切人的一种较少见、偏历史的称呼，有时特指西部族群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical/alternate name for the Mapuche people (an Indigenous people of south-central Chile and southwestern Argentina); sometimes used more specifically for western Mapuche groups.","zh":"（历史/别称）马普切人（智利中南部与阿根廷西南部的原住民族）；有时更具体指西部的马普切族群。"},"examples":[{"en":"Some older books use the word “Moluche” for the Mapuche people.","zh":"一些较早的书会用 “Moluche” 来指马普切人。"},{"en":"Today, many prefer the term “Mapuche,” which is more widely recognized and respectful.","zh":"如今，许多人更倾向使用 “Mapuche（马普切）”，因为更通行也更尊重。"}]}],"synonyms":["Mapuche","(dated) Araucanian"],"phonetic":"/moʊˈluːtʃeɪ/","extraExplanation":["“Moluche”来自马普切语（Mapudungun），常被解释为 molü（西方/西部）+ che（人），可理解为“西方的人”。在英语语境里它较少见，且带有历史文献色彩；写作或正式场合通常建议用更常用的自称/通用称呼 “Mapuche”。","相关历史称呼 “Araucanian（阿劳卡尼亚人）”在当代常被视为过时或不够准确，使用时要注意语境与尊重。"]}
{"word":"molvi","summary":{"en":"Molvi is a South Asian term for a Muslim religious scholar or cleric, and can also be used as a respectful title before a name.","zh":"Molvi 是南亚常用词，指穆斯林宗教学者／教士，也可作姓名前的尊称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) A Muslim religious scholar or cleric, often someone trained in Islamic law and teaching.","zh":"（南亚）毛拉／伊斯兰宗教学者或教士，常指受过伊斯兰法与宗教教育、从事讲学或宗教事务的人。"},"examples":[{"en":"In the village, people asked the molvi to lead the prayer.","zh":"在村里，人们请毛拉带领祈祷。"},{"en":"The molvi taught children how to read the Qur’an.","zh":"毛拉教孩子们诵读《古兰经》。"}]},{"partOfSpeech":"n.","definition":{"en":"A respectful title used before a man’s name for such a scholar (similar to “Cleric/Sheikh” in some contexts).","zh":"用于此类宗教学者姓名前的尊称（在某些语境中类似“教士／谢赫”）。"},"examples":[{"en":"Molvi Rahman spoke at the community gathering.","zh":"拉赫曼毛拉在社区集会上发言。"},{"en":"They invited Molvi Sahib to bless the ceremony.","zh":"他们邀请“毛拉先生”来为仪式祈福。"}]}],"synonyms":["maulvi","moulvi","mullah (often broader/varies by region)","imam (context-dependent)","Islamic scholar"],"phonetic":"/ˈmɑːlvi/","extraExplanation":["“molvi”常见于印度、巴基斯坦、孟加拉等南亚英语语境；也常拼作“maulvi / moulvi”。","含义和使用场景会随地区而变化：有时泛指清真寺里的宗教人士，有时指受过较系统宗教教育、能讲经与解释教法的人。称呼时常带敬称如“Sahib（先生）”。","这个词属于文化特定词汇，使用时建议尊重当事人自我称谓；在正式写作中也可根据语境改用更通用的“imam（伊玛目）”或“Islamic scholar（伊斯兰学者）”。"]}
{"word":"moly","summary":{"en":"Moly is best known as the magical herb in Homer’s *Odyssey* that protects Odysseus from enchantment; it can also mean molybdenum (or molybdenum-based products) in technical contexts.","zh":"Moly最常指《奥德赛》中能抵御魔法的神奇草药；在技术语境中也可指“钼”或含钼产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology/literature) A magical herb that protects against spells or witchcraft, especially the plant Hermes gives Odysseus in Homer’s *Odyssey*.","zh":"（希腊神话/文学）一种具有魔力的草药，能抵御咒语或巫术；尤指荷马《奥德赛》中赫尔墨斯给奥德修斯的“moly”。"},"examples":[{"en":"Hermes gives Odysseus moly to protect him from Circe’s magic.","zh":"赫尔墨斯给奥德修斯“moly”，用来保护他免受喀耳刻的魔法影响。"},{"en":"In some retellings of the myth, moly represents inner strength against temptation.","zh":"在一些神话改写版本中，“moly”象征抵抗诱惑的内在力量。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal/technical) Short for *molybdenum* or for products containing it (for example, molybdenum-based lubricants).","zh":"（非正式/技术）*molybdenum*（钼）的简称；也可指含钼产品（如钼基润滑剂）。"},"examples":[{"en":"This grease contains moly to reduce wear under heavy loads.","zh":"这种润滑脂含有“moly（钼）”，能在重载下减少磨损。"},{"en":"The mechanic recommended a moly additive for the drivetrain.","zh":"修理工建议给传动系统加一种“moly（含钼）”添加剂。"}]}],"synonyms":["(myth) magical herb","(technical) molybdenum","moly lube"],"phonetic":"/ˈmoʊli/","extraExplanation":["“moly”最知名的出处是荷马史诗《奥德赛》：它被描述为“黑色的根、白色的花”，凡人很难挖取，只有神更容易得到。现实中并不确定它对应哪一种植物；学界常把它当作神话象征物来理解。"]}
{"word":"molybdate","summary":{"en":"Molybdate is the molybdenum-oxygen ion (MoO₄²⁻) or a salt containing it, used in industry and chemical testing.","zh":"Molybdate 指钼酸根（MoO₄²⁻）或含该离子的钼酸盐，常用于工业处理与化学检测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound or ion that contains molybdenum and oxygen (the molybdate ion, typically written as MoO₄²⁻); also used for salts that contain this ion","zh":"钼酸盐；含有钼和氧的化合物或离子（钼酸根，常写作 MoO₄²⁻）；也指含该离子的盐"},"examples":[{"en":"Sodium molybdate is often used as a corrosion inhibitor in cooling-water systems.","zh":"钼酸钠常用于冷却水系统中作为缓蚀剂。"},{"en":"The lab measured molybdate levels in the water to monitor pollution.","zh":"实验室测量水中的钼酸盐含量以监测污染。"},{"en":"In some tests, molybdate helps form a colored complex to detect phosphate.","zh":"在一些检测中，钼酸盐会帮助形成有色络合物来检测磷酸盐。"}]}],"synonyms":["molybdate ion","molybdate salt","sodium molybdate (specific)"],"phonetic":"/məˈlɪb.deɪt/","extraExplanation":["“molybdate”属于化学与环境检测领域常见术语：在水质分析里常见“phosphomolybdate（磷钼酸盐/磷钼杂多酸相关）”显色反应，用于测定磷酸盐。","词形来源：molybdenum（钼）+ -ate（表示某类含氧酸根/盐的后缀），所以“molybdate”通常指含钼的含氧酸根或其盐。"]}
{"word":"molybdena","summary":{"en":"Molybdena refers to molybdenum-containing materials (and, less commonly, a molybdate-based orange-red pigment).","zh":"molybdena 指含钼的材料/化合物；较少见时也指钼酸盐体系的橙红色颜料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"molybdenum compounds or materials containing molybdenum (often used in technical or industrial contexts).","zh":"含钼的化合物或材料（常见于技术或工业语境）。"},"examples":[{"en":"The lab stored the molybdena separately because some forms can be toxic if inhaled.","zh":"实验室把含钼材料单独存放，因为某些形态如果被吸入可能有毒。"},{"en":"Steel makers add small amounts of molybdena to improve strength at high temperatures.","zh":"钢铁制造商会加入少量含钼材料，以提高钢在高温下的强度。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a yellow-red industrial pigment made from molybdate compounds (often called “molybdenum orange”).","zh":"（较少见）由钼酸盐类化合物制成的黄红色工业颜料（常称“钼橙”）。"},"examples":[{"en":"The warning label used a molybdena pigment for a bright orange-red color.","zh":"警示标签使用了钼系颜料来呈现醒目的橙红色。"},{"en":"Some artists avoid molybdena pigments because they can fade under strong light.","zh":"一些艺术家会避免使用钼系颜料，因为在强光下可能褪色。"}]}],"synonyms":["molybdenum compounds","molybdenum ores","molybdate (in pigment context)"],"phonetic":"/məˈlɪbdənə/","extraExplanation":["“molybdena”不是日常英语里的常用词，更常见的是“molybdenum”（钼）或更具体的名称（如“molybdenum compounds/oxides/molybdates”）。在材料、冶金、涂料等行业文本里，偶尔会用“molybdena”来泛指“含钼物质”。","词源上与“molybdenum”同源，可追溯到希腊语中与“铅样矿石”相关的词根；早期矿物常被混淆，后来才区分出钼相关矿物与元素。"]}
{"word":"molybdenic","summary":{"en":"Molybdenic means “related to or containing molybdenum,” mainly used in scientific/chemical contexts.","zh":"molybdenic 指“与钼有关或含钼的”，多用于科学/化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Related to the element molybdenum (Mo) or its compounds; containing molybdenum.","zh":"（化学）与元素“钼”（Mo）或其化合物有关的；含钼的。"},"examples":[{"en":"The lab analyzed the sample for molybdenic compounds in the soil.","zh":"实验室分析了土壤样品中是否含有钼化合物。"},{"en":"Molybdenic catalysts are used in some industrial chemical processes.","zh":"在一些工业化学过程中会使用含钼的催化剂。"}]}],"synonyms":["molybdic","of molybdenum","molybdenum-containing"],"phonetic":"/məˌlɪbˈdɛnɪk/","extraExplanation":["“molybdenic”在现代英语里相对少见，更常见的是“molybdic”（如 molybdic acid，钼酸）或直接用“molybdenum + 名词”（如 molybdenum alloy，钼合金）。在阅读化学或材料类文章时看到“molybdenic”，通常可理解为“与钼有关/含钼的”。","词源上来自元素名“molybdenum”（钼）+ 形容词后缀“-ic”，表示“……的、与……有关的”。"]}
{"word":"molybdeniferous","summary":{"en":"An adjective meaning “containing molybdenum,” usually used in geology and mining.","zh":"形容词，意为“含钼的”，多用于地质与采矿语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing molybdenum (a metallic chemical element), especially describing rocks, ores, or soils that have molybdenum in them.","zh":"含钼的（钼是一种金属化学元素）；尤用于描述含有钼的岩石、矿石或土壤。"},"examples":[{"en":"Geologists mapped a molybdeniferous zone near the granite intrusion.","zh":"地质学家在花岗岩侵入体附近绘制了一条含钼带。"},{"en":"The mine targets molybdeniferous ore for industrial use.","zh":"该矿山以开采含钼矿石供工业使用为目标。"},{"en":"Soils can become molybdeniferous naturally in certain volcanic regions.","zh":"在某些火山地区，土壤可能会天然呈现含钼特征。"}]}],"synonyms":["molybdenum-bearing","molybdenum-rich","Mo-bearing"],"phonetic":"/məˌlɪb.dəˈnɪf.ɚ.əs/","extraExplanation":["“molybdeniferous”常见于地质、采矿、矿床学等学术或技术语境，日常英语很少用。","词形结构：molybdenum（钼）+ -ferous（“含有……的/产生……的”，来自拉丁语 ferre“携带”），类似的词还有 carboniferous（含碳的/石炭纪的）、auriferous（含金的）。","钼常用于合金钢等材料中，提高强度和耐高温性能；因此含钼矿床在工业上具有价值。"]}
{"word":"molybdenite","summary":{"en":"Molybdenite is a mineral (MoS₂) and the main ore used to produce molybdenum.","zh":"molybdenite 指辉钼矿（二硫化钼，MoS₂），是提炼钼的重要矿石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, gray mineral made of molybdenum disulfide (MoS₂), and the main natural ore used to produce the metal molybdenum.","zh":"一种柔软的灰色矿物，主要成分为二硫化钼（MoS₂），也是提炼金属“钼”的主要矿石。"},"examples":[{"en":"Molybdenite is the most important ore of molybdenum.","zh":"辉钼矿是钼最重要的矿石。"},{"en":"The geologist found molybdenite in the rock sample.","zh":"地质学家在岩石样本中发现了辉钼矿。"}]}],"synonyms":["molybdenum disulfide","MoS2"],"phonetic":"/məˈlɪbdəˌnaɪt/","extraExplanation":["“molybdenite”通常译为“辉钼矿”。它外观常呈灰黑色、有金属光泽，质地较软，能在纸上留下痕迹，所以有时会被初学者误认为石墨（graphite）。","词源上与“molybdenum（钼）”相关；在矿业与材料领域，钼常用于提高钢材的强度、耐热性与耐腐蚀性，因此辉钼矿在工业上具有重要价值。"]}
{"word":"molybdenous","summary":{"en":"An older adjective meaning “of/containing molybdenum,” often implying a lower oxidation state in molybdenum compounds.","zh":"一个较旧的形容词，表示“钼的/含钼的”，常暗示钼化合物处于较低氧化态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing molybdenum, especially in a lower oxidation state; relating to molybdenum compounds (an older chemistry term).","zh":"含有钼的；（尤指较低氧化态的）钼的、与钼化合物有关的（较旧的化学用语）。"},"examples":[{"en":"Molybdenous compounds are less commonly discussed in modern textbooks than molybdenic ones.","zh":"在现代教材中，“molybdenous（钼的，较低氧化态）”化合物的说法不如“molybdenic”常见。"},{"en":"The paper described a molybdenous salt formed under reducing conditions.","zh":"论文描述了一种在还原条件下形成的钼盐（molybdenous salt）。"}]}],"synonyms":["molybdenum-containing","molybdenic (related term)"],"phonetic":"/məˈlɪbdənəs/","extraExplanation":["“molybdenous”是较传统的无机化学命名方式，常用来暗示“较低价态/较低氧化数”的钼化合物；对应地，“molybdenic”常指较高价态。现代资料中更常直接写清楚具体氧化态（如 Mo(IV)、Mo(VI)），所以你可能在旧文献、词典或历史化学资料里更容易见到它。","词形小提示：molybdenum（钼）+ -ous（常见于表示“具有……性质/较低价态”的形容词后缀，如 ferrous/ ferric）。"]}
{"word":"Molybdenum","summary":{"en":"Molybdenum (Mo) is a metal element used to make alloys—especially steel—stronger and more heat- and corrosion-resistant.","zh":"钼（Mo）是一种金属元素，常用于合金（尤其是钢），以提升强度并增强耐热、耐腐蚀性能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Mo) that is a hard, gray metal, used mainly to make steel and other alloys stronger and more resistant to heat and corrosion","zh":"钼（化学元素符号 Mo）：一种坚硬的灰色金属元素，主要用于增强钢和其他合金的强度，并提高耐热与耐腐蚀性能"},"examples":[{"en":"Molybdenum is added to steel to improve strength at high temperatures.","zh":"在钢中加入钼可以提高其在高温下的强度。"},{"en":"The lab measured the molybdenum content of the alloy.","zh":"实验室测量了该合金中的钼含量。"}]}],"synonyms":["Mo (symbol)","the element molybdenum"],"phonetic":"/məˈlɪbdənəm/","extraExplanation":["“molybdenum”来自新拉丁语，源头与希腊语词根有关，历史上因为某些矿物外观相似，曾与含铅矿物被混淆，后来才被确认为独立元素。","在营养学里，钼也是人体所需的“微量元素”之一，但日常语境中更常出现在材料科学、冶金和化工相关的文本里。"]}
{"word":"molybdenum","summary":{"en":"Molybdenum (Mo) is a metal element used to make steel stronger; it is also a trace mineral the body needs in tiny amounts.","zh":"钼（Mo）是一种金属元素，常用于增强钢材；同时它也是人体所需的微量矿物质，用量很少。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Mo) that is a hard, silvery metal used to strengthen steel and in high‑temperature alloys","zh":"一种化学元素（符号 Mo，钼），呈坚硬的银灰色金属，常用于增强钢材强度及制造耐高温合金"},"examples":[{"en":"Molybdenum is added to stainless steel to improve strength and resistance to corrosion.","zh":"不锈钢中会加入钼，以提高强度和耐腐蚀性。"},{"en":"Some tools keep their hardness at high heat because the alloy contains molybdenum.","zh":"一些工具在高温下仍能保持硬度，是因为合金中含有钼。"}]},{"partOfSpeech":"n.","definition":{"en":"(nutrition) an essential trace mineral needed in very small amounts for certain enzymes in the human body","zh":"（营养学）人体所需的微量矿物质之一，用量极少，帮助某些酶正常工作"},"examples":[{"en":"Molybdenum helps the body’s enzymes break down certain substances.","zh":"钼有助于人体酶分解某些物质。"},{"en":"Most people get enough molybdenum from a normal diet.","zh":"大多数人通过正常饮食就能摄入足够的钼。"}]}],"synonyms":["Mo (symbol)"],"phonetic":"/məˈlɪbdənəm/","extraExplanation":["“molybdenum”源自希腊语词根，意为“像铅的”。早期人们常把含钼的矿石与铅矿混淆，因为外观相似。","在材料科学里，钼常与“chromium（铬）”“nickel（镍）”一起出现，尤其在不锈钢和耐热合金的配方中。"]}
{"word":"molybdic","summary":{"en":"Molybdic means “related to molybdenum,” especially in compounds like molybdic acid (often implying a higher oxidation state).","zh":"molybdic 表示“与钼有关的”，常用于钼酸等化合物名称中（常暗示较高氧化态）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to molybdenum, especially to molybdenum in a high oxidation state (commonly +6), as in molybdic acid or molybdic oxide.","zh":"与钼有关的；尤指钼处于较高氧化态（常见为 +6）时的，如“钼酸（molybdic acid）”或“氧化钼（molybdic oxide）”。"},"examples":[{"en":"The lab prepared molybdic acid for the analysis.","zh":"实验室为分析制备了钼酸。"},{"en":"Molybdic compounds are used in some catalysts.","zh":"某些催化剂会使用含钼（molybdic）的化合物。"}]}],"synonyms":["molybdenum (as an adjective in scientific contexts)","molybdenic (less common)"],"phonetic":"/məˈlɪbdɪk/","extraExplanation":["“molybdic”常见于化学/材料学语境，通常出现在固定搭配里（如 molybdic acid、molybdic oxide）。日常英语里较少单独使用。","词根来自元素名 molybdenum（钼）。在传统无机化学命名中，-ic 往往用来指较高价态（相对地也可能见到 -ous 表示较低价态），因此 molybdic 常暗示较高氧化态的钼化合物。"]}
{"word":"molybdite","summary":{"en":"Molybdite is a yellow mineral (MoO₃) that commonly forms when molybdenite oxidizes.","zh":"molybdite（钼华）是一种黄色的三氧化钼矿物，常由辉钼矿氧化形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow mineral form of molybdenum trioxide (MoO₃), often found as a weathering/oxidation product of molybdenite in ore deposits.","zh":"一种黄色矿物，主要成分为三氧化钼（MoO₃），常作为辉钼矿在矿床中风化/氧化后的产物出现。"},"examples":[{"en":"Geologists identified molybdite as the bright yellow coating on the old molybdenum ore.","zh":"地质学家发现旧的钼矿石表面那层亮黄色覆盖物是钼华。"},{"en":"In the oxidized zone of the deposit, molybdite can form where molybdenite breaks down.","zh":"在矿床的氧化带中，辉钼矿分解时可能会形成钼华。"}]}],"synonyms":["molybdenum trioxide","MoO3"],"phonetic":"/məˈlɪbdaɪt/","extraExplanation":["“molybdite”是矿物学用词，日常英语中很少见；在矿物描述里常强调其颜色（黄色）和成因（辉钼矿的氧化产物）。","词源与“molybdenum（钼）”相关，后缀“-ite”常用于矿物名称，表示“某种矿物/岩石”。"]}
{"word":"molybdocardialgia","summary":{"en":"A very rare medical term meaning heart/chest pain, historically linked in some texts to lead exposure.","zh":"一个极少见的医学词，指心脏/心前区疼痛；旧时部分文献将其与铅暴露联系起来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, very rare) Pain in or around the heart (heartache/angina-like pain), historically described as associated with lead exposure or lead poisoning.","zh":"（医学，极罕见）心脏部位或胸前区疼痛（类似心绞痛/心痛）；旧时文献中有时用来指与铅暴露或铅中毒相关的心前区疼痛。"},"examples":[{"en":"The physician noted molybdocardialgia in a patient with long-term occupational lead exposure.","zh":"医生在一名长期职业性铅暴露的患者病历中记录了“molybdocardialgia（疑似与铅相关的心前区疼痛）”。"},{"en":"This term is rarely used today; clinicians would usually describe the symptom as chest pain or angina.","zh":"这个词如今几乎不用；临床上通常会直接写“chest pain（胸痛）”或“angina（心绞痛）”。"}]}],"synonyms":["chest pain","cardiac pain","angina (context-dependent)"],"phonetic":"/məˌlɪbdoʊˌkɑrdiˈældʒiə/","extraExplanation":["词源拆解：molybdo- 来自希腊语 molybdos，意为“铅”；cardialgia = cardi-（心）+ -algia（痛）。合起来字面意思就是“与铅相关的心痛/心前区痛”。","使用提醒：这属于历史性或非常专业的术语。现代医学写作更常用“chest pain（胸痛）”“cardiac pain（心源性疼痛）”或在明确病因时写“lead poisoning（铅中毒）相关症状”。"]}
{"word":"molybdocolic","summary":{"en":"A rare technical adjective for molybdenum–cholic-acid compounds (often “molybdocolic acid”).","zh":"一个很少见的术语形容词，指钼与胆酸形成的化合物/络合物（常见于“molybdocolic acid/钼胆酸”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical) Relating to a compound or complex formed from molybdenum and cholic acid (a bile acid), especially in older chemical or biochemical writing (often seen in the phrase “molybdocolic acid”).","zh":"（术语）指由钼（molybdenum）与胆酸（cholic acid，一种胆汁酸）形成的化合物或络合物，多见于较早的化学/生化文献中（常以“molybdocolic acid / 钼胆酸（络合物）”出现）。"},"examples":[{"en":"The paper mentions molybdocolic acid as a reagent used in a precipitation test.","zh":"这篇论文提到“molybdocolic acid（钼胆酸）”作为沉淀试验中的试剂。"},{"en":"Because the term is uncommon, many modern texts replace it with a more specific chemical name.","zh":"由于这个词很少见，许多现代教材会用更具体的化学名称来替代它。"}]}],"synonyms":["molybdenum–cholate (more explicit)","molybdocholate (variant, if used in context)"],"phonetic":"/məˌlɪbdoʊˈkɑlɪk/","extraExplanation":["这个词非常罕见，通常不会单独出现，而是作为“molybdocolic acid（钼胆酸/钼-胆酸络合物）”等固定搭配的一部分。在现代文献中，更常用结构更明确的命名方式来描述具体的钼配合物。","如果你是在某篇论文/书里看到它，发我完整句子或上下文（或拍照），我可以帮你确认它指的到底是哪一种具体化合物。"]}
{"word":"molybdodyspepsia","summary":{"en":"A very rare, humorous word meaning indigestion (literally linked to molybdenum).","zh":"一个非常罕见、带玩笑意味的词，表示“消化不良”（字面上与元素“钼”相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, humorous) indigestion; literally, “dyspepsia supposedly caused by molybdenum.”","zh":"（罕见，带玩笑意味）消化不良；字面意思是“据说由钼（molybdenum）引起的消化不良”。"},"examples":[{"en":"He jokingly blamed his stomachache on “molybdodyspepsia.”","zh":"他开玩笑说自己的胃痛是“molybdodyspepsia（钼引起的消化不良）”。"},{"en":"The word molybdodyspepsia shows up more in wordplay than in real medical writing.","zh":"molybdodyspepsia 这个词更多出现在文字游戏里，而不是真正的医学写作中。"}]}],"synonyms":["indigestion","dyspepsia","upset stomach"],"phonetic":"/məˌlɪbdoʊdɪˈspɛpsiə/","extraExplanation":["这是一个非常罕见的“拼造词/玩笑词（nonce word）”，通常用来炫耀超长单词或做填字游戏，并非标准医学术语。","构词上由 molybdo-（与元素“钼”有关）+ dyspepsia（消化不良）组成。现实中如果要表达“消化不良/胃不舒服”，一般直接说 indigestion 或 dyspepsia。"]}
{"word":"molybdomancy","summary":{"en":"Molybdomancy is divination by pouring molten metal into water and reading the shapes it forms.","zh":"Molybdomancy 指把熔化金属倒入水中，通过凝固形状来占卜的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A form of divination that interprets shapes or patterns made by molten metal (especially lead or tin) when it is poured into water.","zh":"一种占卜术：把熔化的金属（尤其是铅或锡）倒入水中，通过凝固后的形状或纹理来解读“预兆”。"},"examples":[{"en":"In the story, the villagers practiced molybdomancy on New Year’s Eve to predict the coming year.","zh":"在故事里，村民会在除夕进行“molybdomancy（金属占卜）”来预测来年的运势。"},{"en":"She tried molybdomancy, studying the cooled metal for signs of travel or good luck.","zh":"她试着做金属占卜，观察凝固后的金属是否暗示旅行或好运。"}]}],"synonyms":["divination","lead-pouring divination","ceromancy (similar method using wax)"],"phonetic":"/məˌlɪbˈdɑmənsi/","extraExplanation":["“molybdomancy”较为罕见，常见于民俗学或历史语境。更常听到的相关词是 *molybdomancy / lead pouring*（“浇铅/浇锡占卜”）或德语文化中的 *Bleigießen*（新年前夜把熔铅倒入水里占卜）。","词源上可拆为：*molybd-*（与“铅”相关的古词根，亦见于 *molybdenum* 钼）+ *-mancy*（占卜，如 *chiromancy* 手相、*necromancy* 亡灵召唤）。因此它字面意思接近“铅占卜/金属占卜”。"]}
{"word":"molybdomenite","summary":{"en":"Molybdenite is a mineral (MoS₂) and the main ore of molybdenum.","zh":"molybdenite 指辉钼矿（MoS₂），是提炼钼的主要矿石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring mineral made mainly of molybdenum disulfide (MoS₂), often found as soft, shiny gray flakes and used as the main ore for producing molybdenum.","zh":"辉钼矿（主要成分为二硫化钼 MoS₂ 的天然矿物），常呈柔软、带金属光泽的灰色片状，是提炼钼的重要矿石。"},"examples":[{"en":"Molybdenite is the most important ore of molybdenum.","zh":"辉钼矿是最重要的钼矿石。"},{"en":"The sample looks like graphite, but the streak test helps distinguish molybdenite from graphite.","zh":"这块样品看起来像石墨，但用条痕测试可以帮助区分辉钼矿和石墨。"},{"en":"Engineers sometimes use molybdenite-based lubricants because the mineral reduces friction.","zh":"工程人员有时会使用含辉钼矿成分的润滑剂，因为它能降低摩擦。"}]}],"synonyms":["molybdenum disulfide","MoS₂"],"phonetic":"/məˈlɪbdəˌnaɪt/","extraExplanation":["你输入的拼写“molybdomenite”在英语中更常见的正确形式是 **molybdenite**（辉钼矿）。在地质学、矿物学和材料工程语境里更常用。","词源上与元素 **molybdenum（钼）** 同源；辉钼矿的化学式通常写作 **MoS₂**。"]}
{"word":"molybdonosus","summary":{"en":"A rare adjective meaning “related to or affected by molybdenum excess (molybdenosis).”","zh":"一个很少见的形容词，指“与钼过量有关/受其影响（钼过量症）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or affected by molybdenum excess (especially the condition called molybdenosis, which can lead to copper deficiency).","zh":"与钼摄入过量有关的；受钼过量影响的（尤指“钼中毒/钼过量症”molybdenosis，可导致铜缺乏）。"},"examples":[{"en":"The veterinarian suspected a molybdonosus condition after the cattle showed signs of copper deficiency.","zh":"兽医在牛群出现铜缺乏症状后，怀疑与钼过量相关的情况。"},{"en":"High-molybdenum soil can increase the risk of molybdonosus problems in grazing animals.","zh":"高钼土壤会增加放牧动物出现钼过量相关问题的风险。"}]}],"synonyms":["molybdenotic","related to molybdenosis","molybdenum-toxic"],"phonetic":"/ˌmɑlɪbˈdiːnəsəs/","extraExplanation":["这个词非常罕见，日常英语中几乎不用；更常见的术语是 **molybdenosis**（名词：钼过量症/钼中毒）或更通行的描述 **molybdenum toxicity**（钼毒性）。你输入的 **molybdonosus** 可能是拼写变体或较旧/专业文献用法。","在畜牧与兽医学语境中，过量钼会干扰铜的吸收与利用，因而常与“铜缺乏”一起讨论；表达时也常直接说 *copper deficiency due to excess molybdenum*（由钼过量导致的铜缺乏）。"]}
{"word":"molybdoparesis","summary":{"en":"A rare medical term for paresis (partial paralysis) associated with molybdenum.","zh":"一个罕见医学词，指与钼相关的轻瘫/部分麻痹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) Partial paralysis or muscle weakness (paresis) believed to be associated with exposure to or imbalance of molybdenum (a chemical element).","zh":"（医学；罕见）据称与钼（化学元素）暴露或失衡有关的轻瘫/不完全瘫痪（肌无力）。"},"examples":[{"en":"The case report mentioned molybdoparesis after suspected occupational exposure to molybdenum compounds.","zh":"该病例报告提到，疑似职业性接触含钼化合物后出现“钼性轻瘫（molybdoparesis）”。"},{"en":"Because the term is uncommon, clinicians usually describe the symptoms as “paresis possibly related to molybdenum.”","zh":"由于这个术语并不常见，临床上通常会描述为“可能与钼相关的轻瘫/肌无力”。"}]}],"synonyms":["molybdenum-associated paresis","molybdenum-induced paresis","toxic paresis"],"phonetic":"/məˌlɪbdoʊpəˈriːsɪs/","extraExplanation":["这是一个非常罕见的组合词：molybdo- 表示“钼/与钼有关”，-paresis 表示“轻瘫、部分麻痹（肌力减弱但未完全瘫痪）”。在现代医学写作中，更常见的表达方式是直接写 “paresis (possibly) related to molybdenum exposure/imbalance”。","注意：钼是必需微量元素，但“钼导致轻瘫”并不是常见、标准化的诊断名称；如果在文献中遇到该词，通常需要结合原文上下文（暴露来源、实验室指标、神经系统检查）来理解。"]}
{"word":"molybdophyllite","summary":{"en":"Molybdophyllite is a rare molybdenum-containing mineral term used mainly in geology/mineralogy.","zh":"molybdophyllite 指一种含钼的罕见矿物，主要用于地质学/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a type of phyllosilicate) that contains molybdenum; it is mainly discussed in geology and mineralogy contexts.","zh":"一种罕见矿物（属于层状硅酸盐/叶硅酸盐类），含有钼元素；主要用于地质学与矿物学语境。"},"examples":[{"en":"Molybdophyllite is a rare mineral, so most people only encounter the word in mineralogy references.","zh":"molybdophyllite 是一种罕见矿物，所以大多数人只会在矿物学资料中见到这个词。"},{"en":"The museum label listed molybdophyllite among several uncommon molybdenum-bearing minerals.","zh":"博物馆的标签把 molybdophyllite 列在几种不常见的含钼矿物之中。"}]}],"synonyms":["(no common everyday synonyms; it is a specific mineral name)"],"phonetic":"/məˌlɪbdoʊˈfɪlaɪt/","extraExplanation":["词源提示：molybdo- 表示“钼（molybdenum）”，phyll- 来自希腊语，意为“叶片/薄片”（常用于表示“层状”结构，如 phyllosilicate 叶硅酸盐），-ite 常见于矿物名称后缀。整体意思可理解为“含钼的层状（叶片状）矿物”。","使用场景：这是高度专业词汇，日常英语几乎不会用到；更常见的相关通用词是 molybdenum（钼）和 mineral（矿物）。"]}
{"word":"molybdosis","summary":{"en":"Molybdosis is molybdenum poisoning or a disease state caused by too much molybdenum exposure.","zh":"Molybdosis 指“钼中毒”，即因钼暴露或摄入过量而造成的中毒/疾病状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition caused by excessive exposure to molybdenum (a metal), leading to molybdenum toxicity (poisoning), especially noted in animals and sometimes in industrial/occupational settings in humans.","zh":"钼中毒；因过量接触或摄入钼（金属元素）而引起的中毒或相关疾病状态，常见于动物，也可见于某些工业/职业暴露的人群。"},"examples":[{"en":"Veterinarians suspected molybdosis when the cattle showed signs of mineral imbalance.","zh":"当牛群出现矿物质失衡的症状时，兽医怀疑是钼中毒（molybdosis）。"},{"en":"Workers in metal-processing plants may be monitored to prevent molybdosis from long-term exposure.","zh":"金属加工厂的工人可能会接受健康监测，以防长期暴露导致钼中毒（molybdosis）。"}]}],"synonyms":["molybdenum poisoning","molybdenum toxicity","molybdenosis"],"phonetic":"/məˌlɪbˈdoʊsɪs/","extraExplanation":["词源提示：molybdenum（钼） + -osis（表示“病态/疾病状态”的后缀）。","在畜牧业语境中，molybdosis 常与“铜缺乏（copper deficiency）”一起被讨论：过多的钼会干扰动物对铜的吸收与利用，因此症状有时更像“继发性铜缺乏”。","该词较少用于日常英语，更常见于兽医学、毒理学与职业健康相关文献。"]}
{"word":"molybdous","summary":{"en":"A chemistry adjective meaning “containing molybdenum,” especially in a lower oxidation state (often Mo(IV)).","zh":"化学形容词，表示“含钼的”，尤指较低氧化态（常指钼(IV)）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing molybdenum, especially molybdenum in a lower oxidation state (traditionally molybdenum(IV)).","zh":"（化学）含钼的；尤指处于较低氧化态的钼（传统上指钼(IV)）。"},"examples":[{"en":"In older chemistry texts, a “molybdous” compound usually refers to molybdenum(IV).","zh":"在较旧的化学教材中，“molybdous（钼亚）”化合物通常指钼(IV)化合物。"},{"en":"The report compared molybdous salts with more oxidized molybdenic species.","zh":"该报告比较了钼亚盐与更高氧化态的钼酸性（molybdenic）物种。"}]}],"synonyms":["molybdenous","molybdenum(IV) (in naming)"],"phonetic":"/məˈlɪbdəs/","extraExplanation":["“molybdous”较少见，很多资料更常用拼写“molybdenous”。两者都对应旧式命名法里的“-ous = 较低氧化态”，“-ic = 较高氧化态”。例如：molybdous（钼亚，较低价）相对 molybdic / molybdenic（钼酸/钼高，较高价）。在现代命名中，常直接写作 molybdenum(IV) 来避免歧义。"]}
{"word":"molys","summary":{"en":"“Molys” most commonly means multiple “moly” items—often molybdenum (in steel/alloys). It can also be the plural of “molly” (MDMA slang) or, rarely, the mythological herb “moly.”","zh":"“molys”最常见指多个“moly”，多与“钼（用于钢/合金）”相关；也可能是“molly（MDMA 俚语）”的复数；少见情况下指希腊神话中的“moly 魔草”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “moly,” meaning the chemical element molybdenum (used in making strong steel and other alloys).","zh":"“moly”的复数形式，指化学元素“钼”（常用于制造高强度钢材与合金）。"},"examples":[{"en":"Some high-strength steels contain molys to improve heat resistance.","zh":"一些高强度钢材含有钼元素，以提高耐热性。"},{"en":"The lab tested several molys in the ore sample.","zh":"实验室检测了矿石样品中的几种钼含量/钼相关成分。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal plural of “molly,” a slang term for MDMA (an illegal recreational drug).","zh":"“molly”的非正式复数形式，俚语中指 MDMA（违禁娱乐性药物）。"},"examples":[{"en":"The club posted warnings about drugs like “molys” and other substances.","zh":"那家俱乐部张贴了关于“molys”等毒品与其他物质的警示。"}]},{"partOfSpeech":"n.","definition":{"en":"Rare plural of “moly,” a magical herb in Greek mythology (notably in Homer’s *Odyssey*).","zh":"较少见的用法：神话中的“moly（魔草）”的复数形式（在荷马《奥德赛》中较著名）。"},"examples":[{"en":"In some retellings, the hero is protected by molys against enchantment.","zh":"在一些改写版本里，英雄靠“moly 魔草”来抵御蛊惑/魔法。"}]}],"synonyms":["moly (molybdenum)","molybdenum","Mo"],"phonetic":"/ˈmoʊliz/","extraExplanation":["“molys”本身不算特别常见，更常见的是单数形式：moly（钼/含钼材料）、molly（俚语）。如果你是在工程、材料或机油语境里看到“moly(s)”，通常指“含钼添加剂/二硫化钼（molybdenum disulfide）”一类，用来减少摩擦与磨损。","神话用法来自《奥德赛》：赫尔墨斯给奥德修斯一种叫“moly”的植物，用来抵抗喀耳刻（Circe）的魔法。现代英语里这类用法多见于文学讨论或改写作品。"]}
{"word":"molysite","summary":{"en":"Molysite is a rare mineral form of ferric chloride, often found near volcanic fumaroles.","zh":"Molysite 是一种罕见的三氯化铁矿物形态，常见于火山喷气孔附近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral form of iron(III) chloride (ferric chloride), typically found as yellow-to-brown coatings near volcanic fumaroles.","zh":"一种罕见矿物，为三氯化铁（铁(III)氯化物、氯化高铁）的天然矿物形态，常以黄至棕色的薄膜或结壳出现在火山喷气孔附近。"},"examples":[{"en":"Molysite can appear as a yellow coating on rocks around volcanic vents.","zh":"Molysite 可能会在火山喷气口周围的岩石上呈现为黄色涂层。"},{"en":"The sample was identified as molysite, a natural form of ferric chloride.","zh":"该样品被鉴定为 molysite，即三氯化铁的天然形态。"}]}],"synonyms":["ferric chloride (mineral form)","iron(III) chloride (mineral form)"],"phonetic":"/ˈmɑːləˌsaɪt/","extraExplanation":["Molysite 多见于火山活动区的喷气孔（fumaroles）附近，由含氯气体与含铁物质反应并在地表沉积形成，常呈薄薄的结壳或粉末状。","不要和 molybdenite（辉钼矿，MoS₂）混淆：两者名字相近，但成分、颜色与产状都不同。"]}

