{"word":"mop","summary":{"en":"A “mop” is a floor-cleaning tool, and to “mop” means to clean with it; “mop up” means wipe up liquid or finish what remains.","zh":"“mop”是拖把；作动词表示用拖把拖地；“mop up”表示把液体擦/拖干，或引申为收尾处理剩余问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tool with a handle and an absorbent head (cloth strings or sponge) used for cleaning floors","zh":"拖把；用来清洁地面的工具（有把手和吸水的布条或海绵头）"},"examples":[{"en":"I need a mop to clean the kitchen floor.","zh":"我需要一把拖把来清洁厨房地面。"},{"en":"The mop is in the closet next to the broom.","zh":"拖把在扫帚旁边的壁橱里。"}]},{"partOfSpeech":"v.","definition":{"en":"to clean (a floor or surface) by wiping it with a mop","zh":"用拖把拖（地）；用拖把清洁（表面）"},"examples":[{"en":"She mops the floor every Friday.","zh":"她每周五拖地。"},{"en":"Please mop up the spilled juice.","zh":"请把洒出来的果汁拖干净。"}]},{"partOfSpeech":"phrase","definition":{"en":"(mop up) to absorb or wipe up a liquid; also to finish dealing with what remains","zh":"（mop up）吸干/擦掉液体；也指“收尾、处理剩下的问题”"},"examples":[{"en":"Use a towel to mop up the water.","zh":"用毛巾把水吸干。"},{"en":"After the main tasks were done, we spent an hour mopping up the details.","zh":"主要任务完成后，我们又花了一小时收尾处理细节。"}]}],"synonyms":["(n.) floor mop","(v.) clean","(phrase) wipe up","(phrase) soak up"],"phonetic":"/mɑp/","extraExplanation":["“mop up”既可字面指“把液体拖/擦干”，也可引申为“解决残局、清理剩余问题”，常见于工作或项目语境（如 mopping up loose ends）。"]}
{"word":"mopan","summary":{"en":"Mopan usually refers to the Mopan Maya people/language, or the Mopan River in Belize and Guatemala.","zh":"Mopan 通常指伯利兹与危地马拉的莫潘玛雅族群/语言，或指莫潘河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A Mayan people in Belize and Guatemala, or the May‑related language they speak (also called Mopan Maya).","zh":"（专有名词）莫潘人：分布在伯利兹与危地马拉的玛雅族群之一；也指他们所说的语言（莫潘玛雅语）。"},"examples":[{"en":"She is studying Mopan to communicate with communities in southern Belize.","zh":"她在学习莫潘玛雅语，以便与伯利兹南部的社区交流。"},{"en":"Mopan is one of several Mayan languages still spoken today.","zh":"莫潘玛雅语是当今仍在使用的多种玛雅语之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) The Mopan River in Guatemala and Belize.","zh":"（专有名词）莫潘河：流经危地马拉与伯利兹的一条河流。"},"examples":[{"en":"They traveled along the Mopan River during the rainy season.","zh":"雨季时他们沿着莫潘河出行。"}]}],"synonyms":["Mopan Maya","Maya (broader term)"],"phonetic":"ˈmoʊpɑːn","extraExplanation":["“Mopan”并不是常见的英语普通词汇，多数情况下是地名/族名（如 Mopan Maya、Mopan River）。","如果你是想输入中文拼音“mō bǎn（模板，template）”或“mó pán（磨盘，millstone）”，对应的英语分别更常用 template / millstone。你可以告诉我你想表达的中文或句子语境，我能帮你选最准确的英文词。"]}
{"word":"mopane","summary":{"en":"Mopane is a southern African tree (and its wood) known for surviving in dry heat and for its very hard, long-lasting timber.","zh":"mopane 指非洲南部的莫潘树及其木材，以耐旱耐热、木质坚硬耐用而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a southern African tree (Colophospermum mopane) that grows in hot, dry areas and provides hard, durable wood and shade; also used to refer to its wood.","zh":"莫潘树（又作 mopani），一种生长在非洲南部炎热干旱地区的树（学名 Colophospermum mopane），木材坚硬耐用；也可指莫潘木材。"},"examples":[{"en":"Mopane trees dominate parts of the savanna in Botswana and Zimbabwe.","zh":"在博茨瓦纳和津巴布韦的部分稀树草原地区，莫潘树占优势。"},{"en":"The fence posts were made from mopane because the wood lasts a long time.","zh":"栅栏柱子用的是莫潘木，因为这种木材很耐久。"}]}],"synonyms":["mopani","Colophospermum mopane"],"phonetic":"/moʊˈpɑːni/","extraExplanation":["“mopane”常见拼写变体是“mopani”。在南部非洲，“mopane woodland（莫潘林地）”是一种重要生态系统，常见于干旱与半干旱地区。","与莫潘树相关的文化与饮食背景：莫潘树叶常是“mopane worm（莫潘虫/莫潘毛虫）”的食物来源；这种昆虫在一些地区会被采集并作为高蛋白食物。","发音与拼写提示：英式与美式写法都常见，但在旅游/自然纪录片中你更可能看到“mopane/mopani”用来描述栖息地或木材。"]}
{"word":"mopani","summary":{"en":"Mopani is a southern African tree (mopane) and also the very hard, durable wood from that tree.","zh":"mopani 指南部非洲的莫潘尼树（也拼作 mopane），也可指这种树的坚硬耐用木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a southern African tree (also spelled mopane) with tough hardwood and butterfly-shaped leaves; its wood is used for fuel and building","zh":"（南部非洲的）莫潘尼树／莫潘树（也拼作 mopane），木质坚硬、叶片呈“蝶形”；木材常用于燃料和建材"},"examples":[{"en":"Mopani trees are common in dry parts of southern Africa.","zh":"莫潘尼树在南部非洲较干旱的地区很常见。"},{"en":"The campfire was made from mopani wood because it burns slowly.","zh":"营火用莫潘尼木柴来生，因为它燃烧得比较慢。"}]},{"partOfSpeech":"n.","definition":{"en":"hardwood from the mopani tree, valued for durability","zh":"莫潘尼木（指莫潘尼树的硬木，因耐用而受重视）"},"examples":[{"en":"This table is made of mopani, so it can handle heavy use.","zh":"这张桌子是莫潘尼木做的，所以很耐用。"},{"en":"Aquarium owners sometimes use mopani driftwood to decorate tanks.","zh":"有些养鱼的人会用莫潘尼沉木来装饰鱼缸。"}]}],"synonyms":["mopane","Colophospermum mopane","mopani wood"],"phonetic":"/moʊˈpɑːni/","extraExplanation":["“mopani / mopane”多见于南部非洲（如博茨瓦纳、纳米比亚、津巴布韦等）的干燥林地与稀树草原，是当地生态系统的重要树种。","莫潘尼树叶也是“莫潘尼虫”（mopane worm，一种可食用毛毛虫/蛾的幼虫）的食物来源；在一些地区它是传统食物与经济来源。"]}
{"word":"mopboard","summary":{"en":"Mopboard means the baseboard along the bottom of an interior wall, protecting it from mops and scuffs.","zh":"mopboard 指室内墙脚处的护墙板（踢脚线），用于保护墙面底部免受拖把清洁和碰擦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a board along the bottom of an interior wall (where the wall meets the floor), meant to protect the wall from mops, scuffs, and dirt; a baseboard/skirting board","zh":"室内墙与地面交界处的护墙板（贴近地面的那条板），用于防止拖把、擦洗或碰擦弄脏/磨损墙面；相当于 baseboard/（英）skirting board"},"examples":[{"en":"Please wipe the mopboard too—the corners collect dust.","zh":"也请把护墙板擦一下——墙角很容易积灰。"},{"en":"The painter taped the mopboard before painting the wall.","zh":"油漆工在刷墙前先把护墙板贴上胶带保护。"},{"en":"Kids’ shoes left marks on the mopboard near the door.","zh":"门口附近的护墙板被孩子的鞋蹭出了印子。"}]}],"synonyms":["baseboard","skirting board","base moulding"],"phonetic":"/ˈmɑpˌbɔrd/","extraExplanation":["“mopboard”在美式英语中偏旧式或较地域化，现代更常说“baseboard”。在英式英语里对应“skirting board”。","词源含义直观：原本用来防止“mop（拖把）”在清洁时把墙面下部弄脏或磨损，因此得名。"]}
{"word":"mopboards","summary":{"en":"Mopboards are baseboards—the boards that run along the bottom of a wall where it meets the floor.","zh":"mopboards 指踢脚线/墙脚板，即墙面与地面交接处沿墙安装的板条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baseboard (also called a skirting board): a board along the bottom of an interior wall where it meets the floor, protecting the wall and covering gaps.","zh":"踢脚线（也叫墙裙板/墙脚板）：安装在室内墙面与地面交接处的木板（或其他材质），用于保护墙面并遮盖缝隙。"},"examples":[{"en":"Dust collects along the mopboards, so I vacuum them every week.","zh":"灰尘容易堆在踢脚线旁，所以我每周都会吸一遍。"},{"en":"They repainted the walls and replaced the old mopboards.","zh":"他们重新刷了墙，还换掉了旧踢脚线。"}]}],"synonyms":["baseboards","skirting boards","base molding"],"phonetic":"/ˈmɑpˌbɔrdz/","extraExplanation":["“mopboard(s)”在美式英语里属于较老或较口语的说法，更常见、通用的词是“baseboard”。在英式英语里常说“skirting board”。它之所以叫“mopboard”，和以前拖地（mop）时水渍容易溅到墙脚有关，装一条板能更耐脏、好清洁。"]}
{"word":"mope","summary":{"en":"“Mope” means to be (or act) sadly and without energy; as a noun it can mean a gloomy person.","zh":"“mope”指闷闷不乐、无精打采地消沉；作名词可指爱愁眉苦脸的人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel or show sadness, boredom, or disappointment, often in a quiet, inactive way","zh":"闷闷不乐；无精打采；（因失望/难过而）郁郁寡欢"},"examples":[{"en":"He’s been moping around the house since the breakup.","zh":"分手后他一直在家里闷闷不乐地晃来晃去。"},{"en":"Don’t just mope—talk to someone about what’s bothering you.","zh":"别光闷着——把困扰你的事跟别人聊聊。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who often looks sad or behaves in a gloomy way (informal)","zh":"爱愁眉苦脸的人；总是闷闷不乐的人（非正式）"},"examples":[{"en":"Stop being such a mope and come join us.","zh":"别这么闷闷不乐了，来和我们一起吧。"}]}],"synonyms":["sulk","brood","languish","mooch (around)","be down"],"phonetic":"/moʊp/","extraExplanation":["“mope”常和副词/介词连用：mope around（无精打采地闲晃）、mope about/over sth（为某事闷闷不乐）。语气上比“be sad”更强调“提不起劲、心情低落又不行动”。"]}
{"word":"moped","summary":{"en":"A moped is a small, low-power motorcycle (often scooter-like), and it can also mean riding one.","zh":"moped 指轻便摩托车，也可作动词表示“骑轻便摩托车”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small motorcycle with an engine (or motor) that is not very powerful; in many places it is similar to a scooter and may have pedals on older models.","zh":"轻便摩托车（小型、动力较弱的摩托车；在很多地方与踏板车相似，旧款可能带脚踏板）。"},"examples":[{"en":"He rides a moped to work because it’s cheap and easy to park.","zh":"他骑轻便摩托车上班，因为便宜又好停车。"},{"en":"You usually need a helmet when riding a moped.","zh":"骑轻便摩托车通常需要戴头盔。"}]},{"partOfSpeech":"v.","definition":{"en":"To travel somewhere on a moped.","zh":"骑轻便摩托车出行。"},"examples":[{"en":"We moped along the beach road at sunset.","zh":"我们在日落时沿着海边公路骑轻便摩托车前行。"}]}],"synonyms":["scooter","small motorcycle"],"phonetic":"/ˈmoʊpɛd/","extraExplanation":["“moped”一词最初来自“motor + pedal（发动机 + 脚踏板）”，因为早期的轻便摩托车常带脚踏板。现代日常英语里，很多人也会把外形相近、排量较小的车统称为 moped，但在不同国家/地区，法律对 moped 与 scooter/motorcycle 的定义（例如最高时速、排量、是否需要驾照）可能不同。"]}
{"word":"mopeder","summary":{"en":"A moped is a small, low-powered motorbike used for short trips.","zh":"moped 指用于短途出行的小型低功率轻便摩托车（助力车）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, light motorcycle with a low-powered engine (often with pedals on older models), used for short-distance travel","zh":"助力车；轻便摩托车（通常发动机较小，早期型号可能带脚踏）"},"examples":[{"en":"He rides a moped to work because it’s cheap and easy to park.","zh":"他骑助力车去上班，因为便宜又好停车。"},{"en":"You may need a license to ride a moped, depending on your country or state.","zh":"根据不同国家或州的规定，骑助力车可能需要驾照。"}]}],"synonyms":["scooter","motorbike","small motorcycle"],"phonetic":"/ˈmoʊpɛd/","extraExplanation":["你输入的“mopeder”很可能是拼写错误，想写的是英文“moped”。","另外，在瑞典语/挪威语等北欧语言里，“mopeder”可能是“moped”的复数形式，意思是“多辆助力车/轻便摩托车”。"]}
{"word":"mopeders","summary":{"en":"“mopeders” is an informal/nonstandard plural noun meaning people who ride mopeds; “moped riders” is more common.","zh":"“mopeders” 是口语/非标准用法，指骑轻便摩托车的人；更常用的是 “moped riders”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/informal) people who ride mopeds (small motorbikes). More common: “moped riders.”","zh":"（非标准/口语）骑轻便摩托车（moped）的人。更常见的说法是 “moped riders（骑轻便摩托的人）”。"},"examples":[{"en":"A group of mopeders parked outside the café.","zh":"一群骑轻便摩托的人把车停在咖啡馆外面。"},{"en":"Some cities have rules about where mopeders can ride.","zh":"一些城市对骑轻便摩托的人可以在哪里行驶有规定。"}]}],"synonyms":["moped riders","people on mopeds"],"phonetic":"/ˈmoʊpɛdərz/","extraExplanation":["“mopeders” 在标准英语里不常见，很多时候会用更自然的说法：moped riders / people on mopeds。","如果你本来想查的是 “mopers”（爱闷闷不乐的人）或 “moped” 的复数 “mopeds”，也可以告诉我你的语境/句子，我可以按正确词条解释。"]}
{"word":"mopeds","summary":{"en":"“Mopeds” is the plural of “moped,” meaning small, lightweight motorized bikes often used for short trips.","zh":"“mopeds”是“moped”的复数，指用于短途出行的小型轻便摩托车（常较轻、易停放）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, lightweight motorized bicycle (often with pedals), usually used for short trips in cities or towns.","zh":"轻便摩托车（常带脚踏板），通常用于城市或城镇的短途出行。"},"examples":[{"en":"She rides a moped to work because it’s cheap and easy to park.","zh":"她骑轻便摩托车上班，因为省钱又好停车。"},{"en":"In many European cities, mopeds are common for short commutes.","zh":"在许多欧洲城市，轻便摩托车很常见，适合短途通勤。"},{"en":"He bought a used moped instead of a car.","zh":"他买了一辆二手轻便摩托车，而不是买汽车。"}]}],"synonyms":["motorbike","small motorcycle","scooter (often used similarly in casual speech)"],"phonetic":"/ˈmoʊˌpɛdz/","extraExplanation":["“moped”这个词来自“motor（发动机）+ pedal（脚踏板）”的合成词，早期的轻便摩托车常常既有小发动机也保留脚踏板。现在不同国家/地区对moped与scooter（踏板摩托车）的法律定义可能不同（如最高时速、排量、是否需要驾照/牌照等），日常英语里两者有时也会被混用。"]}
{"word":"mopehawk","summary":{"en":"“Mohawk” most commonly means the mohawk hairstyle; it can also mean a person from the Mohawk Indigenous nation.","zh":"“mohawk”最常指“莫霍克头”这种发型；也可指“莫霍克族”这一原住民族的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hairstyle in which the sides of the head are shaved (or cut very short) and a strip of longer hair is left in the middle, often styled upright.","zh":"一种发型：头两侧剃光或剪得很短，中间留一条较长的头发带，常被立起造型。"},"examples":[{"en":"He dyed his mohawk bright blue for the concert.","zh":"他为了演唱会把莫霍克头染成了亮蓝色。"},{"en":"The barber shaved the sides and left a thin mohawk down the center.","zh":"理发师把两侧剃短，只在中间留了一条细细的莫霍克发带。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Mohawk people, an Indigenous nation originally from what is now northeastern North America.","zh":"莫霍克族人：北美东北部原住民族群之一的成员。"},"examples":[{"en":"She is Mohawk and speaks about her community’s traditions.","zh":"她是莫霍克族人，经常分享自己社群的传统。"}]}],"synonyms":["mohican (for the hairstyle, BrE usage)","punk hairstyle"],"phonetic":"/ˈmoʊhɔk/","extraExplanation":["“mopehawk”在英语里不常见，最可能是把“mohawk”拼错了（常见于指发型）。如果你指的是另一种特定梗或品牌用法，也可以告诉我语境。","“mohawk”这个发型名称与莫霍克族（Mohawk people）有关。在谈到族群时要注意尊重：常用大写 Mohawk 表示族群；发型通常小写 mohawk。"]}
{"word":"mopeier","summary":{"en":"“Mopier” means “more mopey”: more sad or downcast-looking.","zh":"“mopier”是“mopey（闷闷不乐的）”的比较级，表示“更沮丧/更无精打采”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More sad, bored, or depressed-looking; showing less energy or interest than someone/something else.","zh":"更闷闷不乐的；更无精打采的；比……更显得沮丧/提不起劲。"},"examples":[{"en":"After the rainy weekend, he looked even mopier than usual.","zh":"下了一整周末的雨后，他看起来比平时更闷闷不乐。"},{"en":"This movie’s ending is mopier than the book’s ending.","zh":"这部电影的结尾比原著的结尾更忧伤。"},{"en":"Don’t get mopier—let’s go for a walk and clear your head.","zh":"别更沮丧了——我们出去走走，清醒一下。"}]}],"synonyms":["sulkier","gloomier","more downcast","more dejected"],"phonetic":"/ˈmoʊpiər/","extraExplanation":["你输入的“mopeier”通常被认为是拼写错误；标准拼写是“mopier”，它是形容词“mopey（闷闷不乐的）”的比较级。","拼写规则：以 -y 结尾的形容词变比较级时，常把 y 变成 i 再加 -er：mopey → mopier（不是 *mopeier）。","相关词：mopey（原级），mopiest（最高级）；动词 mope 表示“闷闷不乐地待着/垂头丧气”。"]}
{"word":"mopeiest","summary":{"en":"“Mopeiest” means the most mopey—most sad, gloomy, or lacking energy.","zh":"“mopeiest”意思是“最闷闷不乐/最无精打采/最阴郁的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of mopey: feeling (or looking) the most sad, bored, or gloomy, often in a way that seems quiet and downhearted.","zh":"mopey 的最高级：最闷闷不乐的、最无精打采的、最阴郁的（常指安静地情绪低落、提不起劲）。"},"examples":[{"en":"After the team lost, he was the mopeiest person in the locker room.","zh":"球队输了以后，他是更衣室里最闷闷不乐的人。"},{"en":"Of all the kids at the party, she looked the mopeiest and stayed by herself.","zh":"在聚会的孩子里，她看起来最无精打采，一直独自待着。"},{"en":"Monday mornings are my mopeiest time of the week.","zh":"周一早上是我一周里最提不起劲的时候。"}]}],"synonyms":["gloomiest","saddest","most downhearted","most dejected","most dispirited"],"phonetic":"/ˈmoʊpiɪst/","extraExplanation":["“mopeiest”来自形容词“mopey”（=闷闷不乐的、无精打采的）的最高级形式：mopey → mopier → mopeiest。","“mope”作动词时常表示“闷闷不乐地待着/消沉”，语气偏口语，有时带一点点“有点小情绪、让人担心或觉得扫兴”的感觉。"]}
{"word":"moper","summary":{"en":"A “moper” is a person who often seems sad and quiet, showing their unhappiness by moping.","zh":"“moper”指经常闷闷不乐、安静消沉、爱“闷着”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who often feels sad and shows it in a quiet, inactive way; someone who mopes.","zh":"经常闷闷不乐、无精打采的人；爱闷着的人。"},"examples":[{"en":"Don’t be such a moper—come join us for dinner.","zh":"别老闷着了——来和我们一起吃晚饭吧。"},{"en":"He’s not a moper by nature, but the bad news hit him hard.","zh":"他天性并不爱闷闷不乐，但坏消息让他很受打击。"}]}],"synonyms":["sulker","brooder","gloomy person","downer"],"phonetic":"/ˈmoʊpər/","extraExplanation":["“moper”来自动词“mope”（闷闷不乐、郁郁寡欢）加上表示“做……的人”的后缀“-er”。日常口语里更常直接说“to mope”或形容一个人“mopey”。注意它通常带有轻微批评或不耐烦的语气，使用时要考虑场合与语气。"]}
{"word":"moperies","summary":{"en":"“Moperies” means gloomy, moping moods or periods of feeling low (a rare word).","zh":"“moperies”指忧郁、闷闷不乐的情绪或一段消沉期（较罕见用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"gloomy, inactive moods; periods of moping or feeling low (plural of the rare noun “mopery”).","zh":"忧郁、无精打采的情绪；闷闷不乐、消沉的状态（罕见名词 mopery 的复数）。"},"examples":[{"en":"After the breakup, he fell into a week of moperies and barely left the house.","zh":"分手后，他消沉了一周，几乎不出门。"},{"en":"Try not to give in to the moperies—go for a short walk and get some fresh air.","zh":"尽量别陷入那种郁闷情绪——出去走走，呼吸点新鲜空气。"}]}],"synonyms":["the blues","low spirits","gloom","sadness","moping"],"phonetic":"/ˈmoʊpəriz/","extraExplanation":["“moperies”在现代英语里非常少见；更常见的说法是用动词/短语：to mope，to mope around，或用名词：a slump，the blues，a low mood。","词源上与动词“mope（闷闷不乐、无精打采）”相关；“mopery”指这种行为/状态本身，“moperies”就是这些状态的复数或反复出现的情绪低谷。"]}
{"word":"mopers","summary":{"en":"“Mopers” means people who are sad, gloomy, and lack energy (plural of “moper”).","zh":"“mopers”指闷闷不乐、垂头丧气、无精打采的人（“moper”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of moper: people who mope (move or sit sadly, without energy, often because they feel disappointed or unhappy).","zh":"moper 的复数：指“闷闷不乐的人、郁郁寡欢的人”；常因失望或不开心而无精打采、提不起劲的人。"},"examples":[{"en":"After the exam, the hallway was full of mop ers who thought they had failed.","zh":"考试结束后，走廊里全是一些闷闷不乐的人，觉得自己考砸了。"},{"en":"Don’t be a moper—tell us what’s bothering you.","zh":"别一直闷着不说——告诉我们你在烦什么。"},{"en":"The coach told the mop ers to focus on the next game, not the last loss.","zh":"教练让那些垂头丧气的人把注意力放在下一场比赛上，而不是上一场的失利。"}]}],"synonyms":["gloomy people","sad sacks","sulkers","downcast people"],"phonetic":"/ˈmoʊpərz/","extraExplanation":["“moper”来自动词“mope”（闷闷不乐、无精打采）。在日常英语里，“moper”不算很正式，语气可能带一点批评或不耐烦，意思接近“总爱郁闷的人”。","更常见的说法是用动词或形容词：mope around（在周围无精打采地晃）、be moody / sulky（情绪化/闷闷不乐）。"]}
{"word":"mopery","summary":{"en":"Mopery means gloomy and listless (like moping), or the mood/behavior of moping.","zh":"mopery 指“闷闷不乐、无精打采（像在闷着）”，也可指这种情绪/状态本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"gloomy, listless, or depressed in a way that seems unenergetic or self-pitying; acting like someone who is “moping.”","zh":"闷闷不乐的；无精打采的；（带点自怜地）郁郁寡欢的；像在“闷着不说话/闷闷地发呆”那样。"},"examples":[{"en":"He’s been mopery all afternoon, staring out the window.","zh":"他整个下午都闷闷不乐，望着窗外发呆。"},{"en":"Don’t get mopery—let’s go for a short walk and clear your head.","zh":"别这么郁郁寡欢了——我们出去走走，换换心情。"}]},{"partOfSpeech":"n.","definition":{"en":"a gloomy, moping mood or behavior.","zh":"郁郁寡欢的情绪或表现；闷闷不乐的状态。"},"examples":[{"en":"Her friends were tired of the constant mopery.","zh":"朋友们都受够了她总是闷闷不乐的样子。"}]}],"synonyms":["mopy","gloomy","downcast","listless","melancholy","dejected"],"phonetic":"/ˈmoʊpəri/","extraExplanation":["“mopery”来自动词/名词“mope”（闷闷不乐、无精打采地待着）。语气上常带一点“没精神、在自怜或故意闷着”的感觉，比单纯的“sad（难过）”更像“垂头丧气地发呆”。","在现代英语里更常见的是“mopy”（形容词）和“mope”（动词）；“mopery”偏少见，带一点文学或调侃色彩。"]}
{"word":"mopes","summary":{"en":"“Mopes” means someone feels and shows sadness or boredom, or hangs around listlessly; it’s the he/she/it form of “mope.”","zh":"“mopes”表示（他/她/它）闷闷不乐或无精打采地消磨时间，是动词 mope 的第三人称单数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(3rd person singular of **mope**) to feel sad, down, or bored and show it (often by sitting quietly, looking unhappy). Examples: “He mopes around the house all day.” / “When it rains, she mopes.”","zh":"（**mope** 的第三人称单数）闷闷不乐；情绪低落并表现出来（常指无精打采地待着、看起来不开心）。例：“他整天在家里闷闷不乐地转来转去。” / “一下雨她就郁闷。”"},"examples":[{"en":"He mopes whenever he has to stay home.","zh":"他一被迫待在家里就会闷闷不乐。"},{"en":"Don’t just mope—talk to someone about how you feel.","zh":"别光闷着——把你的感受说出来。"}]},{"partOfSpeech":"vi.","definition":{"en":"to spend time in a listless, unenergetic way; to hang around doing little. Example: “He mopes about after school.”","zh":"无精打采地消磨时间；闲晃不做事。例：“放学后他无精打采地闲晃。”"},"examples":[{"en":"They mopes around the office instead of starting the task.","zh":"他们在办公室里无精打采地晃来晃去，不开始干活。"}]}],"synonyms":["sulks","broods","pines","hangs around","feels down"],"phonetic":"/moʊps/","extraExplanation":["“mopes”最常见是动词第三人称单数（he/she/it mopes）。如果你要说“我/你/他们闷闷不乐”，用 mope：I mope / you mope / they mope。","常见搭配：**mope around**（在某处闷闷不乐地转/闲晃）、**mope about**（无精打采地晃来晃去）。","语气上偏口语，有点“别闹情绪、别摆臭脸”的感觉；更中性的说法可用 **feel down / feel blue**。"]}
{"word":"mopey","summary":{"en":"Mopey describes someone who looks or acts sadly uninterested and low-energy.","zh":"mopey 用来形容一个人看起来或表现得闷闷不乐、提不起劲。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling sad, down, or not interested in doing much; showing low energy because you are unhappy.","zh":"情绪低落的；闷闷不乐的；无精打采的（因为不开心而提不起劲）。"},"examples":[{"en":"He’s been mopey since the breakup.","zh":"分手以后他一直闷闷不乐的。"},{"en":"Don’t be so mopey—let’s go for a walk.","zh":"别这么消沉——我们去散步吧。"},{"en":"She sat in her room all afternoon with a mopey expression.","zh":"她整个下午都待在房间里，表情闷闷不乐。"}]}],"synonyms":["sad","down","gloomy","sullen","dejected"],"phonetic":"/ˈmoʊpi/","extraExplanation":["“mopey”语气偏口语，常带一点点不耐烦或半开玩笑的感觉：说别人mopey，有时是在提醒对方“别一直郁郁寡欢了”。如果想更正式或更同理的表达，可以用“sad / depressed / down”。（注意：depressed也可能指临床抑郁，语境要谨慎。）"]}
{"word":"moph","summary":{"en":"“MOPH” is an abbreviation for “Ministry of Public Health,” a government health authority in some countries.","zh":"“MOPH”常用作“Ministry of Public Health（公共卫生部/卫生部）”的缩写，指一些国家的政府卫生主管机构。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) “Ministry of Public Health” (used in some countries as the name of a government health agency).","zh":"（缩写）“公共卫生部/卫生部”（一些国家对政府卫生机构的称呼）。"},"examples":[{"en":"The MOPH issued new guidelines for disease prevention.","zh":"公共卫生部（MOPH）发布了新的疾病预防指南。"},{"en":"She works with the MOPH on vaccine distribution.","zh":"她与公共卫生部（MOPH）合作进行疫苗分发。"}]}],"synonyms":["Ministry of Health","MOH"],"phonetic":"/ˌɛm oʊ piː ˈeɪtʃ/","extraExplanation":["“moph/MOPH”不是常见的英语词汇，更多见于特定国家或文件里的机构缩写。不同国家的全称可能略有差异，但通常都与政府的公共卫生管理有关。","如果你本来想查的是“morph”（意为“逐渐变化/变形”），请告诉我，我可以把“morph”的发音、词义和例句也给你。"]}
{"word":"mophead","summary":{"en":"Mophead can mean a messy-haired person (informal) or a hydrangea with big round flower clusters.","zh":"mophead 可指（非正式）“拖把头”般乱发的人，也可指花团大而圆的绣球花品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person whose hair is thick, messy, or sticks out like a mop; used as a teasing nickname.","zh":"（非正式）头发又厚又乱、像拖把一样的人；常作调侃性的绰号。"},"examples":[{"en":"After he woke up, his friends called him a mophead because his hair was everywhere.","zh":"他刚起床时头发乱七八糟，朋友就叫他“拖把头”。"},{"en":"She tried to smooth down her mophead hairstyle before the meeting.","zh":"开会前她试着把一头“拖把头”理顺。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of hydrangea with large, round clusters of flowers (a “mophead hydrangea”).","zh":"一种绣球花：花序大而圆，成团像“拖把头”（大花绣球/雪球绣球）。"},"examples":[{"en":"The garden had blue mopheads blooming along the fence.","zh":"篱笆旁一排蓝色的大花绣球正在盛开。"},{"en":"Mophead hydrangeas often have big, ball-shaped flowers.","zh":"大花绣球常开出很大的球形花团。"}]}],"synonyms":["messy-haired person","bedhead (informal)","mophead hydrangea","hydrangea"],"phonetic":"/ˈmɑpˌhɛd/","extraExplanation":["“mophead”由 mop（拖把）+ head（头）组成，形象地形容头发像拖把一样蓬乱。用于称呼人时可能带有取笑意味；如果不熟悉对方，最好避免使用。","园艺语境里，“mophead hydrangea”指花球饱满的绣球类型；与花序较扁平、边缘有大花的“lacecap hydrangea（蕾丝帽绣球）”相对。"]}
{"word":"mopheaded","summary":{"en":"Mopheaded describes someone with thick, messy hair like a mop.","zh":"mopheaded 用来形容头发浓密蓬乱、像拖把一样的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having thick, messy, or shaggy hair that looks like a “mop.”","zh":"（头发）蓬乱浓密的；像“拖把”一样乱蓬蓬的。"},"examples":[{"en":"A mopheaded boy opened the door, his hair sticking up in every direction.","zh":"一个头发乱蓬蓬的男孩打开了门，头发朝四面八方翘着。"},{"en":"She remembered him as a mopheaded teenager with a shy smile.","zh":"她记得他是个头发蓬乱、笑容腼腆的少年。"}]}],"synonyms":["shaggy-haired","tousle-haired","messy-haired","unkempt"],"phonetic":"/ˈmɑpˌhɛdɪd/","extraExplanation":["“mopheaded”（也常写作 mop-headed）来自把一大团乱发比作“mop（拖把）”的形象说法，语气多为口语、带点幽默或描写性；但在某些语境也可能显得不够礼貌，描述陌生人时需注意。"]}
{"word":"mopheadedness","summary":{"en":"Mopheadedness means the state of having messy, mop-like hair, and sometimes a carefree, unpolished look.","zh":"mopheadedness 指“拖把头”般乱蓬蓬头发的状态，也可引申为随性、不修边幅的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of having “mop-headed” hair—thick, long, or untidy hair that looks like a mop.","zh":"“拖把头”的样子；指头发浓密、较长或蓬乱，像拖把一样的状态。"},"examples":[{"en":"His mopheadedness made him look younger than he really was.","zh":"他那一头“拖把头”让他看起来比实际年龄更小。"},{"en":"After the camping trip, her mopheadedness was beyond saving without a shower.","zh":"露营回来后，她的头发乱得像“拖把头”，不洗澡根本救不回来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, informal) A rough, unpolished, or carefree look or vibe, often linked to messy hair.","zh":"（比喻；非正式）一种不修边幅、随性甚至有点“邋遢酷”的气质，常与乱发形象相关。"},"examples":[{"en":"The band leaned into a bit of mopheadedness to match their garage-rock sound.","zh":"这支乐队故意保留一点“拖把头”的不修边幅感，来贴合他们的车库摇滚风格。"},{"en":"In the novel, the hero’s mopheadedness signals that he doesn’t care about polite society.","zh":"在小说里，男主角的“拖把头”暗示他不在乎上流社会的礼仪与眼光。"}]}],"synonyms":["messy-hairedness","shagginess","unkemptness","scruffiness"],"phonetic":"/ˈmɑpˌhɛdɪdnəs/","extraExplanation":["这个词由形容词 mop-headed（头发像拖把一样乱/蓬松）加名词后缀 -ness（表示“性质/状态”）构成，因此语气往往带点幽默、调侃或亲切。","mophead/mop-headed 在英语里常用来形容“乱蓬蓬的头发”，有时也会用来塑造人物形象：随性、叛逆、艺术气质，或单纯是没打理。正式写作中较少见，更多出现在口语、描写性文字或文学风格中。"]}
{"word":"mopier","summary":{"en":"“Mopier” means “more mopey”: more gloomy, sad, or lacking energy.","zh":"“mopier”表示“更闷闷不乐/更无精打采的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More mopey; more gloomy, sad, or lacking energy (comparative form of “mopey”).","zh":"更闷闷不乐的；更无精打采的（“mopey”的比较级）。"},"examples":[{"en":"He’s been mopier since the exam results came out.","zh":"自从考试成绩出来后，他变得更闷闷不乐了。"},{"en":"Try not to get mopier every time it rains.","zh":"别一下雨就变得更郁闷。"},{"en":"She looked mopier than usual at lunch.","zh":"午餐时她看起来比平时更没精神。"}]}],"synonyms":["gloomier","sulkier","more down","more blue"],"phonetic":"ˈmoʊpiər","extraExplanation":["“mopier”是形容词“mopey”的比较级，拼写规则是以 -y 结尾时通常变为 -ier（mopey → mopier）。常用于描述情绪低落、无精打采、提不起劲的状态。注意它偏口语，语气比“depressed（抑郁）”轻，通常不指临床意义的抑郁。"]}
{"word":"mopiest","summary":{"en":"“Mopiest” means “the most mopey”: the saddest or most down/low-energy in a group or situation.","zh":"“mopiest”意为“最闷闷不乐/最无精打采的”，用于比较一群人或某种情境中谁最显得低落。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “mopey”: the most sad, bored, or lacking energy; looking down or discouraged.","zh":"“mopey”的最高级：最闷闷不乐的；最无精打采的；看起来最沮丧的。"},"examples":[{"en":"Of all the kids at the party, Ben looked the mopiest.","zh":"在派对上所有孩子里，本看起来最闷闷不乐。"},{"en":"It was the mopiest Monday morning after the long vacation ended.","zh":"长假结束后的周一早晨最让人提不起劲。"},{"en":"Don’t be the mopiest person in the room—tell us what’s wrong.","zh":"别当屋里最沮丧的那个人——告诉我们怎么了。"}]}],"synonyms":["gloomiest","sulleniest","glummest","most downcast","most dejected"],"phonetic":"/ˈmoʊpiəst/","extraExplanation":["“mopiest”来自形容词“mopey”（闷闷不乐的、无精打采的）的最高级。规则变化：mopey → mopier → mopiest（y 变 i 再加 -est）。","“mopey”常描述一种持续的、低落但不一定很强烈的情绪或状态，语气较口语、偏轻微责备或调侃；如果是很严重的悲伤，英语更常用“depressed / devastated”等更强烈的词。"]}
{"word":"moping","summary":{"en":"“Moping” describes being gloomy and low-energy, or the act of spending time in that unhappy way.","zh":"“moping”表示闷闷不乐、无精打采；也可指以这种消沉的状态度日。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling sad, discouraged, or unhappy, often shown by slow, drooping behavior.","zh":"闷闷不乐的；垂头丧气的（常表现为无精打采、慢吞吞的样子）。"},"examples":[{"en":"She’s been moping around the house all day.","zh":"她一整天都在家里闷闷不乐地转来转去。"},{"en":"Stop moping and come have lunch with us.","zh":"别再垂头丧气了，来和我们一起吃午饭吧。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “mope”: to spend time in a gloomy, unhappy way, often doing very little.","zh":"“mope”的现在分词：闷闷不乐地消磨时间；无精打采地待着（常常什么也不想做）。"},"examples":[{"en":"He was moping after the breakup.","zh":"分手后他一直闷闷不乐。"},{"en":"Don’t just sit there moping—tell me what happened.","zh":"别只坐那儿闷着——告诉我发生了什么。"}]}],"synonyms":["gloomy","sulky","down","depressed","brooding"],"phonetic":"/ˈmoʊpɪŋ/","extraExplanation":["“mope / moping”在口语里很常见，语气通常带一点劝人振作或轻微责备的感觉：别人认为你在“消沉、没劲儿、什么都不做”。","常见搭配：mope around（在…附近闷闷不乐地晃）、mope about/over sth（为某事闷闷不乐）。","注意区分：mop（拖地）和 mope（闷闷不乐）拼写很像，但意思完全不同。"]}
{"word":"mopingly","summary":{"en":"“Mopingly” means “in a gloomy, low-energy way,” often showing boredom or sadness.","zh":"“mopingly”表示“闷闷不乐、无精打采地”，常带有无聊或情绪低落的意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sad, bored, or depressed way; with low energy and little interest in what is happening.","zh":"以闷闷不乐、无精打采（有点抑郁或无聊）的方式；提不起劲、对周围事情缺乏兴趣地。"},"examples":[{"en":"He sat mopingly by the window all afternoon.","zh":"他整个下午都闷闷不乐地坐在窗边。"},{"en":"She answered mopingly, as if nothing could cheer her up.","zh":"她无精打采地回答，仿佛什么都无法让她振作起来。"},{"en":"After the argument, they walked home mopingly in silence.","zh":"吵完架后，他们沉默着、垂头丧气地走回家。"}]}],"synonyms":["gloomily","sadly","dejectedly","sulkily","morosely"],"phonetic":"/ˈmoʊpɪŋli/","extraExplanation":["“mopingly”来自动词“mope”（闷闷不乐、郁郁寡欢）+ 副词后缀“-ly”。语气常带有“情绪低落又有点消沉、提不起劲”的感觉，比单纯的“sadly（伤心地）”更强调无精打采和持续的低落。"]}
{"word":"mopish","summary":{"en":"“Mopish” means gloomy and low-energy, or to act in a sad, listless way.","zh":"“mopish”表示情绪低落、无精打采；也可指（人）闷闷不乐地消沉着。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To feel or act sad, bored, or unhappy, often in a quiet way and without doing much.","zh":"（常指默默地）闷闷不乐、无精打采，消沉地待着。"},"examples":[{"en":"He’s been moping around the house since the breakup.","zh":"分手后他一直在家里闷闷不乐地晃来晃去。"},{"en":"Don’t mope—let’s go out for a walk and get some fresh air.","zh":"别闷着了——我们出去散散步，呼吸点新鲜空气吧。"},{"en":"She sat by the window, moping and staring at the rain.","zh":"她坐在窗边，闷闷不乐地望着雨。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sad, gloomy, and lacking energy; looking or feeling dejected.","zh":"闷闷不乐的；阴郁无精打采的。"},"examples":[{"en":"He gave a mopish smile and said he was fine.","zh":"他勉强露出一个闷闷的笑容，说自己没事。"},{"en":"The whole group felt mopish after the bad news.","zh":"坏消息之后，大家都变得情绪低落、无精打采。"}]}],"synonyms":["mope","gloomy","downcast","dejected","sullen"],"phonetic":"/ˈmoʊpɪʃ/","extraExplanation":["“mopish”语气偏口语，带一点“没精打采地自怨自艾/闹情绪”的感觉，比单纯的“sad”更强调一种消沉地待着、不想做事的状态。常见搭配：mope around（在…无精打采地转）、mope about/over sth（为某事闷闷不乐）。","词源上与“mope”（闷闷不乐）相关；在现代英语里更常用动词“mope”，形容词“mopish”相对少见但依然地道。"]}
{"word":"mopishly","summary":{"en":"“Mopishly” means “in a gloomy, downhearted, uninterested way.”","zh":"“mopishly”表示“闷闷不乐、无精打采、不感兴趣地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sad, gloomy, and bored-looking way; in a way that shows you are not interested or not enjoying yourself.","zh":"以闷闷不乐、忧郁、无精打采的方式；表现出不感兴趣或不开心的样子。"},"examples":[{"en":"He sat mopishly in the corner while everyone else danced.","zh":"大家都在跳舞，他却闷闷不乐地坐在角落里。"},{"en":"She answered mopishly, as if she didn’t want to be there.","zh":"她无精打采地回答，仿佛一点也不想待在那里。"},{"en":"The child stared mopishly out the window on the long ride home.","zh":"回家的长途路上，孩子闷闷不乐地望着窗外。"}]}],"synonyms":["gloomily","sadly","morosely","sulkily","dejectedly"],"phonetic":"/ˈmoʊpɪʃli/","extraExplanation":["“mopishly”来自形容词“mopish”（闷闷不乐的）+ 副词后缀“-ly”。语气通常带一点评判或抱怨：不仅是“难过”，也常暗含“无聊、提不起劲、耷拉着”的感觉。","常见搭配：sit/stand mopishly（闷坐/闷站着），look mopishly（看起来闷闷不乐），answer/speak mopishly（无精打采地回答/说话）。"]}
{"word":"mopishness","summary":{"en":"Mopishness means a low, gloomy, listless mood—the state of being mopish.","zh":"mopishness 指闷闷不乐、无精打采的低落情绪（mopish 的状态）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gloomy, listless, or sulky mood; the state of being mopish (sad and lacking energy).","zh":"闷闷不乐、无精打采或有点赌气的情绪；“mopish（郁郁寡欢、提不起劲）”的状态。"},"examples":[{"en":"After the argument, his mopishness lasted all afternoon.","zh":"吵完架后，他闷闷不乐了一整个下午。"},{"en":"Try a short walk—fresh air can break that mopishness.","zh":"试试散个步吧——新鲜空气能打破那种无精打采的状态。"}]}],"synonyms":["gloominess","sulkiness","melancholy","listlessness","dejection"],"phonetic":"/ˈmoʊpɪʃnəs/","extraExplanation":["“mopishness”来自形容词“mopish”（郁郁寡欢、没精打采），再加名词后缀“-ness”表示“……的状态/性质”。语气偏口语或文学描写，常带一点轻微批评：像是在“蔫儿了”“耷拉着脸”。","常见搭配：a spell of mopishness（突然一阵闷闷不乐）、fall into mopishness（陷入低落）、shake off/overcome mopishness（摆脱/克服低落）。"]}
{"word":"mopla","summary":{"en":"Mopla refers to the Mappila (Moplah) Muslim community of Kerala, India, and can also describe things related to that community.","zh":"Mopla 指印度喀拉拉邦的 Mappila（亦作 Moplah）穆斯林社群，也可作形容词表示与该社群相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim community from Kerala (especially the Malabar Coast) in southwestern India; also spelled Mappila/Moplah","zh":"印度西南部喀拉拉邦（尤其马拉巴尔海岸）的一支穆斯林社群；亦写作 Mappila / Moplah"},"examples":[{"en":"Many Mopla communities in Kerala have a long history of trade along the Malabar Coast.","zh":"喀拉拉邦的许多 Mopla 社群在马拉巴尔海岸有悠久的贸易历史。"},{"en":"The term “Mopla” is sometimes replaced by “Mappila” in modern writing.","zh":"在较新的写作中，“Mopla”有时会用“Mappila”来替代。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mopla/Mappila people (often written with a capital letter: Mopla)","zh":"与 Mopla/Mappila 人民或文化有关的（常首字母大写：Mopla）"},"examples":[{"en":"They studied Mopla history and local traditions in Malabar.","zh":"他们研究了马拉巴尔地区的 Mopla 历史与地方传统。"}]}],"synonyms":["Mappila","Moplah"],"phonetic":"/ˈmoʊplə/","extraExplanation":["“Mopla / Moplah”是较旧的英语拼写；当代学术与媒体更常用 “Mappila”。不同语境下该词可能既指宗教社群，也指与之相关的语言、文化与历史传统。","历史上常见的相关事件是 “Moplah Rebellion (1921)”（亦称马拉巴尔起义），涉及殖民时期的社会、政治与宗教张力；讨论时建议注意语境与措辞的中立性。"]}
{"word":"moplah","summary":{"en":"Moplah (also Mopla) is an older English term for the Mappila Muslim community of Kerala, India.","zh":"Moplah（也拼作Mopla）是较旧的英文用法，指印度喀拉拉邦的马皮拉（Mappila）穆斯林社群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(India, historical) A member of the Mappila (Mopla) Muslim community of Kerala, especially in older English texts.","zh":"（印度，历史用法）指喀拉拉邦的马皮拉（Mappila/Mopla）穆斯林社群成员；常见于较早期的英文文献。"},"examples":[{"en":"The article describes the Moplah community on the Malabar Coast.","zh":"这篇文章描述了马拉巴尔海岸的Moplah社群。"},{"en":"Some colonial records mention conflicts involving Moplah tenants and landlords.","zh":"一些殖民时期的记录提到与Moplah佃农和地主有关的冲突。"}]}],"synonyms":["Mappila","Mopla"],"phonetic":"/ˈmɑːplə/","extraExplanation":["“Moplah / Mopla”多见于较旧的英文拼写；现代更常用“Mappila（马皮拉）”，也更中性、尊重当事人社群的自称。","在历史语境中，英文资料有时会提到“the Moplah Rebellion（1921年马拉巴尔起义/暴动）”。讨论此类事件时，建议注意不同史料的立场差异，并尽量使用较为中性的称呼（如“Mappila Muslims”）。"]}
{"word":"mopoke","summary":{"en":"Mopoke is an Australian/NZ word for a small owl (often the Southern boobook) or its distinctive night call.","zh":"mopoke是澳大利亚/新西兰常用词，指一种小型猫头鹰（常指南方布布克猫头鹰）或它在夜间常听到的典型叫声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian & New Zealand English) A small owl (especially the Southern boobook) known for its distinctive “mopoke” call.","zh":"（澳大利亚/新西兰英语）一种小型猫头鹰（尤指澳洲南方布布克猫头鹰），因其独特的“mopoke”叫声而得名。"},"examples":[{"en":"We heard a mopoke calling in the trees after dark.","zh":"天黑后，我们听到树上传来一只mopoke的叫声。"},{"en":"A mopoke perched on the fence and watched the garden quietly.","zh":"一只mopoke停在篱笆上，安静地看着花园。"}]},{"partOfSpeech":"n.","definition":{"en":"The characteristic call/cry of this bird (often heard at night).","zh":"这种鸟典型的叫声（常在夜间听到）。"},"examples":[{"en":"That mopoke you’re hearing is an owl calling to its mate.","zh":"你听到的那声“mopoke”是猫头鹰在呼唤伴侣。"},{"en":"The bush was silent except for the mopoke in the distance.","zh":"丛林一片寂静，只有远处传来mopoke的叫声。"}]}],"synonyms":["boobook","Southern boobook","owl call"],"phonetic":"/ˈmoʊ.poʊk/","extraExplanation":["“mopoke”是拟声词，模仿这种鸟反复发出的两音节叫声（大致像“mo-poke”）。","在澳大利亚口语里，“mopoke”多指南方布布克猫头鹰（Southern boobook），但在部分地区也可能被用来指灰鸮蛙口夜鹰（tawny frogmouth）。因此在自然纪录片或观鸟语境中，最好结合地点或学名来确认具体是哪一种鸟。"]}
{"word":"mopokes","summary":{"en":"Mopokes are (1) southern boobook owls in Australia, or (2) informally, slow-moving people.","zh":"mopokes 可指（1）澳大利亚的南方布布克鸮（猫头鹰的一种）；也可在口语中指（2）动作慢、磨蹭的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of mopoke) A small Australian owl (the southern boobook), known for its night call that sounds like “mo-poke.”","zh":"（mopoke 的复数）一种澳大利亚的小型猫头鹰（南方布布克鸮），因其夜间叫声像“mo-poke”而得名。"},"examples":[{"en":"At dusk we heard mopokes calling from the gum trees.","zh":"黄昏时，我们听到桉树上传来 mopokes 的叫声。"},{"en":"The guide pointed out mopokes resting quietly in the branches.","zh":"向导指给我们看枝头安静栖息的 mopokes。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Australian) Slow or sluggish people; dawdlers.","zh":"（非正式，主要为澳大利亚用法）动作慢的人；磨蹭的人。"},"examples":[{"en":"Come on, you mopokes—if we leave now, we’ll catch the bus.","zh":"快点啊，你们这些磨蹭的人——现在走还能赶上公交。"},{"en":"We can’t wait for the mopokes all day.","zh":"我们不能整天等那些慢吞吞的人。"}]}],"synonyms":["boobooks","owls","dawdlers","slowpokes"],"phonetic":"/ˈmoʊpoʊk/","extraExplanation":["“mopoke”是澳大利亚英语里对“南方布布克鸮（southern boobook）”的俗称，来自模仿其鸣叫声的拟声词。","作“磨蹭的人”时属于口语/地域色彩较强的用法，带一点打趣意味；在正式写作中不常用。"]}
{"word":"moppe","summary":{"en":"“Mope” means to be or act sad and listless; it can also mean a gloomy period or mood.","zh":"“mope”指（因失望等）闷闷不乐、无精打采；也可指一段消沉的状态。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to feel sad or bored and show it by moving or acting slowly (often because you feel disappointed)","zh":"（因失望等）闷闷不乐；无精打采地消磨时间"},"examples":[{"en":"He’s been moping around the house since the trip was canceled.","zh":"自从旅行取消后，他一直在家里闷闷不乐。"},{"en":"Don’t mope—let’s go for a walk and get some fresh air.","zh":"别闷着了——我们去散散步，呼吸点新鲜空气吧。"}]},{"partOfSpeech":"n.","definition":{"en":"a period of being sad, gloomy, or uninterested","zh":"闷闷不乐的状态；消沉"},"examples":[{"en":"After the breakup, she went through a long mope.","zh":"分手后，她消沉了很久。"}]}],"synonyms":["sulk","brood","languish","pine"],"phonetic":"/moʊp/","extraExplanation":["“moppe”在英语里不是常见标准拼写；你很可能想查的是“mope”。“mope”更常用于口语：mope around（无精打采地晃来晃去）、mope about/over something（为某事闷闷不乐）。","注意区分：mop（拖地）是另一词，意思完全不同。"]}
{"word":"mopped","summary":{"en":"“Mopped” is the past form of “mop,” meaning cleaned with a mop, or (often as “mopped up”) wiped/absorbed spills or finished what remained.","zh":"“mopped”是“mop”的过去式/过去分词，表示用拖把清洁；也常用于“mopped up”，指把液体擦干/吸干或把剩余事务收尾处理完。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mop”: cleaned a floor or surface using a mop (a tool with a handle and absorbent strands).","zh":"“mop”的过去式/过去分词：用拖把清洁地面或表面。"},"examples":[{"en":"She mopped the kitchen floor after dinner.","zh":"晚饭后她把厨房地面拖了一遍。"},{"en":"The hallway was mopped every morning.","zh":"走廊每天早上都会被拖洗。"}]},{"partOfSpeech":"v.","definition":{"en":"(Often in “mopped up”) Removed or absorbed liquid, or dealt with/finished what remained of something.","zh":"（常用于“mopped up”）把液体擦干/吸干；或把剩下的事情处理完、收拾干净。"},"examples":[{"en":"He mopped up the spilled juice with a towel.","zh":"他用毛巾把打翻的果汁擦干。"},{"en":"Our team mopped up the last few tasks before the deadline.","zh":"我们团队在截止日前把最后几项任务都收尾完成了。"}]}],"synonyms":["cleaned","wiped","swabbed","washed","dried","soaked up","cleared up"],"phonetic":"/mɑpt/","extraExplanation":["“mop up”在口语里很常见：既可以指“把液体擦干净”，也可以引申为“把剩下的部分处理完/扫尾”。比如新闻里会说“police are mopping up”表示“警方在清理残局、处理后续”。"]}
{"word":"mopper","summary":{"en":"A mopper is a person who cleans by mopping floors.","zh":"mopper 指用拖把拖地清洁的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who mops floors or cleans using a mop (often someone employed to clean)","zh":"用拖把拖地、用拖把清洁的人（常指负责清洁的工作人员）"},"examples":[{"en":"The mopper cleaned the hallway after the spill.","zh":"洒出东西后，清洁人员把走廊拖干净了。"},{"en":"We need one more mopper for the night shift.","zh":"夜班还需要再加一名负责拖地清洁的人。"}]}],"synonyms":["cleaner","janitor"],"phonetic":"/ˈmɑpər/","extraExplanation":["“mopper”来自动词“mop（拖地）”加上表示“做某事的人”的后缀“-er”，类似的还有“cleaner（清洁工）”“worker（工人）”。日常英语里更常说“janitor（管理员/清洁工）”或“cleaner”，而“mopper”更强调“负责拖地的人”。"]}
{"word":"moppers","summary":{"en":"“Moppers” means people who mop (clean with a mop).","zh":"“moppers”指“拖地的人/用拖把清洁的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who mop (clean floors or surfaces with a mop).","zh":"拖地的人；用拖把清洁的人。"},"examples":[{"en":"The hotel hired extra moppers to clean the lobby after the storm.","zh":"暴风雨过后，酒店雇了更多拖地工来清洁大厅。"},{"en":"The moppers worked quickly, leaving the hallway dry and safe.","zh":"拖地的人动作很快，让走廊变得干爽又安全。"}]}],"synonyms":["cleaners","janitors","custodians"],"phonetic":"ˈmɑpər","extraExplanation":["“moppers”是名词“mopper”的复数形式。“mop（拖地）+ -er（做……的人）”构成mopper，表示“做拖地工作的人”。在日常英语里，更常见的说法是“cleaners（清洁工）”或“janitors（保洁/管理员）”，而“moppers”更强调“负责拖地的人”。"]}
{"word":"moppet","summary":{"en":"“Moppet” is an affectionate British word for a small child; less commonly, it can mean a puppet or small doll.","zh":"“moppet”是英式英语里对小孩子的亲昵称呼；较少情况下也可指木偶或小玩偶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British English, affectionate) A small child, especially one who seems cute or sweet.","zh":"（英式英语，昵称）小孩子；小宝贝（尤指可爱、讨人喜欢的孩子）。"},"examples":[{"en":"Come here, you little moppet—let me fix your scarf.","zh":"过来，小宝贝——我帮你把围巾整理一下。"},{"en":"The teacher greeted the new moppets at the classroom door.","zh":"老师在教室门口迎接新来的小朋友们。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A puppet or a small doll; sometimes used playfully.","zh":"（较少见）木偶；小玩偶（有时带玩笑语气）。"},"examples":[{"en":"The old theater displayed moppets used in children’s shows.","zh":"那家老剧院展出了儿童剧里用过的木偶。"},{"en":"She kept a tiny moppet on the shelf as a decoration.","zh":"她把一个小玩偶放在架子上当装饰。"}]}],"synonyms":["little one","kid","child","tot","youngster","sweetie"],"phonetic":"/ˈmɑpɪt/","extraExplanation":["“moppet”多见于英式英语，语气通常温柔、亲昵，有点像对孩子说“little one / sweetie”。在正式场合或陌生人之间使用可能显得过于亲密，需注意语境。","词源上常被认为与“mop”（乱蓬蓬的头发、拖把状）有关，早期可指“头发蓬乱的小家伙”，后来引申为对小孩的爱称。"]}
{"word":"moppets","summary":{"en":"“Moppets” means small children, said in a cute or affectionate way (often British).","zh":"“moppets”指“小孩子”，带亲昵可爱的语气（多见于英式英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small child; used as a cute or affectionate way to talk about children (often in British English).","zh":"小孩；对孩子的可爱/亲昵称呼（常见于英式英语）。"},"examples":[{"en":"The teacher guided the moppets onto the school bus.","zh":"老师带着一群小家伙上了校车。"},{"en":"Look at those moppets playing in the park!","zh":"看那些在公园里玩的小家伙！"}]}],"synonyms":["kids","little ones","children","youngsters"],"phonetic":"/ˈmɑpɪts/","extraExplanation":["“moppet”通常带有亲昵、可爱的语气，多用于口语或文学描写里；在美式英语中不算常用，常见替代说法有“kids”“little ones”。","有时也可指“小娃娃/布偶”，但现代日常用法里最常指“小孩子”。"]}
{"word":"mopping","summary":{"en":"Mopping means cleaning a floor or surface with a mop; it can also mean the act of doing this.","zh":"mopping 指用拖把清洁地面/表面；也可指“拖地”这件事本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of cleaning a floor or surface with a mop (a tool with a wet cloth head)","zh":"用拖把（带湿布头的清洁工具）清洁地面或表面的动作；拖地"},"examples":[{"en":"Mopping the kitchen floor only takes ten minutes.","zh":"拖厨房地只要十分钟。"},{"en":"Please finish mopping before the guests arrive.","zh":"客人来之前请先把地拖完。"}]},{"partOfSpeech":"v.","definition":{"en":"cleaning a floor or surface with a mop; the present participle of “mop”","zh":"正在用拖把清洁（“mop”的现在分词/动名词形式）；正在拖地"},"examples":[{"en":"She is mopping the hallway right now.","zh":"她正在拖走廊。"},{"en":"He spent the afternoon mopping and doing laundry.","zh":"他下午都在拖地和洗衣服。"},{"en":"After mopping, let the floor dry completely.","zh":"拖完地后，让地面完全晾干。"}]}],"synonyms":["cleaning","wiping","scrubbing (stronger)","mop-up (cleanup)"],"phonetic":"/ˈmɑpɪŋ/","extraExplanation":["“mop up”是很常见的搭配：既可指“把地上的水/污渍拖干净”，也可引申为“收拾残局、清理剩余问题”。例如：We’re still mopping up after the party（聚会后还在收拾残局）。"]}
{"word":"moppy","summary":{"en":"“Moppy” is an informal adjective meaning messy or droopy-looking, especially about hair that hangs like a mop.","zh":"“moppy”是非正式形容词，常指（尤其头发）乱蓬蓬、下垂，像拖把一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Looking untidy or droopy, often because hair is messy or hanging down like a mop.","zh":"（非正式）邋遢的；（常指头发）像拖把一样乱蓬蓬、下垂的。"},"examples":[{"en":"After the rain, his hair looked moppy and flat.","zh":"淋雨后，他的头发看起来乱塌塌的。"},{"en":"She wore a moppy sweater that made her look a bit unkempt.","zh":"她穿着一件松垮垮的毛衣，看起来有点不修边幅。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the quality of a mop; soft, thick, or hanging down in a way that resembles a mop (often describing hair or fabric).","zh":"像拖把的；（常形容头发或织物）柔软厚密、下垂成一团的。"},"examples":[{"en":"He has moppy curls that fall over his eyes.","zh":"他有一头像拖把一样的卷发，垂到眼睛前。"},{"en":"The dog’s moppy fur picked up every leaf on the walk.","zh":"那只狗拖把般的长毛散步时粘了满身叶子。"}]}],"synonyms":["messy","unkempt","shaggy","disheveled","scruffy"],"phonetic":"/ˈmɑpi/","extraExplanation":["“moppy”来自“mop（拖把）”，常用来形容头发“像拖把一样乱、垂下来”。在日常口语里偏随意，有时带一点调侃但不一定是侮辱。","在流行文化中常见搭配是“moppy hair / moppy-haired”，指那种蓬松、略显凌乱的发型（比如有些青少年或摇滚风格）。"]}
{"word":"mops","summary":{"en":"“Mops” usually means either the plural of “mop” (cleaning tools) or the verb form “mops” (cleans with a mop). It can also mean messy masses of hair (less common).","zh":"“mops”通常是“mop”的复数（拖把们/几把拖把）或动词第三人称单数（用拖把拖、把液体拖干净）。也可指一团蓬乱的头发（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mop”: a tool with a long handle and a soft head (cloth or sponge) used for cleaning floors.","zh":"“mop”的复数：拖把（带长柄、布条或海绵头，用来拖地）。"},"examples":[{"en":"We bought two mops for the kitchen and the hallway.","zh":"我们买了两把拖把，用在厨房和走廊。"},{"en":"These mops are better for wooden floors.","zh":"这些拖把更适合木地板。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “mop”: to clean or wipe something with a mop; to remove liquid from a surface.","zh":"“mop”的第三人称单数：用拖把拖/擦；把地面上的液体拖干。"},"examples":[{"en":"He mops the floor every evening after dinner.","zh":"他每天晚饭后都会拖地。"},{"en":"She mops up the spilled juice quickly.","zh":"她很快把洒出的果汁拖干净。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Plural of “mop” meaning a mass of hair (or something that looks like it).","zh":"（不太常见）“mop”的复数：一大团头发；（像头发一样）蓬乱的一团。"},"examples":[{"en":"The kids came in with wet mops of hair after the rain.","zh":"孩子们淋了雨进来，头发湿成一团。"}]}],"synonyms":["clean","wipe","swab","mop up (phrase)"],"phonetic":"/mɑps/","extraExplanation":["“mops”既可能是名词复数（two mops），也可能是动词第三人称单数（He mops...）。看句子里前面有没有主语（he/she/it）或数量词（two/three）来判断。","常见搭配：mop up 表示“把（液体/一团糟）清理干净”，例如 mop up the spill（把泼洒的液体拖干净）。"]}
{"word":"mopsey","summary":{"en":"“Mopsey” is usually a variant spelling of “mopsy,” meaning messy/untidy; it can also refer to the nickname or the Peter Rabbit character “Mopsy.”","zh":"“mopsey”通常是“mopsy”的拼写变体，表示邋遢、凌乱；也可指昵称或《彼得兔》里的角色“Mopsy”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(variant spelling) of “mopsy” — untidy or messy in appearance; not neatly arranged.","zh":"（拼写变体）“mopsy”的另一种拼法——外表邋遢、凌乱的；不整洁的。"},"examples":[{"en":"After the long flight, my hair looked a bit mopsey.","zh":"长途飞行后，我的头发看起来有点乱。"},{"en":"He kept his desk in a mopsey state, with papers everywhere.","zh":"他的桌子一直很乱，文件到处都是。"}]},{"partOfSpeech":"n.","definition":{"en":"(variant spelling) “Mopsy” — a female nickname or pet name (often playful).","zh":"（拼写变体）“Mopsy”——女性昵称/爱称（常带俏皮语气）。"},"examples":[{"en":"Her family still calls her Mopsey when they’re joking around.","zh":"家人开玩笑时仍会叫她 Mopsey。"}]},{"partOfSpeech":"other","definition":{"en":"(literature) “Mopsy,” one of the three little rabbits (Flopsy, Mopsy, and Cotton-tail) in Beatrix Potter’s Peter Rabbit stories; “mopsey” may appear as an informal spelling.","zh":"（文学）比阿特丽克斯·波特《彼得兔》故事中的小兔之一（Flopsy、Mopsy 和 Cotton-tail）；“mopsey”有时会被非正式地拼写出来。"},"examples":[{"en":"In the Peter Rabbit books, Mopsy is one of Peter’s sisters.","zh":"在《彼得兔》系列里，Mopsy 是彼得的一位姐姐/妹妹。"},{"en":"Some readers remember the name as “mopsey,” but the common spelling is “Mopsy.”","zh":"有些读者会把名字记成“mopsey”，但更常见的拼法是 “Mopsy”。"}]}],"synonyms":["messy","untidy","unkempt","scruffy"],"phonetic":"/ˈmɑpsi/","extraExplanation":["“Mopsy”最广为人知的来源是英国儿童文学作家 Beatrix Potter（比阿特丽克斯·波特）的经典故事《The Tale of Peter Rabbit》（《彼得兔的故事》）。在原作里常见的拼法是大写的专有名词 “Mopsy”。","形容词 “mopsy”来自“mop（拖把/一团乱发）”的联想，用来形容头发、衣着或环境“乱糟糟、不整洁”。“mopsey”多见于随意拼写或个人用法，不算标准固定拼写。"]}
{"word":"mopstick","summary":{"en":"“Mopstick” is an uncommon word meaning a mop handle/pole; it’s also sometimes a misspelling of “chopstick.”","zh":"“mopstick”较少用，通常指拖把杆；也常被误拼用来指“chopstick（筷子）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A stick or handle used for a mop; the long pole attached to a mop head.","zh":"（不常见）拖把杆；拖把上连接拖把头的长柄。"},"examples":[{"en":"The mopstick snapped, so we had to replace the whole mop.","zh":"拖把杆断了，所以我们只好把整个拖把换掉。"},{"en":"Wipe the mopstick down after cleaning so it doesn’t get sticky.","zh":"清洁后把拖把杆擦一擦，免得变黏。"}]},{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling people sometimes use when they mean “chopstick.”","zh":"一种不规范/误拼：有时人们想写的是“chopstick（筷子）”。"},"examples":[{"en":"Did you mean “chopstick”? “Mopstick” usually refers to a mop handle.","zh":"你是不是想写“chopstick（筷子）”？“mopstick”通常指拖把杆。"},{"en":"The menu said “mopsticks,” but it clearly meant chopsticks.","zh":"菜单上写“mopsticks”，但明显是指筷子。"}]}],"synonyms":["mop handle","mop pole","handle","pole"],"phonetic":"/ˈmɑpˌstɪk/","extraExplanation":["“mopstick”不是常用标准词汇；在日常英语里更常说“mop handle”或“mop pole”。","如果你想表达“筷子”，标准写法是“chopstick”（单数）/“chopsticks”（复数）。"]}
{"word":"mopsy","summary":{"en":"“Mopsy” is best known as a rabbit character in Beatrix Potter’s “Peter Rabbit,” and it can also (more rarely) mean a messy-haired girl or woman.","zh":"“Mopsy”最常见的是指《彼得兔的故事》中的小兔角色名；较少见时也可指头发蓬乱的女孩或女人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) One of the three little rabbit sisters in Beatrix Potter’s children’s story “The Tale of Peter Rabbit” (Mopsy, Flopsy, and Cottontail).","zh":"（专有名词）比翠克斯·波特儿童故事《彼得兔的故事》中三只小兔姐妹之一（与 Flopsy、Cottontail 并列）。"},"examples":[{"en":"In “The Tale of Peter Rabbit,” Mopsy stays safer than Peter by listening to her mother.","zh":"在《彼得兔的故事》中，Mopsy 听妈妈的话，比彼得更安全。"},{"en":"The siblings are Flopsy, Mopsy, and Cottontail.","zh":"这几只小兔兄弟姐妹分别是 Flopsy、Mopsy 和 Cottontail。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, dated) A girl or woman with untidy, fluffy hair; someone with a “mop” of hair.","zh":"（非正式，较旧用法）头发蓬乱的女孩或女人；头发像“拖把”一样乱蓬蓬的人。"},"examples":[{"en":"After the windy walk, she came home looking like a little mopsy.","zh":"刮风走了一圈后，她回家时头发乱蓬蓬的，像个小“mopsy”。"},{"en":"He teased his sister for being such a mopsy in the morning.","zh":"他取笑妹妹早上头发乱得像个“mopsy”。"}]}],"synonyms":["(dated) messy-haired girl","(dated) someone with a mop of hair"],"phonetic":"/ˈmɑpsi/","extraExplanation":["“Mopsy”最广为人知的来源是比翠克斯·波特（Beatrix Potter）的经典童书形象：它通常作为角色名出现，带有温柔、可爱的儿童文学色彩。","作为普通名词的“mopsy”在现代英语中不常用，属于带点俏皮但也可能显得过时的说法；更常见的表达是“messy hair / bed hair”或“a mop of hair”。"]}
{"word":"mopus","summary":{"en":"“Mop up” means to wipe up a spill or to finish dealing with what remains.","zh":"“mop up”表示“把洒出的东西擦干净/清理掉”，也可引申为“收尾、把剩下的处理完”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to clean up a liquid or mess using a mop, cloth, or paper towels","zh":"（用拖把、布或纸巾等）把液体/污渍擦干净、清理掉"},"examples":[{"en":"Can you mop up the spilled milk?","zh":"你能把洒出来的牛奶拖/擦干净吗？"},{"en":"She used a towel to mop up the water on the floor.","zh":"她用毛巾把地上的水擦干。"}]},{"partOfSpeech":"phrase","definition":{"en":"to finish dealing with what remains (for example, the last tasks, problems, or opponents)","zh":"收尾；把剩下的事情/问题处理完；（非正式）彻底解决最后的对手"},"examples":[{"en":"Let’s mop up the remaining work before we leave.","zh":"我们走之前把剩下的工作收尾一下吧。"},{"en":"The team mopped up in the final minutes of the game.","zh":"球队在比赛最后几分钟彻底锁定胜局（把对手“收拾”了）。"}]}],"synonyms":["wipe up","clean up","soak up","finish up","wrap up"],"phonetic":"/ˈmɑp ˌʌp/","extraExplanation":["“mopus”不是常见的英语单词。很多情况下它是把短语 **mop up** 误写成一个词，或者是人名/品牌名等专有名词。","**mop up** 的核心画面是“把液体吸干、把残留清理掉”，所以引申为“把剩下的部分处理完”。"]}
{"word":"mopuses","summary":{"en":"“Mopuses” is not standard English; it’s usually a misspelling of “octopuses” or “mops.”","zh":"“mopuses” 不是标准英语，通常是把 “octopuses” 或 “mops” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often it is a misspelling or typo of “octopuses” (plural of octopus) or “mops” (plural of mop).","zh":"不是标准英语单词。最常见情况是把 “octopuses”（章鱼的复数）或 “mops”（拖把的复数）拼错了。"},"examples":[{"en":"Did you mean “octopuses”? That’s the common plural of “octopus.”","zh":"你是不是想写 “octopuses”？这是 “octopus”（章鱼）最常见的复数。"},{"en":"If you meant cleaning tools, the plural is “mops,” not “mopuses.”","zh":"如果你指的是清洁工具，复数是 “mops”，不是 “mopuses”。"}]}],"phonetic":"/ˈmɑpəsɪz/","extraExplanation":["“Octopus”的复数在英语里有几种：最常见、最自然的是 “octopuses”；你也可能见到 “octopi”（较传统/仿拉丁写法），以及较学术的 “octopodes”（较少见）。日常写作优先用 “octopuses”。","如果你能把原句发我（例如：I saw ___ in the tank），我可以帮你判断你想表达的是哪一个词，并给出更合适的改写。"]}
{"word":"mopusses","summary":{"en":"“Mop” means a floor-cleaning tool or the action of cleaning a floor with it. “Mopusses” is likely a misspelling.","zh":"“mop”指拖把（工具）或“用拖把拖地”（动作）。“mopusses”很可能是拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tool with a long handle and a head of cloth or sponge used for cleaning floors","zh":"拖把；用来清洁地面的工具（通常有长柄和布条/海绵头）"},"examples":[{"en":"I bought a new mop for the kitchen floor.","zh":"我买了一把新的拖把来拖厨房地面。"},{"en":"The mop is in the closet.","zh":"拖把在储物柜里。"}]},{"partOfSpeech":"v.","definition":{"en":"to clean a floor by using a mop","zh":"用拖把拖地；清洁地面"},"examples":[{"en":"I usually mop the floor on Saturdays.","zh":"我通常周六拖地。"},{"en":"Please mop up the spilled juice.","zh":"请把洒出来的果汁拖干净。"}]}],"synonyms":["clean","wipe","swab","mop up"],"phonetic":"/mɑp/","extraExplanation":["“mopusses”不是常见或标准的英语拼写。你可能想写的是：","1) mops：mop 的复数（名词）或动词第三人称单数（He mops the floor. 他拖地）。","2) mop up：常见短语，表示“把（液体/脏乱）清理干净；收拾残局”。"]}
{"word":"mopy","summary":{"en":"“Mopy” means gloomy and low-energy (often spelled “mopey”); as a verb, it means to mope around sadly.","zh":"“mopy”指忧郁无精打采（更常拼作“mopey”）；作动词时指闷闷不乐地晃荡/消磨时间。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Gloomy, sad, and not very energetic; looking like you have lost interest or hope.","zh":"闷闷不乐的；忧郁无精打采的；看起来失去兴趣或希望的。"},"examples":[{"en":"He’s been mopy since he didn’t get the job.","zh":"他没拿到那份工作后就一直闷闷不乐。"},{"en":"Don’t be mopy—let’s go for a walk and get some fresh air.","zh":"别这么消沉——我们去散步，呼吸点新鲜空气吧。"},{"en":"She sat in the corner with a mopy expression.","zh":"她坐在角落里，一脸郁郁寡欢。"}]},{"partOfSpeech":"vi.","definition":{"en":"To act in a gloomy, listless way; to mope.","zh":"郁郁寡欢地待着；无精打采地消磨时间（同 mope）。"},"examples":[{"en":"He just moped around the house all weekend.","zh":"他整个周末都在家里无精打采地晃来晃去。"},{"en":"Stop moping and tell me what’s wrong.","zh":"别再闷着了，告诉我怎么了。"}]}],"synonyms":["mopey","gloomy","downcast","sad","blue","listless"],"phonetic":"/ˈmoʊpi/","extraExplanation":["“mopy”在美式英语里常被当作“mopey”的拼写变体（意思一样：闷闷不乐的）。更常见的形容词拼法是“mopey”，动词通常用“mope”。","语气上，“mopy/mopey”比“sad”更口语，强调“没精神、提不起劲、情绪低落又有点拖沓”的感觉。"]}

