{"word":"moquelumnan","summary":{"en":"Moquelumnan is a rare, older academic term for a proposed Native American language grouping in central California, often discussed today as Utian.","zh":"Moquelumnan是一个较少见、偏旧的学术术语，指加州中部曾被提出的美洲原住民语言类群，现代讨论中多用Utian。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a proposed Native American language group in central California (often associated with the Miwok and Costanoan/Ohlone languages); in modern linguistics, this is often discussed under the term “Utian.”","zh":"（语言学用语）指加利福尼亚中部一组曾被提出的美洲原住民语言类群（常与米沃克语族及科斯塔诺安/奥隆尼语相关）；在现代语言学讨论中常改用“Utian（尤提语系）”。"},"examples":[{"en":"Some older sources describe Miwok and Costanoan as part of a Moquelumnan group.","zh":"一些较早的资料会把米沃克语和科斯塔诺安语描述为“Moquelumnan”类群的一部分。"},{"en":"Today, researchers more often use the term Utian instead of Moquelumnan.","zh":"如今研究者更常用“Utian”来替代“Moquelumnan”。"}]},{"partOfSpeech":"n.","definition":{"en":"a speaker or member of the peoples associated with the Moquelumnan (Utian) languages (rare; mainly in older academic writing).","zh":"（罕见，多见于较旧的学术写作）指与“Moquelumnan（Utian）”语言相关的族群成员或该语言的使用者。"},"examples":[{"en":"The article used the word Moquelumnan to refer to several neighboring groups in the region.","zh":"那篇文章用“Moquelumnan”来指代该地区相邻的几个族群。"}]}],"synonyms":["Mokelumnan","Utian"],"phonetic":"/moʊˈkɛləmnən/","extraExplanation":["“Moquelumnan”不是日常英语词汇，更多出现在19—20世纪早期的人类学/语言学文献中，名称与加州的莫凯卢姆尼河（Mokelumne River）有关。","在较新的分类里，这一类群通常用“Utian（尤提语系）”来讨论；你也可能在资料中看到拼写变体：Mokelumnan / Moquelumnan。","如果你是在查某个地名或河名，可能想找的是“Mokelumne”（莫凯卢姆尼）。"]}
{"word":"moquette","summary":{"en":"Moquette is a durable pile fabric used mainly for upholstery and carpeting, especially in public transport.","zh":"Moquette 指一种耐用的绒面机织面料，主要用于座椅包覆和地毯，常见于公共交通。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, woven pile fabric (often wool or a wool blend) used for carpeting and upholstery, especially on trains, buses, and other public seating.","zh":"一种厚实的绒面机织面料（常为羊毛或羊毛混纺），用于地毯或家具/座椅的包覆，尤多见于火车、公交等公共座椅。"},"examples":[{"en":"The subway seats were covered in moquette to resist wear and stains.","zh":"地铁座椅用 moquette 面料包覆，以更耐磨耐脏。"},{"en":"They chose a dark moquette for the theater chairs because it’s durable.","zh":"他们为剧院座椅选了深色的 moquette，因为它很耐用。"}]}],"synonyms":["upholstery fabric","pile fabric","carpet fabric"],"phonetic":"/moʊˈkɛt/","extraExplanation":["Moquette 源自法语，常用于英式语境中，尤其指公共交通工具上的“耐磨绒面座椅布/地毯面料”。在北美更常直接说 “upholstery fabric” 或 “pile fabric”。","它的特点通常是织得很密、表面有短绒（pile），图案也常见于公共交通座椅，用来掩盖污渍与磨损。"]}
{"word":"moquettes","summary":{"en":"Moquettes are thick, durable woven fabrics used mainly for upholstery and sometimes carpeting, especially in public transport and theaters.","zh":"Moquettes 指厚实耐磨的机织装饰布（moquette 的复数），多用于公共交通和剧院等场所的座椅包面，也可用于铺地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of moquette: a thick, woven fabric (often with a short pile) used for upholstery and carpeting, especially on buses, trains, and theater seats.","zh":"moquette 的复数：一种厚实的机织布（常带短绒），用于家具装饰和铺地毯，尤其常见于公交、火车和剧院座椅的面料。"},"examples":[{"en":"The train seats were covered in moquettes that felt soft but durable.","zh":"火车座椅包着 moquettes，摸起来柔软但很耐用。"},{"en":"The designer chose dark moquettes for the theater to hide stains and wear.","zh":"设计师为剧院选择了深色的 moquettes，以便遮住污渍和磨损。"}]}],"synonyms":["upholstery fabric","pile fabric","carpeting","seat fabric"],"phonetic":"/moʊˈkɛts/","extraExplanation":["“Moquette”来自法语，在英式英语里更常见，尤其用于公共交通工具的座椅面料描述；美式英语里更常说 upholstery fabric（座椅装饰布）或 carpet fabric（地毯面料）。","在材料语境中，它通常强调“结实耐磨、适合高频使用”的特点。"]}
{"word":"moqui","summary":{"en":"“Moqui” is an older term for the Hopi people/language (now usually avoided), and it can also mean a small ironstone concretion sold as a “Moqui marble/ball.”","zh":"“Moqui”一是对霍皮族/霍皮语的旧称（现多避免使用），二也可指美国西南部常见的铁质球状结核，常被称为“Moqui marble/ball”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, now usually avoided) An older English name for the Hopi people of northeastern Arizona, or for their language.","zh":"（历史用法，现多避免）英语中对美国亚利桑那州东北部霍皮族（Hopi）及其语言的旧称。"},"examples":[{"en":"Older books may refer to the Hopi as the “Moqui,” but today “Hopi” is the respectful, standard name.","zh":"一些旧书可能把霍皮人称为“Moqui”，但现在更尊重、更标准的称呼是“Hopi”。"},{"en":"The museum updated its labels from “Moqui” to “Hopi” to match current usage.","zh":"博物馆把展签中的“Moqui”改为“Hopi”，以符合当代用法。"}]},{"partOfSpeech":"n.","definition":{"en":"A small ironstone concretion (often called a “Moqui marble” or “Moqui ball”), commonly found in the American Southwest and sometimes sold as a collectible stone.","zh":"一种小型铁质结核（常称“Moqui marble / Moqui ball”，即“莫基石球/莫基弹珠”），多见于美国西南部，也常作为收藏石售卖。"},"examples":[{"en":"We found a few Moqui marbles scattered across the desert trail.","zh":"我们在沙漠步道旁发现了几颗散落的莫基石球。"},{"en":"The shop sold polished “Moqui balls” as souvenirs from Utah.","zh":"那家店把打磨过的“Moqui balls”当作犹他州纪念品出售。"}]}],"synonyms":["Hopi (preferred)","Moqui marble","Moqui ball","ironstone concretion","shaman stone (marketing term)"],"phonetic":"ˈmoʊki","extraExplanation":["“Moqui”多被认为是对霍皮族的旧称或外来称呼（exonym），在当代语境里可能显得不够尊重；正式或一般写作更推荐使用“Hopi”。在引用历史文献或旧地名时可出现该词，但最好加说明。","地质语境里的“Moqui marble/ball”通常指由砂岩与氧化铁胶结形成的球状或椭球状结核；在商业或民俗语境中也有人称其为“shaman stone”，但这类说法往往带有营销或新世纪（New Age）色彩，使用时可保持分辨。"]}

