{"word":"mos","summary":{"en":"“mos” is most commonly an abbreviation for “months,” and in all caps “MOS” can mean a military job code or a semiconductor term.","zh":"“mos”最常见是“months（月）”的缩写；全大写“MOS”也可指美军军职代码或半导体术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) months (used in schedules, ages, and time periods)","zh":"（缩写）months（“月”，常用于年龄、时间长度、日程）"},"examples":[{"en":"Baby is 6 mos old.","zh":"宝宝6个月大。"},{"en":"The subscription lasts 12 mos.","zh":"订阅有效期为12个月。"}]},{"partOfSpeech":"other","definition":{"en":"(U.S. military) Military Occupational Specialty: a soldier’s job category or career field","zh":"（美国军队）Military Occupational Specialty：军职/专业岗位代码（军人的工作类别）"},"examples":[{"en":"His MOS is in communications.","zh":"他的军职专业在通信领域。"},{"en":"She changed her MOS after training.","zh":"她在培训后更换了军职专业。"}]},{"partOfSpeech":"other","definition":{"en":"(electronics) Metal–Oxide–Semiconductor (often seen in MOSFET): a common semiconductor technology","zh":"（电子学）Metal–Oxide–Semiconductor（金属-氧化物-半导体；常见于MOSFET）：一种常见的半导体技术"},"examples":[{"en":"MOS technology is widely used in modern chips.","zh":"MOS技术广泛用于现代芯片。"},{"en":"A MOSFET is a type of transistor.","zh":"MOSFET是一种晶体管。"}]}],"synonyms":["mos. (months)","months","MOS (military)","MOS (electronics)"],"phonetic":"/moʊz/","extraExplanation":["“mos”在英语里最常见的用法是写作“mos.”，表示“months”。常见于表格、医疗记录、简历、年龄/工龄等简写场景；正式写作中一般写全“months”。","“MOS”常以全大写出现：在军事语境里是岗位/专业代码；在工程语境里是半导体术语。看上下文（军队/招聘信息/电子产品说明书）最容易判断是哪一种。"]}
{"word":"mosaic","summary":{"en":"Mosaic means a picture made from many small pieces, or (figuratively) a rich mix of different parts; it can also be a verb meaning to make a mosaic or pixelate an image.","zh":"Mosaic 指用许多小块拼成的马赛克图案；也可比喻“多元拼合体”；作动词可指做成马赛克或给画面打马赛克（像素化处理）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A picture or pattern made by arranging many small pieces (such as colored stone, glass, or tile) on a surface.","zh":"马赛克（镶嵌画）：把许多小块（如彩色石头、玻璃或瓷砖）拼贴在表面上形成的图案或画面。"},"examples":[{"en":"The museum has a beautiful Roman mosaic on the floor.","zh":"博物馆地面上有一幅漂亮的罗马马赛克。"},{"en":"She made a mosaic using broken pieces of blue and green glass.","zh":"她用蓝色和绿色的碎玻璃做了一幅马赛克拼贴。"}]},{"partOfSpeech":"n.","definition":{"en":"A mix of many different people, cultures, ideas, or parts that form a whole.","zh":"（比喻）多元拼合体：由许多不同的人、文化、观点或元素组成的整体。"},"examples":[{"en":"New York City is a mosaic of languages and cultures.","zh":"纽约市是语言与文化的多元拼合体。"},{"en":"The novel shows a mosaic of everyday lives in the neighborhood.","zh":"这部小说展现了社区日常生活的多面拼图。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something look like a mosaic, or to cover an image with a blocky blur (often for privacy).","zh":"使呈马赛克状；（常用于隐私保护）给画面打马赛克、加像素化模糊。"},"examples":[{"en":"The editor mosaicked the faces of children in the video.","zh":"剪辑师把视频里孩子们的脸打了马赛克。"},{"en":"They mosaicked the wall with small ceramic tiles.","zh":"他们用小块陶瓷砖把墙面做成马赛克拼贴。"}]}],"synonyms":["collage","patchwork","mixture","blend","medley","montage"],"phonetic":"/moʊˈzeɪɪk/","extraExplanation":["词源与背景：mosaic 来自拉丁语/希腊语词根，和“缪斯（Muses，艺术女神）”相关，最早指受缪斯启发的装饰艺术。古罗马、拜占庭教堂常见马赛克，用小块彩色材料拼出宗教或历史场景。","文学/写作中的用法：mosaic 常被用作比喻，表示“由许多小片段组成的整体”，比如“a mosaic of memories（记忆的拼图）”“a mosaic narrative（拼贴式叙事）”。","常见搭配：a mosaic of + 名词复数/抽象名词（a mosaic of cultures / voices / experiences）；mosaic tile（马赛克瓷砖）；mosaic art（马赛克艺术）。"]}
{"word":"mosaical","summary":{"en":"Mosaical means “related to mosaics” or “made up of many different parts like a mosaic.”","zh":"mosaical 表示“马赛克的”，也可引申为“由许多不同部分拼合而成的（像马赛克一样）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a mosaic (a picture or pattern made from many small pieces of colored stone, glass, tile, etc.).","zh":"马赛克的；与马赛克（由许多小块彩色石材、玻璃、瓷砖等拼成的图案或画面）有关的。"},"examples":[{"en":"The museum has a mosaical floor from the Roman period.","zh":"博物馆里有一块罗马时期的马赛克地面。"},{"en":"She studied mosaical techniques using tiny glass tiles.","zh":"她学习了用小玻璃砖拼贴马赛克的技法。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made up of many different parts or influences; mixed like a mosaic.","zh":"由多种不同部分或影响组成的；像马赛克一样拼合而成的。"},"examples":[{"en":"The city’s culture is mosaical, shaped by many immigrant communities.","zh":"这座城市的文化是“马赛克式”的，由许多移民社群共同塑造。"},{"en":"Her writing style is mosaical, combining history, memoir, and poetry.","zh":"她的写作风格是“马赛克式”的，把历史、回忆录和诗歌融合在一起。"}]}],"synonyms":["mosaic","mosaic-like","patchwork","composite","mixed"],"phonetic":"/moʊˈzeɪ.ɪ.kəl/","extraExplanation":["“mosaical”是比较少见的形容词，更常用的是“mosaic”（既可作名词也可作形容词，如 a mosaic pattern）。在正式写作中你也可以用“mosaic-like”表达“像马赛克一样的”。","词源上与“mosaic/ Moses”相关（历史上曾有将马赛克工艺与摩西相关联的说法），但现代用法主要强调“由许多小部分拼成整体”的视觉或比喻意义。"]}
{"word":"mosaically","summary":{"en":"“Mosaically” means “in a mosaic-like, patchwork way, made from many different parts.”","zh":"“mosaically”表示“像马赛克一样由许多不同部分拼合而成的方式（拼贴式）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is made of many small, different pieces (like a mosaic), forming a complex pattern or whole.","zh":"以“马赛克式/拼贴式”的方式：由许多不同的小部分拼合成复杂整体的样子。"},"examples":[{"en":"The novel is told mosaically, through letters, memories, and short scenes.","zh":"这部小说以拼贴式叙事展开，通过书信、回忆和短场景来讲述。"},{"en":"The city’s culture developed mosaically from many immigrant communities.","zh":"这座城市的文化由许多移民社区拼合式地发展而来。"}]}],"synonyms":["in a patchwork way","piecemeal","fragmentedly","in a collage-like way"],"phonetic":"/moʊˈzeɪɪkli/","extraExplanation":["“mosaically”来自“mosaic（马赛克/镶嵌画）+ -ally”。在写作、影评和艺术评论里很常见，用来形容叙事结构或文化构成是“碎片化但能拼出整体”的。","近义表达有时可用“in a patchwork way / in a piecemeal way”，但“mosaically”通常更强调“多样元素组合成图案/意义”，不一定带有“零散、缺乏计划”的贬义。"]}
{"word":"mosaicism","summary":{"en":"Mosaicism is having two or more genetically different cell populations in one organism, usually from a single fertilized egg; it can also mean a patchwork-like mixture in a figurative sense.","zh":"mosaicism 指同一生物体内存在两种或以上遗传不同的细胞群（通常源自同一受精卵）；也可作引申义，表示“马赛克式的拼合/混合”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology/Medicine) The condition of having two or more different sets of cells (with different genetic makeup) in the same person or organism, all originating from one fertilized egg.","zh":"（生物/医学）嵌合现象：同一个人或生物体内存在两种或以上遗传组成不同的细胞群，但都来源于同一个受精卵。"},"examples":[{"en":"The test showed mosaicism, meaning some cells carried the mutation while others did not.","zh":"检测结果显示存在嵌合现象，这意味着有些细胞携带该突变，而另一些没有。"},{"en":"In prenatal screening, mosaicism can make results harder to interpret.","zh":"在产前筛查中，嵌合现象会让结果更难解读。"},{"en":"Skin patches with different pigmentation can sometimes be linked to mosaicism.","zh":"皮肤上出现不同色素的斑块有时可能与嵌合现象有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(General/figurative) A mixture or pattern made from different parts; a patchwork-like combination.","zh":"（引申义）由不同部分拼成的混合体；像“马赛克拼贴”一样的组合。"},"examples":[{"en":"The city is a mosaicism of cultures, languages, and foods.","zh":"这座城市是文化、语言与食物交织而成的“马赛克”。"},{"en":"Her memories formed a mosaicism of small, vivid moments.","zh":"她的记忆由许多鲜明的小片段拼成一幅“马赛克”。"}]}],"synonyms":["genetic mosaicism","somatic mosaicism","cellular mosaicism","patchwork","mixture"],"phonetic":"/moʊˈzeɪɪsɪzəm/","extraExplanation":["“mosaicism”来自“mosaic（马赛克）”，形象地比喻“同一整体由不同小块组成”。在遗传学中，它通常指受精后（post-zygotic）发生突变或染色体变化，导致个体不同细胞系的基因不同。","需要与“chimerism（嵌合体/嵌合现象）”区分：mosaicism 通常来自同一个受精卵的细胞分化过程中的变化；chimerism 往往来自不同受精卵或不同个体细胞的融合（例如双胎细胞交换、移植后）。","临床语境中常见相关表达：“low-level mosaicism（低水平嵌合）”“somatic mosaicism（体细胞嵌合）”“germline mosaicism（生殖系嵌合）”。不同检测样本（血液、皮肤、羊水等）可能出现不同结果，因此解释时需结合取样部位与比例。"]}
{"word":"mosaicist","summary":{"en":"A mosaicist is an artist or craftsperson who creates or restores mosaics using small pieces of colored material.","zh":"mosaicist 指创作或修复“马赛克/镶嵌画”的艺术家或工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes mosaics (pictures or designs made by arranging small pieces of colored glass, stone, tile, etc.).","zh":"马赛克艺术家；镶嵌画工匠（用彩色玻璃、石头、瓷砖等小块拼贴出图案或画面的人）。"},"examples":[{"en":"The mosaicist spent weeks placing tiny tiles to create the church’s wall image.","zh":"这位马赛克艺术家花了几周时间摆放细小的瓷砖，完成教堂墙上的图像。"},{"en":"We watched a mosaicist repair a cracked section of an ancient floor.","zh":"我们看着一位镶嵌画工匠修复一块古老地面的裂损部分。"}]}],"synonyms":["mosaic artist","mosaic maker","mosaic craftsman","tile artist"],"phonetic":"/moʊˈzeɪɪs(t)/","extraExplanation":["“mosaicist”来自“mosaic（马赛克/镶嵌画）+ -ist（从事某种职业或活动的人）”。在艺术史语境中，mosaicists 常与拜占庭（Byzantine）教堂金色背景镶嵌画、古罗马（Roman）地面镶嵌画等联系在一起。","常见搭配：mosaicist + create/design/restore（创作/设计/修复镶嵌画）；mosaicist’s studio（镶嵌画工作室）。相关词：mosaic（n./adj. 马赛克；镶嵌画/拼合的）、tile（瓷砖）、tessera/tesserae（镶嵌画小块，较文学/艺术史用语）。"]}
{"word":"mosaicity","summary":{"en":"Mosaicity is a crystallography term meaning how misaligned the tiny domains in a crystal are, often seen as diffraction spot broadening.","zh":"Mosaicity 是晶体学术语，指晶体内微小晶畴取向不一致的程度，常表现为衍射斑点变宽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Crystallography) The degree to which a crystal is made up of many tiny, slightly misaligned domains (often measured as an angular spread), affecting the sharpness of diffraction patterns.","zh":"（晶体学）马赛克性：晶体由许多微小且取向略有偏差的晶畴组成的程度（常用角度展宽来衡量），会影响衍射图样的清晰度。"},"examples":[{"en":"The X-ray data show low mosaicity, so the crystal is well ordered.","zh":"X 射线数据表明马赛克性很低，因此晶体有较好的有序度。"},{"en":"High mosaicity can broaden diffraction spots and reduce resolution.","zh":"较高的马赛克性会使衍射斑点变宽并降低分辨率。"},{"en":"We optimized the cooling conditions to reduce mosaicity in the protein crystal.","zh":"我们优化了冷却条件，以降低蛋白质晶体的马赛克性。"}]}],"synonyms":["mosaic spread","crystal mosaicity","domain misorientation"],"phonetic":"/moʊzeɪˈɪsɪti/","extraExplanation":["“mosaicity”主要出现在X射线晶体学与蛋白质晶体学论文/软件输出中，常与“mosaic spread（马赛克展宽/镶嵌展宽）”相关：数值越小通常表示晶体内部取向更一致、衍射点更尖锐。","不要把它和日常的“mosaic（马赛克图案）”混为一谈：这里的“mosaic-”是比喻晶体像由许多小“块”拼成。"]}
{"word":"mosaicked","summary":{"en":"Mosaicked describes something patterned like a mosaic—made of many small pieces or showing a patchy, mixed look.","zh":"mosaicked 指呈马赛克般的拼块图案：由许多小片组成，或外观斑驳、拼接感强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with or made to look like a mosaic (many small pieces forming a pattern or picture).","zh":"由马赛克拼成的；呈马赛克效果的（由许多小碎片拼成图案或图像）。"},"examples":[{"en":"The bathroom wall was mosaicked with blue and white tiles.","zh":"浴室的墙面用蓝白瓷砖拼成了马赛克。"},{"en":"From above, the fields looked mosaicked into neat squares.","zh":"从空中看，田地像马赛克一样被分成整齐的方块。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In science/medicine) Made up of different parts or patches; showing a mixed, patchy pattern (often in images or tissues).","zh":"（科学/医学）由不同部分或斑块组成的；呈混合、斑驳图案的（常用于影像或组织）。"},"examples":[{"en":"The scan showed a mosaicked pattern of light and dark areas.","zh":"扫描显示出明暗交错的马赛克样图案。"},{"en":"The researchers noted mosaicked pigmentation on the specimen.","zh":"研究人员记录到该标本的色素呈马赛克式分布。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mosaic”: to decorate or form with small pieces in a mosaic style.","zh":"“mosaic”的过去式/过去分词：用小块材料以马赛克方式装饰或拼成图案。"},"examples":[{"en":"They mosaicked the tabletop with broken china.","zh":"他们用碎瓷片把桌面拼成了马赛克。"}]}],"synonyms":["mosaic","tessellated","patchwork","speckled","variegated"],"phonetic":"/moʊˈzeɪɪkt/","extraExplanation":["“mosaicked”多用于描述“像马赛克那样由许多小块拼起来”的视觉效果，不一定真的用瓷砖：也可指航拍地貌、拼贴艺术、或医学影像中的“斑驳/拼块状”外观。","词根来自“mosaic（马赛克）”，源于拉丁语/希腊语中与“缪斯（Muses）”相关的词，早期指精美的装饰艺术；现代英语里也常引申为“由许多小部分组成的整体”。"]}
{"word":"mosaicking","summary":{"en":"Mosaicking means making a mosaic or combining many small pieces/images into one whole, often used in art and image/satellite mapping.","zh":"Mosaicking 指制作马赛克，或把许多小块/多张图像拼合成一个整体，常用于艺术与影像/卫星制图等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making a mosaic (a picture/pattern made from many small pieces), or combining many small parts into one whole","zh":"马赛克制作；（比喻）把许多小部分拼合成一个整体的过程"},"examples":[{"en":"The artist is mosaicking the wall with tiny glass tiles.","zh":"这位艺术家正在用小玻璃砖给墙做马赛克拼贴。"},{"en":"In satellite mapping, mosaicking combines many images into one seamless map.","zh":"在卫星制图中，mosaicking 会把多张图像合成为一张无缝地图。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of “mosaic”) making a mosaic; combining many small images/pieces into a single larger image","zh":"（mosaic 的现在分词/动名词）做马赛克；把许多小图像/片段合成一张更大的图像"},"examples":[{"en":"They are mosaicking old photos to create a poster.","zh":"他们正在把旧照片拼合起来做一张海报。"},{"en":"The software is mosaicking the panorama automatically.","zh":"软件正在自动拼接全景图。"}]}],"synonyms":["mosaic-making","tiling","image stitching","compositing","assembling"],"phonetic":"/moʊˈzeɪ.ɪ.kɪŋ/","extraExplanation":["“mosaicking”常见于艺术与影像处理/遥感领域：艺术里指用小石子、瓷片、玻璃等拼贴成图案；计算机与地理信息中指把多张照片或卫星影像“拼接/镶嵌”成一张连续的图。中文常译为“拼接”“镶嵌（合成）”或“马赛克（处理/制作）”，具体看语境。"]}
{"word":"mosaics","summary":{"en":"Mosaics are artworks made from many small colored pieces, and the word can also mean a mix of different elements forming one whole.","zh":"mosaics 指由许多小块材料拼成的马赛克/镶嵌画；也可比喻由不同元素构成的整体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pictures or patterns made by arranging many small pieces of colored stone, glass, tile, or other materials on a surface.","zh":"用许多小块的彩色石头、玻璃、瓷砖等拼贴在表面上形成的图案或画面（马赛克/镶嵌画）。"},"examples":[{"en":"We admired the ancient mosaics on the church walls.","zh":"我们欣赏了教堂墙上的古代马赛克壁画。"},{"en":"The museum has Roman mosaics made of tiny colored tiles.","zh":"博物馆里有用微小彩色瓷砖拼成的罗马马赛克作品。"}]},{"partOfSpeech":"n.","definition":{"en":"A mixture or combination of different parts that form a whole (often used metaphorically).","zh":"（比喻）由不同部分组合而成的整体；混合体。"},"examples":[{"en":"The city is a mosaic of cultures and languages.","zh":"这座城市是多元文化与语言交织的马赛克整体。"},{"en":"Her essay is a mosaic of memories from childhood.","zh":"她的文章像一幅由童年记忆拼成的马赛克。"}]}],"synonyms":["tilework","inlay","patchwork","collage","blend"],"phonetic":"/moʊˈzeɪɪks/","extraExplanation":["“mosaic”作名词时既可指真实的镶嵌艺术，也常用于比喻“多样元素拼成的整体”。在艺术史中，拜占庭与古罗马的马赛克非常有名，常出现在教堂穹顶、地面与墙面装饰中。","日常生活里你也会见到“mosaic”表示图像处理的“马赛克（打码）”效果，不过更常见的说法是“pixelation/blur”。"]}
{"word":"mosaism","summary":{"en":"Mosaicism is either a genetic condition where different cell groups exist in one individual, or an art style using mosaics.","zh":"mosaicism 指（1）遗传/医学中的“镶嵌现象”，或（2）艺术中的“马赛克拼嵌风格/技法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology/medicine) The condition in which one person, animal, or plant has two or more groups of cells with different genetic makeup, even though they come from the same fertilized egg.","zh":"（生物/医学）镶嵌现象：同一个个体（人/动物/植物）体内存在两种或以上遗传信息不同的细胞群，但它们来源于同一个受精卵。"},"examples":[{"en":"Some skin disorders are caused by genetic mosaicism, so symptoms may appear in patches.","zh":"有些皮肤疾病由遗传镶嵌现象引起，因此症状可能呈片状分布。"},{"en":"The test showed mosaicism, meaning not all cells carried the mutation.","zh":"检测结果显示存在镶嵌现象，这意味着并非所有细胞都携带该突变。"}]},{"partOfSpeech":"n.","definition":{"en":"(Art) A style or technique that uses small pieces of stone, glass, or tile to form an image; the use of mosaics as an art form.","zh":"（艺术）马赛克艺术/拼贴镶嵌技法：用小块石头、玻璃或瓷砖拼成图像的艺术形式；对马赛克的运用。"},"examples":[{"en":"The church is famous for its Byzantine mosaicism.","zh":"这座教堂以其拜占庭式马赛克艺术而闻名。"},{"en":"Ancient Roman floors often show mosaicism with detailed scenes.","zh":"古罗马地面常见精细场景的马赛克拼嵌艺术。"}]}],"synonyms":["genetic mosaicism","cellular mosaicism","mosaic art","mosaic technique"],"phonetic":"/moʊˈzeɪ.ɪ.sɪ.zəm/","extraExplanation":["你输入的“mosaism”通常是拼写错误；更常见、标准的拼写是 **mosaicism**。","词源上与“mosaic（马赛克/镶嵌画）”有关：在医学里用“镶嵌”来比喻同一身体里“混合存在不同细胞群”的状态。"]}
{"word":"mosaist","summary":{"en":"A mosaicist is an artist who makes mosaics.","zh":"mosaicist 指制作马赛克作品的艺术家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who designs or makes mosaics (pictures or patterns made from many small pieces of colored stone, glass, etc.)","zh":"马赛克艺术家；制作马赛克（由许多小块彩色石材、玻璃等拼成的图案/画面）的人"},"examples":[{"en":"The mosaicist spent weeks placing tiny glass tiles to finish the church wall.","zh":"这位马赛克艺术家花了几周时间摆放细小的玻璃砖，完成教堂的墙面作品。"},{"en":"She trained as a mosaicist in Italy and now teaches workshops.","zh":"她在意大利受训成为马赛克艺术家，现在开设工作坊授课。"}]}],"synonyms":["mosaic artist","tile artist"],"phonetic":"/moʊˈzeɪɪsɪst/","extraExplanation":["“mosaist”通常不是标准拼写；你可能想写的是 **mosaicist**（马赛克艺术家）或 **mosaic**（马赛克；拼贴图案/画面）。","词源上与拉丁语/意大利语中表示“马赛克作品”的词有关；在艺术史与宗教建筑语境（如教堂、穹顶装饰）里很常见。"]}
{"word":"mosan","summary":{"en":"Mosan refers to the Meuse River valley region and especially to its medieval (often Romanesque) art and craftsmanship.","zh":"Mosan 指默兹河流域地区，尤其常用于指该地区的中世纪（多为罗马式）艺术与工艺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Meuse River valley region (especially parts of present-day Belgium) and its medieval culture and art.","zh":"与默兹河（Meuse）流域地区相关的（尤指今比利时一带）及其中古文化与艺术的。"},"examples":[{"en":"The museum has several Mosan metalwork pieces from the 12th century.","zh":"这家博物馆收藏了几件12世纪的默兹河流域（Mosan）金属工艺品。"},{"en":"She wrote a paper on Mosan Romanesque art.","zh":"她写了一篇关于默兹河流域罗马式（Mosan Romanesque）艺术的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"The artistic style and works (especially Romanesque) produced in the Meuse River valley region.","zh":"默兹河流域地区产生的艺术风格与作品（尤指罗马式时期）。"},"examples":[{"en":"Mosan is known for high-quality bronze and enamel work.","zh":"Mosan 艺术以高水平的青铜与珐琅工艺闻名。"},{"en":"They studied Mosan alongside Ottonian art.","zh":"他们把 Mosan 艺术与奥托王朝艺术一起研究。"}]}],"synonyms":["Meuse-valley (in context)","Romanesque (related, broader)"],"phonetic":"/ˈmoʊzən/","extraExplanation":["“Mosan”来自法语/拉丁语传统中的“Meuse（默兹河）”相关称呼，常见于艺术史语境，如“Mosan art（默兹河流域艺术）”“Mosan metalwork（该地区金属工艺）”。","它通常是学术或博物馆用语，在日常英语里不常见；如果你是在普通对话里看到“mosan”，也可能是人名、地名或拼写误差，需要结合上下文确认。"]}
{"word":"mosandrite","summary":{"en":"Mosandrite is a rare silicate mineral, mostly discussed in geology and mineral collecting.","zh":"Mosandrite（莫桑德石）是一种罕见的硅酸盐矿物，主要出现在地质与矿物收藏语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a complex silicate) usually found in alkaline igneous rocks; it is typically brownish to yellowish and is mainly of interest to mineral collectors and geologists.","zh":"一种罕见矿物（复杂硅酸盐矿物），常见于碱性火成岩中；颜色多为棕黄色到黄色，主要供矿物收藏与地质研究之用。"},"examples":[{"en":"Mosandrite is a rare mineral that collectors may see in specialized specimens.","zh":"莫桑德石（mosandrite）是一种罕见矿物，收藏者可能只会在专业标本中见到。"},{"en":"The geologist identified mosandrite in an alkaline rock sample under the microscope.","zh":"地质学家在显微镜下从一份碱性岩石样品中鉴定出了莫桑德石。"}]}],"phonetic":"/moʊˈsænˌdraɪt/","extraExplanation":["“Mosandrite”常被误拼或误读；它是矿物名称，不是日常英语词汇。","词源上多认为以瑞典化学家 Mosander（莫桑德）命名，属于以科学家名字命名矿物的常见方式。"]}
{"word":"mosasaur","summary":{"en":"A mosasaur is a large extinct marine reptile from the late Cretaceous, often mistaken for a dinosaur.","zh":"mosasaur（沧龙）是白垩纪晚期的巨型已灭绝海生爬行动物，常被误认为恐龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large, extinct marine reptile that lived in the oceans during the age of dinosaurs (late Cretaceous period)","zh":"一种已灭绝的巨型海生爬行动物，生活在恐龙时代的海洋中（白垩纪晚期）"},"examples":[{"en":"The museum has a mosasaur skull on display.","zh":"博物馆展出了一个沧龙的头骨。"},{"en":"A mosasaur was a powerful ocean predator, but it was not a dinosaur.","zh":"沧龙是强大的海洋捕食者，但它并不是恐龙。"}]}],"phonetic":"/ˈmoʊzəˌsɔr/","extraExplanation":["“mosasaur”来自拉丁化的词根：Mosa（默兹河/马斯河，今荷兰与比利时一带）+ -saur（“蜥蜴/爬行动物”）。早期化石在该河附近被发现，所以得名。","学习时常见的误区是把它当作恐龙：沧龙属于海生有鳞类爬行动物（与蜥蜴、蛇更接近），而恐龙主要是陆生的恐龙类群。","在大众文化中它常被描绘成“海中巨兽”，例如一些电影/纪录片会出现夸张体型；真实沧龙种类很多，体型差异也很大。"]}
{"word":"mosasauri","summary":{"en":"Mosasaur: an extinct giant marine reptile from the Late Cretaceous, a top ocean predator (not a dinosaur).","zh":"沧龙：白垩纪晚期已灭绝的巨大海生爬行动物，曾是海洋顶级捕食者（不是恐龙）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct marine reptile that lived during the Late Cretaceous period; mosasaurs were powerful swimmers and major ocean predators (not dinosaurs).","zh":"沧龙（沧龙类）：一种已灭绝的巨大海生爬行动物，生活在白垩纪晚期；游泳能力强，是当时海洋中的顶级捕食者（不是恐龙）。"},"examples":[{"en":"Scientists found mosasaur teeth in rocks from the Late Cretaceous.","zh":"科学家在白垩纪晚期的岩层中发现了沧龙的牙齿。"},{"en":"A mosasaur likely hunted fish, turtles, and other marine animals.","zh":"沧龙很可能捕食鱼类、海龟和其他海洋动物。"},{"en":"Many museums display mosasaur fossils to show what ancient seas were like.","zh":"许多博物馆展出沧龙化石，用来展示远古海洋的样子。"}]}],"synonyms":["mosasaurid","marine reptile"],"phonetic":"/ˈmoʊzəˌsɔr/","extraExplanation":["你输入的“mosasauri”更像是拼写或复数形式的误写。常见单数是 **mosasaur**，复数是 **mosasaurs**。在古生物学的拉丁化写法里，有时会见到更“学术风”的词尾变化，但日常英语里一般不用“mosasauri”。","沧龙最早在荷兰马斯特里赫特（Maastricht）附近被发现，因此名字与当地的默兹河（Meuse，拉丁名 Mosa）有关。它们属于“沧龙科”海生蜥形类，并不是鱼龙或蛇颈龙，也不是恐龙。"]}
{"word":"mosasauria","summary":{"en":"Mosasauria is the scientific name for an order of extinct marine reptiles (mosasaurs) from the Late Cretaceous.","zh":"Mosasauria（沧龙目）是白垩纪晚期已灭绝的海生爬行动物（沧龙类）的科学分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of large, extinct marine reptiles—often called mosasaurs—that lived in the Late Cretaceous period","zh":"沧龙目：一类生活在白垩纪晚期的巨大海生爬行动物的分类群（目），常被统称为“沧龙”"},"examples":[{"en":"Mosasauria were among the top predators in the oceans during the Late Cretaceous.","zh":"沧龙目是白垩纪晚期海洋中的顶级掠食者之一。"},{"en":"Fossils of Mosasauria have been found in North America, Europe, and other regions.","zh":"沧龙目的化石在北美、欧洲等地区都有发现。"},{"en":"In museums, Mosasauria skeletons help visitors imagine ancient seas.","zh":"在博物馆里，沧龙目的骨架能帮助参观者想象远古海洋。"}]}],"synonyms":["mosasaurs","order Mosasauria"],"phonetic":"ˌmoʊzəˈsɔriə","extraExplanation":["“Mosasauria”是生物分类学用语，指“沧龙目”（一个“目”级别的分类单元）。日常科普里更常见的是“mosasaur（沧龙）”，通常指其中某个属或泛指这一类动物。","词源来自拉丁化的地名“Meuse（默兹河）”，因为早期重要化石与该地区有关；后缀“-sauria”与“蜥蜴/爬行动物类群”相关，常见于动物类群名称。","写作时注意大小写：作为正式分类群名称常写作“Mosasauria”（首字母大写）；非正式泛称时可能用小写“mosasaur(s)”。"]}
{"word":"mosasaurian","summary":{"en":"Mosasaurs were huge extinct marine reptiles; “mosasaurian” means a mosasaur or something related to mosasaurs.","zh":"沧龙是巨大的已灭绝海生爬行动物；“mosasaurian”指沧龙（或其化石/标本），或“与沧龙类有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct marine reptile (a mosasaur) that lived in the age of dinosaurs; also, a fossil or specimen of this animal.","zh":"（已灭绝的）沧龙类海生爬行动物；也可指沧龙的化石或标本。"},"examples":[{"en":"Scientists found mosasaurian fossils in rocks that were once an ancient sea.","zh":"科学家在曾经是古海洋的岩层中发现了沧龙类化石。"},{"en":"The museum’s mosasaurian skeleton is one of its most popular displays.","zh":"博物馆的沧龙类骨架是最受欢迎的展品之一。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of mosasaurs.","zh":"与沧龙类有关的；具有沧龙类特征的。"},"examples":[{"en":"The tooth has a sharp, mosasaurian shape typical of marine predators.","zh":"这颗牙齿有典型海洋捕食者的锋利沧龙类形态。"},{"en":"Researchers debate whether the animal shows more mosasaurian or snake-like traits.","zh":"研究人员争论这种动物表现出更多沧龙类特征还是更像蛇的特征。"}]}],"synonyms":["mosasaur","mosasaur-related","of mosasaurs (adj. phrase)"],"phonetic":"/ˌmoʊsəˈsɔriən/","extraExplanation":["“mosasaurian”来自“mosasaur（沧龙）”，而“mosasaur”得名于荷兰的默兹河（Meuse River，拉丁名Mosa）。早期发现的沧龙化石与该地区有关，因此用河名来命名。","在科普文章中，“mosasaurian”常用来概括“沧龙类（mosasaurs及其近亲）”这一类群的特征，如海洋适应、捕食方式与牙齿形态等。"]}
{"word":"mosasaurid","summary":{"en":"A mosasaurid is an extinct marine reptile from the mosasaur family, common in the Late Cretaceous seas.","zh":"mosasaurid 指沧龙科动物：白垩纪晚期海洋中常见的已灭绝大型海生爬行动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an extinct family of large marine reptiles (mosasaurs) that lived in the oceans during the Late Cretaceous period","zh":"沧龙科动物；已灭绝的一类大型海生爬行动物（沧龙）的成员，生活在白垩纪晚期的海洋中"},"examples":[{"en":"Fossils of mosasaurids have been found in many parts of the world.","zh":"在世界许多地区都发现了沧龙科动物的化石。"},{"en":"A mosasaurid was a marine reptile, not a dinosaur.","zh":"沧龙科动物是海生爬行动物，并不是恐龙。"}]}],"synonyms":["mosasaur (broader/common term)"],"phonetic":"/ˌmoʊzəˈsɔrɪd/","extraExplanation":["词源提示：mosasaurid 来自 mosasaur（沧龙）+ -id（表示“……类/……科的成员”）。mosasaur 又源于拉丁化的希腊语，Mosa- 与欧洲的默兹河（Meuse/Mosa）有关，因为早期化石与该地区的发现相关。","易混点：沧龙科属于“鳞龙类”（与蜥蜴、蛇更接近），不是鱼龙（ichthyosaur）也不是蛇颈龙（plesiosaur）。在科普文章中常用来强调它们是海洋掠食者，但分类上仍是爬行动物。"]}
{"word":"mosasauridae","summary":{"en":"Mosasauridae is the scientific family name for mosasaurs—extinct marine reptiles from the Late Cretaceous.","zh":"Mosasauridae 是“沧龙科”的学名，指白垩纪晚期已灭绝的海生爬行动物（沧龙类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct large marine reptiles (mosasaurs) that lived mainly in the Late Cretaceous period.","zh":"沧龙科：一类已灭绝的大型海生爬行动物（沧龙类）的科级分类，主要生活在白垩纪晚期。"},"examples":[{"en":"Mosasaurs in the family Mosasauridae were top predators in ancient seas.","zh":"沧龙科的沧龙类是远古海洋中的顶级掠食者。"},{"en":"Fossils of Mosasauridae have been found in places that were once covered by shallow seas.","zh":"沧龙科的化石常见于曾被浅海覆盖的地区。"}]}],"synonyms":["mosasaurs"],"phonetic":"/ˌmoʊ.zəˈsɔr.ɪˌdi/","extraExplanation":["读法提示：词尾 -idae 常用于动物分类学中表示“科”（family），如 Felidae（猫科）。","词源：Mosasauridae 来自 Mosasaurus（沧龙属）+ -idae；Mosasaurus 的名字与荷兰马斯河（Meuse / Maas）有关，因为早期重要化石在当地附近被发现。","背景小知识：沧龙并不是恐龙（dinosaurs），而是与现代蜥蜴、蛇更接近的海生爬行动物；它们在白垩纪末期的大灭绝事件中消失。"]}
{"word":"mosasauroid","summary":{"en":"A mosasauroid is a mosasaur-like marine reptile (or something related to mosasaurs), best known from the Late Cretaceous seas.","zh":"mosasauroid 指“沧龙类”海生爬行动物（或与沧龙有关/类似沧龙的事物），最著名于白垩纪晚期的海洋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mosasaur-like marine reptile; a member of the superfamily Mosasauroidea (large predatory reptiles that lived in the seas during the Late Cretaceous).","zh":"沧龙类（沧龙总科）海生爬行动物；指外形或分类上属于“沧龙总科（Mosasauroidea）”的史前海洋掠食性爬行动物，主要生活在白垩纪晚期的海洋中。"},"examples":[{"en":"Scientists found mosasauroid fossils in rocks formed under an ancient sea.","zh":"科学家在曾经的古海沉积岩中发现了沧龙类化石。"},{"en":"A mosasauroid could grow very large and hunt fish and other marine animals.","zh":"有些沧龙类个体能长得非常大，会捕食鱼类和其他海洋动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to, or resembling, mosasaurs (mosasauroids).","zh":"与沧龙类有关的；沧龙类的；类似沧龙类的。"},"examples":[{"en":"The museum has a mosasauroid jaw on display.","zh":"博物馆展出了一件沧龙类的颌骨化石。"}]}],"synonyms":["mosasaur","mosasaurid"],"phonetic":"/ˌmoʊsəˈsɔːrɔɪd/","extraExplanation":["词源提示：mosasauroid 来自 “mosasaur（沧龙）+ -oid（“像……的/……类的”）”。因此它既可指“沧龙类动物”（名词），也可作形容词表示“沧龙类的”。","背景小知识：沧龙类并不是恐龙，而是生活在海里的大型爬行动物，和现代蜥蜴、蛇类有较近的亲缘关系。它们在白垩纪晚期的海洋生态系统中处于顶级捕食者位置。","使用场景：这个词多见于古生物学、博物馆说明牌、科普文章和学术论文中；日常英语里更常用 mosasaur（沧龙）或 mosasaurid（沧龙科成员，偏学术）。"]}
{"word":"mosasaurus","summary":{"en":"Mosasaurus: a giant extinct marine reptile from the Late Cretaceous.","zh":"沧龙：白垩纪晚期的巨大已灭绝海生爬行动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large, extinct marine reptile that lived in the Late Cretaceous period and hunted in the ocean","zh":"一种已灭绝的巨大海生爬行动物，生活在白垩纪晚期，在海洋中捕食"},"examples":[{"en":"The mosasaurus was an apex predator in Cretaceous seas.","zh":"沧龙是白垩纪海洋中的顶级掠食者。"},{"en":"Scientists study mosasaurus fossils to learn about ancient ocean ecosystems.","zh":"科学家研究沧龙化石来了解古代海洋生态系统。"}]}],"synonyms":["marine reptile","mosasaur"],"phonetic":"/ˌmoʊzəˈsɔrəs/","extraExplanation":["“mosasaurus”一词来自拉丁化的学名 *Mosasaurus*，意为“默兹河（Meuse/Maas）蜥蜴”，因为早期重要化石出土于欧洲默兹河附近。","沧龙不是恐龙，而是与现代蜥蜴和蛇更接近的有鳞类爬行动物；它们适应海洋生活，四肢演化成鳍状肢。","在大众文化中，沧龙常被影视作品塑造成巨型“海怪”；实际不同物种体型差异较大，但确实是当时非常强大的海洋捕食者。"]}
{"word":"mosatenan","summary":{"en":"“mosatenan” is not recognized as a standard English word; it’s probably a misspelling or a proper name. Share context to identify the intended word.","zh":"“mosatenan”不是标准英语词汇，可能是拼写错误或专有名词。提供上下文可帮助确认原本想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “mosatenan” is likely a misspelling, a username, or a name rather than an English vocabulary item.","zh":"不是标准英语单词。“mosatenan”更可能是拼写错误、用户名或专有名词（人名/地名）等。"},"examples":[{"en":"I can’t find “mosatenan” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里查不到“mosatenan”——你能把它出现的句子发我吗？"},{"en":"If you meant a different word, tell me the context and I’ll help you identify the correct spelling.","zh":"如果你想表达的是另一个词，请提供上下文，我可以帮你定位正确拼写。"}]}],"extraExplanation":["如果你是在聊天/游戏/社交平台看到的，它也可能是ID而非单词，因此不会出现在词典里。","你可以提供：①原句或截图；②它出现的主题（例如医学、化学、动漫、地名、人名）；③你猜测的读音/语言来源。我就能更准确判断它可能想写的词（例如接近的拼写、常见输入法误打等）。"]}
{"word":"moschate","summary":{"en":"“Moschate” is an uncommon, old-fashioned word meaning “musky; smelling of musk,” and rarely “to perfume with musk.”","zh":"“moschate”是较少见、偏古旧的词，主要指“有麝香味的（musky）”，也可极少用作动词表示“用麝香熏香/使带麝香味”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) Having the smell of musk; musky; scented like musk.","zh":"（古旧/文学用语）带麝香味的；有麝香气的；麝香般芬芳的。"},"examples":[{"en":"The air in the old wardrobe was faintly moschate.","zh":"旧衣柜里的空气隐约带着麝香般的气味。"},{"en":"In the poem, she describes a moschate perfume that lingers after he leaves.","zh":"在诗里，她描写他离开后仍萦绕不散的麝香香水味。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To scent or perfume with musk.","zh":"（罕见）用麝香熏香；使带麝香味。"},"examples":[{"en":"They moschate the oil with a trace of musk for a warmer note.","zh":"他们在油里加一点麝香来增添更温暖的香调。"}]}],"synonyms":["musky","musk-scented","musked","perfumed"],"phonetic":"/ˈmɑːskeɪt/","extraExplanation":["“moschate”比较少见，多出现在较旧的英语文本或诗歌中，用来营造一种浓郁、略带动物感的香气意象。日常英语更常用的是“musky”或“musk-scented”。","词源上与“musk（麝香）”同源，常见于描写香水、织物、房间气味或某种“诱惑/沉郁”的氛围。"]}
{"word":"moschatel","summary":{"en":"Moschatel is a small, musky-scented woodland flower (Adoxa moschatellina).","zh":"Moschatel 指一种带麝香气味的林地小野花（学名 *Adoxa moschatellina*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small woodland plant with a musky scent and tiny greenish-yellow flowers (also called “town-hall clock”); its scientific name is *Adoxa moschatellina*.","zh":"一种有麝香气味的林地小植物，开细小的黄绿色花（也叫“town-hall clock”）；学名为 *Adoxa moschatellina*（麝香草属/五瓣草属的麝香草）。"},"examples":[{"en":"We found moschatel growing in the damp shade near the stream.","zh":"我们在小溪边潮湿的树荫下发现了麝香草（moschatel）。"},{"en":"In older nature writing, moschatel is often mentioned as an early spring woodland flower.","zh":"在较早的自然散文里，moschatel 常被提到是早春的林地野花。"}]}],"synonyms":["Adoxa moschatellina","town-hall clock","tuberous moschatel"],"phonetic":"/ˈmɑskəˌtɛl/","extraExplanation":["“Moschatel”这个词比较文学化、偏古旧，现代日常英语里不常见；在植物学或自然写作中更可能遇到。","词源与“musk（麝香）”有关，指它带有淡淡的麝香气味；有时也被俗称为“town-hall clock”，据说和它花朵的排列形态有关。"]}
{"word":"moschatelline","summary":{"en":"A rare word meaning “related to or resembling the moschatel plant (Adoxa moschatellina).”","zh":"一个罕见词，意为“与麝香草/五瓣花（moschatel，*Adoxa moschatellina*）有关的或类似的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, made from, or resembling the moschatel plant (\"moschatel\"; *Adoxa moschatellina*), a small woodland herb.","zh":"与“麝香草/五瓣花”（moschatel；学名 *Adoxa moschatellina*）有关的；由其制成的；或类似这种林地小草本植物的。"},"examples":[{"en":"The field guide mentioned a moschatelline scent near the damp, shaded path.","zh":"那本野外指南提到，在潮湿阴凉的小路旁会闻到一种带有 moschatelline（类似麝香草）的气味。"},{"en":"Researchers documented moschatelline traits in the understory plants of the forest.","zh":"研究人员记录了森林下层植被中一些植物的 moschatelline（麝香草相关）特征。"}]},{"partOfSpeech":"n.","definition":{"en":"A moschatel-like substance or characteristic (rare usage).","zh":"类似麝香草的物质或特征（罕见用法）。"},"examples":[{"en":"The perfumer described a faint moschatelline in the base note.","zh":"调香师说后调里有一丝淡淡的 moschatelline（类似麝香草的气息）。"}]}],"synonyms":["moschatel-related","moschatel-like","Adoxa-related"],"phonetic":"/ˌmɑːskəˈtɛlɪn/","extraExplanation":["“moschatelline”非常少见，多用于植物学或较文学化的描写。它来自“moschatel / moschatella”，指一种早春开花的小型林地植物（*Adoxa moschatellina*）。","moschatel 的名字与“musk（麝香）”有关，因为它被认为带有淡淡的麝香气味；所以“moschatelline”在描写气味时偶尔会出现，但并不是常见的日常词。"]}
{"word":"moschi","summary":{"en":"“moschi” is not a standard English vocabulary word; it likely refers to a name or a misspelling (e.g., “Moschino”).","zh":"“moschi”不是标准英语词汇；更可能是名字或拼写错误（例如“Moschino”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name, a misspelling, or a word from another language.","zh":"不是标准英语词；更可能是专有名词、拼写错误，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “moschi” in standard English dictionaries—did you mean “Moschino” (the fashion brand)?","zh":"我在标准英语词典里找不到“moschi”——你是不是想写“Moschino”（时尚品牌）？"},{"en":"Could you share a sentence with “moschi” so I can explain it accurately?","zh":"你能给一个包含“moschi”的句子吗？这样我就能更准确地解释。"}]}],"phonetic":"/ˈmɔːski/","extraExplanation":["“moschi”在英语中不常见，因此我无法给出可靠的固定释义。它可能对应以下情况之一：\n1) **Moschino**（意大利时装品牌名，常见拼写）；\n2) **Moshi**（常见作人名/品牌名，也可能是拟声或昵称）；\n3) 某种语言（如意大利语/德语/方言）里的词或姓氏。\n\n如果你告诉我：a) 它出现的语境/句子；b) 你想表达的意思（人名？品牌？食物？地名？），我就能按正确的词条为你讲解（发音、含义、用法和例句）。"]}
{"word":"moschidae","summary":{"en":"Moschidae is the biological family of musk deer.","zh":"Moschidae 指“麝科”，即麝（麝香鹿）所属的动物分类“科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small, deer-like mammals known as musk deer, found mainly in Asia; males produce musk from a gland used for scent marking.","zh":"麝科：一类体型较小、外形似鹿的哺乳动物（麝）的科，主要分布于亚洲；雄性具有分泌麝香的腺体，用于气味标记。"},"examples":[{"en":"Moschidae includes several species of musk deer native to the mountains of Asia.","zh":"麝科包含多种原产于亚洲山区的麝。"},{"en":"Unlike true deer, many Moschidae species do not have antlers.","zh":"与真正的鹿科动物不同，许多麝科动物没有鹿角。"}]}],"synonyms":["musk deer (family)"],"phonetic":"/mɑˈskaɪdi/","extraExplanation":["“Moschidae”是动物分类学中的“科”（family）名称，常见于生物学、生态学或自然纪录片语境中。","词根与“musk（麝香）”相关；历史上麝香因香水与传统药材用途而受到重视，但现代多强调保护与减少对野生麝的非法猎捕。"]}
{"word":"moschiferous","summary":{"en":"Moschiferous means “producing musk” or “having a musky smell,” and is a rare, formal adjective.","zh":"moschiferous 意为“产麝香的”或“带麝香气味的”，是较少见、偏正式的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing musk (a strong-smelling substance), especially referring to the musk deer or glands that secrete musk.","zh":"产生麝香的；（尤指）与麝香鹿或分泌麝香的腺体有关的。"},"examples":[{"en":"The male musk deer has a moschiferous gland used to produce musk.","zh":"雄性麝香鹿有产生麝香的麝香腺。"},{"en":"In older zoology texts, moschiferous animals were described as valuable for perfume making.","zh":"在较早的动物学著作中，产麝香的动物被描述为对香水制作很有价值。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the smell of musk; musky-scented.","zh":"带有麝香气味的；麝香味的。"},"examples":[{"en":"The room had a faint, moschiferous odor from the antique perfume bottle.","zh":"那间房间里有一丝麝香味，来自那只古老的香水瓶。"},{"en":"Some writers use “moschiferous” to describe a heavy, musky atmosphere.","zh":"有些作者用“moschiferous”来形容一种浓重的麝香气息。"}]}],"synonyms":["musky","musk-scented","musk-producing","muskish"],"phonetic":"/mɑːsˈkɪfərəs/","extraExplanation":["“moschiferous”较少见，偏文学或学术用词；日常英语更常说“musky”或“musk-scented”。","词源上与“musk（麝香）”相关，常见于描写香味、香料、动物学或旧式博物学写作。","在文化与动物保护语境中，麝香传统上来自麝香鹿的腺体；现代香水多用合成麝香，以减少对野生动物的伤害。"]}
{"word":"moschinae","summary":{"en":"Moschinae is a taxonomic name for the musk deer group, used mainly in some older or specific classifications.","zh":"Moschinae 是用于麝类（麝属）的一种分类学名称，多见于较旧或特定的分类体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, taxonomy) A subfamily name used in some classifications for the musk deer group (genus *Moschus*), often treated today as its own family (Moschidae).","zh":"（生物分类学）在一些旧的或特定分类体系中，用来指“麝鹿类”（*Moschus* 属，常见名：麝）的一个亚科名；现代很多体系更常把它们单独列为麝科（Moschidae）。"},"examples":[{"en":"In older zoology books, musk deer were sometimes placed under the subfamily Moschinae.","zh":"在较早的动物学书籍中，麝类有时被归入麝亚科（Moschinae）。"},{"en":"Some sources now treat Moschinae as part of Moschidae rather than within the deer family.","zh":"一些资料现在把 Moschinae 视为麝科（Moschidae）的一部分，而不是放在鹿科之内。"}]}],"synonyms":["musk deer (common name)"],"phonetic":"/mɑˈskaɪni/","extraExplanation":["“Moschinae”是拉丁化的分类阶元名称，来自 *Moschus*（麝属）。在现代分类中，麝（musk deer）常被认为与真正的鹿（deer）有明显差异，因此更常见的写法与用法是把它们放到“Moschidae（麝科）”，而不是继续使用“Moschinae（麝亚科）”。","这个词多出现在学术论文、博物馆标本标签或旧版分类系统中；日常英语里更常说 *musk deer*（麝/麝鹿）。"]}
{"word":"moschine","summary":{"en":"Likely intended word: machine — a powered device that does work; also an efficient organization; as a verb, to produce by machines.","zh":"你可能想写的是：machine——用动力运作来完成工作的机器；也可指运作高效的组织体系；作动词表示用机器制造/加工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or system with moving parts that uses power to do work","zh":"机器；机械装置（用动力运转来完成工作）"},"examples":[{"en":"The washing machine is running.","zh":"洗衣机正在运转。"},{"en":"This machine can cut wood very quickly.","zh":"这台机器切木头很快。"}]},{"partOfSpeech":"n.","definition":{"en":"a group or organization that works in a well-controlled, efficient way (often used about politics or business)","zh":"（组织的）体系；机器般运作的机构（常指政治/商业组织）"},"examples":[{"en":"He rose quickly inside the party machine.","zh":"他在政党体系里升得很快。"},{"en":"The company’s marketing machine never stops.","zh":"公司的营销体系从不停歇。"}]},{"partOfSpeech":"v.","definition":{"en":"to make or produce something using machines, especially in a factory","zh":"用机器制造；机械加工（尤指工厂生产）"},"examples":[{"en":"The parts are machined to very tight standards.","zh":"这些零件按很严格的标准进行机械加工。"}]}],"synonyms":["device","apparatus","engine","equipment","mechanism","system"],"phonetic":"/məˈʃiːn/","extraExplanation":["“moschine”不是常见英语拼写；你可能想写的是 **machine**（机器）。英语里 /ʃ/ 的发音常用拼写 **sh**（如: ship, shake），所以 **machine** 中间写 **ch** 但发音仍是 /ʃ/，属于历史拼写习惯。","词源上，machine 来自法语 *machine*，再追溯到拉丁语和希腊语，含义与“装置、工具、巧妙的构造”有关。"]}
{"word":"Moschino","summary":{"en":"Moschino is an Italian luxury fashion brand; it can also describe items made by the brand.","zh":"Moschino（莫斯奇诺）是意大利奢侈时尚品牌；也可用来形容该品牌出品的单品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian luxury fashion brand (a fashion house) known for playful, bold designs; often used to refer to the company or its products","zh":"莫斯奇诺（意大利奢侈时尚品牌/时装屋），以俏皮、夸张的设计闻名；常用来指品牌本身或其产品"},"examples":[{"en":"She bought a Moschino bag for her birthday.","zh":"她生日时买了一个莫斯奇诺的包。"},{"en":"Moschino is famous for colorful, humorous fashion shows.","zh":"莫斯奇诺以色彩鲜明、幽默感强的时装秀而出名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(attributive) relating to the Moschino brand; made by Moschino","zh":"（作定语）莫斯奇诺品牌的；由莫斯奇诺出品的"},"examples":[{"en":"He wore a Moschino T-shirt to the party.","zh":"他穿着一件莫斯奇诺T恤去参加派对。"},{"en":"The store has a new Moschino collection this season.","zh":"这家店本季上新了莫斯奇诺系列。"}]}],"synonyms":["designer brand","fashion house","luxury brand"],"phonetic":"/mɔːˈskiːnoʊ/","extraExplanation":["“Moschino”是专有名词，通常要大写。日常口语里，人们常用它直接指“这个品牌/这件单品”，例如“a Moschino”。","品牌由意大利设计师Franco Moschino于1983年创立，风格常带讽刺、幽默与强烈的视觉符号；因此在文化语境中常与“玩趣、夸张、反传统的奢侈时尚”联系在一起。"]}
{"word":"moschus","summary":{"en":"Moschus is a Latin-based term most commonly referring to the musk deer genus, and historically it can also mean musk used in perfume or medicine.","zh":"Moschus 多指“麝属（麝鹿的一个属）”；在历史文献中也可指用于香水或医药的“麝香/麝香制剂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small Asian deer (musk deer) whose males produce musk, a strong-smelling substance used in perfume and traditional medicine","zh":"麝属；一种亚洲小型鹿类（麝鹿），雄性会分泌麝香，气味浓烈，传统上用于香水与部分传统医药"},"examples":[{"en":"In older zoology books, the musk deer was often listed under the genus Moschus.","zh":"在较早的动物学书籍里，麝鹿常被归入“麝属（Moschus）”。"},{"en":"Historically, Moschus species were hunted for musk used in perfume.","zh":"历史上，人们曾猎捕麝属（Moschus）的动物以获取用于香水的麝香。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical/medical) musk; a preparation made from, or associated with, musk deer and used for its scent or supposed medicinal effects","zh":"（历史/医药用语）麝香；指由麝鹿麝香制成或与之相关的制剂，用于香味或被认为有药用效果"},"examples":[{"en":"Some 18th-century texts mention moschus as a stimulant with a strong odor.","zh":"一些18世纪文献把 moschus 记作一种带强烈气味的“兴奋剂”。"},{"en":"The recipe called for a small amount of moschus to scent the mixture.","zh":"配方要求加入少量 moschus 来给混合物增香。"}]}],"synonyms":["musk deer","musk"],"phonetic":"/ˈmɑskəs/","extraExplanation":["“Moschus”来自拉丁语与希腊语词源，和“musk（麝香）”同源，因此在不同语境中既可能指“麝属（动物分类）”，也可能在旧式药典或香料文本中指“麝香/麝香制剂”。","现代英语里更常用的是“musk deer（麝鹿）”“musk（麝香）”；“Moschus”更多见于学名、博物学、或历史文献中。"]}
{"word":"moscovium","summary":{"en":"Moscovium (Mc) is a man-made superheavy chemical element, atomic number 115.","zh":"Moscovium（Mc）是人工合成的超重化学元素，原子序数为115。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A synthetic (man-made) chemical element with the symbol Mc and atomic number 115.","zh":"一种人工合成的化学元素，元素符号为 Mc，原子序数为 115。"},"examples":[{"en":"Moscovium is a superheavy element that exists only for a very short time in laboratories.","zh":"Moscovium 是一种超重元素，只能在实验室里以极短的时间存在。"},{"en":"In the periodic table, moscovium is written as Mc.","zh":"在元素周期表中，莫斯科元素写作 Mc。"}]}],"synonyms":["element 115","Mc"],"phonetic":"/mɑˈskoʊviəm/","extraExplanation":["“Moscovium（莫斯科元素）”这个名字来自俄罗斯的莫斯科州（Moscow Oblast），用来致敬当地的核研究机构与相关科学团队。","它属于“超重元素”，通常通过粒子加速器让原子核发生反应来合成；由于极不稳定，会很快衰变，因此日常生活中几乎不会接触到。"]}
{"word":"Moscow","summary":{"en":"Moscow is Russia’s capital city; it can also refer to the Russian government in political contexts.","zh":"Moscow 指俄罗斯首都“莫斯科”；在政治语境中也可借代俄罗斯政府/领导层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Russia, located in the western part of the country.","zh":"莫斯科：俄罗斯的首都，位于该国西部。"},"examples":[{"en":"Moscow is the capital of Russia.","zh":"莫斯科是俄罗斯的首都。"},{"en":"We flew to Moscow for a business meeting.","zh":"我们飞到莫斯科参加商务会议。"},{"en":"It can be very cold in Moscow in winter.","zh":"莫斯科冬天可能非常冷。"}]},{"partOfSpeech":"n.","definition":{"en":"Used in news and politics to mean the Russian government or leadership (a metonym).","zh":"（新闻与政治语境）用“莫斯科”代指俄罗斯政府或领导层（借代）。"},"examples":[{"en":"Moscow said it would continue the talks.","zh":"莫斯科表示将继续会谈。"},{"en":"The decision was widely seen as a signal from Moscow.","zh":"这一决定被广泛视为来自莫斯科的信号。"}]}],"synonyms":["the Russian capital","the Kremlin (political context)","Moskva"],"phonetic":"/ˈmɑskoʊ/","extraExplanation":["“Moscow”在俄语中常写作“Москва”（音近 *Moskva*）。英语里常用“the Kremlin（克里姆林宫）”与“Moscow”类似，来借代俄罗斯的国家权力中心。","文化提示：在英语新闻标题中用地名指代政府很常见，如“Washington（美国政府）”“Beijing（中国政府）”“London（英国政府）”。"]}
{"word":"moscow","summary":{"en":"Moscow: the capital city of Russia; also sometimes used to mean the Russian government.","zh":"Moscow：俄罗斯首都；也可引申指“俄罗斯政府/克里姆林宫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Russia, located in western Russia; a major political, cultural, and economic center.","zh":"莫斯科：俄罗斯的首都，位于俄罗斯西部；重要的政治、文化和经济中心。"},"examples":[{"en":"Moscow is the capital of Russia.","zh":"莫斯科是俄罗斯的首都。"},{"en":"She studied Russian history in Moscow.","zh":"她在莫斯科学习俄罗斯历史。"}]}],"synonyms":["the Russian capital","the Kremlin (metonym, in some contexts)"],"phonetic":"/ˈmɑs.koʊ/","extraExplanation":["“Moscow”常被用来指代“俄罗斯政府/克里姆林宫”的立场（类似用“Washington”指代美国政府）。例如：“Moscow denied the allegations.”","文化常识：莫斯科的著名地标包括克里姆林宫（the Kremlin）与红场（Red Square）。","发音提示：重音在第一音节 MOS-，第二音节 -cow 读作 /kaʊ/（像英语里的“cow”）。"]}
{"word":"mose","summary":{"en":"“Mose” is an uncommon informal spelling of “mosey,” meaning to move around slowly and casually; it also appears in “mose on” (“move along/leave”).","zh":"“mose”多为“mosey”的少见口语拼写，表示悠闲慢走；也可见于“mose on”（继续走/离开）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to walk or move in a slow, relaxed way (a less common spelling of “mosey,” informal).","zh":"慢悠悠地走；悠闲地移动（常见拼写为 mosey，非正式用法）。"},"examples":[{"en":"We just mosed around the shops for an hour.","zh":"我们就在商店附近慢悠悠地逛了一个小时。"},{"en":"After dinner, he mosed back to his room.","zh":"晚饭后，他慢慢悠悠地回到房间。"}]},{"partOfSpeech":"phrase","definition":{"en":"a rare informal variant used in the phrase “mose on,” meaning to leave or move along.","zh":"少见的口语变体，常见于短语 “mose on”，表示“走开 / 继续往前走”。"},"examples":[{"en":"Nothing to see here—mose on.","zh":"没什么好看的——继续往前走吧。"}]}],"synonyms":["mosey","stroll","amble","wander","saunter"],"phonetic":"/moʊz/","extraExplanation":["“mose”在现代英语里并不常见，更常见的是拼写“mosey”。在口语或带有美式西部/乡村风格的表达中可能看到“mose on”。如果你是从字幕、歌词或聊天里看到的，“mose”也可能只是“mosey”的简写或拼写变体。"]}
{"word":"mosel","summary":{"en":"Mosel: the Moselle River and the German Mosel Valley wine region.","zh":"Mosel：摩泽尔河（莫泽尔河）及德国摩泽尔河谷葡萄酒产区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in Western Europe (German: Mosel; French/English: Moselle) that flows through France, Luxembourg, and Germany and joins the Rhine at Koblenz; also used to refer to the surrounding valley/wine region in Germany.","zh":"摩泽尔河（德语：Mosel；法语/英语常见：Moselle），流经法国、卢森堡和德国，在科布伦茨汇入莱茵河；也常指德国的摩泽尔河谷/葡萄酒产区。"},"examples":[{"en":"We took a boat trip on the Mosel near Cochem.","zh":"我们在科赫姆附近乘船游览了摩泽尔河。"},{"en":"Mosel Riesling is known for its light body and bright acidity.","zh":"摩泽尔产区的雷司令以酒体轻盈、酸度明亮而闻名。"},{"en":"Koblenz is where the Mosel meets the Rhine.","zh":"科布伦茨是摩泽尔河与莱茵河交汇的地方。"}]}],"synonyms":["Moselle"],"phonetic":"/ˈmoʊzəl/","extraExplanation":["“Mosel”是德语拼写；在英语里更常见的名称是“Moselle”（多用于指这条河本身）。在葡萄酒语境中，英语也常直接用“Mosel”来指德国的摩泽尔产区。","摩泽尔河谷以陡峭的葡萄园和板岩土壤著称，经典葡萄品种是Riesling（雷司令）；你可能会在酒标上看到“Mosel”或旧称“Mosel-Saar-Ruwer”。"]}
{"word":"moselle","summary":{"en":"Moselle usually refers to a European river and, by extension, the famous wine region/wines along it.","zh":"Moselle通常指欧洲的摩泽尔河，也可指沿河著名的葡萄酒产区及其葡萄酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in northeastern France and western Germany that flows into the Rhine at Koblenz; it also passes through Luxembourg.","zh":"摩泽尔河：一条流经法国东北部、卢森堡并进入德国西部的河流，最后在科布伦茨汇入莱茵河。"},"examples":[{"en":"The Moselle winds through steep valleys and vineyard-covered hills.","zh":"摩泽尔河蜿蜒穿过陡峭的山谷和种满葡萄园的山坡。"},{"en":"They took a boat trip on the Moselle before heading to the Rhine.","zh":"他们先在摩泽尔河上乘船游览，然后前往莱茵河。"}]},{"partOfSpeech":"n.","definition":{"en":"the wine-growing region along the Moselle River (especially in Germany), or wine made there—often light, aromatic white wine such as Riesling.","zh":"摩泽尔葡萄酒产区（尤其指德国摩泽尔河流域），或该地出产的葡萄酒——常见为清爽、香气明显的白葡萄酒，如雷司令。"},"examples":[{"en":"This crisp Moselle Riesling pairs well with spicy food.","zh":"这款清爽的摩泽尔雷司令很适合搭配辣味食物。"},{"en":"She prefers Moselle wines because they are usually lower in alcohol.","zh":"她更喜欢摩泽尔葡萄酒，因为它们通常酒精度较低。"}]}],"synonyms":["Mosel"],"phonetic":"/moʊˈzɛl/","extraExplanation":["“Moselle”在英语里常指法国拼写的河名；在德国语境中，你也会看到“Mosel”（同一条河的德语拼写），酒标上尤其常见。","摩泽尔产区以陡坡葡萄园和雷司令（Riesling）闻名，常带有清爽酸度与花果香；一些酒也会呈现轻微甜感（如标注“Spätlese”等等级）。"]}
{"word":"Moses","summary":{"en":"Moses is a central biblical prophet and leader; it is also used as a male first name.","zh":"Moses 指《圣经》中的重要先知与领袖“摩西”，也可作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major prophet in the Hebrew Bible/Old Testament who led the Israelites out of slavery in Egypt and is traditionally said to have received the Ten Commandments.","zh":"（《希伯来圣经/旧约》中的）摩西：重要的先知人物，带领以色列人出埃及，并传统上被认为领受了十诫。"},"examples":[{"en":"In the Bible, Moses leads the Israelites out of Egypt.","zh":"在《圣经》中，摩西带领以色列人离开埃及。"},{"en":"Many people know the story of Moses and the Ten Commandments.","zh":"许多人都知道摩西和十诫的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name.","zh":"男子名：摩西（常见英文名）。"},"examples":[{"en":"Moses is a popular name in some communities.","zh":"在一些社群中，“Moses”是个很常见的名字。"},{"en":"My classmate Moses moved here last year.","zh":"我的同学摩西去年搬到这里。"}]}],"synonyms":["prophet","lawgiver"],"phonetic":"/ˈmoʊzəz/","extraExplanation":["“Moses”在英语里通常读作 /ˈmoʊzəz/，是专有名词，书写时首字母要大写。","摩西的故事主要出现在《出埃及记》（Exodus）。他在犹太教、基督教和伊斯兰教传统中都很重要。","常见文化用法：the Mosaic law（摩西律法，指传统上与摩西相关的律法）。","相关词：Exodus（出埃及）、prophet（先知）、Ten Commandments（十诫）。"]}
{"word":"moses","summary":{"en":"Moses is best known as the biblical leader who led the Israelites out of Egypt; it is also used as a male first name.","zh":"Moses 最常指《圣经》中的领袖摩西（带领以色列人出埃及）；也可作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major prophet and leader in the Bible (and the Torah), traditionally credited with leading the Israelites out of slavery in Egypt and receiving the Ten Commandments.","zh":"《圣经》（以及《妥拉》）中的重要先知与领袖，传统上被认为带领以色列人出埃及，并领受“十诫”。"},"examples":[{"en":"In the Bible, Moses leads the Israelites out of Egypt.","zh":"在《圣经》中，摩西带领以色列人出埃及。"},{"en":"The story of Moses appears in the Book of Exodus.","zh":"摩西的故事出现在《出埃及记》中。"},{"en":"Many people know Moses for the Ten Commandments.","zh":"许多人因“十诫”而认识摩西。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name (first name), used in English and other languages.","zh":"男性名字（名），在英语及其他语言中使用。"},"examples":[{"en":"My grandfather’s name is Moses.","zh":"我祖父的名字叫 Moses（摩西）。"},{"en":"Moses is a traditional name in some religious families.","zh":"在一些宗教家庭中，Moses 是一个传统名字。"}]}],"synonyms":["(as a name) Moshe"],"phonetic":"/ˈmoʊzəz/","extraExplanation":["“Moses”在英语里通常指圣经人物“摩西”。他在犹太教、基督教和伊斯兰教传统中都很重要；与他相关的核心叙事包括“出埃及”“过红海”“西奈山领受律法（十诫）”等。","在文化作品中常见表达如《The Ten Commandments》（《十诫》）和《The Prince of Egypt》（《埃及王子》），帮助英语学习者建立背景知识。"]}
{"word":"mosesite","summary":{"en":"“Mosesite” is a rare, older word meaning a follower of Moses or Mosaic law.","zh":"“Mosesite”是较少见、偏旧的词，指摩西的追随者或遵从摩西律法的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A follower of Moses; someone who practices or follows the religious law traditionally associated with Moses (the Mosaic law).","zh":"摩西的追随者；遵从传统上归于摩西的宗教律法（摩西律法）的人。"},"examples":[{"en":"In some older religious writing, the author calls the Israelites “Mosesites.”","zh":"在一些较早的宗教著作中，作者把以色列人称为“mosesites”。"},{"en":"The term is rare today; modern texts usually say “Israelites” or “followers of Mosaic law.”","zh":"这个词在今天很少见；现代文本通常说“Israelites（以色列人）”或“followers of Mosaic law（遵从摩西律法的人）”。"}]}],"synonyms":["Israelite","follower of Moses","follower of Mosaic law"],"phonetic":"/ˈmoʊzsaɪt/","extraExplanation":["词尾 -ite 在英语里常表示“……的追随者/成员”（如 Jacobite、Luddite）。因此 Mosesite 字面意思就是“摩西的追随者”。","该词属于较为古旧、学术或宗教语境中的用法。日常英语更常用 Israelites（以色列人）或 Jewish people（犹太人）。使用时要注意语境与尊重当事人自称。"]}
{"word":"mosetena","summary":{"en":"Mosetena refers to an Indigenous people of Bolivia and their language; it can also mean “related to the Mosetena people or language.”","zh":"Mosetena 指玻利维亚的莫塞特纳/莫塞滕族及其语言，也可作形容词表示“与莫塞特纳族或其语言相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people of Bolivia, traditionally living in the upper Beni River region; also spelled Mosetén/Mosetene","zh":"（玻利维亚）莫塞特纳/莫塞滕（Mosetén）族人：玻利维亚的原住民族之一，传统上居住在贝尼河上游一带；亦作 Mosetén/Mosetene"},"examples":[{"en":"The Mosetena people have long lived in the Bolivian Amazon region.","zh":"莫塞特纳族人长期生活在玻利维亚的亚马孙地区。"},{"en":"Researchers worked with Mosetena communities to document local traditions.","zh":"研究人员与莫塞特纳社区合作记录当地传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mosetena (Mosetén) language, an Indigenous language of Bolivia","zh":"莫塞特纳语/莫塞滕语：玻利维亚的一种原住民语言"},"examples":[{"en":"She is studying Mosetena as part of an Amazonian languages course.","zh":"她在“亚马孙语言”课程中学习莫塞特纳语。"},{"en":"Some schools support bilingual education that includes Mosetena.","zh":"一些学校支持包含莫塞特纳语在内的双语教育。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mosetena people or their language and culture","zh":"与莫塞特纳族或其语言、文化有关的"},"examples":[{"en":"They recorded Mosetena stories and songs.","zh":"他们录制了莫塞特纳的故事和歌曲。"},{"en":"The museum displayed Mosetena cultural artifacts.","zh":"博物馆展出了莫塞特纳的文化器物。"}]}],"synonyms":["Mosetén","Mosetene"],"phonetic":"/ˌmoʊsəˈtɛnə/","extraExplanation":["“Mosetena”常见于英语学术写作或人类学/语言学语境，但更常见的拼写是“Mosetén”（带重音）或“Mosetene”。不同拼写多与西班牙语转写习惯有关。","莫塞特纳/莫塞滕语有时会与附近族群及语言名称并列出现；在阅读资料时，建议同时留意地名（如 Beni）与族名拼写差异，以避免把族名、语言名、地点名混淆。"]}
{"word":"mosette","summary":{"en":"A mosette (often spelled mozette) is a short cape worn by some Catholic clergy in formal settings.","zh":"mosette（常写作 mozette）指天主教部分神职人员在正式场合穿的短披肩斗篷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short cape (often buttoned in front) worn by some Roman Catholic clergy as part of their formal dress","zh":"（天主教）披肩斗篷；一种较短、前面可扣的披肩式外衣，常由部分神职人员在正式场合穿着"},"examples":[{"en":"The bishop wore a purple mosette during the ceremony.","zh":"主教在仪式上穿着紫色的披肩斗篷（mosette）。"},{"en":"In some churches, the mosette is part of the traditional clerical clothing.","zh":"在一些教堂里，mosette 是传统神职服饰的一部分。"}]}],"synonyms":["mozette","clerical cape","cape"],"phonetic":"/moʊˈzɛt/","extraExplanation":["“mosette”更常见的拼写是“mozette”。它通常与天主教的礼仪服饰有关，不是日常英语中常用的词。","颜色往往带有身份或场合含义：例如某些主教常见紫色；不同教会传统与地区可能有所差异。","词源上与法语/意大利语的相关词形有关，指一种披肩式短斗篷。"]}
{"word":"mosey","summary":{"en":"“Mosey” means to walk or move in a slow, relaxed, unhurried way.","zh":"“mosey”指慢悠悠、很放松地走或移动（不赶时间地溜达）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to walk slowly and in a relaxed, unhurried way; to wander casually","zh":"慢悠悠地走；悠闲地溜达"},"examples":[{"en":"Let’s just mosey over to the café after class.","zh":"下课后我们就慢悠悠地走去咖啡馆吧。"},{"en":"He moseyed around the store, looking at everything.","zh":"他在店里悠闲地逛来逛去，什么都看看。"},{"en":"If you mosey on down to the office, they can help you.","zh":"你要是慢慢走到办公室去，他们就能帮你。"}]}],"synonyms":["stroll","wander","amble","saunter"],"phonetic":"/ˈmoʊzi/","extraExplanation":["“mosey”很口语、很美式，常带有一种轻松、随意、甚至有点“懒散”的感觉。比“walk”更强调不赶时间。","常见搭配：mosey around（闲逛）、mosey over（慢慢走过去）、mosey on down（慢慢走过去/过去一趟，语气更随和）。","语体提醒：正式写作里不太常用，更适合对话、小说叙述或轻松的文字。"]}
{"word":"moseyed","summary":{"en":"“Moseyed” means moved or walked in a relaxed, unhurried way.","zh":"“moseyed”表示“悠闲地走/晃悠”，强调不赶时间、很放松。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"walk or move in a slow, relaxed, unhurried way (past tense of “mosey”)","zh":"（mosey 的过去式）慢悠悠地走；悠闲地晃悠"},"examples":[{"en":"We moseyed down the street after dinner.","zh":"晚饭后我们沿着街慢悠悠地走。"},{"en":"He moseyed over to the window to see what was happening.","zh":"他慢悠悠地走到窗边看看发生了什么。"},{"en":"They moseyed into the café and ordered coffee.","zh":"他们晃进咖啡馆，点了咖啡。"}]}],"synonyms":["strolled","ambled","wandered","sauntered","meandered"],"phonetic":"/ˈmoʊzid/","extraExplanation":["“mosey”很常见于美式英语口语，语气随意，常带有“从容、不赶时间”的感觉；用在叙述场景时，会让画面更轻松。","词源不太确定，一般认为是19世纪美国英语里的非正式用语。写作中常用来营造悠闲、日常的氛围。"]}
{"word":"moseying","summary":{"en":"“Moseying” means moving around in a relaxed, unhurried way—slowly strolling or casually making progress.","zh":"“moseying”指以很放松、不赶时间的方式移动：慢悠悠地散步，或口语里指事情不紧不慢地推进。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(present participle of “mosey”) to walk or move in a relaxed, unhurried way; to stroll slowly.","zh":"（“mosey”的现在分词）悠闲地走；慢悠悠地溜达；不紧不慢地移动。"},"examples":[{"en":"We were just moseying around the park after lunch.","zh":"午饭后我们只是在公园里慢悠悠地溜达。"},{"en":"He came moseying into the room like he had all the time in the world.","zh":"他慢吞吞地走进房间，好像时间多得用不完。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal) to move something along slowly or without urgency.","zh":"（非正式）让某物慢慢推进；不着急地把事情往前挪。"},"examples":[{"en":"We’ll keep moseying the project along until we get feedback.","zh":"在收到反馈前，我们就先不紧不慢地把项目往前推进。"}]}],"synonyms":["strolling","wandering","sauntering","ambling","meandering"],"phonetic":"/ˈmoʊziɪŋ/","extraExplanation":["“mosey”很口语、很美式，带有轻松、随意的感觉；常见于日常对话、故事叙述中。","它比“walk”更强调“悠闲/不赶时间”，语气也更随和；有时带一点幽默感。"]}
{"word":"moseys","summary":{"en":"“Moseys” is the third-person singular form of “mosey,” meaning to move or walk slowly and casually.","zh":"“moseys”是“mosey”的第三人称单数，意思是悠闲地、慢慢地走动或移动。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"walks or moves in a slow, relaxed, unhurried way (often without a clear purpose).","zh":"（他/她/它）悠闲地走动；慢慢溜达（常带有随意、没有明确目的的感觉）。"},"examples":[{"en":"He moseys down the street after dinner.","zh":"晚饭后他沿着街慢悠悠地走。"},{"en":"She moseys over to the window to see what’s outside.","zh":"她慢慢走到窗边看看外面有什么。"},{"en":"When the meeting ends, everyone moseys back to their desks.","zh":"会议结束后，大家都悠哉地回到各自的工位。"}]}],"synonyms":["stroll","wander","amble","saunter"],"phonetic":"/ˈmoʊzi/","extraExplanation":["“mosey”是很口语、偏美式的说法，语气轻松，有点“慢吞吞但不着急”的感觉；比“walk”更强调悠闲与随意。","拼写“moseys”通常是动词第三人称单数（he/she/it moseys）。如果你想表达“我们/他们溜达”，用“mosey”（原形）或“mosey around / mosey over”。"]}
{"word":"mosgu","summary":{"en":"“mosgu” is likely a misspelling of “mosque,” meaning a Muslim place of worship.","zh":"“mosgu”很可能是“mosque”的拼写错误，意思是“清真寺/穆斯林礼拜场所”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“mosgu” is not a standard English word. It is most likely a misspelling of “mosque,” a building where Muslims go to pray and gather for religious activities.","zh":"“mosgu”不是标准英语单词。它很可能是“mosque”（清真寺）的拼写错误，指穆斯林进行礼拜并开展宗教活动的场所。"},"examples":[{"en":"I think you meant “mosque,” not “mosgu.”","zh":"我觉得你想写的是“mosque”，不是“mosgu”。"},{"en":"We visited a mosque during our trip and learned about local traditions.","zh":"旅行时我们参观了一座清真寺，了解了当地的传统。"}]},{"partOfSpeech":"n.","definition":{"en":"mosque: a Muslim place of worship (a building for prayer).","zh":"mosque：清真寺；穆斯林的礼拜场所（用于祈祷的建筑）。"},"examples":[{"en":"They go to the mosque on Fridays.","zh":"他们周五去清真寺参加礼拜。"},{"en":"Please speak quietly near the mosque.","zh":"在清真寺附近请轻声说话。"},{"en":"The mosque was beautiful, with a tall minaret.","zh":"那座清真寺很美，有一座高高的宣礼塔。"}]}],"synonyms":["Islamic center","place of worship"],"phonetic":"/mɑsk/","extraExplanation":["“mosque”来自法语 mosquée，并可追溯到阿拉伯语 masjid（意为“叩拜之处/礼拜之处”）。","在一些文化场合，进入清真寺可能需要脱鞋、穿着得体、保持安静；不同地区规定会有差异，参观前最好查看当地提示。"]}
{"word":"moshav","summary":{"en":"Moshav: an Israeli cooperative (often farming) village where families run their own farms but cooperate on shared needs.","zh":"Moshav：以色列的合作型（多为农业）村庄，家庭独立经营农场，但在公共事务上合作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of Israeli cooperative village, usually agricultural, where families own/operate their own homes and farms but may share services and sometimes marketing or purchasing.","zh":"以色列的一种合作型村庄（多为农业聚落）：家庭各自拥有并经营住宅与农场，但在公共服务、采购或农产品销售等方面常进行合作。"},"examples":[{"en":"She grew up on a moshav in northern Israel where her family raised chickens.","zh":"她在以色列北部的一个莫沙夫长大，家里养鸡为生。"},{"en":"The tour included a visit to a moshav to learn how local farmers manage water and crops.","zh":"行程包括参观莫沙夫，了解当地农民如何管理水资源与作物。"}]}],"synonyms":["cooperative settlement","agricultural village","rural cooperative"],"phonetic":"/moʊˈʃɑv/","extraExplanation":["“moshav”（מוֹשָׁב）源自希伯来语，基本含义是“定居点/居住地”。在以色列建国前后，许多莫沙夫作为农业定居点建立。","莫沙夫常与“kibbutz（基布兹）”对比：基布兹传统上更强调集体所有与共同劳动、共同分配；莫沙夫则更偏向“家庭独立经营 + 合作社式协作”（例如共同采购、统一销售、共享基础设施）。","英语里它通常直接音译使用（复数常写作 moshavim），多见于新闻、历史、旅游与中东研究语境。"]}
{"word":"moshavim","summary":{"en":"Moshavim are Israeli cooperative rural villages (plural of moshav).","zh":"Moshavim 指以色列的合作社式农村社区（moshav 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rural Israeli villages organized as cooperative agricultural communities, where families typically own or lease their own homes and farms but may share buying, marketing, or services (plural of moshav).","zh":"以色列的农村合作社式村庄（moshav 的复数）。家庭通常各自拥有/承租住房与农场，但在采购、销售或公共服务等方面合作。"},"examples":[{"en":"Many moshavim grew citrus and vegetables for export.","zh":"许多 moshavim 以种植柑橘和蔬菜出口为主。"},{"en":"She visited several moshavim to learn about community farming in Israel.","zh":"她走访了几个 moshavim，了解以色列的社区农业。"},{"en":"Some moshavim have shifted from farming to tourism and small businesses.","zh":"一些 moshavim 已从农业转向旅游业和小型商业。"}]}],"synonyms":["moshavs (less common)","Israeli cooperative villages"],"phonetic":"/moʊʃəˈvim/","extraExplanation":["“moshavim”来自希伯来语“moshav”（意为“居住地/定居点”）的复数形式。英文写作中常直接保留该外来词，用于讨论以色列的社会与农业发展。","与“kibbutzim（基布兹）”相比，moshavim 更强调“家庭经营、私人收益”，而 kibbutz 传统上更偏向“集体劳动与共享财产”（现代也有多种变化）。","英语里读到“in the moshavim”这类用法时，通常指以色列乡村地区的一类社区形态，而不是泛指普通“村庄”。"]}
{"word":"mosk","summary":{"en":"“Mosk” is usually a misspelling of “mosque” (a Muslim place of worship).","zh":"“mosk”通常是“mosque（清真寺）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a misspelling or informal shortened form of “mosque” (a Muslim place of worship). In standard English, “mosk” is not the usual spelling.","zh":"“mosque（清真寺）”的拼写错误或非正式缩写；在标准英语中一般不写作“mosk”。"},"examples":[{"en":"I think you mean “mosque,” not “mosk.”","zh":"你可能想写的是“mosque”，而不是“mosk”。"},{"en":"We visited a beautiful mosque in the city center.","zh":"我们参观了市中心一座很美的清真寺。"}]}],"synonyms":["mosque"],"phonetic":"/mɑsk/","extraExplanation":["“mosque”在美式英语里常读作 /mɑsk/，听起来和“mosk”很像，所以容易拼错。正式写作请用“mosque”。","“mosque（清真寺）”是伊斯兰教的礼拜场所。描述时用尊重、客观的表达更合适，例如：a local mosque（当地清真寺）、people praying at the mosque（在清真寺礼拜的人们）。"]}
{"word":"moskeneer","summary":{"en":"“Moskeneer” is not standard English; it usually refers to “musketeer,” a soldier armed with a musket (famously from “The Three Musketeers”).","zh":"“moskeneer”不是标准英语，通常指“musketeer（火枪手）”，即持火枪的士兵（因《三个火枪手》而广为人知）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard spelling of “musketeer,” meaning a soldier armed with a musket (an early type of gun), especially in 16th–17th century Europe; also used for one of the king’s guards in France, famously “The Three Musketeers.”","zh":"“musketeer（火枪手）”的非标准拼写：指使用火枪（早期枪械）的士兵，尤指16—17世纪欧洲的火枪兵；也常指法国国王卫队中的火枪手，因《三个火枪手》而出名。"},"examples":[{"en":"He dressed as a musketeer for the school play.","zh":"他在学校话剧里打扮成一名火枪手。"},{"en":"The novel “The Three Musketeers” made the word famous in English.","zh":"《三个火枪手》这部小说让这个词在英语中变得很有名。"}]}],"synonyms":["musketeer","soldier","guardsman"],"phonetic":"/ˌmʌskəˈtɪr/","extraExplanation":["“moskeneer”在现代英语中几乎不使用，通常被视为拼写错误或非常罕见的变体；标准写法是“musketeer”。","“musketeer”来自“musket（火枪）+ -eer（表示从事某种职业的人，如 engineer）”。"]}
{"word":"mosker","summary":{"en":"“Mosker” is not a common English word; it’s usually a misspelling of “mosque” (a Muslim place of worship) or a surname.","zh":"“Mosker”不是常见英语词；通常是把“mosque”（清真寺）拼错了，或作为姓氏使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) “mosker” is most often a misspelling of “mosque,” a Muslim place of worship.","zh":"（不是标准英语单词）“mosker”最常见是把“mosque”（清真寺）拼错了。"},"examples":[{"en":"I think you meant “mosque,” not “mosker.”","zh":"我想你要写的是“mosque”，不是“mosker”。"},{"en":"There is a mosque near the train station.","zh":"火车站附近有一座清真寺。"}]},{"partOfSpeech":"n.","definition":{"en":"(As a proper name) “Mosker” can be a family name; it doesn’t have a common dictionary meaning.","zh":"（作为专有名词）“Mosker”可以是姓氏；它没有常见的词典释义。"},"examples":[{"en":"Ms. Mosker will speak at the meeting today.","zh":"Mosker女士今天会在会议上发言。"}]}],"synonyms":["mosque (if that’s what you meant)"],"phonetic":"/ˈmɑskər/","extraExplanation":["“mosque”在英语里读作 /mɑsk/，结尾的 -que 不发 /kw/。很多学习者会按拼写误读或误拼成“mosker”。","如果你是在某个游戏、方言、或小众社群里看到“mosker”，也可能是特定圈子的用法；你可以把原句贴出来，我能帮你判断具体意思。"]}
{"word":"mosks","summary":{"en":"Mosque (plural: mosques) means a Muslim place of worship.","zh":"Mosque（复数：mosques）指“清真寺”，即穆斯林的礼拜场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building where Muslims worship; an Islamic place of prayer","zh":"清真寺；穆斯林礼拜与祈祷的场所"},"examples":[{"en":"We visited the historic mosque in the old city.","zh":"我们参观了老城区那座历史悠久的清真寺。"},{"en":"You should dress respectfully when entering a mosque.","zh":"进入清真寺时应穿着得体以示尊重。"},{"en":"Many mosques also serve as community centers.","zh":"许多清真寺也兼具社区中心的功能。"}]}],"synonyms":["masjid","Islamic center"],"phonetic":"/mɑsk/","extraExplanation":["你输入的“mosks”很可能是“mosques”（mosque 的复数）的拼写误写。单数是 mosque，复数常写作 mosques。","发音上，mosque 末尾的 -que 不发 /kwe/，通常读作 /sk/，所以整体读起来像“mɑsk”。","词源上与阿拉伯语“masjid”（礼拜场所）有关；在英语语境中，mosque 通常指穆斯林礼拜的建筑与机构。为了文化敏感性，参观时常见礼仪包括保持安静、遵守着装要求、部分区域可能需要脱鞋或分区进入（以当地规定为准）。"]}
{"word":"Moslem","summary":{"en":"“Moslem” is an older spelling of “Muslim,” meaning a follower of Islam or something related to Islam.","zh":"“Moslem”是“Muslim”的旧式拼写，表示“穆斯林（伊斯兰教信徒）”或“与伊斯兰相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Islam; a person who believes in and practices the religion of Islam.","zh":"穆斯林；伊斯兰教信徒。"},"examples":[{"en":"There is a large Muslim community in the city.","zh":"这座城市有一个很大的穆斯林社区。"},{"en":"She is a Muslim and prays five times a day.","zh":"她是穆斯林，每天礼拜五次。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Islam or to Muslims.","zh":"伊斯兰的；穆斯林的。"},"examples":[{"en":"The museum has a collection of Muslim art.","zh":"这家博物馆收藏了一批伊斯兰艺术品。"},{"en":"They visited a Muslim country during their trip.","zh":"他们旅行时去了一个穆斯林国家。"}]}],"synonyms":["Muslim","Islamic"],"phonetic":"/ˈmʊzlɪm/","extraExplanation":["“Moslem”是“Muslim”的旧式拼写（尤其在较早的英语文本里常见）。现代英语中更常用、也更尊重的写法是“Muslim”。在当代语境中使用“Moslem”有时会显得过时，甚至可能让人感觉不够敏感，因此写作与正式交流通常建议用“Muslim”。"]}
{"word":"moslem","summary":{"en":"“Moslem” is a dated spelling of “Muslim,” meaning a follower of Islam; modern English prefers “Muslim.”","zh":"“Moslem”是“Muslim（穆斯林）”的旧拼写，指伊斯兰教信徒；现代英语更常用“Muslim”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older spelling of “Muslim” (a person who follows Islam); now usually avoided in modern English","zh":"“Muslim（穆斯林）”的旧拼写（指信奉伊斯兰教的人）；现代英语中通常不再使用"},"examples":[{"en":"In older books, you may see “Moslem,” but today “Muslim” is the standard spelling.","zh":"在较老的书里你可能会看到“Moslem”，但如今标准拼写是“Muslim”。"},{"en":"The article was updated to replace “Moslem” with “Muslim.”","zh":"这篇文章已更新，把“Moslem”改为“Muslim”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Muslims or Islam; now usually written as “Muslim”","zh":"与穆斯林或伊斯兰教有关的；现在通常写作“Muslim”"},"examples":[{"en":"The museum has a section on Muslim art. (Older texts might say “Moslem art.”)","zh":"博物馆里有一个关于伊斯兰艺术的展区。（旧文本可能会写“Moslem art”。）"}]}],"synonyms":["Muslim"],"phonetic":"/ˈmʊz.lɪm/","extraExplanation":["“Moslem”主要出现在19世纪到20世纪早期的英语中，属于旧式转写（transliteration）。如今在新闻、学术与日常用语里更推荐使用“Muslim”，因为它更贴近原词发音，也更符合当代尊重与自称的用法。","如果你在经典文学或历史材料里看到“Moslem”，通常应理解为“Muslim”，但在自己写作或正式场合尽量使用“Muslim”。"]}
{"word":"moslemah","summary":{"en":"Muslimah means a Muslim woman; “moslemah” is likely a variant spelling.","zh":"Muslimah 指穆斯林女性；“moslemah”很可能是其变体拼写/音译。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim woman (used especially in Islamic contexts and in transliterated Arabic).","zh":"穆斯林女性；（尤指在伊斯兰语境或阿拉伯语音译中）穆斯林女子。"},"examples":[{"en":"She described herself as a Muslimah who prays five times a day.","zh":"她形容自己是一位每天礼拜五次的穆斯林女性。"},{"en":"The workshop created a safe space for Muslimahs to share their experiences.","zh":"这场工作坊为穆斯林女性提供了一个安全空间来分享经历。"}]}],"synonyms":["Muslim woman","Muslima"],"phonetic":"/ˈmʊz.lɪ.mə/","extraExplanation":["“moslemah”更像是“Muslimah”的另一种音译/拼写。英语里更常见的拼写是 **Muslimah**（也可见 *Muslima*）。","该词来自阿拉伯语女性形式，常用于强调“身份与文化语境”（例如宗教实践、社群议题等）。在一般英文写作中，你也可以直接说 **a Muslim woman**，更通用、读者更容易理解。","拼写差异常与不同语言的转写体系有关（例如把 /u/ 或 /i/ 转写为 o/u，或用 -ah 表示词尾元音）。"]}
{"word":"moslemic","summary":{"en":"“Moslemic” is not standard English; use “Islamic” (about Islam) or “Muslim” (about Muslims).","zh":"“moslemic”不是标准英语；通常应改用“Islamic（关于伊斯兰教）”或“Muslim（关于穆斯林）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or incorrect spelling of “Islamic” (relating to Islam) or sometimes “Muslim” (relating to Muslims). In modern English, people normally use “Islamic” or “Muslim,” not “moslemic.”","zh":"非标准或错误拼写，通常想表达“Islamic（与伊斯兰教有关的）”或有时是“Muslim（与穆斯林有关的）”。现代英语一般不用 moslemic，而用 Islamic 或 Muslim。"},"examples":[{"en":"This word is unusual in English; you probably mean “Islamic art.”","zh":"这个词在英语里很少见；你大概想说“Islamic art（伊斯兰艺术）”。"},{"en":"If you mean people, use “Muslim community,” not “moslemic community.”","zh":"如果指人群，用“Muslim community（穆斯林社群）”，不要用“moslemic community”。"}]}],"synonyms":["Islamic","Muslim"],"phonetic":"/ˈmɑzləˌmɪk/","extraExplanation":["“Moslem”是“Muslim”的较旧拼法/音译形式，现在多数写作与用法更倾向“Muslim”。“moslemic”在现代标准英语里几乎不用，容易显得不地道或引起误解。","用词小提示：描述宗教、文化或艺术传统，常用“Islamic”（Islamic law / Islamic architecture）；描述人或群体，常用“Muslim”（a Muslim student / the Muslim community）。"]}
{"word":"moslemin","summary":{"en":"“moslemin” is a nonstandard form; in modern English, use “Muslims” (plural) or “Muslim.”","zh":"“moslemin”是非标准写法；现代英语中应使用“Muslims”（复数）或“Muslim”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nonstandard spelling; plural) Muslims—people who follow Islam.","zh":"（非标准拼写；复数）穆斯林——信奉伊斯兰教的人。"},"examples":[{"en":"In modern English, people usually write “Muslims,” not “moslemin.”","zh":"在现代英语里，人们通常写“Muslims”，而不是“moslemin”。"},{"en":"The article discusses the daily lives of Muslims in the city.","zh":"这篇文章讨论了这座城市里穆斯林的日常生活。"}]},{"partOfSpeech":"other","definition":{"en":"(variant form, often seen as outdated) “Moslem,” meaning Muslim; also used as an adjective meaning ‘Islamic’ or ‘related to Islam.’","zh":"（异体形式，常被视为过时）“Moslem”，意为Muslim（穆斯林）；也可作形容词，表示“伊斯兰的/与伊斯兰有关的”。"},"examples":[{"en":"Older books may use “Moslem” where today we would write “Muslim.”","zh":"较老的书籍里可能用“Moslem”，而如今我们会写“Muslim”。"},{"en":"They visited a Muslim (Moslem) community center.","zh":"他们参观了一个穆斯林（旧拼作Moslem）的社区中心。"}]}],"synonyms":["Muslims","Muslim","Islamic"],"phonetic":"/ˈmʊzlɪm/","extraExplanation":["“moslemin”在英语中并不是常见标准拼写；你很可能想写的是“Muslims”（复数）或“Muslim”（单数/形容词）。","“Moslem”是“Muslim”的旧式拼写，如今在正式写作中通常建议使用“Muslim”，更符合现代用法与尊重当事人自称。"]}
{"word":"Moslemism","summary":{"en":"“Moslemism” is a dated word meaning Islam.","zh":"“Moslemism”是一个过时词，意思是“伊斯兰教”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated) The religion of Islam; the faith practiced by Muslims.","zh":"（过时用法）伊斯兰教；穆斯林所信奉的宗教。"},"examples":[{"en":"Older books sometimes use “Moslemism” where we would now say “Islam.”","zh":"较早的书籍里有时用“Moslemism”来指我们现在所说的“Islam（伊斯兰教）”。"},{"en":"The article compares Christianity and Moslemism, using language typical of the early 1900s.","zh":"这篇文章用早期1900年代常见的措辞来比较基督教和“Moslemism（伊斯兰教）”。"}]}],"synonyms":["Islam","the Islamic faith"],"phonetic":"/ˈmɑzləˌmɪzəm/","extraExplanation":["“Moslemism”在现代英语中非常少见，常见于旧书或旧式写法。现在更推荐使用“Islam（伊斯兰教）”来指宗教，用“Muslim（穆斯林）”指信徒。","由于它带有“把宗教当作某种主义/体系（-ism）”的旧式命名色彩，可能让人感觉不够尊重或不够准确；在正式写作、新闻或日常交流中尽量避免使用。"]}
{"word":"moslemism","summary":{"en":"“Moslemism” is a dated word meaning Islam (the religion of Muslims).","zh":"“Moslemism”是一个过时用词，意思是伊斯兰教（穆斯林的宗教）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated) Islam; the religion of Muslims. This word is now uncommon and may sound old-fashioned.","zh":"（过时）伊斯兰教；穆斯林的宗教。这个词现在不常用，听起来较为陈旧。"},"examples":[{"en":"In older books, you may see “Moslemism” used where we would now say “Islam.”","zh":"在较老的书里，你可能会看到用“Moslemism”来指我们现在说的“Islam（伊斯兰教）”。"},{"en":"Modern writers usually avoid the term and use “Islam” instead.","zh":"现代作者通常避免使用这个词，而改用“Islam”。"}]}],"synonyms":["Islam"],"phonetic":"/ˈmɑzləˌmɪzəm/","extraExplanation":["“Moslemism”是19世纪到20世纪早期英语里偶尔出现的说法，其中“Moslem”是“Muslim”的旧拼写之一，再加上“-ism”表示“某种主义/宗教”。如今更标准、更尊重且更常见的说法是“Islam（伊斯兰教）”和“Muslim（穆斯林）”。在正式写作或跨文化交流中，建议使用“Islam / Muslim”。","在阅读历史材料时遇到该词，可以把它理解为作者所处时代的用语习惯，而不是现代英语的主流表达。"]}
{"word":"moslemite","summary":{"en":"“Moslemite” is a rare, old-fashioned word meaning “Muslim” or “Islamic.” Use “Muslim” today.","zh":"“Moslemite”是很少见、较过时的词，指“穆斯林/伊斯兰的”。现代建议用“Muslim”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, rare) a Muslim; a follower of Islam.","zh":"（过时、少见）穆斯林；伊斯兰教的信徒。"},"examples":[{"en":"The old book uses the word “Moslemite,” meaning a Muslim.","zh":"那本旧书里用到“Moslemite”，意思是“穆斯林”。"},{"en":"Today, most writers say “Muslim” instead of “Moslemite.”","zh":"如今，大多数作者会用“Muslim”，而不是“Moslemite”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(dated, rare) relating to Muslims or Islam.","zh":"（过时、少见）与穆斯林或伊斯兰教有关的。"},"examples":[{"en":"You may see “Moslemite customs” in older texts.","zh":"你可能会在较旧的文本中看到“Moslemite customs（穆斯林习俗）”这种说法。"}]}],"synonyms":["Muslim","Moslem (dated)","Islamic"],"phonetic":"/ˈmʊzləˌmaɪt/","extraExplanation":["“Moslemite”是由较旧拼写“Moslem”（现在更常写作“Muslim”）加后缀“-ite”（表示“……的人/……的追随者”）构成。现代英语里它非常少用，容易显得陈旧甚至不够尊重。写作或交流时建议使用“Muslim”（穆斯林）和“Islamic”（伊斯兰的）。"]}
{"word":"moslemize","summary":{"en":"Moslemize means “to make (someone or something) Muslim/Islamic,” but it is a dated form; modern English usually prefers “Islamize” or “convert to Islam.”","zh":"moslemize 意为“使成为穆斯林/使伊斯兰化”，但属较旧用法；现代英语多用 Islamize 或 convert to Islam。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(usually transitive) To convert someone (or a group) to Islam; to make Muslim in religion or identity.","zh":"（通常作及物动词）使某人（或某群体）皈依伊斯兰教；使成为穆斯林（在宗教或身份上）。"},"examples":[{"en":"The rulers tried to moslemize the region through schools and laws.","zh":"统治者试图通过学校和法律让该地区“伊斯兰化/使其成为穆斯林”。"},{"en":"Some communities resisted efforts to moslemize their traditions.","zh":"一些社群抵制把他们的传统“伊斯兰化/穆斯林化”的做法。"}]},{"partOfSpeech":"vi.","definition":{"en":"(intransitive, rare) To become Muslim or to adopt Islamic practices.","zh":"（不及物，较少见）成为穆斯林；开始采用伊斯兰习俗。"},"examples":[{"en":"Over time, the port city gradually moslemized through trade and migration.","zh":"随着时间推移，这座港口城市因贸易与迁徙而逐渐伊斯兰化。"}]}],"synonyms":["Islamize","convert to Islam","Muslimize"],"phonetic":"/ˈmɑzləˌmaɪz/","extraExplanation":["“moslemize”是较旧的拼写与构词（Moslem + -ize），在现代英语中更常见、更中性的说法是“Islamize/Islamise”（伊斯兰化）或“convert to Islam”（皈依伊斯兰教）。","在当代语境里，“moslemize”可能带有历史殖民叙述或强制同化的暗示，容易引发负面联想；写作中建议根据意图选择更准确的表达：强调宗教转变用“convert (someone) to Islam”，强调文化/制度影响用“Islamize”。"]}
{"word":"Moslems","summary":{"en":"“Moslems” is an older spelling of “Muslims,” meaning people who follow Islam.","zh":"“Moslems”是“Muslims”的旧式拼写，指信奉伊斯兰教的人（穆斯林）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows Islam; a Muslim (older spelling).","zh":"伊斯兰教徒；穆斯林（较旧的拼写）"},"examples":[{"en":"Many Muslims fast during Ramadan.","zh":"许多穆斯林在斋月期间封斋。"},{"en":"The museum has exhibits about Muslim cultures around the world.","zh":"这家博物馆有关于世界各地穆斯林文化的展览。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Islam or Muslims (older spelling).","zh":"与伊斯兰教或穆斯林有关的（较旧的拼写）"},"examples":[{"en":"She studies Muslim art and architecture.","zh":"她研究伊斯兰艺术与建筑。"}]}],"synonyms":["Muslims","followers of Islam"],"phonetic":"/ˈmɑzləm/","extraExplanation":["“Moslem”是“Muslim”的旧式拼写。现代英语中更常见、也更尊重的写法是“Muslim”。在正式写作、新闻报道或与人交流时，建议优先使用“Muslim”。","少数语境中仍会看到“Moslem”（例如较老的书籍、地名或历史文本），但日常使用可能显得过时。"]}
{"word":"moslems","summary":{"en":"“Moslems” is an older plural spelling of “Muslims”; today “Muslims” is preferred.","zh":"“Moslems”是“Muslims（穆斯林）”的旧式复数拼写；如今更推荐用“Muslims”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “Moslem,” an older spelling of “Muslim” (a follower of Islam). In modern English, “Muslim” is the preferred and more respectful spelling.","zh":"“Moslem”的复数形式，是“Muslim（穆斯林）”的旧式拼写。现代英语中更常用、也更被认为尊重的写法是“Muslim”。"},"examples":[{"en":"The article discussed Muslims (not “Moslems”) living in the city.","zh":"这篇文章讨论了生活在这座城市里的穆斯林（用 Muslim，而不是 Moslems）。"},{"en":"Many Muslims fast during Ramadan.","zh":"许多穆斯林在斋月期间禁食。"}]}],"synonyms":["Muslims"],"phonetic":"/ˈmʊz.lɪmz/","extraExplanation":["“Moslem”/“Moslems”在较老的英文材料里常见，但现在多被视为过时写法；在新闻、学术和日常交流中通常建议使用“Muslim / Muslims”。","如果你在阅读历史文本时看到“Moslem(s)”，一般可以直接理解为“Muslim(s)（穆斯林）”。"]}
{"word":"moslings","summary":{"en":"“Moslings” is not a standard English word; it’s likely a misspelling (often of “goslings” or “Muslims”) or a proper name.","zh":"“moslings” 不是标准常用英语词；多半是拼写错误（常见为“goslings”或“Muslims”）或专有名词（如姓名/地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling or a name. In everyday English, people often mean “goslings” (baby geese) or “Muslims” (followers of Islam).","zh":"“moslings” 不是常见、标准的英语词（一般词典中不收录）；更可能是拼写错误或人名。在日常英语里，人们常想写的是 “goslings”（小鹅）或 “Muslims”（穆斯林，伊斯兰教信徒）。"},"examples":[{"en":"I can’t find “moslings” in a dictionary—did you mean “goslings” (baby geese)?","zh":"我在词典里找不到 “moslings”——你是不是想写 “goslings”（小鹅）？"},{"en":"If you meant “Muslims,” the spelling is M-U-S-L-I-M-S.","zh":"如果你想写“穆斯林”，拼写是 M-U-S-L-I-M-S（Muslims）。"}]}],"phonetic":"/ˈmɑz.lɪŋz/","extraExplanation":["“moslings” 可能来自几种情况：① 打字/拼写错误（常见混淆：goslings / Muslims）；② 姓氏或地名；③ 非标准拼法或小圈子用语。","你可以告诉我它出现的句子或上下文（比如前后两三句话），我就能更准确判断你想表达的词，并给出对应的发音、释义和例句。"]}
{"word":"mosoceca","summary":{"en":"“mosoceca” is not recognized as a standard English word; please share context or the intended spelling.","zh":"“mosoceca”不像是标准英语词；请提供上下文或你想拼写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This doesn’t appear to be a standard English word (it may be a misspelling, a name, or a word from another language). If you tell me where you saw it or what you meant to type, I can help identify the correct word and explain it.","zh":"这看起来不像是标准英语单词（可能是拼写错误、人名/地名，或来自其他语言）。如果你告诉我你在哪里看到它、或你本来想输入什么词，我就能帮你确认正确词并解释用法。"},"examples":[{"en":"I saw “mosoceca” in a message—what does it mean?","zh":"我在一条消息里看到“mosoceca”——它是什么意思？"},{"en":"Did you mean “mosquito” or “mosaic”?","zh":"你是不是想写“mosquito（蚊子）”或“mosaic（马赛克；拼贴）”？"}]}],"extraExplanation":["你可以把它出现的整句/截图发我，或告诉我来源（歌曲、游戏、社交媒体、课本等）。如果是拼写错误，我也可以根据上下文帮你猜最可能的正确拼法。"]}
{"word":"mosocecum","summary":{"en":"“mosocecum” is not a standard English word; it is most likely a misspelling of “mesocecum,” an anatomical structure related to the cecum.","zh":"“mosocecum”不是标准英语词；很可能是“mesocecum”的拼写错误，指与盲肠相关的解剖结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word) A likely misspelling of “mesocecum,” an anatomical term meaning the fold of peritoneum (a mesentery-like attachment) associated with the cecum.","zh":"（不是标准英语单词）很可能是“mesocecum”的拼写错误；“mesocecum”是解剖学术语，指与盲肠相关的腹膜皱襞（类似肠系膜的附着结构）。"},"examples":[{"en":"The report probably meant mesocecum, not “mosocecum.”","zh":"这份报告很可能想写的是 mesocecum，而不是“mosocecum”。"},{"en":"In some people, the mesocecum can affect how mobile the cecum is during surgery.","zh":"在一些人身上，mesocecum 可能会影响手术中盲肠的活动度。"}]}],"synonyms":["mesocecum"],"phonetic":"/ˌmiːzoʊˈsiːkəm/","extraExplanation":["“mosocecum”在常见英语词典和医学词汇中不常见；最接近且常用的术语是“mesocecum”。如果你是在病理报告、手术记录或解剖学资料里看到该词，建议核对原文拼写或拍照发我上下文，我可以帮你确认具体指什么。","词源上，meso- 表示“系膜/中间的附着”，cecum 指“盲肠”；因此 mesocecum 字面意思就是“盲肠的系膜样附着结构”。"]}
{"word":"Mosque","summary":{"en":"A mosque is a Muslim place of worship.","zh":"Mosque 指“清真寺”，即穆斯林的礼拜场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim place of worship","zh":"清真寺；穆斯林的礼拜场所"},"examples":[{"en":"Tourists may visit the mosque outside prayer times.","zh":"游客通常可以在非礼拜时间参观清真寺。"},{"en":"He took off his shoes before entering the mosque.","zh":"他进入清真寺前先脱了鞋。"}]}],"synonyms":["masjid","Muslim house of worship"],"phonetic":"/mɑsk/","extraExplanation":["“mosque”来自阿拉伯语 *masjid*，意思是“叩拜之处/礼拜之处”。在很多地区，进入清真寺需要遵守礼仪（如脱鞋、着装得体、保持安静），具体规定会因国家与清真寺而不同。","常见相关词：*imam*（伊玛目，带领礼拜者）、*minaret*（宣礼塔）、*prayer hall*（礼拜大殿）。有些地方会区分 *mosque* 与 *Islamic center*（伊斯兰中心，常含教育与社区活动）。"]}
{"word":"mosque","summary":{"en":"A mosque is a Muslim place of worship where people pray and gather for religious activities.","zh":"mosque 指“清真寺”，是穆斯林祈祷与进行宗教活动的礼拜场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Muslim place of worship; a building where Muslims gather for prayer and religious activities.","zh":"清真寺：穆斯林的礼拜场所；穆斯林进行祈祷和宗教活动的建筑。"},"examples":[{"en":"They took off their shoes before entering the mosque.","zh":"他们进入清真寺前先脱鞋。"},{"en":"On Fridays, many people gather at the mosque for special prayers.","zh":"在星期五，许多人会到清真寺参加特别的礼拜。"}]}],"synonyms":["masjid"],"phonetic":"/mɑsk/","extraExplanation":["“Mosque”常见于新闻与旅行语境。参观清真寺时，通常需要遵守当地礼仪：保持安静、穿着得体；有些地方要求遮盖肩膀与膝盖，女性可能需要戴头巾；进入祈祷区前常需脱鞋（各地规定可能不同）。","词源上，“mosque”来自阿拉伯语“masjid”（意为“叩拜之地/礼拜之处”），因此中文常译为“清真寺”。"]}
{"word":"mosquelet","summary":{"en":"“Mosquelet” is not standard English; it’s usually a misspelling, likely meaning “a small mosque.”","zh":"“mosquelet”不是标准英语；多为拼写错误，可能想表达“较小的清真寺”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or a rare, nonstandard formation meant to say “a small mosque.”","zh":"不是标准英语单词；多为拼写错误，或极少见的非标准造词，可能想表达“较小的清真寺”。"},"examples":[{"en":"I can’t find “mosquelet” in major English dictionaries—did you mean “mosque”?","zh":"在主流英语词典里找不到“mosquelet”——你是不是想写“mosque（清真寺）”？"},{"en":"If you mean a small mosque, you can say “a small mosque” instead of “mosquelet.”","zh":"如果你想表达“小清真寺”，更自然的说法是“a small mosque”，而不是“mosquelet”。"}]}],"synonyms":["a small mosque","a little mosque"],"phonetic":"/ˈmɑskəlɛt/","extraExplanation":["“mosque”是英语里“清真寺”的标准写法；“-let”在英语里常见作“小/较小”的后缀（如 booklet 小册子、piglet 小猪），但“mosquelet”几乎不作为固定词使用，所以建议改用更自然的表达：a small mosque / a little mosque。","如果你本来想写的是别的词，常见的近形词还有：musket（火枪）、mosquito（蚊子）。你可以告诉我你看到这个词的句子或语境，我可以帮你精准判断。"]}
{"word":"mosques","summary":{"en":"“Mosques” is the plural of “mosque,” meaning Muslim places of worship.","zh":"“mosques”是“mosque”的复数，指穆斯林的礼拜场所（清真寺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mosque; a building where Muslims gather to pray and worship.","zh":"清真寺；穆斯林聚集礼拜与宗教活动的场所。"},"examples":[{"en":"Many mosques hold Friday prayers at noon.","zh":"许多清真寺会在中午举行周五主麻礼拜。"},{"en":"Visitors should dress modestly when entering mosques.","zh":"进入清真寺参观时应穿着端庄。"},{"en":"The city has mosques, churches, and temples side by side.","zh":"这座城市里清真寺、教堂和寺庙并列而立。"}]}],"synonyms":["Islamic centers","places of worship"],"phonetic":"/mɑsks/","extraExplanation":["“mosques”是“mosque”的复数形式。单数：a mosque；复数：mosques。","在很多文化语境中，清真寺不仅是礼拜场所，也可能承担社区教育、慈善与集会等功能。参观礼仪通常包括脱鞋、保持安静、避免打扰正在礼拜的人。"]}
{"word":"mosquish","summary":{"en":"“Mosquish” isn’t a standard word; you probably mean “mosque,” a Muslim place of worship.","zh":"“mosquish”不是标准词；你可能想写“mosque”，意思是清真寺（穆斯林礼拜场所）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Mosquish” is not a standard English word; it is most likely a misspelling of “mosque,” a Muslim place of worship.","zh":"“mosquish”不是标准英语单词；它很可能是“mosque（清真寺）”的拼写错误，指穆斯林礼拜的场所。"},"examples":[{"en":"I think you meant “mosque,” not “mosquish.”","zh":"我觉得你想写的是“mosque”，不是“mosquish”。"},{"en":"We visited a mosque during our trip.","zh":"旅行时我们参观了一座清真寺。"}]},{"partOfSpeech":"n.","definition":{"en":"mosque: a building where Muslims go to pray and worship.","zh":"mosque：清真寺；穆斯林进行礼拜与宗教活动的建筑。"},"examples":[{"en":"The mosque is especially crowded on Fridays.","zh":"清真寺在周五通常特别拥挤。"},{"en":"Please be respectful and speak quietly inside the mosque.","zh":"在清真寺里请保持尊重，小声说话。"},{"en":"She covered her hair before entering the mosque.","zh":"她进入清真寺前把头发遮好。"}]}],"synonyms":["Islamic center","place of worship"],"phonetic":"/mɑsk/","extraExplanation":["“mosque”在英语中读作 /mɑsk/（美式），拼写里有“que”，但发音不读/kjuː/。常见错误是按拼写把结尾读得太复杂。","“mosque”来自法语 mosquée，进一步可追溯到阿拉伯语 masjid（意为“叩拜之处/礼拜之地”）。","文化提示：参观清真寺时，不同地区对着装与礼仪要求不同（例如是否需要遮盖头发、脱鞋、保持安静等），最好提前查看该清真寺的参观规定。"]}
{"word":"mosquital","summary":{"en":"Mosquital is a rare word meaning a mosquito-filled place (and sometimes “mosquito-filled” as an adjective).","zh":"Mosquital 是个较罕见的词，指“蚊子很多的地方”，有时也可作形容词表示“蚊子很多的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (rare) word for a place where mosquitoes are common, especially a marshy area or mosquito-breeding ground.","zh":"（罕见用法）指蚊子很多的地方，尤指潮湿沼泽地或蚊虫滋生地。"},"examples":[{"en":"We avoided the mosquital near the river at dusk.","zh":"黄昏时我们避开了河边那片蚊虫特别多的地方。"},{"en":"The campsite was basically a mosquital after the heavy rain.","zh":"大雨过后，这个营地简直成了“蚊子窝”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Mosquito-filled; full of mosquitoes (rare).","zh":"（罕见用法）蚊子很多的；满是蚊虫的。"},"examples":[{"en":"The trail gets mosquital in the summer months.","zh":"夏天这条小路会变得蚊子很多。"}]}],"synonyms":["mosquito-infested area","breeding ground","marshland","swamp"],"phonetic":"/ˌmɑːsˈkiːtəl/","extraExplanation":["“mosquital”在现代英语里非常少见，更常见的是用“mosquito-infested area / mosquito breeding ground”来表达“蚊虫滋生地”。如果你本来想拼的是“mosquito（蚊子）”，那是最常用的标准拼写。","这个词常被认为与西班牙语“mosquital”（蚊子多的地方）有关，偶尔在描写湿地、热带环境或户外露营语境中出现。"]}
{"word":"mosquito","summary":{"en":"A mosquito is a small biting insect; females drink blood and may spread disease.","zh":"mosquito 指“蚊子”；雌蚊会吸血叮咬，并可能传播疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small flying insect that bites people and animals to drink blood (only female mosquitoes bite) and can spread diseases","zh":"蚊子；一种小型会飞的昆虫，会叮咬人和动物吸血（通常只有雌蚊叮人），并可能传播疾病"},"examples":[{"en":"Mosquitoes are worst at dusk in the summer.","zh":"夏天黄昏时蚊子最厉害。"},{"en":"Use insect repellent to avoid mosquito bites.","zh":"用驱蚊剂来避免被蚊子叮。"},{"en":"Some mosquitoes can carry diseases like dengue or malaria.","zh":"有些蚊子会传播登革热或疟疾等疾病。"}]}],"synonyms":["gnat (sometimes, informal/loose use)","skeeter (informal)"],"phonetic":"/məˈskiːtoʊ/","extraExplanation":["“mosquito”来自西班牙语/葡萄牙语，意思是“小苍蝇”（由“mosca”苍蝇加上表示“小”的后缀构成）。英语里常用于日常生活与健康语境，如“mosquito bite（蚊子包/蚊子叮咬）”“mosquito net（蚊帐）”。","文化与健康提示：不同地区常见的蚊媒疾病不同；在旅行或夏季户外活动时，常见建议包括使用驱蚊剂、穿长袖、清除积水（蚊子在积水里繁殖）。"]}
{"word":"mosquito net","summary":{"en":"A protective net used over a bed or sleeping area to prevent mosquito bites.","zh":"覆盖在床或睡觉区域上的防护网，用来防止蚊子叮咬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A net (usually hung over a bed or sleeping area) that keeps mosquitoes and other insects from biting you.","zh":"蚊帐；防蚊网（通常挂在床上或睡觉区域，用来防止蚊子等昆虫叮咬）。"},"examples":[{"en":"We slept under a mosquito net to avoid bites at night.","zh":"我们晚上睡在蚊帐里，避免被叮咬。"},{"en":"Make sure the mosquito net has no holes.","zh":"要确保蚊帐没有破洞。"},{"en":"In some tropical areas, a mosquito net is essential.","zh":"在一些热带地区，蚊帐是必需品。"}]}],"synonyms":["bed net","insect net","mosquito screen"],"phonetic":"/məˈskiːtoʊ nɛt/","extraExplanation":["“Mosquito net”常见于旅行与公共卫生语境，尤其在疟疾（malaria）或登革热（dengue）风险较高的地区。很多地方也会用“insect net / bed net”泛指防虫的网。","与之相关的常见搭配：hang up/put up a mosquito net（挂蚊帐），sleep under a mosquito net（睡在蚊帐里），a net with holes（有破洞的蚊帐）。有时会看到“insecticide-treated net (ITN)”或“LLIN（长效杀虫蚊帐）”，是公共卫生项目中推广的蚊帐类型。"]}
{"word":"mosquitobill","summary":{"en":"“Mosquito bill” most commonly means an invoice for mosquito-control services; it can also mean a proposed law about mosquito control, and rarely a “tiny/trivial charge.”","zh":"“Mosquito bill”常指蚊虫防治相关的账单；也可指蚊虫治理相关的法案；少见情况下可引申为“很小的一笔费用”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bill (an invoice) related to mosquito control, prevention, or removal services (for example, spraying or pest control).","zh":"与蚊虫防治相关的账单/费用单（如消杀、喷洒或害虫防治服务的收费单）。"},"examples":[{"en":"After the summer spraying, we got a mosquito bill from the pest-control company.","zh":"夏季喷洒消杀后，我们收到了那家害虫防治公司的蚊虫防治账单。"},{"en":"The neighborhood complained about the mosquito bill being higher than last year.","zh":"社区居民抱怨今年的蚊虫防治费用比去年更高。"}]},{"partOfSpeech":"n.","definition":{"en":"a proposed law or government measure about mosquitoes and mosquito-borne disease (commonly written as “a mosquito bill”).","zh":"关于蚊虫与蚊媒疾病的法案/议案（常说“a mosquito bill”）。"},"examples":[{"en":"The senator introduced a mosquito bill to fund research on mosquito-borne diseases.","zh":"这位参议员提出了一项蚊媒疾病研究经费的法案。"},{"en":"The mosquito bill passed after a spike in dengue cases.","zh":"登革热病例激增后，这项蚊虫相关法案获得通过。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal) a very small bill or charge; something trivial in cost.","zh":"（罕见，非正式）很小的一笔账/很少的费用；花费微不足道。"},"examples":[{"en":"Don’t worry about it—it’s a mosquito bill compared with the repair costs.","zh":"别担心——跟维修费比起来，这点钱简直是小钱。"}]}],"synonyms":["pest-control bill","invoice","statement","mosquito-control legislation","public health bill"],"phonetic":"/məˈskiːtoʊ bɪl/","extraExplanation":["“mosquitobill”连写并不常见；更常见的写法是分开写“mosquito bill”，或在需要强调时写成“mosquito-bill”。","如果你指的是某个专有名词（例如人名、网名、书名/歌曲名或某个品牌/项目），请告诉我出现的上下文句子，我可以按专名再帮你确认含义。"]}
{"word":"mosquitocidal","summary":{"en":"Mosquitocidal means “able or intended to kill mosquitoes.”","zh":"mosquitocidal 指“能够或旨在杀灭蚊子的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to kill mosquitoes (often describing an insecticide, chemical, or control method).","zh":"用于杀灭蚊子的（常用来形容杀虫剂、化学品或防治方法）。"},"examples":[{"en":"The city applied a mosquitocidal spray after the heavy rains.","zh":"暴雨过后，市政府喷洒了杀蚊喷剂。"},{"en":"Some tablets are mosquitocidal only at the larval stage.","zh":"有些药片只在幼虫阶段具有杀蚊作用。"}]}],"synonyms":["mosquito-killing","insecticidal (against mosquitoes)","mosquito-control"],"phonetic":"/məˌskiːtoʊˈsaɪdəl/","extraExplanation":["“mosquitocidal”常见于公共卫生与环境科学语境，尤其是谈“蚊媒疾病”（如登革热、疟疾、寨卡）防控时。","词形结构：mosquito（蚊子）+ -cidal（“杀…的”，来自拉丁语 caedere “杀、砍”）。类似构词还有：bactericidal（杀菌的）、herbicidal（除草的）。","在实际用语中也常用更具体的词：larvicide（杀幼虫剂，针对孑孓）与 adulticide（杀成蚊剂，针对成蚊）。"]}
{"word":"mosquitocide","summary":{"en":"Mosquitocide means a chemical or agent used to kill mosquitoes (or their larvae) for mosquito control.","zh":"Mosquitocide 指用于杀死蚊子（或其幼虫）以进行蚊虫防控的药剂或手段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or agent used to kill mosquitoes (especially adult mosquitoes or their larvae) to reduce disease risk.","zh":"灭蚊剂；用于杀死蚊子（尤其是成蚊或幼虫）的药剂或手段，以降低疾病传播风险。"},"examples":[{"en":"The city applied a mosquitocide to control mosquitoes after heavy rains.","zh":"暴雨过后，市政府喷洒了灭蚊剂来控制蚊虫。"},{"en":"Health workers used a mosquitocide in stagnant water to reduce mosquito larvae.","zh":"卫生人员在积水中使用灭蚊剂，以减少蚊子幼虫。"}]}],"synonyms":["mosquito insecticide","insecticide","larvicide","adulticide"],"phonetic":"/məˈskiːtoʊsaɪd/","extraExplanation":["“mosquitocide”由“mosquito（蚊子）+ -cide（杀……的剂/杀……行为）”构成；“-cide”也常见于“insecticide（杀虫剂）”“pesticide（杀虫/杀害有害生物的药剂）”“herbicide（除草剂）”等词。","日常英语中更常说“mosquito insecticide / mosquito control chemical”或具体到“larvicide（杀幼虫剂）”“adulticide（杀成虫剂）”。在公共卫生语境里，常与登革热、疟疾、西尼罗河病毒等防控措施一起出现。"]}
{"word":"mosquitoes","summary":{"en":"“Mosquitoes” means the plural of mosquito—biting insects that often appear near water and can cause itchy bites and sometimes disease.","zh":"“Mosquitoes”是 mosquito 的复数，指蚊子；常在有水的地方出现，会叮咬致痒，有时传播疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mosquito: small flying insects that bite people and animals to drink blood (female mosquitoes do this), often causing itchy bumps and sometimes spreading disease.","zh":"mosquito 的复数：蚊子；一种小型飞虫（通常是雌蚊叮咬吸血），会引起瘙痒的包，有时还传播疾病。"},"examples":[{"en":"Mosquitoes are worst around still water, like ponds and buckets after rain.","zh":"蚊子在静水附近最严重，比如雨后池塘和桶里积水。"},{"en":"Wear long sleeves at dusk to protect yourself from mosquitoes.","zh":"黄昏时穿长袖可以防蚊子叮咬。"}]}],"synonyms":["mosquitos (less common spelling)","gnats (not the same, but sometimes used loosely for small biting insects)"],"phonetic":"/məˈskiːtoʊz/","extraExplanation":["“Mosquito”源自西班牙语，字面意思是“小苍蝇”（mosca 的小称形式），后来专指会叮咬吸血的蚊子。","日常英语里常听到固定搭配：mosquito bite（蚊子包/蚊虫叮咬）、mosquito repellent（驱蚊剂）、mosquito net（蚊帐）、mosquito-borne diseases（蚊媒疾病，如疟疾、登革热、寨卡）。"]}
{"word":"mosquitoey","summary":{"en":"Mosquitoey means “full of mosquitoes” or “causing bites like mosquitoes,” and it’s informal.","zh":"Mosquitoey 指“蚊子很多的”或“像蚊子叮咬一样让人难受的”，属于非正式用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Full of mosquitoes; having many mosquitoes.","zh":"（非正式）蚊子很多的；蚊虫成群的。"},"examples":[{"en":"The campsite was really mosquitoey after the rain.","zh":"下过雨后，营地真的蚊子特别多。"},{"en":"Bring repellent—the lakeside gets mosquitoey at dusk.","zh":"带点驱蚊液吧——傍晚湖边会变得蚊子很多。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Causing mosquito bites or irritation like mosquitoes do.","zh":"（非正式）让人像被蚊子叮一样难受的；（让人）被叮咬的。"},"examples":[{"en":"I woke up with mosquitoey bites all over my ankles.","zh":"我醒来时脚踝上全是像蚊子叮的一样的包。"},{"en":"This room feels mosquitoey—something keeps biting me.","zh":"这个房间感觉蚊子很多——好像有什么一直在咬我。"}]}],"synonyms":["mosquito-infested","buggy","insect-ridden","swarmy"],"phonetic":"/məˈskiːtoʊi/","extraExplanation":["“mosquitoey” 是口语化的形容词，来自 “mosquito + -y”。后缀 “-y” 常用来表示“充满……的 / 有……特征的”，比如 “rainy（多雨的）”“smoky（烟雾弥漫的）”。因此它更像随口描述环境的说法，在正式写作里更常用 “mosquito-infested（蚊子滋生的）” 或 “mosquito-ridden”。"]}
{"word":"mosquitofish","summary":{"en":"A small freshwater fish used to control mosquitoes by eating their larvae.","zh":"一种通过捕食蚊子幼虫来帮助控制蚊虫的淡水小鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small freshwater fish (often of the genus Gambusia) that eats mosquito larvae and is used to help control mosquitoes","zh":"食蚊鱼（常指孔雀鱼属Gambusia等小型淡水鱼），以吃蚊子幼虫为主，常被用来帮助控制蚊虫数量"},"examples":[{"en":"The city released mosquitofish into ponds to reduce mosquito larvae.","zh":"市政府把食蚊鱼放进池塘里，以减少蚊子幼虫。"},{"en":"Mosquitofish can survive in warm, shallow water where mosquitoes breed.","zh":"食蚊鱼能在温暖、浅的、蚊子易繁殖的水域中生存。"}]}],"synonyms":["mosquito fish","gambusia"],"phonetic":"/məˈskiːtoʊˌfɪʃ/","extraExplanation":["食蚊鱼常被引入到各地水体做“生物防治”，但在一些地区会变成入侵物种：它们繁殖快、适应力强，可能挤压本地鱼类或两栖动物的生存空间。实际使用时通常需要评估生态影响。","英语里也常写作 mosquito fish（分开写）。学术或科普语境里常直接用属名/学名：Gambusia / Gambusia affinis。"]}
{"word":"mosquitofishes","summary":{"en":"Mosquitofishes are small freshwater fish used to eat mosquito larvae and help control mosquitoes.","zh":"mosquitofishes 指食蚊鱼：小型淡水鱼，吃蚊子幼虫，常用于蚊虫防治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small freshwater fish (especially in the genus Gambusia) that eat mosquito larvae and are often used to help control mosquitoes.","zh":"食蚊鱼（尤其指冈比亚鱼属 Gambusia 的小型淡水鱼），以蚊子幼虫为食，常被用来帮助控制蚊虫。"},"examples":[{"en":"Mosquitofishes are often released into ponds to reduce mosquito larvae.","zh":"人们常把食蚊鱼放入池塘里，以减少蚊子幼虫。"},{"en":"The local health department recommended mosquitofishes for water features that can’t be drained regularly.","zh":"当地卫生部门建议在无法定期排水的景观水池中投放食蚊鱼。"}]}],"synonyms":["mosquitofish","Gambusia","mosquito fish"],"phonetic":"/məˈskiːtoʊ fɪʃ/","extraExplanation":["“mosquitofishes”是复数形式；单数是“mosquitofish”。在一些地区，投放食蚊鱼被当作生物防治方法，但也可能带来生态风险：它们在非原生环境里可能成为入侵物种，影响本地小鱼、两栖动物或昆虫的生存。很多地方会建议优先采用清除积水、加盖容器、使用安全的灭幼剂等方式，再谨慎考虑投放鱼类。"]}
{"word":"mosquitoish","summary":{"en":"“Mosquitoish” means somewhat like a mosquito—small, buzzing, annoying, or bite-like (informal).","zh":"“mosquitoish”指“有点像蚊子”，带有蚊子般的小、嗡嗡响、烦人或叮咬的特点（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat like a mosquito; having qualities associated with mosquitoes (small, buzzing, annoying, or bite-prone).","zh":"有点像蚊子的；带有蚊子那种特征的（如小、嗡嗡响、烦人、爱叮咬）。"},"examples":[{"en":"The bugs in the cabin were small and mosquitoish, so we used repellent.","zh":"小木屋里的虫子小小的、有点蚊子样，我们就用了驱蚊剂。"},{"en":"There was a mosquitoish whining near my ear all night.","zh":"我耳边整晚都有一种像蚊子一样的嗡嗡声。"},{"en":"His mosquitoish persistence kept interrupting the meeting.","zh":"他那种“像蚊子一样烦人”的纠缠一直打断会议。"}]}],"synonyms":["mosquito-like","like a mosquito","gnatty","bitey"],"phonetic":"/məˈskiːtoʊɪʃ/","extraExplanation":["“mosquitoish”是口语/非正式用法，由“mosquito（蚊子）+ -ish”构成。后缀“-ish”常表示“有点……、带点……的感觉/特征”（如 greenish=有点绿的，childish=孩子气的）。这个词不算常见，更常见的说法是“mosquito-like”或“like a mosquito”。"]}
{"word":"mosquitoproof","summary":{"en":"Mosquito-proof means made to stop mosquitoes from getting in or biting.","zh":"mosquito-proof 指“防蚊的”，能防止蚊子进入或叮咬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent mosquitoes from entering or biting (e.g., through screens, nets, or protective fabric).","zh":"防蚊的；能防止蚊子进入或叮咬的（如纱窗、蚊帐或防护面料）。"},"examples":[{"en":"We installed mosquito-proof screens on all the windows.","zh":"我们给所有窗户都装了防蚊纱窗。"},{"en":"A mosquito-proof tent makes camping much more comfortable in summer.","zh":"夏天用防蚊帐篷露营会舒服得多。"},{"en":"Wear mosquito-proof clothing if you’re hiking near wetlands.","zh":"如果你要在湿地附近徒步，建议穿防蚊衣物。"}]}],"synonyms":["mosquito-resistant","bug-proof","insect-proof"],"phonetic":"/məˈskiːtoʊˌpruːf/","extraExplanation":["拼写上常见两种：mosquito-proof（更常见，带连字符）和 mosquito proof（较口语/广告文案中也会见到）。作定语时通常放在名词前：a mosquito-proof net/screen/tent。","这里的 -proof 表示“能防……的”，类似的还有：waterproof（防水的）、soundproof（隔音的）、bulletproof（防弹的）。"]}
{"word":"mosquitos","summary":{"en":"“Mosquitos” means more than one mosquito (also commonly spelled “mosquitoes”).","zh":"“mosquitos”表示“蚊子”的复数（更常见拼写为“mosquitoes”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “mosquito”: a small flying insect that bites people/animals and can spread diseases.","zh":"“mosquito”的复数：一种会飞的小昆虫，会叮咬人或动物，并可能传播疾病。"},"examples":[{"en":"Mosquitos are common in warm, wet places.","zh":"蚊子在温暖潮湿的地方很常见。"},{"en":"Use repellent to protect yourself from mosquitos.","zh":"使用驱蚊剂来保护自己不被蚊子叮咬。"},{"en":"Some mosquitos can carry diseases like malaria or dengue.","zh":"有些蚊子会传播疟疾或登革热等疾病。"}]}],"synonyms":["mosquitoes"],"phonetic":"/məˈskiːtoʊz/","extraExplanation":["在标准英语里，复数更常写作“mosquitoes”；“mosquitos”也正确，但多见于美式英语或某些专业/地区用法。日常写作一般优先用“mosquitoes”。"]}
{"word":"mosquittoey","summary":{"en":"Mosquittoey (more commonly mosquitoey) means ‘full of mosquitoes’ or ‘mosquito-like/unpleasant because of mosquitoes.’","zh":"Mosquittoey（更常见拼作 mosquitoey）表示“蚊子很多的”或“因蚊子而让人不舒服的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Also spelled mosquitoey) Full of mosquitoes, or relating to mosquitoes; having the unpleasant feeling/condition of being bothered by mosquitoes.","zh":"（也拼作 mosquitoey）蚊子很多的；与蚊子有关的；（让人）被蚊子叮得很难受的。"},"examples":[{"en":"The campsite was so mosquittoey that we ate dinner inside the tent.","zh":"营地蚊子多得要命，我们只好在帐篷里吃晚饭。"},{"en":"Avoid the mosquittoey areas near the river at sunset.","zh":"日落时尽量避开河边那些蚊子特别多的地方。"},{"en":"After the rain, the whole backyard felt mosquittoey.","zh":"下过雨后，整个后院都感觉蚊子特别多。"}]}],"synonyms":["mosquito-infested","full of mosquitoes","buggy","swarmy"],"phonetic":"/məˈskiːtoʊ.i/","extraExplanation":["“mosquittoey”更常见的拼法是“mosquitoey”。这是在名词“mosquito（蚊子）”后加口语化的后缀“-y / -ey”，表示“具有……的特征/让人感觉像……的”，类似：smoky（烟大的）、muddy（泥泞的）、fishy（有鱼腥味/可疑的）。","这种词偏口语、非正式，写作或正式场合可用：mosquito-infested（蚊虫滋生的）、full of mosquitoes（满是蚊子的）。"]}
{"word":"moss","summary":{"en":"Moss is a small soft green plant that grows in damp places; it can also be a verb meaning “to become covered with moss.”","zh":"moss 指“苔藓”，是一种生长在潮湿环境中的小型绿色植物；也可作动词，表示“（使）长满苔藓”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, soft green plant that grows in damp places (like forests, rocks, or soil) and does not have flowers or true roots.","zh":"苔藓；一种小而柔软的绿色植物，常生长在潮湿环境（森林、岩石、土壤等），不开花，也没有真正的根。"},"examples":[{"en":"Moss covered the old stones near the river.","zh":"河边的旧石头上长满了苔藓。"},{"en":"The forest floor was soft with moss.","zh":"森林地面铺着苔藓，踩上去很柔软。"}]},{"partOfSpeech":"v.","definition":{"en":"To become covered with moss, or to cover something with moss (usually over time in a damp place).","zh":"（使）长满苔藓；（在潮湿环境中，随着时间）被苔藓覆盖或让某物被苔藓覆盖。"},"examples":[{"en":"The roof has mossed over after years of rain.","zh":"多年雨水之后，屋顶已经长满了苔藓。"}]}],"synonyms":["bryophyte (more technical)","mossy growth"],"phonetic":"/mɔs/","extraExplanation":["“Moss”在英语写作里常用来营造“古老、潮湿、安静、被时间覆盖”的意象，比如形容旧墙、石阶、森林地面等。","常见搭配：moss-covered（长满苔藓的）、mossy（多苔藓的；也可形容“老旧的/古老的”语气）。"]}
{"word":"mossback","summary":{"en":"Mossback is an informal word for a very old-fashioned person; historically it also referred to an animal so old that moss grows on its back (especially a turtle).","zh":"mossback 常指非常守旧的人；历史上也可指老到背上长苔藓的动物（尤指乌龟）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) An old-fashioned person who resists change; someone with outdated ideas.","zh":"（非正式）守旧的人；抗拒改变、想法过时的人。"},"examples":[{"en":"Some people call him a mossback because he refuses to use email.","zh":"有人叫他“守旧派”，因为他拒绝用电子邮件。"},{"en":"The town has a few mossbacks who don’t want any new development.","zh":"这个镇上有一些守旧的人，不希望有任何新开发。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, US) An animal with moss on its back, especially an old turtle (and sometimes an old buffalo) used as a symbol of age and slowness.","zh":"（历史用法，美国）背上长了苔藓的动物，尤指老乌龟（有时也指老野牛），常用来象征年老与行动迟缓。"},"examples":[{"en":"In old stories, a ‘mossback’ might mean a turtle so old that moss grows on its shell.","zh":"在一些旧故事里，“mossback”可能指老得壳上都长苔藓的乌龟。"},{"en":"The writer compared the slow caravan to a mossback crawling through the swamp.","zh":"作者把缓慢的队伍比作在沼泽里爬行的“老乌龟”。"}]}],"synonyms":["old-timer","traditionalist","diehard","reactionary","fuddy-duddy"],"phonetic":"/ˈmɔsˌbæk/","extraExplanation":["这个词由 moss（苔藓）+ back（背）构成，最初带有“老得背上都长苔藓”的夸张画面，后来引申为“顽固守旧、不愿改变的人”。在现代英语里多为口语或带调侃意味的用法，使用时注意语气可能显得不礼貌。"]}
{"word":"mossbacked","summary":{"en":"Mossbacked means “covered with moss,” and figuratively “very old-fashioned or outdated.”","zh":"mossbacked 指“长满苔藓的”，也可比喻“非常守旧、过时的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with moss; moss-grown.","zh":"长满苔藓的；被苔藓覆盖的。"},"examples":[{"en":"We followed a mossbacked stone wall along the old path.","zh":"我们沿着那条旧路，走在一段长满苔藓的石墙旁。"},{"en":"A mossbacked roof can look beautiful, but it may also hold moisture.","zh":"长满苔藓的屋顶看起来很美，但也可能会积聚潮气。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Very old-fashioned; out of date.","zh":"（比喻）非常守旧的；过时的。"},"examples":[{"en":"Some people think those rules are mossbacked and need updating.","zh":"有些人认为那些规定太守旧了，需要更新。"},{"en":"He has a mossbacked attitude toward technology.","zh":"他对科技的态度很守旧。"}]}],"synonyms":["moss-covered","moss-grown","old-fashioned","outdated","behind the times"],"phonetic":"/ˈmɔsˌbækt/","extraExplanation":["“mossbacked”字面意思是“背上长了苔藓”。因为苔藓常常长在长期不动、很老的石头或树木上，所以这个词在英语里也可以引申为“老掉牙、守旧”。","相关词：moss-covered（被苔藓覆盖的，偏中性描述）；mossback（名词，指“守旧的人”，也可指“长满苔藓的老树/老物件”，语气常带一点调侃）。"]}
{"word":"mossbacks","summary":{"en":"Mossbacks is the plural of mossback: usually a very conservative, old-fashioned person; sometimes a moss-covered tree/rock/log; in some U.S. regions, a large snapping turtle.","zh":"mossbacks 是 mossback 的复数：常指思想守旧、抗拒改变的人；也可指长满苔藓的树/石头/木头；在美国部分地区还可指大型咬龟（如鳄龟）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of mossback) An old-fashioned, very conservative person who resists change.","zh":"（mossback 的复数）思想守旧、非常保守、抗拒改变的人。"},"examples":[{"en":"Some mossbacks in the town still oppose any new development.","zh":"镇上有些老顽固仍然反对任何新开发。"},{"en":"He dismissed the proposal as something only mossbacks would reject.","zh":"他把这个提案斥为只有守旧派才会拒绝的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of mossback) Something (often a tree, rock, or log) that is covered with moss, suggesting it has been there a long time.","zh":"（mossback 的复数）长满苔藓的东西（常指树、岩石或木头），暗示它存在已久。"},"examples":[{"en":"The trail wound past old mossbacks along the creek.","zh":"小路沿着溪边蜿蜒而行，经过一棵棵长满苔藓的老树。"},{"en":"They sat on mossbacks and listened to the water.","zh":"他们坐在长满苔藓的石头上听流水声。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of mossback) In some U.S. regional use, a large snapping turtle (especially an alligator snapping turtle).","zh":"（mossback 的复数）在美国部分地区的说法：大鳄龟/大咬龟（尤指鳄龟）。"},"examples":[{"en":"Local fishermen warned us about mossbacks near the docks.","zh":"当地渔民提醒我们码头附近有大鳄龟。"}]}],"synonyms":["old fogeys","diehards","reactionaries","traditionalists","conservatives (informal)"],"phonetic":"/ˈmɔsˌbæk/","extraExplanation":["“mossback”字面是“背上长苔藓的”，因为苔藓常长在长期不动、很“老”的东西上，所以引申出“老古板、顽固守旧的人”的意思。在美国口语或政治评论里，这个用法带贬义，语气类似于说某人“顽固、跟不上时代”。","用于乌龟的意思来自某些大型龟背上容易长藻类或看起来像覆着苔藓的外观，因此得名；属于地域性俗称。"]}
{"word":"mossbanker","summary":{"en":"A (mainly Scottish/old-fashioned) peat cutter who stacks peat from a bog to dry for fuel.","zh":"（多为苏格兰/较旧）在泥炭沼泽割取并堆放泥炭晾干作燃料的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly British/Scottish, old-fashioned) A person who cuts peat (turf) from a bog (“moss”) and stacks or banks it to dry, often as fuel.","zh":"（主要英式/苏格兰用法，较旧）在泥炭沼泽（moss）里割取泥炭（turf/peat），并把泥炭堆成“垛/堤”晾干的人，常用于当燃料。"},"examples":[{"en":"In the old story, the mossbanker worked from dawn, cutting peat for winter fires.","zh":"在那个老故事里，割泥炭的人从黎明干到很晚，为冬天的炉火准备燃料。"},{"en":"The village relied on mossbankers to supply peat when coal was scarce.","zh":"当煤炭稀缺时，村子依靠割泥炭的人提供燃料。"}]}],"synonyms":["peat cutter","turf cutter","peat digger"],"phonetic":"/ˈmɔsˌbæŋkər/","extraExplanation":["“moss”在苏格兰和英格兰北部方言里常指“泥炭沼泽/泥炭地”（peat bog），不只是你熟悉的“苔藓”。“bank”在这里有“堆成垛、筑成堤/堆”的意思，所以 mossbanker 不是“银行家”，而是与泥炭采集相关的劳动者。","这个词多见于地方史、民俗记录或旧文学描写现代日常英语里更常用 peat cutter / turf cutter。"]}
{"word":"mossberry","summary":{"en":"Mossberry is an uncommon regional word for a wild berry found in mossy bogs, sometimes meaning cloudberry.","zh":"mossberry 是不常见的地域词，指生长在苔藓湿地的野莓；有时特指云莓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon, regional) A wild berry that grows in or near mossy, boggy ground; in some places this name is used for the cloudberry.","zh":"（不常见、地域用法）生长在长苔藓的湿地/泥炭地附近的野生浆果；在一些地区该词也用来指“云莓”。"},"examples":[{"en":"We picked mossberries in the bog behind the cabin.","zh":"我们在小木屋后面的沼泽里采了苔藓莓。"},{"en":"In some coastal communities, people call cloudberries “mossberries.”","zh":"在一些沿海社区，人们把云莓称作“苔藓莓（mossberries）”。"}]}],"synonyms":["cloudberry (in some regions)","wild berry"],"phonetic":"/ˈmɔsˌbɛri/","extraExplanation":["“mossberry”不是标准英语里非常固定的通用词，更像是口语或地方性称呼。不同地区可能指不同的野莓（常见的说法之一是指 cloudberry）。如果你是在某本书、某个地区或某个包装上看到它，告诉我上下文/地点，我可以帮你更准确地对应到具体植物。","构词很好理解：moss（苔藓）+ berry（浆果），所以即使不认识，也能猜到大概是“长在苔藓地里的莓”。"]}
{"word":"mossbunker","summary":{"en":"Mossbunker is a regional U.S. East Coast name for the Atlantic menhaden, an oily fish often used as bait and in fish-oil products.","zh":"Mossbunker 是美国东海岸对“大西洋 menhaden（一种油脂丰富的鱼）”的俗称，常作钓饵，也用于鱼油等产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of oily Atlantic fish (Atlantic menhaden), often used as bait and also important for fish oil and animal feed; commonly found along the U.S. East Coast","zh":"一种大西洋沿岸常见的油脂丰富的鱼（大西洋鲱鲹/大西洋鳀鲱，即 menhaden），常用作钓饵，也用于提取鱼油和制作饲料"},"examples":[{"en":"The anglers used mossbunker as bait for striped bass.","zh":"钓鱼的人用 mossbunker 当作条纹鲈的饵。"},{"en":"A school of mossbunker flashed near the shore.","zh":"一群 mossbunker 在近岸处闪动游过。"}]}],"synonyms":["menhaden","bunker","pogy"],"phonetic":"/ˈmɔsˌbʌŋkɚ/","extraExplanation":["“Mossbunker”是美国东海岸（尤其是大西洋沿岸）常见的地方叫法，指的就是 Atlantic menhaden。不同地区也会叫它“bunker”或“pogies”。","这种鱼在海洋生态里很关键：它们会滤食浮游生物，是许多大型鱼类和海鸟的重要食物来源；人类也常把它加工成鱼粉、鱼油等。"]}
{"word":"mossed","summary":{"en":"“Mossed” usually means “covered with moss,” and it can also be the past form of “moss” (to become or make something covered with moss).","zh":"“mossed”通常表示“长满苔藓的”，也可以是动词“moss”的过去式/过去分词（长出苔藓；使覆盖苔藓）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with moss; having moss growing on the surface.","zh":"长满苔藓的；被苔藓覆盖的。"},"examples":[{"en":"We sat on a mossed stone wall near the river.","zh":"我们坐在河边一堵长满苔藓的石墙上。"},{"en":"The mossed roof made the old cottage look even older.","zh":"长满苔藓的屋顶让那间老小屋显得更古老。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “moss”: to become covered with moss, or to cover something with moss.","zh":"“moss”的过去式/过去分词：长出苔藓；使（某物）被苔藓覆盖。"},"examples":[{"en":"Over the years, the bricks mossed in the damp shade.","zh":"多年过去，那些砖在潮湿的阴处长出了苔藓。"},{"en":"In the story, time has mossed the statues until the details fade.","zh":"在故事里，时间让雕像长满苔藓，细节渐渐模糊。"}]}],"synonyms":["moss-covered","mossy","lichened"],"phonetic":"/mɔst/","extraExplanation":["“mossed”常见于描写自然与旧物的语境，带有“潮湿、阴凉、年代久远”的画面感。文学或叙事中用它来暗示时间流逝（例如：mossed stones/steps/walls）。在日常口语里更常说“moss-covered”。"]}
{"word":"mosser","summary":{"en":"Mosser usually means a person who gathers moss/peat, or someone who adds moss for gardening or decoration; it’s relatively uncommon and can also be a surname.","zh":"Mosser 通常指采集苔藓/泥炭（草炭）的人，或在园艺/装饰中铺苔藓的人；该词不太常见，也可能是姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cuts or gathers moss or peat (turf), especially from bogland, often for fuel","zh":"（尤指在沼泽地）割取/采集苔藓或泥炭（草炭）的人，常用于燃料"},"examples":[{"en":"In some rural areas, a mosser might cut turf from the bog for winter fuel.","zh":"在一些乡村地区，mosser 可能会从沼泽地割草炭，作为冬天的燃料。"},{"en":"The old stories describe mossers working at dawn to bring home peat.","zh":"一些老故事会描写 mossers 天一亮就开工，把泥炭带回家。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is to add moss to something (for example, in gardening, floristry, or decorative work)","zh":"给物品“铺苔藓/加苔藓”的人（例如园艺、花艺或装饰工作中）"},"examples":[{"en":"The florist hired a mosser to line the baskets with fresh moss.","zh":"花店雇了一位 mosser，用新鲜苔藓把篮子内衬铺好。"},{"en":"For the photo shoot, the mosser covered the set with green moss to create a forest look.","zh":"为了拍摄，这位 mosser 用绿色苔藓铺满布景，营造森林效果。"}]}],"synonyms":["peat-cutter","turf-cutter","bog worker","moss gatherer"],"phonetic":"/ˈmɔsər/","extraExplanation":["“mosser”并不是非常常见的现代日常词，更常见于地方用法或特定行业语境。","在爱尔兰等地区与“bog（泥炭沼泽）/turf（草炭）”文化相关：过去很多家庭会割草炭作燃料，这类劳动者可能被称为 mossers。不同地区用词可能不同。","也可能作为姓氏（Mosser）。若你是在名字/地名里看到它，语义不一定与“moss（苔藓）”有关。"]}
{"word":"mossers","summary":{"en":"“Mossers” is an uncommon, informal plural noun meaning people who collect, grow, use, or remove moss.","zh":"“mossers”是不太常见的口语复数名词，指采集/培育/使用苔藓的人，或清除苔藓的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People who collect, grow, or work with moss (for gardening, terrariums, bonsai, or decoration); people who remove moss as a job (e.g., from roofs or stonework). This word is informal and not very common.","zh":"（复数）采集、培育或使用苔藓的人（用于园艺、玻璃生态瓶、盆景或装饰）；也可指以清除苔藓为工作的人（如清理屋顶或石材表面）。该词较口语且不常见。"},"examples":[{"en":"The mossers in our plant club trade different kinds of moss for terrariums.","zh":"我们植物社团里的“苔藓爱好者”会交换不同种类的苔藓来做玻璃生态瓶。"},{"en":"After the rainy season, the mossers came to clean the green moss off the roof.","zh":"雨季过后，清理苔藓的工人来把屋顶上的绿色苔藓清掉。"}]}],"synonyms":["moss collectors","moss enthusiasts","bryologists","roof cleaners"],"phonetic":"/ˈmɔsərz/","extraExplanation":["“mossers”通常可理解为“mosser”的复数，但在标准英语里并不是高频词；更常见的表达是“moss collectors（苔藓采集者）”“moss enthusiasts（苔藓爱好者）”或专业一点的“bryologists（苔藓学家，含苔类研究者）”。","注意不要和英式俚语“mosher”（在演唱会里冲撞/甩头的人）混淆：拼写和意思都不同。"]}
{"word":"mossery","summary":{"en":"“Mossery” is a rare noun meaning a moss garden or an area/collection where moss grows.","zh":"“Mossery”是不太常见的名词，指苔藓园，或指一片/一团苔藓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place or garden area where moss is grown or displayed (like a small “moss garden”).","zh":"苔藓园；种植或展示苔藓的地方（类似小型“苔藓花园”）。"},"examples":[{"en":"The botanical garden added a mossery to show native mosses and ferns.","zh":"植物园增设了一个苔藓园，用来展示本地的苔藓和蕨类植物。"},{"en":"We walked through the shaded mossery after the rain.","zh":"雨后我们走过那片阴凉的苔藓园。"}]},{"partOfSpeech":"n.","definition":{"en":"a collection or patch of moss; moss growth as a mass.","zh":"一片苔藓；（整体性的）苔藓生长。"},"examples":[{"en":"A soft mossery covered the stones by the stream.","zh":"溪边的石头上覆盖着一层柔软的苔藓。"},{"en":"In the damp corner, mossery spread quickly.","zh":"在潮湿的角落里，苔藓很快蔓延开来。"}]}],"synonyms":["moss garden","moss bed","moss patch"],"phonetic":"/ˈmɔsəri/","extraExplanation":["“mossery”比较少见，多用于园艺/景观语境，构词方式类似“fernery（蕨类园）”“rosary/rose garden（玫瑰园）”。在日本庭园、林下景观或植物园里，苔藓常被作为观赏植物，因此会出现“mossery”这种表达。"]}
{"word":"mosses","summary":{"en":"“Mosses” usually means multiple kinds or patches of moss (the small green plant), and it can also be a verb meaning “becomes covered with moss.”","zh":"“mosses”通常指多处或多种“苔藓”，也可作动词，表示“长出苔藓/被苔藓覆盖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “moss”: small, soft green plants that grow in damp, shady places (often on rocks, soil, and tree bark).","zh":"“moss（苔藓）”的复数：一种柔软的绿色小植物，常生长在潮湿、阴凉处（如岩石、土壤、树皮上）。"},"examples":[{"en":"In the forest, mosses cover the stones near the stream.","zh":"在森林里，小溪旁的石头上长满了苔藓。"},{"en":"Mosses and ferns often grow well in cool, wet environments.","zh":"苔藓和蕨类常在阴凉潮湿的环境中长得很好。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of the verb “moss”: to become covered with moss.","zh":"动词“moss”的第三人称单数：长出苔藓；被苔藓覆盖。"},"examples":[{"en":"The old roof mosses over quickly in this damp climate.","zh":"在这种潮湿的气候里，旧屋顶很快就会长满苔藓。"}]}],"synonyms":["bryophytes","moss (plural: moss)","moss growth"],"phonetic":"/ˈmɔsɪz/","extraExplanation":["“moss”在英语里既指植物“苔藓”，也常出现在描写自然景色的文学语境中，带有“潮湿、静谧、古老”的氛围感（例如：moss-covered stones / a mossy wall）。","易混点：moss（苔藓）不是 fungus（真菌/蘑菇）。苔藓是一类植物；真菌属于不同的生物类群。"]}
{"word":"mossful","summary":{"en":"Mossful means “covered with moss” or “full of moss,” a poetic or uncommon synonym of mossy.","zh":"mossful 指“覆有/长满苔藓的”，是较少见、带文学色彩的 mossy 的同义表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with moss; having a lot of moss (mossy).","zh":"长满苔藓的；覆有苔藓的（同 mossy）。"},"examples":[{"en":"They followed a mossful path into the quiet forest.","zh":"他们沿着一条长满苔藓的小路走进了寂静的森林。"},{"en":"The old stone wall looked mossful after years of rain and shade.","zh":"多年雨水和阴影之后，那面老石墙看起来覆满了苔藓。"}]}],"synonyms":["mossy","moss-covered","moss-grown"],"phonetic":"/ˈmɔsfəl/","extraExplanation":["“mossful”不是现代英语里很常见的词，更常用的是“mossy”。它多出现在文学、诗歌或较古典的描写中，用来营造潮湿、古老、幽静的氛围（例如描写古堡、森林、墓地、石墙等场景）。","构词上，“-ful”表示“充满……的”（如 beautiful, peaceful），所以 mossful 字面意思就是“充满苔藓的”。"]}
{"word":"mosshead","summary":{"en":"“Mosshead” is an uncommon word meaning a tuft/clump of moss or something with a mossy top; it can also be a surname or place name.","zh":"“mosshead”较少见，可指像“头”一样的一团苔藓或顶部长满苔藓的东西；也可能是姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clump or tuft of moss that looks like a “head,” or something whose top is covered with moss (often used descriptively, not as a common everyday word).","zh":"（不常用）像“头”一样的一团苔藓；或指顶部被苔藓覆盖的东西（多用于描写性表达）。"},"examples":[{"en":"After the rain, mossheads formed on the old stone wall.","zh":"雨后，旧石墙上长出了一团团像“苔藓头”一样的苔藓。"},{"en":"The log was mosshead with bright green patches on top.","zh":"那根木头的顶部覆着亮绿色的苔藓，像长了个“苔藓头”。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name (surname or place name) in some English-speaking regions.","zh":"（专有名词）在一些英语地区用作姓氏或地名。"},"examples":[{"en":"Mosshead appears as a family name in local records.","zh":"在当地档案里可以看到 Mosshead 作为姓氏出现。"},{"en":"They drove past a sign for Mosshead on the way north.","zh":"他们往北开车时经过了写着 Mosshead 的路牌。"}]}],"synonyms":["clump of moss","patch of moss","moss-covered"],"phonetic":"/ˈmɔsˌhɛd/","extraExplanation":["“mosshead”不是高频词，更常见的表达是“a clump/patch of moss（苔藓的一团/一片）”或“moss-covered（长满苔藓的）”。在文学或自然描写里，有时会用这种组合词来增强画面感。","若你是在特定文章、游戏、地名或人名里看到 Mosshead，它很可能是专有名词，用法与普通名词不同（通常首字母大写）。"]}
{"word":"mosshorn","summary":{"en":"“Mosshorn” is uncommon in standard English; it’s usually a proper name, or a creative compound meaning something like “moss-covered horn.”","zh":"“Mosshorn”在标准英语中不常见；通常是专有名称，或作为创意合成词表示“长满苔藓的角”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard English word; most often seen as a proper name (e.g., a surname, business name, or place name). It is not a common dictionary entry in modern English.","zh":"一个较少见、非标准的英语词；更多时候作为专有名称出现（如姓氏、商号或地名），在现代英语词典中并不常见。"},"examples":[{"en":"I couldn’t find “Mosshorn” in standard English dictionaries, so it may be a family name or a brand name.","zh":"我在常见的英语词典里找不到“Mosshorn”，所以它可能是姓氏或品牌名。"},{"en":"Mosshorn appears in a few online profiles as a last name.","zh":"“Mosshorn”在一些网络资料中以姓氏形式出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literal/creative use) Something like a horn covered with moss, or a horn-shaped object associated with moss—used more as descriptive imagery than a fixed vocabulary word.","zh":"（字面/创意用法）指“长满苔藓的角”，或与苔藓相关的角状物体——更多是描述性意象，而不是固定词汇。"},"examples":[{"en":"In the fantasy story, the statue’s mosshorn looked ancient and forgotten.","zh":"在那篇奇幻故事里，雕像上长满苔藓的角看起来古老而被遗忘。"},{"en":"The old helmet had a mosshorn shape along the ridge.","zh":"那顶旧头盔的脊线上有一种“苔角”般的形状。"}]}],"phonetic":"/ˈmɔs.hɔrn/","extraExplanation":["从构词上看，mosshorn 很可能是 moss（苔藓）+ horn（角） 的合成形式，因此在文学/游戏/品牌命名中容易被用来营造“古老、森林、自然、粗犷”的氛围。","如果你是在某本书、游戏、地名或人名里看到它，我也可以帮你根据具体语境判断它更像是“专有名词”还是“意象化的普通名词”。"]}
{"word":"mossi","summary":{"en":"“Mossi” refers to the Mossi people of Burkina Faso, or things related to their culture and language.","zh":"“Mossi”指布基纳法索的莫西人，或与其文化与语言相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mossi, the largest ethnic group in Burkina Faso (West Africa).","zh":"莫西人（西非布基纳法索最大的民族之一）"},"examples":[{"en":"Many Mossi people speak Mooré as their first language.","zh":"许多莫西人以莫雷语（Mooré）为母语。"},{"en":"The festival included Mossi music and traditional dance.","zh":"节日活动包括莫西音乐和传统舞蹈。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Mossi people, their language, or their culture.","zh":"莫西人的；与莫西语言或文化有关的"},"examples":[{"en":"She is studying Mossi history in school.","zh":"她在学校学习莫西历史。"},{"en":"We visited a museum with Mossi art and masks.","zh":"我们参观了一个展出莫西艺术与面具的博物馆。"}]}],"synonyms":["Mossi people"],"phonetic":"/ˈmɔsi/","extraExplanation":["“Mossi”通常出现在人类学、地理、历史或新闻语境中，指布基纳法索的莫西民族及其文化。莫西人常使用的语言是 Mooré（莫雷语）。","注意：在日常英语里更常见的单词是“mossy”（长满苔藓的）。如果你想查的是“mossy”，告诉我我可以按那个词再解释与举例。"]}
{"word":"mossie","summary":{"en":"“Mossie” is an informal word meaning “mosquito,” used mainly in Australia/NZ/South Africa.","zh":"“mossie”是“mosquito（蚊子）”的非正式说法，主要用于澳大利亚/新西兰/南非。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, especially in Australia, New Zealand, and South Africa) a mosquito.","zh":"（非正式用语，尤见于澳大利亚/新西兰/南非）蚊子。"},"examples":[{"en":"Don’t leave the door open—mossies will get in.","zh":"别把门开着——蚊子会飞进来。"},{"en":"I got bitten by a mossie last night.","zh":"我昨晚被蚊子咬了。"},{"en":"Bring some repellent; the mossies are bad near the lake.","zh":"带点驱蚊液吧；湖边蚊子很多。"}]}],"synonyms":["mosquito","mozzy","skeeter"],"phonetic":"/ˈmɑsi/","extraExplanation":["“mossie”是“mosquito”的口语缩略说法，带有明显的地域色彩（澳新、南非更常见）。在美式英语里更常说“mosquito”；在英式口语中也常见“mozzy”。在正式写作中建议用“mosquito”。"]}
{"word":"mossier","summary":{"en":"“Mossier” means “more mossy”—covered with more moss or having a more green, soft, damp look/feel.","zh":"“mossier”表示“更长苔藓的；更像苔藓的（更绿、更软、更潮湿）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “mossy”: having more moss, or looking/feeling more like moss (green, soft, damp).","zh":"“mossy（长满苔藓的；像苔藓的）”的比较级：更长苔藓的；或更像苔藓般（偏绿、柔软、潮湿）的。"},"examples":[{"en":"This side of the stone wall is mossier because it stays in the shade.","zh":"石墙的这一面更长苔藓，因为一直在阴影里。"},{"en":"After the rainy season, the path becomes mossier and more slippery.","zh":"雨季过后，小路更长苔藓，也更滑。"},{"en":"The north side of trees is often mossier in many forests.","zh":"在许多森林里，树的北侧往往更长苔藓。"}]}],"synonyms":["more moss-covered","greener","damper"],"phonetic":"/ˈmɔsiər/","extraExplanation":["“mossier”主要用于自然环境描写（石头、树干、地面、墙面等）。它既可以字面表示“苔藓更多”，也可以比喻性表示“更绿、更柔软或更潮湿的感觉”。","拼写提示：以 -y 结尾的形容词变比较级时，常把 y 变成 i 再加 -er：mossy → mossier（类似：happy → happier）。"]}
{"word":"mossiest","summary":{"en":"“Mossiest” means the most covered with moss, and it can also mean the most old-fashioned (figuratively).","zh":"“mossiest”表示最长满苔藓的；也可比喻最老派、最过时的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the most moss on it; very covered with moss.","zh":"（最）长满苔藓的；苔藓最多的。"},"examples":[{"en":"The mossiest stone by the stream was slippery, so we stepped carefully.","zh":"溪边那块最长满苔藓的石头很滑，所以我们走得很小心。"},{"en":"In the shady garden corner, the mossiest patch of ground stays damp all year.","zh":"在花园阴凉的角落里，那片最长满苔藓的地面一年四季都很潮湿。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More informal/figurative) Most old-fashioned or outdated; having a “moss-covered” feel.","zh":"（非正式/比喻）最老派的；最过时的；带有“长苔藓般陈旧感”的。"},"examples":[{"en":"Some of his mossiest opinions about work don’t fit modern life.","zh":"他对工作的某些最老派的看法已经不太适合现代生活了。"},{"en":"The company finally replaced its mossiest rules with simpler ones.","zh":"公司终于用更简洁的规定替换了那些最过时的规章。"}]}],"synonyms":["most moss-covered","greenest (with moss)","most old-fashioned","most outdated"],"phonetic":"/ˈmɔsiɪst/","extraExplanation":["“mossiest”是形容词“mossy”（长满苔藓的）的最高级：mossy → mossier → mossiest。常见搭配：mossiest rock/stone、mossiest log（原木）、mossiest corner（角落）。","比喻用法来自“苔藓长在很久不动、很少打理的东西上”的联想，所以可用来形容观念、制度“陈旧、积灰”。语气通常带一点调侃，但不一定很刻薄。"]}
{"word":"mossiness","summary":{"en":"Mossiness means the quality of being mossy (covered with moss or moss-like), and sometimes a musty/old-fashioned feel.","zh":"Mossiness 指“长满苔藓/具有苔藓般特质”的状态，也可引申为“潮湿发霉、陈旧老派”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being covered with moss, or having the look/feel of moss (green, soft, damp, or old-looking).","zh":"长满苔藓的状态；或具有苔藓般的外观/质感（偏绿、柔软、潮湿、显得陈旧）。"},"examples":[{"en":"The mossiness of the stones made the path slippery after the rain.","zh":"石头上长满苔藓，雨后小路变得很滑。"},{"en":"I love the mossiness of this forest—it feels cool and quiet.","zh":"我喜欢这片森林的苔藓感——让人觉得清凉又安静。"}]},{"partOfSpeech":"n.","definition":{"en":"A musty, old-fashioned, or “antiquated” feeling, often used humorously or critically (less common).","zh":"（不太常见）一种霉味/陈旧感；也可指“老派、过时”的气息（常带调侃或批评）。"},"examples":[{"en":"The hotel’s charm was mixed with a bit of mossiness in the hallway carpets.","zh":"这家酒店很有韵味，但走廊地毯也带着一点陈旧发潮的感觉。"},{"en":"He joked about the mossiness of the office rules.","zh":"他开玩笑说办公室的规章太老派了。"}]}],"synonyms":["mossy quality","moss-coveredness","mustiness (figurative)","staleness (figurative)"],"phonetic":"/ˈmɔsi.nəs/","extraExplanation":["“mossiness”来自“moss（苔藓）+ -y（有……的）+ -ness（……的状态/性质）”。因此它既可以很字面地指“长苔/像苔”，也可以引申为“带点潮湿、发霉、旧旧的感觉”。","在文学或描写性写作中，“mossiness”常用来营造环境氛围：阴凉、潮湿、安静、时间感很强（比如老石墙、森林小径、古老庭院）。","近义表达（按语境）：covered with moss（长满苔藓的）、moss-covered（苔藓覆盖的）、musty（霉味的）、old-fashioned（老派的）。"]}
{"word":"mossing","summary":{"en":"“Mossing” usually means moss growing on something or the act of making something look moss-covered.","zh":"“mossing”通常指长出苔藓，或指让某物呈现被苔藓覆盖的过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of becoming covered with moss, or of causing something to be covered with moss (present participle/gerund of “moss”)","zh":"长出苔藓；（使某物）被苔藓覆盖（“moss”的现在分词/动名词）"},"examples":[{"en":"Over the years, the stones along the path have been mossing over in the shade.","zh":"多年下来，小路旁的石头在阴处渐渐长满了苔藓。"},{"en":"The damp walls are mossing, so we should improve ventilation.","zh":"潮湿的墙面在长苔，需要加强通风。"},{"en":"In the garden, mossing can make old pots look natural and aged.","zh":"在花园里，让花盆“长苔”能显得更自然、更有岁月感。"}]},{"partOfSpeech":"n.","definition":{"en":"a process or practice of adding/encouraging moss for decoration, gardening, or craft","zh":"（装饰、园艺或手工中）铺苔/养苔的做法或过程"},"examples":[{"en":"Some people use mossing to soften the look of a rock garden.","zh":"有人会用“铺苔”来柔化假山花园的视觉效果。"},{"en":"Mossing on bonsai soil is common in traditional displays.","zh":"盆景展示中，土面“铺苔”很常见。"}]}],"synonyms":["getting mossy","becoming moss-covered","moss growth","covered in moss"],"phonetic":"/ˈmɑsɪŋ/","extraExplanation":["“mossing”在日常英语里不算高频词，更多时候人们会说“getting mossy”“covered in moss”或“moss growing on…”。在园艺/盆景语境中，moss 常被用来营造“自然、古朴、湿润”的氛围。"]}
{"word":"mossless","summary":{"en":"“Mossless” means “without moss” or “not covered with moss.”","zh":"“mossless”表示“无苔藓的/没长苔藓的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without moss; not covered with moss.","zh":"无苔藓的；没有长苔藓的。"},"examples":[{"en":"The mossless stones looked pale and dry in the sun.","zh":"那些无苔藓的石头在阳光下显得苍白而干燥。"},{"en":"We chose a mossless patch of ground to set up the tent.","zh":"我们选了一块没有长苔藓的地面来搭帐篷。"}]}],"synonyms":["without moss","free of moss","not mossy"],"phonetic":"/ˈmɔs.ləs/","extraExplanation":["“mossless”由名词 moss（苔藓）+ 后缀 -less（“没有……的”）构成，意思直观，但在日常英语中不算常见。更常见的表达有：“free of moss”“without moss”“not mossy”。","后缀 -less 常用于表示“缺少/没有”，如：homeless（无家可归的）、careless（粗心的）、tasteless（无味的/没品的，需注意语境）。"]}
{"word":"mosslike","summary":{"en":"Mosslike means “looking or feeling like moss,” often soft and green.","zh":"mosslike 指“像苔藓的”，常强调柔软、偏绿、薄薄覆盖的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling moss in appearance or texture; soft, green, and often growing in a thin, velvety layer.","zh":"像苔藓的；外观或触感类似苔藓的（柔软、偏绿、常呈薄薄的绒状覆盖）。"},"examples":[{"en":"The rock was covered with a mosslike layer that felt soft under my fingers.","zh":"岩石上覆盖着一层像苔藓一样的薄层，摸起来很柔软。"},{"en":"In the damp shade, mosslike plants spread across the ground.","zh":"在潮湿的阴影处，像苔藓一样的植物铺满了地面。"}]}],"synonyms":["mossy","velvety","greenish","spongy"],"phonetic":"/ˈmɔsˌlaɪk/","extraExplanation":["“mosslike”由“moss（苔藓）+ -like（像……的）”构成，-like 是常见后缀，表示“具有……特征”。类似结构还有：childlike（孩子般的）、lifelike（逼真的）、stone-like（石头般的）。","这个词常用于自然描写、园艺或材料外观描述（如“mosslike texture/covering”），强调“看起来/摸起来像苔藓”，不一定真的是苔藓。"]}
{"word":"mosso","summary":{"en":"Mosso is an Italian musical term meaning “more movement,” often used to ask for a quicker, more flowing, lively feel.","zh":"Mosso 是意大利语音乐术语，表示“更有推进感/更流动”，常用于提示演奏更快或更有活力的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in music, from Italian) more movement; played with a quicker, more flowing tempo than before.","zh":"（音乐术语，源自意大利语）更有“推动感”；比前面段落速度更快、更流动地演奏。"},"examples":[{"en":"After the slow introduction, the score marks *più mosso*.","zh":"在慢速引子之后，乐谱标注了 *più mosso*（更快、更有推进感）。"},{"en":"The conductor asked the strings to play it a little more *mosso*.","zh":"指挥让弦乐把这一段拉得更 *mosso* 一点（更流动、更有速度感）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in music) lively; with energetic forward motion (often describing the character of a passage, not just exact speed).","zh":"（音乐）活泼的；富有能量、向前推进的（常描述段落的气质，不仅仅是速度）。"},"examples":[{"en":"Keep the rhythm light and *mosso*, not heavy.","zh":"节奏要轻快、*mosso*，不要沉重。"},{"en":"Even at the same tempo, the music can feel more *mosso* if the phrasing pushes forward.","zh":"即使速度相同，如果乐句更有推动感，音乐也会显得更 *mosso*。"}]}],"synonyms":["più mosso","con moto","animato"],"phonetic":"ˈmoʊsoʊ","extraExplanation":["“Mosso”是意大利语“移动、推动”的意思。英语里多出现在乐谱指示语中，最常见的是 *più mosso*（更快/更有推进感）和 *meno mosso*（稍慢/推进感减弱）。","它通常不是精确的速度标记（不像 Allegro/Andante 那样常被当作速度区间），更强调“向前走”的动力与流动感：可能稍微加快，也可能主要是演奏更连贯、更有推进。"]}
{"word":"mosstrooper","summary":{"en":"A historical term for a mounted raider from the Anglo‑Scottish border marshes; by extension, a lawless plunderer.","zh":"历史词：指英苏边境湿地出没的骑马劫掠者；引申为无法无天的掠夺者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mounted raider or bandit from the marshy borderlands (especially on the Anglo‑Scottish border) in the 16th–17th centuries; also used more generally for a lawless plunderer","zh":"（尤指16–17世纪英格兰与苏格兰边境湿地的）骑马劫掠者、土匪；也可泛指无法无天的掠夺者"},"examples":[{"en":"Stories of the border wars often mention mosstroopers stealing cattle at night.","zh":"关于边境战争的故事常提到“mosstroopers”夜里偷牛。"},{"en":"The village feared a sudden visit from mosstroopers riding out of the moss.","zh":"村庄害怕“mosstroopers”从沼泽地里突然骑马来袭。"}]}],"synonyms":["border reiver","raider","marauder","brigand"],"phonetic":"/ˈmɔsˌtruːpɚ/","extraExplanation":["“Moss”在这里指英国边境地区的泥炭沼泽、湿地（不是花园里常见的“苔藓”那种小范围概念）。“Trooper”原意是骑兵/骑马的人。合起来就是“从沼泽地出没的骑马劫掠者”。","这个词带有历史与文学色彩，常出现在描写英苏边境冲突（Border Reivers）的小说、民谣或历史叙述中；现代英语里较少日常使用，多用于复古或形容“像土匪一样的人”。"]}
{"word":"mosstroopery","summary":{"en":"Mosstrooper: a historical Border-region raider/outlaw, known for cattle-stealing raids between Scotland and England.","zh":"Mosstrooper：历史上活跃于英苏边境的掠夺者/亡命之徒，以劫掠（常见为偷牛）闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a raider or outlaw (especially in the 1500s–1600s) who operated in the Border region between Scotland and England, often stealing cattle or goods","zh":"（尤指16—17世纪）在苏格兰与英格兰边境活动的掠夺者/亡命之徒，常以抢夺牛羊或财物为生"},"examples":[{"en":"Stories of mosstroopers describe night raids and stolen cattle along the Border.","zh":"关于“mosstroopers”的故事常描写他们在边境夜袭、劫走牛群。"},{"en":"The village feared attacks from mosstroopers moving through the moors.","zh":"村庄害怕那些穿越荒原的边境掠夺者来袭。"}]}],"synonyms":["border reiver","raider","outlaw","brigand"],"phonetic":"/ˈmɔsˌtruːpər/","extraExplanation":["拼写提示：更常见的形式是 **mosstrooper**（单数）/ **mosstroopers**（复数）。你输入的 *mosstroopery* 可能是误拼，或被当作“mosstrooper 的活动/行径”一类的自造名词，但在现代标准词典里不常作为独立词条出现。","词源与语境：**moss** 在苏格兰与英格兰北部方言里可指泥炭沼泽、荒原地带；**trooper** 指骑兵/武装人员。合起来强调“在沼泽荒原一带出没的武装掠夺者”。该词常见于历史叙述或历史小说（涉及英苏边境冲突、边境家族械斗与劫掠）。"]}
{"word":"mosstrooping","summary":{"en":"Mosstrooping means historical Border raiding (often cattle-stealing), associated with Scottish/English “moss-troopers.”","zh":"Mosstrooping 指历史上英苏边境地区（常见为掠夺牲畜的）武装劫掠行为，与“moss-troopers（边境沼泽骑匪/掠夺者）”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, chiefly Scottish/British) Raiding—especially cattle-stealing raids—carried out by armed groups along the Anglo‑Scottish Border; the practice of “moss-troopers.”","zh":"（历史用语，主要见于苏格兰/英国语境）指在英格兰—苏格兰边境由武装团伙进行的劫掠（尤指掠夺牛羊等牲畜）；即“沼泽骑匪/边境掠夺者（moss-troopers）”的劫掠行为。"},"examples":[{"en":"Old ballads mention nights of mosstrooping along the Border.","zh":"一些古老民谣会提到边境地区夜里的“mosstrooping”（劫掠）。"},{"en":"The village built watchtowers to survive years of mosstrooping.","zh":"这个村子为了熬过多年劫掠，建起了瞭望塔。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing people, stories, or times connected with Border raiding by moss-troopers.","zh":"形容与“moss-troopers”式边境劫掠有关的人、故事或时代。"},"examples":[{"en":"He loved mosstrooping tales of daring escapes and stolen cattle.","zh":"他喜欢那种讲逃亡与偷牛的边境劫掠故事。"},{"en":"A mosstrooping band rode out at dusk.","zh":"一伙从事边境劫掠的人在黄昏出发。"}]}],"synonyms":["border raiding","cattle raiding","reiving","moss-trooping"],"phonetic":"/ˈmɔsˌtruːpɪŋ/","extraExplanation":["“mosstrooping”也常写作“moss-trooping”。其中 moss 指边境地区的沼泽/荒原地带（mosses），troop 表示成群结队出动；合起来指从荒原出没、成队袭掠的“moss-troopers”。","该词多见于描写16–17世纪英苏边境“边境掠夺者（Border Reivers）”的历史/文学语境，现代英语里较少日常使用，更多出现在历史叙述、民谣或如司各特（Walter Scott）等作品的风格化描写中。"]}
{"word":"mosswort","summary":{"en":"Mosswort is a common name for a small moss-like plant, often referring to certain bryophytes (such as liverworts).","zh":"Mosswort是对某些“像苔藓的小型植物”的俗称，常见于指某些苔类植物（如地钱等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple plant that looks like moss (often used for certain bryophytes such as liverworts); also used as a common name for some moss-like plants.","zh":"一种看起来像苔藓的小型简单植物（常指某些苔类植物，如地钱/苔类中的“苔状植物”）；也可作某些“像苔藓的植物”的俗名。"},"examples":[{"en":"In damp forests, you may find mosswort growing on rocks and fallen logs.","zh":"在潮湿的森林里，你可能会在岩石和倒木上发现苔状植物（mosswort）。"},{"en":"The field guide grouped mosses and mossworts together because they look similar.","zh":"这本野外指南把苔藓和苔状植物（mosswort）归在一起，因为它们外形相似。"}]}],"synonyms":["liverwort","bryophyte"],"phonetic":"/ˈmɔsˌwɝt/","extraExplanation":["“-wort”是古英语/中古英语里常见的构词成分，原意与“植物、草本”相关（可理解为“某某草/某某植物”）。因此mosswort字面意思接近“像苔藓的草”。","在日常英语里，mosswort并不算常用词，更多见于植物学/自然观察语境；不同地区可能把它用于不同的苔类或近似苔藓的植物。"]}
{"word":"mossy","summary":{"en":"Mossy usually means “covered with moss,” and it can also mean “old-fashioned or outdated,” often in a light or humorous way.","zh":"mossy 通常指“长满苔藓的”，也可引申为“老掉牙/过时的”，多带轻松或幽默语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with moss, or having a green, soft layer of moss on the surface (often in damp, shady places).","zh":"长满苔藓的；覆有苔藓的（常见于潮湿、阴凉处）。"},"examples":[{"en":"The trail was slippery because the stones were mossy.","zh":"小径很滑，因为石头上长满了苔藓。"},{"en":"We sat on a mossy log near the river.","zh":"我们坐在河边一根长满苔藓的原木上。"},{"en":"In the old garden, mossy walls made everything feel quiet and cool.","zh":"在那座老花园里，长苔的墙让一切显得安静而清凉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Old-fashioned or outdated (often used humorously or lightly).","zh":"老掉牙的；过时的（常带一点玩笑或轻松语气）。"},"examples":[{"en":"My dad tells the same mossy jokes every holiday.","zh":"我爸每逢节假日都讲同样那些老掉牙的笑话。"},{"en":"That’s a mossy old saying, but it’s still true.","zh":"那是句很老的俗语，但依然有道理。"}]}],"synonyms":["moss-covered","mossy-green","damp","musty","old-fashioned","outdated","stale"],"phonetic":"/ˈmɔsi/","extraExplanation":["“mossy”字面意思和自然环境强相关，常用来营造“潮湿、阴影、古老、宁静”的画面感，因此在文学描写里很常见（如描写森林小径、石墙、古井、墓碑等）。","引申义“过时的”来自“长苔”给人的“年代久远、被时间覆盖”的感觉，多用于口语里形容笑话、观念或说法。"]}
{"word":"mossyback","summary":{"en":"A mossyback is an old-fashioned, stubbornly conservative person who resists change.","zh":"mossyback 指守旧顽固、抗拒改变的人（多含贬义），常被视为 mossback 的变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often disapproving) A very old-fashioned, stubbornly conservative person; someone who resists change.","zh":"（非正式，常含贬义）非常守旧、顽固反对改变的人；顽固保守派。"},"examples":[{"en":"Some critics called the senator a mossyback because he opposed nearly every reform.","zh":"一些批评者称那位参议员是“顽固保守派”，因为他几乎反对所有改革。"},{"en":"She jokes that she’s a mossyback when it comes to music—she still prefers vinyl records.","zh":"她开玩笑说自己在音乐方面很“守旧”——她仍然更喜欢黑胶唱片。"}]}],"synonyms":["reactionary","diehard","old-guard","dinosaur","stick-in-the-mud"],"phonetic":"/ˈmɔsiˌbæk/","extraExplanation":["“mossyback”多被视为“mossback”的变体拼写。mossback字面联想到“长了苔藓的背”（像长期不动的石头会长苔藓），引申为“老顽固、守旧的人”。","在美国政治语境里，mossback/mossyback有时特指“老派保守势力/旧派人物”（历史上也可能用来指反对社会改革的政治人物）。使用时注意语气通常不太友好。"]}
{"word":"most","summary":{"en":"Most means “the greatest amount/number” or “the majority,” and it’s also used to make superlatives (the most + adjective).","zh":"most 表示“最多/最大程度”或“大多数”，也常用于构成最高级（the most + 形容词）。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"The greatest in amount, number, degree, or importance.","zh":"最多的；最大程度的；最重要的。"},"examples":[{"en":"Most students in my class like English songs.","zh":"我班上大多数学生喜欢英文歌。"},{"en":"This is the most important part of the lesson.","zh":"这是这节课最重要的部分。"}]},{"partOfSpeech":"pron.","definition":{"en":"Almost all; the majority of people or things.","zh":"大多数；几乎全部（人或事物）。"},"examples":[{"en":"Most of the time, I walk to work.","zh":"大多数时候，我走路去上班。"},{"en":"Most of my friends live nearby.","zh":"我的大多数朋友住在附近。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used to form the superlative of many adjectives and adverbs (meaning “to the greatest degree”).","zh":"用于构成许多形容词/副词的最高级（表示“最……”）。"},"examples":[{"en":"She is the most careful driver I know.","zh":"她是我认识的最小心的司机。"},{"en":"He worked most efficiently in the morning.","zh":"他早上工作效率最高。"}]},{"partOfSpeech":"adv.","definition":{"en":"Very; extremely (more formal).","zh":"非常；极其（较正式用法）。"},"examples":[{"en":"Thank you—it's most kind of you.","zh":"谢谢——你真是太好了。（较正式）"},{"en":"We were most surprised by the news.","zh":"我们对这个消息感到非常惊讶。（较正式）"}]}],"synonyms":["nearly all","the majority (of)","the greatest","maximum"],"phonetic":"/moʊst/","extraExplanation":["用法小提示：作限定词时常见结构是“most + 复数名词/不可数名词”（most people, most water）；带“of”时常见“most of + the/this/that/my + 名词”（most of the students, most of my time）。","“the most + 形容词/副词”表示最高级（the most interesting）；但短词通常用“-est”（the tallest），不是“the most tall”。","正式用法里，“most”=“very/quite”常出现在礼貌或书面表达中（most grateful, most unusual）。"]}
{"word":"most importantly","summary":{"en":"“Most importantly” emphasizes the most important point: “above all.”","zh":"“most importantly”用于强调最重要的一点，相当于“最重要的是/尤其是/首先要”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Used to emphasize the single most important point in what you are saying or writing; above all.","zh":"用于强调你要表达的内容中“最重要的一点”；尤其是、最重要的是。"},"examples":[{"en":"Most importantly, you should get enough sleep before the exam.","zh":"最重要的是，考试前你要保证充足的睡眠。"},{"en":"The plan is affordable and, most importantly, safe.","zh":"这个计划价格合理，而且最重要的是很安全。"},{"en":"Most importantly, listen to what the other person needs.","zh":"最重要的是，倾听对方需要什么。"}]},{"partOfSpeech":"phrase","definition":{"en":"Used to show priority among several items, often in formal speech or writing.","zh":"用于在多个要点中标明优先顺序，常见于较正式的口语或写作。"},"examples":[{"en":"First, we need funding; second, staff; and most importantly, community support.","zh":"首先我们需要资金；其次是人员；而最重要的是社区支持。"},{"en":"We discussed timelines, budgets, and most importantly, patient safety.","zh":"我们讨论了时间安排、预算，以及最重要的病人安全。"}]}],"synonyms":["above all","most of all","in particular","especially","the main thing is"],"phonetic":"/moʊst ɪmˈpɔrtəntli/","extraExplanation":["“Most importantly”常作句子连接/强调用语（discourse marker），放在句首时后面常用逗号：Most importantly, ...；放在句中时常用逗号或破折号隔开：..., most importantly, ...。","口语中也常用更简短的表达：“Most importantly,”≈“Above all,”≈“The main thing is ...”（语气更直接）。"]}
{"word":"mostaccio","summary":{"en":"Mostaccio is an Italian loanword meaning a thick mustache, and less commonly a spiced Italian honey cookie.","zh":"Mostaccio 是意大利语借词，常指浓密的上唇胡；较少见时也指意大利香料蜂蜜饼干。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword) a thick, prominent mustache; in English it can sound old-fashioned or humorous.","zh":"（意大利语借词）浓密显眼的胡子（上唇胡）；在英语里常带有古雅或诙谐的感觉。"},"examples":[{"en":"He twirled his mostaccio like a character in an old opera.","zh":"他把浓密的上唇胡捻来捻去，像老歌剧里的人物。"},{"en":"The portrait shows a nobleman with a dark mostaccio.","zh":"画像里是一位贵族，留着深色的浓密胡子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) an Italian-style spiced honey cookie (related to mostaccioli/mostacciolo).","zh":"（较少见）意大利风味的香料蜂蜜饼干（与 mostaccioli / mostacciolo 相关）。"},"examples":[{"en":"For the holidays, she baked mostaccio with honey and warm spices.","zh":"过节时，她用蜂蜜和暖香料烤了意大利香料饼干。"},{"en":"The bakery sold mostaccio alongside biscotti.","zh":"那家面包店把这种香料饼干和意式脆饼一起卖。"}]}],"synonyms":["mustache","moustache","walrus mustache","mostaccioli","mostacciolo"],"phonetic":"/moʊˈstɑːtʃoʊ/","extraExplanation":["“mostaccio”源自意大利语，常见对应词是 *mostaccio*（胡子）以及 *mostacciolo / mostaccioli*（饼干，单复数不同）。英语里这个词相对少见，多用于带意大利风味的描写、戏剧化/复古的语气，或谈到意大利传统点心时。","如果你在菜单或食谱里看到它，往往更接近“香料蜂蜜饼干”的意思；在人物描写中则更可能是“浓密上唇胡”。"]}
{"word":"mostaccioli","summary":{"en":"Mostaccioli is a tube-shaped pasta (similar to penne), commonly used in Italian-American baked pasta dishes.","zh":"Mostaccioli 是一种类似 penne 的管状意大利面，常用于意大利裔美式的烤意大利面料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of pasta tube (similar to penne, often smooth rather than ridged), especially in Italian-American cooking; it is commonly used in baked pasta dishes with sauce and cheese.","zh":"一种管状意大利面（类似斜切通心粉 penne，常见为表面光滑的款式），在意大利裔美国料理中很常见；常用来做烤意大利面配酱汁和奶酪。"},"examples":[{"en":"For dinner we’re making baked mostaccioli with marinara sauce and mozzarella.","zh":"晚餐我们要做烤 mostaccioli，配番茄红酱和马苏里拉奶酪。"},{"en":"You can substitute penne if you can’t find mostaccioli at the store.","zh":"如果店里买不到 mostaccioli，可以用 penne 代替。"},{"en":"She brought a big pan of mostaccioli to the potluck.","zh":"她带了一大盘 mostaccioli 去参加聚餐。"}]}],"synonyms":["penne","ziti"],"phonetic":"/ˌmoʊstəˈtʃoʊli/","extraExplanation":["Mostaccioli 在美国中西部和意大利裔社区特别常见，经常指“烤通心粉”这类家常宴客菜（拌红酱、肉酱、奶酪后进烤箱）。","它的形状通常像斜切的短管状面；有时与 penne（常见有条纹/螺纹）或 ziti（多为直切）混用或互相替代。","拼写和发音会因地区而略有不同；在菜单或食谱里看到 mostaccioli，通常就可理解为“适合拌酱、烘烤的管状意面”。"]}
{"word":"mostdeal","summary":{"en":"“mostdeal” is not standard English; you probably want “best deal” or “most deals.”","zh":"“mostdeal”不是标准英语；你可能想说“best deal”或“most deals”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/incorrect spelling. “mostdeal” is not a common English word. People usually mean “best deal” (the cheapest or most favorable offer) or “most deals” (the greatest number of bargains).","zh":"非标准/错误拼写。“mostdeal”不是常见英语单词。一般想表达的是“best deal”（最划算的优惠/交易）或“most deals”（最多的优惠/折扣）。"},"examples":[{"en":"I think you mean the best deal, not “mostdeal.”","zh":"我觉得你想说的是 best deal，而不是“mostdeal”。"},{"en":"This store has the most deals during the holiday sale.","zh":"这家店在节日大促期间优惠最多（most deals）。"}]}],"synonyms":["best deal","great deal","biggest discount","most bargains"],"phonetic":"ˈmoʊst diːl","extraExplanation":["在英语里，most 通常不直接和 deal 合成一个单词使用。表达“最划算的优惠”更自然的说法是 best deal / the best deal。表达“优惠最多”用 the most deals。","如果你是在看某个品牌名/网站名（例如 MostDeal），那可能是专有名词（proper noun），意思要看它具体指的公司或产品。"]}
{"word":"moste","summary":{"en":"“Most” means “the greatest” or “the majority.” “Moste” is an old/archaic spelling found in older texts.","zh":"“most”表示“最多/最”或“大多数”。“moste”多为古旧拼写，常见于较早的英语文本。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Greatest in amount, number, or degree; the superlative form of “many/much.”","zh":"最多的；最大程度的；“many/much”的最高级。"},"examples":[{"en":"This is the most important part of the lesson.","zh":"这是这节课最重要的部分。"},{"en":"She has the most experience on the team.","zh":"她是团队里经验最丰富的。"}]},{"partOfSpeech":"adv.","definition":{"en":"More than anyone or anything else; to the greatest degree.","zh":"最；以最大程度。"},"examples":[{"en":"I like this one the most.","zh":"我最喜欢这个。"},{"en":"He worries the most when he can’t reach his family.","zh":"当联系不上家人时，他最担心。"}]},{"partOfSpeech":"pron.","definition":{"en":"The greatest part; the majority.","zh":"大部分；多数。"},"examples":[{"en":"Most of the students passed the exam.","zh":"大多数学生通过了考试。"},{"en":"Most of my friends live nearby.","zh":"我的朋友大多住在附近。"}]}],"synonyms":["the majority (for pronoun use)","largest","greatest","maximum"],"phonetic":"/moʊst/","extraExplanation":["“moste”不是现代英语里的标准拼写。它常见于较早的英语文本中，通常是“most”的旧式拼写，或（在中古英语/早期现代英语里）作情态动词“must”的过去式拼写（相当于现代英语的“must / had to”语感）。如果你是在诗歌、古文或歌词里看到“moste”，建议结合上下文判断是“most（最/大多数）”还是“must（必须）”。"]}
{"word":"mostest","summary":{"en":"“Mostest” is a playful, nonstandard way to say “the most” or “the best.”","zh":"“mostest”是口语里带玩笑意味的非标准说法，用来表示“最……”或“最好”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, humorous, nonstandard) Used to mean “the most” or “the best,” often for playful emphasis.","zh":"（俚语；幽默；非标准用法）表示“最……”或“最好”，常用于夸张、卖萌式的强调。"},"examples":[{"en":"That was the mostest fun I’ve had all year.","zh":"那是我今年玩得最开心的一次。"},{"en":"You’re the mostest awesome friend.","zh":"你是最最棒的朋友。"},{"en":"This is my mostest favorite song.","zh":"这是我最最喜欢的一首歌。"}]}],"synonyms":["the most","the best","greatest","favorite"],"phonetic":"/ˈmoʊstɛst/","extraExplanation":["“mostest”通常被当作儿童式或搞笑的夸张说法，把最高级“most”再加上“-est”（本来“-est”就表示最高级），属于刻意“重复最高级”的玩笑表达。","多见于口语、社交媒体、轻松聊天；正式写作、考试或商务邮件中应避免，改用“the most / the best / my favorite”等更标准的表达。"]}
{"word":"mostests","summary":{"en":"“mostests” is not a standard word; it’s likely a misspelling of “moistest” or the phrase “most tests.”","zh":"“mostests”不是标准单词，通常是“moistest”或短语“most tests”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or misspelling (common possibilities: “moistest” = the superlative of moist, or the phrase “most tests” = the greatest number of tests).","zh":"这不是标准英语单词，通常是拼写错误。常见可能是“moistest”（moist 的最高级：最湿润的），或短语“most tests”（最多的测试/考试）。"},"examples":[{"en":"Did you mean “moistest”? This towel is the moistest one after the wash.","zh":"你是不是想写“moistest”？这条毛巾洗完后是最湿的一条。"},{"en":"Did you mean “most tests”? She took the most tests this semester.","zh":"你是不是想写“most tests”？这学期她参加的测试/考试最多。"}]}],"phonetic":"/ˈmɔɪstɪst/","extraExplanation":["在英语里，像“moistest”这种“-est”结尾通常表示最高级（moist → moister → moistest）。而“most tests”是“most + 名词复数”的结构，表示“数量最多的测试/考试”。如果你告诉我你想表达的句子或语境，我可以帮你确认正确拼法与用法。"]}
{"word":"mostic","summary":{"en":"Mosaic means a pattern/picture made from many small pieces, or (figuratively) something made up of many different parts.","zh":"Mosaic 指由许多小碎片拼成的图案/镶嵌画，也可比喻由多种不同部分组成的整体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a picture or pattern made by putting together many small pieces of colored stone, glass, tile, etc.","zh":"（用彩色石子、玻璃或瓷砖等小碎片拼成的）马赛克；镶嵌画"},"examples":[{"en":"The museum has a beautiful Roman mosaic on the floor.","zh":"博物馆的地面上有一幅漂亮的罗马马赛克。"},{"en":"She made a mosaic from broken tiles.","zh":"她用碎瓷砖拼了一幅马赛克作品。"}]},{"partOfSpeech":"adj.","definition":{"en":"made from many small pieces; made of many different parts put together","zh":"由许多小部分拼成的；多元拼合的"},"examples":[{"en":"The city is a mosaic of cultures and languages.","zh":"这座城市是多种文化与语言交织的拼图。"},{"en":"The report gives a mosaic picture of daily life in the 1920s.","zh":"这份报告拼合呈现了20世纪20年代的日常生活图景。"}]}],"synonyms":["collage (figurative)","patchwork (figurative)","inlay (art)"],"phonetic":"/moʊˈzeɪ.ɪk/","extraExplanation":["你输入的“mostic”不是常见英文单词；你可能想写的是“mosaic”（马赛克）。","“mosaic”既可指艺术形式（用小碎片拼成图案），也常用于比喻：由许多不同部分组合成的整体（如文化、经历、信息的“拼图式”组合）。"]}
{"word":"mosting","summary":{"en":"“Mosting” is generally not standard English; you probably mean “most” or another similar-looking word.","zh":"“mosting”通常不是标准英语；你可能想写“most”或其他长得像的单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or misspelled form. “Mosting” is not a common, accepted English word in everyday use. People usually mean “most” (the greatest amount/degree), or they may be trying to write another word such as “hosting,” “misting,” or “moisting.”","zh":"非标准或拼写错误形式。“mosting”在日常英语中不是常见、规范的单词。多数情况下人们想表达“most”（最多/最……），或可能本来要写“hosting”（主持/托管）、“misting”（起雾/喷雾）、或“moisting”（使潮湿，较少用）。"},"examples":[{"en":"I don’t think “mosting” is correct here—do you mean “most” or “hosting”?","zh":"我觉得这里用“mosting”不太对——你是想写“most”还是“hosting”？"},{"en":"She got the most votes. (Not: She got the mosting votes.)","zh":"她得到了最多的票。（不说：She got the mosting votes。）"}]}],"synonyms":["most","hosting","misting"],"phonetic":"ˈmoʊstɪŋ","extraExplanation":["“most”本身不会像动词那样加 -ing。英语里有些词可以加 -ing 变成名词/形容词（如 “building”），但“most”通常不这样用。","如果你告诉我你看到“mosting”的完整句子（前后文），我可以帮你判断它到底想表达哪个词，并给出更自然的改写。"]}
{"word":"mostlike","summary":{"en":"“Most like” means the closest match or the most similar option.","zh":"“most like”表示“最相似、最接近的那个（选项）”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"more similar to someone or something than any other option; the closest match","zh":"在所有选项中最像（某人/某物）；最接近的匹配"},"examples":[{"en":"Which animal is most like a dog?","zh":"哪种动物最像狗？"},{"en":"Her voice is most like her mother’s.","zh":"她的声音最像她妈妈的。"},{"en":"This solution is most like what we used last year.","zh":"这个解决方案最像我们去年用的那个。"}]}],"synonyms":["most similar to","closest to","nearest to","the best match for"],"phonetic":"/moʊst laɪk/","extraExplanation":["“most like”通常用于比较：most like + 名词/代词，表示“最相似”。常见结构还有：be most like…（最像……）、look most like…（看起来最像……）、sound most like…（听起来最像……）。","写作时通常分开写作“most like”。“mostlike”作为一个连写形式不常见，除非是在用户名、标签或特定系统里的拼写。"]}
{"word":"mostlings","summary":{"en":"A morsel is a small piece of food or a small amount of something.","zh":"morsel 指“一小块食物/一口”，也可指“少量（信息等）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small piece of food; a bite","zh":"（食物的）一小块；一口"},"examples":[{"en":"She offered him a morsel of cake.","zh":"她给了他一小块蛋糕。"},{"en":"The dog ate the morsel in one bite.","zh":"狗一口就把那小块食物吃掉了。"}]},{"partOfSpeech":"n.","definition":{"en":"a small amount of something, especially information or help","zh":"（信息、帮助等的）一点点；少量"},"examples":[{"en":"The report contains a morsel of useful information.","zh":"这份报告里有一点有用的信息。"},{"en":"He gave us a morsel of advice before we started.","zh":"我们开始之前，他给了我们一点建议。"}]}],"synonyms":["bite","piece","crumb","scrap","snippet"],"phonetic":"ˈmɔrsəl","extraExplanation":["“mostlings”在英语里不是常见拼写，很多时候学习者想写的是“morselings / morsels（morsel 的复数）”，意思是“碎块、一口、少量”。如果你能提供一句原句或上下文，我也可以帮你确认你要找的词。"]}
{"word":"mostly","summary":{"en":"“Mostly” means “in most cases” or “more than half,” suggesting something is true generally but not entirely.","zh":"“mostly”表示“多半/大多情况下”，强调总体上如此但并非完全如此。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"More than half; in most cases; generally (but not completely).","zh":"多半；大多情况下；总体上（但并非完全如此）。"},"examples":[{"en":"The audience was mostly students.","zh":"观众多半是学生。"},{"en":"It’s mostly sunny today, with a few clouds.","zh":"今天大体晴朗，但有几朵云。"},{"en":"I mostly agree with you, but I have one concern.","zh":"我大体同意你，但我有一个担心的点。"}]}],"synonyms":["generally","largely","mainly","for the most part","in most cases"],"phonetic":"/ˈmoʊstli/","extraExplanation":["“mostly”强调“占大多数/大部分”，常含“不是100%”的暗示；用在同意或描述天气、成分、群体等时很自然（mostly agree, mostly sunny, mostly students）。","与“mainly”相比：两者都可表示“主要地”，但“mostly”更突出“比例/数量上的大部分”；“mainly”更突出“原因或重点”。例如：He’s here mainly to help（主要目的是帮助）；The group is mostly teenagers（大多是青少年）。"]}
{"word":"mostness","summary":{"en":"“Mostness” is a rare, informal noun meaning “the state of being the most” or “the highest degree.”","zh":"“mostness”是一个罕见、偏口语的名词，意思是“最……的状态/最大程度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, informal) The quality or state of being the most; the highest degree of something.","zh":"（罕见、非正式）“最……的程度/状态”；某事物达到最高程度的性质。"},"examples":[{"en":"In terms of popularity, this song has the mostness right now.","zh":"就受欢迎程度而言，这首歌现在是最“火”的。"},{"en":"She tried to win by showing the mostness of her effort, but the judges wanted technique too.","zh":"她想用“最努力”的表现来取胜，但评委也看重技巧。"}]}],"synonyms":["greatest degree","highest level","maximum"],"phonetic":"/ˈmoʊst.nəs/","extraExplanation":["“mostness”不是常见标准用词，多见于口语、网络语境或带点幽默的表达，用来把“most（最）”名词化，强调“最到什么程度”。","更自然、正式的表达通常是：the greatest degree（最大程度）、the highest level（最高水平）、the maximum（最大值）、the most + noun（最多的……）。例如：“the highest level of popularity（最高的受欢迎程度）”。"]}
{"word":"mostra","summary":{"en":"Mostra usually means an exhibition or show (often in Italian/Portuguese contexts).","zh":"Mostra 通常指“展览/展出”（多见于意大利语或葡萄牙语语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard in English; from Italian/Portuguese) an exhibition or show, especially of art, design, or cultural works.","zh":"（英语中不算常用；源自意大利语/葡萄牙语）展览；展出（尤指艺术、设计或文化作品）。"},"examples":[{"en":"The gallery is hosting a mostra of contemporary photography.","zh":"这家画廊正在举办一场当代摄影展（mostra）。"},{"en":"We visited a small mostra featuring local artists.","zh":"我们参观了一个以本地艺术家为主题的小型展览。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often Portuguese use) a sample or display meant to demonstrate what something is like.","zh":"（常见于葡语语境）样品；展示（用来说明某物是什么样）。"},"examples":[{"en":"The shop offered a mostra of the new perfume.","zh":"店里提供了新香水的试用/展示样品（mostra）。"},{"en":"This brochure is just a mostra of what the program includes.","zh":"这份小册子只是对项目内容的一个展示概览（mostra）。"}]}],"synonyms":["exhibition","show","display","showcase"],"phonetic":"/ˈmoʊstrə/","extraExplanation":["“Mostra”在英语里多见于与意大利/葡语文化相关的场合（比如艺术节、博物馆、画廊的活动名称），日常英语更常说：exhibition, show, display，或（强调陈列）showcase。","如果你是在特定标题里看到它（例如某个艺术节叫“La Mostra”），通常不翻译也可以，直接当作活动名使用。"]}
{"word":"mostruosus","summary":{"en":"Monstruosus is a rare Latin adjective meaning “monstrous” or “abnormally formed,” occasionally used in scholarly/scientific contexts.","zh":"monstruosus 是罕见的拉丁语形容词，意为“怪异的/畸形的”，偶见于学术或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Monstrous; unnaturally formed or abnormal (a rare Latin adjective, sometimes seen in scholarly or scientific writing).","zh":"怪异的；畸形的；不正常形成的（罕见的拉丁语形容词，有时见于学术或科学写作）。"},"examples":[{"en":"In an old zoology text, the author describes a “monstruosus” specimen with abnormal limbs.","zh":"在一本旧的动物学著作中，作者描述了一个“四肢异常的monstruosus标本”。"},{"en":"The note labels the flower as “monstruosus,” meaning it grew in an unusual form.","zh":"注释把这朵花标为“monstruosus”，意思是它以不同寻常的形态生长。"}]}],"synonyms":["monstrous","abnormal","misshapen","deformed"],"phonetic":"/mɑnˈstruoʊsəs/","extraExplanation":["你输入的 mostruosus 很可能是拼写误差或变体；更常见的拉丁拼写是 monstruosus（有 n）。","在现代英语里，这个词本身很少直接使用；更常见、自然的英语对应词是 monstrous（“怪异的/巨大的/可怕的”）。","拉丁词根 monstr- 与 “monster（怪物）”“demonstrate（示范/证明）”同源，原义与“警示、征兆”有关，后来发展出“怪物、畸形”的含义。"]}
{"word":"mosts","summary":{"en":"“Mosts” is an uncommon plural of the noun “most,” but it’s usually an error; in normal English you say “most,” not “mosts.”","zh":"“Mosts”是名词“most”的不常见复数，但多数情况下属于误用；日常英语一般用“most”，不用“mosts”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) Plural form of the noun “most,” meaning the largest amounts/majorities in several groups or cases.","zh":"（不常用）名词“most”的复数形式，表示在多个群体或情况中“最大的部分/多数”。"},"examples":[{"en":"In different surveys, the mosts didn’t always agree with each other.","zh":"在不同的调查中，各自的“多数”并不总是一致。"},{"en":"We compared the mosts and the leasts across three age groups.","zh":"我们比较了三个年龄组中“最多的部分”和“最少的部分”。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling or mistaken plural of “most.” In standard English, “most” is usually not pluralized.","zh":"常见为“most”的拼写或复数误用；在标准英语里，“most”通常不加复数。"},"examples":[{"en":"Incorrect: Mosts people like music. Correct: Most people like music.","zh":"错误：Mosts people like music. 正确：Most people like music（大多数人喜欢音乐）。"},{"en":"Incorrect: She is mosts happy today. Correct: She is very/most happy today.","zh":"错误：She is mosts happy today. 正确：She is very/most happy today（她今天很开心）。"}]}],"synonyms":["majorities","largest parts"],"phonetic":"/moʊst/","extraExplanation":["“most”常见用法是：\n1) 代词/限定词：most people（大多数人）；most of the time（大部分时间）。\n2) 副词：the most beautiful（最漂亮）；most interesting（很有趣/最有趣，视语境）。\n\n“mosts”只有在把“most”当作名词、并且需要复数来对比多个“多数”时才可能出现（多见于学术/统计写作），日常英语几乎不用。"]}
{"word":"mostwhat","summary":{"en":"“Mostwhat” is not standard; it usually means either “somewhat” or “most of what.”","zh":"“mostwhat”不是标准用法，通常是想写“somewhat”或“most of what”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling: usually a typo or mistaken blend. In standard English, people typically mean either “somewhat” (to a small degree) or the phrase “most of what” (the majority of the things that…).","zh":"非标准拼写：通常是拼写错误或把词混在一起。标准英语里人们多半想表达“somewhat”（有点/稍微）或短语“most of what”（……中的大部分）。"},"examples":[{"en":"I think you meant “somewhat”: “I’m somewhat tired.”","zh":"我猜你想写的是“somewhat”：“I’m somewhat tired.”（我有点累。）"},{"en":"Or you may mean “most of what”: “Most of what he said was true.”","zh":"或者你想表达“most of what”：“Most of what he said was true.”（他说的大部分都是真的。）"}]},{"partOfSpeech":"phrase","definition":{"en":"(As the phrase “most what” in informal speech) meaning “most of what,” often used when speaking quickly, but it’s better to write “most of what” in formal writing.","zh":"（口语里把“most of what”说快了像“most what”）意思是“……中的大部分”。正式写作建议写成“most of what”。"},"examples":[{"en":"Informal: “That’s most what I wanted to say.”","zh":"口语： “That’s most what I wanted to say.”（那基本就是我想说的。）"},{"en":"More standard: “That’s most of what I wanted to say.”","zh":"更标准： “That’s most of what I wanted to say.”（那就是我大部分想说的。）"}]}],"synonyms":["somewhat","most of what","largely","for the most part"],"phonetic":"/ˈmoʊst wʌt/","extraExplanation":["“mostwhat”本身不是常见的词条；英语学习中更实用的是区分：\n1）somewhat = 稍微/有点（程度副词）；\n2）most of what + 从句/名词性内容 = ……中的大部分。","如果你把原句发我（前后文），我可以帮你判断你更想表达哪一种，并给出更自然的改写。"]}
{"word":"mosul","summary":{"en":"Mosul is a major city in northern Iraq, near the ancient site of Nineveh.","zh":"Mosul 指伊拉克北部的重要城市，靠近古代尼尼微遗址。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in northern Iraq, on the Tigris River, near the ancient site of Nineveh.","zh":"摩苏尔（Mosul）：伊拉克北部的重要城市，位于底格里斯河畔，靠近古代尼尼微遗址。"},"examples":[{"en":"Mosul is a large city in northern Iraq on the Tigris River.","zh":"摩苏尔是伊拉克北部一座位于底格里斯河畔的大城市。"},{"en":"The ancient ruins of Nineveh are located near Mosul.","zh":"古代尼尼微遗址位于摩苏尔附近。"}]}],"synonyms":["Al-Mawsil"],"phonetic":"/moʊˈsuːl/","extraExplanation":["“Mosul”在英语新闻与历史写作中常见，尤其涉及伊拉克北部的地理、文化与近现代冲突史（如2014—2017年间的相关报道）。","摩苏尔附近的“尼尼微（Nineveh）”在《圣经》与古代近东史中出现频繁，因此在宗教、考古与历史语境里也经常与Mosul并列提到。"]}
{"word":"mosur","summary":{"en":"“mosur” is not a standard English word; it is most likely a misspelling of “measure” (to measure; a measurement or a safety measure).","zh":"“mosur” 不是标准英文单词；很可能是 “measure” 的拼写错误（测量；计量/措施）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely intended) “measure”: to find the size, amount, or degree of something using a tool or standard.","zh":"（可能想写）measure：用工具或标准来测量某物的尺寸、数量或程度。"},"examples":[{"en":"Please measure the table before you buy a new tablecloth.","zh":"买新桌布之前，请先量一下桌子的尺寸。"},{"en":"The nurse measured his temperature.","zh":"护士给他量了体温。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also common) “measure”: an action taken to achieve a result or solve a problem, especially in government or business.","zh":"（也很常见）measure：为达到某种结果或解决问题而采取的措施，常用于政府或商业语境。"},"examples":[{"en":"The city introduced new safety measures.","zh":"这座城市出台了新的安全措施。"},{"en":"We need to take measures to reduce costs.","zh":"我们需要采取措施来降低成本。"}]},{"partOfSpeech":"n.","definition":{"en":"(Other meaning) “measure”: a set amount of something, or a measuring cup/spoon used to serve an exact amount.","zh":"（其他意思）measure：一定量的（份量）；或用于取定量的量杯/量勺。"},"examples":[{"en":"Add two measures of flour.","zh":"加入两份（两勺/两杯）面粉。"},{"en":"She poured a measure of rice into the pot.","zh":"她倒了一量杯米进锅里。"}]}],"synonyms":["gauge","check","assess","quantify","step","action"],"phonetic":"/ˈmɛʒɚ/","extraExplanation":["“mosur” 本身不是常见的英文单词，最可能是拼写错误。常见的目标词是 “measure”（测量/措施）。","如果你想表达的是地名，也可能是 “Mosul”（伊拉克城市摩苏尔）。你可以告诉我你想表达的意思或给一个句子，我可以帮你确认正确拼写与用法。"]}

