{"word":"mou","summary":{"en":"MOU = memorandum of understanding: a document recording an agreement or shared intentions between parties.","zh":"MOU=谅解备忘录：记录双方/多方达成的共识或合作意向的文件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a written document that shows an agreement or shared understanding between two or more people or organizations, often used as a formal record of intentions (sometimes not legally binding)","zh":"谅解备忘录；用于记录双方/多方达成的共识或合作意向的书面文件（有时不具法律约束力）"},"examples":[{"en":"The university signed an MOU with a hospital to support student internships.","zh":"该大学与一家医院签署了谅解备忘录，以支持学生实习。"},{"en":"Before we start the project, let’s draft an MOU to clarify roles and timelines.","zh":"在项目开始前，我们先起草一份谅解备忘录，明确分工和时间表。"}]}],"synonyms":["memorandum of understanding","agreement","protocol","letter of intent"],"phonetic":"/ˌɛm oʊ ˈjuː/","extraExplanation":["MOU 是 “memorandum of understanding” 的缩写，常见于政府、学校、公司、NGO 等机构合作场景，用来把合作范围、目标、责任分工、期限等写清楚。","很多 MOU 主要表达“合作意向/共识”，不一定像合同那样可直接强制执行；但也有些 MOU 会包含具有约束力的条款（例如保密、知识产权、争议解决等）。签署前最好确认文本是否写明 “binding / non-binding”。","在新闻与公文写作中常搭配：sign/enter into an MOU（签署）、draft an MOU（起草）、under an MOU（根据备忘录）。"]}
{"word":"mouch","summary":{"en":"“Mouch” is a rare word meaning to loiter/wander aimlessly or to sneak about quietly (mainly British/Scottish).","zh":"“mouch”较罕见，常指懒散地闲逛，或悄悄、鬼祟地走动（多见于英式/苏格兰用法）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare, chiefly British/Scottish) To loiter or wander around slowly and aimlessly, often looking tired, bored, or without purpose.","zh":"（罕见；多见于英式/苏格兰用法）懒散地闲逛；慢吞吞地游荡，常带有无聊、疲惫或无目的的感觉。"},"examples":[{"en":"He was just mouching around outside the shop, waiting for his friends.","zh":"他就在店外懒散地晃来晃去，等朋友。"},{"en":"After lunch, we mouched along the river with nothing planned.","zh":"午饭后，我们沿着河边慢慢闲逛，没有任何计划。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) To sneak or skulk about quietly, especially to avoid being noticed.","zh":"（罕见）悄悄溜达；鬼鬼祟祟地走动（尤指为了不被发现）。"},"examples":[{"en":"The cat mouched behind the chairs and disappeared.","zh":"猫悄悄从椅子后面溜过去，不见了。"},{"en":"Someone was mouching around the back door in the dark.","zh":"有人在黑暗里鬼鬼祟祟地在后门附近转。"}]}],"synonyms":["loiter","wander","mooch","skulk","sneak"],"phonetic":"/maʊtʃ/","extraExplanation":["“mouch”在现代英语里非常少见，更常见的是“mooch”。“mooch around”常指“闲逛、磨蹭”，而“mooch off someone”则是“占某人便宜/蹭吃蹭住”。如果你想表达“占便宜”，通常要用“mooch”，不是“mouch”。","在一些英式或苏格兰语境中，“mouch”可以带有“无精打采地晃荡”或“偷偷摸摸地走动”的味道；写作或正式场合一般建议用更常见的“wander/loiter/sneak”来替代。"]}
{"word":"moucharabies","summary":{"en":"Moucharabieh refers to a traditional decorative wooden lattice screen on windows or balconies that gives shade, airflow, and privacy.","zh":"Moucharabieh 指传统建筑中的木质镂空格栅窗/屏风，用来遮阳、通风并保护隐私。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative wooden lattice screen (often on a window or balcony) used in traditional Middle Eastern and North African architecture to provide shade, airflow, and privacy","zh":"（中东与北非传统建筑中的）木质镂空格栅窗/阳台屏风，用于遮阳、通风并保护隐私"},"examples":[{"en":"From the street, you could only see light and patterns through the moucharabieh.","zh":"从街上看，只能透过木制格栅窗看到光影和花纹。"},{"en":"The room stayed cooler because air could pass through the moucharabieh.","zh":"因为空气能穿过格栅窗，房间里更凉爽。"},{"en":"Many old houses in Cairo have balconies with a moucharabieh screen.","zh":"开罗许多老房子的阳台都有这种木质格栅屏风。"}]}],"synonyms":["mashrabiya","lattice screen","wooden screen"],"phonetic":"/ˌmuːʃɑːrəˈbiːə/","extraExplanation":["“moucharabieh / moucharabiya”常见于英文与法文的建筑语境，英语里更常见的拼写是 **mashrabiya**。你写的 **moucharabies** 很可能是该词的复数或拼写变体。","这种设计不仅美观，也体现了气候与文化需求：在炎热地区降低直射阳光、增加通风，同时让室内的人能看见外面、外面却不易看清里面。","相关表达：**carved wooden screen**（雕花木屏风）、**lattice screen**（格栅屏风）；但它们不一定包含“传统中东建筑”的文化指向。"]}
{"word":"moucharaby","summary":{"en":"A traditional Middle Eastern/North African wooden lattice window/screen that provides airflow, shade, and privacy.","zh":"一种传统的中东/北非木格栅窗（或屏风），用于通风、遮阳并保护隐私。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture) A carved wooden lattice screen or projecting window, common in Middle Eastern and North African buildings, that lets air and light in while providing shade and privacy.","zh":"（建筑）一种常见于中东和北非建筑的雕花木格栅/格窗（常为外挑式窗廊），既通风采光又遮阳并保护隐私。"},"examples":[{"en":"The old house had a moucharaby over the street, cooling the room while hiding the occupants from view.","zh":"这座老房子临街处有一扇木格栅外挑窗（moucharaby），既给房间降温又让住户不被外人看见。"},{"en":"Sunlight filtered through the moucharaby, making patterns on the floor.","zh":"阳光穿过木格栅窗，在地板上投下了花纹。"}]}],"synonyms":["mashrabiya","lattice screen","latticework"],"phonetic":"/ˌmuːʃəˈrɑːbi/","extraExplanation":["“moucharaby”更常见的拼写有“moucharabieh / moucharabiyah”，英语里也常用“mashrabiya”。多见于阿拉伯-伊斯兰建筑语境。","这种格栅窗的设计兼顾了炎热气候下的通风、遮阳与私密性：人在室内可以向外看，外面却不易看清室内。","词源来自阿拉伯语“مشربية”(mashrabiyya)，与“饮水/放水罐的地方”相关：传统上会在格栅窗处放水罐，利用通风帮助降温。"]}
{"word":"mouchard","summary":{"en":"Mouchard means a secret informer (and sometimes a spying/monitoring device).","zh":"mouchard 指“告密者/线人”，有时也指“用于监视的装置”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informer; someone who secretly reports on others (especially to the police or authorities)","zh":"告密者；线人（秘密向警方或当局举报他人的人）"},"examples":[{"en":"They suspected a mouchard in the group because details kept reaching the police.","zh":"他们怀疑团体里有告密者，因为一些细节总会传到警方那里。"},{"en":"In the novel, the mouchard sells information for money.","zh":"在小说里，那个告密者为了钱出卖情报。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) a secret “snooping” device or tool used to spy or monitor","zh":"（引申）窃听/监控装置；用来暗中侦察或监视的工具"},"examples":[{"en":"He joked that his phone had become a mouchard, tracking everything he did.","zh":"他开玩笑说他的手机成了“监视器”，把他做的一切都记录下来。"}]}],"synonyms":["informer","snitch","spy","stool pigeon","rat"],"phonetic":"/muˈʃɑr/","extraExplanation":["“mouchard”源自法语，字面与“mouche（苍蝇）”有关，带有“到处飞、打探消息”的联想，因此常带贬义，强调“偷偷告密/监视”的行为。英语中多见于历史题材、文学作品或讨论法国语境时。"]}
{"word":"mouchardism","summary":{"en":"Mouchardism means the practice of informing on others or acting as a spy/informer, usually in a negative sense.","zh":"mouchardism 指“告密/充当线人或密探”的做法或风气，通常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or habit of informing on others to authorities; spying or acting as an informer (often with a negative sense)","zh":"向当局告密、打小报告的行为或风气；充当线人、密探（通常带贬义）"},"examples":[{"en":"The community feared a rise in mouchardism after the new surveillance rules.","zh":"新监控规定出台后，社区担心告密之风会抬头。"},{"en":"He criticized mouchardism as a betrayal of trust between neighbors.","zh":"他批评告密行为，认为这背叛了邻里之间的信任。"}]}],"synonyms":["informing","snitching","tattling","spying","informership"],"phonetic":"/muːˈʃɑːrˌdɪzəm/","extraExplanation":["这个词在英语里很少见，主要出现在政治评论、历史讨论或带法语色彩的写作中。它来自法语 mouchard（“告密者/线人”）+ -ism（“主义/风气/做法”）。","在法语语境里，mouchard 常含强烈贬义，暗示秘密监视、告密换取好处或向权力屈从；英语借用 mouchardism 时也通常保留这种负面评价。","更常见的英语表达包括 informing, snitching, tattling（更口语/常指小事告状）, and surveillance by informers（更正式）。"]}
{"word":"mouche","summary":{"en":"A mouche is usually a small black beauty patch worn on the face; less commonly, it can mean a small patch of hair under the lower lip.","zh":"mouche通常指贴在脸上的黑色“美人痣”装饰贴；较少见时也可指下唇下方的一小撮胡子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in 17th–18th century Europe) a small patch of black silk or velvet worn on the face as a fashionable “beauty mark.”","zh":"（尤指17—18世纪欧洲）贴在脸上的小黑色丝绸/天鹅绒“美人痣”（装饰贴）。"},"examples":[{"en":"She wore a mouche near the corner of her mouth, like a classic portrait from the 1700s.","zh":"她在嘴角附近贴了一颗mouche，看起来像18世纪肖像画里的人物。"},{"en":"In the costume shop, we added a tiny mouche to make the character look more aristocratic.","zh":"在戏服店里，我们加了一颗小mouche，让角色看起来更有贵族气质。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a small tuft or patch of facial hair under the lower lip (similar to a small “soul patch”).","zh":"（较少见）下唇下方的一小撮胡子（类似小“灵魂胡/唇下胡”）。"},"examples":[{"en":"He shaved his beard but kept a neat mouche under his lip.","zh":"他把络腮胡刮掉了，但保留了下唇下方整齐的一小撮胡子。"}]}],"synonyms":["beauty patch","beauty mark (artificial)","face patch","(facial hair) soul patch"],"phonetic":"/muʃ/","extraExplanation":["mouche是法语借词，法语里本意是“苍蝇”。因为贴在脸上的黑色小贴片看起来像停着一只小苍蝇，所以这种“美人痣贴”在英语里也借用mouche来指代。","在欧洲宫廷文化与时尚史中，mouche常和粉底、假发等搭配出现，用来强调脸部线条或营造精致感；在戏剧、舞会与古装扮演中也很常用。"]}
{"word":"mouched","summary":{"en":"“Mouched” means “spent time loafing or wandering aimlessly,” and in some UK/Scottish informal use it can also mean “skulk/sneak about” or “scrounge (sometimes petty steal).”","zh":"“mouched”是“mouch”的过去式/过去分词，常指“懒散地闲逛、混时间”；在英式/苏格兰口语里也可指“躲躲藏藏”或“蹭东西（有时小偷小摸）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “mouch”: to wander or hang around lazily and without a clear purpose; to loaf.","zh":"“mouch”的过去式/过去分词：懒散地闲逛、游荡；无所事事地消磨时间。"},"examples":[{"en":"We mouched around the city all afternoon with no plan.","zh":"我们整个下午都在城里漫无目的地闲逛。"},{"en":"He’d been mouching at home instead of looking for a job.","zh":"他一直在家里混日子，而不是去找工作。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “mouch” (UK/Scotland, informal): to skulk or sneak about, often to avoid work or attention.","zh":"“mouch”的过去式/过去分词（英式/苏格兰口语）：鬼鬼祟祟地躲躲藏藏，常指为了逃避工作或不想引人注意。"},"examples":[{"en":"They mouched off before the meeting started so they wouldn’t be asked to help.","zh":"会议还没开始他们就溜走了，免得被叫去帮忙。"},{"en":"Stop mouching around and tell me what you’re doing here.","zh":"别鬼鬼祟祟的了，说清楚你在这儿干什么。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “mouch” (older use): to beg or to obtain something by scrounging; sometimes also used for petty stealing.","zh":"“mouch”的过去式/过去分词（较旧用法）：讨要、蹭来（东西）；有时也可指小偷小摸。"},"examples":[{"en":"He mouched a few dollars from his friends for lunch.","zh":"他从朋友那儿蹭了点钱当午饭钱。"},{"en":"Someone had mouched snacks from the cupboard when no one was looking.","zh":"趁大家没注意，有人从橱柜里顺走了零食。"}]}],"synonyms":["loafed","hung around","wandered","slacked off","skulked","scrounged"],"phonetic":"/maʊtʃt/","extraExplanation":["“mouched”在现代英语里不算常见，更偏英式/苏格兰口语色彩；在美式英语中更常用的表达是 “loafed around / hung around / wandered around / slacked off”。","语气通常带一点负面评价：暗示“懒散、没正事、想逃避责任”。放在正式写作里会显得口语或方言化。"]}
{"word":"mouches","summary":{"en":"Mouches most commonly means decorative facial beauty patches (plural of mouche); it can also rarely mean “flies” in French contexts, or the safety tips on fencing foils.","zh":"mouches 最常指“美人贴/人造美人痣”（mouche 的复数）；在法语相关语境中也可少见地指“苍蝇”，或指击剑花剑剑尖的安全保护头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of mouche) A small artificial beauty spot (a patch of black fabric or makeup) worn on the face, especially fashionable in 17th–18th century Europe.","zh":"（mouche 的复数）人造“美人痣/美人贴”，常用黑色小贴片或妆点贴在脸上；在17—18世纪欧洲曾非常流行。"},"examples":[{"en":"In the portrait, she wears mouches near her mouth to look fashionable.","zh":"在那幅肖像里，她在嘴角附近贴了美人贴来显得时髦。"},{"en":"Some nobles used mouches to highlight pale skin and hide small scars.","zh":"一些贵族用美人贴来衬托苍白肤色，也用来遮住小疤痕。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, from French) Flies; sometimes used in English writing about French cooking, countryside life, or historical texts.","zh":"（较少见，源自法语）苍蝇；偶尔出现在描写法国饮食、乡村生活或历史语境的英文中。"},"examples":[{"en":"The text mentions “mouches” around the fruit in the summer heat.","zh":"文章提到夏天炎热时水果周围有“mouches”（苍蝇）。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of mouche) In fencing, the safety tip (button) on a foil.","zh":"（mouche 的复数）击剑中花剑剑尖的保护头/按钮（安全头）。"},"examples":[{"en":"Check that the mouches are securely attached before practice.","zh":"练习前要检查剑尖保护头是否牢固。"}]}],"synonyms":["beauty patches","beauty spots (artificial)","face patches"],"phonetic":"/muʃ/","extraExplanation":["“mouche”在法语里本义是“苍蝇”。作为“美人贴”时，名称可能来自它像小黑点停在脸上，像“苍蝇落在皮肤上”。","美人贴在欧洲宫廷文化里不只是装饰：不同位置有时会被解读为暗示某种气质或意图（这类“位置含义”在后世常被夸大，但在文学与戏剧里很常见）。"]}
{"word":"mouching","summary":{"en":"Mouching usually means loitering or wandering lazily; sometimes it can also mean freeloading (often spelled “mooching”).","zh":"mouching 通常指懒散地闲逛；有时也指占便宜/白拿（现代更常写作 mooching）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle) moving around slowly and aimlessly; loitering or wandering with no clear purpose.","zh":"（现在分词）懒散地游荡；漫无目的地闲逛、徘徊。"},"examples":[{"en":"He spent the afternoon mouching around the city instead of going home.","zh":"他整个下午都在城里瞎逛，没有回家。"},{"en":"Stop mouching about and help me clean up.","zh":"别再磨磨蹭蹭地乱晃了，来帮我收拾。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) trying to get things from others without paying or by relying on their generosity; freeloading.","zh":"（较少见）占别人便宜、白吃白拿；靠别人接济。"},"examples":[{"en":"He was always mouching cigarettes from his friends.","zh":"他总是从朋友那里蹭烟抽。"},{"en":"I don’t mind sharing, but I’m tired of you mouching off everyone.","zh":"分享我不介意，但我受够了你总靠大家白拿。"}]}],"synonyms":["loitering","wandering","hanging around","freeloading","mooching"],"phonetic":"/ˈmaʊtʃɪŋ/","extraExplanation":["“mouching”来自动词“mouch”，在英式/苏格兰用法里更常见，常指“懒散地闲逛、游荡”。在一些语境中也可表示“蹭、白拿”，这一点常与更常见的拼写“mooching”混淆。","如果你想表达“蹭吃蹭喝/占便宜”，现代英语里更常写作和使用“mooching”。"]}
{"word":"mouchoir","summary":{"en":"Mouchoir is a French word used in English to mean “handkerchief,” often with a literary or French-flavored tone.","zh":"mouchoir 是法语词，在英语中用来表示“手帕”，常带有文学或法式氛围的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a handkerchief; a small piece of cloth used for wiping your nose or face","zh":"手帕；（用于擦鼻子或脸的）方巾"},"examples":[{"en":"She took out a mouchoir and wiped her eyes.","zh":"她拿出一块手帕擦了擦眼睛。"},{"en":"He offered her his mouchoir when she started sneezing.","zh":"她开始打喷嚏时，他把自己的手帕递给了她。"}]}],"synonyms":["handkerchief","hankie","kerchief"],"phonetic":"/muˈʃwɑr/","extraExplanation":["“mouchoir”是法语词，英语里多见于文学作品、历史语境或刻意营造法式氛围的表达中；日常英语更常用“handkerchief”（或更口语的“hankie”）。","词源上与法语动词“moucher”（擤鼻涕/擦鼻子）有关，因此这个词带有比较明确的“擦鼻子用布”的原始用途。"]}
{"word":"mouchoirs","summary":{"en":"Mouchoirs is the French plural for “handkerchiefs.”","zh":"mouchoirs 是法语“手帕”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) handkerchiefs; small pieces of cloth used to wipe the nose or face.","zh":"（法语）手帕；用来擦鼻子或脸的小块布。"},"examples":[{"en":"She bought embroidered mouchoirs at a street market in Paris.","zh":"她在巴黎的街市买了刺绣的手帕（mouchoirs）。"},{"en":"In the old film, gentlemen always carried clean mouchoirs.","zh":"在那部老电影里，绅士总会随身带着干净的手帕。"}]}],"synonyms":["handkerchiefs","hankies","tissues"],"phonetic":"/muˈʃwɑr/","extraExplanation":["“mouchoirs”是法语名词“mouchoir”（手帕）的复数形式。英语里更常用 handkerchief(s) 或 tissue(s)；在英文文本中看到 mouchoirs 往往是为了营造法式氛围、强调时代感或人物的文化背景。","在英语读物/文学译写中，这类保留法语的词常见于描写法国生活的作品（如以巴黎为背景的小说），用来增加真实感。"]}
{"word":"mouchrabieh","summary":{"en":"A mouchrabieh is a traditional wooden lattice window/screen that provides shade, airflow, and privacy in Middle Eastern/North African architecture.","zh":"mouchrabieh 指中东/北非建筑中传统的木制镂空格栅窗（挑窗/围屏），兼具遮阳、通风与隐私功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional wooden lattice screen (often a projecting window or balcony) used in Middle Eastern and North African architecture to provide shade, airflow, and privacy while still allowing people to look out.","zh":"（中东和北非传统建筑中的）木制镂空格栅窗/挑窗（或阳台围屏），用于遮阳、通风与保护隐私，同时仍可向外观望。"},"examples":[{"en":"The old house had a mouchrabieh that filtered the sunlight into soft patterns.","zh":"那座老房子有一扇木格栅挑窗，把阳光过滤成柔和的光影。"},{"en":"From behind the mouchrabieh, she could watch the street without being seen.","zh":"她躲在木格栅窗后，可以看街景而不被人注意。"}]}],"synonyms":["mashrabiya","lattice screen","lattice window"],"phonetic":"/ˌmuːʃəˈrɑːbiə/","extraExplanation":["“mouchrabieh”常见于法语/英语的转写形式，对应更常见的拼写是“mashrabiya(h)”（源自阿拉伯语）。在传统住宅里，它不仅是装饰元素，也与生活方式有关：通过镂空木作增加空气流通、降低室内热感，并在社会文化上提供“能看见外面但外面不易看见里面”的私密性。","文学与旅行写作中，这个词常用来营造“伊斯兰城市旧街区”的视觉意象：光影穿过格栅、室内凉意、安静的观望感。"]}
{"word":"moud","summary":{"en":"“moud” isn’t a standard word; it’s usually a misspelling of “mold/mould.”","zh":"“moud”不是标准词，通常是“mold/mould”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “mold” (US) / “mould” (UK).","zh":"不是标准英文单词；最常见是把“mold（美式）/ mould（英式）”拼错了。"},"examples":[{"en":"I think you meant “mold,” not “moud.”","zh":"我想你想写的是“mold”，不是“moud”。"},{"en":"Check the bread for mold before you eat it.","zh":"吃之前先看看面包有没有发霉（mold）。"}]}],"synonyms":["mold","mould"],"phonetic":"/moʊld/","extraExplanation":["“mold”和“mould”意思相同：美式英语更常用mold，英式英语更常用mould。常见含义包括：①霉菌/发霉（食物、墙面上的霉）；②模具；③塑造、使成形（动词）。","如果你原本想表达“心情”，你可能想写的是“mood”（/mud/）。"]}
{"word":"moudie","summary":{"en":"“Moudie” is a Scottish dialect word meaning “mole.”","zh":"“moudie”是苏格兰方言词，意思是“鼹鼠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) a small burrowing mammal (a mole) that lives underground.","zh":"（苏格兰方言）鼹鼠；一种生活在地下、会挖洞的小型哺乳动物。"},"examples":[{"en":"A moudie has been digging up the garden again.","zh":"有只鼹鼠又把花园挖得乱七八糟。"},{"en":"You can tell a moudie is nearby by the little soil mounds.","zh":"看那些小土堆就知道附近有鼹鼠。"}]}],"synonyms":["mole","mole rat (not exact)","burrowing mammal"],"phonetic":"/ˈmuːdi/","extraExplanation":["“moudie”主要见于苏格兰英语/苏格兰方言（Scots）中，在标准英语里更常用“mole”。如果你本来想查的是“moody（情绪多变的；阴郁的）”或“moldy/mouldy（发霉的）”，告诉我你的语境句子，我可以帮你确认正确拼写。"]}
{"word":"moudieman","summary":{"en":"“Moudieman” isn’t a standard English word; it’s likely a misspelling or a name. It may be intended as “moody man.”","zh":"“moudieman”不是标准英语单词，更可能是拼写错误或名字；可能想写“moody man”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username. The closest common phrase in English would be “moody man” (a man who is often in a bad or changing mood).","zh":"不是标准英语单词。更可能是拼写错误，或是人名/网名。最接近的常见英语表达可能是“moody man”（指情绪多变、常常心情不好的人）。"},"examples":[{"en":"I couldn’t find “moudieman” in a dictionary—did you mean “moody man”?","zh":"我在词典里找不到“moudieman”——你是想说“moody man”吗？"},{"en":"He’s been a moody man since he lost his job.","zh":"自从失业后，他就变得情绪很不稳定/常常心情不好。"}]}],"synonyms":["moody","temperamental","irritable"],"phonetic":"ˈmuːdi mæn","extraExplanation":["“moudieman”看起来像把“moody man”（情绪化的男人）连写在一起，或把“moody”误拼成了“moudie”。如果你是在歌词、游戏ID、社交媒体或人名里看到它，也可能是专有名词（比如姓氏或网名）。","如果你能告诉我它出现的句子/上下文，或你想表达的中文意思（比如“忧郁的男人/脾气不好的男人/穆迪这个人”），我可以给出最准确的词与用法。"]}
{"word":"moudy","summary":{"en":"Moody means easily changing moods or feeling unhappy/irritable; it can also describe a dark, emotional atmosphere in art or weather.","zh":"Moody 指情绪化、容易烦躁或闷闷不乐；也可形容艺术/天气等带有阴郁、情绪张力的氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Often unhappy, quiet, or easily annoyed; having frequent changes of mood.","zh":"情绪化的；喜怒无常的；容易烦躁或闷闷不乐的。"},"examples":[{"en":"He’s been moody all day because he didn’t sleep well.","zh":"他一整天都情绪不太好，因为没睡好。"},{"en":"Teenagers are sometimes moody, so try to be patient.","zh":"青少年有时会情绪化，所以尽量耐心一点。"},{"en":"Don’t talk to her right now—she’s in a moody mood.","zh":"现在别跟她说话——她正闷闷不乐。"}]},{"partOfSpeech":"adj.","definition":{"en":"Creating a dark, mysterious, or emotional feeling (often about art, music, photos, or weather).","zh":"（氛围）阴郁的；神秘而有情绪张力的（常形容艺术、音乐、照片或天气）。"},"examples":[{"en":"The movie has a moody soundtrack.","zh":"这部电影的配乐很有阴郁的氛围。"},{"en":"She posted a moody black-and-white photo.","zh":"她发了一张很有情绪感的黑白照片。"}]}],"synonyms":["irritable","temperamental","changeable","gloomy","brooding"],"phonetic":"/ˈmuːdi/","extraExplanation":["你输入的“moudy”通常是拼写错误，常见目标词是 **moody**（情绪化的/阴郁氛围的）。另一个容易混淆的词是 **moldy / mouldy**（发霉的），意思完全不同：*moldy bread* = 发霉的面包。","搭配很常见：**be in a moody mood**（有点闷/情绪化）、**get moody**（变得情绪化）、**a moody atmosphere**（阴郁的氛围）。"]}
{"word":"moue","summary":{"en":"A moue is a small pout or sulky facial expression showing mild displeasure or playful annoyance.","zh":"moue 指轻微的噘嘴或闷闷不乐的表情，常表示轻度不满或带点玩笑式的恼怒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pout or sulky facial expression, often showing dissatisfaction, boredom, or playful annoyance","zh":"噘嘴、闷闷不乐的表情（常表示不满、无聊或带点撒娇/玩笑式的恼怒）"},"examples":[{"en":"She made a little moue when she heard the plan had changed.","zh":"听说计划变了，她轻轻噘了噘嘴。"},{"en":"His moue suggested he wasn’t impressed by the joke.","zh":"他的噘嘴表情暗示他并不觉得那个笑话好笑。"},{"en":"The child’s moue quickly turned into a grin.","zh":"孩子的噘嘴表情很快变成了笑容。"}]}],"synonyms":["pout","grimace","sulk","scowl"],"phonetic":"/muː/","extraExplanation":["该词来自法语 moue，常用于文学或较正式的描写，强调“轻微的噘嘴/不悦的表情”，比 pout 更带一点“做表情、摆脸色”的味道。"]}
{"word":"mouedhin","summary":{"en":"A muezzin is the person who calls Muslims to prayer from a mosque.","zh":"muezzin 指在清真寺呼唤穆斯林礼拜的宣礼员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who calls Muslims to prayer (the adhan), traditionally from a mosque’s minaret and often now using a loudspeaker.","zh":"（清真寺的）宣礼员；负责呼唤穆斯林礼拜的人（诵念宣礼词 adhan），传统上在宣礼塔上，现代也常用扩音器。"},"examples":[{"en":"The muezzin called the faithful to prayer at dawn.","zh":"宣礼员在黎明时召唤信众礼拜。"},{"en":"We heard the muezzin’s call echo across the city.","zh":"我们听到宣礼声在城市上空回荡。"}]}],"synonyms":["caller to prayer","mu'adhdhin"],"phonetic":"/mjuːˈzɪn/","extraExplanation":["“mouedhin”是“muezzin”的一种拼写变体，也可见到更接近阿拉伯语的写法“mu’adhdhin / muadhdhin”。英语里最常用的拼写是 muezzin。","与之相关的词：adhan 指“宣礼词/宣礼”（宣告礼拜时间的固定念诵），minaret 指“宣礼塔”。","在一些文学或旅行写作中，作者会用 muezzin 的呼唤来营造清晨或黄昏的城市氛围，强调声音的回响与日常宗教节律。"]}
{"word":"moues","summary":{"en":"“moues” is the plural of “moue,” meaning a pout or sulky facial expression.","zh":"“moues”是“moue”的复数，表示噘嘴或闷闷不乐的表情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pout or sulky expression (often showing dissatisfaction, boredom, or disapproval)","zh":"噘嘴、闷闷不乐的表情（常表示不满、无聊或不赞同）"},"examples":[{"en":"She made a little moue when she heard the plan.","zh":"她听到这个计划时微微噘了噘嘴。"},{"en":"His polite smile turned into a moue of annoyance.","zh":"他礼貌的微笑变成了不耐烦的噘嘴表情。"}]}],"synonyms":["pout","grimace","sulk","glower (expression)"],"phonetic":"/muː/","extraExplanation":["“moues”通常是名词“moue”的复数形式，单数是“a moue”，复数是“two moues”。","它是法语外来词，在英文里多用于描写面部表情（尤其是轻微的噘嘴/不快的神情），语气偏书面或文艺描写。","容易和拼写相近的词混淆：mouse（老鼠/鼠标；复数 mice）以及 mousse（慕斯甜点/泡沫状发胶等）。"]}
{"word":"moufflon","summary":{"en":"A moufflon is a wild sheep with curved horns, native to Mediterranean regions and often linked to the ancestors of domestic sheep.","zh":"moufflon 指一种有弯角的野生绵羊，原生于地中海地区，常被认为与部分家羊的祖先有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild sheep (Ovis orientalis musimon) with curved horns, found especially on Mediterranean islands such as Corsica and Sardinia; considered an ancestor of some domestic sheep","zh":"一种野生绵羊（盘羊的一个亚种），有弯曲的角，主要分布在科西嘉岛、撒丁岛等地中海岛屿；常被认为与部分家羊的祖先有关"},"examples":[{"en":"We saw a moufflon on the rocky hillside at dusk.","zh":"黄昏时我们在岩石山坡上看到了一只欧洲盘羊。"},{"en":"Male moufflons have large, curled horns.","zh":"雄性欧洲盘羊长着又大又卷曲的角。"}]}],"synonyms":["wild sheep","European mouflon"],"phonetic":"/ˈmuːflɑn/","extraExplanation":["“moufflon”是从法语借入英语的动物名称，在自然纪录片、动物学和欧洲野生动物语境中更常见。中文常译作“欧洲盘羊”，有时也会用“摩弗伦羊/穆弗伦羊”作音译。","在文化语境里，它常被用来代表“野性、原始山地自然”，尤其出现在描写地中海岛屿或欧洲山地的旅行与自然写作中。"]}
{"word":"moufflons","summary":{"en":"Moufflons are wild sheep (plural of moufflon).","zh":"moufflons 是“moufflon（盘羊/欧洲野绵羊）”的复数，指多只野生绵羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of moufflon: wild sheep (especially in Europe and parts of Asia) with short hair and usually curved horns; sometimes considered an ancestor of domestic sheep.","zh":"moufflon（盘羊/欧洲野绵羊）的复数：一种野生绵羊（多见于欧洲及部分亚洲），毛较短，通常有弯曲的角；有时被认为是家羊的祖先之一。"},"examples":[{"en":"Moufflons live in rugged, rocky mountain areas.","zh":"盘羊生活在崎岖、多岩的山地地区。"},{"en":"The park protects moufflons and other native wildlife.","zh":"这个国家公园保护盘羊等本土野生动物。"}]}],"synonyms":["wild sheep","mouflon"],"phonetic":"/ˈmuːflɑn/","extraExplanation":["“moufflon”是从法语借入英语的动物名称，常见于自然纪录片、动物学文章或野生动物保护相关文本。写作时更常用单数“moufflon”表示该物种整体，复数“moufflons”强调多只个体。"]}
{"word":"mouflon","summary":{"en":"A mouflon is a wild sheep known for its curved horns, native mainly to Mediterranean regions.","zh":"mouflon 指一种以弯曲羊角著称的野生绵羊，主要原产于地中海地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild sheep with curved horns, found mainly on Mediterranean islands (and related populations in nearby regions)","zh":"一种野生绵羊，长有弯曲的羊角，主要分布在地中海一些岛屿（以及附近地区的相关种群）"},"examples":[{"en":"We saw a mouflon on the rocky hillside during our hike.","zh":"徒步时，我们在岩石山坡上看到了一只野盘羊。"},{"en":"The mouflon’s horns curve backward and can look very impressive.","zh":"野盘羊的羊角向后弯曲，看起来非常壮观。"}]}],"synonyms":["wild sheep"],"phonetic":"/ˈmuːflɑn/","extraExplanation":["“mouflon”常指欧洲野盘羊（European mouflon），在科西嘉岛与撒丁岛最为知名。它也常被认为与家羊的起源有一定关联，因此在自然史、考古与动物驯化讨论中偶尔会出现。","在英语里它多用于自然纪录片、动物学或旅行写作中；日常口语里不常见。","词源来自法语 mouflon。"]}
{"word":"mouflons","summary":{"en":"Mouflons = wild sheep (plural).","zh":"mouflons＝野盘羊（复数），一种野生绵羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mouflon; a type of wild sheep with curved horns, found especially in the Mediterranean and parts of Asia. “Mouflons” is the plural form.","zh":"野盘羊（mouflon）的复数；一种野生绵羊，常见于地中海地区及亚洲部分地区，通常有弯曲的角。"},"examples":[{"en":"Mouflons live in rocky, mountainous areas where they can escape predators.","zh":"野盘羊生活在岩石多、山地的环境里，便于躲避捕食者。"},{"en":"The park has a small group of mouflons, and visitors sometimes spot them at dawn.","zh":"公园里有一小群野盘羊，游客有时能在黎明时分看到它们。"}]}],"synonyms":["wild sheep"],"phonetic":"/ˈmuːflɑn/","extraExplanation":["“mouflon”常见于自然纪录片、动物学与狩猎/野生动物管理相关语境。它被认为与家绵羊有亲缘关系，因此在介绍绵羊的起源与驯化历史时也可能出现。","英文里复数一般加 -s（mouflons）。发音上注意首音节重读，且词尾 -on 发 /ɑn/。"]}
{"word":"mougeotia","summary":{"en":"Mougeotia is a genus of filamentous freshwater green algae.","zh":"Mougeotia 指一种丝状的淡水绿藻属（接合藻属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of filamentous freshwater green algae, often found in ponds and slow-moving streams","zh":"（绿藻门的）接合藻属；一种丝状淡水绿藻，常见于池塘和缓流水域"},"examples":[{"en":"Under the microscope, the pond sample contained long filaments of Mougeotia.","zh":"在显微镜下，这份池塘样本里有许多接合藻属（Mougeotia）的长丝状体。"},{"en":"Mougeotia often forms green mats near the water’s surface in calm conditions.","zh":"在水面平静的情况下，接合藻属（Mougeotia）常会在近水面形成绿色的藻毯。"}]}],"synonyms":["green algae (general)","filamentous algae (general)"],"phonetic":"/ˌmuːdʒiˈoʊʃiə/","extraExplanation":["Mougeotia 是生物分类学中的“属名”（genus），首字母要大写，斜体常用于学术写作（如 *Mougeotia*）。","它属于接合藻类（与“水绵”Spiragyra 等相近），常用于学习藻类形态或水体生态的课程与实验。","这个属名来自人名（Mougeot），因此拼写看起来不像常见英语词汇，读音也更接近拉丁化的学名读法。"]}
{"word":"mougeotiaceae","summary":{"en":"Mougeotiaceae is a scientific name for a family of freshwater filamentous green algae.","zh":"Mougeotiaceae 是“转丝藻科”的学名，指一类常见于淡水的丝状绿藻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of filamentous green algae (order Zygnematales), including genera such as Mougeotia, often found in freshwater","zh":"一种丝状绿藻的科（接合藻目），包含如转丝藻属（Mougeotia）等，多见于淡水环境"},"examples":[{"en":"Mougeotiaceae are common in ponds and slow-moving streams.","zh":"转丝藻科常见于池塘和流速较慢的溪流中。"},{"en":"Under a microscope, some Mougeotiaceae show long, unbranched filaments.","zh":"在显微镜下，一些转丝藻科成员呈现细长、不分枝的丝状体。"}]}],"synonyms":["Mougeotia family"],"phonetic":"/ˌmuːʒoʊʃiˈeɪsi.iː/","extraExplanation":["词源与读法提示：该词来自属名 Mougeotia 加上植物分类学中表示“科”的后缀 -aceae；在学术写作中通常首字母大写（Mougeotiaceae）。","生物学背景：接合藻类常见的有性生殖方式是“接合”（conjugation），这也是其所属目 Zygnematales 名称的由来之一。"]}
{"word":"mought","summary":{"en":"“Mought” is an archaic/dialect form meaning “might” (past of “may”).","zh":"“mought”是古体/方言形式，意思相当于“might”（“may”的过去式）。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(archaic or dialect) Past tense of “may”: used to mean “might,” “was allowed to,” or “was possible to.”","zh":"（古体或方言）“may”的过去式：表示“可能会/也许会（= might）”，“被允许（= was allowed to）”，或“有可能（= was possible to）”。"},"examples":[{"en":"If he mought, he would help you.","zh":"如果他可能的话，他会帮你。"},{"en":"She said we mought go home early.","zh":"她说我们也许可以早点回家。"},{"en":"In older writing, “mought” sometimes appears where modern English uses “might.”","zh":"在较早的写作里，“mought”有时出现在现代英语会用“might”的地方。"}]}],"synonyms":["might"],"phonetic":"/maʊt/","extraExplanation":["“mought”现在几乎不用，主要见于英格兰一些地区方言或较旧的文学文本中。学习时把它当作“might”的旧式拼写/旧式形式即可，写作中一般不要用，除非你在模仿古风或方言口吻。"]}
{"word":"mouill","summary":{"en":"“Mouill” isn’t a standard English word; it likely refers to French *mouillé*, a cooking term meaning “moistened with a little liquid.”","zh":"“mouill”不是标准英语词；多半指法语 *mouillé*，在烹饪中表示“加少量液体使其润湿”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Cooking, from French) moistened or wetted with liquid; used in recipes to mean adding a small amount of broth, wine, or water so food doesn’t dry out.","zh":"（烹饪用语，源自法语）“润湿的／加了少量液体的”；在食谱里指加入一点高汤、葡萄酒或水，让食材不至于变干。"},"examples":[{"en":"Keep the pan mouillé with a little stock while the onions cook.","zh":"洋葱煮的时候，用一点高汤把锅保持“润湿”，别让它干掉。"},{"en":"The recipe says the vegetables should be mouillé before covering the pot.","zh":"食谱说蔬菜在盖锅盖之前要先加一点液体润湿。"}]}],"synonyms":["moistened","wetted","dampened"],"phonetic":"/mwiˈjeɪ/","extraExplanation":["“mouill”本身不是常见英语单词，更像是法语词根/拼写不完整。你可能想找的是法语 **mouillé**（常在英文食谱里不加重音写成 *mouille* 或 *mouillé*）。","法语重音符号 **é** 常在英文里被省略，但在更正式或偏法式的菜谱/烹饪书中会保留。","在英语里它多出现在专业烹饪语境，不是日常会话常用词；日常英语更常说 **moisten**, **add a splash of stock/water**, **deglaze**（刮锅底并加液体）。"]}
{"word":"mouillation","summary":{"en":"Mouillation is a rare linguistics term meaning a “y”-like palatalization of a consonant.","zh":"Mouillation 是一个罕见的语言学术语，指辅音带“y 音色”的腭化现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) a kind of palatalization: pronouncing a consonant with an added “y” sound (like /j/), often influenced by a following front vowel or /j/.","zh":"（语言学）一种“腭化/加-y 音”的现象：发某个辅音时带上类似 /j/（英语 y）的音色，常受后面前元音或 /j/ 的影响。"},"examples":[{"en":"In some descriptions of French, mouillation refers to consonants pronounced with a noticeable /j/-like quality.","zh":"在一些法语的描写中，mouillation 指带有明显 /j/（y 音色）特点的辅音发音。"},{"en":"The author uses “mouillation” to explain why a consonant sounds softer before certain vowels.","zh":"作者用 mouillation 来解释为什么某些辅音在特定元音前听起来更“软”。"}]}],"synonyms":["palatalization","yodization","iotacization"],"phonetic":"/ˌmuːjəˈleɪʃən/","extraExplanation":["这个词在现代英语里非常少见，多出现在较老的语音学/法语语音学资料中，源自法语 mouillé（意为“湿的/柔的”），用来形容某些辅音发音时带“柔化、带 y 音色”的感觉。现代语言学更常用的术语是 palatalization（腭化）。","拼写也容易与更常见的英文词混淆；如果你是在别处看到的，可能出自法语语音学语境，或是对 “mouillure / mouillé” 一类术语的英文化写法。"]}
{"word":"mouille","summary":{"en":"Mouille usually means wet, heavy, slushy snow (especially in skiing).","zh":"Mouille 通常指滑雪语境中的湿重、带水的雪（春雪/雪泥感的雪况）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(skiing, snow conditions) wet, heavy, slushy snow; springlike snow that can feel sticky or slow.","zh":"（滑雪/雪况）湿重、带水的雪；类似春雪的“黏/慢”的雪况。"},"examples":[{"en":"By noon the powder turned to mouille, and my skis felt much slower.","zh":"到了中午，粉雪变成了 mouille（湿重春雪），我的滑雪板明显变慢。"},{"en":"Waxing for mouille helps when the snow is warm and wet.","zh":"在温暖潮湿的雪况（mouille）下打蜡会更顺滑。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a wet patch or muddy/watery area.","zh":"（较少见）一片湿地；泥泞或积水的地方。"},"examples":[{"en":"We avoided the mouille near the path after the rain.","zh":"雨后我们避开了小路旁那片积水的湿地。"}]}],"synonyms":["wet snow","slush","spring snow"],"phonetic":"/muːˈjeɪ/","extraExplanation":["“mouille”是法语借词，源自法语形容词/名词“mouillé”（意为“湿的/被弄湿的”）。在英语里它最常见于滑雪圈，用来形容偏暖时段的湿雪、春雪或带水的雪，常与“slush（雪泥）”“wet snow（湿雪）”“spring snow（春雪）”意思接近。","发音在英语语境中会因地区与圈子而不同；滑雪者常用近似法语的读法。"]}
{"word":"mouillure","summary":{"en":"Mouillure is a rare French culinary term meaning a small wetting/moistening amount of liquid added during cooking.","zh":"mouillure 是少见的法式烹饪用语，指烹调时加入少量液体来润湿、防粘或保持湿润。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French loanword, culinary) the act of moistening or wetting; a small amount of liquid added to keep food from drying out.","zh":"（法语借词，烹饪）润湿、加少量液体以保持食物不干的做法；少量用于“润锅/润食材”的液体。"},"examples":[{"en":"Add a little mouillure (water or stock) so the onions don’t stick to the pan.","zh":"加一点 mouillure（清水或高汤），这样洋葱就不会粘锅。"},{"en":"The chef adjusted the mouillure to keep the sauce glossy and smooth.","zh":"主厨调整了 mouillure 的用量，让酱汁保持光亮顺滑。"}]}],"synonyms":["moisture","wetting","a splash (of liquid)","moistening"],"phonetic":"/mwiˈjʊr/","extraExplanation":["“mouillure”来自法语 *mouiller*（润湿、加液体）。在英文里它非常少见，多见于讲究法式技法的烹饪语境；日常英语通常直接说 *a splash of water/stock*、*moisture* 或 *wetting*.","如果你在菜谱里看到相关表达，更常见的是动词 *mouiller*（法语：加液体润湿/锅底去釉）或英语对应的 *moisten*、*deglaze*（加液体刮起锅底焦香物）。"]}
{"word":"moujik","summary":{"en":"A (old-fashioned) word for a Russian peasant; often seen in historical or literary contexts.","zh":"（较旧的说法）指俄国农民，常见于历史或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in older writing) a Russian peasant; a common rural laborer, often associated with the time before modern reforms.","zh":"（尤用于较旧的写法）俄国农民；乡村普通劳动者，常与近代改革前的旧俄社会背景相关。"},"examples":[{"en":"In the novel, the landowner speaks to the moujiks working in his fields.","zh":"在小说里，地主和在田里干活的俄国农民说话。"},{"en":"The travel writer described a village of moujiks living through a harsh winter.","zh":"那位游记作者描写了一个俄国农民村庄如何熬过严冬。"}]}],"synonyms":["muzhik","peasant","Russian peasant"],"phonetic":"/ˈmuːʒɪk/","extraExplanation":["“moujik”是从俄语“мужик”转写来的旧式拼法，现代英语更常见的拼写是“muzhik”。","这个词在英语里常出现在历史叙述、19世纪文学译本或带有“旧俄/沙皇俄国”氛围的作品中；语气可能带一点时代感或阶层色彩，用于当代现实语境时要注意避免刻板印象。","相关历史背景：在沙皇俄国，许多农民长期受农奴制度影响（1861年改革后逐步废除），因此该词有时会让人联想到贫困、艰辛与土地束缚。"]}
{"word":"moujiks","summary":{"en":"“Moujiks” means Russian peasants, especially in the Tsarist era (plural of “moujik”).","zh":"“moujiks” 指俄国农民，尤指沙皇时期的农民（为 “moujik” 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of moujik) a Russian peasant, especially in the period of the Russian Empire; often used in historical writing to mean a poor rural farmer.","zh":"（moujik 的复数）俄国农民，尤指沙皇俄国时期的农村贫苦农民；常见于历史语境。"},"examples":[{"en":"In many 19th‑century accounts, the moujiks are described as living in wooden cottages and farming small plots.","zh":"在许多19世纪的记载中，moujiks 被描写为住在木屋里、耕种小块土地。"},{"en":"The novel contrasts the lives of the aristocracy with those of the moujiks.","zh":"这部小说对比了贵族与 moujiks 的生活。"}]}],"synonyms":["Russian peasants","peasants","muzhiks"],"phonetic":"/ˈmuʒɪks/","extraExplanation":["“moujik”（也拼作“muzhik”）源自俄语“мужик”，原意接近“乡下男子/农民”。英语里多用于历史或文学语境，指沙皇时期的农民阶层，常带有“贫穷、被压迫的农村劳动者”的联想。","由于这是外来词，在现代英语日常对话中不常用；写作时更常见的中性表达是“peasant”或“Russian peasant”。"]}
{"word":"moul","summary":{"en":"“moul” is not standard; it usually refers to “moult” or “mold/mould.”","zh":"“moul”不是标准词，通常是想写“moult”或“mold/mould”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern usage; most often a typo or shortened form. In English writing, people usually mean either “moult” (to shed feathers/skin) or “mould/mold” (a fungus or a shape/form).","zh":"“moul”在现代英语中不是标准词；多见于拼写错误或非正式缩写。写作中通常想表达的是“moult”（蜕毛/蜕皮）或“mould/mold”（霉菌；模具/塑形）。"},"examples":[{"en":"I think you mean “moult”: Birds moult after the breeding season.","zh":"你可能想写“moult”：鸟类常在繁殖季后换羽。"},{"en":"If you mean the fungus, the usual spelling is “mold” (US) or “mould” (UK).","zh":"如果你指“霉菌”，常用拼法是美式“mold”或英式“mould”。"}]}],"phonetic":"/moʊl/","extraExplanation":["“moult”美式音标常读 /moʊlt/，意思是动物（尤其鸟、蛇）脱落旧的羽毛、皮肤、外壳。","“mold/mould”在美式拼写多用“mold”，英式多用“mould”；既可以指“霉”，也可以指“模具/塑形”。","如果你告诉我你看到“moul”的句子或上下文（比如是一句话、菜单、还是生物学文章），我可以帮你确定最可能的正确词。"]}
{"word":"moulage","summary":{"en":"Moulage means realistic fake injuries used for training or media, and it can also mean the process of making molds and casts.","zh":"Moulage 指用于训练或影视的逼真“假伤/伤妆”，也可指翻模与浇铸复制的制模工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the realistic makeup and materials used to create fake injuries (e.g., cuts, burns) for medical training or film/TV","zh":"（用于医学训练或影视的）特效化妆/伤妆；用来模拟伤口、烧伤等的逼真造型材料与技术"},"examples":[{"en":"The nursing students practiced emergency care using moulage wounds.","zh":"护理学生用伤妆模拟伤口来练习急救处理。"},{"en":"The instructor applied moulage to simulate a severe burn.","zh":"教官用伤妆来模拟严重烧伤。"}]},{"partOfSpeech":"n.","definition":{"en":"the art or process of making a mold and casting an exact copy of something (often in wax or plaster)","zh":"翻模/制模与浇铸复制的工艺（常用蜡或石膏等材料制作精确复制品）"},"examples":[{"en":"The museum used moulage to reproduce delicate artifacts for display.","zh":"博物馆用翻模工艺复制易碎文物用于展出。"}]}],"synonyms":["special-effects makeup","injury simulation","prosthetic makeup","casting","molding"],"phonetic":"/muːˈlɑːʒ/","extraExplanation":["moulage 来自法语，原意与“模具/成型”有关。英语里常见于医疗情境：在模拟训练（simulation）中，用来制造非常逼真的“假伤”，帮助学员在不伤害真实病人的情况下练习评估与处置。","发音结尾的 -age 常读作 /ɑːʒ/（类似 ‘mirage’ 的结尾音）。"]}
{"word":"moulages","summary":{"en":"Moulages are life-like molded models, especially wax/silicone medical training models of injuries or diseases.","zh":"Moulages 指逼真的翻模模型，尤指医学训练中用蜡/硅胶制作的伤口或病变模型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a life‑like cast or model made from a mold, especially a wax or silicone model used in medical training to show wounds or diseases (plural: moulages)","zh":"（moulage 的复数）用模具制作的逼真模型/翻模，尤指医学教学中用蜡或硅胶做的伤口、病变等逼真模型"},"examples":[{"en":"The nursing students practiced bandaging using moulages of burns and cuts.","zh":"护理学生用烧伤和割伤的逼真模型（moulages）练习包扎。"},{"en":"The instructor prepared moulages to simulate trauma for the emergency drill.","zh":"教员准备了伤情翻模，用于急救演练中的创伤模拟。"}]},{"partOfSpeech":"n.","definition":{"en":"models or casts made by molding, used in art, special effects, or sculpture work (plural: moulages)","zh":"（moulage 的复数）通过翻模制作的模型/铸型，用于艺术、特效或雕塑制作"},"examples":[{"en":"The artist displayed moulages of hands made from plaster molds.","zh":"艺术家展出了用石膏模具翻制的手部模型。"},{"en":"Film makeup teams sometimes use moulages to create realistic injuries.","zh":"电影化妆团队有时会用翻模制作逼真的伤效。"}]}],"synonyms":["casts","molds","models","replicas","wax models"],"phonetic":"/muˈlɑʒ/","extraExplanation":["“moulage”源自法语，和“mouler（用模具成型）”同源。英语里它常见于医学教学与急救训练：把伤口、皮疹等做成高度逼真的“伤情模型”，让学习者在不伤害真人的情况下练习判断与处理。","在急救/灾难演练中，你也可能看到动词用法“to do moulage”，意思是“做伤效化妆/伤情布置”，让演练更接近真实情境。"]}
{"word":"mould","summary":{"en":"Mould (US: mold) means (1) fungus that grows in damp places, (2) a mold/mould for shaping things, or (3) to shape or influence something.","zh":"mould（美式多写作 mold）常见三义：①霉/霉菌；②模具/模子；③（把东西）塑形或（比喻）塑造、影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, furry growth (a fungus) that forms on food or damp surfaces.","zh":"（食物或潮湿表面上的）霉、霉菌。"},"examples":[{"en":"There’s mould on the bread, so we should throw it away.","zh":"面包上长霉了，所以我们应该把它扔掉。"},{"en":"The bathroom wall has mould because it stays wet.","zh":"浴室墙上有霉，因为一直很潮湿。"}]},{"partOfSpeech":"n.","definition":{"en":"A hollow container or shape used for making an object (for example, a cake mould or a metal mould).","zh":"模具；模子（用来做出某种形状的容器或工具）。"},"examples":[{"en":"She poured the chocolate into a mould and let it cool.","zh":"她把巧克力倒进模具里，然后让它冷却。"},{"en":"The factory uses moulds to make plastic parts quickly.","zh":"工厂用模具快速制造塑料零件。"}]},{"partOfSpeech":"v.","definition":{"en":"To shape something into a particular form; to influence how someone or something develops.","zh":"塑造；使成形；（比喻）影响并形成（性格、发展等）。"},"examples":[{"en":"You can mould the clay with your hands.","zh":"你可以用手把黏土捏成形。"},{"en":"Her teachers helped mould her confidence.","zh":"她的老师帮助塑造了她的自信。"}]}],"synonyms":["mold","fungus","mildew","shape","form"],"phonetic":"/moʊld/","extraExplanation":["拼写提示：mould 是英式拼写；美式通常写作 mold。意思基本相同（“霉/模具/塑造”）。","文化与用法：在住房与健康话题里，mould/mold 常与过敏、潮湿、通风不良相关；常见搭配有 black mould（黑霉）、mouldy smell（霉味）、remove mould（除霉）。","词源小知识：mould（模具/塑造）与“形成形状”的概念有关，因此也引申出“塑造人的性格/习惯”的比喻用法。"]}
{"word":"mouldboard","summary":{"en":"A mouldboard is the curved plate on a plow that turns the soil.","zh":"mouldboard 指犁上的翻土板，用来把土翻起并翻转。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A curved metal plate on a plow that lifts, turns, and breaks up the soil (also spelled “moldboard” in American English).","zh":"（犁上的）翻土板：犁的一块弯曲金属板，用来把土翻起、翻转并打碎（美式拼写常作 moldboard）。"},"examples":[{"en":"The farmer adjusted the mouldboard to turn the soil more cleanly.","zh":"农夫调整了翻土板，让翻土更利落。"},{"en":"After plowing, the mouldboard left neat ridges across the field.","zh":"犁过之后，翻土板在田里留下整齐的垄沟。"}]}],"synonyms":["moldboard","plow board"],"phonetic":"/ˈmoʊldˌbɔrd/","extraExplanation":["拼写提示：mouldboard 是英式拼写；在美式英语里更常见的是 moldboard。两者意思相同。","语境提示：这个词多出现在农业、机械或历史类文章中（例如讲传统“犁地/耕作”的工具结构）。"]}
{"word":"moulded","summary":{"en":"Moulded means “shaped/formed,” either as an adjective (moulded plastic) or as the past form of mould (moulded clay; experiences moulded her).","zh":"moulded 表示“被塑形/成型的”，既可作形容词（如模压塑料），也可作 mould 的过去式/过去分词（如把黏土塑形；经历塑造了她）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped or formed into a particular form, often by pressing a soft material into a mold.","zh":"被塑造成某种形状的；常指把柔软材料压入模具中成型。"},"examples":[{"en":"The chair has a moulded plastic seat.","zh":"这把椅子有一个模压成型的塑料座椅。"},{"en":"She used moulded clay to make a small bowl.","zh":"她用塑形的黏土做了一个小碗。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense or past participle of “mould”: shaped or formed (physically or figuratively).","zh":"“mould”的过去式/过去分词：塑造了（外形或比喻意义上的性格、观念等）。"},"examples":[{"en":"The artist moulded the wax into a flower.","zh":"艺术家把蜡塑造成一朵花。"},{"en":"Her experiences moulded her into a confident leader.","zh":"她的经历把她塑造成了一位自信的领导者。"}]}],"synonyms":["shaped","formed","cast","fashioned","modeled"],"phonetic":"/ˈmoʊldɪd/","extraExplanation":["英式拼写是 mould / moulded；美式更常见 mold / molded。两者意思相同，只是拼写不同。","在英式英语里，mould 还可指“霉菌/发霉”（例如: food is covered in mould）。但 moulded 在这个拼写下更常见的是“被塑造/成型的”。"]}
{"word":"moulder","summary":{"en":"Moulder means to decay slowly (or cause something to decay). As a noun, it can mean a person who makes molds.","zh":"moulder 指慢慢腐烂/朽坏（或使其朽坏）；作名词可指制模工（制作模具的人）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to decay or rot slowly, especially from being left unused or in a damp place; to crumble gradually","zh":"（尤指因闲置或潮湿而）慢慢腐烂、发霉、朽坏；逐渐崩解"},"examples":[{"en":"Old books can moulder in a basement if the air is too damp.","zh":"如果地下室太潮湿，旧书会慢慢发霉朽坏。"},{"en":"The castle walls had mouldered over hundreds of years.","zh":"城堡的墙壁在几百年间逐渐风化崩坏。"},{"en":"His plans for the project were left to moulder in a drawer.","zh":"他对这个项目的计划被丢在抽屉里，渐渐无人问津。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to decay or deteriorate slowly","zh":"使（某物）慢慢腐烂/变质/恶化"},"examples":[{"en":"Moisture can moulder wooden furniture over time.","zh":"潮气会让木家具随着时间慢慢朽坏。"},{"en":"Neglect mouldered the once-beautiful garden.","zh":"疏于打理让曾经漂亮的花园逐渐荒败。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who makes or shapes molds (for casting metal, plastic, etc.); a mold maker","zh":"制模工；模具制造者（用于金属、塑料等浇铸/成型）"},"examples":[{"en":"The moulder prepared the sand mold for the casting.","zh":"制模工为浇铸准备了砂型。"},{"en":"She trained as a moulder in a small manufacturing shop.","zh":"她在一家小工厂受训成为制模工。"}]}],"synonyms":["decay","rot","decompose","crumble","deteriorate","waste away"],"phonetic":"/ˈmoʊldɚ/","extraExplanation":["英式拼写常见为 moulder，美式更常写作 molder；两者读音与意思基本相同。","这个词既可字面表示“腐烂、朽坏”，也常用作比喻，表示“被搁置、被遗忘而逐渐失去价值/影响”。在文学或新闻中常见于描写“古老建筑的衰败”或“理想与计划的荒废”。"]}
{"word":"mouldered","summary":{"en":"Mouldered means “decayed slowly or crumbled with age,” and it can also mean “left unused or neglected” (figurative).","zh":"mouldered 表示“缓慢腐朽、因久置而碎裂”，也可比喻“被搁置、荒废”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of moulder) to decay slowly, or to fall apart into dust because it is old or neglected.","zh":"（moulder 的过去式/过去分词）缓慢腐朽；因年代久远或被忽视而逐渐碎裂成粉末。"},"examples":[{"en":"The books had mouldered in a damp basement for years.","zh":"这些书在潮湿的地下室里放了多年，早已腐朽。"},{"en":"Leaves mouldered on the forest floor over winter.","zh":"冬天里，落叶在林地上慢慢腐烂分解。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) old and partly destroyed by decay; musty or crumbling.","zh":"（形容词）因腐朽而破败的；有霉味的；酥碎的。"},"examples":[{"en":"We found a mouldered wooden frame behind the shed.","zh":"我们在棚屋后面发现了一个腐朽的木框。"},{"en":"The room smelled of mouldered paper and dust.","zh":"房间里有腐朽纸张和灰尘的味道。"}]},{"partOfSpeech":"vi.","definition":{"en":"(figurative) to be left unused or ignored for a long time, losing value or freshness.","zh":"（比喻）长期被搁置或忽视，逐渐失去价值或活力。"},"examples":[{"en":"His talents mouldered because he never practiced.","zh":"他从不练习，才华渐渐荒废。"},{"en":"The project mouldered on a shelf until someone finally revived it.","zh":"这个项目一直被束之高阁，直到有人终于把它重新启动。"}]}],"synonyms":["decayed","rotted","crumbled","decomposed","deteriorated","languished"],"phonetic":"/ˈmoʊldərd/","extraExplanation":["“mouldered”多见于英式拼写（mould）。美式英语更常写作“moldered”。两者意思相同。","这个词常带有一种文学/叙述感，常用于描写潮湿环境中纸张、木头、布料的缓慢腐坏；也常用于比喻“才能、计划、希望被荒废”。"]}
{"word":"mouldering","summary":{"en":"Mouldering means slowly decaying or gradually falling into ruin; it’s also the -ing form of moulder/molder.","zh":"mouldering 指“缓慢腐烂、朽坏”或“逐渐破败”，也可作 moulder/molder 的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something organic) slowly decaying or rotting, often while sitting unused for a long time.","zh":"（多指有机物）缓慢腐烂、朽坏的；常含“长期放着不用而变坏”的意思。"},"examples":[{"en":"A mouldering pile of leaves lay in the corner of the yard.","zh":"院子角落里堆着一堆正在腐烂的落叶。"},{"en":"The mouldering wood gave off a damp smell.","zh":"朽坏的木头散发出潮湿的气味。"},{"en":"Old food left in the fridge can start mouldering quickly.","zh":"冰箱里放太久的食物可能很快就会开始腐坏。"}]},{"partOfSpeech":"adj.","definition":{"en":"gradually falling apart or breaking down because of age, neglect, or time (used for objects, buildings, papers, ideas, etc.).","zh":"（物品/建筑/文件等）因年代久远、疏于照料或时间流逝而逐渐破败、散架的。"},"examples":[{"en":"We found mouldering books in the basement.","zh":"我们在地下室发现了一些逐渐破败的书。"},{"en":"The mouldering house looked abandoned for years.","zh":"那栋破败的房子看起来荒废多年。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “moulder/molder”: to slowly decay or crumble.","zh":"“moulder/molder”的现在分词：慢慢腐烂；逐渐崩解。"},"examples":[{"en":"The apples were mouldering in the basket.","zh":"篮子里的苹果正在慢慢腐烂。"},{"en":"Without care, memories can start mouldering into silence.","zh":"如果不去珍惜，记忆也可能慢慢消散成沉默。"}]}],"synonyms":["decaying","rotting","crumbling","decomposing","deteriorating"],"phonetic":"/ˈmoʊldərɪŋ/","extraExplanation":["“mouldering”是英式拼写；美式更常写作“moldering”。两者读音与意思相同。","这个词常带有文学或画面感，常用来描写“被遗忘、潮湿、阴暗”的氛围（如废屋、旧书、落叶堆）。"]}
{"word":"moulders","summary":{"en":"“Moulders” most often means “decays slowly” (verb). It can also mean “people who make molds” (plural noun).","zh":"“moulders”最常用作动词，表示“缓慢腐朽/衰败”；也可作名词复数，指“制作模具的人”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) to decay or break down slowly over time, especially because it is old, damp, or not used","zh":"（动词第三人称单数）缓慢腐朽/衰败，常因年久、受潮或长期不用而逐渐损坏"},"examples":[{"en":"Old books moulder in the damp basement.","zh":"旧书在潮湿的地下室里慢慢发霉腐朽。"},{"en":"If the house stays empty, it moulders away year by year.","zh":"如果房子一直空着，它会一年年地逐渐破败。"},{"en":"He let his talents moulder instead of practicing.","zh":"他不练习，让自己的才能逐渐荒废。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) people whose job is to make molds used for shaping materials (like metal, plastic, or clay)","zh":"（名词复数）模具工；制作模具的人（用于塑形金属、塑料或陶土等）"},"examples":[{"en":"The factory hired experienced moulders to improve casting quality.","zh":"工厂雇用了有经验的模具工来提高铸造质量。"},{"en":"Moulders and machinists often work closely in manufacturing.","zh":"模具工和机加工人员在制造业中常常密切合作。"}]}],"synonyms":["decays","rots","deteriorates","crumbles","withers"],"phonetic":"/ˈmoʊldərz/","extraExplanation":["“moulders”是英式拼写；美式更常写作“molders”。两者读音和意思基本相同。","动词“moulder/molder”既可字面表示“腐朽、发霉”，也常用作比喻，表示“（能力、计划、希望等）被闲置而荒废”。","名词“moulder”在工业语境里指制作铸型/模具的人；在日常生活中更常见的是动词用法。"]}
{"word":"mouldery","summary":{"en":"Mouldery means moldy—having the smell, taste, or appearance of mold, often from dampness.","zh":"mouldery 指“有霉味/长霉的”，多因潮湿导致，英式拼写，美式常写作 moldy。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Smelling or tasting like mold; slightly rotten or stale because of dampness and age.","zh":"有霉味的；因潮湿和放久而略微腐败、变陈旧的。"},"examples":[{"en":"The bread had a mouldery smell, so we threw it away.","zh":"面包有股霉味，所以我们把它扔了。"},{"en":"The old basement felt damp and mouldery.","zh":"旧地下室感觉又潮又有霉味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Covered with mold; moldy in appearance.","zh":"长霉的；表面带霉斑的。"},"examples":[{"en":"We found mouldery books in the back of the closet.","zh":"我们在壁橱深处发现了长霉的书。"},{"en":"Keep clothes dry so they don’t become mouldery.","zh":"把衣服保持干燥，免得长霉。"}]}],"synonyms":["moldy","musty","stale","damp-smelling"],"phonetic":"/ˈmoʊldəri/","extraExplanation":["“mouldery”是英式拼写（mould）。美式英语更常用“moldy”。两者意思相同，只是拼写风格不同。","这个词常用来形容气味（mouldery smell）或环境（mouldery room），语气通常偏负面，暗示潮湿、不卫生或需要清理。"]}
{"word":"mouldier","summary":{"en":"Mouldier is a rare spelling related to molder/moulder: either a person who molds materials, or (more commonly as a verb) to decay slowly over time.","zh":"mouldier 是与 molder/moulder 相关的罕见拼写：可指“做模塑的人”，也可指（更常见的动词义）“慢慢腐朽/衰败”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/variant spelling) a person who makes things by shaping a soft material in a mold; a maker of molded objects.","zh":"（罕见/变体拼写）用模具或手工塑形软材料的人；模塑制品的制作者。"},"examples":[{"en":"The mouldier shaped the clay into bowls before firing them.","zh":"这位模塑匠在烧制前把黏土塑成碗。"},{"en":"In older records, the mouldier is listed among the workshop workers.","zh":"在较早的记录里，“mouldier”被列为作坊工人之一。"}]},{"partOfSpeech":"v.","definition":{"en":"(Usually spelled molder/moulder) to slowly decay, rot, or crumble; to deteriorate over time.","zh":"（通常拼作 molder/moulder）慢慢腐烂、风化、碎裂；随时间逐渐变坏。"},"examples":[{"en":"Old papers can molder in a damp basement.","zh":"旧文件在潮湿的地下室里会慢慢霉烂。"},{"en":"The wooden fence began to molder after years of rain.","zh":"木栅栏经历多年雨淋后开始腐朽。"},{"en":"Don’t let your skills molder—keep practicing.","zh":"别让你的技能荒废——继续练习。"}]}],"synonyms":["molder","moulder","mold-maker","decay","rot","deteriorate"],"phonetic":"/ˈmoʊldər/","extraExplanation":["“mouldier”在现代英语中非常少见，更多时候你会看到：名词用“molder / moulder”（做模具的人），动词用“molder / moulder”（腐朽、衰败）。英式英语更常见拼写“moulder”。","它也容易被误读成“soldier（士兵）”，但意思完全不同。"]}
{"word":"mouldies","summary":{"en":"“Mouldies” is an informal word for moldy things (often spoiled food) and can also function as a plural description meaning “moldy” (UK spelling).","zh":"“mouldies”是非正式说法，指一堆发霉的东西（常是变质食物）；也可作复数描述，相当于“发霉的”（英式拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Moldy things, especially food that has gone bad and grown mold.","zh":"（非正式）发霉的东西，尤其是变质长霉的食物。"},"examples":[{"en":"Throw those mouldies away before they make the fridge smell.","zh":"把那些发霉的东西扔掉，不然冰箱会有味道。"},{"en":"I found some mouldies at the back of the bread bag.","zh":"我在面包袋后面发现了一些发霉的东西。"}]},{"partOfSpeech":"adj.","definition":{"en":"Plural form used to describe multiple items that are moldy (UK spelling of “moldy”).","zh":"用于描述多个“发霉的”物品的复数形式（英式拼写，对应美式“moldy”）。"},"examples":[{"en":"The mouldies apples need to go in the trash.","zh":"那些发霉的苹果得扔掉。"},{"en":"Don’t mix clean clothes with mouldies towels.","zh":"别把干净衣服和发霉的毛巾放一起。"}]}],"synonyms":["moldy stuff","moldy food","spoiled food","moldy leftovers"],"phonetic":"/ˈmoʊldiːz/","extraExplanation":["“mould”是英式拼写，“mold”是美式拼写；“mouldies”多见于口语/随意表达，常指“发霉的那堆东西”。","在更正式的英语里，通常说“moldy food/leftovers”或“moldy items”，而不是“mouldies”。"]}
{"word":"mouldiest","summary":{"en":"“Mouldiest” means “the most mouldy” (most covered in mould), and can also mean “the most outdated or stale” in a figurative sense.","zh":"“mouldiest”意为“最发霉的”，也可比喻“最陈旧/最老套的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “mouldy”: having the most mould (fungus) on it; most spoiled or musty.","zh":"“mouldy”的最高级：最发霉的；（因霉菌而）最变质的、最有霉味的。"},"examples":[{"en":"This is the mouldiest bread in the bag—don’t eat it.","zh":"这是袋子里最发霉的面包——别吃。"},{"en":"The mouldiest corner of the bathroom needs cleaning.","zh":"浴室最发霉的角落需要清理。"},{"en":"Throw away any mouldiest fruit to stop the rest from going bad.","zh":"把最发霉的水果扔掉，免得其他的也坏掉。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, informal) The most outdated, stale, or old-fashioned (ideas, jokes, habits).","zh":"（比喻，非正式）最陈旧的、最过时的、最老套的（想法/笑话/习惯等）。"},"examples":[{"en":"He still tells the mouldiest jokes from the 1990s.","zh":"他还在讲90年代那些最老套的笑话。"},{"en":"That rule feels like the mouldiest part of the policy.","zh":"那条规定感觉是这项政策里最陈旧的一部分。"}]}],"synonyms":["most mouldy","most moldy (US)","stale","musty","outdated"],"phonetic":"/ˈmoʊldiɪst/","extraExplanation":["“mouldiest”是英式拼写（mouldy 的最高级）。美式英语通常写作“moldiest”。","字面意思指“长霉最多”，常用于食物、墙角、浴室等潮湿处；比喻用法带一点吐槽语气，表示“陈腐、老掉牙”。"]}
{"word":"mouldiness","summary":{"en":"Mouldiness means the condition of being moldy (or a musty smell), and it can also describe something figuratively as stale or old-fashioned.","zh":"mouldiness 指“发霉/霉味的状态”，也可比喻形容“陈腐、守旧、缺乏新意”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state or condition of being moldy; the presence or smell of mold, often caused by dampness or poor ventilation.","zh":"发霉的状态；霉菌的存在或霉味，常由潮湿或通风不良引起。"},"examples":[{"en":"The mouldiness in the basement got worse after the heavy rain.","zh":"暴雨后，地下室的霉味更重了。"},{"en":"We threw away the bread because of its mouldiness.","zh":"因为面包发霉了，我们把它扔掉了。"},{"en":"Open the windows to reduce mouldiness in the room.","zh":"打开窗户以减少房间里的霉味和霉菌。"}]},{"partOfSpeech":"n.","definition":{"en":"A musty, old-fashioned, or stale quality in a place, idea, or style (often used figuratively).","zh":"（常作比喻）陈腐、守旧或缺乏新意的感觉（用于场所、观念或风格）。"},"examples":[{"en":"The office had a mouldiness that made it feel stuck in the past.","zh":"这间办公室有种陈旧感，让人觉得它停留在过去。"},{"en":"Some critics said the film suffered from mouldiness in its storytelling.","zh":"一些评论家说这部电影的叙事方式显得陈腐。"}]}],"synonyms":["moldiness","mustiness","dampness","staleness"],"phonetic":"/ˈmoʊldinəs/","extraExplanation":["英式拼写是 mouldiness，美式拼写更常见的是 moldiness。两者意思相同。","字面义多与潮湿环境有关：例如墙角、地下室、浴室、旧衣柜等；比喻义则用来形容“观念/做法老套”。"]}
{"word":"moulding","summary":{"en":"Moulding usually means decorative trim in buildings, and it can also mean the process of shaping material in a mold.","zh":"moulding 通常指建筑中的装饰线条/收边饰条，也可指用模具进行的模塑成型过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shaped strip of material (often wood, plaster, or plastic) used to decorate or finish the edges where surfaces meet, such as around doors, windows, ceilings, or walls.","zh":"（装饰）线条/饰条：常见于木材、石膏或塑料制成的成型条，用于装饰或收边，例如门窗框、天花板与墙面交界处。"},"examples":[{"en":"They added crown moulding to make the living room look more elegant.","zh":"他们加装了顶角线条，让客厅看起来更典雅。"},{"en":"The painter taped along the moulding to keep the edges neat.","zh":"油漆工沿着饰条贴胶带，让边缘更整齐。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of shaping something in a mold; forming material into a particular shape.","zh":"模塑/成型：用模具把材料塑造成特定形状的过程。"},"examples":[{"en":"Plastic moulding is used to produce parts in large quantities.","zh":"塑料模塑用于大量生产零部件。"},{"en":"The workshop specializes in metal moulding for small machines.","zh":"这家工坊专做小型机械用的金属成型。"}]}],"synonyms":["trim","molding","ornamental trim","casting (manufacturing context)","forming"],"phonetic":"/ˈmoʊldɪŋ/","extraExplanation":["英式拼写多用 moulding，美式拼写通常是 molding；意思相同，但在美国装修语境里更常看到 “crown molding / baseboard molding”。","在建筑与室内设计中，moulding 常指“装饰线条/收边条”；在制造业语境中，moulding 更偏“模塑/成型工艺”。可通过上下文（房屋装修 vs. 工厂生产）来判断。"]}
{"word":"mouldings","summary":{"en":"Mouldings usually means decorative building trim; it can also mean the process or products of molding materials.","zh":"mouldings 通常指建筑装饰线脚；也可指材料的模制过程或模制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative strips of material (often wood, plaster, or plastic) used to add detail to edges, corners, ceilings, doors, windows, or walls in a building.","zh":"（建筑中的）线脚；装饰线条（常为木、灰泥或塑料，用于天花板、门窗、墙面边缘等处的装饰与收边）。"},"examples":[{"en":"The living room looks more elegant with crown mouldings along the ceiling.","zh":"天花板加了顶角线脚（crown mouldings）后，客厅看起来更典雅。"},{"en":"They replaced the old window mouldings after water damage.","zh":"窗边线脚因进水受损后，他们把旧的线脚换掉了。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of shaping something by using a mold; the act of forming material into a particular shape.","zh":"模制；浇铸（用模具把材料塑形成某种形状的过程）。"},"examples":[{"en":"The factory specializes in mouldings for plastic parts.","zh":"这家工厂专门做塑料零件的模制加工。"},{"en":"During mouldings, the material is pressed into a mold and then cooled.","zh":"在模制过程中，材料被压入模具，然后冷却定型。"}]}],"synonyms":["trim","molding","decorative trim","architectural trim"],"phonetic":"/ˈmoʊldɪŋz/","extraExplanation":["在美式英语里更常写作 molding /ˈmoʊldɪŋ/；英式英语常用 moulding。含义相同，只是拼写差异。","常见的建筑线脚名称：crown moulding（顶角线脚）、baseboard moulding（踢脚线）、door/window casing（门窗套线）、chair rail（护墙板上沿线）。"]}
{"word":"mouldmade","summary":{"en":"“Mouldmade” means made using a mold, especially traditional mold-made paper used for fine printing and art.","zh":"“mouldmade”指用模具成形制作的，尤指传统纸模成形的高品质造纸（常见于精美印刷与艺术用纸）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made using a mold (a shaped form), rather than being cut, woven, or machine-formed; often used about paper made on a mold in traditional papermaking.","zh":"用模具（成型器）制作的；常用于造纸领域，指用纸模成形的传统手工纸（区别于机器造纸）。"},"examples":[{"en":"This book is printed on mouldmade paper, which has a rich, textured feel.","zh":"这本书使用了mouldmade纸印刷，手感厚实、有纹理。"},{"en":"The artist chose mouldmade sheets for the watercolor work because they absorb pigment well.","zh":"艺术家选择了mouldmade纸来画水彩，因为它吸收颜料效果好。"},{"en":"Collectors often prefer mouldmade paper for fine editions and archival prints.","zh":"收藏者常更偏好mouldmade纸，用于精装限量版和可长期保存的版画。"}]}],"synonyms":["mold-made","mould-made","formed in a mold","mold-formed"],"phonetic":"/ˈmoʊldˌmeɪd/","extraExplanation":["“mouldmade”也常写作“mould-made”（美式有时写“mold-made”）。在造纸语境中，它通常介于“handmade（纯手工纸）”与“machine-made（机器纸）”之间：纸浆在纸模上成形，因此往往会有自然的边缘（deckle edge，毛边/水边）和较强的质感。","出版与艺术印刷里常提到mouldmade paper：它通常更厚实、耐久、适合水彩、版画与高品质书籍用纸。"]}
{"word":"moulds","summary":{"en":"“Moulds” can mean kinds of mold (fungus), shaping forms (molds), or the verb “mould” meaning to shape or influence.","zh":"“moulds”可指（1）各种霉菌/霉（复数），（2）模具（复数），也可作动词表示“塑造、使成形、影响”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Types or growths of mold: a soft, fuzzy fungus that can grow on food or in damp places.","zh":"（名词复数）霉菌/霉：一种柔软、绒毛状的真菌，常在食物或潮湿处生长。"},"examples":[{"en":"Different moulds can grow on bread if it’s left out too long.","zh":"面包放太久会长出不同种类的霉。"},{"en":"The lab studies moulds that affect crops.","zh":"实验室研究影响农作物的霉菌。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Forms or frames used to shape a material (like plastic, chocolate, or metal).","zh":"（名词复数）模具：用来给材料（如塑料、巧克力或金属）定型的模子/框架。"},"examples":[{"en":"The factory uses steel moulds to make car parts.","zh":"工厂用钢制模具制造汽车零件。"},{"en":"She poured melted chocolate into small moulds.","zh":"她把融化的巧克力倒进小模具里。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb) Forms or shapes something; influences how something develops.","zh":"（动词）塑造、使成形；影响……的发展。"},"examples":[{"en":"Experience moulds our attitudes over time.","zh":"经验会随着时间塑造我们的态度。"},{"en":"He moulds the clay into a bowl.","zh":"他把黏土捏成一个碗。"}]}],"synonyms":["molds","fungi","mildew","forms","casts","shapes"],"phonetic":"/moʊldz/","extraExplanation":["“moulds”是英式拼写；美式英语更常写作“molds”。两者意思相同，只是拼写习惯不同。","注意区分：mould/mold（霉菌）常用于潮湿、食物变质的语境；mould/mold（模具）多用于制造业、烘焙与手工艺。"]}
{"word":"mouldwarp","summary":{"en":"“Mouldwarp” is a rare technical term meaning a mold’s warping/distortion (or the act of warping a mold).","zh":"“mouldwarp”是较少见的技术用语，指模具/铸型的翘曲变形，或使其变形的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/technical) warping or distortion of a mold (especially in casting or forming), often caused by heat, pressure, or moisture.","zh":"（罕见/技术用语）模具的翘曲、变形（尤指铸造或成型时的模具），常由高温、压力或湿气引起。"},"examples":[{"en":"The technician inspected the pattern for mouldwarp before pouring the metal.","zh":"技师在浇注金属前检查模型是否有模具翘曲变形。"},{"en":"Excess moisture in the sand can lead to mouldwarp and poor surface finish.","zh":"砂型含水过多会导致模具变形，并使表面质量变差。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to cause a mold to warp; to deform during molding/casting.","zh":"（罕见）使模具翘曲；在成型/铸造过程中发生变形。"},"examples":[{"en":"Overheating can mouldwarp thin sections of the mold.","zh":"过热会使模具的薄弱部位发生翘曲变形。"},{"en":"The frame was uneven, and the mold began to mouldwarp during cooling.","zh":"框架不平整，冷却时模具开始变形。"}]}],"synonyms":["mold warpage","warping of the mold","distortion","deformation"],"phonetic":"ˈmoʊldˌwɔrp","extraExplanation":["“mouldwarp”并不是现代英语里常见的标准词，更像是工程/工艺语境中把“mould（英式拼写；美式为 mold）+ warp（翘曲/变形）”合在一起的写法。有些资料会直接写成“mold warpage / mold warp / warping of the mold”。","如果你是在某段文本、图纸或材料说明里看到它，建议同时核对上下文是否指：模具变形（warpage）、铸型走样（distortion）、或材料冷却收缩造成的翘曲（warping）。"]}
{"word":"mouldy","summary":{"en":"Mouldy means “covered with mould” or “smelling stale/old like mould,” often due to dampness or age.","zh":"mouldy 指“发霉的/长霉的”，也可指“有霉味、陈旧不清新”的（常因潮湿或放久了）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with mould (a type of fungus), usually because it has been kept too long in a warm or wet place; not fresh.","zh":"发霉的；长霉菌的（通常因受潮或放久了而不新鲜）。"},"examples":[{"en":"The bread smells mouldy—don’t eat it.","zh":"这面包有霉味——别吃。"},{"en":"We threw away the mouldy fruit.","zh":"我们把发霉的水果扔掉了。"},{"en":"The room felt damp and mouldy.","zh":"房间感觉又潮又有霉味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having an unpleasant, stale smell or feeling, like something old and neglected (often used about rooms, clothes, or books).","zh":"（气味/感觉）陈腐的；有霉味的；带有久放不管的味道（常形容房间、衣物或书）。"},"examples":[{"en":"The old coat has a slightly mouldy smell.","zh":"这件旧外套有点霉味。"},{"en":"The library basement was dark and mouldy.","zh":"图书馆地下室又暗又有霉味。"}]}],"synonyms":["moldy","musty","stale","damp"],"phonetic":"/ˈmoʊldi/","extraExplanation":["英式拼写是 mouldy；美式更常写作 moldy，但含义相同。","mould / mold 指“霉菌”。它不仅会出现在食物上，也常出现在潮湿环境的墙角、浴室或地下室。日常表达里，mouldy 除了“发霉的”，也常用来形容“陈旧、不清新”的气味或环境。"]}
{"word":"moule","summary":{"en":"Moule can mean a food mold (a shaping container), or—often as French plural *moules*—mussels as a dish.","zh":"moule 可指（烹饪用）模具；也可（常以法语复数 moules 出现）指贻贝/青口这道菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mold or shaped container used to form food (or other material) into a particular shape","zh":"（烹饪等用的）模具；（把食物或材料塑形的）模子"},"examples":[{"en":"She poured the chocolate into a moule to make heart-shaped candies.","zh":"她把巧克力倒进模具里，做成心形糖果。"},{"en":"Grease the moule before adding the batter.","zh":"倒入面糊前先在模具上抹点油。"}]},{"partOfSpeech":"n.","definition":{"en":"(from French, usually plural *moules*) mussels, especially as a dish","zh":"（源自法语，常用复数 moules）贻贝；（尤指一道菜的）青口/淡菜"},"examples":[{"en":"We ordered moules marinières with fries.","zh":"我们点了白酒蒜香煮青口，配薯条。"},{"en":"This restaurant is famous for its moules in creamy sauce.","zh":"这家餐厅的奶油汁青口很有名。"}]}],"synonyms":["mold","mould","form","ramekin (sometimes)","mussels (as food: moules)"],"phonetic":"/mul/","extraExplanation":["“moule”在英语里多见于烹饪语境，来自法语。餐厅菜单上更常见的是复数“moules”，比如经典的比利时/法国菜“moules-frites（青口配薯条）”。在日常英语中，“mold/mould”比“moule”更常用。"]}
{"word":"moulin","summary":{"en":"“Moulin” most commonly means a meltwater shaft in a glacier; it can also mean “mill” in French, often used in names like “Moulin Rouge.”","zh":"“moulin”最常指冰川中的融水竖井（融水洞）；也可作法语借词表示“磨坊”，常见于如“Moulin Rouge（红磨坊）”等名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Glaciology) A vertical shaft or tunnel in a glacier formed by meltwater, through which water drains down into the ice.","zh":"（冰川学）冰川内由融水形成的垂直竖井/水洞，融水会从这里向下排入冰体内部或冰川底部。"},"examples":[{"en":"In summer, meltwater can carve a deep moulin in the glacier.","zh":"夏季融水可能在冰川中刻出很深的融水洞（moulin）。"},{"en":"The researchers lowered a sensor into the moulin to measure water flow.","zh":"研究人员把传感器放入融水洞中测量水流。"}]},{"partOfSpeech":"n.","definition":{"en":"A mill (from French), often seen in names or cultural references.","zh":"磨坊/风车房（源自法语），常出现在地名、人名或文化名称中。"},"examples":[{"en":"They ate at a restaurant called Le Moulin.","zh":"他们在一家名为“Le Moulin（磨坊）”的餐厅用餐。"},{"en":"“Moulin Rouge” literally means “Red Mill.”","zh":"“Moulin Rouge”直译是“红磨坊”。"}]}],"synonyms":["glacial shaft","meltwater shaft","ice shaft","mill (French sense)"],"phonetic":"/ˈmuːlɪn/","extraExplanation":["“Moulin”是法语“磨坊”的意思。英语里最常见的两个语境是：①冰川地貌（指冰川中的融水竖井）；②文化/专有名词（如巴黎的“Moulin Rouge/红磨坊”，常被保留法语拼写与风格）。在冰川语境中，它通常作为普通名词使用：a moulin / the moulin。"]}
{"word":"moulinage","summary":{"en":"Moulinage is a textile term for twisting/combining fibers (often silk) into yarn or thread.","zh":"Moulinage 是纺织术语，指（常为丝）纤维/长丝的加捻合股成纱线或线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Textiles) The process of twisting or combining fibers/filaments (especially silk) to make yarn or thread; also the resulting twisted yarn.","zh":"（纺织）将纤维/长丝（尤指丝）加捻、合股以制成纱线或线的过程；也可指加捻后的纱线。"},"examples":[{"en":"The factory specializes in silk moulinage for high-end scarves.","zh":"这家工厂专做用于高端围巾的丝绸加捻（moulinage）。"},{"en":"Different moulinage settings produce yarns with different strength and shine.","zh":"不同的加捻设置会让纱线呈现不同的强度和光泽。"}]}],"synonyms":["twisting","plying","yarn twisting","thread making"],"phonetic":"/ˌmuːlɪˈnɑːʒ/","extraExplanation":["这是一个借自法语的行业词，常见于纺织、制丝与纱线工艺语境。一般读者在日常英语里很少见到，多出现在技术资料、产品说明或工艺介绍中。","在纺织里，moulinage 强调“加捻/合股”的工序：通过扭转或把多股长丝合并，使纱线更结实、手感或光泽更符合需求。"]}
{"word":"moulinet","summary":{"en":"Moulinet most commonly means a circular sword movement in fencing; it can also mean a food-mashing/puréeing tool in cooking.","zh":"moulinet 常指击剑中的“绕剑圆周动作”；也可指烹饪中用于捣泥/研磨的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Fencing) a circular movement of the sword (often with the wrist) used to build momentum or change the line of attack.","zh":"（击剑）“环绕挥剑/绕剑动作”：用手腕带动剑做圆周运动，以增加力量或改变进攻线路。"},"examples":[{"en":"The coach told her to use a quick moulinet to keep the opponent’s blade away.","zh":"教练让她用一个快速的绕剑动作，把对手的剑拨开。"},{"en":"His moulinet looked smooth, but his timing was late.","zh":"他的绕剑动作很流畅，但时机偏晚。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool or device for grinding, mashing, or puréeing food (especially in older or French-influenced cooking contexts).","zh":"（烹饪）研磨器/捣泥器：用于研碎、捣泥或做成泥状的工具（常见于较旧或法式语境）。"},"examples":[{"en":"She used a hand moulinet to purée the cooked vegetables.","zh":"她用手动捣泥器把煮熟的蔬菜打成泥。"},{"en":"A moulinet can make a smoother soup without a blender.","zh":"不用搅拌机，捣泥器也能让汤更细腻。"}]}],"synonyms":["circular cut","circular motion","food mill","masher"],"phonetic":"/ˌmuːlɪˈneɪ/","extraExplanation":["这个词来自法语 *moulin*（“磨坊/风车/水车”）的相关形式，带有“像小磨坊一样旋转”的意象，所以在击剑里指“绕圈挥动”，在烹饪里也常指“通过旋转/挤压来研磨、捣碎”的器具。","在英语里它属于较少见、偏专业或偏法式的词；日常表达中，击剑语境更常直接说 *circular cut/motion*，烹饪语境可能会说 *food mill*、*masher* 或 *purée*（动词）。"]}
{"word":"moulins","summary":{"en":"“Moulins” most commonly means glacier shafts (plural of moulin); it can also be French for “mills,” or the name of a town in France.","zh":"“moulins”最常见指冰川竖井（moulin 的复数）；也可作法语“磨坊/工厂（mills）”，或法国城镇名 Moulins。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “moulin”: a vertical (often round) shaft in a glacier formed by surface meltwater drilling downward; the water flows into the glacier’s drainage system.","zh":"“moulin”的复数：冰川中的“冰臼/冰川竖井”，由地表融水向下侵蚀钻入形成，融水会流入冰川内部的排水系统。"},"examples":[{"en":"In summer, meltwater can carve moulins that carry water deep into the glacier.","zh":"在夏季，融水会侵蚀出冰臼，把水带到冰川深处。"},{"en":"Researchers measured the sound of water rushing through the moulins.","zh":"研究人员测量了水流穿过冰臼时的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"(French) “mills”; sometimes used in English when referring to French names, signs, or contexts.","zh":"（法语）“磨坊/工厂（mills）”；在英语里有时用于涉及法语名称、标识或语境时。"},"examples":[{"en":"The old map labels the area as “Les Moulins” near the river.","zh":"旧地图把河边那片区域标注为“Les Moulins（磨坊区）”。"},{"en":"We passed several houses named “Aux Moulins.”","zh":"我们路过几栋名为“Aux Moulins”的房子。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper noun in French geography: “Moulins,” a town in central France (Allier).","zh":"法国语地名专有名词：Moulins（穆兰），法国中部阿列省的一座城镇。"},"examples":[{"en":"She took a train from Paris to Moulins.","zh":"她从巴黎坐火车去了穆兰（Moulins）。"}]}],"synonyms":["glacial shaft(s)","glacier pothole(s)"],"phonetic":"/ˈmuːlɪnz/","extraExplanation":["在英语里，冰川术语 moulin 借自法语，字面原意是“磨坊”。早期人们觉得冰川竖井里水流旋转、轰鸣的样子像磨坊在运作，于是沿用了这个词。","读地名 Moulins 时，英语里常用接近 /muːˈlɛnz/ 的读法；在法语中鼻化元音更明显，听起来会更像“moo-LAN(带鼻音)”。"]}
{"word":"moulleen","summary":{"en":"“Moulleen” is not a standard English word; it is likely a misspelling of “mullein,” a fuzzy-leaved plant often mentioned in herbal and folk contexts.","zh":"“moulleen”不是标准英文词，通常是“mullein”的误拼：一种叶子有绒毛的植物，常出现在草药与民俗语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of) mullein: a tall wild plant with soft, fuzzy leaves and a long spike of yellow flowers. It has been used in traditional herbal remedies, especially for coughs and throat irritation.","zh":"（很可能是拼写错误，正确拼法为）mullein：一种高大的野生植物，叶子柔软有绒毛，开黄色小花成穗状。传统草药中常用于缓解咳嗽、喉咙不适等。"},"examples":[{"en":"Mullein has fuzzy leaves that feel almost like felt.","zh":"mullein 的叶子有绒毛，摸起来几乎像毛毡。"},{"en":"Some people drink mullein tea when they have a sore throat.","zh":"有些人喉咙痛时会喝 mullein 茶。"}]}],"synonyms":["mullein"],"phonetic":"ˈmʌlɪn","extraExplanation":["“mullein”常被误拼成 *moulleen / mullein / mulleyn* 等。标准拼法是 **mullein**。","在英语文化里它也常被叫作 **“cowboy toilet paper”**（牛仔厕纸），因为叶子又大又软，早期户外生活中会被拿来擦拭。"]}
{"word":"moulrush","summary":{"en":"“Moulrush” is not a standard English word; it’s probably a misspelling (possibly “bulrush” or “moult”).","zh":"“moulrush”不是标准英语词，更可能是拼写错误（可能想写“bulrush”或“moult”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username. Common close matches include “bulrush” (a tall marsh plant) or “moult” (to shed feathers/hair).","zh":"不是标准英语单词，更可能是拼写错误或名字/用户名。常见的相近词包括“bulrush”（芦苇/灯心草等湿地高草）或“moult”（鸟类/动物蜕羽、换毛）。"},"examples":[{"en":"I couldn’t find “moulrush” in a dictionary—did you mean “bulrush” or “moult”?","zh":"我在词典里找不到“moulrush”——你想写的是“bulrush”还是“moult”吗？"},{"en":"If you tell me the sentence you saw it in, I can help identify the correct word.","zh":"如果你把它出现的句子发我，我可以帮你判断正确的词。"}]}],"synonyms":["bulrush","reed","cattail","moult"],"phonetic":"ˈmoʊlˌrʌʃ","extraExplanation":["“bulrush”常出现在自然描写中，指湿地边生长的高大草本植物（在不同地区也可能泛指“reeds/cattails”等）。","如果你的意思是“moult”，它多用于鸟类换羽或动物换毛：Birds moult in late summer.（鸟类在夏末换羽。）"]}
{"word":"mouls","summary":{"en":"“Moult” means to shed feathers/hair/skin; it can also mean “many” in old-fashioned literary English.","zh":"“moult”常指（动物）蜕毛/蜕皮；在古旧文学英语中也可表示“许多/大量”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended word) to shed old feathers, hair, or skin and grow new ones.","zh":"（你可能想查的是）蜕毛；蜕皮（脱落旧的羽毛、毛发或皮肤并长出新的）。"},"examples":[{"en":"Many birds moult after the breeding season.","zh":"许多鸟会在繁殖季结束后换羽（蜕毛）。"},{"en":"The snake moulted its skin overnight.","zh":"那条蛇一夜之间蜕了皮。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) many; a great amount (often used to sound old-fashioned).","zh":"（古旧/文学用法）许多；大量（常用来营造古风语气）。"},"examples":[{"en":"He has moult troubles and cares.","zh":"他有许多烦恼与忧虑。"},{"en":"There are moult reasons to be patient.","zh":"有许多理由要保持耐心。"}]}],"synonyms":["shed","slough","cast off"],"phonetic":"/moʊlt/","extraExplanation":["“mouls”本身不是常见的标准英语拼写。最接近、最常见的可能是：\n1) “moults”= “moult”的第三人称单数（He/She moults.）或名词复数（rare）；\n2) “moles”（痣/鼹鼠/摩尔）或 “molds”（霉菌/模具），取决于你的语境。\n如果你把原句发我，我可以帮你确认到底想查哪个词。"]}
{"word":"moult","summary":{"en":"Moult means to shed and replace feathers, hair, skin, or an outer layer; it can also mean the shedding period itself.","zh":"moult 指（动物）换羽、蜕皮、脱毛等“脱旧换新”的过程，也可指换羽/蜕皮等时期。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of birds) to lose old feathers and grow new ones; to shed feathers.","zh":"（鸟类）换羽；脱落旧羽毛并长出新羽毛。"},"examples":[{"en":"Many birds moult after the breeding season.","zh":"许多鸟会在繁殖季结束后换羽。"},{"en":"The duck is moulting, so it can’t fly well right now.","zh":"这只鸭正在换羽，所以现在飞得不太好。"}]},{"partOfSpeech":"v.","definition":{"en":"To shed old skin, hair, or an outer layer and replace it with a new one (often used for animals such as snakes, insects, and dogs).","zh":"（动物）蜕皮；脱毛；脱去旧的外层并长出新的（常用于蛇、昆虫、狗等）。"},"examples":[{"en":"Snakes moult their skin as they grow.","zh":"蛇在生长过程中会蜕皮。"},{"en":"Our dog moults heavily in spring.","zh":"我们家的狗在春天掉毛很厉害。"}]},{"partOfSpeech":"n.","definition":{"en":"The process or period of shedding and replacing feathers, hair, or skin.","zh":"换羽期；蜕皮期；脱毛期（指这一过程或时期）。"},"examples":[{"en":"During the moult, the bird may look patchy and scruffy.","zh":"在换羽期，鸟可能看起来羽毛一块块地缺、很邋遢。"}]}],"synonyms":["molt","shed","slough (off)","cast"],"phonetic":"/moʊlt/","extraExplanation":["“moult”在英式拼写中常见；美式英语里更常写作“molt”。意思相同，只是拼写不同。","在鸟类学里，换羽（moult/molt）是重要的季节性现象：许多鸟会在繁殖季后或迁徙前后换羽，以更新羽毛、保持保温与飞行效率。"]}
{"word":"moulted","summary":{"en":"“Moulted” means “shed old feathers/fur/skin” (or figuratively, “cast off an old image”). It’s the British spelling of “molted.”","zh":"“moulted”表示“换羽/蜕皮/蜕壳”，也可比喻“摆脱旧形象”。它是美式“molted”的英式拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “moult/molt”: to shed old feathers, fur, or skin so new growth can replace it","zh":"“moult/molt”的过去式/过去分词：蜕去旧的羽毛、毛发或皮肤，以便长出新的"},"examples":[{"en":"The duck moulted its feathers in late summer.","zh":"这只鸭子在夏末换羽了。"},{"en":"After it moulted, the crab had a soft new shell.","zh":"螃蟹蜕壳后，新壳会变得很软。"},{"en":"The snake had moulted, leaving its skin behind.","zh":"蛇蜕皮了，留下了一层旧皮。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to leave an old role, habit, or image behind and become different","zh":"（比喻）摆脱旧的角色、习惯或形象，变得不同"},"examples":[{"en":"He moulted his shy image and became more confident.","zh":"他摆脱了害羞的形象，变得更自信。"},{"en":"The company moulted its old style to attract younger customers.","zh":"公司抛弃了旧风格，以吸引更年轻的顾客。"}]}],"synonyms":["shed","slough","cast off","discard"],"phonetic":"/ˈmoʊltɪd/","extraExplanation":["“moulted”是英式拼写；美式更常写作“molted”。两者意思相同，发音也基本一致。","在生物学里，moult/molt常用来描述鸟类“换羽”、昆虫和甲壳类“蜕皮/蜕壳”。蜕壳后的阶段往往更脆弱（例如螃蟹新壳很软）。"]}
{"word":"moulten","summary":{"en":"“Molten” means melted by heat, especially for metal or rock.","zh":"“Molten”指因高温而熔化成液体的状态，常用于金属或岩石（如熔岩）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Liquefied by heat; melted (usually used for metals, rock, or glass).","zh":"因高温而液化的；熔化的（常用于金属、岩石或玻璃）。"},"examples":[{"en":"The volcano released molten lava down the mountain.","zh":"火山喷出熔岩，沿着山坡流下。"},{"en":"Molten steel is poured into molds to make beams.","zh":"熔融钢被倒入模具中来制造钢梁。"}]}],"synonyms":["melted","liquid","liquefied"],"phonetic":"/ˈmoʊltən/","extraExplanation":["你输入的“moulten”通常是拼写错误，正确拼写是“molten”。","“molten”多用于科学或新闻语境（如火山、冶炼），比日常的“melted”更正式、更强调“被加热到变成液体”的状态。","词源上与“melt（融化）”同源；在现代英语里它主要作为形容词使用。"]}
{"word":"moulter","summary":{"en":"Moulter is a rare word meaning an animal that is molting, and it is also an uncommon spelling variant of “molter” (from moult/molt).","zh":"moulter 是个很少见的词，指正在换羽/蜕皮的动物；也可作 molter 的少见拼写变体（源自动词 moult/molt）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) An animal that is molting—shedding old feathers, fur, or skin; also a person/thing that molts.","zh":"（罕见）正在换羽/蜕皮的动物；也可指“会蜕变/脱落旧外层的人或事物”。"},"examples":[{"en":"In late summer, many ducks are moulters and may be temporarily unable to fly well.","zh":"在夏末，许多鸭子会处于换羽期，可能会暂时不太会飞。"},{"en":"The crab was a moulter, hiding while its new shell hardened.","zh":"那只螃蟹正在蜕壳，躲起来等新壳变硬。"}]},{"partOfSpeech":"other","definition":{"en":"A less common spelling of “molter,” from the verb “moult” (to shed feathers/fur/skin).","zh":"“molter”的较少见拼写形式，来自动词“moult”（换羽/蜕皮/脱落旧皮毛）。"},"examples":[{"en":"Some older or British-influenced texts use the spelling moulter instead of molter.","zh":"一些较旧或受英式拼写影响的文本会用 moulter，而不是 molter。"}]}],"synonyms":["molter","(related) molting animal","(related) moulting animal"],"phonetic":"ˈmoʊltər","extraExplanation":["在现代英语里，更常见的是动词 **moult**（英式）/ **molt**（美式），以及名词 **molter**（“正在蜕皮/换羽的个体”）。**moulter** 属于非常少见的变体拼写，也可能出现在姓氏中。","生物学语境里，molt/moult 常用于鸟类换羽、蛇蜕皮、甲壳类动物蜕壳等；常见搭配有 **in molt / during the molt**（在换羽/蜕皮期）。"]}
{"word":"moulters","summary":{"en":"“Moulters” usually means animals that are moulting, or it can be a verb form meaning “moults.”","zh":"“moulters”通常指正在换羽／换毛／蜕皮的动物；也可能是动词形式，表示“（它）在换羽／换毛／蜕皮”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “moulter”: an animal (especially a bird) that is moulting—shedding old feathers, hair, or skin.","zh":"“moulter”的复数：正在换羽／换毛／蜕皮的动物（尤指鸟类）。"},"examples":[{"en":"During spring, the beach may be full of moulters that can’t fly well for a while.","zh":"春天时，海滩上可能到处都是正在换羽、暂时飞不太好的鸟。"},{"en":"Wildlife staff asked visitors not to approach the moulters, because they are vulnerable.","zh":"野生动物工作人员提醒游客不要靠近这些正在换羽的动物，因为它们更脆弱。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular present of “moult”: to shed and replace feathers, hair, or skin.","zh":"“moult”的第三人称单数现在时：换羽／换毛／蜕皮。"},"examples":[{"en":"This species moulters later in the summer than most ducks.","zh":"这种物种比大多数鸭子在更晚的夏季才换羽。"},{"en":"The lizard moulters every few weeks as it grows.","zh":"这只蜥蜴随着生长每隔几周就蜕一次皮。"}]}],"synonyms":["molters","shedders","moulting animals","molting animals"],"phonetic":"/ˈmoʊltərz/","extraExplanation":["“moult”是英式拼写；美式英语更常写作“molt”。因此你也可能会看到“molters”（更常见）而不是“moulters”。在自然科普语境里常用“molting/moulting”来描述鸟类换羽期。"]}
{"word":"moulting","summary":{"en":"Moulting means an animal is shedding old feathers, fur, or skin and growing a new covering (British spelling of “molting”).","zh":"moulting 指动物在蜕皮/换毛/换羽，脱落旧覆盖物并长出新的（英式拼写，美式常写 molting）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which an animal sheds old feathers, fur, skin, or an outer covering and grows a new one","zh":"（动物）蜕皮；换毛；换羽（脱落旧的羽毛、毛发、皮肤或外层覆盖物并长出新的）"},"examples":[{"en":"Many birds stop flying long distances during moulting.","zh":"很多鸟在换羽期会减少长距离飞行。"},{"en":"The snake is moulting, so its skin looks dull and cloudy.","zh":"这条蛇正在蜕皮，所以皮肤看起来暗淡发白。"},{"en":"The cat’s moulting is worse in spring.","zh":"这只猫在春天掉毛更严重。"}]},{"partOfSpeech":"adj.","definition":{"en":"shedding old feathers, fur, or skin; going through the moulting process","zh":"正在蜕皮/换毛/换羽的；处于换毛期的"},"examples":[{"en":"Be gentle with a moulting bird; new feathers can be sensitive.","zh":"对正在换羽的鸟要轻一点；新长的羽毛可能很敏感。"},{"en":"A moulting dog may need extra brushing.","zh":"正在换毛的狗可能需要更频繁地梳毛。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “moult”: to shed old feathers, fur, or skin","zh":"“moult”的现在分词：蜕皮；换毛；换羽"},"examples":[{"en":"The penguins are moulting after the breeding season.","zh":"企鹅在繁殖季结束后开始换羽。"},{"en":"Some insects survive by moulting several times as they grow.","zh":"一些昆虫会在生长过程中多次蜕皮以完成发育。"}]}],"synonyms":["shedding","sloughing","molting"],"phonetic":"/ˈmoʊltɪŋ/","extraExplanation":["“moulting”是英式拼写；美式更常写作“molting”。含义相同。","常用于鸟类（换羽）、猫狗（换毛）、蛇和昆虫（蜕皮）。也可在科普或自然写作中出现，用来描述季节性变化与成长过程。"]}
{"word":"moults","summary":{"en":"“Moults” means an animal sheds old feathers/fur/skin (verb), or the shedding periods (plural noun).","zh":"“moults”指动物蜕毛/换羽/蜕皮（动词），或指这些蜕换的时期（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “moult/molt”) to shed old feathers, fur, or skin and grow new ones.","zh":"（“moult/molt”的第三人称单数）蜕毛、换羽、蜕皮；脱去旧的羽毛/毛发/皮并长出新的。"},"examples":[{"en":"The parrot moults once or twice a year.","zh":"这只鹦鹉每年会换羽一到两次。"},{"en":"In summer, the dog moults heavily and leaves hair on the sofa.","zh":"夏天这只狗掉毛很厉害，沙发上都是毛。"},{"en":"Some snakes moult their skin as they grow.","zh":"有些蛇会随着生长而蜕皮。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) the periods or times when an animal sheds feathers, fur, or skin.","zh":"（复数名词）换羽期/换毛期/蜕皮期；动物进行蜕换的时期。"},"examples":[{"en":"Many birds have two moults each year: a post-breeding moult and a pre-breeding moult.","zh":"许多鸟类一年有两次换羽：繁殖后换羽和繁殖前换羽。"},{"en":"During the moults, the bird may look messy and fly less efficiently.","zh":"在换羽期，鸟看起来可能很凌乱，飞行效率也会下降。"}]}],"synonyms":["sheds","loses hair","sloughs (off)","casts (skin)"],"phonetic":"/moʊlts/","extraExplanation":["“moult”和“molt”意思相同：英式更常写 moult，美式更常写 molt。你输入的“moults”既可以是动词第三人称单数（it moults），也可以是名词复数（the moults）。","这个词在日常英语里常用于鸟类（换羽）和宠物（掉毛）。也可作比喻：a company moults its old image（公司“蜕变”旧形象，换新面貌）。"]}
{"word":"moulvi","summary":{"en":"A South Asian term for a Muslim religious scholar or cleric.","zh":"指南亚语境中对穆斯林宗教学者／教士的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Muslim religious scholar or cleric (especially in South Asia), often respected for Islamic learning and sometimes serving as an imam or teacher.","zh":"（尤指南亚地区的）穆斯林宗教学者／教士，因伊斯兰学识而受尊敬，也常担任伊玛目或教师。"},"examples":[{"en":"The moulvi led the evening prayers at the local mosque.","zh":"这位毛拉在当地清真寺带领大家做晚祷。"},{"en":"She asked a moulvi for advice about the religious ceremony.","zh":"她向一位毛拉请教宗教仪式的事。"}]}],"synonyms":["maulvi","mullah","imam","Islamic scholar","cleric"],"phonetic":"/ˈmɔlvi/","extraExplanation":["“moulvi”也常拼作“maulvi / molvi”，来自阿拉伯语“mawlā”（主、师长）一类词源，在英语里多见于印度、巴基斯坦、孟加拉国等语境。","这个词在英语文本中有时带有殖民时期写作习惯与地域色彩；在更通用或更中性的表达里，也可以用“imam（伊玛目）”“Islamic scholar（伊斯兰学者）”“cleric（教士）”等，具体取决于角色与地区。"]}
{"word":"mouly","summary":{"en":"“Mouly” is not a common English word; it is usually a misspelling of “moldy” (covered with mold).","zh":"“mouly”不是常见英语词；通常是“moldy（发霉的）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “moldy” (US) / “mouldy” (UK), meaning covered with mold and smelling or tasting bad.","zh":"不是标准英语单词；最常见是把“moldy”（美式）/“mouldy”（英式）拼错了，意思是“发霉的、长霉的（通常有难闻气味或变质味道）”。"},"examples":[{"en":"I think you mean “moldy”: This bread smells moldy.","zh":"你可能想说的是“moldy”：这面包闻起来有点发霉。"},{"en":"Throw it away if it’s moldy.","zh":"如果发霉了就把它扔掉。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname or place name in some contexts (not common in everyday English).","zh":"在某些语境中可能是姓氏或地名（在日常英语里不常见）。"},"examples":[{"en":"I saw “Mouly” as a last name on the list.","zh":"我在名单上看到“Mouly”作为一个姓氏。"}]}],"synonyms":["moldy","mouldy","musty","stale"],"phonetic":"/ˈmoʊldi/","extraExplanation":["“moldy”是形容词，常用于食物、墙壁、衣物等：moldy bread（发霉面包）、moldy wall（发霉的墙）。如果你想表达“长霉”，也可以说“covered in mold / has mold on it”。","如果你指的是人名/地名（比如某个品牌、角色、公司或法语词），请告诉我你看到它的句子或来源，我可以按具体语境解释。"]}
{"word":"moun","summary":{"en":"“moun” is mainly Haitian Creole for “person/people,” not standard English.","zh":"“moun”主要是海地克里奥尔语，意思是“人/人们”，不是标准英语单词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Haitian Creole) a person; people (used broadly like “someone / people in general”).","zh":"（海地克里奥尔语）人；人们（泛指“某个人/大家”）。"},"examples":[{"en":"Moun yo ap tann bis la.","zh":"人们在等公交车。"},{"en":"Se yon bon moun.","zh":"他/她是个好人。"}]},{"partOfSpeech":"other","definition":{"en":"(Nonstandard/dialect, rare) a shortened form sometimes used in writing for “mount-” words (like mount/mountain), but it is not standard English spelling.","zh":"（非标准/方言，罕见）有时在写作中作为“mount-（登上/山）”相关词的缩写，但不属于标准英语拼写。"},"examples":[{"en":"In standard English, write “mountain,” not “moun.”","zh":"在标准英语里要写“mountain”，而不是“moun”。"}]}],"synonyms":["person","people"],"phonetic":"/mun/","extraExplanation":["“moun”最常见并不是英语单词，而是海地克里奥尔语里的高频词，来自法语“monde（世界/人群）”。在克里奥尔语里它既可以指“某个人”，也可以泛指“人们”。","如果你是想查英语单词，可能想输入的是：mount（登上/安装）、mourn（哀悼）、mound（土堆/小丘）、mountain（山）。你可以告诉我你的语境/完整句子，我能帮你选对词。"]}
{"word":"mound","summary":{"en":"A mound is a small hill or pile; it can also mean the baseball pitcher’s raised area or a burial hill, and as a verb it means to pile up.","zh":"mound 指小土丘或堆；也可指棒球投手丘或坟冢；作动词表示“堆起、使成堆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hill or pile of earth, sand, or another material","zh":"小土丘；土堆；（沙、雪等的）堆"},"examples":[{"en":"A grassy mound rose in the middle of the field.","zh":"田地中央隆起一个长满草的小土丘。"},{"en":"The kids made a mound of sand to build a castle.","zh":"孩子们堆起一堆沙子来建城堡。"}]},{"partOfSpeech":"n.","definition":{"en":"a raised pile of earth where a baseball pitcher stands (the pitching mound)","zh":"（棒球）投手丘"},"examples":[{"en":"The pitcher walked back to the mound after the timeout.","zh":"暂停结束后，投手走回投手丘。"},{"en":"He has great control from the mound.","zh":"他在投手丘上的控球能力很强。"}]},{"partOfSpeech":"n.","definition":{"en":"a mound of earth or stones covering a grave; a burial mound","zh":"坟冢；古代墓冢（封土）"},"examples":[{"en":"Archaeologists studied an ancient burial mound near the river.","zh":"考古学家研究了河边的一座古代墓冢。"},{"en":"They found pottery beneath the mound.","zh":"他们在坟冢下发现了陶器。"}]},{"partOfSpeech":"v.","definition":{"en":"to form into a heap or small hill; to pile up","zh":"堆起；使成小堆/小丘"},"examples":[{"en":"She mounded the soil around the plant to protect the roots.","zh":"她把土堆在植物周围以保护根部。"},{"en":"Snow was mounded against the door after the storm.","zh":"暴风雪过后，门口堆起了积雪。"}]}],"synonyms":["heap","pile","hillock","hummock","embankment"],"phonetic":"/maʊnd/","extraExplanation":["“mound”常用来描述“自然形成或人为堆起的隆起物”。在园艺里很常见（mound up soil 把土堆起来保温/护根）；在美式语境里，“the mound”也经常直接指棒球的投手丘，是很典型的体育用法。"]}
{"word":"mounded","summary":{"en":"Mounded means “shaped like a mound” or “piled up into a mound” (from the verb mound).","zh":"mounded 表示“呈土堆状/隆起的”，也可作动词 mound 的过去式/过去分词，意为“堆成堆”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a mound or mounds; shaped like a small hill or pile.","zh":"有土堆/隆起的；呈小山丘或堆状的。"},"examples":[{"en":"The garden had mounded beds to improve drainage.","zh":"花园里有隆起的花坛床，以改善排水。"},{"en":"They walked over the mounded earth near the construction site.","zh":"他们走过工地旁隆起的土堆。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “mound”: to pile up (earth, sand, snow, etc.) into a mound.","zh":"“mound”的过去式/过去分词：把（土、沙、雪等）堆成堆，堆起。"},"examples":[{"en":"Workers mounded the soil around the new trees.","zh":"工人把土堆在新栽的树周围。"},{"en":"Snow was mounded against the door after the storm.","zh":"暴风雪后，门口堆起了一大堆雪。"}]}],"synonyms":["piled","heaped","raised","hummocky"],"phonetic":"/ˈmaʊndɪd/","extraExplanation":["“mounded beds（高畦/高床）”常见于园艺：把土堆高能让水更快流走，也能让根部更保暖、透气。","在考古或地理语境里，mound 也可指“土墩/古冢（burial mound）”；mounded landscape 表示地表有许多自然或人工的小隆起。"]}
{"word":"moundiness","summary":{"en":"“Moundiness” means the state of being moundy—full of mounds or small hill-like bumps.","zh":"“Moundiness”指“多土堆、隆起起伏”的特征或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being moundy—having many mounds or a surface shaped into small hills.","zh":"“多土堆/多小丘”的状态；表面起伏成许多土堆或小山包的特征。"},"examples":[{"en":"After the construction, the field had an obvious moundiness that made it hard to run on.","zh":"施工结束后，场地明显坑坑洼洼、土堆起伏，很难跑步。"},{"en":"The moundiness of the garden bed helped water drain away from the roots.","zh":"花坛的隆起起伏有助于排水，避免根部积水。"}]}],"synonyms":["unevenness","bumpiness","lumpiness","roughness","irregularity"],"phonetic":"/ˈmaʊndinəs/","extraExplanation":["“moundiness”在现代英语中非常少见，更多是临时造词（nonce word）或技术/描写性写法。更常见的表达是：uneven ground（不平的地面）、mounded surface（隆起的表面）、bumpy/ lumpy terrain（坑洼/隆起的地形）。","构词：mound（土堆、小丘）+ -y（表示“有……特征”，形成 moundy）+ -ness（把形容词变成名词，表示“……的性质/状态”）。"]}
{"word":"mounding","summary":{"en":"Mounding means piling something (often soil) into a rounded mound, or describing something shaped like a mound.","zh":"Mounding 指把东西（常是土）堆成圆隆的土堆，或形容呈土堆状的隆起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making a mound (a small hill or pile), especially by piling up soil","zh":"堆成土堆（小丘或隆起）的行为或过程，尤指把土堆起来"},"examples":[{"en":"Mounding around the base of the plant protects the roots from cold.","zh":"在植物根部周围培土可以保护根系免受寒冷影响。"},{"en":"The gardener spent the morning mounding soil to improve drainage.","zh":"园丁花了一上午把土堆高以改善排水。"}]},{"partOfSpeech":"adj.","definition":{"en":"forming a mound; shaped like a rounded pile or small hill","zh":"呈土堆状的；隆起成小丘形的"},"examples":[{"en":"They built a mounding wall of sand to block the wind.","zh":"他们堆起一道隆起的沙墙来挡风。"},{"en":"The path rose over mounding ground.","zh":"小路越过一片起伏隆起的地面。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “mound”) piling something up into a mound","zh":"（“mound”的现在分词）把某物堆成堆、堆起"},"examples":[{"en":"She is mounding compost in the corner of the yard.","zh":"她正在院子角落里把堆肥堆成一堆。"},{"en":"Workers were mounding snow to clear the sidewalk.","zh":"工人们把雪堆到一旁以清理人行道。"}]}],"synonyms":["piling","heaping","banking","hilling (up)"],"phonetic":"/ˈmaʊndɪŋ/","extraExplanation":["“mounding”在园艺里常对应“培土”（如给土豆、玫瑰等根部加土），目的是保温、稳固植株、促排水或帮助块茎生长。","在美式英语语境中，和棒球相关时也会看到“the pitcher’s mound”（投手丘）；虽然常用的是名词“mound”，但描述“堆起土形成投手丘”的过程也可以用“mounding”。"]}
{"word":"moundlet","summary":{"en":"“Moundlet” means a small mound or little raised pile of earth.","zh":"“moundlet”指“小土丘/小土堆”，是“mound（土丘）”的“小型化”表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small mound; a little raised hill or pile of earth","zh":"小土丘；小隆起（小堆土或小山包）"},"examples":[{"en":"A moundlet of sand formed beside the fence after the windstorm.","zh":"风暴过后，栅栏旁形成了一个小沙丘。"},{"en":"The ants built a moundlet near the edge of the path.","zh":"蚂蚁在小路边缘堆起了一个小土堆。"}]}],"synonyms":["small mound","little mound","hummock","knoll"],"phonetic":"/ˈmaʊndlɪt/","extraExplanation":["“moundlet”非常少见，更多时候人们会直接说“small mound / little mound”。","词尾“-let”常表示“小、较小的”（如 streamlet 小溪、booklet 小册子、piglet 小猪）。"]}
{"word":"mounds","summary":{"en":"“Mounds” usually means small hills or piles; in baseball it means the pitcher’s raised area; as a verb it means to pile up.","zh":"“mounds”通常指小土丘或一堆堆的东西；在棒球中指投手丘；作动词表示把东西堆起来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mound is a small hill or a rounded pile of something (like earth, sand, snow, or food).","zh":"mound 指“小土丘”或“一堆隆起的东西”（如泥土、沙子、雪、食物等）。"},"examples":[{"en":"The kids rolled down a grassy mound in the park.","zh":"孩子们从公园里的草坡小土丘上滚下来。"},{"en":"She poured flour onto the table and made a mound in the center.","zh":"她把面粉倒在桌上，在中间堆成一小堆。"},{"en":"After the storm, there were mounds of snow along the road.","zh":"暴风雪过后，路边堆起了一堆堆的积雪。"}]},{"partOfSpeech":"n.","definition":{"en":"In baseball, the mound is the raised area where the pitcher stands.","zh":"在棒球中，the mound 指“投手丘”（投手站在上面投球的凸起区域）。"},"examples":[{"en":"The pitcher walked back to the mound after a short break.","zh":"短暂休息后，投手走回投手丘。"},{"en":"He has great control on the mound.","zh":"他在投手丘上控球能力很强。"}]},{"partOfSpeech":"v.","definition":{"en":"To mound means to form into a pile or heap.","zh":"mound 作动词时表示“堆起，使成堆”。"},"examples":[{"en":"Workers mounded the soil around the young trees.","zh":"工人把土堆在幼树周围。"},{"en":"She mounded rice onto his plate.","zh":"她在他的盘子里堆了一大勺米饭。"}]}],"synonyms":["pile","heap","hill","hummock"],"phonetic":"/maʊnd/","extraExplanation":["“mounds”是“mound”的复数形式（名词）或第三人称单数形式（动词）。例如：mounds of snow（一堆堆雪）；He mounds the soil（他把土堆起来）。","在考古或历史语境里，mound 也常指“古墓冢/土墩”（burial mound），比如一些原住民或古代文化留下的土堆遗址。"]}
{"word":"moundsman","summary":{"en":"Moundsman means a baseball pitcher.","zh":"moundsman 指棒球的投手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Baseball) a pitcher; the player who throws the ball from the pitcher’s mound toward home plate.","zh":"（棒球）投手；站在投手丘上把球投向本垒的球员。"},"examples":[{"en":"The moundsman kept his cool and struck out the side in the ninth inning.","zh":"这位投手沉着应对，在第九局让对方三人三振出局。"},{"en":"Fans cheered as the veteran moundsman walked to the mound for one last start.","zh":"当这位老将投手走上投手丘迎来最后一次先发时，球迷们欢呼起来。"}]}],"synonyms":["pitcher","hurler"],"phonetic":"/ˈmaʊndz.mən/","extraExplanation":["“moundsman”主要是美式英语里的棒球用语，带点新闻报道或评论的语气；更日常的说法是“pitcher”。之所以叫“mound”，是因为投手要站在略微隆起的投手丘上投球。"]}
{"word":"moundsmen","summary":{"en":"Moundsmen means baseball pitchers (plural), a traditional way to refer to the people who pitch from the mound.","zh":"Moundsmen 指（复数）棒球投手，是一种较传统/新闻体的说法，指在投手丘上投球的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) baseball pitchers; players who pitch from the pitcher’s mound.","zh":"（复数）【棒球】投手；在投手丘上投球的球员。"},"examples":[{"en":"The manager relied on his moundsmen to protect the late lead.","zh":"教练依靠投手群来守住比赛末段的领先优势。"},{"en":"In the playoffs, the team’s moundsmen stayed calm under pressure.","zh":"在季后赛里，这支球队的投手们在压力下依然沉着。"}]}],"synonyms":["pitchers","hurlers (informal)"],"phonetic":"/ˈmaʊndzˌmæn/","extraExplanation":["“moundsman”字面意思是“投手丘上的人”，是棒球里对投手较为传统、带点新闻写作风格的说法；现代口语里更常直接说“pitcher(s)”。"]}
{"word":"moundwork","summary":{"en":"A moundwork is a man-made earth mound, often an old fortification or archaeological earthwork.","zh":"moundwork 指人工堆筑的土丘/土垒，多用于旧时防御工事或考古遗址语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an earthwork made of piled soil (a mound), especially one built as a fortification or as an ancient/archaeological structure","zh":"土堆工事；土垒（用堆土形成的土筑结构，常指防御工事或古代遗址的土筑）"},"examples":[{"en":"The archaeologists mapped the moundwork before starting any digging.","zh":"考古学家在开始挖掘前先对这处土垒遗址进行了测绘。"},{"en":"A low moundwork still marks where the old fort once stood.","zh":"一段低矮的土垒仍标示着旧堡垒曾经的位置。"}]}],"synonyms":["earthwork","embankment","rampart","mound"],"phonetic":"/ˈmaʊndˌwɝk/","extraExplanation":["“moundwork”在现代日常英语中不常见，更常见的说法是“earthwork（土方工事/土筑）”“mound（土堆/古坟）”或“mound-and-ditch earthwork（带壕沟的土垒）”。在考古与历史写作中，它通常指人为堆筑的土丘、城垣或防御工事遗迹。"]}
{"word":"moundy","summary":{"en":"Moundy means “full of mounds” or “mound-shaped,” and is a rare adjective.","zh":"moundy 指“多土堆/小丘的”或“呈土堆状的”，是较罕见的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having many mounds, or shaped like a mound; uneven and lumpy.","zh":"（罕见）有许多土堆/小丘的；呈土堆状的；凹凸不平的。"},"examples":[{"en":"The field was moundy after the moles had been digging for weeks.","zh":"田地被鼹鼠挖了好几个星期后，变得一堆一堆、凹凸不平。"},{"en":"We walked across moundy ground, so we had to watch our steps.","zh":"我们走过凹凸不平的地面，所以得小心脚下。"}]}],"synonyms":["mounded","hilly","lumpy","uneven"],"phonetic":"/ˈmaʊndi/","extraExplanation":["“moundy”不是现代英语里很常见的标准词，更多时候人们会用更自然的说法，如：mounded（有土堆的）、hilly（多丘陵的）、lumpy/uneven（凹凸不平的）。","构词上它来自 mound（土堆；小丘）+ -y（表示“有……特征的”），类似 sandy（多沙的）、rocky（多岩石的）。"]}
{"word":"mounseer","summary":{"en":"“Mounseer” is not standard English; it’s usually a misspelling of French “monsieur” (“Mr./sir”).","zh":"“mounseer”不是规范英语拼写；通常是法语“monsieur”（先生/Mr./sir）的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) Intended as “monsieur,” a French title meaning “Mr.” or “sir,” used to address or refer to a man, especially in French-speaking contexts.","zh":"（常见拼写错误）多半是想写“monsieur”，法语称呼，意为“先生/先生（Mr./sir）”，用于称呼或指代男性，尤用于法语语境。"},"examples":[{"en":"Excuse me, monsieur—could you tell me where the museum is?","zh":"打扰一下，先生——请问博物馆怎么走？"},{"en":"In the novel, the waiter calls him “monsieur” to be polite.","zh":"小说里，服务生用“monsieur”称呼他，以示礼貌。"}]}],"synonyms":["monsieur","Mr.","sir"],"phonetic":"/məsˈjɝ/","extraExplanation":["“Monsieur”是法语里非常常见的尊称，相当于英语的“Mr.”或“sir”。在英语文本中出现时，通常是为了营造法式氛围、表示人物在法国/讲法语的环境中，或体现礼貌与身份。","拼写上容易被英语使用者写成近似读音的形式（例如你写的“mounseer”）。标准拼写是：monsieur。对应女性常见形式是“madame”（夫人/女士）或“mademoiselle”（小姐，现今使用更谨慎、较少）。"]}
{"word":"mount","summary":{"en":"“Mount” most commonly means a mountain (often in names) or the act of getting on (a horse/bike), installing something, or increasing over time (pressure mounts).","zh":"“mount”常指“山”（多用于地名/较正式语境），也可作动词表示“骑上/登上”“安装固定”，或表示“逐渐增加、加剧”（如压力加大）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mountain; a large natural rise of land with steep sides and a high peak.","zh":"山；高而陡的自然地形隆起，通常有山峰。"},"examples":[{"en":"They climbed the mount before sunrise.","zh":"他们在日出前爬上了那座山。"},{"en":"Snow covered the mount all winter.","zh":"整個冬天，山上都覆著雪。"}]},{"partOfSpeech":"vt.","definition":{"en":"To climb onto and sit on (a horse, bicycle, etc.); to get on.","zh":"骑上；登上（马、自行车等）。"},"examples":[{"en":"She mounted the horse calmly.","zh":"她很镇定地骑上了马。"},{"en":"He mounted his bike and rode away.","zh":"他骑上自行车就走了。"}]},{"partOfSpeech":"vi.","definition":{"en":"To increase and become stronger or larger over time (often used with pressure, costs, anger, evidence).","zh":"（压力、成本、怒气、证据等）逐渐增加、加剧。"},"examples":[{"en":"Pressure mounted as the deadline approached.","zh":"随着截止日期临近，压力越来越大。"},{"en":"Evidence mounted against the suspect.","zh":"对嫌疑人的不利证据越来越多。"}]},{"partOfSpeech":"vt.","definition":{"en":"To attach or place something onto a support or in a fixed position, so it can be displayed or used.","zh":"安装；把……固定在支架/底座上以便展示或使用。"},"examples":[{"en":"They mounted the TV on the wall.","zh":"他们把电视安装在墙上。"},{"en":"The photo was mounted on cardboard.","zh":"照片被裱在硬纸板上。"}]}],"synonyms":["mountain","climb","get on","install","attach","increase","build up"],"phonetic":"/maʊnt/","extraExplanation":["“mount”作名词时常见于地名或较正式/文学语境（如 Mount Everest）。日常口语里更常说“mountain”。","“mount”作动词有两个常用方向：①“骑上/登上”（mount a horse/bike）；②“安装/固定”（mount a camera on a tripod）。注意“mount”比“get on/put on”更正式，也更强调“放到可用的位置”。","常见搭配：pressure/costs/anger/evidence mount（压力/成本/怒气/证据加剧）。"]}
{"word":"mountable","summary":{"en":"Mountable means “able to be mounted”—either installed on something or climbed onto/ridden.","zh":"mountable 指“可被安装的”或“可骑乘/可攀上去的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be climbed onto, ridden, or put (mounted) onto something else.","zh":"可骑乘的；可安装/可装配到某物上的。"},"examples":[{"en":"The bike comes with a mountable light for night riding.","zh":"这辆自行车配有一个可安装的车灯，方便夜骑。"},{"en":"The horse looked calm and mountable.","zh":"那匹马看起来很温顺，可以骑乘。"}]}],"synonyms":["attachable","installable","rideable","climbable"],"phonetic":"/ˈmaʊn.tə.bəl/","extraExplanation":["在现代英语里，mountable 常见于“可安装”的场景（尤其是设备、配件）：mountable camera / mountable shelf（可安装的相机/架子）。用于“可骑乘（马）”时也成立，但在日常交流中更常说 safe to ride 或 easy to mount。","词根 mount 来自“爬上、骑上、安装”，-able 表示“能够……的”，所以 mountable = “能够被mount（骑上/装上/装配）”。"]}
{"word":"mountably","summary":{"en":"“Mountably” means “in a way that can be mounted,” but it is very uncommon in modern English.","zh":"“mountably”表示“以可骑乘/可安装的方式”，但在现代英语中非常罕见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be mounted (ridden or climbed onto), or installed on something.","zh":"以可以被骑乘/跨上或被安装（固定）在某物上的方式。"},"examples":[{"en":"The horse is calm and mountably trained for beginners.","zh":"这匹马很温顺，受过适合初学者骑乘的训练。"},{"en":"Choose a camera that is mountably compatible with this tripod.","zh":"选择一台能与这款三脚架兼容、可安装固定的相机。"}]}],"synonyms":["in a way that can be mounted","compatibly","safely (for mounting, context-dependent)"],"phonetic":"/ˈmaʊntəbli/","extraExplanation":["“mountably”非常少见，很多母语者也几乎不用。实际写作中更常用的是形容词“mountable”（可骑的/可安装的），或用更自然的表达来改写句子：例如“can be mounted / is easy to mount”（可安装/容易安装），以及“suitable to ride / safe to mount”（适合骑/可以安全上马）。","在马术语境中，通常说“mount safely / easy to mount / suitable for mounting”（能安全上马/容易上马/适合上马）比“mountably”自然。"]}
{"word":"mountain","summary":{"en":"“Mountain” means a very high natural landform; it can also mean a very large amount of something.","zh":"“mountain”表示“高山”，也可比喻指“大量/堆积如山”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very high natural area of land with steep sides, higher than a hill.","zh":"山；（通常比丘陵更高、坡更陡的）高大自然地形。"},"examples":[{"en":"They climbed the mountain at sunrise.","zh":"他们在日出时攀登那座山。"},{"en":"A line of snow-covered mountains rose in the distance.","zh":"远处连绵的雪山拔地而起。"}]},{"partOfSpeech":"n.","definition":{"en":"A very large amount or a big pile of something.","zh":"大量；堆积如山（的东西）。"},"examples":[{"en":"I have a mountain of homework to finish.","zh":"我有一大堆作业要完成。"},{"en":"The storm left mountains of snow on the roads.","zh":"暴风雪在路上留下了堆积如山的积雪。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Usually in compounds) Related to mountains; living or growing in mountains.","zh":"（多用于复合词）山地的；生长/栖息在山区的。"},"examples":[{"en":"The town is famous for mountain air and quiet nights.","zh":"这座小镇以清新的山间空气和宁静的夜晚闻名。"},{"en":"We saw mountain goats on the rocky slope.","zh":"我们在岩石坡上看见了山羊。"}]}],"synonyms":["mount (poetic/short for a mountain)","peak","summit","range","pile (for the figurative meaning)"],"phonetic":"/ˈmaʊn.tən/","extraExplanation":["在英语里，“mountain”既可以指真实的“山”，也常用作夸张比喻，表示“数量很大/压力很大”，常见搭配有：a mountain of + 名词（a mountain of work/problems/letters）。","与之相关的常见表达：move mountains（创造奇迹/竭尽全力）、make a mountain out of a molehill（小题大做）。"]}
{"word":"mountained","summary":{"en":"“Mountained” is a rare, literary adjective meaning “mountainous” or “piled up like a mountain.”","zh":"“mountained”是较少见、偏文学的形容词，表示“多山的”或“像山一样堆积的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(poetic or literary) Having many mountains; mountainous.","zh":"（诗歌或文学用法）多山的；山岳遍布的。"},"examples":[{"en":"They traveled through a wild, mountained region in the west.","zh":"他们穿越了西部一片荒野的多山地区。"},{"en":"In the distance lay a mountained horizon, dark against the sunset.","zh":"远处是山峦起伏的地平线，在夕阳下显得很暗。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Piled up into a large heap; heaped like a mountain.","zh":"（罕见）堆成像山一样高；大量堆积的。"},"examples":[{"en":"The trash was mountained in the corner after the storm.","zh":"暴风雨后，垃圾在角落里堆得像小山一样。"},{"en":"Paperwork lay mountained on his desk.","zh":"文件在他桌上堆积如山。"}]}],"synonyms":["mountainous","craggy","rugged","heaped","piled","mounded"],"phonetic":"/ˈmaʊn.tən.d/","extraExplanation":["“mountained”在现代英语里不常见，更多见于描写性很强的写作（如诗歌、小说的风景描写），用来营造画面感。日常表达里更常用“mountainous”（多山的）或“piled up/heaped up”（堆积的）。"]}
{"word":"mountaineer","summary":{"en":"A mountaineer is most commonly a mountain climber; it can also mean someone who lives in mountainous areas.","zh":"mountaineer 最常指“登山者/登山运动员”，也可指“山地居民”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who climbs mountains, especially as a sport or job; a skilled climber.","zh":"登山者；登山运动员（尤指以登山为爱好或职业的人）。"},"examples":[{"en":"She’s an experienced mountaineer who has climbed in the Himalayas.","zh":"她是一位经验丰富的登山者，曾在喜马拉雅山登山。"},{"en":"The mountaineer checked his ropes and helmet before starting the climb.","zh":"这位登山者在开始攀登前检查了绳索和头盔。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who lives in a mountainous region.","zh":"山地居民；住在山区的人。"},"examples":[{"en":"Many mountaineers in the village rely on farming and tourism.","zh":"村里许多山地居民依靠农业和旅游业为生。"},{"en":"The story follows a young mountaineer growing up in the mountains.","zh":"这个故事讲述了一位在山区长大的年轻山民。"}]}],"synonyms":["climber","alpinist","mountain climber"],"phonetic":"/ˌmaʊn.tənˈɪr/","extraExplanation":["在美国文化中，Mountaineer 也常用作学校或球队的吉祥物/昵称（如西弗吉尼亚大学 West Virginia Mountaineers），含有“坚韧、勇敢、适应艰苦环境”的象征意义。","词形上，mountain + -eer（表示“从事某种活动的人”，如 engineer、pioneer），所以 mountaineer 字面意思就是“与山相关、从事登山的人”。"]}
{"word":"mountaineered","summary":{"en":"“Mountaineered” means “did mountaineering” (climbed mountains) in the past.","zh":"“Mountaineered”表示过去“进行登山/登山探险”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of “mountaineer”) to climb mountains as a sport or serious outdoor activity; to do mountaineering.","zh":"（“mountaineer”的过去式/过去分词）从事登山运动；进行登山探险。"},"examples":[{"en":"Last summer, she mountaineered in the Alps with an experienced guide.","zh":"去年夏天，她在一位有经验的向导带领下在阿尔卑斯山登山。"},{"en":"They mountaineered for three days before reaching the base camp.","zh":"他们登山了三天才到达大本营。"},{"en":"He has mountaineered in dangerous conditions, but he always plans carefully.","zh":"他曾在危险条件下登山，但他总是做周密计划。"}]}],"synonyms":["climbed (mountains)","went mountaineering","scaled","ascended"],"phonetic":"/ˌmaʊntənˈɪrd/","extraExplanation":["“mountaineer”既可以作名词（登山者），也可以作动词（进行登山）。动词用法在日常口语中不如“go mountaineering / climb mountains”常见，但在书面语、新闻或户外运动语境中会出现。","登山（mountaineering）通常暗示需要技术与装备（如绳索、冰爪、头盔），不只是一般的徒步（hiking）。"]}
{"word":"mountaineering","summary":{"en":"Mountaineering is the sport and skill of climbing mountains, often requiring technical equipment and safety knowledge.","zh":"Mountaineering 指攀登高山的运动与技能，通常需要技术装备与安全知识。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sport or activity of climbing mountains, often using special equipment and skills","zh":"登山运动；攀登高山（常需要专门装备与技术）"},"examples":[{"en":"She took a beginner course in mountaineering before attempting a high peak.","zh":"她在挑战高峰前，先上了一个登山入门课程。"},{"en":"Mountaineering can be dangerous if the weather changes suddenly.","zh":"如果天气突然变化，登山可能会很危险。"},{"en":"He fell in love with mountaineering after climbing in the Alps.","zh":"他在阿尔卑斯山攀登后爱上了登山运动。"}]},{"partOfSpeech":"n.","definition":{"en":"the skills, methods, and knowledge needed for climbing mountains (e.g., navigation, rope work, safety)","zh":"登山技术与知识（如导航、绳索操作与安全常识）"},"examples":[{"en":"Good mountaineering includes knowing how to read a map and manage risk.","zh":"良好的登山技能包括会看地图并懂得风险管理。"},{"en":"The club teaches mountaineering skills like using crampons and an ice axe.","zh":"这个俱乐部教授使用冰爪和冰镐等登山技能。"}]}],"synonyms":["mountain climbing","alpinism","climbing"],"phonetic":"/ˌmaʊn.tənˈɪr.ɪŋ/","extraExplanation":["“mountaineering”通常指较“hiking（徒步）”更技术、更具风险的高山攀登，可能涉及冰雪、攀岩、绳索保护与高海拔环境。","常见相关词：alpinism（阿尔卑斯式攀登/高山攀登）；climbing（攀登，范围更广）；trekking（长途徒步）。","文化语境中，提到“the Himalayas / Everest”时的攀登活动一般会用mountaineering，强调技术、团队协作与安全。"]}
{"word":"mountaineers","summary":{"en":"Mountaineers are people who climb mountains; less commonly, the word can mean people who live in mountainous areas.","zh":"mountaineers 指登山者；较少见时也可指居住在山区的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who climb mountains, especially as a sport or serious activity.","zh":"登山者；登山运动员（尤指把攀登高山当作运动或严肃活动的人）。"},"examples":[{"en":"The mountaineers started climbing before sunrise to avoid afternoon storms.","zh":"登山者在日出前就开始攀登，以避开下午的暴风雨。"},{"en":"Experienced mountaineers always check the weather and avalanche warnings.","zh":"有经验的登山者总会查看天气和雪崩预警。"},{"en":"The rescue team helped two mountaineers who got lost in heavy snow.","zh":"救援队帮助了两名在大雪中迷路的登山者。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A person who lives in a mountainous region.","zh":"（较少见）山地居民；住在山区的人。"},"examples":[{"en":"Local mountaineers know which paths are safest in winter.","zh":"当地的山地居民知道冬天哪些小路最安全。"},{"en":"Stories from the mountaineers describe life in remote valleys.","zh":"来自山地居民的故事描绘了偏远山谷的生活。"}]}],"synonyms":["climbers","alpinists","peak-baggers"],"phonetic":"/ˌmaʊn.tənˈɪrz/","extraExplanation":["“Mountaineer”通常强调技术性与挑战性（如冰雪、绳索、攀登路线），比一般的“hiker”（徒步者）更偏向高海拔、风险更高的登山活动。","在文化语境中，“mountaineers”有时也可指某些地区的群体或队名（如西弗吉尼亚大学的运动队名 Mountaineers），需根据上下文判断是否为字面意思。"]}
{"word":"mountainer","summary":{"en":"“Mountainer” is a rare spelling; the standard word is “mountaineer,” meaning a mountain climber.","zh":"“mountainer”较少见，标准拼写多为“mountaineer”，意思是“登山者/攀登者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “mountaineer”) a person who climbs mountains as a sport or who is skilled at traveling in the mountains.","zh":"（更常见拼写为 mountaineer）登山者；擅长在山区行走、攀登的人。"},"examples":[{"en":"She trained for months to become a mountaineer.","zh":"她训练了好几个月，想成为一名登山者。"},{"en":"Experienced mountaineers know how quickly weather can change in the mountains.","zh":"有经验的登山者知道山里的天气变化有多快。"}]}],"synonyms":["mountaineer","climber","alpinist"],"phonetic":"/ˌmaʊn.tənˈɪr/","extraExplanation":["“mountainer”在现代英语中不常用，绝大多数情况下应写作“mountaineer”。如果你在文章里看到“mountainer”，可能是拼写错误、方言用法，或作者故意使用的变体。","词根提示：mountain（山）+ -eer（表示“从事某种活动的人”，如 engineer, pioneer）。"]}
{"word":"mountainet","summary":{"en":"Mountainet is a rare word meaning a small mountain or large hill.","zh":"Mountainet 是一个较罕见的词，意思是“小山/较小的山”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small mountain; a little mountain or large hill (rare/old-fashioned).","zh":"小山；较小的山（较少见/偏旧式用法）。"},"examples":[{"en":"A narrow path wound around the mountainet behind the village.","zh":"一条狭窄的小路绕着村子后面那座小山蜿蜒而上。"},{"en":"From the top of the mountainet, you can see the river clearly.","zh":"站在那座小山顶上，你能清楚地看到河流。"}]}],"synonyms":["hill","small mountain","knoll","hillock"],"phonetic":"/ˌmaʊn.tənˈɛt/","extraExplanation":["“mountainet”在现代英语中非常少见，很多词典里也未必收录；写作中更常用“hill / small mountain / knoll”。","拼写上也常被认为可能是“mountainette”（更罕见）或想写“mountain”（山）/“mountaineer”（登山者）。如果你告诉我你的句子语境，我可以帮你确认更自然的用词。"]}
{"word":"mountainette","summary":{"en":"A rare word meaning a small mountain; sometimes used playfully to mean a female mountaineer.","zh":"一个罕见词：可指“小山/小型山峰”；也偶尔戏谑地指“女登山者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a small mountain or mountain-like hill; a diminutive form of “mountain.”","zh":"（罕见）小山、小型山峰；“mountain”的指小形式。"},"examples":[{"en":"We climbed a mountainette near the village, not a true peak but steep enough to be fun.","zh":"我们爬了村子附近的一座“小山”，不算真正的山峰，但够陡，爬起来很有趣。"},{"en":"From the road you can see a line of mountainettes rising behind the fields.","zh":"从公路上可以看到田地后面一排小山起伏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, sometimes playful) a female mountaineer; a woman who climbs mountains.","zh":"（非常罕见，偶带戏谑）女登山者；从事登山运动的女性。"},"examples":[{"en":"She jokingly called herself a mountainette after her first successful climb.","zh":"第一次成功登顶后，她开玩笑地称自己是“女登山者”。"},{"en":"In old writing, “mountainette” may appear as a gendered form of “mountaineer.”","zh":"在较旧的写法中，“mountainette”有时会作为“mountaineer”的性别化形式出现。"}]}],"synonyms":["hill","hillock","small mountain","mountaineer","climber"],"phonetic":"ˌmaʊn.tənˈɛt","extraExplanation":["“mountainette”不是现代英语里的常用词，多数词典未必收录。它看起来是用法语来源的后缀“-ette”（常表示“较小的/某类人”）构成的类造词，因此更可能出现在文学、幽默或临时造词的语境里。","如果你想表达“小山”，更自然常用的词是“hill”“hillock”或“small mountain”。如果表达“女登山者”，现代英语通常直接说“mountaineer”或“female/woman climber”，因为许多场合会避免不必要的性别标记。"]}
{"word":"mountainless","summary":{"en":"“Mountainless” means having no mountains or lacking mountain features.","zh":"“mountainless”意为“无山的、没有山脉特征的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no mountains; lacking mountains.","zh":"无山的；没有山脉的。"},"examples":[{"en":"The mountainless plains stretched to the horizon.","zh":"无山的平原一直延伸到地平线。"},{"en":"Compared with the Alps, this region feels almost mountainless.","zh":"和阿尔卑斯山相比，这个地区几乎显得没有山。"}]}],"synonyms":["flat","level","treeless (in similar -less style)","without mountains"],"phonetic":"/ˈmaʊntənləs/","extraExplanation":["“mountainless”由“mountain + -less”构成，-less 表示“没有/缺少”。英语里常见类似构词：hopeless（没有希望的）、homeless（无家可归的）、careless（粗心的）。","这个词在日常口语中不算常见，写作里更常用 no mountains / without mountains / flat 等表达；但在描写地理风貌的文学或说明文中，mountainless 能更凝练地强调“缺少山地特征”。"]}
{"word":"mountainlike","summary":{"en":"“Mountainlike” means “like a mountain,” often describing something very large, steep, or towering.","zh":"“mountainlike”意为“像山一样的”，常形容某物巨大、陡峭或高耸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a mountain in size, shape, or appearance; very large and steep.","zh":"像山一样的；（形状或规模）巨大陡峭的。"},"examples":[{"en":"A mountainlike wave rose in front of the ship.","zh":"一堵像山一样的巨浪在船前升起。"},{"en":"The city is surrounded by mountainlike piles of snow after the storm.","zh":"暴风雪过后，城市周围堆满了山一样的积雪。"}]}],"synonyms":["mountainous","towering","massive","steep","looming"],"phonetic":"/ˈmaʊn.tənˌlaɪk/","extraExplanation":["“mountainlike”由 mountain + -like 构成，-like 表示“像……一样的”，常用来形成形容词（如 childlike, lifelike）。","它属于比较书面/描写性的用法，常见于文学描写或新闻报道中，用来强调“体量巨大、压迫感强”。日常口语中也可用 very large / huge / enormous，或用 mountain of + 名词（a mountain of work）来表达。"]}
{"word":"mountainous","summary":{"en":"Mountainous means “full of mountains” and can also mean “huge in amount” in a figurative sense.","zh":"Mountainous 意为“多山的”，也可作比喻表示“巨大的、堆积如山的（数量）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many mountains; full of mountains, or formed by mountains.","zh":"多山的；山区的；由山脉构成的。"},"examples":[{"en":"They drove through a mountainous region with narrow roads and steep cliffs.","zh":"他们开车穿过一个多山地区，道路狭窄、悬崖陡峭。"},{"en":"Mountainous terrain can make travel slow and difficult.","zh":"多山地形会让出行变得缓慢而困难。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Very large in amount; huge.","zh":"（比喻）巨大的；堆积如山的。"},"examples":[{"en":"The company faced mountainous debt after the failed project.","zh":"项目失败后，公司面临巨额债务。"}]}],"synonyms":["rugged","hilly","mountainous (figurative: enormous)","enormous","massive"],"phonetic":"/ˈmaʊn.tən.əs/","extraExplanation":["“Mountainous”最常见是字面义：描述一个地方“山多”。在写作或新闻里也常用于更客观的地理表达，如“mountainous terrain/area/region”。","比喻义常和抽象名词搭配，强调“数量大到像山一样”：mountainous debt（巨额债务）、mountainous paperwork（堆积如山的文件）。语气通常偏负担、压力大。"]}
{"word":"mountainously","summary":{"en":"Mountainously means “like mountains” (high, steep, rugged), and can also mean “to an overwhelming degree” in a figurative sense.","zh":"mountainously 表示“像山一样”（高、陡、崎岖），也可作比喻表示“程度极大、压倒性地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is like mountains—high, steep, rugged, or strongly shaped by mountainous land.","zh":"以像山一样的方式——高耸、陡峭、崎岖，或明显带有山区地形特征。"},"examples":[{"en":"The road climbs mountainously, twisting up the hillside in sharp turns.","zh":"这条路沿着山坡陡峭蜿蜒地向上爬升。"},{"en":"The region is mountainously beautiful, with deep valleys and snow-capped peaks.","zh":"这片地区美得很“山地化”，有深谷和覆雪的山峰。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative) To an extreme or overwhelming degree; massively.","zh":"（比喻）极其、压倒性地；巨大地。"},"examples":[{"en":"The project became mountainously complex after the requirements changed.","zh":"需求变更后，这个项目变得极其复杂。"},{"en":"He made a mountainously large mistake by sending the email to everyone.","zh":"他把邮件发给所有人，犯了一个“巨大得像山一样”的错误。"}]}],"synonyms":["steeply","ruggedly","dramatically","immensely","enormously"],"phonetic":"/ˈmaʊn.tən.əs.li/","extraExplanation":["“mountainously”由“mountainous（多山的）+ -ly（副词后缀）”构成，但在现代英语里不算常用。更自然的表达通常是“in a mountainous way / very mountainous / extremely”。","比喻用法带有夸张色彩，强调“像山一样巨大/难以应付”。写作中可用于增强画面感，但口语里较少见。"]}
{"word":"mountainousness","summary":{"en":"“Mountainousness” means the degree or quality of being mountainous.","zh":"“mountainousness”指“多山的程度或特征”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being mountainous; having many mountains or high, rugged land","zh":"多山性；山区特征；山地多、地势高而崎岖的特性"},"examples":[{"en":"The region’s mountainousness makes road travel slow and sometimes dangerous.","zh":"这个地区的多山性使得公路出行缓慢，有时还很危险。"},{"en":"Because of the area’s mountainousness, villages are often separated by long valleys.","zh":"由于当地地形多山，村庄常常被漫长的山谷分隔开。"}]}],"synonyms":["ruggedness","hilliness","mountainous character","mountainous terrain"],"phonetic":"/ˈmaʊn.tən.əs.nəs/","extraExplanation":["“mountainousness”是由形容词“mountainous（多山的）”加名词后缀“-ness（……的性质/状态）”构成，表示一种抽象的“特征/程度”。在日常英语中更常用“mountainous terrain/area/region（多山地形/地区）”或直接说“how mountainous it is（有多山）”。"]}
{"word":"mountains","summary":{"en":"“Mountains” means high natural landforms (the plural of “mountain”) and can also refer to mountain regions.","zh":"“mountains”指“山/群山”（mountain 的复数），也常泛指“山区、山地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"large natural areas of land that rise high above the surrounding land; plural of “mountain”","zh":"山；高出周围地面的巨大天然地形（“mountain”的复数）"},"examples":[{"en":"The mountains were covered with snow all year.","zh":"这些山一年到头都被雪覆盖。"},{"en":"We drove through the mountains to reach the small town.","zh":"我们开车穿过群山到达那座小镇。"}]}],"synonyms":["peaks","mountain ranges","highlands"],"phonetic":"/ˈmaʊn.tənz/","extraExplanation":["英语里“the mountains”常指“山区/群山地带”，不只是几座具体的山，比如：They live in the mountains.=他们住在山区。","在文学和歌曲中，mountains 常象征“艰难挑战、崇高、自由或永恒”，例如诗歌里常用“climb mountains（翻越高山）”来比喻克服困难。"]}
{"word":"mountainside","summary":{"en":"“Mountainside” means the side or slope of a mountain.","zh":"“Mountainside”指山的侧面或斜坡，即山腰/山坡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the side or slope of a mountain","zh":"山腰；山坡；山的斜坡"},"examples":[{"en":"A small village sits on the mountainside.","zh":"一个小村庄坐落在山坡上。"},{"en":"We watched the sun set over the mountainside.","zh":"我们看着夕阳落在山坡那边。"},{"en":"Heavy rain can cause landslides on a steep mountainside.","zh":"大雨可能会在陡峭的山坡上引发山体滑坡。"}]}],"synonyms":["hillside","slope","mountain slope"],"phonetic":"/ˈmaʊn.tən.saɪd/","extraExplanation":["“Mountainside”是复合名词（mountain + side），常用于描述地理位置或景色（on the mountainside, along the mountainside）。","在新闻与环保语境中，它也常与自然灾害搭配出现，如 landslide（滑坡）、erosion（侵蚀）、wildfire（山火）等。"]}
{"word":"mountainsides","summary":{"en":"“Mountainsides” means the slopes or sides of mountains.","zh":"“Mountainsides”指山的侧面或山坡（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The sides or slopes of a mountain (plural of “mountainside”).","zh":"山坡；山腰；山的侧面（“mountainside”的复数）。"},"examples":[{"en":"Houses were scattered across the mountainsides.","zh":"房子零星分布在山坡上。"},{"en":"In spring, wildflowers cover the mountainsides.","zh":"春天，野花开满山坡。"},{"en":"After the heavy rain, parts of the mountainsides began to slide.","zh":"暴雨过后，部分山坡开始发生滑坡。"}]}],"synonyms":["slopes","hillsides","mountain slopes"],"phonetic":"/ˈmaʊn.tən.saɪdz/","extraExplanation":["“Mountainsides”常用于描写自然景观（树林、花海、积雪）或地质风险（landslides 山体滑坡、erosion 侵蚀）。比起更中性的“slopes”，“mountainsides”更强调“山的侧面/山体”这一整体画面，常见于旅行写作与文学描写。","相关常用搭配：on the mountainside（在山坡上），along the mountainside（沿着山坡），a village on the mountainside（山坡上的村庄），steep mountainsides（陡峭的山坡）。"]}
{"word":"mountaintop","summary":{"en":"Mountaintop means the summit of a mountain, and it can also mean a figurative peak of success or feeling.","zh":"mountaintop 指山顶/峰顶，也可比喻人生或事业的巅峰、最高点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The top or highest part of a mountain; the summit.","zh":"山顶；山的最高处；峰顶。"},"examples":[{"en":"We reached the mountaintop just before sunrise.","zh":"我们在日出前到达了山顶。"},{"en":"From the mountaintop, you can see the whole valley.","zh":"从山顶你可以看到整个山谷。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) The highest point of success, achievement, or emotion.","zh":"（比喻）巅峰；最高成就或最强烈的情感时刻。"},"examples":[{"en":"Winning the championship was the mountaintop of her career.","zh":"赢得冠军是她职业生涯的巅峰。"},{"en":"After years of hard work, he finally felt he’d reached the mountaintop.","zh":"多年努力之后，他终于觉得自己登上了巅峰。"}]}],"synonyms":["summit","peak","top","highest point","zenith"],"phonetic":"/ˈmaʊn.tənˌtɑp/","extraExplanation":["“mountaintop”常用作名词，也常写作 two words（mountain top）。作比喻时，在英语里常与“journey/struggle（旅程/奋斗）”搭配，暗示过程艰难、到达终点或高峰。","文化提示：在美国公共演讲与宗教语境中，“mountaintop”有时带有象征意义（如“站在山顶看见希望/未来”），常用来表达愿景、信念或胜利在望。"]}
{"word":"mountaintops","summary":{"en":"Mountaintops means the tops/peaks of mountains, and it can also mean the highest points or greatest successes in life (figuratively).","zh":"mountaintops 指“山顶/山峰最高处”（复数），也可比喻“巅峰、最高成就”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest parts (peaks) of mountains; the areas at the very top","zh":"山顶；山峰的最高处（复数）"},"examples":[{"en":"Snow covered the mountaintops all winter.","zh":"整个冬天，雪覆盖着山顶。"},{"en":"From the airplane window, we could see the mountaintops rising above the clouds.","zh":"从飞机窗户往外看，我们能看到山顶高出云层。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) the greatest or most successful moments; the “high points” of an experience or career","zh":"（比喻）巅峰时刻；最高成就；人生/事业的高点（复数）"},"examples":[{"en":"Winning the award was one of the mountaintops of her career.","zh":"获奖是她职业生涯的巅峰之一。"},{"en":"After reaching a few mountaintops, he learned to enjoy the journey too.","zh":"到达几个巅峰之后，他也学会了享受过程。"}]}],"synonyms":["peaks","summits","high points","pinnacles"],"phonetic":"/ˈmaʊn.tənˌtɑp/","extraExplanation":["“mountaintop(s)”常见于英语隐喻：把成功、突破、希望比作“登上山顶”。在演讲与文学中也很常见，比如马丁·路德·金在《I’ve Been to the Mountaintop》中用“山顶”象征远见与信念。"]}
{"word":"mountainward","summary":{"en":"Mountainward means “toward the mountains,” used as an adverb or adjective.","zh":"mountainward 表示“向山里/朝山的方向”，可作副词或形容词使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the mountains; in the direction of the mountains","zh":"向山地；朝山的方向"},"examples":[{"en":"The road curves mountainward after the bridge.","zh":"过了桥以后，道路向山里弯去。"},{"en":"We drove mountainward to escape the heat in the city.","zh":"我们开车往山里去，躲开城市的炎热。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving or facing toward the mountains","zh":"朝向山地的；向山而行的"},"examples":[{"en":"A mountainward wind brought cooler air by evening.","zh":"傍晚时分，一阵朝山而来的风带来了更凉的空气。"},{"en":"They took the mountainward trail at the fork.","zh":"他们在岔路口选择了通往山里的那条小路。"}]}],"synonyms":["toward the mountains","upcountry","inland (in some contexts)"],"phonetic":"/ˈmaʊntənwɚd/","extraExplanation":["“-ward”是英语里很常见的后缀，表示“朝……方向”（如：homeward 回家方向、seaward 向海、northward 向北）。所以 mountainward 字面意思就是“朝山的方向”。这种词在书面语、叙述性描写（尤其是自然与旅行写作）中更常见，口语里也可以用 toward the mountains 来替代。"]}
{"word":"mountainwards","summary":{"en":"Mountainwards means “toward the mountains” or “on the side facing the mountains.”","zh":"mountainwards 指“朝山的方向”或“在靠山/面向山的一侧”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the mountains; in the direction of mountainous areas.","zh":"朝山的方向；向山区去。"},"examples":[{"en":"The wind was blowing mountainwards, carrying cooler air into the valley.","zh":"风朝山那边吹，把更凉爽的空气带进了山谷。"},{"en":"We hiked mountainwards until the trees thinned out and the view opened up.","zh":"我们一路向山里徒步，直到树木变稀疏、视野变开阔。"}]},{"partOfSpeech":"adv.","definition":{"en":"On the side facing the mountains; toward the mountains from a particular place.","zh":"在靠山的一侧；从某个地点看向山的一边。"},"examples":[{"en":"The rooms facing mountainwards are quieter than the ones facing the street.","zh":"朝山那侧的房间比朝街的房间更安静。"},{"en":"Turn mountainwards at the crossroads and you’ll reach the trailhead.","zh":"在十字路口朝山的方向拐，就能到登山口。"}]}],"synonyms":["toward the mountains","inland (in some contexts)","upcountry (in some regions)"],"phonetic":"/ˈmaʊn.tən.wɚdz/","extraExplanation":["“mountainwards”由“mountain + -wards”构成，-wards表示“朝……方向”（如：homewards, northwards）。在美式英语里也常见“-ward”（如：toward, eastward），但“-wards”并不算错误，只是更偏英式或更文学化的表达。","在日常口语中，人们更常说“toward(s) the mountains”或“in the direction of the mountains”；“mountainwards”更常见于书面描写、旅行写作或文学语境，用来营造画面感。"]}
{"word":"mountainy","summary":{"en":"Mountainy means having many mountains; a less common, more informal alternative to mountainous.","zh":"mountainy 指“多山的”；比 mountainous 更少见、较口语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having many mountains; full of mountains","zh":"多山的；山地很多的"},"examples":[{"en":"They live in a mountainy region where winters are long and cold.","zh":"他们住在一个多山的地区，冬天漫长而寒冷。"},{"en":"The country’s mountainy north is popular with hikers.","zh":"这个国家多山的北部很受徒步旅行者欢迎。"}]}],"synonyms":["mountainous","hilly","rugged"],"phonetic":"/ˈmaʊn.tən.i/","extraExplanation":["“mountainy”是由名词“mountain”加形容词后缀“-y”构成，意思是“有……特征的”。日常英语里更常见的说法是“mountainous”（更正式、书面语更常用）。","用法小提示：通常说“a mountainous/mountainy area/region/terrain”（多山的地区/地形）。如果指“在山里的生活”，更自然的表达常是“in the mountains”或“mountain life”。"]}
{"word":"mountance","summary":{"en":"“Mountance” is not standard English; it’s usually a misspelling of “mountain” or “maintenance.”","zh":"“mountance”不是标准英语，通常是“mountain”或“maintenance”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word; usually a misspelling or nonstandard form. In most contexts people actually mean “mountain” (a large natural hill) or “maintenance” (upkeep/repair).","zh":"不是现代标准英语单词；通常是拼写错误或非标准写法。多数语境下人们想表达的其实是“mountain（山）”或“maintenance（维护/保养）”。"},"examples":[{"en":"I couldn’t find “mountance” in a standard dictionary—did you mean “mountain”?","zh":"我在标准词典里找不到“mountance”——你想写的是“mountain（山）”吗？"},{"en":"If you mean upkeep of a building, the correct word is “maintenance,” not “mountance.”","zh":"如果你指的是建筑的保养维护，正确的词是“maintenance”，不是“mountance”。"}]}],"phonetic":"/ˈmaʊn.təns/","extraExplanation":["“mountance”偶尔会出现在拼写错误、自动纠错失败、或非母语写作中，但在正式写作与考试中会被视为错误拼写。","快速判断你要用哪个词：\n- 说“爬山、山脉、山顶” → mountain /ˈmaʊn.tən/\n- 说“维修、保养、维护费用” → maintenance /ˈmeɪn.tə.nəns/"]}
{"word":"mountant","summary":{"en":"Mountant means “rising/climbing upward; increasing,” and it is also an old heraldry term for an animal shown rising or climbing.","zh":"mountant 表示“上升的/向上攀升的；增长的”，也可作纹章学里的旧术语，指动物呈上升或攀爬姿态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"rising or climbing upward; increasing.","zh":"上升的；向上攀升的；（数量等）增长的。"},"examples":[{"en":"Mountant costs have made the project harder to finish.","zh":"不断上涨的成本让这个项目更难完成。"},{"en":"They watched the mountant smoke from the chimney.","zh":"他们看着烟囱里升起的烟。"}]},{"partOfSpeech":"adj.","definition":{"en":"(heraldry) describing an animal shown climbing or rising upward (an old, specialized use).","zh":"（纹章学）指纹章中被画成向上攀爬或上升姿态的动物（较古老、较专业的用法）。"},"examples":[{"en":"In the old description, a lion mountant appears beside the shield.","zh":"在那段古老的描述里，盾牌旁有一只呈“mountant（上升/攀爬）”姿态的狮子。"},{"en":"The catalog uses heraldic terms like rampant and mountant.","zh":"这本目录使用了像 rampant 和 mountant 这样的纹章术语。"}]}],"synonyms":["rising","increasing","soaring","climbing","ascending"],"phonetic":"/ˈmaʊntənt/","extraExplanation":["“mountant”在现代英语里很少见，通常会用更常见的词来表达同样意思，比如 rising（上升的）、increasing（增长的）、soaring（飙升的）。","它来自动词 mount（攀登；登上；上升）的含义，在文学或较正式/古风的语境中偶尔出现。","在纹章学（heraldry）里，它属于描述图案姿态的专门词汇；日常交流中几乎不会用到。"]}
{"word":"mountebank","summary":{"en":"A mountebank is a charlatan—someone who deceives others by pretending to be an expert, often selling fake cures or false promises.","zh":"mountebank 指“江湖骗子/冒充专家的人”，常靠夸大宣传卖假药或做虚假承诺来骗人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who tricks people by pretending to have special knowledge or skills; a fake doctor or a dishonest salesperson (a charlatan).","zh":"骗子；江湖郎中；靠吹嘘和假本事欺骗他人的人（如冒充名医或不诚实的推销者）。"},"examples":[{"en":"The tabloids praised him as a genius, but many scientists called him a mountebank.","zh":"小报把他吹成天才，但许多科学家称他是个骗子。"},{"en":"A mountebank sold “miracle” pills that did nothing.","zh":"一个江湖骗子卖“神药”，其实一点用也没有。"}]}],"synonyms":["charlatan","fraud","con artist","quack"],"phonetic":"/ˈmaʊn.təˌbæŋk/","extraExplanation":["这个词常见于比较正式或带讽刺意味的语境，强调“靠表演式的自信与夸大宣传来骗取信任”。语气通常比 general 的 “liar（说谎者）” 更强，也比 “salesperson（销售）” 更负面。","词源上与早期在集市、广场上站到高处（如长凳）向人群兜售“灵药”的江湖郎中有关，因此常带有“街头表演+骗术”的画面感。","近义词：charlatan（骗子/江湖郎中，常用）、fraud（骗子/骗局）、con artist（诈骗犯，偏口语）。"]}
{"word":"mountebanked","summary":{"en":"“Mountebanked” means “swindled or misled by showy, false claims” (a rare verb form of mountebank).","zh":"“mountebanked”意为“用夸张的虚假说辞行骗、把人骗了”（mountebank 的较少见动词形式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle) deceived or tricked someone by using showy, false claims; swindled like a charlatan.","zh":"（动词过去式/过去分词）用夸张的虚假说辞行骗；像江湖骗子一样骗取（他人）。"},"examples":[{"en":"He mountebanked investors with flashy presentations and fake numbers.","zh":"他用花哨的演示和虚假的数据把投资人骗得团团转。"},{"en":"The public was mountebanked into buying a “miracle cure” that didn’t work.","zh":"大众被忽悠去买一种并不奏效的“神药”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective, from the past participle) cheated or misled by a fraud.","zh":"（作形容词，源自过去分词）被骗子欺骗的；被误导的。"},"examples":[{"en":"They felt mountebanked after realizing the product was just a cheap imitation.","zh":"他们发现产品只是廉价仿品后，觉得自己被坑骗了。"}]}],"synonyms":["swindled","duped","conned","hoodwinked","bamboozled","defrauded"],"phonetic":"/ˈmaʊntəˌbæŋkt/","extraExplanation":["“mountebank”更常见的用法是名词，表示“江湖郎中/骗子/夸夸其谈的江湖人物（charlatan）”。动词形式“to mountebank”以及其过去式“mountebanked”比较少见，写作中多用于强调“用表演性、夸张的手段行骗”。","词源可追溯到意大利语 *montimbanco*（字面意为“爬上长凳”），指早期集市上站在长凳上兜售药水、表演吸引人群的商贩；因此这个词带有“靠噱头与话术骗人”的文化联想。"]}
{"word":"mountebankeries","summary":{"en":"Mountebankeries means dishonest, showy tricks used to deceive people—often like a quack’s sales performance.","zh":"mountebankeries 指为了欺骗他人而进行的夸张表演和花招，常带“江湖骗术/假药郎中式推销”含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dishonest tricks or showy behavior used to deceive people, especially to sell something or gain attention; quackery","zh":"（尤指为推销或博取关注而进行的）江湖骗术；哗众取宠的欺骗行为；江湖郎中的骗人把戏"},"examples":[{"en":"The article criticized the politician’s mountebankeries during the campaign.","zh":"这篇文章批评了那位政治人物在竞选期间的哗众取宠式欺骗表演。"},{"en":"She was tired of the online health mountebankeries promising “miracle” cures.","zh":"她对网上那些打着“奇迹疗法”旗号的保健骗局感到厌倦。"},{"en":"Behind the confident sales talk, there were mostly mountebankeries and half-truths.","zh":"在自信的推销话术背后，多半是江湖骗术和半真半假的说法。"}]}],"synonyms":["quackery","charlatanism","humbug","deception","trickery","snake oil"],"phonetic":"/ˌmaʊntəˈbæŋkəriz/","extraExplanation":["“mountebankeries”是“mountebankery”的复数，常用于更正式或带批判语气的写作，强调一连串/各种各样的骗局与花招。","词源上与“mountebank（江湖郎中、卖假药的人）”相关：早期这类人常站在长凳（bank）上（mount）当众表演并兜售“灵药”，因此这个词带有“夸张表演+欺骗”的文化联想。"]}
{"word":"mountebankery","summary":{"en":"Mountebankery means showy, dishonest trickery—often linked to fake medical cures, and more broadly to any flashy deception.","zh":"mountebankery 指以夸张表演和虚假承诺行骗的做法，常与兜售假药相关，也可泛指任何领域的哗众取宠式欺骗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of tricking people with showy, dishonest promises—especially selling fake cures or pretending to have special medical skill.","zh":"江湖骗术；吹嘘行骗（尤指兜售假药、冒充名医等以夸张表演骗取信任）。"},"examples":[{"en":"The newspaper exposed the mountebankery behind the so-called miracle cure.","zh":"报纸揭露了所谓“神奇疗法”背后的江湖骗术。"},{"en":"He used loud speeches and flashy posters, but it was pure mountebankery.","zh":"他靠大声演讲和花哨海报招揽人，但那纯粹是吹嘘行骗。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, showy deception or quack-like behavior in any field (not only medicine).","zh":"（泛指）任何领域中哗众取宠式的欺骗；冒牌行家的作派。"},"examples":[{"en":"Voters grew tired of political mountebankery and wanted clear plans.","zh":"选民厌倦了政治上的哗众取宠式欺骗，更想要清晰的方案。"},{"en":"The film mocks the mountebankery of self-proclaimed gurus.","zh":"这部电影嘲讽了自封“导师”的冒牌行家作派。"}]}],"synonyms":["quackery","charlatanism","humbuggery","fraud","scam","deception"],"phonetic":"/ˌmaʊn.təˈbæŋ.kɚ.i/","extraExplanation":["词源提示：mountebank 原指在集市上“爬上长凳（mount a bank）”大声推销的人，后来常与卖假药、夸大疗效的“江湖郎中/骗子”联系在一起。mountebankery 就是这种行径或风气。","语体与语感：这个词偏书面、带批判和讽刺意味；日常口语里更常用 scam（骗局）、quackery（庸医/假医术）、snake-oil salesmanship（卖假药式推销）等。"]}
{"word":"mountebankish","summary":{"en":"Mountebankish means charlatan-like—flashy, boastful, and untrustworthy or insincere.","zh":"mountebankish 指“像江湖骗子一样的”：浮夸爱吹嘘、靠噱头包装，给人不可信或不真诚的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a charlatan (a fake expert): showy, boastful, and trying to impress people in a dishonest way.","zh":"像江湖骗子（冒充专家的人）一样：浮夸、爱吹嘘，用不诚实的方式博取注意或信任。"},"examples":[{"en":"The ad’s mountebankish promises made the product sound magical but unrealistic.","zh":"这则广告里江湖骗子式的承诺把产品说得像魔法一样，但不太可信。"},{"en":"He gave a mountebankish speech full of big claims and little evidence.","zh":"他的演讲很“江湖骗子式”，满是夸大的说法，却几乎没有证据。"}]},{"partOfSpeech":"adj.","definition":{"en":"Overly theatrical or attention-seeking in a way that feels insincere.","zh":"过度戏剧化、刻意博眼球，给人不真诚的感觉。"},"examples":[{"en":"Her mountebankish style worked on some viewers, but others found it fake.","zh":"她那种哗众取宠的风格对一些观众有效，但也有人觉得很假。"}]}],"synonyms":["charlatan-like","quackish","fraudulent","showy","insincere"],"phonetic":"/ˈmaʊntɪˌbæŋkɪʃ/","extraExplanation":["“mountebank”原指早期欧洲在集市上站在台子上卖药、表演并推销“灵药”的人，常带有夸张表演与欺骗成分；词根可追溯到意大利语，含义类似“爬上长凳/台子的人”。“-ish”表示“有点……的、像……的”，所以“mountebankish”就是“带有江湖骗子/江湖术士气质的”。","这个词比较少见，语气偏尖刻，常用于批评某人（或宣传/演讲）华而不实、靠噱头包装来骗取信任。写作中更常见的替代词有“charlatan-like”“quackish”“fraudulent”。"]}
{"word":"mountebankism","summary":{"en":"Mountebankism means dishonest, theatrical trickery—especially fake expertise or miracle cures used to deceive people.","zh":"mountebankism 指带表演性的欺骗作风，尤指冒充专家或兜售“神奇疗法”来骗人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice or style of a mountebank: dishonest showmanship, especially pretending to have special knowledge or a “miracle” cure in order to trick people.","zh":"江湖骗术/骗术作风：用夸张表演与虚假承诺（常见于伪专家、神奇疗法等）来欺骗他人的行为或风格。"},"examples":[{"en":"The ads promised instant weight loss, but it was pure mountebankism.","zh":"这些广告承诺立刻减肥，但完全是江湖骗术。"},{"en":"Some influencers use mountebankism to sell expensive “detox” products.","zh":"有些网红用江湖骗术来推销昂贵的“排毒”产品。"}]}],"synonyms":["charlatanism","quackery","snake-oil selling","humbuggery","fraudulence","deception"],"phonetic":"/ˈmaʊn.təˌbæŋ.kɪz.əm/","extraExplanation":["词源与语感：mountebank 原指“在台上（mount）卖药（bank）的人”，常见于集市上靠表演吸引围观、兜售“灵药”的江湖郎中；因此 mountebankism 带有“看似专业、实则忽悠”的强烈贬义。","使用场景：常用于批评伪科学、虚假医疗、夸大其词的商业宣传或政治表演（如用戏剧化语言制造信任却缺乏证据）。","相关表达：snake oil（江湖假药/骗人的疗法）、quackery（庸医行骗/假医术）、charlatanism（骗子作风，和本词很接近）。"]}
{"word":"mountebankly","summary":{"en":"Mountebankly means “like a mountebank”: showy, persuasive, but deceptive—either as an adjective or adverb.","zh":"mountebankly 表示“像江湖骗子一样”：浮夸、很会忽悠但带欺骗性（可作形容词或副词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Like a mountebank; showy and dishonest in a way meant to trick people (like a “quack” or “charlatan”).","zh":"（形容词）像江湖骗子/冒牌专家那样的；用浮夸表演来欺骗他人的。"},"examples":[{"en":"The ad’s mountebankly promises of a “miracle cure” made people suspicious.","zh":"广告里那种“神奇治愈”的江湖骗子式承诺让人起了疑心。"},{"en":"He used mountebankly charm to sell cheap products as if they were luxury goods.","zh":"他用一种江湖骗子式的迷人手段，把廉价货吹成奢侈品来卖。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Adv.) In a mountebank-like way; in a showy, deceptive manner.","zh":"（副词）以江湖骗子的方式；用浮夸而带欺骗性的方式。"},"examples":[{"en":"She spoke mountebankly, exaggerating every detail to win the audience.","zh":"她讲话很“江湖骗子式”，把每个细节都夸大来博取听众。"},{"en":"The influencer promoted the product mountebankly, hiding the real drawbacks.","zh":"那位网红用很“江湖骗子式”的方式推广产品，把真正的缺点藏起来。"}]}],"synonyms":["charlatan-like","quackish","fraudulent","deceptive","showy"],"phonetic":"/ˌmaʊntəˈbæŋkli/","extraExplanation":["“mountebankly”来自名词 mountebank（江湖骗子、冒牌医生）。mountebank 一词源自意大利语，字面意思接近“爬上长凳/台子的人”，指早期在集市上站到台子上表演、兜售“灵药”的人。","该词很少见，更常用的表达是 “charlatan-like / quackish / scammy / showy but dishonest”。在正式写作或讽刺语境中偶尔出现。"]}
{"word":"mountebanks","summary":{"en":"“Mountebanks” is the plural of “mountebank,” meaning charlatans who deceive people with showy claims, often about medicine or expertise.","zh":"mountebanks 是 mountebank 的复数，指靠夸张承诺和表演欺骗他人的江湖骗子、伪专家（常与卖假药相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who pretends to have special knowledge or skills in order to trick people (a charlatan or fraud); often someone who sells fake cures or makes showy promises","zh":"江湖骗子；吹牛行骗的人（常指兜售假药、夸口能治百病或用花招骗钱的人）"},"examples":[{"en":"The “doctor” turned out to be a mountebank selling fake medicine.","zh":"那个“医生”原来是个兜售假药的江湖骗子。"},{"en":"Don’t trust every confident speaker—some are just mountebanks with good marketing.","zh":"别轻信每个自信的演讲者——有些只是擅长营销的骗子。"}]}],"synonyms":["charlatan","fraud","con artist","quack","impostor","swindler"],"phonetic":"/ˈmaʊntəˌbæŋk/","extraExplanation":["“Mountebank” 来自意大利语 *monta in banco*（意为“爬上长凳/台子”），指早期在集市上站到台子上表演、吆喝卖药的人；后来这个词带有明显的贬义，强调“靠夸张表演和花言巧语行骗”。","你输入的 **mountebanks** 是复数形式；单数是 **mountebank**。在文学或评论文章中，这个词常用来讽刺“伪专家”“江湖大师”，语气较尖刻。"]}
{"word":"mounted","summary":{"en":"Mounted can mean “on horseback,” “attached/fixed onto something,” or it can be the past form of mount (“got on/climbed/rose”).","zh":"mounted 可表示“骑马的”，也可表示“安装/固定好的”，还可以是 mount 的过去式/过去分词（“骑上/登上/上升”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) riding on a horse; on horseback.","zh":"（人）骑在马上的；骑马的。"},"examples":[{"en":"The mounted officers rode through the park.","zh":"骑警骑马穿过公园。"},{"en":"A mounted messenger delivered the news quickly.","zh":"一名骑马信使很快送达了消息。"}]},{"partOfSpeech":"adj.","definition":{"en":"Attached or fixed onto something (often on a wall, a base, or a stand).","zh":"安装好的；固定在某物上的（常指固定在墙上、底座上或支架上）。"},"examples":[{"en":"The TV is mounted on the wall.","zh":"电视挂在墙上。"},{"en":"A mounted camera recorded the lecture.","zh":"安装在支架上的摄像头录下了讲座。"},{"en":"The specimen was mounted in a frame for display.","zh":"标本被装裱在框里用于展示。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “mount”: to climb onto (a horse, bike, etc.) or to get on; to begin to rise or increase (less common).","zh":"“mount”的过去式/过去分词：骑上/跨上（马、自行车等）或登上；（较少用）开始上升或增加。"},"examples":[{"en":"She mounted her bicycle and rode away.","zh":"她跨上自行车骑走了。"},{"en":"The hikers mounted the steep path at dawn.","zh":"徒步者在黎明时攀上陡峭的小路。"}]}],"synonyms":["horseback (for the riding sense)","wall-mounted","attached","fixed","installed","set up"],"phonetic":"/ˈmaʊn.tɪd/","extraExplanation":["“mounted”在新闻和文学里常见于“mounted police（骑警）”“mounted troops（骑兵）”，强调“骑在马上的执法/军队”。","表示“安装”时，英语里很常用被动结构：be mounted on/in/to（如：mounted on the wall 挂在墙上；mounted in a frame 装裱在框内）。"]}
{"word":"mountee","summary":{"en":"Mountie (often misspelled as “mountee”) means an RCMP officer in Canada.","zh":"Mountie（常被误拼为“mountee”）指加拿大皇家骑警（RCMP）的警官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Royal Canadian Mounted Police (RCMP); a Canadian federal police officer (often pictured on horseback)","zh":"加拿大皇家骑警（RCMP）的成员；加拿大联邦警察（常被描绘为骑马执勤）"},"examples":[{"en":"A Mountie helped direct traffic during the parade.","zh":"游行期间，一名加拿大皇家骑警帮助指挥交通。"},{"en":"In movies, Mounties are often shown wearing red uniforms.","zh":"在电影里，皇家骑警常常穿着红色制服出现。"}]}],"synonyms":["RCMP officer","Canadian federal police officer"],"phonetic":"/ˈmaʊn.ti/","extraExplanation":["“Mountie”是更常见的拼写；你输入的“mountee”通常被视为拼写错误或非常少见的变体。","“Mountie”来自“mounted（骑马的）”，因为早期骑警经常骑马巡逻。如今RCMP主要也使用汽车等方式执法，但形象上仍保留“红色制服+骑马”的经典符号。","在文学与影视中，“Mountie”常被用来象征加拿大形象、边境与荒野故事（例如早期的冒险小说与电影）。"]}
{"word":"mounter","summary":{"en":"A mounter is someone who mounts something—most commonly a person who mounts (prepares and attaches) pictures or artwork for display.","zh":"mounter 指“把某物装上/固定好的人”，最常见是指为展示而装裱、固定照片或艺术品的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that mounts (attaches and frames) pictures, artworks, or photos onto backing or into a display","zh":"装裱者；把照片/画作固定到衬板或装框展示的人（或公司）"},"examples":[{"en":"The museum hired a professional mounter to prepare the prints for the exhibition.","zh":"博物馆请了一位专业装裱师来为展览准备这些版画。"},{"en":"Ask the mounter to use acid-free board so the photo won’t yellow over time.","zh":"让装裱师用无酸衬板，这样照片久了就不会发黄。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who mounts something (puts it on, gets on it, or sets it in position), such as a rider mounting a horse","zh":"骑上或安置某物的人（如骑手上马）"},"examples":[{"en":"The mounter swung into the saddle in one smooth motion.","zh":"那名骑手利落地翻身上马。"},{"en":"In the training exercise, each mounter practiced mounting safely and quickly.","zh":"在训练中，每位骑手都练习如何安全又迅速地上马。"}]}],"synonyms":["framer","picture framer","installer","rider"],"phonetic":"/ˈmaʊntər/","extraExplanation":["“mounter”来自动词 mount（登上；安装；装裱）。日常英语里更常说 the person who mounts / a picture framer / a mount specialist；“mounter”本身偏行业或说明性用法。"]}
{"word":"mounters","summary":{"en":"“Mounters” is the plural of “mounter”: someone (or something) that mounts/installs, rides, or climbs.","zh":"“mounters”是“mounter”的复数：指安装者/安装装置，也可指骑手或攀登者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that mounts something (puts it on a support, fixes it in place, or places it on a mount); an installer","zh":"把某物安装到支架/底座上的人或装置；安装工"},"examples":[{"en":"The camera mounter fixed the lens securely to the tripod plate.","zh":"相机安装人员把镜头牢牢固定在三脚架快装板上。"},{"en":"Different mounters are designed for different TV sizes.","zh":"不同的电视挂架适用于不同尺寸的电视。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who mounts a horse or other animal; a rider","zh":"骑上马或其他动物的人；骑手"},"examples":[{"en":"Skilled mounters can calm a nervous horse quickly.","zh":"熟练的骑手能很快安抚紧张的马。"}]},{"partOfSpeech":"n.","definition":{"en":"a climber (someone who mounts a mountain or structure)","zh":"登山者；攀登者"},"examples":[{"en":"Early mounters of the peak left notes in a metal box near the summit.","zh":"早期登顶者在山顶附近的金属盒里留下了纸条。"}]}],"synonyms":["installers","fitters","mounting brackets","riders","climbers"],"phonetic":"/ˈmaʊntɚ/","extraExplanation":["“mounters”是复数形式，单数是“mounter”。在日常英语里，更常见的说法是用更具体的词：如 installer（安装工）、mounting bracket / mount（支架/底座）、rider（骑手）、climber（攀登者）。"]}
{"word":"mountie","summary":{"en":"A “Mountie” is an RCMP officer—a member of Canada’s national police force.","zh":"“Mountie”指加拿大皇家骑警（RCMP）的警官，即加拿大国家级警察机构的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Royal Canadian Mounted Police (RCMP); a Canadian federal police officer, traditionally known for a red uniform and horseback patrols (especially in history and popular culture)","zh":"（加拿大）皇家骑警（RCMP）成员；加拿大联邦警察（在历史与流行文化中常以红色制服、骑马巡逻的形象著称）"},"examples":[{"en":"When we visited Ottawa, we saw two Mounties standing guard in their red uniforms.","zh":"我们去渥太华旅游时，看见两名皇家骑警穿着红色制服站岗。"},{"en":"In many movies, a Mountie rides through the snowy wilderness to keep the peace.","zh":"在许多电影里，皇家骑警会骑马穿越雪地荒野来维持治安。"}]}],"synonyms":["RCMP officer","Canadian Mountie","member of the RCMP"],"phonetic":"/ˈmaʊnti/","extraExplanation":["“Mountie”是加拿大文化中很有代表性的称呼，来自“mounted（骑马的）”，因为早期的骑警经常骑马执法。如今RCMP仍是加拿大的重要警务机构，但日常工作多与现代警察类似，不一定骑马。","在口语中“Mountie”通常是友好、非正式的说法；正式写法更常见“RCMP officer”或“a member of the RCMP”。"]}
{"word":"mounties","summary":{"en":"“Mounties” is the plural of “Mountie,” meaning officers of the Royal Canadian Mounted Police (RCMP).","zh":"“mounties”是“Mountie”的复数，指加拿大皇家骑警（RCMP）的警员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the Royal Canadian Mounted Police (RCMP); a Canadian federal police officer, traditionally known for wearing a red uniform in ceremonies.","zh":"加拿大皇家骑警（RCMP）成员；加拿大联邦警察，传统上以典礼时穿红色制服而闻名。"},"examples":[{"en":"Tourists took photos with the Mounties outside the Parliament building.","zh":"游客在议会大厦外和皇家骑警合影。"},{"en":"The Mounties investigated the case in a remote community.","zh":"皇家骑警在一个偏远社区调查了这起案件。"}]}],"synonyms":["RCMP officers","Royal Canadian Mounted Police officers","Canadian federal police (informal)"],"phonetic":"/ˈmaʊn.ti/","extraExplanation":["“Mountie”是口语/非正式用法，最常见于加拿大英语，也被美国英语理解。正式说法是“an officer of the Royal Canadian Mounted Police (RCMP)”。","之所以叫“Mounted”，源于早期警队经常骑马巡逻；如今多为机动车执勤，但在仪式、宣传或特定任务中仍可能骑马。","“the Mounties”常用作集合名词，指RCMP整体或一群骑警。文化形象常与加拿大国家象征、红色礼服（red serge）联系在一起。"]}
{"word":"mounting","summary":{"en":"“Mounting” most often means “increasing” (mounting pressure). It can also mean an attachment/support (a mounting) or the -ing form of “mount” (to climb/get on/attach).","zh":"“mounting”最常表示“不断增加的”（如mounting pressure）。也可指“安装/支架”（a mounting），或作为动词mount的-ing形式（登上/攀登/安装）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"increasing or growing bigger/stronger, often causing worry or pressure","zh":"（压力、问题、情绪等）不断增加的；愈演愈烈的"},"examples":[{"en":"There is mounting pressure on the company to lower prices.","zh":"公司面临着越来越大的降价压力。"},{"en":"She felt mounting anxiety as the exam got closer.","zh":"随着考试临近，她感到焦虑不断加剧。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of attaching or fixing something in place; the way something is attached","zh":"安装；固定；（物品的）底座/支架；固定方式"},"examples":[{"en":"The camera comes with a wall mounting.","zh":"这台相机配有墙面安装支架。"},{"en":"Check the mounting before you start the machine.","zh":"启动机器前检查一下安装是否牢固。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “mount”: getting onto something (like a horse or bike), climbing up, or attaching something","zh":"“mount”的现在分词：骑上/登上；攀登；安装（某物）"},"examples":[{"en":"He is mounting the horse carefully.","zh":"他正小心地骑上马。"},{"en":"Firefighters were mounting the stairs in heavy smoke.","zh":"消防员在浓烟中正沿楼梯向上冲。"}]}],"synonyms":["increasing","growing","rising","escalating","building"],"phonetic":"/ˈmaʊntɪŋ/","extraExplanation":["“mounting”作形容词时很常见的搭配有：mounting pressure（压力增大）、mounting evidence（证据越来越多）、mounting tension（紧张加剧）、mounting costs（成本上升）。这些通常带有“逐渐累积、让人更难应对”的语感。"]}
{"word":"mountingly","summary":{"en":"“Mountingly” means “increasingly” or “with growing intensity,” but it’s rare in modern English.","zh":"“mountingly”表示“越来越、逐渐加剧”，但在现代英语中很少用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare) In a way that is mounting; increasingly or with growing intensity.","zh":"（罕见）以“逐渐增加/加剧”的方式；越来越强烈地。"},"examples":[{"en":"Mountingly, public pressure forced the company to change its policy.","zh":"公众压力不断加剧，迫使公司改变了政策。"},{"en":"She spoke mountingly fast as her excitement grew.","zh":"随着兴奋增加，她说话越来越快。"}]}],"synonyms":["increasingly","more and more","progressively","with mounting intensity"],"phonetic":"/ˈmaʊntɪŋli/","extraExplanation":["“mountingly”在现代英语里非常少见，很多母语者也不常用。更自然的表达通常是：increasingly（越来越）、more and more（越来越）、with mounting + 名词（例如 with mounting concern/pressure/anger 表示“随着担忧/压力/愤怒不断增加”）。","“mounting”本义有“攀登、骑上（马）”，引申为“逐渐累积、加剧”（如 mounting costs 成本不断上升）。因此 mountingly 也带有“逐步累积到更强烈”的感觉。"]}
{"word":"mountings","summary":{"en":"“Mountings” usually means the fittings or hardware used to attach/support something; it can also mean decorative settings or frames.","zh":"“Mountings”通常指用于安装、固定或支撑的配件/五金件；也可指装饰性的镶嵌托或装裱/相框等固定底座。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pieces of hardware or fittings used to attach, support, or hold something in place (plural of “mounting”)","zh":"（mounting 的复数）用于固定、支撑或安装某物的五金件/安装配件"},"examples":[{"en":"The TV comes with wall mountings and screws.","zh":"这台电视配有壁挂安装件和螺丝。"},{"en":"Check the mountings on the bicycle seat to make sure they’re tight.","zh":"检查一下自行车座椅的安装件，确保拧紧了。"}]},{"partOfSpeech":"n.","definition":{"en":"decorative settings or frames that hold an object (such as a gem, photo, or artwork)","zh":"（装饰性的）镶嵌托/底座；相框；装裱底托"},"examples":[{"en":"The jewels were displayed in gold mountings.","zh":"这些珠宝镶在金质托座上展示。"},{"en":"The museum updated the mountings for the paintings to protect them from light.","zh":"博物馆更新了画作的装裱/固定底托，以保护它们免受光照影响。"}]}],"synonyms":["mounts","brackets","fittings","fixtures","fasteners","settings"],"phonetic":"/ˈmaʊntɪŋz/","extraExplanation":["“mountings”常见于说明书、维修或工程语境，强调“用于安装/固定的配件（通常有多件）”。口语里也常说 mounts / brackets / fittings。","相关词：mount（可作动词“安装、骑乘”）→ mounting（名词“安装件/固定装置”；也可指“正在安装的动作”）→ mountings（多件安装配件）。"]}
{"word":"mountlet","summary":{"en":"A rare word meaning a small mountain or hill.","zh":"一个罕用词，表示“小山/小丘”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, literary) A small mountain or hill; a little mound or knoll.","zh":"（罕用/文学用语）小山；小丘；小土堆/小隆起。"},"examples":[{"en":"A lone mountlet rose above the foggy fields.","zh":"一座小山丘从雾气笼罩的田野上方隆起。"},{"en":"We stopped on a grassy mountlet to rest and look over the valley.","zh":"我们在一座长满青草的小丘上停下歇息，俯瞰山谷。"},{"en":"In the poem, the mountlet becomes a quiet place for reflection.","zh":"在这首诗里，小山丘成了静思的地点。"}]}],"synonyms":["hillock","knoll","small hill"],"phonetic":"ˈmaʊntlɪt","extraExplanation":["“mountlet”并不常见，更多见于较旧的书面语或诗歌中。它由“mount（山）+ -let（表示‘小…’的后缀）”构成，语气带一点可爱、轻巧或文学色彩。日常英语更常用 hill, small hill, hillock, knoll。"]}
{"word":"mounts","summary":{"en":"“Mounts” can mean mountains (plural), riding animals, or the verb “mount” in third-person singular: increases, climbs onto, or attaches/installs.","zh":"“Mounts”可指“山（复数）”“坐骑（复数）”，也可作动词第三人称单数：指“增加/加剧”“登上/骑上”或“安装/固定”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Mountains or high hills.","zh":"（名词复数）山；高地（mountain 的复数或较文学化用法）。"},"examples":[{"en":"In the distance, the mounts were covered with snow.","zh":"远处的群山被白雪覆盖。"},{"en":"They traveled through the mounts to reach the village.","zh":"他们穿越群山到达那个村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Animals (especially horses) used for riding.","zh":"（名词复数）坐骑（尤指马等用于骑乘的动物）。"},"examples":[{"en":"The guards checked their mounts before the patrol.","zh":"卫兵在巡逻前检查了他们的坐骑。"},{"en":"She chose a calm mount for her first lesson.","zh":"第一次上课时，她选了一匹性格温顺的坐骑。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To increase or grow gradually; to build up.","zh":"（动词第三人称单数）增加；逐渐累积；上升。"},"examples":[{"en":"Pressure mounts when deadlines are close.","zh":"截止日期临近时，压力会增大。"},{"en":"Support for the plan mounts as more people learn the facts.","zh":"随着更多人了解事实，对该计划的支持在增加。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To climb onto something; to get on (a horse, bike, etc.).","zh":"（动词第三人称单数）登上；骑上（马、自行车等）。"},"examples":[{"en":"He mounts the horse carefully.","zh":"他小心地骑上马。"},{"en":"She mounts the steps and knocks on the door.","zh":"她走上台阶并敲门。"}]},{"partOfSpeech":"vt.","definition":{"en":"(verb, third-person singular) To attach, install, or place something on a support or surface.","zh":"（动词第三人称单数）安装；固定；把……装到支架/表面上。"},"examples":[{"en":"The technician mounts the camera on the wall.","zh":"技术员把摄像头安装在墙上。"},{"en":"He mounts the artwork in a simple frame.","zh":"他把画装裱在一个简洁的画框里。"}]}],"synonyms":["rises","increases","builds (up)","climbs","gets on","installs","attaches"],"phonetic":"/maʊnt/","extraExplanation":["“mounts”最常见的其实是动词第三人称单数（mounts）或名词复数（mounts）。在现代日常英语里表示“群山”时更常用 mountains；mounts 作为“山”的复数更偏文学或地名/风格化表达（例如某些诗歌、古风叙述）。","与“压力/紧张/怒气”等搭配时，mounts 常用来表达“逐渐加剧”的感觉：pressure mounts / tension mounts / anger mounts。"]}
{"word":"mounture","summary":{"en":"“Mounture” is not standard English; it’s likely a misspelling (often of “manure” or “mount”).","zh":"“mounture”不是标准英语词，通常是拼写错误（常见为“manure”或“mount”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling or typo. Common intended words include “manure” (fertilizer made from animal waste) or “mount”/“mounter” (to climb or to put something on).","zh":"不是标准英语单词，通常是拼写错误或打字错误。常见想表达的词包括“manure”（粪肥）或“mount / mounter”（攀登；安装/骑上；登山者/安装者等）。"},"examples":[{"en":"I couldn’t find “mounture” in the dictionary—did you mean “manure”?","zh":"我在词典里找不到“mounture”——你是不是想写“manure”（粪肥）？"},{"en":"Please check the spelling: “mounture” is likely a typo.","zh":"请检查拼写：“mounture”很可能是打错了。"}]}],"phonetic":"/ˈmaʊntʃər/","extraExplanation":["“mounture”在主流英语词典中通常查不到，因此没有统一、权威的读音与用法。最有帮助的做法是结合上下文：\n- 如果谈农业、施肥、气味、农场等，极可能是 manure（粪肥）。\n- 如果谈爬山、骑马、安装设备、把东西放到架子上等，可能是 mount（安装/攀登/骑上）或相关名词（如 mounter）。\n如果你把包含“mounture”的完整句子发来，我可以帮你精确判断想表达哪个词。"]}
{"word":"mounty","summary":{"en":"A “Mounty” is a member of Canada’s national police force, the Royal Canadian Mounted Police (RCMP).","zh":"“Mounty”指加拿大国家警察机构——加拿大皇家骑警（RCMP）的警员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Royal Canadian Mounted Police (RCMP); a Canadian mounted police officer (often seen in a red uniform in popular culture)","zh":"加拿大皇家骑警（RCMP）的警员；（常指在大众文化中穿红色制服的）加拿大骑警"},"examples":[{"en":"Tourists often ask to take photos with a Mounty in full dress uniform.","zh":"游客常常想和穿全套礼服制服的加拿大骑警合影。"},{"en":"In the movie, a Mounty travels north to investigate a crime.","zh":"在电影里，一名加拿大骑警北上调查一宗案件。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) relating to the RCMP or Canadian mounted police","zh":"（非正式）与加拿大皇家骑警/加拿大骑警有关的"},"examples":[{"en":"He wore a Mounty-style hat as part of his costume.","zh":"他戴了一顶骑警风格的帽子当作服装的一部分。"}]}],"synonyms":["RCMP officer","mounted police officer","Canadian police officer (context-dependent)"],"phonetic":"/ˈmaʊnti/","extraExplanation":["“Mounty”是口语/昵称式说法，通常指RCMP警员。它在英语里带有文化符号意味：常让人联想到红色外套、骑马巡逻等形象，但现实中的RCMP也执行现代警务工作，并不总是骑马。","用法上多用于加拿大相关语境；正式写作中更常用“RCMP officer”或“member of the RCMP”。"]}
{"word":"moup","summary":{"en":"Moup is a rare Scottish/archaic word meaning to mope or be gloomy, and it can also mean a gloomy mood.","zh":"moup 是较少见的苏格兰英语/古旧用法，表示“闷闷不乐、发呆（= mope）”，也可作名词指“忧郁情绪/愁相”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to look or act gloomy; to mope (Scottish/archaic).","zh":"（苏格兰英语/较古旧）闷闷不乐；无精打采地发呆（= mope）。"},"examples":[{"en":"He sat in the corner and mouped after the bad news.","zh":"听到坏消息后，他坐在角落里闷闷不乐。"},{"en":"Don’t moup—let’s go for a walk and clear your head.","zh":"别闷着了——我们去散步，清醒一下。"}]},{"partOfSpeech":"n.","definition":{"en":"a gloomy mood or sulky look (Scottish/archaic).","zh":"（苏格兰英语/较古旧）闷闷不乐的情绪；愁眉苦脸的样子。"},"examples":[{"en":"She had a moup on her face all morning.","zh":"她一上午都愁眉苦脸的。"}]}],"synonyms":["mope","sulk","brood","glower"],"phonetic":"/mup/","extraExplanation":["“moup”在现代标准英语里很少见，更常见的对应词是“mope”。如果你是在作业或正式写作中看到/想用，通常建议用“mope”。","在口语或方言语境里，“moup”有时带一点“闷着、蔫儿了、耷拉着脸”的感觉。"]}
{"word":"moure","summary":{"en":"“moure” isn’t a standard English word; it’s usually a misspelling of “more,” “mourn,” or “moire.”","zh":"“moure”不是标准英语单词，通常是“more / mourn / moire”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word; most often a misspelling of another word (commonly: “more,” “mourn,” or “moire”).","zh":"不是现代标准英语单词；多数情况下是拼写错误，常见想表达的是“more（更多）”、“mourn（哀悼）”或“moire（波纹纹理/莫尔纹）”。"},"examples":[{"en":"If you mean “more”: I need more time.","zh":"如果你想写“more”：我需要更多时间。"},{"en":"If you mean “mourn”: They mourned the loss of their friend.","zh":"如果你想写“mourn”：他们为朋友的离世哀悼。"},{"en":"If you mean “moire”: The photo shows a moiré pattern on the screen.","zh":"如果你想写“moire”：照片里屏幕上出现了莫尔纹。"}]}],"extraExplanation":["“moure”在英语里没有稳定、常用的词条含义；如果你是在打字或听写，最可能是以下之一：\n1) more /mɔr/（更多；更）\n2) mourn /mɔrn/（哀悼；为……悲伤）\n3) moiré /mwɑˈreɪ/（织物波纹；或数码影像里的“莫尔纹”）\n如果你能给我一句包含“moure”的原句（或你想表达的中文意思），我可以帮你精准判断是哪一个。"]}
{"word":"mourn","summary":{"en":"Mourn means to feel or show deep sadness, especially for someone who has died or for a significant loss.","zh":"mourn 指因死亡或重大失去而感到并表达深切悲痛，常带有悼念/哀悼的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To feel or express deep sadness because someone has died or because something has ended or been lost.","zh":"（因某人去世或某事结束/失去而）哀悼；悲痛；悼念。"},"examples":[{"en":"The whole community mourned after the accident.","zh":"事故发生后，整个社区都在哀悼。"},{"en":"She mourned her father for years.","zh":"她为父亲哀悼了很多年。"},{"en":"He still mourns the end of their friendship.","zh":"他仍为他们友谊的结束而难过。"}]},{"partOfSpeech":"v.","definition":{"en":"To show sadness publicly, often through traditional actions such as wearing black or holding a memorial.","zh":"（以传统方式公开）表示哀痛（如穿黑衣、举行追思/悼念仪式）。"},"examples":[{"en":"Flags were lowered as the nation mourned.","zh":"全国哀悼期间，国旗降半旗。"},{"en":"In some cultures, people mourn by wearing black clothes.","zh":"在一些文化中，人们会穿黑衣来表示哀悼。"}]}],"synonyms":["grieve","lament","bewail","sorrow (for)"],"phonetic":"/mɔrn/","extraExplanation":["“mourn”常与“grieve”意思接近，但“mourn”更强调对逝者或失去之物的“哀悼/悼念”，也更常用于公共或仪式性的表达（如降半旗、悼念日）；“grieve”更强调内心的强烈悲伤过程。","常见搭配：mourn for sb（为某人哀悼）、mourn sb（悼念某人，较正式）、mourn the loss/end of…（为……的失去/结束而难过）。","文学与新闻中常见表达：a nation mourns（举国哀悼）、mourn the dead（悼念死者）。"]}
{"word":"mourne","summary":{"en":"Mourn means to feel or show deep sadness for a death, or more generally to feel sad about any significant loss.","zh":"Mourn 指因死亡而哀悼，也可泛指对重大失去（如时光、机会）的伤感与惋惜。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel or show deep sadness, especially because someone has died; to grieve","zh":"（尤指因某人去世而）哀悼，悲痛，悼念"},"examples":[{"en":"The whole town mourned the firefighter who died saving others.","zh":"全镇人都在哀悼那位为救人而牺牲的消防员。"},{"en":"She is still mourning her mother’s death.","zh":"她仍在为母亲的去世而悲伤。"}]},{"partOfSpeech":"v.","definition":{"en":"to feel sad about a loss or something that is gone (such as time, youth, or an opportunity)","zh":"为失去的事物惋惜；对逝去（如时光、青春、机会）感到伤感"},"examples":[{"en":"He mourned the years he spent away from his family.","zh":"他为自己远离家人的那些岁月感到惋惜。"},{"en":"Some people mourn the end of summer.","zh":"有些人会为夏天的结束而伤感。"}]}],"synonyms":["grieve","lament","weep for","sorrow","bemoan"],"phonetic":"/mɔrn/","extraExplanation":["“mourn”常见搭配：mourn for (为……哀悼/惋惜)，mourn over (为……伤心、反复思念)；也常用被动或形容化表达：the mourned loss（被哀悼的损失）。","和“grieve”相比，“mourn”更强调外在的悼念行为或公开表达（如葬礼、致哀），而“grieve”更偏内心的悲痛感受；但两者在日常英语里常可互换。","文学/正式语体中很常见：如“mournful”（悲哀的）同源，常用来形容语气、音乐或景象带来的哀伤氛围。"]}
{"word":"mourned","summary":{"en":"“Mourned” means “felt or showed deep sadness,” especially after a death, and more generally about a serious loss.","zh":"“mourned”表示“哀悼／悲痛”，多用于亲友去世，也可指对重大失去或结束而伤感。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel or show deep sadness because someone has died; to grieve","zh":"（因某人去世而）哀悼；悲痛"},"examples":[{"en":"The family mourned quietly after the funeral.","zh":"葬礼后，这家人安静地哀悼。"},{"en":"People across the country mourned the loss of the leader.","zh":"全国人民哀悼这位领袖的逝世。"}]},{"partOfSpeech":"v.","definition":{"en":"to feel sad about something that is lost or has ended (such as a relationship, an opportunity, or the past)","zh":"为失去或结束的事物而惋惜／伤感（如关系、机会或往昔）"},"examples":[{"en":"She mourned the end of their friendship.","zh":"她为他们友谊的结束而难过。"},{"en":"He mourned the chances he never took.","zh":"他为自己从未把握的机会而遗憾。"}]}],"synonyms":["grieved","lamented"],"phonetic":"/mɔrnd/","extraExplanation":["“mourned”是动词“mourn”的过去式/过去分词，常见于一般过去时（They mourned...）或被动/完成时（He has mourned...）。","搭配很常见：mourn someone（哀悼某人）、mourn the loss of...（哀悼/痛惜……的失去）、mourn for...（较正式，表示为……哀悼）。在英文新闻与正式场合里“mourn”比“be sad”更庄重。"]}
{"word":"mourner","summary":{"en":"A mourner is someone grieving a death, especially a person at a funeral.","zh":"mourner 指因他人去世而悲伤的人，尤指参加葬礼的哀悼者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who feels sorrow because someone has died, especially someone who attends the funeral","zh":"哀悼者；（尤指）参加葬礼的人"},"examples":[{"en":"The mourners gathered quietly outside the church before the funeral.","zh":"葬礼开始前，哀悼者安静地聚集在教堂外。"},{"en":"Close family members sat in the front row as the chief mourners.","zh":"直系亲属坐在前排，作为主要的哀悼者。"}]}],"synonyms":["griever","bereaved person","funeral attendee"],"phonetic":"/ˈmɔrnɚ/","extraExplanation":["“mourner”来自动词“mourn”（哀悼、悼念）。在英语里它通常指“正在为逝者哀伤并参加仪式的人”，语气比“sad person”更正式、更偏向葬礼场景。","文化上，“mourner”常与funeral（葬礼）、memorial service（追思会）等搭配；有时也会出现“chief mourner”（主要哀悼者/主丧人）这种更仪式化的说法。"]}
{"word":"mourneress","summary":{"en":"“Mourneress” is an old-fashioned word meaning a female mourner.","zh":"“mourneress”是较旧式的词，意思是“女哀悼者/女送葬者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female mourner; a woman who is grieving or who attends a funeral to show grief","zh":"女哀悼者；（在葬礼上）表示哀悼的女性"},"examples":[{"en":"In the old story, the mourneress dressed in black and followed the coffin quietly.","zh":"在那个旧故事里，女哀悼者身穿黑衣，安静地跟在灵柩后面。"},{"en":"The poem describes a lone mourneress standing by the grave at dusk.","zh":"这首诗描写黄昏时分，一位孤独的女哀悼者站在墓旁。"}]}],"synonyms":["female mourner","mourner","griever"],"phonetic":"/ˈmɔrnərəs/","extraExplanation":["“mourneress”是较少见、带有旧式色彩的词。现代英语更常用“female mourner”或直接用不分性别的“mourner”。","后缀“-ess”传统上用来表示女性身份（如 actress, waitress），但当代英语中越来越倾向于避免不必要的性别标记，因此这类形式在日常写作里会显得古旧或刻意。"]}
{"word":"mourners","summary":{"en":"“Mourners” means people who are grieving, especially those attending a funeral.","zh":"“mourners”指哀悼者、悼念的人，尤其指参加葬礼/追悼会并表达悲伤的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who feel and show sadness because someone has died (often at a funeral).","zh":"因某人去世而感到悲伤并表达哀痛的人（常见于葬礼/追悼会）。"},"examples":[{"en":"Mourners gathered quietly outside the church before the funeral.","zh":"葬礼前，哀悼者安静地聚集在教堂外。"},{"en":"The family thanked the mourners for their support and kindness.","zh":"家属感谢前来悼念的人们给予的支持与善意。"}]},{"partOfSpeech":"n.","definition":{"en":"People who feel deep sadness after a loss (not only death), especially in formal writing.","zh":"因失去而感到深切悲伤的人（不一定是死亡；常见于较正式的表达）。"},"examples":[{"en":"After the factory closed, mourners described the town’s loss of identity.","zh":"工厂关闭后，人们以哀悼般的口吻描述小镇失去身份认同的痛苦。"}]}],"synonyms":["grievers","bereaved people","funeral attendees"],"phonetic":"/ˈmɔrnɚz/","extraExplanation":["“mourners”是复数形式，单数是“mourner”。它来自动词“mourn”（哀悼）。常见搭配有：mourners gathered（哀悼者聚集）、mourners paid their respects（悼念/致哀）、chief/lead mourner（主要哀悼者，通常指最亲近的家属）。在英语文化中，葬礼上穿黑色（wear black）常被视为对逝者与家属的尊重，但不同地区与宗教传统会有所差异。"]}
{"word":"mournful","summary":{"en":"Mournful describes a look, feeling, or sound that shows deep sadness, often connected with loss.","zh":"mournful 用来形容表情、情绪或声音中带有深深的悲伤，常与失去或哀悼有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling or expressing deep sadness, especially because of a loss or death.","zh":"（尤指因失去亲人或死亡而）悲伤的、哀伤的。"},"examples":[{"en":"She gave a mournful smile when she spoke about her father.","zh":"她谈到父亲时，露出一丝哀伤的微笑。"},{"en":"A mournful silence filled the room after the bad news.","zh":"坏消息传来后，房间里充满了悲伤的沉默。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a sad, low, or plaintive sound or look.","zh":"（声音/神情）凄凉的、哀婉的、令人伤感的。"},"examples":[{"en":"The mournful sound of the wind made the house feel lonely.","zh":"风声凄凉，让房子显得格外孤单。"},{"en":"He played a mournful melody on the violin.","zh":"他用小提琴拉出一段哀婉的旋律。"}]}],"synonyms":["sad","sorrowful","melancholy","woeful","plaintive"],"phonetic":"/ˈmɔrn.fəl/","extraExplanation":["词源提示：mournful 来自动词 mourn（哀悼、悲痛）+ -ful（“充满……的”）。因此它的核心感觉是“充满哀伤”。","用法区别：mournful 常带有“外在表现出来的悲伤”（表情、语气、音乐氛围）。如果只是“心里难过”，也常用 sad；更正式、与丧事相关可用 grieving（哀痛中的）。"]}
{"word":"mournfuller","summary":{"en":"“mournfuller” means “more mournful,” but it’s rare; “more mournful” is the standard form.","zh":"“mournfuller”表示“更哀伤”，但很少用；标准表达是“more mournful”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) comparative form of “mournful”: more sad and full of grief.","zh":"（不标准/较少见）“mournful”的比较级：更悲伤、更充满哀痛。"},"examples":[{"en":"After the funeral, his voice grew mournfuller with each story he told.","zh":"葬礼之后，他讲的每个故事都让他的声音变得更悲伤。"},{"en":"The second verse sounds mournfuller than the first.","zh":"第二段听起来比第一段更哀伤。"}]}],"synonyms":["more mournful","sadder","more sorrowful","more grief-stricken","more melancholy"],"phonetic":"/ˈmɔrn.fə.lɚ/","extraExplanation":["“mournfuller”在现代英语里很少用，也容易被当作拼写错误。更自然、最常见的说法是“more mournful”。如果你想表达方式（副词），用“more mournfully”（更悲伤地）。","拼写提示：常用词是“mournful”（一个 l），比较级通常写作“more mournful”，而不是在词尾直接加 -er。"]}
{"word":"mournfullest","summary":{"en":"“Mournfullest” is usually a misspelling of “mournfulest,” meaning “most sad/grieving.”","zh":"“mournfullest”通常是“mournfulest”的误拼，意思是“最悲伤/最哀伤的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most mournful; showing the greatest sadness or grief.","zh":"最悲伤的；最哀伤的；表现出最强烈悲痛的。"},"examples":[{"en":"That was the mournfulest song he had ever heard.","zh":"那是他听过最悲伤的一首歌。"},{"en":"She gave him her mournfulest look and said nothing.","zh":"她用最哀伤的眼神看着他，一句话也没说。"}]}],"synonyms":["saddest","most sorrowful","most grieving","most melancholy"],"phonetic":"ˈmɔrnfəlɪst","extraExplanation":["你写的 **mournfullest** 通常被认为是拼写错误；更常见、规范的写法是 **mournfulest**（mournful 的最高级）。","在现代英语里，最高级更常用 **most mournful**，而 **mournfulest** 带有较强的文学/诗歌色彩。","**mournful** 来自动词 **mourn**（哀悼、悲伤）+ 形容词后缀 **-ful**（“充满……”）。"]}
{"word":"mournfully","summary":{"en":"“Mournfully” means “in a sorrowful, grieving way,” often linked to loss or a low, sad mood.","zh":"“mournfully”表示“悲伤、哀痛地”，常与失去后的哀悼或低沉忧伤的氛围相关。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sad, sorrowful way, especially when showing grief or loss.","zh":"以悲伤、哀痛的方式（尤指表现出失去或悲痛）。"},"examples":[{"en":"She looked at the old photo mournfully.","zh":"她悲伤地看着那张旧照片。"},{"en":"The dog waited mournfully by the door after its owner left.","zh":"主人离开后，那只狗忧伤地守在门口。"},{"en":"He spoke mournfully about his grandfather’s passing.","zh":"他谈起祖父去世时语气哀伤。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that sounds low, slow, and sad (often describing a voice, song, wind, etc.).","zh":"以低沉、缓慢、哀婉的方式（常形容声音、歌声、风声等）。"},"examples":[{"en":"A violin played mournfully in the distance.","zh":"远处有小提琴奏出哀婉的旋律。"},{"en":"The wind blew mournfully through the empty street.","zh":"风在空荡的街道上悲鸣般地吹过。"}]}],"synonyms":["sadly","sorrowfully","wistfully","gloomily","plaintively"],"phonetic":"/ˈmɔɹn.fəli/","extraExplanation":["“mournfully”来自动词“mourn”（哀悼、悼念），常用于描写情绪外显的样子或氛围（如“mournfully gaze/speak/sing”）。","语气上比“sadly”更强调“失去后的悲痛/哀悼感”，在叙事和文学描写里更常见。"]}
{"word":"mournfulness","summary":{"en":"Mournfulness means a sorrowful mood or quality, often connected to grief or loss.","zh":"Mournfulness 指一种带有哀悼意味的悲伤/哀愁氛围，常与失去或怀念有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling or quality of deep sadness, especially linked to grief or loss; a sorrowful mood.","zh":"悲伤、哀愁的情绪或特质，尤指与失去或哀悼相关的深沉伤感。"},"examples":[{"en":"There was a quiet mournfulness in his voice when he spoke about his father.","zh":"他谈到父亲时，声音里带着一种安静的哀伤。"},{"en":"The film’s mournfulness comes from its theme of love and separation.","zh":"这部电影的哀愁感来自“爱情与离别”的主题。"},{"en":"Autumn light can bring a gentle mournfulness to the city streets.","zh":"秋天的光线会给城市街道带来一种淡淡的惆怅。"}]}],"synonyms":["sadness","sorrow","grief","melancholy","mourning"],"phonetic":"ˈmɔrnfəlnəs","extraExplanation":["“mournfulness”来自动词“mourn”（哀悼、悼念）+ 名词后缀“-fulness”（表示“充满……的状态/性质”）。因此它强调“带有哀悼意味的悲伤”，比一般的“sadness”更贴近“失去、悼念、怀念”的情绪。","常见搭配：a sense of mournfulness（哀伤感）、quiet/gentle/deep mournfulness（安静/轻柔/深沉的哀愁）、mournfulness in his/her voice/eyes（声音/眼神里的哀伤）。","在文学与评论里，这个词常用来形容音乐、诗歌、画面或氛围中的“淡淡哀愁”（如忧郁的旋律、灰蓝色调的景象），带有审美化的“忧伤氛围”意味。"]}
{"word":"mournfulnesses","summary":{"en":"Mournfulnesses means multiple instances or kinds of deep sadness (the plural of mournfulness).","zh":"mournfulnesses 指“多种/多次的深切悲伤”，是 mournfulness 的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mournfulness: feelings or expressions of deep sadness, especially after a loss","zh":"mournfulness 的复数：深切的悲伤之情或悲伤的表现（尤指经历失去之后）"},"examples":[{"en":"In the novel, the characters’ mournfulnesses fill the house after the funeral.","zh":"在小说里，葬礼之后，人物们的悲伤情绪充满了整座房子。"},{"en":"Different mournfulnesses can appear: quiet tears, silence, or a heavy voice.","zh":"悲伤会有不同的表现：悄悄流泪、沉默，或声音低沉。"}]}],"synonyms":["sadness","grief","sorrow","melancholy","heartache"],"phonetic":"/ˈmɔrn.fəl.nəs/","extraExplanation":["“mournfulnesses”是名词复数形式，来自形容词“mournful（悲伤的）”+ 名词后缀“-ness（……的状态/性质）”。在现代英语里，这个复数形式不算常见；更常见的表达是用不可数名词“mournfulness”或用“sadness / grief”来概括。","使用复数“mournfulnesses”时，常带有修辞或文学色彩，用来强调“不同种类/多重层次的悲伤”或“来自不同人的悲伤”。"]}
{"word":"mourning","summary":{"en":"Mourning means grief after a death and the ways people show that grief; it can also describe something connected to a funeral or memorial.","zh":"mourning 指因死亡而产生的哀伤与哀悼期，也可形容与葬礼或追思相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sadness and grief after someone dies; the period and activities of showing that grief (for example, funerals, memorials, or wearing dark clothes).","zh":"（亲友去世后的）悲痛、哀伤；以及表达哀悼的时期与行为（如葬礼、追思、穿深色服装等）。"},"examples":[{"en":"The whole town was in mourning after the accident.","zh":"事故之后，整个小镇都在哀悼。"},{"en":"She wore black for a year as a sign of mourning.","zh":"她穿了一年的黑衣以示哀悼。"},{"en":"Flags were lowered to half-staff during the national mourning.","zh":"全国哀悼期间，国旗降半旗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing sadness because someone has died; used before a noun.","zh":"（用于名词前）表示“哀悼的、服丧的”。"},"examples":[{"en":"They held a mourning ceremony for the victims.","zh":"他们为遇难者举行了哀悼仪式。"},{"en":"The family kept a mourning photo on the table.","zh":"家人在桌上摆着一张悼念照片。"}]}],"synonyms":["grief","bereavement","sorrow","lamentation"],"phonetic":"/ˈmɔrnɪŋ/","extraExplanation":["“mourning” 常与 “the loss of a loved one（失去亲人）”“a period of mourning（哀悼期）”“in mourning（在服丧/哀悼中）”搭配使用。","文化上，不同地区表达哀悼的方式不同：有的地方穿黑色，有的地方穿白色；有的会守灵、办追思会、或在特定节日祭奠。英语语境里提到穿黑衣、降半旗等，通常是在描述哀悼的公共或传统做法。","易混淆：mourning（哀悼）≠ morning（早晨）。拼写只差一个字母，但读音不同、意义完全不同。"]}
{"word":"mourningly","summary":{"en":"“Mourningly” means “sadly, in a grieving way,” as if you are mourning someone’s death.","zh":"“mourningly”意为“悲伤地、哀悼地”，带有像在守丧或为逝者哀悼的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows grief or sorrow; sadly, as if mourning.","zh":"以悲伤或哀悼的方式；忧伤地、像在守丧一样。"},"examples":[{"en":"She looked at the old photo mourningly, remembering her father.","zh":"她忧伤地看着那张旧照片，想起了父亲。"},{"en":"The violin sounded mourningly through the quiet room.","zh":"小提琴声在安静的房间里听起来格外哀伤。"}]}],"synonyms":["sadly","sorrowfully","grievingly","wistfully"],"phonetic":"/ˈmɔrnɪŋli/","extraExplanation":["“mourningly”来自“mourning（哀悼）+ -ly（副词后缀）”。在现代英语里，这个副词并不常见，更常用的表达是“sadly”“in mourning”“with grief”。在文学或较正式的描写中，用“mourningly”能营造更强的哀悼气氛。"]}
{"word":"mournings","summary":{"en":"“Mournings” means multiple instances or periods of mourning (sadness and customs after a death).","zh":"“mournings”指多个哀悼（多次/多段哀悼期或哀悼表达）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “mourning”: periods or expressions of sadness after someone dies, often with related customs (e.g., wearing dark clothes)","zh":"“mourning”的复数：指因亲人去世而经历的哀悼期或哀悼的表达方式，常伴随相关习俗（如穿深色衣服）"},"examples":[{"en":"In some cultures, family members observe different lengths of mournings after a death.","zh":"在一些文化中，家人会在亲人去世后遵守不同长短的哀悼期。"},{"en":"The novel describes the city’s mournings after the war.","zh":"这部小说描写了战争后整座城市的哀悼。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) mourning clothes or symbols, especially when discussed in more than one instance","zh":"（较少用）指多套/多次的丧服或哀悼标志（在谈及不止一次时）"},"examples":[{"en":"They packed black mournings for the ceremonies.","zh":"他们为仪式准备了黑色丧服。"}]}],"synonyms":["bereavements","periods of mourning","grief","lamentations"],"phonetic":"/ˈmɔrnɪŋz/","extraExplanation":["容易和 **mornings（早晨）** 混淆：**mourning**（哀悼）来自 *mourn*（哀伤），而 **morning**（早晨）来自“清晨”。拼写只差一个 **u**，发音也很接近。","英语里谈“哀悼期”常用 **in mourning**（在服丧/哀悼中）、**period of mourning**（哀悼期）。不同文化对哀悼时长、穿着颜色（不一定都是黑色）等习俗差异很大。"]}
{"word":"mournival","summary":{"en":"Mournival is an archaic noun meaning a group of four, especially a set of four court cards in older card games.","zh":"mournival 是个古语名词，表示“四个一组”，尤指旧式纸牌游戏中的“四张宫廷牌组合”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A set or group of four people or things; a foursome.","zh":"（古语）四个一组；四人（或四物）一群。"},"examples":[{"en":"In medieval stories, a mournival of knights may ride out together.","zh":"在一些中世纪故事里，四名骑士可能会结伴出行。"},{"en":"The poem describes a mournival of birds circling over the field.","zh":"诗中描写四只鸟在田野上空盘旋。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, card games) A special set of four court cards (such as four kings, queens, or jacks), especially in older European games.","zh":"（历史用语，纸牌）一种由四张宫廷牌组成的牌组（如四个国王/皇后/杰克），尤指旧式欧洲牌戏中。"},"examples":[{"en":"He bragged that his hand contained a mournival of kings.","zh":"他夸口说自己手里有“四王”这一组牌（mournival）。"},{"en":"Some old card-game rules mention scoring a mournival.","zh":"一些旧式牌戏规则会提到“mournival”可以计分。"}]}],"synonyms":["foursome","quartet","set of four"],"phonetic":"/ˈmɔrnɪvæl/","extraExplanation":["“mournival”是非常少见的古词，现代英语里几乎不日常使用，多见于中古/近代早期的文学叙述或旧式牌戏规则说明中。","词义核心是“成四的一组”。在牌戏语境里，它常特指“四张同类宫廷牌”的组合；在一般语境里可理解为“foursome / quartet”。"]}
{"word":"mourns","summary":{"en":"“Mourns” means “feels or shows deep sadness,” often because someone has died, or because something important has been lost.","zh":"“mourns”表示“悲伤、哀悼”，常因他人去世；也可指为重要事物的失去而伤感。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to feel or show deep sadness, especially because someone has died","zh":"（尤指因他人去世而）悲伤、哀悼"},"examples":[{"en":"She mourns quietly after the funeral.","zh":"葬礼后，她安静地哀悼。"},{"en":"The whole town mourns when a firefighter dies in the line of duty.","zh":"当一名消防员因公殉职时，全镇都会哀悼。"}]},{"partOfSpeech":"vt.","definition":{"en":"to express sorrow for someone who has died; to grieve for (someone)","zh":"为（某人）哀悼；悼念（某人）"},"examples":[{"en":"He mourns his mother every day.","zh":"他每天都在思念并哀悼母亲。"},{"en":"Families mourn the victims of the accident.","zh":"家属们悼念事故遇难者。"}]},{"partOfSpeech":"v.","definition":{"en":"to feel sad about the loss of something (such as time, a chance, or a past life)","zh":"为失去的事物（如时间、机会、过去的生活）感到惋惜、伤感"},"examples":[{"en":"She mourns the end of her childhood.","zh":"她为童年的结束而伤感。"},{"en":"He mourns the opportunities he missed.","zh":"他为错过的机会感到惋惜。"}]}],"synonyms":["grieves","laments","sorrows","bemoans"],"phonetic":"/mɔrn/","extraExplanation":["“mourns”是动词“mourn”的第三人称单数形式（he/she/it mourns）。","语气较正式，常见搭配：mourn for sb（为某人哀悼）、mourn sb（悼念某人）、mourn the loss of...（为……的失去而难过）。","与“miss”不同：miss更偏“想念/没赶上”，而mourn强调“悲痛、哀悼”，尤其与死亡或重大失去相关。"]}
{"word":"mournsome","summary":{"en":"“Mournsome” is a rare/old-fashioned adjective meaning “mournful” or “deeply sad.”","zh":"“mournsome”是一个少见/偏古旧的形容词，意思是“哀伤的、哀悼的”，相当于更常用的“mournful”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or rare) Feeling or showing deep sadness; mournful; sorrowful.","zh":"（古旧或少见）感到或表现出深切悲伤的；哀伤的；哀悼的。"},"examples":[{"en":"After the funeral, the house felt mournsome and quiet.","zh":"葬礼之后，房子里显得哀伤而安静。"},{"en":"He spoke in a mournsome voice when he remembered his friend.","zh":"他想起朋友时，用一种哀伤的语气说话。"}]}],"synonyms":["mournful","sorrowful","grieving","sad","melancholy"],"phonetic":"/ˈmɔrn.səm/","extraExplanation":["“mournsome”在现代英语里非常少见，多数情况下人们会用“mournful”“sorrowful”“sad”来表达同样意思。","词形上它由“mourn（哀悼）+ -some（带有……特征的）”构成，类似的构词有“fearsome（可怕的）”“tiresome（烦人的）”。","学习时注意不要与更常见的“lonesome（孤独的）”“troublesome（麻烦的）”混淆；在写作中用“mournful”会更自然、更通用。"]}
{"word":"mous","summary":{"en":"“mous” is usually a misspelling of “mouse”: a small rodent or a computer mouse; as a verb it can mean to hunt/search quietly.","zh":"“mous”通常是“mouse”的误拼：指老鼠或电脑鼠标；作动词可指捕鼠或悄悄搜寻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “mouse”) a small rodent with a pointed nose and long tail.","zh":"（通常拼作“mouse”）老鼠；一种小型啮齿动物，鼻尖、尾巴长。"},"examples":[{"en":"A mouse ran across the kitchen floor.","zh":"一只老鼠跑过了厨房地板。"},{"en":"We set a trap to catch the mouse.","zh":"我们放了一个捕鼠器来抓老鼠。"}]},{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “mouse”) a small handheld device used to control a computer cursor.","zh":"（通常拼作“mouse”）（电脑）鼠标；用于控制光标的小型手持设备。"},"examples":[{"en":"My mouse stopped working, so I replaced the batteries.","zh":"我的鼠标不工作了，所以我换了电池。"},{"en":"Click the icon with your mouse.","zh":"用鼠标点击这个图标。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Of a cat or person) to hunt for or search for mice; by extension, to move quietly and search around.","zh":"（猫或人）捕鼠；引申为悄悄移动并四处搜寻。"},"examples":[{"en":"The cat was mousing in the grass.","zh":"那只猫在草丛里捕鼠。"},{"en":"He moused around the room looking for his keys.","zh":"他在房间里悄悄地四处找钥匙。"}]}],"synonyms":["rodent","computer mouse","hunt","search"],"phonetic":"/maʊs/","extraExplanation":["“mous”本身不是常见的标准英文拼写；你很可能想写的是“mouse”。","注意复数：mouse（老鼠/鼠标）→ mice（复数）。","另外在商务英语里常见缩写 MOU（Memorandum of Understanding，谅解备忘录）；其复数有时写作 MOUs。"]}
{"word":"mouscheron","summary":{"en":"Moucheron (often spelled this way) means a tiny flying insect like a gnat or midge; in literature it can also mean a small, annoying nuisance.","zh":"Moucheron（常见拼写）指像小蚊或蠓那样的微小飞虫；在文学语境中也可比喻微小却恼人的烦扰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small flying insect, especially a gnat or midge (a tiny biting or non-biting fly).","zh":"一种很小的飞虫，尤指小蚊（gnat）或摇蚊/蠓类（midge），常用来泛指“恼人的小飞虫”。"},"examples":[{"en":"At dusk, clouds of moucherons hovered above the river.","zh":"黄昏时，一群群小飞虫在河面上方盘旋。"},{"en":"She kept waving her hand to chase away the moucherons.","zh":"她不停挥手，想把那些小飞虫赶走。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literary) something tiny and irritating, compared to a small gnat.","zh":"（罕见，文学用法）指微不足道却令人心烦的事物，借指“小蚊虫般的烦扰”。"},"examples":[{"en":"Compared with the real danger, their complaints were mere moucherons.","zh":"与真正的危险相比，他们的抱怨不过是些微不足道的小烦恼。"}]}],"synonyms":["gnat","midge","tiny fly","nuisance (figurative)"],"phonetic":"/ˌmuːʃəˈrɑːn/","extraExplanation":["“moucheron”源自法语，常见于英文的文学或较正式语境中，用来描写自然景象（河边、林地、黄昏时的虫群）。你输入的“mouscheron”很可能是拼写变体或误拼；更常见的拼写是 moucheron。","在日常英语里，更常用的对应词是 gnat（小蚊/小飞虫）或 midge（蠓/摇蚊）。"]}
{"word":"mouse","summary":{"en":"“Mouse” most commonly means a small rodent, and it also means a computer pointing device; as a verb, it can mean to move quietly or sneak around.","zh":"“mouse”最常指“老鼠”，也可指电脑的“鼠标”；作动词时可表示“悄悄移动/蹑手蹑脚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small animal (a rodent) with a pointed nose and a long tail.","zh":"老鼠；鼠类（一种小型啮齿动物，尖鼻子、长尾巴）。"},"examples":[{"en":"A mouse ran across the kitchen floor.","zh":"一只老鼠从厨房地板上跑过去。"},{"en":"We set a trap to catch the mouse.","zh":"我们放了一个陷阱来抓老鼠。"}]},{"partOfSpeech":"n.","definition":{"en":"A small handheld device used to control a cursor on a computer screen.","zh":"鼠标（用来在电脑屏幕上控制光标的小型手持设备）。"},"examples":[{"en":"Click the icon with your mouse.","zh":"用鼠标点击那个图标。"},{"en":"My wireless mouse needs new batteries.","zh":"我的无线鼠标需要换电池了。"}]},{"partOfSpeech":"v.","definition":{"en":"To move quietly and carefully, especially to avoid being noticed.","zh":"悄悄移动；蹑手蹑脚地走（尤指为了不被发现）。"},"examples":[{"en":"She moused around the house so she wouldn’t wake the baby.","zh":"她在屋里轻手轻脚地走，免得吵醒宝宝。"},{"en":"He moused along the wall to stay out of sight.","zh":"他贴着墙悄悄走，避免被看见。"}]}],"synonyms":["rodent","computer mouse","sneak","creep"],"phonetic":"/maʊs/","extraExplanation":["“mouse”指动物时，复数通常是“mice”。指电脑设备时，复数一般用“mice”（也有人用“mouses”，但较不常见）。","电脑“mouse/鼠标”的命名来自它外形像小老鼠：早期鼠标带一条线，像“尾巴”。","常见相关表达：quiet as a mouse（像老鼠一样安静）、mouse over（鼠标悬停在……上，常用于软件说明）。"]}
{"word":"mousebane","summary":{"en":"Mousebane is a poisonous plant (often linked with aconite/monkshood) or, more loosely, something used to poison mice.","zh":"Mousebane 指一种有毒植物（常与乌头/舟形乌头相关），也可泛指用来毒杀老鼠的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous plant (often an aconite/monkshood) traditionally associated with killing or repelling mice; also used more generally for a poison used against mice.","zh":"（常指乌头属/附子、舟形乌头等）一种有毒植物，传统上被认为可用来杀鼠或驱鼠；也可泛指“毒鼠药/灭鼠毒药”。"},"examples":[{"en":"In old herbals, mousebane was listed as a plant dangerous to both people and animals.","zh":"在一些古老的本草书里，mousebane 被列为对人和动物都很危险的植物。"},{"en":"The cellar smelled musty, and someone had scattered mousebane to keep rodents away.","zh":"地窖里有霉味，有人撒了 mousebane 想把啮齿动物赶走。"}]}],"synonyms":["wolfsbane","aconite","monkshood","rat poison"],"phonetic":"/ˈmaʊsˌbeɪn/","extraExplanation":["“Mousebane”由 mouse（老鼠）+ bane（祸害、致命之物）组成，字面意思是“老鼠的克星/致命物”。在民间用法中，它可能指某些剧毒植物（尤其与 aconite/monkshood“乌头/舟形乌头”相关的植物），也可能被当作“毒鼠药”的泛称。","这类植物通常毒性很强，现实生活中不要尝试采摘、泡制或用于驱虫/灭鼠；在英语文本里它更多见于民俗、草药传说或带哥特气氛的文学描写，用来营造“危险、阴暗、带毒”的意象。"]}
{"word":"mousebird","summary":{"en":"A mousebird is a small African bird with soft, mouse-like feathers and a long tail.","zh":"mousebird 指非洲的鼠鸟：羽毛柔软像鼠毛、尾巴较长的小型鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small African bird (in the family Coliidae) with soft, mouse‑like fur-textured feathers and a long tail; also called a coly","zh":"鼠鸟（非洲一种小型鸟类，鼠鸟科；羽毛柔软、像鼠毛般蓬松，尾巴较长；也叫 coly）"},"examples":[{"en":"We spotted a mousebird hopping through the acacia trees.","zh":"我们看到一只鼠鸟在金合欢树间跳来跳去。"},{"en":"A mousebird’s soft gray-brown feathers help it blend into dry woodland.","zh":"鼠鸟柔软的灰褐色羽毛有助于它在干燥林地中隐蔽。"}]}],"synonyms":["coly"],"phonetic":"/ˈmaʊsˌbɝd/","extraExplanation":["“mousebird”这个名字来自它“像老鼠一样”的外观与动作：羽毛质感蓬松、在枝条间迅速穿梭、常贴着树枝停栖，看起来有点像小哺乳动物在移动。","鼠鸟主要分布在撒哈拉以南非洲，常见于灌木丛、稀树草原与林地；多以果实、嫩叶和花为食，常成小群活动。"]}
{"word":"moused","summary":{"en":"“Moused” usually means you used a computer mouse; in technical contexts it can also mean you secured a hook or fitting so it can’t slip loose.","zh":"“moused”通常指“用鼠标操作”；在专业语境中也可指“把钩具等做防松脱固定”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “mouse”) to move a computer mouse; to point, click, or drag on a screen using a mouse.","zh":"（mouse 的过去式/过去分词）用鼠标操作；用鼠标在屏幕上指向、点击或拖拽。"},"examples":[{"en":"She moused over the icon to see its name.","zh":"她把鼠标移到图标上，以查看它的名称。"},{"en":"I moused through the menu and clicked “Settings.”","zh":"我用鼠标浏览菜单，然后点击了“设置”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of “mouse”) to fasten or secure something—especially a hook, shackle, or knot—so it cannot slip loose (often with wire or a small line).","zh":"（mouse 的过去式/过去分词）（尤指用铁丝或细绳）把钩子、卸扣或结固定住，防止松脱（航海/攀登等语境）。"},"examples":[{"en":"The sailor moused the hook with wire for safety.","zh":"水手用铁丝把钩子固定住以确保安全。"},{"en":"Make sure the carabiner is closed and moused before you climb.","zh":"攀爬前要确认主锁已关好，并做好防松脱固定。"}]}],"synonyms":["clicked","dragged","pointed","secured","fastened"],"phonetic":"/maʊzd/","extraExplanation":["在电脑语境里，“mouse”是“用鼠标操作”的动词，所以“moused”常见于说明书、教程或技术写作中（如“mouse over”表示“把鼠标移到……上方”）。","在航海/工程/攀登等语境里，“to mouse”指用细铁丝或细绳做“防脱保险”（类似“安全绑扎/防松脱处理”）。这个用法较专业，日常对话里不常见。"]}
{"word":"mousee","summary":{"en":"“Mouse” can mean the small animal or the computer device; as a verb it means to move/search quietly.","zh":"“mouse” 可指小老鼠或电脑鼠标；作动词可指悄悄移动或偷偷翻找。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small animal (a rodent) with a pointed nose and a long tail","zh":"老鼠；鼠（体型较小的啮齿动物，尖鼻子、长尾巴）"},"examples":[{"en":"A mouse ran across the kitchen floor.","zh":"一只老鼠跑过厨房地板。"},{"en":"We set a trap to catch the mouse.","zh":"我们放了个陷阱来抓老鼠。"}]},{"partOfSpeech":"n.","definition":{"en":"a small hand-held device used to control a computer cursor","zh":"（电脑）鼠标（用来控制光标的手持设备）"},"examples":[{"en":"My mouse stopped working, so I changed the battery.","zh":"我的鼠标不工作了，所以我换了电池。"},{"en":"Click the icon with the mouse.","zh":"用鼠标点击这个图标。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move quietly and carefully; to search around in a hidden way (often with “around”)","zh":"悄悄移动；偷偷摸摸地翻找（常与 around 连用）"},"examples":[{"en":"He moused around the office looking for his keys.","zh":"他在办公室里悄悄翻找自己的钥匙。"},{"en":"The cat moused through the tall grass.","zh":"那只猫在高草丛中悄悄穿行。"}]}],"synonyms":["rodent","computer mouse","pointer device","sneak","prowl"],"phonetic":"/maʊs/","extraExplanation":["“mousee” 不是标准英语单词，最常见的情况是把 “mouse” 拼错了。如果你想表达的是别的专有名词（比如用户名、品牌名等），可以告诉我具体语境，我可以帮你确认意思。"]}
{"word":"mousees","summary":{"en":"“Mousees” is usually a misspelling. The correct plural of “mouse” (animal) is “mice”; for the computer device, “mice” is common and “mouses” is sometimes used in technical contexts.","zh":"“mousees”通常是拼写错误。表示动物时“mouse”的正确复数是“mice”；表示电脑设备时“mice”更常见，“mouses”在部分技术语境中也会用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small animal with a pointed nose and a long tail.","zh":"老鼠；鼠（一种小型啮齿动物，尖鼻、长尾）"},"examples":[{"en":"A mouse ran across the kitchen floor.","zh":"一只老鼠跑过了厨房地面。"},{"en":"We set a trap to catch the mouse.","zh":"我们放了一个陷阱来抓老鼠。"}]},{"partOfSpeech":"n.","definition":{"en":"A small handheld device used to control a computer cursor.","zh":"鼠标（用于控制电脑光标的手持设备）"},"examples":[{"en":"My mouse stopped working, so I changed the batteries.","zh":"我的鼠标坏了，所以我换了电池。"},{"en":"Click the icon with your mouse.","zh":"用鼠标点击这个图标。"}]},{"partOfSpeech":"v.","definition":{"en":"To move the computer cursor using a mouse, especially to look for something on a screen.","zh":"用鼠标移动光标；（在屏幕上）用鼠标查找/浏览"},"examples":[{"en":"She moused over the menu to see more options.","zh":"她把鼠标移到菜单上来查看更多选项。"},{"en":"He was mousing around on the website for an hour.","zh":"他在那个网站上用鼠标到处浏览了一小时。"}]}],"synonyms":["rodent","computer mouse","cursor device"],"phonetic":"/maʊs/","extraExplanation":["“mousees”通常不是正确拼写。名词“mouse”的复数一般是“不规则复数”mice（多只老鼠）。","在计算机语境里，“mouse”的复数既可以用 mice（更常见），也可以用 mouses（在技术写作中有时用来避免和动物的 mice 混淆）。但“mousees”不常用、也不标准。","动词“mouse”的第三人称单数是 mouses（例如：He mouses over the button.）。"]}
{"word":"mousefish","summary":{"en":"A mousefish is a deep-sea chimaera/ratfish with a long tail and a mouse-like face.","zh":"mousefish 指一种深海的银鲛/鼠鲛类鱼，外形常带细长尾巴、脸部像老鼠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep-sea, cartilaginous fish (a type of chimaera/ratfish) with a long, tapering tail and a mouse-like face.","zh":"鼠鱼；（一种）深海软骨鱼（银鲛/鼠鲛的一种），常有细长逐渐变尖的尾巴，头部外形有点像老鼠。"},"examples":[{"en":"The museum display described the mousefish as a relative of sharks and rays.","zh":"博物馆展品说明里写到，鼠鱼和鲨鱼、鳐鱼是近亲。"},{"en":"A researcher recorded a mousefish living near the sea floor.","zh":"研究人员记录到一条生活在海底附近的鼠鱼。"}]}],"synonyms":["ratfish","chimaera"],"phonetic":"/ˈmaʊsˌfɪʃ/","extraExplanation":["“mousefish”在日常英语里不算常见，更多出现在海洋生物、科普或渔业语境中。很多地区也把类似的鱼叫“ratfish（鼠鲛）”或“chimaera（银鲛/银鲛鱼）”，具体指哪一种会因地区和分类习惯而不同。"]}
{"word":"mousefishes","summary":{"en":"Mousefishes = plural of mousefish, a small schooling marine fish (often Stromateidae).","zh":"mousefishes 是 mousefish 的复数，指常成群活动的小型海鱼（常见为鼠鲳科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mousefish: a small, silvery marine fish (usually in the family Stromateidae) found in warm and temperate seas, often schooling and sometimes caught for food.","zh":"mousefish 的复数：一种小型、银色的海鱼（通常指鲹形目中鼠鲳科 Stromateidae 的鱼类），生活在温暖或温带海域，常成群活动，有时可供食用。"},"examples":[{"en":"Mousefishes often swim in schools near the coast.","zh":"鼠鲳类（mousefishes）常在近海成群游动。"},{"en":"The market sold dried mousefishes alongside other small fish.","zh":"市场里卖干制的鼠鲳类（mousefishes），和其他小鱼摆在一起。"}]}],"synonyms":["mousefish","stromateids"],"phonetic":"/ˈmaʊsˌfɪʃɪz/","extraExplanation":["“Mousefish”在不同语境中可能指不同类群，但在常见英语用法里多指鼠鲳科（Stromateidae）的海鱼；不要和“mousefish”（啮齿类动物/鼠）或“mousefish”作为其他动物俗名混淆。若你是在特定地区的渔业/菜谱/科普文章里看到该词，所指物种可能会更具体（例如某个属或某个地方俗名）。"]}
{"word":"mousehawk","summary":{"en":"Mousehawk is an old-fashioned word for a small hawk—often a kestrel—that hunts mice.","zh":"Mousehawk 是较旧的说法，指捕食老鼠等小动物的小型鹰，常用来指红隼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) A small hawk, especially a kestrel, known for hunting mice and other small animals.","zh":"（较旧用法）一种小型鹰，尤指红隼，以捕食老鼠等小动物而闻名。"},"examples":[{"en":"In old countryside writing, a mousehawk often means a kestrel hovering over a field.","zh":"在一些旧的乡村文学作品里，mousehawk 常指在田野上空盘旋的红隼。"},{"en":"We saw a mousehawk drop from the sky and grab something in the grass.","zh":"我们看到一只“mousehawk”从空中俯冲下去，在草丛里抓住了什么。"}]}],"synonyms":["kestrel","small hawk","mouse hawk","mouse-hawk"],"phonetic":"/ˈmaʊsˌhɔk/","extraExplanation":["mousehawk 多写作 mouse hawk 或 mouse-hawk，属于较少见、带文学/方言色彩的称呼。它强调“会抓老鼠的鹰”，并不一定是严格的生物学物种名称；在英美一些旧文献中常用来指红隼（kestrel），因为红隼常在田野上空“定点悬停”找猎物。"]}
{"word":"mousehole","summary":{"en":"A mousehole is a small hole that mice use to get in and out.","zh":"mousehole 指老鼠进出用的小洞（鼠洞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small hole in a wall or floor that a mouse can use to enter or leave.","zh":"（墙上或地板上的）鼠洞；老鼠进出的小洞。"},"examples":[{"en":"We saw a mouse disappear into a mousehole behind the stove.","zh":"我们看到一只老鼠钻进了炉子后面的鼠洞。"},{"en":"Seal every mousehole to keep rodents out of the house.","zh":"把所有鼠洞都封住，才能防止啮齿动物进屋。"}]}],"synonyms":["hole","small opening","burrow (for animals)"],"phonetic":"/ˈmaʊsˌhoʊl/","extraExplanation":["mousehole 常用来形容“非常狭小的入口或空间”，有时带一点口语化的夸张，比如说房间像“鼠洞”一样小。不过这种用法不如字面意思常见，通常需要上下文来判断是否是比喻。"]}
{"word":"mousehound","summary":{"en":"A mousehound is a dog that catches mice (and sometimes a humorous term for someone who hunts tiny, hard-to-find things).","zh":"mousehound 指“抓老鼠的狗”（也可幽默地指爱追寻细小、难找之物的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dog trained (or good by instinct) at catching mice and other small rodents; a mouser dog.","zh":"擅长（或受训练）捕捉老鼠等小型啮齿动物的狗；“抓鼠犬”。"},"examples":[{"en":"The farmer kept a little terrier as a mousehound in the barn.","zh":"农夫在谷仓里养了一只小梗犬当作抓鼠犬。"},{"en":"Before modern pest control, a good mousehound could protect stored grain.","zh":"在现代灭鼠手段普及之前，一只优秀的抓鼠犬能保护储存的谷物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Humorous, rare) Any animal or person that persistently hunts for mice, or for something small and hard to find.","zh":"（幽默，少见）任何执着“找/抓老鼠”的动物或人；也可比喻执着寻找微小、难找之物的人。"},"examples":[{"en":"He’s a real mousehound when it comes to spotting tiny errors in a report.","zh":"在报告里找小错误这方面，他简直像个“追鼠猎手”。"}]}],"synonyms":["mouser","ratting dog","terrier (often)"],"phonetic":"/ˈmaʊsˌhaʊnd/","extraExplanation":["这个词很少见，多为字面合成词（mouse + hound）。在现实中更常用的说法是 mouser（抓鼠的猫/狗）或 ratting dog（抓鼠/抓鼠类的狗，常指梗犬）。在文学或口语中偶尔用作带点幽默的称呼。"]}
{"word":"mouseion","summary":{"en":"Mouseion is a historical Greek term for a place devoted to the Muses—learning and the arts—and it’s the origin of the word “museum.”","zh":"Mouseion 是古希腊的历史用词，指献给缪斯女神、用于学术与艺术的场所，也是“museum（博物馆）”的词源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) In ancient Greece, a “Mouseion” was a place dedicated to the Muses—used for learning, study, and the arts; it is the source of the modern word “museum.”","zh":"（历史用语）古希腊的“Mouseion”指献给缪斯女神的场所，用于学术研究、学习与艺术活动；也是现代英语“museum（博物馆）”一词的词源。"},"examples":[{"en":"The Library of Alexandria was connected with a famous Mouseion devoted to scholarship.","zh":"亚历山大图书馆与一座以学术研究为核心、著名的 Mouseion 相连。"},{"en":"In classical texts, a Mouseion could mean a cultural center rather than a building full of exhibits.","zh":"在古典文献中，Mouseion 常指文化与学术中心，而不一定是陈列展品的建筑。"}]}],"synonyms":["museum (modern equivalent)","cultural center","institute (in context)"],"phonetic":"/muːˈziːɑːn/","extraExplanation":["你输入的“mouseion”在现代英语里不常见，更多出现在历史或古典学语境中。它来自希腊语 Μουσεῖον（Mouseion），字面意思是“缪斯（Muses）的殿堂/住所”。后来这个词演变为拉丁语与法语形式，最终形成现代英语 museum（博物馆）。","容易混淆：mouse（老鼠）和 Mouseion 没有直接关系；只是拼写看起来相似。"]}
{"word":"mousekin","summary":{"en":"Mousekin is an uncommon/old-fashioned word meaning a mouse’s skin or fur, or something made from it.","zh":"Mousekin 是较少见/偏古旧的词，指鼠皮或鼠毛皮，也可指用其制成的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The skin or fur of a mouse; something (such as trim or lining) made from it.","zh":"鼠皮；鼠毛皮（也可指用鼠皮做的镶边、内衬等）。"},"examples":[{"en":"In old texts, you may see “mousekin” used to describe tiny scraps of fur.","zh":"在一些古旧文本中，你可能会看到 mousekin 用来形容小小的毛皮碎片。"},{"en":"The costume had a mousekin-like trim, soft and gray.","zh":"那套服装有一种像鼠毛皮一样的灰色柔软镶边。"}]}],"synonyms":["mouse fur","mouse skin","mice fur"],"phonetic":"/ˈmaʊsˌkɪn/","extraExplanation":["这是一个较少见、偏古旧或文学化的词。mouse + -kin，其中 -kin 在英语里有时带有“小、亲近”或“同类/族类”的感觉（如 napkin 的词源里也出现过 -kin 形式），但在 mousekin 里更直观地理解为“鼠的皮毛”即可。","在现代英语中，人们更常说 mouse fur（鼠毛）或 mouse skin（鼠皮）；mousekin 多见于旧书、方言记录、或特定写作风格中。"]}
{"word":"mouselet","summary":{"en":"“Mouselet” is a rare, cute way to say “a very small mouse.”","zh":"“mouselet”是较少见、偏可爱语气的说法，意思是“很小的老鼠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small mouse; a little mouse (a rare/creative word).","zh":"小老鼠；幼鼠（较少见/带创造性的用法）。"},"examples":[{"en":"A mouselet darted under the cupboard and disappeared.","zh":"一只小老鼠嗖地钻到橱柜底下不见了。"},{"en":"In the story, the brave mouselet helps the lion.","zh":"在故事里，那只勇敢的小老鼠帮助了狮子。"}]}],"synonyms":["little mouse","small mouse","baby mouse","young mouse"],"phonetic":"/ˈmaʊslət/","extraExplanation":["“mouselet”并不是常用标准词，更常见的说法是“a little mouse / a small mouse / a baby mouse”。但它很好理解：后缀“-let”常表示“更小的、较小的”（如“booklet”小册子、“leaflet”传单）。","在童话、儿童文学或拟人化写作里，人们有时会用这种带“-let”的形式来显得更可爱、更亲切。"]}
{"word":"mouselike","summary":{"en":"“Mouselike” means resembling a mouse—small, quiet, quick, and often shy.","zh":"“mouselike”指“像老鼠的”——小、安静、敏捷，常带有胆怯/不显眼的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a mouse in appearance or movement (small, quiet, quick, and shy).","zh":"像老鼠的；（外形或动作）小、安静、敏捷又胆怯的。"},"examples":[{"en":"A mouselike creature darted under the cupboard.","zh":"一只像老鼠的小动物迅速钻到橱柜下面。"},{"en":"She spoke in a mouselike voice, almost too soft to hear.","zh":"她用像老鼠般细小的声音说话，几乎听不见。"},{"en":"He gave a mouselike smile and avoided eye contact.","zh":"他露出怯生生的微笑，并避开目光接触。"}]}],"synonyms":["mousey","timid","shy","quiet","slinking"],"phonetic":"/ˈmaʊsˌlaɪk/","extraExplanation":["“mouselike”常用来形容人的举止或声音“胆小、怯懦、很不显眼”（类似中文的“怯生生、畏缩”），语气有时会带一点贬义或同情的意味，取决于语境。"]}
{"word":"mouseling","summary":{"en":"Mouseling means a young/little mouse, and more rarely a timid person.","zh":"mouseling 指“小老鼠/幼鼠”，较少也可比喻“胆小的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young mouse; a little mouse (often used in a cute or poetic way)","zh":"小老鼠；幼鼠（常带可爱或诗意的语气）"},"examples":[{"en":"A mouseling peeked out from under the cupboard.","zh":"一只小老鼠从橱柜底下探出头来。"},{"en":"We found a mouseling in the shed and gently moved it outside.","zh":"我们在棚子里发现一只幼鼠，就轻轻把它移到外面。"}]},{"partOfSpeech":"n.","definition":{"en":"a timid or small, quiet person (figurative; uncommon)","zh":"胆小、弱小或很安静的人（比喻用法；不常见）"},"examples":[{"en":"He described himself as a mouseling at school, always trying not to be noticed.","zh":"他形容自己在学校像只“小老鼠”，总是尽量不引人注意。"}]}],"synonyms":["baby mouse","young mouse","mouse pup (context-specific)","timid person (figurative)"],"phonetic":"/ˈmaʊzlɪŋ/","extraExplanation":["“mouseling”由“mouse + -ling”构成，后缀“-ling”常表示“小的、年幼的或带亲昵色彩的事物（如 duckling 小鸭）。“mouseling”在现代日常英语里比较少见，更常见的说法是“baby mouse”“young mouse”或“mouse pup”（更偏科普/饲养语境）。"]}
{"word":"mousemill","summary":{"en":"Mousemill usually means a mouse exercise wheel/treadmill; it can also metaphorically mean repetitive work with no progress.","zh":"mousemill 通常指老鼠用的跑轮/小跑步机；也可比喻“重复忙碌却没有进展”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small treadmill-like device (often a wheel) that a mouse runs in, used in experiments or as a pet exercise toy.","zh":"（常指滚轮式的）小型“跑步机/跑轮”，供老鼠跑动，用于实验或宠物运动。"},"examples":[{"en":"The lab recorded how far each mouse ran on the mousemill each night.","zh":"实验室记录每只老鼠每晚在鼠跑轮（mousemill）上跑了多远。"},{"en":"We bought a quiet mousemill so the pet mouse could exercise.","zh":"我们买了一个静音的鼠跑轮，让宠物老鼠运动。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, less common) A situation where someone keeps working hard but gets nowhere—repetitive effort without real progress.","zh":"（比喻，用得较少）原地打转的处境：忙忙碌碌却没有实质进展的重复劳动。"},"examples":[{"en":"After months of the same tasks, he felt stuck in a mousemill.","zh":"做了几个月同样的事情后，他觉得自己像困在“鼠跑轮”里原地打转。"},{"en":"Without a clear goal, studying can become a mousemill.","zh":"没有明确目标时，学习也可能变成“鼠跑轮式”的无效重复。"}]}],"synonyms":["mouse wheel","running wheel","treadmill (figurative)"],"phonetic":"/ˈmaʊsˌmɪl/","extraExplanation":["这个词并不是现代英语里的高频标准词，更常见的说法是：mouse wheel（鼠跑轮）、running wheel（跑轮）或（用于人）treadmill（跑步机）。","结构上是 mouse + mill（磨坊/磨机）。把“跑轮里不停跑”的形象和“磨坊不停转”的感觉结合起来，因此也容易发展出“忙却无进展”的比喻义。"]}
{"word":"mousepox","summary":{"en":"Mousepox is a pox-like viral disease in mice, caused by ectromelia virus, mostly mentioned in lab/research contexts.","zh":"mousepox 指由外胚层病毒引起的小鼠痘样病毒病，主要用于实验室与科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a viral disease of mice caused by ectromelia virus (an orthopoxvirus), producing pox-like symptoms; mainly discussed in laboratory and research contexts.","zh":"小鼠痘：由外胚层病毒（ectromelia virus，属于正痘病毒属 orthopoxvirus）引起的小鼠病毒性疾病，会出现类似“痘疹/脓疱”的症状；多见于实验室与科研语境。"},"examples":[{"en":"The lab quarantined the animal room after a suspected mousepox outbreak.","zh":"实验室在疑似出现小鼠痘暴发后，对动物房进行了隔离。"},{"en":"Researchers vaccinated mice to reduce the risk of mousepox in the colony.","zh":"研究人员给小鼠接种疫苗，以降低种群中发生小鼠痘的风险。"},{"en":"Mousepox is used as a model to study immune responses to orthopoxviruses.","zh":"小鼠痘常被用作研究机体对正痘病毒免疫反应的模型。"}]}],"synonyms":["ectromelia (virus)","ectromelia infection","mouse pox"],"phonetic":"/ˈmaʊsˌpɑks/","extraExplanation":["“mousepox”主要不是日常用词，更常见于生物医学、动物实验与传染病研究领域。它与人类的天花（smallpox）同属正痘病毒相关研究背景，但并不等同，也不指人类常见疾病。","在科研写作中也可见到写法“mouse pox”，以及更技术性的名称“ectromelia (virus)”或“ectromelia infection”。","该词在科普或新闻中出现时，往往牵涉生物安全与科研伦理讨论；理解时可关注语境是否在描述实验动物管理、疫苗/免疫研究或病原体控制。"]}
{"word":"mouseproof","summary":{"en":"Mouseproof means resistant to mice, or to make something resistant to mice.","zh":"mouseproof 指“防鼠的”，也可作动词表示“给……做防鼠处理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a container, room, or building) designed so that mice cannot enter or damage it; resistant to mice.","zh":"（指容器、房间或建筑）防鼠的；不让老鼠进入或破坏的。"},"examples":[{"en":"Store rice in a mouseproof container with a tight lid.","zh":"把米放在带紧密盖子的防鼠容器里保存。"},{"en":"We sealed the gaps under the door to make the pantry more mouseproof.","zh":"我们封住门下的缝隙，让储藏间更防鼠。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something resistant to mice by sealing holes, covering openings, or using protective materials.","zh":"给……做防鼠处理；通过封洞、遮挡开口或加装材料来防止老鼠进入。"},"examples":[{"en":"They mouseproofed the shed by covering vents with metal mesh.","zh":"他们用金属网罩住通风口，给棚屋做了防鼠处理。"},{"en":"Before winter, we mouseproof the cabin to prevent mice from nesting.","zh":"入冬前，我们会给小木屋做防鼠处理，防止老鼠筑巢。"}]}],"synonyms":["rodent-proof","vermin-proof","mouse-resistant"],"phonetic":"/ˈmaʊsˌpruːf/","extraExplanation":["在书面语中常见拼写有 mouseproof、mouse-proof（更强调“防鼠的”这一性质），以及动词形式 mouse-proof / mouseproof（强调“去做防鼠处理”）。家居语境里常与 seal gaps（封缝）、metal mesh（金属网）、tight-fitting lid（严密的盖子）等搭配。"]}
{"word":"mouser","summary":{"en":"A mouser is someone or a cat that catches mice, often referring to a cat that’s good at it.","zh":"mouser 指捕鼠者，常用来形容很会抓老鼠的猫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (or a cat) that catches mice; someone who hunts mice.","zh":"捕鼠者；抓老鼠的（人或猫）。"},"examples":[{"en":"Our barn cat is a great mouser—she keeps the mice away.","zh":"我们的谷仓猫很会抓老鼠——她把老鼠都赶走了。"},{"en":"The old farmhouse needed a mouser after mice got into the grain.","zh":"老农舍的粮食进了老鼠后，需要一只会捕鼠的猫（或捕鼠者）。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of cat known for being good at catching mice.","zh":"（常指）擅长捕鼠的猫。"},"examples":[{"en":"They adopted a mouser from the shelter to help control rodents.","zh":"他们从收容所领养了一只会捕鼠的猫来控制啮齿动物。"}]}],"synonyms":["mouse-catcher","ratter (often for rats)"],"phonetic":"/ˈmaʊsɚ/","extraExplanation":["“mouser”来自“mouse（老鼠）+ -er（做……的人/物）”。在美国英语里更常用于日常语境，尤其是农场、谷仓等场景，常说“a good mouser”。","注意不要和“computer mouse（鼠标）”联想在一起；“mouser”几乎总与捕捉真正的老鼠有关。"]}
{"word":"mouseries","summary":{"en":"“Mouseries” is the plural of “mousery,” meaning places with many mice (and, more rarely, mouse-catching activity).","zh":"“mouseries”是“mousery”的复数，常指鼠患严重的地方；较少见时也可指捕鼠活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of mousery: places (or situations) where there are many mice, or where mice are a problem","zh":"mousery 的复数：指“老鼠很多/鼠患严重的地方（或情况）”"},"examples":[{"en":"Old barns can become mouseries in winter.","zh":"老谷仓到了冬天可能会变成“鼠窝”（鼠患严重的地方）。"},{"en":"They cleaned the storage rooms to stop them turning into mouseries.","zh":"他们清理了储藏室，防止那里变成鼠患严重的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"mouse-catching activity or behavior (rare)","zh":"捕鼠活动/捕鼠行为（较少见的用法）"},"examples":[{"en":"The cat’s nightly mousery kept the kitchen quiet.","zh":"这只猫夜里捕鼠，让厨房安静了不少。"}]}],"synonyms":["mouse-infested places","mouse infestation","rat-and-mouse problem"],"phonetic":"/ˈmaʊsəriz/","extraExplanation":["“mouseries”并不常见；更常见的表达是用更直白的词，如 “mouse infestation”（鼠患）、“a place full of mice”（满是老鼠的地方）。","词形上，“mousery”来自 “mouse” 加后缀 “-ery”，类似 “bakery”（面包店）那种“场所/相关活动”的构词方式；复数就是 “mouseries”。","相关词：mouser（捕鼠者，常指会抓老鼠的猫）；mousy（像老鼠的；胆小、不起眼的）。"]}
{"word":"mousers","summary":{"en":"“Mousers” means cats/animals (or sometimes people/devices) that catch mice.","zh":"“mousers”指抓老鼠的能手（多指猫等动物，也可指捕鼠的人或装置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cat (or other animal) that catches and kills mice; a good mouse-catcher","zh":"（猫等）抓老鼠的能手；善于捕鼠的动物"},"examples":[{"en":"They keep a few mousers in the barn to protect the grain.","zh":"他们在谷仓里养了几只捕鼠能手的猫来保护粮食。"},{"en":"That old cat is still one of the best mousers on the farm.","zh":"那只老猫在农场里仍然是最会抓老鼠的之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or device whose job is to catch mice (or control mice)","zh":"捕鼠的人；用于灭鼠/捕鼠的装置"},"examples":[{"en":"The museum hired a professional mouser to deal with the mouse problem without poison.","zh":"博物馆雇了专业捕鼠人员来处理鼠患，而不是用毒药。"},{"en":"In older buildings, a good mouser can be part of the pest-control plan.","zh":"在老建筑里，一只会抓老鼠的猫可能也是防治鼠害方案的一部分。"}]}],"synonyms":["mouse-catcher","cat (informal in context)","pest controller"],"phonetic":"/ˈmaʊsər/","extraExplanation":["“mouser”常见于农场、谷仓、仓库等语境，强调“擅长抓老鼠”的能力；复数形式为“mousers”。有些图书馆或博物馆会象征性地“聘请”猫当mouser，既是实际需要，也带点文化传统意味。"]}
{"word":"mousery","summary":{"en":"Mousery most commonly means a place where mice are kept or bred; it can also mean mouse-like, timid or furtive behavior in a figurative sense.","zh":"mousery 最常指“养鼠室/鼠房”；也可比喻“鼠性/鼠态”，即胆怯、鬼祟或小气的行为气质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place where mice are kept or bred, especially for research or feeding other animals.","zh":"养鼠室；鼠房（饲养或繁殖老鼠的地方，尤指用于研究或喂养其他动物）。"},"examples":[{"en":"The university’s mousery supplies lab mice for medical studies.","zh":"这所大学的养鼠室为医学研究提供实验鼠。"},{"en":"Before the snakes arrived, the zookeepers checked the mousery to make sure the mice were healthy.","zh":"在蛇到来之前，动物园饲养员检查了鼠房，确保老鼠健康。"}]},{"partOfSpeech":"n.","definition":{"en":"Mouse-like behavior or qualities (timid, furtive, small-scale), often used in a critical or literary way.","zh":"鼠性；鼠态（形容人胆怯、鬼祟或做事小气、规模很小的特质，常带贬义或文学色彩）。"},"examples":[{"en":"He was tired of the office mousery—whispered complaints and cautious half-steps.","zh":"他厌倦了办公室里的“鼠态”——小声抱怨、处处小心的半步行动。"},{"en":"The novel mocks the town’s mousery, where everyone avoids taking a clear stand.","zh":"这部小说嘲讽小镇的“鼠性”：人人都回避表态。"}]}],"synonyms":["mouse house","mouse room","timidity","furtiveness"],"phonetic":"/ˈmaʊsəri/","extraExplanation":["“mousery”不是高频词。第一义更常见于实验动物设施（animal facility）或动物园饲养场景；第二义属于比喻用法，带有文学或讽刺色彩，强调“畏缩、躲闪、偷偷摸摸”的氛围。"]}
{"word":"mouses","summary":{"en":"“Mouses” is usually used for multiple computer mice; for the animal, the normal plural is “mice.” It can also be the verb form meaning “uses a mouse.”","zh":"“mouses”通常用于指多个电脑鼠标；指动物“mouse”时，标准复数是“mice”。它也可以是动词形式，表示“用鼠标操作”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form sometimes used for more than one computer mouse (pointing device); many people also use “mice.”","zh":"（有时使用的复数形式）指多个电脑鼠标；很多人也会用“mice”。"},"examples":[{"en":"The lab ordered ten new mouses for the computers.","zh":"实验室为电脑订购了十个新鼠标。"},{"en":"We keep spare mouses in the drawer in case one breaks.","zh":"我们在抽屉里备着备用鼠标，以防有一个坏掉。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of the verb “mouse”: to use a computer mouse to move the pointer, click, or select items on a screen.","zh":"动词“mouse”的第三人称单数：用鼠标移动指针、点击或在屏幕上选择内容。"},"examples":[{"en":"She mouses over the icon to see its name.","zh":"她把鼠标移到图标上以查看名称。"},{"en":"He mouses quickly through the menu and finds the setting.","zh":"他快速用鼠标浏览菜单，找到了设置选项。"}]}],"synonyms":["computer mice","mice"],"phonetic":"/ˈmaʊsɪz/","extraExplanation":["“mouse（动物）”的标准复数是不规则形式“mice”。但在计算机语境中，一些人会把“mouse（鼠标设备）”规则化为“mouses”，尤其在技术文档或口语里；不过“computer mice”也非常常见，通常更自然。","如果你本来想表达“很多小老鼠”，更推荐用“mice”。例如：There are mice in the kitchen.（厨房里有老鼠。）"]}
{"word":"mouseship","summary":{"en":"“Mouseship” is a humorous, nonstandard word meaning friendship/companionship, or a playful bond involving a mouse (pet or computer mouse).","zh":"“mouseship”是幽默的非标准词，可指“友谊/伙伴关系”，也可戏称与老鼠（宠物鼠）或电脑鼠标之间的亲密关系/默契。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(humorous, nonstandard) Friendship or companionship, often said playfully (by analogy with “friendship”).","zh":"（幽默、非标准用法）友谊、伙伴关系（仿照“friendship”的说法，带玩笑语气）。"},"examples":[{"en":"Our little study group turned into real mouseship—we help each other every week.","zh":"我们的小学习小组变成了真正的“mouseship”——每周都互相帮忙。"},{"en":"Thanks for the mouseship during a tough semester.","zh":"感谢你在艰难学期里的“mouseship”（一路陪伴与支持）。"}]},{"partOfSpeech":"n.","definition":{"en":"(humorous) A close bond with a “mouse,” especially a pet mouse; sometimes also used jokingly in computer contexts for a person’s relationship with their computer mouse.","zh":"（幽默）与“mouse（鼠）”的亲密关系，尤其指宠物鼠；有时也戏称人与电脑鼠标之间的“默契/依赖”。"},"examples":[{"en":"Ever since I adopted her, our mouseship has grown—she climbs onto my hand every day.","zh":"自从我领养了她，我们的“mouseship”越来越深——她每天都会爬到我手上。"},{"en":"My mouseship with this new mouse is great—editing feels much faster now.","zh":"我和这个新鼠标的“mouseship”很棒——剪辑操作感觉快多了。"}]}],"synonyms":["friendship","companionship","camaraderie","bond"],"phonetic":"/ˈmaʊsˌʃɪp/","extraExplanation":["“mouseship”不是常见标准词，更像是网友自造词/玩笑说法：把“friendship”里的 -ship（表示“关系/状态”，如 friendship, partnership）套到 mouse 上，表达一种可爱或戏谑的“友谊/关系”。","如果你是想写“membership（会员资格）”或“mothership（母舰/母体）”，拼写不同、意思也完全不同。"]}
{"word":"mousetail","summary":{"en":"Mousetail usually means a mouse’s tail, or something long and thin like one; it can also be the name of a small wild plant with a tail-like flower spike.","zh":"mousetail 通常指“老鼠的尾巴”或像鼠尾一样细长的东西；也可指一种花序像鼠尾的小型野生植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tail of a mouse; something shaped like a mouse’s thin tail","zh":"老鼠的尾巴；（引申）形状像细细鼠尾的东西"},"examples":[{"en":"The cat dropped a mousetail on the porch.","zh":"那只猫把一条鼠尾丢在门廊上。"},{"en":"She tied the ribbon into a long, mousetail shape.","zh":"她把丝带系成了细长的“鼠尾”形状。"}]},{"partOfSpeech":"n.","definition":{"en":"a small plant with a long, thin flower spike, resembling a mouse’s tail (often referring to the plant genus Myosurus, especially Myosurus minimus)","zh":"鼠尾草属的一种小型植物；花序细长，像老鼠尾巴（常指鼠尾草属 Myosurus，尤其是小鼠尾草 Myosurus minimus）"},"examples":[{"en":"Tiny mousetail plants grew in the wet field after spring rain.","zh":"春雨后，潮湿的田地里长出了小小的鼠尾草植物。"},{"en":"In the guidebook, mousetail is listed as a wildflower found in damp grasslands.","zh":"在图鉴里，鼠尾草被列为生长在潮湿草地的野花。"}]}],"synonyms":["mouse tail","tail","spike (plant)","wildflower (for the plant sense)"],"phonetic":"/ˈmaʊsˌteɪl/","extraExplanation":["“mousetail / mouse-tail”既可以写作一个词，也常写作两个词“mouse tail”。在日常英语里，如果只是指“老鼠的尾巴”，更常见写法是“mouse tail”；写成一个词时，较常出现在植物名称或描述形状的语境中。","植物学里常见的“mousetail”（Myosurus）名称来自希腊语：myo-（鼠）+ oura（尾），意思就是“鼠尾”。"]}
{"word":"mousetrap","summary":{"en":"A mousetrap is a device for catching mice, and it can also mean a clever trap in a figurative sense.","zh":"mousetrap 指捕鼠器，也可比喻精心设计的陷阱或圈套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device used to catch or kill mice.","zh":"捕鼠器；捉老鼠的装置。"},"examples":[{"en":"We set a mousetrap in the kitchen after seeing a mouse.","zh":"看到老鼠后，我们在厨房里放了一个捕鼠器。"},{"en":"This mousetrap is designed to catch mice without harming them.","zh":"这个捕鼠器的设计是不伤害老鼠地把它们抓住。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that is cleverly designed to attract someone and trap them (often used figuratively).","zh":"（比喻）精心设计的圈套；诱人上当的陷阱。"},"examples":[{"en":"The “free trial” was a mousetrap to get people to pay later.","zh":"“免费试用”其实是个圈套，目的是让人之后付费。"},{"en":"Be careful—some online deals are mousetraps.","zh":"小心——有些网上优惠是陷阱。"}]}],"synonyms":["mouse trap","trap","snare","device","scheme"],"phonetic":"/ˈmaʊsˌtræp/","extraExplanation":["在英语里，mousetrap 常用来做比喻，强调“看起来很诱人、但会让你被困住”的设计。","文化提示：The Mousetrap 也是阿加莎·克里斯蒂（Agatha Christie）的著名推理剧名（1952年首演），因此在文学/戏剧语境里看到 mousetrap 也可能指这部作品。"]}
{"word":"mousetrapped","summary":{"en":"Mousetrapped means caught like a mouse in a trap, often used figuratively for being stuck with no easy way out.","zh":"mousetrapped 指“像老鼠被捕鼠器夹住一样被困住”，也常比喻“陷入困境、难以脱身”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"caught in a mousetrap; trapped the way a mouse is trapped (often used figuratively to mean caught with no easy escape).","zh":"被捕鼠器夹住的；像老鼠一样被困住的（也常用于比喻：陷入困境、难以脱身）。"},"examples":[{"en":"The mouse was mousetrapped in the corner of the kitchen.","zh":"那只老鼠在厨房角落里被捕鼠器夹住了。"},{"en":"After he lied, he felt mousetrapped by his own story.","zh":"他说了谎之后，感觉被自己的说辞困住了。"},{"en":"The contract left small businesses mousetrapped with hidden fees.","zh":"这份合同让小企业被隐藏费用“困住”，难以脱身。"}]},{"partOfSpeech":"vt.","definition":{"en":"to trap (someone or something), as if using a mousetrap (rare; usually expressed as “trap” instead).","zh":"用捕鼠器一样的方式困住/夹住（较少用；通常直接用 trap）。"},"examples":[{"en":"They mousetrapped the animal with a simple spring device.","zh":"他们用一个简单的弹簧装置把动物夹住了。"},{"en":"The clever question mousetrapped him into admitting the truth.","zh":"那个巧妙的问题把他“逼到角落”，不得不承认真相。"}]}],"synonyms":["trapped","caught","cornered","stuck","ensnared"],"phonetic":"/ˈmaʊsˌtræpt/","extraExplanation":["“mousetrapped”多见于非正式表达，常作为形容词使用，强调“像老鼠被夹住那样动弹不得”的画面感；正式写作里通常用 trapped / cornered / stuck 来替换，会更自然。","词源上来自 mousetrap（捕鼠器）+ -ed（过去分词/形容词后缀）。比喻用法常用于描述被规则、谎言、费用、问题等“卡住”。"]}
{"word":"mousetrapping","summary":{"en":"Mousetrapping means catching mice using a mousetrap, usually for pest control.","zh":"mousetrapping 指用捕鼠器抓老鼠，常用于害虫防治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or practice of catching mice by using a mousetrap (often as part of pest control)","zh":"用捕鼠器抓老鼠的行为；捕鼠（常用于害虫防治）"},"examples":[{"en":"Mousetrapping is a common method of pest control in older buildings.","zh":"在老旧建筑里，用捕鼠器捕鼠是一种常见的害虫防治方法。"},{"en":"They tried mousetrapping in the kitchen after seeing droppings.","zh":"他们在看到粪便后，开始在厨房放捕鼠器捕鼠。"}]}],"synonyms":["mouse trapping","trapping mice","setting mousetraps","pest control"],"phonetic":"/ˈmaʊsˌtræpɪŋ/","extraExplanation":["“mousetrapping”在日常英语里不如“setting a mousetrap / trapping mice / mouse trapping”常见；写作时更自然的表达通常是动词短语（例如：We set traps for mice.）。","相关词：mousetrap（捕鼠器）；mouse trap（捕鼠器/捕鼠装置）；trap mice（捕鼠）。","文化延伸：英语里常有“build a better mousetrap（造出更好的捕鼠器）”的说法，常用来比喻“做出更好的产品/方案就会有人来买/来用”。"]}
{"word":"mousetraps","summary":{"en":"“Mousetraps” are devices for catching mice, and can also mean traps or setups meant to catch people (figuratively).","zh":"“mousetraps”指捕鼠器；也可作比喻，表示设下的陷阱或圈套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Devices used to catch (or kill) mice; the plural form of “mousetrap.”","zh":"捕鼠器；“mousetrap”的复数形式，用来抓（或杀）老鼠的装置。"},"examples":[{"en":"We put mousetraps in the kitchen after we saw droppings.","zh":"看到老鼠粪便后，我们在厨房放了捕鼠器。"},{"en":"Check the mousetraps every morning and dispose of them safely.","zh":"每天早上检查捕鼠器，并安全处理。"}]},{"partOfSpeech":"n.","definition":{"en":"A plan, trick, or situation designed to catch someone (often used metaphorically).","zh":"（比喻）圈套、陷阱；用来“逮住”某人的计策或局面。"},"examples":[{"en":"The fake email was a mousetraps-and-bait kind of scam.","zh":"那封假邮件是一种“放诱饵设圈套”的骗局。"},{"en":"He felt the questions were mousetraps meant to make him admit something.","zh":"他觉得那些问题像陷阱，想逼他承认什么。"}]}],"synonyms":["mouse trap","trap","snare","set-up"],"phonetic":"/ˈmaʊsˌtræp/","extraExplanation":["“mousetrap”最常见的是指捕鼠的工具（如弹簧夹、粘鼠板等）。在写作或口语里也常被用作比喻，表示“精心设置的陷阱/圈套”。","文化小知识：有句常见格言（常被归于爱默生，但来源并不确定）——“Build a better mousetrap, and the world will beat a path to your door.” 意思是：如果你做出更好的产品/方法，人们自然会来找你。"]}
{"word":"mouseweb","summary":{"en":"Mouseweb is an archaic/literary word meaning a cobweb or very thin spiderweb.","zh":"mouseweb 是古用/文学用语，意思是蛛网（常指很薄、显得陈旧的蛛网）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cobweb; a very thin spiderweb (archaic or literary).","zh":"（古用或文学用语）蛛网；很薄的蜘蛛网。"},"examples":[{"en":"The attic window was veiled with mouseweb and dust.","zh":"阁楼的窗户被蛛网和灰尘蒙住了。"},{"en":"In old poems, “mouseweb” can suggest something fragile and neglected.","zh":"在旧诗中，“mouseweb”常用来暗示脆弱与被遗忘的感觉。"}]}],"synonyms":["cobweb","spiderweb","gossamer"],"phonetic":"/ˈmaʊs.wɛb/","extraExplanation":["“mouseweb”并不是现代日常英语里常用的词，更常见的说法是 cobweb（常指积灰的旧蛛网）或 spiderweb（更中性、字面意义的蜘蛛网）。","它属于偏古旧/文学的用词，有时出现在较早期的英文文本中，用来营造陈旧、荒废、无人打理的意象。"]}
{"word":"mousey","summary":{"en":"Mousey means shy and timid, or (less commonly) plain/unobtrusive in appearance, sometimes describing a dull light-brown hair color.","zh":"Mousey 指腼腆胆小、安静低调；也可指外表朴素不显眼（有时形容暗淡的浅棕色发色）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shy, quiet, and not very confident; timid in a gentle way (often describing a person’s personality or behavior).","zh":"（人）腼腆的、安静的、不太自信的；有点胆小但温和的（常形容性格或举止）。"},"examples":[{"en":"She’s a bit mousey in large groups, but she opens up with close friends.","zh":"她在大团体里有点腼腆，但和亲近的朋友在一起就会放开。"},{"en":"He gave a mousey smile and avoided eye contact.","zh":"他腼腆地笑了笑，避开了眼神接触。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a “mousy” look, especially plain or unobtrusive; sometimes used for hair color (a dull light brown).","zh":"（外表）不显眼的、朴素的；也可指“鼠色”发色（偏暗淡的浅棕色）。"},"examples":[{"en":"She used to describe her hair as mousey brown.","zh":"她过去常把自己的发色形容为暗淡的浅棕色。"},{"en":"He wore mousey colors so he wouldn’t stand out.","zh":"他穿了些不显眼的颜色，这样就不会太突出。"}]}],"synonyms":["shy","timid","quiet","meek","reserved","mousy"],"phonetic":"/ˈmaʊsi/","extraExplanation":["“mousey”比较口语，也常写作更常见的拼法“mousy”。形容人时语气通常较温和，偏“害羞/低调”，但在某些语境里也可能带一点点负面意思（比如“太不起眼、没存在感”）。","与“shy”相比，“mousey/mousy”更强调像老鼠一样“悄悄的、低调的、不敢张扬”。"]}
{"word":"mousier","summary":{"en":"**mousier** means “more mousy”: either more shy/quiet and easily overlooked, or having a dull light-brown/gray-brown color (often hair).","zh":"**mousier** 是 **mousy** 的比较级，表示“更害羞、更不起眼”，也可指（常指头发）“颜色更灰棕、更暗淡”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of **mousy**: more like a mouse in appearance or behavior (often meaning shy, quiet, timid, or easily overlooked).","zh":"**mousy** 的比较级：更像老鼠（常指性格害羞、安静、胆小、不起眼）。"},"examples":[{"en":"After the big meeting, he seemed even mousier and barely spoke.","zh":"大会结束后，他显得更胆怯、更不爱说话了。"},{"en":"With her new haircut, her look became mousier and less confident.","zh":"换了新发型后，她看起来更不起眼，也更缺乏自信。"}]},{"partOfSpeech":"adj.","definition":{"en":"Comparative form of **mousy**: having a dull light-brown or gray-brown color (especially hair).","zh":"**mousy** 的比较级：（尤指头发）颜色更偏暗淡的浅棕或灰棕色。"},"examples":[{"en":"In winter, his hair looks mousier because the sun isn’t as strong.","zh":"冬天阳光不强，他的头发看起来更灰棕、更暗淡。"},{"en":"The photo makes her hair seem mousier than it really is.","zh":"这张照片让她的发色看起来比实际更灰棕、更暗。"}]}],"synonyms":["shyer","timider","quieter","more reserved","drabber","duller-colored"],"phonetic":"ˈmaʊsiər","extraExplanation":["“mousy/mousier”在英语里常带一点主观评价：形容人时可能暗示“缺乏存在感、没自信”，有时会显得不太礼貌；描述发色时则更中性。想更客气，可以说“quiet/reserved（安静内向）”或“light brown hair（浅棕色头发）”。"]}
{"word":"mousiest","summary":{"en":"“Mousiest” means the most mousy—either the most shy/quiet or the most plain, and sometimes the most mouse-like in color.","zh":"“mousiest”是“mousy”的最高级，表示“最害羞内向/最不起眼”，有时也指“颜色或外观最像老鼠（灰褐色）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “mousy”: the most shy, quiet, or lacking confidence; also the most plain or dull in appearance (especially about a person’s style).","zh":"“mousy”的最高级：最害羞、最安静或最缺乏自信的；也可指（尤其形容人的打扮）最朴素、最不起眼。"},"examples":[{"en":"Of the three interns, Mia seemed the mousiest and rarely spoke in meetings.","zh":"在三个实习生里，Mia 看起来最害羞，开会时很少说话。"},{"en":"He wore the mousiest outfit—brown sweater, plain jeans, and no accessories.","zh":"他的穿搭最不起眼——棕色毛衣、普通牛仔裤，而且没有任何配饰。"},{"en":"The teacher tried to encourage the mousiest students to share their ideas.","zh":"老师试着鼓励最内向的学生分享想法。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most like a mouse in color or look (grayish-brown; small and unobtrusive).","zh":"最像老鼠的（颜色或外观）：灰褐色的；小而不显眼的。"},"examples":[{"en":"The mousiest kitten in the litter was a soft gray-brown.","zh":"那窝小猫里最像老鼠颜色的一只，是柔和的灰褐色。"},{"en":"They chose the mousiest paint shade for the hallway—a muted gray-brown.","zh":"他们给走廊选了最“鼠色”的油漆——低调的灰褐色。"}]}],"synonyms":["shy","timidest","quietest","most reserved","plainest","dullest","mouse-like"],"phonetic":"/ˈmaʊ.si.ɪst/","extraExplanation":["“mousy / mousiness”在口语里常用来形容人“内向、胆小、不爱出风头”，不一定是贬义；但在谈外表时，可能带有“太普通、缺少亮点”的评价。","拼写上也常见更正式的比较形式：mousier（更……）、mousiest（最……）。"]}
{"word":"mousike","summary":{"en":"Mousikē is an ancient Greek word meaning the arts of the Muses—a wide field including music, poetry, and performance.","zh":"Mousikē 是古希腊词，意为“缪斯的艺术”，范围很广，包含音乐、诗歌与表演等文艺活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek) the “art(s) of the Muses,” a broad cultural concept including music, poetry, song, dance, and education in the arts—not just music in the modern sense.","zh":"（古希腊语）“缪斯的艺术”，一种更广义的文化概念，涵盖音乐、诗歌、歌唱、舞蹈以及文艺教育；并非仅指现代意义上的“音乐”。"},"examples":[{"en":"In classical Athens, mousikē was part of a well-rounded education, alongside physical training.","zh":"在古典雅典，mousikē 是全面教育的一部分，与体育训练并列。"},{"en":"When Greek writers mentioned mousikē, they often included poetry and performance, not only instruments.","zh":"希腊作家提到 mousikē 时，常常也包括诗歌与表演，而不只是在说乐器。"}]},{"partOfSpeech":"n.","definition":{"en":"(In historical writing) the study or practice of musical/poetic performance traditions in ancient Greek culture.","zh":"（历史语境中）对古希腊音乐/诗歌表演传统的研究或实践。"},"examples":[{"en":"Her thesis explores mousikē and memory in Greek epic recitation.","zh":"她的论文探讨 mousikē 与希腊史诗吟诵中的记忆机制。"}]}],"synonyms":["music (historical/broader sense)","the arts of the Muses","musical-poetic arts"],"phonetic":"/muːˈziːkeɪ/","extraExplanation":["mousikē（μουσική）字面意思是“与缪斯有关的”。缪斯（Muses）是希腊神话中掌管艺术与灵感的女神，因此 mousikē 在古代更接近“文艺/艺教”的总称。","英语 music 来自拉丁语 musica（源自希腊语 mousikē），所以现代“music”语义变窄，主要指音乐本身。","与之同源的词还有 museum（博物馆，原义可追溯到“缪斯的所在/学术艺术之地”这一文化联想），能帮助理解这类词的文化背景。"]}
{"word":"mousily","summary":{"en":"Mousily means ‘in a mouse-like way,’ often quietly or timidly.","zh":"mousily表示“像老鼠一样地”，常指悄悄地或胆怯地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a mouse-like way, especially quietly, timidly, or stealthily.","zh":"像老鼠一样地；（尤指）悄悄地、胆怯地或偷偷地。"},"examples":[{"en":"He spoke mousily, afraid of drawing attention.","zh":"他说话小心翼翼、怯生生的，怕引起注意。"},{"en":"She slipped mousily out of the room before anyone noticed.","zh":"她趁没人注意，悄悄地溜出了房间。"},{"en":"The child crept mousily toward the cookie jar.","zh":"孩子像小老鼠一样蹑手蹑脚地靠近饼干罐。"}]}],"synonyms":["timidly","quietly","furtively","stealthily","shyly"],"phonetic":"ˈmaʊzəli","extraExplanation":["“mousily”由“mouse（老鼠）+ -ly（副词后缀）”构成，在现代英语里不算常用，更常见的表达是“timidly（胆怯地）”“quietly（安静地）”“furtively/stealthily（偷偷地）”。它带有比较生动、形象的描写色彩，常用于文学或叙述性写作。"]}
{"word":"mousiness","summary":{"en":"Mousiness means being quiet, shy, plain, and not very noticeable.","zh":"Mousiness 指一个人安静害羞、朴素不起眼、不太引人注意的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being quiet, shy, plain, and not very noticeable (often describing a person’s appearance or manner).","zh":"（常形容人的外表或举止）安静害羞、朴素不起眼的特质。"},"examples":[{"en":"She overcame her mousiness and began speaking up in meetings.","zh":"她克服了自己的怯懦不起眼，开始在会议上主动发言。"},{"en":"The makeover helped her shed the mousiness people associated with her.","zh":"这次造型改变帮助她摆脱了别人对她“土气不起眼”的印象。"},{"en":"His mousiness was mistaken for a lack of confidence.","zh":"他的内向不起眼被误认为缺乏自信。"}]}],"synonyms":["shyness","plainness","timidity","reserve","unassertiveness"],"phonetic":"/ˈmaʊsinəs/","extraExplanation":["“mousiness”来自“mouse（老鼠）”，带有“像小老鼠一样不显眼、胆小安静”的联想。它有时带轻微贬义（偏“土气、没存在感”），但也可能只是中性描述“安静低调”。在外貌上也常指发色或穿着偏朴素、无亮点。"]}
{"word":"mousing","summary":{"en":"“Mousing” most commonly means using a computer mouse; it can also mean a cat hunting mice, or (in sailing) securing a shackle/pin with wire.","zh":"“mousing”最常见指用鼠标操作；也可指猫捕鼠，或（航海中）用铁丝/绑扎固定卸扣或销子以防松脱。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"using a computer mouse to move the cursor and click (the -ing form of “mouse”)","zh":"（动词 mouse 的 -ing 形式）用鼠标移动光标并点击"},"examples":[{"en":"I’m mousing over the icon to see the tooltip.","zh":"我把鼠标移到图标上方来查看提示信息。"},{"en":"Stop mousing and start typing the address in the search bar.","zh":"别一直用鼠标点了，直接在搜索栏里输入地址。"}]},{"partOfSpeech":"vi.","definition":{"en":"hunting or catching mice (often said about a cat)","zh":"（常指猫）捕鼠、捉老鼠"},"examples":[{"en":"The cat was mousing in the barn all night.","zh":"那只猫整晚都在谷仓里捉老鼠。"},{"en":"We heard a soft thump—she was mousing behind the boxes.","zh":"我们听到轻轻一声响——它在箱子后面捉老鼠。"}]},{"partOfSpeech":"n.","definition":{"en":"in sailing/rigging, the act of securing a shackle, hook, or pin with wire or seizing so it can’t come undone accidentally","zh":"（航海/索具）用铁丝或绑扎固定卸扣、钩子或销子，防止意外松脱的做法"},"examples":[{"en":"Before we hoisted the sail, we checked the mousing on the shackle.","zh":"升帆前，我们检查了卸扣上的防松绑扎。"},{"en":"Good mousing helps prevent hardware from shaking loose in rough seas.","zh":"良好的防松绑扎能防止五金件在风浪中震松。"}]}],"synonyms":["using a mouse","mouse work","mouse over","hunting mice","catching mice","securing","seizing (nautical)"],"phonetic":"ˈmaʊzɪŋ","extraExplanation":["“mousing”最常见于电脑语境，相当于“用鼠标操作”。口语里也常说“mouse over（鼠标悬停）”“click/drag with the mouse（用鼠标点击/拖拽）”。","第二个含义来自动词“to mouse”（像猫一样捕鼠），多用于描写动物行为，带一点文学/叙述色彩。","航海含义比较专业：在索具上用金属丝或绑扎把插销/卸扣“锁住”，以免震动导致脱开。"]}
{"word":"mousingly","summary":{"en":"“Mousingly” means ‘in a mouse-like way,’ often describing timid, quiet, or sneaky behavior.","zh":"“mousingly”意为“像老鼠一样地”，常形容胆怯、悄悄或鬼鬼祟祟的行为。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a mouse-like way; timidly, quietly, or furtively (often suggesting shyness or sneaky movement).","zh":"像老鼠一样地；胆怯地、悄悄地、鬼鬼祟祟地（常带有害羞或偷偷行动的意味）。"},"examples":[{"en":"He spoke mousingly, barely loud enough for anyone to hear.","zh":"他说话很“鼠气”，声音小得几乎没人听见。"},{"en":"She slipped mousingly out of the room to avoid questions.","zh":"她悄悄地溜出房间，想躲开盘问。"},{"en":"The child approached the strict teacher mousingly, clutching the note.","zh":"孩子攥着纸条，怯生生地走向那位严厉的老师。"}]}],"synonyms":["timidly","quietly","furtively","shyly","sneakily"],"phonetic":"/ˈmaʊzɪŋli/","extraExplanation":["“mousingly”非常少见，多出现在文学或刻意描写的语境中，用来制造形象感（像老鼠那样轻、快、怯）。日常英语里更常用 quietly / timidly / furtively / sneakily 来表达。","构词上是 mouse（老鼠）+ -ingly（表示“以……的方式”）。因此它带有明显的比喻色彩，而不只是“安静”这么中性。"]}
{"word":"mousings","summary":{"en":"“Mousings” is the plural of “mousing,” meaning catching mice, cautious searching/investigating, or computer-mouse actions depending on context.","zh":"“mousings”是“mousing”的复数，可指捕鼠行为、四处探寻/打探，或电脑中的鼠标操作，需结合语境理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of catching or hunting mice (often said of cats); plural form of “mousing.”","zh":"捕鼠、猎鼠的行为（常指猫）；“mousing”的复数形式。"},"examples":[{"en":"The barn cat’s nightly mousings kept the grain store safe.","zh":"那只谷仓猫每晚的捕鼠活动让粮仓更安全。"},{"en":"We noticed fresh mousings near the hay bales.","zh":"我们在干草捆附近注意到新出现的捕鼠痕迹。"}]},{"partOfSpeech":"n.","definition":{"en":"time spent searching around cautiously or curiously; quiet, indirect investigation; plural form of “mousing.”","zh":"小心或好奇地四处探寻；悄悄、间接的打探；“mousing”的复数形式。"},"examples":[{"en":"After a few mousings in the library, she found the exact quote.","zh":"在图书馆一番翻找后，她找到了那句原话。"},{"en":"His mousings around the topic suggested he didn’t want to speak directly.","zh":"他在话题边缘打转，暗示他不想直说。"}]},{"partOfSpeech":"n.","definition":{"en":"actions done with a computer mouse (moving the pointer, clicking, etc.); plural form of “mousing.”","zh":"使用电脑鼠标的操作（移动指针、点击等）；“mousing”的复数形式。"},"examples":[{"en":"The tutorial reduces unnecessary mousings by adding keyboard shortcuts.","zh":"这份教程通过加入快捷键来减少不必要的鼠标操作。"},{"en":"Too many mousings can slow down your workflow.","zh":"过多的鼠标操作会拖慢你的工作流程。"}]}],"synonyms":["hunt","mouse-hunting","searching","snooping","investigating","mouse use"],"phonetic":"/ˈmaʊzɪŋz/","extraExplanation":["“mousing”最早常见于描述猫“捉老鼠”的行为；后来在口语里也可引申为“到处翻找/探查”。进入电脑时代后，它又自然延伸出“用鼠标操作”的意思（类似于 browsing → 浏览）。","在实际写作中，“mousings”并不算高频词；更常见的表达有：foraging/searching around（四处找）、mouse use/mouse actions（鼠标操作）、catching mice（抓老鼠）。"]}
{"word":"mousle","summary":{"en":"“Muscle” means the body tissue that makes movement, and it can also mean strength; as a verb, it means using force to move or achieve something.","zh":"“muscle”指“肌肉”，也可引申为“力量/体力”；作动词时表示“用力推动、强行完成”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a part of the body (tissue) that contracts to produce movement; also used to mean physical strength","zh":"肌肉；（引申）体力、力量"},"examples":[{"en":"Running helps strengthen your leg muscles.","zh":"跑步有助于增强腿部肌肉。"},{"en":"After carrying the boxes, my muscles were sore.","zh":"搬完箱子后，我的肌肉很酸痛。"},{"en":"It takes muscle to move that heavy table.","zh":"搬动那张重桌子需要很大的力气。"}]},{"partOfSpeech":"v.","definition":{"en":"to use physical strength to force something to move or happen","zh":"用力推动；硬是把……弄成（口语）"},"examples":[{"en":"They muscled the broken car to the side of the road.","zh":"他们用力把坏掉的车推到路边。"},{"en":"She muscled her way through the crowd.","zh":"她用力挤过人群。"}]}],"synonyms":["strength","power","brawn","force"],"phonetic":"/ˈmʌsəl/","extraExplanation":["“mousle”通常不是标准英文拼写；最常见的可能是你想写 **muscle**（肌肉）。另一个容易混淆的单词是 **muzzle** /ˈmʌzəl/（动物的口鼻部；给动物戴口套；或“压制言论”），拼写和发音都很接近。"]}
{"word":"mouslingly","summary":{"en":"A very rare/nonstandard adverb meaning “in a mouse-like, quiet or timid way.”","zh":"一个非常罕见/非标准的副词，表示“像老鼠一样地（悄悄地、胆怯地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare / nonstandard) In a mouse-like way; quietly, timidly, or furtively.","zh":"（非常罕见／非标准用法）以像老鼠一样的方式；安静地、胆怯地或偷偷摸摸地。"},"examples":[{"en":"He moved mouslingly along the wall, trying not to be noticed.","zh":"他贴着墙像小老鼠一样悄悄地走，尽量不引人注意。"},{"en":"The child spoke mouslingly when strangers were in the room.","zh":"房间里有陌生人时，孩子说话像小老鼠一样小声、怯怯的。"}]}],"synonyms":["timidly","quietly","furtively","sneakily"],"phonetic":"ˈmaʊzlɪŋli","extraExplanation":["“mouslingly”在现代英语中几乎不见于正规词典或常用语料，更可能是作者的临时造词（nonce word）或拼写错误。","如果你想表达“若有所思地”，更常见的词是 **musingly**。如果你想表达“像老鼠一样/胆怯地”，常用的是 **mouse-like**（形容词）或更常见的副词表达如 **timidly / quietly / furtively**。","如果你能提供原句或出处（书名/段落截图），我可以更准确判断作者想表达的语气与含义。"]}
{"word":"mousme","summary":{"en":"Mousme is a dated word meaning a Japanese girl or young woman, mostly seen in older Western literature about Japan.","zh":"Mousme 是一个过时词，指日本少女或年轻女子，多见于较早期西方描写日本的文学与游记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated) A Japanese girl or young woman; a term found mainly in older Western writing about Japan.","zh":"（过时用法）日本少女或年轻女子；多见于较早期西方描写日本的文字中。"},"examples":[{"en":"In the old travel book, the author describes meeting a cheerful mousme in Nagasaki.","zh":"在那本旧游记里，作者写到在长崎遇见一位开朗的“mousme”（日本少女）。"},{"en":"The word mousme sounds exotic today, but it is considered old-fashioned and can feel stereotypical.","zh":"“mousme”如今听起来很“异国情调”，但它被认为是过时的用词，也可能带有刻板印象。"}]}],"synonyms":["Japanese girl","young Japanese woman"],"phonetic":"/ˈmuːzmeɪ/","extraExplanation":["词源与使用背景：mousme（也常写作 mousmé）源自日语「娘（むすめ, musume）」意为“女儿/少女”。它通过19世纪末至20世纪初的西方（尤其法语）旅行文学进入英语。","语体与文化敏感性：该词在现代英语中较少使用，带有历史语境和“东方主义”色彩；当代写作中更中性、准确的表达通常是 “a Japanese girl/young woman”。"]}
{"word":"mousmee","summary":{"en":"“Mousmee” is an old term for a Japanese girl/young woman, but it is outdated and can be offensive today.","zh":"“mousmee”是旧时对日本女孩/年轻女性的称呼，如今已过时且可能带冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, now often offensive) A Japanese girl or young woman; sometimes used to mean a “geisha-like” young woman in Western writing.","zh":"（旧式用法，如今常被认为带有冒犯性）日本女孩或年轻女性；在一些西方旧文本中也被用来指带有“艺伎”想象的年轻女子。"},"examples":[{"en":"In some 19th‑century travel books, the author describes a “mousmee” serving tea.","zh":"在一些19世纪的游记里，作者会写到一位“mousmee”端茶待客。"},{"en":"Today, it’s better to say “a Japanese girl/young woman,” because “mousmee” can sound disrespectful.","zh":"如今更好的说法是“a Japanese girl/young woman（日本女孩/年轻女性）”，因为“mousmee”可能显得不尊重。"}]}],"synonyms":["Japanese girl","young Japanese woman"],"phonetic":"/muzˈmi/","extraExplanation":["词源来自日语「娘（むすめ, musume）」，意思是“女儿/姑娘”。“mousmee”是西方人在19世纪把这个词用法语或英语方式拼写出来的转写形式。","这个词常出现在殖民时代的旅行写作、通俗小说或“异国情调（exotic）”叙述里，容易把日本女性刻板化、物化；因此现代英语中不推荐使用，除非是在讨论历史文本或引用原文。","如果你是在读文学/歌剧相关材料，可能会在与《Madame Butterfly（蝴蝶夫人）》等作品相关的评论里看到类似旧称呼。"]}
{"word":"mousoni","summary":{"en":"Mousoni is usually a variant spelling of Mousuni Island in the Sundarbans, India; it can also appear as a less common spelling in names.","zh":"Mousoni 通常是印度孙德尔本斯地区 Mousuni 岛的变体拼写；也可能作为姓名中的较少见拼写出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Mousoni (more commonly spelled Mousuni) is a small island in the Sundarbans region of West Bengal, India, known for mangroves, fishing villages, and coastal scenery.","zh":"Mousoni（更常见拼写为 Mousuni）是印度西孟加拉邦孙德尔本斯地区的一座小岛，以红树林、渔村与海岸风光闻名。"},"examples":[{"en":"We visited Mousoni Island to see the mangroves and local fishing life.","zh":"我们去 Mousoni 岛看红树林和当地的渔业生活。"},{"en":"Mousoni is often mentioned as a quieter alternative to more crowded beach areas nearby.","zh":"Mousoni 常被提到是附近更热闹海滩之外、更安静的选择。"}]},{"partOfSpeech":"other","definition":{"en":"A less common spelling of a place name or family name; it may appear in personal names or local transliterations.","zh":"一种不太常见的地名或姓氏拼写；也可能出现在人名或地方音译中。"},"examples":[{"en":"I saw “Mousoni” in the document, but another source spelled it “Mousuni.”","zh":"我在文件里看到 “Mousoni”，但另一个来源写的是 “Mousuni”。"}]}],"synonyms":["Mousuni (variant spelling)","Mousuni Island"],"phonetic":"/muːˈsoʊni/","extraExplanation":["“Mousoni / Mousuni” 的拼写差异常见于从孟加拉语等语言转写到英语时：不同地图、媒体或个人习惯会导致元音/辅音的不同呈现。如果你是在特定文章、地图或人名中看到这个词，发我上下文，我可以帮你确认具体指哪一个。"]}
{"word":"mousquetaire","summary":{"en":"“Mousquetaire” is the French word for “musketeer,” a historical soldier armed with a musket, often associated with 17th‑century France.","zh":"“mousquetaire”是法语“火枪手”，指历史上持火枪的士兵，常与17世纪法国联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a musketeer; a soldier armed with a musket (especially in 17th‑century France)","zh":"火枪手；（尤指17世纪法国）使用火枪的士兵"},"examples":[{"en":"In the novel, the young man dreams of becoming a mousquetaire in the king’s service.","zh":"在小说里，这个年轻人梦想成为国王麾下的一名火枪手。"},{"en":"The museum exhibit shows the uniform and weapons of a French mousquetaire.","zh":"博物馆展览展示了法国火枪手的制服和武器。"}]}],"synonyms":["musketeer","soldier","guardsman"],"phonetic":"/ˌmʊskəˈtɪr/","extraExplanation":["“mousquetaire”是法语词，英语里更常见的对应词是“musketeer”。在文化语境中，它常让人联想到大仲马的小说《三个火枪手》（The Three Musketeers），其中“火枪手”不仅指一种军职，也带有“忠诚、勇敢、讲义气”的浪漫化形象。","词源上与“mousquet”（火枪）有关；现代英语阅读中遇到“mousquetaire”，通常是为了保留法式氛围或历史感。"]}
{"word":"mousquetaires","summary":{"en":"French plural for “musketeers,” especially the King’s Musketeers as in *The Three Musketeers*.","zh":"“火枪手”的法语复数，常特指《三个火枪手》里的法国国王火枪手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French, plural noun) Musketeers; soldiers armed with muskets—often used in English to refer specifically to the King’s Musketeers of France (famously in *The Three Musketeers*).","zh":"（法语，复数名词）火枪手；持火枪作战的士兵——英语中常特指法国“国王火枪手”（因《三个火枪手》而广为人知）。"},"examples":[{"en":"In Dumas’s novel, the mousquetaires swear loyalty to the king.","zh":"在大仲马的小说里，这些mousquetaires誓死效忠国王。"},{"en":"The film turns the mousquetaires into larger-than-life heroes.","zh":"电影把这些mousquetaires塑造成传奇式的英雄。"}]}],"synonyms":["musketeers","King’s Musketeers","the Musketeers"],"phonetic":"/ˌmuːskəˈtɛrz/","extraExplanation":["“mousquetaires”是法语复数形式（单数：mousquetaire）。英语里更常用对应的英文词“musketeers”。","历史上“国王火枪手”（Les Mousquetaires du Roi）是法国王室的精锐部队之一；文学与影视作品常把他们浪漫化为佩剑、讲义气、爱冒险的形象。"]}
{"word":"moussaka","summary":{"en":"Moussaka is a baked, layered dish—often eggplant, meat sauce, and béchamel—common in Greek cuisine.","zh":"Moussaka（穆萨卡）是一种常见于希腊料理的烤制分层菜：多为茄子、肉酱与白酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baked layered dish, usually made with eggplant (aubergine), a meat sauce (often ground lamb or beef), and a creamy topping such as béchamel.","zh":"一种烤制的分层菜肴，通常由茄子（eggplant）、肉酱（常用羊/牛绞肉）以及白酱（béchamel）等奶香酱料覆盖烘烤而成。"},"examples":[{"en":"We ordered moussaka and Greek salad for dinner.","zh":"我们晚餐点了穆萨卡和希腊沙拉。"},{"en":"Her homemade moussaka has layers of eggplant, spiced meat, and béchamel sauce.","zh":"她自制的穆萨卡有茄子层、香料肉酱层和白酱层。"}]}],"synonyms":["Greek eggplant casserole","eggplant bake"],"phonetic":"/muːˈsɑːkə/","extraExplanation":["“Moussaka”常与希腊料理联系最紧密（尤其是上面覆盖白酱、进烤箱烘烤的版本），但在巴尔干和中东一些地区也有不同做法：有的会用土豆或西葫芦替代部分茄子，也可能不加白酱。","词源与地区语言有关（常见解释是经由土耳其语/阿拉伯语传入），所以拼写在不同语言里会略有差异，但英语里最常见写法是 moussaka。"]}
{"word":"moussakas","summary":{"en":"Moussakas are multiple servings or types of moussaka, a Greek-style layered baked dish often made with eggplant, minced meat, and béchamel sauce.","zh":"moussakas 是 moussaka 的复数，指多份或多种穆萨卡——一种希腊风格的分层烤制料理，常由茄子、肉末和白酱组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a baked Mediterranean dish (especially Greek) made in layers, commonly including eggplant, minced meat, and a creamy sauce (often béchamel).","zh":"一种烤制的地中海分层料理（尤其常见于希腊），通常由茄子、肉末和奶油酱（常为白酱/贝夏美酱）分层组成。"},"examples":[{"en":"We ordered moussaka and a Greek salad for dinner.","zh":"我们晚餐点了穆萨卡和一份希腊沙拉。"},{"en":"Her moussaka is made with eggplant, ground lamb, and a thick béchamel topping.","zh":"她的穆萨卡用茄子、羊肉末和厚厚的白酱顶层做成。"}]}],"synonyms":["moussaka (singular)","Greek eggplant casserole","Greek-style layered bake"],"phonetic":"/muːˈsɑːkə/","extraExplanation":["“moussakas”是“moussaka”的复数形式，指多份或多种穆萨卡。英语里更常见的单数拼写是“moussaka”。","这道菜常被类比为“Greek lasagna（希腊千层面）”，因为都是分层烘烤；但穆萨卡通常用茄子（有时也会用土豆或西葫芦）替代意面层。","名称与做法在东地中海和巴尔干地区都有变体；英语语境下提到moussaka，最常指带白酱顶层的希腊版本。"]}
{"word":"mousse","summary":{"en":"Mousse most commonly means a light, fluffy dessert; it can also mean a foam hair-styling product.","zh":"mousse 最常指轻盈蓬松的甜点“慕斯”；也可指泡沫状的发用定型产品“摩丝/发用慕斯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light, airy dessert (often sweet) made by folding whipped cream or beaten egg whites into a flavored base (like chocolate or fruit), so it becomes fluffy.","zh":"一种轻盈蓬松的甜点，通常把打发的奶油或蛋白拌入巧克力、水果等风味底料中，使口感变得绵密蓬松。"},"examples":[{"en":"For dessert, we had chocolate mousse topped with berries.","zh":"甜点我们吃了上面配浆果的巧克力慕斯。"},{"en":"The mousse was so light it almost melted on my tongue.","zh":"这份慕斯非常轻盈，几乎入口即化。"}]},{"partOfSpeech":"n.","definition":{"en":"A foam-like styling product used to shape and hold hair.","zh":"一种泡沫状的美发定型产品，用来塑形并固定发型。"},"examples":[{"en":"She applied mousse to add volume to her hair.","zh":"她抹了发用慕斯，让头发更蓬松。"},{"en":"Use a small amount of mousse before blow-drying.","zh":"吹干前用少量发用慕斯即可。"}]}],"synonyms":["foam","whipped dessert","hair foam"],"phonetic":"/mus/","extraExplanation":["“mousse”来自法语，原意是“泡沫”。所以不管是“巧克力慕斯”还是“发用摩丝/慕斯”，核心感觉都是“轻、蓬松、像泡沫”。","中文里常把发用的 mousse 叫“摩丝”（音译），把甜点的 mousse 叫“慕斯”（更常见于甜品语境）。","在菜单或食谱里常见搭配：chocolate mousse（巧克力慕斯）、lemon mousse（柠檬慕斯）、mousse cake（慕斯蛋糕）。在美发语境里常见：hair mousse（发用慕斯/摩丝）、volumizing mousse（丰盈摩丝）。"]}
{"word":"mousseline","summary":{"en":"Mousseline usually means a very fine, sheer muslin fabric, and in cooking it can mean a light, airy sauce or mixture.","zh":"Mousseline常指一种很薄、轻柔的细布；在烹饪中也可指轻盈绵密的酱汁或混合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very fine, sheer, soft cotton fabric (a type of muslin), often used for dresses, curtains, or delicate linings","zh":"（一种）很薄、轻柔、半透明的棉布；细薄的平纹细布（常用于裙装、窗帘或精致内衬）"},"examples":[{"en":"She chose mousseline for the summer dress because it feels light and airy.","zh":"她选用mousseline做夏装，因为它轻薄透气。"},{"en":"The room looked brighter after they hung white mousseline curtains.","zh":"他们挂上白色mousseline窗帘后，房间显得更明亮。"}]},{"partOfSpeech":"n.","definition":{"en":"(cooking) a light, airy mixture or sauce (for example, a very smooth “mousseline” sauce), typically made by folding in whipped cream or beaten egg whites","zh":"（烹饪）轻盈绵密的混合物或酱（如“mousseline”奶油酱），常通过拌入打发奶油或蛋白使其蓬松"},"examples":[{"en":"The chef served the fish with a lemon mousseline sauce.","zh":"厨师给鱼配了柠檬mousseline酱。"},{"en":"For a lighter texture, fold whipped cream into the mixture to make it mousseline.","zh":"为了更轻盈的口感，把打发奶油拌入混合物做成mousseline。"}]}],"synonyms":["muslin","sheer cotton","gauze (similar, not identical)","light sauce (cooking context)"],"phonetic":"ˈmuːsəˌliːn","extraExplanation":["“Mousseline”源自法语，和“muslin（细布）”是近亲词；在服装语境里多指非常轻薄的棉纱布料，强调“柔、薄、透”。","在烹饪语境中，“mousseline”常用来形容“像慕斯一样轻盈”的质地，也常见于法式酱汁名称（例如在蛋黄酱/荷兰酱基础上加入打发奶油，使口感更轻）。"]}
{"word":"mousses","summary":{"en":"“Mousses” is the plural of “mousse,” meaning either light, airy desserts or foamy hair-styling products.","zh":"“mousses”是“mousse”的复数，既可指轻盈蓬松的甜点（慕斯），也可指泡沫状的发型定型产品（发型慕斯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mousse”: a light, airy dessert (often chocolate) made by folding whipped cream or egg whites into a flavored mixture.","zh":"“mousse”的复数：慕斯；一种口感轻盈、蓬松的甜点，常把打发的奶油或蛋白拌入调味的混合物（如巧克力）。"},"examples":[{"en":"They served three mousses: chocolate, mango, and coffee.","zh":"他们端上了三种慕斯：巧克力、芒果和咖啡。"},{"en":"This mousse is light and not too sweet.","zh":"这个慕斯很轻盈，而且不会太甜。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “mousse”: a foamy styling product used to add volume or hold to hair.","zh":"“mousse”的复数：发胶慕斯/泡沫发型产品；用于增加蓬松感或定型。"},"examples":[{"en":"Different mousses work better for curly hair.","zh":"不同的发型慕斯对卷发的效果不一样。"},{"en":"She tried a few mousses to find one that didn’t feel sticky.","zh":"她试了几款发型慕斯，想找一款不黏的。"}]}],"synonyms":["foam","whipped dessert","hair foam","styling foam"],"phonetic":"/mus/","extraExplanation":["“mousse”来自法语，原意是“泡沫”。所以无论是甜点慕斯还是发型慕斯，本质都强调“轻盈、起泡的质地”。","英语里复数通常写作 mousses（/ˈmuːsɪz/ 的读法很常见），在菜单或美妆产品介绍中很常见。"]}
{"word":"mousseux","summary":{"en":"Mousseux means “sparkling” and can also refer to a sparkling wine, especially in French-style menu or wine contexts.","zh":"mousseux 意为“起泡的”，也可指“起泡酒”，多见于偏法式的酒单或品鉴语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of wine) sparkling; having bubbles.","zh":"（指葡萄酒）起泡的；有气泡的。"},"examples":[{"en":"They served a chilled mousseux at the reception.","zh":"他们在招待会上供应了冰镇的起泡酒。"},{"en":"A mousseux style is often lighter and more festive than still wine.","zh":"起泡型葡萄酒通常比静止葡萄酒更轻盈、更有节日气氛。"}]},{"partOfSpeech":"n.","definition":{"en":"A sparkling wine (especially in French contexts).","zh":"起泡葡萄酒（尤指法语语境中的说法）。"},"examples":[{"en":"The menu lists a mousseux by the glass.","zh":"菜单上有杯装的起泡酒。"},{"en":"He chose a French mousseux for the toast.","zh":"他选了一款法国起泡酒来祝酒。"}]}],"synonyms":["sparkling","bubbly","sparkling wine"],"phonetic":"/muːˈsɜː/","extraExplanation":["“mousseux”来自法语，字面意思与“泡沫、起泡”有关，常见于“vin mousseux（起泡酒）”。在葡萄酒标签/酒单上，它通常是对“sparkling wine（起泡酒）”的法式表达，语气更偏餐饮或品鉴场景。","在英语里更常用的说法是“sparkling wine”。如果是特定产区与工艺的法国起泡酒，常会看到更具体的名称（如 Champagne、Crémant）；“mousseux”则更像是“起泡这一类”的总称。"]}
{"word":"moustache","summary":{"en":"A moustache is the hair on a person’s upper lip.","zh":"moustache 指上唇上的胡须（小胡子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hair that grows on the upper lip, often grown and shaped as a style.","zh":"长在上唇上的胡须，常被留作一种造型或风格。"},"examples":[{"en":"He grew a moustache over the summer.","zh":"他在夏天留起了小胡子。"},{"en":"Her grandfather’s moustache was thick and neatly trimmed.","zh":"她爷爷的小胡子很浓密，而且修剪得很整齐。"}]}],"synonyms":["mustache","’stache (informal)"],"phonetic":"/ˈmʌsˌtæʃ/","extraExplanation":["“moustache”是英式拼写；美式英语更常写作“mustache”，发音相同。","在不同文化里，小胡子可能与成熟、权威、时尚或特定时代的审美相关；也常见于影视角色的形象塑造。"]}
{"word":"moustached","summary":{"en":"“Moustached” means having a mustache.","zh":"“moustached”表示“留着小胡子的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a mustache (facial hair grown above the upper lip).","zh":"长着小胡子（上唇上方的胡须）的。"},"examples":[{"en":"A moustached man opened the door and asked what we needed.","zh":"一个留着小胡子的男人开了门，问我们需要什么。"},{"en":"The detective is often described as a moustached figure in old movies.","zh":"在老电影里，侦探常被描写成一个留着小胡子的形象。"},{"en":"She recognized him by his moustached face and deep voice.","zh":"她通过他留着小胡子的脸和低沉的嗓音认出了他。"}]}],"synonyms":["mustached","whiskered","bearded"],"phonetic":"/ˈmʌstæʃt/","extraExplanation":["“moustached”来自动词化用法（给……留胡子/长胡子），但现代英语里更常把它当作形容词使用，表示“有小胡子的”。","拼写上：美式英语更常写 mustache；英式英语更常写 moustache。两者意义相同。","发音上，“moustache/mustache”中间的“-st-”有时会弱化，听起来更像“muh-STASH”。"]}
{"word":"moustaches","summary":{"en":"“Moustaches” means more than one moustache (upper-lip hair).","zh":"“moustaches”指“上唇胡”的复数，即不止一撮/一处上唇胡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of moustache (also spelled mustache in American English): hair grown on the upper lip.","zh":"moustache 的复数（美式拼写常作 mustache）：长在上唇上的胡子。"},"examples":[{"en":"He has a neat moustache, and his brother has thick moustaches.","zh":"他留着整齐的小胡子，而他哥哥留着浓密的胡子（上唇胡）。"},{"en":"In old photos, many soldiers wore moustaches.","zh":"在老照片里，许多士兵都留着上唇胡。"}]}],"synonyms":["mustaches","upper-lip hair"],"phonetic":"/ˈmʌstæʃɪz/","extraExplanation":["“moustache”更常见于英式英语拼写；美式英语里更常写作“mustache”。两者意思相同。","在描述面部毛发时，moustache/mustache 只指“上唇胡”；如果是下巴或脸颊的胡子，通常用 beard（大胡子/络腮胡）或 goatee（山羊胡）等词区分。"]}
{"word":"moustachial","summary":{"en":"Moustachial means “related to a mustache” or “having a mustache-like style.”","zh":"moustachial 指“与小胡子有关的”或“具有小胡子风格/外观的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a mustache; having the look or style of a mustache.","zh":"与胡子（上唇的胡须）有关的；带有小胡子外观或风格的。"},"examples":[{"en":"He played a moustachial villain in the old movie.","zh":"他在那部老电影里扮演了一个留小胡子的反派。"},{"en":"The actor’s moustachial look made him seem older.","zh":"那位演员的小胡子造型让他看起来更成熟。"}]}],"synonyms":["mustached","mustachioed","moustached"],"phonetic":"/mʌˈstæʃəl/","extraExplanation":["“moustachial”比较少见，更常见的说法是“mustached/moustached”（留着胡子的）或“mustachioed/moustachioed”（留着浓密或显眼小胡子的）。英式拼写常用 moustache，美式常用 mustache，因此你也可能看到拼写差异。","在文学或影视评论里，“moustachial”有时用来营造一种夸张的形象，比如“moustachial villain”（带小胡子的反派），接近一种刻板的戏剧化描写。"]}
{"word":"moustachio","summary":{"en":"“Moustachio” means a moustache, especially one that looks big, stylish, or old-fashioned.","zh":"“moustachio”指小胡子，常强调它很浓密、很讲究或带复古夸张的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A moustache; often used to suggest a large, showy, or old-fashioned moustache.","zh":"小胡子；（常带有）浓密、夸张或复古风格的小胡子之意。"},"examples":[{"en":"He twirled his moustachio while thinking about what to say next.","zh":"他一边捻着自己的小胡子，一边想着接下来该说什么。"},{"en":"The actor wore a dramatic moustachio that made him look like a villain in an old movie.","zh":"那位演员留着一撮很夸张的小胡子，让他看起来像老电影里的反派。"}]}],"synonyms":["moustache","mustache","whiskers"],"phonetic":"/məˈstæʃiˌoʊ/","extraExplanation":["“moustachio”常用于带点幽默或夸张的语气，强调胡子的“戏剧感”。","拼写上也常见“mustachio”（较偏美式）与“moustachio”（较偏英式/法式拼写传统）；含义基本相同。"]}
{"word":"mousterian","summary":{"en":"Mousterian refers to a Middle Paleolithic stone-tool tradition and culture, often linked with Neanderthals.","zh":"Mousterian 指旧石器时代中期的石器传统与文化，常与尼安德特人相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a Middle Paleolithic stone-tool tradition (especially associated with Neanderthals in Europe and Western Asia).","zh":"与旧石器时代中期的一种石器工具传统有关的（多与欧洲及西亚的尼安德特人相关）。"},"examples":[{"en":"Archaeologists found Mousterian tools in the cave layer linked to Neanderthals.","zh":"考古学家在与尼安德特人相关的洞穴地层中发现了穆斯特文化的工具。"},{"en":"The site contains a Mousterian assemblage made mostly of flint.","zh":"该遗址包含一组穆斯特文化的器物组合，主要由燧石制成。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mousterian industry or cultural complex of the Middle Paleolithic, known for characteristic stone tool types and techniques.","zh":"穆斯特文化（旧石器时代中期的一种工业/文化复合体），以特定的石器类型与制作技术著称。"},"examples":[{"en":"In this region, the Mousterian dates to roughly 160,000–40,000 years ago.","zh":"在该地区，穆斯特文化大致可追溯到约16万至4万年前。"},{"en":"Researchers debate how the Mousterian spread across different groups and environments.","zh":"研究者讨论穆斯特文化如何在不同人群与环境间传播。"}]}],"synonyms":["Middle Paleolithic (related term)"],"phonetic":"/muˈstɪriən/","extraExplanation":["更常见的拼写是 Mousterian（首字母常大写）；你输入的 mousterian 也能被理解，但学术写作中通常用大写专有名词形式。","该词来自法国考古遗址 Le Moustier（勒·穆斯捷），因此属于“以地点命名的文化/工业”术语。","学习与阅读建议：在英文考古文章中，Mousterian 常与 Middle Paleolithic（旧石器时代中期）、Neanderthal（尼安德特人）、tool assemblage（工具组合/器物群）、flint knapping（燧石打制）等词一起出现。"]}
{"word":"moustoc","summary":{"en":"A moustache is hair on the upper lip; in American English it’s often spelled mustache.","zh":"moustache 指上唇胡子；美式英语里常拼作 mustache。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"hair that grows on the upper lip, usually left to grow as a style.","zh":"长在上唇上方的胡子（常作为一种造型保留）。"},"examples":[{"en":"He shaved his beard but kept his moustache.","zh":"他把大胡子刮掉了，但保留了上唇胡子。"},{"en":"The actor is famous for his thick moustache.","zh":"这位演员因他浓密的上唇胡子而出名。"}]}],"synonyms":["mustache","upper-lip hair"],"phonetic":"/məˈstæʃ/","extraExplanation":["你输入的 **moustoc** 很可能是拼写错误；常见正确拼法是 **moustache**（英式常用）或 **mustache**（美式更常见）。两者意思相同。","文化小知识：每年11月有“**Movember**”活动，很多人会留（或假装留）moustache 来提高对男性健康议题的关注。"]}
{"word":"mousy","summary":{"en":"Mousy usually means shy/quiet and not confident, or plain and not noticeable; it can also describe a dull brown-gray color (often hair).","zh":"mousy 通常指害羞安静、不自信，或外表不起眼；也可指暗淡的棕灰色（常用于形容头发颜色）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shy, quiet, and not very confident; not wanting attention.","zh":"害羞内向的；胆小安静的；不爱出风头的。"},"examples":[{"en":"She’s very mousy in meetings and rarely speaks up.","zh":"她在会议上很内向，几乎不怎么发言。"},{"en":"He gave a mousy smile and looked down at the floor.","zh":"他怯生生地笑了笑，然后低头看着地板。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Usually of a woman’s appearance) Plain or not noticeable; lacking a bold style.","zh":"（常指女性外表）不起眼的；朴素普通的；缺少鲜明风格的。"},"examples":[{"en":"She felt her mousy haircut made her look older.","zh":"她觉得自己那种不起眼的发型让她看起来更显老。"},{"en":"The character starts off as mousy but becomes more confident later.","zh":"这个角色一开始很不起眼，但后来变得更自信。"}]},{"partOfSpeech":"adj.","definition":{"en":"Mouse-like, especially in color (a dull brown/gray).","zh":"像老鼠的；（尤指颜色）鼠灰色/暗淡的棕灰色。"},"examples":[{"en":"He has mousy brown hair.","zh":"他有一头暗棕偏灰的头发。"},{"en":"The fabric is a soft, mousy gray.","zh":"这块布料是柔和的鼠灰色。"}]}],"synonyms":["shy","quiet","timid","reserved","plain","unassuming"],"phonetic":"/ˈmaʊ.si/","extraExplanation":["“mousy”来自“mouse（老鼠）”。英语里常用动物来形容人的气质：像老鼠一样“低调、胆怯、躲躲闪闪”，因此带一点不太积极的评价色彩。用于外表时也可能显得有些刻薄，正式或礼貌场合可换成更中性的说法，如“quiet”“reserved”“unassuming”。"]}
{"word":"mout","summary":{"en":"“Mout” is not standard English; it’s usually a typo for “mouth,” or an informal abbreviation for “mount” in some contexts.","zh":"“mout”不是标准英语；通常是“mouth”的拼写错误，或在少数语境中非正式地当作“mount”的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling, usually a typo for “mouth.”","zh":"非标准拼写，通常是把“mouth（嘴；口）”打错了。"},"examples":[{"en":"I think you meant “mouth,” not “mout.”","zh":"我觉得你想写的是“mouth”，不是“mout”。"},{"en":"Open your mouth (not “mout”) when you speak clearly.","zh":"想说清楚时要张开嘴（mouth，不是“mout”）。"}]},{"partOfSpeech":"other","definition":{"en":"In some informal notes, “mout” may be used as an abbreviation for “mount” (e.g., in tech or gaming), but this is not standard English.","zh":"在一些非正式记录里，“mout”可能被当作“mount（挂载/安装；山）”的缩写（常见于技术或游戏语境），但这不是标准英语。"},"examples":[{"en":"The guide says to mount the drive; it doesn’t usually say “mout.”","zh":"指南会写“mount the drive（挂载硬盘）”，一般不会写“mout”。"}]}],"synonyms":["mouth (likely intended)","mount (possible intended)"],"phonetic":"/maʊt/","extraExplanation":["“mout”本身不是常见的标准英语单词。如果你是在查“嘴/口”的意思，正确拼写是 **mouth**；如果你是在技术语境看到它，可能是把 **mount** 简写了。你可以告诉我你看到“mout”的句子，我能帮你判断具体想表达哪个词。"]}
{"word":"moutan","summary":{"en":"Moutan means a Chinese tree peony (the plant/flower), and it may also refer to its scent or root bark in perfumery or traditional medicine contexts.","zh":"moutan 指牡丹（尤其是中国树牡丹），在香水或传统药用语境中也可指其香气或根皮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree peony (a woody peony), especially the Chinese tree peony whose root bark is used in traditional medicine and whose scent is sometimes used in perfumery.","zh":"牡丹（木本芍药/树牡丹），尤指中国树牡丹；其根皮常用于传统药用，香气也有时用于香水调香。"},"examples":[{"en":"The garden’s moutan bloomed in late spring with huge, fragrant flowers.","zh":"花园里的牡丹在暮春开花，花朵巨大而芳香。"},{"en":"Some perfumes list moutan as a floral note similar to peony.","zh":"有些香水把 moutan（牡丹）标为一种花香调，感觉与 peony（芍药/牡丹香调）相近。"}]}],"synonyms":["tree peony","peony"],"phonetic":"/muːˈtɑːn/","extraExplanation":["“moutan”一词常见于园艺与香水描述中，来源与“牡丹”的音译/转写有关；在中文文化里，牡丹常被视为“富贵花”，在诗词、绘画与节庆装饰中很常见。","在中药语境中常见的是“牡丹皮”（tree peony root bark），与观赏牡丹是同一类植物的不同使用部位；日常英文里若只是指花，更多人会直接说 “peony” 或 “tree peony”。"]}
{"word":"moutarde","summary":{"en":"Moutarde is French for “mustard,” usually meaning prepared mustard as a condiment.","zh":"moutarde 是法语“芥末”，多指作为调味品的芥末酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mustard (the condiment), especially the French term for prepared mustard.","zh":"芥末（调味品），尤其是法语中指“调制好的芥末酱”。"},"examples":[{"en":"Could you pass the moutarde, please?","zh":"可以把芥末（moutarde）递给我吗？"},{"en":"This sandwich tastes better with a little moutarde.","zh":"这个三明治加一点芥末更好吃。"}]},{"partOfSpeech":"n.","definition":{"en":"Mustard plant or mustard seeds (in cooking contexts).","zh":"芥菜（芥末植物）或芥末籽（常见于烹饪语境）。"},"examples":[{"en":"The recipe calls for seeds of moutarde.","zh":"这个食谱需要用芥末籽。"},{"en":"They grow moutarde in the fields nearby.","zh":"他们在附近的田里种芥菜。"}]}],"synonyms":["mustard","Dijon mustard"],"phonetic":"/muˈtɑrd/","extraExplanation":["“moutarde”是法语词，在英语菜单或法式餐厅里偶尔会直接使用，通常就等同于英文“mustard”。常见搭配如：moutarde de Dijon（第戎芥末）、sauce moutarde（芥末酱汁）。","文化小提醒：英文里“mustard”既可指芥末酱，也可指芥末植物/籽；看到法语“moutarde”时，多数情况下指餐桌上的芥末酱（尤其是第戎风味）。"]}
{"word":"mouth","summary":{"en":"“Mouth” most commonly means the part of the face used for eating and speaking; it can also mean the opening/entrance of something, and as a verb it can mean to speak (sometimes rudely in phrases).","zh":"“mouth”最常指“嘴/口”，也可指“入口/开口处”（如河口、洞口、瓶口）；作动词时表示“说（话）”，在短语中有时带有“顶嘴”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The opening in your face used for eating, speaking, and breathing.","zh":"嘴；口（用来吃东西、说话、呼吸的开口）。"},"examples":[{"en":"Open your mouth and say “ah.”","zh":"张开嘴，说“啊”。"},{"en":"He covered his mouth when he coughed.","zh":"他咳嗽时捂住了嘴。"}]},{"partOfSpeech":"n.","definition":{"en":"The entrance/opening of something (for example, a river, cave, or bottle).","zh":"（某物的）入口/口部（如河口、洞口、瓶口）。"},"examples":[{"en":"The river mouth is where the river meets the sea.","zh":"河口是河流汇入大海的地方。"},{"en":"Don’t touch the mouth of the bottle.","zh":"别碰瓶口。"}]},{"partOfSpeech":"v.","definition":{"en":"To speak words (often used with an idea like “mouth off,” meaning speak in a rude way).","zh":"说话；（常见于短语 mouth off）顶嘴/出言不逊。"},"examples":[{"en":"He mouthed an apology, but it didn’t feel sincere.","zh":"他口头道了歉，但感觉不真诚。"},{"en":"Don’t mouth off to your teacher.","zh":"别对老师顶嘴。"}]}],"synonyms":["oral opening","opening","entrance","speak"],"phonetic":"/maʊθ/","extraExplanation":["“mouth”既可以指身体部位的“嘴”，也常用来比喻“开口处/入口处”，比如“the mouth of a cave（洞口）”、“the mouth of a river（河口）”。这个用法在地理与日常物品描述中都很常见。","在口语里，关于“mouth”的固定搭配很多：例如“watch your mouth（注意你的言辞）”表示说话要小心、别说粗话；“by word of mouth（口口相传）”表示不是书面或网络传播，而是人传人。"]}
{"word":"mouthable","summary":{"en":"“Mouthable” means easy to say/pronounce (most common). Less commonly, it can mean able to be mouthed silently.","zh":"“Mouthable”最常见意思是“好念、好发音”。较少见时也可指“能用口型表达（不出声地说）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a word, name, or phrase) easy or pleasant to say clearly; pronounceable.","zh":"（指单词、姓名或短语）容易清楚说出口的；好念的。"},"examples":[{"en":"The brand wanted a short, mouthable name that people could remember.","zh":"这个品牌想要一个简短、好念、让人记得住的名字。"},{"en":"Some scientific terms aren’t very mouthable for beginners.","zh":"有些科学术语对初学者来说不太好念。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) able to be formed with the mouth—spoken softly without using the voice; mouthed.","zh":"（较少见）能用嘴形表达的；不出声地“用口型说”的。"},"examples":[{"en":"She gave a small smile and mouthable words of thanks from across the room.","zh":"她微微一笑，在房间那头用口型说了“谢谢”。"},{"en":"The actor practiced mouthable lines for the silent scene.","zh":"演员为那段无声场景练习了可以用口型表达的台词。"}]}],"synonyms":["pronounceable","easy to say","sayable","enunciable","speakable"],"phonetic":"/ˈmaʊθəbəl/","extraExplanation":["“mouthable”不是非常常见的标准词，更常见的表达是 **pronounceable**（好发音的）或 **easy to say**（好说的）。它多见于品牌命名、写作评论或口语化表达中。","词源上来自 **mouth**（嘴/用嘴说）+ **-able**（可以……的）。在英语里，用“-able”构成形容词通常表示“能够被……”。"]}
{"word":"mouthbreeder","summary":{"en":"An insulting slang noun meaning “a mouth-breather,” often implying someone is stupid or crude.","zh":"一个侮辱性的俚语名词，指“张口呼吸者”，常带有暗示对方愚蠢或粗鲁的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, insulting) A person who habitually breathes through their mouth; often used as a rude way to call someone stupid, uncultured, or unpleasant.","zh":"（俚语，侮辱性）指经常用嘴呼吸的人；也常被粗鲁地用来骂人“愚蠢、没教养或令人讨厌”。"},"examples":[{"en":"Some people online use “mouthbreeder” as an insult, but it’s disrespectful.","zh":"网上有些人把“mouthbreeder”当作骂人的话，但这很不尊重。"},{"en":"He apologized for calling her a mouthbreeder during the argument.","zh":"他为争吵时骂她“mouthbreeder”而道歉。"}]}],"synonyms":["mouth-breather","idiot (insult)","moron (insult)"],"phonetic":"ˈmaʊθˌbriːdər","extraExplanation":["这个词带有明显的贬低与羞辱色彩，现实交流中很容易冒犯他人，不建议使用。","字面意思是“用嘴呼吸的人”。在医学/健康语境里通常会说“mouth breathing（张口呼吸）”或“a mouth-breather（张口呼吸者）”，用更中性、描述性的表达更合适。"]}
{"word":"mouthbrooder","summary":{"en":"A mouthbrooder is an animal—especially a fish—that carries eggs or young in its mouth for protection.","zh":"mouthbrooder 指（尤指鱼类）把卵或幼体含在口中进行保护与孵育的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fish (or other animal) that carries and protects its eggs or young in its mouth until they are safer or ready to swim independently.","zh":"（鱼类或其他动物）把卵或幼体含在口中进行保护与孵育，直到更安全或能独立游动的“口孵者/口孵鱼”。"},"examples":[{"en":"Many cichlids are mouthbrooders that hide their eggs in the parent’s mouth.","zh":"许多慈鲷是口孵鱼，会把卵藏在亲鱼的口中保护。"},{"en":"The female mouthbrooder kept the fry in her mouth when danger approached.","zh":"危险靠近时，这条雌性口孵鱼会把鱼苗含在嘴里保护。"}]}],"synonyms":["oral brooder","mouth-brooding fish"],"phonetic":"/ˈmaʊθˌbruːdɚ/","extraExplanation":["“Mouthbrooder”是由 mouth（嘴）+ brood（孵育、照料幼雏）组合而成的生物学/水族领域词汇，常用于描述慈鲷（cichlids）、罗非鱼（tilapia）等鱼类的育幼方式。","口孵并不一定只由雌鱼进行：有些种类由雄鱼口孵，或由亲鱼轮流口孵。口孵期间亲鱼常会减少进食，这也是养殖或观赏饲养时需要注意的现象。"]}
{"word":"mouthe","summary":{"en":"“Mouthe” is usually a misspelling or archaic form of “mouth” (the mouth; or to speak/complain rudely).","zh":"“mouthe”通常是“mouth”的拼写错误或古拼写（名词：嘴/出口；动词：多嘴、顶嘴、抱怨式地说）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/likely misspelling) the opening in your face used for speaking, eating, and breathing; also the opening of something (like a river).","zh":"（非标准/多为拼写错误）嘴；也指“出口/开口”（如河口）。"},"examples":[{"en":"I think you meant “mouth,” not “mouthe.”","zh":"我想你想写的是“mouth”，不是“mouthe”。"},{"en":"Please close your mouth when you chew.","zh":"咀嚼时请把嘴闭上。"},{"en":"They built a bridge near the mouth of the river.","zh":"他们在河口附近建了一座桥。"}]},{"partOfSpeech":"v.","definition":{"en":"to speak (often too much or in a rude/complaining way).","zh":"说话（常含“多嘴/顶嘴/抱怨”之意）。"},"examples":[{"en":"He mouthed an apology but didn’t really mean it.","zh":"他嘴上道了歉，但并不真心。"},{"en":"Don’t mouth off to your teacher.","zh":"别对老师顶嘴。"}]}],"synonyms":["mouth","speak","complain","talk back"],"phonetic":"/maʊθ/","extraExplanation":["“mouthe”通常不是现代英语的标准拼写，多半是把“mouth”拼错了。历史文献里偶尔会出现“mouthe”作为古拼写，但在当代写作中应使用“mouth”。","动词 mouth 常见搭配：mouthing words（无声地动嘴说）、mouth off（粗鲁顶嘴/大声抱怨）、be all mouth（光说不做，偏口语）。"]}
{"word":"mouthed","summary":{"en":"“Mouthed” usually means “said with the lips” (often silently or without sincerity), and it also appears in -mouthed compounds describing someone’s speaking style.","zh":"“mouthed”通常表示“用嘴唇说/做口型”（常不出声或缺乏诚意）；也常见于以 -mouthed 结尾的复合词，用来描述说话风格。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of) mouth: to say words with the lips, often without sound or without real feeling; to form words silently so they can be read on the lips.","zh":"mouth 的过去式/过去分词：用嘴唇说出（常常不出声，或缺乏真情实感）；做出口型让人读唇语。"},"examples":[{"en":"She mouthed “thank you” across the room.","zh":"她隔着房间做口型说“谢谢你”。"},{"en":"He mouthed the apology, but it didn’t sound sincere.","zh":"他嘴上道歉了，但听起来并不真诚。"},{"en":"The actor mouthed the line while the music played.","zh":"音乐响起时，演员对着台词做口型。"}]},{"partOfSpeech":"adj.","definition":{"en":"In compounds ending in -mouthed: having a mouth or speaking style of a particular type (often describing how someone speaks).","zh":"用于以 -mouthed 结尾的复合词：表示“有……嘴/以……方式说话（常形容说话风格）”。"},"examples":[{"en":"He’s so loud-mouthed that everyone can hear his phone calls.","zh":"他讲话太大声了，大家都能听到他的电话内容。"},{"en":"She’s quick-mouthed and always has a sharp reply.","zh":"她嘴很快，总能迅速回怼。"}]}],"synonyms":["lip-synced","said (without meaning)","parroted","voiced"],"phonetic":"/maʊðd/","extraExplanation":["“mouthed”最常见是动词 mouth 的过去式/过去分词：可以指“做口型（不出声）”，也常带有“只是嘴上说说、缺乏诚意”的语气（例如 mouthed an apology）。","作为形容词时，多见于“形容词/副词 + -mouthed”的构词（如 loud-mouthed, big-mouthed, soft-mouthed），用来评价一个人的说话方式；语气常偏负面（如 big-mouthed=爱说大话/守不住秘密），但也可中性或描述性。"]}
{"word":"mouther","summary":{"en":"A mouther is someone who mouths words—often speaking in an empty or insincere way; in theater/film it can mean someone who only moves their lips (mouths lines).","zh":"mouther 指只会“动嘴”的人，常含空话或不真诚之意；在戏剧/影视中也可指只做口型的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who mouths words, often in an exaggerated or insincere way; someone who talks a lot without saying anything meaningful","zh":"说话夸张却空洞或不真诚的人；只会“动嘴皮子”的人"},"examples":[{"en":"He’s a mouther who makes big promises but never follows through.","zh":"他只会动嘴皮子，承诺很大却从不兑现。"},{"en":"The audience got tired of the politician’s smooth mouther talk.","zh":"观众厌倦了那位政客油嘴滑舌、空话连篇的说辞。"}]},{"partOfSpeech":"n.","definition":{"en":"(theater/film) an actor who mouths lines (moves the lips) instead of speaking loudly/clearly, or who silently mouths words to match recorded speech","zh":"（戏剧/影视）只动口型的人；用口型配合台词录音的人"},"examples":[{"en":"The director asked the mouther to speak more clearly for the live scene.","zh":"导演要求那位只动口型的演员在现场戏里把台词说清楚。"},{"en":"In the crowd scene, a few extras were mouthers to avoid messy audio.","zh":"在人群戏里，有些群演只做口型，以免收音混乱。"}]}],"synonyms":["windbag","big talker","blowhard","ranter"],"phonetic":"/ˈmaʊðɚ/","extraExplanation":["“mouther”来自动词 mouth（用嘴说/用口型说/夸张地说），加上表示“做某事的人”的后缀 -er。日常语境里常带贬义：强调说得多、做得少，或说得不真诚。"]}
{"word":"mouthers","summary":{"en":"“Mouthers” means people who only mouth words—either insincerely (all talk) or by moving their lips without speaking clearly.","zh":"“Mouthers”指只会“动嘴”的人：要么空谈不真做，要么只动口型、说得不清楚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who speak without sincerity or real understanding, often repeating words or slogans; people who “mouth” things.","zh":"只会空谈、缺乏真诚或真实理解的人；常指只会“说漂亮话/背口号”的人。"},"examples":[{"en":"Don’t listen to the mouthers—watch what people actually do.","zh":"别听那些空谈的人——要看别人实际做了什么。"},{"en":"The coach wanted action, not mouthers making excuses.","zh":"教练想要的是行动，而不是找借口的空谈者。"}]},{"partOfSpeech":"n.","definition":{"en":"People who form words with their lips silently or indistinctly, instead of speaking clearly.","zh":"（说话）只动嘴不清楚发声的人；（无声地）用口型说话的人。"},"examples":[{"en":"In the back row, a few mouthers followed the lyrics without singing out loud.","zh":"在最后一排，有几个人只对口型跟着歌词，却没出声唱。"},{"en":"The teacher asked the mouthers to read clearly so everyone could hear.","zh":"老师让那些只动嘴的人读清楚，让大家都听得见。"}]}],"synonyms":["empty talkers","lip-service givers","windbags","bluffers"],"phonetic":"/ˈmaʊðərz/","extraExplanation":["“mouthers”来自动词 mouth（用嘴说/用口型说）。在批评语境里，mouther 常带贬义，强调“只会说、不去做”，类似于 mouthing platitudes（空话、套话）。","相关表达：mouth off（顶嘴、口无遮拦地说），pay lip service（口头支持但不真做）。"]}
{"word":"mouthes","summary":{"en":"“Mouthes” is usually a nonstandard spelling; the standard form is “mouths,” meaning either the plural of “mouth” or the verb form “he/she mouths.”","zh":"“mouthes”通常是非标准拼写；标准形式是“mouths”，可以表示“嘴”的复数，或动词“mouth”的第三人称单数（他/她敷衍地说或做口型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mouth”: the opening in the face used for eating, drinking, and speaking.","zh":"“mouth”的复数：嘴；用于吃喝和说话的口部开口。"},"examples":[{"en":"The children opened their mouths wide at the dentist.","zh":"孩子们在牙医那里把嘴张得很大。"},{"en":"Cover your mouth when you cough.","zh":"咳嗽时要捂住嘴。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “mouth”: to say words without sincerity or real understanding; to move your lips as if speaking (often without sound).","zh":"“mouth”的第三人称单数：言不由衷地说（空谈、敷衍地说）；（常指无声地）动嘴唇像在说话。"},"examples":[{"en":"He mouths an apology, but he doesn’t seem sorry.","zh":"他口头道歉，但看起来并不真心。"},{"en":"She mouthed “thank you” from across the room.","zh":"她在房间另一头用口型说了句“谢谢”。"}]}],"synonyms":["say (without meaning)","parrot","lip-sync"],"phonetic":"/maʊðz/","extraExplanation":["“mouthes”在现代英语里通常被视为拼写错误；标准拼写是“mouths”。“mouthes”偶尔会在非常旧的文本或非标准拼写中出现。","发音上，“mouths”结尾的 -ths 通常读成 /ðz/（像“mouthez”），这是因为 /ð/ 后面加了复数或第三人称的 -s。"]}
{"word":"mouthful","summary":{"en":"Mouthful means either a big bite/swallow of food or drink, or something (like a name or title) that’s long and hard to say.","zh":"Mouthful 既指“一大口食物/饮料”，也指“（名字、称呼等）太长、拗口难念”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large amount of food or drink in the mouth at one time; one bite or swallow.","zh":"（一次）满满一口（食物或饮料）；一口/一吞。"},"examples":[{"en":"He took a mouthful of water and tried not to cough.","zh":"他喝了一大口水，尽量不咳嗽。"},{"en":"Don’t talk with your mouth full of a mouthful.","zh":"嘴里含着一口东西时别说话。"}]},{"partOfSpeech":"n.","definition":{"en":"Something long, difficult, or awkward to say or pronounce (often a name, title, or phrase).","zh":"（名字/称呼/短语等）拗口、难念的东西。"},"examples":[{"en":"That street name is a real mouthful.","zh":"那条街的名字真拗口。"},{"en":"Her full job title is such a mouthful that people shorten it.","zh":"她的完整职位名称太长太拗口了，所以大家会简称。"}]}],"synonyms":["bite","swallow","gulp","handful (figurative: a lot to deal with)","tongue-twister (similar idea: hard to say)"],"phonetic":"/ˈmaʊθ.fʊl/","extraExplanation":["“mouthful”既可指字面意义的“一大口”，也常用来形容语言上的“拗口/太长”。第二种用法带一点轻松吐槽的语气，常见于谈论人名、地名、头衔等。","相关表达：a mouthful of + 名词（“一大口……”）；a mouthful to say/pronounce（“说/念起来很拗口”）。"]}
{"word":"mouthfuls","summary":{"en":"“Mouthfuls” means multiple mouthfuls: several bites/sips, or (informally) several long or hard-to-say words/names.","zh":"“mouthfuls”指“mouthful”的复数：几口食物/饮料；也可（非正式）指几个很长、很难念的词或名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mouthful”: an amount of food or drink that you can hold in your mouth at one time.","zh":"“mouthful”的复数：一次能含在嘴里的食物或饮料的量。"},"examples":[{"en":"He took two mouthfuls of soup and then started talking.","zh":"他喝了两口汤，然后开始说话。"},{"en":"Take small mouthfuls so you don’t choke.","zh":"每次吃一小口，免得噎住。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A long, difficult, or awkward word, name, or phrase to say.","zh":"（非正式）很长、很难念或说起来拗口的词、名字或短语。"},"examples":[{"en":"Her full job title is a real mouthful.","zh":"她的完整职位名称真的很拗口。"},{"en":"Some scientific terms are mouthfuls for beginners.","zh":"有些科学术语对初学者来说很难念。"}]}],"synonyms":["bites","sips","a lot to say","tongue-twister"],"phonetic":"/ˈmaʊθˌfʊl/","extraExplanation":["“a mouthful”既可以指“满满一口（食物/饮料）”，也常用来形容“名字/短语太长、太难念”。复数 mouthfuls 用于两种意思都成立：two mouthfuls of water（两口水）；Those names are mouthfuls（那些名字太拗口）。"]}
{"word":"mouthier","summary":{"en":"“Mouthier” means more mouthy: more rude, annoying, or disrespectfully talkative.","zh":"“mouthier”是“mouthy”的比较级，表示更爱顶嘴、更口无遮拦（带无礼/惹人烦的含义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More talkative in an annoying or rude way; more likely to make disrespectful comments.","zh":"更爱顶嘴的；更口无遮拦/更嘴碎（常带无礼或惹人烦的感觉）。"},"examples":[{"en":"Since starting high school, he’s become mouthier with teachers.","zh":"自从上了高中，他对老师更爱顶嘴了。"},{"en":"The customer got mouthier after being told there was no refund.","zh":"被告知不能退款后，那位顾客说话更冲、更口无遮拦了。"}]}],"synonyms":["ruder","more disrespectful","more impertinent","more cheeky","more sassy"],"phonetic":"/ˈmaʊðiər/","extraExplanation":["“mouthier”是形容词“mouthy”的比较级（more mouthy）。口语里很常见，通常是负面评价，强调“嘴上不饶人、爱抬杠/顶撞”，不等同于单纯的“健谈”（talkative）。","在美式英语中，家长或老师可能用mouthy来批评孩子“顶嘴”。注意语气较重，正式场合可用“more disrespectful / more outspoken in a rude way”等更委婉表达。"]}
{"word":"mouthiest","summary":{"en":"“Mouthiest” means the most mouthy: talking back or speaking in a loud, rude, or overly bold way.","zh":"“Mouthiest”指“最mouthy的”：最爱顶嘴或说话很冲、很无礼/强势的人或表现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most likely to talk a lot in a loud, rude, or opinionated way; superlative of “mouthy.”","zh":"最爱顶嘴的；最嘴贫/最爱多嘴（“mouthy”的最高级，常含无礼、爱逞口舌之意）。"},"examples":[{"en":"Of all the kids in the class, Jake is the mouthiest when the teacher says “no.”","zh":"在班里所有孩子中，Jake 在老师说“不行”时最爱顶嘴。"},{"en":"The mouthiest commenters online often don’t know the full story.","zh":"网上最嘴贫的评论者往往并不了解全部情况。"}]}],"synonyms":["most outspoken","most rude-mouthed","most sassy","most loudmouthed","most impertinent"],"phonetic":"/ˈmaʊθiəst/","extraExplanation":["“mouthy”通常是贬义，强调“说话冲、爱抬杠、爱发表强硬意见”，不等同于“健谈”(talkative) 或“外向”(outgoing)。","构词上与 mouth（嘴）相关，口语里常用来形容孩子/青少年“顶嘴”，也可形容网友或公众人物“嘴很硬、很冲”。","近义词语感区分：sassy（俏皮但可能无礼），cheeky（英式更常见，带点冒犯但可可爱），loudmouthed（更强调声音大、爱嚷嚷）。"]}
{"word":"mouthily","summary":{"en":"“Mouthily” means speaking loudly and often rudely or too boldly.","zh":"“mouthily”表示说话很大声、很爱说，且常带粗鲁或冒失的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a loud, talkative, and sometimes rude or pushy way (often sounding like someone is speaking too much or too boldly).","zh":"以大声、健谈、甚至有点粗鲁或冒失的方式（常给人“话太多/太冲”的感觉）。"},"examples":[{"en":"He answered mouthily, as if he wanted everyone to hear his opinion.","zh":"他大声又爱出风头地回答，好像想让所有人都听到他的观点。"},{"en":"The customer complained mouthily, interrupting the staff again and again.","zh":"那位顾客吵吵嚷嚷地抱怨，一次又一次打断工作人员。"}]}],"synonyms":["loudly","brashly","rudely","impudently","boisterously"],"phonetic":"/ˈmaʊθɪli/","extraExplanation":["“mouthily”来自形容词“mouthy”（多嘴的、顶嘴的、嘴很硬的），再加副词后缀“-ly”。语气通常带负面评价，暗示说话方式让人不舒服（太大声、太爱争、太放肆）。","用法上更常见的是“mouthy”（adj.）来形容人：a mouthy kid（爱顶嘴的孩子）。副词“mouthily”相对少见，多出现在叙述性写作里，用来描写说话的态度和声音。"]}
{"word":"mouthiness","summary":{"en":"Mouthiness means rude, overly bold talk or talking back too much.","zh":"Mouthiness 指说话过于冲、无礼或爱顶嘴的表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of talking too much in a loud, rude, or overly confident way; being “mouthy”","zh":"（说话）太多、太冲或带有无礼/顶嘴意味的特点；嘴欠、嘴硬"},"examples":[{"en":"The teacher warned him that his mouthiness in class was disrespectful.","zh":"老师警告他说，他在课堂上的顶嘴很不尊重人。"},{"en":"Her mouthiness sometimes sounds confident, but it can also hurt people.","zh":"她的嘴硬有时听起来很自信，但也可能伤到别人。"},{"en":"He apologized for his mouthiness after the argument.","zh":"争吵之后，他为自己的口无遮拦道了歉。"}]}],"synonyms":["impudence","sassiness","cheekiness","backtalk","rudeness"],"phonetic":"/ˈmaʊθinəs/","extraExplanation":["“mouthiness”来自形容词“mouthy”（爱顶嘴的、嘴巴很冲的），加名词后缀“-ness”。语气通常偏负面，常用来形容孩子/青少年对大人顶嘴，或某人在公共场合说话太冲、太放肆。","和“talkativeness”（健谈、话多但中性/偏正面）不同，“mouthiness”更强调态度不礼貌、冒犯或过度自信。"]}
{"word":"mouthing","summary":{"en":"Mouthing is either silently shaping words with your lips, or (more critically) empty/insincere talk; it can also mean babies exploring objects by putting them in their mouths.","zh":"Mouthing 指无声地做口型，也可（带批评）指空话/虚伪的说辞；在育儿语境中还可指婴儿把物品放入口中探索。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of forming words with your lips (often without making sound), so others can read what you mean","zh":"用嘴唇做出口型（常常不发声），让别人从口型看懂你的意思"},"examples":[{"en":"She was mouthing the lyrics while the band played.","zh":"乐队演奏时，她在无声地对着口型唱歌词。"},{"en":"Stop mouthing “help” and speak up if you can.","zh":"别再对着口型说“救命”了，如果可以就大声说出来。"}]},{"partOfSpeech":"n.","definition":{"en":"speech or words that sound insincere, exaggerated, or empty; mere rhetoric","zh":"空话；言不由衷或夸张的说辞；空洞的口号"},"examples":[{"en":"People are tired of political mouthing and want real action.","zh":"人们厌倦了政治上的空话，更想要真正的行动。"},{"en":"His apology felt like mouthing, not genuine regret.","zh":"他的道歉听起来像是敷衍的空话，而不是真心后悔。"}]},{"partOfSpeech":"n.","definition":{"en":"the action of putting something in the mouth or exploring objects with the mouth (common in babies)","zh":"把东西放进嘴里或用嘴探索物体（婴儿常见行为）"},"examples":[{"en":"Mouthing is normal for babies as they learn about textures.","zh":"婴儿用嘴探索是正常的，这是他们了解不同触感的方式。"},{"en":"Give her safe toys designed for mouthing.","zh":"给她一些适合入口、用于啃咬探索的安全玩具。"}]}],"synonyms":["lip-syncing","silent articulation","empty rhetoric","platitudes","exploring by mouth"],"phonetic":"/ˈmaʊðɪŋ/","extraExplanation":["“mouthing”来自动词 mouth（用嘴说/做口型）。在日常英语里，最常见的是“mouth the words/lyrics”（对口型、无声地说）。","表示“空话”时，语气通常带批评，强调说得好听但缺乏真诚或行动；常见搭配有 political mouthing（政治空话）。","注意区分：mouth off（顶嘴、口无遮拦地抱怨）是更口语、更带冲突的说法，不等同于 mouthing。"]}
{"word":"mouthingly","summary":{"en":"“Mouthingly” means speaking by forming words with your lips without sound.","zh":"“mouthingly”指用嘴唇无声地说话或对口型。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that forms words with the lips without making a sound; silently, by mouthing.","zh":"以“动嘴不出声”的方式；用嘴唇无声地拼出词语（默念、对口型）。"},"examples":[{"en":"She answered mouthingly, so only the people close to her could understand.","zh":"她用嘴唇无声地回答，只有靠近她的人才看得懂。"},{"en":"He kept repeating the line mouthingly while the actor on stage spoke it aloud.","zh":"台上的演员大声说台词时，他在台下无声地反复对口型练习。"}]}],"synonyms":["silently","soundlessly","by mouthing the words","inaudibly"],"phonetic":"ˈmaʊðɪŋli","extraExplanation":["“mouthingly”比较少见，更常见的表达是：“silently / under one’s breath / by mouthing the words”。\n\n注意区分：\n- mouth (v.) = 用嘴唇做出说话的动作（可不出声）\n- mouth off (phrase) = 说大话、顶嘴（带贬义，和“mouthingly”无关）"]}
{"word":"mouthishly","summary":{"en":"Mouthily means speaking in a loud, boastful/annoying way, or speaking while chewing (with a full mouth).","zh":"mouthily 指说话夸夸其谈/聒噪地，或指含着食物边嚼边说话（不礼貌）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a loud, boastful, or annoyingly talkative way; speaking with too many strong opinions and not much thought.","zh":"（说话）大声、夸夸其谈或聒噪地；常指言之无物却气势很足。"},"examples":[{"en":"He mouthily criticized the plan, but he offered no better idea.","zh":"他大声又夸夸其谈地批评这个计划，但并没提出更好的主意。"},{"en":"The new commentator spoke mouthily about things he barely understood.","zh":"那位新评论员对自己几乎不懂的事情也说得煞有介事、口气很大。"}]},{"partOfSpeech":"adv.","definition":{"en":"While chewing or with a full mouth; speaking in a way that is impolite because you are eating.","zh":"（说话）嘴里含着食物地；边嚼边说，显得不礼貌。"},"examples":[{"en":"Please don’t talk mouthily at the table.","zh":"吃饭时请别含着食物说话。"},{"en":"She answered mouthily, and everyone looked away in embarrassment.","zh":"她嘴里含着食物就回答了，大家尴尬地移开视线。"}]}],"synonyms":["loudly","boastfully","brashly","talkatively","with a full mouth"],"phonetic":"/ˈmaʊθəli/","extraExplanation":["你输入的 **mouthishly** 很可能是拼写错误或极少见的造词。英语里更常见的是 **mouthily**（副词），来自形容词 **mouthy**（口无遮拦的、夸夸其谈的）。","如果你本来想表达“像嘴一样的/口部的（mouthish）”，英语通常不会用 *mouthishly*，而会改用更自然的表达，比如 **in a mouthy way**（用很嘴碎/很冲的方式）或直接用 **mouthily**。"]}
{"word":"mouthless","summary":{"en":"Mouthless means “having no mouth,” and it can also describe someone who is silent or unable to speak (figuratively).","zh":"mouthless 指“没有嘴的”，也可比喻“说不出话/沉默的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no mouth; lacking an opening used for eating or speaking.","zh":"没有嘴的；无口的（缺少用于进食或说话的开口）。"},"examples":[{"en":"The artist drew a mouthless face to make it look eerie.","zh":"画家画了一张没有嘴的脸，让它看起来很诡异。"},{"en":"Some insects are mouthless in their adult stage and live only long enough to reproduce.","zh":"有些昆虫在成虫阶段没有口器，只活到完成繁殖为止。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Unable or unwilling to speak; silent, as if one had no mouth.","zh":"（比喻）说不出话的；不愿开口的；沉默得像没有嘴一样。"},"examples":[{"en":"He stood mouthless with shock, unable to answer.","zh":"他震惊得说不出话来，无法回答。"},{"en":"In the meeting, she felt mouthless, afraid to disagree.","zh":"在会议上，她感觉不敢开口，害怕提出不同意见。"}]}],"synonyms":["speechless","silent","mute","voiceless","wordless"],"phonetic":"/ˈmaʊθləs/","extraExplanation":["“mouthless”= mouth（嘴）+ -less（没有……的）。英语里“-less”很常见，用来表示缺少某物：如 homeless（无家可归的）、careless（粗心的）、speechless（说不出话的）。","“mouthless”在日常口语里不算常用，更常见于文学描写、恐怖/奇幻题材或艺术评论，用来营造不安、压抑或被剥夺表达的感觉。"]}
{"word":"mouthlike","summary":{"en":"“Mouthlike” means “resembling a mouth; mouth-shaped.”","zh":"“mouthlike”表示“像嘴一样的；口状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a mouth in shape or appearance; mouth-shaped.","zh":"像嘴一样的；口状的（外形或外观像嘴）。"},"examples":[{"en":"The cave had a dark, mouthlike opening in the cliff.","zh":"悬崖上那个洞穴有一个黑暗的、口状的入口。"},{"en":"She described the plant’s mouthlike petals as if they were trying to speak.","zh":"她形容那株植物的花瓣像嘴一样，仿佛想要说话。"}]}],"synonyms":["mouth-shaped","gaping","lip-like"],"phonetic":"/ˈmaʊθˌlaɪk/","extraExplanation":["“mouthlike”由 mouth（嘴）+ -like（像……一样的）构成。英语里“-like”常用来把名词变成形容词，表示“具有……特征/外形”，例如 childlike（孩子般的）、lifelike（逼真的）、snake-like（蛇一样的）。","“mouthlike”不是日常高频词，更常见的表达是 mouth-shaped（口状的）或 like a mouth（像一张嘴）。在文学描写或视觉艺术评论中，用“mouthlike”能带来更强的画面感与拟人效果。"]}
{"word":"mouthpart","summary":{"en":"A mouthpart is a feeding structure around the mouth, especially in insects.","zh":"mouthpart 指围绕口部的取食结构，尤指昆虫的口器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Any of the external structures around an animal’s mouth that are used for feeding, such as biting, chewing, sucking, or lapping (especially in insects).","zh":"口器；围绕动物口部、用于取食的外部结构（尤指昆虫，如咬、嚼、刺吸、舔食等）。"},"examples":[{"en":"Mosquito mouthparts are adapted for piercing skin and sucking blood.","zh":"蚊子的口器适合刺破皮肤并吸血。"},{"en":"Different insects have different mouthparts depending on what they eat.","zh":"不同昆虫因食物不同而有不同的口器。"}]}],"synonyms":["oral appendage","feeding appendage"],"phonetic":"/ˈmaʊθˌpɑrt/","extraExplanation":["在生物学里，mouthpart 常用来讲昆虫的“口器类型”，例如 chewing mouthparts（咀嚼式口器）、piercing-sucking mouthparts（刺吸式口器）、sponging/lapping mouthparts（舐吸/舔食式口器）。这些结构和取食方式密切相关，是昆虫分类与生态研究中很常见的术语。","词形上是 mouth + part（口 + 部位），常写作复数 mouthparts 来强调由多个部件组成。"]}
{"word":"mouthparts","summary":{"en":"Mouthparts are the feeding structures of an animal’s mouth, especially the specialized parts insects use to eat.","zh":"mouthparts 指动物口部用于取食的各个结构，尤指昆虫的专门口器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The parts of an animal’s mouth, especially an insect’s structures used for feeding (such as mandibles, maxillae, a proboscis, etc.).","zh":"（动物的）口器；（尤指昆虫的）口部结构，用于取食（如大颚、小颚、喙/吸管等）。"},"examples":[{"en":"Different insects have different mouthparts depending on what they eat.","zh":"不同昆虫会因食物来源不同而有不同的口器。"},{"en":"Butterflies use their mouthparts to sip nectar from flowers.","zh":"蝴蝶用口器从花朵中吸食花蜜。"},{"en":"The diagram labels the mosquito’s mouthparts in detail.","zh":"这张图详细标注了蚊子的口器结构。"}]}],"synonyms":["oral structures","feeding structures","insect mouthparts"],"phonetic":"/ˈmaʊθˌpɑrts/","extraExplanation":["“mouthparts”通常作为复数名词使用，常见于生物学/昆虫学语境。它强调“口的各个组成结构”，而不是“嘴巴”整体。","昆虫口器常按取食方式来描述：如“chewing mouthparts（咀嚼式口器）”常见于甲虫；“piercing-sucking mouthparts（刺吸式口器）”常见于蚊子；“sponging mouthparts（舐吸式口器）”常见于苍蝇；“siphoning mouthparts（虹吸式口器）”常见于蝴蝶。"]}
{"word":"mouthpiece","summary":{"en":"A mouthpiece is (1) the part of an instrument or device you put your mouth on, or (2) a person who speaks for an organization, often as its “voice.”","zh":"mouthpiece 指（1）乐器或装置的吹口/咬嘴等口部部件；也指（2）替某个组织发声的“代言人/传声筒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of a musical instrument (or similar device) that you put your mouth on to play or blow through.","zh":"（乐器或类似装置的）吹口；含在嘴里用来吹奏/吹气的部件。"},"examples":[{"en":"She cleaned the clarinet mouthpiece before rehearsal.","zh":"排练前她把单簧管的吹口清洁了一遍。"},{"en":"This trumpet mouthpiece feels more comfortable on my lips.","zh":"这个小号吹口贴在嘴唇上更舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who speaks for someone else or for an organization, often repeating the official message rather than their own opinions.","zh":"代言人；传声筒（通常指代表某人或组织发声，转述官方立场而非个人观点）。"},"examples":[{"en":"The spokesperson was seen as the company’s mouthpiece during the scandal.","zh":"丑闻期间，那位发言人被视为公司的传声筒。"},{"en":"He was accused of being a mouthpiece for the government.","zh":"他被指责是政府的传声筒。"}]},{"partOfSpeech":"n.","definition":{"en":"A part of equipment you put in your mouth to breathe, speak, or deliver something (for example, a telephone mouthpiece, a scuba regulator, or a whistle).","zh":"（设备的）口部装置（如电话送话器、潜水呼吸器咬嘴、哨子等）。"},"examples":[{"en":"The diver bit down on the mouthpiece and checked the air flow.","zh":"潜水员咬住咬嘴并检查气流。"},{"en":"In old telephones, you spoke into the mouthpiece.","zh":"在老式电话里，你对着送话器说话。"}]}],"synonyms":["spokesperson","representative","proxy","embouchure","nozzle"],"phonetic":"/ˈmaʊθˌpiːs/","extraExplanation":["“mouthpiece”用作“传声筒/代言人”时，语气常偏负面，暗示这个人缺乏独立观点、只是替别人讲话。正式场合更中性常用spokesperson或representative。"]}
{"word":"mouthpieces","summary":{"en":"Mouthpieces are (1) parts you blow into on wind instruments, (2) mouth-end parts of devices, or (3) people who speak for others (often with a negative tone).","zh":"mouthpieces 可以指（1）管乐器的吹嘴，（2）设备上的口部接口/咬嘴，（3）替他人发声的“代言人/传声筒”（常含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of a musical instrument (especially a wind instrument) that you blow into to make sound.","zh":"（尤指管乐器的）吹嘴；含在嘴里吹气发声的部件。"},"examples":[{"en":"The clarinet’s mouthpiece needs to be cleaned regularly.","zh":"单簧管的吹嘴需要定期清洁。"},{"en":"Different mouthpieces can change the tone of a trumpet.","zh":"不同的吹嘴会改变小号的音色。"}]},{"partOfSpeech":"n.","definition":{"en":"A part you put in or on your mouth for a specific purpose (for example, on a bottle, a vape device, or protective/medical equipment).","zh":"（用于特定用途的）咬嘴/吸嘴/口部接口（如水壶、电子烟、医疗或防护设备上的口部部件）。"},"examples":[{"en":"Replace the mouthpiece if it becomes cracked.","zh":"如果咬嘴裂了，就更换一个。"},{"en":"Make sure the mouthpieces are sanitized between uses.","zh":"确保每次使用之间都把口部接口消毒。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who speaks for another person, group, company, or government (often implying they repeat the official line rather than their own views).","zh":"（常带贬义）代言人；传声筒（暗示只是重复官方/上级说法）。"},"examples":[{"en":"Critics accused the host of being a mouthpiece for the party.","zh":"批评者指责这位主持人成了该政党的传声筒。"},{"en":"She refused to act as a mouthpiece for the corporation.","zh":"她拒绝充当那家公司的传声筒。"}]}],"synonyms":["spokesperson","representative","spokesman","spokeswoman","instrument mouthpiece","nozzle"],"phonetic":"/ˈmaʊθˌpiːs/","extraExplanation":["“mouthpiece”作“传声筒/代言人”时，语气往往偏负面，强调“替别人说话、缺乏独立立场”。如果想更中性，可以用 spokesperson（发言人）、representative（代表）等。"]}
{"word":"mouthpipe","summary":{"en":"A mouthpipe is a tube you breathe or blow into, especially in snorkeling/diving gear or in bagpipes.","zh":"mouthpipe 指用嘴呼吸或吹气的管子，常见于浮潜/潜水装备的呼吸管或风笛的吹管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tube you breathe or blow into, especially the breathing tube of a snorkel or diving equipment","zh":"（尤指浮潜或潜水装备的）呼吸管、吹气管"},"examples":[{"en":"He cleared the water from his mouthpipe before diving again.","zh":"他把呼吸管里的水清干净后又潜了下去。"},{"en":"Make sure the mouthpipe is firmly attached to the mask.","zh":"确保呼吸管牢固地连接在面罩上。"}]},{"partOfSpeech":"n.","definition":{"en":"the blowpipe of bagpipes (the part you blow air into)","zh":"（风笛的）吹管（向风袋吹气的管子）"},"examples":[{"en":"She fitted a new mouthpipe on her bagpipes.","zh":"她给风笛装上了一根新的吹管。"},{"en":"Moisture can build up inside the mouthpipe after long practice.","zh":"长时间练习后，吹管里可能会积聚水汽。"}]}],"synonyms":["snorkel (tube)","breathing tube","blowpipe (bagpipes)"],"phonetic":"/ˈmaʊθpaɪp/","extraExplanation":["“mouthpipe”并不是日常高频词，更常见的对应表达包括：浮潜用的 “snorkel” 或 “snorkel tube”，呼吸器的 “breathing tube”。在风笛语境中也常见 “blowpipe”。","构词上是 mouth + pipe（嘴 + 管子），所以含义通常就是“用嘴吹/吸气的管”。"]}
{"word":"mouthroot","summary":{"en":"“Mouthroot” is a rare/nonstandard term meaning the base/back or floor area of the mouth.","zh":"“mouthroot”是罕见/非标准词，一般指口腔的根部（口底或口腔后部区域）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) The base or “root” area of the mouth; the part where the mouth connects inward (often referring to the floor/back of the mouth).","zh":"（罕见／非标准用法）指“口腔的根部／基部”；也就是口腔向内连接的底部或后部区域（常可理解为口底或口腔后方）。"},"examples":[{"en":"The dentist examined the tissues near the mouthroot for swelling.","zh":"牙医检查了靠近“口腔根部”的组织是否肿胀。"},{"en":"Pain at the mouthroot can sometimes be confused with a sore throat.","zh":"口腔根部的疼痛有时会被误认为是喉咙痛。"}]}],"synonyms":["floor of the mouth","back of the mouth","base of the mouth"],"phonetic":"ˈmaʊθˌruːt","extraExplanation":["“mouthroot”并不是常见或标准的英语词；在医学/解剖学语境里，更自然的说法通常是 **the floor of the mouth（口底）**、**the back of the mouth（口腔后部）**、或更具体的结构名称（如 tongue base 舌根等）。","如果你是在读某个专业文本/游戏设定/自造词场景里看到它，建议提供一句原文，我可以根据上下文给出更准确的对应翻译与理解。"]}
{"word":"mouths","summary":{"en":"“Mouths” is usually the plural of “mouth,” and it can also mean “people to feed.” As a verb, “mouths” means to form words with the lips (often silently) or to say something without real feeling.","zh":"“mouths”通常是“mouth（嘴）”的复数，也可指“需要供养的人口”。作动词时，“mouths”表示用口型说（常常不出声）或不真诚地口头说。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “mouth”: the opening in the face used for eating, drinking, and speaking.","zh":"“mouth”的复数：嘴；口腔（用来吃、喝和说话的开口）。"},"examples":[{"en":"Open your mouths—no, sorry: open your mouths—so I can check your throat.","zh":"把嘴张开——抱歉，是“张开你们的嘴（mouths）”——我来检查喉咙。"},{"en":"The babies had sticky mouths after eating fruit.","zh":"宝宝们吃完水果后嘴边黏黏的。"}]},{"partOfSpeech":"n.","definition":{"en":"People who must be fed or supported (often in the phrase “mouths to feed”).","zh":"需要供养的人口（常用于短语“mouths to feed”）。"},"examples":[{"en":"She took a second job because there were more mouths to feed at home.","zh":"因为家里要养的人更多了，她又找了一份兼职。"},{"en":"In hard times, a family may struggle when there are many mouths to feed.","zh":"在困难时期，家里要养的人多就更容易吃紧。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “mouth”: to form words with your lips, often without sound; to say something without sincerity.","zh":"“mouth”的第三人称单数：用口型说（常常不出声）；（不真诚地）口头说、敷衍地说。"},"examples":[{"en":"He mouths the words to the song but doesn’t sing out loud.","zh":"他跟着歌只做口型，并没有大声唱。"},{"en":"Don’t just mouth an apology—fix what you did.","zh":"别只会口头道歉——把你做的事补救好。"}]}],"synonyms":["openings","orifices","dependents","people to support","lip","mime","mutter"],"phonetic":"/maʊθs/","extraExplanation":["注意发音差异：名词 mouth /maʊθ/，复数 mouths 常读 /maʊθs/；动词 mouth 常读 /maʊð/（词尾变成浊音），所以第三人称单数 mouths 常读 /maʊðz/。","常见搭配 mouths to feed 指“要养活的人”，在新闻、经济或家庭语境里很常见。"]}
{"word":"mouthwash","summary":{"en":"Mouthwash is a liquid used to rinse the mouth for cleanliness and fresher breath; it can also be used as a verb meaning “to rinse with mouthwash.”","zh":"Mouthwash指“漱口水”，用于含漱清洁口腔、减少口臭；也可作动词，表示“用漱口水漱口”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A liquid you rinse around your mouth to reduce bad breath and help keep your mouth clean; sometimes it contains antiseptics or fluoride.","zh":"漱口水：用来在口腔内含漱的液体，帮助减少口臭并清洁口腔；有些含有杀菌成分或氟化物。"},"examples":[{"en":"I use mouthwash after brushing my teeth at night.","zh":"我晚上刷完牙后会用漱口水。"},{"en":"This mouthwash has fluoride to help protect against cavities.","zh":"这款漱口水含氟，有助于预防蛀牙。"},{"en":"If the mouthwash stings too much, try an alcohol-free one.","zh":"如果漱口水太刺痛，可以试试无酒精的。"}]},{"partOfSpeech":"v.","definition":{"en":"To rinse the mouth with mouthwash.","zh":"用漱口水漱口。"},"examples":[{"en":"After lunch, I mouthwash to freshen my breath.","zh":"午饭后我会用漱口水漱口，让口气更清新。"},{"en":"He brushed, flossed, and mouthwashed before the dentist appointment.","zh":"看牙医前，他刷牙、用牙线清洁，还用漱口水漱口。"}]}],"synonyms":["mouth rinse","oral rinse"],"phonetic":"/ˈmaʊθwɑʃ/","extraExplanation":["在日常英语里，mouthwash最常见是名词。动词用法也能听到，但比起更自然的说法“use mouthwash / rinse with mouthwash”，动词mouthwash略口语、也不那么常见。","注意区分：mouthwash通常用于口腔清洁与清新口气，但不能替代刷牙和使用牙线；含酒精的漱口水可能会刺激口腔，敏感人群常选择“alcohol-free mouthwash（无酒精漱口水）”。"]}
{"word":"mouthwashes","summary":{"en":"“Mouthwashes” usually means multiple kinds/bottles of mouthwash (oral rinse). It can also be the verb form meaning “rinses with mouthwash.”","zh":"“Mouthwashes” 通常指“多种/多瓶漱口水”，也可作动词第三人称单数，表示“用漱口水漱口”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of mouthwash: a liquid used to rinse your mouth to reduce bad breath, help clean the mouth, or protect teeth and gums.","zh":"mouthwash 的复数：漱口水；用于漱口的液体，可减轻口臭、清洁口腔或保护牙齿与牙龈。"},"examples":[{"en":"Some mouthwashes contain alcohol, and some are alcohol-free.","zh":"有些漱口水含酒精，也有不含酒精的。"},{"en":"The dentist recommended mouthwashes with fluoride for extra protection.","zh":"牙医建议使用含氟的漱口水来加强保护。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of mouthwash (verb): to rinse the mouth with mouthwash.","zh":"mouthwash（动词）的第三人称单数：用漱口水漱口。"},"examples":[{"en":"He mouthwashes every night before bed.","zh":"他每天晚上睡前都会用漱口水漱口。"}]}],"synonyms":["oral rinse","mouth rinse"],"phonetic":"/ˈmaʊθˌwɑʃ/","extraExplanation":["在日常英语里，更常用的动词表达是 “use mouthwash” 或 “rinse with mouthwash”。“mouthwash” 作动词能用，但相对少见。","“mouthwash” 既可作不可数名词（I use mouthwash. 我用漱口水），也可作可数名词指不同品牌/种类（Different mouthwashes… 不同的漱口水）。"]}
{"word":"mouthwatering","summary":{"en":"Mouthwatering describes food that looks or smells so delicious it makes you want to eat it right away.","zh":"mouthwatering 用来形容食物看起来或闻起来非常美味，令人垂涎、忍不住想马上吃。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely tasty-looking or delicious, often making you want to eat immediately.","zh":"（食物）令人垂涎的；看起来或闻起来非常好吃的，让人立刻想吃。"},"examples":[{"en":"The bakery window was full of mouthwatering cakes and fresh bread.","zh":"面包店橱窗里摆满了令人垂涎的蛋糕和新鲜面包。"},{"en":"She made a mouthwatering chicken soup that warmed everyone up.","zh":"她做的鸡汤鲜香诱人，让大家都暖和起来。"},{"en":"The ad showed a mouthwatering burger with melted cheese.","zh":"广告里展示了一个奶酪融化的诱人汉堡。"}]}],"synonyms":["delicious-looking","appetizing","tempting","scrumptious","delectable"],"phonetic":"/ˈmaʊθˌwɔtərɪŋ/","extraExplanation":["这个词由 mouth（嘴）+ watering（流口水的）组成，形象地表达“看到/闻到美食会流口水”。常用于食物描写、菜单、广告、餐厅评论等语境。","语体上比较口语且生动，也常用来写作中营造“美食诱惑”的画面感。"]}
{"word":"mouthwise","summary":{"en":"Mouthwise can mean “rude/impudent in speech” or “by mouth; orally,” depending on context.","zh":"mouthwise 可指“说话顶嘴、嘴硬”，也可指“经口的/口服的”，具体看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Impudent; talking back or speaking in a rude, cheeky way (similar to “mouthy”).","zh":"（非正式）顶嘴的；嘴硬的；说话没礼貌、爱冒犯人的（类似 mouthy）。"},"examples":[{"en":"Don’t get mouthwise with your teacher.","zh":"别跟老师顶嘴。"},{"en":"He got mouthwise when he was told to clean his room.","zh":"有人叫他打扫房间时，他就开始嘴硬、顶嘴。"}]},{"partOfSpeech":"adv.","definition":{"en":"(medical or everyday use) By mouth; orally (used to describe taking medicine, eating, or feeding).","zh":"（医学或日常用法）经口的；口服的；通过嘴进行的（常用于用药、进食、喂食）。"},"examples":[{"en":"Take this medicine mouthwise, not by injection.","zh":"这个药要口服，不是注射。"},{"en":"The patient can’t take food mouthwise yet.","zh":"病人目前还不能经口进食。"}]}],"synonyms":["mouthy","cheeky","impudent","orally","by mouth"],"phonetic":"/ˈmaʊθˌwaɪz/","extraExplanation":["“-wise” 是英语里表示“在……方面 / 以……方式”的后缀（如 clockwise, otherwise）。mouthwise 里的 mouth + wise 字面意思是“在嘴（说话/进食）方面”。日常口语里更常用 mouthy 表示“爱顶嘴的”。"]}
{"word":"mouthy","summary":{"en":"Mouthy usually means ‘rude and too talkative,’ often criticizing someone for talking back or speaking disrespectfully.","zh":"mouthy 通常指“话多还不礼貌、爱顶嘴”，多用于批评某人说话放肆或不尊重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"talking a lot in a rude, bold, or disrespectful way (often said as a criticism).","zh":"（贬义）嘴碎、话多又顶撞；说话放肆、不礼貌。"},"examples":[{"en":"The teacher asked him to stop being mouthy in class.","zh":"老师让他别在课堂上那么嘴硬顶嘴。"},{"en":"She can be a bit mouthy when she’s angry.","zh":"她生气的时候会有点口无遮拦。"},{"en":"Don’t get mouthy with the cashier—just explain the problem calmly.","zh":"别对收银员出言不逊——冷静说明问题就好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) liking to talk a lot; very talkative.","zh":"（非正式）很爱说话、特别健谈（有时带轻微负面）。"},"examples":[{"en":"He’s friendly but pretty mouthy at parties.","zh":"他人很友好，但在聚会上挺爱说个不停的。"},{"en":"The new coworker is mouthy, so meetings take longer.","zh":"新同事很健谈，所以会议时间被拉长了。"}]}],"synonyms":["rude","disrespectful","impudent","sassy","cheeky","talkative"],"phonetic":"/ˈmaʊθi/","extraExplanation":["“mouthy”常用于口语，语气多为负面，强调“顶嘴/没礼貌的多话”，比“talkative（健谈）”更带刺。描述孩子或青少年时很常见。","搭配：get mouthy（开始顶嘴/态度变冲）；mouthy kid/teen（爱顶嘴的孩子/青少年）。相近词：cheeky（英式，更偏“没大没小/调皮顶嘴”）、sassy（更偏“有态度/嘴甜但冲”，有时可中性或褒义）。"]}
{"word":"moutler","summary":{"en":"Moulter (often misspelled as “moutler”) means an animal that is molting—shedding old feathers/hair/skin and growing new ones.","zh":"Moulter（常被误写成“moutler”）指正在换羽/换毛/蜕皮的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an animal (especially a bird) that is molting—losing old feathers, hair, or skin and growing new ones","zh":"正在换羽/换毛/蜕皮的动物（尤指鸟类）"},"examples":[{"en":"The rescue center separated the moulters from the healthy adult birds.","zh":"救助中心把正在换羽的鸟和健康的成鸟分开。"},{"en":"A moulter may look scruffy for a few weeks, but new feathers will grow in.","zh":"正在换羽的鸟可能会有几周看起来很狼狈，但新羽毛会长出来。"}]}],"synonyms":["molter","molting animal"],"phonetic":"/ˈmoʊltər/","extraExplanation":["“moutler”在英语中不常见；更常见的拼写是“moulter”（英式拼写，源自动词 moult），美式英语里更常见写作“molter”（源自 molt）。","相关基础动词：moult/molt（换羽、蜕皮）。学习时可以把 -er 理解为“做……的人/物”，所以 moulter/molter = “会换羽/蜕皮的个体”。"]}
{"word":"moutlers","summary":{"en":"“Moutlers” is likely a misspelling of “molters/moulters”: those that are molting (shedding feathers, fur, skin, or an outer layer).","zh":"“moutlers”很可能是“molters/moulters”的误拼：指正在换毛、蜕羽、脱皮或脱落外层的个体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) animals or people that are molting—shedding feathers, fur, skin, or an outer layer.","zh":"（复数）正在“换毛/蜕皮/脱落外层”的动物或个体；正在蜕羽、脱皮、换毛者。"},"examples":[{"en":"In late summer, many ducks are molters and can’t fly well for a short time.","zh":"夏末时，很多鸭子在蜕羽期（是molters），短时间内飞行能力会变差。"},{"en":"The aquarium keeps molters in a quiet tank to reduce stress.","zh":"水族馆把正在蜕壳的个体（molters）放在安静的水槽里，以减轻压力。"}]}],"synonyms":["shedders","molting animals"],"phonetic":"/ˈmoʊltərz/","extraExplanation":["“moutlers”在现代英语里不常见，最可能是拼写误差，想写的是 **molters**（美式）或 **moulters**（英式），都来自动词 **molt/moult**（换毛、蜕皮）。","拼写小提示：美式常用 **molt**，英式常用 **moult**。如果你是在生物/养宠语境里看到这个词，多半指“正在蜕皮/换毛的个体”。"]}
{"word":"mouton","summary":{"en":"Mouton is a French-derived word used in English to mean “sheep,” and more commonly in fashion to mean a sheepskin fabric/lining (often with clipped wool).","zh":"mouton 源自法语，在英语中可指“羊”，更常见的是时尚语境里指“羊皮毛料/内衬”（常为剪绒羊皮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sheep (a French word sometimes used in English, especially in culinary or literary contexts).","zh":"羊（法语词，有时在英语中借用，常见于饮食或文学语境）。"},"examples":[{"en":"For the main course, they served roast mouton with herbs.","zh":"主菜他们端上了香草烤羊肉。"},{"en":"The menu lists mouton, which simply means “sheep.”","zh":"菜单上写着 mouton，其实就是“羊”的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of sheepskin (often with the wool clipped short) used as a fabric or coat lining in fashion.","zh":"（服装用的）羊皮毛料／剪绒羊皮（常指把羊毛剪短的羊皮，用作面料或大衣内衬）。"},"examples":[{"en":"She bought a jacket with a warm mouton collar.","zh":"她买了一件带保暖羊皮毛领的夹克。"},{"en":"The vintage coat is lined with mouton for extra warmth.","zh":"这件复古大衣用羊皮毛作内衬，更加保暖。"}]}],"synonyms":["sheep","mutton (in food context)","sheepskin (in clothing context)"],"phonetic":"/ˈmuːtɑːn/","extraExplanation":["mouton 源自法语，字面意思就是“羊”。英语里单独使用时比较“外来词”风格，常见于菜谱/菜单（指羊肉）或时尚语境（指羊皮毛料）。","在服装行业里，mouton 常强调“羊皮 + 剪短的绒毛”的质感与保暖性，和普通说的 sheepskin（羊皮）相比更偏材料名称。"]}
{"word":"moutoneed","summary":{"en":"“moutoneed” is not a recognized English word; it’s likely a misspelling (often of “mountaineer” or “mount …”).","zh":"“moutoneed”不是规范英语单词；更可能是拼写错误（常见可能是“mountaineer”或“mount …”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or typing error.","zh":"不是标准英语单词，很可能是拼写或输入错误。"},"examples":[{"en":"I couldn’t find “moutoneed” in a dictionary—could you tell me the sentence you saw it in?","zh":"我在词典里查不到“moutoneed”——你能告诉我它出现在什么句子里吗？"},{"en":"Did you mean “mountaineer” (a person who climbs mountains)?","zh":"你是不是想写“mountaineer”（登山者）？"}]}],"phonetic":"ˌmaʊntəˈnɪr","extraExplanation":["你写的 **moutoneed** 可能想表达以下之一（需要你提供上下文来确认）：\n1) **mountaineer**（登山者；登山）\n2) **mount**（安装；骑上；登上）+ 其他词（比如 mount a device / mount a horse）\n3) **mouton**（法语借词，烹饪里指“羊肉”，英语中较少用且偏菜单用语）\n\n把你看到/想说的完整句子发我，我就能帮你确定正确单词、发音和用法。"]}
{"word":"moutonnee","summary":{"en":"Moutonnée describes a sheep-like, rippled look—especially of clouds or a wavy water surface.","zh":"moutonnée 用来形容像羊群/羊毛般一团团、带波纹的外观，常指云层或水面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of clouds or the sea) having a rippled, wavy pattern like a flock of sheep; “sheep-like” in texture or appearance.","zh":"（指云或海面）呈羊群般的波纹/起伏状；像羊毛般一团团的。"},"examples":[{"en":"By late afternoon, moutonnée clouds covered the sky like a field of white wool.","zh":"到了傍晚，天空布满了moutonnée的云层，像一片白色羊毛地毯。"},{"en":"The wind made the lake surface look moutonnée, with small rounded waves.","zh":"风把湖面吹得呈moutonnée状，起了许多圆润的小波纹。"}]}],"synonyms":["rippling","wavy","billowy","fleecy","cloud-dappled"],"phonetic":"/ˌmuːtɑːˈneɪ/","extraExplanation":["这个词来自法语 mouton（羊），“moutonnée”字面有“像羊（群）一样”的意思。在英语里多用于描写云层（常见于积云/高积云形成的“羊群云”效果）或海面/湖面的小波纹，因此带有较文学、描写性的风格，不是日常口语常用词。","拼写上有时会看到不带重音符号的 moutonnee；在英文语境中两者通常指同一意思。"]}
{"word":"moutons","summary":{"en":"*Moutons* is the plural of French *mouton* (“sheep”), sometimes used in English for sheep or sheepskin (especially in clothing), and in proper names/brands.","zh":"*moutons* 是法语 *mouton*（“羊”）的复数；在英语中偶尔用来指羊或羊皮（尤其在服装领域），也常见于专有名词/品牌名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of French *mouton*) sheep; also used in English to refer to sheepskin (especially in clothing) or to names/brands containing *Mouton*.","zh":"（法语 *mouton* 的复数）羊；在英语里也可指羊皮（尤指服装用的加工羊皮），或含 *Mouton* 的名字/品牌。"},"examples":[{"en":"The farmer keeps several moutons in the field. (French-influenced usage)","zh":"农夫在田里养了几只羊。（受法语影响的用法）"},{"en":"She wore a mouton coat lined with warm sheepskin.","zh":"她穿了一件内衬保暖羊皮的外套。"},{"en":"They ordered roast mouton at the old-style restaurant.","zh":"他们在那家老派餐馆点了烤羊肉。"}]}],"synonyms":["sheep","lamb","sheepskin"],"phonetic":"/muːˈtɑːn/","extraExplanation":["在英语语境中，*moutons* 并不常见；更常见的是直接用英语 *sheep*，或在时尚领域用 *mouton*（指经过加工、外观像皮草的羊皮）。","*Mouton* 也常作为专有名词出现（如法国波尔多酒庄“Château Mouton Rothschild”），这种情况下通常不翻译成“羊”，而是当作名称的一部分来理解。"]}
{"word":"mouzah","summary":{"en":"Mouzah is an Arabic female given name, especially common in Gulf countries, and it has several English spellings.","zh":"Mouzah 是一个阿拉伯语女性名字，海湾国家较常见，英文拼写有多种变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name of Arabic origin, used especially in Gulf countries (e.g., Qatar, the UAE).","zh":"一个阿拉伯语来源的女性名字，尤见于海湾国家（如卡塔尔、阿联酋）。"},"examples":[{"en":"Mouzah is a common woman’s name in parts of the Gulf region.","zh":"Mouzah 在海湾地区的一些地方是比较常见的女性名字。"},{"en":"Sheikha Moza (also spelled Mouza/Mouzah) is a well-known public figure from Qatar.","zh":"Sheikha Moza（也可拼作 Mouza/Mouzah）是卡塔尔的一位知名公众人物。"}]}],"synonyms":["Moza","Mouza","Mozah"],"phonetic":"/moʊˈzɑː/","extraExplanation":["Mouzah 也常见拼写为 Moza、Mouza、Mozah 等；从阿拉伯语转写到英文时，元音和 h 的保留与否常因地区与个人偏好而不同。","很多学习者是在新闻或文化报道中遇到这个名字，尤其与卡塔尔相关的公众人物（如 Sheikha Moza bint Nasser）一起出现。"]}
{"word":"mouzouna","summary":{"en":"“Mouzouna” is not recognized as a standard English word; it’s likely a misspelling or a transliterated name.","zh":"“mouzouna”不是标准英语词；更可能是拼写错误或外来音译的名字/词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/transliteration from another language.","zh":"不是标准英语词。可能是拼写错误，或来自其他语言的姓名/音译词。"},"examples":[{"en":"I can’t find “mouzouna” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里查不到“mouzouna”——你能把它出现的句子发我吗？"},{"en":"Did you mean “monsoon” (a seasonal heavy-rain wind) or “muezzin” (a person who calls people to prayer)?","zh":"你是不是想写“monsoon”（季风/雨季的季节性风）或“muezzin”（宣礼员）？"}]}],"synonyms":["(if intended) monsoon","(if intended) muezzin","(if intended) Mozuna (proper name)"],"phonetic":"/muːˈzuːnə/","extraExplanation":["“mouzouna”更像是音译/拼写变体。为了准确解释，我需要你提供：1）它出现的上下文句子；2）你想表达的语言/地区（例如法语、阿拉伯语、希腊语等）；3）是否是人名、地名或品牌名。","如果你的意思是“monsoon”，正确拼写是 monsoon；如果是宗教场景里“宣礼员”，常见拼写是 muezzin。把原句发来我就能帮你确定。"]}
