{"word":"moxa","summary":{"en":"Moxa is dried mugwort used in moxibustion, where it is burned to warm and stimulate points on the body.","zh":"moxa 指艾绒（多为艾草制成），用于艾灸时燃烧以温热并刺激身体穴位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dried herb (usually mugwort, Artemisia) that is burned near or on the skin in traditional East Asian medicine to warm and stimulate specific points (moxibustion).","zh":"（常指艾草/艾蒿制成的）艾绒；用于艾灸时在皮肤附近或皮肤上燃烧，以温热并刺激穴位。"},"examples":[{"en":"The practitioner used moxa to warm the acupuncture point.","zh":"治疗师用艾绒给针灸穴位加温。"},{"en":"Some people prefer moxa because it feels warming and relaxing.","zh":"有些人更喜欢艾灸用的艾绒，因为它感觉温暖、放松。"}]}],"synonyms":["mugwort","moxibustion (related)","moxa wool"],"phonetic":"/ˈmɑːksə/","extraExplanation":["“moxa”通常与“moxibustion（艾灸）”一起出现。艾灸在中医、日式灸法等传统疗法中较常见，但并非所有人都适合；在英语语境里常会看到关于烟雾、灼伤风险与就医建议等提醒。","词源上，“moxa”经由日语（もぐさ mogusa，指艾绒）进入英语，因此在英文里它既可以指材料本身（艾绒），也可在语境中代指艾灸用的“艾条/艾绒”。"]}
{"word":"moxas","summary":{"en":"Moxas are dried mugwort (moxa) used for heating therapy, or the therapy itself (moxibustion).","zh":"moxas 指用于艾灸的艾绒/艾条，也可泛指艾灸这种施热疗法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dried herb (usually mugwort) that is burned near the skin in traditional East Asian medicine to warm the body and stimulate circulation; also, a small cone or stick made from this herb","zh":"（通常指艾蒿制成的）艾绒/艾条：在东亚传统医学中点燃并靠近皮肤，用来温热身体、促进循环；也可指由艾绒做成的小锥或艾条"},"examples":[{"en":"The practitioner used moxas near the acupuncture points to provide gentle heat.","zh":"治疗师在针灸穴位附近使用艾绒（moxas），提供温和的热感。"},{"en":"She could smell the moxas burning during the moxibustion session.","zh":"在艾灸疗程中，她闻到了艾绒（moxas）燃烧的气味。"}]},{"partOfSpeech":"n.","definition":{"en":"the practice of applying heat by burning moxa (mugwort) near the skin; moxibustion","zh":"用燃烧艾绒在皮肤附近施热的疗法；艾灸"},"examples":[{"en":"Some clinics offer acupuncture and moxas as complementary treatments.","zh":"一些诊所提供针灸和艾灸（moxas）作为辅助疗法。"},{"en":"He asked whether moxas could help with feeling cold in winter.","zh":"他询问艾灸（moxas）是否能改善冬天怕冷。"}]}],"synonyms":["moxa","moxibustion","mugwort (when referring to the herb)"],"phonetic":"ˈmɑksə","extraExplanation":["“moxa”来自日语“もぐさ (mogusa)”，而“艾灸”在中文语境中很常见。英语里更常见的说法是“moxa”（材料）和“moxibustion”（疗法）；“moxas”多见于把 moxa 当作可数名词来用（如“two moxas”指两小团/两支艾条）。"]}
{"word":"moxibustion","summary":{"en":"Moxibustion is a traditional therapy that uses the heat of burning mugwort (moxa) near specific body points.","zh":"艾灸是一种传统疗法，用燃烧艾草产生的热量刺激特定穴位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional therapy in which dried mugwort (moxa) is burned near or on specific points of the body to warm and stimulate them, often used in traditional Chinese medicine (TCM)","zh":"艾灸：一种传统疗法，把干燥的艾草（艾绒/艾）在身体的特定穴位附近或表面燃烧，以温热刺激穴位，常见于中医体系"},"examples":[{"en":"In traditional Chinese medicine, moxibustion is often used alongside acupuncture.","zh":"在中医里，艾灸常常与针灸一起使用。"},{"en":"The practitioner applied gentle moxibustion to warm the area and improve circulation.","zh":"治疗师用温和的艾灸来温暖该部位并促进循环。"},{"en":"Some people use moxibustion at home, but it’s important to follow safety guidance to avoid burns.","zh":"有些人会在家做艾灸，但务必遵循安全指导以避免烫伤。"}]}],"synonyms":["moxa therapy","moxa (informal)","heat therapy (broader)"],"phonetic":"/ˌmɑːk.səˈbʌs.tʃən/","extraExplanation":["“moxibustion”来自日语词源（moxa + -bustion）。其中 moxa 指“艾绒/艾”，-bustion 与“燃烧”相关。","英语语境中常把它视为一种补充与替代疗法（complementary therapy）。在跨文化交流时，较稳妥的说法是：它是中医传统疗法之一，但具体功效与适应证在不同医学体系中的证据与表述可能不同。"]}
{"word":"moxie","summary":{"en":"Moxie means bold, confident courage and determination.","zh":"moxie 指大胆自信的勇气与决心（很有冲劲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Courage, determination, and confident energy (often shown in a bold, spirited way).","zh":"勇气、决心与自信的劲头（常带点大胆、有冲劲的感觉）。"},"examples":[{"en":"It takes real moxie to start a business with almost no money.","zh":"几乎没钱就创业，需要真正的勇气和冲劲。"},{"en":"She spoke up in the meeting with a lot of moxie.","zh":"她在会议上大胆发言，很有气势。"},{"en":"The team played with moxie even after falling behind.","zh":"即使落后，这支队伍仍踢得很有拼劲。"}]}],"synonyms":["grit","nerve","courage","spunk","determination"],"phonetic":"/ˈmɑːksi/","extraExplanation":["“moxie”原本是20世纪初美国一种汽水的品牌名（Moxie）。当时广告把它和“精神、活力、胆量”联系起来，后来这个词就转为口语里表示“有胆识、有冲劲”。","语气通常偏正面，带一点俏皮或口语感；在美式英语里很常见。"]}
{"word":"moxieberries","summary":{"en":"“Moxieberries” is a playful, nonstandard term for berries (real or fictional) associated with confidence and energy.","zh":"“moxieberries”是一个俏皮的非标准说法，指（真实或虚构的）与自信和精力相关联的“莓果”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, coined word) Berries or a berry-based product marketed or described as giving you “moxie” (confidence, energy, courage). Often used playfully rather than as a standard dictionary word.","zh":"（非正式、造词）指被宣传或形容为能带来“moxie”（自信、精力、胆量）的浆果或浆果类产品；多为俏皮用法，并非标准词汇。"},"examples":[{"en":"I don’t know what’s in these moxieberries, but I feel ready to present.","zh":"我不知道这些“moxieberries”里有什么，但我感觉自己已经准备好去做汇报了。"},{"en":"Their smoothie menu includes “moxieberries” as a fun name for a mixed-berry blend.","zh":"他们的冰沙菜单把综合莓果混合取了个好玩的名字叫“moxieberries”。"}]},{"partOfSpeech":"n.","definition":{"en":"A fictional or whimsical berry in stories, games, or social media, used as a creative name rather than a real fruit.","zh":"（故事/游戏/社媒中的）虚构或玩笑式的“莓果”，作为创意名称使用，并非真实水果。"},"examples":[{"en":"In the game, moxieberries restore stamina for a short time.","zh":"在游戏里，moxieberries 能在短时间内恢复体力。"},{"en":"The author invented moxieberries to make the forest feel magical.","zh":"作者发明了“moxieberries”这个设定，让森林更有魔法感。"}]}],"synonyms":["mixed berries","superfood berries","energy berries","(fictional) magic berries"],"phonetic":"/ˈmɑksiˌbɛriz/","extraExplanation":["“moxie”在美式英语里常指“勇气、胆量、干劲、自信”。把它和“berries”组合成“moxieberries”是一种常见的英语造词方式：用前面一个词当作修饰语，给后面的名词增添一种感觉或卖点（类似“power smoothie”“superfood berries”）。","如果你是在某个具体品牌、小说、游戏或菜单里看到这个词，它的精确含义可能取决于该作品/产品的设定；你可以告诉我出处，我能帮你更准确地解释。"]}
{"word":"moxieberry","summary":{"en":"Moxieberry is not a standard English word; it’s usually a playful or brand-style name meaning a “bold/energizing berry” flavor or product.","zh":"Moxieberry 不是标准英语词汇；多用于俏皮的营销／品牌式命名，表示带“有胆识、有劲头”联想的“莓果”口味或产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / not standard) A playful or invented name for a berry product or flavor, suggesting “energy, boldness, or spunk” (from moxie).","zh":"（罕见／非标准用法）一种带有玩笑或自创色彩的“莓果”名称或口味名，借用 moxie（胆识、劲头）的含义，暗示“有活力、很带劲”。"},"examples":[{"en":"This drink comes in a new moxieberry flavor.","zh":"这款饮料出了新的 moxieberry（劲头莓／活力莓）口味。"},{"en":"The café named its smoothie “Moxieberry” to make it sound bold and fun.","zh":"那家咖啡馆把冰沙取名为“Moxieberry”，让它听起来更有劲儿、更有趣。"}]},{"partOfSpeech":"other","definition":{"en":"A brand name or proper name (e.g., for a beverage, candy, or fictional item).","zh":"一个品牌名或专有名称（例如饮料、糖果或虚构物品的名字）。"},"examples":[{"en":"Moxieberry is listed as a trademark in the ingredients database.","zh":"在配料数据库里，Moxieberry 被列为一个商标名称。"}]}],"synonyms":["(closest idea) energy-berry","berry blast","(related) moxie"],"phonetic":"/ˈmɑksiˌbɛri/","extraExplanation":["“moxieberry”不算常见英语词汇，通常更像是营销命名或虚构词。理解时可拆成 moxie（胆量、精气神、干劲）+ berry（浆果）。","发音一般按英语复合词读：重音常在 MOX- 上。若你是在某个品牌、游戏或小说里看到它，具体含义可能以该作品设定为准。"]}
{"word":"moxies","summary":{"en":"“Moxies” is the plural of “moxie,” meaning courage and bold confidence (and sometimes energetic determination).","zh":"“moxies”是“moxie”的复数，常指勇气、胆识、魄力（也可指干劲与决心）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of moxie) Courage, nerve, or bold confidence; also energetic spirit and determination.","zh":"（moxie 的复数）勇气、胆量、自信的魄力；也指干劲与坚定的决心。"},"examples":[{"en":"It takes real moxie to speak up when everyone else stays silent.","zh":"当其他人都沉默时，还敢站出来发声，需要真正的胆识。"},{"en":"She tackled the new job with moxie and a can-do attitude.","zh":"她带着十足的干劲和“我能行”的态度投入新工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, as a proper noun plural) Refers to multiple cans/bottles of Moxie, a U.S. soft drink brand.","zh":"（较少见，作专有名词复数）指多罐/多瓶 Moxie（美国的一种汽水品牌）。"},"examples":[{"en":"He came back from New England with a few Moxies for us to try.","zh":"他从新英格兰带回几瓶 Moxie 给我们尝尝。"}]}],"synonyms":["courage","nerve","boldness","grit","guts","spunk"],"phonetic":"/ˈmɑksi/","extraExplanation":["“moxie”最初来自19世纪末美国一种名为“Moxie”的专利药/滋补饮料广告，宣称能让人更有“精力与胆量”。后来这个品牌名逐渐变成普通词，表示“胆识、魄力”。","在日常英语里，“have moxie”很常见，意思是“有胆量/有冲劲”。"]}
{"word":"moxo","summary":{"en":"“Moxo” is usually a brand/product name; it has no single standard meaning. If you meant “moxie,” it means courage and confidence.","zh":"“Moxo”多为品牌/产品名，本身没有统一的标准词义；若你想查的是“moxie”，它表示勇气、自信与魄力。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English dictionary word), often used as a brand or app name. It doesn’t have one fixed meaning in everyday English; its meaning depends on the product, company, or context using the name.","zh":"专有名词（不是标准英语词典中的常见单词），常见于品牌名或应用名。它在日常英语里没有固定含义，具体意思取决于使用它的产品、公司或语境。"},"examples":[{"en":"I downloaded Moxo to share files securely with my team.","zh":"我下载了 Moxo，用来和团队安全地共享文件。"},{"en":"Our client asked us to send the documents through Moxo instead of email.","zh":"客户让我们通过 Moxo 而不是邮件发送文件。"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “moxie,” it means courage, energy, and confidence—especially the kind that helps you take action.","zh":"如果你想表达的是 “moxie”，它指勇气、干劲和自信——尤其是能让你敢做敢当的那种。"},"examples":[{"en":"She has the moxie to speak up in meetings.","zh":"她有胆量在会议上大胆发言。"},{"en":"It takes moxie to start a new life in a new country.","zh":"在一个新国家开始新生活需要很大的勇气和魄力。"}]}],"synonyms":["(for moxie) courage","(for moxie) nerve","(for moxie) confidence","(for moxie) grit"],"phonetic":"/ˈmoʊksoʊ/","extraExplanation":["“Moxo”更像是品牌/产品名，因此在真实英语交流中通常会把它当作专有名词使用（类似 Zoom、Slack）。如果你是在看文章或听别人说到它，最可靠的办法是结合上下文：它是哪家公司的产品？用来做什么？","如果你本来想查的是拼写相近的 “moxie”，它在美式英语里很常见，语气偏口语，常用来夸人“有胆识、有干劲”。"]}

