{"word":"Mozart","summary":{"en":"Mozart is the name of a famous Austrian classical composer (1756–1791).","zh":"Mozart 指著名的奥地利古典作曲家莫扎特（1756–1791）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wolfgang Amadeus Mozart (1756–1791), an Austrian composer and musician, famous for classical music such as operas, symphonies, and piano works.","zh":"沃尔夫冈·阿马德乌斯·莫扎特（1756–1791），奥地利作曲家与音乐家，以歌剧、交响曲和钢琴作品等古典音乐闻名。"},"examples":[{"en":"We listened to Mozart while studying because the music felt calm and clear.","zh":"我们学习时听莫扎特，因为他的音乐让人感觉平静、清晰。"},{"en":"Mozart wrote many operas, including The Magic Flute.","zh":"莫扎特写了很多歌剧，其中包括《魔笛》。"}]}],"phonetic":"/ˈmoʊtsɑrt/","extraExplanation":["英语里人名通常不加冠词：说“Mozart was a composer.”（莫扎特是一位作曲家）。但在口语中也会用“a Mozart”来表示“像莫扎特那样的天才/大师”（强调类别或比喻），例如：\"He’s a Mozart on the piano.\"（他钢琴弹得像莫扎特一样厉害）。","常见搭配：Mozart’s music（莫扎特的音乐）、a Mozart symphony（一首莫扎特的交响曲）、a piece by Mozart（一首莫扎特作的曲子）。","文化常识：莫扎特是“古典主义时期”（Classical period）的代表人物之一。在英语语境中提到他，往往暗示“精致、结构清晰、古典品味”。"]}
{"word":"Mozart's","summary":{"en":"“Mozart’s” means “of Mozart” or “connected to Mozart,” showing possession or association.","zh":"“Mozart’s”表示“莫扎特的”或“与莫扎特有关”，用于表示所属或关联。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"Belonging to or associated with Mozart (Wolfgang Amadeus Mozart), usually used before a noun to show possession or connection.","zh":"莫扎特的；与莫扎特（沃尔夫冈·阿玛多伊斯·莫扎特）有关的，通常放在名词前表示所属或关联。"},"examples":[{"en":"Mozart's music is still popular today.","zh":"莫扎特的音乐至今仍然很受欢迎。"},{"en":"We listened to Mozart's Symphony No. 40 in class.","zh":"我们在课堂上听了莫扎特的《第40交响曲》。"},{"en":"The museum has one of Mozart's original letters.","zh":"那家博物馆收藏了莫扎特的一封亲笔信。"}]}],"synonyms":["of Mozart","Mozartian (adj., more formal)"],"phonetic":"/ˈmoʊtsɑrtz/","extraExplanation":["“Mozart’s”是专有名词“Mozart”的所有格形式（加 ’s），英语里常用来表示“……的”或“与……有关”。即使拥有者不是“物品”，也常用所有格表达关联：例如“ Mozart’s style（莫扎特的风格）”。","莫扎特（1756–1791）是奥地利古典主义作曲家，英文中提到他的作品时，经常用“ Mozart’s + 作品名称/类型”：如“ Mozart’s operas（莫扎特的歌剧）”。"]}
{"word":"moze","summary":{"en":"“Moze” is most commonly a personal name (a variant of “Moses”); it is not a standard English word and may also appear as a typo or a transliteration from other languages.","zh":"“Moze”最常见是人名（“Moses/摩西”的变体）；它不是标准英语词，也可能是拼写错误或其他语言的转写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually male); a variant spelling of “Moses,” used as a personal name.","zh":"人名（多为男性名）；“Moses（摩西）”的变体拼写，可用作名字。"},"examples":[{"en":"Moze is my grandfather’s name.","zh":"Moze 是我祖父的名字。"},{"en":"I met someone named Moze at the conference.","zh":"我在会议上认识了一个叫 Moze 的人。"}]},{"partOfSpeech":"other","definition":{"en":"(not standard English) sometimes used online as a misspelling of “moose,” or as a transliteration from other languages (e.g., Polish “może” = “maybe”).","zh":"（非标准英语）网络上有时是 “moose（麋鹿）” 的拼写错误，或是其他语言的转写（如波兰语 “może”=“也许”）。"},"examples":[{"en":"Did you mean “moose” (the animal) instead of “moze”?","zh":"你是不是想写 “moose（麋鹿）”，而不是 “moze”？"},{"en":"In Polish, “może” means “maybe.”","zh":"在波兰语里，“może”的意思是“也许”。"}]}],"synonyms":["Moses"],"phonetic":"/moʊz/","extraExplanation":["“Moze”在英语里不是常见词汇，更常见的是作为人名或拼写误差。如果你是想查某个英语单词（比如 moose, mosey, maze, Moses），告诉我你看到它的句子或语境，我可以帮你精确判断。"]}
{"word":"mozemize","summary":{"en":"“Mozemize” isn’t a standard English word; you probably mean “mesmerize” (= captivate completely).","zh":"“mozemize” 不是标准英语单词；你大概率想表达 “mesmerize”（使人完全着迷）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Mozemize” is not a standard English word. It is most likely a misspelling of “mesmerize,” meaning to capture someone’s attention completely (as if by magic).","zh":"“mozemize” 不是标准英语单词。它很可能是 “mesmerize” 的拼写错误，意思是让人完全被吸引、看得入迷（像被施了魔法一样）。"},"examples":[{"en":"Did you mean “mesmerize”? The movie really mesmerized me.","zh":"你是不是想写 “mesmerize”？那部电影真的让我看得入迷。"},{"en":"Her voice can mesmerize an audience.","zh":"她的嗓音能让观众听得入迷。"}]},{"partOfSpeech":"vt.","definition":{"en":"mesmerize: to fascinate or hold someone’s attention completely.","zh":"mesmerize：使着迷；使目不转睛；完全吸引某人的注意力。"},"examples":[{"en":"The dancers mesmerized the crowd with their performance.","zh":"舞者用他们的表演让人群看得入迷。"},{"en":"I was mesmerized by the way the artist used color.","zh":"我被那位艺术家用色的方式深深吸引。"}]}],"synonyms":["captivate","fascinate","entrance","spellbind"],"phonetic":"/ˈmɛzməˌraɪz/","extraExplanation":["“mesmerize” 来自 18 世纪医生 Franz Mesmer 的姓氏（Mesmerism，梅斯梅尔催眠术/磁疗理论）。因此这个词常带有“像被催眠一样入神”的感觉，多用于描述音乐、表演、电影、风景等让人移不开眼的体验。"]}
{"word":"mozetta","summary":{"en":"A mozetta is a short shoulder cape worn as formal clothing by high-ranking Catholic clergy.","zh":"mozetta 指天主教高级神职人员在正式场合穿的短款肩披（披肩式斗篷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short cape worn over the shoulders, traditionally by the Pope, cardinals, bishops, and some other clergy in the Roman Catholic Church","zh":"（天主教）莫采塔：一种披在肩上的短斗篷式披肩，传统上由教宗、枢机主教、主教及部分神职人员穿着"},"examples":[{"en":"In the photograph, the cardinal is wearing a red mozetta over his cassock.","zh":"在这张照片里，这位枢机主教在长袍外穿着一件红色莫采塔。"},{"en":"During the ceremony, the bishop put on a mozetta as part of his formal vestments.","zh":"在仪式中，主教穿上莫采塔，作为正式礼服的一部分。"}]}],"synonyms":["short cape","shoulder cape","clerical cape"],"phonetic":"/moʊˈzɛtə/","extraExplanation":["“mozetta”常见于天主教礼仪与教会服饰语境，属于“礼仪服装（vestments）”的一种。它通常是短款、前面可扣合的肩披，颜色会随身份与礼仪时期而变化（例如枢机主教常见红色）。","词源通常追溯到意大利语，属于借词；在英语文本里多出现在宗教新闻、艺术史/绘画描述、或介绍梵蒂冈礼仪传统的文章中。"]}
{"word":"mozettas","summary":{"en":"“Mozzettas” are short clerical capes (plural of “mozzetta”), worn especially by the Pope and some Catholic bishops.","zh":"“Mozzettas”指短款宗教肩披（mozzetta 的复数），尤为教皇及部分天主教主教所穿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short cape worn over the shoulders, especially by the Pope and some Catholic bishops (plural of “mozzetta”).","zh":"（尤指教皇及部分天主教主教所穿的）短披肩、肩披（mozzetta 的复数）。"},"examples":[{"en":"In the ceremony, the cardinals wore red mozzettas over their cassocks.","zh":"在仪式上，枢机主教们在长袍外披着红色的短披肩。"},{"en":"The pope appeared on the balcony wearing a white mozzetta.","zh":"教皇出现在阳台上，身披白色短披肩。"}]}],"synonyms":["clerical cape","short cape","shoulder cape"],"phonetic":"/moʊˈzɛtəz/","extraExplanation":["“Mozzetta”来自意大利语，多见于天主教礼仪与宗教服饰语境。它通常是扣在前面的短披肩，颜色会随身份与礼仪场合变化（如红色、紫色、白色等）。","英语里常见单数 mozzetta，复数可写作 mozzettas（也有人用意大利式复数 mozzette）。在非宗教语境中较少使用，属于较专门的词。"]}
{"word":"mozette","summary":{"en":"A short clerical cape worn in some Christian church traditions, especially Roman Catholic.","zh":"（尤指天主教）神职人员在特定礼仪场合穿的短披肩式斗篷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short cape (a sleeveless shoulder garment) worn by some Christian clergy, especially in the Roman Catholic Church, often buttoned in front.","zh":"（尤指罗马天主教）部分神职人员穿的短披肩/短斗篷式披风，通常前面有扣子。"},"examples":[{"en":"The bishop wore a purple mozette over his cassock during the ceremony.","zh":"主教在仪式上穿着紫色的短披肩（mozette），外罩在长袍上。"},{"en":"In some traditions, the color of the mozette shows the wearer’s rank or the season.","zh":"在一些传统中，mozette 的颜色会显示穿戴者的等级或礼仪季节。"}]}],"synonyms":["mozzetta","clerical cape","short cape"],"phonetic":"/moʊˈzɛt/","extraExplanation":["这个词在英语里更常见的拼写是 **mozzetta**（意大利语来源）；**mozette** 可以视为较少见的变体拼写。","它属于“礼仪服饰”（vestments）的范畴，常见于天主教及部分圣公会等传统；不同颜色和材质可能对应不同职务或节期。"]}
{"word":"mozing","summary":{"en":"“Mozing” isn’t a standard English word; it’s likely a typo for “moseying” or “amazing,” depending on context.","zh":"“mozing” 不是标准英语词；多半是拼写/输入错误，可能想写 “moseying” 或 “amazing”，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or informal typing of another word (often “moseying” or “amazing,” depending on context).","zh":"不是标准英语单词；多半是拼写错误或随手打字造成的变体，常见可能想写的是 “moseying（慢悠悠地走）” 或 “amazing（惊人的）”，要看语境。"},"examples":[{"en":"I couldn’t find “mozing” in a dictionary—did you mean “moseying” (walking slowly) ?","zh":"我在词典里找不到 “mozing”——你是不是想写 “moseying”（慢悠悠地走）？"},{"en":"If you meant “amazing,” you could say: “That’s amazing!”","zh":"如果你想表达 “amazing（惊人的）”，可以说：“That’s amazing!”（太棒了/太惊人了！）"}]}],"synonyms":["moseying","amazing"],"phonetic":"moʊzɪŋ","extraExplanation":["“mosey” 是比较口语、偏美式的动词，常指不赶时间、悠闲地走或逛：mosey around（随便逛逛）。它的现在分词是 “moseying”。","如果你把 “mozing” 用在聊天里，也可能是个人/圈子里的自创词或昵称。给我一句你原本的英文句子，我可以更准确判断你想表达的是哪一个词。"]}
{"word":"mozo","summary":{"en":"Mozo is a Spanish loanword meaning a waiter/attendant; less commonly, it can mean a young man or helper.","zh":"mozo 是源自西班牙语的外来词，常指（餐馆等处的）服务员/侍者；较少见时也可指年轻男子或帮工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) A waiter or attendant, especially in a Spanish or Latin American setting.","zh":"（源自西班牙语）男服务员/侍者；尤指在西班牙或拉丁美洲语境中的服务人员。"},"examples":[{"en":"We asked the mozo for the check after dinner.","zh":"晚餐后我们请那位服务员结账。"},{"en":"In the café, the mozo brought our coffee and pastries.","zh":"在咖啡馆里，服务员端来了咖啡和点心。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A young man; sometimes a servant or helper (often used in older or regional Spanish contexts).","zh":"（较少见）年轻男子；有时指仆役/帮工（多见于较旧或地方性的西语用法）。"},"examples":[{"en":"In the novel, the mozo runs errands for the landowner.","zh":"在小说里，那位年轻帮工为地主跑腿办事。"},{"en":"He was just a mozo then, new to the village.","zh":"那时他还是个年轻小伙子，刚到村里。"}]}],"synonyms":["waiter","server","attendant","helper"],"phonetic":"/ˈmoʊzoʊ/","extraExplanation":["“mozo”在英语里多作为外来词出现，常见于描写西班牙语国家的旅行、餐馆或文学作品中；在日常英语里更常说“waiter/servers”。","西班牙语中“mozo”本义与“年轻、壮实的男子”相关，因此在一些语境里可延伸为“跑腿的、帮工的”。使用时注意语境：在餐馆里通常更自然地理解为“服务员”。"]}
{"word":"mozos","summary":{"en":"“Mozos” is a Spanish plural meaning either “young men” or “waiters/attendants,” depending on context.","zh":"“Mozos”是西班牙语复数，语境不同可指“年轻男子”或“服务员/侍者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish; plural of mozo) young men; youths.","zh":"（源自西班牙语；mozo 的复数）年轻男子；青年。"},"examples":[{"en":"In the village, the mozos helped carry supplies during the festival.","zh":"在村子里，节日期间那些年轻男子帮忙搬运物资。"},{"en":"The story describes mozos gathering in the plaza at night.","zh":"故事描写年轻人夜里聚集在广场上。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Spanish; plural of mozo) waiters or attendants, especially in Spanish-speaking settings.","zh":"（源自西班牙语；mozo 的复数）服务员；侍者（多见于西语语境）。"},"examples":[{"en":"The mozos brought bread and coffee to our table.","zh":"服务员把面包和咖啡端到我们桌上。"},{"en":"She thanked the mozos for their quick service.","zh":"她感谢服务员的迅速服务。"}]}],"synonyms":["waiters","attendants","young men","youths"],"phonetic":"/ˈmoʊzoʊz/","extraExplanation":["“Mozos”是西班牙语外来词，在英语里多出现在描写拉丁美洲或西班牙文化的旅行写作、历史文本或小说中。具体含义要看语境：在一些地区（尤其拉美），mozo 常指“服务员/侍者”；而在更一般的西语里也可指“年轻人/小伙子”。","如果你是在某个国家/地区的餐馆或旅行场景里看到“mozos”，通常更可能是“服务员”的意思。"]}
{"word":"mozzarella","summary":{"en":"Mozzarella is a soft, mild white cheese that melts well, especially common on pizza.","zh":"Mozzarella（马苏里拉奶酪）是一种柔软清淡的白色奶酪，易融化，尤其常见于披萨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, mild white cheese that melts easily, often used on pizza and in Italian dishes","zh":"一种柔软、味道清淡的白色奶酪，容易融化，常用于披萨和意大利料理"},"examples":[{"en":"I’d like a pizza with extra mozzarella.","zh":"我想要一份加倍马苏里拉奶酪的披萨。"},{"en":"Caprese salad is made with tomatoes, mozzarella, and basil.","zh":"卡普雷塞沙拉由番茄、马苏里拉奶酪和罗勒做成。"}]}],"synonyms":["cheese","fresh mozzarella","low-moisture mozzarella"],"phonetic":"/ˌmɑːtsəˈrɛlə/","extraExplanation":["“Mozzarella”常见的两种形态：fresh mozzarella（新鲜马苏里拉，含水多、口感更嫩，常用于沙拉）和 low-moisture mozzarella（低水分马苏里拉，更耐烤、拉丝更明显，常用于披萨）。","发音里常见的易错点是重音和“ts”音：mozzarella 中间的“zz”通常发 /ts/。"]}
{"word":"mozzetta","summary":{"en":"A short ceremonial cape worn by the Pope and some Catholic clergy.","zh":"教宗及部分天主教神职人员穿着的一种短礼仪披肩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short cape (shoulder garment) worn over the shoulders, especially by the Pope and some Catholic clergy as part of ceremonial dress.","zh":"一种短披肩（披风式肩披），主要由教宗及部分天主教神职人员在礼仪或正式场合穿着。"},"examples":[{"en":"In the photo, the Pope is wearing a red mozzetta over his white cassock.","zh":"在照片中，教宗在白色长袍外披着一件红色的mozzetta。"},{"en":"During the ceremony, the bishop’s mozzetta showed his rank and role.","zh":"在仪式中，主教的mozzetta体现了他的身份与职务。"}]}],"synonyms":["cape","clerical cape"],"phonetic":"/mɑtˈsɛtə/","extraExplanation":["mozzetta 常见于天主教礼仪服饰语境：它是一种覆盖肩部与上胸背部的短披肩，通常前方有扣子。不同颜色与材质（如红色、白色、紫色、天鹅绒或毛料）可能与职务、季节或礼仪传统有关。","词源来自意大利语（教会与礼仪服饰领域中，意大利语借词很常见），在英文里多用于宗教、历史、艺术或新闻报道的语境。"]}
{"word":"mozzettas","summary":{"en":"“Mozzettas” means multiple “mozzettas,” short shoulder capes worn by Catholic clergy.","zh":"“mozzettas”是复数，指多件“mozzetta”（天主教神职人员穿的短肩披）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short cape-like garment worn over the shoulders, traditionally by Catholic clergy (such as the pope, cardinals, or bishops). “Mozzettas” is the plural form of “mozzetta.”","zh":"（天主教）短披肩、肩披（传统上由教宗、枢机或主教等神职人员披在肩上）。“mozzettas”是“mozzetta”的复数形式。"},"examples":[{"en":"In the museum display, several mozzettas were shown in different colors for different ranks.","zh":"在博物馆展柜里，陈列了好几件不同颜色的肩披，对应不同的教阶。"},{"en":"The bishop wore a mozzetta over his rochet during the ceremony.","zh":"在典礼上，主教在白衣（rochet）外披着一件肩披（mozzetta）。"}]}],"synonyms":["shoulder cape","capelet"],"phonetic":"moʊˈzɛtə","extraExplanation":["“Mozzetta”常见于天主教礼仪服饰语境，通常是扣在前胸的短披肩。颜色常带有象征意义：例如红色常与枢机相关，紫色常与主教相关（具体会因传统与场合而变）。","该词来自意大利语，属于较专门的宗教与服饰词汇；日常英语中不常见，更多出现在宗教新闻、礼仪介绍或博物馆说明中。"]}
{"word":"mozzette","summary":{"en":"Mozzette are short capes worn by the Pope and some Catholic bishops (plural of mozzetta).","zh":"mozzette 指天主教教宗及部分主教穿的短披肩/短斗篷（mozzetta 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short cape (a shoulder-length cloak) worn over other vestments by the Pope and some Catholic bishops; also called a \"mozzetta\" (singular).","zh":"（天主教）教宗及部分主教穿在礼服外的一种短披肩/短斗篷；单数为 mozzetta。"},"examples":[{"en":"In the photo, the Pope is wearing a red mozzette over his white cassock.","zh":"在照片里，教宗在白色法衣外穿着一件红色的 mozzette（短披肩）。"},{"en":"The bishop’s mozzette was trimmed with fur for a winter ceremony.","zh":"这位主教的 mozzette 边缘镶有毛皮，用于冬季仪式。"}]}],"synonyms":["mozzetta","cape","shoulder cape","clerical cape"],"phonetic":"/mɑːtˈsɛt/","extraExplanation":["该词来自意大利语 mozzetta，属于天主教礼仪服饰用语；不同颜色常与不同身份或礼仪场合相关（例如红色常见于一些主教或特定礼服传统中）。在英文里你也会看到单数 mozzetta、复数 mozzette 两种写法。"]}

