{"word":"MP","summary":{"en":"MP commonly means “Member of Parliament,” and can also mean “military police” or “megapixel,” depending on context.","zh":"MP最常指“国会议员”，也可指“宪兵/军事警察”或“百万像素”，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Member of Parliament; an elected person who represents a local area in a national parliament (especially in the UK and some Commonwealth countries).","zh":"国会议员；在国家议会中代表某一选区的民选代表（尤指英国及部分英联邦国家）。"},"examples":[{"en":"Write to your MP if you have a problem with a government service.","zh":"如果你对政府服务有问题，可以写信给你的国会议员（MP）。"},{"en":"She was elected MP for her hometown.","zh":"她当选为家乡选区的国会议员。"}]},{"partOfSpeech":"n.","definition":{"en":"military police; a branch of the armed forces responsible for policing and security within the military.","zh":"宪兵；负责军队内部执法与安全的军事警察部门。"},"examples":[{"en":"The MP investigated the incident on the base.","zh":"宪兵调查了基地里的这起事件。"},{"en":"He served in the MP during his time in the army.","zh":"他在服役期间在宪兵部队任职。"}]},{"partOfSpeech":"n.","definition":{"en":"megapixel; a unit equal to one million pixels, used to describe the resolution of a camera or image.","zh":"百万像素；等于一百万个像素，用于描述相机或图像的分辨率。"},"examples":[{"en":"This phone has a 50 MP main camera.","zh":"这款手机的主摄是5000万像素（50 MP）。"},{"en":"Higher MP doesn’t always mean better photos in low light.","zh":"像素更高并不总意味着弱光拍摄更好。"}]}],"synonyms":["Member of Parliament","parliamentarian","military police","megapixel"],"phonetic":"/ˌɛmˈpiː/","extraExplanation":["“MP”是缩写/首字母词，口语中常读作字母“em-pee”。书写时常见“MP”或“M.P.”两种形式。","在英国语境里，“your MP”非常常见，指你所在选区的国会议员；在美国更常说“Congressman/Congresswoman”或“Representative”。","在数码产品里，“MP”通常只指“megapixel（百万像素）”，要结合上下文避免与“Member of Parliament/ Military Police”混淆。"]}
{"word":"mp","summary":{"en":"MP is an abbreviation most commonly meaning Member of Parliament; it can also mean military police or megapixel, depending on context.","zh":"MP 是缩写，最常见指“国会议员”；也可能指“军警”或“百万像素”，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) Member of Parliament: an elected representative in the parliament (especially in the UK and other parliamentary systems).","zh":"（缩写）国会议员：在议会（尤其是英国等议会制国家）中由选民选出的代表。"},"examples":[{"en":"Write to your MP if you need help with a local issue.","zh":"如果你需要解决本地问题，可以写信给你的国会议员（MP）。"},{"en":"The MP spoke in Parliament about education reform.","zh":"这位国会议员在议会中就教育改革发言。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev.) military police: a branch of the armed forces responsible for law enforcement within the military.","zh":"（缩写）宪兵／军警：在军队内部负责执法与维持军纪的部门。"},"examples":[{"en":"The MP investigated the incident on the base.","zh":"军警调查了基地里的这起事件。"},{"en":"He served as an MP during his time in the army.","zh":"他在服役期间担任过军警。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev.) megapixel: one million pixels, used to describe the resolution of a camera or image.","zh":"（缩写）百万像素：一百万个像素，用来描述相机或图像的分辨率。"},"examples":[{"en":"This phone has a 48 MP main camera.","zh":"这款手机的主摄是 4800 万像素（48 MP）。"},{"en":"Higher MP doesn’t always mean better photos.","zh":"更高的像素（MP）不一定意味着照片更好。"}]}],"synonyms":["Member of Parliament","military police","megapixel"],"phonetic":"/ˌɛmˈpiː/","extraExplanation":["“MP”是缩写，读作字母名“em-pee”。具体含义要看语境：英国新闻里多指“国会议员”，军事语境常指“军警”，数码产品参数里几乎一定指“百万像素”。","英式英语中常说“your MP”（你选区的议员）；在美国语境里较少用“MP=国会议员”，美国更常见的是“Congressman/Congresswoman”。"]}
{"word":"MPA","summary":{"en":"MPA is an abbreviation that most commonly means the graduate degree Master of Public Administration, or the pressure unit megapascal (MPa); it can also be an organization’s name in some contexts.","zh":"MPA是缩写，最常见指公共管理硕士（学位）或压力单位兆帕（MPa）；在某些语境下也可能是机构名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Master of Public Administration (a graduate degree focused on public sector management and policy).","zh":"公共管理硕士（研究生学位，侧重公共部门管理与政策）。"},"examples":[{"en":"She earned an MPA to work in local government.","zh":"她读了公共管理硕士（MPA），想进入地方政府工作。"},{"en":"Many nonprofits value candidates with an MPA.","zh":"许多非营利组织很看重拥有MPA背景的求职者。"}]},{"partOfSpeech":"n.","definition":{"en":"Megapascal, a unit of pressure equal to one million pascals (used in engineering and science).","zh":"兆帕（压力单位，等于一百万帕，工程与科学中常用）。"},"examples":[{"en":"The tire pressure is rated at 0.24 MPa.","zh":"轮胎压力额定为0.24兆帕（MPa）。"},{"en":"The material can withstand 30 MPa of stress.","zh":"这种材料可以承受30兆帕的应力。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used by some agencies/organizations (e.g., Maritime and Port Authority in some countries).","zh":"某些机构/组织的缩写名称（例如部分国家的海事与港务管理机构）。"},"examples":[{"en":"The MPA issued a safety notice for vessels.","zh":"MPA发布了船舶安全通告。"},{"en":"Check the MPA website for the latest port regulations.","zh":"去MPA官网查看最新的港口规定。"}]}],"synonyms":["Master of Public Administration","MPa (megapascal)"],"phonetic":"/ˌɛm piː ˈeɪ/","extraExplanation":["“MPA”是缩写，具体含义高度依赖语境：谈学历/职业发展时常指Master of Public Administration；谈物理量、材料强度、轮胎压力时几乎一定是megapascal（单位写作MPa，注意只有p小写）；在新闻、公文或本地事务中也可能是某个机构名称的缩写。","书写上常见区分：学位常写作MPA（全大写）；压力单位按国际单位制写作MPa（M大写、p小写、a小写）。"]}
{"word":"mpa","summary":{"en":"MPA most commonly means a public administration master’s degree or the pressure unit megapascal (MPa).","zh":"MPA最常见指公共管理硕士学位，或压力单位兆帕（MPa）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Master of Public Administration: a graduate degree focused on public policy, government management, and nonprofit leadership.","zh":"公共管理硕士：侧重公共政策、政府管理与非营利组织领导力的研究生学位。"},"examples":[{"en":"She earned an MPA to work in city government.","zh":"她读了公共管理硕士（MPA），想进入市政府工作。"},{"en":"Many nonprofit directors have an MPA or an MBA.","zh":"很多非营利机构负责人拥有MPA或MBA学位。"}]},{"partOfSpeech":"n.","definition":{"en":"megapascal (MPa): a unit of pressure equal to one million pascals, used in engineering and materials science.","zh":"兆帕（MPa）：压力单位，等于一百万帕斯卡，常用于工程与材料领域。"},"examples":[{"en":"The tire pressure is 0.24 MPa.","zh":"轮胎气压是0.24 MPa（兆帕）。"},{"en":"This material can withstand 30 MPa of compressive stress.","zh":"这种材料能承受30 MPa的抗压应力。"}]}],"synonyms":["Master of Public Administration","megapascal","MPa"],"phonetic":"/ˌɛm piːˈeɪ/","extraExplanation":["“MPA”常见于两类语境：\n1）教育/职业：写在简历或学校项目名称里（如“MPA program”）。\n2）理工/工程：写作“MPa”（a小写）表示压力单位；在学术与技术文本中大小写很重要。","读法通常是逐字母读“em-pee-ay”。如果是在工程语境看到“MPa”，也常直接读作“megapascal”。"]}
{"word":"MPAcc","summary":{"en":"MPAcc is short for Master of Professional Accounting, a practical graduate accounting degree often linked to CPA preparation.","zh":"MPAcc 是“专业会计硕士”的缩写，属于偏实务的会计研究生学位，常与 CPA 备考/资格要求相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Master of Professional Accounting: a graduate-level degree focused on practical accounting skills, often designed to prepare students for professional certification (such as the CPA).","zh":"（缩写）专业会计硕士：以实务能力为导向的研究生学位，常用于为职业资格考试（如 CPA）做准备。"},"examples":[{"en":"She applied to an MPAcc program to meet the education requirements for the CPA exam.","zh":"她申请了 MPAcc 项目，以满足参加 CPA 考试的教育要求。"},{"en":"The MPAcc curriculum includes auditing, taxation, and financial reporting.","zh":"MPAcc 课程通常包括审计、税务和财务报告。"}]}],"synonyms":["Master of Professional Accounting","MPAc","MAcc","MACC"],"phonetic":"/ˌɛm piː ˈæk/","extraExplanation":["MPAcc 在不同学校可能写作 MPAc、MAcc 或 MACC，内容相近但侧重点可能不同：有的更偏“职业导向/实务”，有的更偏“会计学术/研究”。","在美国语境里，是否“为 CPA 做准备”取决于州的规定与个人已修学分；很多人读 MPAcc 是为了补足会计与商科课程学分并提升就业竞争力。"]}
{"word":"mpangwe","summary":{"en":"Mpangwe usually refers to the Mpongwe people (or their language) in Gabon.","zh":"Mpangwe通常指加蓬的姆蓬圭人（或其语言），常见拼写为Mpongwe。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Mpongwe people, an ethnic group in Gabon (Central Africa); also used to refer to their language (often spelled “Mpongwe”).","zh":"姆蓬圭人（加蓬的一个民族）；也可指其语言（常见拼写为“Mpongwe”）。"},"examples":[{"en":"Some historical accounts of Gabon mention the Mpangwe (Mpongwe) people living near the coast.","zh":"一些关于加蓬的历史记载会提到居住在沿海地区的姆蓬圭人（Mpangwe / Mpongwe）。"},{"en":"Researchers sometimes compare Mpangwe vocabulary with other Bantu languages in the region.","zh":"研究者有时会把姆蓬圭语（Mpangwe）词汇与当地其他班图语系语言进行比较。"}]}],"synonyms":["Mpongwe"],"phonetic":"/mˈpɑŋɡweɪ/","extraExplanation":["“Mpangwe”在英文资料中相对少见，更常见的写法是“Mpongwe”。如果你是在某本书、族谱、地图或论文里看到“Mpangwe”，它可能是地区性拼写、转写差异，或是对“Mpongwe”的误拼。","姆蓬圭人主要与加蓬沿海地区的历史与贸易接触相关；在早期欧洲文献中，他们的名称与拼写也常出现不一致。"]}
{"word":"mpatheia","summary":{"en":"mpatheia is a rare transliteration of a Greek word (often written empatheia), meaning intense emotion or, in Modern Greek, bias/prejudice.","zh":"mpatheia 是希腊语词（常写作 empatheia）的少见转写：可指强烈情感；在现代希腊语中也可指偏见/成见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Greek; uncommon in English) strong feeling, passion, or being emotionally affected—often contrasted with calm detachment.","zh":"（源自希腊语；英语中少见）强烈情感、激情，或“被情绪所影响”的状态——常与冷静的超然形成对比。"},"examples":[{"en":"In some discussions of ancient philosophy, empatheia is described as being carried away by intense emotion.","zh":"在一些关于古代哲学的讨论中，empatheia（有时也会被写作 mpatheia）被描述为“被强烈情绪带着走”。"},{"en":"The author contrasts apatheia (calm freedom from passions) with empatheia (emotional involvement).","zh":"作者把 apatheia（平静、不受激情左右）与 empatheia（情绪卷入）作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Modern Greek sense; sometimes seen in transliteration) bias, prejudice, or ill will toward someone.","zh":"（现代希腊语含义；有时以转写形式出现）偏见、成见，或对某人的恶意/敌意。"},"examples":[{"en":"He spoke with obvious empatheia, not neutrality.","zh":"他说话带着明显的偏见，而不是中立。"},{"en":"Try to set aside empatheia when judging the situation.","zh":"在判断情况时，尽量把成见放一边。"}]}],"synonyms":["passion","emotional involvement","prejudice","bias","ill will"],"phonetic":"/ɛmˈpæθiə/","extraExplanation":["“mpatheia”多见于把希腊语词转写成拉丁字母的写法：现代希腊语里“μπ”常发 /b/ 音，所以看起来像以 m 开头，但读起来更接近 b/p 音组。","它很容易和英语 empathy（同情/共情）混淆：empathy 在英语里是积极的“理解他人感受”，而现代希腊语的 empatheia/embatheia（有时写作 mpatheia）却可能带有“偏见/敌意”的意思；语境很关键。","在斯多葛哲学语境中常见对照：apatheia（不为激情所动的平静） vs. empatheia（被激情/情绪影响）。"]}
{"word":"mpb","summary":{"en":"MPB is usually an abbreviation; its exact meaning depends on context. In photography, it often refers to the used-gear retailer MPB.","zh":"MPB 通常是缩写，具体含义取决于语境；在摄影语境中常指二手器材平台 MPB。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for different phrases depending on the context (for example, a company name, an organization, or a technical term).","zh":"缩写：具体含义取决于语境（例如公司名、组织名或技术术语）。"},"examples":[{"en":"What does MPB stand for in this email?","zh":"这封邮件里的 MPB 是什么意思？"},{"en":"MPB can mean different things in different fields, so check the context.","zh":"MPB 在不同领域可能代表不同意思，所以要看语境。"}]},{"partOfSpeech":"other","definition":{"en":"(common online/tech use) a name/abbreviation for a used-camera retailer “MPB” (brand name), often discussed in photography forums.","zh":"（常见于网络/科技语境）二手相机与器材平台“MPB”的名称/简称，常见于摄影论坛。"},"examples":[{"en":"I bought a used lens from MPB.","zh":"我在 MPB 买了一个二手镜头。"},{"en":"MPB listed the camera as “excellent condition.”","zh":"MPB 把这台相机标成“成色很好”。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"ˌɛm piː ˈbiː","extraExplanation":["“MPB”最常见的情况是首字母缩写（initialism），读字母音：M-P-B。因为它不是一个固定含义的普通单词，所以你需要结合出现的领域（摄影、公司/机构、某个项目名等）来判断。","如果你把“MPB”出现的完整句子或截图发来，我可以帮你准确判断它在那里的具体意思。"]}
{"word":"mpbs","summary":{"en":"“MPBS” is usually an acronym, not a common word; its meaning depends on context.","zh":"“MPBS”通常是缩写而非常见单词；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"MPBS is not a standard English word; it is usually an acronym. Its meaning depends on the field (for example, science, education, or a company name).","zh":"MPBS 不是常见的英语单词，通常是一个缩写；具体含义取决于使用领域（如科研、教育或机构名称）。"},"examples":[{"en":"I saw “MPBS” in the manual, but it wasn’t defined—what does it stand for here?","zh":"我在说明书里看到了“MPBS”，但没有解释——这里它代表什么？"},{"en":"Could you share the sentence where “MPBS” appears so I can interpret it correctly?","zh":"你能把“MPBS”出现的句子发我吗？这样我才能准确判断含义。"}]}],"phonetic":"/ˌɛm.piː.biːˈɛs/","extraExplanation":["“MPBS”可能出现在不同语境里：\n- 实验/生物医学：有时会指某种“改良/配方版的 PBS（磷酸盐缓冲盐水）”，但各实验室命名不一，需要看配方或全文第一次出现时的定义。\n- 教育/学位/机构：也可能是学校项目、证书或机构名称的缩写。\n如果你告诉我它来自哪里（论文、试剂标签、课程介绍、聊天内容等）并贴出前后一句，我可以给出最贴切的释义和用法。"]}
{"word":"mpg","summary":{"en":"“mpg” means miles per gallon, a common measure of fuel economy.","zh":"“mpg”指“每加仑英里数”，是常见的燃油经济性（油耗效率）指标。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) miles per gallon: a measure of a vehicle’s fuel efficiency—how many miles it can travel using one gallon of fuel.","zh":"（缩写）每加仑英里数：衡量车辆燃油效率的单位——每消耗一加仑燃油可以行驶多少英里。"},"examples":[{"en":"This car gets about 35 mpg on the highway.","zh":"这辆车在高速公路上大约能达到每加仑35英里。"},{"en":"Higher mpg usually means you spend less money on gas.","zh":"mpg越高通常表示你花在汽油上的钱越少。"},{"en":"The sticker shows the city and highway mpg ratings.","zh":"车贴上标明了城市和高速路况下的mpg油耗（效率）评级。"}]}],"synonyms":["miles per gallon","fuel economy","gas mileage"],"phonetic":"/ˌɛm piː ˈdʒiː/","extraExplanation":["mpg常见于美国等使用英制单位的地区；在很多国家/地区更常用“L/100 km（百公里油耗）”。注意：mpg越高越省油，而L/100 km越低越省油。","在英国有时会写成“mpg (UK)”或“imperial mpg”，因为英制加仑（Imperial gallon）比美制加仑（US gallon）更大，所以数值不能直接对比。"]}
{"word":"mph","summary":{"en":"“mph” means miles per hour, a common unit of speed.","zh":"“mph”表示“英里/小时”，是常见的速度单位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for “miles per hour,” a unit for measuring speed (how many miles are traveled in one hour).","zh":"“miles per hour（英里/小时）”的缩写，用于表示速度（1小时行驶多少英里）。"},"examples":[{"en":"The speed limit here is 65 mph.","zh":"这里的限速是每小时65英里（65 mph）。"},{"en":"He was driving at 80 mph on the highway.","zh":"他在高速公路上以每小时80英里（80 mph）行驶。"},{"en":"The wind reached 50 mph during the storm.","zh":"暴风雨期间风速达到每小时50英里（50 mph）。"}]}],"synonyms":["miles per hour"],"phonetic":"/ˌɛm piː ˈeɪtʃ/","extraExplanation":["mph 常见于美国等使用英制单位的国家/地区（如路牌限速、汽车仪表盘、天气预报风速）。","换算：1 mph ≈ 1.609 km/h（公里/小时）。例如 60 mph ≈ 96.6 km/h。","书写时通常小写 mph；读出来一般是逐字母读 “em-pee-aitch”。"]}
{"word":"mphps","summary":{"en":"mphps = miles per hour per second (acceleration).","zh":"mphps = 每小时英里每秒（加速度单位）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An informal abbreviation for “miles per hour per second,” a unit describing how quickly speed changes (acceleration).","zh":"“每小时英里每秒”的非正式缩写，用来表示速度变化的快慢（加速度）。"},"examples":[{"en":"The car’s acceleration is about 5 mphps from 0 to 30 mph.","zh":"这辆车从 0 加速到 30 英里/小时的加速度大约是 5 mphps。"},{"en":"Engineers prefer m/s², but some people use mphps when talking about cars.","zh":"工程上更常用 m/s²，但谈汽车时有些人会用 mphps。"}]}],"synonyms":["mph/s","miles per hour per second","acceleration (informal context)"],"phonetic":"/ˌɛm piː ˌeɪtʃ piː ˈɛs/","extraExplanation":["mphps 不是很标准、也不常见的书写方式；更常见的是写成 “mph/s” 或直接用国际单位 “m/s²”。","换算思路：1 mph ≈ 0.44704 m/s，所以 1 mphps（1 mph 每秒）≈ 0.44704 m/s²。"]}
{"word":"MPI","summary":{"en":"MPI most often means Message Passing Interface (a standard for communication in parallel computing), but it can also mean maximum permissible intake or a general process-improvement term depending on context.","zh":"MPI 最常见指消息传递接口（并行计算通信标准），也可能指最大允许摄入量或泛指流程改进，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Message Passing Interface: a standard (set of rules and functions) for sending data between many computers or processors so they can work together on one task (common in high-performance computing).","zh":"消息传递接口：一种标准（规则与函数集合），用于在多台计算机或多个处理器之间传递数据，从而协同完成同一计算任务（常见于高性能计算）。"},"examples":[{"en":"Many supercomputer applications use MPI to communicate between nodes.","zh":"许多超级计算机应用使用 MPI 在计算节点之间通信。"},{"en":"Our simulation scales better after we rewrote the code with MPI.","zh":"我们用 MPI 重写代码后，模拟的扩展性更好了。"}]},{"partOfSpeech":"n.","definition":{"en":"Maximum Permissible/Permitted Intake: the largest amount of a substance considered safe to take in over a certain time (used in health, toxicology, or regulations).","zh":"最大允许（摄入）量：在一定时间内被认为安全的某种物质的最高摄入量（用于健康、毒理或法规语境）。"},"examples":[{"en":"Check the MPI for this additive before setting the dosage.","zh":"在确定剂量前，先查看这种添加剂的 MPI（最大允许摄入量）。"},{"en":"Regulations list the MPI values for several contaminants.","zh":"法规列出了多种污染物的 MPI 数值。"}]},{"partOfSpeech":"n.","definition":{"en":"Management/Manufacturing Process Improvement: a general business phrase meaning efforts to improve how work is done (the exact meaning depends on the organization).","zh":"管理/制造流程改进：泛指提升工作流程与效率的改进活动（具体含义依组织而定）。"},"examples":[{"en":"The team presented an MPI plan to reduce defects on the line.","zh":"团队提出了一份 MPI（流程改进）计划，以减少产线缺陷。"},{"en":"MPI initiatives often focus on speed, quality, and cost.","zh":"MPI 改进项目通常聚焦速度、质量与成本。"}]}],"synonyms":["Message Passing Interface (for the computing meaning)"],"phonetic":"/ˌɛm piː ˈaɪ/","extraExplanation":["“MPI”最常见的含义是在计算机领域的 Message Passing Interface（消息传递接口）。如果你是在读论文、做并行计算/超算/集群相关课程，通常就是这个意思。","因为是缩写，口语里常直接读字母：M-P-I。不同专业里也可能指其他术语（例如法规中的最大允许摄入量）。如果你告诉我上下文（如课程/行业/句子），我可以帮你锁定最准确的释义。"]}
{"word":"mpondo","summary":{"en":"Mpondo refers to a Xhosa-speaking ethnic group in South Africa (and sometimes their dialect), traditionally linked to the Pondoland/Mpondoland region.","zh":"Mpondo 指南非科萨语族群中的姆庞多人（有时也指其方言），传统上与庞多兰/姆庞多兰地区相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South African ethnic group (part of the Xhosa-speaking peoples), traditionally associated with the Pondoland/Mpondoland region on the country’s southeast coast.","zh":"南非的一个民族（属科萨语族群的一支），传统上与该国东南海岸的庞多兰/姆庞多兰地区有关。"},"examples":[{"en":"Many Mpondo people live in South Africa’s Eastern Cape and speak varieties of isiXhosa.","zh":"许多姆庞多人居住在南非东开普省，并使用科萨语（isiXhosa）的不同变体。"},{"en":"The museum has an exhibit on Mpondo history and coastal life in Pondoland.","zh":"这家博物馆有一个展区介绍姆庞多人的历史以及庞多兰的海岸生活。"}]},{"partOfSpeech":"n.","definition":{"en":"the language variety/dialect associated with the Mpondo people (often treated as a variety of isiXhosa).","zh":"与姆庞多人相关的语言变体/方言（常被视为科萨语 isiXhosa 的一种变体）。"},"examples":[{"en":"She can understand Mpondo, but she usually speaks standard isiXhosa at school.","zh":"她能听懂姆庞多方言，但在学校通常说标准科萨语。"}]}],"synonyms":["Pondo","amaMpondo","Mpondoland","Pondoland"],"phonetic":"/ɛmˈpɑndoʊ/","extraExplanation":["“Mpondo”也常写作“Pondo”，复数/族群称呼常见“amaMpondo”（在班图语系中，前缀 ama- 常用于表示“人/族群”的复数）。","“Mpondoland / Pondoland”（姆庞多兰/庞多兰）是历史与地理称呼，主要位于南非东开普省沿海一带；在文化与历史语境中常用来指姆庞多人传统居住区域。"]}
{"word":"mposp","summary":{"en":"“mposp” isn’t a standard English word; it’s likely a typo or a context-specific abbreviation.","zh":"“mposp”不是标准英文单词；更可能是拼写错误或特定语境下的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Unknown word or abbreviation. It may be a typo or a short form used in a specific field (e.g., texting, gaming, medicine, or logistics).","zh":"未知单词或缩写。可能是拼写错误，或是在特定领域（如聊天、游戏、医学、物流等）使用的简写。"},"examples":[{"en":"I couldn’t find “mposp” in a dictionary—could you share the full sentence?","zh":"我在词典里找不到“mposp”——你能把它放在完整句子里吗？"},{"en":"If you meant “MPOS,” the meaning depends on the context (business, tech, etc.).","zh":"如果你想写的是“MPOS”，它的含义取决于语境（商业、科技等）。"}]}],"extraExplanation":["“mposp”看起来不像常见英文单词，更像：\n1）打字时多/少了一个字母（例如想写 mops / pops / posed / post）；\n2）某个领域的缩写（需要行业语境才能确定）；\n3）用户名、项目代号或文件名。\n\n你可以把它出现的原句、所在话题/行业（比如网购、学校作业、编程、医疗）发我，我就能更准确判断。"]}
{"word":"mpret","summary":{"en":"“mpret” is not a standard English word; you probably mean “interpret” (explain/understand, or translate spoken language).","zh":"“mpret”不是标准英语单词；你可能想写“interpret”（解释/理解，或做口译）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or incomplete spelling of “interpret.”","zh":"不是标准英语单词。更可能是拼写错误或“interpret（解释；理解；口译）”的残缺拼写。"},"examples":[{"en":"I think you meant “interpret,” not “mpret.”","zh":"我猜你想写的是“interpret”，不是“mpret”。"},{"en":"Could you interpret this sentence for me?","zh":"你能帮我解释一下这句话吗？"}]},{"partOfSpeech":"v.","definition":{"en":"(If you meant “interpret”) to explain the meaning of something, or to understand something in a particular way.","zh":"（如果你想写“interpret”）解释某事的含义；或以某种方式理解某事。"},"examples":[{"en":"Different people interpret the same message differently.","zh":"不同的人会以不同方式理解同一条信息。"},{"en":"How do you interpret his silence?","zh":"你怎么理解他的沉默？"}]},{"partOfSpeech":"v.","definition":{"en":"(If you meant “interpret”) to translate spoken words from one language to another (interpreting).","zh":"（如果你想写“interpret”）口译：把一种语言的口头表达译成另一种语言。"},"examples":[{"en":"She interprets between English and Chinese at meetings.","zh":"她在会议上做英汉口译。"},{"en":"The interpreter interpreted the speaker’s jokes clearly.","zh":"口译员把演讲者的笑话翻译得很清楚。"}]}],"synonyms":["explain","understand","translate","construe"],"phonetic":"\u0000n\u0000t\u0000\u0000rpr\u0000t","extraExplanation":["“interpret”常见搭配：interpret something as...（把……理解为……）、interpret for someone（为某人做口译）。","如果你告诉我“mpret”出现的完整句子/上下文，我可以更准确判断你想表达的词。"]}
{"word":"MPS","summary":{"en":"MPS is an abbreviation that can mean Members of Parliament (MPs), metres per second (m/s), or mucopolysaccharidosis (a medical condition), depending on context.","zh":"MPS 是缩写，常见含义包括：国会议员（MP 的复数）、米每秒（m/s）、以及黏多糖贮积症（医学），需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(UK & some countries) Member of Parliament (singular: MP; plural: MPs). An elected person who represents a district in a national parliament.","zh":"（英国及部分国家）国会议员（单数 MP；复数 MPs）。指在国家议会中代表某个选区的民选代表。"},"examples":[{"en":"She wrote to her local MPs about the new housing policy.","zh":"她写信给本地区的国会议员，讨论新的住房政策。"},{"en":"Several MPs voted against the bill.","zh":"几位国会议员投票反对这项法案。"}]},{"partOfSpeech":"n.","definition":{"en":"Metres per second (m/s). A unit of speed.","zh":"米每秒（m/s）。速度单位。"},"examples":[{"en":"The wind speed reached 20 mps during the storm.","zh":"暴风雨期间风速达到了每秒 20 米。"},{"en":"The rocket’s velocity was measured in mps.","zh":"火箭的速度用米每秒来测量。"}]},{"partOfSpeech":"n.","definition":{"en":"Mucopolysaccharidosis (medical). A group of rare genetic disorders that affect how the body breaks down certain sugars.","zh":"黏多糖贮积症（医学）。一组罕见遗传病，影响身体分解某些糖类物质的方式。"},"examples":[{"en":"The doctor discussed testing for MPS after noticing certain symptoms.","zh":"医生在注意到一些症状后，讨论了进行黏多糖贮积症（MPS）检测。"},{"en":"Families may seek support groups for children with MPS.","zh":"有 MPS 患儿的家庭可能会寻找互助支持团体。"}]}],"synonyms":["MPs (for Members of Parliament)","m/s (for metres per second)"],"phonetic":"/ˌɛm piˈɛs/","extraExplanation":["“MPS”是缩写，具体含义强烈依赖语境：政治新闻里常指“议员（MP 的复数）”；理工科文本里可能被当作“米每秒”；医疗语境里则可能指“黏多糖贮积症”。阅读时可通过周围词（如 bill/vote、speed/velocity、symptoms/genetic）来判断。"]}
{"word":"mptus","summary":{"en":"Impetus means a driving force or motivation that makes something start or progress faster.","zh":"Impetus 指促使某事开始或加速发展的推动力/动力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Most likely) a force, event, or motivation that makes something happen or speeds it up; a driving push.","zh":"（很可能是）推动某事发生或加速发展的力量、事件或动机；推动力。"},"examples":[{"en":"The new funding gave the project fresh impetus.","zh":"新的资金为项目带来了新的推动力。"},{"en":"Public anger was the impetus for the policy change.","zh":"公众的愤怒是政策改变的推动因素。"}]}],"synonyms":["driving force","motivation","momentum","spur","catalyst"],"phonetic":"/ˈɪm.pə.təs/","extraExplanation":["你输入的“mptus”在英语中不是常见单词，最接近、最常用的词是 **impetus**（常见拼写容易漏掉开头的 i 或中间的 e）。\n\n**用法提示**：impetus 常与 give/provide/serve as 搭配：\n- give/provide the impetus for…（为……提供推动力）\n- serve as an impetus to…（成为促使……的因素）\n\n**词源小背景**：来自拉丁语，原意与“推动、冲击”有关，所以它既可以指“外部推力”（事件/环境带来的推动），也可以指“内在动力”（动机）。"]}
{"word":"MPV","summary":{"en":"MPV is an abbreviation most commonly meaning a multi-purpose vehicle (a family car with flexible seating). It can also mean mean platelet volume (medical) or most probable value (statistics).","zh":"MPV 是缩写，最常见指多用途车（座位灵活的家用车）。它也可指医学中的平均血小板体积，或统计中的最可能值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in cars) a multi-purpose vehicle: a family car with a tall body and flexible seating for passengers and luggage (also called a minivan in American English).","zh":"（尤指汽车）多用途车：车身较高、座位灵活，可载人也可装载行李的家用车型（美式英语中常称 minivan）。"},"examples":[{"en":"We bought an MPV because we needed space for two kids and a stroller.","zh":"我们买了辆 MPV，因为需要放得下两个孩子和婴儿车的空间。"},{"en":"This MPV has fold-flat seats, so it’s easy to carry bikes or luggage.","zh":"这款 MPV 的座椅可以放平，所以装自行车或行李很方便。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) mean platelet volume: a blood-test measurement of the average size of platelets.","zh":"（医学）平均血小板体积：血液检测中衡量血小板平均大小的指标。"},"examples":[{"en":"The lab report shows an MPV slightly above the normal range.","zh":"化验单显示 MPV 略高于正常范围。"},{"en":"Your doctor may look at platelet count together with MPV.","zh":"医生可能会把血小板计数和 MPV 一起参考。"}]},{"partOfSpeech":"n.","definition":{"en":"(statistics) most probable value: the value that is most likely to occur (often used in measurement and estimation contexts).","zh":"（统计）最可能值：最有可能出现的数值（常见于测量与估计语境）。"},"examples":[{"en":"We calculated the MPV from repeated measurements.","zh":"我们根据重复测量计算了最可能值（MPV）。"}]}],"synonyms":["multi-purpose vehicle","minivan (common US term for the car meaning)"],"phonetic":"ˌɛm piː ˈviː","extraExplanation":["MPV 是缩写，在不同领域含义差别很大。日常生活里最常见的是汽车领域的 “multi-purpose vehicle”。在体检/化验单里看到 MPV 通常指 “mean platelet volume”。如果你告诉我出现场景（汽车广告、化验单、论文等），我可以帮你确定最准确的含义。"]}

