{"word":"MV","summary":{"en":"MV is an abbreviation most commonly meaning “music video,” but it can also mean “mean value,” “motor vehicle,” or “millivolt,” depending on context.","zh":"MV是缩写，最常见指“音乐录影带”，也可能指“平均值”“机动车”或“毫伏”，需根据语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"music video; a short film made to accompany a song, often used for promotion.","zh":"音乐录影带；为配合歌曲制作的短片，常用于宣传推广。"},"examples":[{"en":"Have you seen the new MV for her latest single?","zh":"你看过她最新单曲的MV吗？"},{"en":"The band released an MV on YouTube yesterday.","zh":"乐队昨天在YouTube发布了一个MV。"}]},{"partOfSpeech":"other","definition":{"en":"mean value; the average value in math, science, or statistics (often written as MV in notes).","zh":"平均值；数学、科学或统计中“平均”的数值（笔记里常写MV）。"},"examples":[{"en":"The MV of the test scores is 82.","zh":"这些测试分数的平均值是82。"},{"en":"First find the MV, then compare each result to it.","zh":"先求平均值，然后把每个结果与它比较。"}]},{"partOfSpeech":"other","definition":{"en":"motor vehicle; a vehicle with an engine, such as a car or motorcycle (common in legal/official contexts).","zh":"机动车；带发动机的交通工具，如汽车或摩托车（常见于法律/官方语境）。"},"examples":[{"en":"MV registration must be renewed every year.","zh":"机动车登记必须每年续办。"},{"en":"Driving an MV without a license is illegal.","zh":"无证驾驶机动车是违法的。"}]},{"partOfSpeech":"other","definition":{"en":"millivolt; a unit of electric potential equal to one thousandth of a volt (mV; sometimes typed as MV).","zh":"毫伏；电压单位，等于千分之一伏特（标准写法是mV，有时会被打成MV）。"},"examples":[{"en":"The sensor output is about 20 mV.","zh":"该传感器输出大约是20毫伏。"},{"en":"Measure the signal in mV to see small changes.","zh":"用毫伏来测量信号，便于观察微小变化。"}]}],"synonyms":["music video","video","mean (average)","motor vehicle","mV (millivolt)"],"phonetic":"/ˌɛm ˈvi/","extraExplanation":["在流行文化语境里，MV几乎默认指“music video”，尤其在华语、日语、韩语圈的音乐讨论中非常常见（例如“新歌MV上线了”）。","在工程/科学里表示“毫伏”时，规范写法是小写mV；写成MV可能会被误读为“兆伏（MV）”。","在不同领域同一个缩写含义差别很大，阅读时可根据上下文判断：音乐平台/粉丝讨论→music video；数据/实验→mean value或millivolt；法规/交通→motor vehicle。"]}
{"word":"mv","summary":{"en":"MV most commonly means “music video,” but it can also mean “millivolt (mV)” or “move” in some contexts.","zh":"MV 最常见的意思是“音乐录影带”，也可能表示“毫伏（mV）”或在某些场景中表示“move/一步”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"music video; a short film made to go with a song, often used for promotion","zh":"音乐录影带；配合歌曲拍摄的短片，常用于宣传"},"examples":[{"en":"Have you seen the MV for that new song?","zh":"你看过那首新歌的 MV 吗？"},{"en":"The band released an MV on YouTube.","zh":"乐队在 YouTube 上发布了一个 MV。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for millivolt, a unit of electric potential equal to one thousandth of a volt","zh":"毫伏（millivolt）的缩写；电压单位，等于一伏特的千分之一"},"examples":[{"en":"The sensor output is about 3 mV.","zh":"这个传感器的输出大约是 3 毫伏。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for move (used in notes, chess, games, or file names)","zh":"move（移动/一步）的缩写（常见于笔记、棋类/游戏或文件名中）"},"examples":[{"en":"Best mv: push the pawn to e4.","zh":"最佳一步（mv）：把兵走到 e4。"}]}],"synonyms":["music video","video","promo video"],"phonetic":"/ˌɛm ˈviː/","extraExplanation":["在中文网络语境里，MV 最常指“音乐录影带”，常见写法有“发新歌+MV”“MV 上线”。","大小写有时会影响含义：mV（小写 m）更常用于物理单位“毫伏”；MV（大写）更常指音乐录影带。"]}
{"word":"Mvezo","summary":{"en":"Mvezo is a village in South Africa’s Eastern Cape, famous as Nelson Mandela’s birthplace.","zh":"Mvezo是南非东开普省的一个村庄，以纳尔逊·曼德拉的出生地而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small village in the Eastern Cape of South Africa, best known as the birthplace of Nelson Mandela","zh":"南非东开普省的一个小村庄，最著名的是纳尔逊·曼德拉的出生地"},"examples":[{"en":"Nelson Mandela was born in Mvezo in 1918.","zh":"纳尔逊·曼德拉于1918年出生在Mvezo。"},{"en":"Many visitors to the Eastern Cape learn about Mandela’s early life by traveling to Mvezo.","zh":"许多到东开普省的游客会前往Mvezo了解曼德拉的早年生活。"}]}],"phonetic":"/əmˈveɪzoʊ/","extraExplanation":["“Mvezo”通常作为专有名词使用（地名），不需要加冠词the。","该地与南非反种族隔离历史的公众记忆联系紧密；在阅读传记或历史文章时，常与“Mandela”“Transkei（旧称）”“Mthatha（附近城市）”“Eastern Cape”一起出现。"]}
{"word":"MVP","summary":{"en":"MVP can mean “Most Valuable Player” (sports) or “Minimum Viable Product” (business/tech).","zh":"MVP可指“最有价值球员”（体育）或“最小可行产品”（商业/科技）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Most Valuable Player: the best or most important player in a game, match, or season (common in sports).","zh":"最有价值球员：在一场比赛或一个赛季中表现最好、贡献最大的一名运动员（常用于体育）。"},"examples":[{"en":"She was named the MVP of the tournament after scoring the winning goal.","zh":"她在决赛打进制胜球后，被评为本次锦标赛的MVP。"},{"en":"LeBron won the NBA Finals MVP.","zh":"勒布朗获得了NBA总决赛MVP。"}]},{"partOfSpeech":"n.","definition":{"en":"Minimum Viable Product: the simplest version of a product that can be released to test an idea and learn from users (common in business and tech).","zh":"最小可行产品：为了验证想法并从用户反馈中学习而发布的“功能最少但能用”的产品版本（常用于商业与科技）。"},"examples":[{"en":"We’ll launch an MVP first to see if customers actually want this feature.","zh":"我们会先发布一个MVP，看看用户到底想不想要这个功能。"},{"en":"The app’s first MVP only had sign-up and basic messaging.","zh":"这个应用的第一版MVP只有注册和基础消息功能。"}]}],"synonyms":["Most Valuable Player","Minimum Viable Product"],"phonetic":"/ˌɛm vi ˈpi/","extraExplanation":["MVP是缩写（initialism），通常逐字母读作“em-vee-pee”。在体育语境里，多指“最有价值球员”；在创业/产品语境里，多指“最小可行产品”。判断含义主要看上下文：出现比赛、球员、赛季等词时多为体育；出现产品、上线、用户反馈、迭代等词时多为商业/科技。","常见搭配：win the MVP（赢得MVP）、named MVP（被评为MVP）；build/launch an MVP（做/发布MVP）、MVP release（MVP版本）。"]}
{"word":"mvp","summary":{"en":"MVP most commonly means “Most Valuable Player,” and it can also mean “minimum viable product” in startups/tech.","zh":"MVP最常见指“最有价值球员”，在创业/科技领域也常指“最小可行产品”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Most Valuable Player: the player judged to be the best or most important in a game, series, or season.","zh":"最有价值球员：在一场比赛、系列赛或整个赛季中被评为表现最佳或贡献最大的球员。"},"examples":[{"en":"She won the finals MVP after scoring 30 points.","zh":"她在决赛砍下30分，获得总决赛MVP。"},{"en":"The crowd chanted his name when he accepted the MVP award.","zh":"他领取MVP奖时，观众高喊他的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"Minimum viable product: the simplest version of a product that can be released to test an idea and learn from users.","zh":"最小可行产品：能上线用来验证想法、收集用户反馈的最简版本产品。"},"examples":[{"en":"Our MVP is just a landing page and a signup form.","zh":"我们的MVP只是一个落地页加报名表单。"},{"en":"They built an MVP to test demand before investing more money.","zh":"他们先做MVP测试需求，再投入更多资金。"}]},{"partOfSpeech":"n.","definition":{"en":"Model–View–Presenter: a software design pattern that separates data, the user interface, and presentation logic.","zh":"模型-视图-展示器：一种软件设计模式，用来分离数据、界面和展示逻辑。"},"examples":[{"en":"The app uses MVP to keep the UI code cleaner.","zh":"这个应用用MVP让界面代码更清晰。"}]}],"synonyms":["Most Valuable Player","minimum viable product","best player","top performer"],"phonetic":"/ˌɛmˌviːˈpiː/","extraExplanation":["在北美体育语境里，MVP非常常见：NBA、NFL、MLB、NHL等联赛都有“常规赛MVP”，季后赛还可能有“Finals MVP（总决赛MVP）”。日常口语里也会夸人“你是今天的MVP”，表示“你最给力/你最关键”。","在创业与产品语境中，MVP强调“用最小成本尽快验证”，不等于“做得很粗糙”，关键是能测试核心假设并获取真实反馈。"]}

