{"word":"nce","summary":{"en":"NCE is an abbreviation with different meanings depending on context; common uses include “New Chemical Entity” (medicine) and “National Certificate in Education” (Nigeria).","zh":"NCE 是一个依语境而变的缩写；常见用法包括医药领域的“新化学实体”和尼日利亚教育体系的“国家教育证书”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) Used for several different names; the meaning depends on the field or country (e.g., education, medicine, engineering).","zh":"（缩写）可代表多个不同名称；具体含义取决于领域或国家（如教育、医药、工程等）。"},"examples":[{"en":"On the form, NCE stands for a specific program name—check the instructions for the exact meaning.","zh":"在这份表格里，NCE 代表某个项目名称——请查看说明以确认具体含义。"},{"en":"In drug development, researchers may describe a medicine as an NCE.","zh":"在药物研发中，研究人员可能会把某种药物称为 NCE。"}]},{"partOfSpeech":"other","definition":{"en":"(medicine/pharmacy) New Chemical Entity: a drug with an active ingredient that has not been approved before.","zh":"（医药/药学）New Chemical Entity（新化学实体）：指活性成分此前未获批准的新药。"},"examples":[{"en":"The company announced its first NCE in ten years.","zh":"该公司宣布这是十年来首个新化学实体（NCE）。"},{"en":"An NCE often requires extensive safety testing before approval.","zh":"新化学实体（NCE）通常在获批前需要大量安全性测试。"}]},{"partOfSpeech":"other","definition":{"en":"(education, Nigeria) National Certificate in Education: a teaching qualification, often from a college of education.","zh":"（教育，尼日利亚）National Certificate in Education（国家教育证书）：常见于师范/教育学院的教师资格证书。"},"examples":[{"en":"She earned her NCE and started teaching primary school.","zh":"她取得了 NCE，然后开始在小学任教。"},{"en":"Many colleges offer NCE programs for future teachers.","zh":"许多学院为未来教师提供 NCE 课程。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌɛn siː ˈiː/","extraExplanation":["“NCE”是首字母缩写，最常见的读法是逐个字母读（/ˌɛn siː ˈiː/）。由于它在不同领域含义差异很大，最好结合你看到它的场景（例如药品研发报告、学校/证书文件、考试或机构名称）来确定具体指什么。","如果你本来想输入的是“nice”，请告诉我，我可以改为解释“nice”的词义与用法。"]}
{"word":"NCEE","summary":{"en":"NCEE most commonly refers to China’s National College Entrance Examination (the Gaokao).","zh":"NCEE 最常指中国的普通高等学校招生全国统一考试（高考）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in China) the National College Entrance Examination; the official annual exam used for admission to most Chinese universities (commonly called the “Gaokao”).","zh":"（中国）普通高等学校招生全国统一考试；中国大多数高校录取使用的全国性统一考试（俗称“高考”）。"},"examples":[{"en":"She’s studying day and night for the NCEE this June.","zh":"她正在为今年六月的高考（NCEE）日夜备考。"},{"en":"Your NCEE score can strongly affect which universities you can apply to.","zh":"高考（NCEE）成绩会很大程度影响你能报考哪些大学。"},{"en":"Many families travel to the test center together on NCEE days.","zh":"高考（NCEE）期间，很多家庭会一起送考到考点。"}]}],"synonyms":["Gaokao","National College Entrance Examination"],"phonetic":"/ˌɛn siː iː iː/","extraExplanation":["NCEE 是英文缩写，中文通常说“高考”或“全国统一高考”。在英文新闻、研究报告或教育话题中，有时会用 NCEE 来指代高考。","严格来说，“Gaokao”是拼音借词（更常见、更口语化），而 NCEE 更像是正式文件或学术语境里的写法。"]}
{"word":"nch","summary":{"en":"“nch” isn’t a standard word; it’s often a typo for “inch” (2.54 cm) or an abbreviation whose meaning depends on context.","zh":"“nch”不是标准单词；常见为“inch（英寸=2.54厘米）”的拼写错误，或是需结合语境才能确定含义的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; often seen as a typo for “inch” or as an abbreviation (e.g., in organization names).","zh":"本身不是标准英语单词；常见于把“inch（英寸）”少打了字母 i 的拼写错误，或作为缩写（如机构/医院名称中的 NCH）。"},"examples":[{"en":"I think you meant “inch,” not “nch.”","zh":"我觉得你想写的是“inch（英寸）”，不是“nch”。"},{"en":"NCH can be an abbreviation, but its meaning depends on the context.","zh":"NCH 可能是缩写，但具体含义取决于上下文。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a unit of length equal to 2.54 centimeters.","zh":"（很可能你想查的词）英寸：长度单位，等于 2.54 厘米。"},"examples":[{"en":"The screen is 13 inches wide.","zh":"这个屏幕宽 13 英寸。"},{"en":"Cut the wood into one-inch pieces.","zh":"把木头切成 1 英寸长的小段。"},{"en":"Move it an inch to the left.","zh":"把它往左移一英寸。"}]}],"synonyms":["(for inch) in. (abbrev.)","(for inch) 2.54 cm"],"phonetic":"/ɪntʃ/","extraExplanation":["“nch”单独出现时信息不足，无法确定是拼写错误还是某个专有名词缩写。你可以告诉我它出现在哪句话里、属于哪个领域（聊天、医学、学校、文件名等），我就能给出更准确的释义。"]}
{"word":"nchen","summary":{"en":"“nchen” is not a standard English word; it’s likely a typo or a name—please provide context.","zh":"“nchen”不是标准英语单词；很可能是拼写错误或姓名缩写——请提供上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo, a name/username, or a fragment of another word.","zh":"不是标准英语单词。更可能是拼写错误、人名/用户名，或某个单词的一部分。"},"examples":[{"en":"I couldn’t find “nchen” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“nchen”——你能把它出现的句子发我吗？"},{"en":"Did you mean “kitchen,” “chen,” or a person’s name like “N. Chen”?","zh":"你是不是想写“kitchen（厨房）”、“chen”，或者像“N. Chen（陈某/陈姓）”这样的名字？"}]}],"phonetic":"ˈɛn.tʃɛn","extraExplanation":["“nchen”本身不像常见英语单词。它可能是：\n1）打字漏了前面的字母（例如想写 kitchen）；\n2）姓名/缩写（如 N. Chen）；\n3）外来语或专有名词的一部分。\n把它所在的整句或来源（截图/网页）发来，我可以帮你准确判断。"]}
{"word":"nco","summary":{"en":"NCO means “non-commissioned officer,” a military leader such as a sergeant or corporal.","zh":"NCO 指“non-commissioned officer（士官）”，如中士、下士等基层军队领导。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a non-commissioned officer: a military leader (such as a sergeant or corporal) who has authority but is not a commissioned officer","zh":"士官；军士：军队中的基层领导（如中士、下士等），有管理与指挥权，但不属于“委任军官”"},"examples":[{"en":"As an NCO, she is responsible for training new soldiers.","zh":"作为一名士官，她负责训练新兵。"},{"en":"Talk to your NCO if you have questions about daily duties.","zh":"如果你对日常任务有疑问，去问你的士官。"},{"en":"NCOs often act as the link between officers and enlisted personnel.","zh":"士官常常充当军官与士兵之间的桥梁。"}]}],"synonyms":["non-commissioned officer","sergeant (often, but not always)","corporal (often, but not always)"],"phonetic":"/ˌɛn.siːˈoʊ/","extraExplanation":["“NCO”是“non-commissioned officer”的缩写，常见于美军与北约等语境。与“commissioned officer（委任军官，如 lieutenant/captain）”不同，NCO通常由士兵体系晋升而来，强调一线带兵、训练、纪律与执行。不同国家对士官体系的军衔名称与职责细节可能略有差异。"]}
{"word":"NCP","summary":{"en":"NCP is an initialism with multiple meanings; its exact meaning depends on context (common: UK National Car Parks; also some public-health and computing uses).","zh":"NCP 是一个多义的首字母缩略词，具体含义取决于语境（常见：英国 National Car Parks；也用于部分公共卫生与计算机语境）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) An initialism used in different fields; most commonly it refers to specific organizations or technical terms, depending on context (e.g., “National Car Parks” in the UK; “Non-communicable diseases Program” in public health; “Network Control Program” in computing).","zh":"（缩写）一个在不同领域会有不同含义的首字母缩略词；常见用法取决于语境（例如英国的“National Car Parks 国家停车场公司”；公共卫生中的“非传染性疾病项目”；计算机领域的“网络控制程序/协议”）。"},"examples":[{"en":"I parked in an NCP lot near the station.","zh":"我把车停在车站附近的 NCP 停车场。"},{"en":"Check the manual to see what NCP means in this system.","zh":"查一下手册，看看在这个系统里 NCP 代表什么。"}]},{"partOfSpeech":"other","definition":{"en":"(medicine/public health, abbrev.) Non-communicable disease(s) program / prevention context (meaning varies by institution).","zh":"（医学/公共卫生，缩写）与“非传染性疾病（NCD）”相关的项目/部门/预防工作等（具体含义因机构而异）。"},"examples":[{"en":"She works on NCP projects focused on diabetes prevention.","zh":"她参与的 NCP 项目主要做糖尿病预防。"}]},{"partOfSpeech":"other","definition":{"en":"(computing, abbrev.) Network Control Program/Protocol (used in some technical documentation).","zh":"（计算机，缩写）网络控制程序/协议（见于部分技术文档）。"},"examples":[{"en":"The legacy system uses an NCP module for network management.","zh":"这个旧系统用一个 NCP 模块来做网络管理。"}]},{"partOfSpeech":"other","definition":{"en":"(UK, abbrev.) National Car Parks, a well-known parking company/brand in the United Kingdom.","zh":"（英国，缩写）National Car Parks，英国知名停车公司/品牌。"},"examples":[{"en":"There’s an NCP car park next to the theatre.","zh":"剧院旁边有一个 NCP 停车场。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌɛn siː ˈpiː/","extraExplanation":["“NCP”是首字母缩略词（initialism），通常按字母逐个读：N-C-P。它不像普通单词那样有单一固定词义，最可靠的判断方法是看它出现的领域：是在停车指示牌、医学报告、还是计算机文档里。","如果你告诉我你看到“NCP”的句子或场景（例如在哪个国家、哪份文件、哪种课程/新闻里），我可以帮你锁定它最可能的含义。"]}

