{"word":"Nd","summary":{"en":"Nd most commonly means the chemical symbol for neodymium; in very informal notes it may also stand for “and.”","zh":"Nd 最常见是钕的化学符号；在非常非正式的随手记中也可能用来代替 “and（和）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the chemical symbol for neodymium (a rare-earth metal).","zh":"钕（neodymium）的化学符号，一种稀土金属。"},"examples":[{"en":"Nd is used in magnets for headphones and electric motors.","zh":"Nd 常用于耳机和电动机的磁体中。"},{"en":"The alloy contains Nd and iron to make a strong magnet.","zh":"这种合金含有 Nd 和铁，用来制造强磁体。"}]},{"partOfSpeech":"other","definition":{"en":"an informal abbreviation sometimes used for “and,” especially in quick notes (less common than “&” or “n”).","zh":"在随手记/非正式书写中偶尔用来表示 “and（和）” 的缩写（不如 “&” 或 “n” 常见）。"},"examples":[{"en":"Bring snacks nd water.","zh":"带点零食 nd 水。"},{"en":"Me nd my friend are going later.","zh":"我 nd 我朋友等会儿去。"}]}],"synonyms":["neodymium (for the chemical meaning)"],"phonetic":"/ɛn diː/","extraExplanation":["注意大小写：在化学中通常写作 **Nd**（N 大写、d 小写）。如果写成 **ND**，在英语里更常见的是别的缩写（例如美国州名 North Dakota）。在正式写作里不建议用 “nd” 代替 “and”。"]}
{"word":"nd","summary":{"en":"“ND” is usually an abbreviation for North Dakota; it can also mean “no date” on forms or, informally, “and” in texting.","zh":"“ND”通常是北达科他州（North Dakota）的缩写；也可在表格中表示“无日期”，或在短信里非正式地表示“and”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) North Dakota (a U.S. state).","zh":"（缩写）美国北达科他州。"},"examples":[{"en":"She moved to Fargo, ND, for a new job.","zh":"她为了新工作搬到了北达科他州（ND）的法戈。"},{"en":"The conference will be held in Bismarck, ND.","zh":"会议将在北达科他州（ND）的俾斯麦举行。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., in invitations/forms) no date (the date is not provided or not decided).","zh":"（缩写，用于邀请函/表格）无日期（日期未提供或未确定）。"},"examples":[{"en":"The invitation says “Date: ND,” so we’re waiting for an update.","zh":"邀请函上写着“日期：ND（无日期）”，所以我们在等更新。"},{"en":"Please don’t write ND—enter the actual date if you know it.","zh":"请不要写ND（无日期）——如果知道就填写实际日期。"}]},{"partOfSpeech":"other","definition":{"en":"(informal texting) “and” (used in short messages; not standard writing).","zh":"（非正式短信）“and”（用于简短信息；不用于正式写作）。"},"examples":[{"en":"Bring snacks nd drinks.","zh":"带点零食和饮料。"},{"en":"I’ll call you nd explain.","zh":"我会打电话给你然后解释。"}]}],"synonyms":["North Dakota","no date","and"],"phonetic":"/ˌɛnˈdiː/","extraExplanation":["“ND”最常见、最标准的用法是美国州名 North Dakota 的邮政缩写（写地址、城市后面常见）。","在不同领域里“ND”可能有其他意思（例如医学、学术机构等），具体要看上下文。"]}
{"word":"nda","summary":{"en":"NDA most commonly means a non-disclosure agreement (a contract to keep information secret). It can also mean the U.S. National Defense Authorization Act or “no data available,” depending on context.","zh":"NDA最常见指“保密协议”（要求对信息保密的合同）。在特定语境下也可指美国《国防授权法案》，或报表里的“暂无数据”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a non-disclosure agreement: a legal contract that requires someone to keep certain information secret.","zh":"保密协议：一种法律合同，要求签约方对特定信息保密。"},"examples":[{"en":"Before I started the project, the company asked me to sign an NDA.","zh":"在我开始这个项目之前，公司要求我签一份保密协议（NDA）。"},{"en":"The NDA says I can’t share the product design with anyone outside the team.","zh":"保密协议规定我不能把产品设计分享给团队以外的任何人。"}]},{"partOfSpeech":"n.","definition":{"en":"(U.S. politics) the National Defense Authorization Act: a yearly law that sets policy and funding levels for the U.S. Department of Defense.","zh":"（美国政治）《国防授权法案》：美国每年制定的一项法律，为国防部设定政策与资金规模。"},"examples":[{"en":"Congress debated the NDA for months before passing it.","zh":"国会就《国防授权法案》（NDA）辩论了数月才通过。"},{"en":"News reports discussed what changes were included in this year’s NDA.","zh":"新闻报道讨论了今年《国防授权法案》中包含了哪些变化。"}]},{"partOfSpeech":"other","definition":{"en":"(in charts or forms) “no data available”: used when information is missing or not recorded.","zh":"（图表/表格）“暂无数据”：用于表示数据缺失或未记录。"},"examples":[{"en":"The report shows NDA for sales in April because the system was offline.","zh":"报告里四月的销售额显示为NDA（暂无数据），因为系统当时离线了。"},{"en":"If you see NDA in the table, check whether the data was entered correctly.","zh":"如果你在表格里看到NDA（暂无数据），请检查数据是否正确录入。"}]}],"synonyms":["confidentiality agreement","non-disclosure contract","secrecy agreement"],"phonetic":"/ˌɛn.diˈeɪ/","extraExplanation":["在职场里，NDA最常见的意思是“保密协议”。通常会和“confidential information（机密信息）”“trade secrets（商业秘密）”一起出现，也常在入职、合作、投资尽调时签署。","同一个缩写在不同领域含义可能完全不同：科技/商业语境优先理解为Non-Disclosure Agreement；美国新闻政治语境里可能指National Defense Authorization Act；数据报表语境里可能是No Data Available。"]}
{"word":"NDB","summary":{"en":"NDB most commonly means a non-directional beacon used for navigation; it can also mean National Development Bank in finance/government contexts.","zh":"NDB最常见指用于导航的无方向信标；在金融/政府语境中也可指国家开发银行。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(aviation) A non-directional beacon: a low-frequency radio transmitter that helps pilots and ships navigate by providing a signal they can home in on.","zh":"（航空/航海）无方向信标：一种低频无线电发射台，提供可被接收并用于“循迹”导航的信号。"},"examples":[{"en":"The pilot tuned the ADF to the NDB and tracked inbound to the airport.","zh":"飞行员把自动方向测定器（ADF）调到该NDB频率，沿信标方位飞向机场。"},{"en":"In poor visibility, the NDB approach can still help guide an aircraft toward the runway area.","zh":"在能见度差时，NDB进近仍能帮助飞机引导到跑道附近区域。"}]},{"partOfSpeech":"other","definition":{"en":"(business/government) National Development Bank: a financial institution (often government-backed) that funds long-term projects such as infrastructure and industry.","zh":"（商业/政府）国家开发银行：通常由政府支持、为基础设施和产业等长期项目提供资金的金融机构。"},"examples":[{"en":"The NDB approved a loan for renewable energy projects.","zh":"国家开发银行批准了一笔用于可再生能源项目的贷款。"},{"en":"Many countries use an NDB to support strategic industries.","zh":"许多国家会通过国家开发银行来支持战略性产业。"}]}],"synonyms":["radio beacon","navigation beacon","development bank"],"phonetic":"ˌɛn diː ˈbiː","extraExplanation":["“NDB”是缩写，在不同领域含义不同。航空里最常见的是“non-directional beacon（无方向信标）”；财经新闻里也常见“National Development Bank（国家开发银行）”。如果你告诉我出现的语境（例如航空考试/航班通话/新闻报道），我可以帮你确定最准确的释义。"]}
{"word":"ndebele","summary":{"en":"Ndebele refers to an ethnic group in Southern Africa, their Bantu language, and anything related to them.","zh":"Ndebele 指南部非洲的恩德贝莱民族、他们使用的班图语系语言，以及与之相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Southern African people found mainly in Zimbabwe and South Africa","zh":"恩德贝莱人（南部非洲的民族，主要分布于津巴布韦和南非）"},"examples":[{"en":"Many Ndebele people in Zimbabwe speak IsiNdebele at home.","zh":"津巴布韦的许多恩德贝莱人在家里说恩德贝莱语。"},{"en":"The museum has an exhibit on Ndebele history and culture.","zh":"博物馆有一个关于恩德贝莱历史与文化的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bantu language spoken by the Ndebele people (there are closely related varieties in Zimbabwe and South Africa)","zh":"恩德贝莱语（班图语系语言，由恩德贝莱人使用；在津巴布韦与南非有密切相关的变体）"},"examples":[{"en":"She is learning Ndebele to communicate with her neighbors.","zh":"她在学习恩德贝莱语，以便和邻居交流。"},{"en":"This phrasebook includes greetings in Ndebele and English.","zh":"这本会话手册包含恩德贝莱语和英语的问候语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ndebele people or their language","zh":"与恩德贝莱人或其语言有关的"},"examples":[{"en":"Ndebele traditions are an important part of the region’s identity.","zh":"恩德贝莱传统是该地区身份认同的重要组成部分。"},{"en":"He attended an Ndebele language class on weekends.","zh":"他周末去上恩德贝莱语课。"}]}],"synonyms":["IsiNdebele","Sindebele","Northern Ndebele","Southern Ndebele"],"phonetic":"/ɛnˈdɛbəli/","extraExplanation":["“Ndebele”常见两大相关群体/语言：津巴布韦的北恩德贝莱（Northern Ndebele，常写作 isiNdebele 或 Sindebele）与南非的南恩德贝莱（Southern Ndebele）。两者有亲缘关系，但并不完全相同。","恩德贝莱语属于班图语系，和祖鲁语（Zulu）等语言较接近；在语言学习与资料检索时，注意区分具体是“Northern”还是“Southern”。"]}
{"word":"ndebeles","summary":{"en":"Ndebele refers to a Southern African people and their Bantu language(s), and it can also be used as an adjective for their culture or language.","zh":"Ndebele 指南部非洲的恩德贝莱民族及其班图语言（或近缘语言群），也可作形容词表示与其文化或语言相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Southern African people living mainly in Zimbabwe and South Africa","zh":"恩德贝莱人（主要居住在津巴布韦和南非的民族成员）"},"examples":[{"en":"Many Ndebele people in Zimbabwe speak Northern Ndebele as their first language.","zh":"津巴布韦的许多恩德贝莱人以北恩德贝莱语为母语。"},{"en":"The museum featured Ndebele beadwork and painted houses.","zh":"博物馆展出了恩德贝莱人的珠饰工艺和绘有图案的房屋。"}]},{"partOfSpeech":"n.","definition":{"en":"a Bantu language (or group of closely related languages) spoken by the Ndebele people, especially Northern Ndebele (Zimbabwe) and Southern Ndebele (South Africa)","zh":"恩德贝莱语（班图语族的一种/一组近缘语言，常指津巴布韦的北恩德贝莱语与南非的南恩德贝莱语）"},"examples":[{"en":"She is learning Ndebele to talk with her grandparents.","zh":"她正在学习恩德贝莱语，好和祖父母交流。"},{"en":"The announcement was given in English and Ndebele.","zh":"通知用英语和恩德贝莱语播报。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ndebele people, their culture, or their language","zh":"恩德贝莱人的；与恩德贝莱文化或语言有关的"},"examples":[{"en":"They attended a Ndebele cultural festival.","zh":"他们参加了一个恩德贝莱文化节。"},{"en":"The school offers Ndebele language classes.","zh":"这所学校开设恩德贝莱语课程。"}]}],"synonyms":["Northern Ndebele","Southern Ndebele"],"phonetic":"/ɛnˈdɛbəli/","extraExplanation":["“ndebeles”通常是把专有名词复数化的写法；更常见的英语写法是用“Ndebele”既可指民族（可数：an Ndebele, the Ndebele），也可指语言（不可数：speak Ndebele）。","在现实使用中，“Ndebele”可能指两个主要变体：Zimbabwe 的 Northern Ndebele，以及 South Africa 的 Southern Ndebele；写作时可用“Northern/Southern Ndebele”更精确。","词首的“Nde-”来自当地语言的拼写习惯；英语里作为专名通常首字母大写：Ndebele。"]}
{"word":"ndel","summary":{"en":"“NDEL/ndel” is usually a context-dependent abbreviation, not a standard dictionary word.","zh":"“NDEL/ndel”通常是依语境而定的缩写，不是标准词典单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"NDEL is not a common standalone English word. It is usually an initialism (a set of letters) whose meaning depends on context (e.g., a company name, a database/library project, or a technical abbreviation).","zh":"NDEL 不是常见的英文单词，通常是由字母组成的缩写（首字母词），具体含义取决于语境（例如公司名、数据库/图书馆项目或技术缩写）。"},"examples":[{"en":"I couldn’t find a dictionary entry for “ndel”—is it a name or an abbreviation?","zh":"我在词典里查不到“ndel”，它是名字还是缩写？"},{"en":"In this document, NDEL refers to a specific program, so check the glossary or introduction.","zh":"在这份文件里，NDEL 指的是某个特定项目，所以请查看术语表或前言。"}]}],"phonetic":"/ˌɛn diː ˈiː ɛl/","extraExplanation":["如果你想查的是某个单词，可能是拼写输入错了。你可以再发一次，并告诉我你想表达的意思或给出一句原句（例如：它出现在什么句子里/哪个领域：医学、计算机、学校项目、公司名等）。","如果它是缩写，常见写法会大写为 NDEL；读法通常按字母读（类似“NBA”）。"]}
{"word":"ndern","summary":{"en":"“ndern” is not a recognized English word; it’s likely a misspelling (often of “modern” or “northern”).","zh":"“ndern”不是规范英语词，通常是拼写错误（常见可能是“modern”或“northern”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or incomplete spelling.","zh":"不是标准英语单词，通常是拼写错误或未打完整的词。"},"examples":[{"en":"I couldn’t find “ndern” in the dictionary—did you mean “modern” or “northern”?","zh":"词典里找不到“ndern”——你想写的是“modern（现代的）”还是“northern（北方的）”吗？"},{"en":"If you type “ndern” by accident, try checking the letters before and after it on your keyboard.","zh":"如果你是不小心打成“ndern”，可以看看键盘上它附近的字母有没有按错。"}]}],"extraExplanation":["“ndern”常见的可能目标词：\n1) modern /ˈmɑdɚn/：现代的；当代的（常用于 modern art / modern life）。\n2) northern /ˈnɔrðɚn/：北方的；北部的（常用于 Northern Europe / the northern part）。\n3) under /ˈʌndɚ/：在……下面；不足（常用于 under the table / under 18）。\n\n你可以告诉我：你看到“ndern”的句子或上下文，我就能更准确判断你要查的词。"]}
{"word":"ndi","summary":{"en":"NDI is an acronym (read “N-D-I”) with different meanings by context, often referring to the National Democratic Institute or to non-destructive inspection/testing.","zh":"NDI 是一个按字母读的缩写，含义随语境而变，常见指“国家民主研究所（National Democratic Institute）”或“无损检测/无损检验（Non-Destructive Inspection/Testing）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for several terms; most commonly used as a name of an organization or a technical acronym (exact meaning depends on context).","zh":"一个缩写，可指多个词组；最常见为组织名称或技术领域缩写（具体含义取决于语境）。"},"examples":[{"en":"In this report, NDI refers to the National Democratic Institute.","zh":"在这份报告里，NDI 指的是“国家民主研究所”。"},{"en":"Engineers performed an NDI to check the welds for cracks.","zh":"工程师做了 NDI（无损检测）来检查焊缝是否有裂纹。"}]},{"partOfSpeech":"other","definition":{"en":"National Democratic Institute (NDI): a U.S.-based nonprofit organization that supports democratic institutions and processes worldwide.","zh":"National Democratic Institute（NDI）：一家总部在美国的非营利组织，致力于支持世界各地的民主制度与民主进程。"},"examples":[{"en":"NDI ran training programs for election observers.","zh":"NDI 为选举观察员提供培训项目。"}]},{"partOfSpeech":"other","definition":{"en":"Non-Destructive Inspection / Non-Destructive Testing (NDI/NDT): methods for checking materials or structures without damaging them.","zh":"Non-Destructive Inspection（NDI，无损检测/无损检验）：在不破坏材料或结构的情况下进行检测的方法。"},"examples":[{"en":"Ultrasound and X-ray are common NDI methods.","zh":"超声和 X 光是常见的 NDI 方法。"},{"en":"The airline requires regular NDI on critical parts.","zh":"航空公司要求对关键部件进行定期 NDI 检测。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌɛn diː ˈaɪ/","extraExplanation":["“NDI”通常是按字母读（N-D-I），不是普通单词，因此需要看领域来判断含义：政治新闻里常指“National Democratic Institute”；工程、航空、制造业里常指“无损检测（Non-Destructive Inspection）”。如果你能告诉我你看到 NDI 的句子或领域，我可以给出最准确的释义与用法。"]}
{"word":"ndjamena","summary":{"en":"N'Djamena is the capital and largest city of Chad in Central Africa.","zh":"N'Djamena（恩贾梅纳）是中非国家乍得的首都兼最大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Chad, located on the Chari River near the border with Cameroon.","zh":"乍得的首都兼最大城市，位于沙里河（Chari River）畔，靠近与喀麦隆的边境。"},"examples":[{"en":"N'Djamena is the capital city of Chad.","zh":"恩贾梅纳是乍得的首都。"},{"en":"She flew to N'Djamena for work on a public health project.","zh":"她因公共卫生项目出差飞往恩贾梅纳。"},{"en":"N'Djamena sits near the meeting point of Chad and Cameroon.","zh":"恩贾梅纳靠近乍得与喀麦隆交界处。"}]}],"synonyms":["N’Djamena","Ndjamena"],"phonetic":"/ɛnˈdʒɑːmənə/","extraExplanation":["“N'Djamena”常见拼写含撇号（N’Djamena），法语影响较大；中文常译为“恩贾梅纳”。","这座城市在殖民时期曾名为“Fort-Lamy（拉米堡）”，1973年更名为N'Djamena。","在英语写作中它属于专有名词：通常首字母大写；用于地点时常与介词连用（in N'Djamena / to N'Djamena / from N'Djamena）。"]}
{"word":"ndoderm","summary":{"en":"Endoderm = the embryo’s inner germ layer that later becomes many internal organs.","zh":"Endoderm＝胚胎的内层胚层，后来形成多种内部器官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) The innermost layer of an embryo (one of the three germ layers). It later develops into organs such as the digestive tract, liver, and lungs.","zh":"（生物）内胚层：胚胎最内层的胚层（胚胎三胚层之一），之后会发育形成消化道、肝脏、肺等器官。"},"examples":[{"en":"In early development, the endoderm helps form the lining of the digestive system.","zh":"在早期发育中，内胚层有助于形成消化系统的内衬。"},{"en":"Scientists studied how signals guide cells to become endoderm.","zh":"科学家研究信号如何引导细胞分化为内胚层。"}]}],"synonyms":["germ layer (context-dependent)","inner germ layer"],"phonetic":"/ˈɛn.doʊ.dɝm/","extraExplanation":["你输入的“ndoderm”很可能是拼写错误，常见正确拼写是 **endoderm**（内胚层）。\n\n词源小提示：**endo-** 表示“内部”，**-derm** 表示“皮/层”（也见于 *dermatology* 皮肤科）。\n\n相关词：**ectoderm**（外胚层）、**mesoderm**（中胚层）。"]}
{"word":"ndola","summary":{"en":"Ndola is a city in northern Zambia’s Copperbelt region.","zh":"Ndola（恩多拉）是赞比亚北部铜带省的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northern Zambia, in the Copperbelt region; an important commercial and industrial center.","zh":"恩多拉：赞比亚北部铜带省的重要城市与工商业中心。"},"examples":[{"en":"Ndola is one of Zambia’s major cities in the Copperbelt.","zh":"恩多拉是赞比亚铜带省的主要城市之一。"},{"en":"She flew from Lusaka to Ndola for a work trip.","zh":"她从卢萨卡飞到恩多拉出差。"},{"en":"Many people in Ndola are connected to mining-related industries.","zh":"恩多拉有许多人从事与采矿相关的行业。"}]}],"phonetic":"/ənˈdoʊlə/","extraExplanation":["“Ndola”是专有名词（地名），英语里常按重音落在第二音节来读：/ənˈdoʊlə/。","恩多拉位于赞比亚的“铜带”（Copperbelt）地区，这一带因铜矿资源与相关工业而闻名。"]}

