{"word":"NFL","summary":{"en":"NFL = National Football League, the top professional American football league in the U.S.","zh":"NFL指美国国家橄榄球联盟，是美国最高级别的职业美式橄榄球联赛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"National Football League: the main professional American football league in the United States, with teams organized into the AFC and NFC and a championship game called the Super Bowl.","zh":"美国国家橄榄球联盟：美国最主要的职业美式橄榄球联赛，球队分为美联（AFC）与国联（NFC），冠军赛为“超级碗”（Super Bowl）。"},"examples":[{"en":"He watches NFL games every Sunday during the season.","zh":"赛季期间，他每个星期天都会看NFL比赛。"},{"en":"She hopes to work for an NFL team as a sports doctor.","zh":"她希望成为NFL球队的队医。"},{"en":"The Super Bowl is the NFL’s biggest event of the year.","zh":"超级碗是NFL一年中最大的赛事。"}]}],"synonyms":["National Football League"],"phonetic":"/ˌɛn.ɛfˈɛl/","extraExplanation":["“NFL”是首字母缩略词（acronym），在口语里常直接读作三个字母：N-F-L。","在英式英语中，“football”通常指足球（soccer），但在“National Football League”里指的是美式橄榄球（American football）。","学习文化语境时常会遇到相关词：draft（选秀）、playoffs（季后赛）、quarterback/QB（四分卫）、touchdown（达阵）。"]}
{"word":"NFT","summary":{"en":"NFT means “non-fungible token,” a unique blockchain-based digital certificate used to show ownership of a specific digital item.","zh":"NFT 指“非同质化代币”，是一种基于区块链的独特数字凭证，用来表示对某个特定数字物品的所有权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a non-fungible token: a unique digital certificate recorded on a blockchain that can prove ownership of a specific digital item (such as art, music, or in-game items).","zh":"非同质化代币：记录在区块链上的一种独特数字凭证，用来证明对某个特定数字物品（如艺术品、音乐、游戏道具等）的所有权。"},"examples":[{"en":"She bought an NFT of a digital artwork.","zh":"她买了一件数字艺术作品的 NFT。"},{"en":"That musician released an album as NFTs for fans.","zh":"那位音乐人把专辑做成 NFT 发行给粉丝。"},{"en":"NFT prices can rise or fall very quickly.","zh":"NFT 的价格可能涨跌得非常快。"}]}],"synonyms":["non-fungible token","digital collectible","blockchain collectible"],"phonetic":"/ˌɛn.ɛfˈtiː/","extraExplanation":["NFT 是缩写，读作字母：N-F-T。常见发音是 /ˌɛn.ɛfˈtiː/。","“non-fungible（非同质化）”的意思是“不可互换的”：例如一张演唱会门票或一幅画，每一件都不同；而“fungible（同质化）”像现金或同一种股票，每一单位通常可以互换。","日常语境里，NFT 往往指“某个数字作品的所有权凭证”，不等于作品本身的文件。即使你拥有 NFT，版权、复制与商用权是否包含，取决于发行方的条款。"]}

