{"word":"ng","summary":{"en":"“ng” can mean “not good/no good” in texting, or “nanogram” in science.","zh":"“ng”在网络里可表示“不好/不行”，在科学里可表示“纳克（nanogram）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(internet/texting) Abbreviation meaning “not good” or “no good,” used to say something is bad, disappointing, or unacceptable.","zh":"（网络/短信）缩写，表示“不好/不行/没用”，用来评价某事很差、令人失望或不可接受。"},"examples":[{"en":"The food was ng, so we left early.","zh":"食物不太行，所以我们早早就离开了。"},{"en":"My test score was ng this time.","zh":"我这次考试成绩不太好。"}]},{"partOfSpeech":"other","definition":{"en":"(science/medicine) Abbreviation for “nanogram,” a unit of mass equal to one billionth of a gram (10⁻⁹ g).","zh":"（科学/医学）“纳克/毫微克”的缩写：质量单位，等于十亿分之一克（10⁻⁹ 克）。"},"examples":[{"en":"The result was 5 ng/mL.","zh":"结果是 5 ng/mL（每毫升5纳克）。"},{"en":"This medicine is active at the ng level.","zh":"这种药在“纳克级”剂量就有效。"}]}],"synonyms":["not good","no good","bad","nanogram"],"phonetic":"/ˌɛnˈdʒiː/","extraExplanation":["“ng”在口语里通常是把字母 N 和 G 读出来：/ˌɛnˈdʒiː/。","网络用法里的“ng=not good/no good”比较随意，正式写作中不要用；更常见的表达是 “not good,” “bad,” “doesn’t work,” “not okay.”","科学单位里常见搭配有 ng/mL（纳克/毫升）、ng/L 等。"]}
{"word":"ngai","summary":{"en":"“Ngai” is most often a surname; it can also be a Cantonese-style interjection meaning “oh dear/ugh/oh well.”","zh":"“Ngai”多用作姓氏；也可作粤语式感叹词，表示“唉/烦死了/算了”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), common among people of Chinese heritage (often written 倪, 魏, or other characters depending on the family).","zh":"姓氏（常见于华人姓名；对应的汉字可能是“倪”“魏”等，因家族而异）。"},"examples":[{"en":"Professor Ngai will give a talk on Friday.","zh":"Ngai 教授将在周五做报告。"},{"en":"My classmate’s last name is Ngai.","zh":"我同学的姓是 Ngai。"}]},{"partOfSpeech":"int.","definition":{"en":"(From Cantonese romanization) An interjection used to show annoyance, impatience, or a resigned “oh well.”","zh":"（粤语拼音/转写）感叹词，表示不耐烦、烦恼，或无奈的“唉/算了”。"},"examples":[{"en":"Ngai, why is the bus always late?","zh":"唉，为什么公交车总是晚点？"},{"en":"Ngai… I guess we’ll have to try again tomorrow.","zh":"唉……看来我们只能明天再试了。"}]}],"synonyms":["(interjection) oh no","ugh","alas","oh well","aiya"],"phonetic":"/ŋaɪ/","extraExplanation":["“Ngai”在英语里不是常见词，多数情况下你会在英文语境中把它当作人名（姓）来读写。","如果你看到“ngai”作为感叹词，往往来自粤语口语的拉丁字母转写；不同地区/系统也可能写成“ai/aiya/ngaai”等近似形式。","发音提示：作为粤语音时开头常是鼻音“ng-”（像把英文sing结尾的-ng移到开头），英语母语者有时会简化成/n/开头来读。"]}
{"word":"ngaio","summary":{"en":"“Ngaio” can mean a New Zealand native coastal tree, and it is also used as a given name (often feminine) in New Zealand.","zh":"“Ngaio”既可指新西兰本土的沿海树种（ngaio 树），也可作人名（在新西兰较常见，常用于女性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Māori name used for a New Zealand coastal tree (Myoporum laetum), often called the “ngaio tree.”","zh":"毛利语名称，指新西兰海岸常见的一种树（学名 Myoporum laetum），常被称为“ngaio（恩盖奥）树”。"},"examples":[{"en":"Ngaio trees grow well near the coast because they tolerate salty wind.","zh":"Ngaio 树很适合在海边生长，因为它们耐得住含盐的海风。"},{"en":"We planted a ngaio as a native tree in the garden.","zh":"我们在花园里种了一棵 ngaio，当作本土树种。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name, especially a feminine name in New Zealand (from Māori).","zh":"人名（名字），在新西兰较常见，多用于女性（源自毛利语）。"},"examples":[{"en":"Ngaio is her first name.","zh":"Ngaio 是她的名字。"},{"en":"The author Ngaio Marsh was born in New Zealand.","zh":"作家 Ngaio Marsh 出生于新西兰。"}]}],"synonyms":["ngaio tree","Myoporum laetum"],"phonetic":"/ˈnaɪ.oʊ/","extraExplanation":["“Ngaio”源自毛利语，常见于新西兰的地名、植物名与人名。作为植物名时通常特指沿海耐风的本土树种；作为人名时在英语环境里一般保留毛利语拼写。","文学/文化提示：Ngaio Marsh（恩盖奥·马什）是新西兰著名侦探小说作家，常与阿加莎·克里斯蒂、多萝西·塞耶斯并列为“黄金时代”推理小说的重要作者之一。"]}
{"word":"ngapi","summary":{"en":"Ngapi is a Burmese fermented fish or shrimp paste used for flavoring food.","zh":"Ngapi 是缅甸常见的发酵鱼酱或虾酱，用来给食物增味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong-smelling Burmese (Myanmar) fermented fish or shrimp paste used as a seasoning, dip, or base for sauces and curries.","zh":"（缅甸/缅文常用语）一种气味浓烈的发酵鱼酱或虾酱，用作调味料、蘸酱或咖喱/酱汁的底味。"},"examples":[{"en":"Ngapi is often mixed with chili and lime to make a spicy dip.","zh":"Ngapi 常与辣椒和青柠混合，做成辛辣的蘸酱。"},{"en":"The soup tastes richer with just a small spoonful of ngapi.","zh":"汤里只加一小勺 ngapi，味道就更浓郁。"},{"en":"Some visitors find the smell of ngapi surprising at first.","zh":"一些游客一开始会觉得 ngapi 的气味很“冲”。"}]}],"synonyms":["fermented fish paste","shrimp paste","fish paste"],"phonetic":"/ˈŋɑːpi/","extraExplanation":["“Ngapi”来自缅甸语，是缅甸饮食中很重要的发酵调味品，地位有点类似东南亚的鱼露或某些地区的虾酱，但质地更像酱/膏。","常见写法有 ngapi；不同地区和原料会有不同类型（如以鱼或虾为主），用途包括做蘸酱、拌饭、炒菜、煮汤、做咖喱底味等。"]}
{"word":"NGO","summary":{"en":"NGO means a non-governmental organization, an independent group that works for public or social good.","zh":"NGO 指非政府组织，即独立于政府、以公共或社会公益为目标的团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a non-governmental organization: an independent group that is not part of the government, often working to help people or protect the environment","zh":"非政府组织：独立于政府之外的团体，常致力于人道援助、社会服务或环境保护等"},"examples":[{"en":"After the earthquake, several NGOs provided food, water, and medical care.","zh":"地震后，几家非政府组织提供了食物、饮用水和医疗救助。"},{"en":"She works for an NGO that supports children’s education in rural areas.","zh":"她在一家支持农村儿童教育的非政府组织工作。"},{"en":"The NGO partnered with local communities to protect the river.","zh":"该非政府组织与当地社区合作保护这条河流。"}]}],"synonyms":["non-governmental organization","nonprofit organization","charity","aid organization","civil society organization"],"phonetic":"/ˌɛn dʒiː ˈoʊ/","extraExplanation":["“NGO”是缩写，完整形式是“non-governmental organization”。常见于新闻、国际发展、人道救援与公共政策语境。","在不同国家语境里，NGO的法律地位和资金来源差异很大；有些主要靠捐款，有些也可能接受政府或国际机构资助，但通常强调“独立于政府运作”。","相关近义表达：nonprofit (organization)（非营利组织，范围更广，不一定从事倡议/救援）；civil society organization/CSO（公民社会组织，更偏学术与政策语境）。"]}
{"word":"ngoko","summary":{"en":"Ngoko is the informal Javanese speech level used in casual, familiar situations.","zh":"Ngoko 是爪哇语的随意体/口语体等级，常用于熟人之间或较不正式的场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Javanese) the informal or “low” speech level used with close friends, younger people, or someone of equal/lower status.","zh":"（爪哇语）“Ngoko”是较口语、较随意的语体等级，用于熟人、晚辈或地位相当/较低的人之间。"},"examples":[{"en":"He speaks ngoko with his younger brother at home.","zh":"他在家里跟弟弟说爪哇语的 ngoko（随意体）。"},{"en":"In class, students learn when ngoko is appropriate and when it is not.","zh":"在课堂上，学生会学习什么时候适合用 ngoko，什么时候不适合。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using the ngoko style (informal Javanese).","zh":"以 ngoko 语体说话的；随意体的（爪哇语）。"},"examples":[{"en":"That sentence sounds ngoko, so it may be too casual for a formal event.","zh":"那句话听起来是 ngoko 风格，所以对正式场合可能太随意了。"}]}],"synonyms":["informal Javanese","low Javanese (speech level)","basa ngoko"],"phonetic":"/ŋoʊˈkoʊ/","extraExplanation":["Ngoko 是爪哇语常见的“语言等级”（speech levels）之一，和更礼貌、更正式的 krama（克拉玛/敬语体）相对；有些地区或教材也会提到介于两者之间的 madya（中间体）。","选择 ngoko 还是 krama 往往取决于关系亲疏、年龄辈分、社会地位与场合。用错等级可能显得不礼貌或过于疏远，因此在爪哇文化语境里很重要。"]}
{"word":"ngoma","summary":{"en":"Ngoma refers to a traditional African drum and, by extension, the drumming/music, dance events, or certain ceremonial performances linked to community life.","zh":"Ngoma 指非洲传统鼓，并可引申为鼓乐、群体舞蹈活动，或与社区生活相关的某些仪式性表演。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional African drum; also the music or drumming played on it","zh":"（非洲传统）鼓；也可指鼓乐/打鼓的音乐"},"examples":[{"en":"You can hear the ngoma from the village square at night.","zh":"夜里你能从村庄广场听到恩戈玛鼓声。"},{"en":"The dancers moved faster as the ngoma grew louder.","zh":"随着恩戈玛鼓声变大，舞者的动作也更快了。"}]},{"partOfSpeech":"n.","definition":{"en":"a community dance event or performance, often accompanied by drums","zh":"（常伴随鼓点的）群体舞蹈活动/表演"},"examples":[{"en":"They invited us to an ngoma to celebrate the harvest.","zh":"他们邀请我们参加一场恩戈玛舞会来庆祝丰收。"},{"en":"The ngoma brought the whole neighborhood together.","zh":"这场恩戈玛活动把整个街区的人都聚到了一起。"}]},{"partOfSpeech":"n.","definition":{"en":"in some Central and East African traditions, a healing or spirit-related ceremony involving music and dance","zh":"在中东非一些传统中：与治愈或灵性相关、包含音乐与舞蹈的仪式"},"examples":[{"en":"The documentary describes an ngoma used for community healing.","zh":"纪录片介绍了一种用于社区疗愈的恩戈玛仪式。"}]}],"synonyms":["drum","drumming","dance","ceremony","ritual"],"phonetic":"/ŋoʊˈmɑː/","extraExplanation":["“Ngoma”常见于多种班图语（Bantu languages）以及斯瓦希里语等语境里，含义会随地区变化：既可能特指“鼓”，也可能泛指“鼓乐/舞蹈/庆典”，在某些社群中还与传统疗愈或灵性仪式有关。","在英语文章里，ngoma多用于谈论非洲音乐与文化（如民族音乐学、纪录片、旅行写作）。使用时通常不翻成一个固定英语词，而是保留原词以尊重其文化特定含义。"]}
{"word":"ngrave","summary":{"en":"Engrave means to carve text or designs into a hard surface, or (figuratively) to make something stay strongly in someone’s memory.","zh":"Engrave 指在坚硬表面刻字/雕刻图案；也可引申为让某事深深留在记忆中。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cut or carve words, pictures, or patterns into a hard surface (like metal, wood, or stone), often so they will last a long time","zh":"（在金属、木头、石头等坚硬表面上）刻、雕（文字/图案），通常为了长期保存"},"examples":[{"en":"They engraved her name on the back of the watch.","zh":"他们把她的名字刻在手表背面。"},{"en":"The ring is engraved with a small heart.","zh":"戒指上刻着一个小小的心形图案。"},{"en":"The artist engraved a design into the wood.","zh":"艺术家在木头上刻出了一个图案。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fix an image, memory, or idea deeply in someone’s mind (often passive: “be engraved on/in”)","zh":"（多用于被动）使（形象/记忆/观念）深深印在（某人）脑海里"},"examples":[{"en":"That moment is engraved in my memory.","zh":"那一刻深深刻在我的记忆里。"},{"en":"Her advice was engraved on my mind.","zh":"她的建议深深印在我心里。"}]}],"synonyms":["carve","etch","inscribe","imprint","stamp"],"phonetic":"/ɪnˈɡreɪv/","extraExplanation":["你输入的“ngrave”通常是拼写少了开头的“e”。标准拼写是 **engrave**。","词源上与“grave（刻、雕）”有关；前缀 **en-** 有“使……进入某种状态/放到……里”的感觉，所以 **engrave** 可以理解为“把东西刻进去”。","在文学或正式写作里，常见搭配是 **be engraved in/on someone’s memory/mind**，用来强调记忆非常深刻。"]}
{"word":"ngultrum","summary":{"en":"Ngultrum is the currency unit of Bhutan.","zh":"Ngultrum 是不丹的货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic unit of money used in Bhutan (plural: ngultrum); equal to 100 chetrum","zh":"不丹的货币单位（复数：ngultrum）；1 ngultrum = 100 chetrum"},"examples":[{"en":"I exchanged some cash into ngultrum when I arrived in Bhutan.","zh":"我到不丹后把一些现金换成了不丹努尔特鲁姆。"},{"en":"The hotel price is 3,500 ngultrum per night.","zh":"这家酒店每晚价格是 3,500 努尔特鲁姆。"}]}],"synonyms":["Bhutanese ngultrum","BTN"],"phonetic":"/nuːlˈtrʌm/","extraExplanation":["“Ngultrum”常写作 Bhutanese ngultrum，货币代码是 BTN，常见符号为 Nu.（例如 Nu. 500）。","不丹努尔特鲁姆与印度卢比（INR）保持固定汇率挂钩，因此在不丹部分地区印度卢比也可能被接受（但面额与政策会变化）。"]}
{"word":"nguyen","summary":{"en":"Nguyen is a common Vietnamese surname.","zh":"Nguyen 是一个常见的越南姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very common Vietnamese family name (surname), often written in English as Nguyen.","zh":"一个非常常见的越南姓氏（家族姓），英语中常写作 Nguyen。"},"examples":[{"en":"Ms. Nguyen will meet you at 3 p.m.","zh":"Nguyen 女士会在下午三点和你见面。"},{"en":"Nguyen is one of the most common last names in Vietnam.","zh":"Nguyen 是越南最常见的姓氏之一。"}]}],"phonetic":"/ˈwɪn/","extraExplanation":["“Nguyen”是越南最常见的姓氏之一，来源与越南历史上的王朝与赐姓传统有关，因此人数特别多。","在英语环境里，这个姓的读法差异很大：有人读得更接近越南语原音，也有人用更英语化的读法。正式场合最好直接询问本人偏好的发音。","称呼时常用“Mr./Ms. Nguyen”或职称+姓（如“Dr. Nguyen”）。在越南文化中，完整姓名的顺序通常是“姓 + 中间名 + 名”。"]}
{"word":"ngwee","summary":{"en":"“Ngwee” is not a standard English word; it’s most likely a name, or (rarely) a playful way to write a squeaky sound.","zh":"“Ngwee”不是标准英语词；更可能是人名，或（较少见）用来表示吱吱/呜呜的拟声写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word in English; most often seen as a personal name (a surname or given name) in some communities.","zh":"不是标准英语单词；更常见于人名（姓氏或名字），在某些社群中使用。"},"examples":[{"en":"Ms. Ngwee will join the meeting at 3 p.m.","zh":"Ngwee 女士将于下午三点参加会议。"},{"en":"I’m not sure how to pronounce Ngwee—could you tell me?","zh":"我不确定 Ngwee 怎么发音——你能告诉我吗？"}]},{"partOfSpeech":"other","definition":{"en":"A playful spelling used to represent a squeaky/whining sound (rare; usually written differently in English).","zh":"一种拟声的随意拼写，用来表示“吱吱/呜呜”的声音（较少见；英语里通常用别的写法）。"},"examples":[{"en":"The door went “ngwee,” like a tiny squeak.","zh":"门发出“ngwee”的声音，像很轻的吱呀声。"}]}],"synonyms":["squeak","whine"],"phonetic":"/ŋwiː/","extraExplanation":["“Ngwee”在英语里不算常见词汇，更可能来自姓名的罗马字拼写（例如东南亚华人姓氏的拼写变体）。不同家庭/地区的读法可能不一样，最好直接询问本人偏好的发音与拼写。","如果你是在聊天或漫画里看到“ngwee”表示声音，英语更常用的拟声词包括：“squeak”（吱吱）、“whine”（呜呜/哼哼）、“eeek”（尖叫/受惊）。"]}

