{"word":"nhan","summary":{"en":"Nhan is most commonly used as a Vietnamese personal name, often linked to meanings like “person” or “kind/benevolent.”","zh":"Nhan 多用作越南人名，常与“人”或“仁慈/善良”等含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Vietnamese given name (and sometimes a family name), commonly from the Vietnamese word “Nhân,” often associated with meanings like “human/person” or “benevolent/kind.”","zh":"越南人名（有时也作姓），常对应越南语“Nhân”，含义多与“人/人类”或“仁慈/善良”相关。"},"examples":[{"en":"Nhan is a common Vietnamese name, so you may meet several people with that name.","zh":"Nhan 是常见的越南名字，所以你可能会遇到好几位叫这个名字的人。"},{"en":"How do you pronounce Nhan in your family?","zh":"在你们家里，Nhan 这个名字怎么读？"}]}],"phonetic":"/nɑn/","extraExplanation":["“Nhan”没有越南语的声调与变音符号时，具体含义可能不止一种。越南语里不同写法/声调会对应不同词义（例如“Nhân”常与“人、仁慈”相关）。在英文语境中，人们常直接写作 Nhan 作为姓名拼写。","越南语的“nh”发音在英语里没有完全对应的音，因此在美国英语中常会出现多种读法；最礼貌的做法是直接问对方希望你怎么读。"]}
{"word":"nheengatu","summary":{"en":"Nheengatu is a Tupi-based Indigenous language of the Brazilian Amazon, historically used as a regional common language.","zh":"Nheengatu 是巴西亚马孙地区的一种以图皮语系为基础的原住民语言，历史上曾作为区域通用语使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Tupi-based Indigenous language (also called Língua Geral Amazônica) spoken mainly in the Amazon region of Brazil, especially along the Rio Negro; it developed historically as a common trade and contact language.","zh":"一种以图皮语族为基础的原住民语言（也称“亚马孙通用语/亚马孙通行语”Língua Geral Amazônica），主要在巴西亚马孙地区（尤其是内格罗河流域）使用；历史上作为贸易与跨族群交流的共同语言发展而来。"},"examples":[{"en":"Nheengatu is still spoken in some communities in the Brazilian Amazon.","zh":"在巴西亚马孙的一些社区里，Nheengatu 仍然有人使用。"},{"en":"The researcher recorded stories in Nheengatu to help preserve local oral traditions.","zh":"研究者用 Nheengatu 录制故事，以帮助保存当地的口述传统。"},{"en":"In class, we compared Portuguese loanwords in Nheengatu with their original forms.","zh":"在课堂上，我们把 Nheengatu 中的葡萄牙语借词和它们的原始形式做了对比。"}]}],"synonyms":["Língua Geral Amazônica"],"phonetic":"/ɲe.eŋ.ɡaˈtu/","extraExplanation":["Nheengatu 常被视为“通用语（língua geral）”传统的一部分：殖民时期，图皮语系语言与葡萄牙语长期接触，逐渐形成跨族群沟通的共同语，用于贸易、传教与日常交流。","它在学术与公共语境中也可能被称作“Língua Geral Amazônica（亚马孙通用语）”或“Modern Tupi（现代图皮语）”。在不同地区与社群中，拼写与读音可能略有差异。"]}
{"word":"nhengist","summary":{"en":"Hengist is a legendary early Anglo-Saxon leader said to have come to Britain in the 5th century.","zh":"Hengist（亨吉斯特）是传说中的早期盎格鲁-撒克逊领袖，据说在5世纪来到不列颠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hengist: a legendary 5th-century Jutish (Germanic) leader who, with his brother Horsa, is said in early English tradition to have come to Britain and helped begin Anglo-Saxon settlement.","zh":"亨吉斯特：传说中的5世纪朱特人（日耳曼）首领；据早期英格兰传统记载，他与兄弟霍尔萨来到不列颠，被认为与盎格鲁-撒克逊人的定居开端有关。"},"examples":[{"en":"In the Anglo-Saxon Chronicle, Hengist and Horsa are described as early leaders in Britain.","zh":"在《盎格鲁-撒克逊编年史》中，亨吉斯特与霍尔萨被描述为不列颠早期的领袖人物。"},{"en":"Some stories say Hengist was invited to help defend the Britons, but later took land for his people.","zh":"一些故事说亨吉斯特起初被邀请来协助防御，但后来为自己的族人夺取土地。"}]}],"synonyms":["(proper name)"],"phonetic":"/ˈhɛŋɡɪst/","extraExplanation":["你输入的“nhengist”看起来像是拼写或输入时多了一个开头字母 n；更常见的词条是专有名词“Hengist”。","名称可能源自古英语/日耳曼语，常被解释为与“种马、雄马”相关；他的兄弟“Horsa”也常被解释为与“马”有关，因此在传说叙事中带有象征色彩。","亨吉斯特的事迹介于历史与传说之间：相关记载多出自后世编年史与传说文本，细节在不同来源中并不完全一致。"]}
