{"word":"noa","summary":{"en":"Noa is a personal name used in multiple cultures.","zh":"Noa 是一个在多种文化中使用的人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name used for any gender (more often feminine in some countries). It can appear as a personal name in many cultures.","zh":"人名（名字），可用于男女（在一些国家更常见为女性名）。在多种文化中都有人使用。"},"examples":[{"en":"Noa is my classmate from Hawaii.","zh":"Noa 是我来自夏威夷的同学。"},{"en":"The author Noa writes short stories.","zh":"作家 Noa 写短篇小说。"}]}],"synonyms":["given name","first name"],"phonetic":"/ˈnoʊ.ə/","extraExplanation":["“Noa”在不同文化里来源不一：\n- 希伯来语背景中，Noa/Noah 相关名字常被理解为“安慰、慰藉”（但具体拼写与性别用法会随地区变化）。\n- 圣经《民数记》中也出现过名为 Noa/Noah（常译作“挪阿/挪亚”一类音译）的女性人物（西罗非哈的女儿之一），因此有时会被视为一个古老的人名来源。\n- 在现代用法中，它常作为简短、好读的国际化名字使用，发音通常为两拍：NO-uh。"]}
{"word":"noachian","summary":{"en":"Noachian means “related to Noah and the biblical flood,” and it is also a scientific term for Mars’s earliest major geologic period.","zh":"Noachian 指“与诺亚及《圣经》洪水故事相关的”；也可作行星科学术语，指火星最早的重要地质年代（诺亚纪/诺亚期）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Noah (Noah of the Bible) or to the time of the great flood described in the Book of Genesis.","zh":"与《圣经》中的诺亚有关的；或与《创世记》所记载的大洪水时代有关的。"},"examples":[{"en":"Some scholars compare this myth to a Noachian flood story.","zh":"一些学者把这个神话与诺亚式（Noachian）的洪水故事作比较。"},{"en":"The painting shows a Noachian scene: the ark, the rain, and animals waiting to board.","zh":"这幅画描绘了诺亚时代的场景：方舟、暴雨，以及等待登船的动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"In planetary science, relating to the Noachian period on Mars, the planet’s earliest widely recognized geologic era.","zh":"（行星科学）与火星的“诺亚纪/诺亚期”（Noachian）有关的，即火星最早、最重要的地质年代之一。"},"examples":[{"en":"Noachian terrains on Mars contain many impact craters.","zh":"火星的诺亚纪地形含有大量撞击坑。"},{"en":"Scientists look for signs of ancient water in Noachian rocks.","zh":"科学家在诺亚纪岩石中寻找远古水活动的迹象。"}]}],"synonyms":["Noahic","diluvial (in flood context)","Martian Noachian (science context)"],"phonetic":"/noʊˈeɪkiən/","extraExplanation":["“Noachian”来自“诺亚（Noah）”的拉丁化/英语形式加形容词后缀 -ian，表示“属于……的、与……相关的”。在宗教与文学语境里，它常用来指“诺亚与大洪水”的叙事传统。","在火星地质学里，“Noachian（诺亚纪/诺亚期）”是以“诺亚地（Noachis Terra）”这一火星区域命名的年代名，通常指火星非常早期的阶段（大约40亿年前左右），其表面常见密集陨石坑，也常被用来讨论火星早期可能存在的液态水环境。"]}
{"word":"noachic","summary":{"en":"Noachic means “related to Noah” or “related to the Noahide laws (a moral code traditionally seen as applying to all people).”","zh":"Noachic 指“与诺亚有关的”，或“与诺亚七诫（传统上被认为适用于全人类的道德规范）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Noah (Noach) in the Hebrew Bible, or to traditions connected with him.","zh":"与《希伯来圣经》中的诺亚（Noach）有关的；或与诺亚相关的传统有关的。"},"examples":[{"en":"Some Jewish writings discuss a Noachic covenant made after the flood.","zh":"一些犹太文献讨论了洪水之后所立的“诺亚之约”（Noachic covenant）。"},{"en":"The story is sometimes read as a Noachic lesson about responsibility and survival.","zh":"这个故事有时被解读为一种“诺亚式”的教训：关于责任与生存。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Noahide (Noachide) laws—basic moral commandments traditionally taught in Judaism as applying to all humanity.","zh":"与“诺亚七诫”（Noahide/Noachide laws）有关的；在犹太传统中被认为适用于全人类的基本道德诫命。"},"examples":[{"en":"The class introduced Noachic ethics as a shared moral framework for people of different faiths.","zh":"这门课介绍了“诺亚七诫”伦理，作为不同信仰人群可共享的道德框架。"},{"en":"He was interested in Noachic law and how it differs from Jewish religious law for Jews.","zh":"他对“诺亚七诫”法很感兴趣，并探讨它与专属于犹太人的宗教律法有何不同。"}]}],"synonyms":["Noahic","Noahide","Noachide"],"phonetic":"/noʊˈeɪ.ɪk/","extraExplanation":["“Noachic”源自Noach（诺亚的希伯来语形式）+ -ic（表示“与……有关的”）。在宗教与学术语境里，它常指“诺亚之约”或“诺亚七诫”。","“诺亚七诫”在犹太传统中通常概括为：禁止偶像崇拜、亵渎神、谋杀、性不道德行为、偷盗、食用活体动物的肢体，并要求建立公正的司法制度。不同传统与文本对细节表述可能略有差异。","拼写相关：Noachic（较贴近希伯来语转写）与Noahic（更英语化）都可见；与“诺亚七诫”相关时也常见Noachide/Noahide（作名词或形容词，如 Noachide laws / Noachide ethics）。"]}
{"word":"noachical","summary":{"en":"Noachic: relating to Noah or the Noahide (Noachide) laws in Judaism.","zh":"Noachic：与诺亚有关的；或与犹太教“诺亚法/诺亚七诫”相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Noah (from the Bible) or to the Noahide/Noachide laws and traditions in Judaism, often meaning “connected with the laws believed to apply to all humanity.”","zh":"与《圣经》中的诺亚有关的；或与犹太教中的“诺亚七诫/诺亚法”（被认为适用于全人类的基本戒律）相关的。"},"examples":[{"en":"Some writers discuss Noachic laws as a moral framework for non-Jews.","zh":"一些作者把“诺亚法”讨论为适用于非犹太人的道德框架。"},{"en":"The book compares Mosaic law with Noachic commandments.","zh":"这本书比较了摩西律法与诺亚诫命。"}]}],"synonyms":["Noahide","Noachide"],"phonetic":"/noʊˈeɪkɪk/","extraExplanation":["你输入的 noachical 更常见的拼写是 **Noachic**（也见 *Noahide/Noachide*）。它多用于宗教学、犹太研究语境，日常英语里不常见。","“Noachic/Noahide laws（诺亚七诫）”通常指：禁止偶像崇拜、亵渎、谋杀、盗窃、性不端、虐待动物（吃活体肉），并要求建立公正的司法制度。不同传统的表述会略有差异。"]}
{"word":"noachite","summary":{"en":"Noachite most often refers to a follower of the Noahide laws, or something connected to Noah/Noahide teachings.","zh":"Noachite 通常指“遵守诺亚七诫（诺亚法）的人”，也可作形容词表示“与诺亚或诺亚法有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows the Noahide (Noachide) laws—basic moral laws traditionally taught in Judaism as binding on all non-Jews","zh":"遵守“诺亚七诫/诺亚法”（犹太传统中认为适用于非犹太人的基本道德法则）的人"},"examples":[{"en":"Some people identify as Noachites because they want to follow the Noahide laws without converting to Judaism.","zh":"有些人自称为 Noachites，因为他们想遵守诺亚法，但不想改宗成为犹太教徒。"},{"en":"The group organized classes for Noachites on ethics and monotheism.","zh":"该团体为 Noachites 开设了关于伦理与一神论的课程。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Noah or to the Noahide laws","zh":"与《圣经》人物诺亚有关的；或与诺亚法有关的"},"examples":[{"en":"They discussed Noachite principles in a comparative religion course.","zh":"他们在比较宗教学课程中讨论了诺亚法相关原则。"},{"en":"The speaker gave a Noachite perspective on universal morality.","zh":"演讲者从诺亚法的角度谈论普世道德。"}]}],"synonyms":["Noahide","Noachide","Noachian (rare)"],"phonetic":"/ˈnoʊ.əˌkaɪt/","extraExplanation":["Noachite 更常见的拼写是 **Noahide / Noachide**（对应希伯来语中“诺亚的后裔/诺亚之子”的概念）。在英文中 *Noachite* 相对少见，读到时通常与“诺亚七诫（Seven Noahide Laws）”或相关社群讨论有关。","“诺亚七诫”在犹太传统里常被描述为面向全人类（尤其是非犹太人）的基本伦理规范；现代语境中也可能指一些非犹太人自我认同的宗教/伦理取向。"]}
{"word":"noah","summary":{"en":"Noah is a famous biblical figure linked to the Ark and the Flood, and it is also a common male first name.","zh":"Noah 既指与“方舟与大洪水”相关的著名宗教人物，也是一种常见的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In the Bible/Qur’an) a righteous man who built an ark and survived a great flood with his family and animals.","zh":"（《圣经》/《古兰经》中）义人诺亚：建造方舟，在大洪水中与家人和动物幸存的人物。"},"examples":[{"en":"In the story of Noah, the ark saves his family from the flood.","zh":"在诺亚的故事里，方舟让他的家人躲过了洪水。"},{"en":"Many children learn about Noah’s Ark in school or at church.","zh":"很多孩子会在学校或教会里学习“诺亚方舟”的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name.","zh":"男性名字（名）。"},"examples":[{"en":"Noah is one of the most popular baby names in the U.S.","zh":"Noah 是美国最受欢迎的婴儿名字之一。"},{"en":"My friend Noah plays the guitar.","zh":"我的朋友 Noah 会弹吉他。"}]}],"phonetic":"/ˈnoʊ.ə/","extraExplanation":["“Noah”常见于犹太教、基督教与伊斯兰教传统：在《创世记》中他建造方舟；在伊斯兰传统中对应先知“Nuh（努哈）”。","“Noah’s Ark（诺亚方舟）”在英语里也常被用作文化引用，象征“灾难中的避难所/重启的希望”。"]}
{"word":"Noah's","summary":{"en":"“Noah’s” means “belonging to Noah,” commonly seen in “Noah’s Ark.”","zh":"“Noah’s”表示“诺亚的”，常见于“Noah’s Ark（诺亚方舟）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"The possessive form of the name “Noah,” meaning “belonging to Noah” or “related to Noah.” Often used in the phrase “Noah’s Ark.”","zh":"名字“Noah（诺亚）”的所有格形式，意思是“诺亚的 / 与诺亚有关的”。常见于短语“Noah’s Ark（诺亚方舟）”。"},"examples":[{"en":"Noah’s story is famous in the Bible.","zh":"诺亚的故事在《圣经》中很有名。"},{"en":"Many children learn about Noah’s Ark at school.","zh":"许多孩子在学校会学习“诺亚方舟”的故事。"},{"en":"I borrowed Noah’s book and will return it tomorrow.","zh":"我借了诺亚的书，明天会还给他。"}]}],"phonetic":"/ˈnoʊ.əz/","extraExplanation":["“Noah’s”中的 ’s 表示所有关系（possessive），常用于人名或动物名后：Noah’s car（诺亚的车）。如果名字以 s 结尾，有时也可写作 Chris’s / Chris’（两种都常见，取决于写作风格）。","文化背景：“Noah（诺亚）”是《圣经·创世记》中的人物，上帝让他建造方舟（Noah’s Ark）以躲避大洪水；因此在英语里，Noah’s Ark 常被用来指“装着各种动物的大船/方舟”，也常见于儿童读物与文化典故中。"]}
{"word":"noahic","summary":{"en":"Noahic means “related to Noah,” especially the Flood story, the covenant after the Flood, or (in Judaism) universal moral laws linked to Noah.","zh":"Noahic 指“与诺亚有关的”，尤指洪水故事、洪水后的诺亚之约，或（犹太传统中）与诺亚相关的普遍道德律法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Noah (from the Bible/Qur’an), especially to the Flood story or the covenant God made with Noah after the Flood.","zh":"与《圣经》/《古兰经》中的诺亚有关的；尤指“洪水故事”或洪水后上帝与诺亚立约的。"},"examples":[{"en":"Some scholars compare Noahic traditions across different cultures.","zh":"一些学者会比较不同文化中的“诺亚式/诺亚相关”的传统。"},{"en":"The Noahic covenant is often described as a promise never to destroy the whole earth with a flood again.","zh":"“诺亚之约”常被描述为：上帝承诺不再用洪水毁灭全地。"}]},{"partOfSpeech":"adj.","definition":{"en":"in Jewish tradition, connected to the basic moral laws given to humanity through Noah (often called the Noahide laws).","zh":"（犹太传统）与通过诺亚赐给全人类的基本道德律法有关的（常称“诺亚七诫/诺亚法”）。"},"examples":[{"en":"The text discusses Noahic ethics as a foundation for universal morality.","zh":"这篇文章讨论“诺亚式伦理”，把它视为普遍道德的基础。"},{"en":"Some writers use “Noahic” when talking about laws meant for all peoples, not only Israel.","zh":"有些作者谈到面向所有民族（不只以色列）的律法时，会用“Noahic（诺亚相关的）”。"}]}],"synonyms":["Noachian","Noah-related"],"phonetic":"/noʊˈeɪ.ɪk/","extraExplanation":["“Noahic”多见于宗教学、神学、圣经研究等语境。常与 covenant（圣约/盟约）、flood（洪水）、ark（方舟）、rainbow（彩虹，象征立约记号）等词一起出现。","英语里也常见近形词“Noachian”。在学术写作中两者都可能出现，但“Noachian”更常见一些；用哪一个取决于作者习惯或期刊风格。"]}
{"word":"noam","summary":{"en":"Noam is a male given name (especially common in Israel) and can also refer to famous people named Noam, notably Noam Chomsky.","zh":"Noam 是一个男性名字（在以色列尤其常见），也可用来指名人，尤其是诺姆·乔姆斯基（Noam Chomsky）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, most commonly used in Israel and among Jewish communities","zh":"男性名字（常见于以色列及犹太社群）"},"examples":[{"en":"Noam is a popular baby name in Israel.","zh":"Noam 是以色列很常见的婴儿名字。"},{"en":"My classmate Noam speaks Hebrew and English.","zh":"我的同学 Noam 会说希伯来语和英语。"}]},{"partOfSpeech":"n.","definition":{"en":"used as a reference to specific famous people named Noam, especially Noam Chomsky (an American linguist and political commentator)","zh":"用来指代某位名叫 Noam 的名人，尤其指美国语言学家兼政治评论员诺姆·乔姆斯基（Noam Chomsky）"},"examples":[{"en":"In linguistics class, we read a chapter by Noam Chomsky.","zh":"在语言学课上，我们读了诺姆·乔姆斯基的一章文章。"},{"en":"Some people simply say “Noam” when they mean Chomsky.","zh":"有些人说“Noam”时就是在指乔姆斯基。"}]}],"phonetic":"/ˈnoʊ.əm/","extraExplanation":["Noam 源自希伯来语名字 נוֹעַם（No‘am），常被解释为“愉悦、甜美、温和”的意思。","英语里它通常作为专有名词使用：首字母大写（Noam）。发音一般读作两个音节（NOH-əm）。"]}
{"word":"noance","summary":{"en":"Nuance means a subtle difference in meaning, feeling, or expression.","zh":"Nuance 指意义、情感或表达上的细微差别、微妙之处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small but important difference in meaning, feeling, or expression","zh":"（意义、情感或表达上的）细微差别；微妙之处"},"examples":[{"en":"There is a nuance between “house” and “home.”","zh":"“house”和“home”之间有细微差别。"},{"en":"Her tone had a nuance of sarcasm.","zh":"她的语气里带着一丝讽刺。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give something subtle shades of meaning or expression; to make slightly different in a careful way","zh":"使……带有细微差别；细致地调整（表达、意义等）"},"examples":[{"en":"The translator nuanced the wording to match the author’s style.","zh":"译者细致调整措辞，以贴近作者的风格。"}]}],"synonyms":["subtlety","shade","fine distinction"],"phonetic":"/ˈnuːɑːns/","extraExplanation":["你输入的“noance”通常是“nuance”的常见拼写错误。标准拼写是 **nuance**。","词源来自法语 *nuance*，原意与“色彩的深浅变化、色调差异”有关，所以现在也常用来表示“意义或感觉上的微妙层次”。"]}
