{"word":"nob","summary":{"en":"“Nob” is an informal British word meaning a head, a high-status person, or (vulgarly) the penis.","zh":"“nob”是英式非正式用语，可指“头”、 “大人物”，也可作粗俗俚语指“阴茎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly UK) A person’s head.","zh":"（非正式，多用于英式英语）人的头、脑袋。"},"examples":[{"en":"He got hit on the nob and felt dizzy.","zh":"他头上挨了一下，觉得头晕。"},{"en":"Put your helmet on—protect your nob.","zh":"把头盔戴上——保护你的头。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly UK) An important or high-status person; a “big shot.”","zh":"（非正式，多用于英式英语）重要人物；大人物。"},"examples":[{"en":"Some city nobs came to the opening ceremony.","zh":"一些城里的大人物来参加了开幕式。"},{"en":"She started mixing with the local nobs.","zh":"她开始和当地的名流来往。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar, chiefly UK) The penis.","zh":"（俚语，粗俗，多用于英式英语）阴茎。"},"examples":[{"en":"That word is rude—don’t use it in polite conversation.","zh":"那个词很粗俗——在正式或礼貌的场合别用。"}]}],"synonyms":["head","big shot","VIP","penis (vulgar)"],"phonetic":"/nɑb/","extraExplanation":["“nob”在英式口语里带有明显的地域与语域色彩：表示“头/大人物”时偏口语；表示生殖器时属于粗口，容易冒犯他人。学习时建议优先识别含义，不要随意使用。","相关构词：nobhead（英式俚语，意为“笨蛋/讨厌的人”，带贬义，语气不礼貌）。"]}
{"word":"nobackspace","summary":{"en":"“No backspace” means you can’t delete what you type; “nobackspace” is often used as a tag or username for that idea.","zh":"“no backspace”指打字时不能按退格键删除内容；“nobackspace”常作为相关概念的标签或网名。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a rule or situation where you are not allowed to use the Backspace key, so you must keep whatever you type (no deleting or correcting)","zh":"一种规则或情况：不允许使用“退格键（Backspace）”，因此输入后不能删除或纠正"},"examples":[{"en":"This writing challenge is “no backspace”—just keep typing and don’t fix mistakes.","zh":"这个写作挑战是“不能按退格键”——一直打下去，不要改错。"},{"en":"In the game mode, it’s no backspace, so every typo stays on screen.","zh":"在这个游戏模式里不能按退格键，所以每个拼写错误都会留在屏幕上。"}]},{"partOfSpeech":"n.","definition":{"en":"an online handle/style name suggesting the person types fast or writes without editing (often used as a username or tag)","zh":"一种网名/风格名：暗示自己打字很快或写作不修改（常作用户名或标签）"},"examples":[{"en":"He streams typing practice under the name “NoBackspace.”","zh":"他用“NoBackspace”这个名字直播打字练习。"},{"en":"Her “nobackspace” posts are like raw journal entries—very direct.","zh":"她的“nobackspace”风格帖子像未修饰的日记——很直接。"}]}],"synonyms":["no-delete","no-edit","uneditable mode","freewriting (similar idea)"],"phonetic":"/noʊ ˈbækˌspeɪs/","extraExplanation":["“no backspace”常见于打字练习、写作挑战或直播场景，强调“先写出来再说”的流畅度（类似写作里的 freewriting 自由书写）。","写成“nobackspace”多见于网名、标签或挑战标题，是把短语连写成一个整体以便当作标识使用。"]}
{"word":"nobatch","summary":{"en":"“nobatch” usually means “no batch processing; handled one-by-one,” mostly as a tech label rather than a standard word.","zh":"“nobatch”通常指“不开批处理、逐个处理”，多见于技术语境中的标签/配置名，而非标准词典词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard dictionary word; most often used in tech or workplace contexts to mean “not processed as a batch,” i.e., handled one-by-one or in real time.","zh":"不是常见的词典词；多用于技术/工作场景，表示“不是批处理（batch）方式”，即逐个处理或实时处理。"},"examples":[{"en":"This endpoint runs in nobatch mode, so each request is processed immediately.","zh":"这个接口以 nobatch 模式运行，所以每个请求都会立刻处理。"},{"en":"We need a nobatch workflow for urgent orders.","zh":"我们需要一个用于紧急订单的 nobatch 工作流（不走批处理）。"}]},{"partOfSpeech":"n.","definition":{"en":"A label/name for a setting or option meaning “no batch processing” (often written as “no batch” or “no-batch”).","zh":"作为设置/选项的标签或名称，意思是“关闭批处理”（也常写作 no batch 或 no-batch）。"},"examples":[{"en":"Turn on “nobatch” if you don’t want the jobs grouped together.","zh":"如果你不想把任务合并成一批，就开启“nobatch”。"},{"en":"The config has a nobatch flag for interactive runs.","zh":"配置里有一个 nobatch 标志，用于交互式运行。"}]}],"synonyms":["no batch","non-batch","without batching","process individually","real-time processing"],"phonetic":"/ˈnoʊˌbætʃ/","extraExplanation":["“nobatch”更像是项目里的自定义写法，而不是固定英语词汇。更常见的表达包括：no batch, non-batch, without batching, process individually / in real time。","在软件/数据处理里，batch processing（批处理）指把很多任务或数据凑成一批再统一处理；nobatch 则强调不等待凑批，直接逐个处理，通常更及时但可能效率更低。"]}
{"word":"nobber","summary":{"en":"“Nobber” is informal slang that can mean a friend/mate in some varieties of English, but it can also be a vulgar slang word for a penis.","zh":"“nobber”是非正式俚语：在某些英语地区可指“朋友/哥们儿”，但也可能是指“阴茎”的粗俗说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Ireland/UK/Aus) A friend or mate; someone you know well.","zh":"（非正式，多见于爱尔兰/英国/澳大利亚）朋友、哥们儿；熟人。"},"examples":[{"en":"I’m meeting a few nobbers at the pub after work.","zh":"我下班后要去酒吧见几个哥们儿。"},{"en":"He’s an old nobber from school days.","zh":"他是我学生时代的老朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"(vulgar slang) A penis.","zh":"（粗俗俚语）阴茎。"},"examples":[{"en":"That joke uses a vulgar word for a man’s private part.","zh":"那个笑话用了一个指男性私处的粗俗词。"},{"en":"In some slang, “nobber” can refer to male anatomy.","zh":"在某些俚语里，“nobber”可以指男性生殖器。"}]}],"synonyms":["mate","buddy","pal","friend"],"phonetic":"/ˈnɑbɚ/","extraExplanation":["“nobber”在不同英语地区含义差异很大：在爱尔兰/部分英式或澳式口语里可表示“朋友”，但在一些语境中也可能被理解为粗俗的性指称（源自俚语“nob”）。如果你不确定听众背景，日常更安全的说法是mate / friend。","语域提示：第一义通常是随意、口语化；第二义属于粗俗用法，不适合正式场合或不熟的人之间使用。"]}
{"word":"nobbier","summary":{"en":"“Nobbier” means “more nobby”: either more stylish/neat, or (in British English) more snobbish/upper-class in attitude.","zh":"“nobbier”是“nobby”的比较级：可以指更时髦体面；也可（多见英式英语）指更势利、更装上流。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more stylish, neat, or smart-looking (comparative form of “nobby,” informal)","zh":"更时髦的；更整洁体面的（“nobby”的比较级，非正式）"},"examples":[{"en":"That jacket looks nobbier than your old one.","zh":"那件夹克比你旧的那件更体面、更好看。"},{"en":"He wore a nobbier suit for the interview.","zh":"他为了面试穿了一套更精神的西装。"}]},{"partOfSpeech":"adj.","definition":{"en":"more snobbish or trying to seem upper-class (comparative form of “nobby,” mainly British English, informal)","zh":"更势利的；更装“上流”的（“nobby”的比较级，多见于英式英语，非正式）"},"examples":[{"en":"After he got promoted, he started acting nobbier.","zh":"升职之后，他开始变得更爱摆架子、更势利了。"},{"en":"Don’t get nobbier just because you know a few fancy words.","zh":"别因为会几个高级词就变得更装腔作势。"}]}],"synonyms":["more stylish","smarter","more fashionable","more upscale","more snobbish"],"phonetic":"/ˈnɑbiər/","extraExplanation":["“nobbier”来自口语形容词“nobby”（意为“时髦/体面”或“势利/装上流”）。在现代英语里，这个词不算常见，更常用的替代说法是：more stylish / smarter / more upscale（更体面、更高档），或 more snobbish（更势利）。","含义要看语境：说衣服、外表时多是夸“更好看、更讲究”；说人的态度或行为时，往往带批评意味（更势利、更摆架子）。"]}
{"word":"nobbiest","summary":{"en":"“Nobbiest” means “the most nobby”: the most stylish or (especially in British English) the most posh/upper-class.","zh":"“nobbiest”是“nobby”的最高级：最时髦、最体面；（尤指英式）最高档、最“贵气/上流”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “nobby”) most stylish and fashionable; smart-looking.","zh":"（“nobby”的最高级）最时髦的；最漂亮、最精神的。"},"examples":[{"en":"She wore her nobbiest dress to the party.","zh":"她穿上自己最时髦的裙子去参加聚会。"},{"en":"He showed up in his nobbiest suit and polished shoes.","zh":"他穿着自己最精神的西装、鞋子也擦得锃亮地出现了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “nobby,” chiefly British) most associated with the upper class; most “posh.”","zh":"（“nobby”的最高级，主要英式）最“上流”的；最“贵气/高级”的。"},"examples":[{"en":"That hotel is the nobbiest place in town—very expensive and exclusive.","zh":"那家酒店是城里最“高档/贵气”的地方——很贵而且很讲究门槛。"},{"en":"They went to the nobbiest restaurant for their anniversary.","zh":"他们去城里最高档的餐厅庆祝纪念日。"}]}],"synonyms":["most stylish","most fashionable","smartest-looking","poshest","most upscale"],"phonetic":"/ˈnɑbiəst/","extraExplanation":["“nobbiest”来自形容词“nobby”的最高级形式：nobby → nobbier → nobbiest。","“nobby”在英式英语里更常见，语气多偏口语，可表示“时髦、体面”，也可指“上流/高档（posh）”。在美式英语中相对少见，可能让人误以为与“snobby（势利的）”同义，但两者不完全一样：nobby更偏“漂亮/高档”，snobby更偏“瞧不起人、摆架子”。"]}
{"word":"nobbily","summary":{"en":"Nobbily means “in a stylish, smart-looking way,” usually in British English.","zh":"nobbily 的意思是“很时髦、很体面地（以讲究的方式）”，多见于英式英语。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a stylish, fashionable, or “smart-looking” way (often British, slightly old-fashioned).","zh":"以时髦、讲究、看起来很“体面”的方式（多为英式用法，略带旧式口吻）。"},"examples":[{"en":"She was dressed nobbily for the party, in a tailored coat and polished shoes.","zh":"她参加聚会时穿得很体面：合身的外套配上擦得锃亮的鞋子。"},{"en":"The hotel lobby was nobbily decorated, with rich wood and warm lighting.","zh":"酒店大堂装饰得很讲究：深色木材配上温暖的灯光。"}]}],"synonyms":["smartly","stylishly","elegantly","fashionably"],"phonetic":"/ˈnɑbəli/","extraExplanation":["“nobbily”来自形容词“nobby”。在英式英语里，“nobby”常指“时髦、体面、看起来像上层社会那种讲究”，带一点口语/年代感。它与俚语“nob”（贵族、要人；也可指“头”）有关，因此有“有派头”的意味。现代日常更常用的替换说法有“smartly”“stylishly”“elegantly”。"]}
{"word":"nobble","summary":{"en":"“Nobble” is an informal British verb meaning to catch/arrest someone, to sabotage something, or sometimes to steal.","zh":"“nobble”是英式非正式动词，可指抓住/逮捕某人、暗中破坏某事，有时也指偷窃。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to catch or arrest someone (often a criminal), especially after trying to stop them from getting away","zh":"（尤指为防止其逃脱而）抓住、逮捕（常指罪犯）"},"examples":[{"en":"The police finally nobbled the thief at the train station.","zh":"警察最终在火车站抓住了那个小偷。"},{"en":"He tried to run, but security nobbled him at the exit.","zh":"他想跑，但保安在出口把他拦住并抓住了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to sabotage, interfere with, or secretly damage something so it cannot succeed or work properly","zh":"暗中破坏、使（某事）无法成功或正常运转"},"examples":[{"en":"Someone had nobbled the project by deleting key files.","zh":"有人删除了关键文件，暗中破坏了这个项目。"},{"en":"The team suspected their equipment had been nobbled before the match.","zh":"球队怀疑他们的设备在比赛前被人动了手脚。"}]},{"partOfSpeech":"vt.","definition":{"en":"to steal something","zh":"偷窃（某物）"},"examples":[{"en":"My phone was nobbled on the bus.","zh":"我的手机在公交车上被偷了。"}]}],"synonyms":["catch","arrest","nab","stop","sabotage","tamper with","cripple","steal","nick"],"phonetic":"/ˈnɑbəl/","extraExplanation":["“nobble”是英式非正式用语，在美式英语里不算常见；美式表达更常用“catch/arrest”“sabotage”“steal”。","在英国语境中，“nobble”常与赛马或比赛舞弊相关（如“nobble a horse”指暗中让马无法正常发挥），也可泛指对任何人或事“动手脚”。"]}
{"word":"nobbled","summary":{"en":"“Nobbled” means caught/stopped or unfairly sabotaged (especially in British English, often in sports).","zh":"“nobbled”表示“被逮住/被制止”，也可指“被不正当手段搞垮/被动手脚”（英式用法更常见，尤见于体育如赛马）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Stopped, caught, or defeated—often in a sneaky or decisive way.","zh":"（非正式）被制止、被逮住或被打败；常含“突然/干脆”或“带点阴招”的感觉。"},"examples":[{"en":"The police finally nobbled the gang after months of investigation.","zh":"警方经过数月调查，终于逮住了那个团伙。"},{"en":"Our plan got nobbled by a last-minute rule change.","zh":"我们的计划被临时改规则给搅黄了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(BrE, sports) Prevented from winning by bribery, sabotage, or other unfair interference (especially in horse racing).","zh":"（英式用法，体育）因贿赂、破坏或其他不正当干预而被弄得无法获胜（尤指赛马）。"},"examples":[{"en":"There were rumors the favorite horse had been nobbled before the race.","zh":"有传言说那匹热门马在比赛前被人动了手脚。"},{"en":"The team claimed they were nobbled by an unfair official decision.","zh":"那支队声称他们是被不公正的裁判决定“搞掉”的。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “nobble”: to catch or stop; to tamper with unfairly; to injure to weaken.","zh":"“nobble”的过去式/过去分词：抓住或制止；（不正当）动手脚；伤害使其失去能力。"},"examples":[{"en":"They nobbled him at the airport before he could leave the country.","zh":"他们在机场逮住了他，没让他出境。"},{"en":"Someone had nobbled the equipment, so it failed during the demo.","zh":"有人对设备动了手脚，所以演示时出了故障。"}]}],"synonyms":["caught","nabbed","stopped","thwarted","sabotaged","crippled"],"phonetic":"/ˈnɑbəld/","extraExplanation":["“nobble”更常见于英式英语和新闻/口语语境，带有“下手、搞定、搞垮”的力度感。","在赛马等语境里，“nobble”常指通过下药、贿赂或破坏让某个选手/马匹无法发挥，因此带有明显的“不公平/作弊”含义。"]}
{"word":"nobbler","summary":{"en":"“Nobbler” is mainly an Australian/NZ informal word for a drink (often alcohol). It can also mean a saboteur in British slang, and it may have a vulgar sexual meaning in some contexts.","zh":"“nobbler”主要是澳大利亚/新西兰的非正式说法，指“一杯（常为酒）”。在英式俚语中也可指“暗中破坏/收买的人”，某些语境下还可能带粗俗性含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia/New Zealand, informal) A drink, especially an alcoholic drink; a quick “shot” or small drink.","zh":"（澳大利亚/新西兰，非正式）一杯饮料，尤指酒；常指“来一口/一小杯（烈酒）”。"},"examples":[{"en":"Let’s have a nobbler after work.","zh":"下班后咱们去喝一杯吧。"},{"en":"He poured himself a nobbler of whiskey.","zh":"他给自己倒了一小杯威士忌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Britain, informal) A person who “nobbles” others—i.e., sabotages, bribes, or harms someone to influence an outcome (often in sports or business).","zh":"（英国，非正式）“nobble”的人：通过破坏、收买或伤害他人来影响结果的人（常见于体育或商业语境）。"},"examples":[{"en":"The team accused a nobbler of trying to ruin their chances.","zh":"球队指控有人搞破坏，想毁掉他们的机会。"},{"en":"Rumors spread about a nobbler targeting key players.","zh":"传闻说有人盯上了关键球员，企图下黑手。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar) A crude term related to male genitals or sexual acts, based on “knob.” Use with caution.","zh":"（俚语，粗俗）与男性生殖器或性行为相关的粗俗说法，来自“knob”的引申。注意场合，谨慎使用。"},"examples":[{"en":"That word is pretty offensive—don’t use it in polite conversation.","zh":"那个词挺冒犯的——在正式或礼貌场合别用。"}]}],"synonyms":["(drink sense) shot","(drink sense) dram","(drink sense) quick drink","(sabotage sense) fixer","(sabotage sense) saboteur"],"phonetic":"/ˈnɑblər/","extraExplanation":["“nobbler”最常见的友好用法出现在澳大利亚/新西兰英语里，基本等于“a drink / a quick drink”。在美式英语中不算常用，听到时多半带明显的地域色彩。","第二义与动词“to nobble”（使某人失去竞争力、暗中破坏/收买）有关，常见于英式新闻或体育八卦语境。","含“knob”来源的粗俗义在不同地区理解差异较大，也容易冒犯他人；学习时认识即可，避免主动使用。"]}
{"word":"nobblers","summary":{"en":"“Nobblers” is an informal plural noun meaning small bottles of alcohol (especially in Australian/British English); it can also mean hard punches in informal use.","zh":"“nobblers”是非正式复数名词，常指（澳/英）小瓶装酒；在口语里也可指重拳/猛击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian & British informal) Small bottles of alcohol, especially spirits; often sold as single-serve “miniatures.”","zh":"（澳英口语）小瓶装酒（多指烈酒），常见于单人份“迷你装”。"},"examples":[{"en":"He brought a few nobblers of whiskey for the camping trip.","zh":"他带了几瓶小瓶威士忌去露营。"},{"en":"You can grab nobblers at the duty-free shop.","zh":"你可以在免税店买到小瓶装酒。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, mainly British/Australian) A quick, hard hit or punch.","zh":"（非正式，主要英/澳）重击；猛打（一下）。"},"examples":[{"en":"He took a nobbler to the ribs and stepped back.","zh":"他肋部挨了一记重击，后退了一步。"},{"en":"The boxer landed a couple of nobblers in the second round.","zh":"那位拳手在第二回合打中了几记重拳。"}]}],"synonyms":["mini bottles","miniatures","small bottles","shots (context-dependent)","punches","blows"],"phonetic":"/ˈnɑblɚz/","extraExplanation":["“nobbler”在澳大利亚英语里常指“小瓶装烈酒/小酒瓶”，和美式英语里更常见的“miniature / mini bottle”意思相近。","不同地区俚语差异很大：在某些语境里它也可能带有粗俗含义（与性有关），不建议在不熟悉语境时使用，以免冒犯。"]}
{"word":"nobbles","summary":{"en":"“Nobbles” comes from the verb “nobble”: to cripple or thwart someone/something; sometimes to catch/arrest; less commonly to bribe or secretly influence.","zh":"“nobbles”来自动词“nobble”：指使某人/某事失去行动或竞争能力；有时指逮住/逮捕；较少见指行贿或暗中影响。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to stop or seriously weaken someone or something (often by damaging, restricting, or interfering), so they cannot act effectively","zh":"（通过破坏、限制或干扰）使某人/某事无法有效行动；严重削弱"},"examples":[{"en":"The budget cuts nobbled the project before it could start.","zh":"预算削减让这个项目还没开始就被“掐死”了。"},{"en":"A knee injury nobbled him for the rest of the season.","zh":"膝伤让他这个赛季后面都发挥不出来。"}]},{"partOfSpeech":"v.","definition":{"en":"to catch, arrest, or seize someone (informal, mainly British English)","zh":"（非正式，主要英式英语）抓住；逮捕；捉拿"},"examples":[{"en":"The police nobbled the thief near the station.","zh":"警察在车站附近抓住了那个小偷。"}]},{"partOfSpeech":"v.","definition":{"en":"to bribe or influence someone secretly (less common; often in contexts like sports or politics)","zh":"（较少见）私下行贿或暗中影响（常用于体育或政治语境）"},"examples":[{"en":"He was accused of trying to nobble an official.","zh":"他被指控试图收买一名官员。"}]}],"synonyms":["cripple","hobble","thwart","sabotage","catch","arrest","bribe"],"phonetic":"/ˈnɑbəl/","extraExplanation":["“nobble”多见于英式口语，常带有“使其失去竞争力/把人搞残”的语气。在赛马等体育语境中尤其常用，历史上也可指通过不正当手段让对手或马匹无法正常参赛。","“nobbles”通常是动词第三人称单数（he/she/it nobbles）或名词复数的拼写形式；但最常见是动词形式。"]}
{"word":"nobbling","summary":{"en":"“Nobbling” means secretly sabotaging someone’s chances, or (informal BrE) catching/stopping someone, or weakening something so it doesn’t work well.","zh":"“nobbling”表示暗中破坏他人成功（最常见）；也可指（英式口语）迅速抓住/拦下某人，或把某物弄坏/削弱使其失灵。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “nobble”) secretly stopping someone from succeeding, especially by cheating, sabotaging, or unfair pressure.","zh":"（“nobble”的现在分词）暗中阻止某人成功，尤指用欺骗、破坏或不正当手段来打压。"},"examples":[{"en":"The team accused a rival of nobbling their project by leaking false information.","zh":"这个团队指责竞争对手通过泄露虚假信息来暗中破坏他们的项目。"},{"en":"There were rumors that someone was nobbling the election with illegal donations.","zh":"有传言说有人用非法捐款在暗中操纵、破坏选举。"}]},{"partOfSpeech":"v.","definition":{"en":"catching or taking someone (often a criminal) quickly, or stopping them so they cannot escape (informal, mainly British English).","zh":"迅速抓住或逮住某人（常指罪犯），或把人拦下使其无法逃脱（非正式，主要英式英语）。"},"examples":[{"en":"The police ended up nobbling the pickpocket near the station.","zh":"警方最后在车站附近逮住了那个扒手。"},{"en":"Security was nobbling anyone who tried to enter without a ticket.","zh":"保安把所有没票想进场的人都拦了下来。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, British) damaging or weakening something so it cannot work properly.","zh":"（非正式，英式）把某物弄坏或削弱，使其不能正常运作。"},"examples":[{"en":"The scandal is nobbling the company’s reputation.","zh":"这桩丑闻正在重创公司的声誉。"},{"en":"A software bug was nobbling the app on older phones.","zh":"一个软件漏洞让这款应用在旧手机上无法正常运行。"}]}],"synonyms":["sabotaging","undermining","fixing","tampering with","catching","nabbing","crippling"],"phonetic":"/ˈnɑbəlɪŋ/","extraExplanation":["“nobble”在英式英语里更常见，带有口语色彩。经典用法常出现在赛马或体育语境：指通过不正当手段让对手（或马匹）无法正常发挥，例如“nobble a horse / nobble the favorite（暗中让热门选手失常）”。","拼写提示：词形变化是 nobble → nobbling（双写 b + -ing），类似 stop → stopping。"]}
{"word":"nobbut","summary":{"en":"“Nobbut” is a Northern English dialect word meaning “only” or “nothing but.”","zh":"“nobbut”是英格兰北部方言词，意思是“只有/不过/仅仅是”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Northern English dialect) only; nothing but.","zh":"（英格兰北部方言）只有；不过；仅仅是。"},"examples":[{"en":"It’s nobbut a scratch—don’t worry.","zh":"这不过是点小擦伤——别担心。"},{"en":"I’ve nobbut five minutes, then I have to go.","zh":"我只有五分钟，然后就得走。"},{"en":"She’s nobbut a child.","zh":"她还只是个孩子。"}]}],"synonyms":["only","just","nothing but","merely"],"phonetic":"/ˈnoʊbʊt/","extraExplanation":["“nobbut”主要见于英格兰北部（如约克郡、兰开夏一带）的口语与方言写法，相当于标准英语里的“only / just / nothing but”。在正式写作中一般不用，更多用于表现地方口音、人物性格或地域文化。","拼写也可能见到变体，如“nowt but”（nowt=nothing）在部分方言里更常见；含义接近。"]}
{"word":"nobby","summary":{"en":"“Nobby” (British informal) means stylish and posh-looking, sometimes with a snobbish upper-class feel.","zh":"“nobby”（英式口语）指看起来时髦讲究、显得高档；有时也带“上层/势利”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE, informal) fashionable and expensive-looking; showing a “posh” style.","zh":"（英式英语，非正式）时髦而显得昂贵的；带“上流/讲究”风格的。"},"examples":[{"en":"He turned up in a nobby suit and shiny shoes.","zh":"他穿着一套很讲究的西装、脚上皮鞋锃亮地出现了。"},{"en":"It’s a nobby restaurant—great food, but not cheap.","zh":"那家餐厅挺高档的——食物很棒，但不便宜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(BrE, informal, often disapproving) connected with rich or upper-class people; snobbish.","zh":"（英式英语，非正式，常含贬义）与富人/上层阶层有关的；势利的、爱摆架子的。"},"examples":[{"en":"She has some nobby friends from the private school.","zh":"她有一些来自私立学校、很“上流”的朋友。"},{"en":"Don’t be so nobby about where people come from.","zh":"别那么势利，别总看人出身。"}]}],"synonyms":["posh","upscale","fancy","smart","snobbish"],"phonetic":"/ˈnɑbi/","extraExplanation":["“nobby”主要是英式口语，用来形容“看起来很高级/很讲究”，有时也暗含“势利、装腔作势”的评价。美式英语里不太常用；在美国更常见的近似表达是 “fancy / upscale / posh / snobbish”。","词源上与“nob”（口语：有钱有势的人、要人）有关，因此容易带出“上流社会”的联想。"]}
{"word":"Nobel","summary":{"en":"Nobel most commonly refers to the Nobel Prize(s), and it can also refer to Alfred Nobel or describe something related to the Nobel Prize.","zh":"Nobel 最常指“诺贝尔奖”，也可指“阿尔弗雷德·诺贝尔”，或作形容词表示与诺贝尔奖相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Nobel Prize(s): an international award given each year for outstanding achievements in areas such as peace, literature, and sciences","zh":"诺贝尔奖：每年颁发的国际奖项，用于表彰在和平、文学及科学等领域的杰出成就"},"examples":[{"en":"She won the Nobel Prize in Literature for her novels.","zh":"她因小说获得了诺贝尔文学奖。"},{"en":"Many scientists dream of receiving a Nobel Prize.","zh":"许多科学家梦想获得诺贝尔奖。"}]},{"partOfSpeech":"n.","definition":{"en":"Alfred Nobel (1833–1896), the Swedish inventor and founder whose will created the Nobel Prizes","zh":"阿尔弗雷德·诺贝尔（1833—1896）：瑞典发明家，诺贝尔奖的创立者（其遗嘱设立该奖项）"},"examples":[{"en":"Nobel left most of his fortune to fund the prizes.","zh":"诺贝尔将大部分遗产用于设立这些奖项。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Nobel Prize(s) or Alfred Nobel","zh":"与诺贝尔奖或阿尔弗雷德·诺贝尔相关的"},"examples":[{"en":"The university hosted a Nobel lecture by a prizewinner.","zh":"这所大学举办了一场由诺贝尔奖得主主讲的诺贝尔讲座。"}]}],"synonyms":["Nobel Prize","Nobel laureate (related term)","prizewinner (general)"],"phonetic":"/noʊˈbɛl/","extraExplanation":["“Nobel”常作专有名词使用：说某人“a Nobel laureate”表示“诺贝尔奖得主/诺贝尔奖获得者”；“laureate”本义与“桂冠”相关，含“受表彰的人”。","诺贝尔奖通常指六个类别：物理、化学、生理学或医学、文学、和平，以及后来设立的“瑞典央行纪念阿尔弗雷德·诺贝尔经济学奖”（常被口语称为“诺贝尔经济学奖”，但严格来说不在诺贝尔原始遗嘱奖项之列）。","文化上，“Nobel”常被当作“世界最高荣誉之一”的象征，因此新闻标题里会用“Nobel-winning / Nobel laureate”来强调权威与影响力。"]}
{"word":"nobel","summary":{"en":"Nobel is a Swedish name closely linked to Alfred Nobel and the Nobel Prizes; it’s often used to mean “the Nobel Prize.”","zh":"Nobel（诺贝尔）是与阿尔弗雷德·诺贝尔及诺贝尔奖密切相关的瑞典姓氏，也常被用来指“诺贝尔奖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A Swedish surname best known from Alfred Nobel, the founder of the Nobel Prizes; often used to refer to the Nobel Prize itself in casual speech.","zh":"（专有名词）瑞典姓氏，最著名的是诺贝尔奖创办者阿尔弗雷德·诺贝尔；口语中也常用来指“诺贝尔奖”本身。"},"examples":[{"en":"Marie Curie won two Nobel Prizes in different sciences.","zh":"玛丽·居里在不同科学领域两次获得诺贝尔奖。"},{"en":"He dreams of someday getting a Nobel for his research.","zh":"他梦想有一天因研究获得诺贝尔奖。"},{"en":"Alfred Nobel’s will created the prizes after his death.","zh":"阿尔弗雷德·诺贝尔在遗嘱中设立了这些奖项，并在他去世后开始颁发。"}]}],"synonyms":["Nobel Prize (common related term)"],"phonetic":"/noʊˈbɛl/","extraExplanation":["“Nobel”通常出现在固定搭配“Nobel Prize（诺贝尔奖）”。严格来说它是人名/姓氏，因此在写作中常大写；而“a Nobel”这种说法多见于口语或新闻标题，表示“一个诺贝尔奖/诺奖得主（指代）”。","诺贝尔奖最初设有物理、化学、生理学或医学、文学与和平奖；后来又有由瑞典央行设立的“诺贝尔经济学奖”（正式名称并非由诺贝尔遗嘱设立，但通常也被称为诺贝尔奖的一部分）。"]}
{"word":"nobelist","summary":{"en":"A Nobelist is someone who has won a Nobel Prize.","zh":"Nobelist 指诺贝尔奖获得者（诺奖得主）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has won a Nobel Prize","zh":"诺贝尔奖获得者（诺奖得主）"},"examples":[{"en":"The physicist became a Nobelist after her work changed how we understand light.","zh":"这位物理学家因其研究改变了我们对光的理解而成为诺贝尔奖得主。"},{"en":"Several Nobelists spoke at the university about science and ethics.","zh":"几位诺贝尔奖得主在这所大学里就科学与伦理发表了演讲。"}]}],"synonyms":["Nobel Prize winner","laureate"],"phonetic":"/ˈnoʊbəˌlɪst/","extraExplanation":["“Nobelist”来自“Nobel”（诺贝尔）+“-ist”（表示某类人），常用于新闻与学术语境，指获得诺贝尔奖的人。","诺贝尔奖由瑞典发明家阿尔弗雷德·诺贝尔（Alfred Nobel）的遗产设立，主要奖项包括物理、化学、生理学或医学、文学、和平，以及后来设立的“经济学奖”（严格名称为“瑞典国家银行纪念阿尔弗雷德·诺贝尔经济学奖”）。"]}
{"word":"nobelists","summary":{"en":"“Nobelists” means people who have won Nobel Prizes.","zh":"“Nobelists”指获得诺贝尔奖的人（诺贝尔奖得主们）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Nobelist: people who have won a Nobel Prize.","zh":"Nobelist（诺贝尔奖得主）的复数：指获得过诺贝尔奖的人。"},"examples":[{"en":"Many Nobelists have spoken about the social responsibilities of science.","zh":"许多诺贝尔奖得主都谈到过科学的社会责任。"},{"en":"The museum displayed letters written by Nobelists in literature.","zh":"博物馆展出了诺贝尔文学奖得主写的信件。"}]}],"synonyms":["Nobel laureates","laureates","prizewinners","award winners"],"phonetic":"/ˈnoʊbəlɪsts/","extraExplanation":["“Nobelist”来自“诺贝尔奖（Nobel Prize）”。英语里也常说“(Nobel) laureate（获奖者）”。","注意拼写：你输入的“nobelists”很像“novelists（小说家们）”。“Nobelist”是“诺贝尔奖得主”，而“novelist”是“写小说的人”，两者意思不同。"]}
{"word":"nobelium","summary":{"en":"Nobelium is a synthetic radioactive element (No), atomic number 102.","zh":"锘是一种人工合成的放射性元素（No），原子序数为 102。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man-made radioactive chemical element (symbol No), atomic number 102, in the actinide series","zh":"锘（化学元素符号 No），一种人工合成的放射性化学元素，原子序数 102，属于锕系元素"},"examples":[{"en":"Nobelium is a synthetic element, so it does not occur naturally in large amounts on Earth.","zh":"锘是一种人工合成元素，因此在地球上不会以大量天然形式存在。"},{"en":"In chemistry class, we learned that nobelium has the symbol No and atomic number 102.","zh":"在化学课上，我们学到锘的元素符号是 No，原子序数是 102。"}]}],"phonetic":"/noʊˈbiːliəm/","extraExplanation":["“nobelium（锘）”以诺贝尔奖创立者阿尔弗雷德·诺贝尔（Alfred Nobel）命名，元素名称常用于纪念著名科学家或重要人物。","锘的同位素寿命通常很短，主要用于核化学与基础研究领域，而不是日常材料或工业用途。","历史上关于锘的“发现归属”曾有争议（不同研究团队在不同时间报告了相关结果），这在人工合成超重元素的早期研究中较常见。"]}
{"word":"nobeliums","summary":{"en":"“Nobeliums” means multiple instances or types of the element nobelium (No), a synthetic radioactive element used in research.","zh":"“nobeliums” 指多个“锘（nobelium, No）”的样品或类型；锘是一种人工合成的放射性元素，主要用于科研。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of nobelium; a very rare, radioactive chemical element (symbol No) used mainly in scientific research","zh":"nobelium 的复数；一种极其稀有、具有放射性的化学元素（符号 No），主要用于科学研究"},"examples":[{"en":"Scientists study nobeliums to learn more about how very heavy elements behave.","zh":"科学家研究 nobeliums，以更多了解超重元素的性质。"},{"en":"Nobeliums are not found naturally in the environment; they are made in laboratories.","zh":"nobeliums 在自然环境中不存在；它们是在实验室里人工合成的。"}]}],"synonyms":["No (chemical symbol)"],"phonetic":"/noʊˈbiːliəm/","extraExplanation":["“Nobelium（锘）”是一种人工合成元素，原子序数为 102，通常通过粒子加速器用其他元素轰击而制得。","名称来自诺贝尔奖创立者阿尔弗雷德·诺贝尔（Alfred Nobel）。在实际英语里更常见的是单数形式 “nobelium”；复数 “nobeliums” 多用于泛指不同同位素或不同样品。"]}
{"word":"nobiliary","summary":{"en":"Nobiliary means “related to the nobility,” and it can also mean a reference list of noble families and titles.","zh":"nobiliary 意为“与贵族有关的”，也可指“贵族名录（记录贵族家族与头衔的工具书）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a family, title, or status) relating to the nobility; aristocratic.","zh":"（家族、头衔或身份）与贵族有关的；贵族的。"},"examples":[{"en":"The museum displayed nobiliary coats of arms from several European houses.","zh":"博物馆展出了几支欧洲贵族家族的贵族纹章。"},{"en":"He researched the nobiliary history of his surname to see if it had links to the aristocracy.","zh":"他研究自己姓氏的贵族史，想看看是否与贵族阶层有关联。"}]},{"partOfSpeech":"n.","definition":{"en":"A list or record of noble families and their titles (often in a reference book).","zh":"贵族名录；贵族家族及其头衔的登记册（常见于工具书）。"},"examples":[{"en":"She checked a nineteenth-century nobiliary to confirm the spelling of the title.","zh":"她查阅了一本19世纪的贵族名录，以确认头衔的拼写。"}]}],"synonyms":["aristocratic","noble","patrician","heraldic","peerage (book)"],"phonetic":"/noʊˈbɪliˌɛri/","extraExplanation":["“nobiliary”较偏正式、学术或历史语境，常用于谈论贵族制度、头衔体系、家族谱系与纹章学（heraldry）。","相关文化点：一些欧洲语言里常见的“贵族介词/粒子”（如法语 de、荷兰语 van）有时与贵族出身有关，但在现代并不一定代表贵族身份，需要结合具体历史背景判断。"]}
{"word":"nobilify","summary":{"en":"Nobilify means to make someone or something more noble, dignified, or morally elevated.","zh":"Nobilify 表示“使更高贵、更有尊严或更崇高（道德上提升）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something noble in character, status, or dignity; to ennoble","zh":"使（某人或某物）变得高贵、提升品格或地位；使更有尊严（同 ennoble）"},"examples":[{"en":"The speaker said education can nobilify a person’s mind and choices.","zh":"演讲者说，教育能使人的思想与选择更高尚。"},{"en":"In the novel, the hero’s sacrifice seems to nobilify his troubled past.","zh":"在小说里，英雄的牺牲似乎让他坎坷的过去显得更崇高。"}]}],"synonyms":["ennoble","elevate","dignify","uplift"],"phonetic":"/noʊˈbɪləˌfaɪ/","extraExplanation":["“nobilify”比较少见、偏文学或修辞色彩，日常英语里更常用 “ennoble” 或 “elevate”。","词源上可理解为 noble（高贵的）+ -ify（使……化），意思就是“使变得高贵/高尚”。"]}
{"word":"nobilis","summary":{"en":"Nobilis is Latin for “noble/distinguished,” most commonly seen as a species epithet in scientific names.","zh":"nobilis 是拉丁语“高贵/杰出”的意思，最常见于生物学学名中的种加词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in scientific names) “noble” or “distinguished”; a species epithet meaning the plant/animal is notable or of high quality.","zh":"（拉丁语，常用于生物学学名）“高贵的；杰出的”；作种加词时表示该物种“很出众/品质佳”。"},"examples":[{"en":"Abies nobilis is a fir tree whose name means “noble fir.”","zh":"Abies nobilis 是一种冷杉，它的名字意思是“高贵的冷杉”（noble fir）。"},{"en":"In Latin-based taxonomy, nobilis often suggests a species was considered remarkable.","zh":"在以拉丁语为基础的分类命名里，nobilis 常暗示该物种被认为“很出色、值得注意”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare in English outside taxonomy) noble; of high rank or character.","zh":"（在英语中较少单独使用，多见于学名语境）高贵的；品格高尚的。"},"examples":[{"en":"The manuscript glosses a hero as nobilis, meaning “noble.”","zh":"手稿注释把一位英雄写作 nobilis，意思是“高贵的”。"}]}],"synonyms":["noble","distinguished","notable","eminent"],"phonetic":"/ˈnoʊbɪlɪs/","extraExplanation":["nobilis 是拉丁语形容词，基本义为“高贵的/著名的”。在生物学双名法中，它常作为种加词（species epithet）出现，例如 Abies nobilis。","拉丁语形容词会随名词的“性/数/格”发生词形变化，因此在学名里你也可能看到相近形式（例如 nobili- 开头的变化），但含义通常都围绕“高贵、杰出、显著”。"]}
{"word":"nobilitate","summary":{"en":"Nobilitate is a rare word meaning “the nobility,” and it can also mean “to ennoble.”","zh":"nobilitate 是个少见词，主要指“贵族阶层”，也可作动词表示“使高贵/使受封为贵族”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the nobility; people of high social rank (an old or rare word).","zh":"贵族阶层；上层社会人士（较古旧或少见的用法）。"},"examples":[{"en":"In older texts, the nobilitate were expected to support the church and the poor.","zh":"在较古老的文本中，人们期望贵族阶层支持教会并救济穷人。"},{"en":"The novel contrasts the nobilitate with ordinary workers in the city.","zh":"这部小说把贵族阶层与城市里的普通工人作对比。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone noble in rank or character; to ennoble (rare/archaic).","zh":"使某人获得贵族身份或更高尚的品格；使……受封为贵族（罕见/古旧）。"},"examples":[{"en":"The king could nobilitate a loyal soldier for brave service.","zh":"国王可以因英勇服役而封赏忠诚的士兵为贵族。"},{"en":"Education was said to nobilitate the mind.","zh":"有人说教育能使心灵更高尚。"}]}],"synonyms":["nobility","aristocracy","peerage","upper class","ennoble"],"phonetic":"/noʊˈbɪlɪteɪt/","extraExplanation":["词源上来自拉丁语 nobilitas（“显贵、名望”）。现代英语更常用的对应词是 nobility（名词）和 ennoble（动词），所以你在当代文章中很少看到 nobilitate。","在文学或历史语境里，它常用来营造“古典/中世纪”的语气，或强调阶层与特权。"]}
{"word":"nobilitation","summary":{"en":"Nobilitation means the act of making someone a noble (ennoblement), and more rarely, the figurative process of becoming more noble in character or status.","zh":"nobilitation 指“封贵族/授爵”（ennoblement）；较少见地也可比喻为品格或地位的“高贵化/升华”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making someone a noble (giving a title such as duke, earl, etc.); ennoblement","zh":"授予贵族身份（如封爵等）的行为；使人贵族化；封贵族"},"examples":[{"en":"In medieval Europe, nobilitation could reward loyal service to the crown.","zh":"在中世纪欧洲，封贵族（nobilitation）可能用来奖赏对王室的忠诚服务。"},{"en":"The document records his nobilitation and the lands granted to his family.","zh":"这份文件记录了他被封贵族以及赐予家族的土地。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of becoming noble in character, status, or reputation (a more general, figurative sense)","zh":"（更广义、比喻）在品格、地位或声望上变得更高尚、更“贵族化”的过程"},"examples":[{"en":"She saw education as a kind of nobilitation of the human spirit.","zh":"她认为教育是一种让人类精神更高尚的“贵族化”（nobilitation）。"},{"en":"For him, public service was a path to moral nobilitation.","zh":"对他而言，公共服务是一条通向道德升华（nobilitation）的道路。"}]}],"synonyms":["ennoblement","elevation","aggrandizement","nobilization"],"phonetic":"/noʊˌbɪləˈteɪʃən/","extraExplanation":["这个词在现代英语里非常少见，更常用的对应词是 **ennoblement**（封爵/授贵族身份）或 **elevation**（提升地位）。","词源上可追溯到拉丁语 *nobilis*（高贵的、有名望的）相关词根。写作中用它会显得非常正式、历史感强。"]}
{"word":"nobilities","summary":{"en":"“Nobilities” most often means the noble class (plural groups of nobles) and less commonly refers to noble qualities in the plural.","zh":"“Nobilities”多指贵族阶层（多个贵族群体/家族），较少用于复数表示多种“高贵品质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the noble class in a society; people with hereditary titles (plural of “nobility”)","zh":"贵族阶层；有世袭头衔的人（“nobility”的复数）"},"examples":[{"en":"In many European histories, the nobilities owned large areas of land.","zh":"在许多欧洲历史中，贵族阶层拥有大片土地。"},{"en":"The king tried to balance the power of the nobilities and the merchants.","zh":"国王试图平衡贵族阶层与商人阶层的权力。"}]},{"partOfSpeech":"n.","definition":{"en":"noble qualities such as honor, generosity, and moral goodness (less common in the plural)","zh":"高贵品质，如荣誉、慷慨与道德上的善良（复数用法较少）"},"examples":[{"en":"She was respected for her nobilities of character.","zh":"她因品格上的高贵而受到尊敬。"},{"en":"The story praises the nobilities of courage and kindness.","zh":"这个故事赞颂勇气与善良等高贵品质。"}]}],"synonyms":["aristocracy","nobles","peerage","upper class"],"phonetic":"/noʊˈbɪləti/","extraExplanation":["“nobilities”是“nobility”的复数：常见于历史/社会学语境，强调“多个贵族群体、不同地区的贵族”或“若干贵族家族”。日常英语里更常用不可数的“the nobility”来指整体贵族阶层。","在表示“高贵品质”时，英语更常用单数/不可数的“nobility”（如：the nobility of his actions）。使用复数“nobilities”会带一点书面或文学色彩，强调“多种高贵之处”。"]}
{"word":"nobility","summary":{"en":"Nobility means (1) the aristocratic class with inherited titles, or (2) the quality of moral greatness and honor.","zh":"nobility 指（1）拥有世袭头衔的贵族阶层；或（2）高尚、正直等崇高品格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A social class of people with high rank in society, especially those who have inherited titles (such as duke, count, or baron).","zh":"贵族阶层；（尤指）拥有世袭头衔的上层社会人群（如公爵、伯爵、男爵等）。"},"examples":[{"en":"In the past, the nobility owned much of the land in Europe.","zh":"过去，欧洲的许多土地都由贵族掌握。"},{"en":"She studied the lives of French nobility before the revolution.","zh":"她研究法国大革命前贵族的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being noble—showing high moral character, honor, and generosity.","zh":"高尚品质；崇高、正直与慷慨等道德品格。"},"examples":[{"en":"Many admired his nobility in helping others without expecting praise.","zh":"许多人敬佩他不求回报地帮助他人的高尚品格。"},{"en":"The story highlights the nobility of forgiveness.","zh":"这个故事突出了宽恕的高尚。"}]}],"synonyms":["aristocracy","peerage","upper class","honor","virtue","magnanimity"],"phonetic":"/noʊˈbɪləti/","extraExplanation":["“nobility”既可以指“社会阶层”（贵族），也可以指“品格”（高尚）。写作中要靠上下文判断：谈头衔、土地、宫廷等多为“贵族”；谈品德、勇气、宽恕等多为“高尚”。","词源上与 Latin “nobilis”（著名的、高贵的）有关，所以它既能表示“出身/地位的高贵”，也能表示“精神/品格的高贵”。"]}
{"word":"nobis","summary":{"en":"“nobis” is a Latin form meaning “to/for us,” and sometimes “by/with/from us,” depending on context.","zh":"“nobis”是拉丁语词形，常表示“给/为了我们”，也可在语境中表示“由/与/从我们”。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(Latin; dative or ablative plural of “nos”) to/for us; for our benefit.","zh":"（拉丁语；“nos”的与格/夺格复数）给我们；为了我们（的利益）。"},"examples":[{"en":"The motto includes “pro nobis,” meaning “for us.”","zh":"这句格言里有“pro nobis”，意思是“为了我们”。"},{"en":"In a formal inscription, “nobis” can mean “to us.”","zh":"在正式碑文中，“nobis”可以表示“给我们”。"}]},{"partOfSpeech":"pron.","definition":{"en":"(Latin; ablative plural) by/with/from us (the exact meaning depends on context).","zh":"（拉丁语；夺格复数）由我们；与我们一起；从我们（具体含义看上下文）。"},"examples":[{"en":"A text may use “nobis” after a preposition to mean “with us.”","zh":"在某些文本中，“nobis”可跟在介词后表示“与我们一起”。"},{"en":"“Nobis” in Latin often needs the surrounding sentence to translate naturally.","zh":"拉丁语里的“nobis”通常需要结合整句才能自然翻译。"}]}],"synonyms":["us (English equivalent, context-dependent)"],"phonetic":"/ˈnoʊbɪs/","extraExplanation":["“nobis”不是常见英文单词，而是拉丁语代词“nos（我们）”的变格形式。与格常对应英语里的“to/for us”，夺格常对应“by/with/from us”。","你可能在宗教或格言里见到它：例如祷文中常见“ora pro nobis”（为我们祈祷），或短语“pro nobis”（为了我们/为我们而做）。","拉丁语依靠“格”（case）来表达句子关系，所以同一个词形在不同句子里翻法会变；翻译时优先看它前面是否有介词（如 pro, cum 等）以及动词需要的结构。"]}
{"word":"noble","summary":{"en":"Noble most commonly means morally admirable (honest, brave, unselfish). It can also mean aristocratic, or refer to a person of high rank.","zh":"noble 常指“品德高尚的”。也可指“贵族的”，或作名词表示“贵族成员”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having high moral qualities; honest, brave, and unselfish","zh":"高尚的；品格崇高的（正直、勇敢、无私）"},"examples":[{"en":"It was noble of her to tell the truth even when it was difficult.","zh":"即使很难，她仍说出真相，这很高尚。"},{"en":"He made a noble effort to help his neighbors after the storm.","zh":"暴风雨后，他竭力帮助邻居，这是高尚的努力。"}]},{"partOfSpeech":"adj.","definition":{"en":"belonging to a high social class (aristocracy), especially by birth or title","zh":"贵族的；出身或头衔属于上层阶级的"},"examples":[{"en":"The story is set in a noble family’s mansion.","zh":"故事发生在一个贵族家庭的宅邸里。"},{"en":"In the past, only nobles had certain legal privileges.","zh":"过去，只有贵族才享有某些法律特权。"}]},{"partOfSpeech":"n.","definition":{"en":"a person of high social rank, such as a duke, count, or baron","zh":"贵族成员（如公爵、伯爵、男爵等）"},"examples":[{"en":"Many nobles attended the king’s ceremony.","zh":"许多贵族参加了国王的典礼。"}]}],"synonyms":["honorable","upright","selfless","virtuous","aristocratic"],"phonetic":"/ˈnoʊbəl/","extraExplanation":["“noble”有两条常见含义：一是“品德高尚”，二是“贵族/贵族的”。学习时可用语境区分：谈行为与品格多指第一义；谈家族、头衔、阶层多指第二义。","在文学与历史语境中，“noble”常与“honor（荣誉）”“virtue（美德）”“chivalry（骑士精神）”等词一起出现。莎士比亚作品中也常用“noble”称呼地位尊贵的人或赞美其品格。"]}
{"word":"nobled","summary":{"en":"“Nobled” is an uncommon past form of the verb “noble,” meaning “made noble” (more often: “ennobled”).","zh":"“nobled” 是不太常见的动词 noble 的过去式/过去分词，表示“使变得高贵/高尚”（更常用：ennobled）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of the verb “noble”) to make someone or something noble; to give higher moral value or social rank (often written as “ennobled”).","zh":"（动词 noble 的过去式/过去分词）使……变得高贵；提升……的道德价值或社会地位（更常见写法是 ennobled）。"},"examples":[{"en":"His courage in the crisis nobled him in the eyes of the community.","zh":"他在危机中的勇气，让他在社区的人眼里更显高贵。"},{"en":"Many people believe hardship can nobled a person’s character.","zh":"很多人认为，艰难困苦能提升一个人的品格。"}]}],"synonyms":["ennobled","elevated","dignified","uplifted"],"phonetic":"ˈnoʊbəl","extraExplanation":["“nobled” 作为动词形式在现代英语里不常见，写作和正式表达中更常用 “ennobled”。","形容词 “noble” 更常见，意思是“高尚的/贵族的”（如：a noble goal 高尚的目标；a noble family 贵族家庭）。"]}
{"word":"noblehearted","summary":{"en":"“Noblehearted” means kind, generous, and morally honorable.","zh":"“noblehearted” 指心地善良、慷慨，并具有道德上高尚正直的品格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a kind, generous, and honorable character; showing a strong desire to do what is right and to help others.","zh":"心地高尚的；仁厚慷慨、正直有荣誉感的；乐于助人的。"},"examples":[{"en":"She is noblehearted and always volunteers when someone needs help.","zh":"她心地高尚，只要有人需要帮助就会去做志愿者。"},{"en":"A noblehearted leader listens to people and makes fair decisions.","zh":"心地高尚的领导者会倾听民意，并做出公正的决定。"}]}],"synonyms":["kind-hearted","big-hearted","warm-hearted","generous","noble-minded"],"phonetic":"/ˌnoʊbəlˈhɑr.tɪd/","extraExplanation":["这是由 noble（高尚的、贵族的）+ hearted（……心肠的）组成的复合形容词，强调“内在品格”而不强调出身地位。","常见近义表达有 kind-hearted, big-hearted, warm-hearted；noblehearted 更带有“道德崇高、正直”的色彩。","在现代英语里它不算最常用的日常词，更常见于较正式、文学或赞美性的语境。"]}
{"word":"nobleheartedly","summary":{"en":"“Nobleheartedly” means doing something with a noble, generous, honorable heart.","zh":"“nobleheartedly”表示以高尚、慷慨、正直的心去做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a noble-hearted way; with generous, honorable, and kind intentions (especially when helping or sacrificing for others).","zh":"以高尚仁厚的方式；出于慷慨、正直、善良的动机（尤指帮助他人或做出牺牲时）。"},"examples":[{"en":"She nobleheartedly offered her time to tutor children for free.","zh":"她以高尚的心意奉献时间，免费辅导孩子们。"},{"en":"He nobleheartedly apologized, even though he wasn’t fully at fault.","zh":"尽管他不完全有错，他仍以宽厚正直的态度道歉。"}]}],"synonyms":["nobly","generously","selflessly","honorably","with a noble heart"],"phonetic":"/ˌnoʊbəlˈhɑːrtɪdli/","extraExplanation":["“nobleheartedly”比较少见，更常见的表达是“nobly”“with a noble heart”“generously”“selflessly”。它由“noble-hearted（高尚仁厚的）+ -ly（副词后缀）”构成，用来强调一个人做事的动机与品格，而不只是行为本身。","语气上，“nobleheartedly”带有一种文学/庄重色彩，常用于写作中赞美某人的善良与正直；日常口语里用“kindly / generously / selflessly”会更自然。"]}
{"word":"nobleheartedness","summary":{"en":"Nobleheartedness means having a kind, generous, and morally noble heart.","zh":"nobleheartedness 指心地善良、慷慨并具有道德高尚感的品格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being kind, generous, and morally honorable; a “noble heart.”","zh":"高尚仁厚的品格；心地善良、慷慨且有道德感的品质（“高贵的心”）。"},"examples":[{"en":"Her nobleheartedness showed when she helped a stranger without expecting anything back.","zh":"她在不求回报地帮助陌生人时，展现了高尚仁厚的品格。"},{"en":"The story celebrates nobleheartedness more than wealth or power.","zh":"这个故事赞美的是高尚仁厚，而不是财富或权力。"}]}],"synonyms":["nobility","kindness","generosity","magnanimity","big-heartedness"],"phonetic":"/ˌnoʊbəlˈhɑrtɪdnəs/","extraExplanation":["“nobleheartedness”由 noble（高尚的）+ hearted（心地……的）+ -ness（名词后缀）构成，强调“内心/动机”的高尚，而不仅是社会地位或出身。","这个词在日常英语中相对少见；更常见的近义表达有 nobility（高尚品格/崇高）、generosity（慷慨）、kindness（善良）、magnanimity（宽宏大量，较正式）。在文学、演讲或写作中使用会更自然。"]}
{"word":"nobleman","summary":{"en":"A nobleman is a man from the nobility, often with an inherited title and social privilege.","zh":"nobleman 指出身贵族的男性，常带有世袭头衔与社会特权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who belongs to the nobility (a high social class), often with an inherited title such as duke, earl, or baron.","zh":"贵族男子；属于贵族阶层的人（常有世袭头衔，如公爵、伯爵、男爵等）。"},"examples":[{"en":"In the story, a nobleman marries a commoner, which surprises the court.","zh":"故事里，一位贵族娶了平民，这让宫廷很惊讶。"},{"en":"The nobleman owned large estates and had political influence.","zh":"这位贵族拥有大片庄园，并具有政治影响力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) In some countries, a member of a ruling or landowning elite, even without a specific title.","zh":"（历史用法）在一些国家里，统治阶层或地主精英的成员，即使没有明确头衔也可称为贵族。"},"examples":[{"en":"Many noblemen served as officers in the army.","zh":"许多贵族曾在军队中担任军官。"},{"en":"The reform reduced the privileges of noblemen.","zh":"这场改革削减了贵族的特权。"}]}],"synonyms":["aristocrat","peer","lord","blueblood"],"phonetic":"/ˈnoʊbəlmən/","extraExplanation":["“nobleman”常出现在欧洲历史与文学语境中，和封建制度、宫廷生活、土地与世袭特权有关。女性对应词是“noblewoman”。","在现代英语里，如果强调“有头衔的贵族”，也常用“peer”（英国）或直接说“a duke / an earl”等具体头衔；若更泛指“上流社会/精英”，可能会用更中性的说法（如 “aristocrat”）。"]}
{"word":"noblemanly","summary":{"en":"“Noblemanly” means having the style or manners of a nobleman; aristocratic (rare in modern use).","zh":"“noblemanly”意为“有贵族男子风度的；贵族式的”，现代用法较罕见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having the qualities, style, or manners associated with a nobleman; aristocratic or courtly.","zh":"（罕用）具有贵族（贵族男子）风度、气质或举止的；贵族式的、雅致而端庄的。"},"examples":[{"en":"He had a noblemanly manner, speaking calmly and bowing slightly.","zh":"他举止很有贵族风度，说话沉稳，还微微鞠躬。"},{"en":"The actor wore a noblemanly costume that suggested wealth and rank.","zh":"那位演员穿着一身贵族式服装，暗示着财富与地位。"}]}],"synonyms":["aristocratic","noble","courtly","gentlemanly","upper-class"],"phonetic":"/ˈnoʊbəlmənli/","extraExplanation":["“noblemanly”由 nobleman（贵族男子）+ -ly（构成形容词，表示“……的”）组成，但在现代英语中非常少见。日常更常用的替代表达是 aristocratic、noble、courtly、gentlemanly。","语感上它常用于描写“举止/风度/气派”（manner, bearing, air），带有文学描写或复古色彩，偶尔也可能带一点讽刺意味，取决于上下文。"]}
{"word":"noblemem","summary":{"en":"A nobleman is a man from the nobility (or, more generally, a man of high social rank).","zh":"nobleman 指“贵族男子”，也可泛指“社会地位很高的男子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who belongs to the nobility (the upper social class with inherited titles such as duke, earl, or lord), especially in traditional European societies.","zh":"贵族男子；（尤指传统欧洲社会中）拥有世袭头衔的上层阶级男性（如公爵、伯爵、勋爵等）。"},"examples":[{"en":"In many old stories, a nobleman is expected to protect the weak and act with honor.","zh":"在许多古老故事里，贵族男子被期望保护弱者、行事光荣正直。"},{"en":"The novel describes a nobleman who falls in love with someone from a different social class.","zh":"这部小说描写了一位贵族男子爱上了来自不同社会阶层的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(More generally) A man of high rank or social importance.","zh":"（更广义）地位很高或很有影响力的男子。"},"examples":[{"en":"He was treated like a nobleman because of his wealth and connections.","zh":"由于他的财富和人脉，人们像对待贵族一样对待他。"}]}],"synonyms":["aristocrat","lord","peer","blueblood"],"phonetic":"/ˈnoʊbəlmən/","extraExplanation":["你输入的“noblemem”很可能是拼写错误，常见正确拼写是“nobleman”（复数：noblemen）。","词源上，“noble”表示“高贵的”，加上“man”指“男子”。在文学作品（如历史小说、童话）中常用来塑造“贵族”“骑士精神”“阶级差异”等主题。"]}
{"word":"noblemen","summary":{"en":"“Noblemen” is the plural of “nobleman,” meaning men of the nobility (high social rank, often with inherited titles).","zh":"“noblemen”是“nobleman”的复数，指贵族男子（社会地位高、常有世袭头衔）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Men who belong to the nobility (the social class with inherited titles and high rank), especially in older European societies.","zh":"贵族男子；（尤指旧时欧洲）拥有世袭头衔、社会地位很高的男性贵族。"},"examples":[{"en":"In the story, the noblemen gather at the king’s court to give advice.","zh":"在故事里，贵族们聚集在国王的宫廷里提出建议。"},{"en":"Only noblemen were allowed to hold certain positions in that period.","zh":"在那个时期，只有贵族才被允许担任某些职位。"}]}],"synonyms":["aristocrats","lords","peers"],"phonetic":"/ˈnoʊbəlmən/","extraExplanation":["“nobleman”的复数是“noblemen”。它常出现在历史、文学或奇幻题材中，强调封建社会的阶层结构（如国王、贵族、骑士、平民等）。","与之相关的常见词：nobility（贵族阶层）, aristocrat（贵族/上层人士，较通用）, lord（领主/贵族称呼，英式语境常见）, peer（英国贵族体系中的“贵族成员”）。"]}
{"word":"nobleness","summary":{"en":"“Nobleness” means moral nobility (honor, generosity) and, less commonly, aristocratic rank.","zh":"“nobleness”主要指品格上的高贵（荣誉感、慷慨等），较少情况下也指贵族身份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being noble in character: having high moral principles, generosity, and honor.","zh":"高贵（品格）：指具有高尚的道德、慷慨与荣誉感的品质。"},"examples":[{"en":"Many people admired her nobleness when she forgave those who hurt her.","zh":"很多人钦佩她的高贵品格，因为她原谅了伤害过她的人。"},{"en":"In the novel, the hero’s nobleness shows in his willingness to protect the weak.","zh":"在小说里，男主角的高贵体现在他愿意保护弱者。"}]},{"partOfSpeech":"n.","definition":{"en":"High social rank or aristocratic status (less common in modern everyday English).","zh":"贵族身份、显赫的社会地位（现代日常英语中较少用）。"},"examples":[{"en":"The story contrasts true nobleness of heart with mere nobleness of birth.","zh":"这个故事对比了真正的“内心高贵”和仅仅“出身高贵”。"},{"en":"Titles and nobleness were important in that historical period.","zh":"在那个历史时期，头衔和贵族身份很重要。"}]}],"synonyms":["nobility","noble-mindedness","honor","integrity","magnanimity","elevation"],"phonetic":"/ˈnoʊb(ə)lnəs/","extraExplanation":["“nobleness”来自形容词“noble”（高尚的/贵族的）+ 名词后缀“-ness”（……的性质）。现代英语里谈“高尚品格”更常用“nobility”（n. 高贵；贵族阶层）或“nobility of spirit/character”（精神/品格的高贵）。","常见搭配：nobleness of heart（心地善良/高贵）、nobleness of character（品格高尚）。注意区分：nobleness（品质/出身的“高贵”） vs. kindness（善良） vs. integrity（正直） vs. honor（荣誉感/名誉）。"]}
{"word":"noblenesses","summary":{"en":"“Noblenesses” means multiple noble qualities or dignified features; it’s an uncommon plural of “nobleness.”","zh":"“noblenesses”指多种高贵品格或多处庄重高雅之处；是较少见的“nobleness”复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nobleness”: the qualities of being noble—showing high moral character, generosity, and honorable behavior.","zh":"“nobleness”的复数：高贵品格的多种表现——指高尚的道德、慷慨与光明磊落的行为。"},"examples":[{"en":"Her speech praised the noblenesses of the volunteers: courage, kindness, and honesty.","zh":"她的演讲赞扬了志愿者们的高贵品格：勇气、善良与诚实。"},{"en":"In old stories, a hero’s noblenesses are tested by hardship.","zh":"在古老故事里，英雄的高贵品格常在苦难中受到考验。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Multiple instances or forms of “nobleness” in style or spirit; a dignified, elevated quality in writing, art, or manners.","zh":"（较少见）多种“庄重高雅”的气质或风格；指写作、艺术或举止中高雅而端正的格调。"},"examples":[{"en":"The poem has several quiet noblenesses in its language and rhythm.","zh":"这首诗的语言与节奏里有几处沉静的高雅格调。"}]}],"synonyms":["noble qualities","virtues","honor","integrity","magnanimity","dignity"],"phonetic":"/ˈnoʊb(ə)lnəsɪz/","extraExplanation":["“noblenesses”不太常见，更常用的是不可数名词“nobleness”（高贵、崇高品格）。在文学评论里，为了强调“多种高贵之处/多处高雅格调”，才会用复数。","注意不要和“nobility”（贵族阶层/贵族气质）混淆：nobleness更强调个人的道德品质，nobility既可指社会阶层，也可指气质。"]}
{"word":"nobler","summary":{"en":"“Nobler” means “more noble,” usually describing a more honorable or unselfish character or choice; less commonly, it can mean “more aristocratic.”","zh":"“nobler”意为“更高尚的/更可敬的”（最常见），较少情况下也可指“更贵族的/地位更高的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “noble”: having more admirable qualities such as honesty, courage, generosity, or unselfishness.","zh":"“noble（高尚的）”的比较级：在诚实、勇气、慷慨、无私等品质上更高尚、更可敬。"},"examples":[{"en":"She made the nobler choice by telling the truth, even though it was hard.","zh":"她选择了更高尚的做法：即使很难也要说出真相。"},{"en":"Helping others is a nobler goal than chasing fame.","zh":"帮助他人是比追逐名声更高尚的目标。"}]},{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “noble”: belonging to a higher social rank or aristocratic class (less common in everyday modern use).","zh":"“noble（贵族的）”的比较级：社会地位更高、更加贵族的（现代日常使用较少）。"},"examples":[{"en":"In the novel, he is from a nobler family than his rival.","zh":"在小说里，他的家世比对手更显贵族。"},{"en":"The palace reserved the nobler seats for the royal guests.","zh":"宫殿把更尊贵的座位留给皇室宾客。"}]}],"synonyms":["more noble","more honorable","more admirable","more virtuous"],"phonetic":"/ˈnoʊb(ə)lər/","extraExplanation":["“nobler”是规则比较级：noble → nobler（更高尚/更贵族）。最高级是 “noblest”。在英语里常用于对比两种选择或两种品质：the nobler choice/act/goal。","含义上，“noble”既可指“道德高尚”，也可指“贵族出身”。现代英语更常用道德意义；谈社会阶层时多出现在历史/文学语境。"]}
{"word":"nobles","summary":{"en":"“Nobles” means people who belong to the nobility or upper class, especially in historical societies.","zh":"“nobles”指贵族阶层的人，尤用于历史社会语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People of the nobility; members of a high social class (such as dukes, earls, or lords), especially in traditional European societies.","zh":"贵族；上层阶级成员（如公爵、伯爵、领主等），尤指传统欧洲社会中的有封号阶层。"},"examples":[{"en":"In the past, nobles often owned large areas of land.","zh":"过去，贵族常常拥有大片土地。"},{"en":"The king invited the nobles to a formal banquet at the palace.","zh":"国王邀请贵族们到宫殿参加正式宴会。"},{"en":"Many stories show conflicts between nobles and common people.","zh":"许多故事都会描写贵族与平民之间的矛盾。"}]}],"synonyms":["aristocrats","nobility","lords","upper class"],"phonetic":"/ˈnoʊbəlz/","extraExplanation":["“nobles”是名词“noble”的复数形式。英语里常用“the nobles”来泛指“贵族阶层”。","历史语境中，“nobles”常与封建制度、世袭头衔、土地所有权和政治特权有关；现代语境下也可用于文学或历史讨论。","相关文化表达：常见搭配有“nobles and commoners（贵族与平民）”“noble class（贵族阶层）”“hereditary nobles（世袭贵族）”。"]}
{"word":"noblesse","summary":{"en":"Noblesse means the noble class (aristocracy), often used in French or historical contexts.","zh":"noblesse 指“贵族阶层/贵族”，多用于法式或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the noble class; aristocracy (especially in France or in historical contexts)","zh":"贵族阶层；贵族（尤指法国或历史语境中）"},"examples":[{"en":"Before the revolution, much of the land was controlled by the noblesse.","zh":"在革命之前，许多土地都由贵族阶层掌控。"},{"en":"The novel portrays the lives of the noblesse and the working poor side by side.","zh":"这部小说并置描写了贵族与劳动贫民的生活。"}]}],"synonyms":["the nobility","aristocracy","upper class"],"phonetic":"/noʊˈblɛs/","extraExplanation":["“noblesse”是法语借词，原意与“贵族身份/出身”有关；在英语里常见于历史、文学或带一点“旧时代/欧洲宫廷”气氛的写法。","学习时要注意它与短语“noblesse oblige”（地位越高、责任越大）关系密切：noblesse指“贵族阶层/贵族身份”，oblige指“迫使/要求”。","在英语中单独用noblesse时，语气往往偏书面或带文化背景；日常口语更常说“the nobility”或“the aristocracy”。"]}
{"word":"noblesses","summary":{"en":"“Noblesses” is the plural of “noblesse,” meaning either the nobility or (more often in modern use) the idea that privilege brings responsibility (“noblesse oblige”).","zh":"“noblesses”是“noblesse”的复数，可指“贵族阶层”，也可指（现代更常见）“特权伴随责任”的观念，常见于“noblesse oblige”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the nobility; people of high social rank (a French loanword, now fairly rare in everyday English)","zh":"贵族阶层；上层社会人士（法语外来词，在日常英语中较少单独使用）"},"examples":[{"en":"In the old story, the noblesse lived in a palace while the villagers worked the land.","zh":"在这个古老的故事里，贵族住在宫殿里，而村民耕作土地。"},{"en":"The museum display explains how the noblesse dressed and behaved at court.","zh":"博物馆展览解释了贵族在宫廷中的穿着与礼仪。"}]},{"partOfSpeech":"n.","definition":{"en":"a sense of honor and responsibility expected from people with power or privilege (often expressed in the phrase “noblesse oblige”)","zh":"有权势或享有特权者被期待具备的荣誉感与责任感（常见于短语“noblesse oblige”）"},"examples":[{"en":"She donated quietly, believing that noblesse oblige.","zh":"她低调捐助，认为“位高者当尽责”（noblesse oblige）。"},{"en":"The speech argued that with privilege comes duty—noblesse oblige.","zh":"演讲强调特权伴随责任——这就是“noblesse oblige”。"}]}],"synonyms":["the nobility","aristocracy","upper class","privilege","duty","responsibility"],"phonetic":"/noʊˈblɛs/","extraExplanation":["“noblesse”来自法语，字面与“贵族身份/贵族阶层”有关。英语里更常把它保留在固定表达“noblesse oblige”（直译：贵族身份使人有义务）中，用来强调“有资源/有地位的人更应承担社会责任”。","你输入的“noblesses”是复数形式，表示“多位/多个贵族阶层（或多种贵族群体）”；但在现代英语里单独用复数并不常见，更多场景会直接用“the nobility”或用短语“noblesse oblige”。"]}
{"word":"noblest","summary":{"en":"“Noblest” means “most noble,” usually describing the highest moral character (or, less commonly, the highest social rank).","zh":"noblest 意为“最崇高/最高贵”，多指道德品质最为高尚（较少指社会地位最显贵）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most noble in character (showing the best moral qualities such as honesty, courage, and kindness) or in social rank.","zh":"最崇高的；最高贵的（指品格上最正直、勇敢、善良等，或指社会地位上最显贵的）。"},"examples":[{"en":"She made the noblest choice: telling the truth even though it would cost her.","zh":"她做出了最崇高的选择：即使会付出代价也要说出真相。"},{"en":"Helping someone without expecting anything in return is one of the noblest acts.","zh":"不求回报地帮助别人是最崇高的行为之一。"}]}],"synonyms":["most honorable","most noble-minded","most virtuous","most dignified"],"phonetic":"/ˈnoʊbəlist/","extraExplanation":["“noblest”是形容词“noble”的最高级，常用来强调“在一群人/事物中最值得尊敬”。常见搭配：the noblest goal（最崇高的目标）、the noblest of intentions（动机最纯正/最善意的）。","在文化语境里，noble既可指“贵族/高贵出身”，也更常用于“高尚的品格”。写作或演讲中用noblest会显得更庄重、更有道德评价色彩。","相关表达：a noble cause（崇高的事业）、noble-minded（思想高尚的）、nobility（高贵；贵族阶层）。"]}
{"word":"noblewoman","summary":{"en":"A woman who belongs to the nobility, often holding or connected to a hereditary title.","zh":"属于贵族阶层的女性，通常拥有或与世袭头衔相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman of noble rank, especially in a society with a hereditary aristocracy (for example, a duchess, countess, or baroness).","zh":"贵族女性；有世袭贵族身份或头衔的女性（如公爵夫人、伯爵夫人、男爵夫人等）。"},"examples":[{"en":"The noblewoman hosted a formal dinner at her estate.","zh":"这位贵族夫人在她的庄园里举办了一场正式晚宴。"},{"en":"In the novel, a young noblewoman challenges the strict rules of her class.","zh":"在小说中，一位年轻的贵族小姐挑战了她所属阶层的严格规矩。"}]}],"synonyms":["aristocrat","aristocratic woman","lady (in historical contexts)","peeress"],"phonetic":"/ˈnoʊbəlˌwʊmən/","extraExplanation":["“noblewoman”常见于历史语境、文学作品或讨论欧洲封建/贵族制度时。现代日常英语里，人们更常直接说具体头衔（如 duchess、countess）或用更宽泛的说法（如 aristocratic woman）。","构词很直观：noble（贵族的）+ woman（女性）。复数为 noblewomen。"]}
{"word":"noblewomen","summary":{"en":"“Noblewomen” means women who belong to the nobility, especially in historical or aristocratic contexts.","zh":"“noblewomen”指属于贵族阶层的女性，常用于历史或贵族社会语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women of the nobility (high social rank), especially in a historical or aristocratic society.","zh":"贵族女性；（尤指历史上或贵族社会中的）贵妇、贵族女子。"},"examples":[{"en":"In the medieval court, noblewomen often managed estates while their husbands were away.","zh":"在中世纪宫廷中，丈夫外出时，贵族女性常常负责管理庄园。"},{"en":"The novel describes noblewomen learning music, languages, and etiquette.","zh":"这部小说描写贵族女子学习音乐、语言和礼仪。"}]}],"synonyms":["aristocratic women","women of the nobility","ladies of rank"],"phonetic":"/ˈnoʊbəlˌwɪmɪn/","extraExplanation":["“noblewomen”是“noblewoman”的复数：noble（贵族的）+ woman（女性）。常见于历史、文学、社会阶层相关语境。","在现代英语里，如果只是泛指“地位高的女性”，更常用“upper-class women / aristocratic women”；“noblewomen”通常暗示有明确的贵族身份（如公爵夫人、伯爵夫人等）。"]}
{"word":"nobley","summary":{"en":"“Nobly” means doing or speaking in an honorable, generous, or admirable way.","zh":"“nobly”（常见拼写）指以高尚、体面、慷慨或令人敬佩的方式行事或表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a noble way: with honor, generosity, or high moral character.","zh":"高尚地；有尊严地；慷慨正直地（以高贵或有道德感的方式）"},"examples":[{"en":"She spoke nobly about helping those in need.","zh":"她高尚地谈到要帮助有需要的人。"},{"en":"He accepted the criticism nobly and tried to improve.","zh":"他很有风度地接受了批评，并努力改进。"},{"en":"They fought nobly for justice.","zh":"他们为正义而英勇奋斗。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Literary/old-fashioned) In a way that is grand, impressive, or worthy of admiration.","zh":"（文学/较古风）庄严地；宏伟地；令人敬佩地"},"examples":[{"en":"The music rose nobly and filled the hall.","zh":"音乐庄严地响起，充满了整个大厅。"},{"en":"The idea was nobly expressed in his writing.","zh":"这个观点在他的文字中被庄重而有力地表达出来。"}]}],"synonyms":["honorably","with dignity","generously","magnanimously","heroically"],"phonetic":"/ˈnoʊbli/","extraExplanation":["你输入的“nobley”通常不是标准拼写；更常见的是 **nobly**（副词），来自形容词 **noble**（高尚的、贵族的）+ -ly。","**nobly** 常用于描述人的态度、行为或言谈（比如 *accept nobly, speak nobly*），语气偏正式；日常口语里也可以用 *with dignity / honorably* 来表达类似意思。"]}
{"word":"noblify","summary":{"en":"“Noblify” means to make someone or something more noble or elevated, often in a moral or symbolic sense.","zh":"“noblify”指使某人或某事更高尚、更崇高，常带有道德或象征性的提升含义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something noble in character, status, or spirit; to ennoble or elevate","zh":"使（某人/某事）更高尚；使显得崇高；使提升（地位/精神）"},"examples":[{"en":"Education can noblify a person by teaching empathy and responsibility.","zh":"教育能通过培养同理心和责任感，使一个人更高尚。"},{"en":"She tried to noblify his mistakes by calling them “lessons.”","zh":"她试图把他的错误说成“教训”，让这些错误显得更崇高。"},{"en":"The story noblifies ordinary people who quietly help their neighbors.","zh":"这个故事歌颂那些默默帮助邻居的普通人。"}]}],"synonyms":["ennoble","elevate","dignify","exalt","uplift"],"phonetic":"/ˈnoʊbləˌfaɪ/","extraExplanation":["“noblify”较少见，更常用的近义词是“ennoble”（使高尚/使贵族化）或“elevate”（提升/抬高）。","词源上来自“noble（高贵的）+ -ify（使……化）”，常用于书面语或修辞性表达，强调“赋予崇高感”。"]}
{"word":"nobling","summary":{"en":"“Nobling” is likely a misspelling of “nobbling,” from the verb “nobble,” meaning to catch/arrest someone or to sabotage unfairly (and in racing, to drug/harm a horse).","zh":"“nobling”很可能是“nobbling”的误拼，来自动词“nobble”，意思是抓住/逮捕某人，或用不正当手段暗中破坏（赛马语境中也可指给马下药或伤害马）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal, especially British) to catch, arrest, or stop someone (often a criminal).","zh":"（非正式，尤英式）抓住、逮捕或制止某人（常指罪犯）。"},"examples":[{"en":"The police finally nobbled the burglar after a long chase.","zh":"经过长时间追捕，警方终于抓住了那个入室盗贼。"},{"en":"He was nobbled at the airport before he could leave the country.","zh":"他还没来得及出境，就在机场被逮住了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to unfairly prevent someone from succeeding; to sabotage (for example, by interfering or bribing).","zh":"用不正当手段阻止成功；破坏、暗中使绊子（如干扰或贿赂）。"},"examples":[{"en":"They tried to nobble the deal by spreading rumors.","zh":"他们试图通过散布谣言来搅黄这笔交易。"},{"en":"The runner claimed he was nobbled before the final race.","zh":"那名跑者声称自己在决赛前被人暗算了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(sports, especially horse racing) to drug or harm a horse so it cannot perform well.","zh":"（体育，尤指赛马）给马下药或伤害马匹，使其无法正常发挥。"},"examples":[{"en":"The trainer was banned for allegedly nobbling a rival horse.","zh":"那名训练师因涉嫌对对手的马下药而被禁赛。"}]}],"synonyms":["catch","arrest","nab","bust","sabotage","undermine"],"phonetic":"ˈnɑbəl","extraExplanation":["“nobling”通常不是标准拼写，更常见的是动词 **nobble**，其现在分词是 **nobbling**。如果你想表达“高贵的/贵族的”，可能是 **noble**（adj.）。","**nobble** 多见于英式英语的口语与新闻语境，带有“逮住/暗中搞破坏”的意味；在赛马相关语境中，含义更具体，常指对马“下药/使其失去竞争力”。"]}
{"word":"nobly","summary":{"en":"Nobly means doing something in an honorable, morally good, or dignified way (sometimes with a traditional “noble/upper-class” feel).","zh":"nobly 表示“高尚地、光荣地、庄重地”去做某事；有时也带“贵族风度”的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows high moral character, generosity, courage, or honor.","zh":"高尚地；以崇高的品格（慷慨、勇敢、正直、荣誉感）行事地。"},"examples":[{"en":"She spoke nobly about forgiveness, even after being treated unfairly.","zh":"即使被不公平对待，她仍以高尚的态度谈论宽恕。"},{"en":"He acted nobly by returning the lost wallet without taking anything.","zh":"他高尚地归还了丢失的钱包，没有拿走任何东西。"},{"en":"They chose to share credit nobly instead of competing for attention.","zh":"他们高尚地选择分享功劳，而不是争夺关注。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that fits the style or behavior traditionally associated with nobles (the upper social class), such as being dignified and refined.","zh":"像贵族那样地（举止端庄、得体、优雅）；有贵族风度地。"},"examples":[{"en":"He carried himself nobly in a tailored suit.","zh":"他穿着剪裁合身的西装，举止颇有贵族风度。"},{"en":"The hero dies nobly at the end of the story.","zh":"故事结尾，英雄以庄严的方式死去。"}]}],"synonyms":["honorably","generously","courageously","dignifiedly"],"phonetic":"/ˈnoʊbli/","extraExplanation":["“nobly”来自形容词“noble”（高尚的；贵族的）。在现代英语里更常用的是“道德上的高尚”，而“贵族阶层”的含义多见于历史或文学语境。","常见搭配：act/speak/behave nobly（高尚地行动/说话/表现）；die nobly（庄严地死去）。","近义词（语气相近）：honorably（光荣地）、generously（慷慨地）、courageously（勇敢地）。注意：nobly强调“品格/尊严”，不一定等于“礼貌”(politely)。"]}
{"word":"nobodies","summary":{"en":"“Nobodies” means people seen as unimportant or unknown, often in a rude or dismissive way.","zh":"“nobodies”指被认为不重要或不知名的人，语气常带轻视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are not famous, not powerful, or considered unimportant (often informal and can sound insulting).","zh":"无名小卒；不重要的人（多为非正式用法，可能带贬义/冒犯）"},"examples":[{"en":"The media treated them like nobodies, even though they did the hardest work.","zh":"媒体把他们当成无名小卒，尽管最辛苦的活是他们在做。"},{"en":"Don’t call people “nobodies”—everyone deserves respect.","zh":"别把人叫作“无名小卒”——每个人都值得尊重。"}]}],"synonyms":["unknowns","ordinary people","no-names","insignificant people"],"phonetic":"/ˈnoʊˌbɑdiz/","extraExplanation":["“nobodies”是“nobody”的复数。语气常带轻视，尤其在谈论社会地位、名气或权力时；在正式或礼貌场合建议改用更中性的说法，如“ordinary people（普通人）”“unknown people（不知名的人）”。","常见对比结构：from nobody to somebody（从无名之辈到成名/出头）。在自我介绍或励志语境里也可能是自嘲式用法，但对他人使用容易显得刻薄。"]}
{"word":"nobody","summary":{"en":"“Nobody” most commonly means “no person.” It can also mean “an unimportant person.”","zh":"“nobody”最常见的意思是“没有人”。也可表示“无足轻重的人/小人物”。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"No person; not anyone (used in statements to mean that zero people do something or are present).","zh":"没有人；无人（用于陈述句，表示做某事或在场的人数为零）。"},"examples":[{"en":"Nobody knows the answer.","zh":"没有人知道答案。"},{"en":"There was nobody at home.","zh":"家里没有人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is not important or is treated as unimportant (often used to show low status or self-doubt).","zh":"无足轻重的人；小人物（常用来表达地位低或自我否定）。"},"examples":[{"en":"He felt like a nobody in the big city.","zh":"在大城市里，他觉得自己是个无名小卒。"},{"en":"Don’t talk to her like she’s a nobody.","zh":"别把她当成无足轻重的人那样说话。"}]}],"synonyms":["no one","not anybody","none (of the people)"],"phonetic":"/ˈnoʊˌbɑdi/","extraExplanation":["注意双重否定：在标准英语里通常说 “I didn’t see anybody.”（我没看见任何人），而不是 “I didn’t see nobody.”；后者在一些方言/口语中可能出现，但在正式写作里会被认为不规范。","“nobody”作代词时，后面常用单数动词（Nobody is…）。指代回去时，现代英语里常用单数 they（Nobody knows their password.）来避免性别指向。"]}
{"word":"nobodyd","summary":{"en":"“Nobody” means “no person,” and it can also mean an unimportant or unknown person (often rude).","zh":"“Nobody”表示“没有人”；也可指“无名小卒/不重要的人”（常带贬义）。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"no person; not anyone","zh":"没有人；谁也不"},"examples":[{"en":"Nobody knows the answer.","zh":"没有人知道答案。"},{"en":"I knocked, but nobody opened the door.","zh":"我敲了门，但没有人开门。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is not important or not well-known (often used rudely)","zh":"无名小卒；不重要的人（常带有不礼貌/贬义）"},"examples":[{"en":"He thought he was a nobody before he became famous.","zh":"在出名之前，他觉得自己只是个无名小卒。"},{"en":"Don’t call people nobodies—it’s disrespectful.","zh":"别把别人叫作“无名小卒”，这很不尊重。"}]}],"synonyms":["no one","not anybody","none"],"phonetic":"/ˈnoʊbɑdi/","extraExplanation":["你输入的“nobodyd”很可能是拼写错误，常见正确拼写是“nobody”。","“nobody”=“no person”。注意不要和“no body”（没有身体）混淆：比如“no body was found”（没有发现尸体/身体）里，body是名词“身体”。","作为名词“a nobody”带贬义，口语中可能伤人；更中性的说法可以用“an unknown person”（不知名的人）。"]}
{"word":"nobodyness","summary":{"en":"Nobodyness means the state or feeling of being a “nobody,” lacking importance or recognition.","zh":"Nobodyness 指“像无名小卒一样”的状态或感受，强调不重要、缺乏认可或被忽视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or feeling of being a “nobody” (not important, not noticed, or having low social status); lack of recognition","zh":"“无名小卒/无足轻重”的状态或感受；不被重视、缺乏认可"},"examples":[{"en":"He struggled with a sense of nobodyness after moving to a big city where no one knew him.","zh":"搬到大城市后，没人认识他，他一直有种“无名之感/无足轻重”的感觉。"},{"en":"The novel explores how fame can turn into nobodyness overnight.","zh":"这部小说探讨了名声如何可能在一夜之间变成“无人问津”。"}]}],"synonyms":["nobodiness","insignificance","obscurity","anonymity","unimportance"],"phonetic":"/ˈnoʊbɑdinəs/","extraExplanation":["“nobodyness”很少见，更常见的拼写是“nobodiness”。它由“nobody（无名小卒）+ -ness（名词后缀，表示状态/性质）”构成，语气多偏文学化或情绪化，用来表达自卑、被忽视、缺乏存在感等。日常口语里更常说：feeling like a nobody / a sense of insignificance。"]}
{"word":"nobs","summary":{"en":"“Nobs” usually means plural “nob”: knobs/handles; in British informal use it can mean upper-class/important people, and it also has a vulgar slang meaning.","zh":"“nobs”通常是“nob”的复数：旋钮/把手；在英式非正式用法中也可指上流/有地位的人；另有粗俗俚语义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nob”: a knob (a round handle or control you turn or pull).","zh":"“nob”的复数：旋钮；把手（圆形的、可转动或可拉动的控制/握把）。"},"examples":[{"en":"Turn the volume nobs to make the music louder.","zh":"转动音量旋钮，把音乐调大。"},{"en":"The drawer won’t open because one of the nobs is loose.","zh":"抽屉打不开，因为有一个把手松了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, British) Plural of “nob”: a rich or important person; an upper-class person.","zh":"（非正式，英式）“nob”的复数：有钱/有地位的人；上流社会的人。"},"examples":[{"en":"At that club, the nobs sit at the best tables.","zh":"在那家俱乐部里，有身份的人坐最好的桌子。"},{"en":"He likes to act like one of the nobs.","zh":"他喜欢装得像上流人士一样。"}]},{"partOfSpeech":"n.","definition":{"en":"(Vulgar slang, British) Plural of “nob”: a penis.","zh":"（粗俗俚语，英式）“nob”的复数：阴茎。"},"examples":[{"en":"That word is vulgar, so don’t use it in public.","zh":"那个词很粗俗，所以不要在公共场合用。"}]}],"synonyms":["knobs","handles","dials","(BrE informal) toffs","(BrE informal) posh people"],"phonetic":"/nɑbz/","extraExplanation":["“nob(s)”在英式英语里有“上流人士/有权势的人”的意思，常出现在“the nobs and (the) common people”这类表达中，语气带点讽刺或调侃；在美式英语中这个用法不太常见。","在日常学习与沟通中，如果你想表达“旋钮/把手”，更常见、也更中性的词是“knob(s)”。“nob(s)”的俚语义（尤其是粗俗义）需要特别注意场合。"]}
{"word":"nobut","summary":{"en":"“nobut” is an informal online spelling of “No, but …,” used to gently disagree or to show playful hesitation before giving a reason.","zh":"“nobut”是把“No, but …”连写的网络非正式写法，用来温和反驳/纠正，或带点玩笑式犹豫后再解释原因。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(informal) Used to correct someone or disagree gently: you start with “No,” then add a contrasting point with “but…”.","zh":"（非正式）用来温和地纠正或反驳：先说“No（不是/不对）”，再用“but…”补充对立或更准确的说法。"},"examples":[{"en":"No, but I meant tomorrow, not today.","zh":"不是，不过我的意思是明天，不是今天。"},{"en":"No, but you’re close—try moving the piece one step left.","zh":"不是，不过你很接近了——试着把棋子往左移一步。"}]},{"partOfSpeech":"other","definition":{"en":"(casual texting) A run-together spelling of “no but,” often used online to show playful protest or hesitation before giving a reason.","zh":"（网络/短信口语）把“no but”连写成一个词的写法，常用来表达带点玩笑的抗议或犹豫，然后给出理由。"},"examples":[{"en":"nobut why would you do that 😭","zh":"nobut 你为什么要那样做啊（带点吐槽/无奈）。"},{"en":"nobut seriously, we should leave now.","zh":"nobut 说真的，我们现在该走了。"}]}],"synonyms":["No, but…","Actually,…","Well, but…","Not exactly, but…"],"phonetic":"/noʊ bʌt/","extraExplanation":["“nobut”不是标准英语拼写，更常见的写法是“No, but …”。在正式写作中建议分开写并加逗号：No, but … / No, I don’t think so, but …","口语里，“No, but …”常带“纠正、补充、更准确说明”的语气；如果语气更强硬，可以说“No—listen …”或直接说“But …”。"]}
