{"word":"nocake","summary":{"en":"“No cake” means there isn’t any cake, or you can’t have cake.","zh":"“No cake”表示没有蛋糕，或不能吃蛋糕。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(informal phrase) There is no cake available, or you are not allowed to have cake.","zh":"（非正式短语）没有蛋糕了；或不允许吃蛋糕。"},"examples":[{"en":"Sorry—no cake. We ran out after the party.","zh":"抱歉——没有蛋糕了。派对之后就吃完了。"},{"en":"Doctor’s orders: no cake for a month.","zh":"医生嘱咐：一个月不能吃蛋糕。"}]},{"partOfSpeech":"sentense","definition":{"en":"(literal statement) Used to answer a question or correct an assumption about cake being present.","zh":"（字面陈述）用于回答问题，或纠正别人以为有蛋糕的想法。"},"examples":[{"en":"Is there cake? — No cake, just cookies.","zh":"有蛋糕吗？——没有蛋糕，只有饼干。"},{"en":"I thought you brought dessert. — No cake this time.","zh":"我以为你带了甜点。——这次没带蛋糕。"}]}],"synonyms":["none left","out of cake","no dessert"],"phonetic":"/noʊ keɪk/","extraExplanation":["“nocake”作为一个连写词并不是常见的标准英语拼写；更自然的写法通常是分开写成“no cake”。在聊天、标签（tag）、用户名或标题里，人们有时会把两个词连在一起以求简短。"]}
{"word":"nocardia","summary":{"en":"Nocardia is a genus of environmental bacteria; some species can cause serious infections, especially in immunocompromised people.","zh":"Nocardia（诺卡菌）是一类环境细菌；部分种可致感染，尤其常见于免疫功能低下者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type (genus) of bacteria found in soil and water; some species can cause infection in humans, especially in people with weak immune systems","zh":"一种（属）细菌，常见于土壤和水中；其中一些种可引起人类感染，尤其容易发生在免疫力较弱的人群"},"examples":[{"en":"The lab report identified Nocardia in the patient’s sputum sample.","zh":"化验报告在患者的痰标本中鉴定出了诺卡菌（Nocardia）。"},{"en":"Doctors may suspect Nocardia infection when lung symptoms don’t improve with usual antibiotics.","zh":"当肺部症状用常规抗生素仍不见好转时，医生可能会怀疑诺卡菌感染。"}]}],"synonyms":["Nocardia bacteria","Nocardia spp.","nocardial organism"],"phonetic":"/noʊˈkɑrdiə/","extraExplanation":["“Nocardia”常译为“诺卡菌”（也有人称“诺卡放线菌”），属于放线菌相关的一类细菌。它们常存在于环境中（如土壤、尘土、水源），人多通过吸入含菌尘埃或皮肤伤口接触而感染。","由诺卡菌引起的疾病通常叫“nocardiosis（诺卡菌病）”，可累及肺部、皮肤，严重时可扩散到脑部等器官；因此在医学英语里常见搭配有 “Nocardia infection / pulmonary nocardiosis”。","拼写提示：Nocardia 首字母大写时多指“属名”（生物分类），小写 nocardia 有时在一般叙述中也会出现，但在正式医学/生物学写作里更常用大写属名。"]}
{"word":"nocardiosis","summary":{"en":"Nocardiosis is an infection caused by Nocardia bacteria, often starting in the lungs and sometimes spreading to the brain or skin.","zh":"诺卡菌病是由诺卡菌引起的感染，常从肺部开始，也可能扩散到大脑或皮肤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an infectious disease caused by Nocardia bacteria, usually affecting the lungs but sometimes spreading to the brain or skin, especially in people with weakened immune systems","zh":"由诺卡菌（Nocardia）引起的感染性疾病，常累及肺部，也可能扩散到大脑或皮肤；免疫力较弱者更易发生"},"examples":[{"en":"The doctor suspected nocardiosis after the patient’s lung infection did not improve with usual antibiotics.","zh":"由于患者的肺部感染使用常规抗生素仍未好转，医生怀疑是诺卡菌病。"},{"en":"People with weakened immune systems are at higher risk of developing nocardiosis.","zh":"免疫系统较弱的人更容易患上诺卡菌病。"}]}],"synonyms":["Nocardia infection"],"phonetic":"/ˌnoʊ.kɑr.diˈoʊ.sɪs/","extraExplanation":["“Nocardiosis”来自细菌属名“Nocardia（诺卡菌）”+“-osis（……病）”。在日常英语中它多出现在医学语境里。","诺卡菌常见于土壤、尘埃和腐植物中；感染可能通过吸入进入肺部，或经皮肤伤口进入体内。","常见表现可包括持续咳嗽、发热、胸痛；若播散到脑部可能出现头痛、神经系统症状等。治疗通常需要较长疗程并根据药敏选择抗生素（具体用药需由医生决定）。"]}
{"word":"nocence","summary":{"en":"“Nocence” means harmfulness or the quality of causing harm, a rare word often used in ethics or academic writing.","zh":"“nocence”指“有害性/致害性”，较少见，多用于伦理或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"harmfulness; the quality of causing injury or damage (often used as the opposite of “innocence,” and seen in ethics/medicine).","zh":"有害性；造成伤害或损害的性质（常作为“innocence 无辜/纯真”的反义词，在伦理学/医学语境中出现）。"},"examples":[{"en":"In medical ethics, doctors aim to reduce nocence by avoiding unnecessary harm.","zh":"在医学伦理中，医生努力通过避免不必要的伤害来降低有害性。"},{"en":"The policy was criticized for its potential nocence to vulnerable communities.","zh":"这项政策因可能对弱势群体造成伤害而受到批评。"},{"en":"They debated whether the new chemical’s benefits outweighed its nocence.","zh":"他们讨论这种新化学品的益处是否超过其危害性。"}]}],"synonyms":["harm","harmfulness","injury","damage","dangerousness"],"phonetic":"/ˈnoʊ.səns/","extraExplanation":["“nocence”比较少见，更常见于哲学、法学或医学伦理的讨论，尤其与“nonmaleficence（不伤害原则）”相关。","词形上常被理解为与“innocence（无辜、纯真）”相对：innocence 指“无害/无罪/纯真”，nocence 指“有害/致害”。日常英语里更常用 harm、harmfulness、danger 等词。"]}
{"word":"nocent","summary":{"en":"“Nocent” is a rare adjective meaning “harmful” or (archaically) “guilty,” opposite to “innocent.”","zh":"“nocent”是一个较罕用的形容词，表示“有害的”，或（古旧用法）“有罪的”，与“innocent”相对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Harmful; causing damage or injury.","zh":"（罕用）有害的；会造成伤害或损害的。"},"examples":[{"en":"Some chemicals are nocent to fish and other river life.","zh":"有些化学物质对鱼类和其他河流生物是有害的。"},{"en":"The report warned that the smoke could be nocent to young children.","zh":"报告警告说，这种烟雾可能对幼儿有害。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare/archaic) Guilty; blameworthy (the opposite of “innocent”).","zh":"（罕用/古旧）有罪的；应受责备的（与 innocent 相对）。"},"examples":[{"en":"He claimed he was not nocent of the crime.","zh":"他声称自己并非该罪行的罪犯。"}]}],"synonyms":["harmful","damaging","injurious","deleterious","guilty","culpable"],"phonetic":"/ˈnoʊsənt/","extraExplanation":["“nocent”在现代英语里非常少见，更常用的是“harmful”（有害的）或“guilty”（有罪的）。","它和“innocent”同源：都来自拉丁语词根，nocent 本意偏向“造成伤害/有罪”，而 innocent 字面上是否定形式（in-）表示“不造成伤害/无罪”。","在法律语境中，现代英语一般说“innocent / guilty”，几乎不说“nocent”。看到“nocent”时，很多时候也可能是把“innocent”少打了前缀 in-。"]}
{"word":"nocere","summary":{"en":"Nocere is a Latin verb meaning “to harm,” best known from the medical-ethics phrase “primum non nocere.”","zh":"nocere是拉丁语动词，意思是“伤害”，最常见于医学伦理短语“primum non nocere（首先，不伤害）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin, used in English contexts) to harm; to injure; to do damage.","zh":"（拉丁语词，常在英语语境中引用）伤害；损害；造成损失。"},"examples":[{"en":"The phrase “primum non nocere” is often translated as “first, do no harm.”","zh":"短语“primum non nocere”常被译为“首先，不要伤害（病人）”。"},{"en":"In medical ethics, writers sometimes cite nocere to emphasize avoiding unnecessary risk to patients.","zh":"在医学伦理中，作者有时会引用“nocere”来强调避免给病人带来不必要的风险。"}]}],"synonyms":["harm","injure","damage","do harm"],"phonetic":"/noʊˈsɛreɪ/","extraExplanation":["“nocere”是拉丁语动词，意思是“伤害”。它在现代英语里通常不会单独当作英语动词使用，而是作为拉丁语引用，最常见于“primum non nocere”（传统上译为“首先，不伤害”）。","严格来说，“primum non nocere”并非希波克拉底誓言原文的固定句子，但在近现代医学文化中被广泛当作核心原则来引用。"]}
{"word":"nocerite","summary":{"en":"“nocerite” is not standard English; it’s most likely a Latin form meaning “you (plural) will have harmed / may have harmed.”","zh":"“nocerite”不是标准英语词；更可能是拉丁语形式，意为“你们将已经伤害了/你们可能已经伤害了”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most commonly, it is a Latin verb form (from *nocēre*, “to harm”), meaning “you (plural) will have harmed” or “you (plural) may have harmed,” depending on context.","zh":"不是标准英语词。最常见的是拉丁语动词形式（来自 *nocēre*“伤害”），意思大致是“你们将已经伤害了（将来完成时）”或“你们可能已经伤害了（虚拟式）”，需看语境。"},"examples":[{"en":"In Latin, *nocerite* can be understood as “you (all) will have harmed.”","zh":"在拉丁语里，*nocerite* 可理解为“你们将已经伤害了”。"},{"en":"It isn’t used in everyday English; you might see it in a Latin text or as a stylistic reference.","zh":"它不用于日常英语；你可能会在拉丁文文本中看到，或作为一种风格化引用。"}]}],"synonyms":["(Latin) harm","injure","damage"],"phonetic":"/ˈnoʊ.səˌraɪt/","extraExplanation":["从词根上看，*nocēre*（伤害）与英语里一些表示“伤害/无害”的词有历史关联，例如 *innocent*（无辜的；不伤人的，来自拉丁语 *in-* “不” + *nocēre* “伤害”）。","如果你原本想查的是英语单词，可能是拼写误差。你可以告诉我你看到它的句子/出处（书名、游戏、文章等），我可以帮你判断它到底是专有名词、拉丁语引用，还是想表达的英语词。"]}
{"word":"nocht","summary":{"en":"“Nocht” is a Scots word meaning “nothing,” often used in Scottish writing or dialect speech.","zh":"“nocht”是苏格兰英语里表示“没什么/什么也没有”的词，常见于苏格兰方言或文学文本。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"nothing; not anything (a Scots word, often seen in Scottish literature).","zh":"没什么；什么也没有（苏格兰英语用词，常见于苏格兰文学）。"},"examples":[{"en":"There’s nocht in the cupboard.","zh":"橱柜里什么也没有。"},{"en":"I can do nocht about it.","zh":"这事我也无能为力。"},{"en":"It means nocht to me.","zh":"这对我来说毫无意义。"}]},{"partOfSpeech":"adv.","definition":{"en":"(older/poetic Scots) “not” or “nothing at all,” used for emphasis.","zh":"（较古老/诗歌体苏格兰用法）“不”或“完全没有”，用于强调。"},"examples":[{"en":"He said nocht, but his face told the story.","zh":"他一句话也没说，但他的表情说明了一切。"},{"en":"It matters nocht.","zh":"这完全不重要。"}]}],"synonyms":["nothing","not anything","naught","nae thing"],"phonetic":"/nɔxt/","extraExplanation":["“nocht”主要出现在苏格兰英语（Scots）与苏格兰文学作品中，标准英语里通常对应“nothing / not anything”。在苏格兰诗歌或方言对话里很常见，比如罗伯特·彭斯（Robert Burns）等作家的文本中常能见到类似拼写。","发音和拼写在不同地区可能略有差异；你也可能见到相关形式如“nae thing”（没有东西）或“naught”（无）。"]}
{"word":"nociassociation","summary":{"en":"“nociassociation” is not a standard word; you probably mean “association,” or a pain-related term like “nociception.”","zh":"“nociassociation”不是标准词；你可能想写“association（关联/协会）”，或与疼痛相关的“nociception”等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “association,” or an intended combination with the prefix “noci-” (meaning “harm/pain,” as in “nociception”).","zh":"这不是标准英文单词。很可能是把“association（关联/协会）”拼错了，或想把表示“伤害/疼痛”的前缀“noci-”（如“nociception 疼痛感受”）与“association”组合在一起。"},"examples":[{"en":"Did you mean “association” (a connection between ideas, or a group/organization)?","zh":"你想表达的是“association（想法之间的联系，或协会/组织）”吗？"},{"en":"In psychology, we form an association between a smell and a memory.","zh":"在心理学中，我们会在某种气味与一段记忆之间形成“association（联想/关联）”。"},{"en":"In medicine, “nociception” is the process of sensing pain.","zh":"在医学中，“nociception”指“疼痛感受/痛觉传导”的过程。"}]}],"phonetic":"ˌnoʊsiəˌsoʊsiˈeɪʃən","extraExplanation":["“association”常见两义：①抽象的“关联/联想”；②具体的“协会/社团”。如果你能告诉我你想表达的句子或领域（心理学/医学/一般写作），我可以帮你确定最合适的词。","“noci-”来自拉丁语词根，和“harm/伤害、pain/疼痛”相关，常见于：nociception（痛觉感受）、nociceptor（痛觉感受器）、nociceptive（与痛觉相关的）。"]}
{"word":"nociceptive","summary":{"en":"Nociceptive means “related to the detection of harmful stimuli,” and in medicine it often describes pain from tissue damage or inflammation.","zh":"Nociceptive 意为“与对有害刺激的感知有关”；在医学中常指由组织损伤或炎症引起的疼痛类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to nociception—the nervous system’s process of detecting harmful stimuli (like extreme heat, pressure, or chemicals) and sending pain signals.","zh":"与“伤害性感受（nociception）”有关的——指神经系统检测有害刺激（如高温、强压或化学刺激）并传递疼痛信号的过程。"},"examples":[{"en":"Nociceptive signals warn the body to pull away from something harmful.","zh":"伤害性感受信号会提醒身体远离有害事物。"},{"en":"Researchers measured nociceptive responses to heat in the lab.","zh":"研究人员在实验室中测量了对热刺激的伤害性感受反应。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Describing a type of pain caused by tissue damage or inflammation that activates pain receptors (often contrasted with neuropathic pain).","zh":"（医学）描述一种由组织损伤或炎症引起、通过激活痛觉感受器而产生的疼痛（常与“神经病理性疼痛”对比）。"},"examples":[{"en":"A sprained ankle usually causes nociceptive pain.","zh":"脚踝扭伤通常会引起伤害感受性疼痛。"},{"en":"The doctor explained that her back pain was mostly nociceptive, not neuropathic.","zh":"医生解释说她的背痛主要是伤害感受性疼痛，而不是神经病理性疼痛。"},{"en":"Anti-inflammatory drugs can help with nociceptive pain from arthritis.","zh":"抗炎药可以帮助缓解关节炎引起的伤害感受性疼痛。"}]}],"synonyms":["pain-sensing","pain-related","inflammatory (pain) (context-dependent)","somatic (context-dependent)"],"phonetic":"/ˌnoʊ.sɪˈsɛp.tɪv/","extraExplanation":["词源提示：来自拉丁语 *nocere*（伤害）+ *-ceptive*（感受/接受）。所以它的核心意思就是“对伤害刺激的感受”。","常见对比：*nociceptive pain* 多与组织损伤/炎症有关；*neuropathic pain* 多与神经本身受损有关（如灼烧、电击样疼痛）。临床上区分它们有助于选择治疗方式。"]}
{"word":"nociceptor","summary":{"en":"A nociceptor is a pain-sensing nerve receptor that detects potentially harmful stimuli.","zh":"nociceptor 指能感知潜在伤害并传递疼痛信号的神经感受器（伤害感受器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sensory nerve ending (or nerve cell) that detects harmful stimuli—such as extreme heat, pressure, or chemicals—and sends pain signals to the brain","zh":"伤害感受器；一种感觉神经末梢（或神经细胞），用来检测可能造成组织损伤的刺激（如高温、强压力、化学物质），并将疼痛信号传到大脑"},"examples":[{"en":"When you touch a hot pan, nociceptors in your skin send a pain signal immediately.","zh":"当你碰到很烫的锅时，皮肤里的伤害感受器会立刻发出疼痛信号。"},{"en":"Some pain medicines work by reducing how strongly nociceptors respond to inflammation.","zh":"一些止痛药通过降低伤害感受器对炎症的反应强度来起作用。"}]}],"synonyms":["pain receptor","pain sensor","nociceptive receptor"],"phonetic":"/ˌnoʊsɪˈsɛptər/","extraExplanation":["词源：noci- 来自拉丁语 nocere（“伤害”），-ceptor 来自 capere（“接收/捕捉”）。字面意思就是“接收伤害的感受器”。","区分概念：nociception（伤害性感觉/伤害感受）指神经系统对有害刺激的“检测与传递”；pain（疼痛）是大脑对这些信号的主观体验，可能受情绪、注意力与经验影响。","常见类型（便于理解）：机械性（压力/刺痛）、热性（高温/低温）、化学性（辣椒素、炎症介质等）。不同类型的受体会对不同刺激更敏感。"]}
{"word":"nociperception","summary":{"en":"Nociperception means the brain’s perception of harmful/pain-related signals.","zh":"Nociperception 指大脑对有害/与疼痛相关信号的感知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The perception or awareness of harmful (pain-related) signals in the body; often used in pain science to talk about how the brain experiences signals that come from nociception.","zh":"对身体中有害（与疼痛相关）信号的感知或觉察；常用于疼痛科学中，强调大脑如何体验来自伤害性输入（nociception）的信号。"},"examples":[{"en":"In chronic pain, nociperception can stay high even when the tissue has healed.","zh":"在慢性疼痛中，即使组织已经愈合，nociperception 也可能仍然很强。"},{"en":"The therapist explained that nociperception is influenced by stress, sleep, and emotions.","zh":"治疗师解释说，nociperception 会受到压力、睡眠和情绪的影响。"}]}],"synonyms":["pain perception","pain experience","perception of nociceptive input"],"phonetic":"/ˌnoʊsɪpərˈsɛpʃən/","extraExplanation":["“nociperception”不是最常见的标准术语；很多教材与论文更常用“nociception（伤害性感受/伤害性传入）”和“pain perception（疼痛感知）”。一般理解上：nociception 更偏向“神经系统接收到潜在伤害刺激的信号”；pain perception/（这里的）nociperception 更偏向“大脑对这些信号的主观体验”。","词源上常被理解为 noci-（有害的，来自拉丁语 noxa ‘伤害’）+ perception（感知）。如果你是在阅读某篇特定文章或课程讲义里看到这个词，它可能是作者为了强调“与伤害信号有关的感知”而造的合成词。"]}
{"word":"nociperceptive","summary":{"en":"Nociceptive means “pain-sensing” or “related to detecting harmful stimuli.”","zh":"nociceptive 意为“与疼痛/有害刺激的感知有关的”，常用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the detection of harmful or potentially damaging stimuli (especially pain) by the nervous system.","zh":"与神经系统对有害或可能造成组织损伤的刺激（尤其是疼痛）的感知有关的；伤害性感受的。"},"examples":[{"en":"Nociceptive pain often comes from a cut, burn, or inflammation.","zh":"伤害性感受性疼痛常常来自割伤、烧伤或炎症。"},{"en":"The doctor checked for nociceptive signals coming from the injured joint.","zh":"医生检查了是否有来自受伤关节的伤害性感受信号。"}]},{"partOfSpeech":"n.","definition":{"en":"A nerve cell, fiber, or receptor involved in sensing harmful stimuli; short for “nociceptive neuron/receptor.”","zh":"参与感知有害刺激的神经细胞、神经纤维或感受器；常作为“伤害性感受神经元/受体”的简写用法。"},"examples":[{"en":"Some drugs reduce how strongly nociceptives respond to inflammation.","zh":"有些药物会减弱伤害性感受器对炎症的反应强度。"}]}],"synonyms":["pain-sensing","pain-related","sensory (in context)"],"phonetic":"/ˌnoʊ.sɪˈsɛp.tɪv/","extraExplanation":["你输入的“nociperceptive”在英语里不常见；在医学/生理学语境中，更常见、也更可能是你想写的词是 **nociceptive**（来自拉丁语 *nocere* “伤害” + “-ceptive” “感受/接受”）。","nociceptive 常见于医学表达：**nociceptive pain（伤害性感受性疼痛）**，与 **neuropathic pain（神经病理性疼痛）** 相对。"]}
{"word":"nocive","summary":{"en":"“Nocive” means harmful or injurious, especially to health (a rare word in modern English).","zh":"“nocive”意为“有害的、损害健康的”，在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"harmful; poisonous or injurious (especially to health).","zh":"有害的；有毒的；对健康不利的（较少用）。"},"examples":[{"en":"Long-term exposure to nocive chemicals can damage the lungs.","zh":"长期接触有害化学物质会损伤肺部。"},{"en":"The report warned that the smoke contains nocive substances.","zh":"报告警告说烟雾中含有有害物质。"}]}],"synonyms":["harmful","noxious","toxic","injurious","deleterious"],"phonetic":"/ˈnoʊsɪv/","extraExplanation":["“nocive”在现代英语里比较少见，更常见的表达是 **harmful**、**noxious**、**toxic** 或 **injurious**。在医学/健康、环境风险等正式语境中偶尔会看到。","词源上与表示“伤害/损害”的拉丁语根有关，因此含义偏“对健康或环境造成损伤”。"]}
{"word":"nock","summary":{"en":"A “nock” is the notch on an arrow (or a groove on a bow) that holds the bowstring; as a verb, it means to place an arrow on the bowstring to get ready to shoot.","zh":"“nock”指箭尾（或弓上）的卡弦槽；作动词指把箭搭上弓弦、准备射出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small notch (often at the back of an arrow) that fits onto a bowstring, or the groove in a bow where the string sits.","zh":"（多指箭尾的）缺口/槽，用来卡在弓弦上；也可指弓上放弦的凹槽。"},"examples":[{"en":"Make sure the arrow’s nock is clipped firmly onto the bowstring.","zh":"确保箭尾的槽口牢牢卡在弓弦上。"},{"en":"If the nock is cracked, the arrow can break when you shoot.","zh":"如果箭尾槽口裂了，射箭时箭可能会断。"}]},{"partOfSpeech":"v.","definition":{"en":"To fit an arrow onto a bowstring, ready to shoot.","zh":"把箭搭到弓弦上（准备射出）。"},"examples":[{"en":"He nocked an arrow and took a deep breath.","zh":"他把箭搭上弓弦，深吸一口气。"},{"en":"Nock the arrow, draw the bow, then release smoothly.","zh":"先把箭搭上弓弦，拉弓，然后平稳放箭。"}]}],"synonyms":["notch (general meaning)","groove (general meaning)","fit (onto) (as a general verb)"],"phonetic":"/nɑk/","extraExplanation":["“nock”常见于射箭/弓术语境（archery）。动词搭配很固定：nock an arrow（搭箭）。在较常见的表达里也会看到 “nock and draw”（搭箭并拉弓）。","词形上不要和 “knock”（敲、撞）混淆：nock 没有字母 k，但发音相同。"]}
{"word":"nocked","summary":{"en":"“Nocked” means an arrow has been fitted onto the bowstring (or the action of doing this).","zh":"“nocked”指“把箭搭在弓弦上/已搭弦的箭”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense or past participle of “nock”: to place an arrow onto a bowstring, fitting the arrow’s notch (nock) onto the string, ready to shoot.","zh":"“nock”的过去式或过去分词：把箭搭在弓弦上，使箭尾的缺口（箭槽/箭扣）扣住弓弦，准备射出。"},"examples":[{"en":"He nocked an arrow, drew the bow, and aimed at the target.","zh":"他把箭搭上弓弦，拉开弓，对准靶心。"},{"en":"With a steady breath, she nocked another arrow and waited.","zh":"她深吸一口气，又搭上一支箭，静静等待。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing an arrow that has been placed on the bowstring and is ready to be drawn.","zh":"（形容）已搭弦的；指箭已经扣在弓弦上，随时可以拉弓。"},"examples":[{"en":"He stood with a nocked arrow, listening for movement in the woods.","zh":"他站着，箭已搭弦，倾听树林里的动静。"},{"en":"The hunter kept a nocked arrow but didn’t release it.","zh":"猎人一直让箭搭弦，却没有放箭。"}]}],"synonyms":["strung (context-dependent)","set (on the string)","fitted (to the string)"],"phonetic":"/nɑkt/","extraExplanation":["“nock”原本指箭尾部用来卡住弓弦的缺口/小槽（也叫 nock）。所以 nocked 的核心画面就是“把箭尾扣到弦上”。","常见搭配：nock an arrow（搭箭）、nock an arrow to the string（把箭扣到弓弦上）。","不要和 knock（敲、撞）混淆：发音和拼写很像，但意思完全不同。"]}
{"word":"nockerl","summary":{"en":"Nockerl is a traditional Austrian fluffy baked dessert made from whipped egg whites, famously served as Salzburger Nockerl.","zh":"Nockerl 是奥地利传统的蓬松烘焙蛋白甜点，最有名的是 Salzburger Nockerl（萨尔茨堡蛋白甜点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light, airy baked dessert from Austria (especially Salzburg), made from sweetened whipped egg whites and served in large “mounds,” often with powdered sugar and fruit sauce.","zh":"一种奥地利（尤其是萨尔茨堡）常见的轻盈烘焙甜点，主要用加糖打发蛋白做成蓬松的“团/峰”，常撒糖粉，配果酱或果酱汁食用。"},"examples":[{"en":"We ordered Salzburger Nockerl for dessert—it's fluffy like a sweet soufflé.","zh":"我们点了萨尔茨堡蛋白甜点（Salzburger Nockerl）当甜点——口感像甜味舒芙蕾一样蓬松。"},{"en":"The waiter said Nockerl is best eaten right away before it collapses.","zh":"服务员说 Nockerl 最好趁热立刻吃，不然会塌。"}]}],"synonyms":["Salzburger Nockerl","soufflé (similar)"],"phonetic":"ˈnɔkərl","extraExplanation":["“Nockerl”来自奥地利德语/德语词汇，常见完整名称是 **Salzburger Nockerl**（萨尔茨堡蛋白甜点）。它通常做成三座“雪峰”状，有时被说成象征萨尔茨堡周围的山（如蒙克斯贝格、卡普齐纳贝格、格纳伊斯贝格）。","英语里它属于外来词，菜单上多保留原拼写；复数在英语中常直接用 **Nockerl**，也有人写作 **Nockerln**（更接近德语用法）。"]}
{"word":"nocket","summary":{"en":"“Nocket” is a rare archery word meaning the notch at the end of an arrow where the bowstring fits (similar to “nock”).","zh":"“nocket”是一个较少见的射箭用语，指箭尾用于卡住弓弦的缺口（类似更常用的“nock”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archery, rare) A small notch or groove at the end of an arrow (a “nock”), where the bowstring fits.","zh":"（射箭/弓术中，较少用）箭尾上的小缺口或凹槽（相当于 nock），用于卡住弓弦。"},"examples":[{"en":"Make sure the arrow’s nocket is firmly on the string before you draw.","zh":"拉弓前要确认箭尾的 nocket 已经牢牢卡在弓弦上。"},{"en":"The archer inspected the nocket for cracks to prevent accidents.","zh":"射手检查箭尾的 nocket 是否有裂纹，以避免发生意外。"}]}],"synonyms":["nock","notch"],"phonetic":"/ˈnɑkɪt/","extraExplanation":["“nocket”在现代英语里非常少见，多数情况下人们会用更常见的词“nock”（箭尾缺口）。如果你是在一般对话或日常写作中看到“nocket”，也有可能是把“socket”（插座/接口）拼错了，或是把短语“knock it”听错写成了“nocket”。","在射箭语境里，nock/nocket 关系到安全：箭尾缺口磨损或开裂，可能导致放箭时滑脱或断裂。学习相关词汇时也常会一起看到：nock（箭尾缺口）、bowstring（弓弦）、shaft（箭杆）、fletching（羽翎）。"]}
{"word":"nocking","summary":{"en":"Nocking is the action of placing an arrow onto the bowstring (or, more generally, making a small notch).","zh":"nocking 指把箭尾扣到弓弦上（更广义也可指做出小缺口）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archery) the act of placing an arrow’s nock (the notched end) onto the bowstring, preparing to shoot.","zh":"（射箭）把箭尾的“箭槽/缺口”（nock）扣到弓弦上、准备放箭的动作。"},"examples":[{"en":"Before you draw the bow, make sure your nocking is correct.","zh":"拉弓之前，先确认你的扣弦（nocking）动作正确。"},{"en":"The coach corrected her nocking position so the arrow sat firmly on the string.","zh":"教练纠正了她的扣弦位置，让箭稳稳地卡在弓弦上。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “nock”: to fit an arrow to a bowstring, or to cut/make a small notch in something.","zh":"“nock”的现在分词：指把箭扣到弓弦上；或指在物体上刻/做出小缺口。"},"examples":[{"en":"He is nocking an arrow and taking a slow breath.","zh":"他正把箭扣到弓弦上，慢慢吸气。"},{"en":"She was nocking the wood to mark where the pieces should connect.","zh":"她在木头上刻缺口，用来标记拼接位置。"}]}],"synonyms":["stringing an arrow","setting the arrow","notching"],"phonetic":"/ˈnɑkɪŋ/","extraExplanation":["“nock”主要用于射箭语境：nock 是箭尾用于卡住弓弦的凹槽/缺口。口语里更常说“nock an arrow (on the string)”。注意不要和“knocking（敲门/敲击）”混淆：knocking 有 k- 开头，发音和意思都不同。"]}
{"word":"nocks","summary":{"en":"“Nocks” usually means the notched ends of arrows that clip onto the bowstring; it can also mean “puts an arrow on the bowstring” (he/she nocks).","zh":"“nocks”通常指箭尾用于卡住弓弦的凹槽（复数）；也可作动词，表示“把箭扣在弓弦上”（第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nock”: the notches or grooved ends of arrows (or crossbow bolts) where the bowstring fits.","zh":"“nock”的复数：箭（或弩箭）尾端用于卡住弓弦的凹槽/缺口。"},"examples":[{"en":"Check the nocks on your arrows before shooting; cracks can be dangerous.","zh":"射箭前检查箭尾的 nocks；有裂纹会很危险。"},{"en":"These carbon arrows have reinforced nocks for better durability.","zh":"这些碳箭配有加固的 nocks，更耐用。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “nock”: to place an arrow on the bowstring, ready to shoot.","zh":"“nock”的第三人称单数：把箭扣在弓弦上，准备射出。"},"examples":[{"en":"She nocks an arrow, takes a breath, and aims.","zh":"她把箭扣上弓弦，深吸一口气，然后瞄准。"},{"en":"He nocks quickly but waits for the signal to release.","zh":"他很快把箭扣上弓弦，但等信号才放箭。"}]}],"synonyms":["arrow notches","arrow nocks","fit (an arrow) to the string","set (an arrow)"],"phonetic":"/nɑks/","extraExplanation":["在射箭语境里，nock 既指“箭尾的缺口/塑料尾槽”（名词），也指“把箭扣到弓弦上”的动作（动词）。拼写相同但词性不同。","相关搭配：nock an arrow（扣箭）、the nock end（箭尾）。注意不要和 knock（敲击）混淆。"]}
{"word":"nocktat","summary":{"en":"“nocktat” is not a standard English word; it’s likely a misspelling or a non-dictionary term.","zh":"“nocktat”不是标准英语单词；更可能是拼写错误或不在词典中的用法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name/username, or a typing of two words together.","zh":"不是标准英语单词。可能是拼写错误、名字/用户名，或把两个词连在一起打出来的。"},"examples":[{"en":"I can’t find “nocktat” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“nocktat”——你是不是想写另一个词？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended meaning.","zh":"如果你把看到它的句子发我，我可以更准确推测你想表达的意思。"}]}],"extraExplanation":["你可能想输入的是这些更常见的词之一：\n- **knock that off**：口语“别那样了/住手”。\n- **nock**（射箭术语）：箭尾的“凹槽/卡口”，用来卡在弓弦上。\n- **nocturnal**：形容词“夜间活动的”。\n\n把原句或你想表达的中文意思发我，我可以给出准确词条、发音和例句。"]}
{"word":"noconfirm","summary":{"en":"“noconfirm” means “don’t ask for confirmation; continue automatically,” mainly used as a command-line option.","zh":"“noconfirm”表示“不要确认提示，自动继续执行”，主要作为命令行选项使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Computing) A command-line option or setting meaning “do not ask for confirmation”; proceed automatically without prompting the user (often used as --noconfirm).","zh":"（计算机）命令行选项/设置，表示“不要要求确认”；不弹出确认提示，直接自动继续执行（常见写法为 --noconfirm）。"},"examples":[{"en":"In Arch Linux, you can run: pacman -Syu --noconfirm.","zh":"在 Arch Linux 中，你可以运行：pacman -Syu --noconfirm。"},{"en":"Be careful with noconfirm options—they can install or remove packages without warning.","zh":"使用 noconfirm 这类选项要小心——它们可能在没有提示的情况下安装或删除软件包。"}]}],"synonyms":["noninteractive","assume-yes","yes-to-all"],"phonetic":"ˌnoʊkənˈfɝm","extraExplanation":["“noconfirm”最常见于 Linux/Unix 命令行工具（尤其是 Arch Linux 的 pacman）。它属于“自动化/脚本化”用法：方便批量执行，但风险是你可能错过关键提示（例如冲突、需要替换文件、将要删除的重要软件）。在生产环境或不确定后果时，通常不建议长期使用。"]}
{"word":"noct","summary":{"en":"Noct- is a root meaning “night,” mostly seen in longer words like nocturnal and nocturne.","zh":"noct- 是表示“夜晚”的词根，多见于 nocturnal、nocturne 等词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root/combining form meaning “night,” used in English mainly inside longer words (e.g., nocturnal, nocturne).","zh":"词根/构词成分，意思是“夜晚”，在英语中多用于较长单词内部（如 nocturnal, nocturne）。"},"examples":[{"en":"Owls are nocturnal animals—they are active at night.","zh":"猫头鹰是 nocturnal（夜行的）动物——它们在夜间活动。"},{"en":"She played a Chopin nocturne on the piano.","zh":"她在钢琴上演奏了一首肖邦的 nocturne（夜曲）。"}]}],"synonyms":["night (meaning)"],"phonetic":"/nɑkt/","extraExplanation":["“noct-”来自拉丁语 nox / noctis，意为“夜”。常见派生词：nocturnal（夜行的）、nocturne（夜曲/夜景画）、noctilucent（夜光的）、noctophobia（恐夜症）。","在现代英语里，“noct”通常不单独作为一个完整单词使用，更像是用来帮助你猜测词义的“线索”。看到词里有 noct-，大概率和“夜晚”有关。"]}
{"word":"noctambulant","summary":{"en":"Noctambulant means “sleepwalking” or “walking around at night, often while asleep.”","zh":"noctambulant 指“梦游的；夜间（常在睡梦中）走动的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"walking about at night, especially while asleep; sleepwalking.\nExamples:\n• en: He was noctambulant and sometimes wandered into the kitchen at midnight.  zh: 他会梦游，半夜有时会走到厨房。\n• en: The doctor asked whether anyone in the family had been noctambulant.  zh: 医生问家里是否有人有梦游史。","zh":"（尤指在睡梦中）夜间走动的；梦游的。\n例句：\n• en: He was noctambulant and sometimes wandered into the kitchen at midnight.  zh: 他会梦游，半夜有时会走到厨房。\n• en: The doctor asked whether anyone in the family had been noctambulant.  zh: 医生问家里是否有人有梦游史。"},"examples":[{"en":"He was noctambulant and sometimes wandered into the kitchen at midnight.","zh":"他会梦游，半夜有时会走到厨房。"},{"en":"The doctor asked whether anyone in the family had been noctambulant.","zh":"医生问家里是否有人有梦游史。"}]}],"synonyms":["somnambulant","sleepwalking","nocturnal"],"phonetic":"/ˌnɑkˈtæmbjələnt/","extraExplanation":["词源：来自拉丁语 noct-（夜晚）+ ambulare（行走）。因此字面意思是“在夜里行走”。","用法提示：noctambulant 比较正式、少见；日常更常用 sleepwalking（梦游的/梦游）。在文学或医学语境中更可能见到。"]}
{"word":"noctambulate","summary":{"en":"Noctambulate means to walk around at night, sometimes specifically to sleepwalk.","zh":"noctambulate 指夜间行走或徘徊，有时特指“梦游”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to walk or wander at night; sometimes used specifically for sleepwalking","zh":"夜间行走或徘徊；有时特指梦游"},"examples":[{"en":"After dinner, he likes to noctambulate through the quiet streets to clear his mind.","zh":"晚饭后，他喜欢在安静的街道上夜间散步，让头脑清醒。"},{"en":"The doctor asked whether she ever noctambulates while asleep.","zh":"医生问她睡着时是否会梦游。"}]}],"synonyms":["wander at night","walk around at night","roam","sleepwalk"],"phonetic":"/nɑkˈtæmbjəˌleɪt/","extraExplanation":["这个词比较少见，语体偏正式或文学化；日常英语更常说：walk around at night / wander at night；如果强调“梦游”，常用 sleepwalk。","词源来自拉丁语：nox（夜）+ ambulare（走路）。相关词：noctambulist（n. 梦游者；夜行者），noctambulation（n. 夜行/梦游行为）。"]}
{"word":"noctambulation","summary":{"en":"Noctambulation means night walking or wandering, often in a literary or formal tone.","zh":"Noctambulation 指夜间步行或夜间游走，语气较正式、偏文学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of walking about at night, especially while other people are asleep; night wandering","zh":"夜间漫步；夜行（尤指他人熟睡时的夜间游走）"},"examples":[{"en":"His noctambulation helped him clear his mind after stressful days.","zh":"他夜间漫步能在压力大的日子后让头脑清醒。"},{"en":"The novel opens with the detective’s noctambulation through empty streets.","zh":"小说以侦探在空荡街道上的夜行开篇。"}]}],"synonyms":["night walk","night wandering","nocturnal wandering","stroll (at night)"],"phonetic":"/ˌnɑk.tæm.bjəˈleɪ.ʃən/","extraExplanation":["这是一个较正式、偏文学的词，日常英语里更常用 night walk / walking at night / wandering at night。","词源可拆解理解：noct-（夜，来自拉丁语 nox/noctis）+ ambulation（步行，来自 ambulate “走路”）。因此它字面意思就是“夜间步行”。","在文学/写作中，noctambulation 常用来营造气氛：孤独、沉思、神秘或城市夜景等语感，比普通说法更“文艺”和更冷僻。"]}
{"word":"noctambule","summary":{"en":"A (rare, literary) word for a night wanderer.","zh":"（较少见、偏文学的）“夜行者/夜间漫步的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who walks or wanders at night; a night wanderer (a rare, literary word, from French).","zh":"夜行者；夜间漫步的人（较少见、带文学色彩的词，源自法语）。"},"examples":[{"en":"The city felt different after midnight, and he became a noctambule, drifting from street to street.","zh":"午夜后的城市有种不同的感觉，他成了夜行者，在街巷间漫无目的地游荡。"},{"en":"In the novel, the detective is a noctambule who listens to the city’s secrets at night.","zh":"在小说里，那位侦探是个夜行者，夜里倾听城市的秘密。"}]}],"synonyms":["night owl","night wanderer","noctambulist"],"phonetic":"/ˈnɑk.təmˌbjuːl/","extraExplanation":["“noctambule”常见于法语，也偶尔被英语写作者借用来营造气氛（偏文艺、诗意）。词源可拆为 noct-（夜）+ ambuler（行走），与“nocturnal（夜行的）”同源。","不要和“somnambulist（梦游者）”混淆：noctambule 强调“夜里清醒地漫步/游荡”，而 somnambulist 指“睡着时走路（梦游）”。"]}
{"word":"noctambulism","summary":{"en":"Noctambulism means sleepwalking—moving around or doing actions while asleep.","zh":"noctambulism 指“梦游”，即人在睡着时起身行走或做事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sleepwalking; the act of walking or doing other activities while asleep.","zh":"梦游；人在睡眠中起床行走或进行其他活动的现象。"},"examples":[{"en":"He has a history of noctambulism, so we keep the doors locked at night.","zh":"他有梦游史，所以我们晚上会把门锁好。"},{"en":"Stress and lack of sleep can sometimes make noctambulism worse.","zh":"压力和睡眠不足有时会让梦游更严重。"}]}],"synonyms":["sleepwalking","somnambulism"],"phonetic":"/nɑkˈtæmbjəˌlɪzəm/","extraExplanation":["“Noctambulism”来自拉丁语：noct-（夜晚）+ ambulare（行走），字面意思是“在夜里行走”。","它是比较正式、偏医学/心理学语境的词；日常英语里更常说“sleepwalking”。","在文学或影视中，梦游常用来营造神秘或紧张气氛，但现实中通常与睡眠阶段（如深睡期）相关，并不等同于“做梦在走路”。"]}
{"word":"noctambulist","summary":{"en":"A noctambulist is a person who sleepwalks.","zh":"noctambulist 指“梦游者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who sleepwalks; someone who walks around while asleep","zh":"梦游者；睡眠中会起身走动的人"},"examples":[{"en":"When he was a child, he was a noctambulist and sometimes ended up in the hallway at night.","zh":"他小时候会梦游，夜里有时会走到走廊上。"},{"en":"The doctor asked whether anyone in the family was a noctambulist.","zh":"医生问家里是否有人会梦游。"}]}],"synonyms":["sleepwalker","somnambulist"],"phonetic":"/nɑkˈtæmbjəlɪst/","extraExplanation":["“Noctambulist”较正式、带文学色彩，日常更常用的是“sleepwalker”。在小说或诗歌里，用它能营造“夜行、梦境、潜意识”的氛围。","词源上可拆理解：noct-（夜）+ ambul-（走），和“nocturnal（夜间的）”“ambulance（救护车，原意与‘行走/移动’相关）”有同源成分。"]}
{"word":"noctambulistic","summary":{"en":"Noctambulistic means “sleepwalking” or “like sleepwalking,” sometimes used figuratively for a dreamy, half-aware state.","zh":"noctambulistic 指“与梦游有关的；梦游般的”，也可比喻“恍惚、半清醒、机械地行动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to sleepwalking; done while walking in one’s sleep.","zh":"与梦游有关的；在睡眠中行走时发生的。"},"examples":[{"en":"The doctor asked whether she had any noctambulistic episodes as a child.","zh":"医生问她小时候是否有过梦游发作。"},{"en":"He woke up to find evidence of noctambulistic wandering around the house.","zh":"他醒来时发现自己似乎在家里梦游走动过的痕迹。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Moving or acting as if not fully awake or aware; automatic and half-conscious.","zh":"（比喻）像没完全清醒或没充分意识到一样行动；机械的、半无意识的。"},"examples":[{"en":"After the long flight, she moved through the airport in a noctambulistic haze.","zh":"长途飞行后，她在机场里恍惚地走着，像梦游一样。"},{"en":"The novel describes the city at dawn as noctambulistic—quiet, drifting, and unreal.","zh":"小说把黎明的城市写成“梦游般的”——安静、飘忽、不真实。"}]}],"synonyms":["sleepwalking","somnambulistic","dreamlike","trance-like","half-awake"],"phonetic":"ˌnɑk.tæmˈbjuː.lɪs.tɪk","extraExplanation":["“noctambulistic”较书面、较少见，日常更常用的是“sleepwalking / sleepwalker / somnambulism”。","词源可拆为 noct-（夜）+ ambul-（行走）+ -istic（…的），与“nocturnal（夜间的）”“ambulance（可移动的；救护车，来自同一“走动/移动”词根）”有词根关联。","文学与描写性写作中常用来营造“恍惚、梦境般、半清醒”的氛围，比直接说“sleepy”更具画面感。"]}
{"word":"noctambulous","summary":{"en":"Noctambulous means “sleepwalking” (most common) or, more rarely, “active at night.”","zh":"noctambulous 指“梦游的”（最常见），也可较少见地指“夜间活动的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Sleepwalking; moving about while asleep.","zh":"梦游的；在睡眠中走动的。"},"examples":[{"en":"He was found wandering the hallway in a noctambulous state.","zh":"有人发现他处于梦游状态，在走廊里游荡。"},{"en":"The child’s noctambulous episodes happened about once a month.","zh":"这个孩子的梦游发作大约每月一次。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Active or occurring at night; nocturnal in habit.","zh":"（较少见）夜间活动的；在夜里发生的。"},"examples":[{"en":"Writers sometimes describe the city’s noctambulous streets after midnight.","zh":"作家有时会描写午夜后城市里“夜行”的街道。"},{"en":"She kept a noctambulous routine, working best after dark.","zh":"她保持着夜间作息，天黑后工作效率最高。"}]}],"synonyms":["sleepwalking","somnambulant","nocturnal"],"phonetic":"/nɑkˈtæmbjələs/","extraExplanation":["“noctambulous”比较书面、少见，常见近义表达是“sleepwalking”或“nocturnal”。","词源上可拆解为拉丁语根：noct-（夜）+ ambul-（走，行走），与“ambulance（救护车）”“ambulate（行走）”同源。"]}
{"word":"nocten","summary":{"en":"“Nocten” is not standard English; it likely relates to the “night” root noct- and is best replaced with common words like “night,” “at night,” or “nocturnal.”","zh":"“Nocten”不是标准英语词，可能与表示“夜晚”的词根 noct-有关；实际写作中通常用“night / at night / nocturnal”等更常见表达替代。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word. It may be a misspelling or a rare/archaic form related to the Latin root noct- meaning “night.” In learner-friendly use, it’s best to replace it with common words like “night,” “at night,” or “nocturnal” (depending on what you mean).","zh":"不是现代标准英语词。它可能是拼写错误，或是与拉丁语词根 noct-（“夜晚”）相关的罕见/古语形式。学习与实际使用中，通常应改用更常见的表达，如“night（夜晚）”“at night（在夜里）”或“nocturnal（夜行性的/夜间的）”。"},"examples":[{"en":"This isn’t a common English word; you probably mean “nocturnal.”","zh":"这不是常见英语词；你可能想说的是“nocturnal（夜间的/夜行性的）”。"},{"en":"Instead of writing “nocten,” you can say “at night.”","zh":"与其写“nocten”，不如说“at night（在夜里）”。"}]}],"synonyms":["night","at night","nocturnal"],"phonetic":"/ˈnɑk.tən/","extraExplanation":["“noct-”是很常见的词根，来源于拉丁语 nox/noctis（夜）。你会在很多英语词里见到：nocturnal（夜间的）、nocturne（夜曲/夜景般的作品）、noctilucent（夜光的）。","如果你是在小说/游戏/设定中看到“Nocten”，它也可能是专有名词（人名、地名、品牌名等），这时含义要看具体上下文。你可以把原句发我，我能帮你判断更准确的意思和更自然的英文表达。"]}
{"word":"nocti","summary":{"en":"Nocti- is a word part meaning “night,” used to build words like nocturnal.","zh":"Nocti- 是表示“夜晚”的构词成分，常用于构成如 nocturnal 等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (combining form) meaning “night,” used in forming words.","zh":"（词根/构词成分）表示“夜晚”，用于构成相关词汇。"},"examples":[{"en":"Nocti- appears in words like nocturnal, meaning “active at night.”","zh":"Nocti- 常见于 nocturnal（夜行性的；夜间活动的）这类词中。"},{"en":"The adjective noctilucent means “shining at night.”","zh":"形容词 noctilucent 的意思是“夜间发光的”。"}]}],"synonyms":["noct-","nyct-","night-"],"phonetic":"/ˈnɑk.ti/","extraExplanation":["nocti- 源自拉丁语 nox / noctis（夜晚）。在现代英语里，它常以 noct- / nocti- 的形式出现，常见于较正式或学术词汇（生物学、文学描写等）。","相关词根还有 nyct-（同样表示“夜”，多见于更偏学术的词，如 nyctophobia“恐夜症”）。"]}
{"word":"noctidial","summary":{"en":"Noctidial means lasting about 24 hours (a full day and night).","zh":"Noctidial 指持续约24小时（完整的一昼夜）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lasting for a full day and night; about 24 hours","zh":"持续一整天一整夜的；约24小时的"},"examples":[{"en":"Some insects have a noctidial rhythm, meaning their activity repeats about every 24 hours.","zh":"有些昆虫具有“noctidial（昼夜）节律”，意思是它们的活动大约每24小时重复一次。"},{"en":"The experiment measured changes over a noctidial period.","zh":"该实验测量了在一个昼夜周期内的变化。"}]}],"synonyms":["24-hour","circadian (related)","daily (approx.)"],"phonetic":"/nɑkˈtɪdiəl/","extraExplanation":["“noctidial”非常少见，多见于较正式或学术语境（例如生物学、节律研究）。","词源可拆为拉丁语成分：nocti-（夜）+ -di(al)（日/天），整体表达“昼与夜合起来的一天”。日常英语更常用“24-hour”或“daily/diurnal cycle（昼夜周期）”来表达类似意思。"]}
{"word":"noctidiurnal","summary":{"en":"Noctidiurnal means active at night or occurring at night (a formal, scientific word).","zh":"noctidiurnal 指“夜间活动的”或“发生在夜间的”（较正式、偏科学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Active during the night (especially of animals); having a nightly activity pattern.","zh":"（尤指动物）夜间活动的；具有夜行习性的。"},"examples":[{"en":"Owls are noctidiurnal, hunting mainly after sunset.","zh":"猫头鹰是夜行性的，主要在日落后捕猎。"},{"en":"Researchers used infrared cameras to track noctidiurnal mammals.","zh":"研究人员用红外摄像机追踪夜行性哺乳动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Occurring or happening at night; nightly.","zh":"发生在夜间的；每夜的。"},"examples":[{"en":"The desert has strong noctidiurnal winds that cool the air quickly.","zh":"沙漠有强烈的夜间风，能迅速降温。"},{"en":"Some cities show a clear noctidiurnal pattern of traffic noise.","zh":"一些城市的交通噪音呈现明显的夜间规律。"}]}],"synonyms":["nocturnal","night-active","nighttime","nightly"],"phonetic":"/ˌnɑk.tɪˈdaɪ.ɝː.nəl/","extraExplanation":["“noctidiurnal”由拉丁语词根组成：nocti-（夜）+ diurnal（每日的、昼夜周期相关的）。在现代英语里更常用的近义词是“nocturnal（夜行的）”。“noctidiurnal”多见于动物学、生态学等较正式的语境，用来强调“昼夜节律（diurnal cycle）中的夜间部分”。"]}
{"word":"noctiferous","summary":{"en":"Noctiferous means “bringing or causing night/darkness,” mainly in poetic or literary contexts.","zh":"noctiferous 指“带来或造成夜晚/黑暗的”，主要用于诗歌或文学表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bringing or causing night or darkness; darkening (often used in poetic or literary writing).","zh":"带来夜晚或黑暗的；使变暗的（多用于诗歌或文学语境）。"},"examples":[{"en":"A noctiferous wind rose, and the hills disappeared into shadow.","zh":"一阵带来黑暗的风起，群山隐入阴影之中。"},{"en":"The poem describes a noctiferous sky that seems to swallow the last light.","zh":"这首诗描写了一个“吞没最后一丝光”的幽暗夜空。"}]}],"synonyms":["darkening","shadowy","gloomy","nocturnal","tenebrous"],"phonetic":"/nɑkˈtɪfərəs/","extraExplanation":["词源提示：noctiferous 来自拉丁语词根 noct-（夜晚）+ -ferous（“携带/产生”的意思，如: odoriferous“散发气味的”）。因此它字面意思是“携带夜晚的”。","用法提示：这是一个相当罕见、偏文学的形容词。日常英语更常用 dark, nightfall, nocturnal（“夜行/夜间的”）来表达相近概念。","文学色彩：noctiferous 常用来营造氛围（gothic/romantic tone），强调“黑暗降临”的意象，而不仅仅是“在夜间发生”。"]}
{"word":"noctiflorous","summary":{"en":"Noctiflorous describes plants or flowers that bloom at night.","zh":"Noctiflorous 指“夜间开花的（植物/花）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a plant or flower) blooming at night.","zh":"（指植物或花）夜间开花的。"},"examples":[{"en":"The cactus is noctiflorous, opening its flowers after sunset.","zh":"这种仙人掌是夜间开花的，日落后才会开花。"},{"en":"We used a flashlight to find noctiflorous blossoms in the garden.","zh":"我们用手电筒在花园里寻找夜间开花的花。"}]}],"synonyms":["night-blooming","nocturnal (in a broader sense)"],"phonetic":"/ˌnɑk.tɪˈflɔr.əs/","extraExplanation":["“noctiflorous”由拉丁语词根构成：nocti-（夜晚）+ -florous（开花的）。属于较少见、偏植物学/文学描写的词。日常英语里更常说“night-blooming”（夜间开放的）。","一些夜间开花的植物会在夜里散发更浓的香味，以吸引夜行传粉者（如飞蛾、蝙蝠）。因此在描写气味、夜色与花开场景的文学文字中，这个词很有画面感。"]}
{"word":"noctilio","summary":{"en":"Noctilio is the scientific genus name for bulldog bats, tropical bats known for strong jaws and, in some species, fishing behavior.","zh":"Noctilio 是“斗牛犬蝙蝠/捕鱼蝙蝠”等热带蝙蝠的属名（学名），有些种类以在水面捕食鱼类而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical bats (family Noctilionidae), known as bulldog bats; some species are famous for catching fish over water.","zh":"（动物学）一种热带蝙蝠属（Noctilio，犬吻蝠属/牛头蝠属），俗称“斗牛犬蝙蝠”；其中有的种类以在水面捕食鱼类而著名。"},"examples":[{"en":"Scientists recorded a Noctilio bat skimming the river and snatching small fish with its claws.","zh":"科学家记录到一只 Noctilio 蝙蝠掠过河面，用爪子抓起小鱼。"},{"en":"In some field guides, Noctilio is listed as the genus for bulldog bats found in Central and South America.","zh":"在一些野外图鉴中，Noctilio 被列为中美洲和南美洲“斗牛犬蝙蝠”的属名。"}]}],"synonyms":["bulldog bat","fishing bat"],"phonetic":"/nɑkˈtɪlioʊ/","extraExplanation":["“Noctilio”是拉丁化的学名写法（属名首字母通常大写：Noctilio）。在日常英语里，人们更常说“bulldog bat（斗牛犬蝙蝠）”或“fishing bat（捕鱼蝙蝠）”，而不是直接用属名。","词源上与拉丁语“noct-（夜晚）”有关，常见于一些与“夜行”相关的生物命名。"]}
{"word":"noctilionidae","summary":{"en":"Noctilionidae is the bat family known as bulldog bats (including fishing bats) in the American tropics.","zh":"Noctilionidae 指夜吼蝠科：分布于中南美洲热带地区的蝙蝠类群，俗称斗牛犬蝙蝠/捕鱼蝙蝠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tropical bats found in Central and South America, commonly called bulldog bats or fishing bats","zh":"夜吼蝠科（中南美洲热带地区的一科蝙蝠），常被称为“斗牛犬蝙蝠”或“捕鱼蝙蝠”】【},"},"examples":[{"en":"Noctilionidae are best known for hunting insects and, in some species, catching fish over water.","zh":"夜吼蝠科最有名的是捕食昆虫；其中一些物种还会在水面上捕鱼。"},{"en":"In a field guide, the family Noctilionidae may be listed under the common name “bulldog bats.”","zh":"在野外图鉴里，Noctilionidae 这个家族可能会以俗名“斗牛犬蝙蝠”出现。"}]}],"synonyms":["bulldog bats","fishing bats"],"phonetic":"/ˌnɑk.tɪˈlaɪ.əˌnaɪ.di/","extraExplanation":["“Noctilionidae”是生物分类学里的拉丁化学名：-idae 表示“科”（family）。常见成员是 Noctilio 属（如 greater fishing bat）。","它们之所以有“捕鱼蝙蝠”的俗名，是因为部分物种会用加长的脚爪在水面掠取小鱼；这种行为在蝙蝠中很有代表性。"]}
{"word":"noctiluca","summary":{"en":"Noctiluca is a marine plankton that can glow at night, making the ocean look luminous.","zh":"Noctiluca（夜光藻）是一种会在夜间发光的海洋浮游生物，会让海水看起来发亮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny marine organism (often a single-celled plankton) that can produce light in the ocean at night, creating “glowing water” (a type of bioluminescence)","zh":"夜光藻；一种微小的海洋生物（常为单细胞浮游生物），能在夜间发光，造成海水“发光”的生物发光现象"},"examples":[{"en":"The beach looked magical because noctiluca made the waves glow at night.","zh":"海滩看起来很梦幻，因为夜光藻让夜里的海浪发出微光。"},{"en":"Scientists studied noctiluca to understand why the sea sometimes shines blue-green.","zh":"科学家研究夜光藻，以了解为什么海水有时会呈现蓝绿色的光。"}]}],"synonyms":["bioluminescent plankton","sea sparkle (common name)","Noctiluca scintillans (scientific name)"],"phonetic":"/ˌnɑk.təˈluː.kə/","extraExplanation":["“Noctiluca”来自拉丁语：nocti-（夜晚）+ luca（光/发光），字面意思是“夜之光”。在新闻或科普里常见的说法还有“sea sparkle（海闪）”或“bioluminescent plankton（会发光的浮游生物）”。","日常英语里更常说“bioluminescent plankton”，而“Noctiluca”更偏科学名称（尤其指 Noctiluca scintillans）。有时也会与某些“赤潮/藻华”相关报道一起出现，但它的“发光”与白天海水变色并不总是同一回事。"]}
{"word":"noctilucae","summary":{"en":"Noctilucae are bioluminescent marine plankton (plural of *noctiluca*) that can make the sea glow at night.","zh":"Noctilucae 指会在夜间让海水发光的夜光海洋浮游生物（*noctiluca* 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bioluminescent marine plankton (especially the organisms of the genus *Noctiluca*) that can make ocean water glow at night; plural form of *noctiluca*.","zh":"（尤指*Noctiluca*属的）夜光海洋浮游生物，会在夜间使海水发光；*noctiluca* 的复数形式。"},"examples":[{"en":"The beach was lit by noctilucae, turning the waves into a blue glow.","zh":"海滩被夜光虫照亮，浪花泛出蓝色的光。"},{"en":"Scientists sampled noctilucae to study the causes of nighttime bioluminescence.","zh":"科学家采集夜光虫样本，以研究夜间生物发光的原因。"}]}],"synonyms":["Noctiluca","bioluminescent plankton","sea sparkle (common name in some contexts)"],"phonetic":"/ˌnɑk.tɪˈluː.siː/","extraExplanation":["“Noctilucae”来自拉丁语词根：noct-（夜）+ luc-（光），字面意思接近“夜里发光的（生物）”。在英语科普语境中，更常见的单数/属名写法是 *Noctiluca*，而“noctilucae”多被当作复数来用（也可能在特定学术写作中出现）。","海边常说的“蓝眼泪/蓝色荧光海”现象，常与会发光的浮游生物有关（其中之一就是 *Noctiluca*）。需要注意：不同地区造成“海水发光”的生物可能不止一种。"]}
{"word":"noctilucal","summary":{"en":"Noctilucal means “glowing at night,” often describing bioluminescent light (especially from marine organisms).","zh":"noctilucal 意为“夜间发光的”，常用于描述夜里可见的生物发光（尤其与海洋夜光虫等有关）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shining or glowing at night; giving off light in darkness.","zh":"夜间发光的；在黑暗中发出微光的。"},"examples":[{"en":"The beach had a faint noctilucal glow when the waves stirred the algae.","zh":"海浪搅动藻类时，沙滩泛起淡淡的夜间荧光。"},{"en":"They watched the noctilucal shimmer on the water from the pier.","zh":"他们在码头上看着水面夜间闪烁的微光。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to bioluminescent organisms (especially the marine microorganism Noctiluca) that can make the sea glow at night.","zh":"与会发光的生物有关的（尤指能让海面在夜里发光的海洋微生物“夜光虫/Noctiluca”）。"},"examples":[{"en":"Noctilucal organisms can make the ocean look as if it’s sprinkled with stars.","zh":"夜光生物会让海面看起来像撒满了星星。"},{"en":"The researcher collected samples to study noctilucal blooms along the coast.","zh":"研究人员采集样本，研究沿海的夜光虫暴发。"}]}],"synonyms":["night-glowing","luminescent","phosphorescent","bioluminescent"],"phonetic":"/ˌnɑk.tɪˈlu.kəl/","extraExplanation":["“noctilucal”较少见，更常见的相关词是“noctilucent”（夜光的，如“noctilucent clouds”夜光云）。","词源提示：来自拉丁语词根 nocti-（夜）+ luc-（光），所以字面意思就是“夜里的光”。","在自然写作/文学描写中，它常用来营造安静、神秘的夜景氛围，例如描写海面生物发光或夜色中微弱的闪光。"]}
{"word":"noctilucan","summary":{"en":"Noctilucan means “glowing or shining at night.”","zh":"noctilucan 意为“在夜间发光的/夜里闪亮的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shining or glowing at night; producing light in darkness (often used for bioluminescent organisms or “noctilucent” night-shining clouds).","zh":"（在夜间）发光的；在黑暗中产生光亮的（常用于生物发光现象或“夜光云”等夜间发亮的事物）。"},"examples":[{"en":"Some plankton are noctilucan and make the sea sparkle at night.","zh":"一些浮游生物具有夜间发光的特性，会让海面在夜里闪闪发亮。"},{"en":"The scientist described a noctilucan glow on the shoreline after sunset.","zh":"那位科学家描述了日落后海岸线上出现的夜间发光微光。"}]}],"synonyms":["noctilucent","bioluminescent","luminous"],"phonetic":"/ˌnɑk.tɪˈlu.kən/","extraExplanation":["“noctilucan”较少见，更多时候你会看到近义词/相关词“noctilucent”（夜光的、夜间发亮的）。","词源可拆为拉丁语词根：nocti-（夜）+ luc-（光），与“nocturnal（夜行的）”“lucid（清澈的/明亮的）”“illuminate（照亮）”有亲缘关系。","常见搭配语境：noctilucan plankton（夜光浮游生物）、noctilucan glow/light（夜间微光）。"]}
{"word":"noctilucence","summary":{"en":"Noctilucence means a faint, natural glow visible in darkness.","zh":"Noctilucence 指在黑暗中可见的微弱自然发光（夜光）现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the giving off of a faint light in the dark; a weak natural glow (often seen in some organisms or in certain atmospheric conditions)","zh":"在黑暗中发出微弱光亮；微弱的自然发光（常见于某些生物或特定大气现象）"},"examples":[{"en":"The tide pools shimmered with noctilucence as the waves receded.","zh":"海浪退去时，潮池闪着微弱的夜光。"},{"en":"Scientists recorded noctilucence high in the atmosphere during summer nights.","zh":"科学家在夏夜记录到高层大气中的微弱夜光现象。"}]}],"synonyms":["bioluminescence","phosphorescence","glow","luminescence"],"phonetic":"/ˌnɑk.tɪˈlu.səns/","extraExplanation":["词源：来自拉丁语 *nocti-*（夜晚）+ *luc-*（光），字面意思是“夜之光”。","在科普语境里，人们更常看到相关词 *noctilucent clouds*（夜光云，高空中在暮光下仍可发亮的云）。*Noctilucence* 可以泛指“夜间微光/夜光现象”，而 *noctilucent* 是形容词（“会发夜光的”）。","与 *bioluminescence*（生物发光）相比，*noctilucence* 更强调“在夜里可见的微光”这一现象本身，不一定限定来源。"]}
{"word":"noctilucent","summary":{"en":"Noctilucent means ‘glowing at night,’ especially describing high-altitude clouds that shine after sunset.","zh":"noctilucent 意为“夜间发光的”，尤指日落后仍会发亮的高空夜光云。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of clouds or another object) shining or glowing at night, often by reflecting sunlight from high in the atmosphere.","zh":"（指云或物体）在夜间发光的；夜光的（常因在高层大气中反射阳光而显得发亮）。"},"examples":[{"en":"Noctilucent clouds can appear as bright, silvery streaks after sunset.","zh":"夜光云在日落后可能呈现为明亮的银色条纹。"},{"en":"Scientists study noctilucent clouds to learn about changes in the upper atmosphere.","zh":"科学家研究夜光云，以了解高层大气的变化。"}]}],"synonyms":["night-glowing","luminous","glowing"],"phonetic":"/ˌnɑk.tɪˈlu.sənt/","extraExplanation":["“Noctilucent”常见于气象与科普语境，最常指“夜光云”（noctilucent clouds），它们出现在极高的大气层（中间层附近），因此即使地面已入夜，仍可能被高空的阳光照亮，看起来像在夜里发光。","词源上可拆为 nocti-（夜）+ lucent（发光的），理解为“夜里发亮的”有助于记忆。","常见搭配：noctilucent clouds（夜光云）、noctilucent display（夜光现象/夜光云景观）。"]}
{"word":"noctilucidae","summary":{"en":"Noctilucidae is a biological family of marine dinoflagellate plankton, known for organisms linked to glowing seas and sometimes algal blooms.","zh":"Noctilucidae（夜光藻科）是海洋甲藻浮游生物的一个生物分类“科”，常与海面发光现象及有时的藻华有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine dinoflagellates (single-celled plankton), especially known for species that can cause bioluminescent “glowing” seas and sometimes harmful algal blooms.","zh":"夜光藻科：一类海洋甲藻（单细胞浮游生物）的科，尤以某些物种会造成海面“发光”的生物发光现象、并有时引发（或参与）有害藻华而闻名。"},"examples":[{"en":"Scientists sampled Noctilucidae near the coast after reports of glowing waves at night.","zh":"夜间有人报告海浪发光后，科学家在近海采集了夜光藻科的样本。"},{"en":"In some regions, blooms associated with Noctilucidae can affect water quality and local fisheries.","zh":"在一些地区，与夜光藻科相关的水华可能影响水质和当地渔业。"}]}],"synonyms":["Noctilucid family"],"phonetic":"/ˌnɑk.tɪlˈuː.sɪ.di/","extraExplanation":["“Noctilucidae”是拉丁化的生物分类名，来自nocti-（夜）与luc-（光），常与著名物种Noctiluca scintillans（常被称为“海火/海洋闪光”）有关；日常报道里更常见的是物种名或俗名，而不是科名。","学习使用建议：写作或阅读科普时可把它当作“一个生物类群/分类单位（科）”来理解，通常后接生态现象（生物发光、藻华）、分布（沿岸/近海）、影响（渔业、水质）等信息。"]}
{"word":"noctilucin","summary":{"en":"Noctilucin is a rare scientific word for a light-producing chemical involved in bioluminescence, especially in *Noctiluca*.","zh":"Noctilucin 是较少见的科学词，指与生物发光有关的发光化学物质，尤见于夜光虫（*Noctiluca*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light-producing chemical found in some bioluminescent organisms (especially the marine dinoflagellate *Noctiluca*), similar to luciferin.","zh":"（生物发光相关的）发光化学物质，存在于某些会发光的生物中（尤指海洋甲藻“夜光虫 *Noctiluca*”），性质类似荧光素（luciferin）。"},"examples":[{"en":"Scientists studied noctilucin to understand why some plankton glow at night.","zh":"科学家研究 noctilucin，以了解为什么一些浮游生物会在夜间发光。"},{"en":"The glow in the water is linked to reactions involving noctilucin.","zh":"水中的亮光与 noctilucin 参与的反应有关。"}]}],"synonyms":["luciferin","bioluminescent substrate"],"phonetic":"/ˌnɑk.təˈluː.sɪn/","extraExplanation":["“noctilucin”是非常少见的词，多见于生物发光/海洋生物学语境中；一般学习者更常遇到的是更通用的术语“luciferin（荧光素/发光底物）”和“luciferase（荧光素酶/发光酶）”。","词形上它来自拉丁语词根 nocti-（夜）+ luc-（光）。有时会被误写/误读为更常见的“noctilucent（夜光的；夜光云的）”。"]}
{"word":"noctilucine","summary":{"en":"Noctilucine is a light-producing chemical associated with marine bioluminescence, especially in Noctiluca plankton.","zh":"Noctilucine 指与海洋生物发光相关的发光化学物质，尤其见于夜光虫等浮游生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural light-producing chemical found in some marine organisms (especially the plankton Noctiluca), involved in bioluminescence (“sea sparkle”).","zh":"一种天然发光化学物质，存在于部分海洋生物（尤其是夜光虫 Noctiluca 等浮游生物）中，参与生物发光（如“海上蓝光/海荧光”）。"},"examples":[{"en":"Scientists studied noctilucine to understand why disturbed seawater can glow at night.","zh":"科学家研究 noctilucine，以理解为何海水在夜间被搅动时会发光。"},{"en":"The blue flashes along the shore are linked to bioluminescent compounds such as noctilucine.","zh":"岸边的蓝色闪光与 noctilucine 这类生物发光化合物有关。"}]}],"synonyms":["bioluminescent compound","luciferin (related)","light-emitting substance"],"phonetic":"/ˌnɑk.tɪˈluː.siːn/","extraExplanation":["词源提示：nocti- 来自拉丁语“夜晚”，-luc- 与“光”有关（同源词：lucid 清晰的、明亮的；luciferin 荧光素/发光素）。整体字面意思接近“夜之光”。","这是偏科学/生物化学语境的低频词，在科普或学术文章里更常见；日常英语更常说 bioluminescence（生物发光）或 sea sparkle（海荧光）。"]}
{"word":"noctilucous","summary":{"en":"Noctilucous describes something that glows in the dark or at night.","zh":"Noctilucous 用来形容在黑暗中或夜间会发光的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shining or glowing in the dark; visible at night because it gives off a faint light.","zh":"（在黑暗中）发光的；夜间可见的（因能发出微弱光）。"},"examples":[{"en":"Some deep-sea animals are noctilucous, producing light to attract prey.","zh":"一些深海动物具有夜光性，会发光来吸引猎物。"},{"en":"The beach looked magical because the water became noctilucous when we moved through it.","zh":"海滩看起来很梦幻，因为我们走动时海水会泛起夜光。"}]}],"synonyms":["bioluminescent","luminous","glowing","phosphorescent"],"phonetic":"/ˌnɑk.tɪˈlu.kəs/","extraExplanation":["词源：来自拉丁语 nocti-（夜晚）+ luc-（光），字面意思是“夜里发光的”。","常见语境：多用于科学/自然描写，尤其指“生物发光”（如夜光藻、萤火虫、某些深海生物）。在诗歌或文学描写中，也可用来营造神秘、静谧的夜景氛围。","相关概念提醒：noctilucous（夜里发光的）不要和 noctilucent clouds（夜光云/夜光云层）混淆；noctilucent 常用来特指高空的“夜光云”，而 noctilucous 更泛指会在夜间发光的事物或生物。"]}
{"word":"noctiluminous","summary":{"en":"Noctiluminous means “shining at night,” especially describing high clouds that glow after sunset (noctiluminous/noctilucent clouds).","zh":"Noctiluminous 意为“夜间发光的”，尤指日落后仍会发光的高空云（夜光云）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of clouds) shining at night, often with a bluish-white glow because they are high in the atmosphere and still lit by the sun after sunset.","zh":"（指云）夜间发光的；常呈蓝白色光泽，因为云层很高，日落后仍能被阳光照亮。"},"examples":[{"en":"Noctiluminous clouds sometimes appear in summer at high latitudes.","zh":"夜光云有时会在高纬度地区的夏季出现。"},{"en":"We saw a band of noctiluminous clouds glowing above the horizon after midnight.","zh":"午夜过后，我们看到地平线上方有一带夜光云在发光。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shining or emitting light in the night; luminous at night.","zh":"夜间发光的；在夜里明亮的。"},"examples":[{"en":"The lake looked noctiluminous under the moonlight.","zh":"在月光下，湖面看起来像是在夜里发光。"},{"en":"Fireflies create a noctiluminous scene in the garden.","zh":"萤火虫让花园里呈现出一幅夜间发光的景象。"}]}],"synonyms":["night-shining","luminous","glowing","radiant"],"phonetic":"/ˌnɑk.tɪˈluː.mə.nəs/","extraExplanation":["“noctiluminous”来自拉丁语：nocti-（夜）+ luminous（发光的）。在气象学里，它最常用来形容“夜光云”（noctilucent clouds）：一种位于中间层（mesosphere）极高处的云，通常在夏季的黄昏或黎明附近可见，呈淡蓝或银白色。","日常英语里更常见的说法是“glowing at night / shining at night”。“noctiluminous”偏书面、科学或文学描写。"]}
{"word":"noctiluscence","summary":{"en":"Noctiluscence means a faint night glow, especially the glow associated with noctilucent clouds.","zh":"Noctiluscence 指夜间的微光现象，尤常指与夜光云相关的发光/发亮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of giving off a faint light at night; night-glowing (often used for high, pale-blue “noctilucent clouds” seen after sunset in summer at high latitudes).","zh":"夜间发出微光的性质；夜光现象（常用于指夏季高纬度日落后可见的“夜光云/夜光云层”）。"},"examples":[{"en":"Scientists study noctiluscence to learn more about changes in the upper atmosphere.","zh":"科学家研究夜光现象，以更多了解高层大气的变化。"},{"en":"From the beach, we could see a faint blue noctiluscence lingering after sunset.","zh":"在海滩上，我们能看到日落后仍隐约停留的一抹蓝色夜光。"}]}],"synonyms":["night glow","luminescence","noctilucence"],"phonetic":"/ˌnɑk.tɪˈluː.səns/","extraExplanation":["拼写提示：更常见的拼写是 **noctilucence**（有时也写作 noctiluscence）。词源来自拉丁语 **noct-**（夜）+ **luc-**（光），字面意思是“夜里发光”。","在科普语境中，人们常说 **noctilucent clouds（夜光云）**：它们位于很高的大气层（中间层附近），在地面已进入黑夜时仍能被太阳照亮，所以看起来像发蓝白色光的云。"]}
{"word":"noctimania","summary":{"en":"Noctimania is a rare word meaning an obsessive urge to be awake or active at night.","zh":"Noctimania 是个较罕见的词，指对夜间清醒或活动的强迫性冲动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare term for an abnormal or obsessive urge to stay awake, be active, or go out at night; night-focused restlessness","zh":"罕见用语：对夜间活动或外出有异常/强迫性的冲动；偏向“夜间亢奋、夜里坐不住”的状态"},"examples":[{"en":"He joked about having noctimania because he always feels most energetic after midnight.","zh":"他开玩笑说自己有“noctimania”，因为他总是在半夜后最有精神。"},{"en":"The doctor asked whether her night restlessness was simple insomnia or something closer to noctimania.","zh":"医生询问她的夜间烦躁不安是单纯失眠，还是更接近“noctimania”的情况。"}]}],"synonyms":["nyctomania","insomnia","night restlessness"],"phonetic":"/ˌnɑk.təˈmeɪ.ni.ə/","extraExplanation":["词源：来自拉丁语词根 noct-（夜晚）+ -mania（躁狂/痴迷、强烈冲动）。","用法提示：在现代医学或心理学语境中并不常见，更常见的相关词是 insomnia（失眠）或 nyctomania（更常见的拼写变体）。若只是晚睡习惯，通常不会用到这个词。"]}
{"word":"noctipotent","summary":{"en":"Noctipotent means “powerful or effective at night,” a rare, literary adjective.","zh":"noctipotent 指“在夜间强大/有效的”，是较罕见的文学形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary, rare) Powerful or dominant at night; having special power in darkness.","zh":"（文学用语，罕见）在夜间强大或占优势的；在黑暗中具有特殊力量的。"},"examples":[{"en":"In the poem, the noctipotent moon seems to command the sea.","zh":"在这首诗里，“夜间强大的”月亮仿佛在指挥大海。"},{"en":"Owls are often portrayed as noctipotent creatures in folklore.","zh":"在民间传说中，猫头鹰常被描写成“夜间有力量”的生物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Able to act effectively at night; thriving in nighttime conditions.","zh":"（引申）夜里也能高效行动的；在夜间环境中更能发挥的。"},"examples":[{"en":"Some students feel noctipotent and do their best work after midnight.","zh":"有些学生到了半夜反而“夜里更有状态”，效率最高。"},{"en":"The city becomes noctipotent when the streets fill with music and light.","zh":"当街头充满音乐与灯光时，这座城市仿佛在夜里更有活力。"}]}],"synonyms":["nocturnal","night-active","powerful at night","of the night"],"phonetic":"/ˌnɑk.tɪˈpoʊ.tənt/","extraExplanation":["词源上可拆成拉丁语根：nocti-（夜，来自 nox/noctis）+ -potent（有力量的，来自 potens，“有力的”）。因此字面意思就是“夜之有力”。","这是非常偏文学/修辞的词，日常英语几乎不用；写作中更常用的表达是 powerful at night / active at night / nocturnal 等。"]}
{"word":"noctis","summary":{"en":"Noctis is a Latin form meaning “of the night,” and it’s also used as a modern proper name, especially in fiction.","zh":"Noctis 源自拉丁语，意为“夜之／属于夜晚的”，也常作为现代虚构作品中的专有名（人名等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; genitive singular of nox) “of the night” or “of night.” Often seen in mottos, titles, or scientific names.","zh":"（拉丁语；nox 的单数属格）“夜之／属于夜晚的”。常见于格言、标题或科学命名中。"},"examples":[{"en":"The phrase “filia noctis” literally means “daughter of the night.”","zh":"短语“filia noctis”字面意思是“夜之女儿／夜晚的女儿”。"},{"en":"Some fantasy stories use Latin-like names such as “Noctis” to create a dark, night-related mood.","zh":"一些奇幻作品会用类似拉丁语的名字如“Noctis”来营造偏暗、与夜相关的氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used in modern fiction and pop culture (for example, a character name).","zh":"现代虚构作品与流行文化中使用的专有名（例如角色名）。"},"examples":[{"en":"Noctis is the main character in the video game Final Fantasy XV.","zh":"Noctis 是电子游戏《最终幻想15》的主角。"},{"en":"The author chose the name Noctis because it sounds mysterious and night-themed.","zh":"作者选用 Noctis 这个名字，因为它听起来神秘，并且带有“夜”的主题。"}]}],"synonyms":["(Latin sense) of the night","(related) nocturnal","nocturne"],"phonetic":"/ˈnɑk.tɪs/","extraExplanation":["“noctis”是拉丁语名词“nox（夜晚）”的属格形式，属格常用来表达“……的”，所以常被翻译成“夜之／夜的”。这也是很多英文作品喜欢借用拉丁语形式来增强氛围感的原因。","相关词根：noct- 表示“夜”，在英语里常见于 nocturnal（夜行性的）、nocturne（夜曲）等词。"]}
{"word":"noctivagant","summary":{"en":"Noctivagant means being active or wandering at night (a rare, literary word).","zh":"noctivagant 指“夜间活动的/夜里游荡的”（较少见，偏文学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person or animal) active at night; moving or wandering during the night.","zh":"（人或动物）夜间活动的；夜里游荡的。"},"examples":[{"en":"Owls are noctivagant hunters, searching for food after dark.","zh":"猫头鹰是夜间活动的猎手，会在天黑后觅食。"},{"en":"In the novel, the detective is a noctivagant figure who walks the city streets at midnight.","zh":"在小说里，这位侦探是个夜里游荡的人物，会在午夜走遍城市街道。"}]}],"synonyms":["nocturnal","night-roaming","night-wandering","nightly"],"phonetic":"/ˌnɑk.tɪˈveɪ.ɡənt/","extraExplanation":["这个词比较少见、偏文学或学术语境，常用来营造“夜色”“游荡”“神秘”的氛围。日常英语里更常见的说法是 nocturnal（夜行性的/夜间活动的）。","词源上可拆为 nocti-（夜）+ vagant（游荡的），所以含义直观：在夜里徘徊或活动。"]}
{"word":"noctivagation","summary":{"en":"Noctivagation means wandering or walking around at night.","zh":"noctivagation 指“夜间行走/夜游/夜间漫步或徘徊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of walking or wandering at night; nighttime roaming","zh":"夜间行走；夜游；夜间漫步/徘徊"},"examples":[{"en":"Noctivagation can be peaceful when the streets are quiet.","zh":"当街道安静时，夜游可能让人感到很平静。"},{"en":"The writer described his noctivagation through the old city to clear his mind.","zh":"这位作家描写了他在老城里的夜间漫步，以让自己头脑清醒。"},{"en":"For safety, avoid noctivagation alone in unfamiliar areas.","zh":"为安全起见，避免在不熟悉的地方独自夜间徘徊。"}]}],"synonyms":["night wandering","night walk","roaming at night","nocturnal wandering"],"phonetic":"/ˌnɑk.tɪ.vəˈɡeɪ.ʃən/","extraExplanation":["这是一个比较罕见、偏文学/书面语的词，日常英语里更常说：“a walk at night / wandering at night / night walk / night wandering”。","词源可拆解理解：nocti-（夜，来自拉丁语 nox/noct-）+ vagation（漫游、游荡，来自拉丁语 vagari “wander”）。因此它直译就是“夜间漫游”。","语气上常带一点“诗意/沉思”的感觉，但也可能用于较正式的描述（例如报告中谈到某人夜间外出活动）。"]}
{"word":"noctivagous","summary":{"en":"Noctivagous means being active or roaming at night; a rare, literary synonym of nocturnal.","zh":"noctivagous 指“夜间活动/夜里出没的”，较少见，偏文学或学术用法，可视为 nocturnal 的更文艺同义词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Active or traveling at night; nocturnal in habit.","zh":"夜间活动的；夜行的；习惯在夜里出没的。"},"examples":[{"en":"Owls and bats are noctivagous animals.","zh":"猫头鹰和蝙蝠是夜行性动物。"},{"en":"The noctivagous insects gathered around the porch light.","zh":"夜行的昆虫聚集在门廊的灯光周围。"}]}],"synonyms":["nocturnal","night-active","night-roaming"],"phonetic":"/ˌnɑk.tɪˈveɪ.ɡəs/","extraExplanation":["这是一个比较少见、偏文学或学术的词，多见于描写动物习性或营造“夜色/神秘”氛围的写作。日常口语里更常用 **nocturnal**（夜行的）。","词源上可拆看：**nocti-**（night，夜）+ **-vagous**（wandering，游荡/漫游，来自拉丁语 *vagari*）。因此它强调“夜里游荡/出没”，语感比 nocturnal 更“画面化”。","在文学描写中，它常用于塑造夜行人物或生物的气质，例如形容“noctivagous wanderers（夜游者）”来营造孤独、神秘或城市夜生活的意象。"]}
{"word":"noctograph","summary":{"en":"A noctograph is a device used for writing in the dark, especially for taking notes at night without a light.","zh":"noctograph 指一种可在黑暗中书写的装置，常用于夜间不点灯记笔记。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that lets you write in the dark (often by using a guiding frame or special paper), so you can take notes at night without light.","zh":"夜间书写器；（用导向框或特殊纸张等）让人无需照明也能在黑暗中写字、记笔记的装置。"},"examples":[{"en":"He kept a noctograph by his bed to jot down ideas without turning on the lamp.","zh":"他在床边放了一个夜间书写器，这样不用开灯也能记下灵感。"},{"en":"Before electric lighting was common, some writers used a noctograph to record thoughts at night.","zh":"在电灯尚未普及之前，一些作家会用夜间书写器在夜里记录想法。"}]}],"synonyms":["night-writing device","writing frame","blind-writing device"],"phonetic":"/ˈnɑk.təˌɡræf/","extraExplanation":["词源：nocto- 来自拉丁语 nox（夜晚），-graph 来自希腊语 graphō（写）。字面意思就是“夜里写字的东西”。","历史背景：在蜡烛和油灯不方便或不安全的年代，noctograph 作为一种“无光书写”工具曾有实际用途。后来随着照明普及，这个词变得较少见，更多出现在历史或文学语境中。"]}
{"word":"noctovision","summary":{"en":"Noctovision means the ability to see in the dark (night vision), often referring to animals or special devices.","zh":"Noctovision 指“夜视能力”，即在黑暗中看见的能力，常指动物或夜视设备的功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability to see in the dark; night vision (often used for animals or special equipment).","zh":"在黑暗中看见的能力；夜视（常用于动物或夜视设备）。"},"examples":[{"en":"Cats have strong noctovision, so they can move around at night more easily than humans.","zh":"猫的夜视能力很强，所以它们晚上活动比人更容易。"},{"en":"The soldier used noctovision goggles to see in the dark.","zh":"士兵用夜视护目镜在黑暗中观察。"}]}],"synonyms":["night vision","dark vision","low-light vision"],"phonetic":"/ˌnɑktoʊˈvɪʒən/","extraExplanation":["“noctovision”在日常英语里不算常见，更常用的是“night vision”。它常出现在科幻、军事/装备说明或技术语境中。","构词上，“nocto-”来自拉丁语“nox/noctis”（夜晚），“vision”是“视觉”。理解前缀有助于记忆类似词：nocturnal（夜行性的）。"]}
{"word":"noctua","summary":{"en":"Noctua is mainly a scientific name: a genus of night-flying moths; it is also Latin for “owl” and appears in some species names.","zh":"Noctua 主要是科学名称：夜蛾科中的一个蛾类属名；同时它在拉丁语中意为“猫头鹰”，也会出现在一些物种名称里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A genus of moths in the family Noctuidae (owlet moths).","zh":"（动物学/分类学）夜蛾科中的一个蛾类属名（Noctua），属于常见的“夜蛾/猫头鹰蛾”类群。"},"examples":[{"en":"Researchers recorded several Noctua moths attracted to the porch light at night.","zh":"研究人员记录到几只 Noctua 属的夜蛾在夜间被门廊灯光吸引。"},{"en":"Noctua comes up often in field guides to common night-flying moths.","zh":"在介绍常见夜行蛾类的野外图鉴中，Noctua 这个属名经常出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; historical/Latin use) “Noctua” is Latin for “owl,” and it may appear in older scientific naming or in species names (e.g., the epithet in Athene noctua, the little owl).","zh":"（较少见；历史/拉丁语用法）Noctua 是拉丁语“猫头鹰”的意思，会出现在较早的科学命名中，或作为物种名的一部分（如小鸮 Athene noctua 中的 noctua）。"},"examples":[{"en":"In Latin texts, noctua refers to an owl, a bird associated with the night.","zh":"在拉丁语文本里，noctua 指猫头鹰，这是一种与夜晚相关的鸟。"},{"en":"The species name Athene noctua includes noctua to highlight its “owl” identity.","zh":"物种名 Athene noctua 使用 noctua 来强调它“猫头鹰”的身份。"}]}],"synonyms":["(taxonomy) Noctuidae (related family name)","(Latin sense) owl (English meaning)"],"phonetic":"/ˈnɑk.tʃu.ə/","extraExplanation":["Noctua 源自拉丁语 nox/noctis（夜晚），所以在生物学命名里常被用来指“夜行性”或与夜晚相关的生物。","在西方文化中，“猫头鹰”常与雅典娜（Athena/Minerva）的智慧象征相关联；因此 noctua 也会在一些文学或象征语境里出现，带有“夜与洞察”的联想。"]}
{"word":"noctuae","summary":{"en":"Noctuae is a Latin-style plural meaning “owls,” and it can also appear as a taxonomic plural for members of the genus Noctua (moths) in older scientific writing.","zh":"Noctuae 是拉丁语风格的复数，常指“猫头鹰/鸮类”；在较旧的科学写作中也可用作 Noctua（夜蛾属）成员的拉丁化复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; plural form) “owls.” In English texts, it may appear when quoting Latin or using Latin-style scientific naming.","zh":"（拉丁语；复数形式）“猫头鹰/鸮类”。在英文中多见于引用拉丁文，或在带拉丁语风格的学术/科学语境中使用。"},"examples":[{"en":"In the margin, the scholar wrote “noctuae” to gloss the word “owls.”","zh":"在页边空白处，学者写下“noctuae”来注释“owls（猫头鹰）”这个词。"},{"en":"The manuscript lists birds in Latin, including aquilae (eagles) and noctuae (owls).","zh":"手稿用拉丁语列出鸟类，包括 aquilae（鹰）和 noctuae（猫头鹰）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Taxonomy; Latin-style plural) a plural form used for members of the genus Noctua (a group of moths), seen mainly in older or Latinized scientific writing.","zh":"（分类学；拉丁化复数）指夜蛾属（Noctua）的一些成员；主要见于较旧或拉丁化的科学写作中。"},"examples":[{"en":"Older notes refer to several “Noctuae” collected near the river.","zh":"较早的笔记提到在河边采集到几种“Noctuae（夜蛾属成员）”。"},{"en":"Modern papers usually prefer “Noctua species” rather than the Latin plural “Noctuae.”","zh":"现代论文通常更爱用“Noctua species（夜蛾属物种）”，而不是拉丁复数“Noctuae”。"}]}],"synonyms":["owls (contextual meaning)","Strigidae (scientific: many ‘true owls’)"],"phonetic":"/nɑkˈtuːiː/","extraExplanation":["“noctuae”本身不是常见英语词，更像是拉丁语形态出现在英文语境中：要么是 noctua（猫头鹰/鸮）的复数“noctuae”，要么是把属名 Noctua 按拉丁方式做成复数，用在较旧的分类学记录里。","发音在英语里不固定；不同作者会按拉丁/英语习惯读法略有差异。阅读时更重要的是结合上下文判断：是在谈鸟类（owl）还是在谈昆虫分类（Noctua 属）。"]}
{"word":"noctuid","summary":{"en":"Noctuid usually means a moth (or related) from the mostly night-active family Noctuidae.","zh":"Noctuid 通常指夜蛾科的蛾类，或表示“夜蛾科的”，多在夜间活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a moth in the family Noctuidae (often called an owlet moth), many of which are active at night and can be agricultural pests","zh":"夜蛾科的蛾类（常称“枭蛾/夜蛾”），多在夜间活动，其中不少会危害农作物"},"examples":[{"en":"The farmer noticed noctuids flying around the field after sunset.","zh":"农民发现日落后有夜蛾科的蛾在田地上飞。"},{"en":"Some noctuid larvae feed on crops like corn and cotton.","zh":"一些夜蛾科幼虫会取食玉米、棉花等作物。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the moth family Noctuidae","zh":"与夜蛾科（Noctuidae）有关的；夜蛾科的"},"examples":[{"en":"Researchers compared noctuid species across different habitats.","zh":"研究人员比较了不同栖息地中的夜蛾科物种。"},{"en":"A noctuid caterpillar was found on the underside of the leaf.","zh":"在叶片背面发现了一只夜蛾科的毛毛虫。"}]}],"synonyms":["owlet moth","noctuid moth"],"phonetic":"/ˈnɑk.tu.ɪd/","extraExplanation":["“noctuid”来自拉丁语词根 noct-（夜晚），和英语 “nocturnal（夜行性的）”同源。夜蛾科是鳞翅目中非常大的一科，常见的幼虫俗称“地老虎/切根虫（cutworms）”等，会在夜间取食，农业上常被关注。"]}
{"word":"noctuidae","summary":{"en":"Noctuidae: the scientific name of the owlet moth family (mostly nocturnal moths).","zh":"Noctuidae：夜蛾科（多为夜行性蛾类）的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large family of mostly night-flying moths, often called owlet moths (scientific family name: Noctuidae).","zh":"夜蛾科：一种以夜间活动为主的大型蛾类科（学名：Noctuidae），常被称为“猫头鹰蛾/夜蛾”。"},"examples":[{"en":"Many common garden pests belong to the Noctuidae family.","zh":"许多常见的园艺害虫都属于夜蛾科。"},{"en":"The moth we trapped at night was identified as a Noctuidae species.","zh":"我们夜里诱捕到的那只蛾被鉴定为夜蛾科的一种。"}]}],"synonyms":["owlet moths"],"phonetic":"/nɑkˈtu.ə.di/","extraExplanation":["“Noctuidae”来自拉丁语词根 noct-（夜晚），因此与“夜行性”有关。","夜蛾科包含的物种非常多，其中不少幼虫被称为“切根虫/地老虎”（cutworms）或“夜盗虫”（armyworms），在农业上可能造成危害。","英语里更常见的通俗说法是 owlet moths（猫头鹰蛾），学术或科普文章中则常直接用 Noctuidae。"]}
{"word":"noctuideous","summary":{"en":"Noctuideous means “noctuid-like” or “related to noctuid moths,” a rare term used mainly in biology.","zh":"Noctuideous 指“类似夜蛾科的”或“与夜蛾科有关的”，是主要用于生物学语境的罕见词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, biology) Relating to or resembling noctuid moths (the family Noctuidae), which are typically active at night.","zh":"（罕用，生物）与夜蛾科（Noctuidae）有关的；或外形、特征类似夜蛾科昆虫的（多为夜间活动）。"},"examples":[{"en":"The researcher described the specimen as noctuideous because its wing pattern matched common noctuid moths.","zh":"研究者把该标本描述为 noctuideous，因为它的翅纹与常见的夜蛾科昆虫相符。"},{"en":"Noctuideous larvae can be serious crop pests in some regions.","zh":"在一些地区，noctuideous 的幼虫可能成为严重的作物害虫。"}]}],"synonyms":["noctuid","noctuid-like","night-flying (context-dependent)"],"phonetic":"/nɑkˈtuɪdiəs/","extraExplanation":["这个词非常少见，更多时候你会在昆虫学里看到 **noctuid**（名词/形容词：夜蛾科的；夜蛾科昆虫）或 **Noctuidae**（夜蛾科，学名）。如果你是在论文或标本记录里遇到 *noctuideous*，通常是指“具有夜蛾科特征的”。","拼写上也可能有人想写 **noctuidous**（同样罕见）或直接用 **noctuid**。正式写作中更常用 *noctuid* 来表达同一意思。"]}
{"word":"noctuidous","summary":{"en":"Noctuidous means “of or relating to the moth family Noctuidae.”","zh":"noctuidous 意为“夜蛾科的；与夜蛾科有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the moth family Noctuidae (a large group often called owlet moths).","zh":"与夜蛾科（Noctuidae，常被称为“猫头鹰夜蛾/夜蛾”）有关的；夜蛾科的。"},"examples":[{"en":"The researcher recorded several noctuidous species in the cornfield at night.","zh":"研究人员在夜间的玉米地里记录到了几种夜蛾科物种。"},{"en":"Noctuidous larvae can be serious pests in agriculture.","zh":"夜蛾科幼虫在农业上可能是严重的害虫。"}]}],"synonyms":["noctuid"],"phonetic":"/nɑkˈtuːɪdəs/","extraExplanation":["“noctuidous”是较少见的学术用词，多见于昆虫学/生物分类学写作；日常英语里更常用的是“noctuid”（既可作形容词也可作名词，指夜蛾科的或夜蛾科成员）。","词根来自拉丁语“noctu-”（夜晚），与“nocturnal（夜行性的）”同源；“Noctuidae”是夜蛾科的拉丁学名。"]}
{"word":"noctuids","summary":{"en":"Noctuids are nocturnal moths in the Noctuidae family; some species are important crop pests.","zh":"Noctuids 指夜蛾科的夜行性蛾类；其中一些是重要的农作物害虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"moths in the family Noctuidae (often called “noctuid moths” or “owlet moths”), usually active at night; many species are common and some are agricultural pests.","zh":"夜蛾科（Noctuidae）的蛾类（常称“夜蛾/夜蛾科蛾”“猫头鹰蛾”），多在夜间活动；种类很常见，其中一些会危害农作物。"},"examples":[{"en":"Noctuids are attracted to porch lights on warm summer nights.","zh":"温暖的夏夜里，夜蛾常会被门廊灯光吸引。"},{"en":"Some noctuids lay eggs on crops, and the larvae can become serious pests.","zh":"有些夜蛾会在农作物上产卵，幼虫可能成为严重害虫。"}]}],"synonyms":["noctuid moths","owlet moths","Noctuidae"],"phonetic":"/ˈnɑk.tu.ɪdz/","extraExplanation":["“noctuids”是复数形式；单数为“noctuid”，指“夜蛾科的一种蛾”。","词源与拉丁语“noct-（夜）”有关，因此带有“夜间活动”的含义。夜蛾科物种数量很大，在昆虫学与农业防治语境中常见。","“owlet moths（猫头鹰蛾）”是常见别名，来自它们有时较大的眼状斑纹或外观给人的联想，并不表示它们和猫头鹰有直接关系。"]}
{"word":"noctuiform","summary":{"en":"Noctuiform is a rare adjective meaning “noctuid-moth-like,” used mainly in scientific descriptions.","zh":"noctuiform 是个少见的形容词，主要用于科学描写，意思是“夜蛾（夜行蛾类）那样的/与夜蛾有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, scientific) Resembling or relating to noctuids—night‑flying moths of the family Noctuidae; moth‑like in the way a noctuid is.","zh":"（罕见/科学用语）像夜蛾（Noctuidae，夜蛾科）那样的；与夜蛾（夜行蛾类）有关的。"},"examples":[{"en":"The researcher described the insect’s wing pattern as noctuiform, typical of many night moths.","zh":"研究者把这种昆虫的翅纹描述为“夜蛾型（noctuiform）”，这在许多夜行蛾中很常见。"},{"en":"A noctuiform silhouette appeared near the porch light after dark.","zh":"天黑后，门廊灯附近出现了一个夜蛾型的轮廓。"}]}],"synonyms":["noctuid","moth-like","nocturnal (near meaning in some contexts)"],"phonetic":"/nɑkˈtuːɪˌfɔrm/","extraExplanation":["这个词非常少见，多见于分类学/昆虫学写作中，用来表达“像夜蛾那样的外形或特征”。词根 noctu- 来自拉丁语 nox（夜晚），-form 表示“形状/外形”。日常英语里更常说 nocturnal（夜行的）或 moth-like（像飞蛾的）。"]}
{"word":"noctule","summary":{"en":"A noctule is a large European bat that flies at dusk and at night.","zh":"noctule 指一种欧洲常见的大型蝙蝠，主要在黄昏与夜间活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large bat that is common in Europe and parts of Asia, active at dusk and at night.","zh":"一种体型较大的蝙蝠（常见于欧洲及亚洲部分地区），多在黄昏和夜间活动。"},"examples":[{"en":"At dusk, a noctule bat flew over the lake looking for insects.","zh":"黄昏时，一只犬吻蝠在湖面上飞行捕食昆虫。"},{"en":"The park is known for its noctules in late summer.","zh":"这个公园在夏末以犬吻蝠出没而闻名。"}]}],"synonyms":["bat"],"phonetic":"/ˈnɑk.tuːl/","extraExplanation":["“Noctule”来自拉丁语词根 noct-（夜晚），与 nocturnal（夜行性的）同源，所以看到这个词根可以联想到“夜晚/夜行”。","在英国英语语境中，noctule 通常特指“common noctule”（普通犬吻蝠，学名 Nyctalus noctula）。在北美日常英语里这个词不算常见，更常用的是 bat（蝙蝠）或具体种名。"]}
{"word":"noctules","summary":{"en":"Noctules are large night-flying bats (plural of noctule), especially the European noctule bat.","zh":"Noctules 指大型夜行蝙蝠（noctule 的复数），尤指欧洲的普通夜蝠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"large bats (plural of noctule), especially the European noctule bat, that are active at night.","zh":"（noctule 的复数）一种大型蝙蝠，尤指欧洲的“普通夜蝠/夜蝠”，夜间活动。"},"examples":[{"en":"Noctules often emerge at dusk to hunt insects.","zh":"夜蝠常在黄昏时飞出捕食昆虫。"},{"en":"Researchers recorded the calls of noctules over the river.","zh":"研究人员在河上方录下了夜蝠的叫声。"}]}],"synonyms":["bats","noctule bats"],"phonetic":"/ˈnɑk.tʃuːlz/","extraExplanation":["“noctule”来自拉丁语 noctula，意为“夜间活动的小生物/小夜行者”，与英语 nocturnal（夜行性的）同源。","在自然写作里，noctules 常用来营造“暮色中蝙蝠出没”的氛围；日常英语中更常说 bats（蝙蝠），而 noctule/noctules 更偏科普或文学表达。"]}
{"word":"noctuoid","summary":{"en":"Noctuoid means “related to” or “a member of” the moth group Noctuoidea (especially owlet moth relatives).","zh":"noctuoid 指“与夜蛾总科有关/相似的”，或“夜蛾总科的一员（夜蛾类蛾）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Entomology) Relating to or resembling the moth family Noctuidae (owlet moths) or the larger group Noctuoidea.","zh":"（昆虫学）与夜蛾科（Noctuidae，俗称“猫头鹰蛾/夜蛾”）或更大的夜蛾总科（Noctuoidea）有关的；像夜蛾的。"},"examples":[{"en":"The researcher identified the specimen as a noctuoid moth based on its wing shape.","zh":"研究人员根据翅形判断该标本是一只夜蛾总科的蛾。"},{"en":"Noctuoid species are often attracted to porch lights at night.","zh":"夜蛾类物种常在夜里被门廊灯光吸引。"}]},{"partOfSpeech":"n.","definition":{"en":"A moth belonging to the group Noctuoidea (including many common night-flying moths).","zh":"夜蛾总科的蛾；夜蛾类蛾（包含许多常见的夜行性蛾）。"},"examples":[{"en":"Several noctuoids were trapped for the biodiversity survey.","zh":"为生物多样性调查捕获了几只夜蛾类蛾。"},{"en":"Compared with butterflies, many noctuoids have duller colors for camouflage.","zh":"与蝴蝶相比，许多夜蛾类蛾的颜色更暗淡，以便伪装。"}]}],"synonyms":["noctuid (more specific)","owlet moth (common name, often for Noctuidae)"],"phonetic":"/nɑkˈtuːɔɪd/","extraExplanation":["“noctuoid”主要用于科学写作与昆虫分类学，不太用于日常英语。它通常指“夜蛾总科（Noctuoidea）”这一大类群，而不只是一种具体蛾。","词根来自拉丁语 noct-（夜晚，见于 nocturnal“夜行性的”）。因此它常和“夜间活动的蛾类”这一概念关联。"]}
{"word":"nocturia","summary":{"en":"Nocturia means waking up at night to urinate.","zh":"Nocturia 指夜间醒来排尿（夜尿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Waking up during the night one or more times to urinate.","zh":"夜间起床排尿一次或多次（夜尿）。"},"examples":[{"en":"He wakes up twice a night because of nocturia.","zh":"他因为夜尿每晚醒来两次。"},{"en":"The doctor asked whether nocturia was affecting her sleep.","zh":"医生问夜尿是否影响了她的睡眠。"}]}],"synonyms":["nighttime urination","night urination"],"phonetic":"/nɑkˈtjʊriə/","extraExplanation":["“nocturia”是医学用语，常见于病历、体检报告或医生问诊中。日常口语更常说“waking up at night to pee/urinate”（半夜起来尿尿/排尿）。","它有时与睡前喝太多水、咖啡因/酒精、怀孕、前列腺增生、泌尿系感染、糖尿病、睡眠问题等因素有关；如果频繁影响睡眠，通常建议咨询医生做评估。","词源：noct- 表示“夜晚”（如 nocturnal 夜行的），-uria 表示“尿/排尿”（与 urine 同源）。"]}
{"word":"nocturn","summary":{"en":"Nocturne (often misspelled as “nocturn”) is most commonly a calm, night-inspired musical piece, especially for piano; it can also mean an artwork that depicts the mood of night.","zh":"Nocturne（常被误写成“nocturn”）最常指“夜曲”，即受夜晚启发、宁静抒情的音乐作品（尤指钢琴曲）；也可指描绘夜色氛围的艺术作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short piece of music that is calm and lyrical, often suggesting night-time (especially for piano)","zh":"夜曲：一种短小、宁静抒情的音乐作品，常用来描绘夜晚（尤指钢琴曲）"},"examples":[{"en":"Chopin wrote many famous nocturnes for piano.","zh":"肖邦创作了许多著名的钢琴夜曲。"},{"en":"She practiced a nocturne before going on stage.","zh":"她上台前练习了一首夜曲。"},{"en":"The film’s soundtrack ends with a gentle nocturne.","zh":"这部电影的配乐以一段温柔的夜曲结束。"}]},{"partOfSpeech":"n.","definition":{"en":"a work of art (such as a poem, painting, or scene in a story) that depicts the night or a nighttime mood","zh":"夜景作品：描绘夜晚或夜色氛围的艺术作品（如诗、画或小说场景）"},"examples":[{"en":"The poet’s nocturne describes a quiet city after midnight.","zh":"这位诗人的“夜景作品”描写了午夜后的安静城市。"},{"en":"The painting is a nocturne in deep blues and soft lights.","zh":"这幅画是一幅以深蓝与柔光为主的夜景画。"}]}],"synonyms":["night piece","night music","night scene"],"phonetic":"/ˈnɑkˌtɝn/","extraExplanation":["你输入的“nocturn”更常见的标准拼写是 **nocturne**。在音乐里尤其常用这个拼写；“nocturn”偶尔会作为旧式或简写形式出现，但在现代英语中不如“nocturne”常见。","词源来自法语 *nocturne*，与拉丁语 *nocturnus*（“夜间的”）同源；因此它常带有“夜晚、静谧、沉思”的文化联想。"]}
{"word":"nocturnal","summary":{"en":"Nocturnal means active at night or related to the night.","zh":"Nocturnal 指“夜行性的”或“与夜晚有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Active at night and resting during the day; happening at night.","zh":"夜行性的；在夜间活动、白天休息的；发生在夜间的。"},"examples":[{"en":"Owls are nocturnal birds, so they hunt after dark.","zh":"猫头鹰是夜行性鸟类，所以它们天黑后捕猎。"},{"en":"I get nocturnal when I’m stressed and end up working at midnight.","zh":"我压力大时会变得“夜行”，结果常常半夜还在工作。"},{"en":"The desert has many nocturnal animals to avoid the daytime heat.","zh":"沙漠里有许多夜行性动物，用来躲避白天的高温。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More formal) Related to the night.","zh":"（较正式）与夜晚有关的。"},"examples":[{"en":"The city looked peaceful under the nocturnal sky.","zh":"在夜空下，这座城市看起来很宁静。"},{"en":"We heard nocturnal sounds from the forest.","zh":"我们听到森林里传来的夜间声音。"}]}],"synonyms":["night-active","nighttime","nightly"],"phonetic":"/nɑkˈtɝnəl/","extraExplanation":["“nocturnal”来自拉丁语 nocturnus（夜的），和“noct-”（夜）相关的词还有：nocturne（夜曲）、noctilucent（夜光的）。","日常英语里常见搭配：nocturnal animals（夜行性动物）、nocturnal activity（夜间活动）、nocturnal habits（夜间习惯）。有时也会用来形容人作息“像夜行性动物一样”——比较口语、带一点幽默。"]}
{"word":"nocturnality","summary":{"en":"Nocturnality means being active at night instead of during the day.","zh":"Nocturnality 指“夜行性”，即夜间活动、白天休息的习性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or habit of being active at night and resting during the day","zh":"夜行性；在夜间活动、白天休息的状态或习性"},"examples":[{"en":"Owls are known for their nocturnality.","zh":"猫头鹰以夜行性著称。"},{"en":"The animal’s nocturnality helps it avoid daytime heat.","zh":"这种动物的夜行性有助于它避开白天的高温。"}]}],"synonyms":["night activity","nighttime behavior"],"phonetic":"/ˌnɑk.tɚˈnæl.ə.ti/","extraExplanation":["词根提示：noct- 来自拉丁语 nox / noctis（“夜晚”），也出现在 nocturnal（夜间的/夜行的）、nocturne（夜曲）等词中。","常见搭配：nocturnality in animals（动物的夜行性）、shift from diurnality to nocturnality（从日行性转为夜行性）。对应词：diurnality（日行性）。"]}
{"word":"nocturnally","summary":{"en":"Nocturnally means “at night” or “in a night-time way,” often used in formal or scientific contexts.","zh":"Nocturnally 意为“在夜间；以夜间的方式”，常用于较正式或科普语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that happens at night; during the night","zh":"在夜间；以夜间的方式（发生）"},"examples":[{"en":"Owls hunt nocturnally, using their sharp hearing to find prey in the dark.","zh":"猫头鹰在夜间捕猎，利用敏锐的听觉在黑暗中找到猎物。"},{"en":"Some animals feed nocturnally to avoid the daytime heat.","zh":"有些动物在夜间进食，以避开白天的高温。"},{"en":"The flowers open nocturnally and close again in the morning.","zh":"这些花在夜间开放，早晨又合拢。"}]}],"synonyms":["at night","during the night","nightly"],"phonetic":"/nɑkˈtɝnəli/","extraExplanation":["“nocturnally”来自拉丁语词根 noct-，意思是“夜”。常见搭配有：nocturnally active（夜间活动的）、hunt/feed/migrate nocturnally（夜间捕猎/进食/迁徙）。","它多用于科学、自然纪录片或较正式的写作中；日常口语里更常说 at night / during the night（在夜里）。"]}
{"word":"nocturne","summary":{"en":"A nocturne is usually a gentle, night-inspired piece of music (often for piano), and can also mean any artwork that evokes a nighttime mood.","zh":"nocturne 通常指“夜曲”（多为钢琴等夜晚灵感的抒情音乐），也可泛指营造夜晚氛围的艺术作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musical composition inspired by the night, usually calm, lyrical, and expressive (often written for solo piano).","zh":"“夜曲”：以夜晚为灵感的音乐作品，通常安静、抒情、富有表现力（常见为钢琴独奏）。"},"examples":[{"en":"She played a Chopin nocturne to relax before bed.","zh":"她睡前弹了一首肖邦的夜曲来放松。"},{"en":"The concert ended with a gentle nocturne.","zh":"音乐会以一首温柔的夜曲收尾。"}]},{"partOfSpeech":"n.","definition":{"en":"A work of art (or writing) that suggests a nighttime mood or scene.","zh":"（艺术/文学）表现夜晚氛围或夜景的作品。"},"examples":[{"en":"The painter’s nocturne showed a quiet city under moonlight.","zh":"这位画家的“夜景作品”呈现了月光下安静的城市。"},{"en":"The poem reads like a nocturne—soft, dark, and reflective.","zh":"这首诗读起来像一首夜曲——柔和、幽暗而富于沉思。"}]}],"synonyms":["night piece","night music","serenade (related)","composition","night scene"],"phonetic":"/ˈnɑkˌtɝn/","extraExplanation":["“Nocturne”来自拉丁语 nocturnus（夜间的）。在音乐史上，它作为体裁常与浪漫主义时期联系在一起，最著名的是肖邦（Chopin）的钢琴夜曲，强调歌唱般的旋律与夜晚的情绪。","在英语里，nocturne 常带有“夜晚的氛围感”这一审美意味：宁静、朦胧、内省，不只是字面上的“夜里发生”。"]}
{"word":"nocturnes","summary":{"en":"Nocturnes are works inspired by the night—most often lyrical pieces of music (especially for piano), and sometimes night-themed scenes in art or literature.","zh":"Nocturnes 指受夜晚启发的作品——最常见是抒情的“夜曲”（尤指钢琴曲），也可指艺术或文学中的夜景/夜间氛围作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musical composition inspired by the night, usually calm, lyrical, and expressive (especially common as a short piano piece).","zh":"（音乐）“夜曲”；受夜晚氛围启发的乐曲，通常宁静、抒情、富于表现力（尤指短小的钢琴曲）。"},"examples":[{"en":"Chopin’s nocturnes are famous for their gentle, singing melodies.","zh":"肖邦的夜曲以温柔、如歌的旋律而闻名。"},{"en":"She practiced a nocturne every evening to improve her touch and phrasing.","zh":"她每天晚上练一首夜曲来提升触键和乐句处理。"}]},{"partOfSpeech":"n.","definition":{"en":"A night scene, night-themed artwork, or writing that creates a mood of the nighttime.","zh":"（文学/艺术）夜景作品；以夜晚为主题、营造夜晚氛围的绘画或文字作品。"},"examples":[{"en":"The novel includes several nocturnes—quiet city scenes lit by streetlamps.","zh":"这部小说里有几段“夜景”描写——路灯下安静的城市画面。"},{"en":"The painter is known for nocturnes that capture moonlight on water.","zh":"这位画家以描绘月光映在水面上的“夜景画”而著称。"}]}],"synonyms":["night piece","night music","night scene","night painting"],"phonetic":"/ˈnɑk.tɝːn/","extraExplanation":["“Nocturne”来自拉丁语 nocturnus（夜间的）。在英语里，它既可指“夜曲”（音乐体裁），也可泛指带有夜晚氛围的艺术作品。","在古典音乐语境中，最常见的联想是肖邦（Chopin）的钢琴《夜曲》（Nocturnes）。艺术领域也常用 nocturne 指像惠斯勒（Whistler）的《Nocturne》系列那样的夜景画。"]}
{"word":"nocturns","summary":{"en":"Nocturnes are works—especially musical pieces—meant to evoke the feeling of night.","zh":"Nocturnes 指以“夜晚氛围”为主题或灵感的作品，尤指音乐中的“夜曲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a musical composition inspired by the night, usually calm, lyrical, and expressive (often for piano).","zh":"（音乐）夜曲：以“夜晚”为灵感、通常抒情宁静、富有情感的乐曲（常见为钢琴曲）。"},"examples":[{"en":"I listen to Chopin’s nocturnes when I need to relax.","zh":"我需要放松时会听肖邦的夜曲。"},{"en":"The pianist performed two nocturnes as an encore.","zh":"钢琴家加演了两首夜曲。"}]},{"partOfSpeech":"n.","definition":{"en":"a work of art (such as a painting, poem, or photograph) that depicts or suggests a nighttime scene or mood.","zh":"（艺术）夜景作品：描绘或营造夜晚景象与氛围的作品（如绘画、诗歌或摄影）。"},"examples":[{"en":"The gallery featured nocturnes of the city lights after rain.","zh":"画廊展出了雨后城市灯光的夜景作品。"},{"en":"Her poem reads like a quiet nocturne—soft, dark, and reflective.","zh":"她的诗读起来像一首安静的“夜曲”——柔和、幽暗、富于沉思。"}]}],"synonyms":["night piece","night music","night scene","evensong"],"phonetic":"/ˈnɑkˌtɝn/","extraExplanation":["“Nocturne”源自法语，和拉丁语“nox（夜晚）”相关。英文里常译为“夜曲”。最有名的是肖邦的《夜曲》（Nocturnes），因此在音乐语境中这个词特别常见。","形式上你输入的“nocturns”是复数拼法；更常见的复数是“nocturnes”。日常写作里建议用“nocturnes”，除非你在引用特定标题或风格化拼写。"]}
{"word":"nocuity","summary":{"en":"Nocuity means harmfulness—the quality of causing harm, especially in formal or scientific contexts.","zh":"Nocuity 指“有害性/致害性”，常见于较正式或科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being harmful; harmfulness (often used in formal or scientific writing).","zh":"有害性；致害性（多见于较正式或科学文体）。"},"examples":[{"en":"Researchers tested the nocuity of the chemical at different doses.","zh":"研究人员在不同剂量下测试了这种化学品的有害性。"},{"en":"The report focused on long-term nocuity rather than short-term discomfort.","zh":"这份报告关注的是长期致害性，而不是短期不适。"}]}],"synonyms":["harmfulness","toxicity","noxiousness","deleteriousness"],"phonetic":"/noʊˈkjuːəti/","extraExplanation":["“nocuity”在现代英语中非常少见，更常用的表达是“harmfulness / toxicity”。在写作中，如果面向一般读者，通常用“toxicity（毒性）”更自然。","词源来自拉丁语“nocuus”（有害的），与“innocuous（无害的）”是反义关系：in-（否定）+ nocuous（有害的）。因此记忆时可把“nocuity”理解为“有害”的抽象名词。"]}
{"word":"nocument","summary":{"en":"Nocument means harm or injury, especially in formal or old-fashioned English.","zh":"nocument 指“伤害、损害”，多用于正式或较古旧的英语表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Harm or injury; something that causes damage (often used in formal or old-fashioned writing).","zh":"伤害；损害；有害之物（多见于正式或较古旧的表达）。"},"examples":[{"en":"The new policy may bring nocument to small businesses.","zh":"这项新政策可能会给小企业带来损害。"},{"en":"He warned that careless words can be a nocument to trust.","zh":"他警告说，轻率的话语会损害彼此的信任。"}]}],"synonyms":["harm","damage","injury","detriment","hurt"],"phonetic":"/ˈnɑkjəmənt/","extraExplanation":["“nocument”是较少见的词，常被更常用的“harm / damage / injury”取代。在阅读较正式或古典风格文本时可能会遇到。","词源来自拉丁语“nocere”（意为“伤害”），也与“noxious”（有毒的/有害的）同源。"]}
{"word":"nocumentum","summary":{"en":"*Nocumentum* is a Latin term used in legal/historical contexts meaning “harm, injury, or damage.”","zh":"*Nocumentum* 是拉丁语术语，多用于法律/历史语境，意为“伤害、损害、损伤”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in legal or historical writing) harm, injury, or damage; something that causes harm.","zh":"（拉丁语；多用于法律或历史写作）伤害、损害、损伤；有害之物/致害因素。"},"examples":[{"en":"In Roman-law discussions, *nocumentum* can mean the harm a person suffers because of another’s act.","zh":"在罗马法讨论中，*nocumentum* 可指因他人行为而遭受的损害。"},{"en":"Some scholars translate *nocumentum* simply as “injury” or “damage,” depending on the context.","zh":"一些学者会根据语境把 *nocumentum* 译为“伤害”或“损害”。"}]}],"synonyms":["harm","injury","damage","detriment"],"phonetic":"/ˌnoʊkjuːˈmɛn.təm/","extraExplanation":["这是一个拉丁词，并非常见英语词汇；在英语里通常以斜体出现，常见于罗马法、古典学、法律史等学术语境。","与现代英语法律中常见的 harm / injury / damage 意义接近，但具体译法会随语境变化：强调“受伤/被侵害”时偏 injury，强调“财物或利益损失”时偏 damage。","词源上来自拉丁语 *nocēre*（伤害），与英语的 *noxious*（有害的）在词根意义上相关。"]}
{"word":"nocuous","summary":{"en":"Nocuous means harmful or injurious (rare in modern English).","zh":"nocuous 意为“有害的；会造成伤害的”（现代英语中较少用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"harmful; likely to cause damage or injury (a rare word in modern English).","zh":"有害的；会造成损害或伤害的（现代英语中较少用）。"},"examples":[{"en":"Breathing nocuous fumes can damage your lungs.","zh":"吸入有害的烟雾会损伤你的肺。"},{"en":"Some chemicals are nocuous to aquatic life even in small amounts.","zh":"有些化学物质即使含量很小也会对水生生物有害。"}]}],"synonyms":["harmful","injurious","damaging","noxious","toxic"],"phonetic":"/ˈnɑkjuəs/","extraExplanation":["“nocuous”较为少见，更常用的词是 harmful / toxic / injurious。","它常被拿来与“innocuous（无害的）”对比理解：nocuous = 有害的；innocuous = 无害的。两者都源自拉丁语词根 noc-（伤害）。"]}
{"word":"nocuously","summary":{"en":"Innocuously means ‘in a harmless, non-threatening, or casually polite way.’","zh":"innocuously 表示“以无害、不具威胁、或随口礼貌的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that seems harmless or not likely to cause trouble.","zh":"以看起来无害、不会引起麻烦的方式。"},"examples":[{"en":"He asked innocuously if I was free this weekend, but he was actually planning a surprise party.","zh":"他看似随口、无害地问我这周末有没有空，但其实是在策划惊喜派对。"},{"en":"The email began innocuously, then it suddenly asked for my password—so I knew it was a scam.","zh":"那封邮件一开始看起来很无害，后来却突然要我提供密码——我就知道是诈骗。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that does not offend, criticize, or show strong feelings; casually and politely.","zh":"以不冒犯、不批评、情绪不强烈的方式；随意而礼貌地。"},"examples":[{"en":"She innocuously mentioned the budget, trying not to start an argument.","zh":"她轻描淡写、尽量不引发争吵地提到预算问题。"},{"en":"He smiled innocuously and changed the subject.","zh":"他无害地笑了笑，然后转移了话题。"}]}],"synonyms":["harmlessly","benignly","inoffensively","mildly","casually"],"phonetic":"/ɪˈnɑkjuəsli/","extraExplanation":["你输入的“nocuously”不是标准拼写，常见的正确形式是 **innocuously**（来自 innocuous = “无害的” + -ly）。如果你原本想表达“明显地/引人注目地”，那可能是 **conspicuously**。"]}
{"word":"nocuousness","summary":{"en":"Nocuousness means harmfulness—the state or degree of being harmful or poisonous.","zh":"Nocuousness 指“有害性/毒性”，即某物具有危害或毒害作用的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being harmful, poisonous, or damaging; harmfulness","zh":"有害性；毒性；危害性（指有毒、危险或会造成损害的性质）"},"examples":[{"en":"Scientists tested the nocuousness of the chemical before allowing it into the water supply.","zh":"科学家在允许这种化学物质进入供水系统之前，先测试了它的有害性。"},{"en":"The report focuses on the nocuousness of secondhand smoke to children.","zh":"这份报告重点讨论二手烟对儿童的危害性。"}]}],"synonyms":["harmfulness","toxicity","noxiousness","dangerousness","deleteriousness"],"phonetic":"/nɑˈkjuːəsnəs/","extraExplanation":["“nocuousness”非常少见，更常用的表达是“harmfulness / toxicity / noxiousness”。在学术或法律语境中，人们通常也会说“the harmful effects”或“the toxicity of …”。","词源上与“noxious（有害的）”同源，来自拉丁语“noxa（伤害、损害）”。注意不要与“innocuous（无害的）”混淆；“in-”在这里是否定前缀，表示“无害”。"]}
