{"word":"nod","summary":{"en":"A nod is a small up-and-down head movement used to show agreement, understanding, or greeting; it can also mean a brief doze.","zh":"nod 指“点头”（表示同意、理解、问候等），也可指“打个盹儿/瞌睡一下”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To move your head down and up, usually to show agreement, understanding, greeting, or to signal someone.","zh":"点头（通常表示同意、理解、打招呼或示意某人）。"},"examples":[{"en":"She nodded to show she understood the instructions.","zh":"她点头表示自己明白这些指示。"},{"en":"He nodded at the waiter to ask for the check.","zh":"他朝服务员点头示意要结账单。"}]},{"partOfSpeech":"v.","definition":{"en":"To fall asleep briefly, especially while sitting; to doze.","zh":"（坐着时）打盹儿，瞌睡一下。"},"examples":[{"en":"I nodded off during the long bus ride.","zh":"我在漫长的公交车上打了个盹儿。"},{"en":"Grandpa was nodding in his chair after lunch.","zh":"爷爷午饭后在椅子上打瞌睡。"}]},{"partOfSpeech":"n.","definition":{"en":"A small movement of the head down and up that shows agreement, greeting, or a signal.","zh":"点头（一次头部上下的小动作，用来表示同意、问候或示意）。"},"examples":[{"en":"With a nod, she accepted the offer.","zh":"她点点头，接受了这个提议。"},{"en":"He gave me a quick nod and walked away.","zh":"他朝我快速点了下头就走开了。"}]}],"synonyms":["dip (your head)","agree","assent","doze","drowse"],"phonetic":"/nɑd/","extraExplanation":["在不同文化里，“点头/摇头”的含义可能不同：在很多英语语境里点头常表示“是/同意”，但在少数地区（如巴尔干部分地区）点头与摇头的含义可能相反。跨文化交流时，如果不确定，可以配合语言确认（例如说“Yes/No”或复述对方意思）。","口语里常说“nod off”（打瞌睡）和“nod along”（一边听一边点头表示在跟上/装作在跟上）。"]}
{"word":"nodal","summary":{"en":"Nodal means “related to a node,” and by extension can mean “central or crucial.” In medicine, it often refers to lymph nodes.","zh":"nodal 意为“与节点有关的”，引申可指“关键的、核心的”。在医学语境中常指“淋巴结的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a node (a point where lines, parts, or systems connect).","zh":"与“节点”有关的；节点的（指线条、部件或系统相连接的点）。"},"examples":[{"en":"The diagram highlights the nodal points where the wires meet.","zh":"这张图标出了电线汇合的节点位置。"},{"en":"Engineers checked the nodal connections in the network.","zh":"工程师检查了网络中的节点连接。"}]},{"partOfSpeech":"adj.","definition":{"en":"Central or crucial; serving as a key point of control or importance in a system.","zh":"关键的；核心的（指在系统中起控制或重要作用的点）。"},"examples":[{"en":"Trust is a nodal issue in any long-term relationship.","zh":"信任是任何长期关系中的核心问题。"},{"en":"The port became a nodal center for trade in the region.","zh":"该港口成为该地区贸易的关键枢纽。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to lymph nodes (used in medical contexts).","zh":"淋巴结的（医学用语）。"},"examples":[{"en":"The scan showed nodal involvement near the neck.","zh":"扫描显示颈部附近有淋巴结受累。"},{"en":"The doctor examined nodal swelling under the jaw.","zh":"医生检查了下颌下的淋巴结肿大。"}]}],"synonyms":["node-related","central","key","critical","pivotal"],"phonetic":"/ˈnoʊdəl/","extraExplanation":["“nodal”来自“node（节点）”。在不同学科里“node”的含义会变：在网络/计算机中是“网络节点”；在数学/物理中可指“交点、结点”；在解剖学中常指“淋巴结”。因此“nodal”在学术或技术写作里很常见，日常口语中相对少见。","在写作中，表示“关键/核心”时，常搭配：nodal point（关键点/枢纽点）、nodal center（枢纽中心）、nodal issue/problem（核心问题）。"]}
{"word":"nodalities","summary":{"en":"“Nodalities” means the (often measurable) “node-ness” or hub role of points in a network or system; it is the plural of “nodality.”","zh":"“nodalities”指多个点在网络/系统中作为“节点/枢纽”的性质或程度，是“nodality”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of nodality) the quality or state of being a node (a central connecting point) in a system such as a network, structure, or set of relationships.","zh":"（nodality 的复数）“节点性/节点地位”：在系统中作为“节点”（连接点、枢纽点）的性质或状态，常见于网络、结构或关系系统。"},"examples":[{"en":"Social media can increase the nodalities of certain users, making them key connectors in a community.","zh":"社交媒体会提升某些用户的节点地位，使他们成为社群中的关键连接者。"},{"en":"Transportation planners study the nodalities of stations to understand which stops function as hubs.","zh":"交通规划者会研究各车站的节点性，以了解哪些站点起到枢纽作用。"}]}],"synonyms":["centralities","hub roles","connectivity","node importance"],"phonetic":"/noʊˈdælɪtiz/","extraExplanation":["“nodality / nodalities”多见于学术或专业语境（如网络科学、城市规划、地理学、社会学、神经科学等）。日常英语里更常用更直白的说法是“centrality（中心性）”“hub-ness（枢纽性）”或直接说“how central/important a node is（一个节点有多关键）”。","形式上：nodality 是名词；nodalities 是其复数，用于谈论“多个节点的节点地位/枢纽程度”。如果你看到它出现在论文里，通常是在讨论“某些点为何比其他点更能连接、分流或影响整体结构”。"]}
{"word":"nodality","summary":{"en":"Nodality means the quality or degree of being a key node (an important connection point) in a system or network.","zh":"Nodality 指在系统或网络中作为关键“节点”（重要连接点）的性质或程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Specialized) the quality of being a node (a central point, intersection, or key connection) in a system such as a network, anatomy, or music theory; the degree to which something functions as a node.","zh":"（专业用语）“节点性”；在某个系统（如网络、解剖结构或音乐理论）中作为“节点”（中心点、交汇点或关键连接点）的特性或程度。"},"examples":[{"en":"In a transportation network, downtown often has high nodality because many routes pass through it.","zh":"在交通网络中，市中心常常具有很高的节点性，因为许多线路都会经过那里。"},{"en":"Researchers measured the nodality of each website to find which pages acted as hubs for information.","zh":"研究人员测量各个网站的节点性，以找出哪些页面充当信息枢纽。"}]}],"synonyms":["centrality","connectivity","hubness","node centrality"],"phonetic":"/noʊˈdælɪti/","extraExplanation":["“nodality”来自“node（节点）+ -ality（……的性质）”，多用于学术或技术写作，而日常英语里更常用“centrality（中心性）”“connectivity（连通性）”“hubness（枢纽性）”来表达类似概念。","在网络科学里，它常与“node centrality（节点中心性）”相关（如degree/betweenness centrality 等指标）；在音乐理论语境中，有时用来谈某个“音/调式中心”的“节点感”。具体含义通常要看所在学科。"]}
{"word":"nodally","summary":{"en":"“Nodally” means “in a nodal way,” usually in technical contexts—focused on nodes in a system (and sometimes on biological nodes like the heart’s pacemaker node).","zh":"“nodally”意为“以节点的方式/就节点而言”，多用于技术语境（有时也指生物学结区，如心脏起搏点）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a nodal way; with respect to nodes (key points) in a system such as a network, graph, wave, or structure.","zh":"以“节点”的方式；就节点而言（指网络、图论、波、结构等系统中的关键点）。"},"examples":[{"en":"The bridge was analyzed nodally to identify the points where stress concentrates.","zh":"工程师按节点来分析这座桥，以找出应力集中的位置。"},{"en":"In the simulation, temperature is computed nodally at each mesh node.","zh":"在模拟中，温度会在每个网格节点上按节点计算。"}]},{"partOfSpeech":"adv.","definition":{"en":"In relation to a biological node (especially the heart’s pacemaker node, such as the sinus node).","zh":"与生物学上的“结/节”相关（尤指心脏起搏点，如窦房结）。"},"examples":[{"en":"The medication acts nodally, slowing conduction through the pacemaker tissue.","zh":"该药物在结区起作用，减慢起搏组织的传导。"},{"en":"Some arrhythmias originate nodally rather than in the ventricles.","zh":"有些心律失常起源于结区，而不是心室。"}]}],"synonyms":["with respect to nodes","at the nodes","in terms of nodes"],"phonetic":"/ˈnoʊdəli/","extraExplanation":["“nodally”在日常英语里很少见，更多出现在专业写作（工程、计算、物理、医学）中，用来强调“按节点/在节点处/就节点而言”。","词根来自“node（节点/结）”→“nodal（节点的）”→“nodally（在节点方面地）”。"]}
{"word":"nodated","summary":{"en":"“Nodated” usually means “no-dated/undated”: not having a date written on it.","zh":"“nodated”通常指“no-dated/undated”：未标注日期的、没有写日期的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not marked with a date; having no date written on it (often written as “no-dated” or more commonly “undated”).","zh":"未标注日期的；没有写日期的（常写作“no-dated”，更常见为“undated”）。"},"examples":[{"en":"Please do not submit no-dated checks; write the date clearly.","zh":"请不要提交未写日期的支票；把日期写清楚。"},{"en":"The file contained several no-dated letters, so it was hard to put them in order.","zh":"档案里有几封没有日期的信，因此很难按时间排序。"}]}],"synonyms":["undated","without a date","date-less"],"phonetic":"/noʊ ˈdeɪtɪd/","extraExplanation":["“nodated”通常是把“no-dated”连写了；在正式英语里更常用的词是“undated”。","这种说法常见于行政/档案/财务语境，例如“no-dated check（未写日期的支票）”“no-dated document（无日期文件）”。写作时加连字符（no-dated）更清晰。"]}
{"word":"nodded","summary":{"en":"“Nodded” means you moved your head up and down to show agreement/understanding, or (in “nodded off”) you briefly fell asleep.","zh":"“nodded”表示点头（同意/理解/致意），也可指“nodded off”那样短暂打盹。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “nod”: moved your head down and up to show agreement, understanding, or greeting.","zh":"“nod”的过去式和过去分词：上下点头，表示同意、理解或打招呼。"},"examples":[{"en":"She nodded when I asked if she understood the instructions.","zh":"我问她是否理解说明时，她点了点头。"},{"en":"He nodded politely to the neighbors as he walked by.","zh":"他走过时礼貌地向邻居点头致意。"},{"en":"The teacher nodded, meaning my answer was correct.","zh":"老师点了点头，表示我的答案是正确的。"}]},{"partOfSpeech":"v.","definition":{"en":"(In stories) briefly fell asleep, usually while sitting; “nodded off.”","zh":"（常用于叙述）打了一会儿盹，尤其是坐着时；常说“nodded off”。"},"examples":[{"en":"I nodded off on the bus after a long day.","zh":"忙了一天后，我在公交车上打了个盹。"},{"en":"Grandpa nodded off during the movie.","zh":"爷爷看电影时打起了瞌睡。"}]}],"synonyms":["agreed (by nodding)","acknowledged","assented","nodded off (dozed)","dozed"],"phonetic":"/ˈnɑdɪd/","extraExplanation":["“nod”既可以表示“点头”（一种普遍的非语言沟通方式），也可以引申为“打盹”。英语里说“nod off”非常常见，强调从清醒到短暂入睡的那一下。","写作中，“nodded”常用来表现人物的态度或情绪：轻轻点头（softly nodded）显得温和；慢慢点头（nodded slowly）可能表示犹豫或认真考虑。"]}
{"word":"nodder","summary":{"en":"A nodder is someone (or something) that nods; informally it can mean someone who keeps nodding off from tiredness or sometimes drugs.","zh":"nodder 指点头的人（或会点头的东西）；非正式用法也可指因疲倦（有时因药物）而反复打盹、点头的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that nods (moves the head up and down), especially often or habitually","zh":"点头的人（或会点头的东西），尤指经常点头的"},"examples":[{"en":"In the meeting, he was a constant nodder, agreeing with almost everything.","zh":"在会议上他总是点头，几乎对所有事情都表示同意。"},{"en":"The little toy bird is a nodder when you press the button.","zh":"你按下按钮时，那只小玩具鸟就会点头。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, slang) a person who becomes drowsy and repeatedly nods off, sometimes because of drugs or exhaustion","zh":"（非正式/俚语）因极度疲倦或（有时）药物影响而昏昏欲睡、反复“点头打盹”的人"},"examples":[{"en":"After the overnight shift, I was such a nodder on the train.","zh":"上了一整夜的班后，我在火车上一直打瞌睡。"},{"en":"The report mentioned “nodders” near the station, referring to people nodding off in public.","zh":"报告提到车站附近的“nodders”，指的是在公共场所昏昏欲睡的人。"}]}],"synonyms":["head-nodder","someone who nods","dozer (for meaning 2)","someone who nods off (for meaning 2)"],"phonetic":"/ˈnɑdər/","extraExplanation":["“nodder”由动词“nod”（点头/打盹）+ 后缀“-er”（表示做某事的人或物）构成，意思是“点头的人/会点头的东西”。","第2义在一些地区的口语里可能带有对药物成瘾者的指涉，语气可能不礼貌或带偏见；正式场合建议用更中性的表达，如“drowsy person / someone who keeps nodding off”。"]}
{"word":"nodders","summary":{"en":"“Nodders” means people who nod their heads—often to show agreement, or (informally) people who nod off and briefly fall asleep.","zh":"“nodders”指点头的人（常表示赞同/理解），也可口语指打瞌睡、点头睡着的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who nod their heads, usually to show agreement, understanding, or greeting.","zh":"点头的人；（通常指）用点头表示同意、理解或打招呼的人。"},"examples":[{"en":"When the teacher asked if everyone understood, most of the nodders stayed quiet but nodded strongly.","zh":"老师问大家是否都听懂了，大多数点头的人没说话，但点得很用力。"},{"en":"The speaker looked for nodders in the crowd to see if the message was landing.","zh":"演讲者在观众中寻找点头的人，看看大家是否接受了他的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) People who nod off or fall asleep briefly, especially while sitting.","zh":"（非正式）打瞌睡的人；（尤其指坐着时）不小心点头睡着的人。"},"examples":[{"en":"On the late bus, there were a few nodders in the back seats.","zh":"在深夜的公交车上，后排有几个打瞌睡的人。"},{"en":"The meeting was so long that even energetic people turned into nodders.","zh":"会议太长了，连精力充沛的人都变成了打瞌睡的人。"}]}],"synonyms":["people who nod","agreers","yes-men","sleepyheads","dozers"],"phonetic":"/ˈnɑdərz/","extraExplanation":["“nodders”是“nodder”的复数形式（-er 表示“做……的人”，如 runner 跑步的人）。在日常英语里更常见的说法是 “people who nod” 或 “people nodding”，但在描述一群人反复点头（赞同或犯困）时，“nodders”会显得更形象、带一点口语感。"]}
{"word":"noddi","summary":{"en":"“Noddy” usually means (1) an informal word for a foolish person (mainly BrE), or (2) a kind of tropical seabird.","zh":"“noddy”（更常见拼写）通常指：（1）傻瓜/笨蛋（非正式，偏英式）；（2）一种热带海鸟（noddies）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silly or foolish person (informal, mainly British English)","zh":"傻瓜；笨蛋（非正式，主要英式英语）"},"examples":[{"en":"Don’t be a noddy—check the date before you book the tickets.","zh":"别当傻瓜——订票前先确认日期。"},{"en":"He felt like a complete noddy after forgetting his keys again.","zh":"他又忘带钥匙后，觉得自己真是个大笨蛋。"}]},{"partOfSpeech":"n.","definition":{"en":"a tropical seabird related to terns (a “noddy” bird)","zh":"热带海鸟（燕鸥科近缘的一类“黑燕鸥/褐燕鸥”等，统称 noddy）"},"examples":[{"en":"We saw noddies nesting on the rocky island.","zh":"我们看到褐燕鸥在岩石岛上筑巢。"},{"en":"A noddy flew low over the water looking for fish.","zh":"一只褐燕鸥贴着水面飞，寻找鱼群。"}]}],"synonyms":["fool","idiot (stronger, often offensive)","silly person","nitwit (informal)","tern (for the bird group)"],"phonetic":"/ˈnɑdi/","extraExplanation":["“noddi”本身不算常见拼写，更常见的是 **noddy**。如果你指的是儿童故事人物 **Noddy**（专有名词，如 Enid Blyton 的角色），也通常拼作 Noddy。","作为“傻瓜”的意思偏英式、口语，语气可能带点取笑或轻微贬义；在正式场合不太用。","鸟类意义里，noddies 因点头般的动作得名（与动词 nod“点头”有关）。"]}
{"word":"noddies","summary":{"en":"“Noddies” most often means short naps (informal, Aus/NZ). It can also mean noddy seabirds, or (old-fashioned) silly people.","zh":"“noddies”最常指（澳新口语）小睡/打盹儿；也可指“noddy”这类燕鸥海鸟，或（较旧式）傻瓜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, especially Australian/NZ) Short naps; brief sleeps.","zh":"（非正式，尤指澳新）小睡；打个盹儿。"},"examples":[{"en":"I had a quick noddy on the couch after lunch.","zh":"午饭后我在沙发上小睡了一会儿。"},{"en":"He kept having noddies during the long meeting.","zh":"他在漫长的会议中不停地打瞌睡。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “noddy”: a small seabird (a type of tern) found in tropical oceans.","zh":"“noddy”的复数：一种热带海洋里的小型海鸟（燕鸥的一种）。"},"examples":[{"en":"Noddies nest on remote islands in large colonies.","zh":"黑颈燕鸥常在偏远岛屿上成群筑巢。"},{"en":"We watched the noddies diving for fish near the reef.","zh":"我们看到黑颈燕鸥在礁石附近俯冲捕鱼。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “noddy”: a foolish or silly person (old-fashioned, informal).","zh":"“noddy”的复数：傻瓜；笨蛋（较旧式用法，非正式）。"},"examples":[{"en":"Don’t be a noddy—read the instructions first.","zh":"别犯傻——先把说明读一遍。"},{"en":"They thought he was a noddy for trusting that scam.","zh":"他们觉得他轻信那种骗局很傻。"}]}],"synonyms":["naps","dozes","catnaps","terns","fools"],"phonetic":"ˈnɑdi","extraExplanation":["“have a noddy / have noddies”在澳大利亚和新西兰比较常见，意思是“打个盹儿”。在其他英语地区更常说“take a nap / have a nap”。","“Noddy”也是英国作家Enid Blyton创作的儿童故事角色名；如果你看到“The Noddies”，有时指与该角色相关的书/动画或粉丝群体，需看上下文。","鸟类义里常见具体种名如“black noddy（黑颈燕鸥）”“brown noddy（褐燕鸥）”。"]}
{"word":"nodding","summary":{"en":"“Nodding” means moving the head up and down, often to show agreement or signal someone; it can also describe being sleepy and beginning to doze.","zh":"“nodding”指点头（常表示同意或示意），也可指困得点头、开始打瞌睡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of moving your head up and down, usually to show agreement, understanding, greeting, or to signal someone.","zh":"点头（把头上下轻轻移动），通常表示同意、理解、打招呼或示意别人。"},"examples":[{"en":"He gave a quick nodding of his head to show he understood.","zh":"他快速点了点头，表示他明白了。"},{"en":"With a nodding gesture, she agreed to the plan.","zh":"她用点头的动作表示同意这个计划。"}]},{"partOfSpeech":"v.","definition":{"en":"Moving your head up and down to show agreement, understanding, greeting, or to signal someone.","zh":"点头（用头上下移动来表示同意、理解、问候或示意）。"},"examples":[{"en":"She was nodding while the teacher explained the rules.","zh":"老师讲规则时，她一直在点头。"},{"en":"He nodded to the waiter and ordered coffee.","zh":"他朝服务员点了点头，然后点了咖啡。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having your head dropping forward slightly because you are sleepy or not fully awake.","zh":"（因困倦）打盹式地点头、点头犯困（头不自觉往前垂）。"},"examples":[{"en":"He was nodding in the meeting after a long night.","zh":"熬了一夜后，他在会议上不停地点头犯困。"},{"en":"The baby lay in the stroller, nodding off.","zh":"宝宝躺在婴儿车里，慢慢打起了瞌睡。"}]}],"synonyms":["nodding (agreement)","head-nodding","assenting","dozing","nodding off"],"phonetic":"/ˈnɑːdɪŋ/","extraExplanation":["“nodding”常见于两种语境：①“表示同意/示意”的点头（社会互动）；②“nodding off”表示“打瞌睡、困得直点头”。注意：英语里“nod”通常不等于“摇头”，摇头是否定是“shake one’s head”。"]}
{"word":"noddingly","summary":{"en":"“Noddingly” means “with a nod,” often showing agreement or acknowledgment.","zh":"“noddingly”意为“点头地”，常用来表示同意或回应。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves nodding your head, often to show agreement, approval, understanding, or acknowledgment.","zh":"以点头的方式（常表示同意、赞许、理解或回应）。"},"examples":[{"en":"She listened noddingly as he explained the plan.","zh":"他解释计划时，她一边听一边点头表示理解。"},{"en":"He smiled and answered noddingly, “Yes, that sounds good.”","zh":"他笑着点头回应：“嗯，听起来不错。”"},{"en":"The teacher looked around noddingly when the class got the right answer.","zh":"全班答对后，老师环顾四周并点头表示肯定。"}]}],"synonyms":["with a nod","approvingly","in agreement","affirmatively"],"phonetic":"/ˈnɑdɪŋli/","extraExplanation":["“noddingly”在现代英语里不算常用，更多出现在叙述性写作中（例如小说里描写人物动作）。日常口语更常说“with a nod / nodding”或用动词短语表达：例如“She nodded.”、“He nodded in agreement.”","写作中常见搭配：\"said noddingly\"（带着点头的动作说）、\"listened noddingly\"（听着并点头）。不过有时用“nodding”更自然：\"She listened, nodding.\""]}
{"word":"noddle","summary":{"en":"“Noddle” is an informal word for “head/brain,” and it can also mean “to think hard.”","zh":"“noddle”是“脑袋/脑子”的非正式说法，也可作动词表示“认真思考、琢磨”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person’s head; the brain.","zh":"（非正式）头；脑袋。"},"examples":[{"en":"I bumped my noddle on the low doorway.","zh":"我在低矮的门口把脑袋撞了一下。"},{"en":"Use your noddle and think before you speak.","zh":"动动脑子，想清楚再说。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To think hard or try to solve something.","zh":"（非正式）认真思考；琢磨；想办法解决。"},"examples":[{"en":"I’m still noddling over how to explain it simply.","zh":"我还在琢磨怎么把它解释得简单一点。"},{"en":"Let me noddle on that problem for a minute.","zh":"让我先想想那个问题。"}]}],"synonyms":["head","brain","noggin","think","ponder","figure out"],"phonetic":"/ˈnɑdəl/","extraExplanation":["“noddle”主要是英式英语里的俚语，用来轻松地指“脑袋/脑子”。在正式写作里不常用，更适合口语、幽默或亲密的语境。","注意别和“noodle（面条）”混淆：拼写很像，但意思完全不同。","动词“noddle”表示“琢磨、动脑”，语气随意；更中性常见的说法是“think about / ponder / figure out”。"]}
{"word":"noddlebone","summary":{"en":"Noddlebone means “head/skull,” used humorously in informal or old-fashioned speech.","zh":"noddlebone 指“脑袋/头骨”，带幽默的非正式、较旧式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person’s head or skull (humorous, old-fashioned, informal).","zh":"人的头、脑袋、头骨（幽默、较旧式、非正式用法）。"},"examples":[{"en":"He scratched his noddlebone, trying to remember her name.","zh":"他挠了挠脑袋，努力想起她的名字。"},{"en":"Put a hat on that noddlebone—it's freezing outside.","zh":"给那脑袋戴顶帽子——外面冷得要命。"}]}],"synonyms":["head","skull","noggin","noddle"],"phonetic":"/ˈnɑdəlˌboʊn/","extraExplanation":["“noddle”本身就有“脑袋（俚语）”的意思；“noddlebone”是在此基础上加上“bone（骨头）”，让说法更夸张、更滑稽。","这个词非常少见，多见于较早的口语、方言或带喜剧色彩的文字里；现代英语里更常用的是“head / skull / noggin”。"]}
{"word":"noddled","summary":{"en":"“Noddled” usually appears in informal compounds meaning “-headed” (having a certain kind of head). It can also be the rare past form of “noddle,” meaning to bump/strike the head.","zh":"“noddled”多见于非正式复合词中，表示“某种脑袋的/某种头脑的”（相当于“-headed”）。也可作少见的动词过去式，表示“撞到/敲到头”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, often in compounds) Having a particular kind of head; “-noddled” = “-headed.”","zh":"（非正式，常用于复合词）有某种“脑袋/头脑”的；“-noddled”相当于“-headed”。"},"examples":[{"en":"He’s a thick-noddled guy, but he means well.","zh":"他有点“脑袋不灵光”，但人挺善良。"},{"en":"Don’t be empty-noddled—check the instructions first.","zh":"别犯糊涂——先把说明书看清楚。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of noddle (rare): to bump or strike on the head; sometimes used humorously.","zh":"noddle 的过去式/过去分词（较少见）：撞到或敲到头；有时带幽默语气。"},"examples":[{"en":"I noddled my head on the low doorway and saw stars.","zh":"我在矮门框上撞了头，眼冒金星。"}]}],"synonyms":["headed (in compounds)","thickheaded","empty-headed"],"phonetic":"/ˈnɑd(ə)ld/","extraExplanation":["“noddle”在英式英语里常作俚语，表示“头、脑袋”（类似于 head, noggin）。因此“-noddled”多见于带调侃色彩的复合形容词（如 thick-noddled），语气通常不正式。"]}
{"word":"noddles","summary":{"en":"Noodles are long, thin pieces of dough eaten as food; informally, it can also mean a foam pool “noodle.”","zh":"Noodles 指面条/粉条等细长面食；口语中也可指泳池里的泡沫浮条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Long, thin strips of dough (often made from wheat, rice, etc.) that are cooked and eaten as food, usually in soup or with sauce.","zh":"（常用小麦粉、米等做成的）面条/粉条；细长的面食，通常煮熟后配汤或酱汁食用。"},"examples":[{"en":"I made noodles for dinner with vegetables and chicken.","zh":"我晚饭做了面条，配了蔬菜和鸡肉。"},{"en":"She ordered a bowl of beef noodles.","zh":"她点了一碗牛肉面。"},{"en":"Instant noodles are quick, but not very healthy if you eat them every day.","zh":"方便面很快，但如果每天吃就不太健康。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A swimming pool noodle: a long, soft foam tube used for floating or playing in the water.","zh":"（非正式）泳池泡沫浮条（“水上面条”）：一种长条软泡沫，用于戏水或辅助漂浮。"},"examples":[{"en":"The kids played with pool noodles in the shallow end.","zh":"孩子们在浅水区拿着泡沫浮条玩。"},{"en":"Use a noodle to help you float while you practice kicking.","zh":"练习打腿时可以用泡沫浮条帮助漂浮。"}]}],"synonyms":["pasta (sometimes, depending on style)","ramen","udon","rice noodles","egg noodles"],"phonetic":"/ˈnuːdəlz/","extraExplanation":["你输入的 **noddles** 通常是拼写错误，更常见的正确拼写是 **noodles**。英语里 *noodle* 的复数是 *noodles*。"]}
{"word":"noddling","summary":{"en":"“Noddling” is a rare word meaning drowsily nodding, and (old-fashioned) a bit silly or not very sharp.","zh":"“noddling”较少见，可指困倦地一下一下点头；也有旧式用法表示有点傻气、不太聪明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Drowsily nodding on and off; bobbing the head repeatedly.","zh":"（罕见）昏昏欲睡地点头、打瞌睡；头一下一下地晃动。"},"examples":[{"en":"After lunch, he sat by the window, noddling in the warm sun.","zh":"午饭后，他坐在窗边，在暖阳里打着瞌睡、点着头。"},{"en":"The baby was noddling in her car seat.","zh":"宝宝在安全座椅里一下一下地点头，快睡着了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, old-fashioned) Slightly silly or weak-minded; not very sharp.","zh":"（非正式，旧式）有点傻气的；不太聪明的。"},"examples":[{"en":"He gave a noddling smile and forgot what he was saying.","zh":"他傻傻一笑，就忘了自己要说什么。"},{"en":"It’s a noddling idea, but it might work with some changes.","zh":"这是个有点傻的主意，不过改一改也许能行。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “noddle”: to nod repeatedly or in a sleepy way.","zh":"“noddle”的现在分词：反复点头；困倦地点头。"},"examples":[{"en":"He kept noddling during the long meeting.","zh":"开会时间很长，他一直困得直点头。"}]}],"synonyms":["nodding","dozing","drowsy","sleepy","silly","foolish"],"phonetic":"/ˈnɑdəlɪŋ/","extraExplanation":["“noddling”并不常见，更常见的是用“nodding”（点头/打瞌睡）。它和口语词“noddle”（脑袋、头）同源，所以在一些旧式用法里也能引申出“有点傻气、不太灵光”的意思。"]}
{"word":"noddy","summary":{"en":"“Noddy” most commonly means (BrE) a silly person; it’s also the name of a classic British children’s character, and it can refer to a tropical seabird.","zh":"“noddy”最常见的意思是（英式）傻瓜；也可指英国经典儿童角色 Noddy，另外还可指一种热带海鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly British) A foolish or silly person; a simpleton (usually a mild insult).","zh":"（非正式，主要英式）傻瓜；笨蛋（通常语气较轻的贬称）。"},"examples":[{"en":"Don’t be a noddy—read the instructions first.","zh":"别当傻瓜——先把说明书读一遍。"},{"en":"I felt like a total noddy for forgetting my own phone number.","zh":"我把自己的电话号码都忘了，感觉自己真是个大笨蛋。"}]},{"partOfSpeech":"n.","definition":{"en":"Noddy: a famous children’s story character (a cheerful little person who rides in a toy car) from British books and TV.","zh":"Noddy：英国儿童读物与电视里很有名的角色（常被描绘成开着玩具小车、性格开朗的小人）。"},"examples":[{"en":"My aunt grew up reading Noddy books.","zh":"我阿姨小时候就是看《Noddy》长大的。"},{"en":"Noddy was popular in the UK for generations.","zh":"Noddy 在英国火了好几代人。"}]},{"partOfSpeech":"n.","definition":{"en":"A noddy (also called a noddy tern): a type of seabird found in tropical oceans.","zh":"（鸟类）褐燕鸥等“noddy”类海鸟，常见于热带海域。"},"examples":[{"en":"We saw noddies nesting on the island cliffs.","zh":"我们看到褐燕鸥在海岛悬崖上筑巢。"}]}],"synonyms":["fool","silly person","idiot (stronger)","simpleton"],"phonetic":"/ˈnɑdi/","extraExplanation":["“noddy”作“傻瓜”多见于英式英语，语气通常比更粗的辱骂词轻一些，但对陌生人使用仍可能显得不礼貌。","作为儿童文化符号的 Noddy 出自英国作家 Enid Blyton（伊妮德·布莱顿）的作品，曾在英国与部分英联邦地区非常流行；在不同国家/年代的认知度差异较大。","鸟类含义在日常口语里不如前两种常见，更多出现在自然纪录片、观鸟或科普语境中。"]}
{"word":"node","summary":{"en":"A node is a connecting point—commonly a point in a diagram, a device/point in a computer network, a joint on a plant stem, or a lymph node in the body.","zh":"node 指“连接点/节点”，常见义包括：图中的节点、计算机网络节点、植物茎的节，以及人体的淋巴结。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A point (dot) where lines meet or connect; in diagrams it often shows a connection or intersection.","zh":"（图中）节点；线条相交或连接的点，常用来表示连接或交汇处。"},"examples":[{"en":"In the diagram, each node connects to two other nodes.","zh":"在这张图里，每个节点连接另外两个节点。"},{"en":"Add a node where the two branches meet.","zh":"在两条分支汇合的地方加一个节点。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing, a device or computer on a network, or a point in a system where data is sent, received, or processed.","zh":"（计算机）网络节点；网络中的设备/计算机，或系统中发送、接收、处理数据的点。"},"examples":[{"en":"Each node on the network has its own IP address.","zh":"网络上的每个节点都有自己的 IP 地址。"},{"en":"If one node fails, the system reroutes traffic to other nodes.","zh":"如果一个节点故障，系统会把流量改道到其他节点。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology, a small swelling or joint on a plant stem where leaves, branches, or buds grow.","zh":"（生物/植物）节；茎上长出叶、枝或芽的部位。"},"examples":[{"en":"New leaves often grow from nodes along the stem.","zh":"新叶子常常从茎上的节长出来。"}]},{"partOfSpeech":"n.","definition":{"en":"A swollen gland or lump in the body (often referring to a lymph node).","zh":"（身体）结/腺体肿块（常指淋巴结）。"},"examples":[{"en":"The doctor checked the lymph nodes in her neck.","zh":"医生检查了她颈部的淋巴结。"}]}],"synonyms":["point","junction","vertex","intersection","hub"],"phonetic":"/noʊd/","extraExplanation":["在英语里，node 的核心概念是“连接点/枢纽点”。因此它在数学/图论（点与边）、计算机网络（设备或数据处理点）、植物学（茎上的“节”）和医学（淋巴结）等领域都能通用。理解为“系统里负责连接或分岔的位置”会更好记。","你可能也会看到 Node.js（读作“node jay ess”）：这是一个常用的 JavaScript 运行环境。这里的 Node 强调“网络中的一个节点/服务器端的一个运行点”的感觉。"]}
{"word":"noded","summary":{"en":"“Noded” usually means “having nodes/joints,” especially in plant descriptions; it can also be the past form of a rare verb “to node.”","zh":"“noded”通常指“有节/有结节的”（尤用于植物描述）；也可作罕见动词 node 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having nodes (small joints, knobs, or swelling points), especially on a plant stem.","zh":"有“节”（关节、结节或膨大点）的；（尤指植物茎）有节的。"},"examples":[{"en":"Bamboo is a noded plant, with clear joints along the stem.","zh":"竹子是有节的植物，茎上有明显的节。"},{"en":"The noded branch made it easy to see where new growth would appear.","zh":"这根有节的树枝很容易看出新芽会从哪里长出来。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of the rare verb “to node,” meaning to form or mark with nodes.","zh":"罕见动词 node 的过去式/过去分词：形成结节，或使出现“节/结点”。"},"examples":[{"en":"Over time, the stem noded in several places as it matured.","zh":"随着成熟，茎的好几处逐渐形成了节。"}]}],"synonyms":["jointed","knobby","nodal"],"phonetic":"/ˈnoʊdɪd/","extraExplanation":["“noded”更常见于植物学、园艺或形态描述中（如 noded stems）。日常英语里更常用的是名词 node（结点/节点），例如在计算机网络、数学图论中表示“节点”。"]}
{"word":"nodes","summary":{"en":"“Nodes” means multiple connection points—especially devices/points in a network or system; it can also refer to body/plant nodes in biology.","zh":"“nodes”指多个“节点/结点”，常见于网络或系统中的连接点/设备；在生物中也可指淋巴结或植物的节位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “node”: a point where lines, paths, or parts connect; often used for important connection points in systems or structures.","zh":"“node”的复数：指线、路径或部件连接的点；常用于表示系统或结构中的关键连接点。"},"examples":[{"en":"The map shows several nodes where the main roads meet.","zh":"地图上标出了几处主干道交汇的节点。"},{"en":"We added more nodes to make the network faster and more reliable.","zh":"我们增加了更多节点，让网络更快、更可靠。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing/Networks) separate computers or devices in a network that send, receive, or process data.","zh":"（计算机/网络）网络中的独立计算机或设备，用于发送、接收或处理数据。"},"examples":[{"en":"Each node stores a copy of the database for safety.","zh":"每个节点都存一份数据库副本以确保安全。"},{"en":"If one node fails, the other nodes can keep the system running.","zh":"如果一个节点故障，其他节点仍能维持系统运行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) small lumps in the body, or points in plants where leaves or branches grow from the stem.","zh":"（生物）身体里的小结节/肿块；或植物茎上长出叶子或分枝的节位。"},"examples":[{"en":"The doctor checked the lymph nodes in his neck.","zh":"医生检查了他颈部的淋巴结。"},{"en":"Count the nodes on the stem to estimate how tall the plant may grow.","zh":"数一数茎上的节位，可以估计植物可能长多高。"}]}],"synonyms":["connection points","junctions","vertices","network devices","stations"],"phonetic":"/noʊdz/","extraExplanation":["“nodes”是可数名词“node”的复数。单数：a node；复数：nodes。","在计算机语境里，node 常指“一个独立的机器/设备/服务器”；在数学的图论里，node 常与 vertex（顶点）近义，表示“图中的点”。"]}
{"word":"nodescript","summary":{"en":"A NodeScript is a small program meant to be executed with Node.js.","zh":"NodeScript 指用 Node.js 运行的小程序/脚本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A script (small program) written to run in Node.js (the JavaScript runtime environment), often used for automation, servers, or command-line tools.","zh":"在 Node.js（JavaScript 运行环境）中运行的脚本（小程序），常用于自动化、服务器或命令行工具。"},"examples":[{"en":"I wrote a NodeScript to rename hundreds of files automatically.","zh":"我写了一个 NodeScript 来自动批量重命名几百个文件。"},{"en":"This project includes a NodeScript that starts the local server.","zh":"这个项目包含一个用于启动本地服务器的 NodeScript。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, informal) A specific script file in a project (for example, a build or deployment script) executed with the command line tool node.","zh":"（较少见，非正式）项目里用 node 命令执行的某个脚本文件（例如构建或部署脚本）。"},"examples":[{"en":"Run the NodeScript with: node tools/build.js.","zh":"用这个命令运行该 NodeScript：node tools/build.js。"}]}],"synonyms":["Node.js script","Node script","JavaScript script (in Node.js)","CLI script (Node.js)"],"phonetic":"/ˈnoʊdˌskrɪpt/","extraExplanation":["“NodeScript”不是一个非常固定的标准术语，更常见的说法是 “Node.js script” 或直接说 “a Node script”。在不同团队里，它可能指任何用 Node.js 运行的脚本文件（通常是 .js 或 .mjs）。","在技术文档里，建议写成 “Node.js script” 更清晰；口语或聊天中说 “node script” 很常见。"]}
{"word":"nodi","summary":{"en":"*Nodi* is a Latin plural meaning “nodes/knots,” mostly seen in technical or older medical/anatomical writing.","zh":"“nodi”是拉丁语复数，意为“多个结节/节点”，多见于技术性或较旧的医学/解剖学文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural form of *nodus* (“node”); used mainly in medical, anatomical, or botanical writing to mean small knots or node-like swellings/points.","zh":"*nodus*（“结节/节点”）的复数形式；主要用于医学、解剖学或植物学文献中，指多个结节、结点或类似节点的隆起/部位。"},"examples":[{"en":"The report described several nodi along the tendon.","zh":"报告描述了肌腱上有多个结节（nodi）。"},{"en":"In older texts, you may see *nodi* where modern English would simply say “nodes.”","zh":"在较旧的文献里，你可能会看到 *nodi*，而现代英语通常直接写“nodes（结节/节点）”。"}]}],"synonyms":["nodes","nodules"],"phonetic":"/ˈnoʊdaɪ/","extraExplanation":["“nodi”在日常英语里几乎不用；更常见的是“nodes”。如果你是想查“node”（网络节点/结点/结节），告诉我具体语境（医学、计算机、数学或植物学），我可以给你更贴近语境的释义与例句。","在英文医学里也常见复数直接用“nodules”或“nodes”（如 lymph nodes 淋巴结），不一定用拉丁复数“nodi”。"]}
{"word":"nodiak","summary":{"en":"“Nodiak” isn’t a standard English word; it’s likely a misspelling (often of “zodiac” or “Kodiak”) or a proper name.","zh":"“nodiak”不是标准英语词；多半是拼写误写（常见为“zodiac”或“Kodiak”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a name/brand. In many contexts, people mean “zodiac” (the 12-sign astrology system) or “Kodiak” (e.g., Kodiak Island/bear).","zh":"不是标准英语单词；通常是拼写错误，或用作人名/品牌名。在很多语境里可能想写的是“zodiac（黄道十二宫/星座）”或“Kodiak（科迪亚克，如科迪亚克岛/棕熊）”。"},"examples":[{"en":"I couldn’t find “nodiak” in the dictionary—did you mean “zodiac”?","zh":"我在词典里找不到“nodiak”——你是不是想写“zodiac（星座/黄道十二宫）”？"},{"en":"If you meant “Kodiak,” it’s often used for Kodiak Island or the Kodiak bear.","zh":"如果你想写“Kodiak”，它常指科迪亚克岛或科迪亚克棕熊。"}]}],"phonetic":"/ˈnoʊdiˌæk/","extraExplanation":["“nodiak”在常见英语词典中通常没有收录，因此更像是拼写误差。你可以告诉我它出现的句子/截图或你想表达的意思，我可以帮你确认最可能的目标词（例如 zodiac / Kodiak 或某个专有名词）。"]}
{"word":"nodical","summary":{"en":"Nodical means “related to a node,” and is a rare variant of the more common word nodal.","zh":"nodical 意为“与节点有关的”，是更常见的 nodal 的罕见变体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a node (a point where lines/paths meet, or a connection point in a system).","zh":"与“节点”有关的（节点指线条/路径的交汇点，或系统中的连接点）。"},"examples":[{"en":"The engineer inspected the nodical connections in the network diagram.","zh":"工程师检查了网络图中的节点连接。"},{"en":"Pain at a nodical point can indicate a swollen lymph node.","zh":"某个“节点”位置的疼痛可能提示淋巴结肿大。"}]},{"partOfSpeech":"adj.","definition":{"en":"In astronomy, relating to the nodes of an orbit (the points where an orbit crosses a reference plane).","zh":"【天文学】与轨道的交点（升交点/降交点）有关的；指轨道与参考平面的交叉点。"},"examples":[{"en":"The satellite’s nodical position changes over time due to gravitational effects.","zh":"由于引力影响，卫星的交点位置会随时间变化。"}]}],"synonyms":["nodal","node-related"],"phonetic":"/ˈnoʊdɪkəl/","extraExplanation":["“nodical”在现代英语中非常少见，多数情况下人们会用更常见的“nodal”（节点的）来表达同样的意思。若你是在数学、网络、医学或天文学语境中看到“nodical”，通常可以把它理解为“nodal”的变体或较旧/不常用的写法。"]}
{"word":"nodicorn","summary":{"en":"“Nodicorn” is not a standard English word; it’s likely a typo (often for “unicorn”) or a made-up nickname used online.","zh":"“nodicorn”不是规范英语词；多半是拼写错误（常见为“unicorn”）或网络中使用的自造昵称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or likely misspelled word; it is not an established English vocabulary item in major dictionaries. It may be intended as a playful made-up word or a typo for “unicorn.”","zh":"非标准或可能拼写错误的词；在主流英语词典中不是规范词汇。可能是玩笑式的自造词，或想写的是“unicorn（独角兽）”。"},"examples":[{"en":"I can’t find “nodicorn” in a dictionary—did you mean “unicorn”?","zh":"我在词典里找不到“nodicorn”——你是不是想写“unicorn（独角兽）”？"},{"en":"Some online communities invent words like “nodicorn” as a nickname for a character or sticker.","zh":"一些网络社群会创造像“nodicorn”这样的词，当作角色或贴图的昵称。"}]}],"synonyms":["unicorn (if intended)"],"phonetic":"/ˈnoʊdɪkɔrn/","extraExplanation":["“nodicorn”更像是把两个词拼在一起的网名/昵称（例如 nod + unicorn），或是“unicorn”的误拼。若你能提供一句原文或使用场景（聊天、游戏ID、文章句子等），我可以更准确判断它具体指什么。"]}
{"word":"nodiferous","summary":{"en":"Nodiferous means “having or producing nodules (small lumps),” mainly used in scientific contexts.","zh":"nodiferous 指“生有/产生结节（小肿块、结节）”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bearing or producing nodules (small rounded lumps), especially in plants or animals.","zh":"（尤指植物或动物）生有结节的；会产生小结节的。"},"examples":[{"en":"Some legumes are nodiferous because their roots form nodules that help them use nitrogen.","zh":"一些豆科植物是结节生长的，因为它们的根会形成根瘤，帮助利用氮。"},{"en":"The pathologist described the tissue as nodiferous, with many small lumps under the surface.","zh":"病理学家描述该组织为“结节状”，表面下有许多小肿块。"}]}],"synonyms":["nodular","tuberous","lumpy"],"phonetic":"/noʊˈdɪfərəs/","extraExplanation":["这个词较少见，常见于植物学/医学写作。词源可拆为 Latin “nodus”（结、结节）+ “-ferous”（“带有/产生……的”），类似的构词还有：coniferous（结球果的）、iferous（带有……的）。日常英语中更常用 nodular（结节状的）或 having nodules（有结节）。"]}
{"word":"nodiflorous","summary":{"en":"Nodiflorous describes a plant that has flowers growing at the nodes of its stem.","zh":"nodiflorous 用来形容植物“节生花”，即花长在茎的节上。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Bearing flowers at the nodes (the points on a stem where leaves or branches grow).","zh":"（植物学）节生花的；花长在茎的节上（即叶或枝生长的连接点）。"},"examples":[{"en":"This species is nodiflorous, so the flowers appear where each leaf joins the stem.","zh":"这个物种是节生花的，所以花会出现在每片叶子与茎相连的地方。"},{"en":"In the field guide, the plant is described as nodiflorous with small white blooms along the stem.","zh":"在野外图鉴里，这种植物被描述为节生花的，茎上各节处有小小的白花。"}]}],"synonyms":["node-flowering","flowering at the nodes"],"phonetic":"/ˌnoʊdɪˈflɔrəs/","extraExplanation":["这是一个较少见的植物学形容词，由 nodi-（node，节）+ florous（bearing flowers，生花的）构成。常用于植物形态描述、分类检索或图鉴文字中。","node（节）指茎上叶、芽或分枝长出的“连接点”。“节生花”这一特征有助于区分与“顶生花”（花长在枝条顶端）或“腋生花”（花长在叶腋处）等不同着花位置。"]}
{"word":"nodiform","summary":{"en":"“Nodiform” means shaped like a small rounded lump (a nodule), often used in medical or scientific descriptions.","zh":"“nodiform”指“结节状的、呈小肿块形的”，多用于医学或科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a nodule (a small rounded lump); knobby or lumpy.","zh":"结节状的；呈小肿块（结节）形的；隆起成团的。"},"examples":[{"en":"The doctor noted a nodiform mass under the skin.","zh":"医生注意到皮下有一个结节状肿块。"},{"en":"Some plants develop nodiform swellings on their roots.","zh":"一些植物的根部会形成结节状的膨大。"}]}],"synonyms":["nodular","lumpy","knobby","nodule-shaped"],"phonetic":"/ˈnoʊdɪfɔrm/","extraExplanation":["“nodiform”常见于医学与生物学写作（如病理报告、皮肤科描述、植物学）。它来自拉丁语词根：nodus（结、结节）+ -form（形状），字面意思是“结节形的”。日常英语里更常用的近义表达是“lumpy / knobby / nodular”。"]}
{"word":"nodosaria","summary":{"en":"Nodosaria is a genus of bead-like, segmented marine foraminifera, often found as fossils used in geological studies.","zh":"Nodosaria（节结虫属）是一类外壳呈串珠状分节的海洋有孔虫属，常见于化石并用于地质研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of marine foraminifera (single-celled organisms with shells), known for a long, bead-like, segmented shell; often found as fossils and used in geology/paleontology.","zh":"一种海洋有孔虫属（单细胞生物，具有外壳），其外壳常呈细长、串珠状分节；常见于化石记录中，常用于地质与古生物研究。"},"examples":[{"en":"The sediment sample contained several Nodosaria fossils.","zh":"这份沉积物样本中含有几枚节结虫属（Nodosaria）的化石。"},{"en":"In micropaleontology, Nodosaria can help date and interpret ancient marine environments.","zh":"在微体古生物学中，节结虫属（Nodosaria）可帮助测年并解读古海洋环境。"}]}],"synonyms":["foraminifer","foraminifera","microfossil"],"phonetic":"/ˌnoʊ.doʊˈsɛr.i.ə/","extraExplanation":["“Nodosaria”常见于地质、海洋生物与微体古生物学文献中，属于有孔虫（foraminifera）。有孔虫的壳体形态对环境变化敏感，因此它们的化石常被用作地层对比与古环境重建的证据。","词源提示：名称与拉丁语“nodus（结、节）”有关，呼应其壳体常见的“分节/串珠状”外形。"]}
{"word":"nodosarian","summary":{"en":"Nodosaurian means “related to nodosaurs,” or it can mean a nodosaur itself.","zh":"nodosaurian 指“与结节龙有关的”，也可作名词指“结节龙（类）本身”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(paleontology) Relating to nodosaurs—armored, plant-eating dinosaurs in the ankylosaur group.","zh":"（古生物）与结节龙（nodosaur）有关的；指一种装甲、食草、属于甲龙类近亲的恐龙。"},"examples":[{"en":"Scientists found nodosaurian armor plates in the rocks.","zh":"科学家在岩石中发现了结节龙类的装甲骨板。"},{"en":"Nodosaurian fossils often show heavy body armor.","zh":"结节龙类化石常常显示出厚重的身体装甲。"}]},{"partOfSpeech":"n.","definition":{"en":"A nodosaur or a member of the nodosaur group.","zh":"结节龙；结节龙类的一员。"},"examples":[{"en":"This nodosaurian was likely a slow-moving herbivore.","zh":"这只结节龙类动物可能是行动缓慢的食草动物。"}]}],"synonyms":["nodosaurian","nodosaur","ankylosaurian (broader group)"],"phonetic":"ˌnoʊdəˈsɔriən","extraExplanation":["“nodosarian”更常见的拼写是 **nodosaurian**（来自 *nodosaur* + -ian）。在科普与学术文章中，它通常指结节龙科（Nodosauridae）及其相关动物。","结节龙类与甲龙（ankylosaurs）同属装甲恐龙，但结节龙通常**没有**像典型甲龙那样明显的“尾锤”。"]}
{"word":"nodosariform","summary":{"en":"A rare medical adjective meaning “nodular in form,” often describing a mass or lesion made up of multiple nodules.","zh":"一个较少见的医学形容词，表示“呈结节状外观”，常用于描述由多个结节组成的肿块或病灶形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having the form of multiple nodules; forming a nodular, mass-like pattern (often used to describe lesions or growths that look “sarcoma-like” in shape).","zh":"（医学）呈多结节状的；形成结节样团块外观的（常用于描述病灶或增生在形态上呈“肉瘤样/肿块样”的结节外观）。"},"examples":[{"en":"The biopsy described a nodosariform lesion with several firm nodules.","zh":"活检报告描述该病灶为结节样团块外观，可见多个坚实结节。"},{"en":"On exam, the rash was nodosariform rather than flat or patchy.","zh":"查体时，该皮疹呈结节样团块外观，而不是扁平或片状。"}]}],"synonyms":["nodular","multinodular","nodose"],"phonetic":"/ˌnoʊdoʊˈsærɪfɔrm/","extraExplanation":["这个词比较少见，多见于医学/病理或皮肤科描述性用语。可拆成：nodo-（来自拉丁语，表示“结/结节”）+ s(ar)-（与 sarcoma“肉瘤”相关的词根联想）+ -form（“……形状的”）。整体强调“结节样、肿块样的外观”，通常是形态学描述，并不等同于直接诊断为肉瘤。"]}
{"word":"nodosarine","summary":{"en":"“Nodosarine” is a rare paleontology term meaning “related to (or a member of) the nodosaurines,” a group of armored dinosaurs.","zh":"“nodosarine”是很少见的古生物学用词，意思是“与结节龙亚科有关的/属于结节龙亚科的（或其成员）”，结节龙亚科是一类披甲恐龙。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(paleontology) Relating to or belonging to the nodosaurines (a group of armored, plant-eating dinosaurs within the nodosaur family).","zh":"（古生物学）指结节龙亚科（nodosaurines）——结节龙类中一支披甲、食草恐龙——的；属于结节龙亚科的。"},"examples":[{"en":"Fossils from this site may include nodosarine armored dinosaurs.","zh":"这个遗址的化石可能包含结节龙亚科的披甲恐龙。"},{"en":"Researchers compared nodosarine skull shapes to other ankylosaurs.","zh":"研究人员将结节龙亚科的头骨形态与其他甲龙类进行了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A nodosaurine dinosaur (a member of the nodosaurine group).","zh":"结节龙亚科的恐龙；结节龙亚科成员。"},"examples":[{"en":"This specimen is thought to be a nodosarine from the Late Cretaceous.","zh":"这个标本被认为是一只晚白垩世的结节龙亚科成员。"}]}],"synonyms":["nodosaurine","nodosaurid (broader)"],"phonetic":"ˌnoʊdəˈsɔːraɪn","extraExplanation":["“nodosarine”并不是日常英语词汇，更常见的学术写法是 **nodosaurine**（带 *-aur-*，来自 *nodosaur* “结节龙”）。如果你是在论文、博物馆说明或恐龙分类学语境中看到 “nodosarine”，它很可能是 “nodosaurine” 的拼写变体/误拼。"]}
{"word":"nodosaur","summary":{"en":"A nodosaur is a four-legged armored dinosaur with bony plates and spikes, usually without a tail club.","zh":"结节龙是一种四足、全身有骨板与骨刺的装甲恐龙，通常没有尾锤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of heavily armored dinosaur (a kind of ankylosaur) that walked on four legs and usually had bony plates and spikes along its body, but typically did not have a tail club","zh":"一种重度装甲的恐龙（甲龙类的一支），四足行走，身体通常有骨板和骨刺，但一般没有尾锤"},"examples":[{"en":"The museum exhibit featured a nodosaur fossil with armor plates still visible.","zh":"博物馆展览展示了一具结节龙化石，装甲骨板仍清晰可见。"},{"en":"Unlike some other armored dinosaurs, many nodosaurs lacked a tail club.","zh":"与一些其他装甲恐龙不同，许多结节龙没有尾锤。"}]}],"synonyms":["armored dinosaur","ankylosaur (broader term)"],"phonetic":"/ˈnoʊdəˌsɔr/","extraExplanation":["“nodosaur”来自其代表属名 Nodosaurus（意为“有结节的蜥蜴”），词根与拉丁语 nodus（结节、疙瘩）有关，用来形容它们身上像“疙瘩”一样的骨质装甲。","结节龙常见于科普文章、博物馆说明牌和古生物纪录片中；它不是日常英语词汇，但在谈论恐龙分类时很常用。","相关词：ankylosaur（甲龙类的总称）；nodosaurid（结节龙科的，或结节龙科成员）。"]}
{"word":"nodose","summary":{"en":"“nodose” usually refers to the caffeine tablet brand NoDoz/No-Doz, used to stay awake.","zh":"“nodose”通常指 NoDoz/No-Doz 这种咖啡因提神片（品牌名），用于保持清醒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for caffeine tablets taken to help you stay awake (often written “NoDoz” or “No-Doz”).","zh":"（商标名）一种咖啡因提神片，用来帮助保持清醒（常写作 NoDoz 或 No-Doz）。"},"examples":[{"en":"He took a NoDoz tablet to stay awake during the night shift.","zh":"他吃了一片 NoDoz 来在夜班时保持清醒。"},{"en":"Some students rely on caffeine pills like NoDoz during exam week.","zh":"有些学生在考试周会依赖像 NoDoz 这样的咖啡因药片。"}]}],"synonyms":["caffeine pill","stimulant tablet","stay-awake pill"],"phonetic":"/ˈnoʊdoʊz/","extraExplanation":["“NoDoz/No-Doz”主要是美国常见的商品名，日常表达里也有人把它当作泛指“咖啡因提神片”的说法，但更准确仍是品牌名称。","拼写上你输入的“nodose”常见于口语或随手打字的合写；标准写法多为“Nodeo/NoDoz/No-Doz”（以包装为准）。","含咖啡因的提神片可能造成心悸、焦虑、失眠等不适；如果在阅读或写作中提到，语气通常带有“靠刺激硬撑”的暗示。"]}
{"word":"nodosities","summary":{"en":"Nodosities means lumps or knobby swellings (plural), often used in medical or biological contexts.","zh":"nodosities 指“结节、肿块、瘤状突起”（复数），多用于医学或生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lumps or knobby swellings (the plural of “nodosity”), especially on the body (e.g., joints) or on plants (e.g., stems/roots).","zh":"结节；肿块；瘤状突起（“nodosity”的复数），常指人体（如关节）或植物（如茎、根）上的隆起。"},"examples":[{"en":"The doctor examined the nodosities near her finger joints.","zh":"医生检查了她手指关节附近的结节。"},{"en":"Some plants develop nodosities along the stem as they mature.","zh":"有些植物在生长成熟过程中会在茎上形成结节状隆起。"}]}],"synonyms":["lumps","nodules","bumps","swellings","knots"],"phonetic":"/noʊˈdɑsətiz/","extraExplanation":["“nodosities”来自“node（结、节）”相关词根，常见于医学或生物学语境，用来描述“结节状/瘤状的隆起”。在日常英语里更常说“lumps / nodules / bumps”。","医学语境中它可能指关节或皮下的结节（例如某些炎症或风湿相关表现）；植物学语境中可指节状增厚或瘤状结构。具体含义需看上下文。"]}
{"word":"nodosity","summary":{"en":"Nodosity means the state of having nodes or small lumps (most often in medical/scientific writing).","zh":"nodosity 指“有结节/小肿块的状态”，多用于医学或科学写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or condition of having nodes (knobs, lumps, or small swellings); nodularness.","zh":"有结节（小肿块、隆起或节状结构）的性质或状态；结节性。"},"examples":[{"en":"The doctor noted nodosity along the tendon during the exam.","zh":"医生在检查时注意到肌腱上有结节性隆起。"},{"en":"The report described a mild nodosity in the thyroid tissue.","zh":"报告描述甲状腺组织有轻度结节性改变。"}]},{"partOfSpeech":"n.","definition":{"en":"A knotty or uneven feature, especially in materials like wood (a less common use).","zh":"（较少见）指材料（如木材）上的节疤或不平整的结状特征。"},"examples":[{"en":"The carpenter avoided the nodosity in the plank to keep the surface smooth.","zh":"木匠避开木板上的节疤，以保持表面平整。"}]}],"synonyms":["nodularity","lumpiness","knotty texture"],"phonetic":"/noʊˈdɑsəti/","extraExplanation":["“nodosity”来自拉丁语 nodus（“结、节”）。在现代英语里更常见于医学或生物学语境，用来描述组织或结构呈现“结节状”的状态。日常表达中更常用 nodules（结节）、lump（肿块/硬块）、knot（木节/结）等词。"]}
{"word":"nodosum","summary":{"en":"“Nodosum” is a medical Latin word meaning “nodular,” most often used in “erythema nodosum.”","zh":"“nodosum”是医学拉丁语，意为“结节性的”，最常见于“erythema nodosum（结节性红斑）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, Latin) “Nodosum” means “nodular” or “full of nodules,” describing something that has small, rounded lumps (nodules). It is most commonly seen in the term “erythema nodosum.”","zh":"（医学/拉丁语）nodosum 意为“结节性的/多结节的”，用来描述有小的圆形肿块（结节）的情况；最常见于术语“erythema nodosum（结节性红斑）”。"},"examples":[{"en":"The doctor mentioned erythema nodosum as a possible cause of the tender nodules on her legs.","zh":"医生提到“结节性红斑”可能是她腿部压痛性结节的原因。"},{"en":"In medical Latin, “nodosum” describes a condition with lump-like nodules.","zh":"在医学拉丁语中，nodosum 用来描述带有肿块样结节的情况。"}]}],"synonyms":["nodular","nodule-forming"],"phonetic":"/noʊˈdoʊsəm/","extraExplanation":["“nodosum”本身在日常英语里几乎不会单独使用，多见于固定医学名词（尤其是 erythema nodosum）。在英文医学写作中，常把它当作拉丁语形容词来用，意思接近“nodular（结节性的）”。","常见搭配：erythema nodosum（结节性红斑，通常表现为小腿前侧疼痛的红色结节）；与之相近但不同的词还有 nodule（结节，名词）、nodular（结节性的，形容词，英语常用）。"]}
{"word":"nodous","summary":{"en":"Nodous means having nodes or lumps; it’s a rare form of “nodose,” used mostly in scientific or older writing.","zh":"Nodous 指“有节或有结节的”，是较少见的拼写形式，多见于科学或较旧的写作中（常作 nodose）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having nodes or lumps; knobby or knotty (often describing plants, stems, or body tissue).","zh":"有节的；有结节/肿块的；多瘤状的（常用于描述植物茎、枝或身体组织）。"},"examples":[{"en":"The botanist described the vine as nodous, with swollen joints along the stem.","zh":"植物学家把这种藤蔓描述为有节的，茎上每一节都明显膨大。"},{"en":"Some old medical texts mention nodous swellings in the joints.","zh":"一些旧式医学文献会提到关节处出现结节状肿胀。"}]}],"synonyms":["nodose","nodular","knotty","knobby","lumpy"],"phonetic":"/ˈnoʊdoʊs/","extraExplanation":["“nodous”比较少见，更常见的拼写是“nodose”，意思相同；在科学写作里也常用“nodular”（结节状的）或“knotty/knobby”（多结的、凸起的）。","词根来自拉丁语“nodus”（结、节）。在植物学中，“node”是“节”（叶子或分枝长出来的位置），所以“nodous/nodose”常用来形容茎在节处显得鼓起或一节一节很明显。"]}
{"word":"nods","summary":{"en":"“nods” means head movements (or the plural form) used to show agreement, greeting, or understanding.","zh":"“nods”表示点头的动作（或其复数形式），常用来表达同意、问候或理解。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"moves the head down and up (or up and down) to show agreement, greeting, or understanding","zh":"点头（上下移动头部）以表示同意、打招呼或理解"},"examples":[{"en":"She nods to show she agrees.","zh":"她点头表示同意。"},{"en":"He nods at me when he walks in.","zh":"他走进来时朝我点了点头。"},{"en":"I explain it again, and the student nods.","zh":"我又解释了一遍，学生点头表示明白。"}]},{"partOfSpeech":"n.","definition":{"en":"a small movement of the head to show agreement, greeting, or understanding","zh":"点头（表示同意、问候或理解的轻微头部动作）"},"examples":[{"en":"He gives a quick nod and leaves.","zh":"他快速点了点头就离开了。"},{"en":"With a nod, she says yes without speaking.","zh":"她点点头，不用说话就表示“是”。"}]}],"synonyms":["agrees (in gesture)","acknowledges (with a nod)","nods yes"],"phonetic":"/nɑdz/","extraExplanation":["“nods”常见两种用法：\n1) 动词第三人称单数：He/She nods.\n2) 名词复数：two nods.\n语境里通常更常见的是动词用法。","文化小提醒：在很多英语语境中，点头通常表示“同意/明白”。但在部分文化里点头和摇头的含义可能不同，所以跨文化交流时可以配合语言确认（如“Do you mean yes?”）。","常见搭配：nod at (someone)（朝某人点头示意）、nod yes/no（点头/摇头表示是/否）、nod off（打瞌睡、困得点头）。"]}
{"word":"nodular","summary":{"en":"“Nodular” describes something that has small rounded lumps (nodules), often used in medical or scientific contexts.","zh":"“Nodular”表示“有结节的、呈小圆结块状的”，常用于医学或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or forming small rounded lumps (nodules).","zh":"有结节的；呈小圆结块（结节）状的。"},"examples":[{"en":"The doctor noted a nodular mass under the skin.","zh":"医生注意到皮下有一个结节状的肿块。"},{"en":"Some nodular acne can leave scars if it isn’t treated properly.","zh":"一些结节性痤疮如果处理不当可能会留下疤痕。"},{"en":"The rock surface looked nodular, with many small bumps.","zh":"岩石表面呈结节状，有许多小凸起。"}]}],"synonyms":["lumpy","bumpy","knobby","nodulose"],"phonetic":"/ˈnɑːdʒələr/","extraExplanation":["“nodular”来自“nodule（结节、小结块）+ -ar（形容词后缀）”，常用于医学与科学语境，比如“nodular acne（结节性痤疮）”“nodular goiter（结节性甲状腺肿）”。日常口语中较少用，更常见的通俗说法是“lumpy（有疙瘩的）”或“bumpy（凹凸不平的）”。"]}
{"word":"nodulate","summary":{"en":"“Nodulate” means to form or cause the formation of small nodules (lumps), especially plant root nodules in legumes.","zh":"“nodulate”指形成或使形成小结节（结块），尤指豆科植物根部形成根瘤。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of roots or plants) to form nodules (small round lumps), often where bacteria help the plant get nitrogen.","zh":"（指植物根或植物）形成根瘤（小的圆形结节），常与细菌共生以帮助固氮。"},"examples":[{"en":"Legumes like soybeans nodulate when they grow in soil that contains the right bacteria.","zh":"像大豆这样的豆科植物在含有合适细菌的土壤中生长时会形成根瘤。"},{"en":"Healthy nodulating roots can reduce the need for nitrogen fertilizer.","zh":"健康的根瘤形成可以减少对氮肥的需求。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause something to become nodulated; to develop small lumps or nodes on a surface.","zh":"使某物结节化；在表面形成小疙瘩或结节。"},"examples":[{"en":"The disease can nodulate the tissue over time.","zh":"这种疾病可能随着时间使组织形成结节。"},{"en":"Some minerals appear nodulated after long periods of growth and pressure.","zh":"一些矿物在长期生长与压力作用后会呈现结节状。"}]}],"synonyms":["form nodules","develop nodules","nodulation (related noun)","nodule (related noun)"],"phonetic":"/ˈnɑːdʒəˌleɪt/","extraExplanation":["“nodulate”来自拉丁语词根 nod-，意为“结/节（knot）”。在生物学里最常见的语境是豆科植物（legumes）根部与根瘤菌（rhizobia）共生形成根瘤，用来“固氮”（nitrogen fixation）。","学习提示：在农业/生物课本中更常见的是名词/形容词形式：nodule（结节/根瘤）、nodulation（结节形成/根瘤形成）、nodulated（结节状的）。"]}
{"word":"nodulated","summary":{"en":"“Nodulated” means “having nodules” (small rounded lumps) or “having developed into nodules,” often used in medical/scientific descriptions.","zh":"“nodulated”指“有结节的/呈结节状的”，或“已经形成结节的”，常用于医学与科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having nodules (small rounded lumps or swellings) on or in something; lumpy in a rounded, clustered way.","zh":"有结节的；呈结节状的（表面或内部出现小而圆的凸起/肿块）。"},"examples":[{"en":"The doctor noted a nodulated mass in the patient’s neck.","zh":"医生注意到病人颈部有一个结节状的肿块。"},{"en":"Under the microscope, the tissue looked nodulated rather than smooth.","zh":"在显微镜下，这种组织看起来呈结节状，而不是光滑的。"},{"en":"Some plants have nodulated roots that help them store nutrients.","zh":"有些植物的根呈结节状，有助于储存养分。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “nodulate”: to form into nodules or develop nodules.","zh":"“nodulate”的过去式/过去分词：形成结节；使变成结节状。"},"examples":[{"en":"Over time, the surface nodulated as mineral deposits built up.","zh":"随着时间推移，矿物沉积不断累积，表面逐渐形成结节。"},{"en":"The lesion had nodulated after several months without treatment.","zh":"在数月未治疗后，该病灶出现了结节化。"}]}],"synonyms":["nodular","lumpy","knobbed","bumpy"],"phonetic":"/ˈnɑːdʒəˌleɪtɪd/","extraExplanation":["“nodulated”常见于医学影像/病理描述（如nodulated mass/lesion：结节状肿块/病灶）和生物学、地质学语境。它偏书面与专业，不太用于日常口语。","词根提示：nodule（结节、小瘤）+ -ate/-ed（使……形成/已形成）。学习时可一起记 nodule（名词）与 nodular（形容词：结节状的），二者在医学文本里更常见。"]}
{"word":"nodulation","summary":{"en":"Nodulation means the formation of nodules, especially root nodules in plants or small nodules in body tissue.","zh":"Nodulation 指结节的形成，常见于植物根瘤的形成，也可指人体组织中的结节形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation of small rounded lumps (nodules), especially on plant roots (such as legumes) where nitrogen-fixing bacteria live","zh":"结瘤；形成小结节（结节化），尤指豆科植物根部形成根瘤，内有固氮细菌"},"examples":[{"en":"Nodulation in soybean roots helps the plant get nitrogen from the air.","zh":"大豆根部的结瘤有助于植物从空气中获得氮。"},{"en":"Too much nitrogen fertilizer can reduce nodulation.","zh":"施用过多氮肥会减少结瘤。"}]},{"partOfSpeech":"n.","definition":{"en":"the development of nodules in body tissue, often describing a medical or pathological process","zh":"（医学）结节形成；组织出现结节（常指病理变化）"},"examples":[{"en":"The report mentioned nodulation in the lung tissue.","zh":"报告提到肺组织出现结节形成。"},{"en":"Doctors monitored the nodulation over time with imaging tests.","zh":"医生通过影像检查随时间监测结节形成的变化。"}]}],"synonyms":["nodule formation","nodule development"],"phonetic":"/ˌnoʊdʒəˈleɪʃən/","extraExplanation":["在农业与植物学语境中，nodulation 常与“根瘤菌（rhizobia）—豆科植物”共生关系一起出现：细菌把空气中的氮转成植物可用的形式，植物则提供糖分与栖息环境。","词形结构：nodule（结节）+ -ation（表示“过程/结果”的名词后缀）。写作中常见搭配有 promote/increase nodulation（促进结瘤）、poor nodulation（结瘤不良）、nodulation efficiency（结瘤效率）。"]}
{"word":"nodule","summary":{"en":"A nodule is a small rounded lump, especially in medicine, but also in plants and geology.","zh":"nodule 指“小而圆的结节/团块”，最常见于医学，也可用于植物（根瘤）和地质（矿结核）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, rounded lump or swelling in the body (for example, under the skin, in the lung, or on the thyroid).","zh":"（医学）结节；（身体内或皮下的）小而圆的肿块/隆起（如肺结节、甲状腺结节）。"},"examples":[{"en":"The doctor found a small nodule on her thyroid during the exam.","zh":"医生在检查时发现她的甲状腺上有一个小结节。"},{"en":"A lung nodule showed up on the X-ray, so they ordered a CT scan.","zh":"X光片上出现了一个肺结节，所以他们安排做CT检查。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, rounded mass in plants, especially on roots, often involved in storing nutrients or helping the plant get nitrogen.","zh":"（植物）根瘤；（尤指根部的）小圆块组织，常与养分储存或固氮有关。"},"examples":[{"en":"Legumes like beans often have root nodules that help them grow in poor soil.","zh":"豆类等豆科植物常有根瘤，能帮助它们在贫瘠土壤中生长。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, rounded lump of mineral or rock found in the ground or under the sea.","zh":"（地质）矿结核；（海底或地下的）小圆状矿物/岩石团块。"},"examples":[{"en":"Scientists study manganese nodules on the ocean floor.","zh":"科学家研究海底的锰结核。"}]}],"synonyms":["lump","bump","small mass","swelling"],"phonetic":"/ˈnɑːdʒuːl/","extraExplanation":["词源提示：nodule 来自拉丁语 nodus（“结、节”），所以它的核心感觉是“像打了一个结的小圆块”。","使用提醒（医学语境）：nodule 只是形态描述，意思是“结节/小肿块”，不等于“癌”。是否需要治疗通常取决于大小、形状、增长速度以及影像学/化验结果。"]}
{"word":"noduled","summary":{"en":"“Noduled” means “having nodules; nodular,” used mainly in medical or scientific contexts.","zh":"“noduled”表示“有结节的、呈结节状的”，多用于医学或科研语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having one or more nodules (small, rounded lumps) on or in something; nodular","zh":"有结节的；长有小结节（小而圆的肿块/突起）的"},"examples":[{"en":"The doctor noted a noduled thyroid during the exam.","zh":"医生在检查中发现甲状腺有结节。"},{"en":"The rock surface looked noduled, with many small rounded bumps.","zh":"岩石表面呈结节状，有许多小而圆的突起。"}]}],"synonyms":["nodular","lumpy","knobbly","bumpy"],"phonetic":"/ˈnɑːdʒuːld/","extraExplanation":["“noduled”在日常英语里不太常见，更常用的是“nodular”（结节状的）或“with nodules”（有结节）。在医学语境中，nodule常指身体组织里的“小结节/小肿块”（多数为良性，但需要结合检查判断）；在地质或材料语境中，nodule也可指岩石或金属中的“结核/结节状团块”。"]}
{"word":"nodules","summary":{"en":"Nodules are small rounded lumps or growths, especially in body tissue, and sometimes in plants or minerals.","zh":"Nodules 指小的圆形结节/肿块，常见于人体组织（医学语境），也可指植物或矿物中的小结核。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small rounded lumps or growths in the body, usually in tissue (for example, in the lungs, thyroid, or under the skin). Some nodules are harmless, but others may need medical checks.","zh":"（医学）结节；在身体组织里出现的小的圆形肿块或增生（如肺、甲状腺或皮下）。很多是良性的，但有些需要进一步检查。"},"examples":[{"en":"The doctor found small nodules on her thyroid during the exam.","zh":"医生在检查时发现她的甲状腺上有小结节。"},{"en":"A CT scan showed several lung nodules that need follow-up.","zh":"CT显示有几个肺结节，需要复查。"},{"en":"Most skin nodules are benign, but it’s best to get them checked.","zh":"大多数皮肤结节是良性的，但最好还是检查一下。"}]},{"partOfSpeech":"n.","definition":{"en":"Small hard lumps or swellings on plants or animals, or small rounded masses in general.","zh":"（泛指）小结节；植物或动物上的小硬块/肿胀；一般意义上的小圆块。"},"examples":[{"en":"Some plants form root nodules that help them get nitrogen.","zh":"一些植物会形成根瘤，帮助它们获取氮。"},{"en":"The mineral formed tiny nodules inside the rock.","zh":"这种矿物在岩石内部形成了微小的结核。"}]}],"synonyms":["lumps","bumps","growths","masses"],"phonetic":"/ˈnɑːdʒuːlz/","extraExplanation":["“Nodule”常用于医学影像/检查报告（如 thyroid nodule, lung nodule）。它通常只描述“形状像小结节/小肿块”，并不直接等于“癌”。报告里常见的搭配有：benign（良性）、malignant（恶性）、follow-up（随访复查）、biopsy（活检）。"]}
{"word":"noduli","summary":{"en":"“Noduli” means small lumps or nodules, used mainly in medical/scientific writing.","zh":"“Noduli”指小结节/小肿块，主要用于医学或科学写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small lumps or rounded swellings (plural of “nodule”), especially in medical or scientific contexts","zh":"小结节；小肿块（“nodule”的复数，常用于医学或科学语境）"},"examples":[{"en":"The scan showed several noduli in the patient’s lungs.","zh":"扫描显示患者肺部有几个结节。"},{"en":"The doctor monitored the thyroid noduli over time.","zh":"医生持续观察这些甲状腺结节的变化。"},{"en":"In botany, noduli can form where the plant stores nutrients.","zh":"在植物学中，植物可能在储存养分的位置形成小结节。"}]}],"synonyms":["nodules","small lumps","nodular swellings"],"phonetic":"/ˈnɑːdʒəˌlaɪ/","extraExplanation":["“Noduli”是拉丁化复数形式，对应单数“nodulus”（较少单独使用）或更常见的英语单数“nodule”。在日常英语里，人们通常说“nodules”，但在医学报告、论文、病理描述中常见“noduli”。","词根来自拉丁语“nodus”（结、节），所以常用来描述“像小结一样的隆起/肿块”。"]}
{"word":"nodulize","summary":{"en":"To form or cause the formation of nodules (small lumps), especially in medical contexts.","zh":"（多用于医学语境）形成结节，或使形成结节（小肿块）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Medicine/Biology) To form or develop into nodules (small rounded lumps), or to cause something to form nodules.","zh":"（医学/生物）形成或发展成结节（小的圆形肿块）；使……结节化。"},"examples":[{"en":"Over time, the tissue may nodulize and feel lumpy to the touch.","zh":"随着时间推移，组织可能会结节化，摸起来有颗粒感。"},{"en":"Chronic inflammation can cause parts of the organ to nodulize.","zh":"慢性炎症可能使器官的某些部位结节化。"},{"en":"On the scan, the surface appears to have nodulized in several areas.","zh":"在扫描中，表面看起来在几个区域出现了结节化。"}]}],"synonyms":["form nodules","develop nodules","become nodular","nodulate"],"phonetic":"/ˈnɑːdʒəˌlaɪz/","extraExplanation":["“nodulize”较少用于日常英语，更多见于医学影像、病理或生物学写作中。更常见的相关表达包括“form nodules / develop nodules / become nodular（变成结节状）”。","词根来自“nodule（结节）”，后缀“-ize”常表示“使……化/变成……”，因此字面意思就是“使形成结节”。"]}
{"word":"nodulized","summary":{"en":"“Nodulized” means formed into nodules or having nodules; it’s a technical word often used in medicine, geology, and metallurgy.","zh":"“nodulized”指“结节化的/有结节的”，是常用于医学、地质与冶金等领域的专业用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Made into nodules (small rounded lumps), or having nodules.","zh":"（技术/专业）被结节化的；形成结节（小的圆形团块）的；带有结节的。"},"examples":[{"en":"The rock surface looks nodulized, with many small rounded bumps.","zh":"这块岩石表面呈结节化状态，有许多小的圆形凸起。"},{"en":"Doctors described the tissue as nodulized in the imaging report.","zh":"医生在影像报告中描述该组织出现了结节化表现。"},{"en":"Nodulized graphite can improve some properties of cast iron.","zh":"结节化石墨可以改善铸铁的某些性能。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of “nodulize”: to form into nodules; to cause nodules to develop.","zh":"“nodulize”的过去式/过去分词：使形成结节；使结节发展。"},"examples":[{"en":"The treatment nodulized the metal’s graphite structure during processing.","zh":"在加工过程中，该处理使金属的石墨结构结节化。"},{"en":"Over time, the mineral deposits nodulized inside the cavity.","zh":"随着时间推移，矿物沉积物在空腔内逐渐结节化。"}]}],"synonyms":["nodular","lumpy","bumpy","nodule-forming"],"phonetic":"/ˈnɑːdʒəˌlaɪzd/","extraExplanation":["“nodulized”多见于医学、地质学、冶金等语境，属于偏专业用词；日常英语里更常说“has nodules / lumpy / bumpy”等更口语的表达。","拼写上也常见英式变体“nodulised”。在冶金里，“nodulized graphite（球状/结节状石墨）”与“ductile iron（球墨铸铁）”相关。"]}
{"word":"nodulizing","summary":{"en":"“Nodulizing” means developing or causing nodules to form; in metallurgy, it refers to making graphite form as nodules in iron (ductile iron).","zh":"“nodulizing”指（使）形成结节；在冶金中常指使铁中石墨形成球状结点的球化处理（用于球墨铸铁）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"forming into nodules (small rounded lumps), or causing something to develop nodules; the -ing form of “nodulize.”","zh":"形成结节（小的圆形块状物），或使某物出现结节；“nodulize”的现在分词/动名词形式。"},"examples":[{"en":"The doctor is monitoring a cyst that may be nodulizing over time.","zh":"医生正在监测一个囊肿，因为它可能会随着时间出现结节化。"},{"en":"Repeated irritation can lead to tissue nodulizing in the affected area.","zh":"反复刺激可能导致受影响区域的组织发生结节化。"}]},{"partOfSpeech":"v.","definition":{"en":"(materials/metallurgy) treating molten iron so that carbon forms rounded graphite nodules, improving strength and ductility.","zh":"（材料/冶金）对熔融铁进行处理，使碳形成球状石墨结点（结节），从而提高强度与韧性。"},"examples":[{"en":"The foundry is nodulizing the iron to produce ductile cast iron.","zh":"铸造厂正在对铁液进行球化处理，以生产球墨铸铁。"},{"en":"Proper nodulizing helps prevent brittle fracture in cast parts.","zh":"适当的球化处理有助于防止铸件发生脆性断裂。"}]}],"synonyms":["forming nodules","developing nodules","nodule formation","spheroidizing (metallurgy)"],"phonetic":"/ˈnɑːdʒəˌlaɪzɪŋ/","extraExplanation":["“nodulizing”多见于医学/生物（组织出现结节）与冶金（球化处理）语境；日常英语里更常用“forming nodules / developing nodules”。","词根提示：nodule（结节）+ -ize（使……化）+ -ing（进行中/动名词）。"]}
{"word":"nodulose","summary":{"en":"“Nodulose” means having small nodules—lumpy or knobby, often used in medical or scientific descriptions.","zh":"“nodulose”表示“有结节的、结节状的”，常见于医学或科学描述中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small rounded lumps (nodules); knobby or lumpy in texture.","zh":"有小结节的；呈结节状的；表面凹凸不平的。"},"examples":[{"en":"The doctor noted a nodulose thyroid on the scan.","zh":"医生在影像检查中注意到甲状腺呈结节状。"},{"en":"Some nodulose rocks feel rough because of tiny raised bumps.","zh":"一些结节状岩石因为有许多细小凸起而摸起来很粗糙。"},{"en":"The report described nodulose growth along the plant’s stem.","zh":"报告描述植物茎部出现结节状生长。"}]}],"synonyms":["nodular","lumpy","knobby","bumpy"],"phonetic":"/ˈnɑːdʒəˌloʊs/","extraExplanation":["“nodulose”多用于医学、病理学、植物学、地质学等较正式的语境，日常英语里更常用“lumpy / knobby / bumpy”。","词源来自拉丁语“nodulus”（小结/小节），与“nodule（结节）”“node（节/节点）”同源。医学里常用来形容器官或组织出现多个小结节（如结节性甲状腺、结节性肝硬化等描述中可能见到）。"]}
{"word":"nodulous","summary":{"en":"“Nodulous” means having nodules—small lumps or bumps, often used in medical or scientific descriptions.","zh":"“nodulous”指“有结节/小块隆起的”，常用于医学或科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one or more small lumps (nodules); lumpy in appearance or texture.","zh":"有结节的；呈小块隆起的；结节状的。"},"examples":[{"en":"The doctor described the thyroid as nodulous on the ultrasound.","zh":"医生在超声检查中描述甲状腺呈结节状。"},{"en":"The rock surface looked nodulous, with many small bumps.","zh":"岩石表面看起来凹凸不平，有许多小凸起。"}]}],"synonyms":["nodular","lumpy","knobbly","bumpy"],"phonetic":"/ˈnɑdʒələs/","extraExplanation":["“nodulous”来自“nodule（结节、小结）”。在日常英语里更常见的是“nodular”，意思非常接近；“nodulous”更偏书面或医学/地质等专业语境。","在医学语境中，它通常只是形态描述（看起来有结节），并不直接等同于“恶性/癌变”。需要结合检查结果与医生判断。"]}
{"word":"nodulus","summary":{"en":"Nodulus means a small knot or swelling, often in medical or biological contexts.","zh":"nodulus 指小结节或小肿块，常见于医学或生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small knot, lump, or node; a tiny swelling or rounded part (often used in biology or medicine).","zh":"小结节；小肿块；小结（常用于生物学或医学语境）。"},"examples":[{"en":"The scan showed a small nodulus in the patient’s lung.","zh":"扫描显示病人的肺部有一个小结节。"},{"en":"In some plants, a nodulus can form where new growth begins.","zh":"在一些植物中，新生长开始的部位可能会形成小结（结节）。"}]}],"synonyms":["nodule","node","lump","swelling"],"phonetic":"/ˈnoʊ.dʒə.ləs/","extraExplanation":["“nodulus”来自拉丁语，意为“（小）结、（小）节”，是“nodus（结、节、结点）”的指小形式。英语里更常见的是“nodule（结节）”或“node（结点）”；“nodulus”多见于较正式的医学、解剖学或生物学写作中。","复数通常是拉丁式“noduli”，在医学报告或学术文本里可能会看到。"]}
{"word":"nodus","summary":{"en":"Nodus is a rare Latin-based word meaning a knot or node, used mainly in scientific or formal contexts.","zh":"Nodus 是一个较少见的拉丁语来源词，意思是“结/节点”，主要用于科学或较正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a knot or node; a point where something joins, swells, or branches (often used in scientific or Latin-influenced writing).","zh":"结；节点；结节（多见于科学或受拉丁语影响的写法，指连接、隆起或分叉的部位）。"},"examples":[{"en":"In the diagram, the nerve nodus is marked as a small swelling along the pathway.","zh":"在图中，神经的结节（nodus）被标注为通路上的一个小膨大处。"},{"en":"Botanists may describe a nodus as the point on a stem where leaves emerge.","zh":"植物学家可能用 nodus 来描述茎上长出叶子的“节/节点”。"}]}],"synonyms":["node","knot","nodule"],"phonetic":"/ˈnoʊdəs/","extraExplanation":["“nodus”源自拉丁语，基本意思是“结、纽结”。在现代英语中它不算常用词，更常见的是英语对应词 node（节点）、knot（结）、nodule（结节）。","在解剖学、植物学、古典学等语境里，有时会保留拉丁词形“nodus”来显得更“学术/古典”，但一般写作与口语中用 node/knot 更自然。"]}

