{"word":"nom","summary":{"en":"“nom (nom nom)” is an informal internet expression meaning “yum” or “eating something tasty,” and it can also mean “food” in a cute way.","zh":"“nom（nom nom）”是非正式网络用语，表示“真香/在吃好吃的”；也可可爱地表示“食物/吃的”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Internet, informal) Used to show that you are eating something or that the food looks tasty; an eating sound like “yum yum.”","zh":"（网络用语，非正式）表示在吃东西或觉得食物很诱人；模仿“吧唧吧唧/真香”的吃东西声音。"},"examples":[{"en":"Nom nom! This pizza is so good.","zh":"nom nom！这披萨太好吃了。"},{"en":"That cake looks amazing—nom!","zh":"那个蛋糕看起来太棒了——nom！"},{"en":"We posted a photo of ramen with the caption “nom nom.”","zh":"我们发了拉面照片，配文写“nom nom”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Internet, informal) Food, eating, or the act of munching (often used as a cute noun).","zh":"（网络用语，非正式）食物/吃东西（常用作可爱的名词用法）。"},"examples":[{"en":"I need some nom after work.","zh":"下班后我需要来点吃的。"},{"en":"Bring nom for the road trip.","zh":"自驾旅行带点吃的。"}]}],"synonyms":["yum","yummy","delicious","munch","chomp"],"phonetic":"/nɑm/","extraExplanation":["“nom/nom nom”常见于英语网络文化（尤其是梗图、可爱风格的表达），用来夸食物好吃或表示正在吃。它更像拟声词/卖萌表达，正式写作中一般不用。","注意：法语里“nom”是“名字”的意思，但英语里把“nom”当“名字”通常只出现在讨论法语或少数专门语境中。"]}
{"word":"noma","summary":{"en":"“Noma” most commonly refers to a serious mouth-and-face infection; it can also be a proper name (e.g., a restaurant or a person’s name).","zh":"“noma”最常指一种严重的口腔与面部感染（诺玛病）；也可作专有名词（如餐厅名或人名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a severe, rapidly spreading infection that destroys the tissues of the mouth and face, especially in malnourished children (also called “cancrum oris”)","zh":"（医学）诺玛病：一种严重且进展很快的感染，会破坏口腔与面部组织，常见于营养不良的儿童（又称“口疮性坏疽”）"},"examples":[{"en":"Doctors worked quickly to treat noma and stop the infection from spreading.","zh":"医生迅速治疗诺玛病，以阻止感染扩散。"},{"en":"Improving nutrition and access to basic healthcare can help prevent noma.","zh":"改善营养并获得基本医疗服务有助于预防诺玛病。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for people, places, or brands (e.g., the restaurant “Noma” in Copenhagen)","zh":"（专有名词）人名、地名或品牌名（例如哥本哈根的餐厅“Noma”）"},"examples":[{"en":"They booked a table at Noma months in advance.","zh":"他们提前几个月预订了 Noma 的座位。"},{"en":"Noma is sometimes used as a given name in different cultures.","zh":"Noma 在不同文化中也有时被用作名字。"}]}],"synonyms":["cancrum oris"],"phonetic":"/ˈnoʊmə/","extraExplanation":["“noma”（诺玛病）一词常被认为源自希腊语，和“吞噬/吃掉”的意思相关，用来形容该病会迅速“侵蚀”组织的特征。","在非医学语境里，Noma 很常见为专有名词；是否需要大写（Noma）取决于你指的是疾病还是具体的人名/品牌名。"]}
{"word":"nomad","summary":{"en":"A nomad is someone who does not settle permanently and moves from place to place; it can also describe a lifestyle that is not settled.","zh":"nomad 指没有固定居所、经常迁徙的人；也可形容“游牧式/流动、不定居”的生活方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who moves from place to place and does not have a permanent home, often traveling to find work, food, or better conditions","zh":"游牧者；四处迁徙、没有固定住所的人（常为寻找工作、食物或更好的生活条件而移动）"},"examples":[{"en":"Her grandparents were nomads who moved with their animals across the desert.","zh":"她的祖父母是游牧者，会赶着牲畜穿越沙漠迁徙。"},{"en":"After college, he lived like a nomad, working short jobs in different cities.","zh":"大学毕业后，他过着像“漂泊者”一样的生活，在不同城市做短期工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving from place to place rather than staying in one location; not settled","zh":"游牧的；流动的；不定居的"},"examples":[{"en":"They followed a nomad lifestyle for years, rarely staying anywhere longer than a month.","zh":"他们过了多年游牧式的生活，很少在一个地方停留超过一个月。"},{"en":"The company’s nomad team works remotely and travels frequently.","zh":"这家公司的“流动团队”远程办公，经常出差旅行。"}]}],"synonyms":["wanderer","roamer","traveler","migrant"],"phonetic":"/ˈnoʊmæd/","extraExplanation":["在现代语境里，nomad 有时也指“数字游牧”（digital nomad）：利用网络远程工作、同时在不同城市或国家生活的人。它不一定等同于传统意义上的游牧民族，但都强调“流动、不定居”。","词源来自希腊语 nomas（意为“放牧的人”），因此它最初常与放牧、逐水草而居的生活方式相关。"]}
{"word":"nomade","summary":{"en":"Nomad means a person (or lifestyle) that moves from place to place instead of living permanently in one location.","zh":"Nomad 指不定居、经常迁徙的人（或生活方式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group who moves from place to place rather than living in one permanent home, often to find food, water, or work","zh":"游牧民；（不定居的）流动人口，常因寻找食物、水源或工作而迁徙"},"examples":[{"en":"In history class, we learned about nomads who followed their herds across the grasslands.","zh":"在历史课上，我们学习了游牧民如何跟随牧群穿越草原。"},{"en":"Some people become digital nomads, working online while traveling.","zh":"有些人成为“数字游牧”，一边旅行一边在线工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving from place to place; not having a fixed home or long-term location","zh":"游牧的；流动的；没有固定居所的"},"examples":[{"en":"They lived a nomad lifestyle for years, rarely staying in one city.","zh":"他们过了多年的游牧式生活，很少在同一座城市久住。"},{"en":"Her job is nomad, so she changes countries every few months.","zh":"她的工作很流动，所以每隔几个月就换一个国家。"}]}],"synonyms":["wanderer","migrant","roamer","traveler"],"phonetic":"/ˈnoʊmæd/","extraExplanation":["“nomade”常见于法语（nomade）。英语里标准拼写通常是“nomad”。如果你是在英文语境中写作，建议用“nomad”。"]}
{"word":"nomades","summary":{"en":"“Nomades” is usually the plural meaning “nomads”: people who move from place to place instead of living in one fixed home.","zh":"“nomades”通常表示“nomads（游牧者/居无定所的人）”：不在固定地点长期居住，而是不断迁移的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who move from place to place rather than living permanently in one location (plural of “nomad”)","zh":"游牧者；居无定所的人（“nomad”的复数）"},"examples":[{"en":"For thousands of years, nomads crossed the desert with their animals.","zh":"几千年来，游牧者带着牲畜穿越沙漠。"},{"en":"Some nomads travel for work, following seasonal jobs.","zh":"有些居无定所的人为了工作而迁移，跟随季节性的工作机会。"}]},{"partOfSpeech":"n.","definition":{"en":"people who change locations frequently, especially for lifestyle reasons (e.g., digital nomads)","zh":"经常更换居住地的人（尤指一种生活方式，比如“数字游牧者”）"},"examples":[{"en":"After graduation, they became nomads, living in different cities each year.","zh":"毕业后，他们过起了“游牧式”生活，每年住在不同的城市。"},{"en":"Digital nomads work online while traveling.","zh":"数字游牧者一边旅行一边在线工作。"}]}],"synonyms":["nomads","migrants","wanderers","travelers"],"phonetic":"/ˈnoʊmædz/","extraExplanation":["“nomades”更常见于法语（nomades）或作为外来拼写；标准英语复数通常写作“nomads”。","词源来自希腊语，原意与“放牧、迁徙”有关，因此在历史语境里常指逐水草而居的牧民；现代语境也常比喻“经常搬家/流动”的生活方式。"]}
{"word":"nomadian","summary":{"en":"“Nomadian” is rare and usually a misspelling of “nomadic” (adjective) or “nomad” (noun). It refers to living a life of moving from place to place.","zh":"“Nomadian”很少见，通常是“nomadic（游牧的）”或“nomad（游牧民）”的误拼，表示迁徙式、不定居的生活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/likely misspelling) Relating to nomads; living by moving from place to place rather than staying in one permanent home. The common word is “nomadic.”","zh":"（罕见/多为拼写错误）与游牧民族有关的；过着迁徙式生活、没有固定住所的。更常用的词是 “nomadic（游牧的）”。"},"examples":[{"en":"They lived a nomadian lifestyle, traveling with the seasons.","zh":"他们过着游牧式（nomadian）的生活，随季节迁徙。"},{"en":"Nomadic (more common): The family was nomadic and moved often for work.","zh":"Nomadic（更常用）：这家人居无定所，为了工作经常搬家。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who lives a nomadic life; a nomad. (This use is uncommon; “nomad” is standard.)","zh":"过游牧生活的人；游牧民。（这种用法不常见；标准说法是 “nomad”。）"},"examples":[{"en":"In the story, he becomes a nomadian after leaving the city.","zh":"在故事里，他离开城市后成了一名“游牧者”（nomadian）。"},{"en":"Nomad (more common): Many nomads raise animals and move to find grass and water.","zh":"Nomad（更常用）：许多游牧民饲养牲畜，并迁徙寻找草场和水源。"}]}],"synonyms":["nomadic","migratory","wandering","roaming","nomad"],"phonetic":"/noʊˈmeɪdiən/","extraExplanation":["“nomadian”在现代英语中非常少见，很多时候是把“nomadic（游牧的）/nomad（游牧民）”写错了。写作与考试中建议用更常见、更自然的“nomadic / nomad”。","词源小提示：nomad来自希腊语词根，含“放牧、游动”的概念；因此nomadic常用来形容“经常迁移、不定居”的生活方式，也可引申到工作/学习方式（如digital nomad）。"]}
{"word":"nomadic","summary":{"en":"Nomadic describes people or lifestyles that move from place to place rather than staying in one permanent home.","zh":"nomadic 指“游牧的、迁徙的”，也可引申为“地点不固定、常搬迁”的生活或工作方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Moving from place to place rather than living in one permanent home, often following seasons, work, or food sources.","zh":"游牧的；四处迁徙的（不长期定居在一个地方，常随季节、工作或食物来源而移动）。"},"examples":[{"en":"Some nomadic groups move with their animals to find fresh grass and water.","zh":"一些游牧群体会跟着牲畜迁移，以寻找新鲜的草地和水源。"},{"en":"Her job made her lifestyle nomadic, so she lived in different cities each year.","zh":"她的工作让她的生活方式很游牧式，所以她每年住在不同的城市。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not staying in one place for long; frequently changing locations (often used about modern life, work, or travel).","zh":"不固定的；经常更换地点的（常用于形容现代的生活、工作或旅行方式）。"},"examples":[{"en":"He has a nomadic schedule and rarely works in the same office two weeks in a row.","zh":"他的日程很不固定，很少连续两周在同一个办公室工作。"},{"en":"Digital nomadic workers often rely on Wi‑Fi and flexible hours.","zh":"数字游民常常依赖网络和弹性工作时间。"}]}],"synonyms":["migratory","itinerant","roving","wandering","mobile"],"phonetic":"/noʊˈmædɪk/","extraExplanation":["词源上与“nomad（游牧民）”相关，来自希腊语，原意与“放牧、分配牧场”有关，因此“nomadic”最传统的使用场景是描述以放牧为生、随水草迁徙的生活方式。","现代英语里常把它引申为“地点不稳定的生活/工作方式”（如 digital nomad 数字游民）。使用时注意语气：描述文化与族群时尽量客观、尊重，避免把“nomadic”当作“落后”或“无家可归”的同义词。","常见搭配：nomadic life/lifestyle（游牧生活方式）、nomadic people/tribes（游牧民族/部落）、nomadic herders（游牧牧民）、nomadic existence（漂泊的生活）。相关词：migrate（迁徙）、itinerant（巡回的/流动的，更强调工作性质）。"]}
{"word":"nomadical","summary":{"en":"Nomadical means nomadic—moving from place to place without a permanent home.","zh":"nomadical 意为“游牧的/居无定所的”，相当于更常见的 nomadic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living like a nomad; moving from place to place rather than staying permanently in one location.","zh":"游牧的；居无定所、四处迁徙的。"},"examples":[{"en":"They lived a nomadical life, moving with the seasons to find water and grass.","zh":"他们过着游牧生活，随着季节迁徙寻找水源和草场。"},{"en":"After college, she had a nomadical year, working short jobs in different cities.","zh":"大学毕业后，她过了一年居无定所的生活，在不同城市做短期工作。"},{"en":"The group followed a nomadical route across the desert.","zh":"这支队伍沿着一条游牧路线穿越沙漠。"}]}],"synonyms":["nomadic","migratory","wandering","roving"],"phonetic":"/noʊˈmædɪkəl/","extraExplanation":["“nomadical”是“nomadic”的较少见（有时显得偏古旧或书面）的变体。现代英语里更常用“nomadic”。两者意思基本相同。","词根来自“nomad”（游牧民）。在文学或历史语境中，你可能会看到“nomadical tribes / life”等搭配，用来强调长期迁徙的生活方式。"]}
{"word":"nomadically","summary":{"en":"Nomadically means living, working, or moving from place to place without a permanent home or fixed base.","zh":"nomadically 指以游牧/漂泊的方式生活、工作或行动，不长期固定在一个地方。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that involves living or moving from place to place, rather than staying in one permanent home","zh":"以游牧的方式；指不固定居住、在不同地方之间迁移地生活或行动"},"examples":[{"en":"After college, she lived nomadically, spending a few months in each country.","zh":"大学毕业后，她过着游牧般的生活，在每个国家住上几个月。"},{"en":"He worked nomadically, taking short-term jobs wherever he could find them.","zh":"他以四处漂泊的方式工作，哪里有短期工作就去哪里。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a way that is flexible and not tied to one fixed place (often describing work or lifestyle)","zh":"以不受固定地点限制的方式（常用于形容工作或生活方式的灵活流动）"},"examples":[{"en":"Many designers now collaborate nomadically, meeting clients online and traveling frequently.","zh":"如今许多设计师以“地点不绑定”的方式合作：线上见客户，同时经常旅行。"},{"en":"The team operated nomadically during the project, using coworking spaces in different cities.","zh":"项目期间团队以“游走式”方式运作，在不同城市使用共享办公空间。"}]}],"synonyms":["itinerantly","roamingly","migratorily","peripatetically"],"phonetic":"/noʊˈmædɪkli/","extraExplanation":["“nomadically”来自“nomadic（游牧的）+ -ally（以……方式）”。现代语境里它常和“digital nomad（数字游民）”等概念一起出现，强调工作/生活可以随地点移动。","学习提示：它通常修饰动词（live/work/travel/operate），语气偏书面或描述性；日常口语里也常用“move around a lot（经常搬来搬去）”“travel for work（因工作常出差）”来表达类似意思。"]}
{"word":"nomadidae","summary":{"en":"Nomadidae is a rare scientific name sometimes used for cuckoo bees (related to Nomada), but it’s uncommon in modern English taxonomy.","zh":"Nomadidae 是一个较少见的科学分类名称，有时指与 Nomada 属相关的寄生蜂（杜鹃蜂），但在现代分类中不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (taxonomic) name sometimes used for a group of “cuckoo bees,” especially bees related to the genus Nomada; it is rare in modern English and may be an older or nonstandard form.","zh":"一个有时用于指代“寄生蜂/杜鹃蜂”（尤其与 Nomada 属相关）的科学分类名称；在现代英语中很少见，可能是较旧或不规范的用法。"},"examples":[{"en":"Some older sources refer to cuckoo bees as “Nomadidae,” but many modern classifications use Nomadinae instead.","zh":"一些较旧的资料把杜鹃蜂称为“Nomadidae”，但许多现代分类更常用 Nomadinae。"},{"en":"If you see “Nomadidae” in a text, check whether the author is discussing the genus Nomada or cuckoo bees more generally.","zh":"如果你在文章里看到“Nomadidae”，可以确认作者是在讨论 Nomada 属，还是更广义的寄生蜂。"}]}],"synonyms":["Nomadinae (common modern term)","cuckoo bees (common name)"],"phonetic":"/noʊˈmædɪdiː/","extraExplanation":["“Nomadidae”并不是日常英语词汇，更多出现在昆虫学/分类学语境中；不同年代或不同分类体系可能会用不同层级（科/亚科）来命名。","与之相关的更常见术语包括：Nomada（一个寄生蜂属名）、Nomadinae（常见的分类名称，通常译为“杜鹃蜂亚科/寄生蜂类”）。如果你是在查某篇论文或图鉴，建议对照该书/数据库采用的分类体系。"]}
{"word":"nomadise","summary":{"en":"Nomadise means to live or travel like a nomad, moving from place to place without a permanent home.","zh":"Nomadise 指像游牧民一样生活或旅行，在没有固定住所的情况下不断迁移。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to live, travel, or move around in the way a nomad does; to have no fixed home for a period of time","zh":"像游牧民一样生活、旅行或迁徙；在一段时间内没有固定住所"},"examples":[{"en":"After college, she nomadised across South America for six months.","zh":"大学毕业后，她在南美游牧式旅行了六个月。"},{"en":"Some families nomadise seasonally, following temporary work opportunities.","zh":"有些家庭会随季节游牧式迁移，追随临时工作的机会。"},{"en":"The characters nomadise through deserts and small towns, always searching for safety.","zh":"故事中的人物在沙漠和小镇间游走漂泊，一直在寻找安全之所。"}]}],"synonyms":["nomadize","roam","wander","travel around","move from place to place"],"phonetic":"/ˈnoʊməˌdaɪz/","extraExplanation":["“nomadise”更常见的美式拼写是“nomadize”。两者意思相同；英式英语里常见“-ise”，美式英语里常见“-ize”。","这是相对不常用的动词，更常见的表达有：“live as a nomad”“travel around”“move from place to place”。"]}
{"word":"nomadism","summary":{"en":"Nomadism is a way of life based on moving from place to place rather than settling permanently, traditionally tied to herding and seasons, and sometimes used more broadly for modern constant-travel lifestyles.","zh":"Nomadism 指不长期定居、不断迁徙的生活方式，传统上多与放牧和季节迁移相关，也可引申指现代频繁旅行的流动生活形态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a way of life in which people move from place to place rather than living permanently in one location (often following animals, seasons, or work)","zh":"游牧生活；游牧制（人们不长期定居，而是随着动物、季节或工作需要不断迁徙的生活方式）"},"examples":[{"en":"Nomadism has been practiced in desert regions for centuries.","zh":"几个世纪以来，沙漠地区一直有人实行游牧生活。"},{"en":"As climate patterns changed, some communities shifted from farming to nomadism.","zh":"随着气候模式变化，一些社区从务农转向游牧生活。"},{"en":"The documentary explores nomadism and how families keep traditions alive while traveling.","zh":"这部纪录片探讨了游牧生活，以及家庭如何在迁徙中延续传统。"}]},{"partOfSpeech":"n.","definition":{"en":"a broader pattern of frequent movement without long-term settlement, including modern lifestyles that involve constant travel","zh":"（引申）流动生活方式；频繁迁移的生活形态（也可指现代人长期旅行、难以长期定居的生活）"},"examples":[{"en":"Digital nomadism is a modern form of nomadism made possible by remote work.","zh":"“数字游牧”是远程工作促成的一种现代游牧生活形式。"},{"en":"Some writers argue that urban nomadism is becoming more common among young professionals.","zh":"一些作家认为，“城市游牧”在年轻职场人中越来越常见。"}]}],"synonyms":["nomadic life","itinerant lifestyle","migratory way of life","transhumance"],"phonetic":"/ˈnoʊ.məˌdɪz.əm/","extraExplanation":["词源：nomadism 来自 nomad（游牧民），而 nomad 源于希腊语 nomas，意为“放牧的人”。因此它常与“牧业/放牧”“季节性迁徙”联系在一起。","使用提示：nomadism 是抽象名词，强调“生活方式/制度”。描述某个群体时更常说 nomadic people（游牧民族/游牧人），描述生活方式可说 a nomadic lifestyle（游牧式生活）。","文化语境：人类学与历史语境中，nomadism 常指传统游牧（如逐水草而居的牧民）；当代媒体语境中也会延伸到“数字游牧”等新概念，但两者的社会结构与经济基础差别很大，需结合上下文理解。"]}
{"word":"nomadisms","summary":{"en":"“Nomadisms” is the plural of “nomadism,” meaning multiple forms of nomadic life or, figuratively, a habit of moving often and not settling down.","zh":"“nomadisms”是“nomadism”的复数，可指多种游牧生活形态；也可比喻频繁迁移、难以安定的习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ways of life or cultural practices that involve moving from place to place rather than living permanently in one location; forms of nomadism (plural).","zh":"以迁徙为主、不过固定定居的生活方式或文化实践；“游牧生活/游牧主义”的多种形式（复数）。"},"examples":[{"en":"Different nomadisms developed in response to climate and resources.","zh":"不同的游牧形态是为了适应气候与资源条件而发展出来的。"},{"en":"The museum exhibit compared desert nomadisms with steppe nomadisms.","zh":"博物馆展览对比了沙漠游牧与草原游牧等不同形态。"}]},{"partOfSpeech":"n.","definition":{"en":"A pattern or habit of frequently moving, changing places, or not settling down (often used figuratively).","zh":"经常迁移、频繁更换地点、难以安定下来的习惯或模式（常用于比喻）。"},"examples":[{"en":"His nomadisms made it hard to keep close friendships.","zh":"他总是四处奔波的习惯让维系亲密友谊变得困难。"},{"en":"In her twenties, she enjoyed the nomadisms of short-term jobs in different cities.","zh":"二十多岁时，她享受在不同城市做短期工作的“流动生活”。"}]}],"synonyms":["nomadic lifestyles","migratory ways of life","itinerancy","wandering"],"phonetic":"/ˈnoʊmædɪzəmz/","extraExplanation":["“nomadisms”是“nomadism”的复数形式，常见于学术写作，用来强调“多种类型/多种地区的游牧形态”，比单数更有“分类、比较”的语气。","词源来自希腊语 *nomás*（意为“游牧的人”），在英语里既可指传统的游牧社会（如逐水草而居），也可引申到现代语境（如频繁迁居、工作地点不断变化）。"]}
{"word":"nomadization","summary":{"en":"Nomadization means the process or trend of becoming nomadic—living or working in a more mobile, less settled way.","zh":"Nomadization 指“游牧化”：变得更游牧、更流动、较少定居的过程或趋势。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming nomadic (moving from place to place rather than living permanently in one location)","zh":"游牧化；变得游牧（不在固定地点长期定居、而是不断迁移）的过程"},"examples":[{"en":"Climate change and conflict have accelerated nomadization in some regions.","zh":"气候变化与冲突在一些地区加速了游牧化。"},{"en":"Some researchers discuss the nomadization of labor as people move frequently for short-term jobs.","zh":"一些研究者讨论“劳动力的游牧化”，指人们为短期工作而频繁迁移。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in modern contexts) the trend of organizing life or work around mobility, such as remote work that enables frequent travel","zh":"（现代语境常用）围绕“流动性”来安排生活或工作的趋势，例如远程工作让人们能够经常旅行与迁居"},"examples":[{"en":"Remote work has contributed to the nomadization of certain industries.","zh":"远程工作推动了某些行业的“游牧化”。"},{"en":"The nomadization of professional life can be exciting, but it may also reduce stability.","zh":"职业生活的游牧化可能令人兴奋，但也可能降低稳定性。"}]}],"synonyms":["nomadism","mobilization","increased mobility","itinerancy","roaming"],"phonetic":"/ˌnoʊmædaɪˈzeɪʃən/","extraExplanation":["“nomadization”不是最常见的日常词，更常见的是“nomadism（游牧生活/游牧制度）”或“becoming nomadic（变得游牧/更流动）”。","构词上：nomad（游牧民/游牧的）+ -ize（使……化/变成……）+ -ation（过程/结果）。因此它强调“变化的过程”。","现代写作里常见搭配有“nomadization of work/labor（工作/劳动力的游牧化）”、“digital nomadization（数字游牧化）”，多用于社会学、经济学或趋势分析语境。"]}
{"word":"nomadize","summary":{"en":"Nomadize means to live or move around like a nomad, or to make someone/something more nomadic.","zh":"Nomadize 指像游牧民一样四处迁徙生活；也可指使某人/某事变得更“游牧化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to live or move around like a nomad; to travel from place to place without a fixed home","zh":"像游牧民一样生活或迁徙；没有固定住所地四处移动"},"examples":[{"en":"After college, she nomadized for a year, working short jobs in different cities.","zh":"大学毕业后，她“游牧式”生活了一年，在不同城市做短期工作。"},{"en":"Some artists nomadize to find new ideas and communities.","zh":"一些艺术家会四处漂泊，以寻找新的灵感和社群。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something or someone more nomadic; to cause to move around frequently","zh":"使……更游牧化；使……频繁迁移"},"examples":[{"en":"Remote work has nomadized parts of the tech workforce.","zh":"远程办公让一部分科技行业员工变得更“游牧”。"},{"en":"Economic pressure nomadized the family, forcing them to relocate often.","zh":"经济压力迫使这家人频繁搬迁，过上更漂泊的生活。"}]}],"synonyms":["wander","roam","travel","drift","become nomadic","lead a nomadic life"],"phonetic":"/ˈnoʊ.mə.daɪz/","extraExplanation":["“nomadize”在日常英语中不算常见，更常见的说法是“live a nomadic life（过游牧式生活）”或“become nomadic（变得游牧/漂泊）”。在现代语境里，它也常被用来形容“数字游民（digital nomads）”那种一边远程工作一边旅行的生活方式。","词根来自“nomad（游牧民）”。后缀“-ize”常表示“使变成……/变得……”，所以“nomadize”可以理解为“变得像游牧民一样”或“使……游牧化”。"]}
{"word":"nomads","summary":{"en":"Nomads are people who do not stay in one place and move regularly, often for resources or lifestyle reasons.","zh":"Nomads 指不长期定居、会经常迁徙的人，可能为了资源（如草场水源）或出于生活方式选择。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who move from place to place rather than living permanently in one location, often following seasonal food, water, work, or grazing land.","zh":"游牧民；居无定所、经常迁徙的人（常为寻找季节性的食物、水源、工作或牧场而移动）。"},"examples":[{"en":"In the past, many nomads traveled with their animals to find fresh grass and water.","zh":"过去，许多游牧民会带着牲畜迁徙，以寻找新鲜的草场和水源。"},{"en":"Some modern nomads work online and live in different countries throughout the year.","zh":"一些现代的“游牧族”通过网络工作，一年里住在不同国家。"}]}],"synonyms":["migrants","wanderers","travelers"],"phonetic":"/ˈnoʊ.mædz/","extraExplanation":["“nomads”是“nomad”的复数。现在也常见引申用法，如“digital nomads（数字游民）”，指依靠互联网远程工作、频繁更换居住地的人。注意它通常描述一种生活方式，不一定等同于“流浪者（homeless person）”。"]}
{"word":"nomancy","summary":{"en":"Nomancy is fortune-telling based on interpreting names or words.","zh":"Nomancy 指通过解读名字或词语来进行占卜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"divination (fortune-telling) based on names, words, or letters—interpreting them as signs of a person’s character, destiny, or future.","zh":"以名字、词语或字母来占卜（算命）——把它们解读为一个人的性格、命运或未来的征兆。"},"examples":[{"en":"In the story, the seer practices nomancy by reading meaning into the hero’s name.","zh":"在故事里，这位先知用“名占”（nomancy）从英雄的名字中读出寓意。"},{"en":"Some people treat baby-name books like nomancy, believing a name can shape a child’s fate.","zh":"有些人把取名书当成一种“名占”，相信名字会影响孩子的命运。"}]}],"synonyms":["onomancy","name divination","divination"],"phonetic":"ˈnoʊmænsi","extraExplanation":["“nomancy”较少见，更常见的相关词是“onomancy”（也写作 onomancy），意思同样是“通过名字占卜”。","词尾“-mancy”来自希腊语 *manteia*（占卜），常见于如 *chiromancy*（手相/掌纹占卜）、*necromancy*（亡灵占卜）等词。"]}
{"word":"nomap","summary":{"en":"“nomap” most often means “no map” (not using navigation), and in tech it can mean “do not map/link.”","zh":"“nomap”多指“no map”（不用地图/导航）；在技术语境中也可指“不要映射/不要建立对应关系”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, often written as “no map”) without a map; not using a map or GPS/navigation.","zh":"（非正式，常写作“no map”）没有地图的；不使用地图或导航的。"},"examples":[{"en":"We went hiking nomap and got lost for a bit.","zh":"我们徒步时没用地图，结果迷路了一会儿。"},{"en":"It’s a nomap trip—no GPS, just follow the signs.","zh":"这是一次“不用地图”的旅行——不用GPS，只看路标。"}]},{"partOfSpeech":"other","definition":{"en":"(computing/tech) a label or setting meaning “do not map” (do not link one thing to another), for example in configuration, data fields, or memory mapping.","zh":"（计算机/技术）表示“不要映射/不要建立对应关系”的标签或设置，例如在配置、数据字段或内存映射中。"},"examples":[{"en":"Set this field to nomap so it won’t be linked to the database column.","zh":"把这个字段设为nomap，这样它就不会和数据库列建立对应关系。"},{"en":"The device boots with a nomap option to avoid mapping that region.","zh":"设备用nomap选项启动，以避免映射那个区域。"}]}],"synonyms":["no map","mapless","unmapped","do not map"],"phonetic":"/noʊ mæp/","extraExplanation":["“nomap”不是一个非常标准的通用英语单词，更常见的写法是分开写成“no map”。在网络语境里，人们有时会把两个词合在一起当作标签、文件名、参数名或配置项使用。","如果你是在某个具体软件/游戏/系统里看到“nomap”，它的精确含义通常由该产品的文档规定；最常见的两类意思就是“没有地图/不用导航”和“不要做映射（不要建立对应关系）”。"]}
{"word":"nomarch","summary":{"en":"A nomarch was a governor of an ancient Egyptian province (a nome).","zh":"nomarch 指古埃及一个行政区（nome/诺姆）的地方总督。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A provincial governor in ancient Egypt (especially during the Old and Middle Kingdoms), in charge of a district called a nome.","zh":"（古埃及的）州长/地方总督，负责管理一个称为“诺姆（nome）”的行政区（尤指古王国与中王国时期）。"},"examples":[{"en":"The nomarch collected taxes and organized labor for local building projects.","zh":"这位州长负责征税，并组织劳役来进行当地的建筑工程。"},{"en":"Some nomarchs became powerful enough to challenge the pharaoh’s control.","zh":"有些地方总督强大到足以挑战法老的中央控制。"}]}],"synonyms":["provincial governor","district governor"],"phonetic":"/ˈnoʊmɑrk/","extraExplanation":["词源与构词：nomarch 来自希腊语，nome（地区/行政区）+ -arch（统治者/首领，如 monarch 君主、patriarch 族长）。英语里它主要用在历史、考古和埃及学语境中。","背景补充：在古埃及，“nome”是重要的地方行政单位；当中央权力减弱时，部分 nomarch 会逐渐世袭化并扩大地方自治，这也是理解古埃及政治起伏的一个关键点。"]}
{"word":"nomarchies","summary":{"en":"“Nomarchies” means multiple nomarchies—districts ruled by nomarchs, especially in ancient Egypt (and sometimes historically in Greece).","zh":"“Nomarchies”指多个“nomarchy（行政区）”，即由 nomarch（地方总督）统治的地区，尤用于古埃及史（有时也用于希腊历史语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nomarchy”: an administrative district governed by a nomarch (a local governor), especially in ancient Egypt; also used historically for Greek prefecture-level regions (nomoi).","zh":"“nomarchy”的复数：由“nomarch（地方总督）”管理的行政区，尤指古埃及的行政区；也可指历史上希腊的“州/县级”行政区（nomos 的复数 nomoi）。"},"examples":[{"en":"Some historians compare the power of different nomarchies in ancient Egypt.","zh":"一些历史学家会比较古埃及不同“nomarchies（行政区）”的权力。"},{"en":"The reform changed how many nomarchies existed and how they were governed.","zh":"这次改革改变了“nomarchies（行政区）”的数量和治理方式。"}]}],"synonyms":["administrative districts","provinces","prefectures (historical)"],"phonetic":"/ˈnoʊmɑrˌkiz/","extraExplanation":["“Nomarchy / nomarch”常见于古埃及史研究：nomarch 是管理一个“nome（州/区）”的官员；因此 nomarchy 指该官员管辖的行政区或其行政体系。","在近现代希腊语境里，nomos（复数 nomoi）曾相当于“prefecture（省/州下一级行政区）”。英语里有时也用 nomarchy 来指这类“州/县级行政区”（现今希腊行政区划已多次调整）。","词根提示：nomo- 与希腊语“nomos（区/法）”有关，-archy 表“统治/管理”（如 monarchy 君主制）。看到 nomarchy 可联想到“某一区域的治理体系”。"]}
{"word":"nomarchs","summary":{"en":"Nomarchs were governors who ruled provinces (nomes) in ancient Egypt.","zh":"Nomarchs 指古埃及各个州/省（nome）的地方总督。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Officials (governors) who ruled a nome (province) in ancient Egypt; singular: nomarch.","zh":"（古埃及）州/省（nome）的地方长官、总督；单数：nomarch。"},"examples":[{"en":"The nomarchs collected taxes and maintained order in their provinces.","zh":"这些地方总督在各自的省份征税并维持秩序。"},{"en":"During periods of weak central power, nomarchs could become almost independent rulers.","zh":"在中央政权薄弱的时期，地方总督有时几乎会成为独立的统治者。"}]}],"synonyms":["provincial governors","regional rulers","local governors"],"phonetic":"/ˈnoʊmɑrks/","extraExplanation":["“nomarch”来自希腊语：nomos（行政区、地区）+ arch-（统治、掌权）。现代历史写作常用该词来指古埃及“nome”的地方统治者。","“nomarchs”在英文中多见于历史、考古、埃及学（Egyptology）语境，日常英语里很少用。"]}
{"word":"nomarchy","summary":{"en":"Nomarchy most commonly means a Greek prefecture (an administrative district). More rarely, it can mean a system of government based on law.","zh":"Nomarchy 通常指希腊的州/县级行政区（旧称 prefecture）。较少见时也可指以法律为核心的治理体制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prefecture (administrative district) in Greece; historically, one of the country’s main local government divisions.","zh":"（希腊的）州/县级行政区（旧制常译为“省/专区”，相当于 prefecture）。"},"examples":[{"en":"He worked in the nomarchy office in Thessaloniki before moving to Athens.","zh":"他在塞萨洛尼基的州级行政机关工作过，后来搬到雅典。"},{"en":"Tourism policies were coordinated at the level of the nomarchy.","zh":"旅游政策在州级行政区层面进行协调。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a system of government in which social order is based strictly on law; “rule by law.”","zh":"（罕见）以法律为核心的治理体系；“法治/依法治理”（强调由法律来统摄秩序）。"},"examples":[{"en":"Some writers use “nomarchy” to describe an ideal society governed entirely by clear laws.","zh":"有些作者用“nomarchy”来指一种完全由明确法律来治理的理想社会。"},{"en":"In this essay, nomarchy is contrasted with arbitrary rule.","zh":"在这篇文章中，nomarchy 与专断统治形成对比。"}]}],"synonyms":["prefecture (Greek context)","administrative district","(rare) rule of law"],"phonetic":"/ˈnɑːmɑːrki/","extraExplanation":["“Nomarchy”来自希腊语词根：nomos（νόμος，“法律/地区”）+ -archy（“统治/体制”）。因此它既可指“行政区（nomos 的延伸义）”，也可指“以法律为基础的统治”。","在现代希腊行政区划中，nomarchy（希腊语：nomarchia）常被译作“prefecture”。2011年前后希腊行政改革后，这一层级的设置和名称有较大变化，所以在较新的资料中可能会见到不同的对应译法。","相关词：nomarch（行政长官/州长一类的职位名，较旧用法）。"]}
{"word":"nomarthra","summary":{"en":"“nomarthra” does not appear to be a standard English word; it’s likely a typo or a proper name.","zh":"“nomarthra”不像标准英语词汇，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username, or a proper name.","zh":"不是标准英语单词，可能是拼写错误、用户名或专有名词（人名/地名等）。"},"examples":[{"en":"I couldn’t find “nomarthra” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里找不到“nomarthra”——它会不会是人名或拼写错了？"},{"en":"If you tell me the sentence where you saw “nomarthra,” I can guess the intended word.","zh":"如果你把看到“nomarthra”的句子发我，我可以帮你推测原本想写的词。"}]}],"phonetic":"/noʊˈmɑrθrə/","extraExplanation":["我无法把“nomarthra”对应到常见英语词汇。它看起来更像：①拼写错误；②账号/网名；③人名或作品中的专有名词。","你可以提供更多信息让我更准确：你在哪看到的（句子/段落/截图）？是想查发音、意思，还是想确认拼写？","如果你是想输入某个接近的词，也可以告诉我你想表达的中文意思（例如“没有……/规范/咒语/数学相关”等），我可以给出可能的英文候选词。"]}
{"word":"nomarthral","summary":{"en":"“nomarthral” is not recognized as a standard English word; it’s likely a misspelling.","zh":"“nomarthral”不是标准英文词，可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or an OCR/typing error.","zh":"不是标准英文单词，可能是拼写错误或识别/输入错误。"},"examples":[{"en":"I couldn’t find “nomarthral” in a dictionary—could you share the sentence you saw it in?","zh":"我在词典里查不到“nomarthral”，你能提供它出现的句子吗？"},{"en":"If you meant “nonmarital,” it describes something not related to marriage.","zh":"如果你想写的是“nonmarital”，它表示“非婚姻相关的”。"}]}],"extraExplanation":["从字形来看，你可能想输入以下词之一（取决于上下文）：\n1) nonmarital（非婚姻的/非婚内的）\n2) arthral / arthralgia（与关节疼痛有关；arthralgia=关节痛）\n3) monarthral（较少见，通常与“单个关节”相关的医学构词）\n\n如果你把原句或原文截图发我，我可以更准确地判断并给出对应释义与用法。"]}
{"word":"nomas","summary":{"en":"“Nomas / no más” is a Spanish-based expression meaning “no more/stop,” and informally can mean “just/only.”","zh":"“nomas / no más”源自西班牙语，常表示“不要了/别再继续”，口语里也可表示“只是/仅仅”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(from Spanish) “No more!”; “Stop!” used as an exclamation to tell someone to stop doing something.","zh":"（源自西班牙语）“不要了 / 不要再这样了！”“停下！”用作感叹，表示让人停止某个动作。"},"examples":[{"en":"No más—please stop hitting me.","zh":"不要了——请别再打我了。"},{"en":"She raised her hand and said, “No más.”","zh":"她举起手说：“不要了。”"}]},{"partOfSpeech":"adv.","definition":{"en":"(informal, influenced by Mexican Spanish “nomás”) just; only; simply—used to soften a request or say something is small/easy.","zh":"（非正式，受墨西哥西语“nomás”影响）只是；仅仅；就——常用于弱化语气，表示“就这样/不麻烦”。"},"examples":[{"en":"I’m just asking, no más.","zh":"我就问问而已。"},{"en":"It’s no más a minute from here.","zh":"离这儿就一分钟。"}]}],"synonyms":["stop","no more","enough","just","only"],"phonetic":"/noʊ ˈmɑs/","extraExplanation":["“No más”在西班牙语里字面意思是“没有更多/不再”，常用于表达“够了、别再继续”。在英语对话中多出现在与西语文化接触较多的地区或语境里。","写法上更常见的是分开写“no más”；不加重音符号写成“nomas”也能看到，但更口语、更不规范。","注意它不等于英语的“nomads（游牧民）”或其他相似拼写。"]}
{"word":"nombles","summary":{"en":"Numbles (also spelled nombles in old texts) is an archaic plural noun meaning the edible entrails of a deer, sometimes used more generally for offal.","zh":"Numbles（古文中也可能写作 nombles）是一个古语复数名词，指鹿的可食用内脏（下水），有时也泛指内脏/下水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, plural) The edible internal organs (especially the entrails) of a deer, traditionally used for cooking.","zh":"（古语，复数）鹿的可食用内脏（尤指肠子等下水），传统上可用来烹饪。"},"examples":[{"en":"In medieval recipes, numbles were often baked into a rich pie.","zh":"在中世纪食谱里，numbles 常被烤进浓郁的馅饼里。"},{"en":"The old hunting feast included roasted venison and numbles.","zh":"那场古老的狩猎宴席里有烤鹿肉和鹿内脏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, humorous) Entrails or offal in general.","zh":"（少见/幽默）泛指内脏、下水。"},"examples":[{"en":"He joked that the stew was made of “numbles and luck.”","zh":"他开玩笑说这锅炖汤是用“下水和运气”做的。"}]}],"synonyms":["offal","entrails","innards"],"phonetic":"/ˈnʌmbəlz/","extraExplanation":["你输入的 **nombles** 很可能是 **numbles** 的旧式拼写变体（在早期英语里拼写不固定，m/n 及元音也常变化）。","**numbles/umbles** 在英国中世纪与狩猎文化有关：猎物的“好肉”给贵族，“内脏下水”常给仆人或地位较低的人。","它也常被拿来解释短语 **eat humble pie** 的民间来源：据说 *umble pie*（用鹿下水做的馅饼）与 *humble*（谦卑）在发音上相近，后来演变出“低头认错、吞下自尊”的意思。"]}
{"word":"Nombre","summary":{"en":"“Nombre” means “name” in Spanish; in English it’s sometimes borrowed in Spanish-related or playful contexts.","zh":"“Nombre”在西班牙语里是“名字”；在英语中偶尔作为借词出现，多用于西语相关或带玩笑语气的场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a person’s name; used in English mainly in Spanish contexts or humorously.","zh":"（西班牙语）名字；在英语中多用于西语语境，或带一点幽默/西南风格的说法。"},"examples":[{"en":"What’s your nombre?","zh":"你叫什么名字？"},{"en":"His nombre is Carlos, but in English he goes by Charlie.","zh":"他名字叫Carlos，但在英语里他用Charlie这个名字。"},{"en":"Write your nombre at the top of the form.","zh":"把你的名字写在表格顶部。"}]}],"synonyms":["name","moniker","designation"],"phonetic":"/ˈnɑm.breɪ/","extraExplanation":["“Nombre”在标准英语里通常会直接说“name”。在美国西南部（如加州、德州）或涉及拉美文化的场景中，人们可能会借用“nombre”来营造西语氛围，语气有时偏口语、俏皮。正式写作中建议用“name”。"]}
{"word":"nombril","summary":{"en":"Nombril means “navel” (belly button), a French loanword occasionally used in English.","zh":"Nombril 指“肚脐/肚脐眼”，是偶尔在英语中借用的法语词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the navel; belly button (a French word sometimes used in English, usually for style or humor).","zh":"肚脐；肚脐眼（法语词，英语中偶尔借用，多用于文艺、幽默或刻意的语气）。"},"examples":[{"en":"The novel jokes about a character staring at his nombril all day.","zh":"小说开玩笑写一个角色整天盯着自己的肚脐看。"},{"en":"In French class, we learned that nombril means “navel.”","zh":"在法语课上，我们学到 nombril 的意思是“肚脐”。"}]}],"synonyms":["navel","belly button"],"phonetic":"/ˈnɑm.brɪl/","extraExplanation":["Nombril 是法语“肚脐”。英语里偶尔会直接借用这个词，常带一点文艺腔或调侃意味。","它也常出现在“navel-gazing（自我沉溺/过度自省）”相关的语境中；法语里有 nombrilisme，指过度自我关注（类似“自恋式内省”）。"]}
{"word":"nombrils","summary":{"en":"Nombrils = (French plural) navels/belly buttons.","zh":"Nombrils =（法语复数）肚脐/肚脐眼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) the navel; belly button. “Nombrils” is the plural form.","zh":"（法语）肚脐；肚脐眼。“nombrils”是复数形式。"},"examples":[{"en":"The designer created tops that highlight the nombril.","zh":"这位设计师设计了突出肚脐的上衣。"},{"en":"Babies’ nombrils need gentle cleaning until they heal.","zh":"婴儿的肚脐在愈合前需要温和清洁。"}]}],"synonyms":["navel","belly button"],"phonetic":"/nɑ̃ˈbɹil/","extraExplanation":["“nombril”是法语里最常见的“肚脐”说法；英语里更常用 navel 或 belly button。你看到“nombrils”通常表示“多个肚脐”，例如医学、育儿护理或服装/时尚语境中。"]}
{"word":"nome","summary":{"en":"“Nome” is mainly used as a place name: the city of Nome in Alaska. In English, “nome” is not a common everyday word.","zh":"“Nome”主要作为地名使用：阿拉斯加的诺姆市。在英语中，“nome”不是常见的日常词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a city in western Alaska, U.S., on the Seward Peninsula (often known for its Gold Rush history).","zh":"美国阿拉斯加州西部、位于苏厄德半岛的一座城市（常因淘金热历史而知名）。"},"examples":[{"en":"She flew to Nome, Alaska, to see the northern lights.","zh":"她飞到阿拉斯加的诺姆（Nome）去看北极光。"},{"en":"Nome became famous during the Alaskan Gold Rush.","zh":"诺姆（Nome）在阿拉斯加淘金热期间变得很有名。"}]}],"synonyms":["(for the place) Nome, Alaska"],"phonetic":"/noʊm/","extraExplanation":["在现代英语里，**nome**一般不作为普通词使用，最常见是专有名词 **Nome**（地名）。","如果你想表达“小精灵/地精”，英语通常拼作 **gnome**（/noʊm/），开头的 **g** 不发音。","如果你是在学葡萄牙语/意大利语，**nome** 在那些语言里常表示“名字（name）”，但这不是英语用法。"]}
{"word":"nomeidae","summary":{"en":"Nomeidae is the scientific family name for driftfishes and related ocean fish.","zh":"Nomeidae 是漂流鱼及其近缘远洋鱼类的科学“科”名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine ray-finned fishes known as driftfishes (and related species), found in open-ocean waters.","zh":"一种海洋辐鳍鱼类的科名，常称为“漂流鱼科”（及其近缘种），多生活在远洋海域。"},"examples":[{"en":"Driftfishes belong to the family Nomeidae.","zh":"漂流鱼属于漂流鱼科（Nomeidae）。"},{"en":"Some Nomeidae species are found in warm, open-ocean waters.","zh":"一些漂流鱼科物种分布在温暖的远洋海域。"}]}],"synonyms":["driftfish family"],"phonetic":"/noʊˈmiːɪdiː/","extraExplanation":["“Nomeidae”是生物分类学中的“科（family）”名，常见于科学写作与鱼类图鉴中，而不太用于日常英语对话。","英语里常把该科的成员叫作 driftfish（漂流鱼）。科学名称多源自拉丁化的命名体系，因此拼写与读音可能不符合常见英语构词规律。"]}
{"word":"nomen","summary":{"en":"“Nomen” is a formal/Latin-based word meaning “name,” also used in taxonomy and in discussions of ancient Roman naming.","zh":"“nomen”是源自拉丁语的较正式用词，意为“名字/名称”，也用于生物分类命名及古罗马姓名体系的讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name; a term used to refer to a person, place, or thing (often used in scholarly or formal contexts).","zh":"名字；名称（常见于学术或较正式语境）。"},"examples":[{"en":"In Latin, “nomen” means “name.”","zh":"在拉丁语里，“nomen”意思是“名字”。"},{"en":"The author chose a pen name as her public nomen.","zh":"作者选择了一个笔名作为她对外的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology, taxonomy) the name part in scientific naming, especially the genus name in binomial nomenclature (usage varies by context).","zh":"（生物分类学）学名中的名称部分，常指双名法中的属名（具体用法随语境而变）。"},"examples":[{"en":"In binomial names, the genus is written first and functions as a key nomen.","zh":"在双名法中，属名写在前面，是关键的名称部分。"},{"en":"Students practiced writing each species with the correct nomen and species epithet.","zh":"学生练习用正确的属名和种加词来书写每个物种。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) in ancient Rome, a person’s family/clan name, used as part of a Roman citizen’s full name.","zh":"（历史）古罗马人姓名中的家族名/氏族名，是完整姓名的一部分。"},"examples":[{"en":"In many Roman names, the nomen identified the larger family group.","zh":"在许多罗马姓名中，nomen用来标识更大的家族/氏族群体。"},{"en":"Understanding praenomen, nomen, and cognomen helps you read Roman history.","zh":"理解praenomen、nomen和cognomen有助于阅读古罗马史。"}]}],"synonyms":["name","designation","appellation","title"],"phonetic":"/ˈnoʊmən/","extraExplanation":["“nomen”是拉丁语词，英语里多出现在学术写作或历史、生物分类等领域；日常英语更常用name。","它也常见于相关词：nomenclature（命名法/术语体系）、nominal（名义上的）、cognomen（古罗马“别名/支系名”）。"]}
{"word":"nomenclate","summary":{"en":"A rare verb meaning “to name; to give a formal name.”","zh":"一个很罕见的动词，意思是“命名；给予正式名称”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To name something; to give it a formal or technical name.","zh":"（罕见）给……命名；为某物取一个正式或技术性的名称。"},"examples":[{"en":"Scientists nomenclate newly discovered species according to agreed rules.","zh":"科学家会按照共同认可的规则为新发现的物种命名。"},{"en":"The committee will nomenclate the parts so everyone uses the same terms.","zh":"委员会将为各部分统一命名，以便大家使用相同术语。"}]}],"synonyms":["name","designate","term","label"],"phonetic":"/noʊˈmɛn.kleɪt/","extraExplanation":["“nomenclate”在现代英语中非常少见，很多时候被视为不常用或不标准的用法。更常见的表达是：**name**（命名）、**designate**（指定/命名）、**term**（把……称为）、或谈“命名体系”时用名词 **nomenclature**（术语体系/命名法）。","词源上与拉丁语 *nomen*（名字）有关，因此含义直观，但在实际写作与考试中建议优先使用更常见的词。"]}
{"word":"nomenclative","summary":{"en":"Nomenclative means “about naming or a naming system.”","zh":"nomenclative 指“与命名或命名体系有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to naming or the system of names used in a subject area; connected with nomenclature.","zh":"与命名有关的；与某一领域的名称体系（术语体系）有关的。"},"examples":[{"en":"The paper includes a nomenclative table of species names.","zh":"这篇论文包含一张物种名称的命名用表格。"},{"en":"There is a nomenclative problem: two different terms are used for the same concept.","zh":"这里有个命名问题：同一个概念用了两个不同的术语。"}]}],"synonyms":["nomenclatural","nomenclatory","naming","terminological"],"phonetic":"/ˌnoʊ.mənˈkleɪ.tɪv/","extraExplanation":["“nomenclative”在现代英语里比较少见，更常用的是“nomenclatural”（尤其在生物学、分类学中）或“nomenclatory”。在学术写作中，如果你想表达“与命名规则/命名体系有关”，通常选“nomenclatural”会更地道。"]}
{"word":"nomenclator","summary":{"en":"Nomenclator is a rare word meaning a name-caller/name-prompter (especially in ancient Rome) or, less commonly, a catalog of names/terms.","zh":"Nomenclator是个少见词，指“报姓名/提醒姓名的人”（尤指古罗马的随从），也可较少见地指“姓名或术语目录”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to announce, call out, or remind someone of names (especially in ancient Rome, an attendant who prompted a politician with people’s names).","zh":"报姓名的人；（尤指古罗马）在政治人物身边提醒他人名的随从。"},"examples":[{"en":"In ancient Rome, a candidate might bring a nomenclator to whisper voters’ names.","zh":"在古罗马，候选人可能会带一个nomenclator在旁边低声提醒选民的名字。"},{"en":"He joked that he needed a nomenclator at networking events because he forgets names easily.","zh":"他开玩笑说自己在社交活动上需要一个nomenclator，因为他很容易忘记名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a list or book of names or terms; a kind of catalog (rare/older use).","zh":"姓名（或术语）目录；名录（较少见/较旧用法）。"},"examples":[{"en":"The library kept a nomenclator of local authors from the 1800s.","zh":"图书馆保存着一份19世纪本地作者的名录（nomenclator）。"},{"en":"The appendix serves as a nomenclator of specialized terms.","zh":"附录起到术语目录（nomenclator）的作用。"}]}],"synonyms":["name prompter","announcer","aide","directory","catalog","list"],"phonetic":"/ˈnoʊməˌkleɪtər/","extraExplanation":["这个词来自拉丁语（与“命名/名称”有关）。在古罗马社会里，nomenclator常被描写为政客的随从：在人群中指认并提醒对方姓名，以便政客显得“记得每个人”，加强人情关系与政治影响力。","现代英语里它非常少见，写作中更多会用 name prompter, aide, or directory / list 来替代。"]}
{"word":"nomenclatorial","summary":{"en":"Nomenclatorial means “connected with a formal naming system or naming rules.”","zh":"nomenclatorial 意为“与正式命名体系或命名规则有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to nomenclature (a system of naming), especially the formal rules or methods used to name things in a field such as biology, chemistry, or law.","zh":"与“命名法/命名体系”有关的；尤指在生物、化学、法律等领域中用于命名事物的正式规则或方法。"},"examples":[{"en":"The paper discusses nomenclatorial rules for naming newly discovered species.","zh":"这篇论文讨论了为新发现物种命名的命名法规则。"},{"en":"There is a nomenclatorial conflict because two groups gave the same name to different compounds.","zh":"出现了命名冲突，因为两个团队给不同的化合物起了相同的名字。"}]}],"synonyms":["nomenclatural","nomenclature-related","terminological"],"phonetic":"/ˌnoʊmənˈkleɪtɔriəl/","extraExplanation":["该词较少见，更常用的说法是“nomenclatural”（更常见于学术写作，意思同样是“与命名法有关的”）。","词源提示：来自拉丁语词根 nomen（名字）+ calare（宣告/叫出），与“nomenclature（命名法）”同源；“-ial”表示“……的”。"]}
{"word":"nomenclatorship","summary":{"en":"A rare word meaning the office/duties of a nomenclator, or (very rarely) the practice of naming or calling out names.","zh":"一个罕见词，指 nomenclator 的职务/职责；也可极少指命名或点名的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) The job, office, or duties of a nomenclator—someone whose role is to provide names (especially a servant in ancient Rome who whispered people’s names to a politician).","zh":"（罕见/旧用）nomenclator 的职务或职责；指负责提供/提醒名字的人之工作（尤其指古罗马为政客低声提醒他人姓名的随从）。"},"examples":[{"en":"In some accounts of Roman elections, a candidate relied on a helper’s nomenclatorship to greet voters by name.","zh":"在一些关于罗马选举的记载中，候选人依赖随从的“nomenclatorship”来按姓名问候选民。"},{"en":"The historian mentions his nomenclatorship as part of the household staff.","zh":"历史学家把他的“nomenclatorship”作为家仆编制的一部分提到。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) The act or practice of naming, listing, or calling out names.","zh":"（很罕见）命名、列出名称或点名的行为/做法。"},"examples":[{"en":"The book’s nomenclatorship is mainly a long list of plants and their Latin names.","zh":"这本书的“nomenclatorship”主要是一长串植物及其拉丁学名。"}]}],"synonyms":["office","role","duty","naming","nomenclature"],"phonetic":"/ˈnoʊmənˌkleɪtərˌʃɪp/","extraExplanation":["这个词极少见，多出现在历史或学术语境里。它由“nomenclator（报名者/提醒姓名的人）+ -ship（表示身份、职位或状态）”构成，含义类似“职务、任期、职责”。","古罗马的 nomenclator 常被描述为政客的随从：在社交或竞选场合提醒政客对方的姓名与身份，以便显得熟络、有礼。现代英语里更常用的表达通常是“naming”“nomenclature”“the office/duties of a nomenclator”。"]}
{"word":"nomenclatory","summary":{"en":"Nomenclatory means “relating to naming systems (nomenclature),” but it is rare; “nomenclatural” is more common.","zh":"nomenclatory 意为“与命名体系（nomenclature）有关”，但较少见；更常见的是 nomenclatural。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) relating to a system of names (nomenclature), especially in science or official classification.","zh":"（少见）与命名体系（nomenclature）有关的，尤指科学或正式分类中的命名。"},"examples":[{"en":"The paper discusses nomenclatory rules for naming newly discovered species.","zh":"这篇论文讨论了为新发现物种命名的命名规则。"},{"en":"There is a nomenclatory debate about whether the drug should be listed under its chemical name or brand name.","zh":"关于该药物应按化学名还是商品名列出，存在一场命名上的争论。"}]}],"synonyms":["nomenclatural","nomenclatural (more common)","related to nomenclature","terminological"],"phonetic":"/ˈnoʊmənˌkleɪtɔri/","extraExplanation":["“nomenclatory”在现代英语中很少见，更常用的表达是“nomenclatural”（更常见于学术写作）或“related to nomenclature”。","词根来源：来自拉丁语 *nomen*（名字）+ *-clature*（与“列名/命名”有关的构词成分）。在生物分类、化学命名、医学术语等领域会遇到相关词汇。"]}
{"word":"nomenclatural","summary":{"en":"Nomenclatural means “about formal naming systems or naming rules,” especially in scientific classification.","zh":"nomenclatural 指“与正式命名体系或命名规则有关”，尤用于科学分类语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to naming systems, especially the formal scientific rules for naming organisms, chemicals, or other classified things.","zh":"与命名体系有关的，尤指生物学、化学等领域中用于命名的正式规则或规范。"},"examples":[{"en":"The paper discusses several nomenclatural changes in the classification of butterflies.","zh":"这篇论文讨论了蝴蝶分类中的若干命名（法）变更。"},{"en":"There is a nomenclatural dispute about which name should be used for the species.","zh":"关于该物种应使用哪个名称，存在一场命名（法）争议。"}]}],"synonyms":["nomenclature-related","taxonomic (in biology)","terminological (broader)"],"phonetic":"/ˌnoʊ.mənˈkleɪ.tʃər.əl/","extraExplanation":["“nomenclatural”常见于学术写作，尤其是分类学（taxonomy）与命名法规（如ICZN动物命名法规、ICN植物/真菌/藻类命名法规）相关语境。它强调“命名规则/规范层面”的问题，而不仅是“名字本身”。","词源上来自拉丁语：nomen（名字）+ -clatura（与“列出/命名的方式”相关），因此带有“按规则命名、列名”的意味。日常英语里较少使用，常用在正式、技术性文本中。"]}
{"word":"nomenclature","summary":{"en":"Nomenclature means a naming system or the set of terms used in a specific field.","zh":"nomenclature 指某一领域的命名体系/命名规则，或该领域使用的一套术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of names (or the rules for naming) used in a particular field, such as science, medicine, or law.","zh":"（某一领域的）命名体系；命名规则（如科学、医学、法律等）"},"examples":[{"en":"Scientific nomenclature helps researchers around the world refer to the same species clearly.","zh":"科学命名法帮助世界各地的研究者清晰地指代同一种物种。"},{"en":"Medical nomenclature can look complex, but it often follows consistent patterns.","zh":"医学术语的命名看起来很复杂，但它通常遵循一致的规律。"}]},{"partOfSpeech":"n.","definition":{"en":"The set of names/terms used in a particular group, organization, or context.","zh":"（某个群体/组织/语境中使用的）一套名称或术语"},"examples":[{"en":"The company changed its product nomenclature to make the models easier to understand.","zh":"公司更改了产品命名体系，让各个型号更容易理解。"},{"en":"In this course, you’ll learn the basic nomenclature of economics.","zh":"在这门课里，你将学习经济学的基础术语体系。"}]}],"synonyms":["terminology","naming system","designation","taxonomy (related, not identical)"],"phonetic":"/ˈnoʊmənˌkleɪtʃɚ/","extraExplanation":["词源上来自拉丁语 *nomen*（名字）+ *-clature*（与“称呼/命名”相关）。因此它强调的不是“单个名字”，而是“命名的整套规则或一整套术语”。","常见搭配：*standardized nomenclature*（标准化命名法）、*nomenclature system*（命名系统）、*taxonomy and nomenclature*（分类与命名）。注意它常用于更正式/学术的语境，比 *names* 或 *terms* 更“系统化”。"]}
{"word":"nomenclatures","summary":{"en":"Nomenclatures means naming systems or sets of terms used in particular fields; it is the plural of nomenclature.","zh":"nomenclatures 指某些领域的命名体系或术语集合；是 nomenclature 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system or set of names and rules for naming things in a particular field (such as science, medicine, or technology)","zh":"（某一领域的）命名体系；命名规则（如科学、医学、技术等领域）"},"examples":[{"en":"Scientific nomenclature helps researchers name new species clearly and consistently.","zh":"科学命名体系帮助研究人员清晰且一致地为新物种命名。"},{"en":"The company updated its product nomenclature to make model names easier to understand.","zh":"这家公司更新了产品命名规则，让型号名称更容易理解。"}]},{"partOfSpeech":"n.","definition":{"en":"the specific names or terms used in a subject area","zh":"（某学科/领域使用的）术语；名称集合"},"examples":[{"en":"Medical nomenclature can be difficult for beginners.","zh":"医学术语对初学者来说可能很难。"},{"en":"Different regions use different nomenclature for the same food.","zh":"不同地区对同一种食物可能使用不同的叫法（术语）。"}]}],"synonyms":["naming system","terminology","naming convention","classification terms","lexicon"],"phonetic":"/ˈnoʊmənˌkleɪtʃər/","extraExplanation":["“nomenclatures”是名词复数，通常表示“多套/多种命名体系”（例如不同国家或不同学科各有一套）。在日常写作中更常用单数“nomenclature”来表示一个领域的命名体系或该领域的术语总称。","词源上与拉丁语“nomen（名字）”有关，所以它常用于正式或学术语境（如“binomial nomenclature 双名法”）。"]}
{"word":"nomenclaturist","summary":{"en":"A specialist who works with systems of naming, especially scientific naming rules.","zh":"从事命名体系（尤指科学命名规则）制定或研究的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who creates, studies, or uses a system of names (a nomenclature), especially in science.","zh":"命名体系制定者／研究者；（尤指科学领域的）命名法专家。"},"examples":[{"en":"A botanical nomenclaturist helps ensure plant names follow international rules.","zh":"植物命名法专家会帮助确保植物名称遵循国际规则。"},{"en":"The committee invited a nomenclaturist to review the proposed chemical names.","zh":"委员会邀请了一位命名法专家来审查拟定的化学名称。"}]}],"synonyms":["nomenclature specialist","taxonomist","classifier","systematist"],"phonetic":"/noʊˈmɛnklətʃərɪst/","extraExplanation":["这个词比较少见、偏学术，常出现在生物分类学、化学命名等语境中。日常英语里更常用的表达是 “taxonomy expert / naming expert” 或直接说 “someone who works on nomenclature（从事命名法的人）”。","词根提示：nomen-（名字）+ -clature（命名法/命名体系）+ -ist（从业者/专家），合起来就是“研究或制定命名体系的人”。"]}
{"word":"nomer","summary":{"en":"Nomer means a name or term, and it’s most commonly seen today in the word “misnomer” (a wrong or misleading name).","zh":"nomer表示“名称/称呼/术语”，现代更常见于“misnomer”（误称、不恰当的名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A name or term for a person, place, or thing.","zh":"（某人、某地或某物的）名称；称呼；术语。"},"examples":[{"en":"“Tokyo” is the nomer of Japan’s capital city.","zh":"“Tokyo”是日本首都的名称。"},{"en":"The disease’s scientific nomer is hard to pronounce.","zh":"这种疾病的科学名称很难发音。"}]},{"partOfSpeech":"n.","definition":{"en":"(In the phrase “misnomer”) a wrong or misleading name for something.","zh":"（常见于“misnomer”）不恰当或误导性的名称；误称。"},"examples":[{"en":"Calling it a “free gift” is a misnomer—gifts are already free.","zh":"把它叫作“免费赠品”是一种误称——礼物本来就是免费的。"},{"en":"“Jumbo shrimp” is often joked about as a misnomer.","zh":"“大号小虾（jumbo shrimp）”常被拿来开玩笑说是误称。"}]}],"synonyms":["name","term","designation","appellation","title"],"phonetic":"/ˈnoʊmɚ/","extraExplanation":["“nomer”在现代英语里较少单独使用，更常见于固定搭配“misnomer”（误称）。日常写作里想表达“名称/名字”，通常用更常见的词：name、term、title。","词源上与拉丁语“nomen（名字）”有关；因此你也会在一些相关词里看到这个词根，比如 nominate（提名）、nomenclature（命名法）。"]}
{"word":"nomes","summary":{"en":"“Nomes” usually means the plural of “nome” (name/term), though in modern English it often appears as a misspelling of “names.” It can also be the plural of the place name “Nome.”","zh":"“Nomes”通常是“nome（名称/称谓）”的复数，但在现代英语中更多时候是把“names”拼错了；也可能是地名“Nome”的复数表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of \"nome\" (a name or term); also used as a variant spelling of \"names\" in informal/typo contexts.","zh":"“nome”的复数（指名称、名词/称谓）；也常见于非正式或拼写错误中，用来表示“names（名字们）”。"},"examples":[{"en":"In older or specialized writing, you may see \"nomes\" used to mean \"names.\"","zh":"在较旧或较专业的文字中，你可能会看到“nomes”用来表示“names（名字）”。"},{"en":"Please check the list of nomes (names) again for spelling mistakes.","zh":"请再检查一遍这些nomes（名字）的拼写是否有错误。"}]},{"partOfSpeech":"n.","definition":{"en":"\"Nomes\" as a proper noun: plural of \"Nome\" (most commonly referring to the city of Nome in Alaska).","zh":"专有名词“Nomes”：Nome 的复数（最常见指阿拉斯加的城市 Nome 的多个/复数表达）。"},"examples":[{"en":"The report compared Nome with other small towns; it mentioned several Nomes across different regions as a metaphor.","zh":"报告把Nome和其他小城镇作比较；还用“Nomes”作比喻，指不同地区的“多个Nome式的小城”。"}]}],"synonyms":["names","terms"],"phonetic":"/noʊmz/","extraExplanation":["“nome”本身在现代英语里并不常用；更常见的是“name”。所以你看到“nomes”，很多时候只是把“names”打错了，或者出现在较旧/特定领域的用法中。","注意区分：英语里还有一个常见词根“nom-/nym-”，来自希腊语，和“名字/命名”有关（如“synonym 同义词”“anonymous 匿名的”）。但这和“nomes”不是同一个常用单词。"]}
{"word":"nomeus","summary":{"en":"“Nomeus” is not a standard English word; it’s likely a misspelling or a name/username.","zh":"“nomeus”不是标准英语单词；更可能是拼写错误或名字/用户名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username, or a proper name (a made-up or uncommon name).","zh":"不是标准英语单词。更可能是拼写错误、用户名，或专有名词（自造/少见的名字）。"},"examples":[{"en":"I couldn’t find “nomeus” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“nomeus”——你是不是想写另一个词？"},{"en":"Please check the spelling of “nomeus” in the original text.","zh":"请在原文中核对“nomeus”的拼写。"}]}],"phonetic":"/noʊˈmiːəs/","extraExplanation":["“nomeus”在常见英语词典中一般查不到。如果你想表达的是某个接近的词，可以告诉我上下文句子，我来帮你判断。常见的可能目标包括：\n- **anonymous**（匿名的）\n- **nominous**（不祥的）\n- **nomenclature**（命名法/术语）\n- **nominee**（被提名者）\n- **Noam/Novus/Nemo**（人名/专名，取决于语境）\n\n也可以把你看到它的地方（文章/游戏/用户名/品牌等）发来，通常就能确定它到底是什么。"]}
{"word":"nomia","summary":{"en":"“Nomia” is uncommon in everyday English; it appears mainly as a Greek-based element meaning a system of rules/study, and as a scientific genus name for certain bees.","zh":"“Nomia” 在日常英语中不常单独使用；主要作为希腊语构词线索表示“规则/体系/研究”，也可作某类蜜蜂（汗蜂属）的学名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(in words formed from Greek) a system of laws or rules; management or study of something (seen in words like “astronomy,” “economy/economics,” “taxonomy”).","zh":"（源自希腊语构词成分）表示“某领域的规律/法则体系；对……的管理或研究”（常见于如 astronomy、economy/economics、taxonomy 等词中）。"},"examples":[{"en":"In “astronomy,” the ending relates to a system or study of rules about the stars.","zh":"在 “astronomy（天文学）” 中，词尾表达对星体规律的体系性研究。"},{"en":"Words ending in “-nomy” often come from Greek roots connected to laws or systems.","zh":"以 “-nomy” 结尾的词常来自与“法则/体系”相关的希腊语词根。"}]},{"partOfSpeech":"n.","definition":{"en":"A genus name in biology: “Nomia,” a group of sweat bees (used in scientific contexts).","zh":"（生物学）“Nomia”：一种汗蜂属的学名（多用于科学语境）。"},"examples":[{"en":"Researchers recorded several Nomia species in the survey.","zh":"研究人员在调查中记录了几种 Nomia 属的物种。"},{"en":"Nomia bees are sometimes observed visiting wildflowers.","zh":"Nomia 属的蜜蜂有时会被观察到在野花间访花。"}]}],"synonyms":["-nomy","system","study","taxonomy","astronomy"],"phonetic":"/ˈnoʊmiə/","extraExplanation":["“nomia”本身在现代英语里很少单独作为常用词出现，更常见的是作为希腊语来源的构词线索（对应更常见的英语词尾 “-nomy”）。其相关词根来自希腊语：nomos（法律、习俗、规则）+ -ia（名词后缀），因此很多学科名词带有“规则/体系/管理/研究”的含义。"]}
{"word":"nomial","summary":{"en":"Nomial is a rare word meaning “related to names/nouns,” and it is more commonly seen as the suffix “-nomial” in math words like binomial and polynomial.","zh":"Nomial 是较少单独使用的词，意为“与名称/名词性成分相关”；更常见的是作数学词后缀“-nomial”，如 binomial、polynomial。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to names or naming; used especially in linguistics to describe words or structures connected with nouns (nominals).","zh":"与名称或命名有关的；（尤用于语言学）指与名词/名词性成分（nominals）相关的。"},"examples":[{"en":"Some languages mark nomial categories like nouns and pronouns differently from verbs.","zh":"有些语言会把名词性类别（如名词和代词）与动词用不同方式标记。"},{"en":"The researcher focused on nomial expressions that refer to people and places.","zh":"研究者重点分析了指称人物与地点的名词性表达。"}]},{"partOfSpeech":"other","definition":{"en":"(In compounds, as “-nomial”) A term with a certain number of terms in an algebraic expression, such as a binomial (two terms) or polynomial (many terms).","zh":"（作复合词后缀“-nomial”，用于数学）指代数式中按“项”的数量分类的形式，如二项式（两项）或多项式（多项）。"},"examples":[{"en":"A binomial has two terms, while a trinomial has three.","zh":"二项式有两项，而三项式有三项。"},{"en":"Polynomial functions are common in algebra and calculus.","zh":"多项式函数在代数与微积分中很常见。"}]}],"synonyms":["nominal","onomastic","noun-related"],"phonetic":"/ˈnoʊmiəl/","extraExplanation":["“nomial”本身在日常英语里很少单独使用；你更常见到的是它的“词根/后缀”用法：-nomial（如 binomial, polynomial）。这个部分来自拉丁语/希腊语中表示“名称/命名”的词根（与 name 同源概念），在数学里引申为“按项来命名/分类”。","如果你原本想查的是 “nominal”（名义上的；名词的），也很常见：nominal fee（象征性的费用）、nominal clause（名词性从句）。"]}
{"word":"nomic","summary":{"en":"Nomic means “related to laws/rules/customs,” and in philosophy it can mean “related to laws of nature; law-like.”","zh":"nomic 表示“与法律/规则/习俗有关的”；在哲学中也可指“与自然规律有关的、具有法则性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) Relating to laws, rules, or established customs (especially in society, anthropology, or philosophy).","zh":"（正式）与法律、规则或既定习俗有关的（常用于社会学、人类学或哲学语境）。"},"examples":[{"en":"Some behaviors are shaped more by nomic rules than by personal preference.","zh":"有些行为更多是被法律或社会规则（nomic rules）塑造的，而不是由个人偏好决定的。"},{"en":"The researcher compared moral norms with nomic constraints in different cultures.","zh":"研究者比较了不同文化中的道德规范与法律/制度性约束。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Philosophy) Relating to laws of nature; law-like.","zh":"（哲学）与自然规律有关的；具有“规律性/法则性”的。"},"examples":[{"en":"He argued that the connection is nomic, not accidental.","zh":"他认为这种联系是“法则性的”（nomic），而不是偶然的。"},{"en":"A nomic explanation appeals to general laws rather than one-off events.","zh":"一种法则性解释（nomic explanation）诉诸一般规律，而不是一次性的事件。"}]}],"synonyms":["legal","law-related","rule-based","normative","law-like"],"phonetic":"/ˈnɑːmɪk/","extraExplanation":["词源：来自希腊语 *nomos*（法律、习俗、规范）。因此 *nomic* 常见于学术写作，搭配如 *nomic rules/constraints*（法律或制度性约束）和 *nomic necessity*（法则必然性）。","使用提示：日常英语里不常用 *nomic*。如果你想表达“法律相关的”，更常见的是 *legal*；表达“规则/规范相关的”，常用 *normative* 或 *rule-based*。"]}
{"word":"nomin","summary":{"en":"nomin- is a Latin-based root meaning “name,” seen in words like nominate and nominal.","zh":"nomin- 是表示“名字/命名”的拉丁词根，常见于 nominate、nominal 等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root (from Latin) meaning “name,” used in words about naming or names","zh":"词根（源自拉丁语），表示“名字/命名”，常用于与“名称、命名”相关的词"},"examples":[{"en":"The root nomin- appears in nominate, meaning “to name someone for a position or award.”","zh":"词根 nomin- 出现在 nominate 中，意思是“提名/推举某人担任职位或获得奖项”。"},{"en":"You can see nomin- in nominal, which often relates to a name or a title rather than the real situation.","zh":"你也能在 nominal 中看到 nomin-，它常表示“名义上的”，强调只是名称/头衔而非实际情况。"},{"en":"Nomenclature is a naming system; it also comes from the same “name” root.","zh":"nomenclature 指“命名体系/术语系统”，也来自同一个“名字”的词根。"}]}],"phonetic":"/ˈnɑmɪn/","extraExplanation":["nomin- 来自拉丁语 nomen（“名字”）。英语里常见的同源词还有: nominee（被提名者）、denominate（命名/定名）、nominative（主格；提名的/命名的，较偏语法或正式用法）。","你输入的 “nomin” 也可能是想查 nominee / nominal / nominate 其中之一；如果告诉我你想表达的句子，我可以帮你选最合适的词。"]}
{"word":"nomina","summary":{"en":"Nomina is a formal plural meaning “names/terms” (plural of Latin nomen) and is also used in some grammar contexts to mean “nouns.”","zh":"Nomina 常作为拉丁语 nomen 的复数，表示“名称/术语”；在部分语法语境中也可指“名词”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “nomen” (a name); used especially in formal or academic contexts to mean “names,” “terms,” or “named items.”","zh":"“nomen”（名字、名称）的复数；多用于正式或学术语境，指“名称/术语/被命名的事物”。"},"examples":[{"en":"In the document, the nomina of the witnesses are listed at the end.","zh":"在这份文件中，证人的姓名（nomina）列在末尾。"},{"en":"Some writers use Latin nomina to sound more formal.","zh":"有些作者用拉丁语名称（nomina）来让文字显得更正式。"}]},{"partOfSpeech":"n.","definition":{"en":"in some grammar/linguistics contexts (especially influenced by Indonesian usage), “nomina” refers to nouns (words used for people, places, things, or ideas).","zh":"在某些语法/语言学语境中（尤其受印尼语用法影响），“nomina”可指“名词”（表示人、地点、事物或概念的词）。"},"examples":[{"en":"In this lesson, we will identify nomina (nouns) and verbs in short sentences.","zh":"在这节课里，我们会在短句中找出名词（nomina）和动词。"},{"en":"Words like “book” and “city” are nomina.","zh":"像“book（书）”和“city（城市）”这样的词是名词（nomina）。"}]}],"synonyms":["names","terms","labels","nouns"],"phonetic":"/ˈnɑːmɪnə/","extraExplanation":["“nomina”来自拉丁语，是“nomen（名字）”的复数形式。在英语里它不算常见，多见于学术写作、法律文件、历史研究或带拉丁传统的专业语境。","如果你是在印尼语/语言学材料里看到“nomina”，它常常就是“名词”的意思；但在一般英语语法课里更常用的词是“noun(s)”。"]}
{"word":"nominable","summary":{"en":"“Nominable” means eligible or able to be nominated for something.","zh":"“nominable”意思是“可被提名的/有提名资格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be nominated (formally proposed for a position, award, or office)","zh":"可被提名的；有资格被提名的（正式被推荐担任职位、获奖或参选）"},"examples":[{"en":"Only members in good standing are nominable for the committee chair.","zh":"只有符合条件的正式成员才可以被提名为委员会主席。"},{"en":"The rules explain who is nominable and how nominations are submitted.","zh":"规则说明了哪些人可以被提名，以及如何提交提名。"}]}],"synonyms":["eligible","appointable","nameable","qualifying"],"phonetic":"/ˈnɑməˌnəbəl/","extraExplanation":["“Nominable”在现代英语中较少见，更常见的表达是“eligible to be nominated / can be nominated / nomination-eligible”。在正式文件（如章程、选举规则、协会规定）中偶尔会用到它来强调“符合提名资格”。"]}
{"word":"nominal","summary":{"en":"Nominal usually means “in name only” (not truly in reality), and it can also mean “related to names,” especially in grammar.","zh":"Nominal 通常表示“名义上的、挂名的（有名无实）”，也可表示“与名称/名词有关”（尤用于语法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In name only; seeming or officially stated, but not really true in practice.","zh":"名义上的；挂名的；有其名而无其实的。"},"examples":[{"en":"He is the nominal leader, but someone else makes the real decisions.","zh":"他是名义上的领导，但真正做决定的是别人。"},{"en":"The fee is nominal—only one dollar.","zh":"这笔费用只是象征性的——只要一美元。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to names or naming; existing as a name or term (often used in grammar/linguistics).","zh":"与名称/命名有关的；名词性的（常用于语法/语言学）。"},"examples":[{"en":"In English, adjectives can appear before a nominal phrase.","zh":"在英语中，形容词可以出现在名词性短语之前。"}]}],"synonyms":["in name only","so-called","titular","token","symbolic"],"phonetic":"/ˈnɑmənəl/","extraExplanation":["“nominal”常见于新闻与职场语境，强调“表面上/名义上如此，但实际并非如此”。例如 nominal owner（名义上的所有者）。","在经济学里，nominal price/nominal GDP 指“名义值”（未扣除通货膨胀的数字）；相对的是 real price/real GDP（实际值）。","词源来自拉丁语 nomen（名字）。因此它既能表示“与名字有关”，也能引申为“只有名字/名义上”。"]}
{"word":"nominale","summary":{"en":"Nominale (usually written “nominal”) means “in name only,” or “related to names/nouns,” and in finance it can mean “face/stated value.”","zh":"nominale（英语通常写作 nominal）指“名义上的/有名无实的”，也可指“与名称或名词有关的”；在金融中还可指“票面/名义价值”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written as “nominal”) Existing in name only, not in real effect or importance.","zh":"（常写作 nominal）名义上的；有其名而无其实的。"},"examples":[{"en":"He is the nominal head of the company, but his daughter makes the decisions.","zh":"他是公司名义上的负责人，但真正做决定的是他的女儿。"},{"en":"They agreed to a nominal fee so the paperwork would be legal.","zh":"他们同意收取象征性的费用，以便手续合法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often written as “nominal”) Related to names or naming; in grammar, related to nouns.","zh":"（常写作 nominal）与名称/命名有关的；（语法）名词性的、与名词有关的。"},"examples":[{"en":"Please fill in your nominal information (name and title).","zh":"请填写你的姓名与头衔等名义信息。"},{"en":"In English, adjectives can function in a nominal way, like “the rich.”","zh":"在英语中，形容词有时可以名词化使用，比如“the rich（富人）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(finance) The stated or face value of something, not adjusted for inflation or market changes.","zh":"（金融）票面价值；名义价值（未考虑通胀或市场变化）。"},"examples":[{"en":"The bond has a nominal value of $1,000.","zh":"这张债券的票面价值是1000美元。"},{"en":"Nominal wages rose, but prices rose faster.","zh":"名义工资涨了，但物价涨得更快。"}]}],"synonyms":["in name only","token","symbolic","stated","face value"],"phonetic":"/ˈnɑmənəl/","extraExplanation":["“nominale”更常见于法语/意大利语中（相当于英语的 nominal）。在英语里日常写法通常是 nominal；你可能在金融、法律文件或语法讨论中看到。","词源来自拉丁语 nomen（“名字”）。因此它常带有“只有名字/形式”的含义。"]}
{"word":"nominalism","summary":{"en":"Nominalism is the view that general categories (universals) are not independently real—only individual things are real, and universals are just names.","zh":"唯名论认为普遍概念并非独立真实存在；真实存在的是个别事物，普遍概念只是我们使用的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical view that universals or general categories (like “redness,” “beauty,” or “humanity”) do not exist as real things on their own; only individual objects exist, and general terms are just names we use.","zh":"一种哲学观点：普遍概念或一般范畴（如“红色性”“美”“人性”）并不是独立真实存在的实体；真实存在的只有个别事物，而一般词只是我们用来命名和归类的名称。"},"examples":[{"en":"In nominalism, “humanity” is a convenient word, not a thing that exists separately from individual humans.","zh":"在唯名论中，“人性/人类性”只是一个方便的词，并不是独立于具体的人之外存在的东西。"},{"en":"The debate between realism and nominalism asks whether universals are real or just names.","zh":"实在论与唯名论的争论在于：普遍概念究竟是真实存在，还是只是名称。"}]},{"partOfSpeech":"n.","definition":{"en":"(More broadly) The habit of treating an abstract term as if it were only a label, emphasizing practical naming over deeper metaphysical claims.","zh":"（更广义）把抽象术语主要当作“标签”来使用的倾向，强调命名与分类的实用性，而不主张背后有独立的形而上实体。"},"examples":[{"en":"Some critics call his approach to ethics a kind of nominalism because he avoids talking about universal moral truths.","zh":"一些批评者认为他在伦理学上的做法带有某种“唯名论”，因为他回避讨论普遍的道德真理。"}]}],"synonyms":["anti-realism (about universals)","name-theory (about universals)"],"phonetic":"/ˈnɑməˌnælɪzəm/","extraExplanation":["“nominalism”来自拉丁语 nomen（名字）。在中世纪哲学中，它常与“实在论（realism）”对立：实在论认为“普遍概念”以某种方式真实存在；唯名论则强调它们只是语言中的名称或心智中的概念工具。","学习时可用一个直观对比来理解：\n- 实在论：有一个“红色性”本身（作为普遍者）\n- 唯名论：只有一件件红色的东西；“红色”只是我们给相似事物取的共同名字","常见相关词：universal（普遍概念/共相）、particular（个别事物）、realism（实在论）、conceptualism（概念论：介于两者之间的观点）。"]}
{"word":"nominalist","summary":{"en":"A nominalist is someone who believes general concepts are just names rather than independently real things.","zh":"nominalist 指唯名论者：认为一般概念只是名称/标签，而非独立真实存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes in (or supports) nominalism—the view that general ideas like “beauty” or “humanity” are just names we use, not real things that exist independently.","zh":"唯名论者（支持“唯名论”的人）：认为“美”“人性”等一般概念只是人们使用的名称或标签，并非独立真实存在的实体。"},"examples":[{"en":"In medieval philosophy, a nominalist argues that universals are only words, not real entities.","zh":"在中世纪哲学中，唯名论者认为“共相”（普遍概念）只是词语，并非真实实体。"},{"en":"Some historians describe William of Ockham as a famous nominalist.","zh":"一些历史学者把奥卡姆的威廉称为著名的唯名论者。"}]}],"synonyms":["advocate of nominalism","anti-realist (in some contexts)"],"phonetic":"/ˈnɑmənəlɪst/","extraExplanation":["“nominalist”来自拉丁语词根 *nomen*（名字）。它常出现在“共相之争”（universals debate）中：与唯名论相对的是“实在论/柏拉图式实在论”（realism），后者认为普遍概念在某种意义上真实存在。","在现代语境里，它有时也被更宽泛地用来指“更看重名称/分类而不是实际本质或差异”的人，但最标准、最常见的用法仍是哲学上的“唯名论者”。"]}
{"word":"nominalistic","summary":{"en":"Nominalistic means (1) related to nominalism (general concepts are just names), or (2) existing only in name or focused on labels rather than real substance.","zh":"nominalistic 指（1）与唯名论相关（一般概念只是名称），或（2）仅名义上存在/过度强调标签而缺乏实际内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to nominalism (the philosophical view that general ideas like “beauty” or “justice” are just names we use, not real things that exist independently).","zh":"与“唯名论”有关的（认为“美”“正义”等一般概念只是人类给事物取的名字，并非独立存在的真实实体）。"},"examples":[{"en":"Her essay takes a nominalistic approach to categories like “race” and “nation.”","zh":"她的文章以唯名论的方式来看待“种族”“民族”等范畴。"},{"en":"In a nominalistic view, “species” can be a convenient label rather than a fixed reality.","zh":"在唯名论的观点里，“物种”可能只是方便的标签，而不是固定不变的真实存在。"}]},{"partOfSpeech":"adj.","definition":{"en":"Based only on names or labels rather than real substance; existing in name only.","zh":"仅停留在名称或标签层面、缺乏实际内容的；名义上的。"},"examples":[{"en":"The committee’s power was nominalistic—more a title than real influence.","zh":"委员会的权力只是名义上的——更像一个头衔，并没有真正的影响力。"},{"en":"They criticized the plan as nominalistic because it changed terminology but not outcomes.","zh":"他们批评这个方案只是“换说法不换结果”，属于名义上的改变。"}]}],"synonyms":["nominalist","nominal","in name only","label-based"],"phonetic":"ˌnɑməˈlɪstɪk","extraExplanation":["“nominalistic”多用于学术语境（哲学、社会科学、语言学）。它来自“nominalism（唯名论）”。唯名论常与“realism（实在论/唯实论）”对比：实在论倾向认为抽象概念或“共相”具有某种独立真实性，而唯名论认为这些只是我们为了分类和交流而使用的名称。","日常英语里表达“名义上的”通常更常用 nominal（如 nominal leader），而 nominalistic 更偏向“基于名称/标签”的思想或批评角度。"]}
{"word":"nominalistical","summary":{"en":"Nominalistical means “related to nominalism” (rare; more commonly written as nominalistic).","zh":"nominalistical 意为“与唯名论/名目论有关的”（罕见；更常见写法是 nominalistic）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to nominalism, the view that general ideas (like “beauty” or “species”) are only names and do not exist as independent, universal things.","zh":"（罕见）与“唯名论/名目论”有关的；指一种观点：像“美”“物种”这类一般概念只是名称，并非独立存在的普遍实体。"},"examples":[{"en":"The essay takes a nominalistical approach to categories like race and class, treating them as labels shaped by history.","zh":"这篇文章以名目论式的方式讨论“种族”“阶级”等范畴，把它们看作受历史塑造的标签。"},{"en":"Her argument is nominalistical: she says the group exists because we agree to call it a group.","zh":"她的论证带有名目论色彩：她认为这个群体之所以“存在”，是因为我们同意把它称作群体。"}]}],"synonyms":["nominalistic","nominalist","conceptual (in some contexts)"],"phonetic":"/ˌnɑməˈnælɪstɪk/","extraExplanation":["“nominalistical”在现代英语中非常少见，更常见、也更自然的拼写是 **nominalistic**。如果你是在哲学或神学语境（如中世纪经院哲学）里看到这个词，它通常是在讨论“唯名论（nominalism）”与“实在论（realism）”对普遍概念是否真实存在的争论。"]}
{"word":"nominalistically","summary":{"en":"Nominalistically means (1) in the way of nominalism (treating universals as names), or (2) merely in name, not in reality.","zh":"nominalistically 可指（1）以唯名论/名义论的方式看待概念（把共相视为名称），也可指（2）名义上地、只是形式上如此。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that follows nominalism: treating categories or universals (like “beauty,” “justice,” or “species”) as mainly names or labels rather than real things that exist independently.","zh":"以“唯名论/名义论”的方式：把“美”“正义”“物种”等类别或普遍概念主要看作名称/标签，而不是独立存在的真实实体。"},"examples":[{"en":"Nominalistically, the term “race” can be seen as a label we use, not a fixed natural kind.","zh":"从唯名论角度看，“种族”可以被视为我们使用的标签，而不是固定的自然类别。"},{"en":"She approached ethics nominalistically, focusing on how words like “good” are used in practice.","zh":"她以唯名论的方式研究伦理学，关注“善”等词在实践中的用法。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a merely nominal way; in name only rather than in reality.","zh":"名义上地；只是名称或形式上如此，而非现实中如此。"},"examples":[{"en":"The committee was nominalistically independent, but the leader still controlled every decision.","zh":"该委员会名义上独立，但领导仍控制每一个决定。"},{"en":"The policy changed nominalistically, yet daily procedures stayed the same.","zh":"政策名义上变了，但日常流程仍然一样。"}]}],"synonyms":["nominally","in name only","by name","in a nominalist way"],"phonetic":"/ˌnɑːməˈlɪstɪkli/","extraExplanation":["“nominalistically”来自哲学术语“nominalism（唯名论/名义论）”。在中世纪经院哲学中，它与“realism（实在论）”相对：实在论认为“普遍概念/共相”在某种意义上真实存在，而唯名论更强调它们是人用来分类与交流的名称。","在学术写作里，“nominalistically”常用于讨论概念是否具有独立“本体论地位”（是否真的是一种客观存在），也常用于批评“只有名义上的改革/独立”。"]}
{"word":"nominality","summary":{"en":"Nominality means the noun-like quality of language, especially the use of nouns (often from verbs/adjectives) to express ideas in a more formal style.","zh":"Nominality 指语言的名词性，尤其是用名词（常由动词/形容词转化）来表达意义，使表达更正式但可能更难读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) the quality or state of being a noun or noun-like; the use of nouns and noun phrases (often created from verbs/adjectives) to express ideas.","zh":"（语言学）名词性；像名词的性质或状态；用名词/名词短语（常由动词或形容词转化而来）来表达意义的做法。"},"examples":[{"en":"English academic writing often has a high level of nominality, using nouns like “development” instead of verbs like “develop.”","zh":"英语学术写作常常名词性较高，用“development（发展）”这类名词来替代“develop（发展）”这类动词。"},{"en":"To make the sentence clearer, the teacher suggested reducing nominality and using more direct verbs.","zh":"为了让句子更清楚，老师建议降低名词性，多用更直接的动词。"},{"en":"Nominality can make writing sound formal, but it can also make it harder to read.","zh":"名词性会让写作更正式，但也可能让文章更难读。"}]}],"synonyms":["nouniness","nominal character","noun-like quality"],"phonetic":"/ˌnɑməˈnælɪti/","extraExplanation":["“nominality”常见于语言学、写作教学与文体分析中，讨论名词化（nominalization）带来的风格变化：更抽象、更客观、更正式，但可能更冗长、主体不清。","常见名词化例子：decide → decision（决定），analyze → analysis（分析），different → difference（差异）。适度使用有助于学术表达，但在说明步骤/行动时，用动词往往更清晰。"]}
{"word":"nominalize","summary":{"en":"To nominalize is to turn something into a noun form, especially in grammar and academic writing.","zh":"nominalize 指把表达转成名词形式（名词化），常用于语法与学术写作。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Linguistics) To change a word, phrase, or clause into a noun or noun phrase; to express something as a noun.","zh":"（语言学）把词、短语或从句转化为名词或名词性结构；用名词的方式表达。"},"examples":[{"en":"We can nominalize the verb “decide” as the noun “decision.”","zh":"我们可以把动词“decide”名词化为名词“decision”。"},{"en":"Academic writing often nominalizes actions, for example, “analyze” → “analysis.”","zh":"学术写作常把动作名词化，比如“analyze”→“analysis”。"},{"en":"Try not to over-nominalize; sometimes a simple verb sounds clearer.","zh":"尽量不要过度名词化；有时用简单的动词更清晰。"}]}],"synonyms":["nominalise","make into a noun","turn into a noun","noun (as a verb)"],"phonetic":"/ˈnɑmənəˌlaɪz/","extraExplanation":["“nominalize”是“nominal（名词的）+ -ize（使……化）”，常见于语法与写作讨论。名词化可以让表达更抽象、更正式，但也可能让句子变得更长、更难读。","常见名词化方式：\n1) 加后缀：-tion/-sion（decide→decision），-ment（develop→development），-ance/-ence（perform→performance）。\n2) 用动名词（-ing）：to investigate→investigating。\n3) 把从句改成名词结构：“We examined how it works”→“our examination of how it works”。"]}
{"word":"nominalized","summary":{"en":"“Nominalized” most commonly means “turned into a noun/noun phrase” in grammar.","zh":"nominalized 最常见的意思是“（语法）被名词化的”，即把词或表达改写成名词/名词短语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar) changed into a noun or noun phrase; expressed as a noun rather than as a verb/adjective, etc.","zh":"（语法）被“名词化”的；把动词/形容词等转换成名词或名词短语来表达。"},"examples":[{"en":"In “the destruction of the city,” “destruction” is a nominalized form of “destroy.”","zh":"在“the destruction of the city”中，destruction 是 destroy 的名词化形式。"},{"en":"Academic writing often sounds more formal because it uses many nominalized verbs.","zh":"学术写作常显得更正式，因为它经常把动词名词化来用。"}]},{"partOfSpeech":"adj.","definition":{"en":"made only nominal; existing in name rather than in reality (less common).","zh":"名义上的；有其名而少其实（较不常用）。"},"examples":[{"en":"The committee was nominalized as an “independent body,” but it had little real power.","zh":"该委员会被名义上设为“独立机构”，但几乎没有实际权力。"}]}],"synonyms":["noun-form","converted to a noun","nounified"],"phonetic":"/ˈnɑmənlˌaɪzd/","extraExplanation":["“Nominalized”来自动词 nominalize（名词化）。在语言学习与写作中，名词化常用于让句子更抽象、正式：例如把“decide”写成“make a decision”。优点是语气更学术；缺点是可能让句子更长、更难读，因此写作时要根据语境平衡清晰度与正式度。"]}
{"word":"nominalizing","summary":{"en":"“Nominalizing” means making words or structures function as nouns (a common formal style in academic English).","zh":"“Nominalizing”指把词或结构变成名词/起名词作用（学术英语中常见的正式表达方式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) turning a word, phrase, or clause into a noun (or making it function like a noun).","zh":"（语言学）把词、短语或从句变成名词（或让它起名词作用）的。"},"examples":[{"en":"In academic writing, nominalizing verbs can make sentences feel more formal.","zh":"在学术写作中，把动词名词化会让句子显得更正式。"},{"en":"The phrase “the discovery of America” is a nominalizing structure built from the verb “discover.”","zh":"短语“the discovery of America（对美洲的发现）”是由动词“discover”构成的名词化结构。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “nominalize”; the act/process of making something into a noun.","zh":"“nominalize”的现在分词；名词化的行为/过程。"},"examples":[{"en":"She is nominalizing the action to focus on the result rather than the doer.","zh":"她在把动作名词化，以突出结果而不是执行者。"},{"en":"Nominalizing can reduce clarity if overused.","zh":"名词化如果用得太多，会降低表达清晰度。"}]}],"synonyms":["nominalizing (as a process)","noun-forming","turning into a noun","nominalization (noun form)"],"phonetic":"/ˈnɑːmənəˌlaɪzɪŋ/","extraExplanation":["“Nominalizing/nominalization（名词化）”在英语写作里很常见：例如把动词 decide 变成名词 decision，把形容词 different 变成 difference。它能让句子更抽象、更正式，但也可能让句子更长、更不直接（例如把“Scientists measured…”写成“The measurement of…”）。写作中常建议在“清晰、直接”与“客观、正式”之间平衡使用。"]}
{"word":"nominally","summary":{"en":"“Nominally” means “in name/officially (not necessarily in reality),” or “slightly (by a small amount),” especially in economic contexts.","zh":"“Nominally”表示“名义上/正式上（未必属实）”，也可表示“略微地（小幅度）”，尤见于经济等语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In name or officially, but not necessarily in reality (the real situation may be different).","zh":"名义上；表面上；正式称作，但未必符合实际情况。"},"examples":[{"en":"Nominally, he is the manager, but his assistant makes most decisions.","zh":"名义上他是经理，但大多数决定是他的助理在做。"},{"en":"The country is nominally independent, yet another power controls its finances.","zh":"这个国家名义上独立，但财政却被另一个强权控制。"}]},{"partOfSpeech":"adv.","definition":{"en":"By a very small amount; slightly (often used with numbers, prices, or rates).","zh":"少量地；略微地（常用于数字、价格或比率）。"},"examples":[{"en":"Ticket prices increased nominally this year.","zh":"今年票价只是略微上涨。"},{"en":"The interest rate is nominally lower, but fees make the loan expensive.","zh":"利率名义上更低，但各种费用让贷款变得很贵。"}]}],"synonyms":["in name","officially","formally","ostensibly","supposedly","slightly","marginally","minimally"],"phonetic":"/ˈnɑmənəli/","extraExplanation":["“nominally”来自“nominal”（名义上的），而“nominal”源自拉丁语 *nomen*（名字）。因此它常带有“只是挂名/只是称呼如此”的含义，语气上常暗示与现实不完全一致。","在经济语境里，“nominal(ly)”常与“real(ly)”对比：nominal 指“未扣除通货膨胀或其他因素的名义数值”，real 指“实际购买力/实际变化”。例如 nominal wage（名义工资） vs. real wage（实际工资）。"]}
{"word":"nominalness","summary":{"en":"Nominalness means the quality of being nominal—either existing in name only (not real power/importance) or being very small (a token amount). In linguistics, it can mean how noun-like an expression is.","zh":"Nominalness 指“名义性”：要么只是名义上存在（并非真正有权/重要），要么指金额或数量很小（象征性的）。在语言学中也可指表达的“名词性”程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being nominal (existing in name rather than in reality, or being very small compared with what is expected)","zh":"“名义上的”特质（只在名称上存在、并非真实如此；或金额/数量小得几乎可以忽略）"},"examples":[{"en":"The committee’s power was mostly nominalness; real decisions were made elsewhere.","zh":"该委员会的权力多为名义上的；真正的决定在别处做出。"},{"en":"They paid a nominal fee, and the nominalness of the cost surprised everyone.","zh":"他们只付了象征性的费用，费用的“名义性”（几乎可忽略）让大家很惊讶。"}]},{"partOfSpeech":"n.","definition":{"en":"in linguistics, the degree to which a word or expression functions like a noun (a nominal)","zh":"【语言学】“名词性”的程度：一个词或短语在句子里有多像名词（名词化/名词用法的程度）"},"examples":[{"en":"In “Running is fun,” the nominalness of “running” comes from using it as the subject.","zh":"在“Running is fun”中，“running”作主语，因此具有更强的名词性。"},{"en":"Some adjectives show nominalness when used with “the,” as in “the rich.”","zh":"有些形容词与“the”连用时会呈现名词性，如“the rich（富人）”。"}]}],"synonyms":["nominality","token status","in-name-only status","noun-likeness (linguistics)"],"phonetic":"/ˈnɑmənəlnəs/","extraExplanation":["“Nominalness”并不算特别常见的日常词，更常见的说法是用“nominal”作形容词（a nominal fee 名义费用/象征性费用；nominal leader 名义领袖）或用“nominality / nominal nature”来表达“名义性”。","在语法学习里，你也会看到类似概念：名词化（nominalization），例如把动词变成名词或名词短语来使用：decide → decision；“To travel”/“Traveling”作主语时就更“名词化”。"]}
{"word":"nominals","summary":{"en":"Nominals are noun-like elements in grammar; nominal can also mean “related to names” or “in name only / very small.”","zh":"Nominals 常指语法中的名词性成分；nominal 也可表示“与名称有关”或“名义上的/象征性的（很小的）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Grammar) Noun-like words or phrases; forms that function as nouns (including nouns, pronouns, gerunds, and noun phrases).","zh":"（语法）名词性成分；在句子里起名词作用的词或短语（包括名词、代词、动名词、名词短语等）。"},"examples":[{"en":"In the sentence “Swimming is fun,” “swimming” is a nominal.","zh":"在句子“Swimming is fun”中，“swimming”是一个名词性成分。"},{"en":"English allows many nominals, such as “the old house,” “her,” and “to travel.”","zh":"英语里有很多名词性成分，比如“the old house”“her”和“to travel”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a name or naming.","zh":"与名称或命名有关的。"},"examples":[{"en":"Please check the nominal information on your ID card.","zh":"请核对你身份证上的姓名信息。"}]},{"partOfSpeech":"adj.","definition":{"en":"In name only; not real or not as big/important as it seems.","zh":"名义上的；徒有其名的（并非真实或并没那么重要/强大）。"},"examples":[{"en":"She is the nominal leader, but someone else makes the decisions.","zh":"她是名义上的领导，但做决定的是别人。"},{"en":"The fee is nominal—only one dollar.","zh":"费用很低，几乎象征性的——只要一美元。"}]}],"synonyms":["noun phrase","nouns","naming","titular","in name only","token"],"phonetic":"/ˈnɑmənəl/","extraExplanation":["“nominals”是复数形式，单数是“nominal”。在语言学/语法里它常指“名词性成分”（能当主语、宾语等）。","在日常英语中，形容词“nominal”很常见，尤其在职场/新闻里：nominal leader（名义领袖）、nominal control（名义控制）。","在金融或数据场景中也常见“nominal value/nominal rate”（名义价值/名义利率），强调“未扣除通胀或其他因素的表面数值”。"]}
{"word":"nominare","summary":{"en":"“Nominare” means “to name” and, in formal contexts, “to nominate/appoint.”","zh":"nominare 表示“命名/称呼”，正式语境中也可表示“提名/任命”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin/Italian) to name; to call someone or something by a particular name.","zh":"（拉丁语/意大利语）命名；称呼（某人/某物）为某个名字。"},"examples":[{"en":"In Latin texts, “nominare” often means “to name” a person or place.","zh":"在拉丁文文本中，nominare 常用来表示“给某人或某地命名”。"},{"en":"They chose to nominare the new library after a local writer.","zh":"他们决定以一位本地作家的名字为新图书馆命名。"}]},{"partOfSpeech":"v.","definition":{"en":"(Latin/Italian, formal) to nominate or appoint someone for a role or office.","zh":"（拉丁语/意大利语，较正式）提名；任命（某人担任职务）。"},"examples":[{"en":"The committee will nominare a candidate for chair.","zh":"委员会将提名一位候选人担任主席。"},{"en":"He was nominare to serve as ambassador.","zh":"他被任命为大使。"}]}],"synonyms":["name","call","nominate","appoint","designate"],"phonetic":"/ˌnɑːmɪˈnɑːreɪ/","extraExplanation":["nominare 来自拉丁语词根 nomen（“名字”）。英语中的 nominate（提名）、nominal（名义上的）、nomenclature（命名法）都与它同源。","在英语语境里，nominare 本身不算常用词；更多时候会用英语动词 name（命名）或 nominate（提名）。如果你在阅读拉丁文、意大利文、法律/历史文件时看到它，通常就是“点名/命名/提名”的意思。"]}
{"word":"nominate","summary":{"en":"Nominate means to formally propose or name someone for a position, election, or award.","zh":"Nominate 指正式提名/推荐或任命某人参加选举、担任职位或获得奖项。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to formally suggest someone for a job, position, or election","zh":"正式提名某人担任职位或参加选举"},"examples":[{"en":"The committee nominated her for president of the club.","zh":"委员会提名她担任社团主席。"},{"en":"Several candidates were nominated in the primary election.","zh":"在初选中，有几位候选人被提名。"}]},{"partOfSpeech":"vt.","definition":{"en":"to formally propose someone for an award or honor","zh":"正式推荐/提名某人获得奖项或荣誉"},"examples":[{"en":"She was nominated for an Oscar.","zh":"她获得了奥斯卡提名。"},{"en":"Our teacher nominated two students for the scholarship.","zh":"老师提名了两位学生申请奖学金。"}]},{"partOfSpeech":"vt.","definition":{"en":"to name or appoint someone to a role (often officially)","zh":"（通常正式地）任命/指定某人担任某职"},"examples":[{"en":"The mayor nominated a new head of the department.","zh":"市长任命了一位新的部门负责人。"}]}],"synonyms":["propose","recommend","put forward","appoint","name"],"phonetic":"/ˈnɑməˌneɪt/","extraExplanation":["“nominate”常见于正式语境（政府、组织、颁奖）。口语里也会用，但语气偏“官方程序”。","常见搭配：nominate someone for + 奖项/职位（提名某人角逐/获得）；nominate someone as + 身份（提名某人为……）。注意：for 强调“争取/获得”，as 强调“担任的身份”。","名词形式是 nomination（提名/任命），形容词是 nominated（被提名的）。"]}
{"word":"nominated","summary":{"en":"“Nominated” means someone has been formally suggested or chosen as a candidate for a role, position, or award.","zh":"“nominated”表示某人被正式提名/推举为职位、角色或奖项的候选人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense and past participle of “nominate”; to formally suggest or choose someone for a position, role, award, or task.","zh":"“nominate”的过去式和过去分词；正式提名/推荐某人担任职位、角色，或角逐奖项、承担任务。"},"examples":[{"en":"She was nominated for Best Actress.","zh":"她被提名角逐最佳女演员。"},{"en":"The committee nominated him to lead the project.","zh":"委员会提名他来负责这个项目。"},{"en":"Three candidates were nominated at the meeting.","zh":"会议上提名了三位候选人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Proposed or formally selected as a candidate for something (often used before a noun).","zh":"被提名的；被正式推举为候选的（常作定语）。"},"examples":[{"en":"The nominated students will attend the ceremony.","zh":"被提名的学生将参加颁奖典礼。"},{"en":"He is a nominated member of the board.","zh":"他是被提名进入董事会的成员。"}]}],"synonyms":["proposed","put forward","recommended","shortlisted","selected"],"phonetic":"/ˈnɑməˌneɪtɪd/","extraExplanation":["在英语里，“nominate”常用于选举、奖项（如电影奖）、以及组织内部任命等较正式的场合；搭配很常见：be nominated for（被提名角逐某奖项/荣誉），nominate someone for/to（提名某人担任/参与）。注意：被提名不等于当选或获奖。"]}
{"word":"nominately","summary":{"en":"“Nominally” means “in name only” or “only slightly,” especially in formal contexts.","zh":"“Nominally”常表示“名义上（不一定属实）”，也可表示“仅小幅度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Commonly: nominally) In name or officially, but not necessarily in reality.","zh":"（常见拼写：nominally）名义上；在官方称呼或形式上，但不一定在实际上如此。"},"examples":[{"en":"He is nominally the manager, but his assistant makes most decisions.","zh":"他名义上是经理，但大多数决定是他的助理在做。"},{"en":"The company is nominally independent, but it relies on government funding.","zh":"这家公司名义上独立，但它依赖政府资金。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Commonly: nominally) Only slightly; by a very small amount (often about money, prices, or measurements).","zh":"（常见拼写：nominally）仅仅一点点；以很小的幅度（常用于钱、价格或数值）。"},"examples":[{"en":"Prices rose nominally last year, but overall inflation stayed low.","zh":"去年价格只小幅上涨，但总体通胀仍然较低。"},{"en":"The fee is nominally higher than before.","zh":"这项费用比以前只高了一点点。"}]}],"synonyms":["officially","in name only","ostensibly","supposedly","slightly","marginally"],"phonetic":"/ˈnɑmənəli/","extraExplanation":["你写的“nominately”一般被认为是拼写错误；标准拼写是“nominally”。","“nominally”来自“nominal（名义上的）”。在新闻、职场语境里很常见，常暗示“表面如此，但实际并非如此”。"]}
{"word":"nominates","summary":{"en":"“Nominates” means officially naming or suggesting someone for a job, role, honor, or as a candidate.","zh":"“nominates”表示正式提名/推举某人担任某个职位、获得荣誉，或成为候选人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to officially suggest or choose someone for a position, job, or honor (like an award)","zh":"正式提名（某人）担任职位/工作或获得荣誉（如奖项）"},"examples":[{"en":"The manager nominates Li for team leader.","zh":"经理提名李担任组长。"},{"en":"She nominates her friend for the volunteer award.","zh":"她提名朋友角逐志愿者奖。"}]},{"partOfSpeech":"v.","definition":{"en":"to name someone as a candidate in an election or in a formal decision process","zh":"在选举或正式程序中提名某人为候选人"},"examples":[{"en":"The party nominates a new candidate for mayor.","zh":"该党提名了一位新的市长候选人。"},{"en":"Each class nominates two students to join the student council.","zh":"每个班提名两名学生加入学生会。"}]}],"synonyms":["appoint","propose","recommend","put forward"],"phonetic":"/ˈnɑməˌneɪts/","extraExplanation":["“nominates”是动词“nominate”的第三人称单数现在时（he/she/it nominates）。常见搭配：nominate someone for (an award/position)；nominate someone as (chair/leader)。语气较正式，多用于公司、学校、政治、奖项等场合。"]}
{"word":"nominating","summary":{"en":"“Nominating” means proposing someone officially for a position, election, or award; it can also describe things related to that process.","zh":"“nominating”表示正式提名/推荐某人担任职位、参选或参评奖项；也可作形容词表示与提名流程相关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “nominate”) proposing someone for a job, position, award, or election; officially suggesting them as a candidate.","zh":"（“nominate”的现在分词）提名；推荐某人担任职位、参加选举或角逐奖项；正式提出某人为候选人。"},"examples":[{"en":"They are nominating her for manager because of her strong leadership.","zh":"因为她领导能力很强，他们正提名她当经理。"},{"en":"The committee is nominating three people for the award this year.","zh":"委员会今年将提名三人角逐该奖项。"},{"en":"I’m nominating you as team leader—do you accept?","zh":"我提名你当组长——你愿意接受吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) related to the act of choosing and proposing candidates (often before “committee,” “process,” or “vote”).","zh":"（形容词）与“提名”有关的（常用于修饰committee、process、vote等）。"},"examples":[{"en":"The nominating committee will meet on Friday.","zh":"提名委员会将于周五开会。"},{"en":"We need a clear nominating process to avoid confusion.","zh":"我们需要一个清晰的提名流程以避免混乱。"}]}],"synonyms":["proposing","recommending","putting forward","selecting","endorsing"],"phonetic":"ˈnɑməˌneɪtɪŋ","extraExplanation":["“nominate”常用于正式场合：选举（nominate a candidate）、公司/组织任命（nominate someone for a role）、奖项（nominate someone for an award）。","语法上，“nominating”既可以是现在分词（描述正在发生的动作：They are nominating…），也可以作动名词（当名词用：Nominating a leader takes time. 提名一位领导需要时间）。"]}
{"word":"nomination","summary":{"en":"A nomination is a formal suggestion of someone for a job, position, or award, or the person who has been suggested.","zh":"nomination 指对某人担任职位或获得奖项的正式提名，也可指被提名的候选人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of formally suggesting someone for a position, role, or honor.","zh":"（正式）提名；推荐某人担任职位、角色或获得荣誉的行为。"},"examples":[{"en":"Her nomination for team leader was approved quickly.","zh":"她被提名为团队负责人，很快就通过了。"},{"en":"The committee will vote on the nomination next week.","zh":"委员会将于下周对该提名进行投票。"}]},{"partOfSpeech":"n.","definition":{"en":"The name of a person who has been officially suggested (a candidate).","zh":"被正式提名的人；候选人。"},"examples":[{"en":"The nominations for best actor include three newcomers.","zh":"最佳男演员的提名名单里有三位新人。"},{"en":"Each nomination must be supported by two members.","zh":"每个候选提名都必须得到两名成员支持。"}]}],"synonyms":["proposal","recommendation","appointment (in some contexts)","candidacy"],"phonetic":"/ˌnɑməˈneɪʃən/","extraExplanation":["“nomination”常见于政治与奖项语境：如“presidential nomination（总统候选提名/党内提名）”“Oscar nomination（奥斯卡提名）”。通常提名只是进入候选名单，最后是否“当选/获奖”还要经过投票或评审。","词形提示：动词是“nominate（提名）”，形容词常见“nominated（被提名的）”。例如：She was nominated for an award（她获得奖项提名）。"]}
{"word":"nominations","summary":{"en":"“Nominations” means official suggestions or the announced list of people proposed for a role, prize, or election.","zh":"“nominations”指对职位/奖项/选举等的正式提名过程，或被提名者名单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of officially suggesting someone (or something) for a position, job, prize, or election.","zh":"（对职位、奖项、选举等的）提名；推荐的过程。"},"examples":[{"en":"The committee is accepting nominations for the student leadership award.","zh":"委员会正在接受学生领导力奖的提名。"},{"en":"Her nominations for best actress brought her national attention.","zh":"她获得的最佳女主角提名让她受到全国关注。"}]},{"partOfSpeech":"n.","definition":{"en":"The official name(s) of the people who have been suggested for a position, prize, or election.","zh":"被提名者名单；提名人选。"},"examples":[{"en":"Nominations will be announced on Friday.","zh":"提名名单将于周五公布。"},{"en":"We reviewed the nominations before choosing a finalist.","zh":"我们在选出入围者之前审查了提名名单。"}]}],"synonyms":["recommendations","proposals","candidacies","shortlist (in awards context)"],"phonetic":"/ˌnɑməˈneɪʃənz/","extraExplanation":["“Nominations”是“nomination”的复数形式。常见搭配：make/submit nominations（提出/提交提名）, receive nominations（获得提名）, announce nominations（公布提名）, nomination process（提名流程）。","语境提示：在电影、音乐等奖项里，nominations强调“入围/获提名”；在政治语境里，nominations常指政党或机构对候选人的“提名/推举”。"]}
{"word":"nominatival","summary":{"en":"“Nominatival” means “related to the nominative (subject) case,” mainly used in linguistics/grammar.","zh":"“nominatival”意为“与主格（主语格）有关的”，主要用于语言学/语法语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the nominative case (the grammatical form typically used for the subject of a sentence).","zh":"与主格（通常用于句子主语的语法形式）有关的。"},"examples":[{"en":"In English, many pronouns still show a nominatival form: I, he, she, we, they.","zh":"在英语中，许多代词仍保留主格形式：I, he, she, we, they。"},{"en":"The teacher asked us to identify the nominatival subject of the sentence.","zh":"老师让我们找出这个句子的主格主语。"}]}],"synonyms":["nominative (more common)","subject-case (informal)"],"phonetic":"/ˌnɑːmɪˈneɪtɪvəl/","extraExplanation":["“nominatival”常见于语言学或语法学术写作，日常英语里更常用“nominative”作形容词（如 nominative case）。","主格（nominative case）在英语中主要体现在代词：I/he/she/we/they（主格）对应 me/him/her/us/them（宾格）。而在一些屈折变化更丰富的语言（如拉丁语、俄语、德语）中，名词、形容词也会随格变化。","词形来源：nominative（主格）+ 形容词后缀 -al，意思是“……的/与……有关的”。"]}
{"word":"nominative","summary":{"en":"Nominative means the subject form in grammar (e.g., I, he, she) or the grammatical case used for subjects.","zh":"nominative 指语法中的主格（如 I, he, she 等主语形式），也可指“主格”这一语法格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar) relating to the subject form of a noun or pronoun (the form used for the subject of a verb).","zh":"（语法）主格的；与“作主语的形式”有关的（名词或代词在句中作动词主语时使用的形式）。"},"examples":[{"en":"In English, “I” is nominative, but “me” is objective.","zh":"在英语里，“I”是主格（nominative），而“me”是宾格/宾语格（objective）。"},{"en":"Use the nominative form after “and” when it is the subject: “She and I are ready.”","zh":"当“and”连接的部分作主语时，用主格形式：“She and I are ready.”（她和我准备好了。）"}]},{"partOfSpeech":"n.","definition":{"en":"(Grammar) the nominative case; the case used for the subject of a sentence.","zh":"（语法）主格；用于表示句子主语的格。"},"examples":[{"en":"Latin has a nominative, an accusative, and several other cases.","zh":"拉丁语有主格、宾格以及其他一些格。"},{"en":"The subject “the dog” is in the nominative in “The dog barked.”","zh":"在“The dog barked.”中，主语“the dog”处于主格（nominative）。"}]}],"synonyms":["subjective","subject case","nominative case"],"phonetic":"/ˈnɑməˌneɪtɪv/","extraExplanation":["英语里“名词”几乎不靠词形变化来标主格/宾格，但“人称代词”变化很明显：I/he/she/we/they（主格）对应 me/him/her/us/them（宾格）。","有些学习者会纠结“between you and I”。在标准书面语中，between 是介词，后面通常用宾格：between you and me；但口语里 sometimes 会出现 between you and I。"]}
{"word":"nominatively","summary":{"en":"“Nominatively” means either (1) in the nominative case (subject form) in grammar, or (2) by name/nominally (more formal and less common than “nominally”).","zh":"“nominatively”可指（1）语法上的主格意义（主语形式）；也可指（2）名义上/按称号而言（较正式，且不如 nominally 常用）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the nominative case (the grammatical case typically used for the subject of a sentence).","zh":"以主格（通常表示句子主语的语法格）的方式；在主格意义上。"},"examples":[{"en":"In Latin, the word is listed nominatively in many dictionaries.","zh":"在拉丁语里，很多词典会用主格形式来列出这个词。"},{"en":"The pronoun is used nominatively as the subject: “He is here.”","zh":"这个代词作主语时用主格：“He is here.”"}]},{"partOfSpeech":"adv.","definition":{"en":"By name or in terms of the title/label, rather than by real function or practice (formal; similar to “nominally”).","zh":"名义上；按名称/称号而言，而不一定代表实际情况（较正式；近似于 nominally）。"},"examples":[{"en":"She was nominatively the manager, but someone else made the decisions.","zh":"她名义上是经理，但真正做决定的是别人。"},{"en":"The committee chair is nominatively in charge of the meeting agenda.","zh":"委员会主席名义上负责会议议程。"}]}],"synonyms":["nominally","in the nominative case","as a subject form"],"phonetic":"/ˈnɑməˌneɪtɪvli/","extraExplanation":["“nominatively”常见于语法/语言学语境，尤其在讲“主格（nominative case）”时：例如英语里 I/he/she/they 常被说成“主格代词”，用于句子主语。","第二个义项在日常英语中不如“nominally”常用；写作时如果只是表达“名义上”，更自然的选择通常是 nominally。"]}
{"word":"nominatives","summary":{"en":"“Nominatives” are nominative forms—words in the nominative case, usually used as the subject of a sentence.","zh":"“Nominatives”指主格形式，即处于主格的词，通常用作句子的主语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar) relating to the nominative case—the form used mainly for the subject of a sentence.","zh":"（语法）与主格有关的；主格形式主要用于句子的主语。"},"examples":[{"en":"In English, “I” is the nominative form, while “me” is objective.","zh":"在英语里，“I”是主格形式，而“me”是宾格/受格形式。"},{"en":"Many languages mark nominative nouns differently from objects.","zh":"许多语言会用不同形式来标记主格名词和宾语。"}]},{"partOfSpeech":"n.","definition":{"en":"A nominative form or word (especially a noun or pronoun) in the nominative case; plural: nominatives.","zh":"主格形式（尤指处于主格的名词或代词）；复数：nominatives。"},"examples":[{"en":"In the sentence “She runs,” “she” is a nominative.","zh":"在句子“She runs”中，“she”是主格形式。"},{"en":"The chart compares nominatives and accusatives in German pronouns.","zh":"这张表对比了德语代词的主格和宾格形式。"}]}],"synonyms":["nominative case forms","subject forms","subject pronouns"],"phonetic":"ˈnɑməˌneɪtɪv","extraExplanation":["“nominative/主格”是格（case）的一种，典型功能是标记“谁在做动作”，也就是句子的主语。英语的格变化不多，主要体现在代词：I/you/he/she/we/they（主格）对应 me/you/him/her/us/them（宾格）。在德语、俄语、拉丁语等语言中，名词也常有明显的主格词尾变化。"]}
{"word":"nominator","summary":{"en":"A nominator is a person or group that proposes someone for a role, award, or election.","zh":"nominator 指正式提出某人担任职位、获得奖项或参选的提名者（个人或团体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that officially suggests or puts someone forward for a position, award, election, or role.","zh":"提名者；推荐人（正式提出某人竞选职位、获得奖项或担任某角色的人或团体）"},"examples":[{"en":"The nominator must explain why the candidate deserves the award.","zh":"提名者必须说明为什么候选人值得获奖。"},{"en":"Each nominator can submit up to three names for the committee.","zh":"每位提名者最多可以为委员会提交三个名字。"},{"en":"She asked her nominator to write a short statement of support.","zh":"她请提名者写一段简短的支持说明。"}]}],"synonyms":["proposer","sponsor","recommend-er","appointer (sometimes)"],"phonetic":"/ˈnɑməˌneɪtər/","extraExplanation":["“nominator”来自动词“nominate”（提名、任命）。常见于奖项评选、选举、招聘或学术推荐等正式场合。","在很多申请系统里，nominator 往往需要填写理由（citation/justification）并提供证明材料或推荐信。","不要和“nominee”（被提名者）混淆：nominator 是提出提名的人，nominee 是被提名的人。"]}
{"word":"nominators","summary":{"en":"“Nominators” means people or groups who formally propose a candidate for a role, award, or election (plural of “nominator”).","zh":"“nominators”指提名者/推荐者，即正式提出候选人参加职位、奖项或选举的人或团体（nominator 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that officially suggests someone (or something) for a position, award, election, or role.","zh":"提名者；推荐者（正式提出某人/某事担任职位、获得奖项、参加选举或担任角色的人或团体）"},"examples":[{"en":"The nominators submitted three names for the scholarship.","zh":"提名者提交了三个奖学金候选人的名字。"},{"en":"Only registered members can act as nominators in this election.","zh":"只有注册会员才能在这次选举中担任提名者。"}]}],"synonyms":["proposers","sponsors","recommenders"],"phonetic":"/ˈnɑməˌneɪtərz/","extraExplanation":["“Nominators”是复数形式，单数是“nominator”。常见搭配：nominator of (someone/something)；act/serve as a nominator（担任提名者）；official nominators（官方提名者）。","词根提示：nominate 来自拉丁语 *nomen*（名字），核心意思是“点名/报出名字来推荐”。","注意区分：nominator（提名者） vs. nominee（被提名者/候选人）。"]}
{"word":"nominatrix","summary":{"en":"Nominatrix means a woman who nominates or proposes someone for a role, award, or election (a rare word today).","zh":"nominatrix 指“女性提名者/推荐者”，即提出某人作为职位、奖项或选举候选人的人（现代英语中较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who nominates (proposes) someone for a position, award, or election; a female nominator","zh":"（较少用）提名人；（女性）提名者、推荐者"},"examples":[{"en":"As the nominatrix, Dr. Lee nominated three candidates for the scholarship.","zh":"作为提名人，李博士为该奖学金提名了三位候选人。"},{"en":"The committee asked each nominatrix to submit a short statement supporting her nominee.","zh":"委员会要求每位提名者提交一份简短说明，以支持她所提名的人选。"}]}],"synonyms":["female nominator","proposer","recommender"],"phonetic":"/ˈnɑːməˌtrɪks/","extraExplanation":["这个词在现代英语中很少见，实际使用时更常说 a nominator（不分性别）或 the person who nominated someone。nominatrix 带有拉丁语来源的“女性形式”词尾 -trix（如 actress、executrix 这类旧式或法律语境中的女性称谓）。","容易与 dominatrix（BDSM 语境中“女支配者”）混淆；两者拼写相近但含义完全不同。"]}
{"word":"nominature","summary":{"en":"Nomenclature means the naming system (or the names) used in a particular subject area.","zh":"nomenclature 指某一学科/领域的命名体系，或该领域所用的一套术语与名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of names or terms used in a particular field (such as science, medicine, law, or technology).","zh":"（某一领域的）命名体系；术语体系（如科学、医学、法律或技术领域）。"},"examples":[{"en":"Medical nomenclature can be confusing for beginners.","zh":"医学术语体系对初学者来说可能很容易让人困惑。"},{"en":"Scientists agreed on a standard nomenclature for the new species.","zh":"科学家们为这个新物种达成了统一的标准命名体系。"}]},{"partOfSpeech":"n.","definition":{"en":"The specific set of names used in a field; the names themselves.","zh":"（某领域中）具体使用的那套名称；这些名称本身。"},"examples":[{"en":"The legal nomenclature in the contract was hard to understand.","zh":"合同里的法律用语（术语）很难理解。"},{"en":"Computer nomenclature changes quickly as new products appear.","zh":"随着新产品出现，计算机相关的术语变化很快。"}]}],"synonyms":["terminology","naming system","taxonomy (in biology)","vocabulary"],"phonetic":"/ˈnoʊmənˌkleɪtʃər/","extraExplanation":["你输入的“nominature”并不是常见的标准英文单词。很多学习者其实想写的是 **nomenclature**（命名体系/术语体系）。如果你原本想表达“提名/任命”，可能是 **nominate**；如果是“主格”，则是 **nominative**。你可以告诉我你看到这个词的句子，我能帮你确认最合适的词。"]}
{"word":"nomine","summary":{"en":"Nomine is Latin for “(in) the name (of),” most often seen in “in nomine,” and it also names a Renaissance music genre.","zh":"Nomine 是拉丁语，意为“以……之名”，多见于短语 in nomine；也可指文艺复兴时期的一类“In Nomine”器乐曲体裁。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, used in English mainly in religious or formal contexts) “in the name (of).” It is the ablative form of Latin nomen (“name”), commonly seen in the phrase in nomine.","zh":"（拉丁语，在英语中多用于宗教或正式语境）“以……之名 / 奉……之名”。nomine 是拉丁语 nomen（“名字”）的离格形式，常见于短语 in nomine。"},"examples":[{"en":"The prayer begins, “In nomine Patris, et Filii, et Spiritus Sancti.”","zh":"祷词常以“In nomine Patris, et Filii, et Spiritus Sancti.”（奉父、子、圣灵之名）开头。"},{"en":"The choir sang a piece titled “In Nomine.”","zh":"合唱团演唱了一首名为《In Nomine》的作品。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) In Nomine: a type of instrumental piece (especially in Renaissance England) based on a melodic line from a section of a mass beginning with the words “in nomine.”","zh":"（音乐）In Nomine：一种器乐曲体裁（尤指英格兰文艺复兴时期），常以弥撒中以“in nomine”开头的一段旋律为素材发展而成。"},"examples":[{"en":"Many English composers wrote “In Nomine” settings for viol consort.","zh":"许多英国作曲家为维奥尔琴合奏写过“ In Nomine ”作品。"}]}],"synonyms":["in the name of","in the name"],"phonetic":"/ˈnɑːmɪneɪ/","extraExplanation":["在英语里，nomine 很少单独当作英语词使用；最常见的是出现在拉丁短语 in nomine（“以……之名”）中。","发音在英语环境里常被英语化为接近“NAH-mi-nay”（美式 IPA 见下），而非严格拉丁语古典发音。"]}
{"word":"nominee","summary":{"en":"A nominee is someone officially named for an award or role; it can also mean a person who holds something in name for someone else (legal/business).","zh":"nominee 指被正式提名的候选人；也可指在法律/商业中代他人名义持有资产或头衔的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is formally suggested or chosen for a position, job, prize, or honor","zh":"被正式提名的人；候选人（用于职位、工作、奖项或荣誉等）"},"examples":[{"en":"She is the nominee for best actress.","zh":"她是最佳女主角的提名者（候选人）。"},{"en":"The committee announced its nominee for chairperson.","zh":"委员会公布了主席人选的提名者。"},{"en":"He was one of three nominees for the scholarship.","zh":"他是该奖学金三位被提名者之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose name is used to hold a title, property, or an account on behalf of another person (often for legal or business reasons)","zh":"名义持有人；代名人（在法律或商业中代他人持有产权、头衔或账户的人）"},"examples":[{"en":"The shares were held by a nominee to protect the investor’s privacy.","zh":"这些股份由名义持有人代持，以保护投资者的隐私。"},{"en":"A nominee director may appear on company documents, but not control the business.","zh":"名义董事可能会出现在公司文件上，但不一定实际控制公司。"}]}],"synonyms":["candidate","contender","appointee","designee","proxy"],"phonetic":"/ˌnɑməˈni/","extraExplanation":["“nominee”来自“nominate（提名）”。在英语文化中，奖项语境里常见搭配是“nominee for + 奖项（例如 nominee for Best Picture）”。注意：被提名（nominee）不等于获奖者（winner）。","在公司/金融语境中，“nominee”偏正式且带法律含义，常与“nominee account（名义账户）”“nominee shareholder（名义股东）”“nominee director（名义董事）”等搭配。具体权利义务通常由合同或法规规定。"]}
{"word":"nomineeism","summary":{"en":"Nomineeism is the practice of using a nominee to hold assets or roles on paper for the real owner, often for privacy.","zh":"Nomineeism 指用“名义持有人/代持”在文件上替真实所有人持有资产或职位，常用于保持隐私。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of using a nominee (a person or company named on paper) to hold assets, shares, or positions for the real owner, often to keep the real owner’s identity private","zh":"“名义持有人/代持”做法：让某个人或公司在文件上作为资产、股份或职位的名义拥有者，实际权益由真正所有人享有，常用于隐藏真实身份"},"examples":[{"en":"The investigation focused on nomineeism used to hide the beneficial owners of the company.","zh":"调查重点在于有人利用“代持/名义持有人”来隐藏公司的实际受益人。"},{"en":"Some jurisdictions restrict nomineeism to reduce money laundering risks.","zh":"一些司法辖区限制“代持”行为，以降低洗钱风险。"}]}],"synonyms":["nominee arrangement","nominee ownership","proxy ownership","fronting"],"phonetic":"/ˌnɑːməˈniːɪzəm/","extraExplanation":["“Nomineeism”不是常见日常用词，更常见的相关表达有：nominee arrangement（代持安排）, nominee shareholder/director（名义股东/名义董事）, beneficial owner（实际受益人/最终所有人）。","在商业与法律语境中，它常与合规议题相关，例如信息披露、反洗钱（AML）与“了解你的客户”（KYC）。有些代持安排可能是合法的隐私或管理需求，但也可能被滥用来逃税、转移资产或掩盖利益冲突。"]}
{"word":"nominees","summary":{"en":"Nominees are people officially proposed for an award, position, or responsibility.","zh":"Nominees 指被正式提名的人，可用于奖项入围、职位候选或某些官方/法律责任与受益的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have been formally suggested for a position, honor, prize, or election.","zh":"被正式提名为某个职位、荣誉、奖项或选举候选的人。"},"examples":[{"en":"The nominees for Best Actor will be announced tomorrow.","zh":"最佳男主角的提名名单将于明天公布。"},{"en":"All nominees must submit a short biography.","zh":"所有被提名者都必须提交一份简短的个人简介。"}]},{"partOfSpeech":"n.","definition":{"en":"People who are nominated by someone else to receive or take responsibility for something (often used in legal or official contexts).","zh":"由他人提名来获得某项权利或承担某项责任的人（常见于法律或官方语境）。"},"examples":[{"en":"The insurance policy allows you to name nominees who will receive the benefit.","zh":"这份保险允许你指定受益人（被提名者）来领取保险金。"},{"en":"The committee reviewed the nominees for the scholarship.","zh":"委员会审查了奖学金的提名人选。"}]}],"synonyms":["candidates","finalists","shortlisted people"],"phonetic":"/ˌnɑːməˈniːz/","extraExplanation":["“Nominee”来自“nominate”（提名）。在奥斯卡、格莱美等颁奖场合里，nominees 指“入围者/提名者”，还不等于最终赢家（winner）。","不同英语地区有时用法略有差别：在一些国家/地区的金融或保险语境里，nominee 可指“指定领取人/受益人”。具体含义通常要看上下文（awards vs. legal/financial）。"]}
{"word":"nominy","summary":{"en":"“Nominee” means someone who has been officially suggested for a position or an award.","zh":"“nominee”指被正式提名的人（如职位或奖项的候选/入围者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has been formally suggested for a job, position, or honor (such as an award)","zh":"被正式提名的人；（职位或奖项等的）被提名者"},"examples":[{"en":"She is a nominee for the Best Actress award.","zh":"她是最佳女主角奖的提名者之一。"},{"en":"Each party announced its nominee for mayor.","zh":"各政党公布了各自的市长候选（被提名）人。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose name is on an official list to be chosen later","zh":"列入正式候选名单、等待最终选择的人"},"examples":[{"en":"The committee will interview the nominees next week.","zh":"委员会将于下周面试候选人。"},{"en":"Only nominees can vote in the final round.","zh":"只有入围者才能在最后一轮投票。"}]}],"synonyms":["candidate","finalist","appointee (in some contexts)"],"phonetic":"/ˌnɑməˈni/","extraExplanation":["“nominy”在现代英语里并不是常见标准拼写。你很可能想写的是 **nominee**（被提名者）。","相关词：**nominate**（vt. 提名）和 **nomination**（n. 提名；提名资格）。例如：They nominated her for the prize.（他们提名她获奖。）"]}
{"word":"nomism","summary":{"en":"Nomism is the belief that strict obedience to laws or rules—especially religious law—is the main basis for being morally right or accepted.","zh":"Nomism 指一种“律法主义/守法主义”观念：认为严格遵守律法或规则（尤指宗教律法）是获得道德正当性或被接纳的关键。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief that following a set of laws or rules (especially religious law) is the main way to be morally right or accepted; legalism","zh":"（尤指宗教层面的）守法主义/律法主义：认为遵守一套律法或规则是获得道德正当性或被接纳的主要方式"},"examples":[{"en":"Some critics say his faith turns into nomism—he focuses more on rules than on compassion.","zh":"一些批评者说他的信仰变成了律法主义——他更关注规则而不是怜悯。"},{"en":"In that debate, nomism was contrasted with the idea of grace.","zh":"在那场辩论中，律法主义与“恩典”的观念形成对比。"}]}],"synonyms":["legalism","rule-based morality","law-keeping (in theology)"],"phonetic":"/ˈnoʊmɪzəm/","extraExplanation":["“Nomism”较少在日常英语中使用，更常见于神学、宗教研究或哲学讨论中。它来自希腊语词根 *nomos*（法律、规条）。","在基督教神学语境里，它常被用来批评“只靠守律法就能得救/称义”的倾向，因此常与“grace（恩典）”“faith（信心）”等概念对照讨论。"]}
{"word":"nomisma","summary":{"en":"Nomisma means a coin or money, especially in ancient Greek and Byzantine contexts.","zh":"Nomisma 指“硬币/货币”，尤用于古希腊与拜占庭语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coin; especially an ancient Greek or Byzantine coin (or, more broadly, money/currency in those contexts).","zh":"硬币；尤指古希腊或拜占庭时期的硬币（也可泛指当时的货币/钱币）。"},"examples":[{"en":"The museum displayed a gold nomisma from the Byzantine Empire.","zh":"博物馆展出了一枚拜占庭帝国的金币（nomisma）。"},{"en":"In the text, “nomisma” refers to money used in everyday trade.","zh":"在这段文字里，“nomisma”指日常交易中使用的货币。"}]}],"synonyms":["coin","currency","money","solidus"],"phonetic":"/noʊˈmɪzmə/","extraExplanation":["“Nomisma”源自希腊语 νόμισμα（nómisma），与“法律、习俗/惯例”（νόμος，nómos）同源，原意有“被认可、合法流通之物”的含义，因此常用于古代文献中表示“铸币/通货”。","在历史语境中，它有时特指拜占庭的金币（后来常被称为“solidus”），但在不同作者或研究中也可能泛指“钱币”。阅读历史或考古材料时，最好结合具体年代与地区理解。"]}
{"word":"nomismata","summary":{"en":"Nomismata are Byzantine-era coins (plural of nomisma), often referring to gold currency; sometimes used more broadly to mean money in Greek historical contexts.","zh":"Nomismata 是 nomisma 的复数，指拜占庭时期的硬币（常为金币）；在部分希腊历史语境中也可泛指“钱/货币”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “nomisma”: ancient Byzantine (Eastern Roman) coins, especially gold coins used in trade and taxation.","zh":"“nomisma”的复数：拜占庭（东罗马）时期的货币，尤指用于贸易和征税的金币。"},"examples":[{"en":"Archaeologists found several nomismata in the ruins of the port city.","zh":"考古学家在那座港口城市的遗址中发现了几枚拜占庭金币（nomismata）。"},{"en":"The merchant paid in nomismata to ensure the deal was accepted across borders.","zh":"商人用拜占庭金币（nomismata）付款，以确保这笔交易在跨境时也被接受。"}]},{"partOfSpeech":"n.","definition":{"en":"(in historical or academic writing) coins or currency in Greek-speaking contexts; money.","zh":"（历史/学术语境）希腊语世界中的“钱、货币、硬币”的统称。"},"examples":[{"en":"The text uses nomismata to refer broadly to money rather than a single coin type.","zh":"这段文字用 nomismata 来泛指“钱”，而不是某一种具体硬币。"}]}],"synonyms":["Byzantine gold coins","nomisma (singular)","coinage","currency"],"phonetic":"/noʊˈmɪzmətə/","extraExplanation":["词源来自希腊语 νόμισμα（nomisma），与“法律/惯例/通行规范”（νόμος）同源，含义是“被认可为通用的货币”。","在拜占庭史研究中，nomisma 常指相当于“索利德斯”（solidus）体系的金币单位；不同作者可能用它指代具体金币或更宽泛的货币概念，阅读时可结合上下文判断。"]}
{"word":"nomisms","summary":{"en":"Nomism (plural: nomisms) is an academic term for a law-centered approach, especially in religion—emphasizing rules or commandments as central.","zh":"Nomism（复数 nomisms）是学术用语，指以“律法/规则”为核心的取向，尤其常用于宗教研究，强调诫命与规条的重要性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural: nomisms) A belief system or religious attitude that emphasizes following laws, rules, or commandments (especially God’s law) as central to the faith.","zh":"（复数：nomisms）一种强调遵守法律、规条或诫命（尤其是上帝的律法）为信仰核心的思想或宗教态度。"},"examples":[{"en":"Some scholars discuss different nomisms in ancient religions, comparing how each tradition understood divine law.","zh":"一些学者会讨论古代宗教中的不同“律法主义取向”（nomisms），比较各传统如何理解神圣律法。"},{"en":"In that community, strict nomism shaped daily life, from food rules to worship habits.","zh":"在那个群体中，严格的“律法中心”取向影响了日常生活，从饮食规定到礼拜习惯。"}]},{"partOfSpeech":"n.","definition":{"en":"(In academic writing) A specific theory about how “law” (rules, norms) relates to morality, religion, or social order.","zh":"（学术语境）关于“法律/规范”（规则、准则）如何与道德、宗教或社会秩序相关的一种具体理论。"},"examples":[{"en":"The article contrasts nomism with approaches that focus more on personal conscience than on rules.","zh":"这篇文章将“律法取向”（nomism）与更强调个人良知而非规则的方法作对比。"},{"en":"Her dissertation examined nomisms in early Christian and Jewish texts.","zh":"她的论文研究了早期基督教与犹太文献中的不同“nomism”观点。"}]}],"synonyms":["legalism","rule-based belief","law-centered approach"],"phonetic":"/ˈnoʊ.mɪz.əm/","extraExplanation":["“nomism”来自希腊语 *nomos*（法律、习俗、规范）。在宗教研究里常见于“covenantal nomism（盟约律法主义）”这一术语：用来描述一种观点——人进入群体/与神建立关系是基于“盟约/恩典”，但维持群体身份与生活秩序需要遵守律法。","“nomisms”是复数形式，通常出现在学术讨论中，用来表示“不同类型的nomism/不同传统中的律法取向”。"]}
{"word":"nomistic","summary":{"en":"Nomistic means “related to law or rule-based systems,” especially in academic or religious discussions about obedience to laws/commandments.","zh":"Nomistic 指“与法律或以规则为核心的体系有关”，常用于学术或宗教讨论中，强调对律法/诫命的遵从。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to law, rules, or legal regulations; based on established rules (often used in academic or religious contexts).","zh":"与法律、规章或法令有关的；以既定规则为基础的（常见于学术或宗教语境）。"},"examples":[{"en":"The paper compares nomistic approaches to morality with virtue ethics.","zh":"这篇论文把“以规则/律法为核心”的道德观与德性伦理学作比较。"},{"en":"Some scholars describe parts of ancient Judaism as strongly nomistic, emphasizing obedience to the law.","zh":"一些学者认为古代犹太教的某些方面具有很强的“律法主义/守律倾向”，强调对律法的遵从。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of or relating to religious “legalism,” focusing on following laws or commandments as the main way to be righteous.","zh":"（宗教语境）与“律法主义/守律”有关：把遵守律法或诫命视为获得义/正当性的主要方式。"},"examples":[{"en":"He argues that a purely nomistic faith can miss the spirit behind the commandments.","zh":"他认为，纯粹的律法主义式信仰可能会忽略诫命背后的精神。"},{"en":"The sermon warned against nomistic thinking that reduces religion to rules alone.","zh":"讲道提醒人们警惕把宗教简化成一堆规则的“律法主义思维”。"}]}],"synonyms":["legalistic","rule-based","regulatory","juridical","law-related"],"phonetic":"/noʊˈmɪs.tɪk/","extraExplanation":["“nomistic”非常少见，更多学术写作会用“legalistic”（法律/教条式的、拘泥条文的）或在宗教研究中用“nomism / nomistic”。","词源上常与希腊语“nomos（法律、习俗、规范）”相关，因此带有“以规则/律法为核心”的含义。","拼写上也常被与“gnomic/gnomistic（格言式的、警句式的）”混淆；两者含义不同：gnomic偏“格言、箴言”，nomistic偏“律法、规则”。"]}
{"word":"nomnem","summary":{"en":"“Nomnem” is a playful internet way to show happy eating or that food is delicious (more commonly written “nom nom”).","zh":"“nomnem”是俏皮的网络表达，用来表示吃得很香或食物很好吃（更常见写法是“nom nom”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang) The sound or word people use to show they are eating happily or that food looks very tasty (similar to “yum yum”).","zh":"（网络用语/拟声）用来表示“吃得很香/看起来很好吃”的声音或词（类似“yum yum/好吃好吃”）。"},"examples":[{"en":"Nom nom—this pizza is amazing.","zh":"nom nom——这披萨太好吃了。"},{"en":"I made chocolate cookies. Nomnem!","zh":"我做了巧克力曲奇。nomnem！（表示好吃/开吃啦）"}]}],"synonyms":["nom nom","yum","yummy","delicious","tasty"],"phonetic":"/nɑm/","extraExplanation":["“nom nom”是更常见的拼写；“nomnem”多见于个人习惯或可爱化的变体写法。","常用于聊天、弹幕、标题或配图文字，有时也会写成“nom nom nom”来强调吃得更起劲。","语气偏俏皮、可爱，通常不用于正式写作。"]}
{"word":"nomo","summary":{"en":"“nomo” is an informal shortening of “no more,” used mostly in casual contexts.","zh":"“nomo”是“no more”的非正式缩写，主要用于口语或网络语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, mainly in texting or casual speech) Short for “no more.”","zh":"（非正式，多见于短信/口语）“no more（不再、没有更多）”的缩写。"},"examples":[{"en":"NoMo drama—I’m done with it.","zh":"不再有那些戏剧化的麻烦了——我不想再管了。"},{"en":"After tonight, NoMo excuses.","zh":"从今晚开始，不再找借口。"}]}],"synonyms":["no more","not anymore","no longer"],"phonetic":"/ˈnoʊmoʊ/","extraExplanation":["“nomo/NoMo”常见于口语、社交媒体或广告标语中，用来制造简短、有力的语气（类似口号）。正式写作里建议写全：no more。","在不同语境里也可能是专有名词（比如活动/项目名或昵称），这时含义要看上下文。"]}
{"word":"nomocanon","summary":{"en":"A nomocanon is a book that combines church canon law with civil law, especially in the Byzantine/Eastern Orthodox tradition.","zh":"nomocanon 指把教会法与世俗法律合编在一起的法典/汇编，常见于拜占庭与东正教传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A collection or book that combines church rules (canon law) with civil laws, especially in the Eastern Orthodox/Byzantine tradition.","zh":"（尤指东正教/拜占庭传统中的）《教会法规与世俗法律合编》，把教会法（canon law）与国家/民法条文汇编在一起的书。"},"examples":[{"en":"The historian consulted a nomocanon to see how church law and imperial law interacted.","zh":"历史学家查阅《教会法规与世俗法律合编》，以了解教会法与帝国法如何相互影响。"},{"en":"In some Orthodox contexts, a nomocanon guided clergy on both religious rules and legal duties.","zh":"在一些东正教语境中，《教会法规与世俗法律合编》为神职人员提供宗教规条与法律义务两方面的指导。"}]}],"synonyms":["canon-law compendium","ecclesiastical law code","law-and-canon collection"],"phonetic":"/ˌnoʊməˈkænən/","extraExplanation":["词源：来自希腊语 *nomos*（法律）+ *kanon*（规条、教规）。因此它的核心含义就是“法（世俗）+教规（宗教）”的合编。","使用语境：这个词多见于教会史、拜占庭史、东正教法制史等学术写作中，日常英语里很少使用。"]}
{"word":"nomocracy","summary":{"en":"Nomocracy means rule by laws—the idea that law is above rulers.","zh":"Nomocracy 指“法治”，强调法律高于统治者个人意志。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"government or rule based on laws; the principle that laws—not individual rulers—are supreme (the rule of law).","zh":"法治；以法律为最高权威的统治原则（法律至上，而非个人或家族的意志）。"},"examples":[{"en":"The constitution was designed to support nomocracy rather than rule by a single leader.","zh":"这部宪法旨在支持法治，而不是由单一领导人统治。"},{"en":"In a nomocracy, even powerful officials must follow the same laws as ordinary citizens.","zh":"在法治之下，即使是有权势的官员也必须遵守与普通公民相同的法律。"}]}],"synonyms":["rule of law","government by law","legalism (context-dependent)"],"phonetic":"/noʊˈmɑːkrəsi/","extraExplanation":["词源来自希腊语：nomos（法律、习俗、规范）+ -cracy（统治、政体）。这个词在日常英语里比较少见，更常见的表达是 rule of law（法治）或 government by law（依法治理）。","在政治学或法律讨论中，nomocracy 常用来强调“法律高于个人意志”，与 autocracy（专制）、oligarchy（寡头政治）等概念形成对比。"]}
{"word":"nomogenist","summary":{"en":"A rare term for someone who supports nomogenesis—evolution guided by internal laws rather than mainly by chance variation and natural selection.","zh":"较少见：指支持“定律发生说（nomogenesis）”的人，认为进化主要受内部规律引导，而非主要由随机变异与自然选择驱动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or studies nomogenesis—the idea that evolution is guided by internal laws or constraints rather than being driven mainly by random variation and natural selection","zh":"主张或研究“定律发生说（nomogenesis）”的人；认为进化主要受内部规律/限制所引导，而非主要由随机变异与自然选择推动"},"examples":[{"en":"Some early 20th-century biologists were described as nomogenists because they doubted that chance variation and natural selection could explain all evolutionary change.","zh":"一些20世纪早期的生物学家被称为“nomogenist”，因为他们怀疑仅靠偶然变异与自然选择无法解释所有进化变化。"},{"en":"In that essay, the author contrasts Darwinism with nomogenist views of evolution.","zh":"在那篇文章中，作者把达尔文主义与“nomogenist”的进化观作了对比。"}]}],"synonyms":["supporter of nomogenesis","nomogenesis advocate"],"phonetic":"/ˌnoʊməˈdʒɛnɪst/","extraExplanation":["这个词非常少见，多出现在科学史/进化论争论的语境里。它来自 nomogenesis（定律发生说/规律发生说）+ -ist（表示“某种主义的支持者/从业者”）。","相关概念包括：orthogenesis（直线进化论，强调进化有方向性）以及“evolutionary constraints（进化约束）”。现代生物学通常仍以自然选择与遗传机制为核心，但也会讨论“约束、发育规律”等对进化路径的影响。"]}
{"word":"nomogenous","summary":{"en":"Nomogenous is a rare adjective meaning “law-governed” or “developing according to fixed rules,” used mainly in scientific contexts.","zh":"Nomogenous 是一个罕见的形容词，意为“受规律/法则支配的、按固定规则发展的”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, scientific) Producing or governed by laws; developing according to fixed rules rather than by chance.","zh":"（罕见，科学用语）产生或受规律/法则支配的；按固定规则发展而非偶然发生的。"},"examples":[{"en":"Some early 20th‑century biologists argued for a nomogenous view of evolution, emphasizing internal laws of development.","zh":"一些20世纪早期的生物学家主张一种“nomogenous”的进化观，强调发育的内在规律。"},{"en":"In this framework, variation is treated as nomogenous rather than purely random.","zh":"在这一框架中，变异被视为“nomogenous”的，而不完全是随机的。"}]}],"synonyms":["law-governed","rule-based","deterministic"],"phonetic":"/noʊˈmɑːdʒənəs/","extraExplanation":["这个词非常少见，常见于与“nomogenesis（定律发生说/规律进化论）”相关的讨论，词根来自希腊语 *nomos*（法则、规律）+ *-genous*（产生……的）。","学习中更容易混淆的是 **homogeneous/homogenous（同质的、均匀的）**。如果你的意思是“成分一致/均匀”，大概率想写的是 **homogeneous**。"]}
{"word":"nomogeny","summary":{"en":"Nomogeny is a rare noun for the view that evolution is law-governed or constrained rather than mainly random.","zh":"Nomogeny 是一个少见名词，指“演化受规律/约束主导”的观点，而非主要由随机性驱动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the idea that biological evolution (or development in nature) is guided by fixed laws or constraints rather than mainly by random variation and natural selection; a less common term related to “nomogenesis.”","zh":"（较少用）“法则生成说/法则导向的演化观”：认为生物演化（或自然发展）主要受固定规律或内在限制所引导，而不是主要由随机变异与自然选择驱动；与 nomogenesis（法则生成说）相关。"},"examples":[{"en":"Some early 20th-century writers argued for nomogeny, claiming evolution follows predetermined laws.","zh":"一些20世纪早期的作者主张“nomogeny”，认为演化遵循预先确定的规律。"},{"en":"In that framework, nomogeny downplays chance and emphasizes constraints in how species can change.","zh":"在这种框架中，“nomogeny”弱化偶然性，强调物种变化受到限制与约束。"}]}],"synonyms":["nomogenesis","law-governed evolution","orthogenesis (related, not identical)"],"phonetic":"/noʊˈmɑdʒəni/","extraExplanation":["该词由希腊语词根 nomo-（法则、规范）+ -geny（生成、起源）构成，属于学术性、历史性术语，现代生物学讨论中更常见的是“nomogenesis”。","相关背景常被提到的是俄国/苏联生物学家列夫·伯格（Lev Berg）在20世纪初提出的“nomogenesis”思想：强调演化方向受内在规律与结构限制影响，而非完全由随机性驱动。"]}
{"word":"nomogram","summary":{"en":"A nomogram is a calculation chart: you draw a line across scales to read the answer.","zh":"nomogram 指用于“画线计算”的图表（诺模图/列线图）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chart or diagram with scales that lets you calculate a value by drawing a straight line between known values (used before calculators and still used in some fields)","zh":"诺模图；列线图：一种带刻度的图表，通过在已知数值之间画直线来快速求出未知值（计算器普及前很常用，现在在部分领域仍会用）"},"examples":[{"en":"The doctor used a nomogram to estimate the patient’s risk score.","zh":"医生用诺模图来估算患者的风险评分。"},{"en":"Before computers, engineers often relied on nomograms for quick calculations.","zh":"在电脑出现之前，工程师常用诺模图来快速计算。"}]}],"synonyms":["nomograph","alignment chart"],"phonetic":"/ˈnɑməˌɡræm/","extraExplanation":["词源提示：nomogram 来自希腊语词根 nomo-（与“规律、法则”相关）和 -gram（“图、写画的东西”）。它的核心思想是把公式“画出来”，用直尺连线就能读出结果。","常见使用场景：医学（风险/预后评分）、工程（近似计算）、统计与数据分析（可视化计算）。现代更多是教学、快速估算或作为图形化工具的补充。"]}
{"word":"nomograms","summary":{"en":"Nomograms are graphical charts used to calculate or estimate values by lining up known values.","zh":"Nomograms（列线图）是通过连线已知数值来计算或估算结果的图形图表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nomogram (plural: nomograms/nomographs) is a graphical calculating chart that lets you estimate a value by drawing a straight line between known values.","zh":"列线图（复数：nomograms/nomographs）是一种图形计算图表，通过在已知数值之间连线来估算未知数值。"},"examples":[{"en":"Doctors sometimes use nomograms to estimate a patient’s risk based on several measurements.","zh":"医生有时会用列线图根据多项测量值来估算患者的风险。"},{"en":"Before computers were common, engineers relied on nomograms for quick calculations.","zh":"在电脑尚未普及之前，工程师常用列线图进行快速计算。"}]}],"synonyms":["nomographs","graphical calculator","calculation chart"],"phonetic":"/ˈnɑməˌɡræm/","extraExplanation":["“nomogram”常见于医学统计（风险预测、预后模型）、工程与导航等领域。它通常由多条刻度线组成，把几个变量放在同一张图上，通过直线连接来读出结果，因此也常被译作“列线图”。现代研究论文中，你可能会看到“nomogram model / prognostic nomogram（预后列线图）”。"]}
{"word":"nomograph","summary":{"en":"A nomograph is a calculation chart that lets you find an answer by lining up scales or drawing a straight line.","zh":"nomograph 是一种用对齐刻度或画直线来得到计算结果的列线图（诺模图）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chart or diagram used to calculate a value by drawing a line (or aligning scales) instead of doing arithmetic.","zh":"列线图；诺模图：一种用画线（或对齐刻度）来计算数值的图表，代替繁琐的手算。"},"examples":[{"en":"Before calculators were common, engineers often used a nomograph to estimate results quickly.","zh":"在计算器普及之前，工程师常用列线图来快速估算结果。"},{"en":"The doctor used a nomograph to convert a child’s height and weight into a dosage range.","zh":"医生用列线图把孩子的身高体重换算成用药剂量范围。"},{"en":"This nomograph helps you find wind chill by connecting temperature and wind speed.","zh":"这张列线图通过连接气温和风速，帮助你找到体感温度。"}]}],"synonyms":["nomogram","alignment chart"],"phonetic":"/ˈnoʊməˌɡræf/","extraExplanation":["“nomograph”由希腊语词根构成：nomo-（法律/规则）+ -graph（书写/绘图），字面有“把规则画出来”的意思。它把数学关系用若干刻度线表示，你用直尺连线就能读出答案。","在工程、航海、气象、医学剂量换算等领域，列线图曾非常重要；如今多被电子计算取代，但在快速估算、教学可视化或缺乏设备的场景仍有价值。","相关词：nomography（列线图法/诺模图学）；也常被归入“analog computing（模拟计算）”的一种形式。"]}
{"word":"nomographer","summary":{"en":"A nomographer is someone who designs or uses nomograms—charts that let you calculate visually.","zh":"nomographer 指设计或使用诺莫图（列线图）的人，用图表来进行可视化计算。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who creates or uses nomograms (graphic calculation charts) to solve mathematical or engineering problems.","zh":"列线图（诺莫图）制作者或使用者：制作或使用“列线图/诺莫图”（一种图形计算图表）来解决数学或工程问题的人。"},"examples":[{"en":"Before electronic calculators were common, a nomographer could quickly estimate results using a nomogram.","zh":"在电子计算器普及之前，列线图制作者/使用者可以用诺莫图快速估算结果。"},{"en":"The engineer consulted a nomographer to design a nomogram for fluid‑flow calculations.","zh":"这位工程师请教了一位列线图专家，来设计用于流体流动计算的诺莫图。"}]}],"synonyms":["nomogram designer","nomogram maker","chart calculator (contextual)"],"phonetic":"ˈnoʊməˌɡræfɚ","extraExplanation":["“Nomogram（诺莫图/列线图）”是一种把公式变成图形的工具：把不同变量放在几条刻度线上，用直尺连线就能读出结果。它在20世纪早期的工程、航海、医学剂量计算等领域很常见。","词源提示：nomo- 来自希腊语，和“law/measure（规则、度量）”相关；-graph / -grapher 表示“绘图/记录者”。因此 nomographer 字面上就是“画出度量/计算图表的人”。"]}
{"word":"nomographic","summary":{"en":"Nomographic means “related to nomograms or nomography (graph-based calculation).”","zh":"nomographic 意为“与列线图或列线图法（用图表连线进行计算）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to nomography: the use or design of nomograms (charts that let you calculate values by drawing lines instead of doing algebra).","zh":"与列线图法（nomography）有关的；指使用或设计列线图（通过在图表上连线来进行计算，而不是直接做代数运算）。"},"examples":[{"en":"The handbook includes a nomographic chart for estimating dosage quickly.","zh":"这本手册包含一张列线图，用于快速估算剂量。"},{"en":"Engineers once relied on nomographic methods before calculators became common.","zh":"在计算器普及之前，工程师常常依靠列线图法来计算。"}]}],"synonyms":["nomographical","nomogram-based","graphical (in calculation contexts)"],"phonetic":"/ˌnoʊ.məˈɡræf.ɪk/","extraExplanation":["词源提示：nomography 来自希腊语成分 nomo-（“法则、规律”）+ -graphy（“书写、绘制”）。因此 nomographic 常用于科学、工程、医学等语境，强调“用图形按规律求解”。","文化/使用背景：在电子计算器和电脑普及之前，列线图（nomogram）是一种很实用的“图形计算工具”。现代仍能在一些快速估算或教学资料中见到。"]}
{"word":"nomographical","summary":{"en":"Nomographical means “related to nomography/nomograms,” i.e., solving calculations with graphical charts.","zh":"nomographical 指“与列线图法/列线图有关的”，即用图形计算图表来进行求解或估算。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to nomography (also called nomograms): the method of solving mathematical or engineering problems using graphical calculating charts.","zh":"与列线图法（nomography，也叫 nomogram 列线图）有关的：指用图形计算图表来求解数学或工程问题的方法。"},"examples":[{"en":"Nomographical methods were widely used before digital calculators became common.","zh":"在电子计算器普及之前，列线图法（nomographical methods）曾被广泛使用。"},{"en":"The textbook includes a nomographical chart for estimating fluid flow rates.","zh":"这本教材包含一张用于估算流体流量的列线图（nomographical chart）。"}]}],"synonyms":["nomographic","related to nomograms","graphical (in calculation context)"],"phonetic":"/ˌnoʊməˈɡræfɪkəl/","extraExplanation":["“Nomographical” 来自 “nomography”，其核心是用一张或多张刻度线/曲线的图（nomogram）把公式“画出来”，使用时用直尺连线或读取交点就能得到近似结果。","该词较少出现在日常英语中，更常见于工程、测绘、航海、医学剂量估算等历史或专业语境。现代写作里也常用 “nomogram” 或 “nomographic/nomographical” 来描述这类图表。"]}
{"word":"nomographically","summary":{"en":"“Nomographically” means “by using a nomogram (calculation chart).”","zh":"“nomographically”表示“用诺模图（计算图表）来进行计算/表示关系”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a nomographic way; using a nomogram (a special chart) to calculate or represent relationships between variables","zh":"以诺模图（nomogram，计算图表）的方式；用图表来计算或表示变量之间关系"},"examples":[{"en":"The engineer estimated the pressure drop nomographically using a standard nomogram.","zh":"工程师用一张标准诺模图以“诺模方式”估算了压降。"},{"en":"Before calculators were common, some medical doses were checked nomographically.","zh":"在计算器普及之前，一些药物剂量会用诺模图方式进行核对。"}]}],"synonyms":["using a nomogram","graphically","by graphical methods"],"phonetic":"/ˌnoʊməˈɡræfɪkli/","extraExplanation":["“Nomography（诺模学/诺模图法）”在20世纪早期到中期较常见，用来在没有电子计算器的年代快速做工程、航海、医学等领域的近似计算。它的核心工具是 nomogram：把公式转成一套刻度线，使用直尺连线即可读出结果。"]}
{"word":"nomographies","summary":{"en":"Nomographies are methods or sets of nomographs used for quick graphical calculation.","zh":"Nomographies 指用于快速图解计算的列线图方法或一组列线图。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of nomography: the use or design of nomographs (graphical charts) to solve mathematical formulas quickly by drawing lines or reading scales.","zh":"nomography（列线图/诺模图计算法）的复数：指使用或设计“列线图/诺模图”（一种图表）来快速求解数学公式的方法，通常通过连线或读刻度得到结果。"},"examples":[{"en":"Before digital calculators, engineers often relied on nomographies to estimate results quickly in the field.","zh":"在数字计算器普及之前，工程师常常依靠列线图计算法在现场快速估算结果。"},{"en":"The textbook includes several nomographies for converting units and checking design parameters.","zh":"这本教材包含了好几种列线图计算法图表，用于单位换算和核对设计参数。"}]}],"synonyms":["nomograms","nomographs (as charts)","graphical calculation methods"],"phonetic":"/nəˈmɑɡrəfiz/","extraExplanation":["“Nomography”通常与“nomograph（列线图/诺模图）”一起出现：nomograph 是那张图表；nomography 是使用/制作这种图表的方法。","这种工具在20世纪的工程、航空、航海、医学剂量估算等场景很常见，因为它能在没有电子设备时实现快速近似计算。"]}
{"word":"nomography","summary":{"en":"Nomography is calculating with nomograms—special charts that give answers by aligning scales (often with a straightedge).","zh":"Nomography 指用诺模图进行计算：通过对齐刻度（常用直尺连线）来快速读出答案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the method or science of doing calculations by using a nomogram (a special chart with scales that lets you get results by drawing a straight line)","zh":"用诺模图（nomogram，一种带刻度的计算图表）进行计算的方法或学科；通过在图上连线快速读出结果"},"examples":[{"en":"Before electronic calculators were common, engineers sometimes used nomography to estimate results quickly.","zh":"在电子计算器普及之前，工程师有时会用诺模作图法来快速估算结果。"},{"en":"Nomography can turn a complicated formula into a simple chart you can use with a ruler.","zh":"诺模作图法可以把复杂公式变成一张简单图表，用直尺就能操作。"}]}],"synonyms":["calculation by nomogram","graphical calculation","nomogram method"],"phonetic":"/noʊˈmɑɡrəfi/","extraExplanation":["词源提示：nomography 来自希腊语词根 nomos（“法则/规律”）+ -graphy（“书写/绘图的方法”）。","常见场景：在航空、航海、工程设计、医学剂量估算等领域，曾经用诺模图把多变量公式“图形化”，便于现场快速计算。现在多被软件取代，但在理解变量关系和快速近似时仍有价值。"]}
{"word":"nomoi","summary":{"en":"Nomoi means “laws/customs,” especially in ancient Greek and philosophical contexts (plural of nomos).","zh":"Nomoi 指“法律/习俗/规范”，多用于古希腊与哲学语境，是 nomos 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) laws, customs, or social norms—especially in ancient Greek contexts.","zh":"（复数）法律、习俗或社会规范——尤指古希腊语境中的“法/俗”。"},"examples":[{"en":"In ancient Greek writing, nomoi could mean both written laws and long-standing customs.","zh":"在古希腊著作中，nomoi 既可以指成文法，也可以指长期形成的习俗。"},{"en":"The philosopher compared good nomoi with harmful customs that people follow blindly.","zh":"这位哲学家把良好的 nomoi 与人们盲从的有害陋习作了对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(In philosophy, especially Plato) the laws or institutions of a city-state; sometimes used as a title for Plato’s dialogue “Laws.”","zh":"（哲学用语，尤指柏拉图）城邦的法律或制度；有时也用来指柏拉图对话录《法律篇》（Laws）。"},"examples":[{"en":"Scholars discuss Plato’s nomoi when talking about his ideal legal system.","zh":"学者在讨论柏拉图的理想法律体系时，会谈到他的 nomoi。"},{"en":"A seminar on the Nomoi focused on education, virtue, and civic order.","zh":"一门关于《Nomoi》的研讨课聚焦于教育、美德与城邦秩序。"}]}],"synonyms":["laws","customs","norms","conventions","institutions"],"phonetic":"/ˈnoʊmɔɪ/","extraExplanation":["Nomoi 是希腊词 nomos 的复数。nomos 的核心感觉是“被认可的规则”：它既可以是国家制定的法律，也可以是社会长期形成、大家默认遵守的习惯与规范。","在英文人文与古典学写作里，nomoi 常用来强调“法律与文化习俗交织在一起”的概念，比单说 laws 更带有古希腊思想背景。","拼写提示：单数是 nomos，复数是 nomoi；在英文论文中有时会保留这种希腊语复数形式来显得更“古典学/哲学”语境。"]}
{"word":"nomological","summary":{"en":"Nomological means “related to general laws,” especially scientific laws and law-based explanations.","zh":"nomological 指“与一般规律/法则相关的”，常用于强调以科学规律为基础的解释。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to laws (especially scientific laws) or to the study of general laws.","zh":"与“规律/法则”（尤其是科学规律）有关的；或指研究一般规律的。"},"examples":[{"en":"Nomological explanations try to show that an event followed a general law.","zh":"规律性解释试图说明某个事件是遵循一般规律发生的。"},{"en":"In physics, many models aim for nomological statements that apply broadly.","zh":"在物理学中，许多模型追求具有普遍适用性的规律性表述。"}]}],"synonyms":["law-based","law-governed","rule-based","general","systematic"],"phonetic":"/ˌnoʊməˈlɑːdʒɪkəl/","extraExplanation":["“nomological”较常见于哲学、科学方法论与社会科学写作中，通常和“law（法则）”以及“explanation（解释）”搭配，如“nomological explanation（规律性解释）”。","词源上与希腊语 *nomos*（法律、规范）有关，因此它强调的是“由一般法则所支配/可归入法则”的意义。常与“idiographic（个别描述的、重个案的）”相对：nomological关注普遍规律，idiographic关注独特个案。"]}
{"word":"nomologies","summary":{"en":"Nomologies are studies or systems of laws/principles, especially in science or philosophy.","zh":"nomologies 指对法则/规律的研究或一套法则体系，常见于科学与哲学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or formulation of laws, especially scientific or philosophical laws (principles that describe regular patterns).","zh":"法则学；（尤指科学或哲学中的）规律/法则的研究或建立。"},"examples":[{"en":"In physics class, we focused on nomology—how general laws can explain many different events.","zh":"在物理课上，我们学习法则学——一般性规律如何解释许多不同的现象。"},{"en":"Some philosophers debate whether human behavior can be explained through nomology in the same way as nature.","zh":"一些哲学家讨论：人的行为是否也能像自然现象一样，用法则学来解释。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific system, set, or theory of laws or law-like principles.","zh":"一套法则体系；一组（类似法律或自然规律的）原则/理论。"},"examples":[{"en":"Each scientific field develops its own nomologies to organize evidence and make predictions.","zh":"每个科学领域都会形成自己的法则体系，用来整理证据并做出预测。"},{"en":"The book compares different nomologies of ethics across cultures.","zh":"这本书比较了不同文化中的伦理法则体系。"}]}],"synonyms":["laws","principles","theories","law-like generalizations","systems of rules"],"phonetic":"/noʊˈmɑlədʒiz/","extraExplanation":["“nomology”来自希腊语：nomos（法律、规范）+ -logy（学科/研究）。它通常出现在哲学、科学方法论等较学术的语境中。","注意：日常英语里更常说“laws/principles/theory（规律/原则/理论）”。“nomology/nomologies”更正式、更偏学术写作。"]}
{"word":"nomologist","summary":{"en":"Nomologist means a scholar who studies laws or general principles of rules and norms.","zh":"nomologist 指研究法律或一般规则/规范原理的学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialist who studies laws or legal systems, especially in a scholarly or theoretical way.","zh":"法学研究者；研究法律或法律体系的人（尤指偏学术或理论层面）。"},"examples":[{"en":"In his early career, he worked as a nomologist focusing on constitutional theory.","zh":"他早年是一名研究宪法理论的法学研究者。"},{"en":"The conference brought together historians, nomologists, and political scientists.","zh":"这次会议汇集了历史学家、法学研究者和政治学家。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who studies or formulates general principles of rules or norms (sometimes used more broadly than just legal law).","zh":"研究或提出规则/规范一般原理的人（有时含义比“法律”更广）。"},"examples":[{"en":"As a nomologist, she compared social norms across cultures.","zh":"作为研究规范原理的人，她比较了不同文化中的社会规范。"},{"en":"The author writes like a nomologist, turning everyday habits into formal rules.","zh":"这位作者写作风格像研究规则的人，把日常习惯提炼成形式化规则。"}]}],"synonyms":["legal scholar","jurist","legal theorist","law professor"],"phonetic":"/noʊˈmɑlədʒɪst/","extraExplanation":["这个词比较少见，多见于学术语境。它来自希腊语词根：nomos（法律、规范）+ -logist（研究者）。","相关词：nomology（法则学/法理学：研究“规律/法则”的学问），nomological（法则的；常见于“nomological explanation”=用一般规律来解释现象）。日常英语里更常说 legal scholar（法学者）或 jurist（法学家）。"]}
{"word":"nomology","summary":{"en":"Nomology is the study or theory of laws, especially scientific/natural laws.","zh":"Nomology 指对法则/规律的研究或理论，尤指科学或自然定律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study or systematic discussion of laws or principles, especially scientific or natural laws.","zh":"法则学；规律学：对“法则/规律”的研究或系统论述，尤指科学或自然法则。"},"examples":[{"en":"In philosophy of science, nomology asks what it means for a statement to count as a scientific law.","zh":"在科学哲学中，nomology 探讨“什么样的陈述才算科学定律”。"},{"en":"Some researchers compare nomology with methodology: one focuses on laws, the other on methods.","zh":"有些研究者把 nomology 与 methodology 作比较：前者关注法则，后者关注方法。"}]}],"synonyms":["theory of laws","study of laws","nomological theory"],"phonetic":"/nəˈmɑlədʒi/","extraExplanation":["词源：来自希腊语 nomos（“法律、惯例、规范”）+ -logy（“……学；研究”）。因此 nomology 字面意思就是“关于法律/法则的研究”。","使用场景：该词较少用于日常英语，更常见于学术语境（如科学哲学、法哲学、社会科学理论），用来强调“把规律当作定律来系统说明/建模”的角度。","相关概念：nomological 常用作形容词，意为“关于（科学）定律的”。例如：nomological explanation（定律式解释/法则解释）。"]}
{"word":"nomopelmous","summary":{"en":"“nomopelmous” is not recognized as a standard English word; it’s probably a typo or a proper noun from a specific source.","zh":"“nomopelmous”不是标准英语词；更可能是拼写错误或特定来源中的专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/term from a specific context.","zh":"不是标准英语单词；很可能是拼写错误，或是特定语境中的专有名词/术语。"},"examples":[{"en":"I couldn’t find “nomopelmous” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“nomopelmous”——它会不会是拼写错了？"},{"en":"If you share the sentence where you saw it, I can help identify the intended word.","zh":"如果你把看到它的句子发来，我可以帮你判断原本想写的词。"}]}],"phonetic":"ˌnoʊmoʊˈpɛlmoʊs","extraExplanation":["“nomopelmous”看起来不像常见英语构词（前缀/词根/后缀）组合，因此更像是：1）拼写错误；2）某个作品里的虚构词；3）人名/地名/用户名；4）从其他语言转写过来的词。","你可以检查是否想写的是这些更常见的词（按相似度猜测）：\n- nonplussed（困惑的/不知所措的）\n- numerous（许多的）\n- monopolous / monopolous（较少见，常见是 monopoly / monopolize，和“垄断”有关）\n- anomalous（反常的）\n把原句或来源（书名/网页/截图）发来，我能更准确地匹配。"]}
{"word":"nomophylax","summary":{"en":"Nomophylax means a guardian or overseer of the laws, especially in historical Greek contexts.","zh":"Nomophylax 指“法律的守护者/监督者”，多用于古希腊等历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A guardian or overseer of the laws; a person (often an official) responsible for upholding and interpreting legal rules.","zh":"法律的守护者/监督者；负责维护、执行或解释法律规则的人（常指官职）。"},"examples":[{"en":"In some ancient Greek cities, a nomophylax helped ensure that new decisions followed existing laws.","zh":"在一些古希腊城邦中，nomophylax 会确保新的决定符合既有法律。"},{"en":"The historian described the nomophylax as a guardian of legal order rather than a lawmaker.","zh":"历史学家把 nomophylax 描述为法律秩序的守护者，而不是立法者。"}]}],"synonyms":["law guardian","legal overseer","custodian of the law","protector of the laws"],"phonetic":"/ˌnoʊməˈfaɪlæks/","extraExplanation":["该词来自希腊语：nomos（法律）+ phylax（守卫者/守护者）。在古雅典等地，相关官职与监督法律、审查是否合乎法制有关；在拜占庭传统中也可见类似用法。现代英语中非常少见，多出现在古典学、法律史或学术写作里。"]}
{"word":"nomophyllous","summary":{"en":"Nomophyllous describes plants or plant parts that bear normal, typical foliage leaves.","zh":"Nomophyllous 用于描述长有正常典型叶（营养叶）的植物或其部位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having normal, typical foliage leaves (not modified leaves such as bracts, scales, or spines).","zh":"（植物学）具正常的、典型的叶（营养叶）；不是像苞片、鳞片或刺那样的变态叶。"},"examples":[{"en":"In the nomophyllous stage, the seedling produces ordinary green leaves for photosynthesis.","zh":"在具正常叶的阶段，幼苗会长出普通的绿色叶片进行光合作用。"},{"en":"The plant has nomophyllous shoots below and bract-like leaves near the flowers.","zh":"这种植物下部枝条长的是正常叶，而靠近花的地方则出现类似苞片的叶。"}]}],"synonyms":["foliage-leaved","normal-leaved"],"phonetic":"/ˌnoʊməˈfɪləs/","extraExplanation":["词源提示：由希腊语 *nomos*（常规、通常的）+ *phyllon*（叶）构成，因此字面意思就是“通常的叶”。","常见对比概念是 *heterophyllous*（异叶性：同一株植物在不同部位或阶段长出不同形态的叶）。在描述植物形态时，*nomophyllous* 常用来强调“这是正常营养叶，而不是变态叶”。"]}
{"word":"nomos","summary":{"en":"Nomos is an academic word (from Greek) meaning law, custom, or the social norms that organize a community.","zh":"Nomos 是源自希腊语的学术词，指法律、习俗或组织社群生活的社会规范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek) law, custom, or an accepted rule of a community; a “social order” that guides behavior.","zh":"（古希腊）法律、习俗或群体所认可的规范；指引行为的“社会秩序/规则”。"},"examples":[{"en":"In Greek thought, nomos can mean the laws a city chooses, not laws of nature.","zh":"在希腊思想中，nomos 可指城邦制定的法律，而不是自然法则。"},{"en":"The debate between physis (nature) and nomos (convention) appears in many classical texts.","zh":"“physis（自然）”与“nomos（约定/习俗）”的讨论在许多古典文本中都出现过。"}]},{"partOfSpeech":"n.","definition":{"en":"(Modern academic use) the norms or unwritten rules that organize social life, especially in anthropology, sociology, or political theory.","zh":"（现代学术用法）组织社会生活的规范或不成文规则，常见于人类学、社会学或政治理论。"},"examples":[{"en":"Researchers studied the nomos of the workplace—what people follow even when it isn’t written down.","zh":"研究者考察了职场的 nomos——人们即使在没有明文规定时也会遵守的规则。"},{"en":"His essay describes how a community’s nomos shapes identity and belonging.","zh":"他的文章描述了一个社群的 nomos 如何塑造身份与归属感。"}]}],"synonyms":["law","custom","norm","convention","social order"],"phonetic":"/ˈnoʊmɑːs/","extraExplanation":["词源来自希腊语 νόμος（nómos），核心含义是“分配、惯例、法律”。在古典语境中常与 physis（自然）对照：physis 指“自然本性/自然规律”，nomos 指“人制定的规则/社会约定”。","在英语里它多出现在人文社科写作中，属于较正式、学术化的外来词；日常表达通常用 law / custom / norm 等更常见的词。"]}
{"word":"nomotheism","summary":{"en":"Nomotheism means monotheism that is centered on divine law and obedience to it.","zh":"Nomotheism 指以神圣律法与对其服从为核心的一神教形态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of monotheism in which religion is strongly centered on a divinely given law (rules and commandments) that believers are expected to follow","zh":"一种以“神所启示的律法/戒律”为核心的一神教形态；强调遵守规则与诫命的宗教观"},"examples":[{"en":"Some scholars describe Judaism as a kind of nomotheism because divine law plays a central role in religious life.","zh":"一些学者把犹太教描述为一种“律法一神教”，因为神圣律法在宗教生活中居于核心地位。"},{"en":"In discussions of religion and politics, nomotheism is often contrasted with more ritual-centered traditions.","zh":"在宗教与政治的讨论中，“律法一神教”常被拿来与更以仪式为中心的传统作对比。"}]}],"synonyms":["legal monotheism","law-centered monotheism","religion of divine law"],"phonetic":"/ˌnoʊməˈθiːɪzəm/","extraExplanation":["词源上来自希腊语：nomos（法律、规范）+ theism（有神论）。直观理解就是“以律法为核心的有神信仰”。","该术语常见于宗教学与文化研究语境，尤其与学者 Jan Assmann 的相关讨论有关；它更多是分析性概念，而不是某个宗教自称的名称。","理解要点：它强调“信仰—律法—服从/实践”的结构，因此常被用来解释宗教共同体的边界、道德规范与社会秩序如何被建立与维持。"]}
{"word":"nomothete","summary":{"en":"A rare word meaning “lawgiver,” especially in ancient Greece.","zh":"较少见的词，意为“立法者”，尤用于古希腊语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lawgiver; a person who makes or establishes laws (especially in ancient Greece).","zh":"立法者；制定或颁布法律的人（尤指古希腊的立法官/立法者）。"},"examples":[{"en":"In ancient Athens, a nomothete could help propose or shape new laws.","zh":"在古雅典，nomothete（立法者）可能参与提出或制定新法律。"},{"en":"The historian described Solon as a wise nomothete who reformed the legal system.","zh":"这位历史学家称梭伦是一位睿智的nomothete（立法者），改革了法律体系。"}]}],"synonyms":["lawgiver","lawmaker","legislator","jurist"],"phonetic":"/ˈnɑməˌθit/","extraExplanation":["nomothete 源自希腊语 nomothetēs：nómos（法律）+ tithénai（设立、制定）。在古希腊语境中，它常与具体的政治制度相关（如雅典的立法程序），因此比一般的 “lawgiver” 更带有古典历史色彩。","现代英语里该词较少见，更常出现在历史、政治理论或古典学写作中；日常表达通常用 lawmaker / legislator。"]}
{"word":"nomothetes","summary":{"en":"Nomothetes means “lawgivers,” especially in ancient Greek or formal historical writing.","zh":"nomothetes 指“立法者”，尤其常见于古希腊或正式的历史写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lawgiver; someone who makes, sets, or proposes laws (often used in historical or formal contexts)","zh":"立法者；制定或提出法律的人（多用于历史或正式语境）"},"examples":[{"en":"In ancient Athens, nomothetes were chosen to revise and approve laws.","zh":"在古代雅典，nomothetes 会被选出用来修订并批准法律。"},{"en":"The author describes Solon as a nomothete who reshaped the city’s political life.","zh":"作者把梭伦描写为一位 nomothete，他重塑了城邦的政治生活。"}]}],"synonyms":["lawgiver","lawmaker","legislator"],"phonetic":"/ˈnɑməˌθits/","extraExplanation":["这个词来自希腊语：nomos（法律）+ tithenai（制定、设立）。在学习西方政治史或古典学时常见。","在古雅典，nomothetes 常指被指派来“审议/制定法律”的人或委员会，带有制度性、历史性的色彩；日常英语更常用 lawmaker 或 legislator。"]}
{"word":"nomothetic","summary":{"en":"Nomothetic describes an approach that seeks general laws or widely applicable patterns, especially in the social sciences.","zh":"Nomothetic 指一种寻求普遍规律/可推广模式的研究取向，常见于社会科学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in social science or philosophy) aiming to discover general laws or broad principles by studying patterns across many cases, rather than focusing on one unique case.","zh":"（社会科学或哲学中）“法则寻求式的；普遍规律导向的”：通过比较许多个案来寻找一般规律或普遍原则，而不是只研究某一独特个案。"},"examples":[{"en":"The study takes a nomothetic approach, analyzing survey data from thousands of participants.","zh":"这项研究采用法则寻求式（nomothetic）的路径，分析了数千名受试者的问卷数据。"},{"en":"Nomothetic research often uses statistics to test whether a pattern holds across groups.","zh":"法则寻求式研究常用统计方法来检验某种模式是否在不同群体中都成立。"},{"en":"In psychology, nomothetic explanations look for general principles of behavior.","zh":"在心理学中，法则寻求式解释会寻找行为的一般原理。"}]}],"synonyms":["law-seeking","generalizing","pattern-based","principle-seeking"],"phonetic":"/ˌnoʊməˈθɛtɪk/","extraExplanation":["词源来自希腊语：nomos（法律、规则）+ -thetic（制定、设立）。因此 nomothetic 字面上有“建立规律/法则”的意味。","常与 idiographic（个案取向/特例描述的）对比：nomothetic 强调“可推广的通则”，idiographic 强调“个体的独特性与深描”。在研究方法讨论中很常见（如心理学、社会学、人类学）。"]}
{"word":"nomothetical","summary":{"en":"Nomothetical (usually written “nomothetic”) means aiming to find general laws or broad patterns, especially in research.","zh":"Nomothetical（通常写作 nomothetic）指追求普遍规律/总体模式的研究取向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare; often a misspelling of “nomothetic”) describing an approach that looks for general laws or broad patterns, especially in social science research.","zh":"（少见；常被视为“nomothetic”的误拼）指一种研究取向，强调寻找普遍规律或总体模式，尤用于社会科学研究。"},"examples":[{"en":"A nomothetical approach tries to identify patterns that apply across many people.","zh":"“nomothetical”取向试图找出适用于许多人的共同规律。"},{"en":"The study used large surveys to make nomothetical claims about behavior.","zh":"该研究用大规模问卷来提出关于行为的普遍性结论。"}]}],"synonyms":["nomothetic","law-seeking","generalizing","general"],"phonetic":"/ˌnoʊməˈθɛtɪk/","extraExplanation":["这个词在学术写作中更常见的标准形式是 **nomothetic**，意思相同；“nomothetical”更少见，很多时候只是拼写变体或误拼。","词源可追溯到希腊语：**nomos**（法则、规律）+ 与“提出/建立”相关的词根。常与 **idiographic**（个案取向、强调独特性）对比：前者追求“普遍规律”，后者重视“个体差异与具体情境”。"]}
{"word":"noms","summary":{"en":"“Noms” usually means tasty food (internet slang), and can also mean “nominations” or the plural of “nom” (name, rare).","zh":"“noms”通常指（网络用语）好吃的食物；也可指“提名”的简称，或“nom（名字）”的复数（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, internet) tasty food, or the act/sound of eating (from “nom nom”). Often used playfully.","zh":"（非正式/网络用语）好吃的东西；或表示吃东西的动作/声音（来自“nom nom”）。常带俏皮语气。"},"examples":[{"en":"These cookies are serious noms.","zh":"这些饼干真的太好吃了。"},{"en":"Nom nom—this ramen is amazing.","zh":"nom nom——这碗拉面太赞了。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “nom” meaning “name” (rare in modern everyday English; seen in fixed or formal phrases like “de nom”).","zh":"“nom（名字）”的复数（现代日常英语中较少见；多见于固定或较正式的表达，如“de nom”）。"},"examples":[{"en":"The document listed their noms and addresses.","zh":"文件列出了他们的姓名和地址。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) short for “nominations” (e.g., awards or voting contexts).","zh":"（非正式）“nominations（提名）”的简称（常见于奖项或投票语境）。"},"examples":[{"en":"Oscar noms will be announced tomorrow.","zh":"奥斯卡提名将于明天公布。"},{"en":"Any noms for best new restaurant?","zh":"有“最佳新餐厅”的提名推荐吗？"}]}],"synonyms":["yummy food","treats","snacks","nominations","nom nom"],"phonetic":"/nɑmz/","extraExplanation":["“noms”作为网络用语和“nom nom”密切相关：它模仿人吃东西时发出的咀嚼声，表达“好吃、想吃、正在吃”的感觉，语气轻松可爱，常用于社交媒体、聊天或美食帖。","如果你在奖项新闻里看到“noms”，通常指“nominations”。这种缩写在标题和口语里更常见，但正式写作中建议用完整形式“nominations”。"]}
{"word":"nomy","summary":{"en":"“-nomy” is a word part meaning “a system of rules or knowledge,” seen in words like astronomy, taxonomy, and economy.","zh":"“-nomy”是表示“规则或知识体系”的构词成分，常见于astronomy、taxonomy、economy等词中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (suffix/combining form) meaning “a system of rules, laws, or knowledge about something,” used to form nouns (often names of fields of study).","zh":"词缀/构词成分，表示“关于某事的一套规则、法则或知识体系”，常用来构成名词（多用于学科或领域名称）。"},"examples":[{"en":"Astronomy is the study of stars and planets; the “-nomy” part relates to a system of knowledge.","zh":"Astronomy（天文学）研究恒星与行星；其中“-nomy”部分与“知识体系”有关。"},{"en":"Taxonomy is a system for classifying living things.","zh":"Taxonomy（分类学）是一套对生物进行分类的体系。"},{"en":"Economy refers to a system for producing and using goods and services.","zh":"Economy（经济）指生产与使用商品和服务的一套系统。"}]}],"synonyms":["-logy (related word part)","-ics (related word part)"],"phonetic":"/nəmi/","extraExplanation":["“-nomy”来自希腊语词根 *nomos*（法律、规则、管理）。因此带有“-nomy”的词往往强调“有组织的体系/方法/规则”。","容易混淆：“-nomy”常与“-logy”（……学/研究）并列出现。一般说来，“-logy”更强调“研究/学科”，而“-nomy”更强调“体系、规则或分类/管理的方式”。"]}
