{"word":"nonbachelor","summary":{"en":"“Nonbachelor” means a person who is not a bachelor (not single), or, in education/work contexts, something not involving a bachelor’s degree (though this usage is usually written differently).","zh":"“nonbachelor”指“非单身汉/非单身的人”，也可在教育或工作语境中指“非学士学位相关/不要求学士学位的”（但这种用法通常会换成更常见的表达）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (usually a man) who is not a bachelor; for example, someone who is married or in a committed relationship","zh":"（通常指男性）非单身汉的人；例如已婚或已有稳定伴侣的人"},"examples":[{"en":"The club used to be only for bachelors, but now nonbachelors can join too.","zh":"这个俱乐部以前只允许单身汉加入，但现在非单身汉也可以加入。"},{"en":"As a nonbachelor, he preferred quieter weekends at home.","zh":"作为一个非单身汉，他更喜欢在家度过安静的周末。"}]},{"partOfSpeech":"adj.","definition":{"en":"not being a bachelor; not single (often written with a hyphen: non-bachelor)","zh":"不是单身汉的；非单身的（常写作 non-bachelor）"},"examples":[{"en":"The survey compared bachelor and non-bachelor men.","zh":"这项调查比较了单身汉和非单身男性。"},{"en":"They offer events for both bachelor and non-bachelor groups.","zh":"他们为单身与非单身群体都提供活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"not related to, or not requiring, a bachelor’s degree (more common in the form “non-bachelor’s” or “without a bachelor’s degree”)","zh":"与学士学位无关的；不要求学士学位的（更常见表达是 non-bachelor’s 或 without a bachelor’s degree）"},"examples":[{"en":"The program welcomes students with non-bachelor’s qualifications.","zh":"该项目欢迎没有学士学位、但具备其他资格的学生。"},{"en":"Some jobs are open to non-bachelor degree applicants.","zh":"有些工作对没有学士学位的申请者也开放。"}]}],"synonyms":["non-bachelor","not a bachelor","not single","married","without a bachelor’s degree"],"phonetic":"/ˌnɑnˈbætʃəlɚ/","extraExplanation":["“nonbachelor”本身不算常见标准词，更常见写法是带连字符的“non-bachelor”。日常表达里，英语更自然的说法通常是“not a bachelor / not single / married”。","如果你想表达“没有本科学位”，更地道的说法是“without a bachelor’s degree”“non-bachelor’s degree holder(s)”或直接说“no college degree / no four-year degree”（视语境而定）。"]}
{"word":"nonbacterial","summary":{"en":"“Nonbacterial” means not caused by bacteria, especially in medical contexts.","zh":"“nonbacterial”意为“非细菌性的”，常用于医学语境，表示不是由细菌引起的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not caused by bacteria (for example, caused by a virus, allergy, irritation, or another non-bacterial factor).","zh":"非细菌性的；不是由细菌引起的（例如由病毒、过敏、刺激或其他非细菌因素造成）。"},"examples":[{"en":"The doctor said my sore throat is nonbacterial, so antibiotics won’t help.","zh":"医生说我的喉咙痛是非细菌性的，所以抗生素没有用。"},{"en":"Nonbacterial pneumonia can be caused by viruses.","zh":"非细菌性肺炎可能由病毒引起。"}]}],"synonyms":["nonbacterial (medical term; no exact everyday synonym)","nonbacterial in origin","not bacterial","nonbacterial (as opposed to bacterial)"],"phonetic":"/ˌnɑnˈbækˌtɪriəl/","extraExplanation":["在医疗语境里，nonbacterial常用来提醒“不要默认用抗生素”。抗生素只对细菌感染有效，对病毒感染、过敏或炎症等“非细菌性”原因通常无效。","构词法：non-（表示“非、不”）+ bacterial（细菌的）。常见搭配：nonbacterial infection（非细菌性感染）、nonbacterial prostatitis（非细菌性前列腺炎）、nonbacterial meningitis（非细菌性脑膜炎）。"]}
{"word":"nonbacterially","summary":{"en":"“Nonbacterially” means “in a non-bacterial way,” especially in medical/scientific contexts.","zh":"“nonbacterially”表示“以非细菌性的方式”，多用于医学/科研语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not caused by bacteria, or not involving bacteria.","zh":"以非细菌性的方式；不是由细菌引起的，或不涉及细菌。"},"examples":[{"en":"The infection was determined to be nonbacterially caused, so antibiotics were not helpful.","zh":"感染被判定为非细菌性原因引起，因此抗生素并没有帮助。"},{"en":"Some types of inflammation can develop nonbacterially, such as from allergies or irritation.","zh":"有些炎症可能以非细菌性的方式发生，比如由过敏或刺激引起。"}]}],"synonyms":["nonbacterialy (rare variant)","not bacterially","not caused by bacteria","in a non-bacterial way"],"phonetic":"/ˌnɑn bækˈtɪriəli/","extraExplanation":["这个词很少在日常英语中使用，更常见于医学或科研写作中。它由 non-（“非……；不……”）+ bacterially（“细菌性地”）构成，用来强调“不是细菌导致/不靠细菌发生”。","在实际表达中，更常见的替代说法有：not bacterial / nonbacterial（形容词）以及 not caused by bacteria（短语）。例如：a nonbacterial infection（非细菌性感染）比 nonbacterially caused 更常见。"]}
{"word":"nonbailable","summary":{"en":"Nonbailable means not eligible for release on bail before trial.","zh":"nonbailable 指“不得保释的”，即审判前不允许通过保释获得释放。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Legal) Not eligible for release on bail; a court will not allow the person to pay money or meet conditions to be released before trial.","zh":"（法律）不得保释的；法院不允许在审判前通过缴纳保释金或满足条件而获释的。"},"examples":[{"en":"Because the charge was considered a serious risk to public safety, the judge ruled it was nonbailable.","zh":"由于该指控被认为对公共安全风险很大，法官裁定该案不得保释。"},{"en":"In some places, certain violent offenses are treated as nonbailable under the law.","zh":"在一些地区，某些暴力犯罪在法律上会被视为不得保释。"},{"en":"The defense argued for pretrial release, but prosecutors said the case was nonbailable.","zh":"辩方主张审前释放，但检方称该案不得保释。"}]}],"synonyms":["no-bail","held without bail","denied bail","not eligible for bail"],"phonetic":"/ˌnɑnˈbeɪləbəl/","extraExplanation":["“Bail（保释/保释金）”指嫌疑人或被告在审判前，为保证按时出庭而交付金钱或接受条件（如定期报到、电子脚镣等）后获得暂时自由。“Nonbailable”表示法律或法官决定不允许这种审前释放。","不同司法辖区对“不得保释”的规定差异很大：有的地方按罪名类别规定（例如特定重罪），有的则强调个案风险评估（如逃跑风险、威胁证人、再次犯罪风险）。","常见近义表达包括：“no-bail”“held without bail”“denied bail”“not eligible for bail”。在新闻或法庭语境中更常见“held without bail/denied bail”。"]}
{"word":"nonballoting","summary":{"en":"“Nonballoting” means not having voting rights or not taking part in a vote, especially in formal groups or meetings.","zh":"“Nonballoting”指“无投票权的”或“未参与投票的”，多用于正式组织或会议语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having the right to vote; not participating in voting (often used before a noun, e.g., “nonballoting member”).","zh":"无投票权的；不参与投票的（常作定语，如“nonballoting member”）。"},"examples":[{"en":"The committee includes two nonballoting members who can speak but cannot vote.","zh":"委员会里有两名无投票权成员，他们可以发言但不能投票。"},{"en":"Nonballoting observers attended the meeting to learn the process.","zh":"一些不参与投票的观察员参加了会议以了解流程。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or practice of not holding a vote or not voting (rare; usually expressed as “not voting” or “abstaining”).","zh":"不进行投票；不投票的做法（较少见；通常说“not voting”或“abstaining”）。"},"examples":[{"en":"Because of time limits, the group chose nonballoting and postponed the decision.","zh":"由于时间有限，大家决定不投票，把决定推迟。"}]}],"synonyms":["nonvoting","without voting rights","ineligible to vote","abstaining (context-dependent)"],"phonetic":"/ˌnɑnˈbɑlətɪŋ/","extraExplanation":["“nonballoting”多见于正式语境（组织章程、会议规则、公司治理等），最常用的搭配是“nonballoting member/observer/participant”。日常英语里更常直接说“can’t vote / doesn’t have voting rights（没有投票权）”或“abstain（弃权）”。"]}
{"word":"nonbanishment","summary":{"en":"Nonbanishment means not being banished—being allowed to remain instead of being forced to leave.","zh":"nonbanishment 指“未被放逐／未被驱逐”，即被允许留下而非被迫离开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of not being banished (not being forced to leave a place, community, or country)","zh":"未被放逐／未被驱逐的状态（没有被强制离开某地、群体或国家）"},"examples":[{"en":"The judge’s decision meant nonbanishment, so she could remain in the city.","zh":"法官的裁决意味着她不会被驱逐，因此她可以留在这座城市。"},{"en":"He argued that nonbanishment was necessary to keep his family together.","zh":"他主张不放逐是维系家庭团聚所必需的。"}]}],"synonyms":["permission to stay","nondeportation","no exile"],"phonetic":"/ˌnɑnˈbænɪʃmənt/","extraExplanation":["“nonbanishment”较少见，常见于法律或正式写作中，用来强调“没有被放逐/驱逐”的结果或原则。日常英语里更常说：not be banished / not be deported / be allowed to stay。","构词：non-（不、非）+ banishment（放逐、驱逐）。前缀non-常用于把一个名词或概念“否定化”，如 nonpayment（未付款）、nonviolence（非暴力）。"]}
{"word":"nonbank","summary":{"en":"“Nonbank” refers to a company that provides financial services but is not a traditional bank.","zh":"“nonbank”指提供金融服务但不是传统银行的机构，也可作形容词表示“非银行的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A financial institution or company that provides financial services (like lending, investing, or payment services) but is not a traditional bank and usually does not take regular customer deposits.","zh":"“非银行”金融机构：提供贷款、投资、支付等金融服务，但不是传统银行，通常不吸收普通客户存款。"},"examples":[{"en":"Many consumers get personal loans from a nonbank lender instead of a bank.","zh":"很多消费者会从非银行放贷机构而不是银行获得个人贷款。"},{"en":"Nonbank financial companies can play a big role in mortgage lending.","zh":"非银行金融公司在住房按揭贷款中可能扮演重要角色。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not related to or not operated by a bank; outside the traditional banking system.","zh":"非银行的；不由银行经营的；不属于传统银行体系的。"},"examples":[{"en":"The company offers nonbank payment services through a mobile app.","zh":"这家公司通过手机应用提供非银行支付服务。"},{"en":"Regulators are paying closer attention to nonbank lenders.","zh":"监管机构正在更密切地关注非银行放贷机构。"}]}],"synonyms":["nonbank financial institution","nonbank lender","non-depository institution"],"phonetic":"/ˈnɑnˌbæŋk/","extraExplanation":["“nonbank”在新闻与政策语境中很常见，常见搭配有：nonbank lender（非银行放贷机构）、nonbank financial institution/company（非银行金融机构/公司）、nonbank mortgage servicer（非银行按揭贷款服务/管理机构）。","是否属于“nonbank”通常取决于监管与业务模式：例如某些金融科技公司、消费金融公司、房贷机构、对冲基金、私募基金等在特定语境下也可能被称为nonbank。不同国家/地区的定义会略有差异。"]}
{"word":"nonbankable","summary":{"en":"“Nonbankable” means a payment document or asset is not acceptable to a bank for deposit, cashing, or financing.","zh":"“nonbankable”指某种票据/文件/资产不被银行接受，无法正常存入、兑现或融资。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not acceptable by a bank (or other financial institution) for deposit, cashing, or financing; not easily turned into money through normal banking channels.","zh":"（文件、票据或资产）银行不接受的；不可在银行正常存入、兑现或融资的；不易通过银行渠道变现的。"},"examples":[{"en":"Some small retailers treat personal checks as nonbankable and ask for cash instead.","zh":"一些小零售商认为个人支票不可银行兑现，所以会要求用现金支付。"},{"en":"Because the payment document was nonbankable, the company had to use a different method to transfer funds.","zh":"由于该付款凭证银行不接受，公司不得不改用其他方式转账。"}]}],"synonyms":["unacceptable (to a bank)","unbankable","not negotiable","uncashable"],"phonetic":"/ˌnɑnˈbæŋkəbəl/","extraExplanation":["“Nonbankable”常见于商业与金融语境，多用来形容某种支付工具（如支票、票据）、文件或资产在银行体系中无法被接受、贴现或融资。","构词：non-（不、非）+ bankable（可由银行接受/可融资的）。与“unbankable”相近，但“unbankable”也常用于形容“客户/人群难以获得银行服务（如无银行账户）”，而“nonbankable”更偏向描述“某个票据/工具本身不可办理”。"]}
{"word":"nonbarbarian","summary":{"en":"Nonbarbarian means “not barbarian,” and is mainly used in historical or literary contrast with “barbarian.”","zh":"nonbarbarian 意为“非蛮族的/不野蛮的”，主要用于历史或文学语境中与 barbarian 作对比。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not barbarian; not considered uncivilized or foreign (often used in contrast to “barbarian”)","zh":"非野蛮的；非“蛮族”的；不被视为未开化或外邦的（常与 barbarian 对比）"},"examples":[{"en":"The author contrasts the barbarian invaders with the nonbarbarian townspeople.","zh":"作者将野蛮的入侵者与非蛮族的城镇居民作对比。"},{"en":"She avoids calling anyone a barbarian and prefers neutral terms like nonbarbarian or local.","zh":"她避免称任何人为“蛮族”，更倾向用“非蛮族”或“当地人”等中性说法。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is not a barbarian (rare; usually used in historical or literary contexts)","zh":"非蛮族的人；非野蛮人（较少见，多用于历史或文学语境）"},"examples":[{"en":"In the chronicle, the nonbarbarians are described as living inside the city walls.","zh":"在那部编年史中，非蛮族的人被描写为住在城墙之内。"}]}],"synonyms":["civilized","nonbarbaric","non-savage","cultured"],"phonetic":"/ˌnɑnˈbɑrˌbɛriən/","extraExplanation":["“barbarian”一词源自古希腊语 barbaros，最初指“不会说希腊语的人/外族人”，带有“听起来像‘bar-bar’的胡言乱语”的嘲讽意味；后来逐渐演变为“野蛮、未开化”的评价性词汇。","因为它历史上常被用来贬低他者、强化“文明/野蛮”的二分，对现代人群也可能带有冒犯性；写作中若要强调中立，可以改用“foreign / outsider / non-Greek / non-Roman / local”等更具体的词。","“nonbarbarian”本身并不常用，更常见的表达是 “nonbarbaric”（不野蛮的，形容行为/做法）或直接用 “civilized”（文明的）。"]}
{"word":"nonbarbaric","summary":{"en":"Nonbarbaric means “not barbaric”—civilized, humane, and not cruel.","zh":"nonbarbaric 意为“不野蛮的”，强调文明、人道、不残酷。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not barbaric; civilized, humane, or cultured in behavior","zh":"不野蛮的；文明的；有人道的、较有教养的"},"examples":[{"en":"The article argues that punishment should be nonbarbaric and respect human dignity.","zh":"这篇文章主张惩罚应当是不野蛮的，并尊重人的尊严。"},{"en":"They wanted to find a nonbarbaric way to settle the dispute.","zh":"他们想找到一种不野蛮的方式来解决争端。"},{"en":"Even in war, leaders are expected to follow nonbarbaric rules of treatment.","zh":"即使在战争中，人们也期望领导者遵守不野蛮的对待规则。"}]}],"synonyms":["civilized","humane","not brutal","cultured","refined"],"phonetic":"/ˌnɑn bɑrˈbærɪk/","extraExplanation":["“nonbarbaric”由前缀 non-（表示“非、不”）+ barbaric 组成，意思直观：强调“不是野蛮的”。更常见的替代表达有 “civilized / humane / not brutal”。","“barbaric（野蛮的）”在现代语境里常用来批评残酷、不人道的行为，但历史上也曾被用来贬称“外族/他者”。在写作或讨论文化与族群时，使用时注意语气与对象，尽量指向“行为”而非“群体”。"]}
{"word":"nonbarbarous","summary":{"en":"Nonbarbarous means civilized or humane—not cruel or savage.","zh":"nonbarbarous 指“文明/人道的”，即“不野蛮、不残暴”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not barbarous; civilized, humane, and not cruel or violent","zh":"不野蛮的；文明的、人道的；不残暴的"},"examples":[{"en":"The judge praised the program for offering a nonbarbarous alternative to harsh punishment.","zh":"法官称赞该项目为严厉惩罚提供了一种不野蛮、更人道的替代方案。"},{"en":"Even during the conflict, some leaders insisted on nonbarbarous treatment of prisoners.","zh":"即使在冲突期间，一些领导人仍坚持以不残暴、更文明的方式对待俘虏。"}]}],"synonyms":["civilized","humane","not brutal","not savage","cultured","refined"],"phonetic":"/ˌnɑnˈbɑrbərəs/","extraExplanation":["“nonbarbarous”由前缀 non-（表示“非、不”）+ barbarous（野蛮的、残暴的）构成，意思直接是“并不野蛮的”。这是比较少见、略显书面/正式的词；日常英语里更常用 civilized、humane、not brutal 等表达。","barbarous 源自希腊语/拉丁语中对“外族人”的称呼（barbar-），在现代英语里主要表示“粗野、残酷”，使用时注意避免把它用于描述特定民族或文化，以免带有冒犯色彩。"]}
{"word":"nonbarbarously","summary":{"en":"Nonbarbarously means “not in a barbarous way,” i.e., civilly or humanely.","zh":"nonbarbarously 指“不是以野蛮的方式”，即以文明或人道的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not barbarous; in a civilized, humane, or cultured manner","zh":"以不野蛮的方式；以文明、人道或有教养的方式"},"examples":[{"en":"The prisoners were treated nonbarbarously, with basic dignity and medical care.","zh":"囚犯得到了不野蛮的对待，保有基本尊严并获得医疗照护。"},{"en":"Even in conflict, he argued that armies should behave nonbarbarously toward civilians.","zh":"即使在冲突中，他也主张军队应以不野蛮的方式对待平民。"}]}],"synonyms":["civilly","humanely","culturedly","in a civilized way","not barbarously"],"phonetic":"ˌnɑnˈbɑrbərəsli","extraExplanation":["“nonbarbarously”很少见，写作中更常用的表达是“in a civilized/humane way（以文明/人道的方式）”或“not barbarously”。","词形来源很直观：non-（不、非）+ barbarous（野蛮的）+ -ly（副词后缀）。有时也会见到带连字符的写法“non-barbarously”。","“barbarous”除了“残暴、野蛮”外，也可指“粗俗、欠缺教养”；因此“nonbarbarously”既可强调“不残酷”，也可强调“较为文明得体”。"]}
{"word":"nonbarbarousness","summary":{"en":"Nonbarbarousness means the state of being not barbarous—showing civility, refinement, and humane behavior.","zh":"Nonbarbarousness 指“不野蛮”的状态，强调文明、教养与人道的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being barbarous; civility, refinement, or humane behavior","zh":"不野蛮；文明、教养或人道的品质/状态"},"examples":[{"en":"The essay praises the nonbarbarousness of the community, especially in how it treats the poor.","zh":"这篇文章称赞这个社区的“不野蛮”，尤其体现在它如何对待穷人。"},{"en":"Even during conflict, she insisted on nonbarbarousness—no cruelty, no humiliation.","zh":"即使在冲突中，她也坚持保持“不野蛮”——不残酷、不羞辱他人。"}]}],"synonyms":["civility","humanity","refinement","decency","civilization"],"phonetic":"/nɑnˈbɑrbərəsnəs/","extraExplanation":["这是一个非常少见、偏书面/学术的名词，常见写法更多是用更自然的词：humanity（人性/仁慈）, civility（礼貌/文明）, refinement（文雅）, nonviolence（非暴力）等。","构词：non-（不、非）+ barbarous（野蛮的）+ -ness（名词后缀）。也可写成更常见的表达：the absence of barbarity（没有野蛮/残暴）。"]}
{"word":"nonbaronial","summary":{"en":"“Nonbaronial” means “not baronial”—not connected with a baron, barons, or baronial privileges/style.","zh":"“nonbaronial”指“非男爵的/非男爵阶层的”，也可指“不具备男爵式特权或风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not baronial; not belonging to a baron or to the class of barons (nobility).","zh":"非男爵的；不属于男爵或男爵阶层（贵族）的。"},"examples":[{"en":"The estate passed to a nonbaronial branch of the family.","zh":"这处庄园传给了家族中非男爵的分支。"},{"en":"She wrote about nonbaronial families who still lived near the old castle.","zh":"她写到了那些仍住在古堡附近的非男爵家庭。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not having the style, privileges, or features associated with baronial life (e.g., a baronial hall or baronial rights).","zh":"不具备男爵式的风格、特权或特征的（如男爵大厅或男爵权利）。"},"examples":[{"en":"Their home was comfortable but nonbaronial—no grand hall, no coats of arms.","zh":"他们的家很舒适，但并不“男爵式”——没有宏大的大厅，也没有家族纹章。"},{"en":"The document refers to nonbaronial landholders in the region.","zh":"文件提到该地区的非男爵土地持有人。"}]}],"synonyms":["non-noble","nonaristocratic","common","plebeian (context-dependent)"],"phonetic":"/ˌnɑn bəˈroʊniəl/","extraExplanation":["“non-”是否定前缀，表示“非……、不……”。“baronial”来自“baron（男爵）”，在英国等欧洲封建/贵族语境中常见，意思是“男爵的、男爵阶层的、带有贵族领主风格的”。","这个词比较少见，多出现在历史、法律、家谱、文学研究等语境，用来区分“贵族（尤其是男爵）”与“非贵族/非男爵”的人物、土地或权利。"]}
{"word":"nonbase","summary":{"en":"Nonbase means “not a base,” often referring to something that is not part of the basic/core set, or (in chemistry) not basic (not alkaline).","zh":"nonbase 表示“非基础/非核心的”，或在化学语境中表示“非碱性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not a base; not serving as a base, foundation, or main category","zh":"非基础的；不作为基础/根基的；不属于主要类别的"},"examples":[{"en":"The app’s premium tools are nonbase features that you can add later.","zh":"这个应用的高级工具是非基础功能，可以以后再添加。"},{"en":"We’ll keep the nonbase content optional for new users.","zh":"我们会把非基础内容设为新用户可选项。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry) not basic; not acting as a base (not alkaline)","zh":"（化学）非碱性的；不表现为碱（不呈碱性）的"},"examples":[{"en":"This solution is nonbase, so it won’t neutralize an acid the way a base would.","zh":"这种溶液是非碱性的，所以不会像碱那样中和酸。"}]}],"synonyms":["nonbasic","non-core","nonessential","secondary"],"phonetic":"ˌnɑnˈbeɪs","extraExplanation":["“nonbase”不是非常常见的标准词形，更常见写法是加连字符的“non-base”，意思更清楚：non-（非）+ base（基础/碱）。不同领域里 base 的含义不同，所以阅读时要结合上下文判断是“基础/基底”，还是“化学中的碱”。"]}
{"word":"nonbasement","summary":{"en":"“Nonbasement” means not in a basement (above ground), often used in housing descriptions.","zh":"“nonbasement”表示“不在地下室、在地面以上”，常见于住房/房源描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not located in a basement; above ground level (often used to describe a room, unit, or floor in a building).","zh":"不在地下室的；位于地面以上的（常用来描述房间、住户或楼层）。"},"examples":[{"en":"We chose a nonbasement apartment because it gets more sunlight.","zh":"我们选了一个非地下室的公寓，因为采光更好。"},{"en":"The nonbasement rooms stayed warmer in winter.","zh":"不在地下室的房间冬天更暖和。"}]},{"partOfSpeech":"n.","definition":{"en":"A non-basement unit or space (a room, apartment, or level that is not in the basement).","zh":"非地下室的住处/空间（指不在地下室的房间、公寓或楼层）。"},"examples":[{"en":"Only one nonbasement was available at that price.","zh":"那个价位只有一间非地下室的房源可选。"},{"en":"They moved from a basement to a nonbasement after getting a new job.","zh":"他们换了新工作后，从地下室搬到了非地下室的住处。"}]}],"synonyms":["above-ground","not in the basement","non-basement"],"phonetic":"/ˌnɑnˈbeɪsmənt/","extraExplanation":["“nonbasement”在日常英语里不算常见，更常见的写法是带连字符的“non-basement”，或者直接说“above-ground apartment/room（地面上的公寓/房间）”。在租房广告或房产描述中，你更可能看到这些表达。"]}
{"word":"nonbasic","summary":{"en":"Nonbasic means “not basic,” either not introductory/fundamental, or (in chemistry) not alkaline.","zh":"nonbasic 意为“非基础的”，可指不属于入门/基本层面；在化学中也指“非碱性的（不呈碱性）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not basic; not simple, fundamental, or introductory.","zh":"非基础的；不简单的；不属于入门或基本层面的。"},"examples":[{"en":"This book is nonbasic, so it may be hard for beginners.","zh":"这本书不是基础读物，所以初学者可能会觉得难。"},{"en":"The course quickly moves from basic skills to more nonbasic topics.","zh":"这门课很快就从基础技能进入更深入、非基础的主题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Not basic (not alkaline); neutral or acidic rather than a base.","zh":"（化学）非碱性的；不是碱（不呈碱性），可能是中性或酸性。"},"examples":[{"en":"Vinegar is nonbasic; it’s acidic.","zh":"醋是非碱性的；它是酸性的。"},{"en":"Use a pH test to check whether the solution is nonbasic.","zh":"用 pH 试纸检测溶液是否为非碱性。"}]}],"synonyms":["advanced","nonfundamental","not elementary","acidic (chemistry)","neutral (chemistry)"],"phonetic":"/nɑnˈbeɪsɪk/","extraExplanation":["“non-”是常见前缀，表示“非、不是”。“nonbasic”通常写作一个词，也可写作“non-basic”，尤其在学术或技术写作中用连字符更清晰。","在数学或统计里，basic / nonbasic 也可能出现在“basic variables（基变量）/ nonbasic variables（非基变量）”等搭配中，具体含义取决于领域。"]}
{"word":"nonbasing","summary":{"en":"“Nonbasing” means not using something as a basis or not relying on it as a foundation.","zh":"“nonbasing”指“不以某事为依据/基础；不依赖其作为基础”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not using something as a basis; not relying on or grounding a decision, opinion, or action on something","zh":"不以……为依据的；不依赖……作为基础的（观点、决定或行为）"},"examples":[{"en":"The report takes a nonbasing approach, focusing on what we can observe rather than guessing causes.","zh":"这份报告采取不以推测为依据的方法，重点放在我们能观察到的内容上，而不是猜测原因。"},{"en":"Try nonbasing your self-worth on grades or test scores.","zh":"尽量不要把自我价值建立在成绩或分数之上。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of not basing something on a particular factor (often used in formal or technical writing)","zh":"不以某一因素为依据的做法（多见于较正式或技术性写作）"},"examples":[{"en":"Their nonbasing on tradition allowed for more creative solutions.","zh":"他们不以传统为依据的做法带来了更有创意的解决方案。"}]}],"synonyms":["not based on","unbased","non-based","groundless","unsupported"],"phonetic":"/ˌnɑnˈbeɪsɪŋ/","extraExplanation":["“nonbasing”不是非常常见的标准词形，更常见的写法是“not based on…”或“non‑based”（也可写成“non-based”）。在正式写作里，如果你想表达“依据/基础是什么”，通常用：be based on / not based on。","作为形态结构，它由前缀“non-（非、不）”+ “basing（以……为基础）”构成，常见于把动词进行名词化或形容词化的语境。"]}
{"word":"nonbathing","summary":{"en":"“Nonbathing” means not bathing or not taking showers/baths.","zh":"“nonbathing”指“不洗澡/不沐浴”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bathing; not taking baths or showers (often describing a person, group, or lifestyle).","zh":"不洗澡的；不沐浴的（常用来形容某人、某群体或一种生活方式）。"},"examples":[{"en":"He went through a nonbathing phase while camping in the mountains.","zh":"他在山里露营时经历了一段不洗澡的时期。"},{"en":"The article described a nonbathing lifestyle as a personal choice, but it stressed basic hygiene like handwashing.","zh":"这篇文章把“不洗澡”的生活方式描述为一种个人选择，但仍强调像洗手这样的基本卫生。"},{"en":"Some people try a nonbathing routine for sensitive skin, using gentle wipes instead.","zh":"有些人因为皮肤敏感会尝试“不洗澡”的作息，改用温和的湿巾清洁。"}]}],"synonyms":["unwashed","not bathing","not showering","non-bathing"],"phonetic":"/ˌnɑnˈbeɪðɪŋ/","extraExplanation":["“nonbathing”不是非常常见的日常词，更常见的写法是加连字符的“non-bathing”，或用更自然的表达：\"not bathing\" / \"not showering\"。","它通常带有描述或评论的语气（有时略负面），具体感受取决于上下文；在健康/护肤语境中也可能是中性陈述。"]}
{"word":"nonbearded","summary":{"en":"“Nonbearded” means not having a beard.","zh":"nonbearded 意为“不留胡子/没有胡子”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having a beard; without facial hair on the chin and cheeks (often used to contrast with “bearded”).","zh":"不留胡子（的）；无络腮胡/下巴与脸颊没有胡须（常与 bearded 对比）。"},"examples":[{"en":"The nonbearded man in the photo looks much younger than his bearded brother.","zh":"照片里那个不留胡子的男人看起来比留胡子的哥哥年轻很多。"},{"en":"Some actors appear nonbearded in early scenes and bearded later to show time passing.","zh":"有些演员在前面的镜头里不留胡子，后面留胡子，用来表现时间流逝。"}]}],"synonyms":["clean-shaven","beardless"],"phonetic":"/ˌnɑnˈbɪrdɪd/","extraExplanation":["“non-” 是英语里很常见的否定前缀，意思是“非……、不……”。因此 nonbearded = non- + bearded（留胡子的）。这种词更常见于描述/对比（如照片说明、警察通缉描述、角色造型），日常口语里也可以直接说 clean-shaven（刮得很干净）或 without a beard（没有胡子）。"]}
{"word":"nonbearing","summary":{"en":"Nonbearing means “not carrying weight,” especially in buildings; it can also mean “not producing fruit or offspring.”","zh":"nonbearing 常指“（建筑）不承重的”，也可指“（植物/生物）不结果或不繁殖的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not supporting a load or weight; not designed to carry structural stress.","zh":"（建筑等）不承重的；不用于承载重量或结构压力的。"},"examples":[{"en":"This is a nonbearing wall, so we can move it more easily during the renovation.","zh":"这是一面非承重墙，所以装修时更容易改动。"},{"en":"Before removing any nonbearing partition, check the building plans and local codes.","zh":"拆除任何非承重隔墙前，先查看建筑图纸并确认符合当地规范。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not producing fruit, seeds, or offspring; not yielding a crop.","zh":"（农业/生物）不结果的；不产种子或不繁殖的；无收成的。"},"examples":[{"en":"Some young trees are nonbearing for the first few years.","zh":"有些幼树在最初几年是不结果的。"},{"en":"The farmer replaced several nonbearing plants with new seedlings.","zh":"农民把几株不结果的植株换成了新的幼苗。"}]}],"synonyms":["non-load-bearing","load-free","unproductive","infertile"],"phonetic":"/ˌnɑnˈbɛrɪŋ/","extraExplanation":["“nonbearing”在日常英语里最常见于建筑语境，尤其是“nonbearing wall”（非承重墙）/“non-load-bearing wall”。但现实中是否能拆改，往往还取决于管线、电路、防火分区、以及当地法规；即使是“非承重”，也不一定就能随意拆。"]}
{"word":"nonbeatific","summary":{"en":"Nonbeatific means not calm and blissfully happy in expression or mood.","zh":"nonbeatific 指“没有安详幸福（近乎圣洁喜悦）神情或情绪”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not beatific; not showing a calm, blissful, “heavenly” happiness or serenity","zh":"不带天赐般幸福宁静神情的；不显得安详喜悦的"},"examples":[{"en":"His expression was nonbeatific—more tired than joyful.","zh":"他的表情并不安详喜悦——更多是疲惫而不是快乐。"},{"en":"The painting’s figures look solemn and nonbeatific, as if they are mourning.","zh":"画中人物神情庄严而不显安详喜悦，仿佛在哀悼。"}]}],"synonyms":["unserene","grim","solemn","joyless","weary"],"phonetic":"/ˌnɑnbiəˈtɪfɪk/","extraExplanation":["“beatific”常用来形容一种平静、满足、近乎“圣洁/天国般”的喜悦（例如慈祥、安详的微笑）。它也有宗教语境（如“beatific vision”指在天堂中见到上帝的至福景象）。","“nonbeatific”并不算常见词，更常见的表达是用否定来改写：not beatific / not serene / not blissful，或用更具体的形容词：grim（阴沉的）、weary（疲惫的）、stern（严厉的）。"]}
{"word":"nonbeatifically","summary":{"en":"Nonbeatifically means “not in a blissful, radiant, holy-calm way.” It’s very uncommon; “not beatifically” is more natural.","zh":"nonbeatifically 表示“并非以幸福光彩、圣洁宁静（极乐）的方式”。它很少见，更自然的说法是 not beatifically。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not beatific (not showing holy calm, radiant happiness, or bliss).","zh":"以一种不“天使般幸福/安详”（不显得神圣宁静、光彩喜悦或极乐）的方式。"},"examples":[{"en":"He smiled, but nonbeatifically—more like a tired grin than a look of bliss.","zh":"他笑了，但一点也不显得幸福安详——更像是疲惫的苦笑。"},{"en":"The portrait shows the saint nonbeatifically, with worry in the eyes.","zh":"这幅肖像把圣人画得并不“极乐宁静”，眼神里反而有忧虑。"}]}],"synonyms":["not beatifically","without bliss","without serenity","grimly","somberly"],"phonetic":"/ˌnɑnbiəˈtɪfɪkli/","extraExplanation":["这个词非常罕见，很多词典不会收录，更常见的是用“not beatifically”来表达同样意思。","拼写上更常见的形式是 nonbeatifically（你写的 nonbeatifically 少了一个 c；beatific 来自 beatify/beatific 这一词族）。","beatific 常用于宗教或文学语境，形容“圣洁、极乐、宁静发光”的神情；加上 non- 就是在强调“缺乏那种神圣幸福感”。"]}
{"word":"nonbeauties","summary":{"en":"“Nonbeauties” means people or things considered not beautiful (plural of “nonbeauty”).","zh":"“Nonbeauties”指被认为不漂亮的人或事物（“nonbeauty”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (or things) considered not beautiful; the plural of “nonbeauty.” Often used in a casual, sometimes judgmental way.","zh":"不漂亮的人（或事物）；“nonbeauty”的复数。常用于口语语境，有时带有评判意味。"},"examples":[{"en":"The ad promised it was made for “nonbeauties,” not just models.","zh":"这则广告说它是为“非美女/非帅哥”准备的，而不只是给模特用的。"},{"en":"She joked that their club was a place for nonbeauties who loved fashion.","zh":"她开玩笑说她们的社团是给爱时尚的“非美女/非帅哥”待的地方。"},{"en":"Calling people nonbeauties can sound unkind, so be careful with the word.","zh":"把别人叫作“nonbeauties”可能听起来不太友善，所以要谨慎使用。"}]}],"synonyms":["plain-looking people","ordinary-looking people","not-so-attractive people"],"phonetic":"/ˌnɑnˈbjuːtiz/","extraExplanation":["“non-”是英语里很常见的否定前缀，表示“非……、不是……”。所以nonbeauty字面就是“非美/不美的人或事物”。","这个词不算常见，更多是一种临时造词或带戏谑/自嘲的表达；在正式写作中更常用“ordinary-looking people”（长相普通的人）或用更中性的说法避免外貌评判。"]}
{"word":"nonbeauty","summary":{"en":"“Nonbeauty” means the absence of beauty or someone/something seen as not beautiful, often used in discussions that challenge traditional beauty standards.","zh":"“nonbeauty”指“不美/缺乏美感”，也可指“被认为不漂亮的人或事物”，常用于挑战传统审美标准的讨论中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being beautiful; lack of conventional beauty","zh":"不美；缺乏（传统意义上的）美感"},"examples":[{"en":"The film deliberately explores nonbeauty to challenge mainstream ideas of attractiveness.","zh":"这部电影刻意探讨“不美”，以挑战主流对吸引力的定义。"},{"en":"She wrote about nonbeauty as part of everyday life, not something to hide.","zh":"她写到“不美”也是日常生活的一部分，而不是需要隐藏的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing seen as not beautiful (often used in contrast with “beauty”)","zh":"被认为不漂亮的人或事物（常与“beauty/美人”对照使用）"},"examples":[{"en":"The story turns the ‘nonbeauty’ into the most memorable character.","zh":"故事把这个“非美人”写成了最令人难忘的角色。"},{"en":"In some old reviews, the heroine was unfairly labeled a nonbeauty.","zh":"在一些旧影评里，女主角曾被不公平地贴上“nonbeauty（不美的人）”的标签。"}]}],"synonyms":["lack of beauty","plainness","unattractiveness","homeliness","non-beauty"],"phonetic":"/ˌnɑnˈbjuːti/","extraExplanation":["“nonbeauty”由前缀 non-（“非、无”）+ beauty（“美”）构成，意思直译为“非美/不美”。英语里更常见的写法是带连字符的“non-beauty”，或直接用“lack of beauty / not conventionally attractive”。","在讨论审美、女性主义、艺术风格时，“nonbeauty / non-beauty”有时会被用作一种观点：不把“美”当作唯一标准，而把普通、真实、甚至“不完美”也当作值得呈现的审美。使用时注意语气，指人时可能带评判或冒犯色彩，建议用更中性的表达。"]}
{"word":"nonbeing","summary":{"en":"Nonbeing means nonexistence or the absence of existence, especially in philosophical or literary contexts.","zh":"Nonbeing 指“不存在/缺乏存在”的状态，常用于哲学或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not existing; absence of being or existence (often used in philosophy or literature)","zh":"不存在的状态；无存在/无“存在性”（常见于哲学或文学语境）"},"examples":[{"en":"In some philosophies, nonbeing is discussed alongside being to explain reality.","zh":"在一些哲学中，“非存在”常与“存在”一起讨论，用来解释现实。"},{"en":"The novel describes grief as a kind of nonbeing, a hollow space where joy used to be.","zh":"这部小说把悲伤写成一种“非存在”，像是快乐曾经所在之处留下的空洞。"}]},{"partOfSpeech":"n.","definition":{"en":"something that does not exist; a nonexistent thing or condition","zh":"不存在之物；虚无之物（指并不存在的事物或状态）"},"examples":[{"en":"He chased a perfect answer, but it turned out to be a nonbeing.","zh":"他追寻一个完美答案，但最后发现那只是个并不存在的东西。"}]}],"synonyms":["nonexistence","nothingness","absence","void","nullity"],"phonetic":"/ˌnɑnˈbiɪŋ/","extraExplanation":["“nonbeing”常出现在哲学讨论中，尤其是在“存在（being）与非存在（nonbeing）”的对照里：它不只是“没有”，也可能指“尚未成为/无法被定义的状态”。在文学里，它常被用来表达虚无、空缺、失落或身份的消散。","拼写上也常见作“non-being”。在日常英语中它不算高频词，更常用的表达是“nonexistence（不存在）”或“nothingness（虚无）”。"]}
{"word":"nonbeings","summary":{"en":"“Nonbeings” means things (or sometimes people) seen as not truly existing or not being recognized as real.","zh":"“Nonbeings”指不存在的事物，或（有时）指不被承认为真实存在的人/群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that do not exist, or beings that are treated as if they have no real existence or identity.","zh":"不存在的事物；或被当作“没有真实存在/身份”的存在者。"},"examples":[{"en":"In the story, ghosts are described as nonbeings who cannot touch the living world.","zh":"在这个故事里，鬼魂被描写为无法触碰生者世界的“非存在者”。"},{"en":"He spoke of his forgotten ancestors as if they were nonbeings, erased from history.","zh":"他谈起被遗忘的祖先时，好像他们是从历史里被抹去的“非存在者”。"}]}],"synonyms":["nonentities","nothingness (in some contexts)","nonexistents (rare)"],"phonetic":"/ˌnɑnˈbiɪŋz/","extraExplanation":["“nonbeing / non-beings”常见于哲学与文学讨论，和“being（存在）”相对。它可以指纯粹的“不存在”，也可以指在社会/政治语境中被剥夺承认、被当作“无足轻重的人”的群体（带有批判意味）。","在存在主义与形而上学里，人们会讨论“being vs. nonbeing（存在与非存在）”，例如谈论虚无（nothingness）、缺席（absence）、或某物从可能性变为不可能性。"]}
{"word":"nonbelief","summary":{"en":"Nonbelief means a lack of belief or acceptance, often in religion or in a claim someone makes.","zh":"Nonbelief 指“不相信/不信”，常用于宗教信仰或对某种说法的否定与不接受。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of belief; refusal or inability to accept something as true (often used about religion or a claim).","zh":"不相信；不信（常用于宗教信仰或对某种说法/事实的否定与不接受）。"},"examples":[{"en":"Her face showed nonbelief when she heard the news.","zh":"她听到这个消息时，脸上露出不敢相信的表情。"},{"en":"His nonbelief in miracles shaped how he read the story.","zh":"他不相信奇迹，这影响了他对这个故事的解读。"},{"en":"The claim was met with nonbelief by many readers.","zh":"许多读者对这一说法表示不信。"}]}],"synonyms":["disbelief","unbelief","skepticism"],"phonetic":"/ˌnɑn.bəˈlif/","extraExplanation":["“nonbelief”通常是不可数名词，语气比较正式；日常口语里更常说“disbelief”（不敢相信/不信）或“unbelief”。","在宗教语境中，“nonbelief”偏中性，强调“没有信仰/不信某宗教”；而“atheism”是“无神论”（更明确的立场），两者不完全等同。"]}
{"word":"nonbeliever","summary":{"en":"Nonbeliever means a person who does not believe in a religion, god, or a particular belief; it can also describe someone who doesn’t believe.","zh":"nonbeliever 指不信教者或对某种信念不相信的人；也可作形容词表示“不信的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not believe in a particular religion, god, or set of beliefs","zh":"不信教者；（对某宗教、神或某种信念）不相信的人"},"examples":[{"en":"She is a nonbeliever, so she doesn’t take part in religious ceremonies.","zh":"她是不信教者，所以不参加宗教仪式。"},{"en":"Some nonbelievers still enjoy visiting churches for their history and art.","zh":"有些不信教者仍然喜欢参观教堂，因为那里有历史与艺术价值。"}]},{"partOfSpeech":"adj.","definition":{"en":"not believing in a particular religion or idea","zh":"不信的；不信教的；不相信某种观点的"},"examples":[{"en":"He remained nonbeliever even after years of discussion.","zh":"即使讨论了很多年，他仍然不信。"},{"en":"The group includes believers and nonbeliever members.","zh":"这个团体里既有信徒，也有不信教的成员。"}]}],"synonyms":["atheist","agnostic","skeptic","unbeliever"],"phonetic":"/ˌnɑn bəˈliːvɚ/","extraExplanation":["“non-”是英语里常见的否定前缀，表示“不是/不…”，因此 nonbeliever 字面意思就是“不是信者的人”。","在日常英语里，更常见的说法是 atheist（无神论者，强调不相信神）或 agnostic（不可知论者，强调不确定是否有神）。nonbeliever 语气更宽泛，也可以指对某种理念/主张“不相信”的人。使用时注意场合与尊重语气。"]}
{"word":"nonbelievers","summary":{"en":"Nonbelievers are people who do not believe in a particular religion or faith.","zh":"nonbelievers 指不信某种宗教或信仰的人（非信徒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who do not believe in a particular religion, god, or doctrine; people who are not believers (often used in religious contexts).","zh":"不信某种宗教、神或教义的人；非信徒（常见于宗教语境）。"},"examples":[{"en":"The group welcomed believers and nonbelievers to the discussion.","zh":"该团体欢迎信徒和非信徒一起参加讨论。"},{"en":"Some traditions describe nonbelievers as outsiders to the faith.","zh":"有些传统把非信徒描述为该信仰之外的人。"}]}],"synonyms":["nonreligious people","non-Christians (context-specific)","atheists (more specific)","agnostics (more specific)"],"phonetic":"/ˌnɑn.bəˈli.vɚz/","extraExplanation":["“nonbeliever”通常是中性描述（不信者/非信徒），但在某些强烈的宗教或政治语境中，可能带有评判色彩。更中性的替代说法包括：“people who don’t share the faith（不持相同信仰的人）”、“secular people（世俗人士）”、“atheists/agnostics（无神论者/不可知论者，若语义更精确时）”。","词形：non-（否定前缀）+ believer（信徒/相信者）。复数为 nonbelievers。"]}
{"word":"nonbelieving","summary":{"en":"Nonbelieving means “not believing,” especially in a religious sense, or not accepting a claim.","zh":"nonbelieving 意为“不相信的”，常指不信宗教，也可指不接受某种说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not believing in something; lacking belief, trust, or acceptance (often used about religion or a claim).","zh":"不相信的；缺乏信念或信任的（常用于宗教或某种说法）。"},"examples":[{"en":"He is nonbelieving, but he respects people of faith.","zh":"他不信教，但他尊重有信仰的人。"},{"en":"The jury remained nonbelieving after hearing the witness’s story.","zh":"听完证人的说法后，陪审团仍然不相信。"}]}],"synonyms":["unbelieving","skeptical","nonreligious","faithless"],"phonetic":"/ˌnɑn.bɪˈliː.vɪŋ/","extraExplanation":["“nonbelieving”常用来描述“对宗教不信”的状态，但也可以更广泛地指“对某件事不相信”。在日常口语里，更常见的说法有：nonreligious（不宗教的）、not a believer（不是信徒/不信）、skeptical（持怀疑态度的）。","作为复合词：non-（否定前缀）+ believing（相信的）。它比“skeptical”更偏“没有信仰/不接受”，而“skeptical”更强调“需要证据、暂时不信”。"]}
{"word":"nonbelievingly","summary":{"en":"Nonbelievingly means “in a way that shows you don’t believe something,” often with a skeptical or incredulous tone.","zh":"nonbelievingly 表示“以不相信的态度”，常带有怀疑或难以置信的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you do not believe something is true; skeptically.","zh":"以不相信的态度；怀疑地。"},"examples":[{"en":"She looked at him nonbelievingly when he said he had finished the project in one day.","zh":"当他说他一天就完成了项目时，她用不相信的眼神看着他。"},{"en":"“You won the lottery?” he asked nonbelievingly.","zh":"“你中彩票了？”他难以置信地问。"}]}],"synonyms":["skeptically","in disbelief","incredulously","doubtfully"],"phonetic":"/ˌnɑn bəˈliːvɪŋli/","extraExplanation":["“nonbelievingly”由 non-（不、非）+ believing（相信的）+ -ly（副词后缀）构成，意思是“以不相信的方式”。在日常英语里更常见、更自然的说法是 **in disbelief**（难以置信地）或 **skeptically**（怀疑地）。","这个词比较少见，写作或口语中用它时，语气通常带有“你说的我不太信”的感觉；如果想表达更强烈的惊讶，也常用 **in disbelief** 或 **incredulously**。"]}
{"word":"nonbelligerency","summary":{"en":"Nonbelligerency means staying out of a war without being fully neutral, sometimes offering limited support to one side.","zh":"Nonbelligerency 指不参战但不完全中立的立场/政策，可能在不正式参战的情况下对一方提供有限支持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the policy or state of staying out of a war while not being fully neutral; often giving limited support (such as trade or aid) to one side without officially fighting","zh":"“非交战”状态或政策：不直接参战，但也不完全中立；常指在不正式参战的情况下对一方提供有限支持（如贸易、援助）"},"examples":[{"en":"During the early years of the conflict, the country declared nonbelligerency while selling supplies to its allies.","zh":"在冲突初期，该国宣布处于非交战状态，同时向盟友出售物资。"},{"en":"Nonbelligerency allowed the government to avoid sending troops while still influencing the war’s outcome.","zh":"非交战政策使政府避免派兵，同时仍能影响战争结果。"}]}],"synonyms":["noninvolvement","neutrality (not exact)","abstention (formal)"],"phonetic":"/ˌnɑn.bəˈlɪdʒ.ɚ.ən.si/","extraExplanation":["“nonbelligerency”常出现在国际关系与二战史语境中，含义通常介于“neutrality（中立）”与“belligerency（交战国身份）”之间：中立强调不偏不倚，而非交战往往暗示在法律上不参战、在政治或经济上却可能倾向某一方。","词形结构：non-（不、非）+ belligerent（交战的；好战的，源自拉丁语 bellum“战争”）+ -cy（名词后缀，表示状态/性质）。","历史上较常被用来描述某些国家在特定时期的立场（例如二战初期的意大利曾以此自称）。"]}
{"word":"nonbelligerent","summary":{"en":"Nonbelligerent describes a country or group that does not take part in a war or armed conflict.","zh":"nonbelligerent 指国家或团体“不参战、不参与武装冲突”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not taking part in a war or armed conflict; not fighting (even if not fully neutral).","zh":"（国家或团体）不参战的；不参与武装冲突的（但不一定完全中立）。"},"examples":[{"en":"During the conflict, the country remained nonbelligerent and did not send troops.","zh":"在冲突期间，这个国家保持不参战，没有派遣军队。"},{"en":"They signed a trade agreement while staying nonbelligerent.","zh":"他们在保持不参战的同时签署了贸易协议。"}]}],"synonyms":["noncombatant","not at war","neutral (often, but not always)"],"phonetic":"/ˌnɑn bəˈlɪdʒərənt/","extraExplanation":["“nonbelligerent”常用于国际关系与历史语境，强调“没有参战/不与交战双方作战”。它与“neutral（中立的）”不同：neutral 通常表示在政治与军事上都尽量不偏袒任何一方；nonbelligerent 只强调“不打仗”，可能仍在外交、经济或物资上偏向某一方。","词源上由 non-（不）+ belligerent（交战的）构成；belligerent 来自拉丁语 bellum（战争）。","常见搭配：nonbelligerent country/state（不参战国家）、remain/keep nonbelligerent（保持不参战）。相关词：neutral, nonaligned（不结盟的）, belligerent（交战的）。"]}
{"word":"nonbelligerents","summary":{"en":"Nonbelligerents are people or countries that do not take part in a war or conflict.","zh":"nonbelligerents 指不参与战争或冲突的个人或国家（非交战方）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, group, or country that is not taking part in a war or armed conflict (even if they may be affected by it).","zh":"（人、团体或国家）不参与战争或武装冲突的一方（即使可能受其影响）。"},"examples":[{"en":"During the conflict, several neighboring states remained nonbelligerents.","zh":"在这场冲突中，几个邻国保持为非交战方。"},{"en":"Hospitals and civilians should be protected, including nonbelligerents.","zh":"医院和平民应受到保护，包括非交战方。"}]},{"partOfSpeech":"n.","definition":{"en":"People or states that stay outside a fight or dispute (used more broadly than war, but still formal).","zh":"（更广义、较正式）在争斗或争端中保持不参与的一方。"},"examples":[{"en":"Most members of the committee were nonbelligerents in the argument.","zh":"委员会的大多数成员在这场争论中保持中立、不参与。"}]}],"synonyms":["neutrals","neutral parties","noncombatants (related but not identical)"],"phonetic":"ˌnɑn bəˈlɪdʒərənts","extraExplanation":["“nonbelligerent”在二战语境中较常见：有些国家不正式参战，但可能对某一方提供物资、通行或其他支持，因此不同于严格意义上的“neutral（中立国）”。","词形上：non-（不、非）+ belligerent（交战的；交战方）。注意它是比较正式/书面用词，日常英语里更常说“neutral countries/people（中立国家/人士）”或“not involved（没有参与）”。"]}
{"word":"nonbending","summary":{"en":"Nonbending means physically rigid (not able to bend) or figuratively unyielding (not willing to change).","zh":"nonbending 指（物理上）不可弯曲、很硬；也可指（态度上）不肯让步、难以改变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to bend; rigid or inflexible in a physical sense.","zh":"（物理上）不能弯曲的；坚硬的；不易折弯的。"},"examples":[{"en":"The nonbending metal rod kept its shape even under pressure.","zh":"这根不可弯曲的金属杆即使在压力下也能保持形状。"},{"en":"Choose a nonbending binder if you need to protect important papers.","zh":"如果你需要保护重要文件，选择一个不易弯折的文件夹更好。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not willing to change opinions or decisions; unyielding or stubborn (figurative).","zh":"（比喻）不肯让步的；固执的；立场坚定到不易改变的。"},"examples":[{"en":"She was nonbending about the deadline, even when others asked for more time.","zh":"即使别人请求延长时间，她对截止日期也毫不让步。"},{"en":"His nonbending attitude made compromise difficult.","zh":"他那种不肯让步的态度让妥协变得很难。"}]}],"synonyms":["inflexible","rigid","unyielding","unbending","stiff"],"phonetic":"/nɑnˈbɛndɪŋ/","extraExplanation":["“non-”是否定前缀，表示“非、不”；“bending”来自动词 bend（弯曲）。在英语里，“bend”也常用来比喻“让步、改变立场”，所以 nonbending 除了“硬得弯不了”，也可表示“态度强硬、不妥协”。在日常写作中更常见的同义表达有 inflexible、unyielding、rigid。"]}
{"word":"nonbeneficed","summary":{"en":"Nonbeneficed means not holding a paid church post (a benefice).","zh":"nonbeneficed表示“未受俸的”，即没有带固定收入的教会职位（无圣俸）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in the Christian church) not holding a benefice—i.e., not having a paid church position with income attached.","zh":"（尤指基督教会中）未受俸的；未领“圣俸/教会俸禄”的（即没有带固定收入的教会职位）。"},"examples":[{"en":"He served as a nonbeneficed priest, relying on part-time work for income.","zh":"他以未受俸神父的身份服事，同时靠兼职工作维持收入。"},{"en":"The parish appointed a nonbeneficed curate to assist during the busy season.","zh":"堂区聘请了一位未受俸的助理牧师在繁忙季节协助工作。"}]}],"synonyms":["unbeneficed","unpaid (clergy)","without a benefice"],"phonetic":"/ˌnɑnˈbɛnəˌfɪst/","extraExplanation":["“benefice”原指英国国教等教会体系中的一种“圣俸/教会俸禄”：某个教会职位（如牧师职位）通常附带土地、捐献或固定收入。nonbeneficed多见于英式、教会语境，用来区分有固定俸禄的clergy与没有固定俸禄、可能靠津贴或其他工作维生的clergy。","该词较少见；现代写作中也可能用unbeneficed或直接说“unpaid/without a benefice”（无俸/无圣俸）来表达同义。"]}
{"word":"nonbeneficence","summary":{"en":"Nonbeneficence is an ethical principle meaning “do no harm,” especially in medicine.","zh":"Nonbeneficence 指“不伤害”这一伦理原则，尤用于医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ethical principle of not causing harm to others; in healthcare, it means avoiding actions that could injure or worsen a patient’s condition.","zh":"“不伤害”原则；一种伦理原则，强调不对他人造成伤害。在医疗中指避免采取可能伤害或加重病情的行为。"},"examples":[{"en":"In medical ethics, nonbeneficence reminds doctors to avoid treatments that may do more harm than good.","zh":"在医学伦理中，不伤害原则提醒医生避免使用“弊大于利”的治疗。"},{"en":"The committee argued that strict privacy rules support nonbeneficence by preventing harm to patients.","zh":"委员会认为严格的隐私规定通过防止对患者的伤害来支持不伤害原则。"}]}],"synonyms":["nonmaleficence","do no harm"],"phonetic":"/ˌnɑnˌbɛnəˈfɪsəns/","extraExplanation":["这个词较少用于日常口语，更常见于医学伦理/生命伦理学讨论。更常见、也更“标准”的术语是 **nonmaleficence**（不伤害原则）。两者表达的核心意思非常接近。","来源上，*non-* 表示“非/不”，*beneficence* 表示“行善/有益”。因此 *nonbeneficence* 从构词上直译为“非行善/不施益”，但在实际伦理语境中常被用来指“不要造成伤害”（接近 nonmaleficence）。","常与 **beneficence（行善/促进利益）** 搭配讨论：前者强调“不要伤害”，后者强调“要尽力帮助”。两者有时会发生张力，比如某种高风险手术可能有益但也可能带来伤害。"]}
{"word":"nonbeneficent","summary":{"en":"“Nonbeneficent” means not kind or not doing good for others; it can also mean not beneficial.","zh":"“nonbeneficent”意为“不慈善/不仁慈；不行善”，也可指“没有益处的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not beneficent; not kind or generous; not doing good for others","zh":"不慈善的；不仁慈的；不做善事/不带来益处的"},"examples":[{"en":"The charity described the fraudulent scheme as nonbeneficent because it harmed vulnerable people.","zh":"该慈善机构称这种诈骗计划为 nonbeneficent（不慈善的），因为它伤害了弱势群体。"},{"en":"His intentions were nonbeneficent, even if his words sounded polite.","zh":"他的意图并不仁慈（nonbeneficent），即使他说话听起来很客气。"},{"en":"Policies that look efficient can still be nonbeneficent if they ignore human costs.","zh":"看似高效的政策如果忽视人的代价，也可能是 nonbeneficent（不带来益处的）。"}]}],"synonyms":["unkind","uncharitable","malevolent","not beneficial","harmful"],"phonetic":"/ˌnɑn.bəˈnɛf.ɪ.sənt/","extraExplanation":["nonbeneficent 是比较少见的词，日常英语里更常用 unkind（不友善的）、uncharitable（不宽厚的/不慈善的）、malevolent（恶意的）或 not beneficial（没有益处的）。","构词：non- 表示“非/不”，beneficent 来自拉丁语 bene（好）+ facere（做），原意与“行善、造福”有关。"]}
{"word":"nonbeneficently","summary":{"en":"“Nonbeneficently” means “not kindly or helpfully; in a way that does not benefit others.”","zh":"“nonbeneficently”意为“并非仁慈或有益地；以不帮助他人的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not beneficent; without kindness, generosity, or a desire to help.","zh":"以不慈善／不仁慈的方式；缺乏善意、慷慨或助人的意愿。"},"examples":[{"en":"The policy was applied nonbeneficently, prioritizing punishment over support.","zh":"这项政策以不仁慈的方式执行，优先惩罚而非支持。"},{"en":"He spoke nonbeneficently about the volunteers, dismissing their efforts as useless.","zh":"他用不善意的口吻谈论志愿者，贬低他们的努力毫无用处。"}]}],"synonyms":["unkindly","unhelpfully","harshly","without compassion"],"phonetic":"/ˌnɑn.bəˈnɛf.ɪ.sənt.li/","extraExplanation":["这个词非常少见，多见于学术或伦理讨论中。日常英语里更常用：unhelpfully（不帮忙地）、unkindly（不友善地）、without compassion（没有同情心地）、in a harsh way（以严厉的方式）等。","构词：non-（不）+ beneficent（慈善的／有益的）+ -ly（副词后缀）。与 beneficently（仁慈地）相对。"]}
{"word":"nonbeneficial","summary":{"en":"Nonbeneficial means “not helpful or not providing benefits,” and it’s relatively formal.","zh":"nonbeneficial 意为“无益的、没有带来好处的”，语体较正式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not providing a benefit or advantage; not helpful.","zh":"没有带来好处或优势的；无益的；不利的。"},"examples":[{"en":"Cutting sleep to study late is often nonbeneficial in the long run.","zh":"为了熬夜学习而减少睡眠，从长远来看往往是无益的。"},{"en":"They stopped investing in nonbeneficial projects and focused on what truly helped customers.","zh":"他们停止投资无益的项目，把重点放在真正能帮助客户的事情上。"}]}],"synonyms":["not beneficial","unhelpful","ineffective","counterproductive (if it has a negative effect)"],"phonetic":"/ˌnɑnˌbɛnəˈfɪʃəl/","extraExplanation":["“Nonbeneficial”是由前缀 non-（表示“非、不”）+ beneficial（有益的）构成，意思很直观。","它比常见的 “not helpful / not beneficial” 更正式，常见于学术、医疗、政策、商业分析等语境。","在日常口语里，人们更常说：unhelpful（不太有用的）、useless（没用的）、counterproductive（适得其反的，反而有害）。注意：nonbeneficial 通常强调“没有收益/没有效果”，不一定表示“有害”。"]}
{"word":"nonbeneficially","summary":{"en":"“Nonbeneficially” means “in a way that is not beneficial.”","zh":"“nonbeneficially”意思是“以无益的方式；没有带来好处地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not beneficial; without producing a good or helpful result.","zh":"以没有益处的方式；不产生好处或帮助地。"},"examples":[{"en":"The policy change affected low-income families nonbeneficially.","zh":"这项政策变化对低收入家庭产生了不利（无益）的影响。"},{"en":"If you use the medicine nonbeneficially, you may waste money and time.","zh":"如果你不恰当地使用这种药，可能只是浪费金钱和时间。"}]}],"synonyms":["unhelpfully","to no benefit","without benefit","not advantageously"],"phonetic":"/ˌnɑnˌbɛnəˈfɪʃəli/","extraExplanation":["“nonbeneficially”是由前缀 non-（不、非）+ beneficial（有益的）+ -ly（副词后缀）构成，意思直观但在日常英语中比较少见。写作或口语里更常用的表达有：“in a way that isn’t beneficial / in an unhelpful way / to no benefit”。","注意语气：它通常用于较正式的语境（学术、政策、医学、商业分析），用来描述某种做法或影响“没有带来好处”，而不一定表示“造成伤害”。如果想强调“有害”，更自然的词是 “harmfully / detrimentally”。"]}
{"word":"nonbeneficialness","summary":{"en":"“Nonbeneficialness” means the state of not being beneficial—having no benefit or usefulness.","zh":"“nonbeneficialness”指“不具益处/无益处”的状态，即没有好处或用处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being beneficial; lack of benefit or usefulness","zh":"不具益处的性质；无益性；无用性"},"examples":[{"en":"The report highlights the nonbeneficialness of the policy for low-income families.","zh":"这份报告强调该政策对低收入家庭并无益处。"},{"en":"We stopped funding the project because its nonbeneficialness was clear.","zh":"由于该项目的无益性很明显，我们停止了资助。"}]}],"synonyms":["lack of benefit","lack of usefulness","nonbenefit","unhelpfulness","uselessness"],"phonetic":"/ˌnɑnˌbɛnəˈfɪʃəl.nəs/","extraExplanation":["“nonbeneficialness”较少见，更常用的表达是“lack of benefit / lack of usefulness”（缺乏益处/用处）、“non-beneficial nature”（无益的性质）、或更简洁的“uselessness”（无用性，语气更强）。","构词法：non-（否定前缀）+ beneficial（有益的）+ -ness（名词后缀，表示“性质/状态”）。因为层级较多，所以在正式写作中常被更自然的替代表达取代。","写作建议：如果想表达“对某人/某事没有好处”，通常直接说“is not beneficial to…”会更地道。"]}
{"word":"nonbenevolence","summary":{"en":"Nonbenevolence means a lack of kindness or goodwill.","zh":"Nonbenevolence 指缺乏仁慈或善意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of kindness, generosity, or goodwill; a lack of benevolence (not necessarily active cruelty, just not benevolent)","zh":"缺乏仁慈、慷慨或善意；没有善心（不一定是“残忍”，也可能只是“不友善/不关心”）"},"examples":[{"en":"The policy was criticized for its nonbenevolence toward vulnerable families.","zh":"这项政策因对弱势家庭缺乏善意而受到批评。"},{"en":"His silence felt like nonbenevolence, not open hostility.","zh":"他的沉默让人感到是缺乏善意，而不是公开的敌意。"}]}],"synonyms":["unkindness","indifference","lack of compassion","callousness","coldness"],"phonetic":"/ˌnɑn.bəˈnɛv.ə.ləns/","extraExplanation":["这个词比较少见，更多时候英语会用更常见的表达来替代，比如：lack of compassion（缺乏同情心）、unkindness（不友善）、indifference（冷漠）。","构词上是 non-（不、非）+ benevolence（仁慈、善意）。语气通常比 “malevolence”（恶意、坏心眼）弱：nonbenevolence 更像“没有善意”，malevolence 则是“有恶意”。"]}
{"word":"nonbenevolent","summary":{"en":"Nonbenevolent means not kind or helpful; lacking goodwill.","zh":"nonbenevolent 指“不仁慈、不友善”，缺乏善意或帮助他人的意图。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not kind or helpful; lacking goodwill toward others.","zh":"不仁慈的；不友善的；缺乏善意的。"},"examples":[{"en":"The policy may not be evil, but it can feel nonbenevolent to people who need support.","zh":"这项政策未必是恶意的，但对需要帮助的人来说可能显得不够仁慈。"},{"en":"He spoke in a nonbenevolent tone that made everyone uncomfortable.","zh":"他用一种不友善的语气说话，让大家都很不自在。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not intended to benefit others; not charitable or supportive.","zh":"不以他人受益为目的的；不具慈善或支持性质的。"},"examples":[{"en":"They chose a nonbenevolent approach focused only on cutting costs.","zh":"他们选择了一种不以他人受益为目的的做法，只关注削减成本。"},{"en":"Her comment was nonbenevolent—more criticism than help.","zh":"她的评论并不友善，更像批评而不是帮助。"}]}],"synonyms":["unkind","uncharitable","ill-intentioned","unsympathetic","unfriendly"],"phonetic":"/ˌnɑn.bəˈnɛv.ə.lənt/","extraExplanation":["这个词由前缀 non-（不、非）+ benevolent（仁慈的、乐善好施的）构成，语气较正式，常见于学术写作、伦理讨论或政策评价中。","与 cruel（残忍的）相比，nonbenevolent 通常更“弱”，更像是“缺乏善意/不太友好”，不一定表示主动伤害。"]}
{"word":"nonbenevolently","summary":{"en":"“Nonbenevolently” means doing or saying something in an unkind, not well-meaning way.","zh":"“nonbenevolently”表示以不仁慈、无善意的方式行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an unkind, not helpful, or not well-meaning way; without benevolence.","zh":"以不仁慈、无善意、不给予帮助的方式；缺乏善意地。"},"examples":[{"en":"He spoke nonbenevolently, as if he wanted to embarrass her.","zh":"他说话毫无善意，仿佛想让她难堪。"},{"en":"The policy was applied nonbenevolently, with no concern for vulnerable people.","zh":"这项政策在执行时缺乏善意，对弱势群体毫不关心。"}]}],"synonyms":["unkindly","cruelly","maliciously","without kindness","with ill will"],"phonetic":"/ˌnɑn bəˈnɛvələntli/","extraExplanation":["“nonbenevolently”较少见，常用于较正式或批评性的语境。日常表达里更常用：“unkindly / cruelly / without kindness / with ill will”。","构词理解：benevolent（仁慈的）→ benevolently（仁慈地）→ non- + benevolently（不仁慈地）。non- 表示“否定/缺乏”。"]}
{"word":"nonbetrayal","summary":{"en":"Nonbetrayal means not betraying someone; loyalty or faithfulness (rare).","zh":"nonbetrayal 指“不背叛”；相当于忠诚或守信（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or state of not betraying someone; loyalty or faithfulness (rare word)","zh":"不背叛；忠诚（较少见的用法）"},"examples":[{"en":"She valued his nonbetrayal more than his promises.","zh":"比起他的承诺，她更看重他不背叛的态度。"},{"en":"In times of crisis, nonbetrayal can hold a team together.","zh":"在危机时刻，不背叛能让团队更团结。"}]}],"synonyms":["loyalty","faithfulness","fidelity","keeping faith"],"phonetic":"/ˌnɑn.bɪˈtreɪ.əl/","extraExplanation":["“nonbetrayal”不是非常常见的标准词汇，更常见的表达是“loyalty / faithfulness / fidelity”或“not betraying someone”。","构词上是前缀“non-（不、非）”+“betrayal（背叛）”，属于把否定意义直接加在名词上的写法，常见于较正式或学术化的语境。"]}
{"word":"nonbeverage","summary":{"en":"“Nonbeverage” means something that is not a drink, often used for product categories or rules.","zh":"“nonbeverage”指“非饮料（不是饮品）”，常用于商品分类或规定条款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is not a drink; a product not intended to be consumed as a beverage (often used in rules, labeling, or tax contexts).","zh":"非饮料；不是用来当作饮品饮用的产品（常见于法规、标签或税务语境）。"},"examples":[{"en":"The store sells beverages on one shelf and nonbeverages, like paper towels, on another.","zh":"这家店一边货架卖饮料，另一边卖非饮料商品，比如纸巾。"},{"en":"Under the policy, food and nonbeverage items are not reimbursed.","zh":"按该政策规定，食品和非饮料类物品不予报销。"},{"en":"The label warns: “Not a beverage—do not drink.”","zh":"标签警示：“非饮料——请勿饮用。”"}]},{"partOfSpeech":"adj.","definition":{"en":"Not related to drinks; describing something that is not a beverage.","zh":"非饮料的；与饮品无关的（用于描述性质）。"},"examples":[{"en":"They offer nonbeverage options such as snacks and souvenirs.","zh":"他们提供非饮料类选择，比如零食和纪念品。"},{"en":"The tax rate is different for beverage and nonbeverage products.","zh":"饮料和非饮料产品的税率不同。"}]}],"synonyms":["non-drink item","nonfood item","merchandise (context-dependent)"],"phonetic":"/ˌnɑnˈbɛvɚɪdʒ/","extraExplanation":["“non-”是常见前缀，表示“非、不”。因此 nonbeverage 字面就是“不是饮料”。","这个词在日常口语中不算常见，更常出现在商店分类、报销/公司政策、食品安全警示语、或法规与税务文件中（例如区分“饮料”与“非饮料产品”以适用不同规定）。"]}
{"word":"nonbiased","summary":{"en":"Nonbiased means fair and objective, without prejudice.","zh":"nonbiased 意为不带偏见的、公正客观的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not influenced by personal opinions, unfair preferences, or prejudice; fair and objective.","zh":"不带偏见的；公正客观的（不受个人观点或不公平偏好影响）。"},"examples":[{"en":"We need a nonbiased review of the evidence before making a decision.","zh":"在做决定之前，我们需要对证据进行不带偏见的审查。"},{"en":"Try to ask nonbiased questions that don’t lead the witness.","zh":"尽量提出不带倾向性的提问，不要诱导证人。"},{"en":"The report aims to be nonbiased, but readers should still check the sources.","zh":"这份报告力求客观不偏，但读者仍应核对信息来源。"}]}],"synonyms":["unbiased","impartial","objective","neutral","fair-minded"],"phonetic":"/nɑnˈbaɪəst/","extraExplanation":["“nonbiased”在英语里能用、也能被理解，但更常见、更自然的说法是“unbiased”（以及在正式写作中常见的“impartial”“objective”）。","在写作中，“nonbiased questions”常见于调查/法庭语境，意思是“中立、不诱导”的问题；在新闻与研究语境中也常用来强调“客观”。"]}
{"word":"nonbibulous","summary":{"en":"Nonbibulous means not drinking alcohol, or (of a drink) non-alcoholic.","zh":"nonbibulous 指不喝酒/戒酒的；也可指（饮料）不含酒精的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not drinking alcohol; abstaining from alcoholic drinks.","zh":"不喝酒的；戒酒的；禁酒的。"},"examples":[{"en":"He’s nonbibulous during the workweek and only drinks coffee and tea.","zh":"他工作日不喝酒，只喝咖啡和茶。"},{"en":"She chose a nonbibulous lifestyle after training for a marathon.","zh":"为了备战马拉松，她选择了不喝酒的生活方式。"},{"en":"They hosted a nonbibulous gathering with plenty of sparkling water and juice.","zh":"他们办了一场不喝酒的聚会，准备了很多苏打水和果汁。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of a beverage: non-alcoholic.","zh":"（饮料）不含酒精的。"},"examples":[{"en":"The restaurant offers several nonbibulous options, including mocktails.","zh":"这家餐厅提供多种不含酒精的选择，包括无酒精鸡尾酒。"},{"en":"Try a nonbibulous cider if you want the flavor without alcohol.","zh":"如果你想要风味但不想要酒精，可以试试无酒精苹果酒。"}]}],"synonyms":["sober","teetotal","abstinent","non-alcoholic","non-drinking"],"phonetic":"/ˌnɑnˈbɪbjələs/","extraExplanation":["这个词比较少见，带一点幽默/文雅的书面味道。词根来自拉丁语 bibere（“喝”），所以 bibulous 是“爱喝酒的/嗜酒的”，加上前缀 non- 就变成“非饮酒的”。在日常英语里更常用 sober、teetotal 或 non-drinker。"]}
{"word":"nonbibulously","summary":{"en":"Nonbibulously means “without drinking alcohol; soberly” (most common), and more rarely “without absorbing liquid.”","zh":"nonbibulously主要指“以不饮酒的方式；清醒地”，较少见时也可指“以不吸收液体的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not involve drinking alcohol; soberly.","zh":"以不饮酒的方式；清醒地（不喝酒地）。"},"examples":[{"en":"He celebrated the promotion nonbibulously, with sparkling water instead of champagne.","zh":"他用气泡水代替香槟，以不饮酒的方式庆祝升职。"},{"en":"They chose to socialize nonbibulously during the work trip.","zh":"他们在出差期间选择不喝酒地社交。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that does not absorb liquid; without being absorbent. (Rare)","zh":"以不吸收液体的方式；不具吸水性地。（较少见）"},"examples":[{"en":"The coating makes the fabric behave nonbibulously in light rain.","zh":"这种涂层让布料在小雨中表现得不吸水。"}]}],"synonyms":["soberly","abstemiously","without alcohol","teetotally (informal)"],"phonetic":"/ˌnɑnˈbɪbjələsli/","extraExplanation":["“nonbibulously”来自形容词“bibulous”。“bibulous”既可以指“嗜酒的（爱喝酒的）”，也可以指“吸水的/易吸收液体的”（例如纸巾、海绵）。加上否定前缀“non-”变成“nonbibulous”，再加“-ly”构成副词“nonbibulously”。","这个词在日常英语中非常少见；更常用的表达是“without alcohol / soberly / not drinking”。在写作中用它会带一点幽默或刻意“文绉绉”的感觉。"]}
{"word":"nonbibulousness","summary":{"en":"Nonbibulousness means not drinking alcohol—sobriety or abstinence.","zh":"nonbibulousness 指不饮酒（清醒、戒酒/禁酒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or habit of not drinking alcohol; sobriety or abstinence","zh":"不饮酒的状态或习惯；清醒、戒酒"},"examples":[{"en":"After his health scare, he practiced nonbibulousness for a full year.","zh":"在那次健康警讯之后，他整整一年都保持不饮酒。"},{"en":"The office party included plenty of options for nonbibulousness, like sparkling water and juice.","zh":"办公室派对也准备了很多适合不饮酒者的选择，比如气泡水和果汁。"},{"en":"Her nonbibulousness wasn’t judgmental; it was simply a personal choice.","zh":"她的不饮酒并不是在评判别人，只是个人选择。"}]}],"synonyms":["sobriety","abstinence","temperance"],"phonetic":"/ˌnɑnˈbɪbjələsnəs/","extraExplanation":["这是一个比较少见、略带幽默/书面感的词：non-（不）+ bibulous（爱喝酒的）+ -ness（名词后缀）。bibulous 源自拉丁语 bibere（“喝”）。日常英语里更常用 sobriety（清醒/戒酒）、abstinence（禁酒/戒除）、temperance（节制，尤指节酒）。"]}
{"word":"nonbigoted","summary":{"en":"“Nonbigoted” means not prejudiced or intolerant; respectful and fair toward different groups.","zh":"“nonbigoted”指不带偏见、不狭隘排外；对不同群体保持尊重与公平。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having prejudiced or intolerant views; fair and respectful toward people of different groups (race, religion, gender, etc.).","zh":"不抱偏见的；不狭隘排外的；对不同群体（种族、宗教、性别等）保持尊重与包容的。"},"examples":[{"en":"Our goal is to create a nonbigoted workplace where everyone feels safe and respected.","zh":"我们的目标是营造一个不抱偏见的工作环境，让每个人都感到安全并受到尊重。"},{"en":"She tried to stay nonbigoted and listen carefully to opinions different from her own.","zh":"她努力保持不带偏见，认真倾听与自己不同的观点。"}]}],"synonyms":["open-minded","tolerant","unprejudiced","inclusive","broad-minded"],"phonetic":"/ˌnɑnˈbɪɡətɪd/","extraExplanation":["“non-”是英语里常见的否定前缀，表示“不是/非”。“bigoted”来自“bigot”（偏执、狭隘的人），通常指对某群体因身份（如种族、宗教、性取向等）而产生不公平的负面判断。","在现代语境中，“nonbigoted”多用于强调价值立场（公平、尊重、多元与包容）。在写作里也常用更常见的替换词如“open-minded”“tolerant”“inclusive”，语气更自然。"]}
{"word":"nonbigotedly","summary":{"en":"“Nonbigotedly” means acting or speaking without prejudice or intolerance.","zh":"“nonbigotedly”表示以不带偏见、不歧视的方式行事或表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not bigoted; without prejudice or unfair dislike toward people because of their race, religion, gender, sexuality, etc.","zh":"以不偏狭、不歧视的方式；不因种族、宗教、性别、性取向等而对他人抱有偏见或不公平的反感。"},"examples":[{"en":"The manager tried to respond nonbigotedly to complaints from employees of different backgrounds.","zh":"经理努力以不带偏见的态度回应来自不同背景员工的投诉。"},{"en":"We should talk about immigration nonbigotedly, using facts and empathy rather than stereotypes.","zh":"我们应该用不带歧视的方式讨论移民问题，依靠事实与同理心，而不是刻板印象。"}]}],"synonyms":["without prejudice","without bias","impartially","tolerantly","open-mindedly"],"phonetic":"/ˌnɑnˈbɪɡətɪdli/","extraExplanation":["这个词由 non-（“不”）+ bigoted（“有偏见的、心胸狭隘的”）+ -ly（副词后缀，“以……方式”）构成。实际使用中较少见，更常用的表达是 “without prejudice / without bias / in a tolerant way”。","语气上它强调“刻意避免偏见”，常用于讨论社会议题、职场多元、公平对待等语境。"]}
{"word":"nonbilabiate","summary":{"en":"“Nonbilabiate” means a sound is not made with both lips (not bilabial).","zh":"“nonbilabiate”指发音不是用双唇完成的（非双唇音/非 bilabial）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not produced with both lips; not bilabial (in phonetics).","zh":"（语音学）不是用双唇发音的；非双唇音的（非 bilabial）。"},"examples":[{"en":"English /p/, /b/, and /m/ are bilabial, but /t/ and /s/ are nonbilabiate sounds.","zh":"英语中的 /p/、/b/、/m/ 是双唇音，但 /t/ 和 /s/ 是非双唇音。"},{"en":"If your lips don’t touch during the sound, it is usually nonbilabiate.","zh":"如果发音时双唇没有接触，这个音通常就是非双唇音。"}]}],"synonyms":["non-bilabial","not bilabial"],"phonetic":"/ˌnɑn.baɪˈleɪ.bi.ət/","extraExplanation":["“nonbilabiate”较少见，多用于语音学/语言学写作。更常见的表达是“non-bilabial（非双唇的）”。","双唇音（bilabial）典型例子：/p/、/b/、/m/（双唇闭合或接近）；非双唇音则包括齿龈音（/t/、/d/、/s/ 等）、软腭音（/k/、/g/）、声门音（/h/）等。"]}
{"word":"nonbilious","summary":{"en":"Nonbilious means “not bilious”—not feeling nauseous or showing bile-related discomfort (and sometimes, in older usage, not irritable).","zh":"nonbilious 意为“非胆汁性的/不胆汁病的”——不恶心、无胆汁相关不适；旧式用法里也可带“不易怒”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bilious; not suffering from or showing symptoms related to bile (such as nausea or a sickly, irritable feeling).","zh":"非胆汁质的；不患“胆汁病”的；不表现出与胆汁相关的不适（如恶心、胃部不适或烦躁）的。"},"examples":[{"en":"After changing his diet, he felt nonbilious and energetic again.","zh":"调整饮食后，他感觉不再恶心不适，精力也恢复了。"},{"en":"The doctor noted that she looked pale but nonbilious.","zh":"医生记录说她看起来有些苍白，但没有胆汁性不适的表现。"}]}],"synonyms":["not nauseous","not sick to the stomach","untroubled (by nausea)","non-nauseated"],"phonetic":"/ˌnɑnˈbɪliəs/","extraExplanation":["“bilious”在现代常指“恶心、消化不良、胆汁相关的不适”，在较旧的英语里还和“脾气暴躁、易怒”有关（源自古代的体液学说 humors）。因此 nonbilious 有时也可含“性情不暴躁/不易怒”的语感，但在当代更常见的是身体层面的“没有反胃、没有胆汁性不适”。","这个词比较少见，通常出现在较正式或文学/医学风格的描述中。日常表达里更常说“not nauseous / not sick to my stomach / no indigestion”。"]}
{"word":"nonbiliously","summary":{"en":"Nonbiliously means ‘not in a bilious (irritable or nauseated) way’—calmly and without bitterness.","zh":"nonbiliously 表示“不是胆汁质/暴躁或令人作呕的方式”，即心平气和、不带刻薄地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not bilious; without irritability, bitterness, or sickly nausea.","zh":"以不“胆汁质/暴躁/恶心”的方式；不带恼怒、刻薄或反胃感地。"},"examples":[{"en":"He replied nonbiliously, even though the question was rude.","zh":"尽管问题很无礼，他还是不带火气地回答了。"},{"en":"Try to discuss the mistake nonbiliously and focus on solutions.","zh":"尽量心平气和地讨论这个错误，把重点放在解决办法上。"}]}],"synonyms":["calmly","pleasantly","without bitterness","without rancor"],"phonetic":"/nɑnˈbɪliəsli/","extraExplanation":["“non-”是否定前缀，表示“非、不”。“bilious”原义与“胆汁”有关，历史上也常用来形容“脾气坏、易怒、刻薄”或“令人作呕/反胃”的感觉；因此 nonbiliously 常指“说话做事不带怒气、不尖酸，也不令人反胃”。","这个词非常少见，更自然的表达通常是 “calmly / without bitterness / without rancor / pleasantly”。在正式或幽默的文风里偶尔会用 nonbiliously 来显得更有“文气”。"]}
{"word":"nonbiliousness","summary":{"en":"Nonbiliousness means the condition of not being bilious—physically not nauseated/indigestive, and sometimes emotionally not irritable.","zh":"nonbiliousness 指“不胆汁质”的状态：身体上不恶心、不消化不良；有时也指情绪上不易烦躁、不易发火。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not being bilious (not having nausea/indigestion believed to come from “bile,” and by extension not being easily irritated or bad-tempered).","zh":"不胆汁质的状态；（不易恶心/消化不良、传统观念中“胆汁失调”所致的不适），引申为不易烦躁、脾气不坏的状态。"},"examples":[{"en":"After a light meal, she felt a welcome sense of nonbiliousness.","zh":"吃了清淡的一餐后，她感到一种难得的舒适与不恶心的状态。"},{"en":"His nonbiliousness in stressful meetings kept the team calm.","zh":"他在压力会议中的不急不躁，让团队保持冷静。"}]}],"synonyms":["calmness","even-temperedness","composure","lack of nausea","nonirritability"],"phonetic":"/ˌnɑnˈbɪljəsnəs/","extraExplanation":["这是一个相对少见、偏书面/幽默的名词，由 **non-**（不、非）+ **bilious**（胆汁的；恶心的；易怒的）+ **-ness**（把形容词变成名词，表示“……的状态/性质”）构成。","**bilious** 在现代英语里既可指身体不适（恶心、消化不良等），也可引申指“脾气坏、易怒”。这种“情绪=体液”的联想与西方传统医学的“四体液说（humors）”有关。"]}
{"word":"nonbillable","summary":{"en":"Nonbillable describes time or expenses that cannot be charged to a client and often do not directly generate revenue.","zh":"Nonbillable 指不能向客户计费的工时或费用，通常也指不直接带来收入的工作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be billed to a client or customer; not charged for.","zh":"（工时/费用）不可向客户计费的；不计入客户账单的。"},"examples":[{"en":"Training hours are usually nonbillable.","zh":"培训时间通常是不可计费的。"},{"en":"Please record nonbillable tasks separately in your timesheet.","zh":"请在工时表里把不可计费的任务单独记录。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not producing direct revenue (often used about work time in consulting, law, or agencies).","zh":"（工作/时间）不直接带来收入的（常用于咨询、律所或代理机构语境）。"},"examples":[{"en":"Too much nonbillable work can hurt the team’s monthly numbers.","zh":"不可计费的工作太多会影响团队的月度业绩。"},{"en":"She balanced billable projects with necessary nonbillable admin work.","zh":"她在可计费项目和必要的不可计费行政工作之间做了平衡。"}]}],"synonyms":["non-chargeable","unbillable","not billable"],"phonetic":"/nɑnˈbɪləbəl/","extraExplanation":["在北美职场里，nonbillable 常和 billable（可计费的）成对出现，尤其在律所、咨询公司、会计师事务所、广告/公关公司等按小时向客户收费的行业。","虽然 nonbillable 不向客户收费，但不等于“不重要”：常见包括内部会议、培训、市场拓展、写方案、团队管理、行政事务等。公司通常仍会要求记录这些工时，用于成本核算和资源安排。","拼写上也常见 non-billable（加连字符）或 nonbillable（不加连字符），两种都正确；写作中保持一致即可。"]}
{"word":"nonbinding","summary":{"en":"“Nonbinding” means not legally enforceable or not requiring a commitment.","zh":"nonbinding 指“（法律上）不具约束力”或“无需做出承诺、非强制”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not legally enforceable; not creating a legal obligation (often used for proposals, letters of intent, or guidelines).","zh":"（法律上）不具约束力的；不产生法律义务的（常用于提案、意向书或指导性文件）。"},"examples":[{"en":"This term sheet is nonbinding and subject to final contract approval.","zh":"这份条款清单不具约束力，需以最终合同批准为准。"},{"en":"The committee’s recommendations are nonbinding, but they can influence policy.","zh":"委员会的建议不具约束力，但可能影响政策。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not tying you to a particular choice or commitment; flexible and not mandatory.","zh":"不强制的；不要求做出承诺的；可灵活选择的。"},"examples":[{"en":"We had a nonbinding discussion about possible dates, just to get a sense of everyone’s schedule.","zh":"我们就可能的日期做了一次不具约束力的讨论，只是想了解大家的时间安排。"},{"en":"The survey is nonbinding—your answers won’t affect your services.","zh":"这份调查不具约束力——你的回答不会影响你获得的服务。"}]}],"synonyms":["not enforceable","not mandatory","noncompulsory","informal","preliminary"],"phonetic":"/ˌnɑnˈbaɪndɪŋ/","extraExplanation":["在商业与法律语境中，nonbinding 常见于 LOI（letter of intent，意向书）、MOU（memorandum of understanding，谅解备忘录）或 term sheet（条款清单）。它通常表示“总体意向/框架”，但不等于最终合同。","需要注意：文件整体写着 nonbinding 并不一定意味着所有条款都不具约束力；有时其中会有少数条款是“具有约束力的”（例如保密条款、排他性条款、适用法律与争议解决条款等）。阅读时要看具体条款如何写。"]}
{"word":"nonbindingly","summary":{"en":"Nonbindingly means “without legal force” or “without firm commitment,” often used in business or legal contexts.","zh":"nonbindingly 指“以不具法律约束力/不作明确承诺的方式”，常用于商业或法律语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not legally enforceable; without creating a legal obligation.","zh":"以不具法律约束力的方式；不产生法律义务（不具可强制执行性）。"},"examples":[{"en":"The parties agreed nonbindingly to explore a partnership before signing a contract.","zh":"双方以不具约束力的方式同意先探讨合作，再签合同。"},{"en":"This letter states nonbindingly that the seller intends to accept the offer.","zh":"这封信以不具约束力的方式表示卖方打算接受该报价。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that does not commit someone firmly; tentatively or informally.","zh":"以不作明确承诺的方式；暂定地、非正式地。"},"examples":[{"en":"We nonbindingly set a meeting for next Tuesday, but we can change it if needed.","zh":"我们先暂定下周二开会，但有需要可以改。"},{"en":"She nonbindingly said she might join the trip, depending on her schedule.","zh":"她没有作出明确承诺，只说可能会参加旅行，要看时间安排。"}]}],"synonyms":["tentatively","provisionally","informally","without commitment","on a non-binding basis"],"phonetic":"/ˌnɑnˈbaɪndɪŋli/","extraExplanation":["“nonbindingly”常见于商业与法律语境，表示某种表述或安排只是意向/参考，不构成可被法院强制执行的承诺。常与“non-binding agreement（不具约束力的协议）”“letter of intent/LOI（意向书）”“term sheet（条款清单）”等搭配。","写作中如果要更自然，也常改用短语表达：例如“on a non-binding basis（在不具约束力的基础上）”“tentatively（暂定地）”。"]}
{"word":"nonbindingness","summary":{"en":"Nonbindingness means the state of being not legally enforceable or not creating an obligation.","zh":"Nonbindingness 指“不具约束力”的状态：不具有法律强制力或不构成必须履行的义务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not creating a legal duty or enforceable obligation","zh":"（法律/合同语境）“不具约束力”的性质；不产生法律义务或不可强制执行的状态"},"examples":[{"en":"The memorandum clearly states the nonbindingness of the parties’ intentions.","zh":"该备忘录明确说明双方意向不具约束力。"},{"en":"They included a clause confirming the nonbindingness of the draft terms until a final contract is signed.","zh":"他们加入条款确认：在最终合同签署前，草案条款不具约束力。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of not forcing someone to act in a certain way; lack of commitment or obligation (often in a more general, non-legal sense)","zh":"（更一般语境）不强制、不必履行的性质；缺乏承诺或义务感"},"examples":[{"en":"The nonbindingness of the schedule gives everyone flexibility.","zh":"日程安排的不具约束力让大家更灵活。"},{"en":"Some people like the nonbindingness of casual plans, while others prefer firm commitments.","zh":"有些人喜欢随意计划的不具约束力，另一些人则更偏好明确承诺。"}]}],"synonyms":["non-binding nature","lack of binding effect","unenforceability","nonobligation"],"phonetic":"/ˌnɑnˈbaɪndɪŋnəs/","extraExplanation":["“nonbindingness”来自形容词“nonbinding”（不具约束力的）+ 名词后缀“-ness”（……的性质/状态）。在商务与法律文本中更常见的写法往往是直接用“nonbinding”（如：a nonbinding agreement/offer），或用更常见的名词表达，如“non-binding nature”“lack of binding effect”。","常见场景：意向书（LOI）、谅解备忘录（MOU）、条款清单（term sheet）常会写明哪些条款“binding”（具约束力，如保密、排他性），哪些仅为“nonbinding”（仅表达意向）。"]}
{"word":"nonbinomial","summary":{"en":"Nonbinomial means “not binomial,” especially describing situations or data that don’t fit a two-outcome/binomial-distribution model.","zh":"nonbinomial 意为“非二项的”，常用于指不符合“只有两种结果/二项分布”假设的情况或数据。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not binomial; not involving only two categories, outcomes, or terms.","zh":"非二项的；不只涉及两个类别、结果或项的。"},"examples":[{"en":"A nonbinomial outcome has more than two possible results.","zh":"非二项的结果有两个以上的可能结果。"},{"en":"In some surveys, the response variable is nonbinomial because it has several choices, not just yes/no.","zh":"在一些调查中，响应变量是非二项的，因为它有多个选项，而不只是“是/否”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Statistics) Describing data or a model that does not follow a binomial distribution.","zh":"（统计）指数据或模型不服从二项分布的。"},"examples":[{"en":"If the trials are not independent, the counts may be nonbinomial.","zh":"如果试验彼此不独立，计数数据可能就不是二项分布（非二项的）。"},{"en":"The researcher used a method designed for nonbinomial count data.","zh":"研究者使用了适用于非二项计数数据的方法。"}]}],"synonyms":["not binomial","multicategory","multinomial (in some contexts)"],"phonetic":"/ˌnɑnbaɪˈnoʊmiəl/","extraExplanation":["“nonbinomial”多见于统计学与生物学写作中，用来强调问题不适合用“二项（binomial）”框架来建模：例如结果不止两类（多分类），或虽然只有两类但不满足二项分布的前提（如试验不独立、成功概率不恒定、存在过度离散等）。","词形结构很好记：non-（否定前缀）+ binomial（与“二项/二项式/二项分布”相关）。在数学里“binomial”也可指“二项式（如 a+b 的展开）”，因此在更偏数学的语境中，nonbinomial 也可能表示“不是二项式的”。"]}
{"word":"nonbiodegradable","summary":{"en":"Nonbiodegradable describes materials that do not naturally break down and can persist in the environment for a long time.","zh":"nonbiodegradable 指“不可生物降解的”，即无法被自然分解、会在环境中长期残留的材料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be broken down naturally by bacteria and other living organisms, so it stays in the environment for a long time.","zh":"（物质）不可生物降解的；不能被细菌等生物自然分解，因此会在环境中长期存在。"},"examples":[{"en":"Plastic bags are often nonbiodegradable and can pollute oceans for years.","zh":"塑料袋通常是不可生物降解的，可能会在海洋中污染多年。"},{"en":"The city is trying to reduce nonbiodegradable waste by promoting reusable containers.","zh":"这座城市正通过推广可重复使用的容器来减少不可生物降解的垃圾。"}]}],"synonyms":["not biodegradable","non-decomposable","persistent"],"phonetic":"/ˌnɑnˌbaɪoʊdɪˈɡreɪdəbəl/","extraExplanation":["“non-”是否定前缀，表示“不/非”；“biodegradable”来自“bio-（生命）+ degrade（分解）+ -able（能够…的）”。因此“nonbiodegradable”字面意思就是“不能被生命过程分解的”。","在环保语境中，它常与“biodegradable（可生物降解的）”“compostable（可堆肥的）”对比使用。注意：有些产品标注“biodegradable”并不代表在所有环境（如海水、低温）都能快速分解。"]}
{"word":"nonbiographical","summary":{"en":"“Nonbiographical” means not about a person’s life story.","zh":"“Nonbiographical”意为“非传记的；不关于某个人生平的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not biographical; not related to someone’s life story or personal history.","zh":"非传记的；不涉及某个人生平或个人经历的。"},"examples":[{"en":"The article is nonbiographical and focuses on the scientific discovery, not the scientist’s life.","zh":"这篇文章是非传记性的，重点在科学发现本身，而不是科学家的生平。"},{"en":"She prefers nonbiographical novels that explore ideas rather than the author’s personal experiences.","zh":"她更喜欢非传记性的小说，关注思想而非作者的个人经历。"}]}],"synonyms":["nonbiographic","impersonal","nonpersonal"],"phonetic":"/ˌnɑnˌbaɪəˈɡræfɪkəl/","extraExplanation":["这个词由前缀 non-（表示“非、不”）+ biographical（传记的）构成，常用于学术写作、书评、媒体分类等语境，强调内容“不是人物生平介绍”，而是聚焦主题、观点或事件本身。"]}
{"word":"nonbiographically","summary":{"en":"“Nonbiographically” means interpreting or discussing something without using a person’s life story as the main lens.","zh":"“nonbiographically”表示以非传记的视角来解读或讨论某事，不以某人的生平为主要依据。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not biographical; without focusing on a person’s life story or personal history.","zh":"以非传记的方式；不以某人的生平经历或个人历史为中心地。"},"examples":[{"en":"The critic reads the novel nonbiographically, focusing on its themes rather than the author’s life.","zh":"这位评论家以非传记的方式解读这部小说，关注主题而不是作者的生平。"},{"en":"We can interpret the poem nonbiographically and still appreciate its emotional power.","zh":"我们可以以非传记的方式解读这首诗，同时仍然欣赏它的情感力量。"},{"en":"Her paintings are discussed nonbiographically, as part of a broader artistic movement.","zh":"人们以非传记的方式讨论她的绘画，把它们视为更广泛艺术运动的一部分。"}]}],"synonyms":["without biographical focus","ahistorically (in some contexts)","text-centered (context-dependent)"],"phonetic":"/ˌnɑn.baɪ.əˈɡræf.ɪ.kli/","extraExplanation":["这个词比较少见，常出现在文学批评、艺术史或学术写作中，用来提醒读者：不要把作品的意义过度归结为作者/艺术家的生平（如“作者经历了什么，所以作品就一定在写什么”）。","构词法：non-（不、非）+ biographical（传记的）+ -ly（副词后缀）。常见搭配：read/interpret/analyze/discuss + nonbiographically。"]}
{"word":"nonbiological","summary":{"en":"Nonbiological means “not related to living things or biology.”","zh":"nonbiological 指“非生物的；不涉及生物学的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to living organisms or biological processes; not made of or derived from living things.","zh":"非生物的；与生命体或生物过程无关的；不是由生物产生或来源于生物的。"},"examples":[{"en":"Scientists compared biological and nonbiological factors that affect climate.","zh":"科学家比较了影响气候的生物因素和非生物因素。"},{"en":"The robot’s arm is a nonbiological part, unlike a human arm.","zh":"机器人的手臂是非生物的部件，不像人的手臂。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not involving biology as a field of study; outside biological explanations (often in academic writing).","zh":"（学术语境）不涉及生物学的；不属于生物学解释范围的。"},"examples":[{"en":"The paper focuses on nonbiological mechanisms of pain, such as stress and attention.","zh":"这篇论文关注疼痛的非生物学机制，例如压力与注意力。"},{"en":"They looked for nonbiological reasons for the decline, including policy changes.","zh":"他们寻找下降的非生物学原因，包括政策变化。"}]}],"synonyms":["abiotic","inorganic","nonliving"],"phonetic":"/ˌnɑnˌbaɪəˈlɑdʒɪkəl/","extraExplanation":["词形拆解：non- = “非、不”，biological = “生物的”。合起来就是“非生物的”。","常见搭配：nonbiological factors（非生物因素/非生物因子）、nonbiological material（非生物材料）、nonbiological parent（非生物学父母；如养父母，常用说法也有 adoptive parent）。","用法提示：在生态学里常与 abiotic（非生物的）互换，但 abiotic 更专业、更常见；nonbiological 更直观、通俗。"]}
{"word":"nonbiologically","summary":{"en":"Nonbiologically means “not in a biological way,” either in science (not involving living processes) or in family context (not related by birth/genetics).","zh":"nonbiologically 表示“非生物学地”，可指科学层面不涉及生命过程，也可指亲属层面并非血缘/出生关系。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not biological; not involving biology, living organisms, or biological processes.","zh":"以非生物学的方式；不涉及生物学、生命体或生物过程。"},"examples":[{"en":"Scientists can produce certain materials nonbiologically in the lab.","zh":"科学家可以在实验室里用非生物学的方法制造某些材料。"},{"en":"The substance may form nonbiologically through chemical reactions.","zh":"这种物质可能通过化学反应以非生物学方式形成。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not related by biology (for example, not genetically related or not connected through birth).","zh":"以非血缘/非出生关系的方式（例如并非遗传相关或并非通过出生形成的关系）。"},"examples":[{"en":"She is nonbiologically related to the child but has been a parent figure for years.","zh":"她与这个孩子没有血缘关系，但多年来一直扮演着父母的角色。"},{"en":"He helped raise his nonbiologically related siblings.","zh":"他帮助抚养与自己没有血缘关系的兄弟姐妹。"}]}],"synonyms":["not biologically","abiotically (science context)","chemically (often in lab/process context)"],"phonetic":"/ˌnɑnˌbaɪəˈlɑdʒɪkli/","extraExplanation":["“nonbiologically”= non-（不、非）+ biologically（生物学地）。在学术写作里更常见；日常口语中常用“not biologically”来表达。","在家庭/亲属语境中，英文里也常用“not biologically related”（没有血缘关系）来避免生硬或带评判色彩的说法。"]}
{"word":"nonbiting","summary":{"en":"Nonbiting means “not biting,” especially used to describe insects or animals that don’t bite people.","zh":"nonbiting 意为“不叮咬的、不咬人的”，常用来描述不会叮咬人的昆虫或动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not biting; not able or not likely to bite (often used for insects or animals).","zh":"不叮咬的；不咬人的（常用于昆虫或动物）。"},"examples":[{"en":"Dragonflies are nonbiting insects and are generally harmless to people.","zh":"蜻蜓是不叮咬人的昆虫，一般对人无害。"},{"en":"We chose a nonbiting pet breed because we have small children at home.","zh":"我们选择了一种不爱咬人的宠物品种，因为家里有小孩。"}]}],"synonyms":["harmless","not biting","non-aggressive"],"phonetic":"/ˌnɑnˈbaɪtɪŋ/","extraExplanation":["这个词常写作 non-biting（加连字符）作定语更常见：a non-biting mosquito species（不叮人的蚊子品种）。","在昆虫学里，\"nonbiting\" 常用来区分 \"biting\"（会叮咬吸血的，如某些蚊、蠓）与 \"nonbiting\"（不吸血、不叮人的，如一些摇蚊 nonbiting midges）。"]}
{"word":"nonbitter","summary":{"en":"Nonbitter means “not bitter,” used for taste, and sometimes for a calm, non-resentful attitude.","zh":"nonbitter 表示“不苦的”，多用于味道；也可比喻“没有怨气、不过分刻薄的态度”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having a bitter taste; mild or pleasant in flavor (often used for foods, drinks, or medicine).","zh":"不苦的；没有苦味的；味道较温和的（常用于食物、饮料或药）。"},"examples":[{"en":"This herbal tea is nonbitter, so you can drink it without adding sugar.","zh":"这款花草茶不苦，所以不用加糖也能喝。"},{"en":"Ask the pharmacist if there is a nonbitter version of this medicine for children.","zh":"可以问药剂师有没有适合儿童的“不苦”版本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Not resentful or harsh; not expressing bitterness in attitude or words.","zh":"（比喻）不怨恨的；不刻薄的；没有“苦涩情绪/怨气”的。"},"examples":[{"en":"Even after losing the job, she spoke in a nonbitter way about her old boss.","zh":"即使失业了，她谈到前老板时也没有怨气。"},{"en":"He wrote a nonbitter memoir that focused on what he learned.","zh":"他写的回忆录不苦涩，更强调自己学到的东西。"}]}],"synonyms":["not bitter","mild","smooth","less bitter","gentle"],"phonetic":"/ˌnɑnˈbɪtɚ/","extraExplanation":["“nonbitter”在实际写作中更常见的拼写是带连字符的 **non-bitter**，尤其是在产品描述里（如 *non-bitter beer* / *non-bitter taste*）。也常用更自然的说法：**not bitter**, **mild**, **smooth**, **less bitter**。"]}
{"word":"nonbituminous","summary":{"en":"“Nonbituminous” means “not containing bitumen,” often used in geology or to describe certain types of coal.","zh":"nonbituminous 指“不含沥青质的”，常用于地质或描述某些类型的煤。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing bitumen (a thick, sticky form of petroleum); not bituminous.","zh":"不含沥青质的；非沥青的。"},"examples":[{"en":"Nonbituminous coal generally has less tar-like material than bituminous coal.","zh":"非沥青煤通常比沥青煤含有更少的焦油状物质。"},{"en":"The report compares bituminous and nonbituminous deposits in the region.","zh":"该报告比较了该地区的沥青质矿床与非沥青质矿床。"}]}],"synonyms":["non-bituminous","nonasphaltic"],"phonetic":"/ˌnɑn bɪˈtu.mə.nəs/","extraExplanation":["“non-”是否定前缀，表示“不是/不……的”。“bituminous”来自“bitumen（沥青、沥青质）”，常见于地质、采矿、能源与材料科学语境。","在煤的分类中，日常最常见的对比是 bituminous coal（沥青煤）与 anthracite（无烟煤）/ lignite（褐煤）。有些资料会用“nonbituminous”来泛指“非沥青煤”（例如无烟煤、褐煤等），但具体范围可能因行业或文件而异。"]}
{"word":"nonblack","summary":{"en":"“Nonblack” means “not Black,” often used in social or policy contexts to contrast Black people with other groups.","zh":"“nonblack”意为“非黑人（的）”，常用于社会/政策语境中与“黑人”作对比。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not Black; referring to people, communities, or things that are not identified as Black.\nExamples: (1) Many nonblack voters supported the policy. / 许多非黑人选民支持这项政策。 (2) The scholarship is open to nonblack applicants as well. / 该奖学金也向非黑人申请者开放。","zh":"非黑人（的）；指不被认定为“黑人”的人群、社区或事物。\n例句：(1) 许多非黑人选民支持这项政策。 (2) 该奖学金也向非黑人申请者开放。"},"examples":[{"en":"Many nonblack voters supported the policy.","zh":"许多非黑人选民支持这项政策。"},{"en":"The scholarship is open to nonblack applicants as well.","zh":"该奖学金也向非黑人申请者开放。"}]}],"synonyms":["non-Black","not Black"],"phonetic":"/nɑnˈblæk/","extraExplanation":["“nonblack”多用于社会学、公共政策、新闻或学术语境，用来把“黑人（Black）”与“非黑人”作群体对比；在日常口语中不如“people who are not Black（不属于黑人群体的人）”常见。","因为涉及种族分类，这个词在不同国家/语境里可能带有敏感性或被认为过于二分法；写作时可根据需要选择更具体的说法（例如“non-Black Hispanic voters”“Asian and Latino communities”等），以避免把不同群体简单归为一类。","拼写上常见两种：nonblack 与 non-Black；是否加连字符/大写，通常取决于媒体风格指南与对“Black”作为身份称谓的尊重。"]}
{"word":"nonblamable","summary":{"en":"Nonblamable means “not deserving blame; not at fault.”","zh":"nonblamable 意为“不该被责备的；没有过错的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not deserving blame; not at fault; blameless.","zh":"不该被责备的；无过错的；无可指责的。"},"examples":[{"en":"The report concluded that the pilot was nonblamable because the instrument had failed.","zh":"报告结论认为飞行员不该被责备，因为仪表发生了故障。"},{"en":"If the accident was truly nonblamable, we should focus on fixing the system, not punishing people.","zh":"如果这起事故确实不该归咎于个人，我们就应把重点放在修复系统上，而不是惩罚人。"}]}],"synonyms":["blameless","not to blame","without fault","innocent"],"phonetic":"/ˌnɑnˈbleɪməbəl/","extraExplanation":["“nonblamable”较少见，更常见的拼写是“nonblameable”（英式拼写有时为“non-blameable”）。在日常英语里也常用“blameless”或“not to blame”来表达同样意思。","这个词常出现在法律、保险、事故调查等语境，用来表示当事人没有过失（no fault）。"]}
{"word":"nonblamableness","summary":{"en":"Nonblamableness means being not blameable—free from blame or responsibility.","zh":"nonblamableness 指“不应受责备/不该被怪罪”的状态或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not being blameable; the quality of being free from blame or responsibility for something wrong","zh":"不可责备；不应受责备的状态；（对错误或过失）不承担责难的性质"},"examples":[{"en":"He insisted on his nonblamableness in the accident because he followed every safety rule.","zh":"他坚持认为这起事故中自己不应受责备，因为他遵守了所有安全规定。"},{"en":"The report tried to show the company’s nonblamableness, but the evidence was mixed.","zh":"这份报告试图证明公司不应受责备，但证据并不充分。"}]}],"synonyms":["blamelessness","innocence","lack of fault","freedom from blame","not to blame"],"phonetic":"/ˌnɑnˈbleɪməbəlnəs/","extraExplanation":["这个词非常少见，更多见、更自然的表达是 blamelessness（“无可责备/清白”）或 not to blame（“不该被怪罪”）。","构词法：non-（否定前缀）+ blameable（“可责备的”）+ -ness（名词后缀，表示“……的状态/性质”）。因为 blameable 本身就不常用，所以 nonblamableness 更显生硬，多出现在较学术或辩护语境中。"]}
{"word":"nonblamably","summary":{"en":"“Nonblamably” means “in a way that is not blameworthy; without deserving blame.”","zh":"“nonblamably”意思是“以不该被责备的方式；无可指责地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not blameworthy; without deserving blame.","zh":"以不该被责备的方式；无可指责地。"},"examples":[{"en":"She acted nonblamably, following the rules exactly as they were written.","zh":"她的行为无可指责，完全照章办事。"},{"en":"The error happened nonblamably because the instructions were unclear.","zh":"由于说明不清，这个错误并非任何人该被责备地发生了。"}]}],"synonyms":["blamelessly","innocently","without fault","irreproachably"],"phonetic":"/ˌnɑnˈbleɪməbli/","extraExplanation":["“nonblamably”非常少见，很多写作中更常用“blamelessly”（无可指责地）或“without blame”（不应受责备地）。","构词：non-（不）+ blame（责备）+ -able（可……的）→ nonblamable（不该被责备的）+ -ly（副词）→ nonblamably（以不该被责备的方式）。","使用场景多见于较正式或法律/道德讨论语境，用来强调“没有过错或不应承担责任”。"]}
{"word":"nonblameful","summary":{"en":"“Nonblameful” means not blaming anyone or avoiding blame in how you speak or write.","zh":"“nonblameful”指“不责怪人的；表达时避免指责归咎”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not blaming anyone; expressed in a way that avoids saying someone is at fault.","zh":"不责怪人的；以避免指责他人过错的方式表达的。"},"examples":[{"en":"She gave a nonblameful explanation of the mistake so the team could focus on fixing it.","zh":"她用不责怪人的方式解释了这个错误，让团队把注意力放在解决问题上。"},{"en":"Try to use nonblameful language, like “What happened?” instead of “Who did this?”","zh":"尽量用不指责的措辞，比如说“发生了什么？”而不是“是谁干的？”"}]}],"synonyms":["nonaccusatory","nonjudgmental","blameless","unaccusing"],"phonetic":"/ˌnɑnˈbleɪmfəl/","extraExplanation":["“non-”是否定前缀，表示“非……/不……”，加在“blameful（该受责备的/带有责备意味的）”前面就形成“nonblameful”。在工作沟通、冲突管理里常用来强调“关注问题而不是责怪人”，也常与“nonjudgmental（不评判的）”“constructive（建设性的）”一起出现。"]}
{"word":"nonblamefully","summary":{"en":"“Nonblamefully” means “without blaming anyone; in a non-blaming manner.”","zh":"“nonblamefully”表示“以不责怪任何人的方式；不归咎于他人”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not blame anyone; without assigning fault.","zh":"以不责怪任何人的方式；不归咎于他人。"},"examples":[{"en":"Let’s talk about what happened nonblamefully and focus on solutions.","zh":"我们用不责备的方式谈谈发生了什么，重点放在解决方案上。"},{"en":"She responded nonblamefully, even though she was frustrated.","zh":"尽管她很沮丧，她的回应仍然不带责怪。"},{"en":"The manager asked the team to review the mistake nonblamefully.","zh":"经理要求团队以不归咎个人的方式复盘这次错误。"}]}],"synonyms":["without blame","in a non-blaming way","impartially","neutrally","objectively"],"phonetic":"/ˌnɑnˈbleɪmfəli/","extraExplanation":["“nonblamefully”较少见，更常用的表达有：“without blame / without blaming anyone / in a non-blaming way”。","构词法：non-（不/非）+ blame（责怪）+ -ful（充满……的）+ -ly（副词），整体强调沟通时“就事论事、避免指责”，常见于职场复盘、心理咨询、冲突调解等语境。"]}
{"word":"nonblamefulness","summary":{"en":"Nonblamefulness means not blaming others and focusing on understanding and solutions.","zh":"nonblamefulness 指不责备、不归咎他人，更强调理解情况与解决问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not blaming others; a calm, non-judgmental attitude that avoids assigning fault","zh":"不责备；不归咎他人的态度（不急于指责、评判或追究谁的错）"},"examples":[{"en":"In our team meetings, we try to practice nonblamefulness and focus on solutions.","zh":"在团队会议里，我们尽量保持不责备，把重点放在解决方案上。"},{"en":"Nonblamefulness can help people talk honestly about mistakes without fear.","zh":"不责备的氛围能帮助人们更坦诚地谈论错误，而不必害怕被追究。"},{"en":"She responded with nonblamefulness, asking what happened instead of who was at fault.","zh":"她以不责备的方式回应，先问发生了什么，而不是追问谁的责任。"}]}],"synonyms":["nonblaming attitude","lack of blame","nonjudgmentalness","forbearance"],"phonetic":"/ˌnɑnˈbleɪmfəlnəs/","extraExplanation":["这个词在日常口语里不算常见，更常见的表达是 nonblaming attitude（不责备的态度）、not blaming others（不责备别人）。","在心理咨询、冲突管理、以及“无责文化（blameless culture / blameless postmortem）”等语境里，你可能会看到类似的概念：强调从事件中学习、改进流程，而不是把焦点放在追究个人责任上。"]}
{"word":"nonblameless","summary":{"en":"Nonblameless means “not entirely innocent; partly at fault.”","zh":"nonblameless 指“并非完全无辜；有一定过错/责任”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not blameless; having some fault or responsibility for a mistake or wrongdoing.","zh":"并非无过失的；有一定过错或应负部分责任的。"},"examples":[{"en":"The report shows the company was nonblameless in the data leak.","zh":"报告显示这家公司在数据泄露事件中并非毫无责任。"},{"en":"Even if he didn’t start the argument, he was nonblameless because he kept insulting others.","zh":"即使争吵不是他挑起的，他也并非无过，因为他一直在侮辱别人。"}]}],"synonyms":["not blameless","partly to blame","culpable","at fault","not entirely innocent"],"phonetic":"/ˌnɑnˈbleɪmləs/","extraExplanation":["“nonblameless”由前缀 non-（表示“非、不”）+ blameless（无可指责的）构成，意思是“不是无可指责的”。在现代英语中比较少见，更常用的表达包括 “not blameless”“not entirely blameless”“partly to blame” 等，语气也更自然。","这个词常出现在较正式或强调逻辑对比的语境里，用来表示“并非完全无辜/并非完全没有责任”，比直接说 “guilty（有罪）” 更委婉，强调“有部分责任”。"]}
{"word":"nonblank","summary":{"en":"Nonblank means “not blank”—it has some content, especially in forms or computing.","zh":"nonblank 表示“非空白的”，指有内容，常见于表格或计算机语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not blank; containing some text, data, or marks (often used in forms, documents, and computing).","zh":"非空的；不是空白的；有文字/数据/内容的（常用于表格、文件与计算机语境）。"},"examples":[{"en":"Please make sure the required fields are nonblank before you submit the form.","zh":"提交表格前，请确保必填项都不是空白的。"},{"en":"The system rejects passwords that are blank or nonblank but too short.","zh":"系统会拒绝空密码，以及虽非空但过短的密码。"}]}],"synonyms":["not blank","not empty","filled in","completed"],"phonetic":"/ˌnɑnˈblæŋk/","extraExplanation":["“nonblank”在日常口语里不如“not blank / not empty”常见，但在技术文档、编程、表单校验中很常用，用来强调“字段里必须有内容”。","在计算机语境中，“nonblank”有时与“non-empty”区分：nonblank 通常表示不只是有字符，还不能全是空格（例如只输入空格仍可能被视为 blank）。具体以系统规则为准。"]}
{"word":"nonblasphemies","summary":{"en":"Nonblasphemies means non-blasphemous statements or acts—things that are not blasphemy.","zh":"nonblasphemies 指“非亵渎的言行”，即不构成亵渎的内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things (statements, actions, or writings) that are not blasphemies; non-blasphemous remarks or acts","zh":"非亵渎之言或行为；不是亵渎神明/信仰的说法或举动"},"examples":[{"en":"The editor removed the offensive lines, leaving only nonblasphemies in the final draft.","zh":"编辑删掉了冒犯性的句子，最终稿里只保留了不亵渎的内容。"},{"en":"In a sensitive discussion about religion, she chose careful nonblasphemies to avoid insulting anyone.","zh":"在一场关于宗教的敏感讨论中，她选择谨慎、非亵渎性的措辞，以免冒犯任何人。"}]}],"synonyms":["non-blasphemous remarks","respectful language","inoffensive statements"],"phonetic":"/ˌnɑnˈblæsfəmiz/","extraExplanation":["这个词很少见，通常是临时造词（nonce word），由前缀 non-（“非、不是”）+ blasphemies（“亵渎言行”的复数）组成。","更自然、常用的表达是：non-blasphemous statements/remarks（非亵渎性的言论）、not blasphemy（不算亵渎）、respectful language（尊重的措辞）。"]}
{"word":"nonblasphemous","summary":{"en":"“Nonblasphemous” means not blasphemous—showing no disrespect toward religion or sacred things.","zh":"“nonblasphemous”表示“不亵渎的”，即不对宗教或神圣事物表示不敬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not blasphemous; not showing disrespect toward God, sacred things, or religious beliefs.","zh":"不亵渎的；不冒犯宗教或神圣事物的。"},"examples":[{"en":"He tried to make a nonblasphemous joke that everyone could enjoy.","zh":"他尽量讲一个不亵渎、大家都能接受的玩笑。"},{"en":"The editor removed lines that might be seen as blasphemous and kept the nonblasphemous parts.","zh":"编辑删掉了可能被视为亵渎的句子，保留了不亵渎的部分。"}]}],"synonyms":["respectful","reverent","non-offensive","inoffensive"],"phonetic":"/ˌnɑnˈblæsfəməs/","extraExplanation":["“blasphemous/亵渎的”通常用于宗教语境，指对上帝、先知、经典或神圣符号的不敬言行。不同文化、宗教与地区对“是否亵渎”的界限差异很大；在跨文化交流或公共场合，选择更中性、非冒犯（nonblasphemous）的表达往往更稳妥。","构词法：non-（否定前缀）+ blasphemous（亵渎的）。该词较少见，日常更常用的表达是 “not blasphemous” 或 “respectful / non-offensive”。"]}
{"word":"nonblasphemously","summary":{"en":"“Nonblasphemously” means “in a respectful, non-blasphemous way,” especially about religion or sacred things.","zh":"nonblasphemously 意为“以不亵渎、较为尊重的方式（尤指谈论宗教或神圣事物）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not disrespectful to God, sacred things, or religious beliefs; reverently.","zh":"以不亵渎（神、神圣事物或宗教信仰）的方式；恭敬地、敬虔地。"},"examples":[{"en":"He spoke about the ceremony nonblasphemously, choosing respectful words.","zh":"他谈到这场仪式时没有亵渎，刻意选择了尊重的措辞。"},{"en":"The comedian tried to joke about religion nonblasphemously, focusing on everyday life instead.","zh":"那位喜剧演员尽量用不亵渎的方式谈宗教，把重点放在日常生活上。"}]}],"synonyms":["respectfully","reverently","devoutly","piously"],"phonetic":"/ˌnɑnˌblæsˈfiːməsli/","extraExplanation":["这个词由 non-（“不、非”）+ blasphemous（“亵渎的”）+ -ly（副词后缀）构成，意思直观，但在日常英语里相对少见。很多时候更常用的表达是 respectfully（尊重地）、reverently（虔敬地）、without blasphemy（不带亵渎地）。","blasphemy（亵渎）在不同文化与宗教语境中敏感度差异很大；在写作或公开发言时，用 nonblasphemously 往往是在强调“我会避免冒犯宗教信仰”。"]}
{"word":"nonblasphemousness","summary":{"en":"Nonblasphemousness means the quality of being not blasphemous—showing respect and not insulting religion or sacred things.","zh":"nonblasphemousness 指“不亵渎”的性质/状态，即尊重宗教或神圣事物、不加以冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being blasphemous; the state of showing respect and not insulting God, religion, or sacred things","zh":"不亵渎（神圣事物）的性质；不冒犯上帝、宗教或神圣事物的状态"},"examples":[{"en":"The editor checked the poem for nonblasphemousness before publishing it in the magazine.","zh":"编辑在把这首诗刊登到杂志之前，先检查它是否保持“不亵渎性”。"},{"en":"In a diverse classroom, students tried to speak with nonblasphemousness when discussing religion.","zh":"在多元化的课堂里，学生讨论宗教时尽量用不亵渎、尊重的方式表达。"}]}],"synonyms":["respectfulness (in religious context)","reverence","religious sensitivity","non-offensiveness"],"phonetic":"/ˌnɑnˈblæsfəməsnəs/","extraExplanation":["这是一个很少见、很“书面”的名词，常用于正式讨论（如出版审查、法律/伦理、宗教礼仪）中。日常英语里更常说：“not blasphemous”、“respectful,” 或 “non-offensive (to religion)”。","构词：non-（不、非）+ blasphemous（亵渎的）+ -ness（名词后缀，表示“……的性质/状态”）。因此它强调“是否带有亵渎性”这一抽象特质。","语境提醒：在不同文化与宗教背景中，“blasphemous（亵渎的）”的界定可能差异很大；表达时常用更中性的词（如 “respectful”）以避免误解。"]}
{"word":"nonblasphemy","summary":{"en":"Nonblasphemy means the absence of blasphemy—language or actions that are not disrespectful to sacred religious beliefs.","zh":"nonblasphemy 指“不亵渎”，即言行不对宗教信仰或神圣事物构成冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of blasphemy; speech or writing that is not insulting to God, sacred things, or religious beliefs","zh":"不亵渎；不冒犯神明、宗教圣物或宗教信仰的言论/文字（即“不是亵渎”的表达）"},"examples":[{"en":"The editor asked for nonblasphemy in the article so it wouldn’t offend religious readers.","zh":"编辑要求文章保持不亵渎，以免冒犯有宗教信仰的读者。"},{"en":"He chose careful, nonblasphemy language when discussing sacred traditions.","zh":"谈到神圣传统时，他选择了谨慎、不过度冒犯的措辞。"}]}],"synonyms":["non-blasphemy","not blasphemy","non-blasphemous language"],"phonetic":"/ˌnɑnˈblæsfəmi/","extraExplanation":["“nonblasphemy”不是非常常见的标准词，更常见的写法是加连字符的 **non-blasphemy**，或直接说 **not blasphemy / non-blasphemous**。","前缀 **non-** 表示“非……、不……”。这里强调的是“没有亵渎性质”，不一定等同于“虔诚”（piety）或“敬畏”（reverence），只是说明“并不构成亵渎”。","在公共写作、媒体审核、宗教与言论讨论中，可能会用到类似表达来强调“避免冒犯宗教”的语气。"]}
{"word":"nonbleach","summary":{"en":"“Nonbleach” means bleach-free or intended for use without bleach, often describing cleaners or detergents.","zh":"nonbleach 指“不含漂白剂的”或“（标明）不使用漂白剂的”，常用于清洁剂或洗涤用品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not containing bleach; made or labeled to be used without bleach.","zh":"不含漂白剂的；标明为不使用漂白剂（的）。"},"examples":[{"en":"Use a nonbleach cleaner on colored fabrics to avoid fading.","zh":"在彩色织物上用不含漂白剂的清洁剂，以免褪色。"},{"en":"The label says “nonbleach formula,” so it’s gentler on most surfaces.","zh":"标签写着“非漂白配方”，所以对大多数表面更温和。"}]},{"partOfSpeech":"n.","definition":{"en":"a cleaning or laundry product that does not include bleach (often written as “non-bleach”).","zh":"不含漂白剂的清洁/洗衣产品（常写作 non-bleach）。"},"examples":[{"en":"I bought a nonbleach detergent for baby clothes.","zh":"我买了不含漂白剂的洗衣液来洗婴儿衣物。"},{"en":"Try a nonbleach stain remover first, then move to stronger products if needed.","zh":"先试试不含漂白剂的去渍剂，有需要再换更强的产品。"}]}],"synonyms":["bleach-free","non-chlorine (when referring to chlorine bleach)","without bleach"],"phonetic":"/ˌnɑnˈblitʃ/","extraExplanation":["“non-” 是英语里常见的否定前缀，表示“非……/不……”。所以 nonbleach 字面意思就是“非漂白（不含漂白剂）”。","在包装或说明书里更常见的写法是带连字符的 “non-bleach”。不同品牌也可能用 “bleach-free（无漂白剂）” 来表达同样意思。"]}
{"word":"nonbleeding","summary":{"en":"Nonbleeding describes something that does not bleed—either a wound that isn’t bleeding or ink/paper that doesn’t run or soak through.","zh":"nonbleeding 指“不出血的”，也可指墨水/纸张“不渗色、不洇开、不透印的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bleeding; not producing or showing bleeding.","zh":"不出血的；不流血的。"},"examples":[{"en":"The doctor said the wound looked clean and nonbleeding.","zh":"医生说伤口看起来很干净，没有出血。"},{"en":"Apply gentle pressure if the cut is bleeding; if it’s nonbleeding, a small bandage may be enough.","zh":"如果伤口在流血就轻轻按压止血；如果不出血，贴个小创可贴可能就够了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of ink, markers, or paper) Not spreading through or running into other areas; not smudging or “bleeding” through the page.","zh":"（指墨水、记号笔或纸张）不渗色的；不洇开的；不透印的。"},"examples":[{"en":"Use a nonbleeding marker for signing important documents.","zh":"签重要文件时用不渗色的记号笔。"},{"en":"This notebook has thick, nonbleeding paper, so you can write on both sides.","zh":"这本笔记本纸张很厚不透印，所以两面都能写。"},{"en":"The artist prefers nonbleeding ink to keep the lines sharp.","zh":"这位画家更喜欢不洇开的墨水，这样线条更清晰。"}]}],"synonyms":["bloodless","not bleeding","smudge-proof","non-smearing","non-running"],"phonetic":"/ˌnɑnˈblidɪŋ/","extraExplanation":["“bleed”在英语里除了“流血”，还常用于描述颜色/墨水“渗开、洇开、透到背面”。因此nonbleeding在文具、印刷、纸张评测里非常常见。","拼写上更常见的是加连字符的形式：non-bleeding（尤其在产品说明或广告文案中）。"]}
{"word":"nonblended","summary":{"en":"Nonblended means not mixed or combined; often used to describe instruction that is not a blend of online and in-person learning.","zh":"nonblended 指“未混合、未结合的”；常用于教育语境，表示不采用线上与线下结合的教学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not blended; kept separate or not mixed together","zh":"非混合的；未混合的；保持分开的"},"examples":[{"en":"Serve the dressing on the side so the flavors stay nonblended.","zh":"把沙拉酱另外放，这样味道就能保持非混合的。"},{"en":"The teacher provided nonblended instruction, with all lessons taught fully in person.","zh":"老师采用非混合式教学，所有课程都完全线下进行。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in education) not using a mix of online and face-to-face learning","zh":"（教育）非混合式的；不采用线上与线下相结合的教学"},"examples":[{"en":"During the exam period, the school required a nonblended schedule.","zh":"考试期间，学校要求采用非混合式的安排。"},{"en":"Parents asked for a nonblended option because their child learns better in a single format.","zh":"家长要求提供非混合式选项，因为孩子在单一形式下学得更好。"}]}],"synonyms":["unmixed","separate","uncombined","not blended","non-hybrid"],"phonetic":"/ˌnɑnˈblɛndɪd/","extraExplanation":["“nonblended”通常由前缀 non-（表示“非、不”）+ blended（混合的）构成，多见于教育领域，与“blended learning（混合式学习）”相对。日常写作中也常用更常见的表达，如 “not blended / unmixed / separate”。"]}
{"word":"nonblending","summary":{"en":"Nonblending means not mixing smoothly or, in phonics, not combining sounds into a word.","zh":"Nonblending 指“不混合/不融合”，也可指自然拼读里“不把音合成成词”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not mixing or merging smoothly with something else; keeping parts separate instead of forming a uniform whole.","zh":"不混合的；不融合的；不会平滑地与其他事物混在一起（而是保持分离）。"},"examples":[{"en":"The oil-and-water look created a nonblending layer on top.","zh":"油水分离的效果在表面形成了一层不混合的薄层。"},{"en":"The designer chose nonblending colors to make the shapes look sharper.","zh":"设计师选择了不融合的颜色，让形状看起来更利落。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Education/phonics) Not combining individual sounds into a single spoken word (not blending).","zh":"（教育/自然拼读）不进行“拼读合成”；不把单个音合并读成一个词。"},"examples":[{"en":"Some early readers rely on nonblending strategies, saying each sound separately.","zh":"一些初学阅读的孩子会用不合成的方式，把每个音分开读。"},{"en":"The teacher practiced blending, because nonblending can slow down reading.","zh":"老师练习音素合成，因为不合成会让阅读速度变慢。"}]}],"synonyms":["nonmixing","nonmerging","separate","unblended"],"phonetic":"/ˌnɑnˈblɛndɪŋ/","extraExplanation":["“nonblending”多见于技术或说明性语境（如材料、化学、设计、印刷），日常口语里更常说“doesn’t blend (well)”或“doesn’t mix”。","拼写上也常见连字符形式“non-blending”，意思相同；是否加连字符通常取决于写作风格或是否放在名词前作定语（如“non-blending formula”）。"]}
{"word":"nonblinding","summary":{"en":"Nonblinding means a study is not blinded—people know which treatment is given.","zh":"nonblinding 指研究不是盲法的——参与者或研究人员知道给予了哪种治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a study or procedure) not blinded; the people involved know which treatment or condition is being given.","zh":"（指研究或程序）非盲法的；参与者或研究人员知道正在接受哪种治疗或条件。"},"examples":[{"en":"It was a nonblinding trial, so patients knew whether they received the new drug or the placebo.","zh":"这是一项非盲法试验，因此患者知道自己拿到的是新药还是安慰剂。"},{"en":"Because the design was nonblinding, the researchers used objective outcomes to reduce bias.","zh":"由于研究设计是非盲法的，研究人员采用客观结局指标来减少偏倚。"}]}],"synonyms":["open-label","not blinded","unblinded"],"phonetic":"/ˌnɑnˈblaɪndɪŋ/","extraExplanation":["在医学研究里，blinding（盲法）是为了减少“观察者偏倚”和“安慰剂效应”等影响。nonblinding 常见于 open-label（开放标签）研究，或某些无法实施盲法的情境（例如手术方式不同、治疗设备差异明显）。","写作中也常用 not blinded / open-label 来表达同一概念；nonblinding 更像是技术性用语，常见于方法学描述（methods）或偏倚评估（risk of bias）讨论。"]}
{"word":"nonblindingly","summary":{"en":"Nonblindingly means “not in a blinding way,” and can also mean “not overwhelmingly obvious or intense.”","zh":"nonblindingly 表示“（光线）不刺眼地”，也可引申为“并非强烈到压倒性的、不过分显眼地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not blinding; without causing strong glare or making it hard to see","zh":"以不刺眼的方式；不造成强烈眩光、让人看不清的程度"},"examples":[{"en":"The hallway was nonblindingly bright, so we didn’t need sunglasses indoors.","zh":"走廊亮度不刺眼，所以在室内不需要戴太阳镜。"},{"en":"Use a lamp that lights your desk nonblindingly, especially at night.","zh":"尤其在晚上，选一盏能让桌面明亮但不刺眼的台灯。"}]},{"partOfSpeech":"adv.","definition":{"en":"(figurative) in a way that is not overwhelmingly obvious or intense; moderately","zh":"（引申）不至于强烈到压倒性的；不那么显眼/不过分地；适度地"},"examples":[{"en":"The solution is nonblindingly simple once someone explains it.","zh":"一旦有人解释，这个解决办法就会显得并非“简单到耀眼”，而是挺容易懂的。"},{"en":"The evidence is nonblindingly clear—enough to act on, but not perfect.","zh":"证据并非“清晰到耀眼”，但足以采取行动，只是不算完美。"}]}],"synonyms":["without glare","not too brightly","not glaringly","moderately","not overwhelmingly"],"phonetic":"/ˌnɑnˈblaɪndɪŋli/","extraExplanation":["这是由前缀 non-（“不、非”）+ blindingly（“刺眼地；（引申）显而易见地”）构成的副词，属于比较少见、偏口语/写作中带一点幽默感或强调的表达。常见替换：literally 场景可用 “not too bright / without glare”，引申义可用 “not overwhelmingly / not glaringly / fairly”。"]}
{"word":"nonblockaded","summary":{"en":"“Nonblockaded” means not under a blockade—access and movement are not being cut off.","zh":"“Nonblockaded”指“未被封锁的”，即进出与通行未被切断或限制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not blockaded; not prevented from entering or leaving a place by a blockade (often in military, naval, or political contexts).","zh":"未被封锁的；没有受到（军事、海上或政治）封锁、因此进出不受阻的。"},"examples":[{"en":"The port remained nonblockaded, so ships could still deliver food and medicine.","zh":"港口没有被封锁，所以船只仍能运送食物和药品。"},{"en":"They chose a nonblockaded route to avoid delays and inspections.","zh":"他们选择了一条未被封锁的路线，以避免延误和检查。"}]}],"synonyms":["not blockaded","unblockaded","open","unrestricted"],"phonetic":"/ˌnɑnˈblɑkeɪdɪd/","extraExplanation":["“nonblockaded”由前缀 non-（不、非）+ blockaded（被封锁的）构成，常见于新闻报道、历史书写或军事/国际关系语境。日常口语里更常用表达是 “not blockaded” 或 “not under blockade”。","blockade（封锁）在历史上常与海上封锁相关，例如战争时期用舰队阻止船只进出港口；现代也可指对陆路、空域或某地区的经济/物资封锁。"]}
{"word":"nonblocking","summary":{"en":"Nonblocking means not causing a stop or delay; in computing, it means an operation returns immediately so a program can keep running.","zh":"nonblocking 指“不阻塞、不造成延迟”；在计算机领域指“操作立即返回，程序无需等待即可继续运行”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not stopping or delaying something; able to continue without being held up.","zh":"不阻塞的；不造成阻碍或延迟的；可以继续进行而不被卡住的。"},"examples":[{"en":"A nonblocking intersection keeps traffic moving more smoothly.","zh":"不阻塞的路口能让交通更顺畅地流动。"},{"en":"The doorway design is nonblocking, so people can enter quickly.","zh":"这个门口的设计不造成阻碍，所以人们可以快速进入。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing) Designed so a program can keep running instead of waiting for an operation (like input/output) to finish.","zh":"（计算机）非阻塞的：程序不必等待某个操作（如输入/输出）完成，而是可以继续运行。"},"examples":[{"en":"We used nonblocking I/O so the app stays responsive while loading data.","zh":"我们使用非阻塞 I/O，让应用在加载数据时仍然保持响应。"},{"en":"Nonblocking calls let the server handle many users at the same time.","zh":"非阻塞调用让服务器可以同时处理许多用户。"},{"en":"The function returns immediately in a nonblocking mode.","zh":"在非阻塞模式下，这个函数会立刻返回。"}]}],"synonyms":["unobstructive","unimpeded","asynchronous","non-blocking"],"phonetic":"/ˌnɑnˈblɑkɪŋ/","extraExplanation":["“nonblocking”常见于技术语境，尤其是编程与网络（如 nonblocking I/O, nonblocking socket）。日常写作中也可指“不会挡路/不妨碍通行”的设计或安排。","拼写上既可写作 nonblocking，也常见连字符形式 non-blocking（尤其在正式技术文档中）。两者含义相同。"]}
{"word":"nonblooded","summary":{"en":"Nonblooded means not related by blood (and, more rarely, not of a pure/noble bloodline).","zh":"nonblooded 指“非血缘关系的”；更少见时也指“非纯血/非贵族血统的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not related by blood; not a biological relative","zh":"非血缘的；不是亲生/血亲关系的"},"examples":[{"en":"After the adoption, she had both blooded and nonblooded relatives in her family tree.","zh":"收养之后，她的家谱里既有血亲，也有非血缘的亲属。"},{"en":"He was raised by a nonblooded guardian who cared for him like a parent.","zh":"他由一位非血缘的监护人抚养长大，对方像父母一样照顾他。"}]},{"partOfSpeech":"adj.","definition":{"en":"not belonging to a “pure” or noble bloodline (rare, often in historical or fantasy writing)","zh":"（罕见，常见于历史/奇幻语境）非纯血的；非贵族血统的"},"examples":[{"en":"In the novel, nonblooded families were kept out of the royal court.","zh":"在小说里，非纯血的家族被排除在王室宫廷之外。"},{"en":"The old law treated nonblooded heirs differently.","zh":"旧法对非纯血继承人的待遇不同。"}]}],"synonyms":["non-biological","unrelated","adoptive","step- (as in stepfamily)","not related by blood"],"phonetic":"/ˌnɑnˈblʌdɪd/","extraExplanation":["“nonblooded”更常见的写法是带连字符的“non-blood(ed)”，也有人用更自然的表达如“non-biological”或“not related by blood”。在正式写作里，为避免歧义，通常建议用“non-biological relative/parent”或“not related by blood”。"]}
{"word":"nonblooming","summary":{"en":"Nonblooming means not producing flowers, and it can also describe something that isn’t developing or thriving (figuratively).","zh":"nonblooming 指“不（开）花的”，也可比喻“没有发展、没有起色/没有开花结果的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not blooming; not producing flowers (often used for plants that do not flower in a given season or at all)","zh":"不（开）花的；不（正在）开花的（常用于植物在某一季节不开花或完全不结果开花）"},"examples":[{"en":"This nonblooming shrub still adds nice green color to the garden.","zh":"这株不开花的灌木仍然能为花园增添漂亮的绿色。"},{"en":"The plant looks healthy, but it has been nonblooming for months.","zh":"这株植物看起来很健康，但它已经好几个月不开花了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) not developing or flourishing; failing to show expected results","zh":"（比喻）不发展、不兴盛的；没有达到预期成果的"},"examples":[{"en":"Their nonblooming friendship needed time and honest conversation to grow.","zh":"他们那段“没有开花结果”的友谊需要时间和坦诚的交流才能成长。"},{"en":"The project remained nonblooming despite a strong start.","zh":"尽管开头不错，这个项目最终还是没有真正发展起来。"}]}],"synonyms":["not flowering","flowerless","unflowering","unproductive (figurative)","stagnant (figurative)"],"phonetic":"/ˌnɑnˈbluːmɪŋ/","extraExplanation":["在园艺语境里，nonblooming 常用来描述“观叶植物”（主要看叶子而不是花）或某株植物因为光照、施肥、修剪、温度等原因在某段时间不开花。写作中也会借用“bloom（开花）”来表达“发展、成熟、成功”，因此 nonblooming 可用于比喻关系、计划或事业“没有开花结果”。"]}
{"word":"nonblundering","summary":{"en":"Nonblundering means careful and accurate, without making obvious mistakes.","zh":"nonblundering 指“谨慎准确、不犯明显错误的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not making mistakes or clumsy errors; careful and accurate","zh":"不犯粗心错误的；谨慎而准确的"},"examples":[{"en":"She gave a nonblundering answer even under pressure.","zh":"即使在压力下，她的回答也没有出错。"},{"en":"We need a nonblundering plan before we present it to the client.","zh":"在向客户展示之前，我们需要一个不出错的方案。"}]}],"synonyms":["careful","accurate","error-free","mistake-free","reliable"],"phonetic":"/ˌnɑnˈblʌndərɪŋ/","extraExplanation":["“nonblundering”较少见，常见替代表达有“careful / error-free / mistake-free / accurate”。","构词上是前缀“non-（不、非）”+“blunder（犯大错、出洋相）”+“-ing（形容词化，表示具有某种特征）”，整体强调“不会犯明显的愚蠢错误”。"]}
{"word":"nonblunderingly","summary":{"en":"“Nonblunderingly” means “without making blunders; without careless mistakes.”","zh":"nonblunderingly 意为“（做事）不出差错地；不犯粗心错误地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not blunder; without making careless mistakes.","zh":"不犯（粗心）错误地；不失手地。"},"examples":[{"en":"She answered the interviewer’s questions nonblunderingly, even under pressure.","zh":"即使在压力下，她也不犯错地回答了面试官的问题。"},{"en":"The pilot followed the checklist nonblunderingly, step by step.","zh":"飞行员一步一步地不出差错地执行检查清单。"}]}],"synonyms":["flawlessly","without error","carefully","accurately","competently"],"phonetic":"/ˌnɑnˈblʌndərɪŋli/","extraExplanation":["这个词非常少见，多见于较正式或带一点“夸张/强调”的写法。更自然常用的表达通常是：without making a mistake、flawlessly、without error、carefully。","构词上是 non-（否定“非/不”）+ blunder（犯大错、出洋相）+ -ing + -ly（副词后缀），强调“没有犯那种明显的、笨拙的错误”。"]}
{"word":"nonboaster","summary":{"en":"A nonboaster is someone who doesn’t brag and stays modest.","zh":"nonboaster 指不吹嘘、很谦逊的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not boast; someone who is modest and does not brag about their achievements","zh":"不爱吹嘘的人；谦逊、不夸耀自己的人"},"examples":[{"en":"Even after winning the award, she stayed a nonboaster and thanked her whole team.","zh":"即使获奖后，她依然很不爱吹嘘，感谢了整个团队。"},{"en":"He’s a nonboaster—he lets his work speak for itself.","zh":"他是不爱吹嘘的人——让成果替自己说话。"}]}],"synonyms":["modest person","humble person","unassuming person","not a braggart"],"phonetic":"ˌnɑnˈboʊstɚ","extraExplanation":["“non-”是英语里常见的否定前缀，表示“非、没有、不”。“nonboaster”可理解为“not a boaster（不是爱吹嘘的人）”。这个词不算常用，日常更常见的说法是“a modest person / someone who doesn’t brag”。"]}
{"word":"nonboasting","summary":{"en":"“Nonboasting” means modest and not self-praising.","zh":"“nonboasting”表示谦虚、不自夸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not boasting; modest and not self-praising.","zh":"不自夸的；谦虚的；不炫耀的。"},"examples":[{"en":"She talked about her achievements in a calm, nonboasting way.","zh":"她用平静、不自夸的方式谈起自己的成就。"},{"en":"His nonboasting attitude made him easy to trust.","zh":"他不自夸的态度让人很容易信任他。"},{"en":"The article uses a nonboasting tone, focusing on facts instead of praise.","zh":"这篇文章语气不炫耀，专注于事实而不是自我表扬。"}]}],"synonyms":["modest","humble","unassuming","unboastful"],"phonetic":"/ˌnɑnˈboʊstɪŋ/","extraExplanation":["“nonboasting”在实际写作中更常见的形式是带连字符的“non-boasting”。在口语或更自然的表达里，也常用“modest”“humble”“unassuming”或“unboastful”来替换。"]}
{"word":"nonboastingly","summary":{"en":"Nonboastingly means “modestly; without bragging.”","zh":"nonboastingly 意为“谦虚地；不自夸地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not boast; modestly and without showing off.","zh":"以不自夸的方式；谦虚地、不炫耀地。"},"examples":[{"en":"She nonboastingly mentioned that her team had won the award.","zh":"她不自夸地提到她的团队得了奖。"},{"en":"He spoke nonboastingly about his achievements, focusing on what he learned.","zh":"他谈到自己的成就时毫不炫耀，而是强调自己学到了什么。"}]}],"synonyms":["modestly","humbly","unassumingly","without bragging"],"phonetic":"/ˌnɑnˈboʊstɪŋli/","extraExplanation":["这个词由 non-（“不、非”）+ boasting（“自夸”）+ -ly（副词后缀）构成，语气强调“刻意不炫耀、保持低调”。","实际使用中较少见，更常用的表达是 modestly（谦虚地）、without boasting（不夸耀地）、humbly（谦卑地）。在写作中用 nonboastingly 会显得更正式或更书面。"]}
{"word":"nonbodily","summary":{"en":"“Nonbodily” means not physical or not of the body (more mental/spiritual/abstract).","zh":"“nonbodily”表示“非身体的、非肉体的”，偏心理/精神/抽象层面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to the physical body; existing in the mind, spirit, or in an abstract way rather than in a material form.","zh":"非肉体的；不涉及身体的；偏精神、心灵或抽象层面的。"},"examples":[{"en":"Her grief was nonbodily, but it still felt overwhelming.","zh":"她的悲伤是非肉体的，但仍然让人难以承受。"},{"en":"The novel explores nonbodily themes like memory and identity.","zh":"这部小说探讨了记忆与身份等非肉体的主题。"}]}],"synonyms":["nonphysical","immaterial","intangible","spiritual","mental"],"phonetic":"/ˌnɑnˈbɑdɪli/","extraExplanation":["“Nonbodily”由前缀 non-（不、非）+ bodily（身体的）构成，常见于较正式或学术性的语境。日常英语里，人们更常用更自然的表达来替代，例如：nonphysical（非物质的/非身体的）、spiritual（精神的）、mental（心理的）、immaterial（非物质的）、intangible（无形的）。","在哲学、宗教或文学评论中，“nonbodily”有时用来对比 bodily（肉体的）与 soul/mind（灵魂/心智）的体验，例如“nonbodily pain”（非身体的痛苦，指情感或心理痛苦）。"]}
{"word":"nonboding","summary":{"en":"Nonbinding means “not legally enforceable; only an intention.”","zh":"Nonbinding 指“无（法律）约束力；仅表示意向”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an agreement, promise, or decision) not legally or formally enforceable; it expresses intention but does not create an obligation.","zh":"（协议、承诺或决定）不具法律或正式约束力的；表示意向但不产生必须履行的义务。"},"examples":[{"en":"The memorandum is nonbinding, so either side can change its position later.","zh":"这份备忘录不具约束力，所以任何一方之后都可以改变立场。"},{"en":"They reached a nonbinding agreement to keep talking and share information.","zh":"他们达成了一项不具约束力的协议，继续沟通并共享信息。"},{"en":"The vote was nonbinding, but it showed strong public support.","zh":"这次投票不具约束力，但显示了强烈的公众支持。"}]}],"synonyms":["not legally binding","unenforceable","advisory"],"phonetic":"/ˌnɑnˈbaɪndɪŋ/","extraExplanation":["你输入的“nonboding”通常是拼写错误，常见正确拼写是 **nonbinding**。","**nonbinding** 常用于法律、商业和外交语境：例如 *nonbinding resolution*（不具约束力的决议）、*nonbinding agreement/offer*（不具约束力的协议/报价）。它强调“表达意向/立场”，但对方不一定必须照做。","近义表达：**not legally binding**, **unenforceable**（更偏“无法强制执行”）。反义表达：**binding**, **legally binding**（具有法律约束力的）。"]}
{"word":"nonbodingly","summary":{"en":"“Nonbodingly” means “without any ominous sign; not in a way that suggests something bad will happen.”","zh":"“nonbodingly”意为“没有不祥征兆地；不带坏事将临的感觉地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not suggest a bad outcome; without foreboding; not ominously.","zh":"以不预示坏结果的方式；不带不祥预感地；不阴森地。"},"examples":[{"en":"The sky cleared nonbodingly, and everyone relaxed.","zh":"天空不带任何不祥预兆地放晴了，大家都放松下来。"},{"en":"She spoke nonbodingly, as if nothing were about to go wrong.","zh":"她说话时毫无不祥预感，仿佛一切都不会出错。"}]}],"synonyms":["not ominously","without foreboding","inauspiciously (negative; different nuance)","unthreateningly"],"phonetic":"/ˌnɑnˈboʊdɪŋli/","extraExplanation":["“nonbodingly”非常少见，更常见的表达是“without foreboding / not ominously / in an unthreatening way”。","词根来自“bode”（预示），形容词“boding”（预兆的、凶兆的）+ 否定前缀“non-”+ 副词后缀“-ly”。在文学或较旧的文风里可能会看到类似造法。"]}
{"word":"nonbody","summary":{"en":"“Nonbody” is usually a nonstandard form of “nobody” (no person / an unimportant person). Rarely, it can mean a disembodied being in philosophical or literary contexts.","zh":"“nonbody”通常是“nobody”的非标准写法（没有人/无名小卒）；极少数情况下在哲学或文学语境中可指“无形、无身体的存在”。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(Commonly a misspelling or nonstandard form of “nobody”) no person; not anyone.","zh":"（常见为“nobody”的拼写错误或非标准写法）没有人；不任何人。"},"examples":[{"en":"I saw nobody in the hallway.","zh":"我在走廊里一个人也没看见。"},{"en":"Nobody knows the answer yet.","zh":"还没有人知道答案。"}]},{"partOfSpeech":"n.","definition":{"en":"(From the meaning of “nobody”) a person who is not important or who has no influence (often rude).","zh":"（源自“nobody”的含义）无足轻重的人；小人物（常带贬义/不礼貌）。"},"examples":[{"en":"He worried people would think he was a nobody.","zh":"他担心别人会觉得他是个无名小卒。"},{"en":"She went from being a nobody to a well-known singer.","zh":"她从默默无闻变成了知名歌手。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) something or someone without a physical body; a disembodied being or state (used in philosophy/literature).","zh":"（罕见）无身体之物/无形之人；脱离肉身的存在或状态（多见于哲学/文学语境）。"},"examples":[{"en":"In the story, the spirit is a kind of nonbody that can pass through walls.","zh":"在故事里，那个灵体是一种“无形之身”，能穿墙而过。"}]}],"synonyms":["nobody","no one","not anyone","insignificant person"],"phonetic":"/ˈnoʊˌbɑdi/","extraExplanation":["“nonbody”在现代英语中非常少见。日常写作里，如果你想表达“没有人/无名小卒”，几乎总是用“nobody”。","如果你看到“nonbody”，要结合上下文：多数情况下是拼写错误；在少数文学/哲学文本里可能是“non- + body（身体）”的临时造词，强调“非身体的存在”。"]}
{"word":"nonboiling","summary":{"en":"Nonboiling means “not boiling,” often describing very hot liquid that is below the boiling point.","zh":"nonboiling 指“未沸腾的”，常形容很热但尚未达到沸点的液体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not boiling; not in a state of boiling (no bubbling caused by reaching the boiling point).","zh":"不沸腾的；未处于沸腾状态的（没有因达到沸点而产生的气泡）。"},"examples":[{"en":"Heat the sauce gently until it is hot but nonboiling.","zh":"把酱汁小火加热到很热但不要沸腾。"},{"en":"Use nonboiling water to dissolve the powder so it won’t clump.","zh":"用不沸腾的热水来溶解粉末，这样不容易结块。"}]}],"synonyms":["not boiling","below boiling","unboiled"],"phonetic":"/nɑnˈbɔɪlɪŋ/","extraExplanation":["“non-”是英语里常见的否定前缀，表示“非、未、不”，如 nonfat（脱脂的/非脂肪的）、nonstop（不停的）。因此 nonboiling 直观上就是“不是在沸腾的”。","在烹饪或实验语境中，nonboiling 常用来强调“温度很高但还没到沸点”，避免剧烈翻滚影响口感或反应。"]}
{"word":"nonbook","summary":{"en":"“Nonbook” means something that is not a traditional printed book, especially in a library context.","zh":"“nonbook”指非传统纸质图书的资料或物品，尤多见于图书馆语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in libraries) any item that is not a traditional printed book, such as a DVD, CD, map, audiobook, or kit.","zh":"（尤指图书馆用语）非传统纸质图书的馆藏资料，如DVD、CD、地图、有声书或工具包等。"},"examples":[{"en":"The library has a separate section for nonbooks like DVDs and audiobooks.","zh":"图书馆有一个专区放置DVD和有声书等非图书资料。"},{"en":"You can check out up to five nonbooks at a time.","zh":"你一次最多可以借五件非图书资料。"}]},{"partOfSpeech":"adj.","definition":{"en":"not a book; not in book form.","zh":"非书籍的；不是以书本形式呈现的。"},"examples":[{"en":"This course includes nonbook materials, such as videos and podcasts.","zh":"这门课包括视频和播客等非书本材料。"},{"en":"Some stories began as nonbook content online before becoming novels.","zh":"有些故事先以网络上的非书本内容出现，后来才变成小说。"}]}],"synonyms":["non-book item","non-book material","media item","audiovisual material"],"phonetic":"/ˈnɑnˌbʊk/","extraExplanation":["“nonbook”在日常英语里不算常用，更常见的是说“non-book materials”或在图书馆语境中说“nonbook items”。它常用于馆藏管理与借阅规则中，用来区分纸质书与其他载体（音像、地图、游戏、工具包等）。"]}
{"word":"nonbookish","summary":{"en":"“Nonbookish” describes someone or something practical and not very academic or scholarly.","zh":"“nonbookish”用来形容偏实践、不太学术或不太爱读书的人或事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bookish; not strongly interested in reading, academic study, or scholarly habits; more practical than intellectual in style.","zh":"不书卷气的；不太爱读书或不偏学术的；更偏实践而非纯理论的。"},"examples":[{"en":"He’s smart but nonbookish—he learns best by doing projects.","zh":"他很聪明，但不太书卷气——他最擅长通过做项目来学习。"},{"en":"She has a nonbookish sense of humor that comes from real life experience.","zh":"她的幽默感不太书卷气，更多来自真实生活经验。"},{"en":"The training is designed for nonbookish learners who prefer hands-on practice.","zh":"这套培训是为不太爱读书、喜欢动手练习的学习者设计的。"}]}],"synonyms":["practical","hands-on","nonacademic","unscholarly","down-to-earth"],"phonetic":"/ˌnɑnˈbʊkɪʃ/","extraExplanation":["“nonbookish” = non-（不、非）+ bookish（书卷气的、学究气的）。常用来形容一个人的学习方式或气质：更偏实践、经验、动手能力，而不是通过大量阅读或学术讨论。语气通常中性，有时也带一点随意或口语化的感觉。"]}
{"word":"nonbookishly","summary":{"en":"“Nonbookishly” means “in a not-bookish, more practical or conversational way.”","zh":"“nonbookishly”表示“以不书卷气的、更实际或更口语化的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not bookish; in a practical, natural, or conversational (not overly academic) style.","zh":"以不书卷气的方式；以更实际、自然或口语化（不过分学术/文绉绉）的方式。"},"examples":[{"en":"She explained the theory nonbookishly, using simple everyday examples.","zh":"她用不书卷气的方式解释这个理论，举了些日常的简单例子。"},{"en":"He writes nonbookishly, so even beginners can follow his ideas.","zh":"他写作不那么学院派，所以连初学者也能跟上他的思路。"},{"en":"Try to answer nonbookishly—just say what you really mean.","zh":"试着用不书卷气的方式回答——就说出你真正想表达的意思。"}]}],"synonyms":["plainly","simply","informally","conversationally","practically"],"phonetic":"/ˌnɑnˈbʊkɪʃli/","extraExplanation":["这是一个相对少见、偏“临时造词/修辞”的副词：non-（不、非）+ bookish（书卷气的、学究气的）+ -ly（副词后缀）。在写作或口语中使用它，通常是为了强调“别太像教科书/论文那样说话”，更贴近日常表达。"]}
{"word":"nonbookishness","summary":{"en":"Nonbookishness means not being bookish—more practical and experience-based than academic or literary.","zh":"nonbookishness 指“不书生气/不学院派”，更务实、更靠经验而不是学术或文学取向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being bookish; a preference for practical experience over academic or literary interests","zh":"不书生气；不学院派的特质；更偏向实践经验而非学术或文学兴趣"},"examples":[{"en":"His nonbookishness helped him connect with customers in a natural way.","zh":"他的“不书生气”让他能很自然地和顾客打成一片。"},{"en":"The program values nonbookishness as much as strong grades.","zh":"这个项目既重视实践型特质，也重视好成绩。"}]}],"synonyms":["practicality","down-to-earthness","pragmatism","anti-intellectualism (sometimes)"],"phonetic":"/ˌnɑnˈbʊkɪʃnəs/","extraExplanation":["“nonbookishness”由 non-（不、非）+ bookish（书卷气的、爱读书而显得有点学院派的）+ -ness（把形容词变成名词，表示“……的状态/特质”）构成。","这是一个不太常见、偏书面或幽默的词；日常更常说 “practicality（务实）/ down-to-earth attitude（脚踏实地的态度）/ not very academic（不太学院派）”。注意它通常不是贬义，也可用来夸人“接地气、实用”。"]}
{"word":"nonbooks","summary":{"en":"“Nonbooks” means library or collection items that aren’t traditional books (like DVDs or audiobooks).","zh":"“Nonbooks”指不是传统书本形式的馆藏/资料（如DVD或有声读物等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"items that are not traditional books, especially in libraries or collections (for example: DVDs, audiobooks, magazines, games, maps, or kits)","zh":"（尤指在图书馆或收藏中）“非图书”资料；不是传统书本形式的馆藏（如DVD、有声读物、杂志、游戏、地图或学习套件等）"},"examples":[{"en":"The library’s nonbooks include DVDs, audiobooks, and board games.","zh":"图书馆的非图书馆藏包括DVD、有声读物和桌游。"},{"en":"Students can borrow nonbooks for class projects, like documentaries or language-learning kits.","zh":"学生可以借非图书资料用于课堂项目，比如纪录片或语言学习套件。"},{"en":"Please return all nonbooks to the media desk, not the book drop.","zh":"请把所有非图书资料还到多媒体服务台，不要投到还书箱里。"}]}],"synonyms":["nonbook materials","media","library materials","nonprint materials"],"phonetic":"/ˈnɑnˌbʊks/","extraExplanation":["“Nonbooks”常见于图书馆、学校资源中心或出版/馆藏分类语境里，是偏管理与分类的用语；日常口语里更常说“media”“materials”“DVDs/audiobooks”等更具体的词。","有的机构也会用“nonbook materials”“nonprint materials”来强调“非印刷品”（如音视频、电子资源、教具套件）。"]}
{"word":"nonborrower","summary":{"en":"A nonborrower is someone who does not borrow money, especially by not taking loans or credit.","zh":"nonborrower 指不借钱的人（尤其是不贷款或不使用信用的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or organization that does not borrow money (especially not taking a loan or credit in a given situation).","zh":"不借款者；非借款人（指在某种情况下不借钱，尤其是不贷款/不用信用的人或机构）。"},"examples":[{"en":"Nonborrowers can still have a credit report if they have other accounts, like a phone plan.","zh":"不借款者仍然可能有信用报告，比如他们有手机套餐等其他账户。"},{"en":"The bank’s survey compared borrowers and nonborrowers in the same age group.","zh":"银行的调查比较了同一年龄段的借款者与非借款者。"}]}],"synonyms":["non-borrower","nondebtor","cash buyer"],"phonetic":"/ˌnɑnˈbɔr.oʊ.ɚ/","extraExplanation":["“non-”是常见前缀，表示“非/不”。“nonborrower”多见于金融、统计、研究报告中，用来把人群分为“borrowers（借款者）”和“nonborrowers（非借款者）”。","拼写上既可写作一个词“nonborrower”，也常见更清晰的写法“non-borrower”。正式写作时可根据机构/期刊的风格指南选择。"]}
{"word":"nonborrowing","summary":{"en":"Nonborrowing means not involving borrowing, especially in finance; less commonly, it can describe avoiding loanwords in language.","zh":"nonborrowing意为“不借款的（尤指金融语境）”；较少见时也可指“语言上不借用外来词的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving borrowing money; not financed by taking loans or issuing debt","zh":"不涉及借款的；不靠贷款或举债融资的"},"examples":[{"en":"The company reported strong growth in nonborrowing cash flow.","zh":"公司报告非借款产生的现金流增长强劲。"},{"en":"They preferred a nonborrowing plan to avoid paying interest.","zh":"他们更偏好不借款的方案，以避免支付利息。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) not borrowing words from other languages; avoiding loanwords","zh":"（较少见）不借用外来词的；避免使用外来语借词的"},"examples":[{"en":"Some writers try to use a nonborrowing style, choosing native words when possible.","zh":"一些作者尽量采用不借词的写法，能用本族语词就不用外来词。"}]}],"synonyms":["debt-free","unleveraged","self-financed","non-debt"],"phonetic":"/ˌnɑnˈbɑroʊɪŋ/","extraExplanation":["“nonborrowing”常见写法也包括带连字符的“non-borrowing”，在财经写作里更常用。","在金融语境中，它强调资金来源不是“借来的”，常与cash flow（现金流）、policy（政策）、strategy（策略）等搭配。"]}
{"word":"nonbotanic","summary":{"en":"“Nonbotanic” means not related to plants or botany.","zh":"“nonbotanic”表示“与植物或植物学无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to plants or botany; not botanical.","zh":"非植物的；与植物学无关的；非植物学（或非植物园/植物研究）相关的。"},"examples":[{"en":"The museum has both botanic displays and nonbotanic exhibits about insects and rocks.","zh":"这家博物馆既有植物相关的展览，也有关于昆虫和岩石等非植物的展区。"},{"en":"For this project, we’re focusing on nonbotanic factors like climate and soil chemistry.","zh":"这个项目中，我们关注的是气候和土壤化学等非植物因素。"}]}],"synonyms":["non-botanical","not botanical","nonplant","non-plant-related"],"phonetic":"/ˌnɑn bəˈtænɪk/","extraExplanation":["“non-”是英语中常见前缀，表示“非、不”。“nonbotanic”更常见于较正式或学术的语境，用来把“植物相关”和“非植物相关”的内容区分开。","日常英语里更常用“non-botanical”（加连字符）或直接说“not botanical”。“botanic”和“botanical”意思接近，但“botanical”在现代英语中更常见。"]}
{"word":"nonbotanical","summary":{"en":"Nonbotanical means not related to plants or botany.","zh":"nonbotanical 指“与植物或植物学无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to plants or the study of plants (botany).","zh":"非植物的；与植物或植物学无关的。"},"examples":[{"en":"The museum has botanical and nonbotanical exhibits, including fossils and minerals.","zh":"这家博物馆既有植物类展品，也有非植物类展品，比如化石和矿物。"},{"en":"They used nonbotanical materials like glass and metal to create a “garden” sculpture.","zh":"他们用玻璃和金属等非植物材料来制作“花园”雕塑。"}]}],"synonyms":["non-plant","not plant-based","not related to plants"],"phonetic":"/ˌnɑn bəˈtænɪkəl/","extraExplanation":["“non-”是一个常见前缀，表示“非、不”。“botanical”意为“植物的/植物学的”，因此“nonbotanical”多用于分类或对比语境（如“植物类 vs. 非植物类”）。在日常口语中，也常用更具体的表达来替代，比如“not plant-based”（非植物来源的）或“not related to plants”（与植物无关）。"]}
{"word":"nonbotanically","summary":{"en":"Nonbotanically means “from a non-botanical (everyday or non-scientific) perspective.”","zh":"nonbotanically 意为“从非植物学（更偏日常/非科学）的角度”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not related to botany (the scientific study of plants), or from a non-botanical point of view.","zh":"以非植物学的方式；从非植物学（研究植物的科学）角度来看。"},"examples":[{"en":"Nonbotanically speaking, “pineapple” doesn’t tell you much about the plant’s family.","zh":"从非植物学角度来说，“pineapple（菠萝）”这个词并不能告诉你它属于哪个植物科。"},{"en":"The word “berry” is often used nonbotanically to mean any small, juicy fruit.","zh":"“berry（浆果）”常被以非植物学的方式使用，泛指任何小而多汁的水果。"}]}],"synonyms":["informally","in everyday terms","non-scientifically","colloquially"],"phonetic":"/ˌnɑn bəˈtænɪkli/","extraExplanation":["这个词比较少见，通常出现在科普写作或术语对比中，用来区分“日常用法/通俗说法”和“植物学上的严格定义”。","构词法：non-（不、非）+ botanically（植物学地）。常与“botanically speaking（从植物学角度来说）”形成对照：botanically vs. nonbotanically。"]}
{"word":"nonbourgeois","summary":{"en":"“Nonbourgeois” means not middle-class/bourgeois in lifestyle or values, often suggesting nonconventional or non-materialistic.","zh":"nonbourgeois 指“非资产阶级/非中产阶级（价值观与生活方式）的”，常暗示不落俗套或不那么物质化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bourgeois; not belonging to, typical of, or supporting the middle-class lifestyle and values (often implying not conventional, not materialistic, or not socially “respectable” in a traditional way).","zh":"非资产阶级的；非中产阶级（生活方式与价值观）的；不符合传统“体面/主流”中产规范的（常含“不落俗套、不物质化”的意味）。"},"examples":[{"en":"They wanted a nonbourgeois wedding—small, simple, and focused on friends rather than status.","zh":"他们想要一场非中产式的婚礼——小而简单，更重朋友而不是排场。"},{"en":"Her nonbourgeois tastes showed in her love of secondhand books and neighborhood cafés.","zh":"她的非中产趣味体现在：喜欢二手书和社区小咖啡馆。"},{"en":"The film celebrates a nonbourgeois way of living outside career pressure and consumer culture.","zh":"这部电影赞颂一种非中产式的生活方式：远离职业焦虑与消费文化。"}]}],"synonyms":["non-middle-class","unbourgeois","anti-bourgeois","nonconformist"],"phonetic":"/ˌnɑnˈbʊrʒwɑ/","extraExplanation":["“bourgeois（资产阶级/中产阶级的）”在社会学、政治经济学（尤其是马克思主义语境）里常指拥有资本、追求财产与社会地位的一类群体；在日常文化评论里也常带一点贬义，指“俗气、保守、爱摆排场、太讲体面”。因此 nonbourgeois 往往用于强调与这些价值取向相反或保持距离。","拼写上常见两种：nonbourgeois（不加连字符）与 non-bourgeois（加连字符），意思基本相同。"]}
{"word":"nonbrand","summary":{"en":"“Nonbrand” refers to something generic or not sold under a well-known brand name.","zh":"“nonbrand”指非知名品牌的、通用的（或无品牌/自有品牌的）商品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in marketing) Not connected to a famous brand name; generic or store-brand.","zh":"（尤指营销语境）非品牌的；不属于知名品牌的；通用的/自有品牌的。"},"examples":[{"en":"I bought a nonbrand charger because it was much cheaper.","zh":"我买了一个非品牌的充电器，因为便宜很多。"},{"en":"Some nonbrand medicines have the same active ingredients as brand-name ones.","zh":"一些非品牌（通用名）药和品牌药的有效成分是一样的。"}]},{"partOfSpeech":"n.","definition":{"en":"A product that is not sold under a well-known brand name; a generic product.","zh":"非品牌商品；无品牌/通用商品。"},"examples":[{"en":"This store sells both brands and nonbrands.","zh":"这家店既卖品牌货，也卖无品牌（通用）商品。"},{"en":"Nonbrands can be a good option if you compare quality carefully.","zh":"如果你仔细比较质量，无品牌商品也可能是个不错的选择。"}]}],"synonyms":["generic","unbranded","store-brand","private-label"],"phonetic":"/ˌnɑnˈbrænd/","extraExplanation":["“nonbrand”常见于商品比较、网购评论、广告/市场报告等场景。更常见、更自然的表达包括：generic（通用的/无品牌的）、store-brand / private-label（商店自有品牌）。在药品领域，generic drug 指“仿制药/通用名药”，并不等于“低质量”。"]}
{"word":"nonbranded","summary":{"en":"Nonbranded means not sold under a brand name; generic/unbranded.","zh":"nonbranded 指“非品牌的、无品牌的”，常等同于“通用/白牌”产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not sold under a well-known brand name; generic or without brand labeling.","zh":"非品牌的；不以知名品牌名义销售的；无品牌标识的（常指“通用/白牌”产品）。"},"examples":[{"en":"I usually buy nonbranded pain relievers because they’re cheaper and work the same.","zh":"我通常买非品牌的止痛药，因为更便宜，而且效果差不多。"},{"en":"The store stocks both branded and nonbranded products on the same shelf.","zh":"这家店把品牌商品和非品牌商品放在同一排货架上。"}]}],"synonyms":["unbranded","generic","no-name"],"phonetic":"/ˌnɑnˈbrændɪd/","extraExplanation":["“nonbranded”也常写作“non-branded”或更常见的“unbranded”。在市场营销或电商语境里，它通常指“没有品牌名/不强调品牌”的商品（类似中文里的“白牌、通用款”）。如果是“没有任何商标标识”，用“unbranded”更自然；如果是“不是某个特定品牌的版本”，也可用“generic”。"]}
{"word":"nonbreach","summary":{"en":"“Nonbreach” means not breaking an agreement or rule, often used in legal/contract contexts.","zh":"“nonbreach”指未违约/未违反（多用于法律或合同语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fact of not breaking a rule, promise, agreement, or law (especially in legal or contract contexts)","zh":"未违约；未违反（规则、承诺、协议或法律，尤用于法律/合同语境）"},"examples":[{"en":"The court found nonbreach of the contract, so no damages were awarded.","zh":"法院认定未违约，因此不判赔偿。"},{"en":"You must show nonbreach before you can demand payment under the agreement.","zh":"在你要求对方按协议付款前，你必须证明自己未违约。"}]},{"partOfSpeech":"adj.","definition":{"en":"not involving a breach; compliant with the terms of an agreement or rule","zh":"不构成违约的；符合（协议/规则）条款的"},"examples":[{"en":"The landlord argued that the delay was a nonbreach event under the lease.","zh":"房东主张该延迟属于租约中“不构成违约”的情形。"},{"en":"They reached a settlement after agreeing it was a nonbreach situation.","zh":"在双方同意该情形不构成违约后，他们达成了和解。"}]}],"synonyms":["no breach","compliance","nonviolation"],"phonetic":"/ˌnɑnˈbritʃ/","extraExplanation":["“nonbreach”在日常英语里不算常见，更常见的表达是：\"no breach\"（没有违约/没有违反）或 \"non-breach\"（带连字符，法律写作中更常见）。","常见搭配：breach of contract（违约）；material breach（重大违约）；minor/immaterial breach（轻微/非重大违约）；in breach (of)（处于违约状态）；not in breach（未违约）。"]}
{"word":"nonbreaching","summary":{"en":"Nonbreaching means not violating an agreement or duty, especially in contract law (e.g., the nonbreaching party).","zh":"Nonbreaching 指未违反协议或义务，尤用于合同法语境（如“未违约方”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not violating a rule, agreement, or legal duty; not in breach","zh":"未违反（规则、协议或法律义务）的；未构成违约的"},"examples":[{"en":"The nonbreaching party can ask the court for damages.","zh":"未违约的一方可以向法院请求损害赔偿。"},{"en":"If you keep the information confidential, you remain nonbreaching under the contract.","zh":"如果你对信息保密，你在合同下仍属于未违约。"}]},{"partOfSpeech":"adj.","definition":{"en":"not breaking through or rupturing (used in technical or medical contexts, less common)","zh":"未破裂的；未穿破的（多见于技术或医学语境，较少见）"},"examples":[{"en":"The report described a nonbreaching tear in the outer layer.","zh":"报告描述了外层未穿破的撕裂。"}]}],"synonyms":["not in breach","compliant","law-abiding","in compliance"],"phonetic":"/ˌnɑnˈbritʃɪŋ/","extraExplanation":["“nonbreaching”最常见于合同/法律英语，通常出现在固定搭配“the nonbreaching party（未违约方）”。它强调某一方没有违反合同条款，因此通常享有救济权利，例如要求赔偿（damages）、要求继续履行（specific performance）或解除合同（terminate the contract），具体取决于合同与法律规定。","词形上它是“non-（不）+ breaching（违约/违反）”，这里的 breach 常指“违约、违反义务”，比一般的 “break a rule” 更正式、更偏法律语境。"]}
{"word":"nonbreakable","summary":{"en":"Nonbreakable means “not able to be broken,” and it can also refer to text that should not wrap onto a new line.","zh":"nonbreakable 意为“不可打碎/不易破的”，也可指排版中“不可换行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be broken; made so that it does not easily break (often describing materials, containers, or packaging).","zh":"不易破的；不可打碎的（常形容材料、容器或包装）。"},"examples":[{"en":"The bottle is made of nonbreakable plastic, so it’s safer for kids.","zh":"这个瓶子是用不易破的塑料做的，所以对孩子更安全。"},{"en":"Please use nonbreakable dishes at the outdoor party.","zh":"户外聚会请使用不易破的餐具。"}]},{"partOfSpeech":"adj.","definition":{"en":"In printing, computing, or typesetting: not allowing a line break in a specific place (also written as “non-breaking”).","zh":"（排版/计算机）不允许在某处换行的（也常写作 non-breaking）。"},"examples":[{"en":"Use a nonbreakable space so the two words stay on the same line.","zh":"用一个不换行空格，让这两个词保持在同一行。"},{"en":"Some editors have a nonbreakable hyphen to prevent awkward line breaks.","zh":"有些编辑器有不换行连字符，用来避免尴尬的断行。"}]}],"synonyms":["unbreakable","shatterproof","durable","non-breaking"],"phonetic":"/ˌnɑnˈbreɪkəbəl/","extraExplanation":["在日常生活里更常见的说法是 unbreakable（更口语、更常用）；nonbreakable 也能用，但更像“技术/产品描述”或“规范用词”。","拼写上常见两种：nonbreakable（合写）和 non-breakable（带连字符）。在排版语境里更常见的是 non-breaking（如 non-breaking space 不换行空格）。"]}
{"word":"nonbreeder","summary":{"en":"A nonbreeder is an individual (animal or person) that does not reproduce.","zh":"nonbreeder 指不繁殖/不产生后代的个体（动物或人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An animal or person that does not reproduce; in biology, an individual in a group or population that does not produce offspring (often by choice, age, health, or social role).","zh":"不繁殖者；不育个体；在生物学中指在群体或种群中不产生后代的个体（可能因选择、年龄、健康或社会角色等原因）。"},"examples":[{"en":"In some bird species, nonbreeders help feed the chicks of a breeding pair.","zh":"在一些鸟类中，不繁殖个体会帮助一对繁殖的亲鸟喂养雏鸟。"},{"en":"The study compared stress levels in breeders and nonbreeders during the mating season.","zh":"这项研究比较了繁殖个体与不繁殖个体在交配季节的压力水平。"},{"en":"Many worker ants are nonbreeders that maintain the nest and gather food.","zh":"许多工蚁是不繁殖个体，它们负责维护巢穴并采集食物。"}]}],"synonyms":["nonreproducer","infertile individual (context-dependent)","sterile individual (context-dependent)"],"phonetic":"/ˌnɑnˈbriːdɚ/","extraExplanation":["这个词常见于生态学、动物行为学和畜牧/育种语境，用来区分“繁殖个体（breeders）”与“不繁殖个体（nonbreeders）”。在一些社会性动物（如蚂蚁、蜜蜂、鼹鼠）中，不繁殖并不等于“无用”，它们可能通过照料幼崽、觅食、防御等行为提高群体整体繁殖成功率（常被讨论为“合作繁殖/cooperative breeding”或“真社会性/eusociality”的一部分）。"]}
{"word":"nonbreeding","summary":{"en":"Nonbreeding describes animals, seasons, or behaviors that are not related to reproduction or occur outside the breeding season.","zh":"nonbreeding 用来形容动物、季节或行为与繁殖无关，或发生在繁殖季之外。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involved in producing offspring; not used for reproduction during a particular season or period.","zh":"不繁殖的；（在某一季节/时期）不参与繁殖的。"},"examples":[{"en":"During the nonbreeding season, many birds spend more time feeding than nesting.","zh":"在非繁殖季，许多鸟类更多时间用来觅食，而不是筑巢。"},{"en":"The study tracked nonbreeding adults to see how they migrate and find food.","zh":"这项研究追踪了不繁殖的成体，以了解它们如何迁徙和觅食。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of behavior or habitat use) occurring outside the breeding season.","zh":"（指行为或栖息地利用）发生在繁殖季之外的。"},"examples":[{"en":"They counted nonbreeding flocks near the coast in winter.","zh":"他们在冬季统计了海岸附近的非繁殖鸟群。"},{"en":"Nonbreeding habitat can be just as important as nesting sites.","zh":"非繁殖期栖息地和筑巢地一样重要。"}]}],"synonyms":["nonreproductive","infertile (context-dependent)","off-season (for “season,” informal)"],"phonetic":"/ˌnɑnˈbriːdɪŋ/","extraExplanation":["“non-”表示“非/不”，加在“breeding（繁殖的）”前面构成“nonbreeding”。常见于生态学、动物学与保护研究中，如“nonbreeding season（非繁殖季）”“nonbreeding grounds（非繁殖地）”。","在鸟类研究中，“breeding/nonbreeding”常用来区分不同季节的分布、迁徙与行为：繁殖季关注配对与育雏，非繁殖季更常讨论越冬、觅食与群聚。"]}
{"word":"nonbristled","summary":{"en":"“Nonbristled” describes something that has no bristles or stiff hair-like projections.","zh":"“Nonbristled”指“没有鬃毛/刷毛、表面不呈硬毛状突起”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no bristles; not bristled (not covered with stiff hairs, fibers, or brush-like projections).","zh":"无鬃毛的；不具刷毛的（没有坚硬的毛、纤维或刷状突起）。"},"examples":[{"en":"Use a nonbristled cloth to wipe the screen so you don’t scratch it.","zh":"用无鬃毛的布擦屏幕，这样就不会刮花。"},{"en":"The insect’s antennae looked smooth and nonbristled under the microscope.","zh":"在显微镜下，那只昆虫的触角看起来很光滑，没有鬃毛。"}]}],"synonyms":["bristleless","smooth","unbristled"],"phonetic":"/ˌnɑnˈbrɪsəld/","extraExplanation":["“nonbristled”由前缀 non-（不、无）+ bristled（有鬃毛的）构成，常见于较正式或技术性的描述（如生物学、材料/表面特征说明）。在实际写作中，也常见写法 “non-bristled”。","“bristle”既可指动物的硬毛/鬃毛，也可指刷子的刷毛；因此 nonbristled 常用于强调表面“光滑、无刷毛状突起”。"]}
{"word":"nonbromidic","summary":{"en":"Nonbromidic means original and not clichéd or boring.","zh":"nonbromidic 指“有新意、不落俗套、不陈词滥调的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not dull, trite, or full of clichés; original and interesting (often used in writing, speech, or ideas).","zh":"不陈词滥调的；不俗套的；有新意、耐人寻味的（常用于形容文字、言谈或观点）。"},"examples":[{"en":"Her essay was thoughtful and nonbromidic, avoiding the usual clichés.","zh":"她的文章很有深度而且不落俗套，避开了常见的陈词滥调。"},{"en":"We need a nonbromidic slogan that people will actually remember.","zh":"我们需要一句不俗套、让人真的记得住的口号。"}]}],"synonyms":["original","fresh","inventive","imaginative","unhackneyed","not clichéd"],"phonetic":"/ˌnɑn.broʊˈmɪdɪk/","extraExplanation":["“nonbromidic”来自“bromidic”。英语里的“bromide”除了指化学物质“溴化物”，在日常语言中还指“陈腐的套话/老生常谈”（比如用来安慰人的空话）。因此“bromidic”表示“陈词滥调的”，而“nonbromidic”就是“反其道而行：不俗套、有新意”。","这个词比较少见、略带书面语/评论语气。更常用的替代说法有：original, fresh, imaginative, not clichéd."]}
{"word":"nonbroodiness","summary":{"en":"Nonbroodiness means the lack of broodiness—most often a hen not wanting to sit on eggs, and less commonly a person not tending to brood.","zh":"nonbroodiness 指“不抱窝/不恋巢”的状态（多指母鸡不伏蛋孵化），也可引申为人“不爱闷闷不乐、不过度忧思”的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being broody; especially, a hen’s tendency not to want to sit on eggs and hatch them.","zh":"不抱窝；（尤指母鸡）不想伏蛋孵化的状态/特性。"},"examples":[{"en":"This breed is valued for its nonbroodiness, so it keeps laying eggs instead of sitting on them.","zh":"这个品种因不抱窝而受重视，所以它会持续下蛋，而不是伏在蛋上。"},{"en":"Farmers often select for nonbroodiness to increase egg production.","zh":"农户常会选择不抱窝的特性来提高产蛋量。"}]},{"partOfSpeech":"n.","definition":{"en":"A tendency not to brood (to think sadly or worry for a long time).","zh":"不爱沉思/不爱忧虑纠结的倾向；不易闷闷不乐。"},"examples":[{"en":"Her nonbroodiness helped her recover quickly after setbacks.","zh":"她不爱钻牛角尖的性格让她在挫折后恢复得很快。"},{"en":"He admired her calm nonbroodiness in stressful situations.","zh":"他很欣赏她在压力下那种不纠结、很淡定的气质。"}]}],"synonyms":["non-broodiness","lack of broodiness","non-broody tendency","not broody"],"phonetic":"/ˌnɑnˈbruːdinəs/","extraExplanation":["“Nonbroodiness”主要见于家禽饲养/育种语境，描述母鸡不进入“抱窝（broody）”状态，因此更可能持续产蛋。日常英语中更常用的表达是“not broody”或“non-broody”，名词形式相对少见。","词形结构：non-（否定前缀）+ broodiness（抱窝/沉思忧虑的状态）。其中“broody”既可指家禽的“抱窝”，也可指人的“闷闷不乐、爱忧思”。"]}
{"word":"nonbrooding","summary":{"en":"“Nonbrooding” means not gloomy or moody; not brooding.","zh":"“nonbrooding”表示不阴郁、不压抑、不闷闷不乐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not brooding; not showing a gloomy, moody, or deeply pensive sadness.","zh":"不忧郁的；不阴沉的；不沉思苦恼的（指不像“brooding”那样闷闷不乐或带着压抑的深思）。"},"examples":[{"en":"She has a calm, nonbrooding personality, even under pressure.","zh":"即使在压力下，她的性格也很平静，不会显得阴郁。"},{"en":"The movie avoids a dark, brooding tone and keeps things more nonbrooding and hopeful.","zh":"这部电影避免了阴暗压抑的基调，整体更轻快、充满希望。"}]}],"synonyms":["not moody","not gloomy","lighthearted","cheerful","upbeat"],"phonetic":"/ˌnɑnˈbruːdɪŋ/","extraExplanation":["“nonbrooding”由前缀 non-（不、非）+ brooding（阴郁的；沉思苦恼的）构成，属于较少见、偏书面或描述风格的用法。日常表达中也常用 “not moody / not gloomy / lighthearted” 来替代。","“brooding”常用来形容人物气质（a brooding person/hero）或氛围（a brooding atmosphere），带有“压抑、沉重、闷在心里”的感觉；“nonbrooding”强调相反的轻松、开朗或不那么沉郁的气质。"]}
{"word":"nonbroody","summary":{"en":"Nonbroody means not broody—either a hen that won’t sit on eggs, or (informally) a person who doesn’t feel a desire for a baby.","zh":"nonbroody 意为“不抱窝的”（母鸡不伏窝孵蛋）；也可（非正式）指人“不想要孩子/暂时没有想当爸妈的强烈愿望”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a bird, especially a hen) not wanting to sit on eggs to hatch them; not in a brooding state.","zh":"（鸟类，尤指母鸡）不想伏窝孵蛋的；不处于抱窝/就巢状态的。"},"examples":[{"en":"This breed is usually nonbroody, so it won’t often sit on its eggs.","zh":"这个品种通常不抱窝，所以它不太会自己去孵蛋。"},{"en":"If your hens are nonbroody, you may need an incubator to hatch chicks.","zh":"如果你的母鸡不抱窝，你可能需要用孵化器来孵小鸡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person, informal) not wanting to have children or not feeling a strong desire to care for a baby at the moment.","zh":"（人，非正式）不想要孩子的；暂时没有“想带娃/想当爸妈”的强烈愿望的。"},"examples":[{"en":"She says she’s happy and nonbroody right now, focusing on her career.","zh":"她说自己现在很满足，也不急着要孩子，先专注事业。"},{"en":"He’s nonbroody, but he likes spending time with his nieces and nephews.","zh":"他不急着要孩子，但很喜欢和外甥外甥女相处。"}]}],"synonyms":["not broody","not inclined to brood","(hens) non-sitting","(informal) not ready for kids"],"phonetic":"/ˌnɑnˈbruːdi/","extraExplanation":["“broody”原本是养鸡语境里的词，指母鸡进入“抱窝”状态：会长时间待在窝里、性情更护窝，甚至拒绝下蛋或离窝。后来在英式英语里也常用来形容人“很想要孩子/看到婴儿就心动”。因此“nonbroody”多见于两类语境：养鸡/孵化讨论，以及较口语的英式表达（谈生育意愿）。在美式英语里，形容人时更常说“not ready for kids / doesn’t want kids”。"]}
{"word":"nonbrowser","summary":{"en":"“Nonbrowser” describes something not done through a web browser, or (informally) a non-browser program/client.","zh":"“nonbrowser”指不通过网页浏览器进行的（非浏览器的），也可非正式地指非浏览器程序/客户端。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(computing) Not involving a web browser; not used in or through a browser.","zh":"（计算机）非浏览器的；不通过网页浏览器进行的。"},"examples":[{"en":"This feature works in the mobile app, but it’s nonbrowser on desktop.","zh":"这个功能在手机应用里能用，但在桌面端属于非浏览器方式。"},{"en":"For security reasons, the company requires a nonbrowser login method.","zh":"出于安全原因，公司要求使用非浏览器的登录方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) A program or environment that is not a web browser (often used informally).","zh":"（计算机，非正式）非浏览器的软件或运行环境。"},"examples":[{"en":"The tool runs as a nonbrowser, so it doesn’t need Chrome or Safari.","zh":"这个工具作为非浏览器程序运行，所以不需要 Chrome 或 Safari。"},{"en":"We tested the site in multiple browsers and one nonbrowser client.","zh":"我们在多个浏览器以及一个非浏览器客户端里测试了这个网站。"}]}],"synonyms":["non-browser","not browser-based","native (app)","standalone (app)","desktop client","CLI"],"phonetic":"/ˌnɑnˈbraʊzɚ/","extraExplanation":["“nonbrowser”更常见的写法是带连字符的“non-browser”，尤其在正式技术文档里；不带连字符多见于变量名、文件名或内部术语。","它通常出现在技术语境中，用来区分“browser-based（基于浏览器）”与“native app/CLI/desktop client（原生应用/命令行/桌面客户端）”等使用方式。"]}
{"word":"nonbrowsing","summary":{"en":"“Nonbrowsing” describes something not involving web browsing, or a person who isn’t currently browsing online.","zh":"“nonbrowsing”表示“不涉及网页浏览的”，也可指“当前没有在上网浏览的（人）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not using a web browser or not related to web browsing activity.","zh":"不使用网页浏览器的；与网页浏览无关的。"},"examples":[{"en":"The app collects some nonbrowsing data, like your language settings.","zh":"这个应用会收集一些非浏览数据，比如你的语言设置。"},{"en":"Nonbrowsing activity includes downloading files through a separate program.","zh":"非浏览活动包括通过独立程序下载文件。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a user) not currently browsing the internet.","zh":"（指用户）当前没有在上网浏览。"},"examples":[{"en":"If you’re nonbrowsing, you can still receive messages in the chat app.","zh":"即使你当前不在浏览网页，你仍然可以在聊天应用里收到消息。"}]}],"synonyms":["non-browser","offline","not browsing","non-web"],"phonetic":"/ˌnɑnˈbraʊzɪŋ/","extraExplanation":["“non-”是一个常见前缀，表示“非、不、没有”。因此 nonbrowsing 通常是把 non- 加在 browsing（浏览）前面形成的复合词，在隐私政策、数据分析、广告技术（ad tech）里更常见。","在很多语境中，人们更常用更自然的说法：not browsing / offline activity / non-browser activity。nonbrowsing 更偏书面或技术文档用语。"]}
{"word":"nonbrutal","summary":{"en":"Nonbrutal means “not brutal”—not cruel, violent, or harsh.","zh":"nonbrutal 意为“不残暴的”，即不残酷、不暴力、不苛刻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not brutal; not cruel, violent, or harsh.","zh":"不残暴的；不残酷、暴力或苛刻的。"},"examples":[{"en":"The protesters asked police to use nonbrutal methods to control the crowd.","zh":"抗议者要求警方用不残暴的方式来维持秩序。"},{"en":"The film shows a nonbrutal side of the character, focused on helping others.","zh":"这部电影展现了这个角色不残暴的一面，更多是在帮助他人。"}]}],"synonyms":["nonviolent","humane","gentle","kind"],"phonetic":"/nɑnˈbruːtəl/","extraExplanation":["“non-”是常见前缀，表示“非、不是”。因此“nonbrutal”就是“不是 brutal（残暴的）”。在正式写作中，更常见的表达是“nonviolent（非暴力的）”“humane（人道的）”“not brutal（不残暴）”。","“nonbrutal”不是非常常用的固定词；有时读者会觉得有点生硬。若你想强调“方法/对待方式不残忍”，用“humane treatment（人道对待）”更自然。"]}
{"word":"nonbrutally","summary":{"en":"“Nonbrutally” means doing something without brutality—without cruelty or excessive force.","zh":"“nonbrutally”表示“以不残暴的方式”，即不残忍、不过度使用武力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not brutal; without cruelty or extreme force","zh":"以不残暴的方式；不以残忍或过度武力的方式"},"examples":[{"en":"The officers were trained to restrain suspects nonbrutally, using the least force possible.","zh":"警员接受训练，要以不残暴的方式制服嫌疑人，尽量使用最少的武力。"},{"en":"She criticized the policy and asked whether conflict could be handled nonbrutally.","zh":"她批评该政策，并询问冲突是否能以不残暴的方式处理。"}]}],"synonyms":["not brutally","humanely","gently","without violence","with restraint"],"phonetic":"/ˌnɑnˈbruːtəli/","extraExplanation":["“nonbrutally”并不常见，更自然的表达通常是“not brutally”或用更具体的副词，如“gently（温和地）/humanely（人道地）/without violence（不使用暴力地）”。在正式写作中使用“non-”前缀有时是为了强调“与……相反/不具有……特征”。"]}
{"word":"nonbudding","summary":{"en":"Nonbudding means not forming buds or not reproducing by budding, mainly used in biology.","zh":"Nonbudding 指“不出芽的/不通过出芽繁殖的”，主要用于生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not producing buds or not reproducing by budding (used especially in biology)","zh":"不出芽的；不通过出芽方式繁殖的（尤用于生物学）"},"examples":[{"en":"Yeast normally reproduces by budding, but some mutants are nonbudding.","zh":"酵母通常通过出芽繁殖，但有些突变体是不出芽的。"},{"en":"The study compared budding and nonbudding cells under stress.","zh":"该研究比较了压力条件下出芽细胞与不出芽细胞。"}]},{"partOfSpeech":"adj.","definition":{"en":"not forming flower or leaf buds (used in botany or everyday description)","zh":"不长花芽/叶芽的；未形成芽的（用于植物学或日常描述）"},"examples":[{"en":"Several branches stayed nonbudding after the cold snap.","zh":"寒潮过后，有几根枝条一直没有长芽。"},{"en":"We pruned the nonbudding stems to help the plant focus its energy.","zh":"我们修剪了不长芽的茎，帮助植物集中养分。"}]}],"synonyms":["not budding","budless","non-budding"],"phonetic":"/ˌnɑnˈbʌdɪŋ/","extraExplanation":["“non-”是常见前缀，表示“非、无、不”。“nonbudding”多见于科研写作（如微生物学、细胞生物学）中，用来对比“budding（出芽的）”与“不出芽的”细胞/菌株。日常英语里更常说“not budding”或“not producing buds”。"]}
{"word":"nonbulbaceous","summary":{"en":"A botanical adjective meaning “not bulb-forming; not growing from a bulb.”","zh":"一个植物学形容词，表示“非鳞茎的；不形成鳞茎、不从鳞茎生长的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bulbaceous; not forming or growing from a bulb (in botany).","zh":"（植物学）非鳞茎的；不形成鳞茎、也不从鳞茎生长的。"},"examples":[{"en":"Carrots are nonbulbaceous vegetables because they grow from a taproot, not a bulb.","zh":"胡萝卜属于非鳞茎类蔬菜，因为它是由直根生长，而不是由鳞茎生长。"},{"en":"The gardener grouped bulbaceous and nonbulbaceous plants in separate beds.","zh":"园丁把鳞茎植物和非鳞茎植物分开种在不同的花坛里。"}]}],"synonyms":["non-bulb-forming","nonbulb-forming"],"phonetic":"/ˌnɑn.bʌlˈbeɪ.ʃəs/","extraExplanation":["这是一个较少见的植物学描述词，由前缀 non-（“非、不”）+ bulbaceous（“鳞茎的”）构成。常用于园艺、植物分类或种植说明中，用来区分像郁金香、洋葱这类“鳞茎植物”与其他根系类型（如直根、须根、根茎等）的植物。","bulb（鳞茎）指一种地下储存器官，外形常呈球状，能储存养分并在合适季节重新发芽；因此“nonbulbaceous”强调“没有这种鳞茎结构”。"]}
{"word":"nonbulbar","summary":{"en":"“Nonbulbar” is a medical adjective meaning “not involving bulbar (brainstem/medulla-related) functions like speech and swallowing.”","zh":"“Nonbulbar”是医学形容词，意为“不涉及球部（延髓/脑干相关）功能，如说话与吞咽”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving the bulbar region (the brainstem/medulla) or the nerves controlling speech and swallowing; used especially in medicine (e.g., in “nonbulbar ALS”).","zh":"（医学）不涉及延髓/脑干“球部”（bulbar）区域或其支配说话、吞咽等功能的神经；常用于医学描述（如“非球部型 ALS”）。"},"examples":[{"en":"The doctor said her symptoms were consistent with nonbulbar ALS.","zh":"医生说她的症状符合非球部型 ALS（肌萎缩侧索硬化症）。"},{"en":"In nonbulbar cases, speech and swallowing may be less affected early on.","zh":"在非球部型病例中，早期说话和吞咽可能受影响较小。"}]}],"synonyms":["extrabulbar","non-bulbar"],"phonetic":"/ˌnɑnˈbʌl.bɚ/","extraExplanation":["“bulbar”来自“bulb”（早期解剖学对延髓外形的形容），临床上常指与延髓及其支配的舌、咽、喉相关的功能（发音、吞咽、咳嗽反射等）。因此“nonbulbar”多用于区分：症状主要不在这些“球部”功能上，而可能更多表现为四肢无力等。","这是专业医学用词，日常英语中很少单独使用，常见搭配包括：nonbulbar onset（非球部起病）、nonbulbar symptoms（非球部症状）。"]}
{"word":"nonbulbiferous","summary":{"en":"A botanical adjective meaning a plant does not form bulbs or bulblets.","zh":"植物学形容词，指植物不形成鳞茎或小鳞茎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Not producing bulbs or bulblets (small bulb-like structures used for reproduction).","zh":"（植物学）不生鳞茎或不产生小鳞茎（用于繁殖的鳞茎状小结构）。"},"examples":[{"en":"Garlic is bulbiferous, but many grasses are nonbulbiferous.","zh":"大蒜是生鳞茎的，但许多禾本科植物是不生鳞茎的。"},{"en":"The guide described the plant as nonbulbiferous and spreading mainly by seeds.","zh":"导览资料把这种植物描述为不生鳞茎，主要靠种子扩散。"}]}],"synonyms":["not bulb-bearing","without bulbs","abulbous (less common)"],"phonetic":"/ˌnɑn.bʌlˈbɪf.ɚ.əs/","extraExplanation":["这个词多用于植物分类或形态描述：bulbiferous 表示“能长出鳞茎/小鳞茎（bulb/bulblet）”，加上 non- 变为否定。常见于植物志、园艺或学术写作中，日常口语里不常用。"]}
{"word":"nonbulbous","summary":{"en":"“Nonbulbous” means “not bulb-shaped; not swollen and round.”","zh":"“nonbulbous”表示“不是球状的；不圆鼓膨大”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bulbous; not shaped like a bulb (not rounded and swollen).","zh":"非球状的；不呈球形（不圆鼓、不过度膨大）的。"},"examples":[{"en":"The plant has a nonbulbous root system, so it doesn’t store water in a swollen base.","zh":"这种植物的根系是非球状的，所以不会在膨大的基部储存水分。"},{"en":"Choose a nonbulbous container if you want straight, clean lines in the design.","zh":"如果你想要设计线条笔直、干净利落，就选一个非球状的容器。"}]}],"synonyms":["not bulbous","non-swollen","not bulb-shaped"],"phonetic":"/ˌnɑnˈbʌlbəs/","extraExplanation":["“non-”是英语里很常见的否定前缀，表示“不是/非”。“bulbous”来自“bulb（球茎/球状物）”，常用来描述形状（如鼻子、容器、灯泡状结构）或植物器官（如球茎）。因此“nonbulbous”多见于较正式或技术性的写作（植物学、医学、工程设计等），日常口语里更常说“not bulbous”。"]}
{"word":"nonbulkhead","summary":{"en":"“Nonbulkhead” means not a bulkhead or not intended to function as a bulkhead, mainly used in technical contexts.","zh":"“nonbulkhead”指“非舱壁的/不作为舱壁的”，主要用于工程技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not designed as, made of, or acting as a bulkhead (a strong partition wall, especially in ships, aircraft, or buildings).","zh":"非舱壁的；不作为（或不构成）舱壁/隔舱壁（指船舶、飞机或建筑中用于分隔并起加固作用的坚固隔墙）。"},"examples":[{"en":"The cable must pass through a nonbulkhead panel, not the ship’s bulkhead.","zh":"电缆必须穿过一个非舱壁面板，而不是穿过船体舱壁。"},{"en":"They labeled it a nonbulkhead opening, so it didn’t need the same watertight seal.","zh":"他们把它标为“非舱壁开口”，所以不需要同样等级的水密密封。"}]}],"synonyms":["non-bulkhead","nonstructural (in some contexts)","nonwatertight (in some contexts)"],"phonetic":"/ˌnɑnˈbʌlkhɛd/","extraExplanation":["“nonbulkhead”并不是日常英语里常见的词，更常见的写法是带连字符的 **non-bulkhead**，多见于工程/船舶/航空的图纸、规范或零件说明中。","理解它的关键是先掌握 **bulkhead（舱壁/隔舱壁）**：它通常是结构性很强、可能需要防火/水密/承压的隔墙；因此“nonbulkhead”往往暗示该部位不承担这些舱壁级别的结构或密封要求（但具体仍要以规范为准）。"]}
{"word":"nonbuoyancy","summary":{"en":"Nonbuoyancy means a lack of buoyancy—the condition of not floating or not rising in a fluid.","zh":"Nonbuoyancy 指“无浮力/缺乏浮力”，即在流体中不能漂浮或上升的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of not being buoyant; lack of ability to float or rise in a fluid (usually water or air).","zh":"无浮力；不具漂浮能力的状态（通常指在水或空气等流体中不能浮起或上升）。"},"examples":[{"en":"The diver adjusted the weights to avoid nonbuoyancy and maintain neutral buoyancy.","zh":"潜水员调整配重以避免“无浮力”的状态，并保持中性浮力。"},{"en":"Engineers tested the material’s nonbuoyancy to ensure it would stay submerged.","zh":"工程师测试该材料的无浮力特性，以确保它会保持在水下。"}]}],"synonyms":["lack of buoyancy","negative buoyancy","nonflotation"],"phonetic":"/ˌnɑnˈbɔɪənsi/","extraExplanation":["“nonbuoyancy”在日常英语中很少见，更常见的说法是“lack of buoyancy（缺乏浮力）”或在潜水语境里说“negative buoyancy（负浮力，往下沉）”。“non-”是前缀，表示“非/无”。","浮力（buoyancy）与阿基米德原理有关：物体在流体中会受到向上的浮力；当浮力小于重力时就会下沉，可描述为“negative buoyancy”或“lack of buoyancy”。"]}
{"word":"nonbuoyant","summary":{"en":"Nonbuoyant means not able to float easily, and sometimes figuratively means not cheerful or upbeat.","zh":"nonbuoyant 指“不易漂浮/不具浮力”，有时也可比喻“不轻快、不乐观”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to float easily; tending to sink in a liquid.","zh":"不具浮力的；不易漂浮的；容易下沉的。"},"examples":[{"en":"The rock is nonbuoyant, so it sinks immediately in water.","zh":"石头不具浮力，所以一放进水里就立刻下沉。"},{"en":"Engineers tested the nonbuoyant material to make sure it would stay underwater.","zh":"工程师测试这种不具浮力的材料，以确保它能保持在水下。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Not light, cheerful, or optimistic; lacking an “uplifted” mood.","zh":"（比喻）不轻快的；不乐观的；缺少振奋感的。"},"examples":[{"en":"After the bad news, the conversation became nonbuoyant and quiet.","zh":"听到坏消息后，谈话气氛变得不轻快，很安静。"},{"en":"The film has a nonbuoyant tone, focusing on loss and recovery.","zh":"这部电影的基调不轻快，聚焦于失去与复原。"}]}],"synonyms":["not buoyant","sinking","heavy (figurative)","downbeat (figurative)"],"phonetic":"/ˌnɑnˈbɔɪənt/","extraExplanation":["“buoyant”既可指物理上的“有浮力、能漂浮”，也常用来形容情绪“轻快、乐观”。加上前缀 non- 表示否定，就形成 nonbuoyant。","在科学/工程语境中更常见第一义（不易漂浮）；第二义较少见，日常表达里更常用 not very cheerful / not upbeat 来替代。"]}
{"word":"nonbuoyantly","summary":{"en":"Nonbuoyantly means “not buoyantly”: either sinking/not floating, or (more figuratively) not cheerfully.","zh":"nonbuoyantly 意为“非轻快/非有浮力地”：可指不漂浮、下沉；也可比喻情绪不振、缺乏乐观。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not buoyant; without floating or rising in a liquid (tending to sink).","zh":"以不具浮力的方式；在液体中不漂浮、不上浮（倾向下沉）。"},"examples":[{"en":"The stone dropped into the pond and sank nonbuoyantly to the bottom.","zh":"石头掉进池塘里，毫无浮力地沉到水底。"},{"en":"Because the foam was waterlogged, it moved nonbuoyantly in the tank.","zh":"因为泡沫吸饱了水，它在水箱里呈现不漂浮的状态。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not light or cheerful; without a buoyant mood.","zh":"以不轻快、不乐观的方式；情绪不振地。"},"examples":[{"en":"He answered nonbuoyantly, as if the news had drained his energy.","zh":"他无精打采地回答，仿佛消息抽走了他的力气。"},{"en":"The team left the field nonbuoyantly after the late loss.","zh":"球队在最后时刻失利后情绪低落地离开了球场。"}]}],"synonyms":["without buoyancy","sinking","heavily","gloomily","without enthusiasm"],"phonetic":"/ˌnɑnˈbɔɪəntli/","extraExplanation":["“non-”是否定前缀，表示“不是/不具备”。“buoyant”既可指物理上的“有浮力、能漂浮”，也可指心理上的“轻快、乐观”。“nonbuoyantly”非常少见，更常见的表达是：物理语境用“without buoyancy / sinking”，情绪语境用“gloomily / without enthusiasm”。"]}
{"word":"nonburdensome","summary":{"en":"“Nonburdensome” means easy and not causing a burden or stress.","zh":"“nonburdensome”表示“轻松不费力、不会造成负担或压力”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not difficult, heavy, or stressful to do; easy to handle and not causing trouble.","zh":"不费力的；不沉重的；不造成负担的。"},"examples":[{"en":"The app is designed to be nonburdensome for older users.","zh":"这款应用的设计目标是让年长用户用起来不费力。"},{"en":"She asked for a nonburdensome way to help, like making a few phone calls.","zh":"她希望用一种不造成负担的方式来帮忙，比如打几个电话。"}]}],"synonyms":["easy","manageable","light","undemanding","low-effort","hassle-free"],"phonetic":"/ˌnɑnˈbɝdənsoʊm/","extraExplanation":["“non-”是否定前缀，表示“非、不”；“burdensome”来自“burden（负担）+ -some（……的）”，合起来就是“造成负担的”。因此“nonburdensome”多见于较正式的语境（如说明书、政策、学术写作），日常口语里也常用更简单的表达，如“easy,” “not a big deal,” “low-effort,” “no-hassle”。"]}
{"word":"nonburdensomely","summary":{"en":"“Nonburdensomely” means doing something in a way that doesn’t create extra trouble or pressure for others.","zh":"“nonburdensomely”表示以不造成额外麻烦或压力的方式去做某事，即“不构成负担地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not cause difficulty, stress, or extra work for someone; without being a burden.","zh":"以不造成困难、压力或额外工作量的方式；不构成负担地。"},"examples":[{"en":"The app helps you track expenses nonburdensomely, with quick reminders instead of long forms.","zh":"这个应用用快速提醒而不是冗长表格，让你不费力地记录开支。"},{"en":"She offered feedback nonburdensomely, keeping it brief and kind.","zh":"她以不让人有压力的方式提出反馈，简短而友善。"}]}],"synonyms":["unobtrusively","easily","lightly","without burdening","with minimal effort"],"phonetic":"/ˌnɑnˈbɝdən.səm.li/","extraExplanation":["这个词非常少见，更自然的表达通常是：“without being burdensome / in a way that isn’t burdensome / unobtrusively / with minimal effort”。","构词：non-（否定前缀）+ burdensome（沉重的、麻烦的）+ -ly（副词后缀）。在正式写作或学术语境里偶尔会见到，但口语里基本不用。"]}
{"word":"nonburdensomeness","summary":{"en":"Nonburdensomeness means the quality of not being a burden—something that feels easy and manageable.","zh":"Nonburdensomeness 指“不造成负担”的特性：让人感觉轻松、好处理、好应对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not being a burden; being easy to handle, accept, or manage.","zh":"“不造成负担”的特性；指容易处理、接受或管理，不会让人感到压力或累赘。"},"examples":[{"en":"The app’s nonburdensomeness makes it easy for beginners to use.","zh":"这款应用的“不造成负担”让新手也能轻松上手。"},{"en":"She appreciated the nonburdensomeness of the request—it took only a minute.","zh":"她很感谢这个请求没有负担——只需要一分钟。"},{"en":"Good design aims for nonburdensomeness: clear steps and minimal effort.","zh":"好的设计追求“不造成负担”：步骤清晰、付出最少。"}]}],"synonyms":["ease","simplicity","lightness","manageability","convenience"],"phonetic":"/ˌnɑnˈbɝdəsəmˌnɛs/","extraExplanation":["这个词比较少见，通常会用更常见的表达来替代，比如：ease（轻松）、simplicity（简洁）、low burden（低负担）、not burdensome（不费事/不麻烦）。","构词法：non-（否定前缀）+ burdensome（繁重的/造成负担的）+ -ness（名词后缀，表示“……的性质/状态”）。因此意思直观：\"不繁重\"的性质。","使用场景：多见于较正式或学术语境（例如政策、医疗、心理学量表或产品设计），用来强调“对他人/系统不会造成额外负担”。"]}
{"word":"nonbureaucratic","summary":{"en":"Nonbureaucratic describes something that avoids complicated official rules and paperwork, focusing on simple, flexible action.","zh":"nonbureaucratic 用来形容不走繁琐官僚程序、强调简单灵活与效率的做法或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bureaucratic; not controlled by complicated official rules, paperwork, or rigid administrative procedures.","zh":"非官僚式的；不受繁琐公文、规章和僵化行政流程所控制的。"},"examples":[{"en":"We want a nonbureaucratic process so people can get help quickly.","zh":"我们希望流程不要官僚化，这样人们可以更快得到帮助。"},{"en":"The startup has a nonbureaucratic culture where decisions are made fast.","zh":"这家初创公司有一种非官僚式的文化，决策速度很快。"},{"en":"They promised a nonbureaucratic way to apply, with fewer forms and shorter waiting times.","zh":"他们承诺用一种非官僚式的申请方式：表格更少、等待时间更短。"}]}],"synonyms":["unbureaucratic","informal","flexible","streamlined","efficient","agile","red-tape-free"],"phonetic":"/ˌnɑnˌbjʊrəˈkrætɪk/","extraExplanation":["“non-”是英语里很常见的否定前缀，表示“非……、不是……”。因此 nonbureaucratic = not bureaucratic（不官僚的）。","bureaucratic 常带有负面语气，暗示“程序繁琐、效率低、层级多”。nonbureaucratic 往往用于强调“简单、灵活、以解决问题为导向”。","这个词在正式写作中更常见；日常口语里也可以说 “not bureaucratic” 或 “less red tape（更少繁文缛节）”。"]}
{"word":"nonbureaucratically","summary":{"en":"nonbureaucratically = in a simple, flexible way without unnecessary official procedures.","zh":"nonbureaucratically = 不走官僚程序、简化灵活地处理。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not bureaucratic; done simply, flexibly, and without excessive rules, paperwork, or official procedures.","zh":"以非官僚的方式；做事简化、灵活，不走繁琐规章、文件或正式程序。"},"examples":[{"en":"The team solved the problem nonbureaucratically by talking directly to the people involved.","zh":"团队用非官僚的方式解决问题：直接和相关人员沟通。"},{"en":"We handled the request nonbureaucratically—no forms, just a quick email approval.","zh":"我们用非官僚的方式处理了请求——不用填表，只需邮件快速批准。"}]}],"synonyms":["simply","informally","flexibly","without red tape"],"phonetic":"/ˌnɑnˌbjʊrəˈkrætɪkli/","extraExplanation":["这个词由 non-（不、非）+ bureaucratic（官僚的/按繁文缛节办事的）+ -ly（副词后缀）构成，意思是“以不官僚、不繁琐的方式”。在口语和正式写作中都能用，但更常见的表达还有：simply（简单地）、informally（非正式地）、without red tape（不走官僚程序）。注意：nonbureaucratically 强调“避免官僚作风/繁文缛节”，不等同于“非法”或“违规”。"]}
{"word":"nonburgage","summary":{"en":"Nonburgage is a historical legal term for town land held under a tenure other than burgage.","zh":"nonburgage 是历史法律用语，指城镇土地不是按 burgage（市镇保有权）而是按其他保有权持有。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical British law) A kind of landholding in a town that is not held by burgage (the usual town tenure), but by some other tenure, often linked to a manor or to non‑town (rural/feudal) obligations.","zh":"（英国历史法律）一种“非市镇保有权”的城镇土地持有方式：土地不按常见的“burgage（市镇保有权）”持有，而是按其他保有权（常与庄园或非城镇的封建义务相关）持有。"},"examples":[{"en":"The record says the plot was held in nonburgage tenure, not by burgage.","zh":"记录写明这块地是以 nonburgage 保有权持有，而不是以 burgage 持有。"},{"en":"Some properties inside the town boundaries were treated as nonburgage because they remained tied to a manor.","zh":"城镇范围内的一些房产因仍隶属庄园而被视为 nonburgage。"}]}],"synonyms":["non-burgage tenure","nonburgage tenure"],"phonetic":"/ˌnɑnˈbɝɡɪdʒ/","extraExplanation":["在中世纪到近代早期的英格兰，城镇里常见的土地权利是“burgage（市镇保有权）”，通常与向城镇领主缴纳固定地租有关。nonburgage 指“不属于这种城镇保有权”的情况：虽然地在城里或靠近城，但法律上仍按其他体系（例如庄园的封建地租或劳役等）来认定与管理。","这个词多见于历史地契、地产调查（surveys）、古法律文书与地方史研究中，现代日常英语几乎不用。"]}
{"word":"nonburgess","summary":{"en":"“Nonburgess” means someone who is not a burgess (not an officially recognized citizen/freeman of a borough).","zh":"“nonburgess”指不具有自治镇（borough）市民/自由民身份的人，通常不享有相关地方权利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a burgess (not a citizen/freeman of a town or borough, and therefore not entitled to certain local rights or privileges)","zh":"非市民／非（自治镇的）自由民；指不具有某城镇（borough）市民/自由民身份，因此通常不享有某些地方权利或特权的人"},"examples":[{"en":"In the old town records, nonburgesses could not vote in local elections.","zh":"在旧城镇档案中，非市民通常不能参加地方选举投票。"},{"en":"Only burgesses could trade in the market; nonburgesses needed permission.","zh":"只有市民/自由民可以在市场交易；非市民需要获得许可。"}]}],"synonyms":["non-citizen (historical context)","outsider","non-freeman (historical)"],"phonetic":"/ˌnɑnˈbɝɡəs/","extraExplanation":["“burgess”是历史用语，常见于英国（以及受其制度影响地区）的城镇自治与选举制度中，指拥有某个borough的正式身份（类似“本城自由民/有资格的市民”），可能享有投票、经商、参与市政等权利。“nonburgess”因此多见于历史文献、法律文本或地方志，现代日常英语里很少用。","构词：non-（不、非）+ burgess（市民/自治镇自由民）。在阅读历史材料时，它通常是在对比“burgess vs. nonburgess（有资格者 vs. 无资格者）”。"]}
{"word":"nonburnable","summary":{"en":"“Nonburnable” describes something that does not burn (or is very hard to ignite), often used for materials and safety contexts.","zh":"nonburnable 指“不可燃/不易燃”，多用于材料与安全（如建筑、防火）语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to burn easily or at all; resistant to catching fire.","zh":"不可燃的；不易燃的；耐火的。"},"examples":[{"en":"The building code requires nonburnable materials in the stairwell.","zh":"建筑规范要求楼梯间使用不可燃材料。"},{"en":"Store chemicals in nonburnable containers and keep them away from heat.","zh":"把化学品存放在不易燃的容器里，并远离热源。"}]}],"synonyms":["nonflammable","non-combustible","fire-resistant","flame-retardant"],"phonetic":"/ˌnɑnˈbɝnəbəl/","extraExplanation":["“nonburnable”更常见的同义表达是“nonflammable”或“non-combustible”。其中：\n- nonflammable：日常与安全标识中很常见，强调“不易被点燃”。\n- non-combustible：偏技术/规范用语，常用于建筑材料分类，强调“不会燃烧”。\n注意：在某些标准里，“nonburnable”可能并不等于“完全不会燃烧”，而是指在特定条件下不支持燃烧；遇到安全/法规语境最好对照具体标准（如建筑规范或产品说明）。"]}
{"word":"nonburning","summary":{"en":"Nonburning means “not burning now,” and sometimes “not easily burned,” especially when describing materials.","zh":"nonburning 表示“没有在燃烧”，也可指“（材料）不易燃/耐燃”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not burning; without flames, heat, or active combustion at the moment described","zh":"不在燃烧的；没有火焰、热量或正在进行的燃烧（指当下状态）"},"examples":[{"en":"The candle was nonburning because the wick was wet.","zh":"蜡烛没有在燃烧，因为烛芯是湿的。"},{"en":"Make sure the coals are completely nonburning before you throw them away.","zh":"在丢弃煤炭之前，确保它们已经完全不再燃烧。"}]},{"partOfSpeech":"adj.","definition":{"en":"not designed to burn easily; resistant to catching fire (often used for materials, though “nonflammable” is more common)","zh":"不易燃的；耐燃的（常用于材料，但更常见的说法是 nonflammable）"},"examples":[{"en":"They chose a nonburning fabric for the stage curtains to reduce fire risk.","zh":"他们选择了耐燃的布料做舞台幕布，以降低火灾风险。"},{"en":"Use nonburning insulation around the heater.","zh":"在加热器周围使用耐燃的隔热材料。"}]}],"synonyms":["not burning","unlit","extinguished","nonflammable","flame-resistant"],"phonetic":"/ˌnɑnˈbɝnɪŋ/","extraExplanation":["拼写上常见两种形式：nonburning 与 non-burning（加连字符）。作定语放在名词前时更常见 non-burning（例如 non-burning gas / non-burning material）；作表语或描述状态时两者都可见（例如 The candle is nonburning）。","在安全或工程语境中，如果你想表达“不会燃烧/不可燃”，更标准、更明确的词通常是 nonflammable（不可燃的）或 flame-resistant（阻燃的）。nonburning 有时更像是在说“当前没有在燃烧”。"]}
{"word":"nonbursting","summary":{"en":"Nonbursting means “not bursting or not ruptured,” often used in technical or medical contexts.","zh":"nonbursting 意为“不会爆裂的/未破裂的”，常用于技术或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not bursting, exploding, or breaking open; not likely to burst.","zh":"不爆裂的；不会破裂或爆炸的。"},"examples":[{"en":"The engineer chose a nonbursting container to store pressurized gas more safely.","zh":"工程师选择了不爆裂的容器来更安全地储存加压气体。"},{"en":"They tested the nonbursting hose at high pressure before using it on the job.","zh":"他们在正式使用前对不爆裂的软管进行了高压测试。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical/technical) Not ruptured; not having burst (e.g., a nonbursting aneurysm).","zh":"（医学/技术）未破裂的；没有发生破裂的（如“未破裂动脉瘤”）。"},"examples":[{"en":"A nonbursting aneurysm may be monitored regularly instead of treated immediately.","zh":"未破裂动脉瘤可能会先定期监测，而不是立刻治疗。"},{"en":"The scan showed a nonbursting lesion, so the risk was lower than expected.","zh":"扫描显示病灶未破裂，因此风险比预想的更低。"}]}],"synonyms":["unbursting","unruptured","intact","nonexplosive"],"phonetic":"/ˌnɑnˈbɝstɪŋ/","extraExplanation":["“nonbursting”常见写法也包括“non-bursting”（更常见、也更易读）。在正式写作或技术/医学语境中，带连字符的形式更常用。"]}
{"word":"nonbusily","summary":{"en":"“Nonbusily” means “not in a busy way,” but it’s rare; “leisurely” or “unhurriedly” is more natural.","zh":"“nonbusily”表示“并不忙碌/不匆忙地”，但很少用；更自然的说法常用“leisurely / unhurriedly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not busy; without hurry or intense activity.","zh":"不忙碌地；不匆忙地；不紧张地。"},"examples":[{"en":"After the deadline, the office worked nonbusily for a few days.","zh":"截止日期过后，办公室有几天都不怎么忙。"},{"en":"She nonbusily sipped her tea and watched the rain.","zh":"她不紧不慢地啜着茶，看着雨。"}]}],"synonyms":["leisurely","unhurriedly","calmly","at an easy pace"],"phonetic":"/nɑnˈbɪzəli/","extraExplanation":["“nonbusily”非常少见，更多时候英语会直接说“not busily”，或用更自然的副词如“leisurely（悠闲地） / unhurriedly（不慌不忙地） / calmly（平静地）”。","构词法：non-（否定前缀，表示“非、没有”）+ busily（忙碌地）。在正式写作中，读者可能觉得这个词生硬或刻意。"]}
{"word":"nonbusiness","summary":{"en":"Nonbusiness means not related to business or work; it can also mean non-work matters.","zh":"nonbusiness 指“非商业/非工作的”；也可作名词表示“与工作无关的事务”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to business or commercial activity; personal or social rather than professional.","zh":"非商业的；与生意或工作无关的；偏个人或社交而非职业的。"},"examples":[{"en":"Please use this phone line for nonbusiness calls only.","zh":"请这条电话线只用于非公务/非工作通话。"},{"en":"They chatted about nonbusiness topics during lunch.","zh":"他们午饭时聊的是与工作无关的话题。"},{"en":"Her trip was mostly nonbusiness, so she couldn’t expense the hotel.","zh":"她这次出行主要不是出差，所以酒店费用不能报销。"}]},{"partOfSpeech":"n.","definition":{"en":"Matters or activities that are not business-related.","zh":"非公务/非商业事务；与工作无关的活动。"},"examples":[{"en":"Let’s finish the nonbusiness first, then we can discuss the contract.","zh":"我们先把非公务的事处理完，再谈合同。"},{"en":"The meeting stayed focused on business, with little time for nonbusiness.","zh":"会议一直聚焦工作内容，几乎没时间谈与工作无关的事。"}]}],"synonyms":["noncommercial","personal","private","non-work","unofficial"],"phonetic":"/ˌnɑnˈbɪznəs/","extraExplanation":["拼写上常见两种：**nonbusiness**（不加连字符）和 **non-business**（加连字符）。一般来说，放在名词前作定语时（如 non-business hours）加连字符更清晰；但很多现代写作也会直接写 nonbusiness。","在职场语境里，nonbusiness 常对应 **personal / private**（私人的）或 **non-work**（非工作的）；用于报销、差旅等场景时，常和 **business trip / personal trip** 形成对比。"]}
{"word":"nonbusy","summary":{"en":"“Nonbusy” means “not busy; free/available.” It’s understandable but less common than “not busy.”","zh":"“nonbusy”表示“不忙的；有空的”，能理解但不如“not busy”常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not busy; having no work or few things to do at the moment.","zh":"不忙的；目前没什么事做的。"},"examples":[{"en":"Are you nonbusy this afternoon? I’d like to talk for a few minutes.","zh":"你今天下午不忙吗？我想聊几分钟。"},{"en":"Choose a nonbusy time to visit the office, like early morning.","zh":"选一个不忙的时候去办公室，比如一大早。"},{"en":"The café is nonbusy on weekdays, so it’s easier to find a seat.","zh":"这家咖啡馆工作日不太忙，所以更容易找到座位。"}]}],"synonyms":["not busy","free","available","idle","unoccupied","quiet (time)"],"phonetic":"/ˌnɑnˈbɪzi/","extraExplanation":["“nonbusy”在日常英语里不算常见，更自然的说法通常是“not busy”“free”“available”“quiet（不忙/清闲的时段）”。","写法上也可能见到“non-busy”（加连字符），尤其在标注“非高峰/不繁忙时段”时，例如“non-busy hours”。"]}
{"word":"nonbusyness","summary":{"en":"Nonbusyness means “not being busy”—a period or feeling of having little to do.","zh":"nonbusyness 指“不忙”，强调事情不多、较清闲的一段时间或一种状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not being busy; having free time or a lack of activity","zh":"不忙的状态；空闲、清闲；（活动/事务的）稀少"},"examples":[{"en":"I miss the nonbusyness of summer break, when days felt wide open.","zh":"我怀念暑假的那种不忙的状态，那时每天都显得很充裕。"},{"en":"The shop’s nonbusyness in the afternoon makes it a good time to visit.","zh":"这家店下午不太忙，所以很适合去逛。"}]}],"synonyms":["free time","leisure","downtime","a lull","quiet period"],"phonetic":"/ˌnɑnˈbɪzinəs/","extraExplanation":["“nonbusyness”由前缀 non-（不、非）+ busyness（忙碌）构成，但在日常英语中比较少见，更多时候会用更自然的说法：free time（空闲时间）、leisure（闲暇）、a lull（短暂的清淡/空档）、not being busy（不忙）。","语气上，“nonbusyness”常带一点刻意、幽默或强调对比的感觉：不是“很闲很享受”的那种 leisure，而是单纯强调“没有忙起来”。"]}
{"word":"nonbuttressed","summary":{"en":"Nonbuttressed means not supported by buttresses; it can also mean not reinforced or backed up (figuratively).","zh":"nonbuttressed 指“无扶壁支撑的”；也可比喻“缺乏支撑/依据的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not supported or strengthened by buttresses (side supports), especially in architecture","zh":"（尤指建筑）没有用扶壁/支撑拱墙加固的；无扶壁支撑的"},"examples":[{"en":"The architect chose a nonbuttressed wall, so the design required thicker stone to stay stable.","zh":"建筑师选择了无扶壁支撑的墙体，因此设计需要更厚的石材来保持稳固。"},{"en":"A nonbuttressed structure can still be strong, but it must rely on other engineering solutions.","zh":"无扶壁支撑的结构仍然可能很坚固，但必须依赖其他工程方案。"}]},{"partOfSpeech":"adj.","definition":{"en":"not supported or reinforced (used figuratively for ideas, arguments, or systems)","zh":"（比喻）没有支持或支撑的；缺乏依据或后盾的（用于观点、论证、体系等）"},"examples":[{"en":"His claim sounded confident, but it was nonbuttressed by evidence.","zh":"他的说法听起来很自信，但缺乏证据支撑。"},{"en":"A nonbuttressed argument is easy to challenge in a debate.","zh":"缺乏支撑的论点在辩论中很容易被质疑。"}]}],"synonyms":["unsupported","unreinforced","unbraced","unshored"],"phonetic":"/ˌnɑnˈbʌtrəst/","extraExplanation":["“buttress”原意是建筑上的“扶壁/支墙”，常见于哥特式教堂等，用来把拱顶或高墙的侧向压力分散到外侧支撑上。英语里它也常作动词，表示“支持、巩固（观点/制度）”，所以 nonbuttressed 在抽象语境中可理解为“没有依据/没有后盾”。","拼写提示：non- 是“非/无”的前缀；buttressed 是 buttress 的过去分词作形容词用，表示“被支撑的”。"]}
{"word":"nonbuying","summary":{"en":"“Nonbuying” means not buying, or the behavior/state of not making a purchase, often used in business or marketing.","zh":"“Nonbuying”表示“不购买”，也可指“不购买的行为/状态”，常用于商业或营销语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not buying; involving a person or group that does not make a purchase.","zh":"不购买的；指某人或某群体没有进行购买行为的。"},"examples":[{"en":"The survey compared buying and nonbuying customers.","zh":"这项调查比较了购买客户和不购买客户。"},{"en":"Nonbuying visitors still help the website by increasing traffic.","zh":"即使不购买的访客也能通过增加流量来帮助网站。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or state of not purchasing something (often used in business, marketing, or research contexts).","zh":"不购买的行为或状态（常用于商业、营销或研究语境）。"},"examples":[{"en":"The study looked at reasons for nonbuying.","zh":"研究分析了人们不购买的原因。"},{"en":"Nonbuying can happen when the price feels too high.","zh":"当价格让人觉得太高时，就可能出现不购买。"}]}],"synonyms":["not buying","no-purchase","non-purchasing"],"phonetic":"/nɑnˈbaɪɪŋ/","extraExplanation":["“nonbuying”更常见的写法是加连字符的“non-buying”，尤其在正式写作中更清晰。它由前缀“non-（非、不）”+“buying（购买）”构成，多用于市场营销、消费者研究等领域（如：non-buying customers/behavior）。日常口语里，人们更常说“not buying”或“didn’t buy”。"]}
