{"word":"nonhabitability","summary":{"en":"Nonhabitability means a condition in which a place is not safe or suitable to live in.","zh":"nonhabitability 指某处不安全或不适合居住的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being not suitable for people (or other living things) to live in; uninhabitability","zh":"不宜居状态；不适合（人或其他生物）居住的状况；不可居住性"},"examples":[{"en":"The building’s nonhabitability was confirmed after the fire damaged the wiring and plumbing.","zh":"火灾破坏了电线和管道后，这栋楼被确认处于不宜居状态。"},{"en":"Extreme heat and lack of water can lead to the nonhabitability of an area.","zh":"极端高温和缺水会导致某个地区变得不宜居。"}]}],"synonyms":["uninhabitability","unlivability","unsuitability for habitation"],"phonetic":"/ˌnɑnˌhæbəˈtæbəlɪti/","extraExplanation":["“nonhabitability”由前缀 non-（表示“否定、非”）+ habitability（宜居性）构成，常见于法律/房屋租赁、工程安全、城市规划与环境科学语境。","在租房与建筑法规中，常见搭配有 “declare a property uninhabitable / in a state of nonhabitability”（宣布房屋不可居住/处于不宜居状态），可能涉及维修义务、搬离安排与赔偿等。"]}
{"word":"nonhabitable","summary":{"en":"Nonhabitable means not safe or suitable for people to live in.","zh":"nonhabitable 指“不安全或不适合人居住的、不宜居的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not suitable or safe for people to live in; not fit for human habitation.","zh":"不适合（或不安全）供人居住的；不宜居的。"},"examples":[{"en":"After the fire, the apartment was declared nonhabitable.","zh":"火灾之后，这套公寓被宣布为不适合居住。"},{"en":"The building is nonhabitable until the water damage is repaired.","zh":"在水害修复之前，这栋楼都不适合居住。"},{"en":"In winter, the cabin can become nonhabitable without heating.","zh":"冬天没有供暖的话，这间小木屋可能会变得不宜居。"}]}],"synonyms":["uninhabitable","unlivable","unfit for habitation","not fit to live in"],"phonetic":"/ˌnɑnˈhæbɪtəbəl/","extraExplanation":["常见于房屋租赁、物业检查、保险理赔、政府公告等语境，表示“达不到基本居住标准”（如供水供电、供暖、结构安全、卫生条件等）。","词形结构：non-（否定前缀）+ habitable（可居住的）。相近表达有 uninhabitable / unfit for habitation。注意：nonhabitable 强调“不可住”，不一定表示“没人住”（那通常是 uninhabited）。"]}
{"word":"nonhabitableness","summary":{"en":"Nonhabitableness means the condition of being unsafe or unsuitable for people to live in.","zh":"nonhabitableness 指“（某处）不安全或不适合人居住的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being not fit or safe for people to live in; uninhabitability","zh":"不适于居住的状态；不可居住性"},"examples":[{"en":"The building was condemned because of its nonhabitableness after the fire.","zh":"这栋楼在火灾后因不适于居住而被判定为危楼。"},{"en":"Long droughts can increase the nonhabitableness of a region.","zh":"长期干旱会加剧某个地区的不适居住性。"},{"en":"Mold, broken heating, and unsafe wiring all contributed to the apartment’s nonhabitableness.","zh":"霉菌、供暖损坏和不安全的电线都导致这套公寓不适于居住。"}]}],"synonyms":["uninhabitability","unsuitability for habitation","unfitness for living"],"phonetic":"/ˌnɑn.həˈbɪt̬.ə.bəl.nəs/","extraExplanation":["“nonhabitableness”在现代英语中比较少见，更常用的说法是“uninhabitability”（不可居住性）或“nonhabitability”。","构词法提示：non-（否定）+ habitable（适于居住的）+ -ness（名词后缀，表示“性质/状态”）。"]}
{"word":"nonhabitably","summary":{"en":"“Nonhabitably” means “in an uninhabitable way.” It’s uncommon; “uninhabitably” is more natural.","zh":"“nonhabitably”表示“以不可居住的方式/程度”。此词较少见，更自然常用的是“uninhabitably”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that makes a place not suitable to live in; in an uninhabitable manner.","zh":"以不适合居住的方式；以不可居住的状态。"},"examples":[{"en":"After the flood, the house was nonhabitably damaged and had to be rebuilt.","zh":"洪水过后，房子受损严重，已经到了不可居住的程度，只能重建。"},{"en":"The apartment was left nonhabitably cold because the heating system failed.","zh":"因为供暖系统坏了，这间公寓冷得无法居住。"}]}],"synonyms":["uninhabitably","unsuitably (to live)","in an unlivable way"],"phonetic":"/ˌnɑnˈhæbɪtəbli/","extraExplanation":["“nonhabitably”较少见，更常见的表达是“uninhabitably”（不可居住地）或“in a way that makes it uninhabitable”。","构词：non-（不）+ habitable（可居住的）+ -ly（副词后缀）。在正式写作中也常写作“non-habitably”。"]}
{"word":"nonhabitation","summary":{"en":"Nonhabitation means not living together, especially spouses living separately in a formal or legal context.","zh":"nonhabitation 指不共同居住的状态，尤用于正式或法律语境中表示夫妻分居。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not living together, especially used about married couples living separately","zh":"不共同居住；（尤指夫妻）分居的状态"},"examples":[{"en":"After the separation, they agreed to a period of nonhabitation.","zh":"分开后，他们同意分居一段时间。"},{"en":"The court noted their nonhabitation when considering the divorce case.","zh":"法院在审理离婚案件时提到了他们的分居情况。"}]}],"synonyms":["separation","living apart","separate residence"],"phonetic":"/ˌnɑnˌhæbəˈteɪʃən/","extraExplanation":["这是一个较少见、偏正式/法律语境的词：non-（不）+ habitation（居住）。日常英语更常用 separation（分居）、living apart（分开住）、not living together（不住在一起）。","在一些法域的家庭法语境里，分居时间（period of nonhabitation）可能与离婚条件、赡养或财产安排等相关，但具体含义取决于当地法律。"]}
{"word":"nonhabitual","summary":{"en":"Nonhabitual means not usual or not done regularly—outside someone’s normal habits.","zh":"nonhabitual 指“非习惯性的、不常见的”，表示偏离某人或某种情况的常态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not done regularly; not usual or typical for a person, group, or situation.","zh":"非习惯性的；不经常做的；（对某人/某种情况来说）不常见、不典型的。"},"examples":[{"en":"She made a nonhabitual choice and took the bus instead of driving.","zh":"她做了一个非习惯性的选择，坐公交车而不是开车。"},{"en":"The data show a nonhabitual pattern of late-night activity this week.","zh":"数据表明本周出现了非习惯性的深夜活动模式。"},{"en":"His nonhabitual silence worried his friends.","zh":"他一反常态的沉默让朋友们担心。"}]}],"synonyms":["unusual","atypical","out of character","irregular","not typical"],"phonetic":"/ˌnɑn.həˈbɪtʃu.əl/","extraExplanation":["构词上由前缀 non-（“不、非”）+ habitual（“习惯性的”）组成，常用于较正式的写作（如研究报告、新闻、医学/心理学语境）。日常口语里更常用 not usual / out of character / not typical 来表达类似意思。","在行为或心理学语境中，nonhabitual 常强调“不是由习惯自动驱动”的行为或反应，带有“偏离常态/惯常模式”的含义。"]}
{"word":"nonhabitually","summary":{"en":"“Nonhabitually” means “not in one’s usual or habitual way.”","zh":"“nonhabitually”表示“并非习惯性地；一反常态地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not usual for someone; not as a habit.","zh":"以不常见的方式；不是某人的习惯性行为。"},"examples":[{"en":"He nonhabitually took the stairs instead of the elevator.","zh":"他一反常态走楼梯，而不是坐电梯。"},{"en":"She was nonhabitually quiet during the meeting.","zh":"她在会议上难得地很安静。"}]}],"synonyms":["unusually","not usually","out of character","atypically"],"phonetic":"/ˌnɑn.həˈbɪtʃuəli/","extraExplanation":["“nonhabitually”= non-（否定前缀，表示“不/非”）+ habitually（习惯性地）。它常用于正式或学术语境，用来强调某个行为“不是日常惯例”，相当于 “not usually / unusually”。日常口语里更常说 “not usually” 或 “out of character”。"]}
{"word":"nonhabitualness","summary":{"en":"Nonhabitualness means the state of not being a regular habit or routine.","zh":"Nonhabitualness 指“非习惯性”，即不属于固定习惯或日常规律的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being habitual; not happening regularly or by routine","zh":"非习惯性；不按惯例发生的状态（不规律、非日常的特征）"},"examples":[{"en":"Because of the nonhabitualness of his visits, everyone was surprised to see him twice in one week.","zh":"因为他来访并不规律（具有非习惯性），大家都很惊讶他一周内来了两次。"},{"en":"The study focused on the nonhabitualness of weekend drinking rather than daily use.","zh":"这项研究关注的是周末饮酒的非习惯性，而不是每日饮用。"}]}],"synonyms":["irregularity","infrequency","atypicality","nonroutine nature"],"phonetic":"ˌnɑn həˈbɪtʃuəl nəs","extraExplanation":["“nonhabitualness”是由前缀 non-（不、非）+ 形容词 habitual（习惯性的）+ 名词后缀 -ness（……的性质/状态）构成的抽象名词。实际写作中更常见的表达是“lack of routine / irregularity / not being habitual”，或直接用形容词“nonhabitual”来修饰名词（如 nonhabitual behavior）。","在语言学/语法语境里，“nonhabitual”有时指“非习惯体/非经常性”（与“habitual”对比），用于描述动作不是“经常发生的习惯”。"]}
{"word":"nonhabituating","summary":{"en":"“Nonhabituating” means something stays noticeable or strong even after repeated exposure.","zh":"“Nonhabituating”指某种刺激或反应在反复出现后仍保持明显或强烈，不会产生习惯化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not becoming weaker, less noticeable, or less effective after repeated exposure; not showing habituation.","zh":"（反复接触后）不会变弱、不会变得不明显或无效；不发生“习惯化”的。"},"examples":[{"en":"Researchers used a nonhabituating tone so participants wouldn’t stop noticing it over time.","zh":"研究人员使用了一种非习惯化的音调，这样参与者就不会随着时间推移而不再注意到它。"},{"en":"Some warning signals are designed to be nonhabituating to keep people alert.","zh":"有些警报信号被设计成非习惯化的，以保持人们的警觉。"},{"en":"In certain conditions, pain can be nonhabituating, remaining intense even after repeated episodes.","zh":"在某些情况下，疼痛可能是非习惯化的，即使反复发作仍然很强烈。"}]}],"synonyms":["non-adapting","unfading","persistent","undiminishing"],"phonetic":"/ˌnɑn.həˈbɪtʃuˌeɪ.tɪŋ/","extraExplanation":["“nonhabituating”常见于心理学、神经科学与医学写作，强调刺激/反应不会因重复而减弱。它与“habituation（习惯化/适应）”相对。","构词：non-（不、非）+ habituate（使习惯）+ -ing（形容词用法，表示“具有……性质的”）。在学术语境里也常写作“non-habituating”。"]}
{"word":"nonhackneyed","summary":{"en":"“Nonhackneyed” means original and not cliché.","zh":"“nonhackneyed”指新颖、不落俗套、非陈词滥调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hackneyed; original, fresh, and not overused (especially of an idea, phrase, or style).","zh":"不落俗套的；新颖的（尤指想法、措辞或风格不陈词滥调、不过度使用）。"},"examples":[{"en":"Her essay offered a nonhackneyed view of social media, focusing on quiet friendships instead of popularity.","zh":"她的文章对社交媒体提出了不落俗套的看法，把重点放在安静的友谊而非人气上。"},{"en":"Try to choose nonhackneyed details in your story—small, specific moments feel more real than clichés.","zh":"写故事时尽量选用不落俗套的细节——具体的小瞬间比陈词滥调更真实。"}]}],"synonyms":["original","fresh","novel","unconventional","inventive"],"phonetic":"/ˌnɑnˈhækniːd/","extraExplanation":["“hackneyed”原本有“被用烂了、成了套话”的意思，常用来形容表达、比喻、观点、情节等太常见、缺乏新意。加上否定前缀non- 就变成“非陈腐的/不俗套的”。","写作或演讲里，nonhackneyed 往往是在夸一个表达“有新鲜感”。近义词常见有 original, fresh, novel；反义词有 clichéd, trite, stale。"]}
{"word":"nonhalation","summary":{"en":"Nonhalation means preventing or reducing a halo-like glow around bright areas in images.","zh":"Nonhalation 指在影像中防止或减少亮部周围的晕光（光晕）现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prevention or reduction of halation (a glowing halo or light spread around bright areas) in photography, film, scanning, or printing—often by using special coatings, filters, or processing techniques","zh":"（摄影、胶片、扫描或印刷中）防止或减少“晕光/光晕”（亮部周围出现发光光圈或光扩散）的处理方法，常通过涂层、滤镜或工艺实现"},"examples":[{"en":"The film has a nonhalation backing to keep bright lights from bleeding into the shadows.","zh":"这款胶片有防晕光背涂层，可避免强光溢出影响暗部细节。"},{"en":"In product photos, nonhalation techniques help text and edges look sharper.","zh":"在产品摄影里，防晕光处理能让文字和边缘看起来更清晰。"},{"en":"The lab adjusted the scan with nonhalation settings to reduce glow around highlights.","zh":"实验室在扫描时调整了防晕光相关设置，减少高光周围的光晕。"}]}],"synonyms":["anti-halation","halation control","anti-halo (informal)"],"phonetic":"/ˌnɑn.həˈleɪ.ʃən/","extraExplanation":["“halation”常见于胶片摄影：强光穿透感光层后在胶片基底中散射并反射回感光层，导致亮部周围出现一圈“发光边”。为此，很多胶片会在背面加入深色的防晕光层（nonhalation backing），吸收多余的光，冲洗后该层会被去除。","在数字影像中虽然没有胶片散射，但镜头眩光、传感器溢出、后期锐化/降噪等也可能造成类似的“光晕”，因此人们也会借用“nonhalation”来泛指减少这类光晕的处理。"]}
{"word":"nonhallucinated","summary":{"en":"“Nonhallucinated” means not imagined or invented; it is grounded in real facts or evidence.","zh":"“nonhallucinated”指非想象或非编造的；有事实或证据依据的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hallucinated; based on real perception, facts, or reliable evidence (not imagined or invented).","zh":"非幻觉的；基于真实感知、事实或可靠证据的（不是想象或编造的）。"},"examples":[{"en":"The witness gave a nonhallucinated account of what happened, supported by video evidence.","zh":"目击者提供了一个非幻觉的陈述，并有视频证据支持。"},{"en":"In AI writing, a “nonhallucinated” answer matches the sources and doesn’t invent details.","zh":"在 AI 写作中，“nonhallucinated（非幻觉的）”回答要与来源一致，不凭空捏造细节。"}]}],"synonyms":["fact-based","grounded","evidence-based","verifiable","accurate"],"phonetic":"/ˌnɑn.həˈluː.səˌneɪ.tɪd/","extraExplanation":["“nonhallucinated”并不是非常常见的日常词，更常见于技术语境（尤其是AI/大模型）或医学/心理学讨论中，用来强调“内容没有凭空编造、能被核实”。","构词法：non-（否定前缀，“不、非”）+ hallucinated（hallucinate 的过去分词/形容词用法，“产生幻觉的/凭空想象的”）。因此它的核心意思就是“不是幻觉/不是捏造的”。","在AI语境里，人们也常用更自然的说法，如 “fact-based”（基于事实的）、“grounded”（有依据的）、“verifiable”（可验证的）。"]}
{"word":"nonhallucination","summary":{"en":"Nonhallucination means “not hallucinating,” especially an AI output that does not invent facts and stays accurate.","zh":"Nonhallucination 指“不产生幻觉”，尤其指 AI 输出不编造事实、保持准确。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of not hallucinating; in AI, an output that is accurate and not fabricated (i.e., grounded in reliable information).","zh":"不产生幻觉的状态；在人工智能语境中，指输出内容准确、未捏造（基于可靠信息）。"},"examples":[{"en":"Our evaluation focuses on nonhallucination: the model should not invent citations or facts.","zh":"我们的评测重点是 nonhallucination：模型不应编造引用或事实。"},{"en":"Nonhallucination is especially important in medical and legal writing.","zh":"在医疗和法律写作中，nonhallucination 尤其重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific response or claim that is judged to be non-hallucinatory (factually correct and supported).","zh":"（某条具体的）未幻觉的回答/陈述（事实正确且有依据）。"},"examples":[{"en":"This answer is a clear nonhallucination because it matches the official documentation.","zh":"这个回答明显属于 nonhallucination，因为它与官方文档一致。"},{"en":"We labeled the first two outputs as nonhallucinations and the last one as a hallucination.","zh":"我们把前两个输出标为 nonhallucinations，最后一个标为 hallucination（幻觉）。"}]}],"synonyms":["non-hallucination","groundedness","factual accuracy","faithfulness","verifiability"],"phonetic":"/ˌnɑn həˌluːsəˈneɪʃən/","extraExplanation":["这个词在通用英语词典中不算常见，更常见的写法是带连字符的 non-hallucination，主要出现在 AI 安全、模型评测与信息可靠性讨论中。","在 AI 里，“hallucination（幻觉）”指模型生成看似合理但实际上不真实/无依据的内容；nonhallucination 强调“没有编造”，往往与 groundedness（有据性）、factuality（事实性）、verifiability（可验证性）等指标一起使用。"]}
{"word":"nonhallucinatory","summary":{"en":"Nonhallucinatory means “not hallucinatory”—realistic and not based on hallucinations or fabricated content.","zh":"nonhallucinatory 意为“非幻觉的”，强调真实、可核实，不是幻觉或编造出来的内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving hallucinations; based on reality rather than imagined perceptions or false content","zh":"非幻觉的；不涉及幻觉的；基于真实而非想象或虚假内容的"},"examples":[{"en":"The doctor confirmed that the patient’s symptoms were nonhallucinatory.","zh":"医生确认病人的症状并非幻觉性的。"},{"en":"Researchers try to design systems that produce nonhallucinatory answers.","zh":"研究人员努力设计能给出非“幻觉”答案的系统。"}]}],"synonyms":["reality-based","veridical","factual","grounded"],"phonetic":"/ˌnɑn həˈluːsəˌnətɔri/","extraExplanation":["这个词由 non-（不、非）+ hallucinatory（幻觉的）构成，多见于心理学/精神医学语境，用来描述“症状、体验或陈述不属于幻觉”。","在人工智能语境里，hallucination 常指“模型编造不真实的信息”；nonhallucinatory 就强调“内容可核实、与事实一致”。这属于延伸用法。"]}
{"word":"nonhandicap","summary":{"en":"“Nonhandicap” usually means “not disabled,” and less commonly refers to a sports event that is not a handicap event.","zh":"“nonhandicap” 通常指“非残障的”；较少见地也可指体育中的“非让分/非差点赛”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not having a disability; not disabled (often written as “non-disabled” or “nonhandicapped”).","zh":"没有残疾的；非残障的（更常写作 non-disabled 或 nonhandicapped）。"},"examples":[{"en":"The survey compared nonhandicap students with students who had disabilities.","zh":"这项调查比较了非残障学生与有残疾的学生。"},{"en":"The building should be accessible to both nonhandicap and disabled visitors.","zh":"这栋楼应当对非残障和残障访客都无障碍。"}]},{"partOfSpeech":"n.","definition":{"en":"(sports) a race, game, or event that is not a handicap event (no extra advantage is given to balance competitors).","zh":"（体育）非让分赛/非差点赛：不通过让分或差点来平衡参赛者实力的比赛或项目。"},"examples":[{"en":"Today’s match is a nonhandicap event, so no points are added or subtracted.","zh":"今天的比赛是非让分赛，因此不会加分或扣分。"},{"en":"He prefers nonhandicap races because the rules are simpler.","zh":"他更喜欢非差点赛，因为规则更简单。"}]}],"synonyms":["non-disabled","able-bodied","without a disability","non-handicap (sports)"],"phonetic":"ˌnɑnˈhæn.dɪ.kæp","extraExplanation":["“nonhandicap” 不是很常见的拼写；更常见、更自然的说法是 “non-disabled”（非残障的）或 “without a disability”。在正式写作中，许多英语场合也会避免使用 “handicapped” 这个词，因为它在一些语境里可能被认为不够尊重；更中性的表达是 “disabled people / people with disabilities”（视语境与偏好而定）。","写法上也常见带连字符的 “non-handicap”（尤其在体育语境，表示“非让分/非差点”的比赛）。"]}
{"word":"nonhardenable","summary":{"en":"Nonhardenable means “not able to be made hard,” especially in materials and metallurgy.","zh":"nonhardenable 指“不可硬化的”，多用于材料/冶金领域，强调无法通过工艺使其变硬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be made hard (especially by heat treatment, aging, or other industrial processes).","zh":"不能被硬化的；无法通过热处理、时效等工艺变硬的（尤用于材料/金属）。"},"examples":[{"en":"This alloy is nonhardenable, so heat treatment won’t increase its strength much.","zh":"这种合金是不可硬化的，所以热处理并不会明显提高它的强度。"},{"en":"Nonhardenable steels are chosen when toughness and easy forming matter more than hardness.","zh":"当韧性和易成形性比硬度更重要时，会选择不可硬化钢。"}]}],"synonyms":["non-hardenable","not hardenable"],"phonetic":"/ˌnɑnˈhɑrdənəbəl/","extraExplanation":["“nonhardenable”常见于工程与冶金语境，通常指材料无法通过常见的硬化机制（如淬火、析出/时效硬化）显著提升硬度或强度。并不一定表示材料“很软”，而是强调“用这些方法硬化不了”。","写法上也常见带连字符的形式：non-hardenable。"]}
{"word":"nonhardy","summary":{"en":"Nonhardy describes plants (or living things) that cannot tolerate cold or harsh conditions and need protection.","zh":"nonhardy 指（多用于植物）不耐寒、不耐受恶劣环境，需要保护。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not hardy; not able to survive difficult conditions (especially cold weather) without protection","zh":"不耐寒的；不耐受恶劣环境（尤指寒冷天气），需要保护的"},"examples":[{"en":"These nonhardy plants should be brought indoors before the first frost.","zh":"这些不耐寒的植物应在第一次霜冻前搬到室内。"},{"en":"In colder regions, gardeners grow nonhardy flowers as annuals.","zh":"在较冷的地区，园丁常把不耐寒的花当作一年生植物来种。"}]}],"synonyms":["tender","delicate","frost-sensitive","not hardy"],"phonetic":"/nɑnˈhɑrdi/","extraExplanation":["“hardy”在园艺语境里常指“耐寒、耐活”。因此“nonhardy”多用于描述植物在冬季或寒冷气候中不能露地越冬，需要覆膜、搬入室内或温室栽培。","写法上也常见连字符形式“non-hardy”。在日常英语里更常用的表达是“not hardy”或“tender”（如：tender plants 指不耐寒植物）。"]}
{"word":"nonharmonic","summary":{"en":"Nonharmonic means “not harmonic,” especially describing sounds or frequencies that don’t fit a smooth, consonant pattern (often not integer multiples of a fundamental frequency).","zh":"nonharmonic 意为“非和声/非谐波的”，常指声音或频率不协和，或不符合“基频整数倍”的谐波关系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not harmonic; not forming a smooth or consonant relationship (especially in sound, music, or physics)","zh":"非和声的；不和谐的（尤指声音、音乐或物理中的关系不构成和声/协和）"},"examples":[{"en":"The bell produces a nonharmonic sound that feels sharp and metallic.","zh":"这口钟发出的声音是非和声的，听起来尖锐而带金属感。"},{"en":"Some instruments include nonharmonic overtones, which makes their timbre unique.","zh":"有些乐器包含非和声的泛音，因此音色更独特。"}]},{"partOfSpeech":"adj.","definition":{"en":"(physics/engineering) having frequencies that are not whole-number multiples of a fundamental frequency","zh":"（物理/工程）其频率不是基频整数倍的；非整数谐波关系的"},"examples":[{"en":"The vibration spectrum shows several nonharmonic components.","zh":"振动频谱显示出若干个非谐波成分。"},{"en":"Nonharmonic resonance can appear when the system is driven irregularly.","zh":"当系统受到不规则驱动时，可能出现非谐波共振。"}]}],"synonyms":["inharmonic","nonharmonious","discordant"],"phonetic":"/ˌnɑn hɑrˈmɑnɪk/","extraExplanation":["“harmonic（谐波/和声）”在声学里常指：频率是“基频的整数倍”的一组成分（如 1f、2f、3f）。如果某个频率不符合这种整数倍关系，就常被称为“nonharmonic/inharmonic（非谐波）”。","在日常英语里，更常见的词是“inharmonic”或“nonharmonious（不和谐的）”；“nonharmonic”较偏技术语境（声学、振动、信号等）。"]}
{"word":"nonharmonies","summary":{"en":"Nonharmonies means disagreements or mismatches—places where things are not harmonious.","zh":"nonharmonies 指“不和谐/不协调之处”，也可指分歧与冲突。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that do not fit together harmoniously; disagreements or mismatches (in music, art, ideas, or relationships).","zh":"不和谐之处；不协调的事物；分歧或冲突（可用于音乐、艺术、观点或人际关系）。"},"examples":[{"en":"The reviewer pointed out several nonharmonies between the melody and the lyrics.","zh":"评论者指出旋律和歌词之间有几处不协调。"},{"en":"Over time, small nonharmonies in their teamwork became harder to ignore.","zh":"随着时间推移，他们合作中的一些小分歧变得越来越难以忽视。"}]}],"synonyms":["disharmonies","discords","inconsistencies","mismatches","conflicts"],"phonetic":"/nɑnˈhɑrməniz/","extraExplanation":["“nonharmonies”较少见，更常见的表达是“lack of harmony / disharmony / discord / inconsistencies”。在写作中也可能写作“non-harmonies”以强调由“non- + harmonies”构成。","在音乐语境里，它可以泛指“不协和、不协调的和声/音程”；在人文与评论写作里，它常用来比喻“主题、风格或观点之间的抵牾”。"]}
{"word":"nonharmonious","summary":{"en":"“Nonharmonious” means not harmonious—lacking harmony, agreement, or a pleasing combination.","zh":"nonharmonious 表示“不和谐的/不协调的”，缺乏和谐、一致或悦耳的组合。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not harmonious; lacking harmony, agreement, or a pleasing combination (in sound, relationships, ideas, etc.).","zh":"不和谐的；不协调的；缺乏和谐或一致（可指声音、人际关系、观点等）。"},"examples":[{"en":"The choir sounded nonharmonious because the singers were in different keys.","zh":"合唱听起来不和谐，因为歌手们在不同的调上。"},{"en":"Their nonharmonious relationship made teamwork difficult.","zh":"他们不和谐的关系让团队合作变得困难。"},{"en":"The design felt nonharmonious, with clashing colors and styles.","zh":"这个设计显得不协调，颜色和风格互相冲突。"}]}],"synonyms":["inharmonious","discordant","dissonant","clashing","unbalanced"],"phonetic":"/ˌnɑn hɑrˈmoʊniəs/","extraExplanation":["这个词由 non-（否定前缀，“不/非”）+ harmonious（和谐的）组成。日常英语里更常见的说法是 inharmonious 或 discordant；nonharmonious 也能用，但更像书面或技术语境中的选择。","在音乐语境中，它通常指“听起来不协和/不悦耳”；在社会或写作语境中，常指“关系不融洽/观点不一致/元素不搭”。"]}
{"word":"nonharmoniously","summary":{"en":"“Nonharmoniously” means “not in harmony,” either socially (not agreeing/working well together) or musically (clashing sounds).","zh":"“Nonharmoniously”表示“不和谐地”，可指人际/团队等“不协调、不一致”，也可指音乐上“声音不协和、冲突”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not harmonious; not in agreement, balance, or pleasant combination.","zh":"不和谐地；不协调地；不一致地（指缺乏平衡、配合或悦耳的组合）"},"examples":[{"en":"The colors were chosen nonharmoniously, making the room feel chaotic.","zh":"这些颜色搭配得不和谐，让房间显得很乱。"},{"en":"The team worked nonharmoniously at first, but communication improved later.","zh":"团队一开始配合得不协调，但后来沟通改善了。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Music) In a way that clashes in sound; dissonantly.","zh":"（音乐）不谐和地；不协和地（声音冲突、不悦耳）"},"examples":[{"en":"The notes rang nonharmoniously, creating a tense mood.","zh":"音符听起来不协和，营造出紧张的氛围。"},{"en":"If you sing nonharmoniously with the choir, the melody becomes unclear.","zh":"如果你和合唱团唱得不和谐，旋律就会变得不清楚。"}]}],"synonyms":["discordantly","inharmoniously","out of harmony","dissonantly","uncooperatively"],"phonetic":"/ˌnɑn hɑrˈmoʊniəsli/","extraExplanation":["这个词由 non-（表示“非、不”）+ harmoniously（和谐地）构成，常用于两类语境：①人际/团队/观点“不一致、配合不好”；②音乐/声音“协和感不足、产生不协和（dissonance）”。日常写作中更常见的替代表达有 “in a discordant way / out of harmony / not in harmony”。"]}
{"word":"nonharmoniousness","summary":{"en":"Nonharmoniousness means a lack of harmony or agreement.","zh":"nonharmoniousness 指“不和谐、不协调或缺乏一致”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being harmonious; lack of agreement, balance, or pleasant combination (in relationships, ideas, sounds, colors, etc.)","zh":"不和谐；不协调；缺乏一致、平衡或悦耳/悦目组合的状态（可指关系、观点、声音、颜色等）"},"examples":[{"en":"The meeting ended in nonharmoniousness, with no one agreeing on the next step.","zh":"会议以不和谐告终，没有人同意下一步该怎么做。"},{"en":"In music, nonharmoniousness can sound tense or unsettling if used too much.","zh":"在音乐中，如果用得太多，不和谐会听起来紧张或令人不安。"},{"en":"The room’s colors created a feeling of nonharmoniousness rather than calm.","zh":"房间的配色带来一种不协调的感觉，而不是平静。"}]}],"synonyms":["disharmony","discord","incongruity","dissonance"],"phonetic":"/ˌnɑn hɑrˈmoʊniəsnəs/","extraExplanation":["这个词比较少见，常用替代表达包括：disharmony（不和谐）、discord（不一致/不和）、incongruity（不协调）、lack of harmony（缺乏和谐）。","构词法：non-（否定）+ harmonious（和谐的）+ -ness（名词后缀，表示“性质/状态”）。"]}
{"word":"nonharmony","summary":{"en":"Nonharmony means a lack of harmony—disagreement, conflict, or things not fitting well together.","zh":"nonharmony 指“缺乏和谐”，可表示不和、冲突或不协调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of harmony; disagreement, conflict, or an unpleasant/unstable relationship between people, ideas, sounds, or parts of something","zh":"不和；不协调；（人与人、观点、声音或事物各部分之间的）不一致、冲突或失调"},"examples":[{"en":"Nonharmony within the team made it hard to finish the project on time.","zh":"团队内部的不和让按时完成项目变得很困难。"},{"en":"The painting’s bright colors and dark mood create a feeling of nonharmony.","zh":"这幅画明亮的色彩与阴郁的氛围形成一种不协调感。"}]}],"synonyms":["disharmony","discord","conflict","friction","incompatibility","lack of harmony"],"phonetic":"/ˌnɑnˈhɑrməni/","extraExplanation":["“nonharmony”由前缀 non-（表示“非、没有”）+ harmony（和谐）构成，意思很直观，但在日常英语中不算常见。更常用的表达包括 disharmony、discord、lack of harmony、conflict 等。","在音乐或艺术评论中，也可用来描述“声音/色彩/元素之间不协调”的效果；有时这种“不和谐”是作者有意为之，用来制造张力。"]}
{"word":"nonhazardous","summary":{"en":"Nonhazardous means not dangerous or not legally classified as hazardous, especially for materials and waste.","zh":"nonhazardous 指“无危险的/无害的”，也常指“按法规不属于危险品”的（多用于材料、废弃物等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not dangerous; not likely to cause harm to people, animals, or the environment.","zh":"无危险的；无害的；不太可能对人、动物或环境造成伤害的。"},"examples":[{"en":"This cleaner is labeled nonhazardous, so it’s safer to use at home.","zh":"这种清洁剂标注为无危险的，所以在家里使用更安全。"},{"en":"The lab separates hazardous and nonhazardous waste into different bins.","zh":"实验室把危险废弃物和无危险废弃物分开投放到不同的桶里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of waste or materials) Not classified as hazardous under safety or environmental rules.","zh":"（指废弃物或材料）按安全或环保法规不被归类为危险品的。"},"examples":[{"en":"Nonhazardous industrial waste must still be handled and disposed of properly.","zh":"无危险的工业废弃物仍然必须被妥善处理和处置。"},{"en":"Please confirm whether the shipment is nonhazardous before transporting it.","zh":"运输前请确认这批货物是否属于非危险品。"}]}],"synonyms":["harmless","safe","non-toxic","benign"],"phonetic":"/ˌnɑnˈhæzərdəs/","extraExplanation":["“nonhazardous”常见于标签、说明书、化学品安全与环保文件中，带有“合规分类”的语气；日常口语里也会说“not dangerous / harmless”。","注意：标为nonhazardous并不等于“完全无风险”。例如某些材料虽然不属于危险品，但仍可能刺激皮肤、引发过敏或需要按规定处理。"]}
{"word":"nonhazardously","summary":{"en":"Nonhazardously means “safely; without danger or risk.”","zh":"nonhazardously 的意思是“安全地；无危险地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not create danger or risk; safely.","zh":"以不造成危险或风险的方式；安全地。"},"examples":[{"en":"Store the chemicals nonhazardously, away from heat and food.","zh":"把化学品以安全无害的方式储存，远离高温和食物。"},{"en":"The waste was disposed of nonhazardously, following local rules.","zh":"废弃物按照当地规定以非危险方式处理。"}]}],"synonyms":["safely","securely","without risk","harmlessly","in a nonhazardous way"],"phonetic":"/ˌnɑnˈhæzɚdəsli/","extraExplanation":["“nonhazardously”来自形容词“nonhazardous（非危险的）”，再加副词后缀“-ly”。更常见的表达是“safely / without risk / in a nonhazardous way”。在工作场所、化学品与环保文件中更容易看到这个词。"]}
{"word":"nonhazardousness","summary":{"en":"Nonhazardousness means the state or quality of not being hazardous (not dangerous), often used in technical or regulatory writing.","zh":"nonhazardousness 指“非危险性/无危害性”，常见于技术或法规写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being nonhazardous; the fact that something is not dangerous or likely to cause harm (often used in safety, environmental, or regulatory contexts).","zh":"“非危险性；无危害性”：指某物不危险、不太可能造成伤害的性质或状态（常用于安全、环保或法规语境）。"},"examples":[{"en":"The report confirmed the nonhazardousness of the waste material after testing.","zh":"检测后，报告确认该废弃物材料的非危险性。"},{"en":"Workers must document the nonhazardousness of the chemicals before disposal.","zh":"工人必须在处置前记录这些化学品的非危险性。"},{"en":"The label is meant to show the product’s nonhazardousness for normal household use.","zh":"该标签旨在说明该产品在普通家庭使用情况下的非危险性。"}]}],"synonyms":["safety","harmlessness","nonhazardous nature","lack of hazard"],"phonetic":"/ˌnɑnˈhæzərdəsnəs/","extraExplanation":["这是一个构词较“书面/技术化”的名词：non-（不）+ hazardous（危险的）+ -ness（把形容词变成名词，表示“……的性质/状态”）。日常交流里更常用 not hazardous / nonhazardous 或 safety（安全性）来表达。","在法规或合规文件中，nonhazardousness 常用于说明材料是否属于“hazardous waste（危险废物）”的分类，从而影响运输、储存、处置的要求。写作时要确保有依据（如测试结果、MSDS/SDS、标准编号）。"]}
{"word":"nonheading","summary":{"en":"“Nonheading” means not a heading (regular body text) or text that isn’t formatted as a heading.","zh":"“nonheading”指“非标题的（正文用的）”，也可指“非标题文字/正文内容”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not serving as a heading or title; used for regular (body) text rather than a section title.","zh":"非标题的；不作为标题或题头使用的（用于正文而不是章节标题）。"},"examples":[{"en":"Use a nonheading font for the paragraph text, and a larger font for headings.","zh":"段落正文用非标题字体，标题用更大的字体。"},{"en":"The editor changed the line from a heading to nonheading text.","zh":"编辑把这一行从标题改成了非标题正文。"}]},{"partOfSpeech":"n.","definition":{"en":"text that is not a heading; body text or content lines that are not formatted as titles.","zh":"非标题文字；正文（不是按标题格式排版的文字）。"},"examples":[{"en":"All headings should be bold, but nonheading should remain regular weight.","zh":"所有标题都应加粗，但非标题文字应保持常规字重。"},{"en":"Please convert the nonheading into bullet points.","zh":"请把非标题内容改成项目符号。"}]}],"synonyms":["body text","regular text","non-heading","running text"],"phonetic":"/nɑnˈhɛdɪŋ/","extraExplanation":["“non-”是常见前缀，表示“非、不是”。“nonheading”多见于排版、编辑、学术写作或网页/文档格式设置语境，用来区分 heading（标题/标题样式）与 body text（正文）。在实际英语中更常见的写法是分开写：non-heading 或写成更明确的表达：non-heading text / body text。"]}
{"word":"nonhearer","summary":{"en":"Nonhearer means a person who does not hear; it is uncommon and may sound less respectful than “Deaf person” in many contexts.","zh":"nonhearer 指“听不见的人/不听者”；较少用，在不少语境中可能不如“Deaf person（聋人）”自然或得体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not hear (often used to mean someone who is Deaf); less common and can sound clinical or impersonal in some contexts","zh":"不听者；听不见的人（常被用来指聋人；较不常见，在某些语境里可能显得偏冷冰冰或不够尊重）"},"examples":[{"en":"The survey included Deaf people, hard-of-hearing people, and nonhearers.","zh":"这项调查包括聋人、听障人士以及不听者。"},{"en":"Some writers avoid the word “nonhearer” and prefer “Deaf person” because it matches community identity.","zh":"有些作者避免使用“nonhearer”，更倾向用“Deaf person（聋人）”，因为它更符合社群身份认同。"}]}],"synonyms":["Deaf person","deaf individual","hard-of-hearing person (not the same meaning)","person who is deaf"],"phonetic":"/nɑnˈhɪrɚ/","extraExplanation":["“nonhearer”字面是“non-（不）+ hearer（听者）”。它把人定义为“缺少听力的人”，因此在强调身份与文化的语境中，可能不如“Deaf person / Deaf people（聋人）”来得自然与尊重。","在英语里，“Deaf”（大写D）有时指“聋人文化社群”（有共同语言与文化，例如美国手语ASL），而“deaf”（小写d）更偏向医学/听力状态描述。写作时可根据对方偏好选择用词。","更中性且常见的表达：“Deaf person/people（聋人）”“hard of hearing（听力受损/听障人士）”。如不确定，最好询问当事人偏好的称呼。"]}
{"word":"nonheathen","summary":{"en":"“Nonheathen” means “not a heathen,” usually in old-fashioned or joking speech; it can also mean a person who is not considered a heathen.","zh":"“nonheathen”意为“非异教徒的/不是异教徒”，多见于旧式或玩笑语气；也可指“非异教徒的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not a heathen; not belonging to a non-Christian (or non-believing) group (often used in older or joking language)","zh":"非异教徒的；不是“异教徒/不信教者”的（常见于较旧的用法或带玩笑语气）"},"examples":[{"en":"In the old story, the villagers called anyone outside their faith a “heathen,” and a “nonheathen” meant a believer.","zh":"在那则旧故事里，村民把信仰不同的人都叫作“heathen（异教徒）”，而“nonheathen”就指信徒。"},{"en":"He joked that he was a “nonheathen” because he never missed Sunday service.","zh":"他开玩笑说自己是“nonheathen”，因为他从不缺席周日礼拜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person considered not to be a heathen (rare; usually humorous or old-fashioned)","zh":"被认为不是异教徒的人（较少见；多为幽默或旧式用法）"},"examples":[{"en":"They separated “heathens” from “nonheathens” in the narrator’s outdated way of speaking.","zh":"叙述者用一种过时的说法，把“heathens”和“nonheathens”区分开来。"}]}],"synonyms":["nonbeliever (context-dependent)","person of another faith","non-Christian (context-dependent)"],"phonetic":"/ˌnɑnˈhiðən/","extraExplanation":["“heathen”在英语里带有强烈的历史与宗教色彩，过去常由某一宗教群体用来指“非本宗教的人”，今天很多语境下会显得贬义或不尊重。“nonheathen”因此也很少用于正式场合。更中性的表达可以用：nonbeliever（不信者）、person of another faith（不同信仰的人）、non-Christian（非基督徒，视语境而定）等。"]}
{"word":"nonheathens","summary":{"en":"“Nonheathens” means people who are not considered heathens (a rare, old-fashioned contrast term).","zh":"“nonheathens”指“非异教徒/不被视为异教徒的人”，较少见且带旧式对照意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who are not heathens; people considered not pagan or not outside a particular religion (rare and often used in contrast with “heathens”).","zh":"非异教徒；（与“heathens”对照）被认为不属于异教或不在某宗教之外的人（较少见的用法）。"},"examples":[{"en":"The writer divided the world into “heathens” and “nonheathens,” which sounds old-fashioned today.","zh":"作者把世界分成“异教徒”和“非异教徒”，这在今天听起来很过时。"},{"en":"In the story, the villagers treated nonheathens as trustworthy and outsiders as suspicious.","zh":"在故事里，村民把非异教徒当作可信的人，把外来者当作可疑对象。"}]}],"synonyms":["nonpagans","the faithful","believers","non-Christians (context-dependent)"],"phonetic":"/nɑnˈhiðənz/","extraExplanation":["“nonheathens”由前缀 non-（“非……”）+ heathen（“异教徒/非信徒”）构成，语感比较生硬，更多见于历史文本、宗教对立叙述或带讽刺意味的写法。","注意文化敏感性：heathen 在现代英语里常被视为带偏见或贬义的标签，用来称呼宗教或文化不同的人可能冒犯。更中性的表达常用 non-Christians（非基督徒）、people of other faiths（其他信仰的人）、nonbelievers（无宗教信仰者）等。"]}
{"word":"nonhectic","summary":{"en":"“Nonhectic” means calm and not rushed or stressful.","zh":"“nonhectic”表示不忙乱、从容不紧张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hectic; calm, unhurried, and without a lot of rush or stress.","zh":"不忙乱的；从容的；不紧张、不慌乱的。"},"examples":[{"en":"I prefer a nonhectic morning so I can plan my day clearly.","zh":"我更喜欢一个不忙乱的早晨，这样我能更清楚地规划一天。"},{"en":"After moving to a small town, her life became more nonhectic and predictable.","zh":"搬到小镇后，她的生活变得更从容、更规律。"},{"en":"We chose a nonhectic itinerary with plenty of breaks.","zh":"我们选择了一个不赶行程的旅行计划，中间有很多休息时间。"}]}],"synonyms":["calm","unhurried","relaxed","low-key","peaceful"],"phonetic":"/nɑnˈhɛktɪk/","extraExplanation":["“non-”是常见前缀，表示“非……/不……”。“hectic”常形容生活、工作或日程“忙乱、紧张、节奏快”。因此“nonhectic”多用于描述一种“节奏慢、压力小、安排宽松”的状态（比单说“not hectic”更像一个整体特质）。","用法小提示：更自然的替代表达也很常见，如“calm / relaxed / unhurried / low-key”。但在需要强调“相较于忙乱的生活方式”的对比时，“nonhectic”会很贴切。"]}
{"word":"nonhectically","summary":{"en":"“Nonhectically” means “not in a hectic way; calmly and without rushing.”","zh":"“nonhectically”表示“不是忙乱地；从容、不赶时间地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not hectic; calmly or without rush","zh":"不忙乱地；不慌不忙地；从容地"},"examples":[{"en":"After the deadline was extended, the team worked nonhectically and made fewer mistakes.","zh":"截止日期延长后，团队不再忙乱，从容地工作，错误也少了。"},{"en":"She moved through the morning nonhectically, finishing tasks one by one.","zh":"她不慌不忙地度过早晨，把事情一件件完成。"}]}],"synonyms":["calmly","unhurriedly","without rushing","leisurely"],"phonetic":"/nɑnˈhɛktɪkli/","extraExplanation":["“nonhectically”在真实语料中很少见，写作里更常用“calmly / unhurriedly / without rushing”。如果要用这个词，常见写法也可能带连字符：non-hectically。","构词很好理解：non-（不）+ hectically（忙乱地）。它强调“不是那种手忙脚乱的状态”，语气比单纯的“calmly”更像在对比“hectic（忙乱）”的情境。"]}
{"word":"nonhedonic","summary":{"en":"Nonhedonic means “not about pleasure”; it emphasizes practical, functional value rather than enjoyment.","zh":"nonhedonic 指“非享乐的”，强调实用/功能价值，而不是愉悦或享受。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not related to pleasure, enjoyment, or sensory gratification; focused on practical or functional value rather than “fun” or luxury","zh":"非享乐的；不以愉悦/享受为目的的；更强调实用或功能价值而非“好玩”或奢华"},"examples":[{"en":"Some buyers choose a nonhedonic product because it is durable and easy to use.","zh":"有些买家选择非享乐型产品，因为它耐用又好用。"},{"en":"In surveys, people often rate toothpaste as more nonhedonic than ice cream.","zh":"在调查中，人们常把牙膏评为比冰淇淋更“非享乐”。"},{"en":"She made a nonhedonic decision to save money instead of buying designer shoes.","zh":"她做了一个非享乐的决定：省钱而不是买名牌鞋。"}]}],"synonyms":["utilitarian","practical","functional","non-indulgent"],"phonetic":"/ˌnɑnhiˈdɑnɪk/","extraExplanation":["“nonhedonic”常见于心理学、消费行为与营销领域，用来对比“hedonic（享乐型）”与“utilitarian（功利/实用型）”。例如：冰淇淋、香水更偏hedonic；电池、洗衣液更偏nonhedonic/实用。","在学术写作中，也会用“nonhedonic measures/ratings（非享乐性指标/评分）”来指不以愉悦感为核心的评价维度（如效率、可靠性、成本）。"]}
{"word":"nonhedonically","summary":{"en":"“Nonhedonically” means doing something not for pleasure, but for practical, ethical, or duty-based reasons.","zh":"“nonhedonically”表示做某事并非为了享乐，而是出于实际、道德或责任等原因。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not focused on pleasure, enjoyment, or sensory reward; for reasons other than personal pleasure (e.g., duty, ethics, practicality).","zh":"以非享乐的方式；不以快乐、享受或感官满足为目的（例如出于责任、道德或实际需要）。"},"examples":[{"en":"She chose the job nonhedonically, prioritizing stability over excitement.","zh":"她选择那份工作并非出于享乐，而是把稳定放在刺激之上。"},{"en":"They planned the trip nonhedonically, focusing on research goals rather than sightseeing.","zh":"他们规划这次旅行并非为了享受观光，而是以研究目标为主。"},{"en":"He approached cooking nonhedonically—just to eat healthy, not to chase flavor.","zh":"他做饭并不是为了享乐——只是为了健康饮食，不是为了追求味道。"}]}],"synonyms":["not for pleasure","for practical reasons","out of duty","for ethical reasons"],"phonetic":"/ˌnɑnˌhiːdəˈnɪkli/","extraExplanation":["“nonhedonically”来自“hedonism（享乐主义）”。在心理学与经济学里，hedonic 常指“与愉悦/幸福感相关的”，例如 hedonic happiness（享乐式幸福）。因此 nonhedonically 常用于强调动机不是“为了开心”，而是为了价值、责任或功能性目标。","这个词在日常口语中不算常见，更常见的替代表达有：“not for pleasure,” “for practical reasons,” “out of duty,” “for ethical reasons”。"]}
{"word":"nonhedonistic","summary":{"en":"Nonhedonistic means not centered on pleasure-seeking, either in lifestyle or in ethical/philosophical views.","zh":"Nonhedonistic 指“不以追求快乐为中心”的，可用于生活方式或伦理/哲学观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not hedonistic; not focused on seeking pleasure as the main goal of life or behavior","zh":"非享乐主义的；不以追求快乐为主要目标的"},"examples":[{"en":"She chose a nonhedonistic lifestyle, valuing service and discipline over comfort.","zh":"她选择了非享乐主义的生活方式，更重视服务与自律，而不是舒适。"},{"en":"The monastery promotes a nonhedonistic approach to daily life.","zh":"这座修道院提倡一种非享乐主义的日常生活态度。"},{"en":"His nonhedonistic view of success emphasizes responsibility, not luxury.","zh":"他对成功的非享乐主义看法强调责任，而非奢华。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in discussion of ethics or philosophy) not based on the belief that pleasure is the highest good","zh":"（伦理学/哲学语境）非“快乐至上”的；不以快乐为最高善的"},"examples":[{"en":"Some nonhedonistic theories argue that meaning and virtue matter more than pleasure.","zh":"一些非享乐主义理论认为，意义与美德比快乐更重要。"},{"en":"The article compares hedonistic and nonhedonistic accounts of well-being.","zh":"这篇文章比较了享乐主义与非享乐主义的幸福/福祉理论。"}]}],"synonyms":["ascetic","self-disciplined","austere","nonindulgent","temperate"],"phonetic":"/ˌnɑnˌhiːdəˈnɪstɪk/","extraExplanation":["“non-”是常见否定前缀，表示“非、不是”。“hedonistic”来自“hedonism（享乐主义）”，常用于描述把“快乐/享受”当作人生主要目标的态度；因此“nonhedonistic”多用来形容更重视自律、责任、意义、信仰或道德等价值的生活观。","使用场景上，它既可用于日常描述（nonhedonistic lifestyle），也常见于学术讨论（nonhedonistic theories of well-being）。语气通常较中性、偏正式。"]}
{"word":"nonhedonistically","summary":{"en":"“Nonhedonistically” means doing something without focusing on pleasure or indulgence as the main goal.","zh":"“nonhedonistically”表示做某事时不以享乐或放纵为主要目标。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not focused on pleasure-seeking; without making pleasure the main goal.","zh":"以非享乐主义的方式；不以追求快乐为主要目标。"},"examples":[{"en":"She tries to live nonhedonistically, valuing responsibility over constant entertainment.","zh":"她努力以非享乐主义的方式生活，更看重责任而不是持续的娱乐。"},{"en":"They planned the trip nonhedonistically, choosing simple meals and free activities.","zh":"他们以非享乐主义的方式规划旅行，选择简单的餐食和免费的活动。"},{"en":"He spoke nonhedonistically about success, emphasizing service and self-discipline.","zh":"他以非享乐主义的口吻谈论成功，强调服务他人与自律。"}]}],"synonyms":["ascetically","austerely","self-disciplinedly","temperately","moderately"],"phonetic":"/ˌnɑnˌhidəˈnɪstɪkli/","extraExplanation":["“hedonism（享乐主义）”来自希腊语，核心思想是把“快乐/愉悦”视为人生的重要（或最高）目标；“nonhedonistically”常用于哲学、心理学、宗教或生活方式讨论，表达一种更重视责任、意义、节制或长期价值的态度。","构词上：non-（不、非）+ hedonistic（享乐主义的）+ -ally（副词形式，常写作 -ically）。拼写较长，实际写作中也常用更简单的表达，如 “not for pleasure” 或 “in a disciplined way”。"]}
{"word":"nonheinous","summary":{"en":"“Nonheinous” means “not heinous”—not extremely evil or morally shocking, often used in formal or legal contexts.","zh":"nonheinous 意为“并非滔天罪恶的”，常见于正式或法律语境，用来强调某行为/罪行没有极端恶劣到“令人发指”的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not heinous; not extremely wicked, evil, or morally shocking.","zh":"非滔天罪恶的；不极其邪恶或令人发指的。"},"examples":[{"en":"The judge described the offense as serious but nonheinous.","zh":"法官形容这起犯罪很严重，但并非滔天罪恶。"},{"en":"She argued that his mistake was careless, not nonheinous by any moral standard.","zh":"她认为他的错误是粗心造成的，并非任何道德标准下都称得上“滔天罪恶”。"}]}],"synonyms":["not heinous","less serious","non-egregious","minor","not atrocious"],"phonetic":"/nɑnˈheɪnəs/","extraExplanation":["“nonheinous”由前缀 non-（“不、非”）+ heinous（“极其邪恶的、令人发指的”）构成，但在日常英语中不算常见；更自然的说法通常是 “not heinous” 或 “not a heinous crime”。","“heinous”常用于法律或新闻语境，形容极端恶劣的罪行（如 heinous crimes）。因此“nonheinous”多出现在正式、强调对比的场合。"]}
{"word":"nonheinously","summary":{"en":"“Nonheinously” means “not in a heinous (extremely wicked or shocking) way,” but it’s very rare; “not heinously” is more common.","zh":"“nonheinously”意为“并非以极其恶劣／骇人的方式”，但很少用；更常见说法是“not heinously”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not heinous (not extremely wicked, cruel, or morally shocking).","zh":"以不残忍／不邪恶／不骇人的方式；并非极其恶劣地。"},"examples":[{"en":"The judge noted that the act, while illegal, was not done nonheinously but under pressure and confusion.","zh":"法官指出，这一行为虽然违法，但并非以“极其恶劣”的方式实施，而是在压力与混乱之下发生的。"},{"en":"People argued that the character behaved nonheinously compared with the villain.","zh":"人们认为，与反派相比，这个角色的行为并不算极其恶劣。"}]}],"synonyms":["not heinously","in a non-heinous way","not atrociously","not viciously"],"phonetic":"/nɑnˈheɪnəsli/","extraExplanation":["“nonheinously”非常罕见，写作和口语中更常见的表达是“not heinously”或“in a non-heinous way”。","它由前缀“non-”（不、非）+“heinously”（极其恶劣地）构成；如果你是在正式写作中使用，建议改用更常见的替代表达以避免显得生造或不自然。"]}
{"word":"nonheinousness","summary":{"en":"Nonheinousness means the quality of not being heinous—i.e., not extremely evil or shocking.","zh":"nonheinousness 指“并非极其恶劣”的性质或状态，即不算十恶不赦、不算骇人听闻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being heinous (not extremely evil, shocking, or morally disgusting)","zh":"不属极其恶劣（非十恶不赦、非骇人听闻）的性质或状态"},"examples":[{"en":"The defense argued for the nonheinousness of the act, saying it was a mistake rather than cruelty.","zh":"辩方主张该行为并非极其恶劣，称之为失误而非残忍。"},{"en":"Public debate focused on whether the incident’s nonheinousness should lead to a lighter punishment.","zh":"公众讨论的焦点是：若事件并非十恶不赦，是否应当从轻处罚。"}]}],"synonyms":["lack of heinousness","non-atrociousness","lesser severity","mildness (of the offense)"],"phonetic":"/ˌnɑnˈheɪnəsnəs/","extraExplanation":["这是一个非常少见、偏书面/法律语境的抽象名词，由前缀 non-（“非、不”）+ heinous（“极其恶劣的”）+ -ness（把形容词变成名词的后缀）构成。日常英语里更常说：the act was not heinous / it wasn’t that heinous / the lesser severity（程度较轻）。"]}
{"word":"nonhematic","summary":{"en":"Nonhematic means “not related to blood” (a rare, technical adjective).","zh":"nonhematic 意为“与血液无关的”（较少见的医学/生物学形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical) Not related to blood; not involving blood or blood vessels.","zh":"（技术用语）非血液的；与血液或血管无关的。"},"examples":[{"en":"The researcher compared hematic and nonhematic tissue responses to the drug.","zh":"研究人员比较了血液相关组织与非血液组织对该药物的反应。"},{"en":"Most of the side effects were nonhematic, such as nausea and fatigue.","zh":"大多数副作用是非血液方面的，例如恶心和疲劳。"}]}],"synonyms":["non-hematologic","extravasular","non-blood-related"],"phonetic":"ˌnɑnhiˈmætɪk","extraExplanation":["“nonhematic”较少见，多出现在医学/生物学写作中。更常用的表达包括：non-hematologic（非血液/血液学相关的）、extravasular（血管外的）、non-blood-related（与血液无关的）。","词根提示：hematic 来自 hema-/hemo-（血），-ic 表示“……的”；non- 表示否定，因此整体就是“非血液的/不涉及血的”。"]}
{"word":"nonheme","summary":{"en":"Nonheme means “not part of heme,” especially referring to plant-based dietary iron (nonheme iron).","zh":"nonheme 指“非血红素的”，常用于营养学中表示植物性来源的铁（非血红素铁）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not part of heme (the iron-containing compound in hemoglobin and some proteins); used especially for iron that comes from plants or supplements rather than from animal blood-based sources.","zh":"非血红素的；不属于血红素（存在于血红蛋白等蛋白中的含铁成分）的；尤指来自植物性食物或补充剂、而非动物血红素来源的铁。"},"examples":[{"en":"Spinach contains mostly nonheme iron.","zh":"菠菜中主要含有非血红素铁。"},{"en":"Vitamin C can help your body absorb nonheme iron.","zh":"维生素C可以帮助身体吸收非血红素铁。"},{"en":"Doctors sometimes compare heme and nonheme iron when discussing anemia.","zh":"医生在讨论贫血时有时会比较血红素铁和非血红素铁。"}]},{"partOfSpeech":"n.","definition":{"en":"nonheme iron (iron not bound in heme), especially the type of dietary iron found in plant foods and many supplements.","zh":"非血红素铁；指不与血红素结合的铁，尤指植物性食物及许多补充剂中的膳食铁。"},"examples":[{"en":"Beans are a good source of nonheme.","zh":"豆类是非血红素铁的良好来源。"},{"en":"This cereal is fortified with nonheme.","zh":"这种麦片添加（强化）了非血红素铁。"}]}],"synonyms":["non-heme","nonheme iron","inorganic iron"],"phonetic":"/ˌnɑnˈhim/","extraExplanation":["“nonheme”更常见的写法是带连字符的“non-heme”。在营养学里常把铁分为“heme iron（血红素铁）”与“nonheme iron（非血红素铁）”：前者主要来自肉类、动物肝脏等，通常更容易被人体吸收；后者多来自植物性食物，吸收率受影响更大。","影响非血红素铁吸收的常见因素：维生素C、柠檬/醋等酸性环境可促进吸收；茶/咖啡中的单宁、多量钙、植酸（如部分全谷物/豆类中的成分）可能抑制吸收。"]}
{"word":"nonhemophilic","summary":{"en":"Nonhemophilic means “not having hemophilia.”","zh":"nonhemophilic 意为“非血友病的/不患血友病的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having hemophilia; relating to a person or case where blood clotting is normal (i.e., not affected by hemophilia).","zh":"非血友病的；不患血友病的；指凝血功能并非因血友病而异常的人或情况。"},"examples":[{"en":"The patient is nonhemophilic, so the bleeding is likely due to another cause.","zh":"该患者非血友病患者，因此出血更可能由其他原因引起。"},{"en":"In nonhemophilic individuals, minor cuts usually stop bleeding quickly.","zh":"在非血友病个体中，小伤口通常会很快止血。"}]}],"synonyms":["not hemophilic","without hemophilia"],"phonetic":"/ˌnɑnˌhiːməˈfɪlɪk/","extraExplanation":["“non-”是英语中常见的否定前缀，表示“非……、不……”。“hemophilic”意为“血友病的/患血友病的”，因此“nonhemophilic”通常用于医学语境，强调出血或凝血问题并不是由血友病造成的。","血友病（hemophilia）是一组遗传性凝血障碍，常见为A型（缺乏凝血因子VIII）或B型（缺乏凝血因子IX）。在医学表述中，医生可能用“nonhemophilic”来区分病因、决定是否需要按血友病路径进行检查或处理。"]}
{"word":"nonhepatic","summary":{"en":"Nonhepatic means “not related to the liver” or “occurring outside the liver.”","zh":"nonhepatic 指“与肝脏无关的”或“发生在肝外的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to the liver; occurring outside the liver or not involving liver function.","zh":"非肝脏的；与肝脏无关的；发生在肝外或不涉及肝功能的。"},"examples":[{"en":"The doctor suspected a nonhepatic cause of the patient’s jaundice.","zh":"医生怀疑患者黄疸的原因是非肝脏性的。"},{"en":"Some drugs are cleared by nonhepatic pathways, such as the kidneys.","zh":"有些药物通过非肝脏途径清除，例如经由肾脏。"},{"en":"They ruled out liver disease and looked for nonhepatic sources of pain.","zh":"他们排除了肝病，转而寻找疼痛的非肝脏来源。"}]}],"synonyms":["extrahepatic","non-liver","not hepatic"],"phonetic":"/nɑn hɪˈpætɪk/","extraExplanation":["构词：non- 表示“非/不”，hepatic 来自希腊语 hēpar（肝脏），所以 nonhepatic 字面意思就是“非肝脏的”。","医学语境中，nonhepatic 常用来描述“症状/指标的原因不在肝脏”或“代谢、清除、病变发生在肝外”。有时也会与 extrahepatic（肝外的）并列使用，但 nonhepatic 更强调“与肝无关”，extrahepatic 更强调“位置在肝外”。"]}
{"word":"nonhereditability","summary":{"en":"Nonhereditability means something is not passed down genetically from parents to children.","zh":"nonhereditability 指某种特征或疾病“不具遗传性”，不会通过基因从父母传给子女。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fact or quality of not being passed from parents to children through genes; not hereditary","zh":"（特征/疾病等）不具遗传性；不能通过基因从父母传给子女的性质"},"examples":[{"en":"Most cases of this condition are due to infection, so its nonhereditability is important for counseling families.","zh":"这种病的大多数病例由感染引起，因此它的不具遗传性对家庭咨询很重要。"},{"en":"Researchers tested the nonhereditability of the trait by comparing identical and non-identical twins.","zh":"研究人员通过比较同卵与异卵双胞胎来检验该特征是否不具遗传性。"}]}],"synonyms":["non-inheritability","nonheritable (adj.)","not hereditary","non-genetic"],"phonetic":"/ˌnɑn.həˌrɛd.əˈtæb.ə.lə.ti/","extraExplanation":["这是一个相对少见、偏学术/医学/遗传学语境的名词。更常见的表达通常是 **nonheritable**（形容词，“不遗传的”）或 **not hereditary / non-genetic**。","构词上：**non-**（不）+ **hereditability**（可遗传性）。因此它强调的是“可遗传性为零/不存在”，常用于研究结论、风险沟通、遗传咨询等场合。","注意区分：**nonhereditability**（不遗传）≠ **unknown heritability**（遗传性未知）≠ **low heritability**（遗传性低）。"]}
{"word":"nonhereditable","summary":{"en":"“Nonhereditable” means not inheritable—not passed from parents to children or from one person to another by inheritance.","zh":"“nonhereditable”指“不可遗传/不可继承的”，即不能通过遗传或继承传递。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be inherited or passed down (especially traits, diseases, or property).","zh":"不可遗传的；不能继承的（尤指性状、疾病或财产）。"},"examples":[{"en":"This condition is nonhereditable, so your children will not inherit it from you.","zh":"这种情况是不可遗传的，所以你的孩子不会从你这里遗传到。"},{"en":"The title was declared nonhereditable and ended with the current holder.","zh":"该头衔被宣布为不可继承，并在现任持有人之后终止。"}]}],"synonyms":["nonheritable","non-inheritable","not inheritable"],"phonetic":"/ˌnɑn həˈrɛdɪtəbəl/","extraExplanation":["“nonhereditable”比较少见，更常用的表达是“nonheritable”或“non-inheritable”。在医学语境中，通常说 a nonheritable condition / trait；在法律或制度语境中，常说 a non-inheritable title / right。","词根方面：hered- 来自“heredity（遗传）”；-able 表示“能够……的”；non- 表示否定。"]}
{"word":"nonhereditably","summary":{"en":"“Nonhereditably” means “not by genetic inheritance.”","zh":"“nonhereditably”表示“不是通过基因遗传的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not passed from parents to children through genes; not genetically inherited.","zh":"以非遗传的方式；不是通过基因从父母传给子女的。"},"examples":[{"en":"This disorder occurs nonhereditably in most cases, meaning it usually is not passed down in families.","zh":"这种疾病在大多数情况下是非遗传性的，也就是说通常不会在家族中代代相传。"},{"en":"The trait appeared nonhereditably, likely due to an environmental factor rather than genetics.","zh":"这种特征以非遗传的方式出现，可能是环境因素而不是遗传造成的。"}]}],"synonyms":["nonhereditarily","not hereditarily","not by inheritance","sporadically (in genetics contexts)"],"phonetic":"/ˌnɑn həˈrɛdɪtəbli/","extraExplanation":["“nonhereditably”比较少见，更常见的表达是“not hereditary”或“nonhereditary”。在医学与遗传学语境中，hereditary强调“通过基因遗传”；而日常说“inherited”有时也可泛指“从家庭中得到的”（如习惯、财富），但在科学语境里通常指遗传或家族遗传倾向。"]}
{"word":"nonhereditarily","summary":{"en":"“Nonhereditarily” means “not in an inherited/genetic way.”","zh":"“nonhereditarily”表示“非遗传地；不是通过遗传方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not inherited through genes or family lineage; not passed from parents to children.","zh":"以非遗传的方式；不是通过基因或家族血缘从父母传给子女。"},"examples":[{"en":"The condition appears nonhereditarily, so family members are not automatically at higher risk.","zh":"这种情况呈现为非遗传性，因此家人并不一定会自动面临更高风险。"},{"en":"Some traits develop nonhereditarily due to environment, diet, or lifestyle.","zh":"有些特征会因环境、饮食或生活方式而以非遗传的方式形成。"}]}],"synonyms":["not hereditarily","non-genetically","non-inheritedly","sporadically (in medical context)"],"phonetic":"/ˌnɑn həˈrɛdəˌtɛrəli/","extraExplanation":["这个词比较少见，更常见的表达是 **not hereditary / nonhereditary**（形容词）或 **sporadic**（“散发性的/非家族遗传的”，在医学里常用）。","构词：**non-**（不、非）+ **hereditarily**（以遗传方式）。多用于医学/遗传学语境，强调某种疾病或特征“不是通过遗传传下来的”，可能与新发突变、环境因素或偶发原因有关。","拼写注意：美式英语通常写作 **nonhereditarily**（不加连字符），但在学术写作中也可能见到 **non-hereditarily**。"]}
{"word":"nonhereditariness","summary":{"en":"Nonhereditariness means the state of not being hereditary (not passed down through genes).","zh":"nonhereditariness 指“非遗传性”，即不会通过基因遗传给下一代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or fact of not being hereditary (not passed from parents to children through genes).","zh":"非遗传性；不具遗传的性质（不会通过基因从父母传给子女）。"},"examples":[{"en":"The doctor explained the nonhereditariness of the condition, so the patient’s children were unlikely to be at risk.","zh":"医生解释说这种疾病不具遗传性，因此患者的孩子很可能不会有风险。"},{"en":"Scientists debated the nonhereditariness of the trait and looked for environmental causes instead.","zh":"科学家讨论这种特征是否非遗传，并转而寻找环境因素的原因。"}]}],"synonyms":["noninheritance (rare)","lack of heredity","nonhereditary nature"],"phonetic":"/ˌnɑn həˈrɛdəˌtɛri nəs/","extraExplanation":["这个词比较少见，更常见的说法是 **“not hereditary”**（不遗传）或 **“nonhereditary”**（非遗传的，形容词）。","构词：**non-**（否定）+ **hereditary**（遗传的）+ **-ness**（名词后缀），合起来表示“非遗传这一性质”。","语境上多见于医学/遗传学写作：强调某种疾病或特征主要来自感染、生活方式或环境因素，而不是基因遗传。"]}
{"word":"nonhereditary","summary":{"en":"Nonhereditary means not inherited genetically from parents.","zh":"nonhereditary 指“非遗传的”，即不是通过基因从父母遗传而来。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not passed from parents to children through genes; not inherited.","zh":"非遗传的；不是通过基因由父母传给子女的；非先天遗传的。"},"examples":[{"en":"Most cases of this cancer are nonhereditary and happen by chance over time.","zh":"这种癌症的大多数病例是非遗传性的，往往是随着时间偶然发生的。"},{"en":"His condition was nonhereditary, so his siblings did not face a higher genetic risk.","zh":"他的病是非遗传性的，所以兄弟姐妹并没有更高的遗传风险。"}]}],"synonyms":["noninherited","not hereditary","non-genetic","sporadic"],"phonetic":"/ˌnɑn həˈrɛdəˌtɛri/","extraExplanation":["non- 是英语里常见的否定前缀，表示“非……、不是……”。hereditary 来自 heredity（遗传），常用于医学语境（例如 hereditary disease“遗传病”）。因此 nonhereditary 常见于医生说明“不是遗传导致”的情况。","日常交流里更常见的写法/说法是 not hereditary 或 non-genetic（非基因性的）。在正式医学写作中也会用 sporadic（散发性的）来表示“不是家族遗传、偶发”的病例。"]}
{"word":"nonheretical","summary":{"en":"Nonheretical means “not heretical”—in line with accepted or orthodox belief.","zh":"nonheretical 意为“非异端的”，即符合公认或正统信念的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not heretical; not opposed to accepted religious (or strongly held) beliefs","zh":"非异端的；不违背（宗教或强烈信念的）正统/公认教义的"},"examples":[{"en":"The committee emphasized that his views were nonheretical and fit within mainstream teaching.","zh":"委员会强调他的观点并非异端，符合主流教导。"},{"en":"She offered a nonheretical interpretation of the passage that most readers accepted.","zh":"她对这段文字给出了一种非异端的解读，大多数读者都能接受。"},{"en":"In a sensitive debate, he chose careful, nonheretical language to avoid misunderstanding.","zh":"在一场敏感的辩论中，他选择谨慎、非异端的措辞以避免误解。"}]}],"synonyms":["orthodox","acceptable","mainstream","conventional","non-heterodox"],"phonetic":"/ˌnɑn.həˈrɛtɪkəl/","extraExplanation":["“non-”表示“非/不”，加在“heretical（异端的）”前面，构成“nonheretical（非异端的）”。这个词在日常英语中不算常见，更多出现在宗教史、神学讨论，或比喻性语境（如“思想是否正统”）里。","“heretical”原本多用于宗教：指违背教会公认教义的观点；在现代也可引申为“离经叛道、挑战主流共识”。因此“nonheretical”也常带有“符合主流/较为正统”的含义。"]}
{"word":"nonheretically","summary":{"en":"Nonheretically means “not heretically,” i.e., in an orthodox or accepted religious way.","zh":"nonheretically 意为“非异端地”，即以正统或被接受的宗教方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not heretical; in an orthodox (accepted, official) religious way","zh":"以非异端的方式；以正统（被官方或主流接受的）宗教方式"},"examples":[{"en":"The scholar argued that the text can be read nonheretically within the tradition.","zh":"这位学者认为，这段文字可以在该传统内部以非异端的方式来解读。"},{"en":"He tried to explain the doctrine nonheretically so no one would accuse him of heresy.","zh":"他试图以非异端的方式解释教义，以免被指控为异端。"}]}],"synonyms":["orthodoxly","in an orthodox way","doctrinally"],"phonetic":"/ˌnɑn.həˈrɛtɪkli/","extraExplanation":["“non-”表示否定（not），加在“heretically”（异端地）前面，构成“nonheretically”。它多见于宗教学、历史、文学批评等语境，用来强调某种解读或做法符合主流/官方教义，而不是挑战权威。","“heresy（异端）”在不同宗教与历史时期含义和严重程度不同；现代学术写作里常是较中性的分类用语，但在某些社区语境中可能带有强烈指责意味，使用时要注意语气与场合。"]}
{"word":"nonheritability","summary":{"en":"Nonheritability means a trait or condition is not passed down genetically from parents to children.","zh":"nonheritability 指某种性状或状况不会通过遗传从父母传给子女。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being heritable; the fact that a trait or condition is not passed from parents to offspring through genes","zh":"不可遗传性；指某种性状或状况不会通过基因从父母传给后代"},"examples":[{"en":"The researcher emphasized the nonheritability of the injury because it was caused by an accident, not genes.","zh":"研究者强调这种伤害的不可遗传性，因为它是事故造成的，而不是基因导致的。"},{"en":"In the report, nonheritability was mentioned to reassure families that the disorder is not inherited.","zh":"报告中提到“不可遗传性”，以让家庭放心这种疾病不是遗传来的。"}]}],"synonyms":["non-inheritability","lack of heritability","not heritable (common phrasing)"],"phonetic":"/ˌnɑn.həˌrɪt.əˈbɪl.ə.ti/","extraExplanation":["“nonheritability”多用于遗传学/行为遗传学语境。注意与“heritability（遗传力/遗传度）”区分：遗传力通常讨论的是某一群体中“差异（变异）有多少比例与基因差异相关”，而不是说某个个体的某个特征“有多少是遗传的”。因此，一个特征可能在某些环境下表现为低遗传力（看起来更“nonheritable”），但在另一群体或环境下遗传力会不同。","该词在学术写作中更常见；日常表达里更常用“not heritable”或“not inherited”。"]}
{"word":"nonheritable","summary":{"en":"Nonheritable means not passed on by inheritance—most often in genetics (not inherited in genes), and sometimes in law (not transferable to heirs).","zh":"nonheritable 指“不可通过继承传递的”，多用于遗传学（不会通过基因遗传），也可用于法律语境（不可转给继承人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be inherited or passed from parents to children (especially about traits, diseases, or conditions).","zh":"不可遗传的；不会从父母传给子女的（尤指特征、疾病或状况）。"},"examples":[{"en":"A scar from an accident is nonheritable because it isn’t in your genes.","zh":"事故留下的疤痕是不可遗传的，因为它不在基因里。"},{"en":"Most infections are nonheritable, though some people may inherit a higher risk of getting them.","zh":"大多数感染是不可遗传的，不过有些人可能会遗传到更高的易感风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not transferable by inheritance under the law (about property, titles, rights, or membership).","zh":"（法律/财产等）不可通过继承转让的；不可继承的。"},"examples":[{"en":"The scholarship is nonheritable, so it cannot be passed to a family member.","zh":"这项奖学金不可继承，因此不能转给家人。"},{"en":"In some systems, certain honors are nonheritable and end with the recipient.","zh":"在某些制度中，某些荣誉不可继承，会随着获得者而终止。"}]}],"synonyms":["noninheritable","noninherited","not hereditary","not inheritable"],"phonetic":"/ˌnɑnˈhɛrɪtəbəl/","extraExplanation":["“non-”表示“非/不”，加在“heritable（可遗传的/可继承的）”前形成反义词。“nonheritable”常见于医学遗传学语境（遗传性 vs. 非遗传性），也可用于法律语境（可继承财产/权利 vs. 不可继承）。","注意区别：nonheritable（不可遗传/不可继承）≠ hereditary（遗传的/世袭的）≠ inheritable（可继承的，偏法律或财产语境；在遗传学中也可用但不如 heritable 常见）。"]}
{"word":"nonheritably","summary":{"en":"“Nonheritably” means “not in an inherited way; not passed down genetically.”","zh":"“nonheritably”表示“非遗传地；不是通过基因遗传而来的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not inherited (not passed from parent to child through genes).","zh":"以非遗传的方式；不是通过基因从父母传给子女的。"},"examples":[{"en":"This disorder usually occurs nonheritably, often due to a new mutation.","zh":"这种疾病通常是非遗传性出现的，往往是由于新的突变。"},{"en":"The trait appears nonheritably in most cases, meaning family history may be absent.","zh":"在大多数情况下，这个特征呈现为非遗传性的，也就是说可能没有家族史。"}]}],"synonyms":["nonhereditarily","not heritably","not genetically","not inherited"],"phonetic":"ˌnɑnˈhɛrɪtəbli","extraExplanation":["“nonheritably”较少见，学术写作中更常用“nonheritable”（形容词）或“not inherited / not heritable”。","常见语境是医学与遗传学：用来强调某种疾病/特征并非由父母遗传，而可能来自环境因素、偶发（de novo）基因突变或后天变化。"]}
{"word":"nonheritor","summary":{"en":"“Nonheritor” means a person who is not an heir and does not inherit (especially in a will/estate context).","zh":"“nonheritor”指非继承人：在遗嘱/遗产语境中不属于继承人、不会继承的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is not an heir; someone who has no legal right (or is not chosen) to inherit money, property, or a title from someone who has died.","zh":"（法律或一般语境中）非继承人；没有法律权利（或未被指定）继承逝者财产、金钱或头衔的人。"},"examples":[{"en":"Because the will named only his sister, he was a nonheritor and could not claim the house.","zh":"因为遗嘱只写了他姐姐的名字，他就成了非继承人，不能主张那套房子。"},{"en":"The lawyer explained that as a nonheritor, she would not receive any part of the estate.","zh":"律师解释说，作为非继承人，她不会获得遗产的任何部分。"}]}],"synonyms":["non-heir","not an heir","non-beneficiary","not a beneficiary"],"phonetic":"nɑnˈhɛrɪtɚ","extraExplanation":["“nonheritor”不是很常见的标准词（很多主流词典不一定收录）。在真实法律英语里，更常用的说法是 **not an heir** / **a non-heir** / **not a beneficiary**（不是受益人）。","含义上也要注意区分：**nonheritor** 只是“没有继承资格/未继承的人”；而 **disinherited person**（被剥夺继承权的人）强调“本来可能继承，但被明确排除”；**omitted heir / pretermitted heir** 指“遗嘱遗漏的子女等继承人”，在一些州可能仍有法定份额。"]}
{"word":"nonhero","summary":{"en":"Nonhero means an antihero—a main character who lacks traditional heroic qualities.","zh":"nonhero 指“反英雄/非典型英雄”：缺乏传统英雄特质的主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a main character (or important character) in a story who lacks traditional heroic qualities; an antihero","zh":"（小说、电影、戏剧等中的）非典型英雄；缺乏传统英雄品质的主角；反英雄"},"examples":[{"en":"The novel’s nonhero is anxious and selfish, but he feels painfully real.","zh":"这部小说的“非英雄”主角焦虑又自私，但非常真实。"},{"en":"Instead of saving the world, the nonhero mostly tries to survive and avoid trouble.","zh":"他没有拯救世界，只是大多时候努力活下去、躲开麻烦。"},{"en":"Many modern TV dramas are built around a nonhero who makes morally messy choices.","zh":"许多现代电视剧都围绕“非英雄/反英雄”展开，他会做出道德上很纠结的选择。"}]}],"synonyms":["antihero","anti-hero","unheroic protagonist","everyman (in some contexts)"],"phonetic":"/ˌnɑnˈhɪroʊ/","extraExplanation":["“nonhero”常见于文学/影评语境，意思基本等同于“antihero（反英雄）”。有时也会写成“non-hero”。","和“villain（反派）”不同：nonhero不一定是坏人，只是缺少传统英雄的高尚、勇敢、自律等特质。","在叙事上，nonhero常用来呈现“普通人/有缺点的人”当主角的现实感与复杂性。"]}
{"word":"nonheroes","summary":{"en":"“Nonheroes” means people who are not heroes—ordinary people or characters without heroic qualities.","zh":"“nonheroes”指“非英雄的人”——普通人或缺乏英雄特质的人（或角色）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are not heroes—ordinary people, or characters who lack the bravery, fame, or moral ideal typically associated with heroes.","zh":"非英雄的人——普通人，或缺乏典型“英雄”所具有的勇敢、名声或道德理想的人（或角色）。"},"examples":[{"en":"The novel focuses on nonheroes: tired workers, worried parents, and kids just trying to get by.","zh":"这本小说关注的是“非英雄”们：疲惫的工人、焦虑的父母，以及只是努力生活的孩子。"},{"en":"In the film, the nonheroes survive through cooperation rather than dramatic acts of courage.","zh":"在这部电影里，这些非英雄靠合作活下来，而不是靠戏剧性的英勇行为。"},{"en":"History is shaped not only by heroes, but also by nonheroes who do small, steady work.","zh":"历史不仅由英雄塑造，也由那些做着细小却持续工作的非英雄塑造。"}]}],"synonyms":["ordinary people","common people","everyday people","non-heroes","the uncelebrated"],"phonetic":"ˌnɑnˈhiroʊz","extraExplanation":["“non-”是英语里常见的否定前缀，表示“非……、不是……”。“nonhero”意为“非英雄”，复数就是“nonheroes”。","这个词常用于文学、电影或社会评论中，用来强调“普通人”的经历与价值，和“hero/heroic narrative（英雄叙事）”形成对比。"]}
{"word":"nonheroic","summary":{"en":"Nonheroic means “not heroic”—ordinary, modest, or lacking dramatic heroism.","zh":"nonheroic 意为“非英雄式的/不具英雄气概的”，常指平凡、朴素或不渲染英雄主义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not heroic; lacking the bravery, grandeur, or dramatic nobility usually associated with heroes. Often used to describe something ordinary, modest, or deliberately unglamorous.","zh":"非英雄式的；不具英雄气概的；常用来形容平凡、朴素或刻意不渲染、不夸张的风格与人物。"},"examples":[{"en":"The novel focuses on nonheroic choices—small acts of kindness rather than dramatic rescue scenes.","zh":"这部小说关注的是非英雄式的选择——与其说是戏剧性的营救场面，不如说是一些微小的善意。"},{"en":"He tells the story in a nonheroic tone, emphasizing mistakes and doubt.","zh":"他用一种非英雄式的语气讲述这个故事，强调错误与犹豫。"},{"en":"The film’s main character is deliberately nonheroic: tired, scared, and very human.","zh":"电影的主角刻意被塑造成非英雄式的：疲惫、害怕，非常“人”。"}]}],"synonyms":["unheroic","ordinary","undramatic","modest","humble"],"phonetic":"/ˌnɑn.hɪˈroʊ.ɪk/","extraExplanation":["“non-”是否定前缀，表示“非……/不……”。因此 nonheroic 直译为“非英雄的”。它常见于文学批评、电影评论或历史写作，用来对比“heroic（英雄式的）叙事/姿态”，强调现实、日常、反英雄（anti-hero）或去神化的表达。","注意区分 nonheroic 和 antiheroic：nonheroic 通常只是“不英雄、很普通”；antiheroic 更常带“反英雄、刻意反对英雄主义/反传统英雄叙事”的意味。"]}
{"word":"nonheroical","summary":{"en":"Nonheroical means “not heroic; ordinary rather than dramatic or brave in a heroic way.”","zh":"nonheroical 指“非英雄式的；更偏日常普通，而非戏剧化或英勇的英雄姿态”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not heroic; lacking the qualities usually associated with a hero (such as bravery, greatness, or dramatic action).","zh":"非英雄式的；不具备通常被认为是英雄特质的（如勇敢、伟大或戏剧性行动）。"},"examples":[{"en":"Most of our days are nonheroical—quiet work, small choices, and helping people in simple ways.","zh":"我们大多数日子都不是英雄式的——安静地工作、做一些小选择，用简单的方式帮助别人。"},{"en":"The novel focuses on the nonheroical side of war: boredom, fear, and waiting.","zh":"这部小说关注战争中非英雄式的一面：无聊、恐惧与等待。"}]}],"synonyms":["nonheroic","unheroic","ordinary","everyday","undramatic"],"phonetic":"/ˌnɑn.həˈroʊ.ɪ.kəl/","extraExplanation":["“nonheroical”较少见，更常见的拼写是“nonheroic”。两者意思基本相同，但在现代英语写作中通常建议用“nonheroic”。","这个词常用于文学或评论写作，用来强调“普通、日常、反戏剧化”的角度（不是贬义，只是对比“heroic/heroical”的宏大叙事）。"]}
{"word":"nonheroically","summary":{"en":"Nonheroically means “in a not-heroic way,” often implying a lack of bravery or a plain, undramatic action.","zh":"nonheroically 的意思是“以不英勇/不英雄式的方式”，常暗示缺少勇气或行动平淡、不戏剧化。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not heroic; without bravery, nobility, or dramatic self-sacrifice (often used critically or humorously).","zh":"以不英勇的方式；不勇敢、不崇高、没有戏剧性的牺牲精神（常带批评或调侃语气）。"},"examples":[{"en":"He quit nonheroically, leaving the hardest work to everyone else.","zh":"他不怎么光彩地退出了，把最难的工作留给了其他人。"},{"en":"The story ends nonheroically: nobody saves the day, and life just goes on.","zh":"故事以不英雄式的方式结束：没有人力挽狂澜，生活只是继续。"},{"en":"She admitted, nonheroically but honestly, that she was scared.","zh":"她坦白承认自己害怕——不算英勇，但很诚实。"}]}],"synonyms":["unheroically","cowardly (sometimes, stronger/negative)","without bravado","plainly","ingloriously (sometimes)"],"phonetic":"/ˌnɑn.həˈroʊ.ɪ.kli/","extraExplanation":["“nonheroically”= non-（否定前缀）+ heroic（英勇的）+ -ally（副词后缀）。意思通常不是“普通地”，而是强调“缺少英雄气概/不够英勇”，语气可能带评价。","这个词不算常用，更常见的表达有：“not heroically”“in an unheroic way”。在写作里用它，往往是在制造反差或讽刺：比如期待英雄式结局，但现实却平淡或狼狈。","注意它也可以更中性：并非指“懦弱”，有时只是说“没有戏剧性的英雄行为”，强调现实、平凡或坦诚。"]}
{"word":"nonheroicalness","summary":{"en":"Nonheroicalness means “lack of heroism” or “the state of not being heroic,” often used in literary or critical writing.","zh":"nonheroicalness 指“不英雄（气概）/缺乏英雄主义的状态”，多见于文学或评论语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being heroic; lack of heroism (often implying ordinariness or anti-hero qualities)","zh":"不英雄（气概）之特质；缺乏英雄主义（常暗示平凡、反英雄式的特征）"},"examples":[{"en":"The story’s power comes from the character’s nonheroicalness—she survives through patience, not glory.","zh":"这个故事的力量来自角色的“不英雄性”——她靠耐心而非荣耀活下来。"},{"en":"He wrote about the nonheroicalness of daily life: paying bills, cooking dinner, taking care of family.","zh":"他写日常生活的“不英雄性”：付账单、做晚饭、照顾家人。"}]}],"synonyms":["lack of heroism","non-heroism","unheroicness","ordinariness"],"phonetic":"/nɑn.həˈroʊ.ɪkəl.nəs/","extraExplanation":["这是一个非常少见、带有“临时造词/写作用词”味道的名词。更常见的表达是 non-heroism、lack of heroism，或用形容词 not heroic / unheroic 来说。","构词法：non-（不、非）+ heroic（英雄的）+ -al（形容词后缀，使其更像“具有……性质”）+ -ness（名词后缀，表示“……性/状态”）。","语用上常用于文学/评论写作，强调人物或叙事的“反英雄”“去英雄化”色彩：不是宏大壮举，而是普通人的选择、妥协与坚持。"]}
{"word":"nonheroicness","summary":{"en":"Nonheroicness means the quality of not being heroic; it describes ordinary or unheroic behavior.","zh":"nonheroicness 指“不英勇/不具英雄气概”的性质，用来描述普通或不英雄式的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being heroic; a lack of heroism (often suggesting ordinary, unglamorous, or even cowardly behavior)","zh":"不英勇；缺乏英雄气概（常暗示普通、不光彩，甚至有点怯懦的表现）"},"examples":[{"en":"He spoke honestly about his nonheroicness during the crisis—he froze and didn’t know what to do.","zh":"他坦诚地谈到自己在危机中的“不英勇”——当时他僵住了，不知道该做什么。"},{"en":"The novel focuses on everyday nonheroicness rather than grand acts of courage.","zh":"这部小说关注的是日常生活中的“不英雄气”，而不是宏大的勇敢壮举。"}]}],"synonyms":["unheroicness","lack of heroism","unheroic behavior","ordinariness","cowardice (sometimes, depending on context)"],"phonetic":"/ˌnɑn.həˈroʊ.ɪk.nəs/","extraExplanation":["“nonheroicness”不是非常常见的标准词（更常见的是“lack of heroism / unheroic behavior / non-heroic quality”）。它是把 non-（不/非）+ heroic（英雄的）+ -ness（名词后缀：……的性质）拼在一起形成的抽象名词。","语气上可能带一点自嘲或批评：强调“没有英雄式的勇气/光环”，也可能只是中性地表示“很普通、并不传奇”。具体褒贬要看上下文。"]}
{"word":"nonhesitant","summary":{"en":"“Nonhesitant” means confident and without hesitation.","zh":"“nonhesitant”表示“毫不犹豫的、果断的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hesitant; acting or speaking confidently without pause or doubt.","zh":"不犹豫的；果断的；毫不迟疑的。"},"examples":[{"en":"She gave a nonhesitant answer when the teacher asked her question.","zh":"老师提问时，她毫不犹豫地回答了。"},{"en":"In an emergency, a nonhesitant response can save lives.","zh":"在紧急情况下，果断的反应可能挽救生命。"},{"en":"He was nonhesitant about apologizing after he realized his mistake.","zh":"意识到错误后，他毫不迟疑地道歉了。"}]}],"synonyms":["decisive","confident","unhesitating","firm","resolved"],"phonetic":"/ˌnɑnˈhɛzɪtənt/","extraExplanation":["“non-”是英语中常见前缀，表示“非、不”。因此 nonhesitant 的字面意思就是 “not hesitant（不犹豫的）”。","这个词在日常口语里不算最常见，更常用的表达包括 “decisive（果断的）”、“confident（自信的）”、“without hesitation（毫不犹豫地）”。写作中用 nonhesitant 会显得更正式或更强调“没有犹豫”这一点。"]}
{"word":"nonhesitantly","summary":{"en":"Nonhesitantly means “without hesitation; confidently and promptly.”","zh":"nonhesitantly 表示“毫不犹豫地；果断自信地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows no hesitation; confidently and without pause.","zh":"毫不犹豫地；果断自信地（不迟疑、不停顿）。"},"examples":[{"en":"She answered the question nonhesitantly, as if she had prepared for it all week.","zh":"她毫不犹豫地回答了那个问题，仿佛整周都在准备。"},{"en":"He stepped forward nonhesitantly to defend his friend.","zh":"他毫不迟疑地走上前去为朋友辩护。"}]}],"synonyms":["without hesitation","unhesitatingly","confidently","readily","decisively"],"phonetic":"/ˌnɑnˈhɛzɪtəntli/","extraExplanation":["“non-”是否定前缀，表示“没有/不”；“hesitantly”是“犹豫地”。合起来“nonhesitantly”就是“毫不犹豫地”。更常见、更自然的写法通常是分开说：without hesitation / confidently / without a pause。","写作建议：在正式写作或日常英语里，“nonhesitantly”相对少见，可能显得生硬；如果你想表达更地道的语气，常用的替换是“without hesitation”或“unhesitatingly”（更常见）。"]}
{"word":"nonheuristic","summary":{"en":"“Nonheuristic” means not using rules of thumb; it uses exact or systematic methods.","zh":"“nonheuristic”表示“非启发式的”：不靠经验法则/捷径，而用精确或系统的方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not based on heuristics (rules of thumb); instead relying on exact, systematic, or fully specified methods.","zh":"非启发式的；不依赖“经验法则/捷径”的，而是依靠精确、系统或完全明确的方法。"},"examples":[{"en":"A nonheuristic search guarantees finding the optimal solution, but it may take much longer.","zh":"非启发式搜索能保证找到最优解，但可能耗时更长。"},{"en":"The professor compared heuristic reasoning with nonheuristic proof-based reasoning.","zh":"教授比较了启发式推理与非启发式、基于证明的推理。"}]}],"synonyms":["exact","systematic","deterministic","exhaustive","proof-based"],"phonetic":"ˌnɑn hjʊˈrɪs.tɪk","extraExplanation":["“non-”是英语里表示否定的前缀，意思是“不是/非”。“heuristic”常见于计算机科学、数学、工程与心理学语境，指用经验法则来快速得到“通常还不错”的结果；因此“nonheuristic”往往强调：不靠捷径，而靠可验证、可复现、规则明确的方法（例如穷举、精确算法、形式化证明）。","在论文或技术说明里，作者使用“nonheuristic”常是在对比：一种方法是“启发式（快但不保证最优）”，另一种是“非启发式（更稳健或可证明，但可能更慢/更耗资源）”。"]}
{"word":"nonhierarchic","summary":{"en":"Nonhierarchic means “non-hierarchical”: not organized in ranked levels of authority or importance.","zh":"Nonhierarchic 意为“非等级制的/非层级的”：不按权力或重要性分层组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not arranged in levels of authority or importance; without a ranked structure (non-hierarchical)","zh":"非等级制的；不按权力或重要性分层排列的；无上下级层级结构的（= non-hierarchical）"},"examples":[{"en":"The team uses a nonhierarchic structure where decisions are made by consensus.","zh":"这个团队采用非等级制结构，决策通过共识来形成。"},{"en":"They wanted a nonhierarchic classroom, so students could challenge ideas freely.","zh":"他们希望课堂是非等级制的，这样学生可以更自由地质疑观点。"},{"en":"Online communities often feel more nonhierarchic than traditional workplaces.","zh":"线上社群往往比传统职场更显得非等级制。"}]}],"synonyms":["non-hierarchical","egalitarian","flat (organizational)","decentralized"],"phonetic":"/ˌnɑnˌhaɪəˈrɑrkɪk/","extraExplanation":["“nonhierarchic”在学术写作里偶尔会出现，但更常见、更自然的拼写是“nonhierarchical”。在正式写作中，如果不确定读者是否熟悉这个词，建议优先用“non-hierarchical / nonhierarchical”。","这个词常用于组织管理、社会学、人类学、政治理论与网络社群等语境，强调“没有固定上下级/权力梯度”，并不一定表示“没有规则”，而是规则更偏向协商、轮流、或共同治理。"]}
{"word":"nonhierarchical","summary":{"en":"Nonhierarchical means “without levels of rank or authority; flat and shared in decision-making.”","zh":"nonhierarchical 指“没有等级层级的；扁平、共享决策的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not organized in levels of authority, rank, or status; having a flat structure where people have similar power and decision-making is shared.","zh":"非等级制的；不按权力、级别或地位分层的；结构较扁平、强调共享决策的。"},"examples":[{"en":"They run a nonhierarchical team where everyone can suggest ideas.","zh":"他们以非等级制的方式运作团队，每个人都可以提出想法。"},{"en":"The group uses a nonhierarchical decision process, so no single leader makes all the rules.","zh":"该团体采用非等级制的决策方式，因此不会由单一领导者制定所有规则。"}]}],"synonyms":["flat","egalitarian","decentralized","nonranked"],"phonetic":"/ˌnɑnˌhaɪəˈrɑrkɪkəl/","extraExplanation":["在组织与社会科学语境里，nonhierarchical 常用来描述“扁平化（flat）”的组织结构或“去中心化（decentralized）”的协作方式，常见于合作社、志愿者团体、开源社区等。","词形上由 non-（不、非）+ hierarchical（等级制的）构成；美国英语也常写作 non-hierarchical（加连字符），含义相同。"]}
{"word":"nonhierarchically","summary":{"en":"Nonhierarchically means “in a way that is not based on levels of rank or authority.”","zh":"nonhierarchically 指“以不依赖等级或权威层级的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not organized by rank, levels, or authority (not top-down).","zh":"以非等级制的方式；不按地位/层级/权力高低来组织（非自上而下）。"},"examples":[{"en":"The team made decisions nonhierarchically, so everyone’s voice counted.","zh":"团队以非等级制的方式做决定，所以每个人的声音都很重要。"},{"en":"Information flowed nonhierarchically through peer-to-peer channels.","zh":"信息通过同伴对同伴的渠道，以非等级制的方式流动。"}]}],"synonyms":["in a flat structure","peer-to-peer","without a strict chain of command","collaboratively"],"phonetic":"/ˌnɑnˌhaɪəˈrɑrkɪkli/","extraExplanation":["构词拆解：non-（不、非）+ hierarchical（等级制的）+ -ly（副词后缀）→ “以非等级制的方式”。常见于组织管理、社会学、教育与开源社区语境。","常见搭配：work nonhierarchically（以非等级方式协作）、organize nonhierarchically（非等级化组织）、decide nonhierarchically（非等级式决策）。","近义表达（更口语/更常见）：in a flat structure（在扁平结构下）、without a strict chain of command（没有严格的指挥链）、peer-led（由同侪带领）。"]}
{"word":"nonhieratic","summary":{"en":"Nonhieratic means “not hieratic”—not priestly/ceremonial, not in ancient Egyptian hieratic script, or not stiffly formal/stylized (in art/literary contexts).","zh":"Nonhieratic 指“非僧侣体/非仪式性的；不使用古埃及僧侣体文字的；或（文艺语境）不庄严刻板、不程式化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hieratic; not priestly, ceremonial, or connected with religious officials or rituals.","zh":"非祭司的；非宗教仪式性的；不与祭司/宗教仪式相关的。"},"examples":[{"en":"The festival included both hieratic chants and nonhieratic folk songs.","zh":"节庆既有仪式性的圣歌，也有非仪式性的民歌。"},{"en":"He preferred a nonhieratic tone in the speech, avoiding religious language.","zh":"他在演讲中更偏好非仪式性的语气，避免使用宗教措辞。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Egyptology, specialized) Not written in or relating to the ancient Egyptian hieratic script (a cursive script historically used especially by priests).","zh":"（埃及学/文字学，专门）非古埃及僧侣体（hieratic）文字的；不以僧侣体书写的。"},"examples":[{"en":"The label notes that the text is nonhieratic, so it is not in the priestly cursive script.","zh":"说明牌指出这段文字是非僧侣体的，因此不是那种祭司使用的草写体。"},{"en":"Students compared hieratic signs with nonhieratic writing styles used in everyday records.","zh":"学生把僧侣体符号与日常记录中使用的非僧侣体书写风格作比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not extremely formal, stiff, or highly stylized in appearance or style (opposite of “hieratic” in an art/literary sense).","zh":"（文艺语境）不刻板庄严的；不高度程式化/风格化的（与“hieratic”的文艺含义相反）。"},"examples":[{"en":"The later portraits feel more nonhieratic and approachable.","zh":"后期的肖像更不那么庄严刻板，也更亲近。"},{"en":"She chose a nonhieratic posture to make the character seem human.","zh":"她选择不那么庄严的姿态，让角色显得更有人味。"}]}],"synonyms":["non-priestly","secular","nonritual","informal","unstylized"],"phonetic":"/ˌnɑnhaɪˈrætɪk/","extraExplanation":["“nonhieratic”比较罕见，通常出现在学术或评论写作里。它的核心意思就是“not hieratic”。理解它要先掌握“hieratic”的三个常见用法：①与祭司/宗教仪式有关；②指古埃及僧侣体（hieratic）文字；③（艺术评论）指庄严、拘谨、程式化的风格。","拼写上常见两种形式：不带连字符 nonhieratic；或带连字符 non-hieratic。两者意思相同。"]}
{"word":"nonhieratical","summary":{"en":"Nonhierarchical means “not based on ranks or levels of authority.”","zh":"Nonhierarchical 指“不按等级或权力层级来组织的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not organized in levels of rank or authority; not having a hierarchy","zh":"非等级制的；不按上下级层级组织的"},"examples":[{"en":"Our team uses a nonhierarchical structure, so anyone can share ideas in meetings.","zh":"我们团队采用非等级制结构，所以任何人都可以在会议上提出想法。"},{"en":"Many open-source projects try to stay nonhierarchical to encourage collaboration.","zh":"许多开源项目尽量保持非等级制，以鼓励协作。"}]}],"synonyms":["nonranked","flat","egalitarian","decentralized"],"phonetic":"/ˌnɑnˌhaɪəˈrɑrkɪkəl/","extraExplanation":["你写的 **nonhieratical** 很可能是拼写错误；更常见、标准的词是 **nonhierarchical**（非等级制的）。","**hierarchy（等级制度）** 来自希腊语词根，常用于组织结构、公司管理、学术机构等语境。加上 **non-** 表示“非……”。","在职场语境里，nonhierarchical 常带有“更平等、去中心化”的积极含义，但并不一定表示“完全没有负责人”，而是权力距离更小、沟通更开放。"]}
{"word":"nonhieratically","summary":{"en":"Nonhierarchically means ‘in a nonhierarchical way,’ without ranking people or things into levels.","zh":"Nonhierarchically 指“以非等级制的方式”，不把人或事物按地位/重要性分层排列。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a nonhierarchical way; without organizing people or things into levels of rank, power, or importance","zh":"以非等级制的方式；不按权力、地位或重要性分层来组织（人或事物）"},"examples":[{"en":"The team works nonhierarchically, so anyone can suggest ideas in meetings.","zh":"这个团队以非等级制的方式运作，所以开会时任何人都可以提出想法。"},{"en":"They designed the organization nonhierarchically to reduce bureaucracy.","zh":"他们以非等级制的方式设计组织结构，以减少官僚程序。"},{"en":"In class, students are encouraged to collaborate nonhierarchically rather than compete for status.","zh":"在课堂上，学生被鼓励以非等级制方式合作，而不是为了地位相互竞争。"}]}],"synonyms":["without hierarchy","in a flat structure","egalitarianly","non-authoritarianly","collaboratively"],"phonetic":"/ˌnɑnˌhaɪəˈrɑrkɪkli/","extraExplanation":["你输入的 **nonhieratically** 在常见英语里很可能是拼写误差；更常见、标准的词是 **nonhierarchically**（非等级制地）。","注意不要和 **hieratic / hieratically** 混淆：hieratic 通常指“祭司的、宗教仪式的、庄严的（或与古埃及僧侣书写体相关）”，语义方向完全不同。"]}
{"word":"nonhistone","summary":{"en":"“Nonhistone” means “not a histone,” usually describing nuclear proteins other than histones.","zh":"nonhistone 指“非组蛋白的/非组蛋白”，通常用于描述细胞核中除组蛋白以外的蛋白质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Not a histone; referring to proteins (or genes/protein complexes) in the cell nucleus that are different from histones, often involved in regulating DNA and chromatin in various ways.","zh":"（生物学）非组蛋白的；指细胞核中不同于组蛋白的一类蛋白质（或相关基因/蛋白复合体），常以不同方式参与调控DNA与染色质。"},"examples":[{"en":"Researchers compared histone and nonhistone proteins to understand how gene expression is controlled.","zh":"研究人员比较了组蛋白与非组蛋白，以了解基因表达如何被调控。"},{"en":"Some nonhistone proteins help open chromatin so that certain genes can be transcribed.","zh":"一些非组蛋白有助于打开染色质，从而让某些基因能够被转录。"}]},{"partOfSpeech":"n.","definition":{"en":"A nonhistone protein; any nuclear protein that is not a histone (often discussed as a group: “nonhistone proteins”).","zh":"非组蛋白；指任何不属于组蛋白的核蛋白（常作为一类统称：nonhistone proteins）。"},"examples":[{"en":"The sample contained histones as well as several nonhistones.","zh":"样本中既有组蛋白，也有几种非组蛋白。"},{"en":"Nonhistones often include regulatory proteins that bind DNA in specific ways.","zh":"非组蛋白常包括以特定方式与DNA结合的调控蛋白。"}]}],"synonyms":["non-histone","nonhistone protein (common phrase)"],"phonetic":"ˌnɑnˈhɪstoʊn","extraExplanation":["“non-”是常见英语前缀，表示“非、不是”。因此 nonhistone 字面意思就是“不是 histone（组蛋白）的”。\n在学术写作中，nonhistone 常用作定语（nonhistone proteins），也可作名词使用，但更常见的是复数表达 nonhistone proteins。"]}
{"word":"nonhistoric","summary":{"en":"Nonhistoric describes something that is not historically important or not based on real historical facts.","zh":"nonhistoric 用来形容“没有历史重要性”的事物，或“并非史实、非基于真实历史事实”的内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not historic; not important or famous in history; not connected to recorded history","zh":"非历史性的；不具有历史重要性或历史影响的；不与有记录的历史相关的"},"examples":[{"en":"The building is old, but it’s considered nonhistoric, so it can be remodeled easily.","zh":"这栋楼很旧，但被认为不具历史价值，所以可以比较容易地改建。"},{"en":"They chose a nonhistoric setting to avoid distracting viewers with real events.","zh":"他们选择了一个非历史背景，以免真实事件分散观众注意力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a story, film, or event) not based on real historical facts; fictional rather than historical","zh":"（故事/电影/事件）非史实的；不以真实历史事实为依据的；偏虚构的"},"examples":[{"en":"The movie uses real names, but the plot is mostly nonhistoric.","zh":"这部电影用了真实姓名，但情节大多并非史实。"},{"en":"It’s a nonhistoric drama inspired by the style of the 1800s.","zh":"这是一部受19世纪风格启发的非史实剧情片。"}]}],"synonyms":["unhistoric","ahistorical","nonhistorical","not historically significant"],"phonetic":"/nɑn hɪˈstɔrɪk/","extraExplanation":["“nonhistoric”常见于学术、新闻或文化遗产语境，表示“没有历史意义/不具历史价值”。注意它与“historical（与历史有关的）”不同：例如 historical novel（历史题材小说）可以是虚构的，但仍与历史时代相关；而 nonhistoric 更强调“不属于/不构成重要历史”。","在文物与建筑保护领域，nonhistoric 常用于区分“historic（受保护的历史建筑/历史遗产）”与“不受同等保护的普通建筑”。"]}
{"word":"nonhistorical","summary":{"en":"Nonhistorical means “not related to history” or “outside recorded history,” often used in formal or academic contexts.","zh":"nonhistorical 指“与历史无关”或“处于历史记载之外”，多用于较正式或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to history; not based on or dealing with past events or historical study.","zh":"非历史的；不与历史相关的；不基于或不讨论过去事件/历史研究的。"},"examples":[{"en":"The article takes a nonhistorical approach and focuses on current social issues.","zh":"这篇文章采取非历史的视角，重点讨论当下的社会议题。"},{"en":"Her analysis is mostly nonhistorical, so it doesn’t explain how the situation developed over time.","zh":"她的分析主要是非历史的，因此没有解释这种情况是如何随时间发展而来的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Existing outside recorded history; not belonging to any historical period (often used in academic writing).","zh":"（常用于学术语境）不属于有文字记载的历史范围；处于“历史记录之外”的。"},"examples":[{"en":"Some myths describe nonhistorical times before humans kept written records.","zh":"有些神话描写的是在人类留下文字记载之前的非历史时期。"},{"en":"The novel is set in a nonhistorical world inspired by medieval Europe.","zh":"这部小说的背景设定在一个受中世纪欧洲启发、但并非真实历史的世界。"}]}],"synonyms":["not historical","unhistorical","ahistorical"],"phonetic":"/ˌnɑn.hɪˈstɔr.ɪ.kəl/","extraExplanation":["构词法：non-（“不、非”）+ historical（“历史的”），合起来就是“非历史的”。","语体提示：在日常口语里更常说“not historical”或“not based on history”。“nonhistorical”更偏书面语、学术写作（如哲学、社会科学、文学评论）。","易混：nonhistorical ≠ ahistorical。nonhistorical 常指“与历史无关/不以历史为依据”；ahistorical 更强调“忽视历史背景、脱离历史语境”。"]}
{"word":"nonhistorically","summary":{"en":"“Nonhistorically” means “in a non-historical way,” often implying without historical context or not historically accurate.","zh":"“nonhistorically”表示“以非历史的方式”，常指不从历史背景来理解，或（带批评）不符合历史事实。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not historical; without using history or historical context.","zh":"以非历史的方式；不运用历史或历史背景地。"},"examples":[{"en":"The movie uses real names but tells the story nonhistorically.","zh":"这部电影用了真实姓名，但讲述方式并不符合历史。"},{"en":"If you read the poem nonhistorically, you may miss the political references of its time.","zh":"如果你以非历史视角读这首诗，可能会错过它所处时代的政治指涉。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is inaccurate about history (not historically).","zh":"以不符合历史事实的方式（不具历史准确性地）。"},"examples":[{"en":"The series portrays the event nonhistorically, changing the timeline for drama.","zh":"这部剧以不符合历史的方式呈现该事件，为了戏剧效果改了时间线。"}]}],"synonyms":["not historically","in a non-historical way","ahistorically","without historical context"],"phonetic":"/ˌnɑn hɪˈstɔrɪkli/","extraExplanation":["“nonhistorically”在实际英语中比较少见，更常见、更自然的表达是“not historically”或“in a non-historical way”。如果你想强调“刻意不从历史脉络来解读”，学术语境里也会用“ahistorically”（非历史地/脱离历史语境地）。","含义上它可能是中性的（不采用历史视角），也可能带批评意味（不符合史实）。写作时可以用上下文或改用更明确的表达来避免歧义。"]}
{"word":"nonhistoricalness","summary":{"en":"Nonhistoricalness means the state of not being historical or not being based on historical facts.","zh":"nonhistoricalness 指“非历史性”，即不具历史依据或不基于历史事实的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being historical; lack of historical basis, context, or accuracy","zh":"非历史性；不具历史依据或历史真实性的状态/特质"},"examples":[{"en":"The film’s nonhistoricalness is obvious, but it still tells an engaging story.","zh":"这部电影的非历史性很明显，但它仍然讲了一个很吸引人的故事。"},{"en":"Critics pointed out the nonhistoricalness of the details in the novel.","zh":"评论家指出这部小说在细节上的非历史性。"}]}],"synonyms":["lack of historical accuracy","ahistoricity","non-historical nature","unhistorical quality"],"phonetic":"/ˌnɑn.hɪˈstɔr.ɪ.kəl.nəs/","extraExplanation":["这个词非常少见，更多时候人们会用更自然的表达：lack of historical accuracy（缺乏历史准确性）、ahistoricity（非历史性）、non-historical nature（非历史特征）。","构词方式：non-（否定前缀）+ historical（历史的）+ -ness（名词后缀，表示“性质/状态”）。因此它通常用来评论作品、叙事或说法“并非基于历史事实”。"]}
{"word":"nonhistrionic","summary":{"en":"Nonhistrionic means calm, not overly dramatic, especially when expressing feelings or describing events.","zh":"nonhistrionic 指（表达或叙述时）冷静克制、不夸张、不戏剧化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not overly dramatic or attention-seeking; calm and restrained in expression, especially when discussing emotions or problems.","zh":"不夸张的；不戏剧化的；（表达情绪或问题时）冷静克制、不哗众取宠的。"},"examples":[{"en":"She gave a nonhistrionic account of what happened, focusing on facts instead of blame.","zh":"她用不戏剧化的方式叙述了发生的事，把重点放在事实而不是指责上。"},{"en":"The doctor spoke in a nonhistrionic tone that reassured the patient.","zh":"医生用冷静克制的语气说话，让病人安心。"},{"en":"Try to keep your email nonhistrionic, even if you feel upset.","zh":"即使你很生气，也尽量让邮件语气保持冷静克制。"}]}],"synonyms":["calm","restrained","measured","matter-of-fact","low-key","dispassionate"],"phonetic":"/ˌnɑnˌhɪˈstriːɑnɪk/","extraExplanation":["“non-”是否定前缀，表示“非……/不……”。“histrionic”原意与“演员式的、表演性的”表达有关，所以“nonhistrionic”强调“不用夸张表演的方式表达情绪”。","在日常写作或职场沟通里，nonhistrionic 常用来称赞某人的表达“沉着、理性、不过度渲染”。","注意：histrionic 也会出现在心理学语境（如“表演型人格障碍”），但 nonhistrionic 在一般英语中更多是非诊断性的描述词，表示“不过度戏剧化”，不等同于医学判断。"]}
{"word":"nonhistrionical","summary":{"en":"Nonhistrionic means calm and not overly dramatic or emotional; less commonly, it can mean not related to acting/theater.","zh":"nonhistrionic 指“冷静、不夸张、不做作”；较少见时也可指“与表演/戏剧无关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not overly dramatic or emotional; calm and matter-of-fact (the opposite of **histrionic**).","zh":"不夸张、不做作；不情绪化、很冷静（与 **histrionic**“戏剧化的/夸张的”相反）。"},"examples":[{"en":"She gave a nonhistrionic response and focused on the facts.","zh":"她的回应很冷静，不夸张，而是专注于事实。"},{"en":"The report uses a nonhistrionic tone to describe the crisis.","zh":"这份报告用不煽情、不夸大的语气来描述危机。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not related to acting or theatrical performance (less common).","zh":"与表演/戏剧无关的（较少见用法）。"},"examples":[{"en":"They discussed the nonhistrionic parts of the job, like budgeting and scheduling.","zh":"他们讨论了工作中与表演无关的部分，比如预算和排期。"}]}],"synonyms":["calm","composed","matter-of-fact","restrained","unemotional"],"phonetic":"/ˌnɑnˌhɪstriˈɑnɪk/","extraExplanation":["你输入的 **nonhistrionical** 很可能不是常见标准拼写；更常见的是 **nonhistrionic**（意为“不戏剧化/不夸张”）。写作时一般用 **nonhistrionic** 更自然。","**histrionic** 源自拉丁语 *histrio*（“演员”）。所以它既可以表示“夸张、戏剧化”，也可以表示“与表演/戏剧有关”（后者用法更正式、也更少见）。"]}
{"word":"nonhistrionically","summary":{"en":"Nonhistrionically means “calmly and without dramatic exaggeration.”","zh":"nonhistrionically 意为“冷静克制地，不夸张做作（不戏剧化）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a calm, restrained way that is not overly dramatic or attention-seeking.","zh":"以冷静、克制的方式；不夸张、不做作、不戏剧化地。"},"examples":[{"en":"She responded nonhistrionically, even though the news was upsetting.","zh":"尽管消息令人难受，她仍然很克制、毫不戏剧化地作出回应。"},{"en":"Try to describe what happened nonhistrionically, using simple facts.","zh":"尽量用简单事实、不要夸张地描述发生了什么。"},{"en":"He spoke nonhistrionically and kept the meeting focused.","zh":"他讲话不夸张，会议也因此保持在正题上。"}]}],"synonyms":["calmly","evenly","restrainedly","matter-of-factly","without drama"],"phonetic":"/ˌnɑnˌhɪstriˈɑnɪkli/","extraExplanation":["这个词比较少见，属于较正式或书面表达，常见替代说法有：calmly（冷静地）, evenly（平稳地）, without drama（不带情绪化/不作戏地）, in a restrained way（克制地）。","词根来自 histrionic（“表演性的、夸张做作的”），源于拉丁语 histrio（演员）。加上否定前缀 non- 就表示“非……的”。在写作中用它往往带一点评价：暗示对方“没有上演情绪戏”或“没有夸张反应”。","语境提示：描述人的语气/反应/表达方式时很自然（react/speak/answer nonhistrionically）；但如果在安慰他人时直接用，可能显得有点生硬或带批评意味。"]}
{"word":"nonhistrionicalness","summary":{"en":"Nonhistrionicalness means a calm, non-theatrical, non-exaggerated way of speaking or behaving.","zh":"nonhistrionicalness 指“不戏剧化、不夸张、情绪表达克制”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being histrionic; a calm, restrained manner without exaggerated emotion or theatrical behavior","zh":"不夸张、不戏剧化的特质；指情绪表达克制、行为不做作、不带表演性"},"examples":[{"en":"Her nonhistrionicalness helped the team stay focused during the crisis.","zh":"她的不戏剧化与冷静克制，帮助团队在危机中保持专注。"},{"en":"The report’s nonhistrionicalness makes it more convincing and easier to trust.","zh":"这份报告不夸张、不过度渲染，因此更有说服力也更值得信赖。"},{"en":"He spoke with a quiet nonhistrionicalness, even when criticized.","zh":"即使被批评，他说话也依然克制平静、毫不做作。"}]}],"synonyms":["calmness","restraint","composure","understatement","level-headedness"],"phonetic":"/ˌnɑnˌhɪstriˈɑnɪkəlnəs/","extraExplanation":["这个词非常少见，多用于“临时造词/学术式写法”。更常见、更自然的表达是：calmness（冷静）、restraint（克制）、understatement（含蓄/不夸张）、lack of theatrics（不做戏）。","构词可以拆开理解：non-（不）+ histrionic（夸张的、戏剧化的）+ -al（形容词后缀）+ -ness（名词后缀）。","histrionic 来自拉丁语 histrio（演员）。因此这个词带有“像在演戏一样”的文化联想：过度表演、过度情绪化。否定形式则强调“不过度渲染、不过度表演”。"]}
{"word":"nonhomaloidal","summary":{"en":"A technical math adjective meaning “not homaloidal,” i.e., not defining a birational (Cremona) transformation.","zh":"一个数学专业形容词，表示“非 homaloidal（同射型）的”，即不能定义双有理（Cremona）变换。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mathematics, algebraic geometry) Not homaloidal; not having the property of defining a birational (Cremona) transformation of projective space.","zh":"（数学，代数几何）非同射型的；不具备“homaloidal（同射型）”性质的，即不能定义射影空间中的双有理（Cremona）变换。"},"examples":[{"en":"This polynomial is nonhomaloidal, so it does not give a Cremona transformation.","zh":"这个多项式是 nonhomaloidal 的，因此它不能给出一个 Cremona 变换。"},{"en":"The paper classifies homaloidal and nonhomaloidal cases in degree three.","zh":"这篇论文对三次情形中的 homaloidal 与 nonhomaloidal 情况进行了分类。"}]}],"synonyms":["not homaloidal"],"phonetic":"/ˌnɑnˌhoʊməˈlɔɪdəl/","extraExplanation":["这是一个非常专业、在一般英语语境中几乎不会出现的术语，主要见于代数几何/射影几何文献。常见搭配包括：nonhomaloidal polynomial（非同射型多项式）、nonhomaloidal linear system（非同射型线性系）。","词形结构：non-（否定前缀）+ homaloidal。homaloidal 常与“Cremona 变换/双有理变换”相关，表示某个多项式或线性系满足特定条件从而诱导出一个双有理映射；nonhomaloidal 则表示不满足这些条件。"]}
{"word":"nonhome","summary":{"en":"“Nonhome” means ‘not at home’ or ‘away from home,’ and is often written as “non-home.”","zh":"“nonhome”表示“不在家/离家在外”，更常见写作“non-home”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not at home; away from one’s home (often written with a hyphen: non-home).","zh":"不在家（的）；离家在外（常写作带连字符的 non-home）。"},"examples":[{"en":"I can’t take deliveries during non-home hours.","zh":"我不在家的时间没法收快递。"},{"en":"The team played a non-home game this weekend.","zh":"这支球队这周末打了一场客场比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation, period, or activity that happens away from home (less common; often appears in specialized writing).","zh":"在外（不在家）的情况/时段/活动（较少见，多用于特定领域写作）。"},"examples":[{"en":"The app tracks home vs. nonhome time for screen-use research.","zh":"这个应用会为屏幕使用研究记录在家时间和非在家时间。"}]}],"synonyms":["away-from-home","not-at-home","away (game)","road (game)"],"phonetic":"/ˌnɑnˈhoʊm/","extraExplanation":["“nonhome”不是非常常见的标准词，更常见的写法是带连字符的“non-home”，或者直接用更自然的表达：away from home / not at home / away game（体育）。","在体育语境中，“non-home game”基本等同于“away game”（客场比赛）。在统计、研究或产品文案里，有时会用“home vs. nonhome”来对比“在家/不在家”的时间或行为。"]}
{"word":"nonhomiletic","summary":{"en":"Nonhomiletic means “not sermon-like or not related to preaching.”","zh":"nonhomiletic 意为“非讲道的；不带说教/布道色彩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not homiletic; not relating to sermons, preaching, or a sermon-like moral lesson.","zh":"非讲道的；不与布道、讲章或“像讲道一样的道德说教”相关的。"},"examples":[{"en":"The article takes a historical, nonhomiletic approach to the Bible.","zh":"这篇文章以历史研究的方式讨论《圣经》，而不是讲道式的（nonhomiletic）方式。"},{"en":"She wanted the speech to be inspiring but nonhomiletic.","zh":"她希望演讲鼓舞人心，但不要变成说教式的讲道（nonhomiletic）。"}]}],"synonyms":["nonpreaching","nondidactic","nonmoralizing","nonsermonic"],"phonetic":"/ˌnɑnˌhɑməˈlɛtɪk/","extraExplanation":["“nonhomiletic”由前缀 non-（不、非）+ homiletic 组成。homiletic 常见于宗教、文学与批评语境，指“讲章/布道相关的”，也可引申为“带有明显道德劝诫、像在说教的语气”。因此 nonhomiletic 常用来强调：内容是分析性的、学术性的或叙述性的，而不是用讲道来教训人。"]}
{"word":"nonhomogeneity","summary":{"en":"Nonhomogeneity means a lack of uniformity—things are not the same throughout.","zh":"nonhomogeneity 指“不均匀/非均质”，即整体各处并不一致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of uniformity; the state of having parts, qualities, or features that are not the same throughout.","zh":"不均匀性；非均质性：指整体各部分在性质、成分或特征上不一致。"},"examples":[{"en":"The researchers controlled for nonhomogeneity in the sample by grouping participants by age.","zh":"研究人员通过按年龄分组来控制样本中的非均质性。"},{"en":"Nonhomogeneity in the material can cause weak points and cracks over time.","zh":"材料的不均匀性可能随着时间产生薄弱点并导致裂纹。"}]}],"synonyms":["heterogeneity","lack of uniformity","variability","unevenness"],"phonetic":"/ˌnɑnˌhoʊməˈdʒiːnəti/","extraExplanation":["这是一个偏学术/技术的名词，常见于统计学、材料科学、医学影像、地质学等领域。比如在统计中，样本“非均质”意味着不同子群体混在一起，可能影响结果解释；在材料或介质中，表示密度、成分等在空间上不一致。","词形结构：non-（“非、不”）+ homogeneity（“同质性、均一性”）。常见近义表达有 heterogeneity（异质性）；在很多语境中两者意思非常接近，只是表述角度不同（“不均一” vs “有差异”）。"]}
{"word":"nonhomogeneous","summary":{"en":"Nonhomogeneous means “not uniform; made of different parts.”","zh":"nonhomogeneous 意为“非均匀的；由不同部分组成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not uniform in composition, structure, or character; made of different parts or elements.","zh":"非均匀的；非同质的：在组成、结构或性质上不一致，由不同部分或元素构成。"},"examples":[{"en":"The soup looked nonhomogeneous, with bits of vegetables floating in the broth.","zh":"这碗汤看起来不均匀，汤里漂着一些蔬菜块。"},{"en":"In science class, we learned that sand and iron filings form a nonhomogeneous mixture.","zh":"在科学课上我们学到，沙子和铁屑组成的是非均匀混合物。"},{"en":"The city has a nonhomogeneous population, with many cultures living side by side.","zh":"这座城市的人口构成并不单一，许多文化并存。"}]}],"synonyms":["heterogeneous","nonuniform","mixed","varied"],"phonetic":"/ˌnɑnˌhoʊməˈdʒiːniəs/","extraExplanation":["在化学里更常用的说法是“heterogeneous mixture（非均相/非均匀混合物）”，而“homogeneous mixture（均相/均匀混合物）”指各处看起来和性质都一样（如盐水）。日常英语里也会用 nonhomogeneous 来表示“成分不统一”。","构词：non-（不、非）+ homogeneous（同质的/均匀的）。homogeneous 来自希腊语 homo-（相同）+ genos（种类）。","拼写提示：nonhomogeneous 有时也写作 non-homogeneous（加连字符），两者含义相同。"]}
{"word":"nonhomogeneously","summary":{"en":"Nonhomogeneously means “not evenly or uniformly throughout.”","zh":"nonhomogeneously 意为“以不均匀、不一致的方式（遍布整体）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not uniform throughout; with different parts having different properties or compositions.","zh":"以不均匀的方式；在整体中各部分性质或成分不同。"},"examples":[{"en":"The chemical is distributed nonhomogeneously in the mixture.","zh":"这种化学物质在混合物中分布不均匀。"},{"en":"Heat spreads nonhomogeneously through the thick material, so some areas get hotter than others.","zh":"热量在这种厚材料中传播不均匀，因此有些区域比其他区域更热。"},{"en":"The population is nonhomogeneously distributed across the country.","zh":"人口在全国范围内分布不均。"}]}],"synonyms":["unevenly","irregularly","not uniformly","non-uniformly"],"phonetic":"/ˌnɑnˌhoʊməˈdʒiːniəsli/","extraExplanation":["“nonhomogeneously”多见于科学与学术写作（如材料科学、化学、物理、生物、统计/地理等），日常口语里更常用“unevenly / irregularly / not evenly”。","构词：non-（否定前缀）+ homogeneous（同质的/均匀的）+ -ly（副词后缀）。其中“homogeneous”常指“成分或性质一致”，而“uniform”更偏“外观或分布一致”；学术语境里二者有时会区分使用。"]}
{"word":"nonhomogeneousness","summary":{"en":"Nonhomogeneousness means “lack of uniformity; having mixed or different parts.”","zh":"nonhomogeneousness 指“缺乏一致性/均匀性；由不同成分或性质混合而成的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not being homogeneous; having different parts, types, or properties rather than being uniform throughout.","zh":"非均质性；不均一的状态（整体并不一致，而是由不同部分、类型或性质组成）。"},"examples":[{"en":"The nonhomogeneousness of the soil affects how water moves through the field.","zh":"土壤的非均质性会影响水在田地里的渗流方式。"},{"en":"Engineers measured the nonhomogeneousness of the material before choosing a manufacturing method.","zh":"工程师在选择制造方法前测量了材料的非均质性。"}]}],"synonyms":["heterogeneity","nonuniformity","lack of uniformity","nonhomogeneity"],"phonetic":"ˌnɑnˌhoʊməˈdʒiːniəsnəs","extraExplanation":["这是一个相对少见、偏学术/技术的名词，结构是 non-（不）+ homogeneous（同质的/均匀的）+ -ness（名词后缀）。在科研写作中更常见的表达是 **heterogeneity（异质性）** 或 **nonhomogeneity（非均质性）**，语气更自然。","常见使用场景：材料科学（材料内部成分不均）、数学/统计（总体不均一）、地质/土壤学（介质不均匀）等。"]}
{"word":"nonhomogenous","summary":{"en":"Nonhomogeneous means “not uniform; made of different parts.”","zh":"nonhomogeneous 指“不均一的；由不同部分构成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not uniform in composition, structure, or character; made of different parts or elements.","zh":"（组成、结构或性质）不均一的；由不同部分或成分构成的。"},"examples":[{"en":"The soup became nonhomogeneous when the oil separated from the broth.","zh":"当油和汤底分离时，这碗汤就变得不均一了。"},{"en":"The soil in this area is nonhomogeneous, so crops grow unevenly.","zh":"这个地区的土壤不均一，所以作物生长不均匀。"},{"en":"Researchers modeled the material as nonhomogeneous to match real-world conditions.","zh":"研究人员把这种材料建模为不均一的，以更符合现实条件。"}]}],"synonyms":["heterogeneous","nonuniform","uneven","mixed","varied"],"phonetic":"/ˌnɑnˌhoʊməˈdʒiːniəs/","extraExplanation":["拼写提醒：更常见、标准的拼写是 **nonhomogeneous**（或 **non-homogeneous**）。你写的 **nonhomogenous** 少了一个字母 **e**（应为 *-geneous*）。","常见领域：这个词在物理、化学、材料科学、统计与工程里很常用，用来表示“性质随位置/部分变化”，例如 nonhomogeneous material（非均质材料）、nonhomogeneous mixture（非均相混合物）。","对比记忆：**homogeneous** = “均一/同质”；**heterogeneous** = “异质/多样”。**nonhomogeneous** 强调“不是均一”，不一定像 heterogeneous 那样强调“明显多样”。"]}
{"word":"nonhomologous","summary":{"en":"Nonhomologous means “not homologous”—not matching in origin or corresponding structure, especially in biology/genetics.","zh":"nonhomologous 意为“非同源的”——在起源或对应结构上不匹配，常用于生物学/遗传学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not homologous; not corresponding in origin, structure, or evolutionary development (often used in biology and genetics).","zh":"非同源的；（常用于生物学与遗传学）在起源、结构或进化来源上不相对应的。"},"examples":[{"en":"Humans and octopuses have nonhomologous eyes: they work similarly, but they evolved from different origins.","zh":"人类和章鱼的眼睛是非同源的：功能相似，但进化起源不同。"},{"en":"During meiosis, nonhomologous chromosomes do not pair as a matching set the way homologous chromosomes do.","zh":"在减数分裂中，非同源染色体不会像同源染色体那样配对形成匹配的一对。"}]}],"synonyms":["noncorresponding","unrelated","nonmatching"],"phonetic":"/ˌnɑn həˈmɑl əɡəs/","extraExplanation":["词形拆解：non- = “不/非”，homologous = “同源的/同类对应的”。所以 nonhomologous 就是“非同源的”。","常见搭配：nonhomologous chromosomes（非同源染色体）；nonhomologous end joining / NHEJ（非同源末端连接，一种DNA双链断裂修复机制）。在这个搭配里，它强调“不是靠同源序列配对来修复”。","易混点：nonhomologous（非同源）强调“来源/对应关系不同”；analogous（同功/类比）强调“功能相似但来源可能不同”。很多情况下，nonhomologous structures 也常常是 analogous，但两词关注点不一样。"]}
{"word":"nonhostile","summary":{"en":"Nonhostile describes someone or something that is not hostile—calm, friendly, or at least not aggressive.","zh":"nonhostile 用来描述“并不敌对”的人或事物：平和、友好，或至少不具攻击性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hostile; friendly or at least not aggressive or threatening.","zh":"不敌对的；友好的，或至少不具有攻击性、威胁性的。"},"examples":[{"en":"The crowd remained nonhostile during the protest.","zh":"抗议期间人群一直保持不敌对的状态。"},{"en":"She gave me a nonhostile smile, so I felt safe asking for help.","zh":"她给了我一个不敌对的微笑，所以我放心去求助。"}]}],"synonyms":["friendly","peaceful","amiable","nonaggressive","benign"],"phonetic":"/nɑnˈhɑstaɪl/","extraExplanation":["non- 是常见前缀，表示“非、无、不”。hostile 表示“敌对的”。把它们组合起来，nonhostile 就是“并不敌对”的意思。","和 friendly（友好的）相比，nonhostile 语气更“中性”：强调“没有敌意”，不一定表示热情或亲密。常用于形容气氛、态度、语言、环境等。","拼写上通常也可写作 non-hostile（加连字符）或 nonhostile（合写）；学术或正式写作中两种都可能出现。"]}
{"word":"nonhostilely","summary":{"en":"“Nonhostilely” means doing or speaking in a way that is not hostile—peaceful or friendly.","zh":"“nonhostilely”表示以不带敌意的方式去做或说——更偏和平、友好。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a friendly, peaceful, or not aggressive way","zh":"以友好、和平、非敌对（不具攻击性）的方式"},"examples":[{"en":"The two groups spoke nonhostilely during the meeting.","zh":"两组人在会议上以非敌对的方式交谈。"},{"en":"Even when they disagreed, they responded nonhostilely and listened carefully.","zh":"即使意见不同，他们也以不带敌意的方式回应，并认真倾听。"},{"en":"The dog approached nonhostilely, with its tail wagging.","zh":"那只狗摇着尾巴，友好地靠近（没有敌意）。"}]}],"synonyms":["peacefully","amicably","in a friendly way","without hostility","nonaggressively"],"phonetic":"/ˌnɑnˈhɑstəli/","extraExplanation":["“non-”是否定前缀，表示“非……/不……”。“hostile”表示“敌对的、有敌意的”。加上“-ly”后变成副词，强调“说话/行动的方式”。","这个词在日常口语中不算常见，更自然的表达常用：“in a friendly way / peacefully / without hostility / without being aggressive”。"]}
{"word":"nonhostility","summary":{"en":"Nonhostility means the absence of hostility or a non-aggressive, friendly attitude.","zh":"nonhostility 指“没有敌意/不敌对”，强调平和或友好的态度与关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lack of hostility; a friendly, calm, or non-aggressive attitude, especially between people or groups.","zh":"不敌意；非敌对状态（指人与人或团体之间友好、平和、不具攻击性的态度或关系）。"},"examples":[{"en":"The two countries agreed to a policy of nonhostility during the talks.","zh":"两国在会谈期间同意采取不敌对的政策。"},{"en":"Her nonhostility helped defuse the argument.","zh":"她的不敌意态度帮助缓和了争吵。"}]}],"synonyms":["friendliness","amicability","lack of hostility","non-aggression","civility"],"phonetic":"/ˌnɑn hɑˈstɪləti/","extraExplanation":["“nonhostility”由前缀 non-（不、非）+ hostility（敌意）构成，语气较正式，常见于政治、外交、法律或学术语境。日常口语里更常用“lack of hostility”“non-hostile attitude”“friendliness”等表达。","相关词：non-hostile（adj. 不敌对的）、hostility（n. 敌意）、amicable（adj. 友好的）、cordial（adj. 亲切的）。","拼写提示：有时也写作“non-hostility”（加连字符），含义相同。"]}
{"word":"nonhouseholder","summary":{"en":"Nonhouseholder means a person who is not the head of a household.","zh":"nonhouseholder 指“非户主”，即不属于家庭负责人的那个人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not the head of a household and does not have the legal or practical status of a householder (often someone living in another person’s home, such as a lodger or adult child)","zh":"非户主；不被视为“户主/家庭负责人”的人（常指住在他人家中的人，如房客或成年子女）"},"examples":[{"en":"Only householders and nonhouseholders were counted separately in the survey.","zh":"这项调查把户主和非户主分别统计。"},{"en":"As a nonhouseholder living with relatives, she didn’t pay the main household bills.","zh":"作为与亲戚同住的非户主，她不承担主要的家庭账单。"}]}],"synonyms":["non-head of household","lodger","boarder","tenant"],"phonetic":"/ˌnɑnˈhaʊsˌhoʊldɚ/","extraExplanation":["这是一个较少见、偏正式的词，常出现在统计、人口普查、住房研究或旧式法律/行政语境中，用来区分“户主（householder）”与“非户主”。在日常英语里，人们更常说“not the head of the household / not the homeowner / a tenant / a lodger / an adult child living at home”等，更具体也更自然。"]}
{"word":"nonhousekeeping","summary":{"en":"“Nonhousekeeping” means not related to housekeeping work (cleaning/upkeep) or, in accounting, costs outside the housekeeping category.","zh":"“nonhousekeeping”表示与保洁/清洁日常工作无关；在会计语境下也可指不属于保洁类别的费用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not related to housekeeping (cleaning, room upkeep, or routine maintenance tasks), especially in hotels, hospitals, or building management","zh":"与客房清洁/保洁（打扫、整理、日常维护等）无关的；（尤指酒店、医院或物业管理中的）非保洁类的"},"examples":[{"en":"Nonhousekeeping staff, like reception and security, follow different schedules from the cleaning team.","zh":"非保洁岗位的员工（如前台和安保）与清洁团队的排班不同。"},{"en":"Please place nonhousekeeping requests—like billing questions—at the front desk.","zh":"非保洁类需求（比如账单问题）请到前台咨询。"}]},{"partOfSpeech":"adj.","definition":{"en":"in budgeting or accounting, describing costs that are not part of housekeeping/cleaning operations","zh":"（预算/会计用语）指不属于保洁/清洁部门或其日常运营的费用"},"examples":[{"en":"Laundry chemicals are usually housekeeping costs, while marketing is nonhousekeeping.","zh":"洗衣化学品通常算保洁成本，而市场营销则属于非保洁费用。"},{"en":"The report separates housekeeping and nonhousekeeping expenses for clarity.","zh":"报告为清晰起见，将保洁费用与非保洁费用分开列示。"}]}],"synonyms":["non-cleaning","noncustodial","not related to housekeeping"],"phonetic":"/ˌnɑnˈhaʊsˌkiːpɪŋ/","extraExplanation":["“nonhousekeeping”由前缀 non-（不、非）+ housekeeping（保洁/家政；也可指某部门的日常运营）构成，常见于酒店、医院、物业、成本分类等语境。它在日常口语中不算高频，更常见的表达是 “not related to housekeeping” 或 “non-housekeeping (tasks/expenses)”。","写作时更常见的拼写是带连字符的 “non-housekeeping”，尤其在正式文件或报表中。"]}
{"word":"nonhubristic","summary":{"en":"Nonhubristic means humble and not arrogantly proud.","zh":"nonhubristic 指不自负、不傲慢，保持谦逊的态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not showing hubris; not overly proud or arrogantly self-confident; humble in attitude","zh":"不傲慢自大；不狂妄；态度谦逊（不带“自负到失控”的那种骄傲）"},"examples":[{"en":"She stayed nonhubristic even after winning the award, thanking her whole team.","zh":"即使获奖了，她也没有自满，而是感谢了整个团队。"},{"en":"A nonhubristic leader admits mistakes and asks for feedback.","zh":"不自负的领导者会承认错误并主动征求反馈。"},{"en":"His nonhubristic tone made the criticism easier to accept.","zh":"他不傲慢的语气让批评更容易被接受。"}]}],"synonyms":["humble","modest","down-to-earth","unassuming","not arrogant","without hubris"],"phonetic":"/ˌnɑn.hjuˈbrɪs.tɪk/","extraExplanation":["“nonhubristic”由前缀 non-（不、非）+ hubristic（傲慢自大的）构成。hubristic 来自 hubris，常译为“狂妄/自大”，源自古希腊语境：指一种过度的骄傲，往往导致判断失误甚至招致“报应/惩罚”。因此 nonhubristic 不只是“有自信”，而是“有分寸的自信、保持谦逊”。","用法提示：这个词在日常英语里不算常见，写作中更常用 humble、modest、down-to-earth、not arrogant、without hubris 等表达。"]}
{"word":"nonhuman","summary":{"en":"Nonhuman means “not human,” or (in a stronger sense) “lacking human kindness; inhuman.”","zh":"nonhuman 意为“非人类的”，也可更强烈地指“缺乏人性/不人道的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not human; relating to animals, machines, aliens, or anything that is not a person.","zh":"非人类的；指动物、机器、外星生物或任何不是人的事物。"},"examples":[{"en":"Some people fear that nonhuman intelligence could become more powerful than humans.","zh":"有些人担心非人类智能可能会变得比人类更强大。"},{"en":"The story is told from a nonhuman point of view—a whale’s.","zh":"这个故事是从非人类视角讲述的——一头鲸的视角。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking normal human qualities such as empathy or warmth; inhuman.","zh":"缺乏人类常见的特质（如同理心、温情）；不近人情的。"},"examples":[{"en":"The prison conditions were described as nonhuman and cruel.","zh":"监狱条件被形容为不人道而残酷。"},{"en":"Her manager’s nonhuman treatment made the staff feel unsafe.","zh":"她经理那种不人道的对待让员工感到不安全。"}]}],"synonyms":["not human","inhuman","animal","mechanical","alien"],"phonetic":"/ˌnɑnˈhjuːmən/","extraExplanation":["“nonhuman”字面是“非人类”，常用于科学与伦理语境，比如“nonhuman animals（非人类动物）”“nonhuman intelligence（非人类智能）”。在学术写作里，用“nonhuman animals”有时比只说“animals”更强调“人与其他动物的区分”，也带有对动物伦理的关注。","当“nonhuman”用来形容人的行为或制度（如 nonhuman treatment），语气更强烈，接近“inhuman（不人道的）”。不过日常英语里更常见的说法通常是“inhuman”或“cruel”，而“nonhuman”会显得更正式或更强调“像不是人一样”。"]}
{"word":"nonhumaness","summary":{"en":"“nonhumaness” is likely a misspelling of “nonhumanness,” meaning the state/quality of being nonhuman, or (figuratively) lacking human warmth or empathy.","zh":"“nonhumaness”多半是“nonhumanness”的拼写错误，意思是“非人类的性质/状态”，也可引申为“缺乏人性、不近人情”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling of **nonhumanness**) the quality or state of being nonhuman (not a human being), or not produced by humans.","zh":"（多半是 **nonhumanness** 的拼写错误）“非人类”的性质或状态（不是人类个体），或“非人造/非人类产生”的特征。"},"examples":[{"en":"The researchers discussed the ethical status of animals and their nonhumanness.","zh":"研究者讨论了动物的伦理地位以及它们“非人类”的属性。"},{"en":"The sound had a strange nonhumanness, like a machine imitating a voice.","zh":"那声音有种奇怪的“非人类感”，像机器在模仿人声。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also used figuratively) a lack of typically human qualities such as empathy, warmth, or moral feeling; inhumanity.","zh":"（也可作引申义）缺乏同理心、温度或道德感等典型“人性”的状态；不近人情/非人道。"},"examples":[{"en":"People criticized the policy for its nonhumanness toward vulnerable families.","zh":"人们批评该政策对弱势家庭缺乏人性、显得不近人情。"},{"en":"In the novel, the villain’s nonhumanness is shown through his cold decisions.","zh":"在小说中，反派的“非人性”通过他冷酷的决定被表现出来。"}]}],"synonyms":["nonhumanness","nonhuman nature","inhumanity","inhumanness"],"phonetic":"/ˌnɑnˈhjuːmənnəs/","extraExplanation":["“nonhumaness”在标准英语中很少见，更常见的拼法是 **nonhumanness**（nonhuman + -ness）。许多词典把它列为 nonhuman 的派生名词。","**nonhuman** 常用于学术/新闻语境：如 *nonhuman animals*（非人类动物）、*nonhuman primates*（非人灵长类）、*nonhuman cells/noises*（非人类来源的细胞/声音）。引申义上也可能被用来批评某种“缺乏人性”的做法，但语气比 *cruelty/inhumanity* 更偏“抽象、学术”。","如果你想表达“残忍、非人道”，更自然的词通常是 **inhumanity** 或形容词 **inhumane**；如果只是“不是人类”，用 **nonhuman** 就够了。"]}
{"word":"nonhumanist","summary":{"en":"Nonhumanist means “not humanist,” often describing people or ideas that reject a human-centered worldview.","zh":"nonhumanist 意为“非人文主义（者）”，常用来指拒绝以人类为中心的世界观的人或观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a humanist, or who rejects humanist ideas (such as the belief that human reason and values should be central).","zh":"非人文主义者；不认同或反对人文主义观念的人（如不认为应以人的理性与价值为中心）。"},"examples":[{"en":"He describes himself as a nonhumanist who questions whether humans should be the measure of all things.","zh":"他自称是非人文主义者，质疑人类是否应成为衡量一切的尺度。"},{"en":"Some nonhumanists argue that nature does not exist mainly to serve human needs.","zh":"一些非人文主义者认为，自然并不是主要为了满足人类需求而存在。"}]},{"partOfSpeech":"adj.","definition":{"en":"not based on humanism; emphasizing forces, values, or perspectives beyond the human (for example, nature, technology, or other species).","zh":"非人文主义的；不以人文主义为基础的；强调超越人类的力量、价值或视角（如自然、技术或其他物种）。"},"examples":[{"en":"The essay takes a nonhumanist approach by focusing on rivers, animals, and climate rather than human heroes.","zh":"这篇文章采用非人文主义视角，把重点放在河流、动物和气候上，而不是人类英雄。"},{"en":"Her nonhumanist view treats machines as active partners in society, not just tools.","zh":"她的非人文主义观点把机器视为社会中的积极伙伴，而不只是工具。"}]}],"synonyms":["anti-humanist","posthumanist (related, not identical)","non-anthropocentric"],"phonetic":"/nɑnˈhjuːmənɪst/","extraExplanation":["“nonhumanist”在日常英语中不算常见，更多见于哲学、文学批评、环境人文、科技与社会研究等语境。","它通常不是指“不是人类（nonhuman）”，而是指“不以人类为中心的人文主义立场（humanism）”。如果你想表达“非人类的”，更常用nonhuman或inhuman（注意inhuman更偏“残忍的、不人道的”）。"]}
{"word":"nonhumanistic","summary":{"en":"“Nonhumanistic” means not humanistic—lacking a focus on human values or human-centered understanding.","zh":"“nonhumanistic”指“非人文主义的”，即不强调人的价值与人文关怀，或不以人本视角来理解问题。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not humanistic; not focused on human values, compassion, or the study of people (often used in academic or critical writing).","zh":"非人文主义的；不强调人的价值、同情与人文关怀（常见于学术或评论语境）。"},"examples":[{"en":"Some critics call the policy nonhumanistic because it ignores the needs of the most vulnerable.","zh":"一些评论者认为这项政策是非人文主义的，因为它忽视了最弱势群体的需求。"},{"en":"The course takes a nonhumanistic approach, focusing on data and systems rather than individual stories.","zh":"这门课采用非人文主义的取向，更关注数据与系统，而不是个体故事。"}]}],"synonyms":["inhumane","unsympathetic","uncompassionate","non-humanities (context-dependent)"],"phonetic":"/ˌnɑn.hjuːməˈnɪs.tɪk/","extraExplanation":["“nonhumanistic”并不常见，更常用的是“inhumane（不人道的）”“unsympathetic（缺乏同情的）”或“non-humanities（非人文类的）/nonhuman（非人类的）”。如果你想表达“残酷、没有人性”，通常不要用nonhumanistic。","构词提示：non-（不、非）+ humanistic（人文主义的/有人文关怀的）。在学术写作中，它可能指“与人文学科相对的、偏技术或科学的视角”，但在社会评论里也可能带有“缺少人文关怀”的批评色彩。"]}
{"word":"nonhumanized","summary":{"en":"Nonhumanized describes something that has not been made more human in form, feeling, or design.","zh":"nonhumanized 指某物没有被“人化”——在形象、情感或设计上没有更贴近人类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not made to seem human; not given human qualities, feelings, or a human-friendly form.","zh":"未被“人化”的；没有被赋予人的特征、情感或更符合人类审美/理解的形式。"},"examples":[{"en":"The robot’s voice stayed nonhumanized, which made the conversation feel cold.","zh":"机器人的声音保持着非人化的状态，这让对话显得很冷冰冰。"},{"en":"The designer chose a nonhumanized creature so it would feel truly alien.","zh":"设计师选择让生物保持非人化，这样它才会显得真正外星。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not adapted to human needs or comfort (often describing systems, rules, or environments).","zh":"未按人的需求或舒适度来调整的（常形容制度、规则或环境）。"},"examples":[{"en":"The interface is nonhumanized—it assumes users already know technical terms.","zh":"这个界面不够“人性化”——它默认用户已经懂专业术语。"},{"en":"Workers complained about a nonhumanized schedule with no breaks.","zh":"工人抱怨这个不够人性化的排班，连休息时间都没有。"}]}],"synonyms":["non-human","not anthropomorphized","unhumanized","not human-centered","not user-friendly"],"phonetic":"/ˌnɑnˈhjuːməˌnaɪzd/","extraExplanation":["“nonhumanized”不算常见词，更常见的写法是带连字符的“non-humanized”，或直接用更常用的表达：在技术/产品语境里用“not human-centered / not user-friendly / inhumane（不人道的，偏强烈）”；在文学/叙事里用“non-human / not anthropomorphized（未拟人化的）”。","词形上来自“humanize（使人性化/使具有人类特征）+ -ed”，前面加“non-”表示否定。注意它不同于“dehumanized（被去人性化的）”，后者通常带有强烈的道德与社会含义（把人当成非人对待）。"]}
{"word":"nonhumanness","summary":{"en":"Nonhumanness means the state of being nonhuman, or (in some contexts) the feeling that something is unhuman and lacking human warmth.","zh":"nonhumanness 指“非人类性”，也可指某物给人的“不近人情、缺少人类温度”的感觉（多见于理论或评论语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being nonhuman; not belonging to humans (e.g., an animal, machine, alien, or something lacking human characteristics).","zh":"非人性；非人类性：指不属于人类的状态或性质（如动物、机器、外星生命），或缺少“人类特质”。"},"examples":[{"en":"The story explores the nonhumanness of the robot and what it means to be a person.","zh":"这个故事探讨了机器人的非人类性，以及“成为一个人”意味着什么。"},{"en":"In the film, the monster’s nonhumanness is shown through its voice and movements.","zh":"在电影中，怪物的非人类性通过它的声音和动作表现出来。"}]},{"partOfSpeech":"n.","definition":{"en":"The sense that something feels unhuman or lacks warmth, empathy, or ordinary human behavior (often in philosophical, literary, or critical writing).","zh":"（多用于哲学/文学/评论写作）非人的感觉：指某物显得不近人情、缺少温度、共情或常见的人类行为。"},"examples":[{"en":"Some critics argue that the cold lighting adds to the nonhumanness of the setting.","zh":"一些评论家认为冷色调的灯光加强了场景的不近人情感。"},{"en":"He described the office culture’s nonhumanness as the reason he quit.","zh":"他把办公室文化的“不近人情”当作辞职的原因。"}]}],"synonyms":["nonhumanity","otherness","inhumanness","lack of humanity"],"phonetic":"/nɑnˈhjuːmənnəs/","extraExplanation":["“nonhumanness”在日常英语里不算常见，更常见的表达是“nonhuman nature/quality（非人类性质）”或用形容词“nonhuman（非人类的）”。","注意区别：nonhumanness（非人类性/不近人情感）≠ inhumanity（残忍、无人道）。如果你想表达“残酷、不人道”，通常用“inhumanity”或“inhumane”。","常见搭配语境：科幻与AI伦理（personhood/identity）、怪物叙事（the Other/异类）、生态写作（human vs. nonhuman world）。"]}
{"word":"nonhumorous","summary":{"en":"“Nonhumorous” describes something that is not funny or is serious in tone.","zh":"“nonhumorous”用来形容不好笑或语气严肃的表达/内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not funny; not intended to make people laugh; serious in tone.","zh":"不幽默的；不好笑的；（语气）严肃的。"},"examples":[{"en":"His nonhumorous reply made the room feel tense.","zh":"他不幽默的回答让房间里的气氛变得紧张。"},{"en":"The article is nonhumorous and focuses on safety rules.","zh":"这篇文章不带幽默感，重点讲安全规定。"},{"en":"She delivered the message in a nonhumorous tone.","zh":"她用一种严肃、不带玩笑的语气传达了信息。"}]}],"synonyms":["serious","straight-faced","sober","earnest","humorless"],"phonetic":"/ˌnɑnˈhjuːmərəs/","extraExplanation":["“non-”是否定前缀，表示“非……、不……”。“nonhumorous”=“non-”+“humorous（幽默的）”，常用于正式语境或写作中，强调表达方式严肃、缺少笑点。"]}
{"word":"nonhumorously","summary":{"en":"Nonhumorously means “seriously; not as a joke.”","zh":"nonhumorously 的意思是“严肃地；不是开玩笑地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a serious way; without trying to be funny or joking.","zh":"严肃地；不带幽默地；不是在开玩笑地。"},"examples":[{"en":"I’m asking nonhumorously—are you actually okay?","zh":"我不是开玩笑在问——你真的还好吗？"},{"en":"He spoke nonhumorously about the risks of the project.","zh":"他严肃地谈到了这个项目的风险。"},{"en":"The topic is sensitive, so please respond nonhumorously.","zh":"这个话题比较敏感，所以请严肃回应，不要开玩笑。"}]}],"synonyms":["seriously","soberly","earnestly","gravely","straightforwardly"],"phonetic":"/ˌnɑnˈhjuːmərəsli/","extraExplanation":["“nonhumorously”由 non-（不、非）+ humorously（幽默地）构成，强调“不是以搞笑/开玩笑的方式”。在日常口语里更常见的表达是 “seriously” 或 “no joke”。写作中使用它会显得更正式、也更直白。"]}
{"word":"nonhumorousness","summary":{"en":"Nonhumorousness means the quality of being not humorous—serious and lacking humor.","zh":"nonhumorousness 指“不幽默”的特质：偏严肃、缺乏幽默感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not being humorous; seriousness or a lack of humor.","zh":"不幽默；缺乏幽默感；（表达或氛围的）严肃、不带玩笑。"},"examples":[{"en":"The speaker’s nonhumorousness made the audience uncomfortable.","zh":"演讲者的不幽默让听众感到不自在。"},{"en":"In a crisis, a certain nonhumorousness can help people focus on what matters.","zh":"在危机时刻，适度的严肃不带玩笑能帮助人们专注于重要的事情。"},{"en":"His emails have a tone of nonhumorousness, even when he’s trying to be friendly.","zh":"即使他想表达友好，他的邮件语气也显得不幽默、偏严肃。"}]}],"synonyms":["seriousness","lack of humor","sobriety","gravitas"],"phonetic":"/ˌnɑnˈhjuːmərəsnəs/","extraExplanation":["这个词由 non-（不、非）+ humorous（幽默的）+ -ness（名词后缀：……的状态/性质）构成，语感偏“书面、描述性”，日常口语更常说 lack of humor / seriousness / not funny。","nonhumorousness 不等于 “冷漠” 或 “刻薄”；它主要强调“没有幽默/不带玩笑的语气”。在正式场合或严肃议题中，这种语气有时是合适的。"]}
{"word":"nonhumus","summary":{"en":"Nonhumus means the part of soil organic material that is not humus (not fully humified).","zh":"nonhumus 指土壤中不属于腐殖质（humus）的那部分有机物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(soil science) Organic material in soil that is **not** humus—i.e., soil organic matter that is not fully humified (often less decomposed or in a different chemical form).","zh":"（土壤科学）土壤中**不是腐殖质（humus）**的有机物质；指未充分腐殖化、性质不同于腐殖质的土壤有机物。"},"examples":[{"en":"The lab report separates soil organic matter into humus and nonhumus fractions.","zh":"实验报告把土壤有机质分为腐殖质和非腐殖质两部分。"},{"en":"Fresh plant residues are usually classified as nonhumus until they decompose further.","zh":"新鲜的植物残体通常在进一步分解前会被归为非腐殖质。"}]}],"synonyms":["non-humus material","nonhumic matter","unhumified organic matter"],"phonetic":"/ˌnɑnˈhjuːməs/","extraExplanation":["“nonhumus”是一个比较专业、偏学术的词，常见于土壤学/农业环境类文本；日常英语里更常用的是“soil organic matter（SOM）”“humus（腐殖质）”“(un)humified organic matter（（未）腐殖化有机质）”。","注意不要和 **nonhuman**（非人类的）或 **hummus**（鹰嘴豆泥）混淆：拼写很像，但意思完全不同。"]}
{"word":"nonhunting","summary":{"en":"Nonhunting means not involving hunting, often used to describe activities, seasons, or areas intended for non-hunters or where hunting is not part of the purpose.","zh":"nonhunting 指“非狩猎的”，常用来描述面向不打猎者的活动/季节/区域，或与狩猎无关的用途。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving hunting; intended for people who do not hunt.","zh":"不涉及狩猎的；为不打猎的人设计的。"},"examples":[{"en":"The park offers nonhunting activities like hiking and birdwatching.","zh":"这个公园提供徒步、观鸟等非狩猎活动。"},{"en":"Some areas are designated as nonhunting zones to protect wildlife.","zh":"有些地区被划为禁猎区以保护野生动物。"}]}],"synonyms":["not for hunting","no-hunting (when meaning prohibited)","hunting-free"],"phonetic":"ˌnɑnˈhʌntɪŋ","extraExplanation":["“non-”是英语里很常见的前缀，表示“非……、不……”。因此 nonhunting 通常用来做定语，修饰名词（如 nonhunting season / nonhunting area），强调该季节或区域与狩猎无关或禁止狩猎。","在实际使用中，这个词更多见于管理公告、法规或户外场所说明；日常口语里也常用更自然的说法，如 “no-hunting” 或 “not for hunting”（具体看语境是否表示“禁止”还是“只是与狩猎无关”）。"]}
{"word":"nonhydrated","summary":{"en":"Nonhydrated means “not hydrated,” especially “not containing chemically bound water.”","zh":"nonhydrated 表示“未水合的”，尤其指“不含结晶水/化学结合水的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hydrated; not containing water (especially water chemically bound in a substance) or not having had water added.","zh":"未水合的；不含（尤其是化学结合的）结晶水的；未加水的。"},"examples":[{"en":"Use the nonhydrated form of the chemical for this reaction.","zh":"这个反应要使用该化学品的未水合形式。"},{"en":"Nonhydrated lime reacts strongly when water is added.","zh":"未水合的石灰加水后会发生强烈反应。"}]}],"synonyms":["anhydrous","water-free","unhydrated"],"phonetic":"/ˌnɑnˈhaɪdreɪtɪd/","extraExplanation":["在化学里，hydrate（“水合物”）指化合物晶体结构中含有固定比例的水（结晶水），例如 CuSO4·5H2O。nonhydrated 通常表示不含这种结晶水。","很多场合也会用更常见的词 anhydrous（“无水的”）来表示“无结晶水”。nonhydrated 更偏字面表达，有时用于说明“未进行水合/未加水”的状态。","在日常健康语境中（人体补水）更常用 hydrated / dehydrated，而 nonhydrated 相对少见。"]}
{"word":"nonhydraulic","summary":{"en":"“Nonhydraulic” means not using or relating to hydraulic (liquid-pressure) systems.","zh":"“nonhydraulic”表示“不使用液压系统/与液压无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not operated by, using, or related to hydraulics (systems that use liquid pressure to transmit power).","zh":"非液压的；不通过液压（用液体压力传递动力的系统）运作的；与液压无关的。"},"examples":[{"en":"This model uses a nonhydraulic brake system.","zh":"这款型号使用的是非液压制动系统。"},{"en":"They replaced the hydraulic press with a nonhydraulic, electric-driven machine.","zh":"他们用一台非液压的电驱机器替换了液压压力机。"},{"en":"The controls are nonhydraulic, so maintenance is simpler.","zh":"这些控制装置是非液压的，所以维护更简单。"}]}],"synonyms":["non-hydraulic","not hydraulic","nonfluid-power (context-specific)"],"phonetic":"/ˌnɑnhaɪˈdrɔlɪk/","extraExplanation":["“non-”是否定前缀，表示“不是/不使用”。“hydraulic”来自“hydro-（水）+ -aulic（管道/管路相关）”，在工程语境中指“用液体压力传递动力”的系统。","在机械、航空、工业设备说明书里常见：nonhydraulic 常用于强调某个部件/系统不依赖液压油、液压泵或液压管路（例如用电动、气动、机械连杆等方式替代）。"]}
{"word":"nonhydrogenous","summary":{"en":"“Nonhydrogenous” means not containing hydrogen, mostly used in scientific contexts.","zh":"“nonhydrogenous”意为“不含氢的/无氢的”，多用于科学技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not containing hydrogen; hydrogen-free (used mainly in scientific/technical writing)","zh":"不含氢的；无氢的（主要用于科技/学术语境）"},"examples":[{"en":"Researchers used a nonhydrogenous gas to avoid unwanted reactions.","zh":"研究人员使用了不含氢的气体，以避免不必要的反应。"},{"en":"The sample was described as nonhydrogenous, so it would not release hydrogen during heating.","zh":"该样品被描述为无氢的，因此加热时不会释放氢。"}]}],"synonyms":["hydrogen-free","without hydrogen","dehydrogenated (context-dependent)"],"phonetic":"/nɑnhaɪˈdrɑdʒənəs/","extraExplanation":["这个词比较少见，更常见的表达是 hydrogen-free（无氢的）或 without hydrogen（不含氢）。在化学中也可能根据具体对象用更精确的术语，比如 anhydrous（无水的，强调不含水而不是不含氢）或 dehydrogenated（脱氢的，强调“被去除氢”的过程）。","构词上：non-（不、非）+ hydrogen（氢）+ -ous（……的），意思直观但在现代英语里不算高频。"]}
{"word":"nonhydrolyzable","summary":{"en":"Nonhydrolyzable means resistant to hydrolysis—water cannot break it down under normal conditions.","zh":"nonhydrolyzable 指“不可水解的”，即在通常条件下不会被水参与的反应分解。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be broken down by hydrolysis (a reaction where water splits a chemical bond).","zh":"不可水解的；不能通过水解（用水把化学键切开的一类反应）被分解的。"},"examples":[{"en":"Researchers used a nonhydrolyzable ATP analog to study how the enzyme binds ATP without letting it react.","zh":"研究人员使用不可水解的 ATP 类似物来研究酶如何结合 ATP，而不让它发生反应。"},{"en":"A nonhydrolyzable bond can make a compound more stable in water-based solutions.","zh":"不可水解的键可以让化合物在水溶液中更稳定。"}]}],"synonyms":["hydrolysis-resistant","not hydrolyzable","noncleavable (by hydrolysis)"],"phonetic":"/ˌnɑnˌhaɪˈdrɑlɪzəbəl/","extraExplanation":["这个词多见于生物化学与药物化学论文里，例如“nonhydrolyzable ATP/GTP analog（不可水解的 ATP/GTP 类似物）”。用途通常是：让分子“看起来像底物（substrate）”，能结合到蛋白上，但因为不能被水解，所以不会进入下一步反应，从而帮助研究结合机制或锁定某种构象。","构词法：non-（不）+ hydrolyzable（可水解的）。美式拼写常见 hydrolyzable；英式也可能写作 hydrolysable。"]}
{"word":"nonhydrophobic","summary":{"en":"Nonhydrophobic means “not water-repelling,” often implying the surface/material is water-attracting or water-wettable.","zh":"nonhydrophobic 意为“不排斥水/不疏水”，常暗示材料或表面亲水、易被水润湿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hydrophobic; not repelled by water (often meaning it is water-attracting or water-wettable).","zh":"不疏水的；不排斥水的（常指亲水、易被水润湿）。"},"examples":[{"en":"The coating is nonhydrophobic, so water spreads across the surface instead of beading up.","zh":"这种涂层不疏水，所以水会在表面铺开，而不是形成水珠。"},{"en":"Nonhydrophobic materials are often easier to clean with water-based solutions.","zh":"不疏水的材料通常更容易用水基清洁剂清洗。"}]}],"synonyms":["hydrophilic","water-attracting","wettable"],"phonetic":"ˌnɑnˌhaɪdrəˈfoʊbɪk","extraExplanation":["“non-”是否定前缀，表示“不是……”。“hydrophobic”字面是“怕水/疏水”，在化学与生物学里常指“与水不相容、会排斥水”。因此“nonhydrophobic”多用于科研或工程语境，强调材料/表面不表现出疏水性。更常见的同义表达是“hydrophilic（亲水的）”或“wettable（可润湿的）”。"]}
{"word":"nonhygrometric","summary":{"en":"Nonhygrometric describes something that does not absorb moisture from the air and is not easily affected by humidity.","zh":"nonhygrometric 指“非吸湿性的”，即不从空气中吸收水分、也不易受湿度影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not hygrometric; not absorbing moisture from the air and not noticeably affected by humidity","zh":"非吸湿性的；不从空气中吸收水分、也不易受湿度影响的"},"examples":[{"en":"Choose a nonhygrometric container to keep the powder dry.","zh":"选择一个非吸湿性的容器来保持粉末干燥。"},{"en":"Nonhygrometric materials are useful for storing medicines in humid climates.","zh":"在潮湿气候中，非吸湿性材料对药品储存很有用。"},{"en":"The label says the salt substitute is nonhygrometric, so it won’t clump easily.","zh":"标签上说这种代盐是非吸湿性的，所以不容易结块。"}]}],"synonyms":["nonhygroscopic","moisture-resistant","humidity-resistant","water-repellent"],"phonetic":"/ˌnɑnˌhaɪɡrəˈmɛtrɪk/","extraExplanation":["“non-”表示“非、不”，加在“hygrometric（与湿度测量或吸湿相关的）”前，构成“nonhygrometric”。在日常英语里更常见的同义词是“nonhygroscopic（非吸湿性的）”或“moisture-resistant（防潮的）”。","这个词多见于材料科学、化学、制药、包装等语境，用来描述粉末、药品、干燥剂容器、某些塑料或涂层等在潮湿环境下不易吸水、不易结块或性能稳定。"]}
{"word":"nonhygroscopic","summary":{"en":"“Nonhygroscopic” describes a material that does not readily absorb moisture from the air.","zh":"“nonhygroscopic”用来形容材料不易从空气中吸收水分（非吸湿性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hygroscopic; not likely to absorb moisture (water vapor) from the air.","zh":"非吸湿性的；不容易从空气中吸收水分（水蒸气）的。"},"examples":[{"en":"Glass and many plastics are nonhygroscopic, so they stay dry on the surface in normal conditions.","zh":"玻璃和许多塑料是非吸湿性的，所以在一般环境下表面能保持干燥。"},{"en":"Choose a nonhygroscopic container to store the powder so it won’t clump.","zh":"选择非吸湿性的容器来储存粉末，这样就不容易结块。"}]}],"synonyms":["nonabsorptive (of moisture)","moisture-resistant (in air)","not hygroscopic"],"phonetic":"/ˌnɑnˌhaɪɡrəˈskɑpɪk/","extraExplanation":["构词法：non-（不、非）+ hygroscopic（吸湿的）。","使用场景：常见于化学、材料科学、制药与实验室语境，用来描述材料/粉末在空气湿度下是否会“吸水”。","对比词：hygroscopic（吸湿的），moisture-absorbing（吸水的）。注意：nonhygroscopic 不等于 waterproof（防水的）；它主要强调“不从空气中吸湿”。"]}
{"word":"nonhygroscopically","summary":{"en":"“Nonhygroscopically” means “in a way that does not absorb moisture from the air.”","zh":"“nonhygroscopically”意为“以不吸湿（不从空气中吸收水分）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not hygroscopic; without absorbing water vapor (moisture) from the air.","zh":"以不吸湿的方式；不会从空气中吸收水汽（湿气）地。"},"examples":[{"en":"The powder must be stored nonhygroscopically to prevent clumping.","zh":"这种粉末必须以不吸湿的方式储存，以防结块。"},{"en":"This coating protects the surface so it behaves nonhygroscopically in humid conditions.","zh":"这种涂层保护表面，使其在潮湿环境下表现为不吸湿。"}]}],"synonyms":["in a non-hygroscopic way","without absorbing moisture","moisture-resistantly"],"phonetic":"/ˌnɑnˌhaɪɡrəˈskɑpɪkli/","extraExplanation":["这是一个较少见、偏科技写作的副词：non-（不、非）+ hygroscopic（吸湿的）+ -ally（……地）。日常英语里更常写成“in a non-hygroscopic way / so it is not hygroscopic”。","常见于材料科学、化学、制药与食品包装等语境，用来强调某种材料/处理方式不会导致吸湿，从而避免结块、变质、重量变化或反应失控。"]}
{"word":"nonhyperbolic","summary":{"en":"Nonhyperbolic means “not exaggerated” in everyday language, and “not hyperbolic (in the mathematical sense)” in technical contexts.","zh":"nonhyperbolic 在日常语境中表示“不夸张的”，在技术/数学语境中表示“非双曲的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hyperbolic; not exaggerated or overstated (used especially about language, claims, or descriptions).","zh":"不夸张的；不使用夸张法的（尤指语言、说法或描述不言过其实）。"},"examples":[{"en":"Her review was calm and nonhyperbolic, focusing on specific strengths and weaknesses.","zh":"她的评论冷静而不夸张，着重谈了具体的优点和缺点。"},{"en":"Try to make your résumé nonhyperbolic so employers can trust it.","zh":"尽量让你的简历不夸张，这样雇主才会更信任。"}]},{"partOfSpeech":"adj.","definition":{"en":"In mathematics/science: not related to a hyperbola or hyperbolic geometry/functions (e.g., nonhyperbolic equations or spaces).","zh":"（数学/科学）非双曲线的；与双曲线或双曲几何/双曲函数无关的（如非双曲方程、非双曲空间）。"},"examples":[{"en":"The paper compares hyperbolic and nonhyperbolic models for the same data.","zh":"这篇论文比较了同一组数据的双曲模型与非双曲模型。"},{"en":"They studied nonhyperbolic trajectories in a simplified system.","zh":"他们在一个简化系统中研究了非双曲轨迹。"}]}],"synonyms":["not exaggerated","unexaggerated","measured","restrained","literal"],"phonetic":"/ˌnɑnˌhaɪpɚˈbɑlɪk/","extraExplanation":["“hyperbolic”在日常英语里常指“夸张的”（来自修辞手法 hyperbole，意为“夸张法”）；在数学里则与“hyperbola（双曲线）/ hyperbolic（双曲的）”有关。所以 nonhyperbolic 的含义要根据语境判断：写作或评论里多指“不夸张”，学术语境里多指“非双曲的”。","拼写提示：hyperbole（修辞夸张法）读音与 hyperbolic（夸张的/双曲的）相近但用法不同；nonhyperbolic 通常用于较正式或学术场合，日常口语更常说 “not exaggerated” 或 “not over-the-top”。"]}
{"word":"nonhyperbolical","summary":{"en":"Nonhyperbolical means “not hyperbolical”: either not exaggerated in speech/writing, or (in math) not hyperbolic.","zh":"nonhyperbolical 意为“非夸张的/不使用夸张法的”，也可指（数学中）“非双曲的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hyperbolical (not using or involving hyperbole); plain and not exaggerated.","zh":"非夸张的；不使用修辞“夸张法”的；表达朴实、不言过其实的。"},"examples":[{"en":"Please give a nonhyperbolical description of what happened—just the facts.","zh":"请用不夸张的方式描述发生了什么——只说事实。"},{"en":"Her nonhyperbolical tone made the report feel trustworthy.","zh":"她不夸张的语气让这份报告更显得可信。"}]},{"partOfSpeech":"adj.","definition":{"en":"In mathematics/geometry: not hyperbolic (e.g., not related to a hyperbola or hyperbolic geometry).","zh":"（数学/几何）非双曲的；不属于双曲线或双曲几何的。"},"examples":[{"en":"This chapter focuses on nonhyperbolical (Euclidean) cases.","zh":"本章重点讨论非双曲的（欧几里得）情况。"},{"en":"They compared hyperbolical and nonhyperbolical models.","zh":"他们比较了双曲模型与非双曲模型。"}]}],"synonyms":["nonhyperbolic","literal","plain","unexaggerated","factual"],"phonetic":"/ˌnɑnˌhaɪpərˈbɑlɪkəl/","extraExplanation":["“nonhyperbolical”非常少见；更常用、也更自然的写法是 **nonhyperbolic**。在修辞学里，hyperbole 指“夸张法”（如：“I’ve told you a million times.” 我跟你说过一百万次）。在数学里，hyperbolic 常指“双曲的/双曲几何的”。因此 nonhyperbolical 主要就是“不夸张的”或“非双曲的”。"]}
{"word":"nonhyperbolically","summary":{"en":"Nonhyperbolically means “without exaggeration; literally/seriously,” used to stress that a statement is truly factual.","zh":"nonhyperbolically 意为“毫不夸张地、如实地”，用来强调所说的话确实是真的。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a literal, factual way—without exaggeration (often used to emphasize that something is true even though it sounds extreme).","zh":"以字面、如实的方式；不夸张地（常用来强调某事虽然听起来很夸张，但确实是真的）。"},"examples":[{"en":"I was nonhyperbolically shaking with fear when the earthquake started.","zh":"地震一开始，我真的（毫不夸张地）吓得发抖。"},{"en":"She nonhyperbolically worked all night to finish the project.","zh":"她真的（不夸张地）熬了一整夜来完成这个项目。"},{"en":"This is, nonhyperbolically, the best meal I’ve had this year.","zh":"这确实（毫不夸张地）是我今年吃过最好的一顿。"}]}],"synonyms":["literally","seriously","truly","genuinely","in all seriousness","without exaggeration"],"phonetic":"/ˌnɑnˌhaɪpɚˈbɑlɪkli/","extraExplanation":["“nonhyperbolically”不是非常常见的正式词，更常见于网络写作/口语化表达，用来提前“挡住”别人觉得你在夸大其词的怀疑，相当于“真的、不是夸张”。","常见位置：放在句首作插入语（Nonhyperbolically, ...）或放在动词/形容词前（I nonhyperbolically ... / It’s nonhyperbolically ...）。更自然的替代表达有：“literally”（在严格意义上）、“seriously”、或“truly / genuinely”。注意“literally”在口语里也常被用来夸张，因此“nonhyperbolically”有时是为了更明确地表示“不是夸张”。"]}
{"word":"nonhypnotic","summary":{"en":"Nonhypnotic means “not hypnotic”: it does not induce sleep or a trance, literally or sometimes figuratively.","zh":"nonhypnotic 表示“非催眠的”：不会诱导入睡或催眠状态（有时也可作比喻义，指不让人昏昏欲睡）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not causing hypnosis; not having a hypnotic (sleep-inducing or trance-inducing) effect.","zh":"非催眠的；不会引发催眠状态的；不具催眠（诱导入睡或恍惚/催眠）作用的。"},"examples":[{"en":"This medication is nonhypnotic, so it shouldn’t make you sleepy.","zh":"这种药是非催眠的，所以一般不应该让你犯困。"},{"en":"The doctor recommended a nonhypnotic treatment for her insomnia because she needed to stay alert at work.","zh":"医生为她的失眠建议了非催眠的治疗方式，因为她工作时需要保持清醒。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In style or effect) Not lulling, dreamy, or trance-like; not “hypnotic” in a figurative sense.","zh":"（风格/效果上）不令人昏昏欲睡的；不迷离、不过度“催眠式”的（比喻义）。"},"examples":[{"en":"The editing is fast and nonhypnotic, keeping the audience alert.","zh":"剪辑节奏很快，不会产生“催眠感”，让观众保持注意力。"},{"en":"She prefers nonhypnotic music when she studies.","zh":"她学习时更喜欢不那么“催眠”的音乐。"}]}],"synonyms":["non-sedating","non-soporific","alerting (context-dependent)"],"phonetic":"/ˌnɑn hɪpˈnɑtɪk/","extraExplanation":["这个词由前缀 non-（“不、非”）+ hypnotic（“催眠的/安眠的”）组成，常见于医学或药学语境：hypnotic 既可以指“催眠药/安眠药”（名词），也可以指“催眠的、使人困倦的”（形容词）。因此 nonhypnotic 往往用来强调“不会引起嗜睡/不会诱发催眠状态”。","拼写上有时也会写作 non-hypnotic（带连字符），意思相同；在正式医学写作中两种都能见到。"]}
{"word":"nonhypnotically","summary":{"en":"“Nonhypnotically” means doing something without hypnosis or while not in a hypnotic trance.","zh":"nonhypnotically 表示“不通过催眠”或“在未被催眠的状态下”做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not hypnotic; without using hypnosis or not under the influence of hypnosis.","zh":"以非催眠的方式；不使用催眠；在未被催眠影响的状态下。"},"examples":[{"en":"The therapist worked nonhypnotically, using only conversation and breathing exercises.","zh":"治疗师以非催眠的方式进行，只用谈话和呼吸练习。"},{"en":"Participants responded nonhypnotically, showing no trance-like behavior.","zh":"参与者在未被催眠的状态下作出反应，没有出现类似恍惚的行为。"}]}],"synonyms":["without hypnosis","not under hypnosis","while fully conscious"],"phonetic":"/ˌnɑn hɪpˈnɑtɪkli/","extraExplanation":["这个词很少见，结构是 non-（不、非）+ hypnotic（催眠的）+ -ally（副词后缀）。在日常英语里，人们更常说 without hypnosis（不使用催眠）或 not under hypnosis（未处于催眠状态）来表达同样意思。","语境上常见于心理治疗、医学研究或实验报告，用来对比 hypnotically（以催眠方式/在催眠状态下）。"]}
{"word":"nonhypostatic","summary":{"en":"Nonhypostatic means “not existing as a distinct person or independent underlying reality,” used mainly in theology and philosophy.","zh":"nonhypostatic 指“非位格性的/非实体化的（不作为独立位格或独立本体存在）”，主要用于神学与哲学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hypostatic; not existing as a distinct, individual “person” or underlying reality on its own.","zh":"非“位格的 / 实体化的”；指不作为独立的个体“位格”或潜在本体而单独存在。"},"examples":[{"en":"In this view, the attribute is real but nonhypostatic—it does not exist as a separate person.","zh":"在这种观点中，这个属性是真实的，但并非位格性的——它不作为一个独立的人格存在。"},{"en":"Some writers describe the divine energies as nonhypostatic to avoid treating them as separate beings.","zh":"一些作者把“神的能量/作为”称为非位格性的，以避免把它们当作独立的存在。"}]}],"synonyms":["non-personal","impersonal","non-substantial","non-independent"],"phonetic":"/ˌnɑnˌhaɪpəˈstætɪk/","extraExplanation":["“hypostatic”来自希腊语 hypostasis（意为“基础、实体；在神学中常指‘位格’”）。因此 nonhypostatic 多见于神学/哲学讨论，尤其与基督论的“位格联合（hypostatic union）”或三位一体术语相关。","在日常英语中几乎不用；写作时通常需要上下文说明你指的是“不是独立位格/不具独立实体地位”，以免读者误解为单纯的“非真实”或“无关紧要”。"]}
{"word":"nonhypostatical","summary":{"en":"A rare adjective meaning “not hypostatic”: not treated as a real independent substance/person, mainly in philosophy or theology.","zh":"罕见形容词，意为“非实体/非位格性的”：不被当作独立真实存在的本体/位格（多见于哲学或神学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hypostatic; not existing as an independent underlying reality or “person/substance” (used mainly in philosophy and theology).","zh":"非“位格/实体性”的；不作为独立的本体（或位格、实体）而存在的（主要用于哲学与神学语境）。"},"examples":[{"en":"In that essay, the author treats the idea as nonhypostatical—useful for discussion, but not a real entity.","zh":"在那篇文章里，作者把这个概念看作是 nonhypostatical 的——便于讨论，但并非真实存在的实体。"},{"en":"Some theologians argue that certain attributes are nonhypostatical and should not be spoken of as separate persons.","zh":"一些神学家认为某些属性是 nonhypostatical 的，因此不应被说成是独立的位格。"}]}],"synonyms":["nonhypostatic","non-hypostatic","not hypostatic","conceptual","notional"],"phonetic":"/ˌnɑnˌhaɪpəˈstætɪkəl/","extraExplanation":["这个词非常少见，更多时候你会看到 **non-hypostatic / nonhypostatic**（不加 -al）或直接用 **not hypostatic**。","**hypostasis**（hypostatic 的词根）在不同传统里含义不完全一样：在哲学里可指“底层实在/本体基础”；在基督教神学里常与“三个位格（Persons）”等概念相关。**nonhypostatical** 就是在否认或避免把某种性质、概念当作一个独立存在的“实体/位格”。","写作建议：除非你在读或写非常专业的神学/哲学文本，一般用更常见、清晰的表达（例如 *not a real entity*, *conceptual rather than real*, *nonhypostatic*）会更易懂。"]}
{"word":"nonhypostatically","summary":{"en":"“Nonhypostatically” means “not in a hypostatic (personal/substantial) way,” mainly in theology/philosophy.","zh":"“nonhypostatically”意为“非位格/非本体地”，主要用于神学或哲学讨论。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not hypostatic; not as an independent “person” or underlying substance (often used in theology or philosophy).","zh":"以“非本体（非位格）”的方式；不是作为独立的“位格/实体”或根本实在（多用于神学或哲学语境）。"},"examples":[{"en":"Some theologians say Christ is united to humanity personally (hypostatically), not merely or nonhypostatically.","zh":"有些神学家说，基督与人性是以“位格性”（hypostatic）联合的，而不是仅仅以“非位格性”（nonhypostatically）的方式。"},{"en":"The author argues that the divine presence should not be understood nonhypostatically, as if it were only an impersonal force.","zh":"作者认为，不应把神圣的临在理解为“非位格性”的，好像它只是某种非人格的力量。"}]}],"synonyms":["not personally","not as a person","not as an independent substance","impersonally"],"phonetic":"/ˌnɑnˌhaɪpəˈstætɪkli/","extraExplanation":["“hypostasis”在基督教神学里常译为“位格”（也可指“本体/实体”），尤其出现在“三位一体”与“基督位格联合（hypostatic union）”的讨论中：强调不是抽象属性或力量，而是“作为一位（person）的存在”。因此 nonhypostatically 通常用来否定这种“位格/本体层面的”理解，表示“不是以位格方式、不是作为独立实体”。","该词非常罕见，更多见于学术写作。日常英语通常会改用更直白的表达，如 “not personally,” “not as a person,” “not as an independent substance,” 或直接说明 “not in the hypostatic sense”。"]}
