{"word":"nonjoinder","summary":{"en":"Nonjoinder is a legal term meaning a failure to include a required person or claim in a lawsuit.","zh":"nonjoinder 是法律术语，指诉讼中未将必须列入的当事人或请求一并加入。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) The failure to join (include) a necessary person or claim in a lawsuit or legal proceeding.","zh":"（法律）在诉讼或法律程序中未将必要当事人或必要请求一并列入（加入）的情形。"},"examples":[{"en":"The judge dismissed the case because of nonjoinder of an indispensable party.","zh":"法官因未列入不可或缺的当事人（nonjoinder）而驳回了该案。"},{"en":"The defendant argued nonjoinder, claiming the correct company had not been added to the lawsuit.","zh":"被告提出未列入必要当事人（nonjoinder）的主张，称应诉公司并未被加入诉讼。"}]}],"synonyms":["failure to join","omission of a necessary party","non-joinder (variant spelling)"],"phonetic":"ˌnɑnˈdʒɔɪndɚ","extraExplanation":["这是偏法律英语的名词，常见于民事诉讼语境，指“应当合并的当事人/请求没有被加入”。在美国法里常与“joinder（追加/合并当事人）”“necessary/indispensable party（必要/不可或缺当事人）”一起出现。","相关对比：nonjoinder（没把该加的人加进来） vs. misjoinder（加错了人或不恰当合并）。不同法域与规则（如美国联邦民事诉讼规则）对后果可能不同：可能要求补正、追加当事人，或在严重时导致驳回。"]}
{"word":"nonjournalistic","summary":{"en":"“Nonjournalistic” means not related to journalism or not written/produced in a news-reporting style.","zh":"“nonjournalistic”表示“非新闻的/非新闻报道风格的”，也可指“非新闻机构或非记者制作的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to journalism; not written or presented in the style of news reporting.","zh":"非新闻的；不属于新闻报道的；不采用新闻写作风格的。"},"examples":[{"en":"The book is deliberately nonjournalistic, focusing on personal memory rather than reporting facts.","zh":"这本书刻意采用非新闻的写法，强调个人记忆而非报道事实。"},{"en":"She wanted a nonjournalistic tone—more reflective and less like a news article.","zh":"她想要一种非新闻的语气——更具反思性，而不像新闻稿。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not produced by journalists or news organizations; outside professional news media.","zh":"非记者/非媒体机构制作的；不属于专业新闻媒体的。"},"examples":[{"en":"The footage was nonjournalistic, filmed by a bystander and later shared online.","zh":"这段视频不是新闻机构拍摄的，而是路人拍下后在网上分享的。"},{"en":"They relied on nonjournalistic sources such as letters and diaries.","zh":"他们依靠的是非新闻类材料，比如书信和日记。"}]}],"synonyms":["non-news","nonreportorial","non-media","nonprofessional (in context)","unjournalistic"],"phonetic":"/ˌnɑnˌdʒɝnəˈlɪstɪk/","extraExplanation":["“nonjournalistic”是由前缀 non-（“非”）+ journalistic（“新闻的；新闻写作风格的”）构成，多用于学术写作、媒体研究、写作风格讨论中。","它通常在书面语中出现，用来对比“journalistic（新闻式的：强调事实、时间、来源、客观语气）”与“literary/personal/essayistic（文学性/个人化/随笔式）”的表达方式。"]}
{"word":"nonjournalistically","summary":{"en":"Nonjournalistically means “in a non-journalistic way”—more personal, essay-like, or not following news-reporting standards.","zh":"nonjournalistically 意为“以非新闻方式”，可能更偏个人化/随笔化，或不遵循新闻报道规范。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not journalistic (not written, presented, or produced like news reporting).","zh":"以非新闻报道的方式；不具有新闻写作/新闻报道风格地。"},"examples":[{"en":"The story is told nonjournalistically, focusing on memory and emotion rather than verified facts.","zh":"这个故事以非新闻报道的方式讲述，更强调记忆和情感，而不是可核实的事实。"},{"en":"She described the event nonjournalistically, like a personal diary entry.","zh":"她以非新闻式的方式描述那件事，像写日记一样。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that does not follow journalistic standards (such as neutrality, attribution, and fact-checking).","zh":"以不遵循新闻职业规范（如中立、出处标注、事实核查等）的方式。"},"examples":[{"en":"The post argues nonjournalistically, offering opinions without sources.","zh":"这篇帖子以不符合新闻规范的方式在论证，只给观点却没有来源。"},{"en":"He wrote nonjournalistically, blurring the line between reporting and commentary.","zh":"他写作方式不够新闻化，把报道和评论的界限弄模糊了。"}]}],"synonyms":["subjectively","personally","essayistically","nonreportorially","informally"],"phonetic":"/ˌnɑnˌdʒɝnəˈlɪstɪkli/","extraExplanation":["这个词比较少见，更多时候人们会说：in a non-journalistic way / not journalistically / more like an essay or memoir。","构词很好理解：non-（不、非）+ journalistic（新闻的、新闻式的）+ -ally（副词后缀）。常用来对比“journalistically（以新闻方式）”。","语气上常带一点“这不是新闻报道”的提示：可能更主观、更文学化，或缺少新闻写作中的核实与引用。具体褒贬要看语境。"]}
{"word":"nonjudgmental","summary":{"en":"Nonjudgmental means accepting and fair—without blaming or morally judging people, often in supportive conversation.","zh":"nonjudgmental 指“包容、不带评判”的：不责怪、不做道德审判，常用于支持性沟通场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not making moral judgments about someone; accepting and fair in attitude, especially about personal choices or differences.","zh":"不带评判的；不对他人作道德评断的；（态度）包容且公平的，尤其面对个人选择或差异时。"},"examples":[{"en":"Our counselor is nonjudgmental, so people feel safe sharing personal problems.","zh":"我们的心理咨询师不带评判，所以大家愿意安心分享个人困扰。"},{"en":"Try to listen in a nonjudgmental way before giving advice.","zh":"在给建议之前，尽量用不带评判的方式去倾听。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing language, questions, or feedback that avoids blame or criticism and focuses on understanding and support.","zh":"（用于语言/提问/反馈）不指责、不苛责的；以理解与支持为重点的。"},"examples":[{"en":"Ask nonjudgmental questions like “What was that experience like for you?”","zh":"可以用不带评判的问题，比如“那段经历对你来说是什么感觉？”"},{"en":"Her nonjudgmental tone helped the discussion stay calm.","zh":"她不带评判的语气让讨论保持冷静。"}]}],"synonyms":["accepting","open-minded","tolerant","understanding","impartial","unbiased"],"phonetic":"/ˌnɑn.dʒʌdʒˈmɛn.təl/","extraExplanation":["这个词常用于心理咨询、教育、医疗与人际沟通场景，强调“先理解、后评价”，让对方感到安全与被尊重。","构词：non-（不、非）+ judgmental（爱评判的）。注意拼写通常写作 nonjudgmental（美式常见，也可见 non-judgemental 的英式拼法）。","常见搭配：a nonjudgmental attitude（不带评判的态度）、nonjudgmental listening（不带评判的倾听）、a nonjudgmental space（安全/包容的空间）。","语用提醒：nonjudgmental 并不等于“同意一切”或“没有界限”，更多是指在表达界限或建议时避免羞辱、贴标签与道德审判。"]}
{"word":"nonjudicable","summary":{"en":"Nonjusticiable means “not suitable for a court to decide.”","zh":"Nonjusticiable 指“不可由法院裁决/不适合司法审查的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not able to be decided by a court because the issue is not suitable for judicial review (often because it is a “political question” or outside the court’s role).","zh":"（法律）不可由法院裁决的；不适合司法审查的（常因属于“政治问题”或超出法院职权范围）。"},"examples":[{"en":"The judge dismissed the lawsuit as nonjusticiable.","zh":"法官以该案属于不可司法裁决为由驳回了诉讼。"},{"en":"The court said the dispute was nonjusticiable because it involved a political question.","zh":"法院表示该争议因涉及政治问题而不可司法裁决。"}]}],"synonyms":["not justiciable","not judicially reviewable","outside the court’s jurisdiction"],"phonetic":"/ˌnɑn.dʒʌsˈtɪʃ.i.ə.bəl/","extraExplanation":["你输入的 **nonjudicable** 很可能是拼写错误。法律英语里更常见、标准的写法是 **nonjusticiable**（不可司法裁决的）。有时也会看到较少见的变体 **nonjudiciable**，但在主流词典与判例写作中 **nonjusticiable** 更常用。","常见语境：美国法里经常与 *political question (doctrine)*（政治问题原则）一起出现，意思是某些争议不应由法院决定，而应由行政或立法部门处理。"]}
{"word":"nonjudicative","summary":{"en":"Nonjudicative describes something handled outside the courts, without a judge’s legal decision.","zh":"nonjudicative 指不通过法院/法官作出裁判的处理方式或程序。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving a judge or court decision-making; not related to judicial adjudication (often used for administrative or informal processes).","zh":"非司法裁决的；不涉及法官/法院作出裁判的（常用于行政或非正式处理程序）。"},"examples":[{"en":"The dispute was handled through a nonjudicative process like mediation.","zh":"这起纠纷通过非司法裁决程序（如调解）来处理。"},{"en":"Many complaints are resolved in a nonjudicative setting before they ever reach court.","zh":"许多投诉会先在非司法裁决的机制下解决，甚至不会进入法院。"},{"en":"The agency created a nonjudicative review system to handle minor violations quickly.","zh":"该机构建立了非司法裁决的审查机制，以便快速处理轻微违规。"}]}],"synonyms":["nonjudicial","administrative","extrajudicial","informal","nonadjudicative"],"phonetic":"/ˌnɑn.dʒuˈdɪk.ə.tɪv/","extraExplanation":["“nonjudicative”常见于法律与行政语境，强调“不是由法院/法官作出判决”的性质。它并不一定表示“不公平”或“不严肃”，而是指处理方式更偏向行政审查、协商、调解、仲裁、内部申诉或听证等（是否属于严格的“judicial”程序视制度而定）。","在美式英语中更常见的相关词是“nonjudicial”（非司法的）。如果你在写作中想用更常见、更容易被读者理解的表达，通常可用“nonjudicial process/proceeding”。"]}
{"word":"nonjudicatories","summary":{"en":"“Nonjudicatories” means non-court bodies—organizations that are not part of the judicial system.","zh":"“nonjudicatories”指非司法机关的机构/组织，即不属于法院体系的单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Organizations or bodies that are not courts or judicial tribunals (i.e., not responsible for judging legal disputes).","zh":"非司法机构；不属于法院或司法审判机关的组织/机构（即不负责裁决法律争议）。"},"examples":[{"en":"Labor disputes may be handled by nonjudicatories such as mediation boards before they ever reach a court.","zh":"劳资纠纷在进入法院之前，可能先由调解委员会等非司法机构处理。"},{"en":"The report distinguishes between judicatories and nonjudicatories to clarify who has legal decision-making power.","zh":"该报告区分了司法机关与非司法机构，以明确谁拥有法律裁决权。"}]}],"synonyms":["nonjudicial bodies","nonjudicial institutions","administrative bodies","non-court agencies"],"phonetic":"/ˌnɑnˈdʒuːdɪkəˌtɔriz/","extraExplanation":["这个词非常少见，通常出现在法律/政治学术写作中，用来和 judicatories（司法机关、法院体系）做对照。","构词上是 non-（“非、不是”）+ judicatory（“司法机关/审判机关”）的复数形式。更常见的表达往往是 “nonjudicial bodies/organizations”（非司法机构）或 “administrative bodies”（行政机构）。","注意：judicatory 既可以指“法院/审判机关”（名词），也可以作形容词表示“司法裁决的”。这里的 nonjudicatories 按名词复数理解最自然。"]}
{"word":"nonjudicatory","summary":{"en":"Nonjudicatory usually means “not involving courts or formal legal judging,” and it’s most common in legal/administrative contexts.","zh":"Nonjudicatory 通常指“非司法/非裁判程序的”，多见于法律或行政语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving a court or the formal process of judging legal rights; not judicial in nature.","zh":"不涉及法院或正式司法裁判程序的；非司法性质的。"},"examples":[{"en":"The agency handled the dispute through a nonjudicatory process, so no judge decided the case.","zh":"该机构通过非司法裁判程序处理争议，因此没有法官对案件作出裁决。"},{"en":"Many complaints are resolved in a nonjudicatory way, such as mediation or negotiation.","zh":"许多投诉会以非司法方式解决，例如调解或协商。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general) Not judgmental; avoiding making moral or personal judgments about others.","zh":"（更一般的用法）不带评判的；不对他人作道德或个人评断的。"},"examples":[{"en":"She tried to take a nonjudicatory tone when listening to her friend’s story.","zh":"她在听朋友讲述时尽量保持不带评判的语气。"}]}],"synonyms":["nonjudicial","nonadjudicatory","administrative (in some contexts)"],"phonetic":"/ˌnɑnˈdʒuːdɪkəˌtɔri/","extraExplanation":["这个词更常见于法律/行政语境，强调“不是由法院或类似法庭的裁决程序来处理”。在日常英语里，如果你想表达“非司法的”，更常用的是 **nonjudicial**；如果想表达“非裁决性的程序”，也常见 **nonadjudicatory** 或 **non-adjudicative**。","构词上：**non-**（不、非）+ **judicatory**（与裁判/司法裁决有关）。因此它的核心含义是“非裁判性的/非司法裁决的”。","如果你本来想表达“对人不做评价、不批判”，日常更自然的说法通常是 **nonjudgmental**（美式拼写）。"]}
{"word":"nonjudiciable","summary":{"en":"Nonjudiciable means a matter cannot be decided by a court because it is outside judicial review (often a political question).","zh":"Nonjudiciable 指某个事项不在司法裁决/司法审查范围内（常见原因是属于政治问题或超出法院权限）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be decided by a court (because the issue is outside the court’s legal authority, is a “political question,” or is otherwise not suitable for judicial review).","zh":"不可由法院裁决的；不属于司法审查范围的（通常因为该问题超出法院权限、属于“政治问题”，或不适合由法院进行司法判断）。"},"examples":[{"en":"The judge ruled that the dispute was nonjudiciable because it raised a political question.","zh":"法官裁定该争议属于不可由法院裁决的事项，因为它涉及政治问题。"},{"en":"Some constitutional claims are dismissed as nonjudiciable when there is no clear legal standard for the court to apply.","zh":"当缺乏明确的法律判断标准时，一些宪法主张会被以“不可由法院裁决”为由驳回。"}]}],"synonyms":["not justiciable","not subject to judicial review","outside the court’s jurisdiction"],"phonetic":"/ˌnɑn.dʒuˈdɪʃ.ə.bəl/","extraExplanation":["这是一个法律术语，常见于宪法诉讼与行政法语境。法院可能会认为某些问题应由立法机关或行政机关处理，而不是由司法机关介入，因此认定为 nonjudiciable。","常与 judiciable（可由法院审理/裁决的）形成对比。也常见搭配：nonjudiciable issue / claim / question（不可司法裁决的问题/主张/争点）。"]}
{"word":"nonjudicial","summary":{"en":"Nonjudicial means “outside the court system; not handled by a judge,” often used for legal or administrative processes.","zh":"nonjudicial 指“非司法的、在法院体系之外处理的”，常用于法律或行政程序语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not decided by a court or judge; handled outside the court system (for example, by an agency, a contract process, or an agreement between parties).","zh":"非司法的；不由法院或法官裁决的；在法院体系之外处理的（例如由行政机关、合同程序或当事人协商解决）。"},"examples":[{"en":"The dispute was resolved through nonjudicial mediation instead of a lawsuit.","zh":"这起纠纷通过非司法调解解决，而不是提起诉讼。"},{"en":"Some complaints can be handled through a nonjudicial process within the agency.","zh":"有些投诉可以在该机构内部通过非司法程序处理。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Law, especially U.S.) Relating to a legal action carried out without court involvement, such as a nonjudicial foreclosure conducted under a “power of sale” clause.","zh":"（法律，尤指美国）指不经法院介入而进行的法律处置，例如依据“出售权（power of sale）”条款进行的非司法止赎。"},"examples":[{"en":"In some states, lenders may use nonjudicial foreclosure if the mortgage or deed of trust allows it.","zh":"在一些州，如果抵押合同或信托契据允许，贷款方可以采用非司法止赎。"},{"en":"Nonjudicial foreclosure timelines can be shorter than judicial ones, but the rules vary by state.","zh":"非司法止赎的流程时间可能比司法止赎更短，但各州规定不同。"}]}],"synonyms":["out-of-court","extrajudicial","administrative"],"phonetic":"/ˌnɑn.dʒuˈdɪʃ.əl/","extraExplanation":["构词理解：non- 表示“非/不”，judicial 表示“司法的、法院的”，合起来就是“非司法的、法院之外的”。","用法提示：nonjudicial 常见于法律与政府行政语境（如 nonjudicial settlement、nonjudicial punishment、nonjudicial foreclosure）。日常对话里更常用 out of court（庭外的）或 without going to court（不通过法院）。","拼写与变体：也常见写作 non-judicial（加连字符），含义相同。"]}
{"word":"nonjudicially","summary":{"en":"Nonjudicially means “without going through a court or judge,” especially in legal procedures like foreclosure or dispute resolution.","zh":"Nonjudicially 指“无需经过法院或法官介入地”，常用于止赎、争议解决等法律程序语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not involve a court or a judge; done by a private process or administrative/legal procedure outside the courtroom.","zh":"以不经法院或法官介入的方式；通过私下程序或行政/法律程序在法庭之外完成。"},"examples":[{"en":"In some states, a lender may foreclose on a home nonjudicially if the mortgage documents allow it.","zh":"在一些州，如果抵押文件允许，贷款方可能可以通过非司法程序进行房屋止赎。"},{"en":"The dispute was resolved nonjudicially through mediation rather than a lawsuit.","zh":"该争议通过调解而非诉讼，以非司法方式得到解决。"}]}],"synonyms":["out of court","without judicial involvement","administratively","privately"],"phonetic":"/ˌnɑn.dʒuˈdɪʃ.əl.i/","extraExplanation":["这个词主要出现在法律语境，尤其常见于“nonjudicial foreclosure（非司法止赎）”。一般意思不是“违法”或“随便处理”，而是“程序上不走法院判决/法官审理那条路”。","构词法：non-（不/非）+ judicial（司法的）+ -ly（副词后缀）。因此它描述“以非司法的方式”。","近义表达常见有：without judicial involvement（无司法介入）、out of court（在法院之外）、extrajudicially（在司法程序之外地；但该词有时也带更强的“法外/越出司法程序”的语感，语境需谨慎）。"]}
{"word":"nonjurable","summary":{"en":"Nonjurable (rare) means legally unable to be sworn in or to take a valid oath, especially as a witness.","zh":"nonjurable（罕见）指依法不能被宣誓或不能作有效宣誓，尤指不能宣誓作证。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(law) Not able to take a legally valid oath; disqualified from being sworn in (for example, as a witness).","zh":"（法律）不能进行具有法律效力的宣誓；依法不能被宣誓就职/宣誓作证（例如作为证人）。"},"examples":[{"en":"Because of questions about his competence, the judge ruled him nonjurable as a witness.","zh":"由于对其行为能力存疑，法官裁定他不能作为证人宣誓作证。"},{"en":"The defense argued that the statement should be excluded because the person was nonjurable.","zh":"辩方主张该陈述应被排除，因为陈述人依法不能宣誓。"}]}],"synonyms":["unsworn","ineligible (to be sworn)","disqualified (as a witness)"],"phonetic":"/nɑnˈdʒʊrəbəl/","extraExplanation":["“nonjurable”非常少见，主要见于较旧或较专业的法律语境，意思接近“不能被宣誓（作证/就职）”。现代英语里更常见的相关词是“competent/incompetent (to testify)”（有/无作证资格）、“unsworn testimony”（未宣誓证词）。","词形可拆为 non-（不）+ jurable（可宣誓的），jurable 源自拉丁语 jurare（宣誓）。因此它强调的是“宣誓行为在法律上不成立/不被允许”，而不只是“拒绝宣誓”。","容易和“nonjuring”混淆：nonjuring 指“拒绝宣誓效忠”（历史上英国的‘Nonjurors’），强调的是政治/宗教立场上的拒绝；nonjurable 则更偏“法律资格/可否宣誓”的问题。"]}
{"word":"nonjurancy","summary":{"en":"Nonjurancy means the state or practice of refusing to take a required oath, especially an oath of allegiance (often used in historical contexts).","zh":"Nonjurancy 指“拒绝宣誓”的状态或做法，尤指拒绝宣誓效忠等法定誓言（多见于历史语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being a nonjuror; refusal (often for religious or political reasons) to swear a required oath, especially an oath of allegiance","zh":"拒绝宣誓（尤指因宗教或政治原因拒绝宣誓效忠等法定誓言）的状态；不宣誓主义"},"examples":[{"en":"After the political change, his nonjurancy kept him out of public office.","zh":"政局更迭后，他因拒绝宣誓效忠而无法担任公职。"},{"en":"The book explains nonjurancy among certain clergy after a change of monarch.","zh":"这本书解释了君主更替后部分神职人员的拒绝宣誓现象。"}]}],"synonyms":["refusal to swear an oath","nonjuring","oath refusal"],"phonetic":"ˌnɑnˈdʒʊrənsɪ","extraExplanation":["“nonjurancy”是一个较少见、偏历史语境的词，常与英国“光荣革命”（1688–1689）后部分英格兰与苏格兰教会神职人员拒绝向威廉三世与玛丽二世宣誓效忠的事件相关，这些人常被称为“Nonjurors”，其立场与原则可称为“nonjuring principles”。","词形上：non-（不）+ jur-（来自拉丁语 jurare“宣誓”）+ -ancy（表示状态）。学习时可以顺带记：nonjuror（拒绝宣誓者）、nonjuring（拒绝宣誓的/不宣誓的）。"]}
{"word":"nonjurant","summary":{"en":"Nonjurant is a rare historical word meaning “refusing to take a required oath,” or a person who refuses such an oath (often an oath of allegiance).","zh":"Nonjurant 是较少见的历史用语，指“拒绝宣誓（尤其是拒绝宣誓效忠）”的（人或立场）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(historical) Refusing to take a required oath (especially an oath of allegiance); relating to people who refused such oaths.","zh":"（历史用语）拒绝宣誓（尤其是拒绝宣誓效忠）；与拒绝宣誓者有关的。"},"examples":[{"en":"Some clergy were removed from office for holding nonjurant views after the change of monarch.","zh":"一些神职人员因在王位更迭后持有“拒绝宣誓效忠”的立场而被免职。"},{"en":"The book discusses nonjurant clergy and the political tensions of the time.","zh":"这本书讨论了拒绝宣誓效忠的神职人员以及当时的政治紧张局势。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) A person who refuses to take a required oath (especially an oath of allegiance).","zh":"（历史用语）拒绝宣誓（尤其是拒绝宣誓效忠）的人。"},"examples":[{"en":"In that period, a nonjurant could be seen as loyal to the former ruler.","zh":"在那个时期，拒绝宣誓者可能被视为仍效忠于前任君主。"},{"en":"The nonjurants formed a small but influential group in church history.","zh":"拒绝宣誓者在教会史上形成了一个规模不大但颇具影响力的群体。"}]}],"synonyms":["nonjuring","nonjuror"],"phonetic":"nɑnˈdʒʊrənt","extraExplanation":["这个词比较罕见，多见于英国宗教与政治史的语境。它常与 **Nonjurors / nonjuring**（拒绝向新君主宣誓效忠的人，尤其是1688–1689年“光荣革命”后的一些英国国教与苏格兰主教制教会神职人员）相关。","词源上可理解为 **non-（不） + jur-（宣誓，源自拉丁语 jurare）**，字面意思就是“未宣誓/不宣誓的人（或其立场）”。","学习时注意不要和 **nonjury**（无陪审团的）混淆：nonjury 是法律程序用词；nonjurant 更偏历史政治/宗教用词。"]}
{"word":"nonjurantism","summary":{"en":"Nonjurantism is a rare noun meaning the beliefs or movement of people who refused to take required oaths (especially political oaths of allegiance).","zh":"Nonjurantism 是一个罕见名词，指拒绝宣誓者（尤其拒绝政治效忠誓言者）的立场、思想或运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) The beliefs, principles, or movement of nonjurants (nonjurors)—people who refuse to swear a required oath, especially an oath of allegiance.","zh":"（罕见）“拒绝宣誓者”（nonjurant / nonjuror）的思想、原则或运动；指拒绝宣誓（尤指效忠宣誓）的一群人或其立场。"},"examples":[{"en":"Some historians discuss nonjurantism after the Glorious Revolution of 1688–1689, when certain clergy refused to swear allegiance to William and Mary.","zh":"一些历史学者会谈到1688–1689年“光荣革命”后的nonjurantism：当时部分神职人员拒绝向威廉与玛丽宣誓效忠。"},{"en":"His sympathy for nonjurantism shaped his view of political legitimacy and religious duty.","zh":"他对nonjurantism的同情影响了他对政治合法性与宗教义务的看法。"}]}],"synonyms":["nonjurorism","nonjurancy","nonjuring"],"phonetic":"/ˌnɑnˈdʒʊrəntɪzəm/","extraExplanation":["这个词非常少见，实际阅读中你更可能遇到 **nonjuror**（拒绝宣誓者）、**nonjurant**（拒绝宣誓的；拒绝宣誓者）或 **nonjuring**（拒绝宣誓的）等形式。","历史语境最常见的是英国教会史：1688–1689年“光荣革命”后，一些英格兰与苏格兰的教会人士拒绝向新君主威廉三世与玛丽二世宣誓效忠，因此被称为 nonjurors。","词根来自拉丁语 *jurare*（宣誓）。前缀 **non-** 表示“否定/不”。因此整体概念就是“拒绝宣誓（效忠誓言）”。"]}
{"word":"nonjuress","summary":{"en":"Nonjuror means a person who refuses to take a required oath, especially an oath of allegiance; it’s also a specific historical term for clergy who refused the oath to William and Mary after 1688.","zh":"Nonjuror 指拒绝宣誓（尤其是拒绝宣誓效忠）的人；在英国历史中也特指1688年后拒绝向威廉与玛丽宣誓的神职人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who refuses to take a required oath (especially an oath of loyalty or allegiance to a ruler or government)","zh":"拒绝宣誓（尤其是拒绝宣誓效忠君主或政府）的人"},"examples":[{"en":"Some officials were dismissed because they became nonjurors and would not swear the oath of allegiance.","zh":"一些官员因为成为“拒誓者”（nonjurors），不愿宣誓效忠而被免职。"},{"en":"The term nonjuror is most often used in British history rather than in modern American politics.","zh":"“nonjuror”这个词更多出现在英国历史语境中，而不是现代美国政治中。"}]},{"partOfSpeech":"n.","definition":{"en":"(British history) a Church of England or Scottish cleric who refused to swear allegiance to William and Mary (after the 1688 Revolution)","zh":"（英国历史）1688年“光荣革命”后，拒绝向威廉与玛丽宣誓效忠的英格兰教会或苏格兰教会神职人员"},"examples":[{"en":"After 1688, some clergy became known as Nonjurors for refusing the new oath.","zh":"1688年之后，一些神职人员因拒绝新誓言而被称为“Nonjurors（拒誓派）”。"}]}],"synonyms":["oath-refuser","dissenter","objector"],"phonetic":"/nɑnˈdʒʊrɚ/","extraExplanation":["你输入的 **nonjuress** 不是常见标准拼写；你很可能想查的是 **nonjuror**（单数）或 **nonjurors**（复数）。","词根来自 *jur-*（与“宣誓/法律上的誓言”有关，如 *jury, perjury*）。前缀 *non-* 表示“否定/不”。因此 *nonjuror* 字面意思就是“拒绝宣誓的人”。","在历史用法里，它常与 1688 年英国“光荣革命”后的政治与宗教誓言相关：部分神职人员认为自己已对前君主宣过誓，因此拒绝再对新君主宣誓。"]}
{"word":"nonjuridic","summary":{"en":"Nonjuridic means not legal or not related to courts or law.","zh":"nonjuridic 指“非司法的、非法律性质的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to law, courts, or legal authority; not legal in nature.","zh":"非司法的；与法律、法院或法律权威无关的；不具法律性质的。"},"examples":[{"en":"The committee made a nonjuridic recommendation, so it did not have legal force.","zh":"该委员会提出的是非司法性建议，因此不具法律效力。"},{"en":"They tried to resolve the dispute through nonjuridic methods like mediation.","zh":"他们试图通过调解等非司法方式解决争议。"}]}],"synonyms":["nonlegal","nonjuridical","extra-legal","nonjudicial"],"phonetic":"/ˌnɑn dʒʊˈrɪdɪk/","extraExplanation":["“nonjuridic”较少见，更常见的写法与用词是“nonjuridical”或“non-legal”。在学术/正式写作中，如果你希望读者一眼看懂，通常优先用“nonjuridical”或“non-legal”。","词根提示：juridic 来自拉丁语词根（与 law/right judgment 相关），因此 nonjuridic 强调“脱离法律体系/不由法院裁决”的性质，常用于对比 juridic（司法/法律层面）与 social/political/ethical（社会/政治/伦理层面）。"]}
{"word":"nonjuridical","summary":{"en":"Nonjuridical means “not judicial or legal in nature,” often describing actions or explanations outside courts or formal legal judgment.","zh":"nonjuridical 指“非司法的、非法律裁判性质的”，常用于描述不在法院或正式司法裁判范围内的做法或说明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not related to law, courts, or formal legal judgment; outside the legal/judicial system","zh":"非司法的；不涉及法律、法院或正式法律裁判的；在司法体系之外的"},"examples":[{"en":"The dispute was settled through nonjuridical mediation rather than a lawsuit.","zh":"这场纠纷是通过非司法调解解决的，而不是打官司。"},{"en":"She offered a nonjuridical explanation focused on ethics, not legal rules.","zh":"她给出的解释是非司法层面的，强调伦理而不是法律规则。"},{"en":"The committee’s role is nonjuridical, so it cannot issue binding legal decisions.","zh":"该委员会的职能是非司法性的，因此不能作出具有法律约束力的裁决。"}]}],"synonyms":["nonjudicial","nonlegal","extra-legal","administrative (in some contexts)","informal"],"phonetic":"/ˌnɑn.dʒəˈrɪdɪkəl/","extraExplanation":["nonjuridical 比较正式、学术化，日常英语里更常见的是 nonlegal（非法律的）或 extralegal（法律之外的）。","注意区分：nonjuridical 强调“与司法裁判/法院系统无关”；extrajudicial（法外的/司法程序之外的）常用在更敏感的语境里，比如“法外处置”。","构词：non-（不）+ juridical（司法的/法律裁判的）。juridical 通常比 legal 更偏“法院裁判、司法权限”的感觉。"]}
{"word":"nonjuridically","summary":{"en":"“Nonjuridically” means “not in a legal/court-based way,” often describing settling issues outside formal legal judgment.","zh":"“nonjuridically”表示“以非司法/不依赖法院裁决的方式”，常用于描述在正式法律程序之外处理问题。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not juridical (not related to courts, legal rules, or formal legal judgment).","zh":"以非司法（不涉及法院、法律规则或正式法律裁决）的方式。"},"examples":[{"en":"The conflict was resolved nonjuridically through mediation and community agreement.","zh":"这场冲突通过调解和社区协议以非司法方式解决。"},{"en":"They handled the dispute nonjuridically to avoid a long court process.","zh":"他们以非司法方式处理争端，以避免漫长的诉讼程序。"}]},{"partOfSpeech":"adv.","definition":{"en":"From a perspective that is not legal or court-based (e.g., social, moral, political, or practical rather than legal).","zh":"从非法律/非法院的角度（例如从社会、道德、政治或实际层面，而非法律层面）。"},"examples":[{"en":"The issue can be understood nonjuridically as a problem of ethics and trust.","zh":"这个问题可以从非司法角度理解为道德与信任的问题。"}]}],"synonyms":["non-judicially","outside of court","extra-legally","informally (in some contexts)"],"phonetic":"/ˌnɑn.dʒəˈrɪd.ɪ.kəl.i/","extraExplanation":["这个词非常少见，更多见到的是 non-judicial（更常用、更自然）或 extrajudicial（法律外的、未经司法程序的）。写作时如果你只是想表达“不开庭/不走诉讼程序”，通常用 non-judicial / out of court / through mediation 会更地道。","构词：non-（不）+ juridical（司法的/法律裁判相关的）+ -ly（副词）。juridical 常用于学术或法律写作（如 juridical authority, juridical act）。"]}
{"word":"nonjuries","summary":{"en":"Nonjuries = trials/cases decided by a judge, not a jury.","zh":"nonjuries 指由法官而非陪审团裁决的审判/案件（nonjury 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **nonjury**: legal cases or trials that are decided by a judge (not by a jury).","zh":"**nonjury** 的复数：指由法官裁决、而不是由陪审团裁决的案件或审判。"},"examples":[{"en":"The court scheduled two **nonjuries** for next week, so the judge will decide both outcomes.","zh":"法院把两起 **nonjuries** 排在下周审理，因此将由法官作出裁决。"},{"en":"Many contract disputes are handled as **nonjuries** in some courts.","zh":"在一些法院，许多合同纠纷会以 **nonjuries**（无陪审团审理）方式处理。"}]}],"synonyms":["bench trials","judge-only trials","trials without a jury"],"phonetic":"/ˌnɑnˈdʒʊri/","extraExplanation":["“nonjury”更常见的用法是作形容词（nonjury trial = 无陪审团审判），意思接近常说的“bench trial”（法官独审）。","拼写上有时会写成 non-jury（加连字符），含义不变。","“nonjuries”作为名词复数在日常英语里不算常见；多数情况下人们会直接说 “nonjury trials / bench trials”。"]}
{"word":"nonjuring","summary":{"en":"Nonjuring means refusing to take an official oath (often an oath of allegiance), and it can also refer to a person who refuses such an oath, especially in British history.","zh":"nonjuring 指“拒绝宣誓（常指效忠宣誓）”，也可指“拒绝宣誓的人”，尤其常见于英国历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"refusing to take a required oath (especially an oath of allegiance to a government or ruler).","zh":"拒绝宣誓（尤指拒绝向政府或君主宣誓效忠）的。"},"examples":[{"en":"After the political change, a few priests were dismissed for taking a nonjuring position.","zh":"政权更迭后，一些神职人员因采取拒绝宣誓的立场而被免职。"},{"en":"The novel mentions a nonjuring clergyman who would not swear loyalty to the new monarch.","zh":"小说提到一位拒绝宣誓的牧师，他不愿向新君主宣誓效忠。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who refuses to take such an oath (especially in British history).","zh":"拒绝宣誓者（尤指英国历史上拒绝效忠宣誓的人）。"},"examples":[{"en":"Some nonjurings continued to hold services outside the official church structure.","zh":"一些拒绝宣誓者继续在官方教会体系之外举行礼拜。"}]}],"synonyms":["refusing to swear","unsworn","disloyal (context-dependent)","noncompliant (context-dependent)"],"phonetic":"/nɑnˈdʒʊrɪŋ/","extraExplanation":["“Nonjuring”来自“non-”（不）+“jure”（宣誓，源自拉丁语 iūrāre）。历史上最常见的用法与英国1688年的“光荣革命”有关：当威廉三世与玛丽二世即位后，部分圣公会神职人员与官员拒绝宣誓效忠新君主，被称为“Nonjurors”（拒誓派/拒绝宣誓者）。","在文学或历史写作里，这个词常带有强烈的时代与立场色彩：强调“出于良心或政治原则而拒绝宣誓”，并不只是一般意义上的“没签字/没宣誓”。"]}
{"word":"nonjurist","summary":{"en":"Nonjurist means someone without legal training, or materials written for general readers rather than legal professionals.","zh":"Nonjurist 指非法律专业人士，也可指面向普通读者而非法律人士的内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not legally trained (not a lawyer, judge, or legal scholar).","zh":"非法律专业人士；不受法律训练的人（不是律师、法官或法律学者）。"},"examples":[{"en":"The report is written in plain language for nonjurists.","zh":"这份报告用通俗语言撰写，面向非法律专业人士。"},{"en":"A nonjurist may misunderstand the difference between a law and a policy.","zh":"非法律专业人士可能会误解“法律”和“政策”的区别。"}]},{"partOfSpeech":"adj.","definition":{"en":"not intended for legal professionals; aimed at general readers rather than lawyers.","zh":"非法律专业的；面向普通读者而非法律人士的。"},"examples":[{"en":"This is a nonjurist summary of the court’s decision.","zh":"这是对法院判决的非法律专业人士版摘要。"},{"en":"The guide includes nonjurist explanations of common legal terms.","zh":"这本指南包含对常见法律术语的非法律专业解释。"}]}],"synonyms":["layperson","non-lawyer","lay reader","general reader"],"phonetic":"/nɑnˈdʒʊrɪst/","extraExplanation":["“nonjurist”常见于法律写作或学术文章中，用来区分“法律圈内人士（jurists）”与“普通读者”。它比“non-lawyer”更正式，也更强调“缺乏法律训练/法学背景”。","用法提示：作形容词时常搭配 summary / explanation / audience（如 nonjurist audience = 非法律专业受众）。作名词时多指“外行人”，语气通常中性。"]}
{"word":"nonjuristic","summary":{"en":"“Nonjuristic” means “not legal or not related to legal reasoning.”","zh":"“nonjuristic”意为“非法律的；不涉及法律推理的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to law, legal practice, or legal reasoning; non-legal.","zh":"非法律的；不涉及法律实践或法律推理的。"},"examples":[{"en":"The committee’s role is nonjuristic, focusing on community support rather than legal decisions.","zh":"该委员会的职责是非法律的，重点在社区支持，而不是作出法律裁决。"},{"en":"We need a nonjuristic explanation of the policy so everyone can understand it.","zh":"我们需要对该政策做一个非法律性的解释，让大家都能理解。"}]}],"synonyms":["nonlegal","non-legal","extralegal","nonjudicial"],"phonetic":"/ˌnɑn.dʒəˈrɪs.tɪk/","extraExplanation":["“Nonjuristic”由前缀 non-（不、非）+ juristic（法律的、法学的）构成。它在日常英语中不常见，更常见的表达是 nonlegal / non-legal 或 not legally binding（不具法律约束力的）。","使用提示：nonjuristic 通常用来强调“讨论/观点/理由并非来自法律体系或法律推理”，常见搭配如 nonjuristic perspective（非法律视角）、nonjuristic arguments（非法律论证）。"]}
{"word":"nonjuristical","summary":{"en":"Nonjuristical (rare) means “not related to law or courts.” In most modern writing, nonjuridical/nonjuristic/nonlegal is more common.","zh":"nonjuristical（罕见）意为“非法律/非司法的”。现代写作更常用 nonjuridical、nonjuristic 或 nonlegal。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to law, courts, or legal reasoning; nonlegal.","zh":"（较少用）非法律的；与法律、法院或法律推理无关的。"},"examples":[{"en":"They reached a nonjuristical agreement through mediation instead of going to court.","zh":"他们通过调解达成了一个非诉讼（非法律程序）的协议，而不是上法庭。"},{"en":"The committee’s role is advisory and nonjuristical.","zh":"该委员会的角色是咨询性的，不涉及法律裁决。"}]}],"synonyms":["nonlegal","nonjudicial","nonjuridical","nonjuristic","extralegal"],"phonetic":"/ˌnɑn.dʒʊˈrɪs.tɪ.kəl/","extraExplanation":["“nonjuristical”非常少见，更多见、也更自然的写法通常是 **nonjuridical**（不具法律性质的）或 **nonjuristic**（不从法律/法学角度的）。写作时若不是在特定法律语境里，常用 **nonlegal**（非法律的）或 **nonjudicial**（非司法的）更清楚。","构词上：**non-**（不、非）+ **juristic/juridical**（法律的、司法的）。它通常用来强调某事的处理方式、讨论角度或决定依据“不是法律层面”。","易混词提示：**non-justiciable** 指“不可由法院裁决/不具可诉性”，含义更专门，不等同于“非法律的”。"]}
{"word":"nonjuristically","summary":{"en":"Nonjuristically means “from a non-legal point of view; not using legal reasoning.”","zh":"nonjuristically 的意思是“从非法律角度；不以法律推理为依据”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not based on law, legal rules, or legal reasoning; from a non-legal perspective","zh":"以非法律的方式；不依据法律规则或法律推理；从非法律角度来看"},"examples":[{"en":"Nonjuristically, the decision seemed unfair, even though it followed the rules of the court.","zh":"从非法律角度看，这个决定似乎不公平，尽管它符合法院的规则。"},{"en":"We can discuss the issue nonjuristically—as a moral question rather than a legal one.","zh":"我们可以从非法律角度来讨论这个问题——把它当作道德问题，而不是法律问题。"},{"en":"She explained the policy nonjuristically so that everyone could understand it.","zh":"她用非法律化的方式解释这项政策，让所有人都能听懂。"}]}],"synonyms":["from a non-legal perspective","in non-legal terms","outside the law (context-dependent)","morally rather than legally (context-dependent)"],"phonetic":"/ˌnɑn dʒəˈrɪstɪkli/","extraExplanation":["“nonjuristically”非常少见，更多时候英语会用更自然的说法替代，比如：“from a non-legal perspective / in non-legal terms / legally vs. morally”。","词形结构：non-（不、非）+ juristic（法律的、法学的）+ -ally（构成副词）。意思通常是在对比“法律上的判断”和“道德/常识/情感上的判断”。","“juristic / jurisprudential”都与法学、法律推理有关；日常写作里，“legal”更常用，“juristic”更偏学术或正式语体。"]}
{"word":"nonjuror","summary":{"en":"A nonjuror is someone who refuses to take an official oath, especially an oath of loyalty.","zh":"nonjuror 指拒绝进行官方宣誓的人，尤指拒绝宣誓效忠者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who refuses to take a required oath (especially an oath of loyalty or allegiance), often for religious or political reasons.","zh":"拒绝宣誓者（尤指拒绝宣誓效忠或忠诚誓言的人），常出于宗教或政治原因。"},"examples":[{"en":"After the new ruler demanded an oath of allegiance, several clergy became nonjurors and lost their positions.","zh":"新统治者要求宣誓效忠后，一些神职人员成为拒绝宣誓者，并失去了职位。"},{"en":"The historian described the nonjurors as people who chose conscience over career.","zh":"历史学家把这些拒绝宣誓者描述为宁愿遵从良知、也不追求仕途的人。"}]}],"synonyms":["refuser (of an oath)","conscientious objector (in a broad sense)"],"phonetic":"/nɑnˈdʒʊrər/","extraExplanation":["这个词最常见于英国历史语境：1688年“光荣革命”后，有一批圣公会神职人员和官员拒绝向新君主威廉三世与玛丽二世宣誓效忠，因此被称为 nonjurors（“不宣誓者”）。","词源上，jur- 来自拉丁语 iurare（宣誓），non- 表示否定；字面意思就是“非宣誓的人”。","在现代日常英语中很少使用，更多出现在历史、宗教史或政治史的写作里。"]}
{"word":"nonjurorism","summary":{"en":"Nonjurorism is a historical term for the beliefs and practices of the Nonjurors, especially clergy who refused to swear allegiance after Britain’s Glorious Revolution; more broadly, it can mean refusing a required oath.","zh":"Nonjurorism 是历史术语，指“拒誓派”（尤指光荣革命后拒绝宣誓效忠的新政权的神职人员）的思想与实践；广义也可指拒绝进行被要求的宣誓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the beliefs, principles, or practices of the Nonjurors—especially the Church of England (and Scottish Episcopal) clergy who refused to swear the oath of allegiance to William III and Mary II after the Glorious Revolution (1688–89).","zh":"“拒誓派”（Nonjurors）的信念、原则或做法——尤指英格兰教会（及苏格兰圣公会）中在1688–89年“光荣革命”后拒绝向威廉三世与玛丽二世宣誓效忠的神职人员所持的立场与实践。"},"examples":[{"en":"Her thesis examines nonjurorism and its influence on Anglican worship in the early 1700s.","zh":"她的论文研究拒誓派思想（nonjurorism）及其对18世纪初圣公会礼拜的影响。"},{"en":"Nonjurorism was not just politics; it also shaped church identity and authority.","zh":"拒誓派思想不只是政治立场；它也塑造了教会的身份与权威观。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, the stance or practice of refusing to take a required oath (especially an oath of allegiance).","zh":"更广义地指：拒绝宣誓（尤其是拒绝宣誓效忠）的立场或做法。"},"examples":[{"en":"In that period, nonjurorism could cost someone a public position.","zh":"在那个时期，拒誓立场（nonjurorism）可能会让人失去公职。"}]}],"synonyms":["nonjuring","the nonjuring movement","the Nonjuring schism","refusal to take the oath"],"phonetic":"/ˌnɑnˈdʒʊrərˌɪzəm/","extraExplanation":["non-（否定）+ juror（宣誓者；源自拉丁语 iurare/jurare“宣誓”）+ -ism（主义/思潮），字面意思就是“拒绝宣誓的主义/立场”。","在英国语境里，Nonjurors 指1688–89年“光荣革命”后，因认为新君主是“篡位者”或认为自己已对詹姆斯二世宣誓而拒绝再宣誓的一批教会人士；nonjurorism 就是与这一群体相关的思想与行动传统。","【使用提示rorism 是偏学术/历史写作的词，日常英语几乎不用；一般文章更常直接写 the Nonjurors / the nonjuring movement / the Nonjuring schism。"]}
{"word":"nonjurors","summary":{"en":"Nonjurors are people who refused a required oath of allegiance, especially in Britain after 1689.","zh":"Nonjurors 指拒绝宣誓效忠的人，尤指英国1689年前后拒绝向新君主宣誓的群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (especially clergy or officials in Britain) who refused to take a required oath of allegiance—most famously the oath to William III and Mary II after the Glorious Revolution (1688–1689).","zh":"（尤指英国的神职人员或官员）拒绝宣誓效忠的人；最著名的是1688–1689年“光荣革命”后拒绝向威廉三世与玛丽二世宣誓效忠的一群人。"},"examples":[{"en":"After 1689, some bishops became nonjurors and lost their official positions.","zh":"1689年之后，一些主教成为“拒誓者”（nonjurors），并失去了他们的公职。"},{"en":"The history book explains why the nonjurors believed taking the oath would betray their principles.","zh":"这本历史书解释了为什么这些拒誓者认为宣誓会背叛他们的原则。"}]}],"synonyms":["oath-refusers","refusers of allegiance (formal)","dissenters (broader, not exact)"],"phonetic":"/nɑnˈdʒʊrərz/","extraExplanation":["“nonjuror”来自拉丁语 jurare（宣誓），“non-”表示否定，因此字面意思是“不给誓言的人”。","该词常与英国历史中的“光荣革命”相关：当时许多教会人士与官员被要求向新的君主宣誓效忠；拒绝者往往被撤职或边缘化。","在文学与历史写作中，“nonjuror”常用来讨论忠诚、合法性（legitimacy）与良心/原则之间的冲突。"]}
{"word":"nonjury","summary":{"en":"“Nonjury” means ‘without a jury,’ usually describing a trial decided by a judge.","zh":"“nonjury”表示“无陪审团的”，通常指由法官裁决的审判。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving no jury; decided by a judge rather than by a jury (often describing a trial).","zh":"无陪审团的；由法官而非陪审团作出裁决的（常用于描述审判）。"},"examples":[{"en":"The case was heard as a nonjury trial, so the judge decided the verdict.","zh":"该案以无陪审团审判方式审理，因此由法官作出裁决。"},{"en":"They requested a nonjury hearing to speed up the process.","zh":"他们申请无陪审团听证，以加快流程。"}]},{"partOfSpeech":"n.","definition":{"en":"A nonjury trial or proceeding.","zh":"无陪审团审判（或无陪审团程序）。"},"examples":[{"en":"The contract dispute went to a nonjury.","zh":"这起合同纠纷进入了无陪审团审判程序。"}]}],"synonyms":["bench (as in bench trial)","judge-tried","without a jury"],"phonetic":"/ˌnɑnˈdʒʊri/","extraExplanation":["“nonjury”是法律英语里较正式的用法，最常见搭配是“nonjury trial”（无陪审团审判），含义接近“bench trial”（法官独任审判）。","在美国语境中，是否由陪审团审理由法律与当事人选择等因素决定；在一些民事案件中，当事人可能会“waive a jury trial”（放弃陪审团审判），从而变成nonjury/bench trial。"]}
{"word":"nonjurying","summary":{"en":"Nonjurying is a rare spelling of nonjuring, meaning “refusing to swear an oath of allegiance,” especially in British historical contexts.","zh":"nonjurying 是非主流拼写，通常等同于 nonjuring，意为“拒绝宣誓效忠”，多见于英国历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Alternative spelling of **nonjuring**: refusing to swear a required oath of allegiance.","zh":"（罕见/古语）**nonjuring** 的另一种拼写：拒绝宣誓效忠（拒绝宣誓规定的誓言）。"},"examples":[{"en":"A few clergy were described as nonjurying, refusing the new oath of allegiance.","zh":"一些神职人员被描述为 nonjurying，拒绝宣誓新的效忠誓言。"},{"en":"In the period after 1689, nonjurying ministers sometimes lost their official positions.","zh":"在 1689 年之后的时期，nonjurying 的牧师有时会失去其官方职位。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Historical, especially Britain) Referring to the **Nonjurors**, a group (notably some Church of England clergy) who refused to swear allegiance to William and Mary and later successors.","zh":"（历史用法，尤指英国）指 **Nonjurors（不宣誓派）**：一群人（尤其是部分英国国教神职人员）拒绝向威廉和玛丽及其后继者宣誓效忠。"},"examples":[{"en":"The book traces the nonjurying movement within the Church after the Glorious Revolution.","zh":"这本书追溯了“光荣革命”后教会内部的 nonjurying（不宣誓）运动。"},{"en":"Nonjurying writers defended their stance as a matter of conscience.","zh":"nonjurying 的作者们将自己的立场辩护为出于良知。"}]}],"synonyms":["nonjuring","oath-refusing","refusing to swear allegiance"],"phonetic":"/ˌnɑnˈdʒʊrɪŋ/","extraExplanation":["“nonjurying”在现代英语里非常少见；更标准、更常见的拼写是 **nonjuring**。","它和法律英语里的 **nonjury / non-jury**（“不由陪审团审理的”）很容易混淆；两者词形相近，但含义不同：nonjuring 讲“拒绝宣誓效忠”，non-jury 讲“没有陪审团的审判”。","历史背景通常与 1688–1689 年英国“光荣革命”有关：一些人（尤其部分英国国教主教/牧师）拒绝向新君主威廉三世与玛丽二世宣誓，因此被称为 Nonjurors（不宣誓派）。"]}

