{"word":"nonkinetic","summary":{"en":"Nonkinetic means “not involving physical force or direct weapon impact,” often used for indirect actions like cyber, information, diplomacy, or sanctions.","zh":"nonkinetic 指“非动能的、非直接武力打击的”，常用于描述网络、信息、外交、制裁等间接手段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving physical force, direct bodily impact, or traditional weapons; especially used for actions that achieve effects through information, influence, cyber operations, economic tools, or other indirect means.","zh":"非动能的；不直接使用武力、实体打击或传统武器的（尤指通过信息、影响、网络行动、经济工具等间接方式产生效果的行动）。"},"examples":[{"en":"The report focused on nonkinetic options such as diplomacy and sanctions.","zh":"这份报告重点讨论了外交和制裁等非动能手段。"},{"en":"The military described the operation as largely nonkinetic, relying on cyber and information support.","zh":"军方称这次行动主要是非动能的，依靠网络与信息方面的支援。"}]}],"synonyms":["non-kinetic","indirect","nonviolent","nonmilitary"],"phonetic":"/ˌnɑnˈkɪnɛtɪk/","extraExplanation":["“Nonkinetic”（也常写作 non-kinetic）最常见于军事与国家安全语境，用来对比“kinetic（动能的/武力打击的）”。Kinetic 通常指会造成可见物理破坏或伤亡的行动（如空袭、炮击）；nonkinetic 更偏向不直接以爆炸或火力达成目的的手段（如网络攻击、电子战、心理/舆论影响、制裁、法律与外交施压等）。","在普通日常英语里，这个词不算常用；如果写一般文章，也可以用更通俗的表达，如 “nonviolent (非暴力的) / nonmilitary (非军事的) / indirect (间接的)” ，但这些词并不总能精确覆盖军事语境中的含义。"]}
{"word":"nonknowledge","summary":{"en":"Nonknowledge means “not knowing” or “lack of knowledge,” and in academic writing it can mean the broader realm of unknowns (what isn’t known yet or can’t be clearly known).","zh":"Nonknowledge 表示“不了解/缺乏知识”；在学术语境中也可指更广义的“未知领域”（尚未知或难以明确知道的部分）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(General) A lack of knowledge; the state of not knowing something.","zh":"（一般用法）无知；对某事缺乏了解或不知道的状态。"},"examples":[{"en":"I spoke out of nonknowledge and later apologized.","zh":"我是在不了解情况的情况下说了话，后来道歉了。"},{"en":"Policies made in nonknowledge of local culture often fail.","zh":"在不了解当地文化的情况下制定的政策往往会失败。"}]},{"partOfSpeech":"n.","definition":{"en":"(Academic use) The domain of what is unknown, not yet known, or not selected/recognized as knowledge—often discussed in sociology, philosophy, and “ignorance studies” as something related to (but not always the same as) ignorance.","zh":"（学术用法）“非知识”：指尚未知、无法确定、或未被纳入/承认为“知识”的那一部分内容；常见于社会学、哲学与“无知研究”等领域，含义与“ignorance（无知）”相关但不一定完全等同。"},"examples":[{"en":"The study explores how scientific progress can expand both knowledge and nonknowledge.","zh":"这项研究探讨了科学进步如何同时扩展知识与“非知识”的范围。"},{"en":"Risk management often focuses on nonknowledge—what we don’t yet have evidence about.","zh":"风险管理常常关注“非知识”——那些我们尚缺乏证据的部分。"}]}],"synonyms":["ignorance","not knowing","unknowing","lack of knowledge","unawareness","nescience","unknowns"],"phonetic":"/ˌnɑnˈnɑlɪdʒ/","extraExplanation":["“nonknowledge”在日常英语里并不常见，更多出现在学术写作中；普通交流里通常直接说“lack of knowledge / not knowing / ignorance”。","在部分学术传统中，“nonknowledge”不是单纯骂人的“无知”，而更像是对“未知/未定/尚未被证实之事”的中性描述；有时也强调：知识的形成会同时划定“边界”，从而留下被排除或尚未选择的部分。","有些研究会把它与德语“Nichtwissen（不知道/未知）”联系起来，用来讨论不确定性、风险、未完成的研究（undone science）等主题。"]}
{"word":"nonknowledgeable","summary":{"en":"“Nonknowledgeable” means not having much knowledge about something (uninformed).","zh":"“nonknowledgeable”指对某事缺乏了解/不太懂（不知情）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having much knowledge, understanding, or information about a subject; uninformed.","zh":"对某个主题缺乏知识、理解或信息的；不了解情况的。"},"examples":[{"en":"I’m nonknowledgeable about cars, so I asked a mechanic for help.","zh":"我对汽车不太懂，所以我去请教了修车师傅。"},{"en":"The article is written for nonknowledgeable readers and explains the basics first.","zh":"这篇文章是写给不了解背景的读者的，会先解释基础知识。"}]}],"synonyms":["uninformed","unfamiliar","not knowledgeable","inexperienced","unaware"],"phonetic":"/ˌnɑn ˈnɑlɪdʒəbəl/","extraExplanation":["“nonknowledgeable”不是特别常见的标准用词，更自然、更常用的表达通常是：**unfamiliar (with …)**（对……不熟）、**uninformed**（不知情/不了解）、**not knowledgeable**（不太懂）、**a beginner**（初学者）。","构词上它等于 non-（不）+ knowledgeable（有知识的）。在正式写作里，很多时候用 “not knowledgeable about …” 会比 “nonknowledgeable” 更顺。"]}
{"word":"nonkosher","summary":{"en":"Nonkosher means either “not kosher (not allowed by Jewish dietary laws)” or, informally, “suspicious or improper.”","zh":"nonkosher 既可指“非洁食、违反犹太饮食律法”，也可在口语中引申为“可疑、不正当、不合规”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not kosher; not prepared or suitable according to Jewish dietary laws (kashrut)","zh":"非洁食的；不符合犹太饮食律法（kashrut/卡什鲁特）规定的"},"examples":[{"en":"The restaurant uses nonkosher ingredients, so it isn’t kosher-certified.","zh":"这家餐厅使用非洁食食材，所以没有洁食认证。"},{"en":"Mixing meat and dairy is nonkosher in many Jewish traditions.","zh":"在许多犹太传统中，肉类和奶制品混在一起是不符合洁食规定的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) dishonest, improper, or suspicious; not acceptable","zh":"（非正式）不诚实的；不正当的；可疑的；不被接受的"},"examples":[{"en":"Something about that deal feels nonkosher.","zh":"那笔交易总觉得有点不对劲/不太正当。"},{"en":"Using other people’s photos without permission is pretty nonkosher.","zh":"未经允许使用别人的照片挺不妥当的。"}]}],"synonyms":["not kosher","unacceptable","improper","questionable","suspicious"],"phonetic":"/ˌnɑnˈkoʊʃər/","extraExplanation":["“Nonkosher”通常也写作“non-kosher”。字面意思是“不洁食/不合规”，但在美式英语口语里常被借用来表示“有猫腻、违规、不道德、不太对劲”。使用时注意语境：谈饮食宗教规定时是中性描述；用来形容行为或交易时带批评意味。","“Kosher”本身在英语里也常引申为“合规、正当、没问题”（e.g., Is this kosher with the rules? 这符合规定吗？），对应地“nonkosher”就表示“不合规/不正当”。"]}
