{"word":"nonlabeling","summary":{"en":"Nonlabeling means avoiding labels or fixed categories when describing people or things.","zh":"Nonlabeling 指避免用标签或固定分类来描述或定义人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or practice of not putting labels (names, categories, tags, or stereotypes) on someone or something","zh":"不给（某人/某物）贴标签的做法；不使用名称、分类、标签或刻板印象去定义"},"examples":[{"en":"The teacher encouraged nonlabeling so students wouldn’t be called “smart” or “slow.”","zh":"老师鼓励不贴标签，这样学生就不会被叫作“聪明”或“迟钝”。"},{"en":"In the support group, nonlabeling helped people talk about their feelings without judgment.","zh":"在互助小组里，不贴标签帮助大家在不被评判的情况下谈论感受。"}]},{"partOfSpeech":"adj.","definition":{"en":"not labeled; done without applying labels, categories, or fixed identities","zh":"不贴标签的；不使用标签、分类或固定身份来界定的"},"examples":[{"en":"They took a nonlabeling approach to relationships, avoiding titles like “boyfriend” or “girlfriend.”","zh":"他们对关系采取不贴标签的方式，避免使用“男朋友”或“女朋友”等称谓。"},{"en":"Nonlabeling language can reduce stigma in discussions about mental health.","zh":"在讨论心理健康时，不贴标签的表达可以减少污名化。"}]}],"synonyms":["not labeling","avoiding labels","non-categorization","non-stigmatizing (in some contexts)"],"phonetic":"/ˌnɑnˈleɪbəlɪŋ/","extraExplanation":["“nonlabeling”更常见的写法是带连字符的“non-labeling”（尤其在正式写作中）。在美式英语里，两种写法都能见到；写作时建议选一种并保持一致。","在教育、心理咨询与社会议题语境中，“nonlabeling”常强调避免用单一词语把人“定型”（例如用诊断名、成绩标签或刻板印象），以减少偏见与自我限制。"]}
{"word":"nonlabelling","summary":{"en":"Nonlabelling means not assigning labels or categories to people or things; it often describes an inclusive, non-judgmental approach.","zh":"Nonlabelling 指“不贴标签/不下定论式归类”，常用来描述一种更包容、不带评判的表达或对待方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice or approach of not assigning a label or category (such as a name, identity, diagnosis, or status) to someone or something.","zh":"（一种做法/理念）不对某人或某事贴标签、归类（例如不用某个称呼、身份、诊断或地位去定义）。"},"examples":[{"en":"The counselor encouraged a nonlabelling approach so students wouldn’t be defined by one mistake.","zh":"辅导员鼓励采取不贴标签的方式，这样学生就不会被一次错误定义。"},{"en":"In some classrooms, nonlabelling language helps create a more inclusive atmosphere.","zh":"在一些课堂里，使用不贴标签的表达有助于营造更包容的氛围。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not labeling; avoiding labels or categories in speech, writing, or treatment.","zh":"不贴标签的；避免用标签或类别来描述、书写或对待（他人/事物）的。"},"examples":[{"en":"They tried a nonlabelling way of discussing mental health, focusing on support rather than names.","zh":"他们尝试用不贴标签的方式讨论心理健康，把重点放在支持而不是“叫什么病”。"},{"en":"Her comments were careful and nonlabelling, which made the conversation feel safer.","zh":"她的评论很谨慎、不过度贴标签，让对话更有安全感。"}]}],"synonyms":["non-judgmental","non-stigmatizing","label-free","inclusive","person-centered"],"phonetic":"/ˌnɑnˈleɪbəlɪŋ/","extraExplanation":["“nonlabelling”更常见的写法是带连字符的“non-labeling”（美式）或“non-labelling”（英式）。你输入的“nonlabelling”可以理解为英式拼写去掉连字符的写法，但在正式写作里建议选用更常见的标准拼写。","在教育、心理健康与社会议题语境中，“nonlabelling”通常强调：先看见人的处境与需要，而不是先用某个标签（如“问题学生”“失败者”“某种诊断”）来定义对方。"]}
{"word":"nonlacteal","summary":{"en":"Nonlacteal means “not containing milk or dairy products.”","zh":"nonlacteal 意为“不含牛奶或乳制品的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing milk or milk products; dairy-free.","zh":"不含牛奶或乳制品的；无乳（制品）的。"},"examples":[{"en":"She ordered a nonlacteal dessert because she’s allergic to dairy.","zh":"她对乳制品过敏，所以点了不含乳制品的甜点。"},{"en":"The hospital put him on a nonlacteal diet for a short period.","zh":"医院让他在短时间内采用无乳饮食。"}]}],"synonyms":["dairy-free","non-dairy","lactose-free (not the same, but related)"],"phonetic":"/ˌnɑnˈlæk.ti.əl/","extraExplanation":["词源上，non- 表示“非、不”，lacteal 来自拉丁语 lac/lact-，意思是“牛奶”。因此 nonlacteal 直译就是“非牛奶的”。","在实际使用中，它常见于较正式或医学/营养语境（如 nonlacteal diet）。日常生活里更常说 dairy-free（无乳制品的）或 non-dairy（非乳制的）。"]}
{"word":"nonlacteally","summary":{"en":"Nonlacteally means “in a non-lacteal (non-milky, non-milk-related) way,” and is a rare, technical adverb.","zh":"Nonlacteally 意为“以非乳状/非与乳相关的方式”，属于较少见的技术性副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not lacteal (not milky; not producing, containing, or relating to milk).","zh":"以非乳状（不呈乳白色；不产乳、不含乳或不与乳相关）的方式。"},"examples":[{"en":"The fluid looked clear, not cloudy—almost nonlacteally compared with milk.","zh":"这种液体看起来很清澈，不像牛奶那样浑浊——几乎可以说是“非乳状地”。"},{"en":"The medication is formulated nonlacteally, so it contains no milk-derived ingredients.","zh":"这种药物以“非乳制”的方式配方制作，因此不含任何乳来源成分。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Anatomy, technical) In a way that does not involve the intestinal lacteals (lymph vessels that absorb dietary fat) or does not become milky with chyle.","zh":"（解剖学／技术用语）以不涉及肠道乳糜管（吸收脂肪的淋巴管），或不因乳糜而呈乳白色的方式。"},"examples":[{"en":"Some nutrients enter the bloodstream directly rather than nonlacteally through lymph pathways.","zh":"有些营养会直接进入血液，而不是经由淋巴通路“非乳糜管地”进入。"},{"en":"The sample drained nonlacteally, showing no milky chyle appearance after the meal.","zh":"样本的引流呈“非乳糜管地”，进餐后也没有出现乳白色乳糜的外观。"}]}],"synonyms":["not lacteally","without milk","non-milkily (rare)","in a nondairy way (common alternative)"],"phonetic":"/ˌnɑnˈlæk.ti.ə.li/","extraExplanation":["这个词非常少见，常见于较旧的词表或技术性写作里。日常语境中，谈“没有乳制品/不含奶”更常用 **nondairy**（不含乳制品的）。","词根 **lact-** 来自拉丁语 *lac/lactis*（奶）。**lacteal** 在解剖学里也指“小肠绒毛中的乳糜管（lacteals）”，进食后会因为含脂肪的乳糜（chyle）而呈乳白色；因此 **nonlacteally** 在医学语境可能指“不通过乳糜管/不呈乳白色乳糜”的方式。"]}
{"word":"nonlacteous","summary":{"en":"Nonlacteous means milk-free (not containing milk/lactose) or, less commonly, not producing milk.","zh":"Nonlacteous 指“无乳的/不含乳糖的”，较少见时也可指“不泌乳的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not containing milk or milk sugar (lactose); milk-free","zh":"不含牛奶或乳糖的；无乳制品的"},"examples":[{"en":"This soup is nonlacteous, so it’s suitable for people avoiding dairy.","zh":"这道汤是 nonlacteous（无乳的），适合需要避免乳制品的人。"},{"en":"Choose a nonlacteous creamer if you can’t tolerate lactose.","zh":"如果你乳糖不耐受，可以选用 nonlacteous 的咖啡奶精。"}]},{"partOfSpeech":"adj.","definition":{"en":"(biology/medicine) not producing milk; not related to lactation","zh":"（生物/医学）不分泌乳汁的；与泌乳无关的"},"examples":[{"en":"In some medical notes, “nonlacteous” may describe changes unrelated to breastfeeding.","zh":"在一些病历记录里，nonlacteous 可能用来表示与哺乳无关的变化。"}]}],"synonyms":["nondairy","dairy-free","lactose-free","nonlacteal"],"phonetic":"/ˌnɑnˈlæk.ti.əs/","extraExplanation":["“nonlacteous”比较少见，日常英语里更常用的是 **nondairy**（不含乳制品）或 **lactose-free**（无乳糖）。","拼写上容易和 **nonlacteal / non-lacteal** 混淆；三者核心意思都指“非乳/无乳相关”，但在食品标签里最常见的是 nondairy、dairy-free、lactose-free。","注意：在美国食品语境中，**nondairy** 有时表示“不是乳制品/用作替代品”，但不一定等于 100% 完全无乳成分；对牛奶过敏者更应寻找 **dairy-free** 或查看过敏原标注。"]}
{"word":"nonlactescent","summary":{"en":"Nonlactescent means “not producing milk,” a formal term often used in medical or scientific contexts.","zh":"nonlactescent 意为“不泌乳/不产奶”，属于较正式用词，常见于医学或科研语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not producing or secreting milk (especially referring to a female mammal or a person).","zh":"不泌乳的；不产奶的（多指雌性哺乳动物或人）。"},"examples":[{"en":"The veterinarian noted that the mother cat was nonlactescent after the illness.","zh":"兽医指出这只母猫生病后不再泌乳。"},{"en":"After weaning, the cow becomes nonlactescent until the next calving cycle.","zh":"断奶后，这头奶牛会进入不泌乳状态，直到下一次产犊周期。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not related to milk production; not in a milk-secreting state (used in scientific or medical writing).","zh":"与泌乳无关的；非泌乳状态的（多用于科研或医学语境）。"},"examples":[{"en":"The study compared lactescent and nonlactescent mammary tissue.","zh":"研究比较了泌乳与非泌乳状态的乳腺组织。"}]}],"synonyms":["not lactating","nonlactating","dry (for dairy animals)"],"phonetic":"ˌnɑn lækˈtɛsənt","extraExplanation":["词源上可拆为 non-（“不、非”）+ lactescent（“开始泌乳的/泌乳的”）。lact- 来自拉丁语 lac/lactis，意思是“牛奶”。因此 nonlactescent 直观含义就是“不是泌乳的”。","这是偏正式/学术用词，日常更常说 not lactating（不在哺乳/泌乳）或 not producing milk（不产奶）。"]}
{"word":"nonlactic","summary":{"en":"Nonlactic means “not involving or producing lactic acid,” especially in exercise physiology.","zh":"Nonlactic 指“不涉及或不产生乳酸”，尤其常见于运动生理学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving, producing, or relating to lactic acid (often used in exercise physiology to describe energy processes that do not create lactate)","zh":"不涉及、不会产生或不与乳酸相关的（常用于运动生理学，指不会产生乳酸/乳酸盐的供能过程）"},"examples":[{"en":"A short sprint relies heavily on the nonlactic energy system at the very start.","zh":"短距离冲刺在刚开始时很大程度依赖非乳酸供能系统。"},{"en":"The coach planned nonlactic drills with long rest periods to train explosive power.","zh":"教练安排了非乳酸性质的训练，并配合较长休息时间来训练爆发力。"},{"en":"These efforts are so brief that they are considered nonlactic rather than lactate-producing.","zh":"这些用力时间非常短，所以被认为是非乳酸的，而不是会产生乳酸的。"}]}],"synonyms":["alactic","lactate-free"],"phonetic":"/ˌnɑnˈlæktɪk/","extraExplanation":["在运动科学里，nonlactic 常用来对比 lactic（乳酸性的）。它通常指“无乳酸/不产生乳酸盐”的能量供应途径，最典型的是 ATP-PC（磷酸原）系统：适用于极短时间（大约 0–10 秒左右）的爆发性动作，如起跑、跳跃、一次用力的举重。","很多教材更常用的术语是 alactic（无乳酸的）。所以你也会看到 “nonlactic anaerobic system” 与 “alactic anaerobic system” 指向相同或非常接近的概念。","词形上 non- 表示“非、不”，lactic 来自 lactic acid（乳酸）。在日常英语里 nonlactic 不算高频，主要出现在医学/运动生理等专业语境中。"]}
{"word":"nonlaminable","summary":{"en":"Nonlaminable means not suitable for lamination (cannot/should not be laminated).","zh":"nonlaminable 指“不适合覆膜/塑封的；不可覆膜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not suitable for lamination; cannot (or should not) be sealed in plastic film using heat/pressure or adhesive lamination.","zh":"不可覆膜的；不适合进行塑封/覆膜处理的（因材质、厚度、表面或耐热性等原因无法或不建议覆膜）。"},"examples":[{"en":"This paper is nonlaminable because the ink smears when heated.","zh":"这张纸不可覆膜，因为加热时墨水会晕开。"},{"en":"Some thermal receipts are nonlaminable and may turn black under lamination heat.","zh":"有些热敏小票不可覆膜，覆膜的高温可能会让它变黑。"},{"en":"The museum label is nonlaminable, so we use a protective sleeve instead.","zh":"博物馆的标签不可覆膜，所以我们改用保护套。"}]}],"synonyms":["not laminatable","not suitable for lamination","cannot be laminated","unlaminatable"],"phonetic":"/ˌnɑnˈlæmɪnəbəl/","extraExplanation":["“non-”是英语里常见的否定前缀（表示“非、不”）。因此 nonlaminable 直译就是“不能被覆膜/塑封的”。在办公用品、印刷、档案保存等语境里更常见。","实际使用中，你也可能会看到更常用的说法：not laminatable / not suitable for lamination / cannot be laminated。nonlaminable 属于比较直白的“技术/说明性”形容词。","常见导致“不可覆膜”的原因包括：热敏纸遇热变色、某些油墨/涂层受热起泡或融化、材料太厚/太脆导致覆膜不牢、表面有粉尘或蜡质导致粘不住等。"]}
{"word":"nonlaminated","summary":{"en":"“Nonlaminated” means not laminated—without a protective laminated layer.","zh":"“nonlaminated”指“非覆膜的/未覆膜处理的”，即没有覆上一层保护膜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not laminated; not covered with (or made by bonding) a protective layer of plastic, film, or another material.","zh":"非覆膜的；未经过覆膜处理的；没有用塑料膜/保护层覆盖或压合的。"},"examples":[{"en":"This map is nonlaminated, so it can tear easily if it gets wet.","zh":"这张地图是非覆膜的，所以一旦弄湿就很容易破。"},{"en":"Please submit a nonlaminated copy so we can stamp and sign it.","zh":"请提交一份非覆膜的复印件，方便我们盖章和签字。"}]}],"synonyms":["unlaminated","not laminated","uncoated"],"phonetic":"/ˌnɑnˈlæməˌneɪtɪd/","extraExplanation":["“non-”是英语里很常见的否定前缀，表示“非……、没有……”。所以 nonlaminated = non-（非）+ laminated（覆膜的）。\n常见使用场景包括：证件/文件（便于盖章、签字、复印）、印刷品（未加保护膜，较易磨损或受潮）、板材/木材（未覆膜处理，外观与耐用性不同）。"]}
{"word":"nonlaminating","summary":{"en":"“Nonlaminating” means “not laminating” or “not meant/able to be laminated,” usually in printing, packaging, or document contexts.","zh":"“nonlaminating”表示“不覆膜的/不进行覆膜的”，常用于印刷、包装或文件处理语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not laminating; not designed to laminate, or not able to be laminated.","zh":"不覆膜的；不用于覆膜的；不能被覆膜的。"},"examples":[{"en":"This is a nonlaminating label, so it should be applied directly to the box.","zh":"这是不覆膜的标签，所以应直接贴在盒子上。"},{"en":"The clinic asked for nonlaminating paper because laminated sheets are hard to recycle.","zh":"诊所要求用不覆膜的纸张，因为覆膜纸很难回收。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not doing the process of laminating (often describing a machine, method, or worker).","zh":"不进行覆膜操作的（常用来形容机器、工艺或人员）。"},"examples":[{"en":"We used a nonlaminating workflow to keep the documents easy to scan.","zh":"我们采用不覆膜的流程，让文件更容易扫描。"}]}],"synonyms":["non-laminating","unlaminated","without lamination","not laminated"],"phonetic":"/ˌnɑnˈlæməˌneɪtɪŋ/","extraExplanation":["“nonlaminating”在现实使用中更常写成“non-laminating”。多见于印刷、包装、标签、文件处理等语境，用来区分“覆膜/不覆膜”的材料或工艺。","“laminating”来自动词“laminate”（覆膜/压膜/叠层）。加上前缀“non-”表示否定：不……的、非……的。"]}
{"word":"nonlaminative","summary":{"en":"Nonlaminative (rare) means “not forming or not able to form thin layers.”","zh":"Nonlaminative（罕见）表示“非层状的/不能形成薄层的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Not laminative; not able to be made into, separated into, or characterized by thin layers (laminae).","zh":"（罕见）非层状的；不具有（或不能形成/分成）薄层（层片）的。"},"examples":[{"en":"Geologists described the rock as nonlaminative, with no visible layering.","zh":"地质学家把这种岩石描述为 nonlaminative（非层状的），看不到明显的层理。"},{"en":"The material hardened into a solid, nonlaminative mass rather than forming sheets.","zh":"这种材料硬化成一整块非层状的固体，而不是形成薄片。"}]}],"synonyms":["nonlaminated","nonlaminable","non-laminating","unlayered"],"phonetic":"/ˌnɑnˈlæməˌneɪtɪv/","extraExplanation":["这个词非常少见，很多词典里找不到，更多会用更常见的表达来代替：\n- **nonlaminated**（未层压的/非层压结构的）\n- **nonlaminable**（不能进行层压的）\n- **non-laminating / not laminating**（不会形成层压/分层的）\n如果你是在包装、印刷或塑料工艺里看到它，通常想表达的是“不能层压”或“不是层压结构”。\n另外，你输入的 **nonlaminative** 也可能是把 **nonlaminating** 或 **nonlaminable** 拼错了。"]}
{"word":"nonlanguage","summary":{"en":"Nonlanguage means “not involving words or language,” or (less commonly) “communication that is not language,” such as gestures or facial expressions.","zh":"nonlanguage 指“非语言的、不用文字/语言的”，较少见时也可指“非语言交流方式”，如手势、表情等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving language or words; not linguistic.","zh":"非语言的；不涉及语言或文字的；非语言学的。"},"examples":[{"en":"A smile is a common form of nonlanguage communication.","zh":"微笑是一种常见的非语言交流方式。"},{"en":"The test included nonlanguage puzzles that used shapes instead of words.","zh":"这次测试包含一些非语言题目，用图形而不是文字。"}]},{"partOfSpeech":"n.","definition":{"en":"communication or signals that are not language (for example, gestures, facial expressions, or sounds that do not form words).","zh":"非语言（的表达/信号）；指不构成语言的交流方式（如手势、面部表情，或不形成词语的声音）。"},"examples":[{"en":"In the meeting, his nonlanguage made it clear he was uncomfortable.","zh":"在会议上，他的非语言表现清楚地表明他不自在。"},{"en":"Babies often rely on nonlanguage before they can speak.","zh":"婴儿在会说话之前常常依靠非语言方式表达。"}]}],"synonyms":["nonverbal","nonspeech","nonlinguistic","wordless"],"phonetic":"/ˌnɑnˈlæŋɡwɪdʒ/","extraExplanation":["“nonlanguage”不是特别常见的日常用词；更常见的说法是“nonverbal（非言语的）”或“nonverbal communication（非言语交流）”。在学术或技术语境里（如语言学、心理学、认知科学），才更可能用“nonlanguage”来强调“这不是语言系统本身”。","在写作中，“nonlanguage”通常作为形容词放在名词前（nonlanguage cues / nonlanguage signals）。如果你想表达“身体语言”，英语更常用“body language”（注意：body language 仍然是 communication，但不一定被视为真正的 language）。"]}
{"word":"nonlarcenous","summary":{"en":"Nonlarcenous means “not involving larceny; not a larceny-type theft,” mainly used in legal contexts.","zh":"nonlarcenous 意为“非盗窃的；不构成盗窃罪性质的”，主要用于法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving larceny; not constituting the crime of larceny (the unlawful taking of someone else’s property with intent to permanently deprive them of it).","zh":"非盗窃的；不构成“盗窃罪（larceny）”的（指不符合盗窃罪要件的取走他人财物行为）。"},"examples":[{"en":"The judge described the incident as a nonlarcenous taking because there was no intent to permanently keep the property.","zh":"法官将该事件描述为“非盗窃性取走”，因为没有永久占有财物的意图。"},{"en":"In some jurisdictions, unauthorized but nonlarcenous use of a vehicle may be charged differently from theft.","zh":"在一些司法辖区，未经授权但非盗窃性的用车，可能会以不同于盗窃的罪名起诉。"}]}],"synonyms":["not larcenous","non-theft","lawful (in some contexts)","noncriminal (in some contexts)"],"phonetic":"/ˌnɑnˈlɑrsənəs/","extraExplanation":["“nonlarcenous”是法律语境里较少见的形容词，由 non-（不、非）+ larcenous（盗窃的）构成，意思是“不是盗窃性质的”。常见用法是说某种“taking/appropriation/use（取走/占用/使用）”不符合盗窃罪（larceny）的构成要件。","在英美法传统中，larceny 通常强调：未经允许拿走他人动产，并且有“永久剥夺对方占有/所有”的意图。如果缺少这个意图（例如只是短暂使用、误拿、认为自己有权拿），就可能被称为 nonlarcenous（非盗窃性的），但仍可能触及其他法律责任或其他罪名。"]}
{"word":"nonlawyer","summary":{"en":"A nonlawyer is someone who isn’t a lawyer; it can also describe information written for people who aren’t lawyers.","zh":"nonlawyer 指“非律师的人”，也可形容“面向非律师、非律师也能理解的（内容）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a lawyer (not trained, licensed, or working as an attorney)","zh":"非律师；不是律师的人（未受法律专业训练、未取得律师执照或不以律师身份执业）"},"examples":[{"en":"This guide is written for nonlawyers who need a simple explanation of contracts.","zh":"这本指南是写给需要用简单方式理解合同的非律师读者的。"},{"en":"As a nonlawyer, I can’t give legal advice, but I can help you find the right questions to ask.","zh":"作为非律师，我不能提供法律建议，但我可以帮你整理该问律师哪些问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"intended for or understandable by people who are not lawyers","zh":"面向非律师的；非律师也能理解的（内容/表达方式）"},"examples":[{"en":"The report includes a nonlawyer summary at the beginning.","zh":"报告开头包含一段给非律师看的摘要。"},{"en":"Please explain it in nonlawyer terms.","zh":"请用非律师也能听懂的说法解释一下。"}]}],"synonyms":["layperson","non-attorney","nonlawyer (also written non-lawyer)","ordinary person (in legal context)"],"phonetic":"/ˌnɑnˈlɔɪər/","extraExplanation":["“nonlawyer”在美式英语中常见于法律写作与科普语境，表示“不是律师的人”。更常见的写法也包括“non-lawyer”（加连字符）或“nonlawyer”（合写）；两者通常都能接受，取决于机构风格指南。","常见搭配：nonlawyer audience（非律师受众）、nonlawyer summary（给非律师看的摘要）、in nonlawyer terms（用通俗/非法律术语表达）。在正式场合也可用“layperson / non-attorney”表达类似意思。"]}
{"word":"nonlayered","summary":{"en":"Nonlayered means “not layered”—made as one layer or without distinct layers.","zh":"nonlayered 表示“非分层的、不是叠层的”——单层或没有明显层次。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not made of layers; having a single layer or no distinct layers.","zh":"非分层的；不是由多层构成的；单层的或没有明显层次的。"},"examples":[{"en":"The cake had a nonlayered design, with just one thick sheet of sponge.","zh":"这个蛋糕是非分层的设计，只有一整块厚厚的海绵蛋糕胚。"},{"en":"For summer, she prefers nonlayered clothing that feels light and simple.","zh":"夏天她更喜欢非分层的穿搭，感觉轻便又简洁。"},{"en":"The model assumes a nonlayered structure, so it won’t capture effects between layers.","zh":"这个模型假设结构是非分层的，所以无法体现层与层之间的影响。"}]}],"synonyms":["not layered","single-layer","one-layer","unlayered"],"phonetic":"/ˌnɑnˈleɪərd/","extraExplanation":["“nonlayered”通常由前缀 non-（表示“非、不”）+ layered（“分层的”）构成，是比较直观的构词法。它常见于服装（不叠穿）、食物/材料结构（不分层）、以及技术/科研语境（非分层模型、非分层介质）。","在日常口语里，人们更常说 “not layered” 或 “single-layer” 来表达同样意思；“nonlayered”更像书面或技术用词。"]}
{"word":"nonlaying","summary":{"en":"Nonlaying means “not laying,” most commonly “not laying eggs,” especially when talking about hens.","zh":"nonlaying 意为“未在进行 laying 的”，最常见用法是指“（母鸡等）不下蛋的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not laying (especially: not producing eggs)","zh":"不产卵的；不下蛋的（尤指母禽）"},"examples":[{"en":"The farmer separated the nonlaying hens from the active layers.","zh":"农夫把不下蛋的母鸡和正在产蛋的母鸡分开。"},{"en":"Cold weather and stress can lead to a nonlaying period.","zh":"寒冷天气和压力可能导致一段不产蛋的时期。"}]},{"partOfSpeech":"adj.","definition":{"en":"not laying something down or not putting something in place (less common)","zh":"不放置的；不铺设的（较少见）"},"examples":[{"en":"This is a nonlaying policy: we don’t place new carpet until the floor is repaired.","zh":"这是个“不铺设”的规定：地面修好之前不铺新地毯。"}]}],"synonyms":["non-laying","not laying","not producing eggs","unproductive (in egg-laying context)"],"phonetic":"/ˌnɑnˈleɪɪŋ/","extraExplanation":["“nonlaying”常写作 non-laying（带连字符），在农业/家禽语境里最常见，意思是“（母鸡等）不下蛋的”。词形是 non-（不）+ laying（产卵/放置）。","如果你本来想表达“没铺好餐桌/没摆放”，英语里更自然的词常用 **unlaid**（如：The table is still unlaid. 餐桌还没摆好）。"]}
{"word":"nonleaded","summary":{"en":"Nonleaded means “without lead,” especially describing gasoline or paint.","zh":"nonleaded 意为“不含铅的”，常用于描述汽油或油漆等产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not containing lead (Pb), especially in gasoline, paint, or materials where lead is avoided for safety or environmental reasons","zh":"不含铅的（尤其指汽油、油漆或为安全与环保而避免含铅的材料）"},"examples":[{"en":"This car requires nonleaded gasoline.","zh":"这辆车需要使用无铅汽油。"},{"en":"The building was repainted with nonleaded paint to reduce health risks.","zh":"为了降低健康风险，这栋楼重新粉刷时使用了无铅油漆。"}]}],"synonyms":["unleaded","lead-free"],"phonetic":"/ˌnɑnˈlɛdɪd/","extraExplanation":["“nonleaded”在日常英语里不如“unleaded”常见；在加油站、汽车说明书里更常看到“unleaded gasoline”（无铅汽油）。","之所以强调“无铅”，是因为含铅产品会对人体（尤其儿童）造成神经系统等健康危害，也会污染环境。"]}
{"word":"nonleafy","summary":{"en":"“Nonleafy” means not leafy—having few or no leaves, or not being a leafy type (especially in food contexts).","zh":"“nonleafy”表示“不多叶的/不长叶的”，也常用于饮食语境指“非叶菜类”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not leafy; having few or no leaves, or not characterized by many leaves.","zh":"不多叶的；不长（或几乎不长）叶子的；不以叶子繁茂为特征的。"},"examples":[{"en":"In winter, many trees look nonleafy, with bare branches against the sky.","zh":"冬天很多树看起来不多叶，光秃的枝条映着天空。"},{"en":"We planted nonleafy vegetables like carrots and beets in the garden this year.","zh":"今年我们在菜园里种了胡萝卜、甜菜这类不属于叶菜的蔬菜。"}]}],"synonyms":["not leafy","leafless","bare"],"phonetic":"/ˌnɑnˈliːfi/","extraExplanation":["拼写上常见的是带连字符的 **non-leafy**（更规范、也更常见），尤其在正式写作里；不带连字符的 **nonleafy** 也能见到，多见于标题、标签或简写场景。","这个词通常用在两类语境：① 形容植物/树木“叶子不多、没叶子”；② 在饮食或营养语境里与 **leafy vegetables**（叶菜）相对，表示“非叶菜”（如根茎类、果菜类等）。"]}
{"word":"nonleaking","summary":{"en":"Nonleaking means “not leaking; leakproof.”","zh":"nonleaking 表示“不漏的；密封不渗漏的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not allowing liquid, gas, or air to escape; leakproof.","zh":"不漏的；不渗漏的；密封良好的（液体、气体或空气不会泄漏）。"},"examples":[{"en":"I need a nonleaking water bottle for my backpack.","zh":"我需要一个放进背包也不漏水的水瓶。"},{"en":"Make sure the lid is nonleaking before you pack the soup.","zh":"装汤之前先确认盖子不漏。"},{"en":"The plumber replaced the old valve with a nonleaking one.","zh":"水管工把旧阀门换成了一个不漏的阀门。"}]}],"synonyms":["leakproof","watertight","airtight","spill-proof"],"phonetic":"/ˌnɑnˈliːkɪŋ/","extraExplanation":["写法上常见为 **non-leaking**（加连字符）或 **nonleaking**（合写），在产品说明、广告文案里更常见。口语里也常用 **leakproof**、**spill-proof**（更强调“不洒出来”）。","它通常修饰容器/部件：nonleaking bottle / container / seal / valve（不漏的瓶子/容器/密封圈/阀门）。"]}
{"word":"nonlegal","summary":{"en":"Nonlegal means “not related to law or legal processes.”","zh":"nonlegal 的意思是“非法律的；与法律程序或法律体系无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to law, legal rules, or legal procedures; not officially part of the legal system.","zh":"非法律的；与法律、法律规则或法律程序无关的；不属于正式法律体系的。"},"examples":[{"en":"We can resolve this issue through nonlegal methods like mediation or a direct apology.","zh":"我们可以通过调解或直接道歉等非法律方式来解决这个问题。"},{"en":"The team discussed nonlegal risks, such as damage to the company’s reputation.","zh":"团队讨论了非法律风险，例如对公司声誉的损害。"},{"en":"Nonlegal advice can be helpful, but you may still need a lawyer for official matters.","zh":"非法律建议可能有帮助，但正式事务你仍可能需要律师。"}]}],"synonyms":["nonjudicial","extralegal","nonlitigious","informal","nonstatutory"],"phonetic":"/nɑnˈliɡəl/","extraExplanation":["写法上常见两种：nonlegal（合写）和 non-legal（加连字符）。在正式写作里，两者都能见到；如果你所在机构/期刊有格式要求，按其规范即可。","nonlegal 常用于对比 legal（法律层面的）与其他层面（如道德、情感、商业、行政、人际）的解决方式或影响，例如 nonlegal remedies（非诉/非法律救济方式）或 nonlegal considerations（非法律考量）。","注意：nonlegal 不等于 illegal（非法的）。nonlegal 强调“与法律无关/不通过法律途径”，而 illegal 指“违反法律”。"]}
{"word":"nonlegato","summary":{"en":"Nonlegato is a musical instruction meaning “slightly detached,” between legato and staccato.","zh":"Nonlegato 是音乐术语，表示“略分离的演奏法”，介于连奏（legato）和断奏（staccato）之间。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(music) In a slightly detached way—notes are separated more than *legato* (smoothly connected) but usually not as short or sharp as *staccato*.","zh":"（音乐）以“非连奏”的方式演奏——音与音之间比 *legato*（连奏）更分开，但通常又没有 *staccato*（断奏）那么短促或尖锐。"},"examples":[{"en":"Play this passage nonlegato so each note is clear.","zh":"这一段请用非连奏来弹，让每个音都更清晰。"},{"en":"The teacher asked for a nonlegato touch in the right hand.","zh":"老师要求右手用非连奏的触键。"},{"en":"The melody should sound light and nonlegato, not fully connected.","zh":"旋律应当轻巧、非连奏，而不是完全连在一起。"}]}],"synonyms":["detached","semi-detached","not legato"],"phonetic":"/ˌnɑn ləˈɡɑtoʊ/","extraExplanation":["“nonlegato”常见于器乐教学与谱面指示，有时也写作两词“non legato”。意思不是“完全断奏”，而是“略分离”：每个音保持一定时值，但音与音之间留一点点空隙。","对钢琴来说，nonlegato 往往指触键更清楚、换指更干净；对弦乐/管乐，则常指运弓/吐音更分明，但仍保持线条与歌唱性。","可以把它理解成一条连续的句子里，把词与词之间稍微停顿一下：比连读更清晰，但不像一个个单词“切开”那么明显。"]}
{"word":"nonlegislative","summary":{"en":"Nonlegislative means “not involving law-making or a legislature.”","zh":"nonlegislative 指“非立法的；不涉及制定法律或立法机关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to making laws; not involving a legislature (a law-making body).","zh":"非立法的；与制定法律无关的；不涉及立法机关（立法机构）的。"},"examples":[{"en":"The committee focused on nonlegislative solutions, such as public education and voluntary guidelines.","zh":"该委员会把重点放在非立法性的解决方案上，比如公众教育和自愿性指南。"},{"en":"The agency can take some nonlegislative actions without asking Congress to pass a new law.","zh":"该机构可以采取一些非立法措施，而不必要求国会通过新法律。"}]}],"synonyms":["nonstatutory","administrative","executive","regulatory"],"phonetic":"/ˌnɑnˌlɛdʒəˈsleɪtɪv/","extraExplanation":["构词法：non-（“不、非”）+ legislative（“立法的”）。常用于政府、公共政策、组织治理等语境，强调“通过行政措施、规定、倡议、协作或自愿标准”等方式解决问题，而不是“通过立法（pass a bill/law）”。","常见对比：nonlegislative measures（非立法措施） vs. legislative action/legislation（立法行动/立法）。在美国语境中，legislative 通常与 Congress（国会）相关。"]}
{"word":"nonlegislatively","summary":{"en":"Nonlegislatively means “not through passing laws”; it describes actions taken outside the legislative process.","zh":"nonlegislatively 表示“非通过立法（不靠通过法案）”，指在立法程序之外采取的措施。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not involve making laws through a legislature (parliament, congress), or not by passing legislation.","zh":"以不经由立法机关制定法律的方式；非通过立法（而是通过其他方式，如行政命令、法院裁决、政策调整等）。"},"examples":[{"en":"The agency tried to solve the problem nonlegislatively by issuing new regulations.","zh":"该机构试图通过发布新规章，以非立法方式解决这个问题。"},{"en":"Some disputes can be handled nonlegislatively through the courts or negotiated agreements.","zh":"有些争议可以通过法院或协商协议，以非立法方式处理。"},{"en":"The government responded nonlegislatively, focusing on enforcement rather than new laws.","zh":"政府以非立法方式回应，把重点放在执法而不是制定新法律上。"}]}],"synonyms":["without legislation","outside the legislative process","by administrative action","nonstatutorily"],"phonetic":"/ˌnɑnˌlɛdʒəˈsleɪtɪvli/","extraExplanation":["这个词相对少见，常见于法律、公共政策或学术写作中，用来强调“不是靠立法程序（如国会/议会通过法案）”。更常用的替代表达包括：“without legislation / outside the legislative process / by administrative action（通过行政措施）”。","构词上是 non-（否定前缀）+ legislatively（“以立法方式”）。在句子里通常修饰动词（如 respond/act/resolve/handle），说明采取行动的方式。"]}
{"word":"nonlegitimacy","summary":{"en":"Nonlegitimacy means a lack of legitimacy—something is not lawful, valid, or accepted as rightful.","zh":"nonlegitimacy 指“缺乏正当性/合法性/公认效力”的状态，即不被认为是正当或有效的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being legitimate, lawful, recognized, or accepted as valid","zh":"不合法；不正当；缺乏公认效力（不被承认为正当/有效的状态或性质）"},"examples":[{"en":"The new committee faced accusations of nonlegitimacy because it was not elected.","zh":"这个新委员会因未经选举而面临“不具正当性”的指控。"},{"en":"Questions about the document’s nonlegitimacy delayed the project.","zh":"对该文件“不具合法/有效性”的质疑导致项目延期。"}]}],"synonyms":["illegitimacy","lack of legitimacy","invalidity","unlawfulness","unacceptability"],"phonetic":"/ˌnɑn.ləˈdʒɪt.ə.mə.si/","extraExplanation":["“nonlegitimacy”在现代英语里比较少见，更常用的是“illegitimacy”或“lack of legitimacy”。在正式写作中，你也可以根据语境选用更具体的表达：legal illegitimacy（法律层面不合法）、political legitimacy（政治正当性/民意基础）、social legitimacy（社会认可度）。","构词上是 non-（否定前缀）+ legitimacy（正当性/合法性）。读写时要注意它通常是不可数名词：the nonlegitimacy of + 名词（……的不正当性）。"]}
{"word":"nonlegitimate","summary":{"en":"Nonlegitimate means “not legitimate”: not lawful, valid, or genuinely accepted. In everyday English, “illegitimate” or “not legitimate” is more common.","zh":"nonlegitimate 意为“不合法/不正当/不被认可为真实有效”。日常英语里更常用 illegitimate 或 not legitimate。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not legitimate; not lawful, valid, or accepted as genuine (often used to describe claims, authority, businesses, or methods).","zh":"不合法的；不正当的；不被认可为真实或有效的（常形容主张、权威、机构或做法）。"},"examples":[{"en":"The website looked professional, but the company turned out to be nonlegitimate.","zh":"那个网站看起来很专业，但那家公司后来被证实是不正规的（不合法的）。"},{"en":"He questioned whether the request was nonlegitimate and refused to share personal information.","zh":"他怀疑这个请求不正当，于是拒绝提供个人信息。"}]}],"synonyms":["illegitimate","unlawful","invalid","unauthorized","fraudulent"],"phonetic":"/ˌnɑn.ləˈdʒɪt.ə.mət/","extraExplanation":["“nonlegitimate”在英语里能被理解，但更常见、更自然的写法通常是分开写或用更常用的词：**illegitimate**（不正当/不合法/不被承认的）、**not legitimate**、或在商业语境里用 **unlicensed / unauthorized / fraudulent / scam**（视具体意思而定）。","语感差异：**illegitimate**更偏“法律/制度上不被承认”（例如权力、资格、关系、孩子的“非婚生”是较旧用法，可能带敏感色彩）；而描述公司或网站时，很多场景用 **fraudulent**（欺诈的）或 **scam**（骗局）更贴切。"]}
{"word":"nonlegume","summary":{"en":"Nonlegume means “not a legume” (not a bean/pea/lentil plant) and can describe plants or be used as a noun for such plants.","zh":"nonlegume 表示“非豆科的”，也可作名词指“非豆科植物/作物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not a legume; not belonging to the plant family that includes beans, peas, and lentils","zh":"非豆科的；不属于豆科植物（如豆子、豌豆、扁豆等）"},"examples":[{"en":"Wheat is a nonlegume crop, so it doesn’t fix nitrogen the way beans often do.","zh":"小麦是非豆科作物，因此不像豆类那样常常具有固氮作用。"},{"en":"The guide separates legumes from nonlegume plants for easier identification.","zh":"这本指南把豆科植物和非豆科植物分开，方便辨认。"}]},{"partOfSpeech":"n.","definition":{"en":"a plant or crop that is not a legume","zh":"非豆科植物；非豆科作物"},"examples":[{"en":"Farmers often rotate a legume with a nonlegume to help manage soil nutrients.","zh":"农民常把豆科作物与非豆科作物轮作，以帮助管理土壤养分。"}]}],"synonyms":["not a legume","non-bean (informal, context-dependent)","non-pea (informal, context-dependent)"],"phonetic":"/ˌnɑnˈlɛɡjuːm/","extraExplanation":["这个词多见于农业、园艺、营养或植物学语境。legume（豆科/豆类）常与“固氮（nitrogen fixation）”联系在一起，因为很多豆科植物与根瘤菌共生，能提高土壤氮素；而 nonlegume 只是强调“不是豆科”，并不一定说明营养价值或健康与否。","拼写上通常作 nonlegume（美式写法更常见），也可能见到 non-legume 这种带连字符的写法，尤其在更正式或需要强调结构的文本里。"]}
{"word":"nonleguminous","summary":{"en":"Nonleguminous means “not a legume / not from the bean-and-pea family,” often used in farming or botany.","zh":"nonleguminous 表示“非豆科的/不属于豆类（豆科）家族的”，常见于农业与植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not leguminous; not belonging to the legume (pea/bean) family, or not having the typical features of legumes (such as pods).","zh":"非豆科的；不属于豆科（如豌豆、豆类）家族的，或不具有豆科植物典型特征（如荚果）的。"},"examples":[{"en":"Wheat is a nonleguminous crop, so it doesn’t form nitrogen-fixing root nodules like many beans do.","zh":"小麦是非豆科作物，因此不像许多豆类那样会形成固氮根瘤。"},{"en":"The study compared legumes with nonleguminous plants grown under the same soil conditions.","zh":"该研究比较了在相同土壤条件下生长的豆科植物与非豆科植物。"},{"en":"They rotated soybeans with nonleguminous grains to improve soil health.","zh":"他们用大豆与非豆科谷物轮作，以改善土壤健康。"}]}],"synonyms":["non-legume","not leguminous","nonfabaceous"],"phonetic":"/ˌnɑnˌlɛɡˈjuːmɪnəs/","extraExplanation":["“non-”是否定前缀，表示“非……/不……”。“leguminous”来自“legume（豆科植物/豆类）”，因此“nonleguminous”常用于农业、植物学和生态学语境，尤其是在讨论作物轮作、固氮（豆科常见）或植物分类时。","写法上有时也会看到连字符形式“non-leguminous”。在学术或技术写作中，两种写法都可能出现，但同一篇文章里尽量保持一致。"]}
{"word":"nonlepidopteral","summary":{"en":"Nonlepidopteral means “not related to butterflies and moths (Lepidoptera).”","zh":"nonlepidopteral 意为“与蝴蝶和蛾类（鳞翅目）无关的；非鳞翅目的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not belonging to, relating to, or characteristic of Lepidoptera (butterflies and moths).","zh":"不属于、与鳞翅目（蝴蝶与蛾类）无关的；非鳞翅目的。"},"examples":[{"en":"The study focused on nonlepidopteral insects such as beetles and flies.","zh":"这项研究重点关注非鳞翅目的昆虫，例如甲虫和蝇类。"},{"en":"Nonlepidopteral larvae often lack the specific prolegs and features typical of many caterpillars.","zh":"非鳞翅目的幼虫通常没有许多毛毛虫所特有的腹足等特征。"}]}],"synonyms":["nonlepidopterous","nonlepidopteran","not lepidopteran"],"phonetic":"ˌnɑnˌlɛpəˈdɑptərəl","extraExplanation":["这个词在日常英语里很少见，多出现在昆虫学、农业害虫管理、生态学等语境中，用来把“鳞翅目害虫/物种”和“非鳞翅目害虫/物种”区分开。","构词很直观：non-（不、非）+ lepidopteral（鳞翅目的）。相关变体常见有 nonlepidopterous（同义，形容词）以及 nonlepidopteran（同义，形容词；也可对应名词 lepidopteran）。"]}
{"word":"nonlepidopteran","summary":{"en":"“Nonlepidopteran” means not a butterfly or moth (not in the order Lepidoptera).","zh":"“nonlepidopteran” 指非鳞翅目（不是蝴蝶或蛾类）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, entomology) Not belonging to the order Lepidoptera (butterflies and moths).","zh":"（生物/昆虫学）非鳞翅目（非蝴蝶或蛾类）的。"},"examples":[{"en":"The study compared lepidopteran and nonlepidopteran insects found on the same plants.","zh":"这项研究比较了同一植物上发现的鳞翅目昆虫与非鳞翅目昆虫。"},{"en":"Nonlepidopteran larvae may look similar, but they often have different mouthparts and behavior.","zh":"非鳞翅目幼虫可能看起来相似，但它们的口器和行为常常不同。"}]},{"partOfSpeech":"n.","definition":{"en":"A nonlepidopteran organism (especially an insect) that is not a butterfly or moth.","zh":"非鳞翅目生物（尤指昆虫）；不是蝴蝶或蛾的个体。"},"examples":[{"en":"The trap caught mostly nonlepidopterans such as beetles and flies.","zh":"陷阱捕到的多为非鳞翅目昆虫，比如甲虫和蝇类。"},{"en":"This pesticide is designed to reduce harm to nonlepidopterans that help pollinate crops.","zh":"这种杀虫剂旨在减少对有助于农作物授粉的非鳞翅目昆虫的伤害。"}]}],"synonyms":["non-lepidopteran","not lepidopteran","nonmoth","non-butterfly (contextual)"],"phonetic":"/ˌnɑnˌlɛpəˈdɑptərən/","extraExplanation":["这是一个比较“学术/专业”的构词：non-（不、非）+ lepidopteran（鳞翅目的）。因此它通常出现在论文、调查报告或昆虫鉴定语境中，用来把“蝴蝶/蛾类”与“其他昆虫”区分开。","lepidopteran 来自 Lepidoptera（鳞翅目），词根 lepid- 与“鳞片”有关（蝴蝶和蛾的翅膀覆有细小鳞片）。"]}
{"word":"nonlepidopterous","summary":{"en":"Nonlepidopterous means “not related to butterflies and moths (the order Lepidoptera).”","zh":"nonlepidopterous 指“非鳞翅目（非蝴蝶与蛾类）的；不具鳞翅目特征的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not belonging to, relating to, or characteristic of the insect order Lepidoptera (butterflies and moths).","zh":"非鳞翅目（蝴蝶与蛾类）的；不属于或不具有鳞翅目特征的。"},"examples":[{"en":"The study compares lepidopterous pests with nonlepidopterous insects in the same crop system.","zh":"这项研究比较了同一作物系统中的鳞翅目害虫与非鳞翅目昆虫。"},{"en":"Birds eat many nonlepidopterous larvae as well as caterpillars.","zh":"鸟类除了吃毛毛虫，也会吃许多非鳞翅目的幼虫。"}]}],"synonyms":["non-lepidopteran","nonlepidopteran","not lepidopterous"],"phonetic":"/ˌnɑnˌlɛpɪˈdɑptərəs/","extraExplanation":["这是一个比较学术/技术性的形容词，常见于昆虫学、生态学或农业害虫研究中。","构词很直观：non-（“不、非”）+ lepidopterous（“鳞翅目的”）。Lepidoptera 是“鳞翅目”，包括 butterflies（蝴蝶）和 moths（蛾）。","使用时常用来做分类对比：lepidopterous vs. nonlepidopterous（鳞翅目 vs. 非鳞翅目）。"]}
{"word":"nonleprous","summary":{"en":"“Nonleprous” means “not leprous”—not affected by leprosy; used mainly in medical or academic writing.","zh":"“Nonleprous”意为“非麻风性的/未患麻风的”，主要用于医学或学术写作中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not affected by leprosy (Hansen’s disease); free from leprous infection or lesions.","zh":"非麻风病的；未感染麻风（汉森病）的；没有麻风病变的。"},"examples":[{"en":"The biopsy showed a nonleprous skin condition, so leprosy was ruled out.","zh":"活检显示是非麻风性的皮肤问题，因此排除了麻风病。"},{"en":"They compared leprous and nonleprous tissue samples under the microscope.","zh":"他们在显微镜下比较了麻风性与非麻风性的组织样本。"}]}],"synonyms":["not leprous","unaffected by leprosy","leprosy-free"],"phonetic":"/ˌnɑnˈlɛprəs/","extraExplanation":["词形结构：non-（“非/不”）+ leprous（“麻风病的/呈麻风病变的”）。因此 nonleprous 是一个医学/学术语境更常见的形容词，用来区分“麻风相关”与“非麻风相关”的病变、组织、患者或检查结果。","使用场景提示：日常英语里很少用到这个词，通常出现在病理报告、研究论文或医学描述中。更口语/更常见的表达往往是 “not leprous” 或 “not affected by leprosy”。","文化与措辞敏感性：谈到麻风病时，现代医疗与公共健康语境更倾向使用更中性、以人为本的说法（如 “a person with Hansen’s disease”），避免带有污名化色彩的标签化称呼。"]}
{"word":"nonleprously","summary":{"en":"Nonleprously (very rare) means “not in a leprous way,” literally without leprosy, and sometimes figuratively without stigma.","zh":"nonleprously（极少见）意为“非麻风病地”，字面指没有麻风病；也可比喻指不带污名、被正常接纳地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare) In a way that is not leprous; without having leprosy (Hansen’s disease).","zh":"（非常少见）以非麻风病（汉森病）患者的方式；没有麻风病地。"},"examples":[{"en":"The doctor confirmed that the skin lesions were healing and that the patient was living nonleprously after treatment.","zh":"医生确认皮损正在愈合，治疗后病人已在“非麻风病状态”下生活。"},{"en":"The old record separates leprously ill residents from those described as living nonleprously.","zh":"那份旧档案把麻风病患者与被描述为“非麻风病地生活”的居民区分开来。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative, rare) Without the social stigma or “taint” associated with being treated as an outcast.","zh":"（比喻，少见）不带被当作弃民/被排斥者的污名地；不受“污名化”影响地。"},"examples":[{"en":"He wanted to return home and live nonleprously—accepted as ordinary again.","zh":"他想回家，过一种“非被污名化”的生活——重新被当作普通人接纳。"},{"en":"The memoir argues that people deserve to be seen nonleprously, not defined by one diagnosis.","zh":"这本回忆录主张，人们应当被以“不被污名化”的方式看待，而不是被某一种诊断所定义。"}]}],"synonyms":["without leprosy","not leprously","nonleprous (adj., related)"],"phonetic":"/ˌnɑnˈlɛprəsli/","extraExplanation":["这个词非常罕见，更多是“临时造词/修辞用法”，由 non-（不、非）+ leprous（麻风病的）+ -ly（副词后缀）构成。日常英语里更常见的是 nonleprous（形容词）或直接说 without leprosy / not affected by leprosy。","注意：leprosy（麻风病）在历史上常与“污名化”联系在一起，因此在比喻用法中可能带有“被排斥、被当作不洁”的隐喻。现代语境中谈及疾病与人群时，表达应尽量避免强化污名。"]}
{"word":"nonlethal","summary":{"en":"Nonlethal means “not intended to kill” or “not causing death,” though it can still cause harm.","zh":"nonlethal 指“非致命的/不以致死为目的的”，但仍可能造成伤害。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not intended to kill; designed to stop, control, or reduce harm without causing death.","zh":"非致命的；不以杀死为目的的（旨在制服、控制或降低伤害而不致死）。"},"examples":[{"en":"Police may use nonlethal weapons, such as pepper spray, to control a dangerous situation.","zh":"警方可能使用胡椒喷雾等非致命武器来控制危险局势。"},{"en":"The film shows how nonlethal tactics can sometimes prevent violence from escalating.","zh":"这部电影展示了非致命策略有时如何防止暴力升级。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing injury or damage but not death.","zh":"造成伤害但不致死的。"},"examples":[{"en":"He suffered a nonlethal wound and recovered after treatment.","zh":"他受了不致命的伤，治疗后康复了。"},{"en":"The researchers measured nonlethal effects on wildlife, such as stress and disrupted behavior.","zh":"研究人员测量了对野生动物的非致命影响，例如压力和行为紊乱。"}]}],"synonyms":["not deadly","nonfatal","less-lethal"],"phonetic":"/ˌnɑnˈliːθəl/","extraExplanation":["“non-”是否定前缀，表示“非、无、不”。“nonlethal”常见于执法与军事语境（nonlethal weapons 非致命武器），也常用于医学/科研（nonlethal injury 不致命伤；nonlethal effects 非致命影响）。","需要注意：在现实语境中，“nonlethal（非致命）”不等于“harmless（无害）”。它通常强调“目的或设计上不以致死为主”，但仍可能造成严重伤害，甚至在特殊情况下导致死亡。"]}
{"word":"nonlethally","summary":{"en":"“Nonlethally” means “in a way that does not kill; without causing death.”","zh":"“nonlethally”表示“以不致命的方式；不造成死亡（不以杀死为目的）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not intended to kill; without causing death.","zh":"以不致命的方式；不以杀死为目的（不造成死亡）。"},"examples":[{"en":"The police used nonlethally forceful methods to stop the suspect.","zh":"警方使用不致命但有力的方法来制止嫌疑人。"},{"en":"Researchers are testing ways to deter sharks nonlethally.","zh":"研究人员正在测试以非致命方式驱赶鲨鱼的方法。"}]}],"synonyms":["without killing","in a nonlethal way","non-fatally"],"phonetic":"/nɑnˈliːθəli/","extraExplanation":["“Nonlethally”常见于执法、军事、动物管理与公共安全语境，常与“nonlethal force / nonlethal weapons（非致命武力/非致命武器）”搭配。需要注意：nonlethal并不等于“无害”，只是不以致死为目标或通常不致死；仍可能造成严重伤害。","构词法：non-（不、非）+ lethal（致命的）+ -ly（副词后缀）。更常见的表达是“in a nonlethal way / nonlethally”。"]}
{"word":"nonlethargic","summary":{"en":"Nonlethargic means “not lethargic”—awake, alert, and energetic.","zh":"nonlethargic 表示“并不迟钝/嗜睡”，即清醒、有精神、有活力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not lethargic; energetic, alert, and showing normal or lively activity.","zh":"不迟钝的；不昏昏欲睡的；精力充沛、清醒而有活力的。"},"examples":[{"en":"After a good night’s sleep, she felt nonlethargic and ready to work.","zh":"好好睡了一觉后，她感觉精神抖擞，准备开始工作。"},{"en":"The patient appeared nonlethargic, answering questions quickly and clearly.","zh":"病人看起来并不嗜睡，回答问题又快又清楚。"},{"en":"A light walk can help you stay nonlethargic during a long afternoon.","zh":"下午时间很长，散步一会儿能帮助你保持不犯困、很清醒。"}]}],"synonyms":["alert","awake","energetic","lively","active","bright-eyed","not sleepy"],"phonetic":"/ˌnɑn.ləˈθɑr.dʒɪk/","extraExplanation":["“non-”是英语里很常见的前缀，意思是“非、没有、不”。所以 nonlethargic 就是“不是 lethargic（迟钝/没精神/嗜睡）的”。","这个词在日常口语中不算特别常见；更自然的表达常用：alert（清醒的）、energetic（精力充沛的）、not sleepy（不困）、not sluggish（不迟缓）。不过在医学记录或较正式的描述里，用 nonlethargic 也很清楚。"]}
{"word":"nonlethargical","summary":{"en":"“Nonlethargical” (very rare) means not lethargic—energetic or alert. In most cases, “nonlethargic” is the more natural word.","zh":"“nonlethargical”（很少见）表示“不昏沉、很有精神/很警觉”。多数情况下更自然的用法是“nonlethargic”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Not lethargic; not sluggish or lacking energy; energetic or alert.","zh":"（很少见）不昏沉的；不懒散无力的；有精神的、警觉的。"},"examples":[{"en":"After a full night’s sleep, she felt nonlethargical and ready to work.","zh":"睡了一整晚后，她精神不昏沉，准备开始工作。"},{"en":"Try a short walk if you want to feel more nonlethargical in the afternoon.","zh":"如果你想下午更有精神，不妨短走一会儿。"}]}],"synonyms":["nonlethargic","energetic","alert","lively","vigorous"],"phonetic":"/ˌnɑn.ləˈθɑr.dʒɪ.kəl/","extraExplanation":["“nonlethargical”在真实语料中非常少见，很多时候更自然、更常用的说法是 **nonlethargic**（不昏沉的、有精神的）。","构词上，non- 表示“非、不”；lethargic 表示“昏沉、无精打采的”。英语里把 -ic（如 lethargic）改成 -ical（如 *nonlethargical*）通常不会增加常见新义，反而可能显得不地道。建议写作或考试优先用 **nonlethargic**, 或直接用 **energetic / alert**。"]}
{"word":"nonlethargically","summary":{"en":"“Nonlethargically” means doing something in an energetic, alert way (not sluggish).","zh":"“nonlethargically”表示“做事不懒散、很有精神/很警觉”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is energetic, alert, and not lazy or sluggish.","zh":"以精力充沛、警觉、不懒散或不迟钝的方式。"},"examples":[{"en":"After a short break, the team returned to work nonlethargically and finished the task on time.","zh":"短暂休息后，团队精神十足地回到工作中，按时完成了任务。"},{"en":"She answered the questions nonlethargically, showing she was fully engaged.","zh":"她回答问题很有精神，显示出她完全投入其中。"}]}],"synonyms":["energetically","actively","briskly","vigorously","alertly"],"phonetic":"/ˌnɑn.ləˈθɑr.dʒɪ.kli/","extraExplanation":["“nonlethargically”由 non-（不、非）+ lethargic（昏昏沉沉的、无精打采的）+ -ally（副词后缀）构成，意思很直观，但在日常口语中不算常见，更多见于正式写作或强调对比时。","更自然的替代说法常用：“energetically / briskly / actively / alertly（精力充沛地 / 轻快地 / 积极地 / 警觉地）”。根据语境选择会更地道。"]}
{"word":"nonlevel","summary":{"en":"Nonlevel means “not level” or “uneven,” usually describing a surface or position.","zh":"nonlevel 表示“不水平/不平”，通常用来描述表面或位置不平整。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not level; not flat, even, or balanced (often describing a surface, floor, table, or height).","zh":"不水平的；不平的；不均匀的（常形容地面、桌面、楼层或高度）。"},"examples":[{"en":"The table is nonlevel, so the cup keeps sliding.","zh":"这张桌子不水平，所以杯子一直在滑。"},{"en":"A nonlevel floor can be a safety hazard.","zh":"不平的地面可能会造成安全隐患。"}]}],"synonyms":["uneven","unlevel","not level","tilted","slanted"],"phonetic":"/ˌnɑnˈlɛvəl/","extraExplanation":["更常见的写法是 **non-level**（带连字符）或直接说 **not level / uneven**。在工程、施工、测量等语境里，你也会看到 **out of level**（不在水平范围内）这种更专业/更口语化的表达。","有时写成 **nonlevel**（不带连字符）也能理解，但在正式写作里通常建议用 **non-level**，因为前缀 **non-** + 形容词的组合常用连字符来避免阅读歧义。"]}
{"word":"nonleviable","summary":{"en":"Nonleviable is a legal adjective meaning “exempt from levy”—property or funds that cannot be seized (and sometimes cannot be taxed).","zh":"Nonleviable 是法律形容词，意思是“不可被征收/扣押”，指依法豁免、不能被查封（有时也指免税）的财产或款项。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(law) Not subject to levy (legal seizure); protected by law so it cannot be taken or sold to satisfy a debt or judgment.","zh":"（法律）不可被强制扣押/查封（不得被“征收/扣押”）；依法受保护，不能被拿来拍卖或处置以清偿债务或判决款。"},"examples":[{"en":"In many states, certain retirement funds are nonleviable, so creditors cannot seize them to pay a judgment.","zh":"在许多州，某些退休资金属于 nonleviable（不可扣押财产），债权人不能为了执行判决而查封这些资金。"},{"en":"The court ruled that the tenant’s assistance payments were nonleviable under the statute.","zh":"法院裁定：根据该法条，租户的补助金属于 nonleviable（不可扣押）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(tax/legal, less common) Not subject to being levied as a tax; exempt from taxation.","zh":"（税务/法律，较少见）不需缴税；不属于可被征税的范围（免税）。"},"examples":[{"en":"The ordinance treated the nonprofit’s property as nonleviable for local taxes.","zh":"该条例将该非营利机构的财产视为 nonleviable（免征地方税）。"}]}],"synonyms":["exempt","immune (from seizure)","judgment-proof (in context)","protected","not subject to levy"],"phonetic":"/ˌnɑnˈliːviəbəl/","extraExplanation":["这个词非常少见，主要出现在法律语境（尤其是债务执行、破产、财产豁免）里。","词根来自 levy（征收；强制扣押/查封）。nonleviable = non-（不）+ leviable（可被征收/可被扣押的）。","不要和 nonviable（不可行的；无法存活的）混淆：nonviable 常用于日常英语与医学/生物学；nonleviable 更偏法律术语。"]}
{"word":"nonlevulose","summary":{"en":"Nonlevulose means “not relating to levulose (fructose).” It’s a rare technical adjective.","zh":"Nonlevulose 的意思是“与 levulose（果糖的旧称）无关/不含 levulose（果糖）”。这是较少见的技术性形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"**nonlevulose**: not relating to **levulose** (an older name for **fructose**, a type of sugar).\nExample: “This IV solution is labeled **nonlevulose** (i.e., it contains no levulose/fructose).”\n例句： “这款静脉输液标注为 **nonlevulose**（也就是不含 levulose/果糖）。”","zh":"**nonlevulose**：**不含 levulose（左旋糖）/ 与 levulose 无关的**。levulose 是 **fructose（果糖）** 的旧称。\nExample: “This IV solution is labeled **nonlevulose** (i.e., it contains no levulose/fructose).”\n例句： “这款静脉输液标注为 **nonlevulose**（也就是不含 levulose/果糖）。”},"},"examples":[{"en":"This medication is nonlevulose, so it does not use levulose (fructose) as an ingredient.","zh":"这种药物是 nonlevulose 的，所以它不使用 levulose（果糖）作为成分。"},{"en":"The clinic requested a nonlevulose formulation for a patient who must avoid fructose.","zh":"诊所为一位必须避免果糖的患者要求使用 nonlevulose 的配方。"}]}],"synonyms":["fructose-free (often the intended meaning)","nonfructose (rare)"],"phonetic":"/ˌnɑnˈlɛv.jəˌloʊs/","extraExplanation":["这个词很少见，常见于**专业/技术语境**（例如配方、标签、成分说明）里，用来强调“不是 levulose”。而 **levulose 基本等同于 fructose（果糖）**，所以在实际理解上，nonlevulose 往往接近“**不含果糖/与果糖无关**”。([en.wiktionary.org](https://en.wiktionary.org/wiki/nonlevulose?utm_source=openai))","如果你是在某个产品说明、化验/饮食要求或药品标签里看到 nonlevulose，建议你把上下文那一句发来（或截图），我可以帮你判断它到底是在说“**不含果糖**”，还是更宽泛地指“**与果糖无关的**”。"]}
{"word":"nonliabilities","summary":{"en":"“Nonliabilities” means items that are not debts or obligations, often used in accounting/finance.","zh":"“Nonliabilities”指不属于债务或义务的项目，常用于会计/金融语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that are not liabilities (not debts or obligations), especially in accounting or finance contexts","zh":"非负债；不构成负债的项目（尤用于会计或金融语境）"},"examples":[{"en":"The auditor asked the company to separate its liabilities from its nonliabilities in the report.","zh":"审计员要求公司在报告中把负债和非负债项目分开。"},{"en":"Some customer deposits are treated as liabilities, while others may be classified as nonliabilities depending on the contract.","zh":"有些客户押金被视为负债，而另一些则可能因合同不同被归类为非负债项目。"}]}],"synonyms":["non-debts","non-obligations","items that are not liabilities","nonliability items"],"phonetic":"ˌnɑnˌlaɪəˈbɪlətiz","extraExplanation":["“nonliabilities”通常出现在会计/财务写作里，意思是“不是负债的那些项目”。日常英语更常直接说“items that are not liabilities”或按类别说“equity / revenue / assets”等。","拼写上也常见作“non-liabilities”（加连字符）来提高可读性；是否加连字符取决于写作风格或机构规范。","它是复数形式；单数是“nonliability”。在正式文件里，最好用清晰的分类名称（如“equity”“deferred revenue”等），避免含糊地只写“nonliabilities”。"]}
{"word":"nonliability","summary":{"en":"Nonliability means not being responsible (especially legally or financially) for something; it’s a formal term often used in contracts and legal writing.","zh":"Nonliability 指“不承担（法律或财务）责任”，是较正式的词，常见于合同与法律文本中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being legally or financially responsible for something (not having an obligation to pay, fix, or compensate).","zh":"不负法律或财务责任的状态（没有赔偿、修理或付款等义务）。"},"examples":[{"en":"The contract stated the company’s nonliability for delays caused by severe weather.","zh":"合同规定：因恶劣天气导致的延误，公司不承担责任。"},{"en":"The judge ruled nonliability because there was no proof the driver was negligent.","zh":"法官裁定不承担责任，因为没有证据证明司机存在过失。"}]},{"partOfSpeech":"n.","definition":{"en":"In accounting or finance, the condition of not having debts or obligations (or an item that is not treated as a liability).","zh":"（会计/金融）没有债务或义务的状态；或不被视为“负债”的项目。"},"examples":[{"en":"They described the gift as a nonliability, meaning it did not create a debt to be repaid.","zh":"他们把这笔赠与描述为“不构成负债”，意思是不产生需要偿还的债务。"}]}],"synonyms":["no liability","lack of liability","freedom from liability","exemption from liability","not liable"],"phonetic":"/ˌnɑnˌlaɪəˈbɪləti/","extraExplanation":["“nonliability”较偏正式、法律/合同语境常见。日常英语里更常说：not liable / no liability。","常见搭配：nonliability clause（免责条款/不承担责任条款）、nonliability for damages（对损害不承担责任）。需要注意：在很多法律体系中，某些责任不能通过条款完全免除（例如故意伤害、重大过失等），具体要看当地法律与合同文本。"]}
{"word":"nonliable","summary":{"en":"Nonliable means “not legally responsible” (used mainly in legal/contract contexts).","zh":"Nonliable 指“（法律上）不承担责任/不需赔偿”，主要用于法律或合同语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Law) not legally responsible for something; not required to pay or be punished for a loss, debt, or damage.","zh":"（法律）不承担法律责任的；不需为损失、债务或损害负责或赔偿的。"},"examples":[{"en":"Under the contract, the carrier is nonliable for delays caused by severe weather.","zh":"根据合同，因恶劣天气造成的延误，承运人不承担责任。"},{"en":"If the notice was never delivered, the company may be nonliable for the customer’s claim.","zh":"如果通知从未送达，公司可能对客户的索赔不承担责任。"},{"en":"The court found the landlord nonliable because the hazard was clearly marked and repaired promptly.","zh":"法院认定房东不承担责任，因为危险已被明确标示且及时修复。"}]}],"synonyms":["not liable","not responsible","exempt (from liability)","not accountable"],"phonetic":"/ˌnɑnˈlaɪəbəl/","extraExplanation":["“nonliable”多见于法律/合同语境，等同于“not liable”。在日常英语里更常直接说“not liable”或“not responsible”。","注意区分：nonliable（形容词：不承担责任的） vs. nonliability（名词：不承担责任/免责状态）。书写上也可能见到带连字符的“non-liable”。"]}
{"word":"nonlibelous","summary":{"en":"“Nonlibelous” means not libelous—written content that is not legally defamatory.","zh":"“nonlibelous”指“不构成（书面）诽谤的；非诽谤性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not libelous; not containing written statements that are legally defamatory (not a form of libel).","zh":"非诽谤性的；不构成（书面）诽谤的；不包含法律上可被认定为诽谤的文字内容。"},"examples":[{"en":"The editor reviewed the article to make sure the claims were factual and nonlibelous.","zh":"编辑审阅了这篇文章，确保其说法有事实依据、不构成诽谤。"},{"en":"You can criticize a public policy in a strong but nonlibelous way by focusing on evidence and actions.","zh":"你可以用强烈但不诽谤的方式批评公共政策——把重点放在证据和行为上。"}]}],"synonyms":["not defamatory","nondefamatory","non-slanderous (broader, not exact)"],"phonetic":"/ˌnɑnˈlaɪbələs/","extraExplanation":["“nonlibelous”由前缀 non-（不、非）+ libelous（诽谤性的）构成。libel 通常指“书面/发布形式的诽谤”（如报刊、网络帖子、视频字幕等），与口头形式的 slander（口头诽谤）相对。","日常写作中更常见的表达有：not defamatory（不构成诽谤的）、not libel（不算诽谤）、legally safe wording（法律风险较低的措辞）。不过在法律或媒体合规语境里，“nonlibelous”会更精确、更正式。","想让表述更“nonlibelous”，通常做法是：描述可核实的事实、注明来源、区分事实与观点（用 “in my opinion” 等标记观点）、避免断言对方有犯罪/不道德行为而没有证据。"]}
{"word":"nonlibelously","summary":{"en":"“Nonlibelously” means “in a way that is not libelous (not defamatory in writing/published form).”","zh":"“nonlibelously”表示“以不构成（书面/出版）诽谤的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not libelous; without making written/published false statements that could unfairly harm someone’s reputation.","zh":"以不构成（文字/出版形式的）诽谤的方式；不以可能不公平损害他人名誉的方式表达。"},"examples":[{"en":"The editor rewrote the paragraph so it described the event nonlibelously.","zh":"编辑重写了那段文字，使其以不构成诽谤的方式描述该事件。"},{"en":"You can criticize the policy nonlibelously by focusing on facts and quoting sources accurately.","zh":"你可以通过专注事实并准确引用来源，以不构成诽谤的方式批评该政策。"},{"en":"The review was negative but written nonlibelously, avoiding false claims about the company.","zh":"这篇评论很负面，但写得不构成诽谤，避免了对该公司的不实指控。"}]}],"synonyms":["without defaming","non-defamatorily","in a non-libelous way","fairly","factually"],"phonetic":"/ˌnɑnˈlaɪbələsli/","extraExplanation":["“nonlibelously”比较少见，常见写法是用更自然的表达来替代，例如：“in a non-libelous way / without making libelous statements / without defaming anyone”。","libel（诽谤）通常指“书面/发布的”诽谤；口头诽谤更常用 slander。不同地区与具体法律标准会有差异；日常写作里，避免“把可核查的事实写错”“把猜测当事实”“断言他人犯罪/不道德行为却无证据”等，更容易做到 nonlibelously。","英式拼写常见 libellous / libellously；美式更常见 libelous / libelously，因此 nonlibelously 也多见于美式词形。"]}
{"word":"nonliberal","summary":{"en":"Nonliberal means “not liberal,” especially in political contexts; it can be vague and is sometimes used as a broad label for conservative or not-left views.","zh":"nonliberal 意为“非自由派的/不自由主义的”，多见于政治语境；含义可能较笼统，有时用来泛指偏保守或不偏左的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not liberal; not supporting liberal ideas or liberal politics.","zh":"非自由派的；不支持自由主义理念或自由派政治立场的。"},"examples":[{"en":"The newspaper is known for its nonliberal editorial stance.","zh":"这家报纸以其非自由派的社论立场而闻名。"},{"en":"She studies nonliberal political movements in the 20th century.","zh":"她研究20世纪的非自由派政治运动。"}]},{"partOfSpeech":"adj.","definition":{"en":"In U.S. political talk, a broad label for views seen as not liberal (often implying conservative or right-leaning), depending on context.","zh":"在美国政治语境中，用来笼统指代“不是自由派”的观点（常暗示偏保守或右倾），具体含义取决于上下文。"},"examples":[{"en":"He described the group as nonliberal, but he didn’t explain what policies he meant.","zh":"他把那个团体称为非自由派，但没有说明具体指哪些政策。"},{"en":"Some voters call themselves nonliberal without identifying with a party.","zh":"有些选民自称非自由派，但并不认同某个政党。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is not liberal (less common; often sounds political and may feel blunt).","zh":"非自由派人士（较少见；带明显政治色彩，语气可能显得生硬）。"},"examples":[{"en":"In the debate, liberals and nonliberals disagreed on how to regulate the industry.","zh":"在辩论中，自由派和非自由派对如何监管该行业意见不一。"}]}],"synonyms":["illiberal","conservative (context-dependent)","right-leaning (context-dependent)","anti-liberal (stronger tone)","nonprogressive (context-dependent)"],"phonetic":"/ˌnɑnˈlɪbərəl/","extraExplanation":["“nonliberal”字面意思只是“不是自由派/不自由主义的”，但在现实表达里常常比较含糊：它可能指保守派、威权倾向、反进步立场，或仅仅是“不同意某些自由派观点”。写作或讨论时最好补充具体政策/价值观（例如税收、移民、言论自由、社会福利等），避免标签化。","拼写上既可写作 nonliberal，也常见 non-liberal（加连字符更清晰）。在正式写作中，连字符形式有时更易读。","语气提醒：在政治语境中，用“nonliberal”给人贴标签可能被理解为带立场或带批评；如果想更中性，可以用更具体的描述（如 “conservative-leaning/center-right/traditionalist” 等）。"]}
{"word":"nonliberalism","summary":{"en":"Nonliberalism means opposition to liberalism, or more broadly a lack of liberal ideas or policies.","zh":"nonliberalism 指反对自由主义，或更广义地指缺乏自由主义思想/政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political or social outlook that rejects or is opposed to liberalism (for example, rejecting individual rights, pluralism, free speech protections, or democratic limits on power).","zh":"一种在政治或社会观念上反对“自由主义”的立场（例如反对个人权利、多元主义、言论自由保障，或反对对权力的民主制衡）。"},"examples":[{"en":"Some scholars describe the government’s crackdown on independent media as a turn toward nonliberalism.","zh":"一些学者把政府打压独立媒体描述为转向非自由主义。"},{"en":"Nonliberalism often emphasizes order, tradition, or collective goals over individual freedom.","zh":"非自由主义常把秩序、传统或集体目标置于个人自由之上。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, the absence of liberal ideas or policies in a society or institution.","zh":"更广义地说，指一个社会或机构中缺乏自由主义思想或政策。"},"examples":[{"en":"The school’s strict rules reflect a kind of nonliberalism in its approach to student life.","zh":"这所学校的严格规定在对待学生生活的方式上体现出某种非自由主义。"},{"en":"Critics argue that the law encourages nonliberalism by limiting public protest.","zh":"批评者认为这部法律通过限制公众抗议助长了非自由主义。"}]}],"synonyms":["illiberalism","anti-liberalism","authoritarianism (in some contexts)","reactionary politics (in some contexts)"],"phonetic":"/ˌnɑnˈlɪbərəlɪzəm/","extraExplanation":["“nonliberalism”在英语里不是非常常见的日常词，更常见的相关词是“illiberalism”（非自由主义/反自由主义倾向）。但两者不一定完全等同：有时“non-”只是表示“不是自由主义”，语气可能更中性；“illiberalism”往往带更强的负面评价（如反民主、反多元、限制权利）。","理解时要注意“liberalism”在不同国家语境中的含义会变化：在美国，它常与偏进步的政策立场相关；在政治理论里，它也可指强调个人权利、法治、宪政与自由市场等传统“古典自由主义”价值。因此“nonliberalism”指的到底是哪一种“反对/不采用自由主义”，需要看具体上下文。"]}
{"word":"nonliberation","summary":{"en":"Nonliberation means “not being liberated”—a condition of lacking freedom or release, mostly in formal writing.","zh":"nonliberation 指“未被解放/未获自由”的状态，多用于较正式的写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of not being liberated; lack of freedom or release (often used in academic or political writing).","zh":"未被解放/未获自由的状态；缺乏自由或解除束缚（常见于学术或政治语境）。"},"examples":[{"en":"The author describes the workers’ nonliberation as a result of unfair laws.","zh":"作者把工人的未解放状态描述为不公平法律造成的结果。"},{"en":"Even after the reform, many people still felt a sense of nonliberation.","zh":"即使改革之后，许多人仍感到一种未获自由的状态。"}]}],"synonyms":["lack of freedom","unfreedom","oppression","continued captivity","bondage"],"phonetic":"/ˌnɑnˌlɪbəˈreɪʃən/","extraExplanation":["“nonliberation”由前缀 non-（表示“非/不/没有”）+ liberation（解放、自由、释放）构成，意思直观：lack of liberation（缺乏解放/自由）。在正式写作中有时会写成带连字符的“non-liberation”，更清晰。","它不是日常口语里很常用的词。日常表达更常用：“lack of freedom”（缺乏自由）、“continued oppression”（持续受压迫）、“not being freed/released”（没有被释放/解救）。","语体上偏抽象、概念化，常用于讨论政治解放、社会解放、殖民/后殖民语境或人权议题。"]}
{"word":"nonlibidinous","summary":{"en":"Nonlibidinous means lacking sexual desire or libido.","zh":"nonlibidinous 指“缺乏性欲/性冲动”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having, showing, or relating to sexual desire; lacking libido.","zh":"不具性欲的；不表现出性欲的；与性欲无关的。"},"examples":[{"en":"After starting the new medication, he described himself as almost nonlibidinous.","zh":"开始服用新药后，他形容自己几乎变得没有性欲。"},{"en":"The character is portrayed as nonlibidinous, focusing more on ambition than romance.","zh":"这个角色被塑造成不具性欲的人，比起恋爱更关注野心。"}]}],"synonyms":["unlibidinous","low-libido","sexless","asexual (context-dependent)"],"phonetic":"/ˌnɑn ləˈbɪdɪnəs/","extraExplanation":["这是一个较少见、偏书面/医学语境的词：non-（否定前缀）+ libidinous（有性欲的、好色的）。","常见替代表达有：“low libido / no sex drive”（性欲低/没有性冲动）、“asexual”（无性恋/无性倾向；含义更偏身份认同，不一定等同于一时的性欲低）。","在写作中，用它描述“人”可能带有较强的评判色彩；在医学或心理健康语境里更中性，常用于描述状态或症状。"]}
{"word":"nonlibidinously","summary":{"en":"Nonlibidinously means “in a nonsexual way; without sexual desire.” It’s rare and often replaced by simpler phrases like “not sexually.”","zh":"nonlibidinously 意为“以不带性意味的方式；没有性欲地”。该词较少见，日常更常用 “not sexually / in a nonsexual way”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not sexual; without libido or sexual desire; not lustfully.","zh":"以不带性意味的方式；没有性欲/性冲动地；不淫欲地。"},"examples":[{"en":"They spoke nonlibidinously about the scene, focusing on the lighting and acting.","zh":"他们以不带性意味的方式谈论那场戏，把重点放在灯光和表演上。"},{"en":"He admired her nonlibidinously, as a mentor respects a student’s talent.","zh":"他对她的欣赏不带性欲色彩，更像导师尊重学生的才华。"}]}],"synonyms":["nonsexually","asexually","without sexual desire","not lustfully"],"phonetic":"/ˌnɑn.ləˈbɪd.ə.nəs.li/","extraExplanation":["这个词非常少见，多用于较正式或带一点讽刺/学术腔的语境。日常英语里更常说：“not sexually / without sexual desire / in a nonsexual way”。","构词法：non-（否定前缀，“不/非”）+ libidinous（“性欲强的、好色的”）+ -ly（副词后缀）。因此 nonlibidinously = “以非性欲的方式”。","libidinous 源自拉丁语 libido（“欲望，尤指性欲”）。在文学或评论中，用这个词常用来强调“观看/谈论”某事时刻意避免性化（nonsexualizing）。"]}
{"word":"nonlibidinousness","summary":{"en":"Nonlibidinousness means the state of having little or no sexual desire (low libido).","zh":"nonlibidinousness 指“性欲较低或几乎没有性欲的状态”（性欲缺乏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of having little or no sexual desire (low libido).","zh":"性欲较低或几乎没有性欲的状态；性欲缺乏。"},"examples":[{"en":"Some medications can cause nonlibidinousness as a side effect.","zh":"有些药物可能会把“性欲缺乏”作为副作用。"},{"en":"He spoke openly about his nonlibidinousness and how it affected his relationships.","zh":"他坦诚谈到自己的性欲缺乏，以及它如何影响亲密关系。"}]}],"synonyms":["low libido","lack of sexual desire","sexual disinterest","decreased libido"],"phonetic":"/ˌnɑn.lɪˈbɪd.ə.nəs.nəs/","extraExplanation":["这是一个非常少见、偏学术/医学风格的词。更常见的表达是 **low libido**（性欲低）或 **lack of sexual desire**（缺乏性欲）。","构词法：**non-**（不/无）+ **libidinous**（有性欲的；性冲动的）+ **-ness**（名词后缀，表示“……的状态/性质”）。因此整体字面意思就是“无性欲的状态”。","语境提醒：谈论性欲属于私人话题。正式写作或医疗场景可以用该词或更常见的 low libido；日常交流中建议用更委婉、清晰的说法，避免让对方不适。"]}
{"word":"nonlicensable","summary":{"en":"Nonlicensable means “not able or not allowed to be licensed,” often used in legal, compliance, or software/IP contexts.","zh":"nonlicensable 意为“不可被许可的/不允许被许可的”，常用于法律、合规或软件与知识产权语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be licensed (given official permission or legal authorization), or not allowed to be licensed under rules or law.","zh":"不可被许可的；无法获得许可的（指无法被授予官方许可/法律授权，或依法/依规不允许被许可）。"},"examples":[{"en":"Because the app uses restricted data, the product is nonlicensable in several countries.","zh":"因为该应用使用了受限制的数据，这个产品在一些国家是不可被许可的。"},{"en":"The contract states that the software is nonlicensable to third parties.","zh":"合同规定该软件不得许可给第三方。"}]}],"synonyms":["unlicensable","not licensable","non-authorizable"],"phonetic":"/ˌnɑnˈlaɪsənsəbəl/","extraExplanation":["“nonlicensable”常见于法律、合规、软件授权与知识产权语境。意思通常有两种侧重点：①客观上“无法取得许可”（例如法规不允许、资格不符）；②条款上“不得对外许可/再许可”（例如只允许内部使用）。具体以合同或法规文本为准。","拼写上你也可能见到“non-licensable”（带连字符）或“nonlicensable”。另外，“licensable/licenseable”两种拼写都存在；在美式英语中常见“license”，英式英语常见“licence”（名词）/“license”（动词）。"]}
{"word":"nonlicensed","summary":{"en":"Nonlicensed means not officially licensed or authorized; in most everyday English, unlicensed is more common.","zh":"nonlicensed 表示“无证/未获许可的”；日常英语中更常用 unlicensed。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not having an official license or permission (especially from a government or professional body) to do something","zh":"未取得官方执照/许可的；无资质的（尤指未获政府或行业机构许可）"},"examples":[{"en":"The city shut down a nonlicensed daycare for safety violations.","zh":"市政府因安全违规关闭了一家无证托儿所。"},{"en":"Buying medicine from a nonlicensed seller can be dangerous.","zh":"从无证卖家购买药品可能很危险。"}]}],"synonyms":["unlicensed","unauthorized","unregistered (context-dependent)","illegal (context-dependent)"],"phonetic":"/ˌnɑnˈlaɪsənst/","extraExplanation":["“nonlicensed”不是最常见的拼写，更自然、更常用的是 **unlicensed**（无证的）或写成 **non-licensed**（带连字符，偏正式/技术性写法）。","在日常英语里，**unlicensed**往往更口语、更常见；在政策、法规、分类标签里可能会看到 **non-licensed**（例如“non-licensed provider”）。","注意含义差别：**unlicensed**通常强调“本应需要执照但没有”；而在某些语境中 **non-licensed**也可能仅表示“这一类别不需要执照/不属于持照范围”（具体看上下文）。"]}
{"word":"nonlicentiate","summary":{"en":"Nonlicentiate is a rare word meaning a person who is not a licentiate (not formally authorized/credentialed), and less commonly an adjective meaning “not licentiate.”","zh":"nonlicentiate 是个较罕见的词，主要指“非特许资格者/未获正式授权或认证的人”，较少情况下也可作形容词表示“非特许资格的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is not a licentiate (i.e., not officially authorized or certified, especially in academic, professional, or church contexts).","zh":"非特许资格者；未获正式授权/认证的人（尤指学术、专业或教会体系中未取得“licentiate/特许资格”的人）。"},"examples":[{"en":"Only licentiates may supervise the exam; a nonlicentiate cannot sign the official report.","zh":"只有具备特许资格者才能监考；非特许资格者不能在正式报告上签字。"},{"en":"In the old university rules, nonlicentiates were excluded from certain lectures and privileges.","zh":"在旧式大学规章里，非特许资格者被排除在某些讲座与特权之外。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not holding licentiate status; lacking a formal license or authorization (rare; usually written with a hyphen: non-licentiate).","zh":"（罕见）非特许资格的；未获许可/授权的（多写作 non-licentiate）。"},"examples":[{"en":"The committee rejected the non-licentiate application because the required credential was missing.","zh":"委员会拒绝了这份非特许资格申请，因为缺少所需的资质。"}]}],"synonyms":["unlicensed person","unauthorized person","uncertified person","not credentialed"],"phonetic":"/ˌnɑn lɪˈsɛnʃiət/","extraExplanation":["这个词非常少见，通常是由 non-（“非、没有”）+ licentiate 组合而成。licentiate 在不同体系里含义不同：在一些国家的学术体系中可指介于硕士与博士之间的学位/资格；在宗教/教会语境中也可能指获得讲道或履职许可的人。因此 nonlicentiate 往往出现在历史文件、规章制度或较正式的文献中。","现代英语更常用的表达是 without a license / unlicensed / not credentialed，或直接说 not a licentiate；写法上也更常见 non-licentiate（带连字符）。"]}
{"word":"nonlicentious","summary":{"en":"Nonlicentious means not sexually immoral or overly permissive—modest, decent, and restrained.","zh":"nonlicentious 表示“不淫荡、不放纵”，即端庄得体、克制不过分露骨。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not sexually immoral or overly permissive; modest and restrained in sexual behavior or content.","zh":"不淫荡的；不放纵的；（在性行为或内容上）端庄克制的。"},"examples":[{"en":"The film is romantic but nonlicentious, avoiding explicit scenes.","zh":"这部电影很浪漫，但并不放纵露骨，避免了过于直白的镜头。"},{"en":"They preferred nonlicentious language in public speeches.","zh":"他们更倾向于在公开演讲中使用不低俗、不挑逗的措辞。"}]},{"partOfSpeech":"adj.","definition":{"en":"Free from moral looseness or excess; sober and self-controlled in tone or conduct.","zh":"不放纵的；不轻佻的；（在作风或语气上）严肃自持的。"},"examples":[{"en":"Her writing has a playful wit, but the overall tone remains nonlicentious.","zh":"她的写作带点俏皮机智，但整体语气仍然不轻佻。"}]}],"synonyms":["modest","decent","chaste","proper","restrained"],"phonetic":"/ˌnɑnlaɪˈsɛnʃəs/","extraExplanation":["这个词由 non-（不、非）+ licentious（放纵的、淫荡的）构成，含义基本等于“not licentious”。在现代英语里它不算常用，更常见的表达是 modest（端庄的）、chaste（贞洁的/纯洁的）、decent（得体的）、not explicit（不露骨的）。","licentious 常用来形容“在性方面过于放纵/不道德”，也可更广义指“道德松弛、放任”。因此 nonlicentious 常用于评价作品内容（电影、书、笑话）或言谈举止是否“得体、不低俗”。"]}
{"word":"nonlicentiously","summary":{"en":"Nonlicentiously means “not in a licentious (sexually improper or overly unrestrained) way,” often implying restraint and propriety.","zh":"nonlicentiously 表示“并非放纵/淫荡地（或更广义不过度放任、不过界地）”，强调克制与端庄。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not sexually improper or morally unrestrained; with restraint or chastity.","zh":"以不淫荡、不过度放纵的方式；克制地、端庄地。"},"examples":[{"en":"The director chose to portray the romance nonlicentiously, focusing on emotion rather than explicit scenes.","zh":"导演选择以不放纵的方式呈现这段恋情，把重点放在情感而非露骨场面上。"},{"en":"They lived nonlicentiously, avoiding gossip and scandal in their small community.","zh":"他们生活克制端庄，在小社区里尽量避免流言与丑闻。"}]},{"partOfSpeech":"adv.","definition":{"en":"More generally: in a way that is not excessively free, permissive, or rule-breaking; with self-control.","zh":"更广义地：以不太随意、不纵容或不逾矩的方式；自律地。"},"examples":[{"en":"The satire is sharp but written nonlicentiously, without relying on crude shock value.","zh":"这篇讽刺尖锐，但写得并不粗俗猎奇，而是相对克制。"}]}],"synonyms":["chastely","modestly","decently","respectably","restrainedly"],"phonetic":"/ˌnɑnlaɪˈsɛnʃəsli/","extraExplanation":["这个词比较少见，常见的是形容词/副词的基础形式：licentious（放纵的、淫荡的）/ licentiously（放纵地）。non- 是英语里很常用的否定前缀，表示“非……、不……”。","licentious 最常指“性方面不端/不检点”，也可以泛指“对规则或道德过于放任”。因此 nonlicentiously 通常带有“端庄、不过火、不过界”的语气（多用于文学评论、道德评价或正式写作）。"]}
{"word":"nonlicentiousness","summary":{"en":"Nonlicentiousness means not being sexually/morally licentious—showing restraint and self-control.","zh":"nonlicentiousness 指“不放荡/不纵欲”的状态，即在性或道德层面表现出克制与自制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being licentious; sexual restraint or moral self-control (often in contrast to sexual freedom or immorality)","zh":"不放荡的状态或品质；（常指性方面的）克制、端正或道德自制（常与性放纵/淫乱相对）"},"examples":[{"en":"In the novel, the heroine’s nonlicentiousness is presented as a kind of quiet strength.","zh":"在小说中，女主角的不放荡被描写为一种安静的力量。"},{"en":"The essay praises nonlicentiousness as a virtue valued by the writer’s community.","zh":"这篇文章称赞“不放荡”是一种在作者社群中被重视的美德。"}]}],"synonyms":["sexual restraint","chastity","continence","modesty","moral restraint","self-control"],"phonetic":"/ˌnɑnlaɪˈsɛnʃəsnəs/","extraExplanation":["这个词非常少见、偏书面，通常不会在日常英语里出现；更常用的表达是 **sexual restraint**（性克制）、**chastity**（贞洁/守贞，语气更传统/宗教）、或 **moral self-control**（道德自制）。","它来自形容词 **licentious**（放荡的、纵欲的、道德上不检点的）；加上前缀 **non-** 变成“非……/不……”的意思，再加名词后缀 **-ness** 表示“……的状态/性质”。","使用时要注意语境：它往往带有较强的价值判断（把“克制”视为美德），在不同文化或现代语境中可能显得保守或带评判色彩。"]}
{"word":"nonlicet","summary":{"en":"non licet: a Latin phrase meaning “it is not permitted / not allowed,” mainly used in legal or formal contexts.","zh":"non licet：拉丁語片語，意為「不被允許／不准」，主要見於法律或正式語境。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Latin, used in English legal or formal writing) “It is not permitted / not allowed.”","zh":"（拉丁語，用於英文法律或正式語境）「不被允許／不可以／不准。」"},"examples":[{"en":"The judge noted that under the statute, non licet—such a payment is not permitted.","zh":"法官指出依該法條規定，non licet——這種付款不被允許。"},{"en":"In some older legal texts, the margin simply reads “non licet” to mark a prohibited act.","zh":"在一些較早的法律文本中，頁邊只寫「non licet」來標示某行為被禁止。"}]}],"synonyms":["not permitted","not allowed","prohibited","forbidden","unlawful"],"phonetic":"/ˌnɑn ˈliːsɛt/","extraExplanation":["「non licet」是拉丁語：non（不）+ licet（被允許／合法）。在英文裡多見於法律拉丁語或學術性引用，用來簡潔表示「明文禁止」或「依法不許」。日常英文通常直接說 not allowed / not permitted / prohibited。","注意不要和「non liquet」混淆：non liquet 意思是「尚不明確／無法判定（法律上證據不足或結論未明）」，和「不允許」不同。","相關詞彙：licit（合法的、被允許的）、illicit（非法的、不被允許的）。這兩個是現代英文更常用的對應表達。"]}
{"word":"nonlicit","summary":{"en":"Nonlicit means “not permitted; unlawful,” and it’s a formal word often replaced by “illegal” in everyday English.","zh":"Nonlicit 表示“（法律或规则）不允许的；非法的”，较正式，日常更常说 illegal。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) Not permitted by law or rules; unlawful; illegal.","zh":"（较正式）不被法律或规则允许的；非法的。"},"examples":[{"en":"The company was investigated for nonlicit payments to officials.","zh":"这家公司因向官员进行非法付款而受到调查。"},{"en":"He denied any involvement in nonlicit trading.","zh":"他否认参与任何非法交易。"}]}],"synonyms":["illegal","unlawful","prohibited","illicit"],"phonetic":"/nɑnˈlɪsɪt/","extraExplanation":["“nonlicit”比较少见，语气偏正式，常出现在法律、新闻或学术写作中。日常英语里更常用 illegal / unlawful / prohibited。","词源上可理解为 non-（不）+ licit（合法的、被允许的）。与之相关的常见词还有 illicit（非法的；尤指暗中进行的，比如 illicit drugs）。","你也可能会看到拉丁语/法律用语写作 non licet，字面意思是“it is not allowed（不被允许）”。Dictionary.com 收录了 non licet 这个写法。"]}
{"word":"nonlicking","summary":{"en":"Nonlicking means “not licking.” It’s rare and usually used in technical/veterinary contexts (e.g., animals prevented from licking a wound).","zh":"nonlicking 意为“不舔的”。它较少用于日常英语，多见于技术/兽医语境（如动物被防止去舔伤口）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not licking; (of an animal or person) not using the tongue to lick something","zh":"不舔的；（指动物或人）不去用舌头舔某物的"},"examples":[{"en":"The vet recommended a collar so the dog would be nonlicking while the wound healed.","zh":"兽医建议戴伊丽莎白圈，让狗在伤口愈合期间保持不舔伤口。"},{"en":"The researchers compared medication levels in nonlicking calves and normally licking calves.","zh":"研究人员比较了不舔（被防止舔）的牛犊与正常会舔的牛犊体内的药物水平。"}]}],"synonyms":["not licking","lick-prevented","prevented from licking"],"phonetic":"/nɑnˈlɪkɪŋ/","extraExplanation":["“nonlicking”不是常见日常词，更常见于科研或兽医语境，尤其是描述“被防止去舔”的动物（例如戴了伊丽莎白圈、被隔离或被固定）。","构词很直观：non-（不、非）+ licking（舔的行为）。写作时也常见连字符形式“non-licking”，用来提高可读性。","如果你想表达更自然的日常英语，往往会改写成：“not licking”或“prevented from licking”。"]}
{"word":"nonlife","summary":{"en":"Nonlife means insurance other than life insurance (often called P&C). It can be used as a noun (the business/sector) or an adjective (nonlife products/division).","zh":"nonlife 指“非寿险”，即除寿险之外的保险（常称财产与意外险/P&C）。既可作名词指该业务领域，也可作形容词修饰产品或部门。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Insurance that is not life insurance (for example, auto, home, travel, health, liability); also called property-and-casualty (P&C) insurance.","zh":"非寿险；指除人寿保险以外的保险（如车险、家财险、旅游险、健康险、责任险等），也常称为财产与意外险（P&C）。"},"examples":[{"en":"She works in nonlife insurance, mainly auto and home policies.","zh":"她在非寿险领域工作，主要做车险和家财险保单。"},{"en":"The company plans to grow its nonlife business in Asia this year.","zh":"这家公司计划今年扩大其在亚洲的非寿险业务。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not related to life insurance; describing insurance products or a business unit outside life insurance.","zh":"非寿险的；指与人寿保险无关的（用于描述产品、部门或业务线）。"},"examples":[{"en":"They merged the nonlife division with the health insurance team.","zh":"他们把非寿险事业部与健康险团队合并了。"},{"en":"Nonlife premiums can change quickly after major disasters.","zh":"发生重大灾害后，非寿险保费可能会很快变化。"}]}],"synonyms":["non-life insurance","P&C insurance","property and casualty insurance","general insurance"],"phonetic":"/ˈnɑnˌlaɪf/","extraExplanation":["“nonlife”常见于保险行业语境（公司年报、行业报告、监管文件等），日常口语里更常说“property and casualty (P&C) insurance”或直接说“auto/home insurance”。","非寿险通常按一年或更短周期续保（如车险、房屋险），而寿险往往是长期合同；因此非寿险更容易受到灾害、赔付率、通胀与监管变化的影响。","写法上也常见“non-life”（带连字符）和“nonlife”（合写）；两者含义相同，合写更像行业术语。"]}
{"word":"nonlimitation","summary":{"en":"Nonlimitation means “no restriction” and is most often used in legal/technical writing to show that examples or lists do not limit the broader meaning.","zh":"Nonlimitation 表示“不受限制/无限制”，多用于法律或技术写作中，强调列举的例子并不限制更广泛的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of not being limited; the absence of a restriction or cap","zh":"不受限制；无限制的状态（没有上限或约束）"},"examples":[{"en":"The contract states that the list of examples is for illustration only and implies nonlimitation.","zh":"合同写明这些例子仅用于说明，并不构成限制（暗示“非限制性”）。"},{"en":"They argued for nonlimitation of access to public records, except for privacy concerns.","zh":"他们主张公开记录的获取应不受限制，但需考虑隐私因素。"}]},{"partOfSpeech":"n.","definition":{"en":"(legal/technical writing) wording used to clarify that a statement, category, or list does not restrict the broader meaning (often expressed as “without limitation” or “including, without limitation”)","zh":"（法律/技术写作）用于说明某陈述、类别或清单不缩小整体含义的措辞（常写作“without limitation”或“including, without limitation”）"},"examples":[{"en":"The phrase “including, without limitation” is added to signal nonlimitation of the general rule.","zh":"加入“including, without limitation”这句话，是为了表明一般规则不受该清单限制。"},{"en":"Nonlimitation language helps prevent readers from treating examples as an exhaustive list.","zh":"“非限制性”措辞有助于避免读者把例子当成穷尽列举。"}]}],"synonyms":["lack of limitation","no restriction","unrestrictedness","without limitation","non-limitation"],"phonetic":"/ˌnɑnˌlɪməˈteɪʃən/","extraExplanation":["“nonlimitation”并不是日常英语里很常见的单词，更常见的表达是：\"without limitation\"（不受限制）、\"not limited to\"（不限于）、\"non-limiting\"（非限制性的，用作形容词）。在合同、条款、政策说明里，它常用于强调：后面列举的例子只是举例，并不把范围锁死。","写作中常见结构：\"including (but not limited to) ...\" 或 \"including, without limitation, ...\"。它们的目的都是避免被解读为“只包含这些”。"]}
{"word":"nonlimitative","summary":{"en":"Nonlimitative means “not restricting; only adding extra information or giving examples without limiting the scope.”","zh":"nonlimitative 表示“非限定性的、不起限制作用的；用于补充信息或举例而不缩小范围”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar/linguistics) Not restricting the meaning of the noun it describes; giving extra information that can be removed without changing the core identification (often the same idea as a “nonrestrictive” modifier or clause).","zh":"（语法/语言学）非限定性的；不限制所修饰名词指代范围的；提供附加信息，即使删除也不影响核心所指（常与“非限制性/非限定性定语或从句”同义）。"},"examples":[{"en":"In “My brother, who lives in Seattle, is visiting,” the clause “who lives in Seattle” is nonlimitative information.","zh":"在“My brother, who lives in Seattle, is visiting.”中，“who lives in Seattle”这一从句提供的是非限定性信息。"},{"en":"Nonlimitative relative clauses are usually set off by commas in writing.","zh":"非限定性关系从句在书写中通常用逗号隔开。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Formal, especially legal/technical writing) Not intended to limit the scope of what follows; meant as an example rather than a complete list (often phrased as “non-limiting” or “for example”).","zh":"（正式用语，尤指法律/技术写作）非限制性的；不用于缩小后文范围；所列内容仅作示例而非穷尽（常写作“non-limiting”或用“for example”表达）。"},"examples":[{"en":"The document lists nonlimitative examples of acceptable evidence.","zh":"该文件列出一些可采证据的非限制性示例。"},{"en":"“Including, without limitation …” signals that the list is nonlimitative.","zh":"“including, without limitation …”表示该列表是非限制性的。"}]}],"synonyms":["nonrestrictive","non-limiting","supplementary","parenthetical","nondefining"],"phonetic":"/ˌnɑnˈlɪmɪtətɪv/","extraExplanation":["“nonlimitative”较少见，更常见的表达是语法里的“nonrestrictive（非限制性）”、或法律英语里的“non-limiting（非限制性）”。如果你在论文或语法讲解中使用，通常推荐写“nonrestrictive clause/modifier”。","语法上它常对应中文的“补充说明（非限定）”，与“限定性（restrictive/limitative）”对比：限定性信息用来区分“是哪一个/哪些”，非限定性信息只是补充背景，因此英语里常用逗号隔开。","法律与技术写作里，“non-limiting example(s)”或“including, without limitation”用于避免被解读为“只限于以下几项”，强调“下面只是例子，不是全部”。"]}
{"word":"nonlimiting","summary":{"en":"Nonlimiting means “not necessary to identify the noun”; it adds extra information and is usually separated by commas.","zh":"Nonlimiting 表示“非限定性的”：不用于确定名词指代对象，只补充信息，通常用逗号隔开。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not essential for identifying which person or thing you mean; it adds extra information and is usually set off by commas.","zh":"非限定性的；不是用来确定“是哪一个人/物”的，而是补充说明的信息，通常用逗号隔开。"},"examples":[{"en":"My brother, who lives in Chicago, is visiting next week.","zh":"我哥哥（他住在芝加哥）下周要来拜访。"},{"en":"Paris, which I visited last year, is famous for its museums.","zh":"巴黎（我去年去过）以博物馆闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"In grammar, describing a clause or phrase (especially a relative clause) that gives extra information rather than restricting the meaning of the noun.","zh":"（语法）指（尤其是关系从句等）只提供补充信息、不缩小名词指代范围的结构；即“非限定性从句/短语”。"},"examples":[{"en":"“which was built in 1920” is a nonlimiting clause in “The bridge, which was built in 1920, is still in use.”","zh":"在“The bridge, which was built in 1920, is still in use.”中，“which was built in 1920”是一个非限定性从句。"},{"en":"Nonlimiting information is often surrounded by commas in writing.","zh":"非限定性信息在书写中常用逗号括起来。"}]}],"synonyms":["nonrestrictive","parenthetical"],"phonetic":"/ˌnɑnˈlɪmɪtɪŋ/","extraExplanation":["英语里“limiting (restrictive)”与“nonlimiting (nonrestrictive)”最关键的区别是：去掉后者，句子的核心指代通常不变；去掉前者，读者可能就不知道你指的是哪一个。","常见对比：\n- Restrictive：The students who studied passed.（只说“那些学习了的学生”通过了）\n- Nonrestrictive：The students, who studied, passed.（暗示学生都学习了，并补充说明他们学习了）","标点是重要线索：非限定性从句/短语多用逗号隔开；限定性一般不加逗号。口语中，非限定性信息通常会用停顿/语调变化来体现。"]}
{"word":"nonlineal","summary":{"en":"Nonlineal means “not lineal,” especially in genealogy or law: not a direct ancestor or descendant.","zh":"nonlineal 意为“非直系的”，多用于家谱或法律语境：不是直系祖先或直系后代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Genealogy, law) Not lineal; not in a direct parent→child line (not a direct ancestor or direct descendant).","zh":"（家谱/法律）非直系的；不在父母—子女这一条直接血缘线上（不是直系祖先或直系后代）。"},"examples":[{"en":"A niece is a nonlineal relative, not a lineal descendant.","zh":"侄女/外甥女是非直系亲属，不是直系后代。"},{"en":"The estate was left to nonlineal heirs because there were no children.","zh":"由于没有子女，遗产留给了非直系继承人。"}]}],"synonyms":["collateral (in family relationships)","not lineal"],"phonetic":"/ˌnɑnˈlɪniəl/","extraExplanation":["“nonlineal”比较少见，最常见的语境是家谱、继承、法律文件等，强调“不是直系（lineal）”。","很多学习者会把它和“nonlinear（非线性的）”混淆：nonlinear通常用于数学/科学或叙事结构（非线性叙事），意思是“不是直线/不按顺序”。两者拼写和读音相近，但含义与使用场景完全不同。","lineal（直系的）常见搭配：lineal ancestor（直系祖先）、lineal descendant（直系后代）。与之相对：collateral relative（旁系亲属，如兄弟姐妹、叔伯姑姨等）。"]}
{"word":"nonlinear","summary":{"en":"Nonlinear means not straight or not developing in a simple, proportional, step-by-step way; it’s often used in math/science and storytelling.","zh":"Nonlinear 指“非直线的”，也指“非线性发展”（不按简单比例或按部就班推进），常用于数学/科学及叙事表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not following a straight line; curved or not arranged in a straight path.","zh":"非直线的；不沿直线方向的；弯曲的。"},"examples":[{"en":"The road becomes nonlinear as it climbs the mountain.","zh":"这条路在上山时变得不是直线，而是弯弯曲曲的。"},{"en":"The artist used nonlinear shapes instead of straight edges.","zh":"这位艺术家用非直线的形状，而不是笔直的边缘。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not progressing in a simple, step-by-step way; involving many interacting factors, so small changes can cause big or unpredictable results.","zh":"非线性的（不按简单的线性步骤发展）；受多种因素相互影响，微小变化可能带来巨大或难以预测的结果。"},"examples":[{"en":"Learning a language is nonlinear—progress can speed up or slow down.","zh":"学习语言是非线性的——进步有时会加快，有时会变慢。"},{"en":"In a nonlinear system, a tiny error can grow into a major problem.","zh":"在非线性系统中，一个很小的误差可能会扩大成大问题。"},{"en":"The novel uses a nonlinear timeline, jumping between past and present.","zh":"这部小说采用非线性的时间线，在过去与现在之间跳转。"}]}],"synonyms":["nonstraight","irregular","nonsequential","nonproportional"],"phonetic":"/ˌnɑnˈlɪniər/","extraExplanation":["“nonlinear”常见于数学/物理/工程（nonlinear equation 非线性方程、nonlinear dynamics 非线性动力学），也常用于叙事与写作（nonlinear narrative 非线性叙事），表示不按时间顺序讲故事。","对比记忆：linear 表示“成比例、按顺序、可预测”，nonlinear 则强调“不是简单比例关系/不是一步一步直线推进”。"]}
{"word":"nonlinearities","summary":{"en":"“Nonlinearities” means multiple nonlinear effects or behaviors—cases where input and output do not change proportionally.","zh":"“nonlinearities”指多种**非线性效应/特性**：输入与输出不按比例变化（不是线性关系）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) qualities or behaviors that are **nonlinear**—i.e., situations where a change in input does not produce a proportional, straight-line change in output.","zh":"（复数）**非线性**的特性或现象；即输入的变化不会导致输出按比例（直线关系）变化。"},"examples":[{"en":"In real-world data, nonlinearities often appear when a small change suddenly causes a big effect.","zh":"在真实世界的数据中，**非线性现象**常见，比如一个很小的变化突然引起很大的影响。"},{"en":"Engineers add feedback control to handle nonlinearities in the system.","zh":"工程师会加入反馈控制来处理系统中的**非线性特性**。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math/engineering/ML) departures from a linear model or linear assumption, often treated as effects that must be modeled or corrected.","zh":"（数学/工程/机器学习）偏离线性模型或线性假设的部分，通常被视为需要建模或校正的影响。"},"examples":[{"en":"The model fails because it ignores nonlinearities in customer behavior.","zh":"这个模型之所以失效，是因为它忽略了客户行为中的**非线性因素**。"},{"en":"Neural networks use activation functions to introduce nonlinearities.","zh":"神经网络使用激活函数来引入**非线性**。"}]}],"synonyms":["nonlinear effects","nonlinear behavior","nonlinear relationships","nonlinearity"],"phonetic":"ˌnɑnˌlɪniˈærətiz","extraExplanation":["“nonlinearities”是名词“nonlinearity”的复数，常见于理工科语境（控制系统、信号处理、经济学、机器学习等）。核心意思是：关系不是“成正比/一条直线”。","学习提示：如果你看到“account for / capture / handle nonlinearities”，通常是在说“把非线性因素考虑进去/建模出来/处理掉”。"]}
{"word":"nonlinearity","summary":{"en":"Nonlinearity is the state or behavior of not following a straight-line, proportional relationship; it’s common in science/engineering and can also describe uneven or jumpy progress in stories or learning.","zh":"Nonlinearity 指“非线性”，即不遵循直线、成比例关系的状态或行为；常用于科学/工程，也可引申形容叙事或学习过程的起伏与跳跃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often uncountable) The quality or state of being non-linear—when a relationship between variables is not a straight-line relationship, so outputs don’t change in direct proportion to inputs.","zh":"（常为不可数）非线性：指变量之间的关系不是直线关系，输出不会与输入成正比变化。"},"examples":[{"en":"In climate science, nonlinearity means a small temperature rise can sometimes trigger disproportionately large changes.","zh":"在气候科学中，非线性意味着温度的小幅上升有时可能引发不成比例的巨大变化。"},{"en":"Because of nonlinearity in the system, doubling the force did not double the speed.","zh":"由于系统具有非线性，把力加倍并没有让速度加倍。"}]},{"partOfSpeech":"n.","definition":{"en":"(mathematics, physics, engineering) The behavior of a non-linear system or model, where effects like thresholds, feedback loops, or saturation occur.","zh":"（数学/物理/工程）非线性系统（或模型）的特性/行为：可能出现阈值效应、反馈回路或饱和等现象。"},"examples":[{"en":"Engineers study nonlinearity to prevent sudden instability in bridges and buildings.","zh":"工程师研究非线性，以防桥梁和建筑出现突发的不稳定。"},{"en":"The equation includes a squared term, which introduces nonlinearity into the model.","zh":"这个方程包含平方项，从而把非线性引入模型中。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) A non-straightforward pattern of development, such as a story or learning process that jumps in time or progresses unevenly.","zh":"（引申）不按常规直线推进的发展方式：例如故事时间线跳跃，或学习进度忽快忽慢、起伏前进。"},"examples":[{"en":"The memoir’s nonlinearity mirrors how memory moves between past and present.","zh":"这本回忆录的非线性结构，呼应了记忆在过去与现在之间来回跳转的方式。"},{"en":"Language learning has nonlinearity—you may plateau for weeks and then improve quickly.","zh":"语言学习具有非线性：你可能会停滞几周，然后突然进步很快。"}]}],"synonyms":["non-linearity","nonlinear behavior","nonlinear effect"],"phonetic":"/ˌnɑnˌlɪniˈærɪti/","extraExplanation":["词形提示：nonlinearity = non-（不）+ linear（线性的）+ -ity（名词后缀）。学术写作里也常见拼写 non-linearity / nonlinearity，两者意思相同。","常见搭配：nonlinearity in the system/model（系统/模型的非线性）；introduce nonlinearity（引入非线性）；due to nonlinearity（由于非线性）。","引申用法多见于叙事与心理领域：nonlinear narrative（非线性叙事）、nonlinear thinking（跳跃式/发散式思考）。"]}
{"word":"nonlinearly","summary":{"en":"Nonlinearly means “in a non-linear way,” not straight, not constant-rate, or not in a simple sequence.","zh":"nonlinearly 表示“以非线性的方式”，即不直线、不匀速、或不按简单顺序推进。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not linear—i.e., not following a straight line, not changing at a constant rate, or not proceeding step by step in a simple sequence.","zh":"以非线性的方式；即不沿直线、不以恒定速度变化，或不按简单的线性顺序一步步推进。"},"examples":[{"en":"The relationship between stress and performance can change nonlinearly.","zh":"压力与表现之间的关系可能会以非线性的方式变化。"},{"en":"Prices don’t always rise steadily; sometimes they move nonlinearly with sudden jumps.","zh":"价格并不总是稳定上升；有时会以非线性的方式波动，出现突然跳跃。"},{"en":"In the novel, the story unfolds nonlinearly, switching between past and present.","zh":"在这部小说中，故事以非线性的方式展开，在过去与现在之间切换。"}]}],"synonyms":["not linearly","in a nonlinear manner","irregularly (context-dependent)","unevenly (context-dependent)"],"phonetic":"/ˌnɑnˈlɪniɚli/","extraExplanation":["“nonlinearly”常见于三类语境：\n1）数学/科学：表示变量关系不是一条直线（比如翻倍的输入不一定带来翻倍的输出）。\n2）商业/数据：表示增长或变化不稳定、不是匀速的（可能有拐点、加速、突变）。\n3）叙事/影视：表示叙事顺序不是按时间从头到尾，而是穿插回忆、倒叙、跳叙等。\n\n写作上，它比“not in a straight line”更正式、更学术。"]}
{"word":"nonlinguistic","summary":{"en":"Nonlinguistic means “not involving language,” such as gestures, facial expressions, or sounds like laughter.","zh":"nonlinguistic 指“非语言的”，如手势、表情，或笑声等不靠词语表达的声音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving language (words, grammar, or speech); not expressed through spoken or written language.","zh":"非语言的；不涉及语言（词语、语法或言语）的；不用口头或书面语言表达的。"},"examples":[{"en":"The teacher used nonlinguistic cues like pointing and facial expressions to help beginners understand.","zh":"老师用指指点点和面部表情等非语言线索来帮助初学者理解。"},{"en":"A smile is a nonlinguistic signal that can show friendliness.","zh":"微笑是一种可以表达友好的非语言信号。"},{"en":"The study looked at nonlinguistic sounds, such as laughter and crying.","zh":"这项研究考察了笑声、哭声等非语言声音。"}]}],"synonyms":["nonverbal","nonlexical","extralinguistic","paralinguistic"],"phonetic":"/ˌnɑn.lɪŋˈɡwɪs.tɪk/","extraExplanation":["“non-”是英语里常见的前缀，表示“非、不是”。所以 nonlinguistic 就是“不是语言本身的”。它常用来描述：手势、表情、眼神、姿势、语调以外的身体线索；或不靠词语传递的信息（例如图表、符号、图片）。","注意区分：nonlinguistic（不涉及语言）与 nonverbal（不说话的/非言语的）。nonverbal 更常指沟通方式（如肢体语言），而 nonlinguistic 更强调“语言系统（词和语法）之外”。"]}
{"word":"nonlinkage","summary":{"en":"Nonlinkage means a lack of connection or association; in genetics, it means genes are not linked and tend to assort independently.","zh":"nonlinkage 指“缺乏连接或关联”；在遗传学中指“基因不连锁，倾向于独立分离/自由组合”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of not being linked, connected, or associated; lack of connection between things.","zh":"不连接；无关联；缺乏联系的状态。"},"examples":[{"en":"The report highlighted the nonlinkage between housing costs and local wages.","zh":"报告强调了房价与当地工资之间缺乏关联。"},{"en":"Because of poor record-keeping, there was nonlinkage between the two databases.","zh":"由于记录不完善，这两个数据库之间无法建立关联。"}]},{"partOfSpeech":"n.","definition":{"en":"(Genetics) The absence of genetic linkage—genes are not inherited together more often than expected by chance (typically because they are on different chromosomes or far apart).","zh":"（遗传学）不连锁：基因之间不存在遗传连锁关系——它们不会比随机情况更常一起遗传（通常因为位于不同染色体上，或相距很远）。"},"examples":[{"en":"The experiment showed nonlinkage between the two traits, suggesting the genes are on different chromosomes.","zh":"实验显示这两个性状不连锁，提示相关基因可能在不同染色体上。"},{"en":"Nonlinkage is consistent with independent assortment during meiosis.","zh":"不连锁与减数分裂中的自由组合相一致。"}]}],"synonyms":["lack of connection","disconnection","absence of linkage","independent assortment (genetics, related concept)"],"phonetic":"ˌnɑnˈlɪŋkɪdʒ","extraExplanation":["这个词更常见的写法是加连字符的 **non-linkage**，尤其在学术写作里；不加连字符的 **nonlinkage** 也能见到，但相对少。","在遗传学语境中，**linkage（连锁）** 指基因倾向于一起遗传；**nonlinkage（不连锁）** 则表示“没有这种倾向”，通常意味着它们在不同染色体上，或在同一染色体上但距离很远，从而更接近随机分离的结果。"]}
{"word":"nonlipoidal","summary":{"en":"“Nonlipoidal” means not lipoidal—not made of or like lipids (fats).","zh":"“nonlipoidal”表示“非脂类的”，即不由脂质构成、也不像脂质（脂肪/类脂）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not lipoidal; not consisting of, containing, or resembling lipids (fats or fat-like substances).","zh":"非脂类的；不由脂质（脂肪或类脂物质）构成、不含脂质或不像脂质的。"},"examples":[{"en":"The lab used a nonlipoidal solvent to avoid dissolving the lipid membrane.","zh":"实验室使用了非脂类溶剂，以避免溶解脂质膜。"},{"en":"Some drugs are designed to be more nonlipoidal so they stay in watery (aqueous) environments longer.","zh":"有些药物会被设计得更“非脂类”，以便在水性环境中停留更久。"}]}],"synonyms":["nonlipid","non-lipid","non–lipid-based","fat-free (context-dependent)"],"phonetic":"/ˌnɑn.laɪˈpɔɪ.dəl/","extraExplanation":["“nonlipoidal”多见于医学、药学、生化等语境，用来描述某种物质的性质与“脂质/类脂（lipoidal）”相反，强调它更偏向水溶性或不与脂质结构相似。","构词很透明：non-（不、非）+ lipoidal（脂质的、类脂的）。在现代写作中，也常见更直观的表达如“nonlipid / non-lipid”或“not lipid-based”，但在专业文献里“nonlipoidal”仍会出现。"]}
{"word":"nonliquefiable","summary":{"en":"Nonliquefiable means “not able to be liquefied,” and it can also describe soil that will not undergo liquefaction during shaking.","zh":"nonliquefiable 指“无法被液化的”，也可指岩土工程中“不会发生土体液化的（不易液化的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not capable of being liquefied (turned into a liquid).","zh":"不能被液化的；无法变成液体的。"},"examples":[{"en":"Because of its chemical structure, the material is essentially nonliquefiable under normal conditions.","zh":"由于其化学结构，这种材料在正常条件下基本无法被液化。"},{"en":"The waste was treated as nonliquefiable, so it had to be handled as a solid rather than pumped.","zh":"这种废弃物被视为无法液化，因此必须按固体处理，不能用泵输送。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geotechnical/earthquake engineering) Not susceptible to soil liquefaction (the soil will not behave like a fluid during shaking).","zh":"（岩土/地震工程）不易发生土体液化的；不会在震动时像流体一样失去强度的。"},"examples":[{"en":"The dense gravel layer was considered nonliquefiable during the seismic hazard assessment.","zh":"在地震危险性评估中，这层密实砾石被认为不易液化。"},{"en":"Engineers focused mitigation on the liquefiable zone, since the upper layer was nonliquefiable.","zh":"工程师把加固重点放在可液化层，因为上覆土层不易液化。"}]}],"synonyms":["not readily liquefied","not capable of being liquefied","non-liquefying"],"phonetic":"ˌnɑn lɪˈkwifiəbəl","extraExplanation":["这个词比较少见，结构上是 non-（否定前缀）+ liquefiable（可液化的），意思就是“不可液化的”。一般写作更常见的是 nonliquid / non-liquid（非液体的），而 nonliquefiable 更强调“无法变成液体”而不只是“现在不是液体”。([merriam-webster.com](https://www.merriam-webster.com/dictionary/nonliquid?utm_source=openai))","在岩土工程里，liquefiable / nonliquefiable 常用于讨论“土体液化”（地震时土像液体一样失去承载力）。因此 nonliquefiable 往往不是指化学上“不能液化”，而是指“在特定地震荷载与条件下不发生液化”。([sciencedirect.com](https://www.sciencedirect.com/science/article/pii/S0025322724001816?utm_source=openai))","拼写提示：它和 nonliquid（非液体的）不同；也不要和 nonliquefied（未被液化的，强调过程没发生）混淆。([en.wiktionary.org](https://en.wiktionary.org/wiki/nonliquefying?utm_source=openai))"]}
{"word":"nonliquefying","summary":{"en":"“Nonliquefying” means not liquefying—staying solid/not turning into liquid, or not causing liquefaction.","zh":"“nonliquefying”表示“不液化的”——不会变成液体，或不会使其发生液化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not liquefying; not becoming liquid (or not causing something to become liquid).","zh":"不液化的；不变成液体的（或：不使某物液化的）。"},"examples":[{"en":"Under these conditions, the gas remains nonliquefying even at high pressure.","zh":"在这些条件下，即使在高压下，这种气体仍不液化。"},{"en":"They used a nonliquefying additive to keep the mixture from turning runny during storage.","zh":"他们使用了一种不使其液化的添加剂，以防混合物在储存期间变稀。"}]}],"synonyms":["non-liquefying","not liquefying","nonmelting","nonsolvent"],"phonetic":"ˌnɑnˈlɪkwəˌfaɪɪŋ","extraExplanation":["这个词由 non-（“不、非”）+ liquefy（“使液化/液化”）+ -ing 组成，常见于化学、材料学、食品加工、低温/高压等语境，用来描述“在某条件下不会变成液体”或“不会让别的物质变成液体”的性质。","英语里更常见、更自然的表达通常是 non-liquefying（带连字符）或 does not liquefy / will not liquefy（用句子说明）。在正式科技写作中，这类复合形容词很常见。"]}
{"word":"nonliquid","summary":{"en":"Nonliquid means “not liquid,” especially in technical or scientific contexts.","zh":"Nonliquid 指“非液体的/不处于液态的”，多用于技术或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not liquid; not in a liquid state (often used in science or technical writing).","zh":"非液体的；不处于液态的（常用于科学或技术语境）。"},"examples":[{"en":"At room temperature, salt is a nonliquid substance.","zh":"在室温下，盐是一种非液体物质。"},{"en":"The spill contained both liquid and nonliquid waste.","zh":"这次泄漏包含液体和非液体废弃物。"},{"en":"The material can be heated until it changes from nonliquid to liquid.","zh":"这种材料可以加热到从非液态变为液态。"}]}],"synonyms":["solid","nonsolid (context-dependent)","not in liquid form"],"phonetic":"/nɑnˈlɪkwɪd/","extraExplanation":["“non-”是英语里表示“不是/非”的常见前缀，所以 nonliquid 字面意思就是“非液体”。在化学、材料科学、环保（废弃物分类）等场景里更常见。","日常英语里，人们更常说 solid（固体）或 gas（气体）来具体说明“不是液体”，而不是用 nonliquid 这种更“分类式/技术式”的说法。"]}
{"word":"nonliquidating","summary":{"en":"Nonliquidating means “not involving liquidation”—the business continues, and assets aren’t sold off to wind things up.","zh":"nonliquidating 指“非清算的”：企业继续存在运作，资产不被变卖以结束公司。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving liquidation (not selling off assets and closing a business); continuing to operate rather than being wound up.","zh":"非清算的；不涉及清算（不把资产变现并关闭企业）；指企业继续经营而非被解散清盘。"},"examples":[{"en":"The company chose a nonliquidating reorganization, so it could keep operating while restructuring its debts.","zh":"公司选择了非清算式重组，因此可以在重整债务的同时继续经营。"},{"en":"In a nonliquidating scenario, assets are usually kept and managed instead of being sold immediately.","zh":"在非清算情形下，资产通常会被保留并继续管理，而不是立刻出售。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Finance/Tax) Describing a distribution or transaction that does not require selling assets (for example, a “nonliquidating distribution” made by a corporation to its shareholders).","zh":"（金融/税务）描述一种不需要出售资产的分配或交易（例如公司向股东进行的“非清算分配”）。"},"examples":[{"en":"The board approved a nonliquidating distribution of shares to existing shareholders.","zh":"董事会批准向现有股东进行非清算式的股票分配。"},{"en":"This dividend was structured as nonliquidating, meaning the firm did not have to sell core assets to pay it.","zh":"这笔股息被设计为非清算式，这意味着公司不必出售核心资产来支付。"}]}],"synonyms":["ongoing","continuing","not wound up","non-winding-up","going-concern"],"phonetic":"/ˌnɑnˈlɪkwɪˌdeɪtɪŋ/","extraExplanation":["“nonliquidating”主要出现在商业、会计与税务语境里。它强调“没有进入清算程序、没有把资产变卖来结束公司”，而是公司仍然持续存在并运作。","常见搭配：nonliquidating distribution（非清算分配）、nonliquidating reorganization（非清算重组）。和 liquidating（清算式的）相对。","词形结构：non-（否定前缀）+ liquidating（清算/变现的）。注意这里的 liquidate 不是“液体”的意思，而是“把资产变现、清算”。"]}
{"word":"nonliquidation","summary":{"en":"Nonliquidation means not liquidating—either not converting assets to cash / not carrying out a liquidation, or not settling a debt/claim to a definite paid amount (mainly finance/legal use).","zh":"Nonliquidation 指“不进行清算/不变现”，或（在金融法律语境中）“债务/索赔未结清、未定额并支付”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or situation of not liquidating—i.e., not converting assets into cash or not winding up and distributing assets","zh":"不清算；不变现（指不把资产变为现金，或不进行公司/资产清算并分配）"},"examples":[{"en":"The lender rejected the plan because it relied on nonliquidation of key assets.","zh":"贷款方否决了该方案，因为它依赖于关键资产不进行变现。"},{"en":"In bankruptcy talks, the parties argued over whether nonliquidation would protect jobs.","zh":"在破产谈判中，各方争论“不清算”是否能保护就业。"}]},{"partOfSpeech":"n.","definition":{"en":"(finance/legal) failure to settle, pay, or “liquidate” a debt/claim by reducing it to a definite paid amount","zh":"（金融/法律）未结清债务或索赔；未把债务/赔偿“清算为确定金额并支付/结案”"},"examples":[{"en":"Nonliquidation of the claim delayed the final settlement for months.","zh":"该索赔长期未结清，导致最终和解拖延了数月。"},{"en":"Repeated nonliquidation can trigger penalties under the contract.","zh":"反复未结清款项可能会触发合同罚则。"}]}],"synonyms":["non-liquidation","failure to liquidate","nonpayment","unliquidated (related)"],"phonetic":"/ˌnɑnˌlɪkwɪˈdeɪʃən/","extraExplanation":["“nonliquidation”并不是日常英语里很常见的词，更常见的写法是带连字符的 **non-liquidation**，或用更常用的相关词来表达：例如 **unliquidated**（未结清/未定额的）、**nonpayment**（未付款）、**failure to liquidate**（未进行清算/变现）。","在法律与金融语境里，**liquidation** 既可以指“把资产变现并分配（清算）”，也可以指“把损害赔偿/债务确定为一个具体金额（定额）”。因此 **nonliquidation** 会因语境不同而对应“未变现/未清算”或“未结清/未定额”。"]}
{"word":"nonliquidly","summary":{"en":"Nonliquidly (rare) means “in a non-liquid form,” and sometimes “in an illiquid (non-cash) way” in finance.","zh":"nonliquidly（罕见）意为“以非液体形式”，在金融语境中也可指“以非现金、流动性差的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare) In a way that is not in liquid form; as a solid or non-liquid substance.","zh":"（罕见）以非液体的方式；以固体或非液态物质的形态。"},"examples":[{"en":"Add the flour nonliquidly first, then pour in the milk slowly.","zh":"先把面粉以非液体（固体）的形式加入，再慢慢倒入牛奶。"},{"en":"The airline requires toiletries to be packed nonliquidly (e.g., as a solid deodorant).","zh":"航空公司要求洗漱用品尽量以非液体形式携带（例如固体止汗剂）。"}]},{"partOfSpeech":"adv.","definition":{"en":"(finance, rare) In an illiquid / non-cash form; in a way that is not easily converted to cash.","zh":"（金融，罕见）以非现金、流动性差的形式；以不易迅速变现的方式。"},"examples":[{"en":"Much of their wealth is held nonliquidly in real estate and private businesses.","zh":"他们的大部分财富以非流动形式持有，集中在房地产和私营企业中。"},{"en":"The donation was given nonliquidly, as shares rather than cash.","zh":"这笔捐赠以非现金形式给出，是股票而不是现金。"}]}],"synonyms":["in solid form","not in liquid form","as a solid","illiquidly (finance)"],"phonetic":"ˌnɑnˈlɪkwɪdli","extraExplanation":["“nonliquidly”在现代英语里非常少见，很多词典不收录；写作中更常用、更自然的表达是：\n- 物质/烹饪语境：\"as a solid\"（以固体形式）、\"in solid form\"（以固态形式）、\"not in liquid form\"（非液体形式）\n- 金融语境：\"illiquidly\"（以缺乏流动性的方式）、\"in illiquid assets\"（以非流动资产形式）或直接说 \"held in nonliquid/illiquid assets\"。\n如果你是在读到它或想在正式写作中使用，建议根据语境换成以上更常见的说法。"]}
{"word":"nonlister","summary":{"en":"A rare historical word for a non-listing adding machine (totals without printing each item).","zh":"一个很少见的历史词，指“不打印明细的加法机/算账机”（只出合计）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A non-listing adding machine (a calculating machine that shows totals but does not print each item/line of the calculation).","zh":"（历史用语）一种“不打印明细的加法机/算账机”（只显示合计，不把每一笔计算明细逐行打印出来的计算机器）。"},"examples":[{"en":"In the 1930s office, a clerk might use a nonlister to total receipts quickly without printing every line.","zh":"在20世纪30年代的办公室里，文员可能会用 nonlister 快速把收据金额加总，但不逐行打印每一笔明细。"},{"en":"The company replaced its nonlister with a newer listing machine for detailed audit trails.","zh":"这家公司用更新的“可打印明细”的算账机替换了原来的 nonlister，以便审计时能追踪每一笔记录。"}]}],"synonyms":["non-listing adding machine","adding machine","calculator"],"phonetic":"/ˈnɑnˌlɪstɚ/","extraExplanation":["这个词非常少见，主要出现在早期办公设备/会计设备的语境里。这里的 lister 指“会列出（打印）明细的机器”；nonlister 就是不列印（不 listing）明细的型号。","如果你想表达“没被列在名单上的人”，现代英语更常说 not on the list / unlisted person / someone who isn’t listed；nonlister 通常不会这样用。"]}
{"word":"nonlisting","summary":{"en":"Nonlisting means something is not listed, or the condition of not being listed (often used in real estate or catalogs/directories).","zh":"Nonlisting 指“未被列出/未收录的事物”，也可指“未被列出”的状态（常见于房地产或目录/名录语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something that is not listed (for example, a property, product, or company that does not appear in an official list or on a public platform).","zh":"未被列入名单的事物（例如房产、商品或公司没有出现在官方名单或公开平台上）。"},"examples":[{"en":"The buyer found a nonlisting through a private agent, so it wasn’t shown on the main website.","zh":"买家通过私人中介找到了一套未公开挂牌的房源，所以主流网站上看不到。"},{"en":"Our report excludes nonlistings because we only analyze items that appear in the catalog.","zh":"我们的报告不包含未列入目录的项目，因为我们只分析目录里出现的条目。"}]},{"partOfSpeech":"n.","definition":{"en":"the state or fact of not being listed; absence from a list or directory.","zh":"未被列出（的状态或事实）；未出现在名单/目录中。"},"examples":[{"en":"The restaurant’s nonlisting made it hard for tourists to find.","zh":"这家餐馆没有被收录，游客很难找到。"}]}],"synonyms":["unlisted item","not listed","off-market (real estate)"],"phonetic":"/ˌnɑnˈlɪstɪŋ/","extraExplanation":["“nonlisting”更常见的写法是带连字符的“non-listing”。在房地产语境中，它常指“未公开挂牌/非公开房源”（类似 off-market listing 的概念）。在一般语境里，它也可以指“未被目录收录的条目/未列名的对象”。"]}
{"word":"nonliteracy","summary":{"en":"Nonliteracy means not being able to read and write, and sometimes it can also mean lacking a specific type of literacy (like digital literacy).","zh":"Nonliteracy 指“不识字/缺乏基本读写能力”，有时也可泛指缺乏某种特定的“素养/能力”（如数字素养）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of not being able to read and write; lack of basic reading/writing skills","zh":"不识字；文盲状态；缺乏基本读写能力"},"examples":[{"en":"The program provides adult classes to reduce nonliteracy in rural areas.","zh":"这个项目在农村地区提供成人课程，以减少不识字现象。"},{"en":"Nonliteracy can limit job options, especially in places where applications are online.","zh":"不识字会限制就业选择，尤其是在需要网上申请的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"more broadly, a lack of knowledge or skill in a specific kind of “literacy” (for example, digital literacy or financial literacy)","zh":"（更广义）在某种“素养/能力”方面的缺乏（如数字素养、金融素养）"},"examples":[{"en":"Digital nonliteracy makes it hard for some seniors to use online health services.","zh":"数字素养不足使一些老年人难以使用线上医疗服务。"}]}],"synonyms":["illiteracy","inability to read and write","lack of literacy"],"phonetic":"/ˌnɑnˈlɪtərəsi/","extraExplanation":["“nonliteracy”在日常英语里不算常见；更常用的说法是“illiteracy”（文盲/不识字）或“lack of literacy”。在写作里用“nonliteracy”往往带有更正式、学术或政策讨论的语气。","如果你想强调“识字的人口/不识字的人口”这种类别对比，也可以看到“literate / nonliterate（或 non-literate）”这种形容词搭配。"]}
{"word":"nonliteral","summary":{"en":"Nonliteral describes language that is not meant word-for-word; it’s figurative or symbolic.","zh":"nonliteral 指表达不是按字面理解，而是比喻或象征的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not meant to be understood in a strict, exact, word-for-word way; often figurative, symbolic, or metaphorical.","zh":"不是按字面、逐字逐句去理解的；常指比喻的、象征的或隐喻的表达。"},"examples":[{"en":"When she said “I’m drowning in work,” it was nonliteral—she just meant she was extremely busy.","zh":"她说“我快被工作淹死了”是非字面意思，只是表示她忙到不行。"},{"en":"Many poems use nonliteral language to create images and emotions.","zh":"很多诗歌会用非字面语言来营造画面和情绪。"},{"en":"Don’t take his joke literally; it’s nonliteral.","zh":"别把他的玩笑当真，那是非字面表达。"}]}],"synonyms":["figurative","metaphorical","symbolic","not literal"],"phonetic":"/ˌnɑnˈlɪt(ə)rəl/","extraExplanation":["“nonliteral”常用在阅读理解、文学分析和日常沟通里，用来提醒你：这句话不是“照字面翻译/理解”。它和“figurative（比喻的）”很接近。","区分小技巧：literal=字面真实发生（例如“外面在下雨”）；nonliteral=用夸张/比喻表达感受或强调（例如“下得像倒水一样”）。","常见搭配：nonliteral language（非字面语言）、nonliteral meaning（非字面含义）、nonliteral interpretation（非字面解读）。"]}
{"word":"nonliterality","summary":{"en":"Nonliterality means not being literal—meaning is intended or understood figuratively, indirectly, or humorously rather than word-for-word.","zh":"Nonliterality 指“非字面性”：表达或理解不按字面，而是用比喻、含蓄、幽默等方式传达真实意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not being literal; expressing or understanding meaning in a figurative, symbolic, humorous, or indirect way rather than by exact word-for-word meaning.","zh":"非字面性；指表达或理解时不按字面意思，而采用比喻、象征、幽默、含蓄等方式传达意义的特性。"},"examples":[{"en":"Sarcasm often depends on nonliterality—you say one thing, but you mean another.","zh":"讽刺常常依赖非字面性——你说的是一回事，真正的意思是另一回事。"},{"en":"In poetry, nonliterality helps simple words carry deeper emotions and images.","zh":"在诗歌中，非字面性让简单的词语承载更深的情感与画面。"},{"en":"The AI struggled with nonliterality and answered the joke as if it were a serious question.","zh":"这个 AI 不太能处理非字面性，把玩笑当成严肃问题来回答。"}]}],"synonyms":["nonliteral meaning","figurative meaning","figurative language","indirectness","implication"],"phonetic":"/ˌnɑnˌlɪtəˈræləti/","extraExplanation":["“nonliterality”不是最常见的日常用词，更常见的说法是“figurative language（比喻性语言）”“nonliteral meaning（非字面含义）”或在语用学里说“implicature（含意）/ indirectness（间接性）”。但它在语言学、文学批评、认知科学、幽默研究中是有用的概括性术语。","当你看到夸张（I’ve told you a million times）、习语（break the ice）、隐喻（time is money）、反语/讽刺（Great job… when someone fails）、双关（pun）时，通常都在处理“nonliterality”。关键训练点是：结合语境、说话者意图和语气来判断“真正意思”。"]}
{"word":"nonliterally","summary":{"en":"Nonliterally means “not literally”—used to show a statement is figurative or exaggerated, not word-for-word true.","zh":"nonliterally 表示“不是字面意思”，用来说明一句话是比喻或夸张，而非按字面真实发生。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a figurative or exaggerated way; not in the exact, word-for-word sense (used to show that something is not truly literal).","zh":"以比喻或夸张的方式；并非按字面真实发生（用来强调“不是字面意思”）。"},"examples":[{"en":"I was nonliterally dying of laughter—I just couldn’t stop laughing.","zh":"我简直是“非字面意义上”笑到快死了——我真的停不下来。"},{"en":"The room was nonliterally freezing, but it felt extremely cold.","zh":"房间并不是“字面上”结冰那种冷，但确实冷得要命。"}]}],"synonyms":["figuratively","not literally","in a figurative sense"],"phonetic":"/nɑnˈlɪtərəli/","extraExplanation":["“nonliterally”并不是最常见的日常用词；在口语里，人们更常用“not literally”或直接用“figuratively”。但在网络/聊天语境中，用“nonliterally”可以更快地表明“我是在夸张/比喻”。","注意语气与场合：在正式写作中，通常建议用“figuratively”或改写句子来避免误解。","和“literally”相关的用法常引发讨论：有些人会用“literally”做强调（其实是夸张），如果你想避免争议，用“nonliterally / not literally / figuratively”会更清楚。"]}
{"word":"nonliteralness","summary":{"en":"Nonliteralness means the quality of not being literal—using figurative or indirect meaning.","zh":"Nonliteralness 指“非字面性”，即表达或理解偏向比喻、象征或含蓄的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or degree of being nonliteral—using words in a figurative, symbolic, or indirect way rather than in their exact, dictionary meaning.","zh":"“非字面性；不按字面理解的程度”：指语言表达偏向比喻、象征或含蓄，而不是按词典里的字面意思来理解。"},"examples":[{"en":"Poetry often relies on nonliteralness to create deeper meaning through metaphor and image.","zh":"诗歌常常依靠“非字面性”，通过隐喻和意象来产生更深层的意义。"},{"en":"The phrase “break the ice” shows nonliteralness, because it is about starting conversation, not actually breaking ice.","zh":"短语“break the ice”体现了“非字面性”，因为它指打开话题，而不是真的去把冰打碎。"}]}],"synonyms":["figurative meaning","non-literal meaning","figurative language","indirectness","metaphoricity"],"phonetic":"/ˌnɑnˈlɪtərəl.nəs/","extraExplanation":["“nonliteralness”不是特别常见的日常词，更常见的表达是“nonliteral meaning”（非字面含义）、“figurative language”（修辞/比喻性语言）、“non-literal interpretation”（非字面解读）。在学术写作或语言学讨论里，你可能会见到它用来强调“非字面程度”。","构词上：non-（不）+ literal（字面的）+ -ness（名词后缀，表示“性质/状态”）。因此它直观地表示“非字面这种性质”。"]}
{"word":"nonliterarily","summary":{"en":"“Nonliterarily” means “in a non-literary (plain, factual) way,” though it’s uncommon in everyday English.","zh":"“nonliterarily”指“以非文学（更直白、偏事实）的方式”，但在日常英语中并不常用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a non-literary way; not in the style of literature (for example, speaking plainly or focusing on facts rather than artistic language).","zh":"以非文学的方式；不采用文学（文艺性）表达风格（例如更直白、更注重事实而非修辞与意境）。"},"examples":[{"en":"If you explain it nonliterarily, the problem is just about time and money.","zh":"如果你用非文学的方式解释，这个问题其实就是时间和金钱。"},{"en":"She wrote about the event nonliterarily, like a report, not a story.","zh":"她用非文学的写法写这件事，更像报道，而不是故事。"}]}],"synonyms":["plainly","straightforwardly","factually","in plain terms","in a non-literary way"],"phonetic":"/ˌnɑnˈlɪtərˌɛrəli/","extraExplanation":["“nonliterarily”不是特别常见的词；在日常英语里更常用的是“in a non-literary way / in plain terms / literally (in the ordinary sense)”。如果你想表达“不是比喻、不是引申义，而是字面意思”，通常用“literally”（例如：I mean it literally.）。","注意它与“literally”的区别：\n- nonliterarily：强调“表达风格不文学、不文艺”，偏向写作/表达方式。\n- literally：强调“按字面意思”，与是否文学风格无关。"]}
{"word":"nonliterariness","summary":{"en":"Nonliterariness means the quality of being nonliterary—plain, functional, or not related to literature.","zh":"Nonliterariness 指“非文学性”：不具文学风格、偏朴素功能性或与文学无关的特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being nonliterary (not written in a literary style, or not connected with literature).","zh":"“非文学性；非文学特征”：指某种事物或文字不具文学风格、或与文学无关的性质或状态。"},"examples":[{"en":"The report’s nonliterariness makes it clear and practical, but not emotionally moving.","zh":"这份报告的非文学性让它清晰实用，但不太能打动情感。"},{"en":"She criticized the article for its nonliterariness, saying it read like a manual.","zh":"她批评这篇文章缺乏文学性，说它读起来像说明书。"},{"en":"In class, we compared the nonliterariness of a news brief with the language of a short story.","zh":"课堂上，我们对比了新闻简讯的非文学性与短篇小说的语言。"}]}],"synonyms":["nonliterary quality","plainness","functional style","matter-of-factness","prosaicness"],"phonetic":"/ˌnɑnˈlɪtərɛrinəs/","extraExplanation":["这是一个非常少见、偏学术的抽象名词，常见于文体学（stylistics）、修辞学或写作评论中。日常英语里更常用的表达通常是：\"a nonliterary style\"（非文学风格）、\"plain/functional writing\"（朴素/功能性写作）、\"not literary\"（不具文学性）。","构词法：non-（否定前缀）+ literary（文学的）+ -ness（名词后缀，表示“……的性质/状态”）→ nonliterariness（非文学性）。也有人更倾向写作与使用 \"nonliterary quality\" 来避免这个较笨重的词。"]}
{"word":"nonliterary","summary":{"en":"Nonliterary means not related to literature or not written in a literary (artistic) style; it often describes practical or factual texts like reports and manuals.","zh":"nonliterary 表示“非文学的；不具文学风格的”，常用来形容报告、新闻、说明书等偏实用或事实性的文本。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to literature (especially imaginative writing like novels, poems, plays), or not having a “literary” style.","zh":"非文学的；不属于文学（尤指小说、诗歌、戏剧等想象性写作）的；不具有“文学风格”的。"},"examples":[{"en":"The article is written in a clear, nonliterary style so everyone can understand it.","zh":"这篇文章用清晰的非文学风格写成，所以大家都能读懂。"},{"en":"Her research focuses on nonliterary texts such as speeches and newspaper reports.","zh":"她的研究关注演讲、新闻报道等非文学文本。"}]},{"partOfSpeech":"adj.","definition":{"en":"About practical, factual, or technical writing rather than artistic expression.","zh":"（指写作/内容）偏实用、事实或技术性，而非艺术表达的。"},"examples":[{"en":"This class teaches nonliterary writing like emails, reports, and instructions.","zh":"这门课教授邮件、报告、说明书等非文学写作。"},{"en":"The manual uses nonliterary language: short sentences and simple vocabulary.","zh":"这本手册使用非文学语言：句子短、词汇简单。"}]}],"synonyms":["nonfiction (often related, but not identical)","factual","practical","technical","informational"],"phonetic":"/nɑnˈlɪtərɛri/","extraExplanation":["“non-”是表示否定的前缀，意思是“非……”。所以 nonliterary = “非文学的”。","在学术或教学语境里，nonliterary 常用来区分 literary texts（文学文本）与 nonliterary texts（非文学文本），后者通常指新闻、传记、说明书、广告、演讲、法律/政策文件等。","注意：nonliterary 并不一定是贬义。它常常只是描述“目的更偏信息传达/实用”，而不是追求修辞与艺术效果。"]}
{"word":"nonliterate","summary":{"en":"Nonliterate means unable to read or write, or (in some contexts) not involving written text.","zh":"nonliterate 指“不识字/不会读写的”，也可指“非文字的、不依赖书面文字的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to read or write (sometimes used as a more neutral alternative to “illiterate”).","zh":"不识字的；不会读写的（有时被用作比 illiterate 更中性/委婉的说法）。"},"examples":[{"en":"Some older adults in the village were nonliterate and signed forms with a thumbprint.","zh":"村里一些年长者不识字，就用按手印的方式在表格上签名。"},{"en":"The clinic provides nonliterate-friendly instructions with pictures and simple symbols.","zh":"这家诊所提供对不识字者友好的说明，用图片和简单符号来表达。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not involving reading or writing; not based on written text.","zh":"非文字的；不涉及阅读或书写的；不以书面文字为基础的。"},"examples":[{"en":"The study included nonliterate tasks, like matching shapes and patterns.","zh":"这项研究包含非文字任务，比如匹配形状和图案。"},{"en":"They used a nonliterate teaching method that relies on demonstrations and practice.","zh":"他们采用一种非文字的教学方法，主要靠示范和练习。"}]}],"synonyms":["illiterate","unable to read and write","low-literacy","limited literacy","non-text-based"],"phonetic":"/nɑnˈlɪtərət/","extraExplanation":["在日常交流中，形容“不会读写的人”时，nonliterate 常被认为比 illiterate 更不带评判色彩，但仍然可能让人不舒服。更尊重、也更具体的说法常见有：“can’t read or write (in English)”（不会用某种语言读写）、“has limited literacy”（读写能力有限）、“needs help with reading”（阅读需要帮助）。","nonliterate 也常出现在教育、医疗、社会服务、研究等语境里，用来强调“材料/任务不依赖文字”，例如 nonliterate instructions（非文字说明）或 nonliterate measures（非文字测量）。"]}
{"word":"nonlitigated","summary":{"en":"Nonlitigated means something has not been taken to court or decided through a lawsuit.","zh":"nonlitigated 指“未进入诉讼程序、未通过打官司解决”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not settled or decided by a lawsuit; not taken to court","zh":"未通过诉讼解决的；未提交法院审理的"},"examples":[{"en":"Most customer complaints are resolved through refunds and apologies, not through nonlitigated disputes.","zh":"大多数客户投诉会通过退款和道歉解决，而不是变成未诉讼解决的纠纷。"},{"en":"The report focuses on nonlitigated claims handled by the company’s internal review process.","zh":"该报告重点讨论由公司内部审核流程处理的未进入诉讼程序的索赔。"}]}],"synonyms":["not litigated","out-of-court","settled without litigation","nonjudicial","uncontested"],"phonetic":"/ˌnɑnˈlɪtɪˌɡeɪtɪd/","extraExplanation":["“non-”是英语里非常常见的否定前缀，表示“非……/不……”。因此 nonlitigated = not litigated（没有被起诉/没有打官司处理）。","这个词多见于法律、保险、合规、企业风险管理等正式语境，用来区分“已诉讼（litigated）”与“未诉讼（nonlitigated）”的案件、索赔或争议。日常英语里更常说：not taken to court / resolved without going to court。"]}
{"word":"nonlitigation","summary":{"en":"Nonlitigation means “not involving court lawsuits,” often describing legal work like contracts, compliance, and negotiation done outside court.","zh":"nonlitigation 指“非诉讼的/非诉事务”，常用于描述在法院之外进行的法律工作，如合同、合规、谈判与和解等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving a lawsuit or court case; handled outside the court system","zh":"非诉讼的；不涉及起诉或法院案件的（在法院体系之外处理的）"},"examples":[{"en":"The firm’s nonlitigation work includes contract drafting and legal advice for businesses.","zh":"这家律所的非诉讼业务包括起草合同以及为企业提供法律咨询。"},{"en":"They tried to resolve the dispute through nonlitigation methods like negotiation.","zh":"他们尝试通过谈判等非诉讼方式解决纠纷。"}]},{"partOfSpeech":"n.","definition":{"en":"legal work or dispute resolution that is done without going to court","zh":"非诉讼事务；不通过法院进行的法律工作或纠纷解决"},"examples":[{"en":"She practices mostly nonlitigation, focusing on compliance and corporate governance.","zh":"她主要做非诉讼业务，专注于合规和公司治理。"}]}],"synonyms":["non-litigation","out-of-court","pre-litigation (related)","transactional (related)","ADR (related)"],"phonetic":"/ˌnɑnˌlɪtɪˈɡeɪʃən/","extraExplanation":["在法律英语里更常见的写法是 **non-litigation**（带连字符），尤其当它放在名词前作定语时：non-litigation matters / non-litigation services。也常用 **nonlitigious**（更偏“不会引发诉讼的、非好讼的”）来形容人或行为。","“非诉讼”通常涵盖：合同起草与审查、谈判与和解、合规（compliance）、尽职调查（due diligence）、仲裁/调解等替代性争议解决（ADR）手段（注意：仲裁/调解有时也可能与法院程序产生联系，但一般仍被归为“非诉讼/诉讼之外”的路径）。","相关常见搭配：nonlitigation practice（非诉业务）、nonlitigation department（非诉部门）、resolve a dispute without litigation（不诉讼解决纠纷）、pre-litigation negotiation（诉前谈判）。"]}
{"word":"nonlitigious","summary":{"en":"Nonlitigious means not likely to sue or solve problems through lawsuits.","zh":"nonlitigious 指“不太会打官司/不倾向用诉讼解决问题”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not likely to start a lawsuit or take legal action; not eager to argue through the courts.","zh":"不爱打官司的；不太可能提起诉讼或采取法律行动的。"},"examples":[{"en":"We’re looking for a nonlitigious solution so both sides can move on quickly.","zh":"我们在寻找一种不爱打官司的解决方案，让双方都能尽快往前走。"},{"en":"The company prefers a nonlitigious approach, like mediation, before considering court.","zh":"这家公司更倾向于不爱打官司的做法，比如先调解，再考虑上法庭。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a person, culture, or environment where lawsuits are uncommon or discouraged.","zh":"形容个人、文化或环境：诉讼较少、较不鼓励打官司的。"},"examples":[{"en":"They grew up in a nonlitigious community where disputes were settled informally.","zh":"他们在一个不爱打官司的社区长大，纠纷通常用非正式方式解决。"},{"en":"Some people think small towns can feel more nonlitigious than big cities.","zh":"有些人觉得小城镇可能比大城市更不爱打官司。"}]}],"synonyms":["not prone to sue","non-suing","not lawsuit-happy","nonadversarial (related)"],"phonetic":"/ˌnɑn.ləˈtɪdʒ.əs/","extraExplanation":["“nonlitigious”由前缀 non-（不、非）+ litigious（好诉讼的、爱打官司的）构成。","常见搭配：nonlitigious approach（不诉诸法律的处理方式）、nonlitigious settlement（非诉讼和解）、a nonlitigious person（不爱打官司的人）。","语气提示：这是比较正式/书面的词，常见于商业、合同、政策讨论中。日常口语里更常说 “not the suing type” 或 “doesn’t like to sue.”"]}
{"word":"nonlitigiously","summary":{"en":"“Nonlitigiously” means “without going to court; not by suing.”","zh":"“nonlitigiously”表示“非诉讼地；不通过打官司（起诉）来处理”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not involve legal action (a lawsuit) or is not inclined to sue; without being contentious in court.","zh":"以不涉及诉讼（打官司）的方式；不爱起诉、不过度用法律对抗地。"},"examples":[{"en":"The two companies agreed to resolve the dispute nonlitigiously through mediation.","zh":"两家公司同意通过调解以非诉讼方式解决纠纷。"},{"en":"They handled the contract problem nonlitigiously to preserve their business relationship.","zh":"他们以非诉讼方式处理合同问题，以维护商业关系。"}]}],"synonyms":["out of court","without litigation","amicably","through mediation","informally"],"phonetic":"/ˌnɑnˌlɪˈdɪdʒəsli/","extraExplanation":["这个词由 non-（不、非）+ litigiously（诉讼地）构成，意思是“不要走打官司这条路”。在日常英语里比较少见，更常用的表达是 “without litigation / out of court / through mediation / amicably / informally”。","常见搭配：resolve/settle a dispute nonlitigiously（以非诉讼方式解决争端）、handle matters nonlitigiously（以非诉讼方式处理事务）。多用于商务、合同、纠纷处理等语境。"]}
{"word":"nonlitigiousness","summary":{"en":"Nonlitigiousness means a tendency to avoid suing or going to court to settle disputes.","zh":"Nonlitigiousness 指“不爱打官司/不倾向诉讼”的特质，即倾向用协商、调解等方式解决纠纷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or tendency of not bringing lawsuits or legal claims; a reluctance to sue (or to resolve disputes through courts)","zh":"不爱打官司；不倾向于提起诉讼（更倾向于避免通过法院解决纠纷）的特质"},"examples":[{"en":"The company’s nonlitigiousness helped it maintain long-term partnerships with suppliers.","zh":"这家公司不爱打官司的作风，帮助它与供应商维持了长期合作关系。"},{"en":"Her nonlitigiousness led her to seek mediation instead of filing a lawsuit.","zh":"她不倾向诉讼，因此选择调解而不是起诉。"}]}],"synonyms":["reluctance to sue","aversion to litigation","preference for settlement","conciliatory approach"],"phonetic":"/ˌnɑn.ləˈtɪ.dʒəs.nəs/","extraExplanation":["这个词比较少见，通常出现在法律、商业管理或社会学语境中，用来描述个人、组织或文化“倾向于不诉讼”的特征。","构词法：non-（否定前缀）+ litigious（好诉讼的、爱打官司的）+ -ness（名词后缀），字面意思就是“非好诉讼之状态/性质”。","语体与替换：正式写作里可用 nonlitigiousness；日常表达更常说 “not very litigious,” “reluctant to sue,” 或 “prefers negotiation/mediation.”"]}
{"word":"nonliturgic","summary":{"en":"Nonliturgic means “not part of a formal religious liturgy or worship service.”","zh":"nonliturgic 指“非礼仪的；不属于宗教正式礼拜仪式的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to a liturgy (a formal, set order of public worship); not used in formal religious services.","zh":"非礼仪的；不属于（或不用于）宗教正式礼拜仪式的。"},"examples":[{"en":"The choir performed a nonliturgic piece during the concert, not during Mass.","zh":"合唱团在音乐会上演唱了一首非礼仪作品，而不是在弥撒中演唱。"},{"en":"The book includes both liturgic prayers and nonliturgic reflections for personal reading.","zh":"这本书既收录礼仪祷文，也收录适合个人阅读的非礼仪性默想。"},{"en":"The bishop approved the text for study, but not for liturgic or nonliturgic worship settings.","zh":"主教批准该文本用于学习研究，但不用于任何礼拜场合（无论礼仪或非礼仪）。"}]}],"synonyms":["nonliturgical","extra-liturgical","devotional (context-dependent)"],"phonetic":"/ˌnɑn.ləˈdʒɝː.dʒɪk/","extraExplanation":["“nonliturgic”由前缀 non-（不、非）+ liturgic（礼仪的）构成，常见于宗教、音乐与神学语境，用来区分“礼拜仪式中按规定使用的内容”（liturgic）与“用于音乐会、讲座、个人灵修或一般宗教主题创作的内容”（nonliturgic）。","在英语里更常见的拼写是“nonliturgical”。“nonliturgic”也能用，但相对少见，写作时可根据所在传统或出版物习惯选择。"]}
{"word":"nonliturgical","summary":{"en":"Nonliturgical means “not used in or connected to formal worship services (liturgy).”","zh":"nonliturgical 指“非礼仪的”，即不用于或不涉及正式公共礼拜仪式（礼仪流程）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to, used in, or intended for formal public worship services (the liturgy) of a church or other religious tradition.","zh":"不属于礼仪的；与（教会等宗教传统的）正式公共崇拜仪式无关的；不用于礼拜礼仪的。"},"examples":[{"en":"The church held a nonliturgical concert to raise money for local charities.","zh":"教会举办了一场非礼仪性质的音乐会，为本地慈善机构筹款。"},{"en":"They met for a nonliturgical prayer gathering rather than a formal service.","zh":"他们举行的是一次非礼仪性的祷告聚会，而不是正式的礼拜仪式。"}]},{"partOfSpeech":"adj.","definition":{"en":"In religious music or writing: not written for use within a formal worship service (for example, a hymn or text meant for personal devotion or concerts).","zh":"（宗教音乐/写作）不为礼仪中使用而创作的；偏个人灵修或音乐会用途的。"},"examples":[{"en":"Some composers wrote both liturgical and nonliturgical choral works.","zh":"有些作曲家既写礼仪合唱作品，也写非礼仪合唱作品。"}]}],"synonyms":["nonritual","extracurricular (church context)","informal (worship-related)"],"phonetic":"/ˌnɑn.lɪˈtɝ.dʒɪ.kəl/","extraExplanation":["non- 是常见前缀，表示“非……/不……”。liturgical 来自 liturgy（礼仪），指宗教团体（尤其基督教传统中）按固定程序进行的公共崇拜仪式。nonliturgical 常用来区分：一类活动/音乐/文字是“礼拜仪式内部使用”的（liturgical），另一类是“宗教相关但不属于仪式流程”的（nonliturgical），例如讲座、慈善活动、音乐会、团契聚会、个人灵修读物等。","在一些语境里，nonliturgical 并不表示“不宗教”，而是强调“不属于正式礼仪/不按礼仪书规定使用”。如果你想表达“世俗的/非宗教的”，更常用 secular 或 nonreligious。"]}
{"word":"nonliturgically","summary":{"en":"Nonliturgically means “not as part of a formal religious service or liturgy; outside official worship use.”","zh":"nonliturgically 表示“非礼仪性地；不作为正式宗教礼拜仪式的一部分/在礼拜之外”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not related to formal religious worship (a liturgy), or outside an official worship service.","zh":"以不属于（或不涉及）正式宗教礼拜仪式（礼仪）的方式；在正式礼拜之外。"},"examples":[{"en":"The choir also performs nonliturgically at community concerts.","zh":"合唱团也会在社区音乐会上进行非礼仪性的演出（不属于礼拜仪式的一部分）。"},{"en":"Candles were used nonliturgically to create a calm atmosphere in the hall.","zh":"蜡烛在这里被用于非礼仪性的用途，用来营造大厅里平静的氛围。"}]}],"synonyms":["outside of worship","extra-liturgically","non-ritually"],"phonetic":"/ˌnɑn.lɪˈtɝː.dʒɪ.kəli/","extraExplanation":["“nonliturgically”较少见，多用于宗教研究、教会音乐、历史或写作中，用来对比“liturgically（礼仪性地）”。意思通常不是“反宗教”，而是“不是礼拜仪式的一部分/不按礼仪用途”。","词形结构：non-（否定前缀，表示“非”）+ liturgical（礼仪的）+ -ly（副词后缀）。对应形容词是“nonliturgical（非礼仪的）”。"]}
{"word":"nonlive","summary":{"en":"Nonlive means “not live” or “not in real time,” especially for TV, radio, or online broadcasts.","zh":"nonlive 指“非直播/非实时”，常用于电视、广播或网络播出内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not live; not happening in real time (e.g., recorded, pre-produced, or delayed).","zh":"非直播的；不是实时发生的（如录播、预先制作或延时播出）。"},"examples":[{"en":"The interview was nonlive, so it was edited before it aired.","zh":"这段采访不是直播的，所以播出前做了剪辑。"},{"en":"Some sports highlights are shown in a nonlive format on social media.","zh":"一些体育集锦会以非直播的形式在社交媒体上发布。"}]}],"synonyms":["not live","pre-recorded","recorded","taped","delayed"],"phonetic":"/nɑnˈlaɪv/","extraExplanation":["“nonlive”常见于媒体/广播语境，意思是“不是直播”。更自然、更常用的表达通常是“not live”“pre-recorded（录播的）”“recorded（录制的）”“taped（录像的）”“delayed（延时播出的）”。","拼写上，“nonlive”有时也会写作“non-live”。如果你是在写正式英文（新闻稿、论文、简历等），一般建议用更常见的“pre-recorded / recorded / not live”，读者更容易理解。"]}
{"word":"nonlives","summary":{"en":"“Nonlives” is the plural of “nonlife,” meaning the absence of life; it’s rare in everyday English and is more common in wordplay or literary/fantasy writing.","zh":"“nonlives”是“nonlife”的复数，意思是“无生命/缺乏生命”。它在日常英语中较少见，更常出现在文字游戏或文学/奇幻语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **nonlife**: the absence of life; states or conditions of not being alive (or things considered “without life”).","zh":"**nonlife** 的复数：无生命；不具备生命的状态（或被视为“没有生命”的事物/状态）。"},"examples":[{"en":"In the museum, the fossils felt like reminders of ancient lives and long nonlives.","zh":"在博物馆里，化石像是在提醒人们：曾经的生命与漫长的无生命状态。"},{"en":"The story contrasts the warmth of life with the cold silence of nonlives.","zh":"这个故事把生命的温暖与无生命的冰冷寂静作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Fantasy / horror, less common) “undead” or unnatural states of existence—lives that are no longer truly alive.","zh":"（奇幻/恐怖语境，较少见）指“不死/亡灵”等不自然的存在状态——不再真正属于生命的“活着”。"},"examples":[{"en":"The novel describes vampires as trapped in endless nonlives.","zh":"小说把吸血鬼描写成被困在无尽的“非生命”之中。"},{"en":"He feared not death, but the possibility of a nonlife—and the nonlives that follow.","zh":"他害怕的不是死亡，而是沦为“非生命”的可能，以及随之而来的“非生命的日子”。"}]}],"synonyms":["nonliving states","lifelessness","deadness","inanimacy"],"phonetic":"/ˈnɑnˌlaɪvz/","extraExplanation":["“nonlives”在日常英语里非常少见，多数人会用更自然的说法，比如 **nonliving things**（无生命的东西）、**inanimate objects**（无生物/无生命的物体）、或直接说 **death / deadness**（死亡/死寂）来表达类似意思。","你可能会在文字游戏（例如 Scrabble 词表）或较文学化、象征性的写作中看到它。作为复数形式，它来自 **nonlife**（non- “非/无” + life “生命”）。","在奇幻/恐怖作品里，**nonlife** 有时被作者用来指“亡灵般的存在状态”，例如吸血鬼、巫妖（lich）等；这是一种风格化用法，不是标准日常用词。"]}
{"word":"nonliving","summary":{"en":"Nonliving means “not alive,” especially for things like rocks, water, and air; it can also mean “lifeless” when describing a person’s expression or voice.","zh":"Nonliving 指“无生命的”，常用于科学语境（如岩石、水、空气等非生物）；也可形容人的神态或声音“无生气”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not alive; lacking life.","zh":"无生命的；非生物的。"},"examples":[{"en":"Rocks, water, and air are nonliving parts of the environment.","zh":"岩石、水和空气是环境中的非生物部分。"},{"en":"The scientist compared living cells with nonliving material.","zh":"科学家将活细胞与非生物材料进行了比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not having the qualities of a living person; lifeless or without energy (often describing someone’s voice, face, or expression).","zh":"缺乏活人的神采；无生气的（常形容声音、表情、神态等）。"},"examples":[{"en":"His eyes looked nonliving after the long, exhausting night.","zh":"经历了漫长而疲惫的一夜后，他的眼神显得很无神。"},{"en":"She answered in a nonliving voice, as if she were far away.","zh":"她用一种很无生气的声音回答，仿佛心不在焉。"}]}],"synonyms":["inanimate","lifeless","dead (for once-living things)","nonbiological"],"phonetic":"/ˌnɑnˈlɪvɪŋ/","extraExplanation":["“nonliving”常见于科学/课本语境，尤其是生态学里把环境分成“living things（生物）”和“nonliving things（非生物）”。在日常口语中，如果想表达“死的/没有生命”，更常用“dead”或“lifeless”（例如：a lifeless body）。","构词上：non-（否定前缀）+ living（有生命的）→ nonliving（无生命的）。"]}
{"word":"nonlixiviated","summary":{"en":"Nonlixiviated means “not leached”: water has not washed out the soluble minerals/salts.","zh":"nonlixiviated 指“未被浸滤/淋洗的”：水没有把可溶性矿物质/盐分冲刷溶出带走。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Not lixiviated; not leached—meaning the soluble minerals/salts have not been washed out by water.","zh":"（专业用语）未被浸滤的；未被淋洗的——指可溶性矿物质/盐分没有被水冲刷、溶出并带走。"},"examples":[{"en":"The soil layer remained nonlixiviated because rainfall was low and drainage was limited.","zh":"由于降雨少、排水受限，这一土层仍保持未被淋洗的状态。"},{"en":"Nonlixiviated ore can retain more soluble components than heavily leached material.","zh":"未被浸滤的矿石往往比强烈淋洗的物质保留更多可溶性成分。"}]}],"synonyms":["unleached","not leached","unleached (soil)","non-leached"],"phonetic":"/ˌnɑn.lɪkˈsɪvi.eɪ.tɪd/","extraExplanation":["“non-”是否定前缀，表示“非、未”。词根来自“lixiviate（浸滤/淋洗）”，常见于土壤学、地质学、采矿与环境科学语境，用来描述水对物质的“淋洗/溶出”作用没有发生或发生很少。","相关搭配常见：nonlixiviated soil（未淋洗土）、nonlixiviated horizon（未淋洗土层）；对应概念：lixiviated / leached（已浸滤/已淋洗）。","拼写提示：这个词非常少见，学术写作中更常用“unleached（未淋洗的）”或“not leached（没有被淋洗）”，表达更通用、读者更容易理解。"]}
{"word":"nonlixiviation","summary":{"en":"Nonlixiviation means no (or prevented) leaching/lixiviation—water does not wash dissolved substances out of a material.","zh":"nonlixiviation 指不发生（或被防止的）浸滤/淋溶：水没有把可溶物质从材料中淋洗带走。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence or prevention of lixiviation (leaching)—i.e., when water does not wash dissolved substances (such as salts, nutrients, or chemicals) out of a material like soil, ore, or waste.","zh":"不发生或被防止的“浸滤/淋溶”（lixiviation）：指水没有把可溶物质（如盐分、养分或化学物质）从土壤、矿石或废料中淋洗带走。"},"examples":[{"en":"In arid climates, nonlixiviation can cause salts to build up near the soil surface.","zh":"在干旱气候中，非浸滤（nonlixiviation）可能导致盐分在土壤表层附近累积。"},{"en":"The lining system is designed to promote nonlixiviation of contaminants from the landfill into groundwater.","zh":"该衬层系统旨在防止污染物从填埋场浸滤进入地下水。"}]}],"synonyms":["no leaching","absence of leaching","prevented leaching","lack of lixiviation"],"phonetic":"/nɑnˌlɪkˌsɪv.iˈeɪ.ʃən/","extraExplanation":["这个词更像是“non-（不、非）+ lixiviation（浸滤/淋溶）”的技术性拼接词，在常见英语词典里不太常见。写作或报告里，往往会更自然地写成：“no leaching / absence of leaching / prevented leaching”。","lixiviation 在环境与化学语境里通常指“水穿过材料，把可溶组分溶出并带走”的过程；因此 nonlixiviation 常用来强调“没有发生浸出/淋失”或“通过工程措施被抑制”。"]}
{"word":"nonlocal","summary":{"en":"Nonlocal means “not local”—coming from outside the immediate area; in science it means an effect depends on a wider region; in programming it can mean a variable from an outer scope.","zh":"nonlocal 表示“非局部/非本地的”：来自近处范围之外；在科学中强调效应依赖更大区域；在编程中可指来自外层作用域的变量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not local; relating to influences, relationships, or information that come from a distance rather than from the immediate area.","zh":"非局部的；指影响、关系或信息来自远处，而不是来自“就近/本地”的区域。"},"examples":[{"en":"The weather here is affected by nonlocal climate patterns in the Pacific Ocean.","zh":"这里的天气会受到太平洋非局部气候模式的影响。"},{"en":"The city’s economy depends on nonlocal tourism during the summer.","zh":"这座城市的经济在夏季依赖非本地游客带来的旅游收入。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Physics/engineering) Describing an effect at one point that depends on conditions at other points, not only on the immediate surroundings.","zh":"（物理/工程）非局域的；指某一点的效应取决于其他位置的条件，而不只取决于该点周围的局部环境。"},"examples":[{"en":"In some materials, the response is nonlocal, depending on the structure around it.","zh":"在一些材料中，响应是非局域的，会依赖其周围更大范围的结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/computing, especially programming languages) Referring to a variable or name that is not defined in the current local scope, but in an enclosing or outer scope.","zh":"（数学/计算机，尤指编程语言）非局部的；指变量或名称不在当前局部作用域中定义，而是在外层（封闭/上层）作用域中定义。"},"examples":[{"en":"In Python, you can use the keyword nonlocal to modify a variable in an enclosing function.","zh":"在 Python 里，你可以用关键字 nonlocal 来修改外层函数中的变量。"},{"en":"The bug came from changing a nonlocal variable without realizing other functions used it too.","zh":"这个问题来自于修改了一个非局部变量，却没意识到其他函数也在使用它。"}]}],"synonyms":["nonlocal","non-local (adj., alternate spelling)","external","remote","far-reaching","non-neighboring"],"phonetic":"ˌnɑnˈloʊkəl","extraExplanation":["词形拆解：non-（否定前缀，表示“非/不”）+ local（局部的/本地的）。所以 nonlocal 的核心感觉是“不是只看眼前这一小块”。","在日常英语里，nonlocal 常用来描述“外地来的影响/因素”（如 nonlocal visitors 非本地游客）。在学术语境（物理、数学）里更常见，用来强调“结果依赖更大范围的信息”。","在 Python 中，nonlocal 是一个关键字（keyword），只用于嵌套函数：声明某个变量来自“外层函数作用域”，从而允许在内层函数里重新赋值。它不同于 global（全局），global 指模块级全局变量。"]}
{"word":"nonlocalizable","summary":{"en":"Nonlocalizable describes something that cannot be adapted for a particular language or region, especially in software/translation.","zh":"Nonlocalizable 指“不可本地化的”，即无法针对特定语言或地区进行适配，常见于软件与翻译语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be localized—i.e., it cannot be adapted for a specific place, language, or region (often used in software and translation contexts).","zh":"不可本地化的；无法针对特定地区/语言/文化进行本地化适配的（常用于软件与翻译语境）。"},"examples":[{"en":"The error messages are nonlocalizable because they are hard-coded into the image file.","zh":"这些报错信息不可本地化，因为它们被硬编码在图片文件里。"},{"en":"The product name is treated as nonlocalizable, so we keep it the same in every language.","zh":"产品名被视为不可本地化，因此在所有语言中都保持不变。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not able to be tied to one specific location or place (a less common, broader meaning).","zh":"无法归属于某一具体地点的；不易定位到单一地点的（较少见、较宽泛的含义）。"},"examples":[{"en":"Some smells feel nonlocalizable—you can sense them, but you can’t tell where they come from.","zh":"有些气味让人觉得不可定位：你闻得到，但说不清来自哪里。"}]}],"synonyms":["untranslatable","hard-coded","not adaptable","region-agnostic (context-dependent)"],"phonetic":"/ˌnɑnˈloʊkəˌlaɪzəbəl/","extraExplanation":["“nonlocalizable”最常见于本地化（localization, L10n）/国际化（internationalization, i18n）领域。它通常指某段内容或资源无法方便地翻译或按地区习惯调整，例如：文字被做进图片、日期/货币格式写死、字符串拼接导致语序无法调整等。","构词法：non-（否定前缀）+ localize（使本地化）+ -able（可……的）→ “不可本地化的”。在技术文档里也常见写法为“non-localizable”（带连字符）。"]}
{"word":"nonlocalized","summary":{"en":"Nonlocalized means “not limited to one specific place.” It’s also used for diffuse medical symptoms and for software that isn’t localized for a region or language.","zh":"nonlocalized 表示“非局部的、不局限于某一特定地点/部位的”。它也常用于医学（症状不易定位）以及软件领域（未本地化）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not limited to one specific place, area, or location; not confined to a single region.","zh":"非局部的；不局限于某一特定地点或区域的。"},"examples":[{"en":"The pollution problem is nonlocalized, affecting cities and rural areas alike.","zh":"这个污染问题是非局部的，城市和农村都受到影响。"},{"en":"In many online communities, trends can spread in a nonlocalized way.","zh":"在许多线上社群中，潮流可能以非局部的方式传播。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Not clearly coming from one specific spot in the body; diffuse rather than pinpoint.","zh":"（医学）非局限于某一处的；疼痛或症状不易定位、较弥散的。"},"examples":[{"en":"He reported nonlocalized abdominal pain that moved around.","zh":"他描述腹痛不易定位，而且会到处变化。"},{"en":"Nonlocalized symptoms can make diagnosis more challenging.","zh":"非局限性的症状会让诊断更具挑战。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing) Not adapted for a particular language or region; not made for local settings (the opposite of localized).","zh":"（计算机）未本地化的；未针对特定语言或地区进行适配的（与 localized 相对）。"},"examples":[{"en":"The app still shows some nonlocalized error messages in English.","zh":"这个应用仍有一些未本地化的报错信息是英文的。"},{"en":"They are replacing nonlocalized resources with localized versions for each market.","zh":"他们正在用面向各市场的本地化版本替换未本地化资源。"}]}],"synonyms":["nonlocal","diffuse","widespread","generalized","unlocalized"],"phonetic":"/ˌnɑnˈloʊkəˌlaɪzd/","extraExplanation":["“nonlocalized”由 non-（不、非）+ localized（局部的／本地化的）构成。它既可以指“地理/范围上不局限于一处”，也常见于医学语境（疼痛或症状不易定位），以及软件语境（未做语言与地区适配）。","常见搭配：nonlocalized pain（不易定位的疼痛）、nonlocalized infection（非局部性感染）、nonlocalized resources/strings（未本地化资源/字符串）。"]}
{"word":"nonlocally","summary":{"en":"Nonlocally means “not in a local/limited-to-one-place way,” often used in technical contexts to mean “depending on distant points or the whole system.”","zh":"nonlocally 表示“以非局部的方式（不局限于某一地点/范围）”，在技术语境中常指“由远处点或整体系统决定”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not local; involving or relating to something far away or not limited to one place.","zh":"以非局部的方式；不局限于某一地点，涉及远处或跨越不同位置。"},"examples":[{"en":"The company manages its teams nonlocally, with staff working across multiple time zones.","zh":"这家公司以非本地的方式管理团队，员工分布在多个时区工作。"},{"en":"Changes to this setting can affect the system nonlocally, not just the current page.","zh":"对这个设置的更改可能会以非局部的方式影响系统，而不只是当前页面。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Science/Math) In a way that depends on distant points or the whole system, rather than only nearby conditions.","zh":"（科学/数学）以“非局部”的方式；依赖远处点或整体系统，而非仅由邻近条件决定。"},"examples":[{"en":"In some models, the value at a point is determined nonlocally by an integral over a region.","zh":"在一些模型中，一个点的数值会由对某个区域的积分以非局部方式决定。"},{"en":"The particles appear to be correlated nonlocally in the experiment.","zh":"在实验中，这些粒子似乎表现出非局部相关性。"}]}],"synonyms":["globally","at a distance","remotely","in a nonlocal manner"],"phonetic":"/ˌnɑnˈloʊkəli/","extraExplanation":["“nonlocally”来自“non-（不）+ locally（局部地/在本地）”。日常英语里较少见，更常用于学术或技术语境。","在数学与物理里，“nonlocal(非局部)”常用来对比“local(局部)”：局部描述只看邻近信息；非局部描述会受远处或整体结构影响，例如用积分项、全局约束或长程相互作用来表达。","在计算机领域也会看到类似思路：某个操作的影响不只发生在当前模块/文件/页面，而是会“跨范围”影响其他部分，这时就可能用“nonlocally”来强调影响范围不是局部的。"]}
{"word":"nonlocals","summary":{"en":"“Nonlocals” usually means people who are not local to a place; in Python contexts, it can refer to variables declared as nonlocal (from an enclosing function scope).","zh":"“nonlocals”通常指非本地人；在 Python 语境中，也可指被声明为 nonlocal 的变量（来自外层函数作用域）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are not from a particular area; outsiders or visitors (not local residents).","zh":"非本地人；外地人；外来者（不是当地居民的人）。"},"examples":[{"en":"During the festival, nonlocals often have trouble finding parking.","zh":"节日期间，外地人常常很难找到停车位。"},{"en":"Some shops raise prices for nonlocals during peak tourist season.","zh":"在旅游旺季，有些商店会对外地人提高价格。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing, especially Python) The plural of “nonlocal”: variables declared with the keyword “nonlocal,” meaning they come from an enclosing function scope (not global, not local to the current function).","zh":"（计算机领域，尤指 Python）“nonlocal（非局部）”的复数：指用关键字 nonlocal 声明的变量，表示它来自外层函数作用域（既不是全局，也不是当前函数的局部变量）。"},"examples":[{"en":"Use nonlocals when an inner function needs to update a variable from an outer function.","zh":"当内层函数需要更新外层函数的变量时，可以使用 nonlocal 变量。"},{"en":"Without declaring it nonlocal, Python treats the name as a new local variable.","zh":"如果不声明为 nonlocal，Python 会把这个名字当作新的局部变量。"}]}],"synonyms":["outsiders","visitors","out-of-towners","tourists"],"phonetic":"/ˌnɑnˈloʊkəlz/","extraExplanation":["“nonlocals”在日常英文里并不算特别常用，更常见的说法是“nonlocal residents（非本地居民）”“out-of-towners（外地来的人）”“visitors（访客）/tourists（游客）”。","在 Python 里，严格来说关键字是“nonlocal”（不加 s）。人们说“nonlocals”通常是在口语化地指“那些被声明为 nonlocal 的变量（们）”。"]}
{"word":"nonlocation","summary":{"en":"Nonlocation means a “non-place”: a setting that feels generic or not meaningfully tied to a real place, or something not linked to any specific location (often online or abstract).","zh":"Nonlocation 指“非地点/非场所”：一种缺少地方意义、很通用的场所；也可指不与任何具体地点绑定的（常见于线上或抽象情境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place or setting that does not function like a normal, meaningful place (often because it is temporary, generic, or mainly used for passing through)","zh":"“非地点；非场所”：不像一般有意义的“地方”的场所（常因其临时、千篇一律，或主要用于通行、停留很短而缺少归属感）"},"examples":[{"en":"The airport lounge felt like a nonlocation—comfortable, but not really anyone’s place.","zh":"机场休息室像个非地点：舒服，但并不真正属于任何人。"},{"en":"Chain hotels can become nonlocations when every room looks the same in every city.","zh":"连锁酒店在每个城市的房间都一样时，就容易变成“非地点”。"}]},{"partOfSpeech":"adj.","definition":{"en":"not tied to any specific physical place; existing or happening without a clear location (often about online or abstract settings)","zh":"不与具体物理地点绑定的；“无明确地点”的（常用于网络或较抽象的情境）"},"examples":[{"en":"Their meetings are mostly nonlocation—everything happens online now.","zh":"他们的会议大多是“无地点”的——现在基本都在线上进行。"},{"en":"The story creates a nonlocation feeling, as if it could happen anywhere.","zh":"这个故事营造出一种“非地点感”，仿佛发生在任何地方都成立。"}]}],"synonyms":["non-place","placelessness","nowhere in particular","generic place"],"phonetic":"/ˌnɑnloʊˈkeɪʃən/","extraExplanation":["“nonlocation”不是最常见的标准词形；在学术与写作里更常见的对应表达是“non-place（非地方/非场所）”。它常用来描述机场、高速公路服务区、购物中心等“可使用但缺少地方认同”的空间。","构词上，non- 表示“非/无”，location 表示“地点”。写作中若想更自然，可根据语境改用“non-place、placeless, generic place, nowhere in particular”等。"]}
{"word":"nonlogic","summary":{"en":"Nonlogic means a lack of logical reasoning, or (less commonly) an intuitive/artistic way of thinking that doesn’t follow strict logic.","zh":"nonlogic 指“非逻辑/缺乏逻辑的推理”；较少见时也可指一种不遵循严格逻辑、偏直觉或艺术化的表达方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of logic; reasoning that does not follow logical rules","zh":"非逻辑；缺乏逻辑；不符合逻辑规则的推理"},"examples":[{"en":"The argument fell apart because it relied on nonlogic instead of evidence.","zh":"这个论点之所以站不住脚，是因为它依赖非逻辑而不是证据。"},{"en":"In heated debates, nonlogic can sound convincing for a moment.","zh":"在激烈的争论中，非逻辑有时会在短时间内显得很有说服力。"}]},{"partOfSpeech":"n.","definition":{"en":"a way of thinking or expression guided more by intuition, emotion, or art than by strict reasoning","zh":"（较少见）更依靠直觉、情绪或艺术表达，而非严格推理的思维/表达方式"},"examples":[{"en":"Some poems use nonlogic to create a dreamlike feeling.","zh":"有些诗歌用“非逻辑”来营造梦境般的感觉。"},{"en":"The film’s nonlogic is intentional—it wants you to feel, not solve.","zh":"这部电影的“非逻辑”是刻意的——它想让你感受，而不是解题。"}]}],"synonyms":["illogic","illogical reasoning","nonsense","nonreason","irrationality"],"phonetic":"/nɑnˈlɑdʒɪk/","extraExplanation":["“nonlogic”不是特别常见的标准拼写；更常见的是写成“non-logic”（带连字符），或者直接用更自然的表达：“illogic / illogical reasoning（不合逻辑的推理）”。","在日常英语里，如果你想说“某人不讲道理/推理混乱”，更地道的说法通常是：“That doesn’t make sense.” / “That’s illogical.” “nonlogic”更像一种概念词，偶尔出现在批评、哲学、文学评论里。"]}
{"word":"nonlogical","summary":{"en":"Nonlogical means “not logical” or “not based on sound reasoning.” In everyday English, illogical is more common.","zh":"nonlogical 指“不合逻辑的、缺乏合理推理的”。日常英语中更常用 illogical。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not logical; not based on clear reasoning, or not following the rules of logic.","zh":"不合逻辑的；不基于清晰推理的；不符合逻辑规则的。"},"examples":[{"en":"It’s nonlogical to blame one person for a problem caused by many factors.","zh":"把一个由很多因素造成的问题怪到一个人身上是不合逻辑的。"},{"en":"Her argument sounded confident, but it was nonlogical when you looked at the evidence.","zh":"她的论点听起来很有自信，但当你看证据时就会发现不合逻辑。"}]}],"synonyms":["illogical","irrational","incoherent","unreasonable","not logical"],"phonetic":"/nɑnˈlɑdʒɪkəl/","extraExplanation":["“nonlogical”是由 non-（表示“非、不”）+ logical（合逻辑的）构成，意思清楚，但在日常英语里更常见、更自然的说法通常是 “illogical” 或 “not logical”。","语气与使用场景：在写作或正式讨论中，人们常用 “illogical” 来批评推理过程；“not logical”更中性、更口语。若想表达“情绪化、缺少理性”而不只是在逻辑上不成立，也可以用 “irrational”。"]}
{"word":"nonlogicality","summary":{"en":"Nonlogicality means a lack of logic; being illogical or not logically consistent.","zh":"nonlogicality 指“不合逻辑、缺乏逻辑性”的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of logic; the quality of being illogical, unreasonable, or not following a clear line of reasoning.","zh":"不合逻辑；指思路不连贯、推理不成立或不合理的性质。"},"examples":[{"en":"She pointed out the nonlogicality of the argument and asked for clearer evidence.","zh":"她指出这个论证的不合逻辑之处，并要求提供更清晰的证据。"},{"en":"The report contains several contradictions, which add to its nonlogicality.","zh":"这份报告里有好几处自相矛盾，使它显得更不合逻辑。"}]}],"synonyms":["illogicality","lack of logic","inconsistency","unreasonableness"],"phonetic":"/ˌnɑnˌlɑdʒɪˈkælɪti/","extraExplanation":["“nonlogicality”在英语里能被理解，但并不常见，更自然的表达通常是“illogicality”或“lack of logic”。在学术写作或日常表达中，你更常看到：“the illogicality of the argument / the reasoning is illogical / it doesn’t make sense”。","构词上：non-（否定前缀）+ logical（合逻辑的）+ -ity（名词后缀，表示“性质/状态”）。因此它的意思直译就是“非逻辑性”。"]}
{"word":"nonlogically","summary":{"en":"Nonlogically means “in a way that is not logical or not based on clear reasoning.”","zh":"nonlogically 的意思是“以不合逻辑、缺乏清晰推理的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not logical; without following clear reasoning or rational rules.","zh":"以不合逻辑的方式；不按清晰的推理或理性规则来。"},"examples":[{"en":"He argued nonlogically, jumping from one idea to another without evidence.","zh":"他论证得不合逻辑，在没有证据的情况下从一个观点跳到另一个观点。"},{"en":"The story develops nonlogically, so some scenes feel confusing.","zh":"这个故事的发展不合逻辑，所以有些场景让人觉得困惑。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Math/Computer Science) In a way that does not follow the rules of formal logic (for example, in a system or proof).","zh":"（数学/计算机）以不遵循形式逻辑规则的方式（例如在某个系统或证明中）。"},"examples":[{"en":"If a rule is applied nonlogically, the proof can no longer be trusted.","zh":"如果某条规则被不按逻辑地使用，这个证明就不再可信。"}]}],"synonyms":["illogically","irrationally","unreasonably","incoherently"],"phonetic":"/ˌnɑnˈlɑdʒɪkli/","extraExplanation":["“nonlogically”是由 non-（否定前缀）+ logically（合逻辑地）构成，意思直观，但在日常英语里并不算特别常见。","更自然的替代表达常见有：“illogically”（更常用，表示“不合逻辑地”）、“irrationally”（更强调“不理性地”）、“in a way that doesn’t make sense”（更口语）。","拼写上通常写作一个词“nonlogically”。写成“non-logically”较少见，除非作者为了强调或排版需要。"]}
{"word":"nonlogicalness","summary":{"en":"Nonlogicalness means the state of not being logical—lack of clear reasoning.","zh":"Nonlogicalness 指“不合逻辑”的状态，即缺乏清晰推理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being logical; lack of clear reasoning (often used to criticize an argument, explanation, or behavior)","zh":"不合逻辑；缺乏清晰推理（常用于批评某种论证、解释或行为）"},"examples":[{"en":"People were frustrated by the nonlogicalness of the rules, because they changed from day to day.","zh":"人们对这些规定的不合逻辑感到沮丧，因为它们天天都在变。"},{"en":"If you point out the nonlogicalness in his argument, do it politely and with evidence.","zh":"如果你要指出他论证里的不合逻辑，最好礼貌一些，并拿出证据。"},{"en":"The story is entertaining, but its nonlogicalness becomes obvious near the end.","zh":"这个故事很有趣，但到了结尾它的不合逻辑就很明显了。"}]}],"synonyms":["illogicality","illogic","lack of logic","unreasonableness","incoherence"],"phonetic":"/ˌnɑnˈlɑdʒɪkəlnəs/","extraExplanation":["“nonlogicalness”不是非常常见、也不太正式的词，更常见的表达是 **illogicality**（不合逻辑性）或直接说 **the illogic** / **the lack of logic**。","构词上它是 non-（否定前缀）+ logical + -ness（名词后缀），意思容易懂，但在正式写作里可能显得“不地道”。"]}
{"word":"nonlogistic","summary":{"en":"Nonlogistic means “not related to logistics,” or (in statistics) “not based on a logistic model/function.”","zh":"nonlogistic 指“非物流/非后勤的”，或（在统计学中）“非logistic模型/函数的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to logistics (the planning and organization of moving, storing, and supplying goods/people).","zh":"不涉及物流/后勤（对运输、仓储、供应等的计划与组织）的。"},"examples":[{"en":"They handled the marketing first and left the nonlogistic details for later.","zh":"他们先处理营销，把那些非物流/非后勤的细节留到以后再说。"},{"en":"This meeting is about nonlogistic issues like branding and customer service.","zh":"这次会议讨论的是品牌和客服等非物流/非后勤问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Statistics/Math) Not using or not based on a logistic model or the logistic function (for example, a nonlogistic regression approach).","zh":"（统计/数学）非逻辑斯蒂（logistic）模型的；不基于逻辑斯蒂函数/模型的（如“非logistic回归”）。"},"examples":[{"en":"The paper compares logistic and nonlogistic models for predicting churn.","zh":"论文比较了用于预测用户流失的logistic模型与非logistic模型。"},{"en":"They chose a nonlogistic method because the outcome wasn’t binary.","zh":"由于结果不是二元的，他们选择了非logistic的方法。"}]}],"synonyms":["non-logistic","nonlogistical","not logistical"],"phonetic":"/ˌnɑn.ləˈdʒɪs.tɪk/","extraExplanation":["“nonlogistic”在日常英语中并不常见；更常见的写法是 **non-logistic**（加连字符）或在“物流/后勤”含义下用 **nonlogistical**。","注意不要和 **nonlogical / non-logical**（“不合逻辑的”）混淆；两者拼写相近但意思不同。","如果你是在写论文/报告，建议第一次出现时明确你指的是“物流（logistics）”还是“logistic函数/回归（统计学）”，避免歧义。"]}
{"word":"nonlogistical","summary":{"en":"Nonlogistical means “not related to logistics,” or sometimes “lacking logistical support/planning.”","zh":"nonlogistical 表示“与后勤/物流无关的”，有时也指“缺乏后勤保障或后勤规划的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to logistics (planning, organizing, and managing resources such as transportation, supplies, or schedules).","zh":"非后勤的；与后勤（如运输、物资、排期等资源的规划与管理）无关的。"},"examples":[{"en":"The meeting covered nonlogistical issues like team communication and leadership.","zh":"这次会议讨论的是非后勤问题，比如团队沟通与领导力。"},{"en":"We’ve solved the shipping problem; now we can focus on the nonlogistical parts of the project.","zh":"运输问题解决了；现在我们可以专注于项目中非后勤的部分。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking logistical support or planning; not set up well for practical needs like transport, equipment, or supplies.","zh":"缺乏后勤保障/后勤规划的；在运输、设备或物资等实际需求上没有准备好的。"},"examples":[{"en":"The plan sounded exciting but was nonlogistical and impossible to carry out.","zh":"这个计划听起来很精彩，但缺乏后勤可行性，根本无法执行。"},{"en":"Their rescue effort was brave, but it became nonlogistical once fuel ran out.","zh":"他们的救援行动很勇敢，但燃料耗尽后就失去了后勤可行性。"}]}],"synonyms":["not logistical","nonoperational","nontechnical","administrative (context-dependent)","strategic (contrastive, context-dependent)"],"phonetic":"/ˌnɑn.ləˈdʒɪs.tɪ.kəl/","extraExplanation":["“non-”是否定前缀，表示“非……/不……”。“logistical”来自“logistics（后勤/物流）”。因此“nonlogistical”通常用于区分“后勤层面的问题”和“非后勤层面的问题”（例如沟通、策略、文化、心理因素等）。","这个词在正式写作、报告或学术语境里更常见；日常口语中也可以说“not logistical”或“not related to logistics”。"]}
{"word":"nonlosable","summary":{"en":"Nonlosable means “cannot be lost or forfeited,” especially for rights or benefits; less commonly, it can mean “hard to misplace.”","zh":"nonlosable 指“不可失去/不可被没收的”，常用于权益或福利；较少情况下也可指“防丢、不易弄丢的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be lost, taken away, or forfeited; guaranteed to remain with the owner (often used in legal, insurance, pension, or policy contexts).","zh":"不可失去的；不会被夺走或被没收的；保证仍归本人所有的（常见于法律、保险、养老金或政策语境）。"},"examples":[{"en":"After five years of service, part of the pension becomes nonlosable under the plan rules.","zh":"服务满五年后，根据计划规定，部分养老金权益将变为不可失去的。"},{"en":"The contract describes which benefits are nonlosable and which depend on performance.","zh":"合同说明哪些福利是不可失去的，哪些则取决于绩效。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed so it is very hard to misplace or lose (less common; more typical wording is “hard to lose” or “loss-resistant”).","zh":"设计成不易弄丢的（较少见；更常说“not easy to lose / hard to lose”或“防丢的”）。"},"examples":[{"en":"She attached the keys to a nonlosable clip that stays on her bag.","zh":"她把钥匙扣在一个防丢夹上，夹子一直固定在包上。"}]}],"synonyms":["nonforfeitable","vested","inalienable","unlosable","guaranteed"],"phonetic":"/ˌnɑnˈloʊzəbəl/","extraExplanation":["这个词在日常英语里不算常见，更常见的写法是带连字符的 **non-losable**。在福利/养老金语境中，它常用来表达“权益一旦获得就不会被取消”，也常见更标准的替代词：**nonforfeitable**（不可没收的权益）、**vested**（已归属/已生效的权益）、**inalienable**（不可剥夺的，偏正式）。","如果你想表达“东西不容易丢”，口语更自然的说法通常是：**hard to lose**, **easy to keep track of**, **loss-resistant**, **won’t get lost easily**。"]}
{"word":"nonloser","summary":{"en":"“Nonloser” is an informal, nonstandard word meaning “not a loser,” used for a respected person or for something that isn’t embarrassing.","zh":"“nonloser”是非正式、非标准表达，意思是“不是失败者/不拉胯”，可指一个被认可的人，也可形容某事不尴尬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard) A person who is not a “loser”; someone seen as competent, successful, or socially respected.","zh":"（非正式、非标准用法）指“不是失败者/废柴”的人；被认为很能干、成功或在社交上受尊重的人。"},"examples":[{"en":"He’s a total nonloser—he studies hard and still makes time for his friends.","zh":"他完全不是那种“废柴”——学习很努力，也会抽时间陪朋友。"},{"en":"She wants to look like a nonloser at the party, so she planned what to say.","zh":"她想在派对上显得自己不“丢脸/不拉胯”，所以提前想好了要说什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Describing something as not embarrassing or not “loser-ish”; acceptable, cool, or socially safe.","zh":"（非正式、非标准用法）形容某事不尴尬、不“废柴感”；还可以、挺酷、在社交上比较稳。"},"examples":[{"en":"Is this outfit nonloser enough for a first date?","zh":"这套穿搭第一次约会会不会显得不“拉胯/不尴尬”？"},{"en":"We chose a nonloser restaurant—nothing fancy, but not cheap-looking either.","zh":"我们选了个不“掉价”的餐厅——不算奢华，但也不显寒酸。"}]}],"synonyms":["not a loser","non-loser","winner (informal)","cool (informal)","capable","successful"],"phonetic":"/ˌnɑnˈluːzɚ/","extraExplanation":["“nonloser”不是常见的标准词典词，更像是网络/口语里临时拼出来的表达。更自然的写法通常是“non-loser”（带连字符）或直接说“not a loser”。","注意语气：因为“loser”本身带有贬义，“nonloser”也会显得有点评价他人的味道。在正式场合建议改用更中性的词，比如“capable（能干的）”“successful（成功的）”“confident（自信的）”。"]}
{"word":"nonlover","summary":{"en":"“Nonlover” means a person who isn’t a lover or doesn’t pursue/feel romantic love; it can also mean “not loving” (rare, often humorous).","zh":"“nonlover”指不是恋人/不谈恋爱或缺乏浪漫爱的人；也可作形容词表示“不爱的”（较少见，常带幽默或文艺语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often humorous or rare) A person who does not love someone or does not enjoy love/romance; someone who is not a lover.","zh":"（多为幽默或较少见）不爱的人；不享受恋爱/浪漫的人；不是“恋人”的人。"},"examples":[{"en":"He joked that he was a nonlover who preferred quiet weekends to dating.","zh":"他开玩笑说自己是个不谈恋爱的人，比起约会更喜欢安静的周末。"},{"en":"In the novel, she calls herself a nonlover after a painful breakup.","zh":"在小说里，经历痛苦分手后，她称自己为“不再爱的人”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not loving; lacking romantic interest or affection (used before a noun).","zh":"不爱的；缺乏恋爱兴趣或爱意的（作定语，放在名词前）。"},"examples":[{"en":"He took a nonlover stance toward romantic movies.","zh":"他对爱情电影持一种“不感冒”的态度。"},{"en":"They had a nonlover agreement: friendship only, no romance.","zh":"他们达成了“非恋人”的约定：只做朋友，不谈恋爱。"}]}],"synonyms":["not a lover","non-romantic person","unromantic person","aromantic (more specific)","nonfan (if you mean “not a fan,” for things)"],"phonetic":"/ˌnɑnˈlʌvɚ/","extraExplanation":["“nonlover”不是非常常见的标准词，更常见的表达有：not a lover / not into romance / aromantic（无浪漫吸引）/ uninterested in dating（对约会不感兴趣）。在写作或口语里用“nonlover”通常带一点自嘲或风格化的味道。","注意区分：nonlover（不是恋人/不谈恋爱）≠ hater（讨厌某物的人）。如果你想表达“对某件事不喜欢的人”，更自然的是：someone who doesn’t like … / a nonfan。"]}
{"word":"nonloving","summary":{"en":"Nonloving means not affectionate or warm; it can also describe a relationship or situation that does not involve love.","zh":"nonloving 指缺乏爱与温情的；也可指不包含爱情或爱意的关系/状况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not loving; showing little or no affection, warmth, or care.","zh":"不爱人的；缺乏关爱或温情的；冷淡的。"},"examples":[{"en":"He grew up with nonloving parents who rarely showed affection.","zh":"他在不爱表达关爱的父母身边长大，他们很少表现出亲昵。"},{"en":"Her nonloving tone made the conversation feel cold and distant.","zh":"她冷淡的语气让谈话显得冰冷而疏远。"},{"en":"They described the relationship as nonloving and emotionally empty.","zh":"他们形容这段关系缺乏爱意，情感空洞。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not involving romantic love or affection; without love as a main element.","zh":"不包含爱情或爱意的；以非爱为主要成分的。"},"examples":[{"en":"It was a nonloving arrangement, more about convenience than feelings.","zh":"这是一种不带爱意的安排，更多是出于方便而非感情。"},{"en":"Some marriages began as nonloving partnerships and later developed affection.","zh":"有些婚姻起初是没有爱情的合作关系，后来才培养出感情。"}]}],"synonyms":["unloving","cold","affectionless","unaffectionate","heartless"],"phonetic":"/ˌnɑnˈlʌvɪŋ/","extraExplanation":["“nonloving”不是特别常见，更常见的表达是 **unloving**（冷漠的、缺乏爱）或 **not loving**。在写作里，“nonloving”往往带一点“客观描述/分类”的感觉（例如描述一种关系的性质），而 **unloving** 更像对人的性格或行为做评价。","拼写上通常不加连字符（nonloving），但也可能见到 **non-loving**（尤其在较正式或强调对比时）。","如果你想表达“对某人没有爱/不再爱”，更自然的说法是 **doesn’t love (someone)** 或 **doesn’t feel love anymore**；“nonloving”更像形容一种长期、稳定的“缺乏温情”的状态。"]}
{"word":"nonloxodromic","summary":{"en":"Nonloxodromic means “not following a constant-bearing (loxodromic) path,” used mainly in navigation and geometry.","zh":"nonloxodromic 指“非等航向线的/不保持恒定航向的”，多用于导航与几何语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not loxodromic; not following a loxodrome (a path on a sphere that crosses all meridians at the same constant angle, i.e., a constant-compass-bearing route).","zh":"非等航向线的；不沿等航向线（在球面上以固定角度切过所有经线、也就是“保持恒定罗盘方位角”的路线）行进的。"},"examples":[{"en":"Because of changing winds, the ship’s actual track was nonloxodromic rather than a constant-bearing line.","zh":"由于风向不断变化，船只的实际航迹是非等航向线的，而不是一条保持恒定方位角的路线。"},{"en":"On a globe, a great-circle route is usually nonloxodromic except in special cases.","zh":"在地球仪上，大圆航线通常是非等航向线的（除非在某些特殊情况下）。"}]}],"synonyms":["not constant-bearing","non-rhumb-line"],"phonetic":"/ˌnɑnˌlɑksəˈdrɑmɪk/","extraExplanation":["这个词主要出现在导航、测绘、地理/数学语境里。loxodrome（等航向线/恒向线）在墨卡托投影上看起来是一条直线，因为它保持“恒定罗盘航向”；而大圆航线（great-circle route）在地球表面往往更短，但通常不是恒定航向，因此常被描述为 nonloxodromic。","构词很直观：non-（不、非）+ loxodromic（等航向线的）。loxodrome 源自希腊语词根，含“斜/倾斜”与“跑道/路线”的意思。"]}
{"word":"nonloxodromical","summary":{"en":"Nonloxodromical means “not loxodromical”: not following/related to a rhumb line (constant-bearing route).","zh":"nonloxodromical 指“非等角航线的”：不沿着/不涉及恒向线（保持恒定罗盘方位的航线）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not loxodromical; not relating to a rhumb line (loxodrome)—a route that crosses all meridians at the same angle (constant compass bearing).","zh":"非等角航线的；不与恒向线（loxodrome/ rhumb line）相关的——即不指那种以相同角度穿过所有子午线、保持恒定罗盘方位的航线。"},"examples":[{"en":"On a globe, a great-circle route is generally nonloxodromical, because its compass bearing keeps changing as you travel.","zh":"在地球仪上，大圆航线通常是 nonloxodromical（非等角航线的），因为沿途的罗盘方位会不断变化。"},{"en":"The paper compares loxodromical navigation with nonloxodromical paths used in great-circle planning.","zh":"论文比较了等角航行（loxodromical navigation）与用于大圆规划的非等角路径（nonloxodromical paths）。"}]}],"synonyms":["nonloxodromic"],"phonetic":"/ˌnɑnˌlɑksəˈdrɑmɪkəl/","extraExplanation":["这个词很少见，常见的是 **nonloxodromic**（去掉 -al 的变体）。它主要出现在航海/制图/地理测量语境里，用来否定 **loxodromical / loxodromic**（与“恒向线/等角航线”有关）。","理解关键：**loxodrome（恒向线）**是在球面上以固定角度切割每条子午线的曲线——也就是“始终保持同一罗盘方向”走出来的路线；而 **nonloxodromical** 指不满足这种“恒定方位角”性质的路线。","学习时可以把它和 **great-circle (route)**（大圆航线）对比：大圆通常更接近最短距离，但在球面上方位会变化，因此常被描述为 nonloxodromical。"]}
{"word":"nonloyal","summary":{"en":"Nonloyal means “not loyal” (less common than disloyal).","zh":"nonloyal 意为“不忠诚的/不效忠的”（不如 disloyal 常用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not loyal; lacking loyalty or faithfulness to a person, group, cause, or duty.","zh":"不忠诚的；不效忠的；缺乏忠诚与信守承诺的。"},"examples":[{"en":"He was accused of being nonloyal to the team after sharing strategy notes with a rival.","zh":"他因把战术笔记分享给对手而被指责对团队不忠。"},{"en":"In a crisis, the company quickly removed employees it considered nonloyal.","zh":"在危机中，公司迅速清除了它认为不忠的员工。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not showing consistent support or commitment (often used in formal, political, or organizational contexts).","zh":"（多用于正式、政治或组织语境）不表示持续支持或承诺的。"},"examples":[{"en":"The leader labeled the newspaper nonloyal because it published criticism.","zh":"领导人因报纸刊登批评文章而将其称为“不忠”。"},{"en":"They worried that nonloyal voices would weaken the movement.","zh":"他们担心不够忠诚的声音会削弱这场运动。"}]}],"synonyms":["disloyal","unfaithful","untrue","traitorous","disaffected"],"phonetic":"/ˌnɑnˈlɔɪəl/","extraExplanation":["“nonloyal”在现代英语中并不常见，更自然、更常用的词通常是“disloyal”（不忠的）或“unfaithful”（不忠/不贞的，视语境而定）。","语感上，“non-”前缀常表示“缺乏/不具备某特质”（not having），因此“nonloyal”听起来像“缺乏忠诚”，而“disloyal”更强调“背叛/对立”的意味；写作时可根据你想表达的力度来选词。","这个词在政治或组织话语中有时会带有强烈的立场色彩（把批评者贴上“不忠”的标签），使用时要注意语气与场合。"]}
{"word":"nonloyally","summary":{"en":"Nonloyally means “in a disloyal way.” It’s understandable but uncommon; “disloyally” is more natural.","zh":"nonloyally 的意思是“以不忠的方式”。可以理解但不常用；更自然的表达是 disloyally。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not loyal; in a disloyal or unfaithful manner.","zh":"以不忠诚的方式；不忠地、不守信地。"},"examples":[{"en":"The employee acted nonloyally by sharing confidential information with a competitor.","zh":"那名员工把机密信息泄露给竞争对手，表现得很不忠诚。"},{"en":"He spoke nonloyally about his team in public, which damaged trust.","zh":"他在公开场合不忠地议论自己的团队，破坏了信任。"}]}],"synonyms":["disloyally","unfaithfully","treacherously","betrayingly"],"phonetic":"/ˌnɑnˈlɔɪəli/","extraExplanation":["“nonloyally”由前缀 non-（不、非）+ loyally（忠诚地）构成，语法上可用，但在真实英文中相对少见，更常见、更自然的说法是 “disloyally”。","语体上它通常出现在较正式或法律/商务语境，用来强调“缺乏忠诚”的行为；日常口语里更常用 “unfaithfully / disloyally”。","注意不要和 “not loyally”（不够忠诚地、没有忠诚地）混淆：两者意思接近，但 “nonloyally”更像把“不忠”当作一种明确的性质来标注。"]}
{"word":"nonloyalties","summary":{"en":"“Nonloyalties” means a lack of loyalty, or specific acts of disloyalty (plural). It’s relatively rare; “disloyalties” is more common.","zh":"“nonloyalties”表示“不忠/缺乏忠诚”，也可指“具体的不忠行为”（复数）。该词较少见，更常用的是“disloyalties”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of loyalty; the state of not being loyal (often used in writing to emphasize betrayal or refusal to support someone/something)","zh":"不忠；缺乏忠诚的状态（常用于强调背叛或拒绝支持某人/某事）"},"examples":[{"en":"The scandal exposed years of nonloyalties within the organization.","zh":"这起丑闻揭露了该组织内部多年的不忠行为。"},{"en":"In times of crisis, small nonloyalties can quickly become major conflicts.","zh":"在危机时期，小小的不忠很快就可能演变成重大冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"acts or behaviors showing disloyalty (plural sense: specific instances of being not loyal)","zh":"不忠的行为（复数用法：指具体的不忠之举）"},"examples":[{"en":"She remembered his nonloyalties and decided not to trust him again.","zh":"她记得他的不忠之举，于是决定不再信任他。"},{"en":"The leader punished nonloyalties harshly.","zh":"这位领导者严厉惩罚不忠行为。"}]}],"synonyms":["disloyalties","disloyalty","unfaithfulness","betrayals","treachery"],"phonetic":"/ˌnɑnˈlɔɪəltiz/","extraExplanation":["“nonloyalties”通常是名词“nonloyalty”的复数形式（更常见的拼法也会写成“non-loyalty / non-loyalties”带连字符）。在日常英语里更常用的词是“disloyalty / disloyalties（不忠）”，而“nonloyalty”/“nonloyalties”更偏书面、强调“缺失忠诚”这一点。","构词上：non- 表示“非、不”，loyalty 表示“忠诚”；合在一起就是“没有忠诚”。如果你是在阅读文学或评论文章里看到它，作者往往是在用更“冷”、更抽象的方式谈“忠诚的缺席”，而不是直接骂“背叛（betrayal）”。"]}
{"word":"nonloyalty","summary":{"en":"Nonloyalty means a lack of loyalty; it’s an uncommon word, and “disloyalty” is usually more natural.","zh":"Nonloyalty 指“不忠、缺乏忠诚”；这个词不太常见，通常用 disloyalty 更自然。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of loyalty; the state or behavior of not being loyal (often close in meaning to “disloyalty”).","zh":"不忠；缺乏忠诚的状态或行为（常与 disloyalty 意思相近）。"},"examples":[{"en":"The manager saw his constant complaints as a sign of nonloyalty to the team.","zh":"经理把他不断的抱怨看作对团队不忠的表现。"},{"en":"In a crisis, even small acts of nonloyalty can damage trust.","zh":"在危机中，即使是不忠的小举动也会破坏信任。"}]}],"synonyms":["disloyalty","unfaithfulness","betrayal","treachery"],"phonetic":"/ˌnɑnˈlɔɪəlti/","extraExplanation":["“nonloyalty”并不是最常见的词；在日常英语里更常用的是 **disloyalty**（不忠）或形容词 **disloyal**（不忠的）。","构词上，“non-”表示“非、没有”，所以 nonloyalty 字面就是“没有忠诚”。在写作中用它有时会显得更“中性/描述性”，但多数情况下用 disloyalty 更自然。"]}
{"word":"nonlubricant","summary":{"en":"Nonlubricant means a substance (or a property) that is not lubricating—i.e., it does not reduce friction.","zh":"nonlubricant 指“非润滑剂/不具润滑作用的（物质）”，强调不能或不用于降低摩擦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance or material that does not lubricate (does not reduce friction).","zh":"不具润滑作用的物质；非润滑剂。"},"examples":[{"en":"This coating is a nonlubricant layer designed to increase grip, not reduce friction.","zh":"这种涂层是非润滑层，目的是增加摩擦力（抓地力），而不是减少摩擦。"},{"en":"Make sure you don’t confuse the nonlubricant solvent with the lubricant oil.","zh":"要确认别把非润滑性的溶剂和润滑油弄混。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not lubricating; not intended to act as a lubricant.","zh":"不润滑的；不用于润滑的。"},"examples":[{"en":"They tested the product in both lubricant and nonlubricant conditions.","zh":"他们在润滑和非润滑两种条件下测试了该产品。"},{"en":"Use a nonlubricant cleaner before applying grease.","zh":"上油脂之前，先用不含润滑成分的清洁剂。"}]}],"synonyms":["non-lubricating substance","not lubricating","non-lubricating"],"phonetic":"/ˌnɑnˈluːbrɪkənt/","extraExplanation":["“nonlubricant”= non-（不、非）+ lubricant（润滑剂）。在工程、化工、材料说明书/专利语境中更常见；日常英语里更常写成带连字符的 **non-lubricant** 或用短语表达（如 *a non-lubricating substance*）。","注意语境：有时它并不是说“完全没有润滑性”，而是强调“它的主要用途不是润滑”，例如某些清洁剂、溶剂、或增加摩擦/抓握的涂层。"]}
{"word":"nonlubricating","summary":{"en":"“Nonlubricating” means not providing lubrication, or (in engineering) designed to work without added lubricant.","zh":"“nonlubricating”指“不起润滑作用的”，或（工程语境）“无需额外润滑即可工作的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not lubricating; not providing oil/grease or other substance that reduces friction between moving parts.","zh":"不润滑的；不提供油、脂或其他减少摩擦的物质的。"},"examples":[{"en":"This polymer is used as a nonlubricating spacer, so it won’t add oil to the mechanism.","zh":"这种聚合物被用作不润滑的垫片，因此不会给机构带来油污。"},{"en":"Use a nonlubricating cleaner if the surface must stay dry and non-greasy.","zh":"如果表面必须保持干燥、不油腻，就使用不润滑的清洁剂。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a bearing/material) Designed to run without added lubricant; able to operate “dry.”","zh":"（指轴承/材料）设计为无需额外润滑即可运行；可“干运转”的。"},"examples":[{"en":"Some nonlubricating bearings use materials that reduce friction on their own.","zh":"一些无需润滑的轴承使用能自行降低摩擦的材料。"},{"en":"The manual specifies a nonlubricating bushing for high-dust environments.","zh":"说明书规定在高粉尘环境中使用无需润滑的衬套。"}]}],"synonyms":["non-lubricating","nonlubricated","lubricant-free","dry-running"],"phonetic":"/ˌnɑnˈluːbrɪˌkeɪtɪŋ/","extraExplanation":["“non-”是英语里很常见的前缀，表示“非、无”。“lubricating”来自“lubricate（润滑）”。所以“nonlubricating”多见于工程/材料语境，强调“不会产生润滑效果”或“设计成不需要润滑油”。","注意区分两种常见用法：\n1）nonlubricating = 不会润滑/不会留下油膜（比如清洁剂、涂层、垫片）；\n2）nonlubricating bearing/bushing = 无需外加润滑即可工作的部件（有时也会写成 self-lubricating 或 lubricant-free，具体取决于产品宣传与技术定义）。"]}
{"word":"nonlubricious","summary":{"en":"Nonlubricious means “not sexually obscene” (most common), and more rarely “not slippery / not lubricated.”","zh":"nonlubricious 意为“不淫秽的/不猥亵的”（最常见），较少见时也可指“不滑的/缺乏润滑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not lubricious; not sexually suggestive, obscene, or lustful.","zh":"不淫秽的；不色情的；不猥亵的。"},"examples":[{"en":"The director insisted the scene remain nonlubricious and focused on emotion rather than sex appeal.","zh":"导演坚持让这一幕保持不色情，把重点放在情感而不是性吸引力上。"},{"en":"Her comments were blunt but nonlubricious.","zh":"她的话很直白，但并不猥亵。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not slippery; lacking lubrication (rare, technical or humorous use).","zh":"不滑的；缺乏润滑的（较少见，多为技术语境或幽默用法）。"},"examples":[{"en":"Without oil, the hinge became nonlubricious and started to squeak.","zh":"没有上油，铰链变得不顺滑，开始吱吱作响。"}]}],"synonyms":["not lewd","not obscene","decent","chaste","innocent","not slippery","unlubricated"],"phonetic":"/ˌnɑnluˈbrɪʃəs/","extraExplanation":["这个词很少见，通常是把形容词 lubricious（既可指“淫秽的/好色的”，也可指“滑的/像涂了油一样的”）前面加上否定前缀 non- 形成的。","在日常英语里，人们更常说 not obscene / not lewd（不猥亵）或 not slippery / not well-lubricated（不滑/不够润滑）。nonlubricious 往往出现在较正式、讽刺或刻意“用词讲究”的写作中。","根据语境判断含义：谈话题、笑话、内容尺度时，多半是“非色情/不猥亵”；谈机械、摩擦、油脂时，才可能是“不润滑/不滑”。"]}
{"word":"nonlubriciously","summary":{"en":"Nonlubriciously means “not in a lustful or sexually suggestive way; decently.”","zh":"nonlubriciously 指“以不淫荡、不带性暗示的方式；得体地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not sexually suggestive, lustful, or indecent; without lustful intent.","zh":"以不带性暗示、不淫荡、不猥亵的方式；没有淫邪意图地。"},"examples":[{"en":"The scene is intimate but filmed nonlubriciously, focusing on trust rather than titillation.","zh":"这段戏很亲密，但拍得并不猥亵，更强调信任而不是挑逗。"},{"en":"He complimented her nonlubriciously, keeping his tone respectful and professional.","zh":"他称赞她时没有任何暧昧意味，语气保持尊重而专业。"},{"en":"The novel describes bodies nonlubriciously, using plain language instead of erotic detail.","zh":"小说描写身体时并不色情化，而是用朴素语言避免露骨细节。"}]}],"synonyms":["decently","respectfully","tastefully","modestly","non-erotically"],"phonetic":"/ˌnɑnluˈbrɪʃəsli/","extraExplanation":["这个词非常少见，属于由前缀 non-（“不、非”）+ lubriciously（“淫荡地、带性挑逗地”）构成的否定形式。写作或评论中偶尔用来强调“虽然涉及亲密/身体/性感元素，但呈现方式并不猥亵”。","更常用、更自然的替代表达包括：\"respectfully\"（尊重地）、\"decently\"（得体地）、\"without sexual overtones\"（不带性暗示地）、\"non-erotically\"（非色情地）。在正式写作中用这些通常更清晰。"]}
{"word":"nonlubriciousness","summary":{"en":"Nonlubriciousness means the quality of not being slippery, or (by extension) not being sexually suggestive or obscene.","zh":"nonlubriciousness 指“不滑”的性质；也可引申为“内容不猥亵、不低俗”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being slippery; lack of slickness (literal or figurative “smoothness”).","zh":"不滑、缺乏滑溜感的性质；不够“顺滑”（可指字面或比喻意义上的不顺畅）。"},"examples":[{"en":"The nonlubriciousness of the surface made it easier to grip with wet hands.","zh":"表面的不滑特性让手湿的时候也更容易抓牢。"},{"en":"Because of the nonlubriciousness of the plan, the process felt slow and awkward.","zh":"由于这个方案不够“顺滑”，整个流程显得缓慢又别扭。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of not being sexually suggestive or obscene; lack of lewdness.","zh":"不色情、不猥亵的特质；缺乏淫秽意味。"},"examples":[{"en":"The editor praised the essay’s nonlubriciousness and professional tone.","zh":"编辑称赞这篇文章不带猥亵意味，语气也很专业。"},{"en":"They preferred humor with nonlubriciousness—funny without being crude.","zh":"他们更喜欢不低俗的幽默——好笑但不粗鄙。"}]}],"synonyms":["grippiness","roughness","traction","non-lewdness","propriety","decency"],"phonetic":"/ˌnɑnluˈbrɪʃəsnəs/","extraExplanation":["这个词非常少见，通常是临时造词/学术式写法：non-（不、非）+ lubricious（滑的；也可指“淫荡/猥亵的”）+ -ness（名词后缀，表示“……的性质”）。所以它可以有两条常见理解：①“不滑”；②“不猥亵”。","lubricious 的两个含义都能在英语里见到：一个更“物理”（slippery），一个更“道德/文体”（lewd）。阅读时要看语境：谈材料、路面、触感，多半是“不滑”；谈文字、玩笑、内容风格，多半是“不低俗/不猥亵”。","更自然、更常用的表达往往是：lack of slipperiness / grippiness（不滑、好抓）或 propriety / non-lewdness（得体、不猥亵），写作时可优先选这些更常见的说法。"]}
{"word":"nonlucid","summary":{"en":"Nonlucid means “not clear” or “not mentally clear,” and in dream contexts it means “not aware you’re dreaming.”","zh":"nonlucid 表示“不清楚/不够清醒的”；在梦境语境中指“非清醒梦（不知道自己在做梦）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not clear or easy to understand; confused or not thinking clearly.","zh":"不清楚的；不易理解的；思路混乱的（不够清醒、条理不明）。"},"examples":[{"en":"His explanation was nonlucid, so I asked him to repeat it more slowly.","zh":"他的解释不够清楚，所以我请他放慢速度再说一遍。"},{"en":"I felt nonlucid after staying up all night, and I kept forgetting simple things.","zh":"我熬了一整夜后脑子不太清醒，连简单的事都一直忘。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Dreaming) Not aware that you are dreaming; occurring without lucid awareness.","zh":"（梦境）非清醒梦的；做梦时没有意识到自己在做梦的。"},"examples":[{"en":"Most of my dreams are nonlucid, and I only realize it was a dream after I wake up.","zh":"我大多数梦都不是清醒梦，通常是醒来后才意识到那是梦。"},{"en":"He kept a dream journal to compare nonlucid dreams with lucid ones.","zh":"他写梦境日记，用来对比非清醒梦和清醒梦。"}]}],"synonyms":["unclear","confused","incoherent","not lucid","non-lucid (dreaming context)"],"phonetic":"/nɑnˈluːsɪd/","extraExplanation":["“nonlucid”由前缀 non-（不、非）+ lucid（清晰的；清醒的）构成，意思就是“不是清晰/清醒的”。在日常英语里更常见的说法通常是 “unclear / not lucid”。","在“梦”的语境中，lucid dream 指“清醒梦”（做梦时知道自己在做梦），因此 nonlucid dream 就是“普通梦/非清醒梦”。"]}
{"word":"nonlucidity","summary":{"en":"Nonlucidity means a lack of clarity or mental lucidity—being unclear, confused, or not fully alert.","zh":"nonlucidity 指缺乏清晰或清醒的状态，即不够明晰、困惑或不完全清醒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of lucidity; the state of not being clear or mentally alert (often describing thought, speech, or awareness).","zh":"不清晰；不清醒；缺乏明晰（常指思维、表达或意识不够清楚）。"},"examples":[{"en":"After the anesthesia, he spoke with some nonlucidity for a few hours.","zh":"麻醉后，他有几个小时说话有些不清醒。"},{"en":"The report’s nonlucidity made it hard to understand the main point.","zh":"这份报告不够清晰，让人很难抓住重点。"}]}],"synonyms":["confusion","lack of clarity","mental fog","incoherence","obscurity"],"phonetic":"/ˌnɑnluˈsɪdɪti/","extraExplanation":["这个词比较少见，更常用的表达是：lack of clarity（不清晰）、confusion（困惑）、mental fog/brain fog（脑雾，思路不清）、incoherence（语无伦次/不连贯）。","构词：non-（否定前缀）+ lucidity（清晰、明晰）。其中 lucidity 来自拉丁语词根 lux/luc-（“光”），引申为“清楚、明白”（像“被照亮”一样）。","使用场景上，nonlucidity 既可以指“表达或文字不够清楚”，也可指“意识/精神不够清醒”。如果是医学或正式写作，常见替代词还有 disorientation（定向障碍）、altered mental status（意识状态改变）。"]}
{"word":"nonlucidly","summary":{"en":"Nonlucidly means “in an unclear or not mentally clear way.”","zh":"nonlucidly 表示“（表达或思维）不清楚地；或（精神状态）不清醒地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not lucid (not clear, not easy to understand, or not mentally clear).","zh":"以不清晰的方式；（表达或思维）不明白、不易理解；或（精神状态）不清醒地。"},"examples":[{"en":"He explained the rules nonlucidly, so everyone left confused.","zh":"他把规则讲得不清不楚，所以大家都听糊涂了。"},{"en":"After waking up too quickly, she spoke nonlucidly for a few seconds.","zh":"她起得太急，刚醒来那几秒说话有点不清醒。"}]}],"synonyms":["unclearly","incoherently","confusingly","obscurely"],"phonetic":"/nɑnˈluːsɪdli/","extraExplanation":["“non-”是否定前缀，表示“不是/不”；“lucid”常见意思是“清楚的、明白的、（头脑）清醒的”。因此 nonlucidly = “不清楚地/不清醒地”。","这个词相对少见；写作中更常用的替代表达是 “unclearly / incoherently / not clearly”。"]}
{"word":"nonlucidness","summary":{"en":"Nonlucidness means a lack of lucidity—unclear thinking, unclear speech, or mental fog.","zh":"nonlucidness 指“缺乏清晰/清醒”的状态：思维不清、表达不清或脑子发蒙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not being lucid; lack of clear thinking or clear expression","zh":"不清醒；不清楚（思维或表达不清晰的状态）"},"examples":[{"en":"After the surgery, he spoke with some nonlucidness for a few hours.","zh":"手术后，他有几个小时说话有些不清醒。"},{"en":"The nonlucidness of the explanation confused the class.","zh":"这段解释的不清楚让全班都困惑了。"}]}],"synonyms":["confusion","lack of clarity","incoherence","mental fog","nonlucidity"],"phonetic":"/nɑnˈluːsɪdnəs/","extraExplanation":["“nonlucidness”不算常见词，更自然、常用的表达通常是“lack of clarity / confusion / incoherence / nonlucidity”。如果你写作想更正式一点，“nonlucidity”比“nonlucidness”更常见。","词根提示：lucid 表示“清晰的、清醒的”，前缀 non- 表示否定；后缀 -ness 把形容词变成名词，表示“……的状态”。"]}
{"word":"nonlucrative","summary":{"en":"Nonlucrative means “not profitable” or “not bringing in money.”","zh":"nonlucrative 的意思是“（项目/生意）不盈利、不赚钱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not profitable; not producing financial gain.","zh":"不赚钱的；无利可图的；不盈利的。"},"examples":[{"en":"Running a small bookstore can be nonlucrative, but it may be meaningful to the owner.","zh":"经营一家小书店可能并不赚钱，但对店主来说可能很有意义。"},{"en":"The company stopped the nonlucrative product line to focus on services.","zh":"公司停止了不盈利的产品线，转而专注于服务业务。"}]}],"synonyms":["unprofitable","not profitable","not lucrative","money-losing","low-profit"],"phonetic":"/ˌnɑnˈluːkrətɪv/","extraExplanation":["“nonlucrative”在书面语中可用，但更常见的写法是“non-lucrative”（加连字符），或直接说“not lucrative / unprofitable”。","词根提示：lucrative 来自拉丁语 lucrum（“利润、收益”），non- 表示否定，所以整体就是“没有利润的”。","语体与使用场景：常见于商业、投资、项目评估、政策讨论等较正式的语境；日常口语里更常用“doesn’t make much money”。"]}
{"word":"nonlucratively","summary":{"en":"Nonlucratively means “in a not-for-profit way; without aiming to make money.”","zh":"nonlucratively 表示“以非营利方式；不以盈利为目的地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not intended to make a profit; without seeking financial gain.","zh":"以非营利的方式；不以赚钱为目的；不追求经济利润。"},"examples":[{"en":"The community group operates nonlucratively, relying on donations and volunteers.","zh":"这个社区组织以非营利方式运作，主要依靠捐款和志愿者。"},{"en":"She offered her services nonlucratively to support families in need.","zh":"她以不图报酬的方式提供服务，以帮助有需要的家庭。"}]}],"synonyms":["not for profit","on a nonprofit basis","without profit","voluntarily","unpaid"],"phonetic":"/ˌnɑnˈluːkrətɪvli/","extraExplanation":["“nonlucratively”比较少见，更常用的表达是“on a nonprofit basis / in a non-profit way / not for profit / without profit”。写作时如果想更自然，通常会改用这些更常见的说法。","词根提示：lucrative 表示“赚钱的、利润高的”，来自拉丁语 lucrum（利润）。non- 是否定前缀，所以 nonlucratively 就是“非以盈利为目的地”。"]}
{"word":"nonlucrativeness","summary":{"en":"Nonlucrativeness means the state of not being profitable or financially rewarding.","zh":"Nonlucrativeness 指“不盈利/不怎么赚钱”的状态或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being lucrative; lack of profitability or financial reward","zh":"不赚钱的性质或状态；缺乏盈利性或经济回报"},"examples":[{"en":"They accepted the job despite its nonlucrativeness because it offered valuable experience.","zh":"尽管这份工作不怎么赚钱，他们还是接受了，因为它能带来宝贵的经验。"},{"en":"The project’s nonlucrativeness led the company to cancel it.","zh":"由于该项目不盈利，公司决定取消它。"}]}],"synonyms":["unprofitability","lack of profitability","low profitability","nonprofitability"],"phonetic":"/ˌnɑnˈluːkrətɪvnəs/","extraExplanation":["“Nonlucrativeness”是由 lucrative（赚钱的、获利的）+ non-（否定前缀）+ -ness（名词后缀）构成的抽象名词，意思就是“缺乏盈利性”。","在日常英语里更常见的表达是“lack of profitability / unprofitability / low profitability”。“Nonlucrativeness”偏正式、偏书面，出现频率较低。"]}
{"word":"nonlugubrious","summary":{"en":"Nonlugubrious means “not sad or gloomy,” often describing a tone or mood that avoids being overly mournful.","zh":"nonlugubrious 指“不过分悲伤阴沉的”，常用来形容语气或氛围不那么哀伤。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not sad, not mournful, or not overly gloomy (often used to describe a mood, tone, or style).","zh":"不忧郁的；不悲伤阴沉的（常形容气氛、语气或风格不那么哀伤/沉重）。"},"examples":[{"en":"Even though the topic was serious, the speaker kept a nonlugubrious tone to help everyone stay calm.","zh":"虽然话题很严肃，演讲者仍保持不那么悲伤阴沉的语气，帮助大家保持冷静。"},{"en":"The memorial included quiet moments, but it was intentionally nonlugubrious—focused on gratitude and memories.","zh":"追思会有安静的时刻，但刻意不走过度哀伤的路线——更强调感恩与回忆。"}]}],"synonyms":["not somber","not gloomy","upbeat","cheerful","lighthearted"],"phonetic":"ˌnɑnluˈɡuːbriəs","extraExplanation":["这个词由前缀 non-（“不”）+ lugubrious（“悲哀的、阴沉的”）组成。英语里 lugubrious 常用于形容“语气/表情/文字风格”很哀伤、沉重；nonlugubrious 则强调“不要那么丧、不要过度悲情”。","lugubrious 在日常口语里不算常见，因此 nonlugubrious 更偏书面、幽默或评论式用法（比如影评、书评、演讲风格评价）。更常用的替代词有: upbeat（积极的）、cheerful（愉快的）、not too somber（不太肃穆/阴沉）。"]}
{"word":"nonlugubriously","summary":{"en":"“Nonlugubriously” means “not sadly or gloomily; in a cheerful or un-mournful way.”","zh":"“nonlugubriously”表示“并不悲伤或阴郁地；以较轻快、不哀伤的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is **not** sad, gloomy, or mournful; cheerfully or at least without heaviness.","zh":"以**不**悲伤、阴郁或哀伤的方式；轻快地，或至少不沉重地。"},"examples":[{"en":"She spoke about the past nonlugubriously, focusing on what she had learned.","zh":"她谈起过去时并不阴郁，而是更强调自己学到了什么。"},{"en":"The memorial was conducted nonlugubriously, with music and warm stories.","zh":"追思会并不沉闷哀伤，而是有音乐和温暖的故事。"}]}],"synonyms":["cheerfully","lightly","brightly","without gloom","in an un-mournful way"],"phonetic":"ˌnɑnluˈɡuːbriəsli","extraExplanation":["“nonlugubriously”由前缀 **non-**（不、非）+ **lugubriously**（阴郁地、哀伤地）构成。它非常少见，多用于正式写作或刻意幽默的语气（因为词形很长）。","相关词族：**lugubrious**（adj. 阴郁的、哀伤的），**lugubriously**（adv. 阴郁地），**lugubriousness**（n. 阴郁/哀伤的状态）。日常表达中更常用：**cheerfully / lightly / without being gloomy**（轻快地/不阴郁地）。"]}
{"word":"nonlugubriousness","summary":{"en":"Nonlugubriousness means a lack of gloom or mournfulness—being not sad or not overly serious in tone.","zh":"nonlugubriousness 指“不阴郁、不哀伤”的特质或状态，即语气/氛围不悲沉、不苦闷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not being lugubrious; a lack of sadness, gloom, or overly mournful seriousness.","zh":"不忧郁、不阴沉的状态或特质；缺乏悲伤、哀伤或过度沉重的气氛。"},"examples":[{"en":"The film’s nonlugubriousness comes from its warm humor, even when it talks about difficult topics.","zh":"这部电影的“不阴郁感”来自它温暖的幽默，即使它讨论的是沉重话题。"},{"en":"Her nonlugubriousness made the room feel lighter after the bad news.","zh":"在坏消息之后，她那种不阴沉的气质让房间的气氛轻松了些。"}]}],"synonyms":["cheerfulness","lightheartedness","brightness","buoyancy","not gloominess"],"phonetic":"/ˌnɑnluˈɡuːbriəsnəs/","extraExplanation":["这是一个相对少见、带点“临时造词/学术腔”的名词：non-（不、非）+ lugubrious（悲伤阴郁的）+ -ness（把形容词变成名词）。日常英语更常说：cheerfulness / lightheartedness / not gloomy / less gloomy。","因为词很长，常用于强调“刻意不沉重”的对比语气，比如在描述一场本来可能很悲伤、但被处理得更轻松的演讲/电影/文章时。"]}
{"word":"nonluminescence","summary":{"en":"Nonluminescence means the absence of light emission—something does not glow; in science it can imply energy is released without producing light.","zh":"Nonluminescence 指“不发光/无发光性”；在科学语境中也可指能量释放时没有产生发光现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not producing light (the absence of luminescence)","zh":"不发光的状态；无发光性（发光现象的缺失）"},"examples":[{"en":"In complete darkness, the cave walls showed nonluminescence—no glow at all.","zh":"在完全黑暗中，洞壁呈现不发光的状态——一点光都没有。"},{"en":"The artist used matte pigments to emphasize nonluminescence and create a quiet mood.","zh":"这位艺术家使用哑光颜料来突出不发光的效果，营造安静的氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"in science (physics/chemistry/materials): a condition where a substance does not emit light, especially when energy is released through non-radiative processes instead of glowing","zh":"（科学：物理/化学/材料）物质不发光的情况，尤指能量主要通过“非辐射”过程释放而不是以发光形式释放"},"examples":[{"en":"At higher temperatures, nonluminescence increased because the excited energy was lost as heat.","zh":"在更高温度下，不发光现象增强，因为激发能量以热的形式散失了。"},{"en":"Impurities can cause nonluminescence in crystals that normally fluoresce.","zh":"杂质会导致原本会荧光的晶体出现不发光。"}]}],"synonyms":["absence of luminescence","nonemission (of light)","no glow","darkness (context-dependent)"],"phonetic":"/ˌnɑnˌluːməˈnɛsəns/","extraExplanation":["这个词由 non-（否定前缀，“不、非”）+ luminescence（发光）组成，字面意思就是“没有发光”。常见于学术写作或技术说明，日常口语更常说 no glow / not luminescent / no luminescence。","在材料科学或光谱学里，不发光可能意味着：能量没有以光子形式放出，而是通过分子振动、碰撞等途径转化为热（常被称为“非辐射弛豫”）。"]}
{"word":"nonluminescent","summary":{"en":"Nonluminescent means “not giving off light,” especially in a scientific sense of “not showing luminescence (like fluorescence or phosphorescence).”","zh":"Nonluminescent 表示“不发光的”，尤其用于科学语境，指“不发生发光现象（如荧光、磷光）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not giving off light; not glowing.","zh":"不发光的；不发亮的。"},"examples":[{"en":"The nonluminescent paint looks matte under normal indoor lighting.","zh":"这种不发光的涂料在普通室内灯光下看起来是哑光的。"},{"en":"They used nonluminescent materials to avoid any glow in the dark.","zh":"他们使用不发光的材料，以避免在黑暗中出现任何微光。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical/scientific) Not emitting light as a result of luminescence (e.g., fluorescence or phosphorescence).","zh":"（技术/科学）不发生发光现象的；不以（如荧光、磷光等）方式发光的。"},"examples":[{"en":"Under UV light, the sample stayed nonluminescent, suggesting no fluorescent compounds.","zh":"在紫外光下，样品仍然不发光，说明可能没有荧光化合物。"},{"en":"The mineral is nonluminescent, so it won’t glow under a black light.","zh":"这种矿物不发光，所以在黑光灯下不会发亮。"}]}],"synonyms":["not glowing","nonluminous","nonfluorescent","not light-emitting"],"phonetic":"ˌnɑnˌluːməˈnɛsənt","extraExplanation":["“non-”是常见前缀，表示“非/不”。“luminescent”来自拉丁语词根 *lumen*（光），常用于描述“发冷光/自发光”的现象（例如荧光、磷光）。因此“nonluminescent”多见于材料、矿物、实验报告或产品说明书里，强调“不会产生（可见的）发光”。","日常英语里更常说：**not glowing / not luminous / not fluorescent**。如果你想表达“本来就不亮/不反光”，也可能用 **dull / matte**（哑光的）来描述外观；如果强调“不会在紫外线下发光”，用 **nonfluorescent** 更具体。"]}
{"word":"nonluminosity","summary":{"en":"Nonluminosity means the state of not giving off light or lacking brightness.","zh":"nonluminosity 指“不发光或缺乏亮度的状态/性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being luminous; lack of light or brightness","zh":"不发光；无光性；缺乏光亮的状态或性质"},"examples":[{"en":"The cave’s nonluminosity made it hard to see anything without a flashlight.","zh":"洞穴的无光性让人不借助手电筒几乎什么都看不见。"},{"en":"Astronomers can infer a black hole’s presence from the nonluminosity of the object itself and the effects around it.","zh":"天文学家可以从该天体本身不发光以及其周围的影响来推断黑洞的存在。"}]}],"synonyms":["darkness","lack of light","absence of light","dimness","nonluminousness"],"phonetic":"/ˌnɑnˌluːməˈnɑsəti/","extraExplanation":["这个词比较少见，更多时候英语会用更常见的表达来替代，比如：darkness（黑暗）、lack of brightness（缺乏亮度）、absence of light（没有光）、nonluminous / not luminous（不发光的，作形容词）。","构词上：non- 表示“非/不”，luminosity 表示“发光度/亮度”。因此 nonluminosity 字面意思就是“非发光/不具亮度”。在科学语境（如天文学、物理）里偶尔更贴切，因为它强调“对象本身不发光”，而不只是“环境很暗”。"]}
{"word":"nonluminous","summary":{"en":"Nonluminous means “not emitting light; not shining.”","zh":"nonluminous 表示“不发光的；不明亮的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not giving off light; not shining (the opposite of luminous).","zh":"不发光的；不明亮的（与 luminous 相反）。"},"examples":[{"en":"The paint looks bright in daylight but becomes nonluminous at night.","zh":"这种油漆在白天看起来很亮，但到了晚上就不发光了。"},{"en":"Nonluminous objects can still be seen if they reflect light from another source.","zh":"不发光的物体仍然可以被看到，只要它们反射来自其他光源的光。"}]}],"synonyms":["unlit","dark","lightless"],"phonetic":"/ˌnɑnˈlu.mə.nəs/","extraExplanation":["构词法：non- 表示“非、不”，luminous 表示“发光的、明亮的”，合起来 nonluminous 就是“非发光的”。","常见使用场景：科学/技术写作中会用来区分“发光（luminous）”与“反光或被照亮（illuminated）”的物体。例如月亮本身不发光（nonluminous），我们看到它是因为反射太阳光。"]}
{"word":"nonluminously","summary":{"en":"“Nonluminously” means “without emitting light; not shining.”","zh":"“nonluminously”表示“以不发光的方式；不发出光亮地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not produce or give off light; without shining.","zh":"以不发光的方式；不发出光亮地。"},"examples":[{"en":"The moon itself does not shine; it glows nonluminously by reflecting sunlight.","zh":"月亮本身并不发光；它是通过反射阳光而“非自发光地”发亮。"},{"en":"The mineral sat nonluminously in the dark until a lamp was turned on.","zh":"那块矿物在黑暗中静静地不发光，直到灯被打开。"}]}],"synonyms":["without emitting light","in a non-luminous way","darkly (context-dependent)"],"phonetic":"/ˌnɑnˈluːmənəsli/","extraExplanation":["“nonluminously”比较少见，更常见的表达是“not luminous / non-luminous（不发光的）”或“without emitting light（不发出光）”。","构词：non-（不）+ luminous（发光的）+ -ly（副词）。在科学写作里可用于对比“luminously（明亮地/发光地）”。"]}
{"word":"nonluminousness","summary":{"en":"Nonluminousness means the state of not emitting light.","zh":"Nonluminousness 指“不发光的状态/性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not producing light; lack of luminosity","zh":"不发光的性质；无光度；不具光亮的状态"},"examples":[{"en":"The cave’s nonluminousness made it impossible to see without a flashlight.","zh":"洞穴的无光性使得没有手电筒就完全看不见。"},{"en":"Scientists measured the material’s nonluminousness to confirm it did not emit visible light.","zh":"科学家测量了该材料的无光性，以确认它不会发出可见光。"}]}],"synonyms":["lack of luminosity","non-luminosity","absence of light emission","darkness (context-dependent)"],"phonetic":"/ˌnɑnˈlu.mə.nəs.nəs/","extraExplanation":["这是一个较少见的名词，结构是 non-（否定前缀）+ luminous（发光的）+ -ness（名词后缀），字面意思就是“发光的性质”的相反：不发光的性质。日常更常用的表达包括 not luminous、non-luminous，或在技术语境里用 non-emissive（不发射光的）等说法。","注意它通常描述“物体自身不发光”，不等同于 dark（黑暗的/光线不足的）或 opaque（不透明的）。例如：一个物体可以不发光（nonluminous），但仍然可以在强光下被看见（因为它反射光）。"]}
{"word":"nonluster","summary":{"en":"Nonluster (often written non-luster) means “without shine or sparkle; dull, unimpressive.” More common: lackluster/lusterless.","zh":"nonluster（常见写法 non-luster）指“无光泽、黯淡；不出彩”。更常用表达：lackluster / lusterless。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"**Nonluster** (more commonly written **non-luster**) means *without luster*—not shiny, not impressive, or not lively.","zh":"**nonluster**（更常写作 **non-luster**）意思是“没有光泽/没有亮点”，引申为“不出彩、无活力”。"},"examples":[{"en":"The silver looked **nonluster** after years without polishing.","zh":"这块银器多年没打磨，看起来**黯淡无光**。"},{"en":"The project had a **nonluster** start, but it improved later.","zh":"这个项目一开始**平平无奇**，但后来有所起色。"}]}],"synonyms":["lackluster","lusterless","dull","uninspired","flat"],"phonetic":"/ˌnɑnˈlʌstɚ/","extraExplanation":["“nonluster”不是特别常见、也不算最标准的常用拼写。英语里更常用的是 **lackluster**（英式拼写 lacklustre）或 **lusterless** 来表达“黯淡/不出彩”。citeturn0search0turn0search3turn0search5","语气差别：**lackluster** 很常用，既能形容“没光泽”，也常形容“表现无力、乏善可陈”（a lackluster performance）。citeturn0search0turn0search7","文化小知识：有资料提到 **lackluster** 早期用法可追溯到莎士比亚作品中的复合词用法，后来才更广泛地用于描述“乏味、不精彩”。citeturn0search1"]}
{"word":"nonlustrous","summary":{"en":"Nonlustrous means not shiny or lacking luster; it can also mean visually dull.","zh":"nonlustrous 指“无光泽的、不发亮的”，也可引申为“外观暗淡、不够吸引目光的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not shiny; lacking luster (not reflecting light in a bright way).","zh":"无光泽的；不发亮的（不强烈反光的）。"},"examples":[{"en":"The ring looked nonlustrous after years of wear.","zh":"这枚戒指戴了多年后看起来失去了光泽。"},{"en":"Choose a nonlustrous finish if you want to reduce glare in photos.","zh":"如果你想减少照片反光，可以选择无光泽的表面处理。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dull or unexciting in appearance; not visually striking.","zh":"外观暗淡的；不显眼的（不够吸引目光的）。"},"examples":[{"en":"The paint color was nonlustrous and made the room feel flat.","zh":"这个油漆颜色很暗淡，让房间显得缺乏层次。"}]}],"synonyms":["dull","matte","lusterless","lackluster"],"phonetic":"/ˌnɑnˈlʌstrəs/","extraExplanation":["“non-”是否定前缀，表示“非、无”；“lustrous”来自“luster（光泽）”。所以 nonlustrous 直译就是“没有光泽的”。","写法上常见的是连字符形式“non-lustrous”，两种写法通常都能理解；在正式写作里若需统一风格，可按所用词典或出版规范选择一种。"]}
{"word":"nonlustrously","summary":{"en":"“Nonlustrously” means “in a way that is not shiny or glossy; dully/matte.”","zh":"“nonlustrously”表示“以不发亮、无光泽的方式；暗淡地/哑光地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a dull or matte way; without shine or gloss.","zh":"以无光泽的方式；暗淡地、没有闪光地。"},"examples":[{"en":"The metal surface reflected light nonlustrously, looking almost gray.","zh":"金属表面无光泽地反着光，看起来几乎是灰色的。"},{"en":"She chose a nonlustrously finished paint for a soft, calm look.","zh":"她选了无光泽处理的油漆，让整体看起来柔和、安静。"}]}],"synonyms":["dully","matte","flatly","without a shine"],"phonetic":"/ˌnɑnˈlʌstrəsli/","extraExplanation":["“nonlustrously”由 non-（否定前缀，“不、无”）+ lustrous（有光泽的）+ -ly（副词后缀）构成，意思就是“以不发亮的方式”。","这个词在日常口语中比较少见；更常见的替代说法有：“dully / matte(ly) / without a shine”。在写作里用它会显得更正式、更精确，多见于材料、绘画、摄影、设计等语境。"]}
{"word":"nonlustrousness","summary":{"en":"Nonlustrousness means the quality of being dull or not shiny—lacking luster.","zh":"nonlustrousness 指“无光泽、暗淡”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not being shiny or not reflecting much light; dullness (lack of luster).","zh":"不光泽；无光泽的状态（缺乏亮度、反光性，显得暗淡）。"},"examples":[{"en":"The nonlustrousness of the fabric made it look simple and understated.","zh":"这种布料的无光泽让它看起来朴素而低调。"},{"en":"Under bright lights, the stone’s nonlustrousness was obvious compared with polished gems.","zh":"在强光下，这块石头的无光泽与抛光宝石相比非常明显。"},{"en":"A thin layer of dust increased the nonlustrousness of the metal surface.","zh":"一层薄灰让金属表面变得更无光泽。"}]}],"synonyms":["dullness","lack of luster","matteness","flatness"],"phonetic":"/ˌnɑnˈlʌstrəsnəs/","extraExplanation":["这是一个相对少见、偏书面或技术语境的名词，常见于材料、纺织、矿物/宝石描述等场合。日常英语里更常说 **dullness**、**lack of luster**、**matte finish**。","构词：**non-**（不、非）+ **lustrous**（有光泽的）+ **-ness**（把形容词变成名词，表示“……的状态/性质”）。因此字面意思就是“没有光泽的性质”。","相关对比：**matte** 通常指“哑光（表面处理/质感）”，不一定带负面；而 **nonlustrousness/dullness** 常强调“缺少光彩”，语气可能更偏“暗淡、不亮”。"]}
{"word":"nonly","summary":{"en":"“Nonly” is a very rare, nonstandard word mostly seen in word-game lists; in normal English, use “not,” “non-,” or possibly “only,” depending on meaning.","zh":"“nonly”非常罕见且不标准，多见于拼字游戏词表；日常英语中通常应根据意思改用“not”“non-”或可能是“only”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard / word-game vocabulary) Listed in some Scrabble-style word lists as an adverb form related to the prefix “non-” (“not”). It is not used in normal modern English writing or speech.","zh":"（非标准/文字游戏用词）在一些拼字游戏（如 Scrabble）词表中被收录，作为与“non-”（表示“非/不”）相关的副词形式。但在现代日常英语中几乎不使用。"},"examples":[{"en":"“Nonly” may be accepted in some word-game dictionaries, but most English speakers never use it in real life.","zh":"“nonly” 可能在一些文字游戏词典里算有效词，但大多数英语母语者在真实交流中不会使用它。"},{"en":"In standard English, you would write “not” (or sometimes “non-” as a prefix), not “nonly.”","zh":"在标准英语里，你会写“not”（或用“non-”作前缀），而不是“nonly”。"}]}],"synonyms":["not (standard alternative)","non- (prefix alternative)"],"phonetic":"/ˈnɑnli/","extraExplanation":["“nonly”很可能是拼错或误读。你可能想找的是：\n1）only（“仅仅/唯一”）\n2）nonyl（化学名词：壬基）\n3）nylon（“尼龙”）——它们都和“nonly”字母很接近（或可互为变位词）。\n如果你告诉我你看到“nonly”的句子/上下文，我可以帮你判断正确词是什么。"]}
{"word":"nonlymphatic","summary":{"en":"“Nonlymphatic” means not related to the lymphatic system; used mostly in medical contexts.","zh":"“nonlymphatic”意为“非淋巴性的”，多用于医学语境中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to the lymphatic system (the body’s network of lymph vessels, lymph nodes, and lymph fluid).","zh":"不与淋巴系统相关的；非淋巴性的（淋巴系统指淋巴管、淋巴结与淋巴液组成的身体网络）。"},"examples":[{"en":"The scan showed enlarged nodes caused by a nonlymphatic infection.","zh":"扫描显示淋巴结肿大是由非淋巴性的感染引起的。"},{"en":"The doctor explained that the swelling was nonlymphatic, so lymph drainage therapy wouldn’t help much.","zh":"医生解释说肿胀并非淋巴性，因此淋巴引流治疗帮助不大。"}]}],"synonyms":["non-lymphatic","not lymphatic","extralyphatic (context-specific)"],"phonetic":"/ˌnɑn.lɪmˈfætɪk/","extraExplanation":["“nonlymphatic”常见于医学写作（如影像学报告、病理描述），用来区分病变或通路是否与淋巴系统有关。例如：metastasis via nonlymphatic routes（经非淋巴途径转移）。","构词：non-（否定前缀，“非……”）+ lymphatic（淋巴的）。在正式写作中也可用“non-lymphatic”（加连字符）以便阅读。"]}
{"word":"nonlyric","summary":{"en":"Nonlyric means “not lyrical,” especially describing poetry or writing that isn’t in a lyric style; it can also (less commonly) mean “without lyrics.”","zh":"nonlyric 意为“不抒情的”，多用于描述非抒情风格的诗歌/写作；也可较少见地指“没有歌词的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of poetry or writing) not written in a lyric style; more narrative, explanatory, or formal rather than expressing personal feelings in a musical way.","zh":"（尤指诗歌或写作）非抒情体的；更偏叙事、说明或议论，而不是以音乐感强、表达个人情感的方式来写。"},"examples":[{"en":"The poem is intentionally nonlyric, focusing on social facts instead of personal emotion.","zh":"这首诗刻意写成非抒情体，着重社会事实而不是个人情绪。"},{"en":"Her early work is nonlyric and reads almost like a short story.","zh":"她的早期作品不太抒情，读起来几乎像短篇小说。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) not containing lyrics; purely instrumental or without sung words.","zh":"（较少见）没有歌词的；纯器乐的或不含演唱文字的。"},"examples":[{"en":"The soundtrack includes several nonlyric pieces written for strings and piano.","zh":"这张原声带里有几段没有歌词的曲子，由弦乐和钢琴演奏。"}]}],"synonyms":["unlyrical","non-lyric","unpoetic","prosaic","instrumental"],"phonetic":"/ˌnɑnˈlɪrɪk/","extraExplanation":["“nonlyric”在日常英语里比较少见，更常见的写法是“non-lyric”（加连字符）或用更普遍的词“unlyrical”（不抒情的）。","在文学批评里，“lyric（抒情诗/抒情风格）”强调声音感与个人情感表达；“nonlyric”则常用来强调叙事性、论述性或客观记录的写法。音乐语境中，如果想表达“没有歌词”，更自然的常用词通常是“instrumental”。"]}
{"word":"nonlyrical","summary":{"en":"Nonlyrical means “not lyrical”—not emotional or songlike in style.","zh":"nonlyrical 表示「非抒情的」——風格不偏情感抒發或歌唱般的語感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not lyrical; not having the qualities of lyric poetry or lyric song (e.g., not strongly emotional, personal, or musical in style).","zh":"非抒情的；不具抒情詩或抒情歌曲特質的（例如風格不強調情感、個人抒發或音樂性）。"},"examples":[{"en":"The film uses a mostly nonlyrical style, focusing on facts rather than feelings.","zh":"這部電影大多採用非抒情的風格，重點放在事實而不是感受。"},{"en":"Her voice is clear and direct—almost nonlyrical compared with her earlier, romantic songs.","zh":"她的聲音清晰直接——和她早期浪漫的歌曲比起來，幾乎算是非抒情的。"},{"en":"The poem’s nonlyrical tone makes it feel more like a report than a confession.","zh":"這首詩的非抒情語氣讓它讀起來更像報告，而不是自白。"}]}],"synonyms":["unlyrical","prosaic","matter-of-fact","plain","literal"],"phonetic":"/ˌnɑnˈlɪrɪkəl/","extraExplanation":["「nonlyrical」在實際寫作中更常寫成「non-lyrical」（加連字號）。用在音樂時，常指「不是歌詞/旋律主導的部分」，例如「non-lyrical passage」可指較像朗誦、對白或純敘述的段落。","「lyrical」常帶有「抒情、像歌一樣、富有音樂性或情感」的語感；加上「non-」後，通常是在對比一種更客觀、敘事性（narrative）、或更直接理性的表達方式。"]}
{"word":"nonlyrically","summary":{"en":"“Nonlyrically” means “not in a lyrical or poetic way,” often describing plain, factual, or restrained expression.","zh":"“nonlyrically”表示“非抒情/非诗意地”，常用于形容表达直白、偏事实或更克制。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not lyrical (not song-like, poetic, or strongly expressive in a musical/poetic style).","zh":"以非抒情的方式；不带歌曲感、诗意或强烈抒情/音乐化风格地。"},"examples":[{"en":"The narrator speaks nonlyrically, using simple words and a calm tone.","zh":"叙述者用非抒情的方式说话，词语朴素、语气平静。"},{"en":"She wrote about grief nonlyrically, focusing on facts rather than metaphors.","zh":"她以非抒情的方式写悲伤，更强调事实而不是隐喻。"},{"en":"The poem begins nonlyrically, like a report, and only later becomes musical.","zh":"这首诗开头很非抒情，像报告一样，后来才变得更有音乐感。"}]}],"synonyms":["plainly","straightforwardly","prosaically","matter-of-factly","unpoetically"],"phonetic":"/ˌnɑnˈlɪrɪkli/","extraExplanation":["这个词很少见，多用于文学评论/写作讨论中。它通常是由 non-（不、非）+ lyrically（抒情地）构成，表示“刻意不走抒情路线”，更偏客观、叙述性或分析性。","写作里常见的对比是 lyrically（更诗意/更有音乐感） vs. plainly / straightforwardly（更直白）。“nonlyrically”有时带一点“克制、不煽情”的评价色彩，具体褒贬取决于语境。"]}
{"word":"nonlyricalness","summary":{"en":"Nonlyricalness means the quality of not being lyrical—plain, practical, or not very poetic/expressive.","zh":"nonlyricalness 指“非抒情性”，即风格偏朴素务实、不太诗意或不强调情感表达的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being non-lyrical; a plain, practical, or unpoetic style (especially in writing, speech, or music lyrics).","zh":"“非抒情性；不具诗意/不浪漫的特质”，指文字、语言或歌词风格偏朴素、务实、不带强烈抒情色彩。"},"examples":[{"en":"The report’s nonlyricalness makes it clear and easy to follow.","zh":"这份报告的“非抒情性”让它清晰易懂。"},{"en":"She liked the poem’s emotional honesty but criticized its nonlyricalness.","zh":"她喜欢那首诗的真诚情感，但批评它不够抒情、缺少诗意。"}]}],"synonyms":["plainness","prosaicness","lack of lyricism","unpoetic style"],"phonetic":"/ˌnɑnˈlɪrɪkəlnəs/","extraExplanation":["“nonlyricalness”不是非常常见、也不算标准固定词（更像是临时造词/写作中的创造性用法）。它由 non-（不、非）+ lyrical（抒情的、有诗意的）+ -ness（名词后缀：……的性质）组成，字面意思就是“非抒情的性质”。","更自然的表达通常是：lack of lyricism（缺乏抒情性/诗意）、a non-lyrical style（非抒情风格）、plain/prosaic tone（朴素/散文化的语气）。","注意：lyrical 在英语里既可指“像诗一样优美动人”，也可指“与歌词/抒情表达有关”。所以 nonlyricalness 可能表示“语言不够诗意”，也可能表示“表达方式更叙述、更客观”。"]}
{"word":"nonlyricism","summary":{"en":"Nonlyricism means a lack of lyric (songlike, emotionally melodic) quality, often discussed as a deliberate style in poetry or prose.","zh":"Nonlyricism 指“非抒情性”：缺乏歌唱般的旋律感与抒情气质，常用于诗歌或散文风格讨论，也可指一种刻意不走抒情路线的写作选择。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or style of being not lyrical (not songlike, melodic, or emotionally “singing”), especially in poetry or other writing","zh":"（尤指诗歌或写作中）缺乏抒情性／不具歌唱般旋律与情感流动的特质或风格"},"examples":[{"en":"The poet’s late work is known for its nonlyricism—plain diction, sharp observation, and very little musical flourish.","zh":"这位诗人后期作品以“非抒情性”著称：用词朴素、观察尖锐，几乎没有音乐性的铺陈。"},{"en":"Critics praised the book’s nonlyricism, arguing that the dry tone fit the subject matter.","zh":"评论家称赞这本书的“非抒情性”，认为这种干冷的语气与主题十分契合。"}]},{"partOfSpeech":"n.","definition":{"en":"(in literary discussion) a deliberate approach that resists lyric effects such as heightened musicality, intimate confession, or rich imagery","zh":"（文学讨论中）一种刻意抵抗“抒情效果”的写作取向，例如避免强烈的音乐感、私密自白式语气或浓密意象"},"examples":[{"en":"Her nonlyricism feels intentional: the poem reads more like a report than a song.","zh":"她的非抒情性像是刻意为之：这首诗读起来更像一份报告，而不是一首歌。"},{"en":"In workshops, the instructor asked whether the nonlyricism was a choice or just an early draft stage.","zh":"在写作工坊里，老师问这种非抒情性是创作选择，还是只是初稿阶段的结果。"}]}],"synonyms":["anti-lyricism (close in idea, less common)","plain style (near in effect)","unlyricalness (rare)","non-lyrical style (phrase)"],"phonetic":"/ˌnɑnˈlɪrɪˌsɪzəm/","extraExplanation":["“nonlyricism”在日常英语中比较少见，更常见的是形容词 **nonlyric / nonlyrical**（不抒情的）或 **unlyrical**（缺乏诗意/抒情的）。在评论诗歌、散文风格时，才更可能看到这个名词形式。","构词很直观：**non-**（不、非）+ **lyricism**（抒情性）。有时也会写成 **non-lyricism**。使用时通常带一点“文学批评语境”的味道。"]}

