{"word":"nonna","summary":{"en":"Nonna means “grandmother,” borrowed from Italian and used as a warm family term.","zh":"Nonna 源自意大利语，意为“祖母（奶奶/外婆）”，在英语中常作亲昵称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A grandmother (Italian); often used as a warm family term, especially in Italian or Italian-American communities.","zh":"（意大利语）外婆/奶奶；常用作亲昵的家庭称呼，尤其在意大利或意大利裔社群中。"},"examples":[{"en":"My nonna makes the best pasta on Sundays.","zh":"我奶奶/外婆周日做的意面最好吃。"},{"en":"We’re visiting Nonna for her birthday.","zh":"我们要去看望奶奶/外婆，给她过生日。"},{"en":"Nonna told me stories about her childhood in Italy.","zh":"奶奶/外婆给我讲了她在意大利的童年故事。"}]}],"synonyms":["grandmother","grandma","granny","nana"],"phonetic":"/ˈnɑːnə/","extraExplanation":["“Nonna”来自意大利语，意思是“祖母”。在英语里常被直接借用，尤其在意大利移民家庭中，带有亲切、家庭氛围浓厚的感觉。","大小写：当作称呼用、相当于人名时常大写（Nonna, come here.）；泛指“我的奶奶/外婆”时通常小写（my nonna）。","意大利语中对应的“爷爷/外公”常说 nonno。美国文化中与食物、家庭聚会（尤其周日家庭午餐）等场景联系很强。","在一些英语文本或影视里，“Nonna”也可能用来指“像祖母一样照顾家人的年长女性”，强调温暖与照料的角色。"]}
{"word":"nonnant","summary":{"en":"“Nonnant” is not a standard English word; it most often appears as a French surname and may be a misspelling of a similar word.","zh":"“nonnant”不是标准英语词；更常见作法语姓氏，也可能是相近词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard in English) A rare or nonstandard spelling; most English dictionaries do not list “nonnant” as an English word.","zh":"（非标准英语）一种很少见或非标准的拼写；大多数英语词典不把“nonnant”当作英语单词收录。"},"examples":[{"en":"I couldn’t find “nonnant” in an English dictionary, so it may be a typo.","zh":"我在英语词典里找不到“nonnant”，所以它可能是拼写错误。"},{"en":"If you saw “nonnant” in a text, check whether it was meant to be “nonant” or “nonextant.”","zh":"如果你在文章里看到“nonnant”，可以确认一下是不是想写“nonant”或“nonextant”。"}]},{"partOfSpeech":"n.","definition":{"en":"A French family name (surname), seen in genealogical records.","zh":"法语姓氏（家族姓），可见于家谱/谱系记录中。"},"examples":[{"en":"She found the surname Nonnant in old French records.","zh":"她在法国旧档案里找到了姓氏 Nonnant。"},{"en":"The Nonnant family appears in several genealogical databases.","zh":"Nonnant 这个姓氏出现在一些家谱数据库中。"}]}],"phonetic":"/ˈnɑnənt/","extraExplanation":["“nonnant”更常见于法语语境：它可以是法国姓氏；同时也可能只是拼写变体（例如与法国地名 Nonant 的历史拼写形式有关）。","如果你想查的是英语词汇，最常见的“相近目标词”可能是：\n- nonextant（adj. 不复存在的、已失传的）\n- nonant / Nonant（专有名词：法国诺曼底的一个地名）\n- nonante（法语：90；主要在比利时/瑞士法语区使用，不是英语）\n你可以告诉我这个词出现的句子/上下文，我可以帮你精确判断。"]}
{"word":"nonnarcism","summary":{"en":"Nonnarcissism means a lack of narcissism—being less self-centered and more able to consider others.","zh":"nonnarcissism 指“非自恋/缺乏自恋倾向”，强调不以自我为中心、更能顾及他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) The state or quality of not being narcissistic; a lack of excessive self-focus or self-admiration.","zh":"（罕用）非自恋；不以自我为中心的状态或特质；缺乏过度的自我关注与自我崇拜。"},"examples":[{"en":"In team settings, nonnarcissism helps people share credit and listen to feedback.","zh":"在团队合作中，非自恋能让人愿意分享功劳并倾听反馈。"},{"en":"Her leadership style was marked by nonnarcissism and steady concern for others.","zh":"她的领导风格带有非自恋的特质，并稳定地关心他人。"}]}],"synonyms":["humility","modesty","unselfishness","selflessness","empathy"],"phonetic":"ˌnɑnˈnɑrsəˌsɪzəm","extraExplanation":["你输入的 **nonnarcism** 很可能是想写 **nonnarcissism**（或更常见的写法 **non-narcissism**）。在日常英语里，这个名词不算常用；更自然的表达通常是 **being non-narcissistic**（不自恋/不以自我为中心）或直接用 **humility**（谦逊）、**modesty**（谦虚）、**empathy**（同理心）等词来描述。","心理学语境中，narcissism（自恋/自恋倾向）有较专门的含义；而 “non-narcissism” 常用于一般讨论，强调更健康的人际态度（例如能共情、愿意承担责任、不过度追求关注）。"]}
{"word":"nonnarcissism","summary":{"en":"Nonnarcissism means not being narcissistic—being humble and not overly self-centered.","zh":"nonnarcissism 指“非自恋”：不自恋、不过度自我中心，更谦逊、更关注他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not being narcissistic; a tendency to be humble, other-focused, and not overly concerned with one’s own importance or admiration.","zh":"非自恋；不自恋的状态或特质；倾向于谦逊、以他人为中心，而不是过度在意自我重要性或他人的崇拜。"},"examples":[{"en":"Her nonnarcissism showed in the way she listened carefully and gave others credit.","zh":"她的非自恋体现在她认真倾听、并把功劳让给别人。"},{"en":"In teamwork, nonnarcissism can help people share responsibility instead of seeking attention.","zh":"在团队合作中，非自恋能帮助大家分担责任，而不是争夺关注。"}]}],"synonyms":["humility","modesty","selflessness","unselfishness","other-centeredness"],"phonetic":"/ˌnɑnˈnɑr.sɪˌzɪz.əm/","extraExplanation":["“nonnarcissism”不是特别常见的标准词典词，更常见的写法是“non-narcissism”（带连字符），意思通常也更清晰。","构词上是“non-（不、非）+ narcissism（自恋）”。在学术或讨论心理特质的语境里，有时会用这种“non-”构词来表达“缺乏某种倾向/特征”。","注意：它并不一定等于“完全没有自我关注”。很多语境里它更接近“不过度自我中心、不会为了被崇拜而行动”。如果想表达更自然的英文，可以考虑用“humility（谦逊）”“modesty（谦虚）”“selflessness（无私）”等词来替换。"]}
{"word":"nonnarcissistic","summary":{"en":"Nonnarcissistic means “not narcissistic”—not overly self-centered; often implying humility and empathy.","zh":"nonnarcissistic 意为“非自恋的”——不过度以自我为中心，常暗示谦逊与同理心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not narcissistic; not showing an excessive focus on oneself, one’s own importance, or one’s own needs (often implying humility, empathy, or consideration for others).","zh":"非自恋的；不表现出过度以自我为中心、夸大自我重要性或只顾自己需求的倾向（常暗示谦逊、有同理心、会顾及他人）。"},"examples":[{"en":"She’s confident but nonnarcissistic—she listens carefully and gives others credit.","zh":"她很自信，但不自恋——她会认真倾听，也会把功劳归给别人。"},{"en":"He answered the praise in a nonnarcissistic way, thanking the whole team instead of bragging.","zh":"他用一种不自恋的方式回应赞美：感谢整个团队，而不是自夸。"}]}],"synonyms":["humble","unassuming","selfless","empathetic","considerate","down-to-earth"],"phonetic":"/ˌnɑnˌnɑr.sɪˈsɪs.tɪk/","extraExplanation":["“nonnarcissistic”由前缀 non-（表示“非、不”）+ narcissistic（自恋的）构成，属于比较书面/学术的构词方式；日常口语里更常用 not narcissistic，或用更自然的形容词来表达相近意思，比如 humble（谦逊的）、down-to-earth（脚踏实地的）、self-effacing（不张扬的）、considerate（体贴的）、empathetic（有同理心的）。","注意它通常不是在说“完全没有自我”，而是强调“不过度自我中心”。在描述性格时，nonnarcissistic 往往带有褒义评价（更会共情、更愿意分享舞台），但在正式写作中也可以中性使用。","拼写上常见两种写法：nonnarcissistic（双 n）与 non-narcissistic（带连字符）。带连字符在正式文本中更清晰，尤其当读者可能扫读时。"]}
{"word":"nonnarcotic","summary":{"en":"“Nonnarcotic” means not a narcotic (often, not an opioid) and not producing narcotic effects; commonly used to describe non-opioid medicines for pain.","zh":"“nonnarcotic”指非麻醉药（常指非阿片类），不会产生麻醉药典型效应；常用来形容非阿片类的止痛用药。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing narcotics; not a narcotic drug (especially not an opioid) and not producing narcotic effects such as strong sedation or euphoria.","zh":"非麻醉性的；不含麻醉药成分的；（尤指）非阿片类、不会产生麻醉性镇静或欣快等“麻醉药效应”的。"},"examples":[{"en":"The doctor recommended a nonnarcotic pain reliever first.","zh":"医生建议先使用非麻醉性止痛药。"},{"en":"They tried nonnarcotic options to manage her back pain.","zh":"他们尝试用非麻醉性方案来控制她的背痛。"}]}],"synonyms":["non-opioid","non-narcotic","nonaddictive (not always exact)"],"phonetic":"/ˌnɑn nɑrˈkɑtɪk/","extraExplanation":["“nonnarcotic”常见于医学与法律语境（如处方、药品分类、政策文件）。在美国日常沟通中，更常见的说法是“non-opioid (pain reliever)”（非阿片类止痛药）或“non-narcotic medication”。","注意：它并不等于“无副作用”或“不会成瘾”。一些非麻醉性药物仍可能有风险（例如对胃、肝、肾的影响），只是通常不属于“麻醉药/阿片类”这一类。"]}
{"word":"nonnarration","summary":{"en":"Nonnarration means a lack of narration or story structure, or (in narratology) what a narrative leaves untold.","zh":"nonnarration 指缺乏叙述或故事结构；在叙事学中也可指叙事中“未被讲述/未被呈现”的部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of narration or of a clear story structure in a work of art, literature, film, etc.","zh":"（文学、艺术、电影等中的）无叙述；缺乏清晰故事/叙事结构的状态"},"examples":[{"en":"The film relies on images and sound, so its nonnarration feels more like an experience than a story.","zh":"这部电影主要依靠影像和声音，因此它的“无叙述”更像一种体验，而不是讲故事。"},{"en":"Some modern poems use nonnarration to focus on mood instead of plot.","zh":"有些现代诗用“无叙述”来突出氛围，而不是情节。"}]},{"partOfSpeech":"n.","definition":{"en":"in narratology: what is not told or is left unrepresented in a narrative (an absence that can still be meaningful)","zh":"（叙事学）未被讲述/未被呈现的内容（这种“缺席”本身也可能具有意义）"},"examples":[{"en":"The study examines the nonnarration of certain events to show how the author shapes readers’ attention.","zh":"这项研究考察某些事件的“未叙述”，以说明作者如何引导读者的注意力。"}]}],"synonyms":["lack of narrative","absence of narration","non-narrativity","nonstorytelling"],"phonetic":"/ˌnɑn.nəˈreɪ.ʃən/","extraExplanation":["“nonnarration”并不是日常高频词，更常见的搭配是形容词“nonnarrative / non-narrative（非叙事的）”。“nonnarration”多见于文学/电影研究、艺术评论等偏学术语境。","在叙事学里，它有时会和相关概念一起出现：比如“the nonnarrated（未被叙述的部分）”“the disnarrated（被提及但并未真正发生/实现的事件）”。这些都强调：作品里“没说的/没呈现的”也能制造意义与张力。"]}
{"word":"nonnarrative","summary":{"en":"Nonnarrative means “not in story form,” focusing on information, explanation, or analysis rather than plot and characters.","zh":"nonnarrative 指“非故事体的”，更侧重信息说明、解释或分析，而不是情节与人物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not told in the form of a story; not organized around a narrative (characters, plot, and a sequence of events).","zh":"非叙事的；不以故事形式呈现的；不围绕人物、情节与事件顺序来组织的。"},"examples":[{"en":"Many textbooks use nonnarrative writing that explains facts and concepts directly.","zh":"许多教材使用非叙事写作，直接解释事实与概念。"},{"en":"The article is mostly nonnarrative: it lists evidence rather than telling a personal story.","zh":"这篇文章大多是非叙事的：它列出证据，而不是讲个人故事。"},{"en":"Some documentaries mix narrative scenes with nonnarrative interviews and data.","zh":"有些纪录片把叙事片段与非叙事的访谈和数据结合起来。"}]}],"synonyms":["expository","informational","nonfiction (in many contexts)","analytic","fact-based"],"phonetic":"/ˌnɑnˈnærətɪv/","extraExplanation":["更常见的拼写是带连字符的 **non-narrative**（尤其在学术写作里），也有人写作不带连字符的 **nonnarrative**。两者意思相同。","常见语境：写作类型（说明文/议论文 vs. 叙事文）、阅读理解（narrative vs. informational/non-narrative text）、电影/纪录片结构（叙事段落 vs. 资料性段落）。"]}
{"word":"nonnasal","summary":{"en":"“Nonnasal” means “not nasal,” especially describing speech sounds made without airflow through the nose.","zh":"“nonnasal”意为“非鼻音的/不经鼻腔的”，常用于描述发音时气流不通过鼻腔。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not nasal; not produced through or involving the nose (especially in speech sounds)","zh":"非鼻音的；不经过鼻腔的（尤指语音/发音）"},"examples":[{"en":"Most English vowels are nonnasal (oral) unless they are affected by nearby nasal sounds.","zh":"英语里的大多数元音通常是非鼻音（口腔音）的，除非受到附近鼻音的影响。"},{"en":"Say the vowel again, but keep it nonnasal—let the air flow only through your mouth.","zh":"再读一遍这个元音，但要保持非鼻音——让气流只从口腔出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(medicine) not related to the nose; not occurring through the nasal passages","zh":"（医学）与鼻无关的；不经鼻腔发生/进行的"},"examples":[{"en":"The doctor recommended nonnasal methods of administration for this medication.","zh":"医生建议这种药物采用非鼻腔途径的给药方式。"}]}],"synonyms":["oral","non-nasal","denasal (less common)"],"phonetic":"/nɑnˈneɪzəl/","extraExplanation":["在语音学里，nonnasal 常用来对比 nasal（鼻音的）。鼻音/鼻化音通常表示气流同时经过口腔和鼻腔；nonnasal 则表示软腭抬起、鼻腔通道关闭，气流主要（或仅）从口腔出来，所以也常被称为 oral（口腔的）。","常见相关词：nasal（鼻音的/鼻化的）、nasalization（鼻化）、denasalize（去鼻化）、oral（口腔的；非鼻音的）。"]}
{"word":"nonnasality","summary":{"en":"Nonnasality means the absence of nasal resonance in speech—sounds produced with an “oral,” not nasal, quality.","zh":"Nonnasality 指语音中缺乏鼻腔共鸣的特征，即“口腔音质”、非鼻音的发音状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being nonnasal; the absence of nasal resonance in speech (i.e., sound produced mainly through the mouth rather than the nose)","zh":"（语音）非鼻音性；不带鼻腔共鸣的状态（声音主要从口腔发出而非经由鼻腔）"},"examples":[{"en":"The teacher asked the student to practice nonnasality by keeping the soft palate lifted.","zh":"老师让学生练习非鼻音性：把软腭抬起，减少鼻腔共鸣。"},{"en":"In speech therapy, improving nonnasality can help reduce an overly nasal voice.","zh":"在言语治疗中，增强非鼻音性有助于减轻过度鼻音的声音。"},{"en":"English vowels are usually produced with nonnasality unless they are influenced by nearby nasal sounds like /m/ or /n/.","zh":"英语元音通常是非鼻音的，除非受到附近 /m/ 或 /n/ 等鼻音的影响而发生鼻化。"}]}],"synonyms":["orality","oral quality","non-nasal quality","absence of nasality"],"phonetic":"/ˌnɑn neɪˈzæləti/","extraExplanation":["“nonnasality”来自形容词“nonnasal（非鼻音的）”，在语音学里常与“nasality（鼻音性/鼻化）”对比：当软腭（velum）抬起、鼻腔通道关闭时，气流主要走口腔，就表现为非鼻音性。","这个词本身不算日常高频，更常见的说法是“oral quality（口腔音质）/not nasal（不鼻音的）”。在描述口音、发声训练或腭咽闭合相关问题时会更常用到。","注意不要把它和网络上偶尔出现的非标准用法（把“nonnasality”解释成“非母语性/非母语者能力”之类）混淆；主流词典与语音学语境中，它指的是“非鼻音的发音特征”。"]}
{"word":"nonnasally","summary":{"en":"“Nonnasally” means “not in a nasal way,” especially when describing speech sounds or voice quality.","zh":"“nonnasally”表示“非鼻音地/不带鼻腔共鸣地”，多用于描述发音或嗓音特点。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is **not nasal** (i.e., without sending much air/sound through the nose).","zh":"以**非鼻音的方式**；（说话/发声时）**不带明显鼻腔共鸣**。"},"examples":[{"en":"Try to say the vowel clearly and **nonnasally**, without letting too much air go through your nose.","zh":"试着把这个元音发得清晰、**不带鼻音地**，不要让太多气流从鼻子出去。"},{"en":"After his cold was gone, he could speak **nonnasally** again.","zh":"感冒好了以后，他又能**不带鼻音地**说话了。"}]}],"synonyms":["not nasally","orally (phonetics)","without a nasal tone"],"phonetic":"/ˌnɑnˈneɪzəli/","extraExplanation":["“nonnasally”来自形容词“nonnasal（非鼻音的）”，常见于语言学/语音学语境，用来描述发音方式（尤其是元音或共鸣）偏“口腔音（oral）”，而不是“鼻音（nasal）”。","日常生活里更常说：“not nasally / without a nasal sound / with a clear (non-nasal) voice”。"]}
{"word":"nonnat","summary":{"en":"“nonnat” is a rare word mostly seen in names (Saint Raymond Nonnat/Nonnatus), meaning “not born,” linked to a traditional story of an unusual (cesarean) birth.","zh":"“nonnat”很罕见，多见于人名（如圣雷蒙德·Nonnat/Nonnatus），字面意为“未出生的”，与一种关于异常（剖腹产）出生的传统叙述相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, usually in names) an epithet/surname meaning “not born,” used especially in the name of Saint Raymond Nonnatus (French: Raymond Nonnat).","zh":"（罕见，多见于人名）意为“未出生的/非自然分娩而生的”的称号或姓氏，尤其用于圣人“圣雷蒙德·诺纳图斯”（法语：Raymond Nonnat）的名字中。"},"examples":[{"en":"The church was named after Saint Raymond Nonnat (Raymond Nonnatus).","zh":"这座教堂以圣雷蒙德·诺纳图斯（Raymond Nonnat / Raymond Nonnatus）命名。"},{"en":"In some historical texts, “Nonnat” appears as part of a saint’s title rather than an everyday word.","zh":"在一些历史文本中，“Nonnat”更像圣人的称号，而不是日常用词。"}]},{"partOfSpeech":"adj.","definition":{"en":"(very rare, historical) describing a birth said to have happened by cesarean section, traditionally after the mother’s death in childbirth.","zh":"（极罕见，历史用法）形容据称通过剖腹产出生（传统叙述中常指母亲难产去世后剖腹取出婴儿）的情况。"},"examples":[{"en":"The epithet “Nonnat” reflects a legendary account of an unusual birth.","zh":"“Nonnat”这个称号反映了一种关于非同寻常出生方式的传说叙述。"}]}],"synonyms":["Nonnatus (name variant)","Saint Raymond Nonnatus (title/name)"],"phonetic":"/ˈnɑn.næt/","extraExplanation":["“nonnat”在现代英语里非常少见，通常不会单独当作常用词使用；你更可能想输入的是 **non-native**（非本地的/非母语的）或 **nonnatural**（不自然的/非天然的）。","“Nonnat”源自拉丁语 *non natus*（字面“未出生的”），与天主教圣人 Raymond Nonnat / Raymond Nonnatus 的称号相关。"]}
{"word":"nonnational","summary":{"en":"“Nonnational” means not belonging to a particular nation, often referring to a foreign or non-citizen person in formal contexts.","zh":"“nonnational”指“非本国的／非国家的”，常在正式语境中指“外国人”或“非公民”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"**Not national**; not belonging to, produced by, or connected with one particular nation (often used in official/legal writing to mean “foreign” or “not a citizen of this country”).","zh":"**非国家的／非本国的**；不属于、非出产于、或不与某一特定国家相关（常见于官方/法律语境，表示“外国的”或“非本国公民的”）。"},"examples":[{"en":"The program offers services to **nonnational** residents who recently arrived.","zh":"该项目为最近抵达的**非本国**居民提供服务。"},{"en":"Some benefits are limited to citizens and are not available to **nonnational** applicants.","zh":"某些福利仅限公民，**非本国**申请人无法享有。"}]}],"synonyms":["foreign","noncitizen","alien (legal/formal)","nonresident","non-native"],"phonetic":"/ˌnɑnˈnæʃənəl/","extraExplanation":["“nonnational”更常见的写法是 **non-national**（加连字符），在移民、签证、边境管理、福利资格等文本里出现较多。日常英语中，人们更常说 **foreign**, **noncitizen**, **non-U.S. citizen**（在美国语境）或直接说 **not a citizen**。","构词：**non-**（表示“非”）+ **national**（国家的/国民的）。注意它通常不表示“无国籍”（stateless），无国籍更常用 **stateless**。"]}
{"word":"nonnationalism","summary":{"en":"Nonnationalism is the absence of nationalism or an anti-/non-nationalist stance that downplays national identity as the main basis for loyalty and belonging.","zh":"Nonnationalism 指民族主义的缺乏，或一种反对/淡化以民族与国家为中心的认同与忠诚的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The absence of nationalism, or a viewpoint that rejects nationalism (the idea that national identity and national interests should be central or superior).","zh":"民族主义的缺乏；或指一种反对/拒斥民族主义的观点（不认为民族认同与国家利益应当居于中心或高于其他认同）。"},"examples":[{"en":"Her essay argues for nonnationalism in education, focusing on shared human values rather than national pride.","zh":"她的文章主张教育应采取非民族主义立场，更强调共同的人类价值而不是国家自豪感。"},{"en":"The movement’s nonnationalism made it easier to include immigrants and minorities.","zh":"该运动的非民族主义取向使其更容易接纳移民与少数群体。"}]}],"synonyms":["postnationalism","cosmopolitanism","internationalism","transnationalism","anti-nationalism"],"phonetic":"/ˌnɑnˈnæʃənəˌlɪzəm/","extraExplanation":["“nonnationalism”并不是日常高频词，更常见的是“anti-nationalism（反民族主义）”“postnationalism（后民族主义）”“cosmopolitanism（世界主义）”“internationalism（国际主义）”。写作中使用它时，最好用一句话说明你指的是“缺乏民族主义情绪”还是“主张不以民族/国家为核心的政治与身份认同”。","词形结构：non-（否定前缀）+ nationalism（民族主义）。注意不要和形容词“nonnational / non-national（非国家的/非全国性的；或指非本国国民的）”混淆：前者多用于描述组织/活动不属于全国层级或某人不是该国公民；而“nonnationalism”谈的是一种观念或倾向。"]}
{"word":"nonnationalistic","summary":{"en":"“Nonnationalistic” means “not nationalistic”—not strongly promoting national superiority or putting the nation first in an extreme way.","zh":"“nonnationalistic”意为“非民族主义的/不民族主义化的”，指不强调国家至上或民族优越。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nationalistic; not showing strong support for the belief that one’s own nation is superior or should come first in most situations.","zh":"非民族主义的；不表现出强烈的民族主义立场（例如认为本国高人一等或在多数情境中应优先于他国）。"},"examples":[{"en":"Her speech took a nonnationalistic tone and focused on shared global problems like climate change.","zh":"她的演讲语气并不民族主义化，而是强调气候变化等全球共同问题。"},{"en":"The group promotes a nonnationalistic identity that welcomes immigrants and minorities.","zh":"该团体倡导一种非民族主义的身份认同，欢迎移民与少数群体。"}]}],"synonyms":["non-nationalist","non-nationalistic","internationalist","cosmopolitan"],"phonetic":"/ˌnɑnˌnæʃəˈlɪstɪk/","extraExplanation":["“nonnationalistic”在英语里可理解，但不算最常见的写法；更常见的是“non-nationalist / non-nationalistic”（带连字符）或直接说“not nationalistic”。写作时如果担心可读性，可以用更常见的形式。","它通常用于描述“语气/立场/态度/观点”（tone, stance, attitude, viewpoint），强调不过度把国家利益置于一切之上，或不把民族身份当作主要评价标准。"]}
{"word":"nonnationalistically","summary":{"en":"“Nonnationalistically” means “in a way that is not nationalistic,” often describing a balanced, multi-perspective tone about a country or national issues.","zh":"“nonnationalistically”意为“以非民族主义的方式”，常用于描述谈论国家或国家议题时更客观、更多元的语气与立场。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not nationalistic; without promoting excessive pride in one’s own nation or putting national interests above others in an aggressive or exclusionary way.","zh":"以不带民族主义色彩的方式；不宣扬对本国的过度自豪，也不以攻击性或排他性的方式把本国利益置于他国之上。"},"examples":[{"en":"She spoke about her country’s history nonnationalistically, focusing on both achievements and mistakes.","zh":"她以不带民族主义色彩的方式谈论本国历史，既关注成就也不回避错误。"},{"en":"The museum tries to present the war nonnationalistically, including multiple sides’ experiences.","zh":"这家博物馆努力以非民族主义的方式呈现那场战争，纳入多方的经历与观点。"}]}],"synonyms":["impartially","objectively","evenhandedly","without chauvinism","in a balanced way"],"phonetic":"ˌnɑnˌnæʃənəˈlɪstɪkli","extraExplanation":["这个词非常少见，更常见的写法/表达是：\"in a non-nationalistic way\" 或直接用 \"without nationalism\"、\"in a more balanced/nonpartisan tone\"（视语境而定）。","构词法：non-（不、非）+ nationalistic（民族主义的）+ -ally（副词后缀）。因为较长且书面化，通常出现在学术写作、评论、历史叙述或媒体分析中。","语感提示：\"nationalistic\" 往往带有“过度、排他、对外不友好”的倾向（不等同于中性的 \"patriotic\" 爱国）。所以 \"nonnationalistically\" 通常强调“更客观、更多元视角、不过度站队”。"]}
{"word":"nonnationalization","summary":{"en":"“Nonnationalization” means not nationalizing something—especially not making a private industry or company government-owned.","zh":"“nonnationalization”指“不国有化/不国家化”，尤指不把私营行业或公司收归政府所有。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act, policy, or condition of not nationalizing an industry, company, or service (i.e., keeping it privately owned rather than bringing it under government ownership/control).","zh":"不国有化；不将某行业/公司/服务收归政府所有（保持私有或非政府控制）的行为、政策或状态。"},"examples":[{"en":"The party’s platform emphasized nonnationalization of key industries.","zh":"该政党的纲领强调关键产业不国有化。"},{"en":"Investors welcomed the government’s commitment to nonnationalization.","zh":"投资者欢迎政府承诺不国有化。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, a decision or tendency to avoid making something “national” in scope or control (less common; often unclear without context).","zh":"更广义地指避免把某事变为“全国性”管理/控制的做法或倾向（较少见，通常需要上下文）。"},"examples":[{"en":"They argued for nonnationalization of the school curriculum.","zh":"他们主张课程体系不要全国统一（不全国化）。"}]}],"synonyms":["non-nationalization","absence of nationalization","avoidance of nationalization","privatization (related but not identical)","keeping (something) private"],"phonetic":"/ˌnɑnˌnæʃənələˈzeɪʃən/","extraExplanation":["这个词不算常见，写作里更常见的是加连字符的 **non-nationalization**，或直接写成更自然的表达：**not nationalizing / avoiding nationalization / keeping (something) private**。","构词：**non-**（不、非）+ **nationalization**（国有化；国家化）。讨论经济政策（如能源、铁路、医疗等行业是否国有化）时可能会用到。","注意区分：**nationalization** 在政治经济语境里通常指“国有化”；在别的语境也可能指“使全国统一/国家化”。不清楚语境时，建议在句子里明确对象（industry/company/service/curriculum 等）来避免歧义。"]}
{"word":"nonnationally","summary":{"en":"“Nonnationally” means “not at the national level; not nationwide.”","zh":"“nonnationally”表示“不是国家层面/不是全国范围地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not national in scope, character, or level (for example, locally, regionally, or internationally rather than across an entire nation).","zh":"以非国家层面（非全国范围/非国家性质）的方式；例如以地方、区域或跨国层面，而不是全国层面。"},"examples":[{"en":"The program is funded nonnationally, mainly through city governments and private donors.","zh":"该项目的资金来源并非全国统一拨款，主要来自市政府和私人捐助。"},{"en":"The issue is often discussed nonnationally, with different regions using different terms.","zh":"这个问题常以非全国统一的方式被讨论，不同地区使用不同的说法。"}]}],"synonyms":["locally","regionally","internationally","nonfederally","not nationwide"],"phonetic":"/ˌnɑnˈnæʃənəli/","extraExplanation":["“nonnationally”由 non-（表示“非/不”）+ nationally（在全国范围内地）构成，整体意思就是“不是在全国范围内地”。它并不常见；写作中更常用的替代表达包括：locally（在地方层面地）、regionally（在区域层面地）、not at the national level（不在国家层面）、outside a national framework（在国家框架之外）。","语境上，它常出现在政策、经费来源、组织结构或讨论范围等话题里，用来强调“不是全国统一/国家层级”的运作方式。"]}
{"word":"nonnative","summary":{"en":"Nonnative means “not native,” often describing a person’s first language (not a native speaker) or a plant/animal introduced from elsewhere.","zh":"nonnative 表示“非本地的”，常用来指“非母语的（说话者）”或“外来引入的（动植物）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not originally from a particular place; not a native speaker of a language.","zh":"非本地的；（语言）非母语的。"},"examples":[{"en":"She is a nonnative speaker of English, but her writing is very clear.","zh":"她的英语不是母语，但她写作非常清晰。"},{"en":"The island has several nonnative plant species that were introduced by humans.","zh":"这个岛上有几种由人类引入的外来植物物种。"}]}],"synonyms":["foreign","nonindigenous","alien"],"phonetic":"/ˌnɑnˈneɪtɪv/","extraExplanation":["“nonnative”常见于两类语境：①语言学习（a nonnative speaker of English = 英语非母语者）；②生态与环境（nonnative species = 外来物种）。在生态语境里，它通常和“native（本土的）/ invasive（入侵的）”一起出现；注意“nonnative”不一定表示“有害”，而“invasive”更强调对生态造成负面影响。","拼写上也常见“non-native”带连字符的写法，尤其在较正式或编辑风格中；意思通常相同。"]}
{"word":"nonnatively","summary":{"en":"“Nonnatively” means “not as a native person would,” especially when talking about language use.","zh":"“nonnatively”表示“以非母语者/非本族的方式”，常用于描述语言使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not native; as a non-native speaker or in a non-native manner.","zh":"以非母语者的方式；不是以本族/母语的方式。"},"examples":[{"en":"She speaks English nonnatively, but very clearly.","zh":"她的英语不是母语水平，但说得很清楚。"},{"en":"The phrase is often used nonnatively and may sound unnatural to native speakers.","zh":"这个短语常被非母语者这样使用，对母语者来说可能听起来不自然。"}]}],"synonyms":["as a non-native speaker","in a non-native way","not natively"],"phonetic":"/ˌnɑnˈneɪtɪvli/","extraExplanation":["“nonnatively”在日常英语里不算常见；更常见的说法是用形容词“non-native”作定语（a non-native speaker）或用短语“as a non-native speaker / in a non-native way”。","它通常出现在语言学习、语言学或考试写作等较正式的语境中，用来强调“不是母语者/非母语方式”。"]}
{"word":"nonnativeness","summary":{"en":"Nonnativeness means the state of not being native (to a place, culture, or language).","zh":"nonnativeness 指“非本地/非母语”的状态或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being native to a place, culture, language, or community; being an outsider or foreign-origin","zh":"非本地（或非本族、非母语者）身份；不属于某地、某文化、某语言社群的状态"},"examples":[{"en":"Her nonnativeness became noticeable when she struggled with local slang.","zh":"当她听不懂当地俚语时，她的“非本地身份”就变得很明显。"},{"en":"The study examined how students’ nonnativeness affects classroom participation.","zh":"这项研究探讨了学生的非母语者身份如何影响课堂参与。"},{"en":"He didn’t want his nonnativeness to define him, so he joined community groups.","zh":"他不想让自己的外来者身份定义自己，于是加入了社区团体。"}]}],"synonyms":["non-native status","non-nativeness","foreignness","outsider status","non-native speakerhood"],"phonetic":"/ˌnɑnˈneɪtɪvnəs/","extraExplanation":["“nonnativeness”不是特别常见的标准词，更常见的表达有：non-native status（非母语/非本地身份）、non-native speakerhood（非母语者身份）、foreignness（外来感）、outsider status（外来者地位）。在语言学习/语言学语境里，常用 non-nativeness（带连字符）或直接说 non-native speaker。","构词上：non-（否定前缀）+ native（本地的/母语的）+ -ness（名词后缀，表示“……的状态/性质”）。因此它强调的是“状态/性质”，而不是“人”。说“人”更自然：a non-native (speaker) / a newcomer。","语气与语境：在讨论语言能力时，有时会带出“非母语者=不如母语者”的刻板印象；更中性/尊重的说法可以强调 proficiency（熟练度）或 multilingual background（多语背景）。"]}
{"word":"nonnatives","summary":{"en":"“Nonnatives” means people who are not native to a place or not native speakers of a language.","zh":"“nonnatives”指非本地人，或（更常见于语言语境）非母语者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are not native to a particular place (not born there or not originally from there).","zh":"非本地人；外地人（不是在某地出生或原本不来自那里的人）。"},"examples":[{"en":"The city has programs that help nonnatives learn local customs.","zh":"这座城市有一些项目帮助外地人了解当地习俗。"},{"en":"Some nonnatives find the winters surprisingly cold.","zh":"一些外地人觉得这里的冬天冷得出乎意料。"}]},{"partOfSpeech":"n.","definition":{"en":"People who are not native speakers of a language (did not learn it as their first language).","zh":"非母语者（某种语言不是第一语言的人）。"},"examples":[{"en":"The class is designed for nonnatives who want to improve their English writing.","zh":"这门课是为想提高英语写作的非母语者设计的。"},{"en":"The app gives extra pronunciation practice for nonnatives.","zh":"这个应用为非母语者提供额外的发音练习。"}]}],"synonyms":["outsiders","nonresidents","newcomers","foreigners","non-native speakers","second-language speakers"],"phonetic":"/ˌnɑnˈneɪtɪvz/","extraExplanation":["“nonnatives”通常是复数名词，来自形容词/名词“non-native”。写作中更常见的形式是带连字符的“non-natives”（尤其在正式写作里），也常直接说“non-native speakers”（非母语者）来避免歧义。","语境很重要：在“社区/城市/国家”的话题里多指“外地人”；在“语言学习/口音/考试”的话题里多指“非母语者”。如果担心听者误解，可以明确说“people who weren’t born here”或“non-native speakers”。"]}
{"word":"nonnattily","summary":{"en":"“Nonnattily” means “not nattily”: in an untidy, not-smart-looking way.","zh":"“nonnattily”指“不像 nattily 那样利落/体面”：不整洁地、不讲究地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not nattily (not neatly, smartly, or stylishly); untidily or unsmartly.","zh":"以不利落/不讲究的方式；不整洁地、不体面地（与 nattily “利落地、时髦地”相反）。"},"examples":[{"en":"He was dressed nonnattily, with a wrinkled shirt and mismatched socks.","zh":"他穿得不够利落，衬衫起皱，袜子也不配。"},{"en":"The room was arranged nonnattily, with papers scattered everywhere.","zh":"房间收拾得不整齐，文件到处乱放。"}]}],"synonyms":["untidily","messily","sloppily","unsmartly","not neatly"],"phonetic":"/ˌnɑnˈnætəli/","extraExplanation":["“nonnattily”非常少见，多数情况下英语更常说：messily / untidily / sloppily / not very neatly / not very smartly。","构词很直接：non-（不、非）+ nattily（利落地、讲究地）。通常用于强调“刻意/明显地不讲究”。","注意别和 “naughtily”（淘气地、顽皮地）混淆：发音和拼写相近，但意思完全不同。"]}
{"word":"nonnattiness","summary":{"en":"“Nonnattiness” is informal slang meaning the quality of being “not natty” (using PEDs) in fitness/bodybuilding talk.","zh":"“nonnattiness”是非正式健身圈俚语，指“非天然/不无药（使用PEDs）”的状态或特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, internet slang) The state or quality of being “not natty”—i.e., using performance‑enhancing drugs (PEDs) rather than being drug‑free in fitness/bodybuilding contexts.","zh":"（非正式／网络俚语）“不纯天然（not natty）”的状态或特质；在健身／健美语境中指使用提升表现药物（PEDs），而非无药（纯天然）训练。"},"examples":[{"en":"People argued online about the influencer’s nonnattiness after his sudden size gains.","zh":"网友在网上争论那位网红是否“非天然（nonnattiness）”，因为他体型突然暴涨。"},{"en":"He never confirmed anything, so fans kept speculating about his nonnattiness.","zh":"他从未正面回应，所以粉丝一直在猜测他是否“非天然（nonnattiness）”。"}]}],"synonyms":["being not natty","enhanced status","PED use"],"phonetic":"/ˌnɑnˈnæti.nəs/","extraExplanation":["“nonnattiness”不是标准词典里常见的正式英语词，更像是由网络健身圈俚语拼出来的词：non-（不）+ natty（健身圈里指“天然/无药”）+ -ness（……性）。","它通常出现在社交媒体讨论“natty vs. not natty / fake natty（假天然）”时，用来表达“看起来/被认为不天然”的特质或程度。","有些网页会把它说成语言学术语（与名词性别或数相关），但这并非主流语言学用法；在真实英语使用中，更常见的语境是健身圈。"]}
{"word":"nonnatty","summary":{"en":"“nonnatty” (more often “non-natty”) is gym slang meaning someone is not natural—i.e., they use PEDs like steroids or HGH.","zh":"“nonnatty”（更常写作“non-natty”）是健身俚语，指“非纯天然”，也就是使用类固醇、HGH 等 PEDs。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(gym/fitness slang) Not “natty” (not natural): using performance-enhancing drugs (PEDs) such as anabolic steroids, HGH, or similar substances to build muscle or improve performance.","zh":"（健身/撸铁俚语）非“纯天然”：指使用提高运动表现的药物（PEDs），如类固醇、HGH 等来增肌或提升表现。"},"examples":[{"en":"People online keep arguing whether that influencer is nonnatty.","zh":"网上一直在吵那个健身网红到底是不是非天然（用药）。"},{"en":"He admitted he’s nonnatty, so his results aren’t a fair comparison for most beginners.","zh":"他承认自己是非天然（用药）的，所以他的成果对大多数新手来说不算公平对比。"},{"en":"If you’re competing in a tested league, being nonnatty can get you disqualified.","zh":"如果你参加的是药检比赛，非天然（用药）可能会被取消资格。"}]}],"synonyms":["non-natty","not natty","enhanced","on PEDs","juiced (informal/slang)"],"phonetic":"ˌnɑnˈnæti","extraExplanation":["“nonnatty”更常见的写法是“non-natty”或“not natty”。在健身圈里，natty 常被理解为 natural（不使用违禁/激素类增肌药物），所以 non-natty 就是“enhanced（用药）”。","这个词常用于网络讨论、健身房闲聊或对网红身材的判断，语气可能带有质疑或指责；为了更中性，可以说“enhanced”或“uses PEDs”。","注意：在体育语境里，“natty”有时也可指“national championship（全国冠军赛）”；但“non-natty”几乎总是健身用法。"]}
{"word":"nonnatural","summary":{"en":"“Nonnatural” means “not natural,” but “unnatural” is much more common in everyday English.","zh":"“nonnatural”表示“非自然的”，但日常英语里更常用的是“unnatural”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not natural; not occurring in nature or not normal in a natural way.","zh":"非自然的；不是自然产生的，或不符合自然常态的。"},"examples":[{"en":"Some people dislike the nonnatural taste of certain artificial sweeteners.","zh":"有些人不喜欢某些人工甜味剂那种非自然的味道。"},{"en":"The bright color looked nonnatural against the landscape.","zh":"那种鲜艳的颜色在风景中显得不太自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not typical of how humans normally behave or feel; unnatural or forced.","zh":"不合常态的；（人的行为或情感）不自然、做作的。"},"examples":[{"en":"Her smile seemed nonnatural, as if she was pretending to be happy.","zh":"她的笑看起来不太自然，像是在假装开心。"},{"en":"He spoke in a nonnatural way during the interview because he was nervous.","zh":"他面试时说话有点不自然，因为他紧张。"}]}],"synonyms":["unnatural","artificial","synthetic","man-made","forced"],"phonetic":"/ˌnɑnˈnætʃ(ə)rəl/","extraExplanation":["“nonnatural”在英语里能被理解，但更常见、更地道的说法通常是“unnatural”（不自然的）或“artificial / synthetic”（人工的/合成的）。在写作或考试中，一般优先用“unnatural”。","构词上，“non-”表示“非、不是”，所以“non + natural = nonnatural”。很多情况下也会写成带连字符的“non-natural”，尤其在正式写作里用来强调两部分结构。"]}
{"word":"nonnaturalism","summary":{"en":"Nonnaturalism is the view (often in metaethics) that some truths—especially moral truths—are not purely natural or scientifically reducible.","zh":"非自然主义（常见于元伦理学）指认为某些真理，尤其道德真理，并非纯粹自然的，也无法完全用科学还原解释。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, especially metaethics) The view that some things—often moral facts, moral properties, or moral truths—are not part of the natural (physical/empirical) world and cannot be fully explained by natural science.","zh":"（哲学，尤指元伦理学）非自然主义：认为某些事物——常指道德事实、道德属性或道德真理——不属于自然（物理/经验）世界，不能完全用自然科学来解释。"},"examples":[{"en":"In metaethics, nonnaturalism says that moral rightness is not identical to any natural property like pleasure or survival.","zh":"在元伦理学中，非自然主义认为“道德正确性”不等同于任何自然属性，例如快乐或生存。"},{"en":"A nonnaturalist may argue that you cannot discover moral truths the same way you discover chemical facts.","zh":"非自然主义者可能会主张：你不能用发现化学事实的方式来发现道德真理。"}]},{"partOfSpeech":"n.","definition":{"en":"(More broadly) Any approach that rejects strict naturalism, especially the idea that everything real must be reducible to nature or science.","zh":"（更广义）泛指任何反对严格自然主义的立场，尤其是否认“真实的一切都必须还原为自然或科学”的观点。"},"examples":[{"en":"His theory includes a kind of nonnaturalism because it allows realities that are not scientifically measurable.","zh":"他的理论带有一种非自然主义色彩，因为它承认某些现实无法用科学测量。"},{"en":"Debates about consciousness sometimes turn into disputes between naturalism and nonnaturalism.","zh":"关于意识的争论有时会演变为自然主义与非自然主义之争。"}]}],"synonyms":["non-naturalism","anti-naturalism"],"phonetic":"/ˌnɑnˈnætʃ(ə)rəlˌɪzəm/","extraExplanation":["“nonnaturalism”常见于学术写作，尤其是元伦理学（metaethics）。在英语里更常写作“non-naturalism”（带连字符）或“nonnaturalism”（不带连字符），两者意思通常相同。","在元伦理学语境中，它常被用来对比：\n- naturalism（自然主义）：道德属性可用自然属性来解释（如快乐、偏好满足等）。\n- nonnaturalism（非自然主义）：道德属性不是任何自然属性，不能用纯经验科学完全还原。","不要把它和艺术史里的“naturalism（自然主义绘画/写实倾向）”混为一谈：哲学里的naturalism谈的是“世界由什么构成、什么算知识”，艺术里的naturalism谈的是“画得像不像自然”。"]}
{"word":"nonnaturalist","summary":{"en":"A nonnaturalist is (1) someone who supports ethical/moral nonnaturalism, or (2) someone who favors nonnaturalism in art rather than realistic representation.","zh":"nonnaturalist 可指（1）支持伦理/道德非自然主义的人，或（2）在艺术上偏好非写实、非自然再现风格的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports nonnaturalism (especially in ethics), the view that moral facts or properties are real but not reducible to natural/empirical properties","zh":"（尤指伦理学中）主张“非自然主义”的人；认为道德事实/道德属性真实存在，但不能还原为自然的、经验性的属性"},"examples":[{"en":"As a moral nonnaturalist, she argues that “wrongness” cannot be identified with any purely scientific property.","zh":"作为一名道德非自然主义者，她认为“错误性”不能等同于任何纯粹科学性质。"},{"en":"Many nonnaturalists accept moral realism but reject reductive explanations of value.","zh":"许多非自然主义者接受道德实在论，但拒绝用还原性的方式解释价值。"}]},{"partOfSpeech":"n.","definition":{"en":"a person (especially an artist, writer, or critic) who prefers nonnaturalism in art—styles that avoid realistic representation of the natural world","zh":"（尤指艺术/文学领域）偏好“非自然主义”风格的人；指回避对自然世界进行写实再现的艺术取向"},"examples":[{"en":"The director is a nonnaturalist, using stylized movement instead of realistic acting.","zh":"这位导演偏向非自然主义，用程式化的动作取代写实表演。"},{"en":"As a nonnaturalist painter, he exaggerates color and shape to create an unreal atmosphere.","zh":"作为一名非自然主义画家，他夸张色彩与形状来营造不真实的氛围。"}]}],"synonyms":["ethical nonnaturalist","moral nonnaturalist","intuitionist (in some ethical contexts)","anti-naturalist"],"phonetic":"/ˌnɑnˈnætʃ(ə)rəlɪst/","extraExplanation":["这个词在日常英语里很少见，更常见的是以更明确的形式出现：moral nonnaturalist（道德非自然主义者）、ethical nonnaturalist（伦理非自然主义者）。也常写作 non-naturalist（带连字符）。","注意不要和 naturalist（自然主义者）混淆：naturalist 通常指倾向用自然原因解释世界（常与“超自然”相对）；而 nonnaturalist（在哲学语境中）多指“道德属性不是自然属性”的立场，与“否认超自然现象”不是一回事。"]}
{"word":"nonnaturalistic","summary":{"en":"“Nonnaturalistic” means not realistic or true-to-life, especially in art, theater, film, or writing; it can also (less commonly) mean unnatural or artificial-looking.","zh":"“nonnaturalistic”指“非写实/非自然主义的”，多用于艺术、戏剧、电影或写作；较少情况下也可指“看起来不自然、偏人工的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not naturalistic; not showing things in a realistic, true-to-life way (often used for art, theater, film, or writing styles that are abstract, symbolic, stylized, or exaggerated).","zh":"非自然主义的；不以逼真写实方式呈现事物的（常用于艺术、戏剧、电影或写作风格，强调抽象、象征、风格化或夸张）。"},"examples":[{"en":"The director chose a nonnaturalistic style, using harsh lighting and symbolic props instead of realistic sets.","zh":"导演选择了非自然主义的风格，用强烈的灯光和象征性的道具替代写实布景。"},{"en":"Her nonnaturalistic portraits exaggerate facial features to express emotion.","zh":"她的非自然主义肖像会夸大面部特征来表达情感。"},{"en":"The play’s nonnaturalistic dialogue feels poetic rather than like everyday speech.","zh":"这部戏的非自然主义对白更像诗句，而不像日常对话。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Not caused by nature; not natural—artificial or human-made.","zh":"（较少见）非自然产生的；不是自然的——人工的、人为造成的。"},"examples":[{"en":"Some critics argued that the color palette looked nonnaturalistic, almost chemically bright.","zh":"一些评论家认为这种色调看起来不自然，亮得像化学染料一样。"},{"en":"The lake’s nonnaturalistic turquoise hue suggested pollution.","zh":"湖水那种非自然的蓝绿色暗示可能存在污染。"}]}],"synonyms":["unnaturalistic","nonrealistic","stylized","abstract","symbolic","expressionistic"],"phonetic":"/ˌnɑnˌnætʃ(ə)rəˈlɪstɪk/","extraExplanation":["“nonnaturalistic”最常见于艺术与表演语境，常与“naturalistic（自然主义/写实的）”对比：naturalistic强调像真实生活一样的细节与行为；nonnaturalistic则允许舞台上出现象征化布景、夸张表演、打破“第四面墙”、时间与空间的非现实跳跃等。","在戏剧评论里，“nonnaturalistic”有时也接近“stylized（风格化）”“expressionistic（表现主义的）”“surreal（超现实的）”，用于描述一种刻意“不像现实”的表达策略。"]}
{"word":"nonnaturality","summary":{"en":"Nonnaturality is a rare noun meaning “lack of naturalness,” and sometimes (in philosophy) “non-natural character” of certain properties.","zh":"nonnaturality 是个少见名词，通常表示“非自然性/不自然”，在哲学语境中也可指某些性质的“非自然特征”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being non-natural; a lack of naturalness (often meaning something that does not occur in nature or feels artificial/unnatural)","zh":"非自然性；不自然的状态或性质（常指不发生于自然界、或给人感觉很“人工/不自然”）"},"examples":[{"en":"Some viewers disliked the nonnaturality of the dialogue—it sounded too scripted.","zh":"一些观众不喜欢对白的非自然性——听起来太像背台词。"},{"en":"The product’s bright color added a sense of nonnaturality to the scene.","zh":"产品过于鲜艳的颜色让画面多了一种非自然的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(philosophy, especially meta-ethics) the idea that certain properties (often moral properties) are not “natural” properties and cannot be reduced to scientific/empirical terms","zh":"（哲学，尤指元伦理学）指某些性质（常指道德性质）不是“自然性质”，也不能还原为科学/经验性术语来解释"},"examples":[{"en":"In his paper, he argues for the nonnaturality of moral facts.","zh":"在论文中，他主张道德事实具有非自然性。"}]}],"synonyms":["unnaturalness","artificiality","lack of naturalness","contrivance"],"phonetic":"/ˌnɑnˌnætʃəˈræləti/","extraExplanation":["这个词非常少见，多数情况下英语母语者更常用 **unnaturalness**（不自然）或 **lack of naturalness** 来表达同样意思。","构词上是 **non-（非） + natural（自然的） + -ity（……性/……的状态）**。","在一般语境里，它常指“看起来/听起来不自然、很做作或很人工”；在哲学语境里，它可能和 **non-naturalism（非自然主义）**、道德性质是否能被自然科学解释等讨论相关。"]}
{"word":"nonnaturally","summary":{"en":"“Nonnaturally” means “in an unnatural or forced way.”","zh":"“nonnaturally”表示“以不自然、刻意或不正常的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not natural, normal, or expected; in an artificial or forced manner.","zh":"以不自然、不正常或不符合常理的方式；显得人工、刻意或勉强。"},"examples":[{"en":"She smiled nonnaturally, as if she were trying too hard to seem relaxed.","zh":"她笑得很不自然，像是在努力装作很放松。"},{"en":"The flowers were dyed, so their colors looked nonnaturally bright.","zh":"这些花被染过色，所以颜色亮得不自然。"}]}],"synonyms":["unnaturally","artificially","forcedly","strainedly","oddly"],"phonetic":"/ˌnɑnˈnætʃ(ə)rəli/","extraExplanation":["“nonnaturally”在现代英语里不算常用；更常见、更自然的说法通常是“unnaturally”。不过“nonnaturally”仍然可以被理解，语气上常强调“明显不自然/不符合常态”。","常见搭配：smile/laugh/speak nonnaturally（笑/说话很不自然）、nonnaturally quiet/bright（安静/明亮得不自然）。"]}
{"word":"nonnaturalness","summary":{"en":"“Nonnaturalness” means the state of being not natural (unnaturalness), often implying something feels artificial or forced.","zh":"“nonnaturalness”指“非自然/不自然”的状态或性质，常带有“显得人工、刻意、生硬”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being not natural; unnaturalness (often suggesting something feels artificial, forced, or not typical of nature)","zh":"非自然；不自然的状态或性质（常暗示显得人工、生硬或不符合自然/常态）"},"examples":[{"en":"Some viewers disliked the nonnaturalness of the dialogue because it sounded forced.","zh":"一些观众不喜欢对话的不自然，因为听起来很生硬。"},{"en":"The makeup created a slight nonnaturalness in her skin tone under bright lights.","zh":"在强光下，妆容让她的肤色显得有一点不自然。"},{"en":"He was trying so hard to be polite that his friendliness had a hint of nonnaturalness.","zh":"他太努力想表现得有礼貌，以至于友好里带着一丝不自然。"}]}],"synonyms":["unnaturalness","artificiality","affectedness","contrivance"],"phonetic":"ˌnɑnˈnætʃərəl.nəs","extraExplanation":["“nonnaturalness”由 non-（不、非）+ natural（自然的）+ -ness（名词后缀，表示“性质/状态”）构成，意思很直观，但在现代英语里相对少见。更常用、更地道的说法通常是 “unnaturalness” 或 “artificiality”。","语感上，“unnaturalness”多强调“违背自然/不正常”，而 “artificiality”更强调“人工的、刻意的”。根据语境选择会更准确。"]}
{"word":"nonnaturals","summary":{"en":"“Nonnaturals” can mean (1) nonnatural things (artificial/not from nature), and more specifically (2) a historical medical term for the “six nonnaturals,” lifestyle/environment factors believed to affect health.","zh":"“nonnaturals”既可泛指“非自然/人造的事物”，也可特指医学史里的术语“六种非自然因素”，即被认为会影响健康的生活方式与环境因素。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Not natural; not found in nature; artificial or made by people.","zh":"（形容词）非自然的；不属于自然界的；人造的。"},"examples":[{"en":"She prefers cosmetics without nonnatural colors or fragrances.","zh":"她更喜欢不含人造色素或香精的化妆品。"},{"en":"The bright blue light gave the room a nonnatural, futuristic look.","zh":"明亮的蓝光让房间呈现出一种不自然、很未来的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(n., usually plural) Things or factors that are not “natural” to the body—especially the traditional “six nonnaturals” in historical (Galenic/medieval) medicine: air, food and drink, movement and rest, sleep and wakefulness, excretion and retention, and emotions.","zh":"（名词，常用复数）在医学史（盖伦/中世纪医学）中指不属于人体“本质组成”、但会影响健康的外在因素，尤指“六种非自然因素”：空气、饮食、运动与休息、睡眠与清醒、排泄与潴留、情绪。"},"examples":[{"en":"In medieval medical texts, physicians advised patients to manage the nonnaturals to stay healthy.","zh":"在中世纪医学文献中，医师会建议病人管理这些“非自然因素”以保持健康。"},{"en":"The chapter discusses how the six nonnaturals shaped early ideas of prevention.","zh":"这一章讨论了“六种非自然因素”如何影响早期的预防观念。"}]}],"synonyms":["artificial","synthetic","man-made","non-natural"],"phonetic":"/ˌnɑnˈnætʃərəlz/","extraExplanation":["“nonnaturals”这个复数名词用法比较少见，更多出现在医学史/古典医学语境里，常写作the nonnaturals 或 the six nonnaturals。它并不是在说“非自然=不正常”，而是一个专门分类：既不是人体内部的“自然（naturals）”，也不是“反自然/病理（contranaturals）”，而是日常生活中可调控、会影响健康的外在条件（有点像古代的生活方式医学/养生要素）。","日常英语里更常用的是形容词 nonnatural（或拼写为 non-natural），意思接近 artificial / synthetic；如果你只是想表达“非天然成分”，也可以说 artificial ingredients 或 synthetic additives（语气更自然、更常见）。"]}
{"word":"nonnautical","summary":{"en":"Nonnautical means “not related to the sea or sailing.”","zh":"Nonnautical 意为“非航海的；与海洋或航行无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not nautical; not related to the sea, ships, sailing, or navigation","zh":"非航海的；与海洋、船只、航行或导航无关的"},"examples":[{"en":"The museum also has nonnautical exhibits about the city’s history and art.","zh":"这座博物馆也有一些非航海类展品，介绍这座城市的历史与艺术。"},{"en":"We chose a nonnautical theme for the party—no anchors or sailor stripes.","zh":"我们为派对选了一个非航海主题——没有船锚或水手条纹。"},{"en":"He uses the term in a nonnautical sense, meaning “direction” in life rather than at sea.","zh":"他用这个词是非航海意义上的，指人生的“方向”，而不是海上的航向。"}]}],"synonyms":["nonmaritime","nonmarine","land-based","inland"],"phonetic":"/ˌnɑnˈnɔtɪkəl/","extraExplanation":["non- 是常见前缀，表示“非、不”。因此 nonnautical 字面意思就是“不是 nautical（航海的）”。","这个词常用于写作或说明中，用来强调某个事物虽然出现在“航海/海洋”语境附近，但其实与航海无关（例如展览分区、主题设计、用词的比喻用法）。"]}
{"word":"nonnautically","summary":{"en":"Nonnautically (rare) means “in a non-nautical way,” i.e., not connected to seafaring or ships.","zh":"nonnautically（罕见）表示“以非航海的方式”，即与航海或船只无关地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare) In a way that is not nautical; not related to ships, sailing, or the sea.","zh":"（罕见用法）以非航海的方式；与船只、航行或海洋无关地。"},"examples":[{"en":"The exhibition used anchors and ropes, but the theme was explained nonnautically—as symbols of memory, not the sea.","zh":"展览里用了锚和绳索，但主题以非航海的方式来解释——作为记忆的象征，而不是海洋。"},{"en":"He wore a sailor-style jacket, but he meant it nonnautically, just as everyday fashion.","zh":"他穿着水手风夹克，但他的意思并非航海用途，只是日常穿搭。"}]}],"synonyms":["not nautically","in a non-nautical way","outside a nautical context"],"phonetic":"/ˌnɑnˈnɔtɪkli/","extraExplanation":["这个词非常少见，更常见的表达是：\"in a non-nautical way\"、\"not in a nautical sense\"、\"outside a nautical context\"。","构词法：non-（不、非）+ nautical（航海的）+ -ly（副词后缀）。通常用于说明某个带“航海元素”的事物（如锚、绳结、船长帽）被“非航海地”理解或使用——比如作为时尚、隐喻、装饰、艺术符号等。"]}
{"word":"nonnaval","summary":{"en":"“Nonnaval” means “not naval; not related to a navy.”","zh":"“nonnaval”表示“非海军的；与海军无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to a navy, naval forces, or naval operations.","zh":"非海军的；与海军、海军部队或海上军事行动无关的。"},"examples":[{"en":"The report focuses on nonnaval threats such as cyberattacks and disinformation.","zh":"这份报告聚焦于网络攻击、虚假信息等非海军威胁。"},{"en":"He was assigned to a nonnaval administrative role during the deployment.","zh":"在部署期间，他被分配到一个非海军的行政岗位。"}]}],"synonyms":["non-naval","not naval","nonmaritime (in some contexts)"],"phonetic":"/nɑnˈneɪvəl/","extraExplanation":["“nonnaval”在实际写作中更常见的形式是加连字符的“non-naval”。在正式文件（如军事、政府或学术文本）里，为了清晰，通常推荐使用“non-naval”。","含义上它只是“naval（海军的）”的否定，并不等于“civilian（民用的/平民的）”。例如“non-naval vessel”可能仍然是政府或军方系统内、但不属于海军体系的船只。"]}
{"word":"nonnavigability","summary":{"en":"Nonnavigability means the state of not being navigable, especially when a river or channel cannot be used for boat travel; it can also be a legal/technical classification.","zh":"nonnavigability 指“不可通航性”，常用于描述河流/航道无法通船的状态，也可指法律或技术上的“不可通航”认定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of not being navigable; lack of suitability for travel or transport by a boat or ship (or, more broadly, by a vehicle).","zh":"不可通航性；（水域或通道）不适合船只航行的状态；也可泛指不适合车辆通行的状态。"},"examples":[{"en":"The river’s nonnavigability during the dry season makes shipping unreliable.","zh":"在旱季，这条河流的不可通航性使航运变得不可靠。"},{"en":"Engineers studied the channel’s nonnavigability before planning any improvements.","zh":"工程师在规划改造前研究了航道的不可通航状况。"}]},{"partOfSpeech":"n.","definition":{"en":"a legal or technical classification stating that a waterway is not considered navigable, often affecting property rights, public access, or regulatory authority.","zh":"（法律/技术上的）“不属可航行水域”的认定，常影响产权归属、公众通行权或监管权限。"},"examples":[{"en":"The lawsuit focused on the creek’s nonnavigability and who owned the streambed.","zh":"这起诉讼聚焦于小溪是否“不可通航”的认定，以及河床归谁所有。"},{"en":"They argued that nonnavigability should not block reasonable public access for recreation.","zh":"他们主张，“不可通航”的认定不应阻止公众合理的休闲进入。"}]}],"synonyms":["impassability (by water)","lack of navigability","unnavigability","non-navigable condition"],"phonetic":"/ˌnɑnˌnævɪɡəˈbɪləti/","extraExplanation":["这是一个相对少见、偏正式的名词，由“non-（不）+ navigability（可通航性）”构成，常见于工程报告、航运文件与法律文本。","在法律语境里，“nonnavigability（不可通航）”往往不是在描述‘能不能划过去’，而是某种认定标准：它可能关系到政府是否有管辖权、公众是否有通行/使用权，以及水体/河床的产权归属等（不同地区/案件的标准会不一样）。","日常英语里更常用的表达通常是“not navigable”或“too shallow/blocked for boats（太浅/被阻挡，船过不去）”。"]}
{"word":"nonnavigable","summary":{"en":"“Nonnavigable” means not able to be traveled by boat, or (in legal contexts) not officially classified as navigable waters.","zh":"“nonnavigable”指（河流/水道等）不可通航的；在法律语境中也可指未被官方认定为“可航行水域”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be traveled on by boats or ships; not suitable for water transportation (often used about rivers, channels, or waters).","zh":"（河流、水道等）不可通航的；不适合船只航行的。"},"examples":[{"en":"In winter, the river becomes nonnavigable because of thick ice.","zh":"冬天河水结了厚冰，这条河就变得不可通航。"},{"en":"Low water levels made the canal nonnavigable for cargo boats.","zh":"水位过低使运河对货船来说无法通航。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Law/official use) Not legally classified as “navigable,” so different rules may apply (for example, about public access or government authority).","zh":"（法律/官方用语）在法律上不被认定为“可航行水域”的，因此可能适用不同规定（如公众通行权或政府管辖权）。"},"examples":[{"en":"The court ruled the stream nonnavigable under state law.","zh":"法院根据州法裁定这条小溪在法律上属于不可通航水域。"},{"en":"They argued that the waterway is nonnavigable and privately controlled.","zh":"他们主张该水道在法律上不可通航，因此由私人控制。"}]}],"synonyms":["impassable (by boat)","unnavigable","not navigable"],"phonetic":"/ˌnɑnˈnævɪɡəbəl/","extraExplanation":["词形拆解：non-（否定前缀，“不、非”）+ navigable（可航行的）。所以 nonnavigable = “不可航行的”。","常见使用场景是地理/工程/新闻报道（结冰、浅滩、水位低、障碍物导致无法通船），以及法律语境（“navigable waters/可航行水域”的认定会影响管理权限与公众使用权）。"]}
{"word":"nonnavigableness","summary":{"en":"“Nonnavigableness” means the state or quality of being nonnavigable—especially a river or channel that boats cannot travel on.","zh":"“nonnavigableness”表示“不可通航性”，尤指河流或航道无法供船只通行的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being nonnavigable (not able to be traveled on by boats or ships).","zh":"不可通航性；不适航性（指水域无法或不适合被船只通行的性质或状态）。"},"examples":[{"en":"The report explains the river’s nonnavigableness during the dry season, when the water level drops too low for boats.","zh":"报告解释了这条河在旱季的不可通航性：水位过低，船只无法通行。"},{"en":"Engineers tried to reduce the channel’s nonnavigableness by removing rocks and debris.","zh":"工程师试图通过清除岩石和杂物来降低航道的不可通航性。"}]},{"partOfSpeech":"n.","definition":{"en":"in law or policy, the status of a waterway as nonnavigable (often used when discussing regulation, ownership, or public access).","zh":"（法律/政策语境）非可通航的法律状态（常用于讨论监管、产权或公众通行权）。"},"examples":[{"en":"The lawsuit focused on the creek’s nonnavigableness and whether the public had a right to access it.","zh":"这起诉讼聚焦于小溪的“非可通航”状态，以及公众是否有权进入。"},{"en":"Officials argued that the stream’s nonnavigableness placed it outside certain shipping rules.","zh":"官员认为该水流的非可通航状态使其不适用某些航运规定。"}]}],"synonyms":["non-navigability","nonnavigability","unnavigability"],"phonetic":"/ˌnɑnˈnævɪɡəbəlnəs/","extraExplanation":["“nonnavigableness”非常少见，更常见的表达是“non-navigability / nonnavigability”（不可通航性），或直接说“the river is nonnavigable”（这条河不可通航）。在正式写作里，建议优先用“non-navigability”。","构词：non-（否定）+ navigable（可通航的）+ -ness（名词后缀，表示“……的性质/状态”）。因此它字面意思就是“不可通航的性质”。"]}
{"word":"nonnavigably","summary":{"en":"“Nonnavigably” means “in a not-navigable way,” describing water that cannot (or legally may not) be traveled by boat/ship.","zh":"“nonnavigably”表示“以不可通航的方式/状态”，用于描述水域无法（或依法不被允许）供船只航行。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not navigable; so that travel by boat/ship is not possible or not allowed.","zh":"以不可通航的方式；使船只/航行无法进行（或依法不被允许通航）。"},"examples":[{"en":"After the storm, the river flowed nonnavigably because fallen trees blocked the channel.","zh":"暴风雨过后，河道被倒下的树木堵住，水流变得不可通航。"},{"en":"In winter, some sections of the canal freeze and run nonnavigably for weeks.","zh":"冬天时，运河有些河段结冰，连续几周都处于不可通航的状态。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Law, especially about rivers and waterways) In a way that classifies a body of water as “nonnavigable,” which can affect who has certain rights or responsibilities.","zh":"（法律用语，常见于河流/水域）以“非通航水域”的方式（或标准）来界定，这可能影响相关权利与责任的归属。"},"examples":[{"en":"The creek was treated nonnavigably under local rules, so it was not managed like a shipping waterway.","zh":"根据当地规定，这条小溪被按非通航水域处理，因此不按航运水道的方式管理。"}]}],"synonyms":["impassably (by water)","not navigably","unpassably (by boat)"],"phonetic":"/ˌnɑnˈnævɪɡəbli/","extraExplanation":["这个词很少见，通常出现在正式写作、技术说明或法律语境里。更常用的表达是用形容词“nonnavigable”（不可通航的）来修饰名词：a nonnavigable river / nonnavigable waters。","构词法：non-（否定）+ navigable（可通航的）+ -ly（副词）。意思基本就是“以不可通航的方式/状态”。","在美国等英语语境中，“navigable / nonnavigable waters”有时涉及水域是否用于商业航运、政府管辖、公众通行与岸线/河床权属等议题；因此在法律文本里可能会看到这类表达。"]}
{"word":"nonnavigation","summary":{"en":"“Nonnavigation” means “not related to navigation,” especially in technical/UI contexts.","zh":"“nonnavigation”指“非导航的、与导航无关的”，多用于技术或界面设计语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to navigation; not used for directing movement, routes, or finding one’s way (often used in contexts like website design, where it means content or features that are not part of menus/links for moving around).","zh":"与导航无关的；不用于指引移动、路线或找路的（常用于网站/应用设计语境，指不属于菜单、链接等“引导用户浏览”的部分）。"},"examples":[{"en":"The homepage has both navigation and nonnavigation elements like news stories and photos.","zh":"首页既有导航元素，也有非导航内容，比如新闻和图片。"},{"en":"We should separate navigation labels from nonnavigation text so users don’t get confused.","zh":"我们应该把导航标签和非导航文本分开，避免用户混淆。"}]},{"partOfSpeech":"n.","definition":{"en":"The state or condition of not navigating; not engaging in navigation (rare in everyday English; more likely in technical writing).","zh":"不进行导航的状态；不处于导航行为中（日常英语较少见，更常见于技术写作）。"},"examples":[{"en":"During nonnavigation mode, the device still records sensor data but does not provide directions.","zh":"在非导航模式下，设备仍会记录传感器数据，但不会提供路线指引。"}]}],"synonyms":["non-navigational","not navigation-related","not for navigation"],"phonetic":"/ˌnɑnˌnævəˈɡeɪʃən/","extraExplanation":["“nonnavigation”不是最常见的日常词，更常见的是写成“non-navigation”（加连字符）或用更自然的表达：not for navigation / non-navigational / not navigation-related。","在网页与信息设计里，navigation（导航）通常指菜单、面包屑、侧边栏目录、站内链接结构等；nonnavigation则更偏向“内容本身”（文章、图片、视频、正文说明）或“功能控件”（搜索框、播放按钮、表单字段等）——具体取决于文档定义。"]}
{"word":"nonnebular","summary":{"en":"Nonnebular means “not nebular”—not like a nebula (not cloudy/diffuse). It can also (rarely) mean “not vague; clear.”","zh":"nonnebular 意为“非星云的/不呈星云状（不朦胧弥散）”，也可很少见地引申为“明确、不含糊”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nebular; not relating to a nebula, and not having a cloudy, diffuse, or mist-like appearance.","zh":"非星云的；不与星云有关的；（外观上）不呈现朦胧、弥散、云雾状的。"},"examples":[{"en":"The astronomer noted a nonnebular source, meaning it was not a cloud of gas and dust.","zh":"天文学家指出这是一个非星云的辐射源，也就是说它不是由气体和尘埃云构成的。"},{"en":"The image looked sharp and nonnebular, with clear edges instead of a hazy glow.","zh":"这张图像看起来清晰、非弥散云雾状，边缘分明而不是朦光一片。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, rare) Not vague or hazy; clear and definite.","zh":"（引申义，较少见）不含糊的；不朦胧的；清晰明确的。"},"examples":[{"en":"Please give a nonnebular answer with specific dates and numbers.","zh":"请给出一个不含糊的回答，包含具体日期和数字。"}]}],"synonyms":["nonnebulous","clear-cut","well-defined","definite"],"phonetic":"/ˌnɑnˈnɛbjələr/","extraExplanation":["这个词非常少见，多见于需要精确对比“星云状/弥散状（nebular）”与“非星云状”的语境（如天文学描述、图像特征说明）。","构词很直观：non-（不、非）+ nebular（星云的/朦胧弥散的）。在一般英语里，更常见的表达通常是用 not nebular 或 clear / well-defined 来替代。","相关词：nonnebulous（“不朦胧、不弥散”的同义构词形式）在一些词表或词典里也能见到，但同样偏罕见。"]}
{"word":"nonnebulous","summary":{"en":"“Nonnebulous” means clear, definite, and not vague.","zh":"“nonnebulous”表示“清晰明确、不含糊”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nebulous; clear, definite, and easy to understand.","zh":"非模糊的；清晰明确、容易理解的。"},"examples":[{"en":"The manager gave a nonnebulous explanation of the new schedule.","zh":"经理对新的排班做出了清晰明确的解释。"},{"en":"Please make your goals nonnebulous before the meeting.","zh":"开会前请把你的目标表述得清晰明确。"}]}],"synonyms":["clear","specific","definite","unambiguous","well-defined"],"phonetic":"/ˌnɑnˈnɛbjələs/","extraExplanation":["“nonnebulous”由前缀 non-（表示“非、不”）+ nebulous（“模糊的、朦胧的”）构成，意思就是“不是模糊的”。它在日常英语中相对少见，常见替代表达包括 clear、specific、unambiguous、well-defined。","拼写上有时会看到写作“non-nebulous”（带连字符），两种写法都能理解；写作时如果担心读者不熟悉，改用更常见的 clear/specific 往往更自然。"]}
{"word":"nonnebulously","summary":{"en":"“Nonnebulously” means “clearly; not vaguely.” It’s uncommon and often used for emphasis.","zh":"“nonnebulously”表示“清楚明确地；不含糊地”。这个词不常见，多用于强调。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a clear, definite way; not vaguely or unclearly.","zh":"以清楚、明确的方式；不含糊、不模糊地。"},"examples":[{"en":"Please state your request nonnebulously so everyone understands what you mean.","zh":"请把你的请求说得明确一点，这样大家都能理解你的意思。"},{"en":"The instructions were written nonnebulously, with step-by-step details.","zh":"说明写得很清楚，有一步一步的细节。"}]}],"synonyms":["clearly","explicitly","plainly","unambiguously","definitely"],"phonetic":"/ˌnɑnˈnɛbjələsli/","extraExplanation":["“nonnebulously”不是常见词，更像是临时造词（creative coinage），用来强调“不要含糊”。在正式写作里更常用：clearly, explicitly, unambiguously, plainly。","构词：non-（不）+ nebulous（朦胧/含糊的，来自拉丁语 nebula “雾/星云”）+ -ly（副词后缀）。因此字面意思就是“以不朦胧的方式”。","语感提示：因为词很长、很少见，用在口语里可能显得刻意或幽默；在严肃场合建议换成更常见的表达（例如：say it clearly / be explicit）。"]}
{"word":"nonnebulousness","summary":{"en":"Nonnebulousness means the quality of being clear and not vague.","zh":"Nonnebulousness 指“清晰明确、不含糊”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being clear, specific, and not vague (the opposite of “nebulousness”).","zh":"清晰明确、不含糊的特质（“nebulousness/模糊不清”的反义）。"},"examples":[{"en":"The proposal’s nonnebulousness made it easy for the team to act quickly.","zh":"这份提案的清晰明确让团队很容易迅速行动。"},{"en":"She was praised for the nonnebulousness of her instructions.","zh":"她因指示清楚明白而受到称赞。"}]}],"synonyms":["clarity","specificity","definiteness","lucidity","precision"],"phonetic":"/ˌnɑnˈnɛbjələsnəs/","extraExplanation":["“nonnebulousness”不是常见词，更像是临时造词（nonce word）：non-（不、非）+ nebulous（模糊的）+ -ness（名词后缀，表示“性质/状态”）。意思通常读者能猜到，但在正式写作里可能显得生硬。","更自然的表达常用：clarity（清晰）、specificity（具体性）、definiteness（明确性）、lack of ambiguity（没有歧义）、not being vague（不含糊）。如果你在学术或商务写作中追求地道，通常用这些更好。"]}
{"word":"nonnecessary","summary":{"en":"“Nonnecessary” means “not necessary,” but it’s uncommon; “unnecessary” is usually the better choice.","zh":"“nonnecessary”意为“不必要的”，但用法不常见；通常用“unnecessary”更自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not necessary; not needed; more than what is required.","zh":"不必要的；非必需的；多余的。"},"examples":[{"en":"It’s nonnecessary to explain every detail—just give the main point.","zh":"没必要解释每个细节——讲重点就好。"},{"en":"Adding more rules may be nonnecessary and could confuse people.","zh":"增加更多规则可能是不必要的，还会让人困惑。"}]}],"synonyms":["unnecessary","needless","not needed","superfluous"],"phonetic":"/ˌnɑnˈnɛsəˌsɛri/","extraExplanation":["“nonnecessary”在现代英语里不太常见，很多情况下更自然的说法是“unnecessary”。在正式写作或日常交流中，用“unnecessary / not necessary”通常更地道、更容易被理解。","前缀“non-”表示“非、无”，可以构成很多词（如“nonprofit”非营利的）。但“necessary”更常搭配“un-”构成反义词“unnecessary”。"]}
{"word":"nonnecessities","summary":{"en":"Nonnecessities means nonessential things—items you can live without.","zh":"nonnecessities 指“非必需的东西/非必要的物品”，也就是可有可无的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that are not necessary; nonessential items.","zh":"不必要的东西；非必需品。"},"examples":[{"en":"To save money, she cut out nonnecessities like fancy coffee and new clothes.","zh":"为了省钱，她删减了不必要的开销，比如精品咖啡和新衣服。"},{"en":"In an emergency kit, focus on necessities, not nonnecessities.","zh":"准备应急包时要优先放必需品，而不是非必需品。"}]}],"synonyms":["nonessentials","extras","luxuries","frills"],"phonetic":"/ˌnɑn.nəˈsɛs.ə.tiz/","extraExplanation":["“Nonnecessities”由前缀 non-（表示“不是/非”）+ necessities（必需品）构成，属于比较少见但可理解的复合词。日常更常用的说法是 “nonessentials” 或 “luxuries”（奢侈品，语气更强）。","用法上常见于“削减开支/简化生活”的语境，比如 budgeting（做预算）、minimalism（极简生活）等。"]}
{"word":"nonnecessitous","summary":{"en":"Nonnecessitous is a rare formal adjective meaning either “not poor/in need” (most common) or “not necessary” (less common).","zh":"nonnecessitous 是较少见的正式形容词，通常指“并不贫困/不匮乏”，较少也可指“非必要的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not poor or not in need; not lacking basic necessities (the opposite of necessitous).","zh":"不贫困的；不匮乏的；不缺生活必需品的（与 necessitous 相反）。"},"examples":[{"en":"The charity focuses on necessitous families, not those who are nonnecessitous.","zh":"这家慈善机构主要帮助贫困家庭，而不是那些并不缺乏生活必需品的人。"},{"en":"He came from a nonnecessitous background, so he had access to better schooling.","zh":"他出身并不贫困，因此能接受更好的教育。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not necessary; not required (a rare, formal use).","zh":"非必要的；不必的（较少见、偏正式用法）。"},"examples":[{"en":"The court excluded nonnecessitous details that did not affect the final decision.","zh":"法院排除了那些不影响最终裁决的非必要细节。"},{"en":"Try to remove nonnecessitous steps to make the process simpler.","zh":"尽量删去非必要步骤，让流程更简单。"}]}],"synonyms":["well-off","financially secure","not needy","unnecessary","optional"],"phonetic":"/ˌnɑn nəˈsɛsɪtəs/","extraExplanation":["这是一个非常少见、偏书面/法律或学术语体的词。日常英语里通常不用它。","构词：non-（否定前缀）+ necessitous（贫困的；匮乏的）。necessitous 来自 necessity（必需品；必要性）。因此 nonnecessitous 最常见的含义是“并不贫困/不匮乏”。","如果你想表达“并不贫困”，更自然的替代说法包括: not needy, not impoverished, financially secure, well-off。若想表达“非必要”，更常用: unnecessary, not required, optional。"]}
{"word":"nonnecessitously","summary":{"en":"Nonnecessitously is a rare adverb meaning “not necessarily” or “not out of necessity; voluntarily.”","zh":"nonnecessitously 是个罕见副词，意思是“不一定”，也可指“并非出于必需；自愿地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare) Not necessarily; not inevitably.","zh":"（罕见）不一定；不必然。"},"examples":[{"en":"A strict schedule is useful, but it is nonnecessitously the best choice for everyone.","zh":"严格的时间表很有用，但它不一定适合每一个人。"},{"en":"If you disagree, it does not nonnecessitously mean you are being disrespectful.","zh":"如果你不同意，也不一定表示你不尊重对方。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare) Not out of necessity; voluntarily; without being forced by need.","zh":"（罕见）并非出于必需；自愿地；不是因为需求所迫。"},"examples":[{"en":"She worked extra hours nonnecessitously, simply to gain experience.","zh":"她加班并非迫于需要，只是为了积累经验。"},{"en":"He donated nonnecessitously, not because anyone pressured him.","zh":"他捐款并非迫于压力，而是出于自愿。"}]}],"synonyms":["not necessarily","not inevitably","unnecessarily","voluntarily"],"phonetic":"/ˌnɑn.nəˈsɛs.ə.təs.li/","extraExplanation":["这个词非常少见，日常英语里几乎不用。表达“ 不一定 ”通常用 **not necessarily**；表达“ 不是必须、没有必要地 ”常用 **unnecessarily**；表达“ 不是出于需要而做某事 ”可用 **voluntarily / not out of necessity**。","构词上是 **non-（不）+ necessitous（匮乏的/有迫切需要的）+ -ly（副词）**。因为基础形容词 **necessitous** 本身就偏书面/古典，所以副词 **nonnecessitously** 更显得生僻。"]}
{"word":"nonnecessitousness","summary":{"en":"Nonnecessitousness means the condition of not being poor or in need; having no want or hardship.","zh":"nonnecessitousness 指“不贫困、不匮乏”的状态，即不处于需要援助或困苦之中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being necessitous (not being poor or in need); lack of want or hardship","zh":"不贫困／不匮乏的状态；不需要援助或不处于困境的状态"},"examples":[{"en":"After years of instability, the family finally enjoyed a measure of nonnecessitousness.","zh":"经历多年动荡后，这个家庭终于享有一定程度的富足与安稳。"},{"en":"The report contrasts extreme poverty with periods of relative nonnecessitousness.","zh":"报告将极端贫困与相对不匮乏的时期作对比。"}]}],"synonyms":["financial security","comfort","well-being","affluence","prosperity","self-sufficiency"],"phonetic":"/ˌnɑn.nəˈsɛs.ə.təs.nəs/","extraExplanation":["这个词非常罕见，多见于非常正式或学术化的写作中。日常英语里更常用 not in need、financial security、comfort、affluence、well-being 等表达。","构词上可以拆解为：non-（不）+ necessitous（贫困的、需要帮助的）+ -ness（名词后缀，表示“……的状态/性质”）。因此它字面意思就是“非贫困/非匮乏的状态”。","由于词形很长、语感偏“书面化”，如果你想让句子更自然，可以用更常见的替代表达（如 financial stability 或 being well-off）来改写。"]}
{"word":"nonnecessity","summary":{"en":"Nonnecessity means “the state of not being necessary; no need.” It’s a formal noun, and everyday English usually prefers “no need” or “unnecessary.”","zh":"nonnecessity 表示“非必要性/不需要”，是较正式的名词；日常更常用 “no need” 或 “unnecessary”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being necessary; a lack of need or requirement.","zh":"非必要性；不需要；无必要的状态。"},"examples":[{"en":"The report explained the nonnecessity of bringing paper copies because everything was digital.","zh":"报告说明了不必携带纸质副本，因为一切都是电子化的。"},{"en":"She argued for the nonnecessity of extra meetings when the team was already aligned.","zh":"她主张没有必要增加会议，因为团队已经达成一致。"}]}],"synonyms":["lack of necessity","no need","unnecessariness","redundancy"],"phonetic":"/ˌnɑn.nəˈsɛs.ə.ti/","extraExplanation":["“nonnecessity”由前缀 non-（否定）+ necessity（必要性）构成，意思直观，但在日常英语里相对少见，更多见于较正式或学术/法律风格的表达。日常口语中更常说：“there’s no need (to)… / it’s unnecessary (to)… / not necessary”。","语感上，“nonnecessity”强调的是“作为一种条件/状态的‘不需要’”，听起来更抽象、更书面；如果你想表达更自然，通常用“unnecessary”或“no need”。"]}
{"word":"nonnegation","summary":{"en":"Nonnegation means the absence of negation—an affirmative (positive) form or meaning. It’s a technical term; in everyday English, people usually say “affirmation” or “affirmative.”","zh":"Nonnegation 指“没有否定”的情况，即肯定式/正向表达。它偏技术用语；日常英语更常说 affirmation 或 affirmative。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(linguistics, logic) The absence of negation; an affirmative/positive form or meaning (i.e., not using words like “not,” “no,” “never,” or negative prefixes).","zh":"（语言学/逻辑）“非否定”；指没有使用否定手段的表达，即肯定式/正向形式或意义（不使用 not、no、never 或否定前缀等）。"},"examples":[{"en":"In many grammar lessons, teachers contrast negation (“She is not coming”) with nonnegation (“She is coming”).","zh":"在很多语法课里，老师会把否定（“She is not coming”）与非否定/肯定式（“She is coming”）进行对比。"},{"en":"Choose the nonnegation option if you want a neutral, factual statement.","zh":"如果你想要中性、陈述事实的说法，就选非否定（肯定式）的表达。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A term used in some technical writing to label “non-negative” contexts or constructions (contexts where negation is not present).","zh":"（较少见）在一些技术性写作中用于标注“非负/非否定环境”的术语，即不存在否定成分的语境或结构。"},"examples":[{"en":"The paper reports different results in negation vs. nonnegation contexts.","zh":"这篇论文报告了在否定语境与非否定语境下的不同结果。"}]}],"synonyms":["affirmation","affirmative (form)","positive (statement)","non-denial"],"phonetic":"/ˌnɑn.nɪˈɡeɪ.ʃən/","extraExplanation":["“nonnegation”不是日常英语里常用的单词，更常见的写法是带连字符的 **non-negation**，或直接说 **affirmation / affirmative (form)**（肯定/肯定式）。","如果你是在语言学语境里使用，它通常就是把句子分成 **affirmative（肯定式）** 和 **negative（否定式）** 两类：例如 “He knows.”（肯定式） vs. “He doesn’t know.”（否定式）。","如果你的意思其实是“非负（non-negative）”，那是另一个概念，通常写 **nonnegative**（一个词），多见于数学/数据分析。"]}
{"word":"nonnegative","summary":{"en":"Nonnegative means “not less than zero” (≥ 0); in general writing it can also mean “not negative in tone or outcome.”","zh":"nonnegative 的核心意思是“非负（≥0）”；在一般表达中也可指“态度或结果不消极”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a number or value) not less than zero; zero or positive.","zh":"（数或数值）不小于零的；非负的（即为零或正数）。"},"examples":[{"en":"The solution must be nonnegative, so x ≥ 0.","zh":"解必须是非负的，所以 x ≥ 0。"},{"en":"Probabilities are always nonnegative.","zh":"概率总是非负的。"},{"en":"The model assumes nonnegative demand growth.","zh":"该模型假设需求增长为非负（不下降）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In everyday writing) not negative in attitude, tone, or result; neutral to positive.","zh":"（日常表达）不消极的；语气或结果不为负面，偏中性到积极。"},"examples":[{"en":"Try to keep your feedback nonnegative and constructive.","zh":"尽量让你的反馈不带消极情绪并且具有建设性。"},{"en":"The test results were nonnegative overall, but we still need more data.","zh":"总体测试结果不算负面，但我们仍需要更多数据。"}]}],"synonyms":["not less than zero","zero or positive","non-negative","neutral (general tone)","not negative"],"phonetic":"ˌnɑnˈnɛɡətɪv","extraExplanation":["在数学里，nonnegative 的含义非常严格：nonnegative = ≥ 0；而 positive = > 0。也就是说 0 是 nonnegative，但不是 positive。","你会在“nonnegative integers（非负整数）”这种搭配里经常看到它：0, 1, 2, 3, …。相对的词是 negative（负的）和 nonpositive（非正的，≤0）。","日常英语中也会把 nonnegative 用来形容“态度/评价不消极”，但这种用法比 mathematical 用法少见；口语里更常说 neutral、not negative、positive。"]}
{"word":"nonnegativism","summary":{"en":"Nonnegativism is a rare word meaning ‘nonnegativity’—the property of not being less than zero; in specialized contexts it can mean a requirement that a representation has no negative values.","zh":"Nonnegativism 是个罕见词，通常指“非负性”（不小于 0 的性质）；在少数专门语境下也可指“表征必须不出现负值”的要求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) The state or quality of being nonnegative (not less than zero), especially in mathematics.","zh":"（罕用）非负性；指“不是负数”（不小于 0）的性质，尤用于数学语境。"},"examples":[{"en":"In optimization, nonnegativism is often expressed as the constraint x ≥ 0.","zh":"在最优化中，“非负性”常用约束 x ≥ 0 来表示。"},{"en":"The model assumes nonnegativism of all probabilities, so no negative values are allowed.","zh":"该模型假设所有概率都具有非负性，因此不允许出现负值。"}]},{"partOfSpeech":"n.","definition":{"en":"(specialized, rare) In some physics/philosophy-of-physics writing, the requirement that a probability or quasi-probability representation remain nonnegative (i.e., shows no ‘negativity’).","zh":"（专门/罕用）在部分物理学/物理哲学讨论中，指要求某种概率或“准概率”表征保持非负（不出现“负性”）的要求或立场。"},"examples":[{"en":"Some authors argue that nonnegativism fails for certain quantum states because the representation necessarily contains negative values.","zh":"有些作者认为，对于某些量子态，“非负性要求”无法满足，因为该表征必然包含负值。"},{"en":"The debate compares nonnegativism with contextuality as ways to describe what is ‘nonclassical.’","zh":"这场讨论把“非负性要求”和“语境性”作对比，用来描述何谓“非经典”。"}]}],"synonyms":["nonnegativity","being nonnegative","nonnegative constraint"],"phonetic":"/ˌnɑnˈnɛɡətɪˌvɪzəm/","extraExplanation":["“nonnegativism”在英语里非常少见，很多情况下更自然、更常用的说法是 **nonnegativity**（非负性）或 **being nonnegative**（为非负）。","如果你是在数学题/论文里看到它，通常就是“非负性”的意思；如果你是在量子物理（例如 Wigner 准概率）相关文本里看到它，往往指“要求表征不出现负值”的条件。","也有可能你原本想查的是 **noncognitivism**（非认知主义，伦理学/语言哲学术语）。如果你告诉我你看到这个词的句子/上下文，我可以帮你判断是哪一种。"]}
{"word":"nonnegativistic","summary":{"en":"Nonnegativistic means “not negative; zero or positive only,” but it’s uncommon—“nonnegative” is the usual word.","zh":"nonnegativistic 表示“非负的（只为 0 或正）”，但不常用，更常见的说法是 nonnegative。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not negative; having only zero or positive values (rare—more commonly said as “nonnegative”).","zh":"非负的；不是负数的；只包含 0 或正值的（较少见，更常说 nonnegative）。"},"examples":[{"en":"In this model, all probabilities must be nonnegativistic (that is, not less than zero).","zh":"在这个模型中，所有概率都必须是非负的（也就是不能小于 0）。"},{"en":"The algorithm assumes a nonnegativistic cost function, so the cost never becomes negative.","zh":"该算法假设代价函数是非负的，因此代价不会变成负数。"}]}],"synonyms":["nonnegative","not negative","zero-or-positive"],"phonetic":"/ˌnɑnˌnɛɡəˈtɪvɪstɪk/","extraExplanation":["“nonnegativistic”在英语里很少见，读者更熟悉、也更标准的表达通常是 **nonnegative**（非负的）或 **not negative**（不是负的）。如果你写学术论文/作业，建议优先用 nonnegative。","构词上它是 non-（不）+ negative（负的）+ -istic（……性质的）。-istic 常用来表示“具有某种特征/倾向”，但在这里会让词显得不自然或偏个人造词，所以在正式写作中容易被改成 nonnegative。","常见搭配示例：nonnegative numbers（非负数）、nonnegative real values（非负实数值）、nonnegative constraint（非负约束）、nonnegative matrix factorization / NMF（非负矩阵分解）。"]}
{"word":"nonnegativity","summary":{"en":"Nonnegativity is the mathematical property of being zero or greater (≥ 0).","zh":"Nonnegativity 指数学上的“非负性”，即数值为 0 或更大（≥0）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Math) The property of being not negative; having a value that is zero or greater (≥ 0).","zh":"（数学）非负性；指一个量不是负数，数值为零或大于零（≥0）。"},"examples":[{"en":"The nonnegativity of probabilities means each probability is at least 0.","zh":"概率的非负性意味着每个概率都至少为 0。"},{"en":"We assume nonnegativity of the variable, so its minimum possible value is zero.","zh":"我们假设该变量具有非负性，因此它可能的最小值是 0。"},{"en":"To prove the inequality, start from the nonnegativity of a square: (x−y)² ≥ 0.","zh":"要证明这个不等式，可以从平方的非负性出发：(x−y)² ≥ 0。"}]}],"synonyms":["non-negative value","being ≥ 0","nonnegative constraint"],"phonetic":"/ˌnɑnˌnɛɡəˈtɪvəti/","extraExplanation":["“nonnegativity”常见于数学、统计学、优化（optimization）和经济学写作中，尤其在约束条件里：例如 nonnegativity constraints 表示“变量必须≥0”。","词形上是 non-（不，非）+ negativity（负性/为负的性质）。学术写作里也常见更口语一点的表达：be nonnegative / be non-negative（非负的）。","相关词：nonnegative（adj. 非负的）；nonnegativity constraint（非负约束）；positivity（正性，通常指 >0 而不是 ≥0）。"]}
{"word":"nonnegligence","summary":{"en":"“Nonnegligence” means the absence of negligence—especially in legal contexts, showing someone acted with reasonable care.","zh":"“nonnegligence”指“不存在过失/疏忽”，多用于法律语境，强调已尽到合理注意义务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, formal) the absence of negligence; the fact of having acted with reasonable care.","zh":"（法律/正式）非过失；不存在疏忽大意；已尽到合理注意义务的状态。"},"examples":[{"en":"The defendant argued nonnegligence, claiming all safety procedures were followed.","zh":"被告主张不存在过失，称已遵守所有安全程序。"},{"en":"To prove nonnegligence, the company presented maintenance logs and staff training records.","zh":"为证明非过失，公司提交了维修记录和员工培训资料。"}]},{"partOfSpeech":"n.","definition":{"en":"(General, rare) not being careless; careful conduct.","zh":"（一般用法，较少见）不粗心；谨慎的行为方式。"},"examples":[{"en":"Her nonnegligence showed in the way she double-checked every detail.","zh":"她会反复核对每个细节，体现出她的不粗心/谨慎。"}]}],"synonyms":["absence of negligence","due care","reasonable care","lack of negligence","not negligent"],"phonetic":"/ˌnɑnˈnɛɡlɪdʒəns/","extraExplanation":["“nonnegligence”并不是日常英语里很常见的词。更常见的表达通常是：\n- “absence of negligence”（不存在过失）\n- “not negligent”（不构成过失）\n- “due care”（尽到合理注意）\n在法律语境中，它常用于强调当事人采取了合理谨慎措施，因此不应承担因“negligence（过失/疏忽）”而产生的责任。","构词上：non-（否定前缀）+ negligence（过失/疏忽）。写法上也可能见到带连字符的 “non-negligence”，含义基本相同，但实际使用频率仍偏低。"]}
{"word":"nonnegligent","summary":{"en":"Nonnegligent means “not negligent,” especially in legal contexts (having exercised reasonable care).","zh":"nonnegligent 表示“非疏忽的”，多用于法律语境，指已尽到合理注意义务。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not negligent; showing appropriate care and attention (especially in a legal context).","zh":"非疏忽的；尽到合理注意义务的（尤用于法律语境）。"},"examples":[{"en":"The court found the driver nonnegligent because she followed traffic rules and reacted reasonably.","zh":"法院认定该司机并非疏忽，因为她遵守交通规则且反应合理。"},{"en":"To be nonnegligent, a company must take reasonable steps to prevent foreseeable harm.","zh":"要被认定为非疏忽，公司必须采取合理措施防止可预见的损害。"}]}],"synonyms":["not negligent","non-negligent","duly careful (legal)","without negligence"],"phonetic":"/ˌnɑnˈnɛlɪdʒənt/","extraExplanation":["“nonnegligent”在日常英语中较少见，更常见的是用“not negligent”或“non-negligent”。它多出现在法律、保险、事故责任认定等正式文本里，用来说明某人/某方没有达到“疏忽（negligent）”的标准。","注意区分：nonnegligent（不构成疏忽）≠ careful（小心的）。前者强调法律上的“合理注意义务”是否尽到，后者更偏日常行为描述。"]}
{"word":"nonnegligently","summary":{"en":"“Nonnegligently” means “not negligently”—acting with reasonable care, usually in formal or legal contexts.","zh":"“nonnegligently”表示“并非疏忽地”，即以合理谨慎行事，常见于法律或正式语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not negligent; with reasonable care and attention (often used in legal or formal writing).","zh":"以非疏忽的方式；以合理的注意与谨慎行事（常用于法律或正式语境）。"},"examples":[{"en":"The company argued that it acted nonnegligently and followed standard safety procedures.","zh":"该公司辩称其行为并非疏忽，并遵循了标准安全程序。"},{"en":"If you drive nonnegligently, you check your mirrors and keep a safe distance.","zh":"如果你开车不疏忽，你会查看后视镜并保持安全车距。"}]}],"synonyms":["carefully","with due care","diligently","prudently","responsibly"],"phonetic":"/ˌnɑnˈnɛdʒələntli/","extraExplanation":["“nonnegligently”由 non-（否定前缀，“不”）+ negligently（疏忽地）组成，意思就是“并非疏忽地”。","它在日常口语中很少出现，更常见于法律文件、合同、诉讼材料或正式报告中，用来强调某人“尽到了合理注意义务”。日常表达更常说：“carefully / with due care / responsibly”。"]}
{"word":"nonnegligibility","summary":{"en":"Nonnegligibility means “not negligible”: something has a meaningful effect or importance and should not be ignored.","zh":"nonnegligibility 指“不可忽视性”：某事有实质影响或重要性，不能忽略。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or fact of being not negligible; having an effect or importance that should not be ignored.","zh":"“不可忽视”的性质或事实；指影响或重要性不容忽略。"},"examples":[{"en":"The report emphasizes the nonnegligibility of small errors when they accumulate over time.","zh":"报告强调：当小误差随时间累积时，其影响是不可忽视的。"},{"en":"In risk management, the nonnegligibility of rare events is a key concern.","zh":"在风险管理中，罕见事件的不可忽视性是一个关键问题。"}]}],"synonyms":["significance","materiality","nontriviality","importance"],"phonetic":"/ˌnɑnˌnɛɡlɪˈdʒɪbəlɪti/","extraExplanation":["“nonnegligibility”多见于学术/技术写作（数学、统计、经济、工程、法律论证等），用来强调某个因素虽然看起来很小，但在分析中不能当作0或不能忽略。","构词上：non-（否定）+ negligible（可忽略的）+ -ity（名词后缀，表示性质）。日常口语更常用：“is not negligible / is significant / matters”。"]}
{"word":"nonnegligible","summary":{"en":"“Nonnegligible” means noticeable or important enough that you should not ignore it.","zh":"“nonnegligible”表示“不可忽视的、足以产生影响的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not so small that it can be ignored; noticeable or important enough to matter.","zh":"不可忽视的；不算小的；有一定程度、足以产生影响的。"},"examples":[{"en":"There is a nonnegligible risk of side effects, so read the instructions carefully.","zh":"副作用的风险不可忽视，所以要仔细阅读说明。"},{"en":"Even a nonnegligible error rate can cause big problems at scale.","zh":"即使是不算小的错误率，在规模扩大时也会带来大问题。"}]}],"synonyms":["noticeable","meaningful","material","appreciable","non-trivial","significant (context-dependent)"],"phonetic":"/ˌnɑnˈnɛɡlɪdʒəbəl/","extraExplanation":["这是一个较正式、常见于学术/技术/商业写作的词，意思介于“很小（negligible）”和“很大（significant）”之间：它强调“不能当作零、不能忽略”。","拼写上常见两种：nonnegligible 与 non-negligible（加连字符）。两者意思相同，取决于写作风格指南。","在数学/统计语境里，它常用来说明某个量虽然不大，但在计算、误差分析或决策中需要纳入考虑。"]}
{"word":"nonnegligibleness","summary":{"en":"Nonnegligibleness means “notable importance; the fact of being not negligible.”","zh":"nonnegligibleness 指“不可忽视性；不容忽略的程度（重要性/显著性）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being not negligible; noticeable importance or significance","zh":"不可忽视性；不容忽略的程度；显著性"},"examples":[{"en":"Even a small error rate can have nonnegligibleness when millions of users are affected.","zh":"即使很小的错误率，在影响到数百万用户时也会具有不可忽视性。"},{"en":"The report argues that the side effects’ nonnegligibleness should be discussed more openly.","zh":"报告认为这些副作用的不可忽视性应当更公开地讨论。"}]}],"synonyms":["non-negligibility","significance","importance","materiality"],"phonetic":"/ˌnɑnˈnɛɡlɪdʒəbəlnəs/","extraExplanation":["这个词非常少见，更多见的是 **non-negligibility**（不可忽视性）或直接用 **significance / importance**（重要性）。","构词上是 *non-*（不）+ *negligible*（可忽略的）+ *-ness*（名词后缀），意思清楚但写法较“硬”，正式写作里通常建议换成更常用的表达。","有时也会写成 **non-negligibleness**（带连字符），含义相同。"]}
{"word":"nonnegligibly","summary":{"en":"Nonnegligibly means “to a noticeable or meaningful degree; not small enough to ignore,” often used in formal or academic contexts.","zh":"nonnegligibly 表示“在不可忽略的程度上”，常用于正式或学术语境，强调影响或差异不能当作零处理。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"To a noticeable or meaningful degree; not so small that it can be ignored.","zh":"在可察觉或有意义的程度上；大到不能忽略。"},"examples":[{"en":"The change in temperature affected the results nonnegligibly.","zh":"温度的变化对结果产生了不可忽略的影响。"},{"en":"Even a nonnegligibly small error can add up over time.","zh":"即使是不可忽略的微小误差，久而久之也会累积起来。"}]}],"synonyms":["noticeably","significantly","materially","meaningfully","appreciably"],"phonetic":"/ˌnɑnˈnɛɡlɪdʒəbli/","extraExplanation":["“nonnegligibly”常见于学术写作、工程、统计、经济等语境，用来强调某个影响/误差/概率“不是可以当作零”的程度。日常口语里更常说：noticeably / significantly / to a meaningful extent（视语气强弱而定）。","构词拆解：non-（不）+ negligible（可忽略的）+ -ly（副词后缀）。因此它表达“不可忽略地”。","搭配很固定：nonnegligibly affects/contributes/increases；a nonnegligibly small/large amount（强调“虽然可能不大，但不能忽略”）。"]}
{"word":"nonnegotiability","summary":{"en":"“Nonnegotiability” means a firm rule or principle that cannot be changed or compromised.","zh":"“Nonnegotiability”指不可谈判、不可妥协的底线或原则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being nonnegotiable; a firm condition or rule that cannot be changed or compromised.","zh":"“不可谈判性；不可妥协性”：指某个条件或规则非常坚定，不能更改、让步或打折扣。"},"examples":[{"en":"Safety is a nonnegotiability in our workplace.","zh":"安全在我们的工作场所是不可妥协的底线。"},{"en":"In this relationship, honesty is a nonnegotiability for me.","zh":"在这段关系里，诚实对我来说是不可谈判的原则。"},{"en":"The coach made punctuality a nonnegotiability for the whole team.","zh":"教练把准时定为全队不可让步的要求。"}]}],"synonyms":["nonnegotiable condition","nonnegotiable requirement","dealbreaker","bottom line","red line"],"phonetic":"/ˌnɑn.nəˌɡoʊ.ʃi.əˈbɪl.ə.ti/","extraExplanation":["“Nonnegotiability”由形容词“nonnegotiable（不可谈判的）”加名词后缀“-ity（……性）”构成，意思是“不可让步的性质/状态”。","它在日常英语里不算最传统的词，更多见于职场管理、谈判、心理学/自我边界（boundaries）等语境，用来强调“底线”“原则”“红线”。更常见的替代表达有：a nonnegotiable (rule/condition), a dealbreaker（底线/一票否决项）, a firm requirement（硬性要求）。","语气上通常很强硬，表达时要注意场合：在合作或亲密关系中，如果频繁使用，可能会让对方觉得缺乏弹性；更温和的说法可以是 “This is really important to me.” 或 “I’m not comfortable compromising on this.”"]}
{"word":"nonnegotiable","summary":{"en":"Nonnegotiable means “not open to discussion or compromise; must be accepted as it is.”","zh":"nonnegotiable 指“不可协商、不可让步、必须照办的（条件/原则）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not willing to change, compromise, or discuss something; something that must be accepted exactly as stated.","zh":"不可让步的；不容协商的；必须照办的（条件/要求）。"},"examples":[{"en":"My safety is nonnegotiable—I won’t get in a car with a drunk driver.","zh":"我的安全是不容协商的——我不会坐醉酒司机开的车。"},{"en":"The company said the deadline is nonnegotiable.","zh":"公司说截止日期不可更改。"},{"en":"For her, respect in a relationship is nonnegotiable.","zh":"对她来说，恋爱关系中的尊重是不可让步的底线。"}]}],"synonyms":["firm","fixed","unchangeable","inflexible","not up for debate"],"phonetic":"/ˌnɑn.nəˈɡoʊ.ʃi.ə.bəl/","extraExplanation":["这个词常用于谈“底线/原则/硬性条件”，语气比“important（重要）”更强，接近“必须如此，否则免谈”。","常见搭配：nonnegotiable deadline（不可延期的截止时间）、nonnegotiable requirement（硬性要求）、nonnegotiable boundary（不可触碰的界限）、nonnegotiable terms（不容谈判的条款）。","拼写提示：non-（否定前缀）+ negotiable（可协商的）。在商业合同语境里很常见，但在日常生活中也常用来表达个人界限。"]}
{"word":"nonnegotiation","summary":{"en":"Nonnegotiation means refusing to negotiate or discuss terms.","zh":"nonnegotiation 指「拒絕談判／不協商」的行為或政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or policy of not negotiating; a refusal to negotiate or discuss terms","zh":"不談判；不協商；拒絕就條件進行談判或討論的做法／政策"},"examples":[{"en":"The company’s nonnegotiation on salary made it hard to hire experienced workers.","zh":"公司對薪資採取不協商的態度，讓招募有經驗的員工變得很困難。"},{"en":"Their nonnegotiation signaled that the deadline was final.","zh":"他們拒絕協商，表示期限已定、沒有商量空間。"}]}],"synonyms":["refusal to negotiate","no-negotiation policy","inflexibility","stonewalling"],"phonetic":"/ˌnɑn nɪˌɡoʊʃiˈeɪʃən/","extraExplanation":["「nonnegotiation」本身在日常英文中不算常見，更常見的寫法是加連字號的「non-negotiation」，或直接用更自然的表達：a refusal to negotiate（拒絕談判）、a no-negotiation policy（不談判政策）。","不要把它和「nonnegotiable」混淆：nonnegotiable 通常是形容詞，表示「不可協商的／沒有討價還價空間的」（例如：This price is nonnegotiable.）。"]}
{"word":"nonnephritic","summary":{"en":"Medical adjective meaning “not related to nephritis (kidney inflammation).”","zh":"医学形容词，表示“与肾炎（肾脏炎症）无关/非肾炎性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Not related to nephritis (inflammation of the kidneys).","zh":"（医学）非肾炎性的；与肾炎（肾脏炎症）无关的。"},"examples":[{"en":"The biopsy suggested a nonnephritic kidney problem rather than nephritis.","zh":"活检提示这是非肾炎性的肾脏问题，而不是肾炎。"},{"en":"Doctors considered nonnephritic causes of blood in the urine.","zh":"医生考虑了尿血的非肾炎性原因。"}]}],"synonyms":["not nephritic","non-inflammatory (kidney-related context)"],"phonetic":"/ˌnɑːn.nəˈfrɪtɪk/","extraExplanation":["词形拆解：non-（不、非）+ nephritic（肾炎的）。nephritis 指“肾炎”，所以 nonnephritic 常用于医学语境，表示“不是由肾炎引起/与肾炎无关”。","在医学写作里，它常用来区分“肾炎性（nephritic）”与“非肾炎性”的疾病机制或表现（例如某些肾脏疾病的分型讨论）。"]}
{"word":"nonnervous","summary":{"en":"“nonnervous” means “not nervous,” but it’s more natural to write “non-nervous” or say “calm/relaxed.”","zh":"“nonnervous”表示“不紧张的”，但更自然的写法是“non-nervous”，或用“calm/relaxed”等表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard as one word) not nervous; calm and not anxious or easily startled.","zh":"（不常见的单词写法）不紧张的；镇定的；不焦虑或不容易受惊的。"},"examples":[{"en":"She looked nonnervous before the interview, but she said her hands were shaking.","zh":"面试前她看起来一点也不紧张，但她说自己的手一直在抖。"},{"en":"Try a few slow breaths so you can feel more nonnervous when you speak.","zh":"试着慢慢深呼吸几次，这样你讲话时会更不紧张。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical/rare) not related to nerves or the nervous system.","zh":"（技术/少见用法）与神经或神经系统无关的。"},"examples":[{"en":"The doctor noted a nonnervous cause for the pain.","zh":"医生指出这种疼痛的原因与神经无关。"}]}],"synonyms":["calm","relaxed","composed","unworried","not nervous"],"phonetic":"/ˌnɑnˈnɝvəs/","extraExplanation":["“nonnervous”更常见的写法是带连字符的 **non-nervous**，或者直接用更自然的表达：**calm / relaxed / not nervous**。在日常英语里，把它写成一个词（nonnervous）会显得不太地道，除非是在特定技术写作里。"]}
{"word":"nonnervously","summary":{"en":"“Nonnervously” means “calmly; without nervousness.”","zh":"“nonnervously”表示“镇定地；不紧张地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a calm, confident way; without showing nervousness.","zh":"不紧张地；镇定地；不慌不忙地。"},"examples":[{"en":"She answered the interviewer nonnervously, even when the questions got difficult.","zh":"即使问题变难了，她也不紧张地回答了面试官。"},{"en":"He spoke nonnervously to the crowd, like he had done it many times before.","zh":"他镇定地对人群讲话，仿佛以前做过很多次一样。"}]}],"synonyms":["calmly","confidently","composedly","steadily","without nervousness"],"phonetic":"/ˌnɑnˈnɝvəsli/","extraExplanation":["“nonnervously”是由 non-（表示“非、不”）+ nervously 组合而成的派生词，语义很直观：就是“不是紧张地”。在日常英语里它不算常见，更自然的说法通常是 calmly / confidently / without nervousness / in a relaxed way。","写作或正式表达中，如果你想听起来更地道，建议用“without + 名词”（without nervousness/anxiety）或直接用更常用的副词（calmly, confidently）。"]}
{"word":"nonnervousness","summary":{"en":"“Nonnervousness” means the state of not being nervous—calmness or composure.","zh":"“nonnervousness”指“不紧张”的状态，即镇定、从容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not feeling nervous; calmness or composure, especially in a situation that might normally cause anxiety.","zh":"不紧张的状态；（尤指在本来容易焦虑的情境中表现出的）镇定、从容。"},"examples":[{"en":"Her nonnervousness during the interview made a strong impression on the hiring manager.","zh":"她在面试时的从容镇定给招聘经理留下了很深的印象。"},{"en":"I tried to project nonnervousness even though my hands were cold.","zh":"尽管我手都凉了，我还是努力表现得不紧张。"}]}],"synonyms":["calmness","composure","poise","confidence","coolness"],"phonetic":"/ˌnɑnˈnɝːvəsnəs/","extraExplanation":["“nonnervousness”由前缀 non-（表示“非、没有”）+ nervous（紧张的）+ -ness（名词后缀，表示“……的状态/性质”）构成。它语义清楚，但在日常英语里不算常用，更多时候人们会说 calmness、composure、confidence，或用 “not nervous” 来表达。","这种带 non- 的名词有时用于强调“刻意表现出不紧张”（project nonnervousness），语气上比直接说 calmness 更“分析式”，常见于写作、心理描述或正式语境。"]}
{"word":"nonnescience","summary":{"en":"Nonnescience means ignorance or a lack of knowledge (rare/formal).","zh":"nonnescience 指“无知、缺乏知识”（罕见/偏正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of knowledge; ignorance. (A rare word.)","zh":"无知；缺乏知识。（较罕见的词）"},"examples":[{"en":"His confidence came from nonnescience rather than real expertise.","zh":"他的自信来自无知，而不是真正的专业能力。"},{"en":"The report exposed the nonnescience behind several poor decisions.","zh":"这份报告揭露了几项糟糕决定背后的无知。"}]}],"synonyms":["ignorance","lack of knowledge","unfamiliarity","unawareness","nescience"],"phonetic":"/ˌnɑnˈnɛʃəns/","extraExplanation":["nonnescience 很少见，通常在写作中用来显得正式或讽刺；日常英语更常用 ignorance / lack of knowledge / unfamiliarity。","词形上可理解为 non-（否定）+ nescience（无知，源自拉丁语 nescire“不了解”）。"]}
{"word":"nonnescient","summary":{"en":"Nonnescient is a very rare adjective meaning “not knowing; lacking knowledge or awareness.”","zh":"nonnescient 是一个非常少见的形容词，意思是“无知的；缺乏了解的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Not knowing; lacking knowledge or awareness; ignorant (often followed by “of”).","zh":"（很少见）无知的；缺乏知识或了解的（常与 of 连用）。"},"examples":[{"en":"Many people are nonnescient of how much data apps can collect.","zh":"很多人并不了解应用程序能收集多少数据。"},{"en":"She was nonnescient about the local customs, so she asked questions politely.","zh":"她对当地习俗不了解，所以她礼貌地提问。"}]}],"synonyms":["unaware","unknowing","uninformed","ignorant","nescient"],"phonetic":"/ˌnɑnˈnɛʃənt/","extraExplanation":["“nonnescient”非常罕见，多数学习者几乎不会在正规写作里见到。它看起来是由前缀 non-（不、非）+ nescient（无知的）构成，意思与 nescient、ignorant、unaware 接近。","更常见、更自然的表达通常是：unaware (of)、uninformed (about)、ignorant (of/about)。如果你想表达“不是科学的”，那常用词是 nonscientific / unscientific。","相关词：nescience（名词，“无知；缺乏知识”），在较正式或文学语境中更常见。"]}
{"word":"nonneural","summary":{"en":"Nonneural means “not neural,” especially referring to methods that do not use neural networks.","zh":"nonneural 表示“非神经的”，尤其指不使用神经网络的方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not neural; not relating to nerves, neurons, or a neural network (often used in computing to contrast with “neural” methods).","zh":"非神经的；不与神经、神经元或神经网络相关的（在计算机领域常用来与“神经”方法对比）。"},"examples":[{"en":"The paper compares a neural model with a nonneural baseline.","zh":"这篇论文将一个神经模型与一个非神经的基线方法进行比较。"},{"en":"They used a nonneural approach based on rules and statistics.","zh":"他们使用了一种基于规则和统计的非神经方法。"}]}],"synonyms":["non-neural","traditional (in ML context)","rule-based"],"phonetic":"/nɑn ˈnʊrəl/","extraExplanation":["“non-”是英语里很常见的否定前缀，表示“非……、不……”。因此 nonneural 通常就是“不是神经（网络）的”。在机器学习/自然语言处理里，它常用来指传统方法（如规则系统、线性模型、n-gram、统计特征工程等），用来和 neural（神经网络方法）对照。"]}
{"word":"nonneurotic","summary":{"en":"Nonneurotic means “not neurotic”: calm, emotionally stable, and not overly anxious.","zh":"nonneurotic 意为“不神经质的”：较冷静、情绪稳定，不过度焦虑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not neurotic; generally calm, emotionally stable, and not overly anxious or worried","zh":"不神经质的；通常指情绪较稳定、不太焦虑或不过度担忧的"},"examples":[{"en":"He stayed surprisingly nonneurotic during the exam and focused on the questions.","zh":"考试时他出奇地不焦虑，很专注地答题。"},{"en":"Her nonneurotic attitude helped the whole team relax.","zh":"她不紧张的态度让整个团队都放松了。"},{"en":"I’m trying to be more nonneurotic about small mistakes.","zh":"我正努力对小错误别那么焦虑。"}]}],"synonyms":["calm","easygoing","relaxed","levelheaded","emotionally stable"],"phonetic":"/ˌnɑn nʊˈrɑtɪk/","extraExplanation":["“non-”是英语里很常见的否定前缀，表示“非……/不……”。因此 nonneurotic 字面意思就是“not neurotic（不神经质的）”。写法上也常见作 non-neurotic（带连字符），两种一般都能理解。","neurotic 在日常英语里常被用来形容“过度担心、想太多、容易紧张”的性格或行为；但在专业心理/医学语境中它也可能与“神经症（neurosis）”等概念有关。nonneurotic 多用于日常描述气质（更放松、更稳定），不一定是正式的医学判断。"]}
{"word":"nonneutral","summary":{"en":"Nonneutral means not neutral—biased or taking a side, especially in language, analysis, or reporting.","zh":"nonneutral 指“不中立的”，即带偏向、站队的（常用于措辞、分析或报道）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not neutral; taking a side or showing bias instead of being impartial.","zh":"不保持中立的；有倾向性的；带有偏见的。"},"examples":[{"en":"The report was criticized for using nonneutral language that favored one group.","zh":"这份报告因使用了偏向某一群体的非中立措辞而受到批评。"},{"en":"As a mediator, try to stay neutral and avoid nonneutral comments.","zh":"作为调解者，尽量保持中立，避免发表非中立的评论。"}]},{"partOfSpeech":"adj.","definition":{"en":"In technical contexts (such as writing, research, or linguistics), describing wording, measurement, or analysis that is influenced by assumptions or values rather than being objective.","zh":"（技术语境中，如写作、研究或语言学）指措辞、测量或分析受立场/假设/价值观影响，而非客观中性的。"},"examples":[{"en":"Survey questions should be neutral; nonneutral wording can change how people answer.","zh":"问卷题目应尽量中性；非中立的措辞会影响受访者的回答。"},{"en":"The teacher asked students to rewrite the paragraph in a more neutral style because it sounded nonneutral.","zh":"老师让学生把那段话改写得更中性一些，因为原文听起来不够中立。"}]}],"synonyms":["biased","partial","partisan","one-sided","slanted","not neutral"],"phonetic":"/ˌnɑnˈnuːtrəl/","extraExplanation":["“nonneutral”常见于学术或正式写作里，意思接近“not neutral / biased”。很多出版物更偏好写成带连字符的“non-neutral”，尤其在正式英文中更常见。","在学习与写作中，常把“neutral language（中性措辞）”与“nonneutral language（非中立措辞）”对比使用；后者通常暗示说话者在用词上带有评价色彩或倾向。"]}
{"word":"nonneutrality","summary":{"en":"Nonnneutrality means not being neutral—showing bias or taking a side; in science it can also mean not being electrically neutral (having a net charge).","zh":"nonneutrality 指“非中立性”：表现出偏向或站队；在科学语境中也可指“非电中性”（具有净电荷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being neutral; showing a clear preference, bias, or commitment to one side (in politics, debate, reporting, research, etc.).","zh":"非中立性；不保持中立的状态（在政治、辩论、媒体报道、研究等中表现出明显立场、偏向或承诺）。"},"examples":[{"en":"The article’s nonneutrality was obvious: it praised one candidate and mocked the other.","zh":"这篇文章的非中立性很明显：它赞扬一位候选人，却嘲讽另一位。"},{"en":"Some activists argue that nonneutrality is necessary when basic human rights are at stake.","zh":"一些活动人士认为，当基本人权受到威胁时，不保持中立是必要的。"}]},{"partOfSpeech":"n.","definition":{"en":"In technical/scientific contexts, the condition of not being electrically neutral (having a net positive or net negative charge).","zh":"（技术/科学语境）电荷不呈电中性；带有净正电或净负电的状态。"},"examples":[{"en":"Dust particles can develop nonneutrality and then stick to surfaces more easily.","zh":"尘埃颗粒可能产生非电中性，从而更容易黏附在表面上。"}]}],"synonyms":["bias","partisanship","partiality","lack of neutrality","non-objectivity"],"phonetic":"ˌnɑnnuˈtrælɪti","extraExplanation":["“nonneutrality”由前缀 non-（“非、不”）+ neutrality（“中立性”）构成，常见于更正式或学术的写作中；日常英语里更常说 “lack of neutrality” 或直接用 “bias / partisanship”。","在公共讨论中，这个词有时带有价值判断：批评者用它指出“偏袒、不公”，支持者则可能用它表达“有原则的立场”（比如面对不公时不保持中立）。"]}
{"word":"nonneutrally","summary":{"en":"“Nonneutrally” means “not in a neutral or impartial way,” often implying bias; it can also be used technically to mean “not electrically/chemically neutral.”","zh":"“Nonneutrally”表示“以不够中立/不公正的方式”，常暗示偏见；在技术语境中也可指“非电中性/非化学中性”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not neutral; with a bias, preference, or involvement rather than being impartial.","zh":"以不中立的方式；带有偏向、立场或介入，而非保持公正。"},"examples":[{"en":"The moderator responded nonneutrally, praising one side’s argument more than the other.","zh":"主持人的回应不够中立，更称赞了一方的论点。"},{"en":"Even small word choices can make a report sound nonneutrally written.","zh":"即使是细微的用词也会让报道听起来带有不中立的倾向。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Technical) In a non-neutral manner, such as being electrically charged or chemically non-neutral.","zh":"（技术用法）以非“中性”的方式，例如带电或在化学意义上非中性。"},"examples":[{"en":"The particles behaved nonneutrally because they carried a net charge.","zh":"这些粒子由于带有净电荷而表现为非中性。"}]}],"synonyms":["biasedly","partisanly","one-sidedly","subjectively","prejudicially"],"phonetic":"/ˌnɑnˈnuːtrəli/","extraExplanation":["这个词在日常英语中比较少见，更常见的表达是：“in a biased way / in a non-neutral way / with bias / not neutrally”。写作里也常写成带连字符的形式“non-neutrally”，可读性更强。","含义通常指“立场不公正（新闻、评论、主持、学术写作）”，但在科学语境里也可能指“非电中性/非化学中性”。读到时可以根据上下文判断是哪一种“neutral”。","构词上是 non-（否定前缀）+ neutral + -ly（副词后缀）。发音时重音通常落在 neutral 相关的音节上。"]}
{"word":"nonnews","summary":{"en":"Nonnews means something that isn’t really news—too trivial or not truly new to matter.","zh":"nonnews 指“不算新闻”的内容：要么太琐碎，要么根本没有真正的新信息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something that is not really news; information or an event that is too minor, ordinary, or meaningless to deserve reporting or attention","zh":"不算新闻的事；不足以报道或不值得关注的信息/事件（太琐碎、普通或毫无意义）"},"examples":[{"en":"The headline turned out to be nonnews—nothing actually changed.","zh":"这个标题最后证明是“不算新闻”的事——实际上什么都没变。"},{"en":"Most of the discussion was nonnews, but one detail was important.","zh":"大部分讨论都不算新闻，但有一个细节很重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe coverage, updates, or stories that contain no real new information","zh":"（作定语）形容报道/更新/消息“没有新内容”、只是凑版面或炒冷饭"},"examples":[{"en":"It was a nonnews story built from recycled quotes.","zh":"那是一篇“没新内容”的报道，基本都是重复引用。"},{"en":"The channel filled the hour with nonnews updates.","zh":"这个频道用一堆“没营养的更新”填满了一小时。"}]}],"synonyms":["non-event","nothingburger","nonevent","triviality","nonstory"],"phonetic":"/ˌnɑnˈnuːz/","extraExplanation":["“nonnews”常见于媒体评论语境，带有批评意味：指把普通、重复、无关紧要的内容包装成“新闻”。","写作中也可用连字符形式“non-news”，更像是临时造词/修饰语（如 non-news story）。"]}
{"word":"nonnicotinic","summary":{"en":"Nonnicotinic means “not related to nicotine/nicotinic receptors” or, in some contexts, “not containing nicotine.”","zh":"nonnicotinic 指“与尼古丁/烟碱型受体无关的”，在某些语境下也可指“不含尼古丁的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Not related to nicotine or to nicotinic acetylcholine receptors; not acting through nicotinic pathways.","zh":"（生物/医学）与尼古丁或“烟碱型乙酰胆碱受体（nicotinic receptor）”无关的；不通过烟碱型途径起作用的。"},"examples":[{"en":"The study focused on nonnicotinic mechanisms that influence attention.","zh":"这项研究聚焦于影响注意力的非烟碱型机制。"},{"en":"They tested whether the drug’s effects were nicotinic or nonnicotinic.","zh":"他们测试这种药物的作用是烟碱型还是非烟碱型。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not containing nicotine (often used in product descriptions; sometimes written with a hyphen: non-nicotinic).","zh":"不含尼古丁的（常用于产品描述；也常写作带连字符的 non-nicotinic）。"},"examples":[{"en":"The label claims the liquid is nonnicotinic.","zh":"标签宣称这种液体不含尼古丁。"},{"en":"He switched to a nonnicotinic option to avoid nicotine exposure.","zh":"他改用不含尼古丁的选择来避免接触尼古丁。"}]}],"synonyms":["non-nicotinic","nicotine-free (context: products)","non-nAChR (context: research writing)"],"phonetic":"/ˌnɑnˌnɪkəˈtɪnɪk/","extraExplanation":["“Nonnicotinic”在学术文章里最常见的用法，是和“nicotinic（烟碱型）”对比，指**不通过烟碱型乙酰胆碱受体（nAChR）**产生的作用。常见对照词还包括“muscarinic（毒蕈碱型）”，两者都是乙酰胆碱受体的两大类。","在日常产品语境里，如果你看到“nonnicotinic / non-nicotinic”，通常是在说**不含尼古丁**；但在医学/药理语境里，它更常指“**机制上不是烟碱型**”，不一定是在谈“含不含尼古丁”。阅读时最好看上下文（比如是否提到 receptors、nAChR、synapse、agonist/antagonist 等）。"]}
{"word":"nonnihilism","summary":{"en":"Nonnihilism means rejecting nihilism and holding that life can have meaning or value; more loosely, it’s an attitude of not surrendering to “nothing matters.”","zh":"nonnihilism 指“反虚无主义/非虚无主义”：否定“人生毫无意义与价值”的看法，认为生命可以有意义；也可泛指不向“什么都无所谓”投降的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The rejection of nihilism; a viewpoint that life can have meaning, value, or purpose (even if those meanings are created by humans rather than given by religion or fate).","zh":"反虚无主义；一种否定“人生毫无意义/价值”的观点，认为生命可以有意义、价值或目标（即使这些意义可能是人自己创造出来的，而非由宗教或命运赋予）。"},"examples":[{"en":"After a difficult year, she moved from nihilism to nonnihilism and started setting small, meaningful goals.","zh":"经历艰难的一年后，她从虚无主义转向反虚无主义，开始设定一些小而有意义的目标。"},{"en":"His essays argue for nonnihilism: even in an uncertain world, kindness and responsibility still matter.","zh":"他的文章主张反虚无主义：即使世界充满不确定，善良与责任仍然重要。"}]},{"partOfSpeech":"n.","definition":{"en":"More loosely: an attitude of not giving in to “nothing matters,” choosing hope, commitment, or constructive action instead.","zh":"更宽泛地说：一种不陷入“反正都无所谓”的心态，而是选择希望、投入或建设性行动。"},"examples":[{"en":"In class discussions, her nonnihilism showed up as a focus on what people can do to improve things.","zh":"在课堂讨论中，她的反虚无主义体现在关注人们能做什么来让事情变得更好。"}]}],"synonyms":["anti-nihilism","rejection of nihilism","meaning-affirmation","humanism (sometimes, depending on context)"],"phonetic":"/ˌnɑnˈnaɪəˌlɪzəm/","extraExplanation":["这个词更像是“自造词/学术语境中的临时用词”：由前缀 non-（“非、反”）+ nihilism（虚无主义）构成，意思就是“不是虚无主义/反对虚无主义”。","注意：nonnihilism 并不像 nihilism、existentialism 那样是非常常见的标准术语；写作时如果担心读者不熟，可以改用更常见的表达，例如 anti-nihilism（反虚无主义）、a rejection of nihilism（对虚无主义的否定）、meaning-affirming view（肯定意义的观点）。","语感提示：它强调的是“立场上的否定（not nihilism）”，但并不自动说明你具体相信什么（比如宗教信仰、存在主义、实用主义、人本主义等）。如果需要更精确，通常要补一句你的积极主张是什么。"]}
{"word":"nonnihilist","summary":{"en":"Nonnihilist means “not a nihilist,” or “not nihilistic”—believing that life and values can still have meaning.","zh":"nonnihilist 指“非虚无主义者/非虚无主义的”，强调不认同虚无主义，认为生命与价值仍可能有意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a nihilist; someone who rejects nihilism (the belief that life has no meaning or value).","zh":"非虚无主义者；不是虚无主义者的人；指不认同“生命没有意义或价值”的虚无主义观点的人。"},"examples":[{"en":"She calls herself a nonnihilist because she believes people can create meaning through love and work.","zh":"她称自己为非虚无主义者，因为她相信人可以通过爱与工作创造意义。"},{"en":"Even as a skeptic, he’s a nonnihilist—he still thinks some values are worth defending.","zh":"即使他很怀疑主义，他也不是虚无主义者——他仍然认为有些价值值得捍卫。"}]},{"partOfSpeech":"adj.","definition":{"en":"not nihilistic; showing a belief that life, truth, or values can matter.","zh":"非虚无主义的；不带虚无倾向的；表现出认为生命、真理或价值仍然重要的态度。"},"examples":[{"en":"The novel has a nonnihilist ending: it’s dark, but it leaves room for hope.","zh":"这部小说的结局并非虚无：虽然阴郁，但仍留有希望。"},{"en":"His humor is cynical, but the message is ultimately nonnihilist.","zh":"他的幽默很犬儒，但信息最终并不虚无。"}]}],"synonyms":["not nihilistic","anti-nihilist","meaning-affirming","life-affirming"],"phonetic":"ˌnɑnˈnaɪəlɪst","extraExplanation":["这个词更常见的写法是 **non-nihilist**（有连字符），或 **nonnihilistic**（形容词）。在正式写作里，用连字符会更清楚。","“nihilism / nihilist（虚无主义/虚无主义者）”常与哲学语境相关，尤其会让人联想到尼采（Nietzsche）及后来的存在主义讨论；**nonnihilist**通常用于强调“反对虚无结论”，但不一定表示乐观，也可能只是主张“仍有某些意义或价值可成立”。","使用场景：学术讨论、书评影评、随笔中较常见；日常口语里更常说 **not a nihilist** 或 **not nihilistic**。"]}
{"word":"nonnihilistic","summary":{"en":"Nonnihilistic means “not nihilistic”—believing that meaning or values exist (or can be made), rather than that nothing matters.","zh":"nonnihilistic 指“非虚无主义的”——相信意义或价值存在（或可以被创造），而不是认为一切都无意义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nihilistic; holding the view that life, values, or meaning can exist (or can be created), rather than believing that nothing matters.","zh":"非虚无主义的；认为生命、价值或意义是存在的（或可以被创造出来）的，而不是认为一切都没有意义。"},"examples":[{"en":"The novel’s ending is dark, but ultimately nonnihilistic: the characters still choose to care for one another.","zh":"这部小说的结局很阴郁，但总体并不虚无：人物依然选择彼此关怀。"},{"en":"Her humor can sound cynical, yet her worldview is nonnihilistic—she believes people can improve.","zh":"她的幽默听起来很愤世嫉俗，但她的世界观并不虚无——她相信人是可以变好的。"},{"en":"He argued for a nonnihilistic ethics based on responsibility and empathy.","zh":"他主张一种非虚无主义的伦理学，以责任与同理心为基础。"}]}],"synonyms":["life-affirming","meaning-affirming","value-affirming","hopeful","purposeful"],"phonetic":"/ˌnɑnˌnaɪəˈlɪstɪk/","extraExplanation":["这个词由前缀 non-（“不、非”）+ nihilistic（“虚无主义的”）构成，意思就是“不是虚无主义的”。在学术写作、影评、哲学讨论里更常见，日常口语里人们更常说 “not nihilistic” 或 “life-affirming（肯定生命的）”。","注意它并不一定等于“乐观”。一个人可以承认痛苦、荒诞或不确定性，同时仍然认为行动、关系、道德或自我选择具有意义——这也可以称为 nonnihilistic。"]}
{"word":"nonnitric","summary":{"en":"“Nonnitric” means “not nitric,” typically used in scientific contexts to describe materials or conditions that do not involve nitric acid or nitrates.","zh":"“nonnitric”表示“非硝酸的”，多用于理工科语境，指不涉及硝酸或硝酸盐的材料/条件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nitric; not involving nitric acid or nitrate/nitric chemistry.","zh":"非硝酸的；不涉及硝酸或硝酸盐/硝酸体系的。"},"examples":[{"en":"The lab switched to a nonnitric cleaning solution to avoid nitrate residues.","zh":"实验室改用非硝酸类清洗液，以避免产生硝酸盐残留。"},{"en":"They used nonnitric conditions to prevent unwanted nitration of the compound.","zh":"他们采用非硝酸条件，以防止化合物发生不希望的硝化反应。"}]}],"synonyms":["non-nitric","nitric-free","not involving nitric acid"],"phonetic":"/ˌnɑnˈnaɪtrɪk/","extraExplanation":["“nonnitric”常见于化学/材料/实验流程语境，意思是“不是硝酸体系”。例如：不使用硝酸（nitric acid, HNO₃），或不引入硝酸根/硝酸盐（nitrate）。","更常见的写法是带连字符的“non-nitric”。在正式写作里，如果担心读者误读，建议用“non-nitric (not involving nitric acid)”来第一次说明。"]}
{"word":"nonnitrogenized","summary":{"en":"Nonnitrogenized means “not treated with nitrogen” or “without added nitrogen,” mainly used in technical contexts.","zh":"nonnitrogenized 指“未进行加氮/氮化处理的”，多见于技术或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not treated with nitrogen; not having nitrogen added (especially in chemistry, agriculture, or materials processing)","zh":"未进行氮化处理的；未添加氮（常用于化学、农业或材料加工语境）"},"examples":[{"en":"The researcher compared nitrogenized steel with nonnitrogenized steel to test hardness.","zh":"研究人员将氮化钢与未氮化钢进行对比，以测试硬度。"},{"en":"Use the nonnitrogenized sample as the control group in the experiment.","zh":"在实验中使用未加氮处理的样品作为对照组。"},{"en":"Some farmers prefer nonnitrogenized compost early in the season to avoid burning young plants.","zh":"有些农民在季初更倾向使用未额外加氮的堆肥，以避免“烧苗”。"}]}],"synonyms":["unnitrogenized","not nitrogen-treated","without added nitrogen"],"phonetic":"/ˌnɑnˈnaɪtrədʒəˌnaɪzd/","extraExplanation":["这个词非常少见，更多时候人们会用更常见的表达：**unnitrogenized**（未氮化/未加氮处理）或根据具体领域说 **not nitrogen-treated / without added nitrogen**。","注意区分：**nonnitrogenized（未加氮处理）** 强调“加工/处理过程没有加氮”；而 **non-nitrogenous / nonnitrogenous（无氮的）** 更强调“成分里不含氮”。两者在科学写作里含义不同。"]}
{"word":"nonnitrogenous","summary":{"en":"“Nonnitrogenous” means not containing nitrogen; in nutrition it often refers to carbs/fats rather than protein.","zh":"“nonnitrogenous”意为“不含氮的；无氮的”；在营养学中常指碳水/脂肪等相对于蛋白质（含氮）的成分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing nitrogen (a chemical element).","zh":"不含氮（化学元素）的；无氮的。"},"examples":[{"en":"The lab separated nitrogenous compounds from nonnitrogenous materials in the sample.","zh":"实验室把样品中的含氮化合物与无氮物质分离开来。"},{"en":"Some solvents are essentially nonnitrogenous, which can simplify certain analyses.","zh":"一些溶剂基本不含氮，这会让某些分析更简化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/Nutrition) Referring to nutrients or substances that do not supply nitrogen, often contrasted with protein (which is nitrogenous).","zh":"（生物/营养）指不提供氮的营养物或物质，常与蛋白质（含氮）相对。"},"examples":[{"en":"Carbohydrates and fats are often described as nonnitrogenous nutrients.","zh":"碳水化合物和脂肪常被描述为非含氮（无氮）营养素。"},{"en":"The diet was adjusted to include more nonnitrogenous calories to spare protein for tissue repair.","zh":"饮食被调整为增加更多无氮热量，以便让蛋白质更多用于组织修复。"}]}],"synonyms":["non-nitrogenous","nitrogen-free","without nitrogen"],"phonetic":"/ˌnɑnˌnaɪˈtrɑdʒənəs/","extraExplanation":["这个词常见的写法也有 **non-nitrogenous**（带连字符），含义相同；在科学写作中两种都能见到，是否加连字符多取决于期刊/编辑风格。","理解时可以把它拆开：**non-**（不、非）+ **nitrogenous**（含氮的）。因此它主要用于化学、食品科学、营养学等语境，用来和 **nitrogenous（含氮的，常指蛋白质/含氮化合物）**作对比。"]}
{"word":"nonnitrous","summary":{"en":"Nonnitrous is a rare adjective meaning “not nitrous”—either not involving nitrous-type nitrogen compounds (chemistry) or not containing nitrous oxide (N2O).","zh":"nonnitrous 是较少见的形容词，表示“非亚硝的/不含亚硝形态氮的”（化学）或“不含笑气N2O的”（一般语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chemistry, technical) Not nitrous; not containing nitrogen in the “nitrous” form (i.e., with nitrogen in a lower oxidation/valence state than in corresponding nitric compounds).","zh":"（化学，术语）非亚硝的；不含“亚硝”形态的氮（与对应的“硝”化合物相比，氮处于较低的价态/氧化态）。"},"examples":[{"en":"This product uses a nonnitrous nitrogen source instead of nitrous compounds.","zh":"这种产品使用非亚硝形态的氮源，而不是亚硝类化合物。"},{"en":"Under these conditions, the reaction avoids forming nitrous by-products and remains largely nonnitrous.","zh":"在这些条件下，反应避免生成亚硝副产物，整体上保持为非亚硝。"}]},{"partOfSpeech":"adj.","definition":{"en":"(general/medical or automotive context) Not containing nitrous oxide (“nitrous”).","zh":"（一般/医疗或汽车语境）不含一氧化二氮（笑气，nitrous）的。"},"examples":[{"en":"The dentist chose a nonnitrous option for sedation.","zh":"牙医选择了不使用笑气的镇静方案。"},{"en":"It’s a nonnitrous setup—no N2O system is installed.","zh":"这是一个不带氮氧增压（N2O）系统的配置。"}]}],"synonyms":["nitrous-free","without nitrous oxide","non-nitrous"],"phonetic":"/ˌnɑnˈnaɪtrəs/","extraExplanation":["“nonnitrous”很少见，更多时候人们会直接说 **nitrous-free**（不含笑气/不含N2O）或在化学里用更具体的术语来描述。字典中常把它当作 *nitrous* 的派生词（other word form）。 ([dictionary.com](https://www.dictionary.com/browse/nitrous?utm_source=openai))","如果你本来想表达“无氮的/不含氮的”，更常见、也更标准的词是 **non-nitrogenous / nonnitrogenous**（无氮的）。 ([merriam-webster.com](https://www.merriam-webster.com/dictionary/nonnitrogenous?utm_source=openai))"]}
{"word":"nonnobility","summary":{"en":"“Nonnobility” means people who are not nobles (the common people).","zh":"“nonnobility”指非贵族阶层（与贵族相对的平民）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are not part of the nobility; the common people as contrasted with nobles.","zh":"非贵族阶层；与贵族相对的平民（普通民众）。"},"examples":[{"en":"In the story, the nonnobility had fewer legal rights than the nobles.","zh":"在故事里，非贵族阶层的法律权利比贵族更少。"},{"en":"The law applied differently to the nobility and the nonnobility.","zh":"这项法律对贵族和非贵族的适用方式不同。"}]}],"synonyms":["commoners","the common people","the non-nobility","the lower classes","plebeians"],"phonetic":"/ˌnɑn.noʊˈbɪləti/","extraExplanation":["“nonnobility”不是特别常见的标准词，更常见的表达是“commoners / the common people / the non-nobility”。\n它是由前缀“non-”（不、非）+“nobility”（贵族）构成，含义直观，但在正式写作中往往会用更自然的替换说法。\n写作时建议加连字符“non-nobility”，可读性更好，也更符合英语构词习惯。"]}
{"word":"nonnoble","summary":{"en":"Nonnoble means “not noble,” either in character (not honorable) or, more rarely, in social status (not aristocratic).","zh":"nonnoble 意为“并非高尚的/并非贵族的”，常指品格不高尚；较少情况下指出身非贵族。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not noble in character or behavior; lacking honor, generosity, or moral dignity.","zh":"（品格或行为）不高尚的；不光明磊落的；缺乏荣誉感或道德尊严的。"},"examples":[{"en":"It was a nonnoble act to take credit for someone else’s work.","zh":"把别人的功劳据为己有是一种不高尚的行为。"},{"en":"She refused to answer the insult with anything nonnoble.","zh":"她拒绝用任何不体面的方式回击侮辱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not belonging to the noble class; not aristocratic (rare, mainly historical or formal writing).","zh":"非贵族出身的；不属于贵族阶层的（较少见，多用于历史或较正式的写法）。"},"examples":[{"en":"In the novel, the hero is nonnoble but rises through talent and courage.","zh":"在小说里，主人公出身非贵族，但凭才华与勇气崛起。"}]}],"synonyms":["ignoble","dishonorable","base","unworthy","not noble"],"phonetic":"/nɑnˈnoʊbəl/","extraExplanation":["“nonnoble”在现代英语里不算常用词，更常见的写法是加连字符的“non-noble”，或者直接说“not noble / ignoble”。","如果你想表达“化学里的贵金属/非贵金属”，更自然的说法是“non-noble metals”（通常带连字符：non-noble metals）。","注意含义区别：noble（高尚的/贵族的）→ nonnoble（不高尚/非贵族）；而 ignoble 更常用，语气也更明确，偏“卑劣的、不光彩的”。"]}
{"word":"nonnocturnal","summary":{"en":"Nonnocturnal means “not nocturnal”—not mainly active at night (often active in the daytime).","zh":"nonnocturnal 表示“非夜行性的”，即不是主要在夜间活动的（常偏向白天活动）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nocturnal; not mainly active at night (often active in the daytime instead).","zh":"非夜行性的；不是主要在夜间活动的（常指更偏向白天活动）。"},"examples":[{"en":"Most songbirds are nonnocturnal and are easiest to observe in the morning.","zh":"大多数鸣禽是非夜行性的，早晨最容易观察到。"},{"en":"The researcher compared nocturnal and nonnocturnal mammals in the same habitat.","zh":"研究人员比较了同一栖息地里的夜行性与非夜行性哺乳动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general) Not related to the night; occurring or used during the day rather than at night.","zh":"（更一般）与夜晚无关的；在白天发生或使用的（而不是夜间的）。"},"examples":[{"en":"They switched to a nonnocturnal schedule to match daytime work hours.","zh":"他们改用非夜间作息，以配合白天的工作时间。"}]}],"synonyms":["non-nocturnal","not nocturnal","diurnal (often, but not always the same)","day-active"],"phonetic":"/ˌnɑn.nɑkˈtɝː.nəl/","extraExplanation":["这个词由前缀 non-（“不、非”）+ nocturnal（“夜行性的；夜间的”）构成，意思就是“不是夜行性的”。","写法上更常见的是加连字符的 non-nocturnal；不加连字符（nonnocturnal）也能见到，但较少用，多出现在学术或技术性文本里。","在动物行为分类里，和它最常对比的是 nocturnal（夜行性）以及 diurnal（昼行性、白天活动）。nonnocturnal 更宽泛，强调“不是夜里活动为主”，不一定严格等于 diurnal。"]}
{"word":"nonnocturnally","summary":{"en":"“Nonnocturnally” means “not at night; during the day,” and is a rare, formal/technical adverb.","zh":"“nonnocturnally”表示“非在夜间（多指白天）”，属于较罕见、偏正式/技术性的副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare, formal) Not at night; in a way that is not nocturnal (i.e., during the day or not specifically happening at night).","zh":"（罕见、较正式）不是在夜间；以非夜行/非夜间发生的方式（即在白天，或并非特指夜间发生）。"},"examples":[{"en":"Unlike owls, these birds feed nonnocturnally—mostly in daylight.","zh":"与猫头鹰不同，这些鸟类以非夜间的方式觅食——主要在白天。"},{"en":"The pain occurs nonnocturnally and does not wake him from sleep.","zh":"疼痛在非夜间时段出现，并不会把他从睡眠中疼醒。"},{"en":"The park is open nonnocturnally, from sunrise to sunset.","zh":"公园在非夜间时段开放，从日出到日落。"}]}],"synonyms":["during the day","in the daytime","in daylight","diurnally","not at night"],"phonetic":"ˌnɑn.nɑkˈtɝ.nəl.i","extraExplanation":["这个词很少见，通常出现在医学、动物行为学、生态学等较“书面/技术性”的语境里，用来和 nocturnally（夜间地）形成对比。日常英语更常说 during the day / in the daytime / in daylight / not at night。","构词上是 non-（否定前缀，“不”）+ nocturnal（夜间的/夜行性的）+ -ly（副词后缀）。"]}
{"word":"nonnomad","summary":{"en":"“Nonnomad” is a nonstandard word meaning a person who is not nomadic (someone settled in one place). More common: “non-nomad” or “non-nomadic.”","zh":"“nonnomad”是较少见的（非标准）说法，指“非游牧者/定居者”。更常见的写法是“non-nomad”或“non-nomadic”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nonstandard) A person who is not a nomad; someone who lives in one place rather than moving from place to place.","zh":"（非标准用法）非游牧者；不四处迁徙、通常定居在一个地方的人。"},"examples":[{"en":"Unlike her nomad friends, she’s a nonnomad who prefers a stable home and routine.","zh":"和她那些游牧式生活的朋友不同，她是个“非游牧者”，更喜欢稳定的家和规律的生活。"},{"en":"The program is designed for nonnomads who want long-term community ties.","zh":"这个项目是为希望建立长期社区联系的“非游牧者”设计的。"}]}],"synonyms":["non-nomad","non-nomadic person","settled person","resident","sedentary person"],"phonetic":"ˌnɑnˈnoʊmæd","extraExplanation":["“nonnomad”在主流词典中不常见，更像是由前缀 non-（“非/不”）+ nomad（“游牧者”）临时拼造出来的词，因此读者可能会觉得生硬或不地道。更自然、更常见的表达通常是：**non-nomad**（带连字符）或 **non-nomadic (person/people)**（形容词）。","在学术/人类学语境里，描述“定居”的对立概念时，也常用 **sedentary**（定居的）以及名词 **sedentary people/population**（定居人群）。如果你是在写作或正式场合，建议优先用这些更通行的说法。"]}
{"word":"nonnomadic","summary":{"en":"Nonnomadic means not nomadic—settled in one place rather than moving around.","zh":"nonnomadic 表示“非游牧的、定居的”，指不四处迁徙而是长期居住在一个地方。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nomadic; living in one place rather than moving from place to place.","zh":"非游牧的；定居的（不四处迁徙）。"},"examples":[{"en":"Many families became nonnomadic after they started farming.","zh":"许多家庭在开始务农后变成了非游牧、定居的生活方式。"},{"en":"The group was nonnomadic and built permanent homes near the river.","zh":"这个群体是非游牧的，他们在河边建造了永久住所。"}]}],"synonyms":["settled","sedentary","resident"],"phonetic":"/ˌnɑn noʊˈmædɪk/","extraExplanation":["拼写上常见两种形式：nonnomadic 和 non-nomadic（带连字符）。两者意思相同；在正式写作里，带连字符的形式更常见一些，尤其是在学术/说明性文本中。","语境上常用于人类学、历史或社会学讨论，和“sedentary（定居的）”意思接近，但“nonnomadic”更强调“不是游牧/不迁徙”，而“sedentary”更强调“长期固定居住、定居形态”。"]}
{"word":"nonnomadically","summary":{"en":"“Nonnomadically” means doing something in a settled, stable way—without moving from place to place.","zh":"“nonnomadically”表示“以定居、稳定的方式”，即不四处迁移地做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a settled, non-moving way; not by traveling from place to place (the opposite of living or working nomadically).","zh":"以定居、不迁徙的方式；不是以游牧/到处迁移的方式（与 nomadically 相反）。"},"examples":[{"en":"After years of remote travel, she decided to work nonnomadically and stay in one city.","zh":"在远程漂泊多年后，她决定以非游牧的方式工作，固定待在一座城市。"},{"en":"The community has lived nonnomadically for generations, farming the same land each year.","zh":"这个社区世世代代过着非游牧的生活，每年都耕种同一片土地。"}]}],"synonyms":["in a settled way","stably","permanently","as a resident","without relocating"],"phonetic":"/ˌnɑnnoʊˈmædɪkli/","extraExplanation":["这个词由 three parts 组成：non-（“不、非”）+ nomadic（“游牧的/流动的”）+ -ly（把形容词变成副词）。意思很直观：用“非游牧”的方式做某事。","实际使用中它比较少见；更常见、更自然的表达包括：“in a settled way / in a stable location / without moving around / as a permanent resident（以长期居民身份）”。写作时如果担心读者不熟悉，也可以改用这些更常用的说法。"]}
{"word":"nonnominalistic","summary":{"en":"Nonnominalistic means ‘not nominalistic,’ especially ‘not based on nominalism’ in philosophy; it can also mean ‘not just in name’ (rare).","zh":"nonnominalistic 指「非唯名論的」（尤其哲學語境）；也可泛指「不只停留在名稱層面」（較罕見）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Philosophy) Not nominalistic; not based on nominalism (the view that universals/abstract entities are only names rather than real things).","zh":"（哲學）非唯名論的；不以唯名論（認為共相/抽象實體只是名稱而非真實存在）為立場的。"},"examples":[{"en":"Her argument is nonnominalistic: she treats properties like “redness” as something real, not merely a word.","zh":"她的論證是非唯名論的：她把「紅色性」視為真實存在，而不只是語詞。"},{"en":"A nonnominalistic theory tries to explain similarity by appealing to shared universals, not just shared labels.","zh":"非唯名論的理論會用「共享的共相」來解釋相似性，而不只靠「同一個名稱」。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, not merely in name or label; not focused on naming/terminology alone (rare usage).","zh":"更一般地說：不僅停留在名稱/標籤層面；不只是著重術語或命名（罕見用法）。"},"examples":[{"en":"The reform was meant to be nonnominalistic—changing real practices, not just the title of the policy.","zh":"這項改革希望是「不只改名」的——改變實際作法，而不只是政策名稱。"}]}],"synonyms":["anti-nominalist","realist (about universals)","non-nominalist","nonnominal"],"phonetic":"ˌnɑnˌnɑmɪnəˈlɪstɪk","extraExplanation":["這個字非常罕見，多見於學術語境或大型詞表中，日常英語幾乎不用。一般更常說：anti-nominalist（反唯名論的）、realist about universals（在「共相」問題上持實在論立場的）、non-nominalist。","理解它的關鍵是先懂 nominalism（唯名論）：討論「像紅色性、三角形性、人性」這類共相/抽象對象是否真的存在，還是只是我們給許多個別事物取的同一個名字。nonnominalistic 就是「不採唯名論那套」的意思。"]}
{"word":"nonnomination","summary":{"en":"Nonnomination means the absence of a nomination—someone or something is not nominated, often unexpectedly.","zh":"nonnomination 指“未被提名/不提名”的情况，常用于正式语境，强调提名没有发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or situation of not nominating someone or something (especially when a nomination might have been expected).","zh":"未提名；不提名（尤指在原本可能会提名的情况下）。"},"examples":[{"en":"Her nonnomination for the award surprised many fans.","zh":"她未获该奖项提名让许多粉丝感到意外。"},{"en":"The committee explained the nonnomination as a matter of eligibility, not quality.","zh":"委员会解释说不提名是资格问题，而不是质量问题。"}]}],"synonyms":["non-nomination","lack of nomination","absence of a nomination","omission (from the nominees)","snub (informal)"],"phonetic":"/ˌnɑnˌnɑməˈneɪʃən/","extraExplanation":["“nonnomination”在实际写作中较少见，更常见的拼写是加连字符的“non-nomination”，用来强调“没有发生提名”这一结果或过程。","它常出现在正式语境（例如奖项、选举、委员会任命、候选人提名流程）里，用来描述“缺席/未发生”的提名，而不是“拒绝提名（refusal to nominate）”那种带有主动否决意味的表达。","近义表达可根据语气选择：中性可用“lack of nomination / absence of a nomination（缺少提名）”；如果强调被排除或被忽视，可用“snub（冷落/不给面子）”，但“snub”更口语、带评价色彩。"]}
{"word":"nonnormal","summary":{"en":"Nonnormal means “not normal,” either in everyday life (unusual/abnormal) or in statistics (not normally distributed).","zh":"nonnormal 表示“不正常的/不符合常态的”，也可用于统计学，指“非正态分布的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not normal; different from what is usual, expected, or typical.","zh":"不正常的；不符合常态的；不同于通常、预期或典型情况的。"},"examples":[{"en":"The doctor said the test results were nonnormal and needed a follow-up.","zh":"医生说化验结果不正常，需要复查。"},{"en":"It’s nonnormal for the server to crash every afternoon.","zh":"服务器每天下午都崩溃是不正常的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Statistics/Math) Not following a normal (Gaussian) distribution.","zh":"（统计/数学）非正态的；不服从正态（高斯）分布的。"},"examples":[{"en":"The data are nonnormal, so the analyst used a nonparametric test.","zh":"数据是非正态的，所以分析师使用了非参数检验。"},{"en":"Income data are often nonnormal because of a long right tail.","zh":"收入数据常常是非正态的，因为右侧有很长的尾部。"}]}],"synonyms":["abnormal","unusual","atypical","irregular","nonstandard"],"phonetic":"/ˌnɑnˈnɔrməl/","extraExplanation":["“nonnormal”在日常英语里不算最常见的写法，更常见的是“abnormal / unusual”，或写成带连字符的“non-normal”（尤其在正式写作或统计学语境中）。","在统计学里，“normal”通常特指“正态分布”。因此“nonnormal data”一般不是在说“奇怪/不对劲”，而是在描述数据分布形状不符合正态。"]}
{"word":"nonnormality","summary":{"en":"Nonnormality means a lack of normality—something unusual or, in statistics, data that is not normally distributed.","zh":"nonnormality 指“不正常/非典型”的状态；在统计学中指“非正态性”，即数据不符合正态分布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of not being normal; unusualness or deviation from what is typical or expected","zh":"不正常；非典型状态；偏离常态"},"examples":[{"en":"The doctor ran more tests to understand the nonnormality in the blood results.","zh":"医生做了更多检查来了解血液检测结果中的异常。"},{"en":"In some families, what looks like nonnormality from outside may feel completely ordinary inside.","zh":"在一些家庭里，外人看来“不正常”的事，在家庭内部可能感觉很普通。"}]},{"partOfSpeech":"n.","definition":{"en":"(statistics) a departure from a normal (Gaussian) distribution in data","zh":"（统计学）非正态性；数据分布偏离正态（高斯）分布的性质"},"examples":[{"en":"Because of nonnormality, the analyst used a nonparametric test instead of a t-test.","zh":"由于存在非正态性，分析师使用了非参数检验而不是 t 检验。"},{"en":"A few extreme values can increase nonnormality and affect standard statistical assumptions.","zh":"少数极端值会增强非正态性，从而影响常见统计假设。"}]}],"synonyms":["abnormality","unusualness","deviation","atypicality","non-normality"],"phonetic":"/ˌnɑnˌnɔrˈmælɪti/","extraExplanation":["这个词是由“non-（非）+ normality（正常性）”构成的，意思很直观，但在日常英语里不算常用。日常表达里更常见的是“abnormality（异常）”“unusualness（不寻常）”。","在学术/数据分析语境中，“nonnormality”更常见，常用来说明数据“不服从正态分布”，从而提醒某些统计方法（比如基于正态假设的检验）可能不适用。"]}
{"word":"nonnormally","summary":{"en":"“Nonnormally” means “not in the usual/normal way,” but it is uncommon; “abnormally” or “not normally” is more natural.","zh":"「nonnormally」表示「不正常／不如平常地」，但很少用；更自然的說法是「abnormally」或「not normally」。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not normal or usual; not normally.","zh":"以不正常／不尋常的方式；不如平常。"},"examples":[{"en":"The machine is running nonnormally, so we should shut it down and check the settings.","zh":"這台機器運轉得不正常，所以我們應該先關機再檢查設定。"},{"en":"If you’re breathing nonnormally (very fast or with difficulty), seek help right away.","zh":"如果你呼吸不正常（非常快或很費力），請立刻求助。"}]}],"synonyms":["abnormally","unusually","atypically","oddly","not normally"],"phonetic":"/ˌnɑnˈnɔrməli/","extraExplanation":["「nonnormally」在日常英文中很少見，較常用的說法是 **abnormally**、**unusually**，或直接說 **not normally**。","拼寫上也常見加連字號的形式 **non-normally**，特別是在技術文件或較正式的寫作裡。"]}
{"word":"nonnormalness","summary":{"en":"“Nonnormalness” is an informal, nonstandard noun meaning “not-normality” or “abnormality.”","zh":"“nonnormalness”是较口语、非标准的名词，意思是“非正常/异常的状态或性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being not normal; lack of normality (informal, not a standard dictionary word).","zh":"不正常的状态；非正常性（较口语/临时造词，通常不算标准词）。"},"examples":[{"en":"After the storm, the nonnormalness of daily life lasted for weeks.","zh":"暴风雨过后，日常生活的那种“不正常状态”持续了好几个星期。"},{"en":"The movie highlights the nonnormalness of a town where nothing is what it seems.","zh":"这部电影突出表现了一个小镇的“异样/不寻常”，那里一切都并非表面看上去那样。"}]},{"partOfSpeech":"n.","definition":{"en":"something unusual or abnormal; an odd feature or behavior (rare; used humorously or for emphasis).","zh":"不寻常的事物/特征；异常之处（较少见，常带调侃或强调语气）。"},"examples":[{"en":"Ignore the small nonnormalness in the data—it's just a measurement error.","zh":"数据里那个小小的“异常”别管了——只是测量误差。"}]}],"synonyms":["abnormality","unusualness","irregularity","atypicality","lack of normality"],"phonetic":"/ˌnɑnˈnɔrməlnəs/","extraExplanation":["“nonnormalness”是由 non-（不、非）+ normal（正常的）+ -ness（名词后缀，表示“……的状态/性质”）拼出来的临时造词。英语里更自然、更常见的说法通常是“abnormality”“unusualness”或“lack of normality”。","如果用于正式写作（论文、报告、求职材料等），建议改用更标准的词：abnormality（异常/反常）、deviation from normal（偏离常态）、irregularity（不规则/异常）、atypicality（非典型性）。在口语、吐槽或文学风格里偶尔用“nonnormalness”可以制造一种夸张或幽默的效果。"]}
{"word":"nonnotable","summary":{"en":"Nonnotable (more commonly non-notable) means “not notable; not important enough to attract attention.”","zh":"nonnotable（更常见拼写为 non-notable）意为“不显著的；不够重要或不够有名、不太值得注意的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not notable; not important or famous enough to deserve special attention (often written with a hyphen as **non-notable**).","zh":"不值得注意的；不够重要或不够出名、因此不太值得特别关注的（常写作带连字符的 **non-notable**）。"},"examples":[{"en":"The editor removed the page because the topic was considered non-notable.","zh":"编辑删除了这个页面，因为该主题被认为不具备“显著性/知名度”。"},{"en":"Most of the changes were non-notable and didn’t affect the results.","zh":"大多数改动并不显著，不会影响结果。"}]}],"synonyms":["unnoteworthy","unremarkable","insignificant","not notable"],"phonetic":"/ˌnɑnˈnoʊtəbəl/","extraExplanation":["“nonnotable”不是很常见的标准拼写，更常见的是 **non-notable**（带连字符），意思是“not notable”。在维基百科等网络语境里，它常和 **notability（显著性/知名度）** 的规则相关，用来表示“未达到收录或单独成条目的标准”。","日常英语里，如果只是想表达“平平无奇/不值得一提”，更自然的词通常是 **unnoteworthy**、**unremarkable**、**insignificant** 等。"]}
{"word":"nonnotableness","summary":{"en":"Nonnotableness means the quality of not being notable—being undistinguished or not attracting attention.","zh":"Nonnotableness 指“不显著/不出名”的性质或状态，即缺乏值得注意的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being not notable; lack of distinction or public attention","zh":"不显著；不出名；缺乏引人注意或重要性的状态"},"examples":[{"en":"Despite years of hard work, the artist struggled with nonnotableness outside her hometown.","zh":"尽管努力多年，这位艺术家在家乡之外仍一直难以摆脱“不出名”的处境。"},{"en":"The report’s nonnotableness came from repeating ideas that were already well known.","zh":"这份报告之所以“不显眼”，是因为它只是重复了早已广为人知的观点。"},{"en":"He joked about his own nonnotableness, but he was proud of doing quiet, useful work.","zh":"他拿自己的“不出名”开玩笑，但他为自己做着安静而有用的工作感到自豪。"}]}],"synonyms":["obscurity","anonymity","unremarkableness","insignificance","lack of notability"],"phonetic":"/ˌnɑnˈnoʊtəbəlnəs/","extraExplanation":["你输入的 **nonnotableness** 在英语里非常少见，多见于词表/旧式或刻意“造词”的语境。它来自形容词 **nonnotable**（不显著的、不出名的）+ 名词后缀 **-ness**（……的性质/状态）。有时也会看到写作 **non-notableness**（带连字符）以便更容易读。","实际写作中，更自然常用的表达通常是 **lack of notability**（缺乏知名度/显著性）、**obscurity**（默默无闻）、**unremarkableness**（平平无奇）。如果你是在学术/百科/社群规则里看到它，往往是在讨论“是否值得被注意/收录”的程度。"]}
{"word":"nonnotably","summary":{"en":"“Nonnotably” means “not in a notable way; unremarkably.”","zh":"“nonnotably”表示“并不显著地；平淡无奇地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not notable; without attracting attention; unremarkably.","zh":"不显著地；不引人注意地；平淡无奇地。"},"examples":[{"en":"The change happened nonnotably, and most people didn’t notice until later.","zh":"这次变化发生得不显著，大多数人直到后来才注意到。"},{"en":"Her career progressed nonnotably for years before one breakthrough role.","zh":"她的事业多年都平淡无奇，直到后来靠一个角色取得突破。"},{"en":"The restaurant is clean and affordable but nonnotably average.","zh":"这家餐厅干净又实惠，但整体就是不怎么出彩的普通水平。"}]}],"synonyms":["unremarkably","inconspicuously","ordinarily","not particularly","without standing out"],"phonetic":"/nɑnˈnoʊtəbli/","extraExplanation":["“nonnotably”比较少见，通常是由 non-（不、非）+ notably（显著地、值得注意地）构成，意思等同于“not notably / unremarkably”。在正式写作里，更常用 unremarkably（平淡无奇地）或 not particularly（并不特别……）来表达。"]}
{"word":"nonnotational","summary":{"en":"Nonnotational means “not using notation/symbols,” or (in art theory) “not a strict, rule-decodable notational system.”","zh":"nonnotational 指“非记号化／不使用记谱或符号的”，也可指（艺术理论中）“不构成可按规则精确解码的记谱系统”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving, using, or written in a system of notation (special symbols or marks), such as mathematical notation or musical notation.","zh":"不涉及、不使用、也不以「记号／符号系统」书写的（如数学符号、乐谱记谱等）。"},"examples":[{"en":"The teacher used a nonnotational method to introduce rhythm—students clapped and moved instead of reading sheet music.","zh":"老师用非记谱的方法来介绍节奏——学生用拍手和动作，而不是读乐谱。"},{"en":"We started with a nonnotational explanation, then added formulas after everyone understood the idea.","zh":"我们先用非符号化的方式解释，等大家理解概念后再加入公式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Art / philosophy of symbols) Not forming a strict “notational system,” meaning you cannot match parts of the symbol to meaning in a precise, unambiguous, rule-based way (for example, many pictures).","zh":"（艺术／符号哲学）不构成严格的「记谱系统」：无法把符号的各个部分与意义做精确、无歧义、按规则的对应（例如许多图像）。"},"examples":[{"en":"A photo can communicate clearly, but it is often described as nonnotational because its details don’t map to meaning like notes in a score.","zh":"照片可以表达得很清楚，但它常被称为非记谱的，因为它的细节不像乐谱音符那样能与意义一一对应。"},{"en":"In that theory, tempo words like “Allegro” may be treated as nonnotational directions rather than part of the defining score.","zh":"在那种理论里，“快板（Allegro）”之类的速度词可能被视为非记谱性的指示，而不是界定乐曲身份的记谱内容。"}]}],"synonyms":["non-symbolic","non-formal","non-mathematical","unnotated"],"phonetic":"/ˌnɑn.noʊˈteɪʃənəl/","extraExplanation":["“nonnotational”常出现在艺术哲学与符号学讨论中，尤其与“notational system（记谱系统）”对比：记谱系统强调元素清晰分割、可重复、可按规则解码（像乐谱音高/时值或数学符号）；而图像、绘画等往往更依赖情境与整体理解，因此被称为nonnotational。","拼写上既可写作 nonnotational，也常见分写 non-notational 或 non notational；含义通常不变，主要看出版/学科习惯。"]}
{"word":"nonnotification","summary":{"en":"Nonnotification means a failure to notify or give required notice, especially in legal or administrative situations.","zh":"nonnotification 指未通知/未依法告知，常见于法律或行政等正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of not notifying someone; a failure or omission to give notice (often in legal or administrative contexts)","zh":"未通知；未发出通知（常用于法律或行政语境，指未依法/未按要求告知）"},"examples":[{"en":"The court ruled that nonnotification of the hearing date violated the defendant’s rights.","zh":"法院裁定，未通知开庭日期侵犯了被告的权利。"},{"en":"The policy requires written notice; nonnotification may void the claim.","zh":"该保单要求书面通知；未通知可能导致理赔无效。"},{"en":"We apologized for the nonnotification and updated our email list.","zh":"我们为未通知致歉，并更新了邮件名单。"}]}],"synonyms":["non-notification","failure to notify","lack of notification","omission of notice","no notice"],"phonetic":"/ˌnɑnˌnoʊtəfɪˈkeɪʃən/","extraExplanation":["“nonnotification”更常见的写法是“non-notification”（加连字符），多见于合同、保险、法院程序、政府公告等正式文本。日常英语里更常用“failure to notify / not giving notice / lack of notification”。","它通常强调“本应通知但没有通知”的程序性问题，而不只是“没收到消息”。在法律语境中，是否构成有效的non-notification，往往取决于法规/合同规定的通知方式（书面、送达、邮件等）和期限。"]}
{"word":"nonnotional","summary":{"en":"Nonnotional is a rare adjective meaning either “real/practical (not just theoretical)” or, in grammar, “a function word with little lexical meaning.”","zh":"nonnotional 是个较少见的形容词，可指“非纯理论、偏真实实际的”，也可在语法中指“非实义词/功能词（词汇意义弱、主要起语法作用）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not based only on an idea or theory; real or practical rather than imaginary","zh":"非纯概念性的；并非只存在于想法/理论中；偏真实或实际的（而非想象的）"},"examples":[{"en":"The plan sounded good, but we needed nonnotional results we could measure.","zh":"这个计划听起来不错，但我们需要能衡量的、真正实际的成果。"},{"en":"They moved from notional targets to nonnotional changes in daily work.","zh":"他们从“概念性目标”转向了日常工作中真正发生的改变。"}]},{"partOfSpeech":"adj.","definition":{"en":"(linguistics, of a word) not carrying clear lexical/content meaning; mainly serving a grammatical function (like articles, prepositions, auxiliaries)","zh":"（语言学/语法，指词）非实义的；不表达明确的词汇意义，主要起语法作用（如冠词、介词、助动词等）"},"examples":[{"en":"In the sentence, “the” is a nonnotional word that helps mark the noun.","zh":"在这个句子里，“the”是非实义词，主要用于标记名词。"},{"en":"Learners often memorize nonnotional words as part of patterns, not as standalone meanings.","zh":"学习者常把非实义词当作固定句型的一部分来记，而不是当作单独的“意思”来背。"}]}],"synonyms":["practical","real","non-theoretical","functional","grammatical"],"phonetic":"/ˌnɑnˈnoʊʃənəl/","extraExplanation":["“nonnotional”这个词本身很少见，更常见的写法是“non-notional”。在语法教学里，它通常对应“function words / grammatical words（功能词/语法词）”，与“notional/content words（实义词）”相对。","注意：日常英语里人们更常直接说“practical/real”或“function word”，而不是用“nonnotional”。用在写作中会显得比较学术或教材化。"]}
{"word":"nonnoumenal","summary":{"en":"“Nonnoumenal” means “not noumenal”—typically referring to what is observable/experienced (phenomenal) rather than a noumenal “thing-in-itself.”","zh":"“nonnoumenal”意为“非本体的”，通常指可观察、可经验到的现象层面，而非“物自身”的本体层面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not noumenal; not relating to a *noumenon* (a “thing-in-itself” known independent of sensory experience). In practice, it usually means **phenomenal / experiential / sensory** rather than metaphysical.","zh":"非本体的；不属于“物自身（noumenon）”层面的。实际用法中常指**现象的、经验的、可感知的**，而非形而上学的。"},"examples":[{"en":"In Kant’s terms, science mainly describes the **nonnoumenal** world we can observe and measure.","zh":"用康德的说法，科学主要描述我们能观察和测量的**非本体（现象）**世界。"},{"en":"They argued about whether morality has a noumenal basis or is purely **nonnoumenal**, grounded in human experience.","zh":"他们争论道德是否有本体层面的基础，还是完全**非本体的**、建立在人类经验之上。"}]}],"synonyms":["phenomenal","empirical","experiential","sensory","observable"],"phonetic":"/ˌnɑn.nuˈmiː.nəl/","extraExplanation":["“nonnoumenal”很少见，更常见的写法是 **non-noumenal**（带连字符）。","它主要出现在哲学语境，尤其与康德相关：**noumenal（本体的）** vs **phenomenal（现象的）**。因此很多时候直接用 **phenomenal / empirical / experiential** 会更自然。","构词：non-（非）+ noumenal（本体的）。注意它不是日常英语常用词，写作时通常需要上下文解释。"]}
{"word":"nonnoumenally","summary":{"en":"Nonnoumenally means “not in a noumenal (thing-in-itself) way,” but rather in terms of appearances/experience (phenomena).","zh":"nonnoumenally 指“非物自身（本体）层面地”，而是从经验中可呈现的“现象/显现”角度来理解或描述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare; philosophy) In a way that is **not noumenal**—i.e., not about a “thing-in-itself,” but about what can be experienced or described as it appears (phenomenally). ([collinsdictionary.com](https://www.collinsdictionary.com/us/dictionary/english/noumenally?utm_source=openai))","zh":"（罕见；哲学）以“非本体/非物自身（noumenal）”的方式；强调经验中可呈现、可描述的“现象层面”（phenomenal），而不是“物自身”。 ([collinsdictionary.com](https://www.collinsdictionary.com/us/dictionary/english/noumenally?utm_source=openai))"},"examples":[{"en":"Kant argues that we know objects only as they appear—so we think about them nonnoumenally, within experience.","zh":"康德认为我们只能认识对象“如何显现”，所以我们对对象的理解是非本体性的（在经验范围内）。"},{"en":"If you discuss the chair’s color and shape, you’re speaking nonnoumenally, not about what it is “in itself.”","zh":"如果你谈椅子的颜色和形状，你是在谈现象层面（非本体层面），而不是它“自身是什么”。"}]},{"partOfSpeech":"adv.","definition":{"en":"(general, informal extension) In a non-abstract, observable, practical way; focusing on what can be noticed or measured rather than hidden “deeper reality.”","zh":"（一般、非正式引申）以不那么抽象、可观察/可测量、更务实的方式；关注能被注意到的事实，而非假设的“更深层真实”。"},"examples":[{"en":"Let’s describe the results nonnoumenally—using the data we can actually observe.","zh":"我们用非本体性的方式来描述结果——用我们确实能观察到的数据。"}]}],"synonyms":["non-noumenally","not noumenally","phenomenally (philosophy)","empirically","observably","in terms of appearances"],"phonetic":"/ˌnɑnˈnuːmənəli/","extraExplanation":["这个词在英语里非常少见，通常更常见的写法是带连字符的 **non-noumenally**（non- + noumenally），或者干脆写成 “not noumenally”。","在康德哲学里：**noumenal / noumenon** 指“物自身”（thing-in-itself），而 **phenomenal / phenomenon** 指“现象/显现”。因此 *nonnoumenally* 基本就是“从现象/经验角度（而非物自身角度）”。 ([britannica.com](https://www.britannica.com/topic/noumenon?utm_source=openai))","如果你的本意是“现象地、在经验中”，更自然的替代词常见有 **phenomenally**（哲学语境）或 **empirically / observably**（日常与学术写作更常用）。"]}
{"word":"nonnourishing","summary":{"en":"“Nonnourishing” means not providing nutrition or real benefit (literally or figuratively).","zh":"“nonnourishing”表示“不滋养、缺乏营养”，也可引申为“没有实质益处/空洞的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not nourishing; providing little or no nutrition, strength, or benefit.","zh":"不滋养的；缺乏营养的；（比喻）不能带来力量、益处或满足的。"},"examples":[{"en":"Many sugary drinks are filling but nonnourishing.","zh":"很多含糖饮料会让人有饱腹感，但并不滋养（没什么营养）。"},{"en":"He lived on a nonnourishing diet of snacks and instant noodles.","zh":"他长期靠零食和方便面这种不滋养的饮食过活。"},{"en":"She found the conversation nonnourishing—pleasant, but empty.","zh":"她觉得那段对话不滋养——听起来愉快，却很空洞。"}]}],"synonyms":["innutritious","nutritionally empty","unwholesome","empty (figurative)"],"phonetic":"/ˌnɑnˈnɝɪʃɪŋ/","extraExplanation":["这个词由 non-（表示“非、不”）+ nourishing（滋养的、有营养的）构成，意思很直观。常见搭配有：nonnourishing food/diet/meal（缺乏营养的食物/饮食/一餐）。","除了字面“营养”之外，它也常用于比喻：nonnourishing conversation/relationship/entertainment（不能滋养心灵或成长的谈话/关系/娱乐），语气通常带一点批评或失望。"]}
{"word":"nonnourishment","summary":{"en":"Nonnourishment means a lack or absence of nourishment (not getting enough food or nutrients).","zh":"nonnourishment 指“缺乏营养/没有获得足够食物或养分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence or lack of nourishment; a state of not receiving enough food or nutrients","zh":"缺乏营养；未获得足够食物或养分的状态"},"examples":[{"en":"The doctor warned that prolonged nonnourishment could damage her organs.","zh":"医生警告说，长期缺乏营养可能会损伤她的器官。"},{"en":"In the report, nonnourishment was linked to poverty and limited access to fresh food.","zh":"报告指出，缺乏营养与贫困以及难以获得新鲜食物有关。"}]}],"synonyms":["malnutrition","undernutrition","starvation","lack of nourishment","nutritional deficiency"],"phonetic":"/ˌnɑnˈnɝɪʃmənt/","extraExplanation":["“nonnourishment”并不是日常英语里最常见的词，更常见的说法是 **malnutrition（营养不良）**、**undernutrition（营养摄入不足）**、**starvation（饥饿/挨饿，程度更重）** 或 **lack of nourishment（缺乏营养）**。","语感上它是由 **non-（不/缺乏）+ nourishment（营养/滋养）** 组合而成，通常用于较正式或说明性（医学、报告、法律/政策文本）语境。"]}
{"word":"nonnovel","summary":{"en":"“Nonnovel” means either “not new/original” or “not a novel (fiction).” The hyphenated form “non-novel” is more common; for “非小说类” you often say “nonfiction.”","zh":"“nonnovel”可指“并不新颖/非原创”，也可指“不是小说（虚构长篇）”。更常见写法是“non-novel”；表达“非小说类（纪实类）”通常用“nonfiction”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not new or original; not novel (often used in technical or academic writing).","zh":"不新颖的；并非新提出的；不具“新奇/创新”性质的（常见于技术或学术语境）。"},"examples":[{"en":"The approach is nonnovel, but it is reliable and easy to implement.","zh":"这种方法并不新颖，但它可靠且容易实施。"},{"en":"The reviewer noted that the idea was nonnovel and had been discussed before.","zh":"审稿人指出这个想法并不新颖，之前已经有人讨论过。"}]},{"partOfSpeech":"adj.","definition":{"en":"not a novel (a long fictional book); used to describe writing or a work that is something else (e.g., a textbook, biography, or essay collection).","zh":"不是小说（长篇虚构作品）；用于描述某种作品或写作体裁并非小说（如教材、传记、论文集等）。"},"examples":[{"en":"I’ve been reading mostly nonnovel books lately, like biographies and history.","zh":"我最近主要读非小说类书，比如传记和历史。"},{"en":"The class focuses on nonnovel forms of storytelling, including memoir and reportage.","zh":"这门课关注非小说类的叙事形式，包括回忆录和纪实写作。"}]}],"synonyms":["not novel","unoriginal","conventional","nonfiction (for the book meaning)","not a novel"],"phonetic":"/ˌnɑnˈnɑvəl/","extraExplanation":["“nonnovel”更常见的写法是带连字符的 **non-novel**；在出版与阅读领域，如果你想表达“非小说（nonfiction）”，更自然的说法通常是 **nonfiction** 或 **nonfiction book**，而不是 nonnovel。","在学术语境里，**novel** 常指“新提出的/原创的”，所以 **non-novel** 常用于说明某方法或结论“并非首次提出”。"]}
{"word":"nonnuclear","summary":{"en":"Nonnuclear means “not involving nuclear energy or nuclear weapons,” and less commonly, “not related to an atomic nucleus.”","zh":"nonnuclear 指“非核的（不涉及核能或核武器）”，较少见时也可指“与原子核无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving nuclear energy, nuclear weapons, or nuclear reactions.","zh":"非核的；不涉及核能、核武器或核反应的。"},"examples":[{"en":"The country agreed to use only nonnuclear energy sources for the project.","zh":"该国同意该项目只使用非核能源。"},{"en":"They discussed nonnuclear ways to reduce the risk of war.","zh":"他们讨论了降低战争风险的非核方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not relating to the nucleus of an atom (used in scientific writing).","zh":"与原子核无关的（常用于科学写作）。"},"examples":[{"en":"The researchers measured nonnuclear effects in the material.","zh":"研究人员测量了该材料中的非核效应。"}]}],"synonyms":["non-nuclear","conventional (in weapons contexts)","renewable (in energy contexts, depending on meaning)"],"phonetic":"/ˌnɑnˈnuːkliər/","extraExplanation":["“nonnuclear”=“non-（非）+ nuclear（核的）”。在新闻与政策语境中，最常见是指“非核武/非核手段/非核能源”。","写作上也常见用法是把它换成更自然的表达：nonnuclear weapons（非核武器）也可说 conventional weapons（常规武器）；nonnuclear energy（非核能源）也可说 renewable energy（可再生能源）或 fossil fuels（化石燃料），具体看你想强调哪一类。"]}
{"word":"nonnucleated","summary":{"en":"“Nonnucleated” means “without a nucleus,” often used to describe certain cells (like mature human red blood cells).","zh":"“nonnucleated”表示“无细胞核的”，常用于描述某些细胞（如人类成熟红细胞）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking a nucleus (the central structure in a cell that contains genetic material).","zh":"无细胞核的；不含细胞核的（指细胞中没有包含遗传物质的“细胞核”结构）。"},"examples":[{"en":"In humans, mature red blood cells are nonnucleated, which leaves more space for hemoglobin.","zh":"在人类体内，成熟的红细胞是无细胞核的，这样可以为血红蛋白腾出更多空间。"},{"en":"The microscope image showed mostly nonnucleated cells rather than nucleated ones.","zh":"显微镜图像显示大多是无细胞核细胞，而不是有核细胞。"}]}],"synonyms":["anucleate","enucleated"],"phonetic":"/ˌnɑnˈnuːkliˌeɪtɪd/","extraExplanation":["这是一个偏生物学/医学的形容词：non-（不、无）+ nucleated（有核的）。日常英语里不太常见，学术写作中更常见。","相关概念：nucleated（有核的）与 nonnucleated（无核的）常用于对比不同细胞类型；例如哺乳动物成熟红细胞通常无核，而许多其他动物的红细胞可能有核。","近义表达在学术语境里常见 anucleate / enucleated（无核的/去核的），但用法细微不同：enucleated 常暗示“被去掉细胞核”的过程。"]}
{"word":"nonnullification","summary":{"en":"“Nonnullification” is a rare noun meaning the act or policy of not nullifying something—i.e., not canceling or invalidating it.","zh":"“Nonnullification”是个较少见的名词，表示“不使无效/不废止/不撤销”的行为或政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act, policy, or situation of not nullifying something (not canceling, not invalidating, not making it legally/officially void)","zh":"不使无效；不废止；不撤销（指不去“宣告无效/作废/取消”的行为、政策或状态）"},"examples":[{"en":"The court’s decision amounted to nonnullification of the agreement, meaning the contract stayed in force.","zh":"法院的裁定等同于对该协议的“不予宣告无效”，也就是合同仍然有效。"},{"en":"Critics argued that the agency’s new rule was nonnullification in disguise because it kept the old restrictions alive.","zh":"批评者认为该机构的新规是“变相不废止”，因为它让旧限制继续存在。"}]}],"synonyms":["refusal to nullify","non-annulment","upholding","maintaining validity"],"phonetic":"/ˌnɑnˌnʌlɪfɪˈkeɪʃən/","extraExplanation":["这个词非常少见，通常出现在比较正式的法律/政策讨论里。它是由前缀 non-（“不/非”）+ nullification（“使无效、废止、撤销”）构成，字面意思就是“没有发生废止/无效化”。日常英语里更常用的说法是: refusal to nullify（拒绝废止）、not to invalidate（不使无效）、non-annulment（不撤销；也较正式）或 simply “upholding” a rule/decision（维持某项规定/裁定）。","容易和 nullification（废止/使无效）混淆；如果你想表达“把某事作废”，用 nullification 或 the nullification of... 更自然。"]}
{"word":"nonnumeral","summary":{"en":"“Nonnumeral” means “not a numeral”—not expressed as a number, digit, or numeral word; it can also mean a non-numeral word/symbol in grammar.","zh":"“nonnumeral” 表示“非数词/非数字的”：不是用数字或数词来表达；在语法中也可指“非数词的词/符号”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a numeral; not written or expressed using numerals (digits) or numeral words.","zh":"非数字（词）；不是用数字（阿拉伯数字）或表示数量的数字词来写或表达的。"},"examples":[{"en":"Please enter a nonnumeral response, such as a short sentence, not a number.","zh":"请输入非数字的回答，比如一句短句，而不是数字。"},{"en":"The form rejected the code because it contained nonnumeral characters.","zh":"这张表格因为代码里含有非数字字符而被拒绝了。"}]},{"partOfSpeech":"n.","definition":{"en":"A word or symbol that is not a numeral (especially in grammar/linguistics).","zh":"非数字（词/符号）；（尤指语法/语言学中）不属于数词的词或符号。"},"examples":[{"en":"In this sentence, “many” is a quantifier, not a numeral; it’s a nonnumeral.","zh":"在这个句子里，many 是量词，不是数词；它属于非数词。"}]}],"synonyms":["non-numeric","nonnumerical","nonquantitative","not a number"],"phonetic":"/ˌnɑnˈnuːmərəl/","extraExplanation":["这个词更常见的写法是 **non-numeral**（带连字符）；**nonnumeral** 也能见到，但更像是技术写作或某些编辑风格下的合并写法。","日常英语里更常用的替代表达通常是 **non-numeric / nonnumerical / not a number**。在语法/语言学语境中，才更可能用到 non(-)numeral 来对比 numeral（数词）。","注意区分：**numeral** 指“表示数字/数量的符号或词”（如 3、three、third），而 **number** 更常指“数/号码”这个概念或具体数值。"]}
{"word":"nonnumeric","summary":{"en":"“Nonnumeric” means not made of numbers and not treated as a number (often in data/tech contexts).","zh":"“nonnumeric”指“非数字的”，即不由数字构成、通常不应按数字处理（常用于数据/技术语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not numeric; not consisting of numbers (digits), and not intended to be treated as a number.","zh":"非数字的；不由数字（数码）构成的；不应被当作数字处理的。"},"examples":[{"en":"Please enter a nonnumeric password—don’t use your phone number.","zh":"请输入非数字的密码——不要用手机号。"},{"en":"The form rejected the input because it contained nonnumeric characters like “A” and “-”.","zh":"表格拒绝了该输入，因为其中包含像“A”和“-”这样的非数字字符。"},{"en":"In the spreadsheet, the nonnumeric values were treated as text.","zh":"在电子表格里，非数字的值会被当作文本处理。"}]}],"synonyms":["non-numeric","not numeric","nonnumerical"],"phonetic":"/ˌnɑnˈnuːmərɪk/","extraExplanation":["“nonnumeric”常见于计算机与数据场景（表单验证、编程、数据库、统计等），意思通常是“不是纯数字”。在很多系统里，空格、符号（如-、.）、字母、甚至带单位的字符串（如“12kg”）都可能被判定为nonnumeric，具体取决于规则。","拼写上也常见作“non-numeric”（带连字符）。两种写法一般都能理解，但在正式写作或技术文档中，带连字符的形式更常见。相关近义表达包括“non-numerical”“not a number / NaN（在编程里）”，但NaN是更特定的技术概念。"]}
{"word":"nonnumerical","summary":{"en":"“Nonnumerical” means not involving numbers or not expressed in numbers.","zh":"“nonnumerical”表示“非数值的；不涉及数字的；不能用数字表示的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving numbers; not expressed as a number (e.g., words, categories, or qualities instead of digits).","zh":"非数值的；不涉及数字的；不能用数字表示的（例如用文字、类别或性质来表达，而不是用数字）。"},"examples":[{"en":"The survey included both numerical scores and nonnumerical comments.","zh":"这份调查既包含数值评分，也包含非数值的文字评论。"},{"en":"We need nonnumerical evidence, such as eyewitness reports and photos.","zh":"我们需要非数值的证据，例如目击者证词和照片。"}]}],"synonyms":["nonquantitative","qualitative","non-numeric"],"phonetic":"/ˌnɑnˌnuˈmɛrɪkəl/","extraExplanation":["“nonnumerical”常见于学术写作与数据分析语境，意思是“不是用数字表示的”。与它意思很接近的词有“qualitative（定性的）”，但两者不完全相同：qualitative更强调“描述性质/特点”的方法或数据类型；nonnumerical更直观地强调“不是数字”。","拼写上也常见变体“non-numerical”（加连字符），尤其在较正式或排版讲究的文本中；两种写法含义相同。"]}
{"word":"nonnutrient","summary":{"en":"“Nonnutrient” describes something in food that has little or no nutritional value; it can also refer to such a substance itself.","zh":"“Nonnutrient”指食物中几乎不提供营养价值的成分；也可指这种非营养性物质本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A substance in food (or added to food) that provides little or no nutritional value (such as vitamins, minerals, protein, fat, or carbohydrates).","zh":"（食物中或添加到食物中的）几乎不提供营养价值的物质；通常不提供维生素、矿物质、蛋白质、脂肪或碳水化合物等营养。"},"examples":[{"en":"Some people try to reduce nonnutrient additives like artificial colors in their diet.","zh":"有些人会尽量减少饮食中的非营养性添加物，比如人工色素。"},{"en":"The label lists several nonnutrient sweeteners used to replace sugar.","zh":"标签上列出了几种用于替代糖的非营养性甜味剂。"}]},{"partOfSpeech":"n.","definition":{"en":"A nonnutrient substance (often an additive) in food.","zh":"非营养性物质（常指食物中的添加物）。"},"examples":[{"en":"The drink contains a nonnutrient that provides sweetness without calories.","zh":"这款饮料含有一种非营养性物质，可以提供甜味但几乎没有热量。"}]}],"synonyms":["non-nutritive","noncaloric (esp. for sweeteners)","additive (broader)","filler (context-dependent)"],"phonetic":"/ˌnɑnˈnuːtriənt/","extraExplanation":["“nonnutrient”常见于营养学/食品标签语境，尤其在讨论“nonnutritive sweeteners（非营养性甜味剂）”时更常用。日常口语里更常说“non-nutritive/artificial sweetener（非营养性/人工甜味剂）”或直接说“additive（添加剂）”。"]}
{"word":"nonnutriment","summary":{"en":"Nonnutriment means something that provides little or no nourishment; it’s a rare term, mostly replaced by more common phrases like “non-nutrient” or “nonnutritive substance.”","zh":"nonnutriment 指“非营养物/无营养成分”，即几乎不提供营养（或能量）的物质；该词较少见，常用说法是 non-nutrient 或 nonnutritive substance。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or part of food that provides little or no nourishment (no meaningful nutrients or energy) for the body","zh":"（食物中的）非营养物；指几乎不提供或不提供人体所需营养（或能量）的物质/成分"},"examples":[{"en":"Some people treat sugary drinks as a nonnutriment because they add calories but very few nutrients.","zh":"有些人把含糖饮料看作“非营养物”，因为它们增加热量却几乎不提供营养。"},{"en":"The label lists fiber separately; the writer calls it a nonnutriment in terms of energy, though it still supports digestion.","zh":"标签把膳食纤维单独列出；作者从“供能”的角度称它为“非营养物”，尽管它仍有助于消化。"}]},{"partOfSpeech":"n.","definition":{"en":"in biology (especially plant biology), material that does not serve as nutritive tissue (not used mainly for feeding or storing food)","zh":"（生物学，尤指植物学）非营养组织/非营养性物质；指不主要用于供养或储存养分的部分"},"examples":[{"en":"In the old classification, the tough outer layer was described as nonnutriment rather than food-storing tissue.","zh":"在较早的分类中，坚韧的外层被描述为“非营养组织”，而不是储存养分的组织。"}]}],"synonyms":["non-nutrient","nonnutritive substance","nutritionally empty substance","filler"],"phonetic":"/ˌnɑnˈnuːtrɪmənt/","extraExplanation":["这个词相对少见，更多见的是更常用的表达：non-nutrient（非营养成分）、nonnutritive substance（无营养物质）或 filler（填充物，语气可能更口语/带评价）。","构词很直观：non-（不、非）+ nutriment（营养/滋养物）。在食品与健康语境里，它常用于强调“缺乏营养价值”，但要注意：有些“几乎不供能”的成分（如膳食纤维）仍可能对健康有益，所以用词时最好说明你指的是“营养素/供能”还是“健康作用”。"]}
{"word":"nonnutritious","summary":{"en":"Nonnutritious means “not nourishing; low in nutrients,” especially describing food or drinks.","zh":"nonnutritious 指“缺乏营养的、不滋养的”，常用来形容食物或饮料营养素很少。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of food or drink) providing little or no nutrition; not nourishing.","zh":"（指食物或饮料）几乎不提供营养的；不滋养的。"},"examples":[{"en":"Sugary soda is often described as nonnutritious because it has calories but few vitamins or minerals.","zh":"含糖汽水常被说成是 nonnutritious（缺乏营养），因为它有热量，但几乎没有维生素或矿物质。"},{"en":"He tried to cut down on nonnutritious snacks and eat more fruit and yogurt.","zh":"他尽量少吃缺乏营养的零食，多吃水果和酸奶。"}]}],"synonyms":["nutrient-poor","not nutritious","low-nutrient","unwholesome"],"phonetic":"/ˌnɑnnuˈtrɪʃəs/","extraExplanation":["“nonnutritious”= non-（不、非）+ nutritious（有营养的）。意思是“缺乏营养价值”，不等于“没热量”：像含糖饮料、薯片等可能热量很高，但维生素、矿物质、蛋白质等营养素很少。","更常见、语气更自然的表达包括：“low in nutrients”（营养素含量低）、“not very nutritious”（不太有营养）、“junk food”（垃圾食品，偏口语/评价更强）。在正式写作中也常用“nutrient-poor”（营养素贫乏的）。"]}
{"word":"nonnutritiously","summary":{"en":"“Nonnutritiously” means “in a way that provides little or no nutrition.”","zh":"“nonnutritiously”表示“以缺乏营养的方式（吃/饮食）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that provides little or no nutrition (few essential nutrients), even if it has calories.","zh":"以（几乎）不提供营养的方式；缺乏必需营养素地（即使可能有热量）。"},"examples":[{"en":"If you snack nonnutritiously all afternoon, you may still feel hungry at dinner.","zh":"如果你整个下午都在吃些不怎么有营养的零食，晚饭时你可能还是会觉得饿。"},{"en":"The kids were eating nonnutritiously—chips and soda instead of fruit and milk.","zh":"孩子们吃得很不健康——薯片和汽水，而不是水果和牛奶。"}]}],"synonyms":["unhealthfully","poorly (in terms of diet)","in a less nutritious way"],"phonetic":"/ˌnɑn.nuˈtrɪʃ.əs.li/","extraExplanation":["“nonnutritiously”由 non-（否定前缀）+ nutritious（有营养的）+ -ly（副词后缀）构成，字面意思是“以非营养的方式”。日常英语里更常用的表达是 “in an unhealthful way / in a less nutritious way / eating junk food”。","它通常用来描述饮食选择或吃东西的方式，而不是单个食物本身（描述食物更常用 “not very nutritious” 或 “low in nutrients”）。"]}
{"word":"nonnutritiousness","summary":{"en":"“Nonnutritiousness” means the state of having little or no nutritional value.","zh":"“nonnutritiousness”表示“几乎没有营养价值的状态/性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not providing nutrition; lack of nutritional value","zh":"缺乏营养（价值）的性质或状态；无营养性"},"examples":[{"en":"The doctor warned about the nonnutritiousness of most sugary drinks.","zh":"医生警告说，大多数含糖饮料几乎没有营养。"},{"en":"Critics pointed to the nonnutritiousness of the snack and its high salt content.","zh":"批评者指出这种零食营养价值低，而且含盐量高。"}]}],"synonyms":["lack of nutritional value","low nutritional value","nutritional inadequacy","nutritional deficiency (context-dependent)"],"phonetic":"/ˌnɑnnuˈtrɪʃəsnəs/","extraExplanation":["这个词比较少见，更多时候人们会用更自然的表达，比如：“low nutritional value（营养价值低）”、“nutritionally poor（营养很差）”、“lacking in nutrients（缺乏营养）”。","构词法：non-（否定前缀）+ nutritious（有营养的）+ -ness（名词后缀，表示“……的性质/状态”）。意思很直观，但因为太“书面/造词感强”，在日常英语里不常用。"]}
{"word":"nonnutritive","summary":{"en":"“Nonnutritive” means not providing nutrition or nourishment, often used in nutrition or medical contexts.","zh":"“nonnutritive”指“非营养性的、几乎不提供营养价值的”，常用于营养学或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not providing nourishment or nutrition; having little or no nutritional value.","zh":"非营养性的；不提供（或几乎不提供）营养价值的。"},"examples":[{"en":"Some sweeteners are nonnutritive, meaning they add sweetness without calories.","zh":"有些甜味剂是非营养性的，也就是说只增加甜味而不提供热量。"},{"en":"Doctors may describe certain sucking behaviors (like using a pacifier) as nonnutritive sucking.","zh":"医生可能会把某些吸吮行为（如使用安抚奶嘴）称为“非营养性吸吮”。"}]}],"synonyms":["non-nutritive","noncaloric (in the sweetener sense)","nutritionally void","non-nourishing"],"phonetic":"/ˌnɑn.nuˈtrɪ.tɪv/","extraExplanation":["“nonnutritive”常见于医学、营养学与婴儿护理语境。比如“nonnutritive sweetener（非营养性甜味剂）”指提供甜味但几乎不提供能量或营养的甜味剂；“nonnutritive sucking（非营养性吸吮）”指婴儿为安抚而吸吮，而不是为了进食。","构词上是 non-（不、非）+ nutritive（有营养的）。更日常的表达常用 “not nutritious（没什么营养）/ has no nutritional value（没有营养价值）”。"]}
{"word":"nonnutritively","summary":{"en":"“Nonnutritively” means “in a way that provides no nutrition.”","zh":"“nonnutritively”表示“以不提供营养的方式；非营养性地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not provide nutrition (no useful nutrients or energy for the body).","zh":"以不提供营养（不给身体提供有用营养或能量）的方式；非营养性地。"},"examples":[{"en":"Some products are sweetened nonnutritively, so they add little or no calories.","zh":"有些产品以非营养性方式增甜，因此几乎不增加热量或不增加热量。"},{"en":"The additive affects flavor nonnutritively—it changes taste but doesn’t nourish the body.","zh":"这种添加剂以非营养性方式影响风味——它改变味道，但并不滋养身体。"}]}],"synonyms":["non-nutritively","without nutritional value","without providing nutrition","noncalorically (context-dependent)"],"phonetic":"/ˌnɑn.nuˈtrɪ.tɪv.li/","extraExplanation":["“nonnutritively”在日常英语里很少见，更常见的写法是 **non-nutritively**（带连字符）或改用更自然的表达，如 **without providing nutrition / without nutritional value**。","它常出现在营养学、食品科学或产品说明语境中，用来强调“带来口感/甜味/体积等效果，但不提供营养或能量”。在不同国家法规里，“non-nutritive”有时会与“低/零热量甜味剂”等概念一起出现，但具体定义取决于法规文本。","注意不要和 **nutritiously**（有营养地）混淆；也不要误解为“有害”，它只强调“没有营养供给”，不必然表示不安全。"]}
{"word":"nonnutritiveness","summary":{"en":"Nonnutritiveness means “lack of nutritional value” — the state of not providing nourishment.","zh":"nonnutritiveness 指“缺乏营养价值/无营养性”，即不能提供营养的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not providing nutrition or nourishment; lack of nutritional value","zh":"（食物、物质等）缺乏营养（价值）的性质；无营养性"},"examples":[{"en":"The doctor warned about the nonnutritiveness of sugary drinks, which add calories but few nutrients.","zh":"医生提醒含糖饮料的无营养性：它们增加热量，却几乎不提供营养。"},{"en":"Many processed snacks are criticized for their nonnutritiveness compared with fresh foods.","zh":"与新鲜食物相比，许多加工零食因其无营养性而受到批评。"}]}],"synonyms":["lack of nutritional value","nutritional emptiness","nutrient-poorness"],"phonetic":"/ˌnɑn.nuˈtrɪtɪv.nəs/","extraExplanation":["“Nonnutritiveness”由 non-（不、非）+ nutritive（有营养的）+ -ness（名词后缀，表示“性质/状态”）组成，意思就是“缺乏营养的状态”。","这个词在日常口语里不算常见，更常用的表达有：lack of nutritional value（缺乏营养价值）、not nutritious（不营养）、nutritionally empty（营养空洞的）。","注意区分：nonnutritive / nonnutritious（形容词：无营养的） vs. nonnutritiveness（名词：无营养性）。"]}
{"word":"nonny","summary":{"en":"“Nonny” is mostly an old, playful nonsense syllable used in song refrains (like “hey nonny nonny”); more rarely, it can mean a silly person.","zh":"“nonny”多指古英语歌曲副歌里的逗趣无意义衬词（如“hey nonny nonny”）；较少见时也可指“傻瓜”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(archaic) A meaningless or playful syllable used in songs, especially in the refrain “hey nonny nonny.”","zh":"（古语）歌曲里用作衬词/无实际意义的拟声或逗趣音节，常见于副歌“hey nonny nonny”。"},"examples":[{"en":"The chorus ends with “hey nonny nonny,” which is just a playful sing-song sound.","zh":"副歌以“hey nonny nonny”收尾，那只是逗趣的唱腔衬词。"},{"en":"In some old English ballads, “nonny” appears as nonsense filler to keep the rhythm.","zh":"在一些古老的英格兰民谣里，“nonny”会作为无意义的填充音节来保持节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal, chiefly British) A silly or foolish person; a simpleton.","zh":"（罕见，非正式，主要英式）傻瓜；糊涂的人。"},"examples":[{"en":"Don’t be a nonny—read the instructions first.","zh":"别犯傻——先把说明书读一遍。"},{"en":"He called himself a nonny for forgetting the meeting time.","zh":"他因为忘了开会时间而自嘲是个傻瓜。"}]}],"synonyms":["nonsense refrain","tra-la (as a refrain)","simpleton (rare sense)","fool (rare sense)"],"phonetic":"/ˈnɑni/","extraExplanation":["“hey nonny nonny”在英文里很有“伊丽莎白时代/莎士比亚戏剧歌曲”的气氛：它更像中文歌里为了押韵和节奏加入的“啦啦啦/哎呀呀”一类衬词，而不是需要逐字理解的词。","如果你在现代英语里单独看到nonny，最常见的用法仍然是引用这种复古副歌；把nonny当作“傻瓜”的用法比较少见，语气也偏戏谑。"]}

