{"word":"nonobedience","summary":{"en":"Nonobedience means not obeying an order, rule, or authority; disobedience.","zh":"nonobedience 指不服从命令、规则或权威；即“不遵从/不听从”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Failure or refusal to obey a rule, law, order, or authority; disobedience.","zh":"不服从；不遵守（规则、法律、命令或权威）；不听从。"},"examples":[{"en":"The teacher warned that nonobedience of classroom rules would lead to detention.","zh":"老师警告说，不遵守课堂规则将会被留校。"},{"en":"Repeated nonobedience to safety instructions can put everyone at risk.","zh":"反复不遵守安全指示会让所有人处于危险之中。"}]}],"synonyms":["disobedience","defiance","insubordination","noncompliance"],"phonetic":"/ˌnɑːnoʊˈbiːdiəns/","extraExplanation":["“nonobedience”由前缀 non-（不、非）+ obedience（服从）构成，但在现代英语里更常见、更自然的说法是“disobedience”。“nonobedience”听起来更正式、偏书面，有时用于法律、规章制度或组织纪律等语境。","如果你想表达带有道德/政治立场的“以公开、非暴力方式违反法律来抗议”的概念，更常用“civil disobedience（公民不服从）”，而不是单用“nonobedience”。"]}
{"word":"nonobedient","summary":{"en":"Nonobedient means “not obedient; not following rules or instructions.” It’s uncommon; disobedient is more usual.","zh":"nonobedient 意为“不服从的；不听从指示的”。这个词较少见，更常用的是 disobedient。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not obedient; refusing or failing to follow rules, instructions, or authority.","zh":"不服从的；不听话的；不遵守规则或命令的。"},"examples":[{"en":"The teacher spoke calmly to the nonobedient student and explained the rule again.","zh":"老师冷静地和那位不服从的学生谈话，并再次解释了规则。"},{"en":"The report described repeated nonobedient behavior during safety drills.","zh":"报告描述了在安全演练中反复出现的不服从行为。"}]}],"synonyms":["disobedient","unobedient","noncompliant","defiant","rebellious"],"phonetic":"/ˌnɑn.oʊˈbiː.di.ənt/","extraExplanation":["“nonobedient”在现代英语中不太常见；更自然、更常用的说法通常是“disobedient”。在正式或法律/规章语境里，你也可能见到“non-obedient”（带连字符）这一写法，用来强调“并非服从”的性质。","如果你想表达“拒绝服从/反抗权威”的语气更强，可以考虑“defiant（挑衅/公然反抗的）”；如果只是“没有遵守规定”，用“noncompliant（不合规的）”在医疗、工作场所、政策文件里更常见。"]}
{"word":"nonobediently","summary":{"en":"“Nonobediently” means “in a disobedient way,” but it’s uncommon; “disobediently” is more natural.","zh":"“nonobediently”表示“以不服从的方式”，但不常用；更自然的是“disobediently”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not obedient; in a disobedient manner.","zh":"以不服从的方式；不顺从地；不听话地。"},"examples":[{"en":"The child stared nonobediently and refused to put the phone away.","zh":"孩子不顺从地盯着看，拒绝把手机收起来。"},{"en":"Some employees acted nonobediently toward the new safety rules.","zh":"有些员工对新的安全规定表现得不服从。"}]}],"synonyms":["disobediently","defiantly","rebelliously","insubordinately"],"phonetic":"/ˌnɑːnəˈbiːdiəntli/","extraExplanation":["“nonobediently”在现代英语里不算常见，更常用、更自然的说法是 **disobediently**（不服从地）或用更具体的表达：**refused to… / ignored… / would not…**。","构词上：non-（不）+ obedient（服从的）+ -ly（副词后缀）。如果你在写作里用它，读者一般能理解，但可能觉得有点“生硬/学术化”。"]}
{"word":"nonobese","summary":{"en":"Nonobese means “not obese,” usually in medical or research writing.","zh":"nonobese 意为“非肥胖的”，多用于医学或研究写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not obese; having a body size or body-fat level that is not in the obese range (often used in medical or research contexts).","zh":"非肥胖的；不属于肥胖范围的（常用于医学或研究语境，指体型或体脂水平不在肥胖区间）。"},"examples":[{"en":"The study compared nonobese adults with adults who had obesity.","zh":"这项研究比较了非肥胖成年人和肥胖成年人。"},{"en":"Nonobese patients can still have health risks, so doctors look at more than weight.","zh":"非肥胖人群也可能有健康风险，所以医生看的不只是体重。"}]}],"synonyms":["not obese","non-obese","not having obesity"],"phonetic":"/ˌnɑn oʊˈbis/","extraExplanation":["“non-”是常见前缀，表示“非/不”，所以 nonobese 就是“非肥胖的”。这个词在日常口语里不算常见，更常见的说法是 “not obese” 或 “non-obese”（带连字符的写法也很常见）。","在医学研究中，obese/obesity 往往与 BMI（体重指数）分级相关，但不同研究或机构的定义可能不同；因此 nonobese 常用于“排除肥胖组”的分类标签，而不一定等同于“健康”或“瘦”。"]}
{"word":"nonobjectification","summary":{"en":"Nonobjectification means not treating a person as an object, but respecting their full humanity and agency.","zh":"Nonobjectification（非物化）指不把人当作“物/工具/视觉对象”，而是尊重其完整的人性与自主性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The idea or practice of not treating someone as an object (especially not reducing a person to their body, appearance, or usefulness), but recognizing their full humanity and agency.","zh":"（非物化）指不把某人当作“物”来对待（尤其是不把人简化为身体、外貌或用途），而是承认其完整的人性与自主性。"},"examples":[{"en":"The campaign emphasizes nonobjectification by focusing on people’s skills and voices rather than their looks.","zh":"这项倡议强调“非物化”，把重点放在人的能力与声音上，而不是外貌。"},{"en":"In class discussions, we practiced nonobjectification by asking what the character wants and chooses, not just what happens to them.","zh":"在课堂讨论中，我们通过关注角色的意愿与选择来练习“非物化”，而不只是关注他们遭遇了什么。"}]}],"synonyms":["respect for personhood","humanization","dignity","recognition of agency"],"phonetic":"ˌnɑn əbˌdʒɛk.tə.fɪˈkeɪ.ʃən","extraExplanation":["这个词在日常英语里不算常见，更常见的写法是 **non-objectification**（带连字符），多见于女性主义、媒体研究、伦理学与心理学等语境。","与 **objectification（物化）** 相对：objectification 常指把人当成“工具/商品/视觉对象”；nonobjectification 强调尊重与主体性（agency），例如征得同意、避免只用外貌评价、让当事人有发声与选择权。","写作建议：如果用于正式论文或报道，优先用 **non-objectification**，并在首次出现时简要说明你所指的含义，以避免读者误解。"]}
{"word":"nonobjection","summary":{"en":"Nonobjection means not opposing something; in formal contexts it can mean an official statement that there is no objection.","zh":"nonobjection 指“不反对/无异议”；在正式语境中也可指“无异议的（官方）声明或函件”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of not objecting; a statement or attitude that you do not oppose something","zh":"不反对；无异议（表示你不反对某事的态度或声明）"},"examples":[{"en":"The proposal moved forward after the committee expressed nonobjection.","zh":"委员会表示无异议后，该提案得以继续推进。"},{"en":"She nodded in nonobjection, meaning she was fine with the plan.","zh":"她点头表示不反对，意思是她接受这个计划。"}]},{"partOfSpeech":"n.","definition":{"en":"in formal or legal contexts, written confirmation that someone has no objection (similar to “no objection”)","zh":"（正式/法律语境）无异议的书面确认（类似“no objection/无异议”声明）"},"examples":[{"en":"The agency issued a letter of nonobjection for the project.","zh":"该机构为该项目出具了无异议函。"}]}],"synonyms":["no objection","lack of objection","no opposition","acquiescence","consent"],"phonetic":"/ˌnɑːnəbˈdʒɛkʃən/","extraExplanation":["“nonobjection”较偏正式，日常英语更常说 “no objection” 或 “no opposition”。例如：\"I have no objection.\"（我没有异议。）","在政府、合规、合同或法律文件里，常见搭配有 “letter of nonobjection / non-objection letter / no-objection letter”，中文常译为“无异议函/不反对函”。不同机构可能偏好不同写法（连字符有时会出现）。"]}
{"word":"nonobjective","summary":{"en":"Nonobjective means not objective; in art, it often means abstract (not showing recognizable objects).","zh":"nonobjective意为“非客观的”；在艺术中常指“非具象/抽象的（不描绘可辨认的物体）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not based on an objective reality (facts, measurable things, or clearly identifiable objects); not aiming to show things exactly as they are.","zh":"非客观的；不以客观事实或可衡量的现实为依据的；不以如实呈现事物为目的的。"},"examples":[{"en":"The report was criticized for being nonobjective and overly emotional.","zh":"这份报告因缺乏客观性、过于情绪化而受到批评。"},{"en":"Try to avoid nonobjective language when you write an academic essay.","zh":"写学术论文时尽量避免使用不够客观的措辞。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Art) Not representing recognizable objects; abstract.","zh":"（艺术）非具象的；不描绘可辨认物体的；抽象的。"},"examples":[{"en":"She prefers nonobjective painting with bold colors and simple shapes.","zh":"她更喜欢色彩大胆、形状简化的非具象绘画。"},{"en":"The gallery’s new exhibition focuses on nonobjective art from the 1950s.","zh":"画廊的新展览聚焦于20世纪50年代的非具象艺术。"}]}],"synonyms":["subjective","biased","partial","abstract","nonrepresentational","nonfigurative"],"phonetic":"/ˌnɑnəbˈdʒɛktɪv/","extraExplanation":["“nonobjective”常见于艺术语境，尤其指“非具象/抽象”的绘画或雕塑：作品不试图画出可辨认的现实物体（如人、树、房子），而强调色彩、线条、形状、结构与情绪效果。","在写作与讨论中，nonobjective通常带有“缺乏客观依据”的含义，接近“带偏见/主观化”。注意它和“subjective（主观的）”很接近，但nonobjective更强调“不是以客观事实为基础”，不一定等同于“表达个人感受”。"]}
{"word":"nonobjectivism","summary":{"en":"Nonobjectivism usually means (1) abstract/non-representational painting, or (2) a philosophical view rejecting objectivism, often in ethics (moral truths depend on human perspectives).","zh":"nonobjectivism 通常指（1）抽象／非具象繪畫的理念或實作；或（2）哲學上反對客觀主義的立場，倫理學中常指道德真理在某種程度上依賴人的觀點。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(art) The theory or practice of making nonobjective (abstract, non-representational) painting—art that does not try to depict real-world objects.","zh":"（藝術）非客觀繪畫（抽象、非再現藝術）的理論或實踐：作品不以描繪現實世界中的具體物體為目的。"},"examples":[{"en":"The gallery’s new show explores nonobjectivism through bold color fields and geometric shapes.","zh":"畫廊的新展覽以大色塊與幾何形狀來呈現非客觀主義（抽象藝術取向）。"},{"en":"She studied nonobjectivism to better understand why some paintings avoid recognizable subjects.","zh":"她研究非客觀主義，是為了更理解為何有些畫作刻意避開可辨識的主題。"}]},{"partOfSpeech":"n.","definition":{"en":"(philosophy, broad) Any view that rejects objectivism—i.e., the idea that certain truths (often about value, meaning, or morality) are independent of human minds, attitudes, or perspectives.","zh":"（哲學，廣義）任何反對「客觀主義」的立場：否認某些真理（常指價值、意義或道德）完全獨立於人的心智、態度或觀點而存在。"},"examples":[{"en":"In ethics, nonobjectivism says moral claims depend in some way on human attitudes or social practices.","zh":"在倫理學中，非客觀主義認為道德主張在某種程度上依賴人的態度或社會實作。"},{"en":"His nonobjectivism led him to treat ‘right’ and ‘wrong’ as partly shaped by culture.","zh":"他的非客觀主義使他把「對」與「錯」視為部分由文化塑造。"}]}],"synonyms":["non-objectivism","anti-objectivism","subjectivism (related)","abstract art (related)","nonrepresentational art (related)"],"phonetic":"/ˌnɑnəbˈdʒɛk.tɪˌvɪzəm/","extraExplanation":["這個詞在英語中常見兩種用法：一是在藝術領域，指「非具象／抽象」繪畫的理念或實作；二是在哲學領域，指反對某種「客觀真理完全獨立於人」的立場（尤其常出現在倫理學的「道德非客觀主義」討論）。","拼寫上可見 nonobjectivism 或 non-objectivism（加連字號）。語境不同，含義也可能不同；若你是想問道德哲學，常見相關詞還有 moral anti-realism、subjectivism、noncognitivism 等，但它們彼此不完全等同。"]}
{"word":"nonobjectivist","summary":{"en":"Nonobjectivist means a person (or idea) that rejects strict objectivism—often in ethics or art; it can also mean an abstract (non-representational) artist.","zh":"nonobjectivist 指「非客觀主義者／非客觀主義的」：常用於哲學（尤其道德）表示不認為某些主張有獨立客觀真理；在藝術上也可指非具象（抽象）藝術家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(philosophy) A person who supports non-objectivism—the view that certain claims (often moral or aesthetic) are not objectively true or false independent of human attitudes or perspectives.","zh":"（哲學）非客觀主義者：支持「非客觀主義」的人；認為某些主張（常見於道德或美學）不具有獨立於人類態度或觀點之外的客觀真偽。"},"examples":[{"en":"Some meta-ethicists are nonobjectivists about morality, arguing that moral truth depends on human perspectives.","zh":"一些元倫理學者在道德問題上是非客觀主義者，主張道德真理取決於人類的觀點。"},{"en":"As a nonobjectivist, she thinks ‘good’ and ‘bad’ are rooted in values rather than facts.","zh":"作為非客觀主義者，她認為「好」與「壞」根植於價值，而非事實。"}]},{"partOfSpeech":"n.","definition":{"en":"(art) An abstract (non-representational) artist or painter; someone whose art is not aimed at depicting objects realistically.","zh":"（藝術）抽象藝術家／非具象畫家：創作不以寫實再現具體物體為目的的人。"},"examples":[{"en":"In the 1950s he gained attention as a nonobjectivist painter known for bold color fields.","zh":"在 1950 年代，他以非具象畫家之姿受到關注，以大膽的色塊著稱。"},{"en":"The gallery’s new show features nonobjectivists working in paint and mixed media.","zh":"畫廊的新展覽展出以繪畫與複合媒材創作的非具象藝術家。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not objectivist; relating to or characterized by non-objectivism.","zh":"非客觀主義的；不屬於客觀主義的；具有非客觀主義特徵的。"},"examples":[{"en":"They offered a nonobjectivist account of moral disagreement.","zh":"他們提出一種對道德分歧的非客觀主義解釋。"},{"en":"Her argument takes a nonobjectivist approach to aesthetic judgment.","zh":"她的論證以非客觀主義的方式看待美學判斷。"}]}],"synonyms":["anti-realist","subjectivist (in some contexts)","non-realist","expressivist (related, not identical)","abstract artist (art sense)"],"phonetic":"/ˌnɑnəbˈdʒɛktɪvɪst/","extraExplanation":["這個字通常寫作 nonobjectivist，也常見加連字號 non-objectivist。","在哲學語境裡，nonobjectivist 常和道德「非客觀主義／反實在論」相關，但它不一定等同於 noncognitivist（非認知主義）：非客觀主義者可以主張「真偽依賴態度」（仍可能有真偽），也可以主張「沒有真值」。","要注意 Objectivism 也可能指安·蘭德（Ayn Rand）的「客觀主義」；在一般英文裡 nonobjectivist 多半是廣義的「不採客觀主義立場」，不一定專指反對蘭德學派。"]}
{"word":"nonobjectivistic","summary":{"en":"Nonobjectivistic means “not based on objectivism or objective standards,” and it can also describe nonrepresentational (nonobjective) art.","zh":"nonobjectivistic 指“不以客观主义/客观标准为基础的”；在艺术语境中也可指“非具象（nonobjective）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not objectivistic; not based on the idea that truth, value, or knowledge is grounded in objective facts or standards independent of a person’s feelings or perspective.","zh":"非客观主义的；不以独立于个人感受或立场的客观事实/标准作为真理、价值或知识基础的。"},"examples":[{"en":"Her interpretation is intentionally nonobjectivistic, highlighting how culture shapes what we call “truth.”","zh":"她的解读刻意采用非客观主义立场，强调文化如何塑造我们称之为“真理”的东西。"},{"en":"Some meta-ethical views are described as nonobjectivistic because they deny objective moral facts.","zh":"有些元伦理学观点被称为非客观主义的，因为它们否认客观的道德事实。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Art/literary use) Not depicting recognizable real-world objects; nonrepresentational; similar to “nonobjective.”","zh":"（艺术/文学用法）不描绘可辨识的现实物体的；非具象的；近似 nonobjective。"},"examples":[{"en":"The gallery showed nonobjectivistic canvases focused on color and shape rather than people or landscapes.","zh":"画廊展出了非具象的画作，重点在色彩与形状，而不是人物或风景。"}]}],"synonyms":["non-objectivist","anti-objectivist","subjectivist","relativistic","nonobjective (art)"],"phonetic":"/ˌnɑn.əbˌdʒek.təˈvɪs.tɪk/","extraExplanation":["这个词在日常英语里很少见，更常见的是 **nonobjective**（尤指“非具象艺术”）或 **non-objectivist / anti-objectivist**（哲学讨论里更常用）。","构词上是 *non-*（否定）+ *objectivistic*（客观主义的/客观论的）。注意它不一定指“客观”这个普通形容词（objective），而是更像在讨论一种“客观主义立场”（objectivism/objectivist）。","语境上可能会引起歧义：**Objectivism** 既可能泛指“客观主义/客观论”，也可能被理解为艾茵·兰德（Ayn Rand）的哲学体系（专名）。写作时若担心误解，可明确说明：*objectivism in epistemology/ethics* 或 *Rand’s Objectivism*。"]}
{"word":"nonobjectivity","summary":{"en":"Nonobjectivity means a lack of objectivity—being unfair or not neutral, often due to bias or personal opinion.","zh":"nonobjectivity 指“缺乏客观性”，即不公正或不中立，常由偏见或个人观点导致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being objective; lack of fairness or neutrality (often because of personal feelings, opinions, or interests).","zh":"缺乏客观性；不公正或不中立的状态（常因个人情感、观点或利益而产生）。"},"examples":[{"en":"The researcher tried to reduce nonobjectivity by using a double-blind method.","zh":"研究者试图通过双盲方法来减少不客观性。"},{"en":"Critics pointed out the nonobjectivity of the article because it relied on only one source.","zh":"批评者指出这篇文章不够客观，因为它只依赖单一来源。"},{"en":"Nonobjectivity can affect decisions when a manager favors friends on the team.","zh":"当经理偏袒团队里的朋友时，不客观性会影响决策。"}]}],"synonyms":["bias","lack of objectivity","subjectivity","partiality","prejudice"],"phonetic":"/ˌnɑnˌɑbdʒɛkˈtɪvəti/","extraExplanation":["“nonobjectivity”在日常英语里不算常见，更常见的表达是“lack of objectivity（缺乏客观性）”“bias（偏见/偏向）”“subjectivity（主观性）”。写作中也常见带连字符的形式“non-objectivity”。","语体上偏正式/学术写作：常用于研究方法、新闻伦理、法庭证词、评估与评分等场景，强调“因为立场或利益导致无法中立”。","搭配建议：reduce/minimize nonobjectivity（减少不客观性）；risk of nonobjectivity（不客观的风险）；concerns about nonobjectivity（对不客观的担忧）。"]}
{"word":"nonobligated","summary":{"en":"“Nonobligated” means not required—someone has no duty or obligation to do something.","zh":"“nonobligated”表示“没有义务/不必做某事”，强调不受职责、规则或协议要求。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not required by duty, law, rule, or agreement; having no obligation to do something.","zh":"不被要求的；无义务的；不受（法律/规则/协议）约束必须去做的。"},"examples":[{"en":"You are nonobligated to respond to that email immediately.","zh":"你没有义务立刻回复那封邮件。"},{"en":"Guests are nonobligated to bring a gift, but they often do.","zh":"客人不必带礼物，但他们常常会带。"}]}],"synonyms":["not obligated","not required","under no obligation","optional","voluntary"],"phonetic":"/ˌnɑnˈɑb.ləˌɡeɪ.tɪd/","extraExplanation":["“nonobligated”在日常英语里相对少见，更常见的表达是“not obligated / under no obligation / not required”。在法律、合规、合同或正式通知中更可能看到“nonobligated”，用来明确“没有义务”。","构词上是 non-（否定前缀，“不”）+ obligated（有义务的）。它通常描述“人/机构在某件事上没有义务”，常与不定式连用：be nonobligated to do something。"]}
{"word":"nonobligatorily","summary":{"en":"“Nonobligatorily” means “optionally; not required.”","zh":"“nonobligatorily”意思是“可选择地；非强制地；不必做也可以”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not required; optionally; without obligation.","zh":"以非强制的方式；可选择地；不必承担义务地。"},"examples":[{"en":"You can nonobligatorily attend the workshop if you have time.","zh":"如果你有时间，你可以选择性地参加这个工作坊。"},{"en":"The survey is nonobligatorily available to all students.","zh":"这份问卷对所有学生开放，填写与否不作强制要求。"}]}],"synonyms":["optionally","voluntarily","not necessarily","not required"],"phonetic":"ˌnɑnəˈblɪɡətɔrəli","extraExplanation":["“nonobligatorily”是由 non-（不、非）+ obligatorily（强制地、必须地）构成的副词，意思清楚，但在日常英语里非常少见、听起来偏正式或偏法律/规章文本。更自然的表达常用：“optionally / voluntarily / not required / you don’t have to”。","用法提醒：在学校通知、公司政策、合同条款中偶尔会看到这类词，用来强调“可以做，但不构成义务”。口语里通常不会说“nonobligatorily”；会说“it’s optional”或“you’re not required to”。"]}
{"word":"nonobligatory","summary":{"en":"Nonobligatory means not required; optional.","zh":"Nonobligatory 指“非强制性的、不必做的；可选择的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not required by rules, law, duty, or necessity; optional.","zh":"非强制性的；不必做的；可选择的。"},"examples":[{"en":"Attendance at the orientation is nonobligatory, but it’s helpful for new students.","zh":"迎新说明会的出席是非强制性的，但对新生很有帮助。"},{"en":"Tips are nonobligatory, though many customers still leave one.","zh":"小费不是强制的，不过很多顾客还是会留。"}]}],"synonyms":["optional","voluntary","not required","nonmandatory"],"phonetic":"/ˌnɑnəˈblɪɡəˌtɔri/","extraExplanation":["这个词由前缀 non-（“不、非”）+ obligatory（“有义务的、必须的”）构成，意思就是“不是必须的”。在正式通知、规则说明、合同条款里很常见，用来表示“可做可不做”。","语气上比 optional 更正式、更“制度化”。optional 常见于日常选择（选修课、功能选项）；nonobligatory 更强调“没有义务/不构成责任”。"]}
{"word":"nonobscurities","summary":{"en":"Nonobscurities means “clear, not obscure things/points,” but it’s a rare word; everyday English usually uses simpler phrases like “clear points.”","zh":"nonobscurities 指“清楚、不晦涩的事物/要点”，但很少见；日常英语更常用 clear points 等更自然的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that are not obscure; clear or easily understood points (plural noun, rare).","zh":"不晦涩的事物；清楚、容易理解的要点（复数名词，用法较少见）。"},"examples":[{"en":"The author mixes a few difficult passages with many nonobscurities that most readers can follow.","zh":"作者把少量难懂的段落和许多大多数读者都能理解的非晦涩之处混在一起。"},{"en":"In the lecture, she began with the nonobscurities before moving to more technical ideas.","zh":"在讲座中，她先从清晰易懂的部分讲起，然后再进入更技术性的观点。"}]}],"synonyms":["clear points","straightforward parts","obvious things","clarities"],"phonetic":"/ˌnɑnəbˈskjʊrɪtiz/","extraExplanation":["这个词非常少见，通常是由前缀 non-（“非、不”）+ obscurities（“晦涩之处/难懂之处”）构成，用来强调“不是晦涩的部分”。在日常英语里，人们更常说 clear points / straightforward parts / obvious things。","写作或评论里用 nonobscurities 往往带一点修辞效果：先承认有些内容晦涩，再强调也存在“清楚明白”的部分。"]}
{"word":"nonobscurity","summary":{"en":"Nonobscurity means the opposite of obscurity: being known, visible, or no longer unknown.","zh":"nonobscurity 指“obscurity（默默无闻/晦涩）”的反面：变得为人所知、更显眼或不再无名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being obscure; being known, visible, or easy to notice (i.e., the opposite of obscurity).","zh":"不再默默无闻的状态；不隐晦、变得为人所知或更显眼（即“obscurity”的反义概念）。"},"examples":[{"en":"After the documentary, the artist moved from obscurity to nonobscurity almost overnight.","zh":"纪录片播出后，这位艺术家几乎一夜之间从默默无闻变得不再无名。"},{"en":"The book’s nonobscurity came from word of mouth rather than advertising.","zh":"这本书之所以不再冷门，是靠口口相传而不是广告宣传。"}]}],"synonyms":["prominence","visibility","recognition","fame","publicity"],"phonetic":"/ˌnɑnəbˈskjʊrəti/","extraExplanation":["“nonobscurity”是由前缀 non-（不、非）+ obscurity（默默无闻/晦涩/隐蔽）构成的“临时造词/构词式表达”，在日常英语里不算常见，更多见于较正式或带一点写作风格的语境。","更自然、更常用的替代表达通常是：prominence（显赫/知名）、visibility（可见度/曝光度）、recognition（认可/知名度）、notoriety（臭名昭著，偏负面）或直接说 “no longer in obscurity / out of obscurity”。"]}
{"word":"nonobservable","summary":{"en":"Nonobservable means “not directly observable or detectable; known only indirectly.”","zh":"nonobservable 表示“无法直接观察或检测到；只能间接推知的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be seen, measured, or detected directly (often because something is theoretical, hidden, too small/large, or only inferred from effects).","zh":"不可直接观察到的；无法直接看见、测量或探测到的（常因过于理论化、被隐藏、尺度太大/太小，或只能通过影响来推断）。"},"examples":[{"en":"Dark matter is nonobservable directly, but scientists infer it from gravity’s effects.","zh":"暗物质无法被直接观测，但科学家会从引力效应来推断它的存在。"},{"en":"In this experiment, the cause is nonobservable, so we focus on the results we can measure.","zh":"在这个实验里，原因是不可直接观测的，所以我们专注于可测量的结果。"}]}],"synonyms":["unobservable","undetectable","imperceptible","invisible","not directly measurable"],"phonetic":"/ˌnɑnəbˈzɝːvəbəl/","extraExplanation":["“non-”是否定前缀，表示“非……、不……”。“observable”来自动词 observe（观察）。合在一起强调“不能直接观察/检测”，常见于科学写作（物理、心理学、统计学等），也可用于一般语境表示“看不见但可能存在/有影响”。","在学术语境中，nonobservable 往往暗示：需要通过“可观测指标（observable measures）”或“间接证据（indirect evidence）”来推断，例如用行为数据推断心理状态。","相近表达：unobservable（更常见、语气更中性）；hidden / undetectable（更口语或强调“检测不到/被隐藏”）。区别是 nonobservable 更像技术/学术用词。"]}
{"word":"nonobservably","summary":{"en":"Nonobservably means “in a way that cannot be observed or noticed,” often used in technical or careful writing.","zh":"nonobservably 指“以无法被观察到或注意到的方式”，常见于较严谨或技术性表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that cannot be observed or detected; without producing noticeable evidence.","zh":"以无法被观察到或检测到的方式；不产生明显证据地。"},"examples":[{"en":"The patient’s condition changed nonobservably over several hours, so the monitor was essential.","zh":"病人的状况在数小时内发生了难以察觉的变化，所以监护仪很关键。"},{"en":"The software can fail nonobservably, meaning it looks fine but silently stops recording data.","zh":"软件可能会“无明显迹象地”失效，也就是说看起来正常，但会悄悄停止记录数据。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not noticeable to other people; inconspicuously.","zh":"以他人不易注意到的方式；不显眼地。"},"examples":[{"en":"She moved nonobservably to the back of the room to avoid interrupting the meeting.","zh":"她悄无声息地挪到房间后面，避免打断会议。"}]}],"synonyms":["imperceptibly","undetectably","unnoticeably","inconspicuously","subtly"],"phonetic":"/ˌnɑnəbˈzɝvəbli/","extraExplanation":["这个词比较少见，结构很透明：non-（否定）+ observable（可观察的）+ -ly（副词）。常见替代表达包括：imperceptibly（难以察觉地）、undetectably（无法检测地）、unnoticeably（不易注意地）。","在学术或技术语境（医学、物理、计算机、统计）里更常用“undetectably / imperceptibly”，而“nonobservably”有时强调“从外部观察不到（但可能仍然发生）”的含义。"]}
{"word":"nonobservance","summary":{"en":"Nonobservance means not obeying or following rules, laws, or agreements; it can also mean not keeping or celebrating a tradition in formal contexts.","zh":"nonobservance 指“不遵守（规则、法律、协议等）”；在较正式或宗教语境中也可指“不遵行/不过（某个传统或节日）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"failure to obey or follow a rule, law, agreement, custom, or instruction","zh":"不遵守；不履行（法律、规则、协议、习俗或指示）"},"examples":[{"en":"The company was fined for nonobservance of safety regulations.","zh":"该公司因不遵守安全法规而被罚款。"},{"en":"Nonobservance of the contract terms may lead to legal action.","zh":"不履行合同条款可能会引发法律诉讼。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of not celebrating, keeping, or respecting an event, practice, or tradition (often in formal or religious contexts)","zh":"不举行；不遵行（某个节日、仪式、传统等，常用于正式或宗教语境）"},"examples":[{"en":"Their nonobservance of the holiday surprised their neighbors.","zh":"他们不过这个节日，让邻居很惊讶。"},{"en":"The community debated the nonobservance of certain rituals.","zh":"社区就是否不遵行某些仪式展开了讨论。"}]}],"synonyms":["noncompliance","failure to comply","disregard","neglect","violation"],"phonetic":"/ˌnɑn.əbˈzɝː.vəns/","extraExplanation":["词形拆解：non-（否定前缀，表示“不”）+ observance（遵守；奉行；庆祝）。所以 nonobservance 字面意思就是“没有遵守/没有奉行”。","语域与搭配：nonobservance 很正式，常见于法律、合同、规章制度等文本。常搭配：nonobservance of rules/law/regulations/requirements/terms。","与近义词区分：noncompliance 更常用于“合规/监管”语境；disobedience 更强调对权威命令的“不服从”；violation 常指“违反某条具体规定”的行为（语气更强、更像“违规/违章”）。"]}
{"word":"nonobservances","summary":{"en":"Nonobservances means failures or refusals to follow or carry out what is expected (rules, laws, customs, or religious practices).","zh":"Nonobservances 指对规则、法律、习俗或宗教仪式等“未遵守/未履行”的行为或情况（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of not doing something that is expected or required (such as not following a rule, law, custom, or religious practice); instances of failing to observe something","zh":"不遵守；不履行；（对规则、法律、习俗或宗教仪式等的）不遵行；不遵守的行为/情况"},"examples":[{"en":"Repeated nonobservances of the safety rules can lead to serious accidents.","zh":"反复不遵守安全规定可能导致严重事故。"},{"en":"The report noted several nonobservances of company policy.","zh":"报告指出有多起不遵守公司政策的情况。"}]}],"synonyms":["noncompliance","violation","breach","disregard","neglect"],"phonetic":"ˌnɑnəbˈzɝvəns","extraExplanation":["“nonobservance”的核心意思是“没有遵守/没有履行”。常见搭配有：nonobservance of rules/law/regulations（不遵守规则/法律/法规），nonobservance of a holiday（不庆祝某个节日/不举行相关纪念活动）。你输入的“nonobservances”是复数形式，表示多次或多种“不遵守”的情况。","注意与“observation（观察）”区分：这里的“observe”是“遵守/奉行/庆祝（节日）”，不是“观察”。因此 nonobservance 不是“没有观察到”，而是“没有遵守/没有庆祝”。"]}
{"word":"nonobservant","summary":{"en":"Nonobservant means not paying attention and not noticing details.","zh":"nonobservant 指不注意、不善观察、容易忽略细节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not noticing things; not paying attention to details around you.","zh":"不善观察的；不注意周围细节的；粗心大意的。"},"examples":[{"en":"He’s so nonobservant that he didn’t notice she had dyed her hair.","zh":"他太不善观察了，连她染了头发都没注意到。"},{"en":"If you’re nonobservant, you may miss small warning signs.","zh":"如果你不够细心，可能会错过一些小小的警示信号。"}]}],"synonyms":["inattentive","unobservant","careless","absentminded"],"phonetic":"/ˌnɑn.əbˈzɝː.vənt/","extraExplanation":["non- 是常见前缀，表示“非、不”；observant 来自 observe（观察、注意）。所以 nonobservant 字面意思就是“没有在观察/不注意的”。","语气通常偏中性到轻微批评：形容一个人“没留意到明显变化或细节”。在更礼貌的表达里，也可以说 someone is “not very attentive” 或 “not very perceptive”。"]}
{"word":"nonobservantly","summary":{"en":"Nonobservantly means “in a not observant way”: not paying attention or not noticing something important.","zh":"nonobservantly 意为“以不留心的方式”：不够专心、没注意到重要信息。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you are not paying close attention; inattentively.","zh":"以不专心的方式；漫不经心地；不够留意地。"},"examples":[{"en":"He nonobservantly walked into the room and missed the sign on the door.","zh":"他漫不经心地走进房间，没有注意到门上的告示。"},{"en":"She listened nonobservantly, so she forgot the instructions right away.","zh":"她听得不够认真，所以马上就把指示忘了。"}]},{"partOfSpeech":"adv.","definition":{"en":"Without noticing something important; in an unobservant way.","zh":"在未察觉关键细节的情况下；不经意地。"},"examples":[{"en":"The driver nonobservantly passed the turn and had to circle back.","zh":"司机没留意就开过了转弯处，只好绕回来。"}]}],"synonyms":["inattentively","absentmindedly","carelessly","unthinkingly","without noticing"],"phonetic":"/ˌnɑn.əbˈzɝː.vənt.li/","extraExplanation":["这个词由 non-（不）+ observant（善于观察的/留心的）+ -ly（副词后缀）组成，字面意思是“以不留心的方式”。","在日常英语中，nonobservantly 比较少见，更常用的表达是 inattentively（不专心地）、absentmindedly（心不在焉地）或 without noticing（没有注意到）。如果写作想强调“缺乏观察力/没在观察”，才会用到 nonobservantly。","语气上它通常带一点批评或提醒的意味：不是“故意忽视”，而是“因为不够注意所以没看到/没意识到”。"]}
{"word":"nonobservation","summary":{"en":"Nonobservation means either not making/recording an observation, or (less commonly) not complying with rules or requirements.","zh":"nonobservation 指“未观察/未记录到观察结果”，也可（较少用）指“未遵守规定或要求”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of not observing (watching, noticing, or monitoring) something; a failure to make an observation","zh":"未进行观察；未注意到或未监测到某事；未作出观察记录"},"examples":[{"en":"The scientist noted the nonobservation of any change in temperature during the test.","zh":"科学家记录了在测试过程中未观察到任何温度变化。"},{"en":"Nonobservation does not always mean the event didn’t happen—it may simply mean no one saw it.","zh":"未观察到并不总是表示事件没有发生——也可能只是没人看到。"}]},{"partOfSpeech":"n.","definition":{"en":"failure to follow or comply with a rule, law, custom, or agreement (a less common term; often replaced by nonobservance or noncompliance)","zh":"未遵守（规则、法律、惯例或协议）；（较少用）常用 nonobservance 或 noncompliance 替代"},"examples":[{"en":"The report criticized the nonobservation of safety procedures on the worksite.","zh":"报告批评了工地未遵守安全流程的情况。"},{"en":"Nonobservation of the deadline may result in penalties.","zh":"未遵守截止日期可能会导致处罚。"}]}],"synonyms":["failure to observe","lack of observation","nonobservance","noncompliance"],"phonetic":"/ˌnɑnˌɑbzɚˈveɪʃən/","extraExplanation":["“nonobservation”比较少见，写作中更常看到“nonobservance”（不遵守）或“failure to observe”（未遵守/未观察到），以及“noncompliance”（不合规）。","这个词有两条常见理解路径：①“没看到/没观测到”（偏科学、统计、记录语境）；②“没遵守”（偏法律、规章制度语境）。判断时可以看宾语：如果后面接“changes/signals/evidence”等，多半是①；如果接“rules/procedures/laws”等，多半是②。"]}
{"word":"nonobservational","summary":{"en":"Nonobservational describes something that is not based on direct observation, or not directly observable.","zh":"nonobservational 指“非基于直接观察的”，也可指“不可直接观察到的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not based on direct observation or measurement; non-empirical.","zh":"不基于直接观察或测量的；非经验性的。"},"examples":[{"en":"The paper makes a nonobservational argument based on logic rather than data.","zh":"这篇论文提出的是一种非观察性的论证，主要依靠逻辑而不是数据。"},{"en":"In ethics, many debates involve nonobservational claims that can’t be settled by simply looking at the world.","zh":"在伦理学中，许多争论涉及非观察性的主张，无法仅靠“看一看现实”来解决。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not directly observable (not something you can see, hear, or otherwise detect with the senses or instruments in a straightforward way).","zh":"不可直接观察到的（不能用感官或仪器以直接方式清楚检测到的）。"},"examples":[{"en":"Some people describe consciousness as a nonobservational phenomenon from the outside.","zh":"有人认为，从外部来看，意识是一种不可直接观察的现象。"},{"en":"The model includes nonobservational variables that must be inferred from behavior.","zh":"这个模型包含一些非观察性变量，必须从行为中推断出来。"}]}],"synonyms":["non-empirical","theoretical","abstract","inferential","unobservable"],"phonetic":"/ˌnɑnˌɑbzɚˈveɪʃənəl/","extraExplanation":["“nonobservational”常见于学术写作，尤其是哲学、逻辑学、科学方法论与社会科学方法部分，用来对比“observational/empirical（观察性/经验性）”。它通常强调：结论不是来自直接观察的数据，而是来自推理、定义、模型设定或间接推断。","不要把 nonobservational 和 non-experimental 混为一谈：non-experimental 指“非实验性研究”（不操纵自变量），但仍可能是 observational（观察性）的；nonobservational 更强调“不是基于观察/不可直接观察”。"]}
{"word":"nonobserving","summary":{"en":"“Nonobserving” means not following a rule or tradition, especially religious practices.","zh":"“nonobserving”指不遵守某种规则或传统，尤其是不遵守宗教仪式或戒律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not watching or following a particular rule, practice, or tradition (often religious); not observing a custom","zh":"不遵守（某种规则/习俗/传统，常指宗教戒律）的；不按惯例的"},"examples":[{"en":"He comes from a nonobserving Jewish family and doesn’t keep kosher.","zh":"他来自一个不太遵守犹太教规的家庭，也不守犹太饮食戒律。"},{"en":"During Ramadan, some Muslims fast, while others are nonobserving for personal or health reasons.","zh":"在斋月期间，一些穆斯林会封斋，而另一些人因个人或健康原因不遵守。"}]}],"synonyms":["nonpracticing","not observant","lapsed"],"phonetic":"/ˌnɑn.əbˈzɝː.vɪŋ/","extraExplanation":["“nonobserving”最常见于宗教语境，表示“名义上属于某个宗教/群体，但不严格遵守其宗教仪式或戒律”。用来描述人或家庭时通常较中性，但在不同文化或家庭中可能带有评价色彩，建议在正式或敏感场合搭配更具体、尊重的说法（如：not strictly observant / not practicing）。","构词：non-（否定前缀）+ observing（遵守/奉行）。注意它和“unobserved（未被观察到的）/ unobseRvant（不善观察的）”意思不同。"]}
{"word":"nonobservingly","summary":{"en":"Nonobservingly means “without noticing; not paying attention.”","zh":"nonobservingly 表示“没留意地；不注意地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not notice or pay attention; without observing.","zh":"以不注意、不观察的方式；没留意地。"},"examples":[{"en":"He walked past the sign nonobservingly and missed the warning.","zh":"他没留意地从告示牌旁走过，错过了警告。"},{"en":"She nodded nonobservingly while thinking about something else.","zh":"她心不在焉地点了点头，脑子在想别的事。"}]}],"synonyms":["without noticing","absentmindedly","inattentively","unthinkingly"],"phonetic":"/ˌnɑnəbˈzɝvɪŋli/","extraExplanation":["这个词由 non-（表示“非/不”）+ observing（观察、注意）+ -ly（副词后缀）构成，字面意思就是“以不观察/不注意的方式”。","在现代英语中 **nonobservingly** 很少见，日常表达更常用：*without noticing*（没注意到）、*absentmindedly*（心不在焉地）、*inattentively*（不专心地）。在写作中你也可以用这些更自然的替代。"]}
{"word":"nonobsession","summary":{"en":"“Nonobsession” means not being obsessed—keeping a balanced, non-fixated attitude toward something.","zh":"“nonobsession”指“不痴迷、不执着”，对某事保持更平衡、不纠结的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being obsessed with something; a relaxed or balanced attitude that does not involve constant worry, fixation, or intrusive thoughts.","zh":"对某事不痴迷/不执着的状态；一种更放松、更平衡的态度，不会持续纠结、沉迷或反复想着。"},"examples":[{"en":"Her nonobsession with social media helps her sleep better and feel calmer.","zh":"她对社交媒体不执着，这让她睡得更好、也更平静。"},{"en":"The coach encouraged nonobsession with mistakes and a focus on the next play.","zh":"教练鼓励大家别纠结失误，把注意力放在下一次动作上。"}]}],"synonyms":["lack of obsession","not being obsessed","detachment","non-attachment","balance"],"phonetic":"/ˌnɑnəbˈsɛʃən/","extraExplanation":["“nonobsession”不是常见的标准词汇，在日常英语里更常写成 **non-obsession**（带连字符）或直接说 **a lack of obsession / not being obsessed**。在心理健康或自我成长语境中，也常用 **detachment**（抽离/不被牵动）或（更偏东方哲学语境的）**non-attachment**（不执著）来表达类似意思。","构词上它是 **non-**（不、非）+ **obsession**（痴迷、强迫式的念头）。如果你是在写作里想表达“不过度纠结/不过度沉迷”，用更常见的表达会更自然。"]}
{"word":"nonobsessional","summary":{"en":"Nonobsessional means “not obsessional/not overly fixated,” and is mostly seen in clinical or academic writing (often as non-obsessional).","zh":"nonobsessional 意为“非强迫观念性的/不执着的”，多见于临床或学术写作（常写作 non-obsessional）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not obsessional; not characterized by persistent, intrusive thoughts or urges; not overly fixated on something","zh":"非强迫性（观念）的；不带有反复侵入性想法或冲动的；不过度执着的"},"examples":[{"en":"He can be careful about details without becoming nonobsessional and rigid.","zh":"他可以在细节上很谨慎，但不会变得不执着、也不僵化。"},{"en":"Try to keep your study routine focused but nonobsessional.","zh":"尽量让你的学习计划专注，但不要变成过度执着。"}]},{"partOfSpeech":"adj.","definition":{"en":"(clinical/academic) not involving obsessional symptoms (obsessions), especially in discussions of mental health","zh":"（临床/学术）非强迫观念症状的；不涉及强迫观念（obsessions）的（常用于心理健康语境）"},"examples":[{"en":"The clinician noted nonobsessional anxiety rather than intrusive, obsessional thoughts.","zh":"临床医生记录的是非强迫观念性的焦虑，而不是带侵入性的强迫观念。"},{"en":"In the report, the patient’s worries were described as nonobsessional and situation-based.","zh":"在报告中，患者的担忧被描述为非强迫观念性的、与情境相关的。"}]}],"synonyms":["non-obsessive","not obsessive","unfixated","not compulsive (context-dependent)"],"phonetic":"/ˌnɑn.əbˈsɛʃ.ə.nəl/","extraExplanation":["这个词在日常英语里比较少见，更常见的表达是 **non-obsessive** 或 **not obsessive**。拼写上也常写成带连字符的 **non-obsessional**。","构词很直观：**non-**（不、非）+ **obsessional**（与强迫观念相关的/执着的）。其中 *obsessional* 在心理学语境里常指“强迫观念（obsessions）”相关，而不一定等同于日常说的“很着迷/很上头”。"]}
{"word":"nonobsessive","summary":{"en":"Nonobsessive means not overly or compulsively focused on something; balanced and healthy in attention.","zh":"nonobsessive 指不过度痴迷或强迫式关注某事，强调注意力更平衡、更健康。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not obsessive; not overly focused on one thing in an unhealthy or extreme way.","zh":"不痴迷的；不（过度）执着的；不过分纠结的（不至于到不健康或极端的程度）。"},"examples":[{"en":"She has a nonobsessive attitude toward dieting—she eats well but doesn’t panic over one dessert.","zh":"她对节食的态度不痴迷——吃得健康，但不会因为吃了一块甜点就慌张。"},{"en":"Try to track your spending in a nonobsessive way: check weekly, not every hour.","zh":"尽量用不执着的方式记录开销：每周看一次，而不是每小时都盯着。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Psychology/medical contexts) Not characterized by obsessive thoughts or compulsive behaviors.","zh":"（心理/医学语境）非强迫性的；不以强迫性想法或行为为特征的。"},"examples":[{"en":"The clinician noted his worries were persistent but nonobsessive.","zh":"临床记录指出，他的担忧持续存在，但不属于强迫性的。"},{"en":"They aimed for a nonobsessive level of cleanliness rather than constant scrubbing.","zh":"他们追求的是不过度的清洁，而不是不停地刷洗。"}]}],"synonyms":["balanced","moderate","healthy","easygoing","uncompulsive"],"phonetic":"/ˌnɑnəbˈsɛsɪv/","extraExplanation":["“nonobsessive”由前缀 non-（表示“非、不”）+ obsessive 组成，意思就是“不是那种沉迷/强迫式的”。日常写作中也常见带连字符的形式 “non-obsessive”，两种都能用；正式出版物更常按各自风格指南选择其一。","它通常带有积极的语气，暗示“有兴趣、有投入，但保持健康的边界与弹性”。"]}
{"word":"nonobsessively","summary":{"en":"“Nonobsessively” means doing something with interest or care, but without obsessing or overdoing it.","zh":"“nonobsessively”表示做某事会在意、会认真，但不会过度执着、反复纠结或沉迷。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not obsessive; without repeatedly thinking about something too much or trying to control it too tightly.","zh":"以不执着/不过度着迷的方式；不过分反复想着某事或过度控制。"},"examples":[{"en":"Try tracking calories nonobsessively—aim for awareness, not perfection.","zh":"试着以不执着的方式记录热量——目标是提高觉察，而不是追求完美。"},{"en":"She follows the news nonobsessively, checking updates once a day.","zh":"她关注新闻但不过度沉迷，每天查看一次更新。"},{"en":"He practices piano nonobsessively, so it stays enjoyable.","zh":"他练钢琴不过度逼迫自己，所以一直觉得有乐趣。"}]}],"synonyms":["without obsessing","in a balanced way","moderately","sensibly","with perspective"],"phonetic":"/ˌnɑnəbˈsɛsɪvli/","extraExplanation":["“non- + obsessively”是英语里很常见的构词方式：用non-表示“不是/不带有……特征”。“nonobsessively”强调的是一种健康的程度：你仍然在意、会去做，但不会陷入反复纠结、强迫性检查或过度追求完美。","这个词在口语和写作里相对少见，更常见的表达有：“in a balanced way / without obsessing / not obsessively”。当你想更简洁地表达“不过度”时，用它会显得更书面、更直接。"]}
{"word":"nonobsessiveness","summary":{"en":"Nonobsessiveness means a relaxed, non-compulsive way of caring about something—being engaged without over-fixating.","zh":"Nonobsessiveness 指一种“在意但不沉迷/不强迫”的态度：投入但不钻牛角尖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not being excessively focused on something; a relaxed, non-compulsive attitude.","zh":"不过度执着（不钻牛角尖）；对某事不强迫性关注的状态。"},"examples":[{"en":"Her nonobsessiveness about grades helped her enjoy learning.","zh":"她对成绩不那么执着，这让她更能享受学习。"},{"en":"A little nonobsessiveness can reduce stress and improve decision-making.","zh":"多一点不执着能减轻压力，也有助于做出更好的决定。"}]}],"synonyms":["non-obsessiveness","detachment","even-handedness","level-headedness","easygoingness"],"phonetic":"/ˌnɑnəbˈsɛsɪvnəs/","extraExplanation":["“nonobsessiveness”不是非常常见的词，更常见的表达是“lack of obsessiveness / being non-obsessive / not being obsessive”。它由 non-（表示“非、不”）+ obsessiveness（执迷、强迫式的在意）构成。","语气与使用场景：它通常带有正面含义，强调“不过度纠结、不过度控制”，尤其常见于心理健康、习惯养成、学习/工作压力管理等语境。","注意区分：nonobsessiveness ≠ 不在乎（indifference）。它更像“在乎，但不被它绑架”，中文可译为“松弛感”“不过度执念”。"]}
{"word":"nonobstetric","summary":{"en":"Nonobstetric means “not related to obstetrics,” i.e., not about pregnancy or childbirth care.","zh":"nonobstetric 指“非产科的”，即与妊娠或分娩照护无关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to pregnancy, childbirth, or the care of pregnant people (obstetrics).","zh":"非产科的；与妊娠、分娩或孕产期照护（产科学）无关的。"},"examples":[{"en":"The hospital has a separate nonobstetric intensive care unit for general medical emergencies.","zh":"医院设有独立的非产科重症监护室，用于一般内科急症。"},{"en":"She was admitted for nonobstetric surgery unrelated to her pregnancy.","zh":"她因与妊娠无关的非产科手术而住院。"}]}],"synonyms":["non-maternity (context-dependent)","nonpregnancy-related (context-dependent)"],"phonetic":"/ˌnɑnəbˈstɛtrɪk/","extraExplanation":["这是一个医学用语，常见于病历、研究论文或医院科室命名中，用来把“产科相关”与“其他一般医疗/外科情况”区分开。","构词很好理解：non-（不、非）+ obstetric（产科的）。在美式英语医学写作中常写作一个词“nonobstetric”，也可能见到带连字符的“non-obstetric”。","常见搭配：nonobstetric surgery（非产科手术）、nonobstetric patient（非产科患者）、nonobstetric causes/conditions（非产科原因/情况）。"]}
{"word":"nonobstetrical","summary":{"en":"Nonobstetrical means not related to pregnancy or childbirth (obstetrics).","zh":"nonobstetrical 指“非产科的”，即与妊娠或分娩无关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to obstetrics (pregnancy, childbirth, and the care of pregnant people).","zh":"非产科的；与妊娠、分娩及孕产妇护理无关的。"},"examples":[{"en":"The hospital has separate obstetrical and nonobstetrical emergency services.","zh":"这家医院把产科急诊和非产科急诊服务分开设置。"},{"en":"She was admitted for a nonobstetrical condition unrelated to pregnancy.","zh":"她因与怀孕无关的非产科疾病住院。"}]}],"synonyms":["non-maternity","not obstetric"],"phonetic":"/ˌnɑn.əbˈstɛt.rɪ.kəl/","extraExplanation":["这是一个医学/医院用语，常见于病历、研究论文或分诊说明中，用来把“与怀孕分娩有关的（产科）问题”与“其他一般内外科等问题”区分开。","构词法：non-（不/非）+ obstetrical（产科的）。在医学写作中也常见写作 non-obstetrical（加连字符）。"]}
{"word":"nonobstetrically","summary":{"en":"“Nonobstetrically” means “in a way that is not related to pregnancy or childbirth,” mainly used in medical writing.","zh":"“nonobstetrically”表示“非产科地/与妊娠分娩无关地”，主要见于医学写作与病历表述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not related to obstetrics (pregnancy, childbirth, and care around birth).","zh":"以与产科（妊娠、分娩及围产期护理）无关的方式；非产科地。"},"examples":[{"en":"The patient was admitted nonobstetrically for a gallbladder problem.","zh":"这位病人并非因产科原因入院，而是因为胆囊问题。"},{"en":"They evaluated the bleeding and determined it was nonobstetrically caused.","zh":"他们评估了出血情况，并判断其原因与产科无关。"}]}],"synonyms":["not obstetrically","for non-obstetric reasons","unrelated to pregnancy or childbirth"],"phonetic":"ˌnɑnəbˈstɛtrɪkli","extraExplanation":["这是一个偏医学论文/病历用语的副词，常用来区分“产科原因”与“非产科原因”（例如：nonobstetric complications/causes）。日常英语里很少单独用这个词。","拼写上有时会看到加连字符的写法（non-obstetrically），意义相同；是否加连字符多取决于期刊或医院文书风格。","更常见、也更口语的表达是：“for a non-obstetric reason / not related to pregnancy or childbirth（因为非产科原因/与怀孕分娩无关）”。"]}
{"word":"nonobstructive","summary":{"en":"Nonobstructive means not blocking or interfering; it stays out of the way.","zh":"nonobstructive 指“不阻碍、不妨碍、不干扰”，强调“不会挡路/不会影响进行”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not blocking, getting in the way, or interfering; allowing easy movement, access, or progress.","zh":"不阻碍的；不妨碍的；不干扰的（让通行、接近或进展更顺畅）"},"examples":[{"en":"The app runs in the background in a nonobstructive way, so it doesn’t interrupt your work.","zh":"这个应用以不妨碍的方式在后台运行，所以不会打断你的工作。"},{"en":"Please place the chairs in a nonobstructive position near the wall.","zh":"请把椅子放在靠墙、不阻碍通行的位置。"},{"en":"The guide gave nonobstructive suggestions and let us explore on our own.","zh":"导游给了不强行干预的建议，让我们自己探索。"}]}],"synonyms":["unobtrusive","nonintrusive","out of the way","unhindered"],"phonetic":"/ˌnɑnəbˈstrʌktɪv/","extraExplanation":["“non-”是否定前缀，表示“不是/不…”。“obstructive”来自动词“obstruct”（阻挡、妨碍），因此“nonobstructive”整体意思就是“不造成阻挡/妨碍”。","这个词在日常口语中不算特别常见，更常见的替换说法有：“not in the way”“unobtrusive（不惹眼、不打扰的）”“nonintrusive（不侵扰的，常用于软件/问卷/隐私场景）”。注意：unobtrusive 更强调“不引人注意、不给人压力”，nonobstructive 更强调“物理或流程上不阻塞”。"]}
{"word":"nonobstructively","summary":{"en":"Nonobstructively means “in a way that doesn’t block or interfere,” often describing where someone stands or where something is placed.","zh":"nonobstructively 表示“以不挡路、不妨碍、不干扰的方式”，常用来描述人站的位置或物品摆放的位置。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not get in the way, does not block movement, and does not interrupt what others are doing.","zh":"以不妨碍他人、不挡路、不打断的方式；不造成阻碍地。"},"examples":[{"en":"The staff member stood nonobstructively to the side so people could pass.","zh":"工作人员不挡路地站到一旁，让人们顺利通过。"},{"en":"Please place the sign nonobstructively near the entrance.","zh":"请把告示牌不妨碍通行地放在入口附近。"}]}],"synonyms":["out of the way","without blocking","unobtrusively","inconspicuously"],"phonetic":"/ˌnɑnəbˈstrʌktɪvli/","extraExplanation":["这个词比较少见，但很常用于说明“站位/摆放/出现的方式”——强调既看得到、也起作用，同时不占空间、不影响动线。","构词很好理解：non-（不）+ obstructive（造成阻碍的）+ -ly（副词）。因此它常和 stand / sit / place / position / remain 等动词搭配。","近义表达更口语：out of the way（不碍事地）、without blocking（不挡住）、inconspicuously（不显眼地，侧重“不引人注意”，不一定强调“不挡路”）。"]}
{"word":"nonobstructiveness","summary":{"en":"Nonobstructiveness means the quality of not blocking or hindering; in technical/medical use, it can mean “not causing a physical blockage.”","zh":"nonobstructiveness 指“不阻碍性”；在技术/医学语境中也可指“无阻塞性（不造成物理堵塞）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not blocking, hindering, or getting in the way of movement, flow, vision, access, or progress.","zh":"不阻碍性；不妨碍的状态（指不阻挡、不妨碍移动、流动、视线、通行或进展）。"},"examples":[{"en":"The designer emphasized the nonobstructiveness of the new signage so it wouldn’t block the view.","zh":"设计师强调新标识的“不阻碍性”，以免遮挡视线。"},{"en":"In a narrow hallway, the furniture’s nonobstructiveness matters for safety.","zh":"在狭窄走廊里，家具的“不阻碍性”对安全很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical/technical) The condition of not causing a physical blockage (for example, not blocking airflow, blood flow, or a passage).","zh":"（医学/技术）无阻塞性；不造成物理堵塞的情况（如不阻塞气流、血流或管道通道）。"},"examples":[{"en":"The report noted nonobstructiveness in the airway, meaning there was no blockage.","zh":"报告指出气道“无阻塞性”，意味着没有堵塞。"},{"en":"Engineers tested the nonobstructiveness of the filter to keep water flowing smoothly.","zh":"工程师测试过滤器的“不阻碍性”，以保证水流顺畅。"}]}],"synonyms":["unobtrusiveness","noninterference","openness","clearance","accessibility"],"phonetic":"/ˌnɑnəbˈstrʌktɪvnəs/","extraExplanation":["这个词相对少见，更常见的是形容词 **nonobstructive**（不造成阻塞的）。**nonobstructiveness** = non-（不）+ obstructive（阻碍的）+ -ness（名词后缀，表示“性质/状态”）。","常见搭配：the nonobstructiveness of + 名词（某物的不阻碍性）。在医学语境里也常见“nonobstructive + 名词”（如 nonobstructive disease），而不是用 nonobstructiveness。"]}
{"word":"nonobvious","summary":{"en":"Nonobvious means “not easy to see or understand at first.”","zh":"nonobvious 指“乍看不明显、不容易看出来或理解”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not easy to notice, understand, or predict; not clearly seen at first.","zh":"不明显的；不易察觉/不易理解的；乍看并不清楚的。"},"examples":[{"en":"There’s a nonobvious reason the app feels slow: it’s waiting for a background server call.","zh":"这个应用感觉很慢有个不明显的原因：它在等待后台服务器请求返回。"},{"en":"The answer seems simple, but the most nonobvious part is what the question is really asking.","zh":"答案看起来很简单，但最不明显的部分是问题真正想问什么。"},{"en":"Her success wasn’t luck; it came from a series of nonobvious choices over many years.","zh":"她的成功不是运气，而是多年间一连串不明显但关键的选择累积而来。"}]}],"synonyms":["unclear","subtle","not apparent","not immediately evident","hidden","hard to see"],"phonetic":"/ˌnɑːnˈɑːbviəs/","extraExplanation":["“nonobvious”比“not obvious”更像一个整体概念，常用于强调：需要多想一步、需要背景信息，或需要深入分析才能看出来的点（例如商业策略、逻辑推理、产品体验、写作论证）。","常见搭配：nonobvious reason（不明显的原因）, nonobvious solution（不直观的解法）, nonobvious insight（不容易想到的洞见）, nonobvious relationship/connection（不明显的关联）。","近义词语气区别：subtle（微妙、细腻，常带“精巧/细致”意味），hidden（隐藏的，强调被遮住或未被发现），counterintuitive（反直觉的，强调与直觉相反）。"]}
{"word":"nonobviously","summary":{"en":"Nonobviously means “not in an obvious way; subtly or unexpectedly.”","zh":"nonobviously 表示“以不明显的方式；微妙地、出人意料地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not obvious; in a subtle or unexpected way.","zh":"以不明显的方式；以微妙或出人意料的方式。"},"examples":[{"en":"The two problems are nonobviously connected through a shared cause.","zh":"这两个问题通过一个共同原因以不明显的方式联系在一起。"},{"en":"Her comment was nonobviously sarcastic, so some people missed the joke.","zh":"她的评论带着不明显的讽刺，所以有些人没听出玩笑。"},{"en":"The rule works nonobviously: it affects the outcome without changing the main steps.","zh":"这条规则的作用并不直观：它不改变主要步骤，却会影响结果。"}]}],"synonyms":["subtly","indirectly","inconspicuously","not obviously","in a less-than-obvious way"],"phonetic":"/ˌnɑnˈɑbviəsli/","extraExplanation":["更常见的写法是 **non-obviously**（带连字符），尤其在正式写作中更清晰；**nonobviously**（不加连字符）也能见到，但相对少一些。","它常用来表示“乍看之下看不出来”的逻辑关系或影响，写作里经常和 **connected / related / linked / affected** 等词搭配。"]}
{"word":"nonobviousness","summary":{"en":"Nonobviousness means the quality of being not obvious—subtle, hard to notice, or not easy to predict or understand.","zh":"nonobviousness 指“非显而易见性/不明显性”，强调事物不容易被察觉、理解或预测的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not being easy to notice, predict, or understand; the state of being subtle or not obvious.","zh":"不明显性；非显而易见性；难以一眼看出、预测或理解的特质。"},"examples":[{"en":"The nonobviousness of the clue made the puzzle much harder.","zh":"线索的不明显性让这个谜题难了很多。"},{"en":"Good design often hides complexity, so its nonobviousness feels natural.","zh":"好的设计常常隐藏复杂性，因此它的“不明显”反而让人觉得自然。"},{"en":"She admired the nonobviousness of his argument and reread it carefully.","zh":"她欣赏他论证中的非显而易见性，于是又仔细读了一遍。"}]}],"synonyms":["subtlety","lack of obviousness","hiddenness","opacity","complexity"],"phonetic":"ˌnɑnˈɑbviəsnəs","extraExplanation":["“nonobviousness”常见于学术或正式语境，表示“并非显而易见”的程度。日常对话里更常用“not obvious”“subtle”“hard to see”等表达。","在专利语境中，nonobviousness（非显而易见性）是一个关键标准：如果某项发明对相关领域的一般技术人员来说并不显而易见，才更可能满足可专利性要求。","构词上：non-（不）+ obvious（明显的）+ -ness（名词后缀，表示“性质/状态”）。因此它强调的是“这种性质”，而不只是“某次没看出来”。"]}
{"word":"nonoccidental","summary":{"en":"Nonoccidental means “non-Western; not related to Western (European/American) culture or viewpoints.”","zh":"nonoccidental 意为“非西方的”，指不属于或不以欧美（西方）文化与观点为中心的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not Western in culture, origin, or perspective; non-Western.","zh":"非西方的；不属欧美（西方）文化、起源或观点的。"},"examples":[{"en":"The course includes nonoccidental philosophies such as Confucianism and Buddhism.","zh":"这门课程也包含非西方的哲学，如儒家思想和佛教。"},{"en":"She studies nonoccidental art traditions from Africa and Asia.","zh":"她研究来自非洲与亚洲的非西方艺术传统。"},{"en":"The museum is trying to present nonoccidental history without treating it as “exotic.”","zh":"博物馆试图呈现非西方历史，而不把它当作“奇观/异域风情”。"}]}],"synonyms":["non-Western","Eastern (context-dependent)","non-European","non-American","non-Eurocentric"],"phonetic":"/ˌnɑnˌɑk.sɪˈdɛn.təl/","extraExplanation":["“nonoccidental”较偏学术/书面语，日常更常用“non-Western”。两者意思基本相同。","“Occidental”意为“西方的/欧美的”，与“Oriental”（东方的）常被拿来对比；但在描述人时，“Oriental”在英语里容易带有过时或冒犯感，通常更建议说“Asian / East Asian”等更具体的表达。","拼写上也常见连字符形式“non-Occidental”，是否加连字符取决于写作风格指南与版面需要。"]}
{"word":"nonoccidentally","summary":{"en":"“Nonoccidentally” means “in a non-Western way; from a non-Western perspective.” It’s rare in modern English.","zh":"“nonoccidentally”意为“以非西方的方式；从非西方视角”。在现代英语中很少用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a non-Western way; from the perspective of cultures and societies outside Europe and North America.","zh":"以非西方的方式；从欧洲和北美之外的文化与社会视角来看。"},"examples":[{"en":"The exhibit is curated nonoccidentally, highlighting African and Asian perspectives rather than European ones.","zh":"这个展览以非西方视角策展，更突出非洲与亚洲的观点，而不是欧洲的观点。"},{"en":"To understand the story nonoccidentally, pay attention to community duty and family ties, not just individual freedom.","zh":"若要以非西方角度理解这个故事，要关注群体责任与家庭纽带，而不只是个人自由。"}]}],"synonyms":["from a non-Western perspective","in a non-Western way","non-Westernly"],"phonetic":"/ˌnɑnˌɑksəˈdɛn(t)əli/","extraExplanation":["“nonoccidentally”非常少见，更多时候人们会用更自然、也更清晰的表达：**non-Westernly**（较少见）、更常见的是 **from a non-Western perspective**（从非西方视角）、**in a non-Western way**（以非西方方式）。\n\n词根来自 **occidental**（“西方的”，较正式/文学），加上否定前缀 **non-**，表示“非西方”。在当代英语里，谈文化时更常用 **Western / non-Western**，因为与之成对的旧词 **Oriental** 在描述人群时常被认为不合适或过时。"]}
{"word":"nonocclusion","summary":{"en":"Nonocclusion means a lack of normal contact (especially between opposing teeth), or more generally the absence of occlusion (closure/blocking).","zh":"Nonocclusion 指“没有咬合接触”（尤其指上下对颌牙不接触），更广义也可指“没有闭塞/封闭（occlusion）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dentistry/orthodontics) A type of malocclusion in which opposing teeth (often the back teeth) do not touch when biting, so there is no normal chewing contact.","zh":"（牙科／正畸）一种咬合异常：上下相对的牙（常见于后牙）在咬合时完全不接触，无法形成正常的咀嚼接触。"},"examples":[{"en":"The orthodontist noted nonocclusion on the right side, so the molars weren’t meeting during chewing.","zh":"正畸医生发现右侧存在非咬合，所以咀嚼时上下磨牙碰不到。"},{"en":"If nonocclusion is severe, it can make eating difficult and may irritate the gums.","zh":"如果非咬合比较严重，可能会影响进食，还可能刺激牙龈。"}]},{"partOfSpeech":"n.","definition":{"en":"(General/medical) The absence of occlusion; not being closed off, blocked, or sealed by contact.","zh":"（一般／医学）“闭塞／封闭（occlusion）”的缺失；没有被接触而封住、堵住或闭合的状态。"},"examples":[{"en":"The report described nonocclusion of the opening, meaning it was not sealed shut.","zh":"报告写到该开口处为“非闭塞”，意思是它没有被封闭。"}]}],"synonyms":["open bite","lack of occlusion","disclusion"],"phonetic":"/ˌnɑn.əˈkluːʒən/","extraExplanation":["“nonocclusion”在日常英语里不算常见，更常见于牙科／正畸语境。很多医生也会写成“non-occlusion”（加连字符）。","在牙科里，它常被用来描述“上下牙咬不到”的情况；相关更常见的说法还有“open bite（开颌）”，但两者不一定完全等同（取决于具体是哪一组牙不接触）。"]}
{"word":"nonocclusive","summary":{"en":"Nonocclusive means “not blocking/closing off,” often used in medical contexts (e.g., a clot that does not fully block blood flow).","zh":"nonocclusive 指“非闭塞性的、未造成阻塞的”，多用于医学语境（如血栓未完全阻断血流）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not causing an occlusion (a blockage or closing-off), especially of a blood vessel, airway, or opening.","zh":"（尤指医学）非闭塞性的；不造成阻塞或封闭的（如血管、气道或开口未被堵住）。"},"examples":[{"en":"The scan showed a nonocclusive clot, meaning blood could still flow past it.","zh":"扫描显示为非闭塞性血栓，意思是血液仍能从旁通过。"},{"en":"Doctors monitored the patient because the thrombus was nonocclusive and symptoms were mild.","zh":"医生对患者进行观察，因为血栓是非闭塞性的，症状也较轻。"}]}],"synonyms":["non-blocking","not fully obstructing","partially obstructing"],"phonetic":"/ˌnɑn.əˈkluː.sɪv/","extraExplanation":["这是一个偏医学/影像报告常见的形容词：occlusive 表示“造成堵塞的”，nonocclusive 表示“没有把通道完全堵住”。常见搭配有 nonocclusive thrombus（非闭塞性血栓）、nonocclusive disease/stenosis（非闭塞性病变/狭窄）。","注意：nonocclusive 并不等于“没问题”。即使不完全堵塞，也可能有风险（例如血栓增大、脱落等），通常需要结合症状、部位与医生判断。"]}
{"word":"nonoccult","summary":{"en":"Nonoccult means “not occult”—either not mystical/supernatural, or (in technical/medical use) not hidden and therefore visible.","zh":"nonoccult 意为“非 occult 的”：要么指不涉及神秘/超自然，要么（在医学等技术语境）指不隐匿、可见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not occult; not involving secret, mystical, or supernatural practices or beliefs.","zh":"非神秘主义的；不涉及隐秘、神秘或超自然的做法或信仰。"},"examples":[{"en":"The film has a nonoccult explanation for the strange events—just science and coincidence.","zh":"这部电影对那些奇怪事件给出了非神秘的解释——只是科学与巧合。"},{"en":"She prefers nonoccult spirituality and focuses on ethics and community service.","zh":"她更喜欢非神秘主义的精神追求，把重点放在伦理与社区服务上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical/technical) Not hidden; visible or obvious (opposite of occult meaning “hidden”).","zh":"（医学/技术）非隐匿的；可见的、明显的（与 occult 表示“隐匿的”相对）。"},"examples":[{"en":"The patient had nonoccult bleeding that was easy to observe.","zh":"病人出现了非隐匿性出血，很容易观察到。"},{"en":"Unlike occult blood, nonoccult blood is visible to the naked eye.","zh":"与隐血不同，非隐匿性的血肉眼可见。"}]}],"synonyms":["non-mystical","non-esoteric","non-supernatural","straightforward","open","overt"],"phonetic":"/ˌnɑnˈʌkʌlt/","extraExplanation":["nonoccult 通常写作 non-occult（带连字符）更常见，尤其在学术或编辑规范里；不带连字符的写法也会出现，但整体较少见。","occult 这个词有两个常见方向：①“神秘学/超自然”（例如 occult practices）；②“隐匿的、难以直接发现的”（尤其医学里，如 occult blood=隐血）。nonoccult 就分别对应“非神秘的”和“非隐匿的/可见的”。","使用场景提示：谈宗教、灵性、神秘学时，多理解为“非神秘学的”；在医学检测或病理描述中，更可能指“非隐匿的/肉眼可见的”。"]}
{"word":"nonocculting","summary":{"en":"Nonocculting means “not blocking or hiding from view,” especially in astronomy (not causing an occultation).","zh":"nonocculting 指“不遮挡、不掩蔽（不使看不见）”，尤用于天文学中表示“不发生掩星/遮掩”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Astronomy) Not causing an occultation; not passing in front of something and blocking it from view.","zh":"（天文学）不发生掩星（遮掩）现象的；不会从前方经过而把后方天体遮住的。"},"examples":[{"en":"This satellite uses a nonocculting design so it doesn’t block the telescope’s line of sight.","zh":"这颗卫星采用非遮挡（nonocculting）设计，因此不会挡住望远镜的视线。"},{"en":"Because the orbit is nonocculting, the star is never fully hidden behind the planet from Earth’s view.","zh":"由于轨道是非掩蔽的（nonocculting），从地球看这颗恒星不会被行星完全遮住。"}]},{"partOfSpeech":"adj.","definition":{"en":"(General/figurative) Not hiding, obscuring, or covering something; not making something “less visible” or less clear.","zh":"（一般/引申）不隐瞒的；不遮掩的；不使事情变得不清楚的。"},"examples":[{"en":"The report is direct and nonocculting—it clearly states the risks.","zh":"这份报告直截了当、毫不遮掩，清楚说明了风险。"},{"en":"Choose a nonocculting layout so key information stays visible on the screen.","zh":"选择一种不遮挡的版式，让关键信息在屏幕上始终可见。"}]}],"synonyms":["non-blocking","unobstructive","unobstructed","unoccluded","not obscuring","transparent"],"phonetic":"/ˌnɑn.əˈkʌl.tɪŋ/","extraExplanation":["这个词非常少见，通常是由 non-（“不、非”）+ occulting（“遮掩/掩蔽”）构成，多见于天文学语境（与 occultation“掩星/掩蔽”相关）。","注意不要和 occult（常见义为“神秘学/玄学的”）混淆：在天文学里 occult 的核心含义更接近“遮住、使看不见”。","在日常英语里，更常用的表达通常是 non-blocking, unobstructed, unoccluded, transparent, not obscuring 等；nonocculting 往往显得专业或生造。"]}
{"word":"nonoccupance","summary":{"en":"Nonoccupance means the state of not occupying a place (being empty), or a formal sense of a position being unfilled.","zh":"nonoccupance 指“未占用/空置”的状态，也可正式地指“职位或席位空缺”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not occupying or living in a place; the fact that a building, room, or property is empty.","zh":"（房屋、房间、物业等）未被居住/未被使用的状态；空置。"},"examples":[{"en":"The landlord cited long-term nonoccupance as a reason to end the lease.","zh":"房东以长期空置为由提出终止租约。"},{"en":"Insurance policies may have special rules for nonoccupance during renovations.","zh":"保险条款可能对装修期间的空置有特殊规定。"},{"en":"Signs of nonoccupance included no lights at night and an overgrown yard.","zh":"空置的迹象包括夜里不开灯以及院子杂草丛生。"}]},{"partOfSpeech":"n.","definition":{"en":"Failure to take or hold a position, office, seat, or right; not being in a role that is supposed to be filled.","zh":"（职位、席位、权利等）未被担任/未被占有；空缺。"},"examples":[{"en":"The report criticized the nonoccupance of key leadership roles.","zh":"报告批评了关键领导岗位的长期空缺。"},{"en":"Nonoccupance of the seat left the committee without a voting member.","zh":"席位空缺使委员会少了一名有投票权的成员。"}]}],"synonyms":["nonoccupancy","vacancy","emptiness","unoccupancy","absence"],"phonetic":"/ˌnɑnˈɑkjəpəns/","extraExplanation":["“nonoccupance”较偏正式、也较少见，很多场合会用更常见的“nonoccupancy / vacancy / unoccupied”来表达“空置”。","在法律、租赁、房产管理、保险等语境中更可能看到“nonoccupance”，因为这些领域常用较古典/正式的名词形态来描述“占用状态”。","构词：non-（不、非）+ occupance（占用/居住的状态）。其中“occupance”本身就不如“occupancy”常用，因此整体显得更书面。"]}
{"word":"nonoccupancy","summary":{"en":"Nonoccupancy means the condition of being unoccupied or vacant, often used in formal contexts like property, rental, and insurance.","zh":"Nonoccupancy 指“未被占用、空置”的状态，常用于房产、租赁、保险等较正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being occupied or lived in; vacancy (especially of a building, room, or property).","zh":"未被占用的状态；空置（尤指房屋、房间或不动产）。"},"examples":[{"en":"The landlord reported a long period of nonoccupancy in the apartment.","zh":"房东报告说这套公寓空置了很长一段时间。"},{"en":"Insurance policies may have special rules during nonoccupancy of a home.","zh":"房屋在空置期间，保险条款可能会有特殊规定。"},{"en":"The hotel closed one wing for renovation, resulting in temporary nonoccupancy of those rooms.","zh":"酒店关闭了一侧进行翻修，导致那些房间暂时无人入住。"}]}],"synonyms":["vacancy","emptiness","unoccupied status","absence of occupants"],"phonetic":"/ˌnɑnˈɑkjəpənsi/","extraExplanation":["“nonoccupancy”常见于房地产、租赁、保险与法律文件语境，比日常用词“vacancy”更正式、更书面。","在保险或管理规定中，“nonoccupancy”有时会被定义为连续多少天无人居住/无人使用；不同合同的天数门槛可能不同，因此阅读条款时要看具体定义。"]}
{"word":"nonoccupant","summary":{"en":"A nonoccupant is someone who is not inside or using a particular place or vehicle, especially used in traffic-crash reports to mean a person outside the vehicle (e.g., a pedestrian or cyclist).","zh":"nonoccupant 指不在（某处/车内）的人，尤常用于交通事故报告中，指车外人员（如行人、骑行者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is not inside or using a particular place or vehicle (especially someone who is not in a vehicle involved in a crash).","zh":"非乘坐者；非占用者（尤指交通事故中不在涉事车辆内的人）。"},"examples":[{"en":"The accident injured two occupants and one nonoccupant who was walking nearby.","zh":"事故中两名车内人员和一名在附近步行的非乘坐者受伤。"},{"en":"The report separates injuries to occupants from injuries to nonoccupants.","zh":"报告将车内人员的伤害与非乘坐者的伤害分开统计。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not occupying; not inside a particular place or vehicle.","zh":"未占用的；不在（某处/车内）的。"},"examples":[{"en":"Nonoccupant pedestrians are especially vulnerable at night.","zh":"夜间的非乘坐者（如行人）尤其脆弱。"},{"en":"The study focused on nonoccupant victims, such as cyclists and pedestrians.","zh":"该研究聚焦非乘坐者受害者，例如骑行者和行人。"}]}],"synonyms":["nonresident","outsider","pedestrian (in crash reports)","cyclist (in crash reports)","bystander"],"phonetic":"/ˌnɑnˈɑk.jə.pənt/","extraExplanation":["这个词多见于交通安全、保险、警方事故报告、医学/统计论文中，用来区分“车内人员（occupant）”和“车外人员（nonoccupant）”。常见的 nonoccupant 包括行人（pedestrian）、骑行者（cyclist）、摩托车骑手（motorcyclist）等。","构词很好理解：non-（不/非）+ occupant（占用者/乘坐者）。在日常口语里，人们更常直接说 pedestrian / cyclist / bystander（旁观者）等，而不是 nonoccupant。"]}
{"word":"nonoccupation","summary":{"en":"Nonoccupation usually means something that is not a person’s job, or (in formal contexts) the status of not having a recognized occupation.","zh":"nonoccupation 通常指“非职业的活动”，也可在正式语境中指“无职业/未从事正式职业”的状态或分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An activity or role that is not someone’s job or profession; something done outside of paid work.","zh":"非职业（的事情）；不是某人的工作或专业的活动/角色；工作之外做的事。"},"examples":[{"en":"Photography started as a nonoccupation for her, but later it became her career.","zh":"摄影一开始只是她的非职业爱好，但后来成了她的事业。"},{"en":"He listed volunteering as a meaningful nonoccupation on his application.","zh":"他在申请表上把志愿服务列为一项有意义的非职业活动。"}]},{"partOfSpeech":"n.","definition":{"en":"In social science or official writing, a category describing a person who is not engaged in a recognized occupation (for example, not currently employed).","zh":"（社会科学/官方用语）“无职业/未从事正式职业”的类别，用来描述未从事公认职业的人（例如暂时未就业）。"},"examples":[{"en":"The survey separated respondents into occupation and nonoccupation groups.","zh":"该调查把受访者分为“有职业”和“无职业”两组。"},{"en":"The report discussed nonoccupation status without judging its causes.","zh":"报告讨论了“无职业”状态，但并未对其原因作价值判断。"}]}],"synonyms":["hobby","leisure activity","non-work activity","unemployment (formal context)"],"phonetic":"/ˌnɑnˌɑkjəˈpeɪʃən/","extraExplanation":["“non-”是常见前缀，表示“非……、不……”。因此 nonoccupation 字面意思就是“非职业/不属于职业的事”。日常英语里更常用的说法通常是 non-work activity（非工作活动）、hobby（爱好）或 leisure activity（休闲活动）。","写作上，nonoccupation 有时会被认为比较生硬或偏学术/官样语；如果你想表达“没有工作/失业”，更常见的是 unemployed（失业的）或 not currently working（目前没在工作）。"]}
{"word":"nonoccupational","summary":{"en":"Nonoccupational means “not related to a job; outside of work,” often used in medical/insurance contexts (e.g., nonoccupational injury).","zh":"nonoccupational 指“非职业的、与工作无关的（工作之外发生的）”，常用于医疗/保险语境（如 nonoccupational injury）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not connected with someone’s job or work duties; happening outside of work.","zh":"非职业的；与工作/职业职责无关的；发生在工作之外的。"},"examples":[{"en":"He missed the training because of a nonoccupational injury he got while hiking.","zh":"他因为徒步时造成的非职业伤害而错过了培训。"},{"en":"The clinic treats both occupational and nonoccupational health problems.","zh":"这家诊所既治疗职业相关的健康问题，也治疗非职业相关的问题。"},{"en":"The report separates workplace accidents from nonoccupational accidents.","zh":"报告把工作场所事故和非职业事故分开统计。"}]}],"synonyms":["nonwork","nonwork-related","off-the-job","outside-of-work","nonjob-related"],"phonetic":"/ˌnɑnˌɑk.jəˈpeɪ.ʃə.nəl/","extraExplanation":["这个词在美国英语里常见于保险、医疗和人力资源文件，例如：nonoccupational illness（非职业性疾病）、nonoccupational disability（非职业性伤残）、nonoccupational accident（非职业事故）。意思通常是“不是因工作导致、也不是在工作中发生”。","常见对比：occupational（职业相关的/工作导致的） vs. nonoccupational（非职业相关的）。在工伤（workers’ compensation）语境里，这种区分会影响由谁承担费用、走哪种理赔流程。"]}
{"word":"nonoccurrence","summary":{"en":"Nonoccurrence means that something does not happen, often used formally in legal or business contexts.","zh":"nonoccurrence 指“未发生、未出现”，多用于法律或商业等正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fact that something does not happen; the failure of an event to occur","zh":"（某事）未发生；未出现；（事件）没有发生的事实"},"examples":[{"en":"The nonoccurrence of the storm was a relief to everyone in the coastal towns.","zh":"暴风雨没有发生，让沿海城镇的所有人都松了一口气。"},{"en":"The contract becomes void upon the nonoccurrence of that condition by June 1.","zh":"如果到6月1日该条件仍未发生，合同将失效。"}]},{"partOfSpeech":"n.","definition":{"en":"(law/business, formal) the absence of a required event or condition, especially one stated in a contract, policy, or agreement","zh":"（法律/商业，正式用语）约定或要求的事件/条件未发生（尤见于合同、保险条款等）"},"examples":[{"en":"Coverage may be denied due to the nonoccurrence of a triggering event.","zh":"由于触发事件未发生，保险赔付可能会被拒绝。"},{"en":"They argued that the nonoccurrence of the deadline extension meant the original date still applied.","zh":"他们认为延期并未发生，因此仍应适用原定日期。"}]}],"synonyms":["failure to occur","absence","lack of occurrence","nonappearance","nonexistence (in some contexts)"],"phonetic":"/ˌnɑnəˈkɝːəns/","extraExplanation":["“nonoccurrence”是非常正式的名词，常见于合同、保险、法律文件里，用来强调“某个约定事件/条件没有发生”。日常英语更常用：it didn’t happen / the event didn’t occur / the absence of the event。","常见搭配：the nonoccurrence of + 名词（例如 the nonoccurrence of an accident / of a condition / of a triggering event）。","拼写上也常见连字符形式“non-occurrence”，意思相同；是否加连字符通常取决于写作风格或出版规范。"]}
{"word":"nonodoriferous","summary":{"en":"Nonodoriferous means “having no smell; odorless,” and is a formal/scientific word.","zh":"nonodoriferous 表示“无气味的、没有味道的”，用法较正式，常见于科学或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no smell; not giving off an odor.","zh":"无气味的；不散发气味的。"},"examples":[{"en":"The gas is nonodoriferous, so a warning scent is often added for safety.","zh":"这种气体本身无气味，所以出于安全考虑常会添加警示性气味。"},{"en":"They chose a nonodoriferous cleaner so the room wouldn’t smell strongly afterward.","zh":"他们选了无气味的清洁剂，这样房间清洁后就不会留下很重的味道。"}]}],"synonyms":["odorless","inodorous","unscented"],"phonetic":"/ˌnɑnˌoʊdəˈrɪfərəs/","extraExplanation":["non- 是英语里常见的否定前缀，意思是“非、不”。odoriferous 来自 odor（气味）+ -iferous（“带来/产生”的意思），所以 nonodoriferous 就是“不会产生气味的”。","这是比较正式、偏科学/技术写作的词。日常口语更常说 odorless 或 unscented（尤其是指“未添加香味”的产品）。","相关词对比：odorless 强调“没有气味”；unscented 常强调“没有添加香精/香味”，但产品本身可能仍有一点原料味。"]}
{"word":"nonodoriferously","summary":{"en":"“Nonodoriferously” means “without any smell; in an odorless way.”","zh":"“nonodoriferously”意为“无气味地；以不散发气味的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no smell; without giving off an odor.","zh":"无气味地；不散发气味地。"},"examples":[{"en":"The gas is dangerous because it can spread nonodoriferously.","zh":"这种气体很危险，因为它可能无气味地扩散。"},{"en":"The chemical reacted nonodoriferously, so no one noticed it at first.","zh":"这种化学物质反应时无气味，所以一开始没人注意到。"}]}],"synonyms":["odorlessly","without odor","with no smell","unscentedly"],"phonetic":"/ˌnɑnˌoʊdəˈrɪfərəsli/","extraExplanation":["“non-”表示否定（不），与“odoriferous”（有气味的、散发气味的）组合，再加副词后缀“-ly”，构成“nonodoriferously”（以无气味的方式）。","这个词比较少见，更常用、更自然的说法是：“without odor / odorlessly / with no smell”。在科学、技术或较正式的描写中可能会看到“nonodoriferously”。"]}
{"word":"nonodoriferousness","summary":{"en":"Nonodoriferousness means the state or quality of having no smell (odorlessness).","zh":"nonodoriferousness 指“无气味、无臭”的状态或性质（即 odorlessness）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of having no smell; odorlessness","zh":"无气味；无臭（的状态或性质）"},"examples":[{"en":"The lab report noted the sample’s nonodoriferousness, suggesting it released no detectable smell.","zh":"实验室报告指出样品具有无气味性，说明它没有释放出可检测到的气味。"},{"en":"People often assume water has a natural nonodoriferousness, but contamination can change that.","zh":"人们常以为水天生无气味，但污染可能改变这一点。"}]}],"synonyms":["odorlessness","lack of odor","no smell"],"phonetic":"/ˌnɑnˌoʊdəˈrɪfərəsnəs/","extraExplanation":["这个词非常少见、偏书面（甚至有点“炫技”）。日常英语里更常用的是 **odorlessness**（美式拼写）或 **odourlessness**（英式拼写）。","构词拆解：**non-**（不、无）+ **odoriferous**（有气味的）+ **-ness**（名词后缀，表示“性质/状态”）。因此整体意思就是“无气味的性质”。","使用场景多见于技术/正式写作（如化学、材料、环境检测报告）。普通交流里说 **It has no smell / It’s odorless** 更自然。"]}
{"word":"nonodorous","summary":{"en":"“Nonodorous” means having no smell or almost no smell (odorless).","zh":"“nonodorous”表示“（几乎）没有气味的”，相当于“odorless（无臭的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having little or no smell; odorless.","zh":"几乎没有气味的；无臭的。"},"examples":[{"en":"The lab uses a nonodorous solvent to reduce discomfort for workers.","zh":"实验室使用无臭溶剂，以减少工作人员的不适。"},{"en":"Choose a nonodorous cleaner if you’re sensitive to strong scents.","zh":"如果你对浓烈气味敏感，可以选择无臭清洁剂。"}]}],"synonyms":["odorless","unscented","inodorous"],"phonetic":"/ˌnɑnˈoʊdərəs/","extraExplanation":["“Nonodorous”由前缀 non-（表示“没有/不”）+ odorous（“有气味的”）构成，意思非常直观。日常更常见的说法是 “odorless”（美式拼写）或 “odourless”（英式拼写）；“nonodorous”更偏正式、技术/说明书语境（如化学品、清洁剂、材料说明）。"]}
{"word":"nonodorously","summary":{"en":"Nonodorously means “without a noticeable smell.”","zh":"nonodorously 的意思是“无明显气味地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no smell; without a noticeable odor.","zh":"以无气味的方式；闻起来没有（明显）气味。"},"examples":[{"en":"The gel dried nonodorously, so nobody noticed it had been applied.","zh":"凝胶干了以后几乎没有气味，所以没人注意到它被涂过。"},{"en":"Choose a cleaner that works nonodorously if you’re sensitive to strong scents.","zh":"如果你对强烈香味敏感，可以选择无气味（或气味很轻）的清洁剂。"}]}],"synonyms":["odorlessly","without an odor","with no smell"],"phonetic":"/ˌnɑnˈoʊdərəsli/","extraExplanation":["“nonodorously”由 non-（不、无）+ odorous（有气味的）+ -ly（副词后缀）构成，意思就是“没有气味地”。","在日常英语里，这个词比较少见；更常用的表达是 “without an odor / with no smell / odorless”。“nonodorous / odorless”也更常见。"]}
{"word":"nonodorousness","summary":{"en":"Nonodorousness means the state of having no smell (being odorless).","zh":"nonodorousness 指“无气味”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of having no smell; lack of odor","zh":"无气味；没有味道的状态"},"examples":[{"en":"The lab confirmed the chemical’s nonodorousness at room temperature.","zh":"实验室确认该化学品在室温下无气味。"},{"en":"Nonodorousness is important for products used close to the face, like masks and skincare.","zh":"无气味对贴近脸部使用的产品（如口罩和护肤品）很重要。"}]}],"synonyms":["odorlessness","absence of odor","lack of smell","inodorousness"],"phonetic":"ˌnɑnˈoʊdərəsnəs","extraExplanation":["这个词比较少见，常见写法也有 **non-odorousness**（带连字符）或更常用的同义词 **odorlessness** / **lack of odor**。","构词上是 **non-**（不、无）+ **odorous**（有气味的）+ **-ness**（名词后缀，表示“……的性质/状态”）。在科技、工业、材料说明或检测报告里更容易见到。","注意它通常强调“没有（或几乎没有）可察觉的气味”，而不是“气味很淡但仍存在”。如果要表达“几乎闻不到”，也可以用 **near-odorless** / **almost odorless**。"]}
{"word":"nonoecumenic","summary":{"en":"Nonoecumenic (very rare) means “not ecumenical”—not promoting unity or broad cooperation (especially among Christian churches).","zh":"nonoecumenic（很少见）意为“非普世的/非合一的”，指不促进广泛合作或合一（尤指基督宗派之间）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not ecumenic/ecumenical; not aiming at cooperation or unity among different Christian churches or denominations.","zh":"非普世（教会合一）的；不致力于不同基督宗派之间的合作或合一的。"},"examples":[{"en":"Some groups reject ecumenical dialogues and take a strongly nonoecumenic stance toward other denominations.","zh":"有些团体拒绝普世对话，并对其他宗派采取强烈的非普世立场。"},{"en":"The statement was criticized as nonoecumenic because it dismissed other churches as illegitimate.","zh":"这份声明被批评为非普世的，因为它否认其他教会的正当性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Not universal or worldwide in scope; not general.","zh":"（罕见）不具普遍性或世界性的；不广泛的。"},"examples":[{"en":"The author’s approach is intentionally nonoecumenic, focusing on one region’s tradition rather than a global view.","zh":"作者的做法刻意不求普遍性，而是聚焦某一地区的传统，而非全球视角。"}]}],"synonyms":["non-ecumenical","nonecumenical","nonsectarian (near-opposite in some contexts)","sectarian (often related, but not identical)"],"phonetic":"/ˌnɑn.oʊˌɛkjuˈmɛnɪk/","extraExplanation":["这个词非常少见，通常你会看到更常用、也更自然的写法 **non-ecumenical / nonecumenical**（“非普世的；不促进教会合一的”）。","词形里出现的 **oecumenic** 是 **ecumenic** 的拼写变体（带 *oe-* 的形式较偏古典/传统拼写）。因此 **nonoecumenic** 可以理解为 “non- + oecumenic”。","在宗教语境中，*ecumenical* 常与“普世运动/教会合一（ecumenism）”相关；而在较宽泛语境里也可表示“包容多元、面向整体/全球”的意思，所以本词也会引申为“非普遍性的”。"]}
{"word":"nonoecumenical","summary":{"en":"“Nonoecumenical” means “not ecumenical,” especially in religious contexts (not representing or aiming to unite the whole Christian Church).","zh":"“nonoecumenical” 意为“非普世性的”，多用于宗教语境，指不代表或不以联合整个基督教会为目标。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not ecumenical; not intended to unite different Christian churches or represent the whole Christian Church.","zh":"非普世性的；不以联合不同基督宗派或代表整个基督教会为目的的。"},"examples":[{"en":"Some Orthodox writers describe certain Western councils as nonoecumenical.","zh":"一些东正教作者会把某些西方教会会议描述为“非普世性”的。"},{"en":"The document took a nonoecumenical stance, focusing on one tradition rather than inter-church unity.","zh":"这份文件采取了非普世性的立场，更关注某一传统，而不是促进教会间的合一。"}]}],"synonyms":["non-ecumenical","sectarian","denominational","nonuniversal"],"phonetic":"/ˌnɑnˌɛk.juˈmɛn.ɪ.kəl/","extraExplanation":["这个词很少见，更多时候会写成 **non-ecumenical** 或 **non-oecumenical**。其中 **oe** 是英式/学术拼写习惯（源自希腊语/拉丁语转写），美式英语里常简化为 **e**。","在宗教语境里，**ecumenical** 常与“普世大公会议（ecumenical council）”相关，指被认为具有“全教会权威”的会议；因此 **nonoecumenical** 往往用来表示“某个会议/声明不被视为普世性的（不具普世权威或不追求跨宗派合一）”。","日常英语中几乎不用这个词；如果你是在写作或翻译中需要表达，通常用 **not ecumenical**（不普世/不合一取向）或直接用更常见拼写 **non-ecumenical**。"]}
{"word":"nonoffender","summary":{"en":"Nonoffender means a person who has not committed a crime or offense, or describes someone/something as not criminal.","zh":"nonoffender 指“未犯罪者”，也可作形容词表示“未触犯法律的、非犯罪的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has not committed an offense or crime (often used in legal or criminal-justice contexts).","zh":"未犯罪者；未触犯法律的人（常用于法律或刑事司法语境）。"},"examples":[{"en":"The program is designed for nonoffenders who want to avoid future legal trouble.","zh":"该项目面向未犯罪者，帮助他们避免将来惹上法律麻烦。"},{"en":"The report compared outcomes for offenders and nonoffenders.","zh":"报告比较了犯罪者与未犯罪者的结果差异。"}]},{"partOfSpeech":"adj.","definition":{"en":"not having committed an offense; not criminal.","zh":"未触犯法律的；非犯罪的。"},"examples":[{"en":"They focused on nonoffender youth in the community.","zh":"他们把重点放在社区里未违法的青少年身上。"}]}],"synonyms":["law-abiding person","noncriminal","innocent person (context-dependent)"],"phonetic":"/ˌnɑnəˈfɛndɚ/","extraExplanation":["更常见的拼写是 **non-offender**（带连字符），在学术论文、政府报告和法律文件里都能见到；不带连字符的 **nonoffender** 也会用，但相对少一些。","该词通常用于“对比”语境（offenders vs. nonoffenders），用于统计、风险评估、再犯研究或项目对象分类等，语气偏正式。","注意与 **innocent**（无辜的）区别：nonoffender 只强调“没有实施违法/犯罪行为”，不一定涉及某个具体案件中的“无罪/无辜”判定。"]}
{"word":"nonoffensive","summary":{"en":"Nonoffensive means polite or acceptable and unlikely to offend people.","zh":"nonoffensive 指“礼貌、可接受、不太可能冒犯别人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not likely to offend, upset, or cause anger; polite and acceptable.","zh":"不冒犯人的；不得罪人的；礼貌且容易被接受的。"},"examples":[{"en":"We kept the discussion nonoffensive so everyone felt comfortable.","zh":"我们让讨论保持不冒犯，这样大家都会觉得自在。"},{"en":"Try to choose nonoffensive words when talking about sensitive topics.","zh":"谈到敏感话题时，尽量选择不冒犯的措辞。"}]}],"synonyms":["inoffensive","harmless","acceptable","polite","tactful"],"phonetic":"/ˌnɑn.əˈfɛn.sɪv/","extraExplanation":["“non-”是英语里常见的否定前缀，表示“非……/不……”。所以 nonoffensive = not offensive（不冒犯的）。","它常用于描述语言、玩笑、评论、内容（content）、图像（images）等，表示“不会惹人不舒服/不会引起反感”。","拼写上也常见作 non-offensive（带连字符），尤其在较正式的写作里；意思不变。"]}
{"word":"nonoffensively","summary":{"en":"“Nonoffensively” means doing or saying something in a way that does not offend people.","zh":"“nonoffensively”表示以不冒犯他人的方式去做或说某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not offend or upset anyone; in a polite, acceptable, or harmless manner.","zh":"以不冒犯他人、不得罪人的方式；礼貌、可接受或无害地。"},"examples":[{"en":"He tried to disagree nonoffensively, focusing on the facts instead of criticizing anyone.","zh":"他尽量不冒犯地表达不同意见，把重点放在事实而不是批评任何人。"},{"en":"The comedian kept the jokes nonoffensively light, so everyone could enjoy the show.","zh":"这位喜剧演员让笑话保持轻松不冒犯，让每个人都能享受演出。"},{"en":"If you’re unsure, ask nonoffensively: “Is it okay if I call you by this name?”","zh":"如果你不确定，可以不冒犯地问：“我这样称呼你可以吗？”"}]}],"synonyms":["inoffensively","politely","tactfully","respectfully","considerately"],"phonetic":"/ˌnɑn.əˈfɛn.sɪv.li/","extraExplanation":["这个词由 non-（“不、非”）+ offensively（“冒犯地”）构成，常用于强调“说法/表达方式”很谨慎、不得罪人。","在日常写作里也可以用更常见的表达替换，比如 politely（礼貌地）、tactfully（委婉地）、inoffensively（不冒犯地；更常见一些）。"]}
{"word":"nonoffensiveness","summary":{"en":"Nonoffensiveness means the quality of not being offensive—unlikely to upset or insult people.","zh":"Nonoffensiveness 指“不冒犯性/不具攻击性”，强调言行不太会让人不快或受辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being offensive; the state of being unlikely to upset, insult, or shock people","zh":"不冒犯性；不具攻击性；（言行）不太可能让人不快、受辱或震惊的特质"},"examples":[{"en":"The company rewrote the ad to improve its nonoffensiveness for a wider audience.","zh":"公司重写了广告文案，以提升其对更广泛受众的“不冒犯性”。"},{"en":"In a multicultural classroom, teachers often aim for clarity and nonoffensiveness.","zh":"在多元文化的课堂里，老师通常会追求表达清晰并尽量不冒犯他人。"}]}],"synonyms":["inoffensiveness","harmlessness","tactfulness","politeness","neutrality"],"phonetic":"/ˌnɑnəˈfɛnsɪvnəs/","extraExplanation":["“nonoffensiveness”是由 non-（不）+ offensive（冒犯的）+ -ness（名词后缀，表示“……性/……的状态”）组成，意思是“不会冒犯人的性质/程度”。","这个词在日常口语里不算常见，更常用的表达包括：“not offensive / inoffensive / unobjectionable / polite / neutral”。在写作中用“nonoffensiveness”会显得更正式、偏学术或偏政策/媒体语境。","注意：追求“nonoffensiveness”通常强调“避免冒犯”，但不一定等于“有趣”或“有个性”；在广告、公共沟通、教材、职场邮件等场景里常被讨论。"]}
{"word":"nonofficeholder","summary":{"en":"A nonofficeholder is a person who does not currently hold an official position; it can also describe someone who is not in office.","zh":"nonofficeholder 指“目前不担任公职的人/非现任官员”，也可作形容词表示“非在任的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not currently hold an official position (especially an elected or government office).","zh":"（尤指在政治或政府语境中）不担任公职的人；非现任官员。"},"examples":[{"en":"The committee includes both officeholders and nonofficeholders from the community.","zh":"该委员会既包括现任官员，也包括社区中的非公职人员。"},{"en":"As a nonofficeholder, she can still campaign and speak at events, but she does not have official authority.","zh":"作为非公职人员，她仍然可以参加竞选活动并在活动上发言，但她没有正式职权。"}]},{"partOfSpeech":"adj.","definition":{"en":"not holding an official position; not currently in office.","zh":"不担任公职的；非现任的。"},"examples":[{"en":"Nonofficeholder candidates often rely more on volunteers than on government staff.","zh":"非现任候选人往往更依赖志愿者，而不是政府工作人员。"}]}],"synonyms":["private citizen","non-incumbent","outsider (politics)"],"phonetic":"/ˌnɑnˈɔfɪsˌhoʊldɚ/","extraExplanation":["这个词更常见的写法是带连字符的 **non-officeholder**；不带连字符（nonofficeholder）也能见到，但在正式写作里通常建议用连字符以便阅读。","使用场景多见于政治、选举、党内规则或新闻报道，用来区分“现任官员/在任者（officeholder）”与“没有公职身份的人（non-officeholder）”。","注意它强调的是“目前不在任/不担任公职”，并不一定表示这个人从未当过官（可能是卸任者、落选者或普通公民）。"]}
{"word":"nonofficeholding","summary":{"en":"Nonofficeholding means not holding an official position; it can also refer to a person who does not hold one.","zh":"nonofficeholding 指“不担任公职/职务的”；也可指“不担任公职/职务的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not holding a public office or official position (especially in government or an organization)","zh":"不担任公职的；不担任（官方/组织）职务的"},"examples":[{"en":"Only nonofficeholding members may vote in this committee election.","zh":"只有不担任职务的成员才可以参加这次委员会选举投票。"},{"en":"The rules apply to both officeholding and nonofficeholding staff.","zh":"这些规定既适用于担任职务的员工，也适用于不担任职务的员工。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who does not hold a public office or official position","zh":"不担任公职的人；不担任（官方/组织）职务的人"},"examples":[{"en":"The policy affects officeholders and nonofficeholders differently.","zh":"这项政策对担任公职者和不担任公职者的影响不同。"}]}],"synonyms":["non-office-holding","not in office","without office","non-officeholder"],"phonetic":"/ˌnɑnˈɔfɪsˌhoʊldɪŋ/","extraExplanation":["这个词更常见的写法是 **non-office-holding**（带连字符）或分开写 **non office-holding**。在政治、工会、协会章程等正式语境里常用，用来区分 **officeholding（在任/担任职务）** 和 **nonofficeholding（不在任/不担任职务）**。","它通常强调“是否担任职位/职务”，不一定表示“是否在办公室工作”。因此不要把它理解成“非办公室岗位”。"]}
{"word":"nonofficial","summary":{"en":"Nonofficial means “not official; not authorized or recognized by an authority.” In everyday English, “unofficial” is more common.","zh":"nonofficial 意为“非官方的；未经授权或承认的”。日常英语里更常用 unofficial。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not officially approved, recognized, or authorized by an organization, government, or authority","zh":"非官方的；未经官方批准、承认或授权的"},"examples":[{"en":"This is a nonofficial translation and may contain errors.","zh":"这是一个非官方译本，可能有错误。"},{"en":"The group shared nonofficial results before the final count was released.","zh":"在最终计票公布前，该组织分享了非官方结果。"}]}],"synonyms":["unofficial","not official","unauthorized","unendorsed","informal"],"phonetic":"/ˌnɑnəˈfɪʃəl/","extraExplanation":["“nonofficial”在实际英语中不如“unofficial”常见，更自然、更常用的表达通常是 **unofficial**（非官方的）。","拼写上也常见 **non-official**（带连字符）用于强调“非官方性质”。在正式写作里，多数风格指南更倾向用“unofficial”或写成“not official”。"]}
{"word":"nonofficially","summary":{"en":"Nonofficially means “not in an official or formally approved way.”","zh":"nonofficially 表示“非官方地；非正式地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not formally approved, recognized, or announced by an official authority.","zh":"以非正式方式；未经官方批准、承认或发布地。"},"examples":[{"en":"Nonofficially, the two companies have agreed to cooperate, but nothing has been announced yet.","zh":"据非官方说法，两家公司已经同意合作，但尚未正式公布。"},{"en":"He was nonofficially chosen as the team leader because everyone trusted him.","zh":"他被大家在非正式情况下推为队长，因为大家都信任他。"}]}],"synonyms":["unofficially","informally","off the record (in some contexts)","according to unofficial sources (phrase)"],"phonetic":"/ˌnɑn.əˈfɪʃ.əl.i/","extraExplanation":["“nonofficially”在现代英语里不算特别常见；更自然的表达通常是：**unofficially**（最常用）、**off the record**（非正式/不公开引用）、**informally**（随意、非正式）、或 **according to unofficial sources**（据非官方消息）。","拼写提示：**non-** 是前缀，表示“非……/不是……”。“nonofficially”= non- + officially（官方地）。不过在实际写作中，英语更偏好用 **unofficially** 来表达同样意思。"]}
{"word":"nonofficinal","summary":{"en":"Nonofficinal means not officially recognized in a pharmacopoeia or not accepted for medicinal use.","zh":"nonofficinal 指“非药典的；非正式药用的”，即未被药典收载或未被认可用于药物用途。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not officinal; not officially recognized in a pharmacopoeia or not used/approved as a medicinal drug.","zh":"非药典的；非正式药用的（不被药典收载，或不作为/不被认可为药物使用）。"},"examples":[{"en":"This herb is considered nonofficinal, so it isn’t listed in the national pharmacopoeia.","zh":"这种草药被认为是非药典的，因此没有收载在国家药典中。"},{"en":"The book distinguishes between officinal and nonofficinal plant species.","zh":"这本书区分了药典植物与非药典植物。"}]}],"synonyms":["unofficial","non-pharmacopoeial","not pharmacopoeial"],"phonetic":"/ˌnɑnəˈfɪʃənəl/","extraExplanation":["“officinal”常见于药学/植物学语境，原意与“药房、药柜（药师配药）”相关，后来引申为“被药典正式收载、认可用于药用”。因此 nonofficinal 就是“未被药典认可/未正式药用”的意思。","该词比较学术与专业，多出现在植物学、药用植物目录、药典对照等文本；日常英语里通常会用 “not in the pharmacopoeia / not officially recognized as medicinal” 来表达。"]}
{"word":"nonogenarian","summary":{"en":"A nonogenarian is someone aged 90–99; it can also describe something related to such a person.","zh":"nonogenarian 指90到99岁的人（九旬老人），也可作形容词表示“与九旬老人有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is between 90 and 99 years old.","zh":"九旬老人；90到99岁之间的人。"},"examples":[{"en":"My great-aunt became a nonogenarian last year and still lives independently.","zh":"我姑婆去年成了九旬老人，但仍然能独立生活。"},{"en":"The city honored a group of nonogenarians for their community service.","zh":"这座城市表彰了一群九旬老人，感谢他们的社区服务。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a person who is between 90 and 99 years old.","zh":"与九旬（90到99岁）有关的；九旬老人的。"},"examples":[{"en":"He gave a nonogenarian marathon runner a standing ovation.","zh":"他为一位九旬马拉松跑者起立鼓掌。"}]}],"synonyms":["person in their nineties","ninety-something"],"phonetic":"/ˌnɑːnəˈdʒɛnəriən/","extraExplanation":["词源提示：non-（表示“九”，来自拉丁语词根）+ -genarian（表示“……岁的人”，常见于 octogenarian 八旬、centenarian 百岁）。因此 nonogenarian 指“九旬的人”。","用法小贴士：这是比较正式、书面语的词，日常口语更常说 “in their nineties / a person in their nineties（九十多岁的人）”。"]}
{"word":"nonohmic","summary":{"en":"Nonohmic describes a material/device whose voltage–current relationship is nonlinear (it does not follow Ohm’s law).","zh":"nonohmic 指材料或器件的电压—电流关系是非线性的，不符合欧姆定律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(physics/electronics) Not obeying Ohm’s law; having a nonlinear relationship between voltage and current (the resistance is not constant).","zh":"（物理/电子）不遵守欧姆定律的；电压与电流呈非线性关系（电阻不是常数）的。"},"examples":[{"en":"A diode is a classic example of a nonohmic device because its current does not increase linearly with voltage.","zh":"二极管是典型的非欧姆器件，因为它的电流不会随电压线性增加。"},{"en":"At low temperatures, the contact became nonohmic, so the I–V curve was no longer a straight line.","zh":"在低温下，这个接触变成了非欧姆接触，因此 I–V 曲线不再是直线。"}]}],"synonyms":["nonlinear","non-Ohmic","non-ohmic"],"phonetic":"/ˌnɑnˈoʊmɪk/","extraExplanation":["在教材和论文里也常写作 **non-ohmic**（加连字符）或 **non-Ohmic**（把 Ohmic 的 O 大写）。三种写法通常意思相同，但写作规范会因期刊而异。","它常用来描述器件或界面接触（如金属—半导体接触）：“ohmic contact（欧姆接触）”表示近似线性，“nonohmic/non-ohmic contact（非欧姆接触）”表示明显非线性。","判断是否“nonohmic”通常看 I–V 曲线：若不是直线、或等效电阻随电压/电流变化明显，就属于非欧姆行为。"]}
{"word":"nonoic","summary":{"en":"Nonoic is a rare chemistry adjective, mostly seen in “nonoic acid,” meaning nonanoic (pelargonic) acid.","zh":"nonoic 是较少见的化学形容词，多见于 “nonoic acid”，指 nonanoic acid（壬酸），也叫 pelargonic acid。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to nonane; most commonly used in the term **nonoic acid** (= **nonanoic acid**, also called **pelargonic acid**).","zh":"（化学）与**壬烷（nonane）**有关的；最常见于术语 **nonoic acid**（= **nonanoic acid 壬酸**，也称 **pelargonic acid 佩拉贡酸**）。"},"examples":[{"en":"In older chemistry texts, you may see **nonoic acid** used for **nonanoic (pelargonic) acid**.","zh":"在较早的化学资料中，你可能会看到用 **nonoic acid** 来指 **nonanoic acid（pelargonic acid）**。"},{"en":"The label lists **nonanoic acid**; some references call the same compound **nonoic acid**.","zh":"标签上写的是 **nonanoic acid**；有些资料会把同一种化合物称为 **nonoic acid**。"}]}],"synonyms":["nonanoic","pelargonic (in: pelargonic acid)"],"phonetic":"noʊˈnoʊɪk","extraExplanation":["“nonoic”主要是化学命名里的构词：**non-** 表示“9”（与 nonane / nonanoic 对应的碳数体系），**-oic acid** 常用来表示“羧酸”。因此 **nonoic acid** 通常就是指 **nonanoic acid（壬酸）**，也常见别名 **pelargonic acid**。日常英语里几乎不会单独用 nonoic。"]}
{"word":"nonoily","summary":{"en":"Nonoily (more commonly written non-oily) means “not oily; not greasy,” often used for skincare, cosmetics, or food.","zh":"nonoily（更常写作 non-oily）意思是“不油的；不油腻的”，常用于护肤、化妆品或食物等描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not oily; not containing much oil; not greasy to the touch or in texture","zh":"不油的；含油量不高的；不油腻的（触感或质地）"},"examples":[{"en":"This sunscreen has a nonoily finish, so it won’t make your face look shiny.","zh":"这款防晒是“不油”的收尾效果，所以不会让脸看起来发亮。"},{"en":"I prefer a nonoily moisturizer because my skin gets greasy easily.","zh":"我更喜欢不油的保湿霜，因为我的皮肤很容易出油。"},{"en":"Choose a nonoily salad dressing if you want a lighter taste.","zh":"如果你想要更清爽的口味，可以选不油的沙拉酱。"}]}],"synonyms":["non-greasy","not greasy","lightweight","oil-free"],"phonetic":"/ˌnɑnˈɔɪli/","extraExplanation":["“nonoily”更常见的写法是 **non-oily**（带连字符）或 **nonoily**（合写）。在护肤品、化妆品、食品包装上两种都可能出现；正式写作里 **non-oily** 更清晰。","含义上通常强调“使用后不油腻/不泛油光（non-greasy）”，不一定表示“完全不含油（oil-free）”。如果产品明确“无油”，英文更常写 **oil-free**。"]}
{"word":"nonolfactories","summary":{"en":"Nonolfactory means “not related to the sense of smell.”","zh":"nonolfactory 的意思是“与嗅觉无关的；非嗅觉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to the sense of smell (olfaction).","zh":"与嗅觉无关的；不是嗅觉的。"},"examples":[{"en":"The study compared olfactory and nonolfactory cues in food choice.","zh":"这项研究比较了食物选择中的嗅觉线索与非嗅觉线索。"},{"en":"Taste includes both olfactory and nonolfactory sensations.","zh":"味觉既包含嗅觉成分，也包含非嗅觉的感觉。"}]}],"synonyms":["non-olfactory","not related to smell"],"phonetic":"/ˌnɑn.ɔlˈfæk.tɚ.i/","extraExplanation":["你输入的 **nonolfactories** 在常见词典中通常不会作为标准词条出现；更常见、规范的形式是 **nonolfactory**（形容词）。","构词法：**non-**（“非、不”）+ **olfactory**（“嗅觉的”）。它常用于医学、神经科学、心理学等语境，描述“不是由嗅觉系统参与/产生”的信息或刺激（例如视觉、触觉、味觉中的非嗅觉部分）。","注意区别：**nonolfactory** 是“与嗅觉无关”，不等于 **odorless**（“无气味的”）。某物可能有气味，但在讨论中你关注的是非嗅觉因素，因此仍可称为 nonolfactory。"]}
{"word":"nonolfactory","summary":{"en":"Nonolfactory means “not related to the sense of smell.”","zh":"nonolfactory 意为“与嗅觉无关的；不涉及闻气味的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to the sense of smell (olfaction); not involving smelling.","zh":"与嗅觉无关的；不涉及闻气味的。"},"examples":[{"en":"The study focused on nonolfactory cues, such as sound and touch.","zh":"这项研究关注与嗅觉无关的线索，比如声音和触觉。"},{"en":"Some chemicals can cause nonolfactory irritation in the nose even if they don’t smell strong.","zh":"有些化学物质即使气味不强，也可能在鼻腔引起与嗅觉无关的刺激。"}]}],"synonyms":["not smell-related","non-odor-related"],"phonetic":"ˌnɑn.oʊlˈfæk.tər.i","extraExplanation":["这个词更常见的写法是 **non-olfactory**（带连字符），在学术写作里更规范；也有人写作 nonolfactory。","**olfactory** 来自拉丁语词根，意思是“嗅觉的”。加上前缀 **non-** 表示“非……、不……”（如 nonverbal 非语言的）。","常见搭配：**non-olfactory cues/signals**（非嗅觉线索/信号）、**non-olfactory irritation**（非嗅觉性刺激，指刺痛、灼烧等感觉而非“闻到的气味”）。"]}
{"word":"nonoligarchic","summary":{"en":"Nonoligarchic means “not oligarchic”—not ruled or controlled by a small elite group.","zh":"nonoligarchic 意为“非寡头统治的”，指不由少数精英集团把持或控制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not oligarchic; not controlled by a small, powerful group of people.","zh":"非寡头统治的；不由少数有权势的人控制的。"},"examples":[{"en":"The reform movement promised a more nonoligarchic government with broader public participation.","zh":"这场改革运动承诺建立一个更非寡头统治、公众参与更广泛的政府。"},{"en":"They argued that the party’s internal elections should be transparent and nonoligarchic.","zh":"他们主张该党内部选举应当透明、避免寡头化。"}]}],"synonyms":["non-oligarchic","democratic","pluralistic","broad-based","inclusive"],"phonetic":"/ˌnɑnˌɑlɪˈɡɑr.kɪk/","extraExplanation":["这个词比较少见，多用于政治学/社会学写作。它由前缀 non-（“不、非”）+ oligarchic（“寡头统治的”）构成，表达“不是由少数人把持权力”的意思。","常见的更自然表达包括：non-oligarchic（带连字符）、not oligarchic、more democratic（更民主的）、broad-based（基础更广泛的）。在正式写作里，用带连字符的 non-oligarchic 往往更常见、更易读。","相关概念：oligarchy（寡头政治/寡头统治）、oligarch（寡头/权贵）、anti-oligarchic（反寡头的，强调“反对寡头力量”而不只是“不是寡头”）。"]}
{"word":"nonoligarchical","summary":{"en":"Nonoligarchical means “not oligarchical”—power is not controlled by a small elite group.","zh":"nonoligarchical 意为“非寡头统治的”，强调权力不由少数精英集团控制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not oligarchical; not governed by a small, powerful group (an oligarchy).","zh":"非寡头统治的；不由少数掌权者（寡头集团）控制或支配的。"},"examples":[{"en":"The reform movement argued for a more nonoligarchical political system, where power is widely shared.","zh":"改革运动主张建立更非寡头统治的政治体制，让权力更广泛地被分享。"},{"en":"They described the organization as nonoligarchical because major decisions require votes from all members.","zh":"他们称该组织为非寡头式的，因为重大决定需要全体成员投票。"}]}],"synonyms":["non-oligarchic","non-oligarchical","non-elitist","democratic","pluralistic"],"phonetic":"/ˌnɑnˌɑlɪˈɡɑrkɪkəl/","extraExplanation":["“nonoligarchical”由前缀 non-（“非、不”）+ oligarchical（“寡头统治的”）构成，意思就是“不是寡头统治的/不呈寡头化的”。","这个词在现代英语里比较少见；更常见、更自然的写法是 **non-oligarchic** 或 **non-oligarchical**（带连字符），在学术或政治评论中更常用。","语境上常用于讨论政治制度、政党结构、企业治理或社团决策机制，强调“权力不集中在少数人手里”。"]}
{"word":"nonomad","summary":{"en":"“nonomad” usually means a non-nomad: someone (or something) that is not nomadic and tends to live in one fixed place.","zh":"「nonomad」通常指「非游牧者／非游牧的」：不是游牧型、傾向定居在固定地點的人或生活方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a nomad; someone who lives in one place rather than moving around seasonally or frequently","zh":"非游牧者；不過游牧生活的人；較固定居住在某地的人"},"examples":[{"en":"Unlike the nomads, most villagers were non-nomads who stayed year-round.","zh":"與游牧者不同，多數村民是非游牧者，全年都住在同一個地方。"},{"en":"He’s a non-nomad at heart—he likes having the same home base.","zh":"他骨子裡不是游牧型的人——他喜歡有固定的家。"}]},{"partOfSpeech":"adj.","definition":{"en":"not nomadic; having a settled lifestyle (more commonly written as “non-nomadic”)","zh":"非游牧的；定居型的（更常寫作 non-nomadic）"},"examples":[{"en":"The region has both nomadic and nonomad communities.","zh":"這個地區同時有游牧與非游牧（定居）的社群。"},{"en":"She prefers a non-nomadic routine with stable work and neighbors.","zh":"她偏好非游牧、穩定的生活作息，有固定工作與鄰里關係。"}]}],"synonyms":["non-nomadic","settled","sedentary","resident"],"phonetic":"/ˌnɑnˈnoʊmæd/","extraExplanation":["「nonomad」不是很常見、也不算標準拼法；更常見的寫法是 **non-nomad**（名詞）或 **non-nomadic**（形容詞）。","在學術或新聞語境中，談到「定居生活」也常直接用 **sedentary**（定居的）來表達，語氣更自然。"]}
{"word":"nonomissible","summary":{"en":"“Nonomissible” (very rare) means “not omissible,” i.e., something that cannot/should not be left out.","zh":"“nonomissible”（非常少见）大致相当于“not omissible”，表示“不可省略、不能删去”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not able to be omitted; not something you are allowed (or expected) to leave out","zh":"不可省略的；不能被删去的（指按规则或逻辑不应被省去的内容）"},"examples":[{"en":"In the final report, the safety warning is nonomissible.","zh":"在最终报告里，安全警告是不可省略的。"},{"en":"Some steps in the procedure are nonomissible because they prevent contamination.","zh":"流程中的某些步骤不可省略，因为它们能防止污染。"}]}],"synonyms":["unomittable","not omissible","cannot be omitted","required","mandatory"],"phonetic":"/ˌnɑn.əˈmɪs.ə.bəl/","extraExplanation":["“nonomissible”非常罕见，很多词典里找不到；更常见、更自然的表达是“non-omissible”（加连字符）或直接用“not omissible / cannot be omitted”。","它通常可理解为 non-（否定前缀）+ omissible（可省略的）。而“omissible”本身也偏正式、偏少见。","容易和拼写相近但意思不同的词混淆：例如“nonmiscible”（不可混溶的，多用于化学）以及“inadmissible / nonadmissible”（不可采纳的，多用于法律/证据语境）。如果你告诉我你看到它的句子语境，我可以帮你判断它到底想表达哪一个词。"]}
{"word":"nonomission","summary":{"en":"Nonomission means “not leaving something out; failure to omit.” It’s rare and formal.","zh":"nonomission 指“未省略/未删去；未能省略”。用法较少见、偏正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of not leaving something out; a failure to omit (exclude) something.","zh":"不省略；未能省去（不该保留的内容）；把某事“没有删掉/没有略去”。"},"examples":[{"en":"The report’s nonomission of key dates made the timeline easy to follow.","zh":"报告没有省略关键日期，使时间线很清晰。"},{"en":"In editing, nonomission of unnecessary details can slow the pace of the story.","zh":"在编辑中，不该留的细节没有删掉，会拖慢故事节奏。"},{"en":"The contract requires nonomission of safety warnings in every copy.","zh":"合同要求每一份文件都不得遗漏安全警告。"}]}],"synonyms":["failure to omit","not leaving out","inclusion","retention"],"phonetic":"/ˌnɑnəˈmɪʃən/","extraExplanation":["这个词很少见，多出现在较正式或学术/宗教语境里（表示“没有省略/没有删去”）。日常英语里更常用：the failure to omit、not leaving out、including (something) 等更自然的表达。","构词上是 non-（不/非）+ omission（省略/遗漏）。有时也会写成 non-omission（带连字符），意思相同。"]}
{"word":"nononerous","summary":{"en":"Nononerous means “not burdensome; not involving heavy obligations,” often used in formal or legal contexts.","zh":"nononerous 表示“不会造成负担的；（尤指条款/义务）不苛刻、不繁重的”，常见于正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not onerous; not burdensome, difficult, or troublesome.","zh":"不繁重的；不造成负担的；不麻烦的。"},"examples":[{"en":"The paperwork is nononerous and should take only a few minutes.","zh":"这些文书工作不繁重，应该只需要几分钟。"},{"en":"They negotiated a nononerous schedule so the team could still rest on weekends.","zh":"他们谈出一个不太有负担的排班，让团队周末还能休息。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in legal/business contexts) Not involving heavy obligations that outweigh the benefits.","zh":"（常用于法律/商业语境）义务不沉重、不会让负担大于收益的（如合同条款）。"},"examples":[{"en":"The lawyer described the lease terms as nononerous for the tenant.","zh":"律师说这份租约条款对承租人而言并不苛刻。"},{"en":"They wanted a nononerous agreement that left room for future changes.","zh":"他们希望达成一份负担不重、又能为未来调整留空间的协议。"}]}],"synonyms":["not burdensome","manageable","not demanding","light","easygoing"],"phonetic":"/ˌnɑnˈɑnərəs/","extraExplanation":["“nononerous”由前缀 non-（不、非）+ onerous（繁重的）构成，意思就是“not onerous”。在正式写作里，更常见的写法是带连字符的 **non-onerous**。","“onerous”来自拉丁语 *onus*（负担）。因此这个词常出现在合同、租约、义务等话题里，用来强调“不会造成沉重义务/成本”。","近义表达（更常用）：**not burdensome**, **manageable**, **not demanding**, **light**（语气较口语）。反义词：**onerous**, **burdensome**, **oppressive**。"]}
{"word":"nononerously","summary":{"en":"Nononerously means “in a way that is not burdensome or difficult.”","zh":"nononerously 表示“以不繁重、不造成负担的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is **not burdensome, difficult, or troublesome**; without imposing a heavy duty or cost.","zh":"以**不繁重、不费力、不过分麻烦**的方式；不造成沉重负担地。"},"examples":[{"en":"The new reporting rule is designed to be followed **nononerously** by small businesses.","zh":"这项新的申报规定旨在让小企业也能**不太费力地**遵守。"},{"en":"We revised the contract so the requirements could be met **nononerously** and on time.","zh":"我们修改了合同，让这些要求能在不造成太大负担的情况下按时完成。"}]}],"synonyms":["without undue burden","with minimal effort","easily","not onerously","unburdensomely"],"phonetic":"/ˌnɑnˈɑnɚəsli/","extraExplanation":["“nononerously”非常少见，更多时候人们会写成 **non-onerously**（带连字符）或直接改用更常见的表达，如 **without undue burden / easily / with minimal effort / not onerously**。","它来自 **onerous**（意为“繁重的、麻烦的”）→ **onerously**（“繁重地”），再加前缀 **non-** 表示否定。法律、政策、合规或合同语境里偶尔会为了“正式/精确”而造出这种词。","写作建议：如果不是在非常正式的文件里，优先用更自然的替换说法；读者也更容易理解。"]}
{"word":"nononerousness","summary":{"en":"Nononerousness means the quality of not being burdensome—something is manageable and not hard to do.","zh":"nononerousness 指“不会造成负担的性质”，强调某事不繁重、可管理、容易完成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being onerous; the state of being easy to accept, manage, or carry out (not burdensome).","zh":"不繁重；不苛重；不造成负担的状态（指某事不难接受、不难完成）。"},"examples":[{"en":"The nononerousness of the new reporting process surprised the team—it took only a few minutes.","zh":"新的填报流程并不繁重，这让团队很惊讶——只花了几分钟。"},{"en":"To encourage participation, the organizers focused on the nononerousness of the tasks.","zh":"为了鼓励更多人参与，组织者强调这些任务并不费力、不会造成负担。"}]}],"synonyms":["ease","manageability","lightness","lack of burden","not being onerous"],"phonetic":"/ˌnɑnˈɑnərəsnəs/","extraExplanation":["这个词非常少见，更多时候人们会用更自然的表达：\"not burdensome\" / \"manageable\" / \"not demanding\"，或名词形式 \"ease\"、\"lightness\"、\"manageability\"。","构词上可以拆开理解：onerous（繁重的、苛重的）→ non-（不）+ onerous → nononerous（不繁重的）→ nononerousness（不繁重这一性质）。在正式、法律或政策文体里偶尔会出现这种“把形容词再名词化”的写法。","语感提示：因为它很长、很“书面”，口语或一般写作中用它可能显得生硬；除非你刻意追求非常正式、精确的语气。"]}
{"word":"nonopacities","summary":{"en":"“Nonopacities” means plural instances of non-opacity—states or areas that are not opaque (i.e., transparent/clear), often used in technical writing.","zh":"“nonopacities”指“非不透明”的复数：透明/清澈的状态或区域，多见于技术性表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state(s) of not being opaque; transparency or clearness (plural form).","zh":"不透明的反面；透明、清澈的状态（复数形式）。"},"examples":[{"en":"The designer preferred materials with nonopacities so light could pass through.","zh":"设计师更喜欢具有透明性的材料，这样光线可以透过。"},{"en":"Different nonopacities in the glass created subtle changes in brightness.","zh":"玻璃不同程度的透明性造成了亮度的细微变化。"}]},{"partOfSpeech":"n.","definition":{"en":"In technical contexts (e.g., imaging or materials science), areas or features that do not appear as opacity; regions that remain clear rather than clouded (plural).","zh":"在技术语境（如影像或材料科学）中，指不呈现为“致密/遮挡”的部分；保持清晰而非浑浊的区域（复数）。"},"examples":[{"en":"The report highlighted nonopacities in the sample, suggesting fewer impurities.","zh":"报告指出样品中呈现的透明区域，暗示杂质更少。"}]}],"synonyms":["transparencies","clarities","clearnesses"],"phonetic":"/ˌnɑn oʊˈpæsətiz/","extraExplanation":["这个词很少见，通常是由前缀 non-（“不、非”）+ opacity（“不透明；遮蔽；浑浊”）构成；nonopacities 是其复数形式。","日常英语里更常用的表达是 transparency / clarity（“透明度/清晰度”），或用 not opaque / clear 来改写；nonopacity / nonopacities 更像技术写作或刻意的对照用法。","如果你是在写作中想表达“不同程度的透明/半透明”，也可以考虑用 varying transparency / different levels of opacity（更自然）。"]}
{"word":"nonopacity","summary":{"en":"Nonopacity means a lack of opacity—being transparent or not blocking light (and sometimes, in medical imaging, not blocking X-rays).","zh":"nonopacity 指“缺乏不透明性”，即透明、可透视；在医学影像中有时指“不阻挡X光、不显影”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of opacity; the quality of being transparent or see-through (often used in technical or scientific writing).","zh":"不透明性的缺乏；透明、可透视的性质（常见于技术或科学语境）。"},"examples":[{"en":"The designer chose glass for its nonopacity, allowing natural light to pass through.","zh":"设计师选择玻璃是因为它具有非不透明性（透明性），可以让自然光穿透。"},{"en":"In the report, increased nonopacity of the solution suggested it had become clearer over time.","zh":"报告中提到溶液的非不透明性增强，说明它随着时间变得更清澈。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical imaging) the state of not appearing opaque on an X-ray or scan; radiolucency (less common).","zh":"（医学影像）在X光或扫描中不呈现不透光/不显影的状态；透射性（较少见）。"},"examples":[{"en":"The radiologist noted nonopacity in the area, meaning the region did not block the X-rays strongly.","zh":"放射科医生记录该区域呈现非不透明性，表示该处对X光的阻挡不强。"}]}],"synonyms":["transparency","clearance","lack of opacity","translucency","radiolucency"],"phonetic":"/ˌnɑn.oʊˈpæs.ə.ti/","extraExplanation":["“nonopacity”在日常英语里不常用，更常见的表达是“transparency（透明性）”或“lack of opacity（缺乏不透明性）”。写作时如果不是技术语境，用“transparency”通常更自然。","在医学影像语境里，人们更常用“radiolucent / radiolucency（透射的/透射性）”来表达“在X光下不显影或不太显影”。"]}
{"word":"nonopaque","summary":{"en":"Nonopaque means “not opaque,” usually describing something that lets light pass through (transparent or translucent). It can also mean “clear and easy to understand,” though that use is less common.","zh":"nonopaque 意为“非不透明”，通常指能透光的（透明或半透明）。也可引申为“表达不晦涩、清楚易懂”，但较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not opaque; allowing light to pass through (transparent or partly transparent)","zh":"不透明的反义：非不透明的；（完全或部分）透光的（透明或半透明）"},"examples":[{"en":"The lab used a nonopaque cover so the sensor could detect light changes.","zh":"实验室使用了非不透明的盖子，这样传感器就能检测到光线变化。"},{"en":"Choose nonopaque curtains if you want the room to feel brighter during the day.","zh":"如果你想让房间白天更明亮，可以选择非不透明（透光）的窗帘。"}]},{"partOfSpeech":"adj.","definition":{"en":"not difficult to understand; clear rather than confusing (figurative, less common)","zh":"（引申义，不太常见）不晦涩的；清楚易懂的"},"examples":[{"en":"Her explanation was nonopaque and easy to follow.","zh":"她的解释不晦涩，很容易理解。"}]}],"synonyms":["transparent","translucent","see-through","clear"],"phonetic":"/ˌnɑn.oʊˈpeɪk/","extraExplanation":["“nonopaque”更常见的写法是带连字符的“non-opaque”。在学术/技术写作里也可能直接写“transparent / translucent”，通常更自然、更常用。","“opaque”表示“完全不透光/不透明”；而“non-opaque”不一定等于“完全透明”，很多时候也包含“半透明（translucent）”这种“部分透光”的情况，具体取决于上下文（如材料、玻璃、薄膜、医学影像等）。"]}
{"word":"nonopening","summary":{"en":"“Nonopening” means something does not open or does not begin as planned; it’s most often used as an adjective, and “non-opening” (with a hyphen) is common in writing.","zh":"“nonopening”表示“打不开/未开启”或“未能开业/开幕”；最常作形容词使用，书面语中常写作“non-opening”（带连字符）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not opening; failing to open; remaining closed (often used to describe a door, container, valve, or opening scene/event that does not happen).","zh":"不打开的；打不开的；未开启的；保持关闭的（常用来形容门、容器、阀门，或指“开场/开幕”未发生）。"},"examples":[{"en":"The jar has a nonopening lid, so we may need a different opener.","zh":"这个罐子盖子打不开，可能需要换一种开罐器。"},{"en":"Because of rust, the nonopening gate blocked the path.","zh":"由于生锈，大门一直打不开，把路堵住了。"},{"en":"The theater announced a nonopening night due to the storm.","zh":"剧院宣布因为暴风雨将不开幕（开幕之夜取消）。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation in which something does not open or does not begin as planned (less common; often replaced by “cancellation” or “failure to open”).","zh":"未开启/未开始的情况（较少见；常用“取消”或“未能开业/开幕”来替代）。"},"examples":[{"en":"The restaurant’s nonopening surprised the neighbors who expected it to start business last week.","zh":"这家餐厅迟迟不开业，让原本以为上周就会营业的邻居很意外。"}]}],"synonyms":["unopened","closed","stuck","jammed","inoperable","failed-to-open"],"phonetic":"/ˌnɑnˈoʊpənɪŋ/","extraExplanation":["“nonopening”在实际写作中更常见的形式是加连字符的“non-opening”（更清晰地表示“非开幕/未能开启”）。描述物体“打不开”时，也常用“won’t open / doesn’t open / stuck”更口语自然。","用来形容活动或演出时，“non-opening (night)”表示“不开幕/开幕取消”。在新闻或公告里更常见的表达是“opening canceled”或“the event was canceled before opening”。"]}
{"word":"nonoperable","summary":{"en":"Nonoperable means “not functioning/usable,” and in medicine it can mean “not suitable for surgery.”","zh":"nonoperable 表示“无法运作／不能使用”，在医学语境中也可表示“无法（或不适合）手术的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not able to work or be used; not functioning","zh":"无法运作的；不能使用的；不正常运转的"},"examples":[{"en":"The elevator is nonoperable, so we’ll need to take the stairs.","zh":"电梯无法运作，所以我们得走楼梯。"},{"en":"Several machines were left nonoperable after the power surge.","zh":"电涌之后，有几台机器无法使用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a medical condition or tumor) not suitable for surgery; cannot be operated on","zh":"（医学）不适合手术的；无法进行手术的"},"examples":[{"en":"The doctors said the tumor was nonoperable because of its location.","zh":"医生说由于位置原因，这个肿瘤无法手术。"},{"en":"She was diagnosed with a nonoperable condition and started other treatments.","zh":"她被诊断为不适合手术的病情，于是开始了其他治疗方案。"}]}],"synonyms":["inoperable","out of order","nonfunctional","broken","unusable"],"phonetic":"/ˌnɑnˈɑp(ə)rəb(ə)l/","extraExplanation":["non- 是常见前缀，表示“非／不”。operable 来自 operate（操作；做手术）+ -able（“能够……的”）。所以 nonoperable 字面意思就是“不能操作／不能手术的”。","日常生活里更常用的说法常常是 not working / out of order（设备坏了）。在医学语境里，nonoperable 比较正式，常用于病历或医生说明。"]}
{"word":"nonoperatic","summary":{"en":"Nonoperatic means “not operatic”—not related to opera or not in an opera-like style.","zh":"nonoperatic 表示“非歌剧的；不具歌剧风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not operatic; not related to opera or the operatic style (in music, singing, performance, or drama).","zh":"非歌剧的；不属于歌剧或歌剧风格的（指音乐、唱法、表演或戏剧表达等）。"},"examples":[{"en":"She has a warm, nonoperatic voice that fits folk and jazz better than opera.","zh":"她的嗓音温暖、非歌剧式，更适合民谣和爵士，而不是歌剧。"},{"en":"The film uses a nonoperatic score to keep the story feeling realistic.","zh":"这部电影使用非歌剧式的配乐，让故事更贴近现实。"},{"en":"His acting style is intense but nonoperatic—more quiet than grand.","zh":"他的表演风格很有张力，但并不歌剧化——更克制而非夸张宏大。"}]}],"synonyms":["not operatic","non-opera","unoperatic","non-theatrical (in some contexts)"],"phonetic":"/ˌnɑnˌɑpəˈrætɪk/","extraExplanation":["这个词由前缀 **non-**（“不、非”）+ **operatic**（“歌剧的、歌剧式的”）构成，常用来描述：声音不采用歌剧唱法、音乐不带歌剧色彩，或戏剧/情感表达不“夸张宏大”（不像歌剧那样强烈、戏剧化）。","它不是特别常见的日常词，更常见于音乐评论、表演评价或写作中，用来强调“不是歌剧那一套风格”。"]}
{"word":"nonoperatically","summary":{"en":"nonoperatically means “not in an operatic style,” often implying a more natural, restrained way of performing or expressing emotion.","zh":"nonoperatically 意为“非歌剧式地”，常用来表示更自然、克制、不夸张的表演或情感表达方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not operatic; without the dramatic, emotional, or musical style associated with opera.","zh":"以非歌剧式的方式；不带有歌剧常见的夸张、强烈情感或音乐化的风格。"},"examples":[{"en":"The actor delivered the monologue nonoperatically, keeping his voice calm and natural.","zh":"这位演员用非歌剧式的方式演绎独白，声音保持平静自然。"},{"en":"She sang the phrase nonoperatically, closer to pop than to classical opera.","zh":"她用非歌剧式的唱法唱这句，更接近流行而不是古典歌剧。"},{"en":"The director asked for the ending to be played nonoperatically—quiet, restrained, and real.","zh":"导演要求结尾用非歌剧式的方式呈现——安静、克制、真实。"}]}],"synonyms":["naturally","plainly","restrainedly","unaffectedly","without melodrama"],"phonetic":"/ˌnɑnˌɑpəˈrætɪkli/","extraExplanation":["这个词比较少见，通常是临时造词（non- + operatic + -ly）。意思并不是“反歌剧”，而是“不要用歌剧那种夸张、宏大、强情绪的表达方式”。","常见搭配场景：表演（deliver a line）、演唱（sing a phrase）、配乐/演奏（play the ending）等，用来强调风格更自然、克制、贴近口语或现实主义。"]}
{"word":"nonoperating","summary":{"en":"“Nonoperating” usually means either (1) not part of a company’s core business activities (finance), or (2) not currently functioning/operating.","zh":"“Nonoperating”通常指（1）非主营/非经营性的（财务），或（2）未在运行、未运转的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Finance/accounting) Not related to a company’s main, regular business activities.","zh":"（金融/会计）与公司主要、日常经营活动无关的。"},"examples":[{"en":"The company reported a nonoperating loss from selling an old building.","zh":"公司因出售旧楼产生了一笔非经营性损失。"},{"en":"Interest income is often listed as nonoperating income.","zh":"利息收入常被列为非经营性收入。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not in operation; not functioning or not currently being used (often written as “non-operating”).","zh":"未在运转的；不运行的；暂停使用的（也常写作 non-operating）。"},"examples":[{"en":"The elevator is nonoperating while repairs are underway.","zh":"电梯维修期间暂停运行。"},{"en":"A non-operating heater can be a safety issue in winter.","zh":"冬天暖气不运行可能带来安全隐患。"}]}],"synonyms":["nonoperational","inactive","out of service","non-core"],"phonetic":"/ˌnɑnˈɑpəˌreɪtɪŋ/","extraExplanation":["在财务语境里，nonoperating（也写作 non-operating）很常见，用来把“主营业务（operating）”和“非主营（nonoperating）”分开看：\n- operating income：来自核心业务（比如卖产品/提供服务）的利润\n- nonoperating income/expense：来自利息、投资收益/损失、资产处置、汇兑等\n这种区分有助于判断公司“本业”到底赚不赚钱。","拼写上：\n- 在财报、会计科目里常见 nonoperating（合写）\n- 在一般描述设备状态时更常见 non-operating（加连字符），意思是“未运行/停用”"]}
{"word":"nonoperational","summary":{"en":"Nonoperational means not working or not usable, often in formal or technical contexts.","zh":"Nonoperational 指“无法运作/不能使用”，多用于较正式或技术性的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not working or not able to be used; out of service.","zh":"无法运作的；不能使用的；停用的。"},"examples":[{"en":"The elevator is nonoperational, so we’ll take the stairs.","zh":"电梯无法使用，所以我们走楼梯。"},{"en":"The website was nonoperational for several hours due to a server problem.","zh":"由于服务器故障，这个网站停摆了好几个小时。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not functioning as intended (often used in technical, military, medical, or business contexts).","zh":"未按预期发挥功能的（常用于技术、军队、医疗或商业语境）。"},"examples":[{"en":"The backup camera is nonoperational and needs repair.","zh":"倒车影像无法正常工作，需要维修。"},{"en":"After the storm, several traffic lights were nonoperational.","zh":"暴风雨过后，有几个红绿灯失灵了。"}]}],"synonyms":["out of order","not working","broken","inoperative","down"],"phonetic":"/ˌnɑnˌɑpəˈreɪʃənəl/","extraExplanation":["“non-”是英语里常见的否定前缀，表示“非/不/无”。所以 nonoperational = not operational（不运作的）。","语气上它偏正式，常见于公告、维修报告或技术说明。口语里也常说“not working”“out of order”“down”。例如：The machine is out of order.","拼写提示：nonoperational 通常写作一个词；连字符形式 non-operational 也会出现，但较少见，取决于机构写作规范。"]}
{"word":"nonoperative","summary":{"en":"Nonoperative means either “not functioning” (formal/technical) or “not involving surgery” (medical).","zh":"nonoperative 可以表示“无法运作/失灵”（偏正式/技术用语），也可以表示“非手术的/保守治疗的”（医学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not working or not functioning; not in operation.","zh":"不运作的；不工作的；失灵的。"},"examples":[{"en":"The elevator is nonoperative, so we’ll need to take the stairs.","zh":"电梯不运作了，所以我们得走楼梯。"},{"en":"Several streetlights were nonoperative after the storm.","zh":"暴风雨后有几盏路灯失灵了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not involving surgery; treated without an operation (often used in medical contexts).","zh":"非手术的；不需要动手术的（常用于医学语境）。"},"examples":[{"en":"The doctor recommended nonoperative treatment first, like rest and physical therapy.","zh":"医生建议先采取非手术治疗，比如休息和物理治疗。"},{"en":"Many mild fractures can heal with nonoperative care.","zh":"许多较轻的骨折可以通过非手术护理来愈合。"}]}],"synonyms":["inoperative","out of order","not working","nonsurgical","conservative"],"phonetic":"/ˌnɑnˈɑp(ə)rətɪv/","extraExplanation":["“non-”是否定前缀，表示“非、无、不”。所以 nonoperative 字面意思就是“非运作的/非手术的”。在日常英文里，表示“坏了、不能用”更常见的说法是 out of order 或 not working；nonoperative 更常见于正式告示、技术/工程报告、以及医疗文书。","医疗场景里，nonoperative 常与 management / treatment / care 搭配（如 nonoperative management），强调“先不用手术，采用保守治疗”。"]}
{"word":"nonopinionaness","summary":{"en":"Nonopinionatedness means the quality of being neutral and not expressing a personal opinion.","zh":"Nonopinionatedness 指“不带个人立场、保持中立、不表达或不推动某种观点”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being neutral and not expressing (or pushing) a personal opinion, especially in writing, reporting, or design","zh":"（尤指写作、报道或设计中）不带个人立场、保持中立不表达或不推动某种观点的特质"},"examples":[{"en":"The editor praised the article’s nonopinionatedness and clear reporting.","zh":"编辑称赞这篇文章立场中立、报道清晰。"},{"en":"Good academic writing often aims for nonopinionatedness by focusing on evidence.","zh":"好的学术写作常常力求中立，重点放在证据上。"},{"en":"The tool’s nonopinionatedness lets different teams use it in their own way.","zh":"这个工具的“非强制立场”特性让不同团队能按各自方式使用。"}]}],"synonyms":["neutrality","impartiality","objectivity","unbiasedness"],"phonetic":"/ˌnɑn.əˈpɪn.jəˌneɪ.tɪd.nəs/","extraExplanation":["你输入的 **nonopinionaness** 很可能是拼写错误；更常见、也更规范的形式是 **nonopinionatedness**（在一些词典里会列为 *nonopinionatedness* 这个名词形式）。","构词思路：**non-**（不）+ **opinionated**（强烈表达/坚持自己观点的）+ **-ness**（名词后缀，表示“……的性质/状态”）。","使用场景上，它常见于：新闻写作（强调客观）、学术写作（强调证据）、以及科技领域（比如“non-opinionated software/framework”，指框架不强迫你采用某一种固定风格或架构）。"]}
{"word":"nonopinionated","summary":{"en":"Nonopinionated means neutral and not expressing strong personal opinions.","zh":"nonopinionated 表示“中立的、不表达强烈个人观点的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, comment, or writing) not showing or expressing strong personal opinions; neutral and focused on facts.","zh":"（人、评论或文章）不带强烈个人观点的；中立的；更偏重事实的。"},"examples":[{"en":"The report is deliberately nonopinionated and sticks to the data.","zh":"这份报告刻意保持不带观点，只依据数据。"},{"en":"Try to keep your summary nonopinionated: describe what happened, not what you think about it.","zh":"尽量让你的总结保持中立：描述发生了什么，而不是你怎么看。"},{"en":"She gave a nonopinionated answer to avoid starting an argument.","zh":"她给了一个中立的回答，以避免引发争论。"}]}],"synonyms":["neutral","objective","unbiased","impartial","even-handed"],"phonetic":"/ˌnɑn əˈpɪnjəˌneɪtɪd/","extraExplanation":["这个词常写作 **non-opinionated**（带连字符），意思更清楚、也更常见；不带连字符的 **nonopinionated** 也能用，但在正式写作里相对少见。","语气上它通常是褒义或中性：强调“客观、就事论事”。但在某些语境也可能暗含“缺乏立场/不够有主见”，要看上下文。","近义区别：**neutral** 更通用；**objective** 强调基于事实与证据；**unbiased** 强调没有偏见；**nonopinionated** 更强调“没有（或不表达）个人看法”。"]}
{"word":"nonopinionatedness","summary":{"en":"Nonopinionatedness means the quality of being non-opinionated—staying neutral and not strongly expressing personal opinions.","zh":"nonopinionatedness 指“不带强烈个人观点、保持中立”的特质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being non-opinionated (not strongly expressing personal opinions), especially in a neutral or impartial way","zh":"不带强烈个人观点的状态；（尤指）保持中立、不过度表达立场的特质"},"examples":[{"en":"The report’s nonopinionatedness makes it easier for readers to judge the evidence for themselves.","zh":"这份报告的不带观点性，让读者更容易自行判断证据。"},{"en":"In a heated meeting, her nonopinionatedness helped calm the discussion and keep it focused on facts.","zh":"在一场激烈的会议中，她的中立克制帮助讨论降温，并让大家回到事实本身。"}]}],"synonyms":["neutrality","impartiality","objectivity","evenhandedness","nonpartisanship"],"phonetic":"/ˌnɑnəˈpɪnjəˌneɪtɪdnəs/","extraExplanation":["这个词比较少见，通常是由形容词 **non-opinionated**（不爱发表强烈意见的）加名词后缀 **-ness** 构成，用来表示“这种特质/状态”。在正式写作中，更常见的表达是 **neutrality**（中立）、**impartiality**（公正/不偏不倚）、或 **lack of bias**（缺少偏见）。","语气上，**nonopinionatedness** 往往强调“说话/写作风格不带立场”，不一定等于“公正”。如果你想强调“公平、无偏见”，用 **impartiality** 更准确；如果强调“刻意不表态”，也可以用 **noncommittal**（不明确表态的）来描述人或回答。"]}
{"word":"nonopinionative","summary":{"en":"Nonopinionative means neutral and factual—without personal opinions or judgments.","zh":"nonopinionative 指“中立客观、不带个人观点或评判”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not expressing personal opinions or judgments; neutral and factual in tone","zh":"不表达个人观点或评判的；中立、客观的"},"examples":[{"en":"Try to keep the summary nonopinionative, focusing only on what the data shows.","zh":"尽量让摘要保持非主观立场，只写数据呈现的内容。"},{"en":"The mediator used nonopinionative language to avoid taking sides.","zh":"调解员使用不带观点的措辞，以避免偏袒任何一方。"},{"en":"In academic writing, a nonopinionative style often sounds more objective.","zh":"在学术写作中，不带观点的文风通常听起来更客观。"}]}],"synonyms":["neutral","objective","nonjudgmental","non-evaluative","factual"],"phonetic":"/ˌnɑnəˈpɪnjənətɪv/","extraExplanation":["“nonopinionative”在现代英语中很少见，更常用、更自然的表达是：**non-evaluative**（不作价值评判的）、**nonjudgmental**（不评判的）、**neutral**（中立的）、**objective**（客观的）。","构词上可以理解为 **non-（不） + opinionative（带观点的）**。而“opinionative”本身是词典收录词，意思接近“opinionated（很固执己见/很有主见的）”。因此“nonopinionative”多用于强调“避免掺入观点”。","使用场景常见于：写报告、做调查/研究陈述、调解或客服沟通等，需要“只陈述事实、不下结论”的语气。"]}
{"word":"nonopinionatively","summary":{"en":"Nonopinionatively means speaking or writing in a neutral, unbiased way, without personal opinions.","zh":"nonopinionatively 指“以中立、无偏见、不带个人观点的方式”表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a neutral, unbiased way; without expressing personal opinions or judgments.","zh":"以中立、无偏见的方式；不表达个人观点或评判。"},"examples":[{"en":"Please describe what happened nonopinionatively, using only facts you observed.","zh":"请用不带观点的方式描述发生了什么，只说你观察到的事实。"},{"en":"The report summarizes the results nonopinionatively and avoids personal comments.","zh":"这份报告以不带观点的方式总结结果，避免加入个人评论。"}]}],"synonyms":["objectively","neutrally","impartially","without bias"],"phonetic":"/ˌnɑnəˈpɪnjənətɪvli/","extraExplanation":["“nonopinionatively”由 non-（表示“非、不”）+ opinionative（“带观点的、主观评判的”）+ -ly（副词后缀）构成，意思就是“以不带主观观点的方式”。","它在日常口语里不算常见，更常见的替换说法有：“objectively”（客观地）、“neutrally”（中立地）、“without bias”（不带偏见地）、“without judgment”（不加评判地）。语气上，“nonopinionatively”强调“刻意不表达观点”。"]}
{"word":"nonopinionativeness","summary":{"en":"Nonopinionativeness means being neutral and not expressing strong personal opinions.","zh":"nonopinionativeness 指“保持中立、不表达强烈个人观点”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not expressing strong personal opinions; a neutral or non-judgmental manner","zh":"不表明强烈个人观点的特质；中立、不作评判的态度"},"examples":[{"en":"Her nonopinionativeness made her a good moderator during the debate.","zh":"她不带强烈立场的态度让她在辩论中很适合担任主持人。"},{"en":"In customer service, a little nonopinionativeness can help you sound professional.","zh":"在客服工作中，适度不表态能让你听起来更专业。"}]}],"synonyms":["neutrality","objectivity","impartiality","detachment","nonpartisanship"],"phonetic":"/ˌnɑːn.əˈpɪn.jə.nə.tɪv.nəs/","extraExplanation":["这个词比较少见，通常人们更常用 **neutrality**（中立）、**objectivity**（客观）、或 **not being opinionated**（不爱发表强烈意见）来表达相近意思。","构词上可以拆成：**non-**（不、非）+ **opinionative**（爱发表意见的）+ **-ness**（……的性质/状态）。因此它字面意思就是“非意见化的状态/特质”。","语气上它通常是中性或褒义：强调克制、客观、不过度评判；但在某些语境也可能被理解为“太没主见/不表态”。"]}
{"word":"nonopposable","summary":{"en":"Nonopposable means a thumb or digit cannot move to touch the other fingers to make a grasp.","zh":"Nonopposable 指拇指或某指无法与其他手指相对接触形成对握，因此不易抓握。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to move a thumb or similar digit to touch the other fingers; not opposable.","zh":"（拇指或类似手指）不能与其他手指相对并接触的；非对生的。"},"examples":[{"en":"Most dogs have nonopposable thumbs, so they can’t grasp objects the way humans do.","zh":"大多数狗的拇指是非对生的，所以它们不能像人类那样抓握物体。"},{"en":"The robot hand was redesigned so the thumb wouldn’t be nonopposable.","zh":"这只机械手被重新设计，以避免拇指变成非对生、无法对握。"}]}],"synonyms":["not opposable","non-opposable"],"phonetic":"/ˌnɑn.əˈpɑz.ə.bəl/","extraExplanation":["这个词常见于解剖学、动物学与机器人学语境，通常描述“拇指（或类似结构）不能与其他手指形成对握（opposition）”。人类与部分灵长类的拇指是 opposable（可对生的），因此更擅长精细抓握。","拼写上有时会写成带连字符的 non-opposable；两种写法都能见到，但学术或技术文本里常用 nonopposable / non-opposable 来修饰 “thumb(s)”。"]}
{"word":"nonopposal","summary":{"en":"Nonopposal means “not opposing”—a lack of resistance or objection. It’s rare; “non-opposition” is more common.","zh":"nonopposal 意为“不反对/不抵抗/不提出异议”。这个词很少见，更常用的是 non-opposition。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of not opposing something; lack of resistance or objection","zh":"不反对；不抵抗；不提出异议"},"examples":[{"en":"The plan passed with little nonopposal from the committee.","zh":"该计划几乎没有遭到委员会的反对就通过了。"},{"en":"Her silence was taken as nonopposal, even though she had doubts.","zh":"尽管她心存疑虑，她的沉默仍被当作不反对。"}]}],"synonyms":["non-opposition","acquiescence","assent","consent","compliance","acceptance"],"phonetic":"/ˌnɑn.əˈpoʊ.zəl/","extraExplanation":["“nonopposal”并不是常见的标准英语词汇，更常见、也更自然的表达是 **non-opposition**（不反对）、**lack of opposition**（缺乏反对）、或根据语境用 **acquiescence**（默许/默认）与 **compliance**（顺从/配合）。","你输入的“nonopposal”很可能来自填字游戏线索（例如“NONOPPOSAL”对应 *acquiescence / consent / assent* 等答案），或是把更常见的“non-opposition”写成了一个合成词。写正式英文时建议改用“non-opposition”。"]}
{"word":"nonopposing","summary":{"en":"Nonopposing means “not opposing”—not working against something, and in formal contexts, not contesting or objecting.","zh":"nonopposing 意为“不反对的；不对立的”；在正式语境中也可指“不提出异议/不抗辩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not opposing; not working against someone or something","zh":"不反对的；不与……对立的；不作对的"},"examples":[{"en":"Most students were nonopposing to the new dress code, but a few strongly disagreed.","zh":"大多数学生对新着装规定并不反对，但也有少数人强烈不同意。"},{"en":"He took a nonopposing stance during the debate to avoid conflict.","zh":"他在辩论中采取不对抗的立场，以避免冲突。"}]},{"partOfSpeech":"adj.","definition":{"en":"(formal, often legal or procedural) not contesting or challenging a proposal, claim, or motion","zh":"（较正式，常用于法律/程序语境）不提出异议的；不抗辩的；不质疑的"},"examples":[{"en":"The nonopposing party did not file any objections before the deadline.","zh":"不提出异议的一方在截止日期前没有提交任何反对意见。"},{"en":"A nonopposing response may speed up the approval process.","zh":"不提出异议的回应可能会加快审批流程。"}]}],"synonyms":["not opposed","unopposed","nonadversarial","nonconfrontational","not objecting"],"phonetic":"/ˌnɑnəˈpoʊzɪŋ/","extraExplanation":["这个词更常见的写法是 **non-opposing**（带连字符），尤其在正式写作里更清晰。也可以写成 **nonopposing**，但相对少见。","构词上是前缀 **non-**（“不、非”）+ **opposing**（“反对的、对立的”）。意思通常等于 “not opposing / not in opposition”。","语气上它偏正式；日常口语里常用 **not against**, **not opposed to**, **neutral**, **not objecting** 来表达相近意思（但语义不完全一样：neutral 更像“中立”，not objecting 更像“没提出异议”）。"]}
{"word":"nonopposition","summary":{"en":"Nonopposition means the absence of opposition—no resistance, challenge, or competing candidate/argument.","zh":"nonopposition 指“无反对/无人竞争”的状态，即没有人抵制、挑战或提出竞争。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The absence of opposition; a situation in which no one resists, challenges, or competes against something (often a policy, idea, candidate, or proposal).","zh":"无反对；不受抵制的状态（常指政策、观点、候选人或提案没有人反对或竞争）。"},"examples":[{"en":"The proposal passed in nonopposition, with no one voting against it.","zh":"该提案在无人反对的情况下通过了，没有人投反对票。"},{"en":"He won the election in nonopposition because no other candidate ran.","zh":"他在无人竞争的情况下赢得了选举，因为没有其他候选人参选。"}]}],"synonyms":["absence of opposition","lack of opposition","unopposed status","no resistance"],"phonetic":"/ˌnɑnˌɑpəˈzɪʃən/","extraExplanation":["“nonopposition”比较少见，更常见的表达是“absence of opposition（没有反对）”“lack of opposition（缺乏反对）”或形容词“unopposed（无人反对/无人竞争的）”。在政治、投票程序或组织决策的语境里更容易看到。","构词上是 non-（不/无）+ opposition（反对）。在正式写作中，它强调一种“没有阻力”的状态，但不一定表示所有人都积极支持。"]}
{"word":"nonoppression","summary":{"en":"Nonoppression means the absence of oppression (unjust or cruel control). It’s a rare word; more common phrases are “absence of oppression” or “freedom from oppression.”","zh":"nonoppression 指“没有压迫”的状态（不被不公或残酷地控制）。这是较少见的词，更常用的说法是“absence/freedom from oppression”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The absence of oppression; a condition in which people are not treated in a cruel, unjust, or controlling way.","zh":"（较少见）非压迫；没有压迫的状态；指人们不遭受残酷、不公或强制控制的处境。"},"examples":[{"en":"The new policies were designed to promote nonoppression and equal treatment under the law.","zh":"这些新政策旨在促进非压迫，并实现法律面前的平等对待。"},{"en":"They argued that peace requires nonoppression, not just the end of open conflict.","zh":"他们认为和平需要非压迫，而不仅仅是公开冲突的结束。"}]}],"synonyms":["absence of oppression","freedom from oppression","liberation (context-dependent)","justice (context-dependent)"],"phonetic":"/ˌnɑnəˈprɛʃən/","extraExplanation":["“nonoppression”在现代英语中很少单独作为常用词出现，更常见的写法是带连字符的“non-oppression”，或者直接用更自然的表达：freedom from oppression（免于压迫）、absence of oppression（没有压迫）、anti-oppression（反压迫，强调行动与立场）。","构词上：non-（不、非）+ oppression（压迫）。在学术、社会正义或人权讨论里，若想强调“积极建立公平的制度”，英语里更常用“liberation / justice / equality / inclusion”等词来表达“不仅是不压迫”。"]}
{"word":"nonoppressive","summary":{"en":"“Nonoppressive” means not oppressive—fair, not harsh or controlling.","zh":"“nonoppressive”表示“非压迫性的”——公平、不苛刻、不以控制或不公压制他人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not oppressive; not harsh, cruel, or unfairly controlling. (Often used to describe a system, policy, workplace, or social environment.)","zh":"非压迫性的；不苛刻、残酷或以不公平方式控制他人的。（常用来形容制度、政策、职场或社会环境。）"},"examples":[{"en":"The group is working toward a nonoppressive workplace where everyone feels safe to speak up.","zh":"这个团队正在努力建立一个非压迫性的职场环境，让每个人都能安心表达意见。"},{"en":"She wants school rules that are firm but nonoppressive.","zh":"她希望学校的规则既严格又不带压迫性。"}]}],"synonyms":["fair","noncoercive","nonauthoritarian","humane","respectful","not controlling"],"phonetic":"/ˌnɑn.əˈprɛsɪv/","extraExplanation":["“nonoppressive”更常见的写法是带连字符的“non-oppressive”。在正式写作里，用连字符能让结构更清晰、读起来更自然。","这个词多出现在社会正义、教育、组织管理等语境中，用来强调“有规则/有权力，但不以压制或不公来运作”。","在日常英语里，人们也常用更口语的表达替代，例如“fair and respectful（公平且尊重人）”“not controlling（不控制）”“not abusive（不虐待/不霸凌）”。"]}
{"word":"nonoppressively","summary":{"en":"Nonoppressively means “in a way that is not oppressive or controlling.”","zh":"nonoppressively 意为“以不压迫、不强制控制的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not oppressive; without using unfair control, pressure, or force.","zh":"以不压迫的方式；不以不公平的控制、压力或强制来对待他人。"},"examples":[{"en":"The manager tried to give feedback nonoppressively, focusing on support rather than blame.","zh":"经理尽量以不压迫的方式给反馈，更强调支持而不是指责。"},{"en":"The new policy was designed to be enforced nonoppressively, with clear explanations and appeals.","zh":"这项新政策的设计目标是以不压迫的方式执行，配套清晰说明与申诉机制。"},{"en":"Teachers can correct mistakes nonoppressively by encouraging students to try again.","zh":"老师可以用不压迫的方式纠正错误，比如鼓励学生再试一次。"}]}],"synonyms":["respectfully","fairly","without coercion","in a non-oppressive way","without being oppressive"],"phonetic":"/ˌnɑnəˈprɛsɪvli/","extraExplanation":["这是由前缀 non-（“不、非”）+ oppressively（“压迫地”）构成的副词，字面意思就是“不是以压迫的方式”。它在日常口语里不算常见，写作或讨论权力关系、管理、教育、社会议题时更容易出现。","更自然的常用表达有：in a non-oppressive way / without being oppressive / respectfully / fairly / without coercion（视语境选择）。如果你想让语气更顺畅，常常用这些短语会比单个词更地道。"]}
{"word":"nonoppressiveness","summary":{"en":"Nonoppressiveness means the quality of not being oppressive—being fair, gentle, or not harsh in the use of power.","zh":"nonoppressiveness 指“不压迫性”：权力、制度或做法在使用时公平、温和、不苛刻的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being oppressive; the state of being gentle, fair, or not harsh in the way power or rules are used","zh":"不压迫性；不苛刻、不压制的特质（指权力、制度或做法不让人感到被压迫）"},"examples":[{"en":"The goal of the reforms was to increase the nonoppressiveness of the legal system.","zh":"这些改革的目标是提高法律体系的不压迫性。"},{"en":"Employees valued the nonoppressiveness of the workplace culture, where people could speak honestly.","zh":"员工很看重这种职场文化的不压迫性，因为大家可以坦诚表达。"},{"en":"She judged the policy by its fairness and nonoppressiveness rather than by its strictness alone.","zh":"她评价这项政策时看重的是公平与不压迫性，而不只是严格程度。"}]}],"synonyms":["non-oppressiveness","lack of oppression","fairness","benignity","leniency","humaneness"],"phonetic":"/ˌnɑnəˈprɛsɪvnəs/","extraExplanation":["这是一个比较少见、偏学术/政策讨论风格的名词，由 non-（不、非）+ oppressive（压迫性的）+ -ness（名词后缀：……性/……的状态）组成。","日常英语里更常见的说法通常是 not oppressive（不压迫的）、non-oppressive（不压迫的）或 lack of oppression（缺乏压迫）。如果你在写作中使用 nonoppressiveness，会显得更正式、更抽象。"]}
{"word":"nonopprobrious","summary":{"en":"Nonopprobrious means “not insulting or strongly blaming; not disgraceful.”","zh":"nonopprobrious 意为“非辱骂性的；不带强烈责难或侮辱的；不丢脸的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not opprobrious; not expressing strong blame or insult; not disgraceful.","zh":"非辱骂性的；不带强烈责难或侮辱的；不丢脸的。"},"examples":[{"en":"The reviewer offered a nonopprobrious critique, focusing on structure rather than personal attacks.","zh":"评论者给出了非辱骂性的批评，重点谈结构而不是人身攻击。"},{"en":"They asked the group to use nonopprobrious language during the debate.","zh":"他们要求大家在辩论中使用不带侮辱性的措辞。"}]}],"synonyms":["noninsulting","nonabusive","non-derogatory","respectful","temperate"],"phonetic":"/ˌnɑnəˈproʊbriəs/","extraExplanation":["这个词由前缀 non-（“不、非”）+ opprobrious（“辱骂性的、可耻的”）构成，属于比较书面、少见的词。日常英语里更常用的表达有: not insulting, not abusive, respectful, non-derogatory。","opprobrious 常见于正式语境，强调“带有强烈谴责/羞辱”的语气；nonopprobrious 则强调“批评可以有，但不要用羞辱人的方式”。"]}
{"word":"nonopprobriously","summary":{"en":"Nonopprobriously means “in a way that is not shameful or blameworthy; without public disgrace or harsh criticism.”","zh":"nonopprobriously 指“以不丢脸、不会招致强烈谴责的方式；体面地、不受非难地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not shameful, disgraceful, or deserving strong public criticism; without opprobrium.","zh":"以不丢脸、不耻辱、不会招致强烈公众谴责的方式；不受非难地。"},"examples":[{"en":"The family tried to handle the dispute nonopprobriously, avoiding public insults and blame.","zh":"这家人尽量以不招致非难的方式处理纠纷，避免公开辱骂和指责。"},{"en":"She wanted to resign nonopprobriously, so she gave notice and thanked her team.","zh":"她希望体面地辞职、不落人口实，所以提前通知并感谢团队。"}]}],"synonyms":["blamelessly","without reproach","without shame","respectably","honorably"],"phonetic":"/ˌnɑnəˈproʊbriəsli/","extraExplanation":["这个词非常罕见，常见写法与用法通常是 **opprobriously**（“可耻地／招致谴责地”）以及其否定表达 **without opprobrium / without reproach / without shame**。**nonopprobriously** 属于把前缀 **non-**（“不”）直接加在 *opprobriously* 前面的构词方式，语义上能理解，但在日常写作中不算常用、也可能显得生硬。","词根提示：*opprobrium* 来自拉丁语，核心含义是“耻辱、非难、恶名”。所以 **nonopprobriously** 的语感更偏正式、书面、甚至法律/学术风格，用来强调“没有带来羞辱或公众谴责”。"]}
{"word":"nonopprobriousness","summary":{"en":"Nonopprobriousness means the state of being free from insult, disgrace, or shameful harsh criticism.","zh":"nonopprobriousness 指“不带侮辱或耻辱性质”的状态，即避免尖刻辱骂或羞辱性的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being opprobrious; absence of harshly insulting, disgraceful, or shameful character","zh":"不具侮辱性／不丢脸的状态；不带严厉辱骂、耻辱或可耻性质的特征"},"examples":[{"en":"The report was written with careful nonopprobriousness, avoiding any personal attacks.","zh":"这份报告写得很谨慎，保持不带侮辱性，避免任何人身攻击。"},{"en":"He defended his opponent’s character with a tone of nonopprobriousness.","zh":"他以不带辱骂的语气为对手的人品辩护。"}]}],"synonyms":["non-insultingness","respectfulness","civility","decorum","tact"],"phonetic":"ˌnɑnəˈproʊbriəsnəs","extraExplanation":["这是一个非常罕见、偏“造词感”的名词，通常不会出现在日常英语里。更自然的表达往往是：**non-insulting language**（不侮辱的措辞）、**without abuse**（不带辱骂）、或 **in a respectful tone**（以尊重的语气）。","构词上可拆解为：**non-**（不）+ **opprobrious**（辱骂的；可耻的）+ **-ness**（名词后缀，表示“性质/状态”）。因此字面意思就是“没有辱骂/耻辱性质的状态”。","语体上偏正式、学术或修辞用途；写作中使用它会显得很“书面”和少见，可能需要确保读者能顺畅理解。"]}
{"word":"nonoptic","summary":{"en":"Nonoptic means “not optical,” i.e., not related to seeing or not using light/vision-based methods.","zh":"nonoptic 表示“非光学的”，即不与视觉相关或不使用基于光/视觉的方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not optical; not related to seeing or to light/vision-based methods","zh":"非光学的；不与视觉或以光/视力为基础的方法相关的"},"examples":[{"en":"The device uses nonoptic sensors to detect motion in the dark.","zh":"这个设备使用非光学传感器在黑暗中检测运动。"},{"en":"Researchers compared optic and nonoptic cues in navigation.","zh":"研究人员比较了导航中的视觉线索与非视觉（非光学）线索。"}]},{"partOfSpeech":"adj.","definition":{"en":"(by extension) not designed for or involving the eye or the optic nerve","zh":"（引申）不针对眼睛或视神经的；不涉及视神经的"},"examples":[{"en":"Some headaches have nonoptic causes, such as stress or dehydration.","zh":"有些头痛的原因并非来自视觉系统，比如压力或脱水。"}]}],"synonyms":["nonoptical","non-visual","nonvisual"],"phonetic":"/nɑnˈɑptɪk/","extraExplanation":["“nonoptic”较少见，更常见的标准拼写是 **nonoptical**（或写成 **non-optical**）。在学术或技术写作中，如果你想表达“不是通过光学/视觉方式实现的”，通常用 nonoptical/non-optical 更自然。"]}
{"word":"nonoptical","summary":{"en":"“Nonoptical” means “not optical”—not involving light, vision, or lenses, especially in technical writing.","zh":"“nonoptical”意为“非光学的”，指不涉及光、视觉或镜头，常见于技术写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not optical; not related to light, vision, or the use of lenses (often used in technical contexts, e.g., nonoptical sensors or nonoptical measurements).","zh":"非光学的；与光、视觉或镜头无关的（常用于技术语境，如“非光学传感器/非光学测量”）。"},"examples":[{"en":"The device uses nonoptical sensors to detect motion in the dark.","zh":"这个设备使用非光学传感器在黑暗中检测运动。"},{"en":"Nonoptical methods can measure temperature without a camera or lens.","zh":"非光学方法可以在不使用相机或镜头的情况下测量温度。"}]}],"synonyms":["non-visual","nonphotonic","non-light-based"],"phonetic":"/ˌnɑnˈɑp.tɪ.kəl/","extraExplanation":["这个词由 non-（“不、非”）+ optical（“光学的”）构成，多见于工程、物理、材料与传感领域。它通常是在对比 optical（光学/基于光信号）与 nonoptical（非光学/基于电、磁、声、热、机械等信号）时使用。"]}
{"word":"nonoptically","summary":{"en":"Nonoptically means “not in an optical/visual way,” often used in technical contexts (e.g., sensing or measuring without cameras or light-based methods).","zh":"nonoptically 表示“非光学地/非视觉地”，多用于技术语境，强调不用相机或基于光的方式来探测或测量。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not optical; not by using light, vision, or optical instruments.","zh":"以非光学的方式；不是通过光、视觉或光学仪器来实现。"},"examples":[{"en":"The device can detect movement nonoptically, using sound waves instead of cameras.","zh":"这个设备可以用非光学方式检测运动，比如用声波而不是摄像头。"},{"en":"They measured the material’s properties nonoptically, relying on electrical signals.","zh":"他们用非光学方法测量材料性质，主要依靠电信号。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not related to optics (the science of light and vision).","zh":"以与光学（研究光与视觉的学科）无关的方式。"},"examples":[{"en":"The problem can be solved nonoptically through mathematical modeling.","zh":"这个问题可以用非光学途径解决，例如通过数学建模。"}]}],"synonyms":["not visually","without optics","by non-optical means","using non-optical methods"],"phonetic":"/ˌnɑːnˈɑːptɪkli/","extraExplanation":["“nonoptically”比较少见，常见于科技/工程/科研语境，用来强调“不是靠光学/视觉手段”。更口语、更常用的表达通常是：not visually / without optics / using non-optical methods。","构词：non-（不、非）+ optically（光学地/视觉地）。它通常修饰动词（detect, measure, sense, identify 等），说明方法不是靠摄像头、镜头、光线或视觉成像。"]}
{"word":"nonoptimistic","summary":{"en":"“Nonoptimistic” means “not optimistic”—not expecting good results.","zh":"nonoptimistic 意为“不乐观的”，即不期待会有好结果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not optimistic; not expecting good outcomes or success.","zh":"不乐观的；不抱好结果或成功期待的。"},"examples":[{"en":"The doctor was nonoptimistic about his chances of a full recovery.","zh":"医生对他完全康复的可能性并不乐观。"},{"en":"Investors became nonoptimistic after the company reported weak sales.","zh":"公司公布疲软的销售数据后，投资者变得不太乐观。"}]}],"synonyms":["not optimistic","pessimistic","downbeat","discouraged","gloomy"],"phonetic":"/ˌnɑnˌɑp.təˈmɪs.tɪk/","extraExplanation":["“non-”是一个常见前缀，表示“非…… / 不……”。所以 nonoptimistic 直译就是“不乐观的”。更自然的常用表达通常是 **not optimistic**、**pessimistic**（更偏“悲观”）或 **downbeat**（语气更口语、情绪更低落）。","拼写上，nonoptimistic 常见于较正式或技术性语境（报告、学术、新闻）；日常对话里更常说：I’m not optimistic about it."]}
{"word":"nonoptimistical","summary":{"en":"Nonoptimistical (rare) means “not optimistic; not hopeful about the future.”","zh":"Nonoptimistical（罕见）意思是“并不乐观；对未来不抱希望/信心”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Not optimistic; not expecting a good outcome; lacking hope or confidence about the future.","zh":"（罕见用法）不乐观的；对未来不抱太大希望的；缺乏信心的。"},"examples":[{"en":"The analyst gave a nonoptimistical forecast for the next quarter.","zh":"分析师对下个季度给出了不乐观的预测。"},{"en":"She sounded nonoptimistical about the plan, but still agreed to try.","zh":"她对这个计划听起来并不乐观，但还是同意试一试。"}]}],"synonyms":["nonoptimistic","pessimistic","downbeat","not hopeful"],"phonetic":"/ˌnɑnˌɑp.təˈmɪs.tɪ.kəl/","extraExplanation":["“nonoptimistical”在现代英语里非常少见，更常用的是 **nonoptimistic**（不乐观的）或 **pessimistic**（悲观的）。如果你在写作或考试中使用，建议优先用 nonoptimistic/pessimistic，更自然、更地道。","构词上它可以理解为 non-（不）+ optimistic（乐观的）+ -al（形容词后缀）。但英语里并不是所有词都常用 -al 这一变体，所以这个形式看起来会偏“古旧/生硬”。"]}
{"word":"nonoptimistically","summary":{"en":"“Nonoptimistically” means “not optimistically”—in a not hopeful or not positive way.","zh":"“nonoptimistically”意思是“并不乐观地”——以不抱希望或不太积极的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not optimistic; expecting an outcome will not be good, or not believing things will improve.","zh":"以不乐观的方式；不抱希望地；预期结果不会好，或不相信情况会好转。"},"examples":[{"en":"He looked at the sales numbers nonoptimistically and predicted another tough quarter.","zh":"他不乐观地看着销售数据，预测下个季度仍会很艰难。"},{"en":"Nonoptimistically, she assumed the delay meant the project would miss the deadline.","zh":"她不太乐观地认为，这次延误意味着项目会错过截止日期。"}]},{"partOfSpeech":"adv.","definition":{"en":"Without expressing optimism; in a neutral-to-negative tone rather than a hopeful one.","zh":"不带乐观色彩地；以偏中性到消极的语气，而非充满希望的语气。"},"examples":[{"en":"He spoke nonoptimistically about the chances of a quick recovery.","zh":"他谈到迅速恢复的可能性时，语气并不乐观。"}]}],"synonyms":["pessimistically","bleakly","doubtfully","cautiously"],"phonetic":"/ˌnɑnˌɑp.təˈmɪs.tɪ.kli/","extraExplanation":["“nonoptimistically”由 non-（表示“非、不”）+ optimistically（乐观地）构成。它在正式写作中偶尔出现，但日常英语里更常用的说法是：“not optimistically”、“pessimistically”（悲观地）、“without much hope”（没抱太大希望地）。","语气区别：pessimistically 往往更“悲观、唱衰”；nonoptimistically 可能只是“没有那么乐观”，不一定强烈到悲观。根据语境，你也可以用 “cautiously”（谨慎地）来表达“保守、审慎”的不乐观。"]}
{"word":"nonoptional","summary":{"en":"“Nonoptional” means required or mandatory, not something you can choose to skip.","zh":"“nonoptional”表示“必须的、非可选的”，不能选择跳过。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Required; not optional; must be done or included.","zh":"非可选的；必须的；不能省略的。"},"examples":[{"en":"Attendance at the safety training is nonoptional for all employees.","zh":"所有员工都必须参加安全培训（这是非可选的）。"},{"en":"The app needs camera access for this feature—it’s nonoptional.","zh":"这个功能需要相机权限——这是必须的，不能不给。"}]}],"synonyms":["mandatory","required","compulsory","not optional","obligatory"],"phonetic":"/ˌnɑnˈɑpʃənəl/","extraExplanation":["“nonoptional”更常见的写法是“non-optional”（加连字符），在正式写作或编辑规范中更常被接受；不加连字符也能看懂，但有时会显得不够标准。","构词：non-（不、非）+ optional（可选的）。意思通常等同于“mandatory / required”，但语气更强调“不能当作可选项”。","使用场景：公司规定（non-optional meeting）、制度要求（non-optional fee）、产品/系统需求（non-optional setting）。如果你想表达“强烈建议但不是硬性规定”，更适合用“strongly recommended”而不是“nonoptional”。"]}
{"word":"nonoptionally","summary":{"en":"“Nonoptionally” means “not optional; required.”","zh":"「nonoptionally」表示「不是可選的；必須的」。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not optional; mandatorily; as a required condition.","zh":"以非可選的方式；必須地；作為必要條件地。"},"examples":[{"en":"Attendance is nonoptionally recorded for every class session.","zh":"每次上課都必須記錄出席情況。"},{"en":"The software nonoptionally collects crash reports unless you disable telemetry in system settings.","zh":"除非你在系統設定中關閉遙測，否則該軟體會強制收集當機回報。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is fixed by rules, policy, or design (not left to personal choice).","zh":"以受規則、政策或設計所限制的方式（不由個人選擇）。"},"examples":[{"en":"Some fees are charged nonoptionally under the contract terms.","zh":"依合約條款，有些費用是固定必收的。"},{"en":"In that course, group work is nonoptionally built into the grading system.","zh":"那門課的評分制度中，小組作業是固定包含在內的。"}]}],"synonyms":["mandatorily","necessarily","compulsorily","requiredly (rare)","not optionally"],"phonetic":"/ˌnɑnˈɑpʃənəli/","extraExplanation":["「nonoptionally」不是很常見、也較不正式；日常或正式寫作更常用：**mandatorily**, **necessarily**, **required**, **compulsorily**, **not optional**。","構詞上是 **non-（不）+ optional（可選的）+ -ly（副詞）**，意思直觀，但在正式文件裡通常會直接寫：\"This is not optional.\" 或 \"This is required.\""]}
{"word":"nonoral","summary":{"en":"Nonoral means “not by mouth” (common in medicine) or “not spoken” (less common; often replaced by ‘written’).","zh":"nonoral 指“非经口/非口服”（医学中常见），也可指“非口头的”（较少见，常用 written 等替代）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving the mouth; not taken or done by mouth (especially in medical contexts).","zh":"非口腔的；不经口的（尤指医学语境中，不通过口服或口腔进行）。"},"examples":[{"en":"The doctor recommended a nonoral medication because the patient was vomiting.","zh":"由于病人一直呕吐，医生建议使用非口服的药物。"},{"en":"In some emergencies, nonoral hydration may be necessary.","zh":"在某些紧急情况下，可能需要采用非经口的补液方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not spoken; communicated in writing or by other methods rather than speech.","zh":"非口头的；不是通过说话表达的（如通过书面或其他方式）。"},"examples":[{"en":"The assignment allows nonoral responses, such as a written report.","zh":"这项作业允许非口头作答，比如提交书面报告。"}]}],"synonyms":["non-oral","parenteral","topical","written","nonverbal"],"phonetic":"/ˌnɑnˈɔrəl/","extraExplanation":["“nonoral”常见于医学与护理写作，表示“非经口/非口服”，例如 nonoral route（非经口给药途径：注射、贴片、栓剂等）。日常英语里更常写成带连字符的 “non-oral”。","在教育场景中，如果指“不是口头表达”，更常用的说法是 “written” 或 “nonverbal / not spoken”，因此在正式写作里可根据语境选择更自然的词。"]}
{"word":"nonorally","summary":{"en":"Nonorally means ‘not by mouth,’ especially referring to giving medicine by a route other than oral.","zh":"nonorally 表示“非经口（非口服）地”，多用于医学语境，指用口服以外的方式给药。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Not by mouth; not through the oral route (especially for giving medicine).","zh":"非经口的；不是通过口服途径的（尤指给药方式）。"},"examples":[{"en":"Because he was vomiting, the doctor gave the medicine nonorally.","zh":"因为他一直呕吐，医生改用非经口方式给药。"},{"en":"This drug can be administered nonorally, such as by injection or a skin patch.","zh":"这种药可以非经口使用，比如注射或贴剂。"}]}],"synonyms":["not orally","by a nonoral route","parenterally (especially by injection)"],"phonetic":"/nɑnˈɔrəli/","extraExplanation":["“nonorally”多见于医学/药学语境，意思是“非口服给药”。常见的非经口途径包括注射（intravenous/IM）、贴剂（transdermal patch）、吸入（inhalation）、栓剂（rectal suppository）等。","写法上也常见作“non-orally”（带连字符）或更常用的表达是“by a nonoral route / nonoral administration”。日常英语里通常不会用这个词，而会直接说“not by mouth”或“not taken orally”。"]}
{"word":"nonorchestral","summary":{"en":"“Nonorchestral” means “not orchestral.”","zh":"“nonorchestral”表示“非管弦乐的（不是管弦乐编制的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not orchestral; not written for, performed by, or involving an orchestra","zh":"非管弦乐的；不是为管弦乐队创作、演奏或包含管弦乐队编制的"},"examples":[{"en":"The soundtrack mixes orchestral and nonorchestral pieces, including electronic tracks.","zh":"这张原声带把管弦乐与非管弦乐作品混在一起，包括一些电子音乐曲目。"},{"en":"We need a nonorchestral version of the theme for the small venue.","zh":"我们需要这段主题的非管弦乐版本，适合较小的演出场地。"}]}],"synonyms":["non-orchestral","not orchestral","non-symphonic"],"phonetic":"/ˌnɑnɔrˈkɛstrəl/","extraExplanation":["“nonorchestral”通常写作 non-orchestral 或 nonorchestral，前缀 non- 表示“非、不”，orchestral 表示“管弦乐的”。这个词常见于音乐评论、曲目分类、电影/游戏配乐说明，用来区分“管弦乐编制”与“电子、摇滚、室内乐、小编制、独奏”等非管弦乐编制。"]}
{"word":"nonorchestrally","summary":{"en":"“Nonorchestrally” means “in a non-orchestral way,” often used in music writing to describe sound or arrangement without orchestral treatment.","zh":"“nonorchestrally”意为“以非管弦乐的方式”，多用于音乐语境，描述不采用管弦乐式配器/音色的呈现。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not orchestral (not involving an orchestra, or not using an orchestral style of sound/arrangement).","zh":"以非管弦乐的方式（不涉及管弦乐队，或不采用管弦乐式的音色/编配风格）。"},"examples":[{"en":"The theme appears first nonorchestrally on solo piano, then returns with full orchestra.","zh":"主题先以非管弦乐的方式由独奏钢琴呈现，随后再以完整管弦乐队回归。"},{"en":"In the rehearsal notes, the composer asks the opening to be played nonorchestrally—thin, dry, and intimate.","zh":"在排练说明中，作曲家要求开头要以非管弦乐的方式演奏——薄、干、亲密。"}]}],"synonyms":["in a non-orchestral way","not orchestrally","without orchestration","in a pared-down arrangement"],"phonetic":"/ˌnɑnˌɔrˈkɛstrəli/","extraExplanation":["这个词非常少见，通常出现在音乐评论、配器（orchestration）讨论或作曲/排练说明里。","构词法：non-（不、非）+ orchestrally（以管弦乐方式）。更常见的表达是“not orchestrally”或“in a non-orchestral way”。","语义重点常在“音色与编配风格”：例如用钢琴、吉他、合成器、小编制室内乐来呈现，而不是用“大编制管弦乐”的厚重与层次。"]}
{"word":"nonordained","summary":{"en":"Nonordained means not formally ordained—especially not officially made a clergy member.","zh":"nonordained 指“未受按立/未授圣职的”，多用于宗教语境，表示不是正式神职人员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not formally ordained (especially not officially made a member of the clergy, such as a priest or minister).","zh":"未受（尤指宗教意义上的）按立/授圣职的；非正式被任命为神职人员的（如牧师、神父）。"},"examples":[{"en":"The ceremony was led by a nonordained community leader rather than a pastor.","zh":"仪式由一位非受按立的社区领袖主持，而不是由牧师主持。"},{"en":"In some traditions, nonordained staff can still teach and provide support, but they cannot perform certain rites.","zh":"在一些传统中，未受按立的工作人员仍可教学与提供支持，但不能执行某些宗教仪式。"}]}],"synonyms":["unordained","lay","layperson","not ordained"],"phonetic":"/ˌnɑnɔrˈdeɪnd/","extraExplanation":["“nonordained”常见于宗教或教会语境，尤其指没有经过“ordination（按立/授圣职）”这一正式程序的人，因此不具备某些宗教职权（例如主持特定圣礼/仪式）。在一般英语里更常写作带连字符的“non-ordained”。"]}
{"word":"nonordered","summary":{"en":"Nonordered means not arranged in order, or (in technical contexts) not having a defined ordering relation.","zh":"nonordered 指“未排序/未按顺序排列的”，也可在技术语境中指“没有定义序关系的（非有序）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not arranged in a particular order; not sorted or organized by a rule (such as time, size, or alphabet).","zh":"未按特定顺序排列的；没有按规则（如时间、大小、字母顺序）整理/排序的。"},"examples":[{"en":"The files are nonordered, so it takes longer to find anything.","zh":"这些文件没有排序，所以找东西会更花时间。"},{"en":"She wrote a nonordered list of ideas as they came to her.","zh":"她把想到的点子随手写成一个不按顺序的清单。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/logic/CS) Not having a defined ordering relationship; elements cannot be meaningfully compared as “before/after” or “smaller/larger.”","zh":"（数学/逻辑/计算机）不具备明确定义的“序”关系；元素之间无法有意义地比较“先后”或“大小”。"},"examples":[{"en":"In this model, the events are nonordered, so their sequence is not specified.","zh":"在这个模型里，事件是非有序的，因此并不规定发生顺序。"}]}],"synonyms":["unordered","unsorted","unarranged","disorganized"],"phonetic":"/ˌnɑnˈɔɹdɚd/","extraExplanation":["“nonordered”在日常英语里不算最常见，更常见的说法是“unordered”或“unsorted”。如果你是在数学/计算机语境看到“nonordered”，通常表达“没有（被定义为）顺序”的概念。拼写上也常见带连字符的形式“non-ordered”。"]}
{"word":"nonordination","summary":{"en":"Nonordination means the condition of not being ordained as clergy.","zh":"nonordination 指“未受圣职按立”的状态（未被正式按立为神职人员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or fact of not being ordained (not officially made a priest, minister, or clergy member).","zh":"未受圣职（未被正式按立为神职人员）的状态或事实。"},"examples":[{"en":"In some denominations, nonordination can limit who is allowed to lead certain religious ceremonies.","zh":"在一些宗派中，未受圣职可能会限制谁可以主持某些宗教仪式。"},{"en":"Her nonordination meant she could teach but could not perform weddings in that church.","zh":"她未受圣职意味着她可以教导，但不能在那间教会主持婚礼。"},{"en":"The debate focused on whether nonordination of women should continue.","zh":"争论的焦点是是否应继续对女性不予按立。"}]}],"synonyms":["lack of ordination","absence of ordination","unordained status"],"phonetic":"/ˌnɑnˌɔr.dəˈneɪ.ʃən/","extraExplanation":["这个词比较少见，常见语境是宗教制度（尤其基督教传统）里讨论“是否按立/授予圣职”（ordination）的问题，例如讨论女性、平信徒是否能被按立。","构词法很透明：non-（否定前缀，表示“非/不”）+ ordination（按立；授圣职）→ nonordination（不按立；未按立的状态）。","更常用的日常表达往往是：not ordained / unordained（未受圣职的）。如果你是在描述“人”，通常用 unordained（如 an unordained minister）。"]}
{"word":"nonorganic","summary":{"en":"“Nonorganic” means “not organic”—either not from living sources (often chemicals/materials) or not organic-certified in food/agriculture.","zh":"“nonorganic”表示“非有机的”：要么指不来自生物来源（常见于化学/材料），要么指食品/农业中“非有机认证/不按有机标准生产”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not organic; not derived from living organisms (often referring to chemicals, fertilizers, or materials).","zh":"非有机的；不是来自生物体的（常指化学品、肥料或材料）。"},"examples":[{"en":"Some gardeners avoid nonorganic fertilizers and prefer compost.","zh":"有些园丁避免使用非有机肥料，更喜欢堆肥。"},{"en":"The label warns that the product contains nonorganic solvents.","zh":"标签警示该产品含有非有机溶剂。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Food/agriculture) Not produced under “organic” standards; not organic-certified.","zh":"（食品/农业）不符合“有机”标准的；非有机认证的。"},"examples":[{"en":"They sell both organic and nonorganic apples at the market.","zh":"他们在市场上同时卖有机苹果和非有机苹果。"},{"en":"Nonorganic farming may use synthetic pesticides or fertilizers, depending on local rules.","zh":"非有机农业可能会使用合成农药或化肥，具体取决于当地规定。"}]}],"synonyms":["inorganic","non-organic","synthetic","artificial","conventional"],"phonetic":"/ˌnɑnɔrˈɡænɪk/","extraExplanation":["“nonorganic”有时会写成“non-organic”（加连字符），尤其在食品标签或农业语境里更常见。","在化学语境中，更常用的对应词是“inorganic”（无机的）。因此描述“无机化合物”时通常说“inorganic compounds”，而不是“nonorganic compounds”。","在日常表达中，“nonorganic”强调“不是有机的/不按有机标准生产”，语气通常比“synthetic（合成的）”更中性；“synthetic”更强调“人工合成”。"]}
{"word":"nonorganically","summary":{"en":"Nonorganically means “not in an organic or natural way,” either chemically (not produced by living/organic processes) or socially/market-wise (not through natural growth).","zh":"nonorganically 表示“非有机地/非自然地”，可指化学意义上的非有机方式形成或生产，也可指营销等语境中非自然增长（靠干预、投放、刷量等）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not organic; made or produced by chemical processes rather than by living things (or by “organic” methods).","zh":"以非有机的方式；指不是通过生物或“有机”方式产生，而是通过化学过程制造/形成的。"},"examples":[{"en":"Some vitamins are produced nonorganically in factories.","zh":"有些维生素是在工厂里以非有机方式生产的。"},{"en":"The substance can be formed nonorganically under high pressure.","zh":"这种物质在高压条件下可能以非有机方式形成。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that does not happen naturally or gradually; done artificially or through deliberate intervention (often in marketing, social media, or communities).","zh":"以非自然、非自发的方式；指通过刻意干预、人工操作而不是自然增长（常见于营销、社媒或社群语境）。"},"examples":[{"en":"The account grew nonorganically after the brand bought ads.","zh":"这个账号在品牌投放广告后以非自然方式增长。"},{"en":"They tried to build the community nonorganically by paying for followers.","zh":"他们试图通过花钱买粉来“非自然地”建立社群。"}]}],"synonyms":["artificially","synthetically","inorganically","unnaturally","by intervention"],"phonetic":"/ˌnɑn ɔrˈɡænɪkli/","extraExplanation":["“nonorganically”来自“non-（不/非）+ organically（有机地/自然地）”。写作上也常见带连字符的形式“non-organically”，两者意思相同，带连字符的版本在正式写作中更常见。","在不同语境里，“organic”含义不同：在化学/材料领域多指“有机（含碳化合物体系）”；在食品领域多指“有机种植/生产标准”；在营销领域“organic growth”指“不靠广告或刷量的自然增长”。因此“nonorganically”具体怎么翻译，通常要看上下文。"]}
{"word":"nonorganization","summary":{"en":"Nonorganization means either a lack of organization, or (less commonly) a group with little or no formal structure.","zh":"nonorganization 可指“缺乏组织性”，也可（较少见）指“刻意不设正式结构的团体/非组织”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lack of organization; a state where things are not arranged, managed, or structured in an orderly way.","zh":"缺乏组织性；指事物没有被有条理地安排、管理或形成结构的状态。"},"examples":[{"en":"The project failed because of nonorganization and unclear responsibilities.","zh":"这个项目失败是因为缺乏组织性，而且职责不清。"},{"en":"Her notes were pure nonorganization—papers everywhere with no system.","zh":"她的笔记完全没有条理——纸张到处都是，毫无系统。"}]},{"partOfSpeech":"n.","definition":{"en":"A group or activity that intentionally has little or no formal structure, rules, or leadership (often used in social or political contexts).","zh":"（常用于社会或政治语境）刻意不设正式结构、规则或领导层的团体或活动。"},"examples":[{"en":"They described their movement as a nonorganization with no official leaders.","zh":"他们把自己的运动描述为一种“非组织”，没有正式领导。"},{"en":"The nonorganization relied on volunteers and informal networks to coordinate events.","zh":"这个“非组织”依靠志愿者和非正式的人际网络来协调活动。"}]}],"synonyms":["disorganization","lack of organization","messiness","chaos","informal network","leaderless group"],"phonetic":"/ˌnɑnˌɔrɡənəˈzeɪʃən/","extraExplanation":["“nonorganization”不是最常见的标准词形，更常见的写法是“non-organization”或直接用“disorganization / lack of organization”。在正式写作中，如果你想表达“混乱、无条理”，通常用“disorganization”更自然；如果想强调“刻意不设结构的组织形态”，可以用“non-organization”或更具体的说法（如“leaderless group / informal network”）。"]}
{"word":"nonorientable","summary":{"en":"Nonorientable describes a surface or space that cannot have a consistent global “orientation” (like a stable front/back side), as in a Möbius strip.","zh":"nonorientable 指“不可定向的”，即无法在整体上保持一致的取向（例如无法一致地区分正反面），典型例子是莫比乌斯带。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mathematics) Not having a consistent “two-sided” surface—there is no way to label one side as the “front” and the other as the “back” everywhere without contradiction.","zh":"（数学）不可定向的；指表面无法在整体上保持一致的“正反两面”区分，也就是无法在整个表面上始终一致地定义“正面/背面”。"},"examples":[{"en":"A Möbius strip is a classic example of a nonorientable surface.","zh":"莫比乌斯带是不可定向曲面的经典例子。"},{"en":"On a nonorientable surface, a small arrow can return flipped after traveling around a loop.","zh":"在不可定向曲面上，一个小箭头沿着闭合路径走一圈回来后可能会变成“翻转”的方向。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general) Not having a consistently defined orientation or direction across the whole object or space.","zh":"（更广义）无法在整体上定义一致的方向/取向（orientation）的。"},"examples":[{"en":"The professor briefly mentioned a nonorientable manifold in topology.","zh":"教授在拓扑学里简要提到了一个不可定向的流形。"}]}],"synonyms":["non-orientable","unorientable"],"phonetic":"/ˌnɑnˈɔriˌɛntəbəl/","extraExplanation":["词源上，non- 表示“非/不”，orientable 来自 orient（定向、确定方向）。所以 nonorientable 字面意思就是“不能定向的”。","直观理解：在“可定向”表面（如球面、圆柱面）上，你可以一直分清楚哪一面是“外侧/正面”。但在莫比乌斯带这类表面上，你沿着表面走一圈会回到原点，却发现“正面”变成了“反面”，说明无法在全局上保持一致的正反面定义。","常见相关词：orientable（可定向的），orientation（定向/取向），Möbius strip（莫比乌斯带），Klein bottle（克莱因瓶），topology（拓扑学）。"]}
{"word":"nonoriental","summary":{"en":"“Nonoriental” means “not Oriental / not Asian or Eastern,” but it’s uncommon and can sound outdated because “Oriental” (for people) is often considered inappropriate in modern American English.","zh":"“nonoriental”表示“非东方的/非亚洲的”，但用法少且偏旧；因为用“Oriental”指人常被认为不恰当，所以这个词也可能显得不合时宜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not Oriental (i.e., not from Asia or the “East”); describing a person, culture, or thing as not Asian/Eastern.","zh":"非“东方的/亚洲的”（传统上指不来自亚洲或“东方”）；用于描述某人、文化或事物不属于亚洲/东方范畴。"},"examples":[{"en":"The museum’s collection includes both Oriental and nonoriental art.","zh":"这家博物馆的馆藏既包括“东方艺术”，也包括非东方艺术。"},{"en":"Some older documents divide employees into Oriental and nonoriental categories.","zh":"一些较旧的文件把员工分成“东方人”和“非东方人”两类。"}]}],"synonyms":["non-Asian","non-Eastern","Western (depending on context)"],"phonetic":"/ˌnɑnˌɔriˈɛntəl/","extraExplanation":["“nonoriental”是比较少见、偏旧式的用法，常见于早期分类、档案或学术语境中，用来与“Oriental”对立。","需要注意用词敏感性：在现代英语里，用“Oriental”指人往往被认为过时或带有冒犯性（尤其在美国语境），因此“nonoriental”也可能显得把人硬分成两类。更中性、清晰的表达通常是：non-Asian（非亚洲的/非亚洲人）、not of Asian origin（非亚洲血统/出身）、Western vs. Asian（西方与亚洲）或直接具体写国家/地区（e.g., Japanese, Korean, Vietnamese）。","如果你是在写研究或历史材料，最好说明这是“historical term / archival wording（历史用语/档案用语）”，或改用更精确的地区名称，以避免刻板印象。"]}
{"word":"nonorientation","summary":{"en":"Nonorientation means a lack of orientation—especially not knowing time, place, or situation; it can also mean having no fixed direction (less common).","zh":"nonorientation 指“定向力缺失/缺乏方向感”，多用于医学或心理语境；也可指“无固定方向（较少见）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of orientation; the state of not knowing where you are, what time it is, or what is happening (often used in medical or psychological contexts).","zh":"（常用于医学/心理语境）定向力缺失；指对地点、时间或现实情况缺乏辨识能力的状态。"},"examples":[{"en":"After the accident, she experienced nonorientation and couldn’t say what day it was.","zh":"事故之后，她出现了定向力缺失，说不出今天是星期几。"},{"en":"The nurse checked for signs of nonorientation to time and place.","zh":"护士检查他是否有对时间和地点的定向力缺失迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"A condition of having no fixed direction or alignment; not being oriented toward any particular side or goal (less common).","zh":"（较少见）无固定方向/取向；不朝向某一特定方向或目标的状态。"},"examples":[{"en":"The artist used nonorientation to make the viewer feel unsettled, with no clear ‘up’ or ‘down.’","zh":"这位艺术家利用“无方向感”的效果，让观众感到不安，因为画面没有明确的“上”或“下”。"}]}],"synonyms":["disorientation","confusion","loss of orientation","bewilderment"],"phonetic":"/ˌnɑnˌɔriɛnˈteɪʃən/","extraExplanation":["这个词相对少见，更常见的日常说法是 disorientation（迷失方向/意识混乱）。在临床上，orientation 常指“定向力”，会具体分为：对人（person）、对地（place）、对时（time）、对事（situation）的定向力；nonorientation 就是这些能力的缺失或明显下降。","构词上：non-（否定前缀）+ orientation（定向/取向）。写作中也可能看到 non-orientation（加连字符）这种形式。"]}
{"word":"nonoriginal","summary":{"en":"“Nonoriginal” means not original (copied or derived) and can also mean uncreative or predictable.","zh":"“nonoriginal”表示“非原创的（抄袭/仿作/改编而来）”，也可指“缺乏新意、老套的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not original; copied, imitated, or not created first-hand.","zh":"非原创的；非原作的；抄袭的／仿造的（不是最初创作出来的）。"},"examples":[{"en":"The teacher rejected the essay because parts of it were nonoriginal.","zh":"老师拒收了那篇作文，因为其中有些内容不是原创的。"},{"en":"The film felt nonoriginal, borrowing too many ideas from earlier movies.","zh":"这部电影让人觉得不够原创，借用了太多早期电影的点子。"},{"en":"Please submit only original work; nonoriginal content may violate copyright rules.","zh":"请只提交原创作品；非原创内容可能违反版权规定。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking new ideas; uncreative or predictable.","zh":"缺乏新意的；没有创意的；老套的。"},"examples":[{"en":"The storyline is entertaining but a bit nonoriginal.","zh":"剧情挺有趣，但有点老套。"},{"en":"Try to avoid nonoriginal slogans when you write an advertisement.","zh":"写广告时尽量避免老套的口号。"}]}],"synonyms":["unoriginal","derivative","copied","imitative","predictable","formulaic"],"phonetic":"/ˌnɑnəˈrɪdʒənəl/","extraExplanation":["“nonoriginal”在日常英语中不算常见；更自然的写法通常是加连字符的“non-original”，或直接用“unoriginal / not original / derivative / copied”。","构词上是前缀“non-（不、非）”+“original（原创的）”。在正式写作里，遇到这种组合形容词常用连字符来增强可读性（如 non-original）。"]}
{"word":"nonoriginally","summary":{"en":"“Nonoriginally” (often “non-originally”) means either “not originally” (added later / not from the first source) or “in an unoriginal, copied way.”","zh":"“nonoriginally”（常写作 non-originally）可指“并非最初地/后期才有”，也可指“以不原创、带模仿/抄袭的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Uncommon; often written as “non-originally”.) Not originally; not from the earliest time or first source.","zh":"（不常见；常写作 non-originally）并非最初地；并非从一开始/原始来源地。"},"examples":[{"en":"The text was added nonoriginally during later edits, not by the first author.","zh":"这段文字并非最初就有，而是在后期编辑时加上去的。"},{"en":"The building was nonoriginally painted white; earlier photos show it was red.","zh":"这栋楼并非最初就被刷成白色；早期照片显示它原来是红色的。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not original; in a copied, derivative, or uncreative manner.","zh":"以非原创的方式；以模仿、抄袭或缺乏创意的方式。"},"examples":[{"en":"He solved the problem nonoriginally by copying the sample solution.","zh":"他用非原创的方式解决了问题——照抄了示例答案。"},{"en":"The melody sounds nonoriginally similar to an older song.","zh":"这段旋律听起来和一首老歌相似得不太原创。"}]}],"synonyms":["not originally","later","subsequently","unoriginally","inauthentically","derivatively"],"phonetic":"/ˌnɑnəˈrɪdʒənəli/","extraExplanation":["“nonoriginally”不是很常见的标准词形，更常见的写法是用短语 **not originally**（并非最初）来表达时间/来源上的“不是一开始”。如果你想表达“缺乏原创性”，通常更自然的说法是 **in a non-original way**、**unoriginally**（不够有创意地）、或更具体的 **by copying**（通过照抄/模仿）。","写作建议：如果你在学术或正式写作中使用它，最好加连字符写成 **non-originally**，或直接改用更常见的替代表达，以避免读者觉得生硬或不规范。"]}
{"word":"nonornamental","summary":{"en":"Nonornamental means “not decorative; plain and focused on function.”","zh":"nonornamental 指“非装饰性的、朴素的，偏重功能而非美观”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not decorative; lacking ornamentation; plain in appearance or style.","zh":"非装饰性的；没有装饰的；外观或风格朴素的。"},"examples":[{"en":"They chose a nonornamental fence that was sturdy and easy to maintain.","zh":"他们选择了一个非装饰性的围栏，结实又容易维护。"},{"en":"Her writing style is clear and nonornamental, focusing on facts over flourish.","zh":"她的写作风格清晰朴素，重事实而不追求辞藻。"},{"en":"The room had a nonornamental design: simple lines, neutral colors, and minimal decor.","zh":"这个房间是非装饰性的设计：线条简洁、颜色中性、装饰极少。"}]}],"synonyms":["plain","unadorned","undecorated","functional","utilitarian"],"phonetic":"/ˌnɑnˌɔr.nəˈmɛn.t̬əl/","extraExplanation":["“non-”是英语里常见的否定前缀，表示“非、无、不”。“ornamental”来自“ornament”（装饰品/装饰），所以“nonornamental”字面意思就是“不是用来装饰的”。","这个词常见于设计、建筑、园艺、写作风格等语境：强调功能性（functional）或实用性（practical）而非美观性（decorative）。"]}
{"word":"nonornamentality","summary":{"en":"Nonornamentality means a deliberate lack of decoration or embellishment, often valued in minimalist design or plain style.","zh":"nonornamentality 指“刻意不装饰、去修饰”的特质或理念，常见于极简设计或朴素风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or principle of being non-ornamental; a deliberate lack of decoration or embellishment (often in design, art, architecture, writing, or style).","zh":"非装饰性；不以装饰为目的的特质或原则（常用于设计、艺术、建筑、写作或风格中，强调刻意的简洁与无装饰）。"},"examples":[{"en":"The brand’s identity is built on nonornamentality—clean lines, neutral colors, and no extra detail.","zh":"这个品牌的形象建立在非装饰性之上——线条干净、色彩中性、没有多余细节。"},{"en":"The essay’s power comes from its nonornamentality: short sentences and plain, direct language.","zh":"这篇文章的力量来自它的非装饰性：句子短、语言朴素直接。"}]}],"synonyms":["simplicity","plainness","austerity","restraint","minimalism","lack of ornamentation","unadornedness"],"phonetic":"/ˌnɑnˌɔr.nə.mɛnˈtæl.ə.ti/","extraExplanation":["“nonornamentality”不是日常高频词，更常见的表达包括：simplicity（简洁）、plainness（朴素）、lack of ornamentation（缺少装饰）、unadorned style（不加修饰的风格）。在艺术与建筑语境里，它常与 modernism / minimalism（现代主义/极简主义）相关，强调“功能优先、去装饰”。","构词上：non-（不/非）+ ornament（装饰）+ -ality（……的性质）。因此它通常指“审美或设计原则”，而不只是“没有装饰物”这个客观状态。"]}
{"word":"nonornamentally","summary":{"en":"Nonornamentally means “plainly; without decorative details; in a functional way.”","zh":"nonornamentally 指「不加裝飾地、樸素地、以功能性為主地」。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not decorative; without ornament; plainly and functionally","zh":"以不具裝飾性的方式；不加裝飾；樸素、偏功能性地"},"examples":[{"en":"The building is designed nonornamentally, with clean lines and no extra decoration.","zh":"這棟建築採用非裝飾性的設計，線條俐落，沒有多餘裝飾。"},{"en":"She writes nonornamentally, focusing on clarity rather than fancy wording.","zh":"她的寫作風格不事雕琢，重視清楚明白，而不是華麗措辭。"},{"en":"The report presents the data nonornamentally, without emotional language.","zh":"這份報告用不帶修飾的方式呈現數據，不使用情緒化語言。"}]}],"synonyms":["plainly","unadornedly","simply","austerely","utilitarianly"],"phonetic":"/ˌnɑnˌɔrnəˈmɛntəli/","extraExplanation":["「nonornamentally」是比較少見、偏書面（尤其在建築、設計、寫作風格評論中）的副詞，來自形容詞「nonornamental」（不具裝飾性的）。語氣通常是中性：強調「不以裝飾取勝、以功能與清楚為主」。","容易和「unornamentally」混用；兩者都可表示「不加裝飾地」。在實際語感上，non- 更像是在分類/對比（ornamental vs. nonornamental），un- 更像是否定「有裝飾」這個狀態。"]}
{"word":"nonorthodox","summary":{"en":"Nonorthodox means unconventional or not following traditional/accepted rules or beliefs (often used for ideas, methods, or religious views).","zh":"nonorthodox 表示“非正统的、非传统的、不按常规的”，常用于形容想法、做法或（宗教）观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not following traditional or accepted beliefs, rules, or ways of doing things; unconventional.","zh":"不遵循传统或公认的信念、规则或做法的；非正统的；不按常规的。"},"examples":[{"en":"She took a nonorthodox approach to studying by turning the whole course into a set of games.","zh":"她用一种非正统的学习方法，把整门课变成了一套游戏。"},{"en":"The company’s nonorthodox marketing strategy attracted a lot of attention online.","zh":"这家公司不按常规的营销策略在网上吸引了大量关注。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Especially in religion) Not orthodox; not aligned with official or traditionally accepted doctrines.","zh":"（尤指宗教）非正统的；不符合官方或传统教义的。"},"examples":[{"en":"His views were considered nonorthodox within the community.","zh":"在那个社群里，他的观点被认为是非正统的。"}]}],"synonyms":["unconventional","unorthodox","nontraditional","heterodox"],"phonetic":"/ˌnɑnˈɔrθəˌdɑks/","extraExplanation":["词形提示：non- 表示“非、不”，orthodox 表示“正统的、传统认可的”。所以 nonorthodox = “不正统的/不按常规的”。","使用场景：在日常语境里更常用来表示“方法、想法很不走寻常路”（通常是中性或偏正面）；在宗教或意识形态语境里则更像“非正统教义/观点”（可能更敏感或带评价色彩）。","近义词对比：unconventional（不寻常但不一定挑战规则）、unorthodox（更常见拼写，含义几乎相同）、heterodox（多用于宗教/学术，偏“异端/非正统”语感更强）。"]}
{"word":"nonorthodoxly","summary":{"en":"“Nonorthodoxly” means doing something in an untraditional or unconventional way.","zh":"“nonorthodoxly”表示“以非传统/不按常规的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not traditional, not accepted as standard, or different from what most people expect.","zh":"以非传统的方式；不按常规地；不正统地。"},"examples":[{"en":"She approached the problem nonorthodoxly and found a simpler solution.","zh":"她用非传统的方式处理这个问题，反而找到了更简单的解决办法。"},{"en":"The team trained nonorthodoxly, focusing more on flexibility than strength.","zh":"这支队伍训练方式不按常规，更注重柔韧性而不是力量。"}]}],"synonyms":["unconventionally","untraditionally","in an unorthodox way","atypically"],"phonetic":"/ˌnɑnˈɔrθədɑksli/","extraExplanation":["“nonorthodoxly”来自形容词“nonorthodox（非正统的）”+副词后缀“-ly”。它在日常口语里不算常见，更常用的说法是“in an unorthodox way / in a nontraditional way / unconventionally”。","注意区分：orthodox 常指“正统的、传统认可的”（也可指宗教“东正教/正统派”语境）；nonorthodox 强调“偏离常规但不一定是错误”。如果想表达“违反规则/不合法”，更可能用“illegally / improperly”。"]}
{"word":"nonorthogonal","summary":{"en":"Nonorthogonal means “not at right angles” or, more generally in technical contexts, “not independent/correlated.”","zh":"nonorthogonal 指“非正交的”：不成直角；在技术语境中也可指“不独立/有相关性”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not orthogonal; not meeting at a right angle (90°).","zh":"非正交的；不成直角（90°）的。"},"examples":[{"en":"The two lines are nonorthogonal, so they intersect at an angle other than 90 degrees.","zh":"这两条线是非正交的，因此它们相交的角度不是90度。"},{"en":"A nonorthogonal grid can make measurement and alignment more complicated.","zh":"非正交网格会让测量和对齐更复杂。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/physics/engineering) Not independent or perpendicular in a broader sense; having some overlap, correlation, or interaction.","zh":"（数/物/工）在更广义上不独立或不垂直；存在重叠、相关或相互影响。"},"examples":[{"en":"In the model, the factors are nonorthogonal, meaning they are correlated.","zh":"在这个模型中，各因素是非正交的，也就是说它们彼此相关。"},{"en":"Noise sources can be nonorthogonal, so you can’t cleanly separate them.","zh":"噪声源可能是非正交的，因此无法把它们清晰地分离开。"}]}],"synonyms":["not perpendicular","oblique","skew","non-perpendicular","correlated","dependent"],"phonetic":"/ˌnɑn ɔrˈθɑɡənəl/","extraExplanation":["词根拆解：non- 表示“非/不”，orthogonal 来自 “orth-（正/直）+ -gon（角）”，字面上可理解为“成直角的”。所以 nonorthogonal 就是“不是成直角的”。","在日常英语里这个词比较偏学术/技术（线性代数、统计、物理、工程、计算机图形学等）。如果是一般表达“互相影响/不独立”，更常用的说法是 not independent、correlated、interacting。","常见搭配：nonorthogonal axes（非正交坐标轴）、nonorthogonal basis（非正交基）、nonorthogonal components（非正交分量）、nonorthogonal design（非正交设计，常见于实验设计/统计语境）。"]}
{"word":"nonorthogonality","summary":{"en":"Nonorthogonality means not being orthogonal (not perpendicular / not zero dot product).","zh":"nonorthogonality 指“非正交性”，即不正交（不垂直、点积不为 0、存在重叠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The property of not being orthogonal—i.e., not at right angles; in math/physics, not having zero dot product or not being mutually independent in the “perpendicular” sense.","zh":"“非正交性”：不正交的性质；即不成直角。在数学/物理中，指向量（或状态）点积不为 0，或彼此不是“垂直/互不相关”的关系。"},"examples":[{"en":"Because of measurement noise, the two feature vectors show nonorthogonality, so their dot product is not zero.","zh":"由于测量噪声，这两个特征向量出现非正交性，因此它们的点积不为 0。"},{"en":"In quantum mechanics, nonorthogonality means two states can overlap, so they are not perfectly distinguishable.","zh":"在量子力学中，非正交性意味着两个态存在重叠，因此无法被完美地区分。"}]}],"synonyms":["lack of orthogonality","non-perpendicularity","overlap (in quantum contexts)"],"phonetic":"/ˌnɑnˌɔrθəˌɡəˈnælɪti/","extraExplanation":["这个词常见于线性代数、信号处理、机器学习和量子力学等领域。直观理解：正交像“互相垂直、互不干扰”，而非正交表示“有重叠/有关联”。","数学上，若向量 a 和 b 的点积 a·b ≠ 0，就称它们 nonorthogonal（不正交）；对应名词就是 nonorthogonality（非正交性）。在统计/机器学习里，这常与“特征相关、共线性”有关。","量子力学里，正交态可以被完全区分；非正交态有重叠（overlap），因此任何测量都不能把它们 100% 区分开，这和“不可完美判别”联系很紧密。"]}
{"word":"nonorthographic","summary":{"en":"Nonorthographic describes writing or representation that does not follow standard spelling (orthography), often used for informal spellings or to imitate speech.","zh":"nonorthographic 指不遵循标准拼写（正字法）的写法或表达方式，常见于非正式拼写或用拼写模仿口语/口音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics, writing systems) Not using a standardized spelling system (orthography), or not written in a conventional, “correct” spelling form.","zh":"（语言学/书写系统）非正字法的；不采用标准拼写体系（正字法）的；不按常规/规范拼写书写的。"},"examples":[{"en":"In many text messages, people use nonorthographic spelling like “u” for “you.”","zh":"在很多短信里，人们会用非正字法拼写，比如用“u”代替“you”。"},{"en":"The study compared children’s early, nonorthographic writing with their later standard spelling.","zh":"这项研究比较了儿童早期的非正字法书写与后来形成的标准拼写。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general) Not represented through normal written symbols; not easily captured by standard spelling (often used when discussing speech sounds, accents, or informal writing).","zh":"（更一般）不通过常规书写符号来呈现的；难以用标准拼写准确表达的（常用于谈论口音、语音细节或非正式写法）。"},"examples":[{"en":"Some pronunciation differences are hard to show in a dictionary because they are nonorthographic.","zh":"有些发音差异很难在词典里用拼写体现出来，因为它们属于非正字法层面的差异。"},{"en":"Fans wrote nonorthographic versions of the catchphrase to imitate the character’s accent.","zh":"粉丝用非正字法的写法来模仿角色口音，写出了这句口头禅的各种版本。"}]}],"synonyms":["nonstandard (spelling)","nonconventional","phonetic (spelling)","eye-dialect (context-specific)"],"phonetic":"/ˌnɑnˌɔrθəˈɡræfɪk/","extraExplanation":["“non-”=“不/非”，orthographic 来自 orthography（正字法/拼写体系）。在语言学里，它常用来区分“标准拼写（orthographic）”与“反映口语或个人写法的拼写（nonorthographic）”，例如把口音用拼写‘拼出来’（eye dialect），或用短信缩写表达口语语气。"]}
{"word":"nonorthographical","summary":{"en":"Nonorthographical means “not following standard spelling,” or “not based on ordinary letter spelling (orthography).”","zh":"nonorthographical 指“非标准拼写的”，或“不是基于常规字母拼写（正字法）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to standard spelling (orthography), or not following normal spelling conventions.","zh":"非正字法的；与标准拼写（正字法）无关的，或不遵循常规拼写规则的。"},"examples":[{"en":"Text messages often contain nonorthographical spellings like “u” for “you.”","zh":"短信里常见一些非正字法拼写，比如用“u”代替“you”。"},{"en":"The researcher compared children’s nonorthographical writing with their later standard spelling.","zh":"研究者比较了儿童的非正字法书写与他们后来形成的标准拼写。"}]},{"partOfSpeech":"adj.","definition":{"en":"In linguistics or writing systems: describing information or representation based on sound, meaning, or another system rather than letters/spelling.","zh":"（语言学/书写系统）指基于语音、意义或其他系统的信息/表示方式，而不是基于字母与拼写的。"},"examples":[{"en":"IPA is a nonorthographical system used to show pronunciation.","zh":"国际音标（IPA）是一种用于标注发音的非正字法系统。"},{"en":"The dictionary provides nonorthographical pronunciation guides for each entry.","zh":"这本词典为每个词条提供非正字法的发音标注。"}]}],"synonyms":["nonorthographic","nonstandard (spelling)","nonconventional (spelling)","phonetic (as spelling)"],"phonetic":"/ˌnɑnˌɔrθəˈɡræfɪkəl/","extraExplanation":["这个词更常见的写法是 **non-orthographic / nonorthographic**，意思是“非正字法的”。你输入的 **nonorthographical** 也能被理解，但在学术写作中通常更偏好用 nonorthographic（形容词）来修饰名词，比如 nonorthographic spelling / nonorthographic representation。","orthography（正字法）指一种语言“标准的写法/拼写规则”。因此 nonorthographical 常用来谈：网络拼写、拼写错误、方言写法、用音标或符号系统标注发音（不直接用字母拼写）。"]}
{"word":"nonorthographically","summary":{"en":"Nonorthographically means “not based on spelling or standard written forms,” often used in linguistics when focusing on sounds rather than letters.","zh":"Nonorthographically 指“以不基于拼写或标准书写形式的方式”，常用于语言学语境，强调按语音而非字母来分析。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not related to spelling or standard written forms; in a non-spelling-based manner (often used when discussing pronunciation, speech sounds, or language rules).","zh":"以不基于拼写（非正字法）的方式；不依赖标准书写形式地（常用于讨论发音、语音或语言规则）。"},"examples":[{"en":"In some English words, the final sounds change nonorthographically, even though the spelling stays the same.","zh":"在一些英语单词中，词尾的声音会以非正字法的方式发生变化，即使拼写保持不变。"},{"en":"The researcher analyzed the speakers’ patterns nonorthographically, focusing on sounds instead of letters.","zh":"研究者以非正字法的方式分析说话者的模式，关注的是声音而不是字母。"}]}],"synonyms":["non-orthographically","phonologically","phonetically","sound-based"],"phonetic":"/ˌnɑnˌɔrθəˈɡræfɪkli/","extraExplanation":["这个词很少在日常英语中出现，主要见于语言学、语音学、读写研究等学术语境。","词形结构：non-（否定前缀）+ orthographic（正字法的/与拼写相关的）+ -ly（副词后缀）。整体意思就是“不是按拼写来（考虑/分析）”。","常见对比：orthographically（按拼写/按书写规则地） vs. nonorthographically（不按拼写、按语音或实际使用来地）。"]}
{"word":"nonoscine","summary":{"en":"Nonoscine means “not oscine”—a bird (or bird group) that is not a songbird-type oscine.","zh":"nonoscine 表示“非鸣禽的；不属于鸣禽（oscine）类的（多用于鸟类分类语境）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Ornithology) Not oscine; not belonging to the oscines (songbirds) that have a highly specialized vocal apparatus for singing.","zh":"（鸟类学）非鸣禽的；不属于鸣禽（oscines，歌鸟类）这一类、其发声器官不以复杂鸣唱为特征的。"},"examples":[{"en":"Nonoscine birds generally do not sing the way many finches and sparrows do.","zh":"非鸣禽通常不像许多雀类那样会唱出复杂的歌声。"},{"en":"The guidebook separates passerines into oscine and nonoscine groups for easier identification.","zh":"这本野外手册把雀形目鸟类分成鸣禽与非鸣禽两组，便于辨认。"},{"en":"Some tropical species are classified as nonoscine and communicate more with calls than songs.","zh":"一些热带物种被归为非鸣禽，它们更多用叫声而不是“歌声”交流。"}]}],"synonyms":["non-oscine","not oscine","suboscine (related term, in many classifications)"],"phonetic":"ˌnɑnˈɑˌsaɪn","extraExplanation":["“nonoscine”多见于鸟类学/科普写作里，意思是“不是oscine（鸣禽）”。在很多资料中也会写作“non-oscine”（带连字符），更清晰、更常见。","“oscine”通常指雀形目中的鸣禽类（常与“suboscine/非鸣禽类”对比）。是否属于鸣禽，与鸣管（syrinx）结构与学习鸣唱的能力有关。","如果你是在找网络梗“nonse / nonce”那类词，它和“nonoscine”没有关系：nonoscine是学术用词，指鸟类分类。"]}
{"word":"nonosmotic","summary":{"en":"Nonosmotic means “not related to osmosis,” especially in medical contexts (e.g., nonosmotic triggers of ADH release).","zh":"nonosmotic 指“与渗透作用/渗透压无关的”，多用于医学语境（如非渗透性刺激引发ADH分泌）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Physiology/medicine) Not caused by or involving osmosis or osmotic pressure.","zh":"（生理学/医学）非由渗透作用或渗透压引起的；不涉及渗透的。"},"examples":[{"en":"The patient’s ADH release was triggered by nonosmotic stimuli such as nausea and pain.","zh":"病人的抗利尿激素（ADH）释放是由恶心、疼痛等非渗透性刺激触发的。"},{"en":"Nonosmotic thirst can occur when blood volume drops, even if blood sodium is normal.","zh":"当血容量下降时，即使血钠正常，也可能出现非渗透性口渴。"}]}],"synonyms":["not osmotic","non-osmotic","non–osmotically mediated"],"phonetic":"/ˌnɑn.ɑzˈmɑtɪk/","extraExplanation":["这个词多见于医学语境，常与 **ADH（抗利尿激素/加压素）** 或“口渴机制”一起出现：\n- **osmotic（渗透性）**：主要指血浆渗透压升高（例如血钠升高）导致的反应。\n- **nonosmotic（非渗透性）**：指与渗透压无关的触发因素，例如低血容量/低血压、疼痛、恶心、压力、某些药物等。\n临床上常说“nonosmotic ADH secretion（非渗透性ADH分泌）”。"]}
{"word":"nonosmotically","summary":{"en":"Nonosmotically means “not by osmosis; not due to osmotic pressure.” It is mainly used in scientific contexts.","zh":"nonosmotically 表示“非通过渗透作用；并非由渗透压导致地”，主要用于科学/医学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not involve osmosis (the movement of water across a semi‑permeable membrane due to differences in solute concentration).","zh":"以不涉及渗透作用（因溶质浓度差而导致水分跨半透膜移动）的方式。"},"examples":[{"en":"Some water can enter the cell nonosmotically through active transport mechanisms.","zh":"有些水分可以通过主动运输机制以非渗透方式进入细胞。"},{"en":"The tissue swelled nonosmotically, suggesting the cause was not a solute imbalance.","zh":"组织出现非渗透性肿胀，提示原因并非溶质失衡。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not caused by osmotic pressure or osmotic effects.","zh":"以非渗透压（或非渗透效应）所致的方式；不是由渗透压引起地。"},"examples":[{"en":"Fluid accumulated nonosmotically due to changes in membrane structure.","zh":"由于膜结构变化，液体以非渗透压机制聚集。"},{"en":"The model separates osmotically and nonosmotically driven water flow.","zh":"该模型将由渗透作用驱动与非渗透机制驱动的水流分开处理。"}]}],"synonyms":["non-osmotically","not osmotically","by a nonosmotic mechanism"],"phonetic":"ˌnɑnɑzˈmɑtɪkli","extraExplanation":["“nonosmotically”在学术写作（生理学、生物化学、植物学、肾脏学等）中更常见，日常英语很少用。更常见的拼写是带连字符的 **non-osmotically**。","理解它的关键是先掌握 **osmosis（渗透作用）**：水会从“溶质较少的一侧”移动到“溶质较多的一侧”。如果某个过程被描述为 nonosmotically，通常表示水/液体变化主要由其他机制造成（如主动运输、膜通道变化、结构性损伤或压力差等），而不是由溶质浓度差导致。"]}
{"word":"nonostensible","summary":{"en":"Nonostensible means “not apparent or openly shown; hidden or unofficial.”","zh":"nonostensible 指“非表面的、不明显的、不公开显露的；带有隐藏或非正式之意”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not ostensible; not apparent or openly shown (often implying something is hidden, unofficial, or not immediately obvious).","zh":"非表面的；不明显的；不公开显示的（常暗示有隐藏、非正式或不易察觉的成分）。"},"examples":[{"en":"The committee’s nonostensible goal was to protect the company’s image, not to fix the problem.","zh":"委员会不公开的目标是维护公司的形象，而不是解决问题。"},{"en":"Her nonostensible annoyance showed only in small pauses and a tight smile.","zh":"她不明显的恼怒只在短暂的停顿和勉强的微笑里流露出来。"}]}],"synonyms":["not apparent","not obvious","hidden","covert","unacknowledged","implicit","understated"],"phonetic":"/ˌnɑnɑˈstɛnsəbəl/","extraExplanation":["这个词由否定前缀 non-（“不、非”）+ ostensible（“表面上的、看似的、公开宣称的”）构成，因此整体意思就是“不是表面上那样/不公开显露”。在现代英语里更常见的说法是 not apparent、not obvious、hidden、unofficial、covert；在正式写作中也可用 unacknowledged（不被承认的）或 implicit（含蓄的、未明说的）。","使用提示：nonostensible 常带有“并非公开理由/表面理由”的语感，适合描述动机、目的、利益或情绪等。比如：a nonostensible motive（不明说的动机）、a nonostensible agenda（隐性的议程）。"]}
{"word":"nonostensibly","summary":{"en":"Nonostensibly means “not openly or obviously; in a hidden or unobvious way.”","zh":"nonostensibly 表示“并非公开或明显地；以隐蔽、不易察觉的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not obvious, apparent, or openly shown; in a concealed or hidden manner.","zh":"以不明显、不显而易见的方式；隐蔽地、暗中地。"},"examples":[{"en":"He was praised publicly, but nonostensibly criticized behind the scenes.","zh":"他在公开场合受到称赞，但在幕后却被暗中批评。"},{"en":"The policy nonostensibly favors large companies, even though it claims to help small businesses.","zh":"这项政策虽然声称要帮助小企业，但实际上在不易察觉的层面更偏向大公司。"}]}],"synonyms":["subtly","quietly","discreetly","covertly","not openly"],"phonetic":"/ˌnɑnəˈstɛnsəbli/","extraExplanation":["“nonostensibly”是比较少见、偏正式的副词，来自形容词“nonostensible（不明显的；非表面上的）”，而“ostensible”常用于“ostensible reason（表面原因）”。所以“nonostensibly”强调“不是表面上看得到的那种方式/原因”。","容易和两个常见词混淆：\n1) “nonetheless”（尽管如此）= 转折连接词/副词；\n2) “unostentatiously”（不张扬地）= 指“不过分炫耀”，偏“风格低调”，不等于“原因隐藏”。\n如果你想表达“低调不炫耀”，更自然的是用“unostentatiously”。","学习建议：日常写作里更常用“quietly / discreetly / subtly / behind the scenes / not openly”来替换“nonostensibly”，语气更自然。"]}
{"word":"nonostensive","summary":{"en":"Nonostensive means “not defined or taught by pointing to an example,” especially in philosophy/linguistics.","zh":"nonostensive 指“非指示性的”，即不通过指给你看某个实例来定义或教授词义，常用于哲学/语言学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not ostensive; not based on pointing to an example or showing something directly (used especially in philosophy and linguistics).","zh":"非指示性的；不是通过“指给你看/指着实例”来说明或定义的（多用于哲学、语言学）。"},"examples":[{"en":"The teacher gave a nonostensive explanation of “justice” rather than pointing to a single example.","zh":"老师用非指示性的方式解释“正义”，而不是指着某一个例子来说明。"},{"en":"Some abstract ideas are easier to learn through nonostensive definitions.","zh":"有些抽象概念更适合通过非指示性的定义来学习。"}]}],"synonyms":["non-ostensive","non-demonstrative","non-deictic","descriptive"],"phonetic":"/ˌnɑn.ɑˈstɛn.sɪv/","extraExplanation":["“ostensive”指“指示性的/示范性的”，常见于“ostensive definition（指示定义）”：通过指给你看一个对象或例子来说明词义，比如指着苹果说“This is an apple.”\n“nonostensive”就是“不靠指给你看”的方式来定义或解释，常见做法包括：用同义词、特征描述、规则、上下位关系等来说明。","这个词比较少见；实际写作中更常见的是连字符形式“non-ostensive”。在哲学、语义学或儿童语言习得的讨论里更容易看到。"]}
{"word":"nonostensively","summary":{"en":"“Nonostensively” means “without directly pointing/showing what you mean,” often in language learning or philosophy.","zh":"“nonostensively”指“以非指示式的方式（不直接指给别人看/展示所指对象）”，常用于语言学习或哲学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is non-ostensive: without directly showing, pointing to, or explicitly naming the thing being referred to (especially in language learning, philosophy, or psychology). ([universalium.en-academic.com](https://universalium.en-academic.com/159106/nonostensive?utm_source=openai))","zh":"以“非指示式/非直接示范”的方式：不通过直接指给别人看、展示或明确点名所指对象来表达或让人理解（常见于语言习得、哲学或心理学语境）。 ([universalium.en-academic.com](https://universalium.en-academic.com/159106/nonostensive?utm_source=openai))"},"examples":[{"en":"The caregiver helped the toddler learn the new word nonostensively, by reacting to events rather than pointing at the object.","zh":"照顾者用非指示式的方法帮助幼儿学会新词：通过对事件的反应，而不是指着物体让孩子记。"},{"en":"In class, the teacher introduced the concept nonostensively, using a story and context clues instead of an ostensive definition.","zh":"课堂上，老师用非指示式的方法引入这个概念：讲故事并让学生用语境线索推断，而不是用指示性定义。"}]}],"synonyms":["implicitly","indirectly","non-demonstratively","without pointing"],"phonetic":"ˌnɑnɑˈstɛnsɪvli","extraExplanation":["“nonostensively”来自形容词 nonostensive（非指示式的）。这里的“ostensive”意思是“通过指给你看来说明”（如哲学里的 ostensive definition，指着苹果说“这叫苹果”）。","它很容易被误读为“unostentatiously（不张扬地）”或“ostensibly（表面上/看似）”。这几个词长得像，但意义不同：\n- ostensive / nonostensive：偏“指示/展示以便理解”（学术用语更常见）。\n- ostentatious / unostentatiously：偏“炫耀/不炫耀”（日常描述更常见）。\n- ostensibly：偏“表面上、看起来”。 ([collinsdictionary.com](https://www.collinsdictionary.com/us/dictionary/english/unostentatiously?utm_source=openai))"]}
{"word":"nonostentation","summary":{"en":"Nonostentation means being simple and not showy—avoiding behavior or style meant to impress others.","zh":"nonostentation 指“朴素低调、不铺张不炫耀”，强调避免用夸张排场来博人眼球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being simple and not trying to impress others; the absence of showiness (a lack of ostentation)","zh":"不铺张；不炫耀；朴素低调（没有“卖弄、摆阔”的作风）"},"examples":[{"en":"She wore a plain black dress out of nonostentation, letting her work speak for itself.","zh":"她出于不炫耀的态度穿了一件朴素的黑裙子，让成果自己说话。"},{"en":"The award ceremony was marked by nonostentation—no long speeches, no flashy displays.","zh":"颁奖仪式以不铺张为特色——没有冗长致辞，也没有华丽排场。"}]}],"synonyms":["simplicity","modesty","plainness","restraint","understatement","unpretentiousness"],"phonetic":"/ˌnɑnˌɑstɛnˈteɪʃən/","extraExplanation":["“nonostentation”由前缀 non-（不、无）+ “ostentation”（炫耀、铺张）构成，意思就是“没有炫耀/排场”。在现代英语里，这个词相对少见，写作中更常见的表达是 “lack of ostentation”“simplicity”“modesty” 或 “understatement”（更偏“含蓄克制”的风格）。","语域上偏正式，常用于描述人的风格（低调、朴素）、活动/仪式的安排（不铺张），也可用来评价艺术与设计（不追求浮夸效果）。"]}
{"word":"nonoutlawries","summary":{"en":"**nonoutlawries** = plural of *nonoutlawry*: cases/instances of not being under outlawry (still protected by law).","zh":"**nonoutlawries** 是 *nonoutlawry* 的复数：指“未处于 outlawry（被法律放逐）之下、仍受法律保护”的一些情况/实例。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of **nonoutlawry**: the condition of **not** being declared an outlaw (i.e., still being under the protection of the law).","zh":"**nonoutlawry** 的复数：指“未被宣告为歹徒/被剥夺法律保护”的状态；即仍受法律保护。"},"examples":[{"en":"In medieval legal records, the clerk noted the defendant’s **nonoutlawries** after he finally appeared in court.","zh":"在中世纪的法律记录中，书记官在被告最终出庭后，记录了他的 **nonoutlawries**（未被宣布为被法律放逐者的状态）。"},{"en":"The historian compared cases of **outlawry** with rare mentions of **nonoutlawries** in the same county.","zh":"这位历史学家把“outlawry（被法律放逐）”的案件与同一郡县中罕见提到的 **nonoutlawries** 做了比较。"}]}],"synonyms":["not being outlawed","legal protection","lawful status"],"phonetic":"/ˌnɑnˈaʊtˌlɔɹiz/","extraExplanation":["这个词非常罕见，多见于词表/索引式收录，而不常用于现代日常英语写作。它是由前缀 **non-**（表示“非、不”）+ **outlawry**（法律术语：宣布某人“在法律保护之外”的状态）构成。","你输入的 **nonoutlawries** 是复数形式；单数是 **nonoutlawry**。在真正的法律/历史语境里，人们更常直接说“not outlawed / under the protection of the law（未被宣布为被法律放逐、仍受法律保护）”。"]}
{"word":"nonoutlawry","summary":{"en":"Nonoutlawry is a very rare noun meaning the state of not being outlawed—still protected by law (the opposite of outlawry).","zh":"Nonoutlawry 是极罕见名词，指“未被宣告为亡命者、仍受法律保护”的状态（与 outlawry 相对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, law/history) The condition of not being declared an outlaw; being under the protection of the law (the opposite of outlawry).","zh":"（罕见，法律/历史）未被宣布为“被剥夺法律保护的亡命者”的状态；仍受法律保护（outlawry 的反义概念）。"},"examples":[{"en":"After he appeared in court, he regained nonoutlawry and could travel without fear of arrest on sight.","zh":"他出庭后恢复了 nonoutlawry（受法律保护的身份），出行也不必担心被当场逮捕。"},{"en":"The petition asked the king to grant nonoutlawry to the accused family.","zh":"请愿书请求国王赐予该被告家族 nonoutlawry（免于被宣告 outlawry）。"}]},{"partOfSpeech":"n.","definition":{"en":"(very rare, extended sense) The absence of lawlessness; a state of being lawful or legally recognized.","zh":"（极罕见，引申义）无法无天状态的缺失；合法、受法律承认的状态。"},"examples":[{"en":"The writer contrasted frontier outlawry with the city’s nonoutlawry.","zh":"作者把边境的 outlawry（无法无天）与城市的 nonoutlawry（守法/受法律约束）作对比。"}]}],"synonyms":["legal protection","lawful status","good standing","legality"],"phonetic":"/ˌnɑnˈaʊtˌlɔːri/","extraExplanation":["这个词非常罕见，多见于词表或历史/法律语境。它是用前缀 non-（“非、无”）+ outlawry（“宣告某人被剥夺法律保护的处罚/状态；也可泛指无法无天”）构成，字面意思就是“非 outlawry”。","日常英语里通常不会用 nonoutlawry。更自然的表达是：not outlawed（未被宣布为亡命者）、in good legal standing（法律身份良好）、under the protection of the law（受法律保护）、lawful status（合法身份）等。"]}
{"word":"nonoutrage","summary":{"en":"Nonoutrage means “no outrage”—a lack of anger or protest about something harmful or unfair.","zh":"Nonoutrage 指“没有愤慨”——面对有害或不公的事情却缺乏愤怒或抗议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of anger, shock, or strong protest about something that many people would normally find wrong or harmful","zh":"（对本应引发愤怒或抗议的事情）不感到愤慨；缺乏愤怒、震惊或强烈反对"},"examples":[{"en":"What worried the journalist most was the public’s nonoutrage at repeated corruption scandals.","zh":"这位记者最担心的是，公众对一再发生的腐败丑闻竟然毫无愤慨。"},{"en":"After years of similar incidents, people reacted with nonoutrage—as if the injustice were normal.","zh":"在多年类似事件之后，人们以不愤慨的态度回应——仿佛这种不公已经成了常态。"}]}],"synonyms":["apathy","indifference","complacency","passivity","moral numbness"],"phonetic":"/ˌnɑnˈaʊt.reɪdʒ/","extraExplanation":["“nonoutrage”通常是由前缀 non-（表示“没有、非”）+ outrage（愤慨）构成的词，意思直观，但在正式词典里并不常见，更多见于评论、社会观察或写作中，用来强调一种“麻木/习惯了”的反应。","它和 apathy（冷漠）、indifference（漠不关心）、complacency（自满导致的不警觉）有重叠，但“nonoutrage”更聚焦在：面对明显的不公或伤害时，人们却没有出现“应有的愤怒”。"]}
{"word":"nonoverhead","summary":{"en":"Nonoverhead means “not overhead”—directly chargeable costs or time, often written as “non-overhead.”","zh":"nonoverhead 指“非间接费用/非管理工时”，即可直接归属到具体项目或客户的成本或工时（常写作 non-overhead）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Business/accounting) Not counted as overhead; directly chargeable to a specific job, project, product, or client.","zh":"（商业/会计）不算作管理/间接费用的；可直接归属于某个具体项目、产品或客户的（成本/工时）。"},"examples":[{"en":"We coded those materials as nonoverhead expenses because they were for a single client project.","zh":"我们把这些材料记为非间接费用，因为它们只用于一个客户项目。"},{"en":"Her hours this week were mostly nonoverhead, so her utilization rate looked strong.","zh":"她这周的工时大多是可直接计费/可归属项目的，所以利用率看起来很高。"}]},{"partOfSpeech":"n.","definition":{"en":"A cost, hour, or activity that is not overhead (i.e., it can be assigned directly to a specific job or revenue source).","zh":"非间接费用（或非管理工时/活动）：指能直接归属于某项具体工作或收入来源的成本、工时或活动。"},"examples":[{"en":"Try to keep at least 70% of your time in nonoverhead.","zh":"尽量让你至少70%的时间属于非间接工时（可归属项目/可计费工时）。"},{"en":"The report separates overhead from nonoverhead so leaders can see what’s truly billable.","zh":"报告把间接费用和非间接费用分开，方便管理层看清哪些是真正可计费的部分。"}]}],"synonyms":["direct","billable","chargeable (to a project)","non-overhead"],"phonetic":"/ˌnɑnˈoʊvərˌhɛd/","extraExplanation":["“nonoverhead”在真实写作中比较少见，更常见的拼写是带连字符的“non-overhead”。它通常出现在成本核算、工时表、咨询/工程公司的项目管理语境里，用来对比“overhead（间接费用/不可直接归属项目的成本）”。([merriam-webster.com](https://www.merriam-webster.com/dictionary/overhead?utm_source=openai))"]}
{"word":"nonoverlapping","summary":{"en":"Nonoverlapping means “not overlapping,” either in everyday use (no shared time/space) or in math (disjoint, no shared elements).","zh":"nonoverlapping 意为“不重叠的”，可指日常中的时间/空间不相互覆盖，也可指数学中的“不相交/互斥”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not overlapping; not covering the same space, time period, or items as something else.","zh":"不重叠的；不相互覆盖的；（在空间、时间或内容上）没有交叉的。"},"examples":[{"en":"We scheduled nonoverlapping meetings so everyone could attend both.","zh":"我们把会议安排成不重叠的时间，这样大家两场都能参加。"},{"en":"Please choose nonoverlapping colors so the chart is easier to read.","zh":"请选择不重叠（不混在一起难以区分）的颜色，这样图表更容易读。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/technical) Disjoint; sharing no common elements (for sets) or having intervals that do not intersect.","zh":"（数学/技术）互不相交的；不相交的（集合没有共同元素，或区间没有交集）。"},"examples":[{"en":"The two sets are nonoverlapping, so their intersection is empty.","zh":"这两个集合互不重叠，所以它们的交集为空集。"},{"en":"Use nonoverlapping intervals to avoid double-counting values.","zh":"使用不重叠的区间来避免重复计数。"}]}],"synonyms":["disjoint","separate","distinct","mutually exclusive","nonintersecting"],"phonetic":"/ˌnɑnˌoʊvɚˈlæpɪŋ/","extraExplanation":["构词法：non-（否定前缀，“不/非”）+ overlapping（overlap 的现在分词/形容词用法，“重叠的”），合起来就是“不重叠的”。","使用场景小提示：日常语境常说 nonoverlapping schedules/time slots（不冲突的时间安排）；在数学/数据分析里常对应 disjoint（互斥/不相交），强调“没有任何交集”。"]}
{"word":"nonowner","summary":{"en":"A nonowner is someone who does not own something, often used in legal, rental, or insurance contexts.","zh":"nonowner 指“不拥有某物的人”，常见于法律、租赁或保险语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does not own something (such as a car, property, or a business), especially in legal, rental, or insurance contexts.","zh":"不拥有某物的人（如汽车、房产或公司等），尤用于法律、租赁或保险等语境。"},"examples":[{"en":"As a nonowner, she rents her apartment instead of buying a home.","zh":"作为不拥有房产的人，她选择租公寓而不是买房。"},{"en":"The form must be signed by the owner, not a nonowner.","zh":"这份表格必须由所有者签字，而不是非所有者。"},{"en":"He bought nonowner auto insurance because he drives rental cars sometimes.","zh":"他买了非车主汽车保险，因为他有时会开租来的车。"}]}],"synonyms":["non-owner","renter","tenant","nonproprietor"],"phonetic":"/nɑnˈoʊnər/","extraExplanation":["拼写上更常见的是 **non-owner**（带连字符）或写成两个词 **non owner**；合写 **nonowner** 也能见到，但在正式文件/保险条款里通常更偏好带连字符的写法。","在美国保险语境里，**non-owner auto insurance**（非车主汽车保险）通常指：你本人没有车，但偶尔开租车/借车时，为你提供责任险（liability）的一类保单。具体保障范围因州与保险公司而异。"]}
{"word":"nonowners","summary":{"en":"“Nonowners” means people who are not owners (often of housing or property).","zh":"“nonowners”指非所有者，常指不拥有住房或财产的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who do not own something (especially property, housing, or a business); those who are not owners","zh":"不拥有某物的人（尤指不拥有房产、住房或企业的人）；非所有者"},"examples":[{"en":"The new housing policy is meant to help nonowners become first-time homeowners.","zh":"这项新的住房政策旨在帮助非业主成为首次购房者。"},{"en":"Nonowners can still use the shared workspace by paying a monthly membership fee.","zh":"非所有者仍然可以通过支付月度会员费使用共享办公空间。"}]}],"synonyms":["non-owners","people without ownership","renters (in housing contexts)","tenants (in housing contexts)"],"phonetic":"/ˌnɑnˈoʊnərz/","extraExplanation":["“non-”是常见前缀，表示“非、不是、没有”，如 nonresident（非居民）、nonprofit（非营利的）。因此 nonowners 字面意思就是“不是所有者的人”。","在住房与法律/政策语境中，nonowners 常用来对比 owners（业主/所有者），强调权利、责任或资格（例如税费、投票权、补贴资格等）。"]}
{"word":"nonowning","summary":{"en":"“Nonowning” means not having ownership/property rights, commonly used in formal contexts like law or business.","zh":"“nonowning”指“不拥有所有权/产权”，常用于法律或商业等较正式的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having ownership of something; not possessing property rights (often used in law, finance, or business contexts).","zh":"不拥有（某物）所有权的；非持有产权的（常用于法律、金融或商业语境）。"},"examples":[{"en":"A nonowning spouse may still have certain legal rights, depending on the state.","zh":"在美国，不拥有财产的一方配偶仍可能拥有某些法律权利，具体取决于所在州。"},{"en":"The company created a nonowning affiliate to manage operations without holding assets.","zh":"公司设立了一个非持有资产的关联公司，用来负责运营但不拥有资产。"}]},{"partOfSpeech":"adj.","definition":{"en":"(General use) Not having something (less common; usually replaced by “not owning”).","zh":"（一般用法）不拥有（较少见；通常会用“not owning”来表达）。"},"examples":[{"en":"They are nonowning residents who rent their homes.","zh":"他们是非房主居民（租房居住的人）。"}]}],"synonyms":["non-owner","not owning","without ownership","nonproprietary"],"phonetic":"/ˌnɑnˈoʊnɪŋ/","extraExplanation":["“nonowning”多见于正式或专业文本（例如法律文件、公司架构说明、财产/股权讨论）。日常英语里更自然的说法通常是“not owning”或“non-owner”。","构词：non-（否定前缀，表示“非……”）+ owning（拥有的）。在写作中常用来修饰名词：nonowning spouse/parent/entity/affiliate（非拥有方配偶/父母/实体/关联方）。"]}
{"word":"nonoxidating","summary":{"en":"Nonoxidating (rare) means not being oxidized or not causing oxidation; in formal writing, non-oxidizing/nonoxidizing is more common.","zh":"nonoxidating（较少见）指“不被氧化/不发生氧化”或“不具氧化性”；正式写作更常用 non-oxidizing/nonoxidizing。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) not undergoing oxidation; not oxidizing.","zh":"（较少见）不发生氧化的；不被氧化的。"},"examples":[{"en":"To keep the metal surface nonoxidating, store it in a dry, sealed container.","zh":"为了让金属表面不被氧化，请把它存放在干燥、密封的容器里。"},{"en":"Some coatings create a nonoxidating layer that slows rust.","zh":"有些涂层会形成一层不易氧化的保护层，从而减缓生锈。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) not causing oxidation; non-oxidizing (used in chemistry/industry).","zh":"（较少见）（化学/工业）不具氧化性的；不引起氧化的（即 non-oxidizing）。"},"examples":[{"en":"Hydrochloric acid is often described as a nonoxidating (non-oxidizing) acid.","zh":"盐酸常被描述为非氧化性酸。"},{"en":"The process requires a nonoxidating environment to protect sensitive compounds.","zh":"该工艺需要非氧化性环境来保护敏感化合物。"}]}],"synonyms":["non-oxidizing","nonoxidizing","unoxidized","not oxidizing"],"phonetic":"/ˌnɑn ˈɑksəˌdeɪtɪŋ/","extraExplanation":["“nonoxidating”在现代英文里不太常见，写作与用词上更推荐用 **non-oxidizing / nonoxidizing**（美式常见）或 **non-oxidising / nonoxidising**（英式拼写）。","构词上它等于“non- + oxidating（正在氧化的）”，但实际语料与词典收录主要集中在 **nonoxidizing**。如果你在论文、说明书或正式写作中使用，建议改成 **non-oxidizing** 以更自然、更专业。"]}
{"word":"nonoxidation","summary":{"en":"Nonoxidation means the absence of oxidation or conditions where oxidation does not occur.","zh":"Nonoxidation 指“不发生氧化”的状态或条件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition in which oxidation does not happen; lack of oxidation (often in chemistry, materials science, or food storage).","zh":"未发生氧化的状态；不氧化（常用于化学、材料科学或食品保存等语境）。"},"examples":[{"en":"The coating helps ensure nonoxidation of the metal surface.","zh":"这层涂层有助于保证金属表面不发生氧化。"},{"en":"Vacuum sealing slows oxidation, supporting nonoxidation of the oil for longer.","zh":"真空密封能减缓氧化，从而让油更长时间保持不氧化。"}]},{"partOfSpeech":"adj.","definition":{"en":"used as a modifier meaning “not involving oxidation” or “preventing oxidation.”","zh":"作定语使用，表示“与氧化无关的 / 不发生氧化的 / 防止氧化的”。"},"examples":[{"en":"They ran the reaction under nonoxidation conditions (no oxygen present).","zh":"他们在不氧化条件下进行反应（无氧环境）。"}]}],"synonyms":["lack of oxidation","no oxidation","absence of oxidation","non-oxidation"],"phonetic":"/nɑnˌɑk.sɪˈdeɪ.ʃən/","extraExplanation":["“nonoxidation”在日常英语里不算常见，更常见的写法是带连字符的“non-oxidation”，或者直接说“lack of oxidation / no oxidation / without oxidation”。在食品语境中，人们也常用“non-oxidative”或“doesn’t oxidize（不易氧化）”。","构词：non-（不、非）+ oxidation（氧化）。在科学写作里，它通常用来强调某个过程不涉及电子被夺取（氧化）或某材料不会被氧化变质。"]}
{"word":"nonoxidative","summary":{"en":"Nonoxidative means “not involving oxidation,” often used to describe reactions or pathways without oxidative steps.","zh":"nonoxidative 意为“非氧化的”，常指不包含氧化步骤的反应或途径。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving oxidation (loss of electrons or increase in oxidation state). Used especially in chemistry/biochemistry to describe reactions, conditions, or pathways that do not use oxidative steps.","zh":"非氧化的；不涉及氧化（不发生失电子或氧化态升高）的。常用于化学/生物化学中，描述不包含氧化步骤的反应、条件或代谢途径。"},"examples":[{"en":"The experiment was designed to measure nonoxidative degradation of the compound.","zh":"该实验旨在测量该化合物的非氧化性降解。"},{"en":"In the nonoxidative phase, carbon atoms are rearranged rather than oxidized.","zh":"在非氧化阶段，碳原子主要发生重排而不是被氧化。"},{"en":"They compared oxidative and nonoxidative pathways to see which produced more energy.","zh":"他们比较了氧化途径与非氧化途径，以判断哪一种产生更多能量。"}]}],"synonyms":["non-oxidative","nonoxidizing","without oxidation"],"phonetic":"/ˌnɑnˈɑk.sɪˌdeɪ.tɪv/","extraExplanation":["常见搭配包括：nonoxidative pathway（非氧化途径）、nonoxidative degradation/breakdown（非氧化性降解/分解）、nonoxidative conditions（非氧化条件）。","在生物化学语境里，最常见的例子是磷酸戊糖途径（PPP）中的“non-oxidative phase（非氧化阶段）”，其主要特点是“碳骨架重排”，而不是通过氧化反应产生 NADPH。","拼写上也常见写法为 non-oxidative（带连字符），意思相同；在学术文章标题或术语中更常见带连字符的形式。"]}
{"word":"nonoxidizable","summary":{"en":"Nonoxidizable means resistant to oxidation (not easily oxidized). It’s mostly used in scientific or technical contexts.","zh":"nonoxidizable 表示“不易氧化/抗氧化”，多用于科学或工程技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be oxidized easily; resistant to oxidation (a chemical reaction often involving oxygen and electron loss).","zh":"不易被氧化的；抗氧化的（指不容易发生氧化反应，常与氧气参与及失去电子有关）。"},"examples":[{"en":"Gold is often described as nonoxidizable under normal conditions, which is why it keeps its shine.","zh":"在正常条件下，黄金常被描述为不易氧化的，所以它能保持光泽。"},{"en":"The engineer chose a nonoxidizable coating to protect the metal parts from corrosion.","zh":"工程师选择了抗氧化涂层来保护金属部件免受腐蚀。"},{"en":"Store the sample in a nonoxidizable container to reduce unwanted reactions.","zh":"把样品存放在不易氧化的容器里，以减少不必要的反应。"}]}],"synonyms":["oxidation-resistant","non-oxidizing","corrosion-resistant","inert (in some contexts)"],"phonetic":"/ˌnɑnˈɑk.səˌdaɪ.zə.bəl/","extraExplanation":["这个词常见于化学、材料科学与工程语境，强调“在特定条件下不容易被氧化”。现实中很少有物质“绝对不会”氧化，更常见的含义是“在日常/指定环境中氧化非常慢或几乎不发生”。","拼写上也常见连字符形式：non-oxidizable（美式拼法），以及 non-oxidisable（英式拼法）。在学术写作里，常用 oxidation-resistant（耐氧化的）或 corrosion-resistant（耐腐蚀的）来表达更具体的性能指标。","与 corrosion（腐蚀）相关但不完全相同：氧化是腐蚀的一种常见过程（尤其对金属），但腐蚀还可能包括其他化学/电化学反应。"]}
{"word":"nonoxidization","summary":{"en":"“Nonoxidization” is a rare/nonstandard form. Usually use **non-oxidation** (noun) or **nonoxidizing** (adjective: not causing oxidation).","zh":"“nonoxidization”较少见且偏非标准。通常用 **non-oxidation**（名词：不氧化）或 **nonoxidizing**（形容词：无氧化性/不引起氧化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nonstandard) the state or process of **not undergoing oxidation** (not combining with oxygen / not being oxidized). In scientific writing, **non-oxidation** is more common.","zh":"（非标准用法）**不发生氧化**的状态或过程（不与氧结合／不被氧化）。在科学写作中更常用 **non-oxidation**。"},"examples":[{"en":"The sample was stored under nitrogen to ensure nonoxidization (more commonly: non-oxidation).","zh":"样品在氮气环境下保存，以确保不发生氧化（更常用：non-oxidation）。"},{"en":"We coated the metal to reduce oxidation; complete nonoxidization is difficult in air.","zh":"我们给金属做涂层来减少氧化；在空气中完全不氧化很难。"}]},{"partOfSpeech":"adj.","definition":{"en":"(intended meaning in many contexts) **not able to cause oxidation**. The standard adjective is **nonoxidizing** (e.g., “nonoxidizing acid/gas”).","zh":"（很多语境中的本意）**不具有氧化性**（不会引起氧化）。标准形容词是 **nonoxidizing**（如“nonoxidizing acid/gas”）。"},"examples":[{"en":"Hydrochloric acid is usually described as a nonoxidizing acid.","zh":"盐酸通常被描述为非氧化性酸。"},{"en":"They switched to a nonoxidizing biocide to reduce corrosion in the system.","zh":"他们改用非氧化性杀生剂，以减少系统腐蚀。"}]}],"synonyms":["non-oxidation","lack of oxidation","nonoxidizing"],"phonetic":"/ˌnɑnˌɑk.sə.daɪˈzeɪ.ʃən/","extraExplanation":["你写的 **nonoxidization** 在英语里很少见，常被认为是拼写或构词不自然。更自然的表达通常是：\n- 名词：**non-oxidation**（不氧化／未发生氧化）\n- 形容词：**nonoxidizing**（无氧化性、不会引起氧化）","在化学里：\n- **oxidation** = 氧化（更广义上也指“失电子/氧化态升高”）\n- **nonoxidizing** 常用来形容某种酸/气体/条件“不会把别的物质氧化”。若你告诉我你想表达“样品不被氧化”还是“试剂没有氧化性”，我可以帮你选最地道的词。"]}
{"word":"nonoxidizing","summary":{"en":"Nonoxidizing means “not causing oxidation,” often used in scientific contexts like “nonoxidizing atmosphere/conditions.”","zh":"nonoxidizing 指“不会引起氧化的”，常用于科学语境，如“nonoxidizing atmosphere/conditions（不致氧化的气氛/条件）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not causing oxidation; not acting as an oxidizing agent (does not make another substance lose electrons or increase in oxidation state).","zh":"不致氧化的；不具氧化性的（不会促使其他物质被氧化、失去电子或氧化数升高）。"},"examples":[{"en":"Gold is often described as a nonoxidizing metal because it does not readily react with oxygen in air.","zh":"黄金常被称为不致氧化的金属，因为它在空气中不易与氧气反应。"},{"en":"Use a nonoxidizing atmosphere (such as nitrogen) to protect the sample during heating.","zh":"加热时使用不致氧化的气氛（如氮气）来保护样品。"},{"en":"The process requires nonoxidizing conditions to prevent the surface from forming an oxide layer.","zh":"该工艺需要不致氧化的条件，以防表面形成氧化层。"}]}],"synonyms":["non-oxidizing","nonoxidative","inert (context-dependent)","reducing (context-dependent)"],"phonetic":"ˌnɑnˈɑksɪˌdaɪzɪŋ","extraExplanation":["这是一个技术/科学用词，常见于化学、冶金、材料科学与工业工艺说明。它通常用于描述“环境/气氛/条件”（nonoxidizing atmosphere/conditions），而不太常用于日常口语。","词形结构：non-（否定前缀）+ oxidizing（会引起氧化的）。因此意思就是“不会引起氧化的”。","近义表达常见有：reducing（还原性的）、inert（惰性的）。但它们不完全等同：inert 强调“几乎不反应”，reducing 强调“会把别的东西还原”，而 nonoxidizing 只强调“不会造成氧化”。"]}
{"word":"nonoxygenated","summary":{"en":"“Nonoxygenated” means not oxygenated—not supplied with oxygen.","zh":"“nonoxygenated”表示“未被氧合的/未供氧的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not supplied with oxygen; not containing (enough) oxygen.","zh":"未被氧合的；未含（或缺乏）氧气的。"},"examples":[{"en":"In biology class, we learned that blood returning to the heart is more nonoxygenated than blood leaving the lungs.","zh":"在生物课上我们学到：回到心脏的血液比离开肺部的血液更偏“未氧合”。"},{"en":"The device helps measure how quickly water becomes oxygenated versus nonoxygenated in the tank.","zh":"这个装置有助于测量水箱里的水从未氧合到氧合的速度。"}]}],"synonyms":["deoxygenated","unoxygenated","oxygen-poor","hypoxic (context-dependent)"],"phonetic":"/ˌnɑnˈɑksɪdʒəˌneɪtɪd/","extraExplanation":["这个词由 non-（否定前缀，“不/非”）+ oxygenated（被氧合的）组成，意思就是“没有被加氧/没有被氧合”。常见于医学与生理学语境，比如描述“未氧合血（去氧血）”或“缺氧环境”。","在医学里更常见的说法是 deoxygenated（去氧的）或 poorly oxygenated（氧合不足的）。nonoxygenated 偏技术性、直译式，用在学术或报告里更常见。"]}
{"word":"nonoxygenous","summary":{"en":"Nonoxygenous means “without oxygen” or “not containing oxygen,” but it’s uncommon; anoxic or oxygen-free is more natural.","zh":"nonoxygenous 表示“无氧的/不含氧的”，但较少用；更常见的说法是 anoxic 或 oxygen-free。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without oxygen; not containing oxygen.","zh":"无氧的；不含氧的。"},"examples":[{"en":"Some bacteria can survive in nonoxygenous environments.","zh":"有些细菌能在无氧环境中生存。"},{"en":"The material was stored in a nonoxygenous container to reduce oxidation.","zh":"这种材料被存放在无氧容器中以减少氧化。"}]}],"synonyms":["anoxic","oxygen-free","anaerobic"],"phonetic":"/ˌnɑnˌɑksɪˈdʒɛnəs/","extraExplanation":["“nonoxygenous”比较少见，更常用、更自然的表达是 **anoxic**（无氧的，常用于环境/医学/生物学）或 **oxygen-free**（不含氧的，更通俗）。","构词法：non-（不、非）+ oxygen（氧气）+ -ous（形容词后缀，表示“具有……性质的”）。","使用场景多见于科学/技术语境（如无氧环境、无氧储存、无氧反应），日常英语里通常不会用这个词。"]}
