{"word":"nonqualification","summary":{"en":"Nonqualification means the state of not being eligible or meeting requirements, often in formal rules, applications, or legal contexts.","zh":"Nonqualification 指“未达要求而不具资格/不符合条件”，多用于正式的规章、申请或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not meeting a required standard or condition; lack of the necessary qualifications.","zh":"不符合资格（或条件）的状态；不具备所需资历/条件。"},"examples":[{"en":"His nonqualification for the scholarship was due to missing documents, not poor grades.","zh":"他未能获得奖学金资格是因为材料不全，而不是成绩不好。"},{"en":"The committee ruled nonqualification because the application was submitted after the deadline.","zh":"委员会裁定为“不符合资格”，因为申请超过了截止日期。"}]},{"partOfSpeech":"n.","definition":{"en":"A reason or fact that makes someone ineligible; a disqualifying condition.","zh":"导致不具备资格的原因（或事实）；取消资格的条件。"},"examples":[{"en":"Prior misconduct can be a nonqualification for certain professional licenses.","zh":"以往的不当行为可能构成某些职业执照申请的“不具备资格”原因。"}]}],"synonyms":["ineligibility","lack of qualifications","not being qualified","unfitness"],"phonetic":"/ˌnɑnˌkwɑləfəˈkeɪʃən/","extraExplanation":["“nonqualification”比较偏正式、偏法律/规章语境，日常英语更常用：ineligibility（无资格）、lack of qualifications（缺乏资格）、not qualified（不合格）。","构词法：non-（否定前缀）+ qualification（资格/资历）。意思通常是“未达到要求而不具资格”，强调“没满足条件”；而 disqualification 更常暗示“被取消资格/被判出局”，可能带有处罚或规则判定的色彩。"]}
{"word":"nonqualifying","summary":{"en":"Nonqualifying means “not meeting the required conditions, so it doesn’t count or isn’t accepted.”","zh":"nonqualifying 指“不符合规定条件/资格，因此不被接受或不计入”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not meeting the required conditions or standards to be accepted, counted, or considered valid for a particular purpose.","zh":"不符合规定条件或标准的；（因不达标而）不能被接受、计入或视为有效的。"},"examples":[{"en":"Because the form was missing a signature, it was deemed nonqualifying and returned.","zh":"因为表格缺少签名，它被认定为不合格（不符合要求）并退回。"},{"en":"The committee treated late submissions as nonqualifying entries.","zh":"委员会把逾期提交的材料视为不符合资格的提交。"}]}],"synonyms":["ineligible","disqualified","not qualifying","invalid (in some contexts)"],"phonetic":"/ˌnɑnˈkwɑləˌfaɪɪŋ/","extraExplanation":["“non-”是否定前缀，表示“非、否、不”。“qualifying”来自“qualify”（符合资格/使合格）。因此“nonqualifying”常用于规则明确的场景：比赛、申请、考试、报销、税务扣除、福利资格等，强调“按规定不能算/不能用/不能通过”。","写作与用法上，它更常见于美式英语的正式语境（法律、行政、体育规则、财务条款）。日常口语里人们可能更常说“not eligible / doesn’t count / doesn’t qualify”。","常见搭配：nonqualifying event（不计入资格的赛事/项目）、nonqualifying expense（不符合条件的支出）、nonqualifying child/dependent（不符合条件的子女/被抚养人）、nonqualifying time/score（不达标成绩/时间）。"]}
{"word":"nonqualitative","summary":{"en":"“Nonqualitative” means “not qualitative,” often referring to data or analysis that is not descriptive/subjective.","zh":"“nonqualitative”意为“非定性的/非质性的”，常指不以描述性或主观特征为主的数据或分析。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not qualitative; not based on qualities, descriptions, or subjective characteristics (often used in academic or technical writing, especially about data or analysis).","zh":"非定性的；不基于性质描述、主观特征或质性叙述的（常用于学术/技术语境，尤其谈数据或分析）。"},"examples":[{"en":"The report focuses on nonqualitative indicators such as test scores and attendance rates.","zh":"这份报告侧重于非定性指标，例如考试分数和出勤率。"},{"en":"They asked for nonqualitative evidence, like counts or measurable outcomes.","zh":"他们要求提供非定性证据，例如数量统计或可测量的结果。"}]}],"synonyms":["non-qualitative","quantitative (often intended)","numerical","measurable"],"phonetic":"/ˌnɑnˈkwɑləˌteɪtɪv/","extraExplanation":["“nonqualitative”在真实写作中更常见的拼写是带连字符的“non-qualitative”，意思是“非质性/非定性”。很多时候作者其实想表达“quantitative（定量的）”，所以如果你的意思是“可用数字衡量的”，可以考虑直接用“quantitative”。","使用场景多见于研究方法、数据分析、评估指标等：qualitative（质性/定性）强调描述与主题；nonqualitative/quantitative（非质性/定量）更强调数字、计数、尺度与可测量结果。"]}
{"word":"nonqualitatively","summary":{"en":"nonqualitatively = in a non-qualitative (usually quantitative, numbers-based) way.","zh":"nonqualitatively = 以非定性（通常偏定量、基于数字指标）的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not qualitative; focusing on measurable quantities rather than qualities or descriptive categories.","zh":"以非定性（非质性）的方式；侧重可测量的数量，而不是性质、特征或描述性类别。"},"examples":[{"en":"The study assessed performance nonqualitatively by using test scores and error rates.","zh":"这项研究以非定性的方式评估表现，采用了测试分数和错误率。"},{"en":"We can compare the two products nonqualitatively through cost, weight, and battery life.","zh":"我们可以通过价格、重量和续航等指标，以非定性的方式比较这两款产品。"}]}],"synonyms":["quantitatively","numerically","in measurable terms","by the numbers"],"phonetic":"/ˌnɑnˌkwɑləˈteɪtɪvli/","extraExplanation":["“nonqualitatively”非常少见，写作中更常用的是“quantitatively（定量地）”或“in a non-qualitative way（以非定性的方式）”。","它通常出现在学术或技术语境里，用来强调“只用数字/指标衡量”，而不是用访谈、观察、主观描述等“质性/定性”信息。"]}
{"word":"nonqualities","summary":{"en":"Nonqualities means things that are not real “qualities,” or an absence of qualities; it’s a rare, formal word used mostly in academic or analytical writing.","zh":"nonqualities 指「不算真正的特質／品質的事物」或「缺乏特質／品質」；較少見，偏正式與學術／分析寫作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that are not considered qualities (for example, features that do not describe character or value), or the absence of qualities.","zh":"不被視為「特質／品質」的事物（例如不能用來描述性格或價值的特徵）；或指缺乏特質／品質。"},"examples":[{"en":"In the interview, she focused on her strengths, not on nonqualities like luck or appearance.","zh":"在面試中，她強調自己的優勢，而不是運氣或外表這類不算「特質」的因素。"},{"en":"The author contrasts virtues with nonqualities to show what truly matters.","zh":"作者把美德和「非特質」作對比，來凸顯真正重要的東西。"}]},{"partOfSpeech":"n.","definition":{"en":"in academic or philosophical writing: properties described by saying what something is not (negative descriptions), rather than what it is.","zh":"（學術／哲學用語）用「不是什麼」來描述的性質（否定式描述），而不是用「是什麼」來描述。"},"examples":[{"en":"Some definitions rely on nonqualities, describing the concept mainly by what it excludes.","zh":"有些定義依賴「非特質」，主要透過它排除什麼來說明概念。"}]}],"synonyms":["lack of qualities","absence of qualities","nontraits","negative attributes","noncharacteristics"],"phonetic":"/ˌnɑnˈkwɑlɪtiz/","extraExplanation":["「nonqualities」是比較少見、偏書面／學術的用法，通常是從單數「nonquality」加上複數 -s 來的。","字首 non- 表示「非、不是、缺乏」，所以 nonquality / nonqualities 常用來表達「不算真正的特質」或「缺乏品質／特質」。日常口語更常用：lack of qualities、no real qualities、not a meaningful trait 等說法。","如果你是在某篇文章或課本中看到這個詞，常見語境是把「qualities（可取的特質）」和「nonqualities（不構成特質的東西／否定式描述）」做對照。"]}
{"word":"nonquality","summary":{"en":"Nonquality means a lack of quality, or (in quality management) a defect or failure to meet standards.","zh":"Nonquality 指“缺乏品质/质量低劣”，在质量管理语境中也可指“不合格、缺陷或未达标”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of quality; the state of being poor in quality (often used in technical or critical writing).","zh":"缺乏品质；质量低劣的状态（常见于技术、评估或批评性写作中）。"},"examples":[{"en":"The inspector reported serious nonquality in the batch, so shipment was delayed.","zh":"检查员报告这批产品存在严重的非质量问题，因此发货被推迟。"},{"en":"Customer complaints focused on nonquality issues like weak stitching and uneven paint.","zh":"顾客投诉主要集中在非质量问题上，比如缝线不牢和喷漆不均。"}]},{"partOfSpeech":"n.","definition":{"en":"in quality management: a product defect or a failure to meet a specified requirement or standard.","zh":"在质量管理中：不合格/缺陷；未满足规定要求或标准的情况。"},"examples":[{"en":"Each nonquality must be documented and corrected before the final audit.","zh":"每一项不合格都必须记录并纠正，才能进行最终审核。"},{"en":"They tracked nonquality rates to find problems in the production line.","zh":"他们跟踪不合格率，以找出生产线上的问题。"}]}],"synonyms":["poor quality","low quality","inferiority","defect","nonconformance","substandard quality"],"phonetic":"/ˌnɑnˈkwɑləti/","extraExplanation":["“nonquality”不是日常最常用的词，更常见的说法是“poor quality / low quality / lack of quality”。但在制造业、质检、合规或管理文件里，可能会用“nonquality”来概括“不符合质量要求的情况/缺陷”。","在一些语境里，它也会与“nonconformance（不符合项）”“defect（缺陷）”一起出现；写作时要注意读者是否熟悉这种偏“行业用语”的表达。"]}
{"word":"nonquantitative","summary":{"en":"Nonquantitative means “not based on numbers or measurement,” focusing on qualities, descriptions, or observations.","zh":"nonquantitative表示“非定量的”，强调不以数字或测量为基础，而侧重性质、描述或观察。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving numbers, measurement, or amounts; described using qualities, categories, or observations instead.","zh":"非定量的；不涉及数字、测量或数量，而是用性质、类别或观察来描述的。"},"examples":[{"en":"The report included nonquantitative feedback from customers, such as what they liked and disliked.","zh":"报告包含了来自顾客的非定量反馈，比如他们喜欢和不喜欢的地方。"},{"en":"In interviews, researchers often collect nonquantitative data like stories and opinions.","zh":"在访谈中，研究者常收集非定量数据，比如故事和观点。"}]}],"synonyms":["qualitative","descriptive","nonnumerical","nonstatistical"],"phonetic":"/ˌnɑnˈkwɑntəˌteɪtɪv/","extraExplanation":["“Nonquantitative”常见于学术写作，意思接近“qualitative（定性的）”。在很多语境里两者几乎可以互换：nonquantitative强调“不是用数字衡量”，qualitative强调“关注性质/体验/意义”。","常见搭配：nonquantitative data/analysis/research/evidence（非定量数据/分析/研究/证据）。在社会科学、市场调研、用户体验（UX）等领域很常见。"]}
{"word":"nonquantitatively","summary":{"en":"Nonquantitatively means “in a non-numerical, descriptive (qualitative) way.”","zh":"nonquantitatively 的意思是“以非数字、描述性的（定性）方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not based on numbers or measurable amounts; using descriptions, qualities, or general observations instead of statistics.","zh":"以非定量的方式；不以数字或可测量的数量为依据，而是用描述、性质或总体观察来表达。"},"examples":[{"en":"The teacher assessed the student’s progress nonquantitatively, focusing on confidence and participation.","zh":"老师以非定量的方式评估学生的进步，重点看自信心和课堂参与。"},{"en":"We discussed the results nonquantitatively before looking at the charts and data.","zh":"我们先用非定量的方式讨论结果，然后再看图表和数据。"}]}],"synonyms":["qualitatively","descriptively","in qualitative terms","non-numerically"],"phonetic":"/ˌnɑnˌkwɑn.təˈteɪ.tɪv.li/","extraExplanation":["这个词比较少见，更常见的表达是 **qualitatively**（定性地）或 **in qualitative terms**（用定性方式）。","构词：**non-**（不、非）+ **quantitative**（定量的）→ **nonquantitatively**（非定量地）。在学术写作里，有时也会看到 **non-quantitatively**（带连字符）的写法。","使用场景：常用于研究、教育评估、用户反馈、社会科学讨论等，表示“先从感受/特征/模式做描述”，而不是“先给出具体数值或统计检验”。"]}
{"word":"nonquantitativeness","summary":{"en":"Nonquantitativeness means the state of not being measurable or expressible in numbers.","zh":"Nonquantitativeness 指“非量化性”，即无法用数字衡量或表达的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not being quantitative; the fact that something cannot be expressed, measured, or compared in numbers.","zh":"“非量化性”；指某事物无法用数字来表示、测量或比较的性质或状态。"},"examples":[{"en":"The report emphasized the nonquantitativeness of patient experiences, which are often better described in words than in numbers.","zh":"报告强调了患者体验的非量化性——这类内容往往用文字描述比用数字更合适。"},{"en":"Because of the nonquantitativeness of the concept, researchers used interviews instead of a numerical scale.","zh":"由于该概念具有非量化性，研究者改用访谈而不是数字量表。"}]}],"synonyms":["non-quantitativeness","lack of quantitativeness","nonquantitative nature","inability to quantify","unquantifiability"],"phonetic":"/ˌnɑnˌkwɑn.təˈteɪ.tɪv.nəs/","extraExplanation":["这个词非常少见，多见于学术写作里对“可否量化（quantitativeness）”的讨论。更常用、更自然的表达包括：non-quantitativeness（加连字符更清晰）、lack of quantitativeness（缺乏量化性）、non-quantitative nature（非量化的性质）。","构词理解：non-（否定前缀）+ quantitative（量化的）+ -ness（名词后缀，表示“性质/状态”）。","使用提示：在英文论文中，通常会把它放在抽象名词后面一起用，例如 the nonquantitative nature of… / the difficulty of quantification…，比单独用 nonquantitativeness 更常见。"]}
{"word":"nonquota","summary":{"en":"Nonquota describes something not restricted by a quota, especially in official trade or policy contexts.","zh":"Nonquota指“不受配额限制的”，多用于贸易与政策等正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not limited by an official quota (a fixed maximum amount allowed), especially in trade, imports, production, or immigration rules","zh":"不受（官方）配额限制的；非配额管制的（尤用于贸易、进口、生产或移民规定）"},"examples":[{"en":"The company increased nonquota imports to meet rising demand.","zh":"为满足不断增长的需求，这家公司增加了非配额进口。"},{"en":"Nonquota workers can be hired without counting toward the annual cap in some programs.","zh":"在某些项目中，非配额类员工的雇用不计入年度名额上限。"}]},{"partOfSpeech":"n.","definition":{"en":"a product, quantity, or category that is not subject to a quota restriction","zh":"非配额商品／数量／类别；不受配额限制的项目"},"examples":[{"en":"These items are treated as nonquota under the current policy.","zh":"在现行政策下，这些商品被视为非配额项目。"}]}],"synonyms":["unrestricted","not subject to a quota","quota-free"],"phonetic":"/ˌnɑnˈkwoʊtə/","extraExplanation":["“nonquota”常见于正式或政策语境，也常写作“non-quota”。意思并不是“没有配额”，而是“这个对象不适用配额限制”。","常见搭配：nonquota imports（非配额进口）、nonquota category（非配额类别）、nonquota access（非配额准入）。在具体法规中，是否属于nonquota以条文定义为准。"]}

