{"word":"nonvacancies","summary":{"en":"“Nonvacancies” means there are no openings; all units or positions are filled (often used in reports as the opposite of “vacancies”).","zh":"“nonvacancies”表示没有空缺、全部已满（常用于报告中，与“vacancies 空缺”相对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having no vacancies; a situation in which all places, rooms, jobs, or positions are filled","zh":"（整体）无空缺的状态；没有空房/空位/空职的情况"},"examples":[{"en":"Because of high demand, the city experienced months of nonvacancies in affordable housing.","zh":"由于需求很高，这座城市的保障性住房出现了数月的“无空房”状况。"},{"en":"The hospital reported nonvacancies in several key nursing roles.","zh":"医院报告称，多个关键护理岗位没有空缺。"}]},{"partOfSpeech":"n.","definition":{"en":"filled or occupied units/positions (used in the plural to contrast with “vacancies”)","zh":"（复数用法）已被占用的房源/岗位/名额（与 vacancies“空缺”相对）"},"examples":[{"en":"The report lists vacancies and nonvacancies by department.","zh":"报告按部门列出了空缺和已占用岗位。"},{"en":"Landlords track vacancies and nonvacancies to understand turnover.","zh":"房东会追踪空置与非空置房源来了解租客流动。"}]}],"synonyms":["no vacancies","full occupancy","fully occupied","zero vacancy","filled positions"],"phonetic":"/ˌnɑnˈveɪkənsiz/","extraExplanation":["“nonvacancy / nonvacancies”在日常英语里不算常见，写作中更常用的表达是“no vacancies”“fully occupied”“zero vacancy”“low vacancy rate”等。","作为复合词：non-（非、无）+ vacancy（空缺、空置）。在统计、报告、政策文件里偶尔会用来与“vacancies”做对照。"]}
{"word":"nonvacancy","summary":{"en":"Nonvacancy means there is no vacancy—everything is filled or occupied.","zh":"nonvacancy 指“无空缺/无空置”，即已满员或已被占用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having no vacancy; a situation where a position, room, or unit is already filled or occupied","zh":"无空缺（状态）；已被占用（职位/房间/单位已有人）"},"examples":[{"en":"The hospital is at nonvacancy, so new patients may need to wait.","zh":"这家医院目前无空位，所以新病人可能需要等待。"},{"en":"In some neighborhoods, nonvacancy is common because housing demand is high.","zh":"在一些社区，由于住房需求很高，“无空置”很常见。"}]}],"synonyms":["occupancy","full occupancy","no vacancies","filled position"],"phonetic":"/nɑnˈveɪkənsi/","extraExplanation":["“nonvacancy”常见于住房、酒店、医院床位、职位编制等语境，强调“没有空缺/空房/空床/空岗”。在统计或报告里也可能写作“non-vacancy”（加连字符）或用更常见的替代表达：occupancy（入住/占用）、full occupancy（满住）、no vacancies（无空缺）。","注意它不是日常高频词。口语中人们更常说：There are no vacancies. / We’re fully booked.（没有空房/订满了）。在招聘语境中也常用：The position is filled.（职位已招满）。"]}
{"word":"nonvacant","summary":{"en":"Nonvacant means “not empty or not available,” often used formally for places (like apartments) or positions (like jobs) that are occupied.","zh":"nonvacant 指“非空的/非空缺的”，多用于较正式语境，表示房屋、座位或职位等已被占用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a place, position, or time) not empty; occupied; filled rather than vacant.","zh":"（指地方、职位或时间）非空的；有人占用的；不是空缺的。"},"examples":[{"en":"The apartment is nonvacant, so you can’t move in until next month.","zh":"这套公寓目前是非空置的，所以你要到下个月才能搬进去。"},{"en":"Only nonvacant seats will be counted when the staff checks attendance.","zh":"工作人员统计出勤时只会计算有人坐的座位。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Formal/legal, especially in property or administration) not unoccupied; currently in use or held by someone.","zh":"（较正式/法律语境，尤指房产或行政）非无人居住的；正在使用的；由他人持有/占有的。"},"examples":[{"en":"The city issued a notice to owners of nonvacant rental units.","zh":"市政府向非空置出租房的业主发出了通知。"},{"en":"The role remained nonvacant during the transition period.","zh":"在过渡期内，该职位一直不是空缺状态。"}]}],"synonyms":["occupied","not vacant","filled","taken","in use"],"phonetic":"/ˌnɑnˈveɪkənt/","extraExplanation":["“nonvacant”由前缀 non-（不、非）+ vacant（空的、空缺的）构成，语气偏正式，常见于房产管理、法律文件或行政通知中。日常口语里更常说 “occupied / not vacant / taken”。"]}
{"word":"nonvacantly","summary":{"en":"Nonvacantly means “not vacantly”—with attention, awareness, or an engaged expression.","zh":"nonvacantly 表示“并不茫然/空洞地”，带着注意力、意识或投入的神情。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vacant or empty; with attention or mental presence rather than a blank stare.","zh":"以不空洞、不呆滞的方式；带着注意力与意识，而不是茫然发呆地。"},"examples":[{"en":"He listened nonvacantly, nodding to show he understood.","zh":"他并不茫然地听着，还点头表示自己明白。"},{"en":"Try to read nonvacantly—pause and ask what the writer really means.","zh":"尽量不要走马观花地阅读——停下来问问作者真正想表达什么。"}]}],"synonyms":["attentively","thoughtfully","with attention","not vacantly","engagedly"],"phonetic":"/nɑnˈveɪkəntli/","extraExplanation":["这是一个较少见、偏书面/文学的副词，由 non-（否定前缀，“不…”）+ vacant（空的；神情空洞的）+ -ly（副词后缀）构成。日常英语里更常用的说法是 not vacantly、with attention、attentively、thoughtfully。","vacant 除了“空着的（房间/职位）”以外，也常形容人的目光或表情“空洞、走神”；nonvacantly 多用于强调“眼神/神态/态度并不呆滞”。"]}
{"word":"nonvaccination","summary":{"en":"Nonvaccination means not being vaccinated or not receiving a vaccine.","zh":"nonvaccination 指未接种疫苗/不接种疫苗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or state of not receiving a vaccine; lack of vaccination (whether by choice, delay, or no access).","zh":"未接种疫苗；不接种（可能出于选择、延迟或无法获得疫苗等原因）。"},"examples":[{"en":"Nonvaccination can increase the risk of outbreaks of preventable diseases.","zh":"不接种疫苗可能会增加可预防疾病暴发的风险。"},{"en":"The clinic is studying why some children have nonvaccination records.","zh":"该诊所正在研究为什么有些儿童有未接种的记录。"}]}],"synonyms":["lack of vaccination","not vaccinated","unvaccinated status","vaccine nonreceipt"],"phonetic":"/ˌnɑnˌvæk.səˈneɪ.ʃən/","extraExplanation":["“non-”是英语中常见的否定前缀，表示“非/不”。“nonvaccination”多见于公共卫生、医学研究或政策文件中；在日常英语里，更常说“not vaccinated / unvaccinated”或“lack of vaccination”。","这个词在讨论时往往需要区分原因：拒绝接种（refusal）、犹豫或延迟（hesitancy/delay）、以及因资源或渠道不足导致未接种（lack of access）。"]}
{"word":"nonvacillating","summary":{"en":"Nonvacillating means firm and not wavering in opinion, decision, or direction.","zh":"nonvacillating 指“不摇摆、不动摇”，在观点、决定或方向上很坚定。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not changing your opinion or direction; firm and steady","zh":"不摇摆的；不犹豫不决的；坚定而稳定的"},"examples":[{"en":"She gave a nonvacillating answer: “No, I can’t do that.”","zh":"她给出了一个不含糊的回答：“不，我不能那样做。”"},{"en":"The team needed a nonvacillating leader during the crisis.","zh":"危机期间团队需要一位不动摇的领导者。"},{"en":"His nonvacillating commitment to daily practice helped him improve quickly.","zh":"他对每天练习的坚定投入帮助他迅速进步。"}]}],"synonyms":["unwavering","steadfast","firm","resolute","decisive"],"phonetic":"/ˌnɑnˈvæsəˌleɪtɪŋ/","extraExplanation":["这个词由 non-（“不、非”）+ vacillating（“摇摆不定的”）构成，语气偏正式、书面，日常口语更常用 steady / firm / unwavering / decisive 来表达类似意思。","vacillate 本义是“来回摇摆”，既可指身体/方向的摆动，也常比喻“在决定或观点上反复”。nonvacillating 强调“不会反复、不会动摇”。"]}
{"word":"nonvacillation","summary":{"en":"Nonvacillation means steadiness and unwavering firmness—no hesitation or wavering.","zh":"nonvacillation 指“坚定不移、毫不动摇”，强调不犹豫、不摇摆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Steady firmness; not wavering or hesitating in opinion, purpose, or action.","zh":"坚定不移；不动摇；在观点、目标或行动上不犹豫、不摇摆。"},"examples":[{"en":"Her nonvacillation during the crisis reassured the whole team.","zh":"危机中她的坚定不移让整个团队安心。"},{"en":"The judge’s decision showed nonvacillation in applying the law fairly.","zh":"法官的裁决体现了在公平适用法律上的不动摇。"}]}],"synonyms":["steadfastness","firmness","unwaveringness","resolve","constancy"],"phonetic":"/ˌnɑnˌvæsəˈleɪʃən/","extraExplanation":["这个词非常少见，多用于正式或文学化语境。更常见的表达是“steadfastness / firmness / unwaveringness”。","构词上是 non-（否定前缀）+ vacillation（动摇、犹豫），字面意思就是“不动摇”。","写作中若想更自然，可以用“without hesitation（毫不犹豫）”或“remain unwavering（保持坚定）”来替代。"]}
{"word":"nonvacua","summary":{"en":"Nonvacua means “non-empty,” mainly in academic (especially math/logic) contexts.","zh":"nonvacua 指“非空的”，多见于学术语境（尤其数学/逻辑）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in English academic writing) “not empty; containing at least one element.” Often used when talking about sets, collections, or categories.","zh":"（拉丁语，常见于英文/学术写作）“非空的；至少包含一个元素的”。常用于集合、集合类或分类的讨论。"},"examples":[{"en":"Assume the set A is nonvacua (non-empty).","zh":"假设集合 A 是 nonvacua（非空的）。"},{"en":"The theorem holds for all nonvacua subsets of X.","zh":"该定理对 X 的所有非空子集都成立。"}]}],"synonyms":["nonempty","non-empty","not empty"],"phonetic":"/nɑnˈvækjuə/","extraExplanation":["“nonvacua”来自拉丁语：non（不）+ vacua（空的）。在现代英文数学/逻辑语境里，更常见的写法是 **nonempty / non-empty**；也可能写成 **non vacua** 或 **non-vacua**（较偏传统或拉丁化的风格）。","如果你是在某篇论文、讲义或拉丁文句子里看到它，具体形式可能与拉丁语的性、数（例如阴性复数）有关；但在英文里通常只把它当作“非空”这一含义来理解即可。"]}
{"word":"nonvacuous","summary":{"en":"Nonvacuous means “not empty or meaningless,” and in logic it means “not merely true because there are no real cases.”","zh":"nonvacuous 表示“非空的、非空泛的；有实质内容的”，在逻辑中指“不是因为没有实际对象才成立的（非空真）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not empty or meaningless; having real content, information, or significance.","zh":"非空的；非无意义的；有实质内容或信息的。"},"examples":[{"en":"We need a nonvacuous explanation, not just a vague slogan.","zh":"我们需要一个有实质内容的解释，而不只是含糊的口号。"},{"en":"The report offers nonvacuous evidence that the policy is working.","zh":"这份报告提供了有实质内容的证据，表明该政策正在起作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Logic/Math) Not true just because it has no counterexamples due to being empty; involving at least one real case or member.","zh":"（逻辑/数学）非“空真”的；不是因为没有反例（集合为空等）才成立；涉及至少一个真实例子或成员的。"},"examples":[{"en":"To avoid a vacuous result, the theorem assumes a nonvacuous set of examples.","zh":"为避免出现空洞（空真）的结论，这一定理假设存在一个非空的例子集合。"},{"en":"Their claim is nonvacuous because it applies to at least one actual situation.","zh":"他们的主张并非空泛，因为它至少适用于一个真实情境。"}]}],"synonyms":["meaningful","substantive","nonempty","significant","not vacuous"],"phonetic":"/nɑnˈvækjuəs/","extraExplanation":["nonvacuous 由 non-（不、非）+ vacuous（空的、空洞的）构成。vacuous 在日常英语里常指“空洞无内容”，在逻辑里常指“空真”(vacuously true)：例如“所有独角兽都会飞”在现实中可能因独角兽不存在而被视为在逻辑上成立。nonvacuous 用来强调“不是靠空无对象取巧”，而是有实际内容或适用对象。"]}
{"word":"nonvacuously","summary":{"en":"Nonvacuously means “in a meaningful, nontrivial way,” especially in logic where it contrasts with something being true only because there are no relevant cases.","zh":"nonvacuously 指“以有意义、非平凡的方式”，尤其在逻辑中强调不是因为没有相关情况而“空真”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a meaningful or substantive way; not empty, trivial, or lacking real content.","zh":"以有意义、实质性的方式；不是空洞的、琐碎的或缺乏内容的。"},"examples":[{"en":"To improve the project nonvacuously, we need evidence that users actually benefit.","zh":"要对项目做出实质性的改进，我们需要证据证明用户确实受益。"},{"en":"Her feedback was nonvacuously helpful because it included specific suggestions.","zh":"她的反馈很有实质帮助，因为包含了具体建议。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Logic/Math) In a way that is not “vacuously” true; true for nontrivial reasons (for example, because there are relevant cases, not because there are none).","zh":"（逻辑/数学）以“非空真”的方式；不是因为没有相关对象/情况才成立，而是基于非平凡的理由成立。"},"examples":[{"en":"The statement is true nonvacuously because there is at least one example that satisfies the condition.","zh":"这个命题以非空真的方式为真，因为至少有一个例子满足条件。"},{"en":"To show the rule holds nonvacuously, we must consider cases where the set is not empty.","zh":"要证明规则以非空真的方式成立，我们必须考虑集合非空的情况。"}]}],"synonyms":["meaningfully","substantively","nontrivially","in a non-trivial way"],"phonetic":"/ˌnɑnˈvækjuəsli/","extraExplanation":["在形式逻辑里，“vacuously true（空真）”常指：像“所有独角兽都有角”这种句子，因为世界上没有独角兽，所以“所有独角兽……”在逻辑上会被判为真，但这种“真”缺乏信息量。nonvacuously 就强调：结论为真不是靠“没有对象/没有反例”的漏洞，而是因为确实有相关对象或检验过的实质情形。","nonvacuously 比较常出现在学术写作（逻辑、数学、计算机科学、哲学）中；日常英语更常说 meaningfully / substantively / in a non-trivial way。"]}
{"word":"nonvacuousness","summary":{"en":"Nonvacuousness means the quality of being meaningful, informative, and not empty or trivial—often used in logic or academic writing.","zh":"Nonvacuousness 指“非空/非空泛”的性质：有实际内容和信息量，不是空洞或只因缺少反例而显得成立，常见于逻辑与学术写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being meaningful or informative (not empty, not pointless, not “true/valid only because nothing contradicts it”)","zh":"“非空/非空泛”的性质；指有实际内容、信息量或意义（不是空洞的、无关紧要的，也不是因为缺乏反例才显得成立）"},"examples":[{"en":"The reviewer criticized the paper for lacking nonvacuousness because it repeated well-known results.","zh":"审稿人批评这篇论文缺乏 nonvacuousness，因为它只是重复了众所周知的结果。"},{"en":"In logic, we prefer arguments with nonvacuousness: they should tell us something new.","zh":"在逻辑学中，我们更偏好具有 nonvacuousness 的论证：它们应当告诉我们一些新的信息。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical, mathematics/logic) the property of a condition, statement, or proof being non-vacuous—i.e., not relying on an empty set or an impossible case","zh":"（术语，数学/逻辑）某个条件、命题或证明的“非真空性”：不依赖空集合或不可能情形而成立"},"examples":[{"en":"To show nonvacuousness, the author gave a concrete example where the condition is satisfied.","zh":"为了证明 nonvacuousness，作者给出了一个满足条件的具体例子。"},{"en":"The theorem’s assumptions guarantee nonvacuousness by ensuring the domain is not empty.","zh":"该定理的假设通过确保论域非空来保证 nonvacuousness。"}]}],"synonyms":["meaningfulness","informativeness","substance","nontriviality","substantiveness"],"phonetic":"/nɑnˈvækjuəsnəs/","extraExplanation":["这个词多见于逻辑学/数学写作，常用来对比 *vacuous(空泛的)* 或 *vacuously true（空真/空泛为真）*。例如“若P则Q”在P永远不成立时会被认为是“空真”，因此有人会强调要证明结论具有 nonvacuousness——也就是讨论的情形确实可能发生、结论确实带来信息。","拼写上常见两种形式：*nonvacuousness* 与 *non-vacuousness*（带连字符）。"]}
{"word":"nonvacuum","summary":{"en":"Nonvacuum describes something that is not in a vacuum or does not use vacuum methods.","zh":"nonvacuum 表示“非真空的/不采用真空方法的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Science/engineering) Not in a vacuum; involving gas, air, or other matter instead of empty space.","zh":"（科学/工程）非真空的；不是在真空环境中进行的；含有空气或其他物质而非“空无一物”。"},"examples":[{"en":"The experiment was repeated under nonvacuum conditions to compare the results.","zh":"为了对比结果，这个实验在非真空条件下又重复了一次。"},{"en":"Nonvacuum packaging keeps food fresh by removing some air, but it is not a true vacuum seal.","zh":"非真空包装通过减少部分空气来保鲜，但它不是真正的真空密封。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not using a vacuum method or vacuum equipment (often used before a noun).","zh":"不使用真空方法或真空设备的（常作定语）。"},"examples":[{"en":"They used a nonvacuum drying process because the material was heat-sensitive.","zh":"由于材料怕热，他们采用了非真空干燥工艺。"},{"en":"A nonvacuum chamber is cheaper, but it may introduce contamination from air.","zh":"非真空腔体更便宜，但可能会引入空气带来的污染。"}]}],"synonyms":["non-vacuum","not in a vacuum","atmospheric (in some contexts)"],"phonetic":"/ˌnɑnˈvækjuːm/","extraExplanation":["这个词在学术写作里也常写成带连字符的 **non-vacuum**，意思相同；是否连字符取决于期刊/出版社风格。","在工程语境里，nonvacuum 常与 *conditions / environment / process / system / chamber* 等名词搭配，用来强调“有气体/有介质”的实际工作环境。"]}
{"word":"nonvacuums","summary":{"en":"“Nonvacuums” means non-vacuum conditions or things that contain matter (like air); it’s used mostly in technical contexts.","zh":"“nonvacuums”指非真空的条件或事物（含有空气等物质），多用于技术/科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things or environments that are not a vacuum (i.e., they contain air, gas, or other matter); plural of “nonvacuum”","zh":"非真空的东西或环境（即含有空气、气体或其他物质）；“nonvacuum”的复数"},"examples":[{"en":"Most experiments were run in a vacuum, but a few were done in nonvacuums to compare the results.","zh":"大多数实验在真空中进行，但也有一些在非真空环境中进行，以比较结果。"},{"en":"Sound cannot travel in a vacuum, but it can travel in nonvacuums like air or water.","zh":"声音无法在真空中传播，但可以在空气或水等非真空介质中传播。"}]}],"synonyms":["non-vacuum conditions","non-vacuum environments","in air","at atmospheric pressure"],"phonetic":"/nɑnˈvækjuəmz/","extraExplanation":["“nonvacuums”并不是日常英语中常见的词形，更常见的表达是“non-vacuum environments/conditions”（非真空环境/条件）、“atmospheric pressure”（常压）或直接说“in air / in gas”（在空气/气体中）。","拼写上也常见加连字符：non-vacuum；在科学或工程写作中两种写法都可能出现，但加连字符更清晰。"]}
{"word":"nonvaginal","summary":{"en":"Nonvaginal means “not involving the vagina,” often used to describe non-vaginal routes or methods in medical or sexual-health contexts.","zh":"nonvaginal 指“非阴道的/不涉及阴道的”，常用于描述医学或性健康语境中的非阴道途径或方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving the vagina; occurring by a route or method other than vaginal (often used in medical or sexual-health contexts).","zh":"非阴道的；不涉及阴道的；通过阴道以外的途径或方式发生的（多用于医疗或性健康语境）。"},"examples":[{"en":"The doctor discussed nonvaginal delivery options in case a C-section became necessary.","zh":"医生讨论了非阴道分娩的选择，以防需要剖宫产。"},{"en":"The study compared vaginal and nonvaginal methods of administering the medication.","zh":"该研究比较了药物的阴道给药与非阴道给药方式。"}]}],"synonyms":["non-vaginal","extravaginal","nonintravaginal"],"phonetic":"/ˌnɑnˈvædʒənəl/","extraExplanation":["这个词通常写作 nonvaginal（也可见 non-vaginal）。在医学文章中常用来与 vaginal（阴道的）对比，表示“不是经阴道/不涉及阴道”的途径或行为。","使用时要注意语境：它本身是中性、描述性的词，但涉及私密话题时，正式场合更常见于医学、研究、公共卫生材料中。"]}
{"word":"nonvagrancies","summary":{"en":"“Nonvagrancies” means cases or conditions of not being a vagrant (the plural of nonvagrancy).","zh":"nonvagrancies 指“非流浪/非游民状态”的多种情况，是 nonvagrancy 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of not being a vagrant; situations where people are settled rather than wandering or homeless (plural of nonvagrancy)","zh":"非流浪状态；不属于流浪/游民的情况（nonvagrancy 的复数）"},"examples":[{"en":"The report focused on housing stability and nonvagrancies in the neighborhood.","zh":"这份报告关注社区的住房稳定与非流浪状态。"},{"en":"They studied the causes of vagrancy and the factors behind nonvagrancies.","zh":"他们研究了流浪现象的成因以及促成非流浪状态的因素。"}]}],"synonyms":["housing stability","being housed","non-homelessness","residential stability"],"phonetic":"/ˌnɑnˈveɪɡrənsiːz/","extraExplanation":["这个词非常少见，多见于学术写作或政策/法律语境里，作为“vagrancy（流浪、游民状态）”的反义概念来讨论。日常英语更常说：stable housing（稳定住房）、being housed（有住处）、not homeless（不无家可归）。","构词：non-（不、非）+ vagrancy（流浪状态）→ nonvagrancy；复数为 nonvagrancies，用来表示“多种非流浪的情形/案例”。"]}
{"word":"nonvagrancy","summary":{"en":"“Nonvagrancy” means the condition of not being a vagrant, often implying stable housing; it is a rare, formal word sometimes used in legal or policy contexts.","zh":"“nonvagrancy”指非流浪状态，常暗示有稳定住所；属于少见且较正式的用词，有时见于法律或政策语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or condition of not being a vagrant; having a stable home or regular place of residence.","zh":"非流浪状态；不以流浪者身份生活的状态；有稳定住所或固定居所。"},"examples":[{"en":"The program aims to move people from vagrancy to nonvagrancy by providing long-term housing.","zh":"该项目通过提供长期住房，旨在帮助人们从流浪走向非流浪状态。"},{"en":"Proof of nonvagrancy may include a fixed address or steady employment.","zh":"证明非流浪状态的材料可能包括固定住址或稳定工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, legal or official use) A status indicating someone is not considered a vagrant under a law or rule.","zh":"（罕见，法律/官方用语）指在法律或规定下不被认定为流浪者的身份或状态。"},"examples":[{"en":"The court record noted his nonvagrancy because he had a permanent residence.","zh":"法院记录注明他不属于流浪者，因为他有永久住所。"},{"en":"The policy requires documentation of nonvagrancy for certain services.","zh":"该政策要求为某些服务提供不属于流浪者的证明文件。"}]}],"synonyms":["stable housing","being housed","having a fixed address","residence","non-homelessness"],"phonetic":"/ˌnɑnˈveɪɡrənsi/","extraExplanation":["“nonvagrancy”非常少见，多数场景更常用的表达是“having stable housing / having a fixed address / being housed”。","词由前缀“non-（非、不）”+“vagrancy（流浪；游荡）”构成，通常出现在较正式的文本（政策、法律、社会服务报告）中。"]}
{"word":"nonvagrant","summary":{"en":"“Nonvagrant” means not wandering or homeless; having a regular home/address.","zh":"“nonvagrant”指非流浪的、非无家可归的；有固定住所/地址的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not vagrant; having a fixed home or regular residence (not homeless or wandering).","zh":"非流浪的；有固定住处的（不无家可归或四处漂泊的）。"},"examples":[{"en":"The shelter mainly serves vagrant clients, but some nonvagrant families also need short-term help.","zh":"这家收容所主要服务流浪者，但也有一些非流浪家庭需要短期帮助。"},{"en":"The program offers support to both vagrant and nonvagrant people who are struggling to pay rent.","zh":"该项目为既包括流浪者也包括非流浪、但难以支付房租的人提供支持。"}]}],"synonyms":["housed","not homeless","domiciled","settled","with a permanent address"],"phonetic":"/ˌnɑnˈveɪɡrənt/","extraExplanation":["“nonvagrant”是比较少见的词，常见于法律、社会服务或政策文件里，用来把“vagrant（流浪者/游民）”与“有固定住所的人”区分开。日常英语更常说“housed”“not homeless”“with a permanent address”等。","前缀“non-”表示“非、不”，加在“vagrant（流浪的）”前面形成反义概念。"]}
{"word":"nonvagrantly","summary":{"en":"“Nonvagrantly” means “not in a vagrant (wandering/homeless) way,” but it’s very uncommon.","zh":"nonvagrantly 意为“不是以流浪/漂泊的方式”，但非常罕见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vagrant; not wandering or living without a settled home (very rare in modern use).","zh":"以非流浪的方式；不漂泊、不以流浪者的状态生活（现代英语中非常少见）。"},"examples":[{"en":"After years on the road, he tried to live nonvagrantly by keeping a steady job and address.","zh":"在路上漂泊多年后，他试着通过保持稳定的工作和住址来过上不再流浪的生活。"},{"en":"The program helps people move nonvagrantly from temporary shelters into long-term housing.","zh":"这个项目帮助人们从临时收容所逐步过渡到稳定住房，从而不再流浪。"}]}],"synonyms":["stably","settledly","with a fixed address","without wandering"],"phonetic":"/ˌnɑnˈveɪɡrəntli/","extraExplanation":["“nonvagrantly”由前缀 non-（不、非）+ vagrant（流浪者的；漂泊的）+ -ly（构成副词）组成。实际写作中更常见、更自然的表达是：“in a stable way / without wandering / with a permanent address”。","“vagrant”在英语里既可指“流浪者”（名词），也可指“漂泊的、无固定住处的”（形容词）。在谈论无家可归议题时，用词要注意尊重与语境：例如“people experiencing homelessness（正在经历无家可归的人）”在许多公共传播中更常见、更中性。"]}
{"word":"nonvagrantness","summary":{"en":"Nonvagrantness means the condition of not being a vagrant—having a stable home instead of wandering or being homeless.","zh":"nonvagrantness 指“不流浪”的状态，即有稳定住处，而非四处漂泊或无家可归。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being a vagrant (not homeless or wandering from place to place)","zh":"非流浪状态；不流浪（不无家可归、不过着四处漂泊的生活）的性质"},"examples":[{"en":"The charity’s goal is to help people move from vagrancy to nonvagrantness through stable housing and support.","zh":"这家慈善机构的目标是通过稳定住房和支持，帮助人们从流浪走向非流浪状态。"},{"en":"In the report, “nonvagrantness” is used to describe having a fixed address and regular community ties.","zh":"在报告中，“nonvagrantness”用来描述拥有固定住址以及稳定的社区联系。"}]}],"synonyms":["housing stability","being housed","having a fixed address","not being homeless"],"phonetic":"/ˌnɑnˈveɪɡrəntnəs/","extraExplanation":["“nonvagrantness”是由 non-（不、非）+ vagrant（流浪的/流浪者）+ -ness（名词后缀，表示“……的状态/性质”）构成的派生词。","这个词在日常英语里非常少见，更常用的表达是 “having stable housing / being housed / not being homeless（有稳定住房/有住处/不无家可归）”，或用名词 “housing stability（住房稳定）”。","“vagrant”在法律或社会语境中可能带有污名化色彩；在更尊重的表达中常用 “people experiencing homelessness（正在经历无家可归的人）”。"]}
{"word":"nonvalent","summary":{"en":"Nonvalent means having zero valence in chemistry—generally not forming bonds or reacting easily.","zh":"nonvalent 指（化学中）价为零、通常不易成键或反应的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In chemistry, having a valence of zero; not forming chemical bonds under ordinary conditions.","zh":"（化学）非价的；价为零的；在一般条件下不与其他原子形成化学键的。"},"examples":[{"en":"Neon is often described as nonvalent because it rarely forms compounds.","zh":"氖常被描述为非价的，因为它很少形成化合物。"},{"en":"The model treats noble gases as nonvalent in many basic reactions.","zh":"在许多基础反应中，该模型把稀有气体视为非价的。"}]}],"synonyms":["inert","unreactive","chemically inert"],"phonetic":"/nɑnˈveɪlənt/","extraExplanation":["“valence（价）”指原子在化合物中通常能形成多少个键（或表现出多少结合能力）。因此“nonvalent”就是“没有（有效）价、几乎不参与成键”。","在入门化学里，稀有气体（如氦、氖、氩）常被当作“nonvalent/惰性”来处理，因为它们最外层电子壳层通常已满，反应性很低。（不过在特殊条件下，部分稀有气体也能形成少量化合物。）","这个词较偏学术/技术语境；日常英语更常说 inert（惰性的）或 unreactive（不活泼的）。"]}
{"word":"nonvalid","summary":{"en":"Nonvalid means “not valid,” often used in technical or formal contexts; “invalid” is more common in everyday English.","zh":"nonvalid 表示“无效的/不成立的”，常见于技术或正式语境；日常英语更常用 invalid。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not valid; not acceptable, correct, or legally/officially effective","zh":"无效的；不被接受的；不正确或在法律/官方上不具效力的"},"examples":[{"en":"Your ticket is nonvalid after the expiration date.","zh":"你的票在到期日之后就无效了。"},{"en":"The system marked the code as nonvalid, so I requested a new one.","zh":"系统把这个代码标记为无效，所以我申请了一个新的。"},{"en":"If the signature is nonvalid, the contract may not be enforceable.","zh":"如果签名无效，这份合同可能无法执行。"}]}],"synonyms":["invalid","not valid","void","ineffective"],"phonetic":"/ˌnɑnˈvælɪd/","extraExplanation":["“nonvalid”在现代英语里不算最常见的写法，更常见的是“invalid”或“not valid”。在一些技术文档、表格验证（validation）或软件提示中，可能会看到“nonvalid”。","拼写上也常见加连字符的形式“non-valid”。正式写作中通常建议用“invalid”，更自然、更标准。"]}
{"word":"nonvalidation","summary":{"en":"Nonvalidation usually means not acknowledging or confirming someone’s feelings or experience; in formal use, it can also mean something has not been confirmed as valid.","zh":"Nonvalidation 通常指在沟通中不去认可或确认他人的感受与经历；在正式语境中也可指“未被验证为有效”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of not validating someone’s feelings, thoughts, or experience (especially in communication); a lack of emotional recognition or confirmation.","zh":"（尤指在沟通中）不去肯定/不去认可他人的感受、想法或经历；缺乏情绪上的确认与接纳。"},"examples":[{"en":"Her nonvalidation made him feel unseen, even though she didn’t mean to be hurtful.","zh":"她的“不予肯定”让他觉得自己不被看见，尽管她并非有意伤人。"},{"en":"In conflict, nonvalidation can quickly turn a small issue into a bigger argument.","zh":"在冲突中，不予肯定会很快把小问题升级成更大的争吵。"},{"en":"Simple phrases like “That makes sense” can reduce nonvalidation.","zh":"像“这很合理/我能理解”这样的简单表达可以减少不予肯定。"}]},{"partOfSpeech":"n.","definition":{"en":"In formal contexts, the state of being not validated (for example, a document, result, or method not being confirmed as valid).","zh":"（较正式语境）未被验证为有效的状态（例如文件、结果或方法未被确认有效）。"},"examples":[{"en":"The nonvalidation of the results meant the study needed to be repeated.","zh":"结果未被验证为有效意味着这项研究需要重复进行。"},{"en":"Due to nonvalidation, the certificate was not accepted by the agency.","zh":"由于未被验证，该证书未被机构接受。"}]}],"synonyms":["lack of validation","non-acknowledgment","dismissal","invalidation (related)"],"phonetic":"/ˌnɑnˌvælɪˈdeɪʃən/","extraExplanation":["“nonvalidation”在日常英语里不算高频词，更常见的是“invalidation（否定/使无效）”。在心理沟通语境中，“nonvalidation”通常指不回应、不确认（可能是忽视、转移话题、沉默），而“invalidation”更像是直接否定（例如“你想太多了”“这不算什么”）。","在辩证行为疗法（DBT）等沟通技巧里，“validation（肯定/接纳）”强调先承认对方感受的合理性（不等于同意对方观点）。因此“nonvalidation”常被用来描述一种让人感到不被理解的互动模式。"]}
{"word":"nonvalidities","summary":{"en":"“Nonvalidities” means instances or points where something is not valid; it’s a less common synonym of “invalidities.”","zh":"“nonvalidities”指某事物不成立/无效的具体情况或无效点；较少见，常用同义词是“invalidities”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) cases or instances in which something is not valid; invalidities.","zh":"（多用复数）某事物不成立/无效的情况；无效之处。"},"examples":[{"en":"The report lists several nonvalidities in the data, including missing dates and duplicate entries.","zh":"报告列出了数据中若干无效之处，包括日期缺失和重复条目。"},{"en":"The lawyer argued that the contract contained nonvalidities that made it unenforceable.","zh":"律师主张合同中存在若干无效点，导致其无法执行。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being not valid; lack of validity (rare; more commonly “invalidity”).","zh":"无效状态；缺乏有效性（较少用；更常见说法是 invalidity）。"},"examples":[{"en":"The nonvalidity of the permit became clear after the new regulation took effect.","zh":"新法规生效后，该许可证的无效性变得明确。"},{"en":"They questioned the nonvalidity of the results because the sample size was too small.","zh":"由于样本量太小，他们质疑结果的无效性。"}]}],"synonyms":["invalidities","instances of invalidity","lack of validity","defects","flaws"],"phonetic":"/ˌnɑn vəˈlɪdəti/","extraExplanation":["“nonvalidities”是比较少见的用法，很多场合更自然的说法是“invalidities”或“instances of invalidity”。","在法律、合同、统计/研究方法等语境里，常用它来指“具体哪些地方无效/不成立”，因此复数形式更常见。"]}
{"word":"nonvalidity","summary":{"en":"Nonvalidity means the state of being not valid; it is a formal word similar to “invalidity.”","zh":"nonvalidity 指“无效、无效性”，较正式，用法接近 invalidity。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not being valid (not legally, logically, or officially acceptable); invalidity","zh":"无效；不具有效力（在法律、逻辑或官方意义上不被认可的状态）"},"examples":[{"en":"The court ruled that the contract had nonvalidity because it was signed under pressure.","zh":"法院裁定该合同因在胁迫下签署而无效。"},{"en":"They questioned the nonvalidity of the results after discovering errors in the data.","zh":"在发现数据错误后，他们质疑结果的无效性。"},{"en":"A missing signature can lead to the nonvalidity of the document.","zh":"缺少签名可能导致文件无效。"}]}],"synonyms":["invalidity","nullity","ineffectiveness","lack of validity"],"phonetic":"/ˌnɑnvəˈlɪdəti/","extraExplanation":["“nonvalidity”在日常英语里不算常见，更常用的是“invalidity”（无效、无效性）或直接说“the document/contract is invalid”（文件/合同无效）。在法律或正式写作中偶尔会看到“nonvalidity”，强调“缺乏有效性”这一状态。","构词上：non-（否定前缀）+ validity（有效性）。写作中也可能出现带连字符的形式“non-validity”，但并不比“invalidity”更常见。"]}
{"word":"nonvalidly","summary":{"en":"“Nonvalidly” means “in a way that is not valid or legally effective,” but it is rare; “invalidly” is more common.","zh":"“nonvalidly”意为“以无效/不具法律效力的方式”，但很少用；更常见的是“invalidly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not valid, not legally effective, or not logically acceptable.","zh":"以无效的方式；在法律上不具效力地；在逻辑上站不住脚地。"},"examples":[{"en":"The contract was signed nonvalidly because one party was not legally able to agree.","zh":"该合同的签署在法律上无效，因为一方没有合法的同意能力。"},{"en":"The form was submitted nonvalidly, so the application had to be redone.","zh":"该表格提交方式无效，所以申请必须重新办理。"}]}],"synonyms":["invalidly","ineffectively","improperly","illegally (in some contexts)"],"phonetic":"/ˌnɑnˈvælɪdli/","extraExplanation":["“nonvalidly”在日常英语中非常少见，多见于法律、行政或非常正式的写作。更常用的表达是“invalidly”（无效地）或用句子说清楚：如“in a way that is not valid / not legally valid”。","构词上：non-（否定前缀）+ valid（有效的）+ -ly（副词后缀）。虽然语法上可以成立，但母语者通常更偏好“invalidly”。"]}
{"word":"nonvalidness","summary":{"en":"“Nonvalidness” means “invalidity,” but it is uncommon and nonstandard; prefer “invalidity” or “lack of validity.”","zh":"“nonvalidness”指“无效性/不成立”，但用法少且不够标准；更建议用“invalidity”或“lack of validity”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon, nonstandard) the state of not being valid; lack of validity; invalidity.","zh":"（少见、非标准用法）不有效/不成立的状态；缺乏效力；无效性。"},"examples":[{"en":"The lawyer argued that the contract’s nonvalidness made it unenforceable.","zh":"律师主张合同的“nonvalidness”（无效性）使其无法执行。"},{"en":"In formal writing, “invalidity” is usually better than “nonvalidness.”","zh":"在正式写作中，“invalidity”通常比“nonvalidness”更合适。"}]}],"synonyms":["invalidity","lack of validity","invalid state"],"phonetic":"/ˌnɑnˈvælɪdnəs/","extraExplanation":["“nonvalidness”由 non-（不）+ valid（有效的）+ -ness（名词后缀）拼成，但在现代英语里很少见，很多读者会觉得别扭或不自然。","更常用、更地道的表达：invalidity（无效性）、lack of validity（缺乏效力/依据）、not valid（无效的，作表语）。","如果你是在写法律、学术或正式文本，建议避免使用“nonvalidness”，用上面更常见的词会更清晰。"]}
{"word":"nonvalorous","summary":{"en":"“Nonvalorous” means not brave; lacking courage.","zh":"“nonvalorous”表示不勇敢、缺乏勇气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not showing valor; lacking courage or bravery.","zh":"不勇敢的；缺乏英勇或胆量的。"},"examples":[{"en":"He felt nonvalorous during the emergency and chose to step back.","zh":"在紧急情况下他觉得自己不够勇敢，于是选择退后。"},{"en":"The story contrasts a heroic leader with a nonvalorous follower.","zh":"这个故事把英勇的领袖和不勇敢的追随者作了对比。"}]}],"synonyms":["cowardly","timid","fainthearted","unbrave","not courageous"],"phonetic":"/nɑnˈvælərəs/","extraExplanation":["“non-”是否定前缀，表示“非、不”。“valorous”来自“valor”（英勇、勇气），因此“nonvalorous”字面意思就是“没有英勇特质的”。","这个词较少见，写作中更常用“cowardly”（懦弱的）或“not brave”（不勇敢的）。不过“nonvalorous”语气通常更中性，强调“缺乏勇气”，不一定强烈指责人格。"]}
{"word":"nonvalorously","summary":{"en":"Nonvalorously means “not bravely; without valor,” but it is very rare in modern English.","zh":"nonvalorously 表示“并非英勇地；缺乏勇气地”，但在现代英语中非常少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not brave or courageous; without valor.","zh":"以不勇敢、缺乏勇气的方式；不英勇地。"},"examples":[{"en":"He spoke nonvalorously, avoiding any mention of the danger.","zh":"他说话毫无勇气，刻意回避提到危险。"},{"en":"The report described the retreat as nonvalorously planned and hurried.","zh":"报告称这次撤退计划得不够英勇，而且很仓促。"}]}],"synonyms":["not bravely","without courage","cowardly","timidly"],"phonetic":"/ˌnɑnˈvælərəsli/","extraExplanation":["这个词非常少见，常见写法更可能用更自然的表达，比如: “not bravely,” “without courage,” “in a cowardly way”（注意：cowardly 语气更强、更带批评）。","构词法：non-（否定前缀）+ valorous（英勇的）+ -ly（副词后缀）。valorous 来自拉丁语 valor（勇气、英勇）。","语体与语感：nonvalorously 多见于较正式或刻意的写作中，用来“冷静地”表示缺乏英勇；日常英语里几乎不用。"]}
{"word":"nonvalorousness","summary":{"en":"Nonvalorousness means a lack of courage or bravery.","zh":"nonvalorousness 指“不勇敢、缺乏勇气/英勇”的状态或特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being valorous; lack of courage or bravery","zh":"不勇敢；缺乏英勇/胆量的特质"},"examples":[{"en":"He was ashamed of his nonvalorousness during the crisis.","zh":"他为自己在危机中的不勇敢感到羞愧。"},{"en":"The story contrasts the hero’s valor with the narrator’s nonvalorousness.","zh":"这个故事把英雄的英勇与叙述者的不勇敢作了对比。"}]}],"synonyms":["cowardice","timidity","lack of courage","fearfulness","unbravery"],"phonetic":"/nɑnˈvælɚəsnəs/","extraExplanation":["这是一个非常少见的名词，由 non-（否定前缀，“不/非”）+ valorous（勇敢的、英勇的）+ -ness（名词后缀，“……的性质/状态”）构成。日常英语更常用 lack of courage / cowardice / timidity 来表达。","valorous 在美式英语中常见拼写为 valorous（英式也可见 valourous，与 valour 对应）。nonvalorousness 多用于较正式或带讽刺色彩的语境。"]}
{"word":"nonvaluable","summary":{"en":"Nonvaluable means “not valuable” or “of little/no worth.”","zh":"nonvaluable 指“不值钱的、没有价值的（或价值很低的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not valuable; having little or no worth or usefulness","zh":"不值钱的；没有价值的；用处不大的"},"examples":[{"en":"The thieves left behind the nonvaluable items and only took the jewelry.","zh":"小偷把那些不值钱的东西留在原地，只拿走了珠宝。"},{"en":"Please remove all nonvaluable objects before the experiment begins.","zh":"实验开始前请把所有没有价值的物品移走。"},{"en":"For customs purposes, mark any nonvaluable samples as “no commercial value.”","zh":"为方便海关申报，请将无商业价值的样品标注为“无商业价值”。"}]}],"synonyms":["not valuable","of no value","worthless","valueless","low-value"],"phonetic":"/nɑnˈvæljuəbəl/","extraExplanation":["“non-”是英语里表示否定的常见前缀，意思是“非、没有、不”。“nonvaluable”在日常英语中不算常用，更自然的说法通常是“not valuable”“of no value”或“worthless”（语气更强、偏贬义）。在海关、保险、安保等较正式的语境里，可能会用“nonvaluable items/objects”来表示“无（商业）价值的物品”。"]}
{"word":"nonvaluation","summary":{"en":"Nonvaluation means not assigning value—either generally not valuing something, or formally leaving something without an appraisal/price.","zh":"Nonvaluation 指“不赋予价值/不估值”，既可指一般意义上的“不重视、不认为有价值”，也可指正式语境下“暂不评估或不标价”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or state of not valuing something; the absence of an appraisal or assigned value","zh":"不估值；不作评估或不赋予价值（的行为或状态）"},"examples":[{"en":"Because the artwork was damaged, the insurer recorded it as a case of nonvaluation until an expert could assess it.","zh":"由于这件艺术品受损，保险公司先将其记为“不估值”，直到专家能够评估为止。"},{"en":"The report criticized the nonvaluation of unpaid care work in the economy.","zh":"该报告批评经济体系中对无偿照护劳动的“不赋值/不计价值”。"}]},{"partOfSpeech":"n.","definition":{"en":"a technical/administrative decision to leave an asset, item, or factor without a stated value (often temporarily)","zh":"（技术/行政用语）对资产、项目或因素暂不标价/暂不计算价值的处理决定"},"examples":[{"en":"The accountant marked the legacy equipment for nonvaluation due to missing purchase records.","zh":"由于缺少购买记录，会计将这批旧设备标注为“暂不估值”。"},{"en":"In the dataset, nonvaluation was used for entries that could not be reliably priced.","zh":"在该数据集中，对于无法可靠定价的条目使用了“非估值/不估值”标记。"}]}],"synonyms":["lack of valuation","no valuation","non-appraisal","unvalued status"],"phonetic":"/ˌnɑnˌvæljuˈeɪʃən/","extraExplanation":["“nonvaluation”不是日常高频词，更常见的表达是“no valuation,” “lack of valuation,” “not valued,” 或在会计/金融语境中用“unvalued / not appraised”。写作中如果想更自然，可以考虑用这些替换。","在社会议题讨论里，它也可引申为“对某种劳动/贡献不被看见、不给予价值”（例如无偿家务、照护劳动），带有批评或反思的语气。"]}
{"word":"nonvalue","summary":{"en":"Nonvalue refers to something that provides no value or benefit, especially in process or business analysis.","zh":"Nonvalue 指没有价值或不带来收益的东西，尤其常用于流程或商业分析中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something that has no value, importance, or usefulness (often used in business or analysis contexts).","zh":"没有价值、重要性或用途的事物（常见于商业或分析语境）。"},"examples":[{"en":"They removed nonvalue steps from the workflow to save time.","zh":"他们从工作流程中去掉了没有价值的步骤来节省时间。"},{"en":"The report helped us separate real benefits from nonvalue.","zh":"这份报告帮助我们把真正的收益和没有价值的东西区分开来。"}]},{"partOfSpeech":"adj.","definition":{"en":"not adding value; not beneficial or useful (more commonly written as “non-value” before a noun).","zh":"不增值的；无益的、不起作用的（更常写作修饰名词的“non-value”）。"},"examples":[{"en":"We want to cut nonvalue tasks and focus on customer needs.","zh":"我们想减少不增值的任务，把重点放在客户需求上。"},{"en":"Waiting time is often a nonvalue part of the process.","zh":"等待时间往往是流程中不增值的一部分。"}]}],"synonyms":["worthlessness","no benefit","unproductive","nonessential","waste"],"phonetic":"/ˌnɑnˈvæljuː/","extraExplanation":["“nonvalue”并不是非常常见的标准拼写；在精益管理（Lean）和流程优化里，更常见的是写成“non-value-added（不增值的）”或“non-value activities（不增值活动）”。","在正式写作中，如果用作形容词放在名词前，建议写作“non-value”并加连字符或空格（如 non-value tasks / nonvalue tasks）；具体取决于公司或期刊的风格指南。"]}
{"word":"nonvalued","summary":{"en":"Nonvalued means either “not appreciated/considered important” or, in technical use, “not assigned a value.”","zh":"nonvalued 指“未被重视的/不被看重的”，也可指（技术语境中）“未被赋值的/没有明确数值的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not valued; not appreciated or considered important.","zh":"不被重视的；不被看重的；不被认为重要的。"},"examples":[{"en":"Some workers feel nonvalued when their efforts are never recognized.","zh":"有些员工在努力从不被认可时会觉得自己不被重视。"},{"en":"She left the team because her ideas were treated as nonvalued.","zh":"她离开团队是因为她的想法被当作不重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not assigned a specific value (often used in technical contexts such as math, finance, or data).","zh":"（常用于数学、金融或数据等技术语境）未被赋值的；没有明确数值的。"},"examples":[{"en":"Rows with nonvalued entries were excluded from the analysis.","zh":"包含未赋值项的行被排除在分析之外。"},{"en":"The model fails when a key variable is nonvalued.","zh":"当一个关键变量未被赋值时，这个模型会失效。"}]}],"synonyms":["unvalued","undervalued","not valued","unappreciated","missing","null"],"phonetic":"/ˌnɑnˈvæljuːd/","extraExplanation":["“nonvalued”在一般英语里不算常见，更常见的写法是“non-valued”（加连字符）或直接用“unvalued / undervalued / not valued”。在数据或数学语境里，也可能用“missing / null / undefined”来表达“未赋值”。"]}
{"word":"nonvalve","summary":{"en":"Nonvalve means “without a valve,” and in medical shorthand it can mean “nonvalvular” (not involving a heart valve).","zh":"nonvalve 指“无阀的”；在医学的非正式缩略中也可指“非瓣膜性的”（= nonvalvular）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical) Having no valve; not equipped with a valve.","zh":"（技术用语）无阀的；不带阀门的。"},"examples":[{"en":"This nonvalve connector is used where backflow prevention is handled elsewhere.","zh":"这种无阀连接器用于回流防护由其他装置负责的场合。"},{"en":"A nonvalve opening allows air to pass freely in both directions.","zh":"无阀开口让空气可以双向自由流动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine, informal/shortened) Not involving a heart valve; nonvalvular.","zh":"（医学，非正式缩略）非瓣膜性的；不涉及心脏瓣膜的（= nonvalvular）。"},"examples":[{"en":"He was diagnosed with nonvalve atrial fibrillation (more commonly: nonvalvular atrial fibrillation).","zh":"他被诊断为非瓣膜性房颤（更常见说法：nonvalvular atrial fibrillation）。"},{"en":"The report describes nonvalve causes rather than valve disease.","zh":"报告描述的是非瓣膜原因，而不是瓣膜疾病。"}]}],"synonyms":["valveless","without a valve","nonvalvular"],"phonetic":"/ˌnɑnˈvælv/","extraExplanation":["“nonvalve”在日常英语里不常见，更多见于工程/医疗场景中的临时写法或缩略表达。更标准、更常用的医学形容词通常是“nonvalvular（非瓣膜性的）”。","构词法：non-（不、非）+ valve（阀门/瓣膜）。在技术写作中，有时会写作“non-valve”（加连字符）以增强可读性。"]}
{"word":"nonvanishing","summary":{"en":"Nonvanishing means “not disappearing” or “not becoming zero,” often used in formal or mathematical contexts.","zh":"nonvanishing 指“不消失/不衰退”或“（数值）不为零”，常用于较正式或数学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not disappearing, fading, or becoming zero; continuing to exist or remain present.","zh":"不消失的；不衰退的；（数值）不为零的；持续存在的。"},"examples":[{"en":"She kept a nonvanishing hope that things would get better.","zh":"她始终怀着不灭的希望，相信事情会好转。"},{"en":"In winter, the mountains were covered with a nonvanishing layer of snow.","zh":"冬天，群山覆盖着一层经久不化的积雪。"},{"en":"The equation requires a nonvanishing denominator.","zh":"这个方程要求分母不为零。"}]}],"synonyms":["undying","enduring","persistent","unfading","nonzero"],"phonetic":"/ˌnɑnˈvænɪʃɪŋ/","extraExplanation":["“nonvanishing”常见于学术与数学语境：例如“nonvanishing function”（处处不为零的函数）、“nonvanishing denominator”（分母不为零）、“nonvanishing term”（不消失项）。在微积分或复分析中，它往往强调“不会变成0”，以保证表达式有意义或可进行推导。","词形结构：non-（不）+ vanish（消失）+ -ing（形容词/分词形式）。比起日常口语，它更偏书面、学术或正式表达。"]}
{"word":"nonvaporosity","summary":{"en":"Nonvaporosity means a material does not let water vapor pass through (it blocks moisture in the air).","zh":"Nonvaporosity 指材料不让水蒸气通过，即能阻隔空气中的湿气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not allowing water vapor (moisture in the air) to pass through a material; vapor impermeability","zh":"（材料）不透水蒸气性；阻隔水蒸气通过的性质；蒸气不渗透性"},"examples":[{"en":"The lab tested the film’s nonvaporosity to see how well it blocks moisture.","zh":"实验室测试了这层薄膜的不透水蒸气性，以判断它阻隔湿气的效果。"},{"en":"High nonvaporosity can help protect electronics from humidity.","zh":"较高的不透水蒸气性有助于保护电子设备免受潮气影响。"}]}],"synonyms":["vapor impermeability","vapor-tightness","moisture barrier","low vapor permeability","nonporosity"],"phonetic":"/ˌnɑnˌveɪpəˈrɑsəti/","extraExplanation":["“nonvaporosity”不是日常英语常用词，更常见的表达是“vapor impermeability / moisture barrier / vapor-tightness”。在工程与材料语境中，也会用“(water) vapor permeability（透湿性）”的反义概念来描述：permeability 越低，材料越“nonvaporous（不透水蒸气的）”。","构词上可理解为 non-（不）+ vaporosity（与蒸气通过有关的性质）。实际写作中，你也可能看到“non-porosity”或“low vapor permeability”来表达更标准、可测量的指标。"]}
{"word":"nonvaporous","summary":{"en":"“Nonvaporous” means not vapor-like and not readily giving off vapor; a rare, technical adjective.","zh":"nonvaporous 指“非蒸气状的、（相对）不易产生/散发蒸气的”，较少见，多用于技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not vaporous; not forming or giving off vapor; not having the quality of vapor (gas-like moisture).","zh":"非蒸气状的；不产生或不散发蒸气的；不具有“蒸气”特性的（偏书面/技术用语）。"},"examples":[{"en":"The liquid is relatively nonvaporous at room temperature, so it evaporates slowly.","zh":"这种液体在室温下相对不易挥发，所以蒸发得很慢。"},{"en":"They stored the chemical in a sealed, nonvaporous mixture to reduce fumes.","zh":"他们把这种化学品储存在密封、低挥发性的混合物中，以减少烟雾/蒸气。"}]}],"synonyms":["nonvolatile","low-volatility","not vaporous"],"phonetic":"/ˌnɑnˈveɪpərəs/","extraExplanation":["“nonvaporous”在日常英语中很少见，更多出现在化学、材料或安全说明等语境。很多人想表达“不开孔/不渗透”的意思时，常用的是“nonporous（不多孔的）”，而不是“nonvaporous”。","构词：non-（不）+ vaporous（蒸气状的、易挥发的）。在实际写作中也常用“low-volatility（低挥发性）”“nonvolatile（不挥发的）”来表达更标准的技术含义。"]}
{"word":"nonvaporously","summary":{"en":"“Nonvaporously” means “in a non-vapor form; without vaporizing.”","zh":"“nonvaporously”表示“以非蒸汽形式；不汽化/不蒸发地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vaporous; without turning into vapor or gas.","zh":"以非蒸汽状的方式；不变成蒸汽或气体地。"},"examples":[{"en":"At this temperature, the chemical remains nonvaporously on the surface.","zh":"在这个温度下，这种化学物质以非蒸汽状的形式停留在表面上。"},{"en":"The fragrance was designed to release slowly and nonvaporously, so it wouldn’t fill the whole room at once.","zh":"这种香氛被设计为缓慢且非蒸汽式地释放，因此不会一下子充满整个房间。"}]}],"synonyms":["without vaporizing","without evaporating","in liquid form","in a non-gaseous manner"],"phonetic":"/ˌnɑnˈveɪpərəsli/","extraExplanation":["“nonvaporously”很少在日常英语中出现，更常见的表达是：“without vaporizing / without evaporating（不汽化/不蒸发）”。","词形结构：non-（不）+ vapor（蒸汽/汽化）+ -ous（…的）+ -ly（以…地）。它多见于技术或科学语境，用来强调“不是以气体/蒸汽形式存在或发生”。"]}
{"word":"nonvaporousness","summary":{"en":"Nonvaporousness means the state of not easily becoming vapor (low tendency to evaporate).","zh":"nonvaporousness 指“不易汽化/不易挥发”的性质（挥发倾向低）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not turning into vapor easily; lack of vaporousness.","zh":"不易汽化（变成气体）的性质；非汽化性。"},"examples":[{"en":"Engineers chose this sealant for its nonvaporousness at high temperatures.","zh":"工程师选择这种密封剂，是因为它在高温下不易汽化。"},{"en":"The report highlights the nonvaporousness of the coating, which helps reduce fumes.","zh":"报告强调这种涂层的不易汽化性，这有助于减少烟雾。"}]}],"synonyms":["nonvolatility","low volatility","non-volatile character","resistance to evaporation"],"phonetic":"/ˌnɑnˈveɪpɚəsnəs/","extraExplanation":["这个词非常少见，多见于技术或学术语境。日常英语里更常用的表达是“low volatility（低挥发性）”“non-volatile（不挥发的）”或“doesn’t evaporate easily（不容易蒸发）”。","构词上：non-（不）+ vaporous（像蒸气的/易成蒸气的）+ -ness（名词后缀，表示“性质/状态”）。因此 nonvaporousness 就是“非蒸气状/不易成蒸气的性质”。","注意与“nonporous（不透水/不多孔）”区分：nonporous 说的是材料孔隙结构；nonvaporousness 说的是“挥发/汽化”倾向。"]}
{"word":"nonvariability","summary":{"en":"Nonvariability means a lack of change or variation; in research it often means a variable shows no differences across observations.","zh":"nonvariability 指缺乏变化或差异；在研究中常指某变量在所有观测中都一样、没有变异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not changing; a lack of variation or differences over time, across situations, or between cases.","zh":"不变性；无变化（指随时间、情境或不同个案之间缺乏差异）。"},"examples":[{"en":"The experiment showed nonvariability in the results across different trials.","zh":"这项实验在不同试验中显示结果不变。"},{"en":"Her routine had a comforting sense of nonvariability.","zh":"她的日常有一种令人安心的恒常感。"}]},{"partOfSpeech":"n.","definition":{"en":"In statistics or research, a situation where a variable has the same value for all observations, so it cannot explain differences.","zh":"（统计/研究）无变异：某个变量在所有观测中取值相同，因此无法解释差异。"},"examples":[{"en":"Because of nonvariability, the predictor was removed from the model.","zh":"由于该预测变量无变异，它被从模型中移除。"},{"en":"If there is nonvariability in a survey item, it won’t help distinguish groups.","zh":"如果问卷题目没有变异，就无法区分不同群体。"}]}],"synonyms":["invariability","constancy","uniformity","lack of variation","stability"],"phonetic":"/ˌnɑnˌvɛriəˈbɪləti/","extraExplanation":["“nonvariability”由前缀 non-（不、非）+ variability（变异性）构成，属于学术/技术语体，日常英语里更常用“no variation / no variability / invariability / constancy”等说法。","相关近义词细微差别：invariability 更偏“始终不变（性质上的恒定）”；nonvariability 更常用于描述“数据/结果没有变化（观测上的无差异）”。"]}
{"word":"nonvariable","summary":{"en":"Nonvariable means not changing, or treated as a constant rather than a variable.","zh":"nonvariable 指“不变的”，或（在数学/科学中）“作为常量处理的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not changing; not able to vary or be varied.","zh":"不变的；不能变化的。"},"examples":[{"en":"The price is nonvariable for the next six months.","zh":"未来六个月价格保持不变。"},{"en":"We need a nonvariable rule everyone can follow.","zh":"我们需要一条大家都能遵守的不变规则。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/Science) Treated as a constant rather than a variable.","zh":"（数学/科学）被视为常量的；非变量的。"},"examples":[{"en":"In this equation, k is nonvariable, but x can change.","zh":"在这个方程里，k 是常量（非变量），但 x 可以变化。"},{"en":"Assume temperature is nonvariable during the test.","zh":"假设测试期间温度不变。"}]}],"synonyms":["constant","fixed","unchanging","invariable","stable"],"phonetic":"/nɑnˈvɛriəbəl/","extraExplanation":["“nonvariable”常见于学术或技术写作（数学、统计、实验说明、工程文档等），日常口语里更常用 “constant（常量的）/ fixed（固定的）/ unchanging（不变的）”。","写法上有时也会写成 “non-variable”。在编程语境中，人们更常说 “constant” 或具体语言里的关键字（如 const、final），而不是直接说 nonvariable。"]}
{"word":"nonvariableness","summary":{"en":"Nonvariableness means the quality of not changing (invariability or constancy).","zh":"nonvariableness 指“不变性/恒定性”，即缺乏变化的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not changing; lack of variability; constancy","zh":"不变性；不易变化的性质；恒定性"},"examples":[{"en":"In this experiment, we assume the nonvariableness of the temperature.","zh":"在这个实验中，我们假设温度具有不变性。"},{"en":"The nonvariableness of his routine helped him stay focused.","zh":"他生活作息的恒定性帮助他保持专注。"}]}],"synonyms":["invariability","constancy","unchangeability","stability","uniformity"],"phonetic":"/ˌnɑnˈvɛriəbəlnəs/","extraExplanation":["“nonvariableness”在现代英语中很少见，写作与学术语境里更常用“invariability”“constancy”或“lack of variation”。","构词思路：non-（不）+ variable（可变的）+ -ness（名词后缀），字面意思就是“不可变的状态/性质”。"]}
{"word":"nonvariably","summary":{"en":"“Nonvariably” means “always the same; without changing.”","zh":"“nonvariably”表示“始终不变地；一贯地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not change; consistently; without variation.","zh":"以不变化的方式；始终如一地；没有变化地。"},"examples":[{"en":"The safety rule is nonvariably enforced in this lab.","zh":"这条安全规定在这个实验室里始终严格执行。"},{"en":"In this climate, the nights are nonvariably cool even in summer.","zh":"在这种气候里，即使在夏天夜晚也一贯凉爽。"},{"en":"Her schedule is nonvariably the same on weekdays.","zh":"她的日程在工作日始终如一。"}]}],"synonyms":["invariably","consistently","unchangingly","steadily","always"],"phonetic":"/ˌnɑnˈvɛriəbli/","extraExplanation":["“nonvariably”由前缀 non-（不、非）+ variable（可变的）+ -ly（副词后缀）组成，字面意思就是“以不变化的方式”。在日常英语里更常用的是 “invariably / always / consistently”。在写作中用 “nonvariably” 会显得更正式或更少见。"]}
{"word":"nonvariance","summary":{"en":"Nonvariance means having no variance—no change or spread in values, often used in statistics and research.","zh":"Nonvariance 指“无方差/不变性”，即数值没有变化或离散，常用于统计与研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having no variance; no change or spread in values, results, or behavior (often in statistics or research writing)","zh":"无方差；不变性：数值、结果或行为没有变化或离散（常见于统计或研究语境）"},"examples":[{"en":"The survey item showed nonvariance because every participant chose the same answer.","zh":"这个问卷题目出现了无方差，因为所有参与者都选了同一个答案。"},{"en":"Nonvariance in the data can make some statistical tests impossible to run.","zh":"数据中的无方差可能导致某些统计检验无法进行。"},{"en":"Researchers removed variables with nonvariance before building the model.","zh":"研究者在建模前剔除了没有方差的变量。"}]}],"synonyms":["invariance","constancy","lack of variance","no variability"],"phonetic":"/nɑnˈvɛriəns/","extraExplanation":["“Nonvariance”多用于学术写作（统计、心理测量、机器学习等），日常英语里更常说“no variance”或用形容词“invariant/constant”。","在统计里，如果一个变量对所有观测值都相同（例如全是0或全是同一选项），就叫“nonvariance”。这类变量通常对解释差异没有帮助，也可能引发计算问题（如相关系数或回归中出现不可估计的情况）。"]}
{"word":"nonvariant","summary":{"en":"Nonvariant means “not changing; having no different forms,” especially in linguistics or biology.","zh":"nonvariant 指“无变化的、无不同形式的”，常用于语言学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) having no different forms; not changing with grammar (for example, not changing for plural or tense).","zh":"（语言学）无词形变化的；不随语法变化（如不变复数、不变时态）。"},"examples":[{"en":"In English, “sheep” is a nonvariant plural noun.","zh":"在英语中，sheep 的复数是不变的，属于无词形变化的名词。"},{"en":"Some loanwords stay nonvariant and don’t take an -s in plural.","zh":"有些外来词保持词形不变，复数不加 -s。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) not showing variation; remaining the same across cases or individuals.","zh":"（生物/医学）不变的；在不同个体或情况中没有差异的。"},"examples":[{"en":"The study reported a nonvariant region in the gene.","zh":"研究报告该基因中有一个不发生变异的区域。"},{"en":"The symptoms were mostly nonvariant across patients.","zh":"这些症状在不同患者之间大多没有差异。"}]}],"synonyms":["invariant","unchanging","fixed","stable","constant"],"phonetic":"/ˌnɑnˈvɛriənt/","extraExplanation":["“non-”表示“非/不”，variant 来自“vary（变化）”。因此 nonvariant 字面意思就是“不会变化的”。","在语言学里，它常用来描述“词形不发生屈折变化”的词，比如某些名词复数形式不变（sheep, deer），或某些外来词在使用中常保持原形（视语域与风格而定）。","在生物学/医学语境中，它常接近“invariant（不变的）/conserved（保守的）”，尤其用于描述基因序列、蛋白区域或特征在样本间保持一致。"]}
{"word":"nonvariation","summary":{"en":"Nonvariation means a lack of variation—things remain the same, often in scientific or linguistic contexts.","zh":"nonvariation 指“没有变化/不发生变异”，常用于科学研究或语言学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of change or differences; a state of staying the same over time or across cases","zh":"无变化；不变性（指随时间或不同情况保持一致、没有差异）"},"examples":[{"en":"The data showed nonvariation across all age groups.","zh":"数据显示所有年龄组之间都没有变化。"},{"en":"In the experiment, nonvariation in temperature was important for fair results.","zh":"在实验中，温度保持不变对公平的结果很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) a situation where a form does not alternate or vary (for example, using one stable form instead of multiple variants)","zh":"（语言学）不发生变体/交替的情况（例如只使用一种固定形式，而不是多个变体）"},"examples":[{"en":"The study focused on nonvariation in verb endings in formal writing.","zh":"这项研究关注正式写作中动词词尾的非变异现象。"},{"en":"Nonvariation can make a pattern easier for learners to notice.","zh":"不变异会让学习者更容易看出语言模式。"}]}],"synonyms":["lack of variation","no variation","constancy","uniformity","invariance"],"phonetic":"/ˌnɑnˌvɛriˈeɪʃən/","extraExplanation":["“nonvariation”由前缀 non-（否定：不、无）+ variation（变化、变异）组成，常见于学术写作（统计、实验设计、语言学）。日常英语里更常说 “no variation” 或 “lack of variation”。"]}
{"word":"nonvaried","summary":{"en":"“Nonvaried” means uniform or not changing; it has little or no variety.","zh":"“nonvaried”指单一一致、缺少变化的；几乎没有多样性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not varied; uniform or unchanged (often describing something that stays the same without differences).","zh":"不变化的；单一一致的；没有差异的（常形容始终如一、缺少变化）。"},"examples":[{"en":"The scenery became nonvaried after hours of driving across the flat desert.","zh":"在平坦的沙漠里开了好几个小时后，景色变得单调不变。"},{"en":"A nonvaried routine can feel comforting for some people.","zh":"对一些人来说，一成不变的日常作息会让人感到安心。"}]}],"synonyms":["unvaried","uniform","unchanging","monotonous","invariable"],"phonetic":"/nɑnˈvɛrid/","extraExplanation":["“non-”是表示否定的前缀，意思类似“不、非”。“nonvaried”字面上就是“没有变化的”。","在现代英语中，“unvaried”或“invariable”更常见；“nonvaried”较少见，写作时可以优先考虑更常用的替换词。"]}
{"word":"nonvarieties","summary":{"en":"“Nonvarieties” means things that are not considered varieties or distinct types within a category.","zh":"“nonvarieties”指不被视为（某一类别中的）品种/变种/类型的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that are not varieties (not distinct types within a species, product line, or category).","zh":"非“品种/变种”的事物；不属于某一类别中不同“品种/类型”的东西。"},"examples":[{"en":"The report separates recognized varieties from nonvarieties to avoid confusing readers.","zh":"报告把公认的品种和非品种区分开来，以免读者混淆。"},{"en":"In the dataset, nonvarieties were excluded because they didn’t meet the definition of a variety.","zh":"在数据集中，非品种被排除在外，因为它们不符合“品种”的定义。"}]}],"synonyms":["non-variety items","items that aren’t varieties","nonvariants","non-types"],"phonetic":"/ˌnɑnvəˈraɪətiz/","extraExplanation":["“nonvarieties”是复数形式，对应单数“nonvariety”。它通常出现在比较正式或专业的语境里（如农业、园艺、分类学、数据标注/统计），用来说明某些样本或条目“不是被承认为品种/变种”。在日常英语中更常用的说法可能是“items that aren’t varieties / non-variety items”。"]}
{"word":"nonvariety","summary":{"en":"“Nonvariety” means a lack of variety—sameness or monotony.","zh":"“Nonvariety”指缺乏多样性，即单调、千篇一律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lack of variety; sameness or monotony (often describing food, activities, entertainment, or products).","zh":"缺乏多样性；单调、千篇一律（常形容食物、活动、娱乐或产品）。"},"examples":[{"en":"After a week of the same lunches, the nonvariety started to bother me.","zh":"连续一周都吃同样的午饭，这种单调开始让我受不了了。"},{"en":"The show’s nonvariety made it feel predictable and boring.","zh":"节目缺乏变化，让人觉得可预测又无聊。"}]}],"synonyms":["lack of variety","monotony","sameness","uniformity","predictability"],"phonetic":"/ˌnɑn vəˈraɪəti/","extraExplanation":["“non-”是英语中表示“非、不、无”的常见前缀，放在名词或形容词前用来否定或表示缺失。虽然“nonvariety”可以被理解并偶尔使用，但更常见、更自然的说法是“lack of variety”“little variety”或“monotony”。","写作建议：如果是正式写作，优先用“lack of variety / monotony”；“nonvariety”更像是临时造词或较少见的用法。"]}
{"word":"nonvarious","summary":{"en":"“Nonvarious” means not varied—uniform or lacking differences.","zh":"“nonvarious”表示“不多样、缺少变化”，强调统一或单一。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not varied; not having many different kinds or changes; uniform or the same throughout.","zh":"不多样的；不变化的；统一的、单一的。"},"examples":[{"en":"The menu was nonvarious, with the same dishes served every day.","zh":"菜单不多样，每天都供应同样的菜。"},{"en":"They lived a quiet, nonvarious routine from week to week.","zh":"他们过着安静而单调、几乎不变的周常生活。"}]}],"synonyms":["uniform","unchanging","monotonous","unvaried","same"],"phonetic":"/nɑnˈvɛriəs/","extraExplanation":["“nonvarious”在现代英语中非常少见，很多情况下更常用的表达是“not varied / uniform / unchanging / monotonous”。如果你在文章里看到它，通常是作者为了强调“缺少变化”而使用的较不常见词形。","构词：non-（不、非）+ various（多种多样的）。含义直观，但由于“various”本身更常用来修饰“种类多”，所以否定形式在实际写作中常被更自然的短语替代。"]}
{"word":"nonvariously","summary":{"en":"“Nonvariously” means “uniformly; without variation,” and it is very uncommon in modern English.","zh":"“nonvariously”意为“统一地、无变化地”，在现代英语中非常少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not varied; uniformly; without changing","zh":"以不变化的方式；一成不变地；一致地"},"examples":[{"en":"The policy was applied nonvariously across all departments.","zh":"这项政策在所有部门都被一致地执行。"},{"en":"In the report, the results were described nonvariously, with no attention to regional differences.","zh":"在报告中，结果被一律描述，没有关注地区差异。"},{"en":"She responded nonvariously to every suggestion, repeating the same answer.","zh":"她对每个建议都一成不变地回应，反复说同一句话。"}]}],"synonyms":["uniformly","consistently","unchangingly","without variation"],"phonetic":"/ˌnɑnˈvɛriəsli/","extraExplanation":["这个词非常少见，属于“non-（不）+ various（多样的）+ -ly（副词后缀）”的构词方式。日常写作中更常用的替代词是 uniformly / consistently / without variation。","在正式或学术语境里，它强调“没有差异、没有变化”的处理方式，有时带有“忽视差别、过于一刀切”的语气。"]}
{"word":"nonvariousness","summary":{"en":"“Nonvariousness” (rare) means a lack of variety—sameness or uniformity.","zh":"“nonvariousness”（少见）指缺乏多样性，即单一、同质或一致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not being various; a lack of variety; sameness or uniformity (rare/nonstandard).","zh":"不多样性；缺乏变化；单一、同质（较少见/不太规范的用法）。"},"examples":[{"en":"The menu’s nonvariousness made it hard to find something new.","zh":"菜单缺乏多样性，让人很难找到新东西。"},{"en":"Critics complained about the nonvariousness of the show’s plots.","zh":"评论家抱怨这部剧的剧情缺乏变化。"}]}],"synonyms":["lack of variety","sameness","uniformity","monotony","homogeneity"],"phonetic":"/nɑnˈvɛriəsnəs/","extraExplanation":["这个词在现代英语中非常少见，很多情况下更自然的表达是：lack of variety / sameness / uniformity / monotony。","构词法：non-（否定）+ various（多样的）+ -ness（名词后缀），字面意思就是“非多样的状态”。"]}
{"word":"nonvascular","summary":{"en":"Nonvascular means lacking vessels that carry fluids, especially blood vessels in animals or xylem/phloem in plants.","zh":"nonvascular 指“无血管/无维管组织的”，常用于医学与植物学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having vessels (tubes) that carry fluid, especially in biology: lacking blood vessels in animals or lacking xylem/phloem in plants.","zh":"无血管的；无维管的（尤指生物学中：动物缺乏血管，或植物缺乏木质部/韧皮部等维管组织）。"},"examples":[{"en":"The cornea is nonvascular, which helps it stay clear.","zh":"角膜是无血管的，这有助于它保持透明。"},{"en":"Mosses are nonvascular plants, so they stay small and close to moist places.","zh":"苔藓是非维管植物，所以它们通常很小，并且常靠近潮湿环境生长。"}]}],"synonyms":["avascular","non-vascular"],"phonetic":"/nɑnˈvæskjələr/","extraExplanation":["“non-”是常见前缀，表示“非、不”。“vascular”来自拉丁语词根 vas（容器、血管），所以 nonvascular 字面意思就是“没有血管/导管的”。","在植物学里，nonvascular plants 通常指苔藓、地钱等“非维管植物”，它们没有木质部和韧皮部，主要靠扩散和表面吸收运输水分与养分。","在医学语境中，nonvascular 常用来描述某些组织（如角膜、软骨）缺乏血管，因此愈合较慢、营养供应方式不同。"]}
{"word":"nonvascularly","summary":{"en":"“Nonvascularly” means “in a nonvascular way,” usually in scientific contexts.","zh":"“nonvascularly”意为“以非血管性的方式”，多用于科学/医学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a nonvascular way; without blood vessels or a vascular system (often used in biology/medicine).","zh":"以无血管的方式；不含血管地／非血管性地（常用于生物学、医学语境）。"},"examples":[{"en":"Some simple organisms take in nutrients nonvascularly, directly through their surface.","zh":"一些结构简单的生物以非血管性方式吸收养分，直接通过体表进行。"},{"en":"In the early stage, the tissue is supplied nonvascularly by diffusion.","zh":"在早期阶段，组织主要通过扩散获得供给，属于非血管性供给。"}]}],"synonyms":["avascularly","without blood vessels","non-vascularly"],"phonetic":"/ˌnɑnˈvæskjələrli/","extraExplanation":["构词理解：non-（否定前缀，表示“非/无”）+ vascular（血管的）+ -ly（副词后缀）。因此 nonvascularly = “以非血管的方式”。","使用提示：该词较少用于日常英语，多见于学术写作（解剖学、植物学、病理学等）。常见搭配包括：nonvascularly supplied（非血管性供给）、nonvascularly absorbed（非血管性吸收）。"]}
{"word":"nonvasculose","summary":{"en":"“nonvasculose” is likely a misspelling; the standard word is “nonvascular,” meaning “without blood vessels or vascular tissue.”","zh":"“nonvasculose”很可能是拼写错误；常用标准词是“nonvascular”，表示“无血管的”或“无维管组织的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “nonvascular”) Not having vessels for transporting fluids (such as blood vessels in animals or vascular tissue in plants).","zh":"（可能想写的是 nonvascular）非血管的；（植物）无维管组织的。"},"examples":[{"en":"Mosses are nonvascular plants, so they absorb water directly through their surfaces.","zh":"苔藓是无维管植物，所以它们通过表面直接吸收水分。"},{"en":"The cornea is nonvascular, which helps it stay clear.","zh":"角膜是无血管的，这有助于它保持透明。"}]}],"synonyms":["nonvascular","avascular"],"phonetic":"/nɑnˈvæskjələr/","extraExplanation":["“nonvasculose”在常见英语词典中几乎不作为标准词条出现；在生物/医学语境里，人们通常用 **nonvascular**（非血管的/无维管组织的）。","词形小提示：**non-** 表示“非/无”，**vascular** 来自 “vessel（血管/导管）”。所以写作 **nonvascular** 更自然、更常见。"]}
{"word":"nonvasculous","summary":{"en":"Nonvasculous means “without blood vessels” (or, in botany, “without vascular tissue”).","zh":"nonvasculous 指“无血管的”；在植物学中也指“无维管组织的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking blood vessels (not vascular); having little or no network of vessels for carrying blood or fluids.","zh":"无血管的；非血管性的（缺乏输送血液或体液的血管网络）。"},"examples":[{"en":"The cornea is normally nonvasculous, which helps it stay clear.","zh":"角膜通常是无血管的，这有助于保持透明。"},{"en":"Doctors may describe some tissues as nonvasculous when they receive nutrients indirectly.","zh":"医生可能会用“无血管的”来形容某些组织，因为它们是间接获得营养的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany) Not containing vascular tissue (xylem and phloem).","zh":"（植物学）无维管组织的（不含木质部和韧皮部）。"},"examples":[{"en":"Mosses are nonvasculous plants, so they rely on moisture around them.","zh":"苔藓是无维管植物，因此依赖周围环境的水分。"}]}],"synonyms":["avascular","nonvascular","without blood vessels"],"phonetic":"/nɑnˈvæskjələs/","extraExplanation":["“nonvasculous”在现代英语里较少见，更常见的医学/生物学用词是“avascular（无血管的）”。写作或学术场景中两者意思接近，但“avascular”更常用、更自然。","构词法：non-（不、无）+ vasculous（有血管的）。注意“vasculous”本身也不如“vascular”常见，因此整体词频较低。"]}
{"word":"nonvassal","summary":{"en":"Nonvassal means “not a vassal,” i.e., independent rather than subordinate in a feudal-style relationship.","zh":"nonvassal 意为“非附庸的/非臣属的”，强调在类似封建关系中保持独立而非从属。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not a vassal; not owing service or loyalty to a feudal lord or a more powerful ruler","zh":"非附庸的；不向领主或强权统治者效忠、服役的"},"examples":[{"en":"The city remained nonvassal and governed itself.","zh":"这座城市保持非附庸地位，自行治理。"},{"en":"They negotiated as nonvassal allies rather than subjects.","zh":"他们以非附庸的盟友身份谈判，而不是以臣属身份。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that is not a vassal; an independent party in a feudal-style relationship (rare)","zh":"非附庸者；在类似封建关系中保持独立的一方（较少见）"},"examples":[{"en":"In the treaty, nonvassals were granted the right to trade freely.","zh":"在条约中，非附庸者被赋予自由贸易的权利。"}]}],"synonyms":["independent","sovereign","free","self-governing","non-subordinate"],"phonetic":"/ˌnɑnˈvæsəl/","extraExplanation":["“vassal（附庸/臣属）”主要出现在欧洲封建制度语境：附庸向领主宣誓效忠，以服役换取土地或保护。“non-”是常见前缀，表示“非……/不……”。因此 nonvassal 多用于历史写作、学术讨论或奇幻/策略游戏设定里，强调“不是附庸、保持独立”。","日常英语中更常用 independent（独立的）, sovereign（主权的）, not subordinate to（不从属于）来表达类似意思；nonvassal 属于更“设定化/历史化”的用词。"]}
{"word":"nonvector","summary":{"en":"“Nonvector” means not a vector; it describes (or sometimes names) something that isn’t represented or treated as a vector, especially in technical contexts.","zh":"“nonvector”指“非向量的/不是向量的”，用于描述（或有时指代）不以向量表示或不按向量处理的事物，多见于技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a vector; not having vector form or vector properties (used especially in math, physics, and programming).","zh":"非向量的；不是向量的；不具备向量形式或向量性质的（常用于数学、物理与编程语境）。"},"examples":[{"en":"This parameter is nonvector, so it can’t be added like a force vector.","zh":"这个参数是非向量的，所以不能像力向量那样相加。"},{"en":"The function returns a nonvector value (a single number) instead of an array.","zh":"这个函数返回的是非向量值（一个单独的数字），而不是数组。"}]},{"partOfSpeech":"n.","definition":{"en":"A quantity, value, or object that is not represented as a vector (sometimes used as a noun in technical writing).","zh":"非向量量；非向量对象（技术写作中有时作名词用，指不以向量表示的量/值/对象）。"},"examples":[{"en":"Store the nonvectors in a separate list from the vectors.","zh":"把非向量对象与向量分开存到不同的列表里。"},{"en":"Scalars are nonvectors, but they can still scale a vector.","zh":"标量是非向量，但它仍然可以对向量进行缩放。"}]}],"synonyms":["non-vector","scalar (often, depending on context)","non-vectorized (in programming contexts)"],"phonetic":"/nɑnˈvɛktər/","extraExplanation":["“non-”是常见前缀，表示“非、不是”。“nonvector”在正式英语中不算常见日常词，更多见于学术/工程语境。","在数学与物理里，最常见的对比是：vector（向量） vs. scalar（标量）。很多时候写“nonvector”其实就是强调“这里不是向量（可能是标量、字符串、单个数值或一般对象）”。","在编程语境中，nonvector常用于区分“向量化（vectorized）操作”和“非向量化（nonvector）/标量（scalar）操作”，比如某个函数返回单值而不是数组。"]}
{"word":"nonvegetable","summary":{"en":"“Nonvegetable” means not a vegetable, or a food item that isn’t a vegetable.","zh":"“nonvegetable”表示“非蔬菜的”，也可指“非蔬菜食物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a vegetable; not made from vegetables.","zh":"非蔬菜的；不是由蔬菜制成的。"},"examples":[{"en":"She ordered a nonvegetable dish, choosing chicken instead of salad.","zh":"她点了一道非蔬菜的菜，选了鸡肉而不是沙拉。"},{"en":"The menu separates vegetable and nonvegetable options.","zh":"菜单把蔬菜类和非蔬菜类选项分开。"}]},{"partOfSpeech":"n.","definition":{"en":"A food item that is not a vegetable (often meat, fish, dairy, or grains).","zh":"非蔬菜食物（常指肉、鱼、奶制品或谷物等）。"},"examples":[{"en":"He eats plenty of vegetables but limits nonvegetables like fried meat.","zh":"他蔬菜吃得很多，但会限制油炸肉类等非蔬菜食物。"},{"en":"Add one vegetable and one nonvegetable to balance the meal.","zh":"加一道蔬菜和一道非蔬菜，让这顿饭更均衡。"}]}],"synonyms":["non-vegetable","not a vegetable","non-vegetarian (not the same meaning)"],"phonetic":"/ˌnɑnˈvɛdʒtəbəl/","extraExplanation":["“nonvegetable”更常见的写法是带连字符的“non-vegetable”。在饮食或菜单语境里，它通常只是分类用语（把蔬菜类与其他食物分开），不等同于“非素食（non-vegetarian）”。注意：nonvegetable ≠ nonvegetarian。"]}
{"word":"nonvegetation","summary":{"en":"Nonvegetation means an area or land cover that has no plants, often used in mapping or environmental contexts.","zh":"nonvegetation 指“无植被/非植物覆盖”，常用于地图、遥感或环境语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of plants in an area; land cover that is not made up of vegetation (plants).","zh":"无植被；某一地区缺少植物覆盖的状态；（土地覆盖分类中）非植物覆盖。"},"examples":[{"en":"In the desert, nonvegetation areas are common because there is very little rainfall.","zh":"在沙漠里，无植被区域很常见，因为降雨非常少。"},{"en":"The satellite map separates vegetation from nonvegetation such as roads, buildings, and bare soil.","zh":"这张卫星地图把植被与非植被（如道路、建筑、裸土）区分开来。"}]}],"synonyms":["bare ground","non-vegetated area","no vegetation"],"phonetic":"/ˌnɑnˌvɛdʒəˈteɪʃən/","extraExplanation":["这个词更常见的写法是加连字符的 non-vegetation，尤其在遥感、地理信息（GIS）、生态与土地覆盖分类里使用，用来和 vegetation（植被）做对照。","日常英语里更自然的表达往往是 no vegetation（没有植被）或 non-vegetated area（无植被地区/未被植被覆盖的区域）。"]}
{"word":"nonvegetative","summary":{"en":"Nonvegetative means “not plant-related or not involving vegetative (asexual) growth,” and less commonly “not in a vegetative state.”","zh":"nonvegetative 指“非植物相关/不涉及营养（无性）生长”，较少见时也可指“非植物人状态”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to plants, plant-like growth, or plant reproduction (especially not involving vegetative reproduction such as runners, bulbs, or cuttings).","zh":"非植物的；不涉及植物生长或植物的无性（营养）繁殖（如匍匐茎、鳞茎、扦插等）。"},"examples":[{"en":"The study compared vegetative and nonvegetative forms of reproduction in the species.","zh":"这项研究比较了该物种的营养繁殖与非营养繁殖方式。"},{"en":"Nonvegetative traits in this discussion refer to features not directly tied to plant growth.","zh":"此处所说的“非植物性特征”指与植物生长不直接相关的特征。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medical, less common) Not in a vegetative state; showing awareness or purposeful response.","zh":"（医学用法，较少见）非植物人状态；表现出意识或有目的的反应。"},"examples":[{"en":"Doctors looked for signs that the patient was nonvegetative, such as following simple commands.","zh":"医生寻找病人处于非植物人状态的迹象，例如能听从简单指令。"}]}],"synonyms":["non-vegetative","nonplant","sexual (reproduction)","conscious (medical context)"],"phonetic":"/ˌnɑnˈvɛdʒəˌteɪtɪv/","extraExplanation":["这个词在现代英语里比较少见，更常见的写法是带连字符的 non-vegetative。不同学科里“vegetative”的核心含义不同：植物学里偏“营养生长/无性繁殖”，医学里偏“植物人状态/仅维持自主功能”。阅读学术文章时要根据语境判断。"]}
{"word":"nonvegetatively","summary":{"en":"Nonvegetatively means “not by vegetative reproduction” (often by seeds) or, less commonly, “not in a vegetative/inactive way.”","zh":"nonvegetatively 表示“非营养繁殖地（常指通过种子等）”，较少见时也可指“不是植物状态般消极地，而是积极地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vegetative reproduction (not by shoots, cuttings, runners, etc.); by non-vegetative means (often sexual reproduction by seeds).","zh":"以“非营养繁殖”的方式；不是通过枝条、扦插、匍匐茎等方式繁殖（常指通过种子等有性方式）。"},"examples":[{"en":"These plants spread nonvegetatively, mainly by producing seeds.","zh":"这些植物主要通过产生种子来进行非营养繁殖式的扩散。"},{"en":"To increase genetic diversity, the species reproduces nonvegetatively in some habitats.","zh":"为了增加遗传多样性，这个物种在某些栖息地会以非营养繁殖的方式繁殖。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is not like a vegetative state (not inactive, dull, or merely “existing”); actively.","zh":"以非“植物人/呆滞”状态的方式（不死气沉沉、不是只是“活着”）；积极地。"},"examples":[{"en":"After treatment, he began participating nonvegetatively in daily life again.","zh":"治疗后，他又开始积极地参与日常生活。"},{"en":"The goal is to live nonvegetatively—awake, engaged, and purposeful.","zh":"目标是过一种不呆滞的生活——清醒、投入且有目标。"}]}],"synonyms":["sexually (biology)","by seed","actively","engagedly"],"phonetic":"/ˌnɑnˈvɛdʒəˌteɪtɪvli/","extraExplanation":["“non-”是否定前缀，表示“不、非”。“vegetatively”既可用于植物学（营养繁殖），也可用于比喻或医学语境（vegetative state 指持续性植物状态/意识极低的状态）。因此 nonvegetatively 很少见，但在学术写作中可用来明确“不是营养繁殖”或“不是植物状态般的消极”。","在医学表达上，更常见更自然的说法通常是 “not in a vegetative state” 或 “actively/engaged”，而不是直接用 nonvegetatively。"]}
{"word":"nonvegetativeness","summary":{"en":"Nonvegetativeness means being active, alert, and mentally responsive (not “vegetative”).","zh":"nonvegetativeness 指积极、清醒、有反应的状态（不呆滞/不处于“植物状态”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being nonvegetative; being active, alert, or mentally engaged rather than inactive or “vegetative.”","zh":"“非植物性”的状态或性质；指人更积极、清醒、投入，而不是呆滞、无精打采或“像植物一样”的状态。"},"examples":[{"en":"After a full night’s sleep, her nonvegetativeness returned and she started making plans again.","zh":"睡了一个好觉后，她恢复了精神和活力，又开始计划事情了。"},{"en":"The doctor looked for signs of nonvegetativeness, such as following movement with the eyes.","zh":"医生寻找“非植物性”的迹象，例如眼睛能追随移动的物体。"}]}],"synonyms":["alertness","responsiveness","engagement","liveliness","wakefulness"],"phonetic":"/ˌnɑnˌvɛdʒəˈteɪtɪvnəs/","extraExplanation":["这个词非常少见，多见于学术/医学写作或刻意的修辞表达。日常英语里更常说：alertness（清醒）、responsiveness（反应能力）、engagement（投入）、not in a vegetative state（不处于植物状态）。","词形来源：non-（不、非）+ vegetative（植物性的；无意识/呆滞的）+ -ness（名词后缀，表示“性质/状态”）。常见写法也可能带连字符：non-vegetativeness。"]}
{"word":"nonvegetive","summary":{"en":"“Nonvegetive/nonvegetative” is a rare adjective meaning “not vegetative,” used mainly in biology or (less commonly) to mean “not in a vegetative state.”","zh":"“Nonvegetive/nonvegetative”是较少见的形容词，意思是“非营养生长/非植物性的”，主要见于生物学语境；较少情况下可指“非植物人状态”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not vegetative; not relating to plant growth or plant-like functions (rare in everyday English).","zh":"非营养生长的；不与植物生长/植物性功能有关的（在日常英语中较少见）。"},"examples":[{"en":"The scientist compared vegetative tissues with nonvegetative reproductive tissues.","zh":"这位科学家把营养组织与非营养的生殖组织进行比较。"},{"en":"In this context, “nonvegetative” means the cells are not mainly focused on growth.","zh":"在这里，“nonvegetative”指这些细胞主要不以生长为重点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(medicine) not in a vegetative state; not showing the features of a vegetative state (very uncommon wording—often rephrased).","zh":"（医学）非植物人状态的；不呈现植物人状态特征的（这种说法很少见，通常会改写）。"},"examples":[{"en":"The report described the patient as conscious, not vegetative—in other words, nonvegetative.","zh":"报告称患者有意识，并非植物人状态——换言之，是非植物人状态的。"},{"en":"Doctors usually avoid the term “nonvegetative” and instead describe the patient’s level of consciousness.","zh":"医生通常避免使用“nonvegetative”一词，而是直接描述患者的意识水平。"}]}],"synonyms":["non-vegetative","reproductive (in biology context)","conscious (in medical context)"],"phonetic":"/ˌnɑnˈvɛdʒəˌteɪtɪv/","extraExplanation":["这个词非常少见，更多时候会写成 non-vegetative（带连字符），或直接换成更常见的表达。","在生物学里，vegetative 常指“营养生长/生长相关的”（如 vegetative growth）；相对的更常见搭配是 reproductive（生殖的）、sexual（有性生殖的）。","在医学里，常见说法是 vegetative state（植物状态）。要表达“不是植物状态”，通常会写成 not in a vegetative state，或更具体地说 conscious / minimally conscious 等。","如果你原本想写的是“nonnegative（非负的）”或“nonvegetarian（非素食者的）”，拼写会完全不同；可以告诉我你的语境我帮你确认。"]}
{"word":"nonvehement","summary":{"en":"Nonvehement means calm, not intense, and not strongly expressed.","zh":"nonvehement 指“平和的、不激烈的、表达不强烈的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not forceful, intense, or passionately expressed; calm and restrained in tone or feeling.","zh":"不激烈的；不强硬的；语气或情绪较为平和、克制的。"},"examples":[{"en":"She offered a nonvehement response, even though she strongly disagreed.","zh":"尽管她非常不同意，她的回应仍然不激烈，很克制。"},{"en":"The debate stayed nonvehement and respectful.","zh":"这场辩论保持平和、不激烈，而且相互尊重。"},{"en":"His criticism was nonvehement—more thoughtful than angry.","zh":"他的批评不激烈——更像深思后的意见，而不是愤怒。"}]}],"synonyms":["calm","mild","restrained","measured","temperate"],"phonetic":"/nɑnˈviəmənt/","extraExplanation":["这个词比较少见，日常英语中更常说：calm（冷静的）、mild（温和的）、measured（克制的）、not forceful（不强硬的）。","构词上是前缀 non-（不、非）+ vehement（激烈的、强烈的）。写作中偶尔用来强调“刻意不激烈”的语气。"]}
{"word":"nonvehemently","summary":{"en":"“Nonvehemently” means doing or saying something calmly and not intensely.","zh":"“nonvehemently”表示以平静、不激烈的方式做事或表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a calm, not forceful or intense way; without strong anger, passion, or pressure.","zh":"以不激烈、较为平静的方式；不带强烈的愤怒、情绪或压迫感。"},"examples":[{"en":"She nonvehemently disagreed, explaining her reasons in a calm tone.","zh":"她不激烈地表示不同意，并用平静的语气解释原因。"},{"en":"The coach spoke nonvehemently, but the message was still clear.","zh":"教练说得并不激烈，但意思依然很清楚。"},{"en":"He answered nonvehemently, trying not to escalate the argument.","zh":"他不激烈地回答，尽量不让争论升级。"}]}],"synonyms":["calmly","mildly","gently","quietly","temperately"],"phonetic":"/ˌnɑnˈviəməntli/","extraExplanation":["这个词比较少见，多用于较正式的写作。它由 non-（不、非）+ vehemently（激烈地）构成，强调“语气/态度不强硬、不情绪化”。日常表达中更常用 calmly / mildly / gently / without strong emotion 等。"]}
{"word":"nonvenal","summary":{"en":"Nonvenal means honest and not corrupt, especially not accepting bribes.","zh":"nonvenal 指清廉正直、不可收买的（尤指不受贿、不腐败）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not willing to accept bribes; not corrupt or dishonest, especially in public or official duties.","zh":"不受贿的；不贪赃枉法的；（尤指公职或职责上）不腐败的。"},"examples":[{"en":"The judge was known as a nonvenal public servant.","zh":"这位法官以清廉、不受贿的公仆形象而闻名。"},{"en":"They demanded a nonvenal investigation into the scandal.","zh":"他们要求对这起丑闻进行一次公正清廉、不受利益影响的调查。"},{"en":"Her nonvenal reputation made people trust her decisions.","zh":"她清廉正直的名声让人们信任她的决定。"}]}],"synonyms":["incorruptible","honest","unbribable","upright","principled"],"phonetic":"/nɑnˈvinəl/","extraExplanation":["“non-”表示否定，“venal”来自拉丁语 *venalis*（意为“可买卖的”）。因此 *nonvenal* 字面含义就是“买不到的”，引申为“无法用钱收买的、清廉的”。","这个词较正式，常用于讨论政治、司法、媒体等领域的“廉洁/反腐”。日常口语里更常用 *honest*, *incorruptible*, *not corrupt*。"]}
{"word":"nonvenally","summary":{"en":"“Nonvenally” means “honestly and without corruption or bribery,” especially in official decisions.","zh":"“nonvenally”意为“清廉地、不受贿地（尤其指公职或决策中）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not corrupt or not willing to accept bribes; with honesty, especially in public or official decisions","zh":"以不贪腐、不受贿的方式；（尤指公职或决策中）清廉、公正地"},"examples":[{"en":"The judge acted nonvenally and refused every gift offered to influence the case.","zh":"法官清廉公正，拒绝了所有试图影响案件的礼物。"},{"en":"To keep the process fair, officials must behave nonvenally when awarding contracts.","zh":"为了保证程序公平，官员在授予合同时必须保持清廉不受贿。"}]}],"synonyms":["incorruptibly","honestly","uprightly","without bribery"],"phonetic":"/nɑnˈvinəli/","extraExplanation":["“nonvenally”较少见，更常用的表达是“honestly / without corruption / without taking bribes（诚实地/不贪腐地/不受贿地）”。","词源提示：venal来自拉丁语 venalis，意为“可以被买到的”，因此 venal 常指“可被收买的、贪赃枉法的”；加上 non- 就变成“不可被收买的、清廉的”。"]}
{"word":"nonvendibility","summary":{"en":"Nonvendibility means the condition of being not sellable.","zh":"nonvendibility 指“不可销售/不可出售的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being able to be sold (because of law, ethics, lack of demand, or practical reasons)","zh":"不可出售性；不可销售的状态（可能因法律、伦理、市场需求不足或实际原因导致）"},"examples":[{"en":"The company wrote off the inventory due to its nonvendibility.","zh":"公司因这些库存不可销售而进行了核销。"},{"en":"Because the item was recalled, its nonvendibility was clear.","zh":"由于产品被召回，它显然已经不可出售。"}]}],"synonyms":["unsaleability","unsellability","unmarketability","nontransferability"],"phonetic":"/ˌnɑnˌvɛn.dəˈbɪləti/","extraExplanation":["“nonvendibility”由前缀 non-（不、非）+ vendibility（可售性）构成，属于较少见的正式用词。实际写作中更常用的表达是 “unsaleability/unsellability”（不可销售性）或 “cannot be sold / not for sale”（不能出售/不对外出售）。","在法律、保险、会计或质量管理语境中更可能出现：例如某物因违禁、侵权、召回、过期、无法证明来源等原因而“不可出售”。"]}
{"word":"nonvendible","summary":{"en":"“Nonvendible” means not able to be sold; not for sale.","zh":"nonvendible 指“不可出售的、非卖品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be sold; unsellable (often because it is damaged, illegal to sell, or marked “not for sale”).","zh":"不可出售的；卖不出去的（常因损坏、法律限制或标注“非卖品”等原因）。"},"examples":[{"en":"The store returned the nonvendible items to the supplier.","zh":"商店把不可出售的商品退回给供应商。"},{"en":"Copies with misprinted covers were labeled nonvendible.","zh":"封面印错的书被标为“不可出售”。"},{"en":"Once the seal is broken, the product may be considered nonvendible.","zh":"一旦封条被拆开，这个产品可能会被视为不可出售。"}]}],"synonyms":["unsellable","not for sale","unmarketable","non-saleable"],"phonetic":"/nɑnˈvɛn.dɪ.bəl/","extraExplanation":["该词由 non-（否定前缀）+ vendible（可出售的）构成；vendible 源自拉丁语 vendere “出售”。","在零售、仓储、出版发行等领域较常见，用来区分“可销售库存”与“不可销售/需报废或退回”的货品。日常口语更常用 unsellable / not for sale。"]}
{"word":"nonvendibleness","summary":{"en":"Nonvendibleness means the state or quality of not being sellable or not permitted/suitable for sale.","zh":"nonvendibleness 指“不可售性”，即不能（或不适合/不被允许）出售的状态或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being nonvendible; the state of not being able to be sold or not being suitable/allowed for sale","zh":"不可售性；不能（或不适合/不被允许）出售的状态"},"examples":[{"en":"The artifact’s nonvendibleness comes from cultural heritage laws that prohibit private sale.","zh":"这件文物的不可售性来自文化遗产法律，法律禁止私人买卖。"},{"en":"Because of serious defects, the product was withdrawn, and its nonvendibleness hurt the company’s profits.","zh":"由于严重缺陷，该产品被下架，其不可售性影响了公司的利润。"}]}],"synonyms":["unsellability","unmarketability","lack of marketability","not for sale (phrase)"],"phonetic":"ˌnɑnˈvɛn.də.bəl.nəs","extraExplanation":["“nonvendibleness”由 non-（否定前缀）+ vendible（可出售的）+ -ness（名词后缀）构成，意思非常直白：把“不可出售”变成一个抽象名词。","它在现代英语里相当罕见，更常见、更自然的表达是 “unsellability / lack of marketability / not for sale”。在法律、文物、禁售品或质量检验等语境中更可能出现。","vendible 源自拉丁语 vendere（出售），同源词包括 vendor（商贩）和 vending machine（自动售货机）。"]}
{"word":"nonvendibly","summary":{"en":"Nonvendibly means “in a way that cannot be sold.” It’s a rare, formal adverb, often used in legal or inventory contexts.","zh":"nonvendibly 指“以无法出售的方式；不可售地”。它是较少见、偏正式的副词，常用于法律或库存管理语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that cannot be sold (not marketable or not legally allowed to be sold).","zh":"以无法出售的方式；不可售地（不具市场性或依法不得出售）。"},"examples":[{"en":"The damaged items were classified nonvendibly and removed from the sales floor.","zh":"这些损坏的商品被归类为不可售地处理，并从卖场撤下。"},{"en":"Some samples are distributed for free because they are labeled nonvendibly.","zh":"有些样品因标注为不可售地（不得销售）而免费发放。"}]}],"synonyms":["unsellably","unmarketably","not for sale"],"phonetic":"/ˌnɑnˈvɛndəbli/","extraExplanation":["“nonvendibly”非常少见，多见于法规、库存/零售管理或正式书面语中。更常见的形式是形容词“nonvendible”（不可销售的）。","构词：non-（不、非）+ vendible（可出售的）+ -ly（副词后缀）。其中 vendible 源自拉丁语 vendere（出售）。"]}
{"word":"nonvenereal","summary":{"en":"“Nonvenereal” means not sexually transmitted and not related to venereal disease.","zh":"“nonvenereal”表示“非性传播的；与性病无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to venereal (sexually transmitted) disease; not spread through sexual contact.","zh":"非性病的；与性传播疾病无关的；不是通过性接触传播的。"},"examples":[{"en":"The doctor explained that the infection was nonvenereal and could be treated easily.","zh":"医生解释说这种感染不是性传播的，而且很容易治疗。"},{"en":"Some skin conditions are mistaken for STIs, but many are nonvenereal.","zh":"有些皮肤问题会被误认为性病，但其中很多并非性传播。"}]}],"synonyms":["not sexually transmitted","non-STI","non-STD"],"phonetic":"/ˌnɑn.vəˈnɪr.i.əl/","extraExplanation":["“Venereal”来自拉丁语 Venus（维纳斯，爱与美之神），历史上用来指与性行为相关的疾病；现代更常用的说法是 STI（sexually transmitted infection）或 STD。","这个词多用于医学或较正式的语境。日常交流中通常会说 “not sexually transmitted / not an STI”。使用时注意尊重与隐私，避免带有污名化的表达。"]}
{"word":"nonvenomous","summary":{"en":"Nonvenomous means an animal does not have venom and cannot inject poison by biting or stinging.","zh":"nonvenomous 指动物“无毒/不带毒液”，不会通过咬或蜇把毒注入体内。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not producing or carrying venom; not poisonous through a bite or sting.","zh":"无毒的；（咬或蜇）不带毒液的。"},"examples":[{"en":"Most snakes are nonvenomous and do not harm people.","zh":"大多数蛇是无毒的，不会伤害人。"},{"en":"The guide explained that the lizard was nonvenomous, so it was safe to observe from a distance.","zh":"向导解释说这只蜥蜴无毒，因此从远处观察是安全的。"}]}],"synonyms":["harmless (in this context)","not venomous","nonpoisonous (often used loosely)"],"phonetic":"/nɑnˈvɛnəməs/","extraExplanation":["前缀 non- 表示“否定/不”，venomous 意为“有毒的（带毒液的）”。所以 nonvenomous 直译就是“非有毒的”。","英语里 venomous 通常指“有毒液、能通过咬/蜇把毒注入体内”的动物（如某些蛇、蜘蛛）；poisonous 更常指“吃下去或接触会中毒”的东西（如某些蘑菇、青蛙皮肤分泌物）。因此 nonvenomous 多用于动物。"]}
{"word":"nonvenomously","summary":{"en":"“Nonvenomously” means “in a non-venomous, harmless way; without injecting venom.”","zh":"“nonvenomously”表示“无毒地、无害地；不注入毒液地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not venomous (not producing or injecting poison); harmlessly.","zh":"以不带毒的方式；无毒地；（对人或动物）无害地。"},"examples":[{"en":"The snake looked scary, but it bit nonvenomously and caused only a small wound.","zh":"那条蛇看起来很吓人，但它咬人时并不带毒，只造成了一个小伤口。"},{"en":"Some insects mimic dangerous species while living nonvenomously.","zh":"有些昆虫会模仿危险物种的外表，但自身其实无毒、对人无害。"}]}],"synonyms":["harmlessly","innocuously","without venom"],"phonetic":"/nɑnˈvɛnəməsli/","extraExplanation":["“nonvenomously”是由 non-（不、非）+ venomous（有毒的）+ -ly（……地）构成的副词。日常英语里较少见，更常用的表达是 “harmlessly”（无害地）或 “without venom/without injecting venom”（没有毒/不注入毒液地）。","注意区分 venom（动物通过咬、刺等注入的毒液）与 poison（通常指吞食或接触导致的毒）。因此常见搭配是 venomous snake（毒蛇）、poisonous mushroom（毒蘑菇）。"]}
{"word":"nonvenomousness","summary":{"en":"Nonvenomousness means the state of not being venomous—having no venom or not able to inject venom.","zh":"Nonvenomousness 指“无毒性”，即没有毒液或不能注入毒液的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being venomous (not producing or injecting venom); harmlessness in terms of venom","zh":"“无毒性”的性质或状态（不产生或不注入毒液）；就毒液而言的无害性"},"examples":[{"en":"The snake’s nonvenomousness makes it safe to observe from a respectful distance.","zh":"这条蛇的无毒性使得人们可以在保持适当距离的情况下安全观察它。"},{"en":"Scientists confirmed the spider’s nonvenomousness through careful testing.","zh":"科学家通过谨慎的测试确认了这只蜘蛛无毒。"}]}],"synonyms":["harmlessness","innocuousness"],"phonetic":"/ˌnɑnˈvɛnəməsnəs/","extraExplanation":["这是一个由 non-（否定前缀，“不”）+ venomous（有毒的）+ -ness（名词后缀，“……性/状态”）构成的抽象名词，意思就是“无毒性”。","在自然科普或动物学语境中更常见；日常口语里人们更常说 nonvenomous（无毒的）或 harmless（无害的），而不是使用 nonvenomousness。"]}
{"word":"nonvenous","summary":{"en":"“Nonvenous” means not related to veins or venous blood (a rare medical adjective).","zh":"“Nonvenous” 指“非静脉的；与静脉或静脉血无关的”（较少见的医学形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not venous; not relating to veins or venous blood.","zh":"非静脉的；与静脉或静脉血无关的。"},"examples":[{"en":"The doctor noted that the swelling appeared nonvenous in origin.","zh":"医生指出这种肿胀的原因看起来并非来自静脉。"},{"en":"They ruled out a nonvenous cause before ordering tests for vein problems.","zh":"在安排静脉相关检查之前，他们先排除了非静脉性的原因。"}]}],"synonyms":["not venous","non-venous"],"phonetic":"/nɑnˈviːnəs/","extraExplanation":["这是一个医学/生理学里偏少见的词，常用于对比 venous（静脉的）与 arterial（动脉的）。例如在讨论肿胀、出血或血流来源时，医生可能用 nonvenous 来表示“不是静脉来源”。","构词：non-（不、非）+ venous（静脉的）。在实际写作中，也常用 not venous / non-venous（加连字符）来表达同样意思。"]}
{"word":"nonvenously","summary":{"en":"“Nonvenously” is not standard; you probably mean “nonvenomously,” meaning “in a non-venomous way,” especially of a bite.","zh":"“nonvenously” 不是标准拼写；你很可能想写 “nonvenomously”，表示“以无毒的方式（尤指咬伤不注入毒液）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Likely a misspelling of “nonvenomously”: in a way that is not venomous (not injecting poison), especially about a snake or other animal’s bite.","zh":"很可能是 “nonvenomously” 的拼写错误：以“无毒/不注入毒液”的方式（常用于描述蛇等动物的咬伤）。"},"examples":[{"en":"The snake bit him nonvenomously, leaving only small puncture marks.","zh":"那条蛇无毒地咬了他，只留下了小小的牙印。"},{"en":"The guide explained that this species usually bites nonvenomously and then escapes.","zh":"向导解释说，这个物种通常是无毒咬一下就迅速逃走。"}]},{"partOfSpeech":"adv.","definition":{"en":"If you meant “non-venously,” it could mean “not through a vein,” but this is rare and usually written more clearly as “not intravenously.”","zh":"如果你想表达 “non-venously（不经静脉）”，这种写法很少见，通常更清楚的说法是 “not intravenously（不通过静脉注射/给药）”。"},"examples":[{"en":"The medicine was given not intravenously but by mouth.","zh":"这种药不是静脉给药，而是口服。"}]}],"synonyms":["nonpoisonously","without venom","harmlessly (context-dependent)"],"phonetic":"/nɑnˈvɛnəməsli/","extraExplanation":["“nonvenously” 不是常见标准拼写。最常见的目标词是 “nonvenomously”，来自 venom（毒液）+ -ous（……的）+ -ly（副词）。","容易混淆的词还有 “venous”（与静脉有关）和 “venomous”（有毒的）。谈到蛇是否有毒，一般用 venomous / nonvenomous；谈到血管或注射方式，用 venous / intravenous。"]}
{"word":"nonvenousness","summary":{"en":"Nonvenousness means the quality of not being venous (not related to veins).","zh":"nonvenousness 指“非静脉性”，即不与静脉相关或不呈静脉特征的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being venous; absence of characteristics related to veins (especially blood vessels)","zh":"非静脉性；不具静脉特征的状态（尤指与血管静脉相关的特征缺失）"},"examples":[{"en":"The report noted the lesion’s nonvenousness, suggesting it was not connected to a vein.","zh":"报告指出该病灶具有非静脉性，提示它并不与静脉相连。"},{"en":"Imaging helped confirm the mass’s nonvenousness and guided the treatment plan.","zh":"影像检查帮助确认该肿块的非静脉性，并据此制定治疗方案。"}]}],"synonyms":["non-venous character","lack of venous involvement","absence of venous features"],"phonetic":"/nɑnˈviːnəsnəs/","extraExplanation":["“nonvenousness”非常少见，更多时候人们会用更自然的表达来替代，例如：not venous / non-venous features / no venous involvement（无静脉受累）。","构词法：non-（不、非）+ venous（静脉的）+ -ness（名词后缀，表示“性质/状态”）。在医学写作里，这类“形容词 + -ness”名词有时用于强调某种性质，但在日常英语中不常用。","在专业语境中，它通常用于描述影像学、病理或解剖观察：某个结构/病变“不是静脉来源或不呈静脉特征”。"]}
{"word":"nonventilation","summary":{"en":"Nonventilation means a lack of air circulation or airflow, often used in technical or medical contexts.","zh":"nonventilation 指“缺乏通风/不通气”，多见于技术或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence or lack of ventilation (fresh air flow), especially in a room, building, or part of the body (medical use).","zh":"不通风；缺乏通风（尤其指房间/建筑内空气不流通；医学上也可指某部位缺乏通气）。"},"examples":[{"en":"Nonventilation in the basement led to damp smells and mold.","zh":"地下室不通风，导致潮味和发霉。"},{"en":"In some lung conditions, nonventilation of an area can reduce oxygen exchange.","zh":"在某些肺部疾病中，某一区域不通气会降低氧气交换。"}]}],"synonyms":["lack of ventilation","poor ventilation","no airflow","insufficient ventilation"],"phonetic":"/ˌnɑnˌvɛn.təˈleɪ.ʃən/","extraExplanation":["这个词更常见于技术/医学写作；日常英语里人们更常说“poor ventilation（通风差）”或“lack of ventilation（缺乏通风）”。","医学语境中常与“perfusion（灌注）”一起讨论（例如 V/Q mismatch：通气/灌注不匹配），但在一般健康建议中通常直接说“make sure the room is well ventilated（确保房间通风良好）”。"]}
{"word":"nonventilative","summary":{"en":"“Nonventilative” means not ventilating or not allowing air circulation.","zh":"nonventilative 意为“不通风的/不提供通气换气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not providing ventilation; not allowing fresh air to circulate (e.g., a room, mask, or system that does not let air flow well).","zh":"不通风的；不提供通气/换气的（指房间、口罩或系统等空气不易流通）。"},"examples":[{"en":"The storage room is nonventilative, so it can feel hot and stuffy in summer.","zh":"这个储藏室不通风，所以夏天会又热又闷。"},{"en":"Choose a more ventilative design if you’ll wear the helmet for long periods.","zh":"如果你要长时间戴头盔，最好选择更透气/更通风的设计。"}]}],"synonyms":["unventilated","poorly ventilated","stuffy","airless"],"phonetic":"/ˌnɑnˈvɛn.təˌleɪ.tɪv/","extraExplanation":["“non-”表示“非、无”，加在形容词前构成反义；“ventilative”来自“ventilate（使通风/换气）”。因此 nonventilative 字面意思就是“不能通风的”。","这个词在日常英语中比较少见，更常用的说法是 non-ventilated / poorly ventilated（没有通风/通风很差）或 unventilated（未通风的）。"]}
{"word":"nonveracious","summary":{"en":"Nonveracious means “not truthful; untrue,” and is a formal word often used in writing.","zh":"nonveracious 意为“非真实的；不诚实的”，属较正式的书面用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not truthful; not based on facts; untrue.","zh":"不真实的；不诚实的；不符合事实的。"},"examples":[{"en":"The report was nonveracious and contained several made-up details.","zh":"这份报告不真实，包含了好几处编造的细节。"},{"en":"He gave a nonveracious explanation to avoid trouble.","zh":"他为了避免麻烦给出了一个不诚实的解释。"}]}],"synonyms":["untrue","false","not truthful","dishonest","misleading"],"phonetic":"/ˌnɑn.vɚˈeɪ.ʃəs/","extraExplanation":["“nonveracious”比较正式、书面，日常口语里更常用 untrue / false / not truthful / dishonest。","词源上来自拉丁语 verax（“真实的”），加上否定前缀 non-，意思就是“非真实的”。","语气上它常用于描述“陈述/说法/报道”等内容不真实，比直接骂人“liar”更委婉、也更客观一些。"]}
{"word":"nonveraciously","summary":{"en":"“Nonveraciously” means “not truthfully; falsely,” and is a rare, formal adverb.","zh":"“nonveraciously”意为“非真实地；虚假地”，是较少见、偏正式的副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not truthful; falsely or inaccurately.","zh":"以不真实的方式；虚假地、不准确地。"},"examples":[{"en":"The report described the event nonveraciously, leaving out key facts.","zh":"这份报告对事件的描述不真实，遗漏了关键事实。"},{"en":"He answered nonveraciously to avoid getting into trouble.","zh":"他为了避免惹麻烦而不诚实地回答。"}]}],"synonyms":["untruthfully","falsely","inaccurately","dishonestly","misleadingly"],"phonetic":"/ˌnɑn vəˈreɪ ʃəs li/","extraExplanation":["“nonveraciously”来自形容词“veracious”（诚实的、真实的）+ 否定前缀“non-”+ 副词后缀“-ly”。在现代英语中，它比较少见、更偏正式或书面语。日常表达更常用“untruthfully / falsely / inaccurately”。"]}
{"word":"nonveraciousness","summary":{"en":"Nonveraciousness means the quality of being untruthful or not accurate.","zh":"nonveraciousness 指“不真实/不诚实的性质”，即缺乏真实性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being truthful; untruthfulness (often used in formal or academic writing)","zh":"不真实；不诚实；缺乏真实性（常见于较正式/学术语境）"},"examples":[{"en":"The report was criticized for its nonveraciousness and misleading statistics.","zh":"这份报告因其不真实和误导性的统计数据而受到批评。"},{"en":"She apologized for the nonveraciousness of her earlier statement.","zh":"她为自己先前陈述的不实之处道歉。"}]}],"synonyms":["untruthfulness","dishonesty","lack of truth","inaccuracy","mendacity"],"phonetic":"/ˌnɑn.vəˈreɪ.ʃəs.nəs/","extraExplanation":["这个词比较少见、偏正式，常用来强调“陈述/信息缺乏真实性”。日常英语里更常说 untruthfulness、dishonesty、lack of truth。","构词法：non-（否定）+ veracious（真实的、诚实的）+ -ness（名词后缀）。veracious 来自拉丁语 verax（真实的），与 verity（真实）、verify（核实）同源。"]}
{"word":"nonveracity","summary":{"en":"Nonveracity means a lack of truth or truthfulness; it can also mean a false statement (formal).","zh":"nonveracity 指“不真实/缺乏真实性”，也可指“虚假陈述”（较正式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being true; untruthfulness","zh":"不真实；缺乏真实性；虚假"},"examples":[{"en":"The report was criticized for its nonveracity and lack of evidence.","zh":"这份报告因不真实且缺乏证据而受到批评。"},{"en":"He admitted the statement’s nonveracity after checking the facts.","zh":"核实事实后，他承认那句话并不属实。"}]},{"partOfSpeech":"n.","definition":{"en":"a false statement or claim; something that is not true (less common)","zh":"虚假陈述；不实之词（较少见）"},"examples":[{"en":"The article contained several nonveracities that misled readers.","zh":"那篇文章包含了几处不实之词，误导了读者。"}]}],"synonyms":["untruth","falsehood","inaccuracy","falsity","lack of veracity"],"phonetic":"/ˌnɑn.vəˈræs.ə.ti/","extraExplanation":["“nonveracity”属于比较正式、偏书面/法律/学术风格的词，日常英语里更常用“untruth”或“falsehood”，形容人或行为时常用“dishonesty/lying”。","构词上：non-（不、非）+ veracity（真实性）。因此它强调“真实性的缺失”，不一定直接指“故意撒谎”，也可能只是信息不准确。"]}
{"word":"nonverbal","summary":{"en":"Nonverbal means ‘without words,’ especially communication through body language; it can also mean ‘not speaking.’","zh":"nonverbal 指“非言语的（不用语言表达的）”，尤指通过肢体语言沟通；也可指“（当时）不说话的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not using words; communicated through actions, facial expressions, gestures, or body language.","zh":"非言语的；不用语言文字表达的；通过动作、表情、手势或肢体语言传达的。"},"examples":[{"en":"Her nonverbal cues—like a smile and a nod—showed she agreed.","zh":"她的非言语线索——比如微笑和点头——表明她同意。"},{"en":"Nonverbal communication is important in job interviews.","zh":"在求职面试中，非言语沟通很重要。"},{"en":"The teacher used nonverbal signals to ask the class to be quiet.","zh":"老师用非言语信号示意全班安静。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not speaking (even if able to); not expressed in spoken words.","zh":"不说话的；（即使能说话也）不发声的；不用口头语言表达的。"},"examples":[{"en":"He stayed nonverbal during the meeting, but his face showed concern.","zh":"他在会议上一直不说话，但表情显示出担忧。"},{"en":"After the shock, she was nonverbal for a few minutes.","zh":"受到惊吓后，她有几分钟说不出话。"}]}],"synonyms":["wordless","unspoken","gestural","silent"],"phonetic":"/nɑnˈvɝbəl/","extraExplanation":["“Nonverbal”最常见于“nonverbal communication（非言语沟通）”，指语气以外的肢体语言（眼神、姿势、距离感等）。","在医疗或教育语境里，“nonverbal”有时指“不会/不进行口语表达的人”（例如某些自闭症人士），用词时应尊重个体差异；也可用更具体的说法如“minimally verbal（很少口语）”。"]}
{"word":"nonverbalized","summary":{"en":"“Nonverbalized” means not put into words—left unspoken or unstated.","zh":"“nonverbalized”指没有用语言表达出来的——未说出口或未明确陈述的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not expressed in spoken or written words; left unspoken or unarticulated.","zh":"没有用口头或书面语言表达的；未说出口的；未明确表述的。"},"examples":[{"en":"There was a nonverbalized tension in the room after the argument.","zh":"争吵之后，房间里有一种未说出口的紧张气氛。"},{"en":"Her nonverbalized feelings showed in her face, even though she said she was fine.","zh":"尽管她说自己没事，但她未明说的情绪从表情里显露出来。"},{"en":"The report included several nonverbalized assumptions that needed to be stated clearly.","zh":"这份报告里包含了一些未明确表述的假设，需要清楚地说出来。"}]}],"synonyms":["unspoken","unstated","unexpressed","not put into words","implicit"],"phonetic":"/ˌnɑnˈvɝbəˌlaɪzd/","extraExplanation":["“nonverbalized”常见于较正式的写作或心理/沟通语境，强调“本可以用语言说出来但没有说”。日常口语中更常用“unspoken / unstated / not put into words”。","词形上它像过去分词作形容词：verbalize（用语言表达）→ verbalized（已表达）→ nonverbalized（未表达）。注意它不同于“nonverbal”（非语言的，如手势、表情）。"]}
{"word":"nonverbally","summary":{"en":"Nonverbally means communicating without spoken words, using body language or other nonverbal signals.","zh":"nonverbally 表示“非语言地”，指不用说话、通过肢体语言或其他非语言信号来沟通。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Without using spoken words; by using body language such as facial expressions, gestures, or posture.","zh":"不用说话地；通过面部表情、手势、姿态等肢体语言来表达。"},"examples":[{"en":"She nodded nonverbally to show she agreed.","zh":"她用点头这种非语言方式表示同意。"},{"en":"The teacher gave a nonverbally clear signal to be quiet.","zh":"老师用一个很清楚的非语言信号示意大家安静。"},{"en":"Some people communicate their feelings nonverbally, even when they say nothing.","zh":"有些人即使不说话，也会用非语言方式传达情绪。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that involves little or no spoken language (for example, in communication styles, tests, or behaviors).","zh":"以很少或不使用口头语言的方式（例如在交流风格、测试或行为中）。"},"examples":[{"en":"The child learns best nonverbally through pictures and demonstrations.","zh":"这个孩子通过图片和示范等非语言方式学得最好。"},{"en":"The interview included tasks that could be completed nonverbally.","zh":"面试包含了一些可以用非语言方式完成的任务。"}]}],"synonyms":["silently","wordlessly","without speaking"],"phonetic":"/nɑnˈvɝbəli/","extraExplanation":["“nonverbal”指“非语言的”，通常涵盖表情、眼神、手势、语气语调（不算具体词语内容）、人与人之间的距离等；而“nonverbally”就是“以非语言方式”。在跨文化交流中，同一个手势或眼神可能含义不同，使用时要留意场合与文化背景。"]}
{"word":"nonverbosity","summary":{"en":"“Nonverbosity” means being not verbose—brief, clear, and to the point.","zh":"“nonverbosity”指“不冗长、不啰嗦”，表达简洁明了、直截了当。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being verbose; being brief and not using more words than necessary","zh":"不啰嗦；简洁（不使用不必要的多余文字）"},"examples":[{"en":"The report’s nonverbosity made it easy to read quickly.","zh":"这份报告很不啰嗦，让人能很快读完。"},{"en":"In emergency instructions, nonverbosity can save time and reduce confusion.","zh":"在紧急指令中，简洁不啰嗦能节省时间、减少混乱。"}]}],"synonyms":["brevity","concision","conciseness","succinctness"],"phonetic":"/ˌnɑn.vɝˈbɑs.ə.ti/","extraExplanation":["“nonverbosity”不是很常见的标准词，更常见的表达是“brevity / concision / being concise”。它通常作为“verbosity（冗长、啰嗦）”的否定式来临时造词，用于强调“刻意简短”。"]}
{"word":"nonverdict","summary":{"en":"A nonverdict means no final decision is reached, especially in a court case.","zh":"nonverdict 指（尤其在法庭案件中）未作出最终裁决的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation where no verdict (final decision) is reached, especially in a court case (for example, a jury cannot agree or the trial ends without a decision).","zh":"（尤其指法律案件中）未能作出裁决的情况；没有最终判决（例如陪审团无法达成一致，或审判在没有结论的情况下结束）。"},"examples":[{"en":"The trial ended in a nonverdict after the jury could not agree.","zh":"由于陪审团无法达成一致，这场审判以无裁决告终。"},{"en":"Families were frustrated by the nonverdict and wanted the case retried.","zh":"家属对没有裁决感到沮丧，希望案件重新审理。"}]}],"synonyms":["no verdict","hung jury","mistrial","deadlock"],"phonetic":"/nɑnˈvɝdɪkt/","extraExplanation":["“nonverdict”不是最常见的标准用词，更常见的表达包括：\n- hung jury（陪审团意见不一）\n- mistrial（审判无效/流审）\n- no verdict（没有裁决）\n在新闻或评论中，“nonverdict”有时用来强调“结果悬而未决、没有给出是非结论”的感觉。"]}
{"word":"nonverifiable","summary":{"en":"Nonverifiable describes information that cannot be confirmed as true using evidence or reliable sources.","zh":"nonverifiable 指无法用证据或可靠来源加以确认真伪的信息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be checked or proven true by evidence, facts, or reliable sources.","zh":"无法通过证据、事实或可靠来源核实（验证）真伪的。"},"examples":[{"en":"The report included several nonverifiable claims from anonymous accounts.","zh":"这份报告包含了一些来自匿名说法、无法核实的断言。"},{"en":"Without documents or witnesses, the story remains nonverifiable.","zh":"没有文件或证人，这个说法仍然无法核实。"}]}],"synonyms":["unverifiable","unconfirmed","unsupported","unsubstantiated"],"phonetic":"/ˌnɑnˈvɛrɪfaɪəbəl/","extraExplanation":["“nonverifiable”常见于新闻写作、学术研究和事实核查语境，表示信息缺乏可追溯来源（如原始数据、记录、独立证词），因此不能被可靠地确认。","与“untrue（不真实）”不同：nonverifiable 只强调“无法验证”，并不直接断定内容一定是假的。"]}
{"word":"nonverification","summary":{"en":"Nonverification means not verifying something, or the state of being unverified.","zh":"nonverification 指未进行核实/验证，或处于未验证状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or state of not verifying something; a lack of confirmation or proof that information is true","zh":"不核实；未验证；缺乏对信息真实性的确认或证明"},"examples":[{"en":"Because of nonverification of the customer’s identity, the bank paused the transaction.","zh":"由于未核实客户身份，银行暂停了这笔交易。"},{"en":"The report included a warning that some numbers were based on nonverification of the original data.","zh":"报告提醒说，一些数字是因为未验证原始数据而得出的。"},{"en":"Nonverification can lead to mistakes, especially when rumors spread quickly online.","zh":"不核实可能导致错误，尤其是在网络谣言迅速传播时。"}]}],"synonyms":["lack of verification","failure to verify","no confirmation","unverified status"],"phonetic":"ˌnɑnˌvɛrəfəˈkeɪʃən","extraExplanation":["“Nonverification”不是日常英语里最常用的词，更常见的表达有：lack of verification（缺乏验证）、failure to verify（未能核实）、unverified status（未验证状态）。","它常出现在法律、审计、合规、科研或数据管理语境中，用来强调“没有完成核实流程”所带来的风险或责任问题。"]}
{"word":"nonveritable","summary":{"en":"“Nonveritable” means not true or not genuine, often used in formal writing.","zh":"“nonveritable”指“不真实/非真正的”，多见于较正式的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not true or genuine; not real or authentic.","zh":"不真实的；非真正的；不可靠的。"},"examples":[{"en":"The article contained several nonveritable claims that couldn’t be supported by evidence.","zh":"这篇文章里有几条不真实的说法，无法用证据支持。"},{"en":"He told a nonveritable story to impress his friends.","zh":"他讲了一个不靠谱的故事来给朋友留下印象。"}]}],"synonyms":["false","untrue","spurious","bogus","inauthentic"],"phonetic":"/ˌnɑnˈvɛrɪtəbəl/","extraExplanation":["“nonveritable”非常少见，多用于较正式或文学性的语境。日常英语更常说：not true / not real / not genuine，或用同义词 false、untrue、spurious。","注意区分：nonveritable（不真实/不可靠）和 unverifiable（无法核实的）。前者强调“本身不真”，后者强调“目前无法证实”。"]}
{"word":"nonveritableness","summary":{"en":"Nonveritableness means the quality of being not true or not fact-based.","zh":"nonveritableness 指“缺乏真实性/不基于事实”的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being true, accurate, or based on facts; untruthfulness","zh":"不真实；不准确；缺乏事实依据（不真实性）"},"examples":[{"en":"The report was criticized for its nonveritableness and lack of reliable sources.","zh":"这份报告因不真实以及缺乏可靠来源而受到批评。"},{"en":"She questioned the nonveritableness of the rumor and asked for evidence.","zh":"她怀疑这个谣言不真实，并要求提供证据。"}]}],"synonyms":["untruthfulness","falsity","inaccuracy","incorrectness","lack of credibility"],"phonetic":"/ˌnɑnˈvɛrɪtəbəlnəs/","extraExplanation":["这个词非常少见，写作中更常用更自然的表达是：untruthfulness（不真实/不诚实）、falsity（虚假）、inaccuracy（不准确）、lack of credibility（缺乏可信度）。","构词法：non-（否定）+ veritable（真实的/确凿的）+ -ness（名词后缀），字面意思就是“非真实的性质”。在正式写作里，这种长词有时会显得生硬。"]}
{"word":"nonveritably","summary":{"en":"“Nonveritably” means “not truly; not genuinely,” but it is a rare, formal word.","zh":"“nonveritably”意为“并非真实地、并非名副其实地”，但属于罕见且偏正式的用词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not truly or genuinely so; not veritably.","zh":"以并非真实、并非名副其实的方式；不真正地。"},"examples":[{"en":"He was nonveritably calm, smiling while clearly anxious inside.","zh":"他看起来非真地镇定，面带微笑但内心明显焦虑。"},{"en":"The report described the event as “peaceful,” but only nonveritably so.","zh":"报告把事件描述为“和平的”，但那只是名不副实。"}]}],"synonyms":["not truly","not really","not genuinely","falsely","inauthentically"],"phonetic":"/ˌnɑnˈvɛrɪtəbli/","extraExplanation":["这个词非常少见，多用于较正式或文学化的语境。结构上是 non-（否定前缀）+ veritably（真实地、确实地）。实际写作中，人们更常用 not really / not truly / not genuinely 来表达同样意思。"]}
{"word":"nonverminous","summary":{"en":"Nonverminous means “free from vermin; not infested with pests.”","zh":"nonverminous 意为“无害虫的；未受虫害侵扰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not verminous; free from vermin (harmful pests such as rats, lice, or other parasites).","zh":"非虫害的；无害虫（如老鼠、虱子等寄生虫或有害害虫）的。"},"examples":[{"en":"The shelter worked hard to keep the bedding clean and nonverminous.","zh":"收容所努力保持寝具清洁，确保没有害虫。"},{"en":"Inspectors certified the kitchen as nonverminous after the pest-control treatment.","zh":"进行灭虫处理后，检查人员认证这间厨房无虫害。"}]}],"synonyms":["pest-free","vermin-free","uninfested","clean (from pests)"],"phonetic":"/nɑnˈvɝmənəs/","extraExplanation":["这是一个较少见、偏正式的词，常见于卫生检查、公共健康、动物照护或历史文本中。","构词：non-（不、非）+ vermin（害虫、害兽）+ -ous（……的）。因此字面意思就是“没有害虫的”。","与日常更常用的说法相比：更口语的表达通常是 “pest-free”（无虫害的）或 “free of vermin”（无害虫的）。"]}
{"word":"nonverminously","summary":{"en":"“Nonverminously” means “in a vermin-free way,” but it is extremely rare in real English.","zh":"“nonverminously”意为“以无虫害的方式”，但在英语中极其罕见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not infested with vermin (rats, insects, etc.); in a vermin-free manner.","zh":"以没有害虫（如老鼠、昆虫等）侵扰的方式；以无虫害的方式。"},"examples":[{"en":"The shelter was cleaned and maintained nonverminously, with sealed food bins and regular inspections.","zh":"收容所通过密封食物箱并定期检查来保持无虫害的清洁状态。"},{"en":"Store grain nonverminously by keeping it dry and using tight-fitting containers.","zh":"要无虫害地储存谷物，应保持干燥并使用密封性好的容器。"}]}],"synonyms":["vermin-free","without pests","not infested","pest-free"],"phonetic":"/ˌnɑnˈvɝmənəsli/","extraExplanation":["“nonverminously”非常罕见，很多词典不收录，通常更自然的表达是 “without vermin / vermin-free / not infested (with pests)”。","它看起来是由形容词 “nonverminous（无虫害的）” 加副词后缀 “-ly” 构成的临时造词（nonce word），在正式写作中建议改用更常见的说法以避免读者困惑。"]}
{"word":"nonverminousness","summary":{"en":"Nonverminousness means being free from vermin or harmful pests.","zh":"nonverminousness 指“没有害虫/害兽侵扰的状态”，即无虫害、无鼠害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being nonverminous; being free from vermin (harmful pests such as rats, lice, or fleas)","zh":"无害虫（无鼠、虱、蚤等害物）之状态；不受害虫侵扰的性质"},"examples":[{"en":"The inspector praised the kitchen’s nonverminousness after the thorough cleaning.","zh":"经过彻底清洁后，检查员称赞厨房没有害虫。"},{"en":"Good storage and regular checks help maintain nonverminousness in a pantry.","zh":"良好的储存方式与定期检查有助于让食品储藏间保持无害虫状态。"}]}],"synonyms":["pest-free condition","freedom from vermin","absence of pests","cleanliness (context-dependent)"],"phonetic":"/ˌnɑnˈvɝmɪnəsnəs/","extraExplanation":["这个词非常罕见，通常在正式或技术性语境里出现。更常见的表达是 “pest-free,” “free of vermin,” 或在卫生检查语境中说 “no sign of pests.”","词根提示：vermin 指“害虫/害兽”（如老鼠、蟑螂、虱子等，会传播疾病或破坏食物）；non- 是否定前缀；-ness 把形容词变成名词，表示“……的状态/性质”。"]}
{"word":"nonvernacular","summary":{"en":"Nonvernacular means not in everyday local speech; more formal, technical, or not the community’s usual language.","zh":"nonvernacular 指“非本地口语/非日常通用表达”，常带更正式、技术化或非该社群惯用语言的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not in the everyday language (vernacular) that most people in a place normally speak; not expressed in a local or native style of speech.","zh":"非本地口语的；非日常通用语言的；不带地方口语特色的。"},"examples":[{"en":"The notice was written in a nonvernacular style, so many residents found it hard to understand.","zh":"这则通知用的不是口语化的写法，所以很多居民觉得难懂。"},{"en":"In class, we compared vernacular speech with nonvernacular, formal writing.","zh":"课堂上我们比较了口语表达和非口语、正式的书面语。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Using a language that is not the local mother tongue, or not typical of the community’s everyday speech.","zh":"（语言学）使用并非当地母语/社区日常用语的；不符合该社群日常语言习惯的。"},"examples":[{"en":"Some official documents in history were nonvernacular, written in Latin rather than the local language.","zh":"历史上一些官方文件不是用当地语言写的，而是用拉丁语等非口语语言写成的。"},{"en":"The researcher noted that the interview felt nonvernacular when participants switched to technical terms.","zh":"研究者指出，当受访者改用技术术语时，访谈听起来就不太口语化了。"}]}],"synonyms":["noncolloquial","formal","bookish","standard","literary"],"phonetic":"/ˌnɑn vərˈnækjələr/","extraExplanation":["“Vernacular”通常指某地区人们日常使用的口语或本地语（如方言、日常表达），而“nonvernacular”强调“不是那种日常本地说法”，更偏正式、书面、官方或外来语言的感觉。","这个词在日常对话中不算常见，更常出现在语言学、教育、社会学或写作风格讨论里。"]}
{"word":"nonversatility","summary":{"en":"Nonversatility means a lack of versatility—being inflexible or not adaptable to different tasks or situations.","zh":"nonversatility 指“缺乏多样能力/多功能性”，强调不灵活、难以适应不同任务或情境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the lack of versatility; the quality of being unable or unwilling to adapt, change, or perform well in different roles or situations","zh":"缺乏多才多艺（或多功能性）；不灵活、难以适应变化（或不同角色/场景）的特质"},"examples":[{"en":"The team’s nonversatility became obvious when the project requirements changed.","zh":"当项目需求发生变化时，这个团队缺乏灵活性的弱点就很明显了。"},{"en":"A major drawback of the tool is its nonversatility—it works well for one task but not for others.","zh":"这个工具的主要缺点是缺乏多功能性——它只擅长一种任务，其他任务就不行。"}]}],"synonyms":["lack of versatility","inflexibility","rigidity","narrowness","limited adaptability"],"phonetic":"/ˌnɑnˌvɝsəˈtɪləti/","extraExplanation":["“nonversatility”由前缀 non-（表示“非、缺乏”）+ versatility（多才多艺/多功能性）构成，属于较少见、偏书面或技术写作中的用词。日常表达里更常说 “lack of versatility” 或 “not versatile”。"]}
{"word":"nonvertebral","summary":{"en":"Nonvertebral means “not related to the vertebrae (spine bones).”","zh":"nonvertebral 指“与椎骨（脊柱骨）无关的；不涉及椎骨的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving, relating to, or coming from the vertebrae (the bones of the spine).","zh":"非椎骨的；不涉及椎骨（脊柱骨骼）的。"},"examples":[{"en":"The doctor said the pain was nonvertebral, likely coming from a muscle strain rather than the spine.","zh":"医生说这种疼痛是非椎骨性的，可能来自肌肉拉伤而不是脊柱。"},{"en":"The scan showed a nonvertebral cause of back discomfort.","zh":"扫描显示背部不适的原因并非来自椎骨。"}]}],"synonyms":["nonspinal","extra-spinal","non-vertebral"],"phonetic":"/ˌnɑnˈvɝtɪbrəl/","extraExplanation":["这个词多见于医学/解剖学语境，用来区分“脊柱本身的问题（vertebral）”与“虽然在背部但来源不是椎骨的问题（nonvertebral）”，例如肌肉、韧带或内脏牵涉痛等。构词上是 non-（不、非）+ vertebral（椎骨的）。"]}
{"word":"nonvertebrate","summary":{"en":"A nonvertebrate is an animal without a backbone; it can also describe something lacking a spine.","zh":"nonvertebrate 指“无脊椎动物”，也可作形容词表示“无脊椎的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) An animal that does not have a backbone (spine).","zh":"（生物）无脊椎动物；没有脊柱（脊椎）的动物。"},"examples":[{"en":"Many insects are nonvertebrates, so they don’t have a backbone.","zh":"许多昆虫是无脊椎动物，所以它们没有脊柱。"},{"en":"Worms and jellyfish are nonvertebrates found in many habitats.","zh":"蠕虫和水母是生活在许多栖息地的无脊椎动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology) Not having a backbone; without a spine.","zh":"（生物）无脊椎的；没有脊柱的。"},"examples":[{"en":"A spider is a nonvertebrate animal.","zh":"蜘蛛是一种无脊椎动物。"},{"en":"Nonvertebrate species often have exoskeletons or soft bodies.","zh":"无脊椎动物常常有外骨骼或柔软的身体。"}]}],"synonyms":["invertebrate","spineless (adj., in biology sense)"],"phonetic":"/ˌnɑnˈvɝtəˌbreɪt/","extraExplanation":["“nonvertebrate”在日常英语里不太常见，更常用的对应词是“invertebrate（无脊椎动物）”。在课本、科普或正式写作中，你更可能看到“invertebrate”。","构词理解：non- 表示“非/不”，vertebrate 表示“脊椎动物”。所以 nonvertebrate 字面意思就是“非脊椎动物”。"]}
{"word":"nonvertical","summary":{"en":"Nonvertical means not vertical—tilted or slanted rather than straight up-and-down.","zh":"nonvertical 指“非垂直的”，即倾斜的、不是正上正下的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not vertical; not upright or not at a 90° angle to the horizon (not straight up-and-down).","zh":"非垂直的；不是竖直方向的；不与水平面成90°（不是正上正下的）。"},"examples":[{"en":"The picture frame is slightly nonvertical, so it looks crooked.","zh":"画框有点不垂直，所以看起来歪了。"},{"en":"In the diagram, the nonvertical line represents a slope.","zh":"在图中，那条非垂直的线表示一个斜坡。"},{"en":"For safety, keep the ladder nonvertical—lean it against the wall at a stable angle.","zh":"为了安全，不要把梯子立得完全竖直——把它以稳定的角度靠在墙上。"}]}],"synonyms":["non-vertical","tilted","slanted","inclined","not upright"],"phonetic":"/ˌnɑnˈvɝtɪkəl/","extraExplanation":["“nonvertical”也常写作“non-vertical”。在数学、物理、工程或排版等语境里更常见，用来强调“不是竖直方向/不是垂直线”。日常口语中也可以用“slanted / tilted / not straight”来表达更自然。"]}
{"word":"nonverticality","summary":{"en":"Nonverticality means a lack of vertical alignment—how much something is not straight up and down.","zh":"nonverticality 指“非垂直性”，即物体偏离竖直方向（不再直上直下）的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being vertical; a deviation from straight up-and-down alignment","zh":"非垂直性；不呈垂直的状态或性质；偏离竖直方向的程度"},"examples":[{"en":"Engineers measured the tower’s nonverticality to make sure it stayed within safety limits.","zh":"工程师测量了塔的非垂直性，以确保它保持在安全范围内。"},{"en":"Even slight nonverticality can cause doors to swing open or shut by themselves.","zh":"即使轻微的非垂直性也可能导致门自动打开或关上。"},{"en":"The report notes nonverticality in the wall after the earthquake.","zh":"报告指出地震后墙体出现了非垂直性（不再垂直）。"}]}],"synonyms":["lack of verticality","deviation from vertical","out-of-plumb condition","tilt","lean"],"phonetic":"/ˌnɑnˌvɝtɪˈkælɪti/","extraExplanation":["“nonverticality”是由 non-（不、非）+ vertical（垂直的）+ -ity（表示性质/状态的名词后缀）构成的技术性词汇，常见于工程、建筑测量、机械校准等语境。日常英语里更常说“not vertical”“out of plumb（不垂直）”“lean（倾斜）”。","相关近义表达里：plumb 指“垂直/铅垂线方向”，因此 out of plumb 很地道；tilt/lean 强调“倾斜的结果或动作”，而 nonverticality 更强调“偏离垂直这一性质/指标”。"]}
{"word":"nonvertically","summary":{"en":"“Nonvertically” means “not vertically; not in an upright direction.”","zh":"“nonvertically”表示“非垂直地；不是竖直方向”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vertical; not straight up-and-down.","zh":"以非垂直的方式；不是笔直向上向下。"},"examples":[{"en":"The pipes were installed nonvertically to fit the tight space.","zh":"为了适应狭小空间，这些管道以非垂直的方式安装。"},{"en":"If you hold the phone nonvertically, the screen may rotate.","zh":"如果你不是竖直拿手机，屏幕可能会旋转。"}]}],"synonyms":["not vertically","horizontally","diagonally","at an angle"],"phonetic":"/ˌnɑnˈvɝtɪkli/","extraExplanation":["“nonvertically”由前缀 non-（表示“非、不”）+ vertically（“垂直地”）构成，意思直观但较少在日常口语中单独使用。很多场景更常说 “not vertically” 或根据语境改用 “horizontally/diagonally/at an angle”。"]}
{"word":"nonverticalness","summary":{"en":"“Nonverticalness” means the state of not being vertical (tilted or leaning). It’s understandable but very uncommon; “tilt,” “lean,” or “out of plumb” are more natural.","zh":"“nonverticalness”指“不垂直”的状态（倾斜/歪斜）。意思能懂但很少用；更自然的说法有“tilt / lean / out of plumb”等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of not being vertical; lack of uprightness (often implying a tilt, slant, or leaning position).","zh":"非垂直的状态或性质；不够竖直（常含有倾斜、歪斜、偏离竖直的意思）。"},"examples":[{"en":"The photo looks strange because of the building’s nonverticalness.","zh":"这张照片看起来怪怪的，因为大楼不够竖直，有点歪。"},{"en":"Engineers measured the wall’s nonverticalness before repairs.","zh":"工程师在维修前测量了墙体的非垂直程度。"}]}],"synonyms":["tilt","lean","slant","inclination","deviation from vertical","out of plumb"],"phonetic":"ˌnɑnˈvɝtɪkəlnəs","extraExplanation":["“nonverticalness”是一个由 non-（不、非）+ vertical（垂直的）+ -ness（名词后缀，表示“性质/状态”）组成的构词产物，语法上成立，但在真实英语中非常少见，读起来也偏生硬。","更自然、常用的替代表达包括：tilt（倾斜）、lean（倾斜/倚靠）、slant（斜度）、inclination（倾角/倾向）、deviation from vertical（偏离竖直）、out of plumb（不垂直；建筑/测量用语）。在工程或测量语境里，常说 “the wall is out of plumb” 或 “vertical deviation”。"]}
{"word":"nonvesicular","summary":{"en":"Nonvesicular means “not involving vesicles,” especially in biology and medicine.","zh":"nonvesicular 指“非囊泡的”，尤用于生物与医学语境，表示不涉及囊泡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Not made of, contained in, or transported by vesicles (small membrane-bound sacs in cells or tissues).","zh":"（生物/医学）非囊泡的；不由囊泡（细胞内/组织中的小型膜性囊）构成、包含或运输的。"},"examples":[{"en":"The researchers compared vesicular and nonvesicular transport of lipids.","zh":"研究人员比较了脂质的囊泡运输与非囊泡运输。"},{"en":"Some signals spread through nonvesicular pathways in the cell.","zh":"有些信号会在细胞中通过非囊泡途径传播。"}]}],"synonyms":["non-vesicular","vesicle-independent","nonvacuolar (less common, context-dependent)"],"phonetic":"/ˌnɑn.vəˈsɪk.jə.lɚ/","extraExplanation":["“non-”表示“非/不”，而“vesicular”来自“vesicle（囊泡）”。所以 nonvesicular 常见于学术写作，用来对比 vesicular（囊泡相关的）机制，例如“囊泡运输 vs 非囊泡运输”。","在细胞生物学里，vesicle 是一种带膜的小囊，常用于物质运输与分泌；nonvesicular 则通常指不依赖这些小囊的过程（例如某些脂质在膜接触位点的转运）。"]}
{"word":"nonvesicularly","summary":{"en":"“Nonvesicularly” means ‘in a non‑vesicular way,’ especially in scientific contexts (not via vesicles/blisters).","zh":"“nonvesicularly”表示“以非囊泡/非水疱方式”，多用于科研语境，强调不是通过囊泡（或水疱）进行。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a non‑vesicular way; without forming, involving, or being contained in vesicles (small sacs/blisters), especially in biology or medicine.","zh":"以非囊泡（或非水疱）方式；不形成、不涉及、也不被包裹在囊泡/小囊（或皮肤小水疱）中的方式（常用于生物学或医学语境）。"},"examples":[{"en":"The protein can be released nonvesicularly, rather than being packaged into vesicles.","zh":"这种蛋白质可以以非囊泡方式释放，而不是被装入囊泡中。"},{"en":"Some neurotransmitters may diffuse nonvesicularly under certain conditions.","zh":"在某些条件下，一些神经递质可能会以非囊泡方式扩散。"}]}],"synonyms":["nonvesicularly (in a non-vesicular manner)","in a non-vesicular way","without vesicles","not vesicle-mediated"],"phonetic":"/ˌnɑn.vəˈsɪk.jə.lɚ.li/","extraExplanation":["这个词非常少见，多见于学术论文写作，尤其是细胞生物学/神经科学里，用来对比“vesicularly（囊泡方式）”。","“vesicle”在不同领域含义略有差异：在细胞里指膜性小囊（运输、分泌等）；在皮肤科里常指小水疱（vesicle/vesicular rash）。因此 nonvesicularly 的具体指向要看上下文（细胞囊泡 vs. 皮肤水疱）。","构词法：non-（不、非）+ vesicular（囊泡的/水疱的）+ -ly（副词）。写作中也可能见到更常用的表达：“in a non‑vesicular manner/way”。"]}
{"word":"nonvesting","summary":{"en":"Nonvesting means not yet vested—an entitlement (often stock or benefits) that isn’t guaranteed until conditions are met.","zh":"Nonvesting 指“尚未归属/未既得”的权益（常见于股权或福利），在满足条件前并不保证属于你。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Finance/compensation) Not vested yet; not earned or owned in a way that is guaranteed, so it can be lost if conditions (like staying employed) are not met.","zh":"（金融/薪酬）尚未归属的；尚未取得既得权利的，因此若未满足条件（如继续在职）可能会失去。"},"examples":[{"en":"The stock options are nonvesting until you complete one year at the company.","zh":"这些股票期权在你完成一年的工作之前都属于未归属（nonvesting）状态。"},{"en":"Because the benefits are nonvesting, you may forfeit them if you leave early.","zh":"因为这些福利尚未归属，如果你提前离职可能会被取消（失去）。"}]}],"synonyms":["unvested","not vested","non-vesting"],"phonetic":"/ˌnɑnˈvɛstɪŋ/","extraExplanation":["“nonvesting”常见于员工股权/福利文件（如stock options, RSUs, pension/retirement benefits）。意思是“还没到归属时间”，通常和“vesting schedule（归属时间表）”“cliff（悬崖期）”“forfeit（丧失）”一起出现。","更常见的写法是“non-vesting”（加连字符）或直接说“not vested / unvested”。不同公司或法律文本的用词可能略有差别，但核心概念是：在满足约定条件之前，你还没有不可撤销的所有权/权益。"]}
{"word":"nonvesture","summary":{"en":"Nonvesture is a rare noun meaning either lack of clothing or (more formally) not being vested with authority or rights.","zh":"nonvesture 是个罕见名词，可指“不穿衣/缺乏衣物”，也可更正式地指“未被授予权力或权利的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not wearing clothing; lack of clothing or covering","zh":"不穿衣（的状态）；缺乏衣物或遮蔽"},"examples":[{"en":"In the painting, the figure’s nonvesture is treated as a symbol of vulnerability rather than shock value.","zh":"在这幅画里，人物的不穿衣被当作脆弱的象征，而不是为了猎奇。"},{"en":"The writer uses nonvesture to suggest innocence and a return to nature.","zh":"作者用“不穿衣”来暗示纯真与回归自然。"}]},{"partOfSpeech":"n.","definition":{"en":"(formal, rare) the state of not being vested or invested with authority, rights, or property","zh":"（正式用语，罕见）未被授予（权力、权利或财产）的状态；未“就职/授职”"},"examples":[{"en":"The document argued that his nonvesture meant he had no legal power to act for the group.","zh":"文件主张他未被授予相应权限，因此无权代表该团体行事。"},{"en":"Their nonvesture in the role was temporary until the ceremony.","zh":"在仪式之前，他们处于暂时未正式就任的状态。"}]}],"synonyms":["nudity","nakedness","bareness","unclothedness","disinvestment"],"phonetic":"/nɑnˈvɛstʃər/","extraExplanation":["这个词非常少见，多见于文学批评、艺术评论或较正式的法律/宗教语境。日常英语更常用 nudity / nakedness（裸露、赤裸）来表达“没穿衣服”。","词源上可理解为 non-（不、非）+ vesture（衣着；也可指“授予、就任”的象征性衣袍），因此既可指“无衣”，也可引申为“未被授职/未被授予”。"]}
{"word":"nonveteran","summary":{"en":"Nonveteran means someone who is not a veteran, especially not a military veteran.","zh":"nonveteran 指“非退伍军人”，常用于区分是否具有退伍军人身份。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not a veteran; not someone who has served in the armed forces (or not someone with long experience in a particular field)","zh":"非退伍军人；（更广义）非老手、缺乏某领域长期经验的人"},"examples":[{"en":"This scholarship is open to both veterans and nonveterans.","zh":"这项奖学金对退伍军人和非退伍军人都开放。"},{"en":"Some programs offer different support for veterans and nonveterans.","zh":"有些项目会为退伍军人和非退伍军人提供不同的支持。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is not a veteran","zh":"非退伍军人（指没有退伍军人身份的人）"},"examples":[{"en":"Nonveterans can apply, but veterans may receive priority.","zh":"非退伍军人也可以申请，但退伍军人可能会被优先考虑。"}]}],"synonyms":["civilian","non-veteran"],"phonetic":"/ˌnɑnˈvɛtərən/","extraExplanation":["在美国语境里，veteran 常特指“退伍军人/服役者”，并且可能涉及特定福利（如医疗、教育补助等）。因此 nonveteran 常用于政策、申请条件、统计分类中，用来区分是否具有退伍军人身份。","拼写与用法：nonveteran = non-（否定前缀）+ veteran（退伍军人/老兵）。更常见的写法有连字符 non-veteran；也可见复数 nonveterans。"]}
{"word":"nonveterinaries","summary":{"en":"“nonveterinaries” is a nonstandard form meaning “people who are not veterinarians”; the standard spelling is “nonveterinarians/non-veterinarians.”","zh":"“nonveterinaries”属于非标准写法，意为“非兽医的人”；标准写法是“nonveterinarians / non-veterinarians”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) People who are not veterinarians; non-vets. (More standard: “nonveterinarians” or “non-veterinarians.”)","zh":"（非标准用法）不是兽医的人；非兽医。（更标准：nonveterinarians 或 non-veterinarians）"},"examples":[{"en":"This workshop is designed for nonveterinarians who work with animals.","zh":"这个工作坊是为从事动物相关工作但不是兽医的人设计的。"},{"en":"Nonveterinarians should not prescribe antibiotics for pets.","zh":"非兽医不应给宠物开抗生素。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Not related to veterinary medicine. (More standard: “nonveterinary.”)","zh":"（少见）与兽医学无关的。（更标准：nonveterinary）"},"examples":[{"en":"She handles the nonveterinary paperwork at the clinic.","zh":"她负责诊所里与兽医工作无关的文书事务。"}]}],"synonyms":["nonveterinarians","non-veterinarians","non-vets","laypeople","nonveterinary"],"phonetic":"/ˌnɑnˌvɛtəˈnɛriən/","extraExplanation":["“nonveterinaries”在英语里不常见，通常被视为拼写或构词不自然。最常用的表达是：\n- 名词复数：nonveterinarians / non-veterinarians（非兽医的人）\n- 形容词：nonveterinary（非兽医的、与兽医学无关的）","前缀non-表示“非、不是”。在正式写作中，加连字符（non-veterinarians）有时更清晰，尤其在长词或避免误读时。"]}
{"word":"nonveterinary","summary":{"en":"Nonveterinary means “not related to veterinary medicine.”","zh":"nonveterinary 的意思是“非兽医的；与兽医学无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not related to veterinary medicine or the treatment of animals","zh":"非兽医的；与兽医学或动物治疗无关的"},"examples":[{"en":"This disinfectant is for nonveterinary use, so don’t use it to treat a pet’s illness.","zh":"这种消毒剂用于非兽医用途，所以不要用它来给宠物治病。"},{"en":"The company hired a nonveterinary manager to handle finance and scheduling.","zh":"公司聘请了一位非兽医背景的经理来负责财务和排班。"}]}],"synonyms":["non-veterinary","not veterinary","nonclinical (in some contexts)"],"phonetic":"/ˌnɑnˈvɛtərɪˌnɛri/","extraExplanation":["“non-”是英语里很常见的前缀，意思是“非／不”。因此 nonveterinary 通常表示“不是兽医领域的、与兽医诊疗无关的”。写作中也常见带连字符的形式 non-veterinary，意思相同。"]}
{"word":"nonvexatious","summary":{"en":"Nonvexatious means “not meant to harass or cause needless trouble,” especially in legal/formal writing.","zh":"nonvexatious 意为“非滋扰性的、非刁难性的”，多用于法律或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not vexatious; not intended to annoy, harass, or cause unnecessary trouble (often used in legal or formal contexts).","zh":"非滋扰性的；不以骚扰、刁难或制造不必要麻烦为目的的（常见于法律或正式语境）。"},"examples":[{"en":"The judge found that her complaint was nonvexatious and deserved a full hearing.","zh":"法官认定她的投诉并非滋扰性诉讼，值得进行完整审理。"},{"en":"Please keep your feedback nonvexatious and focused on the facts.","zh":"请将你的反馈保持为非刁难性的，并聚焦事实。"}]}],"synonyms":["legitimate","reasonable","bona fide","proper","justified"],"phonetic":"/ˌnɑn vɛkˈseɪʃəs/","extraExplanation":["“nonvexatious”由前缀 non-（不、非）+ vexatious（滋扰性的、令人烦扰的）构成。vexatious 在法律中常指“滥用程序来骚扰对方”的行为，例如反复提起缺乏根据的诉讼或申请。","在一些司法体系里，法院可能会限制“vexatious litigant”（滋扰诉讼者）的起诉权；因此说某个请求是 nonvexatious，通常是在强调它是正当、善意且有理由的。"]}
{"word":"nonvexatiously","summary":{"en":"“Nonvexatiously” means “without being annoying or harassing,” especially in formal or legal contexts.","zh":"“nonvexatiously”表示“以不刁难、不骚扰的方式”，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vexatious; without intending to annoy, harass, or cause unnecessary trouble (often used in legal contexts about lawsuits or complaints).","zh":"以不刁难、不骚扰的方式；不带恶意、不造成不必要困扰（常用于法律语境，如诉讼或申诉）。"},"examples":[{"en":"The judge asked both parties to communicate nonvexatiously and focus on the facts.","zh":"法官要求双方以不刁难的方式沟通，把注意力放在事实本身。"},{"en":"You may report the issue again, as long as you do so nonvexatiously.","zh":"你可以再次举报该问题，只要你的方式不是为了刁难或骚扰。"},{"en":"The organization encourages citizens to raise concerns nonvexatiously and respectfully.","zh":"该机构鼓励市民以不刁难、彼此尊重的方式提出关切。"}]}],"synonyms":["in good faith","reasonably","without harassment","nonabusively","fairly"],"phonetic":"/ˌnɑnˌvɛk.səˈtɔr.i.əs.li/","extraExplanation":["“vexatious”常见于法律英语，尤其是“vexatious litigation”（恶意/纠缠式诉讼），指反复提告、目的在骚扰对方而非解决争议。“nonvexatiously”因此多见于法院命令、政策条款或正式书面语。","构词：non-（不）+ vex（使烦恼/困扰）+ -atious（形容词后缀）+ -ly（副词后缀）。日常英语里更常用的表达是“without harassment / in good faith / reasonably”。"]}
{"word":"nonvexatiousness","summary":{"en":"Nonvexatiousness means the state of not being vexatious—i.e., not intended to annoy, harass, or cause needless trouble, especially in legal settings.","zh":"nonvexatiousness 指“不具刁难／骚扰性”的状态，常用于法律语境，强调并非为了惹恼、骚扰或制造不必要麻烦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being vexatious; being unlikely to annoy, harass, or cause unnecessary trouble (often in legal or administrative contexts)","zh":"不具刁难性／不具骚扰性；指不太可能令人烦扰、刁难或造成不必要麻烦（常见于法律或行政语境）"},"examples":[{"en":"The court considered the nonvexatiousness of the complaint before allowing the case to proceed.","zh":"法院在决定是否让案件继续审理前，会考量该投诉是否不具刁难性。"},{"en":"They asked for evidence of nonvexatiousness to prevent repeated, harassing requests.","zh":"他们要求提供“不具骚扰性”的证据，以防止反复、带有骚扰性质的请求。"}]}],"synonyms":["good faith","lack of harassment","non-abusive character","legitimacy"],"phonetic":"/ˌnɑnˌvɛkˈseɪʃəsnəs/","extraExplanation":["这是一个非常少见、偏正式的名词，多见于法律写作或政策文件，用来和 vexatiousness（刁难性／骚扰性，尤指滥诉或恶意投诉）形成对照。","构词：non-（不）+ vexatious（刁难的、令人烦恼的）+ -ness（名词后缀）。更常见的表达是 nonvexatious（形容词）或 not vexatious（否定短语）。"]}
{"word":"nonviability","summary":{"en":"Nonviability means the state of being unable to survive or succeed (not viable).","zh":"nonviability 指“不可存活性/不可行性”，即处于无法生存或无法成功维持的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not being able to live, survive, or develop successfully (often used in biology, medicine, or business)","zh":"不可存活性；无法生存或无法成功发展（常用于生物、医学或商业语境）"},"examples":[{"en":"Doctors confirmed the fetus’s nonviability, meaning it could not survive outside the womb.","zh":"医生确认胎儿为“不可存活”，意思是无法在子宫外存活。"},{"en":"The report warned of the project’s nonviability without additional funding.","zh":"报告警告说，如果没有额外资金，这个项目将不可行、难以持续。"}]}],"synonyms":["unviability","infeasibility","unsustainability"],"phonetic":"/ˌnɑnˌvaɪəˈbɪləti/","extraExplanation":["nonviability 是由 non-（不、非）+ viability（可存活性/可行性）组成的抽象名词，常见于较正式或专业的写作。","医学/生物语境里多指“生命无法维持”；商业/政策语境里常接近“不可行、无法持续盈利或运行”。日常口语中更常说 not viable / not workable。"]}
{"word":"nonviable","summary":{"en":"“Nonviable” means not able to survive or not workable/successful in practice.","zh":"nonviable 指“无法存活”或“不可行、难以成功运作”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to survive, develop, or work successfully; not workable or not realistic.","zh":"不可存活的；不可行的；无法成功运作的。"},"examples":[{"en":"The doctor said the fetus was nonviable outside the womb.","zh":"医生说胎儿在子宫外无法存活。"},{"en":"Without funding, the project is nonviable.","zh":"没有资金，这个项目就不可行。"},{"en":"Their business model proved nonviable in a small town.","zh":"他们的商业模式在小镇上被证明行不通。"}]}],"synonyms":["not workable","unfeasible","unsustainable","impractical","unrealistic"],"phonetic":"/ˌnɑnˈvaɪəbəl/","extraExplanation":["“non-”是否定前缀，表示“不是/不…”。“viable”来自拉丁语，原意与“生命力、能活下去”相关，所以 nonviable 常用于医学语境（如“无法存活”），也常用于商业/计划语境（如“不可行、难以成功运作”。）","语气与场合：nonviable 比 “not possible/not workable” 更正式、更偏客观判断，常见于报告、论文、商业分析、医疗沟通中。日常口语里也可以说 “It won’t work / It’s not going to work.”"]}
{"word":"nonvibratile","summary":{"en":"Nonvibratile means not vibrating or not able to vibrate, usually in technical contexts.","zh":"nonvibratile 指“不振动的/不能振动的”，多用于技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not capable of vibrating; not vibrating.","zh":"不能振动的；不振动的。"},"examples":[{"en":"The engineer chose a nonvibratile mounting to keep the instrument stable.","zh":"工程师选择了不易振动的安装方式，以保持仪器稳定。"},{"en":"For accurate measurements, the sensor should be placed on a nonvibratile surface.","zh":"为了获得准确测量，传感器应放在不振动的表面上。"}]}],"synonyms":["nonvibrating","vibration-free","steady"],"phonetic":"/ˌnɑnˈvaɪbrətl/","extraExplanation":["这是一个比较少见、偏技术领域的词，常见于工程、物理或医学等语境，用来强调“没有振动/不产生振动”。日常英语里更常用 nonvibrating 或 vibration-free。","词形上 non- 表示“非、无”，vibr- 来自拉丁语 vibrare（振动），-atile/-ile 常见于形容词，表示“具有……性质/能力”。"]}
{"word":"nonvibrating","summary":{"en":"Nonvibrating means not vibrating—stable, not shaking or oscillating.","zh":"nonvibrating 意为“不振动的”，指稳定、不摇动或不产生振荡的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not vibrating; staying still instead of shaking or oscillating.","zh":"不振动的；不摇动、不产生振荡的。"},"examples":[{"en":"The technician replaced the fan with a nonvibrating model to reduce noise.","zh":"技术员把风扇换成不振动的型号来降低噪音。"},{"en":"On a stable, nonvibrating surface, the microscope image looks clearer.","zh":"在稳定、不振动的台面上，显微镜图像更清晰。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a sound or sensation) steady and without tremble or quiver.","zh":"（声音或感觉）平稳的；不颤动的。"},"examples":[{"en":"Her voice was calm and nonvibrating as she explained the situation.","zh":"她解释情况时声音很平稳，没有颤抖。"}]}],"synonyms":["non-vibrating","still","steady","stable","motionless"],"phonetic":"/ˌnɑnˈvaɪˌbreɪtɪŋ/","extraExplanation":["这个词更常见的写法是带连字符的 non-vibrating，尤其在工程、物理或产品说明书里（如“non-vibrating platform/isolator”）。在日常写作中也可以用 not vibrating 来表达同样意思。"]}
{"word":"nonvibration","summary":{"en":"Nonvibration means the absence of vibration, especially in technical contexts.","zh":"nonvibration 指“无振动/没有振动”，多用于技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of having no vibration; absence of shaking or oscillation (often used in technical or engineering contexts).","zh":"无振动状态；不发生震动/振荡的情况（多见于工程或技术语境）。"},"examples":[{"en":"The goal of the redesign was nonvibration of the motor housing at high speed.","zh":"这次重新设计的目标是让电机外壳在高速运转时保持无振动。"},{"en":"Sensors confirmed nonvibration during the final test.","zh":"传感器确认在最终测试中没有出现振动。"}]}],"synonyms":["lack of vibration","no vibration","stillness","absence of oscillation"],"phonetic":"/ˌnɑnvaɪˈbreɪʃən/","extraExplanation":["“non-”是英语中常见前缀，表示“非、无、不”。“nonvibration”属于较少见的合成名词，更常见的表达是“lack of vibration”（缺乏振动）或形容词“nonvibrating”（不振动的）。","在写作中，如果不是严格技术报告，使用更自然的说法会更地道，例如：“The device operates without vibration.”（该装置运行时无振动。）"]}
{"word":"nonvibrator","summary":{"en":"A technical term for something designed not to vibrate or to reduce/prevent vibration; also, anything that does not vibrate.","zh":"多用于技术语境：指不振动或用于减少/防止振动的装置或部件；也可泛指不发生振动的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device, part, or material designed not to vibrate, or to prevent vibration (often used in technical contexts).","zh":"不振动器／不振动部件：指被设计成不发生振动，或用来防止、减少振动的装置、零件或材料（多见于技术语境）。"},"examples":[{"en":"The engineer replaced the bracket with a nonvibrator to reduce noise.","zh":"工程师把支架换成不振动部件来降低噪音。"},{"en":"This mount is a nonvibrator, so the camera stays steady during filming.","zh":"这个支架是防振动的，所以拍摄时相机很稳。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that does not vibrate (a general descriptive use).","zh":"不发生振动的东西（较一般性的描述用法）。"},"examples":[{"en":"Compared with the old motor, the new one feels like a nonvibrator.","zh":"和旧电机相比，新电机感觉几乎不振动。"}]}],"synonyms":["vibration-free device","non-vibrating part","vibration isolator","anti-vibration mount","damper"],"phonetic":"/ˌnɑnˈvaɪˌbreɪtɚ/","extraExplanation":["“nonvibrator”不是日常高频词，更常见的写法是带连字符的“non-vibrator”，或用更自然的表达如“non-vibrating (part/device)”（不振动的/防振的部件/设备）以及“vibration-free”。","在工程英语里，人们往往不直接说“a nonvibrator”，而是说“a vibration isolator（隔振器）”“anti-vibration mount（防振支架）”“damping material（阻尼材料）”，根据具体功能来命名会更地道。"]}
{"word":"nonvibratory","summary":{"en":"“Nonvibratory” means “not vibrating,” often used to describe speech sounds or vocal cords that do not vibrate.","zh":"“Nonvibratory”意为“不振动的”，常用于描述不发生振动的语音现象或声带状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not vibrating; not involving vibration (especially of the vocal cords).","zh":"不振动的；不涉及振动的（尤指声带不振动）。"},"examples":[{"en":"In a whisper, the vocal folds are mostly nonvibratory.","zh":"在耳语中，声带大多处于不振动状态。"},{"en":"The therapist noted a nonvibratory pattern during parts of the patient’s speech.","zh":"治疗师注意到患者在部分发音时呈现不振动的模式。"}]}],"synonyms":["nonvibrating","unvibrating","voiceless (in phonetics context)"],"phonetic":"/ˌnɑnˈvaɪbrəˌtɔri/","extraExplanation":["这个词常见于语音学与嗓音医学（如声带功能评估）。例如清音（如 /s/）通常被描述为 nonvibratory（声带不振动），而浊音（如 /z/）则是 vibratory（声带振动）。","构词法：non-（否定前缀）+ vibratory（振动的）。在普通日常英语中较少使用，更偏学术/专业语境。"]}
{"word":"nonvicarious","summary":{"en":"Nonvicarious means direct, firsthand—not experienced through someone else.","zh":"nonvicarious 指“亲身的、第一手的”，不是通过他人间接体验。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not vicarious; experienced or done directly and personally, not through another person’s experience or actions.","zh":"非替代性的；非间接体验的；指亲身、直接经历或完成的，而不是通过他人的经历或行为来体验。"},"examples":[{"en":"The program aims to give students nonvicarious experiences through hands-on lab work.","zh":"该项目旨在通过动手实验让学生获得非间接的、亲身的体验。"},{"en":"Reading about travel is enjoyable, but it’s not the same as a nonvicarious trip.","zh":"读游记很有趣，但和一次亲身旅行并不一样。"}]}],"synonyms":["firsthand","direct","personal","immediate","non-substitute"],"phonetic":"/ˌnɑnvaɪˈkɛriəs/","extraExplanation":["“non-”表示否定，“vicarious”常指“通过他人而获得的/替代性的（体验、快乐、痛苦等）”。因此 nonvicarious 强调“第一手、亲自”的意味，但它并不是特别常见的日常用词，更常见的表达是 “firsthand” 或 “direct”。"]}
{"word":"nonvicariously","summary":{"en":"“Nonvicariously” means directly, not through someone else’s experience.","zh":"nonvicariously 意为“亲自、直接地体验/完成”，而不是通过他人的经历来间接体验。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Not in a vicarious way; not experienced or done through someone else’s actions or feelings, but directly by oneself.","zh":"非替代地；非间接地（不是通过他人的经历、行为或感受来体验/完成，而是亲自、直接地）。"},"examples":[{"en":"She wanted to understand the culture nonvicariously, so she lived with a local family for a year.","zh":"她想以非替代的方式理解那种文化，所以在当地家庭寄住了一年。"},{"en":"You can’t learn courage only by watching movies; you have to face challenges nonvicariously.","zh":"你不能只靠看电影来学会勇敢；你必须亲自、直接地面对挑战。"}]}],"synonyms":["directly","in person","firsthand","personally"],"phonetic":"/ˌnɑnvaɪˈkɛriəsli/","extraExplanation":["这个词很少见，更多时候人们会说：directly（直接地）、in person（亲自）、firsthand（第一手地）。","构词：non-（否定前缀）+ vicarious（替代的/间接体验的）+ -ly（副词后缀）。vicarious 常见搭配是 vicarious pleasure/experience（替代性的快乐/体验）。","使用语境多偏学术或写作风格，用来强调“不是通过观看/阅读/他人转述来体验”，而是“自己亲身经历”。"]}
{"word":"nonvicariousness","summary":{"en":"Nonvicariousness means direct, firsthand experience—not living something through someone else.","zh":"nonvicariousness 指“亲身直接经历”的状态，而不是通过他人的经历来间接体验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being nonvicarious; experiencing something directly yourself rather than through someone else’s experience or feelings","zh":"非替代体验（非代入式体验）的状态；指亲身直接经历某事，而不是通过他人的经历或感受来间接体验"},"examples":[{"en":"Travel can give you a sense of nonvicariousness that you can’t get from videos.","zh":"旅行能带来一种“非替代体验”的感觉，这是看视频得不到的。"},{"en":"She valued the nonvicariousness of working in the community instead of just reading reports about it.","zh":"她很珍惜在社区亲身工作的“非替代体验”，而不是只读报告来了解情况。"}]}],"synonyms":["direct experience","firsthand experience","immediacy"],"phonetic":"/ˌnɑnvaɪˈkɛriəsnəs/","extraExplanation":["这个词非常少见，多见于学术或哲学写作。它由 non-（否定）+ vicarious（替代的、代入式的）+ -ness（名词后缀）构成，字面意思就是“非代入/非替代的状态”。","常用表达通常会换成更自然的说法，比如 direct experience（直接经验）、firsthand experience（亲身经历）、in person（亲自）。"]}
{"word":"nonvictories","summary":{"en":"Nonvictories means outcomes that are not wins (losses or draws).","zh":"nonvictories 指“非胜利”的结果，即没有赢的比赛（包括失利或平局）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of nonvictory: results that are not wins (for example, losses or draws).","zh":"nonvictory 的复数：指“不是胜利”的结果（例如失败或平局）。"},"examples":[{"en":"The team had three straight nonvictories: two losses and a draw.","zh":"这支球队连续三场非胜利：两场失利和一场平局。"},{"en":"Coaches often review nonvictories to see what went wrong.","zh":"教练常常复盘非胜利的比赛，看看问题出在哪里。"}]}],"synonyms":["losses","defeats","draws","ties","winless results"],"phonetic":"/ˌnɑnˈvɪktəriz/","extraExplanation":["nonvictory 是由 non-（“非、不”）+ victory（“胜利”）构成的合成词，多见于体育报道或统计语境，用来把“没赢”的比赛统一归类（既包括输，也可能包括平）。","在某些联赛积分规则里，平局不算胜利但也不等同于失败；因此用 nonvictory 可以避免只说 losses（失利）而遗漏 draws/ties（平局）。"]}
{"word":"nonvictory","summary":{"en":"Nonvictory means a result that is not a clear win—often an inconclusive or mixed outcome.","zh":"nonvictory 指“非胜利”：没有明确赢的结果，常带有结局含糊、得失参半的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An outcome that is not a victory; a result that is inconclusive or fails to count as a clear win.","zh":"非胜利；没有取得明确胜利的结果（常指结果不明朗、无法算作赢）。"},"examples":[{"en":"After months of fighting, both sides claimed success, but many observers called it a nonvictory.","zh":"经过数月战斗，双方都宣称成功，但许多观察者称其为“非胜利”。"},{"en":"The negotiation ended in a nonvictory: no one lost outright, but no one achieved their goals either.","zh":"谈判以“非胜利”收场：没人彻底失败，但也没人实现目标。"}]}],"synonyms":["no win","draw","stalemate","inconclusive outcome","mixed result"],"phonetic":"/ˌnɑnˈvɪktəri/","extraExplanation":["“nonvictory”更常见的写法是“non-victory”（带连字符），在新闻评论、政治和外交语境里尤其常见，用来强调“既不是胜利也不是失败”的尴尬或模糊结果。"]}
{"word":"nonvigilance","summary":{"en":"Nonvigilance means not being watchful or alert when you should be.","zh":"nonvigilance 指在应当保持警觉时却不警觉、不留意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lack of vigilance; failure to stay alert, watchful, or attentive to possible danger or problems.","zh":"缺乏警觉；未能保持警醒、留意潜在危险或问题的状态。"},"examples":[{"en":"A moment of nonvigilance can lead to serious safety accidents.","zh":"片刻的缺乏警觉可能导致严重的安全事故。"},{"en":"The report blamed the incident on staff nonvigilance during the night shift.","zh":"报告将该事件归咎于夜班人员的警觉性不足。"}]}],"synonyms":["inattention","carelessness","complacency","unwatchfulness","lack of vigilance"],"phonetic":"/ˌnɑnˈvɪdʒələns/","extraExplanation":["构词上，non- 表示“非、无”，vigilance 表示“警觉、警惕”。因此 nonvigilance 直译就是“无警觉”。在正式写作中更常见的说法是 lack of vigilance、inattention、complacency（因自满而放松警惕）。","该词多出现在安全、医疗、军事、交通、网络安全等语境，用来强调“本应保持警觉却没有做到”。日常口语里通常不会说 nonvigilance。"]}
{"word":"nonvigilant","summary":{"en":"Nonvigilant means not alert or not paying careful attention.","zh":"nonvigilant 指“不警惕、不够警觉”，对风险或细节不够留心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not watchful or alert; not paying careful attention to possible problems or danger","zh":"不警惕的；不够警觉的；不留心风险或问题的"},"examples":[{"en":"The guard was nonvigilant, so the thief slipped inside easily.","zh":"守卫不够警惕，所以小偷很容易就溜了进去。"},{"en":"If you are nonvigilant online, scammers can take advantage of you.","zh":"如果你在网络上不够警觉，诈骗者就可能趁机钻空子。"},{"en":"A nonvigilant attitude toward deadlines can cause trouble at work.","zh":"对截止日期不够上心的态度可能会在工作中带来麻烦。"}]}],"synonyms":["not vigilant","not alert","inattentive","careless","unwatchful","unaware"],"phonetic":"/ˌnɑnˈvɪdʒələnt/","extraExplanation":["“nonvigilant”由前缀 non-（表示“非、不”）+ vigilant（警惕的）组成，意思直观，但在日常英语里更常见的表达是 “not vigilant / not alert / inattentive / careless”。","语感上，“nonvigilant”略偏正式或书面，用于描述“缺乏持续警觉”的状态；若是强调“疏忽大意”，用 careless；强调“注意力不集中”，用 inattentive 更自然。"]}
{"word":"nonvigilantly","summary":{"en":"“Nonvigilantly” means “without vigilance; not alert or watchful.”","zh":"nonvigilantly 意为“缺乏警惕地；不够警觉地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vigilant; without careful watching or alertness.","zh":"以不警觉的方式；缺乏警惕与留意地。"},"examples":[{"en":"The guard watched the entrance nonvigilantly and missed the visitor.","zh":"警卫不够警觉地看着入口，结果错过了来访者。"},{"en":"If you drive nonvigilantly, small mistakes can quickly become dangerous.","zh":"如果你开车不够警觉，小失误很快就可能变得危险。"}]}],"synonyms":["inattentively","carelessly","unwatchfully","unalertly","negligently"],"phonetic":"/ˌnɑnˈvɪdʒələntli/","extraExplanation":["这个词由 non-（“不、非”）+ vigilant（“警惕的”）+ -ly（副词后缀）构成。日常英语里更常见的说法是 “not very vigilantly / without vigilance / carelessly / inattentively”，因为 nonvigilantly 相对少见、偏书面。","vigilant 常用于“保持警惕、防止危险或问题出现”的语境（如安全、驾驶、网络诈骗等）。"]}
{"word":"nonvigilantness","summary":{"en":"Nonvigilantness means a lack of vigilance—being not alert or watchful.","zh":"nonvigilantness 指缺乏警觉、不够留心的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being vigilant; a lack of alert, watchful attention.","zh":"不警觉的状态；缺乏警惕与留意。"},"examples":[{"en":"A moment of nonvigilantness at the airport can lead to serious security risks.","zh":"在机场一时的不警觉可能带来严重的安全风险。"},{"en":"Her nonvigilantness while driving almost caused an accident.","zh":"她开车时的不够警觉差点引发事故。"},{"en":"The guard was punished for nonvigilantness during his night shift.","zh":"那名守卫因夜班时不警觉而受到处罚。"}]}],"synonyms":["lack of vigilance","inattention","carelessness","unwatchfulness","negligence"],"phonetic":"/ˌnɑnˈvɪdʒələntnəs/","extraExplanation":["“nonvigilantness”由前缀 non-（不、非）+ vigilant（警觉的）+ -ness（名词后缀，表示“……的状态/性质”）构成，字面意思就是“缺乏警觉的状态”。","这个词在日常英语里不常见，更常用的表达是 “lack of vigilance / inattention / carelessness”。在正式写作或强调“警觉性”这一品质时，才可能见到它。"]}
{"word":"nonvillager","summary":{"en":"A nonvillager is someone who is not a villager—an outsider or nonresident of a village.","zh":"nonvillager 指“非村民”，即不属于某个村庄的外来者或非居民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not a villager; someone who does not live in (or is not from) a village","zh":"非村民；不住在村里（或不属于某个村庄）的人"},"examples":[{"en":"Only villagers could vote in the meeting; nonvillagers were asked to observe quietly.","zh":"只有村民可以在会上投票；非村民被要求安静旁听。"},{"en":"The forest is sacred to the community, and nonvillagers must get permission to enter.","zh":"这片森林对社区来说很神圣，非村民进入必须先获得许可。"}]}],"synonyms":["outsider","nonresident","visitor","foreigner"],"phonetic":"/nɑnˈvɪlɪdʒɚ/","extraExplanation":["“nonvillager”不是非常常见的标准词，更常见的表达有：outsider（外来者）、nonresident（非居民）、visitor（访客）、people from outside the village（村外的人）。","构词法：non- 表示“非、不”，villager 表示“村民”。在正式文件或社区规则中，用 non- + 身份词 的方式很常见（如 nonresident）。"]}
{"word":"nonvillainous","summary":{"en":"“Nonvillainous” means not villainous—often used to describe a character who isn’t truly a villain, or a version of a character interpreted as morally better.","zh":"nonvillainous 表示“非反派的、不邪恶的”，常用于描述某个角色并非真正反派，或在解读/改编中被塑造成更偏正面的版本。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not villainous; not having the qualities of a villain (not evil, cruel, or intentionally harmful).","zh":"非反派的；不邪恶的；不具反派特质的（不残忍、不存心伤害他人）。"},"examples":[{"en":"In the sequel, the character is portrayed as nonvillainous and even sympathetic.","zh":"在续集中，这个角色被塑造成非反派的，甚至令人同情。"},{"en":"Her motives were nonvillainous—she was trying to protect her family.","zh":"她的动机并非反派式的——她是在保护家人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Especially in fan discussions) Describing a character, group, or interpretation that frames someone usually seen as a villain as morally neutral or even good.","zh":"（尤用于同人/影视讨论）指把通常被视为反派的角色或阵营解读为道德中立甚至正面的一种设定/诠释。"},"examples":[{"en":"Some fans prefer a nonvillainous version of the antagonist.","zh":"一些粉丝更喜欢把反派写成非反派版本。"},{"en":"The reboot offers a more nonvillainous take on the classic ‘bad guy.’","zh":"这次重启对经典“坏人”给出了更非反派化的诠释。"}]}],"synonyms":["not villainous","non-evil","benign","harmless","well-intentioned"],"phonetic":"/ˌnɑnˈvɪlənəs/","extraExplanation":["构词：non-（“非、不”）+ villainous（“反派的、邪恶的”）。因此 nonvillainous 多用于描述“不是坏人/不是反派那种作恶方式”。","使用场景：在影评、同人创作、角色分析里很常见，用来表达“洗白/重新解读为非反派”的倾向；日常口语里更常用 not evil、not a villain、not villainous 等说法。"]}
{"word":"nonvillainously","summary":{"en":"“Nonvillainously” means “in a not-villainous way,” showing no evil or bad-guy intent.","zh":"“nonvillainously”表示“并非反派地/不带邪恶意图地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not villainous; without evil, cruel, or “bad-guy” intentions.","zh":"以非反派的方式；没有邪恶、残忍或“坏人”意图地。"},"examples":[{"en":"He acted nonvillainously and returned the stolen money right away.","zh":"他的行为一点也不像反派，立刻把偷来的钱还了回去。"},{"en":"The story shows the “enemy” behaving nonvillainously, helping civilians escape.","zh":"故事里“敌人”并非反派行径，反而帮助平民逃离。"}]}],"synonyms":["not villainously","decently","benevolently","with good intentions"],"phonetic":"/ˌnɑnˈvɪlənəsli/","extraExplanation":["“nonvillainously”是一个由前缀 non-（表示“非、不”）+ villainous（“邪恶的、像反派的”）+ -ly（副词后缀）组成的临时性/创造性用法，在影评、同人创作、小说评论里更常见；日常口语更常用：not like a villain / in a decent way / with good intentions。","和“villain”相关的词带有强烈的叙事/影视语感（像“反派”“坏人”）。用“nonvillainously”常是在强调：某人虽然看起来像反派、或被当成反派，但行为其实并不坏。"]}
{"word":"nonvillainousness","summary":{"en":"Nonvillainousness means the quality of not being villainous or evil.","zh":"nonvillainousness 指“不反派性/不邪恶性”，即没有反派或邪恶特质的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not being villainous; the state of being harmless or not evil in intent or behavior.","zh":"“不反派性；不邪恶性”：指不具反派/坏人特质的品质，意图或行为并不邪恶、并非加害他人。"},"examples":[{"en":"The story highlights the character’s nonvillainousness by showing her protecting people instead of hurting them.","zh":"故事通过描写她保护他人而不是伤害他人，来突出她的“不反派性”。"},{"en":"His nonvillainousness became clear when he admitted his mistake and tried to fix the damage.","zh":"当他承认错误并努力弥补损失时，他的“不邪恶性”就很明显了。"}]}],"synonyms":["goodness","innocence","harmlessness","lack of villainy"],"phonetic":"/ˌnɑnˈvɪlənəsnəs/","extraExplanation":["这是一个非常少见、偏“临时造词/创意写作”的名词，常见于影评、同人、论坛讨论，用来强调某角色“并不是坏人”。","构词法：non-（不、非）+ villainous（反派的、邪恶的）+ -ness（名词后缀，表示“……的性质/状态”）。因此它比简单说 “not a villain” 更抽象，更像在讨论“气质/特质”。","更自然的常用替代表达包括：goodness（善良）、innocence（清白/无辜）、lack of villainy（缺乏反派特质）。"]}
{"word":"nonvindicable","summary":{"en":"Nonvindicable means “not able to be justified or defended.”","zh":"nonvindicable 指“无法被证明正当或无法辩护的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not able to be defended, justified, or proven right (often used in formal or academic writing).","zh":"无法被辩护、无法被证明正当或正确的（多用于正式或学术语境）。"},"examples":[{"en":"The report argues that the policy is nonvindicable because it harms vulnerable communities.","zh":"报告认为这项政策是非正当且无法辩护的，因为它伤害了弱势群体。"},{"en":"In her essay, she calls the claim nonvindicable due to the lack of evidence.","zh":"在文章中，她指出由于缺乏证据，这一主张无法被证明正当。"}]}],"synonyms":["unjustifiable","indefensible","untenable","inexcusable","unsupportable"],"phonetic":"/ˌnɑnˈvɪndɪkəbəl/","extraExplanation":["这个词很少见，通常写作带连字符的 non-vindicable。由 non-（否定）+ vindicable（可被“辩护/证明正确”的）构成。","vindicable 源自动词 vindicate，常见意思是“为……洗清罪名/证明……无辜或正确”。因此 nonvindicable 更偏向“无法被证明有理、无法自圆其说”。","日常英语里更常用的替代表达有 unjustifiable（不正当的）、indefensible（站不住脚的）、untenable（难以维持/难以成立的）。"]}
{"word":"nonvindication","summary":{"en":"Nonvindication means not being vindicated—no clear proof of innocence or being right.","zh":"nonvindication 指“未获昭雪/未被证明清白或正确”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of vindication; a situation where someone is not cleared of blame or not proven right","zh":"未获昭雪；未被证明清白或正确的状态"},"examples":[{"en":"After the investigation ended without a clear conclusion, she felt a painful sense of nonvindication.","zh":"调查在没有明确结论的情况下结束后，她感到一种痛苦的“未获昭雪”。"},{"en":"The report offered criticism but no vindication—only nonvindication for the team’s decisions.","zh":"报告提出了批评，却没有给予平反——团队的决定只得到“未被证明正确”。"}]}],"synonyms":["lack of vindication","no vindication","failure to vindicate","non-exoneration"],"phonetic":"/ˌnɑnˌvɪndəˈkeɪʃən/","extraExplanation":["这个词非常少见，多用于较正式的写作（如法律、伦理或学术语境）。它由前缀 non-（“不、非”）+ vindication（“平反、昭雪、证明正确”）构成，意思就是“没有得到平反/证明”。","在日常英语里，人们更常说 no vindication / lack of vindication，或用更直接的表达如 not cleared、not exonerated。"]}
{"word":"nonvinosity","summary":{"en":"Nonvinosity means a lack of wine-like character (and, rarely, a lack of intoxication).","zh":"nonvinosity 指缺乏葡萄酒般的风味（少见时也可指无醉意）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of a wine-like smell, taste, or character (especially in a drink); lack of “vinosity.”","zh":"（尤指饮品）缺乏酒香/酒味/似葡萄酒的风味；“酒香特质”的缺失。"},"examples":[{"en":"The tester noted the juice’s nonvinosity—it tasted fresh and fruity, not wine-like.","zh":"测评者指出这款果汁的 nonvinosity——口感清新偏果香，并没有葡萄酒那种风味。"},{"en":"In a blind tasting, some people preferred the nonvinosity of the sparkling tea.","zh":"在盲品中，有些人更喜欢这款气泡茶的 nonvinosity（不带酒感的特质）。"}]},{"partOfSpeech":"n.","definition":{"en":"lack of drunkenness or intoxication (rare, nonstandard).","zh":"不醉、无醉意（较少见、非标准用法）。"},"examples":[{"en":"He insisted on his nonvinosity and said he was fine to drive.","zh":"他坚持说自己 nonvinosity（没有醉意），可以开车。"}]}],"synonyms":["lack of vinosity","non-vinous character","not wine-like","without a vinous note"],"phonetic":"/ˌnɑnvaɪˈnɑsəti/","extraExplanation":["这个词非常少见，多见于“自造词”或专业品鉴语境的临时用法。更自然的表达通常是：lack of wine-like character / not wine-like / without a vinous note（不带酒香/酒感）。","词源上可以理解为 non-（不、无）+ vinosity（酒香、葡萄酒般的风味）。在英语品酒笔记里更常见的是 vinous（有酒香的）或 vinosity（酒香特质），而不是 nonvinosity。"]}
{"word":"nonvinous","summary":{"en":"Nonvinous means “not containing wine” or “not related to wine,” and is a formal word often used in food and drink contexts.","zh":"nonvinous 意为“不含葡萄酒的/与葡萄酒无关的”，较正式，常见于餐饮与饮品语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing wine; not made from or related to wine.","zh":"不含葡萄酒的；非葡萄酒制的；与葡萄酒无关的。"},"examples":[{"en":"The restaurant offers a nonvinous pairing for guests who don’t drink alcohol.","zh":"这家餐厅为不喝酒的客人提供非葡萄酒的搭配方案。"},{"en":"They served a nonvinous punch at the office party.","zh":"他们在公司聚会上提供了不含葡萄酒的潘趣酒。"}]}],"synonyms":["not wine-based","wine-free","non-wine"],"phonetic":"/nɑnˈvaɪnəs/","extraExplanation":["词形拆解：non- 表示“非、不”，vinous 来自拉丁语 vinum（“酒/葡萄酒”），vinous 的意思是“葡萄酒的、带酒香/酒味的”。因此 nonvinous 就是“非葡萄酒的”。","使用场景：较正式、偏书面或专业（如餐饮、品鉴、产品描述）用语。日常口语更常说 non-alcoholic（无酒精的）或 alcohol-free（不含酒精的）。注意：nonvinous 侧重“不是葡萄酒/不含葡萄酒”，不一定等于“完全无酒精”。"]}
{"word":"nonvintage","summary":{"en":"Nonvintage (NV) means a wine—especially Champagne—made by blending wines from more than one year, not a single harvest year.","zh":"nonvintage（NV）指非年份酒（尤指香槟）：由多个年份的酒调配而成，并非单一年份采收酿造。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of wine, Champagne, or sparkling wine) not made from grapes harvested in a single year; blended from more than one year’s wines.","zh":"（尤指葡萄酒、香槟或起泡酒）非年份的；不是由同一年采收的葡萄酿成，而是由不同年份基酒调配而成。"},"examples":[{"en":"This is a nonvintage Champagne, blended to taste the same every year.","zh":"这是一款非年份香槟，通过调配让每年风味保持一致。"},{"en":"Nonvintage sparkling wine is often more consistent than a single-vintage bottle.","zh":"非年份起泡酒通常比年份酒更稳定一致。"},{"en":"The label says “NV,” which means nonvintage.","zh":"酒标上写着“NV”，意思是非年份。"}]}],"synonyms":["NV","non-vintage","multi-vintage","blended"],"phonetic":"/ˌnɑnˈvɪn.tɪdʒ/","extraExplanation":["在香槟区，“nonvintage（NV）”非常常见：酒庄会把不同年份的基酒调配，并加入一部分“储备酒（reserve wines）”，以维持固定的风格与品质，而不是让每个年份的气候差异决定风味。","“Vintage（年份香槟）”通常只在被认为特别优秀的年份才会推出，并且往往需要更长时间陈年；NV更强调“酒庄风格（house style）”与稳定性。","写法上也常见连字符：non-vintage；酒标和酒评里常用缩写“NV”。"]}
{"word":"nonviolability","summary":{"en":"Nonviolability means the quality of being inviolable—something that cannot or must not be violated or interfered with.","zh":"nonviolability 指“不可侵犯性/不可破坏性”，强调某事物不能或不应被侵犯、违反或干涉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being impossible (or not allowed) to violate, break, or interfere with; inviolability.","zh":"不可侵犯性；不可破坏性（指不能或不应被侵犯、破坏或干涉的状态）。"},"examples":[{"en":"The constitution guarantees the nonviolability of personal freedom.","zh":"宪法保障人身自由的不可侵犯性。"},{"en":"They argued for the nonviolability of medical confidentiality.","zh":"他们主张医疗保密的不可侵犯性。"}]}],"synonyms":["inviolability","sanctity","inviolateness","untouchability"],"phonetic":"/ˌnɑnˌvaɪələˈbɪləti/","extraExplanation":["“nonviolability”在现代英语中比较少见，更常用的对应词是“inviolability”。在正式或法律语境里，你也会看到类似表达：the inviolability of human rights（人权不可侵犯）。","构词上：non-（否定前缀）+ violable（可被侵犯/可被破坏的）+ -ity（名词后缀）。相关词：violate（侵犯/违反）、violation（侵害/违规）。"]}
{"word":"nonviolable","summary":{"en":"Nonviolable means “not protected as absolute”—something that can be violated or overridden.","zh":"nonviolable 意为“非不可侵犯的、并非绝对受保护的”，指可能被侵犯或被例外推翻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not inviolable; able to be broken, violated, or not fully protected from being violated.","zh":"非不可侵犯的；可能被破坏、违反，或并非完全受保护而不被侵犯的。"},"examples":[{"en":"In that system, privacy was treated as nonviolable and could be overridden for “security.”","zh":"在那个制度下，隐私被视为非不可侵犯的，并可能因“安全”而被推翻。"},{"en":"The court ruled that the rule was nonviolable under certain emergency conditions.","zh":"法院裁定，在某些紧急情况下该规则并非不可违反。"}]}],"synonyms":["violable","breakable","not absolute","subject to exceptions"],"phonetic":"/ˌnɑnˈvaɪələbl̩/","extraExplanation":["“nonviolable”在现代英语中比较少见，更多时候人们会直接用更常见的反义词表达，比如：not inviolable（并非不可侵犯的）、not absolute（不是绝对的）、subject to exceptions（有例外）。","构词上，non- 表示“非/不”，violable 来自 violate（违反、侵犯），因此字面意思就是“可以被侵犯/可以被违反的”。在法律、政策、伦理讨论中偶尔会用来强调“权利或原则并非绝对”。"]}
{"word":"nonviolableness","summary":{"en":"Nonviolableness means the quality of being impossible or not permitted to violate or infringe.","zh":"nonviolableness 指“不可被侵犯、不可被违背或破坏”的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being nonviolable (not allowed to be violated, broken, or infringed)","zh":"不可侵犯性；不可违背（或破坏）的性质"},"examples":[{"en":"The constitution protects the nonviolableness of basic human rights.","zh":"宪法保护基本人权的不可侵犯性。"},{"en":"They argued for the nonviolableness of the treaty’s terms.","zh":"他们主张该条约条款不可被违背。"}]}],"synonyms":["inviolability","sanctity","untouchability"],"phonetic":"/ˌnɑnˈvaɪələbəlnəs/","extraExplanation":["“nonviolableness”非常少见，更常用的对应名词是“inviolability”（不可侵犯性）或“sanctity”（神圣不可侵犯）。在法律、政治或伦理语境中会更容易见到类似表达。","词形结构：non-（不、非）+ violable（可被违反/侵犯的）+ -ness（名词后缀，表示“……的性质/状态”）。"]}
{"word":"nonviolably","summary":{"en":"Nonviolably means “in a nonviolent way; without using force.” It is rare in modern English.","zh":"nonviolably 意为“以非暴力方式；不使用武力地”。在现代英语中较少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a nonviolent way; without using physical force or causing harm","zh":"以非暴力的方式；不使用武力或不造成伤害地"},"examples":[{"en":"The protesters tried to respond nonviolably, even when they were provoked.","zh":"即使被挑衅，抗议者也尽量以非暴力的方式回应。"},{"en":"They worked nonviolably to resolve the conflict through dialogue.","zh":"他们以非暴力方式通过对话来解决冲突。"}]}],"synonyms":["nonviolently","peacefully","without violence"],"phonetic":"/ˌnɑnˈvaɪələbli/","extraExplanation":["“nonviolably”非常少见，在现代英语里通常用更常见的“nonviolently /ˌnɑnˈvaɪələntli/”或“peacefully”。如果你是在文章或法律/历史文本里看到它，意思一般仍是“非暴力地”。","注意不要和“inviolably”（不可侵犯地；绝对遵守地）混淆：两者拼写相近，但含义不同。"]}
{"word":"nonviolation","summary":{"en":"Nonviolation means that no rule, law, or agreement has been broken.","zh":"Nonviolation 指没有违反规则、法律或协议（即未发生违规）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or fact of not violating a rule, law, agreement, or standard; a situation in which no violation has occurred","zh":"不违反（规则/法律/协议/标准）的状态或事实；未发生违规的情况"},"examples":[{"en":"The inspection report concluded that the factory was in nonviolation of safety rules.","zh":"检查报告认定该工厂未违反安全规定。"},{"en":"They provided documents to show nonviolation of the contract terms.","zh":"他们提供文件证明没有违反合同条款。"}]}],"synonyms":["compliance","no violation","observance","adherence"],"phonetic":"/ˌnɑnvaɪəˈleɪʃən/","extraExplanation":["“nonviolation”在日常英语中不算常见，更常见的表达是“no violation”“not in violation (of ...)”或“compliance（合规）”。在法律、监管、审计、合规文件里更容易见到它。","写法上有时也会见到“non-violation（加连字符）”。两种写法含义基本一致，具体取决于机构/文书的写作规范。"]}
{"word":"nonviolative","summary":{"en":"Nonviolative means “not in violation; compliant,” often used in formal/legal contexts.","zh":"nonviolative 指“未违反、合规”，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not violating a rule, law, agreement, or someone’s rights; in compliance.","zh":"不违反（规则、法律、协议或他人权利）的；合规的。"},"examples":[{"en":"The company said the new policy is nonviolative of privacy laws.","zh":"公司表示新政策不违反隐私法。"},{"en":"We need a nonviolative solution that respects both sides’ rights.","zh":"我们需要一个不侵权、同时尊重双方权利的解决方案。"}]}],"synonyms":["compliant","lawful","not in violation","noninfringing"],"phonetic":"/ˌnɑnˈvaɪələtɪv/","extraExplanation":["“nonviolative”较少用于日常口语，更常见于法律、政策、合规、学术写作中，用来强调“没有违反/不构成侵害”。日常表达里常用“not in violation of / compliant with / not infringing”。","构词：non-（不）+ violative（违反的/侵害的）。其中“violative”本身也偏正式。"]}
{"word":"nonviolence","summary":{"en":"Nonviolence means using peaceful methods—not physical force—to reach goals or create change.","zh":"nonviolence 指用和平方式而非武力来达成目标或推动改变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or belief of achieving social or political change without using physical force or harm","zh":"非暴力；主张或实践在不使用暴力伤害的情况下推动社会或政治改变"},"examples":[{"en":"They organized a march based on nonviolence.","zh":"他们组织了一场以非暴力为原则的游行。"},{"en":"Nonviolence can include protests, boycotts, and civil disobedience.","zh":"非暴力可以包括抗议、抵制和公民不服从。"},{"en":"She studied how nonviolence influenced the civil rights movement.","zh":"她研究了非暴力如何影响民权运动。"}]}],"synonyms":["peacefulness","pacifism","nonviolent resistance"],"phonetic":"/nɑnˈvaɪələns/","extraExplanation":["“Nonviolence”常与20世纪社会运动相关联，尤其是甘地（Mahatma Gandhi）提出的“以非暴力争取正义”的思想，以及马丁·路德·金（Martin Luther King Jr.）在美国民权运动中的实践。它强调的是手段与目的的一致：追求公正时也尽量不造成伤害。","在英语里，“non-”是否定前缀（表示“不/非”），加在“violence（暴力）”前形成“nonviolence（非暴力）”。也常见写法“non-violence”（带连字符），但现代用法多写作一个词。","相关表达：nonviolent resistance（非暴力抵抗）、peaceful protest（和平抗议）、civil disobedience（公民不服从）。注意：nonviolence 不等于“什么都不做”，而是指“积极但不使用暴力”的行动方式。"]}
{"word":"nonviolences","summary":{"en":"Nonviolence means refusing to use violence, especially as a moral or political strategy, and it can also mean a peaceful, violence-free condition.","zh":"Nonviolence 指“非暴力”，既可指以非暴力作为道德或政治策略，也可指无暴力、和平的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the principle or practice of achieving goals without using physical force, harm, or threats (often linked to social or political protest)","zh":"非暴力；不使用武力、伤害或威胁来达成目标的原则或实践（常与社会/政治抗议相关）"},"examples":[{"en":"The movement was built on nonviolence and civil disobedience.","zh":"这场运动以非暴力和公民不服从为基础。"},{"en":"She believes nonviolence is the most powerful response to oppression.","zh":"她认为非暴力是对压迫最有力量的回应。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being free from violence; peace and safety in a place or situation","zh":"无暴力状态；和平与安全的状态"},"examples":[{"en":"After months of conflict, the community hoped for nonviolence in the streets.","zh":"经历数月冲突后，社区希望街头恢复无暴力的状态。"},{"en":"Schools work hard to create a culture of nonviolence.","zh":"学校努力营造一种无暴力的文化。"}]}],"synonyms":["peacefulness","pacifism","nonviolent resistance","peaceable protest"],"phonetic":"/nɑnˈvaɪələns/","extraExplanation":["“nonviolence”通常是不可数名词；你输入的“nonviolences”在现代英语里较少见。若要表达“多种非暴力方式/传统”，更常说 “forms of nonviolence / nonviolent approaches”。","在文化与历史语境中，“nonviolence”常与甘地（Gandhi）的“ahimsa（不害）”理念，以及马丁·路德·金（Martin Luther King Jr.）的非暴力抗争联系在一起；它强调纪律、道德诉求与集体行动，而不仅仅是“不打架”。"]}
{"word":"nonviolent","summary":{"en":"Nonviolent means peaceful and not using physical force; it can also describe peaceful methods of resistance to create change.","zh":"nonviolent 指不使用暴力、和平的；也可指用和平方式进行抵抗或推动改变的做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not using physical force to hurt people; peaceful.","zh":"不使用暴力的；和平的。"},"examples":[{"en":"The protest was nonviolent, with people singing and holding signs.","zh":"这场抗议是非暴力的，人们唱歌并举着标语。"},{"en":"They chose nonviolent methods to solve the conflict.","zh":"他们选择用非暴力的方式来解决冲突。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using peaceful actions (such as refusing to cooperate) to oppose injustice or bring social change.","zh":"（为反对不公或推动社会改变而）采取非暴力手段的。"},"examples":[{"en":"Nonviolent resistance helped the movement gain broad support.","zh":"非暴力抵抗帮助这场运动赢得了广泛支持。"},{"en":"She wrote about nonviolent civil disobedience.","zh":"她写到了非暴力的公民不服从。"}]}],"synonyms":["peaceful","nonaggressive","pacific"],"phonetic":"/ˌnɑnˈvaɪələnt/","extraExplanation":["“nonviolent”由前缀 non-（不、非）+ violent（暴力的）构成，常见搭配有 nonviolent protest（非暴力抗议）、nonviolent resistance（非暴力抵抗）、nonviolent communication（非暴力沟通，亦指一种沟通方法）。","在社会运动语境中，它常与 Gandhi（甘地）和 Martin Luther King Jr.（马丁·路德·金）等倡导的“以和平方式争取权利”的理念相关。"]}
{"word":"nonviolently","summary":{"en":"“Nonviolently” means “peacefully, without using violence.”","zh":"“nonviolently”表示“以非暴力、和平的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not use physical force, harm, or aggression; peacefully.","zh":"以非暴力的方式；不使用武力、伤害或侵略；和平地。"},"examples":[{"en":"The protesters marched nonviolently through the city.","zh":"抗议者以非暴力的方式穿过城市游行。"},{"en":"He tried to resolve the conflict nonviolently by talking and listening.","zh":"他试图通过交谈和倾听来以非暴力方式解决冲突。"},{"en":"The movement encouraged people to resist nonviolently.","zh":"该运动鼓励人们以非暴力方式进行抵抗。"}]}],"synonyms":["peacefully","without violence","non-aggressively"],"phonetic":"/ˌnɑnˈvaɪələntli/","extraExplanation":["“non-”是英语里常见的否定前缀，表示“非……、不……”。因此 nonviolent（非暴力的）+ -ly（副词后缀）= nonviolently（以非暴力的方式）。","这个词常见于社会运动与政治语境，尤其与“nonviolent resistance（非暴力抵抗）”相关；在英语文化里也常与马丁·路德·金（Martin Luther King Jr.）等倡导的公民权利运动理念一起出现。"]}
{"word":"nonviral","summary":{"en":"Nonviral means not caused by a virus, or (online) not spreading widely like viral content.","zh":"nonviral 指“非病毒性的”，也可指（网络内容）“没有爆红、未广泛传播的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not caused by a virus; not involving a viral infection","zh":"非病毒性的；不是由病毒引起的"},"examples":[{"en":"The doctor said the rash was nonviral, so antibiotics weren’t needed.","zh":"医生说这种皮疹是非病毒性的，所以不需要用抗生素。"},{"en":"Most sore throats are nonviral and get better with rest and fluids.","zh":"大多数喉咙痛并非病毒引起，休息和补充水分就会好转。"}]},{"partOfSpeech":"adj.","definition":{"en":"(online/media) not spreading widely or quickly on the internet; not “going viral”","zh":"（网络/媒体）没有在网上迅速走红的；未“爆红/未病毒式传播”的"},"examples":[{"en":"Her post was helpful but nonviral, with only a few shares.","zh":"她的帖子很有帮助，但没有爆红，分享量不多。"},{"en":"We’re aiming for steady engagement, not a one-time nonviral campaign.","zh":"我们追求稳定的互动，而不是一次性却没爆红的活动。"}]}],"synonyms":["noninfectious","not viral","non-contagious (sometimes, depending on context)","not going viral","low-profile (online)"],"phonetic":"/nɑnˈvaɪrəl/","extraExplanation":["“non-”是英语里很常见的前缀，表示“非、不、没有”。“nonviral”在医学语境里通常指“不是病毒导致的”；在社交媒体语境里则是从“viral（爆红的）”引申出来，表示“没有传播开”。","医学上区分“viral / bacterial / nonviral”很重要：不同原因的感染/炎症处理方式可能不同；不过具体诊断仍应以医生判断为准。"]}
{"word":"nonvirginal","summary":{"en":"Nonvirginal means not virginal—either not a virgin (literal) or not innocent/untouched (figurative).","zh":"nonvirginal 意为“非处女的／非处子的”，也可比喻为“不再天真纯洁的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not virginal; (of a person) not a virgin.","zh":"非处女的／非处子的；（指人）已非处女／已非处子。"},"examples":[{"en":"The novel describes her as nonvirginal before marriage, which was controversial in that era.","zh":"小说写她在婚前已非处女，在那个年代这很有争议。"},{"en":"He felt pressure about being nonvirginal in a community with strict expectations.","zh":"在一个要求严格的社群里，他因自己已非处子而感到压力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, less common) Not innocent, pure, or untouched by experience.","zh":"（比喻义，较少见）不再天真纯洁的；不再“未经世事”的。"},"examples":[{"en":"After years of conflict, the city no longer felt virginal—its streets were nonvirginal with history.","zh":"经历多年冲突后，这座城市不再像“处子”般纯净——街道被历史磨得不再天真。"},{"en":"The film gives a nonvirginal view of fame, showing its darker side.","zh":"这部电影用不再天真的角度看待名声，呈现了它阴暗的一面。"}]}],"synonyms":["not a virgin","sexually experienced","non-innocent","worldly"],"phonetic":"ˌnɑnˈvɝdʒənəl","extraExplanation":["“nonvirginal”由前缀 non-（不、非）+ virginal（处女的／纯洁的）构成。它多见于较正式或文学语境；日常英语里更常用 not a virgin 或 sexually experienced。","这个词在涉及性经历时可能带有价值评判或让人不适的语感。写作或交流时可根据语境选择更中性、更尊重当事人的表达。"]}
{"word":"nonvirginally","summary":{"en":"“Nonvirginally” means “in a not-virginal way,” i.e., after someone has had sexual experience.","zh":"“nonvirginally”指“以非童贞/非处女的方式”，即在已有性经验之后。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not virginal; after someone has had sexual experience (not a virgin).","zh":"以非处女/非童贞的方式；指在已有性经验、已非处女（或非童贞）之后。"},"examples":[{"en":"She said she began dating again nonvirginally, with more confidence and clearer boundaries.","zh":"她说自己在不再是处女之后又开始约会，更自信，也更清楚自己的界限。"},{"en":"The memoir describes growing up and learning about intimacy nonvirginally, without romanticizing it.","zh":"这本回忆录写到她长大后以不再童贞的状态理解亲密关系，并没有把它浪漫化。"}]}],"synonyms":["not virginally","after becoming sexually active","in a sexually experienced way"],"phonetic":"nɑnˈvɝdʒɪnəli","extraExplanation":["“nonvirginally”非常少见，日常英语里更常用更中性的说法，如 “after becoming sexually active / once she wasn’t a virgin anymore”。","涉及性经验的话题在不同文化与语境中敏感度不同；正式写作或公共场合通常更建议使用中性、尊重隐私的表达。"]}
{"word":"nonvirile","summary":{"en":"Nonvirile means “not virile,” i.e., lacking traditional masculine vigor or male sexual characteristics (the latter sense is rarer).","zh":"nonvirile 意为“非阳刚的/不具男性性活力的”；较少见时也可指“非雄性、无雄性生殖特征”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not virile; lacking traditionally male sexual vigor, masculinity, or “manly” strength.","zh":"不具阳刚特质的；缺乏传统上被认为的男性性活力、男子气概或“阳刚力量”的。"},"examples":[{"en":"The critic described the hero as nonvirile, more thoughtful than forceful.","zh":"评论家形容这位男主角缺乏阳刚之气，更偏深思而非强势。"},{"en":"He worried the costume made him look nonvirile on stage.","zh":"他担心这套服装让他在舞台上显得不够阳刚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine, less common) Not male or not producing male reproductive cells; not characterized by male sexual function.","zh":"（生物/医学，较少见）非雄性的；不产生雄性生殖细胞的；不具雄性性功能特征的。"},"examples":[{"en":"Some insects have nonvirile forms that do not mate.","zh":"某些昆虫有不参与交配的非雄性形态。"}]}],"synonyms":["unmanly","effeminate","nonmasculine","lacking vigor"],"phonetic":"/nɑnˈvɪrəl/","extraExplanation":["“non-”是否定前缀，表示“非/不”。“virile”来自拉丁语 vir（男子），在现代英语里常带有“阳刚、性能力强、精力充沛”的含义，因此 nonvirile 常用于评价一个男性形象“不够阳刚”。使用时要注意语境与文化敏感性：它可能带有价值判断或贬义色彩，正式写作中可考虑用更中性的表达（如 not traditionally masculine / gentle / mild-mannered）。"]}
{"word":"nonvirility","summary":{"en":"Nonvirility means a lack of virility—sexual/reproductive potency or traditionally masculine vigor.","zh":"nonvirility 指缺乏 virility（性/生殖能力或传统意义上的阳刚精力）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not having virility; lack of sexual potency, reproductive ability, or traditionally “manly” vigor","zh":"非阳刚/非男子气概；缺乏性能力、生殖能力或传统意义上的“男性精力/阳刚气质”的状态"},"examples":[{"en":"The novel uses the character’s nonvirility to challenge old ideas about masculinity.","zh":"这部小说用角色的非阳刚来挑战关于男子气概的旧观念。"},{"en":"He spoke about nonvirility in a medical context, not as an insult.","zh":"他在医学语境下谈到非阳刚，而不是把它当作侮辱。"},{"en":"Some critics misread the scene as nonvirility when it is really emotional exhaustion.","zh":"一些评论者把那一幕误读为非阳刚，其实更像是情绪上的疲惫。"}]}],"synonyms":["lack of virility","impotence","infertility","lack of masculinity"],"phonetic":"/ˌnɑn.vəˈrɪl.ə.ti/","extraExplanation":["“nonvirility”比较少见，更常见的表达是“lack of virility / impotence（阳痿、无性能力）/ infertility（不育）/ lack of masculinity（缺乏阳刚气质）”。使用时要注意语境：在医学或生理讨论中较中性；在日常评价他人时可能带有贬义或伤害性。","“virility”在英语里既可指生理层面的性能力/生殖力，也常被文化上延伸为“阳刚、强壮、有冲劲”。因此“nonvirility”有时指身体问题，有时只是指不符合传统性别刻板印象。"]}
{"word":"nonvirtue","summary":{"en":"Nonvirtue means the absence of virtue—immoral qualities or actions; in Buddhist writing it often refers to unwholesome actions that lead to negative results.","zh":"Nonvirtue 指缺乏美德、指不道德的品质或行为；在佛教写作中常指会导致负面结果的不善行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of virtue; an immoral quality or action (the opposite of virtue).","zh":"缺乏美德；不道德的品质或行为（与“美德”相反）。"},"examples":[{"en":"He spoke about virtue and nonvirtue as choices people make every day.","zh":"他谈到美德与非美德是人们每天都会做出的选择。"},{"en":"In her story, nonvirtue leads the hero into trouble.","zh":"在她的故事里，非美德把英雄引向麻烦。"}]},{"partOfSpeech":"n.","definition":{"en":"(In Buddhist contexts) unwholesome or harmful actions of body, speech, or mind that create negative results.","zh":"（佛教语境）身、口、意的不善/有害行为，会带来负面结果。"},"examples":[{"en":"The teacher explained how nonvirtue can arise from anger or greed.","zh":"老师解释了非美德如何从愤怒或贪欲中生起。"},{"en":"They practiced mindfulness to reduce nonvirtue in speech.","zh":"他们练习正念，以减少言语上的非美德。"}]}],"synonyms":["immorality","vice","wrongdoing","evil","sin (religious context)","unwholesomeness (Buddhist context)"],"phonetic":"/ˌnɑnˈvɝtʃu/","extraExplanation":["“nonvirtue”在日常英语里不算常见，更常见的写法是连字符形式“non-virtue”，或直接用“immorality / vice / wrongdoing”。","在佛教英文书写中，“nonvirtue / non-virtue”常用来翻译“非善、不善（业）”，并常与“virtue（善）”成对出现。"]}
{"word":"nonvirtuous","summary":{"en":"“Nonvirtuous” means not morally good (immoral) or, more broadly, lacking admirable qualities.","zh":"“nonvirtuous”指“不道德的/不高尚的”，也可泛指“缺乏优点、不怎么可取的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not virtuous; lacking moral goodness or integrity; immoral.","zh":"不道德的；不高尚的；缺乏品德或正直的；不贞洁的（较少见）。"},"examples":[{"en":"He admitted some nonvirtuous motives for helping: he wanted attention.","zh":"他承认自己帮忙也有一些不那么高尚的动机：他想得到关注。"},{"en":"The novel shows how ordinary people can make nonvirtuous choices under pressure.","zh":"这部小说展现了普通人在压力下也可能做出不道德的选择。"},{"en":"She warned that gossip can come from nonvirtuous intentions.","zh":"她提醒说，流言蜚语往往源于不善的意图。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not excellent or admirable in quality; not possessing a “virtue” (a strong or valuable feature).","zh":"（事物）不具优点的；不怎么可取的；缺乏“优点/长处”的。"},"examples":[{"en":"The plan has many nonvirtuous features, like high cost and unclear goals.","zh":"这个计划有很多不理想的地方，比如成本高、目标不清。"},{"en":"Speed is a virtue in emergencies, but it can be nonvirtuous in careful research.","zh":"速度在紧急情况下是优点，但在严谨的研究中可能反而不合适。"}]}],"synonyms":["immoral","unethical","dishonorable","corrupt","depraved","unscrupulous","unprincipled"],"phonetic":"/nɑnˈvɝtʃuəs/","extraExplanation":["“nonvirtuous”= non-（不、非）+ virtuous（有德行的）。语气偏正式，常用于讨论道德、动机、行为选择等场景。","在较旧或更保守的语境里，virtuous / nonvirtuous 有时与“贞洁/不贞洁”相关；现代写作中更常指一般意义上的“道德/不道德”。"]}
{"word":"nonvirtuously","summary":{"en":"“Nonvirtuously” means “in an immoral or not-virtuous way,” often used in formal writing; in older literature it can also imply sexual ‘unvirtuousness.’","zh":"nonvirtuously 指“以不道德/不合美德的方式”，多见于较正式的书面语；在较旧文学中也可能含“性道德上不贞”的旧式含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not virtuous; immorally or without moral integrity.","zh":"以不道德的方式；不合美德地；缺乏道德操守地。"},"examples":[{"en":"He acted nonvirtuously by lying to protect his reputation.","zh":"他为了维护名声而撒谎，这种行为是不道德的。"},{"en":"The novel shows how power can be used nonvirtuously when no one is held accountable.","zh":"这部小说展现了当无人追责时，权力可能被不道德地使用。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Older/literary) In a way that is sexually “unvirtuous,” especially implying a lack of chastity.","zh":"（较旧/文学用法）以“不贞洁/不守贞”的方式；含性道德层面的贬义。"},"examples":[{"en":"In older texts, a woman might be judged harshly if she was described as behaving nonvirtuously.","zh":"在较早的文本中，如果说一位女性举止“nonvirtuously”，往往会受到严厉评判。"}]}],"synonyms":["immorally","unethically","wrongly","without integrity","sinfully"],"phonetic":"/nɑnˈvɝtʃuəsli/","extraExplanation":["这个词由 non-（否定前缀）+ virtuously（有德行地）构成，语感偏正式、书面，日常口语更常用 immorally、unethically、wrongly。","在一些旧文学/历史语境中，virtuous / virtue 也可能特指“女性贞洁”，因此 nonvirtuously 有时会带有过时且带评判色彩的性道德含义；现代写作中建议谨慎使用并明确语境。"]}
{"word":"nonvirtuousness","summary":{"en":"Nonvirtuousness means a lack of virtue—being morally bad or not ethically good.","zh":"Nonvirtuousness 指“缺乏美德/不道德”的状态或品质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being virtuous; lack of moral goodness; immorality","zh":"不道德；缺乏美德；邪恶（的品质）"},"examples":[{"en":"The novel explores human weakness and nonvirtuousness in a corrupt society.","zh":"这部小说探讨了腐败社会中人性的软弱与不道德。"},{"en":"He admitted his nonvirtuousness and promised to change his behavior.","zh":"他承认自己不够正直，并承诺改变行为。"}]}],"synonyms":["immorality","vice","depravity","lack of virtue","moral corruption"],"phonetic":"/ˌnɑnˈvɝtʃuəsnəs/","extraExplanation":["“nonvirtuousness”由 non-（否定前缀）+ virtuous（有美德的）+ -ness（名词后缀）构成，字面意思是“没有美德的状态”。在现代英语中更常见、也更自然的表达通常是“immorality”“lack of virtue”或“vice”。","“virtue / vice（美德/恶习）”这组词在宗教、哲学与文学语境中常见（例如讨论“virtue ethics 美德伦理学”或用来刻画人物的道德堕落），因此该词更偏正式、书面。"]}
{"word":"nonvirulent","summary":{"en":"“Nonvirulent” describes something (especially a microbe or disease) that is not highly harmful or severe.","zh":"“Nonvirulent”指（尤指微生物或疾病）毒力不强、致病性不高或不严重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not virulent; not highly infectious, harmful, or severe (especially of a microorganism or disease).","zh":"不具强毒力的；不高度传染或不严重的（尤指微生物或疾病）。"},"examples":[{"en":"The lab used a nonvirulent strain of the virus for training.","zh":"实验室使用了一种无强毒力的病毒株进行培训。"},{"en":"In healthy adults, the infection is usually nonvirulent and clears quickly.","zh":"在健康的成年人中，这种感染通常不严重，并会很快痊愈。"}]}],"synonyms":["avirulent","mild","low-pathogenic"],"phonetic":"/ˌnɑnˈvɪrjələnt/","extraExplanation":["词源上，virulent 来自拉丁语，原意与“毒液/毒性”有关，所以 nonvirulent 常用于医学、微生物学语境，强调“毒力弱、致病性低”。","与 harmless（无害的）不同，nonvirulent 只是表示“不强毒/不严重”，仍可能引起轻微症状或在免疫力低下者中造成问题。"]}
{"word":"nonvirulently","summary":{"en":"“Nonvirulently” means “not virulently”—in a way that is not highly harmful, infectious, or hostile.","zh":"“nonvirulently”意为“并非强毒性/并非恶毒地”——以不高度有害、不强致病或不强烈敌对的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not virulent; without being highly infectious, severely harmful, or intensely hostile.","zh":"以不具强毒性（不高度致病/不强烈有害/不激烈敌对）的方式；不恶毒地。"},"examples":[{"en":"The virus appeared to spread, but nonvirulently, causing only mild symptoms in most patients.","zh":"这种病毒似乎会传播，但毒性不强，大多数患者只有轻微症状。"},{"en":"He criticized the policy firmly but nonvirulently, avoiding personal attacks.","zh":"他对该政策批评得很坚定，但并不恶毒，避免了人身攻击。"}]}],"synonyms":["mildly","benignly","gently","without hostility","nonaggressively"],"phonetic":"/ˌnɑnˈvɪrələntli/","extraExplanation":["“nonvirulently”由前缀 non-（不、非）+ virulent（毒性强的；恶毒的）+ -ly（副词后缀）构成，属于较少见、偏书面或学术语境的用法。","在医学/生物学语境中，virulent 多指“致病性强”；在日常或写作语境中，也可指“言辞恶毒、充满敌意”。因此 nonvirulently 可以用于“病原体不强毒性地”或“批评不恶毒地”这两类表达。"]}
{"word":"nonviruliferous","summary":{"en":"“Nonviruliferous” describes an organism (often an insect vector) that does not carry a virus and therefore cannot transmit it.","zh":"nonviruliferous 指（常为昆虫媒介）不携带病毒、因此不能传播病毒的个体/群体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not carrying a virus; not infected or not able to transmit a virus (especially said of insects like aphids or mosquitoes in plant/animal disease studies).","zh":"不带病毒的；未感染病毒的；（尤指昆虫等媒介）不携带、不能传播病毒的。"},"examples":[{"en":"The researchers released nonviruliferous aphids as a control group.","zh":"研究人员释放了不带病毒的蚜虫作为对照组。"},{"en":"Plants exposed to nonviruliferous insects did not develop symptoms.","zh":"暴露在不带病毒昆虫环境中的植物没有出现病症。"},{"en":"Keep viruliferous and nonviruliferous mosquitoes in separate cages.","zh":"把带病毒和不带病毒的蚊子分开关在不同笼子里。"}]}],"synonyms":["virus-free","uninfected","noninfective","avirulent (context-dependent)"],"phonetic":"/ˌnɑnˌvɪr.jəˈlɪf.ɚ.əs/","extraExplanation":["这个词多用于农业、植物病理学、昆虫学和流行病学论文中，常与 viruliferous（带病毒的）成对出现，用来区分“携带病毒的媒介昆虫/个体”和“未携带病毒的对照”。","构词法：non-（不、非）+ viruliferous（携带病毒的）。其中 viruliferous 来自拉丁语词根，字面含义接近“携带毒/病毒”。"]}
{"word":"nonvisaed","summary":{"en":"“Nonvisaed” means “without a visa; not visaed/stamped with a visa.”","zh":"“nonvisaed”表示“未持签证的；未加签证（未盖签证章）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not having a visa (not issued with or stamped by a visa), especially referring to a passport, traveler, or document","zh":"未持有签证的；未加签证（未签发或未盖签证章）的（尤指护照、旅客或文件）"},"examples":[{"en":"Nonvisaed travelers may be denied boarding at the airport.","zh":"未持签证的旅客可能会在机场被拒绝登机。"},{"en":"Your passport is nonvisaed for that country, so you must apply before you go.","zh":"你的护照对那个国家尚未加签，因此出发前必须先申请签证。"}]}],"synonyms":["without a visa","lacking a visa","not visaed","unvisaed"],"phonetic":"/ˌnɑnˈviːzəd/","extraExplanation":["“nonvisaed”不是很常见的标准词，更常见的说法是“without a visa / lacking a visa / not visaed / unvisaed”。在正式文件或航空公司规定里，通常会直接写“must have a valid visa”。","拼写上也可能是把“non-visaed（非加签的）”连写成一个词；如果你是在某份表格/系统里看到它，建议对照上下文确认它指的是“没有签证”还是“没有被签注/盖章”。"]}
{"word":"nonvisceral","summary":{"en":"“Nonvisceral” means not driven by gut feelings—more calm, rational, or detached; it can also mean avoiding graphic bodily imagery.","zh":"“nonvisceral”指不凭本能情绪反应、较理性克制；也可指避免直白生理/身体冲击性描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not visceral; not based on strong instinctive feelings or gut reactions; more rational or detached.","zh":"非本能的；不凭“直觉/本能反应”的；较理性、克制或疏离的。"},"examples":[{"en":"Her response to the news was calm and nonvisceral, focused on facts rather than emotion.","zh":"她对这个消息的反应很冷静、非本能化，更关注事实而不是情绪。"},{"en":"The film aims for a nonvisceral tone, inviting reflection instead of shock.","zh":"这部电影追求一种非冲击性的基调，让观众思考而不是被震撼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language or style) Not graphic or bodily; avoiding vivid references to physical sensation or internal organs.","zh":"（指语言/风格）不具强烈“身体感”的；避免直白描写生理感受或内脏意象的。"},"examples":[{"en":"The doctor gave a nonvisceral explanation so the patient wouldn’t feel scared.","zh":"医生用不那么“身体化/血腥”的方式解释，避免让病人害怕。"},{"en":"He prefers nonvisceral descriptions in his writing.","zh":"他写作时更喜欢不那么生理化、冲击性的描写。"}]}],"synonyms":["rational","detached","dispassionate","unemotional","clinical","restrained"],"phonetic":"/ˌnɑnˈvɪsərəl/","extraExplanation":["“non-”是常见前缀，表示“非、不”。“visceral”原意与“内脏”有关，引申为“发自本能、直击情绪的”。因此“nonvisceral”多用于对比：非本能冲动，而是更理性、冷静、保持距离。","这个词在日常口语中不算常见，更常见的替换说法有：“not visceral / not emotional / more rational / detached”。"]}
{"word":"nonviscid","summary":{"en":"Nonviscid means “not viscous”—a fluid that flows easily without thickness or stickiness.","zh":"nonviscid 指“非黏稠的/非黏性的”，形容流体黏度很低、容易流动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not viscous; having little or no thickness or stickiness, so it flows easily (often used in science/engineering).","zh":"非黏性的；不黏稠的；（常用于理工科）黏度很低、流动性强的。"},"examples":[{"en":"Engineers often treat air as a nonviscid fluid in simplified models.","zh":"在简化模型中，工程师常把空气视为非黏性流体。"},{"en":"A nonviscid liquid would flow quickly and not feel sticky.","zh":"非黏性的液体会流得很快，摸起来也不会发黏。"}]}],"synonyms":["nonviscous","inviscid","low-viscosity"],"phonetic":"/nɑnˈvɪsɪd/","extraExplanation":["“nonviscid”是较少见、偏学术/技术的词；更常见的说法是“nonviscous”。","在流体力学里，“nonviscid (inviscid)”常用于理想化假设：忽略黏性（viscosity），以便更容易计算，但真实流体通常仍有一定黏性。"]}
{"word":"nonviscidity","summary":{"en":"Nonviscidity means low viscosity—being not thick or sticky, so it flows easily.","zh":"nonviscidity 指低黏度、不黏稠，因而更容易流动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of not being viscous; low viscosity; free-flowingness","zh":"不黏稠性；低黏度；流动性强的状态"},"examples":[{"en":"The oil’s nonviscidity at low temperatures helps the engine start smoothly.","zh":"这种机油在低温下的不黏稠性有助于发动机顺利启动。"},{"en":"Water is often used as a reference for nonviscidity because it flows easily.","zh":"水常被用来说明“不黏稠性”，因为它流动性很强。"}]}],"synonyms":["low viscosity","fluidity","thinness"],"phonetic":"/ˌnɑn vɪˈsɪdəti/","extraExplanation":["“nonviscidity”是较少见的学术/技术用词，多出现在流体力学、化学或材料科学语境中。日常英语里更常说“low viscosity（低黏度）”或用形容词“thin / runny（稀、易流动）”。","词形结构：non-（不、非）+ viscidity（黏稠性，源自viscous“黏稠的”）。在写作中常与“viscosity（黏度）”互换讨论，但严格来说，viscosity更偏向可测量的物理量。"]}
{"word":"nonviscidly","summary":{"en":"“Nonviscidly” means “in a not-sticky, not-viscous way.”","zh":"“nonviscidly”表示“以不黏稠、无明显黏度的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not viscid (not sticky, not thick or syrupy); without noticeable viscosity.","zh":"以不黏稠（不黏、不稠、非糖浆状）的方式；无明显黏度地。"},"examples":[{"en":"The solution flowed nonviscidly through the tube.","zh":"该溶液以不黏稠的状态流过管道。"},{"en":"After heating, the oil poured more nonviscidly than before.","zh":"加热后，这种油比之前更不黏稠、更容易倒出。"}]}],"synonyms":["with low viscosity","not viscously","fluidly","runny (informal)"],"phonetic":"/nɑnˈvɪsɪdli/","extraExplanation":["“nonviscidly”非常少见，多出现在科学/工程写作中，用来强调“流动时不黏、不稠”。更常见的表达是：“with low viscosity（低黏度地）”“not viscous（不黏稠）”“runny（很稀，易流动）”。","词根提示：viscid/viscous 指“黏稠的”，-ly 变成副词表示“以……方式”。前缀 non- 表示“非、不”。"]}
{"word":"nonviscidness","summary":{"en":"Nonviscidness means the lack of viscosity—being not thick or sticky, especially in fluids.","zh":"nonviscidness 指“缺乏黏度”的性质，即液体不黏稠、不粘、流动阻力小。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being viscous; having little or no thickness or stickiness in a fluid (lack of viscosity)","zh":"不黏稠性；低黏度（指液体几乎不稠、不黏、阻力很小的性质）"},"examples":[{"en":"Engineers sometimes assume nonviscidness when they model ideal fluid flow.","zh":"工程师在建立理想流体模型时，有时会假设流体具有不黏稠性。"},{"en":"The nonviscidness of the liquid made it spread quickly across the surface.","zh":"这种液体的不黏稠性使它很快在表面铺展开来。"}]}],"synonyms":["low viscosity","fluidity","nonviscosity"],"phonetic":"/ˌnɑnˈvɪsɪdnəs/","extraExplanation":["“nonviscidness”较少见，更常见的表达是“low viscosity（低黏度）”或“nonviscous flow（无黏性流动）”。在流体力学里，“nonviscid”常用来描述“忽略黏性”的理想化情况（如无黏流/势流），并不一定意味着现实中黏度真正为零。"]}
{"word":"nonviscous","summary":{"en":"Nonviscous describes a fluid that is not thick or sticky and flows easily.","zh":"Nonviscous 用来形容液体不黏稠、流动性强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a fluid) having little or no viscosity; flowing easily and not thick or sticky.","zh":"（指流体）低黏度的；不黏稠的；流动性很强的。"},"examples":[{"en":"Water is mostly nonviscous compared with honey.","zh":"与蜂蜜相比，水基本上是不黏稠的。"},{"en":"A nonviscous liquid spreads quickly across a flat surface.","zh":"不黏稠的液体会很快在平面上铺开。"},{"en":"In this experiment, we used a nonviscous solution so it could flow through the tube easily.","zh":"在这个实验中，我们使用了低黏度溶液，这样它就能轻松流过管子。"}]}],"synonyms":["low-viscosity","thin","runny","watery"],"phonetic":"/nɑnˈvɪskəs/","extraExplanation":["“nonviscous”由否定前缀 non-（不、非）+ viscous（黏稠的）组成，常见于科学写作（物理、化学、生物、工程）。日常英语里更常用的说法是 “thin” 或 “runny”（稀的、很容易流动的），但在正式语境下 “nonviscous”更精确。","“viscosity”是“黏度”，描述液体流动时的“内摩擦”；黏度越低，越“nonviscous”。例如水（低黏度）通常比油更“nonviscous”，而蜂蜜、糖浆属于高黏度。"]}
{"word":"nonviscously","summary":{"en":"Nonviscously means “in a way that has no viscosity,” used mainly in technical/scientific contexts.","zh":"nonviscously 指“以无黏性（无黏稠度）的方式”，主要用于科学与工程语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no viscosity (no internal friction), flowing as if the fluid has zero thickness or resistance to flow.","zh":"以“无黏性（无内摩擦）”的方式；像流体没有黏稠度、几乎不产生流动阻力那样。"},"examples":[{"en":"In the ideal model, the liquid moves nonviscously through the pipe.","zh":"在理想模型中，液体以无黏性的方式在管道中流动。"},{"en":"The simulation assumes the gas behaves nonviscously to simplify the equations.","zh":"该模拟假设气体表现为无黏性，以简化方程。"}]}],"synonyms":["inviscidly","without viscosity","without friction (in a fluid sense)"],"phonetic":"/nɑnˈvɪskəsli/","extraExplanation":["“nonviscously”主要出现在物理、工程、流体力学等技术语境里，日常英语中很少用。更常见的说法是“inviscidly”（无黏地）或“as an inviscid fluid”。","在流体力学里，“nonviscous / inviscid”通常表示一种理想化假设：忽略黏性效应，使分析更简单；现实中的水和空气都有黏性，只是有时黏性影响可以近似忽略。"]}
{"word":"nonviscousness","summary":{"en":"Nonviscousness means the state of being not thick or sticky in flow—having very low viscosity.","zh":"nonviscousness 指液体不黏稠、流动阻力很小的状态，即黏度很低。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of not being viscous; lack of thickness or “stickiness” in how a liquid flows (very low viscosity)","zh":"不黏稠性；（液体）不具黏度的状态；流动时不“稠、不粘”（黏度很低）"},"examples":[{"en":"Water has a high fluidity, and its nonviscousness makes it easy to pour.","zh":"水的流动性很强，它的不黏稠性使它很容易倒出来。"},{"en":"The lab report describes the solution’s nonviscousness compared with syrup.","zh":"实验报告描述了该溶液与糖浆相比不黏稠。"},{"en":"In cold weather, some oils lose their nonviscousness and become thicker.","zh":"在寒冷天气里，有些油会失去不黏稠性，变得更稠。"}]}],"synonyms":["low viscosity","lack of viscosity","fluidity","thinness"],"phonetic":"/ˌnɑnˈvɪskəsnəs/","extraExplanation":["“nonviscousness”在日常英语里不太常见，更常见的说法是“low viscosity（低黏度）”或直接用形容词“non-viscous / nonviscous（不黏稠的）”。","“viscosity（黏度）”常用于物理、化学、工程与烹饪等语境，用来描述液体流动的“阻力/稠度”。例如：honey（蜂蜜）viscous；water（水）non-viscous。"]}
{"word":"nonvisibilities","summary":{"en":"“Nonvisibilities” means different kinds or instances of being unseen or unnoticed.","zh":"“nonvisibilities”指“不可见/不被注意”的不同形式或多种情况（是nonvisibility的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being visible or not being noticed; invisibility or lack of public attention.","zh":"不可见的状态；不被注意到的状态；隐形、缺乏公众关注。"},"examples":[{"en":"The artist explored social nonvisibility—how some workers are essential but rarely noticed.","zh":"这位艺术家探讨了“社会不可见性”——一些工人很重要，却很少被看见或注意到。"},{"en":"Certain communities experience nonvisibility in the media, even though they are a big part of society.","zh":"某些群体在媒体中处于“不可见”状态，尽管他们是社会的重要组成部分。"},{"en":"The small print creates nonvisibility: people don’t notice the warning until it’s too late.","zh":"小字号造成“不可见”：人们往往直到太晚才注意到警告。"}]}],"synonyms":["invisibility","lack of visibility","obscurity","unnoticedness"],"phonetic":"/ˌnɑnˌvɪzəˈbɪləti/","extraExplanation":["“nonvisibilities”是名词“nonvisibility”的复数形式，但在日常英语里更常见的是单数（nonvisibility）或直接用“invisibility（隐形/不可见）”。复数常用于讨论“多种不同的不可见形式/层面”（例如：媒体、政治、职场中的不同“不可见性”）。","构词：non-（不、非）+ visibility（可见性）。在学术写作、社会学/文化研究、媒体研究中更常见。"]}
{"word":"nonvisibility","summary":{"en":"Nonvisibility means the state of not being visible, often used in formal contexts for a lack of visibility or attention.","zh":"Nonvisibility 指“不可见/缺乏可见性”的状态，常见于较正式语境，强调缺少曝光或关注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of not being visible; the quality of not being seen or noticed","zh":"不可见的状态；不被看见或不被注意到的性质"},"examples":[{"en":"The small insects survive by blending into the leaves, using nonvisibility as protection.","zh":"小昆虫通过融入叶子来生存，用“不可见性”作为保护。"},{"en":"In the report, the problem was not nonvisibility but a lack of clear information.","zh":"在报告中，问题不在于“不可见”，而是缺少清晰的信息。"},{"en":"Some communities experience nonvisibility in media coverage, meaning their stories are rarely shown.","zh":"一些群体在媒体报道中处于“不可见”状态，也就是他们的故事很少被呈现。"}]}],"synonyms":["invisibility","unseen-ness","lack of visibility","obscurity"],"phonetic":"/ˌnɑnˌvɪzəˈbɪləti/","extraExplanation":["“nonvisibility”在日常英语中不如“invisibility”常见。若指“看不见”的能力或状态（如科幻里的隐身），更常用“invisibility”。“nonvisibility”更常用于较正式或学术语境，强调“缺乏可见性/曝光度”（例如社会议题、媒体呈现、数据呈现）。"]}
{"word":"nonvisible","summary":{"en":"Nonvisible means not able to be seen.","zh":"nonvisible 指“看不见的、不可见的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be seen; not visible.","zh":"看不见的；不可见的。"},"examples":[{"en":"The ink is nonvisible under normal light but shows up under UV.","zh":"这种墨水在普通光线下看不见，但在紫外线下会显现。"},{"en":"Some damage inside the wall is nonvisible from the outside.","zh":"墙体内部的一些损坏从外面看不出来。"}]}],"synonyms":["invisible","unseen","not visible","hidden"],"phonetic":"/nɑnˈvɪzəbəl/","extraExplanation":["“nonvisible”在科技/医学/工程写作中较常见，用来强调“在某种条件下不可见”（例如普通光、肉眼观察）。日常英语里更常用“invisible”（不可见的、隐形的）。","前缀“non-”通常表示简单否定（not），语气较中性；而“in-”在“invisible”里更像一个固定搭配，日常使用频率更高。"]}
{"word":"nonvisibly","summary":{"en":"Nonvisibly means “in a way that cannot be seen; without being visible.”","zh":"nonvisibly 表示“以看不见的方式；不显眼地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that cannot be seen; without being visible.","zh":"以看不见的方式；不显眼地。"},"examples":[{"en":"The stain was treated so it faded nonvisibly over time.","zh":"污渍经过处理，随着时间推移不显眼地淡去了。"},{"en":"The cable runs nonvisibly behind the wall.","zh":"电缆在墙后看不见地铺设着。"},{"en":"She supported the team nonvisibly, doing important work in the background.","zh":"她在幕后默默支持团队，做了很多重要工作。"}]}],"synonyms":["invisibly","out of sight","unseen","not visibly","in the background"],"phonetic":"/nɑnˈvɪzəbli/","extraExplanation":["“nonvisibly”由 non-（不、非）+ visibly（明显地、看得见地）构成，意思就是“不是以可见的方式”。写作时也可能见到连字符形式 non-visibly。","它常用于描述“结果/过程不显眼”（如修复、隐藏、布线）或“默默地、不张扬地”（类似 in the background），但语气比“secretly（秘密地）”更中性，强调“看不见/不显眼”，不一定有刻意隐瞒。"]}
{"word":"nonvisional","summary":{"en":"Nonvisional means “non-visual”: not related to sight or not relying on visual information.","zh":"nonvisional 意为“非视觉的（non-visual/nonvisual）”：与视力无关或不依赖视觉信息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to seeing; not based on visual information (often written as “nonvisual”).","zh":"与视觉无关的；不依赖视觉信息的（更常写作 nonvisual）。"},"examples":[{"en":"The app includes nonvisional cues like sound and vibration to help users navigate.","zh":"这个应用加入了声音和震动等非视觉提示，帮助用户导航。"},{"en":"She prefers nonvisional learning methods, such as listening to audiobooks.","zh":"她更喜欢非视觉的学习方式，比如听有声书。"}]}],"synonyms":["nonvisual","non-visual","not visual","auditory (in some contexts)","tactile (in some contexts)"],"phonetic":"/nɑnˈvɪʒənəl/","extraExplanation":["“nonvisional”在现代英语中比较少见，很多情况下是把“non-visual（非视觉的）”写成了另一种形式。学术或科技写作里更常用“nonvisual / non-visual”。","在无障碍（accessibility）语境中，“nonvisual”常用来描述为盲人或低视力用户设计的交互方式，例如屏幕阅读器、触觉反馈、语音提示等。"]}
{"word":"nonvisionary","summary":{"en":"“Nonvisionary” means lacking foresight or imagination about the future.","zh":"“nonvisionary”表示缺乏远见或对未来缺少想象力/前瞻性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not visionary; not able or willing to imagine the future, new possibilities, or big changes.","zh":"非有远见的；不具前瞻性或不愿意想象未来、新可能与重大变化的。"},"examples":[{"en":"The company’s strategy felt nonvisionary and focused only on short-term profits.","zh":"这家公司的战略显得缺乏远见，只盯着短期利润。"},{"en":"Critics said the plan was nonvisionary because it didn’t address long-term climate risks.","zh":"批评者说这个计划缺乏前瞻性，因为它没有处理长期的气候风险。"}]}],"synonyms":["shortsighted","unimaginative","not forward-looking","conventional","narrow-minded"],"phonetic":"/ˌnɑnˈvɪʒəˌnɛri/","extraExplanation":["“non-”是否定前缀，表示“非/不”。“visionary”原意与“看见（vision）”有关，引申为“有远见、富于想象力”。因此 nonvisionary 常用于评价想法、政策、领导或规划“眼光不长远”。","拼写上更常见的形式是带连字符的 non-visionary；不带连字符 nonvisionary 也能见到，但频率较低。","语气通常偏批评。更中性的表达可用 “not forward-looking（不够前瞻）” 或 “short-term（短视的）”。"]}
{"word":"nonvisitation","summary":{"en":"Nonvisitation means not visiting, often referring to an expected or official visit that does not occur.","zh":"nonvisitation 指“不去访问/未进行探访”，常带“本应发生的例行或官方访问却没有发生”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or situation of not visiting (especially an official or expected visit that does not happen)","zh":"不去探访；未进行（尤其指本应发生的官方/例行）访问"},"examples":[{"en":"The committee criticized the inspector’s long nonvisitation of the site.","zh":"委员会批评检查员长期未到现场视察。"},{"en":"Because of travel restrictions, there was a year of nonvisitation between the two families.","zh":"由于旅行限制，两家人有一年没有互相探访。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, church) a bishop’s or church official’s failure to carry out a formal visitation (an inspection of churches or clergy)","zh":"（历史用法，教会）主教或教会官员未进行“视察/巡视”（对教区、教堂或神职人员的正式检查）"},"examples":[{"en":"Records mention the bishop’s nonvisitation and the problems it caused in the diocese.","zh":"记录提到主教未进行巡视，以及这给教区带来的问题。"},{"en":"In some older texts, nonvisitation is linked to weak oversight of local clergy.","zh":"在一些较早的文本中，“未巡视”与对地方神职人员监管薄弱有关。"}]}],"synonyms":["absence of visits","failure to visit","no visitation","nonattendance (in some contexts)"],"phonetic":"/ˌnɑnˌvɪzəˈteɪʃən/","extraExplanation":["这个词由前缀 non-（“不、非”）+ visitation（“访问；视察”）构成，语气往往偏正式、书面；日常英语更常说 not visiting / failure to visit / absence of visits。","在英国及欧洲的教会历史语境里，visitation 常指主教对教区的正式巡视检查；因此 nonvisitation 在旧文献中常带有“失职、监督缺位”的含义。"]}
{"word":"nonvisiting","summary":{"en":"Nonvisiting means ‘not visiting’ or ‘not involving a visit,’ usually used before a noun.","zh":"nonvisiting 表示“不去拜访/探视的”或“不涉及探访的”，多用于名词前作定语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not visiting a place or person; not involving a visit (often used as an adjective before a noun).","zh":"不去拜访的；不涉及探访/访问的（常作定语修饰名词）。"},"examples":[{"en":"The hospital limited nonvisiting hours to reduce infection risk.","zh":"医院限制非探视时段，以降低感染风险。"},{"en":"Nonvisiting family members can call the ward for updates.","zh":"未到现场探视的家属可以致电病房了解情况。"}]}],"synonyms":["not visiting","nonresident (in some contexts)","absent (context-dependent)"],"phonetic":"/ˌnɑnˈvɪzɪtɪŋ/","extraExplanation":["“nonvisiting”更常见的写法是“non-visiting”（带连字符），尤其在正式写作中；两者含义相同。","它不是一个非常常用的独立词，更多出现在特定场景的复合表达里，如“non-visiting hours（非探视时段）”“non-visiting relatives（未前来探视的亲属）”。"]}
{"word":"nonvisual","summary":{"en":"Nonvisual means not involving sight, and it’s often used for tools or designs that can be used without looking (especially in accessibility).","zh":"nonvisual 指“不依靠视觉的；与视觉无关的”，也常用于描述“不看屏幕也能使用”的无障碍设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to seeing; not using the sense of sight.","zh":"非视觉的；不依靠看见的；与视觉无关的。"},"examples":[{"en":"Braille is a nonvisual reading system for people who are blind or have low vision.","zh":"盲文是一种非视觉的阅读系统，供盲人或低视力者使用。"},{"en":"The guide taught us nonvisual ways to recognize plants by touch and smell.","zh":"向导教我们用触摸和嗅觉等非视觉方式来辨认植物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed to be accessible without looking at a screen (often used in technology and accessibility).","zh":"（尤指科技与无障碍领域）设计成不看屏幕也能使用的。"},"examples":[{"en":"The app includes a nonvisual mode with voice feedback.","zh":"这个应用包含带语音反馈的非视觉模式。"},{"en":"Good nonvisual navigation helps screen-reader users move through menus efficiently.","zh":"良好的非视觉导航能帮助屏幕阅读器用户高效地浏览菜单。"}]}],"synonyms":["not visual","non-sighted","tactile","auditory"],"phonetic":"/nɑnˈvɪʒuəl/","extraExplanation":["“nonvisual”常见于无障碍（accessibility）语境，强调“无需依赖屏幕/图像信息也能完成任务”。在用户体验中，你可能会看到：nonvisual feedback（非视觉反馈，如语音/震动）、nonvisual interface（非视觉界面）、nonvisual navigation（非视觉导航）。","它与“invisible（看不见的）”不同：nonvisual强调“不是通过视觉来获取或呈现信息”，而invisible强调“东西本身不可见”。"]}
{"word":"nonvisualized","summary":{"en":"Nonvisualized means not presented or represented visually (and sometimes not pictured mentally).","zh":"Nonvisualized 指“未可视化呈现/表示的”（有时也指“未在脑中形成画面的”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not shown in a visual form; not represented by an image, diagram, chart, or other visualization.","zh":"未以可视形式呈现的；未用图像、图表、示意图等方式可视化表示的。"},"examples":[{"en":"The report includes both visualized graphs and nonvisualized text explanations.","zh":"这份报告既包含可视化图表，也包含未可视化的文字说明。"},{"en":"In the app, some settings are nonvisualized and only available through a menu.","zh":"在这个应用里，有些设置没有可视化展示，只能通过菜单进入。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not imagined as a mental picture; not pictured in the mind.","zh":"（心理上）未在脑中形成画面的；未被想象成图像的。"},"examples":[{"en":"For some people, numbers stay nonvisualized—they think of them as concepts, not pictures.","zh":"对有些人来说，数字不会形成画面，他们把数字当作概念而非图像来思考。"}]}],"synonyms":["not visualized","unvisualized","not shown graphically","non-graphical"],"phonetic":"/ˌnɑnˈvɪʒuəˌlaɪzd/","extraExplanation":["“nonvisualized”常见于较正式或技术性的语境（如数据分析、工程文档、软件界面），用来和“visualized / visualization（可视化）”对照。日常口语里更常说“not visualized”或“not shown in a chart/graph”。"]}
{"word":"nonvisually","summary":{"en":"Nonvisually means “without using sight; in a non-visual way,” often used in accessibility contexts.","zh":"nonvisually 意为“以非视觉方式、无需依赖视力”，常用于无障碍相关语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that does not use vision; without relying on sight.","zh":"以非视觉的方式；不依赖视力（不用“看”）来完成。"},"examples":[{"en":"The app can be used nonvisually with a screen reader.","zh":"这个应用可以配合读屏软件以非视觉方式使用。"},{"en":"He navigated the menu nonvisually by listening to the audio prompts.","zh":"他通过听语音提示，以非视觉方式操作菜单。"}]}],"synonyms":["without sight","in a non-visual way","auditorily (in some contexts)"],"phonetic":"/nɑnˈvɪʒuəli/","extraExplanation":["“nonvisually”常见于无障碍（accessibility）语境，尤其是讨论盲人或低视力用户如何通过读屏（screen reader）、点字显示器（braille display）、语音提示、键盘快捷键等方式完成操作。","写作中也常见搭配：use/operate/navigate/access something nonvisually（以非视觉方式使用/操作/导航/访问某物）。"]}
{"word":"nonvital","summary":{"en":"Nonvital means not essential or not life-sustaining, depending on context.","zh":"nonvital 指“非关键的/非必要的”，在医学语境中也可指“与维持生命无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not essential or not necessary for the most important purpose; not critical.","zh":"非关键的；不必要的；不是最重要目的所必需的。"},"examples":[{"en":"We can postpone the nonvital tasks until after the deadline.","zh":"我们可以把非关键的任务推迟到截止日期之后再做。"},{"en":"Cutting nonvital spending helped the team save money.","zh":"削减非必要开支帮助团队节省了资金。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not related to life-sustaining functions; not necessary to keep someone alive (often used in medical contexts).","zh":"（常用于医学语境）与维持生命无关的；不是“保命”所必需的。"},"examples":[{"en":"The injury affected nonvital tissue, so it wasn’t life-threatening.","zh":"伤势影响的是非重要（非维生）组织，所以不致命。"},{"en":"Doctors confirmed that no nonvital organs were damaged.","zh":"医生确认没有器官受损（这里指未涉及维持生命所必需的关键功能）。"}]}],"synonyms":["nonessential","unnecessary","not critical","inessential","secondary"],"phonetic":"/nɑnˈvaɪtəl/","extraExplanation":["拼写上也常见作 non-vital（带连字符），意思相同。日常写作里更常用的同义表达包括 nonessential、unnecessary、not critical。","在医学英语里，vital 常与“生命体征/关键器官”相关（如 vital signs 生命体征）。nonvital 通常强调“不会危及生命”，但并不等于“完全不重要”。"]}
{"word":"nonvitality","summary":{"en":"Nonvitality means a lack of vitality or energy; it’s a rare, more formal word.","zh":"nonvitality 指“缺乏活力/能量”，较少见，偏正式用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of vitality; the state of being weak, lifeless, or not energetic (rare in everyday English).","zh":"缺乏活力；无精打采、虚弱或缺少生命力的状态（在日常英语中较少见）。"},"examples":[{"en":"After the long illness, she felt a lingering nonvitality that made simple tasks tiring.","zh":"那场久病之后，她仍感到挥之不去的缺乏活力，连简单的事情都很累。"},{"en":"The critic said the performance had a sense of nonvitality, as if the actors were going through the motions.","zh":"评论家说这场演出有一种缺乏生气的感觉，仿佛演员只是在机械地完成动作。"}]}],"synonyms":["lack of vitality","fatigue","listlessness","lethargy","low energy","weakness"],"phonetic":"/ˌnɑnvaɪˈtæləti/","extraExplanation":["这个词由前缀 non-（“不、非”）+ vitality（“活力/生命力”）构成，意思很直观，但在现代英语里不算常用。更自然的表达通常是 low energy, lack of vitality, fatigue, listlessness 等。","语域上偏书面或评论性文字（如文学评论、艺术评论），用来描述“缺少生气/生命力”的感觉。"]}
{"word":"nonvitalized","summary":{"en":"“Nonvitalized” means not living or not having vitality, often describing dead/non-responsive tissue or a tooth.","zh":"“nonvitalized”指“未具活性/无生命反应的”，常用于医学或牙科，描述失活的组织或牙齿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not made vital or living; lacking vitality or life (often used in medical or dental contexts to describe tissue or a tooth that is no longer alive).","zh":"未被赋予生命力的；缺乏活力/生命的（常用于医学或牙科语境，指组织或牙齿已无生命反应）。"},"examples":[{"en":"The dentist treated the nonvitalized tooth with a root canal.","zh":"牙医对那颗已失活的牙齿进行了根管治疗。"},{"en":"Nonvitalized tissue may need to be removed to prevent infection.","zh":"失活组织可能需要清除，以防感染。"}]}],"synonyms":["nonvital","devitalized","lifeless","dead (medical context)"],"phonetic":"/nɑnˈvaɪtəˌlaɪzd/","extraExplanation":["“nonvitalized”在日常英语里很少见，更常见的表达是“nonvital”或“devitalized”（尤指牙髓/组织失去活性）。写作时也常写作“non-vitalized”。","构词：non-（不/非）+ vitalize（赋予生命力、使更有活力）+ -ed（形容词化，表示“被……的”）。因此它强调“没有被赋活/没有活性”。"]}
{"word":"nonvitally","summary":{"en":"“Nonvitally” means “not in an essential or survival-critical way.”","zh":"“nonvitally”表示“不是以关键/要害（或攸关生存）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not vital, essential, or necessary; not crucially.","zh":"以非关键、非必需的方式；不是至关重要地。"},"examples":[{"en":"Nonvitally important details can be left out of the summary.","zh":"摘要里可以省略那些非关键的重要细节。"},{"en":"The article discussed the main causes and mentioned several nonvitally related factors.","zh":"文章讨论了主要原因，并提到了一些非关键的相关因素。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Biology/medicine) In a way that does not involve vital functions or vital organs; not affecting survival directly.","zh":"（生物/医学）以不涉及生命机能或重要器官的方式；不直接影响生存地。"},"examples":[{"en":"The injury was painful but nonvitally located, away from major organs.","zh":"伤口很痛，但位置并非要害，远离重要器官。"},{"en":"They monitored the patient’s vitals and treated the nonvitally affected tissue.","zh":"他们监测病人的生命体征，并处理了非要害部位受影响的组织。"}]}],"synonyms":["not vitally","not essentially","not crucially","inessentially","nonessentially"],"phonetic":"/nɑnˈvaɪtəli/","extraExplanation":["“nonvitally”由 non-（否定前缀）+ vital（至关重要的/生命的）+ -ly（副词后缀）构成，字面意思是“不是关键地/不是要害地”。","这个词在日常英语中很少见，更常见的表达是 “not vitally” 或 “not essential(ly) / not crucial(ly)”。在正式写作里偶尔会出现，用来强调某事与核心目标或生存无直接关系。"]}
{"word":"nonvitalness","summary":{"en":"Nonvitalness means the state or quality of being not vital—either not essential/important or (less commonly) lacking vitality or energy.","zh":"Nonvitalness 指“非关键性/非必需性”，也可较少见地指“缺乏活力、精力不足”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being vital or essential; lack of importance or necessity","zh":"非关键性；不重要、非必需的特质"},"examples":[{"en":"The report focused on vital safety issues and removed the nonvitalness of minor details.","zh":"报告聚焦于关键的安全问题，删去了次要细节的非关键性内容。"},{"en":"In an emergency, the nonvitalness of comfort becomes obvious.","zh":"在紧急情况下，舒适性的非必需性会变得很明显。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of lacking energy, life, or vigor; low vitality (rare)","zh":"缺乏活力、生命力或精力的状态（较少见）"},"examples":[{"en":"After the long winter, she noticed a nonvitalness in her routines.","zh":"漫长的冬天过后，她感觉自己的日常有些缺乏活力。"}]}],"synonyms":["nonessentiality","unimportance","inessentiality","lack of vitality","lifelessness"],"phonetic":"/ˌnɑnˈvaɪtəl.nəs/","extraExplanation":["这个词很少见，更常用的表达是“nonvitality / lack of vitality”（缺乏活力）或“nonessentiality / unimportance”（非必需性/不重要）。","构词法：non-（否定）+ vital（关键的/有生命力的）+ -ness（名词后缀，表示“……的性质/状态”）。在正式写作中，常用更自然的替代词来避免生造感。"]}
{"word":"nonvitiation","summary":{"en":"Nonvitiation means something is not invalidated and remains legally valid.","zh":"Nonvitiation 指“不致无效”，强调某事仍保持法律效力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fact or principle of not making something invalid or void; the condition of remaining legally effective (often used in law and contracts).","zh":"（法律/合同用语）不使某事无效；不导致作废的原则或状态（指仍然具有法律效力）。"},"examples":[{"en":"The court held that the minor error led to nonvitiation of the contract.","zh":"法院认定该轻微错误不导致合同无效。"},{"en":"A nonvitiation clause says that a breach of one part does not cancel the entire agreement.","zh":"“不致无效条款”规定：违反某一部分并不使整个协议作废。"}]}],"synonyms":["no invalidation","validity retained","not voided","non-avoidance"],"phonetic":"/ˌnɑnˌvɪʃiˈeɪʃən/","extraExplanation":["“non-”是否定前缀，表示“非、无、不”。“vitiation”来自拉丁语词根，核心意思是“使无效、使败坏”。因此“nonvitiation”多见于法律语境，强调某个瑕疵、错误或违约不会让整体文件或权利失去效力。","在实际文件中更常见的写法是“non-vitiation”或直接用更常用的表达，如“does not invalidate”“remains valid”“no invalidation”。"]}
{"word":"nonvitreous","summary":{"en":"Nonvitreous describes something that is not glass-like—often more porous and less glossy, especially in ceramics.","zh":"nonvitreous 指“非玻璃质的”，常见于陶瓷等材料，通常更不光亮、也可能更易吸水。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not vitreous; not having a glassy, transparent, or glass-like texture (often used for ceramics, minerals, or surfaces).","zh":"非玻璃质的；不呈玻璃状、不透明或不具玻璃般质感的（常用于陶瓷、矿物或表面）。"},"examples":[{"en":"The tile has a nonvitreous surface, so it absorbs more water than a vitreous tile.","zh":"这种瓷砖是非玻璃质表面，所以比玻璃质瓷砖更容易吸水。"},{"en":"Nonvitreous pottery often feels more porous and less glossy.","zh":"非玻璃质陶器摸起来通常更疏松多孔、光泽也较弱。"}]}],"synonyms":["non-glassy","opaque","porous (often)","unglazed (sometimes, depending on context)"],"phonetic":"/ˌnɑnˈvɪtriəs/","extraExplanation":["在材料与陶瓷领域，vitreous 通常指“玻化/玻璃化”（烧成后结构更致密、吸水率更低、表面更像玻璃）。nonvitreous 则常暗示“未完全玻化”，因此可能更粗糙或更易吸水。","在建筑材料说明中，nonvitreous 常用来区分瓷砖/陶砖的吸水率等级；它不一定表示质量差，而是表示材质特性不同、适用场景不同。"]}
{"word":"nonvitrified","summary":{"en":"“Nonvitrified” means not glass-like or fully fused by heat, especially in ceramics; it often implies a more porous material.","zh":"nonvitrified 指“未玻璃化/未完全烧结致密”的（尤指陶瓷材料），常暗示材料更为多孔、吸水率较高。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not vitrified; not turned into a glass-like, fully fused state by high heat (often said of clay, ceramics, or glaze).","zh":"未玻璃化的；未因高温烧结而变成玻璃状、完全致密融合的（常用于陶瓷、黏土或釉层）。"},"examples":[{"en":"Nonvitrified clay remains porous and can absorb water.","zh":"未玻璃化的黏土仍然多孔，可能会吸水。"},{"en":"The engineer noted that the nonvitrified layer was weaker than the vitrified surface.","zh":"工程师指出，未玻璃化的那一层比玻璃化的表面更脆弱。"},{"en":"This tile is nonvitrified, so it’s not ideal for wet areas without sealing.","zh":"这种砖未玻璃化，所以如果不做密封处理，不太适合潮湿区域。"}]}],"synonyms":["unvitrified","porous","not fully fired"],"phonetic":"/ˌnɑnˈvɪtrəˌfaɪd/","extraExplanation":["这个词多见于陶瓷/材料领域：vitrify（玻璃化）指在高温下颗粒熔融并“烧结致密”，孔隙减少、吸水率下降。nonvitrified 往往意味着更“疏松/多孔”、吸水率更高，强度与耐污性通常也较低（是否适用要看具体材料与工艺）。","词形结构很直观：non-（不）+ vitrified（已玻璃化的）。在产品说明里也可能与“absorption rate（吸水率）”“porosity（孔隙率）”“fired/bisque-fired（素烧）”等词一起出现。"]}
{"word":"nonvitriolic","summary":{"en":"“Nonvitriolic” means calm, not harsh or bitter in tone.","zh":"“nonvitriolic”表示语气平和，不尖刻、不刻薄。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not vitriolic; not harsh, bitter, or cutting in tone (especially in speech or writing).","zh":"不尖刻的；不刻薄恶毒的（尤指言语或文章语气不辛辣、不充满恶意）。"},"examples":[{"en":"She offered a nonvitriolic critique that focused on the facts.","zh":"她提出了不尖刻的批评，重点放在事实本身。"},{"en":"Even when they disagreed, their conversation stayed nonvitriolic and respectful.","zh":"即使意见不同，他们的谈话仍然不刻薄、很尊重彼此。"},{"en":"The editor asked for a nonvitriolic response to the negative review.","zh":"编辑要求对那篇负面评论做出不刻薄的回应。"}]}],"synonyms":["civil","measured","temperate","restrained","non-hostile","noninflammatory"],"phonetic":"/ˌnɑnˌvɪtriˈɑlɪk/","extraExplanation":["“vitriolic”常用来形容语言“像强酸一样”伤人、刻薄。“vitriol”历史上指硫酸等强腐蚀性物质，后来引申为“恶毒的言辞”。因此 nonvitriolic 通常用于强调语气克制、理性、不带人身攻击。","拼写提示：non-（否定前缀）+ vitriolic。它相对少见，写作中也可用更常见的表达替换，如 “not harsh / not bitter / not caustic”。"]}
{"word":"nonvituperative","summary":{"en":"“Nonvituperative” describes speech or writing that is critical (or not) but not insulting or abusive.","zh":"“nonvituperative”指言语或文字不带辱骂与人身攻击，语气不刻薄。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not harshly critical or abusive; not using bitter, insulting language.","zh":"不谩骂的；不恶言相向的；不刻薄辱骂的。"},"examples":[{"en":"She gave a nonvituperative response, focusing on facts instead of insults.","zh":"她用不带辱骂的方式回应，把重点放在事实而不是人身攻击上。"},{"en":"We need a nonvituperative tone if we want this discussion to be productive.","zh":"如果想让讨论有效，就需要保持不刻薄辱骂的语气。"}]}],"synonyms":["civil","measured","temperate","nonabusive","not vituperative"],"phonetic":"/ˌnɑnvaɪˈtuːpərətɪv/","extraExplanation":["这个词由前缀 non-（“不、非”）+ vituperative（“辱骂性的、恶言相向的”）构成，常见于较正式或书面语（如评论、新闻、学术讨论）中，用来强调“批评可以有，但不要升级为谩骂”。","在公共讨论语境里，nonvituperative 常与 tone（语气）、language（措辞）、response（回应）、criticism（批评）等搭配。"]}
{"word":"nonvituperatively","summary":{"en":"“Nonvituperatively” means speaking or acting without harsh insults or abusive criticism.","zh":"“nonvituperatively”指说话或做事不带辱骂与刻薄攻击，而是较为克制、尊重地表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not harsh, abusive, or insulting; without angry verbal attacks","zh":"以不恶言相向的方式；不辱骂地；不刻薄地（表达批评或意见）"},"examples":[{"en":"She criticized the plan nonvituperatively, focusing on facts instead of personal attacks.","zh":"她不带辱骂地批评了这个计划，把重点放在事实而不是人身攻击上。"},{"en":"Even when they disagreed, they spoke nonvituperatively and kept the discussion respectful.","zh":"即使意见不合，他们也不恶言相向，保持讨论的尊重。"},{"en":"He responded nonvituperatively to the rude comment and asked a calm question.","zh":"他对那句无礼的话没有刻薄回击，而是平静地提了个问题。"}]}],"synonyms":["calmly","civilly","politely","respectfully","without insults"],"phonetic":"/ˌnɑn.vɪˈtuː.pɚ.ə.tɪv.li/","extraExplanation":["这个词比较少见、偏正式（常见于写作或学术语境）。更常用的替代表达有：“calmly（冷静地）/ politely（礼貌地）/ without insults（不带侮辱地）/ without hostility（不带敌意地）”。","词形结构：non-（“不/非”）+ vituperative（“辱骂的、恶言的”）+ -ly（副词后缀）。理解词根有助于记忆：vituperative 强调“言语上的辱骂与攻击”。"]}
{"word":"nonviviparity","summary":{"en":"Nonviviparity is reproduction by laying eggs instead of giving birth to live young.","zh":"Nonviviparity 指非胎生：通过产卵而非产下活体幼崽来繁殖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the reproductive strategy of producing young by laying eggs, rather than giving birth to live young","zh":"（生物）非胎生；指通过产卵繁殖后代，而不是直接产下活体幼崽"},"examples":[{"en":"Most reptiles show nonviviparity, laying eggs that hatch later.","zh":"大多数爬行动物属于非胎生，会产下卵，之后孵化。"},{"en":"The study compared nonviviparity and viviparity in different lizard species.","zh":"这项研究比较了不同蜥蜴物种的非胎生与胎生。"}]}],"synonyms":["egg-laying","oviparity"],"phonetic":"/ˌnɑnˌvaɪvəˈpɛrɪti/","extraExplanation":["“nonviviparity”是比较偏学术/生物学的术语，日常更常说“egg-laying（产卵）”。","相关概念：viviparity（胎生，直接产下幼体）；oviparity（卵生，典型的“产卵并在体外孵化”）；还有ovoviviparity（卵胎生，卵在体内孵化后再产出）。在不同教材/论文中，nonviviparity有时用来概括“非胎生”这一大类（包括卵生与卵胎生）。"]}
{"word":"nonviviparous","summary":{"en":"Nonviviparous describes animals that do not give birth to live young (usually egg-laying).","zh":"nonviviparous 用来描述“非胎生”的动物（通常为卵生）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not giving birth to live young; producing offspring by laying eggs or by releasing eggs that develop outside the mother’s body.","zh":"非胎生的；不产下活体幼崽的（通常指卵生，或卵在母体外发育）。"},"examples":[{"en":"Most birds are nonviviparous and lay eggs.","zh":"大多数鸟类是非胎生的，会产卵。"},{"en":"Many reptiles are nonviviparous, although a few species give live birth.","zh":"很多爬行动物是非胎生的，不过也有少数物种会产下活体幼崽。"}]}],"synonyms":["oviparous","egg-laying","non-live-bearing"],"phonetic":"/ˌnɑnˌvaɪˈvɪpərəs/","extraExplanation":["词源上可拆为 non-（不）+ viviparous（胎生的）。“胎生”强调胚胎在母体内发育并出生时为活体。非胎生通常对应“卵生”（oviparous）。","在生物学里还常见另一个相关概念：ovoviviparous（卵胎生，卵在母体内孵化但不通过胎盘供养）。因此“nonviviparous”是个更宽的否定说法，强调“不是胎生”，不一定细分是哪一种非胎生方式。"]}
{"word":"nonviviparously","summary":{"en":"“Nonviviparously” means reproducing in a not-live-bearing way, typically by laying eggs or developing outside the mother’s body.","zh":"“nonviviparously”指“以非胎生方式繁殖”，通常是产卵或在母体外发育。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not viviparous; by producing young via eggs or external development rather than giving birth to live young.","zh":"以非胎生的方式；指不是直接产下活体幼崽，而是通过产卵或在体外发育来繁殖。"},"examples":[{"en":"Most reptiles reproduce nonviviparously by laying eggs.","zh":"大多数爬行动物以非胎生的方式繁殖，也就是产卵。"},{"en":"The species described in the study develops embryos nonviviparously outside the mother’s body.","zh":"研究中描述的这个物种，其胚胎以非胎生的方式在母体外发育。"}]}],"synonyms":["oviparously","by laying eggs","not live-bearing"],"phonetic":"ˌnɑnvaɪˈvɪpərəsli","extraExplanation":["“nonviviparously”很少出现在日常英语里，多用于生物学/动物学写作。更常见的说法是用形容词：nonviviparous（非胎生的）或直接说 oviparous（卵生的）。","词根提示：viviparous（胎生的）来自拉丁语，vivi-（活的）+ -parous（生产/产出）。加上 non- 表示否定，再加 -ly 变成副词。","注意区分：viviparous（胎生）≈ 直接产下活体；oviparous（卵生）= 产卵；有些动物是 ovoviviparous（卵胎生），卵在母体内孵化后出生，但严格来说仍与典型胎生不同。"]}
{"word":"nonviviparousness","summary":{"en":"Nonviviparousness means the quality of not giving birth to live young—typically laying eggs instead.","zh":"nonviviparousness 指“非胎生”的性质或状态，通常指通过产卵而非产下活体幼崽来繁殖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or quality of being nonviviparous; reproducing by laying eggs (or producing offspring outside the mother’s body), rather than giving birth to live young","zh":"非胎生（卵生等）的状态或性质；指以产卵/在母体外发育的方式繁殖，而不是直接产下活体幼崽"},"examples":[{"en":"In many reptiles, nonviviparousness is the usual reproductive strategy.","zh":"在许多爬行动物中，非胎生（卵生）是常见的繁殖策略。"},{"en":"The study compared viviparity and nonviviparousness across different fish species.","zh":"这项研究比较了不同鱼类物种的胎生与非胎生（卵生等）特征。"}]}],"synonyms":["egg-laying (in context)","oviparity (technical)","nonviviparity (technical)"],"phonetic":"/ˌnɑnvaɪˈvɪpərəsnəs/","extraExplanation":["“non-”表示否定；“viviparous”意为“胎生的/产下活体幼崽的”（来自拉丁语词根：vivi-“活的” + -parous“生育的”）；加上“-ness”构成名词，表示“……的性质/状态”。","这个词非常学术化，常见于动物学、进化生物学论文或教材。日常英语里更常说“egg-laying”（产卵的）或“oviparous”（卵生的），而不是用“nonviviparousness”。","注意：nonviviparous（非胎生）是一个更宽的集合，通常用来对比“viviparous（胎生）”。在一些分类语境中，它可能包括卵生（oviparous）以及卵胎生（ovoviviparous，卵在体内孵化但不通过胎盘供养）等情况，具体取决于作者的定义。"]}
{"word":"nonvocable","summary":{"en":"Nonvocable means “not able to be put into words” or “not forming recognizable words.” It’s rare and often literary.","zh":"nonvocable 表示“不可言说的；难以用语言成词表达的”，也可指“不是清晰词语的声音”。该词较少见，常见于文学或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be spoken or formed into a word; unsayable or without a clear verbal form.","zh":"无法说出口的；难以用语言成词表达的；不可言说的。"},"examples":[{"en":"He tried to describe the feeling, but it remained nonvocable.","zh":"他试图描述那种感受，但它仍然是不可言说的。"},{"en":"Some emotions are almost nonvocable—you feel them more than you can explain them.","zh":"有些情绪几乎无法用语言表达——你更多是感受到它们，而不是能解释清楚。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a sound) Not a recognizable word; non-lexical or inarticulate.","zh":"（指声音）不成词的；非词汇性的；含糊不清的。"},"examples":[{"en":"The recording captured only nonvocable murmurs, not clear speech.","zh":"录音只捕捉到一些不成词的低语，并没有清晰的讲话。"},{"en":"The child made nonvocable noises before learning to pronounce words.","zh":"孩子在学会发音成词之前，会先发出一些不成词的声音。"}]}],"synonyms":["inexpressible","indescribable","unspeakable","unutterable","inarticulate"],"phonetic":"/nɑnˈvoʊkəbəl/","extraExplanation":["这个词非常少见，多见于较正式或文学性的语境，用来强调“语言无法触及”的体验（如强烈情绪、创伤、神秘体验）。日常英语里更常用 unspeakable / indescribable / inexpressible。","构词上 non- 表示“非、无”，vocable 与 vocal（声音的）同源，来自拉丁语 vox（声音）。因此 nonvocable 字面意思接近“不能成为‘可说出的词’”。"]}
{"word":"nonvocal","summary":{"en":"Nonvocal means not using the voice, or (in music) having no singing/vocals.","zh":"nonvocal 指“不用声音的”，或（在音乐中）“没有人声/主唱的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not using the voice; not spoken or sung.","zh":"不使用声音的；非口头表达的；非歌唱的。"},"examples":[{"en":"He gave a nonvocal signal by raising his hand.","zh":"他举手做了一个非口头的示意。"},{"en":"We need nonvocal cues like gestures and facial expressions in noisy places.","zh":"在嘈杂的地方，我们需要手势和面部表情等非口头线索。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Music) Without singing; consisting only of instruments or sounds, not vocals.","zh":"（音乐）无主唱的；无歌声的；只有器乐/声音而没有人声的。"},"examples":[{"en":"The album includes a nonvocal version of the theme song.","zh":"这张专辑收录了主题曲的无主唱版本。"},{"en":"Can you send me the nonvocal track for karaoke practice?","zh":"你能把无主唱的伴奏发给我练卡拉OK吗？"}]}],"synonyms":["nonverbal","silent","instrumental","wordless","no-vocals"],"phonetic":"/nɑnˈvoʊkəl/","extraExplanation":["“nonvocal”在日常英语里不算高频，描述“非语言沟通”时更常用的是“nonverbal”（非言语的）。在音乐语境中，最常见的近义表达是“instrumental”（器乐版）或“no vocals”。","构词很好理解：non-（不/非）+ vocal（声音的/嗓音的）。"]}
{"word":"nonvocalic","summary":{"en":"Nonvocalic describes a sound or letter that does not act as a vowel (it is consonant-like).","zh":"nonvocalic 指某个声音或字母不充当元音，而表现为类似辅音的功能。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Not functioning as a vowel; said of a sound or letter that is pronounced as a consonant rather than a vowel.","zh":"（语言学）非元音的；指某个声音或字母不作为元音发音，而是像辅音那样发音。"},"examples":[{"en":"In “yes,” the letter y is nonvocalic because it sounds like a consonant.","zh":"在 yes 这个词里，字母 y 是非元音的，因为它发的是类似辅音的声音。"},{"en":"Some analyses treat the w in “water” as nonvocalic.","zh":"有些分析认为 water 中的 w 是非元音的。"}]}],"synonyms":["nonvowel","consonantal"],"phonetic":"/ˌnɑnvoʊˈkælɪk/","extraExplanation":["这个词多用于语音学/音系学的书面讨论，和更常见的 nonvowel（非元音的）意思接近，但 nonvocalic 更强调“发音功能上不充当元音”。","在英语里，像 y、w 这类字母有时可以代表元音音值（如 my /maɪ/ 里的 y），有时代表辅音音值（如 yes 里的 y）。当它们不充当元音时，就可描述为 nonvocalic。","相关对比：vocalic（元音性的）通常指“具有元音特征/充当元音”；nonvocalic 则相反。"]}
{"word":"nonvocality","summary":{"en":"Nonvocality means the state of not using the voice—no speaking or singing.","zh":"nonvocality 指“不发声”的状态，即不说话或不歌唱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being nonvocal; absence of vocal sound or speaking/singing","zh":"不发声的状态；不使用声音（说话/歌唱）的特征"},"examples":[{"en":"After the surgery, the doctor recommended temporary nonvocality to protect her vocal cords.","zh":"手术后，医生建议她暂时保持不发声，以保护声带。"},{"en":"The meditation retreat encourages periods of nonvocality so participants can focus inward.","zh":"冥想静修会鼓励一段时间的不发声，让参与者更专注于内在。"}]}],"synonyms":["silence","quietness","muteness","voicelessness","speechlessness"],"phonetic":"/ˌnɑnvoʊˈkælɪti/","extraExplanation":["“nonvocality”在日常英语中很少见，更常见的表达是“silence / quiet / not speaking”或医学语境里的“voice rest（声带休息）”。","词形结构：non-（否定前缀）+ vocal（发声的）+ -ity（名词后缀，表示“状态/性质”）。","使用场景多见于较正式或专业语境（如医学、语言治疗、修辞/叙事分析），表示“缺乏声音/不发声”这一性质，而不只是“安静”。"]}
{"word":"nonvocalization","summary":{"en":"Nonvocalization means not producing voice; in phonetics, it can mean no vocal-fold vibration (voicelessness).","zh":"nonvocalization 指不发声；在语音学中也可指声带不振动（清音/无浊音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or state of not producing voice or vocal sounds; a lack of vocalization (sound made with the vocal cords)","zh":"不发声；不进行嗓音/声音的发出（缺乏由声带产生的声音）"},"examples":[{"en":"After surgery, the doctor recommended nonvocalization for two days to protect her throat.","zh":"手术后，医生建议她两天内保持不发声，以保护喉咙。"},{"en":"In this meditation class, short periods of nonvocalization help students focus on breathing.","zh":"在这门冥想课上，短时间的不发声能帮助学员专注呼吸。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics/phonetics) the absence of voicing or vocal-fold vibration during a sound","zh":"（语言学/语音学）发音时缺乏浊音特征；声带不振动的状态"},"examples":[{"en":"The teacher explained that /s/ is produced with nonvocalization, unlike /z/.","zh":"老师解释说 /s/ 是在不振动声带的情况下发出来的，不像 /z/。"},{"en":"You can feel nonvocalization by touching your throat while saying “sss.”","zh":"你可以在说“sss”时摸着喉咙，感受声带不振动的不发声状态。"}]}],"synonyms":["silence","quietness","voice rest","voicelessness"],"phonetic":"/ˌnɑnˌvoʊkələˈzeɪʃən/","extraExplanation":["这个词在日常英语里不常见，更常见的说法是 **silence**（安静/沉默）、**not speaking**（不说话）、或医学语境里的 **voice rest**（禁声/嗓音休息）。","在语音学里，它常用来对比 **vocalization/voicing**（声带振动、浊音）。例如 /s/ 是“清音”（nonvocalization），/z/ 是“浊音”（vocalization/voicing）。"]}
{"word":"nonvocally","summary":{"en":"“Nonvocally” means “without using the voice; not spoken aloud.”","zh":"“nonvocally”表示“不用声音、不口头说出来地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Without using the voice; not spoken aloud.","zh":"不发声地；不用声音地；不口头说出来地。"},"examples":[{"en":"The actors communicated nonvocally through gestures and facial expressions.","zh":"演员们通过手势和面部表情不发声地交流。"},{"en":"She answered nonvocally by nodding her head.","zh":"她点头示意，非口头地回答了。"},{"en":"The patient signaled nonvocally that he was in pain.","zh":"病人用非发声的方式示意他很疼。"}]}],"synonyms":["silently","without speaking","wordlessly","nonverbally"],"phonetic":"/nɑnˈvoʊkəli/","extraExplanation":["“nonvocally”比较少见、偏正式，常用于描述“不用嗓音/不出声”的沟通方式（如点头、手势、表情、写字）。","注意区分：vocal（用声音的、发声的）强调“声音”；verbal（言语的）强调“语言/词语”；nonverbal（非言语的）更常用，范围也更广（包括姿态、距离、眼神等）。在很多场景里，用 nonverbally 会更自然。"]}
{"word":"nonvocalness","summary":{"en":"Nonvocalness means the quality of not using the voice—being silent or not speaking/singing.","zh":"nonvocalness 指“不用声音”的特质，即沉默或不说话/不唱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being nonvocal—not using the voice; silence or lack of vocal sound.","zh":"不发声的状态或特质；不使用嗓音的沉默/无声。"},"examples":[{"en":"His nonvocalness in meetings was interpreted as shyness, not disagreement.","zh":"他在会议上的不发声被理解为害羞，而不是反对。"},{"en":"The scene’s tension came from the characters’ nonvocalness and long pauses.","zh":"这个场景的紧张感来自角色的不发声和长时间的停顿。"}]}],"synonyms":["silence","quietness","muteness","taciturnity","wordlessness"],"phonetic":"/ˌnɑnˈvoʊkəlnəs/","extraExplanation":["“nonvocalness”较少见，更常用的表达是“silence / quietness / muteness / not speaking”。如果你想表达“没有人声/无唱声”，也可以用“no vocals”或“without vocals”（尤其在音乐语境中）。","注意区分：在语言学里谈“清/浊（voiceless/voiced）”时，一般不用“nonvocalness”，而会说“voicelessness”（如 /p/ 是 voiceless）。"]}
{"word":"nonvocational","summary":{"en":"Nonvocational describes education or training that is not aimed at a specific job.","zh":"nonvocational 指不以特定职业为目标的教育或培训。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to training for a specific job or career (not vocational).","zh":"非职业性的；不以某一具体职业技能训练为目的的。"},"examples":[{"en":"The school offers both vocational and nonvocational courses.","zh":"这所学校既开设职业课程，也开设非职业课程。"},{"en":"She prefers nonvocational study, like literature and history, because she enjoys learning broadly.","zh":"她更喜欢非职业性的学习，比如文学和历史，因为她喜欢广泛地学习。"}]}],"synonyms":["non-career","general (education)","academic","liberal arts"],"phonetic":"/ˌnɑnvoʊˈkeɪʃənəl/","extraExplanation":["在教育语境中，vocational 通常指“职业教育/职业培训”，强调直接对接工作技能；nonvocational 更偏向“通识/学术性/兴趣导向”的学习（如语言、艺术、人文、基础科学等），不一定立刻对应某个具体岗位。","搭配提示：nonvocational education（非职业教育/通识教育）, nonvocational training（非职业性培训）, nonvocational courses/classes（非职业课程）。"]}
{"word":"nonvocationally","summary":{"en":"Nonvocationally means doing something not for a job or career, but for personal interest or enjoyment.","zh":"nonvocationally 指以非职业目的做某事，不是为了工作或职业发展，而是出于兴趣或享受。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is not connected to a job, career training, or professional work; as a hobby or for personal interest","zh":"以非职业的方式；不与工作/职业培训或专业工作相关；作为兴趣或个人爱好"},"examples":[{"en":"She studies French nonvocationally, just for fun.","zh":"她以非职业的方式学法语，只是为了兴趣。"},{"en":"He does carpentry nonvocationally on weekends.","zh":"他周末以非职业的方式做木工（当作爱好）。"},{"en":"The course can be taken vocationally or nonvocationally.","zh":"这门课可以作为职业培训来学，也可以作为非职业兴趣来学。"}]}],"synonyms":["as a hobby","for personal interest","recreationally","nonprofessionally"],"phonetic":"ˌnɑnvoʊˈkeɪʃənəli","extraExplanation":["“vocational”通常指“职业的/职业培训的”（为了就业或技能证书），而“nonvocationally”强调学习或活动不是为了工作需要，而是出于兴趣、自我提升或休闲。","拼写上可以拆开理解：non-（非）+ vocational（职业的）+ -ly（以……方式）。在教育语境中较常见。"]}
{"word":"nonvoice","summary":{"en":"Nonvoice is an uncommon term meaning the absence of voice or something that does not use spoken voice, often in technical contexts.","zh":"nonvoice 是个不太常见的词，可指“无声/无法发声”，也可指“非语音的（多用于技术语境）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of a speaking or singing voice; silence or lack of vocal sound","zh":"没有说话或歌唱的声音；无声、沉默"},"examples":[{"en":"After the surgery, he experienced nonvoice for several days and communicated by writing.","zh":"手术后他有几天无法发声，只能靠写字沟通。"},{"en":"The room fell into nonvoice when the news arrived.","zh":"消息传来时，房间里一下子陷入沉默。"}]},{"partOfSpeech":"adj.","definition":{"en":"not involving a human speaking voice; without voiced speech (often used in technical contexts)","zh":"不涉及人的说话声的；无有声音语的（多见于技术语境）"},"examples":[{"en":"The app supports nonvoice alerts like vibrations and on-screen messages.","zh":"这个应用支持震动和屏幕提示等非语音提醒。"}]}],"synonyms":["silence","loss of voice","voicelessness","nonvocal","nonverbal"],"phonetic":"ˌnɑnˈvɔɪs","extraExplanation":["“nonvoice”不是非常常见的标准词，更常见的写法是“non-voice”（加连字符）或直接用更自然的词来表达：表示“无声/无法发声”可用“loss of voice / voicelessness”；表示“非语音（通讯/提示）”常用“nonverbal”“nonvocal”或“non-voice communication”。","在语音学里，如果你想表达“清音/不带声带振动”，标准术语通常是“voiceless”或“unvoiced”，而不是“nonvoice”。"]}
{"word":"nonvoid","summary":{"en":"Nonvoid means “not void”: either legally valid/effective, or (in math) not empty.","zh":"nonvoid 表示“非无效的”：可指法律上有效，也可指数学中的“非空”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not void; valid, effective, or legally binding (not canceled or without legal force).","zh":"非无效的；有效的；（法律上）不作废的、具有约束力的。"},"examples":[{"en":"The judge ruled that the contract was nonvoid and must be honored.","zh":"法官裁定该合同有效，必须履行。"},{"en":"If the signature is genuine, the agreement is generally nonvoid.","zh":"如果签名属实，该协议通常是有效的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/logic) Not empty; having at least one element.","zh":"（数学/逻辑）非空的；至少包含一个元素的。"},"examples":[{"en":"Assume A is a nonvoid set, so it contains at least one element.","zh":"假设 A 是一个非空集合，因此它至少包含一个元素。"},{"en":"The proof works only for nonvoid domains.","zh":"这个证明只适用于非空的定义域。"}]}],"synonyms":["valid","effective","not void","nonempty (math)","not empty (math)"],"phonetic":"/ˌnɑnˈvɔɪd/","extraExplanation":["“nonvoid”在日常英语中不常见，更常见的写法是“non-void”（带连字符）或直接用“valid / not void”。","在数学语境里，“nonvoid set”常见于较旧或偏正式的教材；现代更常说“nonempty set”。"]}
{"word":"nonvoidable","summary":{"en":"Nonvoidable means legally not able to be canceled or declared invalid.","zh":"nonvoidable 指在法律上不可撤销、不可宣告无效。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Legal) Not able to be declared invalid or canceled; not subject to being voided.","zh":"（法律）不可撤销的；不可宣告无效的；不受“撤销/使无效”影响的。"},"examples":[{"en":"Because the agreement was approved by the court, it became nonvoidable.","zh":"因为该协议经过法院批准，所以它变得不可撤销。"},{"en":"In some cases, a nonvoidable contract still may be changed, but it cannot be canceled for the usual reasons.","zh":"在某些情况下，不可撤销的合同仍可能被变更，但不能因常见理由而被撤销。"}]}],"synonyms":["irrevocable","not voidable","not subject to rescission","not cancellable"],"phonetic":"/ˌnɑnˈvɔɪdəbl/","extraExplanation":["这是一个偏法律/合同用语，由 non-（不）+ voidable（可撤销的）组成。注意它不等于 “valid（有效的）”：一个合同可以有效但仍可能在特定条件下被撤销；而 nonvoidable 强调“不能被撤销/不能被宣告无效”。","相关对比：void（自始无效）指从一开始就没有法律效力；voidable（可撤销）指先有效但可能被撤销；nonvoidable（不可撤销）指一般不能通过撤销来使其失效（但仍可能因其他极端情况产生争议，具体取决于法律体系与条款）。"]}
{"word":"nonvolant","summary":{"en":"Nonvolant means not flying or unable to fly, especially referring to birds (often young birds).","zh":"nonvolant 指“不飞的/不能飞的”，多用于鸟类（常指尚未会飞的幼鸟）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not flying; unable to fly (often used for birds, especially young birds before they can fly)","zh":"不飞的；不能飞的（常用于鸟类，尤指尚未会飞的幼鸟）"},"examples":[{"en":"The rescue team found a nonvolant chick on the ground and brought it to a wildlife center.","zh":"救援人员在地上发现了一只不会飞的雏鸟，并把它送到了野生动物救护中心。"},{"en":"During nesting season, keep dogs leashed to protect nonvolant birds.","zh":"在繁殖季，请给狗拴绳，以保护不会飞的鸟类。"}]}],"synonyms":["flightless","unable to fly","not flying","grounded"],"phonetic":"/nɑnˈvoʊlənt/","extraExplanation":["“non-”表示否定，“volant”来自拉丁语 volare（飞）。这个词多见于动物学/鸟类学语境，日常英语里更常说 flightless（不会飞的）或 unable to fly（不能飞）。","在自然观察或救护语境中，nonvolant 常强调“暂时不会飞”（如雏鸟阶段），不一定像 flightless 那样表示“物种天生不会飞”（如鸵鸟、企鹅）。"]}
{"word":"nonvolatile","summary":{"en":"Nonvolatile means “doesn’t lose data when power is off” (most common), and more generally “not likely to change quickly.”","zh":"nonvolatile 常指“断电不丢数据的（非易失性）”，也可泛指“不易快速变化/不易挥发的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to keep its data or state even when power is turned off; not easily lost or changed.","zh":"（数据/状态）断电后仍能保存的；不易丢失或改变的。"},"examples":[{"en":"Nonvolatile memory keeps your photos even if the phone battery dies.","zh":"非易失性存储即使手机电池没电，也能保留你的照片。"},{"en":"The settings are stored in nonvolatile storage, so they remain after a restart.","zh":"设置保存在非易失性存储中，所以重启后仍然存在。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not volatile; not likely to change suddenly, evaporate easily, or react quickly (used more in science/finance).","zh":"不挥发的；不易突然变化的；不易快速反应的（多用于科学/金融语境）。"},"examples":[{"en":"Cooking oil is less volatile than gasoline.","zh":"食用油比汽油更不易挥发。"},{"en":"They prefer nonvolatile investments for long-term stability.","zh":"他们更偏好非易失性的投资，以获得长期稳定性。"}]}],"synonyms":["persistent","stable","durable","non-evaporating"],"phonetic":"/ˌnɑnˈvɑlət̬əl/","extraExplanation":["在计算机领域，nonvolatile 最常见搭配是 “nonvolatile memory/storage”，典型例子包括 SSD（固态硬盘）、闪存（flash memory）、ROM。相对概念是 volatile memory（易失性存储），如 RAM：断电后数据会消失。词根上，volatile 表示“易挥发/多变”，前缀 non- 表示否定。"]}
{"word":"nonvolatileness","summary":{"en":"Nonvolatileness means the state of being stable and not easily evaporating or fluctuating.","zh":"nonvolatileness 指“非挥发性/不易波动的性质”，强调稳定、不易蒸发或不易起伏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being nonvolatile; stability that does not easily change, evaporate, or fluctuate","zh":"非挥发性；不易蒸发或不易波动的性质（稳定性）"},"examples":[{"en":"The oil’s nonvolatileness makes it suitable for high-temperature cooking.","zh":"这种油的非挥发性使它适合高温烹饪。"},{"en":"In the lab, we prefer solvents with low volatility and high nonvolatileness for safety.","zh":"在实验室里，出于安全考虑，我们更偏好低挥发性、非挥发性更高的溶剂。"},{"en":"Investors looked for the nonvolatileness of the bond market during the crisis.","zh":"在危机期间，投资者寻求债券市场的相对不波动性。"}]}],"synonyms":["nonvolatility","stability","low volatility","steadiness"],"phonetic":"/ˌnɑnˌvɑləˈtaɪlnəs/","extraExplanation":["“nonvolatileness”由 non-（不、非）+ volatile（易挥发的/易波动的）+ -ness（名词后缀，表示“性质/状态”）构成，意思直观。","实际使用中，这个词相对少见：化学语境更常用“nonvolatility”或直接说“low volatility（低挥发性）”；金融语境也更常用“low volatility / stability（稳定性）”。在正式写作中，用“nonvolatility”通常更地道。"]}
{"word":"nonvolatility","summary":{"en":"Nonvolatility means stability—either little change (often in finance) or not evaporating easily (in chemistry).","zh":"nonvolatility 指“稳定、不易波动”，也可指（化学中）“不易挥发”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being stable and not changing quickly or unpredictably; lack of volatility","zh":"不易波动；稳定性（指变化不快、不剧烈、不难以预测）"},"examples":[{"en":"Investors liked the fund’s nonvolatility during the market downturn.","zh":"在市场下跌期间，投资者喜欢这只基金的“不易波动性/稳定性”。"},{"en":"The company’s earnings showed unusual nonvolatility over five years.","zh":"这家公司五年来的盈利表现出罕见的稳定性。"}]},{"partOfSpeech":"n.","definition":{"en":"(chemistry/materials) the property of not evaporating easily; being non-volatile","zh":"（化学/材料）不易挥发性；不易蒸发的性质"},"examples":[{"en":"The additive was chosen for its nonvolatility at high temperatures.","zh":"这种添加剂因其在高温下不易挥发而被选用。"},{"en":"Nonvolatility is important when a solvent must remain in the mixture.","zh":"当溶剂必须留在混合物中时，不易挥发性就很重要。"}]}],"synonyms":["stability","steadiness","consistency","non-volatility","low volatility"],"phonetic":"/ˌnɑnˌvɑləˈtɪləti/","extraExplanation":["“nonvolatility”在日常英语里相对少见，更常见的表达是形容词形式“non-volatile”（不易波动/不易挥发）或短语“low volatility”（低波动）。","在金融语境中，它强调价格、收益或市场指标的“稳定、不大起伏”；在化学语境中，它强调物质“不容易蒸发/挥发”。"]}
{"word":"nonvolatilizable","summary":{"en":"Nonvolatilizable means not able to be turned into vapor; not easily lost as a gas (often in scientific contexts).","zh":"nonvolatilizable 指“不可挥发的/不易气化的”，常用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be volatilized (changed into vapor); not easily driven off as a gas, especially by heating.","zh":"不可挥发的；不能（或不易）被挥发/气化的（尤指加热时不易变成气体）。"},"examples":[{"en":"The salt is nonvolatilizable, so it remains in the container when the solvent evaporates.","zh":"这种盐是不可挥发的，所以当溶剂蒸发时它会留在容器里。"},{"en":"Scientists used a nonvolatilizable tracer to track the reaction without losing it to the air.","zh":"科学家使用不可挥发的示踪剂来追踪反应，避免它跑到空气中而损失。"}]}],"synonyms":["nonvolatile","not volatile","non-evaporable"],"phonetic":"/ˌnɑnˌvɑləˈtaɪləˌzaɪzəbəl/","extraExplanation":["这是一个偏学术/技术用词，常见于化学、材料科学与分析化学语境；日常英语里更常用的表达是“nonvolatile（不挥发的）”或“not volatile”。","构词法：non-（不）+ volatilize（使挥发/使气化）+ -able（能够……的）→ “无法被挥发（带走）”。在实验描述中，它常用来强调某物在加热、减压或气流条件下不会以气体形式损失。"]}
{"word":"nonvolatilized","summary":{"en":"Nonvolatilized means not turned into vapor or gas; remaining as a liquid or solid (often in scientific contexts).","zh":"nonvolatilized 指“未挥发/未气化的”，常用于科学语境，表示仍保持液态或固态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not volatilized; not changed into a vapor or gas, so it remains in a liquid or solid form.","zh":"未挥发（未气化）的；没有转变为蒸气或气体，因此仍保持液态或固态。"},"examples":[{"en":"After heating, some of the sample remained nonvolatilized at the bottom of the container.","zh":"加热后，部分样品仍未挥发，留在容器底部。"},{"en":"The report measured nonvolatilized residues in the soil.","zh":"报告测量了土壤中的未挥发残留物。"}]}],"synonyms":["not volatilized","non-evaporated","nonvaporized","nonvolatile (related)"],"phonetic":"/ˌnɑnˈvɑləˌtaɪzd/","extraExplanation":["“nonvolatilized”常见于化学、环境科学与材料相关写作中，用来描述某物在加热、暴露于空气或反应过程中没有变成气体（没有挥发）而仍然留在原处的部分。","构词上是 non-（不、非）+ volatilized（挥发了的，来自动词 volatilize）。日常英语中更常用的表达包括 “not volatilized” 或 “nonvolatile (residue/compound)”；其中 nonvolatile 更像是“本质上不易挥发”的性质描述，而 nonvolatilized 更强调“在某次过程之后没有挥发掉”的结果。"]}
{"word":"nonvolatiness","summary":{"en":"Nonvolatiness means stability: not easily evaporating (chemistry) or not changing sharply (general/finance).","zh":"nonvolatiness 指“稳定性”：化学上“不易挥发”，一般/金融语境中“低波动、不易剧烈变化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of not being volatile; stability that does not change or evaporate easily (in chemistry or in general use).","zh":"不易挥发；稳定性（在化学中指不易蒸发，在一般语境中指不易变化）。"},"examples":[{"en":"The nonvolatiness of the oil makes it suitable for high-temperature cooking.","zh":"这种油不易挥发的特性使它适合高温烹饪。"},{"en":"Investors look for nonvolatiness in the market during uncertain times.","zh":"在不确定时期，投资者会寻找市场的稳定性（低波动）。"}]}],"synonyms":["stability","nonvolatility","steadiness","lack of volatility"],"phonetic":"/ˌnɑnˈvɑlətnəs/","extraExplanation":["“nonvolatiness”在现代英语里不太常见，更常用的名词形式是“nonvolatility”（尤指金融市场的“低波动/稳定”）或“nonvolatileness”。","在化学语境中，volatile 指“易挥发”；在金融语境中，volatile 指“波动大、不稳定”。因此理解时要根据上下文判断是“挥发性”还是“波动性”。"]}
{"word":"nonvolcanic","summary":{"en":"“Nonvolcanic” means not connected with volcanic activity.","zh":"“nonvolcanic”表示“非火山的；与火山活动无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not caused by, related to, or formed by a volcano or volcanic activity.","zh":"非火山的；不由火山活动引起、与火山无关或非火山形成的。"},"examples":[{"en":"Most earthquakes are nonvolcanic and happen along plate boundaries.","zh":"大多数地震是非火山成因的，发生在板块边界附近。"},{"en":"The island has nonvolcanic mountains made mainly of limestone.","zh":"这座岛有非火山形成的山脉，主要由石灰岩构成。"},{"en":"Scientists compared volcanic and nonvolcanic gases in the atmosphere.","zh":"科学家比较了大气中的火山气体与非火山气体。"}]}],"synonyms":["non-eruptive","nonvolcanogenic"],"phonetic":"/ˌnɑn vɑlˈkænɪk/","extraExplanation":["该词由前缀 non-（“非、不”）+ volcanic（“火山的”）构成，常用于地质学、环境科学等语境，用来区分“火山成因/来源”和“非火山成因/来源”（如构造作用、沉积作用等）。","拼写上通常不加连字符：nonvolcanic；在某些出版物中也可能见到 non-volcanic。"]}
{"word":"nonvolition","summary":{"en":"Nonvolition means the absence of deliberate will or intention.","zh":"nonvolition 指缺乏自觉意志或意图的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of conscious will, choice, or intention; not acting by deliberate decision.","zh":"无意志；非出于自觉选择或意图的状态（不是有意识地决定去做）。"},"examples":[{"en":"In moments of shock, she answered questions in nonvolition, almost like an automatic reflex.","zh":"在震惊之下，她几乎是无意志地回答问题，像条件反射一样。"},{"en":"The author describes the character’s daily routine as nonvolition, driven more by habit than by desire.","zh":"作者把角色的日常描写成“无意志”的生活——更多是习惯在驱动，而不是欲望。"}]}],"synonyms":["lack of volition","unintentionality","involuntariness","automatism"],"phonetic":"/ˌnɑnvəˈlɪʃən/","extraExplanation":["“non-”表示“非/无”，volition 来自拉丁语 volo（“我想/我愿意”）。所以 nonvolition 常用于哲学、心理学或文学评论中，用来谈“没有主观意志介入”的行为或心理状态。","在日常英语里，这个词比较少见；更常用的表达包括：lack of intention（缺乏意图）、without intending to（无意地）、not by choice（非自愿）。"]}
{"word":"nonvolitional","summary":{"en":"Nonvolitional means not controlled by your will—an automatic, unintentional action or reaction.","zh":"nonvolitional 指“不由意志控制、非刻意”的行为或反应，常用于医学/心理等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not done by conscious choice or will; happening automatically or without intending to.","zh":"非出于意志的；不由自主的；非刻意的。"},"examples":[{"en":"Blushing is often a nonvolitional reaction to embarrassment.","zh":"脸红常常是对尴尬的一种非意志性反应。"},{"en":"His nonvolitional tremor made it hard to hold the cup steady.","zh":"他不由自主的颤抖让他很难稳稳拿住杯子。"},{"en":"The doctor asked whether the movement was voluntary or nonvolitional.","zh":"医生询问这种动作是自主的还是非自主的。"}]}],"synonyms":["involuntary","unintentional","automatic","reflexive"],"phonetic":"/ˌnɑnvəˈlɪʃənəl/","extraExplanation":["这个词常见于医学、心理学和法律语境，用来区分“自愿/有意识控制（voluntary）”与“非自愿/无法控制（nonvolitional）”的行为或反应，例如反射、抽搐、惊跳反应等。","词形结构：non-（不、非）+ volition（意志、选择）+ -al（形容词后缀）。日常口语里更常用 involuntary（非自愿的、不由自主的）来表达相近意思。"]}
{"word":"nonvolubility","summary":{"en":"Nonvolubility means being not talkative—speaking little or showing quiet reserve.","zh":"nonvolubility 指“不健谈、话少”，表现为寡言或含蓄克制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being voluble; a tendency to speak very little; taciturnity","zh":"不健谈；寡言；沉默寡语的特质"},"examples":[{"en":"In meetings, her nonvolubility was often mistaken for a lack of interest, but she was simply a careful listener.","zh":"在会议上，她的寡言常被误认为不感兴趣，但其实她只是认真倾听。"},{"en":"His nonvolubility made the interview short, so the journalist relied more on written answers.","zh":"他的不健谈让采访很简短，所以记者更多依靠书面回答。"}]}],"synonyms":["taciturnity","reticence","quietness","reservedness"],"phonetic":"/ˌnɑnˌvɑljəˈbɪləti/","extraExplanation":["“non- + volubility”构词：non- 表示“非/不”，volubility 来自 voluble（健谈的、口才好的）。因此 nonvolubility 表达“缺乏健谈特质”。","这个词比较少见、偏书面；日常英语里更常用 taciturnity（寡言）、quietness（安静少言）、reservedness（矜持/内向）、not very talkative（不太爱说话）。","使用时注意语气：描述一个人的说话风格时，nonvolubility 往往更“中性/客观”，不像 “silent” 有时带有刻意不说话或气氛压抑的感觉。"]}
{"word":"nonvoluble","summary":{"en":"Nonvoluble means not talkative or not fluent in speaking.","zh":"nonvoluble 指“不健谈的、沉默寡言的（不太愿意或不太善于开口）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not talkative; not fluent or ready in speech.","zh":"不健谈的；不善言辞的；说话不流利或不愿多说的。"},"examples":[{"en":"He was nonvoluble in meetings, but his written feedback was clear and helpful.","zh":"他在会议上不太爱说话，但书面反馈很清晰也很有帮助。"},{"en":"After the argument, she became unusually nonvoluble and kept to herself.","zh":"争吵之后，她变得格外沉默寡言，把自己封闭起来。"}]}],"synonyms":["reticent","taciturn","reserved","quiet","uncommunicative"],"phonetic":"/nɑnˈvɑljəbəl/","extraExplanation":["“nonvoluble”由前缀 non-（不、非）+ voluble（健谈的、口若悬河的）构成，整体意思就是“not voluble”。在现代英语中它比较少见，更常用的表达是 “quiet / reserved / reticent / taciturn”。","“voluble”源自拉丁语词根，带有“滚动、流畅地涌出”的意象，所以形容说话像话语滚滚而来；“nonvoluble”则强调这种“话多且流畅”的特征缺失。"]}
{"word":"nonvolubleness","summary":{"en":"Nonvolubleness means a lack of talkativeness—being quiet or not speaking much.","zh":"nonvolubleness 指“不健谈、少言寡语”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being not talkative; a tendency to speak little (lack of volubility)","zh":"不健谈；寡言少语的特质（缺乏口若悬河的表达）"},"examples":[{"en":"His nonvolubleness made the interview feel slow, but he was thoughtful when he did speak.","zh":"他的寡言让采访显得节奏很慢，但他一开口就很有思考。"},{"en":"In meetings, her nonvolubleness was often mistaken for disinterest.","zh":"在会议上，她的少言常被误解为不感兴趣。"}]}],"synonyms":["taciturnity","reticence","quietness","reserve","silence"],"phonetic":"/ˌnɑnˈvɑljəbəlnəs/","extraExplanation":["这个词非常少见，更多时候人们会用更常见的词来表达相近意思，比如：taciturnity（沉默寡言）、reticence（克制少言）、quietness（安静）。","构词法很直观：non-（不）+ voluble（健谈的）+ -ness（名词后缀）。因为“voluble”本身较偏书面语，所以“nonvolubleness”也更像文学或学术风格的造词。"]}
{"word":"nonvolubly","summary":{"en":"Nonvolubly means “not talkatively; with few words.”","zh":"nonvolubly 意为“并不健谈地；话很少地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not talkative or not fluent with words; quietly or with few words.","zh":"以不健谈、不善言辞的方式；沉默寡言地、话很少地。"},"examples":[{"en":"He answered nonvolubly, giving only a short “yes.”","zh":"他回答得很不健谈，只简短地说了声“是”。"},{"en":"She sat nonvolubly through the meeting, taking notes but rarely speaking.","zh":"她在会议中沉默寡言地坐着，记笔记但很少发言。"}]}],"synonyms":["quietly","briefly","taciturnly","reticently","tersely"],"phonetic":"/nɑnˈvɑljəbli/","extraExplanation":["“nonvolubly”由前缀 non-（不、非）+ voluble（健谈的、口才好的）+ -ly（副词后缀）构成。它多用于描写说话方式或交流氛围，语气偏书面。日常口语中更常用 quietly、briefly、not very talkatively。"]}
{"word":"nonvoluntary","summary":{"en":"Nonvoluntary means not chosen or intended by the person, often in formal or legal contexts.","zh":"nonvoluntary 指“非自愿的、非本人选择或意愿所致的”，常用于正式或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not done by choice; happening without a person’s intention or control (often used in formal or legal contexts).","zh":"非自愿的；不是出于本人选择而发生的（常见于正式或法律语境）。"},"examples":[{"en":"She made a nonvoluntary movement when the doctor tapped her knee.","zh":"医生敲她的膝盖时，她出现了非自愿的动作。"},{"en":"The court ruled that his nonvoluntary absence was caused by a medical emergency.","zh":"法院裁定他缺席并非自愿，而是由医疗紧急情况导致的。"}]}],"synonyms":["involuntary","unintentional","unwilling"],"phonetic":"/ˌnɑnˈvɑlənˌtɛri/","extraExplanation":["“nonvoluntary”比“involuntary”更少见，写作中更常用“involuntary”。但在法律、医疗或行政文件里，“nonvoluntary”有时用来强调“不是本人主动选择/同意的”。","前缀“non-”表示“非、不”，加在“voluntary（自愿的）”前，形成否定意义。常见搭配：nonvoluntary commitment（非自愿住院/强制治疗）、nonvoluntary movement（非自愿动作）、nonvoluntary absence（非自愿缺席）。"]}
{"word":"nonvortical","summary":{"en":"“Nonvortical” means not vortical—without a vortex or swirling rotation (often used in fluid/air flow contexts).","zh":"“nonvortical”指“非涡旋的”，即没有涡流/不呈现旋转回旋特征（常用于流体或气流描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not forming a vortex; not involving swirling or rotational flow.","zh":"非涡旋的；不形成涡流的；不涉及旋转/回旋流动的。"},"examples":[{"en":"In a nonvortical flow, the fluid does not swirl around a central point.","zh":"在非涡旋流动中，流体不会围绕某个中心点旋转。"},{"en":"The engineer adjusted the design to keep the airflow mostly nonvortical.","zh":"工程师调整了设计，使气流尽量保持为非涡旋状态。"}]}],"synonyms":["non-rotational","irrotational","not swirling","without a vortex"],"phonetic":"/nɑnˈvɔrtɪkəl/","extraExplanation":["“nonvortical”多用于物理/工程语境（如流体力学、空气动力学），与“vortical（涡旋的）”相对。它通常描述流场中缺少明显的旋转结构（例如看不到空气/水形成漩涡）。","词形上：non-（否定前缀）+ vortical（涡旋的）。在更基础或通用的英语里，人们也常说“without a vortex / not swirling / non-rotational flow”。"]}
{"word":"nonvortically","summary":{"en":"“Nonvortically” means “without vortices; in an irrotational way,” mainly used in technical writing about fluid flow.","zh":"“nonvortically”意为“无涡地、非涡旋地”，主要用于描述流体运动等技术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a nonvortical way; without forming vortices (swirling, rotating motion), especially in fluid flow.","zh":"以非涡旋（无旋）方式；不形成涡流（旋转、回旋运动），多用于流体运动的语境。"},"examples":[{"en":"In idealized models, the fluid moves nonvortically, so the vorticity is zero everywhere.","zh":"在理想化模型中，流体以非涡旋方式运动，因此各处的涡量都为零。"},{"en":"The paper assumes the air flows nonvortically around the object at low speeds.","zh":"这篇论文假设在低速下空气绕过物体时为非涡旋流动。"}]}],"synonyms":["irrotationally","without vortices","in an irrotational manner"],"phonetic":"/ˌnɑnˈvɔrtɪkli/","extraExplanation":["“nonvortically”并不是日常英语中的常见词，更多出现在流体力学/物理学写作里，表示“无涡（irrotational）地”。更常见的表达是“irrotationally”或“in a nonvortical/irrotational manner”。","构词上可以理解为 non-（不、非）+ vortical（涡旋的）+ -ly（副词后缀）。如果你是在论文或作业里看到它，也可能是作者临时造词或较少见的用法。"]}
{"word":"nonvoter","summary":{"en":"A nonvoter is someone who does not vote.","zh":"nonvoter 指不投票的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who does not vote, especially in an election they are eligible to vote in.","zh":"不投票者；（尤指有资格投票却）不参与投票的人。"},"examples":[{"en":"Nonvoters can strongly affect election results when turnout is low.","zh":"当投票率低时，不投票者会强烈影响选举结果。"},{"en":"The campaign tried to persuade nonvoters to register and show up on election day.","zh":"竞选团队试图说服不投票者去登记，并在投票日出来投票。"}]}],"synonyms":["abstainer (from voting)","nonparticipant (in voting)"],"phonetic":"/nɑnˈvoʊtɚ/","extraExplanation":["“non-”是常见前缀，表示“否定/不/非”。因此 nonvoter = non-（不）+ voter（投票者）。","在美国政治语境中，nonvoter 常用于讨论“投票率（turnout）”与公民参与（civic participation）。有时也会细分为未登记的非投票者（unregistered nonvoters）和已登记但未投票者（registered nonvoters）。"]}
{"word":"nonvoters","summary":{"en":"“Nonvoters” means people who do not vote in an election.","zh":"“nonvoters”指在选举中不投票的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who do not vote in an election (either by choice or because they are unable to vote).","zh":"在选举中不投票的人（可能是自愿不投票，或因无法投票）。"},"examples":[{"en":"The campaign tried to persuade nonvoters to register and show up on election day.","zh":"竞选团队试图说服不投票的人登记，并在选举日去投票。"},{"en":"High numbers of nonvoters can change the outcome of an election.","zh":"大量不投票的人可能会改变选举结果。"}]}],"synonyms":["people who don’t vote","abstainers","nonvoting citizens"],"phonetic":"/ˌnɑnˈvoʊtɚz/","extraExplanation":["在英语新闻与社会讨论中，nonvoters 常用来分析“投票率（voter turnout）”与民主参与度：例如研究哪些群体更可能成为 nonvoters，以及背后的原因（不信任政治、时间成本、登记或投票流程障碍等）。","nonvoter 是单数；nonvoters 是复数。写作中也常见同义表达：people who don’t vote / abstainers（偏正式）。"]}
{"word":"nonvoting","summary":{"en":"Nonvoting means having no voting rights or not participating in voting, especially for certain members or types of shares.","zh":"nonvoting 指“无投票权的/不参与投票的”，常用于描述某些成员身份或无投票权股份。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not allowed to vote, or not taking part in voting.","zh":"无投票权的；不参与投票的。"},"examples":[{"en":"Nonvoting members can attend meetings, but they cannot vote on decisions.","zh":"无投票权成员可以参加会议，但不能对决定进行表决。"},{"en":"The club has nonvoting volunteers who help with events.","zh":"这个俱乐部有不参与投票的志愿者，负责协助活动。"},{"en":"She was listed as a nonvoting delegate at the conference.","zh":"她在会议上被列为不参与投票的代表。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Business/finance) Describing shares or stock that do not give the owner the right to vote in company matters.","zh":"（商贸/金融）指不赋予持有人公司表决权的股份/股票。"},"examples":[{"en":"The company issued nonvoting shares to raise money without giving up control.","zh":"公司发行无投票权股票来融资，同时不放弃控制权。"},{"en":"Nonvoting stock may still pay dividends.","zh":"无投票权股票仍可能发放股息。"}]}],"synonyms":["without voting rights","disenfranchised","non-elective"],"phonetic":"/nɑnˈvoʊtɪŋ/","extraExplanation":["“non-”是英语里很常见的否定前缀，表示“不是/没有”。所以 nonvoting = non-（无） + voting（投票的）。","在公司治理语境里，nonvoting shares（无投票权股）常用于让创始人或管理层保持投票控制权，同时让投资者获得经济收益（如分红）。不同国家/交易所对这类股票的规则可能不同。"]}
{"word":"nonvulcanizable","summary":{"en":"Nonvulcanizable means not capable of being vulcanized to become stronger, more elastic rubber.","zh":"nonvulcanizable 指“不能被硫化处理、无法通过硫化变成更强、更有弹性的橡胶”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to be vulcanized (not able to be chemically treated—usually with sulfur—to make rubber stronger and more elastic).","zh":"不可硫化的；不能进行硫化处理的（通常指材料无法通过硫等化学处理来增强橡胶的强度与弹性）。"},"examples":[{"en":"This polymer is nonvulcanizable, so it won’t form the strong rubber network used in tires.","zh":"这种聚合物不可硫化，因此无法形成轮胎中那种坚固的橡胶交联网络。"},{"en":"The lab rejected the sample as nonvulcanizable and chose a different elastomer.","zh":"实验室认定该样品不可硫化，于是选用了另一种弹性体材料。"}]}],"synonyms":["not vulcanizable","incapable of vulcanization","non-crosslinkable (in some contexts)"],"phonetic":"/ˌnɑnˌvʌl.kəˈnaɪ.zə.bəl/","extraExplanation":["“硫化（vulcanization）”是把橡胶与硫（或过氧化物等体系）加热反应，使分子链之间形成“交联”，从而提升耐磨、耐热、弹性与强度。","“nonvulcanizable”常见于材料科学、橡胶工程与工业标准语境，描述某种橡胶/聚合物因化学结构或配方原因无法有效交联，因此不适合需要硫化性能的用途（如轮胎、密封件等）。"]}
{"word":"nonvulcanized","summary":{"en":"Nonvulcanized means “not vulcanized,” especially describing rubber before it is cured and strengthened by heat/sulfur treatment.","zh":"nonvulcanized 意为“未硫化的”，多指尚未经过加硫加热处理、尚未固化变强的橡胶。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of rubber) not vulcanized; not treated with sulfur/heat to become stronger, more elastic, and more stable.","zh":"（指橡胶）未硫化的；未经过加硫与加热处理，因此强度、弹性与稳定性较差。"},"examples":[{"en":"Nonvulcanized rubber is soft and can become sticky in warm weather.","zh":"未硫化橡胶很软，在天气热时可能会变黏。"},{"en":"The factory stores nonvulcanized sheets separately before curing them.","zh":"工厂会在硫化（固化）前把未硫化的胶片单独存放。"},{"en":"Gloves made from nonvulcanized rubber wear out faster.","zh":"用未硫化橡胶做的手套磨损得更快。"}]}],"synonyms":["unvulcanized","uncured","unprocessed"],"phonetic":"/ˌnɑnˈvʌlkəˌnaɪzd/","extraExplanation":["“vulcanize（硫化）”源于罗马火神 Vulcan（伏尔甘/武尔坎）：硫化会让橡胶在高温或低温下都更不易变形、不开裂。工业中也常用“uncured（未固化的）”来表达相近概念，但在橡胶领域里“unvulcanized/nonvulcanized”更精确。"]}
{"word":"nonvulgarities","summary":{"en":"“Nonvulgarities” means polite, non-offensive expressions or things that are not vulgar.","zh":"“nonvulgarities”指文明、得体、不冒犯的表达或不粗俗之物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"polite or non-offensive words, expressions, or behaviors; things that are not vulgar (plural of “nonvulgarity”).","zh":"（nonvulgarity 的复数）不粗俗的言语、表达或行为；非下流之物。"},"examples":[{"en":"The editor removed the vulgarities and replaced them with nonvulgarities suitable for younger readers.","zh":"编辑删掉了粗俗用语，换成适合年轻读者的文明表达。"},{"en":"He tried to keep the conversation full of nonvulgarities at the family dinner.","zh":"在家庭聚餐时，他尽量让谈话保持文明得体。"}]}],"synonyms":["polite language","clean language","non-offensive language","civil language","proper language"],"phonetic":"/ˌnɑn vʌlˈɡɛrətiz/","extraExplanation":["这个词比较少见，常用于强调“刻意不用粗话/低俗表达”。更常见的说法包括：polite language（礼貌用语）、clean language（文明用语）、non-offensive language（不冒犯的语言）。","构词上是 non-（不、非）+ vulgarity（粗俗、下流的言语/行为）。写作中有时用来和 vulgarities（粗话）形成对比，带一点幽默或刻意正式的语气。"]}
{"word":"nonvulgarity","summary":{"en":"Nonvulgarity means being not vulgar—showing politeness and good taste in speech, behavior, or style.","zh":"nonvulgarity 指“不粗俗”，强调言行或风格上的礼貌、得体与有品味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being not vulgar; politeness and good taste in language, behavior, or style","zh":"不粗俗；（语言、行为或风格的）得体与文雅"},"examples":[{"en":"The comedian’s nonvulgarity made the show suitable for families.","zh":"这位喜剧演员的表演不粗俗，让节目适合全家观看。"},{"en":"She spoke with nonvulgarity even when she was angry.","zh":"即使生气，她说话也依然很得体。"},{"en":"The film aims for humor with nonvulgarity, avoiding crude jokes.","zh":"这部电影追求不粗俗的幽默，避免低级笑话。"}]}],"synonyms":["politeness","propriety","refinement","good taste","decency"],"phonetic":"/ˌnɑn vʌlˈɡærəti/","extraExplanation":["“nonvulgarity”在英语里不算常用，更常见的表达是“politeness / good taste / propriety / refinement”（礼貌、品味、得体、文雅）。","词首“non-”表示“非、不”，加在“vulgarity（粗俗）”前面，构成“非粗俗”的抽象名词。写作中用它可以更强调“刻意避免粗俗”的态度。"]}
{"word":"nonvulval","summary":{"en":"“Nonvulval” means not related to the vulva.","zh":"“nonvulval”表示“与外阴无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving, relating to, or located on the vulva","zh":"不涉及外阴的；与外阴无关的；不位于外阴的"},"examples":[{"en":"The doctor explained that the pain was nonvulval and likely coming from the pelvic muscles.","zh":"医生解释说疼痛并非外阴部位的，很可能来自盆底肌肉。"},{"en":"Some infections cause nonvulval symptoms such as lower abdominal discomfort.","zh":"有些感染会引起非外阴的症状，例如下腹不适。"}]}],"synonyms":["non-vulval","not vulval"],"phonetic":"/nɑnˈvʌlvəl/","extraExplanation":["“nonvulval”常见于医学语境，用来把“外阴（vulval）的问题”与“外阴以外（如阴道、盆腔、泌尿系统或皮肤其他部位）的问题”区分开。","拼写上也常见连字符形式“non-vulval”。在就医或阅读健康信息时，这个词通常用于更准确地描述症状位置，便于判断可能的原因。"]}
{"word":"nonvulvar","summary":{"en":"“Nonvulvar” means not involving the vulva or outside the vulvar area, mainly used in medical writing.","zh":"“nonvulvar”指“非外阴的/外阴之外的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not involving the vulva; located outside the vulvar area (used in medical contexts).","zh":"（医学用语）非外阴的；不涉及外阴的；位于外阴区域之外的。"},"examples":[{"en":"The doctor noted nonvulvar irritation, mainly around the inner thigh.","zh":"医生记录为非外阴部位的刺激，主要在大腿内侧。"},{"en":"They ruled out a vulvar infection because the symptoms were nonvulvar.","zh":"由于症状并非外阴相关，他们排除了外阴感染。"}]}],"synonyms":["outside the vulvar area","not vulvar","extragenital (context-dependent)"],"phonetic":"/nɑnˈvʌlvɚ/","extraExplanation":["这是一个较少见的医学形容词：non-（非/不）+ vulvar（外阴的）。常用于病历或检查记录，表示症状或病变不在外阴区域，或与外阴无直接关系。","由于涉及私密部位，日常交流中更常用更委婉或更具体的表述，例如 “not on the vulva / outside the vulvar area（不在外阴/外阴之外）”，在就医时也可以直接请医生说明具体部位。"]}
{"word":"nonvvacua","summary":{"en":"nonvvacua is likely meant to be “non vacua,” meaning “not empty; non-empty,” often used in academic contexts.","zh":"nonvvacua 很可能是“non vacua”的误拼，意思是“非空 / 不为空”，常用于学术语境。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Likely a misspelling of the Latin phrase “non vacua” (“not empty”), used in academic writing (especially math/logic) to say that a set, domain, or condition contains at least one element (i.e., it is non-empty).","zh":"很可能是拉丁语短语“non vacua”（意为“非空 / 不为空”）的误拼。常见于学术写作（尤其数学/逻辑），表示某个集合、论域或条件“至少包含一个元素”，即“非空”。"},"examples":[{"en":"Assume the domain is non vacua, so there exists at least one element.","zh":"假设论域是 non vacua（非空）的，因此至少存在一个元素。"},{"en":"The set must be non vacua for the statement to make sense.","zh":"这个集合必须是 non vacua（非空）的，这个陈述才有意义。"}]}],"synonyms":["non-empty","not empty","has at least one element"],"phonetic":"/nɑn ˈvækjuə/","extraExplanation":["“non vacua”来自拉丁语：non = “不”；vacua = “空的”。在现代英语学术语境里，通常更常写成英文“non-empty”或“not empty”。","你输入的“nonvvacua”中多了一个 v。若你是在阅读数学/逻辑/哲学材料，原文很可能是“non vacua”。"]}

