{"word":"nonzealous","summary":{"en":"Nonzealous means not enthusiastic or not strongly interested.","zh":"nonzealous 指“不热心的、不热衷的”，缺乏强烈热情或投入。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not zealous; not showing strong enthusiasm, passion, or energy for something","zh":"不热心的；不热衷的；缺乏强烈热情或投入的"},"examples":[{"en":"He gave a nonzealous response when asked to volunteer for the event.","zh":"当被问到是否愿意为活动当志愿者时，他的回应显得不太热心。"},{"en":"Her nonzealous attitude made it hard for the team to stay motivated.","zh":"她不够热衷的态度让团队很难保持动力。"},{"en":"The campaign drew a nonzealous crowd, so the organizers changed their strategy.","zh":"这场活动吸引的人群反应平平，于是组织者调整了策略。"}]}],"synonyms":["unenthusiastic","lukewarm","halfhearted","indifferent","apathetic"],"phonetic":"/nɑnˈzɛləs/","extraExplanation":["“non-”是否定前缀，表示“非、没有”；“zealous”来自“zeal（热忱、热情）”。合起来 nonzealous 就是“没有热忱的”。","语气上，nonzealous 往往比 “uninterested（不感兴趣）”更弱一点：不一定完全没兴趣，只是缺少强烈的投入或积极性。","在日常口语中更常见的说法是 “not very enthusiastic / not very keen / lukewarm”。nonzealous 更偏书面或正式一点。"]}
{"word":"nonzealously","summary":{"en":"“Nonzealously” means doing something without much enthusiasm or passion.","zh":"“nonzealously”表示做事不热衷、缺乏热情或投入。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not zealous; without strong enthusiasm, passion, or eagerness.","zh":"不热衷地；不热心地；缺乏强烈热情或投入地。"},"examples":[{"en":"He worked on the project nonzealously, doing only what was required.","zh":"他做这个项目不太投入，只完成了要求的部分。"},{"en":"She listened nonzealously, as if her mind were elsewhere.","zh":"她听得不太专注，仿佛心思不在这里。"},{"en":"The proposal was supported nonzealously by a few members.","zh":"这项提案只得到了少数成员不太热情的支持。"}]}],"synonyms":["halfheartedly","unenthusiastically","apathetically","reluctantly","without enthusiasm"],"phonetic":"/ˌnɑnˈzɛləsli/","extraExplanation":["“non-”是英语常见前缀，表示“非、不是、缺乏”。“zeal”表示“热忱、热情”，形容词是“zealous（热心的）”，加上副词后缀“-ly”变成“zealously（热心地）”。“nonzealously”由此构成，但在日常英语里比较少见，更常用的表达是“without much enthusiasm / halfheartedly / not very eagerly”。"]}
{"word":"nonzealousness","summary":{"en":"Nonzealousness means a lack of zeal or enthusiasm.","zh":"Nonzealousness 指缺乏热情或积极性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of zeal; an unenthusiastic or not strongly committed attitude toward something","zh":"缺乏热情；对某事不够积极或不强烈投入的态度"},"examples":[{"en":"Her nonzealousness about the project worried the team.","zh":"她对这个项目缺乏热情，让团队很担心。"},{"en":"The manager mistook his quiet style for nonzealousness.","zh":"经理把他安静的风格误认为是不够积极。"},{"en":"A little nonzealousness can be healthy when work-life balance is needed.","zh":"在需要工作与生活平衡时，适度的“不那么拼”有时反而是健康的。"}]}],"synonyms":["lack of enthusiasm","lack of zeal","unenthusiasm","halfheartedness","indifference"],"phonetic":"/ˌnɑnˈzɛləsnəs/","extraExplanation":["这个词比较少见，更常用的表达是 “lack of enthusiasm/zeal” 或 “indifference”。它由 non-（不）+ zealous（热情的）+ -ness（名词后缀）构成，表示一种“没有热情的状态”。","在语气上，“nonzealousness”通常比 “apathy”（冷漠）更温和，可能只是“不积极/不投入”，不一定意味着完全不在乎。"]}
{"word":"nonzebra","summary":{"en":"“Nonzebra” means “not a zebra,” often used as a playful or simple classification term.","zh":"nonzebra 表示“非斑马的／不是斑马”，常用于趣味或简单分类的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not a zebra; not belonging to the category “zebra.”","zh":"非斑马的；不属于“斑马”这一类别的。"},"examples":[{"en":"In the children’s game, you must shout “zebra” for striped animals and “nonzebra” for the rest.","zh":"在这个儿童游戏里，遇到有条纹的动物要喊“zebra”，其他的要喊“nonzebra”。"},{"en":"The vet confirmed the animal was a nonzebra species from a different region.","zh":"兽医确认这只动物不是斑马，而是来自另一个地区的物种。"}]},{"partOfSpeech":"n.","definition":{"en":"something that is not a zebra (often used humorously or in simple logic/classification examples).","zh":"非斑马的东西（常用于幽默表达或逻辑/分类的例子中）。"},"examples":[{"en":"If you can spot the zebra quickly, everything else becomes a nonzebra.","zh":"如果你能很快找到斑马，那么其他所有东西就都成了“nonzebra”。"},{"en":"The worksheet asks students to circle the zebras and cross out the nonzebras.","zh":"练习题让学生圈出斑马，把非斑马的都划掉。"}]}],"synonyms":["non-zebra","not a zebra","non-zebra animal"],"phonetic":"/ˌnɑnˈziːbrə/","extraExplanation":["“non-”是英语里非常常见的前缀，表示“非……、不……”。因此 nonzebra 字面意思就是“不是斑马”。","更自然、常见的写法通常是加连字符：non-zebra（尤其在正式写作中）。不加连字符的 nonzebra 更像是临时造词（nonce word），常出现在教学、游戏或类比说明里。"]}
{"word":"nonzero","summary":{"en":"Nonzero means “not equal to 0,” commonly used in math and computing.","zh":"nonzero 指“非零、不是 0”，常用于数学与计算机语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not equal to zero; having a value other than 0.","zh":"非零的；不等于 0 的。"},"examples":[{"en":"The program returns a nonzero exit code when an error occurs.","zh":"当发生错误时，程序会返回一个非零的退出码。"},{"en":"Any nonzero number divided by itself equals 1.","zh":"任何非零数除以它本身都等于 1。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/Science) Having at least one component, coefficient, or value that is not zero.","zh":"（数/理）含有至少一个不为 0 的分量、系数或数值的。"},"examples":[{"en":"Assume the vector is nonzero before normalizing it.","zh":"在对向量归一化之前，先假设它是非零向量。"},{"en":"We need a nonzero probability to make the event possible.","zh":"我们需要一个非零概率，事件才有可能发生。"}]}],"synonyms":["not zero","non-null (computing context)","non-nil (programming context)"],"phonetic":"/ˌnɑnˈzɪroʊ/","extraExplanation":["“non-”是英语里表示否定的前缀，意思是“不是……/非……”。因此 nonzero 直译就是“不是零”。","在计算机领域，很多系统用“0 表示成功、非 0 表示失败或某种错误类型”，所以你会常见到“nonzero exit code/return value”（非零退出码/返回值）。"]}
{"word":"nonzodiacal","summary":{"en":"Nonzodiacal means “not of the zodiac; outside the zodiac constellations.”","zh":"nonzodiacal 意为“非黄道的；不属于黄道十二星座的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not relating to the zodiac; outside the zodiac (the band of constellations along the Sun’s apparent path in the sky).","zh":"非黄道的；不属于黄道十二宫（沿着太阳视运动路径分布的那条星座带）之内的。"},"examples":[{"en":"Orion is a famous nonzodiacal constellation because it is not one of the twelve zodiac constellations.","zh":"猎户座是著名的非黄道星座，因为它不属于黄道十二星座之一。"},{"en":"The book compares zodiacal and nonzodiacal constellations to show how the sky is organized.","zh":"这本书比较了黄道与非黄道星座，来说明天空是如何被分类整理的。"}]}],"synonyms":["non-zodiacal","outside the zodiac","extra-zodiacal"],"phonetic":"/ˌnɑnzoʊˈdaɪəkəl/","extraExplanation":["“zodiacal”来自希腊语 zōidiakos，意为“与小动物（星座图像）有关的”。在天文学里，黄道（ecliptic）附近的星座带被称为“黄道带（zodiac）”，传统上分成十二个星座；因此“nonzodiacal”常用来指那些不在这条带上的星座或事物。"]}
{"word":"nonzonal","summary":{"en":"“Nonzonal” means “not zonal,” describing patterns that do not follow zonal (banded or west-to-east) organization, especially in meteorology and geography.","zh":"“nonzonal”意为“非带状的/非纬向的”，常用于气象与地理，指不符合带状（或主要东西向）组织形式的分布或形势。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not zonal; not arranged in zones or moving mainly west-to-east (especially in geography or meteorology).","zh":"非带状的；不按“分带/带状”排列或不以主要东西向（尤其在地理、气象中）的形式分布或移动。"},"examples":[{"en":"A nonzonal climate pattern can bring unusual weather to many regions at once.","zh":"非带状的气候形势可能会让多个地区同时出现反常天气。"},{"en":"The map shows nonzonal vegetation because mountains disrupt the usual latitudinal zones.","zh":"这张图显示植被呈非带状分布，因为山地打破了常见的纬向分带。"}]}],"synonyms":["not zonal","non-zonal","meridional (in meteorology, often related)"],"phonetic":"/ˌnɑnˈzoʊnəl/","extraExplanation":["“zonal”常指“按纬度呈带状分布”或（在气象学里）“大尺度西风带主导、气流主要西→东”的形势；“nonzonal”则强调被地形、海陆差异、阻塞高压等因素打破后的“经向性更强/不呈规则带状”的状态。","该词多见于学术或技术语境（气象、气候、地理、生态学），日常英语里较少用；日常表达更常说 “not zonal” 或用更具体的词（如 “meridional flow” 经向气流）。"]}
{"word":"nonzonally","summary":{"en":"“Nonzonally” means “not by zones or belts; in a non-zonal way,” mainly in technical writing.","zh":"“nonzonally”意为“非按分区或带状来（地）；以非带状方式”，多见于技术/学术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not zonal; not arranged, analyzed, or organized by zones or belts.","zh":"以非分区（非带状）方式；不是按区域/带状来安排、分析或组织。"},"examples":[{"en":"The data were grouped nonzonally to highlight local differences within each city.","zh":"这些数据以非分区方式分组，以突出每座城市内部的局部差异。"},{"en":"In some models, energy moves nonzonally rather than mainly from west to east.","zh":"在一些模型中，能量以非带状方式传输，而不是主要从西向东。"}]}],"synonyms":["not zonally","non-zonally","in a nonzonal way","outside zonal patterns"],"phonetic":"/ˌnɑnˈzoʊnəli/","extraExplanation":["“zonal”常见于气象/海洋（如 *zonal wind* 西风带方向的风、沿纬向的流动）、地理与城市规划（分区 *zoning*）、以及统计分析（按区域分组）。因此 *nonzonally* 多用于学术或技术写作，强调“不是按纬向带/分区来描述”，而是按局地、径向、经向或其他方式来看。","词形：non-（否定前缀）+ zonal（带状的/分区的）+ -ly（副词后缀）。日常英语中很少用，通常出现在论文、报告或专业说明里。"]}
{"word":"nonzonate","summary":{"en":"Nonzonate means “not zoned” or “without banded/ring-like zones,” used mainly in technical descriptions.","zh":"Nonzonate 指“无分区/无环带纹（不分带）”，主要用于技术性（生物学等）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Not forming zones or bands; lacking a zoned pattern (for example, in a fungus colony, tissue, or a surface marking).","zh":"（罕见/专业用语）不形成分区或环带的；没有“分带/同心环”等分区花纹的（例如用于描述真菌菌落、组织或表面纹理）。"},"examples":[{"en":"Under the microscope, the colony looked nonzonate, with uniform color from center to edge.","zh":"在显微镜下，这个菌落呈现为 nonzonate（不分带），从中心到边缘颜色都很均匀。"},{"en":"The report describes the lesion as nonzonate, meaning it shows no ring-like zones.","zh":"报告把该病灶描述为 nonzonate，意思是它没有类似环状的分区。"}]}],"synonyms":["unbanded","uniform","without zoning","non-banded"],"phonetic":"/ˌnɑnˈzoʊneɪt/","extraExplanation":["这个词非常少见，通常出现在生物学、真菌学、植物病理学等描述性写作中，用来对比 zonate（有分带/有环带纹）一词。","构词上是 non-（不、非）+ zonate（有分区的、呈带状分布的）。日常英语里几乎不用；一般会改用更常见的表达，如 “without bands / without zoning / uniform in appearance”。"]}
{"word":"nonzonated","summary":{"en":"Nonzonated means not divided into zoning districts, often describing land without zoning regulation.","zh":"nonzonated 指未实行土地分区管理的（不受分区法规约束的）区域或土地。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not divided into zones or districts (especially areas not regulated by zoning laws).","zh":"未分区的；不按区域（分区法规）管理的（尤指不受土地分区法限制的地区）。"},"examples":[{"en":"The warehouse is in a nonzonated part of the county, so there are fewer land-use restrictions.","zh":"这座仓库位于该县的非分区地区，因此土地使用限制更少。"},{"en":"They chose nonzonated land to build a workshop, but they still checked environmental rules.","zh":"他们选择了未分区的土地来建工作间，但仍然核查了环保规定。"}]}],"synonyms":["unzoned","not zoned","unregulated (in zoning)"],"phonetic":"/ˌnɑnˈzoʊneɪtɪd/","extraExplanation":["“nonzonated”常见于美国房地产、城市规划与地方政府文件中，描述“没有实施分区（zoning）管理”的区域。分区通常规定某块地能做住宅、商业、工业等用途；非分区地区往往更灵活，但仍可能受建筑规范（building codes）、环保规定、消防安全等限制。","词形结构：non-（不、非）+ zonated（已分区的）。更常见的近义表达还有“unzoned / not zoned”。"]}
{"word":"nonzoologic","summary":{"en":"Nonzoologic means “not related to animals or zoology.”","zh":"nonzoologic 意为“非动物学的；与动物或动物学无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to zoology (the scientific study of animals); not about animals.","zh":"非动物学的；与动物学（研究动物的科学）无关的；不是关于动物的。"},"examples":[{"en":"The museum has both zoologic and nonzoologic exhibits, such as minerals and plants.","zh":"这家博物馆既有动物学展品，也有非动物学展品，比如矿物和植物。"},{"en":"We will focus on nonzoologic factors like climate and soil.","zh":"我们将关注气候和土壤等非动物学因素。"}]}],"synonyms":["nonzoological","not zoological","non-animal (context-dependent)"],"phonetic":"/ˌnɑnˌzoʊəˈlɑdʒɪk/","extraExplanation":["“nonzoologic”较少见，更常用的写法是“nonzoological”。两者意思相同，都表示“非动物学的”。","词根提示：zoo-（动物）+ -logic/-logical（……方面的/与……有关的）；加上前缀non-表示“非、不”。"]}
{"word":"nonzoological","summary":{"en":"Nonzoological means “not related to animals or zoology.”","zh":"nonzoological 指“与动物或动物学无关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to animals or the study of animals (zoology).","zh":"与动物或动物学（zoology）无关的；非动物学的。"},"examples":[{"en":"The museum has both zoological and nonzoological exhibits, such as minerals and plants.","zh":"这家博物馆既有动物学展品，也有非动物学展品，比如矿物和植物。"},{"en":"The researchers focused on nonzoological factors like climate and soil.","zh":"研究人员关注的是气候和土壤等非动物学因素。"}]}],"synonyms":["not zoological","non-animal","nonfaunal"],"phonetic":"/ˌnɑnˌzuːəˈlɑdʒɪkəl/","extraExplanation":["这个词较少用于日常口语，更常见于学术/分类语境，用来把“与动物有关的”内容和其他领域（如植物学、地质学、生态环境因素等）区分开。","词形结构：non-（不、非）+ zoological（动物学的）。其中 zoo- 来自希腊语 zōion（动物）。"]}
{"word":"nonzoologically","summary":{"en":"“Nonzoologically” means “not in a zoological (animal-science) way,” focusing on something other than zoology.","zh":"nonzoologically 意为“不是从动物学角度/方式”，强调关注点不在动物科学上。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not zoological; not from the viewpoint or methods of zoology (the scientific study of animals).","zh":"以非动物学（非从研究动物的角度/方法）方式；不是从动物学观点出发。"},"examples":[{"en":"The film uses animals symbolically, not nonzoologically as scientific subjects.","zh":"这部电影把动物当作象征，而不是以非动物学意义上那种“科学研究对象”的方式来呈现。"},{"en":"She discussed the lion nonzoologically, focusing on its role in myths rather than biology.","zh":"她谈论狮子时并非从动物学角度，而是强调它在神话中的角色，而不是生物学特征。"}]}],"synonyms":["not zoologically","from a non-zoological perspective","outside zoology"],"phonetic":"/ˌnɑnzuəˈlɑdʒɪkli/","extraExplanation":["这个词非常罕见，多见于需要刻意对比“zoologically（从动物学角度）”的语境。通常更自然的表达是：not zoologically / outside zoology / from a non-zoological perspective。","构词：non-（不、非）+ zoologically（动物学地）。写作中有时也会写成 non-zoologically（加连字符）以提高可读性。"]}

