{"word":"noo","summary":{"en":"“Noo” is an informal spelling of “no,” mainly used in casual texting to add a playful tone.","zh":"“noo”是“no”的非正式写法，多用于聊天中增加调皮/撒娇的语气。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard, playful spelling of “no,” used to show a cute, childish, or joking tone in writing.","zh":"“no（不）”的非标准、带玩笑或装可爱语气的拼写，用在文字里表现幼稚、撒娇或调侃的感觉。"},"examples":[{"en":"Noo, don’t take my fries!","zh":"不要啦，别拿我的薯条！"},{"en":"She texted, “noo,” but she was laughing, so I knew she was joking.","zh":"她发“noo”，但又在笑，所以我知道她是在开玩笑。"}]}],"synonyms":["no","nope"],"phonetic":"/noʊ/","extraExplanation":["“noo”在标准英语里不是正规拼写，更多是网络/聊天中的拟声式写法，用来传达语气（撒娇、耍赖、卖萌、开玩笑）。正式写作、邮件或考试里建议用标准拼写“no”。","如果你想表达更强烈的拒绝或夸张的情绪，英语里更常见的是拉长写成“nooo!”（多个 o），而不是“noo”。"]}
{"word":"noodge","summary":{"en":"“Noodge” means to pester or nag someone repeatedly, or a person who does that.","zh":"“noodge”指反复纠缠、唠叨地催人，或指这样爱缠人的人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pester or nag someone repeatedly; to keep bothering someone for something","zh":"（反复）纠缠、唠叨、催促（某人）；不停地烦某人要某事"},"examples":[{"en":"He keeps noodging me to lend him my car.","zh":"他一直纠缠我，想让我把车借给他。"},{"en":"Stop noodging—I'll do it after dinner.","zh":"别再催了——我晚饭后会做的。"},{"en":"She noodged her manager for a day off.","zh":"她一直缠着经理想请一天假。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who pesters or nags; an annoying, persistent requester","zh":"纠缠者；爱唠叨/爱催的人；烦人的“缠人精”"},"examples":[{"en":"Don't be a noodge—just ask once and wait.","zh":"别当个纠缠的人——问一次就好，然后等回复。"},{"en":"My little brother can be such a noodge when he wants snacks.","zh":"我弟弟想吃零食的时候特别爱缠人。"}]}],"synonyms":["nag","pester","badger","bug","hassle"],"phonetic":"/nʊdʒ/","extraExplanation":["“noodge”常见于美式英语口语，来自意第绪语（Yiddish）词源（常写作 nudzh / nudge），多与犹太裔美国人的口语文化相关。语气通常带点玩笑或抱怨，但比强烈的辱骂更轻。","注意不要和常见词“nudge”（轻推/轻轻提醒）混淆：noodge 更偏“烦人地催、纠缠”；nudge 更偏“轻推一下或委婉提醒”。"]}
{"word":"noodged","summary":{"en":"Nudge means a gentle push, or a gentle encouragement (a hint/reminder).","zh":"Nudge 指“轻轻推一下”，也可指“委婉地提醒/推动”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to push someone or something gently with your elbow or hand, often to get attention or move it slightly","zh":"（用胳膊肘或手）轻轻推（某人或某物），常用于引起注意或稍微移动"},"examples":[{"en":"She nudged me to remind me it was my turn to speak.","zh":"她轻轻推了我一下，提醒轮到我说话了。"},{"en":"He nudged the door open with his shoulder.","zh":"他用肩膀把门轻轻顶开。"}]},{"partOfSpeech":"vt.","definition":{"en":"to encourage someone gently to do something (often by giving a small hint or reminder)","zh":"（用暗示或提醒）轻轻推动/鼓励某人去做某事"},"examples":[{"en":"A friend nudged me to apply for the job.","zh":"朋友提醒我去申请那份工作。"},{"en":"The teacher nudged the students toward a better answer.","zh":"老师引导学生往更好的答案方向想。"}]},{"partOfSpeech":"n.","definition":{"en":"a gentle push, especially with an elbow, to get attention or signal something","zh":"轻推；（尤指用胳膊肘）示意性的轻碰"},"examples":[{"en":"He gave me a nudge when the meeting started.","zh":"会议开始时，他轻碰了我一下示意。"}]}],"synonyms":["poke","tap","elbow","prompt","encourage"],"phonetic":"/nʌdʒ/","extraExplanation":["“noodged”通常是拼写错误，更常见的正确拼写是“nudged”（nudge 的过去式/过去分词）。","“nudge”除了“轻推”以外，也常用于比较委婉的“提醒/推动”，语气比“push”更温和。"]}
{"word":"noodges","summary":{"en":"A nudge is a gentle push or a gentle way to encourage someone; “nudges” is the plural or third-person singular form.","zh":"nudge 指“轻推/轻碰”或“温和地促使”；nudges 是其复数或第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to gently push someone or something, often with your elbow, to get attention or move it slightly","zh":"（常用肘）轻推；轻碰（为了引起注意或让东西稍微移动）"},"examples":[{"en":"She nudged me when the teacher called my name.","zh":"老师叫到我名字时，她轻推了我一下。"},{"en":"He nudged the door open with his shoulder.","zh":"他用肩膀把门轻轻顶开了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to encourage or persuade someone in a gentle way to do something","zh":"温和地劝说；轻轻推动（某人去做某事）"},"examples":[{"en":"My friends nudged me to apply for the job.","zh":"朋友们鼓励我去申请那份工作。"},{"en":"The coach nudged the team toward better communication.","zh":"教练温和地引导球队加强沟通。"}]},{"partOfSpeech":"n.","definition":{"en":"a gentle push or touch, especially with your elbow, used to get attention or give a hint","zh":"轻推；轻碰（尤指用肘碰一下，用来提醒或暗示）"},"examples":[{"en":"He gave me a nudge to remind me to speak.","zh":"他轻推了我一下，提醒我该说话了。"},{"en":"I took the nudge as a sign to leave early.","zh":"我把那次提醒当作该早点走的信号。"}]}],"synonyms":["prompt","encourage","prod","elbow"],"phonetic":"/nʌdʒ/","extraExplanation":["你输入的“noodges”通常是拼写错误；标准拼写多为“nudges”（nudge 的第三人称单数/复数名词）或原形“nudge”。","用法小提示：nudge 往往表示“轻轻提醒/推动”，语气比 nag（唠叨、烦人地催）更温和。"]}
{"word":"noodging","summary":{"en":"Nudging means giving a gentle push or a small encouragement to prompt action.","zh":"nudging 指轻轻推一下或温和地“推一把”以促使行动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"gently pushing someone or something with a small movement, often with your elbow, hand, or body.","zh":"轻轻推（某人或某物）；常指用胳膊肘、手或身体轻推。"},"examples":[{"en":"He kept nudging me to look at the surprise.","zh":"他一直轻推我，示意我看那个惊喜。"},{"en":"She nudged the door open with her foot.","zh":"她用脚把门轻轻顶开。"}]},{"partOfSpeech":"v.","definition":{"en":"gently encouraging or reminding someone to do something (a small “push” toward an action or decision).","zh":"轻轻促使/提醒（某人做某事）；指用温和的方式“推一把”。"},"examples":[{"en":"The teacher’s message was nudging students to start early.","zh":"老师的留言是在提醒学生尽早开始。"},{"en":"My friend nudged me to apologize.","zh":"朋友温和地劝我去道歉。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of giving a gentle push or a small encouragement.","zh":"轻推；轻微的推动或温和的督促。"},"examples":[{"en":"With a quick nudging from his sister, he finally spoke up.","zh":"在妹妹轻轻推了一下之后，他终于开口了。"}]}],"synonyms":["pushing","prodding","prompting","encouraging","urging"],"phonetic":"/ˈnʌdʒɪŋ/","extraExplanation":["你输入的“noodging”在英语里不常见，最可能是拼写误差，常见正确形式是“nudging”（来自动词 nudge）。","nudge 的核心感觉是“轻轻推一下”，既可以是身体上的推，也可以是心理上的“温柔提醒/推动”。","相关常见搭配：nudge someone to do something（促使某人做某事）；a nudge in the right direction（朝正确方向的一点点推动/提示）。"]}
{"word":"noodle","summary":{"en":"“Noodle” most commonly means a long, thin pasta/strand food; informally, it can also mean to casually experiment or think without a plan.","zh":"“noodle”最常见意思是“面条”；口语中也可作动词，表示随性地试试、瞎琢磨或即兴涂鸦/弹奏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, thin strip of pasta or a similar food made from flour (or other starch), water, and sometimes eggs, usually boiled and eaten in soup or with sauce.","zh":"面条；（也可指）由面粉（或其他淀粉）加水（有时加蛋）制成的细长条状食物，通常煮熟后配汤或酱汁食用。"},"examples":[{"en":"I made chicken noodle soup for dinner.","zh":"我晚餐做了鸡肉面汤。"},{"en":"These noodles go well with a spicy peanut sauce.","zh":"这种面条很适合配辣味花生酱。"},{"en":"In many Asian cuisines, noodles are a common everyday staple.","zh":"在许多亚洲菜系里，面条是很常见的日常主食。"}]},{"partOfSpeech":"v.","definition":{"en":"To think or play around with an idea in a relaxed, unfocused way; to doodle or improvise casually.","zh":"（非正式）随意地琢磨/瞎想；（也指）随手涂鸦；（音乐等）即兴瞎弹、随便试试。"},"examples":[{"en":"I was just noodling with a melody on the piano.","zh":"我只是在钢琴上随便试着弹一段旋律。"},{"en":"She noodled around with different designs before choosing one.","zh":"她先随便试了几种设计，最后才选定一个。"}]}],"synonyms":["pasta (food sense)","strand (shape sense)","doodle (verb sense)","improvise (verb sense)"],"phonetic":"/ˈnuːdəl/","extraExplanation":["“Noodle”作名词时在美式英语里既可指意面（pasta）类的“面条”，也常泛指亚洲面条（如拉面、乌冬、米粉等）。具体是哪一种，通常靠语境或搭配词说明：例如 ramen noodles（拉面）、egg noodles（鸡蛋面）、rice noodles（米粉）。","“Noodle”作动词是很口语的用法，强调“没有明确目标、随性地试一试/琢磨”，常见搭配有 noodle around / noodle with sth。"]}
{"word":"noodled","summary":{"en":"“Noodled” is the informal past tense of “noodle,” meaning to mess around, think casually, or play music improvisationally.","zh":"“noodled”是非正式动词“noodle”的过去式，可表示瞎混/随便弄、随意地思考，或（在音乐中）即兴随手弹奏。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(informal) Past tense of “noodle”: to play around, waste time, or do something in a relaxed, unplanned way.","zh":"（非正式）“noodle”的过去式：指瞎混、磨蹭，或以轻松、没计划的方式随便做事。"},"examples":[{"en":"We noodled around online instead of studying.","zh":"我们没学习，反而在网上瞎逛。"},{"en":"I noodled in the kitchen and somehow made a decent soup.","zh":"我在厨房里随便弄了弄，结果还做出了一锅不错的汤。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal) Past tense of “noodle”: to think about something slowly or casually; to puzzle over an idea.","zh":"（非正式）“noodle”的过去式：慢慢地、随意地思考；琢磨一个想法。"},"examples":[{"en":"She noodled over the problem for a while and then found a simple answer.","zh":"她琢磨了一会儿这个问题，然后想到了一个简单的答案。"},{"en":"I noodled on what to say before the meeting.","zh":"开会前我想了想该说什么。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal, music) Past tense of “noodle”: to play an instrument in a casual, improvisational way (often without a clear song).","zh":"（非正式，音乐）“noodle”的过去式：随意即兴地弹奏乐器（常常不是在认真演奏一首曲子）。"},"examples":[{"en":"He noodled on the guitar while we talked.","zh":"我们聊天时，他随手拨弄着吉他。"},{"en":"They noodled at the piano, trying out a few chords.","zh":"他们在钢琴上随意弹了弹，试了几个和弦。"}]}],"synonyms":["messed around","fiddled","played around","pondered","improvised"],"phonetic":"/ˈnuːdəld/","extraExplanation":["“noodle”作动词非常口语，多见于美式英语。常见搭配：noodle around（瞎混/随便弄）、noodle on/over（琢磨）、noodle on the guitar/piano（随手即兴弹）。它通常语气轻松，不带强烈贬义，但在学习/工作语境下可能暗示“不够认真”。"]}
{"word":"noodledom","summary":{"en":"noodledom: a playful word meaning the world/culture of noodles.","zh":"noodledom：俏皮说法，指“面条的世界/面文化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A playful, informal term for the world or culture of noodles (noodle dishes, noodle-making, and noodle lovers).","zh":"一个俏皮、非正式的说法，指“面条的世界/面文化”（包括面食、做面、爱吃面的人与相关文化）。"},"examples":[{"en":"After moving to Japan, she happily explored noodledom—ramen shops, udon stands, and soba bars.","zh":"搬到日本后，她开心地探索“面条世界”——拉面店、乌冬摊和荞麦面馆。"},{"en":"His blog is dedicated to noodledom, from hand-pulled noodles to instant noodles.","zh":"他的博客专写“面文化”，从手工拉面到方便面都有。"}]}],"synonyms":["noodle culture","the world of noodles","noodle scene"],"phonetic":"/ˈnuːdəlˌdɑːm/","extraExplanation":["“noodledom”由 noodle（面条）+ -dom 构成；-dom 常表示“领域/状态/群体”，如 kingdom（王国）、freedom（自由）、fandom（粉丝圈）。因此 noodledom 多用于幽默或美食写作，强调“面条圈/面食江湖”的感觉。","这个词不算常见，更偏创意表达；正式写作中通常用 “noodle culture” 或 “the world of noodles”。"]}
{"word":"noodlehead","summary":{"en":"A noodlehead is an informal word for a silly or foolish person, often used in a teasing way.","zh":"noodlehead 是非正式用语，指“傻乎乎/糊涂的人”，多为调侃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A silly or foolish person; someone who isn’t thinking clearly (often teasing, sometimes mildly insulting).","zh":"（非正式）傻瓜；糊涂的人（常带调侃语气，有时也略带冒犯）。"},"examples":[{"en":"Don’t be a noodlehead—double-check the address before you drive.","zh":"别犯傻——开车前先把地址再核对一遍。"},{"en":"I forgot my password again. I’m such a noodlehead.","zh":"我又忘了密码。我真是个糊涂蛋。"},{"en":"He called me a noodlehead, but he was joking.","zh":"他叫我“傻瓜”，但只是开玩笑。"}]}],"synonyms":["goofball","dummy","silly goose","airhead","blockhead"],"phonetic":"ˈnuːdəlˌhɛd","extraExplanation":["“noodlehead”语气通常比更粗鲁的骂人话轻一些，常用于朋友、家人之间的打趣；对不熟的人使用可能会显得不礼貌。","词里“noodle”在英语里可引申为“脑袋/想法”（例如动词 *noodle on* 表示“琢磨”），所以 *noodlehead* 带有“脑子不灵光”的幽默感。"]}
{"word":"noodleism","summary":{"en":"“Noodleism” is an informal, humorous word meaning either a love of noodles or a joking ‘noodle-based’ belief/ism (sometimes meme-related).","zh":"“noodleism”是非正式、带幽默色彩的词，可指“爱吃面条的倾向/生活方式”，也可指玩笑式的“面条主义/面条信仰”（有时与网络梗相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, humorous) A strong liking for noodles, or a lifestyle/attitude centered on eating or making noodles.","zh":"（非正式／幽默）对面条的强烈喜爱；或一种以吃面、做面为中心的生活方式/态度。"},"examples":[{"en":"His “noodleism” means he tries a new ramen shop every weekend.","zh":"他的“noodleism”就是每个周末都要去尝一家新的拉面店。"},{"en":"In our dorm, noodleism is practically a survival skill during exams.","zh":"在我们宿舍，“noodleism”几乎是考试周的生存技能。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare; often used jokingly) A made-up “-ism” word meaning a belief system connected to noodles; sometimes used to refer to Pastafarian-style humor about “noodly” religion.","zh":"（较少见；常带玩笑）一个把“面条”说成某种“主义/信仰体系”的造词；有时会借用“面条式宗教”那类幽默，影射类似“飞天意面神教”的梗。"},"examples":[{"en":"They called it noodleism, but it was really just a joke about a ‘noodly’ religion.","zh":"他们称之为“noodleism”，但其实只是拿“面条式宗教”开玩笑。"},{"en":"Online, “noodleism” can pop up in memes rather than serious writing.","zh":"在网上，“noodleism”更常出现在梗图里，而不是严肃写作中。"}]}],"synonyms":["noodle obsession","ramen addiction (humorous)","foodie humor","Pastafarianism (related in some contexts)"],"phonetic":"/ˈnuːdəlɪzəm/","extraExplanation":["“noodleism”不是常见词，更多是临时造词（把 noodle + -ism 组合起来），所以含义很依语境变化。","如果你想表达“飞天意面神教”，更常见的说法是 Pastafarianism；也有人写作 noodlism（拼写可能不同）。"]}
{"word":"noodles","summary":{"en":"“Noodles” most commonly means long thin strips of cooked dough used in soups, stir-fries, or with sauce; as a verb, “to noodle” can mean to waste time/think casually or to play an instrument casually.","zh":"“noodles”最常指面条；作动词“noodle”可指磨蹭/随便想想，也可指随意弹奏乐器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A food made from dough (often wheat, rice, or other starch) that is shaped into long thin strips, cooked, and eaten in soups, stir-fries, or with sauce.","zh":"面条；由面团（常见小麦、米等淀粉）制成，压成或拉成细长条状，煮熟后可做汤面、炒面或拌酱食用的食物。"},"examples":[{"en":"I’m making noodles for dinner—do you want them in soup or stir-fried?","zh":"我晚餐要做面条——你想吃汤面还是炒面？"},{"en":"She added noodles to the broth and let them cook for three minutes.","zh":"她把面条放进汤里，煮了三分钟。"},{"en":"In many cultures, noodles are a comfort food.","zh":"在很多文化里，面条是一种让人感到安心的家常食物。"}]},{"partOfSpeech":"v.","definition":{"en":"Informal: to waste time or think lazily or without a clear plan; to mess around.","zh":"（非正式）磨蹭；瞎琢磨；漫无目的地打发时间、瞎折腾。"},"examples":[{"en":"Stop noodling around and finish your homework.","zh":"别再瞎磨蹭了，快把作业做完。"},{"en":"He noodled on the idea for a while before making a decision.","zh":"他把这个想法琢磨了一阵子才做决定。"}]},{"partOfSpeech":"v.","definition":{"en":"In music, to play a musical instrument in a casual, unplanned way (often testing sounds or improvising).","zh":"（音乐）随意弹奏；即兴试音、随便弹一弹（常指吉他、钢琴等）。"},"examples":[{"en":"He was noodling on the guitar while we talked.","zh":"我们聊天时，他在旁边随意弹着吉他。"}]}],"synonyms":["noodle (singular)","pasta (related, but not identical)","rice noodles","egg noodles"],"phonetic":"/ˈnuːd(ə)lz/","extraExplanation":["“noodles”通常用复数形式来指“面条这种食物”（比如：I like noodles.）。要表达“一根/一条面条”时，可以说 a noodle，但日常更常说 a strand of noodle / a piece of noodle（尤其在强调形状时）。","不同文化里“noodles”的范围很广：意大利的 pasta 有时也被宽泛地算进“noodles”，但在英语里 pasta 通常更特指意大利面；而 ramen、udon、soba、rice noodles（米粉/河粉）等都很自然地叫 noodles。"]}
{"word":"noodling","summary":{"en":"“Noodling” usually means casually exploring ideas or casually improvising music; in the U.S. it can also mean catching catfish by hand.","zh":"“noodling”通常指随意琢磨/尝试或随兴即兴弹奏；在美国也可指徒手抓鲶鱼的捕鱼方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Casual, playful thinking or experimenting without a strict plan; messing around to explore ideas.","zh":"（非正式）随意地思考或尝试、没有严格计划地探索想法；瞎琢磨/随便试试。"},"examples":[{"en":"I spent the afternoon noodling on a new design for the app.","zh":"我整个下午都在随便琢磨一个新的应用设计。"},{"en":"Stop noodling and tell me your final answer.","zh":"别再瞎琢磨了，告诉我你的最终答案。"},{"en":"We were just noodling around with different options.","zh":"我们只是随便试着比较不同的选项。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, music) Casual improvising or playing an instrument without practicing a specific piece.","zh":"（非正式，音乐）随兴即兴弹奏/随便弹弹，不专门练某一首曲子。"},"examples":[{"en":"He sat down at the piano and started noodling.","zh":"他坐到钢琴前，开始随兴弹了起来。"},{"en":"She was noodling on the guitar while waiting for rehearsal to start.","zh":"她在等排练开始时随便拨弄着吉他。"}]},{"partOfSpeech":"n.","definition":{"en":"(U.S., outdoor) A method of catching catfish by hand, feeling for fish in holes underwater and grabbing them (often called “catfish noodling”).","zh":"（美国，户外）用手抓鲶鱼的方法：把手伸进水下洞穴摸到鱼后直接抓住（常说“catfish noodling”）。"},"examples":[{"en":"They went noodling for catfish in the river.","zh":"他们去河里用手抓鲶鱼。"},{"en":"Catfish noodling can be dangerous if you don’t know the area.","zh":"如果不熟悉水域，用手抓鲶鱼可能很危险。"}]}],"synonyms":["messing around","fiddling","playing around","tinkering","improvising"],"phonetic":"ˈnuːd(ə)lɪŋ","extraExplanation":["“noodling”来自动词“noodle”，常见搭配是“noodle around / noodle about”，语气偏口语，表示“随便弄弄、瞎琢磨”。在工作语境里，有时带一点“效率不高”的暗示；在创意或音乐语境里，多为中性甚至偏积极（探索、即兴）。","“catfish noodling”是美国部分地区的民间捕鱼方式，带有强烈地域文化色彩；新闻、纪录片里较常见，但日常对话中提到通常需要补充解释。"]}
{"word":"nook","summary":{"en":"A nook is a small, sheltered corner or a little out-of-the-way spot, often cozy or hidden.","zh":"nook 指小而隐蔽的角落或偏僻的小地方，常带有舒适或隐藏的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, quiet, sheltered corner or recess, especially a comfortable place to sit or read.","zh":"（尤指适合坐着或阅读的）小角落；隐蔽、安静的地方"},"examples":[{"en":"She curled up in a cozy nook by the window with a book.","zh":"她蜷在窗边一个舒适的小角落里看书。"},{"en":"There’s a little breakfast nook next to the kitchen.","zh":"厨房旁边有一个小小的早餐角。"},{"en":"The cat was hiding in a dark nook under the stairs.","zh":"猫躲在楼梯下一个黑暗的角落里。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, out-of-the-way place or spot in general (often used in the phrase “nooks and crannies”).","zh":"（泛指）偏僻的小地方；小角落（常用于短语“nooks and crannies”）"},"examples":[{"en":"We explored every nook and cranny of the old house.","zh":"我们把那栋老房子的每个角角落落都探了一遍。"},{"en":"Dust collects in the nooks of the keyboard.","zh":"灰尘会积在键盘的缝隙和角落里。"}]}],"synonyms":["corner","recess","alcove","cranny","hideaway"],"phonetic":"/nʊk/","extraExplanation":["“nook”常带有温馨、私密、舒适的感觉，尤其在“reading nook（阅读角）”“cozy nook（温馨角落）”等搭配中很常见。","固定搭配“nooks and crannies”意思是“各个角落/缝隙”，强调“到处都是、细小难找的地方”。","文学与日常描写里，“nook”常用来营造安静、避世的氛围，比如描写人物躲进小角落思考、休息或阅读。"]}
{"word":"nooked","summary":{"en":"“Nooked” can mean “full of nooks” (descriptive/literary), or it can be the past form of a rare verb meaning “to tuck something into a nook.”","zh":"“nooked”可表示“有许多角落/凹处的”（较文学化），也可作较少见动词“nook”的过去式，意为“把东西塞进角落里/藏起来”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one or more small corners or recesses (nooks); full of little hidden spaces.","zh":"有角落/凹处的；有许多小隐蔽处的。"},"examples":[{"en":"They rented a small, many-nooked cottage near the sea.","zh":"他们在海边租了一间有很多小角落的小屋。"},{"en":"The old library felt quiet and nooked, perfect for reading.","zh":"那座老图书馆安静而“多角落”，很适合阅读。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “nook”: to put or hide something in a nook; to tuck away.","zh":"“nook”的过去式/过去分词：把……放进角落里；把……藏进隐蔽处；塞进一隅。"},"examples":[{"en":"She nooked the letter inside a book so no one would see it.","zh":"她把信夹在书里藏起来，不让别人看见。"},{"en":"The snacks were nooked away in a high cabinet.","zh":"零食被藏在高处的橱柜里。"}]}],"synonyms":["tucked away","hidden","secluded","nook-filled","stashed"],"phonetic":"/nʊkt/","extraExplanation":["“nooked”不是很常见的现代英语词。更常见的表达是形容词“nook-filled / full of nooks（满是角落的）”，或动词短语“tuck away / stash（藏起来）”。","形容词用法常见于较文学化或描写性的语境，比如“many-nooked（有许多角落的）”，用来营造空间幽静、曲折、适合躲藏或阅读的氛围。"]}
{"word":"nookeries","summary":{"en":"“Nookeries” means hidden little places, or (in nature) animal breeding colonies; an older meaning refers to slum-like dens.","zh":"“nookeries”可指隐蔽的小角落，也可指（自然中的）动物繁殖群落；旧式用法还可指类似贫民窟/贼窝的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, sheltered, or hidden place (plural of “nookery”).","zh":"隐蔽的小角落；僻静处（“nookery”的复数）。"},"examples":[{"en":"The old library had little nookeries where you could read in peace.","zh":"那座老图书馆里有一些隐蔽的小角落，你可以安静阅读。"},{"en":"They built a cushion fort, turning the corner into one of their favorite nookeries.","zh":"他们用靠垫搭了个小堡垒，把角落变成最喜欢的隐蔽小天地之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A breeding colony or gathering place of animals (especially seabirds or seals); similar to “rookery.”","zh":"（尤指海鸟或海豹的）繁殖群落／栖息聚集地；类似“rookery（鸟兽繁殖地）”。"},"examples":[{"en":"The coastline is protected because it includes several seabird nookeries.","zh":"这段海岸受到保护，因为这里有几个海鸟繁殖群落。"},{"en":"Tour boats keep a distance from the seal nookeries during breeding season.","zh":"在繁殖季，观光船会与海豹繁殖地保持距离。"}]},{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned) A place associated with crime, poverty, or overcrowding; a den or slum.","zh":"（较旧式用法）犯罪、贫困或拥挤的聚集地；贼窝／贫民窟。"},"examples":[{"en":"In some 19th-century writing, the author describes the alleyways as “nookeries.”","zh":"在一些19世纪作品里，作者把小巷写成“nookeries”（阴暗拥挤之地）。"}]}],"synonyms":["hidden corners","retreats","hideaways","rookeries","breeding colonies"],"phonetic":"/ˈnʊkəriz/","extraExplanation":["词源上来自“nook（角落）+ -ery（表示场所/聚集处的后缀）”。因此既可指“隐蔽的小地方”，也可引申为“动物聚集繁殖地”。","第三个“贫民窟/贼窝”的含义在现代英语里较少用，阅读老小说、历史报道时更可能遇到。"]}
{"word":"nookery","summary":{"en":"Nookery means a sheltered little corner, or a breeding colony/site for animals (especially seabirds or seals).","zh":"nookery 指隐蔽的小角落，也可指动物（尤指海鸟或海豹等）的群栖繁殖地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A secluded or sheltered corner or small place, often used by birds or animals as a nesting or hiding spot.","zh":"（常指动物/鸟类用作筑巢或躲藏的）隐蔽角落，小隐秘处"},"examples":[{"en":"We found a quiet nookery by the lake where ducks nested each spring.","zh":"我们在湖边发现了一个安静的隐蔽处，每年春天鸭子都会在那里筑巢。"},{"en":"The garden had a leafy nookery that felt cool even at noon.","zh":"花园里有个树叶繁茂的小角落，即使中午也很凉快。"}]},{"partOfSpeech":"n.","definition":{"en":"A large breeding colony of certain animals, especially seabirds or seals (a rookery).","zh":"（尤指海鸟或海豹等的）大型繁殖地，群栖繁殖地"},"examples":[{"en":"The island is a protected nookery for seabirds during the breeding season.","zh":"这座岛在繁殖季是受保护的海鸟繁殖地。"},{"en":"Rangers keep visitors at a distance so they don’t disturb the seal nookery.","zh":"护林员让游客保持距离，以免打扰海豹的繁殖地。"}]}],"synonyms":["hideaway","secluded corner","nesting place","rookery","breeding colony"],"phonetic":"/ˈnʊkəri/","extraExplanation":["“nookery”来自“nook（角落）+ -ery（表示场所的后缀）”。在英式英语里，它既可指“隐蔽的小角落”，也常与“rookery（群栖繁殖地）”含义相近。现代用法中，“rookery”更常见；“nookery”有时带一点文学或描写自然景色的味道。"]}
{"word":"nookie","summary":{"en":"“Nookie” is a vulgar slang noun meaning sex, often casual.","zh":"“nookie” 是粗俗俚语名词，意思是“性/性行为”，常指随意性关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar) Sexual activity, especially casual sex.","zh":"（俚语，粗俗）性行为；（尤指）随意的性关系。"},"examples":[{"en":"The word “nookie” is slang for sex and can sound crude.","zh":"“nookie” 是指“性”的俚语，听起来可能比较粗俗。"},{"en":"They joked about “getting some nookie,” but it wasn’t appropriate at work.","zh":"他们开玩笑说“去弄点 nookie”，但在工作场合不合适。"}]}],"synonyms":["sex","hookup (informal)","getting laid (vulgar/informal)"],"phonetic":"/ˈnʊki/","extraExplanation":["这是非常口语化且带有粗俗色彩的词，常见于玩笑、流行文化或带挑逗意味的表达；在正式写作、课堂、职场或不熟的人面前应避免使用。","更中性/常用的替代说法包括：sex（中性但直白）、sexual activity（更正式）、hook up（口语，通常指发生性关系/暧昧）、sleep with someone（委婉表达）。","在流行文化中较有名的例子是 Limp Bizkit 的歌曲《Nookie》，也强化了它的“粗口俚语”语气。"]}
{"word":"nookier","summary":{"en":"“Nookier” means “more full of small, sheltered corners; cozier and more tucked away.”","zh":"“nookier”表示“更有隐蔽小角落的；更温馨、更藏起来的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Comparative of nooky) having more nooks—more small, sheltered corners or recesses; more cozy and tucked away.","zh":"（nooky 的比较级）有更多隐蔽小角落的；更“窝”更隐蔽、更有小凹处/角落的；更温馨更藏起来的。"},"examples":[{"en":"This café is nookier than the one on the main street, with little corners to sit and read.","zh":"这家咖啡馆比主街那家更“有小角落”，有很多小地方可以坐着看书。"},{"en":"We chose the nookier room because it felt quieter and more private.","zh":"我们选了更“隐蔽角落多”的那间房，因为感觉更安静、更有私密感。"}]}],"synonyms":["cozier","more secluded","more tucked away","snugger","more intimate"],"phonetic":"ˈnʊkiər","extraExplanation":["“nookier”来自名词 nook（角落、壁龛、隐蔽处）+ 形容词后缀 -y 变成 nooky（多角落的、隐蔽舒适的），再加比较级 -er。","在日常英语里更常见的表达是 “cozier / more secluded / more tucked away / with more nooks”。“nookier”能用，但属于较少见、偏描写性的用词。"]}
{"word":"nookies","summary":{"en":"“Nookies” is the plural of “nookie,” a vulgar slang word meaning sex (often casual).","zh":"“nookies”是“nookie”的复数，是较粗俗的俚语，指性行为（常指随意的性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nookie”: slang for sex, especially casual sex; often considered vulgar or crude.","zh":"“nookie”的复数：俚语，指性行为（尤其是随意的性），通常带有粗俗/下流的语气。"},"examples":[{"en":"The movie uses a lot of crude jokes about “nookies.”","zh":"这部电影用了很多关于“nookies”（性）的低俗笑话。"},{"en":"He kept bragging about getting “nookies,” which made everyone uncomfortable.","zh":"他一直吹嘘自己搞到“nookies”，让大家都很尴尬不舒服。"}]}],"synonyms":["sex","hookup","getting laid"],"phonetic":"/ˈnʊki/","extraExplanation":["“nookie”主要用于口语/俚语场景，语气往往偏粗鄙，不适合正式场合。更中性或礼貌的说法可以用“sex”“sleep with someone（和某人发生关系）”“hook up（勾搭/约炮，语气也偏口语）”。","在流行文化里，Limp Bizkit 有一首歌名叫《Nookie》（1999），也让这个词更广为人知；但它并不是一个“可爱”的词，更多是带挑衅或粗俗的感觉。"]}
{"word":"nookiest","summary":{"en":"“Nookiest” means “having the most cozy, hidden corners,” the superlative form of “nooky.”","zh":"“nookiest”表示“最有隐蔽温馨小角落的”，是“nooky”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “nooky”) having the most nooks; full of small, tucked-away corners and cozy hidden spaces.","zh":"（“nooky”的最高级）最有角落的；布满小角落、最隐蔽又温馨的。"},"examples":[{"en":"Of all the cafés on this street, this one is the nookiest—there are little seats hidden everywhere.","zh":"这条街上所有咖啡馆里，这家最“角落多”——到处都有藏起来的小座位。"},{"en":"The old library felt nookiest in winter, with warm lamps in every corner.","zh":"冬天时那座老图书馆最有“角落氛围”，每个角落都有暖黄色的灯。"}]}],"synonyms":["coziest","most tucked-away","snuggest","full of nooks and crannies","most secluded"],"phonetic":"/ˈnʊkiəst/","extraExplanation":["“nookiest”来自名词“nook”（角落、隐蔽处）衍生的形容词“nooky”（有许多角落的、很适合躲进去的），再加上最高级 -est。这个词不算常见，更常见的表达是“coziest”“most tucked-away”“full of nooks and crannies”。","注意别和俚语“nookie”（口语：性行为）混淆；拼写接近但含义与语域差异很大，正式场合避免使用“nookie”。"]}
{"word":"nooking","summary":{"en":"“Nooking” is uncommon; it can mean tucking something into a corner, or (very informal) having sex, and it’s often a misspelling of “nuking.”","zh":"“nooking”并不常见：可指把东西塞进角落；也可作非常口语的“发生性行为”；还常是把“nuking”误拼了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon) putting something into a small corner or sheltered place; tucking away.","zh":"（不常见）把某物放进小角落/隐蔽处；塞进、收好。"},"examples":[{"en":"She was nooking the letters into a drawer so no one would see them.","zh":"她把那些信塞进抽屉里，免得别人看到。"},{"en":"He kept nooking tools into every empty space in the shed.","zh":"他把工具往棚子里每个空着的地方都塞。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very informal slang, from “nookie”) having sex.","zh":"（非常口语俚语，源自 nookie）发生性行为。"},"examples":[{"en":"They were joking about nooking, but the word can sound crude.","zh":"他们在开玩笑说“nooking”，但这个词听起来可能比较粗俗。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “nuking” (heating food in a microwave, or destroying with nuclear weapons).","zh":"常被当作 “nuking” 的误拼（用微波炉加热食物，或用核武器摧毁）。"},"examples":[{"en":"If you mean microwave heating, the usual spelling is “nuking”: I’m nuking leftovers.","zh":"如果你是指用微波炉加热，常见拼法是“nuking”：我在微波加热剩菜。"}]}],"synonyms":["tucking away","stowing","hiding","(slang) hooking up","(often intended) nuking"],"phonetic":"/ˈnʊkɪŋ/","extraExplanation":["“nooking”在标准英语里不常见；更常见的是动词/名词“nook”（角落）及其相关表达，如 a cozy nook（舒适的小角落）。","俚语“nooking”（=nookie）带有粗俗或不正式的感觉，使用时要注意场合与听众。","如果你是在聊天里看到“nooking”，很多时候其实是把“nuking”拼错了；“nuke”在口语里常指“用微波炉叮一下”。"]}
{"word":"nooklet","summary":{"en":"A nooklet is a very small, cozy nook or hidden corner.","zh":"nooklet 指一个非常小、舒适隐蔽的角落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small nook; a tiny, sheltered corner or recess","zh":"小角落；（更）小而隐蔽的角落/凹处"},"examples":[{"en":"She found a quiet nooklet by the window to read in.","zh":"她在窗边找到一个安静的小角落读书。"},{"en":"The café has little nooklets where you can talk without being disturbed.","zh":"那家咖啡馆有一些小角落，可以不被打扰地聊天。"}]}],"synonyms":["nook","corner","cranny","recess","alcove"],"phonetic":"/ˈnʊklət/","extraExplanation":["“nooklet”在现代英语里比较少见，更常用的是“nook”“little nook”或“small corner”。","词尾“-let”常用来表示“小”的意思（如 booklet 小册子、streamlet 小溪流），所以“nook + -let”字面就是“更小的角落”。","因为它较不常用，在正式写作中建议用更常见的表达；在文学或描写性文字中用“nooklet”会显得更可爱、更精致。"]}
{"word":"nooklike","summary":{"en":"“Nooklike” means small and tucked away, like a cozy nook.","zh":"“nooklike”指像小角落一样小巧隐蔽，常带舒适安静的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a nook: small, tucked-away, and often cozy or sheltered.","zh":"像角落/小隐蔽处的：小巧、隐蔽，常给人舒适或被包围的感觉。"},"examples":[{"en":"She found a nooklike seat by the window and started reading.","zh":"她在窗边找到了一个像小角落一样的座位，开始读书。"},{"en":"The café has a nooklike corner that feels quiet even when it’s busy.","zh":"这家咖啡馆有个像小角落一样的区域，即使人多也显得安静。"}]}],"synonyms":["cozy","snug","secluded","tucked-away","sheltered"],"phonetic":"/ˈnʊkˌlaɪk/","extraExplanation":["“nooklike”由名词“nook（小角落/隐蔽处）+ -like（像……一样的）”构成，常用于描写空间带来的氛围：安静、私密、可躲开人群。","常见搭配：nooklike corner/alcove/space（角落/壁龛/空间）；也可用于比喻：a nooklike feeling of safety（像躲进角落般的安全感）。"]}
{"word":"nooks","summary":{"en":"“Nooks” means small, quiet corners or hidden spaces; it also appears in “nooks and crannies” meaning every little place.","zh":"“nooks”指小而安静、略隐蔽的角落/空间；也常用于“nooks and crannies”，表示每个小角落和缝隙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nook”: small, quiet, partly hidden spaces or corners, especially in a room or building.","zh":"“nook”的复数：指（房间或建筑里）小而安静、略隐蔽的角落/空间。"},"examples":[{"en":"The café has cozy nooks where you can read in peace.","zh":"那家咖啡馆有一些舒适的角落，你可以安静地读书。"},{"en":"Dust collects in the nooks behind the sofa.","zh":"沙发后面的各个角落里容易积灰。"}]},{"partOfSpeech":"n.","definition":{"en":"Small sheltered places in nature (between rocks, trees, etc.).","zh":"（自然环境中）隐蔽的小地方/避风处（如岩石间、树丛里）。"},"examples":[{"en":"Birds build nests in the nooks of the cliffs.","zh":"鸟会在悬崖的凹处筑巢。"},{"en":"We found shade in the nooks under the trees.","zh":"我们在树下的隐蔽处找到了阴凉。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the phrase “nooks and crannies”: every small place, including hard-to-reach spots.","zh":"用于短语“nooks and crannies”：指每个小角落，包括不容易够到的地方。"},"examples":[{"en":"I cleaned the kitchen, including all the nooks and crannies.","zh":"我把厨房打扫干净了，连每个小缝隙和角落都没放过。"},{"en":"The guidebook tells you to explore the city’s nooks and crannies.","zh":"旅游指南建议你去探索这座城市的各个小街巷与角落。"}]}],"synonyms":["corners","alcoves","recesses","hideaways","little spaces"],"phonetic":"/nʊks/","extraExplanation":["“nook”常见搭配有：a reading nook（阅读角）、a breakfast nook（早餐角/小餐区）。这些说法在北美家居语境中很常见，强调“温馨、私密的小空间”。","“nooks and crannies”是固定表达，语气偏口语，常用于清洁（灰尘藏在角落缝隙里）或形容“到处、每个细节”。"]}
{"word":"nooky","summary":{"en":"“nooky” is a vulgar slang noun meaning sex.","zh":"“nooky”是表示“性行为/性交”的粗俗俚语名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar) Sexual intercourse; sex.","zh":"（俚语，粗俗）性交；性行为。"},"examples":[{"en":"That word is slang for sex and can sound very rude.","zh":"这个词是“性行为”的俚语，听起来可能很粗俗。"},{"en":"In polite conversation, people usually avoid saying “nooky.”","zh":"在正式或礼貌的谈话中，人们通常会避免说“nooky”。"}]}],"synonyms":["sex","nookie (variant spelling)","hookup (context-dependent)","sleep with (more indirect)"],"phonetic":"/ˈnʊki/","extraExplanation":["“nooky”是非正式且带粗俗色彩的用语，多用于玩笑、流行文化或挑逗语境；在工作场合、课堂、公共场合通常不合适。","更常见的拼写是“nookie”。在流行文化中（例如歌曲标题）也会出现，因此你可能在歌词或影视对白里看到。","如果你想更礼貌地表达，可用“sex”“sleep together（更委婉）”“intimacy（较正式）”等。"]}
{"word":"noological","summary":{"en":"Noological means “related to the study of the mind or intellect (noology).”","zh":"noological 指“与心智/理智的研究（noology）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to noology—the study of the mind, intellect, or the nature of thinking and knowledge.","zh":"与“心智学 / 心灵研究（noology）”有关的；关于心智、理智或思维与认识本质的。"},"examples":[{"en":"The paper takes a noological approach to consciousness, focusing on how thinking itself is structured.","zh":"这篇论文用心智学的视角研究意识，重点讨论思维本身是如何被结构化的。"},{"en":"In his lecture, the philosopher used noological terms like “intellect” and “rational insight.”","zh":"在讲座中，这位哲学家使用了“理智”“理性直觉”等心智学相关术语。"},{"en":"Some critics argue that the novel’s noological themes are stronger than its plot.","zh":"有些评论者认为这部小说的心智主题比情节更突出。"}]}],"synonyms":["noetic","intellectual","cognitive","mental","philosophical"],"phonetic":"/ˌnoʊ.əˈlɑː.dʒɪ.kəl/","extraExplanation":["“noological”较少用于日常英语，多见于哲学、神学、心理学史或人文研究写作中。","词根来自希腊语 *nous*（心智、理性、精神），与“noetic（直觉的/心智的）”“noology（心智学）”同源。"]}
{"word":"noologist","summary":{"en":"A noologist is a scholar who studies the mind or consciousness (noology), mainly in philosophical or academic contexts.","zh":"noologist 指研究心智或意识（noology）的人，多用于哲学或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies noology (the study of the mind, intellect, or consciousness), often in philosophy or psychology.","zh":"研究“心灵学/理智学”（noology：关于心智、理性或意识的研究）的人，常见于哲学或心理学语境。"},"examples":[{"en":"As a noologist, she was interested in how ideas form and change in human consciousness.","zh":"作为一名心灵学研究者，她关注观念如何在人类意识中形成并变化。"},{"en":"The noologist compared different philosophical views of the intellect.","zh":"这位心灵学研究者比较了关于理智的不同哲学观点。"}]}],"synonyms":["scholar of consciousness","philosopher (approx.)","cognitive scientist (approx.)"],"phonetic":"/noʊˈɑlədʒɪst/","extraExplanation":["词源：来自希腊语 nous（心智、理性）+ -logist（研究者）。因此 noologist 直译接近“研究心智的人”。","使用提示：该词非常少见、偏学术；在一般英文中更常用 philosopher（哲学家）、cognitive scientist（认知科学家）、psychologist（心理学家）或 consciousness researcher（意识研究者）来表达相近概念。","相关词：noology（心灵学/理智学，研究领域名词）；noetic（与心智/直觉理解有关的，形容词，较正式）。"]}
{"word":"noology","summary":{"en":"Noology is a rare academic word meaning the study of the mind/intellect, or a theory about how thought is structured.","zh":"Noology 是较少见的学术词，指对心智/理智的研究，或关于思维结构与本质的理论体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study of the mind or intellect, especially focusing on how thinking and reasoning work.","zh":"心智（或理智）的研究；尤指对思维与推理如何运作的探讨。"},"examples":[{"en":"Her noology research looks at how people form abstract concepts.","zh":"她的心智哲学（noology）研究关注人们如何形成抽象概念。"},{"en":"In some philosophy courses, noology is discussed alongside logic and epistemology.","zh":"在一些哲学课程中，心智研究（noology）会与逻辑学和认识论一起讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"A system of ideas or a theory about the nature and structure of thought.","zh":"关于思维本质与结构的一套理论或思想体系。"},"examples":[{"en":"The author proposes a noology in which imagination is central to human knowledge.","zh":"作者提出一套心智理论（noology），认为想象力是人类知识的核心。"},{"en":"Different noologies can lead to different views of what counts as ‘rational.’","zh":"不同的心智理论（noology）可能会导致对“理性”标准的不同看法。"}]}],"synonyms":["philosophy of mind","study of the mind","cognitive theory","theory of mind","philosophical psychology"],"phonetic":"/noʊˈɑːlədʒi/","extraExplanation":["该词来自希腊语词根 *nous*（意为“心智、理性、智性”）+ *-logy*（“……之学”）。因此它常出现在哲学、神学、心理学史或现象学等语境中，但在日常英语里非常少见。","在哲学传统中，*nous* 有时指更高层次的“理智/智性”（不仅是一般的“头脑”），所以 noology 往往带有偏理论、偏形而上学的色彩。"]}
{"word":"noometry","summary":{"en":"Noometry is a rare noun meaning the measurement or systematic study of the mind or consciousness.","zh":"Noometry 是一个较少见的名词，指对心灵或意识进行测量或系统研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement or systematic study of the mind, consciousness, or mental processes (a rare term, sometimes used in philosophy or speculative psychology)","zh":"对心灵、意识或心理过程进行测量或系统研究（较少见的词，有时见于哲学或偏推测性的心理学语境）"},"examples":[{"en":"The author proposed a new kind of noometry to compare levels of attention during meditation.","zh":"作者提出了一种新的“心灵测量法”（noometry），用来比较冥想时的注意力水平。"},{"en":"In that essay, noometry is treated more as a philosophical idea than a strict scientific method.","zh":"在那篇文章里，noometry 更像是一种哲学概念，而不是严格的科学方法。"}]}],"synonyms":["psychometrics","measurement of the mind","noetics","study of consciousness"],"phonetic":"/noʊˈɑːmətri/","extraExplanation":["词源：noo- 来自希腊语 nous（意为“心智/理性/心灵”），-metry 表示“测量”（如 geometry 几何测量）。因此 noometry 字面意思是“对心智的测量”。","使用提醒：该词在日常英语中非常罕见；如果你想表达更常见、更学术的“心理测量”，通常用 psychometrics（心理测量学）。若想表达“关于心灵/意识的研究”，可用 noetics / the study of consciousness 等更常见的说法。"]}
{"word":"noon","summary":{"en":"Noon means 12:00 p.m., the middle of the day.","zh":"Noon 指中午12点，也就是一天的中间时段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"12 o’clock in the day; the middle of the day (when the sun is highest).","zh":"中午；正午（一天的中间时刻，太阳通常最高时）。"},"examples":[{"en":"Let’s meet at noon.","zh":"我们中午见。"},{"en":"The train arrives at exactly noon.","zh":"火车正好中午到。"},{"en":"It gets very hot around noon in summer.","zh":"夏天中午前后会很热。"}]}],"synonyms":["midday","twelve o’clock","noontime"],"phonetic":"/nun/","extraExplanation":["“Noon”来自拉丁语 *nona (hora)*，原意是“第九个小时”。在古罗马的计时方式里，白天从日出开始算，第九小时大约相当于下午3点；后来随着计时习惯变化，“noon”逐渐固定为“正午12点”。","常见搭配：at noon（在中午）、by noon（到中午为止/最迟中午）、around noon（中午左右）、high noon（正午；也常见于西部片语境）。"]}
{"word":"noonday","summary":{"en":"Noonday means midday (around noon) and can also describe something occurring at that time.","zh":"Noonday 表示“正午/中午”，也可作形容词指“发生在正午前后”的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Midday; the middle of the day (around 12:00 p.m.).","zh":"正午；中午（大约12点左右）。"},"examples":[{"en":"The sun was hottest at noonday.","zh":"正午时太阳最热。"},{"en":"We stopped for lunch at noonday.","zh":"我们在中午停下来吃午饭。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening at or relating to midday; occurring around noon.","zh":"正午的；发生在中午前后（与中午有关）的。"},"examples":[{"en":"They rested in the noonday heat.","zh":"他们在正午的炎热中休息。"},{"en":"A noonday meeting is scheduled for 12:30.","zh":"安排了一个中午12:30的会议。"}]}],"synonyms":["noon","midday","midday time","noontime"],"phonetic":"/ˈnuːnˌdeɪ/","extraExplanation":["“noonday”比“noon”更文学化、画面感更强，常用来强调正午的强烈阳光或炎热（如 noonday sun / noonday heat）。","在诗歌或宗教/古典语境里也常见，例如《圣经》英译中会出现“noonday”来增强庄重或抒情的语气。"]}
{"word":"noondays","summary":{"en":"“Noondays” means midday (plural), and in literary use it can mean the peak or prime of something.","zh":"“noondays”指“正午时分”（复数）；在文学语境中也可比喻“鼎盛/巅峰时期”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Midday; the time around noon when the sun is highest (plural form).","zh":"正午时分；中午前后太阳最高的时候（复数形式）。"},"examples":[{"en":"In summer, the streets are quiet at noondays because it’s too hot.","zh":"夏天的正午时分街上很安静，因为太热了。"},{"en":"We avoided hiking at noondays and went early in the morning instead.","zh":"我们避开正午时段去徒步，改成清晨出发。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) The brightest or strongest period of something; its peak (plural form).","zh":"（比喻，文学用法）某事物最辉煌、最强盛的时期；巅峰（复数形式）。"},"examples":[{"en":"In the noondays of the empire, trade reached every coast.","zh":"在帝国的鼎盛时期，贸易遍及各个海岸。"},{"en":"She was in the noondays of her career when the book won a major award.","zh":"那本书获得大奖时，她正处在事业的巅峰期。"}]}],"synonyms":["midday","noon","noontime","high noon","peak","prime"],"phonetic":"/ˈnuːnˌdeɪz/","extraExplanation":["“noonday”更常见，意思是“正午”。“noondays”多见于复数语境（多个日子的正午）或较有文学色彩的表达。","比喻用法常见结构是“in the noonday/noondays of …”，类似中文“鼎盛时期/如日中天”。","词形提示：noonday（单数）→ noondays（复数）；读音末尾会有清晰的 /z/ 音。"]}
{"word":"nooned","summary":{"en":"“Nooned” is a rare past form of “noon,” meaning to stop at midday for lunch or rest (often in travel).","zh":"“Nooned”是较少见的“noon”的过去形式，指在中午停下来吃午饭或休息（常见于旅行语境）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of “noon”) to stop around midday to rest or eat lunch, especially while traveling (rare/old-fashioned).","zh":"（“noon”的过去式/过去分词）在中午左右停下来休息或吃午饭，尤指旅行途中（较少见/较旧式）。"},"examples":[{"en":"We nooned by the river before continuing the hike.","zh":"我们在河边“中午歇脚/吃午饭”后继续徒步。"},{"en":"The caravan nooned in the shade to avoid the worst heat.","zh":"商队在树荫下中午停歇，以避开最热的时候。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide or take (a meal or rest) at noon; to pause a journey at midday (rare).","zh":"在中午安排/进行（午餐或休息）；使行程在正午暂停（较少见）。"},"examples":[{"en":"They nooned the horses and watered them at the stream.","zh":"他们让马匹中午休息，并在小溪边饮水。"},{"en":"The guide nooned the group near a small village.","zh":"向导把队伍安排在小村附近中午休整。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening at noon; midday (very rare).","zh":"发生在正午的；中午的（非常少见）。"},"examples":[{"en":"We left on a noon(ed) departure to catch the afternoon train.","zh":"我们中午出发，好赶上下午的火车。"}]}],"synonyms":["stopped for lunch","took a break","rested","paused","lunched"],"phonetic":"/nund/","extraExplanation":["“nooned/ nooning”多见于较旧的旅行记录、拓荒/远行语境，意思类似“停下来吃午饭、午间休息”。现代英语里更常说：stop for lunch / take a lunch break / take a midday rest。","如果你本来想写的是“no one’d”（= no one would / no one had 的口语省略，较少见），或是“nooned”出现在特定游戏/网络语境中，可以给我完整句子，我可以按语境解释。"]}
{"word":"noonflower","summary":{"en":"A common name for plants that open their flowers mainly around midday.","zh":"指花多在中午前后开放的一类植物的俗名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant whose flowers typically open or look their best around midday, closing later in the day (a common name used for several different species).","zh":"午花；（统称）花朵常在中午前后开放、下午或傍晚合拢的植物（可指多种不同物种的俗名）。"},"examples":[{"en":"The noonflower opens in bright sunlight and closes as the afternoon cools.","zh":"午花在强烈阳光下开放，到了下午转凉时就会合拢。"},{"en":"She planted a noonflower by the window to enjoy its midday bloom.","zh":"她在窗边种了一株午花，好在中午欣赏它盛开。"}]}],"synonyms":["ice plant","midday-flowering plant"],"phonetic":"/ˈnunˌflaʊər/","extraExplanation":["“noonflower”是俗名（common name），并不一定指单一物种；在园艺语境中常用来指一些喜阳、在正午开放最明显的多肉或地被植物（例如某些“ice plant/冰花”类群）。","与“moonflower（夜来香/夜开花的牵牛类）”相对：moonflower多在傍晚或夜间开放，而noonflower强调正午日照充足时开得最盛。","在读文学或看园艺文章时，遇到noonflower最好结合图片、拉丁学名或产地描述来确认具体指哪一种植物。"]}
{"word":"nooning","summary":{"en":"Nooning usually means a short rest around noon; in nautical use, it means taking a noon sight to determine position.","zh":"Nooning 通常指中午左右的短暂休息；在航海语境中指正午用太阳观测来测位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a midday break or rest taken around noon (often informal)","zh":"（非正式）中午左右的休息；午间小憩"},"examples":[{"en":"After lunch, she took a short nooning in the shade.","zh":"午饭后，她在树荫下小憩了一会儿。"},{"en":"We planned a quick nooning before continuing the hike.","zh":"我们计划先午间休息一下再继续徒步。"}]},{"partOfSpeech":"n.","definition":{"en":"(nautical) determining a ship’s position at noon, traditionally using the sun (a “noon sight”)","zh":"（航海）正午测位；用太阳在正午进行定位（“正午观测”）"},"examples":[{"en":"The navigator recorded the nooning to confirm their latitude.","zh":"领航员记录了正午测位结果来确认纬度。"},{"en":"Before GPS, nooning was a routine part of navigation at sea.","zh":"在 GPS 之前，正午测位是海上导航的日常工作之一。"}]},{"partOfSpeech":"vi.","definition":{"en":"to take a midday rest; to pause around noon (rare)","zh":"（较少用）在中午休息；中午暂停一下"},"examples":[{"en":"They were nooning when the rain started.","zh":"下雨时他们正在午间休息。"}]}],"synonyms":["midday break","lunch break","siesta","noon sight"],"phonetic":"/ˈnuːnɪŋ/","extraExplanation":["“nooning”来自“noon（正午）+ -ing”，作为名词更常见，表示“午间休息”。在现代日常英语里，这个词不算常用，更常见的说法是“take a lunch break / take a nap”。","航海义与传统天文导航有关：船只在正午观测太阳高度（noon sight），用来估算纬度与位置。这个用法更常见于航海史、航海日志或文学描写中。"]}
{"word":"noonings","summary":{"en":"“Noonings” is the plural of “nooning,” meaning a midday rest or lunch stop; it can also mean to stop and rest at noon.","zh":"“Noonings”是“nooning”的复数，指中午的休息/午饭停歇；也可作动词表示在正午停下来休息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rest or break taken around noon; the act of stopping to eat lunch or rest at midday","zh":"（在中午左右的）休息；午间停下来吃午饭或歇息的行为"},"examples":[{"en":"We took a quick nooning under a tree before continuing the hike.","zh":"我们在树下简单午间休息了一会儿，然后继续徒步。"},{"en":"In older travel writing, people often mention a “nooning” to escape the midday heat.","zh":"在较早的游记里，人们常提到“nooning”来躲避正午的炎热。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop and rest or eat around noon","zh":"（在中午）停下来休息或吃午饭"},"examples":[{"en":"Let’s noon here by the river and then head back.","zh":"我们就在河边午休吃点东西，然后再回去。"},{"en":"They nooned in the shade to avoid the strongest sun.","zh":"他们在阴凉处午间歇脚，避开最强的阳光。"}]}],"synonyms":["lunch break","midday break","rest stop","stop for lunch"],"phonetic":"/ˈnuːnɪŋ/","extraExplanation":["“noonings”通常是名词复数，对应单数“nooning”。这个词在现代日常英语里比较少见，更常见的说法是“lunch break / midday break / stop for lunch”。","在一些徒步、露营或较古典的旅行叙述中，“nooning”更自然，带有一种“旅途中正午歇脚”的画面感。"]}
{"word":"noonish","summary":{"en":"“Noonish” means “around noon / approximately midday” in an informal way.","zh":"“noonish”表示“中午左右/大约正午”，语气很口语、随意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Happening around noon; approximately at midday (not exactly 12:00).","zh":"（非正式）接近中午的；大约在正午时分（不一定正好12点）。"},"examples":[{"en":"Let’s meet at noonish—maybe around 12:15.","zh":"我们中午左右见吧——大概12:15。"},{"en":"I usually eat lunch at noonish when my meetings end.","zh":"我通常在中午左右、会议结束后吃午饭。"},{"en":"She’ll arrive noonish, depending on traffic.","zh":"她大概中午左右到，具体看路况。"}]}],"synonyms":["around noon","about noon","midday-ish","approximately noon"],"phonetic":"/ˈnuːnɪʃ/","extraExplanation":["“-ish”是英语里很常见的非正式后缀，表示“有点……、大约……、差不多……”。所以“noonish”就是“差不多中午”的意思，语气随意、口语化，常用于聊天、短信或非正式工作沟通。"]}
{"word":"noonlight","summary":{"en":"“Noonlight” means the bright sunlight at noon and is often used in poetic or descriptive writing.","zh":"“noonlight”指正午的明亮阳光，更常见于诗意或描写性的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Light (sunlight) at noon; the bright light of the middle of the day.","zh":"正午的光（阳光）；一天中最明亮的日光。"},"examples":[{"en":"The noonlight was so bright that the white walls looked almost silver.","zh":"正午的阳光太刺眼了，白墙看起来几乎像银色。"},{"en":"We rested under a tree to escape the harsh noonlight.","zh":"我们在树下休息，躲避正午刺眼的阳光。"}]}],"synonyms":["noonday light","midday light","sunlight","daylight"],"phonetic":"/ˈnuːnˌlaɪt/","extraExplanation":["“noonlight”并不是非常常见的日常用词，更常见的说法是分开写的“noon light”，或用“noonday light / midday light”。把它写成一个词（noonlight）时，常见于诗歌、文学或较有画面感的描写中，用来强调正午阳光的强烈与清晰。","文学表达中，正午的光常用来象征“最清楚、最暴露、最难隐藏的时刻”，与清晨或黄昏的柔和光线形成对比。"]}
{"word":"noonlit","summary":{"en":"Noonlit means brightly illuminated by the midday sun, often used in poetic or descriptive writing.","zh":"Noonlit 指“被正午阳光强烈照亮的”，多用于诗意或描写性的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lit by the bright light of midday; illuminated as if by the sun at noon (often poetic).","zh":"被正午强光照亮的；如同正午阳光般明亮的（常见于诗意表达）。"},"examples":[{"en":"The noonlit courtyard looked almost white in the heat.","zh":"炎热中，被正午阳光照亮的庭院看起来几乎发白。"},{"en":"She paused under the noonlit sky and shaded her eyes.","zh":"她在正午明亮的天空下停住脚步，抬手遮住眼睛。"}]}],"synonyms":["sunlit","bright","sun-drenched","illuminated"],"phonetic":"/ˈnuːnˌlɪt/","extraExplanation":["“noonlit”由“noon（正午）+ lit（被照亮的）”构成，常见于文学或描写性文字，用来营造强烈、直射、近乎刺眼的光感；日常口语里更常说“sunlit at noon / bright midday light”。"]}
{"word":"noonmeat","summary":{"en":"Noonmeat is a rare, old-fashioned word meaning a meal eaten at noon (lunch).","zh":"Noonmeat 是一个罕见的旧式词，意思是中午吃的一餐（午饭）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A meal eaten at noon; lunch.","zh":"（罕见/旧式用法）中午吃的一餐；午饭。"},"examples":[{"en":"We stopped our work for noonmeat and a short rest.","zh":"我们停下工作去吃午饭，顺便小歇一会儿。"},{"en":"In older writing, “noonmeat” simply means “lunch.”","zh":"在较老的文字里，noonmeat 就是指“午饭”。"}]}],"synonyms":["lunch","midday meal","noon meal"],"phonetic":"/ˈnuːnˌmiːt/","extraExplanation":["这个词在现代英语中非常少见，更多会写成带连字符的 noon-meat，常见于较早期或方言色彩较强的文本。","现代更自然的说法是 lunch（午饭）或 midday meal（午间餐）。如果你在阅读古文/文学作品看到 noonmeat，多半不用按字面“中午的肉”理解，而是直接当“午餐”。"]}
{"word":"noons","summary":{"en":"“Noons” means more than one noon: multiple midday times (around 12 p.m.).","zh":"“Noons”表示多个“中午/正午时段”（大约12点左右）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of noon; the middle part of the day (around 12:00 p.m.).","zh":"noon 的复数；中午（大约12点左右）这一段时间。"},"examples":[{"en":"The desert is hottest at the noons of summer.","zh":"夏天的正午时分，沙漠最热。"},{"en":"They took a short break around the noons to avoid the heat.","zh":"他们在中午前后短暂休息，躲避酷热。"}]}],"synonyms":["midday times","middays","noontimes"],"phonetic":"/nun/","extraExplanation":["“noons”在现代英语里不如“noon”常见，通常只在需要强调“多个日子的中午/正午时段”时使用，或见于较有文学感的表达（如描写季节、旅行、自然环境的文字）。","常见搭配更偏向单数：at noon（在中午）、around noon（中午前后）、noon hour（午间）。"]}
{"word":"noonstead","summary":{"en":"Noonstead is an old-fashioned word meaning “midday” or “around noon.”","zh":"Noonstead 是一个较古旧的词，意思是“正午/中午时分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"midday; the time around noon","zh":"正午；中午时分"},"examples":[{"en":"We rested at noonstead, when the sun was highest.","zh":"我们在正午休息，那时太阳升到最高。"},{"en":"By noonstead the heat became hard to bear.","zh":"到了中午，炎热变得难以忍受。"}]}],"synonyms":["noon","midday","noontide"],"phonetic":"/ˈnuːnˌstɛd/","extraExplanation":["“noonstead”属于较古老/文学性的英语用词，现代日常英语几乎不用；更常见的表达是“noon”“midday”或“around noon”。","词形上可理解为 noon（中午）+ stead（地方、位置、时段），带有“某个固定时点/时刻”的书面色彩，因此更常出现在诗歌、古风叙述或仿古写作中。"]}
{"word":"noontide","summary":{"en":"“Noontide” means midday, especially in a literary or old-fashioned style.","zh":"“noontide”指正午/中午时分，带有文学或较古风的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Midday; the time around noon, when the sun is highest.","zh":"正午；中午时分（太阳在天空最高的时候）。"},"examples":[{"en":"By noontide, the heat had become unbearable.","zh":"到了正午，热得让人受不了。"},{"en":"We reached the village at noontide and stopped for water.","zh":"我们在正午到达村子，停下来喝水。"}]}],"synonyms":["noon","midday","high noon"],"phonetic":"/ˈnuːn.taɪd/","extraExplanation":["“noontide”是较文学、较古风的说法，现代日常英语更常用“noon”或“midday”。常见于诗歌、宗教或描写自然景象的文字，用来营造庄重或画面感。","构词上由“noon（正午）+ tide（潮汐/时段）”组成，这里的“tide”是古义，表示“时间/时节”（类似于“eventide”=黄昏时分）。"]}
{"word":"noontides","summary":{"en":"“Noontides” is the plural of “noontide,” meaning midday/noon, often in a poetic or old-fashioned style.","zh":"“noontides”是“noontide”的复数，意思是正午/中午时分，常用于诗意或较古雅的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Midday; the time around noon when the sun is highest (often used in a poetic or old-fashioned style).","zh":"正午；中午时分（常见于诗歌或较古雅的用法）。"},"examples":[{"en":"In the noontide heat, we rested under a tree.","zh":"在正午的热浪里，我们在树下休息。"},{"en":"The desert was silent at noontide.","zh":"沙漠在正午时分一片寂静。"},{"en":"They worked from dawn to noontide and then stopped for lunch.","zh":"他们从黎明干到正午，然后停下来吃午饭。"}]}],"synonyms":["noon","midday","noonhour","midday heat"],"phonetic":"/ˈnuːn.taɪd/","extraExplanation":["“noontide”由“noon（正午）+ tide（潮汐/时节/时刻）”组成，这里的 tide 是“时间的阶段、时刻”的意思，不是字面上的海潮。","“noontide(s)”多见于文学、宗教或抒情语境，用来营造更庄重、画面感更强的“正午”氛围；日常英语更常说“noon”或“midday”。"]}
{"word":"noontime","summary":{"en":"Noontime means the middle of the day, around noon, and can also describe something that happens at that time.","zh":"Noontime 指中午、正午时分，也可作形容词表示“正午发生的/正午的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The middle part of the day; around noon (about 12:00 p.m.).","zh":"正午时分；中午（大约12点左右）。"},"examples":[{"en":"We usually have lunch at noontime.","zh":"我们通常在中午吃午饭。"},{"en":"The streets are busiest at noontime.","zh":"中午时分街上最热闹。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening at or near noon.","zh":"发生在正午或接近正午的。"},"examples":[{"en":"The noontime sun can be very strong in summer.","zh":"夏天正午的太阳可能很强烈。"},{"en":"They took a noontime break to eat and rest.","zh":"他们在中午休息一下，吃点东西并放松。"}]}],"synonyms":["noon","midday","noon hour"],"phonetic":"/ˈnuːnˌtaɪm/","extraExplanation":["“noontime”在美式英语里比较常见，但语气略偏书面或叙述性（例如故事、新闻写作）。日常口语更常说“noon”或“around noon”。","在文学或描写性语境中，“noontime”常用来营造画面感，比如强调正午的强光、炎热或一天的转折点。"]}
{"word":"noontimes","summary":{"en":"“Noontimes” means the midday periods around noon, usually referring to multiple days’ noontime.","zh":"“Noontimes”指正午前后的中午时段，通常用于表示多个日子的中午时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the times around noon; midday periods (plural of “noontime”).","zh":"正午前后的一段时间；中午时分（“noontime”的复数）。"},"examples":[{"en":"In summer, the streets are quiet at noontimes.","zh":"夏天的正午时分，街道很安静。"},{"en":"Farmers often take a short rest during noontimes.","zh":"农民常常在中午时分小憩一下。"}]}],"synonyms":["midday","noon","lunchtime","midday hours"],"phonetic":"/ˈnuːnˌtaɪm/","extraExplanation":["“Noontimes”是比较少见的复数写法，通常人们更常用“at noon / around noon / at midday”。用复数时，多表示“在不同日子的多个中午时段”。","在较文学的表达中，你也可能看到“noontide”（更诗意，意为正午/全盛期），例如“the noontide heat”（正午的炎热）。"]}
{"word":"noonwards","summary":{"en":"“Noonwards” means “from noon onward.”","zh":"“noonwards”意思是“从中午起（一直到之后）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"from noon onward; starting at 12:00 p.m. and continuing after that time","zh":"从中午起；从正午开始并持续到之后"},"examples":[{"en":"The restaurant is open from 11 a.m. to 10 p.m., but it gets busiest noonwards.","zh":"这家餐厅从上午11点营业到晚上10点，但从中午起最忙。"},{"en":"Noonwards, the temperature rose quickly.","zh":"从中午起，气温迅速上升。"},{"en":"We’ll be on the road from noonwards if the meeting ends on time.","zh":"如果会议按时结束，我们从中午起就会上路。"}]}],"synonyms":["from noon onward","from noon on","starting at noon","after noon"],"phonetic":"/ˈnuːnwərdz/","extraExplanation":["“noonwards”由“noon（中午）+ -wards（朝……方向/从……起）”构成，语感上偏英式、较少见；日常更常说“from noon onward / from noon on / starting at noon”。"]}
{"word":"noop","summary":{"en":"A “noop” is something that does nothing, especially a command or function in computing; it can also mean to do nothing.","zh":"“noop”指（尤指在计算机中）不会产生任何效果的操作/指令；也可作动词表示“什么也不做”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an action or command that does nothing (especially in computing)","zh":"（尤指计算机中）什么也不做的操作/指令；空操作"},"examples":[{"en":"This button is a noop right now—it doesn’t do anything yet.","zh":"这个按钮现在是个 noop——它暂时还什么也做不了。"},{"en":"The function returns immediately; it’s basically a noop.","zh":"这个函数立刻返回；基本上就是个空操作（noop）。"}]},{"partOfSpeech":"v.","definition":{"en":"to do nothing; to leave something unchanged (often used in programming talk)","zh":"（常用于编程语境）不做任何操作；保持不变"},"examples":[{"en":"If the user cancels, just noop and go back to the previous screen.","zh":"如果用户取消，就什么也不做（noop），回到上一页。"}]}],"synonyms":["no-op","do nothing","no effect","null operation"],"phonetic":"/nup/","extraExplanation":["“noop”来自“no-op”，是“no operation”的缩写，常见于编程、命令行和软件工程讨论中，用来指“执行了但没有效果”的指令或函数。","在一些场景里，noop 也可作为占位实现：先写一个“空函数”，等以后再补上真正逻辑。"]}
{"word":"nooscopic","summary":{"en":"Nooscopic means “about observing the mind,” often through introspection; it can also refer (rarely) to observing intelligence or collective thought.","zh":"nooscopic 指“与观察心智有关”，常通过内省；也可（少见）指观察智能或集体思维。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the observation or examination of the mind (especially through introspection or mental “self-checking”).","zh":"与“心灵/意识的观察或检查”有关的（尤指通过内省、反思来“自我检视”）。"},"examples":[{"en":"Meditation can be used as a nooscopic practice to notice thoughts without judging them.","zh":"冥想可以作为一种 nooscopic 的练习，用来觉察念头而不评判它们。"},{"en":"Her journal is nooscopic: it records how her feelings change day by day.","zh":"她的日记很 nooscopic：记录了她的情绪如何一天天变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Relating to studying or “viewing” intelligence, knowledge, or collective thinking (sometimes used in philosophy or science-fiction contexts).","zh":"（较少见）与研究或“观看”智能、知识或集体思维有关的（有时见于哲学或科幻语境）。"},"examples":[{"en":"The novel imagines nooscopic tools that map how ideas spread across society.","zh":"这部小说想象了 nooscopic 工具，用来描绘观念如何在社会中传播。"}]}],"synonyms":["introspective","reflective","self-examining","self-observing","contemplative"],"phonetic":"/noʊˈɑːskəpɪk/","extraExplanation":["“nooscopic”来自希腊语词根：nous（心智、理性、心灵）+ -scopic（观看、观察，如 telescope 望远镜、microscope 显微镜）。因此它字面意思接近“用来观察心智的”。","该词在日常英语中非常罕见，更常见的相关词是 introspective（内省的）、reflective（反思的）、self-examining（自我审视的）。在科幻或哲学写作中，它有时会被用来指对“知识/意识/集体心智”的观察。"]}
{"word":"noose","summary":{"en":"A noose is a tightening loop of rope, often used as a snare; historically it is also associated with hanging.","zh":"noose 指可收紧的绳圈/活结套索，常用于捕捉；历史上也常与绞刑相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A looped rope or cord with a tightening knot, used to catch, restrain, or hang someone or something.","zh":"（可收紧的）绳圈；活结套索，用于捕捉、束缚，或（历史上）用于绞刑。"},"examples":[{"en":"The police found a noose hanging from a tree branch.","zh":"警方在树枝上发现了一个吊着的绳套。"},{"en":"In the story, the hunter set a noose to catch a rabbit.","zh":"在故事里，猎人设了一个套索来抓兔子。"},{"en":"The novel mentions a noose as a symbol of fear and control.","zh":"小说中把绳套写作恐惧与控制的象征。"}]},{"partOfSpeech":"vt.","definition":{"en":"To form or fasten something into a noose; to catch or secure with a noose.","zh":"把……系成活结套索；用套索套住/捉住。"},"examples":[{"en":"He noosed the rope around the post to secure the load.","zh":"他把绳子系成活结套在柱子上固定货物。"},{"en":"The rancher noosed the calf gently and led it back.","zh":"牧场主轻轻用套索套住小牛，把它牵回去。"}]}],"synonyms":["snare","loop","lasso (similar, not identical)","slipknot (related)"],"phonetic":"/nus/","extraExplanation":["“noose”常与“绞刑（hanging）/私刑（lynching）”的历史语境相关，尤其在美国历史中与种族暴力的创伤记忆有关。因此在现实场合使用这个词或相关意象（例如挂在树上）可能非常敏感、令人不安，写作或交流时要注意语境与受众。","固定搭配：tighten the noose（让压力/控制越来越强，常作比喻）；put a noose around someone’s neck（比喻让某人陷入更危险或更受控的处境）。"]}
{"word":"noosed","summary":{"en":"“Noosed” means caught or restrained with a noose, or having a noose put around the neck (literally or figuratively).","zh":"“noosed”表示“被套索套住/控制住”，或“被套上绳套（脖子上）”，也可作比喻表达“被压力或错误困住”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “noose”: to catch, restrain, or trap someone/something with a looped rope (a noose), or to put a noose around a neck.","zh":"“noose”的过去式/过去分词：用套索（绳圈）套住、捉住或限制（人/动物），或把绳圈套在脖子上。"},"examples":[{"en":"The rancher noosed the calf and pulled it closer.","zh":"牧场主用套索套住小牛，把它拉近。"},{"en":"In the story, the villain was noosed and dragged away.","zh":"在故事里，反派被套索套住并被拖走。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a noose around the neck; caught or held by a noose (often used in dramatic or historical contexts).","zh":"（常用于戏剧或历史语境）脖子上被套上绳圈的；被套索套住/控制住的。"},"examples":[{"en":"He stood frozen, feeling as if he were noosed by his own mistake.","zh":"他僵在原地，感觉自己仿佛被自己的错误“套住了”。"},{"en":"The film shows a noosed prisoner in a tense scene.","zh":"电影里有一幕紧张的场景：一名囚犯被套上绳圈。"}]}],"synonyms":["lassoed","snared","trapped","strangled"],"phonetic":"/nuzd/","extraExplanation":["“noose（绳套）”在英语文化中不仅指套马等工具，也常与绞刑、私刑（如美国历史上的私刑 lynching）联系在一起，因此在描述人物时可能带有强烈的暴力或历史创伤意味。日常表达更常用比喻：feel noosed / be noosed by pressure（感觉被压力“勒住/套住”）。"]}
{"word":"nooser","summary":{"en":"Nooser means a person who uses a noose (usually to catch animals); it’s rare and can also carry a darker meaning related to hanging.","zh":"Nooser 指使用套索的人（多指套动物）；较少见，也可能带有与绞刑相关的阴暗含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who uses a noose (a looped rope), especially to catch or restrain an animal; sometimes used in a joking or informal way.","zh":"使用套索（打结成圈的绳子）的人，尤指用来套住或控制动物；有时为玩笑式或非正式用法。"},"examples":[{"en":"The ranch hired an experienced nooser to catch the calf safely.","zh":"牧场雇了一位经验丰富的套索手来安全地套住小牛。"},{"en":"He joked that he was the team’s “nooser” because he always brought the rope.","zh":"他开玩笑说自己是队里的“套索手”，因为他总是带着绳子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; often negative) A person associated with hanging someone using a noose.","zh":"（罕见；常带贬义）与用绞索吊死他人有关的人。"},"examples":[{"en":"The word can sound harsh because it may suggest violence.","zh":"这个词听起来可能很刺耳，因为它可能让人联想到暴力。"}]}],"synonyms":["lassoer","roper"],"phonetic":"/ˈnuːzər/","extraExplanation":["“nooser”并不是非常常见的英语单词，更常见的是“noose”（绞索/套索）和“lasso”（套索，尤其指牛仔用的）。如果你想表达“打套索的人”，也可以说“someone who uses a noose/lasso”或在西部语境里用“roping hand”。","注意文化语境：noose 在美国历史中可能与“私刑/种族暴力（lynching）”的意象相关，因此在讨论人或社会话题时要谨慎使用，避免造成冒犯。"]}
{"word":"noosers","summary":{"en":"“Noosers” is an uncommon spelling most often used to mean “noozers” (sleepers), and it can also teasingly mean slow or inattentive people; rarely it relates to using a “noose.”","zh":"“noosers”这个拼写不常见，通常被当作“noozers（睡觉的人/睡虫）”；也可调侃指反应慢或不专心的人；极少数情况下与“noose（绞索/套索）”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) People who are sleeping; sleepers.","zh":"（非正式）正在睡觉的人；睡觉的人。"},"examples":[{"en":"Wake up, you noosers—we’re going to miss the bus!","zh":"醒醒啊，你们这些睡虫——我们要赶不上公交了！"},{"en":"The kids were all noosers by nine o’clock.","zh":"孩子们九点就都睡着了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, teasing) People who seem slow, boring, or not paying attention.","zh":"（非正式、带调侃）反应慢、无聊或不专心的人。"},"examples":[{"en":"Come on, noosers, let’s get moving.","zh":"拜托，各位慢吞吞的，快点动起来。"},{"en":"He joked that his teammates were a bunch of noosers during practice.","zh":"他开玩笑说队友训练时都像一群“慢半拍的人”。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) People who use a noose, or who capture/kill with a noose.","zh":"（罕见）使用套索（绞索）的人；用套索捕捉或处死的人。"},"examples":[{"en":"In old Western stories, noosers sometimes caught animals with a rope.","zh":"在一些老西部故事里，有人会用绳套（套索）抓动物。"}]}],"synonyms":["noozers","sleepers","snoozers"],"phonetic":"/ˈnuːzərz/","extraExplanation":["“noosers”这个拼写在英语里不常见；更常见的是 **noozers**（来自动词 *snooze* “打盹/小睡”），意思是“睡觉的人/睡虫”。如果你想表达“睡觉的人”，通常写 **noozers**。","如果你是想写 **losers**（失败者）或其他词，也可能是拼写输入造成的。你可以告诉我你看到它的上下文句子，我可以帮你确认最准确的词和意思。"]}
{"word":"nooses","summary":{"en":"Nooses are looped ropes with a sliding knot, used to trap or (historically) hang; “to noose” means to catch or secure with such a loop.","zh":"nooses 指可收紧的活结绳圈（用于捕捉或历史上的绞刑）；动词 to noose 表示用这种绳圈套住、捕捉或固定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loop of rope with a sliding knot, tightened to trap, catch, or sometimes hang someone; plural of “noose”","zh":"套索；活结绳圈（可收紧的绳圈，用于捕捉动物，或历史上也用于绞刑）；“noose”的复数"},"examples":[{"en":"The ranger removed the illegal nooses from the forest.","zh":"护林员把森林里的非法套索移除了。"},{"en":"In history books, nooses are often mentioned when discussing public executions.","zh":"在历史书里，谈到公开处决时常会提到绞索。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put a noose around someone or something; to catch or trap with a noose","zh":"给……套上套索；用套索捕捉、设圈套"},"examples":[{"en":"The poachers tried to noose the deer, but they were stopped.","zh":"偷猎者试图用套索套住鹿，但被制止了。"},{"en":"The horse was noosed and pulled free from the mud.","zh":"马被套上绳圈后从泥里拉了出来。"}]}],"synonyms":["snares","slipknots","loops","hangman’s noose"],"phonetic":"/nus/","extraExplanation":["“noose”常与“绞刑/处决”联系在一起，也可能让人联想到暴力与历史创伤（在美国语境中还可能涉及私刑等沉重话题）。在日常表达中，如果只是指“套索/活结”，可以用更中性的说法如“looped rope”“slipknot”“snare”（陷阱套索）来避免不必要的冲击。","词源上与“knot（结）”有关：noose 指“可收紧的圈”，强调它会越拉越紧。与之相近但更偏“捕捉”的词是 snare（套索陷阱）。"]}
{"word":"noosing","summary":{"en":"“Noosing” means putting a noose (a looped rope) around someone or something, or the act of doing so; it often has a violent historical association with hanging.","zh":"“noosing”指用绳套（绞索）套住某人或某物，或这种行为；因与绞刑等历史暴力事件相关，语境常较敏感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of putting a looped rope (a noose) around someone or something, often to catch, restrain, or (historically) execute","zh":"用套索（绞索）套住人或动物的行为，常用于捕捉、控制；（历史上）也可指用于处决"},"examples":[{"en":"Police investigated the noosing of the dog as an act of animal cruelty.","zh":"警方将给那只狗套索的行为作为虐待动物案件进行调查。"},{"en":"The novel mentions the noosing of cattle by ranch hands.","zh":"小说提到牧场工人用套索套住牛。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “noose”: putting a noose around someone or something; tightening a noose","zh":"“noose”的现在分词：用套索套住；（把绳套）勒紧"},"examples":[{"en":"They were noosing the calf carefully so it wouldn’t panic.","zh":"他们小心地给小牛套索，免得它受惊。"},{"en":"Someone was caught on camera noosing a bird trap.","zh":"监控拍到有人在布置用绳套的捕鸟陷阱。"}]}],"synonyms":["lassoing","looping","snaring","roping"],"phonetic":"/ˈnuːsɪŋ/","extraExplanation":["“noosing”常带有强烈的暴力联想，因为“noose”最典型的用途是绞刑的绞索；在美国语境里还可能让人想到私刑（lynching）的历史，因此在新闻、校园或职场中出现这个词往往很敏感。","日常更中性、更常见的表达通常是用于动物或绳结场景，例如“lassoing”（用套索套住）或“looping a rope”（把绳子打成圈/套）——具体用哪个取决于是否强调“绞索/勒紧”的意味。"]}
{"word":"noosphere","summary":{"en":"Noosphere means the sphere of human thought and collective ideas influencing the world.","zh":"Noosphere 指人类思想与集体观念构成并影响世界的“思想圈/精神圈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in philosophy and cultural theory) the “sphere” of human thought, ideas, and collective consciousness, often seen as the part of Earth shaped by the mind and culture.","zh":"（哲学与文化理论中）“思想圈/精神圈”：指人类的思想、观念与集体意识所构成的领域，常被视为由人类心智与文化塑造的地球层面。"},"examples":[{"en":"Some writers describe the internet as a tool that expands the noosphere.","zh":"一些作者把互联网描述为扩展“思想圈/精神圈”的工具。"},{"en":"The idea of a noosphere suggests that human knowledge can change the planet, just as life changes the biosphere.","zh":"“思想圈”的概念暗示：人类知识能像生命改变生物圈那样改变地球。"}]}],"synonyms":["sphere of thought","collective consciousness","mindscape"],"phonetic":"/ˈnoʊ.əˌsfɪr/","extraExplanation":["词源：来自希腊语 noos（“心智、理性”）+ sphere（“球体、领域”），字面意思是“心智之球/思想之域”。","常见背景：该术语常与俄国科学家弗拉基米尔·维尔纳德斯基（Vernadsky）以及法国思想家泰雅尔·德·夏尔丹（Teilhard de Chardin）的思想相关，用来讨论人类意识、知识与技术如何成为影响地球的新力量（与 biosphere 生物圈相对）。","使用语域：多见于哲学、生态思想、系统论、未来学与人文社科写作中；日常英语里不常用。"]}
{"word":"nootka","summary":{"en":"Nootka refers to the Nuu-chah-nulth people, their language, or things related to them (often around Nootka Sound on Vancouver Island).","zh":"Nootka 指努查努尔斯（Nuu-chah-nulth）民族、其语言，或与之相关的事物（常与温哥华岛的努特卡湾相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a First Nations people of the west coast of Vancouver Island, Canada; today more often called the Nuu-chah-nulth.","zh":"加拿大温哥华岛西海岸的原住民族；如今更常称为“努查努尔斯人（Nuu-chah-nulth）”。"},"examples":[{"en":"The Nootka (Nuu-chah-nulth) have lived on the Pacific coast for thousands of years.","zh":"努特卡人（努查努尔斯人）在太平洋沿岸生活了数千年。"},{"en":"Museums often label carvings from this region as Nootka art.","zh":"博物馆常把这一地区的雕刻标注为“努特卡艺术”。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language(s) spoken by the Nuu-chah-nulth people, traditionally called Nootka.","zh":"努查努尔斯人使用的原住民语言（群），传统上称为“努特卡语”。"},"examples":[{"en":"She is taking a class in Nootka (Nuu-chah-nulth) to learn greetings and place names.","zh":"她在上努特卡语（努查努尔斯语）的课，学习问候语和地名。"},{"en":"Some local place names come from Nootka words.","zh":"一些当地地名源自努特卡语词汇。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Nootka/Nuu-chah-nulth people, their language, or their region (especially around Nootka Sound).","zh":"与努特卡/努查努尔斯人、其语言或其地区（尤指努特卡湾一带）有关的。"},"examples":[{"en":"They visited a Nootka community on Vancouver Island.","zh":"他们参观了温哥华岛上的一个努特卡社区。"},{"en":"The book describes Nootka history during early contact with Europeans.","zh":"这本书描述了早期与欧洲人接触时期的努特卡历史。"}]}],"synonyms":["Nuu-chah-nulth","Nootka Sound"],"phonetic":"/ˈnuːtkə/","extraExplanation":["“Nootka”是欧洲探险者在18世纪记录下来的旧称，常与“Nootka Sound（努特卡湾）”一起出现。如今在加拿大语境中，更尊重且更常用的自称是“Nuu-chah-nulth（努查努尔斯）”，指由多个相关社群组成的民族与文化群体。"]}

