{"word":"nopal","summary":{"en":"Nopal is a prickly pear cactus or its edible pads, often eaten in Mexican dishes.","zh":"Nopal指胭脂仙人掌或其可食用的仙人掌片，常用于墨西哥料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prickly pear cactus (or its edible pads), commonly used as a vegetable in Mexican cooking","zh":"仙人掌（胭脂仙人掌/掌状仙人掌的一种）或其可食用的仙人掌叶片（仙人掌片），常见于墨西哥料理中作蔬菜"},"examples":[{"en":"I ordered tacos with nopal and cheese.","zh":"我点了仙人掌片和奶酪的墨西哥卷饼。"},{"en":"Nopal is often grilled or cooked with eggs in Mexican cuisine.","zh":"在墨西哥料理里，仙人掌片常被烤着吃，或和鸡蛋一起炒。"},{"en":"You can buy fresh nopal pads at some Latin American markets.","zh":"在一些拉丁美洲市场可以买到新鲜的仙人掌片。"}]}],"synonyms":["prickly pear cactus","cactus pad","nopales"],"phonetic":"/noʊˈpɑl/","extraExplanation":["“Nopal”是西班牙语借词，在英语里多用于饮食语境，特别是墨西哥/墨西哥裔美国人的料理中。它通常指可食用的仙人掌叶片（仙人掌“掌片”），也可能泛指这种仙人掌本身。","处理nopal时常需要去刺；烹饪后口感清脆，带一点酸味/青味，有时会出现黏滑感（类似秋葵）。","文化小知识：仙人掌（nopal）在墨西哥文化中很重要，甚至出现在墨西哥国旗的图案里（鹰站在仙人掌上）。"]}
{"word":"nopalea","summary":{"en":"Nopalea is a botanical name for a group of prickly-pear–type cacti, sometimes treated as its own genus and sometimes included in Opuntia.","zh":"Nopalea 是植物学名称，指一类类似仙人掌果的仙人掌类群，分类上有时独立成属，有时并入 Opuntia。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (genus) of prickly-pear–type cacti, native mainly to Mexico and Central America; sometimes treated as a genus, sometimes as part of the genus Opuntia.","zh":"一种仙人掌类群（属），外形类似仙人掌“仙人掌果/仙人掌掌片”（prickly pear），主要原产于墨西哥和中美洲；在分类上有时独立成属，有时被视为仙人掌属（Opuntia）的一部分。"},"examples":[{"en":"Nopalea is often discussed together with Opuntia because their pads and flowers are similar.","zh":"Nopalea 常与 Opuntia 一起被讨论，因为它们的掌片和花很相似。"},{"en":"Some sources list certain species as Nopalea, while others classify them under Opuntia.","zh":"有些资料把某些物种列为 Nopalea，而另一些则把它们归入 Opuntia。"}]}],"synonyms":["prickly pear (type) cactus","Opuntia (in broader classification)"],"phonetic":"/noʊˈpeɪliə/","extraExplanation":["“Nopalea”这个词多见于植物学/园艺学语境，日常英语里比较少用；更常见的说法是“prickly pear cactus（仙人掌果类仙人掌）”或直接用“Opuntia”。","不要把 Nopalea 和西语/英语里常见的“nopal（仙人掌掌片）”“nopalito/nopales（可食用掌片）”混为一谈：后者通常指食材或掌片本身，不是这个植物分类名称。"]}
{"word":"nopalry","summary":{"en":"A nopalry is a place where nopal (prickly pear cactus) is grown.","zh":"nopalry 指种植 nopal（仙人掌/食用仙人掌）的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plantation or place where nopal (prickly pear cactus) is grown; a cactus garden or field.","zh":"种植仙人掌（尤其是胭脂虫仙人掌/食用仙人掌 nopal）的地方；仙人掌园或仙人掌田。"},"examples":[{"en":"The ranch kept a small nopalry to harvest nopales for cooking.","zh":"牧场有一小片仙人掌田，用来采收食用仙人掌叶（nopales）做菜。"},{"en":"Researchers visited a nopalry to study insects that live on prickly pear cactus.","zh":"研究人员参观仙人掌种植地，研究栖息在仙人掌上的昆虫。"}]}],"synonyms":["cactus plantation","cactus field","cactus garden"],"phonetic":"/noʊˈpælri/","extraExplanation":["“nopalry”是较少见的英语词，来自西班牙语 nopal（食用仙人掌/胭脂虫仙人掌，常见于墨西哥）加上表示“种植园/栽培地”的后缀 -ry。","在墨西哥文化与饮食中，nopal（仙人掌叶片）常被做成沙拉、炒菜或夹饼；而某些仙人掌种植也与胭脂虫（cochineal）养殖有关，用来生产天然红色染料。"]}
{"word":"nopals","summary":{"en":"“nopals” is usually a nonstandard written form of “no pals,” meaning “no friends/companions.”","zh":"“nopals”通常是“no pals”的非标准连写，意思是“没有朋友/没有伙伴”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(informal) Having no friends or companions; “no pals.”","zh":"（非正式）没有朋友或同伴；“没有伙伴/没人做朋友”。"},"examples":[{"en":"After moving to a new school, he felt like he had no pals.","zh":"搬到新学校后，他觉得自己没有朋友。"},{"en":"I’m not trying to be “nopals”—I just need some time alone.","zh":"我不是故意要“没朋友”，我只是想一个人待会儿。"}]},{"partOfSpeech":"other","definition":{"en":"(Internet/typo) Often seen as a misspelling or stylized form of “no pals.” Not a standard dictionary word.","zh":"（网络/拼写）常见为“no pals”的连写或风格化写法，并非标准词典词。"},"examples":[{"en":"The username ‘nopals’ is probably meant to read as ‘no pals.’","zh":"用户名“nopals”大概率是想表达“no pals（没有朋友）”。"}]}],"synonyms":["no friends","friendless","on your own"],"phonetic":"/noʊ pælz/","extraExplanation":["“pal”在美式英语里很常用，语气比“friend”更口语、更随意，带一点“哥们/伙伴”的感觉；所以“no pals”听起来也更口语化。","如果你是在某个游戏、社交平台或用户名里看到“nopals”，它也可能只是一个ID，并不一定在表达真实状态。"]}
{"word":"nope","summary":{"en":"“Nope” is an informal, casual way to say “no” or to deny something.","zh":"“nope”是“no”的非正式口语说法，用于拒绝或否认。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Informal way to say “no,” meaning you do not agree or you refuse.","zh":"（非正式）“不；不是”，表示不同意或拒绝。"},"examples":[{"en":"Do you want to go out tonight? — Nope.","zh":"你今晚想出去吗？——不。"},{"en":"Nope, I don’t think that’s a good idea.","zh":"不，我觉得那不是个好主意。"},{"en":"Are you the new teacher? — Nope, I’m just visiting.","zh":"你是新老师吗？——不是，我只是来参观的。"}]},{"partOfSpeech":"int.","definition":{"en":"Informal response meaning something is not correct or not true (like “not at all / not really”).","zh":"（非正式）表示“并非如此 / 不对 / 不太是”，用来否定某事的真实性或正确性。"},"examples":[{"en":"So you’re ready for the test? — Nope, not even close.","zh":"所以你准备好考试了吗？——没有，差得远呢。"},{"en":"Is it going to be easy? — Nope.","zh":"会很容易吗？——不会。"}]}],"synonyms":["no","nah","not really","no thanks"],"phonetic":"/noʊp/","extraExplanation":["“Nope”比“no”更口语、更随意，有时也会显得更干脆甚至有点生硬；如果想更礼貌，可以说“No, thank you.” 或 “I’m afraid not.”","在写作或正式场合通常不用“nope”；在聊天、短信、口语对话中很常见。"]}
{"word":"nopinene","summary":{"en":"Nopinene is a rare chemistry term for a terpene compound related to pinene.","zh":"Nopinene 是一个较少见的化学词，指一种与蒎烯相关的萜烯类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a type of terpene) related to pinene, found in some essential oils and studied in fragrance and organic chemistry contexts","zh":"一种与蒎烯（pinene）相关的萜烯类化合物，可存在于某些精油中，常见于香精香料与有机化学研究语境"},"examples":[{"en":"Researchers analyzed nopinene in the essential oil to understand its aroma profile.","zh":"研究人员分析了精油中的 nopinene，以了解其香气特征。"},{"en":"Nopinene is discussed in some chemistry texts alongside pinene and other monoterpenes.","zh":"一些化学教材会把 nopinene 与蒎烯及其他单萜一起讨论。"}]}],"synonyms":["terpene","monoterpene (category)","pinene (related compound)"],"phonetic":"/noʊˈpɪniːn/","extraExplanation":["“nopinene”在日常英语里非常少见，多出现在化学/香精香料的专业资料中；很多情况下也可能是拼写或转写差异（例如与“pinene / α-pinene / β-pinene”等更常见术语混用）。如果你是在论文、成分表或实验记录里看到它，建议提供上下文（句子或图片），以便确认是否指同一种化合物或是否应为其他名称。"]}
