{"word":"nor","summary":{"en":"“Nor” links a second negative idea, meaning “and not / also not,” often after a negative statement or after “neither.”","zh":"“nor”用来连接第二个否定信息，表示“也不/并不”，常用于否定句之后或与“neither…nor…”搭配。"},"definitions":[{"partOfSpeech":"conj.","definition":{"en":"Used to introduce the second part of a negative statement; it means “and not” or “also not.”","zh":"用于引出否定陈述的第二部分，表示“也不 / 并不”。"},"examples":[{"en":"He doesn’t eat meat, nor does he drink alcohol.","zh":"他不吃肉，也不喝酒。"},{"en":"She can’t sing, nor can she dance very well.","zh":"她不会唱歌，跳舞也不太行。"}]},{"partOfSpeech":"conj.","definition":{"en":"Used after “neither” to add another negative choice or person/thing.","zh":"用于“neither”之后，添加另一个否定的选择或对象。"},"examples":[{"en":"Neither the manager nor the staff knew what happened.","zh":"经理和员工都不知道发生了什么。"},{"en":"It is neither funny nor helpful.","zh":"这既不好笑也没帮助。"}]},{"partOfSpeech":"conj.","definition":{"en":"Used in formal or literary style to mean “and not,” often after a negative word like “not,” “never,” or “no one.”","zh":"较正式/文学用法，表示“并且不 / 也不”，常跟在 not、never、no one 等否定词之后。"},"examples":[{"en":"No one spoke, nor did they move.","zh":"没人说话，他们也一动不动。"}]}],"synonyms":["and not","also not"],"phonetic":"nɔr","extraExplanation":["语法提示：当 nor 连接两个分句时，第二个分句常用“倒装”结构（助动词/情态动词提前），如：He didn’t call, nor did he text.（他没打电话，也没发短信。）","易混点：口语里常用“either”表达“也不”（I don’t like it either. 我也不喜欢），但“nor”更正式，更常用于书面或较正式的表达。"]}
{"word":"nora","summary":{"en":"Nora is a common female first name, and it’s also famous as a character name in A Doll’s House.","zh":"Nora 是常见的女性名字，也因《玩偶之家》中的角色而广为人知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), used in many English-speaking countries","zh":"女性名字（名），在许多英语国家常见"},"examples":[{"en":"Nora is starting a new job on Monday.","zh":"Nora 周一要开始一份新工作。"},{"en":"I met Nora at a language exchange event.","zh":"我在一次语言交换活动上认识了 Nora。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known character name in literature, especially Nora Helmer in Henrik Ibsen’s play A Doll’s House","zh":"文学中著名的角色名，尤其指易卜生戏剧《玩偶之家》里的 Nora Helmer（娜拉·赫尔默）"},"examples":[{"en":"In A Doll’s House, Nora struggles with expectations in her marriage.","zh":"在《玩偶之家》中，Nora 在婚姻的期待与束缚中挣扎。"},{"en":"The teacher asked the class why Nora chooses to leave at the end of the play.","zh":"老师问全班：为什么 Nora 在剧末选择离开？"}]}],"synonyms":["Norah"],"phonetic":"/ˈnɔrə/","extraExplanation":["“Nora”常被认为是“Eleanor / Honora”等名字的昵称或变体；在爱尔兰语传统中也与“荣誉、名誉（honor）”相关的名字来源有关。","拼写上常见变体有“Norah”。在中文语境里，文学作品中常译作“娜拉”。"]}
{"word":"noradrenalin","summary":{"en":"Noradrenalin is a stress-related hormone/neurotransmitter (also a drug) that helps increase alertness, heart rate, and blood pressure.","zh":"noradrenalin（去甲肾上腺素）是一种与压力反应相关的激素/神经递质（也可作为药物），能提高警觉性并帮助升高心率与血压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hormone and neurotransmitter released by the body (especially during stress) that increases alertness and helps raise heart rate and blood pressure; also used as a medicine.","zh":"去甲肾上腺素：人体在压力等情况下释放的一种激素和神经递质，会提高警觉性，并帮助升高心率与血压；也可作为药物使用。"},"examples":[{"en":"In a stressful situation, the body releases adrenaline and noradrenalin to help you react quickly.","zh":"在紧张的情况下，身体会释放肾上腺素和去甲肾上腺素，帮助你快速反应。"},{"en":"Doctors may give noradrenalin to raise a patient’s blood pressure in an emergency.","zh":"在紧急情况下，医生可能会使用去甲肾上腺素来升高病人的血压。"}]}],"synonyms":["norepinephrine"],"phonetic":"/ˌnɔrˈædrənəlɪn/","extraExplanation":["“noradrenalin”更常见于英式拼写；美式医学与日常用法里更常写作“norepinephrine”（同一种物质）。在临床语境中，它常被称为“血管加压药”，用于低血压或休克等情况，但属于专业用药，应由医护人员操作。"]}
{"word":"noradrenaline","summary":{"en":"Noradrenaline (norepinephrine) is a stress-related hormone/neurotransmitter that increases alertness and can raise heart rate and blood pressure.","zh":"去甲肾上腺素（norepinephrine）是一种与压力反应有关的激素/神经递质，可提高警觉性并可能升高心率与血压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical (also called norepinephrine) that works as both a hormone and a neurotransmitter, helping the body respond to stress by increasing alertness, heart rate, and blood pressure","zh":"去甲肾上腺素（亦称 norepinephrine）：一种同时作为激素与神经递质的化学物质，帮助身体应对压力，提升警觉性、心率与血压"},"examples":[{"en":"During a stressful moment, the body releases noradrenaline to increase alertness.","zh":"在压力时刻，身体会释放去甲肾上腺素来提高警觉性。"},{"en":"Noradrenaline can raise blood pressure, so doctors monitor patients closely when it is used as a medication.","zh":"去甲肾上腺素可能升高血压，因此作为药物使用时医生会密切监测病人。"}]}],"synonyms":["norepinephrine","noradrenalin"],"phonetic":"/ˌnɔːr.əˈdrɛn.əl.ɪn/","extraExplanation":["英式拼写常见为 noradrenaline，美式医学语境更常用同义词 norepinephrine（去甲肾上腺素）。两者指同一种物质，只是命名体系不同。","在医学上，去甲肾上腺素可作为“升压药”用于某些危急情况（如严重低血压/休克）以帮助维持血压。此处属于专业医疗用法，需由医护人员使用与监测。"]}
{"word":"noradrenergic","summary":{"en":"Noradrenergic means “related to norepinephrine (noradrenaline),” especially in the nervous system.","zh":"Noradrenergic 指“与去甲肾上腺素有关的”，常用于描述神经系统中的神经元、受体或活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or using norepinephrine (noradrenaline), especially describing nerves, neurons, or receptors that release or respond to norepinephrine.","zh":"与去甲肾上腺素（noradrenaline / norepinephrine）有关的；尤指释放或响应去甲肾上腺素的神经、神经元或受体。"},"examples":[{"en":"Noradrenergic neurons help regulate attention and alertness.","zh":"去甲肾上腺素能（noradrenergic）神经元有助于调节注意力与警觉性。"},{"en":"The doctor explained that the drug affects the noradrenergic system in the brain.","zh":"医生解释说，这种药物会影响大脑中的去甲肾上腺素能系统。"},{"en":"Stress can increase noradrenergic activity.","zh":"压力可能会增强去甲肾上腺素能活动。"}]}],"synonyms":["norepinephrinergic","(more general) adrenergic"],"phonetic":"/ˌnɔrˌædrəˈnɝdʒɪk/","extraExplanation":["词形拆解：nora(d)renaline（去甲肾上腺素）+ -ergic（“起作用的/与……相关的”，常见于 cholinergic, dopaminergic 等）。因此 noradrenergic 常用于医学、生物学、心理学语境。","术语对比：adrenergic 往往泛指“肾上腺素/去甲肾上腺素相关”；noradrenergic 更具体指“去甲肾上腺素相关”。在美式学术写作中也常见同义词 norepinephrinergic。"]}
{"word":"norard","summary":{"en":"“norard” is not a standard English word; it is most likely a misspelling of “NORAD.”","zh":"“norard”不是标准英语单词；更可能是“NORAD”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Most likely a misspelling of “NORAD,” the North American Aerospace Defense Command (a U.S.–Canada military organization that monitors airspace and aerospace threats).","zh":"很可能是把“NORAD”拼错了：北美防空司令部（美国与加拿大共同的军事机构，负责监测北美空域与太空域的潜在威胁）。"},"examples":[{"en":"NORAD monitors North American airspace for potential threats.","zh":"NORAD 监测北美空域以防范潜在威胁。"},{"en":"In the news, officials said NORAD tracked the object.","zh":"在新闻中，官员表示 NORAD 追踪了该物体。"}]}],"synonyms":["North American Aerospace Defense Command"],"phonetic":"/ˈnɔːræd/","extraExplanation":["“NORAD”是缩写，全称是 North American Aerospace Defense Command。它在北美文化里也常出现在圣诞相关的流行文化中，比如“NORAD Tracks Santa（NORAD 追踪圣诞老人）”。","如果你原本想输入的是别的单词（例如 “narrator /ˈnær.eɪ.t̬ɚ/ 叙述者” 或 “forward /ˈfɔːr.wɚd/ 向前的”），可以告诉我你想表达的意思或给我一个句子，我可以帮你定位正确拼写。"]}
{"word":"norate","summary":{"en":"“No-rate” means very poor or worthless in quality.","zh":"“No-rate”表示“很差劲、没价值”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very poor in quality; not worth paying attention to (often written with a hyphen: “no-rate”).","zh":"质量很差的；不值得关注的（常写作带连字符的 no-rate）。"},"examples":[{"en":"The movie was no-rate—boring and badly acted.","zh":"这部电影很差劲——无聊又演得很烂。"},{"en":"Don’t waste time on no-rate gossip online.","zh":"别把时间浪费在网上那些没价值的八卦上。"}]}],"synonyms":["terrible","awful","worthless","lousy","inferior"],"phonetic":"/ˈnoʊ reɪt/","extraExplanation":["“norate”更常见的写法是“no-rate”。它带有比较强的主观评价，语气偏贬义，日常口语或评论里偶尔会用，但正式写作中不太常见。","如果你本来想查的是“nitrate（硝酸盐）”或“no rate（没有费率/不收费）”，告诉我具体语境（句子）我可以帮你确认。"]}
{"word":"noration","summary":{"en":"“Noration” is not standard; it’s usually a mistaken form of “narration” or “oration.”","zh":"“noration”不是规范用词，多半是把“narration”或“oration”写错/混用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) A misspelling or mistaken blend of “narration” (storytelling) and “oration” (a formal speech). It is not widely accepted as a standard English word.","zh":"（非标准/罕见）常见为拼写错误或把“narration（叙述/讲故事）”与“oration（正式演讲）”混合造成的词形；一般不被视为规范英语单词。"},"examples":[{"en":"I couldn’t find “noration” in most dictionaries—did you mean “narration” or “oration”?","zh":"大多数词典里找不到“noration”——你想写的是“narration”还是“oration”？"},{"en":"The film’s narration is calm and clear.","zh":"这部电影的旁白（narration）很平静、清晰。"},{"en":"He delivered an oration at the ceremony.","zh":"他在仪式上发表了一篇正式演讲（oration）。"}]}],"synonyms":["narration","oration","speech","storytelling"],"phonetic":"/nəˈreɪʃən/","extraExplanation":["“narration”更偏“讲故事/叙事/旁白”（常用于电影旁白、小说叙述方式）；“oration”更偏“正式演讲/雄辩的讲话”（更书面、更正式，常见于典礼、政治或纪念场合）。","如果你是在写作或考试中使用，建议避免用“noration”，改用你真正想表达的词：讲述故事用“narration”，正式演讲用“oration”，一般讲话也可用“speech”。"]}
{"word":"norbergite","summary":{"en":"Norbergite is a yellow-to-brown magnesium silicate mineral containing fluorine.","zh":"norbergite 是一种含氟的镁硅酸盐矿物，常呈黄色至褐色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (a fluorine-bearing magnesium silicate) that is usually yellow to orange-brown and is related to the olivine group.","zh":"一种矿物（含氟的镁硅酸盐），通常呈黄色到橙褐色，与橄榄石族相关。"},"examples":[{"en":"Norbergite is often studied in mineralogy classes because it helps explain silicate structures.","zh":"在矿物学课程中，人们常研究白挪威石，因为它有助于理解硅酸盐结构。"},{"en":"The geologist identified small grains of norbergite in the rock sample.","zh":"地质学家在岩石样品中鉴定出少量白挪威石颗粒。"}]}],"synonyms":["mineral (technical term; no common everyday synonym)"],"phonetic":"/ˈnɔr.bɚˌɡaɪt/","extraExplanation":["词源与背景：norbergite 来自瑞典地名 Norberg（诺尔贝里），后缀 -ite 常用于矿物名称（表示“某某矿物/矿石”）。","使用场景：这个词主要出现在地质学、矿物学、宝石学等专业语境中，日常英语中很少使用。"]}
{"word":"norbert","summary":{"en":"Norbert is a male first name, and it can also be a surname.","zh":"Norbert 常作男性名字，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Norbert is a quiet student who loves science.","zh":"诺伯特是个安静的学生，喜欢科学。"},{"en":"I met Norbert at a conference in Chicago.","zh":"我在芝加哥的一场会议上认识了诺伯特。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common than the first name.","zh":"姓氏（不如作名常见）。"},"examples":[{"en":"Dr. Norbert will speak at tonight’s event.","zh":"诺伯特博士将出席今晚的活动并发言。"}]}],"synonyms":["Albert","Robert","Gilbert"],"phonetic":"/ˈnɔr.bɚt/","extraExplanation":["“Norbert”源自日耳曼语系名字，常被解释为由表示“北方/北部”的词根（类似 north）和表示“光明、辉煌”的词根（-bert，如 Albert、Robert）组合而来，因此可理解为“北方的光辉/光明之人”。","历史与文化上较有名的相关人物包括圣诺伯特（St. Norbert of Xanten，中世纪宗教人物），因此在一些欧洲文化背景中也带有传统、宗教或古典气息。"]}
{"word":"norbertine","summary":{"en":"Norbertine means “related to” or “a member of” the Norbertines (Premonstratensians), a Catholic order founded by St. Norbert.","zh":"Norbertine 指“与诺贝尔会（普雷蒙特雷会）有关的”或“诺贝尔会士”，该修会由圣诺贝尔在12世纪创立。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Norbertines (the Premonstratensian Order), a Catholic religious order founded by St. Norbert in the 12th century.","zh":"与诺贝尔会士（普雷蒙特雷会／普雷蒙斯特拉顿会）有关的；指由圣诺贝尔在12世纪创立的天主教修会。"},"examples":[{"en":"A Norbertine abbey still serves the local community today.","zh":"一座诺贝尔会修道院至今仍在服务当地社区。"},{"en":"She wrote a paper on Norbertine history and medieval monasteries.","zh":"她写了一篇关于诺贝尔会历史与中世纪修道院的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Norbertines (Premonstratensians).","zh":"诺贝尔会士；普雷蒙特雷会会士（该修会的成员）。"},"examples":[{"en":"He met a Norbertine who worked as a parish priest.","zh":"他遇到一位在堂区担任神父的诺贝尔会会士。"},{"en":"Norbertines often combine community life with pastoral work.","zh":"诺贝尔会会士常把团体生活与牧灵工作结合在一起。"}]}],"synonyms":["Premonstratensian"],"phonetic":"/nɔrˈbɝːtin/","extraExplanation":["“Norbertine”来自圣诺贝尔（St. Norbert of Xanten）。该修会更常见的名称是“Premonstratensian”（源自法国的普雷蒙特雷（Prémontré），是其创立地点之一）。","在英语语境里，“Norbertine”既可作形容词（修会的、相关的），也可作名词（修会成员）。有时会在历史、艺术史或宗教研究中出现，例如谈到修道院、教堂、抄本与中世纪教会制度。"]}
{"word":"norcamphane","summary":{"en":"Norcamphane is a technical chemistry word for a camphane-related bicyclic hydrocarbon with one fewer carbon.","zh":"Norcamphane 是化学术语，指与樟烷/冰片烷相关但少一个碳原子的双环饱和烃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bicyclic saturated hydrocarbon related to camphane (bornane), with one fewer carbon atom; used mainly as a technical term in organic chemistry","zh":"（有机化学）与樟烷/冰片烷（camphane/bornane）骨架相关、少一个碳原子的双环饱和烃；主要用于专业语境"},"examples":[{"en":"Norcamphane is sometimes used as a simplified model for studying camphor-like ring strain.","zh":"Norcamphane 有时被用作简化模型，用来研究类似樟脑骨架的环张力。"},{"en":"The paper compares the reactivity of camphane and norcamphane under the same conditions.","zh":"这篇论文比较了 camphane 和 norcamphane 在相同条件下的反应性。"}]}],"synonyms":["nor‑bornane (related term)","norcamphane derivative (general label)"],"phonetic":"/nɔrˈkæm.feɪn/","extraExplanation":["“nor-”是有机化学命名中的常见前缀，通常表示“比母体化合物少一个碳原子”（可理解为从原骨架中去掉一个 –CH2– 单元或等效的一个碳）。因此 norcamphane 的含义重点在“从 camphane/bornane 骨架减去一个碳”这一结构关系上。","该词多见于科研论文、专利或高级教材中，日常英语里几乎不会用到；阅读时可把它当作“某类樟脑/冰片烷相关的去碳衍生物”的结构名。"]}
{"word":"Nord","summary":{"en":"Nord can mean a person from the north (often Northern Europe), a fantasy ethnic group in *The Elder Scrolls*, or the French word for “north.”","zh":"Nord 可指北方人（常指北欧人）、《上古卷轴》中的诺德族群，也可指法语里的“北/北方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the north; often used to mean someone from Northern Europe (especially Scandinavia) in literary or historical contexts","zh":"北方人；在文学或历史语境中常指北欧人（尤指斯堪的纳维亚人）"},"examples":[{"en":"In old travel writing, the Nords were described as tough sailors from the cold seas.","zh":"在旧时游记里，Nord 常被描写成来自寒冷海域的坚韧水手。"},{"en":"He called himself a Nord, proud of his northern heritage.","zh":"他自称是 Nord，为自己的北方血统感到自豪。"}]},{"partOfSpeech":"n.","definition":{"en":"a human ethnic group in the fantasy game series *The Elder Scrolls* (e.g., *Skyrim*), known for a warrior culture and a northern homeland","zh":"（奇幻游戏《上古卷轴》系列，如《天际》中的）诺德人：以战士文化和北方家园著称的人类族群"},"examples":[{"en":"In *Skyrim*, many Nords live in Windhelm and follow Nordic traditions.","zh":"在《天际》中，许多诺德人住在风盔城，并遵循北地传统。"},{"en":"She chose a Nord character for the bonus to combat skills.","zh":"她选择了诺德人角色，因为战斗技能有加成。"}]},{"partOfSpeech":"n.","definition":{"en":"the French word for “north,” sometimes seen on maps or in place names","zh":"法语中“北方/北”的意思；有时出现在地图或地名中"},"examples":[{"en":"The sign said “Nord,” meaning the direction north in French.","zh":"牌子上写着“Nord”，在法语里表示“北方”的方向。"},{"en":"The French region is simply called Nord.","zh":"法国有一个大区（省级单位）就叫 Nord（北部省）。"}]}],"synonyms":["northerner","Scandinavian","Northman"],"phonetic":"/nɔrd/","extraExplanation":["“Nord”源自法语“nord”（北方），而法语又借自日耳曼语系相关词形（可与英语的 north、德语的 Nord 对照）。因此你会在地图标注、地名（如法国的 Nord 省）或文学作品里看到它。","在英语里，“Nord”有时带一点“北方民族/北欧人”的文学色彩；日常英语更常用“northerner”“Scandinavian”等表达。","作为游戏用语时，“Nord”通常是专有名词，常首字母大写，指《上古卷轴》设定中的族群。"]}
{"word":"nordcaper","summary":{"en":"Nordcaper usually means a person connected to Norway’s Nordkapp (North Cape), and is sometimes used informally for a North Cape visitor.","zh":"Nordcaper 通常指与挪威诺德卡普（北角）有关的人，也可非正式指去过北角的游客。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from (or associated with) the Nordkapp / North Cape area in northern Norway; sometimes used informally for someone who has visited North Cape.","zh":"（来自或与挪威北部诺德卡普/北角有关的）人；也可非正式指去过北角旅行的人。"},"examples":[{"en":"Many Nordcapers work in tourism during the summer season.","zh":"许多“Nordcaper”在夏季旅游旺季从事旅游相关工作。"},{"en":"After reaching North Cape, she proudly called herself a Nordcaper.","zh":"到达北角后，她自豪地说自己算是个“Nordcaper”了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) relating to the Nordkapp / North Cape region.","zh":"（罕见）与诺德卡普/北角地区有关的。"},"examples":[{"en":"They planned a Nordcaper route along the Arctic coast.","zh":"他们计划了一条沿北极海岸的“北角风格”路线。"}]}],"synonyms":["North Cape visitor","person from Nordkapp (informal)"],"phonetic":"/ˈnɔrdˌkeɪpər/","extraExplanation":["“Nordcaper”并不是非常常见或固定的标准词，更常见的地名拼写是挪威语“Nordkapp”（英文常说 North Cape）。如果你是在文章、地图或商品名里看到“Nordcaper”，它多半是作者/品牌为了表达“北角的人/北角之旅”而造的用法。","Nordkapp（北角）是挪威著名景点之一，靠近北极圈，常与“午夜太阳（midnight sun）”“极光（Northern Lights）”等旅行主题一起出现。"]}
{"word":"nordenfelt","summary":{"en":"Nordenfelt is usually a proper name referring to the Swedish inventor Thorsten Nordenfelt, or to weapons/early submarines associated with him (e.g., the Nordenfelt gun).","zh":"Nordenfelt 通常是专名，指瑞典发明家托斯滕·诺登费尔特，或指与他相关的武器/早期潜艇（如 Nordenfelt 机枪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) Thorsten Nordenfelt (1842–1920), a Swedish inventor and arms manufacturer known for developing rapid‑fire weapons and early submarines.","zh":"（专有名词）托斯滕·诺登费尔特（1842–1920），瑞典发明家与军工企业家，以研制速射武器和早期潜艇而知名。"},"examples":[{"en":"Nordenfelt became famous in the late 19th century for his weapons designs.","zh":"诺登费尔特因其19世纪后期的武器设计而闻名。"},{"en":"Some histories of early submarines mention Nordenfelt alongside other pioneers.","zh":"一些早期潜艇史会把诺登费尔特与其他先驱并列提及。"}]},{"partOfSpeech":"n.","definition":{"en":"Nordenfelt gun: a late‑19th‑century multi‑barrel rapid‑fire gun (an early type of machine gun), often mounted on ships.","zh":"诺登费尔特机枪（Nordenfelt gun）：19世纪后期的一种多管速射炮（早期机枪类型），常用于舰船。"},"examples":[{"en":"The ship was armed with a Nordenfelt gun for close‑range defense.","zh":"这艘船配备了诺登费尔特机枪，用于近距离防御。"},{"en":"Museum labels sometimes compare the Nordenfelt gun with the Maxim gun.","zh":"博物馆说明牌有时会把诺登费尔特机枪与马克沁机枪作比较。"}]},{"partOfSpeech":"n.","definition":{"en":"Nordenfelt submarine: an early submarine design associated with Nordenfelt in the 1880s.","zh":"诺登费尔特潜艇（Nordenfelt submarine）：19世纪80年代与诺登费尔特相关的一类早期潜艇设计。"},"examples":[{"en":"The Nordenfelt submarine was part of the experiment-and-prototype era of underwater navigation.","zh":"诺登费尔特潜艇属于早期水下航行“实验与原型”时期的产物。"},{"en":"In a lecture on naval history, the speaker briefly mentioned Nordenfelt submarines.","zh":"在一次海军史讲座中，讲者简要提到了诺登费尔特潜艇。"}]}],"synonyms":["Nordenfelt gun","Nordenfelt submarine"],"phonetic":"/ˈnɔrdənˌfɛlt/","extraExplanation":["“Nordenfelt”通常出现在历史、军事史或博物馆语境中，多作为人名或武器/装备名称的一部分（如 Nordenfelt gun）。如果在文章里单独出现，常需要结合上下文判断是指“这个人”还是“以他命名的武器/潜艇”。","拼写以 -felt 结尾，但读音不按英语常见的 felt（毛毡）来理解，它是瑞典姓氏，被英语化后沿用固定读法。"]}
{"word":"nordenskioldine","summary":{"en":"Nordenskioldine is a rare phosphate mineral name used mainly in geology/mineralogy.","zh":"Nordenskioldine 指一种罕见的磷酸盐类矿物名，主要用于地质/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare mineral (a phosphate) named after the Finnish-Swedish explorer Adolf Erik Nordenskiöld.","zh":"一种罕见的矿物（磷酸盐类），以芬兰-瑞典探险家阿道夫·埃里克·诺登舍尔德（Adolf Erik Nordenskiöld）命名。"},"examples":[{"en":"Nordenskioldine is mainly discussed in mineralogy references rather than everyday English.","zh":"“Nordenskioldine”主要出现在矿物学资料中，而不是日常英语里。"},{"en":"The museum label identified the specimen as nordenskioldine.","zh":"博物馆的标签把这块标本标注为 nordenskioldine（诺登舍尔德石）。"}]}],"phonetic":"/ˌnɔrˌdɛnʃiˈoʊlˌdin/","extraExplanation":["这是一个专门术语（矿物名），属于“以人名命名的科学词汇”（eponym）。在普通英语写作中很少见，更多用于地质学、矿物学论文、标本目录或博物馆说明牌。","词尾 -ine 常见于矿物或化学相关名称（例如某些矿物、碱类化合物等的命名传统），看到这种词尾时通常可以猜到它可能是“物质/矿物名”。"]}
{"word":"nordhausen","summary":{"en":"Nordhausen is a town in Thuringia, central Germany; it can also refer to WWII-related historical sites in that area.","zh":"Nordhausen（诺德豪森）是德国中部图林根州的一座城市；在历史语境中也可能指该地区与二战相关的遗址/设施。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in the state of Thuringia (Thüringen), central Germany, known as a regional center near the Harz Mountains.","zh":"诺德豪森：德国中部图林根州的一座城市（靠近哈茨山脉），是当地的重要城镇。"},"examples":[{"en":"Nordhausen is in central Germany, in the state of Thuringia.","zh":"诺德豪森位于德国中部的图林根州。"},{"en":"We stayed in Nordhausen before hiking in the Harz Mountains.","zh":"我们在去哈茨山徒步前先住在诺德豪森。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a former Nazi concentration-camp complex and related WWII sites in the Nordhausen area (often mentioned in historical contexts).","zh":"诺德豪森：也可指二战时期该地区的纳粹集中营相关设施（多见于历史语境）。"},"examples":[{"en":"The documentary mentioned Nordhausen in the context of late WWII history.","zh":"这部纪录片在二战末期历史的语境中提到了诺德豪森。"},{"en":"Some museums in the region discuss Nordhausen and the war-time underground factories.","zh":"该地区的一些博物馆会介绍诺德豪森以及战时的地下工厂。"}]}],"synonyms":["(place name) Nordhausen, Thuringia"],"phonetic":"/ˈnɔrdˌhaʊzən/","extraExplanation":["“Nordhausen”是专有名词，英语里通常按德语地名使用，首字母大写；读音在英语中可能因口音略有差异。","历史语境中提到“Nordhausen”时，常与二战末期的强迫劳动、地下工厂（如与V-2火箭生产相关的设施）及相关纪念地一起出现。谈论这一部分历史时，建议使用尊重、谨慎的表述。"]}
{"word":"nordic","summary":{"en":"“Nordic” most commonly means “related to Northern Europe (especially Denmark, Norway, Sweden, Finland, and Iceland).” It can also mean a person from those countries.","zh":"“Nordic”最常见意思是“北欧的（尤指丹麦、挪威、瑞典、芬兰、冰岛）”，也可指“北欧人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the countries and cultures of Northern Europe, especially Denmark, Norway, Sweden, Finland, and Iceland.","zh":"与北欧国家及其文化有关的，尤指丹麦、挪威、瑞典、芬兰和冰岛。"},"examples":[{"en":"Nordic countries often cooperate closely on social and environmental policies.","zh":"北欧国家常在社会与环境政策上密切合作。"},{"en":"She studies Nordic literature, including Swedish and Icelandic novels.","zh":"她研究北欧文学，包括瑞典和冰岛的小说。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from a Nordic country.","zh":"北欧人；来自北欧国家的人。"},"examples":[{"en":"As a Nordic, he grew up with long winters and short summer nights.","zh":"作为北欧人，他在漫长的冬季和夏季短夜中长大。"}]}],"synonyms":["Northern European","Scandinavian (often, but not exactly the same)"],"phonetic":"/ˈnɔr.dɪk/","extraExplanation":["“Nordic”常与“Scandinavian（斯堪的纳维亚的）”混用，但严格来说范围不同：Scandinavian通常主要指丹麦、挪威、瑞典；Nordic更广，还包括芬兰和冰岛（以及常被提及的法罗群岛、格陵兰、奥兰群岛等地区）。","在文化语境里，“Nordic design（北欧设计）”常指简洁、实用、自然材质与浅色调；“Nordic model（北欧模式）”常指高税收与高福利并存的社会制度讨论。"]}
{"word":"nordicism","summary":{"en":"Nordicism is an ideology emphasizing Nordic identity, most commonly a belief in Nordic superiority that is historically tied to racist theories.","zh":"“Nordicism（北欧主义）”指强调北欧身份的思想；更常见的用法是“北欧人优越论”，在历史上常与种族主义理论相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief or ideology that “Nordic” (Northern European, especially Scandinavian) people are superior to other groups; often linked to racist or white-supremacist thinking.","zh":"“北欧人（尤其指斯堪的纳维亚等北欧/北欧裔）优越”的观念或意识形态；常与种族主义、白人至上主义相关。"},"examples":[{"en":"The article explains how Nordicism influenced some early 20th-century racial theories.","zh":"这篇文章解释了“北欧主义”如何影响了20世纪早期的一些种族理论。"},{"en":"Many historians treat Nordicism as a form of pseudoscience used to justify discrimination.","zh":"许多历史学者把“北欧主义”视为一种被用来为歧视辩护的伪科学。"},{"en":"The museum exhibit discusses Nordicism within the broader history of eugenics and racism.","zh":"博物馆展览把“北欧主义”放在优生学与种族主义的更大历史背景中进行讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"A cultural or political emphasis on Nordic identity, traditions, or values (sometimes used more neutrally, depending on context).","zh":"对“北欧身份”、传统或价值的文化/政治强调（在某些语境中可能较为中性，但需看上下文）。"},"examples":[{"en":"In some writings, Nordicism refers to an idealized image of Nordic culture and society.","zh":"在一些著作中，“北欧主义”指对北欧文化与社会的理想化想象。"},{"en":"Be careful with the term, because it can carry racial connotations in historical texts.","zh":"使用这个词要谨慎，因为在历史文本中它可能带有种族含义。"}]}],"synonyms":["Nordic supremacy","racial superiority ideology","ethno-nationalism (in some contexts)"],"phonetic":"/ˈnɔr.dɪˌsɪz.əm/","extraExplanation":["“Nordicism”在英语里常出现在19世纪末到20世纪上半叶的“种族分类/优生学”讨论中，被一些作者用来宣称北欧人（常被等同于“雅利安人”或“日耳曼人”）更优越；因此在当代语境中通常被视为带有歧视性和历史负担的词。","词形来源：Nordic（北欧的）+ -ism（……主义/思想体系）。阅读历史材料时，常与“racial theory（种族理论）”“eugenics（优生学）”“white supremacy（白人至上主义）”等话题并列出现。"]}
{"word":"nordicist","summary":{"en":"A Nordicist is usually someone who promotes Nordicism (a racial-supremacist ideology); more rarely, it can mean a person interested in Nordic culture.","zh":"nordicist通常指宣扬“北欧主义”（带有种族优越论色彩的意识形态）的人；较少见时也可指热爱北欧文化的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or promotes Nordicism, an ideology that claims “Nordic” (Northern European) people are superior and should dominate culturally or politically.","zh":"北欧主义者；指支持或宣扬“北欧主义”（一种宣称“北欧/北方欧洲人”更优越、应在文化或政治上占主导地位的意识形态）的人。"},"examples":[{"en":"The article criticized Nordicists for using pseudoscience to justify racism.","zh":"这篇文章批评北欧主义者用伪科学为种族主义辩护。"},{"en":"In history class, we learned how Nordicist ideas influenced some extremist movements in the early 20th century.","zh":"在历史课上，我们学习了北欧主义思想如何影响20世纪早期的一些极端主义运动。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A person strongly interested in or supportive of Nordic culture, languages, or cooperation among Nordic countries.","zh":"（较少见）对北欧文化、语言，或北欧国家之间合作特别感兴趣或支持的人。"},"examples":[{"en":"As a Nordicist, she enjoys reading Icelandic sagas and learning Swedish.","zh":"作为一个热爱北欧文化的人，她喜欢读冰岛萨迦并学习瑞典语。"}]}],"synonyms":["supporter of Nordicism","racial supremacist (in this ideology context)","Nordic culture enthusiast (for the neutral sense)"],"phonetic":"/ˈnɔr.dɪ.sɪst/","extraExplanation":["“Nordicist”在英文里常带有历史与政治负面含义：它通常与种族等级观、优生学、以及20世纪早期某些极端民族主义/法西斯思潮有关。学术或新闻语境中使用时，多为批评或描述其意识形态。","如果你只是想表达“喜欢北欧文化的人”，更中性、常见的说法是“a fan of Nordic culture / a Nordic culture enthusiast”，以避免被误解为支持种族主义意识形态。"]}
{"word":"nordicity","summary":{"en":"Nordicity means the degree or qualities of “northernness” of a place—especially in geography and Canadian/Northern studies.","zh":"Nordicity 指某地的“北方性/北境性”的程度或特质，常用于地理与加拿大/北方研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The degree of “northernness” of a place (how strongly it is influenced by northern climate, latitude, remoteness, and related conditions).","zh":"（某地的）“北方性/北境性”，指一个地方在气候、纬度、偏远程度等方面受“北方”特征影响的程度。"},"examples":[{"en":"Researchers use nordicity to compare how different regions experience winter and isolation.","zh":"研究人员用 nordicity 来比较不同地区在冬季与隔绝感方面的体验差异。"},{"en":"Northern communities may have high nordicity even if they are not at the highest latitudes.","zh":"一些北方社区即使不在最高纬度，也可能具有很高的 nordicity（北方性）。"}]},{"partOfSpeech":"n.","definition":{"en":"The set of cultural and environmental qualities associated with the North (for example, cold, snow, long winters, sparse population, and northern identity).","zh":"与“北方/北境”相关的一整套文化与环境特质（如寒冷、积雪、漫长冬季、人口稀疏、北方身份认同等）。"},"examples":[{"en":"The novel captures the nordicity of life: short days, heavy snow, and a tight-knit community.","zh":"这部小说描绘了北境生活的 nordicity：白昼短、雪厚、人们关系紧密。"},{"en":"Artists sometimes celebrate nordicity through images of ice, auroras, and quiet landscapes.","zh":"艺术家有时会通过冰雪、极光与寂静的风景来赞美 nordicity（北方意象）。"}]}],"synonyms":["northernness","northern character","Arcticness"],"phonetic":"/nɔrˈdɪsəti/","extraExplanation":["“Nordicity”常见于加拿大地理与北方研究语境；它与加拿大地理学者 Louis-Edmond Hamelin 推广的“nordicité（法语）/nordicity（英语）”概念有关，用来更系统地讨论“北方”不仅是纬度，更包含气候、可达性（交通/距离）、经济与社会条件等综合因素。"]}
{"word":"nordicization","summary":{"en":"Nordicization means the process of becoming more Nordic in style, culture, or (sometimes) policy.","zh":"Nordicization 指“北欧化”：在风格、文化或（有时）政策制度上变得更北欧的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something more Nordic in style, culture, or characteristics (e.g., adopting Scandinavian/Nordic design, practices, or identity)","zh":"“北欧化”：使某事物在风格、文化或特征上更接近北欧（如采用北欧/斯堪的纳维亚的设计、做法或身份认同）的过程"},"examples":[{"en":"Some critics argue that the brand’s rebranding is a kind of Nordicization, using minimal design and cool colors to seem Scandinavian.","zh":"一些评论者认为该品牌的重新定位是一种“北欧化”，用极简设计和冷色调来营造北欧感。"},{"en":"The Nordicization of interior design can be seen in the popularity of light wood, clean lines, and simple layouts.","zh":"室内设计的“北欧化”可从浅色木材、利落线条与简洁布局的流行中看出。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes political or social) the adoption or promotion of Nordic-style policies or institutions, especially those associated with Nordic welfare states","zh":"（有时用于政治/社会语境）采用或推行“北欧模式”的政策或制度，尤指与北欧福利国家相关的做法"},"examples":[{"en":"The article debates whether Nordicization of social policy would work in a larger, more diverse country.","zh":"这篇文章讨论在一个更大、更多元的国家里，社会政策“北欧化”是否可行。"},{"en":"Opponents warned that Nordicization could mean higher taxes, while supporters focused on stronger public services.","zh":"反对者警告“北欧化”可能意味着更高税负，而支持者强调更强的公共服务。"}]}],"synonyms":["Nordification","Scandinavianization","Nordic influence","Scandinavian influence","adoption of Nordic-style policies"],"phonetic":"/ˌnɔrˌdɪsɪzaɪˈʃən/","extraExplanation":["这个词在英语中相对少见，更常见的表达是“Nordic influence”（北欧影响）、“Scandinavian-style”（斯堪的纳维亚风格）或“adopt Nordic policies”（采用北欧政策）。","词形上由 Nordic + -ization 构成，-ization 表示“……化/……的过程”。写作中可用来强调一种主动的“改造/趋向”，但在正式文本里最好先交代你所指的“北欧特征”（如设计审美、福利制度、工作文化等），避免过度笼统。"]}
{"word":"nordicize","summary":{"en":"Nordicize means to make something or someone more Nordic in style, culture, or characteristics.","zh":"Nordicize 指使某事物或某人更具北欧的风格、文化或特征。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something more Nordic in style, character, or culture; to give it features associated with the Nordic countries","zh":"使某事物更具北欧风格/特征/文化；将其“北欧化”"},"examples":[{"en":"The hotel tried to Nordicize its rooms with light wood, simple lines, and wool blankets.","zh":"这家酒店用浅色木材、简洁线条和羊毛毯来让房间更“北欧化”。"},{"en":"Some brands Nordicize their packaging to suggest cleanliness and minimalism.","zh":"有些品牌会把包装设计“北欧化”，以传达干净与极简的感觉。"}]},{"partOfSpeech":"vt.","definition":{"en":"to influence people or a society to adopt Nordic languages, customs, or institutions","zh":"使人群或社会采用北欧的语言、习俗或制度；使其趋向北欧模式"},"examples":[{"en":"Over time, the region became partly Nordicized through trade and migration.","zh":"随着时间推移，这个地区通过贸易与迁徙在一定程度上被北欧化。"},{"en":"The policy aimed to Nordicize public education by importing textbooks and teaching methods.","zh":"该政策试图通过引进教材与教学方法来让公共教育体系北欧化。"}]}],"synonyms":["Scandinavianize","make more Nordic","give a Nordic feel to","Nordify"],"phonetic":"/ˈnɔrdɪˌsaɪz/","extraExplanation":["“Nordicize”较少见，多用于描述设计风格、品牌形象或文化影响；更常见的替代表达有“give it a Nordic feel / make it more Scandinavian / Scandinavianize”。","历史上该词偶尔出现在带有种族主义/优生学色彩的语境（把人口“北欧化”）。这种用法在当代英语中非常敏感且不被认可；写作或讨论历史时应明确批判性立场并谨慎措辞。"]}
{"word":"nordmarkite","summary":{"en":"Nordmarkite is a light-colored intrusive igneous rock type, related to syenite, usually rich in alkali feldspar and often containing some quartz.","zh":"Nordmarkite（诺德马克岩）是一种浅色的侵入性火成岩类型，与正长岩（syenite）接近，通常富含碱性长石并常含一定量石英。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of light-colored intrusive igneous rock (a kind of syenite) rich in alkali feldspar, typically containing quartz and sodium‑rich amphibole or pyroxene.","zh":"一种浅色的侵入性火成岩（属于正长岩/霞石正长岩类的相关岩石），富含碱性长石，常含少量石英，并可含富钠的角闪石或辉石等矿物。"},"examples":[{"en":"Geologists identified the outcrop as nordmarkite based on its alkali feldspar and quartz content.","zh":"地质学家根据其中的碱性长石和石英含量，将这处露头鉴定为诺德马克岩（nordmarkite）。"},{"en":"Nordmarkite can be described as a quartz-bearing variety of syenitic rock in some classifications.","zh":"在某些分类中，诺德马克岩可被描述为“含石英的正长岩”变种。"}]}],"synonyms":["quartz syenite (in some classifications)","syenite (broader term)"],"phonetic":"/ˈnɔrdˌmɑrˌkaɪt/","extraExplanation":["“nordmarkite”一词来自挪威奥斯陆附近的 Nordmarka（诺德马克地区），最早用来指在该地区研究到的一类侵入岩。","不同教材/分类体系对它与“syenite（正长岩）”“quartz syenite（石英正长岩）”等名称的边界可能略有差异；阅读论文或报告时可留意作者采用的岩石分类标准（如 IUGS）。"]}
{"word":"nordr","summary":{"en":"“nordr” is a nonstandard spelling of Old Norse “norðr,” meaning “north / northward,” mainly used in historical or linguistic contexts.","zh":"“nordr”多为古诺尔斯语“norðr”的非标准拼写，意思是“北方/向北”，主要用于历史或语言学语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Old Norse; often written as “norðr”) north; to the north; northward.","zh":"（古诺尔斯语；常写作“norðr”）北方；在北边；向北。"},"examples":[{"en":"In some Old Norse texts, “norðr” means “to the north” or “northward.”","zh":"在一些古诺尔斯语文本中，“norðr”表示“向北”或“在北方”。"},{"en":"The saga describes a journey going norðr across the sea.","zh":"史诗描写了一段向北穿越海洋的旅程。"}]}],"synonyms":["north","northward","to the north"],"phonetic":"/nɔrðr/","extraExplanation":["“nordr”本身不是现代英语常用词，更常见于讨论维京时代语言、符文或古诺尔斯语的文章里。现代英语里表达“北/向北”通常用 north / northward。","拼写说明：古诺尔斯语标准拼写常用字母“ð”（类似英语 th 的浊音），所以你可能也会看到“norðr”。在不方便输入“ð”时，有人会写成“nordr”。"]}
{"word":"nore","summary":{"en":"“Nore” is most commonly a place name in England (the Nore sandbank/anchorage near the Thames estuary). It can also be an archaic word meaning “nostril.”","zh":"“nore”最常见是英国地名（泰晤士河口附近的诺尔沙洲/锚地）；也可作古义词，表示“鼻孔”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) The Nore: a sandbank/anchorage area at the mouth of the River Thames (near where the Thames meets the Medway) in southeast England; often used in place names and maritime context.","zh":"（专有名词）诺尔（The Nore）：英国英格兰东南部泰晤士河入海口附近的一处沙洲/锚地（靠近泰晤士河与梅德韦河交汇处）；常见于地名与航海语境。"},"examples":[{"en":"The ship waited at the Nore before sailing to London.","zh":"那艘船在诺尔锚地等待，随后驶往伦敦。"},{"en":"Old navigation guides mention the Nore as an important anchorage.","zh":"一些旧航海指南把诺尔记作重要的锚地。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) A nostril.","zh":"（古义）鼻孔。"},"examples":[{"en":"In older texts, “nore” may appear with the meaning “nostril.”","zh":"在较早的文本中，“nore”有时用来表示“鼻孔”。"}]}],"synonyms":["(place) The Nore (proper name)","(archaic) nostril","(anatomy-related) nares"],"phonetic":"/nɔr/","extraExplanation":["“The Nore”在英国历史与海军语境中较常见，例如18世纪末曾发生过著名的“Spithead and Nore mutinies（斯皮特黑德与诺尔兵变）”。如果你是在历史/地理文章里看到它，多半指这个地点。","现代英语里表示“鼻孔”更常用nostril；在解剖学/拉丁词根里常见nares（复数，“鼻孔”）。"]}
{"word":"noreast","summary":{"en":"“Noreast” is a nonstandard spelling of “nor’east/nor’easter,” meaning a northeast wind or a major coastal storm in the northeastern U.S.","zh":"“noreast”多为非标准拼写，通常指“nor’east/nor’easter”：东北风，或美国东北沿海常见的强风暴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialectal) “northeast”; a northeast wind or direction, especially used by sailors and in coastal New England speech (often written “nor’east”).","zh":"（方言）“东北”；指东北方向或东北风，常见于航海用语和美国新英格兰沿海口语（常写作“nor’east”）。"},"examples":[{"en":"A cold nor’east wind pushed fog in from the sea.","zh":"一阵寒冷的东北风把海上的雾推了过来。"},{"en":"The boat turned to the nor’east to catch the breeze.","zh":"船转向东北，去借那阵风。"}]},{"partOfSpeech":"n.","definition":{"en":"A powerful coastal storm in the northeastern U.S. driven by winds from the northeast (more commonly spelled “nor’easter”).","zh":"美国东北部沿海常见的一种强风暴，特点是风从东北方向吹来（更常写作“nor’easter”）。"},"examples":[{"en":"The nor’easter dumped heavy snow overnight.","zh":"那场东北风暴一夜之间下了大雪。"},{"en":"Flights were canceled because of the nor’easter.","zh":"因为那场东北风暴，航班被取消了。"}]}],"synonyms":["northeast","NE wind","nor'east","nor'easter"],"phonetic":"/ˌnɔrˈiːstər/","extraExplanation":["“noreast”通常被视为非标准拼写，更常见的写法是“nor’east”（口语缩写，来自“north east”）以及“nor’easter”（指东北风暴）。","在美国文化语境里，“nor’easter”常与新英格兰（如马萨诸塞、缅因等）冬季的暴风雪、海岸大风和停航停电联系在一起。"]}
{"word":"noreaster","summary":{"en":"A powerful East Coast storm with northeast winds, often bringing heavy rain or snow.","zh":"美国东海岸常见的强风暴，吹东北风，常带来大雨或大雪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong storm along the U.S. East Coast, especially in late fall or winter, with winds blowing from the northeast and often bringing heavy rain or snow.","zh":"（美国东海岸常见的）东北风暴，尤指深秋到冬季的一种强风暴；风从东北方向吹来，常带来大雨或暴雪。"},"examples":[{"en":"The forecast says a nor’easter could bring heavy snow to Boston tonight.","zh":"天气预报说，今晚一场东北风暴可能会给波士顿带来大雪。"},{"en":"Flights were canceled because of the nor’easter’s strong winds.","zh":"由于东北风暴的强风，航班被取消了。"},{"en":"Coastal towns prepared for flooding ahead of the nor’easter.","zh":"沿海城镇在东北风暴来临前为洪水做准备。"}]}],"synonyms":["northeaster","coastal storm","winter storm","blizzard (sometimes, if snow is severe)"],"phonetic":"/ˌnɔɹˈiːstɚ/","extraExplanation":["“nor’easter”是“northeaster”的口语/传统写法，常见于新闻与民间用语，带有地区色彩（美国东北部与中大西洋沿岸）。","这种风暴通常与沿海低气压（海岸气旋）有关，冷空气与海洋湿润空气相遇，容易造成湿雪、暴风雪、海岸侵蚀与风暴潮。","拼写里用撇号（nor’easter）是为了模拟口语发音；正式写作也可写作“northeaster”。"]}
{"word":"norelin","summary":{"en":"“Norelin” is not a common English vocabulary word; it is usually a proper name or a misspelling of a similar-looking term.","zh":"“Norelin”不是常见英语词汇；通常是专有名词，或是某个相近词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (used as a personal name or brand name). In general English, it is not a common dictionary word; people often mean a different word that looks similar.","zh":"一个较少见的专有名词（可能是人名或品牌名）。在一般英语中它不是常见词；很多时候人们其实想写的是外形相近的其他词。"},"examples":[{"en":"I couldn’t find “Norelin” in a standard English dictionary—what context did you see it in?","zh":"我在常见英语词典里找不到 “Norelin”，你是在哪种语境里看到的？"},{"en":"Norelin is sometimes used as a name on social media profiles.","zh":"Norelin 有时会被用作社交媒体上的名字。"}]}],"phonetic":"ˈnɔrəlɪn","extraExplanation":["“norelin”很可能是拼写或转写差异导致的形式。你能告诉我它出现的领域吗（例如：药品说明、医学文章、人名、游戏/小说角色、公司/产品名）？\n常见的相近词包括：\n- norepinephrine（去甲肾上腺素，医学/生理学术语）\n- Norlin（常见作姓氏，也可能是品牌/公司名）\n提供一句原文或截图，我可以更准确地解释与翻译。"]}
{"word":"norepinephrine","summary":{"en":"Norepinephrine is a body chemical (neurotransmitter/hormone) involved in alertness and the stress response; it’s also a medicine used to raise blood pressure in emergencies.","zh":"去甲肾上腺素是人体内参与清醒与应激反应的化学物质（神经递质/激素）；也可作为急救升压药物使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical messenger in the body that works as both a neurotransmitter (in the nervous system) and a hormone (in the blood), helping control alertness, attention, heart rate, blood pressure, and the “fight-or-flight” stress response","zh":"去甲肾上腺素：人体内的一种化学信使，既是神经递质（在神经系统中传递信号），也是激素（进入血液循环）；有助于调节清醒度、注意力、心率、血压以及“战或逃”的压力反应"},"examples":[{"en":"When you’re suddenly frightened, your body releases norepinephrine to help you react quickly.","zh":"当你突然受到惊吓时，身体会释放去甲肾上腺素，帮助你迅速反应。"},{"en":"Low norepinephrine activity is sometimes linked to problems with attention and mood.","zh":"去甲肾上腺素活动偏低有时与注意力和情绪问题有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) a drug form of this chemical, given to raise blood pressure in emergencies such as severe shock","zh":"（医学）去甲肾上腺素制剂：作为药物在紧急情况下使用，用于升高血压，例如严重休克时"},"examples":[{"en":"In the ICU, the doctor started norepinephrine to treat dangerously low blood pressure.","zh":"在重症监护室里，医生开始使用去甲肾上腺素来治疗危险的低血压。"},{"en":"Norepinephrine is usually given through an IV and carefully monitored.","zh":"去甲肾上腺素通常通过静脉输注，并需要严密监测。"}]}],"synonyms":["noradrenaline","NE"],"phonetic":"ˌnɔrˌɛpəˈnɛfrɪn","extraExplanation":["在英语里，norepinephrine 与 noradrenaline 是同一种物质的两种叫法：美国医学语境更常用 norepinephrine，英式/国际语境常见 noradrenaline。","不要把 norepinephrine（去甲肾上腺素）和 epinephrine（肾上腺素）混淆：两者都参与应激反应，但作用侧重不同；临床上用药场景也不同。"]}
{"word":"norf","summary":{"en":"“Norf” is an informal way of writing/saying “north,” used to show a particular accent (often in the UK).","zh":"“norf”是“north”的非正式写法/说法，用来表现特定口音（常见于英国）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, dialect spelling/pronunciation) “north”; used to represent the way some speakers say *north* (often dropping the “th” sound).","zh":"（非正式、方言拼写/发音）“north（北方）”；用来模仿某些口音里把 *north* 的“th”音省略后的说法。"},"examples":[{"en":"I’m from Norf London. (meaning: North London)","zh":"我来自“Norf London”（意思是：北伦敦）。"},{"en":"It’s colder up norf in the winter.","zh":"冬天北边（norf）更冷。"}]}],"synonyms":["north","northern (informal)"],"phonetic":"/nɔrf/","extraExplanation":["“norf”常见于网络文字、歌词、口音梗，用来表现某些英式口音（如伦敦/工人阶层口音等）把 /θ/（th）读成 /f/ 或直接弱化的效果；因此它更多是“写出来的口音”，不是标准拼写。","在正式写作或考试中一般不用“norf”，应写作 *north*。在对话、社媒或引用原话时可以用来增加真实感或幽默感。"]}
{"word":"norfolk","summary":{"en":"Norfolk is most commonly a place name: a county in England or a city in Virginia, USA; it can also mean “related to Norfolk.”","zh":"Norfolk最常见是地名：英国英格兰东部的诺福克郡或美国弗吉尼亚州的诺福克市；也可作形容词表示“诺福克的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a county in eastern England, known for its rural landscapes and coastline.","zh":"英国英格兰东部的一个郡，以乡村风景和海岸线闻名。"},"examples":[{"en":"She spent a quiet weekend in Norfolk, walking along the coast.","zh":"她在诺福克度过了一个安静的周末，沿着海岸散步。"},{"en":"Norfolk has many small villages and historic churches.","zh":"诺福克有许多小村庄和历史悠久的教堂。"}]},{"partOfSpeech":"n.","definition":{"en":"a city in southeastern Virginia, U.S., with a major naval base and port.","zh":"美国弗吉尼亚州东南部的一座城市，拥有重要的海军基地和港口。"},"examples":[{"en":"He was stationed in Norfolk for two years.","zh":"他在诺福克驻扎了两年。"},{"en":"The ship docked at the port of Norfolk.","zh":"那艘船停靠在诺福克港。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Norfolk (the county in England or the city in Virginia).","zh":"与诺福克（英国的郡或美国弗吉尼亚州的城市）有关的；诺福克的。"},"examples":[{"en":"They tried a few Norfolk seafood dishes.","zh":"他们尝了几道诺福克的海鲜菜。"},{"en":"Norfolk roads can be busy during tourist season.","zh":"旅游旺季时诺福克的道路可能很拥堵。"}]}],"synonyms":["Norfolk County (UK)","Norfolk, Virginia (US)"],"phonetic":"/ˈnɔr.fək/","extraExplanation":["“Norfolk”是地名，属于专有名词；写作时通常需要大写。","读音里第二个音节常弱读为 /fək/，说起来像“NOR-fək”。","在不同语境中，“Norfolk”也可能指相关事物（如 Norfolk terrier 一种犬种、Norfolk jacket 一种夹克款式），但最常见还是指地名。"]}
{"word":"norfolkian","summary":{"en":"Norfolkian means “from Norfolk” or “related to Norfolk,” and it can also mean a person from Norfolk.","zh":"Norfolkian表示“来自诺福克/与诺福克有关”，也可指“诺福克人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Norfolk (a county in eastern England) or to its people, culture, or dialect.","zh":"（形容词）与英国英格兰东部的诺福克郡（Norfolk）有关的；诺福克的；诺福克人（文化/方言）的。"},"examples":[{"en":"She grew up in a Norfolkian village near the coast.","zh":"她在靠近海岸的一个诺福克乡村长大。"},{"en":"The museum highlights Norfolkian history and local traditions.","zh":"这座博物馆重点展示诺福克的历史和本地传统。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Norfolk (especially Norfolk, England).","zh":"（名词）诺福克人（通常指英国诺福克郡的人）。"},"examples":[{"en":"As a Norfolkian, he’s proud of the county’s farming heritage.","zh":"作为一个诺福克人，他为这个郡的农业传统感到自豪。"},{"en":"Many Norfolkians travel to Norwich for work or shopping.","zh":"许多诺福克人会去诺里奇工作或购物。"}]}],"synonyms":["Norfolk (adj.)","from Norfolk","Norfolk resident","local (context-dependent)"],"phonetic":"/nɔrˈfoʊlkiən/","extraExplanation":["“Norfolkian”常见于较正式或书面语（如历史、地理、文化研究）。日常口语里，人们更常说“someone from Norfolk”或“Norfolk resident”。","注意大小写：指地名/族群的形容词和名词通常首字母大写（Norfolkian）。","“Norfolk”也可能指美国的Norfolk（如弗吉尼亚州诺福克市）；在这种语境下“Norfolkian”也可用来表示“诺福克（美国某地）的人/相关的”，但需靠上下文判断。"]}
{"word":"norgine","summary":{"en":"Norgine is a pharmaceutical company name used as a proper noun.","zh":"Norgine 是一家制药公司的名称，属于专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a European pharmaceutical company name (a proper noun), best known for making and marketing medicines and medical products, especially in areas like gastroenterology","zh":"一家欧洲制药公司的名称（专有名词），以研发、生产并销售药品与医疗产品而闻名，尤其在消化系统等领域较常见"},"examples":[{"en":"Norgine makes several prescription medicines used in hospitals and clinics.","zh":"Norgine 生产多种在医院和诊所使用的处方药。"},{"en":"Please check whether this product is distributed by Norgine in your country.","zh":"请确认该产品在你所在国家是否由 Norgine 经销。"},{"en":"The leaflet says the medicine is manufactured by Norgine.","zh":"说明书上写着该药由 Norgine 生产。"}]}],"phonetic":"/nɔrˈdʒiːn/","extraExplanation":["“Norgine”通常出现在药品包装、说明书（leaflet / package insert）或新闻稿中，作为公司/品牌名称使用，而不是普通英语词汇。","作为专有名词，它一般不加冠词（不说 *a Norgine*），常见搭配是：manufactured by Norgine（由 Norgine 生产）、distributed by Norgine（由 Norgine 经销）、Norgine’s product/medicine（Norgine 的产品/药物）。"]}
{"word":"nori","summary":{"en":"Nori is dried edible seaweed, commonly used to wrap sushi.","zh":"nori 指海苔：可食用的干海藻薄片，常用来包寿司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin sheet of dried edible seaweed, used especially in Japanese cooking (for example, to wrap sushi).","zh":"（尤指日式料理中的）海苔；一种可食用的干海藻薄片，常用来包寿司。"},"examples":[{"en":"I ordered a salmon roll wrapped in nori.","zh":"我点了一份用海苔包着的三文鱼卷。"},{"en":"The onigiri was covered with a strip of nori.","zh":"这个饭团外面包了一条海苔。"}]}],"synonyms":["seaweed sheet","dried seaweed"],"phonetic":"/ˈnɔːri/","extraExplanation":["“nori”来自日语（のり）。在英语里通常指做寿司用的烤海苔片（常见为深绿色或近黑色的薄片）。在东亚饮食语境中也可能泛指可食用海藻制品，但在美式英语里最常见的用法就是“包寿司的海苔”。","相关词汇：sushi（寿司）, maki roll（卷寿司）, onigiri（饭团）, seaweed（海藻/海带类，范围更广）, kombu（昆布）, wakame（裙带菜）。"]}
{"word":"noria","summary":{"en":"A noria is a traditional bucket water wheel used to raise water for irrigation.","zh":"noria 指传统的桶式汲水水车，用来提水灌溉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large wheel with buckets or containers attached, used to lift water from a river or well for irrigation or water supply.","zh":"水车（诺里亚）：一种带桶或容器的大轮子，用来把河水或井水提升到高处，用于灌溉或供水。"},"examples":[{"en":"The old noria still turns slowly by the river, lifting water to the fields.","zh":"那座古老的水车仍在河边缓慢转动，把水提到田里。"},{"en":"In some historic towns, tourists come to see the noria and the irrigation canals it feeds.","zh":"在一些历史古镇，游客会来看水车，以及它供水的灌溉水渠。"}]}],"synonyms":["water wheel","bucket wheel"],"phonetic":"/ˈnɔːriə/","extraExplanation":["“noria”一词常见于介绍中东与地中海地区的传统灌溉技术（如叙利亚哈马 Hama 的著名水车）。它通常由水流推动转动，把水从低处连续舀起再倒入高处水槽，属于古老而高效的取水装置。","在英文里它是相对偏文化/历史的词汇：日常生活中更常用的近义表达会是“water wheel（汲水用水车）”或更具体的“bucket wheel”。"]}
{"word":"norias","summary":{"en":"Norias are large rotating wheels that lift water in containers for irrigation; less commonly, the word can also mean a Ferris wheel.","zh":"norias 指用于提水灌溉的带桶水车；较少情况下也可指摩天轮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large waterwheel with containers (buckets or jars) that lifts water from a river or well, especially for irrigation","zh":"（尤指灌溉用的）水车；带水桶（或陶罐）的提水水轮"},"examples":[{"en":"The farmers repaired the noria to bring water up to the fields.","zh":"农民修好了水车，把水提到田里。"},{"en":"In some old towns, you can still see norias turning slowly in the river.","zh":"在一些古老城镇里，你仍能看到水车在河里缓慢转动。"}]},{"partOfSpeech":"n.","definition":{"en":"a Ferris wheel or similar large rotating wheel for entertainment (less common usage)","zh":"（较少见）摩天轮；大型旋转游乐轮"},"examples":[{"en":"At the festival, the children rode the noria and watched the lights below.","zh":"在节日里，孩子们坐了摩天轮，看着下面的灯光。"}]}],"synonyms":["waterwheel","water-lifting wheel","irrigation wheel"],"phonetic":"/ˈnɔriə/","extraExplanation":["“noria”一词常被认为来自阿拉伯语，并在西班牙语等语言中流传，和地中海及中东地区的传统灌溉技术关系密切。著名的例子是叙利亚哈马（Hama）的古老水车群。","单数是 noria，复数是 norias。英语里更常见的相关词是 waterwheel（一般“水车”）或 irrigation wheel（灌溉水轮）。"]}
{"word":"noric","summary":{"en":"Noric means “of Noricum,” an ancient Alpine region tied to Roman history; it can also mean a person or item from that region.","zh":"Noric表示“与诺里库姆（古代阿尔卑斯地区）有关的”，也可指诺里库姆人或来自该地区的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Noricum, an ancient region in the eastern Alps (roughly modern Austria and nearby areas).","zh":"与“诺里库姆”（Noricum）有关的；指东阿尔卑斯一带的古代地区（大致相当于今天的奥地利及周边）。"},"examples":[{"en":"Archaeologists study Noric iron production to understand Roman-era trade.","zh":"考古学家研究诺里库姆的铁器生产，以了解罗马时代的贸易。"},{"en":"The museum has a section on Noric culture and religion.","zh":"博物馆有一个展区介绍诺里库姆的文化与宗教。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Noricum, or something (such as a word or inscription) belonging to Noricum.","zh":"诺里库姆人；或指属于诺里库姆的事物（如词语、铭文等）。"},"examples":[{"en":"A Noric served in the Roman auxiliary forces.","zh":"一名诺里库姆人曾在罗马辅军中服役。"},{"en":"The inscription contains a possible Noric name.","zh":"这段铭文里有一个可能的诺里库姆人名。"}]}],"synonyms":["Noricum-related","Noricus (historical/Latin)"],"phonetic":"/ˈnɔːrɪk/","extraExplanation":["“Noric”源自拉丁语“Noricus”，与古地名“Noricum（诺里库姆）”相关。诺里库姆在罗马时期非常有名，尤其以优质铁矿与冶铁技术著称（常见说法是“Norican steel/iron”在古代口碑很好）。","在现代英语里，“Noric”多用于历史、考古、古典学语境；日常生活中不常见。阅读古罗马史或博物馆说明牌时更容易遇到。"]}
{"word":"norice","summary":{"en":"“norice” isn’t standard; it usually means “no rice” (without rice).","zh":"“norice”不是标准写法，通常表示“no rice”（不要/不配米饭）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not a standard English word) Likely intended as “no rice”: a phrase meaning “without rice,” often used when ordering food or describing a meal.","zh":"（不是标准英文单词）很可能是想写“no rice”：表示“不要米饭/不加米饭”，常用于点餐或描述餐食。"},"examples":[{"en":"No rice, please—I’d like extra vegetables instead.","zh":"请不要米饭，我想多加点蔬菜。"},{"en":"This dish comes with no rice, just salad.","zh":"这道菜不配米饭，只有沙拉。"}]}],"synonyms":["without rice","rice-free"],"phonetic":"/noʊ raɪs/","extraExplanation":["“norice”通常被理解为把两个词写在一起（no + rice）。正式写法一般分开写：no rice。","如果你本来想查的是“notice”（注意到/通知），拼写和意思都不同：notice = 注意到；通知（名词/动词）。"]}
{"word":"norie","summary":{"en":"“norie” is a rare spelling for “noria,” a bucketed water wheel used to lift water for irrigation.","zh":"“norie”是“noria”的少见拼写，指一种带水桶的提水水车，用于把水提升以便灌溉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large water wheel with buckets, used to lift water for irrigation (a less common spelling of “noria”)","zh":"（较少见的拼写，同 noria）一种带水桶的大型提水水车，用来把水提升用于灌溉"},"examples":[{"en":"Farmers repaired the norie to bring river water up to the fields.","zh":"农民修理了那架 norie，把河水提上来灌溉田地。"},{"en":"Along the old canal, you can still see the wooden frame of a norie.","zh":"沿着古老的运河，你仍能看到那架 norie 的木制框架。"}]}],"synonyms":["noria","water wheel","scoop wheel"],"phonetic":"/ˈnɔri/","extraExplanation":["“norie / noria”常见于中东与地中海地区的传统灌溉场景（如叙利亚哈马的水车）。词源通常追溯到阿拉伯语与西班牙语相关词，常用于旅行文学或历史写作中来营造“古老水利工程”的画面感。"]}
{"word":"norimon","summary":{"en":"“Norimon” likely refers to Japanese *norimono*, meaning a vehicle or means of transportation.","zh":"“norimon”多半指日语 *norimono（乗り物）*，意思是交通工具/代步工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Japanese) a vehicle; a means of transportation; something you ride in or on (like a car, train, or bike).","zh":"（源自日语）交通工具；乘坐的东西（如汽车、火车、自行车等）。"},"examples":[{"en":"In Japanese, “norimono” means a vehicle, such as a car or a train.","zh":"在日语里，“norimono”指交通工具，比如汽车或火车。"},{"en":"The museum has exhibits of old norimono like rickshaws and carriages.","zh":"这家博物馆展出了旧式的交通工具，比如人力车和马车。"},{"en":"If you don’t have a norimono, you can take the bus.","zh":"如果你没有交通工具，可以坐公交车。"}]}],"synonyms":["vehicle","means of transportation","transport","ride"],"phonetic":"/ˌnɔːriˈmoʊnoʊ/","extraExplanation":["你输入的“norimon”更常见的拼写是 **norimono（のりもの／乗り物）**，是日语罗马字转写。来自动词 **noru（乗る，乘坐）** + 名词化形式，字面意思接近“可乘之物”。","在英语语境中，它通常出现在日本文化介绍、教材或翻译场景里；日常英语里更常说 **vehicle / transportation / ride**。"]}
{"word":"norit","summary":{"en":"Norit is a brand name for activated charcoal, used for filtering and sometimes for medical absorption.","zh":"Norit 是活性炭的品牌名，用于过滤，也有时用于医疗吸附。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for activated charcoal (carbon), often used as a filter material or (in some places) as a medicine to absorb certain substances in the stomach","zh":"Norit：活性炭（吸附性碳）的品牌名，常用于过滤材料；在一些地方也作为药物用于吸附胃内某些物质"},"examples":[{"en":"The water filter uses Norit (activated charcoal) to remove odors and impurities.","zh":"这个净水器用 Norit（活性炭）来去除异味和杂质。"},{"en":"Some people keep Norit tablets at home, but you should follow medical advice for poisoning cases.","zh":"有些人会在家里备 Norit 活性炭片，但遇到中毒情况应遵循医生或急救建议。"}]}],"synonyms":["activated charcoal","charcoal (when context is clear)"],"phonetic":"/ˈnɔrɪt/","extraExplanation":["“Norit”常见于欧洲（尤其荷兰）语境中，是一个知名活性炭品牌名；英语里也会直接用作名词指“这牌子的活性炭/炭片”。","活性炭在日常英语更常说 activated charcoal。它可用于过滤（water/air filtration）或在医疗场景中“吸附某些毒物/药物”。但并非对所有中毒都有效，且可能影响其他药物吸收，因此真实紧急情况应联系专业医疗/急救机构。"]}
{"word":"norite","summary":{"en":"Norite is a dark, coarse-grained igneous rock formed underground, mainly made of plagioclase feldspar and orthopyroxene.","zh":"诺利岩是一种在地下形成的深色粗粒火成岩，主要由斜长石和斜方辉石组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dark, coarse-grained intrusive igneous rock made mainly of plagioclase feldspar and orthopyroxene (with little or no quartz).","zh":"（地质）诺利岩：一种深色、粗粒的侵入性火成岩，主要由斜长石和斜方辉石组成，几乎不含石英。"},"examples":[{"en":"The field guide notes that the hillside is mostly norite with a few gabbro layers.","zh":"野外指南指出，这座山坡主要由诺利岩组成，并夹有少量辉长岩层。"},{"en":"Norite often forms deep underground and cools slowly, creating large visible crystals.","zh":"诺利岩常在地下深处形成，缓慢冷却，因此会产生肉眼可见的大晶体。"}]}],"synonyms":["orthopyroxene gabbro","gabbro (related type)"],"phonetic":"/ˈnɔːraɪt/","extraExplanation":["“norite”属于“辉长岩类（gabbroic rocks）”的一种近缘岩石类型，常见于大型基性—超基性侵入体中。对初学者来说，可以把它理解为“类似辉长岩，但富含斜方辉石（orthopyroxene）的那一类”。","词源来自挪威（Norway）的地名“Norge/ Norway”，因为这种岩石在挪威地区的研究与命名历史中较早被描述。"]}
{"word":"norites","summary":{"en":"“Norites” means more than one norite, a dark coarse-grained igneous rock.","zh":"“Norites”是 norite 的复数，指多块/多种诺利岩（一种深色粗粒火成岩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dark, coarse-grained igneous rock (similar to gabbro) mainly made of plagioclase feldspar and orthopyroxene; “norites” is the plural form.","zh":"一种深色、粗粒的火成岩（与辉长岩相似），主要由斜长石和斜方辉石组成；“norites”为其复数形式。"},"examples":[{"en":"Geologists mapped several norites in the mountain range.","zh":"地质学家在这条山脉中绘制了数处诺利岩（norite）的分布。"},{"en":"The sample contains norites and other mafic rocks.","zh":"这份样品包含诺利岩以及其他镁铁质岩石。"}]}],"synonyms":["norite (singular)","mafic intrusive rock","gabbro (similar rock)"],"phonetic":"/ˈnɔːraɪt/","extraExplanation":["“norite”的词源与挪威（Norway）有关：它最初因在挪威地区被描述而得名。","在地质学里，norite 常被归为“镁铁质（mafic）侵入岩”，颜色较深、密度相对较大，常见于大型岩体或地壳深部形成的岩石组合中。","学习时可与 gabbro（辉长岩）对比：两者都偏深色、粗粒，但 norite 的典型特征之一是含较多 orthopyroxene（斜方辉石）。"]}
{"word":"noritic","summary":{"en":"Noritic means “related to or composed of norite” (a type of dark igneous rock).","zh":"noritic 指“与诺利岩有关的/由诺利岩构成的”（一种深色火成岩）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) Related to or made of norite, a dark, coarse-grained igneous rock similar to gabbro.","zh":"（地质）与“诺利岩/紫苏辉长岩（norite）”有关的；由诺利岩构成的（一种深色、粗粒的火成岩，类似辉长岩）。"},"examples":[{"en":"The sample has a noritic texture with visible crystals.","zh":"这个样品呈现诺利岩质的结构，可以看到明显的晶体。"},{"en":"Geologists mapped a noritic intrusion in the northern range.","zh":"地质学家在北部山脉绘制出一处诺利岩质侵入体的分布图。"}]}],"synonyms":["norite-bearing","gabbroic (approx.)"],"phonetic":"/nɔˈrɪtɪk/","extraExplanation":["“noritic”是非常专业的地质学用词，日常英语中几乎不会用到。它来自岩石名称“norite（诺利岩/紫苏辉长岩）”。如果你是想表达“神经质的”，常见词是“neurotic”。"]}
{"word":"norito","summary":{"en":"Norito are formal Shinto prayers or ritual texts recited during ceremonies in Japan.","zh":"Norito 指日本神道仪式中诵读的正式祝词／祭文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Shinto ritual prayer or liturgical text recited in ceremonies in Japan","zh":"（日本）神道的祝词／祭文；在仪式中诵读的祈祷文或礼仪文本"},"examples":[{"en":"The priest recited a norito to purify the shrine before the festival began.","zh":"祭司诵读了祝词（norito），为庆典开始前净化神社。"},{"en":"Some museums display ancient norito manuscripts alongside other Shinto artifacts.","zh":"一些博物馆会展出古代祝词（norito）手稿，并与其他神道文物一同陈列。"}]}],"synonyms":["Shinto prayer","Shinto liturgy","ritual invocation"],"phonetic":"/nɔˈriːtoʊ/","extraExplanation":["“norito（祝詞）”是神道仪式中非常传统的文体，常用于祈福、祓除不净（祓い）、感谢神明等场合。内容往往固定、庄重，具有特定格式与用语。","英语里通常直接借用日语词“norito”，多见于宗教学、民俗学、历史或日本文化相关语境。一般不翻译成普通的“prayer”，而是保留专名以强调其神道背景。"]}
{"word":"nork","summary":{"en":"“Nork” is mainly a slang word meaning “breast” (vulgar). It can also (rarely) refer to a Norwegian person, often offensively.","zh":"“nork”主要是指“乳房”的粗俗俚语；也可（较少见且常带冒犯）指“挪威人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar) A breast; a nipple (usually used in the plural: “norks”).","zh":"（俚语，粗俗）乳房；乳头（常用复数 norks）。"},"examples":[{"en":"The joke was crude—someone made a comment about her norks.","zh":"那个笑话很低俗——有人评论了她的胸部。"},{"en":"He got in trouble for using words like “norks” at work.","zh":"他因为在工作场合用“norks”这种词而惹上麻烦。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, rare/dated; often offensive) A Norwegian person.","zh":"（非正式、少见/过时；常带冒犯）挪威人。"},"examples":[{"en":"That term for Norwegians is considered rude—avoid using it.","zh":"用那个词称呼挪威人被认为很不礼貌——建议别用。"},{"en":"Older slang sometimes used “nork,” but it can sound insulting today.","zh":"一些旧式俚语里会用“nork”，但如今听起来可能很冒犯。"}]}],"synonyms":["breast (neutral)","boob (informal)","tit (vulgar)","Norwegian (neutral)"],"phonetic":"/nɔrk/","extraExplanation":["“nork”在英语里不是标准书面词，更多见于口语或粗俗俚语。日常交流建议用中性表达：breasts / chest / nipples 等。","用“nork”指“挪威人”的用法较少见且可能带贬义；谈到国籍或族群时，优先使用 Norwegian 这类正式称呼以避免冒犯。"]}
{"word":"norkyn","summary":{"en":"“norkyn” isn’t a recognized English vocabulary word; it’s likely a name, username, or misspelling.","zh":"“norkyn”不是常见英语词汇；更可能是名字、用户名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “norkyn” is most likely a misspelling, a username, or a proper name (e.g., a surname/brand).","zh":"不是标准英语单词。“norkyn”更可能是拼写错误、用户名，或专有名词（如姓氏/品牌名）。"},"examples":[{"en":"I can’t find “norkyn” in a dictionary—could it be a username or a name?","zh":"我在词典里查不到“norkyn”——它会不会是用户名或人名？"},{"en":"If you meant “Norkin,” please share the sentence so I can confirm the meaning.","zh":"如果你想写的是“Norkin”，请把原句发我，我可以帮你确认意思。"}]}],"phonetic":"/ˈnɔrkɪn/","extraExplanation":["“norkyn”在常见英语词典中没有收录，因此无法给出可靠的固定释义与标准发音。","它可能是：①拼写错误（接近的形式可能是某个姓氏/品牌/地名的变体）；②网络昵称/游戏ID；③某个小语种或虚构作品中的词。","请你提供更多上下文（出现的句子、来源、是否为人名/地名/品牌名），或确认拼写（大小写也可能重要），我就能更准确地解释。"]}
{"word":"norland","summary":{"en":"Norland is usually a proper noun: a place name in England, a key estate name in Austen’s *Sense and Sensibility*, or part of “Norland College” (famous for training nannies).","zh":"Norland 通常是专有名词：可指英国地名、奥斯汀《理智与情感》中的重要庄园名，或“Norland College（诺兰学院）”（以培养诺兰保姆闻名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in England (a district/village name, e.g., Norland in West Yorkshire).","zh":"英国的地名（例如西约克郡的 Norland，指一个地区/村名）。"},"examples":[{"en":"She moved to Norland, West Yorkshire for a quieter life.","zh":"她搬到西约克郡的 Norland，想过更安静的生活。"},{"en":"Norland is a small area near Halifax in England.","zh":"Norland 是英格兰哈利法克斯附近的一个小地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary) the Dashwood family’s home estate in Jane Austen’s novel *Sense and Sensibility* (often called “Norland Park”).","zh":"（文学）简·奥斯汀小说《理智与情感》中达什伍德一家居住的庄园（常称“Norland Park / 诺兰庄园”）。"},"examples":[{"en":"In *Sense and Sensibility*, the story begins at Norland Park.","zh":"在《理智与情感》中，故事从 Norland Park（诺兰庄园）开始。"},{"en":"Leaving Norland is a major change for the Dashwood women.","zh":"离开 Norland 对达什伍德家的女性来说是一个巨大的变化。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK) used in the name of Norland College, a school famous for training professional nannies (“Norland nannies”).","zh":"（英国）用于 Norland College（诺兰学院）的名称；该校以培养专业保姆（“Norland nannies / 诺兰保姆”）闻名。"},"examples":[{"en":"She trained at Norland College to become a professional nanny.","zh":"她在 Norland College 接受培训，成为一名专业保姆。"},{"en":"Norland nannies are known for strict training and high standards.","zh":"诺兰保姆以严格训练和高标准而闻名。"}]}],"phonetic":"/ˈnɔr.lənd/","extraExplanation":["“Norland”多见于专有名词：可能是地名、学校名，或文学作品中的庄园名。读到时可以根据上下文判断：是否在谈英国地理、简·奥斯汀小说，或“Norland nanny（诺兰保姆）”。","在《理智与情感》中，“Norland（Norland Park）”象征着家庭地位与安全感；女主一家失去它，推动了情节发展。"]}
{"word":"norlander","summary":{"en":"Norlander means a person from northern Norway (especially Nordland), or something related to that region.","zh":"Norlander 指挪威北部（尤其诺尔兰地区）的人，或与该地区相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Nordland or northern Norway; sometimes more generally, someone from the far north (especially in Scandinavian contexts).","zh":"（通常指）挪威北部诺尔兰（Nordland）或挪威北部地区的人；有时也泛指“来自极北地区的人”（多见于斯堪的纳维亚语境）。"},"examples":[{"en":"Many Norlanders have strong connections to fishing and coastal life.","zh":"许多挪威北部人（Norlanders）与渔业和海岸生活有着深厚联系。"},{"en":"He moved south for work, but he still calls himself a Norlander.","zh":"他为了工作搬到南方，但仍称自己是挪威北部人（Norlander）。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to people, culture, or speech from northern Norway (especially Nordland).","zh":"与挪威北部（尤其是诺尔兰）的人、文化或口音相关的。"},"examples":[{"en":"The festival highlights Norlander traditions, music, and food.","zh":"这个节日展示挪威北部（Norlander）的传统、音乐和食物。"},{"en":"She speaks with a Norlander accent.","zh":"她带着挪威北部（Norlander）的口音说话。"}]}],"synonyms":["northerner","Nordland resident","northern Norwegian"],"phonetic":"/ˈnɔrˌlændər/","extraExplanation":["“Norlander”由“north/nor-（北方）+ -lander（某地的人）”构成，常用于描述挪威北部（尤其是Nordland）的人与文化。在英语里它相对小众，很多时候也可能只是姓氏（surname），需要结合上下文判断。"]}
{"word":"norlandism","summary":{"en":"Norlandism is a rare informal noun meaning the style or practices associated with Norland (especially elite British nanny training).","zh":"Norlandism 是一个罕见的非正式名词，指与 Norland（尤指英国精英保姆训练）相关的风格或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (rare, informal) term for the style, practices, or ideology associated with Norland (especially Norland College and its traditionally trained nannies).","zh":"（罕见、非正式）指与“Norland”（尤其是英国诺兰德学院及其传统训练的保姆/育儿师）相关的风格、做法或理念。"},"examples":[{"en":"Her childcare approach was described jokingly as a kind of Norlandism—very polished, structured, and traditional.","zh":"她的育儿方式被开玩笑地说成是一种“norlandism”——很讲究、很有结构、也很传统。"},{"en":"The article mentioned Norlandism to evoke the image of elite British nanny training.","zh":"文章用“norlandism”来唤起人们对英国精英保姆训练的印象。"}]}],"synonyms":["Norland nannying (informal)","Norland-style childcare (informal)","traditional nanny training (contextual)"],"phonetic":"/ˈnɔrˌlændɪzəm/","extraExplanation":["“Norlandism”并不是常见标准词典里的常用词，更像是由专有名词“Norland”加上名词后缀“-ism”临时造出来的说法。英语里“-ism”常用来表示“某种主义/风格/倾向”（如 realism、tourism），所以它在语感上容易被理解为“诺兰德式的做法/风格”。","Norland College（英国巴斯）以培养“Norland nannies（诺兰德保姆）”闻名，常与严格的礼仪、专业育儿技能、传统制服等文化形象联系在一起。"]}
{"word":"norlands","summary":{"en":"“Norlands” is usually a proper name (a place or institution). Rarely, it can mean “northern lands.”","zh":"“Norlands”通常是专有名称（地名或机构名）；少见情况下可指“北方的土地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name used for certain places, schools, companies, or properties called “Norland”; “Norlands” can refer to more than one of them or to a specific place whose official name is “Norlands.”","zh":"（专有名词）“Norland”的复数或变体，用作某些地名、学校、公司或地产等的名称；“Norlands”可以指多个名为 Norland 的地点/机构，也可能是某个地点的正式名称。"},"examples":[{"en":"They spent the weekend hiking near Norlands.","zh":"他们周末在 Norlands 附近徒步。"},{"en":"Norlands is listed on the map as a small community.","zh":"Norlands 在地图上被标注为一个小社区。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/poetic) “Northern lands”; lands in the north.","zh":"（少见/诗意用法）“北方的土地”；指北方地区。"},"examples":[{"en":"In old stories, travelers crossed the norlands in winter.","zh":"在古老的故事里，旅行者会在冬天穿越北方的土地。"},{"en":"Birds migrate from the norlands to warmer coasts.","zh":"鸟类从北方的土地迁徙到更温暖的海岸。"}]}],"synonyms":["the northern lands","lands in the north"],"phonetic":"/ˈnɔrˌlændz/","extraExplanation":["“Norlands”在现代英语里并不是常见普通词，更常见的是作为专有名词（地名/机构名）。如果你在句子里看到它，注意是否需要大写（Norlands）。","如果你本来想表达“北方的土地”，更自然的说法通常是“the northern lands”或“lands in the north”。"]}
{"word":"norleucine","summary":{"en":"Norleucine is a synthetic amino acid similar to leucine, mainly used in biochemical research and analytical measurements.","zh":"去亮氨酸是一种与亮氨酸相似的人工氨基酸，主要用于生化研究与分析测量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic (non‑protein) amino acid similar to leucine; it is often used in biochemical research as an internal standard or as a substitute in protein studies.","zh":"一种人工合成的（非蛋白质天然组成）氨基酸，结构与亮氨酸相似；常用于生化研究中作内标，或在蛋白质研究中作为替代氨基酸使用。"},"examples":[{"en":"The lab added norleucine as an internal standard for amino acid analysis.","zh":"实验室加入去亮氨酸作为氨基酸分析的内标。"},{"en":"Norleucine is not one of the 20 standard amino acids found in most proteins.","zh":"去亮氨酸不是大多数蛋白质中常见的20种标准氨基酸之一。"}]}],"synonyms":["2-aminohexanoic acid","α-aminohexanoic acid","n-leucine (less common)"],"phonetic":"/ˌnɔrˈluːsiːn/","extraExplanation":["“Nor-”在有机化学命名里常表示“比某个已知化合物少一个甲基（-CH₃）”或为其结构上的“去甲基/简化同系物”。因此 norleucine 可理解为“与 leucine（亮氨酸）相近、但侧链结构略不同的一种同系氨基酸”。","去亮氨酸在生物体内并非常见的蛋白质编码氨基酸，但在分析化学（如色谱/质谱定量）中很受欢迎，因为它与天然氨基酸性质相近、又不容易与样品中的天然组分混淆。"]}
{"word":"Norm","summary":{"en":"A norm is what is usual or expected—either a social rule/standard behavior or an average standard for comparison.","zh":"Norm 指“常态/规范”：既可指社会中通常或被期待的行为标准，也可指用于比较的平均标准（常模）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a standard or usual pattern of behavior, thought, or condition in a group or society","zh":"（群体或社会中的）规范；常态；通常的行为/想法/情况"},"examples":[{"en":"In many workplaces, arriving on time is the norm.","zh":"在很多工作场所，准时到达是一种常态。"},{"en":"It’s the norm for students to use laptops in class now.","zh":"现在学生在课堂上使用笔记本电脑已很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"a typical or expected level; an average standard used for comparison","zh":"（用于比较的）标准水平；常模；平均标准"},"examples":[{"en":"The results are above the norm for this age group.","zh":"这些结果高于这个年龄段的常模。"},{"en":"After a few days, her temperature returned to normal levels—the norm.","zh":"几天后，她的体温恢复到了正常水平（常态）。"}]}],"synonyms":["standard","custom","convention","average","benchmark"],"phonetic":"/nɔrm/","extraExplanation":["“Norm”常用于社会学与日常表达：强调“大家普遍认为应该怎样/通常怎样”。它不一定是法律规则（law），但会对行为产生压力。常见搭配：social norms（社会规范）、the norm in/for…（在……中很常见）、break the norm（打破常规）。"]}
{"word":"norm","summary":{"en":"A norm is a common standard, expectation, or usual pattern—what people generally consider normal.","zh":"norm 指普遍认可的标准、期待或常态，也就是人们通常认为“正常/应当如此”的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A typical standard or pattern that is considered normal or expected in a group, society, or situation.","zh":"（群体/社会/情境中）被认为正常或应当遵循的标准、常规、规范。"},"examples":[{"en":"In many workplaces, replying to emails within 24 hours is the norm.","zh":"在很多职场里，24小时内回复邮件是一种常规。"},{"en":"It’s becoming the norm to pay by phone instead of cash.","zh":"用手机支付而不是现金正逐渐成为常态。"}]},{"partOfSpeech":"n.","definition":{"en":"A usual or average level of something; what commonly happens.","zh":"通常水平；平均情况；常见现象。"},"examples":[{"en":"After a few weeks, her sleep schedule returned to normal—the norm for her.","zh":"几周后，她的睡眠作息恢复到她平常的状态。"},{"en":"Long lines are the norm during the holiday season.","zh":"假期期间排长队是常见现象。"}]}],"synonyms":["standard","custom","convention","rule","expectation","average"],"phonetic":"/nɔrm/","extraExplanation":["“Norm”常用于社会与文化语境，强调“群体共同默认的规则/期待”（social norms），如守时、排队、礼貌用语等。","在学术语境中也可能出现更专业的用法：数学里的“norm”指“范数/模”（衡量向量大小的量），但日常英语里最常见的还是“常规、常态、规范”。"]}
{"word":"norma","summary":{"en":"Norma is most commonly a woman’s name; it is also the title of a well-known Italian opera by Bellini.","zh":"Norma 最常见用法是女性名字；也可指贝利尼的著名意大利歌剧《诺玛》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name","zh":"女性名字（诺玛）"},"examples":[{"en":"My aunt’s name is Norma, and everyone calls her Norm.","zh":"我阿姨叫 Norma，大家都叫她 Norm。"},{"en":"Norma moved to Chicago for her new job.","zh":"Norma 为了新工作搬去了芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"the title of a famous Italian opera by Vincenzo Bellini (first performed in 1831)","zh":"《诺玛》（意大利作曲家贝利尼的著名歌剧，1831年首演）"},"examples":[{"en":"She sang an aria from Norma in her recital.","zh":"她在独唱音乐会上演唱了《诺玛》中的一段咏叹调。"},{"en":"“Casta Diva” is the best-known aria from Norma.","zh":"《圣洁的女神》（Casta Diva）是《诺玛》里最有名的咏叹调。"}]}],"synonyms":["standard (related meaning)","norm (related meaning)"],"phonetic":"/ˈnɔrmə/","extraExplanation":["“Norma”这个名字来自拉丁语 norma，原意是“木工用的直角尺/规矩”，引申为“标准、规范”。因此它和英语里的 norm（规范）以及 normal（正常的）是同源词。","在英语里它通常作为专有名词（人名/作品名）使用；如果你想表达“规范、标准”，更常用的词是 norm 或 standard。"]}
{"word":"normal","summary":{"en":"“Normal” means usual/typical or within a standard range; it can also mean the usual state (“the normal”).","zh":"“normal”表示“正常的、一般的、在标准范围内”；也可作名词指“常态/正常水平”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"usual, typical, or expected; not unusual or strange","zh":"正常的；一般的；符合常态的，不奇怪的"},"examples":[{"en":"It’s normal to feel nervous before a test.","zh":"考试前感到紧张是很正常的。"},{"en":"The doctor said your blood pressure is normal.","zh":"医生说你的血压正常。"},{"en":"After a few days, life went back to normal.","zh":"过了几天，生活又恢复了正常。"}]},{"partOfSpeech":"n.","definition":{"en":"the usual or typical state or level; what is considered standard","zh":"常态；正常水平；标准状态"},"examples":[{"en":"The temperature is back to normal.","zh":"气温恢复到正常水平。"},{"en":"This year’s sales are above the normal for our store.","zh":"今年的销售额高于我们店的常态水平。"}]}],"synonyms":["usual","typical","common","standard","regular"],"phonetic":"/ˈnɔrməl/","extraExplanation":["“Normal”常和情绪、身体指标、社会行为连用，表示“在常见范围内”。在谈论人或群体时，英语里用“normal”可能让人觉得在暗示“别人不正常”，语气不够友善；更中性、尊重的说法常用“typical”“common”“usual”或直接描述具体情况（如“many people do…”）。","常见搭配：normal life（正常生活）、normal range（正常范围/参考范围）、normal people（需谨慎使用）、as normal（像往常一样）、back to normal（恢复正常）。"]}
{"word":"normalacy","summary":{"en":"“normalacy” is a nonstandard spelling; the standard word is usually “normalcy,” meaning the usual/normal state or a return to normal.","zh":"“normalacy”不是标准拼写；标准形式通常是“normalcy”，表示“常态/正常状态”或“恢复正常”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled \"normalcy\") The usual, expected state of things; a return to a normal condition after something unusual.","zh":"（常见拼写为 normalcy）常态；正常状态；（尤指在异常事件后）恢复正常。"},"examples":[{"en":"After the storm, the town slowly returned to normalcy.","zh":"暴风雨过后，小镇慢慢恢复了正常。"},{"en":"She missed the normalcy of her daily routine.","zh":"她很怀念日常生活的常态。"},{"en":"The new rules helped bring some normalcy back to the workplace.","zh":"新规定帮助工作场所恢复了一些正常秩序。"}]}],"synonyms":["normalcy","normality","the usual state","routine"],"phonetic":"/ˈnɔrməl-si/","extraExplanation":["“normalacy”不是标准拼写，通常是把“normalcy”（常用）或“normality”（更正式）拼错了。","“normalcy”在美式英语里很常见，意思是“常态/恢复正常”；“normality”更偏“正常性/常态（抽象概念）”，在学术或正式语境中更常用。"]}
{"word":"normalcy","summary":{"en":"Normalcy means the usual, expected state of life or conditions—often used when things are returning to normal after disruption.","zh":"Normalcy 指“常态/正常状态”，常用于描述在动荡或打乱之后“恢复正常”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being normal; what is usual or expected in a situation","zh":"正常状态；常态；在某种情境下通常或被期待的状态"},"examples":[{"en":"After the storm, the town slowly returned to normalcy.","zh":"暴风雨过后，小镇慢慢恢复了常态。"},{"en":"She wanted a sense of normalcy for her children after the move.","zh":"搬家之后，她希望孩子们能有一种回到正常生活的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"a typical or ordinary standard used to judge what is normal","zh":"（用来判断“正常”的）常规标准；一般尺度"},"examples":[{"en":"What counts as normalcy can vary across cultures and families.","zh":"什么算“正常”，在不同文化和家庭之间可能不一样。"}]}],"synonyms":["normality","the norm","usualness","routine","ordinary life"],"phonetic":"/ˈnɔrməlsi/","extraExplanation":["“Normalcy”常被用于公共生活和历史语境中，尤其是谈到动荡（如战争、疫情、经济危机）之后“恢复常态/回归正常”。","在正式写作中，“normality”更常见；但“normalcy”在美式英语里很常用，语气更口语、更强调“回到日常”。","该词在美国历史上因沃伦·哈定（Warren G. Harding）1920年竞选时提出“return to normalcy（回归常态）”而广为人知。"]}
{"word":"normalis","summary":{"en":"Normalis is a Latin word meaning “normal/standard,” mainly used in scientific or academic contexts.","zh":"normalis 是拉丁语，意为“正常/标准”，主要用于科学或学术语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in scientific or academic contexts) “normal,” “regular,” or “standard,” often seen as a species name (epithet) or descriptive label.","zh":"（拉丁语；多用于科学/学术语境）“正常的”“规则的”“标准的”，常见于物种学名（种加词）或描述性标签中。"},"examples":[{"en":"In some older scientific descriptions, you may see normalis used to mean the “typical” form.","zh":"在一些较早的科学描述中，你可能会看到 normalis 用来表示“典型/常见”的形态。"},{"en":"The Latin word normalis is related to the English word normal.","zh":"拉丁语 normalis 与英语 normal 同源相关。"}]}],"synonyms":["normal","standard","typical"],"phonetic":"/nɔrˈmælɪs/","extraExplanation":["normalis 不是现代英语里常用的单词；它更像是“借用的拉丁语”，常出现在生物分类学（物种学名）或旧式学术写作中，用来表达“常规/典型/标准”。","如果你想表达英语里的“使……正常化/标准化”，现代英语通常用 normalize（美式）或 normalise（英式）。"]}
{"word":"normalisation","summary":{"en":"Normalisation means making something return to or fit a normal/standard state; it’s also used for diplomatic relations and for standardizing data or information.","zh":"normalisation 指让事物恢复或符合正常/标准状态；也常用于“外交关系正常化”以及数据或信息的标准化/规范化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something normal, usual, or acceptable again; returning to a standard condition","zh":"使某事恢复正常、常态或被普遍接受的过程；回到标准状态"},"examples":[{"en":"After the crisis, the country worked toward normalisation of daily life.","zh":"危机过后，这个国家努力让日常生活恢复正常。"},{"en":"Therapy can help with the normalisation of sleep patterns.","zh":"治疗可以帮助睡眠模式恢复正常。"}]},{"partOfSpeech":"n.","definition":{"en":"(politics) the act of establishing or restoring normal relations between countries, organizations, or groups","zh":"（政治）建立或恢复国家、组织或群体之间正常关系的行为"},"examples":[{"en":"The talks focused on normalisation of diplomatic relations.","zh":"会谈重点是外交关系正常化。"},{"en":"Normalisation may include reopening embassies and expanding trade.","zh":"关系正常化可能包括重开大使馆并扩大贸易。"}]},{"partOfSpeech":"n.","definition":{"en":"(math/data) the process of adjusting values to a common scale or standard format so they can be compared more fairly","zh":"（数学/数据）把数值调整到统一尺度或标准格式，以便更公平地比较"},"examples":[{"en":"We used normalisation so test scores from different classes could be compared.","zh":"我们做了标准化处理，以便比较不同班级的测试成绩。"},{"en":"Data normalisation can reduce the impact of very large numbers.","zh":"数据标准化可以降低特别大的数值带来的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing/linguistics) the process of reorganizing or standardizing information (such as a database or text) to reduce errors and improve consistency","zh":"（计算机/语言学）对信息（如数据库或文本）进行规范化/标准化，以减少错误并提高一致性"},"examples":[{"en":"Database normalisation helps avoid storing the same information in many places.","zh":"数据库规范化有助于避免在多个地方重复存储同一信息。"},{"en":"Text normalisation can standardize spelling and punctuation for analysis.","zh":"文本规范化可以统一拼写和标点，便于分析。"}]}],"synonyms":["normalization","standardization","regularization","stabilization"],"phonetic":"/ˌnɔrmələˈzeɪʃən/","extraExplanation":["normalisation 是英式拼写；美式拼写更常见的是 normalization。两者意义相同，只是拼写习惯不同（-ise vs -ize）。","在政治新闻里，“relations normalisation / normalisation of relations”很常见，中文通常译为“关系正常化”。","在数据/数学语境里，normalisation 常译为“标准化/归一化”，具体译法取决于方法：统一到某个范围常叫“归一化”，调整到某个统计标准常叫“标准化”。"]}
{"word":"normalise","summary":{"en":"Normalise means to make something normal again, to standardize it, or (in data/math) to put values on a common scale.","zh":"Normalise 指使恢复正常、使标准化，或（在数据/数学中）把数值归一化到同一尺度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something return to a normal or usual state; to make it seem normal again","zh":"使恢复正常；使回到常态；使变得“正常化”"},"examples":[{"en":"After the crisis, the company tried to normalise operations as quickly as possible.","zh":"危机过后，公司尽快让运营恢复正常。"},{"en":"Talking openly can help normalise mental health discussions.","zh":"坦诚交流有助于让心理健康话题变得更常见、更不尴尬。"}]},{"partOfSpeech":"v.","definition":{"en":"to standardize something so it follows the same rules or format","zh":"使标准化；使统一（规则/格式）"},"examples":[{"en":"We need to normalise the date format across all documents.","zh":"我们需要把所有文件里的日期格式统一起来。"},{"en":"The team normalised job titles so roles are easier to compare.","zh":"团队统一了职位名称，方便比较不同岗位。"}]},{"partOfSpeech":"v.","definition":{"en":"(math/data) to adjust values to a common scale for easier comparison or analysis","zh":"（数学/数据）对数据进行归一化；把数值调整到同一尺度以便比较或分析"},"examples":[{"en":"Before training the model, we normalised the input data.","zh":"在训练模型之前，我们对输入数据做了归一化处理。"},{"en":"The researcher normalised the results to percentages.","zh":"研究人员把结果归一化成百分比。"}]}],"synonyms":["normalize","standardize","regularize","stabilize","make routine"],"phonetic":"ˈnɔrməˌlaɪz","extraExplanation":["“normalise”是英式拼写；美式拼写更常见的是“normalize”。两者意思相同，只是拼写习惯不同。","在社会话题里，“normalise”常带有“让某种现象变得不再罕见/不再被污名化”的语气（例如 normalise therapy）。","在数据分析/机器学习中，“normalise”常指把不同量纲或范围的数据拉到同一尺度（例如 0–1 区间），以便比较或训练模型。"]}
{"word":"normalised","summary":{"en":"“Normalised” means made standard/regular or (in data) scaled for fair comparison; it’s the UK spelling of “normalized.”","zh":"“normalised”指正常化/标准化的，或（数据中）归一化的；是“normalized”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made normal, standard, or regular; adjusted to fit an accepted standard (UK spelling of “normalized”).","zh":"正常化的；标准化的；调整到符合公认标准的（英式拼写，对应美式“normalized”）。"},"examples":[{"en":"The text was normalised to a single spelling system.","zh":"这段文字被标准化为统一的拼写体系。"},{"en":"After a few weeks, his sleep schedule was normalised.","zh":"几周后，他的作息恢复正常了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(math/data) scaled or adjusted so values can be compared fairly, often by putting them on the same range or using a standard formula.","zh":"（数学/数据）归一化的；通过缩放或调整，使数值更便于公平比较（常见做法是放到同一范围或用标准公式处理）。"},"examples":[{"en":"We used normalised scores to compare students from different classes.","zh":"我们用归一化后的分数来比较不同班级的学生。"},{"en":"The model performs better with normalised input data.","zh":"这个模型在使用归一化输入数据时表现更好。"}]}],"synonyms":["standardized","regularized","normalized","scaled","adjusted"],"phonetic":"/ˈnɔrməˌlaɪzd/","extraExplanation":["“normalised”是英式拼写；美式英语更常写作“normalized”。两者意思相同。","拼写差异来自 -ise / -ize：英式英语中两种都能见到，但很多英式出版物偏好 -ise；美式英语通常用 -ize。"]}
{"word":"normalising","summary":{"en":"“Normalising” means making something normal/standard again, or (in data/tech) standardizing values so they are comparable.","zh":"“normalising”指使某事恢复正常/变得标准；在数据与技术语境中指对数值进行标准化以便比较。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something return to a usual, expected, or “normal” state; making something seem acceptable or ordinary","zh":"使某事回到通常/正常状态；使某事显得可接受或变得司空见惯"},"examples":[{"en":"The doctor explained that the treatment is normalising his blood pressure.","zh":"医生解释说，这种治疗正在使他的血压恢复正常。"},{"en":"Some people worry that constant violent news is normalising aggression.","zh":"有些人担心持续的暴力新闻在让攻击行为变得司空见惯。"}]},{"partOfSpeech":"v.","definition":{"en":"adjusting data or measurements so they follow a standard format or are comparable (for example, scaling values to a common range)","zh":"对数据/测量值进行标准化处理，使其符合统一格式或便于比较（例如缩放到同一范围）"},"examples":[{"en":"Before training the model, we are normalising the input data.","zh":"在训练模型之前，我们正在对输入数据进行标准化。"},{"en":"Normalising the scores makes it easier to compare students from different classes.","zh":"对分数进行标准化后，更容易比较不同班级的学生。"}]}],"synonyms":["standardizing","regularizing","stabilizing","making normal"],"phonetic":"/ˈnɔrməˌlaɪzɪŋ/","extraExplanation":["“normalising”是英式拼写；美式更常写作“normalizing”。两者意思相同。","它是动词“normalise/normalize”的现在分词形式，常用于进行时（be normalising）或作定语（a normalising process）。"]}
{"word":"normalism","summary":{"en":"Normalism is the belief or system that treats “normal” as the preferred standard, often encouraging conformity and defining what counts as normal vs. abnormal.","zh":"Normalism指把“正常”当作理想标准的观念或机制，常推动从众，并用来划分与维持“正常/不正常”的界线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief or attitude that treats what is “normal” (common, standard, socially accepted) as the correct or desirable way to be; preference for conformity to norms.","zh":"一种把“正常”（常见、标准、被社会接受）视为正确或理想状态的观念；倾向于遵从社会规范、追求合群。"},"examples":[{"en":"Her normalism made her suspicious of anyone who dressed or spoke differently.","zh":"她的“正常主义”让她对穿着或说话方式不同的人产生怀疑。"},{"en":"The school’s normalism pushed students to hide their differences.","zh":"学校的“正常主义”迫使学生隐藏自己的不同。"}]},{"partOfSpeech":"n.","definition":{"en":"(Social theory) The system or practice of defining, measuring, and enforcing what counts as “normal,” often by labeling people or behavior as normal vs. abnormal.","zh":"（社会理论）界定、衡量并维持“正常”标准的一套机制或做法，常通过把人或行为划分为“正常/不正常”来运作。"},"examples":[{"en":"In the article, normalism is described as a way society manages risk by setting statistical norms.","zh":"文章把“正常主义”描述为社会通过设定统计性常模来管理风险的一种方式。"},{"en":"The novelist critiques normalism by showing how “normal” rules can harm outsiders.","zh":"这位小说家通过呈现“正常”规则如何伤害局外人来批判“正常主义”。"}]}],"synonyms":["normalcy","conventionalism","conformism","normativity","standardization"],"phonetic":"/ˈnɔrməˌlɪzəm/","extraExplanation":["“normalism”并不是日常英语里的常用词，更常见的表达是“the pressure to be normal（变得正常的压力）”“conformity（从众）”“normativity（规范性）”。在学术语境中，它有时用来讨论社会如何生产与维持“正常/异常”的边界。","在某些欧洲社会理论讨论中（如与“normalization/正常化”“statistical norms/统计常模”相关的研究），normalism可指通过数据、制度与话语来规定“正常范围”的治理方式。"]}
{"word":"normalist","summary":{"en":"“Normalist” is a rare noun meaning either (1) someone who favors what is normal/conventional, or (2) someone associated with an École Normale, especially France’s École Normale Supérieure.","zh":"“Normalist” 是个较少见的名词，可指（1）偏好常规、传统的人；或（2）与师范/高师（尤指法国高等师范学院）有关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or prefers what is normal, standard, or conventional (a rare word; often used in academic or critical writing).","zh":"主张或偏好“正常/标准/常规”的人（较少见，多用于学术或评论性语境）。"},"examples":[{"en":"Some critics call him a normalist because he dislikes experimental art.","zh":"一些评论家称他为“normalist”，因为他不喜欢实验艺术。"},{"en":"In the debate, the normalists argued for traditional rules and familiar forms.","zh":"在辩论中，normalists 主张遵守传统规则和熟悉的形式。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone connected with an École Normale (especially France’s École Normale Supérieure), such as a student, graduate, or faculty member (rare in everyday English).","zh":"与“师范/高师”（尤其指法国高等师范学院 École Normale Supérieure）有关的人，如学生、毕业生或教职人员（在日常英语中较少用）。"},"examples":[{"en":"She studied in Paris and was described as a normalist in older English sources.","zh":"她在巴黎求学，在一些较老的英文资料里被称为 normalist。"},{"en":"The book lists several normalists who later became influential philosophers.","zh":"书中列出几位后来成为重要哲学家的 normalists。"}]}],"synonyms":["conventionalist","traditionalist","conformist","status-quo supporter"],"phonetic":"/ˈnɔrməlɪst/","extraExplanation":["“normalist”在现代英语里不算常用词。更常见的表达通常是：a conventional person（保守/循规蹈矩的人）、a traditionalist（传统主义者）或 someone who prefers the status quo（偏好维持现状的人）。","第二个含义主要出现在与法国教育体系相关的语境：法语里更常见的说法是 normalien/normalienne（ENS 学生或校友）。英文里有时会用 “ENS graduate / ENS alumnus” 来避免生僻词。"]}
{"word":"normalities","summary":{"en":"“Normalities” means the usual conditions or routines—often the many everyday “normal” things that make life feel stable again.","zh":"“Normalities”指各种“常态/日常惯例”，常用于强调许多具体的日常细节恢复正常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the usual or expected conditions, behaviors, or routines (often used when daily life returns after a disruption)","zh":"（常用复数）常态；正常的状态、行为或日常规律（常指经历干扰后恢复到平常）"},"examples":[{"en":"After the storm, the town slowly returned to its normalities.","zh":"暴风雨过后，小镇慢慢恢复了常态。"},{"en":"Travel normalities changed after the pandemic.","zh":"疫情之后，旅行的常态发生了变化。"}]},{"partOfSpeech":"n.","definition":{"en":"things that are considered normal or typical within a group or situation","zh":"被认为“正常/典型”的事物（在某个群体或情境中）"},"examples":[{"en":"Every family has its own normalities.","zh":"每个家庭都有自己的“常态”。"},{"en":"In a new job, it takes time to learn the normalities of the workplace.","zh":"在新工作中，需要时间了解职场的常态。"}]}],"synonyms":["normal routines","everyday life","usual conditions","the status quo","regularity"],"phonetic":"/nɔrˈmælətiz/","extraExplanation":["“normalities”是“normality”的复数。英语里更常用单数“normality”表示“正常状态”，但在谈到“许多具体的日常细节/常规做法”时，用复数更自然，比如：return to the normalities（回到各种日常常态）。","语气上偏书面或新闻报道；更口语的表达常用“things back to normal / get back to normal”。"]}
{"word":"normality","summary":{"en":"Normality means the usual/normal state, or the social standard of what is considered normal.","zh":"Normality 指“正常/常态”，也可指社会所认为的“正常”标准。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being normal; the usual, expected condition or behavior","zh":"正常状态；常态；符合一般预期的状态或行为"},"examples":[{"en":"After the storm, the city slowly returned to normality.","zh":"暴风雨过后，这座城市慢慢恢复了常态。"},{"en":"Many people hoped for a sense of normality after a difficult year.","zh":"经历艰难的一年后，许多人希望找回一种“正常”的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"the idea or standard of what a society considers normal (often discussed in medicine, psychology, or social issues)","zh":"（社会所认定的）“正常”的观念或标准（常见于医学、心理学或社会议题讨论）"},"examples":[{"en":"The film questions who gets to define normality in a community.","zh":"这部电影质疑：在一个社区里，谁有权定义“正常”。"},{"en":"In psychology, normality can depend on culture and context.","zh":"在心理学中，“正常”往往取决于文化和情境。"}]}],"synonyms":["normalcy","usualness","ordinariness","regularity"],"phonetic":"/nɔrˈmælɪti/","extraExplanation":["“normality”来自“normal”（正常的）+ “-ity”（表示状态或性质的名词后缀），意思是“正常这一状态/性质”。","语气与搭配：常见于较正式的语境，尤其是“return to normality”（恢复常态）、“a sense of normality”（正常感）。日常口语中也常直接说“back to normal”。","文化提示：谈到“normality”时，有时带有反思意味——不同文化、群体对“正常”的标准可能不同，因此在讨论心理健康、身体差异或社会规范时会更谨慎地使用。"]}
{"word":"normaliz","summary":{"en":"Normalize means to make something standard or normal; in data/tech, it means converting information into a consistent format.","zh":"Normalize 指使……标准化或恢复正常；在数据/技术语境中指把信息转换为一致的格式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something regular, standard, or “normal,” often by adjusting it to fit a common rule or level","zh":"使……正常化；使……标准化（常通过调整来符合统一规则或水平）"},"examples":[{"en":"The company is trying to normalize its work process across all offices.","zh":"公司正努力让所有办公室的工作流程标准化。"},{"en":"This treatment can help normalize your sleep schedule.","zh":"这种治疗可以帮助你把睡眠作息恢复正常。"}]},{"partOfSpeech":"vt.","definition":{"en":"(data/technology) to change data into a standard format so it can be compared, stored, or analyzed more easily","zh":"（数据/技术）把数据转换为统一格式，便于比较、存储或分析"},"examples":[{"en":"We need to normalize the dates to the same format before merging the files.","zh":"合并文件前，我们需要把日期统一成同一种格式。"},{"en":"The app normalizes audio levels so the volume stays consistent.","zh":"这个应用会把音量水平标准化，让声音保持一致。"}]},{"partOfSpeech":"vt.","definition":{"en":"(relationships/politics) to make a situation official or accepted as normal again","zh":"（关系/政治）使（关系/局势）恢复正常并被正式接受"},"examples":[{"en":"The two countries agreed to normalize relations after years of tension.","zh":"在多年的紧张之后，两国同意关系正常化。"}]}],"synonyms":["standardize","regularize","stabilize","adjust","harmonize"],"phonetic":"/ˈnɔrməˌlaɪz/","extraExplanation":["你输入的“normaliz”通常是拼写未完成或拼错；正确拼写是 **normalize**（美式），英式常写作 **normalise**。"]}
{"word":"normalizable","summary":{"en":"Normalizable means “able to be made standard/normal through normalization,” especially in data, math, or databases.","zh":"normalizable 指“可被归一化/标准化/规范化的”，常用于数据、数学或数据库语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be made normal; able to be adjusted to a standard or common form by a process of normalization.","zh":"可被规范化的；可通过“归一化/标准化”等过程调整为标准或常见形式的。"},"examples":[{"en":"This data is normalizable, so we can scale all values to a 0–1 range.","zh":"这组数据是可归一化的，所以我们可以把所有数值缩放到 0–1 的范围。"},{"en":"The database schema is normalizable and can be reorganized to reduce duplication.","zh":"这个数据库模式是可规范化的，可以重新组织以减少重复数据。"},{"en":"Not every text input is easily normalizable, especially when it includes mixed languages.","zh":"并不是每种文本输入都容易规范化，尤其是包含多种语言时。"}]}],"synonyms":["standardizable","regularizable","scalable (in data context)"],"phonetic":"/ˈnɔrməˌlaɪzəbəl/","extraExplanation":["“normalizable”常见于数学、统计与计算机领域，表示“可以通过某种规则变成‘标准形’”。例如：把向量变成单位长度（归一化）、把特征缩放到同一量纲（标准化/归一化）、把数据库表结构整理到范式（规范化）。","词形来源：normal（正常/标准）+ -ize（使成为…）+ -able（能够…的）。因此字面意思是“能够被使成标准的”。"]}
{"word":"normalization","summary":{"en":"Normalization means making something standard or normal; in data or databases, it often means adjusting/organizing information so it’s comparable and consistent.","zh":"Normalization 指让事物变得标准/正常；在数据或数据库语境中，常指对信息进行调整或组织，使其可比较且更一致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something more normal, regular, or standard; bringing it into an accepted or usual condition","zh":"使某事变得更正常、更规则或更标准的过程；使其回到被接受或常见状态的过程"},"examples":[{"en":"The normalization of relations between the two countries took several years.","zh":"两国关系的正常化花了好几年。"},{"en":"After the crisis, the company focused on the normalization of its daily operations.","zh":"危机过后，公司把重点放在日常运营的恢复正常上。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of adjusting data or measurements so they can be compared fairly (for example, by converting them to a common scale)","zh":"对数据或测量值进行调整，使其能公平比较（例如换算到同一尺度/标准）的做法"},"examples":[{"en":"Data normalization helped the researchers compare results from different hospitals.","zh":"数据归一化帮助研究人员比较不同医院的结果。"},{"en":"Before training the model, we did normalization to keep the features on a similar scale.","zh":"在训练模型之前，我们先做归一化，让各个特征的尺度更接近。"}]},{"partOfSpeech":"n.","definition":{"en":"in databases, organizing data to reduce repetition and improve consistency","zh":"在数据库中，为减少重复并提高一致性而对数据进行结构化/规范化的过程"},"examples":[{"en":"Database normalization can reduce duplicate records and update errors.","zh":"数据库规范化可以减少重复记录和更新错误。"},{"en":"They discussed normalization when designing the customer tables.","zh":"他们在设计客户表时讨论了规范化。"}]}],"synonyms":["standardization","regularization","stabilization","data scaling","harmonization"],"phonetic":"/ˌnɔːrmələˈzeɪʃən/","extraExplanation":["“Normalization”在不同领域含义会变：日常语境常指“恢复正常/关系正常化”；数学与数据科学里常指“把数值缩放到可比范围”（常见方法如min-max把数据压到0到1）；数据库里则是指按规则拆分表结构以减少冗余。看到它时可以先看上下文属于哪一类。","常见搭配：normalization process（规范化过程/归一化过程）、normalization of relations（关系正常化）、data normalization（数据归一化）、database normalization（数据库规范化）。"]}
{"word":"normalizations","summary":{"en":"Normalizations are methods or processes for making things consistent, standard, or comparable—especially in data, databases, and text.","zh":"Normalizations 指把事物变得一致、标准或可比较的多种方法/过程，常见于数据、数据库和文本处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ways of making something “standard” or comparable by adjusting it to a common scale or rule (often used in data, math, language, and everyday procedures).","zh":"通过调整到共同的尺度或规则，使事物“标准化”或便于比较的方法（常用于数据、数学、语言和日常流程）。"},"examples":[{"en":"Different normalizations can change the results of your analysis.","zh":"不同的标准化方法会改变你的分析结果。"},{"en":"We tried several normalizations so the test scores could be compared fairly.","zh":"我们尝试了几种标准化方式，以便更公平地比较测试分数。"}]},{"partOfSpeech":"n.","definition":{"en":"(In databases) Steps used to organize tables to reduce repeated data and avoid errors.","zh":"（在数据库中）为减少数据重复、避免错误而对表进行组织与拆分的规范化步骤。"},"examples":[{"en":"Database normalizations help prevent the same customer data from being stored in many places.","zh":"数据库规范化有助于防止同一位客户信息被存到多个地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(In language or text processing) Changes that make text more consistent, such as lowercasing, standard spelling, or removing extra spaces.","zh":"（在语言/文本处理中）让文本更一致的处理，如转小写、统一拼写、去掉多余空格等。"},"examples":[{"en":"Text normalizations like lowercasing make searching easier.","zh":"把文本转小写等规范化处理会让搜索更容易。"}]}],"synonyms":["standardizations","scalings","adjustments","regularizations"],"phonetic":"/ˌnɔɹmələˈzeɪʃənz/","extraExplanation":["“Normalization(s)”是名词“normalization”的复数。单数更常用于泛指一个过程（normalization），复数更常用于强调有多种方法或多套规则（normalizations）。","在数据分析里常见的几种normalization包括：把数值缩放到0到1（min-max scaling）、让数据更接近平均值与标准差的尺度（standardization / z-score），以及按比例或总量进行调整（如按人口、按总量归一化）。不同任务适合不同做法。"]}
{"word":"normalize","summary":{"en":"Normalize means to make something normal again or to make it standard/consistent, and it’s also used technically for data and databases.","zh":"Normalize指使事物恢复正常，或使其标准化/一致化；在技术领域也指数据与数据库的规范化处理。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something return to a normal, usual, or expected state","zh":"使恢复正常；使回到通常/预期状态"},"examples":[{"en":"After the storm, it took a week for life in the city to normalize.","zh":"暴风雨过后，这座城市的生活花了一周才恢复正常。"},{"en":"Try to normalize your sleep schedule by going to bed at the same time each night.","zh":"尽量通过每天同一时间睡觉来让你的作息恢复规律。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something standard or consistent (so it can be compared or used fairly)","zh":"使标准化；使一致（便于公平比较或统一使用）"},"examples":[{"en":"The company normalized job titles across all departments.","zh":"公司在所有部门统一了职位名称。"},{"en":"Researchers normalized the test scores to compare students from different schools.","zh":"研究人员对测试分数进行了标准化，以比较不同学校的学生。"}]},{"partOfSpeech":"v.","definition":{"en":"(technical) to reorganize data or measurements into a standard form; in databases, to structure tables to reduce repetition and improve accuracy","zh":"（技术）将数据/度量整理成标准形式；（数据库）通过规范化表结构减少重复并提高一致性"},"examples":[{"en":"We normalized the data before training the model.","zh":"在训练模型之前，我们先对数据进行了归一化/标准化处理。"},{"en":"The database was normalized to avoid storing the same information in multiple places.","zh":"数据库进行了规范化，避免在多个地方存储同一信息。"}]}],"synonyms":["standardize","regularize","stabilize","restore","bring back to normal"],"phonetic":"ˈnɔrməˌlaɪz","extraExplanation":["“normalize”常见搭配：normalize relations（关系正常化）、normalize behavior（使行为恢复常态）、normalize prices（价格回归正常/趋于稳定）、normalize data（数据归一化/标准化）。","在公共新闻语境里，“normalize”有时带有价值判断：把原本不应被接受的事情“变得看起来正常”（例如：Don’t normalize hate. 不要把仇恨当成正常）。这种用法更强调社会态度而不只是“恢复正常”。","近义词细微差别：standardize更强调“统一标准”；regularize偏“使更有规律/更合规”；stabilize偏“使稳定”；restore偏“恢复到原状”。"]}
{"word":"normalized","summary":{"en":"“Normalized” means made standard or brought back to a normal condition; it’s also the past form of “normalize.”","zh":"“normalized”指被标准化或恢复正常；也可作“normalize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Adjusted or changed to fit a standard, usual level, or common form.","zh":"被调整为符合标准、常态水平或常见形式的；标准化的；正常化的。"},"examples":[{"en":"After a few weeks, her sleep schedule became normalized again.","zh":"几周后，她的作息又恢复正常了。"},{"en":"The app shows normalized scores so you can compare different tests fairly.","zh":"这个应用显示标准化后的分数，方便你公平比较不同测试。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of “normalize”: to make something conform to a standard or to return it to a normal condition.","zh":"“normalize”的过去式/过去分词：使某事符合标准；使恢复正常。"},"examples":[{"en":"They normalized the data before training the model.","zh":"他们在训练模型前对数据做了标准化处理。"},{"en":"Relations between the two countries were normalized last year.","zh":"两国关系去年实现了正常化。"}]}],"synonyms":["standardized","regularized","adjusted","made consistent"],"phonetic":"/ˈnɔr.mə.laɪzd/","extraExplanation":["“normalized”常见于学术与职场语境，尤其是数据分析/机器学习里：把数值缩放到可比较的范围（例如0到1，或均值为0、标准差为1），以减少量纲差异带来的影响。","在数据库领域，“normalization（规范化/范式化）”指通过拆分表结构来减少冗余、避免更新异常；此时“normalized data/database”强调结构更合理。","英式拼法常见“normalised”，美式拼法为“normalized”。"]}
{"word":"normalizer","summary":{"en":"A normalizer is something (or someone) that makes things standard or consistent; in math it can be a scaling factor, and in audio it can even out volume levels.","zh":"normalizer 指使事物标准化/一致化的东西（或人）；在数学中可指缩放因子；在音频中可指让音量更均匀的功能或设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, tool, or process that makes something “normal” or standard (brings it to a usual level, form, or pattern)","zh":"使事物“规范化/标准化”的人、工具或过程（把它调整到常见的水平、形式或模式）"},"examples":[{"en":"In this software, the normalizer cleans up different date formats into one standard format.","zh":"在这个软件里，normalizer 会把不同的日期格式整理成一种统一的标准格式。"},{"en":"A normalizer can help make data from different sources easier to compare.","zh":"normalizer 可以让来自不同来源的数据更容易进行比较。"}]},{"partOfSpeech":"n.","definition":{"en":"a mathematical value (often a constant) used to scale numbers so they fit a chosen range or so totals become 1","zh":"（数学/统计）用于缩放数值的量（常为常数），使其落在指定范围内，或使总和变为 1"},"examples":[{"en":"To turn counts into probabilities, we divide by the normalizer so the values add up to 1.","zh":"要把计数变成概率，我们用 normalizer 去除，使这些数加起来等于 1。"},{"en":"The model includes a normalizer to keep the scores within a stable range.","zh":"该模型包含一个 normalizer，用来把分数保持在稳定的范围内。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or feature (especially in audio) that adjusts levels to make volume more consistent","zh":"（尤指音频）用于调整电平、让音量更一致的设备或功能"},"examples":[{"en":"Turn on the normalizer if the podcast volume keeps jumping up and down.","zh":"如果播客音量忽大忽小，可以打开 normalizer。"}]}],"synonyms":["standardizer","scaler","adjuster","equalizer"],"phonetic":"/ˈnɔrməˌlaɪzər/","extraExplanation":["“normalizer”来自动词 normalize（使……标准化/归一化）+ -er（表示“做这件事的人或物”）。在计算机与数据领域里，normalize 常译为“归一化/标准化”，目的是让不同量纲或范围的数据变得更可比、更稳定。","在机器学习里常见的 related terms 有：normalization（归一化）、standardization（标准化，常指减去均值再除以标准差）、Min–Max scaling（最小-最大缩放）。不同方法用途不同，但都在“让数值更可用、更可比”。"]}
{"word":"normalizes","summary":{"en":"“Normalizes” means makes something normal or standard; it can also mean scaling data to a common basis or returning a condition to normal levels.","zh":"“normalizes”表示使某事物正常化/标准化；也可指对数据进行（归一化/标准化）处理，或使身体指标恢复正常。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"makes something normal, usual, or acceptable; brings it back to a standard or typical condition","zh":"使某事物变得正常、常见或可接受；使其回到标准或典型状态"},"examples":[{"en":"The new rules normalize how people report expenses.","zh":"新规定把人们报销的方式规范化了。"},{"en":"After a few weeks, the routine normalizes his sleep schedule.","zh":"几周后，这个作息让他的睡眠时间恢复正常。"}]},{"partOfSpeech":"v.","definition":{"en":"(data/science) changes numbers or data so they can be fairly compared, often by putting them on the same scale","zh":"（数据/科学）将数值或数据调整到同一尺度上，以便公平比较（常见做法是缩放或标准化）"},"examples":[{"en":"The app normalizes the scores from different tests.","zh":"这个应用把不同测验的分数进行标准化处理。"},{"en":"She normalizes the data before training the model.","zh":"她在训练模型前先对数据做归一化/标准化。"}]},{"partOfSpeech":"v.","definition":{"en":"(medicine) returns a body condition or test result to normal levels","zh":"（医学）使身体状态或检测结果恢复到正常水平"},"examples":[{"en":"The treatment normalizes his blood pressure.","zh":"治疗使他的血压恢复正常。"}]}],"synonyms":["standardizes","regularizes","stabilizes","adjusts","brings back to normal"],"phonetic":"/ˈnɔrməˌlaɪz/","extraExplanation":["“normalizes”是动词“normalize”的第三人称单数（he/she/it normalizes）。过去式：normalized；动名词：normalizing；名词：normalization。","英式拼写常见为“normalises / normalisation”。美式通常用“normalize / normalization”。","在数据领域里，“normalize”有时特指“归一化”（把数值缩放到0到1等范围），也可能泛指“标准化”（例如按均值和标准差变换）。具体含义要看上下文。"]}
{"word":"normalizing","summary":{"en":"Normalizing means making something normal, standard, or comparable (especially in data), and it can also mean treating something as ordinary—sometimes criticized when the thing is harmful.","zh":"normalizing 指使某事恢复正常、标准化或（数据中）归一化；也可指把某事当成“很正常”，若对象有害时常带批评意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something return to a usual, healthy, or expected state; making it normal","zh":"使某事回到通常、健康或预期的状态；使其恢复正常"},"examples":[{"en":"The medicine is normalizing her blood pressure.","zh":"这种药正在使她的血压恢复正常。"},{"en":"It may take time for life to feel normalizing after a big change.","zh":"经历重大变化后，生活可能需要一段时间才会逐渐恢复常态。"}]},{"partOfSpeech":"v.","definition":{"en":"making something follow a standard form or rule; standardizing","zh":"使某事符合标准形式或规则；标准化"},"examples":[{"en":"The company is normalizing job titles across all departments.","zh":"公司正在统一各部门的职位名称（使其标准化）。"},{"en":"They are normalizing the spelling in the final version of the document.","zh":"他们正在对文档终稿的拼写进行统一规范。"}]},{"partOfSpeech":"v.","definition":{"en":"(data/math) changing values to a common scale so they can be compared more fairly","zh":"（数据/数学）把数值转换到统一尺度，以便更公平地比较"},"examples":[{"en":"We’re normalizing the data before training the model.","zh":"我们在训练模型前先对数据做归一化处理。"},{"en":"Normalizing prices by income can show the real cost differences between cities.","zh":"用收入对价格做归一化能更清楚地显示城市间真实的成本差异。"}]},{"partOfSpeech":"v.","definition":{"en":"making a behavior or idea seem ordinary or acceptable, sometimes in a harmful way","zh":"让某种行为或观念看起来“很正常/可接受”，有时带有负面含义"},"examples":[{"en":"We should avoid normalizing rude behavior in meetings.","zh":"我们应该避免在会议中把粗鲁的行为当成“正常”。"},{"en":"The film was criticized for normalizing violence.","zh":"这部电影因“将暴力正常化”而受到批评。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the process of making something normal or standard","zh":"与“使正常/标准化”的过程有关的"},"examples":[{"en":"A normalizing shampoo can help reduce excess oil over time.","zh":"平衡调理型洗发水可能会随着时间减少多余油脂。"}]}],"synonyms":["standardizing","regularizing","stabilizing","bringing back to normal","scaling (data)"],"phonetic":"/ˈnɔrməˌlaɪzɪŋ/","extraExplanation":["“normalizing”是动词normalize的现在分词/动名词形式，常见用法包括：\n1）恢复正常（身体指标、关系、生活秩序等）；\n2）标准化（统一格式、流程、命名）；\n3）数据领域的“归一化/规范化”（把不同量纲的数据拉到可比范围）；\n4）社会语境里“把某事说成很正常”（可能是在批评某种不良现象被习以为常）。","搭配提示：\n- normalize + condition/relationship/economy（使……恢复正常）\n- normalize + spelling/prices/job titles/procedures（使……标准化）\n- normalize + data/features（数据归一化）\n- normalize + violence/racism/rude behavior（常用于批评：将……正常化）"]}
{"word":"normally","summary":{"en":"“Normally” means “usually” or “in a normal/expected way,” often used to talk about routines or what is generally true.","zh":"“normally”表示“通常/一般来说”或“在正常状态下”，常用于描述日常规律或一般情况。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the usual or expected way; as happens most of the time.","zh":"通常地；一般情况下；按常规（多半时候会发生的方式）。"},"examples":[{"en":"I normally get up at 7 a.m.","zh":"我通常早上7点起床。"},{"en":"Normally, the store closes at 9, but today it closes at 7.","zh":"通常这家店9点关门，但今天7点关门。"},{"en":"Traffic is normally lighter on Sundays.","zh":"周日的交通通常更畅通。"}]},{"partOfSpeech":"adv.","definition":{"en":"In normal conditions; without problems or unusual changes.","zh":"在正常状态下；平稳地；没有异常地。"},"examples":[{"en":"The patient is breathing normally now.","zh":"病人现在呼吸正常。"},{"en":"If the engine is working normally, you shouldn’t hear that noise.","zh":"如果发动机运转正常，你不应该听到那种声音。"}]}],"synonyms":["usually","generally","typically","ordinarily","in general"],"phonetic":"/ˈnɔrməli/","extraExplanation":["“normally”常放在动词前（I normally go…），也常放句首用逗号隔开（Normally, …）来表达“按常理/一般来说”。","和“usually”很接近：usually更强调频率（经常），normally更强调“符合常态/常规”。在很多日常句子里两者可以互换。"]}
{"word":"normalness","summary":{"en":"Normalness means the quality of being normal; it’s understandable but less common than normality/normalcy.","zh":"normalness 指“正常性/正常的状态或程度”；能用但不如 normality 或 normalcy 常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being normal; how typical, ordinary, or expected something is.","zh":"正常性；正常的状态或程度；某事有多“常见/普通/符合预期”。"},"examples":[{"en":"After the crisis, the family slowly returned to a sense of normalness.","zh":"危机过后，这家人慢慢恢复了一种正常的感觉。"},{"en":"People argued about the normalness of working from home after the pandemic.","zh":"人们争论疫情后居家办公是否算“常态”。"}]}],"synonyms":["normality","normalcy","ordinariness","typicality"],"phonetic":"/ˈnɔɹməlnəs/","extraExplanation":["“normalness”在语法上没问题，但在实际英语里相对少见；更常用的是“normality”（更正式）或“normalcy”（在美式英语中较常见，语气稍口语/公共讨论中常见）。","在心理健康、社会学或公共政策等语境里，人们常用“a return to normality / normalcy”（回归常态）来表达“恢复正常生活/秩序”。"]}
{"word":"normals","summary":{"en":"“Normals” can mean typical/usual people or situations, or (in math/science) perpendicular lines/vectors called normals.","zh":"“Normals”可指一般人/常态的情况；也可指（数学/科学中的）与表面或曲线垂直的法线/法向量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or things that are considered typical or usual; what is normal in a place or situation","zh":"一般人；常态的事物（指被认为典型、通常的情况）"},"examples":[{"en":"After the crisis, everyone hoped life would return to the normals of work and school.","zh":"危机之后，大家都希望生活能回到工作和上学的常态。"},{"en":"The city has its own normals, so visitors may find some habits surprising.","zh":"这座城市有它自己的“常态”，所以游客可能会觉得一些习惯很意外。"}]},{"partOfSpeech":"n.","definition":{"en":"in math or science, lines or vectors that are perpendicular (at 90°) to a surface or curve","zh":"（数学/科学）法线；（向量）垂直于曲线或表面的直线/向量"},"examples":[{"en":"Draw normals to the circle to see where the radii point.","zh":"画出圆的法线，就能看出半径指向哪里。"},{"en":"In 3D graphics, correct lighting depends on accurate normals.","zh":"在3D图形中，正确的光照效果取决于准确的法线（法向量）。"}]}],"synonyms":["usual things","typical conditions","the status quo","ordinary people","perpendiculars (math)"],"phonetic":"/ˈnɔrməlz/","extraExplanation":["“normals”作为“常态/一般情况”时，常见于口语或写作中强调“各种日常惯例/常规做法”的复数表达。更常见的说法包括：the normal routine（正常的日常）、back to normal（恢复正常）、the new normal（新常态）。","在数学里 normal（法线）来自“normal = perpendicular（垂直的）”这一含义；在计算机图形学中，normal(s) 通常指“法向量”，用于决定表面朝向，从而影响明暗和反射。"]}
{"word":"Norman","summary":{"en":"Norman can mean “related to the medieval Normans,” “a Norman person,” or a male name.","zh":"Norman 可指“与中世纪诺曼人相关的”，也可指“诺曼人”，或作男子名“诺曼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Normans (people of Viking origin who settled in northern France) or to their culture, language, and architecture, especially in medieval England and France","zh":"与诺曼人（源于维京人的族群，定居在法国北部）或其文化、语言、建筑有关的，尤指中世纪的英格兰与法国"},"examples":[{"en":"Norman castles were built to control important towns after the conquest.","zh":"诺曼城堡在征服之后被修建，用来控制重要城镇。"},{"en":"Many English words came from Norman French.","zh":"许多英语词汇来自诺曼法语。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who belonged to the Norman people, especially in medieval France or England","zh":"诺曼人；尤指中世纪法国或英格兰的诺曼族群成员"},"examples":[{"en":"The Normans changed England’s government and land system.","zh":"诺曼人改变了英格兰的政府与土地制度。"},{"en":"He studied how the Normans mixed with local populations.","zh":"他研究了诺曼人如何与当地居民融合。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name","zh":"（男子）名：诺曼"},"examples":[{"en":"Norman is my grandfather’s name.","zh":"诺曼是我祖父的名字。"},{"en":"Norman walked in quietly and sat down.","zh":"诺曼悄悄走进来坐下。"}]}],"synonyms":["Norman-French","Norman style","Romanesque (related style)"],"phonetic":"/ˈnɔrmən/","extraExplanation":["“Norman”最常见的历史语境是 1066 年的“诺曼征服”（Norman Conquest）：诺曼底公爵威廉（William the Conqueror）征服英格兰。此后，上层社会大量使用诺曼法语，深刻影响了英语词汇与法律、行政用语。","在建筑上常见“诺曼式”（Norman style），属于早期罗曼式风格的一种，特点包括厚重墙体、半圆拱门、巨大的石柱等。"]}
{"word":"norman","summary":{"en":"Norman means ‘related to the Normans or Normandy,’ or ‘a person from the Norman people’; it is also used as a male name.","zh":"Norman 指“与诺曼人或诺曼底有关”，也可指“诺曼人”；同时也是男性名字“诺曼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Normans (a people of Viking origin who settled in northern France) or to Normandy in France","zh":"（形容词）与诺曼人（源自维京人的民族）或法国诺曼底地区有关的"},"examples":[{"en":"Norman architecture is known for thick walls and rounded arches.","zh":"诺曼式建筑以厚墙和半圆拱门著称。"},{"en":"They visited a Norman village in Normandy.","zh":"他们参观了诺曼底的一座诺曼风格村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Norman people, especially in medieval Europe","zh":"（名词）诺曼人；尤指中世纪欧洲的诺曼民族成员"},"examples":[{"en":"The Normans changed English history after 1066.","zh":"1066年之后，诺曼人改变了英国历史。"},{"en":"Many Normans became rulers in England and parts of Europe.","zh":"许多诺曼人在英格兰和欧洲部分地区成为统治者。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name","zh":"（名词）男性名字：诺曼"},"examples":[{"en":"Norman is my grandfather’s name.","zh":"诺曼是我祖父的名字。"}]}],"synonyms":["Normandy (related place)","Norman-French (historical variety)","Romanesque (often related in architecture context)"],"phonetic":"/ˈnɔrmən/","extraExplanation":["“Norman”最常见的文化背景是“诺曼征服”（Norman Conquest）：1066年，诺曼底公爵威廉（William the Conqueror）征服英格兰。这次事件深刻影响了英国的贵族制度、法律体系与英语词汇（许多与政府、法律、饮食相关的法语/拉丁语词进入英语）。","在艺术与建筑中，“Norman architecture（诺曼式/罗曼式早期）”常与城堡、教堂相关，特征包括厚重结构、半圆拱与大型塔楼。"]}
{"word":"Norman's","summary":{"en":"“Norman’s” usually means “belonging to Norman” or is used as a name/title connected with someone or something called Norman.","zh":"“Norman’s”通常表示“Norman 的……”，也可用于与名为 Norman 的人/事物相关的名称或标题。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"The possessive form of the name “Norman,” meaning something belongs to or is connected with a person named Norman.","zh":"名字“Norman”的所有格形式，表示“Norman 的……”，即某物属于或与名叫 Norman 的人有关。"},"examples":[{"en":"This is Norman’s jacket.","zh":"这是 Norman 的夹克。"},{"en":"I’m meeting Norman’s sister after class.","zh":"我下课后要见 Norman 的姐姐。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes used in titles or place/business names to show association (e.g., a shop owned by Norman, or a location named after Norman).","zh":"有时用于标题、地名或商号名称中，表示与 Norman 有关联（如 Norman 开的店，或以 Norman 命名的地点）。"},"examples":[{"en":"Let’s eat at Norman’s—it’s a small Italian restaurant.","zh":"我们去 Norman’s 吃吧——那是一家小意大利餐馆。"},{"en":"They stayed near Norman’s Beach for the weekend.","zh":"他们周末住在 Norman’s Beach 附近。"}]}],"synonyms":["Norman’s (possessive of Norman)"],"phonetic":"/ˈnɔrmənz/","extraExplanation":["“Norman’s”里的撇号（’）通常表示所有格：Norman + ’s。常见规则：单数名词一般加 ’s（Norman’s）；复数以 -s 结尾时常只加 ’（the teachers’ room 老师们的办公室）。在店名/餐馆名中（如 Norman’s），常是省略了“Norman’s restaurant/shop”的后半部分。"]}
{"word":"normandy","summary":{"en":"Normandy is a region in northwestern France; it is also widely known as the location of the 1944 D-Day landings in World War II.","zh":"Normandy 指法国西北部的诺曼底地区；在二战语境中也常指1944年“D日”诺曼底登陆发生地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in northwestern France on the English Channel, known for its history, coastline, and cultural identity","zh":"（法国）诺曼底：位于法国西北部、濒临英吉利海峡的一个地区，以其历史、海岸风光与地域文化闻名"},"examples":[{"en":"Normandy is famous for its cliffs and seaside towns.","zh":"诺曼底以悬崖海岸和海滨小镇闻名。"},{"en":"She visited Normandy to see Mont Saint-Michel and the countryside.","zh":"她去诺曼底参观圣米歇尔山和周边乡村。"}]},{"partOfSpeech":"n.","definition":{"en":"the site of the 1944 Allied landings in World War II (D-Day), often mentioned when talking about major turning points in the war","zh":"（二战语境）诺曼底登陆地区：指1944年盟军“D日”登陆的地点，常用于谈论二战的重要转折点"},"examples":[{"en":"Many people travel to Normandy to visit the D-Day beaches.","zh":"很多人去诺曼底参观“D日”登陆海滩。"},{"en":"The documentary explained why Normandy mattered in 1944.","zh":"纪录片解释了诺曼底在1944年的重要性。"}]}],"synonyms":["Normandie","the D-Day beaches (contextual)","the Normandy landings (contextual)"],"phonetic":"/ˈnɔrməndi/","extraExplanation":["“Normandy”来自“Norman”（诺曼人）：中世纪来自北欧、在法国定居的一支人群。诺曼底也因此与英法历史联系紧密，例如1066年诺曼征服英格兰（William the Conqueror）。","英语里谈到二战时常见搭配有：the Normandy landings（诺曼底登陆）、the Battle of Normandy（诺曼底战役）、the D-Day beaches（D日海滩）。"]}
{"word":"normanesque","summary":{"en":"Normanesque means “in the style of the Normans,” especially describing Norman (Romanesque) architecture with heavy stonework and round arches.","zh":"Normanesque 指“带有诺曼风格的”，尤指诺曼（罗曼式体系）建筑的厚重石作与半圆拱特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Normans (a medieval people who ruled parts of Europe, especially England after 1066), or to their culture and style—most often used for their Romanesque-style architecture (e.g., thick walls, round arches).","zh":"与诺曼人（中世纪民族，尤其在1066年后统治英格兰）及其文化风格有关的；最常用于指诺曼式（罗曼式体系下的诺曼风格）建筑，例如厚墙、半圆拱。"},"examples":[{"en":"The cathedral’s massive pillars and round arches give it a Norman-esque feel.","zh":"这座大教堂粗壮的柱子和半圆拱让它有一种诺曼式的感觉。"},{"en":"They restored the castle in a Norman-esque style to match the original stonework.","zh":"他们用接近诺曼式的风格修复了城堡，以贴合原有的石作。"}]}],"synonyms":["Norman","Norman-style","Romanesque (in architecture)"],"phonetic":"/ˌnɔr.məˈnɛsk/","extraExplanation":["“Normanesque”不算特别常见，更常见的写法是“Norman”或“Normanesque/Norman-style（诺曼风格的）”。在建筑语境中，它通常指英格兰诺曼征服（1066）后流行的罗曼式建筑特征：厚重石墙、半圆拱门、拱廊与相对较小的窗。","注意拼写：有时会见到带连字符的“Norman-esque”。“-esque”表示“……风格的/带有……味道的”，可用于艺术、文学或外观风格（如“Kafkaesque”“picturesque”）。"]}
{"word":"normanish","summary":{"en":"Normanish means “related to the Normans or showing Norman style,” and rarely can refer to Norman French.","zh":"Normanish 指“与诺曼人/诺曼风格有关”，少数情况下也可指“诺曼法语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Normans (a medieval people of Northern French origin) or to Norman culture, especially in medieval England and France; Norman-like.","zh":"与诺曼人（中世纪起源于法国北部的族群）或诺曼文化有关的；带有诺曼风格的。"},"examples":[{"en":"Many castles in England have Normanish features, like thick stone walls and round arches.","zh":"英格兰许多城堡都有诺曼风格的特征，比如厚重的石墙和半圆拱门。"},{"en":"The church’s Normanish doorway is one of the oldest parts of the building.","zh":"这座教堂的诺曼式门廊是建筑中最古老的部分之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The Norman variety of French; Norman French.","zh":"（罕用）诺曼地区的法语变体；诺曼法语。"},"examples":[{"en":"Some legal terms entered English through Normanish after 1066.","zh":"一些法律术语在1066年之后通过诺曼法语进入英语。"}]}],"synonyms":["Norman","Norman-style","Norman French (for the language sense)"],"phonetic":"/ˈnɔrmənɪʃ/","extraExplanation":["“Normanish”并不是最常见的标准词形；更常见的是“Norman”（诺曼的）或“Norman French”（诺曼法语）。如果你在书里看到“Normanish”，通常是在强调“带有诺曼风格/气息”，或用作较文学化、较少见的表达。","诺曼人因1066年的“诺曼征服”（Norman Conquest）深刻影响了英语：大量法语来源词汇进入英语，尤其在法律、政府、贵族生活等领域。"]}
{"word":"normanism","summary":{"en":"Normanism means a Norman-French-derived feature in language (especially English) or, more broadly, Norman influence in culture and history.","zh":"Normanism 指（尤指英语中）源自诺曼法语的语言特征；也可泛指诺曼人在文化与历史上的影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word, expression, or feature (especially in English) that comes from Norman French or shows Norman influence","zh":"（尤指英语中）源自诺曼法语或带有诺曼人影响的词语、表达方式或语言特征"},"examples":[{"en":"Many legal terms in English are sometimes described as Normanisms because they entered the language through Norman French.","zh":"英语中的许多法律术语有时被称为“诺曼主义（Normanisms）”，因为它们通过诺曼法语进入英语。"},{"en":"The historian pointed out several Normanisms in the document’s spelling and vocabulary.","zh":"历史学家指出这份文件在拼写和词汇上有几处诺曼语影响的特征。"}]},{"partOfSpeech":"n.","definition":{"en":"the qualities, customs, or political influence associated with the Normans","zh":"与诺曼人相关的特质、习俗或政治影响（诺曼风格/诺曼影响）"},"examples":[{"en":"Some writers criticized Normanism as a symbol of foreign rule after the conquest.","zh":"一些作者批评“诺曼影响（Normanism）”，把它视为征服之后外来统治的象征。"}]}],"synonyms":["Norman French influence","Norman French loanword","Gallicism (broader)"],"phonetic":"/ˈnɔrməˌnɪzəm/","extraExplanation":["“Normanism”常见于语言学与历史写作中，最典型的背景是1066年诺曼征服之后：诺曼法语在英国上层社会与法律、行政领域占主导地位，影响了英语词汇与书写传统。","在语言学语境里，Normanism 常可理解为“诺曼法语来源/诺曼语影响的用法”，与更宽泛的“French loanword（法语借词）”不同，它强调“诺曼法语这一支”以及征服后英国社会的历史条件。","该词较学术、较少用于日常口语；常在讨论中古英语、法律英语、或英国史时出现。"]}
{"word":"normanist","summary":{"en":"A Normanist is usually a specialist in Norman history or the Norman language; less commonly, it can mean someone who favors the Norman viewpoint in medieval-history debates.","zh":"Normanist 通常指研究诺曼历史或诺曼语言的学者；较少情况下也可指在中世纪史争论中偏向诺曼观点的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies or specializes in the Normans, Norman history, or Norman language (including Norman French).","zh":"研究诺曼人、诺曼历史或诺曼语（包括诺曼法语）的学者；诺曼研究者。"},"examples":[{"en":"The Normanist explained how Norman French shaped many English legal terms.","zh":"这位诺曼研究者解释了诺曼法语如何影响了许多英语法律术语。"},{"en":"As a Normanist, she focuses on texts from the 11th and 12th centuries.","zh":"作为一名诺曼研究者，她专注于11至12世纪的文本。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone who supports or emphasizes the Norman side in debates about medieval English history (less common).","zh":"在关于中世纪英国历史的讨论中倾向支持或强调“诺曼一方”的人（较少用）。"},"examples":[{"en":"In the classroom debate, he was labeled a Normanist for defending the Norman administration reforms.","zh":"在课堂辩论中，他因替诺曼人的行政改革辩护而被称为“诺曼派”。"}]}],"synonyms":["specialist","historian","medievalist"],"phonetic":"/ˈnɔrmənɪst/","extraExplanation":["“Normanist”多见于学术语境（历史学、语言学、中世纪研究）。它常与1066年“诺曼征服”相关：征服后，统治阶层使用的诺曼法语对英语词汇影响很大，尤其在法律、政治与行政领域（如 court, judge, government 等许多词都与法语渊源有关）。","与“Norman”不同：Norman 指“诺曼人/诺曼的”；Normanist 则是“研究诺曼的人”或“持诺曼立场的人”。"]}
{"word":"normanization","summary":{"en":"Normalization means making something normal or standard; it’s also commonly used for scaling data or restoring normal diplomatic relations.","zh":"Normalization 指“正常化/标准化”的过程；也常用于“数据归一化（或标准化）”以及“外交关系正常化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making something normal, regular, or acceptable; bringing it back to a usual or standard condition.","zh":"使某事变得正常、规律或可接受的过程；使其回到通常或标准状态。"},"examples":[{"en":"After the crisis, the government focused on the normalization of daily life.","zh":"危机过后，政府把重点放在日常生活的正常化上。"},{"en":"It took time for relationships to return to normalization after the conflict.","zh":"冲突之后，人际关系花了一段时间才恢复正常。"}]},{"partOfSpeech":"n.","definition":{"en":"In data and statistics, the process of adjusting values to a common scale so they can be compared more fairly.","zh":"在数据与统计中，把数值调整到同一尺度以便更公平比较的过程（数据归一化/标准化，视语境而定）。"},"examples":[{"en":"We used normalization to scale the scores between 0 and 1.","zh":"我们用归一化把分数缩放到 0 到 1 之间。"},{"en":"Without normalization, one large feature can dominate the model.","zh":"如果不做归一化，某个数值很大的特征可能会主导模型。"}]},{"partOfSpeech":"n.","definition":{"en":"In politics and diplomacy, the act of establishing or restoring normal relations between countries.","zh":"在政治与外交中，建立或恢复国家之间正常关系的行为（关系正常化）。"},"examples":[{"en":"The two countries announced the normalization of diplomatic relations.","zh":"两国宣布外交关系正常化。"}]}],"synonyms":["standardization","regularization","stabilization","scaling","adjustment"],"phonetic":"/ˌnɔrməlaɪˈzeɪʃən/","extraExplanation":["你输入的“normanization”通常是拼写错误，标准拼法是 normalization（词根 normal + 后缀 -ize + 名词后缀 -ation）。","在技术语境里 normalization 有时会被译为“归一化”或“标准化”，具体取决于方法：把值缩放到固定范围常叫“归一化”，让数据变成均值为 0、方差为 1 常叫“标准化”。"]}
{"word":"normanize","summary":{"en":"Normalize means to make something normal or standard; it can also mean standardizing data for comparison.","zh":"Normalize 意为使恢复正常或标准化；也可指对数据进行归一化/标准化以便比较。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something normal again, or to make it fit a usual or standard condition","zh":"使恢复正常；使符合通常/标准状态"},"examples":[{"en":"After a few weeks, life began to normalize after the storm.","zh":"几周后，暴风雨过后的生活开始逐渐恢复正常。"},{"en":"The new policy aims to normalize relations between the two countries.","zh":"新政策旨在使两国关系正常化。"}]},{"partOfSpeech":"v.","definition":{"en":"to standardize data or values so they can be fairly compared (common in math, statistics, and computing)","zh":"（数理统计/计算机）对数据进行归一化/标准化，以便公平比较"},"examples":[{"en":"We normalized the test scores to compare students from different schools.","zh":"我们对考试成绩做了标准化处理，以比较来自不同学校的学生。"},{"en":"Normalize the image brightness before running the model.","zh":"在运行模型前先对图像亮度进行归一化处理。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a behavior or idea seem ordinary and accepted in society","zh":"使（行为/观念）在社会中变得司空见惯并被接受"},"examples":[{"en":"The show normalized talking openly about mental health.","zh":"这部剧让公开谈论心理健康变得更常见、更被接受。"},{"en":"We should be careful not to normalize rude behavior.","zh":"我们应当注意不要让粗鲁的行为变得“正常化”。"}]}],"synonyms":["standardize","regularize","stabilize","restore","normalize relations (phrase)"],"phonetic":"ˈnɔrməˌlaɪz","extraExplanation":["你输入的 **normanize** 通常是拼写错误；正确拼写是 **normalize**（英式拼写：**normalise**）。","词源提示：来自 *normal*（正常的）+ *-ize*（使……成为）。在日常英语里常用于“恢复正常/关系正常化”；在数据领域里常指“归一化/标准化”。"]}
{"word":"normanizer","summary":{"en":"A normalizer is a person, tool, or method that makes something standard—often by adjusting data into a consistent form or range.","zh":"normalizer 指把事物变得更标准/一致的工具、方法或人；在技术领域常指对数据进行“归一化/规范化”的模块或函数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that makes something normal or standard (brings it into a usual, expected, or comparable form)","zh":"使某事物变得正常或标准的人或事物；使之符合常规/便于比较的东西"},"examples":[{"en":"In this process, the normalizer makes the data easier to compare across different users.","zh":"在这个过程中，归一化器（normalizer）让数据更容易在不同用户之间进行比较。"},{"en":"A good normalizer can reduce noisy differences in audio recordings.","zh":"好的归一化器可以减少音频录音中的噪声差异。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing / machine learning / statistics) a method, tool, or function that rescales or adjusts values to a standard range or distribution","zh":"（计算机/机器学习/统计）把数值缩放或调整到某个标准范围/分布的方法、工具或函数（常译“归一化器/规范化器”）"},"examples":[{"en":"We applied a normalizer so every feature stays between 0 and 1.","zh":"我们使用了归一化器，让每个特征都保持在 0 到 1 之间。"},{"en":"The text normalizer turns “I’m” into “I am” for consistent analysis.","zh":"文本规范化器会把 “I’m” 变成 “I am”，以便分析更一致。"},{"en":"Before training the model, choose a normalizer that matches your data.","zh":"在训练模型之前，选择一个与数据匹配的归一化器。"}]}],"synonyms":["standardizer","scaler","formatter"],"phonetic":"/ˈnɔrməˌlaɪzər/","extraExplanation":["你输入的 **normanizer** 一般被认为是拼写错误；更常见的正确拼写是 **normalizer**（来自动词 normalize“使规范化/归一化”）。","在技术语境里，normalizer 常指“对数据做归一化/规范化的模块或函数”；在日常语境里也可泛指“让事情回到正常状态的因素/人”。","相关词：**normalize**（v. 规范化/归一化），**normalization**（n. 规范化/归一化），**standardize**（v. 标准化，强调统一标准）。"]}
{"word":"normanly","summary":{"en":"Normally means “usually” or “in the normal/expected way.”","zh":"Normally 表示“通常”或“以正常/符合预期的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a usual, typical, or expected way; under ordinary conditions.","zh":"通常地；一般情况下；按常理"},"examples":[{"en":"Normally, I take the subway to work.","zh":"我通常坐地铁去上班。"},{"en":"The baby normally sleeps for about two hours in the afternoon.","zh":"宝宝下午通常睡大约两小时。"},{"en":"Normally, the store closes at 9 p.m., but today it closes early.","zh":"这家店通常晚上9点关门，但今天提前关门。"}]},{"partOfSpeech":"adv.","definition":{"en":"According to what is considered standard or healthy; in a normal state.","zh":"正常地；处于正常状态"},"examples":[{"en":"After a few days of rest, she was breathing normally again.","zh":"休息几天后，她又能正常呼吸了。"},{"en":"If the machine is working normally, the light stays green.","zh":"如果机器正常运行，灯会一直是绿色的。"}]}],"synonyms":["usually","generally","typically","ordinarily","commonly"],"phonetic":"/ˈnɔrməli/","extraExplanation":["你输入的 **normanly** 常见为拼写错误，正确拼写是 **normally**。可以记成：**normal + -ly**（形容词 normal 加上副词后缀 -ly）。"]}
{"word":"normannic","summary":{"en":"“Normannic” is a rare adjective meaning “Norman; related to the Normans or Normandy.”","zh":"“Normannic”是较少见的形容词，意思是“诺曼的；与诺曼人或诺曼底相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Normans (the people of Normandy) or to Norman culture, language, or history; Norman.","zh":"与诺曼人（法国诺曼底的人）或诺曼文化、语言、历史有关的；诺曼的。"},"examples":[{"en":"The castle shows strong Normannic influence in its thick walls and rounded arches.","zh":"这座城堡的厚墙和圆拱显示出明显的诺曼式影响。"},{"en":"Some writers use “Normannic” to describe the period after the Norman Conquest of England.","zh":"有些作者用“Normannic”来描述英格兰诺曼征服之后的时期。"}]}],"synonyms":["Norman","Normanic (rare)"],"phonetic":"/nɔrˈmænɪk/","extraExplanation":["“Normannic”在现代英语里非常少见，更常见、更自然的说法是“Norman”（诺曼的）。在学术或文学性文本中偶尔会看到“Normannic”，用来强调“诺曼人/诺曼文化”这一历史背景。","历史语境里常与1066年的“The Norman Conquest（诺曼征服）”相关；讨论建筑风格（如诺曼式罗马风）、中世纪英格兰政治与语言变迁时可能出现。"]}
{"word":"Normans","summary":{"en":"Normans: people from Normandy, especially the Viking-descended group who conquered England in 1066 and influenced English language and culture.","zh":"Normans：诺曼人；指诺曼底地区的人，尤指维京后裔的诺曼人，他们在1066年征服英格兰并深刻影响英语与文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the people from Normandy (a region in northern France), especially the descendants of Viking settlers who became French-speaking and later conquered England in 1066","zh":"诺曼人（法国北部诺曼底地区的人），尤指早期维京定居者的后裔；他们后来改用法语，并在1066年征服英格兰"},"examples":[{"en":"The Normans conquered England in 1066 after the Battle of Hastings.","zh":"诺曼人在黑斯廷斯战役后于1066年征服了英格兰。"},{"en":"Many English words related to law and government came from the Normans’ French influence.","zh":"许多与法律和政府相关的英语词汇来自诺曼人带来的法语影响。"},{"en":"Norman castles and churches can still be seen across parts of Britain.","zh":"在英国一些地区至今仍能看到诺曼式的城堡和教堂。"}]}],"synonyms":["the Norman people","people of Normandy"],"phonetic":"/ˈnɔrmənz/","extraExplanation":["“Normans”常用于历史语境，尤其指“诺曼征服”（Norman Conquest）。1066年后，诺曼统治阶层使用的诺曼法语对英语影响很大，使英语在很长一段时间里出现“上层用法语、民间用英语”的社会语言分层。","文化与建筑上常见“Norman architecture / Norman style（诺曼式建筑）”，典型特征包括厚重石墙、半圆拱门等。","词源上，“Norman”与“northman（北方人）”有关，反映其早期与北欧维京人的联系。"]}
{"word":"normans","summary":{"en":"Normans are the people of Normandy, especially the medieval group who conquered England in 1066; the word can also mean “related to the Normans/Normandy.”","zh":"Normans 指诺曼人（尤指1066年征服英格兰的中世纪诺曼人），也可作形容词表示“诺曼人的/诺曼底的（或诺曼式的）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the people from Normandy (in northern France), especially the medieval group descended from Vikings who settled there and later ruled parts of England, France, and Italy","zh":"诺曼人：来自法国北部诺曼底的人，尤指中世纪定居诺曼底、源自维京人的族群，后来在英格兰、法国和意大利等地建立统治"},"examples":[{"en":"The Normans conquered England in 1066.","zh":"诺曼人在1066年征服了英格兰。"},{"en":"After the invasion, the Normans built many stone castles.","zh":"入侵之后，诺曼人修建了许多石头城堡。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Normans or to Normandy; also describing a style of medieval architecture connected to them","zh":"诺曼人的；诺曼底的；（也可指）与诺曼人相关的中世纪建筑风格的"},"examples":[{"en":"You can see a Norman church with thick walls and round arches.","zh":"你可以看到一座诺曼式教堂，墙体厚重，拱门多为圆拱。"},{"en":"Norman French influenced many English words.","zh":"诺曼法语影响了许多英语词汇。"}]}],"synonyms":["the Norman people","people of Normandy"],"phonetic":"/ˈnɔrmənz/","extraExplanation":["“Normans”是“Norman”的复数形式。词源上与“Northman（北方人）”有关，指来自北方的维京人后裔在诺曼底定居并逐渐法语化、封建化。","1066年的“诺曼征服”对英国历史影响很大：带来新的统治阶层、法律与土地制度，也让英语吸收了大量法语词汇（尤其与政府、法律、贵族生活相关）。","文学与文化中常见的相关作品/主题包括《贝叶挂毯》（Bayeux Tapestry，记录征服故事）以及关于威廉一世（William the Conqueror）的历史叙述。"]}
{"word":"normated","summary":{"en":"“Normated” means standardized or made to follow a norm; it’s a rare term, often replaced by “standardized” or “normalized.”","zh":"“normated”表示“标准化的/按规范处理的”，较少见，通常可用“standardized”或“normalized”替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) standardized; made to follow a norm or agreed standard.","zh":"（较少见）标准化的；按规范或公认标准处理过的。"},"examples":[{"en":"The measurements were normated to allow a fair comparison between groups.","zh":"这些测量值经过标准化处理，以便在不同组之间公平比较。"},{"en":"Use the normated format when submitting data to the database.","zh":"向数据库提交数据时，请使用标准化的格式。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something conform to a norm or standard; to standardize/normalize.","zh":"使……符合规范或标准；使标准化/归一化。"},"examples":[{"en":"Engineers normated the parts so replacements would fit across models.","zh":"工程师把零件标准化，这样不同型号之间也能通用替换件。"},{"en":"We normated the scores by converting them to z-scores.","zh":"我们通过把分数转换为 Z 分数来进行标准化处理。"}]}],"synonyms":["standardized","normalized","regularized","harmonized"],"phonetic":"/ˈnɔrmeɪtɪd/","extraExplanation":["“normated”在现代英语里不太常见，更多见于技术写作或受德语/欧陆工程语境影响的文本；日常与学术英语中通常更常用“standardized”（标准化）或“normalized”（归一化/标准化，统计与数据处理中尤常见）。","如果你是在机械/工程领域看到它，它常对应德语“normiert”（按DIN/ISO等标准化）；在数据分析里则常接近“normalized/standardized”的含义，需结合上下文判断是“统一标准”还是“数值归一/标准分数化”。"]}
{"word":"normative","summary":{"en":"Normative means based on accepted standards or norms, often implying what is expected or what people should do.","zh":"Normative 指基于社会或群体的规范与标准，常含“被期待/应该如此”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Based on a standard, rule, or generally accepted expectation; describing what is considered “normal” or “proper” in a group or society.","zh":"基于标准、规则或普遍认可的期待；描述在某个群体或社会中被认为“正常/合宜”的东西。"},"examples":[{"en":"In many workplaces, it’s normative to reply to emails within a day.","zh":"在许多职场里，一天内回复邮件是一种常见且被期待的做法。"},{"en":"The study describes normative behavior, not necessarily what everyone actually does.","zh":"这项研究描述的是“规范性”的行为，不一定是每个人真实会做的事。"}]},{"partOfSpeech":"adj.","definition":{"en":"In philosophy, law, or social science: relating to norms—judgments about what people should do, what is right, or what ought to be allowed.","zh":"在哲学、法律或社会科学中：与“规范/价值判断”有关；讨论人们应该怎么做、什么是正确的、什么是应当被允许的。"},"examples":[{"en":"The report makes normative claims about fairness in education.","zh":"这份报告提出了关于教育公平的规范性主张。"},{"en":"Economics often separates normative questions (what should be) from positive questions (what is).","zh":"经济学常把规范性问题（应该怎样）与实证性问题（事实怎样）区分开来。"}]}],"synonyms":["standard","conventional","typical","expected","prescriptive"],"phonetic":"/ˈnɔrmətɪv/","extraExplanation":["“Normative”常见搭配：normative standards（规范性标准）、normative behavior（规范性行为）、normative statement（规范性陈述）、normative ethics（规范伦理学）。","学习时注意区分：normative（应当/合宜，带价值判断） vs. descriptive（描述性的，只陈述事实） vs. positive（实证的、可检验的）。","在社会文化语境中，“normative”有时暗含“主流标准”或“被默认的标准”，可能忽略少数群体经验；写作时可更具体说明“whose norms（谁的规范）”。"]}
{"word":"normatively","summary":{"en":"“Normatively” means ‘according to norms or ideals (how things should be).’","zh":"“normatively”表示“从规范/价值判断出发（强调事情应该怎样）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is based on norms (social rules) or on what is considered how things should be, rather than just how they are","zh":"以规范/常规为依据地；以“应该如何”而非“实际如何”为依据地"},"examples":[{"en":"Normatively, schools should be safe places for every student.","zh":"从规范角度来说，学校应该是每个学生都安全的地方。"},{"en":"The report argues normatively that governments ought to protect basic rights.","zh":"这份报告从规范立场主张：政府应当保护基本权利。"}]}],"synonyms":["ideally","in principle","from a normative standpoint","prescriptively"],"phonetic":"/ˈnɔrmətɪvli/","extraExplanation":["“Normatively”常见于学术写作（政治学、哲学、社会学、法学、经济学）。它通常对比“descriptively（描述性地）”：descriptively讲“现实是什么样”，normatively讲“应该是什么样/什么更正当”。","常见搭配：normatively speaking（从规范角度说）、normatively desirable/important（在规范意义上可取/重要）、normatively justified（在规范意义上有正当性）。"]}
{"word":"normativeness","summary":{"en":"Normativeness means the quality or degree of being based on norms—judging what is proper, required, or recommended.","zh":"Normativeness 指“规范性/应然性”：基于规范来判断什么是合适、必须或值得提倡的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being normative: relating to standards, rules, or judgments about what people *should* do or what is considered “proper.”","zh":"规范性：与标准、规则或“应该如何做/什么才算合适”的判断有关的性质。"},"examples":[{"en":"In ethics, normativeness is about what we should do, not just what people actually do.","zh":"在伦理学中，规范性讨论的是我们应该怎么做，而不只是人们实际上怎么做。"},{"en":"Some style guides value normativeness, while others prefer descriptive rules based on real usage.","zh":"一些写作/语法指南强调规范性，而另一些更偏好基于真实用法的描述性规则。"}]},{"partOfSpeech":"n.","definition":{"en":"In academic writing, the degree to which a statement expresses evaluation, obligation, or recommendation (e.g., “good/bad,” “must/should”).","zh":"（学术语境）指一个陈述表达评价、义务或建议的程度（如“好/坏”“必须/应该”）。"},"examples":[{"en":"The paper’s normativeness appears in its claim that governments should regulate the industry.","zh":"这篇论文的规范性体现在它主张政府应该监管该行业。"},{"en":"To reduce normativeness, the author rewrote ‘Students must…’ as ‘Students often…’.","zh":"为了降低规范性，作者把“学生必须……”改写为“学生经常……”。"}]}],"synonyms":["normativity","prescriptiveness","normative character","evaluativeness"],"phonetic":"/ˈnɔrmətɪvnəs/","extraExplanation":["“normativeness”常见于哲学（尤其伦理学、政治哲学）、语言学与社会科学写作中。它与“descriptiveness（描述性）”经常成对出现：描述性关注“事实是什么”，规范性关注“应该怎样”。","构词：norm（规范/标准）+ -ative（……性质的）→ normative（规范性的）+ -ness（名词后缀）→ normativeness（规范性）。"]}
{"word":"normed","summary":{"en":"“Normed” means standardized/adjusted to a norm; it’s also the past form of “norm” (to standardize).","zh":"“Normed”表示“按常模/标准进行标准化或调整的”；也可作动词“norm”的过去式/过去分词（使标准化）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"standardized or adjusted according to a norm (a typical standard), so results can be compared fairly","zh":"按“常模/标准”进行标准化或调整的（便于公平比较）"},"examples":[{"en":"The test uses normed scores to compare students of the same age.","zh":"这项测验使用常模化（标准化）分数来比较同龄学生。"},{"en":"After the data were normed, we could compare different groups more reliably.","zh":"数据常模化之后，我们就能更可靠地比较不同群体。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “norm”: to set a standard for something or to normalize it to a norm","zh":"“norm”的过去式/过去分词：为某事设定标准，或把某事按常模进行规范/标准化处理"},"examples":[{"en":"We normed the raw scores against a national sample.","zh":"我们用全国样本作为参照，对原始分数进行了常模化。"},{"en":"The company normed its performance reviews to reduce bias.","zh":"公司将绩效评估标准化，以减少偏差。"}]}],"synonyms":["standardized","normalized","benchmarked","scaled"],"phonetic":"/nɔrmd/","extraExplanation":["“normed”在教育测评、心理学与统计中很常见，例如“normed score（常模化分数）”。它强调“拿一组参考人群当作基准”，把原始分数转换成更容易比较的分数（如百分位、标准分等）。","日常英语里更常用的说法往往是“standardized”或“normalized”；“normed”听起来更学术、更偏专业场景。"]}
{"word":"normis","summary":{"en":"“Normis” is most likely a misspelling of “normies,” meaning mainstream/“ordinary” people (slang, often online).","zh":"“normis”很可能是“normies”的误拼，意思是“主流/普通人”（网络俚语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, usually plural “normies”) a person seen as “normal” or mainstream, especially someone not deeply involved in a particular subculture (often used jokingly or dismissively online).","zh":"（俚语，常用复数 normies）指被认为“很普通/主流”的人，尤其是不太深入某个亚文化圈的人（网络上常带调侃或轻蔑语气）。"},"examples":[{"en":"This meme is so niche that most normies won’t get it.","zh":"这个梗太小众了，大多数“主流人群”看不懂。"},{"en":"He used to call everyone a normie, but now he realizes that sounds rude.","zh":"他以前总叫别人 normie，但现在意识到这样听起来挺不礼貌的。"},{"en":"That game is popular with both hardcore fans and normies.","zh":"那个游戏既受硬核粉丝欢迎，也很受普通玩家欢迎。"}]}],"synonyms":["mainstream people","average people","regular people","outsiders (in a subculture context)"],"phonetic":"/ˈnɔrmi/","extraExplanation":["“Normie”常见于网络文化（如论坛、社媒、梗圈），用于把“圈内人/懂梗的人”与“圈外的主流大众”区分开来。语气有时是自嘲或玩笑，但也可能带有排他或嘲讽意味；在正式场合不建议使用。","你输入的“normis”更像是“normies”的误拼/变体写法；最常见拼写是 normie（单数）/ normies（复数）。"]}
{"word":"normless","summary":{"en":"“Normless” means lacking shared norms or standards.","zh":"“normless”指缺乏共同的规范或标准。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without norms; not guided by shared rules, standards, or typical expectations.","zh":"没有规范的；不受共同规则、标准或一般期待约束的。"},"examples":[{"en":"In a normless environment, people may feel unsure about what behavior is acceptable.","zh":"在一个缺乏规范的环境里，人们可能会不确定什么行为是可以接受的。"},{"en":"The critic described the artwork as powerful but normless, refusing to follow any traditional style.","zh":"评论家形容这件作品很有力量，但不守常规，拒绝遵循任何传统风格。"}]}],"synonyms":["anomic","ruleless","unregulated","unstructured","without norms","lacking norms"],"phonetic":"/ˈnɔrm.ləs/","extraExplanation":["“normless”不是特别常见的日常用词，更常见的表达有“without norms / lacking norms”或在社会学语境中用“anomic（失范的）”。","构词法：norm（规范/常态）+ -less（没有……的）。在写作中它常用于讨论社会规则、文化期待或行为标准缺失时带来的不确定感。"]}
{"word":"normoblast","summary":{"en":"A normoblast is a nucleated, immature red blood cell usually found in bone marrow.","zh":"normoblast 指通常存在于骨髓中的、有细胞核的未成熟红细胞（红细胞母细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an immature red blood cell (a late-stage erythroblast) that still has a nucleus, normally found in the bone marrow.","zh":"（医学）有细胞核的未成熟红细胞（红细胞母细胞/晚期红细胞前体），通常存在于骨髓中。"},"examples":[{"en":"In the bone marrow smear, the lab noted several normoblasts at different stages of maturation.","zh":"在骨髓涂片中，实验室记录到不同成熟阶段的红细胞母细胞。"},{"en":"Seeing many normoblasts in the peripheral blood can suggest bone marrow stress or certain diseases.","zh":"在外周血中看到较多有核红细胞，可能提示骨髓受压/应激或某些疾病。"}]}],"synonyms":["erythroblast","nucleated red blood cell (NRBC)"],"phonetic":"/ˈnɔrməˌblæst/","extraExplanation":["词源提示：normo- 表示“正常/常规”，-blast 表示“未成熟细胞/胚芽细胞”。因此 normoblast 字面意思是“正常系的未成熟细胞”，在血液学里特指红细胞系中仍带细胞核的阶段。","临床语境：normoblast 通常应在骨髓中出现；如果在外周血检出（常写作 nucleated red blood cells, NRBCs），医生会结合病史与其他指标判断是否为缺氧、严重感染、溶血、骨髓浸润等情况。不同实验室也可能用 erythroblast 作为更常见的同义术语。"]}
{"word":"normoblastic","summary":{"en":"A medical adjective meaning related to normoblasts or to normal red-blood-cell development.","zh":"医学形容词：指与正成红细胞有关，或红细胞生成模式正常。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Relating to normoblasts (immature red blood cells with a nucleus) or to a normal pattern of red-blood-cell formation (erythropoiesis).","zh":"（医学）与正成红细胞（带细胞核的未成熟红细胞）有关的；或指红细胞生成（红细胞生成作用）呈正常模式的。"},"examples":[{"en":"The lab report described a normoblastic bone marrow pattern.","zh":"化验报告描述骨髓呈正成红细胞（正常红系造血）模式。"},{"en":"Her anemia was investigated, but the smear looked normoblastic.","zh":"医生进一步检查她的贫血，但血涂片看起来属于正成红细胞（正常细胞大小的）类型。"}]}],"synonyms":["nonmegaloblastic","normocytic (often related, context-dependent)"],"phonetic":"/ˌnɔrmoʊˈblæstɪk/","extraExplanation":["“normo-”表示“正常”，“-blastic”与“芽细胞/未成熟细胞”有关；因此 normoblastic 常用于血液科报告中，强调红细胞系的发育模式“正常”，常与 “megaloblastic（巨幼细胞性）”对比。","在临床语境里，你可能会看到 “normoblastic anemia（正成红细胞性贫血）”，通常指红细胞大小与发育形态不呈巨幼变，常见于失血、溶血或慢性疾病相关贫血等情况（具体仍需结合检查结果判断）。"]}
{"word":"normocyte","summary":{"en":"A normocyte is a red blood cell that looks normal in size and shape.","zh":"normocyte 指大小与形态正常的红细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red blood cell (erythrocyte) that is normal in size and shape","zh":"正常红细胞（大小与形态正常的红血球）"},"examples":[{"en":"The blood smear showed mostly normocytes with no obvious abnormal shapes.","zh":"血涂片显示大多为正常红细胞，没有明显异常形态。"},{"en":"In normocytic anemia, many red cells may still appear as normocytes even though the total number is low.","zh":"在正细胞性贫血中，虽然红细胞总数偏低，但许多红细胞在外观上仍可能是正常红细胞。"}]}],"synonyms":["normal erythrocyte","normal red blood cell"],"phonetic":"/ˈnɔrmoʊˌsaɪt/","extraExplanation":["“normocyte”常见于血液学/检验报告语境，尤其是在显微镜下观察血涂片（blood smear）时，用来描述红细胞的大小与形态“看起来正常”。","它与“normocytic（正细胞的）”相关：normocytic anemia 指红细胞平均体积（MCV）在正常范围，但红细胞数量或血红蛋白可能偏低。","相关对比词：microcyte（小红细胞，常见于缺铁性贫血）、macrocyte（大红细胞，常见于维生素B12/叶酸缺乏等）。"]}
{"word":"normocytic","summary":{"en":"A medical adjective meaning “normal-sized red blood cells,” often used when describing a type of anemia.","zh":"医学形容词，指“红细胞大小正常”，常用于描述一种贫血类型（正细胞性贫血）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Describing red blood cells (or anemia) that have a normal size (normal mean cell volume, MCV).","zh":"（医学）描述红细胞（或贫血）大小正常的；即平均红细胞体积（MCV）在正常范围内。"},"examples":[{"en":"The lab report showed a normocytic anemia with low hemoglobin.","zh":"化验报告显示为正细胞性贫血，血红蛋白偏低。"},{"en":"In normocytic anemia, the red blood cells are normal in size but may be reduced in number.","zh":"在正细胞性贫血中，红细胞大小正常，但数量可能减少。"},{"en":"Doctors often compare normocytic and microcytic patterns to narrow down the cause of anemia.","zh":"医生常把正细胞性与小细胞性贫血的类型做比较，以缩小病因范围。"}]}],"synonyms":["normal-cell-sized","normal-sized (RBCs)"],"phonetic":"/ˌnɔr.moʊˈsɪtɪk/","extraExplanation":["“normo-”表示“正常”，“-cytic”与“细胞”有关；因此 normocytic 字面意思是“细胞大小正常的”。","它最常用于血液学（尤其是贫血分类）。贫血常按红细胞大小分为：小细胞性（microcytic）、正细胞性（normocytic）、大细胞性（macrocytic）。","“正细胞性贫血”并不代表问题不严重，只是提示病因可能与慢性疾病/炎症、急性失血、肾病（促红细胞生成素不足）、溶血等有关，需要结合网织红细胞计数、铁代谢、肾功能等进一步判断。"]}
{"word":"normotensive","summary":{"en":"“Normotensive” means having normal blood pressure.","zh":"“Normotensive”表示“血压正常的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having normal blood pressure (not high and not low)","zh":"血压正常的；非高血压也非低血压的"},"examples":[{"en":"The patient is normotensive, so we will focus on managing blood sugar instead.","zh":"这位患者血压正常，所以我们将重点放在控制血糖上。"},{"en":"Most adults in the study were normotensive at the start of the trial.","zh":"该研究中大多数成年人在试验开始时血压正常。"}]}],"synonyms":["normal-blood-pressure","nonhypertensive"],"phonetic":"/ˌnɔrmoʊˈtɛnsɪv/","extraExplanation":["词源提示：normo- 表示“正常”，tensive 来自 tension（压力、张力），在医学语境中通常特指 blood pressure（血压）。","使用场景：常见于医学报告、临床研究或病历记录中，比日常说法 “has normal blood pressure” 更正式。"]}
{"word":"normothermia","summary":{"en":"Normothermia means having a normal body temperature.","zh":"normothermia 指“处于正常体温状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A normal body temperature (especially in a medical context), usually around 37°C / 98.6°F in adults.","zh":"正常体温（尤指医学语境中），成人通常约为37°C / 98.6°F。"},"examples":[{"en":"After treatment, the patient returned to normothermia within two hours.","zh":"治疗后，病人在两小时内恢复到正常体温。"},{"en":"The goal of the warming blanket is to maintain normothermia during surgery.","zh":"加温毯的目标是在手术过程中维持正常体温。"}]}],"synonyms":["normal body temperature","euthermia"],"phonetic":"/ˌnɔrmoʊˈθɝmiə/","extraExplanation":["词源提示：normo- 表示“正常的”，-thermia 与“体温/热”有关（同根词：thermal）。在临床上常与 hypothermia（低体温）和 hyperthermia（高体温）对比使用。","补充理解：所谓“正常体温”会因年龄、测量部位（口腔/腋下/耳温/直肠）、时间（早晚）和个体差异而略有浮动，所以医学上更强调“回到正常范围”而不一定是一个固定数字。"]}
{"word":"normothermic","summary":{"en":"“Normothermic” means having a normal body temperature.","zh":"“Normothermic”指体温正常。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a normal body temperature (not unusually hot or cold).","zh":"体温正常的；处于正常体温范围的（不发热也不低体温）。"},"examples":[{"en":"After treatment, the patient became normothermic.","zh":"治疗后，病人恢复到正常体温。"},{"en":"The baby is feeding well and remains normothermic.","zh":"婴儿进食良好，体温保持正常。"}]}],"synonyms":["afebrile (often means no fever)","normal-temperature"],"phonetic":"/ˌnɔrmoʊˈθɝmɪk/","extraExplanation":["“normo-”表示“正常”，“-thermic”与“热/体温”有关。医学语境中常用来描述病人的体温状态。","在临床记录里常与 feverish（发热的）、hypothermic（低体温的）对比使用。"]}
{"word":"normous","summary":{"en":"“Normous” is an informal, nonstandard way to say “enormous,” meaning extremely large.","zh":"“normous”是“enormous”的非正式缩略说法，意思是“非常巨大”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Extremely large; enormous. Often used humorously in speech or casual writing.","zh":"（非正式、非标准）极大的；巨大的。常带有幽默或口语色彩。"},"examples":[{"en":"That burger was normous—I couldn’t finish it.","zh":"那个汉堡太巨大了——我根本吃不完。"},{"en":"They built a normous mall outside the city.","zh":"他们在城外建了一个超大的商场。"},{"en":"She has a normous collection of stickers.","zh":"她有一大堆（超多的）贴纸收藏。"}]}],"synonyms":["enormous","huge","massive","giant","gigantic","immense"],"phonetic":"/ˈnɔrməs/","extraExplanation":["“normous”通常被认为是“enormous”的口语缩略（把开头的 e- 省掉），因此多见于随意对话、网络用语或夸张表达。正式写作中建议用“enormous / huge / massive”。","它也可能让人联想到“ginormous”（giant + enormous 的混成词），两者都常用于夸张、轻松的语气。"]}
{"word":"norms","summary":{"en":"“Norms” are the usual standards of behavior or the typical way things are done in a group or society.","zh":"“Norms”指群体或社会中普遍认可的行为标准，也可指事情通常进行的方式（常态）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Standards or rules of behavior that are considered normal or acceptable in a group, society, or situation.","zh":"在某个群体、社会或情境中被认为“正常”或可接受的行为标准与规则。"},"examples":[{"en":"In many cultures, it’s polite to greet people before starting a conversation.","zh":"在许多文化中，开始对话前先打招呼被视为有礼貌。"},{"en":"Workplace norms include arriving on time and replying to emails professionally.","zh":"职场规范包括准时到达、专业地回复邮件。"}]},{"partOfSpeech":"n.","definition":{"en":"Usual patterns or typical conditions; what normally happens.","zh":"通常的模式或典型状况；一般会发生的情况。"},"examples":[{"en":"After the holiday, life returned to its usual norms.","zh":"假期结束后，生活回到了平常的状态。"},{"en":"Remote work is becoming a new norm for many companies.","zh":"远程办公正在成为许多公司的新常态。"}]}],"synonyms":["standards","conventions","customs","expectations","common practice"],"phonetic":"/nɔrmz/","extraExplanation":["“norms”常用作复数，因为社会规范通常是一整套规则与期待；单数“a norm”指某一条具体的规范或标准。","常见搭配：social norms（社会规范）、cultural norms（文化规范）、gender norms（性别规范）、norms and values（规范与价值观）、break the norms（打破常规/传统）。","注意区分：norms（大家普遍遵守的非正式规则） vs. laws（法律，正式且可强制执行） vs. rules（规则，可能更具体，适用于某个场合/组织）。"]}
{"word":"Normville","summary":{"en":"“Normville” is a (usually fictional) town name used to mean a very normal, conventional place or attitude.","zh":"“Normville”通常指一个（多为虚构的）“正常小镇”，引申为非常普通、传统、从众的地方或心态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (often fictional) meaning “a town of normality,” used to describe an ordinary, conventional place or mindset where people follow typical rules and expectations.","zh":"（常为虚构的）地名，字面意思是“正常小镇”，常用来形容一个很普通、很传统、强调守规矩与从众的地方或心态。"},"examples":[{"en":"After years in big cities, he joked that he was moving back to Normville for a quieter life.","zh":"在大城市生活多年后，他开玩笑说要搬回“Normville”过更安静的日子。"},{"en":"The office feels like Normville—everyone dresses the same and avoids risks.","zh":"这家公司像“Normville”——大家穿得差不多，也都避免冒险。"},{"en":"Her music refuses to live in Normville; it’s strange, bold, and original.","zh":"她的音乐不肯待在“Normville”；它怪诞、大胆而且很有原创性。"}]}],"synonyms":["the mainstream","conventional world","ordinary town","Suburbia"],"phonetic":"/ˈnɔrmˌvɪl/","extraExplanation":["“Normville”通常不是正式地名，而是一种带幽默或讽刺的说法：norm（规范/常态）+ -ville（城镇）。英语里把“-ville”加在词后面，常用来虚构一个“充满某种特质的地方”，比如“Dullsville（无聊城）”“Squaresville（老古板城）”。在写作或对话中用“Normville”，往往是在强调“太普通、太保守、太随大流”的感觉。"]}
{"word":"norn","summary":{"en":"A “norn” is a fate-deciding female figure in Norse mythology.","zh":"“norn”指北欧神话中掌管命运的女性神灵（诺恩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Norse mythology) one of the female beings who decide people’s fate and the destiny of the world; similar to the Greek Fates.","zh":"（北欧神话）诺恩：掌管人类与世界命运的女性神灵，类似希腊神话中的“命运三女神”。"},"examples":[{"en":"In the legend, the Norns weave the fate of gods and humans.","zh":"在传说中，诺恩编织诸神与人类的命运。"},{"en":"The poet compares time to a Norn who cannot be persuaded.","zh":"诗人把时间比作无法被说服的诺恩。"}]}],"synonyms":["fate","destiny","the Fates"],"phonetic":"/nɔrn/","extraExplanation":["“Norn”来自古诺尔斯语，复数常写作“norns”。北欧神话中最常见的是三位诺恩：Urðr（常译“乌尔德/过去”）、Verðandi（“维尔丹迪/现在”）、Skuld（“斯库尔德/未来”）。她们常被描述为在世界树（Yggdrasil，尤克特拉希尔）旁决定命运。","在英语文学与奇幻作品中，“norn”常被用作象征“不可逃避的命运力量”，有时也被借用为角色名或意象。"]}
{"word":"norna","summary":{"en":"Norna: a destiny-shaping female being in Norse mythology (one of the Norns), and also a female name used in Nordic or literary contexts.","zh":"Norna：北欧神话中掌管命运的女性存在（命运三女神之一），也可作女性名字（多见于北欧或文学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) A Norna is one of the three Norns—female beings who control destiny (fate), often compared to the Fates in Greek myth.","zh":"（北欧神话）Norna 指“三女神”（Norns）之一：掌管命运的女性神祇/精灵，常被拿来与希腊神话中的“命运三女神”类比。"},"examples":[{"en":"In Norse myths, each Norna weaves or shapes the fate of gods and humans.","zh":"在北欧神话里，每一位 Norna 都会编织或塑造神与人的命运。"},{"en":"The story describes a Norna who knows what will happen before it occurs.","zh":"故事描写了一位能预知未来的 Norna。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name, used especially in Scandinavian and literary contexts.","zh":"女性名字（常见于斯堪的纳维亚语境或文学作品中）。"},"examples":[{"en":"Norna is a traditional-sounding name that appears in some Nordic-inspired novels.","zh":"Norna 是一个带有传统气息的名字，会出现在一些北欧风格的小说里。"}]}],"synonyms":["Norn","the Norns"],"phonetic":"ˈnɔrnə","extraExplanation":["Norna 来自古诺尔斯语，相关概念是 Norns（命运三女神）：Urd（过去/已发生）、Verdandi（现在/正在发生）、Skuld（未来/应当发生）。英文里更常见的总称是 Norn / Norns；Norna 常作为单数形式或名字出现。","文学用法中，“Norna”也可能让人联想到苏格兰作家 Walter Scott 的小说《The Pirate》里的人物 “Norna of the Fitful Head”，带有神秘、预言者的气质。"]}
{"word":"nornicotine","summary":{"en":"Nornicotine is a tobacco-related alkaloid similar to nicotine, present in smaller amounts and often discussed in scientific contexts.","zh":"Nornicotine（去甲尼古丁）是一种与尼古丁相近的烟草生物碱，含量较少，常见于科研与医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naturally occurring alkaloid found in tobacco and some related plants, chemically similar to nicotine but slightly different; it can be formed from nicotine during processing or in the body and is studied for its biological effects.","zh":"一种天然存在的生物碱，见于烟草及相关植物中，化学结构与尼古丁相似但略有不同；它也可能在加工过程中或在体内由尼古丁转化生成，并因其生物作用而被研究。"},"examples":[{"en":"Tobacco contains nicotine and smaller amounts of nornicotine.","zh":"烟草中含有尼古丁，也含有较少量的去甲尼古丁（nornicotine）。"},{"en":"Researchers measured nornicotine levels to better understand tobacco chemistry.","zh":"研究人员测量去甲尼古丁的含量，以更好地理解烟草的化学组成。"}]}],"synonyms":["nor-nicotine"],"phonetic":"/nɔrˈnɪkəˌtiːn/","extraExplanation":["词形里的“nor-”常用于有机化学命名，表示“去掉一个甲基（-CH3）”的衍生物；因此 nornicotine 可理解为“少了一个甲基的尼古丁”。","该词多用于科学与医学语境（论文、检测报告、毒理学/药理学讨论），日常英语中很少出现。"]}
{"word":"nornorwest","summary":{"en":"North-northwest (NNW) is the compass direction between north and northwest.","zh":"north-northwest（NNW）指介于正北与西北之间的方位：北偏西。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the direction halfway between north and northwest (a compass point).","zh":"北偏西方向；介于正北与西北之间的方向（罗盘方位之一）。"},"examples":[{"en":"The wind is coming from the north-northwest.","zh":"风从北偏西方向吹来。"},{"en":"Head north-northwest for about two miles.","zh":"向北偏西走大约两英里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something located in, moving toward, or coming from the north-northwest direction.","zh":"描述位于、朝向或来自北偏西方向的。"},"examples":[{"en":"A north-northwest breeze cooled the afternoon.","zh":"一阵北偏西的微风让下午凉快了些。"},{"en":"They tracked the storm’s north-northwest movement.","zh":"他们追踪了风暴向北偏西方向移动的路径。"}]},{"partOfSpeech":"n.","definition":{"en":"The compass point north-northwest; also the direction itself.","zh":"北偏西这一罗盘方位点；也指该方向本身。"},"examples":[{"en":"North-northwest is one point west of north on a 16-point compass.","zh":"在16方位罗盘上，北偏西比正北向西偏一格。"}]}],"synonyms":["NNW","northwest by north"],"phonetic":"/ˌnɔɹθ nɔɹθˈwɛst/","extraExplanation":["你写的“nornorwest”更像是把口语里省音的写法（nor’ nor’ west）连在一起了。标准拼写通常是 **north-northwest**（也可写 NNW）。在航海、气象、飞行、登山地图等语境中很常见。"]}
{"word":"noropianic","summary":{"en":"“Noropianic” does not appear to be a standard English word; it likely needs context or corrected spelling.","zh":"“noropianic”看起来不是标准英语词汇；需要上下文或更正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it is likely a misspelling, a very rare technical coinage, or a name (proper noun).","zh":"不是主流英语词典中的标准词；很可能是拼写错误、极少见的专业造词，或某个名称（专有名词）。"},"examples":[{"en":"I couldn’t find “noropianic” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里查不到“noropianic”——你能把它出现的句子发我吗？"},{"en":"It may be a typo; check the spelling and try searching for similar-looking words.","zh":"它可能是拼写错误；建议检查拼写，并搜索形近词。"}]}],"phonetic":"/ˌnɔːroʊˈpɪænɪk/","extraExplanation":["我查不到“noropianic”的可靠来源，因此不建议我硬猜一个“权威定义”。如果你能提供上下文（整句/段落、领域如医学/化学/小说、是否是人名地名或品牌），我可以更准确判断。","就拼写外形来看，它可能被写错了：常见的相近词形包括 nootropic（益智的/促智的）、norepinephrinic（与去甲肾上腺素有关的，较专业）、或某个专有名词（如虚构作品中的族名/地名）。把原文贴出来我可以帮你锁定。"]}
{"word":"norovirus","summary":{"en":"Norovirus is a highly contagious virus that causes sudden stomach and intestinal illness, especially vomiting and diarrhea.","zh":"诺如病毒是一种高度传染的病毒，可引起急性胃肠道不适，常见为呕吐和腹泻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very contagious virus that causes stomach and intestinal infection, leading to vomiting, diarrhea, nausea, and stomach cramps (often called “stomach flu,” though it is not influenza)","zh":"一种高度传染的病毒，会引起胃肠道感染，常见症状包括呕吐、腹泻、恶心和腹痛（常被俗称为“胃流感”，但并非真正的流感）"},"examples":[{"en":"A norovirus outbreak spread quickly on the cruise ship, and many passengers started vomiting.","zh":"邮轮上爆发了诺如病毒疫情，很多乘客开始呕吐。"},{"en":"Wash your hands well with soap and water to help prevent norovirus.","zh":"用肥皂和清水认真洗手，有助于预防诺如病毒。"},{"en":"After eating at the buffet, he came down with norovirus and had diarrhea for two days.","zh":"在自助餐吃完后，他感染了诺如病毒，腹泻了两天。"}]}],"synonyms":["stomach bug","viral gastroenteritis (general term)","winter vomiting bug (BrE)"],"phonetic":"/ˈnɔroʊˌvaɪrəs/","extraExplanation":["“Norovirus”常出现在公共卫生语境：学校、托儿所、养老院、餐厅、邮轮等人群密集处容易暴发。","在日常英语里，人们可能说“I have a stomach bug.”或误称“stomach flu”，但更准确的说法是“norovirus”或“viral gastroenteritis（病毒性胃肠炎）”。","预防建议在英语告示中常见：handwashing（洗手）比仅用alcohol-based hand sanitizer（酒精免洗洗手液）更可靠；表面消毒常会提到bleach solution（含氯漂白剂消毒液）。"]}
{"word":"norpinic","summary":{"en":"“Norpinic” is a rare chemistry term meaning “related to norpinic acid.”","zh":"“norpinic”是一个罕见的化学用语，表示“与去蒎酸有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A rare scientific adjective meaning “related to norpinic acid,” used mainly in chemistry (especially organic/terpene chemistry).","zh":"一个较少见的科学形容词，意为“与去蒎酸（norpinic acid）有关的”，主要见于化学（尤其有机/萜类化学）语境。"},"examples":[{"en":"The paper discusses the synthesis of norpinic acid and other related compounds.","zh":"这篇论文讨论了去蒎酸以及其他相关化合物的合成。"},{"en":"Norpinic derivatives were analyzed by chromatography.","zh":"研究人员用色谱法分析了去蒎酸的衍生物。"}]}],"synonyms":["related to norpinic acid","norpinic-acid-related"],"phonetic":"/nɔrˈpɪnɪk/","extraExplanation":["“norpinic”在日常英语与常见词典中几乎不出现，通常只会在专业化学文献里作为“norpinic acid（去蒎酸）”的派生形容词使用。","如果你是在作业/文章里看到它，建议你提供原句或相关领域（比如有机化学、天然产物、萜类），我可以帮你更准确地解释它指的是哪一种具体结构或用途。","也有可能是拼写误差：例如与“pinic（蒎酸的）/pionic/propionic”等形近词混淆；给出上下文可以快速排除。"]}
{"word":"norridgewock","summary":{"en":"Norridgewock is primarily a place name in Maine (USA), also known for its historical connection to the Abenaki people and early colonial-era events.","zh":"Norridgewock 主要是美国缅因州的地名，也因与阿贝纳基原住民及殖民时期历史事件有关而为人所知。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a town in Somerset County, Maine, in the United States, located near the Kennebec River","zh":"美国缅因州萨默塞特县的一个小镇，靠近肯纳贝克河"},"examples":[{"en":"Norridgewock is a small town in central Maine.","zh":"Norridgewock 是缅因州中部的一个小镇。"},{"en":"They drove through Norridgewock on their way to Skowhegan.","zh":"他们去斯科希根（Skowhegan）的路上经过了 Norridgewock。"}]},{"partOfSpeech":"other","definition":{"en":"a historic Abenaki settlement and mission area connected with early French and English colonial history in Maine","zh":"与缅因州早期法英殖民历史有关的阿贝纳基（Abenaki）原住民历史聚居地与传教区"},"examples":[{"en":"The name Norridgewock is often mentioned in stories about early Maine history.","zh":"在讲述缅因州早期历史的故事里，经常会提到 Norridgewock。"}]}],"synonyms":["Norridgewock, Maine"],"phonetic":"/ˈnɔrɪdʒˌwɑk/","extraExplanation":["Norridgewock 是地名（专有名词），日常英语里通常不当作普通词使用。","这个地名常被认为来自阿尔冈昆语系的原住民语言（常见说法与阿贝纳基语有关），具体词源解释在不同资料中可能略有差异。"]}
{"word":"norriture","summary":{"en":"“Norriture” is not standard English; it’s likely a misspelling of French “nourriture” (“food; nourishment”).","zh":"“norriture”不是标准英语；很可能是法语“nourriture”（“食物；营养”）的拼写误写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard English) A likely misspelling of the French word “nourriture,” meaning food; nourishment.","zh":"（非标准英语）很可能是法语“nourriture”的拼写误写，意思是“食物；营养；养分”。"},"examples":[{"en":"This looks like the French word “nourriture,” meaning “food.”","zh":"这看起来像法语“nourriture”，意思是“食物”。"},{"en":"In English, you would usually say “food” or “nourishment,” not “norriture.”","zh":"在英语里通常说“food”或“nourishment”，而不说“norriture”。"}]}],"synonyms":["food","nourishment","nutrition","fare","provisions"],"phonetic":"/ˈnuːriːtʊr/","extraExplanation":["“nourriture”在法语里是日常词，指食物、供养之物；在英文语境中一般不会直接用它，除非是在法式料理、文学/文化讨论或引用法语原文。","如果你想表达“营养/滋养”（更抽象的含义），英语更常用“nourishment”；如果只是指“吃的东西”，用“food”。"]}
{"word":"norroway","summary":{"en":"“norroway” is not a standard word; you probably mean “Norway,” the country in Northern Europe.","zh":"“norroway”不是标准英文；你很可能想写的是“Norway（挪威）”，一个北欧国家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Norway (often misspelled as “norroway”): a country in Northern Europe, on the western side of the Scandinavian Peninsula.","zh":"挪威（常被误拼为“norroway”）：位于北欧、斯堪的纳维亚半岛西部的国家。"},"examples":[{"en":"Norway is famous for its fjords and long coastline.","zh":"挪威以峡湾和漫长的海岸线而闻名。"},{"en":"She moved to Norway for work.","zh":"她为了工作搬到了挪威。"},{"en":"Oslo is the capital of Norway.","zh":"奥斯陆是挪威的首都。"}]}],"synonyms":["Kingdom of Norway"],"phonetic":"/ˈnɔrweɪ/","extraExplanation":["“norroway”不是标准英文拼写，最常见的正确词是专有名词“Norway”。如果你本来想表达“narrow way”（狭窄的道路/方式），那是两个词，意思与“Norway（国家）”完全不同。","“Norway”来自古诺斯语，常被解释为与“北方之路/海上航路”相关；英文中通常不加冠词（说“in Norway”，不是“in the Norway”）。"]}
{"word":"norroy","summary":{"en":"Norroy is a historical heraldic title in England, traditionally the King of Arms for northern England; today it commonly appears as “Norroy and Ulster King of Arms.”","zh":"Norroy 是英格兰历史上的纹章官头衔，传统上负责英格兰北部的纹章事务；如今常以“Norroy and Ulster King of Arms（诺罗伊与阿尔斯特纹章王）”形式出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Heraldry, historical) A title for a senior English herald (a “King of Arms”) who traditionally had authority over coats of arms in the north of England (originally north of the River Trent). Today it is most often seen in the combined office “Norroy and Ulster King of Arms.”","zh":"（纹章学/历史）英格兰高级纹章官（“纹章王”）的头衔之一，传统上负责英格兰北部（最初多指特伦特河以北）的纹章与家族徽章事务。如今多见于合并职衔“Norroy and Ulster King of Arms（诺罗伊与阿尔斯特纹章王）”。"},"examples":[{"en":"The manuscript was signed by Norroy King of Arms in the seventeenth century.","zh":"这份手稿在17世纪由诺罗伊纹章王署名。"},{"en":"He applied for a grant of arms through the office of Norroy and Ulster King of Arms.","zh":"他通过“诺罗伊与阿尔斯特纹章王”的机构申请授予家族徽章。"}]}],"synonyms":["King of Arms"],"phonetic":"ˈnɔrɔɪ","extraExplanation":["“Norroy”一词来自中古法语/诺曼法语，意思是“北方之王”（nor=北方，roy=王）。它属于英国纹章院体系中的官职名称，不是常见日常词汇。","历史上英格兰有多位“King of Arms（纹章王）”，各自负责不同区域与事务；“Norroy”负责北部地区。后来与爱尔兰相关的“Ulster King of Arms”职务合并，因此现代文本更常出现“Norroy and Ulster King of Arms”。"]}
{"word":"norry","summary":{"en":"“Norry” is most commonly a personal name/nickname; more rarely, it appears as a regional/dialect word for a seabird (often spelled Norrie/Norie).","zh":"“Norry”最常见是人名/昵称；较少见的是地区方言里指“海鸟”的说法（常拼作 Norrie/Norie）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (often used for Eleanor/Leonora/Honora in some English-speaking communities).","zh":"人名或昵称（在一些英语社群里常作为 Eleanor / Leonora / Honora 等名字的昵称）。"},"examples":[{"en":"Norry is short for Eleanor in her family.","zh":"在她家里，Norry 是 Eleanor 的简称。"},{"en":"Norry moved to New York after college.","zh":"Norry 大学毕业后搬去了纽约。"}]},{"partOfSpeech":"n.","definition":{"en":"a dialect word (Scottish/Regional English) for a seabird; spelling varies (often seen as Norrie/Norie).","zh":"方言词（苏格兰/地区英语）：指一种海鸟；拼写不固定（常见作 Norrie/Norie）。"},"examples":[{"en":"In some coastal dialects, people might call certain seabirds a “norry.”","zh":"在一些沿海方言里，人们可能会把某些海鸟叫作 “norry”。"}]}],"synonyms":["Norrie","Norie"],"phonetic":"/ˈnɔɹi/","extraExplanation":["“norry”并不是现代标准英语里的常用词。你更可能在两种场景看到它：① 作为人名/昵称；② 在苏格兰或岛屿地区相关的方言文本里，作为“海鸟”的地方说法（更常见的拼写是 Norrie / Norie）。","如果你是在某篇文章、歌词或小说里看到 norry，告诉我原句，我可以帮你判断它更像是人名还是方言词。"]}
{"word":"norse","summary":{"en":"Norse usually refers to the ancient Scandinavians (Vikings) or anything connected with their culture, language, and mythology.","zh":"Norse通常指古代的斯堪的纳维亚人（维京人），或与其文化、语言和神话相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Scandinavia, especially in the Viking Age (roughly 8th–11th centuries); a Viking","zh":"北欧人（尤指维京时代约8–11世纪的斯堪的纳维亚人）；维京人"},"examples":[{"en":"The Norse sailed across the North Atlantic and reached Iceland and Greenland.","zh":"北欧人横渡北大西洋，到达了冰岛和格陵兰。"},{"en":"Many stories about the Norse mix history with legend.","zh":"许多关于北欧人的故事把历史与传说交织在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Scandinavia or to the Vikings; connected with the culture, language, or history of ancient Scandinavia","zh":"北欧的；（尤指）与维京人有关的；与古代斯堪的纳维亚文化、语言或历史相关的"},"examples":[{"en":"Norse mythology includes gods like Odin and Thor.","zh":"北欧神话包括奥丁和索尔等神祇。"},{"en":"He studies Old Norse texts at the university.","zh":"他在大学研究古诺斯语文本。"}]}],"synonyms":["Viking (often similar, but not always identical)","Scandinavian (more modern/general)"],"phonetic":"/nɔrs/","extraExplanation":["“Norse”常见于历史与神话语境，尤其指“维京时代”的斯堪的纳维亚人。更中性、现代的说法是“Scandinavian（斯堪的纳维亚人/北欧人）”，而“Norse”更偏古代与文化标签。","语言上，“Old Norse（古诺斯语）”是当时北日耳曼语支的一种，对现代冰岛语、挪威语等有影响；所以你会在学术、神话、史诗（saga）研究中经常看到“Norse”。"]}
{"word":"norsel","summary":{"en":"“Norsel” isn’t a standard word; you likely mean “morsel,” a small piece/amount (especially of food).","zh":"“norsel” 不是标准单词；你多半想写 “morsel”，表示“一小口/一小块（尤其是食物）”，也可指“一点点”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Norsel” is not a standard English word; it is most likely a misspelling of “morsel,” meaning a small piece of food (or a small amount of something).","zh":"“norsel” 不是标准英文单词；很可能是把 “morsel” 拼错了，意思是“一小口/一小块食物”（也可指“一点点某物”）。"},"examples":[{"en":"I think you meant “morsel”: She ate a morsel of bread and drank some water.","zh":"你可能想写的是 “morsel”：她吃了一小口面包，喝了点水。"},{"en":"The article offered a morsel of hope for patients.","zh":"那篇文章给病人带来了一丝希望。"}]}],"synonyms":["bite","small piece","crumb","bit"],"phonetic":"/ˈmɔrsəl/","extraExplanation":["“morsel”常用于两种语境：字面上指“一小口食物”，引申义指“一点点信息/希望/证据”（a morsel of information/hope/evidence）。","如果你原本想表达“鼻孔”（nostril）或“北欧人”（Norse），也可能是拼写混淆；可以告诉我你想表达的句子，我帮你确认。"]}
{"word":"norseland","summary":{"en":"Norseland usually means the imagined homeland of the Norse (Scandinavia, especially Norway), and it can also be a U.S. place name (notably in Minnesota).","zh":"Norseland 通常指想象中的“北欧诺斯人的故乡”（斯堪的纳维亚，尤指挪威），也可作地名（尤其指美国明尼苏达州的诺斯兰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poetic or literary name for Scandinavia (especially Norway), imagined as the homeland of the Norse people and Vikings; more generally, the land of the Norsemen","zh":"（诗意/文学用语）指斯堪的纳维亚（尤指挪威），被想象为北欧诺斯人/维京人的故乡；泛指“北欧人的土地”"},"examples":[{"en":"In the saga, the hero sails back to Norseland before winter comes.","zh":"在这部传奇故事里，英雄在冬天到来前航海回到“北欧故土”。"},{"en":"The museum exhibit celebrates crafts and stories from Norseland.","zh":"博物馆展览赞颂来自“北欧之地”的手工艺与故事。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, most commonly Norseland, Minnesota (USA)","zh":"地名：最常见的是美国明尼苏达州的 Norseland（诺斯兰）"},"examples":[{"en":"They stopped for lunch near Norseland on their drive through southern Minnesota.","zh":"他们穿越明尼苏达州南部时，在诺斯兰附近停下来吃午饭。"}]}],"synonyms":["Scandinavia","the Northlands","Norse lands"],"phonetic":"/ˈnɔrzˌlænd/","extraExplanation":["“Norseland”常见于较有文学色彩的英文语境，用来唤起“维京/北欧传奇”的氛围，并不等同于一个严格的现代国家名称。","在美国明尼苏达州，Norseland 作为地名与当地的挪威裔移民历史有关；该地区有不少与挪威文化相关的节庆与标志。"]}
{"word":"norseled","summary":{"en":"Norse-led means led or controlled by Norse (Scandinavian) people, especially in historical contexts.","zh":"Norse-led 指“由北欧人（斯堪的纳维亚人）领导或控制的”，多用于历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written with a hyphen: Norse-led) directed, governed, or organized by Norse people (Scandinavians, especially in the Viking Age).","zh":"（常写作带连字符：Norse-led）由北欧人（斯堪的纳维亚人，尤指维京时代）领导、统治或组织的。"},"examples":[{"en":"The island became a Norse-led settlement during the early medieval period.","zh":"在中世纪早期，这座岛屿成为由北欧人主导的定居点。"},{"en":"Some historians describe the region as a Norse-led trading network across the North Atlantic.","zh":"一些历史学家将该地区描述为横跨北大西洋、由北欧人主导的贸易网络。"}]}],"synonyms":["Scandinavian-led","Viking-led","Norse-ruled","Norse-controlled"],"phonetic":"ˈnɔrs lɛd","extraExplanation":["“norseled”本身不太常见；更标准的拼写通常是 **Norse-led**（带连字符，且Norse大写）。它多用于历史语境，谈到维京时代或中世纪早期北欧人在某地的统治、殖民或贸易影响。"]}
{"word":"norseler","summary":{"en":"“norseler” isn’t a recognized English word; it’s probably a name or a misspelling.","zh":"“norseler”不是常见英语词；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a surname, or a made-up/brand/username.","zh":"不是标准英语单词；更可能是拼写错误、姓氏，或自造的品牌名/用户名。"},"examples":[{"en":"I couldn’t find “norseler” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里查不到“norseler”——它会不会是名字或拼写错误？"},{"en":"The account name “norseler” isn’t an English word, but it can still be used as a username.","zh":"账号名“norseler”不是英语单词，但仍然可以作为用户名使用。"}]}],"phonetic":"/ˈnɔrsələr/","extraExplanation":["“norseler”很像拼写误差。你可以告诉我它出现的上下文（句子、网站、游戏/品牌名、语言环境），我才能更准确判断。","常见接近的英语词形可能包括：Norse（北欧人的/北欧的）、northerner（北方人）、Norwegian（挪威的/挪威人）。如果你想表达“北欧/维京相关”，通常用 Norse 或 Viking 更自然。"]}
{"word":"norseling","summary":{"en":"Nursling means a baby being nursed—an infant who is very young and dependent.","zh":"Nursling 指“正在哺育中的婴儿”，带有文学/古风色彩，强调年幼与依赖照料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A baby or young child who is being nursed (fed with milk and cared for), especially by a mother or nurse; a very young, dependent child.","zh":"吃奶的婴儿；（尤指由母亲或乳母）哺育中的幼儿；引申为非常年幼、依赖他人照顾的孩子。"},"examples":[{"en":"The mother held the nursling close to keep him warm.","zh":"母亲把吃奶的婴儿紧紧抱在怀里取暖。"},{"en":"In old stories, a shepherd may find a nursling left at the edge of the forest.","zh":"在古老故事里，牧羊人可能会在森林边发现一个被遗弃的婴儿。"}]}],"synonyms":["infant","baby","newborn"],"phonetic":"/ˈnɝːslɪŋ/","extraExplanation":["“norseling”并不是常见的标准拼写；你很可能想查的是 **nursling**。在现代英语里更常用的说法是 **infant / baby**（婴儿）或 **newborn**（新生儿）。","**nursling** 带有较强的文学/古风色彩（literary/archaic），常见于圣经译文、诗歌或古典叙事中，用来强调“被哺育、很脆弱、需要照料”的意象。"]}
{"word":"norselled","summary":{"en":"“Norselled” is not a recognized English word; it’s probably a misspelling (often confused with “Norse” or “resold/resell”).","zh":"“norselled” 不是规范英语词；多半是拼写错误（常与 “Norse” 或 “resold/resell” 混淆）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a word-forming error (for example, you may have meant “Norse” (related to Scandinavia/Vikings) or “resold/reselled”).","zh":"这不是标准英语单词，通常被视为拼写错误或构词错误。（例如你可能想写的是 “Norse”（北欧/维京相关）或 “resold/reselled”（转卖/再出售）。）"},"examples":[{"en":"I couldn’t find “norselled” in a dictionary—did you mean “Norse” or “resold”?","zh":"我在词典里找不到 “norselled”——你是不是想写 “Norse” 或 “resold”？"},{"en":"The book mentions Norse myths, not “norselled.”","zh":"这本书提到的是北欧神话（Norse myths），不是 “norselled”。"}]}],"phonetic":"/ˈnɔrˌsɛld/","extraExplanation":["“resell”的过去式/过去分词在现代英语里最常见是 **resold**（不规则变化）。**reselled** 偶尔会在非正式用法中出现，但一般不推荐。","如果你能提供一句包含 “norselled” 的原句、来源（小说/聊天/作业）或你想表达的意思（比如“北欧的”“转卖了”“被某人领导”），我可以帮你确定最可能的正确拼写和用法。"]}
{"word":"norselling","summary":{"en":"“Norselling” isn’t a standard word; it most likely means “no reselling” (resale is not allowed).","zh":"“norselling”不是标准词；最可能是“no reselling（禁止转卖）”的拼写错误。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Not a standard English word; it is most likely a misspelling of “no reselling,” a notice meaning you are not allowed to sell the item again to other people.","zh":"这不是标准英语单词；很可能是把“no reselling”（禁止转卖/禁止倒卖）拼错了，表示不允许把该物品再次卖给别人。"},"examples":[{"en":"This ticket is marked “no reselling.”","zh":"这张票标注了“no reselling（禁止转卖）”。"},{"en":"The seller added a “no reselling” rule to prevent scalping.","zh":"卖家加了“no reselling（禁止转卖）”规则来防止黄牛倒卖。"}]}],"synonyms":["no resale","not for resale","resale prohibited"],"phonetic":"/noʊ riˈsɛlɪŋ/","extraExplanation":["“No reselling”常见于票务、限量商品、数字产品（课程/账号/软件许可）等场景，用来限制买家把商品再卖给第三方；在一些国家/平台上也与“scalping（黄牛炒卖）”有关。","如果你原本想表达“Norwegian selling（挪威的销售/卖货）”或其他意思，可以告诉我上下文（在哪看到、完整句子），我可以帮你确认最可能的词。"]}
{"word":"norseman","summary":{"en":"A Norseman is a Norwegian or Scandinavian man, especially from the Viking era.","zh":"Norseman 指挪威男子或北欧男子，尤指维京时代的北欧人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man from Norway, or (more broadly) a Scandinavian person, especially one from the Viking era.","zh":"挪威男子；（更广义）北欧人，尤指维京时代的斯堪的纳维亚人。"},"examples":[{"en":"In the saga, a Norseman sails west to explore new lands.","zh":"在这部传奇故事里，一位北欧人向西航行去探索新大陆。"},{"en":"The museum exhibit describes how a Norseman might have lived during the Viking Age.","zh":"博物馆展览介绍了维京时代的北欧人可能如何生活。"}]}],"synonyms":["Viking (context-dependent)","Norse","Scandinavian (broader)"],"phonetic":"/ˈnɔrsmən/","extraExplanation":["“Norseman”常带有历史/文学色彩，多用于谈论维京时代（约公元8—11世纪）的人物与文化。在现代日常语境里，如果只是指“挪威人”，更常用“Norwegian (person)”。","更中性的复数或泛指表达可以用“the Norse”（指古诺尔斯人/北欧人）或“Scandinavians”（现代意义上的斯堪的纳维亚人）。注意“Viking”更强调从事维京式航海、贸易与掠袭等活动的人，并不等同于所有北欧人。"]}
{"word":"norsemen","summary":{"en":"Norsemen means Scandinavian people, often referring to Vikings in historical contexts.","zh":"norsemen 指斯堪的纳维亚人，在历史语境中常指维京时代的北欧人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Scandinavia (especially Norway, Denmark, and Sweden), often referring to Viking-age sailors, traders, and warriors","zh":"北欧人（尤指挪威、丹麦、瑞典等斯堪的纳维亚人）；常指维京时代的航海者、商人和战士"},"examples":[{"en":"The Norsemen sailed across the North Atlantic and reached Iceland and Greenland.","zh":"北欧人航行穿越北大西洋，抵达了冰岛和格陵兰。"},{"en":"Many stories describe the Norsemen as both fierce fighters and skilled traders.","zh":"许多故事把北欧人描写成既勇猛善战、又精于贸易。"}]}],"synonyms":["Scandinavians","Vikings","Norse people"],"phonetic":"/ˈnɔrs.mən/","extraExplanation":["“Norsemen”是复数形式，单数常用“Norseman”。在历史语境中，它常与“Vikings（维京人）”有重叠，但不完全等同：Viking更强调从事海上劫掠/远航活动的身份，而Norsemen更广泛，指来自北欧的人群。","词源上与“Norse（北欧的/古诺尔斯语的）”相关；在英语历史书写中，常用来指8—11世纪的斯堪的纳维亚人及其扩张活动。"]}
{"word":"norsk","summary":{"en":"“Norsk” means “Norwegian,” especially the Norwegian language, and is often used in Norwegian contexts (names, signs, language menus).","zh":"“Norsk”意为“挪威的/挪威语”，尤其指挪威语本身，并常出现在挪威语语境中（名称、标识、语言菜单等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Norwegian language (the word used in Norwegian, often seen in phrases like “Norsk språk”)","zh":"挪威语（这是挪威语中对“挪威语/挪威的”的称呼，常见于如“Norsk språk”之类的表达）"},"examples":[{"en":"I’m learning Norsk because I want to travel in Norway.","zh":"我在学挪威语，因为我想去挪威旅行。"},{"en":"This website has an option for English or Norsk.","zh":"这个网站可以选择英文或挪威语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Norwegian; relating to Norway (often used in names and branding, especially in Norwegian contexts)","zh":"挪威的；与挪威有关的（常用于名称、品牌或机构名中，尤其在挪威语语境里）"},"examples":[{"en":"Norsk Hydro is a well-known Norwegian company.","zh":"Norsk Hydro 是一家知名的挪威公司。"},{"en":"You may see “Norsk” on signs in Norway.","zh":"在挪威你可能会在标识上看到“Norsk”这个词。"}]}],"synonyms":["Norwegian"],"phonetic":"/nɔrsk/","extraExplanation":["“Norsk”是挪威语里的自称用词，相当于英语的“Norwegian”。在英语文章里也会借用它，尤其在品牌名、机构名或语言选项中（如“English / Norsk”）。","挪威的两种官方书面语标准常写作“Bokmål”和“Nynorsk”。其中“Nynorsk”字面意思就是“新挪威语”。"]}
{"word":"nortelry","summary":{"en":"Northerly means “from the north” (adj.), “toward the north” (adv.), or “a north wind” (n.).","zh":"Northerly 可指“来自北方的”（形容词）、“向北的”（副词），也可指“北风”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Coming from the north; located toward the north.","zh":"（形容词）来自北方的；位于北方（或偏北方向）的。"},"examples":[{"en":"A northerly wind brought cooler air.","zh":"一阵北风带来了更凉爽的空气。"},{"en":"They headed to the northerly part of the island.","zh":"他们前往岛的北部地区。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Adverb) Toward the north.","zh":"（副词）向北；朝北。"},"examples":[{"en":"The storm moved northerly overnight.","zh":"这场风暴在夜间向北移动。"},{"en":"Keep walking northerly until you reach the river.","zh":"一直向北走，直到你到达河边。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun) A wind that blows from the north.","zh":"（名词）北风（从北方吹来的风）。"},"examples":[{"en":"A strong northerly made the sea rough.","zh":"强劲的北风使海面变得汹涌。"}]}],"synonyms":["northward","northern","northbound"],"phonetic":"/ˈnɔrðərli/","extraExplanation":["“nortelry”不是常见英文单词，通常是把 **northerly** 拼错了。","在天气预报里很常见：**a northerly (wind)** 表示“北风”；作副词时也常用于描述移动方向，如 **move northerly**。"]}
{"word":"north","summary":{"en":"North refers to the direction opposite south, and it can also describe something located or moving in that direction.","zh":"North 表示“北”的方位，也可用来形容“在北方/向北/来自北方”的事物或动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the direction that is toward the top of most maps; one of the four main compass directions","zh":"北；向地图上方的方向；四个基本方位之一"},"examples":[{"en":"If you drive north, you’ll reach the lake in about an hour.","zh":"如果你往北开车，大约一小时就能到湖边。"},{"en":"The wind is coming from the north.","zh":"风从北边吹来。"}]},{"partOfSpeech":"adj.","definition":{"en":"located in, moving toward, or coming from the north","zh":"北方的；向北的；来自北方的"},"examples":[{"en":"A cold north wind blew all night.","zh":"一整夜都刮着寒冷的北风。"},{"en":"They took the north road to avoid traffic.","zh":"他们走北边那条路来避开拥堵。"}]},{"partOfSpeech":"adv.","definition":{"en":"toward the north","zh":"向北；在北方"},"examples":[{"en":"Keep walking north until you see the bridge.","zh":"一直向北走，直到你看到那座桥。"}]}],"synonyms":["northern (adj.)","due north (exactly north)"],"phonetic":"/nɔrθ/","extraExplanation":["在英语里，方位词常同时当名词、形容词和副词使用：the North（名词，常指“北方地区”或“北方阵营”）、north wind（形容词修饰名词）、go north（副词表示方向）。","大小写有时会影响含义：north 通常指一般方向；the North / Northern 常可指特定地区或文化概念（如美国历史语境中的“北方”）。"]}
{"word":"northbound","summary":{"en":"Northbound means going or moving toward the north.","zh":"northbound 指“朝北方向行进/北行的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Going or traveling toward the north (often used for vehicles, roads, lanes, trains, or flights).","zh":"（朝）向北行驶的；北行的（常用于车辆、道路、车道、列车或航班）。"},"examples":[{"en":"Take the northbound train to Uptown.","zh":"坐北行列车去上城。"},{"en":"The accident blocked two northbound lanes.","zh":"事故堵住了两条北行车道。"},{"en":"She is on a northbound flight from Los Angeles to Seattle.","zh":"她正乘坐从洛杉矶飞往西雅图的北行航班。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a direction toward the north.","zh":"向北；朝北（地）。"},"examples":[{"en":"Traffic is moving northbound this morning.","zh":"今天早上车流正向北行驶。"},{"en":"We drove northbound along the coast.","zh":"我们沿着海岸向北开。"}]}],"synonyms":["northward","northerly (in some contexts)"],"phonetic":"/ˈnɔrθˌbaʊnd/","extraExplanation":["在英语里，-bound 表示“朝……方向去的/行进中的”（如 eastbound 向东、westbound 向西）。在路标、交通广播、地铁/火车线路信息中非常常见：northbound 通常指“北向车道/北向线路/北行方向”的那一侧或那一班。"]}
{"word":"northcountryman","summary":{"en":"A (usually male) person from a northern region, especially northern England in British usage.","zh":"北方人（多指男性）；英国语境里常指英格兰北部的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (especially a man) from a northern region or “the North Country,” often used in British contexts to mean northern England (and sometimes Scotland).","zh":"北方人（尤指男性）；常见于英国语境，指英格兰北部（有时也指苏格兰）的人。"},"examples":[{"en":"He spoke with a strong accent that marked him as a northcountryman.","zh":"他带着浓重的口音，让人一听就知道他是北方人。"},{"en":"In the novel, the northcountryman is portrayed as practical and hardworking.","zh":"在小说里，这位北方人被刻画得务实又勤劳。"}]}],"synonyms":["northerner","northern man","man from the North"],"phonetic":"/ˈnɔrθˌkʌntriˌmæn/","extraExplanation":["这个词多见于文学或较传统的叙述中，带一点地域色彩；现代日常英语里更常说“a man from the north / a northerner”。","“North Country”在英国常指英格兰北部的乡村与工业城镇一带（如约克郡、兰开夏等），具体范围会因语境而变化。"]}
{"word":"northeast","summary":{"en":"Northeast means the direction between north and east, or something located/going toward that direction.","zh":"Northeast 表示北与东之间的“东北”方向，也可指位于/来自/朝向东北的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the direction between north and east; the part of the compass that is halfway between them","zh":"东北方向；位于北与东之间的方位"},"examples":[{"en":"The wind is coming from the northeast.","zh":"风从东北方向吹来。"},{"en":"Head northeast for two miles, then turn left.","zh":"向东北走两英里，然后左转。"}]},{"partOfSpeech":"adj.","definition":{"en":"located in or coming from the northeast","zh":"位于东北的；来自东北的"},"examples":[{"en":"New York is in the northeastern United States.","zh":"纽约位于美国东北部。"},{"en":"A northeast breeze cooled the afternoon.","zh":"一阵东北风让下午凉快了些。"}]},{"partOfSpeech":"adv.","definition":{"en":"toward the northeast","zh":"朝东北方向"},"examples":[{"en":"The storm moved northeast overnight.","zh":"暴风雨在夜间向东北移动。"}]}],"synonyms":["NE","northeastern (adj.)"],"phonetic":"/ˌnɔɹθˈiːst/","extraExplanation":["在地图和罗盘上，northeast 常缩写为 NE。航海、天气预报、登山指路等场景特别常用。","写法上既可写作 northeast，也常见连字符形式 north-east（更偏英式/较旧用法）。作形容词时常写成 northeastern（如 “the Northeastern U.S.”）。"]}
{"word":"northeaster","summary":{"en":"A northeaster is a northeast wind or, more commonly, a strong coastal storm coming from the northeast (especially in the northeastern U.S.).","zh":"northeaster 指东北风；更常指从东北方向袭来的强风暴，尤指美国东北海岸常见的“东北风暴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong storm or wind coming from the northeast, especially a powerful coastal storm in the northeastern U.S. that often brings heavy rain or snow.","zh":"（从东北方向吹来的）强风或暴风雨；尤指美国东北海岸常见的“东北风暴”，常带来大雨或暴雪。"},"examples":[{"en":"A northeaster is expected to hit the coast tonight, bringing heavy snow.","zh":"预计今晚一场东北风暴将袭击海岸，带来大雪。"},{"en":"Schools closed early because the northeaster made the roads dangerous.","zh":"由于东北风暴让道路变得危险，学校提前停课。"},{"en":"Fishermen stayed in port during the northeaster.","zh":"在东北风暴期间，渔民留在港口不出海。"}]},{"partOfSpeech":"n.","definition":{"en":"A wind that blows from the northeast.","zh":"东北风（从东北方向吹来的风）。"},"examples":[{"en":"By morning, a steady northeaster had cooled the air.","zh":"到早晨，一阵稳定的东北风让空气凉了下来。"},{"en":"The sailboat turned to catch the northeaster.","zh":"帆船转向以迎接东北风。"}]}],"synonyms":["northeast wind","nor'easter","coastal storm"],"phonetic":"/ˌnɔrθˈiːstɚ/","extraExplanation":["在美国英语里，northeaster 常与 nor’easter（更口语、更常见的拼写）指同一种典型风暴，尤其影响新英格兰与大西洋沿岸。","这类风暴常与低气压系统有关，风从东北吹向陆地，容易造成海岸风暴潮、强风、降雪或冻雨。"]}
{"word":"northeasterly","summary":{"en":"Northeasterly means “from/near/toward the northeast,” often used for winds, movement, or location.","zh":"northeasterly 表示“与东北方向有关（来自/位于/朝向东北）”，常用于风向、移动方向或位置描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Coming from, facing, or moving toward the northeast (NE).","zh":"来自东北方向的；面向东北的；朝东北方向移动的。"},"examples":[{"en":"A northeasterly wind brought colder air overnight.","zh":"一阵东北风把更冷的空气带来了。"},{"en":"The village lies on the northeasterly side of the lake.","zh":"这个村庄位于湖的东北侧。"}]},{"partOfSpeech":"n.","definition":{"en":"A wind or current that comes from the northeast.","zh":"东北风；（来自东北的）气流/洋流。"},"examples":[{"en":"Sailors watched for a strong northeasterly before leaving port.","zh":"水手们在出港前留意是否有强劲的东北风。"}]},{"partOfSpeech":"adv.","definition":{"en":"Toward the northeast; in a northeast direction.","zh":"向东北；朝东北方向。"},"examples":[{"en":"The storm moved northeasterly along the coast.","zh":"风暴沿着海岸向东北方向移动。"}]}],"synonyms":["northeast","northeastern","NE (abbrev.)"],"phonetic":"/ˌnɔrθˈiːstɚli/","extraExplanation":["在天气预报里，northeasterly wind（东北风）指“风从东北吹来”，而不是“吹向东北”。英语里常用“风从哪里来”来命名方向：a northerly wind=从北方吹来的风。","northeast 与 north-east 都可见；northeasterly 更常出现在气象、航海、地理等较正式的语境。也常见简写 NE（northeast）。"]}
{"word":"northeastern","summary":{"en":"Northeastern means “in/from the northeast” or “related to a northeastern region (often the U.S. Northeast).”","zh":"northeastern 表示“在/来自东北方向（东北部）”，也可指“与某个东北地区有关（常指美国东北部）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in or coming from the northeast; in the direction between north and east.","zh":"位于（或来自）东北方的；朝东北方向的（介于北与东之间）。"},"examples":[{"en":"A cold wind is moving in from the northeastern coast.","zh":"一股冷风正从东北海岸吹来。"},{"en":"Their house is in the northeastern part of the city.","zh":"他们的房子在城市的东北部。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Northeast region (often the northeastern U.S.), its people, or its culture.","zh":"与“东北地区”有关的（常指美国东北部），包括那里的人或文化。"},"examples":[{"en":"She studies northeastern history and politics.","zh":"她研究美国东北部的历史与政治。"},{"en":"Northeastern cities are known for older neighborhoods and public transit.","zh":"美国东北部的城市常以较老的街区和公共交通闻名。"}]}],"synonyms":["northeast","NE","north-eastern"],"phonetic":"/ˌnɔrθˈiːstərn/","extraExplanation":["在英语里，“northeastern”既可以表示纯粹的方向（东北方向/东北部），也常用来指某个地区的“东北部”（比如美国的 Northeast：纽约、波士顿等）。具体指哪一块，要看上下文。","注意拼写：north + eastern → northeastern（合写）。也常见搭配：the northeastern corner/part/region/coast（东北角/东北部/东北地区/东北海岸）。"]}
{"word":"northeasterner","summary":{"en":"A Northeasterner is someone from the northeastern region, especially the northeastern U.S.","zh":"Northeasterner 指来自东北地区的人，尤指美国东北部的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the northeastern part of a country (especially the northeastern United States)","zh":"来自一个国家东北部的人（尤指美国东北部的人）"},"examples":[{"en":"As a Northeasterner, she grew up with snowy winters and coastal storms.","zh":"作为一个美国东北部人，她在多雪的冬天和沿海风暴中长大。"},{"en":"Many Northeasterners are familiar with commuting by train between cities like Boston and New York.","zh":"许多美国东北部人都熟悉在波士顿和纽约等城市之间乘火车通勤。"}]}],"synonyms":["person from the Northeast","New Englander (sometimes, narrower)","Northeast resident"],"phonetic":"/ˌnɔrθˈistərnər/","extraExplanation":["在美国语境里，Northeasterner通常指“美国东北部居民”，常见联想包括：新英格兰（New England，如马萨诸塞、佛蒙特等）与中大西洋部分地区（如纽约、新泽西、宾夕法尼亚东部）——具体范围会因说话人而略有不同。","构词法：north + eastern + -er（表示“……的人”）。类似词有：Southerner（南方人）、Midwesterner（中西部人）、Westerner（西部人）。","如果你想表达“来自中国东北的人”，英语里更常说“someone from Northeast China”或“a person from China’s Northeast”，而不常用Northeasterner。"]}
{"word":"northeasternmost","summary":{"en":"“Northeasternmost” means “the farthest to the northeast.”","zh":"“northeasternmost”表示“最东北的/位于最东北端的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Farthest to the northeast; located at the extreme northeast point or area (in a region, country, map, etc.).","zh":"最东北的；位于某个地区/国家/地图等的最东北端（角落或区域）。"},"examples":[{"en":"Maine is the northeasternmost state in the United States.","zh":"缅因州是美国最东北的州。"},{"en":"The camp is on the island’s northeasternmost tip.","zh":"营地在岛屿最东北端的尖角处。"},{"en":"We stopped at the northeasternmost station on the line.","zh":"我们在这条线路最东北端的车站停下了。"}]}],"synonyms":["most northeastern","farthest northeast","northeastmost","northeastern tip (contextual)"],"phonetic":"ˌnɔrθˈiːstərnˌmoʊst","extraExplanation":["“northeasternmost”是由方位词“northeastern（东北的）”加最高级后缀“-most”构成，用来强调“在东北方向上最远/最极端的位置”。它多见于地理、新闻报道、旅行介绍或地图说明等较正式语境。","在口语中也常用更自然的说法来表达同义：the farthest northeast / the most northeastern / the northeastern tip（最东北端）。"]}
{"word":"northeasters","summary":{"en":"“Northeasters” usually means strong northeast winds or storms, especially U.S. East Coast winter storms (nor’easters).","zh":"“northeasters”通常指来自东北方向的强风或风暴，尤指美国东海岸常见的冬季沿海风暴（nor’easter）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong storm or wind coming from the northeast (especially a coastal winter storm along the U.S. East Coast, often called a “nor’easter”).","zh":"来自东北方向的强风或风暴（尤指影响美国东海岸的冬季沿海风暴，常称为 nor’easter）。"},"examples":[{"en":"The forecast warns that two northeasters could hit the coast this month.","zh":"预报警告本月可能有两场东北风暴影响沿海地区。"},{"en":"After the northeaster, roads were icy and schools closed.","zh":"东北风暴过后，道路结冰，学校停课。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “northeaster”: winds, storms, or weather systems from the northeast direction.","zh":"“northeaster”的复数：来自东北方向的风、风暴或天气系统。"},"examples":[{"en":"Sailors watch for sudden northeasters in early spring.","zh":"水手会留意初春突然出现的东北风。"},{"en":"Northeasters can bring rough seas and heavy rain.","zh":"东北风暴可能带来大浪和暴雨。"}]}],"synonyms":["nor'easters","northeast winds","coastal storms","winter storms"],"phonetic":"/ˌnɔɹˈiːstɚz/","extraExplanation":["在美国英语里，指沿海冬季风暴时更常见的拼写是 **nor’easter**（口语缩写，来自 “northeast” 的地域发音）。这种风暴常伴随强风、暴雪或冷雨，对纽约、新英格兰等地影响很大，新闻里经常出现。"]}
{"word":"northeasts","summary":{"en":"“Northeasts” is the plural of “northeast,” meaning the NE direction or areas located in that direction.","zh":"“northeasts”是“northeast”的复数，指东北方向或位于东北方位的地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “northeast”) the direction halfway between north and east; also, the region or part of a place that lies in that direction.","zh":"（“northeast”的复数）东北方向（介于北与东之间）；也指位于该方向的地区/方位（如某地的东北部）。"},"examples":[{"en":"In winter, cold winds often come from the northeasts.","zh":"冬天，寒风常常从东北方向吹来。"},{"en":"The map shows storms moving in from the northeasts.","zh":"地图显示暴风雨正从东北方向移入。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) relating to the northeast; coming from or located in the northeast.","zh":"（较少用）与东北有关的；来自东北的；位于东北的。"},"examples":[{"en":"Northeast winds brought cooler air.","zh":"东北风带来了更凉爽的空气。"},{"en":"They live in the northeast corner of the city.","zh":"他们住在城市的东北角。"}]}],"synonyms":["NE","northeastern areas","the northeast"],"phonetic":"/ˌnɔrˈiːst/","extraExplanation":["“northeast / NE”常见于天气预报与地图导航。美国英语里“The Northeast”常特指美国东北部（如纽约、波士顿等一带），用作专有名词时通常不用复数。"]}
{"word":"northeastward","summary":{"en":"Northeastward means “toward the northeast,” or describing movement/direction toward the northeast.","zh":"northeastward 表示“朝东北方向”，也可形容“向东北的/朝东北的”方向或移动。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the northeast (in the direction between north and east).","zh":"朝东北方向（介于正北与正东之间的方向）。"},"examples":[{"en":"The storm moved northeastward across the coast.","zh":"暴风雨沿海岸向东北方向移动。"},{"en":"Drive northeastward for about 10 miles to reach the next town.","zh":"向东北方向开大约10英里就到下一个城镇。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving, facing, or located toward the northeast.","zh":"向东北的；朝东北的；位于东北方向的。"},"examples":[{"en":"They took a northeastward route to avoid traffic.","zh":"他们走了一条向东北的路线来避开拥堵。"},{"en":"A northeastward wind brought cooler air.","zh":"一股朝东北的风带来了更凉爽的空气。"}]}],"synonyms":["northeasterly","toward the northeast","NE-ward"],"phonetic":"/ˌnɔrθˈiːstwɚd/","extraExplanation":["这个词由“northeast（东北）+ -ward（朝……方向）”构成；-ward常见于方位表达，如 northward（向北）、seaward（向海）、homeward（回家）。在美式英语中，-ward 和 -wards 都能见到，但 -ward 更常见、更偏正式/书面一些。"]}
{"word":"northeastwardly","summary":{"en":"“Northeastwardly” means moving or pointing toward the northeast, most often used as an adverb in formal or geographic writing.","zh":"“northeastwardly”表示“朝东北方向地/的”，多用于较正式的地理、路线或气象描述中。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a direction toward the northeast.","zh":"朝东北方向地；向东北地。"},"examples":[{"en":"The storm moved northeastwardly across the coast.","zh":"暴风雨朝东北方向沿着海岸移动。"},{"en":"They continued northeastwardly after crossing the river.","zh":"他们过河后继续向东北方向前进。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a direction or orientation toward the northeast (less common; often written as “northeastward”).","zh":"朝向东北的；指向东北的（较少见，常写作 northeastward）。"},"examples":[{"en":"The map showed a northeastwardly route out of the valley.","zh":"地图显示有一条朝东北方向离开山谷的路线。"},{"en":"A northeastwardly wind brought cooler air.","zh":"一阵偏东北的风带来了更凉爽的空气。"}]}],"synonyms":["northeastward","toward the northeast","northeastwards"],"phonetic":"/ˌnɔrθˈiːst.wɚd.li/","extraExplanation":["“northeastwardly”在现代英语中比较少见，更常用的是“northeastward”（美式常见）或“north-eastwards / northeastwards”（英式常见）。","构词上是 northeast（东北）+ -ward（朝……方向）+ -ly（副词/形容词后缀）。用于描述移动方向、路线、风向、洋流等，语体偏书面或地理/气象表达。"]}
{"word":"northeastwards","summary":{"en":"An adverb meaning “toward the northeast.”","zh":"表示“朝东北方向”的副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the northeast; in a northeast direction.","zh":"朝东北方向；向东北。"},"examples":[{"en":"The storm moved northeastwards across the coast.","zh":"暴风雨向东北方向穿过海岸移动。"},{"en":"Walk northeastwards for about ten minutes, and you’ll see the museum.","zh":"朝东北方向走大约十分钟，你就会看到博物馆。"}]}],"synonyms":["northeastward","toward the northeast"],"phonetic":"/ˌnɔrθˈistwɚdz/","extraExplanation":["“northeastwards”在英式英语中更常见；美式英语里更常用“northeastward”。含义相同，只是拼写/用法偏好不同。","常用于地图、新闻播报、天气预报、航海与旅行路线说明等语境，表达“朝某个方向移动/延伸”。也可用来描述趋势（如价格、人口等）在地图上的“向东北方向发展”。"]}
{"word":"northen","summary":{"en":"“Northen” is usually a misspelling of “northern,” meaning “related to the north.”","zh":"“northen” 通常是 “northern” 的误拼，意思是“北方的；与北方有关的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Spelling note) This is usually a misspelling of “northern,” meaning related to the north.","zh":"（拼写提示）这通常是对 “northern” 的误拼，意思是“北方的；与北方有关的”。"},"examples":[{"en":"I think you mean “northern,” not “northen.”","zh":"我想你想写的是 “northern”，不是 “northen”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located in, coming from, or relating to the north or the northern part of a place.","zh":"位于北方的；来自北方的；与某地北部有关的。"},"examples":[{"en":"Northern California has a cooler climate than the south.","zh":"加州北部的气候比南部更凉爽。"},{"en":"They moved to a northern city for work.","zh":"他们为了工作搬到了一个北方城市。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or people from the north, especially within one country.","zh":"北方人（尤指同一国家内部来自北方的人）。"},"examples":[{"en":"In the story, the Northerners speak with a different accent.","zh":"在故事里，北方人说话带着不同的口音。"}]}],"synonyms":["northerly","northward","arctic (in some contexts)"],"phonetic":"/ˈnɔrðərn/","extraExplanation":["“northen” 不是常见或标准拼写；标准拼写是 “northern”。如果你想表达“北方的”，请用 northern。","常见搭配：Northern Hemisphere（北半球）、Northern Lights（北极光）、northern border（北部边境）。"]}
{"word":"northeners","summary":{"en":"“Northerners” means people from the northern part of a place (correct spelling: northerners).","zh":"“northerners”指“北方人；来自某地北部的人”（你写的 northeners 通常是拼写错误）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who come from, live in, or identify with the north part of a country or region","zh":"北方人；来自/居住在/认同某个国家或地区北部的人"},"examples":[{"en":"In the U.S., many Northerners supported the Union during the Civil War.","zh":"在美国内战期间，许多北方人支持联邦。"},{"en":"Northerners and Southerners sometimes have different accents and food traditions.","zh":"北方人和南方人有时口音和饮食传统不同。"}]}],"synonyms":["people from the North","northern residents","northern people"],"phonetic":"/ˈnɔrðɚnɚz/","extraExplanation":["你输入的 **northeners** 常见是拼写错误；标准拼写是 **northerners**（northern + -er + -s）。","在不同国家语境里含义会变化：在美国常指“北方（Northern states）的人”；在英国有时指英格兰北部（the North）的居民；在中国语境中常用来指“北方人”。使用时可以根据上下文加上具体国家/地区以避免误解（e.g., Northerners in Italy）。"]}
{"word":"norther","summary":{"en":"Norther most commonly means a strong cold wind from the north, especially in the U.S. (often Texas).","zh":"norther 最常指（尤指美国中南部）从北方吹来的强冷风/北风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, cold wind that blows from the north, especially in the central and southern United States (often bringing a sudden drop in temperature).","zh":"（尤指美国中南部常用）北风；（常伴随气温骤降的）强冷风。"},"examples":[{"en":"A norther swept in overnight and the temperature dropped 20 degrees.","zh":"一股北风夜里突然袭来，气温降了20度。"},{"en":"After the norther, the sky turned clear and bright.","zh":"北风过后，天空变得晴朗明亮。"}]},{"partOfSpeech":"adj.","definition":{"en":"coming from the north; northerly (rare; more common: “northern” or “northerly”).","zh":"来自北方的；北面的（较少用；更常见为 northern / northerly）。"},"examples":[{"en":"A cool norther breeze made the evening comfortable.","zh":"一阵凉爽的北面微风让傍晚很舒服。"}]}],"synonyms":["north wind","northerly wind","cold front","northerly"],"phonetic":"/ˈnɔrðər/","extraExplanation":["“norther”在美国口语里很有地域色彩，常见于德州（Texas）及周边地区的天气描述，指冷空气南下带来的强劲北风。","你可能还会看到“blue norther”（蓝色北风）：强调冷锋过境后天空突然变得清澈湛蓝，但气温会猛降。","拼写提醒：如果你想表达“北方的/北部的”，更常用的是“northern”；“norther”更像一个天气名词。"]}
{"word":"northered","summary":{"en":"“Northered” is a rare past form meaning “went/moved north” (or “moved something north”).","zh":"“northered”很少见，表示“向北走/向北移动”（或“把某物往北移动”）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Rare) Simple past tense / past participle of “norther”: to move or travel northward; to head north.","zh":"（少见）动词 norther 的过去式/过去分词：向北移动或旅行；北上。"},"examples":[{"en":"After leaving Denver, we northered toward Wyoming.","zh":"离开丹佛后，我们一路北上前往怀俄明州。"},{"en":"The explorers northered along the coast for three days.","zh":"探险队沿海岸向北行进了三天。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To steer, drive, or move something northward.","zh":"（少见）把某物朝北方引导/驱动/移动。"},"examples":[{"en":"The captain northered the ship to avoid the storm.","zh":"船长把船往北驶去以避开风暴。"},{"en":"They northered the herd to higher ground.","zh":"他们把牛群往北赶到更高的地方。"}]}],"synonyms":["went north","headed north","moved north","traveled northward","steered north"],"phonetic":"/ˈnɔrðərd/","extraExplanation":["“northered”在现代英语里非常少见，多数情况下人们会直接说“went north / headed north / moved north”。","如果你想表达“北方的”，常用词是“northern”（例如：northern cities 北方城市）。","名词“a norther”在美国（尤其得州等地）可指“北风/强冷空气（冷锋）”。因此在一些地区性写法里，相关动词也可能被用来描述“冷空气来袭”，但这不是主流用法。"]}
{"word":"northering","summary":{"en":"“Northering” is a rare word meaning “moving/heading north” or “a movement toward the north.”","zh":"“northering”是很少见的词，可指“朝北移动的/向北的”，也可指“向北移动（的趋势/方向）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) moving or heading toward the north; northward.","zh":"（罕见/古旧）向北移动的；朝北的。"},"examples":[{"en":"As the wind shifted, the ship kept a northering course.","zh":"风向改变后，船仍保持朝北的航向。"},{"en":"The birds began a slow northering flight at dawn.","zh":"黎明时分，鸟群开始缓慢地向北飞行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of moving northward; a northward trend or direction.","zh":"（罕见）向北移动的行为；北向的趋势或方向。"},"examples":[{"en":"Their northering continued despite the rough weather.","zh":"尽管天气恶劣，他们仍继续向北行进。"}]}],"synonyms":["northward","northerly","heading north"],"phonetic":"/ˈnɔrðərɪŋ/","extraExplanation":["“northering”在现代英语里很少见，很多时候人们其实想写的是：\n1) “northern”（北方的），如 “northern cities”；\n2) “northward”（向北的/向北地）；\n3) “northing”（测量/地图中的“北向坐标/北距”，常用于地理信息与测绘）。如果你告诉我句子语境，我可以帮你判断应该用哪一个更自然。"]}
{"word":"northerlies","summary":{"en":"“Northerlies” means winds coming from the north, often associated with colder weather.","zh":"“northerlies”指北风（从北方吹来的风），常与降温等天气变化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"winds that blow from the north (often bringing colder air).","zh":"北风；从北方吹来的风（常带来较冷的空气）。"},"examples":[{"en":"The northerlies brought a sharp drop in temperature overnight.","zh":"北风使气温在夜间骤降。"},{"en":"Sailors waited for the northerlies to ease before leaving the harbor.","zh":"水手们等北风减弱后才离港。"}]}],"synonyms":["north winds","northerly winds","cold winds"],"phonetic":"/ˈnɔrðərliːz/","extraExplanation":["“northerlies”是复数名词，来自形容词/名词“northerly”（北方的；北风）。在天气预报、航海、航空等语境里很常见，用来概括一段时间内持续的“北向来风”。","在不同地区，“northerlies”常带有典型联想：例如在北半球很多地方，北风往往意味着冷空气南下、天气转凉；在南半球的某些沿海地区，北风也可能与特定季节的干热或海况变化相关，具体感受取决于当地气候。"]}
{"word":"northerliness","summary":{"en":"Northerliness means the quality of being northern or having a northern feel or character.","zh":"northerliness 指“北方性/北方气息”，即具有北方的方位特征或北方印象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being in the north, coming from the north, or having a “northern” character.","zh":"北方性；来自北方的特征；（带有）北方气质。"},"examples":[{"en":"The town’s architecture has a quiet northerliness, shaped by long winters.","zh":"这座城镇的建筑带着一种安静的北方性，是漫长冬季塑造的。"},{"en":"In her writing, a sense of northerliness appears in the crisp air and pale light.","zh":"在她的文字里，“北方气息”体现在清冽的空气和苍白的光线中。"}]}],"synonyms":["northernness","northern character","northness","a northern feel"],"phonetic":"/ˈnɔrðɚlinəs/","extraExplanation":["“northerliness”不算常用词，更常见的表达是“northern character/feel”或“northernness”。它由形容词“northerly（北方的/来自北方的）”加名词后缀“-ness”构成。","在文学或描写性写作中，它有时不只指地理方位，还可能暗示人或景物带有“北方印象”：清冷、克制、光线偏淡、季节更严酷等（具体取决于语境，并非固定含义）。"]}
{"word":"northerly","summary":{"en":"Northerly usually means ‘from the north’ (especially a wind), and it can also mean ‘a north wind’ or ‘toward the north.’","zh":"northerly 通常指“来自北方的”（尤指风），也可指“北风”或“向北地/朝北地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"From the north; toward, near, or coming from the north (often used about wind or direction).","zh":"北方的；向北的；来自北方的（常用于风向或方向）。"},"examples":[{"en":"A northerly wind brought colder weather overnight.","zh":"一阵北风让夜里天气变冷了。"},{"en":"They drove in a northerly direction toward the mountains.","zh":"他们朝北方方向开车去山里。"}]},{"partOfSpeech":"n.","definition":{"en":"A wind that blows from the north.","zh":"北风（从北方吹来的风）。"},"examples":[{"en":"The forecast says a strong northerly will arrive this evening.","zh":"预报说今晚会有强劲的北风到来。"},{"en":"Fishermen stayed in port because of the northerly.","zh":"因为北风，渔民留在港口没有出海。"}]},{"partOfSpeech":"adv.","definition":{"en":"Toward the north; in a way that goes north.","zh":"向北地；朝北地。"},"examples":[{"en":"The storm moved northerly across the coast.","zh":"风暴沿着海岸向北移动。"}]}],"synonyms":["northern (adj., often for regions)","northward (adv., toward the north)","from the north (phrase)"],"phonetic":"/ˈnɔrðɚli/","extraExplanation":["“northerly”在天气预报里非常常见，通常指“从北方吹来”的风（a northerly wind）。注意它和“northward”(向北)的区别：northerly 强调“来自北方/偏北”，northward 更强调“朝北的方向移动”。","相关词：northern（北方的，强调地区/位置，如 northern states），northbound（向北行驶的，多用于交通）。"]}
{"word":"northern","summary":{"en":"Northern most commonly means “in or toward the north” and can also refer to the Northern Hemisphere or to people from the North in certain contexts.","zh":"“northern”最常指“北方的/朝北的”，也可指“北半球的”，或在特定语境中指“北方人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in, coming from, or related to the north; toward the north.","zh":"北方的；来自北方的；与北方有关的；朝北的。"},"examples":[{"en":"It’s colder in the northern part of the country.","zh":"这个国家的北部更冷。"},{"en":"A northern wind can bring snow.","zh":"北风可能带来降雪。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Northern Hemisphere (the half of Earth north of the equator).","zh":"（与）北半球有关的（赤道以北的半个地球）。"},"examples":[{"en":"July is summer in the Northern Hemisphere.","zh":"七月在北半球是夏天。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the northern part of a country or region (often used in specific historical or cultural contexts).","zh":"北方人；来自某国或某地区北部的人（常用于特定历史或文化语境）。"},"examples":[{"en":"During the American Civil War, some Southerners called people from the North “Northerners.”","zh":"在美国内战时期，一些南方人把北方人称为“Northerners”。"}]}],"synonyms":["north","northward","northerly"],"phonetic":"/ˈnɔɹðɚn/","extraExplanation":["“northern”常与地理区域搭配：the northern coast（北部海岸）、Northern Europe（北欧）。当它出现在专有名词中（如 Northern Ireland），通常要大写首字母。","文学与常见意象中，“the North / northern”有时会联想到寒冷、荒野、距离与边界等氛围（具体含义取决于作品与文化背景）。"]}
{"word":"northern ireland","summary":{"en":"Northern Ireland is a country within the UK on the island of Ireland, with Belfast as its capital.","zh":"北爱尔兰是英国的一部分，位于爱尔兰岛上，首府为贝尔法斯特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country that is part of the United Kingdom, located in the northeast of the island of Ireland; its capital is Belfast.","zh":"北爱尔兰：英国的一部分，位于爱尔兰岛东北部；首府为贝尔法斯特。"},"examples":[{"en":"Belfast is the largest city in Northern Ireland.","zh":"贝尔法斯特是北爱尔兰最大的城市。"},{"en":"She grew up in Northern Ireland and later moved to London.","zh":"她在北爱尔兰长大，后来搬到伦敦。"},{"en":"Northern Ireland shares a border with the Republic of Ireland.","zh":"北爱尔兰与爱尔兰共和国接壤。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) The people, society, or culture of Northern Ireland.","zh":"（非正式）北爱尔兰的人群、社会或文化。"},"examples":[{"en":"The music reflects Northern Ireland’s history and traditions.","zh":"这些音乐反映了北爱尔兰的历史与传统。"},{"en":"Food in Northern Ireland often features local potatoes and seafood.","zh":"北爱尔兰的饮食常常以本地土豆和海鲜为特色。"}]}],"synonyms":["NI","Ulster (partly; informal and not exact)"],"phonetic":"/ˌnɔɹðɚn ˈaɪɚlənd/","extraExplanation":["“Northern Ireland”通常在正式写作中大写；缩写常见为“NI”。","北爱尔兰的历史背景较复杂，常会涉及英国与爱尔兰的政治关系，以及社区认同（例如“unionist/loyalist”和“nationalist/republican”等词）。在讨论相关话题时，用词保持中立、尊重不同立场会更合适。","文学与文化中常见的相关地名与作品包括：贝尔法斯特（Belfast）、巨人之路（Giant’s Causeway），以及与北爱社会与历史有关的当代小说、诗歌与新闻写作。"]}
{"word":"northerner","summary":{"en":"A “Northerner” is someone from the north of a country or region; in U.S. history it often refers to people from the Northern states (especially around the Civil War).","zh":"“northerner”指来自或居住在某个国家/地区北部的人；在美国历史语境中常指（尤其南北战争时期的）北方各州人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who comes from, lives in, or is associated with the northern part of a country or region","zh":"北方人；来自（或居住在）某个国家/地区北部的人"},"examples":[{"en":"She’s a Northerner, so she wasn’t used to the humid southern summers.","zh":"她是北方人，所以不太习惯南方潮湿的夏天。"},{"en":"In the U.S., “Northerner” often means someone from the Northern states, especially in historical contexts.","zh":"在美国，“Northerner”常指北方各州的人，尤其在历史语境中更常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially U.S. history) a person from the Northern states during the American Civil War period","zh":"（尤指美国历史）南北战争时期来自北方各州的人（相对“Southerner”而言）"},"examples":[{"en":"The novel portrays the tensions between Southerners and Northerners during the Civil War.","zh":"这部小说描写了南北战争期间南方人与北方人之间的紧张关系。"},{"en":"Some Northerners supported abolition, while others opposed it.","zh":"一些北方人支持废奴，而另一些人反对。"}]}],"synonyms":["northern resident","person from the north"],"phonetic":"/ˈnɔrðərnər/","extraExplanation":["“Northerner”是由 north + -er 构成的名词，-er 表示“……的人/与……有关的人”。常见对应词是“Southerner（南方人）”。","在不同国家语境里，“北方/南方”可能带有地域文化刻板印象（如口音、饮食、性格），使用时注意场合与语气，避免标签化。"]}
{"word":"northerners","summary":{"en":"“Northerners” means people from the northern part of a place; in U.S. history it often refers to people from the Northern states (vs. Southerners).","zh":"“northerners”指某地北部的人；在美国历史语境中常指北方各州的人（与南方人相对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who come from or live in the northern part of a country or region.","zh":"北方人；来自或居住在某个国家或地区北部的人。"},"examples":[{"en":"Many northerners travel south in winter for warmer weather.","zh":"许多北方人会在冬天去南方旅行，享受更温暖的天气。"},{"en":"In the story, the northerners and southerners speak with different accents.","zh":"在故事里，北方人和南方人说话的口音不同。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in the U.S. context) People from the Northern states, particularly during or after the American Civil War.","zh":"（尤其在美国语境中）北方各州的人，特别指美国内战时期及之后的“北方人”（与“南方人”相对）。"},"examples":[{"en":"The novel describes tensions between Southerners and Northerners after the war.","zh":"这部小说描写了战后南方人与北方人之间的紧张关系。"},{"en":"Some families were divided, with one brother fighting for the Northerners.","zh":"有些家庭被分裂了，比如一个兄弟为北方阵营作战。"}]}],"synonyms":["people from the North","northern residents","Northeners (common misspelling)"],"phonetic":"/ˈnɔrðərnərz/","extraExplanation":["在英语里，northerner 是可数名词，复数是 northerners。一般也可以说 people in the North / people from the North，更中性、更不带标签。","美国文化中，Northerners（常大写）常与 Southerners 对比，涉及历史（美国内战）与地区文化差异；在当代使用时要注意语气，避免把地区差异变成刻板印象。"]}
{"word":"northernize","summary":{"en":"Northernize means to make something more “northern” or adapted to northern conditions; less commonly, to become more northern.","zh":"Northernize 指使某物更具“北方”特征或更适应北方环境；较少见时也指变得更北方化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something more northern in character, style, or location; to adapt something to northern conditions","zh":"使……更具北方特征；使……北方化；使适应北方环境/条件"},"examples":[{"en":"The city tried to northernize its tourism image by highlighting winter festivals and snowy landscapes.","zh":"这座城市试图通过主打冬季节庆和雪景来让旅游形象更“北方化”。"},{"en":"Some crops must be northernized before they can grow well in colder climates.","zh":"有些作物在寒冷气候中要先“北方化”（适应寒冷）才能长得好。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become more northern in character or to move toward the north (less common)","zh":"变得更具北方特征；向北移动（较少见）"},"examples":[{"en":"As the industry expanded, the workforce gradually northernized.","zh":"随着产业扩张，劳动力逐渐向北方集中（或更具北方特征）。"}]}],"synonyms":["make more northern","adapt to northern conditions","move northward","northward shift"],"phonetic":"/ˈnɔɹðɚˌnaɪz/","extraExplanation":["“northernize”并不是高频词，更常见的表达是：make something more northern / adapt to northern conditions / move northward。它的构词方式和 Americanize、modernize 类似：-ize 表示“使……化/使成为……”。","在历史或文化讨论里，它有时指政策、人口或文化向北方倾斜（例如资源、语言特征、生活方式），但具体含义通常要看语境。"]}
{"word":"northernly","summary":{"en":"“Northernly” is usually a nonstandard spelling of “northerly,” meaning ‘from/toward the north’ (often for winds or directions).","zh":"“northernly”通常是不规范的拼写，更标准的是“northerly”，表示“来自北方/朝北”（常用于风向或方向）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled: northerly) Coming from, toward, or located in the north.","zh":"（常见拼写：northerly）来自北方的；朝北的；位于北方的。"},"examples":[{"en":"A northerly wind brought colder air.","zh":"北风带来了更冷的空气。"},{"en":"They took a northerly route to avoid traffic.","zh":"他们走了一条偏北的路线来避开拥堵。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Commonly spelled: northerly) In a northerly direction; toward the north.","zh":"（常见拼写：northerly）向北；朝北地。"},"examples":[{"en":"The birds flew northerly as the weather cooled.","zh":"天气转凉时，鸟儿向北飞去。"},{"en":"Keep walking northerly until you reach the river.","zh":"一直朝北走，直到你到达那条河。"}]},{"partOfSpeech":"n.","definition":{"en":"A wind coming from the north (often used in weather reports).","zh":"北风（常用于天气预报/气象语境）。"},"examples":[{"en":"The forecast says a strong northerly will arrive tonight.","zh":"预报说今晚会有强劲的北风。"}]}],"synonyms":["northerly","northward","from the north","northern (in some contexts)"],"phonetic":"/ˈnɔrðərli/","extraExplanation":["“northernly”在现代英语里通常被视为拼写错误或不常见变体；更标准、更常用的形式是“northerly”。","“northern”更常表示“北方的/北部的”（如 northern countries 北方国家），而“northerly”更常用于方向、路线或风向（a northerly wind）。"]}
{"word":"northernmost","summary":{"en":"“Northernmost” means the farthest north in a place or region.","zh":"“Northernmost”表示“最北的、最北端的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Farthest to the north; at the most northern position in a place or area.","zh":"最北的；位于某地最北端的。"},"examples":[{"en":"Alaska is the northernmost state in the U.S.","zh":"阿拉斯加是美国最北的州。"},{"en":"We stayed in the northernmost room because it was the quietest.","zh":"我们住在最北边的房间，因为那里最安静。"}]}],"synonyms":["most northern","furthest north","northmost"],"phonetic":"/ˈnɔrðərnˌmoʊst/","extraExplanation":["词形：northern（北方的）+ -most（最……的）。常用于地理、地图、新闻写作中，描述“最北端”的位置。","同类表达还有：southernmost（最南端）、easternmost（最东端）、westernmost（最西端）。在正式写作中常与“point / tip / part / region / state / island”等名词搭配。"]}
{"word":"northernness","summary":{"en":"“Northernness” means the quality of being northern, in place, climate, culture, or vibe.","zh":"“northernness”指“北方性/北方特征”，可指地理、气候、文化或整体氛围上的偏北特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being northern (in location, climate, culture, or character)","zh":"“北方性；北方特征”：指在地理位置、气候、文化或气质上呈现“偏北/像北方”的特质"},"examples":[{"en":"You can feel the northernness of the town in its long winters and early sunsets.","zh":"从漫长的冬季和很早的日落中，你能感受到这座小镇的“北方性”。"},{"en":"The novel’s northernness comes through in its quiet mood and stark landscapes.","zh":"这部小说的“北方气质”体现在它安静的氛围和冷峻的风景描写里。"},{"en":"Her accent has a slight northernness to it.","zh":"她的口音带着一点北方味。"}]}],"synonyms":["northerliness","the feel of the North","northern character","northern flavor"],"phonetic":"/ˈnɔɹðɚnnəs/","extraExplanation":["“northernness”是可理解但不算常见的抽象名词；更常见的说法有“the North”（北方地区）、“northern character/feel/flavor”（北方特征/感觉/味道）、或较少见但更“词典化”的“northerliness”。","它既可指客观地理与气候（更北、更冷、日照短），也可指主观氛围与文化联想（如“清冷、克制、严峻”的感觉）。具体含义通常由上下文决定。"]}
{"word":"northerns","summary":{"en":"“Northerns” usually means people from the north or the northern parts of a place (plural), though “northerners” is more common for people.","zh":"“northerns”通常指“北方人”或“北部地区”（复数），但表示“北方人”时更常用“northerners”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from the north; residents of a northern region (plural).","zh":"北方人；来自北方地区的居民（复数）。"},"examples":[{"en":"In winter, northerns often have more experience driving on snow and ice.","zh":"在冬天，北方人通常更有在雪地和结冰路面驾驶的经验。"},{"en":"The festival brings together southerns and northerns from across the country.","zh":"这个节日把全国各地的南方人和北方人聚在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"Northern areas or parts of a place (plural), especially when contrasting with the south.","zh":"北部地区；某地的北部（复数），常与南部对比使用。"},"examples":[{"en":"Rain is common in the northerns, while the south stays warmer and drier.","zh":"北部地区经常下雨，而南部更温暖干燥。"},{"en":"They traveled through the northerns before heading toward the coast.","zh":"他们先穿过北部地区，然后前往海岸。"}]}],"synonyms":["northerners","people from the North","northern residents","the North","northern regions"],"phonetic":"/ˈnɔrðərnz/","extraExplanation":["“northerns”本身在日常英语里不算最常见的写法：更常见的是用 **northerners** 表示“北方人”，或用 **the North / northern regions / the northern part(s)** 表示“北部地区”。","在美国历史语境里，**Northerners**（常大写）可特指南北战争时期“北方各州的人”，与 **Southerners**（南方人）对比。文学和历史叙述中常见这种用法。"]}
{"word":"northers","summary":{"en":"Northers are strong (often cold) winds from the north; less commonly, they can mean people from the north.","zh":"northers 指从北方吹来的强风（常带寒意）；较少情况下也可指北方人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong wind (often cold) that blows from the north; a northerly wind","zh":"（常指寒冷的）北风；从北方吹来的强风"},"examples":[{"en":"A sudden norther brought freezing air overnight.","zh":"一阵突如其来的北风在夜里带来了刺骨的寒气。"},{"en":"Fishermen stayed in port because of the northers.","zh":"因为北风劲吹，渔民留在港口没有出海。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person from the northern part of a country or region","zh":"（较少用）北方人；来自北部地区的人"},"examples":[{"en":"As a norther, she wasn’t used to the humid coastal summers.","zh":"作为北方人，她不太习惯沿海潮湿的夏天。"}]}],"synonyms":["northerly wind","north wind","cold front (contextual)","northerner (for people)"],"phonetic":"/ˈnɔrðər/","extraExplanation":["“norther(s)”在美式英语里常见于美国南部/墨西哥湾沿岸（如得州）语境，特指秋冬季节突然南下的冷空气与强北风（有时也写作“blue norther”）。这种风会让气温快速下降，影响航海、放牧和出行。"]}
{"word":"northest","summary":{"en":"“northest” is usually a misspelling of “northeast,” meaning the direction or region between north and east.","zh":"“northest”通常是“northeast”的拼写错误，表示东北方向或东北地区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) The correct spelling is “northeast”: the direction between north and east, or the part of an area/country that lies in that direction.","zh":"（常见拼写错误）正确拼写是“northeast”：东北方向（介于北与东之间），或位于该方向的地区。"},"examples":[{"en":"We drove northeast toward Boston.","zh":"我们开车向东北方向驶向波士顿。"},{"en":"She’s from the northeast of China.","zh":"她来自中国东北地区。"}]},{"partOfSpeech":"adj.","definition":{"en":"“Northeast” can also describe wind or movement coming from the northeast.","zh":"“northeast”也可用来描述“来自东北的”风或移动方向。"},"examples":[{"en":"A northeast wind brought colder air.","zh":"东北风带来了更冷的空气。"},{"en":"The storm moved northeast overnight.","zh":"风暴在夜间向东北方向移动。"}]}],"synonyms":["northeast","NE"],"phonetic":"/ˌnɔrˈθist/","extraExplanation":["“northest”在英语里通常不被当作标准单词使用，多数情况下是把“northeast”（东北）拼错了。","英语里表示方向的词常见构成：north + east → northeast（可作名词/形容词/副词用法，是否连写或带连字符会因风格指南而异；现代英语更常见连写“northeast”。）"]}
{"word":"northfieldite","summary":{"en":"“Northfieldite” is a rare, specialized mineral name, not common in everyday English; it may be an older or local term that needs verification in a mineral database.","zh":"“Northfieldite”是一个少见的专业矿物名称，日常英语中不常用；可能是旧称或地方性名称，通常需要借助矿物数据库核实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reported mineral name (a type of mineral species or variety), but not a widely recognized term in common English dictionaries; it mainly appears in specialized geology/mineral-collecting contexts.","zh":"据报道的一种矿物名称（可能是某种矿物“矿物种”或“变种”），但在常见英语词典中并不常见；主要出现在地质学/矿物收藏等专业语境中。"},"examples":[{"en":"The label says “northfieldite,” so you may need a mineral database to confirm what the specimen actually is.","zh":"标签写着“northfieldite”，所以你可能需要查矿物数据库来确认这块标本到底是什么。"},{"en":"In some collections, older or local mineral names like northfieldite can refer to a material later renamed or reclassified.","zh":"在一些收藏里，像 northfieldite 这种较旧或地方性的矿物名，可能指的是后来被改名或重新分类的材料。"}]}],"phonetic":"/ˌnɔrθˈfiːldaɪt/","extraExplanation":["我无法在常见英语词典与通用语料中确认“northfieldite”的标准定义与化学组成，它很可能是：①地方性/历史性的矿物名；②某矿物的旧称或变种名；③标本贸易中使用的非正式名称。","如果你能提供更多线索（例如产地 Northfield 是否在美国某州、标本标签上的化学式/伴生矿物、颜色与晶形），我可以更精确地帮你对照权威矿物数据库（如 Mindat、IMA 名录）来核对名称与现行分类。"]}
{"word":"northing","summary":{"en":"Northing usually means a coordinate value showing how far north a point is; rarely, it is an old spelling of “nothing.”","zh":"Northing 通常指表示“向北距离/南北位置”的坐标值；少见情况下是旧式或方言写法的“nothing（没有）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the north–south position in a coordinate system; distance measured northward from a reference line (used in surveying, mapping, and GPS)","zh":"（测量/制图/GPS 中）北向坐标；从基准线向北测量的距离（表示南北方向的位置）"},"examples":[{"en":"The map gives the point as Easting 450,200 and Northing 5,413,800.","zh":"地图把该点标为：东向坐标 450,200，北向坐标 5,413,800。"},{"en":"Please record the northing and easting for each sampling site.","zh":"请记录每个采样点的北向坐标和东向坐标。"},{"en":"The GPS showed our northing increasing as we walked north.","zh":"我们向北走时，GPS 显示北向坐标在增加。"}]},{"partOfSpeech":"pron.","definition":{"en":"(rare, old-fashioned) nothing","zh":"（罕见/旧式用法）没有任何东西；无"},"examples":[{"en":"I’ve got northing to add.","zh":"我没什么可补充的。"},{"en":"There was northing left to eat.","zh":"已经没东西可吃了。"}]}],"synonyms":["y-coordinate","northward distance","north coordinate","(rare) nothing"],"phonetic":"/ˈnɔrθɪŋ/","extraExplanation":["在测量与地理信息系统（GIS）里，northing 通常与 easting 成对出现：easting 表示东西方向的位置，northing 表示南北方向的位置。具体“从哪里开始量”（基准线）取决于所用坐标系/投影（例如 UTM 或国家格网）。","把 northing 当作 “nothing” 的拼写，多见于方言转写或旧式写法；在现代标准英语里一般写作 nothing。"]}
{"word":"northings","summary":{"en":"“Northings” are coordinate values showing how far north a point is from a reference line, commonly used in mapping and surveying.","zh":"northings 指地图/测绘中的“北向坐标（值）”，表示某点相对参考线向北的距离，常用于坐标系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the distance of a point north of a reference line (such as the equator or a map’s origin), used in mapping and surveying; often shown as a coordinate value","zh":"（测绘/地图中）北向坐标；表示某点相对参考线（如赤道或坐标原点）向北的距离，常以坐标数值表示"},"examples":[{"en":"Write down the eastings and northings for the point before you move to the next location.","zh":"去下一个地点前，把该点的东向坐标和北向坐标记下来。"},{"en":"The GPS report lists the site’s northings in meters.","zh":"GPS 报告以米为单位列出了该地点的北向坐标。"}]},{"partOfSpeech":"n.","definition":{"en":"values or measurements that indicate how far north different points are (the plural form of northing)","zh":"（northing 的复数）表示不同点“向北距离”的一组数值/测量结果"},"examples":[{"en":"Compare the northings of the two stations to see which one is farther north.","zh":"比较两个测站的北向坐标，看看哪个更靠北。"}]}],"synonyms":["north coordinate","y-coordinate (in many grid systems)","northing values"],"phonetic":"/ˈnɔrðɪŋz/","extraExplanation":["在地图坐标里，northings 常与 eastings（东向坐标）成对出现：eastings 表示向东的距离，northings 表示向北的距离。很多投影坐标系统（如 UTM）会用“米”为单位来表示这两个数值。","注意不要把 northings 和简单的“north（北方）”混用：northings 更偏技术用语，强调“坐标/距离”，常见于测量、工程、地理信息系统（GIS）等语境。"]}
{"word":"northland","summary":{"en":"Northland/northland means the northern region of a place; it can also refer specifically to Northland, a region in northern New Zealand.","zh":"northland/Northland 指某地的北部地区；也可特指新西兰北地（Northland）大区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the northern part of a country or region; the far north in a general sense","zh":"某个国家或地区的北部；泛指“北方/北境”"},"examples":[{"en":"She grew up in the northland, where winters are long and dark.","zh":"她在北方长大，那里冬天漫长而昏暗。"},{"en":"Stories from the northland often feature snow, forests, and hardy people.","zh":"北境故事常常出现雪、森林和坚韧的人们。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) Northland, a region in the far north of New Zealand","zh":"（专有名词）北地（Northland，新西兰最北部的一个大区）"},"examples":[{"en":"We drove up to Northland to visit the Bay of Islands.","zh":"我们开车去北地，参观了岛屿湾（Bay of Islands）。"},{"en":"Northland is known for warm weather and beaches compared with much of New Zealand.","zh":"与新西兰许多地方相比，北地以较温暖的气候和海滩闻名。"}]}],"synonyms":["the north","the northern region","the far north","(literary) the north country"],"phonetic":"/ˈnɔrθ.lænd/","extraExplanation":["“northland”作为普通名词时，常带有文学色彩，给人一种偏远、寒冷、自然环境强烈的“北境”意象。在英文童话、民间传说或诗歌里，它有时并不指具体地名，而是营造氛围（类似中文的“北国”“塞外”）。","在北美语境中，人们有时会用“the Northland”来指美国北部或加拿大边境一带（非正式、带地域感），但并不是严格的行政区名称。"]}
{"word":"northlander","summary":{"en":"A person from a northern region; a “northerner.”","zh":"来自北方地区的人；北方人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in, comes from, or is strongly associated with a northern region (especially the northern part of a country).","zh":"北方人；来自（或与）北方地区密切相关的人（尤指一国的北部）。"},"examples":[{"en":"As a northlander, she’s used to long winters and early sunsets.","zh":"作为北方人，她早已习惯漫长的冬天和很早的日落。"},{"en":"The festival brings together southlanders and northlanders from across the country.","zh":"这个节日把全国各地的南方人和北方人聚到一起。"},{"en":"Many northlanders speak with a distinct accent compared with people in the south.","zh":"许多北方人的口音与南方人相比很有特点。"}]}],"synonyms":["northerner","northern resident","person from the north"],"phonetic":"/ˈnɔrθˌlændər/","extraExplanation":["这个词是比较中性的自称或他称，常用于“南北差异”的语境（气候、饮食、口音、文化习惯等）。","在流行文化中也可能出现专有用法：例如《权力的游戏》(Game of Thrones) 里，“Northmen / northerners”指“北境人”，有时中文讨论中也会用“northlander”来泛指，但并非原作中最固定的词形。"]}
{"word":"northlight","summary":{"en":"“North light” is steady, soft daylight from the north, often preferred by artists for its even illumination.","zh":"“North light（北光）”指来自北面的稳定柔和自然光，常因光线均匀而受艺术家青睐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soft, indirect daylight coming from the north (especially in the Northern Hemisphere), valued because it stays fairly even and does not create harsh shadows.","zh":"（尤指在北半球）来自北面的柔和、间接的自然光；因光线稳定、不易产生强烈阴影而受到重视。"},"examples":[{"en":"Many painters prefer north light in the studio because it is steady and gentle.","zh":"许多画家在画室里更喜欢北光，因为它稳定又柔和。"},{"en":"She set her desk by a north-facing window to get clean north light for reading.","zh":"她把书桌放在朝北的窗边，借助清亮的北光阅读。"}]}],"synonyms":["diffused daylight","indirect light","soft light"],"phonetic":"/ˈnɔrθ ˌlaɪt/","extraExplanation":["“north light / 北光”常用于绘画、摄影、室内设计等语境。传统上（在北半球）北向窗更少被直射阳光照到，因此光线更漫射、色温与亮度变化更小，适合观察颜色与细节。","在南半球情况常相反：更稳定的间接光往往来自南向窗。因此在跨文化/跨地区阅读时，要注意方位与太阳路径的差异。","也常写作 two words：north light；作定语时常见 north-light studio（北光画室）。"]}
{"word":"northman","summary":{"en":"Northman means a man from the north; in historical or literary use, it often refers to a Viking/Scandinavian.","zh":"northman 指“北方人”；在历史或文学语境中常指“维京人/北欧人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man from a northern region or country; someone who comes from the north (often relative to the speaker).","zh":"北方人；来自北方地区或国家的男子（常以说话者所在位置为参照）。"},"examples":[{"en":"He’s a Northman who moved south for work.","zh":"他是个北方人，为了工作搬到了南方。"},{"en":"As a Northman, he wasn’t used to the tropical heat.","zh":"作为北方人，他不太习惯热带的炎热。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/literary) A Viking or Scandinavian warrior/seafarer, especially in medieval contexts.","zh":"（历史/文学）维京人；斯堪的纳维亚的战士或航海者（尤指中世纪语境）。"},"examples":[{"en":"In the saga, the Northmen sailed across the stormy sea.","zh":"在这部传奇故事里，北欧海盗乘风破浪穿越暴风海域。"},{"en":"The monastery feared raids by Northmen.","zh":"修道院害怕遭到维京人的劫掠。"}]}],"synonyms":["northerner","Scandinavian","Viking"],"phonetic":"/ˈnɔrθmən/","extraExplanation":["“Northman”有时是相对概念：在美国语境里，可能指来自北方州的人；在英国或欧洲语境里，则可能指更北边地区的人。","历史/文学用法常与“Vikings（维京人）”重叠；“Northmen”更像一种从外部（如英格兰、法兰克等）对北欧人的称呼。"]}
{"word":"northmost","summary":{"en":"“Northmost” means the farthest north, but “northernmost” is more common.","zh":"northmost 意为“最北的”，但更常用的表达是 northernmost。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Farthest to the north; located or occurring in the most northern position.","zh":"最北的；位于或发生在最北端的位置。"},"examples":[{"en":"The northmost village is hard to reach in winter.","zh":"最北的村庄在冬天很难到达。"},{"en":"We visited the northmost point of the island.","zh":"我们参观了这座岛最北端的地点。"}]}],"synonyms":["northernmost","farthest north","most northerly"],"phonetic":"/ˈnɔrθˌmoʊst/","extraExplanation":["在现代英语里，更常见、更自然的说法是 **northernmost**（“最北的”）。**northmost** 也可以用，但更少见，常见于地理描述、地图文字或较正式的写法。","词形上，英语里用 “-most” 表示“最……的”，例如：**easternmost / westernmost / southernmost / northernmost**。与之类似的还有：**topmost（最上面的）**、**outermost（最外面的）**。"]}
{"word":"northness","summary":{"en":"Northness means the quality of being north or having a northern direction/feeling (often literary).","zh":"Northness 指“北方”的性质或状态，也可指一种“北方气息/氛围”（多见于文学描写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being north; a position or direction toward the north","zh":"“北方”的性质或状态；朝向北方的位置或方向"},"examples":[{"en":"They kept walking with a sense of northness, using the stars to guide them.","zh":"他们带着“向北”的方向感前行，用星星来指路。"},{"en":"The map’s grid helps you check the northness of the road at each turn.","zh":"地图的网格能帮助你在每个转弯处确认道路的“朝北程度”。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary, rare) a northern character, atmosphere, or feeling","zh":"（文学用法，较少见）北方的气质、氛围或感觉"},"examples":[{"en":"The poem captures the northness of the landscape—cold air, long shadows, and quiet light.","zh":"这首诗捕捉了这片风景的“北方气息”——冷冽的空气、长长的影子与安静的光。"},{"en":"There’s a certain northness to her stories: spare, clear, and winter-bright.","zh":"她的故事有一种“北方味”：简洁、清澈，像冬日般明亮。"}]}],"synonyms":["northernness","northerliness","northerly direction","the north"],"phonetic":"/ˈnɔrθnəs/","extraExplanation":["“northness”由“north + -ness”构成，表示“……的性质/状态”。它在日常英语中不算常见，更常见的表达是“northernness”“a northerly direction”“the northern part/feel”。","在文学或描写性写作中，“northness”有时用来营造意象（寒冷、清冽、寂静、偏远等联想），属于较有风格的用词。"]}
{"word":"norths","summary":{"en":"“Norths” most commonly means multiple northern regions or directions; it can also (rarely) be a verb meaning “moves north.”","zh":"“norths”最常见是“多个北部地区/北方方向”；也可（较少见）作动词，表示“向北移动/行进”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “north”: the directions or regions toward the north (often used when talking about multiple places, areas, or countries).","zh":"“north”的复数：多个“北方/北部方向/北部地区”（常用于谈论不同的地方或地区的北方）。"},"examples":[{"en":"The map shows the norths of several European countries.","zh":"这张地图展示了几个欧洲国家的北部地区。"},{"en":"Winters are usually harsher in the norths than in the souths.","zh":"通常北部地区的冬天比南部地区更严酷。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) Third-person singular form of the verb “to north”: to move or travel northward.","zh":"（少见）动词“to north”的第三人称单数：向北移动/向北行进。"},"examples":[{"en":"In spring, the herd norths to find fresh grass.","zh":"春天，这群动物向北迁徙去寻找新鲜的草。"}]}],"synonyms":["northern regions","northern areas","the north (more common)","head north (for the verb meaning)"],"phonetic":"/nɔrθs/","extraExplanation":["“norths”作名词复数时并不如“the north”常见。英语里更常说“the north of + 地方”或“northern areas/regions”。例如：the north of China / northern China。","动词“to north”多见于较文学化或描写自然、航行的语境；日常表达更常用“go north / head north / move north”。"]}
{"word":"northumber","summary":{"en":"“Northumber” is a rare/old form usually meaning “Northumbrian” (from Northumbria). In modern English, use “Northumbrian” or “Northumbria.”","zh":"“Northumber”是少见/古体用法，通常相当于“Northumbrian（诺森伯里亚的/诺森伯里亚人）”。现代英语更常用“Northumbrian”或“Northumbria”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or archaic form related to Northumbria; most often used to mean “Northumbrian” (a person from Northumbria) or “of Northumbria.”","zh":"一个较少见或古体的写法，与英格兰的诺森伯里亚（Northumbria）有关；常用来表示“诺森伯里亚人（Northumbrian）”或“诺森伯里亚的”。"},"examples":[{"en":"In older texts, you may see “Northumber” where modern English would write “Northumbrian.”","zh":"在较老的文本里，你可能会看到用“Northumber”来表示现代英语中的“Northumbrian”。"},{"en":"The poem mentions a Northumber warrior from the northern kingdom.","zh":"这首诗提到一位来自北方王国的诺森伯里亚战士。"}]}],"synonyms":["Northumbrian","of Northumbria"],"phonetic":"/nɔrˈθʌmbɚ/","extraExplanation":["“Northumber”在现代英语中非常不常见。你更可能遇到的是：Northumbria（地名：诺森伯里亚）、Northumbrian（形容词/名词：诺森伯里亚的；诺森伯里亚人）、Northumberland（英格兰郡名：诺森伯兰郡）。","Northumbria 是盎格鲁-撒克逊时期英格兰北部的重要王国之一，所以“Northumbrian”常出现在历史、文学（如古英语背景）或地方文化语境中。","如果你是在地图、姓氏或地名里看到“northumber”，也可能是拼写不完整或截断；你可以提供一句原文，我可以帮你判断更准确的目标词。"]}
{"word":"northumbrian","summary":{"en":"Northumbrian means “from or related to Northumbria (northern England),” and it can also refer to a person from there or the local dialect.","zh":"Northumbrian 指“与英格兰北部诺森布里亚有关的”，也可指当地人或当地英语方言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Northumbria, a historic region in northern England (especially Northumberland and parts of nearby areas).","zh":"与英格兰北部的诺森布里亚（历史地区，主要指诺森伯兰及周边部分地区）有关的。"},"examples":[{"en":"Northumbrian castles and coastal villages attract many visitors.","zh":"诺森布里亚的城堡和海岸村庄吸引了很多游客。"},{"en":"She studies Northumbrian history in the early Middle Ages.","zh":"她研究中世纪早期的诺森布里亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Northumbria or closely associated with that region.","zh":"诺森布里亚人；来自或与诺森布里亚地区密切相关的人。"},"examples":[{"en":"As a Northumbrian, he feels a strong connection to the border landscapes.","zh":"作为诺森布里亚人，他对边境地貌有很深的情感。"}]},{"partOfSpeech":"n.","definition":{"en":"The traditional dialect (varieties) of English spoken in Northumbria; also used more broadly for related northern dialect features.","zh":"诺森布里亚英语方言（英格兰北部诺森布里亚地区的传统英语方言）；也可泛指相关的北方方言特征。"},"examples":[{"en":"Some Northumbrian words are still used in local speech today.","zh":"一些诺森布里亚方言词今天在当地口语中仍在使用。"},{"en":"The poem includes Northumbrian forms to give it a local voice.","zh":"这首诗使用了诺森布里亚方言形式来营造地方特色的声音。"}]}],"synonyms":["Northumbrian dialect","Northumberland (related region)","Geordie (related, but not identical)"],"phonetic":"/nɔrˈθʌm.bri.ən/","extraExplanation":["“Northumbria”源自古英语，意为“亨伯河（Humber）以北之地”。历史上曾是盎格鲁-撒克逊时期的重要王国之一。","语言上，“Northumbrian”有时会让人联想到早期古英语的“诺森布里亚方言”（Old Northumbrian），以及今天英格兰东北部的一些地方口音与用词。"]}
{"word":"northupite","summary":{"en":"Northupite is a rare mineral found in some salt-lake (evaporite) environments.","zh":"Northupite 是一种罕见矿物，常见于某些盐湖相关的蒸发沉积环境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a carbonate–chloride) that is usually white to gray and is found in some salty lake deposits","zh":"一种罕见矿物（碳酸盐—氯化物矿物），通常呈白色到灰色，常见于某些盐湖沉积物中"},"examples":[{"en":"Northupite is a rare mineral that can occur in evaporite deposits near salt lakes.","zh":"Northupite 是一种罕见矿物，可能出现在盐湖附近的蒸发岩沉积中。"},{"en":"The sample was labeled northupite and stored with other carbonate minerals.","zh":"这份标本被标注为 northupite，并与其他碳酸盐矿物一起保存。"}]}],"phonetic":"/nɔrˈθʌp.aɪt/","extraExplanation":["northupite 是以人名命名的矿物名（常见于矿物学中用发现者/研究者的姓氏命名）。","它通常出现在高盐度环境的蒸发沉积（evaporite）中，因此在地质或矿物标本说明里更常见，而不是日常英语。"]}
{"word":"northward","summary":{"en":"Northward means “toward the north,” used as an adverb or adjective to describe direction or movement.","zh":"northward 表示“向北、朝北”，可作副词或形容词，用来描述方向或移动。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the north; in a direction that is north.","zh":"向北；朝北的方向。"},"examples":[{"en":"The birds flew northward for the winter.","zh":"这些鸟为了过冬向北飞去。"},{"en":"We drove northward along the coast.","zh":"我们沿着海岸向北开车。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving or facing toward the north.","zh":"向北移动的；面向北的。"},"examples":[{"en":"A northward wind brought cooler air.","zh":"一阵向北吹的风带来了更凉爽的空气。"},{"en":"They began the northward journey at dawn.","zh":"他们在黎明开始了向北的旅程。"}]}],"synonyms":["north","to the north","northbound","toward the north"],"phonetic":"/ˈnɔrθwɚd/","extraExplanation":["“northward”是由“north（北）+ -ward（朝……方向）”构成，表示“朝北”。在美式英语里，也常见近义形式“northwards”，但“northward”更常用于正式写作、叙述路线或描写迁徙。","在文学或新闻报道中，“northward”常用来营造“远行、迁徙、探索”的画面感，例如“northward expansion（向北扩张）”“northward migration（向北迁徙）”。"]}
{"word":"northwardly","summary":{"en":"“Northwardly” means “toward the north,” usually as an adverb; it’s uncommon and often replaced by “northward.”","zh":"“northwardly”意为“向北地/朝北”，多作副词，用法较少，常用“northward”替代。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the north; in a northward direction.","zh":"向北地；朝北的方向。"},"examples":[{"en":"The birds flew northwardly as the weather cooled.","zh":"天气转凉时，鸟儿朝北飞去。"},{"en":"We drove northwardly along the coast to find a quieter town.","zh":"我们沿海岸向北开车，想找一个更安静的小镇。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located in, facing, or moving toward the north (a less common adjective use).","zh":"位于北方的；朝向北方的（较少见的形容词用法）。"},"examples":[{"en":"The map highlighted the northwardly route through the mountains.","zh":"地图标出了穿越山脉的北向路线。"}]}],"synonyms":["northward","to the north","northwards"],"phonetic":"/ˈnɔrθwɚdli/","extraExplanation":["“northwardly”比较少见；日常英语更常用“northward”（adv./adj.）或“northwards”（英式更常见）来表达“向北”。","“northerly”通常指“来自北方的/偏北的（风等）”，例如：a northerly wind（北风），语感上不等同于“northwardly（向北地）”。"]}
{"word":"northwards","summary":{"en":"Northwards means “toward the north,” used mainly as an adverb and sometimes as an adjective.","zh":"northwards 表示“向北”，主要作副词，也可作形容词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the north; in a northerly direction","zh":"向北；朝北方（的方向）"},"examples":[{"en":"The birds fly northwards in spring.","zh":"鸟儿在春天向北飞。"},{"en":"We drove northwards along the coast.","zh":"我们沿着海岸向北开车。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving or facing toward the north","zh":"向北移动的；朝北的"},"examples":[{"en":"A northwards wind brought cooler air.","zh":"一阵向北的风带来了更凉爽的空气。"}]}],"synonyms":["northward","to the north","north"],"phonetic":"/ˈnɔrθwərdz/","extraExplanation":["“northward”和“northwards”意思相同；“-wards”结尾在英式英语中更常见，但在美式英语里也能看到。口语里常用更简单的“north”。例如：We headed north.（我们往北走。）","在写作中，“northwards”常用于描述旅行、迁徙、探索等叙述场景，语气比单独的“north”更有“方向移动”的画面感。"]}
{"word":"northwest","summary":{"en":"Northwest means the direction between north and west, or something located or moving in that direction.","zh":"Northwest 指“西北方向”，也可指“在西北的/向西北的/来自西北的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the direction between north and west; abbreviated as NW","zh":"西北方向；介于北与西之间（缩写：NW）"},"examples":[{"en":"Turn northwest at the next intersection.","zh":"在下一个路口向西北方向转。"},{"en":"The wind is coming from the northwest.","zh":"风从西北方向吹来。"}]},{"partOfSpeech":"adj.","definition":{"en":"located in, going toward, or coming from the northwest","zh":"位于西北的；朝向西北的；来自西北的"},"examples":[{"en":"They moved to the northwest part of the city.","zh":"他们搬到了城市的西北部。"},{"en":"A northwest route can avoid the traffic downtown.","zh":"走西北方向的路线可以避开市中心的拥堵。"}]},{"partOfSpeech":"adv.","definition":{"en":"toward the northwest","zh":"向西北（方向）"},"examples":[{"en":"The storm is moving northwest.","zh":"风暴正向西北移动。"}]}],"synonyms":["NW","northwesterly (adj./adv.)","northwestward (adv.)"],"phonetic":"/ˌnɔrθˈwɛst/","extraExplanation":["在美式英语里，表示方位的词既可以写作一个词（northwest），也常写作连字符形式（north-west，较少见/更偏英式或旧式用法），缩写通常写 NW。用于地区名称时常大写，例如 the Pacific Northwest（美国“太平洋西北地区”）。"]}
{"word":"northwester","summary":{"en":"“Northwester” most often means a wind from the northwest, or a person/thing from the northwest.","zh":"“northwester”常指“西北风”，也可指“来自西北地区的人或事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"someone or something from the northwest (of a country, region, or area)","zh":"来自西北部的人；来自西北方向/西北地区的事物"},"examples":[{"en":"She’s a northwester who moved to the capital for work.","zh":"她是来自西北地区的人，为了工作搬到了首都。"},{"en":"The northwester accent is easy to recognize in this film.","zh":"这部电影里很容易听出西北地区的口音。"}]},{"partOfSpeech":"n.","definition":{"en":"a wind that blows from the northwest","zh":"西北风"},"examples":[{"en":"A cold northwester swept through the valley overnight.","zh":"一股寒冷的西北风一夜之间扫过山谷。"},{"en":"Sailors watch the sky because a northwester can arrive suddenly.","zh":"水手会观察天空，因为西北风可能突然到来。"}]},{"partOfSpeech":"adj.","definition":{"en":"coming from or related to the northwest","zh":"来自西北的；与西北有关的"},"examples":[{"en":"We drove along the northwester road toward the mountains.","zh":"我们沿着通往群山的西北方向公路开去。"},{"en":"Northwester winds often bring cooler air.","zh":"西北风往往带来更凉的空气。"}]}],"synonyms":["northwest wind","northwesterly","northwestern (adj.)","northwesterner (person)"],"phonetic":"/ˌnɔrθˈwɛstɚ/","extraExplanation":["“northwester”在不同英语地区用法略有差异：在新西兰、澳大利亚等地，它常直接指“西北风”（有时与更常见的 northwesterly 互换）。在北美语境里，表示“来自西北的人/事物”也能用，但更常见的形容词是 northwestern（如 Northwestern University）。","拼写提示：你输入的 northwester 很可能是想写 northwester(n)（名词/形容词）或 northwestern（更常见的形容词）。如果你告诉我句子语境，我可以帮你选最自然的词。"]}
{"word":"northwesterly","summary":{"en":"Northwesterly describes something (especially wind) coming from the northwest, or moving toward the northwest; it can also mean a wind from the northwest.","zh":"northwesterly 常指（尤其是风）从西北吹来的，也可指朝西北方向移动；作名词时指西北风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Blowing from the northwest (often used for winds and weather).","zh":"（风等）来自西北方向吹来的；西北风的。"},"examples":[{"en":"A northwesterly wind brought cooler air overnight.","zh":"一股西北风在夜里带来了更凉的空气。"},{"en":"The forecast says the winds will turn northwesterly this evening.","zh":"天气预报说今晚风向会转为西北风。"}]},{"partOfSpeech":"adv.","definition":{"en":"Toward the northwest; in a northwesterly direction.","zh":"向西北；朝西北方向。"},"examples":[{"en":"The storm moved northwesterly across the coast.","zh":"暴风雨沿着海岸向西北方向移动。"}]},{"partOfSpeech":"n.","definition":{"en":"A wind that blows from the northwest.","zh":"西北风。"},"examples":[{"en":"A strong northwesterly is common after a cold front passes.","zh":"冷锋过境后常见强劲的西北风。"}]}],"synonyms":["northwest","northwestward","northwestwardly","northwest wind"],"phonetic":"/ˌnɔrθˈwɛstərli/","extraExplanation":["在气象英语里，风向的命名规则是“从哪里来”：northwesterly wind 指“从西北吹来”，而不是“吹向西北”。（相对地，a southeasterly wind 就是从东南吹来。）","northwesterly 常用于正式/新闻/天气预报语境；日常口语里也可以说 “a wind from the northwest”。"]}
{"word":"northwestern","summary":{"en":"Northwestern means “in or toward the northwest.” It can describe a place, wind, region, or direction.","zh":"northwestern 表示“在西北的/来自西北的/朝向西北的”，可用来形容地点、风、地区或方向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located in, coming from, or directed toward the northwest (the direction between north and west).","zh":"位于西北的；来自西北的；朝向西北的（介于北与西之间的方向）。"},"examples":[{"en":"A cold northwestern wind blew in overnight.","zh":"一股寒冷的西北风一夜之间刮了进来。"},{"en":"The northwestern part of the country is mostly mountainous.","zh":"这个国家的西北部多为山地。"}]},{"partOfSpeech":"n.","definition":{"en":"The northwest; the direction or area between north and west.","zh":"西北方向；西北地区（位于北与西之间）。"},"examples":[{"en":"The storm moved toward the northwestern.","zh":"暴风雨朝西北方向移动。"},{"en":"They live in the northwestern of the state.","zh":"他们住在该州的西北部地区。"}]}],"synonyms":["northwest","northwesterly"],"phonetic":"/ˌnɔrθˈwɛstərn/","extraExplanation":["“northwestern”常用于地理方位描述，也可用于更抽象的“来自某一地区/方向的”含义，例如：northwestern dialect（西北方言）、northwestern route（西北路线）。","作为专有名词时，可能指美国的 Northwestern University（西北大学），此时通常写作 “Northwestern”，首字母大写，读音不变但含义不同。"]}
{"word":"northwesterner","summary":{"en":"A Northwesterner is someone from the northwest part of a region, often the Northwestern U.S.","zh":"northwesterner 指来自或居住在某地区西北部的人，常指美国西北部地区的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who comes from or lives in the northwest part of a country or region (often the Northwestern United States).","zh":"来自或居住在某个国家或地区西北部的人（常指美国西北部）"},"examples":[{"en":"She’s a Northwesterner, so she’s used to rainy winters.","zh":"她来自西北地区，所以习惯了多雨的冬天。"},{"en":"Many Northwesterners enjoy hiking and outdoor sports.","zh":"许多西北地区的人喜欢徒步和户外运动。"},{"en":"As a Northwesterner, he misses the mountains and the coast.","zh":"作为一个西北地区的人，他想念那里的山脉和海岸。"}]}],"synonyms":["person from the Northwest","Pacific Northwesterner"],"phonetic":"/ˌnɔrθˈwɛstərnər/","extraExplanation":["“Northwesterner”常作专有名词使用（Northwesterner），尤其在指美国“太平洋西北地区”（Pacific Northwest，如华盛顿州、俄勒冈州等）的人时更常见。若只是泛指“西北方向/西北部的人”，在非特定语境也可不大写。","相关区域表达：Pacific Northwesterner（太平洋西北地区的人）、the Northwest（西北地区）。注意它和“northwestern”（adj. 西北的）不同：a northwestern city（一个西北部的城市）。"]}
{"word":"northwests","summary":{"en":"“Northwests” is the plural of “northwest,” most often referring to northwest directions or northwest winds.","zh":"“Northwests”是“northwest”的复数，最常指多个“西北方向”，或（更常见）指“西北风”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the direction between north and west (NW)","zh":"西北方向（介于北与西之间，NW）"},"examples":[{"en":"Head northwest for two miles, then turn left.","zh":"向西北走两英里，然后左转。"},{"en":"A cold front is moving in from the northwest.","zh":"一股冷锋正从西北方向移入。"}]},{"partOfSpeech":"n.","definition":{"en":"a wind blowing from the northwest","zh":"西北风（从西北方向吹来）"},"examples":[{"en":"Strong northwests made the sea rough.","zh":"强劲的西北风让海面变得很汹涌。"},{"en":"In winter, sudden northwests can drop the temperature fast.","zh":"冬天，突来的西北风会让气温迅速下降。"}]},{"partOfSpeech":"adj.","definition":{"en":"from, in, or toward the northwest","zh":"来自/位于/朝向西北的"},"examples":[{"en":"The northwest corner of the park is quieter.","zh":"公园的西北角更安静。"},{"en":"They live in a northwest suburb of the city.","zh":"他们住在城市西北部的郊区。"}]},{"partOfSpeech":"adv.","definition":{"en":"toward or in the northwest","zh":"向西北；在西北方向"},"examples":[{"en":"The storm tracked northwest overnight.","zh":"这场风暴在夜间向西北方向移动。"},{"en":"Look northwest to see the mountains.","zh":"朝西北看就能看到群山。"}]},{"partOfSpeech":"v.","definition":{"en":"to move or turn toward the northwest (rare)","zh":"（较少用）向西北方向移动/转向"},"examples":[{"en":"The ship northwested to avoid the reef.","zh":"船只转向西北以避开暗礁。"}]}],"synonyms":["NW","northwest wind","the northwest"],"phonetic":"/ˌnɔrθˈwɛst/","extraExplanation":["“northwests”常见于复数名词用法，尤其指“西北风（northwest winds）”，例如气象报道或航海语境。","在美国英语里，专有名词“The Northwest / the Pacific Northwest”常指美国西北部地区（如华盛顿州、俄勒冈州一带）；但这里的“northwests”通常不是这个专名的复数。"]}
{"word":"northwestward","summary":{"en":"Northwestward means “toward the northwest” (adverb) or “moving/pointing toward the northwest” (adjective).","zh":"northwestward 表示“向西北”（副词），也可表示“朝向/通往西北的”（形容词）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the northwest (the direction between north and west).","zh":"向西北；朝西北方向。"},"examples":[{"en":"The storm moved northwestward across the coast.","zh":"暴风雨向西北方向穿过海岸。"},{"en":"They drove northwestward to reach the mountains before dark.","zh":"他们开车向西北方向行驶，想在天黑前到达山里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving, facing, or leading toward the northwest.","zh":"向西北的；朝向或通往西北的。"},"examples":[{"en":"We followed the northwestward path along the river.","zh":"我们沿着河边那条通向西北的路径前行。"},{"en":"A northwestward wind brought cooler air.","zh":"一阵偏西北的风带来了更凉爽的空气。"}]}],"synonyms":["toward the northwest","northwestwards","northwesterly (adj.)"],"phonetic":"/ˌnɔrθˈwɛstwɚd/","extraExplanation":["常见写法有两种：northwestward（美式更常见）和 north-westward（较少见、较旧的拼写）。在英式英语里也常见用 towards the northwest / north-westwards 来表达同样意思。","词形规律：在表示“朝某方向”时，很多方向词都可以加 -ward，例如 eastward（向东）、southward（向南）。-ward 常见于较正式、书面或新闻报道（如天气、航行、迁徙）中。"]}
{"word":"northwestwardly","summary":{"en":"“Northwestwardly” means “toward the northwest,” most often used as an adverb.","zh":"“northwestwardly”意为“朝西北方向”，最常用作副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a direction toward the northwest; moving or facing northwest.","zh":"向西北方向；朝西北移动或面向西北。"},"examples":[{"en":"The hikers walked northwestwardly to reach the ridge before sunset.","zh":"徒步者朝西北方向走，想在日落前到达山脊。"},{"en":"The storm system shifted northwestwardly overnight.","zh":"这股风暴系统在夜间向西北方向移动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Located, positioned, or oriented toward the northwest; northwest-facing.","zh":"（较少用）位于/朝向西北的；西北向的。"},"examples":[{"en":"They chose a northwestwardly route to avoid the crowded highway.","zh":"他们选择了一条偏向西北的路线，以避开拥堵的高速。"},{"en":"A northwestwardly wind brought cooler air.","zh":"西北向的风带来了更凉爽的空气。"}]}],"synonyms":["northwestward","toward the northwest","to the northwest"],"phonetic":"/ˌnɔrθˈwɛstwɚdli/","extraExplanation":["这个词由“northwest（西北）+ -ward（朝向……）+ -ly（副词/形容词后缀）”构成。实际使用中，更常见、更自然的说法是 **northwestward**（副词/形容词都可）或 **to the northwest / toward the northwest**。","在天气预报、航海/航空、地理描述里更容易见到这种带方向后缀的词（如 northward, southeastward）。"]}
{"word":"northwestwards","summary":{"en":"Northwestwards means moving or pointing toward the northwest.","zh":"northwestwards 表示“朝西北方向（移动或指向）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the northwest; in a northwest direction.","zh":"向西北；朝西北方向。"},"examples":[{"en":"We drove northwestwards along the coast to reach the small town.","zh":"我们沿着海岸向西北方向开车，去到那个小镇。"},{"en":"The storm is moving northwestwards at about 15 miles per hour.","zh":"风暴正以每小时约15英里的速度向西北方向移动。"}]}],"synonyms":["northwestward","to the northwest","in a northwest direction"],"phonetic":"/ˌnɔrθˈwɛstwərdz/","extraExplanation":["“northwestwards”常见于英式英语；美式英语里更常用“northwestward”。两者意思相同。","词尾“-wards”表示“朝……方向”（如: towards, forwards）。"]}
{"word":"Nortmann","summary":{"en":"“Nortmann” usually refers to a historical Scandinavian/Viking (“Northman”), and it can also be a surname.","zh":"“Nortmann”通常指历史上的北欧人/维京人（“北方人”），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) a Scandinavian person, especially a Viking from Norway/Denmark/Sweden; a “Northman.”","zh":"（历史用语）北欧人，尤指维京人；“来自北方的人”。"},"examples":[{"en":"In medieval chronicles, the Nortmann were often described as raiders from the sea.","zh":"在中世纪编年史中，Nortmann 常被描写为来自海上的劫掠者。"},{"en":"Some stories portray the Nortmann as both fierce warriors and skilled traders.","zh":"一些故事把 Nortmann 描写成既勇猛善战又善于经商的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏（家族名）。"},"examples":[{"en":"Dr. Nortmann will speak at the conference tomorrow.","zh":"Nortmann 医生将于明天在会议上发言。"}]}],"synonyms":["Norseman","Northman","Viking"],"phonetic":"/ˈnɔrθmən/","extraExplanation":["“Nortmann”多见于历史语境或作为拼写变体，接近更常见的“Northman / Norseman”。来源可追溯到中古时期对北欧人的称呼（意为“北方的人”），在讲述维京时代、诺曼人/北欧海盗相关文本中更可能出现。","如果你是在某篇文章、游戏或家谱资料里看到该词，它也可能是专名或姓氏，具体含义需结合上下文确认。"]}
{"word":"nortriptyline","summary":{"en":"Nortriptyline is a prescription tricyclic antidepressant, also used for nerve pain and migraine prevention.","zh":"去甲替林是处方三环类抗抑郁药，也常用于神经痛及偏头痛预防。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (a tricyclic antidepressant) used to treat depression and sometimes nerve pain or to prevent migraines; it affects certain brain chemicals such as norepinephrine","zh":"去甲替林（一种三环类抗抑郁药），用于治疗抑郁症，有时也用于神经性疼痛或预防偏头痛；它会影响大脑中的某些化学物质，如去甲肾上腺素"},"examples":[{"en":"My doctor prescribed nortriptyline to help with my nerve pain at night.","zh":"医生给我开了去甲替林，帮助缓解我晚上出现的神经痛。"},{"en":"Nortriptyline can cause dry mouth, so I keep water nearby.","zh":"去甲替林可能会导致口干，所以我会把水放在身边。"},{"en":"They started nortriptyline at a low dose and increased it slowly.","zh":"他们先从小剂量开始使用去甲替林，然后慢慢加量。"}]}],"synonyms":["Pamelor (brand name)","Aventyl (brand name)"],"phonetic":"/ˌnɔrˈtrɪp.təˌlin/","extraExplanation":["去甲替林是处方药，通常以较低剂量起始并逐步调整；它可能引起嗜睡、口干、便秘等不适，部分人也可能出现心率或心电图方面的影响。","它常被用于“抑郁症”之外的用途（如慢性神经痛、偏头痛预防、睡眠相关问题），这种情况属于医生基于证据与经验的用药选择；是否适合需由医生评估。","与酒精、其他会引起嗜睡的药物、某些抗抑郁药/止痛药等合用可能增加副作用或相互作用风险；如出现严重头晕、心悸、意识异常等应及时就医。"]}
{"word":"norumbega","summary":{"en":"Norumbega is a legendary place-name from early maps, imagined to be a city or rich region in northeastern North America.","zh":"Norumbega 是早期地图中的传说地名，被想象为北美东北部的一座城市或富庶地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a legendary or semi-mythical place in early European maps and writings, thought to be somewhere in northeastern North America (especially New England or Acadia); often described as a “city” or wealthy region.","zh":"（诺伦贝加）早期欧洲地图与记载中的传说地名，被认为位于北美东北部（尤指新英格兰或阿卡迪亚一带）；常被描绘成一座“城市”或富庶地区。"},"examples":[{"en":"Some 16th‑century maps label parts of New England as Norumbega.","zh":"一些16世纪的地图把新英格兰的部分地区标注为 Norumbega。"},{"en":"The story of Norumbega reflects how little Europeans knew about the interior of North America at the time.","zh":"Norumbega 的传说反映了当时欧洲人对北美内陆了解有限。"},{"en":"Local landmarks like the Norumbega Tower keep the name alive even though the “city” was never found.","zh":"像 Norumbega Tower 这样的地标让这个名字流传至今，尽管那座“城市”从未被找到。"}]}],"synonyms":["the (mythical) City of Norumbega","Norumbega (legendary region)"],"phonetic":"/ˌnɔrəmˈbiɡə/","extraExplanation":["“Norumbega”多被认为源自原住民地名（可能来自阿尔冈昆语系），在法语/拉丁语转写中逐渐固定为这一拼写，但具体语源仍有争议。","它常出现在16世纪航海时代的欧洲地图与游记中，属于“未知之地的想象地理”（把零散传闻与误解拼成一个富饶城市/地区）。","在美国文学与地方文化中也会被当作“失落之城/北方传说”的象征；例如梭罗（Henry David Thoreau）在《缅因森林》（The Maine Woods）中提到过“Norumbega”的传说氛围。"]}
{"word":"norward","summary":{"en":"“Northward” means toward the north (adverb) or going/located toward the north (adjective).","zh":"“northward”表示“向北”（副词）或“朝北/位于北方的”（形容词）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the north; in a direction that goes north.","zh":"向北；朝北方（的方向）。"},"examples":[{"en":"We drove northward to escape the heat.","zh":"我们开车向北走，躲避炎热。"},{"en":"The birds migrate northward in spring.","zh":"春天鸟类会向北迁徙。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located in the north; going or facing toward the north.","zh":"位于北方的；朝向北方的。"},"examples":[{"en":"The northward side of the mountain stays cooler.","zh":"山的北侧更凉爽。"},{"en":"They followed a northward route along the coast.","zh":"他们沿着海岸走一条向北的路线。"}]}],"synonyms":["to the north","north","northbound"],"phonetic":"/ˈnɔrθwɚd/","extraExplanation":["“norward”通常被认为是拼写错误，更常见、标准的拼写是 **northward**。","在文学或正式写作里，**northward** 比 “to the north” 更简洁、有方向感（常用于旅行、迁徙、风向等语境）。"]}
{"word":"norwards","summary":{"en":"“norwards” is not standard English; it usually means “northwards” = toward the north.","zh":"“norwards”不是标准拼写，通常指“northwards”，意思是“向北、朝北”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling of “northwards” (toward the north).","zh":"不是标准英语单词，通常是把“northwards”（朝北、向北）拼错了。"},"examples":[{"en":"Did you mean “northwards”? The birds flew northwards for the winter.","zh":"你是不是想写“northwards”？鸟儿为了过冬向北飞去。"},{"en":"On the map, keep moving northwards until you reach the river.","zh":"在地图上，继续向北走，直到你到达那条河。"}]},{"partOfSpeech":"adv.","definition":{"en":"northwards (adv.): toward the north; in a northerly direction.","zh":"northwards（副词）：向北；朝北的方向。"},"examples":[{"en":"We drove northwards along the coast.","zh":"我们沿着海岸向北开车。"},{"en":"The storm is moving northwards.","zh":"暴风雨正在向北移动。"}]},{"partOfSpeech":"adj.","definition":{"en":"northwards (adj.): facing or leading toward the north.","zh":"northwards（形容词）：面向北方的；通向北方的。"},"examples":[{"en":"Take the northwards road out of town.","zh":"走出城镇的那条向北的路。"},{"en":"They began their northwards journey at dawn.","zh":"他们在黎明开始了向北的旅程。"}]}],"synonyms":["northward","to the north","northerly"],"phonetic":"/ˈnɔrθwərdz/","extraExplanation":["“northwards”在美式英语中也常写作“northward”（不带-s）。两者意思基本相同；“northward”更常见一些。","“-wards”是一个表示“朝……方向”的后缀：例如 forwards（向前）、backwards（向后）、homewards（向家）。"]}
{"word":"Norway","summary":{"en":"Norway is a country in Northern Europe; its capital is Oslo.","zh":"Norway 指北欧国家“挪威”，首都是奥斯陆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in Northern Europe on the western side of the Scandinavian Peninsula, known for its long coastline, fjords, and high standard of living; its capital is Oslo.","zh":"挪威：位于北欧斯堪的纳维亚半岛西侧的国家，以漫长海岸线、峡湾和高生活水准闻名；首都是奥斯陆。"},"examples":[{"en":"Norway is famous for its dramatic fjords and northern lights.","zh":"挪威以壮丽的峡湾和北极光闻名。"},{"en":"Oslo is the capital of Norway.","zh":"奥斯陆是挪威的首都。"}]}],"synonyms":["Kingdom of Norway"],"phonetic":"ˈnɔrˌweɪ","extraExplanation":["“Norway”在英语中是专有名词，通常不加冠词（说“in Norway”，而不是“in the Norway”）。","文化小知识：挪威是“斯堪的纳维亚国家”之一（另有瑞典、丹麦）。挪威以峡湾（fjord）、极昼/极夜、以及维京历史（Vikings）在英语语境中常被提及。","词源提示：Norway 来自古诺尔斯语，常被解释为“北方之路/通道”的意思，和其沿海航行的地理特点有关。"]}
{"word":"norway","summary":{"en":"Norway is a country in Northern Europe, well known for fjords and beautiful natural scenery.","zh":"Norway（挪威）是北欧国家，以峡湾等自然风光著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a country in Northern Europe on the western side of the Scandinavian Peninsula, known for fjords, mountains, and a long coastline","zh":"挪威：位于北欧斯堪的纳维亚半岛西侧的国家，以峡湾、山地和漫长海岸线著称"},"examples":[{"en":"Norway is famous for its dramatic fjords.","zh":"挪威以壮丽的峡湾闻名。"},{"en":"She traveled to Norway to see the northern lights.","zh":"她去挪威看极光。"}]}],"synonyms":["Kingdom of Norway"],"phonetic":"/ˈnɔrˌweɪ/","extraExplanation":["“Norway”的常见形容词是 Norwegian（挪威的；挪威人/挪威语）。例如：Norwegian culture（挪威文化）、a Norwegian singer（挪威歌手）。","在文学与旅行写作中，Norway 常与“fjords（峡湾）”“midnight sun（午夜太阳）”“northern lights / aurora（极光）”等意象搭配出现，强调自然景观与高纬度特色。"]}
{"word":"Norwegian","summary":{"en":"Norwegian means connected with Norway, a person from Norway, or the language spoken there.","zh":"Norwegian 指“挪威的/与挪威有关的”、 “挪威人”，也可指“挪威语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"from or related to Norway, its people, or its culture","zh":"挪威的；与挪威、挪威人民或其文化有关的"},"examples":[{"en":"She loves Norwegian music and folk dancing.","zh":"她很喜欢挪威音乐和民间舞蹈。"},{"en":"Norwegian winters are long and cold.","zh":"挪威的冬天漫长而寒冷。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Norway","zh":"挪威人"},"examples":[{"en":"Two Norwegians joined the hiking group.","zh":"有两位挪威人加入了徒步小组。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken in Norway","zh":"挪威语"},"examples":[{"en":"He is learning Norwegian for work.","zh":"他为了工作正在学习挪威语。"},{"en":"This book is translated from Norwegian into English.","zh":"这本书是从挪威语翻译成英语的。"}]}],"synonyms":["from Norway","Norwegian-language"],"phonetic":"/nɔrˈwiːdʒən/","extraExplanation":["“Norwegian”既可指“挪威的/挪威人”，也可指“挪威语”。挪威语有两种官方书面形式：Bokmål（博克马尔）和 Nynorsk（尼诺斯克），日常口语方言差异也比较明显。","“Norwegian”和“Norse”不完全一样：Norse 常用来指古代北欧（尤其维京时代）的语言或文化（如 Old Norse），现代挪威相关一般用 Norwegian。"]}
{"word":"norwegian","summary":{"en":"Norwegian means a person from Norway or something related to Norway (including the language).","zh":"Norwegian 指挪威人，或与挪威有关的事物（也包括挪威语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Norway","zh":"挪威人"},"examples":[{"en":"Many Norwegians speak excellent English.","zh":"许多挪威人英语说得很好。"},{"en":"She is Norwegian, but she lives in California now.","zh":"她是挪威人，但现在住在加州。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Norway, its people, or its language","zh":"挪威的；挪威人的；挪威语的"},"examples":[{"en":"He loves Norwegian culture and history.","zh":"他很喜欢挪威的文化和历史。"},{"en":"Norwegian is closely related to Swedish and Danish.","zh":"挪威语与瑞典语和丹麦语关系很近。"},{"en":"We ate Norwegian salmon for dinner.","zh":"我们晚餐吃了挪威三文鱼。"}]}],"synonyms":["Norwegian (person)","Norwegian (language)"],"phonetic":"/nɔrˈwiːdʒən/","extraExplanation":["“Norwegian”既可以指“挪威人”，也可以指“挪威语”。在英语里说语言时通常直接用专有名词：Norwegian (language)。","挪威有两种官方书面语标准：Bokmål（更常见）和 Nynorsk（使用者较少）。日常口语还有很多地方方言。"]}
{"word":"Norwegians","summary":{"en":"“Norwegians” means people from Norway.","zh":"“Norwegians”指挪威人、来自挪威的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Norway; the citizens or ethnic group of Norway (plural of “Norwegian”)","zh":"挪威人；来自挪威的人（“Norwegian”的复数）"},"examples":[{"en":"Many Norwegians speak English very well.","zh":"许多挪威人英语说得很好。"},{"en":"Norwegians often enjoy outdoor activities like hiking and skiing.","zh":"挪威人常常喜欢徒步和滑雪等户外活动。"}]}],"synonyms":["Norwegian people","people from Norway"],"phonetic":"/nɔrˈwiːdʒənz/","extraExplanation":["“Norwegians”是国籍/族群称呼（demonym），对应国家 Norway（挪威）。单数是 Norwegian（挪威人）。","在英语里，国籍词有时可作形容词（Norwegian food=挪威菜），但“Norwegians”通常只作名词（指人）。"]}
{"word":"norwegians","summary":{"en":"“Norwegians” means people from Norway.","zh":"“Norwegians”指挪威人（来自挪威的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Norway; the citizens or natives of Norway (plural of “Norwegian”)","zh":"挪威人；来自挪威的人（“Norwegian”的复数）"},"examples":[{"en":"Many Norwegians speak English very well.","zh":"很多挪威人的英语说得很好。"},{"en":"Norwegians often enjoy outdoor activities like hiking and skiing.","zh":"挪威人常常喜欢徒步、滑雪等户外活动。"}]}],"synonyms":["Norwegian people","people from Norway"],"phonetic":"/nɔrˈwiːdʒənz/","extraExplanation":["“Norwegian”既可以指“挪威人”（名词），也可以指“挪威的”（形容词），还可以指“挪威语”（语言）。复数“Norwegians”只用于“挪威人”。","在英语里，表示国籍/民族的人称（demonym）常用大写字母开头：Norwegian / Norwegians。"]}
{"word":"norwest","summary":{"en":"Norwest is mainly a historical variant of “northwest/Nor’west” in Canadian contexts, or a proper name used by some North American companies (notably a former U.S. bank).","zh":"Norwest 主要是加拿大语境中“northwest / Nor’west（西北）”的历史拼写变体，也可作一些北美公司使用的专有名称（尤其是一家已更名/并入的美国银行）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Canada, historical) A spelling/variant of “Nor’west,” meaning “northwest,” often linked to the North West Company and people connected with the fur trade in western/northwestern Canada.","zh":"（加拿大历史用法）“Nor’west（西北）”的拼写变体，常与加拿大西部/西北部的毛皮贸易、以及“西北公司（North West Company）”及其相关人物联系在一起。"},"examples":[{"en":"Some museum labels describe the traders as “Norwesters” because they worked for the North West Company.","zh":"一些博物馆说明牌把这些商人称为“Norwesters（西北公司的人）”，因为他们为西北公司工作。"},{"en":"In older writing, “Norwest” can appear as a nonstandard spelling of “northwest.”","zh":"在较早的文字中，“Norwest”有时会作为“northwest（西北）”的非标准拼写出现。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun) A name used by several organizations and brands, especially in North America (e.g., the former Norwest Corporation, a U.S. bank).","zh":"（专有名词）多个北美机构或品牌使用的名称（例如曾经的美国银行“Norwest Corporation”）。"},"examples":[{"en":"Norwest Corporation later merged with Wells Fargo and the combined company kept the Wells Fargo name.","zh":"Norwest Corporation 之后与富国银行（Wells Fargo）合并，合并后的公司沿用“Wells Fargo”这一名称。"}]}],"synonyms":["northwest","Nor’west"],"phonetic":"/ˈnɔrˌwɛst/","extraExplanation":["“Norwest”并不是最常见的现代拼写；如果你想表达方位“西北”，标准写法是 **northwest**。","历史上在加拿大，“Nor’westers”常指西北公司（North West Company）的雇员或与其贸易网络有关的人；该公司在18—19世纪的毛皮贸易中影响很大。","作为公司名时，“Norwest”通常不需要翻译成“西北”，而是按专有名词保留原名。"]}
{"word":"norwester","summary":{"en":"A strong wind from the northwest, especially the warm, dry New Zealand nor’wester.","zh":"来自西北方向的强风；尤指新西兰常见的温暖干燥“诺威斯特（西北风）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong wind that blows from the northwest; especially a warm, dry northwesterly wind in New Zealand (often linked to sudden weather changes).","zh":"西北风；尤指新西兰常见的温暖、干燥的强劲西北风（常伴随天气骤变）。"},"examples":[{"en":"A norwester can turn a cool day into a hot, dusty afternoon.","zh":"一阵诺威斯特（强西北风）能把凉爽的一天变成炎热、尘土飞扬的午后。"},{"en":"The forecast warned of a strong norwester later today.","zh":"天气预报提醒今天晚些时候会有强劲的诺威斯特（西北风）。"}]}],"synonyms":["northwester","northwest wind","nor’wester"],"phonetic":"/ˈnɔrˌwɛstɚ/","extraExplanation":["“norwester”主要见于新西兰英语（New Zealand English）。在南岛东岸（如坎特伯雷 Canterbury）很有代表性：当气流越过南阿尔卑斯山后下沉增温、变干，形成类似“焚风（foehn wind）”的现象，因此常带来闷热、干燥、阵风强、扬尘等感受。","拼写上也常见作“nor’wester”，省略了“north-”的一部分，属于口语化、地方化的写法。"]}
{"word":"norwestward","summary":{"en":"Norwestward (usually spelled “northwestward”) means toward the northwest or moving/pointing in that direction.","zh":"norwestward（通常拼作 northwestward）表示“向西北；朝西北方向移动/指向西北”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the northwest; in a direction between north and west.","zh":"向西北；朝北与西之间的方向。"},"examples":[{"en":"The storm moved northwestward across the state.","zh":"暴风雨向西北方向穿过了该州。"},{"en":"We headed northwestward to reach the mountains before dark.","zh":"我们朝西北方向赶路，想在天黑前到达山里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Going or pointing toward the northwest.","zh":"朝西北的；指向西北的。"},"examples":[{"en":"They followed a northwestward route along the river.","zh":"他们沿着河走一条朝西北方向的路线。"},{"en":"A northwestward wind brought cooler air.","zh":"一阵朝西北方向的风带来了更凉爽的空气。"}]}],"synonyms":["northwestward","toward the northwest","northwestwards"],"phonetic":"/ˌnɔrθˈwɛstwɚd/","extraExplanation":["“norwestward”并不是常见或标准拼写，通常是“northwestward”的误拼或旧式/方言式写法。在现代英语写作中建议使用“northwestward”。","方向词里常见的构词方式是“northwest + -ward(s)”。美式英语里“-ward”更常见（如 “northwestward”）；英式英语里也常见带 s 的形式 “northwestwards”。"]}
{"word":"norweyan","summary":{"en":"Norwegian means “from Norway,” and it can also mean a person from Norway or the language spoken there.","zh":"Norwegian 表示“挪威的”，也可指“挪威人”或“挪威语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Norway, its people, or its language.","zh":"与挪威（Norway）、挪威人或挪威语有关的；挪威的。"},"examples":[{"en":"I tried Norwegian food for the first time.","zh":"我第一次尝试挪威菜。"},{"en":"She is studying Norwegian history.","zh":"她在学习挪威历史。"},{"en":"Norwegian is one of the main languages in Norway.","zh":"挪威语是挪威的主要语言之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Norway.","zh":"挪威人。"},"examples":[{"en":"Two Norwegians joined our hiking group.","zh":"有两位挪威人加入了我们的徒步小组。"},{"en":"He is a Norwegian living in the U.S.","zh":"他是一位住在美国的挪威人。"}]},{"partOfSpeech":"n.","definition":{"en":"The language spoken in Norway (especially Bokmål or Nynorsk).","zh":"挪威语（主要书写标准为博克马尔 Bokmål 或尼诺斯克 Nynorsk）。"},"examples":[{"en":"Can you speak Norwegian?","zh":"你会说挪威语吗？"},{"en":"This movie has Norwegian subtitles.","zh":"这部电影有挪威语字幕。"}]}],"synonyms":["Norse (historical/old)","Scandinavian (broader region)"],"phonetic":"/nɔrˈwiːdʒən/","extraExplanation":["你输入的 “norweyan” 常见是拼写错误；正确拼写是 **Norwegian**（挪威的 / 挪威人 / 挪威语）。","**Norway** 是国家名（挪威），**Norwegian** 是形容词和名词：a Norwegian person（一个挪威人）、the Norwegian language（挪威语）。","“Norwegian” 首字母通常要大写，因为它来自专有名词（国家、民族、语言）。"]}
