{"word":"nos","summary":{"en":"“nos” is usually an abbreviation or acronym, commonly meaning “numbers,” nitrous oxide (car performance), or network operating system depending on context.","zh":"“nos”通常是缩写或首字母缩略词，常见含义有“编号（numbers）”、一氧化二氮/氮气系统（汽车性能）、或网络操作系统，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbreviation) “numbers”; used in lists, invoices, or catalogs to refer to several item numbers.","zh":"（缩写）“numbers（编号/数量）”；用于清单、发票或目录中，指多个编号。"},"examples":[{"en":"Please include nos. 12–18 on the order form.","zh":"请在订单表上填上第12到18号（编号）。"},{"en":"Refer to nos. 3 and 4 in the manual.","zh":"请参阅手册中的第3和第4项（编号）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym) nitrous oxide; often used in cars to mean a nitrous oxide system that boosts engine power.","zh":"（首字母缩略词）一氧化二氮；在汽车语境中常指“氮气加速系统”，用于提升发动机动力。"},"examples":[{"en":"The car has NOS installed for drag racing.","zh":"这辆车装了氮气加速系统，用于直线加速赛。"},{"en":"He hit the NOS button and the engine surged.","zh":"他按下氮气按钮，发动机动力猛增。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym) Network Operating System; software that manages and supports a computer network.","zh":"（首字母缩略词）网络操作系统；用于管理并支持计算机网络的软件。"},"examples":[{"en":"The company upgraded its NOS to improve security.","zh":"公司升级了网络操作系统以提升安全性。"},{"en":"This server runs a NOS designed for small offices.","zh":"这台服务器运行一款面向小型办公室的网络操作系统。"}]}],"synonyms":["numbers (abbr.)","nitrous oxide","network operating system"],"phonetic":"/nɑs/","extraExplanation":["“nos / nos.”在英语里多为缩写或首字母缩略词，含义取决于语境；写作时常见三种形式：nos.（numbers的缩写）、NOS（全大写的缩略词，如氮气系统或网络操作系统）。","如果你想查的是拉丁语“nos”（意为“我们/我们（宾格）”），那属于拉丁语词形，不是常见英语单词；告诉我语境我可以按你需要解释。"]}
{"word":"nosairi","summary":{"en":"“Nosairi” is an older term (often spelled “Nusayri”) referring to the Alawite community; modern English usually prefers “Alawite.”","zh":"“Nosairi”（常拼作“Nusayri”）是较早的用法，用来指阿拉维派社群；现代英语通常更常用“Alawite（阿拉维派）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(also spelled Nusayri) relating to the Alawites, a religious community historically associated with parts of Syria and Turkey; sometimes used as a name for this group.","zh":"（也拼作 Nusayri）指与阿拉维派有关的；阿拉维派是历史上与叙利亚、土耳其部分地区相关的宗教社群；该词有时也用来称呼这一群体。"},"examples":[{"en":"Some older historical texts use the term “Nosairi” to refer to the Alawites.","zh":"一些较早的历史文献会用“Nosairi”来指称阿拉维派。"},{"en":"In modern writing, “Alawite” is more common than “Nosairi.”","zh":"在现代写作中，“Alawite（阿拉维派）”比“Nosairi”更常见。"}]}],"synonyms":["Nusayri","Alawite"],"phonetic":"/nuːˈsaɪri/","extraExplanation":["“Nosairi / Nusayri”在英语里多见于较早的西方文献或历史研究语境。现代英文更常用更中性的称呼“Alawite（阿拉维派）”。","该词有时会被视为带有时代色彩或外部命名的称呼；在当代交流中，使用“Alawite”通常更稳妥、更尊重。","如果你指的是人名（姓氏/用户名）而不是宗教或族群称呼，请告诉我上下文（出自哪里、句子是什么），我可以按正确含义解释。"]}
{"word":"nosairian","summary":{"en":"Nosairian is an older/less common term meaning “Alawite,” used for the Alawite community or a person from it, especially in historical texts about Syria.","zh":"Nosairian 是较旧或较少见的用法，基本相当于“Alawite（阿拉维派）”，可指该社群或其中的人，常见于涉及叙利亚的历史性文本。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a less common spelling of Nusayrian (or Nosairian), referring to the Alawite religious community, historically centered in coastal Syria","zh":"Nusayrian（也拼作 Nosairian）的较少见拼法，指阿拉维派（Alawite）这一宗教社群，历史上主要分布在叙利亚沿海地区"},"examples":[{"en":"Some older English texts use the term “Nosairian” for the Alawite community in Syria.","zh":"一些较早的英文文献会用“Nosairian”来指叙利亚的阿拉维派社群。"},{"en":"Modern writing more often says “Alawite” instead of “Nosairian.”","zh":"现代写作中更常用“Alawite（阿拉维派）”而不是“Nosairian”。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Alawite (Nusayri) community; an Alawite person (older or less preferred term in many contexts)","zh":"阿拉维派（Nusayri）社群的一员；阿拉维派人士（在许多语境中属于较旧或较不推荐的称呼）"},"examples":[{"en":"In older travel accounts, you may read that a village was described as “Nosairian.”","zh":"在较早的游记或旅行记述中，你可能会读到某个村庄被描述为“Nosairian”。"},{"en":"Today, many people prefer the term “Alawite” for clarity and respect.","zh":"如今，许多人更倾向于使用“Alawite（阿拉维派）”以更清晰且更尊重。"}]}],"synonyms":["Alawite","Nusayri","Nusayrian"],"phonetic":"/nuˈsaɪriən/","extraExplanation":["“Nosairian / Nusayrian”源自阿拉伯语对该社群的历史称呼（与“Nusayri/努赛里”相关）。在英文里，这类旧称有时带有外部观察者的色彩；当你写作或交流时，通常用更常见、也更中性的“Alawite（阿拉维派）”。","拼写提示：你输入的“nosairian”可能是较旧的拼法；常见变体包括 Nusayrian、Nusairi、Nosairi。"]}
{"word":"nosarian","summary":{"en":"“Nosarian” is not a common dictionary word; it’s most likely a proper name or a misspelling of a similar-looking word.","zh":"“nosarian”不是常见词典词汇；更可能是专有名词或与某个相似拼写的词混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; it is usually seen as a proper name (a surname or fictional name) in niche contexts.","zh":"不是标准英语词汇；通常只作为专有名词（姓氏或虚构名称）在小众语境中出现。"},"examples":[{"en":"I couldn’t find “nosarian” in major English dictionaries; it may be a character or place name in a specific book or game.","zh":"我在主要英语词典里找不到“nosarian”；它可能来自某本书或某个游戏中的人物/地名。"},{"en":"If you mean the character “Yossarian” from Catch-22, the spelling is different.","zh":"如果你指的是《第二十二条军规》里的“Yossarian”，拼写是不一样的。"}]}],"phonetic":"/noʊˈsɛriən/","extraExplanation":["“nosarian”在主流语料和词典中几乎不作为普通词出现，因此更像是专有名词或拼写误差。你可以告诉我它出现的句子/出处（书名、游戏、聊天语境等），我就能给出更准确的释义。","常见的相近拼写可能包括：Yossarian（《第二十二条军规》人物名）、Nazarene（拿撒勒人/耶稣的称呼之一）。如果你想查的是其中一个，请确认拼写。"]}
{"word":"nose","summary":{"en":"“Nose” most commonly means the part of the face used for smelling and breathing; it can also mean a strong ability to notice things, the front of a vehicle, or (as a verb) to pry or search around.","zh":"“nose”最常指“鼻子”；也可指“敏锐的洞察力”、交通工具等的“前端”，作动词时可表示“打探/多管闲事或四处搜寻”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The part of the face used for smelling and breathing; it is above the mouth.","zh":"鼻子；脸上用来闻气味和呼吸的部位，在嘴巴上方。"},"examples":[{"en":"My nose is stuffy because I have a cold.","zh":"我感冒了，所以鼻子不通气。"},{"en":"She can smell the flowers with her nose.","zh":"她可以用鼻子闻花香。"},{"en":"He breathed through his nose to calm down.","zh":"他用鼻子呼吸让自己冷静下来。"}]},{"partOfSpeech":"n.","definition":{"en":"A sense for finding or noticing something (especially something hidden), as if by smell.","zh":"（比喻）嗅觉般的洞察力；善于发现（隐藏的）事物的能力。"},"examples":[{"en":"Good reporters have a nose for a story.","zh":"优秀的记者对新闻线索很敏感。"},{"en":"She has a nose for trouble and avoids it.","zh":"她很会察觉麻烦并避开它。"}]},{"partOfSpeech":"n.","definition":{"en":"The front part of something, such as an airplane or a car.","zh":"（物体的）前端；（如飞机或汽车的）机头/车头。"},"examples":[{"en":"The nose of the plane pointed toward the runway.","zh":"飞机机头朝向跑道。"},{"en":"The car’s nose was damaged in the crash.","zh":"车头在撞击中受损了。"}]},{"partOfSpeech":"v.","definition":{"en":"To push your nose into something; to be too curious or interfere in other people’s business.","zh":"（口语）探听/插手别人的事；多管闲事。"},"examples":[{"en":"Don’t nose into my private life.","zh":"别插手我的私生活。"},{"en":"He was nosing around the office looking for gossip.","zh":"他在办公室里到处打探八卦。"}]}],"synonyms":["(n.) nostril (part)","(n.) scent (ability; close)","(v.) pry","(v.) snoop","(v.) sniff around"],"phonetic":"/noʊz/","extraExplanation":["“nose”作动词时常与介词搭配：nosing around 表示“到处探查/打听”；nosing into 常带有“多管闲事”的负面语气。","常见固定搭配：under your nose（就在你眼皮底下）、follow your nose（一直往前走/凭直觉）。"]}
{"word":"nosean","summary":{"en":"“nosean” is not standard English; it’s likely a typo or a name. Share the sentence to identify the intended word.","zh":"“nosean”不是标准英语词汇；多半是拼写错误或名字。给我原句我可以帮你判断想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling or a name/handle rather than common vocabulary.","zh":"不是标准英语单词。通常是拼写错误，或是人名/网名，而不是常见词汇。"},"examples":[{"en":"“nosean” doesn’t appear in most English dictionaries—did you mean “no-see-um” or “nosy”?","zh":"“nosean”在大多数英语词典里找不到——你是不是想写“no-see-um”或“nosy”？"},{"en":"I think I typed “nosean” by mistake; I meant “no-see-um.”","zh":"我觉得我把“nosean”打错了；我想写的是“no-see-um”。"}]}],"phonetic":"/ˈnoʊziən/","extraExplanation":["你可能想查的是下面这些更常见的词：\n1) no-see-um /ˈnoʊsiəm/：一种很小、会叮人的小飞虫（也写作 no-see-ums）。\n2) nosy：爱打听的、好管闲事的。\n3) no season：不是一个固定短语，但在特定语境里可能表示“没有季节/不分季节”。\n如果你告诉我它出现的句子或语境（聊天、歌词、游戏ID、文章等），我可以帮你精准判断。"]}
{"word":"noseanite","summary":{"en":"“noseanite” is not a standard English word; it’s likely a misspelling of another word.","zh":"“noseanite”不是标准英语词，通常是其他单词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most often appears as a typo or misspelling, so its meaning depends on what you intended to write (for example, “nauseate” or “no-see-um”).","zh":"不是标准英语单词。它多半是拼写错误或输入错误，具体含义取决于你原本想写的词（例如 *nauseate* 或 *no-see-um*）。"},"examples":[{"en":"I couldn’t find “noseanite” in a dictionary—did you mean “nauseate”?","zh":"我在词典里找不到“noseanite”——你是想写“nauseate（使作呕）”吗？"},{"en":"If you meant “no-see-um,” it refers to a tiny biting insect.","zh":"如果你想写的是“no-see-um”，它指的是一种很小、会咬人的小飞虫。"}]}],"phonetic":"/noʊˈsiːənaɪt/","extraExplanation":["“noseanite”很可能是把别的词打错了。最常见的两种可能：\n1) **nauseate** /ˈnɔzieɪt/（动词）：使恶心；让人反感。\n2) **no-see-um** /ˈnoʊsiəm/（名词，常用复数 no-see-ums）：一种小到几乎看不见、但会叮咬的飞虫（北美常见）。\n如果你告诉我你看到它的句子/上下文，我可以帮你准确判断你要找的词，并给出正确释义与例句。"]}
{"word":"nosebag","summary":{"en":"A nosebag is a feed bag for a horse’s nose; figuratively, it can mean a tempting reward used to control someone.","zh":"nosebag 指挂在马鼻子前的饲料袋；也可比喻用来诱使或驱使他人的奖励/诱饵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bag of feed hung in front of a horse’s nose so it can eat while standing or traveling.","zh":"（挂在马鼻子前的）饲料袋；草料袋，用于让马在站立或行进中进食。"},"examples":[{"en":"The stable hand filled the horse’s nosebag with oats.","zh":"马厩工往马的草料袋里装了燕麦。"},{"en":"During the long ride, each horse wore a nosebag at rest stops.","zh":"长途骑行时，马在休息点都会戴上草料袋。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, often humorous) Something offered as a tempting reward to keep someone working or obedient—like bait.","zh":"（比喻，常带幽默）用来引诱或驱使他人继续做事/听话的“诱饵”或奖励。"},"examples":[{"en":"The promise of a bonus felt like a nosebag to keep the team quiet.","zh":"承诺发奖金感觉像是用“诱饵”让团队保持安静。"},{"en":"He dangled praise as a nosebag whenever he wanted extra effort.","zh":"他想让大家多出力时，就拿表扬当“诱饵”。"}]}],"synonyms":["feedbag","bait (figurative)","carrot (figurative)"],"phonetic":"/ˈnoʊzˌbæɡ/","extraExplanation":["“nosebag”主要与马匹等役用动物有关，常见于骑术、马术、旧式旅行或军用场景。现代英语里更多作为具体名词出现；比喻用法较少见，但能表达“用小奖励驱动他人”的意思，语气往往带点讽刺或玩笑。","也可见写法“nose-bag”。相关词：feedbag（饲料袋，更通用）、bait（诱饵）、carrot-and-stick（胡萝卜加大棒，奖惩并用）。"]}
{"word":"nosebags","summary":{"en":"Nosebags are feed bags hung over a horse’s nose; informally, it can also mean food to eat.","zh":"nosebags 指给马用的饲料袋；在非正式、幽默语境中也可指“吃的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bag (usually hung from a strap) put over a horse’s nose so it can eat grain or feed","zh":"（给马用的）饲料袋；套在马口鼻处让它吃粮草的袋子"},"examples":[{"en":"The rider filled the nosebag with oats before the long ride.","zh":"骑手在长途骑行前把燕麦装进饲料袋。"},{"en":"After the race, the horses stood quietly with their nosebags on.","zh":"比赛结束后，马儿安静地站着，嘴上套着饲料袋。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, often humorous) food; something to eat","zh":"（非正式/幽默）吃的东西；食物"},"examples":[{"en":"Let’s grab some nosebag before we head out.","zh":"出发前我们先去弄点吃的吧。"}]}],"synonyms":["feedbag","nose bag","food (informal)"],"phonetic":"/ˈnoʊzˌbæɡ/","extraExplanation":["“nosebag”原指给马喂食用的袋子，多见于与马术、骑兵或乡村生活相关的语境。","引申义“食物”通常带点俏皮或自嘲意味，把人吃饭比作马“上饲料袋”。在现代日常口语里不算高频，更常见的是 food、snack、something to eat。"]}
{"word":"noseband","summary":{"en":"A noseband is a strap around an animal’s nose, especially on a horse’s bridle, used for control or to keep the mouth closed.","zh":"noseband 指（尤指马具上的）鼻带，套在鼻部周围，用于辅助控制或防止张口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strap that goes around an animal’s nose (especially a horse), used to help control the animal or keep its mouth closed as part of a bridle or halter.","zh":"（尤指马的）鼻带；套在动物鼻部周围的带子，通常作为马笼头/缰具或笼头的一部分，用来辅助控制或防止张口。"},"examples":[{"en":"The trainer tightened the noseband before the horse entered the ring.","zh":"训练员在马进入赛场前把鼻带收紧。"},{"en":"A properly fitted noseband should not press painfully on the horse’s nose.","zh":"合适的鼻带不应当把马的鼻子压得很痛。"}]},{"partOfSpeech":"n.","definition":{"en":"In some traditional clothing, a band worn across the nose as decoration or to support a veil.","zh":"（某些传统服饰中的）鼻带；横跨鼻梁的装饰带，或用于固定面纱。"},"examples":[{"en":"In the ceremony, she wore a jeweled noseband as part of the traditional outfit.","zh":"在仪式上，她佩戴了镶宝石的鼻带，作为传统服饰的一部分。"}]}],"synonyms":["cavesson","nose strap","bridle noseband"],"phonetic":"/ˈnoʊzˌbænd/","extraExplanation":["在马具里，noseband 常见类型有 cavesson（最常见的普通鼻带）、flash noseband（带一条下方额外小带）、figure-eight / grackle（“8”字鼻带，常见于越野或需要更大通气/稳定性时）。不同类型用于不同训练与比赛规则，使用时要注意松紧与动物舒适度。"]}
{"word":"nosebanded","summary":{"en":"Nosebanded means either fitted with a noseband (as in horse tack) or having a band/stripe across the nose (in animal descriptions).","zh":"nosebanded 指“戴着鼻带的”（多见于马具语境）或“鼻部有带状花纹的”（多见于动物描写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a noseband (a strap that goes around an animal’s nose/muzzle), especially as part of a bridle or halter.","zh":"有鼻带的；戴着鼻带的（指缰绳或笼头上绕在动物鼻口部的一条带子）。"},"examples":[{"en":"The horse looked calmer once it was properly nosebanded for the lesson.","zh":"那匹马在上课前正确戴好鼻带后，看起来更安稳了。"},{"en":"Check that the bridle is correctly nosebanded and not too tight.","zh":"检查一下缰绳的鼻带是否佩戴正确，而且不要系得太紧。"}]},{"partOfSpeech":"adj.","definition":{"en":"Marked by a band or stripe across the nose (often used in descriptions of animals).","zh":"鼻部有带状花纹的（常用于动物外观描述）。"},"examples":[{"en":"A nosebanded monkey watched us quietly from the trees.","zh":"一只鼻部有带状花纹的猴子在树上安静地看着我们。"},{"en":"The guide pointed out a nosebanded species that is easier to recognize at a distance.","zh":"向导指出一种鼻部有带状花纹的物种，远处更容易辨认。"}]}],"synonyms":["wearing a noseband","bridled","nose-striped","band-nosed"],"phonetic":"/ˈnoʊzˌbændɪd/","extraExplanation":["“noseband”在马术语境里指缰绳/笼头上的“鼻带”，用途通常是帮助固定器具、让口衔更稳定或限制马张口；佩戴过紧可能伤害动物，因此常见提醒是“two-finger rule（可塞进两根手指）”。","在动物学或自然观察写作中，-banded 常用来描述“有条纹/带状色块”的特征（如 ring-banded, white-banded）；nosebanded 就是“鼻部有一条带状色块”的意思。"]}
{"word":"nosebands","summary":{"en":"Nosebands are the straps on a horse’s bridle that go around the nose.","zh":"Nosebands 指马缰辔上绕在马鼻子周围的鼻带（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strap around a horse’s nose that is part of a bridle, used to help keep the bridle in place and (in some types) to help control the horse","zh":"（马具）鼻带：套在马鼻子周围、属于缰辔的一条带子，用于固定缰辔；某些类型也可辅助控制马匹"},"examples":[{"en":"The trainer tightened the noseband before the lesson.","zh":"训练员在上课前把鼻带收紧了一点。"},{"en":"Some horses go better with a looser noseband to stay comfortable.","zh":"有些马把鼻带放松些会更舒服，表现也更好。"},{"en":"Check that the noseband isn’t rubbing the horse’s skin.","zh":"检查鼻带有没有磨到马的皮肤。"}]}],"synonyms":["bridle noseband","cavesson (type of noseband)","nose strap"],"phonetic":"/ˈnoʊzˌbænd/","extraExplanation":["“nosebands”是复数形式，单数是“noseband”。在马术语境中，noseband属于“bridle（缰辔）”的一部分。常见类型包括“cavesson noseband（传统鼻带）”“flash noseband（加闪带鼻带）”等；不同比赛和训练体系对鼻带松紧与使用有规则与建议。"]}
{"word":"nosebleed","summary":{"en":"A nosebleed is bleeding from the nose; informally it can also describe extremely high seats or prices.","zh":"nosebleed 指流鼻血；口语里也可形容特别高的座位或极高的价格/水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bleeding from the nose; blood coming out of the nose.","zh":"鼻出血；流鼻血。"},"examples":[{"en":"I got a nosebleed because the air was so dry.","zh":"空气太干燥了，我流鼻血了。"},{"en":"If the nosebleed doesn’t stop after 10 minutes, get medical help.","zh":"如果流鼻血在10分钟后还不停，请寻求医疗帮助。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) A very high level or extreme height/price, suggesting it’s “up in the nosebleed seats.”","zh":"（非正式）非常高的高度或极高的价格/水平（暗示在“山顶座位/鼻血区”那么高）。"},"examples":[{"en":"Those concert tickets are at nosebleed prices this year.","zh":"今年那场演唱会的票价贵得离谱。"},{"en":"We were sitting in the nosebleed seats, but we could still hear the music clearly.","zh":"我们坐在很高很远的座位上，但还是能清楚听到音乐。"}]}],"synonyms":["epistaxis","nasal bleeding","nosebleed seats"],"phonetic":"/ˈnoʊzˌblid/","extraExplanation":["“nosebleed seats”常见于美国口语，指体育场或演唱会场馆里最高、最远的座位。因为位置太高，夸张地说会让人“流鼻血”，用来形容离舞台/球场很远。也常引申为“高得吓人”的价格或水平（如nosebleed prices）。","常见表达：have/get a nosebleed（流鼻血）；stop a nosebleed（止鼻血）。在日常健康语境里更常用动词短语“have a nosebleed/bleed from the nose”。"]}
{"word":"nosebleeds","summary":{"en":"Nosebleeds can mean bleeding from the nose, and it can also describe something extremely high (especially prices or levels).","zh":"Nosebleeds既指“流鼻血”，也可形容某事物“高得离谱”（尤其是价格或水平）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bleeding from the nose; blood coming out of the nostrils (often from dry air, allergies, a small injury, or picking the nose).","zh":"鼻出血；鼻孔流血（常见原因包括空气干燥、过敏、轻微碰撞或挖鼻孔等）。"},"examples":[{"en":"I get nosebleeds in winter when the air is very dry.","zh":"冬天空气很干的时候我容易流鼻血。"},{"en":"He had a nosebleed after getting hit in the face.","zh":"他脸部被打到后流了鼻血。"},{"en":"If the nosebleed doesn’t stop in 20 minutes, you should get medical help.","zh":"如果鼻血20分钟还止不住，应寻求医疗帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"A very high (and often expensive) level or position, especially in prices, rent, or success: “nosebleed prices/levels.”","zh":"（多指价格、房租或水平）高得离谱的程度：常见搭配“nosebleed prices/levels”（高到夸张的价格/水平）。"},"examples":[{"en":"The apartment has a great view, but the rent is at nosebleed levels.","zh":"这套公寓景观很好，但房租高得离谱。"},{"en":"Tickets are selling for nosebleed prices online.","zh":"网上的票价被炒到离谱的高价。"}]}],"synonyms":["nosebleed","epistaxis","sky-high prices","outrageous prices","astronomical prices"],"phonetic":"/ˈnoʊzˌblidz/","extraExplanation":["“Nosebleed prices/levels”来自“高到让人流鼻血”的夸张说法，带有幽默/讽刺语气，常用于谈论房价、租金、门票等。","在体育场或演唱会里，“the nosebleeds”也可口语指“最高最远的座位区”，因为位置很高。"]}
{"word":"nosebone","summary":{"en":"Nosebone means the nasal bone—the small bone(s) forming the bridge of the nose.","zh":"nosebone 指“鼻骨/鼻梁骨”，也就是构成鼻梁的骨头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bone (or the pair of small bones) that forms the bridge of the nose; the nasal bone.","zh":"（构成鼻梁的）鼻骨；鼻梁骨。"},"examples":[{"en":"The doctor said the nosebone (nasal bone) might be fractured after the fall.","zh":"医生说摔倒后鼻骨可能骨折了。"},{"en":"A hard hit to the bridge of the nose can injure the nosebone.","zh":"鼻梁受到重击可能会伤到鼻骨。"}]}],"synonyms":["nasal bone","nose bone","bridge of the nose (region)"],"phonetic":"/ˈnoʊzˌboʊn/","extraExplanation":["“nosebone”在日常英语里不算很常见，更常用、也更标准的医学/解剖学说法是“nasal bone”。如果你在医院、解剖课或正式写作中表达，建议用“nasal bone”。","鼻骨通常指一对小骨头，位于鼻梁上部；但口语里也常用单数“the nose bone”泛指鼻梁骨这一块区域。"]}
{"word":"noseburn","summary":{"en":"A burning or stinging sensation in the nose, usually from irritation (smoke, fumes, cold air, etc.).","zh":"鼻子里的灼痛/刺痛感，通常由刺激物（烟、气味、冷空气等）引起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a burning or stinging feeling inside the nose, often caused by smoke, strong smells, cold air, allergies, or chemicals","zh":"鼻腔里的灼热或刺痛感，常由烟雾、强烈气味、冷空气、过敏或化学物质引起"},"examples":[{"en":"The campfire smoke gave me a sharp noseburn.","zh":"篝火的烟让我鼻子一阵刺痛灼热。"},{"en":"Bleach fumes can cause noseburn, so open a window.","zh":"漂白水的气味会让鼻子灼痛，所以要开窗通风。"}]}],"synonyms":["nasal burning","nose irritation","stinging in the nose","nasal irritation"],"phonetic":"/ˈnoʊzˌbɝn/","extraExplanation":["“noseburn”不是非常常见的标准词，更常见的表达是“a burning sensation in the nose / nasal burning / nose irritation”。但在口语或非正式写作中，人们有时会用这种合成词来形容“鼻子被呛到、被刺激到的灼痛感”。","如果这种感觉持续、伴随流鼻血或严重疼痛，通常建议用更具体的说法描述原因（如“chemical irritation”化学刺激、“sinus infection”鼻窦感染），并必要时寻求医疗建议。"]}
{"word":"nosed","summary":{"en":"“Nosed” is an adjective meaning “having a particular kind of nose” (often in compounds) or the past form of “nose” meaning “to sniff/touch with the nose” or “to pry for information.”","zh":"“nosed”可作形容词，表示“有某种鼻子（常用于复合词）”；也可作动词“nose”的过去式/过去分词，表示“用鼻子碰/闻”或（口语）“打探、窥探”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal or person) Having a nose of a particular kind; often used in compounds.","zh":"（人或动物）有某种类型的鼻子；常用于复合词。"},"examples":[{"en":"The fox is a long-nosed animal.","zh":"狐狸是一种长鼻子的动物。"},{"en":"He was teased for being big-nosed when he was a kid.","zh":"他小时候因为鼻子大而被取笑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a good sense of smell (often in compounds).","zh":"嗅觉灵敏的（常用于复合词）。"},"examples":[{"en":"A keen-nosed dog can find people after an earthquake.","zh":"嗅觉灵敏的狗能在地震后找到人。"},{"en":"They used a sharp-nosed pig to search for truffles.","zh":"他们用嗅觉很灵的猪去找松露。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “nose”: to push or touch with the nose; to sniff.","zh":"“nose”的过去式/过去分词：用鼻子顶/碰；嗅闻。"},"examples":[{"en":"The puppy nosed my hand to ask for attention.","zh":"小狗用鼻子蹭了蹭我的手，想要我注意它。"},{"en":"She nosed the flowers before buying them.","zh":"她买花前先闻了闻。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “nose” (informal): to look for information in a way that feels intrusive; to pry.","zh":"“nose”的过去式/过去分词（非正式）：打听、探听（带有多管闲事/窥探的感觉）。"},"examples":[{"en":"He nosed around in my desk when I wasn’t there.","zh":"我不在时他在我的桌子里翻找。"},{"en":"Reporters nosed into the private details of her life.","zh":"记者探挖她生活中的隐私细节。"}]}],"synonyms":["big-nosed","long-nosed","keen-nosed","sniffed (v.)","probed (v.)","pried (v.)"],"phonetic":"/noʊzd/","extraExplanation":["“nosed”作形容词时很常见于复合词：long-nosed（长鼻的）、big-nosed（大鼻的）、hard-nosed（强硬/精明务实的）、keen-nosed（嗅觉灵敏的）。其中 hard-nosed 多用于形容人做事现实、不易被打动。","动词 nose 的口语义“打探、窥探”常带负面语气，比 ask / find out 更有“爱管闲事”的感觉。"]}
{"word":"nosedive","summary":{"en":"A sudden steep fall; to drop sharply and quickly.","zh":"突然陡降；（动词）急剧下滑、暴跌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden, steep fall or drop (literal or figurative).","zh":"（字面或比喻）突然的、陡直的下坠；暴跌。"},"examples":[{"en":"After the bad news, the company’s stock took a nosedive.","zh":"坏消息一出，这家公司的股价就暴跌。"},{"en":"Her confidence went into a nosedive after the mistake.","zh":"犯错之后，她的自信心一落千丈。"}]},{"partOfSpeech":"v.","definition":{"en":"To fall or dive downward suddenly and sharply; to drop quickly (literal or figurative).","zh":"突然陡直下坠；（比喻）迅速下滑、暴跌。"},"examples":[{"en":"The plane nosedived toward the ground before the pilot recovered.","zh":"飞机一度朝地面俯冲，后来飞行员才拉了起来。"},{"en":"Sales nosedived in the first quarter.","zh":"第一季度销量暴跌。"}]}],"synonyms":["plunge","drop sharply","plummet","dive","crash"],"phonetic":"/ˈnoʊzˌdaɪv/","extraExplanation":["“nosedive”原本来自飞行与航空语境：飞机机头（nose）朝下（dive）俯冲。后来被广泛用于商业、数据、情绪等场景，表示“突然且幅度很大地下降”。","常见搭配：take a nosedive（突然下跌/大跌）；go into a nosedive（开始急剧下滑）。语气通常比“fall/drop”更强烈、更戏剧化。"]}
{"word":"nosegay","summary":{"en":"A nosegay is a small, decorative bouquet of flowers, often carried or given as a gift.","zh":"nosegay 指一小束装饰性花束，常用于手持或赠送。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, neatly arranged bouquet of flowers, often carried or given as a gift (traditionally for smell or decoration).","zh":"一小束精心扎好的花束（常用于手持、赠送；传统上也为闻香或装饰）。"},"examples":[{"en":"She carried a nosegay of lavender and roses at the wedding.","zh":"她在婚礼上手里拿着一束薰衣草和玫瑰的小花束。"},{"en":"He left a nosegay on the table to brighten the room.","zh":"他在桌上放了一束小花束，让房间更有生气。"}]}],"synonyms":["posy","bouquet","small bouquet","flower cluster"],"phonetic":"/ˈnoʊzˌɡeɪ/","extraExplanation":["“nosegay”源自早期英语中“nose”（鼻子）+“gay”（快乐的、艳丽的），原意接近“让鼻子愉悦的香花”。在香水不普及、街道与室内气味较重的年代，人们会随身携带带香味的小花束来掩盖异味，也用于社交礼仪与装饰。","现代英语里更常用的近义词是“posy / bouquet”。“nosegay”带一点复古、文学或婚礼语境的感觉。"]}
{"word":"nosegaylike","summary":{"en":"Nosegaylike means “like a small decorative bunch of flowers,” in look, arrangement, or smell.","zh":"nosegaylike 表示“像小巧装饰性花束一样的”，可形容外观、摆放或气味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or suggesting a nosegay (a small, decorative bunch of flowers), especially in appearance, arrangement, or a sweet floral smell.","zh":"像花束（nosegay，小巧的装饰性花束）的；带有花束般特征的（尤指外观、摆放方式或甜美花香）。"},"examples":[{"en":"She wore a nosegaylike bouquet pinned to her coat.","zh":"她把一束像小花束一样的花别在外套上。"},{"en":"The room had a nosegaylike scent—light, fresh, and floral.","zh":"房间里有一种像小花束般的气味——清淡、清新、带花香。"},{"en":"The centerpiece was nosegaylike, with tight clusters of roses and herbs.","zh":"桌面中央装饰像小花束一样，由紧密簇拥的玫瑰和香草组成。"}]}],"synonyms":["flowerlike","bouquet-like","posy-like","floral","garlanded"],"phonetic":"/ˈnoʊzˌɡeɪˌlaɪk/","extraExplanation":["“nosegay”指一种小巧的手持花束，传统上用于装饰或遮掩气味（在早期城市卫生条件较差时更常见），也常用于婚礼或正式场合。英语里在名词后加“-like”表示“像……一样”，所以“nosegaylike”就是“花束般的/像小花束的”。"]}
{"word":"nosegays","summary":{"en":"Nosegays are small, decorative flower bouquets, often carried or worn.","zh":"nosegays 指小型装饰花束（香花束），常手拿或佩戴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small bouquets of flowers (plural of “nosegay”), often carried or worn for decoration or fragrance.","zh":"小花束；香花束（“nosegay”的复数），常用于装饰或闻香。"},"examples":[{"en":"The guests carried nosegays as they walked into the wedding ceremony.","zh":"宾客们手拿小花束走进婚礼现场。"},{"en":"In the old painting, the woman wears a ribboned nosegay on her dress.","zh":"在那幅老画里，女子的裙子上别着系着丝带的小花束。"},{"en":"She picked lavender and roses to make simple nosegays for the table.","zh":"她摘了薰衣草和玫瑰，做了几束简单的小花束摆在桌上。"}]}],"synonyms":["small bouquet","posy","boutonniere (when worn)"],"phonetic":"/ˈnoʊz.ɡeɪz/","extraExplanation":["“nosegay”读作 /ˈnoʊzˌɡeɪ/，字面可理解为“让鼻子愉悦的东西”：nose（鼻子）+ gay（古义为“欢乐、明亮、芬芳宜人”）。现代英语里 gay 多指性取向，但在这个词中是较旧的意思。","在19世纪欧洲（尤其维多利亚时期），人们常随身携带小花束来遮掩街道异味，也用于社交礼仪与装饰；有时还和“花语”（the language of flowers）文化相关。"]}
{"word":"noseherb","summary":{"en":"Noseherb is a rare, old term for a plant used for nasal purposes, especially a herb sniffed to trigger sneezing (often sneezewort).","zh":"Noseherb 是罕见的旧称，指用于鼻部的植物，尤指嗅闻后会刺激打喷嚏的草本（常指喷嚏草/嚏根草）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) A plant used for the nose—especially one dried and sniffed to make you sneeze (like a kind of “snuff herb”), often referring to *sneezewort*.","zh":"（罕见/旧用法）“鼻用草本”——指用于鼻部的植物，尤其是晒干后用来嗅闻、刺激打喷嚏的草本（类似“鼻烟草”）；常用来指“喷嚏草/嚏根草”（sneezewort）。"},"examples":[{"en":"In old herbals, *noseherb* was mentioned as something people sniffed to provoke sneezing.","zh":"在一些古老的草药书里，noseherb 被提到是人们用来嗅闻、促使打喷嚏的植物。"},{"en":"The gardener labeled the yarrow as *noseherb*, an older name tied to its traditional uses.","zh":"园丁把这种蓍草标注为 noseherb，这是一个和传统用途有关的旧称。"}]}],"synonyms":["sneezewort","snuff herb","sneezeweed (loosely related)"],"phonetic":"/ˈnoʊzˌhɝːb/","extraExplanation":["noseherb 不是现代常用词，更像是旧时代的合成词（nose + herb）。在早期欧洲民间用药里，有些植物会被干燥后磨粉嗅闻，用来“通鼻”或刻意诱发打喷嚏，被归到类似“鼻烟（snuff）”的用途。","常被联想到的植物名是 *sneezewort*（一种蓍草属植物），其英文名本身就含有 “sneeze（喷嚏）+ wort（草药）” 的历史痕迹。"]}
{"word":"nosehole","summary":{"en":"“Nosehole” is an informal word meaning “nostril,” and it can also be a rude joking term for someone’s nose.","zh":"“nosehole”是“nostril（鼻孔）”的非正式说法，也可能作为带冒犯的玩笑用语指人的鼻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nostril; one of the two openings in the nose used for breathing and smelling. (Informal)","zh":"鼻孔；鼻子上用于呼吸和闻味道的两个开口之一。（非正式）"},"examples":[{"en":"Water went up my nosehole when I jumped into the pool.","zh":"我跳进泳池时，水呛进了我的鼻孔。"},{"en":"The smell was so strong that it burned my noseholes.","zh":"味道太刺鼻了，熏得我鼻孔发疼。"}]},{"partOfSpeech":"n.","definition":{"en":"A crude, joking insult used to refer to someone’s nose (or face). (Slang, often rude)","zh":"一种粗俗、开玩笑式的说法，用来指某人的鼻子（或脸）。（俚语，常带冒犯）"},"examples":[{"en":"He made a rude joke about my nosehole, so I told him to stop.","zh":"他拿我的鼻子开粗俗玩笑，我就让他别再说了。"}]}],"synonyms":["nostril","nasal opening"],"phonetic":"/ˈnoʊzˌhoʊl/","extraExplanation":["“nosehole”不是常见的标准用词；日常更自然的说法是“nostril”（鼻孔）。","在网络或口语里，“nosehole”有时是为了搞笑而故意说得粗一点，但在正式场合或不熟的人面前容易显得不礼貌。"]}
{"word":"noseless","summary":{"en":"Noseless means having no (visible) nose, and it can also be used figuratively to mean unable to smell.","zh":"Noseless 指“没有（明显的）鼻子”，也可引申为“没有嗅觉、闻不到气味”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no nose (or lacking a noticeable nose).","zh":"没有鼻子的；鼻子缺失的（或不明显的）。"},"examples":[{"en":"The statue’s face looked noseless after centuries of damage.","zh":"这座雕像的脸因历经数百年损坏，看起来像是没有鼻子。"},{"en":"In the story, the villain is described as pale and noseless.","zh":"在故事里，反派被描写成脸色苍白、没有鼻子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Without a sense of smell; unable to smell.","zh":"（比喻/引申）没有嗅觉的；闻不到气味的。"},"examples":[{"en":"With a bad cold, I felt practically noseless and couldn’t taste much.","zh":"感冒严重时，我几乎像没鼻子一样，味道也尝不太出来。"},{"en":"After the accident, he said he was almost noseless and missed the smell of rain.","zh":"事故之后，他说自己几乎失去了嗅觉，很想再闻到雨的味道。"}]}],"synonyms":["without a nose","nose-free","unable to smell (figurative)"],"phonetic":"/ˈnoʊz.ləs/","extraExplanation":["“noseless”更常见于文学描写或形象化表达，用来制造强烈的视觉效果（如受伤、雕像破损、怪物形象等）。","口语里如果想表达“闻不到”，更常用：can’t smell / have no sense of smell / be stuffed up（鼻塞）。","在流行文化中，最典型的“noseless”形象之一是《哈利·波特》里的伏地魔（Voldemort），常被描述为几乎没有鼻子。"]}
{"word":"noselessly","summary":{"en":"“Noselessly” is a rare adverb meaning “without a nose,” often used in descriptive or humorous writing; it can also (rarely) suggest acting without using the sense of smell.","zh":"“noselessly”是非常罕见的副词，主要表示“无鼻地（没有鼻子的样子）”，常见于描写或幽默语境；也可极少见地指“不靠嗅觉地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no nose (literally); without a nose.","zh":"（字面义）以没有鼻子的方式；无鼻地。"},"examples":[{"en":"In the fantasy story, the villain smiled noselessly in the shadows.","zh":"在那部奇幻故事里，反派在阴影中无鼻地露出笑容。"},{"en":"The statue stood noselessly after years of weather damage.","zh":"那座雕像因多年风化损坏而无鼻地矗立着。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that suggests the nose is not used—without smelling (humorous or rare).","zh":"（幽默或罕见）以不使用鼻子的方式；不靠嗅觉地。"},"examples":[{"en":"With a bad cold, he ate the soup noselessly and couldn’t taste much.","zh":"因为重感冒，他几乎不靠鼻子地喝了汤，味道也尝不太出来。"}]}],"synonyms":["without a nose","with no nose","in a noseless way"],"phonetic":"/ˈnoʊz.ləs.li/","extraExplanation":["“noselessly”非常少见，多用于文学描写、黑色幽默或奇幻题材（例如描写人物缺少鼻子）来营造画面感。日常英语更常用“without a nose / with no nose”或用形容词“noseless”来描述。","如果你想表达“因为鼻塞闻不到/尝不出”，更自然的说法是“couldn’t smell anything”或“couldn’t taste much because my nose was blocked”，而不是“noselessly”。"]}
{"word":"noselessness","summary":{"en":"Noselessness means the state of having no nose; it is a rare word and is sometimes used figuratively for lacking a “nose” (smell/instinct).","zh":"Noselessness 指“无鼻/缺鼻”的状态；该词较少见，也可少量比喻为缺乏嗅觉或直觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition or state of having no nose (or an absent/removed nose).","zh":"无鼻（没有鼻子）的状态；缺鼻症。"},"examples":[{"en":"After the accident, he lived with noselessness and needed reconstructive surgery.","zh":"事故之后，他处于无鼻的状态，需要进行修复手术。"},{"en":"The mask was designed to hide his noselessness.","zh":"这个面具是为了遮住他缺鼻的样子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A lack of the qualities associated with a “nose,” such as a good sense of smell or an instinct for finding something.","zh":"（比喻用法，少见）缺乏“鼻子”象征的能力，如嗅觉或善于发现线索的直觉。"},"examples":[{"en":"The critic joked about the editor’s noselessness for new talent.","zh":"评论家开玩笑说那位编辑对新人才“没鼻子”（缺乏嗅觉/眼光）。"}]}],"synonyms":["absence of a nose","loss of a nose","nasal absence","noseless condition"],"phonetic":"/ˈnoʊz.ləs.nəs/","extraExplanation":["“noselessness”由 noseless（无鼻的）+ -ness（名词后缀，表示“……的状态/性质”）构成。这个词较少见，更常见的表达是“absence of a nose / loss of a nose（鼻子缺失/失去鼻子）”。","在文学或历史语境中，“被割鼻”有时被用作羞辱或惩罚的意象，因此相关词汇偶尔会带有强烈的文化与情感色彩；使用时注意语境与尊重。"]}
{"word":"noselike","summary":{"en":"“Noselike” means nose-shaped or resembling a nose.","zh":"“Noselike”表示“像鼻子一样的；鼻子形状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a nose in shape or appearance; nose-shaped.","zh":"像鼻子的；鼻子形状的。"},"examples":[{"en":"The sculpture has a noselike bump on the front.","zh":"这座雕塑正面有一个像鼻子一样的凸起。"},{"en":"A small, noselike handle sticks out from the lid.","zh":"盖子上伸出一个小小的、像鼻子一样的把手。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a smell or quality that reminds you of a nose (informal and rare).","zh":"带有让人联想到“鼻子”的气味或特质（非正式且少见）。"},"examples":[{"en":"The air had a faint, noselike mustiness that made me want to sneeze.","zh":"空气里有一丝像“鼻子闻到的那种”霉味，让我想打喷嚏。"}]}],"synonyms":["nose-shaped","nosey-looking","snoutlike"],"phonetic":"/ˈnoʊzˌlaɪk/","extraExplanation":["“‑like”是常见后缀，表示“像……一样”。所以 noselike 直译就是“像鼻子一样的”。在日常英语里更常用 nose-shaped、beaklike（像鸟喙的）等表达；noselike 偏文学/描写性用法。"]}
{"word":"noselite","summary":{"en":"“noselite” is not a standard English word; it’s usually a brand-style spelling (e.g., “NoseLite”) or a misspelling of “nose light.”","zh":"“noselite”不是标准英语词汇；通常是品牌式拼写（如“NoseLite”）或把“nose light”误写/连写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A non-standard English word; most often seen as a brand/product name spelled “NoseLite” (or similar). It is not a common dictionary word in everyday English.","zh":"不是标准英语词汇；多见于品牌/产品名（如“NoseLite”等拼写）。在日常英语词典中并不常见。"},"examples":[{"en":"I couldn’t find “noselite” in a dictionary, but “NoseLite” appears to be a product name online.","zh":"我在词典里找不到“noselite”，但网上有“NoseLite”作为产品名出现。"},{"en":"If you mean “nose light,” write it as two words: nose light.","zh":"如果你想表达“nose light（鼻部灯/鼻端灯）”，应写成两个词：nose light。"}]}],"synonyms":["brand name","product name","(possible intended) nose light"],"phonetic":"/ˈnoʊzˌlaɪt/","extraExplanation":["“noselite”更像是把两个词或一个品牌名连写在一起的形式。英语里常见的可能写法包括：\n- NoseLite（品牌名/产品名，通常首字母大写）\n- nose light（两个普通词；具体含义要看语境，比如“鼻端的灯/前端灯”）\n\n如果你告诉我它出现的句子或场景（比如医疗、运动、汽车/飞机、网购链接），我可以帮你确认它最可能的意思与更自然的英文表达。"]}
{"word":"nosema","summary":{"en":"Nosema is a microscopic parasite that infects bees and other insects, often causing nosemosis.","zh":"Nosema 是一种显微寄生虫，常感染蜜蜂等昆虫，并可能引发孢子虫病（nosemosis）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a microscopic fungal-like parasite (a microsporidian) that infects insects—especially honey bees—and can cause a disease called nosemosis.","zh":"一种显微寄生虫（微孢子虫，类真菌的寄生生物），主要感染昆虫，尤其是蜜蜂，并可引起称为“孢子虫病/诺氏病（nosemosis）”的疾病。"},"examples":[{"en":"Beekeepers monitor nosema levels to protect the health of their colonies.","zh":"养蜂人会监测蜂群中的 nosema 水平，以保护蜂群健康。"},{"en":"Nosema infection can weaken bees, especially during stressful seasons.","zh":"nosema 感染会削弱蜜蜂，尤其在压力较大的季节更明显。"}]}],"synonyms":["microsporidian","Nosema apis","Nosema ceranae"],"phonetic":"/noʊˈsiːmə/","extraExplanation":["“Nosema”常见于养蜂与昆虫病理学语境，最常提到的有两类：Nosema apis（蜜蜂孢子虫）与 Nosema ceranae（东方蜜蜂孢子虫，后来也广泛感染西方蜜蜂）。它们会影响蜜蜂消化系统与体力，进而影响蜂群产量与越冬能力。","在实际交流中，人们有时会用“nosema”泛指这类感染或病原体；更严格的写法会区分“nosema（病原体）”与“nosemosis（由其引起的疾病）”。"]}
{"word":"nosematidae","summary":{"en":"Nosematidae is a family of microsporidian parasites; some cause nosemosis in bees.","zh":"Nosematidae 指鼻孢子虫科（微孢子虫寄生生物的一科）；其中一些会在蜜蜂中引起鼻孢子虫病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of microscopic parasitic organisms (microsporidia) that infect insects and other animals; some species cause the disease nosemosis (especially in bees).","zh":"鼻孢子虫科（微孢子虫的一科）：一类显微寄生生物，可感染昆虫及其他动物；其中一些种类会引起“诺氏病/鼻孢子虫病”（在蜜蜂中尤常见）。"},"examples":[{"en":"Some Nosematidae species infect honey bees and can weaken a colony over time.","zh":"一些鼻孢子虫科的物种会感染蜜蜂，并可能随着时间推移削弱蜂群。"},{"en":"The researcher identified microsporidia from the family Nosematidae under a microscope.","zh":"研究人员在显微镜下鉴定出来自鼻孢子虫科的微孢子虫。"}]}],"synonyms":["nosematids","Nosema-related microsporidia"],"phonetic":"/ˌnoʊzəˈmætədiː/","extraExplanation":["“Nosematidae”来自模式属“ Nosema（鼻孢子虫属）”，常见于昆虫寄生相关文献与养蜂管理语境。","写作中它通常被当作单数家族名使用（a family: Nosematidae），但在讨论“该科的成员/物种”时也可理解为复数概念。","与蜜蜂相关的常见病原是 Nosema apis 与 Nosema ceranae（均属于微孢子虫类群）；它们会影响蜜蜂肠道与群势，因此在养蜂资料中经常出现。"]}
{"word":"noseover","summary":{"en":"Noseover means an aircraft’s nose pitching down forward, especially during landing or braking; it can be used as a noun or verb in aviation.","zh":"Noseover 指飞机机头向前下沉（机头前栽），常见于着陆或刹车时；航空语境中可作名词或动词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In aviation, a forward pitch where an aircraft’s nose drops down (sometimes suddenly), especially during landing, braking, or taxiing.","zh":"（航空）机头向下俯冲或前倾（有时很突然），常见于着陆、刹车或滑行时。"},"examples":[{"en":"The pilot braked too hard and the plane did a noseover on the runway.","zh":"飞行员刹车过猛，飞机在跑道上发生了“机头前栽”（noseover）。"},{"en":"To avoid a noseover, keep the control stick back while braking in a tailwheel plane.","zh":"为了避免机头前栽，在尾轮飞机刹车时要把操纵杆往后拉。"}]},{"partOfSpeech":"v.","definition":{"en":"To pitch forward so the nose goes down; to tip forward (of an aircraft, or sometimes a vehicle).","zh":"（使）向前俯仰、机头下沉；（飞机，有时也指车辆）向前翻倾。"},"examples":[{"en":"The aircraft nosed over after it hit a soft patch of ground.","zh":"飞机撞上松软地面后机头前栽了。"},{"en":"If you brake abruptly on wet grass, you can noseover.","zh":"在湿草地上突然刹车，你可能会机头前栽。"}]}],"synonyms":["nose-over","pitch forward","tip forward"],"phonetic":"/ˈnoʊzˌoʊvər/","extraExplanation":["“noseover”常写作 nose-over 或 nose over（两词），在飞行训练与事故报告里很常见，尤其与尾轮（tailwheel）飞机有关：重心和刹车作用会让机头更容易向前“压下去”。","它通常不等同于“flip over/roll over”（完全翻覆）。noseover 强调的是机头向下、前倾这一动作；严重时可能会导致翻覆，但词本身先描述“机头前栽”的过程。"]}
{"word":"nosepiece","summary":{"en":"A nosepiece is the part of glasses or other gear that rests on or fits around the nose.","zh":"nosepiece 指眼镜或其他装备上托住或贴合鼻部的部件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of glasses that rests on your nose (often one of two small pads).","zh":"眼镜上托在鼻梁上的部件（常指两侧的小鼻托/鼻垫）。"},"examples":[{"en":"These nosepieces are too tight; they leave red marks on my nose.","zh":"这些鼻托太紧了，会在我鼻子上留下红印。"},{"en":"The optician adjusted the nosepieces so the glasses sit higher.","zh":"验光师调了鼻托，让眼镜戴得更高一些。"}]},{"partOfSpeech":"n.","definition":{"en":"A projecting part on equipment that fits against, covers, or supports the nose (for example on a mask, respirator, or some tools).","zh":"贴合、覆盖或支撑鼻部的突出部件（例如面罩、呼吸器或某些器具上的鼻部结构）。"},"examples":[{"en":"Make sure the mask’s nosepiece is pressed down to seal properly.","zh":"把口罩的鼻梁条按紧，才能更好密封。"},{"en":"The respirator’s nosepiece helps prevent air from leaking upward.","zh":"呼吸器的鼻部结构有助于防止空气向上泄漏。"}]}],"synonyms":["nose pad","nose bridge (part)","nasal piece"],"phonetic":"/ˈnoʊzˌpiːs/","extraExplanation":["在美式英语里，谈眼镜时更常说 nose pads（鼻托/鼻垫），而 nosepiece 也能用但略更“部件名/说明书用语”的感觉。","在口罩语境中，nosepiece 常指可压紧的“鼻梁条/压条”（通常是金属丝或塑条），用于贴合鼻梁减少漏气。"]}
{"word":"nosepinch","summary":{"en":"Nosepinch means either pinching the nose shut with fingers or a small clip that closes the nostrils (often for swimming).","zh":"nosepinch 指“捏住鼻子”的动作，也可指“鼻夹/鼻夹子”（常用于游泳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of pressing your nose closed with your fingers (often to block a bad smell or stop water from going in).","zh":"用手指把鼻子捏住的动作（常用于挡住臭味或防止进水）。"},"examples":[{"en":"He gave his nose a pinch when he walked past the trash can.","zh":"他走过垃圾桶时捏住了鼻子。"},{"en":"Do a quick nose pinch before you jump into the pool.","zh":"跳进泳池前快速捏一下鼻子。"}]},{"partOfSpeech":"n.","definition":{"en":"a small clip or device used to hold the nostrils closed, especially for swimming.","zh":"夹住鼻孔的小夹子（尤其用于游泳）。"},"examples":[{"en":"She wears a nosepinch when she practices synchronized swimming.","zh":"她练花样游泳时会戴鼻夹。"},{"en":"I forgot my nosepinch, so water kept going up my nose.","zh":"我忘了带鼻夹，所以水一直灌进鼻子。"}]},{"partOfSpeech":"v.","definition":{"en":"to press someone’s or your own nose closed with fingers.","zh":"（用手指）捏住（自己或别人的）鼻子。"},"examples":[{"en":"Nosepinch and blow gently to clear your ears.","zh":"捏住鼻子再轻轻吹气，帮助耳朵通气。"}]}],"synonyms":["nose pinch","nose clip","nostril clip"],"phonetic":"/ˈnoʊzˌpɪntʃ/","extraExplanation":["拼写与用法：更常见的写法是分开写 nose pinch，或加连字符 nose-pinch；表示“鼻夹（器具）”时也常说 nose clip。","潜水/耳压平衡：在潜水或坐飞机耳朵不舒服时，常见方法是捏住鼻子、闭口、轻轻向外“吹气”（类似瓦尔萨尔瓦动作），帮助咽鼓管打开、平衡压力。注意要“轻轻”，避免用力过猛。"]}
{"word":"noser","summary":{"en":"“Noser” usually means a face-first fall (“take a noser”). It can also be a rude slang word for someone with a big nose.","zh":"“noser”最常指“脸朝下的摔倒”（take a noser）；也可作带冒犯的俚语，指鼻子很大的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A fall where you hit your face or land forward on your nose; a face-first spill.","zh":"（俚语）脸朝下、往前栽的摔倒；“脸刹”式的跌倒。"},"examples":[{"en":"I slipped on the ice and took a noser.","zh":"我在冰上打滑，摔了个脸朝下。"},{"en":"He tried to jump the curb on his bike and ended up doing a noser.","zh":"他骑车想跳上路沿，结果直接摔了个狗吃屎。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, often rude) A person with a noticeably large nose; also used as an insult.","zh":"（非正式，常带冒犯）鼻子很大的人；也可作辱骂用语。"},"examples":[{"en":"Kids sometimes call him a “noser,” which is unkind.","zh":"孩子们有时叫他“noser”，这很不友善。"}]}],"synonyms":["faceplant","spill","wipeout","tumble"],"phonetic":"/ˈnoʊzər/","extraExplanation":["“take a noser”常见于美式口语，尤其在滑板、滑雪、骑行等语境里，强调“往前栽/脸着地”的摔法。","把人叫作“noser”多半涉及外貌取笑，容易伤人；日常交流更建议用中性表达（如直接描述外形特征，或避免评论外貌）。"]}
{"word":"noses","summary":{"en":"“Noses” most commonly means the plural of “nose,” and it can also be a verb form meaning “moves forward slowly” or “sniffs/searches for information.”","zh":"“noses”最常见是“鼻子”的复数；也可作动词形式，表示“慢慢顶着前进”或“到处嗅探/打探消息”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nose”: the part of the face used for smelling and breathing.","zh":"“nose”的复数：鼻子（用来闻气味和呼吸的面部器官）。"},"examples":[{"en":"In winter, many people’s noses get dry.","zh":"冬天很多人的鼻子会变干。"},{"en":"The children pressed their noses against the window.","zh":"孩子们把鼻子贴在窗户上。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “nose”: to push or move slowly and carefully, especially by using the front part; to search or sniff around for information.","zh":"“nose”的第三人称单数：用前端慢慢顶/探着前进；（常含贬义）到处打探、嗅探消息。"},"examples":[{"en":"The car noses forward in heavy traffic.","zh":"车在拥堵的车流中慢慢往前挪。"},{"en":"He always noses around in other people’s business.","zh":"他总爱打听别人家的事。"}]}],"synonyms":["nostrils (related, not the same)","sniff (verb, related)","pry (verb, related)","edge forward (verb phrase, related)"],"phonetic":"/ˈnoʊzɪz/","extraExplanation":["常见相关表达：\n1) “follow your nose”＝凭直觉/顺着路一直走。\n2) “turn up your nose (at)”＝对……嗤之以鼻/看不起。\n3) “keep your nose out of …”＝别插手/别多管闲事。"]}
{"word":"nosesmart","summary":{"en":"“Nose-smart” means having a strong, sensitive sense of smell.","zh":"“nose-smart”指嗅觉灵敏、善于通过气味发现或分辨事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or animal) having a strong sense of smell; good at detecting things by scent.","zh":"（人或动物）嗅觉灵敏的；善于靠气味发现事物的。"},"examples":[{"en":"Bloodhounds are famously nose-smart and can follow a trail for miles.","zh":"寻血猎犬以嗅觉灵敏著称，能追踪好几英里的气味线索。"},{"en":"The police used a nose-smart dog to search for missing hikers.","zh":"警方用一只嗅觉灵敏的警犬搜寻失踪的徒步者。"},{"en":"She’s nose-smart—she can tell what spices are in the soup just by smelling it.","zh":"她嗅觉很灵，光闻一闻就能分辨汤里放了哪些香料。"}]}],"synonyms":["keen-nosed","sharp-nosed","scent-sensitive"],"phonetic":"/ˈnoʊz smɑrt/","extraExplanation":["“nose-smart”多见于较口语或描述性写作，常用来形容狗、狼等动物嗅觉强，也可引申形容人很会“闻出”细微差别。","拼写上常见加连字符 nose-smart；不加连字符（nosesmart）较少见，可能是输入或品牌/用户名写法。","相关表达：keen-nosed（嗅觉敏锐的）、have a good nose（很会闻/很会察觉）、sniff out（嗅出；查出）。"]}
{"word":"nosethirl","summary":{"en":"Nosethirl (often written “nose thirl”) is a Scots/dialect word meaning “nostril.”","zh":"Nosethirl（常写作“nose thirl”）是苏格兰英语/方言词，意思是“鼻孔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nostril (one of the two openings of the nose); a dialect/Scots word","zh":"鼻孔（鼻子上的两个开口之一）；方言/苏格兰英语用词"},"examples":[{"en":"In Scots, “nose thirl” simply means “nostril.”","zh":"在苏格兰英语里，“nose thirl”就等于“nostril（鼻孔）”。"},{"en":"Cold air rushed in through his nose thirls.","zh":"冷空气从他的鼻孔里猛地灌进去。"}]}],"synonyms":["nostril"],"phonetic":"/ˈnoʊzˌθɝl/","extraExplanation":["“nosethirl”更常见的写法是分开的“nose thirl”。其中 thirl 在苏格兰语/北英格兰方言里有“孔、洞、开口”的意思（也可作动词表示“打孔/穿孔”）。","现代标准英语中通常用 nostril；“nose thirl”多见于方言、民间故事、地方文学或需要营造地域口吻的写作。"]}
{"word":"nosetiology","summary":{"en":"Nosetiology is a rare medical term meaning the study of what causes diseases (etiology).","zh":"Nosetiology 是较少使用的医学词，指对疾病成因的研究（病因学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) The study of the causes of diseases; disease etiology.","zh":"（医学，较少用）对疾病病因的研究；疾病的病因学。"},"examples":[{"en":"The paper focuses on the nosetiology of viral pneumonia.","zh":"这篇论文聚焦于病毒性肺炎的病因学研究。"},{"en":"Modern genetics has changed how we think about nosetiology.","zh":"现代遗传学改变了我们对疾病病因学的理解。"}]}],"synonyms":["etiology","pathogenesis (related)","causation"],"phonetic":"/ˌnoʊziˌiːtiˈɑːlədʒi/","extraExplanation":["该词由前缀 noso-（“疾病”，源自希腊语 nosos）+ etiology（“病因学”）构成，字面意思就是“疾病的病因学”。","在当代医学英语中更常用的是 etiology（病因/病因学）或 the etiology of a disease（某疾病的病因），因此 nosetiology 多见于较老或较专业的文献。"]}
{"word":"nosewards","summary":{"en":"“Nosewards” means moving or pointing toward the nose (the front of the face), mainly used in anatomical or medical contexts.","zh":"“nosewards”表示“朝向鼻子（面部前方）”，主要用于解剖或医学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the nose; in the direction of the front of the face (anatomy/medicine).","zh":"朝向鼻子；向面部前方的方向（多用于解剖/医学语境）。"},"examples":[{"en":"The swelling seemed to spread nosewards from the cheek.","zh":"肿胀似乎从脸颊向鼻子方向扩散。"},{"en":"Gently guide the tube nosewards, not upward.","zh":"轻轻把管子朝鼻子方向引导，而不是往上推。"}]}],"synonyms":["toward the nose","forward","anteriorly"],"phonetic":"ˈnoʊz.wɚdz","extraExplanation":["“nosewards”属于较少见的方向副词，更常见于医学、解剖学或护理操作说明中，用来描述“朝鼻子/前方”的移动方向。","拼写上也可能看到带连字符的形式“nose-wards”。日常英语里通常会用更自然的说法：toward the nose / toward the front / forward。"]}
{"word":"nosewheel","summary":{"en":"A nosewheel is the front landing-gear wheel of an aircraft, used to support the nose and steer on the ground.","zh":"nosewheel 指飞机起落架前部的鼻轮，用于支撑机头并在地面转向滑行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small wheel (or set of wheels) at the front of an aircraft’s landing gear that supports the nose and helps with steering on the ground.","zh":"（飞机起落架的）前轮/鼻轮：位于机头下方的小轮（或轮组），用于支撑机头并帮助飞机在地面滑行与转向。"},"examples":[{"en":"The pilot used the nosewheel to steer the plane onto the runway.","zh":"飞行员用鼻轮把飞机转向并滑行到跑道上。"},{"en":"Maintenance crews inspected the nosewheel for wear after landing.","zh":"着陆后，维修人员检查鼻轮是否有磨损。"}]}],"synonyms":["nose wheel"],"phonetic":"/ˈnoʊzˌwiːl/","extraExplanation":["nosewheel 常见于航空英语与技术手册中；日常口语里也会说 nose wheel（分开写）。","很多客机采用“前三点式”起落架（tricycle landing gear）：两个主轮（main landing gear）在机身中后部，一个鼻轮在前部；鼻轮通常与“前轮转向系统”（nosewheel steering / NWS）相关。"]}
{"word":"nosewing","summary":{"en":"Nosewing means the outer flared edge of a nostril (nasal wing/ala).","zh":"nosewing 指“鼻翼”，也就是鼻孔外侧可张开的边缘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The flared outer side of a nostril; the soft edge of the nose that can widen when you breathe hard (also called the “nasal wing” or “ala”).","zh":"鼻翼；鼻孔外侧柔软的边缘，呼吸用力时可能会张开（也可称“鼻翼/鼻翅”，医学上常用 ala）。"},"examples":[{"en":"His nosewings flared as he tried to catch his breath after running.","zh":"他跑完后努力喘气，鼻翼都张开了。"},{"en":"The doctor noted mild redness around the nosewing.","zh":"医生记录到鼻翼周围有轻微发红。"}]}],"synonyms":["nasal wing","ala","wing of the nose"],"phonetic":"/ˈnoʊzˌwɪŋ/","extraExplanation":["“nosewing”在日常英语里不常见；更常见的说法是“nostril”或“(the) wings of the nose / nasal wings”。在医学语境中常用拉丁词“ala”（复数“alae”）来指“鼻翼”。","在描述呼吸困难或紧张时，英语里常见搭配是“nostrils/nasal wings flare”（鼻翼翕动/张开）。"]}
{"word":"nosewise","summary":{"en":"Nosewise means either “by using smell” or “regarding the nose.”","zh":"nosewise 可表示“靠嗅觉”，也可表示“就鼻子而言”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"by using the sense of smell; by sniffing (often of animals).","zh":"靠嗅觉；通过闻（常用于动物）。"},"examples":[{"en":"The dog found the hidden food nosewise, following the scent across the grass.","zh":"狗靠嗅觉找到了藏起来的食物，顺着气味穿过草地。"},{"en":"In the dark, the puppy moved nosewise toward the bowl.","zh":"在黑暗中，小狗靠着闻味朝碗的方向走去。"}]},{"partOfSpeech":"adv.","definition":{"en":"in terms of the nose; as far as the nose is concerned (about shape, size, etc.).","zh":"就鼻子而言；从鼻子的方面来说（如形状、大小等）。"},"examples":[{"en":"Nosewise, he looks a lot like his father.","zh":"就鼻子而言，他很像他父亲。"},{"en":"She’s fine nosewise after the surgery, with less swelling now.","zh":"手术后从鼻子这方面看她恢复得不错，现在肿胀更小了。"}]}],"synonyms":["by smell","by scent","by sniffing","in terms of (the nose)","as far as (the nose) goes"],"phonetic":"/ˈnoʊzˌwaɪz/","extraExplanation":["“nosewise”由 nose（鼻子）+ -wise（在……方面；以……方式）构成，意思常见于口语或较随意的写作。也常写作 “nose-wise”。","在更正式的表达里，常用 “by smell / by scent” 表示“靠嗅觉”，用 “in terms of his/her nose” 表示“就鼻子而言”。"]}
{"word":"nosewort","summary":{"en":"Nosewort is an old word for a medicinal herb used for nasal problems or as snuff to cause sneezing.","zh":"Nosewort 是一个旧词，指用于鼻部不适或做鼻烟以促使打喷嚏的药草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A plant used to treat nose problems or as snuff to make someone sneeze; often referring to herbs like asarabacca or sneezewort in old herbal books.","zh":"（古语）指一种用于治疗鼻部不适或做成鼻烟以诱发打喷嚏的草药；在旧时草药书中常指欧细辛（asarabacca）或喷嚏草（sneezewort）等。"},"examples":[{"en":"In some old herbals, nosewort was dried and ground to use as snuff.","zh":"在一些旧时草药书里，nosewort 会被晒干研磨，用作鼻烟。"},{"en":"The apothecary recommended nosewort for a blocked nose.","zh":"药剂师推荐用 nosewort 来缓解鼻塞。"}]}],"synonyms":["sneezewort","asarabacca","snuff herb"],"phonetic":"/ˈnoʊzˌwɝt/","extraExplanation":["“nosewort”属于较罕见、带历史色彩的词，多见于古英语草药文献而非现代日常英语。","它并不稳定对应某一种植物：不同地区与作者可能把不同“与鼻子相关”的药草称作 nosewort，常见候选包括欧细辛（asarabacca）与喷嚏草（sneezewort），用途通常与“通鼻、催喷嚏”有关。"]}
{"word":"nosey","summary":{"en":"Nosey (also spelled nosy) usually means being too interested in other people’s private business; it can also mean having a strong smell.","zh":"nosey（也拼作nosy）通常指爱打听、爱管闲事；也可指气味很重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too curious about other people’s private matters; always trying to find out personal information.","zh":"爱打听的；爱管闲事的；对别人私事过分好奇的。"},"examples":[{"en":"My neighbor is a bit nosey and always asks who I’m dating.","zh":"我的邻居有点爱打听，总问我在跟谁约会。"},{"en":"It’s rude to be nosey about someone’s salary.","zh":"对别人的工资过分打听是很不礼貌的。"},{"en":"She gave me a nosey look at my phone screen.","zh":"她朝我的手机屏幕探头看了一眼，显得很爱打听。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a strong smell (often used for food, drinks, or places).","zh":"（气味）很重的；有浓烈味道的（常用于食物、饮品或环境）。"},"examples":[{"en":"This cheese is really nosey, so I keep it in a sealed container.","zh":"这奶酪味道很重，所以我把它放在密封盒里。"},{"en":"The fish market can be pretty nosey in the afternoon.","zh":"下午的鱼市味道会很重。"}]}],"synonyms":["nosy","inquisitive","prying","meddlesome","intrusive"],"phonetic":"/ˈnoʊzi/","extraExplanation":["“Nosey”常见于美式英语，也常拼作“nosy”。两者意思一样；“nosy”更常见、更中性一些，“nosey”更口语、带点调侃。","这个词来自“nose（鼻子）”，形象地表示“把鼻子伸进别人的事里”。因此它通常带负面评价：好奇可以是“curious”（中性/积极），但“nosey/nosy”更像“爱打听、越界”。"]}
{"word":"nosh","summary":{"en":"“Nosh” means a snack or light meal, or to snack casually (informal).","zh":"“nosh”指小吃/简餐，或指随便吃点零食（非正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A small snack or light meal.","zh":"（非正式）小吃；简餐。"},"examples":[{"en":"We grabbed a quick nosh before the movie.","zh":"看电影前我们随便吃了点小东西。"},{"en":"There are some great late-night noshes in this neighborhood.","zh":"这个街区有不少很棒的深夜小吃。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To eat snacks or eat casually, often between meals.","zh":"（非正式）吃点心；随便吃点（常指两餐之间）。"},"examples":[{"en":"I was noshing on chips while studying.","zh":"我学习时一直在吃薯片。"},{"en":"Stop noshing and save room for dinner.","zh":"别一直吃零食了，留点肚子吃晚饭。"}]}],"synonyms":["snack","bite","munch"],"phonetic":"/nɑʃ/","extraExplanation":["“nosh”常见于美式英语的口语里，语气轻松随意，通常指“垫垫肚子”的吃法，不像“meal”那样正式。","这个词来源于意第绪语（Yiddish）“nashn”（意为“啃、吃零食”），在纽约等有犹太文化影响的地区更常听到；也常出现在谈论熟食店（deli）或街头小吃的语境中。","常见搭配：a quick nosh（随便吃点）、grab a nosh（去弄点吃的）、late-night nosh（宵夜小吃）。"]}
{"word":"noshed","summary":{"en":"“Noshed” means “ate (snacked) casually,” the past tense of “nosh.”","zh":"“Noshed”表示“随便吃了点东西（打了牙祭）”，是“nosh”的过去式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Ate food (often snacks) in a casual way; past tense of “nosh.”","zh":"（随意地）吃了点东西，打了牙祭；“nosh”的过去式。"},"examples":[{"en":"We noshed on sandwiches while we waited for the train.","zh":"我们等火车时随便吃了些三明治。"},{"en":"After the meeting, everyone noshed on cookies and fruit.","zh":"会后，大家吃了些饼干和水果。"}]}],"synonyms":["snacked","munched","ate","had a bite"],"phonetic":"/nɑʃt/","extraExplanation":["“nosh”是比较口语、轻松的说法，常指“随便吃点零食/小吃”，语气比“eat”更随意。","词源来自意第绪语（Yiddish）和德语相关词，常见于北美英语里与犹太饮食文化相关的语境中（后来也普遍用于日常英语）。","用法提示：现在时常写作“nosh”，过去式可以写“noshed”。也常见“nosh on + 食物”。"]}
{"word":"nosher","summary":{"en":"A “nosher” is someone who likes to snack or eat casually; less commonly, it can mean a small snack.","zh":"“nosher”指爱吃零食、随口吃点东西的人；较少情况下也可指一份小吃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who enjoys eating snacks or light meals (often informally), or someone who eats casually rather than having a full meal","zh":"爱吃零食或爱随口吃点东西的人（常为非正式用语）；不一定吃正餐、喜欢随意吃点的人"},"examples":[{"en":"I’m more of a nosher—I’ll grab a sandwich and snack during the day.","zh":"我比较像个爱随口吃的人——白天随便抓个三明治再吃点零食。"},{"en":"At parties, she’s a nosher who keeps coming back to the appetizer table.","zh":"在派对上，她特别爱吃小点心，总是回到开胃菜那桌。"}]},{"partOfSpeech":"n.","definition":{"en":"a snack or small amount of food (less common)","zh":"小吃；少量食物（较不常见）"},"examples":[{"en":"Let’s get a quick nosher before the movie.","zh":"看电影前我们先随便吃点小东西吧。"}]}],"synonyms":["snacker","grazer","muncher"],"phonetic":"/ˈnɑʃɚ/","extraExplanation":["“nosher”来自动词“nosh”（随意吃、吃点小东西），在美式英语里偏口语、带点轻松幽默的感觉。","“nosh”常被认为与意第绪语（Yiddish）有关，因此在美国一些犹太饮食文化或熟食店（deli）语境中也很常见。","常见搭配：a nosher（爱吃零食的人），grab a nosh（去吃点东西），nosh on chips/fruit（吃薯片/水果）。"]}
{"word":"noshers","summary":{"en":"“Noshers” means people who like to snack (plural of “nosher”); it can also be a vulgar slang term in some contexts.","zh":"“noshers”指爱吃零食的人（“nosher”的复数）；在某些语境中也有粗俗俚语含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who likes to snack or eat casually (someone who “noshes”)","zh":"爱吃零食的人；随口吃点东西的人（爱“nosh”的人）"},"examples":[{"en":"There were plenty of noshers at the party, hovering near the appetizer table.","zh":"派对上有很多爱吃零食的人，围在开胃菜桌旁。"},{"en":"I’m more of a nosher than a big-meal person.","zh":"比起吃大餐，我更像是个爱随口吃点的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(vulgar slang) a person who performs oral sex on someone","zh":"（粗俗俚语）为他人进行口交的人"},"examples":[{"en":"That word can be vulgar in some contexts, so be careful using it.","zh":"这个词在某些语境里可能很粗俗，使用时要小心。"}]}],"synonyms":["snackers","grazers","nibblers"],"phonetic":"/ˈnɑʃɚ/","extraExplanation":["“nosher”来自动词“nosh”（随口吃、吃点零食），而“nosh”源于意第绪语（Yiddish），在美式英语里常带一点轻松、口语的感觉。","日常场合更安全的说法有“snacker”（爱吃零食的人）或“someone who likes to snack”。第二个粗俗含义在普通对话中应避免。"]}
{"word":"noshes","summary":{"en":"“Noshes” means snacks, or the act of snacking casually (informal).","zh":"“noshes”指“零食/小吃”（复数），也可指“随意吃点零食”的动作（非正式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to eat (often snacks) casually or with enjoyment; to snack","zh":"（常指随意地、享受地）吃点心；吃零食"},"examples":[{"en":"We noshed on popcorn while watching a movie.","zh":"我们看电影时一边吃爆米花当零食。"},{"en":"She kept noshing throughout the long meeting.","zh":"在漫长的会议中她一直在吃零食。"}]},{"partOfSpeech":"n.","definition":{"en":"a snack or small amount of food (often informal)","zh":"（非正式）零食；小吃"},"examples":[{"en":"Let’s grab a quick nosh before the show.","zh":"演出前我们先随便吃点小吃吧。"},{"en":"The café has light noshes like bagels and soup.","zh":"这家咖啡馆有一些清淡小吃，比如贝果和汤。"}]},{"partOfSpeech":"n.","definition":{"en":"snacks; small bites of food (plural form of “nosh”)","zh":"（复数）零食；小吃"},"examples":[{"en":"They put out noshes for guests: nuts, crackers, and fruit.","zh":"他们给客人准备了零食：坚果、饼干和水果。"}]}],"synonyms":["snacks","bites","munch","nibble"],"phonetic":"/nɑʃ/","extraExplanation":["“nosh”源自意第绪语（Yiddish），在美国英语里很常见，尤其与犹太饮食文化相关的语境中；语气偏口语、轻松。","常见搭配：nosh on + 食物（吃……当零食）；a quick nosh（随便吃点）。"]}
{"word":"noshing","summary":{"en":"“Noshing” means casually eating snacks or small amounts of food.","zh":"“noshing”指随意地吃零食或吃点东西（口语、非正式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"eating (often snacks) in a casual, informal way; nibbling.","zh":"随意地吃（通常指零食）；小口小口地吃。"},"examples":[{"en":"We were noshing on chips while we watched the game.","zh":"我们一边看比赛一边随便吃着薯片。"},{"en":"She kept noshing throughout the movie.","zh":"她在电影期间一直在吃零食。"}]},{"partOfSpeech":"n.","definition":{"en":"casual snacking; the act of eating small amounts of food informally.","zh":"随意吃零食；（非正式）吃点东西的行为。"},"examples":[{"en":"The party had music, drinks, and plenty of noshing.","zh":"派对有音乐、饮料，还有很多随便吃的点心。"}]}],"synonyms":["snacking","nibbling","munching","grazing"],"phonetic":"/ˈnɑʃɪŋ/","extraExplanation":["“nosh”来自意第绪语（Yiddish），在美国英语里很常见，带有轻松、带点“嘴馋”的语气，通常指吃零食或边做别的事边吃。","语域：口语、非正式。比“eat”更强调“随手吃、解馋、吃零嘴”的感觉。"]}
{"word":"nosier","summary":{"en":"“Nosier” means “more nosey/nosy”—more interested in other people’s private business.","zh":"“Nosier”表示“更爱打听/更爱窥探隐私的”，是“nosey/nosy”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too interested in other people’s private business; always trying to find out personal information.","zh":"（对别人的私事）爱打听的；爱窥探的；好管闲事的。"},"examples":[{"en":"My nosier neighbor keeps asking who is coming to my apartment.","zh":"我那个爱打听的邻居总问谁来我家。"},{"en":"Try not to be nosier than you need to be—give people privacy.","zh":"别太爱打听——给别人一点隐私。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Comparative form of “nosey/nosy”) more curious about other people’s private matters than someone else.","zh":"（“nosey/nosy”的比较级）比……更爱打听/更爱窥探隐私的。"},"examples":[{"en":"He’s getting nosier as he gets older.","zh":"他年纪越大越爱打听了。"},{"en":"She’s nosier than her sister about everyone’s relationships.","zh":"她比她妹妹更爱打听别人的感情状况。"}]}],"synonyms":["more nosey","more nosy","more intrusive","more prying"],"phonetic":"/ˈnoʊziər/","extraExplanation":["“nosier”是形容词“nosey/nosy”的比较级，意思是“更爱打听的”。拼写上常见两种：nosey（更常见）和nosy（也很常见、较简洁）。两者意思相同。","这个词通常带一点负面或不礼貌的感觉，强调“打探隐私、越界的好奇”。更中性的说法可以用“curious（好奇的）”。"]}
{"word":"nosiest","summary":{"en":"“Nosiest” means either the most intrusive/curious about others’ private business, or (less commonly) the loudest/noisiest.","zh":"“nosiest”表示“最爱打听别人私事/最爱多管闲事的”，较少见时也可表示“最吵的/噪音最大的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most curious about other people’s private matters; always trying to find out personal information.","zh":"最爱打听别人私事的；最爱多管闲事的。"},"examples":[{"en":"She’s the nosiest person in the office—she always asks who you’re dating.","zh":"她是办公室里最爱打听的人——总是问你在跟谁交往。"},{"en":"Our nosiest neighbor watches everything that happens on the street.","zh":"我们最爱管闲事的邻居会盯着街上发生的每件事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Making the most noise; loudest.","zh":"最吵的；噪音最大的。"},"examples":[{"en":"This model is one of the nosiest air conditioners I’ve ever used.","zh":"这款空调是我用过最吵的之一。"},{"en":"The kitchen is the nosiest room during dinner time.","zh":"晚饭时间厨房是最吵的房间。"}]}],"synonyms":["most nosy","most nosey","most inquisitive (often negative)","most intrusive","loudest","noisiest"],"phonetic":"/ˈnoʊziəst/","extraExplanation":["“nosiest”是形容词“nosey / nosy”的最高级。拼写上两种都常见：nosey更接近英式拼写，nosy在美式英语里很常见。","“nosy（爱打听）”来自“nose（鼻子）”的形象比喻：把鼻子伸进不该管的事情里。口语里也常说：Don’t be nosy.（别多管闲事/别瞎打听。）","注意区分：nosy（爱打听，偏负面评价） vs. curious（好奇，语气更中性甚至正面）。"]}
{"word":"nosig","summary":{"en":"“nosig” is an informal shorthand most often meaning “no signal,” and sometimes meaning “no signature” online.","zh":"“nosig”是非正式缩写，最常见表示“没有信号”，在部分网络语境中也可表示“没有签名档”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal abbreviation) “no signal” — used when a TV, monitor, phone, or radio is not receiving a usable signal.","zh":"（非正式缩写）“没有信号”——用于表示电视、显示器、手机或收音设备未接收到可用信号。"},"examples":[{"en":"The screen says “nosig,” so the HDMI cable might be loose.","zh":"屏幕显示“nosig”，所以 HDMI 线可能松了。"},{"en":"I’m getting nosig on the radio in this tunnel.","zh":"我在这个隧道里收音机显示没信号。"}]},{"partOfSpeech":"other","definition":{"en":"(online/forum slang) “no signature” — meaning the user has no signature line in posts.","zh":"（网络/论坛俚语）“没有签名档”——指用户发帖时不显示签名。"},"examples":[{"en":"Your profile shows nosig, so your posts don’t include a quote or tagline.","zh":"你的资料显示 nosig，所以你的帖子不会附带引用或个性签名。"}]}],"synonyms":["no signal","no reception","no service","(forum) no signature"],"phonetic":"/ˈnoʊ sɪɡ/","extraExplanation":["“nosig”更常见于设备界面或聊天中，等同于写成“no signal”。有的显示器会直接在画面上弹出“NO SIG / NO SIGNAL”。","在论坛语境里，“sig”常指 signature（签名档）。因此“nosig”也可能表示“没有签名”，但这个用法依平台而定。"]}
{"word":"nosily","summary":{"en":"“Nosily” means prying into other people’s private business in an annoying or impolite way.","zh":"“Nosily”指以令人反感或不礼貌的方式打听、窥探别人的私事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is too curious about other people’s private matters; prying","zh":"爱打听地；爱窥探隐私地；多管闲事地"},"examples":[{"en":"The neighbors were nosily asking where she got her money.","zh":"邻居们爱打听地问她的钱是从哪儿来的。"},{"en":"He nosily read over my shoulder while I was texting.","zh":"我发短信时，他凑过来爱窥探地从我肩膀上偷看。"},{"en":"She tried not to listen nosily, but the conversation was loud.","zh":"她尽量不去偷听，但对话声音太大了。"}]}],"synonyms":["pryingly","intrusively","meddlesomely","inquisitively"],"phonetic":"/ˈnoʊzəli/","extraExplanation":["“nosily”来自形容词“nosy”（爱打听的、爱管闲事的）加副词后缀“-ly”。语气通常带批评，暗示越界、不礼貌。","常见搭配：ask nosily（爱打听地问）、peer nosily（探头窥看）、listen nosily（偷听）。","近义词小区别：nosily更强调“打听别人隐私”；curiously更多是“出于好奇”不一定冒犯；intrusively更正式，强调“侵入/打扰”。"]}
{"word":"nosine","summary":{"en":"“Nosine” is usually not a standard word; it’s likely a misspelling (often of “inosine” or “no sign”).","zh":"“Nosine” 通常不是标准英文词；多半是拼写错误（常见为 “inosine（肌苷）” 或 “no sign（没有迹象）”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often a misspelling of a similar-looking word (such as “inosine” or “no sign”).","zh":"不是常见词典中的标准英文单词；多半是对外形相近词的拼写错误（例如 “inosine（肌苷）” 或短语 “no sign（没有迹象）”）。"},"examples":[{"en":"I couldn’t find “nosine” in the dictionary—did you mean “inosine”?","zh":"我在词典里找不到 “nosine”——你是不是想写 “inosine（肌苷）”？ "},{"en":"If you meant “no sign,” you can say: There was no sign of damage.","zh":"如果你想表达 “no sign（没有迹象）”，可以说：There was no sign of damage.（没有损坏的迹象。）"}]}],"phonetic":"/ˈnoʊsaɪn/","extraExplanation":["“Nosine” 本身在英语中不常用、也缺少稳定的标准释义。最常见的两种情况：\n1）你可能想写 “inosine” /aɪˈnoʊsiːn/，这是生物化学名词（肌苷，一种核苷）；\n2）你可能想表达短语 “no sign（没有迹象/没有标志）”。\n如果你告诉我你看到它的句子或领域（医学/运动补剂/日常对话），我可以帮你锁定正确的词。"]}
{"word":"nosiness","summary":{"en":"Nosiness means intrusive curiosity about other people’s private business.","zh":"Nosiness 指对别人私事过度好奇、爱打听（通常带负面意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit of being too interested in other people’s private lives or affairs; intrusive curiosity.","zh":"爱打听；爱管闲事；对他人隐私过度好奇（带冒犯意味）。"},"examples":[{"en":"Her nosiness made her ask questions that were too personal.","zh":"她爱打听，问了些太私人的问题。"},{"en":"I don’t mind curiosity, but nosiness crosses a line.","zh":"我不介意好奇心，但爱打听就越界了。"},{"en":"He apologized for his nosiness after reading her messages over her shoulder.","zh":"他从她肩膀上偷看她的信息后，为自己的爱打听道了歉。"}]}],"synonyms":["intrusiveness","prying","meddling","busybodiness"],"phonetic":"/ˈnoʊ.zi.nəs/","extraExplanation":["“nosiness”通常带负面评价，强调“侵入性”的好奇；中性或偏正面的“好奇”更常用curiosity。","常见搭配：nosiness about (someone’s life)（对……的私事爱打听）；annoying nosiness（令人讨厌的爱打听）；a touch of nosiness（有点爱打听）。","相关词：nosy（adj. 爱打听的），nosey parker（英式口语：爱管闲事的人）。在美式英语里也能听到，但更常说nosy person。"]}
{"word":"nosinesses","summary":{"en":"“Nosinesses” means repeated or various acts of being too curious about other people’s private business.","zh":"“Nosinesses”指多次或多种“过分好奇、打听他人私事”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of nosiness: instances or qualities of being too interested in other people’s private matters","zh":"nosiness 的复数形式：指多次或多种“爱管闲事、爱打听别人隐私”的行为或特质"},"examples":[{"en":"Her repeated nosinesses made her coworkers uncomfortable.","zh":"她一再爱打听的行为让同事们很不自在。"},{"en":"The book shows the small nosinesses of village life—everyone knows everyone’s business.","zh":"这本书展现了乡村生活中一些小小的“爱打听”——人人都知道别人的事。"},{"en":"Try not to let other people’s nosinesses ruin your mood.","zh":"别让别人的爱管闲事影响你的心情。"}]}],"synonyms":["prying","intrusiveness","meddling","curiosity (often negative in this context)","nosiness"],"phonetic":"/ˈnoʊzinəsɪz/","extraExplanation":["“Nosiness”通常是不可数名词（a lot of nosiness），但在谈“不同表现/多次行为”时也可以用复数“nosinesses”，语气较少见、偏强调。更常见的说法是用可数名词：prying questions（刺探的问题）、intrusions（打扰）、meddling（干涉）。"]}
{"word":"nosing","summary":{"en":"“Nosing” usually means sniffing with the nose, or slowly pushing/moving the front part into something; informally it can mean prying for information.","zh":"“nosing”常指“嗅闻”，也可指（用前端）缓慢探入/推进；口语里还可指“到处打探、窥探”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of sniffing (using the nose to smell), or the act of pushing your nose close to something to smell it","zh":"嗅闻；把鼻子凑近去闻（用鼻子去辨别气味的动作）"},"examples":[{"en":"The dog’s nosing found the hidden treats quickly.","zh":"狗靠嗅闻很快找到了藏起来的零食。"},{"en":"She leaned in for a quick nosing of the flowers.","zh":"她凑近花朵快速闻了一下。"}]},{"partOfSpeech":"v.","definition":{"en":"moving with the nose or front part first; pushing into something slowly or carefully (often of a vehicle, animal, or person)","zh":"（用前端/鼻部）缓慢地探入、顶入；（车辆/动物/人）小心地向前挪入"},"examples":[{"en":"The car came nosing into the parking space.","zh":"那辆车慢慢探入停车位。"},{"en":"A fox was nosing through the snow for food.","zh":"一只狐狸在雪地里拱着找食物。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) looking around in a curious or intrusive way; trying to find out other people’s private business","zh":"（非正式）到处打探、窥探；探听别人的私事"},"examples":[{"en":"Stop nosing around in my desk drawers.","zh":"别在我的抽屉里乱翻打探了。"},{"en":"He’s always nosing for gossip.","zh":"他总爱到处打听八卦。"}]},{"partOfSpeech":"n.","definition":{"en":"the shape or design of the front part (“nose”) of a vehicle, aircraft, ship, etc.","zh":"（交通工具等的）前端/机鼻/船艏的造型或结构"},"examples":[{"en":"The new train’s nosing reduces wind noise at high speed.","zh":"新列车的车头造型能降低高速风噪。"},{"en":"Engineers tested the airplane’s nosing in a wind tunnel.","zh":"工程师在风洞里测试了飞机机鼻的设计。"}]}],"synonyms":["sniffing","snuffling","edging in","nudging","prying","snooping"],"phonetic":"/ˈnoʊzɪŋ/","extraExplanation":["“nosing”常见于两类用法：\n1）作名词，表示“嗅闻/闻一闻”的动作（多用于动物，如dog’s nosing）。\n2）作动词现在分词/动名词，来自动词“nose”，本义是“用鼻子探、嗅”，引申为“（前端）慢慢探入”以及口语里的“爱打探”。\n\n常见搭配：nose around（到处打探/乱翻）、nose into（慢慢探入/把鼻子伸进）、nose for（对某事很敏锐：have a nose for trouble）。"]}
{"word":"nosings","summary":{"en":"“Nosings” most commonly means the projecting front edges of stair steps; it can also mean slow forward movement with the front part first.","zh":"“Nosings”最常指楼梯踏步前沿的凸出部分（踏步鼻口）；也可指用前端缓慢探入的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the projecting front edge of a stair step (the part that hangs slightly over the step below)","zh":"（楼梯踏步的）前沿凸出部分；踏步鼻口"},"examples":[{"en":"Be careful—your foot can catch on the stair nosing.","zh":"小心——你的脚可能会被楼梯的踏步鼻口绊到。"},{"en":"The contractor installed metal nosings to prevent wear on the steps.","zh":"承包商安装了金属踏步鼻口条来减少台阶磨损。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of moving forward slowly with the front part first, as if using a nose (of a person, animal, car, or ship)","zh":"（人/动物/车辆/船只等）用前端缓慢探入；探行"},"examples":[{"en":"The car’s nosing into the parking space took a few tries.","zh":"那辆车慢慢探进车位，试了好几次才停好。"},{"en":"We watched the boat nosing toward the dock.","zh":"我们看着船慢慢靠向码头。"}]}],"synonyms":["stair edge","stair trim","stair nosing strip","creeping forward","edging forward"],"phonetic":"/ˈnoʊzɪŋz/","extraExplanation":["“Nosings”通常是名词复数，最常见在建筑/装修语境里，指楼梯踏步前沿的“鼻口”（凸出边）。有时也指台阶前沿加装的防滑条（例如金属或橡胶）。","别和“nosiness（爱打听、爱管闲事）”混淆：nosings（踏步鼻口/探入动作）与 nosiness（好奇、爱打听）意义不同。","相关常用表达：nosing around（到处打探、东翻西找），多带一点“偷偷摸摸/好奇心过强”的语气。"]}
{"word":"nosism","summary":{"en":"Nosism is the practice of a single person saying “we” instead of “I.”","zh":"Nosism 指一个人用“we（我们）”代替“I（我）”的表达方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the use of “we” instead of “I,” especially by a single speaker (for example, a king, an author, or a doctor)","zh":"（单个说话者）用“we（我们）”代替“I（我）”的说法，常见于君主、作者或医生等语境"},"examples":[{"en":"The king’s speech used nosism: “We are not amused.”","zh":"国王的演讲使用了 nosism（“君主式复数”）：“We are not amused（朕不高兴）。”"},{"en":"In academic writing, some authors use nosism to sound more formal: “We argue that…”","zh":"在学术写作中，有些作者用 nosism 来显得更正式：“We argue that…（我们认为……）。”"},{"en":"A doctor might say, “How are we feeling today?”—a mild kind of nosism.","zh":"医生可能会说：“How are we feeling today?（我们今天感觉怎么样呀？）”——这是一种较温和的 nosism。"}]}],"synonyms":["royal we","editorial we","first-person plural (used for singular speaker)"],"phonetic":"/ˈnoʊzɪzəm/","extraExplanation":["Nosism 来自拉丁语 nos（“我们”）+ -ism（表示一种“用法/主义”）。它常与“royal we（君主式复数）”或“editorial we（编辑式复数）”相关。","在医疗场景里使用 “we” 有时是为了拉近距离、表达关怀，但也可能让部分人觉得被“替代发言”；是否礼貌取决于语气与文化习惯。"]}
{"word":"nosite","summary":{"en":"“nosite” is uncommon in standard English; it usually means “not on site/remote” (no-site) or “no website/page available” (no site).","zh":"“nosite”不是常见标准英语；通常指“非现场/远程”（no-site）或“没有网站/页面不可用”（no site）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not on a physical site; done remotely or away from the location (often written “no-site” or “off-site”)","zh":"不在现场的；不在指定地点进行的（常写作“no-site”，也常用“off-site”表达）"},"examples":[{"en":"The inspection will be no-site this week, so we’ll meet by video.","zh":"这周检查不在现场进行，所以我们用视频会议。"},{"en":"They switched to a no-site support model for simple IT requests.","zh":"他们把简单的 IT 需求改成了非现场支持模式。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) no website is available or the page/site cannot be found (often written “no site” in messages)","zh":"（非正式）没有网站/网页不可用或找不到（信息里常写作“no site”）"},"examples":[{"en":"I clicked the link, but it says ‘no site.’","zh":"我点了链接，但它显示“没有网站/找不到页面”。"}]}],"synonyms":["remote","off-site","not on-site","unavailable","page not found"],"phonetic":"ˈnoʊ ˌsaɪt","extraExplanation":["“nosite”不是一个常见的标准英语单词，更常见的写法是分开写“no site”（没有网站/找不到页面）或加连字符“no-site”（不在现场的）。在正式写作中，如果你想表达“远程/不在现场”，更自然的说法通常是“remote”或“off-site”。"]}
{"word":"noso","summary":{"en":"“noso” is not standard; it usually means informal “no-so” (= mediocre) or a casual spelling of “not so.”","zh":"“noso”不是标准拼写；通常指非正式的“no-so”（不怎么样/一般般），或把“not so”（没那么……）随意拼写成 noso。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, often written “no-so” or “no so”) not very good; mediocre; unimpressive.","zh":"（非正式，常写作 no-so 或 no so）不太好；一般般；不怎么样。"},"examples":[{"en":"The movie was kind of no-so, but the soundtrack was great.","zh":"这部电影有点不怎么样，不过原声带很棒。"},{"en":"I’m feeling no-so today, so I’ll stay home and rest.","zh":"我今天感觉不太好，所以我打算在家休息。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare) a spelling used online for “not so,” meaning “to a lesser degree” or “not as much.”","zh":"（少见）网络上把 not so 写成 noso，用来表示“没那么…… / 不那么……”。"},"examples":[{"en":"I’m noso sure about that plan.","zh":"我对那个计划没那么确定。"}]}],"synonyms":["so-so","mediocre","not very good","not so"],"phonetic":"/ˌnoʊˈsoʊ/","extraExplanation":["“noso”本身不是常见的标准英语拼写。更常见的是：\n- “not so”＝“没那么……/ 不那么……”，语法上常作副词短语（例如 not so bad）。\n- “so-so”＝“一般般”，口语里也会出现带否定色彩的“no-so / no so”，表示“并不怎么样”。\n写作时建议用更标准的形式（not so / so-so / not very good），避免误解。"]}
{"word":"nosochthonography","summary":{"en":"A rare term meaning the description/study of diseases in relation to specific places and local geographic conditions.","zh":"罕用词，指从地域与环境（如土壤、气候）角度来描述或研究地方性疾病的“地方疾病志/地方病记述”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the description or study of diseases as they relate to particular places, local soils, or geographic conditions (i.e., “place-based” or endemic disease patterns).","zh":"（罕用）地方疾病志；研究或描述疾病与特定地区、土壤或地理环境之间关系的学问（强调“因地而异”的地方性/地域性疾病）。"},"examples":[{"en":"Early physicians sometimes wrote nosochthonography to explain why certain fevers were common near swamps.","zh":"早期医师有时会写“地方疾病志”，用来解释为何某些发热在沼泽附近更常见。"},{"en":"The report is closer to nosochthonography than to modern epidemiology because it focuses on local climate and soil.","zh":"这份报告更像“地方疾病志”而非现代流行病学，因为它把重点放在当地气候和土壤上。"}]}],"synonyms":["medical geography","disease ecology","endemic-disease study","topographical medicine"],"phonetic":"/ˌnoʊsoʊˌkθɑːnəˈɡræfi/","extraExplanation":["这个词由希腊语词根构成：noso-（疾病）+ chthon-（土地/地表、地下）+ -graphy（书写/记述）。因此核心意思是“把疾病按土地与地域条件来记述”。","它多见于较早期的医学写作传统（接近“医地理/医学地理学”的视角），现代更常用的相关词包括 medical geography（医学地理）或 epidemiology（流行病学，侧重人群与传播机制）。"]}
{"word":"nosocomial","summary":{"en":"“Nosocomial” means acquired in a hospital/healthcare setting, especially referring to infections caught during medical care.","zh":"“Nosocomial”指在医院或医疗机构内获得的（尤指）感染，即医疗过程中感染上的“院内感染”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a disease or infection that is acquired in a hospital or other healthcare facility (not present or incubating when the person was admitted).","zh":"（疾病或感染）院内获得的；医院感染的（通常指入院时并不存在、也不在潜伏期的感染）。"},"examples":[{"en":"The patient developed a nosocomial infection after surgery.","zh":"这位患者在手术后出现了院内感染。"},{"en":"Hand hygiene is the simplest way to reduce nosocomial infections.","zh":"手部卫生是减少医院感染最简单的方法。"}]}],"synonyms":["hospital-acquired","healthcare-associated","iatrogenic (sometimes, but not the same)"],"phonetic":"/ˌnoʊsəˈkoʊmiəl/","extraExplanation":["词源：来自希腊语 nosokomeion（医院），由 nosos（疾病）+ komein（照料）构成。","常见搭配：nosocomial infection（院内感染/医院感染），nosocomial pneumonia（院内肺炎），nosocomial transmission（院内传播）。","与 healthcare-associated infection (HAI)（医疗相关感染）近义：HAI 更广，包含养老院、透析中心等；nosocomial 更强调“医院内”。"]}
{"word":"nosocomium","summary":{"en":"“Nosocomium” is a rare, formal word meaning “hospital.”","zh":"nosocomium 是一个较罕见、偏正式的词，意思是“医院”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hospital; a place where sick or injured people are cared for (formal, rare/old-fashioned).","zh":"医院；收治与照护病患的场所（正式用语，较罕见/旧式用法）。"},"examples":[{"en":"In some old medical texts, a large city hospital is called a nosocomium.","zh":"在一些旧式医学文献中，大型城市医院会被称作 nosocomium。"},{"en":"The charity helped fund a nosocomium for people who could not afford treatment.","zh":"该慈善机构资助了一所医院（nosocomium），为无力负担治疗费用的人提供帮助。"}]}],"synonyms":["hospital","infirmary","clinic"],"phonetic":"/ˌnoʊzəˈkoʊmiəm/","extraExplanation":["词源：来自希腊语 nosos（疾病）+ komein（照料），因此字面意思接近“照护病人的地方”。","使用场景：现代英语里几乎不用，更多见于拉丁化/古典风格的医学写作或历史文献；日常表达直接用 hospital 更自然。"]}
{"word":"nosogenesis","summary":{"en":"Nosogenesis means the origin and development of a disease (how it starts and progresses).","zh":"Nosogenesis 指疾病的发生与发展过程（疾病如何开始并演变）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the origin and development (formation) of a disease; how a disease begins and progresses","zh":"疾病发生与发展的过程；致病过程（疾病如何开始并演变）"},"examples":[{"en":"Researchers are studying the nosogenesis of Alzheimer’s disease to understand what triggers it.","zh":"研究人员正在研究阿尔茨海默病的致病过程，以了解是什么触发了它。"},{"en":"The paper compares different theories of nosogenesis in autoimmune disorders.","zh":"这篇论文比较了自身免疫性疾病中不同的疾病发生理论。"}]}],"synonyms":["pathogenesis","disease development","disease origin"],"phonetic":"/ˌnoʊsəˈdʒɛnəsɪs/","extraExplanation":["这是医学与生物学中的较正式术语，常见于学术论文。日常英语里更常用的说法是“how a disease develops（疾病如何发展）”或“the origin of a disease（疾病的起因）”。","词源上来自希腊语：noso- 表示“疾病”（如 nosology 疾病分类学），-genesis 表示“产生/起源”。因此 nosogenesis 字面意思就是“疾病的产生”。"]}
{"word":"nosogenetic","summary":{"en":"Nosogenetic means related to the origin or development of a disease (a formal medical term).","zh":"nosogenetic 指“与疾病的起源或发生发展有关的”，多用于正式医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the origin, cause, or development of a disease.","zh":"与疾病的起源、病因或发生发展过程有关的；致病发生学的。"},"examples":[{"en":"The researchers proposed a nosogenetic model to explain how the infection progresses.","zh":"研究人员提出了一个致病发生学模型来解释感染如何进展。"},{"en":"Doctors discussed several nosogenetic factors, including genetics and environment.","zh":"医生讨论了若干致病发生学因素，包括遗传与环境。"}]}],"synonyms":["pathogenetic","etiological","pathogenetic (related)","etiologic"],"phonetic":"/ˌnoʊsəˈdʒɛnɪk/","extraExplanation":["词源上可拆为希腊语 noso-（疾病）+ -genetic（产生、起源相关）。它常见于医学论文或较正式的临床讨论中，用来强调“疾病是如何产生/演变的”。","与常见的“pathogenesis（发病机制）”含义接近，但 nosogenetic 更强调“疾病的起源/生成过程”的角度；在现代英语里它相对少见，更多见于学术语境。"]}
{"word":"nosogenic","summary":{"en":"Nosogenic means “related to or caused by disease,” and can also mean “caused by concern or awareness about disease.”","zh":"Nosogenic 指“由疾病引起的/与疾病相关的”，也可指“由对疾病的担忧或认知引发的（心理）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"caused by illness or by factors related to disease (especially symptoms that arise from having a disease).","zh":"由疾病引起的；与疾病相关因素导致的（尤指因患病而出现的症状或问题）。"},"examples":[{"en":"Chronic pain can lead to nosogenic fatigue.","zh":"慢性疼痛可能导致由疾病引起的疲劳。"},{"en":"The doctor tried to separate nosogenic symptoms from side effects of the medication.","zh":"医生试图把疾病本身引起的症状与药物副作用区分开来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(psychology/psychiatry) brought on by worries, beliefs, or awareness about disease—sometimes due to medical information or diagnosis.","zh":"（心理/精神医学）由对疾病的担忧、信念或对患病的认识引发的；有时与医疗信息或诊断带来的心理反应有关。"},"examples":[{"en":"After reading alarming posts online, she developed nosogenic anxiety about her health.","zh":"看了网上一些耸动的帖子后，她对健康产生了由“疾病观念”引发的焦虑。"},{"en":"Clear explanations can reduce nosogenic stress after a diagnosis.","zh":"清晰的解释能减轻确诊后的“疾病相关心理压力”。"}]}],"synonyms":["illness-related","disease-related","pathogenic (related)","disease-causing (context-dependent)","iatrogenic (related but different)"],"phonetic":"/ˌnoʊsəˈdʒɛnɪk/","extraExplanation":["词源：no(s)o- 来自希腊语 *nosos*（疾病）+ -genic（产生……的）。整体意思就是“由疾病产生的/导致的”。","使用场景：多见于医学与心理健康语境，强调“问题的来源与疾病本身或对疾病的认知有关”。日常英语中较少用，更常见的替代表达有 *disease-causing*（致病的）、*illness-related*（与疾病相关的）、*health-related anxiety*（健康焦虑）等。"]}
{"word":"nosogeny","summary":{"en":"Nosogeny means the origin and development of a disease.","zh":"Nosogeny 指疾病的起源与发生发展过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the origin or development of a disease; how a disease begins and forms","zh":"（疾病的）起源与发生；疾病是如何开始并形成的"},"examples":[{"en":"The paper discusses the nosogeny of the infection in young children.","zh":"这篇论文讨论了该感染在幼儿中的疾病发生机制与起源。"},{"en":"Researchers are still debating the nosogeny of the condition.","zh":"研究人员仍在争论这种疾病的起源与发生原因。"}]}],"synonyms":["etiology","pathogenesis","disease origin"],"phonetic":"/noʊˈsɑːdʒəni/","extraExplanation":["词源：noso- 来自希腊语 nosos（“疾病”），-geny 来自 -genia / -genesis（“产生、起源”）。因此 nosogeny 字面意思就是“疾病的产生/起源”。","使用场景：这是医学与学术写作中的较罕见词，更常见的近义概念表达是 etiology（病因学/病因）与 pathogenesis（发病机制）。nosogeny 往往偏向强调“起源与形成过程”的整体描述。"]}
{"word":"nosogeographic","summary":{"en":"Nosogeographic means related to where diseases occur and how they are distributed across regions.","zh":"Nosogeographic 指“与疾病在不同地区的分布情况及其制图研究有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the geographic distribution and mapping of diseases (how illnesses are spread across different places).","zh":"与疾病的地理分布与绘制（疾病在不同地区如何分布）有关的。"},"examples":[{"en":"The paper includes a nosogeographic map showing where malaria is most common.","zh":"这篇论文包含一张疾病地理分布图，显示疟疾最常见的地区。"},{"en":"Nosogeographic studies can help public health officials focus resources on high-risk areas.","zh":"疾病地理分布研究可以帮助公共卫生官员把资源集中在高风险地区。"}]}],"synonyms":["disease-geographic","epidemiological (context-dependent)","medical-geographic (context-dependent)"],"phonetic":"/ˌnoʊzoʊˌdʒiəˈɡræfɪk/","extraExplanation":["词源提示：noso- 来自希腊语，表示“疾病”（同源词如 nosology：疾病分类学）；-geographic 表示“地理的”。合起来就是“疾病＋地理”的意思。","使用场景：该词多见于流行病学、公共卫生、医学地理学等学术语境，日常英语中很少使用；更常见的说法是 “the geographic distribution of disease(s)” 或 “disease mapping”。"]}
{"word":"nosogeographical","summary":{"en":"An adjective used mainly in academic contexts meaning “about where diseases occur geographically.”","zh":"主要用于学术语境的形容词，意思是“关于疾病在地理上的分布”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the geographic distribution of diseases and health conditions (nosogeography).","zh":"与疾病与健康状况的地理分布有关的（疾病地理学 / 疾病分布学）。"},"examples":[{"en":"Researchers used nosogeographical data to map where malaria outbreaks were most common.","zh":"研究人员使用疾病地理学数据来绘制疟疾暴发最常见的地区。"},{"en":"The report gives a nosogeographical overview of influenza trends across the country.","zh":"该报告从疾病地理学角度概述了全国范围内流感的趋势。"}]}],"synonyms":["nosogeographic","disease-geographic (rare)","medical-geographical (context-dependent)"],"phonetic":"/ˌnoʊzoʊˌdʒiəˈɡræfɪkəl/","extraExplanation":["“nosogeographical”来自“nosogeography”（疾病地理学），常见于公共卫生、流行病学、医学地理等学术语境，日常英语中很少使用。","词根提示：noso- 表示“疾病”（来自希腊语 nosos，意为 disease），-geographical 表示“地理的”。理解词根有助于推断词义。","相关学术写作中更常见的表达包括：the geographic distribution of disease（疾病的地理分布）、disease geography（疾病地理学）、medical geography（医学地理学）。"]}
{"word":"nosogeography","summary":{"en":"Nosogeography is the study of how diseases are distributed across different places.","zh":"Nosogeography 指研究疾病在不同地区如何分布及其地域差异的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of where diseases occur and how their patterns vary by place (the geographical distribution of diseases)","zh":"疾病地理学；研究疾病在不同地区的分布及其地域差异的学科"},"examples":[{"en":"Nosogeography helps public health teams see which diseases are most common in different regions.","zh":"疾病地理学帮助公共卫生团队了解不同地区最常见的疾病。"},{"en":"The report used nosogeography to map malaria risk across tropical areas.","zh":"该报告运用疾病地理学绘制了热带地区的疟疾风险地图。"}]}],"synonyms":["disease geography","medical geography (related)","geographical distribution of disease"],"phonetic":"/ˌnoʊzoʊdʒiˈɑɡrəfi/","extraExplanation":["词源：noso- 来自希腊语 *nosos*（疾病），-geography 表示“地理/分布的研究”。合起来就是“疾病的地理分布研究”。","使用场景：该词多见于医学、流行病学与公共卫生研究中，属于较学术的用语；日常表达更常用 *disease mapping*（疾病地图/绘制）或 *geographic distribution of disease*（疾病的地理分布）。","相关概念：与 *epidemiology*（流行病学）有重叠，但疾病地理学更强调“地点/空间差异”；现代研究常结合 GIS（地理信息系统）来分析与可视化。"]}
{"word":"nosographer","summary":{"en":"A nosographer is someone who classifies diseases—or, more generally, someone who writes systematic descriptions of diseases.","zh":"nosographer 指疾病分类学者；也可泛指系统撰写、整理疾病描述的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who classifies and organizes diseases into a system (nosology).","zh":"疾病分类学者；把疾病进行系统分类与整理的人（从事疾病分类学）。"},"examples":[{"en":"The hospital hired a nosographer to help standardize disease categories in its records.","zh":"医院聘请了一位疾病分类学者来帮助统一病历中的疾病分类。"},{"en":"In public health, a nosographer may work with ICD codes to improve reporting.","zh":"在公共卫生领域，疾病分类学者可能会与 ICD 编码合作，以改进疾病报告。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, someone who writes or compiles descriptions of diseases.","zh":"（广义）撰写或汇编疾病描述的人。"},"examples":[{"en":"Early medical nosographers tried to describe illnesses in a consistent, shared language.","zh":"早期的医学疾病记述者试图用一致、通用的语言来描述疾病。"}]}],"synonyms":["nosologist","disease classifier","medical taxonomist"],"phonetic":"/noʊˈsɑːɡrəfər/","extraExplanation":["词源来自希腊语：nósos（疾病）+ -graphos / -grapher（书写、记录的人）。因此它与“nosology（疾病分类学）”关系很近。","在现代医学语境中，这个词较少用于日常对话，更常见于医学史、流行病学、分类系统（如 ICD）等专业讨论。"]}
{"word":"nosographic","summary":{"en":"“Nosographic” means relating to the description and classification of diseases.","zh":"“Nosographic” 指与疾病的描述与分类（疾病分类学）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the systematic description and classification of diseases (nosography).","zh":"与疾病的系统性描述与分类（疾病分类学）有关的。"},"examples":[{"en":"The paper uses a nosographic framework to group patients by symptom patterns.","zh":"这篇论文使用疾病分类学框架，按症状模式对患者分组。"},{"en":"Nosographic categories can change as medical knowledge improves.","zh":"随着医学知识的进步，疾病分类学的类别也可能改变。"}]}],"synonyms":["nosographical","diagnostic (in some contexts)","classification-based (informal)"],"phonetic":"/ˌnoʊzəˈɡræfɪk/","extraExplanation":["词源提示：noσο-（来自希腊语 nosos，意为“疾病”）+ -graph-（“书写、记录”）+ -ic（形容词后缀）。所以 nosographic 字面意思接近“关于记录/描述疾病的”。","用法提示：这个词主要出现在医学、流行病学、精神病学等学术语境里，日常英语里更常说 “disease classification（疾病分类）” 或 “diagnostic classification（诊断分类）”。","相关概念区分：nosography 通常强调“描述与分类疾病”的体系；diagnosis（诊断）强调“判断某个具体病人得了什么病”；taxonomy/classification 更泛指分类方法，不一定限于疾病。"]}
{"word":"nosographical","summary":{"en":"Nosographical means “about the classification or description of diseases.”","zh":"nosographical 指“关于疾病的描述或分类（疾病分类学）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the description, classification, or systematic listing of diseases (nosography).","zh":"与疾病的描述、分类或系统性编目有关的（疾病分类学/疾病志）。"},"examples":[{"en":"The paper uses a nosographical approach to group mental disorders by shared symptoms.","zh":"这篇论文采用疾病分类学的方法，按共同症状对精神障碍进行归类。"},{"en":"Changes in nosographical systems can affect how doctors record diagnoses.","zh":"疾病分类体系的变化会影响医生记录诊断的方式。"}]}],"synonyms":["nosographic","nosological","taxonomic (in medical context)"],"phonetic":"/ˌnoʊzəˈɡræfɪkəl/","extraExplanation":["词源提示：nosographical 来自 nosography（疾病分类/疾病志），其词根可追溯到希腊语 nosos（疾病）+ -graphy（书写、记录）。在医学与心理学文献中常见，用来强调“如何划分/命名疾病”这一分类框架，而不一定是在讨论具体治疗。"]}
{"word":"nosographically","summary":{"en":"“Nosographically” means “in terms of the systematic description or classification of diseases.”","zh":"“Nosographically”表示“从疾病的系统描述或分类角度（按疾病分类学）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the description, classification, or systematic cataloging of diseases.","zh":"以与疾病的描述、分类或系统编目有关的方式；按疾病分类学（疾病志/疾病分类描述）的角度。"},"examples":[{"en":"The paper compares depression and anxiety nosographically, using DSM categories.","zh":"这篇论文从疾病分类学角度比较了抑郁症和焦虑症，采用了《精神障碍诊断与统计手册》（DSM）的类别。"},{"en":"Nosographically, the syndrome overlaps with several autoimmune disorders.","zh":"从疾病分类学角度看，这一综合征与多种自身免疫性疾病有重叠。"}]}],"synonyms":["taxonomically (in a disease-classification sense)","classificatorily","categorically (in a diagnostic sense)"],"phonetic":"/ˌnoʊzəˈɡræfɪkli/","extraExplanation":["该词较少用于日常英语，多见于医学、精神病学与公共卫生研究写作中。","词根提示：noso- 表示“疾病”（源自希腊语 nosos），-graphy 表示“描述/记录”，因此 nosography 指“疾病的描述与分类”，nosographically 是其副词形式。","在精神病学语境中，nosographic approach 常指“基于诊断类别（如 DSM/ICD）进行研究或讨论”，与强调机制/病因的研究取向形成对比。"]}
{"word":"nosographies","summary":{"en":"“Nosographies” means systematic descriptions or classification systems of diseases.","zh":"“Nosographies”指对疾病进行系统描述或分类的体系/著作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Systematic descriptions or classifications of diseases (plural of “nosography”).","zh":"对疾病进行系统描述或分类的著作/体系（“nosography”的复数）。"},"examples":[{"en":"Early modern physicians produced nosographies to organize diseases by symptoms and causes.","zh":"近代早期的医生编写疾病分类体系，以按症状和病因整理各种疾病。"},{"en":"The hospital updated its nosographies to reflect new diagnostic standards.","zh":"医院更新了疾病分类体系，以符合新的诊断标准。"}]}],"synonyms":["disease classifications","medical taxonomy","disease nosology","classificatory systems"],"phonetic":"/nəˈsɑɡrəfiz/","extraExplanation":["“nosography”源自希腊语：nóσος（疾病）+ -graphia（书写、记录）。它常出现在医学史、流行病学或分类学讨论中，强调“如何把疾病系统地写下来并归类”。","在现代语境中，它的意思常与“disease classification（疾病分类）/taxonomy（分类学）”接近，但更带有“描述与编目”的学术色彩。"]}
{"word":"nosography","summary":{"en":"Nosography means the descriptive, systematic classification of diseases.","zh":"nosography 指对疾病进行描述并系统分类的学科/做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the description and systematic classification of diseases (especially by their symptoms and course).","zh":"疾病的描述与系统分类（尤其按症状与病程来整理）。"},"examples":[{"en":"Modern nosography helps doctors organize diseases into clear categories for diagnosis.","zh":"现代疾病分类学帮助医生把疾病整理成清晰的类别，便于诊断。"},{"en":"The textbook includes a brief nosography of infectious diseases.","zh":"这本教材包含一段对传染病的简要分类与描述。"}]}],"synonyms":["disease classification","disease description","medical taxonomy"],"phonetic":"/ˌnoʊsəˈɡræfi/","extraExplanation":["词源上，nosography 来自希腊语：noso-（疾病）+ -graphy（书写、记录、描述）。因此它强调“把疾病写下来并加以整理分类”。","在医学史上，随着临床观察与统计方法的发展，医生逐渐从零散的病例描述走向更系统的疾病命名与分类；nosography 常与“nosology（疾病分类学）”并提：nosography 更偏“描述/记录”，nosology 更偏“分类的理论与体系”。","该词偏学术、书面语，在日常英语中不常见；在医学、公共卫生、医学史或医学信息学语境更常用。"]}
{"word":"nosohaemia","summary":{"en":"Nosohaemia means a hospital-acquired infection in the bloodstream.","zh":"nosohaemia 指“医院获得性的血流感染（院内感染进入血液）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hospital-acquired infection of the bloodstream; a nosocomial bloodstream infection (sometimes used similarly to hospital-acquired sepsis/septicemia).","zh":"医院获得性的血流感染；院内感染进入血液（有时也近似指医院获得性的败血症/菌血症）。"},"examples":[{"en":"The ICU reported a rise in nosohaemia linked to central venous catheters.","zh":"重症监护室报告称，与中心静脉导管相关的院内血流感染（nosohaemia）有所上升。"},{"en":"Strict hand hygiene helps prevent nosohaemia in vulnerable patients.","zh":"严格的手卫生有助于预防易感患者发生院内血流感染（nosohaemia）。"}]}],"synonyms":["nosocomial bloodstream infection","hospital-acquired bacteremia","hospital-acquired sepsis","septicemia (context-dependent)"],"phonetic":"/ˌnoʊzoʊˈhiːmiə/","extraExplanation":["这个词非常少见，多出现在较旧或非常专业的医学语境中；现代更常用的表达是 “nosocomial bloodstream infection (BSI) / hospital-acquired bacteremia / hospital-acquired sepsis”。","词源上可拆为 noso-（与疾病/医院相关，常见于 nosocomial“院内的”）+ -haemia（血液/血中状态）。拼写上有时也会见到类似构词的变体，但临床写作通常用更标准的术语。"]}
{"word":"nosohemia","summary":{"en":"“Nosohemia” isn’t a standard word; you probably mean “nosocomial,” meaning hospital-related, especially hospital-acquired infection.","zh":"“nosohemia”不是标准词；你可能想说“nosocomial”，指与医院有关，尤指院内/医院获得性感染。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely a misspelling) Not a standard English word. People often mean “nosocomial,” relating to infections acquired in a hospital or healthcare setting.","zh":"（可能是拼写错误）这不是标准英语单词。人们常想表达的是“nosocomial”，指在医院或医疗机构内获得的（感染等）。"},"examples":[{"en":"I couldn’t find “nosohemia” in a medical dictionary—did you mean “nosocomial infection”?","zh":"我在医学词典里找不到“nosohemia”——你是不是想说“nosocomial infection（院内感染）”？"},{"en":"The report tracked rates of nosocomial infections in the ICU.","zh":"报告追踪了重症监护室（ICU）的院内感染率。"}]},{"partOfSpeech":"adj.","definition":{"en":"nosocomial: related to hospitals, especially describing an infection that develops as a result of treatment in a hospital or healthcare facility.","zh":"nosocomial：与医院有关的，尤指因在医院或医疗机构接受治疗而发生的感染（院内感染/医院获得性感染）。"},"examples":[{"en":"Hand hygiene is a key step in preventing nosocomial infections.","zh":"手卫生是预防院内感染的关键措施。"},{"en":"She was treated for pneumonia that was thought to be nosocomial.","zh":"她接受了肺炎治疗，医生认为这是医院获得性的。"},{"en":"The hospital introduced new cleaning protocols to reduce nosocomial risk.","zh":"医院推出了新的清洁流程来降低院内感染风险。"}]}],"synonyms":["hospital-acquired","healthcare-associated","iatrogenic (context-dependent)"],"phonetic":"/ˌnoʊ.səˈkoʊ.mi.əl/","extraExplanation":["“nosocomial”来自希腊语词根：noso-（疾病）+ komeion（照护之处/医院）。在新闻与医学语境中常见搭配：nosocomial infection（院内感染）、hospital-acquired infection（医院获得性感染，常缩写 HAI）。"]}
{"word":"nosologic","summary":{"en":"Nosologic means “about classifying diseases.”","zh":"nosologic 指“与疾病分类有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the classification and systematic arrangement of diseases (nosology).","zh":"与疾病的分类和系统整理（疾病分类学）有关的；疾病分类学的。"},"examples":[{"en":"The paper discusses nosologic categories used in modern psychiatry.","zh":"这篇论文讨论了现代精神病学中使用的疾病分类学类别。"},{"en":"Researchers debated whether the new syndrome should be treated as a distinct nosologic entity.","zh":"研究人员争论这种新综合征是否应被视为一个独立的疾病分类学实体。"}]}],"synonyms":["nosological","classificatory (medical)","taxonomic (medical)"],"phonetic":"/ˌnoʊsəˈlɑdʒɪk/","extraExplanation":["词根来源：nosologic 来自 “nosology（疾病分类学）”。其中 noso- 源自希腊语 nosos（疾病），-logy 表示“学科/研究”。","使用场景：多见于医学、流行病学、精神病学等学术写作，日常英语中较少使用。更常见的相关形式是 nosological（同义，含义相同）。"]}
{"word":"nosological","summary":{"en":"Nosological means “about the classification of diseases.”","zh":"nosological 指“与疾病分类有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the classification (categorizing) of diseases; used especially in medicine and medical writing.","zh":"与疾病的分类（分门别类、归类）有关的；尤用于医学与医学写作。"},"examples":[{"en":"The paper uses a nosological approach to separate similar mental disorders into distinct categories.","zh":"这篇论文采用疾病分类学的思路，把相似的精神障碍区分为不同类别。"},{"en":"In clinical practice, nosological systems help doctors communicate more clearly about diagnoses.","zh":"在临床实践中，疾病分类体系能帮助医生更清晰地交流诊断信息。"}]}],"synonyms":["diagnostic-classification","classificatory","taxonomy-related"],"phonetic":"/ˌnoʊzəˈlɑːdʒɪkəl/","extraExplanation":["“nosological”来自“nosology（疾病分类学）”，词根noso-表示“疾病”，-logy表示“学科/研究”。常见于学术语境，如讨论ICD（国际疾病分类）或DSM（精神障碍诊断与统计手册）等分类体系。","在精神医学里，“nosological debate（分类学争论）”常指：某种症状群到底应算独立疾病，还是更大疾病谱系的一部分。"]}
{"word":"nosologically","summary":{"en":"“Nosologically” means “from the viewpoint of disease classification.”","zh":"“nosologically”表示“从疾病分类学/疾病分类角度”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to nosology (the classification and naming of diseases).","zh":"以疾病分类学（疾病的分类与命名）相关的方式；从疾病分类学角度。"},"examples":[{"en":"Nosologically, influenza is classified as a viral respiratory infection.","zh":"从疾病分类学角度看，流感被归类为病毒性呼吸道感染。"},{"en":"The paper compares two disorders that look similar clinically but differ nosologically.","zh":"这篇论文比较了两种临床表现相似但在疾病分类上不同的疾病。"}]}],"synonyms":["in terms of disease classification","from a nosology standpoint","taxonomically (in medicine)"],"phonetic":"ˌnoʊsəˈlɑdʒɪkli","extraExplanation":["“nosologically”常见于医学论文/教材中，用来强调“按疾病分类体系来说”。它对应的名词是“nosology（疾病分类学）”，而“clinical(临床的)”强调的是症状与实际诊疗表现，两者常被对比使用。","词根提示：noso- 来自希腊语，表示“疾病”；-logy 表示“学科/研究”；-ically 使其变成副词“以……方式”。"]}
{"word":"nosologies","summary":{"en":"“Nosologies” is the plural of “nosology,” meaning systems for classifying and naming diseases.","zh":"“nosologies”是“nosology”的复数，指用于对疾病进行命名与归类的各种体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the classification of diseases; a system for naming and organizing illnesses (used especially in medicine and public health)","zh":"疾病分类学；对疾病进行命名与归类的体系（尤用于医学与公共卫生）"},"examples":[{"en":"Modern nosology helps doctors communicate clearly about the same disease.","zh":"现代的疾病分类体系帮助医生更清晰地沟通同一种疾病。"},{"en":"The ICD is widely used as a global nosology for reporting health data.","zh":"《国际疾病分类》（ICD）被广泛用作全球性的疾病分类体系来汇报健康数据。"}]},{"partOfSpeech":"n.","definition":{"en":"systems or approaches to disease classification (plural: different frameworks used in different times or fields)","zh":"（复数用法）不同的疾病分类体系/方法（指不同时代或领域采用的框架）"},"examples":[{"en":"Researchers compared older psychiatric nosologies with today’s diagnostic manuals.","zh":"研究人员把较早的精神疾病分类体系与今天的诊断手册进行了比较。"}]}],"synonyms":["disease classification","taxonomy of diseases","diagnostic classification","classification system"],"phonetic":"/noʊˈsɑlədʒi/","extraExplanation":["“nosologies”是“nosology”的复数。常见于学术语境，用来强调“多种分类体系”并存或在历史上发生过变化。","词源来自希腊语：noso-（疾病）+ -logy（学科/研究）。"]}
{"word":"nosologist","summary":{"en":"A nosologist is a specialist who studies and classifies diseases.","zh":"nosologist 指研究并分类疾病的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical specialist who studies and classifies diseases (the field is called nosology).","zh":"研究并分类疾病的医学专家（这一领域称为“疾病分类学/疾病学”，nosology）。"},"examples":[{"en":"The hospital’s nosologist reviewed patient records to ensure each diagnosis was coded correctly.","zh":"医院的疾病分类学专家审查了病历，确保每个诊断都被正确编码。"},{"en":"In public health research, a nosologist may help standardize disease categories across studies.","zh":"在公共卫生研究中，疾病分类学专家可能会帮助在不同研究之间统一疾病类别。"}]}],"synonyms":["disease classification specialist","nosology specialist","medical coder (related, not identical)"],"phonetic":"/noʊˈsɑlədʒɪst/","extraExplanation":["“nosologist”来自希腊语词根：noso-（疾病）+ -logist（研究……的人）。在现代语境中，这个角色常与医疗编码（如 ICD 国际疾病分类）和病案管理相关，帮助把临床诊断用一致的分类体系表达出来，便于统计与研究。"]}
{"word":"nosology","summary":{"en":"Nosology means the medical study and system for classifying diseases.","zh":"Nosology 指医学上对疾病进行研究并建立分类体系的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study and classification of diseases (how illnesses are named, grouped, and organized).","zh":"疾病分类学；疾病的研究与分类（研究疾病如何被命名、分组与系统整理）。"},"examples":[{"en":"Modern nosology helps doctors communicate clearly about diagnoses.","zh":"现代的疾病分类学帮助医生更清楚地交流诊断结果。"},{"en":"The World Health Organization’s ICD is an important tool for nosology.","zh":"世界卫生组织的《国际疾病分类》（ICD）是疾病分类学的重要工具。"}]}],"synonyms":["disease classification","taxonomy of diseases","classification of illnesses"],"phonetic":"/noʊˈsɑlədʒi/","extraExplanation":["词源：来自希腊语 *nosos*（疾病）+ *-logy*（学科/研究）。","语境提示：nosology 多见于医学、流行病学、精神病学等领域的学术写作，日常口语中更常用 “disease classification（疾病分类）”。","在精神医学中常与诊断标准（如 DSM、ICD）相关，但它强调的是“分类体系本身”，不等同于具体的诊断或治疗。"]}
{"word":"nosomania","summary":{"en":"Nosomania is an uncommon term meaning an excessive preoccupation with being ill or imagining illnesses.","zh":"Nosomania 是较少见的词，指对生病的过度执念或总想象自己得病的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal or excessive desire to be ill, or a tendency to imagine you have illnesses (often linked to anxiety about health).","zh":"疑病癖；过度渴望生病或总觉得自己得了病（常与健康焦虑有关）。"},"examples":[{"en":"He kept visiting clinics for minor symptoms; the doctor suspected nosomania.","zh":"他因为一点小症状就不停跑诊所；医生怀疑他有疑病癖。"},{"en":"Online health searches can sometimes worsen nosomania in anxious people.","zh":"对焦虑的人来说，频繁在网上查病症有时会加重疑病倾向。"}]}],"synonyms":["hypochondria","health anxiety","illness preoccupation"],"phonetic":"/ˌnoʊsəˈmeɪniə/","extraExplanation":["词源提示：nos/o- 来自希腊语，意为“疾病”，-mania 意为“狂热、强烈的执念”。所以 nosomania 字面上是“对疾病的执念/狂热”。","用法提醒：它是较少见、偏医学/心理学语境的词。日常英语更常用 hypochondria（疑病症/疑病倾向）或 health anxiety（健康焦虑）。","区分：nosomania 强调“想生病或对生病有强烈执念”；hypochondria/health anxiety 更强调“害怕自己生病、误以为自己有病”。在实际使用中两者常被混用，但细微侧重点不同。"]}
{"word":"nosomycosis","summary":{"en":"Nosomycosis means a fungal disease/infection.","zh":"nosomycosis 指真菌病或真菌感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fungal disease or fungal infection (a type of mycosis).","zh":"真菌病；由真菌引起的疾病或感染（属于“真菌病 mycosis”的一种）。"},"examples":[{"en":"Athlete’s foot is a common nosomycosis of the skin.","zh":"香港脚（足癣）是一种常见的皮肤真菌病。"},{"en":"The doctor confirmed the rash was caused by a nosomycosis, not bacteria.","zh":"医生确认这种皮疹是真菌感染导致的，而不是细菌引起的。"}]}],"synonyms":["mycosis","fungal infection","fungal disease"],"phonetic":"/ˌnoʊsoʊmaɪˈkoʊsɪs/","extraExplanation":["“nosomycosis”较少见，医学写作里更常用“mycosis”（真菌病）或“fungal infection”（真菌感染）。","词源拆解：noso- 表示“疾病”（与“nosology 疾病分类学”同源），mycosis 表示“真菌病”。合起来就是“由真菌导致的疾病”。","在临床语境中，常会进一步具体到部位或类型，例如“cutaneous mycosis（皮肤真菌病）”“systemic mycosis（系统性真菌病）”。"]}
{"word":"nosonomy","summary":{"en":"Nosonomy means the systematic classification of diseases.","zh":"Nosonomy 指对疾病进行系统化的分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the systematic classification (grouping) of diseases; a disease taxonomy.","zh":"疾病的系统分类；疾病分类学。"},"examples":[{"en":"Modern nosonomy helps doctors compare research results across hospitals and countries.","zh":"现代疾病分类有助于医生在不同医院和国家之间对比研究结果。"},{"en":"The report criticized the hospital’s nosonomy for mixing symptoms with diagnoses.","zh":"报告批评该医院的疾病分类把症状和诊断混在一起。"}]}],"synonyms":["nosology","disease classification","medical taxonomy"],"phonetic":"/noʊˈsɑnəmi/","extraExplanation":["“nosonomy”比较少见，更常用的是 **nosology**（疾病分类学/疾病学分类）或 **taxonomy/classification of diseases**。","词源可拆解理解：**noso-** 来自希腊语 *nosos*（疾病），**-nomy** 来自 *nomos*（规则、体系、管理），合起来就是“按规则把疾病系统化分类”。","在医学语境中，这类词常出现在公共卫生与统计分类里，例如 **ICD (International Classification of Diseases，国际疾病分类)** 就是一种标准化的疾病分类体系。"]}
{"word":"nosophobia","summary":{"en":"Nosophobia is a strong fear of getting sick or catching a disease.","zh":"Nosophobia 指对得病或感染疾病的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense, persistent fear of getting a disease (a type of phobia)","zh":"对患病/得病的强烈、持续恐惧（恐病的一种）"},"examples":[{"en":"After reading medical news online, he felt nosophobia and kept checking his body for symptoms.","zh":"看了网上的医疗新闻后，他产生了恐病情绪，不停检查自己是否有症状。"},{"en":"Her nosophobia made routine checkups very stressful, even though she was healthy.","zh":"尽管她身体健康，但恐病让例行体检变得非常有压力。"},{"en":"Therapy helped him manage his nosophobia so he could travel and work normally.","zh":"治疗帮助他控制恐病，从而能正常旅行和工作。"}]}],"synonyms":["fear of illness","disease phobia","health anxiety (related)"],"phonetic":"/ˌnoʊsəˈfoʊbiə/","extraExplanation":["词源提示：noso- 来自希腊语 *nosos*（疾病），-phobia 表示“恐惧”。合起来就是“对疾病的恐惧”。","易混淆点：nosophobia（害怕“得病”）不同于 hypochondria/health anxiety（更偏向“过度担心自己已患病”的持续焦虑）。前者常见为“预期性恐惧”，后者更像“反复怀疑与求证”。","常见触发情境：疫情信息、医疗新闻、身边人患病经历、身体小不适等都可能加重这种恐惧。若影响生活，可考虑寻求专业帮助（如认知行为疗法等）。"]}
{"word":"nosophyte","summary":{"en":"Nosophyte is a rare, nonstandard word sometimes used to mean an unwise/unknowing person; many people actually intend neophyte (“beginner”).","zh":"nosophyte 属于罕见的非标准用法，有时指缺乏智慧/知识的人；很多情况下其实是想写 neophyte（新手）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) A person who lacks knowledge or wisdom; sometimes used humorously to mean “not a sophyte (wise person).” In many cases, people actually mean neophyte (“beginner”).","zh":"（罕见、非标准用法）缺乏知识或智慧的人；有时带幽默意味，表示“不是智者的人”。很多情况下其实是想写 neophyte（新手）."},"examples":[{"en":"He’s a complete nosophyte when it comes to basic finance.","zh":"在基本理财方面他完全是个“没开窍的人”（用法很少见）。"},{"en":"If you meant “beginner,” the standard word is “neophyte,” not “nosophyte.”","zh":"如果你想表达“新手”，标准词是 neophyte，而不是 nosophyte。"}]}],"synonyms":["ignoramus","know-nothing","novice (if meaning beginner)","neophyte (likely intended)"],"phonetic":"/ˈnɑsəˌfaɪt/","extraExplanation":["“nosophyte”不是常见词，很多主流词典可能不收。它看起来像是把 no-（没有）和 -sophy-（智慧，见 philosophy 哲学）拼在一起的戏谑造词，用来表示“缺乏智慧/知识的人”。","更常见、标准且你很可能想找的词是 neophyte /ˈniəˌfaɪt/（新手、初学者），源自希腊语 neos（新的）+ phyton（植物/生长），比喻“新长出来的嫩芽”。","如果你愿意，告诉我你看到它的原句/语境，我可以判断作者到底是在故意造词（讽刺/幽默）还是拼写错误。"]}
{"word":"nosopoetic","summary":{"en":"Nosopoetic means “disease-producing; pathogenic” (a rare, technical word; often spelled nosopoietic).","zh":"Nosopoetic 意为“致病的；会引起疾病的”（罕见专业词，常见拼写为 nosopoietic）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) disease-producing; causing illness; pathogenic.","zh":"（罕见/专业用语）致病的；引起疾病的；病原性的。"},"examples":[{"en":"Some bacteria are harmless, but others are nosopoetic (pathogenic) to humans.","zh":"有些细菌无害，但有些对人类是致病的（病原性的）。"},{"en":"The lab tests whether the strain is nosopoetic under certain conditions.","zh":"实验室会检测该菌株在特定条件下是否具有致病性。"}]}],"synonyms":["pathogenic","disease-causing","infectious (context-dependent)"],"phonetic":"/ˌnoʊsoʊpoʊˈiːtɪk/","extraExplanation":["“nosopoetic”在现代英语中非常少见，更多见的拼写是 **nosopoietic**，含义相同。","词根拆解：**noso-**（疾病，来自希腊语 *nosos*）+ **-poietic/-poetic**（制造、产生，来自希腊语 *poiein* “to make”）。因此整体意思是“产生疾病的”。","日常或学术写作中更常用的同义词是 **pathogenic**（致病的）或 **disease-causing**（引起疾病的）。"]}
{"word":"nosopoietic","summary":{"en":"Nosopoietic means “disease-causing” or “disease-producing,” mainly in scientific contexts.","zh":"nosopoietic 指“致病的/产生疾病的”，多见于科学或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing or producing disease; disease-forming (used mainly in medical or scientific writing).","zh":"致病的；产生疾病的（主要用于医学或科学语境）。"},"examples":[{"en":"Researchers studied whether the bacterium was nosopoietic in animals.","zh":"研究人员考察这种细菌在动物体内是否具有致病性。"},{"en":"Poor sanitation can create nosopoietic conditions in crowded areas.","zh":"在拥挤地区，卫生条件差可能会形成致病环境。"}]}],"synonyms":["pathogenic","disease-causing","disease-producing","infectious (context-dependent)"],"phonetic":"/ˌnoʊsoʊpɔɪˈɛtɪk/","extraExplanation":["词源提示：noso- 来自希腊语，意为“疾病”（同根词如 nosology“疾病分类学”）；-poietic 意为“制造、产生”（如 poetic 原意与“创作”有关）。合起来就是“产生疾病的、致病的”。","使用提醒：这是非常少见、偏学术的词。日常英语更常用 disease-causing / pathogenic / disease-producing。"]}
{"word":"nosotaxy","summary":{"en":"Nosotaxy means the systematic classification of diseases.","zh":"Nosotaxy 指“对疾病进行系统分类/编排”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the systematic classification or arrangement of diseases; a disease taxonomy (same general idea as “nosology”).","zh":"疾病的系统分类或编排；疾病分类学（与 nosology“疾病分类学/疾病学分类”意思相近）。"},"examples":[{"en":"Modern medicine relies on nosotaxy to group illnesses by cause, symptoms, or affected organs.","zh":"现代医学依赖疾病分类（nosotaxy），按病因、症状或受累器官来归类疾病。"},{"en":"As knowledge grew, the hospital updated its nosotaxy to reflect new infectious diseases.","zh":"随着知识增长，医院更新了疾病分类体系（nosotaxy），以纳入新的传染病。"}]}],"synonyms":["nosology","disease classification","disease taxonomy"],"phonetic":"/ˌnoʊsəˈtæksi/","extraExplanation":["该词较罕见，更多时候会用更常见的 nosology（疾病分类学）或 taxonomy of diseases（疾病分类）。","词源可拆为希腊语根：noso-（疾病）+ -taxy（排列、编排），强调“把疾病按某种原则排成体系”。"]}
{"word":"nosotrophy","summary":{"en":"Nosotrophy is a rare term meaning nutrition or feeding for sick people.","zh":"Nosotrophy 是个罕见词，指对病人的营养供给或饮食调理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, medical) Nutrition or feeding intended for someone who is ill; dietetic care of the sick.","zh":"（罕见，医学用语）为病人提供的营养/喂养；对病人的饮食调理。"},"examples":[{"en":"In older medical writing, nosotrophy referred to feeding plans for patients during recovery.","zh":"在较早的医学写作中，nosotrophy 指的是病人康复期的饮食/喂养方案。"},{"en":"Good nosotrophy focuses on gentle foods and enough fluids.","zh":"良好的 nosotrophy 强调清淡食物与充足补液。"}]}],"synonyms":["clinical nutrition","diet therapy","nutritional support","patient feeding"],"phonetic":"/ˌnoʊsəˈtroʊfi/","extraExplanation":["这个词非常少见，多数现代英语资料不会用它；更常见的表达是 clinical nutrition（临床营养）、diet therapy（饮食疗法）、nutritional support（营养支持）。","词源可拆解理解：noso- 来自希腊语 nosos（疾病），-trophy 来自 trophē（营养、喂养）。因此它强调“在疾病状态下的喂养/营养”。","如果你原本想查的是“喜欢生病/渴望生病”的意思，现代更接近的词可能是 nosophilia（对疾病的迷恋，极少用）或 hypochondria（疑病/健康焦虑，常用）。"]}
{"word":"nossel","summary":{"en":"“Nossel” is usually a misspelling of “nozzle,” a part that controls the flow or direction of liquid/gas.","zh":"“nossel”通常是“nozzle”的误拼，指控制液体/气体流量或方向的喷嘴/喷头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A nozzle: the part of a machine or container with a narrow opening that controls the direction or flow of a liquid, gas, or spray.","zh":"（常见拼写错误）指 nozzle：机器或容器上带狭窄开口的部件，用来控制液体、气体或喷雾的流向与流量。"},"examples":[{"en":"Please attach the nozzle before you turn on the hose.","zh":"打开水管之前，请先把喷嘴装上。"},{"en":"The spray bottle’s nozzle is clogged.","zh":"喷雾瓶的喷头堵住了。"}]}],"synonyms":["nozzle","sprayer tip","spout"],"phonetic":"/ˈnɑzəl/","extraExplanation":["“nossel”通常不是标准英文拼写，更常见的正确拼写是 **nozzle**。如果这是人名、品牌名或特定术语，请提供一句上下文，我可以按你的语境解释。"]}
{"word":"nostalgia","summary":{"en":"Nostalgia is a warm, often slightly sad feeling of longing for the past.","zh":"Nostalgia 指对过去的温暖回忆与淡淡的感伤、向往。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warm, sometimes slightly sad feeling when you remember the past (often a happy time)","zh":"怀旧；对过去（常是美好时光）的温暖回忆与感伤"},"examples":[{"en":"Hearing that old song filled me with nostalgia for high school.","zh":"听到那首老歌让我充满对高中时光的怀旧之情。"},{"en":"The movie is full of nostalgia for the 1990s.","zh":"这部电影充满了对20世纪90年代的怀旧。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong desire to return to a former place or time in your life; homesickness for the past","zh":"对过去的强烈向往；对曾经生活过的地方或时期的思念（带有“想回去”的感觉）"},"examples":[{"en":"After moving abroad, he felt nostalgia for his hometown and old routines.","zh":"出国后，他对家乡和旧日生活习惯产生了强烈的怀旧与思念。"},{"en":"Nostalgia can make people idealize the past.","zh":"怀旧会让人把过去理想化。"}]}],"synonyms":["longing","yearning","sentimentality","reminiscence"],"phonetic":"/nɑˈstældʒə/","extraExplanation":["“nostalgia”原本来自希腊语词根：nostos（回家）+ algos（痛苦）。它最早曾被当作一种“思乡病/乡愁”的医学用语，后来意义扩大为对过去时光的温柔回忆与感伤。","常见搭配：feel nostalgia（感到怀旧）、a wave/sense of nostalgia（一阵怀旧）、nostalgia for + 名词（对……的怀旧）、nostalgic（adj. 怀旧的）。注意：nostalgia通常是不可数名词（a feeling of nostalgia），但在更口语或文学语境中也会看到复数nostalgias，表示“各种怀旧情绪/回忆”。"]}
{"word":"nostalgias","summary":{"en":"“Nostalgias” is the plural of “nostalgia,” meaning multiple nostalgic feelings or memories about the past.","zh":"“nostalgias”是“nostalgia”的复数，指对过去的多重怀旧情绪或怀旧回忆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of nostalgia: warm, slightly sad feelings when you remember the past, especially a happy time.","zh":"nostalgia 的复数：对过去（尤其是美好时光）的温暖而略带伤感的怀念。"},"examples":[{"en":"Old photos can bring back many nostalgias from childhood.","zh":"老照片会唤起许多关于童年的怀旧之情。"},{"en":"Different songs stirred different nostalgias in him.","zh":"不同的歌曲在他心里激起了不同的怀旧回忆。"}]},{"partOfSpeech":"n.","definition":{"en":"different kinds of nostalgic feelings or memories (used when talking about more than one source or type of nostalgia).","zh":"多种不同的怀旧感/怀旧记忆（用于强调“来自不同来源或不同类型的怀旧”）。"},"examples":[{"en":"Her writing is full of nostalgias for home, family, and lost summers.","zh":"她的文字充满了对故乡、家人和逝去夏日的多重怀念。"}]}],"synonyms":["nostalgic feelings","longing","yearning","sentimentality","reminiscence"],"phonetic":"/nɑˈstældʒə/","extraExplanation":["“nostalgia”最初来自希腊语词根：nostos（回家）+ algos（痛苦）。所以它不只是“想念”，常带一点点“回不去的疼”。","英语里更常见的是不可数用法（nostalgia），复数“nostalgias”多用于文学/写作中，强调“许多段/许多种怀旧情绪”。日常口语里更常说：a lot of nostalgia / waves of nostalgia / nostalgic memories。"]}
{"word":"nostalgic","summary":{"en":"Nostalgic means feeling (or causing) a warm, sometimes bittersweet longing for the past.","zh":"nostalgic 指“怀旧的”，对过去产生温暖但可能略带伤感的思念，或能引发这种感觉的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling a warm, sometimes slightly sad longing for the past; missing earlier times or memories.","zh":"怀旧的；对过去（有温暖但有时略带伤感的）向往与思念的。"},"examples":[{"en":"I feel nostalgic when I hear songs from high school.","zh":"听到高中时的歌，我就会觉得很怀旧。"},{"en":"She was nostalgic for her hometown and childhood friends.","zh":"她很想念家乡和童年的朋友，有种怀旧之情。"},{"en":"The movie is nostalgic, full of 1990s fashion and music.","zh":"这部电影很怀旧，充满了90年代的时尚和音乐。"}]},{"partOfSpeech":"adj.","definition":{"en":"Creating or encouraging a feeling of nostalgia (describing a thing, style, or experience).","zh":"引发怀旧感的；带有怀旧氛围的（形容事物、风格或体验）。"},"examples":[{"en":"The café has a nostalgic atmosphere with old photos on the walls.","zh":"这家咖啡馆墙上挂着老照片，氛围很怀旧。"},{"en":"He gave a nostalgic speech about the early days of the company.","zh":"他发表了一段怀旧的演讲，回忆公司早期的日子。"}]}],"synonyms":["sentimental","wistful","retrospective","homesick (context-dependent)"],"phonetic":"/nɑːˈstældʒɪk/","extraExplanation":["“nostalgic”来自“nostalgia（怀旧）”。日常表达中常见搭配有：feel nostalgic（感到怀旧）、be nostalgic for/about…（怀念……）、a nostalgic look back（怀旧回顾）。","语气通常偏温柔、感性，不一定是负面；但有时也带一点点“淡淡的伤感”。","常见相关词：nostalgia（n. 怀旧之情）、nostalgically（adv. 怀旧地）。近义表达：sentimental（更强调多愁善感/感情用事）、retro（更强调复古风格）。"]}
{"word":"nostalgically","summary":{"en":"“Nostalgically” means in a way that warmly misses the past, often with a little sadness.","zh":"“nostalgically”表示“怀旧地”，带着对过去温暖而略伤感的思念。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows a warm, slightly sad longing for the past.","zh":"以怀旧的方式；带着对过去温暖又略带伤感的思念。"},"examples":[{"en":"She smiled nostalgically when she heard the song from high school.","zh":"听到那首高中时的歌，她怀旧地笑了。"},{"en":"They talked nostalgically about summers at their grandparents’ house.","zh":"他们怀旧地聊起在祖父母家度过的夏天。"},{"en":"He looked nostalgically at old photos on his phone.","zh":"他怀旧地看着手机里的旧照片。"}]}],"synonyms":["nostalgicly","reminiscently","wistfully"],"phonetic":"/nɑˈstældʒɪkli/","extraExplanation":["“nostalgically”来自形容词“nostalgic（怀旧的）”，名词是“nostalgia（怀旧之情）”。它常搭配表示回忆、观看、谈论的动词，如 smile nostalgically、look nostalgically、talk nostalgically。","语气通常是“温暖+一点点伤感”，不一定是非常悲伤；更像是在说“那段时光真好，但已经过去了”。","常见近义表达：“with nostalgia（带着怀旧之情）”“reminiscently（追忆地）”。其中“nostalgically”更强调对过去的情感眷恋。"]}
{"word":"nostalgies","summary":{"en":"“Nostalgies” means multiple feelings or memories of nostalgia—warm, sometimes bittersweet, longing for the past.","zh":"“nostalgies”指多种怀旧之情/回忆：对过去的温暖但可能带点苦涩的向往与怀念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of nostalgia; warm (sometimes bittersweet) feelings or memories about the past.","zh":"nostalgia（怀旧；乡愁）的复数；对过去的温暖（有时带点苦涩）的怀念与回忆。"},"examples":[{"en":"Old photos can bring back many nostalgies.","zh":"老照片会唤起许多怀旧之情。"},{"en":"During the reunion, we shared nostalgies about our school days.","zh":"聚会时，我们分享了对学生时代的怀念。"}]}],"synonyms":["reminiscences","memories","longing for the past","sentimentality"],"phonetic":"/nɑˈstældʒə/","extraExplanation":["“nostalgia”原本与“想家/乡愁”有关，词源来自希腊语：nostos（回家）+ algos（痛苦）。后来意义扩展为对过去时光的怀念，不一定真的与“家乡”有关。","英语里更常用不可数名词“nostalgia”（例如：a feeling of nostalgia），而复数“nostalgies”多用于文学或较正式的表达，强调“多种/多段怀旧情绪或回忆”。"]}
{"word":"nostalgy","summary":{"en":"Nostalgia is a warm, sometimes bittersweet feeling about the past.","zh":"Nostalgia 指对过去的温暖而略带伤感的怀念（怀旧）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A warm (sometimes slightly sad) feeling when you think about happy times in the past.","zh":"怀旧；对过去美好时光的温暖（有时带点伤感的）回忆与向往。"},"examples":[{"en":"Looking at old photos filled her with nostalgia for her school days.","zh":"看着老照片，她对学生时代充满了怀旧之情。"},{"en":"He felt a sense of nostalgia when he heard the songs from his childhood.","zh":"听到童年的那些歌，他感到一阵怀旧。"},{"en":"The movie uses nostalgia to remind viewers of life before smartphones.","zh":"这部电影利用怀旧感，让观众想起智能手机出现之前的生活。"}]}],"synonyms":["sentimentality","yearning","reminiscence","longing"],"phonetic":"/nɑˈstældʒə/","extraExplanation":["你输入的 **nostalgy** 常见拼写错误，正确拼写是 **nostalgia**。","在文化语境中，nostalgia 常用于谈“复古风”“怀旧滤镜”，例如 marketing 里用怀旧元素唤起情感共鸣。","词源上来自希腊语，原本指“思乡病/想家带来的痛苦”，后来语义扩展为对过去的怀念与向往。"]}
{"word":"noster","summary":{"en":"Noster means “our” in Latin and is mainly seen in fixed phrases like “Pater noster.”","zh":"Noster是拉丁语“我们的”，主要出现在如“Pater noster（主祷文开头）”等固定表达中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from Latin) “our”; used in English mostly inside fixed phrases or titles, especially in Christian contexts.","zh":"（源自拉丁语）“我们的”；在英语中多见于固定短语或标题里，尤其与基督教语境相关。"},"examples":[{"en":"The prayer begins with the words “Pater noster.”","zh":"这段祷文以“Pater noster（我们的天父）”开头。"},{"en":"In old manuscripts, “noster” often appears in Latin religious texts.","zh":"在古老手稿中，“noster”常见于拉丁文宗教文本。"}]},{"partOfSpeech":"n.","definition":{"en":"A name element meaning “our,” seen in terms like “Pater Noster” (the Lord’s Prayer) and “paternoster” (a type of rosary or a continuous-loop elevator).","zh":"作构词成分时表示“我们的”，常见于如“Pater Noster”（主祷文）以及“paternoster”（念珠的一种；或一种连续循环的升降机）等词语中。"},"examples":[{"en":"They visited a church where the “Pater Noster” is displayed in many languages.","zh":"他们参观了一座教堂，那里用多种语言展示了“Pater Noster（主祷文）”。"},{"en":"The museum preserved an old paternoster elevator from the early 1900s.","zh":"博物馆保存了一部20世纪初的旧式循环升降机（paternoster）。"}]}],"synonyms":["(Latin) our","Pater noster","paternoster"],"phonetic":"/ˈnɑstər/","extraExplanation":["“noster”本身在现代英语里不常单独使用，更常作为拉丁语原文被保留在宗教、历史或学术语境中。","“Pater noster”直译为“我们的父”（即“我们在天上的父”），是主祷文的拉丁文开头；因此在一些教堂、艺术作品、古籍标题里会直接见到。","“paternoster”这个英语词来自拉丁语开头两词（pater noster），因为念珠用来反复诵念主祷文；后来也借用来指一种“连续循环、无门厢”的电梯。"]}
{"word":"nostic","summary":{"en":"Nostic (rare) means “knowing” or claiming to know, especially in contrast to *agnostic* in religious/philosophical discussions.","zh":"Nostic（罕见）指“自称知道/可知的”，常在宗教或哲学讨论中与 *agnostic*（不可知论的）对比使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, mostly in contrast with *agnostic*) having or claiming knowledge; “knowing,” especially about religious or philosophical truth.","zh":"（罕见，多用于与 *agnostic* 对比）有知识的；自称“知道”的（尤指对宗教或哲学真理）。"},"examples":[{"en":"In some discussions, a “nostic” person claims they know whether God exists.","zh":"在一些讨论中，“nostic”的人自称知道上帝是否存在。"},{"en":"He wasn’t agnostic—he took a more nostic position and said he was sure.","zh":"他不是不可知论者——他采取更“nostic”的立场，说自己很确定。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who claims to have knowledge (especially about God or ultimate reality).","zh":"（尤指在宗教/哲学语境中）自称掌握某种终极真理或“知道”的人。"},"examples":[{"en":"The debate was framed as agnostics versus nostics.","zh":"这场辩论被表述为“不可知论者 vs. nostics（自称知道者）”。"}]}],"synonyms":["gnostic","knowing","certain","sure (in stance)"],"phonetic":"/ˈnɑstɪk/","extraExplanation":["“nostic”几乎不单独使用，最常见是在“agnostic（不可知论的）/gnostic（自称知道的）”这组对立里理解：前缀 a- 表示“否定/没有”，所以 a- + gnostic → agnostic（不主张自己知道）。有些现代写法会用“(a)gnostic”来表示“（不）可知”的两类立场。","日常英语里更常用的是 gnostic / agnostic；单写 “nostic” 会显得学术、讨论性强，通常出现在哲学、神学或辩论语境中。"]}
{"word":"nostoc","summary":{"en":"Nostoc is a genus of cyanobacteria that forms jelly-like colonies and often helps ecosystems by fixing nitrogen.","zh":"念珠藻是一类会形成胶状群体的蓝细菌（蓝藻），常能固氮并对生态系统有益。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of blue-green algae (cyanobacteria) that forms jelly-like colonies in freshwater, wet soil, and on rocks; some species can fix nitrogen and are important in ecosystems.","zh":"念珠藻（蓝藻/蓝细菌的一种），常在淡水、潮湿土壤或岩石上形成胶状群体；部分种类能固氮，对生态系统很重要。"},"examples":[{"en":"After the rain, we saw dark green, jelly-like nostoc on the path.","zh":"下雨后，我们在小路上看到了深绿色、胶状的念珠藻。"},{"en":"Nostoc can help enrich soil because some species fix nitrogen.","zh":"念珠藻能帮助提高土壤肥力，因为有些种类可以固氮。"}]}],"synonyms":["cyanobacteria","blue-green algae"],"phonetic":"/ˈnɑsˌtɑk/","extraExplanation":["“Nostoc”来自拉丁化的学名，用于指一个蓝细菌属。它常在干燥时变成薄片或硬壳，遇水后迅速膨胀成胶状团块，所以有时会被误认为“突然长出来的东西”。","念珠藻在生态上常与植物或真菌形成共生（如与地衣相关），并在某些地区被当作食材或传统食物使用；但野外采集与食用需要谨慎，避免与有毒蓝藻混淆。"]}
{"word":"nostocaceae","summary":{"en":"Nostocaceae is a family of cyanobacteria, often forming gelatinous colonies in wet environments.","zh":"Nostocaceae（念珠藻科）是蓝细菌的一科，常在潮湿环境中形成胶质群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of cyanobacteria (blue-green algae) that includes Nostoc and related genera, often forming gelatinous colonies in fresh water, soil, or damp places.","zh":"念珠藻科：一类蓝细菌（旧称蓝绿藻）的科，包含念珠藻属（Nostoc）等相关属，常在淡水、土壤或潮湿环境中形成胶质群体。"},"examples":[{"en":"Nostocaceae can form slippery, jelly-like mats on wet rocks after rain.","zh":"雨后，念珠藻科的生物可能会在湿石头上形成滑滑的胶质藻垫。"},{"en":"Some researchers study Nostocaceae because certain species can fix nitrogen.","zh":"一些研究人员研究念珠藻科，因为其中某些种类能固氮。"}]}],"synonyms":["Nostoc family"],"phonetic":"/ˌnɑsˌtɑkˈeɪsi.i/","extraExplanation":["这是一个生物分类学名词：科（family）。写作时通常首字母大写（Nostocaceae），但在非正式语境也可能小写。","“cyanobacteria”现在是更常用、更准确的说法；“blue-green algae（蓝绿藻）”是较旧、但在科普文章中仍常见的称呼。","念珠藻科常出现在生态学、淡水生物学、土壤科学与环境修复等领域的文章中，重点常与“形成胶质群体”“固氮（nitrogen fixation）”“水华（bloom，部分蓝细菌相关）”等主题有关。"]}
{"word":"nostocaceous","summary":{"en":"An adjective meaning “related to the cyanobacteria family Nostocaceae.”","zh":"形容词，意为“与念珠藻科（Nostocaceae）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling Nostocaceae, a family of cyanobacteria (blue-green algae) that often form jelly-like colonies, especially in freshwater or damp soil.","zh":"与念珠藻科（Nostocaceae）有关的；或类似念珠藻科的一类蓝藻（蓝绿藻），常形成胶状群体，常见于淡水或潮湿土壤。"},"examples":[{"en":"Under the microscope, the sample showed a nostocaceous colony with bead-like cells.","zh":"在显微镜下，这个样本显示出念珠藻科的群体，细胞呈串珠状。"},{"en":"Some nostocaceous cyanobacteria can fix nitrogen, helping plants in poor soils.","zh":"一些念珠藻科蓝藻能固氮，帮助植物在贫瘠土壤中生长。"}]}],"synonyms":["nostoc-like","cyanobacterial (broader)"],"phonetic":"/ˌnɑstəˈkeɪʃəs/","extraExplanation":["“nostocaceous”主要用于生物学/植物学/微生物学的学术写作中，日常英语很少见。","词源上来自属名“Nostoc（念珠藻）”+ 形容词后缀“-aceous（……的；具有……性质的）”。"]}
{"word":"nostochine","summary":{"en":"A rare scientific word for a compound associated with *Nostoc* cyanobacteria.","zh":"一个非常罕见的科研用词，指与念珠藻属（*Nostoc*）相关的一种化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, chemistry/biology) A natural chemical compound reported from *Nostoc* (a genus of cyanobacteria), mentioned mainly in scientific literature rather than everyday English.","zh":"（罕见；化学/生物）一种据报道来自念珠藻属（*Nostoc*，一种蓝藻/蓝细菌）的天然化合物；主要出现在科研文献中，日常英语中几乎不用。"},"examples":[{"en":"The paper identified several metabolites, including nostochine, in the *Nostoc* sample.","zh":"该论文在念珠藻样品中鉴定出多种代谢物，其中包括 nostochine。"},{"en":"Nostochine is a term you’re more likely to see in a chemistry database than in general dictionaries.","zh":"nostochine 这个词更常见于化学数据库，而不是普通词典。"}]}],"phonetic":"/ˈnɑstəˌkaɪn/","extraExplanation":["这个词非常冷门，通常只在学术语境出现。词形上由 *Nostoc*（念珠藻属）+ “-ine”（英语中常见的“化学物质/生物碱”等后缀）构成，因此多半是某种被分离、命名的天然化合物名称。","不同文献对这类化合物的具体结构、分类可能会有差异；如果你是从某篇论文或数据库看到的，建议把出处（句子/链接/领域）贴出来，我可以按上下文帮你确认它具体指哪一种物质。"]}
{"word":"nostocs","summary":{"en":"Nostoc is a type of cyanobacteria that often appears as jelly-like blobs on wet ground or in water.","zh":"Nostoc（念珠藻）是一种蓝藻，常在潮湿地面或水中呈胶状团块出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of cyanobacteria (blue-green algae) that forms jelly-like colonies in water or on damp soil, sometimes seen as greenish or brownish blobs after rain","zh":"念珠藻属；一种蓝藻（蓝绿藻），在水中或潮湿土壤上形成胶状群体，雨后常可见到绿色或褐色的胶团"},"examples":[{"en":"After the rain, we noticed jelly-like clumps of Nostoc on the path.","zh":"雨后，我们在小路上看到了一团团胶状的念珠藻。"},{"en":"Some Nostoc species can fix nitrogen, helping plants in poor soil.","zh":"某些念珠藻能固氮，有助于在贫瘠土壤中生长的植物。"}]}],"synonyms":["cyanobacteria","blue-green algae"],"phonetic":"/ˈnɑːstɑːk/","extraExplanation":["“Nostoc”常见于生物学与生态学语境，中文多译作“念珠藻”。你输入的“nostocs”很可能是把复数写成了加 s 的形式；在英文里也可写作“nostoc colonies”（念珠藻群体）来表达复数含义。","词名“Nostoc”来自较早期的科学命名传统，被用来指这种看起来像“果冻团/胶团”的藻类群体。"]}
{"word":"nostologic","summary":{"en":"“nostologic” is not standard; the correct word is usually “nostalgic,” meaning feeling warm (often slightly sad) about the past.","zh":"“nostologic”不是标准拼写；通常应为“nostalgic”，表示对过去产生温暖且常带一点伤感的怀旧之情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common misspelling) Intended word: “nostalgic” — having a warm, slightly sad feeling when thinking about the past.","zh":"（常见拼写错误）你想表达的通常是“nostalgic”——怀旧的；想到过去时带着温暖又有点伤感的感觉。"},"examples":[{"en":"That song makes me feel nostalgic for my school days.","zh":"那首歌让我想起学生时代，觉得很怀旧。"},{"en":"We watched old photos and got nostalgic.","zh":"我们看着旧照片，变得怀旧起来。"}]}],"synonyms":["nostalgic","sentimental","reminiscent"],"phonetic":"/nəˈstældʒɪk/","extraExplanation":["“nostologic”不是标准英文拼写；正确拼写通常是 **nostalgic**（形容词）。","“nostalgic”来自“nostalgia”（怀旧、乡愁）。它常带有“温暖 + 微微伤感”的情绪色彩，不只是“想念”。","相关表达：**feel nostalgic**, **be nostalgic for/about**, **a nostalgic trip**（一次怀旧之旅）, **a nostalgic feeling**。"]}
{"word":"nostology","summary":{"en":"Nostalgia is a warm, sometimes bittersweet longing for the past.","zh":"Nostalgia 指对过去的温暖而略带伤感的怀念与向往。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of warm, sometimes slightly sad, longing for the past (often for a time or place connected to happy memories)","zh":"怀旧；对过去（常与美好回忆相关的时光或地方）的温暖但略带伤感的向往"},"examples":[{"en":"Looking at old photos filled her with nostalgia for her childhood.","zh":"看着旧照片让她充满了对童年的怀旧之情。"},{"en":"He felt a wave of nostalgia when he heard the song from high school.","zh":"听到那首高中时的歌，他突然涌起一阵怀旧。"},{"en":"Many movies use nostalgia to remind people of the 1980s.","zh":"很多电影会利用怀旧元素让人想起20世纪80年代。"}]}],"synonyms":["longing","sentimentality","yearning","reminiscence"],"phonetic":"/nɑˈstældʒə/","extraExplanation":["你输入的“nostology”很可能是拼写误写，常见正确词是 **nostalgia**（怀旧）。英语里也有 **nosology**（疾病分类学），但含义与“怀旧”无关。","**nostalgia** 词源来自希腊语：*nostos*（回家）+ *algos*（痛苦）。早期曾用来指“思乡病”，后来意义变为更广泛的“对过去的怀念”。","在文化语境中，**nostalgia** 常用于谈论复古风潮（复古穿搭、老歌、老电影、童年回忆），语气通常是温柔、感伤或带点浪漫化。"]}
{"word":"nostomania","summary":{"en":"Nostomania means an intense, sometimes obsessive longing to return home or back to the past—stronger than ordinary nostalgia.","zh":"Nostomania 指一种强烈、甚至近乎执念的“回到故乡或回到过去”的渴望，比一般的怀旧更强烈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, sometimes obsessive longing to return to a past time or to one’s home; an extreme form of nostalgia","zh":"强烈、甚至近乎执念地想回到过去某段时光或回到故乡；一种极端的怀旧/思乡情绪"},"examples":[{"en":"After moving abroad, she felt nostomania whenever she heard songs from her childhood.","zh":"搬到国外后，她每次听到童年歌曲都会产生强烈的“nostomania”（极度怀旧/思乡）。"},{"en":"His nostomania made it hard to enjoy the present, because he constantly compared everything to the “good old days.”","zh":"他的极度怀旧让他很难享受当下，因为他总把一切都拿来和“过去的好日子”比较。"}]}],"synonyms":["nostalgia","homesickness","yearning","longing"],"phonetic":"/ˌnɑstəˈmeɪniə/","extraExplanation":["词源上由希腊语元素构成：nostos（回家、归乡）+ mania（狂热、癖好）。因此它比一般的 nostalgia（怀旧/思乡）更强调“近乎上瘾或执念”的程度。","这是一个相对少见、偏文学或心理描写的词；日常英语更常用 nostalgia（怀旧）或 homesickness（想家）。"]}
{"word":"nostomanic","summary":{"en":"Nostomanic describes someone who feels an intense, almost addictive nostalgia for the past.","zh":"Nostomanic 指极度怀旧、对过去有近乎上瘾般强烈眷恋的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling intensely nostalgic; having an almost compulsive longing for the past (as if “addicted” to nostalgia).","zh":"极度怀旧的；对过去有近乎“上瘾”般的强烈眷恋。"},"examples":[{"en":"After moving away, she became nostomanic, replaying old home videos every weekend.","zh":"搬走以后，她变得很“nostomanic”，几乎每个周末都重看以前的家庭录像。"},{"en":"His nostomanic mood made him idealize high school and ignore why he wanted to leave back then.","zh":"他的怀旧情绪让他把高中生活过度美化，反而忽略了当年想离开的原因。"}]}],"synonyms":["nostalgic","overly nostalgic","sentimental","stuck in the past","homesick (sometimes, depending on context)"],"phonetic":"/ˌnɑstəˈmænɪk/","extraExplanation":["“nostomanic”不是传统词典里的常见词，来自 John Koenig 的《The Dictionary of Obscure Sorrows》（网络项目/书），用来为“说不出口的复杂情绪”造词。","词形上结合了“nosto-（回家、回归；也让人联想到 nostalgia 怀旧）”和“-manic（痴迷的、近乎强迫的）”，强调“怀旧到停不下来”的感觉。","使用场景多见于写作、社交媒体或自我表达；正式写作中可用更常见的表达如 “deeply nostalgic / overly nostalgic / obsessed with the past”。"]}
{"word":"nostradamus","summary":{"en":"Nostradamus is a 16th-century French astrologer and writer often linked to prophecies.","zh":"诺查丹玛斯是16世纪法国的占星家与作家，常与“预言”联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nostradamus: a famous French astrologer and writer (1503–1566), known for a book of short, often unclear poems that many people later interpret as predictions of future events.","zh":"诺查丹玛斯：著名的法国占星家与作家（1503–1566），以写作一部由许多简短且含义模糊的诗句组成的作品而闻名；这些诗句常被后人解读为对未来事件的预言。"},"examples":[{"en":"Some people claim Nostradamus predicted major wars, but the verses are open to interpretation.","zh":"有人声称诺查丹玛斯预言了重大战争，但这些诗句的解释空间很大。"},{"en":"The documentary compared modern events with Nostradamus’s writings.","zh":"这部纪录片把现代事件与诺查丹玛斯的著作进行了对比。"}]}],"synonyms":["prophet (figurative)","seer (figurative)"],"phonetic":"/ˌnɑːstrəˈdɑːməs/","extraExplanation":["“Nostradamus”通常指这个历史人物；他的主要作品是《Les Prophéties》（常译《诸世纪/预言集》），写成四行诗（quatrains）。因为语言隐晦、意象多、可套用范围广，所以常出现“事后对号入座”的解读。","在英语里也常用作文化梗：当有人“神预言”或似乎提前说中了什么，别人可能会半开玩笑地称他/她为“a Nostradamus”。"]}
{"word":"nostrificate","summary":{"en":"A formal verb meaning to officially recognize a foreign degree as equivalent in another country.","zh":"一个较正式的动词，指对国外学位进行官方认证，使其在本国被承认为同等有效。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially recognize or validate a foreign academic degree or qualification as equivalent in another country","zh":"（对国外学位/资格）进行官方认证或承认，使其在本国被视为同等有效"},"examples":[{"en":"She had to nostrificate her medical degree before she could work in the U.S.","zh":"她必须先把自己的医学学位做认证，才能在美国工作。"},{"en":"The university can nostrificate diplomas from certain accredited schools.","zh":"这所大学可以对某些受认可学校的文凭进行认证。"}]}],"synonyms":["recognize (a degree)","validate (credentials)","credential evaluation","grant equivalency"],"phonetic":"/ˈnɑstrəˌfeɪt/","extraExplanation":["这是一个较正式、偏行政/法律语境的词，常见于中欧、东欧等地区的学历认证流程（例如把外国文凭“本国化/认可”）。日常英语里更常用的表达是: have your degree recognized, credential evaluation, degree equivalency, validate a foreign degree。","词源上与拉丁语 noster（“我们的”）有关，带有“把外来的东西变成我们体系内认可的东西”的含义。"]}
{"word":"nostrification","summary":{"en":"Nostrification means the official recognition of a foreign degree or qualification in another country.","zh":"nostrification 指把国外学历或职业资格在另一国进行官方认证、承认为等同的程序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the official process of recognizing a foreign diploma, degree, or professional qualification as equivalent in another country","zh":"（学位/文凭/资格的）认证；承认（将国外学历或职业资格在本国视为等同）"},"examples":[{"en":"She applied for nostrification of her medical degree so she could work in Germany.","zh":"她申请了医学学位认证，这样就能在德国工作。"},{"en":"Nostrification can require translating documents and taking additional exams.","zh":"学历认证可能需要翻译文件并参加额外考试。"}]}],"synonyms":["credential evaluation","degree recognition","recognition of qualifications","equivalency assessment"],"phonetic":"/ˌnɑstɹɪfɪˈkeɪʃən/","extraExplanation":["“nostrification”多用于欧洲一些国家（如捷克、斯洛伐克等）的教育与职业资格体系中，指对国外学历/资格进行官方等同性认定的程序。在英语国家更常见的说法是“degree recognition / credential evaluation / recognition of qualifications”。","词源上与拉丁语“noster”（意为“我们的”）相关，含义上有“把外来的资格视为‘我们体系里的’”的感觉。"]}
{"word":"nostril","summary":{"en":"A nostril is one of the two openings of the nose used for breathing and smelling.","zh":"nostril 指鼻子的两个开口之一，用于呼吸和闻气味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the two openings in your nose that you breathe through.","zh":"鼻孔；鼻子的一个开口，用来呼吸。"},"examples":[{"en":"My nostrils flared when I smelled smoke.","zh":"我闻到烟味时鼻孔张开了。"},{"en":"Breathe in slowly through your nostrils.","zh":"用鼻孔慢慢吸气。"},{"en":"Cold air made his nostrils sting.","zh":"冷空气让他的鼻孔刺痛。"}]}],"synonyms":["nasal opening"],"phonetic":"/ˈnɑstrəl/","extraExplanation":["“nostril”来自拉丁语 *nasus*（鼻子）相关词源，和“nasal（鼻子的）”“nausea（恶心，原意与晕船/鼻腔不适相关）”在词源上有联系。","常见搭配：“through the nostrils（通过鼻孔）”“nostrils flared（鼻孔张开）”“block(ed) nostril(s)（鼻塞/鼻孔堵住）”。"]}
{"word":"nostriled","summary":{"en":"“nostriled” is a rare, poetic adjective meaning “having (often flaring) nostrils.”","zh":"“nostriled”是罕见的诗歌用形容词，意为“有（常指张开或翕动的）鼻孔的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, poetic) Having nostrils; describing a creature’s nose, often with an added idea of being open or flaring.","zh":"（罕见，诗歌用语）有鼻孔的；用于描写生物的鼻部，常暗含“鼻孔张开/翕动”的感觉。"},"examples":[{"en":"The horse stood wide-nostriled, smelling smoke in the wind.","zh":"那匹马鼻孔大张地站着，嗅到了风里的烟味。"},{"en":"A nostriled beast tracked the scent through the dark woods.","zh":"一头有鼻孔的野兽循着气味穿过黑暗的林地。"}]}],"synonyms":["wide-nostriled","nostrilled","flared-nostriled","with flaring nostrils"],"phonetic":"/ˈnɑstrəld/","extraExplanation":["“nostriled”在现代英语中非常少见，多见于旧式写法或诗歌语境；更常见的表达是“wide-nostriled / wide-nostrilled（鼻孔张开）”“flaring nostrils（鼻孔翕动）”。","词根来自“nostril（鼻孔）”。在文学描写里，用它往往是为了营造更古典、更具画面感的语气。"]}
{"word":"nostrility","summary":{"en":"Nostrility is a rare noun meaning the nostrils collectively, and sometimes (archaically) the sense of smell.","zh":"Nostrility 是个罕见名词，主要指鼻孔（统称），也可古旧地指嗅觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the nostrils collectively; the condition or idea of having nostrils (rare)","zh":"鼻孔（统称）；有鼻孔这一特征/状态（罕见用法）"},"examples":[{"en":"Cold air rushed into her nostrility as she stepped outside.","zh":"她走到外面时，冷空气猛地灌入她的鼻孔。"},{"en":"The writer described the animal’s nostrility to emphasize its keen breathing and tracking.","zh":"作者描写那只动物的“鼻孔”，用来强调它敏锐的呼吸与追踪能力。"}]},{"partOfSpeech":"n.","definition":{"en":"the sense of smell (very rare or archaic)","zh":"嗅觉（非常罕见或古旧用法）"},"examples":[{"en":"Strong spices can overwhelm your nostrility for a moment.","zh":"浓烈的香料可能会让你的嗅觉短暂失灵。"}]}],"synonyms":["nostrils","sense of smell","olfaction"],"phonetic":"/nɑˈstrɪləti/","extraExplanation":["“nostrility”在现代英语中非常少见，更常用的说法是“nostrils”（鼻孔）或“sense of smell / olfaction”（嗅觉）。如果你的写作目标是自然、地道的现代英语，一般建议避免使用这个词。","构词上可理解为“nostril（鼻孔）+ -ity（……的状态/性质）”，类似于“human + -ity → humanity（人性/人类）”。因此它带有一点“抽象化、文学化”的味道，偶尔会在刻意的修辞或仿古表达中出现。"]}
{"word":"nostrilled","summary":{"en":"Nostrilled means “having nostrils,” usually in formal or descriptive contexts.","zh":"nostrilled 意为“有鼻孔的”，多用于较正式或描写性语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having nostrils (used to describe an animal or person, often in scientific or descriptive writing).","zh":"有鼻孔的（用于描述动物或人，常见于科学或描写性语境）。"},"examples":[{"en":"Most land mammals are nostrilled, breathing air through two openings in the nose.","zh":"大多数陆生哺乳动物都有鼻孔，通过鼻子上的两个开口呼吸空气。"},{"en":"The artist drew a nostrilled mask to make it look more lifelike.","zh":"艺术家画了一个带鼻孔的面具，让它看起来更逼真。"}]}],"synonyms":["with nostrils","nosed","nasal"],"phonetic":"/ˈnɑˌstrəld/","extraExplanation":["“nostrilled”是由名词“nostril（鼻孔）”加形容词后缀“-ed”构成，表示“具有……的”。类似结构还有“bearded（有胡子的）”“winged（有翅膀的）”。","这个词较少用于日常口语，更常见于生物学、动物学或文学描写中。日常表达通常直接说“with nostrils（有鼻孔）”或描述鼻子外观。"]}
{"word":"nostrils","summary":{"en":"“Nostrils” are the two openings of the nose used for breathing and smelling.","zh":"“nostrils”指鼻子的两个开口（鼻孔），用于呼吸和闻气味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Either of the two openings of the nose that you breathe through and smell with.","zh":"鼻孔；鼻子上用来呼吸和闻气味的两个开口之一。"},"examples":[{"en":"Cold air made my nostrils sting.","zh":"冷空气刺得我鼻孔发痛。"},{"en":"She pinched her nostrils to stop the bad smell.","zh":"她捏住鼻孔来挡住难闻的气味。"},{"en":"The horse’s nostrils flared as it ran.","zh":"马奔跑时鼻孔张开。"}]}],"synonyms":["nasal openings","nares"],"phonetic":"/ˈnɑːstrəlz/","extraExplanation":["“Nostrils”通常以复数出现，因为人类和大多数哺乳动物都有两个鼻孔；单数形式是“nostril”。","常见搭配：flare one’s nostrils（鼻孔张大，常表示用力呼吸、兴奋或愤怒）；through one’s nostrils（从鼻孔里）。"]}
{"word":"nostrilsome","summary":{"en":"“Nostrilsome” is a rare, playful adjective meaning “having noticeable nostrils” or “related to nostrils.”","zh":"“nostrilsome”是一个很少见、偏俏皮的形容词，意思是“鼻孔很明显的”或“与鼻孔有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, humorous/creative) Having noticeable nostrils; relating to the nostrils (the openings of the nose).","zh":"（罕见、偏幽默/创意用法）有明显鼻孔的；与鼻孔（鼻子的开口）有关的。"},"examples":[{"en":"In the cartoon, the dragon’s nostrilsome snout puffed smoke with every breath.","zh":"在那部动画里，龙那“鼻孔很抢眼”的口鼻每次呼吸都会喷出烟。"},{"en":"The writer described the mask as nostrilsome, leaving the nose openings clearly shaped.","zh":"作者把那副面具形容为“鼻孔突出的”，鼻部开口的形状很清晰。"}]}],"synonyms":["nostriled","nostril-like","flared-nostriled","with flared nostrils"],"phonetic":"/ˈnɑstrəlsoʊm/","extraExplanation":["“nostrilsome”不是常见标准词，更像是把名词“nostril（鼻孔）”加上形容词后缀“-some”临时造出来的词（类似“troublesome / fearsome”）。在文学描写、幽默或夸张的语境里可能出现，但正式写作更常用“nostriled / nostril-like / with flared nostrils”等表达。"]}
{"word":"nostrum","summary":{"en":"A nostrum is an unproven “cure-all” medicine or, more broadly, a too-confident solution that lacks evidence.","zh":"nostrum 指缺乏证据的“包治百病”灵药/伪药，也可泛指没有依据却被自信推销的“万能方案”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine, remedy, or product—often marketed as a “cure-all”—that is not proven to work; a quack medicine","zh":"（常指被宣传为“包治百病”但缺乏证据的）灵丹妙药；江湖药；伪药"},"examples":[{"en":"Be careful of online “miracle” nostrums that promise to cure everything overnight.","zh":"要小心网上那些号称一夜治百病的“神奇”江湖药。"},{"en":"The doctor warned that the supplement was just a nostrum with no solid scientific evidence.","zh":"医生警告说这种补充剂只是伪药，没有可靠的科学证据。"}]},{"partOfSpeech":"n.","definition":{"en":"a supposed solution to a difficult problem, especially one offered too confidently and without real proof","zh":"（对复杂问题的）万灵解法；貌似有效但缺乏依据的“万能方案”"},"examples":[{"en":"There’s no simple nostrum for poverty; it requires long-term policy work.","zh":"贫困没有简单的万能方案，需要长期的政策努力。"},{"en":"He presented the new app as a nostrum for productivity, but it didn’t change our habits.","zh":"他把新应用吹成提升效率的万能解法，但并没有改变我们的习惯。"}]}],"synonyms":["quack remedy","snake oil","cure-all","panacea (often used more neutrally)","quick fix"],"phonetic":"/ˈnɑstrəm/","extraExplanation":["词源来自拉丁语 nostrum，意思是“我们的（东西）”。早期常用来指药商/江湖郎中所谓“自家秘方”，暗示“这是我们独家的配方”，但往往缺乏验证，因此现代英语里多带有贬义。","语气与使用场景：nostrum 通常用于批评夸大宣传、缺乏证据的“神药/神方案”。在正式写作或新闻评论中常见，比口语的 scam cure、snake oil 更书面一些。","文学/文化用法：在讽刺作品或社会评论里，nostrum 常被用来嘲讽“包治百病”的政治主张或商业营销话术。"]}
{"word":"nostrummonger","summary":{"en":"A nostrummonger is someone who sells or promotes fake or doubtful “miracle” medicines.","zh":"nostrummonger 指兜售或推销假药/可疑“灵药”的人，含明显贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who sells or promotes fake or questionable medicines (a seller of “nostrums”); a quack remedy peddler.","zh":"兜售或推销假药/可疑“灵药”（所谓秘方药、专利药）的人；江湖郎中式的药贩子。"},"examples":[{"en":"The newspaper warned readers about nostrummongers advertising miracle cures.","zh":"报纸提醒读者警惕那些打着“神奇疗效”广告的假药贩子。"},{"en":"She was tired of nostrummongers who profited from people’s fear.","zh":"她厌倦了那些利用人们的恐惧牟利的江湖药商。"}]}],"synonyms":["quack","snake-oil salesman","charlatan","peddler"],"phonetic":"/ˈnɑstrəmˌmʌŋɡər/","extraExplanation":["这是一个带强烈贬义的词：nostrum 指“包治百病的秘方药/专利药”（常暗示疗效不可靠），monger 有“贩卖者/兜售者”的意思（如 warmonger “战争贩子”）。因此 nostrummonger 常用于批评利用夸大宣传、伪科学或恐慌营销来卖药的人，现代语境也可引申到卖各种“神奇疗法/保健品”的人。","读写中更常见的近义表达包括 quack、snake-oil salesman、peddler of fake cures。文学或新闻评论里偶尔会用 nostrummonger 来增加讽刺和批判力度。"]}
{"word":"nostrummongership","summary":{"en":"Nostrummongership means the dishonest selling of supposed “miracle” cures—quack medicine marketing.","zh":"nostrummongership 指以欺骗或夸大方式兜售所谓“灵丹妙药/包治百病药”的行为，即江湖骗医式营销。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice or business of promoting and selling “nostrums” (supposed cures or remedies), especially in a dishonest or misleading way; quackery.","zh":"兜售所谓“灵丹妙药”（江湖秘方/包治百病药）的行当或行为，尤指带有欺骗性、误导性的推销；江湖骗医、卖假药式宣传。"},"examples":[{"en":"The report condemned the company’s nostrummongership and its false claims about curing cancer.","zh":"报告谴责了该公司的“灵药”兜售行为，以及其关于“能治癌”的虚假宣传。"},{"en":"In the novel, the traveling salesman’s nostrummongership preys on poor families’ fears.","zh":"在小说中，走街串巷的推销员靠兜售“灵药”来利用贫困家庭的恐惧心理。"}]}],"synonyms":["quackery","snake-oil selling","charlatanism","medical fraud"],"phonetic":"/ˈnɑs.trəm ˌmɑŋ.ɡɚ.ʃɪp/","extraExplanation":["词源提示：nostrum 原意来自拉丁语“我们的”，历史上常用来指“自家秘制”的专利药/偏方（往往不公开成分）；monger 表示“贩卖者/兜售者”。合起来带有强烈贬义，常用于批评夸大疗效、缺乏科学依据的保健品或药品营销。","用法上较少见，更常见的近义表达有 quackery（江湖骗医）、snake-oil selling（卖假药式营销）、fraudulent remedy marketing（欺诈性药品/疗法营销）。"]}
{"word":"nostrummongery","summary":{"en":"Nostrummongery means quack medicine selling—promoting fake or unproven “miracle cures.”","zh":"Nostrummongery 指兜售或宣传虚假/未经证实的“神药”，即江湖骗医式的推销。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the selling or promotion of fake or unproven medicines; quackery (and, more broadly, the pushing of “miracle cures” or dubious solutions).","zh":"兜售或宣传虚假/未经证实的药物；江湖骗医（也可泛指推销“神药”或可疑的万能解决方案）。"},"examples":[{"en":"The health agency warned the public about online nostrummongery during flu season.","zh":"卫生机构在流感季提醒公众警惕网上兜售“神药”的骗术。"},{"en":"He dismissed the ad as pure nostrummongery with no scientific evidence behind it.","zh":"他认为那则广告完全是在卖假药，因为没有任何科学证据支持。"}]}],"synonyms":["quackery","snake-oil selling","charlatanism"],"phonetic":"/ˈnɑs.trəmˌmʌŋ.ɡɚ.i/","extraExplanation":["这个词比较少见，语气偏批评/讽刺，常用于正式写作或评论中，用来指“江湖郎中式”的推销。","词源上由 nostrum（“祖传秘方/灵药”，常带贬义）+ mongery（“兜售、贩卖某物的行当”，如 warmongery“鼓吹战争”）构成。","在现代语境里，它不一定只指“药”，也可指各种打着“快速见效、包治百病”旗号的夸大式营销（如某些保健品、玄学疗法等）。"]}
{"word":"nostrums","summary":{"en":"“Nostrums” are supposed remedies—often “miracle cures”—with doubtful value; figuratively, they’re oversold easy fixes for hard problems.","zh":"“nostrums”指疗效可疑、被夸大宣传的“神药/万灵药”；引申为对复杂问题的被吹捧的“万能解”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of \"nostrum\") a medicine or remedy, especially one that is sold with exaggerated claims and whose effectiveness is doubtful; a “cure-all.”","zh":"（nostrum 的复数）药方/疗法，尤指被夸大宣传、疗效可疑的“万灵药/偏方”。"},"examples":[{"en":"The internet is full of nostrums that promise quick weight loss.","zh":"网上充斥着各种号称能快速减肥的“万灵药”。"},{"en":"Be careful of expensive nostrums sold as miracle cures.","zh":"要小心那些价格昂贵、被当作“神奇疗法”来卖的药。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a simple solution offered for a difficult problem, often oversold or unrealistic.","zh":"（比喻）对复杂问题给出的“简易万能解”，常常被过度包装或不切实际。"},"examples":[{"en":"There are no political nostrums that can fix the economy overnight.","zh":"没有哪种政治“灵丹妙药”能让经济一夜好转。"},{"en":"The article warned against management nostrums that sound good but change little.","zh":"那篇文章提醒人们警惕听起来很美、却改变不大的管理“万能方案”。"}]}],"synonyms":["quack remedy","snake oil","panacea","cure-all","quick fix"],"phonetic":"/ˈnɑstrəm/","extraExplanation":["“nostrum”原意来自拉丁语 *nostrum*，意思是“我们的（东西）”，早期常指“我们自家秘制的药”。后来它逐渐带有贬义，暗示商家把配方当秘密来卖，并夸大功效（类似“江湖偏方/祖传秘方”的语感）。","在新闻、评论写作里很常见，用来批评“看似简单、号称包治百病”的解决方案。"]}
{"word":"nosu","summary":{"en":"“Nosu” usually refers to the Nuosu (a Yi subgroup) or their language in Southwest China.","zh":"“Nosu”通常指中国西南的诺苏人（彝族的一支）或其语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Nuosu (also written Nosu), a subgroup of the Yi people in Southwest China; sometimes used as an older romanization.","zh":"诺苏人（也写作 Nuosu / Nosu），中国西南地区彝族的一支；有时是较早的拉丁转写写法。"},"examples":[{"en":"The Nuosu (Nosu) live mainly in Liangshan, Sichuan.","zh":"诺苏人（Nosu）主要居住在四川凉山地区。"},{"en":"Some older books use the spelling “Nosu,” while many recent sources prefer “Nuosu.”","zh":"一些较早的书写作“Nosu”，而较新的资料常用“Nuosu”。"}]},{"partOfSpeech":"n.","definition":{"en":"the Nuosu language (Northern Yi), a Loloish language spoken by the Nuosu people.","zh":"诺苏语（北部彝语），诺苏人使用的一种彝语支语言。"},"examples":[{"en":"She is learning Nuosu for fieldwork.","zh":"她为了田野调查正在学习诺苏语。"},{"en":"Nuosu is written with the Yi script in many contexts.","zh":"在很多场合，诺苏语使用彝文书写。"}]}],"synonyms":["Nuosu","Yi (broader term)","Northern Yi","Nosu (older spelling)"],"phonetic":"/ˈnoʊ.suː/","extraExplanation":["“Nosu / Nuosu”多见于民族学、语言学语境；在日常英语里更常用更广义的“Yi people（彝族）”。","不同拼写往往与不同的转写系统或出版年代有关：较新的资料中“Nuosu”更常见。","涉及民族称谓时，尽量使用群体自称（如 Nuosu）或当事人偏好的称呼，以示尊重。"]}
{"word":"nosy","summary":{"en":"Nosy means overly curious about other people’s private matters.","zh":"Nosy 指过分打听或干涉别人的私事，带有不礼貌的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too curious about other people’s private business; always wanting to know details that do not concern you.","zh":"爱打听的；好管闲事的；过分好奇别人私事的。"},"examples":[{"en":"My aunt is a little nosy and asks who I’m dating.","zh":"我姑妈有点爱打听，总问我在跟谁约会。"},{"en":"It feels rude to be nosy about someone’s salary.","zh":"打听别人的工资会让人觉得很没礼貌。"},{"en":"The neighbors complained about a nosy reporter.","zh":"邻居们抱怨那个爱打探消息的记者。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is too interested in other people’s private affairs.","zh":"爱打听的人；爱管闲事的人。"},"examples":[{"en":"Don’t be a nosy—give them some privacy.","zh":"别当爱打听的人——给他们一点隐私。"},{"en":"He’s a nosy, always listening at the door.","zh":"他很爱打听，总在门口偷听。"}]}],"synonyms":["inquisitive","prying","meddlesome","intrusive"],"phonetic":"/ˈnoʊzi/","extraExplanation":["“nosy”常带负面语气，暗示“越界的好奇”。更礼貌的说法可以用“curious”（好奇）或“interested”（感兴趣），但它们通常不表示侵犯隐私。","常见搭配：nosy neighbor（爱管闲事的邻居）、nosy questions（刺探隐私的问题）、Don’t be nosy.（别多管闲事/别乱打听）。"]}
