{"word":"Nov","summary":{"en":"“Nov” is a common abbreviation for “November.”","zh":"“Nov”是“November（十一月）”的常见缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “November,” the 11th month of the year","zh":"“November（十一月）”的缩写（第11个月）"},"examples":[{"en":"My passport expires in Nov 2026.","zh":"我的护照在2026年11月到期。"},{"en":"The conference is on Nov. 12–14.","zh":"会议在11月12日至14日举行。"},{"en":"Their baby is due in Nov.","zh":"他们的宝宝预产期在11月。"}]}],"synonyms":["November","Nov."],"phonetic":"/noʊv/","extraExplanation":["“Nov”常见于日历、表格、行程、账单等较正式或空间有限的场景；在美式英语里也常写作“Nov.”（带句点），但在很多现代写法（尤其是电子文本）中不加句点也很常见。","口语中一般直接说完整的“November”，缩写“Nov”更多用于书面。"]}
{"word":"nov","summary":{"en":"“Nov.” most commonly means “November.”","zh":"“Nov.”最常见的意思是“November（十一月）”的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) short for “November,” the 11th month of the year.","zh":"（缩写）“November（十一月）”的缩写，表示一年中的第11个月。"},"examples":[{"en":"My visa appointment is on Nov. 12.","zh":"我的签证预约在11月12日。"},{"en":"The conference runs from Nov. 3–5 in Chicago.","zh":"会议在芝加哥举行，时间是11月3日至5日。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., less common) short for “novel” or “novelist” in some notes, catalogs, or informal writing.","zh":"（缩写，较少见）在某些笔记、目录或非正式写法中，可作“novel（小说）”或“novelist（小说家）”的缩写。"},"examples":[{"en":"She specializes in lit., esp. 19th‑century nov.","zh":"她专攻文学，尤其是19世纪小说。"}]}],"synonyms":["November"],"phonetic":"/noʊˈvɛm.bɚ/","extraExplanation":["在美式英文里，月份常用三字母缩写并加句点：Jan., Feb., Mar., Apr., May, Jun., Jul., Aug., Sep., Oct., Nov., Dec.（其中 May 通常不加句点）。写日期时常见格式是“Nov. 12”或“Nov. 12, 2026”。在英式英文中，有时会不加句点（例如 Nov 12）。"]}
{"word":"nova","summary":{"en":"A nova is a star that suddenly brightens and later fades; figuratively, it can mean a newly rising star (a person or success).","zh":"nova 指天文学中的“新星”（突然增亮后逐渐变暗的恒星）；也可比喻“新崛起的明星/新秀”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) A star that suddenly becomes much brighter for a short time and then gradually fades.","zh":"（天文）“新星”：一颗恒星在短时间内突然变得更亮，随后逐渐变暗。"},"examples":[{"en":"Astronomers discovered a nova in a nearby galaxy last week.","zh":"天文学家上周在一个邻近星系里发现了一颗新星。"},{"en":"The nova brightened for a few days and then slowly faded.","zh":"这颗新星亮了几天，然后慢慢变暗。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A new and rising person, talent, or success that suddenly attracts attention.","zh":"（比喻）“新星”：突然走红、迅速崭露头角的人才或事物。"},"examples":[{"en":"She’s a nova in the tech world, gaining attention very quickly.","zh":"她是科技界的一颗新星，很快就引起了关注。"},{"en":"The band became a nova overnight after their first hit song.","zh":"凭借第一首热门歌曲，这支乐队一夜之间成了新星。"}]}],"synonyms":["new star","supernova (related but different)","rising star","breakout star"],"phonetic":"/ˈnoʊvə/","extraExplanation":["“nova”来自拉丁语，意思是“新的”。在天文学里，它不是“新诞生的恒星”，而是原本就存在的恒星突然增亮（常见原因与双星系统中的物质吸积有关）。","不要与“supernova（超新星）”混淆：超新星通常是恒星生命末期的巨大爆炸，亮度更强、影响更大；而“nova”一般不会摧毁恒星本体。"]}
{"word":"novaculite","summary":{"en":"Novaculite is a hard, fine-grained stone used mainly as a natural sharpening stone.","zh":"Novaculite 是一种坚硬细密的天然石材，主要用作磨刀石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very hard, fine-grained rock (a kind of quartz-rich chert) that is commonly used as a natural whetstone for sharpening knives and tools.","zh":"一种非常坚硬、细颗粒的岩石（富含石英的燧石/硅质岩），常用作天然磨刀石，用来打磨刀具和工具。"},"examples":[{"en":"He sharpened the kitchen knife on a piece of novaculite.","zh":"他用一块诺瓦库莱特（天然磨刀石）来磨厨房刀。"},{"en":"High-quality novaculite has been valued for making whetstones for centuries.","zh":"高品质的诺瓦库莱特几个世纪以来一直因制作磨刀石而备受珍视。"}]}],"synonyms":["whetstone","sharpening stone","Arkansas stone (type)","chert (related rock)"],"phonetic":"/noʊˈvækjəˌlaɪt/","extraExplanation":["Novaculite 主要产于美国阿肯色州与俄克拉荷马州的瓦希塔山脉（Ouachita Mountains），著名的 “Arkansas stone（阿肯色磨刀石）” 多由它制成。","词源来自拉丁语 *novacula*（剃刀），暗示这种石头与“磨利刀刃”密切相关。","因为颗粒非常细密、硬度高，novaculite 常被用作精细抛光与收刃（honing），而不只是粗磨（grinding）。"]}
{"word":"novae","summary":{"en":"“Novae” is the plural of “nova,” meaning temporary bright outbursts of stars.","zh":"“Novae”是“nova”的复数，指恒星暂时变亮的“新星爆发/新星现象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “nova”: stars that suddenly become much brighter for a time because of a powerful outburst on their surface (often in a binary star system).","zh":"“nova”的复数：指恒星在一段时间内突然变得更亮的“新星爆发/新星现象”（常见于双星系统中，由恒星表面发生强烈爆发现象导致）。"},"examples":[{"en":"Astronomers recorded several novae in the Milky Way this decade.","zh":"天文学家在这十年里记录了银河系中的几次新星爆发。"},{"en":"Unlike supernovae, most novae do not destroy the star.","zh":"与超新星不同，大多数新星爆发并不会摧毁恒星。"}]}],"synonyms":["novas","stellar outbursts","new stars (historical term)"],"phonetic":"/ˈnoʊvi/","extraExplanation":["“novae”来自拉丁语复数形式（nova 的复数）。英语里科学写作常保留这种拉丁复数；日常英语中也有人直接用更规则的复数“novas”。","注意区分：nova（新星）是亮度突然增强的爆发现象；supernova（超新星）通常是恒星生命末期的大爆炸，能量更大，往往会摧毁原恒星或留下致密残骸。"]}
{"word":"novale","summary":{"en":"“Novale” is a rare word meaning newly cultivated farmland.","zh":"“novale”是个较罕见的词，指新近开垦或新近用于耕作的土地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) Land that has been newly brought under cultivation; newly cleared or newly plowed farmland.","zh":"（罕见/古用）新开垦的耕地；新近翻耕、整理出来用于种植的土地。"},"examples":[{"en":"The village expanded its fields by turning the forest edge into novale.","zh":"村庄通过把森林边缘开垦成新耕地来扩大田地。"},{"en":"In old records, the landlord listed several acres of novale beside the river.","zh":"在旧档案里，地主把河边几英亩新开垦的耕地登记在册。"}]}],"synonyms":["newly cultivated land","newly cleared land","new field","arable land"],"phonetic":"/noʊˈvɑːli/","extraExplanation":["“novale”在现代英语里很少见，多出现在历史文献、法律/土地记录或文学化写作中。","词源与拉丁语有关：与“novalis”（新耕作的、可耕的）同源，核心含义是“新近变成耕地”。"]}
{"word":"novalia","summary":{"en":"Novalia is mainly used as a proper name (brand, project, or fictional name), not a common English vocabulary word.","zh":"Novalia 主要作为专有名称使用（品牌/项目/虚构名称），不是英语里的常用词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard dictionary English word). It is most often used as a brand name, project name, or fictional place/person name.","zh":"专有名词（不是标准英语词典里的常用词）。最常见于品牌名、项目名，或虚构的地名/人名。"},"examples":[{"en":"Novalia is the name of the new app our team is building.","zh":"Novalia 是我们团队正在开发的新应用的名字。"},{"en":"In the novel, Novalia is a coastal city known for its festivals.","zh":"在小说里，Novalia 是一座以节日闻名的海滨城市。"}]}],"synonyms":["proper name","invented name","brand name"],"phonetic":"/noʊˈveɪliə/","extraExplanation":["“Novalia”在英语里通常被当作自创名称来用，因此含义取决于作者或品牌的设定，而不是固定词义。","从构词感觉上看，它可能让人联想到拉丁语系的“nova-”（新、星爆/新星的意象）以及带有地名/集合名气质的词尾“-alia”。这类名字常用来营造“新颖、未来感、浪漫的欧洲式地名”氛围。"]}
{"word":"novalike","summary":{"en":"“Novalike” means “like a nova”—suddenly bright, explosive, or star-like; it can be literal in astronomy or figurative in everyday writing.","zh":"“Novalike”表示“像新星一样”——突然明亮、爆发或星光般夺目；既可用于天文学字面含义，也常用于日常写作的比喻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a nova—suddenly very bright, explosive, or star-like in appearance or effect.","zh":"类似“新星（nova）”的——突然变得非常明亮、爆发式、或呈现星光般外观/效果的。"},"examples":[{"en":"A novalike flash lit up the sky for a second.","zh":"一道新星般的闪光把天空照亮了一秒。"},{"en":"Her performance had a novalike intensity that surprised everyone.","zh":"她的表演有一种新星般的爆发力，令所有人惊讶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Astronomy) Describing a star or object that behaves like a nova (for example, showing a sudden increase in brightness), without necessarily being a true nova.","zh":"（天文）形容某颗恒星或天体“像新星那样”表现（如亮度突然增加），但不一定是真正的新星。"},"examples":[{"en":"The team is studying a novalike outburst in a distant binary system.","zh":"团队正在研究一个遥远双星系统中类似新星的爆发现象。"}]}],"synonyms":["nova-like","star-like","radiant","brilliant","explosive"],"phonetic":"/ˈnoʊvəˌlaɪk/","extraExplanation":["“novalike”更常见的写法是“nova-like”（带连字符），属于把名词 nova（新星）加上 -like（像……的）构成的形容词。","在科普或科幻文本中，它既可用于字面（天文学现象），也可用于比喻（形容突然耀眼、爆发、夺目）。写作时注意语境：科学语境更倾向于精确描述，如“nova-like outburst（类似新星的爆发）”。"]}
{"word":"novanglian","summary":{"en":"Novanglian is a rare word meaning “of New England” or “a person from New England.”","zh":"Novanglian 是个较罕见的词，表示“新英格兰的”或“新英格兰人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to New England (in the U.S.); New England–based.","zh":"（罕见）与美国“新英格兰地区”有关的；新英格兰的。"},"examples":[{"en":"A Novanglian accent is often associated with parts of Massachusetts and Maine.","zh":"人们常把某些马萨诸塞州和缅因州的口音与“新英格兰口音”联系起来。"},{"en":"The writer’s Novanglian background shaped his stories about coastal towns.","zh":"这位作家的新英格兰背景影响了他关于海岸小镇的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person from New England; a New Englander.","zh":"（罕见）新英格兰人；来自新英格兰地区的人。"},"examples":[{"en":"Some Novanglians take pride in the region’s long history and local traditions.","zh":"一些新英格兰人以当地悠久的历史和传统为傲。"}]}],"synonyms":["New England","New Englander (n.)","New England–related (adj.)"],"phonetic":"/noʊˈvæŋɡliən/","extraExplanation":["“Novanglian”来自拉丁语写法“Nova Anglia”（意为“New England，新英格兰”）。它在现代英语里非常少见；日常更常用的说法是“New England”或“New Englander”。","如果你本来想查的是别的拼写（例如某个人名、品牌名、或“non-Anglian”等），可以告诉我出现它的句子或来源，我可以帮你确认最可能的词。"]}
{"word":"novanglican","summary":{"en":"“Novanglican” is not a standard English word. It may be a coinage meaning either “new Anglican/neo‑Anglican” or a mistaken form of “non‑Anglican.”","zh":"“novanglican”不是标准英语词，可能是自造词，意为“新圣公会的/新圣公会派”，或是把“non‑Anglican（非圣公会的）”写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare word (often a coinage). It is not widely recognized in modern English dictionaries; in context it usually needs clarification by the writer.","zh":"一个不规范或非常罕见的词（常为自造词）。在现代英语词典中并不常见；在具体语境里通常需要作者进一步说明。"},"examples":[{"en":"“Novanglican” isn’t a standard English word, so I’m not sure what the author means without more context.","zh":"“novanglican”不是标准英语词，所以没有更多上下文我不确定作者想表达什么。"},{"en":"If you meant “non-Anglican,” you could write: She is non-Anglican but attends an Anglican school.","zh":"如果你想表达“非圣公会的”，可以写：她不是圣公会教徒，但在一所圣公会学校就读。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Possible intended meaning) “new Anglican” or “neo‑Anglican,” referring to a new form, movement, or style connected with Anglicanism.","zh":"（可能想表达的意思）“新的圣公会的 / 新圣公会派”，指与圣公会传统相关的一种新形式、新运动或新风格。"},"examples":[{"en":"Some writers use made-up labels like “neo‑Anglican” to describe modern worship styles.","zh":"有些作者会用“neo‑Anglican”这类自造标签来描述现代的敬拜风格。"},{"en":"If you mean a new movement, consider writing “a new Anglican movement” instead of “novanglican.”","zh":"如果你指的是新运动，建议写成“a new Anglican movement”，比“novanglican”更清楚。"}]}],"synonyms":["non-Anglican","neo-Anglican","new Anglican"],"phonetic":"/ˌnoʊvæŋˈɡlɪkən/","extraExplanation":["“novanglican”看起来像由拉丁语前缀“nov-”（意为“新”）+ “Anglican”（圣公会的）拼合而成，但英语里更常见的表达是“neo‑Anglican / new Anglican”。","如果你的本意是“非圣公会的”，标准写法是“non‑Anglican”。因为两种意思差很多，最好根据你要表达的宗教身份或风格来选词。"]}
{"word":"novantique","summary":{"en":"“Novantique” is a rare, nonstandard term meaning “new but antique-looking,” often used for design, décor, or branding.","zh":"“Novantique”是较少见的非标准用语，常用于设计/装饰/品牌语境，表示“新的但呈现古董感（仿古/复古风）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A rare, nonstandard word (often used in branding or design talk) meaning “new but made to look antique,” or “a modern reinterpretation of an antique style.”","zh":"一个较少见、非标准的词（常见于品牌/设计语境），指“新的但做旧成古董风”，或“以现代方式重新演绎古董风格”。"},"examples":[{"en":"The hotel’s lobby has a novantique feel—old-world details with modern lighting.","zh":"这家酒店大堂有种“新古典/新仿古”的感觉——古典细节配现代灯光。"},{"en":"She prefers novantique furniture that looks vintage but is built for everyday use.","zh":"她更喜欢“新仿古”的家具：看起来复古，但结实耐用、适合日常使用。"}]},{"partOfSpeech":"n.","definition":{"en":"A novantique item or style (something designed to appear antique while being newly made).","zh":"“新仿古”的物件或风格（看起来像古董但其实是新制作的东西）。"},"examples":[{"en":"Most of the décor is novantique, not genuine antiques.","zh":"大多数装饰都是“新仿古”的，并非真正古董。"}]}],"synonyms":["faux-antique","antique-style","vintage-inspired","retro","reproduction"],"phonetic":"/ˌnoʊvænˈtiːk/","extraExplanation":["“novantique”并不是常见的词典英语词，更像是由“novo-/nova-（新）”+“antique（古董/古风）”拼合出来的营销或风格用语。实际使用中常接近：faux antique（仿古）、antique-style（古董风）、vintage-inspired（复古灵感）。","如果你是在某个品牌名、店名、产品系列里看到它，它可能有更具体的“新旧混搭/新古典/做旧工艺”等含义，最好结合原句或图片来判断。"]}
{"word":"novarsenobenzene","summary":{"en":"Novarsenobenzene is an older arsenic-based drug once used to treat syphilis.","zh":"Novarsenobenzene 是一种较早期的含砷药物，曾用于治疗梅毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic arsenic-based medicine formerly used to treat syphilis and some related infections; also known as arsphenamine (an early “chemotherapy” drug)","zh":"一种含砷的合成药物，过去用于治疗梅毒及相关感染；亦称“砷凡纳明/阿司凡纳明（arsphenamine）”，属于早期“化学疗法”药物"},"examples":[{"en":"Before penicillin became widely available, novarsenobenzene was used to treat syphilis.","zh":"在青霉素尚未广泛使用之前，novarsenobenzene 曾用于治疗梅毒。"},{"en":"Because of toxicity concerns, novarsenobenzene is mainly discussed today in medical history.","zh":"由于毒性问题，novarsenobenzene 如今主要出现在医学史的讨论中。"}]}],"synonyms":["arsphenamine","Salvarsan"],"phonetic":"/ˌnoʊˌvɑrˌsiːnoʊˈbɛnziːn/","extraExplanation":["这个词常与“Salvarsan（商品名）/606号化合物”联系在一起，属于20世纪初保罗·埃尔利希（Paul Ehrlich）推动的“化学疗法”背景：用特定化学物质定向对付病原体，是现代抗感染药物发展的重要里程碑。","含砷药物可能带来明显副作用与使用限制；随着更安全有效的抗生素（如青霉素）出现，这类药物逐渐被淘汰。"]}
{"word":"novas","summary":{"en":"\"Novas\" is the plural of \"nova\"—most commonly, brightening stars seen in astronomy; it can also mean bossa nova songs/dances in music contexts.","zh":"“novas”是“nova”的复数：最常见指天文学中的“新星”；在音乐语境中也可指巴萨诺瓦风格的歌曲/舞曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of \"nova\": a star that suddenly becomes much brighter for a time and then slowly fades.","zh":"“nova”的复数：新星（指一颗恒星在一段时间内突然变得更亮，然后逐渐变暗的天文现象）。"},"examples":[{"en":"Astronomers recorded several novas in the Milky Way this decade.","zh":"天文学家记录了这十年银河系中出现的几次新星。"},{"en":"A nova can brighten dramatically and then fade over weeks or months.","zh":"新星可能会显著变亮，然后在数周或数月内逐渐变暗。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of \"nova\" in music: a bossa nova song or dance style (especially in phrases like \"bossa novas\").","zh":"音乐用法中“nova”的复数：巴萨诺瓦（bossa nova）风格的歌曲或舞曲（常见于“bossa novas”等表达）。"},"examples":[{"en":"The playlist mixes jazz standards with a few bossa novas.","zh":"这张歌单把爵士经典和几首巴萨诺瓦风格的歌混在一起。"},{"en":"They danced to soft bossa novas late into the night.","zh":"他们随着柔和的巴萨诺瓦舞曲跳舞到深夜。"}]}],"synonyms":["new stars","stellar outbursts","bossa nova songs"],"phonetic":"/ˈnoʊvəz/","extraExplanation":["“nova”源自拉丁语，意思是“新的”。在天文学里，新星（nova）与“超新星（supernova）”不同：超新星通常更剧烈、能量更大，常与恒星末期的爆炸有关。日常英语里提到“novas”时，多数是在天文语境中指多次新星事件。"]}
{"word":"novate","summary":{"en":"Novate means to renew or make something new; in law, it means replacing an old contract/obligation with a new one (novation).","zh":"Novate 可指“使更新/创新”；在法律中指“合同或债务的更替（以新代旧）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something new again; to renew or innovate","zh":"使更新；使焕然一新；创新"},"examples":[{"en":"The company tried to novate its brand image to attract younger customers.","zh":"公司试图更新品牌形象，以吸引更年轻的顾客。"},{"en":"Regular practice can novate your skills over time.","zh":"持续练习会让你的技能随着时间不断提升与更新。"}]},{"partOfSpeech":"vt.","definition":{"en":"(law) to replace an old contract or obligation with a new one, often by substituting one party for another","zh":"（法律）以新合同/新债务替代旧合同/旧债务；（常指）更换合同当事人进行“更替（novation）”"},"examples":[{"en":"They novated the lease so the new tenant took over all obligations.","zh":"他们对租约进行了更替，让新租客承担所有义务。"},{"en":"The bank agreed to novate the agreement after the merger.","zh":"并购后，银行同意对协议进行更替。"}]}],"synonyms":["renew","revise","refresh","innovate","replace"],"phonetic":"/ˈnoʊveɪt/","extraExplanation":["“Novate”来自拉丁语词根 nov-（new，新），同根词包括 novel（小说/新奇的）、innovate（创新）、renovate（翻新）。日常英语里更常用 innovate 或 renovate；novate 比较少见。","法律语境中，novate 与名词 novation（合同更替）相关：核心是“旧的义务被新的义务取代”，通常需要各方同意。这和简单的“转让（assignment）”不同：转让可能不消灭原义务，而 novation 通常会以新关系取代旧关系。"]}
{"word":"novatian","summary":{"en":"Novatian refers to a 3rd-century Christian leader named Novatian, and to the strict movement and followers associated with him.","zh":"Novatian 指三世纪的基督教人物诺瓦提安，也可指与他相关的严格派运动及其追随者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a 3rd-century Christian theologian and Roman priest (Novatian, c. 200–258) whose strict views helped cause a church split","zh":"三世纪的基督教神学家与罗马司祭诺瓦提安（Novatian，约200–258），其严厉立场曾促成教会分裂"},"examples":[{"en":"Novatian is remembered for opposing the easy readmission of Christians who had denied their faith under persecution.","zh":"诺瓦提安因反对轻易接纳在迫害中否认信仰的基督徒而被人记住。"},{"en":"Some early church histories describe the dispute involving Novatian and the leadership in Rome.","zh":"一些早期教会史记载了诺瓦提安与罗马教会领导层之间的争议。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Novatian or to the strict movement associated with him (Novatianism)","zh":"与诺瓦提安或其相关的严格派运动（诺瓦提安主义）有关的"},"examples":[{"en":"A Novatian position emphasized strict discipline in the church.","zh":"诺瓦提安派的立场强调教会内的严格纪律。"},{"en":"The letter discusses a Novatian controversy in the third century.","zh":"这封信讨论了三世纪的诺瓦提安派争议。"}]},{"partOfSpeech":"n.","definition":{"en":"a member or follower of the Novatian movement (also called a Novatianist)","zh":"诺瓦提安派的成员或追随者（也称 Novatianist）"},"examples":[{"en":"In some sources, Novatians are described as separating from the main church over issues of forgiveness.","zh":"在一些资料中，诺瓦提安派被描述为因“是否应赦免”而与主流教会分离。"}]}],"synonyms":["Novatianist"],"phonetic":"/noʊˈveɪʃən/","extraExplanation":["“Novatian”来自人名 Novatianus 的英语形式。历史背景常与“lapsi（失足者）”问题相关：在迫害时期否认信仰的人，事后是否能被教会完全接纳。诺瓦提安主张更严格的纪律与悔罪标准，因此形成分裂与“诺瓦提安主义（Novatianism）”。","在阅读教会史时，你可能会看到与其相关的人物与文献，如居普良（Cyprian of Carthage）及尤西比乌（Eusebius）的叙述（不同作者立场可能不同）。"]}
{"word":"novatianism","summary":{"en":"Novatianism is a 3rd‑century Christian movement known for strict views on church purity and refusing to readmit certain serious sinners.","zh":"诺瓦提安主义是3世纪的基督教运动，以强调教会纯洁与对某些重罪者不予重新接纳的严格立场著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian movement (3rd century) linked to Novatian that taught strict purity in the church and refused to readmit some serious sinners (especially those who denied the faith under persecution).","zh":"诺瓦提安主义（3世纪基督教运动），与诺瓦提安有关，主张教会必须保持严格纯洁，拒绝让某些重罪者（尤其是在迫害下否认信仰者）重新加入教会。"},"examples":[{"en":"Some historians describe Novatianism as a rigorist response to the question of whether the lapsed could return to the church.","zh":"一些历史学家把诺瓦提安主义描述为一种“严守主义”的回应，核心问题是那些“失足者”是否能回到教会。"},{"en":"In a survey of early Christianity, the teacher mentioned Novatianism alongside other early church controversies.","zh":"在一门早期基督教概论课上，老师把诺瓦提安主义与其他早期教会争议一起提到。"}]}],"synonyms":["Novatian movement","Novatian schism","Novatian rigorism"],"phonetic":"/noʊˈveɪʃənˌɪzəm/","extraExplanation":["“Novatianism”来自人名 Novatian（诺瓦提安，约公元3世纪）。他在罗马教会中因“失足者”（lapsi：在迫害中献祭或否认信仰的人）是否可以被赦免并恢复领圣餐而与主流立场冲突，最终形成分裂团体。","它常被概括为“严厉/严格的教会纪律”立场：强调教会成员的道德与信仰纯洁，反对过于宽松的赦免与接纳。","在英语学术写作中，这个词多用于教会史或宗教研究语境；一般口语中不常见。"]}
{"word":"novatianist","summary":{"en":"A Novatianist is a follower of Novatianism, an early strict Christian movement focused on purity and strict discipline about readmitting lapsed believers.","zh":"Novatianist 指诺瓦提安派的追随者；该派是早期基督教中强调“教会纯洁”与严格纪律、反对轻易接纳背教者回归的一支。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member or follower of Novatianism, a strict Christian movement in the early Church that opposed easily readmitting people who had denied their faith during persecution","zh":"诺瓦提安派（Novatianism）的成员/追随者；早期基督教中较为严厉的一支，反对轻易接纳在迫害中背弃信仰者重新回到教会"},"examples":[{"en":"Some historians describe the Novatianists as a strict group that emphasized moral purity.","zh":"一些历史学家把诺瓦提安派描述为强调道德纯洁的严厉群体。"},{"en":"In a debate about early Church discipline, a writer compared one position to the Novatianists’ stance on forgiveness.","zh":"在讨论早期教会纪律的争论中，有作者把某种立场比作诺瓦提安派对宽恕问题的态度。"}]}],"synonyms":["Novatian","follower of Novatianism"],"phonetic":"/noʊˈveɪʃəˌnɪst/","extraExplanation":["“Novatianist”源自3世纪罗马神职人员诺瓦提安（Novatian）。当时在罗马帝国迫害下，有人公开否认基督信仰以求生存；迫害结束后，这些人是否能被教会重新接纳成为争议焦点。诺瓦提安主义强调教会应保持“圣洁”，对严重背教者不应轻易恢复教会成员资格，因此常被视为纪律更严格的一派。","在学术或历史语境中，这个词多见于“早期教会史”“教会纪律”“异端/分裂运动”等主题。日常英语中很少使用。"]}
{"word":"novation","summary":{"en":"Novation is a legal replacement of an old contract or debt with a new one, usually with all parties’ consent.","zh":"Novation 指在法律上经各方同意，用新合同或新债务取代旧合同或旧债务的“更替”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of replacing an old contract or debt with a new one (often involving a new party), with everyone’s agreement","zh":"更替契约；债务更替（经各方同意，用新合同/新债务取代旧合同/旧债务，常涉及新增或更换当事人）"},"examples":[{"en":"The bank required a novation so the new company would take over the loan.","zh":"银行要求进行债务更替，让新公司接手这笔贷款。"},{"en":"After the merger, the suppliers signed a novation agreement to move the contract to the new legal entity.","zh":"并购后，供应商签了契约更替协议，把合同转到新的法人主体名下。"}]},{"partOfSpeech":"n.","definition":{"en":"the new contract or agreement that replaces the old one","zh":"替代旧合同的新合同（更替后的协议）"},"examples":[{"en":"The novation was executed on July 1, ending the original agreement.","zh":"该更替协议于7月1日生效，原协议随之终止。"}]}],"synonyms":["contract substitution","debt substitution","replacement agreement"],"phonetic":"/noʊˈveɪʃən/","extraExplanation":["“novation”主要用于法律/商业英语，日常口语里不常见。它的关键点是：旧合同（或旧债务）被“消灭”，由新合同取代，通常需要所有相关方明确同意。","别和“assignment（合同转让）”混淆：assignment通常只是把权利/义务转给他人，但原合同一般仍存在，原当事人有时仍可能承担责任；而novation是用新合同替换旧合同。","词源来自拉丁语 novus（新的）相关词根，和“innovate（创新）”同源，都带有“变新/更新”的含义。"]}
{"word":"novations","summary":{"en":"“Novations” is the plural of “novation”: a legal process where an old contract or obligation is replaced by a new one with everyone’s agreement.","zh":"“Novations”是“novation”的复数：指在各方同意下，用新的合同或义务取代旧的合同或义务的法律安排。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) the replacement of an old contract or obligation with a new one, usually by changing one of the parties or the terms, with everyone’s agreement","zh":"（法律）债务更替／合同更新：在各方同意下，用新的合同或义务替代旧的合同或义务，通常涉及更换当事人或变更条款"},"examples":[{"en":"The bank approved a novation, so the new buyer took over the loan from the original borrower.","zh":"银行批准了债务更替，因此新买方接手了原借款人的贷款。"},{"en":"Because all three parties agreed, the contract was ended and replaced through novation.","zh":"由于三方都同意，原合同被终止，并通过合同更新由新合同取代。"},{"en":"The company used novation to transfer its service obligations to a different provider.","zh":"公司通过合同更新把服务义务转移给了另一家供应商。"}]}],"synonyms":["contract substitution","contract replacement","debt substitution"],"phonetic":"/noʊˈveɪʃən/","extraExplanation":["“Novation”常见于英美合同法语境，关键点是“各方同意（consent）”以及“旧合同/义务被消灭（extinguished）并由新的取代”。","它不同于“assignment（权利转让）”：assignment 通常只转让权利或合同地位的一部分，原债务可能仍在；而 novation 通常意味着原当事人的义务被解除，由新当事人承担。","你输入的“novations”是复数形式，表示多次/多项合同更新或债务更替。常见搭配：contract novation（合同更新）、novation agreement（更替协议）。"]}
{"word":"novative","summary":{"en":"“Novative” is not standard; the correct word is “innovative,” meaning new and original in ideas or methods.","zh":"“novative”不标准；正确写法是“innovative”，意思是“创新的、采用新方法/新想法的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard) A misspelling of “innovative.”","zh":"（非标准）“innovative”的拼写错误。"},"examples":[{"en":"“Novative” is not a common English word; you probably mean “innovative.”","zh":"“novative”不是常见英文单词；你可能想写“innovative”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using new ideas, methods, or technology; introducing something new and helpful.","zh":"创新的；采用新想法/新方法/新技术的；有助于引入新事物的。"},"examples":[{"en":"The company is known for its innovative design.","zh":"这家公司以创新设计而闻名。"},{"en":"Teachers are trying innovative ways to help students learn English.","zh":"老师们正在尝试创新的方法来帮助学生学习英语。"},{"en":"We need an innovative solution to reduce waste.","zh":"我们需要一个创新的方案来减少浪费。"}]}],"synonyms":["innovative","creative","original","groundbreaking","cutting-edge"],"phonetic":"/ˈɪnəˌveɪtɪv/","extraExplanation":["“innovative”来自“innovate（创新）”，词根与拉丁语“nov-（新的）”有关，也常见于“novel（新颖的）”“novice（新手）”。","英语里常用“innovative”来形容“方式/方法/产品/想法”很新；如果形容“人”也可以，但更常见说“creative（有创意的）”“forward-thinking（有前瞻性的）”。"]}
{"word":"novator","summary":{"en":"Novator means an innovator—someone who brings in new ideas or changes (rare in modern English).","zh":"Novator 指“创新者/革新者”，即带来新想法或变革的人（现代英语中较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who introduces new ideas, methods, or changes; an innovator (rare).","zh":"提出新观点、方法或变革的人；创新者（较少用）。"},"examples":[{"en":"As a novator in online education, she redesigned classes to be more interactive.","zh":"作为在线教育领域的创新者，她重新设计课程，让课堂更具互动性。"},{"en":"The company hired a novator to modernize its outdated workflow.","zh":"公司聘请了一位创新者来让过时的工作流程现代化。"}]},{"partOfSpeech":"n.","definition":{"en":"In history or religion, a person seen as promoting new practices or doctrines, sometimes viewed negatively as a “reformer” or “disruptor.”","zh":"（历史/宗教语境）推动新做法或新教义的人，有时带贬义，类似“改革者/搅局者”。"},"examples":[{"en":"Some leaders labeled him a dangerous novator for challenging long-held traditions.","zh":"一些领导者把他称为危险的“革新者”，因为他挑战了长期存在的传统。"},{"en":"The book describes several novators who changed how people thought about science.","zh":"这本书描述了几位改变人们科学观念的革新者。"}]}],"synonyms":["innovator","pioneer","trailblazer","reformer","originator"],"phonetic":"/ˈnoʊveɪtər/","extraExplanation":["“novator”在现代英语里非常少见，更常用的是“innovator”。如果你是在写作或考试中使用，通常建议用“innovator”，读者更容易理解。","词源上与拉丁语“novus”（新的）有关，含义核心是“带来新的东西/新变化”。","常见搭配（用更常见的词）：an innovator in tech（科技领域的创新者）, a social innovator（社会创新者）。"]}
{"word":"novatory","summary":{"en":"Novatory means “innovative/new,” and in legal English it can mean “related to replacing an old contract with a new one.”","zh":"novatory 意为“创新的/引入新事物的”；在法律英语中也可指“与以新合同替代旧合同的更替（novation）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"introducing something new; innovative (rare in modern everyday English).","zh":"引入新事物的；创新的（现代日常英语中较少见）。"},"examples":[{"en":"The artist was praised for her novatory style, which mixed tradition with bold new ideas.","zh":"这位艺术家因其创新的风格而受到称赞——她把传统与大胆的新想法融合在一起。"},{"en":"The museum highlighted novatory works from young designers.","zh":"博物馆重点展示了年轻设计师的创新作品。"}]},{"partOfSpeech":"adj.","definition":{"en":"in law, relating to replacing an old contract or obligation with a new one (connected to “novation”).","zh":"（法律）与“债务/合同更替”有关的；指用新合同或新义务替代旧合同或旧义务（与 novation 相关）。"},"examples":[{"en":"They signed a novatory agreement to replace the original contract.","zh":"他们签署了一份更替协议来取代原合同。"},{"en":"The lawyer explained that a novatory clause could transfer responsibility to a new party.","zh":"律师解释说，更替条款可以把责任转移给新的当事方。"}]}],"synonyms":["innovative","novel","new","groundbreaking","reforming"],"phonetic":"/ˈnɑːvəˌtɔːri/","extraExplanation":["“novatory”源自拉丁语词根 nov-（“新的”），和 innovate（创新）、novel（新颖的）同源。","在现代英语里它比较少用；日常表达更常说 “innovative / new / groundbreaking”。但在法律语境中，它常与 “novation（合同/债务更替）”一起出现。"]}
{"word":"novatrix","summary":{"en":"A rare, formal word meaning a female innovator or reformer.","zh":"一个较少见、偏正式的词，意为“女性创新者/改革者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who introduces new ideas, methods, or changes; a female innovator or reformer (rare/learned word)","zh":"提出新点子、新方法或推动改变的女性；女性创新者/改革者（较少见、偏书面）"},"examples":[{"en":"In the article, she is praised as a novatrix who modernized the school system.","zh":"文章称赞她是一位推动学校体系现代化的女性改革者。"},{"en":"The museum highlighted several novatrices in science whose work changed everyday life.","zh":"博物馆重点介绍了几位改变日常生活的女性科学创新者。"}]}],"synonyms":["innovator","reformer","pioneer","trailblazer"],"phonetic":"/noʊˈveɪtrɪks/","extraExplanation":["这个词非常少见，多用于带有拉丁色彩的正式写作。更常见、自然的表达是 innovator（创新者）、reformer（改革者）、pioneer（先驱）。","词形来自拉丁语词根 nov-（“新的”），并带有 -trix 这个表示“女性施事者”的后缀（类似 aviatrix “女飞行员”、executrix “女遗嘱执行人”）。现代英语里 -trix 往往显得古雅或刻意，因此使用时要注意语域。"]}
{"word":"novcic","summary":{"en":"“novcic” is a non-English spelling of the South Slavic word “novčić,” meaning a small coin.","zh":"“novcic”通常是南斯拉夫语族词“novčić”的无变音符号拼写，意思是“小硬币”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small coin; the diminutive form of “novac” (“money”) in Croatian/Serbian/Bosnian, often written with the proper spelling “novčić.” (Not a standard English word.)","zh":"小硬币；在克罗地亚语/塞尔维亚语/波斯尼亚语中是“novac（钱）”的指小形式，常见正确拼写为“novčić”。（不是标准英语词。）"},"examples":[{"en":"I found a novčić in my pocket after the trip to Croatia.","zh":"去克罗地亚旅行后，我在口袋里发现了一枚小硬币（novčić）。"},{"en":"He kept a few novčići for the vending machine.","zh":"他留了几枚小硬币（novčići）用来投自动售货机。"}]}],"synonyms":["coin","small change","loose change"],"phonetic":"/ˈnoʊv.tʃɪtʃ/","extraExplanation":["“novcic”很可能是把带变音符号的“novčić”用英文键盘打出来的简化写法：č 常被写成 c。日常交流里这种替代很常见，但在正式写作（如语言学习、引用原文）建议用正确的 č。","在克罗地亚语里，单数是 novčić，复数常见为 novčići。英语写作中如果直接借用外来词，有时会保留原复数形式，也有人加英语复数 -s（不太规范但可见）。"]}
{"word":"noveboracensis","summary":{"en":"A Latin adjective used in scientific names meaning “of/from New York.”","zh":"一个用于学名的拉丁形容词，意思是“纽约的/来自纽约的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in scientific names) from or associated with New York (especially New York State).","zh":"（拉丁语，常用于生物学/地质学等学名中）来自纽约的；与纽约（尤指纽约州）有关的。"},"examples":[{"en":"The species name *noveboracensis* indicates that the organism was first identified in New York.","zh":"种加词 *noveboracensis* 表示这种生物最初在纽约被鉴定/发现。"},{"en":"In taxonomy, *noveboracensis* is an epithet meaning “of New York.”","zh":"在分类学中，*noveboracensis* 是一个表示“纽约的”的种加词。"}]}],"synonyms":["New York–","neoyorkinus (less common, Latinized variant)"],"phonetic":"/ˌnoʊviˌbɔr.əˈsɛn.sɪs/","extraExplanation":["“noveboracensis”常见于拉丁化的学名（双名法）里，属于“种加词/亚种加词”，用来指示产地、发现地或与某地相关。","词源上可理解为来自拉丁语“Nova Eboracum”（纽约的拉丁名）+ 形容词后缀“-ensis”（表示“来自……的”），整体就是“来自纽约的”。","在英文写作中它通常以斜体出现（如 *Xxx noveboracensis*），并且只在学术/科普语境中使用，日常英语里很少单独当作普通词汇使用。"]}
{"word":"novel","summary":{"en":"“Novel” most commonly means a long fictional book, and it can also mean something new and original.","zh":"“novel”最常指“小说”，也可作形容词表示“新颖的、创新的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long written story (usually fiction) with characters and a plot; a book-length narrative","zh":"（通常指虚构的）长篇故事；小说；以人物与情节为主的书籍叙事作品"},"examples":[{"en":"She’s reading a novel about a family during the Great Depression.","zh":"她正在读一本关于大萧条时期一个家庭的小说。"},{"en":"Many famous novels have been turned into movies.","zh":"许多著名小说都被改编成了电影。"}]},{"partOfSpeech":"adj.","definition":{"en":"new, original, or unusual; not previously known or used","zh":"新颖的；新奇的；前所未有的；不同寻常的"},"examples":[{"en":"The scientist proposed a novel way to treat the disease.","zh":"这位科学家提出了一种治疗这种疾病的新方法。"},{"en":"It’s a novel idea, but we need to test it carefully.","zh":"这是个新点子，但我们需要谨慎测试。"}]}],"synonyms":["book (for the noun sense)","fiction (for the noun sense)","new (for the adjective sense)","innovative (for the adjective sense)","original (for the adjective sense)"],"phonetic":"/ˈnɑvəl/","extraExplanation":["“novel”作名词时是“小说”；作形容词时是“新颖的”。学习时可用搭配区分：read/write a novel（读/写小说）；a novel method/approach/idea（新方法/新思路/新想法）。","词源上来自拉丁语“novus”（新的），所以形容词义与“new”相关。名词义（小说）也与“新型的叙事体裁”有关。","常见文学用法：小说通常包含人物（characters）、情节（plot）、主题（theme）和叙述视角（point of view）。例如：a coming-of-age novel（成长小说）、a historical novel（历史小说）。"]}
{"word":"novela","summary":{"en":"Novela is most commonly used in English to mean a Spanish-language TV soap opera; it can also mean “novel” when referring to Spanish works.","zh":"Novela 在英语中多指西语肥皂剧/连续剧；也可在提到西语作品时表示“小说”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish-language TV soap opera or melodramatic series (often used in the U.S. to refer to Latin American serial dramas).","zh":"（在英语中常用）西班牙语的肥皂剧/连续剧（常指拉丁美洲的电视剧，剧情多较戏剧化）。"},"examples":[{"en":"My grandma watches a novela every evening after dinner.","zh":"我奶奶每天晚饭后都会看一部西语肥皂剧。"},{"en":"The novela’s plot is full of secrets, twins, and sudden betrayals.","zh":"这部连续剧的剧情充满秘密、双胞胎和突然的背叛。"}]},{"partOfSpeech":"n.","definition":{"en":"in Spanish, a “novel”; in English writing, it may appear when referring to a Spanish title or a work in Spanish.","zh":"（西班牙语）“小说”；在英文中多用于提到西语作品或书名时。"},"examples":[{"en":"She wrote her first novela in Spanish before translating it into English.","zh":"她先用西班牙语写了第一部小说，之后再翻译成英文。"}]}],"synonyms":["telenovela","soap opera","serial drama"],"phonetic":"/noʊˈvɛlə/","extraExplanation":["在英语里更常见的近形词是 **novella**（中篇小说），拼写不同：novella 指英文文学体裁；**novela** 多指西语肥皂剧，或在讨论西语文学时借用来表示“小说”。","文化语境上，novela（常见于 *telenovela*）通常是集数有限的连续剧，剧情节奏快、反转多，和一些可能播很多季的英文 soap opera 有所不同。"]}
{"word":"novelant","summary":{"en":"“Novelant” is not standard English; it’s usually a misspelling of “novel” or “novelist.”","zh":"“novelant”不是标准英语词，通常是“novel”或“novelist”的误拼/误用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard / very rare) Not a common English word; most often a misspelling or mistaken form. People usually mean “novel” (new; a book-length story) or “novelist” (a person who writes novels).","zh":"（非标准/非常罕见）这不是常见的英语单词；多数情况下是拼写错误或误用。人们通常想表达的是“novel”（新颖的；小说）或“novelist”（小说家）。"},"examples":[{"en":"I couldn’t find “novelant” in a standard dictionary—did you mean “novel” or “novelist”?","zh":"我在常见词典里找不到“novelant”——你是想写“novel”还是“novelist”？"},{"en":"She is a famous novelist. (Not: “novelant”)","zh":"她是一位著名的小说家。（不要写成“novelant”）"},{"en":"That’s a novel idea.","zh":"那是个新颖的想法。"}]}],"phonetic":"/ˈnɑvələnt/","extraExplanation":["“novel-”来自拉丁语 novus，意思是“新的”。英语里常见的相关词：novel（小说/新颖的）、novelist（小说家）、novelty（新奇；新奇事物）、innovation（创新）。","如果你是在读文学/历史文本时看到“novelant”，也可能是非常少见的专名、拼写变体，或OCR（扫描识别）错误。可以把原句发出来，我可以帮你判断。"]}
{"word":"novelcraft","summary":{"en":"Novelcraft means the skill and techniques involved in writing a novel.","zh":"Novelcraft 指写小说所需的技巧与方法（小说创作的技艺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or skill of writing novels, including planning, character-building, plot, style, and revision","zh":"小说创作的技艺；写小说的综合能力（如构思、人物塑造、情节、文风与修改）"},"examples":[{"en":"She studies novelcraft by outlining each chapter before she writes.","zh":"她通过先列出每章大纲来学习小说创作的技艺。"},{"en":"Good novelcraft makes even a simple story feel alive.","zh":"好的小说写作功力能让简单的故事也变得鲜活。"}]}],"synonyms":["the craft of novel writing","novel-writing craft","fiction writing craft","storycraft"],"phonetic":"/ˈnɑvəlˌkræft/","extraExplanation":["“novelcraft”不是最常见的标准词，更像是由“novel（小说）+ craft（技艺）”组合出来的用法，常见于写作课程、写作社群或书名/专栏标题，用来强调“写小说是一门手艺”。","更常见、也更正式的表达包括：“the craft of novel writing”“novel-writing craft”“fiction writing craft”。","在文学讨论中，“craft”常指可训练、可打磨的技巧（如叙述视角、节奏、对白、意象与修订），不只是“灵感”。"]}
{"word":"noveldom","summary":{"en":"“Noveldom” is a (rare) noun meaning the realm of novels/novelists or novels as a whole.","zh":"“noveldom”是一个较少见的名词，指小说界（小说家与小说圈子）或小说作品的总称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The world or community of novels and novelists (similar to “showbiz” or “moviedom”).","zh":"小说界；小说家与小说相关的圈子（类似“演艺圈”“电影界”）。"},"examples":[{"en":"In noveldom, a debut can attract huge attention if the reviews are strong.","zh":"在小说界，如果书评很强势，新人出道也可能引起巨大关注。"},{"en":"She was well known in noveldom for her sharp dialogue and vivid characters.","zh":"她在小说界以犀利的对白和生动的人物塑造而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"Novels collectively; the body of works that make up the novel tradition.","zh":"（总称）小说作品；构成小说传统的一系列作品。"},"examples":[{"en":"He explored noveldom from 19th-century classics to modern thrillers.","zh":"他研究的小说作品从19世纪经典一直到现代惊悚小说。"},{"en":"Certain themes repeat across noveldom, like love, power, and ambition.","zh":"一些主题在小说作品中反复出现，比如爱情、权力和野心。"}]}],"synonyms":["the world of fiction","the literary world (novels)","novel-writing circles"],"phonetic":"/ˈnɑvəlˌdɑm/","extraExplanation":["“noveldom”相对少见，多用于评论、文化随笔或出版业语境，带一点“圈内/领域”的味道。","后缀“-dom”常表示“领域、状态或群体”，如“kingdom（王国）”“freedom（自由）”“fandom（粉丝圈）”。因此“noveldom”可以理解为“小说这一领域/圈子”。","如果你想表达“新奇感/新颖性”，更常用的词是“novelty”。"]}
{"word":"novelese","summary":{"en":"“Novelese” means a novel-like style of language, often sounding artificial or overly dramatic.","zh":"“novelese”指带“小说腔/小说味”的语言，常含不自然或过于戏剧化的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Language or writing style that sounds like it belongs in a novel—often slightly artificial, overly dramatic, or “story-like” compared with normal everyday speech.","zh":"带有“小说味”的语言或文风——常指有点不自然、过于戏剧化、比日常口语更像叙事文本的表达。"},"examples":[{"en":"Her dialogue felt like novelese; real people don’t talk in such long speeches.","zh":"她的对话写得很“小说腔”；真实的人不会那样长篇大论地说话。"},{"en":"The article slips into novelese when it tries to make the CEO sound heroic.","zh":"这篇文章为了把 CEO 写得很英雄，写着写着就变成了“小说式语言”。"}]}],"synonyms":["purple prose","flowery language","melodramatic writing","literary-sounding prose"],"phonetic":"/ˌnɑːvəˈliːz/","extraExplanation":["“novelese”由 novel（小说）+ -ese 构成。英语里 -ese 常用来表示“某种群体/领域特有的语言或文体”，例如 legalese（法律行话，常含贬义）、journalese（新闻腔）。因此 novelese 往往也带一点调侃或批评：写得像小说，但不够自然或不够贴近日常。","它多用于写作评论、编辑反馈或媒体评论中，提醒作者避免把叙述性、夸张的书面表达硬塞进需要真实感的对话或纪实写作里。"]}
{"word":"novelesque","summary":{"en":"Novelesque means “like a novel,” with dramatic events and vivid details.","zh":"novelesque 指“小说般的”，强调戏剧性、细节丰富、引人入胜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a story, situation, or description) like a novel—dramatic, detailed, and full of interesting events or characters.","zh":"（故事、情境或描写）像小说一样的；富有戏剧性、细节丰富、情节曲折或人物生动的。"},"examples":[{"en":"Her travel diary is almost novelesque, full of colorful strangers and unexpected twists.","zh":"她的旅行日记几乎像小说一样，充满形形色色的陌生人和出人意料的转折。"},{"en":"The case had a novelesque quality: secret letters, hidden money, and a sudden disappearance.","zh":"这起案件带着小说般的气质：秘密信件、藏起来的钱，以及突然的失踪。"}]}],"synonyms":["novelistic","dramatic","storylike","picturesque"],"phonetic":"/ˌnɑːvəˈlɛsk/","extraExplanation":["“novelesque”来自“novel（小说）+ -esque（……风格的/像……一样的）”。-esque 常见于形容词，表示“具有某种风格或气质”，如 picturesque（如画的）、Kafkaesque（卡夫卡式的）。","它通常带有“引人入胜、戏剧化、像情节片一样”的褒义或中性色彩；若要强调“不真实/过于夸张”，可改用 melodramatic（过于煽情的）或 far-fetched（牵强的）。"]}
{"word":"novelet","summary":{"en":"A short novel; longer than a short story but shorter than a novel (often spelled “novelette”).","zh":"中篇小说；比短篇长、比长篇短（常写作“novelette”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short novel; a story longer than a short story but shorter than a full-length novel (often called a “novelette”).","zh":"中篇小说；篇幅介于短篇小说与长篇小说之间的故事（也常写作 novelette）。"},"examples":[{"en":"The book is a novelet, so you can finish it in one or two evenings.","zh":"这本书是一部中篇小说，所以你一两个晚上就能读完。"},{"en":"She prefers novelets because they develop characters more than short stories do.","zh":"她更喜欢中篇小说，因为它们比短篇更能展开人物刻画。"},{"en":"The magazine publishes short stories and the occasional novelet.","zh":"这本杂志刊登短篇小说，偶尔也刊登中篇小说。"}]}],"synonyms":["novelette","short novel","novella (sometimes, but usually longer)"],"phonetic":"ˌnɑvəˈlɛt","extraExplanation":["“novelet”在英文里不如“novelette”常见，很多词典与出版界更偏好用“novelette”。两者意思基本相同。","写作与出版语境中，novelette通常指比短篇（short story）更长、但比中篇/长篇（novella/novel）更短的作品；不过不同机构对字数范围的划分不完全一致。"]}
{"word":"noveletist","summary":{"en":"A rare word meaning a writer of novelettes (short novels/long short stories).","zh":"较少见的词，指写“novelette（中篇/短长篇小说）”的作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a writer of novelettes (short novels or long short stories); a person who writes in a short-novel form","zh":"中篇小说（或介于短篇与长篇之间的小说）作者；写“novelette（中篇/短长篇）”的人"},"examples":[{"en":"In the early 1900s, many magazine noveletists wrote fast-paced adventure stories.","zh":"在20世纪初，许多杂志上的中篇小说作者会写节奏很快的冒险故事。"},{"en":"She began as a noveletist before publishing her first full-length novel.","zh":"她在出版第一部长篇小说之前，最初是一位中篇小说作者。"}]}],"synonyms":["novelettist","novelist","fiction writer","short-story writer"],"phonetic":"/ˌnɑvəˈlɛtɪst/","extraExplanation":["“noveletist”在现代英语里非常少见，更常见的拼写是“novelettist”。在日常交流中，人们通常直接说“novelist（小说家）”或“short-story writer（短篇小说作者）”。","“novelette”常指比短篇更长、但又明显短于长篇的故事形式，过去在杂志连载或通俗读物中更常见，因此“noveletist”也带有一点历史/出版语境的味道。"]}
{"word":"novelette","summary":{"en":"A novelette is a short novel, sometimes used to criticize a story as light or sentimental.","zh":"novelette 指“中篇/短篇小说”（短于长篇、长于短篇），有时带贬义，暗示作品偏轻薄或煽情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short novel—longer than a short story but shorter and usually simpler than a full-length novel.","zh":"中篇小说；短篇长于短篇小说、但短于（通常也更简洁于）长篇小说的小说体裁。"},"examples":[{"en":"She published a romantic novelette in a weekly magazine.","zh":"她在周刊杂志上发表了一部浪漫题材的中篇小说。"},{"en":"The author’s novelette can be read in one sitting.","zh":"这位作者的中篇小说一口气就能读完。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often with a critical tone) A light, sentimental, or less serious short novel.","zh":"（常带贬义）轻飘、伤感煽情或不够严肃的中篇小说/短小说。"},"examples":[{"en":"Some critics dismissed the book as a mere novelette.","zh":"一些评论家把这本书贬为不过是一部“矫情的小中篇”。"},{"en":"He preferred serious fiction and avoided what he called ‘novelettes.’","zh":"他偏好严肃文学，避开他所谓的“轻薄中篇”。"}]}],"synonyms":["short novel","novella","short fiction"],"phonetic":"/ˌnɑvəˈlɛt/","extraExplanation":["“novelette”由“novel（小说）+ -ette（表示小/短的后缀）”构成，因此字面含义就是“较小/较短的小说”。","在英语出版语境里，它有时也用来指介于短篇与长篇之间的“中等篇幅”作品；在一些科幻/奇幻奖项或写作圈里，会按字数把它和 novella（中篇小说）区分开，但日常用法中二者常被混用。","在文学评论中，novelette 偶尔带轻微贬义，暗示作品篇幅不大且内容偏通俗、煽情或“分量不够”；是否带贬义取决于语境。"]}
{"word":"noveletter","summary":{"en":"A novelette is a short novel—longer than a short story and shorter than a typical novel.","zh":"novelette 指短篇小说：比短篇更长、比长篇小说更短的小说作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short novel; a piece of fiction longer than a short story but shorter than a full-length novel (often similar in length to a novella).","zh":"（篇幅较短的）短篇小说；介于短篇小说与长篇小说之间的虚构作品（常与“中篇小说/novella”接近）。"},"examples":[{"en":"She published a novelette in a literary magazine.","zh":"她在文学杂志上发表了一篇短篇小说（novelette）。"},{"en":"The novelette is too long for a short-story contest but too short for a novel award.","zh":"这篇作品对短篇比赛来说太长，对长篇小说奖来说又太短。"}]}],"synonyms":["novella","short novel","short fiction"],"phonetic":"/ˌnɑvəˈlɛt/","extraExplanation":["“novelette”来自“novel（小说）+ -ette（表示“小的”后缀）”，语气上常带一点“轻巧/不太宏大”的感觉，有时也可能带轻微贬义（暗示不够严肃或深刻），具体取决于语境。","常见拼写是 “novelette”。你写的 “noveletter” 更像是拼写错误；如果你想表达“写小说的人”，通常说 “novelist（小说家）”。"]}
{"word":"novelettes","summary":{"en":"“Novelettes” means short novels (plural).","zh":"“novelettes”指“中篇（较短的）小说”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “novelette”: a short novel—usually longer than a short story but shorter than a full-length novel.","zh":"“novelette”的复数：中篇（较短的）小说——通常比短篇小说长，但比长篇小说短。"},"examples":[{"en":"The author’s early career was filled with magazine-published novelettes.","zh":"这位作者的早期生涯里，有许多发表在杂志上的中篇短小说。"},{"en":"I enjoy reading mystery novelettes on the train because I can finish them in one or two rides.","zh":"我喜欢在通勤火车上读推理中篇短小说，因为一两趟就能读完。"},{"en":"The collection includes three novels and five novelettes.","zh":"这套选集中包含三部长篇小说和五篇中篇短小说。"}]}],"synonyms":["short novels","novellas (sometimes)","long short stories (informal)"],"phonetic":"/ˌnɑvəˈlɛt/","extraExplanation":["“novelette”常用来指长度介于短篇小说（short story）与长篇小说（novel）之间的作品。有时也被当作比“novella（中篇小说）”更短一档的称呼，但不同出版社/奖项对字数界线不完全一致。","该词在英语里常出现在文学期刊、选集目录、出版分类或书评中；日常口语里更常说“a short novel”或直接说“a novella”。"]}
{"word":"novelettish","summary":{"en":"“Novelettish” means having the style of a light, often sentimental short novel, sometimes implying it feels a bit cheesy or formulaic.","zh":"“novelettish”指带有通俗中篇小说的文风与气质，常暗示略显矫情、俗套或缺乏深度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the style, tone, or qualities of a novelette (a short, often light or sentimental novel); like popular fiction in a slightly negative way.","zh":"带有“中篇通俗小说（novelette）”风格的；像通俗小说那样（常含轻微贬义：显得矫情、套路化或缺乏深度）。"},"examples":[{"en":"The dialogue felt a bit novelettish, full of dramatic declarations.","zh":"这段对话有点“通俗小说味”，充满夸张的宣言。"},{"en":"Her memories were written in a warm but slightly novelettish style.","zh":"她的回忆写得温暖，但文风略显通俗小说化。"},{"en":"Critics called the ending novelettish because it tied everything up too neatly.","zh":"评论家说结局很“通俗小说式”，因为把一切都收得过于圆满。"}]}],"synonyms":["sentimental","melodramatic","soap-operatic","romance-novel-like","formulaic"],"phonetic":"/ˌnɑvəˈlɛtɪʃ/","extraExplanation":["“novelettish”来自“novelette（中篇/小长篇小说）+ -ish”。后缀“-ish”常表示“有点……的、带……风格的”，有时带轻微的“不够严肃/不够高级”的评价色彩（如 child-ish）。","在文学评论里，它常用来批评某段文字“像通俗小说/言情小故事”，强调情节或情感表达过于套路化、煽情或不够深刻。"]}
{"word":"novelettist","summary":{"en":"A writer of novelettes (short novels/long short stories).","zh":"写中篇小说（或较长短篇小说）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes novelettes (short novels or long short stories).","zh":"中篇小说（或较长短篇小说）作者。"},"examples":[{"en":"She began her career as a novelettist, publishing light romances in magazines.","zh":"她以中篇小说作者的身份起步，在杂志上发表轻松的浪漫故事。"},{"en":"The critic praised him as a skilled novelettist with a talent for quick pacing.","zh":"评论家称赞他是一位技艺娴熟的中篇小说作者，节奏把握很强。"}]}],"synonyms":["novelist","short-story writer","fiction writer"],"phonetic":"/ˌnɑvəˈlɛtɪst/","extraExplanation":["“novelettist”来自“novelette（中篇/小长篇小说）+ -ist（从事……的人）”。在现代英语里不算常用，更常见的说法是“novelist（小说家）”或“short-story writer（短篇小说作家）”。","“novelette”通常指长度介于短篇小说与长篇小说之间的故事；在不同出版体系里界限不完全一致，所以“novelettist”也带有一定历史/出版语境色彩。"]}
{"word":"noveletty","summary":{"en":"A novelette is a short novel—longer than a short story but shorter than a typical novel; it can also mean a light, entertainment-focused short novel.","zh":"novelette 指“中篇小说”，篇幅介于短篇与长篇之间；也可指偏通俗、以娱乐为主的短篇小说（有时略贬）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short novel; a story longer than a short story but usually shorter than a novella or full-length novel","zh":"中篇小说（比短篇长，但通常比中长篇/长篇小说短）"},"examples":[{"en":"She wrote a novelette for a magazine and later expanded it into a novel.","zh":"她为杂志写了一篇中篇小说，后来把它扩写成了长篇小说。"},{"en":"The collection includes two short stories and one science-fiction novelette.","zh":"这本选集中有两篇短篇小说和一篇科幻中篇小说。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes, slightly negative) a light or sentimental short novel, often written mainly for easy entertainment","zh":"（有时略带贬义）通俗、感伤的短篇小说，主要为了轻松娱乐而写"},"examples":[{"en":"Some critics dismissed the book as a romance novelette rather than serious literature.","zh":"一些评论家把这本书贬为通俗言情中篇，而非严肃文学。"}]}],"synonyms":["short novel","novella (sometimes)"],"phonetic":"/ˌnɑvəˈlɛt/","extraExplanation":["你输入的“noveletty”常见为拼写错误，标准拼法是 **novelette**。","novelette 和 novella 的界限并不严格，更多是出版界/体裁习惯：一般理解为 **short story < novelette < novella < novel**；科幻、奇幻等类型文学里也常用“novelette”来标注篇幅。"]}
{"word":"novelisation","summary":{"en":"Novelisation means adapting a story into a novel, or the novel produced from that adaptation.","zh":"novelisation 指把故事改写成小说的过程，或指改写后的小说本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of turning a film, TV series, game, or other story into a novel (a book version), often by expanding scenes and adding inner thoughts","zh":"把电影、电视剧、游戏等故事改写成小说（书本版本）的过程，常会扩写情节并加入人物内心描写"},"examples":[{"en":"The studio approved the novelisation of the movie to promote the release.","zh":"片方批准把这部电影做成小说版来配合上映宣传。"},{"en":"Novelisation often adds background details that weren’t in the original script.","zh":"小说改编版常会加入原剧本里没有的背景细节。"}]},{"partOfSpeech":"n.","definition":{"en":"a novel (the book) that is written as an adaptation of a film, TV show, game, or similar work","zh":"由电影、电视剧、游戏等作品改写而成的小说（书本本身）"},"examples":[{"en":"I read the novelisation after watching the series.","zh":"看完那部剧后，我又读了它的小说改编版。"},{"en":"The novelisation includes scenes that were cut from the final film.","zh":"这本小说改编版收录了一些在电影成片中被剪掉的情节。"}]}],"synonyms":["novelization","adaptation","tie-in novel"],"phonetic":"ˌnɑvələˈzeɪʃən","extraExplanation":["“novelisation”是英式拼写；美式更常见的是“novelization”。在流行文化中，这类书常被称为“tie-in novel（联动小说/电影联名小说）”，常见于大片、科幻系列或电子游戏周边。"]}
{"word":"novelise","summary":{"en":"“Novelise” means to adapt a story into a novel, or to make a retelling more like a novel.","zh":"“novelise”指把故事改写成小说，或把叙述写得更像小说。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to write a novel based on something else (such as a film, TV series, game, real事件, or another book); to adapt a story into novel form","zh":"把（电影/电视剧/游戏/真实事件等）改写成小说；以小说形式改编故事"},"examples":[{"en":"The studio hired a writer to novelise the movie so fans could read the story.","zh":"片方请了一位作家把这部电影改写成小说，让粉丝可以阅读这个故事。"},{"en":"She novelised the true case, changing some names for privacy.","zh":"她把这起真实案件小说化，为了隐私更改了一些名字。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something more like a novel by adding narrative details, characters’ thoughts, or dramatic structure","zh":"使（叙述/材料）更“小说化”；加入叙事细节、人物心理或戏剧结构"},"examples":[{"en":"The article was criticised for novelising the event instead of sticking to the facts.","zh":"这篇文章因把事件写得太“小说化”、没有紧扣事实而受到批评。"},{"en":"He tried not to novelise his memories when telling the story.","zh":"他讲述时尽量不把回忆讲得过于小说化。"}]}],"synonyms":["novelize","adapt","fictionalize"],"phonetic":"/ˈnɑːvəˌlaɪz/","extraExplanation":["“novelise”是英式拼写；美式更常写作“novelize”。两者意思相同，发音也基本一致。","常见搭配：novelise a film/series/game（把电影/剧集/游戏改编成小说）；be novelised（被改编成小说）。在新闻或纪实语境里，novelise 有时带一点批评意味，指“为了好看而夸张、戏剧化”。"]}
{"word":"novelised","summary":{"en":"“Novelised” means adapted into a novel (British spelling of “novelized”).","zh":"“novelised”指“被改写成小说/小说化”（英式拼写，相当于美式“novelized”）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of “novelise”) to turn a story—often a film, TV show, game, or real event—into a novel.","zh":"（“novelise”的过去式/过去分词）把故事（常见于电影、电视剧、游戏或真实事件）改写成小说。"},"examples":[{"en":"The movie was later novelised to include extra scenes and backstory.","zh":"这部电影后来被改写成小说，加入了额外的场景和背景故事。"},{"en":"The studio hired a writer to novelise the popular TV series.","zh":"制片方请了一位作家把这部热门电视剧改写成小说。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something that has been adapted into a novel form.","zh":"形容“已被改写成小说形式的”。"},"examples":[{"en":"I read the novelised version after watching the film.","zh":"看完电影后，我读了它的小说改写版。"},{"en":"The novelised script gives more detail about the characters’ thoughts.","zh":"小说化的版本更详细地写出了人物的内心想法。"}]}],"synonyms":["novelized","adapted into a novel","fictionalized"],"phonetic":"/ˈnɑvəlˌaɪzd/","extraExplanation":["“novelised”多见于英式拼写；美式更常写作“novelized”。两者意思相同。","在出版行业里，“novelisation/novelization”常指把影视或游戏IP改编成小说，以补充剧情、心理描写或世界观细节。"]}
{"word":"novelises","summary":{"en":"“Novelises” means “turns something into a novel” (UK spelling of “novelizes”).","zh":"“novelises”指“把某内容改写成小说/写成小说版”，是英式拼写，对应美式“novelizes”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn a story, film, play, or real events into a novel; to write a novel version of something","zh":"把故事、电影、戏剧或真实事件改写成小说；将某内容写成小说版本"},"examples":[{"en":"The studio hired a writer to novelize the movie script.","zh":"制片方雇了一位作家把电影剧本改写成小说。"},{"en":"She novelized her grandfather’s wartime letters into a family saga.","zh":"她把祖父的战时书信小说化，写成了一部家族传奇。"}]},{"partOfSpeech":"vt.","definition":{"en":"to write in a style that is like a novel, adding narrative details and scenes","zh":"以小说式的方式来写；加入叙事细节与场景，使内容更像小说"},"examples":[{"en":"Some historians avoid novelizing the past because it can blur fact and fiction.","zh":"一些历史学家避免把过去“小说化”，因为这可能模糊事实与虚构的界线。"}]}],"synonyms":["adapt into a novel","fictionalize","dramatize","retell"],"phonetic":"/ˈnɑvəˌlaɪz/","extraExplanation":["“novelises”是英式拼写（-ise），相当于美式的“novelizes”（-ize）。两者意思相同；在美国写作中更常见-ize，在英国、澳洲等地区更常见-ise。","常见搭配：novelize a film/script/play（把电影/剧本/戏剧改写成小说）；a novelization of a movie（电影小说版）。在书店里常见“movie novelization（电影小说）”这一类型。"]}
{"word":"novelish","summary":{"en":"“Novelish” means somewhat like a novel—story-like or a bit fictional; less commonly, somewhat new or unusual.","zh":"“novelish”指“有点小说风/有点小说化、带故事感”；较少见时也可指“有点新奇”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat like a novel in style—having a story-like, fictional, or richly descriptive feel (often said of writing, a film, or an experience).","zh":"带点“小说风”的；在风格上有些像小说——有故事感、虚构感或描写丰富（常用于形容文字、电影或经历）。"},"examples":[{"en":"Her travel blog feels novelish, with vivid characters and a clear plot.","zh":"她的旅行博客很有小说感，有鲜明的人物和清晰的情节。"},{"en":"The documentary sometimes turns novelish, focusing more on drama than facts.","zh":"这部纪录片有时会变得有些小说化，更强调戏剧性而不是事实。"}]},{"partOfSpeech":"adj.","definition":{"en":"New or unusual; a bit “novel” or fresh (less common).","zh":"新奇的；有点新鲜感（较不常见）。"},"examples":[{"en":"It was a novelish idea, but it didn’t work in practice.","zh":"这个点子挺新奇的，但在实际中行不通。"}]}],"synonyms":["novel-like","story-like","fictionalized","narrative","dramatic"],"phonetic":"/ˈnɑvəlɪʃ/","extraExplanation":["“novelish”= novel（小说/新奇的）+ -ish（“有点……、略微……”）。-ish 通常表示不完全、带一点某种特征，语气更随意，有时也带轻微的评价（比如“有点像，但不够纯/不够严谨”）。","这个词不算非常常用，更常见的表达有：novel-like（像小说的）、fictionalized（被小说化的）、story-like（有故事感的）。"]}
{"word":"novelising","summary":{"en":"“Novelising” means turning an existing story into a novel (British spelling of “novelizing”).","zh":"“novelising”指把已有故事改写成小说（“novelizing”的英式拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of writing a novel based on an existing story (such as a film, TV series, video game, or comic); also the process of turning something into a novel","zh":"将已有故事（如电影、电视剧、游戏、漫画等）改写成小说的行为；也指把某个内容“小说化”的过程"},"examples":[{"en":"The novelising of the movie added background scenes that weren’t in the film.","zh":"这部电影的小说改写加入了影片里没有的背景情节。"},{"en":"She was hired to do the novelising for a popular video game.","zh":"她受聘为一款热门游戏做小说改写。"}]},{"partOfSpeech":"v.","definition":{"en":"writing a novel version of an existing story; converting something into a novel (often used as a gerund)","zh":"把已有故事写成小说版本；将内容改写成小说（常作动名词用法）"},"examples":[{"en":"He’s novelising the TV series episode by episode.","zh":"他正在按集把这部电视剧改写成小说。"},{"en":"Novelising a screenplay can be tricky because you must show thoughts, not just actions.","zh":"把剧本小说化很有难度，因为你要呈现人物内心，而不只是动作。"}]}],"synonyms":["novelizing","novelization","adaptation (into a novel)","tie-in novel"],"phonetic":"/ˈnɑvəlˌaɪzɪŋ/","extraExplanation":["“novelising”是英式拼写，更常见的美式拼写是“novelizing”。两者意思相同。","行业里常说“a tie-in novel / tie-in novelization”（联动/改编小说），指为配合影视/游戏发行而推出的小说版本。"]}
{"word":"novelism","summary":{"en":"Novelism most often means a tendency to pursue novelty; more rarely, it can refer to a focus on the novel as a literary form.","zh":"Novelism 通常指追求新奇的倾向；较少情况下也可指文学上对小说体裁（或小说化手法）的侧重。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tendency to seek or introduce what is new; an interest in novelty (often suggesting change for its own sake).","zh":"追求新奇的倾向；喜欢标新立异（常带有“为新而新”的意味）。"},"examples":[{"en":"Some people criticize the design for its novelism, saying it changes things without improving them.","zh":"有人批评这个设计太追求新奇，说它只是为了改变而改变，并没有变得更好。"},{"en":"The director’s novelism divided audiences: some loved the fresh style, others felt it was distracting.","zh":"导演的标新立异让观众意见分歧：有人喜欢新鲜风格，有人觉得喧宾夺主。"}]},{"partOfSpeech":"n.","definition":{"en":"in literary discussion, a focus on the novel as a form, or the use of novel-like techniques (less common).","zh":"（文学讨论中）对“小说”这种体裁的侧重，或采用类似小说的写作手法（较少见）。"},"examples":[{"en":"In that essay, the author defends modern novelism and argues that fiction can reveal social truth.","zh":"在那篇文章里，作者为现代“小说取向”辩护，认为虚构也能揭示社会真实。"}]}],"synonyms":["novelty-seeking","innovation (context-dependent)","experimentalism (context-dependent)"],"phonetic":"/ˈnɑvəlˌɪzəm/","extraExplanation":["“novelism”不算常用词，更常见的表达是“novelty（新奇）”“innovation（创新）”或“a taste for novelty（喜欢新鲜事物）”。","词形上是 novel（新的；小说）+ -ism（主义/倾向）。根据语境，它既可能指“求新”，也可能在文学语境里与“小说写法/小说化”相关。使用时最好给出上下文以避免歧义。"]}
{"word":"novelist","summary":{"en":"A novelist is a writer who creates novels—long works of fiction.","zh":"novelist 指“小说家”，专门创作小说（长篇虚构作品）的作家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes novels (long fictional stories).","zh":"小说家；长篇虚构故事（小说）的作者。"},"examples":[{"en":"She dreams of becoming a novelist someday.","zh":"她梦想有一天成为一名小说家。"},{"en":"The novelist described the city so vividly that it felt real.","zh":"这位小说家把城市描写得非常生动，让人感觉像真的一样。"}]}],"synonyms":["fiction writer","novel writer"],"phonetic":"/ˈnɑːvəlɪst/","extraExplanation":["词源小贴士：novelist 来自 novel（小说）+ -ist（表示“从事某种职业/活动的人”）。因此 novelist 字面意思就是“写小说的人”。","用法辨析：novelist 通常指以写“小说（fiction）”为主的作者；更宽泛的 author 可以写任何类型的书（小说、非虚构、教材等）。"]}
{"word":"novelistic","summary":{"en":"Novelistic means “like a novel in style” or “related to novel writing,” often describing rich, story-driven narration.","zh":"Novelistic 指“具有小说式叙事风格”或“与小说创作有关”，常形容细节丰富、故事性强的写法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Written in a style like a novel, especially with rich storytelling details, characters, and scenes.","zh":"（文风）像小说的；具有小说叙事特点的，尤其强调人物、情节与场景细节。"},"examples":[{"en":"Her memoir is novelistic, with vivid scenes and dialogue.","zh":"她的回忆录很有小说感，场景和对话都很生动。"},{"en":"The report takes a novelistic approach, turning real events into a flowing story.","zh":"这份报道采用了小说式写法，把真实事件写成了连贯的故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to novels or to the art and techniques of novel writing.","zh":"与小说有关的；关于小说创作（技巧/艺术）的。"},"examples":[{"en":"The course introduces novelistic techniques like point of view and pacing.","zh":"这门课介绍了视角、节奏等小说写作技巧。"},{"en":"Critics praised the film’s novelistic structure.","zh":"影评人称赞这部电影具有小说式结构。"}]}],"synonyms":["novel-like","narrative","story-driven","fictional-style","literary"],"phonetic":"/ˌnɑːvəˈlɪstɪk/","extraExplanation":["词源上来自“novel（小说）+ -istic（……风格/特点的）”。因此它常用来形容非小说体裁（如纪实文学、传记、新闻写作、电影）“像小说一样”重视叙事性与细节。","语感区别：novelistic 更强调“叙事方式像小说”，而 fictional 强调“内容是虚构的”。一篇纪实作品可以很 novelistic，但不一定 fictional。"]}
{"word":"novelistically","summary":{"en":"“Novelistically” means “in a novelist’s (novel-like) style,” often describing vivid, scene-based storytelling.","zh":"“novelistically”意为“以小说家/小说般的风格”，常用来形容生动、场景化的叙事方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that resembles the style, techniques, or storytelling of a novelist (like a novel).","zh":"以小说家的风格；用类似小说的叙事手法（像小说一样）。"},"examples":[{"en":"The journalist wrote the profile novelistically, opening with a dramatic scene instead of a list of facts.","zh":"这位记者以小说化的方式写人物特写，用戏剧性的场景开头，而不是罗列事实。"},{"en":"She described the city novelistically, turning ordinary streets into vivid settings.","zh":"她用小说式的笔法描写这座城市，把普通街道写成了生动的场景。"}]}],"synonyms":["novelistically","in a novelistic way","in a novel-like style","narratively"],"phonetic":"ˌnɑvəlˈɪstɪkli","extraExplanation":["“novelistically”在现实英语中比较少见，更常用的表达是“in a novelistic way / in a novel-like style / novelistically”。它通常用来评价写作：强调叙事性强、画面感强、人物与情节更像小说，而不只是客观陈述。","词形结构：novel（小说）→ novelist（小说家）→ novelistic（小说式的）→ novelistically（以小说式地）。如果你在写作或学术评论里使用，会显得更正式、更“文学评论”口吻。"]}
{"word":"novelists","summary":{"en":"“Novelists” means writers of novels (plural).","zh":"“novelists”指“小说家们/写小说的人”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who write novels (long fictional stories); plural of “novelist.”","zh":"小说家；写小说的人（“novelist”的复数）。"},"examples":[{"en":"Many famous novelists began their careers as journalists.","zh":"许多著名小说家最初都是从记者做起的。"},{"en":"The festival invited novelists from around the world to give talks.","zh":"这个节日邀请了来自世界各地的小说家来演讲。"},{"en":"Young novelists often struggle to find a publisher.","zh":"年轻的小说家常常很难找到出版社。"}]}],"synonyms":["fiction writers","authors","writers"],"phonetic":"/ˈnɑvəlɪsts/","extraExplanation":["“novelist”由“novel（小说）+ -ist（从事某种职业/活动的人）”构成，所以“novelists”就是“写小说的人们”。","注意：单数是 novelist（小说家），复数是 novelists。"]}
{"word":"novelivelle","summary":{"en":"A novella is a short novel—longer than a short story, shorter than a novel.","zh":"novella 指“中篇小说”，比短篇长、比长篇短。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short novel (longer than a short story but shorter than a full-length novel), usually focused on a single main plot and a small cast of characters.","zh":"中篇小说；介于短篇小说与长篇小说之间的小说，通常情节更集中、人物较少。"},"examples":[{"en":"I read the novella in one sitting because it was short and intense.","zh":"我一口气读完了那部中篇小说，因为它篇幅不长但很紧凑。"},{"en":"Her latest work is a novella about a family moving to a new country.","zh":"她的新作是一部关于一家人移居他国的中篇小说。"}]}],"synonyms":["short novel","novelette"],"phonetic":"/noʊˈvɛlə/","extraExplanation":["你输入的“novelivelle”看起来不是标准英文单词，最接近的常见词是 **novella**（中篇小说）。另一个相近词是法语借词 **nouvelle**，在英语里有时也指“短篇/中篇小说”，但日常英语写作更常用 **novella**。","**novella** 源自意大利语 *novella*，原意与“new（新的）”相关，后来在文学里固定为“篇幅较短的小说”这一体裁。"]}
{"word":"novelization","summary":{"en":"A novelization is a novel written from an existing movie/TV/game story, or the process of making such a novel.","zh":"novelization 指把电影/剧集/游戏等故事改写成小说的作品或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book (novel) written based on a movie, TV show, game, or other story; the process of turning that story into a novel","zh":"（根据电影、电视剧、游戏等改写成的）小说；把原故事改写成小说的过程"},"examples":[{"en":"I read the novelization of the film because it included extra scenes.","zh":"我读了那部电影的小说版，因为里面加入了一些额外的场景。"},{"en":"The studio hired a writer to do the novelization before the movie came out.","zh":"电影上映前，制片方请了一位作家来写小说改编版。"}]},{"partOfSpeech":"n.","definition":{"en":"the practice or industry of producing these tie-in novels","zh":"制作这类“配套小说/衍生小说”的做法或行业"},"examples":[{"en":"In the 1980s, novelization was a common way to promote big movies.","zh":"在20世纪80年代，把电影改写成小说是一种常见的宣传方式。"}]}],"synonyms":["tie-in novel","media tie-in (book)","adaptation (to a novel)"],"phonetic":"/ˌnɑvəlaɪˈzeɪʃən/","extraExplanation":["“novelization”常见于娱乐产业语境，属于“tie-in”（配套/联动）出版的一种：电影/剧集上映时同步推出书籍，扩大受众并延长热度。","和“adaptation（改编）”相比，novelization通常强调“从影视/游戏 → 写成小说”，而不是泛指任何形式之间的改编。","读novelization时常会看到更多“内心独白、背景设定、删减情节”，因为小说能补充镜头之外的信息。"]}
{"word":"novelizations","summary":{"en":"“Novelizations” are books that turn existing movies/TV/games into novels, often adding extra detail; it’s the plural of “novelization.”","zh":"“novelizations”指把电影/电视剧/游戏等改写成小说的书，常会补充更多细节；是“novelization”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Books (or book-length stories) written from an existing movie, TV series, video game, or other media—often expanding scenes, characters, or background. This is the plural form of “novelization.”","zh":"把电影、电视剧、游戏等已有作品改写成小说（常会补充情节、人物与背景）的书；为“novelization”的复数。"},"examples":[{"en":"The studio released three novelizations of the film, one for each main character’s point of view.","zh":"片方推出了这部电影的三本小说改编版，每一本都用不同主角的视角来写。"},{"en":"I collect Star Wars novelizations because they include extra scenes not shown on screen.","zh":"我收集《星球大战》的电影小说改编版，因为里面有一些电影里没出现的额外情节。"},{"en":"Some novelizations are written quickly to match a movie’s release date.","zh":"有些电影小说改编版为了赶上电影上映，会写得很赶。"}]}],"synonyms":["tie-in novels","movie novelizations","adaptations (general)"],"phonetic":"/ˌnɑvələˈzeɪʃən/","extraExplanation":["“novelization”常见于影视“周边/衍生”出版：电影上映前后推出同名小说，既能补足世界观，也是一种商业推广。","与“adaptation（改编）”相比，novelization更具体：强调“从影像/其他媒介→写成小说”。有时会依据剧本初稿写作，所以可能出现与最终电影不同的情节。"]}
{"word":"novelize","summary":{"en":"“Novelize” means to write a novel version of a story or event, often adapting a film, TV show, or game into a book.","zh":"“novelize”指把某个故事或事件写成小说，常用于把电影、电视剧或游戏改写成书。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn a story, event, film, game, or real experience into a novel (a long work of fiction); to write a novel version of something","zh":"把故事、事件、电影、游戏或真实经历改写成小说；将某物写成小说版本"},"examples":[{"en":"The studio hired a writer to novelize the movie so fans could read the story.","zh":"制片方雇了一位作家把电影小说化，让粉丝可以读到这个故事。"},{"en":"She novelized her travel experiences, changing names and adding dialogue.","zh":"她把自己的旅行经历小说化，改了名字并加入对话。"},{"en":"The game was later novelized into a series for young readers.","zh":"这款游戏后来被小说化，出了给青少年读的一套系列小说。"}]}],"synonyms":["adapt","fictionalize","dramatize","recast"],"phonetic":"/ˈnɑːvəˌlaɪz/","extraExplanation":["“novelize”在英语里常见于出版与娱乐产业语境，尤其是电影/电视剧/游戏推出后配套出版的“电影小说”“游戏小说”（tie-in novel）。这种写作通常会补充角色内心、背景设定与未呈现的情节，但也可能为了阅读体验而改动细节。","词形来自“novel（小说）+ -ize（使成为…）”。与之相关的常用表达有“a novelization（小说改编版）”“tie-in novel（联动/周边小说）”。"]}
{"word":"novelized","summary":{"en":"“Novelized” means adapted into a novel (or the past form of “novelize”).","zh":"“novelized”表示“被改编成小说的/小说化的”，也可作动词“novelize”的过去式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a film, TV series, game, or true story) adapted or written as a novel; turned into the form of a novel.","zh":"（电影、电视剧、游戏或真实故事等）被改编成小说的；小说化的。"},"examples":[{"en":"The movie was later novelized, adding scenes that weren’t in the script.","zh":"这部电影后来被改编成小说，加入了一些剧本里没有的情节。"},{"en":"I prefer the novelized version because it explains the characters’ thoughts.","zh":"我更喜欢小说版，因为它更能解释角色的内心想法。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past / past participle of “novelize”: to adapt something into a novel or write it in novel form.","zh":"“novelize”的过去式/过去分词：把某作品改写成小说；使小说化。"},"examples":[{"en":"A popular writer novelized the TV series for younger readers.","zh":"一位畅销作家把这部电视剧改写成适合青少年阅读的小说。"},{"en":"The story has been novelized and translated into several languages.","zh":"这个故事已经被小说化，并翻译成多种语言。"}]}],"synonyms":["adapted into a novel","novelization (n.)","tie-in novel (related term)"],"phonetic":"/ˈnɑvəˌlaɪzd/","extraExplanation":["“novelized/novelised”常见于出版与影视行业：电影或剧集上映后，再推出“小说版”（tie-in novel / novelization），有时会补充背景、心理描写或删减情节的细节。","拼写上，美式常用 novelized，英式常见 novelised。注意它不是“novel（新颖的/小说）”本身，而是“被改编成小说的”。"]}
{"word":"novelizes","summary":{"en":"“Novelizes” means “turns something into a novel” (or less commonly, “writes in a novel-like way”).","zh":"“novelizes”表示“把某内容改写成小说”（较少见：以小说化方式叙述）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to turn a story, script, film, or real events into a novel (third-person singular present: “novelizes”)","zh":"把故事、剧本、电影或真实事件改写成小说（第三人称单数现在时：novelizes）"},"examples":[{"en":"She novelizes the screenplay so readers can enjoy the story in book form.","zh":"她把电影剧本改写成小说，让读者能以书本形式享受这个故事。"},{"en":"A writer novelizes the TV series, adding characters’ thoughts and background details.","zh":"作家把电视剧改写成小说，加入人物的内心想法和背景细节。"}]},{"partOfSpeech":"v.","definition":{"en":"to write in the style of a novel, often by adding narrative details (less common)","zh":"以小说的方式来写（较少见），常指加入叙事细节使内容更像小说"},"examples":[{"en":"The journalist sometimes novelizes events, which can blur the line between fact and fiction.","zh":"这位记者有时会把事件写得像小说，这可能会模糊事实与虚构的界线。"}]}],"synonyms":["adapts (into a novel)","turns into a novel","fictionalizes (sometimes, depending on context)","dramatizes (not identical, but related)"],"phonetic":"ˈnɑvəˌlaɪzɪz","extraExplanation":["“novelize”常用于影视或游戏的“小说化”（a novelization）。它通常不只是照搬情节，还会补充人物心理、旁白与未拍出来的细节。","拼写上美式英语更常见 -ize（novelize），英式英语也可能见到 -ise（novelise）；两者意思相同。"]}
{"word":"novelizing","summary":{"en":"“Novelizing” means adapting a movie/series/game or story into a novel, or the act of doing that.","zh":"“novelizing”指把电影/剧集/游戏或某个故事改编成小说，或指这种改编的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or act of turning a film, TV show, game, or real event into a novel (a prose story)","zh":"把电影、电视剧、游戏或真实事件改编成小说（散文叙事）的过程；小说化"},"examples":[{"en":"The studio hired a writer for the novelizing of the movie so fans could read the story.","zh":"制片方请了一位作者把这部电影小说化，好让粉丝能读到故事。"},{"en":"Novelizing a game can add inner thoughts and details that aren’t shown on screen.","zh":"把游戏小说化可以加入人物的内心独白和屏幕上看不到的细节。"}]},{"partOfSpeech":"v.","definition":{"en":"making something into a novel; adapting a story into novel form (present participle of “novelize”)","zh":"把某事写成小说；将故事改编成小说形式（“novelize”的现在分词）"},"examples":[{"en":"She is novelizing the TV series for young readers.","zh":"她正在把这部电视剧改写成适合青少年读者的小说。"},{"en":"The author spent months novelizing the screenplay into a full-length book.","zh":"作者花了几个月把剧本小说化，写成一本长篇书。"}]}],"synonyms":["adapting","fictionalizing","retelling","novelization"],"phonetic":"/ˈnɑvəˌlaɪzɪŋ/","extraExplanation":["“novelizing / novelization（小说化/小说改编）”在英语出版业里很常见，尤其是把热门电影或剧集改写成书（常见于科幻、奇幻、动作片等）。这种书通常会补充人物心理、背景设定和删减情节，但也可能为了配合上映/播出档期而写得比较快。"]}
{"word":"novella","summary":{"en":"A novella is a short novel—longer than a short story but shorter and more focused than a full novel.","zh":"Novella 指“中篇小说”，篇幅介于短篇与长篇之间，通常更紧凑、更集中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short novel: a fictional story longer than a short story but shorter than a full-length novel","zh":"中篇小说：长度介于短篇小说和长篇小说之间的虚构故事"},"examples":[{"en":"We read a novella in class because it was short enough to finish in a week.","zh":"我们在课上读了一部中篇小说，因为它够短，可以在一周内读完。"},{"en":"Her novella focuses on one character and a single important event.","zh":"她的中篇小说聚焦于一个人物和一件重要事件。"}]}],"synonyms":["short novel","novelette"],"phonetic":"/noʊˈvɛlə/","extraExplanation":["“novella”来自意大利语，原意与“新故事/短故事”有关。在英语文学中它通常指篇幅适中、情节更集中、人物相对较少的叙事作品，常常比短篇更有发展空间，但又不像长篇那样包含大量支线。","常见经典例子包括：George Orwell 的《Animal Farm》（常被称为 novella）以及 John Steinbeck 的《Of Mice and Men》。不同出版社或课程对长度的界定可能略有差异。"]}
{"word":"novellae","summary":{"en":"“Novellae” is the plural of “novella” (short novels), and can also refer to Justinian’s later “new laws” in Roman legal history.","zh":"“Novellae”是“novella（中篇小说）”的复数；在罗马法史语境中也可指查士丁尼时期后续颁布的“新律/新法令”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of novella: a short novel (longer than a short story, shorter than a full-length novel).","zh":"novella（中篇小说）的复数：篇幅介于短篇小说与长篇小说之间的故事作品。"},"examples":[{"en":"The author published three novellae in the same year.","zh":"这位作者在同一年出版了三部中篇小说。"},{"en":"We read a set of Italian novellae in our literature class.","zh":"我们在文学课上读了一组意大利中篇小说。"}]},{"partOfSpeech":"n.","definition":{"en":"(History/Law) The “Novellae”: later new laws or decrees added to an existing legal code, especially the Novellae Constitutiones of Emperor Justinian.","zh":"（历史/法律）“Novellae”：指在既有法典之后补充发布的新法令，尤指查士丁尼皇帝《新律》（Novellae Constitutiones）。"},"examples":[{"en":"The Novellae were issued after Justinian’s main legal compilations.","zh":"《新律》是在查士丁尼主要法典汇编之后颁布的。"},{"en":"Scholars compare the Novellae with earlier Roman legal texts.","zh":"学者会把《新律》与更早的罗马法律文本进行对比。"}]}],"synonyms":["novellas","short novels","(law) decrees","(law) enactments"],"phonetic":"/noʊˈvɛleɪ/","extraExplanation":["“Novellae”是拉丁语风格的复数形式（对应单数“novella”），在英语里更常见、更口语的复数是“novellas”。在学术写作或讨论古典/法律文献时更可能看到“novellae”。","词源上，novella来自意大利语/拉丁语，含“新的（new）”之意；在罗马法语境中，Novellae指“新颁布的法令/新法”。"]}
{"word":"novellas","summary":{"en":"“Novellas” means short novels (plural), longer than short stories but shorter than novels.","zh":"“novellas”是“中篇小说”的复数：比短篇长、比长篇短的叙事作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “novella”: short fiction that is longer than a short story but shorter than a novel, usually focused on one main plot.","zh":"“novella”的复数：中篇小说；篇幅介于短篇小说与长篇小说之间，通常围绕一条主要情节展开。"},"examples":[{"en":"The class read two novellas instead of one long novel.","zh":"这门课读了两部中篇小说，而不是一部长篇小说。"},{"en":"Her novellas often center on a single family conflict.","zh":"她的中篇小说常常围绕一个家庭矛盾展开。"}]}],"synonyms":["short novels","short fiction","novelettes (sometimes, but usually shorter)"],"phonetic":"/noʊˈvɛlə/","extraExplanation":["“Novella”来自意大利语，原意与“news/新鲜事”相关，后来逐渐指一种独立的叙事作品体裁。","在英语语境里，novella通常强调“篇幅适中 + 情节集中 + 人物不太多”。很多出版社或奖项会用字数范围区分：一般比短篇长，但明显短于常规长篇。"]}
{"word":"novelle","summary":{"en":"Novelle is a foreign-term variant of “novella,” meaning a short novel-length story.","zh":"Novelle 是“novella（中篇小说）”的外来词变体，指介于短篇与长篇之间的故事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Loanword; used mainly in German/Italian contexts) a short fictional narrative—longer than a short story but shorter than a full-length novel; essentially a “novella.”","zh":"（外来词；多见于德语/意大利语语境）中篇小说：介于短篇小说与长篇小说之间的虚构叙事作品；基本相当于英语的“novella（中篇小说）”。"},"examples":[{"en":"In German literature classes, you may read a Novelle (novelle) by Goethe.","zh":"在德语文学课上，你可能会读到歌德的一篇Novelle（novelle，中篇小说）。"},{"en":"The anthology includes several novelle that focus on a single dramatic event.","zh":"这本选集中收录了几篇novelle，主题都集中在一个戏剧性的事件上。"}]}],"synonyms":["novella","short novel","novelette"],"phonetic":"/noʊˈvɛlə/","extraExplanation":["在英语里更常用的词是 **novella**（中篇小说）。**novelle** 往往是从德语 **Novelle** 或意大利语复数 **novelle**（单数 *novella*）借来的写法，出现在讨论欧洲文学、作品分类或原文引用时。","文学上“中篇小说/Novelle”常强调结构紧凑、围绕一个核心冲突或关键事件展开；德语传统里常被视为具有“单一情节、象征性强”的叙事体裁。"]}
{"word":"novelless","summary":{"en":"“Novelless” is not standard English. You probably mean “novel-less” (without a novel) or “novelty” (newness/originality).","zh":"“novelless”不是规范英语。你可能想写“novel-less”（没有小说的）或“novelty”（新颖性/新鲜感）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) The state of not having a novel; “without a novel.” (Usually written as “novel-less,” and rarely used.)","zh":"（非标准用法）没有小说的状态；“没有小说/缺少小说”。（通常写作“novel-less”，很少使用。）"},"examples":[{"en":"The bookstore’s history section felt novel-less compared with the fiction floor.","zh":"和小说楼层相比，那家书店的历史区感觉几乎“没有小说”。"},{"en":"During the renovation, the library was temporarily novel-less.","zh":"装修期间，图书馆暂时处于“没有小说”的状态。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) The quality of being new, original, or unusual; freshness.","zh":"（更可能是你想写的词）新颖性；新鲜感；独特之处。"},"examples":[{"en":"The novelty of the new app wore off after a week.","zh":"新应用的新鲜感一周后就消退了。"},{"en":"Her poem has a sense of novelty, even though it uses a classic form.","zh":"她的诗虽然使用了经典形式，但仍有一种新颖感。"},{"en":"Teachers try to add novelty to lessons to keep students engaged.","zh":"老师会给课程加入新意来保持学生的投入。"}]}],"synonyms":["novel-less","without novels","novelty","newness","originality"],"phonetic":"/ˈnɑvəlti/","extraExplanation":["“novelless”在英语里并不是常见或规范的拼写；如果你想表达“缺少小说的/没有小说的”，更自然的写法是“novel-less”（带连字符），例如：a novel-less shelf（没有小说的书架）。","如果你想表达“新颖性/新鲜感”，最常用的词是“novelty”（不是novelless/novelness）。日常英语里“novelness”也不如“novelty”常见。"]}
{"word":"novellike","summary":{"en":"Novellike means “like a novel,” especially in a detailed, narrative, character-driven way.","zh":"Novellike 指“像小说一样”，尤指叙事性强、细节丰富、人物推动的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a novel in style or structure—often meaning long, detailed, character-focused, and told with a narrative flow.","zh":"像小说一样的；具有小说风格或结构的——常指篇幅较长、细节丰富、以人物为中心、叙事性强。"},"examples":[{"en":"The biography is surprisingly novellike, with vivid scenes and dialogue.","zh":"这本传记出人意料地很“小说化”，有生动的场景和对话。"},{"en":"Her report reads in a novellike way, pulling you through the story.","zh":"她的报告读起来很有小说的感觉，让人一路被故事带着走。"},{"en":"The film has a novellike structure, following the characters over many years.","zh":"这部电影的结构很像小说，追随人物跨越多年。"}]}],"synonyms":["novelistic","storylike","narrative","fiction-like","literary"],"phonetic":"/ˈnɑvəlˌlaɪk/","extraExplanation":["“novellike”也常写作“novel-like”（更常见、更清晰）。作定语时放在名词前：a novel-like narrative；作表语时放在系动词后：The writing is novel-like。","语感上，“novellike”通常强调“叙事/文学性强”，不一定表示“虚构”；如果想强调“像小说一样不真实/夸张”，更常用“hard to believe”“too dramatic”“sounds like a novel”等表达。"]}
{"word":"novellus","summary":{"en":"*Novellus* is a rare Latin-derived word meaning “somewhat new/recent,” sometimes also used for “a newcomer” in Latin phrases.","zh":"*Novellus* 是罕见的拉丁语借词，意为“较新的/最近的”，也可在拉丁语短语中指“新来者/新人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in English writing) somewhat new; recent; fresh.","zh":"（拉丁语词，英语学术/法律写作中偶见）较新的；最近的；新鲜的。"},"examples":[{"en":"In some legal Latin notes, a *novellus* rule means a newly introduced rule.","zh":"在一些法律拉丁语注释里，*novellus* rule 指“新近引入的规则”。"},{"en":"The commentator describes the argument as *novellus*, meaning it is relatively new.","zh":"注释者把这个论点称为 *novellus*，意思是它相对较新。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, Latin phrase use) a newcomer or “new man,” especially in the expression *novellus homo*.","zh":"（罕见，多见于拉丁语短语）新来者；“新人”，尤用于短语 *novellus homo*。"},"examples":[{"en":"The text contrasts the established leaders with a *novellus homo* seeking influence.","zh":"文章把既有领袖与一个寻求影响力的 *novellus homo*（新人）作对比。"}]}],"synonyms":["novel","new","recent","fresh","newly introduced"],"phonetic":"/noʊˈvɛləs/","extraExplanation":["*Novellus* 来自拉丁语 *novus*（新的）的指小/派生形式，语气上可理解为“较新、刚出现的”。它并不是现代英语常用词，更多出现在学术论文、古典学、历史或法律语境中，常以斜体保留拉丁语形式。","在罗马法与拜占庭史里，你可能会遇到与“新法令”相关的词，如 *Novellae*（查士丁尼法典后续的新敕令/新法规）。虽然形式不同，但都与“新的（nov-）”这一词根有关。"]}
{"word":"novelly","summary":{"en":"“Novelly” means “in a novel/unusual way,” but it is rare; most people say “in a novel way.”","zh":"“Novelly”表示“以新颖/不寻常的方式”，但很少用；更常见说法是“in a novel way”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a novel or unusual way; with a sense of newness (rare in modern English).","zh":"以新颖/不寻常的方式；带着新鲜感（现代英语中较少用）。"},"examples":[{"en":"The artist arranged everyday objects novelly to surprise the audience.","zh":"艺术家用新颖的方式摆放日常物品，让观众感到惊喜。"},{"en":"She tried to explain the idea novelly, using a simple story.","zh":"她尝试用新颖的方法解释这个想法，用了一个简单的故事。"}]}],"synonyms":["in a novel way","unusually","creatively","in an original way"],"phonetic":"/ˈnɑvəli/","extraExplanation":["“novelly”这个词非常少见，写作和口语里更常用的表达是“in a novel way / in an unusual way / creatively”。","很多学习者把“novelly”误写成“novelty（新奇；新颖的事物）”。如果你想表达“新奇感/新鲜感”，通常用名词“novelty”；如果想表达“以新颖方式”，多用短语“in a novel way”。"]}
{"word":"novelmongering","summary":{"en":"Novelmongering is a usually disapproving word for commercially or sensationally pushing novels, or (more rarely) spreading dramatic made-up stories like gossip.","zh":"novelmongering 通常带贬义，指以商业化或耸动方式兜售/炮制小说；较少见时也可指像八卦一样散布戏剧化的编造故事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often disapproving) The activity of writing, publishing, selling, or promoting novels, especially in a way seen as commercial, shallow, or sensational.","zh":"（常含贬义）写作、出版、贩卖或推广小说的行为，尤指被认为过度商业化、肤浅或耸动的做法。"},"examples":[{"en":"Some critics dismissed the book as mere novelmongering rather than serious literature.","zh":"一些评论家把这本书贬为不过是“小说贩卖式”的作品，而非严肃文学。"},{"en":"He made money through novelmongering, quickly producing popular stories for the market.","zh":"他靠“批量写畅销故事”的方式赚钱，迅速为市场生产通俗小说。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The spreading of invented or exaggerated stories for attention—similar to rumormongering, but focused on dramatic ‘novel-like’ tales.","zh":"（罕见）为了吸引注意而散布编造或夸大的故事——类似“散布谣言”，但更强调“像小说一样戏剧化”的传闻。"},"examples":[{"en":"Her coworkers got tired of the constant novelmongering in the office.","zh":"同事们对办公室里不断的“编故事式八卦”感到厌烦。"},{"en":"The article was accused of novelmongering because it added dramatic details without evidence.","zh":"那篇文章被指责是在“编小说”，因为它在没有证据的情况下添加了戏剧化细节。"}]}],"synonyms":["sensationalism","hack writing","pulp fiction writing","peddling","rumormongering"],"phonetic":"/ˈnɑvəlˌmʌŋɡərɪŋ/","extraExplanation":["“novelmongering”由“novel（小说）+ mongering（兜售/散播）”构成。“-monger”常带贬义，表示为了利益或影响而兜售、鼓动或散播某物（如 fishmonger 卖鱼的人是中性，但 warmonger 战争贩子、rumormonger 谣言散布者多为负面）。因此该词在批评语境里更常见。","这是一个较少见的词，更常用的相关表达包括：peddling novels（兜售小说）、churning out novels（粗制滥造地大量写小说）、sensational storytelling（耸动叙事）、rumormongering（散布谣言）。"]}
{"word":"novelness","summary":{"en":"“Novelness” means the feeling or quality of being new or unusual; it’s understandable but uncommon—“novelty” is more standard.","zh":"“Novelness”表示“新奇/新颖（感）”，能理解但不常用；更标准的说法是“novelty”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being new, unusual, or interesting because it has not been seen or experienced before (more commonly expressed as “novelty”).","zh":"新奇；新颖；新鲜感（更常用的表达是“novelty”）。"},"examples":[{"en":"The novelty of the new app wore off after a week.","zh":"这款新应用的新鲜感一周后就消失了。"},{"en":"Tourists enjoy the novelness of local customs, but it’s important to be respectful.","zh":"游客会享受当地风俗的新奇感，但尊重很重要。"},{"en":"The author’s style had a sense of novelness that surprised many readers.","zh":"这位作者的风格有一种新颖感，让很多读者感到惊喜。"}]}],"synonyms":["novelty","newness","originality","freshness"],"phonetic":"/ˈnɑv(ə)lnəs/","extraExplanation":["“novelness”在现代英语里不太常见，母语者更常用“novelty”来表达“新奇/新颖”。“novelness”通常会被理解，但在正式写作中建议改用“novelty”。","注意不要和“novel（小说）”混淆：形容词 novel 表示“新颖的”，名词 novel 表示“小说”。“novelness”来自形容词 novel + -ness（把形容词变成名词）。"]}
{"word":"novelry","summary":{"en":"Novelry means novelty items—small fun, unusual products; it can rarely mean novelty itself.","zh":"Novelry 指“新奇小商品/小玩意儿”；少见情况下也可指“新奇感（新颖性）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"novelty items; small unusual or humorous products bought mainly for fun (often inexpensive).","zh":"新奇小玩意儿；主要为了好玩而买的稀奇、搞笑的小商品（常较便宜）。"},"examples":[{"en":"The gift shop sells novelry like funny mugs and keychains.","zh":"这家礼品店卖一些新奇小物，比如搞笑的杯子和钥匙扣。"},{"en":"He bought a piece of novelry as a joke gift for his friend.","zh":"他买了一个新奇小玩意当作送朋友的玩笑礼物。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being new or unusual; novelty (rare use).","zh":"新奇感；新颖性（较少见用法）。"},"examples":[{"en":"The novelry of the idea wore off after a week.","zh":"这个点子的新鲜感过了一周就消退了。"}]}],"synonyms":["novelty","novelty items","trinkets","gimmicks","souvenirs"],"phonetic":"/ˈnɑvəlri/","extraExplanation":["“novelry”在现代英语里比较少见，更常用的是“novelty”（新奇感；新奇小商品）或“novelty items”。如果你在购物语境里想表达“新奇小玩意儿”，用“novelty items / novelty gifts”会更自然。","词形上可理解为“novel（新奇的）+ -ry（表示集合/类别）”，因此常指“一类新奇物品的集合”。"]}
{"word":"novels","summary":{"en":"“Novels” is the plural of “novel,” meaning long fictional books; “novel” can also mean “new and unusual.”","zh":"novels 是 novel 的复数，指长篇虚构作品（小说）；novel 也可作形容词，意为“新颖的、新奇的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long written story (fiction), usually told in chapters, with characters and a plot","zh":"（长篇）小说：通常按章节写成的虚构故事，有人物与情节"},"examples":[{"en":"She’s reading a novel about a family living through war.","zh":"她正在读一本关于一个家庭经历战争的小说。"},{"en":"This novel has a surprising ending.","zh":"这本小说的结局很出人意料。"},{"en":"Many classic novels were first published in newspapers or magazines.","zh":"许多经典小说最初是在报纸或杂志上连载出版的。"}]},{"partOfSpeech":"adj.","definition":{"en":"new and unusual; different from what is common (often used in phrases like “a novel idea”)","zh":"新颖的；新奇的（常见于短语“a novel idea”等）"},"examples":[{"en":"They tried a novel approach to teaching English.","zh":"他们尝试了一种新颖的英语教学方法。"},{"en":"It’s a novel solution, but it might work.","zh":"这是个新奇的解决办法，但可能有效。"}]}],"synonyms":["fiction","book","story (general)","a novel idea (phrase: new idea)"],"phonetic":"/ˈnɑvəl/","extraExplanation":["你输入的是复数形式 novels（小说们/多部小说）。单数是 novel。英语里 novel 既可以作名词“小说”，也可以作形容词“新颖的”。学习时要根据句子结构判断：a novel（一本小说/一个新颖的……） vs. novels（多部小说）。","与“小说”相关的常见搭配：write a novel（写小说）、a best-selling novel（畅销小说）、a historical/science-fiction/romance novel（历史/科幻/言情小说）。"]}
{"word":"novelties","summary":{"en":"Novelties are (1) small new/interesting items often sold as souvenirs or gifts, or (2) the feeling/quality of newness.","zh":"novelties可指（1）新奇小商品/纪念品，（2）新鲜感、新颖性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"New and unusual things, especially small items that are fun, interesting, or bought as souvenirs or gifts.","zh":"新奇的小东西；新奇玩意儿（常指有趣的小商品、纪念品或礼物）"},"examples":[{"en":"The shop sells keychains, magnets, and other novelties for tourists.","zh":"那家店卖钥匙扣、冰箱贴和其他给游客的纪念小玩意儿。"},{"en":"She filled the goodie bags with candy and cheap novelties.","zh":"她在伴手礼袋里装了糖果和一些便宜的小玩意儿。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being new, different, or not seen before; newness.","zh":"新颖性；新鲜感（事物“新”的特质）"},"examples":[{"en":"The novelty of living alone wore off after a few weeks.","zh":"一个人生活的新鲜感过了几周就消退了。"},{"en":"At first, the app was exciting because of its novelty.","zh":"一开始这个应用因为新颖而让人兴奋。"}]}],"synonyms":["trinkets","souvenirs","gimmicks","curios","newness"],"phonetic":"/ˈnɑvəltiz/","extraExplanation":["“novelties”是“novelty”的复数。第一义更常见，指商店里卖的“新奇小商品/纪念品”；第二义偏抽象，指“新鲜感”。","常见搭配：tourist novelties（旅游纪念小物）、novelty shop（新奇礼品店/搞笑礼品店）、the novelty wore off（新鲜感消退）。","注意不要和“novel（小说/新颖的）”混淆：它们有词源关系，但“novelties”通常不指“小说”。"]}
{"word":"novelty","summary":{"en":"“Novelty” most often means the quality of being new and interesting, and it can also mean a fun, unusual small item bought as a gift or souvenir.","zh":"“Novelty”最常指“新颖/新鲜感”，也可指“新奇小物（趣味礼品或纪念品）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something new, unusual, or interesting; the quality of being new and different.","zh":"新奇事物；新颖感（新鲜、不同寻常、引人兴趣的特质）。"},"examples":[{"en":"The novelty of living in a new city wore off after a few weeks.","zh":"在新城市生活的新鲜感过了几周就消失了。"},{"en":"The app’s novelty attracted users at first, but it needed real value to keep them.","zh":"这款应用一开始靠新奇吸引用户，但要留住人还得有真正的价值。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, unusual item, often bought as a fun gift or souvenir.","zh":"（常作复数）新奇小物；稀奇玩意儿（常作为趣味礼物或纪念品购买）。"},"examples":[{"en":"The shop sells novelty mugs shaped like animals.","zh":"这家店卖做成动物造型的新奇马克杯。"},{"en":"He bought a few novelties from the museum gift shop.","zh":"他在博物馆礼品店买了几样新奇小玩意。"}]}],"synonyms":["newness","freshness","originality","innovation","curiosity","gimmick (sometimes)","trinket (for the item sense)"],"phonetic":"/ˈnɑːvəlti/","extraExplanation":["“novelty”来自“novel（新奇的）”，常用来强调“新鲜感”可能是短暂的：the novelty wears off（新鲜感消退）。","在商业/产品语境里，novelty 往往指“噱头式的新奇”，暗示只有“新”还不够，还需要实用价值（value）或品质（quality）。","常见搭配：a sense of novelty（新鲜感）；for the novelty of it（就图个新鲜）；novelty item/gift（新奇商品/礼物）；novelty song（搞笑/噱头歌曲）。"]}
{"word":"novelwright","summary":{"en":"A novelwright is a person who writes novels (a less common word for “novelist”).","zh":"novelwright 指写小说的人（“novelist”的较少见说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes novels; a novelist (a less common, slightly old-fashioned or playful word).","zh":"写小说的人；小说家（较少用，略带复古或俏皮语气）。"},"examples":[{"en":"She’s a young novelwright whose first book became a bestseller.","zh":"她是一位年轻的小说家，第一本书就成了畅销书。"},{"en":"The workshop welcomes poets, essayists, and novelwrights.","zh":"这个工作坊欢迎诗人、散文作者和小说家参加。"}]}],"synonyms":["novelist","fiction writer","author"],"phonetic":"ˈnɑvəlˌraɪt","extraExplanation":["“novelwright”由“novel（小说）+ wright（工匠/制作者）”构成，类比“playwright（剧作家）”。“wright”在现代英语里多见于复合词，带有“创作/制作某物的人”的意味，语感上比“novelist”更文学化或更有玩味。","在正式写作中更常用“novelist”。如果想表达“像工匠一样精心打造小说的人”，用“novelwright”会更有风格。"]}
{"word":"Novem","summary":{"en":"Novem is Latin for “nine,” mainly used today in word origins (e.g., November).","zh":"Novem 是拉丁语“九”，如今多用于词源说明（如 November 的来源）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin word meaning “nine,” often seen as a root in English words (especially in “November,” originally the ninth month in the old Roman calendar).","zh":"拉丁语中表示“九”的词，常作为词根出现在英语中（尤其在“November”中；在古罗马历中十一月原本是第九个月）。"},"examples":[{"en":"The “novem-” in “November” comes from Latin for “nine.”","zh":"“November”里的“novem-”来自拉丁语，意思是“九”。"},{"en":"In etymology notes, you may see “novem” listed as the Latin source of words related to nine.","zh":"在词源说明中，你可能会看到“novem”被标为与“九”有关的拉丁语来源。"}]}],"synonyms":["nine"],"phonetic":"/ˈnoʊvɛm/","extraExplanation":["“Novem”本身不是常见的现代英语单词，更常在词源（etymology）或拉丁语语境中出现。英语里更常见的是它的词根形式 **novem- / nov-**，例如：**November**（十一月）、较学术的 **novennial**（九年一次的）。","关于十一月：在古罗马早期历法中，三月（March）是一年的开始，所以 **November** 原意为“第九个月”。后来历法调整后它变成第十一月，但名称保留了下来。"]}
{"word":"novem","summary":{"en":"Novem is Latin for “nine,” often seen in word origins (e.g., November).","zh":"Novem 是拉丁语“九”，常用于英语词源（如 November）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) the number nine.","zh":"（拉丁语）数字“九”。"},"examples":[{"en":"In Latin, novem means “nine.”","zh":"在拉丁语中，novem 的意思是“九”。"},{"en":"The prefix in “November” is related to novem, the Latin word for nine.","zh":"“November（十一月）”里的词根与拉丁语 novem（九）有关。"}]}],"synonyms":["nine"],"phonetic":"/ˈnoʊ.vɛm/","extraExplanation":["novem 是拉丁语数字“九”。它常见于英语词源学习中：例如 September、October、November、December 这些月份名称来自古罗马历法（当时一年从三月开始算），所以它们原本分别对应第 7、8、9、10 个月；后来历法调整后月份顺序变了，但名称保留了下来。","相关词源联想：November（原“第九个月”）、novena（天主教传统中连续九天的祈祷，源自“九”）、nonary / nonagon 等含“九”的词多来自同一拉丁数字系统。"]}
{"word":"novemarticulate","summary":{"en":"Novemarticulate means “having nine segments or joints,” mainly in technical descriptions.","zh":"novemarticulate 指“具有九个节段或关节的”，主要用于技术性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having nine joints, segments, or articulated parts (often used in technical descriptions of plants or insects).","zh":"具有九个关节、节段或可活动连接部分的（多用于植物学或昆虫学等技术性描述）。"},"examples":[{"en":"The scientist described the antenna as novemarticulate, meaning it had nine segments.","zh":"科学家将触角描述为 novemarticulate，意思是它由九个节段组成。"},{"en":"In the field guide, the beetle is identified by its novemarticulate feelers.","zh":"在野外图鉴中，这种甲虫以其九节的触角（novemarticulate）来辨认。"}]}],"synonyms":["nine-segmented","nine-jointed","nine-parted"],"phonetic":"/ˌnoʊvəmɑrˈtɪkjəˌleɪt/","extraExplanation":["这是一个相当少见、偏学术的词，多见于旧式或专业分类学写作。由拉丁语词根组成：novem-（九）+ articulate（有节/有关节的、分节的）。","日常英语里更常用的表达是 “nine-segmented / nine-jointed / with nine segments”。在阅读论文或物种描述时见到它较多。"]}
{"word":"November","summary":{"en":"November is the eleventh month of the year.","zh":"November 是一年中的第十一月（十一月）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The 11th month of the year, following October and before December.","zh":"十一月：一年中的第11个月，介于十月和十二月之间。"},"examples":[{"en":"My birthday is in November.","zh":"我的生日在十一月。"},{"en":"In many places, November is cold and rainy.","zh":"在许多地方，十一月又冷又多雨。"}]}],"synonyms":["the eleventh month","Nov."],"phonetic":"/noʊˈvɛm.bɚ/","extraExplanation":["在英语里，月份名称（January, February…）通常要首字母大写：November，而不是 november。","November 来自拉丁语 *novem*（“九”）。在古罗马历法中，November 原本是第九个月；后来历法调整，才变成现在的第十一个月。","在美国文化中，November 常让人联想到 Thanksgiving（感恩节，11月的第四个星期四）以及秋末初冬的季节变化。"]}
{"word":"november","summary":{"en":"November is the eleventh month of the year.","zh":"November 指一年中的第十一月（十一月）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The eleventh month of the year, after October and before December.","zh":"十一月（在十月之后、十二月之前的第11个月）。"},"examples":[{"en":"My birthday is in November.","zh":"我的生日在十一月。"},{"en":"It often gets colder in November.","zh":"十一月通常会更冷。"},{"en":"We travel to New York every November.","zh":"我们每年十一月去纽约旅行。"}]}],"synonyms":["the eleventh month"],"phonetic":"/noʊˈvɛmbɚ/","extraExplanation":["在英语里月份名称通常要大写：November（不是 november）。","November 来自拉丁语 *novem*（“九”）：在古罗马早期历法里，November 原本是第九个月；后来历法调整，它变成第十一月。"]}
{"word":"novemberish","summary":{"en":"“Novemberish” means having a November-like late-autumn feel—gray, chilly, quiet, or a bit gloomy.","zh":"“novemberish”指带有“十一月般”的深秋氛围：灰冷、微寒、安静或略显萧瑟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, literary) Having the feel or qualities of November—late-autumn, gray, chilly, quiet, or slightly gloomy.","zh":"（非正式/文学用语）有“十一月般”氛围的——带着深秋的灰冷、微寒、安静或略显萧瑟的感觉。"},"examples":[{"en":"The sky looked Novemberish even though it was only October.","zh":"虽然才十月，但天空看起来已经很“十一月般”了。"},{"en":"After the holiday rush, the town becomes Novemberish—quiet streets and early sunsets.","zh":"节日热闹过后，小镇变得很“十一月般”——街道安静，日落很早。"},{"en":"She wrote in a Novemberish mood, slow and thoughtful.","zh":"她带着一种“十一月般”的心境写作，缓慢而沉思。"}]}],"synonyms":["autumnal","late-autumn","wintry","bleak","gray","chilly"],"phonetic":"/noʊˈvɛm.bɚ.ɪʃ/","extraExplanation":["“Novemberish”由“November + -ish”构成，-ish 常表示“有点……的、带……气息的”，语气更主观、更有画面感（不是精确描述）。","这个词多见于随笔、小说、诗歌或日常写作，用来营造季节情绪：阴天、寒意、落叶、天黑得早、略带忧郁的氛围。","在英美文化里，11月常让人联想到入冬前的冷清与灰暗（同时也有感恩节等温暖元素）；说某天“Novemberish”通常强调前者。"]}
{"word":"novembers","summary":{"en":"“Novembers” means more than one November, or (literarily) repeated late-autumn times with a gloomy/cold feeling.","zh":"“Novembers”指多个“十一月”；也可作文学化表达，指反复出现的深秋时节，带有寒冷、萧瑟的意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of November: the 11th month of the year (in the Gregorian calendar), coming after October and before December.","zh":"November（十一月）的复数：公历一年中的第11个月，介于十月和十二月之间。"},"examples":[{"en":"We’ve visited New York in several Novembers, and it’s already getting cold.","zh":"我们好几个十一月都去过纽约，那时已经开始冷了。"},{"en":"The project always slows down in Novembers because of holidays and travel.","zh":"由于假期和出行，这个项目在每年十一月总会放慢进度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/poetic) Multiple “November” seasons; repeated late-autumn periods, often suggesting cold, darkness, or melancholy.","zh":"（文学/诗意用法）多个“十一月”的时节；反复出现的深秋时段，常带有寒冷、昏暗或忧郁的意象。"},"examples":[{"en":"He wrote about the Novembers of his life—quiet days and early nights.","zh":"他写下自己生命中的一个个“十一月”——安静的日子和很早降临的夜晚。"},{"en":"After the loss, every year felt like passing through new Novembers.","zh":"经历失去之后，每一年都像在穿越新的“十一月”。"}]}],"synonyms":["multiple Novembers","Nov. (abbrev., not a synonym)"],"phonetic":"/noʊˈvɛmbɚz/","extraExplanation":["“November”通常要大写（月份名在英语中是专有名词）。复数“Novembers”用于谈多个年份的十一月，或在文学中用来营造“深秋/萧瑟”的氛围。","常见缩写：Nov.（例如：Nov. 12）。发音复数不变，只是在词尾加 /z/ 的复数音。"]}
{"word":"novemcostate","summary":{"en":"Novemcostate means “having nine ribs or ridges,” used mainly in scientific descriptions.","zh":"novemcostate 指“具九条肋/棱”的，多用于科学（形态）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having nine ribs, ridges, or rib-like lines (often describing a leaf, shell, or other surface).","zh":"（植物学/动物学）具九条肋、棱或类似肋的条纹（常用来描述叶片、贝壳或表面纹理）。"},"examples":[{"en":"The botanist noted a novemcostate pattern of veins on the seed pod.","zh":"植物学家注意到该种荚果上有九肋状的脉纹。"},{"en":"Under magnification, the specimen appears novemcostate along its outer surface.","zh":"在放大观察下，这个标本的外表面呈现九肋状纹理。"}]}],"synonyms":["nine-ribbed","nine-ridged","costate (general)"],"phonetic":"/ˌnoʊvəmˈkɑːsteɪt/","extraExplanation":["这个词比较罕见，多见于分类学/形态学描述（如植物标本说明或贝壳特征）。它由拉丁语词根组成：novem- 表示“九”，costate 来自 costa（“肋、肋骨、棱”）。","相关近义描述常见还有：costate（有肋的）、multicostate（多肋的）、tricostate（三肋的）等。"]}
{"word":"novemdecillion","summary":{"en":"Novemdecillion is the name for 10^60 (short scale), an extremely large number.","zh":"Novemdecillion 是一个极大的数名，在短计数法中表示 10^60。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large number: 1 followed by 60 zeros (10^60) in the modern American (short-scale) naming system.","zh":"一个极大的数：在现代美式（短计数法）中，novemdecillion 指 1 后面跟 60 个 0（10^60）。"},"examples":[{"en":"In the short scale used in the U.S., a novemdecillion equals 10^60.","zh":"在美国常用的短计数法中，novemdecillion 等于 10^60。"},{"en":"The chances were described as ‘one in a novemdecillion,’ meaning almost impossible.","zh":"他们把概率形容为“十的六十次方分之一（one in a novemdecillion）”，意思是几乎不可能。"}]}],"synonyms":["10^60","one followed by 60 zeros"],"phonetic":"/ˌnoʊvəmˌdɛsɪˈljən/","extraExplanation":["在不同国家或不同年代，“-illion” 大数命名可能采用短计数法（short scale）或长计数法（long scale）。现代英语里（尤其是美国）通常默认短计数法，因此 novemdecillion 多指 10^60；阅读旧书或英式/欧式资料时，最好确认所用体系。","词源上，novem- 表示“九”，dec- 与“十”相关，组合起来表示比 decillion 更大的某一阶数（用于系统化命名超大数字）。"]}
{"word":"novemdecillionth","summary":{"en":"Novemdecillionth means the ordinal or fractional form related to 10^60 (short scale): the 10^60th, or one 10^60th.","zh":"Novemdecillionth 指与 10^60（短尺度）相关的序数或分数：第 10^60 个，或 10^60 分之一。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Being number 10^60 in order; relating to a novemdecillion (in the U.S. short scale).","zh":"第 10^60 个的；与“novemdecillion（短尺度）”相关的（在美国常用短尺度中）。"},"examples":[{"en":"This label marks the novemdecillionth entry in a (purely theoretical) list.","zh":"这个标签标记的是一个（纯理论的）列表中的第 10^60 个条目。"},{"en":"A novemdecillionth step is far beyond anything we can count in everyday life.","zh":"第 10^60 步远远超出日常生活中可计数的范围。"}]},{"partOfSpeech":"n.","definition":{"en":"One 10^60th part of something.","zh":"某物的 10^60 分之一（第 10^60 分之一部分）。"},"examples":[{"en":"A novemdecillionth of a dollar would be effectively zero in any real transaction.","zh":"一美元的 10^60 分之一在任何真实交易中都等同于零。"}]}],"synonyms":["10^60th","one-quintillionth (NOT the same number; do not substitute)"],"phonetic":"/ˌnoʊvəmˌdɛsɪˈljənθ/","extraExplanation":["“novemdecillion”来自拉丁语词根：novem（九）+ deci（十）+ -illion（大数词后缀），表示 10^(9×3+33)=10^60（短尺度）。因此“novemdecillionth”既可作序数（第 10^60 个），也可指分数单位（10^60 分之一）。","注意：英语里大数词有“短尺度（short scale）”与“长尺度（long scale）”两种传统；美国与现代国际科技写作多用短尺度（billion=10^9）。在少数使用长尺度的地区，不同 -illion 词可能对应不同幂次。阅读旧书或跨地区材料时要留意。"]}
{"word":"novemdigitate","summary":{"en":"Novemdigitate means ‘having nine fingers or toes.’","zh":"Novemdigitate 指“有九个手指或脚趾（九指/九趾）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having nine digits (fingers or toes); nine-fingered or nine-toed.","zh":"具有九个指（手指或脚趾）的；九指（九趾）的。"},"examples":[{"en":"The patient became novemdigitate after an accident.","zh":"那位病人在事故后成了九指的人。"},{"en":"Some medical reports describe a person as novemdigitate when one digit is missing.","zh":"一些医学报告会用“novemdigitate”来描述缺少一根手指（或脚趾）的人。"}]}],"synonyms":["nine-fingered","nine-toed","nine-digit(ed) (rare)"],"phonetic":"/ˌnoʊvɛmˈdɪdʒɪteɪt/","extraExplanation":["这个词非常罕见，常见于医学/解剖学或较正式的描写中；日常英语更常说：\"missing a finger/toe\"、\"has nine fingers/toes\"，或更直接的 \"nine-fingered\"。","词源上可拆解理解：\"novem-\" 来自拉丁语表示“九”，\"digit\" 表示“手指/脚趾（也指数字）”，\"-ate\" 常见于形容词构词中，表示“具有……特征的”。"]}
{"word":"novemfid","summary":{"en":"“novemfid” is not a standard English word; it likely needs context or a corrected spelling.","zh":"“novemfid”不是标准英语词，可能需要上下文或正确拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “novemfid” in an English dictionary—where did you see it?","zh":"我在英语词典里找不到“novemfid”——你是在哪里看到的？"},{"en":"If you meant a different word, please check the spelling and tell me the sentence it appears in.","zh":"如果你想查的是另一个词，请确认拼写，并把它出现的句子发给我。"}]}],"phonetic":"/noʊˈvɛm.fɪd/","extraExplanation":["“novemfid”看起来像是由两部分拼成的形式：例如“novem-”（常见于拉丁语，意为“九”）+“fid”（可能让人联想到“faith/faithful/identity”等词根），但在英语里并没有公认的单词或固定含义。","如果你能提供上下文（整句话、文章主题、它是否是人名/公司名/游戏道具名/密码等），我可以更准确判断它的来源与可能含义，也能帮你找出最可能的正确拼法。"]}
{"word":"novemlobate","summary":{"en":"Novemlobate means “nine-lobed,” often used in botanical descriptions.","zh":"novemlobate 意为“九裂的/具九个裂片的”，多用于植物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having nine lobes (nine rounded or divided sections), especially describing a leaf or similar structure in botany.","zh":"（尤指植物学中叶片等）具九个裂片的；九裂的。"},"examples":[{"en":"The specimen has a novemlobate leaf, with nine distinct sections around the edge.","zh":"这个标本的叶片是九裂的，叶缘周围有九个明显的裂片。"},{"en":"In the field guide, the plant is identified by its novemlobate foliage.","zh":"在野外图鉴中，这种植物以其九裂的叶形作为识别特征。"}]}],"synonyms":["nine-lobed","nine-lobed (botanical)","nonalobate"],"phonetic":"/ˌnoʊvəmˈloʊbeɪt/","extraExplanation":["词源提示：来自拉丁语构词，novem- 表示“九”，-lobate 表示“有裂片的/有叶裂的”。常见于较正式的植物学描述中，而日常表达更常用 nine-lobed。"]}
{"word":"novemnervate","summary":{"en":"Likely meant: enervate = to weaken or exhaust someone; to drain energy.","zh":"你可能想查的是：enervate = 使衰弱、使疲惫、耗尽精力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Commonly written as) to weaken or drain someone’s energy; to make someone feel tired.","zh":"（常见拼写为）使衰弱；使失去精力；使人感到疲惫。"},"examples":[{"en":"The long meeting enervated everyone in the room.","zh":"这场漫长的会议让房间里所有人都疲惫不堪。"},{"en":"Hot, humid weather can enervate you if you don’t rest and drink water.","zh":"炎热潮湿的天气如果不休息、不补水，会让人很快没力气。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common, historical) to remove strength or force from something; to make something less effective.","zh":"（较少见，偏历史用法）削弱某物的力量/效力；使某物不再有力。"},"examples":[{"en":"Constant criticism can enervate a team’s confidence.","zh":"持续的批评会削弱团队的信心。"}]}],"synonyms":["weaken","exhaust","drain","fatigue","sap"],"phonetic":"/ɪˈnɝːveɪt/","extraExplanation":["你输入的“novemnervate”在英语里不是常见单词，最接近且常用的词是 **enervate**。","**enervate** 常被误用为“使兴奋/激励”（因为看起来像 *energize*），但它的意思相反，是“使人没劲、使衰弱”。","词源来自拉丁语 *enervare*（字面意思是“去掉筋/力量”），所以核心感觉是“把力气抽走”。"]}
{"word":"novemperfoliate","summary":{"en":"“Novemperfoliate” isn’t a recognized English word; it’s likely a typo or a coined blend, possibly related to “defoliate” or “perfoliate.”","zh":"“novemperfoliate”不是公认的英语词；多半是拼写错误或自造词，可能与“defoliate（落叶/去叶）”或“perfoliate（抱茎叶）”有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a made-up blend. It may be intended to refer to “defoliating in November” or it may be confusion with the real word “perfoliate” (a botanical term).","zh":"不是标准英语单词；很可能是拼写错误或自造词。可能想表达“在十一月落叶/去叶（defoliate）”，也可能与真实单词“perfoliate”（植物学术语）混淆。"},"examples":[{"en":"I can’t find “novemperfoliate” in any dictionary—did you mean “defoliate” or “perfoliate”?","zh":"我在词典里找不到“novemperfoliate”——你是想说“defoliate”还是“perfoliate”吗？"},{"en":"The trees defoliate in late fall, often around November, depending on the climate.","zh":"树木在深秋会落叶，气候不同的话常常在十一月前后发生。"}]}],"synonyms":["defoliate","perfoliate","shed leaves","lose leaves"],"phonetic":"/noʊˌvɛmpərˈfoʊlieɪt/","extraExplanation":["从构词看，它可能由 November（十一月）+ perfoliate/defoliate（与叶子相关）拼在一起，但英语里没有固定用法。","如果你是在植物学/园艺语境里看到的，最接近的正规词往往是：defoliate（使落叶/去叶）或 perfoliate（叶子“抱茎”的一种形态：叶基包围茎，好像茎穿过叶片）。","如果你告诉我你看到它的原句或使用场景（文章/游戏/诗歌/聊天），我可以更准确判断它想表达的意思，并给出地道替换说法。"]}
{"word":"novena","summary":{"en":"A novena is a nine-day Catholic prayer devotion.","zh":"novena 指天主教连续九天的祈祷敬礼（九日敬礼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Catholic devotion consisting of prayers said over nine days (or nine times), often to ask for help, give thanks, or prepare for a feast day.","zh":"（天主教）九日敬礼：连续九天（或九次）进行的祈祷敬礼，常用于祈求、感恩或为节日做准备。"},"examples":[{"en":"She prayed a novena to Saint Jude for help with her family situation.","zh":"她向圣犹达做九日敬礼，为家庭的情况祈求帮助。"},{"en":"Many people begin a novena nine days before Christmas.","zh":"很多人会在圣诞节前九天开始做九日敬礼。"}]}],"synonyms":["nine-day devotion","Catholic devotion","prayer devotion"],"phonetic":"/noʊˈviːnə/","extraExplanation":["“novena”来自拉丁语“novem”（九）。在传统背景中，它常与特定圣人（如St. Jude、St. Thérèse）或重要节日（如圣诞节前的九日敬礼）相关。","在文化用法上，novena既可指一套固定的祷文与仪式，也可泛指“连续九天的祈祷活动”。不同地区（如菲律宾、拉丁美洲）会有更强的民间与社群参与色彩。"]}
{"word":"novenae","summary":{"en":"“Novenae” means more than one novena—a nine-day Catholic prayer devotion.","zh":"“novenae”指多个“novena”（九日敬礼）：天主教连续九天的祈祷敬礼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “novena”: a Roman Catholic devotion of prayers said for nine days (or nine weeks), often asking for a special intention.","zh":"“novena”的复数：天主教（罗马公教）中连续九天（或九周）进行的祈祷敬礼，常为某个特别意向而祈求。"},"examples":[{"en":"Many parishes hold novenae leading up to Christmas.","zh":"许多堂区会在圣诞节前举行九日敬礼（novenae）。"},{"en":"She joined the novenae to pray for her family’s health.","zh":"她参加九日敬礼，为家人的健康祈祷。"}]}],"synonyms":["novenas","nine-day devotions"],"phonetic":"/noʊˈveɪni/","extraExplanation":["“Novena”来自拉丁语 *novem*（九）。在天主教传统中，九天祈祷常与圣经中的“九日等待”意象相关（例如耶稣升天到圣神降临之间的等待）。","英语里更常见的复数写法是 **novenas**；**novenae**属于较“拉丁化”的复数形式，常见于较正式或教会语境。"]}
{"word":"novenary","summary":{"en":"Novenary means ‘related to nine’ or ‘a group of nine,’ and it can also refer to a nine-day Catholic devotion (a novena).","zh":"Novenary 指“与九有关/由九个组成”或“九个一组”，也可指与天主教“九日敬礼（novena）”相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the number nine; consisting of nine things.","zh":"与数字九有关的；由九个组成的。"},"examples":[{"en":"A novenary cycle is made up of nine days.","zh":"一个 novenary 周期由九天组成。"},{"en":"The poem is arranged in novenary units of nine lines.","zh":"这首诗按每九行一个单元来编排。"}]},{"partOfSpeech":"n.","definition":{"en":"A group or set of nine (things or people).","zh":"九个一组；九人（或九物）一套。"},"examples":[{"en":"They formed a novenary of volunteers to rotate shifts.","zh":"他们组成了一个九人志愿小组来轮班。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of or connected with a novena (a Catholic devotion lasting nine days).","zh":"与“九日敬礼/九日祈祷”（天主教连续九天的敬礼或祈祷）有关的。"},"examples":[{"en":"She attended a novenary devotion before the feast day.","zh":"在节日庆典前，她参加了九日敬礼。"},{"en":"The church announced a novenary of prayers for peace.","zh":"教堂宣布将举行连续九天的和平祈祷。"}]}],"synonyms":["ninefold","nonary","novena (religious sense)"],"phonetic":"/ˈnoʊvəˌnɛri/","extraExplanation":["“novenary”较少见，更常见的是“novena”（九日敬礼/九日祈祷）。两者都来自拉丁语“novem”（九）。在英语宗教语境里，指连续九天的祈祷活动时，用“novena”最自然；“novenary”更偏书面或较旧的用法。"]}
{"word":"novenas","summary":{"en":"“Novenas” is the plural of “novena,” meaning nine-day devotional prayers or the prayer set used for them.","zh":"“Novenas”是“novena”的复数，指九日敬礼（连续九天的祈祷活动）或其所用的一套祈祷文/礼仪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Catholic (and some other Christian) devotion consisting of prayers said for nine days in a row (or over nine weeks), often for a special intention.","zh":"（天主教及部分基督宗教的）九日敬礼：连续九天（或九周特定形式）进行的祈祷活动，常为特定心愿或目的而祈祷。"},"examples":[{"en":"She prayed a novena for her family’s health.","zh":"她为家人的健康做了九日敬礼祈祷。"},{"en":"Many people attend novenas leading up to Christmas.","zh":"很多人在圣诞节前会参加九日敬礼。"}]},{"partOfSpeech":"n.","definition":{"en":"The set of prayers or services used during this nine-day devotion.","zh":"九日敬礼所使用的一套祈祷文或礼仪。"},"examples":[{"en":"They printed the novena and handed it out after Mass.","zh":"他们把九日敬礼的祈祷文印出来，在弥撒后分发。"}]}],"synonyms":["devotion","prayer service","nine-day devotion"],"phonetic":"/noʊˈviːnə/","extraExplanation":["“Novena”来自拉丁语 *novem*（九）。在天主教文化里，九日敬礼常与特定节日（如圣诞前夕期的准备）、圣人瞻礼或个人意向（求平安、求工作等）相关；形式可以是个人私下祈祷，也可以是教堂团体一起举行。"]}
{"word":"novendial","summary":{"en":"Novendial means “connected with a nine-day period,” especially nine-day rites in ancient Rome.","zh":"novendial 表示“与九天为期有关的”，尤指古罗马的九日宗教/丧葬仪式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a period of nine days, especially in ancient Roman religious or funeral rites (such as ceremonies held on the ninth day after a death).","zh":"与九天（为期九天）有关的；尤指古罗马宗教或丧葬习俗中与“第九日”仪式相关的。"},"examples":[{"en":"In ancient Rome, some funeral observances were described as novendial rites.","zh":"在古罗马，一些丧葬仪式被称为“九日（第九日）仪式”。"},{"en":"The text mentions a novendial ceremony performed on the ninth day after the burial.","zh":"文献提到在下葬后第九天举行的九日仪式。"}]}],"synonyms":["nine-day","of nine days"],"phonetic":"noʊˈvɛn.di.əl","extraExplanation":["这个词来自拉丁语“novem”（九）+“dies”（天）的词根组合，常见于讨论古罗马宗教与丧葬传统的历史/古典学语境。","不要与“novennial”（每九年一次）混淆：novendial 讲“九天”，novennial 讲“九年”。"]}
{"word":"novene","summary":{"en":"Novene (more commonly spelled novena) means a nine-day series of Catholic prayers for a particular intention or in preparation for a feast.","zh":"Novene（更常见拼作 novena）指天主教中为特定意向祈求或为节日准备而进行的九日连续祈祷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nine-day period of prayer in the Catholic tradition (often asking for a special intention or preparing for a feast day)","zh":"（天主教传统中）为特定意向祈求或为节日做准备而进行的九日敬礼／九日祈祷"},"examples":[{"en":"She prayed a novena for her friend’s recovery.","zh":"她为朋友的康复做了九日敬礼。"},{"en":"Many Catholics begin a novena nine days before Christmas.","zh":"许多天主教徒会在圣诞节前九天开始九日祈祷。"}]}],"synonyms":["novena","nine-day prayer"],"phonetic":"/noʊˈveɪnə/","extraExplanation":["“novene”在英语中不如“novena”常见，多数情况下人们用“novena”来指天主教的九日祈祷。这个词源自拉丁语“novem”（九），常见于宗教与文化语境中。"]}
{"word":"novennial","summary":{"en":"Novennial means occurring every nine years or lasting nine years.","zh":"novennial 指“每九年一次”或“持续九年”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening once every nine years; lasting for a nine-year period.","zh":"每九年发生一次的；持续九年的。"},"examples":[{"en":"The town holds a novennial festival to mark its founding.","zh":"这个小镇每九年举办一次纪念建镇的庆典。"},{"en":"They planned a novennial review of the long-term project.","zh":"他们计划每九年对这个长期项目做一次评估。"}]}],"synonyms":["nine-year","enneennial (rare)"],"phonetic":"/noʊˈvɛn.i.əl/","extraExplanation":["“novennial”较少见，常见于正式写作或历史/宗教/学术语境。","词源：来自拉丁语 novem（九）+ annus（年），与 biennial（两年一次）、triennial（三年一次）结构相似。"]}
{"word":"novercal","summary":{"en":"“novercal” is not a recognized English word; it’s likely a misspelling (often of “nervical”).","zh":"“novercal”不是标准英语词；多半是拼写错误（常见可能是把“nervical”写错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or typing error (often confused with “nervical” or sometimes “novel/novelty” words depending on context).","zh":"不是标准英语单词；很可能是拼写或输入错误（常见的可能目标词是“nervical/颈部的”，也可能与“novel/新奇的、小说的”等有关，需看上下文）。"},"examples":[{"en":"I couldn’t find “novercal” in the dictionary—maybe you meant “nervical”?","zh":"我在词典里找不到“novercal”——你是不是想写“nervical（颈部的）”？ "},{"en":"If you share the sentence, I can help confirm what “novercal” was meant to be.","zh":"如果你把原句发我，我可以帮你确认“novercal”原本想表达的词。"}]}],"phonetic":"ˈnoʊvərkəl","extraExplanation":["“nervical”是一个很常见、也最容易和“novercal”形状接近的词，意思是“颈部的/子宫颈的”（如：nervical spine 颈椎；cervical cancer 是“宫颈癌”，注意cervical也常见）。","如果你告诉我这个词出现的领域（医学？健身？写作？）和整句内容，我可以更准确地判断你要的词，并给出正确拼写与用法。"]}
{"word":"noverify","summary":{"en":"“noverify” usually means “no verification required” or “verification disabled,” especially in tech contexts.","zh":"“noverify”通常表示“免验证”或“关闭验证”，多用于技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not requiring verification; skipping identity or information checks (often used in tech or online services).","zh":"不需要验证的；跳过身份或信息核验的（常见于科技或网络服务语境）。"},"examples":[{"en":"This site offers a noverify signup, so you can start using it right away.","zh":"这个网站提供免验证注册，所以你可以马上开始使用。"},{"en":"A noverify link may be convenient, but it can also increase security risks.","zh":"免验证链接可能更方便，但也可能增加安全风险。"}]},{"partOfSpeech":"n.","definition":{"en":"an option/setting that disables verification checks in a system (used as a label in menus, buttons, or code).","zh":"（系统中的）“关闭验证”选项/设置（常作菜单、按钮或代码中的标签）。"},"examples":[{"en":"Turn on noverify only for testing, not for production.","zh":"“关闭验证”只用于测试，不要用于正式环境。"}]}],"synonyms":["no verification","skip verification","verification disabled","unverified"],"phonetic":"/ˌnoʊˈvɛrɪˌfaɪ/","extraExplanation":["“noverify”多见于网络与软件语境，属于非正式写法，常理解为“no-verify / no verification（免验证）”。在安全相关场景（登录、支付、证书校验等）中，关闭验证可能带来风险，正式文档里更常写作“skip verification”“disable verification”“no verification required”。"]}
{"word":"noverint","summary":{"en":"Noverint is an archaic Latin legal word meaning “let it be known,” often seen in “Noverint universi…” at the start of deeds or formal documents.","zh":"Noverint 是古旧的拉丁法律用语，意为“兹告知 / 众所周知”，常见于契约等正式文书开头的“Noverint universi…”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Law, Latin; archaic) “may (they) know” or “let (them) know”; used in formal legal openings, especially in the phrase “Noverint universi…” meaning “Let all know…” / “Know all people…”","zh":"（法律用语；拉丁语；古旧）“让（他们）知道 / 使……知晓”；常见于法律文书开头，尤见于“Noverint universi…”意为“众所周知 / 让所有人知晓……”"},"examples":[{"en":"Noverint universi per praesentes, that the parties agree to the terms below.","zh":"Noverint universi per praesentes（兹告知众人），双方同意下列条款。"},{"en":"The deed begins with a traditional Latin formula: “Noverint universi…”.","zh":"该契约以传统拉丁格式开头：“Noverint universi…”。"}]}],"synonyms":["know all by these presents","let it be known","be it known"],"phonetic":"/ˈnoʊvərɪnt/","extraExplanation":["“noverint”来自拉丁语动词 *nōscere*（了解、认识）的完成时虚拟式/将来完成时形式，在法律拉丁语里常用作固定套语，功能类似英文的正式公告式开头：*Know all (people) by these presents…*（兹告知众人）。","现代英语写作里几乎不会单独使用“noverint”，多作为历史文书、契约、地产契据、公司章程等文本中的传统用语出现。"]}
{"word":"novial","summary":{"en":"Novial is a constructed international auxiliary language created by Otto Jespersen in the 1920s.","zh":"Novial 是奥托·叶斯珀森在20世纪20年代创造的一种人造国际辅助语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a planned (constructed) international auxiliary language created to help people from different native languages communicate more easily; designed by Danish linguist Otto Jespersen (1920s).","zh":"一种人为规划的国际辅助语，旨在帮助不同母语的人更容易交流；由丹麦语言学家奥托·叶斯珀森（Otto Jespersen）在20世纪20年代设计。"},"examples":[{"en":"Novial was designed as an easier international auxiliary language for global communication.","zh":"Novial 被设计成一种更容易的国际辅助语，用于全球交流。"},{"en":"He studies Esperanto and Novial as examples of constructed languages.","zh":"他研究世界语和 Novial 作为人造语言的例子。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Novial (its vocabulary, grammar, or texts).","zh":"与 Novial 有关的（如其词汇、语法或文本）。"},"examples":[{"en":"I found a Novial grammar guide online.","zh":"我在网上找到了一本 Novial 语法指南。"},{"en":"They translated a short story into Novial for practice.","zh":"他们把一篇短篇故事翻译成 Novial 来练习。"}]}],"synonyms":["constructed language","international auxiliary language","conlang"],"phonetic":"/ˈnoʊviəl/","extraExplanation":["Novial 这个名称常被解释为“new（新）+ international（国际）+ auxiliary language（辅助语）”的组合或缩写，体现其“更现代、更易学的国际交流工具”的定位。","它在历史上常被拿来与 Esperanto（世界语）对比：两者都是国际辅助语，但 Novial 更强调在词汇与语法上做“折中”和“简化”，并受当时欧洲语言影响较大。","使用者群体相对较小，因此你更可能在语言学、构造语言（conlang）社区或历史资料中见到它。"]}
{"word":"novice","summary":{"en":"“Novice” means a beginner—someone new to an activity or lacking experience; it can be a noun or an adjective.","zh":"“novice”指“新手/初学者”，也可作形容词表示“缺乏经验的”，语气较正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is new to a skill, activity, or subject; a beginner","zh":"新手；初学者（对某项技能、活动或领域还不熟悉的人）"},"examples":[{"en":"As a novice, she practiced the basics every day.","zh":"作为新手，她每天练习基础内容。"},{"en":"The workshop is friendly to novices and experienced learners alike.","zh":"这个工作坊对新手和有经验的学习者都很友好。"}]},{"partOfSpeech":"adj.","definition":{"en":"new and inexperienced in a skill, activity, or situation","zh":"新手的；缺乏经验的（在某技能、活动或情境中）"},"examples":[{"en":"Novice cooks often follow recipes step by step.","zh":"新手厨师常常一步一步照着食谱做。"}]}],"synonyms":["beginner","newcomer","learner","rookie","starter"],"phonetic":"/ˈnɑːvɪs/","extraExplanation":["“novice”常用于较正式的语境，比“beginner”更书面一些。日常口语里“beginner”更常见。","词源上与拉丁语“novus（新的）”有关，因此核心含义是“新的、刚开始的”。","在宗教语境中，novice 也可指“修道院的见习修士/修女”，表示尚在学习与试炼阶段的人。"]}
{"word":"novicehood","summary":{"en":"Novicehood means the period or state of being a beginner, especially in training or a religious setting.","zh":"Novicehood 指“新手时期/见习期”，尤其用于培训或宗教修行语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a novice (a beginner), especially in a skill, job, or religious order","zh":"新手阶段；见习期；（尤指技能、工作或宗教团体中的）初学者身份/时期"},"examples":[{"en":"During her novicehood, she made many small mistakes but learned quickly.","zh":"在她的新手阶段，她犯了很多小错，但学得很快。"},{"en":"The monastery guides each monk through a time of novicehood before full vows.","zh":"修道院会在正式誓愿之前，引导每位僧侣经历一段见习期。"}]}],"synonyms":["beginnerhood","apprenticeship","novitiate","probationary period"],"phonetic":"/ˈnɑːvɪsˌhʊd/","extraExplanation":["“novicehood”不是特别常见的日常用词，更常见的说法是“novice period / being a novice / apprenticeship (学徒期)”。不过它在宗教或较正式的语境里仍可能出现。","后缀“-hood”表示“……的状态/时期/身份”，如 childhood（童年）、adulthood（成年期）、neighborhood（邻里/社区）。因此 novice + hood = “新手的状态/时期”。"]}
{"word":"novicelike","summary":{"en":"Novicelike means “like a beginner; inexperienced in a way that shows.”","zh":"novicelike指“像新手一样；表现出缺乏经验的样子”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities of a novice; showing inexperience or a beginner’s way of doing something.","zh":"像新手的；带有缺乏经验、初学者式的特点。"},"examples":[{"en":"His novicelike mistakes were understandable on his first day at work.","zh":"他第一天上班犯的新手式错误是可以理解的。"},{"en":"She asked a few novicelike questions before she learned the basic rules.","zh":"在学会基本规则之前，她问了几个很“新手”的问题。"},{"en":"The team’s novicelike nerves showed during the opening minutes of the game.","zh":"比赛刚开始的几分钟里，球队显得有些新手般紧张。"}]}],"synonyms":["beginner-like","inexperienced","green","unseasoned","amateurish"],"phonetic":"/ˈnɑːvɪsˌlaɪk/","extraExplanation":["“novicelike”在现代英语里不算常见，更常见的写法是带连字符的“novice-like”。日常表达里也常用“like a novice / like a beginner”来替换，更自然。","词根提示：novice来自拉丁语，原意与“新来的人、初学者”相关；因此novicelike通常带有“还不熟练、还在摸索”的语气，有时略带批评，但也可能是中性描述（例如第一天上班、刚开始学习）。"]}
{"word":"novicery","summary":{"en":"“Novicery” is a rare word meaning the state/period of being a novice, and sometimes (very rarely) a place where novices are trained.","zh":"“Novicery”是罕见词，通常指新手状态/新手时期；极少数情况下也可指新手受训之处（常用“novitiate”代替）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The state or period of being a novice; beginnerhood.","zh":"（罕见）新手的状态；新手时期。"},"examples":[{"en":"During his novicery, he made many small mistakes and learned quickly.","zh":"在他的新手时期，他犯了不少小错，但学得很快。"},{"en":"The coach was patient with her novicery and focused on the basics.","zh":"教练对她的新手阶段很有耐心，主要让她打好基础。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, often confused with “novitiary/novitiate”) A place or community where novices are trained, especially in a religious setting.","zh":"（极罕见，常与“novitiary/novitiate”混淆）新手受训之处，尤指宗教团体中的修院/新修士训练处。"},"examples":[{"en":"He spent a year in the novicery before taking formal vows. (rare)","zh":"他在新手训练处待了一年，之后才正式宣誓。（罕见）"},{"en":"Most writers today would use “novitiate” instead of “novicery” in this context.","zh":"在这种语境下，如今多数作者会用“novitiate”而不是“novicery”。"}]}],"synonyms":["novicehood","beginnerhood","apprenticeship","novitiate"],"phonetic":"/ˈnɑvɪsəri/","extraExplanation":["“novicery”不是常见标准词汇，更常见的是：\n- “novice”=新手（人）\n- “novicehood”=新手状态/阶段\n- “novitiate”=（宗教中）见习期；新修士训练阶段/地点\n如果你是在阅读宗教或历史文本里看到“novicery”，多半是在表达“新手期”或“见习期”的意思。"]}
{"word":"novices","summary":{"en":"“Novices” means beginners—people new to an activity or field.","zh":"“Novices”指“新手/初学者”，即刚接触某项活动或领域的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are new to a skill, activity, or field; beginners.","zh":"（某项技能、活动或领域的）新手；初学者。"},"examples":[{"en":"The workshop is designed for novices, so no experience is needed.","zh":"这次工作坊是为新手设计的，所以不需要任何经验。"},{"en":"Even novices can learn basic cooking techniques with practice.","zh":"即使是新手，经过练习也能学会基本的烹饪技巧。"},{"en":"The manual explains the software in a way that helps novices.","zh":"这本手册用一种能帮助新手理解的方式来讲解这款软件。"}]}],"synonyms":["beginners","newcomers","learners","amateurs"],"phonetic":"/ˈnɑːvɪsɪz/","extraExplanation":["“Novice”常用于比较正式的语境，既可以指一般的“新手”，也可指宗教或团体中“见习成员/修士”。日常口语里更常用“beginner”。","词源上来自拉丁语 *novus*（“新的”），因此带有“刚开始、还不熟练”的意味。"]}
{"word":"noviceship","summary":{"en":"Noviceship means the period or state of being a beginner (a novice), especially in training or early membership.","zh":"Noviceship 指“新手/见习者的阶段或状态”，常用于训练期或初入某组织（含宗教团体）的时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a novice (a beginner), especially while learning a skill or joining a profession or religious order","zh":"新手状态；学徒期；见习期（尤指学习技能、进入某行业或宗教团体时的初学阶段）"},"examples":[{"en":"During her noviceship, she learned the basics of reporting and editing.","zh":"在她的见习期里，她学习了报道与编辑的基础。"},{"en":"The monastery required a year of noviceship before full vows.","zh":"修道院要求在正式立誓前先进行一年的修习见习期。"}]}],"synonyms":["apprenticeship","probation","training period","beginner stage"],"phonetic":"/ˈnɑvɪsˌʃɪp/","extraExplanation":["“noviceship”由“novice（新手、见习者）+ -ship（表示状态/身份/时期的后缀，如 friendship, leadership）”构成，因此常强调“处在新手阶段的那段时期/状态”。","该词在宗教语境中较常见（如修道院中的见习期），在一般职场语境也可用来表达“初入行的阶段”，但更常见的替代说法是“training period / apprenticeship / probation”。"]}
{"word":"noviciate","summary":{"en":"Noviciate means a novice’s training period (often in a religious order) or the group of novices.","zh":"Noviciate 指（常见于修会的）见习/培育期，也可指见习者群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A period of training and testing when someone is a novice, especially before becoming a full member of a religious order.","zh":"见习期；（尤指）加入修会前的培育与考核期。"},"examples":[{"en":"She entered the convent and began her noviciate last autumn.","zh":"她进入修道院，并在去年秋天开始了见习期。"},{"en":"During his noviciate, he learned the daily routine and the community’s rules.","zh":"在见习期里，他学习了日常作息和团体的规章。"}]},{"partOfSpeech":"n.","definition":{"en":"The group of novices (people in training) in a religious community.","zh":"（修会中的）见习者群体；见习修士/修女们。"},"examples":[{"en":"The noviciate met each week with a mentor for guidance.","zh":"见习者们每周都会与导师见面接受指导。"}]}],"synonyms":["probation","training period","apprenticeship","novicehood"],"phonetic":"/noʊˈvɪʃiət/","extraExplanation":["词源来自拉丁语 *novicius*（新手、初学者），因此和 *novice*（新手）同源。现代英语里 *noviciate* 最常见于宗教语境；在非宗教场合，人们更常用 *apprenticeship*（学徒期）或 *training period*（培训期）来表达类似概念。"]}
{"word":"novillada","summary":{"en":"A novillada is a Spanish-style bullfighting event with young bulls, often featuring novice bullfighters.","zh":"novillada 指使用年轻公牛的西班牙式斗牛赛事，常由较缺乏经验的斗牛士参加。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish-style bullfight or bullfighting event using young bulls (novillos), often featuring less-experienced bullfighters (novilleros).","zh":"（西班牙式）青年公牛斗牛表演/赛事（使用较年轻的公牛），常由经验较少的斗牛士（novillero）参加。"},"examples":[{"en":"We watched a novillada in Seville before the main bullfights of the season.","zh":"在斗牛季的重头戏开始前，我们在塞维利亚看了一场青年公牛斗牛表演（novillada）。"},{"en":"The young matador began his career in novilladas.","zh":"这位年轻的斗牛士从参加 novillada 这类赛事起步。"}]},{"partOfSpeech":"n.","definition":{"en":"a series or set of novilladas held in a festival or season.","zh":"（在节庆或某一赛季中举行的）一系列青年公牛斗牛赛事。"},"examples":[{"en":"The town’s summer novillada series attracts many tourists.","zh":"这个小镇夏季的一系列 novillada 吸引了许多游客。"}]}],"synonyms":["novice bullfight","bullfight with young bulls"],"phonetic":"/ˌnoʊviˈjɑːdə/","extraExplanation":["“novillada”是西班牙语外来词：novillo 指“年轻的公牛”，因此 novillada 通常比正式斗牛（corrida de toros）规模更小、参赛者更“新手向”。","在西语文化中，参赛的年轻斗牛士常被称为 novillero；有时会用“sin picadores”（无长矛骑手）等说法来区分更初级的比赛形式。","英文学写作里常直接保留该词，用来呈现西班牙/拉美斗牛文化的地方色彩；但在不同地区，这类活动也可能涉及动物福利与文化传统的公共讨论。"]}
{"word":"novillero","summary":{"en":"A novillero is an apprentice bullfighter who fights young bulls before becoming a matador.","zh":"novillero 指见习斗牛士，先与小公牛对战，之后才可能成为正式斗牛士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beginner or apprentice bullfighter who fights young bulls (novillos) before becoming a full matador","zh":"（斗牛中）新手／见习斗牛士；通常先与小公牛（novillo）对战，之后才可能成为正式斗牛士（matador）"},"examples":[{"en":"The novillero entered the ring nervously, facing his first young bull.","zh":"这位新手斗牛士紧张地走进斗牛场，面对他的第一头小公牛。"},{"en":"She wrote an article comparing a novillero’s training to an athlete’s early career.","zh":"她写了一篇文章，把见习斗牛士的训练比作运动员的职业早期。"}]}],"synonyms":["apprentice bullfighter","torero (general)","bullfighter (general)"],"phonetic":"/ˌnoʊviˈjɛroʊ/","extraExplanation":["“novillero”来自西班牙语：novillo（小公牛）+ -ero（从事某种职业的人）。它多见于与西班牙或拉丁美洲斗牛文化相关的新闻、文学或评论中。","在斗牛体系里，novillero通常处于“学徒阶段”，主要参加novillada（与小公牛的比赛）；表现突出者才可能“升格”为matador（斗牛士）。","文化提示：斗牛在一些地区被视为传统艺术与仪式，但也因动物福利问题而存在强烈争议；写作或讨论时可用中性表达（如“a traditional yet controversial spectacle”）。"]}
{"word":"novillo","summary":{"en":"Spanish: novillo usually means a young bull (often a steer), and informally can mean a rookie/inexperienced person in some regions.","zh":"西班牙语：novillo 通常指小公牛（常指小阉牛），在部分地区口语里也可指“新手/没经验的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a young bull; often a steer (a young bull that has been castrated), especially one raised for beef.","zh":"（西班牙语）小公牛；常指小阉牛（被阉割的年轻公牛），尤其是用于肉牛饲养的牛。"},"examples":[{"en":"On the ranch, the novillos are kept in a separate pen from the older bulls.","zh":"在牧场里，这些小公牛（novillos）会与成年公牛分开圈养。"},{"en":"The farmer sold several novillos at the market for beef production.","zh":"农场主在市场上卖了几头小阉牛（novillos），用于牛肉生产。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin America, informal) a young or inexperienced person; a rookie.","zh":"（拉丁美洲，非正式）新手；没经验的年轻人。"},"examples":[{"en":"Don’t worry—you’re still a novillo at this job; you’ll learn fast.","zh":"别担心——你做这份工作还是个新手（novillo）；你会学得很快的。"}]}],"synonyms":["young bull","steer","rookie"],"phonetic":"/noʊˈviːjoʊ/","extraExplanation":["在畜牧语境里，novillo 的含义会因地区而略有差异：有的地方更偏向“年轻公牛”，有的地方更常用来指“阉割后育肥的公牛（steer）”。如果是在牛肉产业、拍卖市场或牧场管理的语境中，通常可理解为“育肥用的小阉牛”。","在某些西语地区也会出现在斗牛文化相关文本里，用来指较年轻、用于训练或特定场合的牛，但现代日常更常见于畜牧与市场语境。"]}
{"word":"novilunar","summary":{"en":"Novilunar means “of or relating to the new moon.”","zh":"novilunar 意为“与新月（朔月）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the new moon (the time when the moon is not visible from Earth or appears as a very thin crescent).","zh":"与新月有关的；指月亮从地球上几乎看不见（或仅呈极细月牙）的时期。"},"examples":[{"en":"Some calendars mark important holidays by the novilunar phase.","zh":"有些历法会用新月（novilunar）阶段来标记重要节日。"},{"en":"The desert sky was darkest on the novilunar night.","zh":"新月之夜，沙漠的天空最为漆黑。"},{"en":"Astronomers planned the observation around a novilunar period to reduce moonlight.","zh":"天文学家把观测安排在新月期间，以减少月光干扰。"}]}],"synonyms":["new-moon","lunar (context-dependent)"],"phonetic":"/ˌnɑviˈluːnɚ/","extraExplanation":["词源提示：novilunar 来自拉丁语系构词，novi-（新）+ lunar（月亮的）。它在日常英语里较少见，更常见的说法是 new-moon 或 new-moon phase。","用法场景：常出现在天文学、历法、宗教节期（以朔月计时的传统）或较具文学色彩的描写中；比起口语，更偏书面或学术表达。"]}
{"word":"novitial","summary":{"en":"Novitial means “related to a novice,” especially the early training stage in a religious order (the novitiate).","zh":"novitial 指“与新手有关的”，尤指宗教团体中的见习期（novitiate）阶段或成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a novice (a beginner), especially someone in the early training stage of a religious order; relating to a novitiate.","zh":"与新手（初学者）有关的；尤指宗教团体中“见习期/初学期”（novitiate）成员或阶段的。"},"examples":[{"en":"During her novitial year, she followed a strict daily schedule of study and service.","zh":"在她的见习期（novitial year）里，她遵循严格的每日学习与服务安排。"},{"en":"The monastery provided novitial instruction before full vows were taken.","zh":"修道院在宣发正式誓愿之前提供见习期培训。"}]}],"synonyms":["novice","beginner","apprentice","neophyte","inexperienced"],"phonetic":"/noʊˈvɪʃəl/","extraExplanation":["“novitial”在现代英语中较少见，更常用的是“novice”（新手）或“novitiate”（见习期；见习修士/修女的群体）。在宗教语境里，“novitial year”可理解为“见习年/初学年”。","词源上与拉丁语“novicius”（新手、初学者）有关，因此核心含义一直围绕“初入门、在训练阶段”。"]}
{"word":"novitiate","summary":{"en":"Novitiate means the training/testing period (or place) for a novice, especially in a religious order; it can also mean any early beginner stage.","zh":"Novitiate 指新手在成为正式成员前的见习/试修期或新手院（尤指修会），也可引申为任何领域的入门阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A period of training and testing when someone is a beginner in a religious order (or sometimes a similar organization) before becoming a full member.","zh":"（修会/宗教团体中）新手的见习期、试修期；在成为正式成员之前的训练与考察阶段。"},"examples":[{"en":"She entered the novitiate to train as a nun.","zh":"她进入修会的新手期，接受成为修女的训练。"},{"en":"During his novitiate, he learned the community’s rules and daily routine.","zh":"在见习期里，他学习团体的规章与日常作息。"}]},{"partOfSpeech":"n.","definition":{"en":"A place or community where novices live and are trained.","zh":"新手院；新手居住并受训练的地方（或团体）。"},"examples":[{"en":"The novitiate was quiet, with a simple schedule of study and work.","zh":"新手院很安静，日程朴素，以学习和劳动为主。"}]},{"partOfSpeech":"n.","definition":{"en":"A beginner stage in any activity or career; apprenticeship (formal or informal).","zh":"（引申）任何领域的初学阶段；学徒期、入门期。"},"examples":[{"en":"In the novitiate of her teaching career, she relied on mentors a lot.","zh":"在她教学生涯的入门期，她非常依赖导师的指导。"},{"en":"He wrote about his novitiate as a journalist in a small-town newspaper.","zh":"他写到自己在小镇报社做记者的入门经历。"}]}],"synonyms":["novicehood","apprenticeship","probationary period","training period"],"phonetic":"/noʊˈvɪʃiət/","extraExplanation":["词源：来自拉丁语 *novicius*（新来的、新手），与 *novice*（新手）同源。*novitiate* 常用于天主教修会语境（如修女、修士/修道士的试修期），也可引申到一般职业或技能的“入门期”。","文化/文学提示：在英语文学或回忆录中，作者有时会用 *novitiate* 来强调一种“被规训、被塑形的初期经历”，比普通的 *beginning* 更带有“训练与考验”的意味。"]}
{"word":"novitiates","summary":{"en":"“Novitiates” means beginners/newcomers, especially (in religious contexts) people in a training period before taking full vows.","zh":"“novitiates”指新手/初学者；尤指（宗教语境中）在正式宣誓前处于见习训练期的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are new to a job, skill, activity, or group and are still learning; beginners.","zh":"新手；初学者；刚加入某个工作、技能、活动或团体、仍在学习的人。"},"examples":[{"en":"The workshop welcomed novitiates and experienced dancers alike.","zh":"这场工作坊欢迎新手和有经验的舞者一起参加。"},{"en":"Novitiates often make mistakes, but that’s part of learning.","zh":"新手常会犯错，但那是学习的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"New members of a religious order who are in a training period before taking full vows.","zh":"（宗教）修会的见习成员；在正式宣誓前接受训练的新成员（修士/修女的见习期）。"},"examples":[{"en":"The novitiates studied the rule of the order each morning.","zh":"这些见习修会成员每天早晨学习会规。"},{"en":"After a year as novitiates, they could choose whether to take vows.","zh":"见习一年后，他们可以选择是否宣誓。"}]}],"synonyms":["novices","beginners","newcomers","trainees","initiates"],"phonetic":"/noʊˈvɪʃiˌeɪts/","extraExplanation":["“novitiates”是复数形式；单数是“novitiate”。在日常语境里，它常被用作比较正式的“beginner / newcomer”的同义词；在宗教语境里更常见，指进入修会后的见习阶段或见习者。","词源来自拉丁语“novus”（新的）。相关词：novice（新手，最常用）、novitiate（见习期/见习者）。"]}
{"word":"novitiateship","summary":{"en":"A novitiateship is the training period when someone is a novice, especially in a religious order.","zh":"novitiateship 指新手的见习/训练阶段，尤指宗教修会中的见习期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The period of training and testing when someone is a novice (especially in a religious order, such as a monastery or convent).","zh":"新手期；见习期（尤指进入修道院/修女会等宗教团体时的培训与考验阶段）。"},"examples":[{"en":"During her novitiateship, she studied the daily rules of the convent.","zh":"在她的见习期里，她学习了修女院的日常规章。"},{"en":"His novitiateship lasted a year before he took his first vows.","zh":"他的见习期持续了一年，之后他宣发了初愿。"}]}],"synonyms":["novitiate","apprenticeship","probationary period"],"phonetic":"/noʊˈvɪʃiətˌʃɪp/","extraExplanation":["“novitiateship”源自“novitiate”（修会中的见习期/初学院阶段）+ “-ship”（表示“状态/时期”，如 friendship）。常见于宗教或历史语境；在一般职场语境中更常用“training period / probationary period（试用期）”来表达类似概念。","相关词：novice（新手；修会见习者）、novitiate（见习期/初学院；见习者的团体）、vow（誓愿）。文学或历史写作里，它常用来强调“从世俗生活过渡到严谨规训”的阶段。"]}
{"word":"novitiation","summary":{"en":"Novitiation means a novice’s training period, especially before joining a religious order fully.","zh":"Novitiation 指见习者的训练与考察期，尤指正式加入修会前的见习期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the period or process of training and testing when someone is a novice, especially before becoming a full member of a religious order","zh":"见习期；初学者的培训与考察过程（尤指加入修会成为正式成员之前）"},"examples":[{"en":"During her novitiation, she studied the rules of the order and worked in the community.","zh":"在见习期里，她学习修会的规章，并在团体中服务。"},{"en":"The monastery required a year of novitiation before final vows.","zh":"修道院要求在立终身誓愿前先有一年的见习期。"}]}],"synonyms":["novitiate","apprenticeship","probation","initiation","training period"],"phonetic":"/noʊˌvɪʃiˈeɪʃən/","extraExplanation":["该词较少见，更常用的是 novice（新手/见习者）与 novitiate（见习期；见习修院/见习团体）。在天主教、圣公会等传统中，“见习期”常用于观察与分辨是否适合长期圣召或团体生活。","词源上与拉丁语 novus（新的）同源，核心意思是“成为新手的阶段”。在非宗教语境里也可泛指“新手阶段”，但使用频率不高。"]}
{"word":"novitious","summary":{"en":"Novitious (rare) means “new/fresh” or “inexperienced, newly initiated.”","zh":"Novitious（罕见）表示“新的/新近的”，也可指“缺乏经验的、刚入门的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) New, recently introduced, or newly started; fresh.","zh":"（罕见/较旧用法）新的；新近出现的；刚开始的；新鲜的。"},"examples":[{"en":"The editor rejected the novitious spelling and kept the standard form.","zh":"编辑否定了这种新出现的拼写方式，保留了标准形式。"},{"en":"They were excited by novitious ideas in science and art.","zh":"他们对科学与艺术中的新思想感到兴奋。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/old-fashioned) Inexperienced; newly initiated (especially in a role, group, or profession).","zh":"（罕见/较旧用法）缺乏经验的；新入门的；新加入（某角色/团体/职业）的。"},"examples":[{"en":"As a novitious teacher, she relied on her mentor for guidance.","zh":"作为一名新入行的老师，她依靠导师的指导。"},{"en":"The novitious recruit made a few predictable mistakes.","zh":"这个新兵犯了几处意料之中的错误。"}]}],"synonyms":["new","fresh","recent","novel","inexperienced","green","novice"],"phonetic":"/noʊˈvɪʃəs/","extraExplanation":["“Novitious”源自拉丁语词根 nov-（意为“新的”），与 novice（新手）、novel（新颖的）、innovate（创新）同源。","该词在现代英语中非常少见，多见于较早期或较正式/文学性的文本；日常表达通常用 “new / fresh / inexperienced / novice”。"]}
{"word":"novity","summary":{"en":"Novity is a rare word meaning “newness” or “something new and unusual,” similar to novelty.","zh":"Novity 是个较罕用的词，意思是“新颖/新鲜感”或“新奇之物”，与 novelty 含义相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Newness; the quality of being new or unfamiliar.","zh":"（罕用）新颖；新鲜感；事物“新的、陌生的”这种特质。"},"examples":[{"en":"Children are often excited by the novity of a new school year.","zh":"孩子们常常会因为新学年的新鲜感而感到兴奋。"},{"en":"The museum’s latest exhibit attracts visitors with its novity.","zh":"博物馆的新展览以其新颖性吸引游客。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A new or unusual thing; something seen as a novelty.","zh":"（罕用）新奇之物；新出现或不寻常的事物（类似 novelty）。"},"examples":[{"en":"At first the device was treated as a novity, not a necessity.","zh":"起初这台设备被当作新奇玩意儿，而不是必需品。"},{"en":"What seemed like a novity soon became part of everyday life.","zh":"曾经看起来很新奇的东西，很快就成了日常生活的一部分。"}]}],"synonyms":["novelty","newness","freshness","innovation"],"phonetic":"/ˈnɑvəti/","extraExplanation":["“novity”在现代英语中非常少见，日常写作与口语更常用的是“novelty”（新奇；新奇事物）。如果你是在作业或正式写作中使用，通常建议改用“novelty”，更自然也更容易被读者理解。","词根来自拉丁语 *novus*（新的），同根词还有：novel（小说/新颖的）、innovate（创新）、nova（新星）。"]}
{"word":"novo","summary":{"en":"“Novo” usually appears in English as a name (brand/place) and comes from Portuguese/Spanish meaning “new.”","zh":"“Novo”在英语里多见于名称（品牌/地名等），源自葡语/西语，意思是“新的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Portuguese/Spanish; often used in names) new; recent; not old.","zh":"（源自葡萄牙语/西班牙语，常用于名称中）新的；最近的；不旧的。"},"examples":[{"en":"The café is called “Novo,” a name meant to suggest something new and modern.","zh":"这家咖啡馆叫“Novo”，这个名字想表达“新”和“现代”的感觉。"},{"en":"Their project uses “novo” in the title to signal a fresh start.","zh":"他们的项目标题里用了“novo”，用来表示一个全新的开始。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for companies, products, or places (e.g., brand names); the meaning often connects to “new.”","zh":"专有名词：用于公司、产品或地名等的名称（如品牌名）；含义常与“新”相关。"},"examples":[{"en":"Novo Nordisk is a Danish pharmaceutical company.","zh":"Novo Nordisk（诺和诺德）是一家丹麦制药公司。"},{"en":"She bought a notebook from a brand called Novo.","zh":"她买了一个名叫 Novo 的品牌的笔记本。"}]}],"synonyms":["new","fresh","modern"],"phonetic":"/ˈnoʊvoʊ/","extraExplanation":["“Novo”来自拉丁语词根 *novus*（新的），因此在葡语/西语里就是“新”。在英语环境中，它多作为品牌名、店名或组织名出现，读音通常英语化。","如果你是在英语写作里直接用 “novo” 表示“新的”，一般会被当作外来词或风格化用法；更常见还是用英语的 new / fresh。"]}
{"word":"novobiocin","summary":{"en":"Novobiocin is an antibiotic mostly used in lab tests and research to study or identify bacteria.","zh":"Novobiocin（新生霉素）是一种抗生素，主要用于实验室检测与研究，用来研究或鉴定细菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibiotic (an aminocoumarin) that inhibits bacterial DNA replication; used mainly in laboratory testing and occasionally in research or specialized medical contexts rather than as a common modern prescription drug.","zh":"新生霉素（novobiocin）：一种抗生素（氨基香豆素类），可抑制细菌DNA复制；如今更多用于实验室检测与研究，临床上较少作为常规处方药使用。"},"examples":[{"en":"The lab used novobiocin to help identify the bacterial species.","zh":"实验室使用新生霉素来帮助鉴定细菌的种类。"},{"en":"Some bacteria are resistant to novobiocin, so the test result matters.","zh":"有些细菌对新生霉素具有耐药性，所以检测结果很关键。"},{"en":"Researchers studied how novobiocin affects DNA replication in bacteria.","zh":"研究人员研究了新生霉素如何影响细菌的DNA复制。"}]}],"synonyms":["antibiotic","aminocoumarin antibiotic"],"phonetic":"/ˌnoʊvoʊˈbaɪəsɪn/","extraExplanation":["在微生物学里，novobiocin 常用于“新生霉素敏感/耐药试验”（novobiocin test）。一个经典应用是区分两种常见的凝固酶阴性葡萄球菌：腐生葡萄球菌（Staphylococcus saprophyticus）通常对新生霉素耐药，而表皮葡萄球菌（Staphylococcus epidermidis）通常敏感。","作用机制常被描述为抑制细菌DNA旋转酶（DNA gyrase）等与DNA复制相关的酶，从而阻断细菌DNA复制。由于安全性与替代药物等原因，它在现代临床治疗中并不算常用抗生素。"]}
{"word":"novocain","summary":{"en":"Novocain is a local anesthetic commonly associated with dental numbing; it can also be used figuratively to mean “numb.”","zh":"Novocain（诺沃卡因）常指牙科用的局部麻醉药，也可引申为“麻木、迟钝”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local anesthetic (pain‑numbing medicine), especially the kind used by dentists to numb part of your mouth","zh":"局部麻醉药（止痛/麻木药），尤指牙科常用来麻痹口腔局部的麻药"},"examples":[{"en":"The dentist gave me Novocain before filling the cavity.","zh":"牙医在补牙前给我打了诺沃卡因（麻药）。"},{"en":"My lip stayed numb for hours after the Novocain wore off.","zh":"麻药（诺沃卡因）退了以后，我的嘴唇还麻了好几个小时。"},{"en":"He spoke slowly, as if he were on Novocain.","zh":"他说话很慢，像是打了麻药一样麻木。"}]}],"synonyms":["local anesthetic","numbing agent","procaine"],"phonetic":"ˈnoʊvəˌkeɪn","extraExplanation":["“Novocain”原本是一个商标名（常写作 Novocain）。在美国口语里，人们常用它泛指“牙科麻药”。","严格来说，Novocain指的是“普鲁卡因（procaine）”，但现代牙科更常用的是利多卡因（lidocaine）等药物。人们仍会习惯性地说“Novocain”。","引申用法里，“on Novocain / like Novocain”可以形容情绪或反应“麻木、迟钝”，带一点夸张的口语色彩。"]}
{"word":"novocaine","summary":{"en":"Novocaine is a local anesthetic (often used as a general term) that numbs an area, commonly used by dentists.","zh":"Novocaine（诺沃卡因）是局部麻醉药（常被当作泛称），用来让局部麻木，牙科最常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name (often used generally) for a local anesthetic used to numb a specific area of the body, especially in dental work","zh":"（商标名，常泛指）局部麻醉药，用于让身体某个部位暂时失去痛觉，尤其常用于牙科治疗"},"examples":[{"en":"The dentist gave me novocaine before filling the cavity.","zh":"牙医在补牙前给我打了诺沃卡因（局部麻醉）。"},{"en":"I can feel pressure, but the novocaine keeps it from hurting.","zh":"我能感觉到压力，但诺沃卡因让它不疼。"}]}],"synonyms":["local anesthetic","anesthetic","numbing agent"],"phonetic":"/ˈnoʊvəˌkeɪn/","extraExplanation":["“Novocaine”原本是普鲁卡因（procaine）的商品名。在美国口语里，人们常把任何牙科用的局部麻醉都叫“novocaine”，但现在牙科更常用的是利多卡因（lidocaine）等药物。","发音中“-caine”常见于麻醉药名（如 lidocaine, cocaine），看到这个词尾通常可以联想到“麻醉/止痛”。"]}
{"word":"novodamus","summary":{"en":"“Novodamus” is not standard; it usually refers to Nostradamus, a famous figure associated with prophecies and predictions.","zh":"“novodamus”不是标准词；通常是指诺查丹玛斯（Nostradamus），一个常与预言和预测联系在一起的人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often meant as) Nostradamus: a famous 16th‑century French writer of prophecies, often mentioned when people talk about predictions of the future.","zh":"（通常是指）诺查丹玛斯：16世纪法国的“预言”作者，常在谈论对未来的预测时被提到。"},"examples":[{"en":"People joked that he was “like Nostradamus” because he guessed the result correctly.","zh":"大家开玩笑说他“像诺查丹玛斯一样”，因为他猜对了结果。"},{"en":"Some websites claim Nostradamus predicted modern events, but many of these readings are debated.","zh":"一些网站声称诺查丹玛斯预言了现代事件，但这些解读争议很大。"}]}],"synonyms":["seer","prophet","fortune-teller"],"phonetic":"/ˌnɑstrəˈdæməs/","extraExplanation":["“novodamus”不是常见英文词，网络上多为对“Nostradamus”的误拼/谐写。标准写法是Nostradamus（中文常译“诺查丹玛斯”）。","Nostradamus（1503–1566）以《百诗集》（Les Prophéties）闻名，文字写得含混、象征性强，因此后人常把各种事件“对号入座”式地解释为预言。","英语里把某人比作“Nostradamus”，通常是半开玩笑地说此人“神预测”“料事如神”，语气可能带一点夸张或讽刺。"]}
{"word":"novorolsky","summary":{"en":"“Novorolsky” is most likely a proper name (surname or place name), not a common English word.","zh":"“Novorolsky”多半是专有名词（姓氏或地名），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (likely a surname or place name). It is not a standard English vocabulary word, and its meaning depends on the person, family, or location it refers to.","zh":"一个较少见的专有名词（很可能是姓氏或地名）。它不是常见的英语词汇，具体含义取决于所指的人、家族或地点。"},"examples":[{"en":"I couldn’t find “Novorolsky” in an English dictionary; it may be a surname.","zh":"我在英文词典里找不到“Novorolsky”；它可能是一个姓。"},{"en":"Could you tell me where you saw the name Novorolsky—on a document, a map, or a website?","zh":"你是在哪里看到 Novorolsky 这个名字的——文件、地图还是网站？"}]}],"phonetic":"/ˌnoʊvəˈroʊlski/","extraExplanation":["“Novorolsky”看起来像斯拉夫语系（如俄语、乌克兰语、波兰语等）转写成拉丁字母的姓名/地名拼写，但该拼写在英语语料中不常见，因此难以给出确定词源与含义。","如果你能提供上下文（例如出现的句子、国家/地区、是否为人名或地名），我可以更准确地判断它可能对应的标准拼写（例如 -sky/-ski 结尾的姓氏变体）以及更自然的英文读法。"]}
{"word":"novum","summary":{"en":"Novum means a new thing or idea; in science-fiction criticism, it refers to the central “new element” that makes the story’s world different.","zh":"novum 指新事物或新觀念；在科幻批評中，它也指作品讓世界觀產生關鍵差異的核心「新元素」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A new thing, idea, or discovery; something novel (often used in academic or literary contexts).","zh":"新事物；新觀念；新發現（常見於學術或文學語境）。"},"examples":[{"en":"The paper highlights the novum of the method: it measures stress without invasive sensors.","zh":"這篇論文強調這個方法的「新意」：它能在不使用侵入式感測器的情況下測量壓力。"},{"en":"Many inventions once seemed like a novum until they became everyday tools.","zh":"許多發明一開始都像是新奇事物，直到後來成為日常工具。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary criticism, especially science fiction) The key “new element” in a story—an innovation or change (often technological or social) that makes the fictional world meaningfully different from our own.","zh":"（文學批評，尤指科幻）作品中的核心「新元素」：一種創新或變化（常是科技或社會制度），使虛構世界與現實世界產生關鍵差異。"},"examples":[{"en":"In classic science fiction, the novum might be faster-than-light travel.","zh":"在經典科幻中，核心新元素可能是超光速旅行。"},{"en":"The critic argues that the novel’s novum is a society governed by transparent algorithms.","zh":"評論者認為這部小說的核心新元素是一個由透明演算法治理的社會。"},{"en":"A strong novum can reshape the plot and also challenge the reader’s assumptions.","zh":"有力的核心新元素不只改變情節，也能挑戰讀者的既有想法。"}]}],"synonyms":["novelty","innovation","new element","breakthrough","new development"],"phonetic":"/ˈnoʊvəm/","extraExplanation":["「novum」源自拉丁文，字面意思是「新的事物」。在英文中屬於較少見、偏學術的借詞。","在科幻研究中，常與學者 Darko Suvin（達爾科・蘇文）的概念連結：novum 指作品裡那個讓世界「可被想像為不同」的關鍵創新點，並常與理性推演（而非純魔法）相呼應。"]}
{"word":"Novus","summary":{"en":"Novus: Latin for “new”; often used in mottos, formal names, or titles.","zh":"Novus：拉丁语“新的”；常见于格言、正式名称或标题中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"“Novus” is Latin for “new” (masculine singular form). It’s often seen in mottos, academic names, or formal/Latin-style writing.","zh":"“Novus”是拉丁语，意思是“新的”（阳性单数形式）。常见于格言、学术名称或带拉丁语风格的正式表达中。"},"examples":[{"en":"The motto uses the Latin word “novus” to emphasize a new beginning.","zh":"这句格言用拉丁词“novus”来强调一个新的开始。"},{"en":"In Latin, “novus” means “new.”","zh":"在拉丁语里，“novus”的意思是“新的”。"}]},{"partOfSpeech":"n.","definition":{"en":"A name/title using the Latin word “Novus” (for example, a brand name, project name, or part of a proper noun).","zh":"用拉丁词“Novus”构成的名称/标题（例如品牌名、项目名或专有名词的一部分）。"},"examples":[{"en":"They called the initiative “Project Novus” to signal change.","zh":"他们把这项计划命名为“Project Novus”，用来表达变革。"}]}],"synonyms":["new","fresh","modern"],"phonetic":"/ˈnoʊ.vəs/","extraExplanation":["“Novus”是拉丁语形容词，会随名词的性、数、格变化：如阴性“nova”，中性“novum”。所以你可能会在不同场景看到不同形式。","它常出现在拉丁短语中，例如“novus ordo”（新秩序）。美国一美元纸币背面的格言“Novus Ordo Seclorum”常被译为“时代的新秩序”。"]}
{"word":"novus","summary":{"en":"Novus is a Latin word meaning “new,” mainly used in mottos, academic, or formal contexts in English.","zh":"Novus 是拉丁语，意为“新的”，在英语中主要出现在格言、学术或正式语境里。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in English contexts) new; fresh; recent.","zh":"（拉丁语，在英语语境中使用）新的；新鲜的；近期的。"},"examples":[{"en":"The motto uses the Latin word novus to suggest a new beginning.","zh":"这句格言用拉丁词 novus 来表达“新的开端”。"},{"en":"In some scientific names, novus can indicate a newly identified species or form.","zh":"在一些科学命名中，novus 可用来表示新发现的物种或类型。"}]}],"synonyms":["new","novel","fresh","recent"],"phonetic":"/ˈnoʊ.vəs/","extraExplanation":["“Novus”是拉丁语“新”的意思，英语里多见于校训、徽章、法律或学术写作中的拉丁短语，而不是日常口语用词。","常见搭配：novus ordo seclorum（“时代的新秩序”，见于美国国玺背面铭文之一）；novus homo（古罗马政治语境中“新贵/白手起家进入高位的人”）。","发音在英语语境中通常英语化为 /ˈnoʊvəs/（读起来像“NOH-vuhs”），不同学校或传统也可能有略微差异。"]}
