{"word":"nox","summary":{"en":"“Nox” can mean “night” (from Latin). In science, NOx refers to nitrogen oxides (air pollutants).","zh":"“nox”可指“夜晚”（源自拉丁语）。在科学语境中，NOx 指“氮氧化物”（一类空气污染物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"night (a Latin word, sometimes used in names, literature, or mottos)","zh":"夜晚（拉丁语词，有时用于名字、文学或格言中）"},"examples":[{"en":"In Latin, “nox” means “night.”","zh":"在拉丁语里，“nox”的意思是“夜晚”。"},{"en":"The poem uses “nox” to give the line a classical feeling.","zh":"这首诗用“nox”让诗句带有古典气息。"}]},{"partOfSpeech":"n.","definition":{"en":"nitrogen oxides (a group of air pollutants), usually written as NOx","zh":"氮氧化物（会造成空气污染的一类气体），通常写作 NOx"},"examples":[{"en":"Cars produce NOx, which can contribute to smog.","zh":"汽车会排放 NOx，这可能导致烟雾（雾霾）形成。"},{"en":"The new rules aim to reduce NOx emissions.","zh":"新规定旨在减少 NOx 排放。"}]}],"synonyms":["night","darkness","NOx"],"phonetic":"/nɑks/","extraExplanation":["“Nox”在英语里不算常见的日常词汇，更常出现在拉丁文引用、校训、纹章、文学作品或角色/品牌命名中，用来营造“古典、神秘、夜色”的氛围。","环境与化学语境中更常见的是写作“NOx”（字母 N 和 O 加下标 x 的概念），指多种氮氧化物的总称；读写时通常说“en-oh-ex”。"]}
{"word":"noxa","summary":{"en":"Noxa is a mainly medical term meaning a harmful agent or stimulus that can cause injury or disease.","zh":"Noxa 主要是医学术语，指会造成损伤或疾病的有害因子/刺激。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a harmful agent or stimulus that can cause injury or disease (used mainly in medicine and biology)","zh":"（主要用于医学与生物学）有害因子；致病/致伤的刺激或物质"},"examples":[{"en":"In pathology, a noxa can be a chemical, a microbe, or radiation that damages tissue.","zh":"在病理学中，noxa 可以是化学物质、微生物或辐射等，会损伤组织。"},{"en":"The doctor explained that removing the noxa is the first step in treatment.","zh":"医生解释说，去除有害因子是治疗的第一步。"}]},{"partOfSpeech":"n.","definition":{"en":"harm or injury (rare; from Latin usage)","zh":"伤害；损害（较少见，源自拉丁语用法）"},"examples":[{"en":"The text uses noxa to refer to harm done to the body.","zh":"该文本用 noxa 来指对身体造成的伤害。"}]}],"synonyms":["harmful agent","noxious agent","toxin","pathogen","irritant"],"phonetic":"/ˈnɑksə/","extraExplanation":["noxa 源自拉丁语，核心意思是“伤害/损害”。现代英语中多出现在医学、免疫学或病理学语境里，指“导致疾病或组织损伤的有害因素”。","常见搭配与近义表达：noxious agent（有害因子）、pathogen（病原体）、toxin（毒素）、irritant（刺激物）。日常英语里更常用这些词，noxa 更偏学术/专业。"]}
{"word":"noxal","summary":{"en":"Noxal is a rare legal adjective meaning “related to a wrongdoing or injury,” especially in historical (Roman-law) discussions of responsibility for another’s act.","zh":"noxal 是较少见的法律形容词，意为“与不法行为或侵害有关”，常用于（罗马法等）历史语境中讨论为他人行为承担责任。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Law, rare) Relating to a wrongdoing or injury (a “noxal act”), especially one committed by a person or animal for whom someone else may be held responsible.","zh":"（法律用语，较少见）与不法行为或侵害有关的；尤指由他人（如奴隶、家属）或动物造成、可能使其监护人/主人承担责任的侵害行为（“noxal act”）。"},"examples":[{"en":"In Roman law, a master could be liable for a slave’s noxal act.","zh":"在罗马法中，主人可能要为奴隶的侵害行为（noxal act）承担责任。"},{"en":"The textbook briefly mentions noxal liability in historical legal systems.","zh":"这本教材简要提到历史法律体系中的“noxal责任”。"}]}],"synonyms":["tortious","wrongful","injurious"],"phonetic":"/ˈnɑːksəl/","extraExplanation":["“noxal”多见于历史法学语境，源自拉丁语 *noxa*（伤害、过错）。“noxal liability”（noxal 责任）常用来讨论罗马法中的一种观念：当奴隶、家属或动物造成损害时，由其主人/家长承担责任，或以交出致害者/动物来替代赔偿（相关概念常被称为 *noxae deditio*）。","现代英语里它非常少用；日常写作更常用的表达是 *wrongful act*（不法行为）、*tortious act*（侵权行为）或 *liability*（责任）。"]}
{"word":"noxally","summary":{"en":"“Noxally” is not recognized as a standard English word; it’s likely a misspelling (often of “noxiously” or “nasally”).","zh":"“noxally”不是标准英语词；多半是拼写错误（常见为“noxiously”或“nasally”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a mistaken form. In context, people often mean “noxiously” (in a harmful/toxic way) or “nasally” (with a nasal sound).","zh":"不是标准英语单词；更可能是拼写错误或误写形式。结合语境，人们常想表达的是“noxiously”（以有害/有毒的方式）或“nasally”（带鼻音地）。"},"examples":[{"en":"If you meant “noxiously”: The factory was noxiously polluting the river.","zh":"如果你想写“noxiously”：那家工厂正以有毒有害的方式污染河流。"},{"en":"If you meant “nasally”: He spoke nasally because he had a cold.","zh":"如果你想写“nasally”：他因为感冒说话带鼻音。"}]}],"synonyms":["noxiously","toxically","harmfully","nasally"],"phonetic":"/ˈnɑksəli/","extraExplanation":["“nox-”这个词根来自拉丁语，和“伤害/有害”有关（如 noxious = 有害的）。如果你的句子想表达“有毒地/有害地”，通常用 noxiously。","如果你能把包含“noxally”的原句贴出来，我可以根据语境判断你最可能想用的正确词，并帮你改写。"]}
{"word":"noxial","summary":{"en":"“Noxial” is usually a misspelling of **noxious**, meaning harmful, poisonous, or very unpleasant (especially smells or gases).","zh":"“noxial”通常是 **noxious** 的误拼，意思是有害的、有毒的，或（尤指气味/气体）令人非常不适的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled **noxious**) Harmful, poisonous, or very unpleasant (often used for smells, gases, or substances).","zh":"（常见拼写为 **noxious**）有害的；有毒的；（气味等）令人作呕的、难闻的。"},"examples":[{"en":"The factory released noxious fumes into the air.","zh":"工厂向空气中排放了有害烟雾。"},{"en":"There was a noxious smell coming from the trash can.","zh":"垃圾桶里飘出一股难闻的气味。"},{"en":"Some noxious chemicals must be stored carefully.","zh":"一些有毒化学品必须小心存放。"}]}],"synonyms":["harmful","toxic","poisonous","nasty","foul","offensive"],"phonetic":"/ˈnɑkʃəs/","extraExplanation":["“noxial” 不是常见标准拼写，通常你想找的是 **noxious**。","词源上与拉丁语 *noxa*（伤害、罪过）有关，所以它常与“对健康/环境造成伤害”的语境搭配。","常见搭配：**noxious fumes/gases**（有害烟雾/气体）、**noxious chemicals**（有毒化学品）、**noxious odor/smell**（难闻气味）。注意它比一般的“bad smell（臭）”更强调“有害/有毒或强烈令人不适”。"]}
{"word":"noxious","summary":{"en":"Noxious means harmful or poisonous, and it can also mean extremely unpleasant or offensive.","zh":"noxious 指“有害/有毒的”，也可指“极其难闻或令人反感的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harmful, poisonous, or dangerous to health (often describing gases, chemicals, smoke, or pollution).","zh":"有害的；有毒的；危害健康的（常形容气体、化学品、烟雾或污染）。"},"examples":[{"en":"Workers must wear masks to avoid breathing noxious fumes.","zh":"工人必须戴口罩，避免吸入有害的烟雾。"},{"en":"The factory released noxious gases into the air.","zh":"工厂向空气中排放了有害气体。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very unpleasant or offensive (often describing a smell, taste, or behavior).","zh":"令人极不愉快的；令人厌恶的（常形容气味、味道或行为）。"},"examples":[{"en":"There was a noxious smell coming from the trash can.","zh":"垃圾桶里飘出一股令人作呕的臭味。"},{"en":"He stopped making noxious comments during the meeting.","zh":"他在会议上不再发表令人反感的言论。"}]}],"synonyms":["harmful","toxic","poisonous","nasty","foul","offensive"],"phonetic":"/ˈnɑkʃəs/","extraExplanation":["词源上与“harm（伤害）”的概念相关，常用于较正式的语境，尤其是环境、公共健康与安全场景（如 noxious fumes/chemicals/weed）。","搭配很固定：noxious + fumes/gases/smoke/chemicals/odor（有害烟雾/气体/烟/化学物质/臭味）。语气比 “bad” 更强，暗示“可能造成伤害”。"]}
{"word":"noxiously","summary":{"en":"“Noxiously” means “in a harmful or very unpleasant way,” especially about fumes, smells, or toxic effects.","zh":"“noxiously”表示“以有害或令人极不舒服的方式”，常用于形容有毒烟雾、气味或有害影响。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a harmful, poisonous, or very unpleasant way (often describing smells, fumes, chemicals, or behavior).","zh":"以有害的、有毒的或令人极不舒服的方式（常形容气味、烟雾、化学物质或行为）。"},"examples":[{"en":"The factory smoke drifted noxiously over the neighborhood.","zh":"工厂的烟雾带着刺鼻有害的味道飘到社区上空。"},{"en":"A noxiously sweet odor filled the room.","zh":"房间里弥漫着一种甜得发腻、令人不适的气味。"},{"en":"He spoke noxiously about others, trying to ruin their reputations.","zh":"他说起别人时语气恶毒，试图毁掉他们的名声。"}]}],"synonyms":["harmfully","poisonously","toxically","offensively","foully"],"phonetic":"ˈnɑkʃəsli","extraExplanation":["“noxiously”来自形容词“noxious”（有毒的/有害的/令人作呕的），更常见的搭配是“noxious fumes/gas/smell（有毒气体/气味）”。“noxiously”在日常口语里不算高频，写作中常用来强调“有害到让人难以忍受”的程度。","词源上与拉丁语“noxa”（伤害、罪过）有关，因此它除了指“有毒”，也可引申为“有害、带恶意”。"]}
{"word":"noxiousness","summary":{"en":"Noxiousness means the quality of being harmful, poisonous, or very unpleasant.","zh":"Noxiousness 指“有害性/毒性/令人不适的性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being harmful, poisonous, or very unpleasant (especially to health or the environment)","zh":"有害性；毒性；令人不适的性质（尤指对健康或环境有害）"},"examples":[{"en":"The report warned about the noxiousness of the fumes in poorly ventilated rooms.","zh":"报告警告说，在通风不良的房间里，烟雾的有害性很高。"},{"en":"Residents complained about the noxiousness of the smell coming from the factory.","zh":"居民抱怨工厂传来的气味令人作呕、非常刺鼻。"}]}],"synonyms":["toxicity","harmfulness","poisonousness","noxious quality"],"phonetic":"/ˈnɑkʃəsnəs/","extraExplanation":["“noxiousness”来自形容词“noxious”（有毒的、有害的、令人不适的），再加上名词后缀“-ness”，表示“某种性质/程度”。因此它更偏向书面语或正式语境（如环境报告、医学/安全说明）。","常见搭配：the noxiousness of fumes/gases/chemicals（烟雾/气体/化学品的毒性/有害性）；reduce/minimize noxiousness（降低有害性）。"]}

