{"word":"nozi","summary":{"en":"“Nozi” isn’t standard English; it usually refers to “nosy.”","zh":"“nozi”不是标准英文词，通常指“nosy（爱打听）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“nozi” is not a standard English word. It is most often seen as a misspelling or stylized spelling of “nosy” (too interested in other people’s private business).","zh":"“nozi”不是标准英语单词。它最常见于对“nosy”（爱打听、爱管闲事）的拼写错误或风格化拼写。"},"examples":[{"en":"Do you mean “nosy”? For example: “He’s so nosy—always asking personal questions.”","zh":"你是不是想写“nosy”？例如：“他很爱打听——总是问别人隐私问题。”"},{"en":"I saw “nozi” in a username, but in normal writing people use “nosy.”","zh":"我在用户名里见过“nozi”，但在正常写作中一般用“nosy”。"}]}],"synonyms":["nosy","curious (about others’ business)","inquisitive"],"phonetic":"/ˈnoʊzi/","extraExplanation":["如果你是在特定语境（比如游戏ID、品牌名、日语罗马字、昵称）里看到“nozi”，它也可能是专有名词或自造词，不一定有固定英文释义。你可以把原句/截图发我，我能按上下文判断。"]}
{"word":"nozzle","summary":{"en":"A nozzle is the part at the end of a device that directs or sprays a flow (like water, air, or fuel).","zh":"nozzle 指装置末端用于引导或喷射液体/气体等的“喷嘴/喷口”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short tube or spout on the end of something that directs, controls, or sprays a flow of liquid, gas, or powder.","zh":"（装置末端的）喷嘴；喷口；（用于引导、控制或喷射液体、气体或粉末的）短管/嘴"},"examples":[{"en":"Attach the nozzle to the hose before you turn on the water.","zh":"开水之前先把喷嘴接到水管上。"},{"en":"The spray bottle’s nozzle was clogged, so nothing came out.","zh":"喷雾瓶的喷嘴堵住了，所以喷不出来。"},{"en":"The firefighter adjusted the nozzle to change the water pressure.","zh":"消防员调节喷嘴来改变水压。"}]},{"partOfSpeech":"v.","definition":{"en":"To fit with or provide a nozzle; or to spray using a nozzle (less common).","zh":"给……装喷嘴；用喷嘴喷射（较不常用）"},"examples":[{"en":"The technician nozzled the line to reduce splashing.","zh":"技术员给管线装了喷嘴以减少飞溅。"},{"en":"They nozzled the chemicals carefully into the container.","zh":"他们小心地用喷嘴把化学品喷入容器中。"}]}],"synonyms":["spout","sprayer","jet","tip","mouthpiece"],"phonetic":"/ˈnɑzəl/","extraExplanation":["“Nozzle”常见于日常用品（花园水管喷头、喷雾瓶、油枪）和工业/工程语境（燃气涡轮、火箭发动机喷管）。在工程里，喷嘴常用于“让流体更集中、更快或更细雾化”，所以你会看到如 fuel nozzle（燃油喷嘴）、spray nozzle（喷雾喷嘴）、rocket nozzle（火箭喷管）等搭配。"]}
{"word":"nozzler","summary":{"en":"Nozzler usually means a nozzle attachment/device, and less commonly a person who operates a spray nozzle.","zh":"Nozzler 通常指喷嘴配件/装置；较少见地也可指操作喷嘴的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or attachment that has a nozzle, or a nozzle component used to control the direction/flow of liquid or gas (often for spraying)","zh":"带喷嘴的装置或配件；用于控制液体或气体流向/流量的喷嘴部件（常用于喷洒）"},"examples":[{"en":"The gardener replaced the nozzler to get a finer mist.","zh":"园丁更换了喷嘴配件，以喷出更细的雾状水。"},{"en":"This cleaner works best with a wide-angle nozzler.","zh":"这种清洁剂配合广角喷嘴更好用。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, less common) a person who operates or uses a spray nozzle, especially on a hose","zh":"（非正式、较少见）操作或使用喷嘴的人，尤指使用水管喷头的人"},"examples":[{"en":"On the fire crew, she was the main nozzler on the hose line.","zh":"在消防队里，她是水带线上的主要喷头操作员。"},{"en":"Ask the nozzler to reduce the pressure before you start painting.","zh":"开始喷漆前，让喷枪操作员先把压力调低。"}]}],"synonyms":["nozzle attachment","nozzle tip","sprayer","hose operator"],"phonetic":"/ˈnɑzlər/","extraExplanation":["“nozzler”并不是非常常见的标准词，更常见的是“nozzle”（喷嘴）或“nozzle attachment / nozzle tip”（喷嘴配件/喷头）。它属于用“-er”构成名词的方式：表示“做某事的人”或“用于某事的东西”。","有时人们会把“nozzler”误写成“nuzzler”（依偎/亲昵的人或动物）。如果你想表达“依偎、蹭蹭”，通常用“nuzzle”/“nuzzler”。"]}
{"word":"nozzles","summary":{"en":"Nozzles are the parts (spouts/tips) that liquids or gases come out of, controlling how they flow or spray.","zh":"Nozzles 指喷嘴/喷头等出口部件，用来控制液体或气体的流出、喷射方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nozzle: a short tube or spout that controls the direction and/or speed of a liquid, gas, or spray (this form is plural: more than one nozzle).","zh":"喷嘴；喷头；喷管：用于控制液体、气体或喷雾的方向和/或流速的短管或出口（此处为复数：多个喷嘴）。"},"examples":[{"en":"The firefighter attached two nozzles to the hose for different spray patterns.","zh":"消防员在水带上装了两个喷嘴，用于不同的喷射形状。"},{"en":"Check the printer nozzles if the colors look faded.","zh":"如果颜色看起来变淡了，检查一下打印机喷头。"},{"en":"The chef replaced the bottle nozzles to pour the sauce more neatly.","zh":"厨师更换了瓶口喷嘴，让酱汁倒得更干净利落。"}]}],"synonyms":["spouts","spray tips","jets","sprayers"],"phonetic":"/ˈnɑzəlz/","extraExplanation":["“Nozzle”常见于工程与日常用品语境：如水枪喷嘴、喷雾瓶喷头、火箭/喷气发动机喷管、3D打印机/打印机喷头等。不同喷嘴形状会影响“喷射角度、压力与雾化效果”。","在口语里偶尔可见比喻用法（不如本义常见），例如把“信息/指令的输出端”比作nozzle，强调“从某个出口喷出/释放”。"]}
