{"word":"ny","summary":{"en":"NY usually means New York—officially the U.S. state, and informally New York City depending on context.","zh":"NY 通常指“纽约”：正式多指纽约州；在非正式语境中也可指纽约市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for New York (the U.S. state), often used in addresses, maps, and news.","zh":"纽约州（美国）的缩写，常用于地址、地图和新闻等语境。"},"examples":[{"en":"I live in Albany, NY.","zh":"我住在纽约州奥尔巴尼。"},{"en":"The package was shipped to NY yesterday.","zh":"包裹昨天寄到纽约州了。"}]},{"partOfSpeech":"other","definition":{"en":"Informal short form for New York City, especially in casual writing or branding.","zh":"（非正式）纽约市的简称，常见于口语、随意写作或品牌用法。"},"examples":[{"en":"We’re visiting NY next week to see a Broadway show.","zh":"我们下周去纽约看一场百老汇演出。"},{"en":"NY summers can be hot and humid.","zh":"纽约的夏天可能又热又潮。"}]}],"synonyms":["New York","N.Y."],"phonetic":"/ˌɛn ˈwaɪ/","extraExplanation":["在正式英文地址里，“NY”是美国邮政（USPS）规定的州缩写，专指纽约州；如果要明确“纽约市”，地址中通常写“New York, NY”（城市 New York + 州 NY）。","在口语里读作字母音“en-wy”。在社交媒体或潮流语境中，“NY”也常与纽约市的文化形象相关（例如时尚、金融、百老汇等）。"]}
{"word":"nyala","summary":{"en":"Nyala usually means a type of African antelope; in Malay/Indonesian it can mean “flame.”","zh":"Nyala 通常指一种非洲羚羊（林羚）；在马来语/印尼语中也可指“火焰/燃烧”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medium-sized African antelope with spiral horns (in males) and white stripes on its body; it lives mostly in dense woodland and river forests in southeastern Africa.","zh":"（非洲）林羚（雄性有螺旋状角，身上有白色条纹）；多生活在东南部非洲的密林与河岸森林中。"},"examples":[{"en":"We spotted a nyala at the edge of the forest, moving quietly through the brush.","zh":"我们在森林边缘看见一只林羚，安静地穿过灌木丛。"},{"en":"Male nyala are darker and have long, twisted horns.","zh":"雄性林羚颜色更深，而且长着又长又扭曲的角。"}]},{"partOfSpeech":"other","definition":{"en":"(not standard English) a Malay/Indonesian word meaning “flame” or “to flare up,” often seen in phrases like “nyala api” (“flames of fire”).","zh":"（非标准英语）马来语/印尼语词，意为“火焰/燃烧、闪耀”，常见于“nyala api”（火焰）等表达。"},"examples":[{"en":"In Indonesian, “nyala api” means “flames,” not an English phrase.","zh":"在印尼语里，“nyala api”是“火焰”的意思，但它不是英语短语。"}]}],"synonyms":["antelope"],"phonetic":"/naɪˈɑːlə/","extraExplanation":["在英语语境里，**nyala**最常见的是动物名（林羚），属于较少见的词；多出现在自然纪录片、野生动物文章或旅游介绍中。","这个词来自祖鲁语等南部非洲语言的动物名称，后来进入英语，用作特定物种的名称。"]}
{"word":"nyalas","summary":{"en":"“nyalas” isn’t standard English; it’s likely Hungarian (nyálas), meaning “sappy/overly sentimental” or literally “slobbery.”","zh":"“nyalas”不是常见英语词；多半来自匈牙利语（nyálas），可指“矫情/肉麻”，也可字面指“满是口水、黏糊糊的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard English) In Hungarian, **nyálas** means “overly sentimental or sappy,” sometimes implying something feels cheesy or fake-sweet.","zh":"（非标准英语）在匈牙利语中，**nyálas（原写作 nyálas）**可表示“过于多愁善感/矫情”，常带有“肉麻、腻”的贬义。"},"examples":[{"en":"That movie is too nyalas for me—I prefer something more realistic.","zh":"那部电影对我来说太“矫情/肉麻”了——我更喜欢更写实的。"},{"en":"He wrote a nyalas love poem that made everyone cringe.","zh":"他写了一首很肉麻的情诗，把大家都尬住了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Not standard English) In Hungarian, **nyálas** can also literally mean “slobbery/drooly,” related to saliva.","zh":"（非标准英语）在匈牙利语中，**nyálas**也可字面指“满是口水的/流口水的、黏糊糊的”。"},"examples":[{"en":"The baby’s face was nyalas after drinking milk.","zh":"宝宝喝完奶后脸上都是口水，黏黏的。"},{"en":"Wipe that nyalas spot off the table.","zh":"把桌子上那块黏糊糊的口水印擦掉。"}]}],"synonyms":["sappy","sentimental","schmaltzy","syrupy","cheesy","slobbery","drooly"],"phonetic":"/ˈnɑlɑs/","extraExplanation":["“nyalas”一般不是英语单词；更常见的形式是匈牙利语 **nyálas**（中间的 á 表示长元音）。它既可形容“感情表达过头、很肉麻”，也可指“有口水的、黏糊”。如果你是在英语语境里看到 nyalas，可能是外来词、昵称/姓氏，或拼写误差；给我一句原句我可以帮你判断。"]}
{"word":"nyamwezi","summary":{"en":"Nyamwezi refers to a major ethnic group in Tanzania and can also describe their language and culture.","zh":"Nyamwezi 指坦桑尼亚的重要民族——尼亚姆韦齐族，也可用来形容其语言与文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bantu-speaking ethnic group from central-western Tanzania; a member of this group","zh":"坦桑尼亚中西部的班图语族民族——尼亚姆韦齐族；尼亚姆韦齐族成员"},"examples":[{"en":"The Nyamwezi are well known in East African history as long-distance traders.","zh":"在东非历史中，尼亚姆韦齐人以长途贸易闻名。"},{"en":"He is Nyamwezi by heritage, though he grew up in the city.","zh":"他有尼亚姆韦齐族血统，不过在城市长大。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Nyamwezi people, their language, or their culture","zh":"与尼亚姆韦齐族、其语言或文化有关的"},"examples":[{"en":"She is learning Nyamwezi songs for a cultural event.","zh":"她正在学习尼亚姆韦齐族歌曲，准备参加文化活动。"},{"en":"The museum has a small collection of Nyamwezi artifacts.","zh":"博物馆里有一小批尼亚姆韦齐族文物。"}]}],"synonyms":["Wanyamwezi (plural, common in Swahili contexts)","Mnyamwezi (singular, less common)"],"phonetic":"/ˌnjɑmˈweɪzi/","extraExplanation":["Nyamwezi 通常指坦桑尼亚的族群（people），也可作形容词表示“尼亚姆韦齐的”。在学术或新闻语境里也会用来指他们的语言（尼亚姆韦齐语，属班图语支）。","词源上常被解释为与“月亮（mwezi）”有关，有时被释为“月亮之民/来自月亮的人”；不同资料对细节可能略有差异。","更常见的复数形式是 Wanyamwezi（指“尼亚姆韦齐人们”）；单数可见 Mnyamwezi（指“一位尼亚姆韦齐人”）。"]}
{"word":"nyanja","summary":{"en":"Nyanja is mainly the name of a Bantu language in southern Africa; in some related languages it also means “lake.”","zh":"Nyanja主要指非洲南部的一种班图语言；在一些相关语言中也可表示“湖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bantu language spoken mainly in Malawi and also in parts of Zambia, Mozambique, and Zimbabwe; often closely associated with (and sometimes used interchangeably with) Chichewa.","zh":"尼扬贾语（Nyanja）：一种班图语系语言，主要在马拉维使用，也见于赞比亚、莫桑比克和津巴布韦部分地区；常与“齐切瓦语（Chichewa）”关系密切，日常中有时会混用该名称。"},"examples":[{"en":"She speaks Nyanja at home and English at school.","zh":"她在家说尼扬贾语，在学校说英语。"},{"en":"The radio program includes news in Nyanja.","zh":"这档广播节目包含尼扬贾语新闻。"}]},{"partOfSpeech":"n.","definition":{"en":"(from some Bantu languages) a lake; used in place names (for example, Lake Malawi is also called Lake Nyasa, related to the word “nyanja”).","zh":"（源自一些班图语言）“湖”的意思；常见于地名用法（例如马拉维湖也被称为 Nyasa Lake，与“nyanja”同源/相关）。"},"examples":[{"en":"In some local languages, “nyanja” simply means “lake.”","zh":"在一些当地语言里，“nyanja”就是“湖”的意思。"},{"en":"Many place names in the region include words meaning “lake,” like nyanja/nyasa.","zh":"该地区许多地名会包含表示“湖”的词，比如 nyanja/nyasa。"}]}],"synonyms":["Chichewa (closely related/overlapping name)","Nyanja language","Chinyanja"],"phonetic":"/niˈɑːndʒə/","extraExplanation":["“Nyanja”在英语语境里最常见的用法是指“语言”（尼扬贾语）。在马拉维，官方或教育语境更常见“Chichewa（齐切瓦语）”这个名称；在赞比亚等地，“Nyanja”更常被用来指同一语言群/方言连续体。","拼写与大小写：作为语言名称通常大写（Nyanja）；作为普通词义“湖”或出现在地名成分里时，可能见到小写（nyanja），但英文文章里地名/专名仍常大写。"]}
{"word":"nyanza","summary":{"en":"Nyanza is a place name in East Africa and an older term meaning “lake,” sometimes used historically for Lake Victoria (e.g., “Victoria Nyanza”).","zh":"Nyanza 是东非的地名，也是在一些语言与旧英文文献中表示“湖泊”的词；历史上有时用来指维多利亚湖（如“Victoria Nyanza”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical/alternative name used in older English sources for Lake Victoria (especially in the phrase “Victoria Nyanza”).","zh":"（旧时英文资料中）维多利亚湖的别称，常见于短语“Victoria Nyanza”（维多利亚尼扬扎湖/维多利亚湖）。"},"examples":[{"en":"In some 19th‑century maps, Lake Victoria is labeled “Victoria Nyanza.”","zh":"在一些19世纪的地图上，维多利亚湖被标注为“Victoria Nyanza”。"},{"en":"Early explorers wrote about traveling around the shores of the Nyanza.","zh":"早期探险者写到沿着“尼扬扎（Nyanza）”的湖岸旅行。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in East Africa, especially referring to Kenya’s former Nyanza Province (and the broader Nyanza region near Lake Victoria).","zh":"东非的地名，尤其指肯尼亚旧“尼扬扎省”（以及靠近维多利亚湖一带的尼扬扎地区）。"},"examples":[{"en":"She grew up in the Nyanza region of western Kenya.","zh":"她在肯尼亚西部的尼扬扎地区长大。"},{"en":"Many towns in Nyanza are closely connected to fishing on Lake Victoria.","zh":"尼扬扎的许多城镇都与维多利亚湖的渔业密切相关。"}]},{"partOfSpeech":"n.","definition":{"en":"in some Bantu languages, a word meaning “lake” or “large body of water,” which appears in several African geographic names (e.g., Albert Nyanza).","zh":"在一些班图语中表示“湖泊/大水域”的词，因此常出现在非洲地名中（如 Albert Nyanza）。"},"examples":[{"en":"The word “Nyanza” in older place names often points to a lake nearby.","zh":"旧地名中的“Nyanza”常暗示附近有湖泊。"},{"en":"“Albert Nyanza” is an older name for Lake Albert.","zh":"“Albert Nyanza”是阿尔伯特湖（Lake Albert）的旧称。"}]}],"synonyms":["Victoria Nyanza (historical phrase)","Nyanza region (Kenya)"],"phonetic":"/niˈænzə/","extraExplanation":["“Nyanza”常被认为源自东非一些班图语（如卢奥语、基尼亚鲁旺达语等）中与“湖/水域”相关的词根，因此欧洲探险者与早期英文文献会用它来称呼大型湖泊（如维多利亚湖、阿尔伯特湖）。","在现代英语中，“Lake Victoria / Lake Albert”等称呼更常见；“Nyanza”多见于历史语境、地名或地区名称中。"]}
{"word":"nyas","summary":{"en":"“nyas” can mean the acronym NYAS (New York Academy of Sciences) or, online, a playful cat-like “nya” sound.","zh":"“nyas”既可能指缩写 NYAS（纽约科学院），也可能在网络上表示类似“nya”的猫叫/卖萌语气词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often written NYAS) an abbreviation for the New York Academy of Sciences, a U.S. scientific organization.","zh":"（常写作 NYAS）纽约科学院（New York Academy of Sciences）的缩写，美国的科学组织。"},"examples":[{"en":"She attended an NYAS webinar on climate science.","zh":"她参加了 NYAS 关于气候科学的线上讲座。"},{"en":"The report was published in partnership with NYAS.","zh":"这份报告与 NYAS 合作发布。"}]},{"partOfSpeech":"int.","definition":{"en":"(internet slang, playful) a cat-like sound or expression, similar to “nya,” used to sound cute or imitate a cat.","zh":"（网络俚语/卖萌用语）类似“nya”的猫叫/撒娇语气词，用来模仿猫或显得可爱。"},"examples":[{"en":"In the chat, they typed “nyas” while posting a cat sticker.","zh":"在聊天里，他/她发了猫咪贴图并打了“nyas”。"},{"en":"She joked, “nyas,” pretending to be a cat.","zh":"她开玩笑说“nyas”，假装自己是只猫。"}]}],"synonyms":["NYAS","New York Academy of Sciences","nya"],"phonetic":"/ˌwaɪˌɛnˌeɪˈɛs/","extraExplanation":["“NYAS”作为机构缩写更正式，常见于学术活动、报告、会议等语境；“nyas”作为拟声/卖萌表达更偏二次元、聊天语境，和日语拟声“にゃ（nya）”的网络用法相近。"]}
{"word":"Nyasa","summary":{"en":"Nyasa is an alternative/older name for Lake Malawi in southeastern Africa, and sometimes a historical regional term around the lake.","zh":"Nyasa是非洲东南部“马拉维湖”的别称/旧称，也可在历史语境中指该湖周边地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large lake in southeastern Africa, more commonly called Lake Malawi; an older or alternative name is Lake Nyasa.","zh":"非洲东南部的一座大湖，更常称为“马拉维湖（Lake Malawi）”；“Nyasa”也常作为其旧称或别称（Lake Nyasa）。"},"examples":[{"en":"Lake Nyasa is also known today as Lake Malawi.","zh":"Nyasa湖如今也被称为马拉维湖。"},{"en":"The lake borders Malawi, Mozambique, and Tanzania.","zh":"这座湖与马拉维、莫桑比克和坦桑尼亚接壤。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical regional name referring to areas around Lake Malawi (especially in colonial-era writing).","zh":"历史上的地区名称，指马拉维湖周边区域（尤见于殖民时期的英文文献）。"},"examples":[{"en":"Some older maps label the surrounding region as “Nyasaland.”","zh":"一些旧地图会把周边地区标为“Nyasaland（尼亚萨兰）”。"},{"en":"In colonial records, “Nyasa” sometimes appears as a regional term rather than just the lake’s name.","zh":"在殖民时期档案中，“Nyasa”有时不仅指湖名，也被用作地区称呼。"}]}],"synonyms":["Lake Malawi","Lake Nyasa"],"phonetic":"/naɪˈɑːsə/","extraExplanation":["“Nyasa”在一些东非语言（如雅奥语 Yao、尼扬贾语等）的用法里与“湖/水域”有关，所以“Lake Nyasa”有时被认为带有“湖湖（Lake Lake）”这种重复含义的感觉；这也是它在现代更常被称为“Lake Malawi”的原因之一。","相关地名：Nyasaland（尼亚萨兰）是马拉维在殖民时期的名称之一；在历史与地理语境中常会见到。"]}
{"word":"Nyawala","summary":{"en":"“Nyawala” is most likely a proper name (person/place/brand) rather than a standard English vocabulary word.","zh":"“Nyawala” 多半是专有名词（人名/地名/品牌名），而不是英语里的常见词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (used as a personal name, surname, or place name). It is not a common standard word in English, so its exact meaning depends on the language/culture it comes from and the context you saw it in.","zh":"专有名词（可作人名、姓氏或地名）。它不是英语里的常见词，因此具体含义要看它来自哪种语言/文化以及你看到它的语境。"},"examples":[{"en":"Nyawala is listed as a family name in this document.","zh":"Nyawala 在这份文件中被列为一个姓氏。"},{"en":"I’m not sure how to pronounce Nyawala—could you tell me where it’s from?","zh":"我不确定 Nyawala 怎么读——你能告诉我它来自哪里吗？"}]}],"phonetic":"/naɪˈwɑːlə/","extraExplanation":["在英语语境里，像 Nyawala 这类词更常见于“名字/地名/品牌名”的用法，而不是有固定词义的普通词汇。","如果你能提供：①它出现的句子或图片；②所属国家/语言（例如斯瓦希里语、卢干达语、尼扬贾语等）；③它指人、地名还是组织，我可以更准确地给出含义、正确发音和相关文化背景。"]}
{"word":"nyaya","summary":{"en":"Nyaya usually refers to the Indian philosophical school of logic and valid knowledge, and sometimes to a principle or method of reasoning.","zh":"Nyaya 通常指印度哲学中的“正理派”（强调逻辑与获得正当知识的方法），有时也泛指“推理原则/逻辑方法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Indian philosophy) the Nyāya school: a classical Hindu system that focuses on logic, careful reasoning, and methods of gaining valid knowledge.","zh":"（印度哲学）正理派（Nyāya）：古典印度哲学体系之一，强调逻辑、严密推理与获得“正当知识”的方法。"},"examples":[{"en":"In her religion class, she studied Nyaya alongside Yoga and Vedanta.","zh":"在宗教学课上，她学习了正理派（Nyaya），并把它与瑜伽派和吠檀多派一起比较。"},{"en":"Nyaya philosophy trains students to test arguments and avoid faulty reasoning.","zh":"正理派哲学训练学生检验论证，避免推理谬误。"}]},{"partOfSpeech":"n.","definition":{"en":"a principle, rule, or method of reasoning; logical analysis (often used in South Asian English or in academic writing).","zh":"（常见于南亚英语或学术语境）原则、规则或推理方法；逻辑分析。"},"examples":[{"en":"The author explains the nyaya behind the decision step by step.","zh":"作者一步一步解释这个决定背后的推理原则（nyaya）。"},{"en":"Use a clear nyaya to show why your conclusion follows.","zh":"用清晰的推理方法（nyaya）来说明你的结论为何成立。"}]}],"synonyms":["logic","reasoning","logical analysis","Nyāya school"],"phonetic":"/naɪˈjɑːjə/","extraExplanation":["“Nyāya/正理”常与“因明”（推理学）联系在一起。它讨论如何通过“感知、推理、类比、证言”等方式获得可靠知识，并对常见谬误进行分类。","在英文中，学术写作里常保留拼写 Nyaya 或带长音符号 Nyāya；普通文本多写作 Nyaya。首字母大写通常指“正理派”这门哲学传统，小写 nyaya 有时泛指“推理原则/逻辑方法”。"]}
{"word":"nybble","summary":{"en":"A “nybble” is 4 bits (half a byte), often discussed with hexadecimal numbers.","zh":"“nybble”指4比特（半个字节），常与十六进制表示法一起出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of 4 bits (half a byte) in computing.","zh":"（计算机）半字节：由4个比特（bit）组成的数据单位，相当于一个字节（byte）的一半。"},"examples":[{"en":"Each hexadecimal digit represents one nybble (4 bits).","zh":"每一个十六进制数字表示一个 nybble（4比特）。"},{"en":"The file format stores two nybbles in one byte.","zh":"这种文件格式在一个字节里存储两个 nybble。"}]}],"synonyms":["nibble","half-byte"],"phonetic":"/ˈnɪbəl/","extraExplanation":["“nybble”是“nibble”的一种拼写变体，常见于工程师/黑客文化中。它来自“byte（字节）”的谐趣构词：把“bite（咬一口）/nibble（啃一小口）”的意象借来表示“更小的一份数据”。","在现代文档里，“nibble”更常见；但在一些旧文档、代码注释或特定社区里，你仍可能见到“nybble”。"]}
{"word":"nybbles","summary":{"en":"Nybbles are 4-bit units in computing (half a byte), commonly tied to hexadecimal digits.","zh":"Nybbles 指计算机中的 4 比特单位（半个字节），常与十六进制数字对应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In computing, a group of 4 bits (half of a byte), often used to represent one hexadecimal digit (0–F).","zh":"（计算机）半字节：由4个比特组成的数据单位，常用来表示一个十六进制数字（0–F）。"},"examples":[{"en":"One byte contains two nybbles.","zh":"一个字节包含两个半字节（nybbles）。"},{"en":"A hexadecimal digit maps neatly to a single nybble.","zh":"一个十六进制数字刚好对应一个半字节（nybble）。"}]}],"synonyms":["nibbles","half-byte"],"phonetic":"/ˈnɪbəlz/","extraExplanation":["“nybble”是“nibble”的一种拼写变体（把 i 换成 y），是早期计算机圈的文字玩笑：因为它是 byte（字节）的一半，所以像“咬一小口”（nibble）那样。现在技术写作中更常见的拼写是“nibble”。","注意别和日常英语里的 nibbles（小口吃/零食）混淆；在非技术语境里，通常应该用 nibbles。"]}
{"word":"nybblize","summary":{"en":"“Nybblize” is an informal computing verb meaning to break data into 4-bit units (nybbles) or handle something in small chunks.","zh":"“nybblize”是计算机领域的非正式动词，指把数据按4比特（半字节）拆分/编码，或把事情分小块逐步处理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Computing, informal) To split or encode data into 4-bit units (“nybbles”), or to process something in small, partial chunks.","zh":"（计算机/非正式）把数据拆分或编码成4比特单位（“nybble/半字节”）；或把某事一点点、分块地处理。"},"examples":[{"en":"The old tool nybblizes each byte into two nybbles before writing the file.","zh":"这个旧工具会先把每个字节拆成两个半字节，再写入文件。"},{"en":"We nybblized the packet header to make the flags easier to parse.","zh":"我们把数据包头按半字节拆开，这样标志位更容易解析。"},{"en":"I’m just nybblizing the task—fixing one small part at a time.","zh":"我只是把任务“分块啃”—一次修一小部分。"}]}],"synonyms":["split into nibbles","chunk","encode","partition","break down"],"phonetic":"ˈnɪbəlˌaɪz","extraExplanation":["“nybble”（也常写作 nibble）指 4 bits（半个 byte/字节），是计算机领域的俚语/行话。拼写 nybble 曾被用来与 “byte” 押韵并区分于日常的 “nibble（啃一小口）”。","“nybblize”并不是常见的标准词，多见于技术圈自造用法，含义通常就是“按半字节处理/拆分”。在正式写作里更常用：split into nibbles / encode into 4-bit chunks / process in small chunks。"]}
{"word":"NYC","summary":{"en":"NYC = New York City; it can also describe something related to New York City in informal use.","zh":"NYC=New York City（纽约市）；也可在非正式用法中表示“与纽约市相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Abbreviation for New York City, the largest city in the United States.","zh":"New York City（纽约市）的缩写，是美国最大的城市。"},"examples":[{"en":"I’m flying to NYC for a conference next week.","zh":"我下周要飞去NYC参加一个会议。"},{"en":"NYC is known for Broadway shows and tall skyscrapers.","zh":"NYC以百老汇演出和高楼大厦闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective (informal) meaning “from or related to New York City.”","zh":"（非正式）作形容词用，表示“来自纽约市的；与纽约市有关的”。"},"examples":[{"en":"She has a strong NYC accent.","zh":"她有很明显的纽约口音。"},{"en":"We’re looking for an NYC-style bagel place.","zh":"我们在找一家纽约风味的贝果店。"}]}],"synonyms":["New York City","New York (context-dependent)"],"phonetic":"/ˌɛn waɪ ˈsiː/","extraExplanation":["在书面英文中，“NYC”多用于地图、标题、社交媒体、商务沟通等较简洁的场景；在正式文章里也常直接写全称“New York City”。","口语里更常说“New York City”或直接说“New York”。但“New York”有时也可能指纽约州（New York State），因此需要看语境。"]}
{"word":"nychthemer","summary":{"en":"Nycthemer means a full 24-hour day-and-night cycle, often used in scientific contexts.","zh":"Nycthemer 指完整的24小时昼夜周期，常用于科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a 24-hour period that includes both daytime and nighttime; a day-and-night cycle","zh":"包含白天与夜晚的24小时周期；昼夜循环"},"examples":[{"en":"In sleep research, a nycthemer is the basic 24-hour cycle used to track rest and activity.","zh":"在睡眠研究中，nycthemer 是用来追踪休息与活动的基本24小时周期。"},{"en":"Her schedule was steady across the nycthemer, with work in the day and reading at night.","zh":"她的作息在整个昼夜周期里很稳定：白天工作，晚上阅读。"}]}],"synonyms":["24-hour cycle","day-and-night cycle","circadian cycle"],"phonetic":"/nɪkˈθimɚ/","extraExplanation":["这个词较少见，多用于生物学、医学或睡眠/节律研究领域。","词源来自希腊语：nyct-（夜晚）+ hemer-（白天/一天），强调“夜与日合在一起的一整天”。","更常见的说法通常是 24-hour cycle 或 circadian cycle（昼夜节律周期）。"]}
{"word":"nychthemeral","summary":{"en":"Nychthemeral means “having to do with a 24-hour day-and-night cycle.”","zh":"nychthemeral 指“与24小时的昼夜周期有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a full 24-hour day-and-night cycle (a nychthemeron).","zh":"与完整的24小时昼夜周期（昼夜日）有关的。"},"examples":[{"en":"Doctors tracked the patient’s nychthemeral body temperature changes.","zh":"医生追踪了患者在24小时昼夜周期内的体温变化。"},{"en":"Some hormones follow a nychthemeral rhythm, rising at night and falling during the day.","zh":"有些激素遵循24小时昼夜节律，夜间上升、白天下降。"}]}],"synonyms":["circadian","daily (technical context)","diurnal (not the same, but related)"],"phonetic":"/ˌnɪkθəˈmɪrəl/","extraExplanation":["词源来自希腊语：nyx（夜）+ hēmera（日），合起来表示“昼夜一整天”。因此它常出现在医学、生理学、睡眠研究与生物节律（circadian rhythms）等语境中，属于较正式、学术化的词。"]}
{"word":"nychthemeron","summary":{"en":"“Nychthemeron” means a full 24-hour period (day + night).","zh":"“nychthemeron”指完整的24小时周期（一昼夜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a period of 24 hours; a full day and night (a nycthemeron).","zh":"一个24小时的周期；完整的一昼夜（含白天与夜晚）。"},"examples":[{"en":"The medicine should be taken once each nychthemeron.","zh":"这种药应每个一昼夜服用一次。"},{"en":"Researchers recorded sleep patterns across one nychthemeron.","zh":"研究人员记录了一个一昼夜内的睡眠模式。"}]}],"synonyms":["24-hour period","day and night","circadian day"],"phonetic":"/nɪkˈθɛmərən/","extraExplanation":["词源来自希腊语：nych-（夜）+ hēmera（天/日）。这个词多见于生理学、医学或生物节律（如昼夜节律）相关的较正式语境；日常英语更常说 “a 24-hour period” 或 “a day and night”。"]}
{"word":"nyckelharpa","summary":{"en":"Nyckelharpa: a Swedish traditional keyed, bowed string instrument (a kind of folk fiddle).","zh":"Nyckelharpa：瑞典传统的按键式拉弦乐器（民间“小提琴”类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Swedish bowed string instrument that uses keys to stop the strings, producing a resonant, fiddle-like sound (often with sympathetic strings).","zh":"一种瑞典传统拉弦乐器，使用“按键”来按弦发音，音色浑厚、类似小提琴（常带有共鸣弦/同感弦）。"},"examples":[{"en":"She learned the nyckelharpa to play Scandinavian folk music.","zh":"她学习尼克尔哈帕，用来演奏斯堪的纳维亚民谣。"},{"en":"The nyckelharpa’s ringing tone comes from its extra sympathetic strings.","zh":"尼克尔哈帕清亮的共鸣感来自它额外的共鸣弦。"},{"en":"At the festival, a nyckelharpa player led the dance tunes.","zh":"在音乐节上，一位尼克尔哈帕演奏者带领大家跳舞曲。"}]}],"synonyms":["Swedish keyed fiddle","keyed fiddle"],"phonetic":"/ˈnɪkəlˌhɑrpə/","extraExplanation":["“nyckelharpa”是瑞典语词：nyckel=“钥匙/按键”，harpa=“竖琴/弦乐器”（历史上在北欧语境里可泛指弦乐器）。英语里通常直接借用这个瑞典语名称。","它常被称为“Swedish keyed fiddle（瑞典键控小提琴）”。在英语对话中，你也可以用这个解释来帮助别人快速理解。","这种乐器与瑞典民间舞曲传统联系很深，尤其在乌普萨拉附近的Uppland地区较有代表性。"]}
{"word":"nyctaginaceae","summary":{"en":"Nyctaginaceae is the botanical family that includes bougainvillea and four-o’clock plants.","zh":"Nyctaginaceae 指“紫茉莉科”，包括三角梅与紫茉莉（four-o’clock）等植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes flowering plants such as bougainvillea and the four-o’clock (Mirabilis), often called the four-o’clock family.","zh":"紫茉莉科（Nyctaginaceae）：一类开花植物的科，包括三角梅（九重葛）和紫茉莉属（four-o’clock，Mirabilis）等，因此也常被称为“紫茉莉科/四点花科”。"},"examples":[{"en":"Bougainvillea belongs to the family Nyctaginaceae.","zh":"三角梅属于紫茉莉科（Nyctaginaceae）。"},{"en":"In botany class, we learned that the four-o’clock plant is part of Nyctaginaceae.","zh":"在植物学课上，我们学到紫茉莉（four-o’clock）属于紫茉莉科（Nyctaginaceae）。"}]}],"synonyms":["four-o'clock family"],"phonetic":"/ˌnɪk.tə.dʒəˈneɪ.si.iː/","extraExplanation":["词源提示：Nyctaginaceae 来自属名 Nyctago（与希腊语 nyx/nykt- “夜晚”有关），因此常让人联想到一些成员在傍晚或夜间开放的习性（例如“four-o’clock”在下午较晚时开花）。","常见别名：英语里常说 four-o’clock family（四点花科/紫茉莉科），有助于记忆。"]}
{"word":"nyctaginaceous","summary":{"en":"A botanical adjective meaning “of or relating to the Nyctaginaceae (four-o’clock) plant family.”","zh":"植物学形容词，表示“与紫茉莉科（四点钟花科）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to the plant family Nyctaginaceae (the four-o’clock family), which includes plants such as four-o’clocks and bougainvillea.","zh":"（植物学）与紫茉莉科（Nyctaginaceae，俗称“四点钟花科”）有关的；紫茉莉科的。"},"examples":[{"en":"Bougainvillea is a nyctaginaceous plant often grown as an ornamental vine.","zh":"三角梅（九重葛）是紫茉莉科植物，常作为观赏藤本栽培。"},{"en":"The researcher compared nyctaginaceous species found in dry coastal habitats.","zh":"研究人员比较了分布在干旱海岸生境中的紫茉莉科物种。"}]}],"synonyms":["of the Nyctaginaceae","four-o’clock-family (adj. phrase)"],"phonetic":"/ˌnɪk.təˌdʒeɪ.nəˈseɪ.ʃəs/","extraExplanation":["这个词主要用于植物分类学写作中，日常英语很少使用。更常见的说法是“in the four-o’clock family / in the Nyctaginaceae family（属于紫茉莉科）”。","词根来自拉丁化的属名/科名 Nyctago，源于希腊语 nyx（夜晚）。部分相关植物有“傍晚或夜间更显著”的开花习性，因此得名。"]}
{"word":"nyctaginia","summary":{"en":"A rare botanical Latin genus name (not common English), historically linked to the four o’clock family (Nyctaginaceae).","zh":"罕见的植物学拉丁属名（非日常英语），历史上与紫茉莉科（Nyctaginaceae，四点钟花科）相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nyctaginia (also written nyctaginia) is a scientific (Latin) genus name used in plant classification, historically associated with the four o’clock family (Nyctaginaceae). It is not a common everyday English word.","zh":"Nyctaginia（也可写作 nyctaginia）是植物分类学中的拉丁学名（属名），历史上与“紫茉莉科/四点钟花科”（Nyctaginaceae）相关。它不是日常英语常用词。"},"examples":[{"en":"In older botanical texts, Nyctaginia may appear as a genus name linked to the four o’clock family.","zh":"在较早的植物学文献中，Nyctaginia 可能会作为与紫茉莉科相关的属名出现。"},{"en":"If you saw “nyctaginia” in a paper, it was probably used as a taxonomic term rather than a general English word.","zh":"如果你在论文里看到“nyctaginia”，它很可能是作为分类学术语使用，而不是普通英语词汇。"}]}],"synonyms":["Nyctaginaceae (related family name)","Mirabilis (common modern genus name in the same family)"],"phonetic":"/ˌnɪktəˈdʒɪniə/","extraExplanation":["这个词看起来像是拼写变体或旧的分类用名；现代更常见的是科名 **Nyctaginaceae**（紫茉莉科/四点钟花科），以及属名 **Mirabilis**（如四点钟花 *Mirabilis jalapa*）。如果你能提供出处（书名/句子/图片），我可以帮你确认它具体指的是哪个分类单元以及是否为旧名/同物异名。","词根提示：**nyct-** 常来自希腊语，表示“夜”（如 *nocturnal* 夜行的）。因此这类学名往往与“夜间开花/夜间显眼”等特征有关。"]}
{"word":"nyctalgia","summary":{"en":"Nyctalgia means pain that happens or worsens at night.","zh":"nyctalgia 指夜间发生或加重的疼痛（夜痛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pain that occurs or becomes worse at night; nighttime pain (a medical term).","zh":"夜间出现或加重的疼痛；夜痛（医学用语）。"},"examples":[{"en":"The patient reported nyctalgia that woke him up around 2 a.m.","zh":"病人描述自己有夜痛，常在凌晨两点左右疼醒。"},{"en":"Persistent nyctalgia can be a warning sign that needs medical evaluation.","zh":"持续的夜间疼痛可能是需要就医评估的警示信号。"}]}],"synonyms":["night pain","nocturnal pain","pain at night"],"phonetic":"/nɪkˈtældʒə/","extraExplanation":["词源：来自希腊语 nyct-（夜晚）+ -algia（疼痛）。常见于医学描述，尤其用来强调“夜间更明显的疼痛”这一时间特点，而不特指某一种疾病。","临床语境中，医生可能会结合“是否夜间加重、是否影响睡眠、是否伴随发热或体重下降”等信息判断原因；日常英语里更常说 night pain / pain at night。"]}
{"word":"nyctalope","summary":{"en":"Nyctalope usually means a night-blind person, though in rare older usage it can mean someone who sees well in the dark.","zh":"Nyctalope 通常指“夜盲者”，但在少见的旧用法中也可能指“夜视者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has night blindness (difficulty seeing in low light); a person with nyctalopia.","zh":"夜盲者；患有夜盲症（在昏暗环境中视力明显下降）的人。"},"examples":[{"en":"My uncle is a nyctalope, so he avoids driving at night.","zh":"我叔叔是夜盲者，所以他尽量避免夜间开车。"},{"en":"The doctor explained that the patient was a nyctalope and needed an eye exam and blood test.","zh":"医生解释说病人有夜盲问题，需要做眼科检查和血液检查。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, often considered archaic or confusing) a person who can see well in the dark.","zh":"（罕见；多被视为古旧或易混淆）在黑暗中仍看得很清楚的人。"},"examples":[{"en":"In an old story, the hunter was described as a nyctalope who could track animals by moonlight.","zh":"在一则旧故事里，猎人被描写成能借月光追踪猎物的“夜视者”。"}]}],"synonyms":["night-blind person","person with nyctalopia","(rare) night-seer"],"phonetic":"/ˈnɪk.tə.loʊp/","extraExplanation":["这个词在英语里比较少见，更常见的是医学术语 **nyctalopia（夜盲症）**。需要注意：**nyctalope** 在历史上出现过“夜盲者”和“夜视者”两种相反的用法，因此在现代写作中容易引起误解；若要表达“夜盲”，通常直接用 **night-blind person** 或 **someone with nyctalopia** 更清楚。","词源来自希腊语，与“夜（nyct-）”有关；由于古代对该词的解释分歧，后来在不同语言传统中产生了含义摇摆。"]}
{"word":"nyctalopia","summary":{"en":"Nyctalopia means night blindness—difficulty seeing in low light or at night.","zh":"Nyctalopia 指夜盲症：在昏暗或夜间难以看清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which a person cannot see well in dim light or at night; night blindness","zh":"一种在昏暗环境或夜间视力明显变差的情况；夜盲症"},"examples":[{"en":"People with nyctalopia may have trouble driving at night.","zh":"患有夜盲症的人晚上开车可能会很困难。"},{"en":"The doctor asked whether she noticed nyctalopia when the lights were turned down.","zh":"医生问她在灯光变暗时是否感觉到夜盲症状。"},{"en":"Vitamin A deficiency is one possible cause of nyctalopia.","zh":"维生素A缺乏是夜盲症的一个可能原因。"}]}],"synonyms":["night blindness","night vision impairment"],"phonetic":"/ˌnɪk.təˈloʊ.pi.ə/","extraExplanation":["词源来自希腊语：nyx（夜）+ alaos（盲）+ ops（眼/视力），字面意思就是“夜间视力盲”。","它是医学用语，日常英语更常说 night blindness。","容易和 hemeralopia 混淆：在现代英语里，nyctalopia 指“夜盲”，而 hemeralopia 通常指“昼盲/白天看不清”，但在历史文献中两者曾被混用。"]}
{"word":"nyctalopic","summary":{"en":"Nyctalopic means night-blind—having trouble seeing in low light or at night.","zh":"nyctalopic 指“夜盲的”，即在弱光或夜间视力变差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Affected by night blindness; having difficulty seeing in dim light or at night.","zh":"夜盲的；在昏暗环境或夜间视力明显下降的。"},"examples":[{"en":"Some people become nyctalopic when driving at night, especially in heavy rain.","zh":"有些人在夜间开车时会出现夜盲表现，尤其在大雨天更明显。"},{"en":"After the eye exam, the doctor asked whether he felt nyctalopic in low light.","zh":"眼科检查后，医生问他在弱光环境下是否觉得自己有夜盲。"}]}],"synonyms":["night-blind","having night blindness"],"phonetic":"/ˌnɪk.təˈloʊ.pɪk/","extraExplanation":["这个词比较少见、偏医学用语。更常用的表达是 night-blind（夜盲的）或 have night blindness（有夜盲）。","词源来自希腊语：nyx/nykt- 表示“夜晚”，相关于 nyct- 这个词根（如 nocturnal 的近亲）；与 nyctalopia（夜盲症）同源。","注意不要和 “able to see in the dark（夜视能力强）” 混淆；nyctalopic 是“夜里看不清”的意思。"]}
{"word":"nyctalops","summary":{"en":"Nyctalops most commonly means a person with night blindness; in rare older usage, it can mean someone who sees well at night but poorly in daylight.","zh":"Nyctalops 通常指“夜盲者”；在少见的较旧用法中，也可能指“夜间看得更清、白天反而看不清的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who has night blindness (difficulty seeing in dim light or at night).","zh":"夜盲者（在昏暗环境或夜间视力困难的人）。"},"examples":[{"en":"As a nyctalops, he avoids driving after sunset.","zh":"作为夜盲者，他会避免在日落后开车。"},{"en":"The doctor asked whether she felt like a nyctalops in low light.","zh":"医生询问她在弱光下是否感觉像夜盲者一样看不清。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/older usage) A person who can see well at night but poorly in bright daylight.","zh":"（罕见/较旧用法）夜间视力较好、强光下反而看不清的人。"},"examples":[{"en":"In some older texts, a nyctalops is described as seeing best at night.","zh":"在一些较旧的文本中，nyctalops 被描述为夜间视力最好。"}]}],"synonyms":["night-blind person","person with nyctalopia"],"phonetic":"/nɪkˈtælɑps/","extraExplanation":["词源来自希腊语：nyx/nyct- 表示“夜”，-ops 与“眼/视觉”相关。由于古典文献与后世医学术语在解释上出现分歧，nyctalops 有时会被解释成“夜盲者”，有时则被解释成“夜视更好的人”。现代英语里更常按医学语境理解为“夜盲者”，更常见的对应名词是 nyctalopia（夜盲症）。"]}
{"word":"nyctalopy","summary":{"en":"Nyctalopy means night blindness—poor vision in dim light or at night.","zh":"Nyctalopy 指“夜盲”——在昏暗或夜间看不清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"night blindness; difficulty seeing in dim light or at night.","zh":"夜盲；在昏暗环境或夜间视力明显变差的情况。"},"examples":[{"en":"The patient reported nyctalopy and found it hard to drive after sunset.","zh":"病人主诉有夜盲，日落后开车变得很困难。"},{"en":"Nyctalopy can be a symptom of vitamin A deficiency or certain eye diseases.","zh":"夜盲可能是维生素A缺乏或某些眼部疾病的症状。"}]}],"synonyms":["nyctalopia","night blindness"],"phonetic":"/nɪkˈtæləpi/","extraExplanation":["“nyctalopy”较少见，更常用的医学词是“nyctalopia”。两者通常都指“夜盲”。","词源来自希腊语：nykt-（夜晚）+ 相关词根（视力/眼）。在医学语境里常见于病历、眼科检查或学术文章。","注意：日常英语里更常说“night blindness”。如果和医生沟通或写作业/报告，用“nyctalopia (night blindness)”会更清晰。"]}
{"word":"nyctanthes","summary":{"en":"Nyctanthes is a botanical genus best known for the night-flowering jasmine tree with fragrant blooms.","zh":"Nyctanthes 是一个植物属名，最著名的是夜间开花、花香浓郁的“夜来香/夜香木”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small trees and shrubs in the olive family (Oleaceae), best known for night-blooming, fragrant flowers; especially the tree called night-flowering jasmine (Nyctanthes arbor-tristis).","zh":"紫茉莉属（木犀科）的一类小乔木或灌木，以夜间开花、花香浓郁而闻名；其中最著名的是“夜来香/夜香木”（Nyctanthes arbor-tristis）。"},"examples":[{"en":"Nyctanthes arbor-tristis is valued for its strong fragrance, especially at night.","zh":"Nyctanthes arbor-tristis 因为香味浓郁而受到喜爱，尤其是在夜间。"},{"en":"In some South Asian gardens, Nyctanthes is grown for both ornament and traditional use.","zh":"在一些南亚的花园里，人们栽种 Nyctanthes，既为观赏，也有传统用途。"}]}],"synonyms":["night-flowering jasmine (common name, esp. Nyctanthes arbor-tristis)","parijat (regional common name)"],"phonetic":"/nɪkˈθænθiz/","extraExplanation":["词源提示：Nyctanthes 来自希腊语 nyx（夜）+ anthos（花），字面意思是“夜之花”，对应其夜间开花、清晨花落的特性。","文化背景：Nyctanthes arbor-tristis 在印度等地常被称为 parijat / harsingar 等，本土文化中常与清晨落花、香气和节庆供花联系在一起。"]}
{"word":"nyctea","summary":{"en":"Nyctea is an older scientific genus name for the snowy owl, now usually classified under Bubo.","zh":"Nyctea 是雪鸮曾用的属名，如今通常归入雕鸮属（Bubo）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name used for the snowy owl; in modern classification, the snowy owl is usually placed in the genus Bubo.","zh":"（旧用）雪鸮的属名；现代分类中雪鸮通常归入雕鸮属（Bubo）。"},"examples":[{"en":"Older field guides may list the snowy owl as Nyctea scandiaca.","zh":"一些较旧的野外鸟类图鉴可能把雪鸮写作 Nyctea scandiaca。"},{"en":"In recent scientific writing, Nyctea is mostly treated as an outdated genus name.","zh":"在较新的学术写作中，Nyctea 多被视为已过时的属名。"}]}],"synonyms":["snowy owl","Bubo scandiacus","Nyctea scandiaca"],"phonetic":"/ˈnɪk.ti.ə/","extraExplanation":["Nyctea 来自希腊语词根 nykt-，意为“夜晚”，与英语词根 noct-（如 nocturnal“夜行性的”）同源。","分类学会随着新证据（如DNA研究）而调整：雪鸮过去常被单独放在 Nyctea 属中，如今多改归入 Bubo，因此你在新旧资料里可能会看到两种不同写法。"]}
{"word":"nyctereutes","summary":{"en":"Nyctereutes is the scientific genus name for raccoon dogs.","zh":"Nyctereutes 是“貉/狸狗（raccoon dog）”所属的科学属名（貉属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of canids (dog family) that includes the raccoon dog; used mainly in scientific contexts.","zh":"（动物学）貉属；犬科的一属，包含“貉/狸狗（raccoon dog）”，多用于科学语境。"},"examples":[{"en":"Nyctereutes procyonoides is commonly known as the raccoon dog.","zh":"Nyctereutes procyonoides 通常被称为“貉/狸狗（raccoon dog）”。"},{"en":"The paper compares skull measurements across several canids, including Nyctereutes.","zh":"这篇论文比较了多种犬科动物（包括貉属 Nyctereutes）的头骨测量数据。"}]}],"synonyms":["raccoon dog","tanuki","Nyctereutes (genus)"],"phonetic":"/ˌnɪk.təˈruː.tiːz/","extraExplanation":["这是拉丁化的希腊词源：nyct- 表示“夜晚/夜行”，因此这个属名带有“夜行的犬科动物”的含义（用来暗示其夜行性）。","在日本文化中，貉（常对应 Nyctereutes procyonoides）常被称为 tanuki（狸），在民间故事里常被描绘成会变化、爱恶作剧的动物；但科学写作里通常使用 Nyctereutes 或 raccoon dog。"]}
{"word":"nycteribiid","summary":{"en":"A nycteribiid is a wingless bat-parasitic fly that lives on bats and feeds on blood.","zh":"nycteribiid 指一种无翅的蝙蝠寄生蝇，寄生在蝙蝠身上并吸血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wingless parasitic fly (family Nycteribiidae) that lives on bats and feeds on their blood","zh":"（蝠虻科 Nycteribiidae 的）无翅寄生蝇，寄生在蝙蝠身上并吸食其血液"},"examples":[{"en":"Nycteribiids are often found crawling through a bat’s fur.","zh":"蝠虻常常被发现爬行在蝙蝠的毛发间。"},{"en":"Researchers checked bats for nycteribiid flies to study parasite diversity.","zh":"研究人员检查蝙蝠身上的蝠虻，以研究寄生虫多样性。"}]}],"synonyms":["bat fly"],"phonetic":"/ˌnɪk.təˈrɪb.i.ɪd/","extraExplanation":["“nycteribiid”来自分类学名称 Nycteribiidae（蝠虻科）。其中 nycteri- 源自希腊语词根，和“夜/蝙蝠”相关；该类昆虫长期与蝙蝠共生（寄生），形态上常呈“像蜘蛛一样”的无翅外观，便于在宿主毛间移动。","这是一个较少见的生物学术语，日常英语更常用更通俗的说法是“bat fly（蝙蝠虻/蝙蝠寄生蝇）”。"]}
{"word":"nycteribiidae","summary":{"en":"Nycteribiidae: a family of wingless parasitic bat flies.","zh":"Nycteribiidae：蝙蝠虱蝇科，一类无翅、寄生在蝙蝠身上的蝙蝠蝇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of wingless flies (bat flies) that live as parasites on bats, feeding on their blood.","zh":"【昆虫】蝙蝠虱蝇科：一类无翅的寄生蝇（蝙蝠蝇），寄生在蝙蝠身上并吸食其血液。"},"examples":[{"en":"Nycteribiidae are wingless bat flies that cling to a bat’s fur and skin.","zh":"蝙蝠虱蝇科的蝙蝠蝇没有翅膀，会紧紧附着在蝙蝠的毛发和皮肤上。"},{"en":"Researchers sometimes collect Nycteribiidae to study bat health and disease transmission.","zh":"研究人员有时会采集蝙蝠虱蝇科的昆虫，用来研究蝙蝠健康状况与疾病传播。"}]}],"synonyms":["bat flies","wingless bat flies"],"phonetic":"ˌnɪk.təˌrɪb.iˈaɪ.di","extraExplanation":["这是一个“科名”（family name），常见于动物学、昆虫学与生态学文章中；日常英语里更常用的说法是 bat flies（蝙蝠蝇）。","词源来自希腊语：nykter- 表示“夜”，bios 表示“生命/生活”，与蝙蝠夜行习性相关；-idae 是动物分类学中表示“科”的常见后缀。","与其近缘、也常被一起提到的寄生蝇类还有 Streblidae（另一类蝙蝠蝇，部分有翅）。"]}
{"word":"nycteridae","summary":{"en":"Nycteridae is the scientific family name for slit-faced bats found mainly in Africa and Asia.","zh":"Nycteridae 是裂脸蝠（主要分布于非洲和亚洲）的科学“科名”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of African and Asian insect-eating bats commonly called slit-faced bats (family name in biological classification).","zh":"（生物分类）长翼蝠科／裂脸蝠科：一类主要分布于非洲和亚洲、以昆虫为食的蝙蝠（科级分类名称）。"},"examples":[{"en":"Nycteridae are often called slit-faced bats because of the grooves and folds on their faces.","zh":"Nycteridae 常被称为“裂脸蝠”，因为它们脸部有明显的沟槽和褶皱。"},{"en":"The researcher recorded echolocation calls from a Nycteridae species in West Africa.","zh":"研究人员在西非记录了一种 Nycteridae 蝙蝠的回声定位叫声。"}]}],"synonyms":["slit-faced bats"],"phonetic":"/nɪkˈtɛrɪdi/","extraExplanation":["这是一个拉丁化的科名，通常首字母大写（Nycteridae），在学术写作中表示“科”这一分类层级。","词源与希腊语有关：nyx/nykt- 表示“夜晚”，很符合蝙蝠夜行的习性。","常见英文俗名是 slit-faced bats（裂脸蝠），在非专业语境中更常用俗名而不是科名。"]}
{"word":"nycterine","summary":{"en":"“Nycterine” means “nocturnal; active at night,” especially describing animals like bats and owls.","zh":"“nycterine”意为“夜行性的；夜间活动的”，常用于描述蝙蝠、猫头鹰等动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal) Active at night; nocturnal. Example: “Bats are nycterine mammals.” / “Many insects become nycterine after sunset.”","zh":"（动物）夜行性的；夜间活动的。例： “蝙蝠是夜行性（nycterine）的哺乳动物。”／“许多昆虫在日落后变成夜行性。”"},"examples":[{"en":"Bats are nycterine mammals that hunt in the dark.","zh":"蝙蝠是夜行性哺乳动物，会在黑暗中捕食。"},{"en":"Owls have nycterine habits, so they are most active at night.","zh":"猫头鹰有夜行性的习性，所以夜里最活跃。"}]}],"synonyms":["nocturnal","night-active","nightly"],"phonetic":"/ˈnɪktəˌraɪn/","extraExplanation":["这个词比较少见，多用于动物学/博物学语境；日常英语里更常用的词是 **nocturnal**（夜行性的）。","词源与希腊语有关：**nyct-** 表示“夜晚”（也见于 *nyctophobia*“夜间恐惧症”）。"]}
{"word":"nycteris","summary":{"en":"Nycteris is a genus of African slit-faced bats.","zh":"Nycteris 指非洲裂面蝠属（裂面蝠的一类蝙蝠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African bats known as slit-faced bats (family Nycteridae).","zh":"裂面蝠属（Nycteris）：一种产于非洲的蝙蝠属，俗称“裂面蝠”（裂面指其面部常有明显的纵向凹沟/裂缝状结构）。"},"examples":[{"en":"Scientists recorded echolocation calls from Nycteris bats in a forest in Ghana.","zh":"科学家在加纳的森林里记录了裂面蝠属（Nycteris）蝙蝠的回声定位叫声。"},{"en":"Nycteris species often roost in caves, hollow trees, or buildings.","zh":"裂面蝠属的物种常在洞穴、中空树干或建筑物里栖息。"}]}],"synonyms":["slit-faced bat (genus)","Nycteridae (family, broader group)"],"phonetic":"/nɪkˈtɛrɪs/","extraExplanation":["“Nycteris”是生物分类学中的拉丁化属名，常见于学术文章与自然纪录片解说中，日常英语里更常说“slit-faced bat（裂面蝠）”。","词源上可追溯到希腊语中与“夜晚/蝙蝠”相关的词根（如 nyx 表“夜”），因此带有“夜行性动物”的含义色彩。"]}
{"word":"nycti","summary":{"en":"nycti- is a scientific word part meaning “night.”","zh":"nycti- 是表示“夜晚”的科学词根。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (combining form) meaning “night” or “related to the night,” used mainly in scientific words","zh":"表示“夜晚 / 与夜晚有关”的词根（构词成分），多用于科学词汇中"},"examples":[{"en":"Nyctophobia means an intense fear of the night.","zh":"Nyctophobia 指对夜晚的强烈恐惧。"},{"en":"Some animals are nocturnal, and the study of their behavior may use nycti- terms.","zh":"有些动物是夜行性的，研究它们的行为时可能会用到含 nycti- 的术语。"}]}],"synonyms":["noct-","night-"],"phonetic":"/ˈnɪk.ti/","extraExplanation":["nycti- 来自希腊语词根 nyx / nykt-（意为“夜”）。在英语里它常出现在较正式或学术的词中，例如：nyctophobia（夜晚恐惧）、nyctinasty（植物夜间的“睡眠运动”，如叶片夜间合拢）、nyctalopia（夜盲）。日常英语更常用的是 night 或拉丁来源的 noct-（如 nocturnal）。","你输入的 “nycti” 看起来像是不完整的词根/开头。如果你想查某个完整单词（例如 nyctophobia / nyctinasty / nyctalopia），把完整拼写发我，我可以给更精确的释义与用法。"]}
{"word":"nycticorax","summary":{"en":"Nycticorax is the scientific genus name for night herons, such as the black-crowned night heron.","zh":"Nycticorax 是夜鹭属的学名（一个鸟类属名），如黑冠夜鹭等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of night herons (birds in the heron family) that are most active around dusk and at night, including the black-crowned night heron.","zh":"夜鹭属（鹭科的一属鸟类），多在黄昏和夜间活动，代表种包括黑冠夜鹭。"},"examples":[{"en":"The black-crowned night heron belongs to the genus Nycticorax.","zh":"黑冠夜鹭属于夜鹭属（Nycticorax）。"},{"en":"In the field guide, Nycticorax is listed under herons and egrets.","zh":"在野外图鉴中，Nycticorax 被归在鹭与白鹭一类。"}]}],"synonyms":["night heron"],"phonetic":"/ˌnɪk.tɪˈkɔːræks/","extraExplanation":["Nycticorax 是拉丁化的学名，源自古希腊语：nyx（夜晚）+ korax（乌鸦/鸦类），大意是“夜鸦”。之所以这样命名，是因为夜鹭多在夜间活动，叫声也较为粗哑。","作为属名（genus name），Nycticorax 通常用在生物学、鸟类学文章里；日常英语更常说 night heron（夜鹭）。属名一般首字母大写并用斜体书写：Nycticorax。"]}
{"word":"nyctimene","summary":{"en":"Nyctimene is (1) a figure from Greek mythology turned into an owl, and (2) a zoological genus of tube-nosed fruit bats.","zh":"Nyctimene 可指（1）希腊神话中被变为猫头鹰的人物名，也可指（2）动物学上的管鼻果蝠属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A woman (often described as the daughter of Epopeus) who, after committing incest with her father, was transformed into an owl; her name is sometimes used to refer to an owl symbolizing shame or night.","zh":"（希腊神话）人物名（常说为埃波佩乌斯之女）：因与父亲乱伦而被变成猫头鹰；其名有时用来指象征羞耻或黑夜的猫头鹰。"},"examples":[{"en":"In some retellings of Greek myth, Nyctimene becomes an owl and hides from daylight.","zh":"在一些希腊神话的改写中，Nyctimene 变成了猫头鹰，并躲避日光。"},{"en":"The poet compares a guilty character to Nyctimene, turning toward the night for cover.","zh":"诗人把一个心怀罪疚的角色比作 Nyctimene，转向黑夜寻求遮蔽。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology) A genus of tube-nosed fruit bats found mainly in New Guinea and nearby islands.","zh":"（动物学）管鼻果蝠属：主要分布于新几内亚及其周边岛屿的一类果蝠。"},"examples":[{"en":"Nyctimene bats are known for their distinctive tube-shaped nostrils.","zh":"Nyctimene 属的蝙蝠以其独特的“管状鼻孔”而闻名。"},{"en":"The researcher recorded several Nyctimene species in a rainforest survey.","zh":"研究人员在雨林调查中记录到多种 Nyctimene 属物种。"}]}],"synonyms":["(myth) owl (symbolic reference)","(zoology) tube-nosed fruit bats (common group name)"],"phonetic":"/ˌnɪk.tɪˈmiː.ni/","extraExplanation":["这个词来自希腊语词根：nyx / nyct-（夜晚）+ mene（与“月”相关的意象），因此常让人联想到“夜”和“黑暗”。","在文学或艺术语境中，Nyctimene 往往被用作“因羞耻而避光、趋向黑夜”的象征性典故；但在科学语境里则多指蝙蝠的属名，含义中性。"]}
{"word":"nyctinastic","summary":{"en":"Nyctinastic describes plant movements that occur at night, like leaves or flowers closing in the dark.","zh":"Nyctinastic 指植物在夜间发生的运动，如叶片或花朵在黑暗中合拢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a plant or its leaves/flowers) showing a natural movement or change of position at night, such as closing in darkness and opening in daylight.","zh":"（指植物的叶子或花）表现出夜间自然运动的；如天黑时合拢、白天时展开。"},"examples":[{"en":"Many legumes have nyctinastic leaves that fold up after sunset.","zh":"许多豆科植物的叶子具有夜眠性，日落后会合拢。"},{"en":"The nyctinastic closing of the flower helps protect its delicate parts overnight.","zh":"花朵的夜眠性闭合有助于在夜间保护其脆弱部位。"}]}],"synonyms":["night-closing","nocturnal (in plant context)","nastic (general term)"],"phonetic":"/ˌnɪk.tɪˈnæs.tɪk/","extraExplanation":["“Nyctinastic”来自希腊语词根 nyct-（夜晚）+ -nastic（表示由刺激引起的运动）。它描述的是由昼夜变化（尤其是光暗变化）触发的植物运动，而不是植物“朝向”某个方向生长。常见例子包括含羞草类、豆科植物叶片夜间合拢，以及某些花在夜间闭合。"]}
{"word":"nyctinasty","summary":{"en":"Nyctinasty is a plant’s nighttime “sleep movement,” like leaves or flowers closing when it gets dark.","zh":"Nyctinasty 指植物在夜间因天黑而出现的“睡眠运动”，如叶或花在暗处闭合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the nightly movement of some plants (such as leaves or flowers) that open, close, or change position in response to darkness","zh":"某些植物在夜间发生的“睡眠运动”：叶片或花朵会因天黑而开合或改变姿态"},"examples":[{"en":"The folding of mimosa leaves at night is an example of nyctinasty.","zh":"含羞草叶子在夜间合拢就是一种夜生性运动（nyctinasty）。"},{"en":"Scientists studied nyctinasty to understand how plants respond to daily light–dark cycles.","zh":"科学家研究夜生性运动，以了解植物如何对昼夜光照周期作出反应。"}]}],"synonyms":["sleep movement (plants)"],"phonetic":"/nɪkˈtɪnəsti/","extraExplanation":["词源上来自希腊语：nyct- 表示“夜”，-nasty（来自 nastos）表示“受刺激引起的运动”。因此它强调的是“由天黑/昼夜变化触发的运动”，而不一定是向着某个方向生长。","nyctinasty 常见于豆科植物等：夜间叶片合拢、花朵闭合，有助于减少水分散失、保温或降低夜间受损风险。","相关词：photonasty（光照引起的开合运动，侧重光强变化）；thigmonasty（触碰引起的运动，如含羞草被碰后合拢）。"]}
{"word":"nyctipelagic","summary":{"en":"Nyctipelagic describes open-ocean life or activity that happens at night, often involving animals moving upward after dark.","zh":"Nyctipelagic 指与夜间外洋活动有关，常描述海洋动物夜间上浮活动的现象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the open ocean (pelagic zone) at night, especially describing animals that rise toward the surface after dark and return to deeper water by day.","zh":"与夜间的外洋（水体远离海岸的区域）有关；尤指一些海洋动物夜间上浮、白天下潜的行为或分布。"},"examples":[{"en":"Many lanternfish are nyctipelagic, feeding near the surface at night.","zh":"许多灯笼鱼具有“夜间外洋性”（nyctipelagic）的习性，夜里到近海表层觅食。"},{"en":"Scientists used sonar to track nyctipelagic migration patterns across the water column.","zh":"科学家用声呐追踪这些生物在水柱中夜间上浮的迁移模式。"}]}],"synonyms":["noctipelagic","nighttime pelagic","nocturnal pelagic"],"phonetic":"/ˌnɪk.ti.pəˈlædʒ.ɪk/","extraExplanation":["词源提示：nycti- 来自希腊语 *nyx/nykt-*（夜晚），-pelagic 来自 *pelagos*（大海）。这个词多见于海洋生物学/生态学文献，用来强调“夜间在外洋活动”的时间特征。","相关概念：常与 *diel vertical migration*（昼夜垂直迁移）一起出现，描述很多中深层生物夜间上浮、白天下潜，以觅食并躲避捕食者。"]}
{"word":"nyctipithecinae","summary":{"en":"Nyctipithecinae is a scientific name for a subfamily classification that includes night monkeys (Aotus).","zh":"Nyctipithecinae 是一个科学分类名，指包含夜猴（Aotus）的一个“亚科”层级。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily of New World monkeys that includes the night monkeys (genus Aotus).","zh":"（分类学）一类新世界猴的“亚科”，包括夜猴（Aotus 属）。"},"examples":[{"en":"Nyctipithecinae includes the night monkeys, which are active mainly at night.","zh":"Nyctipithecinae 包括夜猴，它们主要在夜间活动。"},{"en":"Some older sources place Aotus in the subfamily Nyctipithecinae.","zh":"一些较早的资料会把 Aotus（夜猴属）归入 Nyctipithecinae 这个亚科。"}]}],"synonyms":["night monkey subfamily","Aotus (related term)","Aotidae (modern related classification)"],"phonetic":"/ˌnɪk.tə.pɪˈθiː.sɪˌniː/","extraExplanation":["这是一个拉丁化的动物分类名称：Nycti-（与“夜晚”有关，源自希腊语 nyx/nykt- “夜”）+ pithec-（“猴/猿”，常见于灵长类命名）+ -inae（动物学中表示“亚科”的后缀）。","在现代分类中，夜猴通常被放在独立的科 Aotidae（夜猴科）中；因此你会在不同年代、不同文献里看到 Nyctipithecinae 的使用频率和地位不太一样。读文献时可同时留意 Aotus、Aotidae 等相关词。"]}
{"word":"nyctipithecine","summary":{"en":"Nyctipithecine means “related to (or a member of) owl monkeys,” a nocturnal group of New World primates.","zh":"nyctipithecine 指“与夜猴／枭猴有关的（或其成员）”，是一类夜行的新大陆灵长类动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to owl monkeys (a group of night-active New World monkeys, formerly placed in the genus *Nyctipithecus*)","zh":"（形容词）与夜猴／枭猴有关的（一种夜行的新大陆猴类，过去常归入属名 *Nyctipithecus*）"},"examples":[{"en":"The paper discusses nyctipithecine behavior in low-light forests.","zh":"这篇论文讨论了夜猴（nyctipithecine）在弱光森林中的行为。"},{"en":"Researchers compared nyctipithecine vision to that of other primates.","zh":"研究人员比较了夜猴（nyctipithecine）的视觉与其他灵长类动物的差异。"}]},{"partOfSpeech":"n.","definition":{"en":"an owl monkey; a member of the nyctipithecine group","zh":"（名词）夜猴／枭猴；夜猴类群的一员"},"examples":[{"en":"Nyctipithecines are known for their large eyes adapted to nighttime activity.","zh":"夜猴类（nyctipithecines）以适应夜间活动的大眼睛而闻名。"}]}],"synonyms":["owl-monkey (related term)","Aotus (scientific name, common in modern sources)"],"phonetic":"/ˌnɪk.tɪ.pɪˈθiːsaɪn/","extraExplanation":["词源提示：nycti- 来自希腊语 *nyx/nykt-*（“夜晚”），-pithecine 与希腊语 *pithēkos*（“猿/猴”）有关，所以字面可理解为“夜行的猴类”。","分类学补充：现代分类中“夜猴”多用属名 *Aotus*（owl monkeys）。因此在较新的资料里，你可能更常见到 *Aotus* 或 “owl monkey”，而 “nyctipithecine” 多见于较旧或偏专业的动物学/灵长类学文献。"]}
{"word":"nyctipithecus","summary":{"en":"Nyctipithecus is an older scientific name for the night monkeys, now usually classified as Aotus.","zh":"Nyctipithecus 是夜猴（猫头鹰猴）的旧属名，现多归入 Aotus（夜猴属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for the night monkeys (also called owl monkeys); today they are usually classified in the genus Aotus","zh":"（旧）夜猴／猫头鹰猴的一个属名；如今通常把它们归入“夜猴属”（Aotus）"},"examples":[{"en":"Nyctipithecus was once used as the genus name for night monkeys, but most modern sources use Aotus.","zh":"Nyctipithecus 曾被用作夜猴的属名，但现代多数资料使用 Aotus。"},{"en":"The animal formerly called Nyctipithecus trivirgatus is now commonly placed in Aotus.","zh":"过去称为 Nyctipithecus trivirgatus 的动物，现在一般归入 Aotus。"}]}],"synonyms":["Aotus","night monkey","owl monkey"],"phonetic":"/ˌnɪk.tɪˈpɪθ.ɪ.kəs/","extraExplanation":["这是一个动物分类学上的“旧称”。随着研究方法改进（形态比较、遗传数据等），灵长类的属级分类发生调整；因此你在老文献或旧版动物志里更可能见到 Nyctipithecus，在现代科普或学术资料里通常看到 Aotus。","词源上，nycti- 来自希腊语，表示“夜晚”，-pithecus 表示“猿/猴”，合起来大意是“夜行的猴”。"]}
{"word":"nyctitropic","summary":{"en":"Nyctitropic means “showing a night-time change in position,” especially leaves that fold or droop in the dark.","zh":"Nyctitropic 指“在夜间改变姿态（位置）”，尤指叶片在黑暗中合拢或下垂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Describing a plant or plant part that changes position at night (for example, leaves that fold or droop in darkness).","zh":"（植物学）指植物或其部分在夜间会改变姿态（例如叶片在黑暗中合拢或下垂）。"},"examples":[{"en":"Nyctitropic leaves fold up at dusk and open again in the morning.","zh":"具有夜间向性（nyctitropic）的叶子在黄昏时合拢，早晨再展开。"},{"en":"The researcher measured the nyctitropic movement of the plant’s leaflets in low light.","zh":"研究人员在微光条件下测量了该植物小叶的夜间向性运动。"}]}],"synonyms":["night-folding","nocturnal leaf movement","nyctinastic (related)"],"phonetic":"/ˌnɪk.təˈtrɑp.ɪk/","extraExplanation":["词源：来自希腊语 nyx/nykt-（夜晚）+ tropē（转向、改变方向），字面意思接近“夜间转向/夜间改变姿态”。","常见关联词：nyctinasty（睡眠运动/夜眠运动），更常用于描述“由光暗变化引发的夜间开合运动”。nyctitropic 偏向作形容词来修饰这种现象或结构。","使用场景：该词较偏学术，多见于植物生理学、植物行为或生态学的描述；日常英语中更常用的说法是 “leaves that close at night（夜间合拢的叶子）”。"]}
{"word":"nyctitropism","summary":{"en":"Nyctitropism is the night-related “sleep” movement of plants, such as leaves folding in darkness and reopening in daylight.","zh":"Nyctitropism 指植物对黑暗（夜晚）作出的“睡眠式”运动，如叶片夜间合拢、白天再展开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant’s movement or change in position in response to darkness, especially the “sleep” movements of leaves or flowers that close at night and open in daylight","zh":"植物对黑暗产生的运动或姿态变化；尤指叶片或花朵在夜间闭合、白天展开的“睡眠运动”"},"examples":[{"en":"Many legumes show nyctitropism: their leaves fold up at night and open again in the morning.","zh":"许多豆科植物会出现夜行性运动：夜里叶片合拢，早晨又重新展开。"},{"en":"The scientist measured nyctitropism by comparing leaf angles in daylight versus after sunset.","zh":"这位科学家通过比较白天与日落后叶片的角度来测量夜行性运动。"}]}],"synonyms":["sleep movement","nyctinasty"],"phonetic":"/ˌnɪk.təˈtroʊ.pɪ.zəm/","extraExplanation":["词源：来自希腊语 nyx/nykt-（“夜”）+ tropismos（“转向、转动”）。因此它字面意思就是“向夜转动”。","常见对比：nyctitropism 是对“明暗变化”作出反应（夜晚/黑暗）；而 phototropism（向光性）主要是对“光的方向”作出反应（朝向光源生长或转动）。","使用场景：多见于植物学、生态学或科普文章中，日常口语很少用。"]}
{"word":"nycto","summary":{"en":"“Nycto-” is a scientific prefix meaning “night; relating to the night.”","zh":"“nycto-”是表示“夜晚/与夜间有关”的学术性前缀。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix/combining form meaning “night” or “related to the night,” used mainly in scientific and medical terms.","zh":"表示“夜晚 / 与夜间有关”的前缀（构词成分），多用于科学与医学词汇中。"},"examples":[{"en":"Nyctophobia means an intense fear of the dark or the night.","zh":"Nyctophobia 指对黑暗或夜晚的强烈恐惧。"},{"en":"Some animals are described as nycturnal (more commonly: nocturnal), meaning they are active at night.","zh":"有些动物会被描述为 nycturnal（更常见拼法：nocturnal），意思是夜间活动。"},{"en":"In botany, nyctinasty describes plants that open or close their leaves at night.","zh":"在植物学中，nyctinasty 指植物在夜间叶片开合的现象。"}]}],"synonyms":["noct-","nocto-"],"phonetic":"/ˈnɪktoʊ/","extraExplanation":["“nyct- / nycto-”来自希腊语 **nyx / nykt-**（夜）。英语里更常见、使用范围更广的“夜”前缀是拉丁来源的 **noct- / nocto-**（如 *nocturnal*）。","这个前缀多出现在较学术的词里：**nyctophobia**（怕黑/怕夜）、**nyctophilia**（偏爱夜晚）、**nyctinasty**（夜间感运动）。日常表达通常直接用 *at night, nighttime, after dark* 等。"]}
{"word":"nyctophobia","summary":{"en":"Nyctophobia means an intense fear of the dark or nighttime.","zh":"Nyctophobia 指对黑暗或夜晚的强烈恐惧（恐暗症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of the dark or of nighttime","zh":"对黑暗或夜晚的强烈恐惧（恐暗症）"},"examples":[{"en":"As a child, she had nyctophobia and slept with a small lamp on.","zh":"她小时候有恐暗症，睡觉时会开一盏小灯。"},{"en":"His nyctophobia made camping trips stressful, especially after sunset.","zh":"他的恐暗症让露营变得很有压力，尤其是日落之后。"},{"en":"Therapy helped her manage nyctophobia by gradually getting used to darkness.","zh":"治疗通过循序渐进地适应黑暗，帮助她管理恐暗症。"}]}],"synonyms":["fear of the dark","scotophobia","achluophobia"],"phonetic":"/ˌnɪktoʊˈfoʊbiə/","extraExplanation":["词源：来自希腊语 nycto-（夜、黑暗）+ -phobia（恐惧）。","在日常英语里，人们更常说“fear of the dark”。“Nyctophobia”更偏医学或心理学语境，用于描述较强烈、可能影响生活的恐惧。","区分：它不等同于一般的“晚上不喜欢关灯”，而是更接近“恐惧感明显、会回避黑暗情境”的状态。"]}
{"word":"nycturia","summary":{"en":"Nycturia is waking up at night to urinate, often repeatedly.","zh":"Nycturia 指夜里起床排尿（夜尿症/夜间尿频），常会反复发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The need to wake up during the night to urinate (pass urine), often more than once.","zh":"夜尿症／夜间尿频：夜里需要起床排尿（小便），常常不止一次。"},"examples":[{"en":"She has been waking up three times a night because of nycturia.","zh":"她因为夜尿症每晚要醒来三次去小便。"},{"en":"Treating his sleep apnea helped reduce his nycturia.","zh":"治疗他的睡眠呼吸暂停后，他的夜间尿频减少了。"}]}],"synonyms":["nighttime urination","nocturnal urination","nocturia (common variant)"],"phonetic":"/nɪkˈtjʊriə/","extraExplanation":["词源提示：nycturia 来自希腊语 nykt-（夜晚）+ -uria（与尿有关的情况）。字面意思就是“夜间排尿”。","常见相关原因包括：睡前喝太多水/咖啡/酒、泌尿道感染、前列腺增生（男性）、糖尿病、利尿剂（某些降压药）、怀孕、睡眠问题（如睡眠呼吸暂停）等。它本身是“症状/现象”，不是具体疾病名称。","用法提醒：在医疗语境中很常见；日常口语更常说 “I wake up to pee at night.”（我晚上会起来尿尿。）若长期影响睡眠，建议就医评估。"]}
{"word":"nydia","summary":{"en":"Nydia (sometimes written as nydia) is mainly used as a female personal name; it’s also known from a classic novel character.","zh":"Nydia（有时写作 nydia）主要是女性人名；也因一部经典小说中的人物而为人所知。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a personal name), sometimes used as a variant spelling of “Nydia.”","zh":"女性名字（人名），有时是 “Nydia” 的一种拼写变体。"},"examples":[{"en":"Nydia is my classmate; she just moved here from Texas.","zh":"Nydia 是我的同学；她刚从德州搬来这里。"},{"en":"They named their daughter Nydia after a character in a novel.","zh":"他们给女儿取名 Nydia，是因为一本小说里的人物。"}]}],"synonyms":["Nydia","Lydia (related name, not the same)"],"phonetic":"/ˈnɪdiə/","extraExplanation":["“Nydia”更常见于英语世界的拼写；“nydia”这种全小写形式在现实中多见于用户名、网名或非正式写法。","在英语文学里，Nydia 是爱德华·布尔沃-利顿（Edward Bulwer-Lytton）小说《庞贝城的末日》（The Last Days of Pompeii, 1834）中的一个角色：一位失明的卖花女孩。有人会因为这个文学形象而使用这个名字。","如果你想找的是“Lydia”（更常见的名字），拼写和读音都很接近，但它是另一个不同来源的名字。"]}
{"word":"nye","summary":{"en":"NYE usually means New Year’s Eve (December 31).","zh":"NYE 通常指新年前夜（12月31日）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(NYE) New Year’s Eve; the night of December 31, when people celebrate the start of the new year.","zh":"（NYE）新年前夜；12月31日晚上，人们庆祝新年即将到来。"},"examples":[{"en":"We’re having a small party on NYE.","zh":"我们在新年前夜办一个小派对。"},{"en":"The city is always crowded on NYE because of the fireworks.","zh":"新年前夜因为烟花，城里总是很拥挤。"}]}],"synonyms":["New Year’s Eve","Dec. 31 (informal)"],"phonetic":"/ˌnuː ˈjɪrz ˈiːv/","extraExplanation":["“NYE”是英语里非常常见的缩写，尤其在社交媒体、活动海报和聊天中。正式写作中也可以直接写全称“New Year’s Eve”。","注意不要和“New Year’s Day”（新年当天，1月1日）混淆：Eve=前夜，Day=当天。"]}
{"word":"nyet","summary":{"en":"“Nyet” means “no” (from Russian), often used in English for a strong or humorous refusal.","zh":"“Nyet”源自俄语，意思是“不”，在英语里常用于强烈或带幽默感的拒绝。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(from Russian) “No.” Used as a strong, emphatic refusal or rejection, often for humorous or dramatic effect in English.","zh":"（源自俄语）“不。”在英语中常用来表示强烈、干脆的否定或拒绝，常带有幽默或戏剧化效果。"},"examples":[{"en":"You want me to work this weekend? Nyet.","zh":"你想让我这个周末加班？不。"},{"en":"The spy answered every question with a cold “Nyet.”","zh":"那名间谍对每个问题都冷冷地回答：“不。”"},{"en":"The meme caption just says “Nyet” to show total rejection.","zh":"这个梗图的配文只写“Nyet”，表示完全拒绝。"}]}],"synonyms":["no","nope","nah"],"phonetic":"/njɛt/","extraExplanation":["“Nyet”是俄语“нет”的英语转写/音译。在英语语境里，它常被用来营造“俄式/苏俄风格”的语感（电影台词、冷战题材、网络梗等），语气通常比普通的“no”更强硬、更干脆。","注意在正式写作中一般不用“nyet”，更多见于口语、影视对白、网络表达或带有风格化的写作。"]}
{"word":"nylast","summary":{"en":"“Nylast” is not a common English vocabulary word; it’s likely a name/brand or a typo for a similar word.","zh":"“nylast”不是常见英语词汇；更可能是名称/品牌，或与某个相近单词拼写混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a brand/name, or a username.","zh":"不是标准英语单词；更可能是拼写错误、品牌/名称或用户名。"},"examples":[{"en":"I couldn’t find “nylast” in an English dictionary—did you mean “nylon” or “playlist”?","zh":"我在英语词典里找不到“nylast”——你是不是想写“nylon（尼龙）”或“playlist（播放列表）”？“}],"}]}],"phonetic":"ˈnaɪlæst","extraExplanation":["“nylast”更像是输入错误：常见接近的词包括 nylon（尼龙）、last（最后/持续）、playlist（播放列表）等。","如果你能提供上下文（完整句子、你在哪看到的、它是人名/品牌/产品名吗），我可以更准确判断它的意思。"]}
{"word":"nylgau","summary":{"en":"“nylgau” is not a recognized English vocabulary word; it’s probably a name or a typo.","zh":"“nylgau”不是常见的英语词汇；更可能是名字/网名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a proper name (e.g., a username, surname, or place name).","zh":"不是标准英语单词；更可能是拼写错误或专有名词（如用户名、姓氏或地名）。"},"examples":[{"en":"I couldn’t find “nylgau” in an English dictionary—do you mean a different word?","zh":"我在英语词典里找不到“nylgau”——你是不是想写另一个词？"},{"en":"“nylgau” appears to be used as a screen name in some online contexts.","zh":"“nylgau”在一些网络语境里看起来像是用户名/昵称。"}]}],"phonetic":"/ˈnɪlɡaʊ/","extraExplanation":["“nylgau”很可能是拼写打错了。如果你能提供一句话的上下文（它出现在哪个句子/网页/游戏里），我可以帮你判断它可能是哪个英文单词。","常见的排查方法：①确认是否大小写（专有名词）②是否漏了字母/多了字母 ③是否是其他语言的词或人名地名。"]}
{"word":"nylghai","summary":{"en":"Nilgai: a large antelope from India, also called the blue bull.","zh":"Nilgai：一种来自印度的大型羚，又称“蓝牛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large Asian antelope (Boselaphus tragocamelus), also called the blue bull, found mainly in northern India","zh":"一种大型亚洲羚（学名 Boselaphus tragocamelus），又称“蓝牛”，主要分布在印度北部"},"examples":[{"en":"A nilgai crossed the road at dawn near the edge of the forest.","zh":"黎明时分，一只印度羚在森林边缘穿过了公路。"},{"en":"Farmers sometimes view nilgai as a nuisance because they may damage crops.","zh":"农民有时把印度羚视为麻烦，因为它们可能破坏庄稼。"}]}],"synonyms":["blue bull","Boselaphus tragocamelus"],"phonetic":"/ˈnɪlˌɡaɪ/","extraExplanation":["你写的“nylghai”更常见的拼写是 **nilgai**（也写作 *nilghai*）。这个词来自印地语/乌尔都语：*nīl*（蓝色）+ *gāy*（牛），所以英文里常叫 **blue bull（蓝牛）**。"]}
{"word":"nylghais","summary":{"en":"“nylghais” is not a standard English word; please provide context or the intended spelling.","zh":"“nylghais”不是标准英语单词；请提供上下文或你想写的正确拼法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This doesn’t appear to be a recognized English word (it may be a typo, a name, or a word from another language).","zh":"这看起来不像是一个常见的英语单词（可能是拼写错误、人名，或来自其他语言）。"},"examples":[{"en":"I couldn’t find “nylghais” in an English dictionary—could you share the sentence it comes from?","zh":"我在英语词典里找不到“nylghais”——你能提供它所在的句子吗？"},{"en":"If you meant a different spelling, I can explain the correct word and its usage.","zh":"如果你想写的是另一个拼法，我可以解释正确单词及其用法。"}]}],"extraExplanation":["请你确认一下：\n1) 这是从哪里看到的（书、游戏、歌词、社交媒体）？\n2) 你想表达的意思是什么，或它前后各一句是什么？\n3) 是否可能是这些情况：打字错误、专有名词（人名/地名/品牌）、或其他语言的词（比如阿拉伯语/波斯语/印地语等音译）？\n给我上下文后，我可以帮你定位最可能的正确拼写与含义。"]}
{"word":"nylghau","summary":{"en":"“nylghau” is likely a variant spelling of *nilgai*, a large antelope from India, also known as the blue bull.","zh":"“nylghau”很可能是 *nilgai* 的拼写变体，指一种来自印度的大型羚羊，也叫“蓝牛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large Asian antelope (Boselaphus tragocamelus), also called the blue bull, native to the Indian subcontinent","zh":"一种大型亚洲羚羊（印度羚/蓝牛，学名 Boselaphus tragocamelus），原产于印度次大陆"},"examples":[{"en":"We saw a nilgai grazing near the edge of the forest.","zh":"我们看到一只印度羚在森林边缘吃草。"},{"en":"In parts of India, the nilgai is often called the “blue bull.”","zh":"在印度的一些地区，印度羚常被称为“蓝牛”。"}]}],"synonyms":["nilgai","blue bull"],"phonetic":"/ˈnɪlˌɡaɪ/","extraExplanation":["“nylghau”不是常见的标准英文拼写，更常见的拼法是 **nilgai**（也可见 **nilgau / nylghai** 等变体），来源与印度的本地语言有关。","它在英语里属于较少见的动物名词，常出现在自然纪录片、动物学或南亚相关的阅读材料中。"]}
{"word":"nylghaus","summary":{"en":"“nylghaus” is not a recognized English vocabulary word; context is needed to identify what it refers to.","zh":"“nylghaus”不是常见/标准的英语词汇；需要上下文才能判断它指什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a family name, or a term from another language/game. Please share the context or the intended spelling.","zh":"不是标准英语单词。可能是拼写错误、用户名/昵称、姓氏，或来自其他语言/游戏的词。请提供上下文或你想表达的正确拼写。"},"examples":[{"en":"I searched for “nylghaus,” but I couldn’t find a dictionary entry—do you mean a different word?","zh":"我查了“nylghaus”，但词典里没有这个词——你是不是想写另一个词？"},{"en":"Can you use “nylghaus” in a sentence so I can guess what it means?","zh":"你能用“nylghaus”造个句吗？这样我才能判断它的意思。"}]}],"phonetic":"/ˈnɪlɡhaʊs/","extraExplanation":["如果你是想查某个英文单词，可能存在键盘误触或漏/多输入字母。你可以告诉我：它出现在哪里（游戏、聊天、书名、地名、品牌等）、大概意思、或原句，我就能更准确地帮你定位可能的正确拼写与含义。","常见的排查方法：把词拆开看是否像两个词的组合（例如类似“___ house/haus”），或提供近似发音（你读起来像什么）。"]}
{"word":"Nylon","summary":{"en":"Nylon is a common synthetic material; it can also mean nylon stockings (nylons).","zh":"Nylon 指常见的合成材料“尼龙”；也可指“尼龙丝袜”（常用复数 nylons）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, lightweight synthetic material used to make clothing, ropes, bags, and many other products","zh":"尼龙；一种坚固、轻便的人造（合成）材料，用于制作衣物、绳索、包等多种产品"},"examples":[{"en":"This jacket is made of nylon, so it dries quickly.","zh":"这件夹克是尼龙的，所以干得很快。"},{"en":"Use a nylon rope because it is strong and doesn’t break easily.","zh":"用尼龙绳吧，因为它很结实，不容易断。"}]},{"partOfSpeech":"n.","definition":{"en":"nylon stockings or tights worn on the legs (often used in the plural: nylons)","zh":"（常用复数）尼龙丝袜/长筒袜（nylons）"},"examples":[{"en":"She bought a pair of black nylons for work.","zh":"她买了一双黑色尼龙丝袜上班穿。"},{"en":"These nylons snag easily, so be careful with sharp nails.","zh":"这双尼龙丝袜很容易勾丝，指甲尖的话要小心。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of nylon","zh":"尼龙制的"},"examples":[{"en":"He carried a nylon backpack on his trip.","zh":"他旅行时背了一个尼龙背包。"}]}],"synonyms":["synthetic fiber","polyamide","stockings (for the clothing meaning)"],"phonetic":"/ˈnaɪlɑn/","extraExplanation":["尼龙（nylon）是20世纪最早被广泛使用的合成纤维之一，最初以“像丝一样但更耐用”的材料而闻名。英语里说“nylons”常特指丝袜，这与尼龙早期在服装领域（尤其是袜类）的大规模应用有关。","在文学或日常表达中，nylon 有时会带出一种“现代、实用、工业化材料”的感觉（对比 silk 丝绸、cotton 棉等天然材质）。"]}
{"word":"nylon","summary":{"en":"Nylon is a strong synthetic fiber/material used for clothes and many everyday products.","zh":"Nylon（尼龙）是一种结实的合成纤维/材料，用于衣物和许多日常用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, lightweight synthetic material (a type of plastic fiber) used to make clothing, bags, ropes, and many other products","zh":"尼龙；一种结实、轻便的合成材料（塑料纤维），常用于制作衣物、包、绳子等"},"examples":[{"en":"These stockings are made of nylon.","zh":"这双长筒袜是尼龙做的。"},{"en":"The jacket has a nylon lining to block the wind.","zh":"这件夹克有尼龙内衬，可以挡风。"},{"en":"We used a nylon rope to tie the boxes securely.","zh":"我们用尼龙绳把箱子牢牢捆住。"}]}],"synonyms":["synthetic fiber","polyamide"],"phonetic":"/ˈnaɪlɑn/","extraExplanation":["“Nylon（尼龙）”最初是20世纪30年代由美国杜邦公司开发的一类合成纤维，因结实、耐磨、弹性好而迅速流行。常见搭配：nylon stockings（尼龙袜）、nylon jacket（尼龙夹克）、nylon rope（尼龙绳）、nylon bag（尼龙包）。","在英语里，nylon既可指“这种材料”，也可在口语中用来指“尼龙制品”（如nylons=尼龙袜，英式英语中更常见）。"]}
{"word":"nylons","summary":{"en":"“Nylons” most commonly means nylon stockings/tights; it can also mean nylon fabric/material in general.","zh":"“nylons”最常指尼龙丝袜/连裤袜；也可泛指尼龙面料或材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stockings or tights made from nylon (a smooth, strong synthetic fiber).","zh":"尼龙丝袜；尼龙长筒袜/连裤袜（由尼龙这种光滑耐用的合成纤维制成）。"},"examples":[{"en":"She wore black nylons with her dress.","zh":"她穿着黑色尼龙丝袜配那条裙子。"},{"en":"Do you sell sheer nylons in this store?","zh":"这家店卖薄款尼龙丝袜吗？"}]},{"partOfSpeech":"n.","definition":{"en":"The nylon material or fabric (used for clothing and other products).","zh":"尼龙材料；尼龙织物（用于衣物和其他产品）。"},"examples":[{"en":"These pants are made of nylons and dry quickly.","zh":"这条裤子是尼龙材质的，干得很快。"},{"en":"Nylons are often used for lightweight jackets.","zh":"尼龙常用于轻便夹克。"}]}],"synonyms":["nylon stockings","stockings","tights","hose","nylon fabric"],"phonetic":"/ˈnaɪlɑːnz/","extraExplanation":["“nylon”最早是20世纪30年代由美国杜邦公司推广的合成纤维名称，后来在日常英语里，“nylons”常特指“尼龙丝袜”。在英式英语中也常说“nylon stockings/nylons”。"]}
{"word":"nymil","summary":{"en":"“nymil” isn’t a standard English word; it’s probably a name, acronym, or misspelling.","zh":"“nymil”不是标准英文词；可能是名字、缩写或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; likely a proper name, acronym, or a misspelling of another word.","zh":"不是主要英文词典中的标准词；更可能是专有名词、缩写，或其他词的拼写错误。"},"examples":[{"en":"I couldn’t find “nymil” in a dictionary—do you have a sentence with it?","zh":"我在词典里找不到“nymil”——你能给我一个包含它的句子吗？"},{"en":"“Nymil” might be a username or a brand name rather than an English vocabulary word.","zh":"“Nymil”可能是用户名或品牌名，而不是常见英文词汇。"}]}],"phonetic":"/ˈnaɪmɪl/","extraExplanation":["“nymil”很像拼写误差：例如你是否想写的是 **nihil**（拉丁语，常见于英文语境中表示“虚无/无”）、**nymph**（仙女/水泽女神）或某个缩写？如果你把它出现的上下文（句子、截图、领域：游戏/医学/化学等）发来，我可以更准确判断并给出对应词义与用法。"]}
{"word":"nymph","summary":{"en":"A nymph is usually a female nature spirit in classical mythology, and it can also mean a young stage of certain insects.","zh":"nymph 通常指古典神话中的女性自然精灵（宁芙），也可指某些昆虫的未成熟阶段（若虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Greek and Roman mythology) a female nature spirit, often connected with forests, rivers, mountains, or the sea.","zh":"（希腊、罗马神话中）宁芙：女性自然精灵/女神灵，常与森林、河流、山岳或海洋相关。"},"examples":[{"en":"In the story, a nymph protects the spring deep in the woods.","zh":"在故事里，一位宁芙守护着森林深处的泉水。"},{"en":"Ancient poets wrote about river nymphs who guided travelers.","zh":"古代诗人写过引导旅人的河之宁芙。"}]},{"partOfSpeech":"n.","definition":{"en":"a young insect (such as a dragonfly) that looks like a small adult but does not yet have full adult features; it lives in water or on land depending on the species.","zh":"（昆虫学）若虫：外形像缩小版成虫但尚未完全成熟的幼虫阶段（依物种可能生活在水中或陆地）。"},"examples":[{"en":"We saw dragonfly nymphs in the pond during our field trip.","zh":"实地考察时，我们在池塘里看到了蜻蜓若虫。"},{"en":"A nymph becomes an adult after several molts.","zh":"若虫会在多次蜕皮后变成成虫。"}]}],"synonyms":["nature spirit","dryad","naiad","larva (not exact)","immature insect"],"phonetic":"/nɪmf/","extraExplanation":["“nymph”来自拉丁语 nympha，源头可追溯到古希腊语 νύμφη（nýmphē），含义与“新娘/年轻女子”有关，因此在神话语境里常带有“青春、自然之美”的联想。","文学与艺术中常出现宁芙形象：例如莎士比亚作品里会提到“nymphs”（宁芙）来营造森林或水边的神秘氛围。现代英语里也常用在奇幻/神话题材中。","使用提示：神话义较常见于文学、艺术、游戏/奇幻叙事；昆虫学义多见于自然科普、生态观察等语境。"]}
{"word":"nympha","summary":{"en":"Nympha is a less common form of “nymph,” meaning an immature insect stage, a mythological nature spirit, or (medical) the labia minora.","zh":"Nympha 是较少见的 nymph 形式，可指昆虫的若虫、神话中的自然精灵（宁芙/仙女），或（医学）小阴唇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, especially entomology) An immature insect stage that looks like a small adult but is not fully developed (often used interchangeably with “nymph”).","zh":"（生物学，尤指昆虫学）若虫：外形像小型成虫但尚未完全发育的阶段（常与 nymph 互用）。"},"examples":[{"en":"After hatching, the insect lives as a nympha before becoming an adult.","zh":"孵化后，这种昆虫会先以若虫（nympha）的形态生活，之后才变成成虫。"},{"en":"Under a microscope, the nympha already has legs and antennae.","zh":"在显微镜下，这只若虫已经有了腿和触角。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary or classical usage) A nymph; a nature spirit in Greek and Roman mythology.","zh":"（文学/古典用法）宁芙/仙女：希腊罗马神话中的自然精灵。"},"examples":[{"en":"In the poem, a forest nympha guards the spring.","zh":"在诗中，一位森林仙女（nympha）守护着泉水。"},{"en":"The statue was described as a marble nympha beside the river.","zh":"那座雕像被描写成河边的一位大理石仙女（nympha）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy, plural often “nymphae”) The labia minora; the inner folds of the vulva (formal/medical).","zh":"（解剖学，复数常作 nymphae）小阴唇：外阴内侧的皱襞（正式/医学用语）。"},"examples":[{"en":"The medical text uses the term nymphae for the labia minora.","zh":"这本医学教材用 nymphae 指代小阴唇。"},{"en":"This term may appear in older anatomy books as nympha.","zh":"在较旧的解剖学书籍中，这个词可能写作 nympha。"}]}],"synonyms":["nymph","naiad (myth)","dryad (myth)"],"phonetic":"/ˈnɪmfə/","extraExplanation":["“nympha”源自拉丁语 nympha（来自希腊语 númphē），本义与神话中的“宁芙/水泽林木的自然精灵”有关。后来该词在科学语境中被借用来指“尚未成熟但具备成体雏形”的阶段，因此在昆虫学里常见。","现代英语中更常用的形式是 “nymph”（若虫/宁芙）。在解剖学里，nympha（复数 nymphae）多见于较正式或较旧的医学文献；日常表达通常不用这个词。"]}
{"word":"nymphae","summary":{"en":"Nymphae is a formal plural term most commonly used to mean the labia minora (inner folds of the vulva); more rarely, it can mean “nymphs” in a literary, Latin-based style.","zh":"Nymphae是一个较正式的复数词，最常指小阴唇（外阴内侧皱襞）；更少见时可在文学化、拉丁语风格中指“宁芙/女精灵”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, formal) The labia minora; the inner folds of the vulva. “Nymphae” is the plural of “nympha.”","zh":"（解剖学，正式用语）小阴唇；外阴内侧的两片皮肤皱襞。“nymphae”是“nympha”的复数。"},"examples":[{"en":"The textbook describes the nymphae as the inner folds of the vulva.","zh":"教材把nymphae描述为外阴的内侧皱襞。"},{"en":"In clinical notes, the doctor recorded mild swelling of the nymphae.","zh":"在病历记录中，医生记载小阴唇（nymphae）轻微肿胀。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, literary/Latin-based) Nymphs; female nature spirits in classical mythology.","zh":"（罕见，文学/拉丁语风格）宁芙；古典神话中的自然女精灵。"},"examples":[{"en":"In a few older poems, the forest is said to be guarded by nymphae.","zh":"在一些较早的诗歌里，森林被写作由宁芙（nymphae）守护。"}]}],"synonyms":["labia minora (most common modern term)","nympha (singular)"],"phonetic":"/ˈnɪmfiː/","extraExplanation":["“nymphae”在现代英语里最常见于医学/解剖学语境（指小阴唇），属于比较正式、也较私密的词；日常英语通常直接说“labia minora”。","词源来自希腊语 nymphē（宁芙/新娘），拉丁语 nympha。早期解剖学有时借用神话词汇来命名人体部位，因此出现了这种用法。"]}
{"word":"nymphaea","summary":{"en":"Nymphaea is the scientific genus name for water lilies—aquatic plants with floating leaves and showy pond flowers.","zh":"Nymphaea 是“睡莲（water lily）”的学名属名，指一类叶片漂浮、花朵艳丽的水生植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aquatic plants commonly called water lilies, with round floating leaves and large, often fragrant flowers that grow on ponds and slow-moving water","zh":"睡莲属（水生植物的一属），常称“睡莲/水百合”，叶片圆形漂浮水面，花大且常有香味，多生于池塘或缓流水域"},"examples":[{"en":"Nymphaea flowers opened on the pond in the morning sunlight.","zh":"睡莲属的花在清晨阳光下在池塘里绽放。"},{"en":"The garden features a small pool planted with Nymphaea (water lilies).","zh":"花园里有一个小水池，种着睡莲属植物（睡莲）。"}]}],"synonyms":["water lily"],"phonetic":"/nɪmˈfiːə/","extraExplanation":["“Nymphaea”是拉丁化的学名，常见英文俗名是“water lily”。在日常英语里，人们通常不会说“Nymphaea”，除非是在植物学、园艺或标签/说明书中。","词源与希腊/拉丁语中的“nymph（宁芙，水泽仙女）”有关，因此这个学名带有“水中精灵/仙女”的文化联想。"]}
{"word":"nymphaeaceae","summary":{"en":"Nymphaeaceae is the botanical family name for water lilies and their close relatives.","zh":"Nymphaeaceae 是睡莲科的植物学科名，指睡莲及其近缘水生开花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of aquatic flowering plants known as the water-lily family, typically growing in still or slow-moving freshwater (for example, water lilies).","zh":"睡莲科；一类生长在静水或缓流水淡水环境中的水生开花植物科（如睡莲）。"},"examples":[{"en":"Many ornamental water lilies in garden ponds belong to the family Nymphaeaceae.","zh":"许多花园池塘里观赏用的睡莲都属于睡莲科（Nymphaeaceae）。"},{"en":"In botany class, we compared the leaves of Nymphaeaceae with those of lotus plants.","zh":"在植物学课上，我们比较了睡莲科植物与莲属植物的叶片差异。"}]}],"synonyms":["water-lily family"],"phonetic":"/ˌnɪmfiˈeɪsiˌi/","extraExplanation":["“Nymphaeaceae”是拉丁化的植物科名，词根与希腊神话中的“nymph（仙女、宁芙）”有关，暗示其与水域环境的联系。","作为分类学名，它常用于学术写作、植物志、园艺说明等场合；口语里更常说“water-lily family（睡莲科/睡莲类植物）”。"]}
{"word":"nymphaeaceous","summary":{"en":"A botanical adjective meaning “of the water-lily family.”","zh":"一个植物学形容词，表示“睡莲科的；与睡莲科有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or belonging to the water-lily family (Nymphaeaceae).","zh":"（植物学）睡莲科的；与睡莲科有关的。"},"examples":[{"en":"The pond is home to several nymphaeaceous plants, including water lilies.","zh":"这个池塘里有几种睡莲科植物，包括睡莲。"},{"en":"Researchers studied the nymphaeaceous leaves to understand how they float and resist water.","zh":"研究人员观察睡莲科植物的叶片，以了解它们如何漂浮并抵抗水的影响。"}]}],"synonyms":["water-lily (family)","Nymphaeaceae (related)"],"phonetic":"/ˌnɪmfiˈeɪʃəs/","extraExplanation":["“nymphaeaceous”来自科名 Nymphaeaceae（睡莲科），而 Nymphaea 是睡莲属名，源于拉丁语/希腊语中与“水中仙女（nymph）”相关的词根，带有古典文学中对水域与花的联想。","这是偏学术与分类学的用词，日常英语更常说 “water-lily” 或 “water lily family”。"]}
{"word":"nymphaeum","summary":{"en":"A nymphaeum is a classical shrine or ornamental fountain-grotto associated with water nymphs; rarely, it can also mean a water-lily in older usage.","zh":"nymphaeum 指古典时期与宁芙（水泽仙女）相关的神龛式喷泉建筑/喷泉洞窟；少数旧文中也可指睡莲等水生植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greek and Roman culture, a decorative shrine or building (often a grotto with fountains) dedicated to water nymphs; later, any ornamental fountain-house or grotto in a garden or public space.","zh":"（古希腊、古罗马）供奉水泽仙女（宁芙）的神龛或建筑，常见为带喷泉的洞穴式装饰空间；后来也泛指园林或公共场所的装饰性喷泉建筑/喷泉洞窟。"},"examples":[{"en":"The ruins include a nymphaeum where fresh water once flowed into a marble basin.","zh":"遗址中有一座宁芙神龛式喷泉建筑，清水曾经流入大理石水池。"},{"en":"In the palace garden, the nymphaeum served as a cool, shaded place to rest near the fountains.","zh":"在宫殿花园里，这座喷泉洞窟成了靠近水景、清凉有荫的休憩之处。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, historical) A water-lily or a water-lily-related plant, especially in older scientific or literary usage.","zh":"（较少见、旧用法）睡莲或与睡莲相关的水生植物，常见于较早的科学或文学语境。"},"examples":[{"en":"In some older texts, “nymphaeum” is used when discussing water-lilies in ponds.","zh":"在一些较早的文献中，讨论池塘睡莲时会用到“nymphaeum”这个词。"}]}],"synonyms":["fountain","fountain house","grotto","shrine"],"phonetic":"/nɪmˈfiəm/","extraExplanation":["词源来自拉丁语 nymphaeum，源头与 nymph（宁芙：希腊神话中的自然精灵/水泽仙女）有关，因此这个建筑名与“水、泉、洞窟、清凉的休憩空间”常常绑定在一起。","在罗马城市中，nymphaeum 常是大型公共喷泉建筑，不只是宗教用途，也承担供水与城市景观的功能；考古与艺术史写作里很常见。","发音提示：词中 ph 常读 /f/；-ae- 在现代英语里多简化成 /i/ 或 /eɪ/ 的感觉，这个词通常读作 /nɪmˈfiəm/。"]}
{"word":"nymphal","summary":{"en":"Nymphal means “related to a nymph,” either a mythological nature spirit (poetic sense) or an insect’s immature nymph stage (scientific sense).","zh":"nymphal 意为“与 nymph 有关的”：可指神话中的宁芙（偏诗意/文学用法），也可指昆虫的若虫阶段（偏科学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a nymph (a young female nature spirit in Greek and Roman mythology), or resembling a nymph in a romantic or poetic way.","zh":"与“宁芙”（希腊罗马神话中的年轻女性自然精灵）有关的；（诗意/浪漫地）像宁芙般的。"},"examples":[{"en":"The poem describes a nymphal figure dancing by the river.","zh":"这首诗描写了一个宁芙般的身影在河边起舞。"},{"en":"The painting has a soft, nymphal beauty.","zh":"这幅画有一种柔和、宁芙般的美感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially entomology) Relating to a nymph—an immature stage of some insects that looks like a smaller version of the adult.","zh":"（生物学，尤指昆虫学）与“若虫”有关的——某些昆虫的未成熟阶段，外形像缩小版成虫。"},"examples":[{"en":"The nymphal stage of a grasshopper can last several weeks.","zh":"蚱蜢的若虫期可能持续数周。"},{"en":"Scientists examined nymphal skins left behind after molting.","zh":"科学家检查了蜕皮后留下的若虫蜕皮壳。"}]}],"synonyms":["nymph-like","nymphish","nymphine"],"phonetic":"/ˈnɪmfəl/","extraExplanation":["“nymphal”来自“nymph（宁芙/若虫）”。在文学和艺术里，它常带有古典、诗意、略带浪漫的色彩，用来形容“像自然精灵一样的美/轻盈/神秘”。","在昆虫学里，“nymph（若虫）”通常指不完全变态昆虫（如蝗虫、蟑螂、蜻蜓等）的幼体阶段；它与“larva（幼虫）”不同，幼虫多见于完全变态昆虫（如蝴蝶、甲虫、苍蝇），外形与成虫差异更大。"]}
{"word":"nymphalid","summary":{"en":"A nymphalid is a butterfly belonging to the family Nymphalidae (brush-footed butterflies).","zh":"nymphalid 指蛱蝶科（刷足蝶）的一种蝴蝶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a butterfly of the family Nymphalidae (the brush-footed butterflies), which includes many common species such as monarchs and fritillaries","zh":"蛱蝶科（Nymphalidae，俗称“刷足蝶”）的蝴蝶；该科包含许多常见种类，如帝王蝶、豹蛱蝶等"},"examples":[{"en":"The monarch is a nymphalid butterfly known for its long migration.","zh":"帝王蝶是一种以长距离迁徙闻名的蛱蝶科蝴蝶。"},{"en":"In the meadow, several nymphalids fed on wildflowers in the afternoon sun.","zh":"在草地上，几只蛱蝶科蝴蝶在午后阳光下采食野花。"}]}],"synonyms":["brush-footed butterfly","nymphalid butterfly","Nymphalidae (scientific family name)"],"phonetic":"/nɪmˈfælɪd/","extraExplanation":["“nymphalid”来自科名 Nymphalidae（蛱蝶科），词根 nymph- 与希腊神话中的“宁芙（nymph，水泽/森林的女神或精灵）”有关，常用来表达“轻盈、美丽”的意象。","蛱蝶科常被称为“刷足蝶（brush-footed butterflies）”，因为它们前足退化，外观看起来像只有四条腿，前足常覆有毛，像“小刷子”。"]}
{"word":"nymphalidae","summary":{"en":"Nymphalidae is the scientific family name for the brush-footed butterflies.","zh":"Nymphalidae 是刷足蝶（蛺蝶科）的科學分類名稱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large family of butterflies commonly called the brush-footed butterflies, including many familiar species such as monarchs, admirals, and fritillaries","zh":"蛺蝶科（蝴蝶的一大科），俗称“刷足蝶/刷足蝴蝶”，包含許多常見種類，如帝王蝶、將軍蝶、豹紋蝶等"},"examples":[{"en":"The monarch butterfly belongs to the family Nymphalidae.","zh":"帝王蝶屬於蛺蝶科（Nymphalidae）。"},{"en":"In this meadow, we recorded several Nymphalidae species during the summer survey.","zh":"在這片草地上，我們在夏季調查中記錄到好幾種蛺蝶科的物種。"}]}],"synonyms":["brush-footed butterflies","the brush-footed butterfly family"],"phonetic":"/nɪmˈfælɪdi/","extraExplanation":["「Nymphalidae」是生物分類學中的科名（family），常用於學術寫作或自然觀察記錄中；日常英語更常說 brush-footed butterflies（刷足蝶）。","這個科名來自「nymph」（寧芙：希臘羅馬神話中的自然女神/精靈）的詞根，帶有「美麗、靈動」的文化聯想，但在此主要是科學命名。"]}
{"word":"nymphalinae","summary":{"en":"Nymphalinae is a scientific name for a subfamily of brush-footed butterflies (family Nymphalidae).","zh":"Nymphalinae 是蛺蝶科（刷足蛺蝶）中的一个亞科名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of butterflies in the family Nymphalidae (the brush-footed butterflies), including many familiar species such as tortoiseshells, admirals, and some fritillaries (classification may vary by source)","zh":"蛺蝶科（刷足蛺蝶）中的一个亞科，包含许多常见类群，如龜紋蝶（tortoiseshells）、將軍蝶（admirals）以及部分豹紋蝶（fritillaries）（不同资料的分类范围可能略有差异）"},"examples":[{"en":"Researchers recorded several Nymphalinae species in the forest edge habitat.","zh":"研究人员在森林边缘生境记录到多种蛺蝶亞科（Nymphalinae）的物种。"},{"en":"In some field guides, certain butterflies are placed in Nymphalinae based on wing patterns and anatomy.","zh":"在一些野外图鉴中，某些蝴蝶会根据翅纹与形态特征被归入蛺蝶亞科（Nymphalinae）。"}]}],"synonyms":["nymphalines","nymphaline butterflies","(subfamily of) brush-footed butterflies"],"phonetic":"/nɪmˈfælɪni/","extraExplanation":["这是一个“生物分类学”术语：科（family）之下是亞科（subfamily），Nymphalinae 属于蛺蝶科 Nymphalidae 的一支。阅读英文资料时，你常会在物种名后面看到“Family/ Subfamily/ Genus”等层级，用来说明亲缘关系。","词根来自希腊/拉丁传统中的 nymph（宁芙，森林或水泽的仙女）。在昆虫学命名中，这类词根常用来营造“轻盈、优雅”的联想，但它本身并不表示蝴蝶的生态习性。"]}
{"word":"nymphaline","summary":{"en":"Nymphaline means “related to (or belonging to) the butterfly subfamily Nymphalinae.”","zh":"nymphaline 指“与蛱蝶亚科（Nymphalinae）有关的；或属于该亚科的蝴蝶”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Relating to the Nymphalinae, a group (subfamily) of brush-footed butterflies.","zh":"（生物）与蛱蝶亚科（Nymphalinae）有关的；指一类蛱蝶科（刷蛱蝶）中的亚科。"},"examples":[{"en":"Scientists compared wing patterns in several nymphaline butterflies.","zh":"科学家比较了几种蛱蝶亚科蝴蝶的翅纹。"},{"en":"A nymphaline species may show bold, high-contrast markings.","zh":"蛱蝶亚科的某些物种可能有醒目、对比强烈的斑纹。"}]},{"partOfSpeech":"n.","definition":{"en":"A butterfly belonging to the Nymphalinae (a nymphaline butterfly).","zh":"蛱蝶亚科的蝴蝶；蛱蝶亚科成员。"},"examples":[{"en":"In late summer, the garden attracts many nymphalines.","zh":"夏末时花园会吸引许多蛱蝶亚科的蝴蝶。"}]}],"synonyms":["nymphalid (related term)","Nymphalinae (scientific group name)"],"phonetic":"/nɪmˈfælaɪn/","extraExplanation":["“Nymphalinae”是分类学名称：科（family）通常是 Nymphalidae（蛱蝶科），而 “Nymphalinae” 是其中的亚科（subfamily）。日常英语更常见的相关词是 “nymphalid”（指蛱蝶科的蝴蝶），而 “nymphaline”更偏学术/分类学语境。"]}
{"word":"nympheal","summary":{"en":"Nympheal is a rare adjective meaning “related to nymphs” (nymph-like), and sometimes “related to water lilies” (often spelled nymphaeal).","zh":"nympheal 是个罕见形容词，主要指“与宁芙/仙女有关、仙灵般的”；有时也指“与睡莲相关”（常见拼写为 nymphaeal）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to nymphs (mythical nature spirits), or having a nymph-like quality; nymphal.","zh":"（罕见）与“宁芙/仙女”（神话中的自然精灵）有关的；具有仙女般气质的；同 nymphal。"},"examples":[{"en":"The poem describes a nympheal dance in the moonlit forest.","zh":"这首诗描写了月光森林里一场仙灵般的舞蹈。"},{"en":"She was painted with a nympheal grace, like a figure from Greek myth.","zh":"她被画得带着仙女般的优雅，仿佛出自希腊神话。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes used in botany; often spelled “nymphaeal”) Relating to the water-lily family (genus *Nymphaea*).","zh":"（有时用于植物学；常写作 nymphaeal）与睡莲属（*Nymphaea*）或睡莲科相关的。"},"examples":[{"en":"The pond was covered with nympheal leaves and pale blossoms.","zh":"池塘里铺满了睡莲叶与淡色花朵。"},{"en":"Some older texts describe the plant as nympheal in form.","zh":"一些较旧的文本会形容这种植物“具睡莲特征”。"}]}],"synonyms":["nymphal","nymphlike","nymphaeal"],"phonetic":"/nɪmˈfiːəl/","extraExplanation":["“nympheal”在现代英语中非常少见，更多时候你会看到更常用的拼写与形式：表示“仙女/宁芙的”通常写作 **nymphal**；表示“睡莲属相关的”常写作 **nymphaeal**（来自属名 *Nymphaea*）。如果你是在学术或植物学语境里遇到它，建议核对原文是否其实是 nymphaeal。"]}
{"word":"nymphean","summary":{"en":"Nymphean means “related to nymphs” (mythological nature spirits) or, in botany, “related to water lilies (Nymphaea).”","zh":"nymphean 指“与宁芙（神话中的自然精灵）有关/像宁芙般的”，也可指“与睡莲属（Nymphaea）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a nymph (a nature spirit or mythological young woman in Greek and Roman stories); nymph-like.","zh":"与宁芙（希腊罗马神话中的自然精灵/年轻女神）有关的；像宁芙般的。"},"examples":[{"en":"The painting shows a nymphean figure dancing near a forest spring.","zh":"这幅画描绘了一位宁芙般的身影在林间泉水旁起舞。"},{"en":"Her nymphean costume was inspired by Greek mythology.","zh":"她的宁芙风服装灵感来自希腊神话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to water lilies or the genus Nymphaea (a group of aquatic plants).","zh":"与睡莲或睡莲属（Nymphaea，一类水生植物）有关的。"},"examples":[{"en":"The pond is known for its nymphean plants that bloom in summer.","zh":"这个池塘因夏季开花的睡莲属植物而闻名。"},{"en":"A nymphean garden often includes still water and floating leaves.","zh":"睡莲主题的花园常常包含静水与漂浮的叶片。"}]}],"synonyms":["nymphlike","mythic","arcadian","Nymphaea-related"],"phonetic":"/nɪmˈfiːən/","extraExplanation":["“nymphean”常见变体拼写是“nymphaean / nymphaeān”，来自希腊语“nymphē（宁芙）”。在文学与艺术里，nymph 常象征自然、青春与灵动，因此 nymphean 也带有一种“清新、梦幻、神话感”的色彩。","植物学义项与“睡莲属 Nymphaea”有关；学名中的 Nymphaea 也源自 nymph（宁芙）的意象，因为睡莲常与水中精灵、池塘仙女的联想相连。"]}
{"word":"nymphet","summary":{"en":"“Nymphet” is an offensive, sexually suggestive word for a young girl viewed as attractive by an adult, popularized by Nabokov’s *Lolita*.","zh":"“nymphet”是带冒犯性的性暗示用语，指被成年人视为有吸引力的少女；因《洛丽塔》而广为人知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sexually suggestive term for a young girl (especially in early teens) who is viewed as attractive by an adult; often considered offensive because it sexualizes minors","zh":"（带强烈性暗示的用语）指被成年人视为有吸引力的少女（多指十来岁早期）；常被认为冒犯，因为它将未成年人性化"},"examples":[{"en":"The novel uses the word “nymphet” to show the narrator’s unhealthy obsession with a young girl.","zh":"这部小说用“nymphet”来表现叙述者对少女不健康的迷恋。"},{"en":"In everyday conversation, it’s better to avoid this term because it can be harmful and inappropriate.","zh":"在日常对话中最好避免用这个词，因为它可能有伤害性且不恰当。"}]}],"synonyms":["Lolita (often similar but also sensitive)","underage girl (neutral, factual)","young girl (neutral)"],"phonetic":"/ˈnɪmfɛt/","extraExplanation":["这个词最广为人知的来源是纳博科夫（Vladimir Nabokov）的小说《洛丽塔》（Lolita, 1955）。在书中它是叙述者的用词，带有明显的“凝视”与操控意味，用来合理化他对未成年人的迷恋。","在现代语境里，“nymphet”几乎总带有强烈负面色彩：物化、性化未成年人，可能触及违法与伦理问题。写作或讨论文学时可作为“文本用语”分析，但现实中不建议用来形容真实的人。","词根与“nymph（宁芙/仙女）”有关，带有把少女“神话化、妖魅化”的色彩，这也是其令人不适与危险之处。"]}
{"word":"nymphets","summary":{"en":"“Nymphets” is the plural of “nymphet,” a controversial term (popularized by *Lolita*) that sexualizes young girls and is often considered offensive.","zh":"“nymphets”是“nymphet”的复数；该词因《洛丽塔》而流行，带有将少女（常指未成年人）性化的意味，常被视为冒犯且不宜使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sexually attractive young girl (often underage); a term that is widely considered offensive and inappropriate.","zh":"（常指未成年）被性化、被认为具有性吸引力的少女；该词通常被认为冒犯且不恰当。"},"examples":[{"en":"The novel critiques an adult narrator who calls the girl a “nymphet.”","zh":"这部小说批判一位成年叙述者把女孩称作“nymphet”。"},{"en":"Many editors avoid the word because it sexualizes minors.","zh":"许多编辑会避免使用这个词，因为它会将未成年人性化。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, dated) a very young-looking, pretty girl; still often viewed as sexist or objectifying.","zh":"（非正式、较过时）外表非常稚嫩、漂亮的少女；但仍常被视为带有性别偏见或物化意味。"},"examples":[{"en":"In older reviews, the actress was wrongly described as a “nymphet.”","zh":"在一些较旧的影评里，这位女演员曾被不恰当地称为“nymphet”。"}]}],"synonyms":["(contextual) underage girl (not recommended as a label)","(neutral alternatives) young girl","teenage girl","schoolgirl"],"phonetic":"/ˈnɪmˌfɛts/","extraExplanation":["“nymphet”一词在英语文化中与纳博科夫（Vladimir Nabokov）的小说《Lolita》(1955) 强相关，常用于表现叙述者对少女的“凝视”与不可靠视角。","在现代语境里，这个词往往会引发对“性化未成年人”的强烈反感；写作或翻译中更建议用更中性、尊重的表达（如：young girl / teenage girl），或明确说明这是角色的用词而非作者立场。"]}
{"word":"nymphette","summary":{"en":"A literary term (sometimes offensive) for a young girl viewed as sexually attractive, especially through an older person’s gaze.","zh":"一个文学用语（有时具冒犯性），指被年长者以性化眼光看作“有性吸引力”的年轻/未成年女孩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often literary; sometimes offensive) a sexually attractive young girl, especially in the imagination of an older person.","zh":"（常用于文学语境；有时带冒犯性）指在年长者的想象或凝视中被性化、被认为“有性吸引力”的年轻女孩。"},"examples":[{"en":"The word “nymphette” is used in some literary criticism when discussing how certain novels portray underage girls.","zh":"在讨论某些小说如何呈现未成年女孩时，一些文学评论会使用“nymphette”这个词。"},{"en":"Many readers avoid the term because it can romanticize the sexualization of children.","zh":"许多读者会避免使用这个词，因为它可能会美化对儿童的性化。"}]}],"synonyms":["Lolita (often used similarly; also controversial)","underage girl (neutral, factual)","young girl (neutral, context-dependent)"],"phonetic":"/nɪmˈfɛt/","extraExplanation":["“nymphette”最广为人知的来源是纳博科夫（Vladimir Nabokov）的小说《洛丽塔》（Lolita, 1955）。叙述者用它来指代他所迷恋的未成年女孩形象，因此该词常与“将未成年人性化”的视角紧密相连。","在现代英语里，这个词容易带来伦理与文化上的争议：它可能弱化现实中的伤害或让不当欲望显得浪漫。更中性的表达可用“underage girl（未成年女孩）”“young girl（小女孩/年轻女孩）”，在讨论文本时可说“the narrator’s sexualized depiction（叙述者的性化描写）”。","词形上它借用“nymph（宁芙/仙女）”的意象，再加上法语式的缩小后缀“-ette”，带有“娇小、可爱”的语感；也正因为这种语感，容易产生粉饰效果。"]}
{"word":"nympheum","summary":{"en":"Nymphaeum: a classical (Greek/Roman) ornamental fountain house or grotto, originally dedicated to nymphs.","zh":"Nymphaeum：古希腊/古罗马的装饰性喷泉屋或洞窟喷泉建筑，最初与水泽仙女崇拜相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Classical architecture/history) A monument, grotto, or building with water features (like a fountain), originally dedicated to water nymphs; later, an ornamental fountain house or grand grotto, especially in ancient Greek and Roman cities.","zh":"（古典建筑/历史）原本献给水泽仙女（nymphs）的神龛、洞穴式建筑或纪念性喷泉建筑；后来泛指古希腊、古罗马城市中的装饰性喷泉屋或华丽洞窟喷泉。"},"examples":[{"en":"The ruins include a nymphaeum where citizens once collected fresh water.","zh":"遗址里有一座喷泉屋（nymphaeum），过去市民曾在这里取用清水。"},{"en":"In the Roman villa, a nymphaeum decorated with mosaics cooled the courtyard.","zh":"在那座罗马别墅里，一处镶嵌马赛克装饰的喷泉洞窟为庭院带来清凉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Botany, less common) A structure or organ in some organisms that is shaped like or compared to a nymphaeum; sometimes used in technical descriptions.","zh":"（植物学，较少见）在某些生物中，形状类似“喷泉洞窟/神龛”的结构或器官；偶见于技术性描述。"},"examples":[{"en":"In older botanical texts, the author uses nymphaeum to describe a cup-like form.","zh":"在较早的植物学文献中，作者用 nymphaeum 来描述一种杯状结构。"}]}],"synonyms":["fountain house","grotto","shrine (to nymphs)","monumental fountain"],"phonetic":"/nɪmˈfiːəm/","extraExplanation":["你输入的拼写“nympheum”常见于误拼或变体；更标准的拼写是 **nymphaeum**（英式也常写作 *nymphaeum*）。","词源来自拉丁语 *nymphaeum*，再往前与希腊语中“仙女/水泽女神（nymph）”相关；因此它常与“水、泉、洞窟式装饰建筑”联系在一起。","在古罗马城市里，nymphaeum 往往既是公共供水设施（引水渠终端之一），也是展示权力与审美的纪念性建筑，常配有壁龛、雕像、马赛克与流水声。"]}
{"word":"nymphic","summary":{"en":"Nymphic means “like a nymph,” often poetic; rarely, it’s a dated word hinting at sexual allure.","zh":"nymphic意为“像宁芙一样的”，多为诗意用法；少数情况下是过时说法，暗示性感诱惑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, like, or characteristic of a nymph (a nature spirit or beautiful young woman in Greek/Roman mythology). Often used in poetic or literary descriptions of nature, youth, and grace.","zh":"与宁芙（希腊/罗马神话中的自然精灵或美丽的年轻女子）有关的；像宁芙一样的。常见于诗歌或文学中，用来描写自然、青春与优雅。"},"examples":[{"en":"The painter gave the forest a nymphic glow, as if hidden spirits lived among the trees.","zh":"画家让森林呈现出一种宁芙般的光辉，仿佛树间住着隐秘的精灵。"},{"en":"Her nymphic dance felt light and playful, like water moving over stones.","zh":"她的舞姿轻盈又俏皮，带着宁芙般的气息，像流水掠过石头。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, dated) Suggesting sexual allure in a way that references the stereotype of a “nymph”; sometimes linked to the old term “nymphomania.”","zh":"（罕见；较过时）带有以“宁芙”刻板印象为基础的性感/诱惑意味；有时与旧称“慕男狂（nymphomania）”相关。"},"examples":[{"en":"Some older reviews described the character’s style as “nymphic,” though the term feels dated today.","zh":"一些较早的评论把这个角色的风格称为“nymphic”，不过这个说法如今显得过时。"}]}],"synonyms":["nymphlike","mythic","ethereal","graceful","youthful","alluring (context-dependent)"],"phonetic":"/ˈnɪm.fɪk/","extraExplanation":["“nymphic”来自“nymph（宁芙）”。在英语文学里，nymph常象征自然之美、青春、轻盈与神秘气质，因此nymphic多用于带有诗意的描写。","第二个含义带有历史语境与性别刻板印象；现代英语里更常用更中性、具体的词来表达（如 “youthful,” “playful,” “alluring” 等），以避免冒犯或误解。"]}
{"word":"nymphical","summary":{"en":"Nymphical means “nymph-like”—youthful, graceful, and nature-spirit-like (a rare, literary adjective).","zh":"nymphical 意为“宁芙般的”，形容年轻、优雅轻盈、带有自然精灵气质（较少见、偏文学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a nymph; youthful, graceful, and often imagined as having a nature-spirit or fairy-like beauty.","zh":"像宁芙（仙女/水泽女神）一样的；形容年轻、轻盈优雅，带有自然精灵般的美感。"},"examples":[{"en":"The poet described her as nymphical, moving through the garden as if she belonged to the woods.","zh":"诗人把她描写得很“宁芙般”，仿佛她穿过花园时就属于那片林子。"},{"en":"In the painting, the nymphical figure is surrounded by water and reeds.","zh":"在那幅画里，宁芙般的身影被水面与芦苇环绕。"}]}],"synonyms":["nymph-like","nymphal","graceful","ethereal","sprite-like"],"phonetic":"/ˈnɪm.fɪ.kəl/","extraExplanation":["“nymphical”来自“nymph”（宁芙：希腊罗马神话中的自然女神/精灵，常与泉水、森林、山岳相关）+ “-ical”（表示“……的/像……的”）。这个词在现代英语里比较少见，更常见的是“nymph-like”或“nymphal”。","在文学或艺术评论中，“nymphical”常用来营造一种古典神话、自然灵性与轻盈柔美的氛围；描述人时容易带有理想化或审美化色彩，使用时注意语境是否合适。"]}
{"word":"nymphid","summary":{"en":"Nymphid means “nymph-like” in literature, and it can also mean a lacewing insect in the family Nymphidae in entomology.","zh":"nymphid 在文学中指“像宁芙/仙女般的”，在昆虫学中也可指裂足蛉科（Nymphidae）的昆虫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Like a nymph: youthful, graceful, and often connected with nature.","zh":"（文学用语）像仙女/水泽仙女般的：年轻优雅、带有自然气息的。"},"examples":[{"en":"She moved with a nymphid lightness through the garden.","zh":"她在花园里走动时，带着一种仙女般的轻盈。"},{"en":"The poem describes a nymphid figure beside a forest stream.","zh":"这首诗描写了一个在林间小溪旁的仙女般身影。"}]},{"partOfSpeech":"n.","definition":{"en":"(entomology) A member of the lacewing family Nymphidae.","zh":"（昆虫学）裂足蛉科（Nymphidae）的昆虫。"},"examples":[{"en":"The researcher photographed a nymphid resting on a leaf.","zh":"研究人员拍到一只裂足蛉科昆虫停在叶子上。"},{"en":"Nymphids are a type of lacewing found in some warm regions.","zh":"裂足蛉科昆虫是一类在某些温暖地区可见的脉翅目昆虫。"}]}],"synonyms":["nymphlike","sprite-like","ethereal","graceful"],"phonetic":"/ˈnɪm.fɪd/","extraExplanation":["“nymphid”由“nymph（宁芙/仙女）+ -id（表示‘属于……的/像……的’）”构成，因此在文学语境里常用来描写带有“仙气、灵动、自然之美”的气质。","在科学语境中，它也可指“裂足蛉科（Nymphidae）”的成员；这类用法较少见，通常出现在昆虫学或博物学写作中。"]}
{"word":"nymphine","summary":{"en":"A rare adjective meaning “nymph-like” or “related to a nymph.”","zh":"一个较少见的形容词，意为“像仙女/若虫的”或“与仙女/若虫有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nymph-like; relating to a nymph (a young insect stage or a mythical nature spirit).","zh":"像若虫/仙女般的；与“nymph（若虫/仙女）”有关的。"},"examples":[{"en":"In the poem, the lake is guarded by a nymphine spirit.","zh":"在这首诗里，湖泊由一个仙女般的精灵守护。"},{"en":"The artist gave the character a light, nymphine look.","zh":"艺术家让这个角色呈现出轻盈、仙女般的气质。"}]}],"synonyms":["nymph-like","nymphal","sprite-like","ethereal"],"phonetic":"/ˈnɪm.faɪn/","extraExplanation":["“nymphine”在现代英语里非常少见，多用于文学化的描写（强调“仙女般、轻盈、自然精灵”的意象），或作为较少见的派生形容词出现。","日常表达里更常用的是“nymph-like”或“nymphal”（尤其在生物学里谈昆虫“若虫期/若虫的”时更常见）。"]}
{"word":"nymphipara","summary":{"en":"Nymphipara describes insects that give birth to live nymphs rather than laying eggs.","zh":"Nymphipara 指某些昆虫不产卵，而是直接产下活的若虫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Entomology) producing live young in the nymph stage (instead of laying eggs), especially said of some insects such as aphids.","zh":"（昆虫学）以“若虫”形态产下活体幼体（而不是产卵）；常用于描述某些昆虫（如蚜虫）的繁殖方式。"},"examples":[{"en":"Many aphids are nymphipara during the warm season, giving birth to living nymphs.","zh":"许多蚜虫在温暖季节是若虫胎生（nymphipara）的，会产下活的若虫。"},{"en":"The report compares egg-laying species with nymphipara forms in the same family.","zh":"这份报告比较了同科中产卵的物种与若虫胎生（nymphipara）的类型。"}]}],"synonyms":["nymphiparous","viviparous (in insects)","larviparous (related term)"],"phonetic":"/nɪmˈfɪpərə/","extraExplanation":["该词由 nymph（若虫）+ -para（“产出/生育”，见于 viviparous“胎生的”一类构词）组成，多见于动物学/昆虫学文献中。","在一些蚜虫的生活史里，常出现“无性生殖并直接产若虫”的阶段（有利于快速繁殖）；而在不利季节可能转为有性生殖并产卵。"]}
{"word":"nymphiparous","summary":{"en":"Nymphiparous describes insects that give birth to live nymphs instead of laying eggs.","zh":"Nymphiparous 指昆虫不产卵而是直接产下活的若虫（若虫胎生）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an insect) producing young in the nymph stage rather than laying eggs; giving birth to nymphs.","zh":"（指昆虫）产下若虫而不是产卵；胎生/若虫胎生的。"},"examples":[{"en":"Some aphids are nymphiparous during the growing season, producing live nymphs on host plants.","zh":"有些蚜虫在生长季是若虫胎生的，会在寄主植物上直接产下活的若虫。"},{"en":"The researcher compared egg-laying species with nymphiparous species to study survival rates.","zh":"研究者比较了产卵物种与若虫胎生物种，以研究存活率差异。"}]}],"synonyms":["viviparous (in insects)","larviparous (related term, broader)"],"phonetic":"/nɪmˈfɪpərəs/","extraExplanation":["这是一个昆虫学（entomology）用语，常用于描述某些蚜虫等在特定季节或环境下会“胎生”（直接产生活体后代）。这里的 nymph 指“若虫”（不完全变态昆虫的幼体阶段），而不是神话中的“仙女”。","词源上可拆成 nymph-（若虫）+ -parous（产…的），类似的构词还有 oviparous（卵生的/产卵的）、viviparous（胎生的）。"]}
{"word":"nymphish","summary":{"en":"“Nymphish” means nymph-like—youthful, graceful, and lightly playful; it can also mean “related to nymphs” in myth or literature.","zh":"“nymphish”意为“像宁芙/仙女般的”——年轻、优雅、轻俏；也可指“与宁芙（神话中的自然精灵）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a nymph; youthful, graceful, and lightly playful (often with a romantic or slightly flirtatious feeling).","zh":"像仙女/水泽仙女般的；年轻、轻盈优雅、带点俏皮（常含浪漫或略带调情的意味）。"},"examples":[{"en":"She moved with a nymphish grace across the stage.","zh":"她在舞台上走动时带着一种仙灵般的轻盈优雅。"},{"en":"The painting shows a nymphish figure in a forest pool.","zh":"这幅画描绘了一个在森林水潭旁、带有仙女气质的人物形象。"},{"en":"His description of her as “nymphish” suggested a playful charm.","zh":"他用“nymphish”形容她，暗示她有一种俏皮的魅力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to nymphs in mythology or literature.","zh":"（神话或文学中）与水泽仙女/宁芙（nymph）有关的。"},"examples":[{"en":"The poet filled the scene with nymphish spirits and woodland music.","zh":"诗人把场景写得充满宁芙精灵与林间乐声。"},{"en":"Nymphish imagery is common in classical myths.","zh":"宁芙式的意象在古典神话中很常见。"}]}],"synonyms":["nymphlike","elfin","sprite-like","airy","graceful","playful","mythic"],"phonetic":"/ˈnɪmfɪʃ/","extraExplanation":["“nymphish”由 nymph（宁芙：希腊罗马神话中的自然精灵/仙女）+ 后缀 -ish（“有点……的、像……的”）构成，语气比 nymph-like 更口语、更带主观感受。","在现代英语里，它有时会带一点“年轻而迷人/撩人”的暗示；在正式写作或描述真实人物外貌时，需注意语境与礼貌，避免让人觉得物化或不恰当。"]}
{"word":"nymphitis","summary":{"en":"A rare/dated medical term meaning inflammation of the labia minora (nymphae).","zh":"一个少见/较旧的医学词，指小阴唇（nymphae）发炎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, uncommon/dated) inflammation of the labia minora (also called the “nymphae”)—a type of vulvar inflammation.","zh":"（医学，少见/较旧用法）小阴唇（亦称“nymphae”）的炎症；属于外阴炎的一种。"},"examples":[{"en":"The chart used the term “nymphitis,” but modern notes more often say “vulvitis” or “labial inflammation.”","zh":"病历里写了“nymphitis”，但现代记录更常写“vulvitis（外阴炎）”或“labial inflammation（阴唇炎/阴唇部炎症）”。"},{"en":"She was treated for nymphitis after reporting pain and swelling in the inner labia.","zh":"她因小阴唇疼痛、肿胀而被诊断并治疗为 nymphitis（小阴唇炎）。"}]}],"synonyms":["vulvitis","labial inflammation","inflammation of the labia minora"],"phonetic":"/nɪmˈfaɪtɪs/","extraExplanation":["这是一个较少见且偏旧的医学词：其中“nymphae”在解剖学里指小阴唇（labia minora），不是神话里的“水仙女/宁芙”。临床交流中更常用更直白、现代的说法，如 vulvitis（外阴炎）、labial inflammation（阴唇炎/阴唇部炎症）、或具体说明“labia minora inflammation”。","该词涉及私密部位，日常英语中几乎不会用；如果需要就医沟通，更建议使用医生常用词汇并描述症状（疼痛、瘙痒、红肿、分泌物等）。"]}
{"word":"nymphlike","summary":{"en":"An adjective meaning “like a nymph”: gracefully slender, youthful, and delicately beautiful, often with a mythic or poetic feel.","zh":"形容词，意为“仙女般的”：纤细轻盈、年轻动人、带神话或诗意氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a nymph (a graceful, beautiful young woman; in mythology, a nature spirit), especially in being slender, delicate, lively, or alluring.","zh":"像仙女/水泽仙女般的；（尤指）身姿纤细、轻盈优雅、年轻动人（带一点神秘吸引力）的。"},"examples":[{"en":"The dancer moved with a nymphlike grace across the stage.","zh":"那位舞者以仙女般的优雅在舞台上移动。"},{"en":"She wore a simple dress that gave her a nymphlike look.","zh":"她穿着一条简单的裙子，显得有种仙女般的气质。"},{"en":"The painting shows a nymphlike figure resting by a stream.","zh":"这幅画描绘了一个仙女般的身影在溪边休憩。"}]}],"synonyms":["graceful","delicate","ethereal","willowy","fairylike"],"phonetic":"/ˈnɪmflaɪk/","extraExplanation":["“nymphlike”来自“nymph（仙女/水泽仙女）+ -like（像……一样）”。nymph在希腊罗马神话中常指与森林、泉水、山野相关的自然精灵，因此这个词常见于诗歌、艺术评论、时尚描写等语境。","语感上带有“浪漫化的女性美”与“神话意象”，有时也可能显得略带物化或男性凝视色彩；描述真人时，正式写作里可考虑用更中性词，如“graceful（优雅的）”“delicate（纤细的）”“ethereal（飘逸空灵的）”。","相关表达：nymph-like / nymphal（较少见，偏文学或生物学用法）/ nymphish（更口语、也较少见）。"]}
{"word":"nymphlin","summary":{"en":"Nymphlin is a rare, nonstandard word meaning a young or small nymph, mainly seen in fantasy contexts.","zh":"Nymphlin 是罕见的非标准词，多用于奇幻语境，意思是“幼小的宁芙/小仙女”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonstandard) A young nymph; a small or youthful nymph-like creature (often used in fantasy writing).","zh":"（罕见/非标准用法）幼小的宁芙（森林/泉水仙女）；指小型或年幼、像宁芙一样的生物（常见于奇幻作品）。"},"examples":[{"en":"In the story, a shy nymphlin follows the river spirit at a distance.","zh":"在故事里，一只害羞的宁芙幼体远远跟着河灵。"},{"en":"The author describes the nymphlin as curious, quick, and easily startled.","zh":"作者把这只宁芙幼体写得好奇、敏捷、却很容易受惊。"}]}],"synonyms":["nymphling","young nymph","sprite (approx.)","faerie (approx.)"],"phonetic":"/ˈnɪmf.lɪn/","extraExplanation":["“nymphlin”不是常见的标准英语词典词条，更常见的形式是 **nymphling**（-ling 表示“小的/幼小的”，如 duckling 小鸭、princeling 小王子）。如果你是在小说、游戏或网文里看到“nymphlin”，多半是作者的变体拼写或风格化用法。","词根 **nymph** 源自希腊神话中的宁芙（与自然相关的女神/精灵）。在现代英语里，nymph 也会用来指“美丽的年轻女子”（带文学色彩，有时可能带性化暗示；使用时注意语境）。"]}
{"word":"nymphly","summary":{"en":"Nymphly means “like a nymph”—graceful, light, and youthful (mostly poetic).","zh":"Nymphly 指“宁芙般的”，带有轻盈、优雅、青春的仙气（多用于诗意描写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a nymph; graceful, light, and youthful in a way that suggests a fairy-tale or nature spirit (poetic/old-fashioned).","zh":"像宁芙（森林/水泽仙女）一样的；带有轻盈、优雅、青春的仙气（诗意/偏古雅用法）。"},"examples":[{"en":"In the poem, she is described as a nymphly dancer moving through the forest.","zh":"在诗中，她被描写成一位“宁芙般”的舞者，穿行在森林里。"},{"en":"The painter gave the figure a nymphly look—soft hair, bare feet, and a sense of freedom.","zh":"画家让人物呈现出宁芙般的气质——柔软的头发、赤脚，还有一种自由感。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a nymph-like way; lightly and gracefully (rare, poetic).","zh":"以宁芙般的方式；轻盈而优雅地（少见，多用于诗歌）。"},"examples":[{"en":"She moved nymphly across the stage, almost as if she didn’t touch the ground.","zh":"她在舞台上宁芙般轻盈地移动，仿佛脚不沾地。"}]}],"synonyms":["nymph-like","graceful","airy","ethereal","elfin"],"phonetic":"/ˈnɪmfli/","extraExplanation":["“nymphly”主要出现在诗歌或带古典风格的描写中，日常英语里很少用。现代写作里更常见的是“nymph-like”或用更具体的形容词，如“graceful（优雅的）/airy（轻快的）/elfin（小精灵般的）”。","“nymph”来自希腊-罗马神话，指与自然相关的女性精灵（如树林、水泉的仙女），因此“nymphly”常带有“自然、清新、超现实的美感”这种文学色彩。"]}
{"word":"nympho","summary":{"en":"“Nympho” is a slang, often offensive word meaning “a woman labeled as having an uncontrollable sexual desire.” Avoid using it; it’s usually insulting.","zh":"“nympho”是俚语且常具冒犯性，指“被贴标签为性欲失控的女性”。通常带侮辱意味，不建议使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, often offensive) A woman who is believed (often unfairly) to have an unusually strong or uncontrolled desire for sex; a shortened form of “nymphomaniac.”","zh":"（俚语，常带冒犯性）指被认为（常常是不公平地）性欲异常强烈或“无法控制”的女性；是“nymphomaniac（女色情狂）”的缩略说法。"},"examples":[{"en":"That word is insulting—please don’t call anyone a “nympho.”","zh":"那个词很侮辱人——请不要用“nympho”称呼任何人。"},{"en":"The character is wrongly labeled a “nympho” by people who judge her for dating openly.","zh":"这个角色因为公开约会而被人带着偏见地贴上“nympho”的标签。"}]}],"synonyms":["nymphomaniac","sex maniac (informal)","promiscuous (often judgmental)"],"phonetic":"/ˈnɪm.foʊ/","extraExplanation":["“nympho”在日常英语里多用于辱骂或物化女性，带有强烈的性别偏见与羞辱意味；不建议使用。","“nymphomania / nymphomaniac”曾是旧式医学用语，但现在多被认为不准确、带污名；临床语境更可能使用“强迫性性行为（compulsive sexual behavior）”等更中性的表述。","在影视/流行文化中该词常被用来制造噱头或贬损角色；更礼貌的说法通常是描述具体行为或感受（如“has a high sex drive（性欲较强）”）而不是贴标签。"]}
{"word":"nymphoides","summary":{"en":"Nymphoides is a genus of aquatic flowering plants commonly called floatinghearts.","zh":"Nymphoides 指荇菜属，一类常被称为“浮心草/荇菜类”的水生开花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of aquatic flowering plants (floatinghearts) with floating or emergent leaves, often found in ponds and slow-moving water","zh":"（植物）荇菜属：一类水生开花植物（常称“浮心草/荇菜类”），叶片常漂浮或挺出水面，多生于池塘与缓流水域"},"examples":[{"en":"Nymphoides peltata has round floating leaves and bright yellow flowers.","zh":"黄花荇菜（Nymphoides peltata）有圆形漂浮叶和明亮的黄色花。"},{"en":"Some Nymphoides species are grown in garden ponds and aquariums.","zh":"一些荇菜属植物被用于庭院池塘和水族箱栽培。"},{"en":"In some regions, Nymphoides can spread quickly and become invasive.","zh":"在某些地区，荇菜属植物可能扩散很快，成为入侵物种。"}]}],"synonyms":["floatingheart","water plant (general)"],"phonetic":"/nɪmˈfɔɪˌdiz/","extraExplanation":["词源：来自“nymph（宁芙/水泽精灵）+ -oides（……似的）”，字面含义接近“像水泽精灵的”，常用于学名中表示“类似……”。","用法提示：书写时常见大写 Nymphoides（作为属名）；提到具体物种会用双名法，如 Nymphoides peltata。","文化/环境背景：某些观赏水生植物被引入后可能影响当地生态，讨论园艺或环保话题时会看到该属名出现在科普或管理文件中。"]}
{"word":"nympholepsia","summary":{"en":"Nympholepsia means an intense, dreamy infatuation or longing, originally linked to being ‘seized’ by nymphs in Greek myth.","zh":"Nympholepsia 指一种强烈而梦幻的迷恋或渴望；本义源自希腊神话中“被宁芙夺去心神”的迷狂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense, often dreamy infatuation or desire—especially a romantic or sexual longing inspired by an idealized (sometimes unattainable) person or beauty","zh":"一种强烈、常带梦幻色彩的迷恋或渴望；尤指因理想化（往往难以得到）的对象或美而产生的浪漫/性方面的强烈向往"},"examples":[{"en":"He wrote poems in a kind of nympholepsia, convinced he had met his perfect muse.","zh":"他带着一种近乎“仙女迷狂”的迷恋写诗，坚信自己遇到了完美的缪斯。"},{"en":"Her nympholepsia faded once she got to know the actor as an ordinary person.","zh":"当她发现那位演员也只是普通人时，她的痴迷逐渐消退。"}]},{"partOfSpeech":"n.","definition":{"en":"in older or literary use: supposed possession, madness, or rapture caused by nymphs (nature spirits) in Greek myth","zh":"（较旧或文学用法）在希腊神话语境中，被“宁芙”（自然精灵/仙女）所附体、引发的狂喜或癫狂"},"examples":[{"en":"The poem describes a shepherd struck by nympholepsia beside a forest spring.","zh":"这首诗描写一名牧羊人在林中泉水旁被“宁芙迷狂”击中的情景。"}]}],"synonyms":["infatuation","obsession","lovesickness","rapture","enchantment"],"phonetic":"/ˌnɪmfoʊˈlɛpsiə/","extraExplanation":["词源来自希腊语：nymph（宁芙，指自然精灵）+ -lepsia（“被抓住/被夺取”的意思相关）。原本带有“被宁芙攫住心神”的神话色彩，后来引申为对理想化对象的强烈迷恋。","这是偏文学、较少见的词。现代写作中更常用 infatuation / obsession / lovesickness 等；使用 nympholepsia 往往是为了营造诗意、古典或略带迷狂的语气。"]}
{"word":"nympholepsies","summary":{"en":"“Nympholepsies” means intense, dreamy obsessions or romantic trances (plural), often used in literary writing.","zh":"“Nympholepsies”指（复数）强烈而恍惚的痴迷/沉醉式迷恋，常见于文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of nympholepsy: an intense, dreamy state of excitement or obsession—often linked to an idealized (sometimes sexual) fascination, traditionally with “nymphs” or young women; also used more broadly for an unrealistic, romantic trance-like passion.","zh":"nympholepsy 的复数：指一种强烈、恍惚又兴奋的痴迷状态——传统上常与对“仙女/若女（年轻女性）的理想化（有时带性意味）迷恋”相关；也可更广义指不切实际、浪漫化的沉醉式热情。"},"examples":[{"en":"His letters were full of nympholepsies—poetic fantasies that had little to do with real relationships.","zh":"他的信里满是“nympholepsies”——充满诗意的幻想，却几乎与真实关系无关。"},{"en":"The novel portrays the artist’s nympholepsies as both inspiring and self-destructive.","zh":"小说把这位艺术家的“nympholepsies”写得既能激发灵感，又具有自我毁灭性。"}]}],"synonyms":["infatuations","obsessions","raptures","trances","fixations"],"phonetic":"/ˌnɪm.fəˈlɛp.siz/","extraExplanation":["这个词比较文学化、带古典气息，来自希腊语：nymph（自然精灵/仙女）+ -lepsy（“被……抓住/攫住”的意思，类似 epilepsy“癫痫”里的词根）。因此 nympholepsy 原本带有“被仙女般的幻象攫住”的感觉，常用来形容一种恍惚、迷醉、脱离现实的迷恋。","在现代使用中它可能让人联想到对“年轻女性”的理想化迷恋，语境敏感；写作时若要避免性别或年龄暗示，可以改用更中性的词，如 infatuation / obsession / rapture。"]}
{"word":"nympholepsy","summary":{"en":"Nympholepsy is a literary word for being suddenly swept into a dreamy, ecstatic fascination—often by nature or beauty; in older usage, it can mean an obsessive longing for nymphs.","zh":"nympholepsy 多用于文学语境，指突然陷入梦幻般的陶醉与着迷（常由自然或美景引发）；较旧用法也可指对宁芙（神话自然精灵）的痴迷渴望。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden, dreamy state of intense excitement or enchantment, especially inspired by nature, beauty, or imagination (often used in poetic or literary writing).","zh":"一种突然的、梦幻般的强烈兴奋或着迷状态，常由自然、美景或想象激发（多见于诗意或文学语境）。"},"examples":[{"en":"In the spring woods, she fell into a kind of nympholepsy, forgetting time and work.","zh":"在春日的林间，她陷入一种近乎“仙灵迷醉”的状态，忘了时间与工作。"},{"en":"The painter described his first view of the coastline as pure nympholepsy.","zh":"那位画家把自己初见海岸线的感受形容为纯粹的“迷醉”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; older usage) An obsessive or frenzied longing for nymphs (mythical nature spirits).","zh":"（少见；较旧用法）对“宁芙”（神话中的自然精灵/仙女）产生的痴迷或狂热渴望。"},"examples":[{"en":"In old poetry, the word sometimes suggests a youth’s nympholepsy—an impossible love for nymphs.","zh":"在一些旧诗里，这个词有时指年轻人对宁芙的“痴恋”——一种不可能实现的爱。"}]}],"synonyms":["enchantment","rapture","ecstasy","spell","infatuation","transport"],"phonetic":"ˈnɪm.fəˌlɛp.si","extraExplanation":["词源来自希腊语：nymph（宁芙，自然精灵）+ -lepsy（“突然被……抓住/发作”，同词根可见于 epilepsy 癫痫）。因此它带有“被某种迷恋突然攫住”的感觉。","语体与使用场景：nympholepsy 在现代英语里偏文学/修辞，用来写“被美景或灵感迷住”的恍惚与陶醉；日常口语更常用 enchantment、rapture、infatuation、a spell 等表达。","文化提示：因为 nymph 可能带有神话与审美/性暗示的联想，正式写作中使用时应注意语境，避免引起不必要的误解。"]}
{"word":"nympholept","summary":{"en":"Nympholept describes a dreamy, rapturous person or mood—often inspired by nature or an idealized beloved.","zh":"Nympholept 指因自然之美或理想化的爱慕而梦幻陶醉的人或状态，带文学色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adjective) Filled with dreamy, romantic excitement—often because of an idealized love of nature, beauty, or a “muse-like” person; rapturous in a way that can seem unrealistic.","zh":"（形容词）沉浸在梦幻般、浪漫的兴奋中；常因对自然、美或某个“缪斯式”的人过度理想化而陶醉，甚至显得不切实际。"},"examples":[{"en":"The poet wrote in a nympholept mood after wandering through the spring woods.","zh":"诗人在春日林间漫步后，以一种梦幻陶醉的情绪写作。"},{"en":"His nympholept admiration made ordinary conversations feel like love poems.","zh":"他那种近乎痴迷的仰慕让普通对话都像情诗一样。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) A person who is nympholept—someone seized by romantic, ecstatic inspiration, especially about nature or an idealized beloved.","zh":"（名词）沉醉者、陶醉者；指被浪漫而狂喜的灵感“攫住”的人，尤指因自然之美或理想化的爱慕对象而神魂颠倒的人。"},"examples":[{"en":"She teased him gently: “You’re such a nympholept when you talk about the sea.”","zh":"她轻轻打趣他：“你一谈到大海就像个陶醉者。”},{"}]}],"synonyms":["rapturous","enraptured","lovestruck","dreamy","romantic"],"phonetic":"/ˈnɪm.fəˌlɛpt/","extraExplanation":["这个词较少见，语气偏文学/书面，用来形容“被美与幻想击中”的陶醉状态。它并不等同于日常口语里的“crush（暗恋）”，更强调一种诗意、近乎神秘的迷恋。","词源来自希腊语 nymphē（宁芙：自然精灵/仙女）+ lēptos（被抓住的）。古典文学里“宁芙”常象征自然的灵性与诱惑，因此 nympholept 带有“被自然/仙女般意象俘获”的文化底色。"]}
{"word":"nympholeptic","summary":{"en":"Nympholeptic means “dreamily ecstatic or entranced,” especially in a poetic/romantic way; more rarely it can imply an obsessive attraction to young women, which may be sensitive today.","zh":"nympholeptic 指“恍惚陶醉、入迷”（常见于诗意/浪漫语境）；较少见时也可指对年轻女性的执迷式迷恋，现代语境可能较敏感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In a dreamy or ecstatic state, often because of romantic or poetic fascination (originally, “as if inspired by nymphs” in Greek/Roman myth).","zh":"恍惚入迷的；陶醉的（常因浪漫或诗意的迷恋而出神；原意带有“仿佛受希腊罗马神话中仙女/宁芙启发”的色彩）。"},"examples":[{"en":"He walked through the museum in a nympholeptic haze, forgetting the time.","zh":"他在博物馆里恍惚入迷地走着，忘了时间。"},{"en":"Her nympholeptic descriptions made the ordinary garden feel magical.","zh":"她那种陶醉的描写让普通的花园都显得很神奇。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having an intense, sometimes obsessive attraction to young women or “nymph-like” girls (rare; can sound dated and may be sensitive in modern contexts).","zh":"对年轻女性或“像宁芙般的少女”有强烈、甚至近乎执迷的迷恋（较少见；语感偏旧，在现代语境可能涉及敏感含义）。"},"examples":[{"en":"In older literature, the character is described as nympholeptic, captivated by an idealized youthful figure.","zh":"在较早的文学作品中，这个角色被写成对理想化的年轻形象痴迷。"}]}],"synonyms":["enraptured","rapt","spellbound","entranced","transported","dreamy"],"phonetic":"/ˌnɪm.fəˈlɛp.tɪk/","extraExplanation":["词源：来自希腊语 nymphē（宁芙/仙女）+ -lēptos（被抓住、被攫住），字面有“被宁芙迷住”的感觉，所以常用来形容一种诗意的、出神的陶醉状态。","语体与使用建议：现代英语里更常用的是第一义（“如梦似幻的陶醉”）。第二义带有对未成年/“少女化”迷恋的暗示，容易引发不适或误解；写作时若只是想表达“神魂颠倒”，可考虑用 enraptured / rapt / spellbound 等更安全常见的词。","文学背景：该词在英语文学评论与诗歌语境里较常见，用来形容人物被自然、爱情或美所“摄住”的恍惚感（如对浪漫派诗歌氛围的描述）。"]}
{"word":"nymphomania","summary":{"en":"“Nymphomania” is an often outdated term referring to a supposed condition of uncontrollable sexual desire in women; it is also used as a judgmental insult and is best avoided in careful writing.","zh":"“Nymphomania”常被视为过时用语，指所谓女性无法控制的强烈性欲；也常被当作带评判的侮辱性标签，严谨表达中通常建议避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often considered outdated) a term for a supposed mental condition in which a woman is thought to have an unusually strong or uncontrolled sexual desire.","zh":"（常被视为过时用语）指一种被认为是女性“性欲异常强烈或难以控制”的所谓心理/医学状况的说法。"},"examples":[{"en":"In older books, the word “nymphomania” was sometimes used to label women who did not fit social expectations.","zh":"在较早的书籍中，“nymphomania”有时被用来给不符合社会期待的女性贴标签。"},{"en":"Many writers today avoid the term because it can be judgmental and misleading.","zh":"如今许多写作者会避免使用这个词，因为它可能带有评判性且容易误导。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often offensive) an insulting label for a woman, implying she is promiscuous or cannot control her sexual behavior.","zh":"（非正式用法，常带冒犯）对女性的侮辱性称呼，暗示其“滥交”或“无法控制性行为”。"},"examples":[{"en":"Calling someone a “nymphomaniac” is disrespectful and can shame them.","zh":"称呼别人“nymphomaniac”是不尊重的，可能造成羞辱和伤害。"},{"en":"Use neutral, respectful language when discussing sexual behavior or health.","zh":"在讨论性行为或健康话题时，应使用中性、尊重的表达。"}]}],"synonyms":["hypersexuality","compulsive sexual behavior","sexual addiction (controversial)","promiscuity (judgmental)"],"phonetic":"/ˌnɪm.foʊˈmeɪ.ni.ə/","extraExplanation":["这个词来自“nymph（宁芙/仙女）+ -mania（狂热/躁狂）”，带有把女性性欲“妖魔化”的历史背景。现代医学与心理健康语境中通常不把它当作规范诊断用语。","如果是在讨论临床或研究层面的“过度性行为/强迫性性行为”，英语里更常见较中性的说法如 hypersexuality（性欲亢进/性行为过度）或 compulsive sexual behavior（强迫性性行为）。"]}
{"word":"nymphomaniac","summary":{"en":"A dated, often offensive term for someone (especially a woman) believed to have uncontrollable sexual desire; many prefer neutral terms like “hypersexuality.”","zh":"一个过时且常带冒犯性的词，指（尤其是女性）被认为性欲无法控制；如今更常用“性欲亢进/强迫性性行为”等中性说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often considered outdated or offensive) A person, especially a woman, believed to have an abnormally strong or uncontrollable sexual desire.","zh":"（常被认为过时或带冒犯性）指一个人，尤其是女性，被认为有异常强烈或无法控制的性欲。"},"examples":[{"en":"In older books and films, the word “nymphomaniac” was sometimes used to shame women for expressing sexual desire.","zh":"在较老的书籍和电影里，“nymphomaniac”有时被用来羞辱表达性欲的女性。"},{"en":"Many people avoid this term today and choose more neutral language.","zh":"如今很多人会避免使用这个词，而改用更中性的说法。"}]}],"synonyms":["hypersexual (person)","hypersexuality","sex addict (informal)","compulsive sexual behavior"],"phonetic":"/ˌnɪmfoʊˈmeɪniˌæk/","extraExplanation":["这个词来源于希腊神话中的“nymph（宁芙/水泽仙女）”+ “-mania（狂热/躁狂）”。因此它在文化上带有把女性性欲“妖魔化、病理化”的历史包袱。","在现代医学语境中，更常见、更中性的表达是“hypersexuality（性欲亢进/性行为冲动增加）”或“compulsive sexual behavior（强迫性性行为）”。这些说法更强调行为与困扰程度，而不是对某个性别贴标签。","在日常交流中，如果你想表达“某人性欲很强”，建议用更尊重且不带诊断意味的说法；若涉及健康问题，使用医学或咨询领域的中性术语更合适。"]}
{"word":"nymphomaniacal","summary":{"en":"An adjective meaning “(of a woman) having or implying uncontrollably strong sexual desire,” but it is often sensational and can be offensive or sexist.","zh":"形容词：多指女性“性欲异常强烈/难以控制”，但常带耸动、冒犯或性别偏见，用法需谨慎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing or suggesting an unusually strong, uncontrolled sexual desire in a woman; often used in a sensational, judgmental, or offensive way.","zh":"（多指女性）表现出或暗示“异常强烈、难以控制的性欲”；该词常带猎奇、评判甚至冒犯色彩。"},"examples":[{"en":"The tabloid described her as “nymphomaniacal,” a word meant to shock rather than inform.","zh":"小报把她形容为“nymphomaniacal（性欲亢进的）”，这个词更多是为了耸动而不是提供信息。"},{"en":"Be careful with this adjective—it can stigmatize women and is rarely appropriate in neutral writing.","zh":"使用这个形容词要谨慎——它可能污名化女性，在中性写作中很少合适。"}]}],"synonyms":["hypersexual","sexually compulsive","sex-crazed","lustful"],"phonetic":"/ˌnɪmfoʊməˈnaɪəkəl/","extraExplanation":["这个词源自“nymphomania（女性性欲亢进）”，但在现代医学与公共讨论中，“nymphomania/ nymphomaniacal”多被视为过时且带性别偏见的标签，容易把女性的性行为妖魔化。","更中性、更具体的表达通常是：\"sexually compulsive\"（性冲动难以控制的）、\"hypersexual\"（性欲过强的；在医学/心理语境中也需谨慎）、或直接描述行为：\"She had multiple partners\"（她有多个伴侣）等，避免道德化评价。"]}
{"word":"nymphomaniacs","summary":{"en":"“Nymphomaniacs” means people (often said of women) believed to have uncontrollably strong sexual desire; the term is usually seen as outdated and judgmental.","zh":"“nymphomaniacs”指（常用来指女性）被认为性欲强到难以控制的人；该词多被视为过时且带评判色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of nymphomaniac) People—especially women—who are described as having an unusually strong or uncontrollable sexual desire (often considered an outdated, judgmental term).","zh":"（nymphomaniac 的复数）指（尤指女性）被形容为性欲异常强烈或难以控制的人（常被认为是过时且带评判色彩的用语）。"},"examples":[{"en":"The tabloid called the actress “a nymphomaniac,” using a sexist stereotype.","zh":"那家小报把那位女演员称为“性欲亢进者”，是在用带性别歧视的刻板印象。"},{"en":"In modern writing, many people avoid words like “nymphomaniac(s)” and use more neutral medical terms instead.","zh":"在现代写作中，很多人会避免使用“nymphomaniac（s）”这类词，而改用更中性的医学表述。"}]}],"synonyms":["hypersexual people","people with a high sex drive","sex addict(s) (informal)"],"phonetic":"/ˌnɪmfoʊˈmeɪniæk/","extraExplanation":["该词历史上常用于把女性的性欲“病理化”，在日常语境里容易带羞辱或道德评判；因此很多场合被视为冒犯或不恰当。","如果你想表达“性冲动很强/性行为频繁”，更中性的说法可以是：hypersexual / hypersexuality（性欲亢进/性行为冲动），或在非医学场景用：has a high sex drive（性欲很强）。使用时注意语境与尊重当事人。"]}
{"word":"nymphomanias","summary":{"en":"“Nymphomanias” is the plural of “nymphomania,” an outdated and often offensive term for supposed uncontrollable sexual desire in women.","zh":"“nymphomanias”是“nymphomania”的复数，指一种如今常被视为过时且可能冒犯的说法：把女性的强烈性欲描述为“病态或失控”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of nymphomania: a (now often considered outdated or offensive) term for a condition in which a woman is believed to have an abnormally strong or uncontrolled sexual desire.","zh":"nymphomania 的复数：指（如今常被认为过时、带有冒犯性或性别偏见的说法）认为女性具有“异常强烈或无法控制的性欲”的状态。"},"examples":[{"en":"Older medical books sometimes mentioned “nymphomanias,” but modern writing usually avoids this term.","zh":"一些较早的医学书会提到“nymphomanias”，但现代写作通常会避免使用这个词。"},{"en":"The article discusses how labels like “nymphomanias” reflect social attitudes rather than clear medical facts.","zh":"这篇文章讨论了像“nymphomanias”这样的标签如何更多反映社会观念，而不一定是明确的医学事实。"}]}],"synonyms":["hypersexuality","compulsive sexual behavior","sex addiction (informal)"],"phonetic":"/ˌnɪmfoʊˈmeɪniəz/","extraExplanation":["“nymphomania”历史上常被用来给女性的性行为贴上病理化标签，带有明显的性别偏见；在当代医学与心理健康语境中，这个词通常被认为不准确且可能带有羞辱意味。","更中性的替代表达包括“hypersexuality（性欲亢进/性冲动过强）”或“compulsive sexual behavior（强迫性性行为）”。在正式医疗语境中，有时会提到“compulsive sexual behavior disorder（强迫性性行为障碍）”，但不同体系对其界定不完全一致。","拼写提示：你输入的是复数“nymphomanias”；单数是“nymphomania”。"]}
{"word":"nymphon","summary":{"en":"Nymphon is mainly used as the scientific name of a genus of sea spiders; rarely, it may appear as a poetic/old variant related to “nymph.”","zh":"Nymphon主要是海蜘蛛属的学名；极少情况下也会作为与“nymph（仙女/水泽女神）”相关的诗歌/古旧变体出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of sea spiders (marine arthropods) in the family Nymphonidae","zh":"（生物）海蜘蛛属：一种海生节肢动物类群，隶属海蜘蛛科（Nymphonidae）"},"examples":[{"en":"Researchers collected several Nymphon specimens from deep-water reefs.","zh":"研究人员从深水礁区采集了几只海蜘蛛属（Nymphon）的标本。"},{"en":"Under the microscope, the Nymphon sea spider has very long, slender legs.","zh":"在显微镜下，可以看到海蜘蛛属（Nymphon）的个体有细长的腿。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, poetic) an old or nonstandard form related to “nymph,” seen mainly in classical or literary contexts","zh":"（罕见/诗歌）与“nymph（仙女/水泽女神）”相关的古旧或非标准形式，主要见于古典或文学语境"},"examples":[{"en":"In older texts, you may occasionally see spelling variants like nymphon.","zh":"在较旧的文本中，你偶尔会看到像 nymphon 这样的拼写变体。"},{"en":"The poet described a forest spirit, calling her a nymphon of the springs.","zh":"诗人描写一位森林精灵，称她为泉水的 nymphon（仙灵）。"}]}],"synonyms":["nymph (for the poetic sense only)"],"phonetic":"/ˈnɪm.fɑn/","extraExplanation":["“Nymphon”在现代最常见的用法是生物分类学中的属名（海蜘蛛属），属于海生节肢动物，并不是“蜘蛛（spider）”的常见词汇用法。","第二个义项属于非常少见的文学/古典式用法：英语里更常用的是“nymph”。如果你是在某篇古文、诗歌或学术注释里见到“nymphon”，建议优先判断是否指代“nymph”的变体拼写，或是否其实在说海蜘蛛属（Nymphon）。"]}
{"word":"nymphonacea","summary":{"en":"Nymphonacea usually refers to Nymphaeaceae, the water-lily family of aquatic flowering plants.","zh":"Nymphonacea通常指Nymphaeaceae（睡莲科），即一类水生开花植物的科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often spelled **Nymphaeaceae**) the water-lily family: a group of aquatic flowering plants with broad floating leaves and showy flowers, found in ponds, lakes, and slow-moving water.","zh":"（常拼作 **Nymphaeaceae**）睡莲科：一类水生开花植物，常见特征是宽大的漂浮叶和显眼的花，多生长在池塘、湖泊或水流缓慢的水域。"},"examples":[{"en":"Water lilies belong to the plant family **Nymphaeaceae**.","zh":"睡莲属于植物科——睡莲科（Nymphaeaceae）。"},{"en":"The pond is covered with floating leaves from **Nymphaeaceae** species.","zh":"池塘表面覆盖着一些睡莲科植物的漂浮叶。"}]}],"synonyms":["Nymphaeaceae","water-lily family"],"phonetic":"/ˌnɪmfiˈeɪsiˌiː/","extraExplanation":["“nymphonacea”在英语资料中不算常见标准拼写，通常指的是 **Nymphaeaceae**（睡莲科）。在写作或查资料时，建议使用标准拼写以便检索。","词源上与希腊语/拉丁语中的“nymph”（水泽女神、仙女）有关，因睡莲常与水域、神话意象联系在一起。"]}
{"word":"nymphos","summary":{"en":"“Nymphos” is an informal (often offensive) label meaning “nymphomaniacs,” used to describe people—often women—as having an uncontrollable sex drive.","zh":"“nymphos”是非正式且常带冒犯性的说法，指“nympho/nymphomaniac”的复数，用来给人贴标签，说其（常指女性）性欲无法控制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often offensive) A person—usually a woman—described as having an unusually strong or uncontrolled desire for sex; plural of “nympho,” short for “nymphomaniac.”","zh":"（非正式，常带冒犯性）指被描述为性欲异常强烈或无法控制的人（通常指女性）；“nympho”的复数形式，是“nymphomaniac”的简称。"},"examples":[{"en":"He used the word “nymphos” to insult women, which was disrespectful.","zh":"他用“nymphos”来侮辱女性，这很不尊重人。"},{"en":"It’s better to avoid labels like “nymphos” and speak respectfully about people’s private lives.","zh":"更好的做法是避免用“nymphos”这类标签，而是尊重地谈论他人的私生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) People who are extremely interested in sex or talk about sex a lot (used as a label).","zh":"（非正式）指对性非常着迷或经常谈论性的人（作为标签用语）。"},"examples":[{"en":"Some online comments call anyone who dates a lot “nymphos,” but that’s an unfair stereotype.","zh":"一些网络评论把爱约会的人都叫“nymphos”，但这是不公平的刻板印象。"}]}],"synonyms":["nymphos (plural)","nymphomaniacs","sex addict(s) (context-dependent)","hypersexual (more clinical)"],"phonetic":"/ˈnɪmfoʊz/","extraExplanation":["“nympho / nymphos”来自“nymphomaniac”，而“nymphomania”在旧式医学语境中曾被用来描述女性“过度性欲”，带有明显的性别偏见。现代英语中，这个词多用于辱骂、羞辱或猎奇，不适合在正式或尊重的交流中使用。","更中性、更礼貌的表达可根据语境选择：例如“sexually active（性活跃的）”“has a high sex drive（性欲较强）”“hypersexual（性欲亢进/过度性化）”（后者偏临床语境，使用需谨慎）。"]}
{"word":"nymphosis","summary":{"en":"Nymphosis is a rare noun meaning either development into a nymph stage (in insects) or, in older medical usage, enlargement of the labia minora.","zh":"Nymphosis 是个罕见名词，可指昆虫发育进入若虫阶段；在较旧医学用法中，也可指小阴唇增大（肥大）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The process of becoming a nymph; development into a nymph stage (especially in insects with incomplete metamorphosis).","zh":"（罕见）变成若虫（nymph）的过程；指发育进入若虫阶段（尤指不完全变态的昆虫）。"},"examples":[{"en":"In some insects, nymphosis happens after the egg hatches, producing a young form that looks like a small adult.","zh":"在一些昆虫中，卵孵化后会进入若虫发育阶段，幼体外形像缩小版的成虫。"},{"en":"The report describes nymphosis as a gradual change through several molts.","zh":"报告将若虫期的形成描述为通过多次蜕皮逐步变化的过程。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) Abnormal enlargement (hypertrophy) of the labia minora (historically called “nymphae”).","zh":"（医学，罕见）小阴唇异常增大（肥大）；旧称“小阴唇”为 nymphae，因此有此用语。"},"examples":[{"en":"The older textbook uses the term nymphosis for enlargement of the labia minora, but modern sources usually prefer clearer wording like “labial hypertrophy.”","zh":"较旧的教材用 nymphosis 指小阴唇增大，但现代资料通常更倾向于使用更明确的说法，如“labial hypertrophy（小阴唇肥大）”。"},{"en":"If someone is concerned about symptoms, it’s best to consult a qualified clinician rather than rely on outdated terms.","zh":"如果对相关症状感到担忧，最好咨询专业临床医生，而不要只依赖过时术语。"}]}],"synonyms":["(insect sense) nymphal development","(medical sense) labial hypertrophy"],"phonetic":"/nɪmˈfoʊsɪs/","extraExplanation":["这个词非常少见，多出现在旧式学术写作中。词根 nymph- 来自希腊/拉丁传统，既可指神话中的“宁芙（精灵）”，也曾被借用作女性外阴解剖结构的旧称（nymphae）。在现代英语里，医学语境更常用更直白、规范的表达（如 labial hypertrophy），以减少歧义并更尊重当事人。"]}
{"word":"nymphotomy","summary":{"en":"A rare medical term for surgery on the labia minora; modern English usually prefers “labiaplasty.”","zh":"一个少见的医学词，指对小阴唇进行手术；现代英语更常用“labiaplasty（小阴唇整形/缩小术）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A surgical operation on the labia minora (sometimes described as cutting, reducing, or removing part of them).","zh":"（医学）对小阴唇进行的手术（有时指切除/缩小/去除其部分）。"},"examples":[{"en":"The term “nymphotomy” is rare in modern medical English; doctors more often say “labiaplasty” or “reduction of the labia minora.”","zh":"“nymphotomy”在现代医学英语中很少用；医生更常说“labiaplasty（阴唇整形/小阴唇缩小术）”或“reduction of the labia minora（小阴唇缩小）”。"},{"en":"Any discussion of nymphotomy should include medical indications, risks, and the patient’s informed consent.","zh":"谈到nymphotomy时，应包括医学适应证、风险，以及患者的知情同意。"}]}],"synonyms":["labiaplasty","labia minora reduction","(historical) nymphotomy"],"phonetic":"/ˌnɪmˈfɑtəmi/","extraExplanation":["这个词非常少见，且带有历史色彩；在现代临床与科普语境里，多用更中性、更具体的术语，如“labiaplasty（小阴唇整形/缩小术）”。","涉及外阴手术的表达应尽量使用中性、尊重与医学准确的词汇；同时注意区分“自愿的医疗/整形手术”与“非自愿的割礼/残割（FGM）”，后者在许多国家被视为侵害人权并受到法律禁止或严格限制。","如果你是在阅读历史文献或旧医学资料里遇到该词，它可能出现在对女性身体的过度病理化或不当处理的语境中；理解时建议结合时代背景与伦理讨论。"]}
{"word":"nymphs","summary":{"en":"“Nymphs” is the plural of “nymph”: nature spirits in classical mythology; also (literary) graceful young women.","zh":"“nymphs”是“nymph”的复数：指古典神话中的自然精灵；也可作文学用语指优雅迷人的年轻女子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek and Roman mythology, a nymph is a beautiful female nature spirit connected to places like forests, rivers, mountains, or the sea.","zh":"（希腊、罗马神话中）宁芙：与森林、河流、山岳或海洋等自然景观相关的美丽女性自然精灵。"},"examples":[{"en":"In Greek myths, nymphs often live in forests or near springs.","zh":"在希腊神话里，宁芙常住在森林或泉水附近。"},{"en":"The poet describes the river as guarded by gentle nymphs.","zh":"诗人描写那条河被温柔的宁芙守护着。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) A young woman, often described as graceful, lively, and attractive.","zh":"（文学用语）年轻女子：常用来形容优雅、活泼、迷人的年轻女性。"},"examples":[{"en":"In the novel, he fell in love with a “nymph” he met at the summer festival.","zh":"在小说中，他爱上了在夏日庆典上遇到的“宁芙般的少女”。"},{"en":"The painting shows a nymph dancing in the moonlight.","zh":"那幅画描绘了一位宁芙在月光下起舞。"}]}],"synonyms":["nature spirit","dryad","naiad"],"phonetic":"/nɪmfs/","extraExplanation":["“nymph”来自希腊语“nymphē”，与“新娘、年轻女子”有关，因此在神话里常带有青春与自然之美的意象。","在现代英语里，用“nymph”指真实女性可能带有物化或暧昧色彩；日常交流中更常用于神话、艺术、诗歌或游戏/影视的设定。","常见搭配：wood nymph（林中宁芙）、water nymph（水中宁芙）、sea nymph（海中宁芙）。"]}
{"word":"nymphwise","summary":{"en":"“Nymphwise” means “like a nymph; in a graceful, light, youthful way,” mainly in poetic/literary contexts.","zh":"“nymphwise”意为“如仙女般；以轻盈、优雅、青春的方式”，主要用于诗歌或文学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the manner of a nymph; nymph-like—graceful, youthful, and light (often used in poetic or literary writing).","zh":"以仙女/水泽仙女（nymph）的方式；如仙女般的——轻盈、年轻、优雅（多见于诗歌或文学语境）。"},"examples":[{"en":"She moved nymphwise through the garden, quiet as a breeze.","zh":"她如仙女般在花园里轻盈穿行，安静得像一阵微风。"},{"en":"The poem describes the stream as nymphwise, alive with playful spirit.","zh":"诗中把小溪写得如仙女般灵动，充满顽皮的气息。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the qualities of a nymph; nymph-like (rare).","zh":"具有仙女特质的；如仙女般的（较罕见）。"},"examples":[{"en":"A nymphwise smile flickered across her face.","zh":"她脸上掠过一丝如仙女般的微笑。"}]}],"synonyms":["nymphlike","gracefully","lightly","airily","sprite-like"],"phonetic":"/ˈnɪmfˌwaɪz/","extraExplanation":["“nymphwise”由“nymph（仙女/水泽仙女）+ -wise（以……方式）”构成，属于较少见的文艺用词。它通常不是日常口语，更常用来营造神话、自然、轻盈灵动的意境。","“nymph”来自希腊-罗马神话，常指与森林、泉水、山野相关的女性自然精灵；因此“nymphwise”也常带有“自然、清新、飘逸”的联想。"]}
{"word":"nymss","summary":{"en":"“Nymphs” usually means female nature spirits in Greek/Roman mythology; in literary writing it can also describe very graceful young women.","zh":"“nymphs”通常指希腊罗马神话中的自然女精灵/仙女；在文学中也可用来形容非常优雅的年轻女子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “nymph”: in Greek and Roman mythology, a beautiful female nature spirit (often linked to forests, rivers, or mountains).","zh":"“nymph”的复数：在希腊罗马神话中，指与森林、河流、山岳等自然相关的美丽女性自然精灵/仙女。"},"examples":[{"en":"In the myth, nymphs lived in the forest and protected its springs.","zh":"在神话里，仙女住在森林中，守护着泉水。"},{"en":"The painting shows nymphs dancing beside a river.","zh":"这幅画描绘了仙女在河边起舞。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) Young women seen as graceful, lively, or magically beautiful.","zh":"（文学用法）指被描写为优雅、活泼或带有“仙气”的年轻女子。"},"examples":[{"en":"The poet compared the dancers to nymphs in moonlight.","zh":"诗人把舞者比作月光下的仙女。"},{"en":"In older literature, “nymph” can be a romantic, idealized image rather than a real person.","zh":"在较早的文学作品中，“nymph”常是一种浪漫化的理想形象，而非真实人物。"}]}],"synonyms":["nature spirits","fairies (approx.)","maidens (literary, approximate)"],"phonetic":"/nɪmfs/","extraExplanation":["“nymss”不是常见的英语拼写；你很可能想写的是 **nymphs**（nymph 的复数）。因为 **ph** 在英语里常发 /f/ 音，所以 **nymphs** 的结尾听起来像 /fs/。","“nymph”在现代英语中主要出现在神话、文学、艺术评论里；日常口语里不常用。"]}
{"word":"nyn","summary":{"en":"“nyn/NYN” is usually an abbreviation; most commonly it refers to Nynorsk (a Norwegian written standard). Other meanings are context-dependent.","zh":"“nyn/NYN”通常是缩写；最常见指新挪威语（挪威的一种书面语标准）。其他含义需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) A less common abbreviation meaning “Nynorsk,” one of the two official written standards of Norwegian.","zh":"（缩写）较少见的缩写，指“Nynorsk（新挪威语）”，挪威两种官方书面语标准之一。"},"examples":[{"en":"Some Wikipedia pages label the language as “nyn” for Nynorsk.","zh":"有些维基百科页面会用“nyn”标注语言为新挪威语。"},{"en":"This document is written in Nynorsk (nyn), not Bokmål.","zh":"这份文件是用新挪威语（nyn）写的，不是博克马尔语。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal) An initialism used in some communities for various phrases; meaning depends on context (often written as “NYN” and read letter-by-letter).","zh":"（缩写，非正式）在某些圈子里用作不同短语的首字母缩写；具体含义取决于语境（常写作“NYN”，按字母逐个读）。"},"examples":[{"en":"I saw “NYN” in the chat, but I needed more context to know what it meant.","zh":"我在聊天里看到“NYN”，但需要更多上下文才知道它是什么意思。"}]}],"phonetic":"/ˌɛn waɪ ˈɛn/","extraExplanation":["“nyn”并不是常见的英语单词，更像是缩写/代码。最稳定、最常见的用法之一是作为“Nynorsk”的语言标记或简称（例如在语言列表、网站标签或维基项目中）。","如果你是在某个特定平台/句子里看到“nyn”，把原句发我，我可以根据上下文帮你判断具体指什么。"]}
{"word":"nyoro","summary":{"en":"“Nyoro” is usually a Japanese-style cute sound used online to show wiggling/squirming, and it can also be a name/handle.","zh":"“nyoro”多为网络上带日语风格的可爱拟态音，表示扭动/蠕动；也可能是昵称或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Japanese-style sound/word used online (especially in anime/manga fandom) to suggest something wiggling or squirming in a cute way, sometimes with a cat-like feel.","zh":"一种带有日语风格的拟声/拟态用语，常见于网络（尤其动漫漫画圈），用来表现“扭动、蠕动、滑来滑去”的可爱感觉，有时也带点猫系卖萌的味道。"},"examples":[{"en":"The mascot goes “nyoro nyoro” as it wiggles across the screen.","zh":"吉祥物一边“nyoro nyoro”一边在屏幕上扭来扭去。"},{"en":"People comment “nyoro~” under the clip to mean the character is squirming cutely.","zh":"大家在片段下面留言“nyoro~”，意思是角色在可爱地扭动。"}]},{"partOfSpeech":"n.","definition":{"en":"A name (username/nickname, or occasionally a personal/place name) seen in some communities.","zh":"一个名字（网名/昵称；少数情况下也可能是人名或地名），在某些圈子里会看到。"},"examples":[{"en":"Nyoro posted a new drawing on their profile.","zh":"Nyoro 在个人主页发了一张新画。"}]}],"synonyms":["wiggle (sound)","squirm (sound)","slither (sound)"],"phonetic":"/ˈnjoʊroʊ/","extraExplanation":["“nyoro”更像拟态词而不是标准英语单词，常用于模仿日语里表达“蠕动/扭动”的感觉（类似日语的にょろにょろ nyoro-nyoro）。在英文网络语境里，它通常作为可爱音效出现，含义取决于画面或角色动作。","如果你是在特定作品/角色（例如动漫、游戏、虚拟主播等）里看到“Nyoro”，也可能是该圈子的专用梗或固定口癖；此时更建议结合上下文来理解。"]}
{"word":"NYPD","summary":{"en":"NYPD = the New York City Police Department.","zh":"NYPD = 纽约市警察局。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the New York City Police Department, the main law enforcement agency for New York City.","zh":"纽约市警察局（New York City Police Department），纽约市的主要执法机构。"},"examples":[{"en":"The NYPD said the investigation is ongoing.","zh":"纽约市警察局表示调查仍在进行中。"},{"en":"She works as a detective for the NYPD.","zh":"她在纽约市警察局担任侦探。"}]}],"synonyms":["New York City Police Department","the New York police"],"phonetic":"/ˌɛn waɪ piː ˈdiː/","extraExplanation":["“NYPD”是缩写，读作字母：N-Y-P-D。正式写作常用全大写。在新闻、影视、小说中很常见，尤其在与纽约城市生活、犯罪调查、警务工作相关的语境里。","在文化语境中，“the NYPD”常被用来泛指纽约警方整体形象或警务系统。相关常见表达：NYPD officer（纽约警员）、NYPD detective（纽约警探）、NYPD precinct（纽约警局分局/辖区警署）。"]}
{"word":"nyphomania","summary":{"en":"“Nymphomania” is an outdated, often stigmatizing term for a woman believed to have an unusually strong or uncontrolled sexual desire.","zh":"“Nymphomania”是一个较过时且常带污名的词，指被认为性欲异常强烈或难以控制的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often considered outdated or stigmatizing) a term for a woman thought to have an unusually strong or uncontrolled sexual desire.","zh":"（常被认为过时或带有污名）指被认为有异常强烈或难以控制性欲的女性的说法。"},"examples":[{"en":"The doctor noted that the label “nymphomania” is outdated and can be harmful.","zh":"医生指出，“nymphomania（性欲亢进）”这个标签已经过时，而且可能造成伤害。"},{"en":"In older novels, a female character might be unfairly described as having nymphomania.","zh":"在较老的小说里，女性角色可能会被不公正地说成有“nymphomania”。"}]}],"synonyms":["hypersexuality","compulsive sexual behavior","sexual addiction (informal)"],"phonetic":"/ˌnɪmfoʊˈmeɪniə/","extraExplanation":["这个词在历史上常用来“病理化”女性的性欲，与性别偏见有关，因此在现代医学与心理健康语境中往往避免使用。","现代更中性、更常见的表达包括：hypersexuality（性欲过强/性欲亢进，描述性用法）或 compulsive sexual behavior（强迫性性行为/性行为失控）。在正式诊断上，一些体系会讨论“Compulsive Sexual Behavior Disorder（强迫性性行为障碍）”，但各地标准与用法不尽相同。","拼写提醒：常见正确拼写是 nymphomania（你输入的 nyphomania 少了一个 m）。"]}
{"word":"nyroca","summary":{"en":"“nyroca” doesn’t appear to be a standard English word; it likely needs context or may be a misspelling/name/acronym.","zh":"“nyroca”不像标准英语单词；更可能需要上下文，或是拼写错误/专有名词/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a proper name, an acronym, a brand, or a misspelling of another word.","zh":"不是标准英语单词。可能是专有名词、缩写、品牌名，或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “nyroca” in a dictionary—can you share the sentence where you saw it?","zh":"我在词典里找不到“nyroca”——你能把它出现的句子发我吗？"},{"en":"Sometimes a word like “nyroca” is a username or a company name, not a vocabulary word.","zh":"像“nyroca”这样的词有时是用户名或公司名，而不是词汇单词。"}]}],"phonetic":"/ˈnaɪroʊkə/","extraExplanation":["目前常见英语词典与语料中几乎查不到“nyroca”。它更像是：\n1）某个词的打字/拼写错误；\n2）人名、地名或艺名；\n3）缩写（acronym）；\n4）品牌名或项目名。\n如果你把来源（例如一整句、截图、或你想表达的意思/语言环境）发我，我可以帮你推断它最可能对应的词。","如果你是在想写“New York …”相关的缩写，也请告诉我具体想表达什么（例如 New York City = NYC）。"]}
{"word":"NYSE","summary":{"en":"NYSE = the New York Stock Exchange, one of the world’s most important stock exchanges.","zh":"NYSE 指纽约证券交易所，是世界上最重要的证券交易所之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The New York Stock Exchange, a major stock market in New York City where shares of public companies are bought and sold.","zh":"纽约证券交易所，美国纽约市的重要证券交易市场，上市公司股票在此买卖交易。"},"examples":[{"en":"The company plans to list its shares on the NYSE next year.","zh":"这家公司计划明年在纽交所（NYSE）上市。"},{"en":"NYSE trading was volatile after the economic news.","zh":"经济消息发布后，纽交所（NYSE）交易波动很大。"}]}],"synonyms":["New York Stock Exchange","the NYSE"],"phonetic":"/ˌɛn waɪ ɛs ˈiː/","extraExplanation":["NYSE 常被读作字母音 /ˌɛn waɪ ɛs ˈiː/（逐个字母读）。在新闻里你也会看到 “the NYSE” 表示“纽交所”。","在财经语境中，常见搭配包括：NYSE-listed（在纽交所上市的）、NYSE trading（纽交所交易）、NYSE floor（交易大厅，历史上以现场喊价闻名，虽如今电子化程度很高）。","与 NASDAQ 的对比：NYSE 传统上以大型、成熟公司较多而闻名；NASDAQ 以科技公司较多而知名（但两者都包含多种行业）。"]}
{"word":"nyssa","summary":{"en":"Nyssa is most commonly the scientific genus name for tupelo/black gum trees; it’s also used in historical names like Gregory of Nyssa.","zh":"Nyssa 最常指图珀罗树/黑胶树等的植物属名；也可用于历史名称，如“尼撒的格里高利”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees in the dogwood family (Nyssaceae), including tupelos/black gums, known for glossy leaves and often brilliant red fall color.","zh":"一种树木属名（Nyssa，蓝果树属/多指 tupelo、black gum 等），常见特征是叶片有光泽、秋季变色鲜艳。"},"examples":[{"en":"The yard has a Nyssa tree that turns bright red in autumn.","zh":"院子里有一棵 Nyssa 属的树，秋天会变成鲜红色。"},{"en":"Beekeepers value tupelo honey, which comes from Nyssa flowers in some regions.","zh":"一些地区的养蜂人很看重 tupelo 蜂蜜，因为它来自 Nyssa 属树的花。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in history and geography (e.g., Gregory of Nyssa, an early Christian theologian; and some place names).","zh":"历史与地名中使用的名称（如“尼撒的格里高利”Gregory of Nyssa，早期基督教神学家；以及一些地名）。"},"examples":[{"en":"In a theology class, we read a passage by Gregory of Nyssa.","zh":"在神学课上，我们读了一段尼撒的格里高利的文字。"},{"en":"Nyssa also appears as a place name in some historical texts.","zh":"Nyssa 也会在一些历史文献中作为地名出现。"}]}],"synonyms":["tupelo","black gum","Nyssa genus"],"phonetic":"/ˈnɪsə/","extraExplanation":["“Nyssa”在英语里常见于两类语境：①植物学的拉丁学名（属名首字母常大写），日常说法更常用“tupelo（图珀罗树）/ black gum（黑胶树）”。②历史文化语境中最常见的是“Gregory of Nyssa（尼撒的格里高利）”，他与“Basil of Caesarea”“Gregory of Nazianzus”并称为‘加帕多家教父’（Cappadocian Fathers）之一。"]}
{"word":"nyssaceae","summary":{"en":"Nyssaceae is the botanical family known as the tupelo family, including Nyssa (tupelo/black gum) trees.","zh":"Nyssaceae 指“蓝果树科/图珀罗树科”，是包含蓝果树属（Nyssa，图珀罗树/黑胶树等）的植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flowering trees and shrubs (the tupelo family), including the genus Nyssa (tupelos/black gums) and related plants, found mainly in warm to temperate regions","zh":"蓝果树科（又称“紫树科/图珀罗树科”）：一类开花的木本植物科，主要包含蓝果树属（Nyssa，常见如黑胶树/图珀罗树）及其近缘植物，多分布于温暖至温带地区"},"examples":[{"en":"Nyssaceae includes the tupelo trees that grow in wetlands in the southeastern United States.","zh":"蓝果树科包含一些图珀罗树，它们生长在美国东南部的湿地中。"},{"en":"In botany class, we learned that Nyssa sylvatica belongs to Nyssaceae.","zh":"在植物学课上，我们学到黑胶树（Nyssa sylvatica）属于蓝果树科（Nyssaceae）。"}]}],"synonyms":["tupelo family"],"phonetic":"/naɪˈseɪsiˌiː/","extraExplanation":["“Nyssaceae”是植物分类学用语，常见于学术写作、植物志、园艺或自然科普中；日常英语里更常说“tupelo family（图珀罗树科）”或直接说具体属种（如tupelo/black gum）。","科名以模式属“Nyssa（蓝果树属）”命名；在不同分类系统中，它与山茱萸科（Cornaceae）等类群的界限与归属曾有调整。"]}
{"word":"nystagmic","summary":{"en":"Nystagmic means “related to nystagmus,” an involuntary repeated movement of the eyes.","zh":"nystagmic 指“与眼球震颤有关的”，即眼睛不自主、反复的摆动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to nystagmus (involuntary, repetitive eye movements).","zh":"与眼球震颤有关的（指眼睛不自主、反复的摆动）。"},"examples":[{"en":"The doctor observed nystagmic eye movements during the exam.","zh":"医生在检查时观察到眼球出现眼球震颤样的运动。"},{"en":"Some patients feel dizzy when their nystagmic movements get worse.","zh":"有些患者在眼球震颤加重时会感到头晕。"}]}],"synonyms":["nystagmus-related","nystagmus-associated"],"phonetic":"/nɪˈstæɡmɪk/","extraExplanation":["“nystagmic”来自名词“nystagmus（眼球震颤）”。在日常英语中更常见的说法是“nystagmus”本身，或用“nystagmus-related / nystagmus-like”来表达“与眼球震颤相关/类似眼球震颤”。","该词多见于医学语境（眼科、神经科、耳鼻喉科）。它通常用来描述体征（如 nystagmic movements 眼球震颤样运动），而不是日常生活中的普通描述。"]}
{"word":"nystagmus","summary":{"en":"Nystagmus is an uncontrolled, repetitive eye movement that can affect vision.","zh":"Nystagmus 指无法控制的反复眼球运动（眼球震颤），可能影响视力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition in which the eyes make fast, repeated movements that a person cannot control, often causing reduced vision or a feeling that the world is moving","zh":"眼球震颤：一种眼睛出现快速、重复且无法自主控制的摆动的状况，常伴随视力下降或“画面在晃动”的感觉"},"examples":[{"en":"The doctor noticed nystagmus during the eye exam.","zh":"医生在眼科检查时观察到了眼球震颤。"},{"en":"People with nystagmus may have trouble focusing on small text.","zh":"有眼球震颤的人可能难以聚焦小字。"}]}],"synonyms":["involuntary eye movement"],"phonetic":"/nɪˈstæɡməs/","extraExplanation":["词源提示：nystagmus 来自希腊语 nystagmos，和“打瞌睡、点头”有关，形象地比喻眼睛来回“点动”。","用法提示：这是医学术语，日常更口语的说法常会描述为“眼睛不由自主地抖动/跳动”。","常见搭配：horizontal/vertical nystagmus（水平/垂直眼震），congenital nystagmus（先天性眼震），acquired nystagmus（后天性眼震）。"]}
{"word":"nystatin","summary":{"en":"Nystatin is an antifungal medicine used mainly for Candida (yeast) infections such as oral thrush.","zh":"Nystatin（制霉菌素）是一种抗真菌药，主要用于治疗念珠菌（酵母菌）感染，如口腔鹅口疮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antifungal medicine used to treat infections caused by Candida (yeast), especially in the mouth (oral thrush), skin, or digestive tract","zh":"一种抗真菌药（制霉菌素），用于治疗由念珠菌（酵母菌）引起的感染，常见于口腔（鹅口疮）、皮肤或消化道"},"examples":[{"en":"The doctor prescribed nystatin for oral thrush.","zh":"医生开了制霉菌素来治疗口腔鹅口疮。"},{"en":"Use the nystatin cream on the rash as directed.","zh":"按照说明把制霉菌素乳膏涂在皮疹处。"},{"en":"She swished the nystatin suspension in her mouth before swallowing it.","zh":"她先在口中含漱制霉菌素混悬液，然后再吞下。"}]}],"synonyms":["antifungal (general term)","mycostatin (brand name in some places)"],"phonetic":"/naɪˈstætɪn/","extraExplanation":["“Nystatin”是专有药名，来自“New York State（纽约州）”，因为它最早与纽约州的研究机构有关。","学习时可注意它的常见搭配：nystatin cream（乳膏）、nystatin suspension（混悬液/口服液）、nystatin tablets（片剂）。","它主要针对念珠菌（Candida），不是治疗细菌感染的抗生素；用法多为局部或口腔含漱，具体需遵医嘱。"]}
{"word":"nytril","summary":{"en":"“Nytril” is most likely a misspelling of “nitrile”: a chemical compound containing –C≡N, and commonly a material name in “nitrile gloves.”","zh":"“nytril”很可能是“nitrile”的拼写错误：既可指含有–C≡N的腈类化合物，也常指“腈手套”中的腈橡胶材质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A chemical compound that contains a nitrile group (–C≡N).","zh":"（化学）含有腈基（–C≡N）的化合物。"},"examples":[{"en":"Acetonitrile is a common nitrile used as a solvent in laboratories.","zh":"乙腈是一种常见的腈类化合物，常在实验室用作溶剂。"},{"en":"Some nitriles can be toxic, so they must be handled carefully.","zh":"一些腈类化合物可能有毒，因此必须小心处理。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common use) Short for “nitrile,” especially in “nitrile gloves” (gloves made from nitrile rubber).","zh":"（常用）“nitrile”的简称，常见于“nitrile gloves（腈手套）”，指用腈橡胶制成的手套。"},"examples":[{"en":"Use nitrile gloves when handling cleaning chemicals.","zh":"处理清洁化学品时要戴腈手套。"},{"en":"Nitrile is often chosen because it is more resistant to punctures than latex.","zh":"人们常选用腈材质，因为它通常比乳胶更耐刺破。"}]}],"synonyms":["acetonitrile (example nitrile)","cyanide-containing group (related concept)"],"phonetic":"/ˈnaɪtraɪl/","extraExplanation":["你输入的“nytril”更常见的标准拼写是 **nitrile**（腈 / 腈类；腈橡胶材质）。在日常生活中，很多人是通过“nitrile gloves（腈手套）”接触到这个词。","腈基（–C≡N）中的“≡”表示三键；在有机化学中，带有该官能团的化合物统称为腈类（nitriles）。"]}
{"word":"nyxis","summary":{"en":"Nyxis means a surgical puncture made with a needle or sharp instrument.","zh":"Nyxis 指（医学）穿刺：用针或尖锐器械进行的外科性刺入/穿孔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical puncture (a small hole made with a needle or pointed instrument), often for draining fluid or accessing a body cavity.","zh":"（医学）穿刺；用针或尖锐器械做的外科性刺入/穿孔，常用于抽液或进入体腔。"},"examples":[{"en":"The doctor performed a nyxis to remove excess fluid.","zh":"医生做了穿刺来抽出多余的液体。"},{"en":"In older medical writing, “nyxis” was used as a general term for needle puncture.","zh":"在较早的医学文献里，nyxis 可作为“针刺/穿刺”的泛称。"}]}],"synonyms":["puncture","needle puncture","paracentesis","aspiration"],"phonetic":"/ˈnɪk.sɪs/","extraExplanation":["nyxis 是一个比较少见、偏“书面/古典”的医学词，日常英语里更常用 puncture（刺破/穿孔）、needle puncture（针刺）、paracentesis（穿刺放液，如腹腔穿刺）、aspiration（穿刺抽吸）等更具体的词。","词源来自希腊语 nyxis，意为“刺、扎、戳”。在不同专科文献中，它有时会被用作“用针进行的穿刺操作”的概括性说法。"]}

