{"word":"oach","summary":{"en":"“Oach” is a very rare/obsolete word, sometimes used as a dialect form meaning “to ache,” and occasionally referring to a kind of fish in older regional usage.","zh":"“Oach”在现代英语中非常罕见/过时；有时作为方言表示“隐隐作痛”，也偶见于旧时方言中指一种鱼。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare/obsolete) to ache; to feel a dull, continuous pain.","zh":"（罕见/过时）疼痛；隐隐作痛。"},"examples":[{"en":"After the long walk, my legs began to oach.","zh":"走了很久之后，我的腿开始隐隐作痛。"},{"en":"His back would oach in cold weather.","zh":"天气冷的时候，他的背会酸痛。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/obsolete) a type of fish (used in some older regional English).","zh":"（罕见/过时）一种鱼（旧时方言用法）。"},"examples":[{"en":"In older texts, you may see “oach” listed among river fish.","zh":"在一些较旧的文本里，你可能会看到“oach”被列为河鱼之一。"}]}],"synonyms":["ache","hurt","throb"],"phonetic":"/oʊtʃ/","extraExplanation":["“oach”在现代英语里非常少见，多数学习者几乎不会遇到。你输入的词也可能是拼写少了首字母，例如：coach（教练/长途客车）或 roach（蟑螂/一种鱼）。如果你告诉我上下文句子，我可以帮你确认你想查的是哪一个词。"]}
{"word":"oad","summary":{"en":"“Oad” is an old/dialect word meaning “toad.”","zh":"“oad”是“toad（蟾蜍）”的古用或方言说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialectal/archaic) A toad.","zh":"（方言／古用）蟾蜍；癞蛤蟆。"},"examples":[{"en":"In some old rural speech, people might say “oad” instead of “toad.”","zh":"在一些较早的乡村口语里，人们可能会用“oad”来代替“toad（蟾蜍）”。"},{"en":"The poem mentioned an “oad” hiding under a stone.","zh":"那首诗提到一只“oad”躲在石头底下。"}]}],"synonyms":["toad"],"phonetic":"/oʊd/","extraExplanation":["“oad”主要出现在英语方言或较旧的文学/民俗语境中，本质上是“toad”的变体（省略或弱化了开头的 /t/ 发音）。现代标准英语里几乎都用“toad”。"]}
{"word":"oadal","summary":{"en":"**Oadal** is not a common English spelling; it usually refers to **odal/udal**, meaning inherited family land and the traditional legal right connected to keeping (or buying back) that land within a family.","zh":"**oadal** 不是常见拼写；通常指 **odal/udal**：祖传家族土地，以及与之相关的、让土地留在家族内（或回赎）的传统法律权利。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended spelling: **odal**.) Relating to inherited family land and the traditional legal right to keep it within a family, especially in old Scandinavian law.","zh":"（可能想写的是 **odal**。）指“祖传土地/家族世袭地产”及其相关的传统法律权利，尤指古代斯堪的纳维亚法律中的制度。"},"examples":[{"en":"In some Norwegian history texts, **odal** land could not easily be sold outside the family.","zh":"在一些挪威历史资料中，**odal** 土地不容易被卖到家族之外。"},{"en":"The farmer claimed an **odal** right to buy back the property.","zh":"这位农民主张自己拥有 **odal** 权利，可以把地产买回。"}]},{"partOfSpeech":"n.","definition":{"en":"The hereditary land right itself (the legal claim connected to such land).","zh":"（名词）指这种“祖传地产权/世袭回赎权”等法律权利本身。"},"examples":[{"en":"The court records mention an **odal** dating back several generations.","zh":"法院记录提到一项可追溯到数代以前的 **odal** 权利。"}]}],"synonyms":["udal","hereditary land right","ancestral land"],"phonetic":"/ˈoʊdəl/","extraExplanation":["**拼写与用法**：你输入的 *oadal* 在英语里不常见；更常见的形式是 **odal**，也常见变体 **udal**（尤其在苏格兰奥克尼群岛、设得兰群岛等受北欧法影响地区的历史语境中）。","**文化背景**：在传统北欧社会，土地不仅是财产，也与家族身份紧密相关；因此 *odal/udal* 体现了“土地应留在家族中”的观念。"]}
{"word":"oaf","summary":{"en":"An “oaf” is a clumsy or foolish person, usually said in a rude or teasing way.","zh":"“oaf”指笨拙或愚蠢的人，通常带嘲讽或不礼貌的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A clumsy, awkward, or foolish person (often used as an insult).","zh":"笨拙、迟钝或愚蠢的人（常带侮辱意味）。"},"examples":[{"en":"Stop acting like an oaf and pay attention.","zh":"别像个笨蛋一样，专心点。"},{"en":"He’s a nice guy, but he can be an oaf at parties.","zh":"他人不错，但在聚会上有时会显得很笨拙。"}]}],"synonyms":["clod","lout","imbecile","goof","dolt"],"phonetic":"/oʊf/","extraExplanation":["“oaf”语气通常不太友好，带有嘲讽或轻蔑；如果想更礼貌，可以用“clumsy person（笨拙的人）”或“awkward guy（有点尴尬的人）”。","常见搭配：a big oaf（傻大个/笨手笨脚的人）、lumbering oaf（动作迟缓的笨蛋）。在影视和小说里常用来形容“块头大但不机灵”的角色。"]}
{"word":"oafdom","summary":{"en":"Oafdom means oafish behavior or the state of being an oaf; it can also mean a world or group of oafs, often humorously or critically.","zh":"Oafdom 指笨拙粗鲁、不得体的行为或状态；也可指一群粗笨之人的“圈子/世界”，常带幽默或批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being an oaf (a rude, clumsy, or socially awkward person); oafish behavior","zh":"笨拙粗鲁（或社交笨拙、不得体）的状态或特质；“傻大个儿/粗人”式的行为"},"examples":[{"en":"He apologized for his oafdom at the dinner table after knocking over a glass.","zh":"他在晚餐桌上碰倒了杯子后，为自己的笨拙失礼道歉。"},{"en":"The character’s charm comes from his sincerity, not from his oafdom.","zh":"这个角色的魅力来自真诚，而不是来自他的笨拙粗鲁。"}]},{"partOfSpeech":"n.","definition":{"en":"a group or world of oafs (used humorously or critically)","zh":"一群笨拙粗鲁的人；“粗人圈子/傻大个儿的世界”（常带幽默或批评语气）"},"examples":[{"en":"In that locker-room oafdom, loud jokes mattered more than kindness.","zh":"在那种更衣室式的“粗人氛围”里，大声讲笑话比善意更重要。"}]}],"synonyms":["clumsiness","boorishness","loutishness","buffoonery"],"phonetic":"/ˈoʊfˌdəm/","extraExplanation":["“-dom”是常见后缀，表示“……的状态/领域/群体”，如 freedom（自由）、kingdom（王国）。因此 oafdom 直观上就是“oaf 的状态/世界”。","oafdom 多用于较口语或带讽刺的语境，语气比单说 clumsiness（笨拙）更带“人很不得体/不懂分寸”的评价。"]}
{"word":"oafish","summary":{"en":"Oafish describes someone who is clumsy and socially awkward in a somewhat foolish-looking way.","zh":"oafish 形容人笨拙、社交尴尬，并带有一点“傻里傻气/粗笨”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Awkward, clumsy, and socially uncomfortable; behaving in a rough or stupid-looking way.","zh":"笨拙的；不灵活的；（举止）粗笨、显得很傻的。"},"examples":[{"en":"He felt oafish at the party because he didn’t know how to start a conversation.","zh":"在派对上他觉得自己很笨拙，因为不知道怎么开启话题。"},{"en":"My oafish attempt at dancing made everyone laugh—including me.","zh":"我那笨拙的跳舞尝试把大家都逗笑了——包括我自己。"}]}],"synonyms":["clumsy","awkward","lumbering","bungling"],"phonetic":"/ˈoʊ.fɪʃ/","extraExplanation":["“oafish”来自名词“oaf”（笨蛋、傻大个），因此语气通常带一点贬义或取笑意味。描述自己时可显得自嘲；描述别人时要注意礼貌，可能会伤人。","近义词里，“clumsy”偏重“动作不灵活”；“awkward”更常指“社交尴尬”；“oafish”常把两者合在一起，还带“粗笨、傻里傻气”的感觉。"]}
{"word":"oafishly","summary":{"en":"“Oafishly” describes doing something in a clumsy or foolish way.","zh":"“oafishly”表示做事笨拙或显得傻气、不得体。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a clumsy, awkward, or foolish way.","zh":"以笨拙、尴尬或傻气的方式；呆头呆脑地。"},"examples":[{"en":"He oafishly knocked over his glass while trying to look confident.","zh":"他想装得很自信，却呆头呆脑地把杯子碰倒了。"},{"en":"She smiled oafishly, not sure what to say in front of everyone.","zh":"她傻笑着，不确定在大家面前该说什么。"}]}],"synonyms":["awkwardly","clumsily","foolishly","lumberingly"],"phonetic":"/ˈoʊ.fɪʃ.li/","extraExplanation":["“oafishly”来自名词“oaf”（笨蛋、傻大个），常带有轻微的嘲讽或不礼貌的语气；形容的是行为方式（笨手笨脚/不合时宜），不一定表示这个人本质上很坏。正式写作中可用较中性的“awkwardly”“clumsily”替代。"]}
{"word":"oafishness","summary":{"en":"Oafishness means awkward, clumsy, socially ungainly behavior or manner.","zh":"Oafishness 指笨拙、不得体、社交不够圆滑的举止或气质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being socially awkward, clumsy, and not very graceful (often in a slightly humorous or mildly critical way).","zh":"笨拙、不得体、社交不够机灵的特质（常带一点调侃或轻微批评）。"},"examples":[{"en":"His oafishness made him knock over the glass during the interview.","zh":"他的笨拙让他在面试时把杯子碰倒了。"},{"en":"She laughed at her own oafishness when she waved at the wrong person.","zh":"她发现自己跟认错的人挥手后，笑自己太不得体了。"}]}],"synonyms":["awkwardness","clumsiness","ungainliness"],"phonetic":"/ˈoʊ.fɪʃ.nəs/","extraExplanation":["“oafishness”来自形容词“oafish”（像“oaf”一样笨拙的人），后缀“-ness”把形容词变成名词，表示“……的状态/特质”。","语气上通常比“clumsiness（动作笨拙）”更偏向“人整体给人的笨拙、粗笨、社交不圆滑”的印象；有时带一点“傻乎乎但不一定恶意”的感觉。"]}
{"word":"oafs","summary":{"en":"“Oafs” means rude, clumsy, or stupid people; it’s the plural of “oaf” and is insulting.","zh":"“oafs”是“oaf”的复数，指粗鲁、笨拙或愚蠢的人，带侮辱意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “oaf”: a rude, clumsy, or stupid person (often used as an insult).","zh":"“oaf”的复数：指粗鲁、笨拙或愚蠢的人（常用于辱骂）。"},"examples":[{"en":"Stop acting like such an oaf—say sorry and clean it up.","zh":"别这么像个蠢粗的人——道歉，然后把它收拾干净。"},{"en":"A few oafs were shouting during the movie.","zh":"有几个粗鲁的家伙在电影里大喊大叫。"}]}],"synonyms":["lout","brute","clod","boor","jerk"],"phonetic":"/oʊf/","extraExplanation":["“oaf”语气偏贬义，带有人身攻击色彩；在正式场合或对不熟的人使用会显得很不礼貌。更中性的说法可以用“clumsy person（笨手笨脚的人）”“inconsiderate person（不体贴的人）”。","复数“oafs”发音末尾通常像 /s/（无声），因为“f”是清辅音。"]}
{"word":"oak","summary":{"en":"Oak means a strong acorn-producing tree, or the hard wood from that tree used in furniture and flooring.","zh":"Oak 指橡树（会结橡子、象征坚韧的树），也指橡木（常用于家具与地板的坚硬木材）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large tree that produces acorns and is known for strong wood","zh":"橡树；一种会结橡子、以木材坚硬著称的大树"},"examples":[{"en":"An old oak stood in the middle of the field.","zh":"田野中央立着一棵老橡树。"},{"en":"The path was shaded by oak trees.","zh":"小路被橡树遮荫。"},{"en":"In autumn, oak leaves often turn brown and fall later than many other trees.","zh":"秋天时，橡树叶常常变成褐色，而且比许多其他树落叶更晚。"}]},{"partOfSpeech":"n.","definition":{"en":"the hard, strong wood from an oak tree, used to make furniture and floors","zh":"橡木；橡树的坚硬木材，常用于家具和地板"},"examples":[{"en":"They chose oak for the kitchen table because it lasts a long time.","zh":"他们选用橡木做厨房桌子，因为耐用。"},{"en":"The house has beautiful oak floors.","zh":"这房子有漂亮的橡木地板。"}]}],"synonyms":["oak tree","oakwood"],"phonetic":"/oʊk/","extraExplanation":["“Oak（橡树）”在英美文化里常象征力量、坚韧与长寿，因此也常出现在家族纹章、地名与文学意象中。比如英语里有谚语“Great oaks from little acorns grow.”（参天橡树也源自小橡子），用来鼓励从小事开始、坚持成长。","文学中橡树常作为“古老、稳定、见证时间”的意象出现；学习时可以把它和“acorn（橡子）”“oak leaf（橡叶）”“oak wood（橡木）”一起记。"]}
{"word":"oakberry","summary":{"en":"Oakberry is most commonly a brand name for an açaí bowl chain; rarely, it may be a nonstandard word meaning an oak’s fruit (loosely, an acorn).","zh":"Oakberry 最常见是卖巴西莓碗的连锁品牌名；极少数情况下可作非标准词指橡树的果实（宽泛地说橡子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for an international café chain best known for açaí bowls and smoothies","zh":"（专有名词）“Oakberry”，一家国际连锁轻食/咖啡品牌，主打巴西莓（açaí）碗与果昔"},"examples":[{"en":"Let’s grab an açaí bowl at Oakberry after class.","zh":"下课后我们去 Oakberry 吃个巴西莓碗吧。"},{"en":"Oakberry has a lot of topping choices, like granola and banana.","zh":"Oakberry 的配料选择很多，比如麦片和香蕉。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, nonstandard) a berry or fruit associated with an oak tree; sometimes used loosely to refer to an acorn","zh":"（少见/非标准用法）与橡树相关的“果实/浆果”；有时被宽泛地用来指橡子（acorn）"},"examples":[{"en":"In older or poetic writing, an author might call an acorn an “oakberry.”","zh":"在较老或较诗意的文字里，作者可能会把橡子称作“oakberry”。"}]}],"synonyms":["(for the fruit sense) acorn"],"phonetic":"/ˈoʊkˌbɛri/","extraExplanation":["“Oakberry”更常见的是品牌名，而不是日常英语词汇。标准英语里橡树的果实通常说 acorn（橡子），不会说 oakberry。","如果你在菜单、招牌或社交媒体上看到 Oakberry，大概率指这家卖 açaí 的连锁店；在文学/方言语境里才可能出现“像是橡树的莓/果”这种非常少见的用法。"]}
{"word":"oakboy","summary":{"en":"“Oakboy” is not a standard dictionary word; it’s usually a coined nickname/username or a character name meaning “oak boy,” suggesting strength or a link to oak trees.","zh":"“oakboy”不是标准词，通常是自造的昵称/网名或角色名，字面是“橡树男孩”，常带有坚强或与橡树相关的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (nonstandard) coined word meaning “oak boy”: a boy connected with oak trees, or a nickname suggesting strength, steadiness, or toughness like an oak","zh":"（非标准词/自造词）“橡树男孩”：指与橡树有关的男孩，或用作昵称，暗示像橡树一样坚强、沉稳、可靠"},"examples":[{"en":"In the story, the oakboy could talk to trees and protect the forest.","zh":"在故事里，这个“oakboy”能和树说话，还会保护森林。"},{"en":"His friends called him Oakboy because he stayed calm under pressure.","zh":"朋友们叫他 Oakboy，因为他在压力下也很冷静。"}]},{"partOfSpeech":"other","definition":{"en":"a username, screen name, or character name formed from “oak” + “boy”","zh":"由“oak（橡树）+ boy（男孩）”组成的用户名、网名或角色名"},"examples":[{"en":"Oakboy posted a new drawing in the forum today.","zh":"Oakboy 今天在论坛发了一张新画。"},{"en":"My gaming tag is Oakboy.","zh":"我的游戏昵称是 Oakboy。"}]}],"synonyms":["oak boy","oak lad","oak-hearted boy","strong boy"],"phonetic":"ˈoʊkˌbɔɪ","extraExplanation":["“oakboy”不是常见英语词典里的标准词，更常见的是作为网名、昵称或虚构角色名出现。","英语文化里“oak”常象征力量（strength）、坚韧（endurance）、长久（longevity）与可靠（reliability），所以把“oak”放在名字里往往带有这些形象联想。","如果你想表达“像橡树一样强壮的男孩”，更自然的说法可以是：a strong boy / a boy as strong as an oak / an oak-strong boy。"]}
{"word":"oaken","summary":{"en":"Oaken means “made of oak” or “relating to oak,” often used in a slightly literary style.","zh":"oaken 意为“橡木制的/与橡木有关的”，语气略带文学描写色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made of oak wood; relating to oak (a strong hardwood tree).","zh":"橡木制的；与橡树/橡木有关的（橡木是一种坚硬耐用的硬木）。"},"examples":[{"en":"They sat at an oaken table that had darkened with age.","zh":"他们坐在一张因岁月而变深的橡木桌旁。"},{"en":"The old house had heavy oaken doors and a stone fireplace.","zh":"那栋老房子有厚重的橡木门和石头壁炉。"}]}],"synonyms":["oak","oakwood"],"phonetic":"/ˈoʊkən/","extraExplanation":["“oaken”是由“oak（橡树/橡木）+ -en（表示‘由……制成的’）”构成的形容词，和“wooden（木制的）”“golden（金色的/金制的）”的构词方式相似。","在现代英语里，人们更常说“oak”作形容词（如“oak table”），而“oaken”带一点文学、古典或描写性更强的味道，常用于营造古老、厚重、坚固的意象。"]}
{"word":"oakenshaw","summary":{"en":"Oakenshaw is mainly a UK place name and a surname derived from that place name.","zh":"Oakenshaw 主要是英国的地名，也可作由地名演变而来的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for various locations—especially in northern England and Scotland; also used as a surname derived from that place name","zh":"地名（专有名词），常见于英格兰北部与苏格兰等地；也可作姓氏，源自这些地名"},"examples":[{"en":"Oakenshaw is a small village area in West Yorkshire, England.","zh":"Oakenshaw 是英格兰西约克郡的一个小村落地区。"},{"en":"Her family name, Oakenshaw, likely comes from an old place name.","zh":"她的姓 Oakenshaw 很可能来自古老的地名。"}]}],"synonyms":["toponym (place name)","surname"],"phonetic":"/ˈoʊkənˌʃɔ/","extraExplanation":["Oakenshaw 属于典型的英式地名构词：often 来自 oak(en)-（与“橡树”相关）+ shaw（古英语/方言里常指“小树林、灌木林”或“林地”）。因此这个名字大致带有“长橡树的林地/小树林”之意。","在英国文化里，很多姓氏直接来自地名（toponymic surnames）。一个人可能因为“来自 Oakenshaw”而逐渐以 Oakenshaw 作为姓氏。"]}
{"word":"oakesia","summary":{"en":"Oakesia is a biology (taxonomy) term: a genus name used for certain moths.","zh":"Oakesia 是生物分类学术语：用于指代某些蛾类的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name used in biology (taxonomy), referring to a group of moth species (family Geometridae) in some classifications","zh":"（生物分类学中的）属名：Oakesia，用于指代一类蛾（部分分类归入尺蛾科 Geometridae）的物种群"},"examples":[{"en":"In the field guide, several species are listed under the genus Oakesia.","zh":"在这本野外图鉴里，有几种物种被列在 Oakesia 这个属名之下。"},{"en":"Oakesia is typically written with a capital letter because it is a genus name.","zh":"Oakesia 通常首字母大写，因为它是属名。"}]}],"synonyms":["(taxonomic) genus name"],"phonetic":"/oʊˈkeɪʒiə/","extraExplanation":["“Oakesia”更常见于学术语境（论文、物种名录、昆虫图鉴），日常英语里几乎不会当作普通词使用。","生物分类名称会随着研究更新而调整；不同资料中 Oakesia 的归类与包含物种可能略有差异。"]}
{"word":"Oakland","summary":{"en":"Oakland is best known as a major city in Northern California across the bay from San Francisco.","zh":"Oakland 最常指美国加州北部、与旧金山隔湾相望的一座大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in Northern California, on the eastern side of San Francisco Bay (part of the San Francisco Bay Area).","zh":"美国加利福尼亚州北部的一座大城市，位于旧金山湾东岸（属旧金山湾区的一部分）。"},"examples":[{"en":"She moved from San Francisco to Oakland for a shorter commute.","zh":"为了通勤更方便，她从旧金山搬到了奥克兰。"},{"en":"Oakland has great food, especially in Chinatown and nearby neighborhoods.","zh":"奥克兰的美食很棒，尤其是唐人街和附近社区。"},{"en":"The conference will be held in downtown Oakland.","zh":"会议将在奥克兰市中心举行。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used for various towns and neighborhoods in the U.S. (less commonly referenced without extra context).","zh":"美国多地使用的地名（若无上下文，一般不如加州奥克兰常被指代）。"},"examples":[{"en":"There’s also an Oakland in New Jersey, so be sure to check the state.","zh":"新泽西也有个叫奥克兰的地方，所以要确认是哪个州。"}]}],"synonyms":["the East Bay","Oakland, CA"],"phonetic":"/ˈoʊklənd/","extraExplanation":["在英语里，像 Oakland 这种城市名属于专有名词，通常首字母大写；用介词时常说 in Oakland（在奥克兰）、from Oakland（来自奥克兰）、to Oakland（去奥克兰）。","奥克兰常被称为 East Bay（东湾）的一部分，文化上以多元族裔、艺术与音乐氛围、以及港口与工业历史闻名。","体育文化背景：奥克兰过去与多支职业球队关系密切（如 Raiders、Athletics 等），所以在新闻或对话中可能看到“Oakland”与体育搬迁、球迷文化一起出现。"]}
{"word":"oakland","summary":{"en":"Oakland most commonly refers to the large Bay Area city in Northern California, but it can also mean other places with the same name.","zh":"Oakland 通常指加州湾区的大城市奥克兰，也可以指其他同名的城镇或地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in Northern California (in the San Francisco Bay Area), known for the Port of Oakland, diverse communities, and strong arts and music scenes.","zh":"美国加利福尼亚州北部的一座大城市（旧金山湾区的一部分），以奥克兰港、多元社区以及活跃的艺术与音乐文化而闻名。"},"examples":[{"en":"She commutes from Oakland to San Francisco by BART.","zh":"她每天从奥克兰搭乘 BART 通勤去旧金山。"},{"en":"We spent the weekend eating in Oakland’s Chinatown and visiting Lake Merritt.","zh":"我们周末在奥克兰的唐人街吃饭，还去了梅里特湖。"},{"en":"The Port of Oakland is an important shipping hub on the West Coast.","zh":"奥克兰港是美国西海岸重要的航运枢纽。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used for several towns and neighborhoods in the United States (and elsewhere).","zh":"一个常见地名，除了加州奥克兰外，美国（以及其他地区）也有多个城镇或社区叫 Oakland。"},"examples":[{"en":"There’s an Oakland in New Jersey and another in Oregon.","zh":"新泽西州有个 Oakland，俄勒冈州也有一个。"},{"en":"Make sure you know which Oakland the address refers to.","zh":"要确认地址指的是哪个 Oakland。"}]}],"synonyms":["(proper noun) The Town (nickname, informal)"],"phonetic":"/ˈoʊklənd/","extraExplanation":["“Oakland”字面意思是“橡树林之地”（oak + land），很多地方用这个名字，常带有“曾经有大片橡树”的地理印象。","在美国语境里，如果不加说明，“Oakland”常默认指加州奥克兰；它与旧金山同属湾区，文化上常被提到其多元族群、社区运动与音乐（如嘻哈）传统。"]}
{"word":"oaklet","summary":{"en":"An oaklet is a small or young oak tree.","zh":"oaklet 指“小橡树/幼橡树”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small or young oak tree; a little oak.","zh":"小橡树；幼橡树。"},"examples":[{"en":"Several oaklets were planted along the path to replace older trees.","zh":"小路旁种了几棵小橡树，用来替换老树。"},{"en":"The deer hid among the oaklets at the edge of the forest.","zh":"鹿躲在森林边缘的小橡树丛中。"}]}],"synonyms":["young oak","oak sapling","sapling"],"phonetic":"/ˈoʊklət/","extraExplanation":["“oaklet”较少见，多用于描写性语境（如文学、自然写作）。","词尾“-let”常表示“小、幼、较小的”（如 booklet 小册子，streamlet 小溪流），因此 oaklet = “小橡树/幼橡树”。"]}
{"word":"oaklike","summary":{"en":"Oaklike means “resembling oak,” often describing wood grain/color or a person’s sturdy, dependable character.","zh":"oaklike 意为“像橡树/橡木的”，常形容木纹/颜色，也可比喻人坚韧可靠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an oak tree or oak wood in appearance, texture, strength, or character.","zh":"像橡树的；具有橡木外观、质地、坚固感或气质的。"},"examples":[{"en":"The table has an oaklike grain, even though it’s made from a different kind of wood.","zh":"这张桌子有类似橡木的纹理，尽管它是用其他木材做的。"},{"en":"He had an oaklike sturdiness—calm, steady, and hard to knock down.","zh":"他有一种“像橡树般”的坚韧——沉着、稳定，不容易被击倒。"}]}],"synonyms":["oaky","oakish","sturdy","rugged","woodsy"],"phonetic":"/ˈoʊkˌlaɪk/","extraExplanation":["“oaklike”是由“oak（橡树/橡木）+ -like（像……一样的）”构成的形容词，常用于描写木材纹理、颜色、坚硬度，也可用于比喻人的性格（坚毅、可靠、沉稳）。","在写作中，“oaklike”带有英美文化里对橡树的常见联想：坚固、长寿、可靠。类似表达还有“oak-solid（像橡木一样结实）”“as sturdy as an oak（像橡树一样强壮）”。"]}
{"word":"oakling","summary":{"en":"An oakling is a young or small oak tree (an oak sapling).","zh":"oakling 指小橡树、橡树幼苗（相当于 oak sapling）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young oak tree; a small oak sapling","zh":"小橡树；橡树幼苗"},"examples":[{"en":"They planted a row of oaklings along the path to restore the woodland.","zh":"他们沿着小路种了一排小橡树来恢复林地。"},{"en":"An oakling needs light and space to grow into a strong oak.","zh":"小橡树需要充足的光照和空间才能长成健壮的橡树。"}]}],"synonyms":["oak sapling","sapling","young oak"],"phonetic":"/ˈoʊk.lɪŋ/","extraExplanation":["“oakling”由“oak（橡树）+ -ling（表示‘小的/幼小的’后缀）”构成，含义类似于“sapling（树苗）”。在现代英语里不算常用，更常见的说法是“oak sapling”。","后缀“-ling”也出现在一些表示“小/幼”或“较低地位”的词中，例如“duckling（小鸭）”“gosling（小鹅）”。语气通常偏亲切或描写性。"]}
{"word":"oakmoss","summary":{"en":"Oakmoss is a fragrant lichen, especially known as a classic perfume ingredient that adds earthy, mossy, woody base notes.","zh":"橡树苔是一种有香气的地衣，常作为香水经典原料，带来泥土感、苔藓感与木质的后调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fragrant lichen (often used in perfumery) that grows mainly on oak trees; also the aromatic material extracted from it.","zh":"橡树苔（常用于香水的）一种有香气的地衣，主要生长在橡树上；也可指从其提取的香料原料。"},"examples":[{"en":"The perfume has oakmoss in the base notes, so it smells earthy and woody.","zh":"这款香水的后调含有橡树苔，所以闻起来有泥土与木质的气息。"},{"en":"Some classic fragrances rely on oakmoss to create a “forest after rain” feeling.","zh":"一些经典香水依靠橡树苔来营造“雨后森林”的感觉。"}]}],"synonyms":["lichen (general)","moss (informal)","oakmoss accord (perfumery)"],"phonetic":"/ˈoʊkˌmɔs/","extraExplanation":["“Oakmoss”在香水语境里很常见，通常用来描述一种“苔藓感/湿润森林/木质烟熏”的基调气味。它既可以指这种地衣本身，也可以指用于调香的提取物。","在现代香水与日化产品中，橡树苔相关成分有时会受到过敏原法规限制，因此你可能会在成分表或香评里看到“oakmoss accord（橡树苔香调）”“mossy notes（苔藓调）”等替代说法。"]}
{"word":"oakmosses","summary":{"en":"Oakmosses are lichens growing on trees, especially oaks, widely used in perfumery for an earthy, woody note.","zh":"Oakmosses 指生长在树上的地衣（尤指橡树上），常用于香水中营造泥土、木质香调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oakmoss: a gray-green lichen that grows on oak and other trees, often collected and used in perfumery for an earthy, woody scent and as a “fixative” (helps a fragrance last longer).","zh":"oakmoss 的复数：一种生长在橡树及其他树木上的灰绿色地衣，常被采集用于香水工业，带有泥土、木质气息，并可作“定香剂”（让香味更持久）。"},"examples":[{"en":"Many classic perfumes include oakmosses for a deep, forest-like smell.","zh":"许多经典香水会加入 oakmosses，带出浓郁的森林气息。"},{"en":"The old branches were covered with oakmosses and other lichens.","zh":"老树枝上覆满了 oakmosses 和其他地衣。"}]}],"synonyms":["oakmoss (plural form)","lichen (general term)"],"phonetic":"/ˈoʊkˌmɔs/","extraExplanation":["“oakmoss”并不是真正的苔藓（moss），而是地衣（lichen）：由真菌与藻类/蓝藻共生形成的生物体，所以中文常译作“橡树地衣”。","香水里提到的 oakmoss 往往指其提取物（如橡苔浸膏）。由于部分人可能对其中成分过敏，现代香精配方常会限制用量或使用替代香调。"]}
{"word":"oaks","summary":{"en":"“Oaks” is the plural of “oak”: oak trees, or the wood from oak trees.","zh":"“oaks”是“oak”的复数：指多棵橡树，也可指橡木（橡树的木材）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of large tree (genus Quercus) that often has strong wood and produces acorns","zh":"橡树；一种大型树木（栎属），木材坚硬，常结橡子"},"examples":[{"en":"An old oak tree shaded the yard all afternoon.","zh":"一棵老橡树整个下午都为院子遮阴。"},{"en":"Oaks can live for hundreds of years.","zh":"橡树可以存活数百年。"}]},{"partOfSpeech":"n.","definition":{"en":"the hard, durable wood from an oak tree, often used for furniture and floors","zh":"橡木；橡树的坚硬耐用木材，常用于家具和地板"},"examples":[{"en":"They chose oak for the dining table because it lasts a long time.","zh":"他们选用橡木做餐桌，因为很耐用。"},{"en":"The hallway has oak floors.","zh":"走廊铺的是橡木地板。"}]}],"synonyms":["oak tree","oak wood","hardwood (general)"],"phonetic":"/oʊk/","extraExplanation":["“oaks”通常是名词复数，单数是“oak”。也常见于地名或机构名里（如 The Oaks），意思是“有橡树的地方/橡树林”。","橡树在英美文化里常象征“力量、坚韧、长寿”。文学与诗歌中常用“oak”来描写稳固、古老或庄严的意象。"]}
{"word":"oaktongue","summary":{"en":"Oaktongue is a rare common name for a lichen associated with oak trees.","zh":"Oaktongue 是一个较少见的俗名，多指与橡树相关、长在橡树上的某类地衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare common name for a type of lichen that grows on oak trees (often used for oakmoss-like lichens).","zh":"一种较少见的俗名，指生长在橡树上的某类地衣（常被用来指类似“橡树苔 / oakmoss”的地衣）。"},"examples":[{"en":"The old oak’s bark was covered with oaktongue and other lichens.","zh":"那棵老橡树的树皮上覆满了橡舌地衣和其他地衣。"},{"en":"In the field guide, oaktongue is listed as a lichen found on hardwoods, especially oaks.","zh":"在野外图鉴里，“oaktongue”被列为生长在阔叶树上、尤其是橡树上的一种地衣俗称。"}]}],"synonyms":["oakmoss (related term)","lichen (general term)"],"phonetic":"/ˈoʊkˌtʌŋ/","extraExplanation":["“oaktongue”不是非常常见的现代通用词，更常见的相关词是“oakmoss”（橡树苔，一种地衣的俗称/香料原料名）。不同地区或不同图鉴里，“oaktongue”可能指向的具体物种并不完全一致。","写法上常见变体有“oak-tongue”“oak tongue”。如果你是在某本书/图鉴中看到的拼写，我也可以帮你根据上下文确认更可能对应哪一种地衣。"]}
{"word":"oakum","summary":{"en":"Oakum is tarred rope fiber used mainly to seal seams in wooden ships (and sometimes for packing).","zh":"oakum 指浸焦油的旧绳纤维，主要用于木船接缝捻缝防漏（也可作填充封缝材料）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loose fibers (usually hemp) taken from old ropes and then tarred, used especially to seal (caulk) the seams of wooden ships.","zh":"（常为麻纤维的）旧绳拆散后的纤维，通常浸过焦油，用于填塞并密封木船接缝（捻缝/嵌缝）。"},"examples":[{"en":"The shipwright packed oakum into the seams before coating them with pitch.","zh":"造船工先把麻絮塞进船板接缝里，再涂上沥青。"},{"en":"Without fresh oakum, the wooden hull would start to leak.","zh":"没有新的麻絮，木质船体就会开始漏水。"}]},{"partOfSpeech":"n.","definition":{"en":"A similar fibrous material used for packing, stuffing, or sealing gaps.","zh":"类似的纤维材料，用于填充、塞垫或封缝。"},"examples":[{"en":"They used oakum to pack the joint temporarily until proper parts arrived.","zh":"他们先用麻絮临时把接口填住，等合适的零件到货。"}]}],"synonyms":["caulking fiber","tarred hemp","packing fiber"],"phonetic":"/ˈoʊkəm/","extraExplanation":["“oakum”常见于航海与木船时代的语境：把旧麻绳拆成纤维后再浸焦油，用来“caulk（捻缝/嵌缝）”船板缝隙，防止渗水。","词源来自中古荷兰语，原意与“拆解、梳开绳索纤维”有关。英美历史上也出现过“picking oakum（拆麻絮）”作为苦役劳动的记载。"]}
{"word":"oakums","summary":{"en":"Oakum is loose rope fiber used for caulking wooden ships; historically, “picking oakum” was forced prison/workhouse labor.","zh":"Oakum 指拆散旧绳得到的纤维，常用于木船填缝防漏；历史上“picking oakum（拆麻絮）”也指监狱/济贫院的苦役。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A loose fiber made by pulling apart old ropes (usually hemp), traditionally used to seal the gaps in wooden ships and boats (caulking) and to stop leaks.","zh":"把旧绳子（多为麻绳）拆散后得到的松散纤维，传统上用于填塞木船缝隙以防漏水（用于“填缝/嵌缝”）。"},"examples":[{"en":"The crew packed oakum into the seams before sealing them with tar.","zh":"船员把麻絮塞进船板缝里，然后再用焦油封住。"},{"en":"Oakum was common on wooden ships long before modern sealants existed.","zh":"在现代密封材料出现之前，木船上常用麻絮来防漏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A task in some prisons or workhouses where people had to pick oakum—pulling apart old rope into fibers—as forced labor.","zh":"（历史用法）在一些监狱或济贫院里，“拆麻絮”曾是一种苦役：把旧绳拆成纤维。"},"examples":[{"en":"In the novel, the prisoner is sentenced to pick oakum all day.","zh":"小说里，那名囚犯被判整天拆麻絮。"}]}],"synonyms":["caulking fiber","rope fiber","hemp fiber"],"phonetic":"/ˈoʊkəm/","extraExplanation":["你输入的“oakums”是复数形式；单数是“oakum”。在航海语境中，它常与“tar（焦油）/pitch（沥青）”一起出现：oakum 先填缝，再涂 tar 形成防水层。","文学与文化背景：在19世纪英国的监狱与济贫院里，“picking oakum（拆麻絮）”常被用来象征单调、艰苦又带惩罚性的劳动，因此在一些维多利亚时期题材作品中会出现这种描写。"]}
{"word":"oakweb","summary":{"en":"“Oakweb” is most likely a proper name (brand/website), not a standard English vocabulary word; it suggests “oak + web.”","zh":"“Oakweb”多半是专有名词（品牌/网站名），不是标准英语词汇；含义上可理解为“橡树 + 网络”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name that appears to be a brand, company name, or website name; it is not a standard dictionary word in English.","zh":"一个专有名词，看起来像品牌名、公司名或网站名；它不是英语词典里的常见单词。"},"examples":[{"en":"I found the article on Oakweb, but I’m not sure who runs the site.","zh":"我在 Oakweb 上找到了那篇文章，但不确定这个网站是谁运营的。"},{"en":"Please check whether Oakweb is an official source before sharing the link.","zh":"在分享链接前，请确认 Oakweb 是否是官方来源。"}]},{"partOfSpeech":"other","definition":{"en":"In informal interpretation, a blend of “oak” + “web,” suggesting something related to oak trees or “strong/stable” ideas (oak) on the internet (web).","zh":"在非正式理解中，它可能是 “oak（橡树）”+“web（网络）” 的组合，暗示与橡树/“坚固稳定”（oak 的联想）以及互联网（web）有关。"},"examples":[{"en":"The name Oakweb sounds like a website about trees or nature.","zh":"Oakweb 这个名字听起来像是一个关于树木或自然的网站。"},{"en":"They chose “Oakweb” to suggest reliability and a strong online presence.","zh":"他们选用 “Oakweb” 这个名字，可能是想表达可靠、稳固的线上形象。"}]}],"synonyms":["brand name","website name","proper noun"],"phonetic":"/ˈoʊkˌwɛb/","extraExplanation":["“oak（橡树）”在英语文化里常象征坚韧、长寿、可靠；“web”常指互联网或网站。把两者拼在一起更像是取意象来命名，而不是一个有固定词义的普通词。","如果你是想查询某个具体的 Oakweb（例如公司、域名、项目或 App），建议补充上下文（链接、行业、所在国家/地区），我可以帮你判断它更可能指什么。"]}
{"word":"oakwood","summary":{"en":"Oakwood means wood from oak trees; it can also be a proper name for places or institutions.","zh":"oakwood 指橡木（橡树的木材）；也可作为地名或机构名称的专有名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wood from an oak tree, valued for being hard, strong, and durable (often used for furniture, flooring, barrels, and building).","zh":"橡木；橡树的木材（坚硬耐用，常用于家具、地板、酒桶、建筑等）"},"examples":[{"en":"The table is made of solid oakwood and will last for decades.","zh":"这张桌子是实心橡木做的，能用几十年。"},{"en":"Wine is sometimes aged in oakwood barrels to add flavor.","zh":"葡萄酒有时会在橡木桶中陈酿，以增加风味。"},{"en":"Oakwood floors are popular because they’re tough and beautiful.","zh":"橡木地板很受欢迎，因为它结实又好看。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun) used for towns, neighborhoods, schools, cemeteries, etc., especially in English-speaking countries.","zh":"“Oakwood”用作专有名词的地名（可指城镇、社区、学校、墓园等，英语国家中较常见）"},"examples":[{"en":"She moved to Oakwood for a new job.","zh":"她为了新工作搬到了奥克伍德（Oakwood）。"},{"en":"The meeting is at Oakwood High School.","zh":"会议在奥克伍德高中（Oakwood High School）举行。"}]}],"synonyms":["oak","oak timber","oak lumber","oakwood lumber"],"phonetic":"/ˈoʊkˌwʊd/","extraExplanation":["“oak”在英语文化里常象征力量、坚韧与长寿，因此不少地方会用“Oakwood”作为地名，带有“橡树林/橡木之地”的自然意象。","词形上是复合词：oak（橡树/橡木）+ wood（木材/树林）。作为普通名词时更常见的表达还有“oak wood”（分开写）和“oakwood”（合写都能见到，合写有时更像品牌/地名）。"]}
{"word":"oaky","summary":{"en":"Oaky means having an oak-wood aroma or flavor, especially in wine aged in oak barrels.","zh":"oaky 指带有橡木香气或风味，尤用于描述经橡木桶陈酿的酒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the smell or taste of oak wood, often from aging in oak barrels (common for wine and some spirits).","zh":"有橡木味的；带有橡木香气或风味的（常指葡萄酒或烈酒在橡木桶中陈酿后产生的风味）。"},"examples":[{"en":"This Chardonnay is very oaky, with notes of vanilla and toast.","zh":"这款霞多丽橡木味很明显，带有香草和烤面包的风味。"},{"en":"If you don’t like oaky wines, try an unoaked white.","zh":"如果你不喜欢橡木味重的酒，可以试试不经橡木桶的白葡萄酒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Like or relating to an oak tree (less common in everyday speech).","zh":"像橡树的；与橡树有关的（日常较少用）。"},"examples":[{"en":"The room had an oaky, forest-like smell.","zh":"房间里有一种像森林、带橡树气息的味道。"}]}],"synonyms":["oak-flavored","oak-aged","woody"],"phonetic":"/ˈoʊki/","extraExplanation":["在品酒语境里，oaky 通常不是“木头味”那么简单，它常指橡木桶带来的典型风味（如香草、椰子、烤面包、烟熏、香料），以及口感上的更厚重、更圆润。","与之相关的常见说法：oak-aged（橡木桶陈酿的）、unoaked（不经橡木桶的）、over-oaked（橡木味过重的）。"]}
{"word":"oam","summary":{"en":"OAM is usually an acronym. Most commonly it means “Operations, Administration, and Maintenance” in networking; it can also mean “Open Application Model” in cloud/software contexts.","zh":"OAM 通常是缩写：最常见指网络中的“运行、管理与维护”；在云/软件语境中也可能指“开放应用模型”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(telecommunications / IT) Operations, Administration, and Maintenance: the set of tools and activities used to monitor, manage, and troubleshoot a network or system.","zh":"（电信/IT）OAM＝Operations, Administration, and Maintenance（运行、管理与维护）：用于监控、管理并排查网络或系统问题的一整套工具与工作内容。"},"examples":[{"en":"The router supports OAM features for fault detection.","zh":"这台路由器支持用于故障检测的 OAM 功能。"},{"en":"Our team runs OAM checks every morning to keep the network stable.","zh":"我们团队每天早上都会做 OAM 检查，以保持网络稳定。"}]},{"partOfSpeech":"other","definition":{"en":"(software / cloud) Open Application Model: a framework for defining and managing applications, often mentioned in Kubernetes-related contexts.","zh":"（软件/云计算）OAM＝Open Application Model（开放应用模型）：一种用于定义与管理应用的框架，常见于 Kubernetes 相关语境。"},"examples":[{"en":"They described the service using an OAM specification.","zh":"他们用 OAM 规范来描述这个服务。"},{"en":"OAM can help standardize how teams deploy and operate apps.","zh":"OAM 可以帮助标准化团队部署和运维应用的方式。"}]}],"synonyms":["network management","monitoring and maintenance","operations and maintenance (O&M)"],"phonetic":"/ˌoʊ.eɪˈɛm/","extraExplanation":["“OAM”更常见于专业领域的缩写，通常写作大写；具体含义要看上下文（例如电信网络、云原生/软件、医疗等）。如果你告诉我出现它的句子或领域，我可以帮你锁定最准确的释义。"]}
{"word":"oannes","summary":{"en":"Oannes is a mythic Mesopotamian figure—often described as a fish-man—who brings knowledge and civilization to humans.","zh":"Oannes 是美索不达米亚神话人物，常被描述为“鱼人”，象征向人类带来知识与文明。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legendary “fish-man” teacher in ancient Babylonian (Mesopotamian) tradition, said to have come from the sea to bring people knowledge such as writing, laws, and arts.","zh":"古巴比伦（美索不达米亚）传说中的“鱼人”式导师，据说从海中来到人间，向人类传授文字、法律与各种技艺。"},"examples":[{"en":"In some ancient stories, Oannes rises from the sea to teach people how to live in cities.","zh":"在一些古代故事中，Oannes 从海中出现，教人们如何在城市里生活。"},{"en":"The author compares a wise stranger to Oannes, a bringer of knowledge.","zh":"作者把一位睿智的陌生人比作 Oannes——知识的带来者。"}]}],"phonetic":"/oʊˈæniz/","extraExplanation":["Oannes 多见于希腊作者对巴比伦传统的记载（常提到贝罗苏斯 Berossus 的叙述）：他被描述为半人半鱼的存在，白天教导人类，夜晚回到海中。现代学者常把他与美索不达米亚的智慧之神“埃亚/恩基（Ea/Enki）”或相关的“阿普卡鲁（apkallu，智者/贤者）”传统联系起来。","拼写与读音在不同资料中会有差异；有时也会见到与其他转写形式并列出现。"]}
{"word":"oar","summary":{"en":"An oar is a boat’s rowing tool (a long pole with a blade), and it can also mean to row using oars.","zh":"oar 指“桨/橹”，也可作动词表示“用桨划船”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long pole with a flat blade used to move a boat through water by rowing.","zh":"桨；橹（用来划水推动船前进的长杆，末端有扁平桨叶）。"},"examples":[{"en":"He pulled on the oars and the boat glided forward.","zh":"他用力划桨，小船向前滑去。"},{"en":"One oar slipped into the water with a splash.","zh":"一支桨“扑通”一声滑进了水里。"}]},{"partOfSpeech":"v.","definition":{"en":"To move a boat by using oars; to row.","zh":"用桨划船；划（船）。"},"examples":[{"en":"We oared across the lake before sunset.","zh":"我们在日落前划船穿过了湖面。"},{"en":"She learned to oar on a calm river.","zh":"她在平静的河上学会了划船。"}]}],"synonyms":["blade (informal, for an oar)","row (verb)","paddle (similar but not the same)"],"phonetic":"/ɔr/","extraExplanation":["在日常英语里，更常用的是动词“row”（划船）和名词“oar”（桨）。动词“oar”也正确，但相对更书面或更少见。","“oar”与“paddle”不同：oar（桨）通常固定在船舷的桨架上，用杠杆原理划水；paddle（桨/划桨）一般手持、不固定，常见于皮划艇、独木舟。"]}
{"word":"oarage","summary":{"en":"“Oarage” means rowing with oars, or the set of oars used on a boat.","zh":"“oarage”指用桨划船的动作/技巧，也可指一套船桨（桨具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or skill of rowing; movement produced by using oars","zh":"划船（使用桨）的动作或技巧；用桨推动产生的前进"},"examples":[{"en":"The team practiced its oarage early each morning to improve speed.","zh":"队员们每天清晨练习划桨（划船技巧），以提高速度。"},{"en":"Good oarage keeps the boat steady and moving straight.","zh":"良好的划桨技巧能让船更稳定、直线前进。"}]},{"partOfSpeech":"n.","definition":{"en":"the equipment of oars used for rowing (all the oars on a boat)","zh":"桨具；（一条船上的）所有船桨"},"examples":[{"en":"The crew checked the oarage before the race began.","zh":"比赛开始前，船员检查了整套船桨（桨具）。"},{"en":"Damaged oarage can make rowing unsafe.","zh":"受损的桨具会让划船变得不安全。"}]}],"synonyms":["rowing","oar-work","sculling","oars"],"phonetic":"/ˈɔrɪdʒ/","extraExplanation":["“oarage”较偏书面或专业用语，日常英语里更常说“rowing”（划船）或“oars”（桨）。","词源上来自“oar（桨）+ -age（表示行为/集合/结果的后缀）”，因此既可指“划桨的行为”，也可指“一套桨具”。"]}
{"word":"oarcock","summary":{"en":"An oarlock is the part of a boat that holds an oar in place for rowing.","zh":"oarlock 指船上用来固定船桨、便于划船的桨架（桨锁）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A U-shaped fitting on the side of a boat that holds an oar in place so you can row.","zh":"（船上的）桨架；桨锁——固定船桨、便于划船的 U 形金属（或木制）支架。"},"examples":[{"en":"He slipped the oar into the oarlock and began to row.","zh":"他把船桨放进桨架里，开始划船。"},{"en":"One oarlock was loose, so the oar kept jumping out.","zh":"有一个桨架松了，船桨总是跳出来。"}]}],"synonyms":["rowlock"],"phonetic":"/ˈɔrˌlɑk/","extraExplanation":["你输入的“oarcock”在现代英语里不常见，最可能是拼写错误，常用词是 **oarlock**（英式英语有时也写作 **rowlock**）。","在一些较旧或方言用法中，可能会看到 **oar-cock** 作为变体拼写，但如今一般不用；学习和写作建议使用 **oarlock**。"]}
{"word":"oared","summary":{"en":"“Oared” most commonly means “moved a boat using oars” (past of *oar*); it can also describe something that has/uses oars in a literary style.","zh":"“oared”最常见是“用桨划船”（oar的过去式/过去分词）；也可作形容词表示“有桨/用桨的”（偏文学用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of **oar**: to move a boat through water using oars.","zh":"**oar（划船）** 的过去式和过去分词：用桨划水使船前进。"},"examples":[{"en":"They oared across the lake before sunrise.","zh":"他们在日出前划船穿过了湖面。"},{"en":"We had oared for hours, so our arms were tired.","zh":"我们划了好几个小时，所以手臂很累。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having or using oars (often used before a noun, especially in older or literary style).","zh":"有桨的／用桨的（常作定语，较偏文学或较旧的用法）。"},"examples":[{"en":"An oared boat waited by the shore.","zh":"岸边停着一艘有桨的小船。"}]}],"synonyms":["rowed","paddled (similar but not the same)","propelled"],"phonetic":"/ɔrd/","extraExplanation":["“oared”最常见是动词“oar”的过去式/过去分词（像 walked, played）。当它作形容词（如 oared boat）时，语感更偏文学描写，现代口语更常说 “a boat with oars” 或 “a rowing boat”。","“oar”作动词与“row”意思很接近；日常更常用“row”（rowed），而“oar”作动词相对少见，但在描写场景或强调“用桨”的动作时仍会出现。"]}
{"word":"oarfish","summary":{"en":"An oarfish is a rare, extremely long deep-sea fish sometimes seen near the surface or washed ashore.","zh":"皇带鱼是一种罕见、体型极长的深海鱼，偶尔会在海面附近出现或被冲上海岸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very long, ribbon-shaped deep-sea fish (Regalecus glesne), known for its tall red dorsal fin and rare appearances near the surface","zh":"皇带鱼；一种生活在深海、身体细长如缎带的鱼（学名 Regalecus glesne），背鳍呈红色，偶尔会在海面附近被发现"},"examples":[{"en":"An oarfish was found washed up on the beach after the storm.","zh":"暴风雨过后，一条皇带鱼被冲上了海滩。"},{"en":"Because oarfish live deep underwater, most people never see one alive.","zh":"由于皇带鱼生活在深海，大多数人从未见过活体。"}]}],"synonyms":["ribbonfish (informal/loose use)","king of herrings (nickname)"],"phonetic":"/ˈɔrˌfɪʃ/","extraExplanation":["“oarfish”这个名字可能来自它细长的身体像船桨（oar），或传说中它用长长的腹鳍像“划桨”一样在水中移动。","在日本等地，皇带鱼偶尔会与“地震鱼”等民间说法联系在一起，但这并不是科学结论；它们上浮或被冲上海岸更常见的原因可能与洋流、受伤、疾病或环境变化有关。"]}
{"word":"oarfishes","summary":{"en":"“Oarfishes” is the plural of oarfish: huge, ribbon-like deep-sea fish rarely seen near the surface.","zh":"“oarfishes”是 oarfish 的复数：体型巨大、带状的深海鱼类，很少出现在海面附近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large, rare deep-sea fish with a long, ribbon-like silvery body and a tall red dorsal fin (often linked in folklore to “sea serpents”).","zh":"皇带鱼（深海大型罕见鱼类，身体细长如带、银色，有高大的红色背鳍；民间常与“海蛇”传说联系在一起）。"},"examples":[{"en":"Oarfishes usually live deep in the ocean and are rarely seen alive near the surface.","zh":"皇带鱼通常生活在深海，很少在海面附近被人看到还活着。"},{"en":"A stranded oarfish attracted crowds because it looked like a “sea serpent.”","zh":"一条搁浅的皇带鱼吸引了很多人，因为它看起来像“海蛇”。"}]}],"synonyms":["oarfish","king of herrings"],"phonetic":"/ˈɔrˌfɪʃɪz/","extraExplanation":["“oarfish”单数是 oarfish，复数常见两种：oarfish 或 oarfishes。你输入的 oarfishes 是规则复数形式。","名称里有 oar（桨），据说与其又长又扁的鳍或身体形状相关；这类鱼有时被称为“king of herrings（鲱鱼之王）”。","在一些地区的新闻或社交媒体里，皇带鱼被误认为“地震鱼”或与地震预兆联系；这种说法缺乏可靠科学证据，更多是民俗与巧合。"]}
{"word":"oarhole","summary":{"en":"An oarhole is the place on a boat’s side where an oar rests and turns for rowing.","zh":"oarhole 指船舷上放置并转动船桨的桨孔/桨架位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hole or fitting on the side of a boat where an oar is placed and pivots while rowing.","zh":"船舷上的桨孔（或装置），用于把船桨放入其中并作为支点划船。"},"examples":[{"en":"He slid the oar into the oarhole and began to row.","zh":"他把船桨插进桨孔里，开始划船。"},{"en":"Check the oarholes for cracks before you head out on the water.","zh":"下水前先检查桨孔有没有裂纹。"}]}],"synonyms":["oarlock","rowlock","thole","oarport"],"phonetic":"/ˈɔɹˌhoʊl/","extraExplanation":["“oarhole”在现代英语中不算特别常见；更常见的说法是 **oarlock**（美式常用）或 **rowlock**（英式常用），指固定船桨并让其转动的金属/塑料支架。","在一些较老的船只或文学描写里，oarhole 可能更字面地指“船舷上的孔”本身；而现代小艇多是“支架”而不是真正的洞。"]}
{"word":"oarial","summary":{"en":"“Oarial” is likely a misspelling of “oral,” meaning spoken (not written) or related to the mouth; it can also mean an oral exam.","zh":"“oarial” 很可能是 “oral” 的拼写错误，表示“口头的/非书面的”或“与口腔有关的”，也可指“口试”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spoken rather than written; related to speaking or the mouth.","zh":"口头的；非书面的；与说话或口腔有关的。"},"examples":[{"en":"The teacher gave us an oral exam.","zh":"老师给我们安排了口试。"},{"en":"This story was passed down through an oral tradition.","zh":"这个故事通过口述传统流传下来。"},{"en":"Take this medicine orally with water.","zh":"用水口服这种药。"}]},{"partOfSpeech":"n.","definition":{"en":"A spoken test (an oral exam).","zh":"口试；口头考试。"},"examples":[{"en":"I’m nervous about the oral tomorrow.","zh":"我对明天的口试很紧张。"}]}],"synonyms":["spoken","verbal","mouth-related"],"phonetic":"/ˈɔrəl/","extraExplanation":["“oarial” 不是常见英语单词，最可能是拼写错误，想写的是 **oral**（口头的/口试）。","**oral** 常见搭配：oral exam（口试）、oral presentation（口头报告）、oral history（口述史）、oral tradition（口述传统）。","注意区分：**oral**（口头的） vs **verbal**（口头的/用词的，强调“用语言”，也可指“措辞”）。"]}
{"word":"oarialgia","summary":{"en":"Otalgia is the medical term for ear pain (earache).","zh":"Otalgia 是“耳痛/耳痛症”的医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ear pain; an earache (a medical term).","zh":"耳痛；耳痛症（医学用语）。"},"examples":[{"en":"The doctor diagnosed otalgia caused by an ear infection.","zh":"医生诊断为由耳部感染引起的耳痛。"},{"en":"If you have severe otalgia with fever, seek medical care.","zh":"如果你出现严重耳痛并伴有发烧，应及时就医。"}]}],"synonyms":["earache","ear pain","auralgia"],"phonetic":"/oʊˈtæl.dʒi.ə/","extraExplanation":["“oarialgia”在英语里非常少见，常见、标准的医学词是 **otalgia**（耳痛）。也有人用 **auralgia** 表示耳痛，但临床与词典里最常见的是 otalgia。","词源构词：**oto-**（耳）+ **-algia**（疼痛），很多医学名词也用 -algia 表示“某处疼痛”，如 *neuralgia*（神经痛）。","这是医学/临床语境常用词；日常英语里更常说 **earache**。如果出现剧烈耳痛、流脓、听力下降或高烧，应尽快就医。"]}
{"word":"oaric","summary":{"en":"“Oaric” is a rare adjective meaning “related to an oar or rowing.”","zh":"“oaric”是个罕用形容词，意思是“与船桨或划桨（赛艇）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to an oar or to rowing; used especially in poetic or descriptive writing.","zh":"（罕用）与船桨或划桨有关的；常见于诗歌或描写性文字。"},"examples":[{"en":"The boat slid forward to the steady oaric rhythm of the crew.","zh":"小船在船员稳定的划桨节奏中向前滑行。"},{"en":"He learned the basics of oaric technique before joining the rowing team.","zh":"加入赛艇队前，他先学习了划桨技巧的基础。"}]}],"synonyms":["rowing","oar-related","of rowing"],"phonetic":"/oʊˈærɪk/","extraExplanation":["“oaric”在现代英语中非常少见，更常用的表达是“related to rowing / rowing”或直接说“oar”作定语（如“oar blade”“oar handle”）。如果你是在某段文本里看到它，往往带有文学色彩，用来营造“桨声/划行”的意象。"]}
{"word":"oaring","summary":{"en":"“Oaring” most commonly means “very loud and powerful,” or it can be the -ing form of “roar.” A rarer meaning relates to rowing with an oar.","zh":"“oaring”最常见表示“轰鸣的、震耳的”，也可作“roar”的 -ing 形式；较少见时与“用桨划船”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"very loud and powerful (often describing noise, wind, or traffic)","zh":"（声音、风、车流等）轰鸣的；震耳欲聋的"},"examples":[{"en":"We couldn’t hear each other over the roaring crowd.","zh":"人群的轰鸣声太大，我们彼此都听不见。"},{"en":"A roaring wind shook the windows all night.","zh":"呼啸的狂风整晚都在摇晃窗户。"}]},{"partOfSpeech":"v.","definition":{"en":"the -ing form of “roar”: to make a deep, very loud sound; to move or work with a loud sound","zh":"“roar”的动词 -ing 形式：发出低沉而巨大的声音；（车辆、机器等）轰鸣着移动/运转"},"examples":[{"en":"The lion came roaring out of the cage in the story.","zh":"故事里那只狮子咆哮着从笼子里冲出来。"},{"en":"Motorcycles were roaring down the street.","zh":"摩托车在街上轰鸣而过。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) using an oar; the act of rowing with oars","zh":"（罕见）用桨的；划桨（这一动作）"},"examples":[{"en":"They spent the afternoon oaring across the lake.","zh":"他们花了一下午划桨穿过湖面。"}]}],"synonyms":["thundering","deafening","booming","bellowing","raging"],"phonetic":"/ˈɔrɪŋ/","extraExplanation":["“roaring”最常见的用法是形容词，表示“非常吵、声势很大”，常搭配：roaring crowd（人群的轰鸣/欢呼）、roaring wind（呼啸的风）、roaring traffic（车流轰鸣）。","注意区分：roaring（轰鸣的/咆哮的）偏“声音巨大、低沉”；loud（大声的）更中性；deafening（震耳欲聋的）强调“吵到刺耳、让人难以忍受”。","“roaring”也常出现在短语中：roaring with laughter（大笑）、a roaring fire（熊熊大火/旺火）。这些是更地道、更常见的固定搭配。"]}
{"word":"oariocele","summary":{"en":"Ovariocele is a medical term for a hernia involving an ovary.","zh":"Ovariocele（常见拼写）指“卵巢疝”，即卵巢发生疝出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A hernia involving an ovary; the ovary protrudes through a weakened area of the abdominal wall or into an abnormal position.","zh":"（医学）卵巢疝；卵巢因腹壁薄弱等原因突出到异常位置或进入疝囊。"},"examples":[{"en":"The surgeon diagnosed an ovariocele after imaging showed the ovary had herniated.","zh":"影像检查显示卵巢发生疝出后，外科医生诊断为卵巢疝。"},{"en":"Ovariocele is uncommon and usually requires evaluation by a specialist.","zh":"卵巢疝并不常见，通常需要专科医生进一步评估。"}]}],"synonyms":["ovarian hernia"],"phonetic":"/oʊˌvɛriəˈsiːl/","extraExplanation":["“oariocele”更常见的是拼写为“ovariocele”。这是偏专业的医学词汇，日常英语里很少使用。","词源可拆为：ovari-（卵巢）+ -cele（疝、肿胀、突出），在医学术语中“-cele”常表示“疝/囊肿样突出”（如 hydrocele）。"]}
{"word":"oariopathic","summary":{"en":"“oariopathic” is not a recognized English word; it is likely a misspelling of a medical term such as “homeopathic” or “allopathic.”","zh":"“oariopathic”不是规范英语词，可能是医学相关词（如“homeopathic”“allopathic”）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It does not appear in major dictionaries and is likely a misspelling or a rare/incorrect form.","zh":"不是标准英语单词。在主流词典中未收录，可能是拼写错误或极少见/不规范的写法。"},"examples":[{"en":"I can’t find “oariopathic” in a dictionary—did you mean “homeopathic” or “allopathic”?","zh":"我在词典里找不到“oariopathic”——你是不是想写“homeopathic（顺势疗法的）”或“allopathic（对抗疗法/西医常规治疗的）”？"},{"en":"Please share the sentence where you saw “oariopathic,” and I can help identify the correct word.","zh":"请把你看到“oariopathic”的句子发给我，我可以帮你判断正确的词。"}]}],"extraExplanation":["你这个词很可能是以下常见词的拼写误差之一：\n- homeopathic /ˌhoʊmiəˈpæθɪk/（顺势疗法的）\n- allopathic /ˌæləˈpæθɪk/（对抗疗法的；常规西医治疗的）\n- osteopathic /ˌɑːstiəˈpæθɪk/（整骨疗法的）\n如果你告诉我它出现的语境（医学文章、处方、论文等）或原句，我可以更准确地帮你定位。"]}
{"word":"oariopathy","summary":{"en":"Ovariopathy means a disease or disorder of the ovaries (often misspelled as “oariopathy”).","zh":"Ovariopathy 指“卵巢的疾病或功能障碍”（“oariopathy”多为拼写错误）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Any disease or disorder of the ovaries.","zh":"（医学）卵巢病；卵巢的任何疾病或功能障碍。"},"examples":[{"en":"The doctor noted signs of ovariopathy and ordered an ultrasound.","zh":"医生注意到卵巢病的迹象，并安排了超声检查。"},{"en":"Some types of ovariopathy can affect fertility and hormone levels.","zh":"某些类型的卵巢病会影响生育能力和激素水平。"}]}],"synonyms":["ovarian disease","ovarian disorder"],"phonetic":"/oʊˌvɛriˈɑpəθi/","extraExplanation":["“oariopathy”很可能是拼写错误，更常见、规范的写法是 **ovariopathy**：ovario-（卵巢）+ -pathy（疾病）。这是较少见的医学词汇，临床上更常用更具体的诊断名称（如 ovarian cyst 卵巢囊肿、polycystic ovary syndrome/PCOS 多囊卵巢综合征 等）。"]}
{"word":"oariotomy","summary":{"en":"Oariotomy is a medical term meaning a surgical incision into an ovary.","zh":"oariotomy 是医学用语，指“卵巢切开术”，即对卵巢进行外科切开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) A surgical incision into an ovary; an operation that opens the ovary.","zh":"（医学）卵巢切开术；对卵巢进行外科切开的手术。"},"examples":[{"en":"In rare cases, the surgeon may perform an oariotomy to treat certain ovarian cysts.","zh":"在少数情况下，外科医生可能会进行卵巢切开术来处理某些卵巢囊肿。"},{"en":"The consent form explained the risks of oariotomy, including bleeding and infection.","zh":"同意书说明了卵巢切开术的风险，包括出血和感染。"}]}],"synonyms":["ovariotomy","ovariotomy"],"phonetic":"/ˌoʊˌɛriˈɑtəmi/","extraExplanation":["这个词比较少见，临床和现代文献中更常见的是 ovariotomy（卵巢切开术/卵巢手术的旧称）或用更具体的术语来描述具体操作。","词根提示：-tomy 表示“切开”；与之对比，-ectomy 表示“切除”。因此 oariotomy 是“切开卵巢”，而 oophorectomy/ovariectomy 更偏“切除卵巢”。","在非医学语境中几乎不会使用；阅读时可把它理解为“对卵巢做切开处理的手术”。"]}
{"word":"oaritic","summary":{"en":"A very rare/nonstandard adjective meaning “related to an oar; oar-shaped.”","zh":"一个非常少见/非标准的形容词，意思是“与船桨有关的；桨状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / nonstandard) relating to an oar; oar-shaped.","zh":"（非常少见／非标准用法）与船桨有关的；桨状的。"},"examples":[{"en":"The artifact has an oaritic outline, like a small paddle.","zh":"这件器物的外形呈桨状，像一把小桨。"},{"en":"The author describes an oaritic blade moving through the water.","zh":"作者描写一片桨状的叶片在水中划过。"}]}],"synonyms":["oar-like","oar-shaped","paddle-shaped"],"phonetic":"/oʊˈærɪtɪk/","extraExplanation":["“oaritic”在现代英语词典中几乎查不到，可能是拼写错误或非常冷门的专业/自造词。常见表达通常会用：oar-like（像船桨的）、oar-shaped（桨状的）、paddle-shaped（像桨板/划桨的）。","如果你是在某段原文里看到这个词，建议把前后句或出处贴出来，我可以帮你判断作者本意（例如是否想写“oar-like”或其他词）。"]}
{"word":"oaritis","summary":{"en":"“oaritis” isn’t a standard English word; it’s likely a misspelling (often of “otitis”).","zh":"“oaritis”不是标准英文单词；很可能是拼写错误（常见可能是“otitis”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a mistaken form of another word (often “otitis,” meaning an ear infection/inflammation).","zh":"不是标准英文单词。很可能是拼写错误或误写，常见的可能目标是“otitis”（指耳部感染/炎症）。"},"examples":[{"en":"I couldn’t find “oaritis” in a dictionary—did you mean “otitis”?","zh":"我在词典里找不到“oaritis”——你是不是想写“otitis”？"},{"en":"Please share the sentence where you saw “oaritis,” so I can help identify the correct word.","zh":"请把你看到“oaritis”的句子发出来，我可以帮你确认正确的词。"}]}],"phonetic":"/oʊˈærɪtɪs/","extraExplanation":["“-itis”是英语/医学里常见的后缀，表示“炎症”（如 bronchitis 支气管炎、tonsillitis 扁桃体炎）。如果你想表达“耳炎/中耳炎”，最常见的词是 otitis（如 otitis media 中耳炎）。","如果你告诉我它出现的上下文（句子、学科：医学/生物/别的），我也可以帮你判断是否是某个专有名词或拼写变体。"]}
{"word":"oarium","summary":{"en":"Oarium is a very rare form of “ovarium,” meaning an ovary (especially a flower’s ovary in botany).","zh":"oarium 极罕见，通常是 ovarium 的变体/误拼，意为“卵巢/（花的）子房”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a Latin-based scientific term meaning “ovary,” used especially in botany for the part of a flower that contains the ovules (future seeds). Often seen as the variant spelling “ovarium.”","zh":"（罕见）源自拉丁语的科学用语，意为“卵巢/子房”。在植物学中尤指花的子房，内含胚珠（将来形成种子）。更常见的拼写是“ovarium”。"},"examples":[{"en":"In older botanical texts, the ovarium is described as the swollen base of the pistil.","zh":"在较早的植物学文献中，ovarium（子房）被描述为雌蕊基部膨大的部分。"},{"en":"The ovarium contains ovules that develop into seeds after fertilization.","zh":"子房内含胚珠，受精后胚珠发育成种子。"}]}],"synonyms":["ovarium","ovary"],"phonetic":"/oʊˈvɛriəm/","extraExplanation":["“oarium”在现代英语里几乎不作为标准拼写出现，很多情况下是把“ovarium”误写/漏写了 v。常用英语对应词是：动物学/医学的“ovary（卵巢）”，植物学的“ovary（子房）”。","词源提示：来自拉丁语“ovarium”，与“ovum（卵）”同源，所以核心概念是“产卵/含卵（胚珠）的结构”。"]}
{"word":"oarless","summary":{"en":"“Oarless” means having no oars for rowing.","zh":"“oarless”表示“没有船桨的、无桨的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without oars; not having oars for rowing.","zh":"无桨的；没有船桨的（无法用划桨前进的）。"},"examples":[{"en":"The oarless boat drifted slowly toward the shore.","zh":"那艘无桨的小船慢慢漂向岸边。"},{"en":"They were stuck in an oarless canoe and had to paddle with their hands.","zh":"他们被困在一只没有船桨的独木舟里，只好用手划水。"}]}],"synonyms":["without oars","unrowed","unmanned (context-dependent)"],"phonetic":"/ˈɔrləs/","extraExplanation":["“oarless”由 oar（船桨）+ -less（没有……的）构成，常用于描写小船在水上“只能漂流、难以控制方向”的状态，因此在文学或新闻里也会带一点“无助、失去掌控”的感觉（比喻用法）。"]}
{"word":"oarlike","summary":{"en":"Oarlike means ‘shaped like an oar’ or ‘moving like an oar.’","zh":"oarlike 表示“桨状的”或“动作像划桨一样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling an oar (a long tool used for rowing a boat), especially in shape or movement","zh":"像桨的；（形状或动作）类似船桨的"},"examples":[{"en":"The fish has long, oarlike fins that help it glide through the water.","zh":"这种鱼有又长又像桨的鳍，帮助它在水中滑行。"},{"en":"She made an oarlike motion with her arms as she swam.","zh":"她游泳时用手臂做出像划桨一样的动作。"},{"en":"The robot’s oarlike paddles pushed it forward across the pond.","zh":"机器人的桨状划板推动它穿过池塘向前行进。"}]}],"synonyms":["oar-shaped","paddlelike","blade-shaped"],"phonetic":"/ˈɔrˌlaɪk/","extraExplanation":["“oarlike”也常写作“oar-like”，属于由名词 + like（像……的）构成的形容词，常用于写作中描述外形（如长、扁、可推动）或动作（如有节奏地前后摆动）。"]}
{"word":"oarlock","summary":{"en":"An oarlock is the holder on a boat that the oar rests in while rowing.","zh":"oarlock 指船上用于支撑并固定船桨、帮助划行的桨架/桨托。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fitting on the side of a boat that holds an oar in place while rowing.","zh":"（船舷上的）桨架；桨托（用于固定船桨并作为支点来划船的装置）"},"examples":[{"en":"He slipped the oar into the oarlock and began to row.","zh":"他把船桨卡进桨架里，开始划船。"},{"en":"One oarlock was loose, so the oar kept wobbling.","zh":"有一个桨架松了，所以船桨一直在晃。"},{"en":"Check the oarlocks before you head out on the lake.","zh":"出湖前先检查一下桨架。"}]}],"synonyms":["rowlock","oar holder","oar bracket"],"phonetic":"/ˈɔrˌlɑk/","extraExplanation":["“oarlock”常见于划艇、救生艇、渔船等场景。它提供支点，让划桨更省力、更稳定。","英式英语里也常见拼写“rowlock”，意思相同；在口语或不同地区，两种拼写都可能出现。"]}
{"word":"oarlocks","summary":{"en":"Oarlocks are the boat fittings that hold and pivot an oar during rowing.","zh":"Oarlocks 指船上用于固定并支撑船桨、让其转动的桨架／桨锁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fittings on the side of a boat that hold and guide an oar so it can pivot while rowing (plural of oarlock).","zh":"（船舷上的）桨架／桨锁，用来固定并引导船桨，使其在划船时能以支点转动（oarlock 的复数）。"},"examples":[{"en":"Make sure the oarlocks are tight before you start rowing.","zh":"开始划船前，先确认桨架都已拧紧。"},{"en":"One oar kept slipping out of the oarlocks, so we stopped to fix it.","zh":"有一支桨一直从桨架里滑出来，所以我们停下来修理。"},{"en":"The rowboat had wooden oarlocks worn smooth by years of use.","zh":"这艘划艇的木质桨架因多年使用而被磨得很光滑。"}]}],"synonyms":["rowlock","oar lock"],"phonetic":"/ˈɔrˌlɑks/","extraExplanation":["“Oarlock”常见于划艇（rowboat）、赛艇（shell）等语境。它通常安装在船舷或“桨架座”上，让桨在划水时围绕固定点旋转；有的设计是U形金属架，有的会配合“oarlock pin（桨栓）”或扣带，防止桨脱落。","拼写提示：也可写作“oar lock”（较少见的分写形式）。"]}
{"word":"oarlop","summary":{"en":"Orlop is a nautical term for a lower deck beneath the main deck on older ships.","zh":"Orlop 是航海用语，指旧式船只中位于主甲板下方的下甲板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deck on a ship below the main deck (often used for storage, cables, or crew space), especially in older sailing ships","zh":"（尤指旧时帆船的）下甲板/奥洛普甲板：位于主甲板之下，常用于储物、缆索或船员空间"},"examples":[{"en":"The sailors stored extra ropes on the orlop deck.","zh":"水手们把多余的绳索存放在下甲板上。"},{"en":"In historical ships, the orlop was often darker and more cramped than the upper decks.","zh":"在历史上的船只里，下甲板通常比上层甲板更昏暗、更狭窄。"}]}],"synonyms":["lower deck","belowdecks"],"phonetic":"/ˈɔrˌlɑp/","extraExplanation":["你输入的“oarlop”很可能是“orlop”的误拼或变体拼写；“orlop deck”是较常见的固定搭配。","这是偏航海/历史语境的词，现代日常英语里不常用，更多见于航海史、文学或博物馆介绍。"]}
{"word":"oarman","summary":{"en":"An oarman is a person who rows a boat with oars.","zh":"oarman 指用桨划船的人（桨手/划手）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who rows a boat using oars; a rower.","zh":"用桨划船的人；划手；桨手。"},"examples":[{"en":"The oarman pulled the boat away from the dock with steady strokes.","zh":"桨手用稳定的划桨把船从码头边划开。"},{"en":"In the old painting, an oarman ferries passengers across the river.","zh":"在那幅旧画里，一位桨手把乘客渡过河。"}]}],"synonyms":["rower","boatman","oarsman"],"phonetic":"/ˈɔrmən/","extraExplanation":["“oarman”由“oar（桨）+ man（人）”构成，字面意思就是“划桨的人”。现代英语里更常见的说法是“rower”，而“oarman”带一点书面、叙述或较旧的语感，常出现在描写渡船、运河或历史场景的文字中。"]}
{"word":"oarrowheaded","summary":{"en":"Arrowheaded means shaped like an arrowhead—pointed and triangular.","zh":"arrowheaded 指“箭头状的”，形状尖且呈三角形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like an arrowhead; having a pointed, triangular form.","zh":"箭头状的；呈尖三角形（像箭头）的。"},"examples":[{"en":"The road sign has an arrowheaded tip to show the direction clearly.","zh":"路标的尖端做成箭头状，方向更清楚。"},{"en":"An arrowheaded leaf often has two small points near the base.","zh":"箭头状的叶子底部常常有两个小尖角。"}]}],"synonyms":["arrow-shaped","triangular","pointed"],"phonetic":"/ˈeroʊˌhɛdɪd/","extraExplanation":["你输入的“oarrowheaded”很可能是拼写或粘贴时多了一个字母 o。英语里常见的词是“arrowheaded”（箭头状的）。","“arrowheaded”常用于描述形状（如叶片、符号、器物的尖端），在自然科普或说明文里也会出现。"]}
{"word":"oars","summary":{"en":"Oars are the long boat “blades” used for rowing; as a verb, to oar means to row a boat using oars.","zh":"Oars 指划船用的桨；作动词时，to oar 表示用桨划船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long pole with a flat blade used to move and steer a boat by rowing","zh":"（划船用的）桨；橹（用来划水推动或控制小船的长杆，末端有扁平桨叶）"},"examples":[{"en":"He pulled on the oars and the boat slid quietly across the lake.","zh":"他用力划桨，小船静静地滑过湖面。"},{"en":"The fishermen rested their oars when the wind picked up.","zh":"风变大时，渔夫们把桨歇了下来。"}]},{"partOfSpeech":"v.","definition":{"en":"to move a boat by rowing with oars","zh":"划（船）；用桨划行"},"examples":[{"en":"We oared back to shore before it got dark.","zh":"天黑前我们划回了岸边。"}]}],"synonyms":["row (v.)","paddle (often used loosely)"],"phonetic":"/ɔrz/","extraExplanation":["“Oar” 和 “paddle” 常被混用，但一般来说：oar（桨）通常通过“桨架/桨锁”固定在船边，用来划动；paddle（桨板/短桨）多不固定在船上，常用于皮划艇、独木舟等，用双手直接划水。","在文学与文化中，oar 常与“劳作、节奏、团队协作”相关（如赛艇运动）。在英语里也会用 rowing（赛艇/划船）来指这项运动。"]}
{"word":"oarsman","summary":{"en":"An oarsman is a person who rows a boat with oars, often in rowing/sport.","zh":"oarsman 指用桨划船的人，常见于赛艇等运动语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who rows a boat using oars, especially as part of a team in rowing.","zh":"划桨手；赛艇运动员（用桨划船的人，尤指团队划船/赛艇中的队员）。"},"examples":[{"en":"She trained for months to become a stronger oarsman on the rowing team.","zh":"她训练了好几个月，想成为划船队里更强的划桨手。"},{"en":"The oarsmen moved in perfect rhythm as the boat cut through the water.","zh":"划桨手们动作整齐划一，小船破水前行。"},{"en":"In the story, an oarsman ferries travelers across the river at dawn.","zh":"故事里，一位划桨手在黎明时分摆渡旅人过河。"}]}],"synonyms":["rower","oarsperson"],"phonetic":"/ˈɔrzmən/","extraExplanation":["“oarsman”传统上是阳性用法，但现代英语里常被当作性别中性的“划桨手”。在更强调包容的场合，也常用“rower”（更常见、更中性）或“oarsperson”。","词根提示：oar（桨）+ man（人）。阅读时看到“oarsman”通常能联想到赛艇、划艇或摆渡等场景。"]}
{"word":"oarsmanship","summary":{"en":"Oarsmanship means skillful rowing—good technique, timing, and control with oars.","zh":"Oarsmanship 指熟练的划桨能力，强调技巧、节奏与控制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skill of rowing a boat well; good technique and control when using oars","zh":"划桨（划船）的技术与本领；使用船桨时良好的技巧与控制能力"},"examples":[{"en":"Her oarsmanship improved after a few weeks of practice.","zh":"练了几周后，她的划桨技术进步了。"},{"en":"The coach praised the team’s smooth, synchronized oarsmanship.","zh":"教练称赞队伍划桨动作流畅、配合一致。"},{"en":"Good oarsmanship helps the boat stay balanced in rough water.","zh":"良好的划桨技术能帮助船在水流颠簸时保持平衡。"}]}],"synonyms":["rowing skill","rowing technique","boat handling"],"phonetic":"/ˈɔrzmənˌʃɪp/","extraExplanation":["oarsmanship 常见于划船/赛艇语境，尤其是在训练、比赛点评或教练反馈中。它强调“技术与控制”，不仅是用力划，更包括节奏、手脚协调、入水/出水的时机，以及保持船体稳定等。","词形上由 oar（船桨）+ -smanship（“……的技艺/本领”，如 craftsmanship 工艺、sportsmanship 体育精神）组成。注意它更偏“技术”，而 sportsmanship 更偏“精神与风度”。"]}
{"word":"oarsmen","summary":{"en":"Oarsmen are people who row a boat using oars, often in rowing teams.","zh":"oarsmen 指用船桨划船的人，常指赛艇队的桨手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who rows a boat, especially as a member of a team in a racing shell.","zh":"划船者；（尤指）赛艇队的桨手。"},"examples":[{"en":"The oarsmen moved in perfect rhythm as the boat glided across the lake.","zh":"桨手们动作整齐划一，小船在湖面上滑行。"},{"en":"Four oarsmen trained every morning for the regatta.","zh":"四名桨手每天早晨训练，备战赛艇比赛。"}]}],"synonyms":["rowers","oarspeople"],"phonetic":"/ˈɔrzmən/","extraExplanation":["“oarsmen”是复数形式；单数是“oarsman”。在较强调性别中立的现代英语里，也常用“rower（划船者/桨手）”来指任何性别的划船者。"]}
{"word":"oarswoman","summary":{"en":"An oarswoman is a woman who rows a boat, especially in rowing as a sport.","zh":"oarswoman 指女性划船者，常用于赛艇运动语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who rows a boat; a female rower.","zh":"女划船者；女赛艇运动员（女性划桨手）。"},"examples":[{"en":"The oarswoman kept a steady rhythm as the boat moved across the lake.","zh":"这位女划船者保持着稳定的节奏，船划过湖面。"},{"en":"She became the first oarswoman from her school to win the regional rowing title.","zh":"她成为学校里第一位获得地区赛艇冠军的女赛艇运动员。"}]}],"synonyms":["rower","female rower","crew member"],"phonetic":"/ˈɔrzˌwʊmən/","extraExplanation":["“oarswoman”由 oar（桨）+ woman（女性）构成，意思直观。现代英语里也常用更中性的说法，例如 rower（划船者/赛艇运动员）或 crew member（赛艇队队员）。在正式比赛语境中，常说 rowing（赛艇运动）和 rower，而不一定强调性别。"]}
{"word":"oarswomen","summary":{"en":"“Oarswomen” means female rowers (plural).","zh":"“oarswomen”指“女划手”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women who row boats using oars, especially in the sport of rowing.","zh":"使用桨划船的女性，尤指赛艇运动中的女划手。"},"examples":[{"en":"The oarswomen trained every morning on the river.","zh":"这些女划手每天早上都在河上训练。"},{"en":"Our team has four oarswomen and one coxswain.","zh":"我们队有四名女划手和一名舵手。"}]}],"synonyms":["female rowers","rowers"],"phonetic":"/ˈɔrzˌwʊmən/","extraExplanation":["“oarswoman”是单数；“oarswomen”是复数形式，和“woman → women”的变化一样。","在现代英语里，也常用更中性的说法“rower(s)”来指任何性别的划手；在正式比赛语境中两者都常见。"]}
{"word":"oarweed","summary":{"en":"Oarweed is a large kelp (brown seaweed) with long, strap-like fronds, common on rocky coasts.","zh":"Oarweed 指一种大型昆布类褐藻（海带），叶状体细长呈带状，常见于岩石海岸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large brown seaweed (a kind of kelp), especially one with long, strap-like fronds; often found on rocky coasts in the North Atlantic.","zh":"（尤指北大西洋岩石海岸常见的）大型褐藻/海带类植物；叶状体细长呈带状。"},"examples":[{"en":"After the storm, oarweed lay in long ribbons across the rocks.","zh":"暴风雨过后，岩石上铺满了带状的海带（oarweed）。"},{"en":"Crabs and small fish can hide among the fronds of oarweed.","zh":"螃蟹和小鱼会躲在海带（oarweed）的叶状体之间。"}]}],"synonyms":["kelp","seaweed","tangle (BrE)","sea belt (less common)"],"phonetic":"/ˈɔrˌwid/","extraExplanation":["“oarweed”直译像“桨草”，名字来自它又长又扁的形状，像船桨一样。在英式/海岸地区英语里更常见。","它常指一种昆布类海藻（如 *Laminaria digitata*），在科普或食用语境中也可能被更常用的词“kelp/seaweed”替代。"]}
{"word":"oary","summary":{"en":"Oary means oar-shaped or related to rowing, often in descriptive writing.","zh":"oary 指“像桨的/桨状的”，也可指“与划桨（划船）有关的”，多见于描写性文字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an oar (a paddle used to row a boat); shaped like an oar.","zh":"像桨的；桨状的（形状或外观类似划船用的桨）。"},"examples":[{"en":"The plant has long, oary leaves that taper at the ends.","zh":"这种植物有又长又呈桨状、末端逐渐变细的叶子。"},{"en":"He noticed the oary blades resting on the dock.","zh":"他注意到码头上放着桨状的桨叶。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to rowing; using oars (often used in a descriptive or poetic way).","zh":"与划桨有关的；用桨划行的（常用于描写或较文学性的表达）。"},"examples":[{"en":"They moved in oary silence across the lake at dawn.","zh":"拂晓时分，他们在湖面上悄然划行。"}]}],"synonyms":["oar-shaped","paddle-shaped","rowing"],"phonetic":"/ˈɔri/","extraExplanation":["“oary”在现代英语里不算常用，更常见于描写自然景物或带一点文学色彩的句子；日常表达里通常直接说“like an oar / oar-shaped”或“rowing”。"]}
{"word":"oasal","summary":{"en":"“oasal” isn’t a standard English word; it’s likely a misspelling (often of “oasis”).","zh":"“oasal” 不是标准英文词，通常是拼写错误（常见为 “oasis”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“oasal” is not a standard English word. It is most likely a misspelling of “oasis” or a typo related to “nasal.”","zh":"“oasal” 不是标准英语单词，很可能是把 “oasis（绿洲）” 拼错了，或是与 “nasal（鼻子的）” 相关的拼写错误。"},"examples":[{"en":"Did you mean “oasis”? An oasis is a green area in a desert with water.","zh":"你是不是想写 “oasis”？oasis 指沙漠中有水源的绿色地区（绿洲）。"},{"en":"If you meant “nasal,” it describes something related to the nose.","zh":"如果你想写的是 “nasal”，它表示“与鼻子有关的”。"}]}],"phonetic":"N/A","extraExplanation":["最常见的纠正是 “oasis”。它的复数是 “oases”。例如：Many travelers look for oases in the desert（很多旅人会在沙漠中寻找绿洲）。","如果你能告诉我你看到这个词的句子或上下文（比如一整句话/截图），我可以更准确判断你想查的词。"]}
{"word":"oasean","summary":{"en":"ASEAN is the Association of Southeast Asian Nations, a regional group for cooperation in Southeast Asia.","zh":"ASEAN是“东南亚国家联盟（东盟）”，是推动东南亚区域合作的组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Association of Southeast Asian Nations, a regional organization that promotes political and economic cooperation among Southeast Asian countries","zh":"东南亚国家联盟（东盟）：促进东南亚国家之间政治与经济合作的区域组织"},"examples":[{"en":"ASEAN works on trade, security, and cultural exchange in Southeast Asia.","zh":"东盟在东南亚推动贸易、安全与文化交流等合作。"},{"en":"Indonesia is one of the founding members of ASEAN.","zh":"印度尼西亚是东盟的创始成员之一。"}]}],"synonyms":["the Southeast Asian bloc","the Association of Southeast Asian Nations"],"phonetic":"/ˈɑːsiæn/","extraExplanation":["你输入的“oasean”不是常见英文词，最可能是想写“ASEAN”（东盟）。ASEAN是一个缩写，来自 Association of Southeast Asian Nations。","ASEAN成立于1967年（《曼谷宣言》），常见成员国包括印度尼西亚、马来西亚、菲律宾、新加坡、泰国等；后来扩展到10个成员国。","在新闻与学术写作中，ASEAN常与“ASEAN Summit（东盟峰会）”“ASEAN countries（东盟国家）”“ASEAN Economic Community, AEC（东盟经济共同体）”等搭配使用。"]}
{"word":"oases","summary":{"en":"Oases is the plural form of oasis—desert water-and-green areas, or places that feel like a calm refuge.","zh":"Oases 是 oasis 的复数，指沙漠中的绿洲，也可比喻让人感到宁静的避风港。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of oasis: fertile or green places in a desert where there is water; also, any peaceful place that feels like a refuge.","zh":"oasis（绿洲）的复数：沙漠中有水源、植被茂盛的地方；也可指让人感到宁静、像避风港一样的地方。"},"examples":[{"en":"After hours of driving through the desert, they finally reached a group of oases.","zh":"在沙漠里开了好几个小时后，他们终于到达了一片片绿洲。"},{"en":"In the noisy city, the small park felt like one of my oases.","zh":"在喧闹的城市里，那座小公园像是我的一处“绿洲”。"}]}],"synonyms":["refuges","havens","sanctuaries","retreats"],"phonetic":"/oʊˈeɪsiz/","extraExplanation":["“oasis”的复数是 **oases**（不是 *oasises*）。这个复数形式来自希腊语/拉丁语借词在英语中的常见变化：以 **-is** 结尾的名词有时变复数为 **-es**（如 *analysis → analyses*）。"]}
{"word":"oasis","summary":{"en":"An oasis is either a real water-filled fertile spot in a desert or, figuratively, a calm and refreshing place or time that offers relief.","zh":"oasis 指沙漠中有水的绿洲；也可比喻为让人放松、带来慰藉的“宁静之地/喘息时刻”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fertile place in a desert where water is found (from a spring or underground source), so plants can grow.","zh":"（沙漠中的）绿洲：有泉水或地下水的地方，因此植物可以生长。"},"examples":[{"en":"After days of walking in the desert, they finally reached an oasis with palm trees.","zh":"在沙漠里走了好几天后，他们终于到达了一片有棕榈树的绿洲。"},{"en":"Many animals depend on desert oases for water and shade.","zh":"许多动物依靠沙漠绿洲获得水源和阴凉。"}]},{"partOfSpeech":"n.","definition":{"en":"A peaceful or refreshing place (or time) that provides relief from a difficult, busy, or stressful situation.","zh":"（比喻）令人放松的地方/时刻：在艰难、忙碌或压力大时带来慰藉与喘息。"},"examples":[{"en":"The small park felt like an oasis in the middle of the noisy city.","zh":"这座小公园在喧闹的城市中像一片绿洲。"},{"en":"Her weekly yoga class is an oasis of calm.","zh":"她每周的瑜伽课是一段宁静的“绿洲时光”。"}]}],"synonyms":["refuge","haven","sanctuary","retreat"],"phonetic":"/oʊˈeɪsɪs/","extraExplanation":["“oasis”常用于写作与新闻中做隐喻，表达“压力中的喘息之地/安静角落”，比直说“a relaxing place”更形象。常见搭配：an oasis of calm/peace/greenery。","词源来自希腊语，指沙漠中有水的肥沃地带。发音重点在第二个音节（-AY-）。"]}
{"word":"oasitic","summary":{"en":"“Oasitic” is a rare adjective meaning “related to an oasis” or “oasis-like.”","zh":"“oasitic”是一个罕见形容词，表示“与绿洲有关的/像绿洲一样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to an oasis; having the character of an oasis (green, fertile, and refreshing in a desert or difficult place).","zh":"（罕见）与绿洲有关的；具有绿洲特征的（在荒漠或艰难环境中显得青绿、丰饶、令人舒适）。"},"examples":[{"en":"The village’s small garden felt like an oasitic spot in the middle of the dry plain.","zh":"村子里那片小花园在干燥的平原中央显得像一处“绿洲般”的地方。"},{"en":"Writers sometimes use “oasitic” to describe an unexpectedly calm, restful place.","zh":"有时作家会用“oasitic”来形容一个出人意料地宁静、让人休息的地方。"}]}],"synonyms":["oasis-like","refreshing","verdant"],"phonetic":"/oʊˈeɪsɪtɪk/","extraExplanation":["“oasitic”是非常少见的形容词，日常英语里更常用的是“oasis”（名词：绿洲）或“oasis-like”（形容词：像绿洲一样的）。","词形来源：oasis + -tic（表示“与……有关的”）。在写作中用它会显得偏文学或偏学术。"]}
{"word":"oast","summary":{"en":"An oast is a kiln/drying house used especially for drying hops.","zh":"oast 指（尤指烘干啤酒花的）烘干房/烘干炉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kiln or drying house used especially for drying hops (and sometimes malt), often found in traditional hop-growing areas","zh":"（尤指晾干啤酒花的）烘干房/烘干炉；也可用于烘干麦芽（常见于传统啤酒花产区）"},"examples":[{"en":"In Kent, you can still see old oast houses with cone-shaped roofs.","zh":"在英国肯特郡，你仍能看到带圆锥形屋顶的旧式啤酒花烘干房。"},{"en":"The hops were taken to the oast to dry before brewing.","zh":"啤酒花在酿造前会被送到烘干房里烘干。"}]}],"synonyms":["oast house","hop kiln","drying kiln"],"phonetic":"/oʊst/","extraExplanation":["“oast”主要是英式用语，常见搭配是 **oast house**（啤酒花烘干房）。这类建筑在英国乡村很有辨识度，常被改造成民宿或旅游景点。","很多学习者会把 **oast** 看成拼错的 **toast**（烤面包/祝酒）。两者发音和意思都不同：**toast** 更常用；**oast** 属于较少见、与啤酒花加工相关的词。"]}
{"word":"oasthouse","summary":{"en":"An oasthouse is a traditional building used to dry hops for making beer, especially in England.","zh":"oasthouse 指传统的“啤酒花烘干房”，主要见于英国（尤其英格兰东南部），用于烘干酿酒用的啤酒花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building used for drying hops (the flowers used to make beer), usually with a tall, cone-shaped roof and vents to let warm air out.","zh":"（啤酒花）烘干房；用来烘干啤酒花的建筑，常见特征是高高的圆锥形屋顶和通风口，便于热空气排出。"},"examples":[{"en":"Many old oasthouses in Kent have been turned into homes.","zh":"肯特郡许多旧的啤酒花烘干房已经被改造成住宅。"},{"en":"The museum shows how hops were dried in an oasthouse before modern equipment.","zh":"博物馆展示了在现代设备出现之前，人们如何在啤酒花烘干房里烘干啤酒花。"}]}],"synonyms":["hop kiln","kiln"],"phonetic":"/ˈoʊstˌhaʊs/","extraExplanation":["这个词主要见于英国英语，尤其与英格兰东南部（如Kent、Sussex）的传统啤酒花种植与啤酒酿造文化有关。","词源上常与方言/旧词有关：oast 指“烘烤、窑（kiln）”，因此 oasthouse 本质上就是“烘干用的屋子/窑房”。","在英国乡村文学或旅行写作中，oasthouse 常被用来营造田园风景意象；如今也常出现在房产介绍里，指“由啤酒花烘干房改建的特色住宅”。"]}
{"word":"oasts","summary":{"en":"“Oasts” is the plural of “oast,” a British term for a kiln/building used to dry hops for brewing.","zh":"“oasts”是“oast”的复数，指（尤指英国）用来烘干酿啤酒用啤酒花的烘房/烘炉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kiln or building used to dry hops (and sometimes malt), especially in Britain","zh":"（尤指英国的）烘干啤酒花的烘房/烘炉（有时也用于烘干麦芽）"},"examples":[{"en":"The farm still has old oasts where hops were dried for local breweries.","zh":"这座农场还保留着旧烘房，以前用来为当地啤酒厂烘干啤酒花。"},{"en":"You can see oasts with tall, pointed roofs in parts of southern England.","zh":"在英格兰南部的一些地区，你能看到带高尖屋顶的烘房。"}]}],"synonyms":["oast house","hop kiln","kiln"],"phonetic":"/oʊst/","extraExplanation":["“oast”是比较英式、偏地域文化的词，常见搭配是“oast house”（烘房）。在肯特郡（Kent）等传统啤酒花产区，许多“oast houses”有标志性的圆形塔和尖顶通风帽，如今有些被改造成住宅或民宿。","如果你本来想输入的是“toasts”（祝酒/烤面包片），那是另一个更常用的词；“oasts”则通常是“oast”的复数。"]}
{"word":"oat","summary":{"en":"Oat(s) are a common grain eaten as oatmeal or used in baking and animal feed.","zh":"Oat(s) 指燕麦，是常见谷物，可做燕麦粥、用于烘焙，也可作饲料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a grain used as food, often eaten as oatmeal/porridge or used in baking; also used as animal feed","zh":"燕麦；一种谷物，常做成燕麦粥/麦片或用于烘焙，也常作饲料"},"examples":[{"en":"I usually eat oats for breakfast with milk and fruit.","zh":"我早餐通常吃燕麦，加牛奶和水果。"},{"en":"This bread is made with oats and whole wheat flour.","zh":"这款面包用燕麦和全麦面粉做成。"},{"en":"Farmers grow oats for horses and cattle, too.","zh":"农民也会种燕麦来喂马和牛。"}]},{"partOfSpeech":"n.","definition":{"en":"(usually plural: oats) the seeds/food product of the oat plant","zh":"（常用复数 oats）燕麦籽/燕麦制品（指可食用的燕麦）"},"examples":[{"en":"A bag of rolled oats is easy to store and cook.","zh":"一袋燕麦片很容易储存，也很方便煮。"},{"en":"Overnight oats are popular because they need no cooking.","zh":"隔夜燕麦很受欢迎，因为不需要加热烹煮。"}]}],"synonyms":["grain","cereal","oat grain","rolled oats (related)","oatmeal (related)"],"phonetic":"/oʊt/","extraExplanation":["“Oat”指植物及其谷物；日常更常用复数“oats”来表示作为食物的燕麦（尤其在美式英语里）。","常见搭配：rolled oats（燕麦片）、steel-cut oats（切碎燕麦/钢切燕麦）、oatmeal（燕麦粥/麦片粥）、oat milk（燕麦奶）。","文化小提示：在英语世界里，oats常与健康饮食相关（高纤维、耐饱），所以会出现在早餐、能量棒、烘焙食品等语境中。"]}
{"word":"oatbin","summary":{"en":"An oatbin is a container for storing oats, often used as feed for animals like horses.","zh":"oatbin 指用来存放燕麦的容器，常见于马厩或农场，用作动物饲料储存。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bin or container used to store oats, often as animal feed (especially for horses).","zh":"（存放燕麦的）燕麦箱／燕麦储存桶，常用于存放动物饲料（尤其是马的饲料）。"},"examples":[{"en":"She scooped a bucket of oats from the oatbin for the horses.","zh":"她从燕麦箱里舀了一桶燕麦喂马。"},{"en":"Keep the oatbin closed so the feed stays dry.","zh":"把燕麦箱盖好，这样饲料才不会受潮。"}]}],"synonyms":["feed bin","grain bin","storage bin"],"phonetic":"/ˈoʊtˌbɪn/","extraExplanation":["“oatbin”更常见的写法是两词形式“oat bin”。多用于农场、马厩等语境，属于非常具体的实用词汇。"]}
{"word":"oatcake","summary":{"en":"An oat-based flat cake/biscuit, especially common in Scotland.","zh":"以燕麦为主的扁平饼干/薄饼，尤以苏格兰常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat, usually round cake or biscuit made mainly from oats (often with water or butter), common in Scotland and northern England.","zh":"燕麦饼；以燕麦为主要原料（常加水或黄油）做成的扁平饼干/薄饼，在苏格兰和英格兰北部很常见。"},"examples":[{"en":"In Scotland, oatcakes are often eaten with cheese or soup.","zh":"在苏格兰，燕麦饼常配奶酪或汤一起吃。"},{"en":"She packed a few oatcakes for a quick snack on the hike.","zh":"她带了几块燕麦饼，徒步时当作快速点心。"},{"en":"The recipe makes crisp oatcakes if you bake them a little longer.","zh":"如果烤久一点，这个配方能做出更酥脆的燕麦饼。"}]}],"synonyms":["oat biscuit","oat cracker"],"phonetic":"/ˈoʊtkeɪk/","extraExplanation":["“oatcake”在英式语境里很有地域特色：苏格兰的oatcake多偏咸、较薄、像脆饼（常搭配奶酪、烟熏鱼、汤）；有些英格兰地区（如约克郡）历史上也有更像薄煎饼的燕麦饼版本。","在美式英语里，人们更常说“oatmeal cookie（燕麦曲奇）”或“oat bar（燕麦能量棒）”；“oatcake”一词更容易让人联想到英伦/苏格兰食品。"]}
{"word":"oatcakes","summary":{"en":"Oatcakes are small flat cakes made from oats, commonly eaten in the UK (especially Scotland), often with butter, cheese, or soup.","zh":"Oatcakes 指用燕麦做成的扁平小饼，在英国（尤其苏格兰）常见，常配黄油、奶酪或汤食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, flat cakes (like biscuits) made mainly from oats (oatmeal), often baked on a griddle or in an oven.","zh":"燕麦饼：主要用燕麦（燕麦粉/燕麦片磨成的粉）做成的扁平小饼，常用平底锅烙或烤箱烘烤，口感多为朴实、微脆。"},"examples":[{"en":"For breakfast, she had oatcakes with butter and jam.","zh":"早餐她吃了燕麦饼，配黄油和果酱。"},{"en":"In Scotland, oatcakes are often served with cheese or soup.","zh":"在苏格兰，燕麦饼常常搭配奶酪或汤一起吃。"},{"en":"He packed a few oatcakes for a simple hiking snack.","zh":"他带了几块燕麦饼当作朴素的徒步零食。"}]}],"synonyms":["oat biscuits","oat crackers","oat flatbreads"],"phonetic":"/ˈoʊtˌkeɪks/","extraExplanation":["“oatcakes”是复数形式；单数是“oatcake”。在英式语境里，它常更像偏咸、偏硬的薄脆饼（类似饼干/薄饼），而不一定是甜点。","文化背景：oatcakes在苏格兰和英格兰北部很常见。燕麦耐寒、适合贫瘠土地，因此在历史上是当地重要主食之一；传统上会用烙板（griddle）烙制。","词形提示：oat + cake。这里的“cake”不特指生日蛋糕，而是泛指“饼/糕点”一类的食物。"]}
{"word":"oatear","summary":{"en":"“Oatear” is usually a misspelling of “oat ear,” meaning the seed head (ear) of an oat plant.","zh":"“oatear”通常是 “oat ear” 的拼写错误，意思是燕麦的穗（穗头/结籽的穗状部分）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “oat ear” (the seed head of an oat plant).","zh":"不是标准英语单词；最常见是把 “oat ear”（燕麦的穗/穗状花序、结籽的穗头）拼错了。"},"examples":[{"en":"The farmer checked the oat ears to see if the grain was ready to harvest.","zh":"农夫查看燕麦的穗头，看看谷粒是否到了收割的时候。"},{"en":"In late summer, the oat ears turn golden in the field.","zh":"夏末时，田里的燕麦穗会变成金黄色。"}]}],"synonyms":["seed head","spikelet (more technical)"],"phonetic":"/oʊt ɪr/","extraExplanation":["“oat ear”更自然的写法是两个词：oat ear。它指植物学上的“穗/穗头”（ear），像 wheat ear（麦穗）、corn ear（玉米穗）一样。","如果你其实想查的是 “oater”（/ˈoʊtər/），那是口语里指“吃燕麦的人”或“燕麦饼干”等的非正式说法，但远不如 oat ear 常见。你可以告诉我你看到这个词的句子，我可以帮你确认。"]}
{"word":"oaten","summary":{"en":"Oaten means “made of or containing oats,” and is a somewhat old-fashioned/literary form of “oat-.”","zh":"oaten 指“燕麦制的/含燕麦的”，是较偏文学或较旧的“oat-（燕麦的）”表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made from oats; containing oats (often used for foods like bread, biscuits, or porridge).","zh":"燕麦制的；含燕麦的（常用于面包、饼干、粥等食物）。"},"examples":[{"en":"They served warm oaten bread with butter.","zh":"他们端上了抹黄油的温热燕麦面包。"},{"en":"I like oaten biscuits because they’re filling.","zh":"我喜欢燕麦饼干，因为很顶饱。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A crop of oats; oat plants as a group.","zh":"（较少见）燕麦作物；一片燕麦（统称）。"},"examples":[{"en":"The oaten was cut and stored before the rain came.","zh":"雨来之前，燕麦已经收割并储存好了。"}]}],"synonyms":["oat","oat-based","made with oats"],"phonetic":"/ˈoʊtən/","extraExplanation":["“oaten”是“oat（燕麦）”的传统形容词形式，常见于较文学或较老式的表达（比如诗歌或乡村题材描写）。日常英语里更常说“oat bread / oat cookies / oatmeal”。","在文学与诗歌中，“oaten”有时会带一点田园、质朴的氛围（例如描写“oaten fields”燕麦田），类似中文里“稻香”“麦浪”那种意象。"]}
{"word":"oatenmeal","summary":{"en":"“Oatenmeal” is an uncommon (often older/regional) way to say “oatmeal,” meaning ground oats used for porridge and baking.","zh":"“oatenmeal”是不常见（偏旧或偏地域）的“oatmeal”写法，指磨碎的燕麦，用于煮粥和烘焙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A less common (often older or regional) form of “oatmeal”: a meal/flour made from ground oats, used for porridge, baking, etc.","zh":"“oatmeal（燕麦片/燕麦粉）”的不常见（常见于较旧或地域性）写法：由燕麦磨成的粗粉或粉末，用来煮粥、烘焙等。"},"examples":[{"en":"For breakfast, she cooked oatenmeal into a warm porridge.","zh":"早餐时，她把 oatenmeal 煮成了热燕麦粥。"},{"en":"The recipe calls for oatenmeal, but oatmeal is the same ingredient in modern labels.","zh":"食谱里写的是 oatenmeal，但在现代包装上通常就叫 oatmeal，指的是同一种原料。"}]}],"synonyms":["oatmeal","ground oats"],"phonetic":"/ˈoʊtˌmiːl/","extraExplanation":["“oatenmeal”可以理解为“oaten meal（燕麦的粗粉/粉）”的合写形式；“oaten”是较旧的形容词，意思是“燕麦做的/燕麦的”。在一些苏格兰或较传统的英语语境里，更可能见到类似拼法。","现代英语里最常用、最容易在超市或食谱中看到的写法是“oatmeal”。如果你写作或考试，通常建议用“oatmeal”。"]}
{"word":"oater","summary":{"en":"Oater is a rare noun meaning an oat-eater; informally it can also mean a horse or an old Western movie.","zh":"Oater 是个较少见的名词，常指“吃燕麦的人”；口语里也可指“马”或“老式西部片”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who eats oats, especially habitually (a rare or humorous word).","zh":"吃燕麦的人（较少见/带幽默色彩的说法，指经常吃燕麦的人）。"},"examples":[{"en":"He’s an oater—oatmeal for breakfast every single day.","zh":"他就是个“吃燕麦的人”——每天早餐都吃燕麦粥。"},{"en":"During training season, a lot of runners become proud oat-eaters—real oaters.","zh":"训练季时，很多跑者都会自豪地变成“燕麦党”——真正的 oater。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, old-fashioned) a horse; sometimes used in Western/cowboy talk.","zh":"（非正式/旧式用法）马；有时见于西部片/牛仔语境。"},"examples":[{"en":"He swung into the saddle and urged his oater forward.","zh":"他翻身上马，催着自己的马向前走。"},{"en":"The ranch hands talked about their oat-fed oaters after the long ride.","zh":"长途骑行后，牧场工人聊起他们那些喂燕麦的马。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a Western movie (from the idea of horses eating oats); also called a “horse opera.”","zh":"（非正式）西部片（由“马吃燕麦”的联想而来）；也叫“马戏/马歌剧”式的西部片（horse opera）。"},"examples":[{"en":"They stayed in and watched an old oater on TV.","zh":"他们待在家里看了一部老西部片。"},{"en":"My grandpa loves classic oaters with dusty towns and long rides.","zh":"我爷爷很喜欢那种有尘土小镇和长途骑行的经典西部片。"}]}],"synonyms":["oat-eater","horse (informal sense)","Western (film sense)","horse opera"],"phonetic":"/ˈoʊtər/","extraExplanation":["“oater”来自“oat（燕麦）”。比较常见的说法是“oat-eater”或直接说“someone who eats oats”。","把“oater”用作“马/西部片”的意思偏老派，更多出现在西部题材的口语、小说或影评里；现代日常对话中不算常用。"]}
{"word":"oaters","summary":{"en":"“Oaters” usually means people who grow oats; it can also (rarely) mean oat-eating animals, especially horses.","zh":"“oaters”通常指种植燕麦的人；也可（较少见）指以燕麦为食的动物，尤指马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who grow or harvest oats (oat farmers); plural of “oater.”","zh":"种植或收割燕麦的人（燕麦农）；“oater”的复数。"},"examples":[{"en":"The oaters harvested early this year because the weather turned dry.","zh":"今年天气转干，种燕麦的人更早开始收割。"},{"en":"Local oaters met to discuss grain prices.","zh":"当地的燕麦农聚在一起讨论粮价。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) animals, especially horses, that eat a lot of oats; plural of “oater.”","zh":"（少见）以燕麦为主要饲料的动物，尤指马；“oater”的复数。"},"examples":[{"en":"The stable kept a few strong oaters for long rides.","zh":"马厩里养着几匹吃燕麦长壮的马，用来跑长途。"}]}],"synonyms":["oat farmers","oat growers"],"phonetic":"/ˈoʊtɚ/","extraExplanation":["“oater”在现代英语里不算常用；日常更常说“oat farmer(s)”表示“燕麦农”。","“oats”是不可数/可数都常见的名词：作谷物整体时常用复数形式“oats”（如：a bowl of oats 一碗燕麦）。"]}
{"word":"oatfowl","summary":{"en":"An archaic regional word for a bird found in oat fields, often referring to the corncrake.","zh":"一个古老的地域词，指燕麦田里的野鸟，常用来指秧鸡（corncrake）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, chiefly Scottish/Irish English) A wild bird found in oat fields; often used for birds that feed on oats, especially the corncrake (also called the landrail).","zh":"（古语，主要见于苏格兰/爱尔兰英语）指在燕麦田里出没、以燕麦为食的野鸟；常被用来指田野鸟类，尤指秧鸡（corncrake，也叫 landrail）。"},"examples":[{"en":"In old country writing, you may see “oatfowl” used for a bird calling from the oatfields.","zh":"在一些旧的乡村文字里，你可能会看到用 “oatfowl” 来指在燕麦田里鸣叫的鸟。"},{"en":"The farmer blamed the oatfowl for eating the grain at the field’s edge.","zh":"农夫把田边谷物被吃掉归咎于那些“oatfowl”（田里吃燕麦的野鸟）。"}]}],"synonyms":["corncrake","landrail","field bird"],"phonetic":"/ˈoʊtˌfaʊl/","extraExplanation":["这是一个带有明显地域与年代色彩的词：现代英语里几乎不再常用，更常见的表达是直接说具体鸟名（如 corncrake）或说 “a bird in the oatfields”。","不同地区或不同时期的文本里，oatfowl 可能并不严格指同一种鸟，而是一类“在燕麦田活动的鸟”的泛称；阅读时可结合上下文判断。"]}
{"word":"oath","summary":{"en":"An oath is a very serious promise (often official), and it can also mean a swear word/profanity.","zh":"oath 指“誓言/郑重承诺”（常用于正式场合），也可指“咒骂话/脏话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A serious promise, often made publicly or officially, especially one that calls on God or something sacred to witness it.","zh":"誓言；郑重的承诺（常在公开或正式场合作出，传统上会请神或神圣之物作见证）。"},"examples":[{"en":"The president took the oath of office at the ceremony.","zh":"总统在典礼上宣誓就职。"},{"en":"In court, witnesses must take an oath to tell the truth.","zh":"在法庭上，证人必须宣誓如实作证。"}]},{"partOfSpeech":"n.","definition":{"en":"A strong swear word; profanity used when someone is angry or surprised.","zh":"咒骂话；脏话（表达愤怒或惊讶时说出的粗口）。"},"examples":[{"en":"He let out an oath when he hit his thumb with the hammer.","zh":"他用锤子砸到拇指时骂了一句。"}]}],"synonyms":["vow","pledge","swear","promise","affirmation","profanity"],"phonetic":"/oʊθ/","extraExplanation":["“oath”在正式语境里常与法律/宗教传统有关（如宣誓就职、法庭宣誓）。在现代很多场合也可用“affirmation（郑重声明）”来代替不带宗教色彩的宣誓。","文学与文化中常见搭配：take an oath（宣誓）、break/violate an oath（违背誓言）、oath of office（就职誓言）、oath of allegiance（效忠誓言）。莎士比亚等作品里也常用“oath(s)”来表现人物的郑重承诺或情绪爆发的咒骂。"]}
{"word":"oathay","summary":{"en":"“oathay” is Pig Latin for “oath,” meaning a serious promise or vow.","zh":"“oathay”是“oath（誓言/郑重承诺）”的猪拉丁语形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Pig Latin) “oath”; a formal promise, often spoken seriously or legally.","zh":"（猪拉丁语 Pig Latin）“oath（誓言）”；郑重的承诺，常用于严肃或法律场合。"},"examples":[{"en":"He took an oathay to tell the truth in court.","zh":"他在法庭上发誓要说实话。"},{"en":"That’s an oathay—I won’t share your secret.","zh":"我郑重保证——我不会说出你的秘密。"}]}],"synonyms":["oath","vow","pledge","promise"],"phonetic":"/oʊθeɪ/","extraExplanation":["“oathay”不是标准英语单词，通常是把英语“oath”用 Pig Latin（儿童或玩笑用的“变形英语”）改写出来的形式。常见规则是：以辅音开头的词把开头辅音移到词尾再加 -ay，所以 oath → o + athay（写作 oathay）。在正式写作或考试中不建议使用。"]}
{"word":"oathed","summary":{"en":"“Oathed” is a rare form meaning “swore an oath” or “bound by an oath.”","zh":"“oathed”较少见，意思是“已宣誓/立誓”或“受誓言约束的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “oath”) to make a serious promise by swearing an oath; to pledge formally.","zh":"（“oath”的过去式/过去分词）以宣誓的方式郑重承诺；正式起誓、立誓。"},"examples":[{"en":"The witness oathed to tell the truth before answering any questions.","zh":"证人在回答任何问题前宣誓会说实话。"},{"en":"They had oathed loyalty to the new ruler.","zh":"他们已宣誓效忠新统治者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Bound or obligated by an oath; having sworn a formal promise.","zh":"受誓言约束的；已经起誓承担义务的。"},"examples":[{"en":"An oathed official is expected to act with honesty and fairness.","zh":"宣誓就职的官员应当以诚实与公正行事。"}]}],"synonyms":["sworn","pledged","vowed","took an oath"],"phonetic":"/oʊθt/","extraExplanation":["“oathed”这个动词形式在现代英语里很少见，更常用的是“swore an oath / took an oath / pledged / vowed”。你在法律、宗教或古风/文学语境中更可能见到“oath”作为动词或其过去式“oathed”。","发音提示：因为“oath”以清辅音 /θ/ 结尾，加 -ed 往往读作 /t/（像 watched /t/），所以常见读法接近 /oʊθt/。"]}
{"word":"oathful","summary":{"en":"Oathful means either “sworn/filled with solemn promises” (formal or literary) or “given to swearing/cursing,” depending on context.","zh":"oathful 可指“宣誓的、充满誓言的”（偏正式/文学），也可指“爱爆粗口、常咒骂的”，需结合语境理解。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of oaths; having sworn a serious promise (often used in formal or literary contexts).","zh":"充满誓言的；立过誓、郑重发过誓的（多用于正式或文学语境）。"},"examples":[{"en":"The knight made an oathful vow to protect the village.","zh":"那位骑士立下郑重的誓言，要保护村庄。"},{"en":"Her oathful testimony was taken seriously in court.","zh":"她宣誓后的证词在法庭上被严肃对待。"}]},{"partOfSpeech":"adj.","definition":{"en":"Characterized by frequent swearing (using oaths or strong language).","zh":"爱骂人、常爆粗口的；充斥咒骂的（指语言风格）。"},"examples":[{"en":"He grew less oathful after starting his new job.","zh":"他换了新工作后就没那么爱爆粗口了。"},{"en":"The movie’s dialogue is a bit oathful for younger viewers.","zh":"这部电影的对白对小观众来说有点粗俗、咒骂太多。"}]}],"synonyms":["sworn","solemn","vowed","profane","foul-mouthed"],"phonetic":"/ˈoʊθfəl/","extraExplanation":["“oathful”比较少见，常见在较旧的文学/宗教/法律语境里，强调“带着誓言的、宣誓后的”。日常英语更常用 sworn（宣誓的）、solemn（庄严的）、full of profanity（满口脏话的）。","注意区分：oath 可以指“誓言/宣誓”（a solemn oath），也可以指“咒骂/粗口”（He uttered an oath）。因此 oathful 既可能偏“郑重发誓”，也可能偏“爱骂人”，要看上下文。"]}
{"word":"oathlet","summary":{"en":"Athlete means a person who is trained in sports and competes in physical events.","zh":"athlete 指受过体育训练并参加比赛的“运动员”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is trained in sports and competes in physical events, such as running, swimming, or team games.","zh":"运动员；从事体育训练并参加比赛的人（如跑步、游泳或球类运动）。"},"examples":[{"en":"She is a talented athlete who trains every morning.","zh":"她是一位很有天赋的运动员，每天早上训练。"},{"en":"Many athletes prepare for years to compete in the Olympics.","zh":"许多运动员为参加奥运会准备多年。"}]}],"synonyms":["sportsman","sportswoman","competitor","player"],"phonetic":"/ˈæθliːt/","extraExplanation":["你输入的“oathlet”不是常见英文单词，最可能是把“athlete”拼错了（正确拼写：athlete）。","“athlete”常用于正式和日常语境：既可以指职业运动员，也可以指校队/业余但经常训练并参赛的人。"]}
{"word":"oaths","summary":{"en":"“Oaths” is the plural of “oath,” meaning either solemn promises (often legal or religious) or strong swear words.","zh":"“oaths”是“oath”的复数，可指庄严的誓言（常见于法律/宗教等正式语境），也可指咒骂用语（粗口）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Serious promises, often made publicly or formally, sometimes with religious or legal meaning.","zh":"誓言；郑重的承诺（常在公开或正式场合做出，有时带有宗教或法律意义）。"},"examples":[{"en":"Doctors take oaths to put patients’ well-being first.","zh":"医生会宣誓（立誓）把病人的福祉放在第一位。"},{"en":"In court, witnesses must tell the truth under oath.","zh":"在法庭上，证人必须在宣誓后如实作证。"},{"en":"They exchanged marriage oaths during the ceremony.","zh":"他们在婚礼仪式上互许婚誓。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong swear words used to express anger, surprise, or frustration (less formal; can be offensive).","zh":"咒骂的话；粗口（用于表达愤怒、惊讶或挫败感，较不正式，可能冒犯他人）。"},"examples":[{"en":"He muttered oaths after hitting his thumb with the hammer.","zh":"他用锤子砸到拇指后小声骂了几句。"},{"en":"The book includes characters who speak in oaths and insults.","zh":"这本书里有些人物会用粗口和侮辱性语言说话。"}]}],"synonyms":["pledges","vows","swearing","curses"],"phonetic":"/oʊθs/","extraExplanation":["“oath”常见搭配：take an oath（宣誓）、break an oath（违背誓言）、under oath（宣誓后/在誓言约束下）。","词源上与“swear（发誓）”的正式用法相关；在法律/宗教/职业伦理里更常指“庄严承诺”，而在口语里也可泛指“咒骂”。"]}
{"word":"oathworthy","summary":{"en":"Oathworthy means extremely trustworthy—worthy of being backed by an oath (rare).","zh":"oathworthy 指“值得以誓言担保的、极其可信的”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Deserving to be trusted so strongly that someone could swear an oath about it; highly trustworthy (rare/mostly literary or invented).","zh":"值得以誓言担保的；极其可信的、可靠的（较少见，多为文学用语或自造词）。"},"examples":[{"en":"She wanted an oathworthy promise, not a casual “maybe.”","zh":"她想要的是值得发誓担保的承诺，而不是随口的“也许”。"},{"en":"In the story, the knight is described as oathworthy and loyal.","zh":"在故事里，这位骑士被描写为值得托付誓言、忠诚可靠。"}]}],"synonyms":["trustworthy","reliable","dependable","worthy of trust","true"],"phonetic":"/ˈoʊθˌwɝði/","extraExplanation":["“oathworthy”不是现代英语里的常用词，很多情况下会被视为文学化表达或作者临时造词（nonce word）。更自然、常见的替代说法包括：trustworthy（可信的）、reliable（可靠的）、worthy of trust（值得信任的）、worthy of an oath（值得起誓保证的）。","构词上是“oath（誓言）+ worthy（值得的）”，语感类似“值得用誓言来保证/见证”。常用于强调承诺的分量或人的品格，带一点古风、庄重的色彩。"]}
{"word":"oatland","summary":{"en":"Oatland means land used for growing oats—an oat field or oat-growing area.","zh":"Oatland 指种植燕麦的土地，即燕麦田或燕麦产区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"land where oats are grown; an oat field or oat-growing area.","zh":"种植燕麦的土地；燕麦田；燕麦产区。"},"examples":[{"en":"The farmer rotated the wheat field into oatland to improve the soil.","zh":"农民把小麦地轮作成燕麦田，以改善土壤。"},{"en":"In early summer, the oatland turned a pale green across the valley.","zh":"初夏时，山谷里的燕麦田泛起淡淡的绿色。"}]}],"synonyms":["oat field","field of oats","oat-growing land","farmland"],"phonetic":"/ˈoʊtˌlænd/","extraExplanation":["“oatland”是相对少见的词，更常见的说法是“oat field / field of oats”。在文学或描写乡村景色的语境里，有时会用这种复合词来营造简洁、带画面感的表达。"]}
{"word":"oatlike","summary":{"en":"“Oatlike” means resembling oats, especially in taste, smell, appearance, or texture.","zh":"“oatlike”表示“像燕麦的”，常指味道、气味、外观或口感类似燕麦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling oats in appearance, taste, smell, or texture.","zh":"像燕麦的；在外观、味道、气味或口感上类似燕麦的。"},"examples":[{"en":"This cereal has an oatlike smell and a mild, nutty flavor.","zh":"这款麦片有种燕麦般的香气，味道温和带点坚果味。"},{"en":"The bread has an oatlike texture that feels slightly rough but hearty.","zh":"这面包的口感像燕麦一样，略微粗糙，但很扎实。"}]}],"synonyms":["oaty","oat-flavored","oat-scented","oat-textured"],"phonetic":"/ˈoʊtˌlaɪk/","extraExplanation":["“oatlike”是由“oat（燕麦）+ -like（像……的）”构成的形容词，常用于食品、香味或口感描写，语气偏描述性、非正式，日常写作里也可用“like oats / similar to oats”替换。"]}
{"word":"oatmeal","summary":{"en":"Oatmeal is oats (or a dish made from oats) cooked into a warm breakfast porridge.","zh":"Oatmeal 指燕麦（原料）或煮成的燕麦粥，常作为热早餐食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hot cereal/porridge made by cooking oats in water or milk; also the dry oats used to make it.","zh":"燕麦粥；用水或牛奶煮熟的燕麦热麦片（也可指用来煮粥的干燕麦片）。"},"examples":[{"en":"I usually eat oatmeal with milk and bananas for breakfast.","zh":"我早餐通常吃加牛奶和香蕉的燕麦粥。"},{"en":"This oatmeal is too thick—let’s add a little more water.","zh":"这碗燕麦粥太稠了——加一点水吧。"},{"en":"She bought a big bag of oatmeal to make cookies and breakfast bowls.","zh":"她买了一大袋燕麦片，用来做饼干和早餐碗。"}]}],"synonyms":["porridge","oats","rolled oats"],"phonetic":"/ˈoʊt.miːl/","extraExplanation":["在美式英语里，oatmeal 常指“煮好的燕麦粥”，也常用来指“燕麦片/燕麦碎（原料）”。超市里常见的相关说法有 rolled oats（压片燕麦）、quick oats（快熟燕麦）、steel-cut oats（切割燕麦，口感更有嚼劲）。","文化上，oatmeal 在北美很常见，被认为是健康、方便的早餐；常见搭配有牛奶/酸奶、水果、蜂蜜、花生酱、肉桂等。"]}
{"word":"oatmeals","summary":{"en":"“Oatmeals” is the plural form used for different servings or varieties of oatmeal, though “oatmeal” is usually uncountable.","zh":"“oatmeals”是 oatmeal 的复数，用于指不同份量或不同种类/口味；但 oatmeal 通常作不可数名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of oatmeal; different servings, brands, or kinds of oatmeal (though “oatmeal” is usually uncountable).","zh":"oatmeal（燕麦粥/燕麦片）的复数形式；指不同份量、品牌或种类的燕麦粥/燕麦片（但 oatmeal 通常为不可数名词）。"},"examples":[{"en":"They sell several oatmeals: apple-cinnamon, maple, and plain.","zh":"他们卖好几种燕麦粥/燕麦片：苹果肉桂味、枫糖味和原味。"},{"en":"We packed two oatmeals for breakfast on the trip.","zh":"我们为旅行准备了两份燕麦早餐。"}]}],"synonyms":["oatmeal packets","servings of oatmeal","kinds of oatmeal"],"phonetic":"/ˈoʊtˌmiːlz/","extraExplanation":["在日常英语里，\"oatmeal\"多为不可数名词（例如：I eat oatmeal for breakfast. 我早餐吃燕麦粥）。当你强调“几份/几种/几包”时，口语中可能会看到\"oatmeals\"，尤其是在商品、口味或份量的语境。更常见、更自然的表达也可以是：\"two bowls of oatmeal\"（两碗燕麦粥）、\"two packets of oatmeal\"（两包燕麦片）、\"different kinds of oatmeal\"（不同种类的燕麦）。"]}
{"word":"oats","summary":{"en":"Oats are a cereal grain (and the plant that grows it), commonly eaten as oatmeal or used in baking.","zh":"Oats 指燕麦这种谷物（也可指燕麦植物），常做成燕麦粥/麦片或用于烘焙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cereal grain used as food for people and animals, often eaten as oatmeal/porridge or used in baking.","zh":"燕麦；一种谷物，可供人和动物食用，常做成燕麦粥/麦片或用于烘焙。"},"examples":[{"en":"I usually eat oats with milk and fruit for breakfast.","zh":"我早餐通常吃加牛奶和水果的燕麦。"},{"en":"Rolled oats are popular for making oatmeal cookies.","zh":"压片燕麦很常用来做燕麦饼干。"}]},{"partOfSpeech":"n.","definition":{"en":"The oat plant that produces this grain.","zh":"燕麦植物；结出燕麦这种谷物的作物。"},"examples":[{"en":"Farmers grow oats in cooler climates.","zh":"农民在较凉爽的气候里种植燕麦。"},{"en":"The field of oats turned golden in late summer.","zh":"夏末时，那片燕麦田变成了金黄色。"}]}],"synonyms":["oatmeal (food made from oats)","cereal (general category)"],"phonetic":"/oʊts/","extraExplanation":["在英语里，oats 通常用复数形式（oats）来表示“燕麦（这种食物/谷物）”，即使谈的是整体概念；也可以看到 an oat 表示“一粒燕麦”。","常见搭配：rolled oats（压片燕麦）、steel-cut oats（钢切燕麦/切割燕麦）、oatmeal（燕麦粥/燕麦片）、oat flour（燕麦粉）、oat milk（燕麦奶）。","文化小知识：英语里有说法 feel one’s oats，意思是“精力旺盛、跃跃欲试”，源自马吃了燕麦后更有劲的联想。"]}
{"word":"oatseed","summary":{"en":"Oatseed means the seed (grain) of the oat plant, often used for planting or animal feed.","zh":"Oatseed 指燕麦的种子（谷粒），常用于播种或作为动物饲料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the seed (grain) of an oat plant, used for planting, animal feed, or sometimes food products","zh":"燕麦的种子（谷粒）；可用于播种、饲料，有时也用于食品加工"},"examples":[{"en":"The farmer bought oatseed to plant in early spring.","zh":"农民买了燕麦种子，准备在早春播种。"},{"en":"Oatseed is often mixed into feed for horses and cattle.","zh":"燕麦种子常被混入马和牛的饲料中。"},{"en":"This variety of oatseed grows well in cooler climates.","zh":"这种燕麦种子在较凉爽的气候里长得很好。"}]}],"synonyms":["oat seed","oats (in some contexts)","oat grain"],"phonetic":"/ˈoʊtˌsid/","extraExplanation":["在农业语境里，oatseed常指“用于播种的燕麦种子”，强调品种与发芽率；而在饲料或谷物贸易中，它也可能泛指“燕麦粒（谷粒）”。具体含义通常由上下文决定。"]}
{"word":"oaty","summary":{"en":"“Oaty” means oat-flavored or containing lots of oats, usually describing food.","zh":"“oaty”指“有燕麦味/口感的”或“含有大量燕麦的”，多用于形容食物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the taste, smell, or texture of oats (often used for foods like cookies or bread)","zh":"有燕麦味的；带有燕麦香/口感的（常形容饼干、面包等）"},"examples":[{"en":"These biscuits are really oaty and filling.","zh":"这些饼干燕麦味很浓，而且很顶饱。"},{"en":"I like an oaty flavor in my breakfast bars.","zh":"我喜欢早餐能量棒里那种燕麦的风味。"}]},{"partOfSpeech":"adj.","definition":{"en":"made with or containing a lot of oats","zh":"含有（大量）燕麦的；用燕麦做的"},"examples":[{"en":"She baked an oaty loaf with seeds on top.","zh":"她烤了一个加籽的燕麦面包。"},{"en":"Try an oaty porridge for a warm breakfast.","zh":"想吃热乎的早餐，可以试试燕麦粥。"}]}],"synonyms":["oat-flavored","oat-based","oat-filled","oatty"],"phonetic":"/ˈoʊti/","extraExplanation":["“oaty”在英式英语的食品描述里更常见，常带有“朴实、健康、粗粮感”的联想。","词形上是“oat（燕麦）+ -y”，像“milky（奶香的）”“nutty（坚果味的）”一样，用来表示“带有……特征/味道”。"]}
{"word":"oaves","summary":{"en":"“oaves” isn’t a standard word; it’s usually a misspelling of “loaves” (plural of “loaf,” meaning bread baked in one piece).","zh":"“oaves”不是标准单词；通常是把“loaves”（“loaf”的复数，指一条/一整块面包）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly a misspelling of “loaves,” the plural of “loaf” (a shaped piece of baked bread).","zh":"不是标准英文单词；最常见是把“loaves”（“loaf”的复数，指一条/一个成形的面包）拼错了。"},"examples":[{"en":"Did you mean “loaves”? We bought two loaves of bread.","zh":"你是不是想写“loaves”？我们买了两条面包。"},{"en":"The bakery sells fresh loaves every morning.","zh":"那家面包店每天早上卖新鲜出炉的面包。"}]},{"partOfSpeech":"n.","definition":{"en":"“Loaves”: plural of “loaf,” meaning a shaped mass of bread (and sometimes other foods) baked as one piece.","zh":"“Loaves”： “loaf”的复数，指烤成一整块/一整条的面包（有时也可指其他食物的一整块）。"},"examples":[{"en":"She sliced the loaves and made sandwiches.","zh":"她把面包切片做三明治。"},{"en":"They baked banana bread loaves for the school sale.","zh":"他们烤了几条香蕉面包拿去学校义卖。"}]}],"synonyms":["bread","loaf (singular)"],"phonetic":"/loʊvz/","extraExplanation":["“loaf → loaves”是不规则复数变化：结尾的 -f / -fe 常变成 -ves（如 knife→knives, wolf→wolves），但也有例外（如 roof→roofs 常见）。","“a loaf of bread”在美式英语里非常常用；在超市里通常就是一条切片吐司或一整条面包。"]}
