{"word":"od","summary":{"en":"“OD” most commonly means “overdose,” used as a noun (an overdose) or a verb (to overdose).","zh":"“OD”最常见意思是“overdose（过量）”，既可作名词（一次过量），也可作动词（过量服用/吸食）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “overdose” (taking too much of a drug or medicine, sometimes causing death)","zh":"“overdose（过量用药/吸毒）”的缩写；指服用或摄入药物/毒品过量（有时会致命）"},"examples":[{"en":"The report said the singer died from an OD.","zh":"报告称这位歌手死于药物过量（OD）。"},{"en":"Emergency services responded to a suspected OD.","zh":"急救人员赶到处理一起疑似药物过量（OD）事件。"}]},{"partOfSpeech":"v.","definition":{"en":"to overdose (to take too much of a drug or medicine)","zh":"（药物/毒品）过量；用药/吸毒过量"},"examples":[{"en":"He OD’d on painkillers and had to be taken to the hospital.","zh":"他止痛药服用过量（OD）被送往医院。"},{"en":"Mixing alcohol with pills can make you OD more easily.","zh":"酒精和药片混用会更容易导致过量（OD）。"}]}],"synonyms":["overdose","OD'd (past form)"],"phonetic":"/ˌoʊˈdiː/","extraExplanation":["在英文新闻、医疗记录和社交媒体中常见“OD/OD’d”。写作中更正式的表达是“overdose / overdosed”。","“OD”通常与毒品或处方药滥用相关；若用于玩笑语境（如“that’s OD”表示“太夸张/太过了”）属于俚语，用法因地区而异，可能不适合正式场合。"]}
{"word":"oda","summary":{"en":"ODA most commonly means Official Development Assistance (government aid to developing countries). It can also be a historical agency name or the Japanese surname Oda.","zh":"ODA 最常指“官方发展援助”（政府对发展中国家的援助）。也可指某些历史上的对外发展机构名称，或日本姓氏 Oda（织田）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Official Development Assistance: government aid given to support the economic development and welfare of developing countries (often reported by the OECD).","zh":"官方发展援助：政府为支持发展中国家的经济发展与民生福利而提供的对外援助（常由经合组织 OECD 统计与报告）。"},"examples":[{"en":"The report compares each country’s ODA as a share of national income.","zh":"这份报告比较各国 ODA（官方发展援助）占国民收入的比例。"},{"en":"They increased ODA after the earthquake to fund emergency shelters and clean water.","zh":"地震后他们增加了 ODA，用于资助紧急避难所和清洁饮水。"}]},{"partOfSpeech":"n.","definition":{"en":"A government department name in some contexts (historical/organizational), referring to an overseas development agency (e.g., the UK’s former Overseas Development Administration).","zh":"在某些语境中指政府机构名称（历史/组织用法），例如英国曾使用的“海外发展署/海外发展管理局”（Overseas Development Administration）。"},"examples":[{"en":"In older documents, the project is listed under the ODA rather than today’s agencies.","zh":"在较旧的文件里，这个项目被归在 ODA 名下，而不是今天的相关机构。"}]},{"partOfSpeech":"other","definition":{"en":"A Japanese family name (romanized), seen in history and popular culture.","zh":"日本姓氏的罗马字写法（Oda），常见于历史与流行文化。"},"examples":[{"en":"Oda Nobunaga is a famous figure in Japanese history.","zh":"织田信长（Oda Nobunaga）是日本历史上的著名人物。"},{"en":"Her last name is Oda.","zh":"她的姓是 Oda（织田）。"}]}],"synonyms":["development aid","foreign aid","aid funding"],"phonetic":"/ˌoʊ.diːˈeɪ/","extraExplanation":["在国际发展与新闻报道里，ODA 最常见的意思是 Official Development Assistance（官方发展援助）。它通常指“政府/官方”提供的援助资金或资源，不包括纯商业投资。","如果你看到 Oda 作为人名，常与日本战国时期的“织田”家族相关（例如织田信长）。这种用法不是缩写，而是姓氏的拼写。"]}
{"word":"odacidae","summary":{"en":"Odacidae: the fish family known as knifejaws, mainly in Australian and New Zealand seas.","zh":"Odacidae：刀颌鱼科（knifejaws），主要分布在澳大利亚与新西兰周边海域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine fishes (the knifejaws), found mainly around Australia and New Zealand.","zh":"（鱼类）刀颌鱼科：一类海水鱼，主要分布在澳大利亚和新西兰附近海域。"},"examples":[{"en":"Some reef guides list Odacidae as “knifejaws,” a group common in southern Australian waters.","zh":"一些珊瑚礁图鉴会把刀颌鱼科（Odacidae）标为“knifejaws（刀颌鱼）”，在澳大利亚南部海域很常见。"},{"en":"The scientist compared feeding behavior in wrasses and related families such as Odacidae.","zh":"这位科学家比较了隆头鱼以及相关科（如刀颌鱼科 Odacidae）的取食行为。"}]}],"synonyms":["knifejaws (common name)"],"phonetic":"/oʊˈdeɪsɪdiː/","extraExplanation":["这是一个生物分类学名称（拉丁化学名），在日常英语里很少用，更多出现在科普文章、鱼类图鉴和学术论文中。","常见英文俗名是 knifejaws（刀颌鱼）。不同资料也可能把部分物种归入其他近缘类群；具体分类会随研究更新而调整。"]}
{"word":"odacoid","summary":{"en":"Odacoid means ‘related to or resembling Odacidae (weed whitings)’; it can also rarely mean an odacoid fish.","zh":"Odacoid 指“与裸颌鲷科（Odacidae，海藻鲷）有关或相似的”；少见情况下也可指“裸颌鲷科鱼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Resembling or related to the fish family Odacidae (weed whitings).","zh":"（动物学）类似于或与裸颌鲷科（Odacidae，常称“weed whitings/海藻鲷”）有关的。"},"examples":[{"en":"The guide described the small coastal fish as having odacoid features.","zh":"导览手册把这种小型近海鱼描述为具有“裸颌鲷科式”的特征。"},{"en":"Researchers compared odacoid species with other reef fish to study feeding behavior.","zh":"研究人员将裸颌鲷科相关的物种与其他礁区鱼类比较，以研究取食行为。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology, rare) An odacoid fish; a member of, or fish similar to, the Odacidae.","zh":"（动物学，少见）裸颌鲷科鱼类；指裸颌鲷科成员或与其相似的鱼。"},"examples":[{"en":"Several odacoids were observed grazing among the seaweed beds.","zh":"观察到几条裸颌鲷科鱼在海藻丛中啃食。"}]}],"synonyms":["odacid (related term)","Odacidae-related (descriptive)"],"phonetic":"/oʊˈdeɪkɔɪd/","extraExplanation":["“odacoid”是很专业的生物分类词，多见于鱼类学或学术写作；日常英语里几乎不会用到。","词形上常见的“-oid”表示“……状/类似……”，所以odacoid大致就是“像Odac-这类鱼的”。在实际阅读中，你也可能更常看到“odacid”（裸颌鲷科的）等相关术语。"]}
{"word":"odal","summary":{"en":"“Odal” refers to traditional Scandinavian (especially Norwegian) inherited family land and the right to keep it within the family.","zh":"“Odal”指斯堪的纳维亚（尤指挪威）传统的祖传家族土地，以及让土地优先在家族内部继承与保留的权利。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in Norway/Scandinavia) relating to inherited family land and the traditional legal right to keep it within the family (the “odal/odel” right).","zh":"（尤指挪威/斯堪的纳维亚）与“祖传家产/祖地”及其传统法律权利有关的；指家族土地可依法优先由家族继承并保留在家族内部的（odal/odel 权）。"},"examples":[{"en":"In Norway, some farms are protected by odal rights, so they tend to stay in the same family.","zh":"在挪威，一些农场受到 odal（祖地继承）权的保护，所以往往会留在同一个家族里。"},{"en":"They learned that the land was considered odal property, not something easily sold outside the family.","zh":"他们了解到这块地被视为 odal（祖传）财产，并不容易卖给家族以外的人。"}]},{"partOfSpeech":"n.","definition":{"en":"an inherited family estate or piece of land kept within a family by traditional law (also called an “odal/odel estate”).","zh":"（受传统法律保护的）祖传家产/祖地；依法优先由家族继承并保留在家族内部的土地或产业（也称 odal/odel estate）。"},"examples":[{"en":"The old farm was an odal passed down for generations.","zh":"那座老农场是一处祖传 odal（祖地），世代相传。"},{"en":"Because it was an odal, relatives had priority to reclaim it if it was sold.","zh":"因为它属于 odal（祖地），如果被出售，亲属可能有优先权将其收回。"}]}],"synonyms":["hereditary (land)","ancestral (estate)","family estate","odel (Norwegian spelling)"],"phonetic":"/ˈoʊdəl/","extraExplanation":["“Odal”（挪威常写作 odel）来自古诺尔斯语 *óðal*，与“祖产、世袭土地”有关。在挪威历史上，这类土地常与“保持家族土地不外流”的观念相连；现代法律细节会因国家与时期不同而变化。","在英语里它是比较少见的词，多见于讨论北欧历史、土地制度、家族继承或法律背景的文章中。"]}
{"word":"odalborn","summary":{"en":"“Odalborn” is not standard English; it’s likely a proper name or a misspelling. In rare creative use, it could be interpreted as “born with ancestral land rights.”","zh":"“odalborn”不是标准英语；多半是专名或拼写误写。极少在创作语境中可被理解为“生来拥有祖传土地继承权的人/具有祖产继承权的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (a surname/username) or a misspelling/variant of another word or phrase.","zh":"不是标准英语单词；最常见于专有名词（姓氏/用户名）或是其他单词、短语的拼写误写/变体。"},"examples":[{"en":"I couldn’t find “Odalborn” in a standard dictionary; it may be a family name or a username.","zh":"我在常见词典里找不到“Odalborn”；它可能是姓氏或用户名。"},{"en":"If you meant “natural-born,” you can say: She is a natural-born leader.","zh":"如果你想说的是“natural-born（天生的）”，可以说：She is a natural-born leader.（她是天生的领袖。）"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/interpretive) If formed from “odal/odel” (a Scandinavian term for inherited ancestral land) + “born,” it could mean “born with hereditary land rights,” but this is not established modern English usage.","zh":"（罕见/推测）如果由“odal/odel”（斯堪的纳维亚语境里指祖传世袭土地的概念）+“born”构成，可能被理解为“生来拥有祖产继承权的人/世袭土地权利”，但这并非现代英语中固定、通行的用法。"},"examples":[{"en":"In a fantasy setting, a writer might describe a character as odalborn—heir to ancestral land.","zh":"在奇幻题材里，作者可能用odalborn来形容角色——祖传领地的继承人。"},{"en":"Most readers will understand more easily if you write: born heir to ancestral land.","zh":"大多数读者会更容易理解你写成：born heir to ancestral land（生来就是祖传土地的继承人）。"}]}],"synonyms":["natural-born","noble-born","heir","hereditary"],"phonetic":"/ˈoʊdəlbɔrn/","extraExplanation":["“odal/odel”常见于挪威、瑞典等北欧历史文化中，指一种与“祖传土地/家族土地”相关的权利与身份（类似“祖产/世袭田产”的概念），在英语里通常会以解释性表达出现，而不是直接造一个合成词。","如果你能告诉我你看到“odalborn”的句子或来源（游戏/小说/姓氏/地名），我可以更准确判断它是专名还是想表达“natural-born / noble-born / heir-born”等哪一种意思。"]}
{"word":"odalisk","summary":{"en":"An odalisk (more commonly: odalisque) is a woman servant/slave in an Ottoman harem, often depicted in Western art as a concubine.","zh":"odalisk（更常见拼写为 odalisque）指奥斯曼后宫中的女侍或女奴；在西方艺术中常被描绘成妾或情人形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female slave or servant in a Turkish/Ottoman harem, often imagined (especially in Western writing and art) as a concubine","zh":"（奥斯曼/土耳其后宫中的）女奴或女仆；在西方文学与艺术中常被想象为妾或性伴侣"},"examples":[{"en":"In the novel, the odalisk is described as a young servant in the palace household.","zh":"在小说里，这位 odalisk 被描写为宫廷中的年轻侍女。"},{"en":"Many 19th‑century European painters portrayed an odalisk reclining in an exotic interior.","zh":"许多19世纪欧洲画家描绘了一个 odalisk 斜躺在充满“异域风情”的室内场景中。"},{"en":"The museum label notes that the figure is an odalisk, a term linked to Ottoman court life.","zh":"博物馆说明牌指出画中人物是 odalisk，这个词与奥斯曼宫廷生活有关。"}]}],"synonyms":["odalisque","harem girl (dated)","concubine (sometimes, but not exact)"],"phonetic":"/ˈoʊdəˌlɪsk/","extraExplanation":["“odalisk”是“odalisque”的较少见拼写；英语里更常用的是 odalisque。","这个词常出现在西方“东方主义”（Orientalism）语境的绘画与文学中，形象往往被浪漫化或性化；在阅读或写作时可留意其历史与文化偏见。","词源来自土耳其语 odalık（与“房间/寝室”相关），原义更接近“宫内侍女/房内女仆”，并不必然等同于“妾”。"]}
{"word":"odalisks","summary":{"en":"Odalisks are women servants/slaves in an Ottoman harem, and the word is also used in Western art for a romanticized harem woman figure.","zh":"odalisks 指（历史上）奥斯曼后宫中的女仆/女奴；也可指西方艺术中被浪漫化描绘的“后宫女子”形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman servant or slave in a Turkish/Ottoman household or harem (especially in older historical writing).","zh":"（历史用语）奥斯曼/土耳其家庭或后宫（harem）中的女仆或女奴（常见于旧式叙述）。"},"examples":[{"en":"In some historical accounts, odalisks served the women of the palace.","zh":"在一些历史记载中，odalisks 为宫廷中的女性服务。"},{"en":"The novel describes the daily life of an odalisque in the Ottoman court.","zh":"这部小说描写了一位奥斯曼宫廷女侍的日常生活。"}]},{"partOfSpeech":"n.","definition":{"en":"In Western art and literature, a (often romanticized) depiction of a harem woman, frequently shown reclining.","zh":"（西方艺术/文学中）对后宫女子的（常带浪漫化/异域化色彩的）形象描绘，常被画成斜倚卧姿。"},"examples":[{"en":"The painting shows an odalisque reclining on cushions.","zh":"这幅画描绘了一位斜倚在垫子上的“odalisque”。"},{"en":"Museums sometimes label such works as “odalisque,” reflecting 19th-century taste for exotic themes.","zh":"博物馆有时会把这类作品标注为“odalisque”，反映了19世纪对异域主题的偏好。"}]}],"synonyms":["harem attendant","female servant (historical)","concubine (context-dependent)"],"phonetic":"/ˈoʊdəˌlɪsk/","extraExplanation":["“odalisks”是复数形式；单数是“odalisque”。在现代英语里，这个词多用于历史语境或艺术史语境，日常交流中很少用。","该词常与19世纪欧洲“东方主义”（Orientalism）艺术相关：一些作品把奥斯曼后宫女性形象理想化、性化或异域化。学术写作中可能会提醒读者注意这种视角的偏差。"]}
{"word":"odalisque","summary":{"en":"An odalisque is (1) a female attendant/slave in an Ottoman harem, or (2) a Western-art term for a reclining nude figure in an “Orientalist” style.","zh":"odalisque 指（1）奥斯曼后宫中的女侍从/女奴；也可指（2）西方艺术里以东方主义方式呈现的斜卧裸女形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female slave or attendant in a Turkish/Ottoman harem, often serving a high-status household.","zh":"（奥斯曼/土耳其宫廷）后宫中的女奴或女侍从，常在权贵家庭中侍奉。"},"examples":[{"en":"In the novel, the odalisque dreams of freedom beyond the palace walls.","zh":"在小说里，那位后宫女侍从梦想着宫墙之外的自由。"},{"en":"The historian explains that an odalisque’s status could vary widely within the household.","zh":"历史学家解释说，后宫女侍从在家族中的地位可能差异很大。"}]},{"partOfSpeech":"n.","definition":{"en":"In Western art, a reclining nude female figure presented in an “Orientalist” style (a European imaginative view of the Middle East).","zh":"（西方艺术中）以“东方主义”风格描绘的斜卧裸女形象（带有欧洲对中东的想象性视角）。"},"examples":[{"en":"The museum label describes the painting as an odalisque, typical of 19th‑century Orientalist art.","zh":"博物馆说明牌把这幅画描述为“后宫裸女”题材，是19世纪东方主义艺术的典型例子。"},{"en":"Some viewers critique the odalisque image for romanticizing and stereotyping other cultures.","zh":"一些观众批评这种“后宫裸女”形象在浪漫化并刻板化他者文化。"}]}],"synonyms":["harem attendant","concubine (context-dependent)","Orientalist nude (art context)"],"phonetic":"/oʊˈdælɪsk/","extraExplanation":["该词来自法语 *odalisque*，进一步源于土耳其语 *odalık*（与“房间/内室”相关），原义更接近“内室女侍”。在英语里常因19世纪欧洲绘画与文学而带有强烈的“异域情调”联想。","艺术语境中常提到安格尔（Ingres）的作品如《大宫女》（*La Grande Odalisque*）。这类“东方主义”图像在今天的讨论里，常被放在权力关系与凝视（谁在观看、如何观看）的文化背景下重新审视。"]}
{"word":"odaller","summary":{"en":"“odaller” is not a standard English word; it’s likely a misspelling or a name.","zh":"“odaller”不是标准英语单词；很可能是拼写错误或人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username.","zh":"不是标准英语单词，可能是拼写错误，或是人名/用户名。"},"examples":[{"en":"I couldn’t find “odaller” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“odaller”——你是不是想写另一个词？"},{"en":"If you tell me the sentence you saw it in, I can help you identify the correct word.","zh":"如果你把它出现的句子发给我，我可以帮你判断到底是哪一个词。"}]}],"phonetic":"/oʊˈdælɚ/","extraExplanation":["你可能想写的是以下之一（请结合上下文确认）：\n- **odour / odor**（气味）\n- **toddler**（学步幼儿）\n- **older**（更老的/年纪更大的）\n- **odalisque**（旧时“女奴/侍女”，文学或艺术语境更常见）\n把原句或你想表达的中文意思发我，我可以给出最准确的词、发音和用法。"]}
{"word":"odalman","summary":{"en":"“Odalman” is not a common English word; it’s likely a name or a misspelling (often of “ottoman”).","zh":"“odalman”不是常见英语词，通常是人名/姓氏或误拼（常见为“ottoman”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a surname or a misspelling/variant in user text. If you saw it in a specific sentence, the meaning may depend on that context (for example, a person’s name).","zh":"不是标准英语词；最常见于姓氏或网络文本中的拼写变体/误拼。如果出现在具体句子里，含义通常取决于语境（例如人名）。"},"examples":[{"en":"I couldn’t find a dictionary definition for “odalman,” but it may be a family name.","zh":"我在词典里找不到“odalman”的释义，但它可能是一个姓氏。"},{"en":"Can you share the sentence where you saw “odalman”?","zh":"你能把看到“odalman”的那句话发出来吗？"}]},{"partOfSpeech":"other","definition":{"en":"Possible misspelling of “Ottoman” (a piece of furniture you rest your feet on, or relating to the Ottoman Empire).","zh":"可能是“Ottoman”的误拼（指脚凳/软凳；或与奥斯曼帝国有关的）。"},"examples":[{"en":"I put my feet up on the ottoman after work.","zh":"下班后我把脚搁在脚凳上。"},{"en":"She’s studying the history of the Ottoman Empire.","zh":"她在学习奥斯曼帝国的历史。"}]}],"synonyms":["Ottoman (if that’s what you meant)"],"phonetic":"/ˈoʊdælmən/","extraExplanation":["“odalman”本身不常见，主流英语词典通常不会收录。最可能的情况是：①人名/姓氏；②误拼（常见候选是 Ottoman）。如果你能提供出处（句子、书名或截图），我可以更准确判断它到底指什么。"]}
{"word":"odalwoman","summary":{"en":"A rare historical word for a woman who owns or inherits odal (hereditary Norse) land.","zh":"一个罕见的历史词，指拥有或继承奥达尔（土地世袭的北欧传统）土地的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, historical) A woman who owns or inherits “odal” land—land held as a hereditary family property under old Norse/Scandinavian law (especially in Orkney and Shetland).","zh":"（罕见，历史用语）“奥达尔土地”（odal land）的女性拥有者或继承人——指在古北欧/斯堪的纳维亚法律传统下，作为家族世袭财产持有的土地（尤指苏格兰的奥克尼与设得兰群岛）。"},"examples":[{"en":"In local records, an odalwoman could defend her family’s claim to inherited land.","zh":"在一些地方档案中，奥达尔土地的女性持有人可以为家族的世袭土地权利进行辩护。"},{"en":"The novel mentions an odalwoman who refuses to sell her ancestral fields.","zh":"小说里提到一位奥达尔土地女主人拒绝出售祖传田地。"}]}],"synonyms":["female odal heir","odal landowner","odal owner"],"phonetic":"/ˈoʊdəlˌwʊmən/","extraExplanation":["“odal / odal law”与北欧维京时代的土地制度有关，核心是“家族世袭的自由土地”观念；在奥克尼与设得兰，这类习惯法传统曾长期影响土地继承与产权纠纷。","拼写提示：英语里更常见的是“odal”作形容词（如 odal rights / odal land），“odalwoman”属于非常少见的合成词，很多词典未必收录。"]}
{"word":"odax","summary":{"en":"“odax” is usually a name or acronym rather than a dictionary word; meaning depends on context.","zh":"“odax”通常是名称或缩写，并非词典单词；含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly seen as a proper name, brand name, username, or an acronym. Its exact meaning depends on where you saw it.","zh":"不是标准英语单词；更常见于专有名词（品牌名、用户名、项目名）或缩写。具体含义取决于出现的语境。"},"examples":[{"en":"I couldn’t find a dictionary meaning for “odax,” so it may be a brand or a username.","zh":"我查不到“odax”的词典义，所以它可能是品牌名或用户名。"},{"en":"In this document, ODAX is used as a project code name.","zh":"在这份文件里，ODAX被用作项目代号。"}]}],"phonetic":"/ˈoʊdæks/","extraExplanation":["“Odax”在主流英语词典中通常没有收录。如果你告诉我它出现在哪（例如一句话、网页、软件、游戏、公司名、国家/语言环境），我可以更准确判断它是缩写、专有名词，还是拼写错误。","它也可能是你想查的词的误拼；常见需要核对的相近拼写包括：“Odesa/Odessa（地名）”、“DAX（指数名）”、“Orax（品牌/名词）”等。"]}
{"word":"odd","summary":{"en":"Odd most commonly means “strange/unusual,” and it can also mean “odd number” (not divisible by 2) or “occasional/extra” (as in odd jobs).","zh":"odd 最常见意思是“奇怪/不寻常”，也可指“奇数”（不能被2整除）或“零散/偶尔的”（如 odd jobs 零工）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strange or unusual; different from what is expected or normal.","zh":"奇怪的；不寻常的；与预期或常态不同的。"},"examples":[{"en":"There’s something odd about the way he avoided the question.","zh":"他回避问题的方式有点奇怪。"},{"en":"It’s odd to see snow in April.","zh":"四月下雪很反常（很少见）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not divisible by 2; 1, 3, 5, etc.","zh":"奇数的；不能被2整除的（如1、3、5等）。"},"examples":[{"en":"Seven is an odd number.","zh":"七是奇数。"},{"en":"Choose an odd number of players so teams aren’t tied.","zh":"选奇数个玩家，这样队伍不会打平（或不容易出现平局）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Different or separate from the main group; occasional or extra.","zh":"零散的；单独的；偶尔的（非主要部分的）。"},"examples":[{"en":"I do odd jobs on weekends to earn extra money.","zh":"我周末做些零工来赚外快。"}]},{"partOfSpeech":"n.","definition":{"en":"A single item left over or unmatched (often used in the phrase “an odd one out”).","zh":"剩下的单个；不成对的；不匹配的一个（常见于短语“odd one out”）。"},"examples":[{"en":"This sock is an odd one—I can’t find its pair.","zh":"这只袜子是落单的——我找不到另一只。"}]}],"synonyms":["strange","unusual","peculiar","bizarre","uncommon"],"phonetic":"/ɑd/","extraExplanation":["“odd”表示“奇怪”时，语气通常比“weird”更温和、更日常；“weird”更强烈，带一点让人不舒服或难以解释的感觉。","常见搭配：odd behavior（奇怪的行为），odd smell（怪味），odd hours（不规律/奇怪的工作时间），odd jobs（零工）。","文学与常见表达里，“the odd…”常表示“偶尔的/零星的”：the odd mistake（偶尔的错误）、the odd visitor（偶尔来的访客）。"]}
{"word":"odda","summary":{"en":"“odda” is a nonstandard dialect spelling that usually means “other,” and it’s also often a mistaken form of “odd.”","zh":"“odda”多为方言式的非标准拼写，通常表示“other（另一个）”，也常是把“odd（奇怪的）”写错/听错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard, dialect) A spoken or informal spelling of “other,” especially reflecting some Scottish/Irish/English regional accents.","zh":"（非标准、方言）“other”的口语/随意拼写形式，常用来模仿某些苏格兰、爱尔兰或英格兰地区口音。"},"examples":[{"en":"Can you pass me the odda one?","zh":"你能把另一个递给我吗？"},{"en":"One book is mine, and the odda belongs to my sister.","zh":"一本书是我的，另一本是我妹妹的。"}]},{"partOfSpeech":"other","definition":{"en":"(Common learner issue) Often a typo or mishearing of “odd” (strange; not regular).","zh":"（常见学习者情况）也常是把“odd”（奇怪的；不规律的）打错或听错成“odda”。"},"examples":[{"en":"That’s an odd idea. (Not “odda.”)","zh":"那是个奇怪的想法。（不是“odda”。）"},{"en":"I felt odd after the long flight.","zh":"长途飞行后我感觉不太对劲/怪怪的。"}]}],"synonyms":["other (standard)","another (depending on context)"],"phonetic":"/ˈɑdə/","extraExplanation":["“odda”通常不被视为标准英文单词，更像是为了表现口音而写出来的拼法；在正式写作或考试中建议用标准拼写“other”。","如果你本来想查的是“odd”，它是常用形容词，意思是“奇怪的；（数字）奇数的；不成对的”。你也可以告诉我你的句子，我帮你判断应该用哪个词。"]}
{"word":"oddball","summary":{"en":"“Oddball” means an unusual person (often quirky) or something that is strange and not typical.","zh":"“oddball”指古怪、与众不同的人，也可形容事物不寻常、奇怪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who seems different from most others, often in a quirky or unusual way.","zh":"与大多数人不一样的人；常指古怪、与众不同的人。"},"examples":[{"en":"He’s a bit of an oddball, but everyone likes him.","zh":"他有点古怪，但大家都喜欢他。"},{"en":"In every class, there’s usually one oddball who asks surprising questions.","zh":"在每个班里，通常都会有一个“怪咖”会问出让人意外的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Unusual or strange; not typical.","zh":"不寻常的；奇怪的；不典型的。"},"examples":[{"en":"That’s an oddball idea, but it might work.","zh":"这个想法挺奇特的，但可能行得通。"},{"en":"We had an oddball schedule this week because of the holiday.","zh":"因为放假，这周我们的时间安排有点不寻常。"}]}],"synonyms":["eccentric","weirdo","misfit","quirky","unusual"],"phonetic":"/ˈɑdˌbɔl/","extraExplanation":["“oddball”语气通常比较口语化，既可以是轻松、带点亲切的称呼（类似“怪可爱的人/怪咖”），也可能带一点负面评价，取决于语境和说话人态度。","词源上可理解为“odd（奇怪的）+ ball（球）”，原意有“怪球/不按常理弹跳的球”的联想，后来引申为“与众不同的人或事”。"]}
{"word":"oddballs","summary":{"en":"Oddballs are people (or things) that seem unusual or don’t fit the usual group.","zh":"oddballs 指看起来古怪、与众不同或不合群的人（或事物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who seems unusual, quirky, or different from most people (often informal; can be teasing or affectionate)","zh":"怪人；古怪的人（口语；可带调侃，也可能带一点亲昵）"},"examples":[{"en":"He’s a bit of an oddball, but he’s really kind.","zh":"他有点怪，但人真的很善良。"},{"en":"Our class had a few oddballs who made everyone laugh.","zh":"我们班有几个“怪咖”，总能把大家逗笑。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something that does not fit the usual pattern or group; an outlier","zh":"不合群的人或事物；异类；离群值"},"examples":[{"en":"Most of the results were similar, but one oddball number stood out.","zh":"大多数结果都很相似，但有一个异常数字特别显眼。"},{"en":"The oddball idea ended up being the best solution.","zh":"那个看似离谱的点子最后反而成了最佳方案。"}]}],"synonyms":["weirdo","eccentric","quirk","misfit","outlier"],"phonetic":"/ˈɑdˌbɔl/","extraExplanation":["“oddball”是非正式用语，语气取决于语境：朋友间可表示“有趣的怪咖”，但在不熟或带偏见的语境里也可能显得不礼貌。","词源上是“odd（奇怪的）+ ball（球）”。在口语里常用来形容“与众不同、难以归类的人/事”。"]}
{"word":"odder","summary":{"en":"“Odder” means “more odd”: more strange or unusual.","zh":"“odder”表示“更奇怪/更不寻常”，是“odd”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"comparative form of “odd”; more strange, unusual, or unexpected","zh":"“odd”的比较级；更奇怪的、更不寻常的、更加出乎意料的"},"examples":[{"en":"The weather has been odder than usual this week.","zh":"这周的天气比平常更反常。"},{"en":"It gets odder the more I think about it.","zh":"我越想越觉得更奇怪。"},{"en":"That’s the odder part of the story—no one remembers what happened next.","zh":"故事里更奇怪的是——没有人记得接下来发生了什么。"}]}],"synonyms":["stranger","weirder","more unusual","more peculiar"],"phonetic":"/ˈɑdɚ/","extraExplanation":["“odder”是形容词“odd”的比较级，常用于“odder than …（比……更奇怪）”或“the odder part（更奇怪的部分）”。最高级是“oddest”。","口语中常见表达：“It gets odder and odder.” 意思是“越来越奇怪”。"]}
{"word":"oddest","summary":{"en":"Oddest means “the most strange or unusual.”","zh":"oddest 表示“最奇怪的、最不寻常的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most strange or unusual; the superlative form of “odd.”","zh":"最奇怪的；最不寻常的（“odd”的最高级）。"},"examples":[{"en":"That was the oddest question I’ve ever been asked in an interview.","zh":"那是我在面试中被问过的最奇怪的问题。"},{"en":"We heard the oddest noise coming from the attic.","zh":"我们听到阁楼里传来最古怪的声音。"},{"en":"It’s the oddest thing, but I keep running into the same person everywhere.","zh":"这事真是最奇怪不过了，我到处都遇到同一个人。"}]}],"synonyms":["strangest","weirdest","most unusual","most peculiar"],"phonetic":"/ˈɑdɪst/","extraExplanation":["“oddest”通常用来表示“在一群事物里最奇怪/最不符合常理的那个”。口语里常见固定说法：It’s the oddest thing…（真是怪事……），用来引出令人费解的情况。","注意“odd”还有“奇数”的意思（odd numbers），但“oddest”在这个数学含义下不常用；更常用的是“odd numbers / the odd-numbered pages”等表达。"]}
{"word":"oddfellow","summary":{"en":"An oddfellow is either an unusual person or a member of the Odd Fellows fraternal organization.","zh":"oddfellow 既可指“古怪的人”，也可指“奇异会（Odd Fellows）”等兄弟会组织的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who seems unusual, eccentric, or different from others","zh":"怪人；古怪的人；与众不同的人"},"examples":[{"en":"He’s a bit of an oddfellow, but he’s kind and reliable.","zh":"他有点古怪，但很善良也很可靠。"},{"en":"The story begins with an oddfellow who lives alone at the edge of town.","zh":"故事从一个独居在城镇边缘的怪人开始。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Odd Fellows, a fraternal organization (often written as “Odd Fellow” or “Oddfellow”)","zh":"“奇异会”（Odd Fellows）等兄弟会组织的成员（常写作 Odd Fellow / Oddfellow）"},"examples":[{"en":"Her great-grandfather was an Oddfellow and attended lodge meetings regularly.","zh":"她的曾祖父是奇异会的会员，经常参加会所聚会。"},{"en":"The old building downtown used to be an Odd Fellows hall.","zh":"市中心那栋老楼以前是奇异会的会馆。"}]}],"synonyms":["eccentric","oddball","character","weirdo","Odd Fellow"],"phonetic":"/ˈɑdˌfɛloʊ/","extraExplanation":["“Odd Fellows”（常见全名为 Independent Order of Odd Fellows, IOOF）是英语世界里历史较久的互助性质兄弟会组织，19世纪在英美等地影响较大，常见遗迹包括“Odd Fellows Hall”（会馆/会所）等建筑名。","作为普通名词时，oddfellow 带有轻微文学或旧式语感，现代口语更常说 “an odd guy/person” 或 “a weirdo”（后者语气更不礼貌）。"]}
{"word":"oddish","summary":{"en":"Oddish is the name of a radish-like Pokémon (a fictional creature) from the Pokémon series.","zh":"Oddish 是宝可梦系列中一种像萝卜的小型宝可梦（虚构生物）的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, blue, radish-like Pokémon (a fictional creature from the Pokémon series) that is typically classified as a Grass/Poison type.","zh":"走路草（Oddish）：宝可梦系列中的虚构生物，小型蓝色、像萝卜的宝可梦，常见属性为草/毒。"},"examples":[{"en":"Oddish evolves into Gloom at level 21.","zh":"走路草在 21 级会进化成臭臭花。"},{"en":"I caught an Oddish in the grassy area near the town.","zh":"我在城镇附近的草地里抓到了一只走路草。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension, informal) an Oddish character or image in games, fan art, or merchandise.","zh":"（引申，非正式）指游戏、同人作品或周边里的“走路草”形象/角色。"},"examples":[{"en":"She has an Oddish keychain on her backpack.","zh":"她的背包上挂着一个走路草钥匙扣。"},{"en":"That Oddish sticker is adorable.","zh":"那张走路草贴纸好可爱。"}]}],"synonyms":["Pokémon (general term)"],"phonetic":"/ˈɑdɪʃ/","extraExplanation":["“Oddish”是宝可梦（Pokémon）中的英文名，属于专有名词；在普通英语里不是常用词。","词源上常被认为结合了“odd（奇怪的）”与“radish（萝卜）”的感觉，用来突出它“奇怪又像萝卜的植物生物”这一设定。","在翻译上，中文常见译名为“走路草”，与其“会到处走动的植物”形象有关；不同地区或作品可能出现略有差异的译名。"]}
{"word":"oddities","summary":{"en":"“Oddities” means strange or unusual things, details, or behaviors; it is the plural of “oddity.”","zh":"“oddities”指奇怪、不寻常的事物/细节或古怪的行为习惯；是“oddity”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that are strange, unusual, or surprising; uncommon details or features.","zh":"怪异之处；奇特的事物（或细节）；不寻常之处。"},"examples":[{"en":"The museum displays oddities from around the world, like shrunken heads and strange tools.","zh":"这家博物馆展出来自世界各地的奇物，比如缩小的人头和奇怪的工具。"},{"en":"I noticed a few oddities in the report, so I checked the numbers again.","zh":"我在报告里发现了一些不寻常的地方，所以又把数据核对了一遍。"}]},{"partOfSpeech":"n.","definition":{"en":"Unusual behavior or habits (often mildly humorous or critical).","zh":"（常带调侃或批评的）古怪的行为或习惯。"},"examples":[{"en":"Everyone has their oddities, like talking to plants or arranging books by color.","zh":"每个人都有些小怪癖，比如对植物说话，或按颜色摆书。"},{"en":"His oddities made him memorable, but he was always kind.","zh":"他的古怪让人印象深刻，但他一直很善良。"}]}],"synonyms":["quirks","peculiarities","curiosities","strangenesses","anomalies"],"phonetic":"/ˈɑdətiz/","extraExplanation":["“oddities”是名词复数，单数是“oddity”。在口语里也常用“quirks”表示“（可爱的）小怪癖”，语气通常比“oddities”更轻松。","在文化语境中，“oddities”也常出现在“curiosities and oddities（奇珍异物）”这类搭配里，常指收藏、展览中的稀奇古怪之物。"]}
{"word":"oddity","summary":{"en":"An oddity is something unusually strange or out of place, or a curious detail that stands out.","zh":"oddity 指“不寻常、显得格格不入的事物/人”，也可指“奇怪之处、怪细节”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something unusual, strange, or unexpected; a thing (or person) that stands out as different.","zh":"怪事；奇特之处；不寻常的人或物。"},"examples":[{"en":"The old clock is an oddity in this modern apartment.","zh":"这间现代公寓里，那座老钟显得很突兀，是个怪东西。"},{"en":"One oddity of the plan is that it doesn’t include any budget details.","zh":"这个计划有个奇怪之处：它完全没有预算细节。"},{"en":"He became known as an oddity in the neighborhood because he collected broken umbrellas.","zh":"他因为收集坏雨伞而在邻里间成了个“怪人”。"}]},{"partOfSpeech":"n.","definition":{"en":"A curious feature or small detail that seems out of place; a quirk.","zh":"怪癖；古怪的细节（让人觉得不太对劲的小特点）。"},"examples":[{"en":"A charming oddity of the building is the tiny door under the stairs.","zh":"这栋楼一个可爱的怪细节是楼梯下那扇小门。"},{"en":"It’s an oddity of English spelling that many letters aren’t pronounced.","zh":"英语拼写有个怪现象：很多字母不发音。"}]}],"synonyms":["peculiarity","curiosity","quirk","anomaly","strangeness"],"phonetic":"/ˈɑːdəti/","extraExplanation":["“oddity”常带中性到轻微好笑的语气，比“freak”更礼貌、攻击性更弱。形容“奇怪的地方”时，常用结构：an oddity of + 名词（an oddity of the system）。","词源来自“odd”（奇怪的；不成对的）+“-ity”（名词后缀）。在英美文化语境里，它也常用于博物馆、收藏、展览中指“奇珍异物/稀奇物件”（oddities collection）。"]}
{"word":"oddlegs","summary":{"en":"“odd legs” usually means legs that are unusual or mismatched; in fashion talk, it can mean mismatched pant legs.","zh":"“odd legs”通常指不寻常或不协调的腿；在穿搭语境中也可指不匹配的裤腿。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Literal) legs that look unusual, mismatched, or different from what is expected (in shape, length, movement, etc.).","zh":"（字面义）看起来不寻常、不协调或与常见情况不同的腿（如形状、长短、动作等方面）。"},"examples":[{"en":"The chair wobbles because it has odd legs—one is shorter than the others.","zh":"这把椅子会晃，因为它的腿不太对劲——有一条比其他的短。"},{"en":"In the cartoon, the monster’s odd legs make it walk in a funny way.","zh":"在动画片里，怪物奇怪的腿让它走路的样子很好笑。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Informal, context-based) pant legs that don’t match (for example, different colors or patterns), used when talking about fashion or styling.","zh":"（非正式，依语境）不成对/不匹配的裤腿（如颜色或图案不同），用于谈论穿搭或造型。"},"examples":[{"en":"Her outfit looked intentional: odd legs on the pants, but the same shoes.","zh":"她的穿搭像是刻意的：裤腿不一样，但鞋子是同一双。"},{"en":"The designer played with odd legs to create a bold, asymmetrical look.","zh":"设计师用不对称的“奇怪裤腿”来做出大胆的视觉效果。"}]}],"synonyms":["unusual legs","mismatched legs","uneven legs","asymmetrical legs"],"phonetic":"/ɑd lɛɡz/","extraExplanation":["“oddlegs”并不是常见的标准英语单词；更自然的写法通常是分开写成“odd legs”。如果你是在游戏ID、品牌名或网名里看到“oddlegs”，它更可能是创意拼写（stylized spelling），意思需要结合具体上下文。"]}
{"word":"oddly","summary":{"en":"Oddly means “in a strange or unexpected way,” and it can also mean “in a slightly awkward or not-quite-right way.”","zh":"Oddly 表示“奇怪地/出乎意料地”，也可表示“有点别扭或不太对劲地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a strange or unusual way; not as you would expect.","zh":"以奇怪或不寻常的方式；出乎意料地。"},"examples":[{"en":"Oddly, he stayed calm during the emergency.","zh":"奇怪的是，他在紧急情况中反而很冷静。"},{"en":"The room was oddly quiet for a Friday night.","zh":"这个房间在周五晚上安静得有点反常。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a slightly awkward, off, or not quite right way (often used to describe feelings, behavior, or situations).","zh":"有点别扭地；不太对劲地（常形容感觉、行为或情况）。"},"examples":[{"en":"I felt oddly guilty, even though I hadn’t done anything wrong.","zh":"我莫名其妙地有点内疚，虽然我并没有做错什么。"},{"en":"She smiled oddly, as if she knew a secret.","zh":"她笑得有点怪，像是知道什么秘密。"}]}],"synonyms":["strangely","unusually","curiously","peculiarly"],"phonetic":"/ˈɑdli/","extraExplanation":["“oddly”来自形容词“odd”（奇怪的/异常的）加副词后缀“-ly”。常见搭配有：oddly enough（说来也怪/有意思的是）、oddly shaped（形状奇特地）、oddly quiet（反常地安静）。","语气上，“oddly”通常偏中性：强调“出乎意料/不符合常态”，不一定是负面。需要表达更强烈的“怪异/令人不安”，可考虑用“creepily”“eerily”。"]}
{"word":"oddman","summary":{"en":"“Odd man” usually refers to the person who doesn’t fit in (often said as “odd man out”) or the extra person left over when forming equal groups.","zh":"“odd man”通常指“不合群的人”（更常说“odd man out”）或“分组时多出来的那个人”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the person who is different from the rest of a group and often does not fit in","zh":"（群体中）与他人不同、格格不入的人"},"examples":[{"en":"At the party, he felt like the odd man because he didn’t know anyone.","zh":"在派对上，他觉得自己像个“异类”，因为他一个人都不认识。"},{"en":"In a team of experienced workers, the new intern was the odd man out.","zh":"在一支经验丰富的团队里，新来的实习生成了“格格不入的那一个”。"}]},{"partOfSpeech":"phrase","definition":{"en":"an extra person left over when people are being divided into equal groups (often in games or activities)","zh":"（分组时）多出来的那个人（常见于游戏或活动分组）"},"examples":[{"en":"We needed teams of three, so I ended up as the odd man.","zh":"我们需要三人一组，所以我最后成了多出来的那个人。"},{"en":"If there’s an odd man, we can rotate players each round.","zh":"如果有人落单，我们可以每一轮轮换上场。"}]}],"synonyms":["odd man out","outsider","misfit","the extra person","the odd one out"],"phonetic":"/ˌɑd ˈmæn/","extraExplanation":["“odd man”在口语里常被更完整的说法“odd man out”替代，意思是“与众不同/不合群的那个人”。在分组语境里，它更字面化，指“多出来的一个人”。","注意语气：说别人是“odd man out”可能显得不太友好，描述自己感受时（I feel like the odd man out.）更自然。也可以用更中性的说法：the only one / the outsider。"]}
{"word":"oddment","summary":{"en":"Oddment means a small leftover piece or a minor miscellaneous detail.","zh":"oddment 指“零头/剩余的小部分”，也可指“琐碎杂项的小细节”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small leftover piece, amount, or item; something that remains after the main part is used or taken","zh":"零头；剩余的小部分；零碎物（主部分用完或拿走后剩下的东西）"},"examples":[{"en":"She used oddments of fabric to make a small patchwork bag.","zh":"她用一些布料碎料（零头）做了一个小拼布包。"},{"en":"The drawer was full of oddments—buttons, keys, and old receipts.","zh":"抽屉里满是零碎物——纽扣、钥匙和旧收据。"}]},{"partOfSpeech":"n.","definition":{"en":"a small, unimportant detail or fact; a miscellaneous item of information","zh":"琐碎的小事（或细节）；杂项信息"},"examples":[{"en":"He filled the talk with oddments of history that most people had never heard.","zh":"他的演讲夹杂了许多人从未听过的历史小逸事。"}]}],"synonyms":["scrap","remnant","leftover","fragment","bit","trifle"],"phonetic":"/ˈɑdmənt/","extraExplanation":["“oddment”常见于较书面或带点文艺气息的语境，强调“零零碎碎的剩余物”。在英式英语里更常见，但美式读者也能理解；美式更常用的近义表达是“bits and pieces / leftovers / scraps”。","在文学或散文中，“oddments”常用来营造“杂陈的细节、零散的记忆”的感觉，比如形容一段记忆由许多小片段拼成。"]}
{"word":"oddments","summary":{"en":"Oddments are small leftover pieces or miscellaneous items—odds and ends.","zh":"oddments 指零碎剩余的东西或杂物，相当于 odds and ends（零零碎碎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small leftover pieces or miscellaneous items; odds and ends","zh":"零碎剩余的东西；杂物；零零散散的物件"},"examples":[{"en":"She collected oddments of fabric to make a patchwork quilt.","zh":"她收集零碎的布料来做一条拼布被。"},{"en":"The drawer was full of oddments—old keys, buttons, and pens.","zh":"抽屉里塞满了杂物——旧钥匙、纽扣和笔。"}]},{"partOfSpeech":"n.","definition":{"en":"a small remainder of something (often after the main part is used or sold)","zh":"（用完或卖掉主要部分后）剩下的一点点；余量"},"examples":[{"en":"After the sale, only oddments of stock were left on the shelves.","zh":"促销结束后，货架上只剩下一点点存货。"},{"en":"He made lunch from oddments in the fridge.","zh":"他用冰箱里剩下的一点点食材做了午饭。"}]}],"synonyms":["odds and ends","bits and pieces","leftovers","remnants","miscellany"],"phonetic":"/ˈɑd.mənts/","extraExplanation":["“oddments”常用于较正式或带点文学气息的语境，意思接近“odds and ends（零零碎碎）”。在英国英语里也常用于商店语境，指“零码/清仓剩货”。","词源上与“odd（零散的；不成对的）”有关，强调“不是完整一套/不是主要部分”的碎片或余物。"]}
{"word":"oddness","summary":{"en":"Oddness means the quality of being strange or unusual, or a strange/unusual thing or detail.","zh":"Oddness 指“奇怪、不寻常的特质”，也可指“怪事/怪异之处”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being strange, unusual, or unexpected; strangeness","zh":"古怪；奇特；反常（的特质）"},"examples":[{"en":"There’s an oddness about the old house that makes people uneasy.","zh":"那栋老房子有种古怪的感觉，让人不安。"},{"en":"I noticed the oddness of his sudden silence.","zh":"我注意到他突然沉默的反常。"}]},{"partOfSpeech":"n.","definition":{"en":"something strange or unusual; an odd feature or detail","zh":"怪事；怪异之处；不寻常的细节"},"examples":[{"en":"The museum is full of oddness from different cultures and centuries.","zh":"这座博物馆里满是来自不同文化与世纪的奇闻异事。"},{"en":"One oddness in the report is that the numbers don’t match.","zh":"这份报告里有个怪异之处：数字对不上。"}]}],"synonyms":["strangeness","unusualness","peculiarity","weirdness"],"phonetic":"/ˈɑdnəs/","extraExplanation":["“oddness”来自形容词“odd”（奇怪的、不寻常的）+ 名词后缀“-ness”（表示“……的状态/特质”），类似：kind → kindness（善良）、dark → darkness（黑暗）。","语气上，“oddness”通常比较中性，表示“有点怪/不寻常”；若要更强烈的负面感觉，可用“weirdness”（更怪、更不正常）或“creepiness”（令人毛骨悚然的诡异）。"]}
{"word":"oddnesses","summary":{"en":"“Oddnesses” means multiple strange or unusual qualities/details (the plural of “oddness”).","zh":"“oddnesses”指多种奇怪或不寻常的特质/细节（oddness 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The plural form of “oddness”: strange or unusual qualities, behaviors, or details (more than one).","zh":"“oddness”的复数：多种奇怪/不寻常的特质、行为或细节。"},"examples":[{"en":"The town has its oddnesses, but that’s part of its charm.","zh":"这个小镇有不少怪怪的地方，但这也是它迷人的一部分。"},{"en":"We noticed several oddnesses in his story and asked more questions.","zh":"我们在他的说法里注意到几处不太对劲的地方，于是追问了更多问题。"}]}],"synonyms":["strangenesses","quirks","peculiarities","weird details"],"phonetic":"/ˈɑdnəsɪz/","extraExplanation":["“oddness”由形容词 odd（奇怪的）+ 名词后缀 -ness（……的状态/性质）构成，表示“奇怪这一特质”。复数 oddnesses 常用来强调“好几种/好几处怪异之处”。","口语中也常用更自然的表达来替代，如：a few strange things / some weird details / a couple of quirks（一些怪事/奇怪细节/小怪癖）。"]}
{"word":"odds","summary":{"en":"“Odds” most often means probability or chance; it can also mean betting ratios, difficult disadvantages (“against the odds”), or disagreement (“at odds”).","zh":"“odds”最常指“可能性/概率”；也可指“赔率”、不利处境（against the odds）以及“不和/不一致”（at odds）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the chance or probability that something will happen (often used with “the odds of …” or “odds are …”)","zh":"（某事发生的）可能性；概率（常用于 the odds of… / odds are…）"},"examples":[{"en":"What are the odds of it raining tomorrow?","zh":"明天下雨的可能性有多大？"},{"en":"The odds are that she’ll arrive late because of traffic.","zh":"很可能她会因为堵车而迟到。"}]},{"partOfSpeech":"n.","definition":{"en":"the money-return ratio in betting, showing how much you could win compared to what you risk","zh":"（博彩/赌注的）赔率；押注回报比例"},"examples":[{"en":"The odds on that team are 3 to 1.","zh":"那支队伍的赔率是三比一。"}]},{"partOfSpeech":"n.","definition":{"en":"a difference that makes success difficult; an unfair disadvantage (used in “against the odds”)","zh":"不利条件；逆境（常用于 against the odds 表示“逆境中/出乎意料地”）"},"examples":[{"en":"Against the odds, he finished the race after his injury.","zh":"尽管情况不利，他受伤后仍然完成了比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"a disagreement or quarrel (used in “at odds (with)”)","zh":"不和；争执（常用于 at odds (with) 表示“与…不一致/不合”）"},"examples":[{"en":"Her actions are at odds with her words.","zh":"她的行为与她的话不一致。"},{"en":"The two brothers have been at odds for years.","zh":"两兄弟多年来一直不和。"}]}],"synonyms":["chance","probability","likelihood","betting odds","disadvantage","disagreement"],"phonetic":"/ɑdz/","extraExplanation":["“odds”通常以复数形式出现（the odds are…, against the odds, at odds），但在博彩语境中也可搭配单数动词取决于说话者把它看作“一个比例”还是“多种因素”。日常口语里更常见复数搭配：The odds are…","常见搭配：the odds of (doing) something（做某事的可能性）；odds are (that)…（很可能……）；against the odds（在不利情况下/出乎意料）；at odds with…（与……不一致/不和）。","词源上，odd 有“奇数/不成对”的意思，odds 最早与“差额、差距”相关；后来在赛马/赌博里发展出“赔率”的含义，再引申为一般意义上的“可能性”。"]}
{"word":"oddsbud","summary":{"en":"“Oddsbud” is a rare archaic exclamation (a variant of “odsbod”) meaning “God’s body,” used as a mild oath in older English.","zh":"“Oddsbud”是非常少见的古语感叹词（“odsbod”的变体），源自“God’s body”，旧时用作较轻的誓词/咒语。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Archaic) An oath or mild swear word meaning “God’s body,” used to express surprise, annoyance, or emphasis.","zh":"（古语）一种感叹/誓词，源自“God’s body（上帝的身体）”的变形，用来表示惊讶、恼怒或强调。"},"examples":[{"en":"Oddsbud! I told you to lock the door.","zh":"Oddsbud！我说了要把门锁上。"},{"en":"Oddsbud, that’s a lot of money for a simple meal.","zh":"Oddsbud，这么简单的一顿饭也太贵了。"}]},{"partOfSpeech":"other","definition":{"en":"A rare spelling variant of “odsbod,” mostly seen in older texts; not common in modern English.","zh":"“odsbod”的罕见拼写变体，多见于旧文本；现代英语中几乎不用。"},"examples":[{"en":"In old plays you may see spellings like “odsbod,” “odsbodikins,” or “oddsbud.”","zh":"在旧戏剧里你可能会看到“odsbod”“odsbodikins”或“oddsbud”等拼法。"}]}],"synonyms":["odsbod","odsbodikins","'sblood (archaic)","goodness (modern, mild)"],"phonetic":"ˈɑdzˌbɑd","extraExplanation":["这是早期近代英语里常见的“委婉誓词（minced oath）”之一：人们把带有宗教意味、可能被认为亵渎的誓词（如直接说“God’s …”）改写成听起来相近但不那么直白的形式。","在莎士比亚时代及其前后，类似的表达很多，例如“’sblood”（God’s blood）、“’slid”（God’s lid/eyelid 等变形）、“odsbodikins”（在“odsbod”基础上加上小词缀 -kins，使语气更轻、更口语）。这些多见于戏剧对白，用来塑造人物口吻。","现代写作与口语中基本不会用“oddsbud/odsbod”；如果你想表达惊讶或恼火，更自然的替代有：“Oh my gosh,” “Goodness,” “Come on,” “What the heck,” 等（语气强弱不同）。"]}
{"word":"oddside","summary":{"en":"“Oddside” (more commonly “odd side”) means the unusual or quirky side of someone or something.","zh":"“oddside”（更常见写法为“odd side”）指某人或某事不寻常、古怪的一面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) The unusual, quirky, or less typical aspect of someone or something.","zh":"（非正式）某人或某事不寻常、古怪或不太典型的一面。"},"examples":[{"en":"She has a serious side at work, but her oddside comes out with friends.","zh":"她在工作时很严肃，但和朋友在一起时会展现出她古灵精怪的一面。"},{"en":"The documentary explores the oddside of city life—strange habits and hidden places.","zh":"这部纪录片探索了城市生活不为人熟知的古怪一面——奇特的习惯和隐秘的地方。"}]}],"synonyms":["odd side","quirky side","unusual side","strange side"],"phonetic":"/ɑd saɪd/","extraExplanation":["“oddside”并不是非常标准或常见的拼写；更常见的写法是分开的 **odd side**（不寻常的一面）。在正式写作中，建议用 **the unusual side / the quirky side** 来表达，会更自然、更清晰。"]}
{"word":"oddsmaker","summary":{"en":"An oddsmaker is the person or group that sets betting odds for games and events.","zh":"oddsmaker 指为比赛或事件制定博彩赔率（盘口）的人或机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that sets the betting odds for sports or other events (often working for a sportsbook or bookmaker).","zh":"（体育等赛事的）赔率制定者；开盘手（常在博彩公司/投注平台工作，负责开赔率）"},"examples":[{"en":"The oddsmaker moved the line after the star player got injured.","zh":"明星球员受伤后，开盘手调整了赔率（盘口）。"},{"en":"According to the oddsmakers, the home team is favored by three points.","zh":"按开盘手的赔率来看，主队被看好，预计赢3分。"}]}],"synonyms":["bookmaker (often broader)","line maker","handicapper (sometimes, but not identical)"],"phonetic":"/ˈɑdzˌmeɪkɚ/","extraExplanation":["“Oddsmaker”常见于美国体育博彩语境（如NFL、NBA）。他们会根据球队实力、伤病、投注热度等因素“开盘/调盘”，目的之一是平衡两边投注量、降低庄家风险。","相关表达：set the odds（定赔率）、make a line / set a line（开盘/定盘口）、move the line（调盘）、favorites vs. underdogs（热门 vs. 冷门）。","文化提醒：在不同国家/地区，体育博彩的合法性和监管差异很大；阅读或使用该词时通常默认是“合法投注平台/博彩公司”的语境。"]}
{"word":"oddsman","summary":{"en":"An uncommon word meaning either a bookmaker who sets odds or, less commonly, a person who bets using odds.","zh":"较少见的词，可指“开赔率的庄家”，也可较少见地指“按赔率下注的赌客”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bookmaker; a person who sets betting odds and takes bets, aiming to make a profit.","zh":"（尤指赛马等）庄家；制定赔率并接受下注以获利的人（类似“开盘的人/收注的人”）。"},"examples":[{"en":"The oddsman offered 5-to-1 on the underdog before the match started.","zh":"比赛开始前，庄家给了弱队 5 比 1 的赔率。"},{"en":"Police investigated an illegal oddsman who was taking bets outside the stadium.","zh":"警方调查了一名在体育场外非法收注的庄家。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who bets using odds (a bettor or gambler), especially in older or less common usage.","zh":"下注者；按赔率下注的赌客（较旧或不太常见的用法）。"},"examples":[{"en":"An old novel describes him as an oddsman who lived for the excitement of racing.","zh":"一部旧小说把他描写成一个靠赛马刺激过活的赌客。"},{"en":"Only a few oddsmen stayed after the rain, still hoping to place a bet.","zh":"雨后只剩下少数赌客仍在等待下注的机会。"}]}],"synonyms":["bookmaker","bettor","gambler","betting agent"],"phonetic":"/ˈɑdzmən/","extraExplanation":["“oddsman”在现代英语里比较少见，常见表达通常是 bookmaker（庄家/博彩业者）或 bettor/gambler（下注者/赌徒）。","这个词多出现在较旧的文本或带有英式/赛马博彩语境的写作中；阅读时可根据上下文判断是“庄家”还是“赌客”。"]}
{"word":"ode","summary":{"en":"An ode is a lyrical poem that praises or thoughtfully reflects on someone or something.","zh":"ode 指“颂歌/颂诗”，一种用来赞美或沉思某人某物的抒情诗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lyric poem that expresses strong feelings of praise, admiration, or deep reflection, often written in a formal or elevated style.","zh":"颂歌；（常较庄重、文体较高雅的）抒情诗，用来表达赞美、敬仰或深沉的思考。"},"examples":[{"en":"Keats’s “Ode to a Nightingale” is one of the most famous odes in English literature.","zh":"济慈的《夜莺颂》是英语文学中最著名的颂歌之一。"},{"en":"She wrote an ode to her hometown, praising its rivers and quiet streets.","zh":"她写了一首献给家乡的颂歌，赞美那里的河流与宁静的街道。"},{"en":"The poem is an ode to friendship and the way it sustains us in hard times.","zh":"这首诗是一曲友谊的颂歌，写友谊如何在艰难时刻支撑我们。"}]}],"synonyms":["praise poem","hymn","tribute","panegyric"],"phonetic":"/oʊd/","extraExplanation":["“Ode”源自希腊语“ōidē”，意为“歌”。传统上，ode常带有较正式的语气，用来歌颂某个人、事物或抽象概念（如自由、青春、自然）。","英语文学里很常见的例子包括济慈（John Keats）的《希腊古瓮颂》（Ode on a Grecian Urn）和《夜莺颂》（Ode to a Nightingale）。在现代写作中，也可以更口语化，比如写一首“ode to coffee（献给咖啡的颂歌）”。"]}
{"word":"odea","summary":{"en":"“Idea” means a thought or plan, or an understanding of something.","zh":"“idea”指“想法/主意/计划”，也可指“对某事的了解或理解”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thought, plan, or suggestion about what to do or how to do something.","zh":"想法；主意；计划或建议（关于做什么或怎么做）。"},"examples":[{"en":"I have an idea for your birthday gift.","zh":"我有一个关于你生日礼物的主意。"},{"en":"That’s a good idea—let’s try it.","zh":"那是个好主意——我们试试吧。"}]},{"partOfSpeech":"n.","definition":{"en":"An understanding or general knowledge of something (often used with “of”).","zh":"对某事的理解或大致了解（常与 of 连用）。"},"examples":[{"en":"Do you have any idea of how this works?","zh":"你知道这东西大概怎么运作吗？"},{"en":"I have no idea what he meant.","zh":"我完全不知道他是什么意思。"}]}],"synonyms":["thought","plan","suggestion","notion"],"phonetic":"/aɪˈdiə/","extraExplanation":["“odea”在英语里不是常见单词；很可能是把“idea”拼错了（i 和 o 位置接近时容易打错）。如果你原本想查的是别的词，请告诉我上下文句子，我可以帮你确认。"]}
{"word":"odel","summary":{"en":"“Odel/odel” is usually a name or a misspelling; it isn’t a common standalone English word.","zh":"“Odel/odel”通常是人名或拼写错误；它不是常见的英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most often seen as a name (a surname or given name) or as a misspelling of another word.","zh":"不是常见英语词典里的标准单词；更常见的是作为人名（姓氏或名字），或是其他单词的拼写错误。"},"examples":[{"en":"Odel is a family name in some countries.","zh":"Odel 在一些国家里是一个姓氏。"},{"en":"Did you mean “model” instead of “odel”?","zh":"你是不是想写“model”，却写成了“odel”？"}]}],"phonetic":"/ˈoʊdəl/","extraExplanation":["“odel”本身在英语里不算常用词汇；如果你是在学习词汇，很可能是少了开头的字母 m（model）或 y（yodel）。","如果你告诉我它出现的句子或语境（例如一整句、截图、或你想表达的意思），我可以帮你判断最可能的正确单词并解释用法。"]}
{"word":"odelet","summary":{"en":"A rare word meaning a short ode (a small lyrical poem of praise).","zh":"一个少见词，表示“短颂歌”（较短的赞美抒情诗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A short ode; a small lyrical poem in the style of an ode.","zh":"（少见）短颂歌；一种篇幅较短、具有颂歌风格的抒情诗。"},"examples":[{"en":"The poet tucked an odelet at the end of the book as a quiet tribute.","zh":"诗人在书末放了一首短颂歌，作为含蓄的致敬。"},{"en":"She wrote an odelet to the city’s winter light.","zh":"她写了一首短颂歌，赞美这座城市冬日的光。"}]}],"synonyms":["short ode","little ode","lyric","poem"],"phonetic":"/oʊˈdɛlɪt/","extraExplanation":["“odelet”由“ode（颂歌）+ -let（表示“小/短”的后缀）”构成，意思就是“小颂歌/短颂歌”。在现代英语中非常少用，更常见的说法是“a short ode”或“a little ode”。","后缀“-let”也出现在一些常见词里，表示“小的/较轻的”，例如：booklet（小册子）、leaflet（传单）。"]}
{"word":"odell","summary":{"en":"Odell is most commonly used as a surname or given name, and it can also be a place name in the U.S.","zh":"Odell 最常见为姓氏或名字，也可作美国的一些地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also sometimes used as a given name","zh":"姓氏（也偶尔用作名字）"},"examples":[{"en":"Her last name is Odell.","zh":"她的姓是 Odell。"},{"en":"Odell wrote a short story for the school magazine.","zh":"Odell 为校刊写了一篇短篇故事。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (used for some towns/areas, especially in the U.S.)","zh":"地名（用于一些城镇/地区名，尤其在美国）"},"examples":[{"en":"They drove through Odell on their way home.","zh":"他们回家路上开车经过 Odell。"}]}],"phonetic":"/oʊˈdɛl/","extraExplanation":["Odell 多见于英语世界的人名（姓或名）。在美国文化里，你可能会在体育新闻里看到这个名字，例如球员 Odell Beckham Jr.；这种情况下 Odell 是名（first name）。","作为人名时，通常首字母大写：Odell。若写成 odell（全小写）多半是非正式输入或用户名。"]}
{"word":"odelsthing","summary":{"en":"“Oldest thing” means the most ancient/earliest item, or (informally) something very familiar or traditional.","zh":"“oldest thing”指“最古老/最早的东西”，也可口语中表示“很老套、很常见的事”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"used to refer to the earliest or most ancient example of something (often in a casual way)","zh":"用来指“某物中最早、最古老的那一个/那类”（常带口语色彩）"},"examples":[{"en":"This temple might be the oldest thing in the city.","zh":"这座寺庙可能是这座城市里最古老的东西。"},{"en":"What’s the oldest thing you still own?","zh":"你现在还拥有的最老的一件东西是什么？"}]},{"partOfSpeech":"phrase","definition":{"en":"used for emphasis to say something is very familiar, traditional, or has existed for a long time","zh":"用于强调，表示“非常老套/非常传统/早就存在很久了”"},"examples":[{"en":"That’s the oldest thing in the book—everyone knows that trick.","zh":"那是最老套的一招——大家都知道那种把戏。"},{"en":"It’s the oldest thing: people complain about the weather every day.","zh":"这太常见了：人们每天都在抱怨天气。"}]}],"synonyms":["the oldest","the most ancient thing","a very old tradition","the oldest trick in the book"],"phonetic":"/ˈoʊldəst θɪŋ/","extraExplanation":["你输入的“odelsthing”很像把空格省略或拼写漏了：常见目标可能是 **oldest thing**（最古老的东西/最老套的事）或 **oddest thing**（最奇怪的事）。如果你原本想查的是 **oddest thing**，告诉我我可以改成那一条。","语法提示：**oldest** 是形容词 **old** 的最高级（old → older → oldest）。常见结构：**the oldest + 名词**（the oldest building / the oldest thing I own）。"]}
{"word":"odelsting","summary":{"en":"Odelsting is a historical division of Norway’s parliament (Storting) that existed until 2009.","zh":"Odelsting是挪威议会（Storting）在2009年改革前的一个历史分院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norway, historical) One of the two chambers (divisions) of the Norwegian parliament (the Storting) until 2009; it handled much of the lawmaking process.","zh":"（挪威，历史）挪威议会（Storting，斯托尔廷）的两院之一（分院之一），2009年前负责大量立法相关工作。"},"examples":[{"en":"Before 2009, a bill would often be debated in the Odelsting before moving on in the parliamentary process.","zh":"在2009年以前，一项法案通常会先在Odelsting中辩论，然后再进入后续的议会程序。"},{"en":"The Odelsting and the Lagting formed a two-part structure inside the Storting.","zh":"Odelsting和Lagting构成了Storting内部的两部分结构。"}]}],"synonyms":["Norwegian parliamentary chamber (historical)","division of the Storting (historical)"],"phonetic":"/ˈoʊdəlstɪŋ/","extraExplanation":["“Odelsting”是挪威政治制度中的历史名词：当时Storting内部会分成Odelsting与Lagting，两者分工合作进行立法审议。2009年改革后取消这种分院结构，改为一院制运作。","该词在英语中多作为外来专名使用，常见于历史、政治学或北欧研究相关语境。"]}
{"word":"odeon","summary":{"en":"An odeon is a hall or theater for musical performances; in some places (especially the UK) it can also mean a cinema.","zh":"odeon 指用于音乐表演的剧场／演奏厅；在一些地区（尤指英国）也可指电影院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a theater or hall used for music, concerts, or performances (often an auditorium, especially in ancient Greece and Rome).\nExamples: \n• The choir performed in the odeon. \n• We visited the ancient odeon during our trip to Greece.","zh":"（常指用于音乐会或表演的）剧场／音乐厅；（尤指古希腊、古罗马的）演奏厅、剧场。\n例句：\n• 合唱团在这座音乐厅里演出。\n• 我们去希腊旅行时参观了一座古代的演奏厅。"},"examples":[{"en":"The choir performed in the odeon.","zh":"合唱团在这座音乐厅里演出。"},{"en":"We visited the ancient odeon during our trip to Greece.","zh":"我们去希腊旅行时参观了一座古代的演奏厅。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in the UK and some other countries) a cinema or movie theater, often used as a name for a chain.\nExamples:\n• Let’s meet outside the Odeon cinema at 7.\n• They watched the new film at the local Odeon.","zh":"（尤在英国等地）电影院（也常作连锁影院名称）。\n例句：\n• 我们7点在Odeon电影院门口见。\n• 他们在当地的Odeon看了新电影。"},"examples":[{"en":"Let’s meet outside the Odeon cinema at 7.","zh":"我们7点在Odeon电影院门口见。"},{"en":"They watched the new film at the local Odeon.","zh":"他们在当地的Odeon看了新电影。"}]}],"synonyms":["theater","auditorium","concert hall","music hall","cinema (UK)","movie theater"],"phonetic":"/oʊˈdiːən/","extraExplanation":["“odeon”源自古希腊语，和“ode（颂歌）/ song（歌）”有关，原指专门用来听音乐、朗诵、演出的场所。","在古典建筑语境中，你可能会看到著名的例子，如雅典的“赫罗德·阿提库斯音乐厅（Odeon of Herodes Atticus）”。","在现代日常用法里，英式英语中“Odeon”常被当作“电影院”的泛指（因连锁影院品牌而普及），但在美式语境中更常理解为“演奏厅/剧场”的较正式词。"]}
{"word":"odeons","summary":{"en":"“Odeons” is the plural of “odeon,” meaning theaters/concert halls, or (historically) ancient roofed performance buildings; it can also refer to cinemas named “Odeon.”","zh":"“Odeons”是“odeon”的复数，指剧院/音乐厅，或（历史上）古代有屋顶的表演建筑；也可能指名为“Odeon”的电影院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of odeon: a theater or concert hall (often for music or performances). In some places it can also mean a movie theater, especially one named “Odeon.”","zh":"odeon 的复数：剧院或音乐厅（常用于音乐表演）。在一些地区也可指电影院，尤其是名为“Odeon”的影院。"},"examples":[{"en":"Several old odeons in the city have been restored as concert venues.","zh":"这座城市里有几座老式的 odeons 被修复成了音乐会场地。"},{"en":"We met outside the Odeon, then walked to dinner.","zh":"我们在 Odeon 影院外碰面，然后去吃晚饭。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of odeon: in ancient Greece and Rome, a smaller roofed building used for musical performances and poetry readings.","zh":"odeon 的复数：在古希腊与古罗马，用于音乐演出和诗歌朗诵的较小、有屋顶的表演建筑。"},"examples":[{"en":"Archaeologists uncovered the remains of two odeons near the forum.","zh":"考古学家在广场附近发现了两座 odeons 的遗迹。"},{"en":"The guide explained how odeons were designed for better acoustics.","zh":"导游解释了 odeons 如何为了更好的音效而设计。"}]}],"synonyms":["theaters","concert halls","auditoriums","playhouses","cinemas"],"phonetic":"/oʊˈdiːɑn/","extraExplanation":["“Odeon”来自希腊语“ōideion”，与“ōidē（歌/颂歌）”有关，所以它最初和音乐、吟诵类表演联系很强。","在英国等地，“Odeon”也是著名连锁电影院的名称，因此在语境里可能指“某家名叫 Odeon 的影院”，首字母常大写（Odeon）。"]}
{"word":"odes","summary":{"en":"“Odes” means lyric poems that praise or celebrate someone or something (plural of “ode”).","zh":"“odes”是“ode”的复数，指赞美或歌颂某人某物的抒情诗（颂诗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ode”: lyric poems (often formal) that express praise, admiration, or deep feeling toward a person, place, thing, or idea.","zh":"“ode”的复数：颂诗；一种较正式的抒情诗，常用来赞美或表达对某人、某地、某物或某种观念的强烈情感。"},"examples":[{"en":"The anthology includes odes to nature, love, and freedom.","zh":"这本诗选收录了写给自然、爱情和自由的颂诗。"},{"en":"She read Keats’s odes in literature class.","zh":"她在文学课上读了济慈的几首颂诗。"},{"en":"His speeches sounded like odes to hard work.","zh":"他的演讲听起来就像是在歌颂勤奋。"}]}],"synonyms":["praise poems","panegyrics","hymns","tributes"],"phonetic":"/oʊdz/","extraExplanation":["“ode（颂诗）”源自古希腊抒情诗传统，常用于庄重、赞美或沉思的主题。英语里常提到的代表作品有济慈（John Keats）的《夜莺颂》《希腊古瓮颂》，以及雪莱（Percy Shelley）的《西风颂》（常译作“颂”，形式上也常被视为ode传统的一部分）。","现代英语里，“ode to …”也常被借用为一种修辞说法，意思是“对……的赞歌/致敬”，不一定是真正的诗。"]}
{"word":"odeum","summary":{"en":"An odeum is a hall or (especially in ancient times) a theater-like building for musical performances; it’s a less common spelling of “odeon.”","zh":"odeum 指用于音乐表演的礼堂/音乐厅，尤指古代的音乐剧场；是“odeon”的较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building or hall used for musical performances, concerts, or public lectures (a less common spelling of “odeon”).","zh":"用于音乐表演、音乐会或公开演讲的建筑/大厅（“odeon”的较少见拼写）。"},"examples":[{"en":"The chamber concert was held in the city’s odeum.","zh":"室内乐音乐会在这座城市的音乐厅（odeum）举行。"},{"en":"Our school rented the odeum for the guest speaker’s talk.","zh":"我们学校租用了这座礼堂（odeum）来举办嘉宾演讲。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) an ancient Greek or Roman theater-like building designed especially for musical performances.","zh":"（历史）古希腊或古罗马的一种类似剧场的建筑，主要用于音乐演出。"},"examples":[{"en":"Archaeologists uncovered the remains of an odeum near the forum.","zh":"考古学家在广场附近发现了一座古代音乐厅（odeum）的遗址。"},{"en":"Unlike the open-air amphitheater, the odeum was often roofed.","zh":"与露天圆形剧场不同，odeum 常常有屋顶。"}]}],"synonyms":["odeon","concert hall","music hall","auditorium"],"phonetic":"/oʊˈdiːəm/","extraExplanation":["“odeum”源自希腊语 ᾠδεῖον（ōideion），与“ode（颂歌）”同源，原意与“歌唱/音乐表演的场所”相关。英语中更常见的拼写是“odeon”，而“odeum”多见于历史或考古语境。"]}
{"word":"odeums","summary":{"en":"“Odeums” means multiple odeums—halls for musical performances, especially in ancient Greek/Roman contexts.","zh":"“odeums”是“odeum”的复数，指用于音乐演出/朗诵的音乐厅，尤其常见于古希腊、古罗马语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “odeum”: buildings or halls used for musical performances, concerts, or recitals (often smaller than theaters).","zh":"“odeum”的复数：用于音乐演出、音乐会或独奏/独唱表演的建筑或大厅（通常比剧院更小）。"},"examples":[{"en":"In ancient cities, odeums were built for music and poetry performances.","zh":"在古代城市里，人们建造odeum（音乐厅）用于音乐和诗歌演出。"},{"en":"The museum exhibit shows models of Roman odeums.","zh":"博物馆展览展示了罗马odeum（音乐厅）的模型。"}]}],"synonyms":["concert halls","music halls","auditoriums"],"phonetic":"/ˈoʊdiəmz/","extraExplanation":["“odeum”来自希腊语“ōideion”，与“ōidē（歌、颂歌）”有关，原指为音乐与朗诵而建的室内或半室内场所。英语里它较为书面、历史/考古语境常见。","也常见近义词/相关词“odeon”（有时指影院或音乐剧场的名称）。在现代用法中，很多场馆会直接用“Odeon/Odeum”作专名。"]}
{"word":"ODI","summary":{"en":"ODI most commonly means One Day International, a one-day limited-overs international cricket match.","zh":"ODI最常见的意思是板球“一日国际赛”，即一天内进行的限制局数国际比赛。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(cricket) One Day International: a limited-overs cricket match between national teams, usually played in one day (typically 50 overs per side).","zh":"（板球）一日国际赛：由国家队参加、通常一天内完成的限制局数板球比赛（一般每队50局）。"},"examples":[{"en":"India will play Australia in the second ODI tomorrow.","zh":"印度队明天将在第二场ODI对阵澳大利亚队。"},{"en":"He scored a century on his ODI debut.","zh":"他在ODI首秀中打出了百分（单场100分）。"},{"en":"ODIs are shorter than Test matches but longer than T20s.","zh":"ODI比测试赛短，但比T20长。"}]}],"synonyms":["One Day International"],"phonetic":"ˌoʊ diː ˈaɪ","extraExplanation":["ODI通常读作字母“O-D-I”。它是板球里非常常见的比赛类型：比“Test match（测试赛）”节奏更快，又比“T20（20局赛）”更传统、时间更长。","在非板球语境里，ODI也可能是其他领域的缩写（不同机构或专业会有不同含义）。如果你告诉我上下文（体育/工作/学术等），我可以帮你确定具体意思。"]}
{"word":"odian","summary":{"en":"Odin is the chief god in Norse mythology; it is also used as a male given name.","zh":"Odin 指北欧神话中的主神奥丁，也可用作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Odin: the chief god in Norse mythology (Old Scandinavian religion), associated with wisdom, poetry, magic, war, and the dead; often called the “Allfather.”","zh":"奥丁：北欧神话（古斯堪的纳维亚宗教）中的主神，与智慧、诗歌、魔法、战争和亡者有关；常被称为“众神之父”。"},"examples":[{"en":"In Norse myths, Odin sacrifices an eye to gain wisdom.","zh":"在北欧神话中，奥丁为了获得智慧而献出一只眼睛。"},{"en":"Many stories say Odin is accompanied by two ravens.","zh":"许多故事说奥丁身边有两只乌鸦相伴。"}]},{"partOfSpeech":"n.","definition":{"en":"Odin: a masculine given name, especially used in Scandinavian contexts or inspired by Norse mythology.","zh":"奥丁：男性名字，常见于斯堪的纳维亚语境，或受北欧神话启发而使用。"},"examples":[{"en":"They named their son Odin after the Norse god.","zh":"他们给儿子取名奥丁，源自北欧神话中的那位神。"}]}],"synonyms":["Allfather","Woden","Wodan"],"phonetic":"ˈoʊdɪn","extraExplanation":["英语里常见拼写是 **Odin**（不是 *odian*）。如果你想查的是别的词，也可以告诉我上下文句子。","奥丁的别名包括 **Allfather（众神之父）**。在神话里他常与两只乌鸦 **Huginn** 和 **Muninn** 联系在一起，象征“思想”和“记忆”。","英语单词 **Wednesday（星期三）** 的词源与奥丁有关：来自古英语 *Wōdnesdæg*（“Woden’s day”），而 **Woden/Wodan** 是奥丁在日耳曼传统中的对应名称。"]}
{"word":"odible","summary":{"en":"“Odible” is usually a misspelling of “audible” (/ˈɔdəbəl/), meaning “able to be heard.”","zh":"“odible”通常是“audible”（/ˈɔdəbəl/）的拼写错误，意思是“听得见的/可被听到的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “audible,” meaning able to be heard.","zh":"不是标准英语单词；最常见是把“audible”拼错了，意思是“听得见的 / 可被听到的”。"},"examples":[{"en":"“Odible” isn’t in most dictionaries—did you mean “audible”?","zh":"“odible”在大多数词典里找不到——你是不是想写“audible”？"},{"en":"Her voice was barely audible over the noise.","zh":"在噪音中，她的声音几乎听不见。"}]},{"partOfSpeech":"adj.","definition":{"en":"(audible, adj.) Able to be heard; loud enough to hear.","zh":"（audible，形容词）听得见的；声音大到能听见的。"},"examples":[{"en":"Please speak in an audible voice.","zh":"请用听得见的音量说话。"},{"en":"The alarm was clearly audible from the hallway.","zh":"在走廊里也能清楚听到警报声。"},{"en":"There was an audible sigh in the room.","zh":"房间里传来一声清晰可闻的叹息。"}]}],"synonyms":["audible","hearable","perceptible (by sound)"],"phonetic":"/ˈɔdəbəl/","extraExplanation":["“audible”来自拉丁语 audire（听）。常见搭配：audible voice（听得见的声音）、clearly/barely audible（清楚可闻/几乎听不见）、audible sigh（听得见的叹气）。","相关词：inaudible（听不见的）、audio（音频/音响的）、audience（观众/听众）。"]}
{"word":"odic","summary":{"en":"Odic means “related to an ode,” and more rarely it can refer to the historical notion of “odic force.”","zh":"odic意为“与颂诗（ode）有关的”，更罕见时也指历史上所谓的“odic force（奥迪力）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an ode (a formal lyric poem, often praising someone or something).","zh":"与颂诗（ode，一种较正式的抒情诗，常用来赞美人或事物）有关的；颂诗的。"},"examples":[{"en":"The poem has an odic tone, praising the sea in elevated language.","zh":"这首诗带有颂诗式的语气，用庄重的语言赞美大海。"},{"en":"She tried an odic style to celebrate her hometown.","zh":"她尝试用颂诗体来歌颂自己的家乡。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, historical) Related to an old idea called “odic force,” a supposed natural energy once believed to influence living things.","zh":"（罕见，历史用法）与“奥迪力/奥德能量”（odic force）有关：一种曾被认为会影响生命的自然能量。"},"examples":[{"en":"Some 19th-century writers discussed “odic force” as if it were measurable.","zh":"一些19世纪的作者曾把“odic force”当作可测量的东西来讨论。"}]}],"synonyms":["ode-like","of an ode","poetic (broader)","lyric (related)"],"phonetic":"/ˈoʊdɪk/","extraExplanation":["“odic”在现代英语里非常少见。通常学术写作会直接用更常见的表达：与诗歌相关可说 poetic；与颂诗（ode）相关可说 relating to an ode。","“odic force”出现在19世纪欧洲的某些“自然哲学/神秘学”讨论中，后来不被主流科学接受，因此这一义项多见于历史文献或研究。"]}
{"word":"odically","summary":{"en":"“Odically” isn’t used as a normal word by itself; it’s usually the tail end of adverbs like “periodically” or “melodically.”","zh":"“odically”一般不作为独立单词使用，多为“periodically”“melodically”等副词的结尾部分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard standalone English word. It usually appears as the ending of longer adverbs (…-odically), meaning “in a …-odic way.” Common full words include “periodically” and “melodically.”","zh":"不是标准的英语单词，通常只是较长副词的结尾（……-odically），表示“以……的方式”。常见完整单词有“periodically（周期性地）”“melodically（有旋律地）”。"},"examples":[{"en":"You might be looking for “periodically,” as in: The app checks for updates periodically.","zh":"你可能想找的是“periodically”，例如：这个应用会周期性地检查更新。"},{"en":"Or “melodically,” as in: She sang melodically, and everyone fell quiet.","zh":"或是“melodically”，例如：她唱得很有旋律，大家都安静下来。"}]}],"phonetic":"/ˈɑdɪkli/","extraExplanation":["“-ically / -odically”常见于把形容词变成副词：例如 periodic（周期性的）→ periodically（周期性地）。如果你能提供原句，我可以帮你确定你真正想表达的是哪个完整单词。"]}
{"word":"odiferous","summary":{"en":"Odiferous means having a strong smell, usually an unpleasant one.","zh":"odiferous 指“气味很重”，通常带有“难闻、臭”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a strong smell, especially an unpleasant one; smelly.","zh":"有强烈气味的（尤指难闻的）；有臭味的。"},"examples":[{"en":"The garbage can was odiferous after sitting in the sun all day.","zh":"垃圾桶在太阳下晒了一整天后变得很臭。"},{"en":"The locker room can get pretty odiferous after practice.","zh":"练习后更衣室可能会变得很难闻。"}]}],"synonyms":["smelly","stinky","foul-smelling","malodorous","pungent"],"phonetic":"/oʊˈdɪf(ə)rəs/","extraExplanation":["“odiferous”来自拉丁语词根：odor（气味）+ -ferous（“带有、产生”的意思）。它常用在较正式或带点幽默的语境里，表示“气味很重”，多数情况下暗示不好闻。日常更常说 smelly / stinky / foul-smelling。"]}
{"word":"odinian","summary":{"en":"Odinian means “related to Odin” or “a follower of Odin.”","zh":"Odinian 指“与奥丁有关的”，也可指“奥丁的信奉者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Odin, the chief god in Norse mythology, or to ideas, symbols, or traditions connected with Odin.","zh":"与北欧神话主神奥丁（Odin）有关的；与奥丁相关的观念、象征或传统的。"},"examples":[{"en":"Some modern writers use Odin as an Odinian symbol of wisdom gained through sacrifice.","zh":"一些现代作家把奥丁作为“奥丁式（Odinian）”象征，代表通过牺牲获得的智慧。"},{"en":"The museum has Odinian motifs, such as ravens and the spear, in its Viking exhibit.","zh":"博物馆的维京展区里有一些奥丁式元素，比如乌鸦和长矛。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows or is devoted to Odin; (in modern use) someone involved in Odin-focused Norse pagan practice.","zh":"奥丁的信奉者；（现代用法）从事以奥丁为中心的北欧异教/新异教实践的人。"},"examples":[{"en":"In the novel, an Odinian appears as a wanderer who offers cryptic advice.","zh":"在小说里，一位奥丁信奉者以流浪者的形象出现，给出含蓄难懂的建议。"},{"en":"Some Odinians celebrate seasonal rituals inspired by Old Norse traditions.","zh":"一些奥丁信奉者会庆祝受古北欧传统启发的季节性仪式。"}]}],"synonyms":["Odinic","Norse","Norse-mythological","Asatru (context-specific)"],"phonetic":"oʊˈdɪniən","extraExplanation":["“Odinian”主要见于讨论北欧神话、维京文化、文学/奇幻作品，或现代北欧新异教（如某些“Odinism/Asatru”语境）中。","文化使用上要注意：在现代语境里，“Odinism/奥丁信仰”有时会被不同团体采用，其中少数极端团体可能带有排外或种族主义立场；学术或文化讨论时，最好明确你指的是神话/历史文化，还是某个当代宗教团体。"]}
{"word":"odinic","summary":{"en":"Odinic means “connected with Odin” in Norse mythology, often used to describe themes or imagery linked to him.","zh":"Odinic 指“与北欧神话主神奥丁有关的”，常用于描述与他相关的主题或意象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Odin, the chief god in Norse mythology; associated with Odin’s character, themes, or worship.","zh":"与奥丁（北欧神话中的主神）有关的；带有奥丁特质、主题或崇拜色彩的。"},"examples":[{"en":"The novel has strong Odinic themes, especially sacrifice and the search for wisdom.","zh":"这部小说有很强的“奥丁式”主题，尤其是牺牲与追求智慧。"},{"en":"Some scholars compare Odinic imagery in poetry to other warrior-god traditions.","zh":"一些学者将诗歌中的奥丁意象与其他战神传统作比较。"},{"en":"The museum exhibit explores Odinic symbols in Viking-age art.","zh":"博物馆展览探讨了维京时代艺术中的奥丁符号。"}]}],"synonyms":["Odin-related","pertaining to Odin","Norse (in some contexts)"],"phonetic":"/oʊˈdɪnɪk/","extraExplanation":["“Odinic”常见于学术写作、神话研究、文学评论或艺术史语境中，比日常口语更正式；通常首字母大写为“Odinic”，因为它来自专有名词“Odin（奥丁）”。","奥丁在北欧传统中常与“智慧、诗歌、战争、死亡、预言”相关；因此“Odinic themes/imagery”常指这些主题的象征与氛围（例如为了获得知识而付出代价）。","相关词：Odin（名词，奥丁）；Odinism（名词，奥丁崇拜/相关信仰运动，语境较复杂，使用需谨慎）。"]}
{"word":"odinism","summary":{"en":"Odinism is a modern revival of Norse/Germanic pagan religion centered on gods like Odin.","zh":"奥丁主义是以奥丁等北欧/日耳曼诸神为核心的现代异教复兴宗教运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A modern religious movement (often called Heathenry) that seeks to revive or practice pre-Christian Norse/Germanic pagan religion, honoring gods such as Odin, Thor, and Freyja.","zh":"奥丁主义（常归入“日耳曼/北欧新异教”Heathenry）：一种现代宗教运动，试图复兴或实践基督教传入前的北欧/日耳曼多神信仰，崇敬奥丁、索尔、芙蕾雅等神祇。"},"examples":[{"en":"She began reading about Odinism after becoming interested in Norse mythology.","zh":"她对北欧神话产生兴趣后，开始阅读奥丁主义相关资料。"},{"en":"Some Odinism groups hold seasonal rituals inspired by ancient Germanic traditions.","zh":"一些奥丁主义团体会举行受古代日耳曼传统启发的季节性仪式。"},{"en":"The museum exhibit explained how Odinism differs from studying mythology as literature.","zh":"博物馆展览说明了奥丁主义与把神话当作文学研究之间的差别。"}]}],"synonyms":["Heathenry","Norse paganism","Germanic paganism","Ásatrú"],"phonetic":"/ˈoʊdɪnˌɪzəm/","extraExplanation":["“Odinism”来自主神Odin（奥丁）+ -ism（……主义/学说）。现代语境里常与“Heathenry（新异教/日耳曼异教复兴）”并提，但不同团体自我认同用词不一。","需要注意：在英语新闻与社会语境中，“Odinism”有时会被用来指称某些带有极端主义或白人至上色彩的小团体，但这并不代表所有自称奥丁主义或相关信仰者。阅读或交流时可区分宗教实践与政治化、极端化的组织。","相关词：Norse paganism（北欧异教）、Germanic paganism（日耳曼异教）、Ásatrú（阿萨特鲁，常见的北欧异教复兴分支之一）。"]}
{"word":"odinist","summary":{"en":"An Odinist is a follower of Odinism, a modern Norse/Germanic pagan religion; it can also mean “related to Odinism.”","zh":"Odinist 指奥丁教（现代北欧／日耳曼异教复兴宗教）的信徒，也可作形容词表示“与奥丁教有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows Odinism, a modern form of Germanic/Norse pagan religion that honors gods such as Odin, Thor, and Freyja","zh":"信奉奥丁教（Odinism）的人；一种现代日耳曼／北欧异教复兴宗教的追随者，崇敬奥丁、索尔、芙蕾雅等神祇"},"examples":[{"en":"She describes herself as an Odinist and celebrates seasonal festivals rooted in Norse tradition.","zh":"她说自己是奥丁教的信徒，并庆祝源自北欧传统的季节性节日。"},{"en":"The museum talk included a Q&A with an Odinist about modern pagan practice.","zh":"博物馆讲座安排了问答环节，由一位奥丁教信徒谈现代异教实践。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Odinism or its followers","zh":"与奥丁教或其信徒有关的"},"examples":[{"en":"They met through an Odinist community group online.","zh":"他们通过一个奥丁教社群的线上小组认识的。"},{"en":"The article discussed Odinist beliefs and how they differ from mainstream religions.","zh":"这篇文章讨论了奥丁教的信仰，以及它与主流宗教的不同。"}]}],"synonyms":["Asatruer","Heathen (in modern pagan sense)","Norse pagan"],"phonetic":"/ˈoʊdɪnɪst/","extraExplanation":["“Odinism/奥丁教”常被用作现代北欧异教复兴（常见更宽泛的称呼是“Asatru/阿萨特鲁”或“heathenry/异教复兴”）的一种自称或外称；不同团体的信条与仪式差异很大。","文化语境提醒：在英语世界里，“Odinist/Odinism”有时会与某些极端主义或种族主义团体被混用或被媒体提及，但这并不代表所有自称奥丁教的个人或团体；理解时建议结合具体组织背景与其公开立场。"]}
{"word":"odinite","summary":{"en":"Odinite is a rare geological term for a green, iron‑ and magnesium‑rich clay mineral found in marine sediments.","zh":"Odinite 是地质学用语，指一种绿色、富含铁和镁、常见于海洋沉积物中的黏土矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a green clay mineral (a type of 1:1 phyllosilicate) rich in iron and magnesium, often found forming in marine sediments","zh":"一种绿色黏土矿物（1:1 层状硅酸盐），富含铁和镁，常在海洋沉积物环境中形成"},"examples":[{"en":"The geologist identified odinite in the green clay layer of the core sample.","zh":"地质学家在岩芯样品的绿色黏土层中鉴定出了奥丁石（odinite）。"},{"en":"Odinite can form in coastal marine sediments under specific chemical conditions.","zh":"在特定化学条件下，奥丁石可能在近岸海洋沉积物中形成。"}]}],"phonetic":"/ˈoʊdɪnaɪt/","extraExplanation":["“odinite”主要出现在地质学与矿物学语境中，日常英语里极少见；学习时可把它当作专有名词类的矿物名称来记。","名称常被解释为与北欧神话中的主神 Odin（奥丁）有关，可能因矿物呈绿色、像某些北欧地区常见的“绿泥/绿土”沉积而得名（具体命名来源在不同资料中表述不一）。"]}
{"word":"odinitic","summary":{"en":"Odinitic means “related to Odin” (often written as Odinic).","zh":"Odinitic 指“与奥丁有关的”（更常见写法为 Odinic）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Odin (also called Woden), a major god in Norse mythology; Odinic.","zh":"与奥丁（亦称沃登，北欧神话中的主神）有关的；奥丁式的（同 Odinic）。"},"examples":[{"en":"Some scholars discuss Odinitic themes in Viking-age poetry, such as wisdom, sacrifice, and fate.","zh":"一些学者会讨论维京时代诗歌中的“奥丁式”主题，例如智慧、牺牲与命运。"},{"en":"The novel uses Odinitic imagery—ravens, runes, and wandering—to create a Norse atmosphere.","zh":"这部小说运用“奥丁式”的意象——乌鸦、符文与流浪者形象——来营造北欧氛围。"}]}],"synonyms":["Odinic","Odin-related","Norse-mythological"],"phonetic":"/oʊdɪˈnɪtɪk/","extraExplanation":["“Odinitic”并不是非常常见的标准词形；在英语里更常见的是 **Odinic**（意为“与奥丁有关的”）。如果你在学术文章或奇幻作品里看到“Odinitic”，多半是作者的变体用法，含义通常与 Odinic 相同。","文化背景：奥丁在北欧神话中常与“智慧（以牺牲换取知识）”“诗歌与灵感”“战争与亡者”“乌鸦（Huginn 与 Muninn）”“符文”相关，因此描述这些意象时可能会用 Odinic/Odinitic 来修饰。"]}
{"word":"odiometer","summary":{"en":"An odometer is the meter in a vehicle that shows the total distance traveled.","zh":"odometer 指车辆上显示累计行驶距离的“里程表”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that measures and shows how far a vehicle (or machine) has traveled","zh":"（车辆或机器上的）里程表；测距表"},"examples":[{"en":"The car’s odometer reads 85,000 miles.","zh":"这辆车的里程表显示为8.5万英里。"},{"en":"Check the odometer to see how many miles you drove today.","zh":"看看里程表，了解你今天开了多少英里。"},{"en":"A high odometer reading can lower a used car’s value.","zh":"二手车里程表读数高可能会降低车的价值。"}]},{"partOfSpeech":"n.","definition":{"en":"a meter that measures distance traveled, used in some devices (for example, bikes or machinery)","zh":"（用于某些设备的）行程计；距离计"},"examples":[{"en":"The bike computer works like an odometer and records total distance.","zh":"这台自行车码表像里程表一样记录总里程。"},{"en":"Some factory machines have an odometer to track belt movement.","zh":"一些工厂机器有行程计来追踪传送带的运动距离。"}]}],"synonyms":["mileage counter","trip meter","distance meter"],"phonetic":"/oʊˈdɑːmɪtər/","extraExplanation":["你输入的 **odiometer** 多半是拼写误差；标准拼法是 **odometer**。这个词来自希腊语词根 *hodos*（路、旅程）+ *-meter*（测量器）。在英式英语中也常见拼法 **odometer**，含义相同。","日常口语里常把“里程表读数”说成 **mileage**（里程数）；但 **mileage** 指数字（里程），而 **odometer** 指仪表（装置）。"]}
{"word":"odious","summary":{"en":"“Odious” means extremely hateful or disgusting—something people strongly detest.","zh":"“odious”指“极其可憎、令人厌恶/憎恨的”，带强烈的道德谴责语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely unpleasant, hateful, or deeply disliked.","zh":"极其令人厌恶的；可憎的；令人憎恨的。"},"examples":[{"en":"Many people found the dictator’s odious policies cruel and unfair.","zh":"很多人认为独裁者那些可憎的政策既残酷又不公平。"},{"en":"She resigned rather than take part in an odious scheme.","zh":"她宁愿辞职，也不愿参与一个令人厌恶的计划。"},{"en":"Racist comments are odious and have no place in public discussion.","zh":"种族主义言论令人憎恶，不应出现在公共讨论中。"}]}],"synonyms":["hateful","repulsive","disgusting","abhorrent","contemptible","detestable"],"phonetic":"/ˈoʊdiəs/","extraExplanation":["“odious”语气很强，常用于正式或书面语，表示“令人憎恶到道德上无法接受”，比“unpleasant / bad”更重。","常见搭配：odious crime（可憎的罪行）, odious behavior（可憎的行为）, odious regime（可憎的政权）, odious smell（难闻到令人作呕的气味，较少见但可用）。","词源来自拉丁语 *odium*（憎恨、怨恨），与“odium（n. 憎恨）”同源。写作中用它能强调强烈的道德谴责。"]}
{"word":"odiously","summary":{"en":"“Odiously” means “in a very hateful or offensive way.”","zh":"“odiously”表示“以令人憎恶或冒犯的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very unpleasant, offensive, or hateful way; in a way that makes people strongly dislike something or someone.","zh":"以令人厌恶、冒犯或可憎的方式；让人强烈反感地。"},"examples":[{"en":"He treated his employees odiously, so many of them quit.","zh":"他以令人厌恶的方式对待员工，所以很多人辞职了。"},{"en":"The policy was enforced odiously, with needless cruelty.","zh":"这项政策被以可憎的方式执行，带着不必要的残酷。"}]}],"synonyms":["hatefully","offensively","disgustingly","repulsively"],"phonetic":"/ˈoʊdiəsli/","extraExplanation":["“odiously”来自形容词“odious”（可憎的、令人厌恶的）。常用于较正式或书面语，强调的是“引起强烈道德或情感反感”的程度，语气比“badly / unpleasantly（糟糕地/令人不快地）”更强。","常见搭配：act odiously（行为可憎）、treat someone odiously（以可憎的方式对待某人）、odiously unfair（不公正得令人厌恶）。","在文学或评论性写作中，它常用来表达对行为、制度、偏见或权力滥用的强烈谴责。"]}
{"word":"odiousness","summary":{"en":"Odiousness means the quality of being extremely hateful or disgusting.","zh":"odiousness 指“极其令人厌恶、可憎”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being extremely unpleasant, hateful, or strongly disliked","zh":"令人憎恶；可憎（的特质）"},"examples":[{"en":"People criticized the policy for its odiousness and unfairness.","zh":"人们批评这项政策可憎而且不公平。"},{"en":"The odiousness of his racist comments shocked the audience.","zh":"他那些带有种族歧视的言论之可憎让观众震惊。"}]}],"synonyms":["hatred","repulsiveness","loathsomeness","vileness","disgust"],"phonetic":"/ˈoʊdiəsnəs/","extraExplanation":["“odiousness”来自形容词“odious”（可憎的、令人厌恶的）加名词后缀“-ness”（表示“……的性质/状态”）。在正式写作里更常见的是用“odious”直接修饰名词（如 odious behavior/odious crime），而“odiousness”用来强调“这种可憎的程度或性质”。","常见搭配：the odiousness of + 名词/从句（……的可憎之处）。语气很强，通常用于道德谴责或严肃批评的语境。"]}
{"word":"odiousnesses","summary":{"en":"“Odiousnesses” means multiple hateful or offensive qualities/instances (plural of “odiousness”).","zh":"“odiousnesses”指多种/多次“可憎、令人反感”的性质或表现（“odiousness”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the unpleasant qualities of being extremely hateful, offensive, or morally disgusting (plural of “odiousness”)","zh":"“odiousness”的复数：极其可憎、令人反感或在道德上令人厌恶的特质（复数）"},"examples":[{"en":"The article lists the odiousnesses of the policy—its cruelty, unfairness, and lack of transparency.","zh":"这篇文章列出了该政策的种种可憎之处——残酷、不公以及缺乏透明度。"},{"en":"She was shocked by the odiousnesses of his comments in the meeting.","zh":"她对他在会议上的那些令人作呕的言论感到震惊。"}]},{"partOfSpeech":"n.","definition":{"en":"multiple instances or acts that are hateful or offensive","zh":"多件可憎/冒犯性的事；多种令人厌恶的行为（复数）"},"examples":[{"en":"History records many odiousnesses committed in the name of power.","zh":"历史记载了许多以权力之名犯下的可憎行径。"},{"en":"They tried to move past the odiousnesses of the past and rebuild trust.","zh":"他们试图放下过去的种种丑恶之事，重建信任。"}]}],"synonyms":["hatefulness","offensiveness","repulsiveness","disgustingness","loathsomeness"],"phonetic":"ˈoʊdiəsnəsɪz","extraExplanation":["“odiousnesses”在现实英语中比较少见，因为“odiousness”多为不可数名词；当作者想强调“很多种/很多方面的可憎之处”时，才可能用复数来制造修辞效果。","词源提示：odious 来自拉丁语 odium（“憎恨”）；-ness 表示“性质/状态”。理解词根 odium 有助于记忆其核心含义：强烈的厌恶与憎恨。"]}
{"word":"odist","summary":{"en":"“Odist” isn’t a common English word; it’s usually a misspelling of “odontist” (dentist).","zh":"“odist”不是常见英语词；通常是“odontist（牙医）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or incomplete form of “odontist” (a dentist).","zh":"不是标准英语单词；多半是“odontist”（牙医/牙科医生）的拼写错误或未写完整。"},"examples":[{"en":"I think you meant “odontist,” not “odist.”","zh":"我觉得你想写的是“odontist”，不是“odist”。"},{"en":"Please check the spelling: “odontist” means a dentist.","zh":"请检查拼写：“odontist”表示牙医。"}]}],"synonyms":["odontist","dentist"],"phonetic":"ˈoʊdɪst","extraExplanation":["“odontist”来自词根“odonto-”，意为“牙”。在医学相关词汇里很常见，如“orthodontist（正畸医生）”。","如果你告诉我你想表达的句子或语境（比如看牙、预约医生等），我也可以帮你确认你要找的正确单词。"]}
{"word":"odists","summary":{"en":"“Odists” is the plural of “odist,” meaning people who write odes (formal praise poems). It’s a rare word in modern English.","zh":"“odists”是“odist”的复数，指写作颂诗（正式的赞美类抒情诗）的人；在现代英语中较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes or composes odes (formal lyric poems, often praising someone or something).","zh":"颂诗作者；写作（或创作）“颂歌/颂诗”（ode，常用于赞美人物或事物的抒情诗）的人。"},"examples":[{"en":"In the 1800s, some critics praised him as an odist with a talent for public praise.","zh":"在19世纪，一些评论家称赞他是位擅长公共颂扬的颂诗作者。"},{"en":"The young odist tried to imitate the grand style of classical odes.","zh":"这位年轻的颂诗作者试图模仿古典颂诗的宏大风格。"}]}],"synonyms":["ode writer","poet","lyric poet"],"phonetic":"/ˈoʊdɪsts/","extraExplanation":["“odist”比较少见，多数情况下人们会直接说“poet（诗人）”或“writer of odes（写颂诗的人）”。它来自“ode（颂诗）+ -ist（从事……的人）”。","“ode（颂诗）”在英语文学里很常见，例如济慈（John Keats）的《Ode to a Nightingale》（《夜莺颂》）等；不过现代日常语境里很少用“odist”来称呼作者。"]}
{"word":"odium","summary":{"en":"Odium is a formal noun meaning strong public hatred or the disgrace of being widely blamed.","zh":"Odium 是较正式的名词，指强烈的公众憎恶，或因被广泛指责而带来的恶名/耻辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"general or widespread hatred, strong dislike, or public hostility toward someone or something","zh":"（对某人/某事的）普遍憎恶、强烈反感；公众的敌意"},"examples":[{"en":"After the scandal, the politician became the target of public odium.","zh":"丑闻之后，这位政治人物成了公众憎恶的对象。"},{"en":"The policy drew odium from many citizens who felt it was unfair.","zh":"许多认为该政策不公平的市民对此产生了强烈反感。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being hated and condemned; disgrace that brings blame","zh":"被憎恨与谴责的处境；引来责难的耻辱/恶名"},"examples":[{"en":"He tried to shift the odium onto his assistant.","zh":"他试图把骂名推到助理身上。"},{"en":"The company accepted the odium of the decision and promised to change.","zh":"公司承担了这项决定带来的恶名，并承诺会改正。"}]}],"synonyms":["hatred","hostility","public anger","disgrace","infamy","opprobrium"],"phonetic":"ˈoʊdiəm","extraExplanation":["“odium”是较正式、书面语的词，常见搭配有：incur odium（招致憎恶/骂名）、arouse/attract odium（引起反感）、public odium（公众憎恶）。","词源来自拉丁语“odium”（憎恨）。在新闻报道、政治评论和学术写作中更常见，日常口语里人们更常用“hate”“public anger”“backlash”等表达。"]}
{"word":"odiumproof","summary":{"en":"Odiumproof means unlikely to attract public hatred or strong criticism.","zh":"Odiumproof 指“不易引发公愤或强烈批评的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Protected from (or unlikely to attract) public hatred, blame, or strong criticism; “safe from becoming unpopular.”","zh":"不易招致公愤/谴责的；不太会引发强烈反感或指责的；“不招骂的”。"},"examples":[{"en":"The senator tried to choose an odiumproof position on the issue.","zh":"那位参议员试图在这个议题上选择一个不易招致公愤的立场。"},{"en":"They designed the policy to be as odiumproof as possible by offering clear benefits to ordinary people.","zh":"他们把这项政策设计得尽量“不招骂”，因为给普通民众带来明确好处。"},{"en":"There is no truly odiumproof way to raise taxes.","zh":"提高税收这件事几乎不可能做到真正“不招骂”。"}]}],"synonyms":["uncontroversial","hard to criticize","safe","blameless","immune to criticism"],"phonetic":"/ˈoʊdiəmˌpruːf/","extraExplanation":["“odium”在英语里指“公愤、强烈的憎恶或谴责”（常见搭配：public odium）。在其后加上“‑proof”（像 waterproof 防水、fireproof 防火一样）表示“能防……、不受……影响”。因此“odiumproof”多见于政治评论、社论或较正式/讽刺的写作中，意思是“不会引发公愤的”。","拼写上也可能写作“odium-proof”（加连字符更常见）。属于比较少见的词，日常口语里更常用 “unlikely to attract criticism / not controversial / hard to criticize”。"]}
{"word":"odiums","summary":{"en":"“Odiums” means strong hatred or public disapproval (plural of “odium”).","zh":"“Odiums”表示强烈的憎恶或公众的反感与谴责（“odium”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of \"odium\": strong dislike and public disapproval that someone or something receives.","zh":"“odium”的复数：强烈的厌恶；（公众对某人/某事的）憎恶与谴责。"},"examples":[{"en":"The scandal brought odiums upon the politician and his party.","zh":"这起丑闻让那位政治人物和他的政党招致了公众的憎恶与谴责。"},{"en":"They tried to avoid the odiums that often follow unpopular decisions.","zh":"他们试图避免不受欢迎的决定常常带来的公众反感与指责。"}]}],"synonyms":["hatreds","disgust","public condemnation","disapproval","opprobrium"],"phonetic":"/ˈoʊdiəm/","extraExplanation":["“odium”是较正式的词，常用于写作或新闻评论，强调“被社会舆论厌恶/谴责”的感觉，而不仅是个人的“不喜欢”。","常见搭配：incur odium（招致憎恶/谴责）、bring odium on/upon sb（使某人蒙受憎恶/谴责）。"]}
{"word":"odling","summary":{"en":"“Odling” is usually Swedish for “cultivation/growing,” not a standard English word.","zh":"“Odling” 通常是瑞典语，意为“栽培/种植”，不是标准英语单词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Not a standard English word; most commonly a Swedish noun meaning “cultivation” (especially growing crops/plants), similar to “farming” or “growing.”","zh":"不是标准英语单词；更常见的是瑞典语名词，意思是“栽培/种植”（尤指农作物或植物），类似英语的 farming 或 growing。"},"examples":[{"en":"In Swedish, “odling” often refers to growing vegetables, like tomato cultivation.","zh":"在瑞典语中，odling 常指种蔬菜，比如“番茄的栽培/种植”。"},{"en":"If you see “odling” in an English text, it’s likely a Swedish term or a name, not an English vocabulary word.","zh":"如果你在英文文本里看到 odling，它很可能是瑞典语词或名字，而不是英语词汇。"}]}],"synonyms":["cultivation","growing","farming","horticulture"],"phonetic":"/ˈɔd.lɪŋ/","extraExplanation":["“Odling” 来自瑞典语动词 “odla”（种植、栽培）。在北欧语境里，它既可以指一般的农业种植，也常用于更具体的“园艺/蔬菜栽培”等。","如果你原本想查的是英文单词，可能是拼写接近的：oddly（奇怪地）、odling（人名/地名）、或 seedling（幼苗）。你可以告诉我你看到它的句子，我可以帮你判断。"]}
{"word":"odobenidae","summary":{"en":"Odobenidae is the scientific family name for the walrus and its close relatives.","zh":"Odobenidae 是海象及其近缘类群的科学分类“科”名（海象科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine mammals that includes the walrus (and its close relatives, mostly known from fossils).","zh":"海象科；一种海洋哺乳动物的科，包含海象（以及与海象近缘的物种，多见于化石记录）。"},"examples":[{"en":"The walrus belongs to the family Odobenidae.","zh":"海象属于海象科（Odobenidae）。"},{"en":"Researchers compare fossil Odobenidae to modern walruses to understand how tusks evolved.","zh":"研究人员把海象科的化石与现代海象作比较，以了解长牙是如何演化的。"}]}],"synonyms":["walrus family"],"phonetic":"/ˌoʊdoʊˈbɛnɪdi/","extraExplanation":["“Odobenidae”是生物分类学中的“科”（family）名，通常用于学术写作、动物学与古生物学语境。","词根来自拉丁化的科学命名：Odobenus 是海象的属名，-idae 表示“科”。Odobenus 源自希腊语，常被解释为与“用牙走/用牙攀爬”相关，指海象用獠牙帮助在冰面上移动。"]}
{"word":"odobenus","summary":{"en":"*Odobenus* is the scientific genus name for walruses, mainly the species *Odobenus rosmarus*.","zh":"*Odobenus*是海象的属名（学名），主要对应物种*Odobenus rosmarus*（海象）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large marine mammals known as walruses (family Odobenidae); in modern classification it mainly refers to the species *Odobenus rosmarus* (the walrus).","zh":"海象属（海象科）——一类大型海洋哺乳动物的属名；现代分类中主要指*Odobenus rosmarus*（海象）这一物种。"},"examples":[{"en":"In scientific writing, the walrus is classified as *Odobenus rosmarus*.","zh":"在科学写作中，海象被归类为*Odobenus rosmarus*。"},{"en":"Researchers compared skull measurements across pinnipeds, including *Odobenus*.","zh":"研究人员比较了鳍足类动物的头骨测量数据，其中包括海象属（*Odobenus*）。"}]}],"synonyms":["walrus (common name)","*Odobenus rosmarus* (species name)"],"phonetic":"/ˌoʊ.doʊˈbiː.nəs/","extraExplanation":["“Odobenus”是拉丁化的学名（属名），常见于生物学、动物学与博物馆标本标签中；日常英语里更常用“walrus（海象）”。","词源通常解释为与希腊语相关：odo(n)-（牙）+ bainō（行走），暗指海象会用长牙帮助自己在冰面或岸边移动。"]}
{"word":"odocoileus","summary":{"en":"Odocoileus is the scientific genus name for certain North American deer, including the white-tailed deer and mule deer.","zh":"Odocoileus 是若干北美鹿类（如白尾鹿、骡鹿/黑尾鹿）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of North American deer that includes the white-tailed deer and the mule deer.","zh":"（生物学）北美洲鹿类的一个属名，包括白尾鹿和黑尾／骡鹿等。"},"examples":[{"en":"The white-tailed deer belongs to the genus Odocoileus.","zh":"白尾鹿属于 Odocoileus（北美鹿属）。"},{"en":"Biologists compared DNA across Odocoileus populations to study migration patterns.","zh":"生物学家比较了不同 Odocoileus 种群的 DNA，以研究迁徙模式。"}]}],"synonyms":["deer (general)","white-tailed deer (Odocoileus virginianus)","mule deer (Odocoileus hemionus)"],"phonetic":"/ˌoʊdoʊsaɪˈliːəs/","extraExplanation":["这是一个拉丁化的科学属名，常见于野生动物学、生态学与猎管法规等语境中；日常英语里更常直接说 white-tailed deer（白尾鹿）或 mule deer（骡鹿/黑尾鹿）。","词源来自希腊语成分，常被解释为与“牙齿（odous/odont-)”和“空/凹（koilos）”相关，用来描述这类鹿的某些牙齿结构特征。","读音在英语中可能有轻微差异；学习时重点掌握重音通常落在最后一部分（-LEE-us）。"]}
{"word":"odograph","summary":{"en":"An odograph is a device that measures and records distance traveled, much like an odometer.","zh":"odograph 指测量并记录行驶距离的装置，类似里程表（odometer）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument that measures and records the distance traveled by a vehicle (often using the vehicle’s wheel movement).","zh":"里程记录仪；测程仪（用来测量并记录车辆行驶距离的装置，常通过车轮转动来计算）。"},"examples":[{"en":"The truck’s odograph showed it had traveled over 200,000 miles.","zh":"这辆卡车的里程记录仪显示它已经行驶了20多万英里。"},{"en":"Before the trip, the mechanic checked the odograph to confirm the mileage.","zh":"出发前，技师查看了测程仪以确认里程数。"}]},{"partOfSpeech":"n.","definition":{"en":"A device that measures distance traveled (especially in older or technical writing), similar to an odometer.","zh":"测距仪（尤用于较旧或技术性写法中），类似于“里程表/里程计”。"},"examples":[{"en":"Early engineers described an odograph for measuring distance on rough roads.","zh":"早期工程师曾描述一种用于在崎岖道路上测距的测距仪。"}]}],"synonyms":["odometer","distance recorder","mileometer"],"phonetic":"/ˈoʊdəˌɡræf/","extraExplanation":["“odograph”来自希腊语词根：odo-（路/行走）+ -graph（写/记录）。字面意思是“把走过的路记录下来”。","现代日常英语中更常用的是“odometer”（里程表）。在历史或技术语境里，odograph也可能指更早期的机械测距装置。"]}
{"word":"odographs","summary":{"en":"Odographs are devices that measure and record distance traveled, similar to odometers, often in older or formal contexts.","zh":"Odographs 指测量并记录行驶距离的装置，类似里程表，但多用于较旧或较正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that measures and records the distance traveled by a vehicle (similar to an odometer), especially in older or formal usage.","zh":"（尤指较旧或较正式用法）测量并记录车辆行驶距离的装置；类似“里程表”。"},"examples":[{"en":"The old carriage had an odograph to record how far it traveled.","zh":"那辆老式马车装有一只测程仪，用来记录行驶了多远。"},{"en":"In the museum, we saw an odograph used for early road surveys.","zh":"在博物馆里，我们看到了早期道路测量用的测程仪。"}]}],"synonyms":["odometer","mileometer","distance meter"],"phonetic":"/ˈoʊdəˌɡræf/","extraExplanation":["“Odograph”来自希腊语词根：hodos（路、行程）+ graphein（写、记录），字面意思是“记录行程的东西”。","现代日常英语更常用“odometer（里程表）”。“Odograph”多见于历史、工程或较正式的语境中。"]}
{"word":"odology","summary":{"en":"“(O)dology” is very rare alone; it usually appears as “-ology,” meaning “the study/science of.”","zh":"“(o)dology”很少单独使用；通常以“-ology”形式出现，表示“……的研究/……学”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) the study of something; used mainly as part of longer words to mean “the study/science of.”","zh":"（不常单独使用）……的研究/学科；多作为后缀出现在较长的词中，表示“……学”。"},"examples":[{"en":"In words like “biology,” “-ology” means “the study of life.”","zh":"在“biology（生物学）”这样的词里，“-ology”表示“对生命的研究”。"},{"en":"Geology and psychology are both “-ology” words, meaning fields of study.","zh":"geology（地质学）和 psychology（心理学）都属于“-ology”结尾的词，表示不同的学科。"}]}],"synonyms":["the study of","the science of","field of study"],"phonetic":"/oʊˈdɑːlədʒi/","extraExplanation":["“odology”本身在现代英语中几乎不会作为一个独立单词使用；学习时更常把它当作后缀 “-ology”。","“-ology”来自希腊语，常见于学科名称：biology（生物学）、geology（地质学）、psychology（心理学）、sociology（社会学）等。","如果你是在写“methodology（方法论）”或“terminology（术语体系）”但只输入了“odology”，那很可能是拼写/截断导致的；可以告诉我你想表达的完整词，我可以进一步解释。"]}
{"word":"odometer","summary":{"en":"An odometer is a vehicle instrument that shows the total distance traveled.","zh":"odometer 指车辆上的里程表，用来显示行驶的总距离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device in a vehicle that shows how far it has traveled, usually in miles or kilometers.","zh":"（汽车等的）里程表；用于显示车辆行驶的总距离（通常以英里或公里计）。"},"examples":[{"en":"The odometer reads 65,000 miles, so the car isn’t brand-new.","zh":"里程表显示 6.5 万英里，所以这辆车并不是全新的。"},{"en":"Check the odometer before you buy a used car.","zh":"买二手车前要检查里程表。"},{"en":"The rental company charges extra if you go over the mileage on the odometer.","zh":"如果里程表显示你超出规定里程，租车公司会加收费用。"}]}],"synonyms":["mileage counter","mileometer"],"phonetic":"/oʊˈdɑːmɪtər/","extraExplanation":["“Odometer”由希腊语词根组成：hodos（道路）+ metron（测量），字面意思是“测路的仪器”。","在美国常见说法是“mileage”（里程）和“odometer reading”（里程表读数）。二手车交易中还会提到“odometer fraud / odometer tampering”（调表/里程表造假），属于违法行为。","相关词：speedometer（速度表，显示车速）；trip meter / trip odometer（小计里程表，显示某次行程的距离，可清零）。"]}
{"word":"odometers","summary":{"en":"Odometers are instruments that measure and record the distance traveled, most commonly in vehicles.","zh":"odometers 指测量并记录行驶距离的仪表，最常见于汽车等车辆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device in a vehicle that measures and records the total distance traveled","zh":"（车辆上的）里程表；里程计，用来测量并记录行驶的总距离"},"examples":[{"en":"The car’s odometer shows 85,000 miles.","zh":"这辆车的里程表显示 85,000 英里。"},{"en":"Check the odometer reading before you buy a used car.","zh":"买二手车前先看看里程表读数。"}]},{"partOfSpeech":"n.","definition":{"en":"a device that measures distance traveled (for example on a bicycle, treadmill, or phone app)","zh":"（广义）测距器：测量行进距离的装置（如自行车、跑步机或手机应用）"},"examples":[{"en":"My bike has a digital odometer.","zh":"我的自行车有一个数字里程表。"},{"en":"The treadmill odometer says I ran 3 miles.","zh":"跑步机的里程计显示我跑了 3 英里。"}]}],"synonyms":["mileage meter","distance meter"],"phonetic":"/oʊˈdɑːmɪtər/","extraExplanation":["“odometer”来自希腊语：hodos（路、行程）+ metron（测量），字面意思就是“测量路程的东西”。","日常里常见搭配：odometer reading（里程读数）、mileage（里程/里程数）。买二手车时也会提到 odometer fraud / rollback（里程表造假/调表）。"]}
{"word":"odometrical","summary":{"en":"Odometrical means “related to an odometer or to measuring distance traveled.”","zh":"odometrical 意为“与里程表有关的；与测量行驶距离有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an odometer (a device that measures the distance a vehicle travels).","zh":"与里程表有关的（里程表是测量车辆行驶距离的装置）。"},"examples":[{"en":"The mechanic checked the car’s odometrical reading before the test drive.","zh":"技师在试驾前检查了汽车的里程表读数。"},{"en":"Odometrical data can help track how much a fleet of trucks is used.","zh":"里程表相关数据可以帮助追踪一支卡车车队的使用频率与里程。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to measuring distance traveled, especially by using wheel rotations or similar methods.","zh":"与测量行程距离有关的（尤指通过车轮转数等方式测量）。"},"examples":[{"en":"The researchers compared GPS results with odometrical measurements from the bike’s sensor.","zh":"研究人员把 GPS 的结果与自行车传感器的里程测量结果作比较。"},{"en":"In older equipment, odometrical methods were sometimes less accurate on rough roads.","zh":"在较旧的设备中，里程测量法在颠簸路面上有时不太准确。"}]}],"synonyms":["odometric","odometer-related","distance-measuring"],"phonetic":"/ˌoʊdəˈmɛtrɪkəl/","extraExplanation":["“odometrical”较少见，更常见的形容词是“odometric”。两者意思基本相同，都表示“与里程表/里程测量有关”。","词源上与希腊语有关：hodos（路、行程）+ metron（测量）。因此它的核心含义就是“测量路程”。"]}
{"word":"odometries","summary":{"en":"Odometries is the plural of odometry: methods or measurements used to calculate distance traveled, often for vehicles or robots.","zh":"odometries 是 odometry 的复数：指用于计算行驶距离的多种方法或多组测量数据，常见于车辆与机器人领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science or practice of measuring distance traveled (especially by a vehicle), usually using an odometer","zh":"测程学；里程测量（尤指用里程表测量车辆行驶距离的技术或方法）"},"examples":[{"en":"Accurate odometry helps a car’s navigation system estimate how far it has traveled.","zh":"准确的里程测量能帮助汽车导航系统估算行驶了多远。"},{"en":"Robots often combine wheel odometry with cameras or GPS to improve accuracy.","zh":"机器人常把轮式里程测量与摄像头或 GPS 结合，以提高精度。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) multiple systems, methods, or sets of odometry measurements","zh":"（复数）多种里程测量系统/方法；多组里程测量数据"},"examples":[{"en":"Researchers compared different odometries to see which performed best on rough terrain.","zh":"研究人员比较了不同的里程测量方法，看哪种在崎岖地形上表现最好。"},{"en":"The paper reports odometries from several sensors collected during the test drive.","zh":"论文报告了试驾过程中多个传感器采集的里程测量数据。"}]}],"synonyms":["distance measurement","mileage measurement","dead reckoning (related)","path-length estimation (related)"],"phonetic":"/oʊˈdɑːmətri/","extraExplanation":["“odometry”来自希腊语词根：hodos（道路）+ metron（测量）。在机器人与自动驾驶领域里，odometry 常指通过车轮转动、惯性传感器等推算“位姿/行进距离”的方法，因此复数 odometries 常用于对比不同算法或不同传感器来源的里程估计。"]}
{"word":"odometry","summary":{"en":"Odometry means measuring distance traveled, and in robotics it also refers to estimating position by tracking motion over time.","zh":"Odometry 指“行程/里程的测量”；在机器人领域也指通过持续跟踪运动来估计位置的“里程计定位”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of distance traveled, especially by a vehicle, using an odometer or similar device","zh":"里程测量；测距（尤指用里程表等装置测量车辆行驶距离）"},"examples":[{"en":"The car’s odometry showed it had traveled 120,000 miles.","zh":"这辆车的里程测量数据显示它已经行驶了12万英里。"},{"en":"Researchers used wheel odometry to estimate how far the robot moved.","zh":"研究人员用车轮里程测量来估算机器人移动了多远。"}]},{"partOfSpeech":"n.","definition":{"en":"a method in robotics and navigation for estimating position by tracking motion over time (for example, from wheel rotations or step counts)","zh":"（机器人/导航）里程计定位法：通过跟踪一段时间内的运动来估计位置（如根据车轮转数或步数）"},"examples":[{"en":"Odometry can drift over time, so the robot also uses GPS and cameras.","zh":"里程计定位法会随时间产生累积误差，所以机器人还会使用GPS和摄像头。"},{"en":"Your phone combines accelerometer data with other sensors for odometry-like tracking.","zh":"你的手机会把加速度计数据与其他传感器结合起来，进行类似里程计的追踪。"}]}],"synonyms":["mileage measurement","distance measurement","dead reckoning (related)"],"phonetic":"/oʊˈdɑːmətri/","extraExplanation":["词源提示：odometry 来自希腊语 hodos（“道路/行程”）+ metron（“测量”），字面意思就是“测量行程”。","常见搭配：wheel odometry（轮式里程计）、visual odometry（视觉里程计，利用摄像头图像估算运动）、odometry error/drift（里程误差/漂移）。"]}
{"word":"odonata","summary":{"en":"Odonata is the scientific name for the insect order that includes dragonflies and damselflies.","zh":"Odonata 是“蜻蜓目”的学名，包含蜻蜓与豆娘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of insects that includes dragonflies and damselflies","zh":"蜻蜓目（昆虫的一个目，包含蜻蜓与豆娘）"},"examples":[{"en":"Dragonflies and damselflies belong to the order Odonata.","zh":"蜻蜓和豆娘都属于蜻蜓目（Odonata）。"},{"en":"Scientists study Odonata to understand the health of rivers and ponds.","zh":"科学家研究蜻蜓目昆虫，以了解河流和池塘的生态健康。"}]}],"synonyms":["dragonflies and damselflies","odonates"],"phonetic":"/ˌoʊdəˈnɑːtə/","extraExplanation":["“Odonata”常用于生物学与生态学语境，是正式的分类学名称；日常英语更常说“dragonflies and damselflies（蜻蜓和豆娘）”。","词源来自希腊语与“牙齿”有关（指它们强壮的口器/颚部），因此在一些资料里会提到其“有齿的”含义。","蜻蜓目幼虫多生活在淡水中（如池塘、溪流），对水质变化较敏感，所以常被用作环境指示生物。"]}
{"word":"odonate","summary":{"en":"Donate means to give money, goods, or time to help a cause, or to give blood/organs for medical use.","zh":"donate 指为公益捐赠钱物或时间，也可指献血或捐献器官。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give money, goods, or time to help a person or organization (often for a good cause)","zh":"（常为公益目的）捐赠；捐献（钱、物或时间）"},"examples":[{"en":"Many people donate to charities after natural disasters.","zh":"自然灾害发生后，很多人会向慈善机构捐款。"},{"en":"She donates her time on weekends to teach children.","zh":"她周末捐出时间去教孩子。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give something (especially blood or organs) for medical use","zh":"（尤指）捐献（血液或器官）供医疗使用"},"examples":[{"en":"He donates blood every three months.","zh":"他每三个月献一次血。"},{"en":"She chose to donate her kidney to her sister.","zh":"她选择把肾捐给姐姐。"}]}],"synonyms":["give","contribute","donate blood","make a donation"],"phonetic":"/ˈdoʊneɪt/","extraExplanation":["你输入的“odonate”很可能是拼写错误，正确拼写通常是 donate。","donate 常搭配：donate money/food/clothes（捐钱/捐食物/捐衣物），donate to + 组织（捐给某组织），donate blood（献血），donate an organ（捐器官）。","语气区别：donate 比 give 更正式，常用于慈善与公益语境；也可以说 make a donation（进行捐赠）。"]}
{"word":"odonates","summary":{"en":"“Odonates” is the plural of “odonate,” meaning dragonflies and damselflies (order Odonata).","zh":"“odonates”是“odonate”的复数，指蜻蜓和豆娘等蜻蜓目（Odonata）的昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dragonfly or damselfly; any insect belonging to the order Odonata.","zh":"蜻蜓或豆娘；泛指蜻蜓目（Odonata）的昆虫。"},"examples":[{"en":"Dragonflies and damselflies are both odonates.","zh":"蜻蜓和豆娘都属于蜻蜓目（odonates）。"},{"en":"We saw several odonates hovering over the pond.","zh":"我们看到好几只蜻蜓目昆虫在池塘上方盘旋。"}]}],"synonyms":["dragonflies and damselflies","Odonata"],"phonetic":"/ˈoʊdəˌneɪt/","extraExplanation":["你输入的“odonates”通常是名词复数，单数是“odonate”。在生物分类里，Odonata（蜻蜓目）包含两大常见类群：dragonflies（蜻蜓）和 damselflies（豆娘）。","词源来自希腊语 odōn（“牙齿”），指它们口器有明显的“齿状”结构；不过日常英语里更常直接说 dragonfly / damselfly，而不是 odonate。"]}
{"word":"odont","summary":{"en":"“odont” is a technical word part meaning “tooth,” usually seen as the prefix odont- in scientific terms.","zh":"“odont”多作为技术性构词成分使用，意为“牙/齿”，常以前缀 odont- 出现在科学术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(in scientific/technical words) tooth; relating to teeth (a combining form, often written odont-).","zh":"（用于科学/技术词汇的构词成分）“牙、齿”；与牙齿有关（常写作 odont-）。"},"examples":[{"en":"The prefix odont- appears in words like odontologist (a tooth specialist).","zh":"前缀 odont- 常见于 odontologist（牙科/牙齿相关专家）这类词中。"},{"en":"Odontology is the study of teeth.","zh":"Odontology 指“牙科学/牙齿研究”。"},{"en":"Some fish are described as having odontodes, small tooth-like structures.","zh":"有些鱼类会提到 odontode，指小型“类牙结构”。"}]}],"synonyms":["odont-","dento-"],"phonetic":"/oʊˌdɑnt/","extraExplanation":["“odont”本身在日常英语里几乎不单独使用，更常见的是作为构词成分 odont-（来自希腊语 odous/odont-，意思是“牙”）。","常见相关词：odontology（牙科学/牙齿研究）、odontologist（牙科学者/牙科专家）、orthodontics（正畸学）、periodontics（牙周病学）、mastodon（乳齿象：字面含“乳头状的牙”，是词源趣谈）。"]}
{"word":"odontagra","summary":{"en":"Odontagra is an old, rare word for severe toothache, historically associated with gout.","zh":"Odontagra 是一个较古旧、罕见的词，指剧烈牙痛，历史上曾与痛风相关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a severe toothache, especially one once believed to be caused by gout (an old medical term).","zh":"（古老医学用语）牙痛，尤指过去认为由痛风引起的剧烈牙痛。"},"examples":[{"en":"The patient complained of odontagra that kept him awake all night.","zh":"病人抱怨剧烈的牙痛（odontagra），整夜无法入睡。"},{"en":"In older medical writing, odontagra was sometimes linked to gouty inflammation.","zh":"在较早的医学文献中，odontagra 有时被认为与痛风性炎症有关。"}]}],"synonyms":["toothache","dental pain"],"phonetic":"/ˌoʊdənˈtæɡrə/","extraExplanation":["词源来自希腊语：odonto-（牙）+ agra（“抓住、发作”，常见于 podagra“足痛风”）。因此它带有“像被发作抓住一样的疼痛”的形象含义。","这是偏古旧、罕见的词，现代英语更常用 toothache 或 dental pain；在历史医学语境（旧病历、古典医学书写）中更可能出现。"]}
{"word":"odontalgia","summary":{"en":"Odontalgia is the medical term for a toothache or tooth pain.","zh":"odontalgia 是“牙痛/牙齿疼痛”的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toothache; pain in a tooth or the teeth","zh":"牙痛；牙齿或牙周部位的疼痛"},"examples":[{"en":"I couldn’t sleep because of severe odontalgia.","zh":"因为严重的牙痛，我睡不着。"},{"en":"The dentist asked when the odontalgia started and whether it got worse with cold drinks.","zh":"牙医问牙痛什么时候开始的，以及喝冷饮时会不会加重。"}]}],"synonyms":["toothache","tooth pain","dental pain"],"phonetic":"/ˌoʊdənˈtældʒə/","extraExplanation":["这是一个医学用语，比较正式：odont- 来自希腊语，意思是“牙”；-algia 表示“疼痛”（如 neuralgia 神经痛）。日常英语更常说 toothache。","在医疗场景里，医生可能用 odontalgia 来描述“症状”（牙痛），但“原因”可能是龋齿、牙髓炎、牙龈感染或智齿问题等。疼痛位置与诱因（冷、热、咬合）常用来帮助判断病因。"]}
{"word":"odontalgic","summary":{"en":"“Odontalgic” is a medical adjective meaning related to or causing toothache.","zh":"“odontalgic”是医学用语的形容词，表示“与牙痛有关的/引起牙痛的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, causing, or characterized by toothache (dental pain).","zh":"与牙痛有关的；引起牙痛的；以牙痛为特征的。"},"examples":[{"en":"The patient reported odontalgic pain that worsened at night.","zh":"患者表示有牙痛性疼痛，并在夜间加重。"},{"en":"Cold drinks can trigger odontalgic symptoms when a tooth is sensitive.","zh":"当牙齿敏感时，冷饮可能会诱发牙痛相关症状。"}]}],"synonyms":["toothache-related","dental-pain","odontogenic (related, but often means originating from a tooth)"],"phonetic":"/ˌoʊ.dənˈtæl.dʒɪk/","extraExplanation":["这是一个较少见、偏医学书面语的形容词，常见于病历、牙科说明或学术写作。","词源上可拆解为：odonto-（牙）+ -algic（疼痛的），因此整体意思就是“与牙痛有关的”。日常英语里更常说：toothache / dental pain / tooth pain。"]}
{"word":"odontaspidae","summary":{"en":"Odontaspidae is the scientific name for the shark family that includes sand tiger sharks.","zh":"Odontaspidae 是沙虎鲨科的学名，包含沙虎鲨等鲨类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of sharks that includes the sand tiger sharks (large, grayish sharks often seen near coasts).","zh":"鲨科之一：沙虎鲨科（包含沙虎鲨等，常见于近海的大型灰色鲨鱼）。"},"examples":[{"en":"The sand tiger shark belongs to the family Odontaspidae.","zh":"沙虎鲨属于沙虎鲨科（Odontaspidae）。"},{"en":"Researchers compared the teeth of Odontaspidae with those of other shark families.","zh":"研究人员将沙虎鲨科的牙齿与其他鲨鱼科进行了比较。"}]}],"synonyms":["sand tiger shark family","sand tiger sharks (common name)"],"phonetic":"/ˌoʊdɑnˈtæspɪdiː/","extraExplanation":["这是一个生物分类学术语（科名）。在现代分类中，常见的英文俗名是 sand tiger sharks（沙虎鲨类）。","词源上可拆解为 odonto-（与“牙齿”有关）+ -idae（动物“科”的拉丁化后缀），因此常与“牙齿特征”相关的分类描述联系在一起。"]}
{"word":"odontaspididae","summary":{"en":"Odontaspididae is the scientific family name for certain lamniform sharks, especially sand tiger sharks.","zh":"Odontaspididae 是某些鼠鲨目鲨鱼（尤其沙虎鲨）的科学“科”名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mackerel sharks (order Lamniformes) that includes the sand tiger sharks, known for their long, narrow snouts and prominent, needle-like teeth","zh":"（软骨鱼类）鼠鲨目的一科，包含沙虎鲨等类群，常见特征是吻部较长、牙齿细长而尖"},"examples":[{"en":"The sand tiger shark is often discussed in relation to the family Odontaspididae in older classifications.","zh":"在较早的分类体系中，沙虎鲨常被放在 Odontaspididae（齿鼠鲨科）下讨论。"},{"en":"Researchers compared tooth shapes across Lamniformes, including Odontaspididae, to understand feeding habits.","zh":"研究者比较了鼠鲨目各类群（包括 Odontaspididae）的牙齿形态，以了解其摄食习性。"}]}],"synonyms":["sand tiger sharks (common-name context)"],"phonetic":"/ˌoʊdɑnˌtæspɪˈdaɪdi/","extraExplanation":["这是一个生物分类学名词，常用于学术写作或科普资料中；日常英语里更常说“sand tiger sharks（沙虎鲨）”而不是直接用科名。","词源可拆解为：odonto-（牙）+ aspis（古希腊语，常指“盾/鳞板”，在动物学命名中也用于构词）+ -idae（动物科名的标准后缀，表示“……科”）。","不同资料对沙虎鲨的“科级归属”可能有差异（分类学会随着研究更新而调整），阅读时可留意所采用的分类体系与年代。"]}
{"word":"odontaspis","summary":{"en":"Odontaspis is a scientific genus name for certain sand tiger–type sharks.","zh":"Odontaspis 是某些沙虎鲨类鲨鱼的科学属名（齿鲨属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mackerel sharks (family Odontaspididae), including the bigeye sand tiger and related species; used mainly in scientific naming.","zh":"（动物学）齿鲨属：鼠鲨目（或称鲭鲨目）齿鲨科的一属，包含“大眼沙虎鲨”等物种；主要用于科学命名。"},"examples":[{"en":"Odontaspis noronhai is commonly called the bigeye sand tiger.","zh":"Odontaspis noronhai 通常被称为“大眼沙虎鲨”。"},{"en":"In older sources, some sand tiger sharks were placed in the genus Odontaspis.","zh":"在较早的资料中，一些沙虎鲨曾被归入齿鲨属（Odontaspis）。"}]}],"synonyms":["sand tiger shark (related common name)","Odontaspididae (family name)","Carcharias (related genus)"],"phonetic":"/oʊˌdɑːn.təˈspɪs/","extraExplanation":["这是拉丁化的科学属名，常见于生物学论文、物种名（双名法）和分类数据库里，日常英语中很少单独使用。","词源上可拆解为希腊语 odonto-（“牙、齿”）+ aspis（“盾”或“蛇”一类的词根），用来暗示其“牙齿显著”的特征；属名的历史分类也曾有调整，因此不同年代的文献可能会出现归属差异。"]}
{"word":"odontatrophia","summary":{"en":"Odontatrophia is a rare medical term meaning atrophy (wasting) of the teeth.","zh":"Odontatrophia 是一个较少使用的医学术语，意思是牙齿萎缩（退化、逐渐变小）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) atrophy or wasting away of the teeth (a rare term).","zh":"（医学）牙齿萎缩；牙体逐渐变小或退化（较少用的术语）。"},"examples":[{"en":"The old report mentioned odontatrophia, describing teeth that had gradually become smaller over time.","zh":"那份旧报告提到 odontatrophia，描述牙齿随着时间逐渐变小。"},{"en":"In modern dentistry, clinicians would usually describe the problem more specifically rather than using the term odontatrophia.","zh":"在现代牙科中，临床通常会更具体地描述问题，而不会使用 odontatrophia 这个词。"}]}],"synonyms":["tooth atrophy","dental atrophy"],"phonetic":"/oʊˌdɑn.təˈtroʊ.fi.ə/","extraExplanation":["词源提示：odonto- 表示“牙”，-atrophia 表示“萎缩/营养不良”。在当代英文牙科写作中更常见的是用更具体的表达，例如 tooth atrophy、dental atrophy，或直接描述为磨耗（wear/attrition）、酸蚀（erosion）、吸收（resorption）等。"]}
{"word":"odontatrophy","summary":{"en":"A rare medical term meaning atrophy or wasting away of teeth/tooth tissue.","zh":"一个较少见的医学术语，指牙齿或牙组织的萎缩、退化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the wasting away or abnormal shrinking of teeth or tooth tissue; dental atrophy.","zh":"牙萎缩；牙齿或牙组织的退化、变小（牙齿萎缩）。"},"examples":[{"en":"The dentist noted signs of odontatrophy in the damaged molar.","zh":"牙医在那颗受损的臼齿上观察到牙萎缩的迹象。"},{"en":"In older medical writing, odontatrophy was sometimes linked to poor nutrition or long-term illness.","zh":"在较早的医学文献中，牙萎缩有时被认为与营养不良或长期疾病有关。"}]}],"synonyms":["dental atrophy","tooth atrophy"],"phonetic":"ˌoʊdən.təˈtroʊfi","extraExplanation":["这是一个非常少见、偏医学/牙科的术语，日常英语几乎不用。现代临床描述通常更常见的是用更具体的表达，例如“tooth wear（牙齿磨耗）”、“enamel loss（釉质丧失）”、“root resorption（牙根吸收）”或“tooth atrophy（牙齿萎缩）”。","词源构成：odonto- 表示“牙”（来自希腊语 odous/odont-），-atrophy 表示“萎缩/消耗”。理解词根有助于猜测含义：= 牙 + 萎缩。"]}
{"word":"odontexesis","summary":{"en":"Odontogenesis means the biological process of tooth formation and development.","zh":"Odontogenesis 指牙齿在生物学上的形成与发育过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of forming and developing teeth (especially in an embryo or child)","zh":"牙齿发生；牙齿的形成与发育过程（尤指胚胎或儿童期）"},"examples":[{"en":"Researchers study odontogenesis to understand how teeth and jaws develop before birth.","zh":"研究人员研究牙齿发生，以了解出生前牙齿和颌骨如何发育。"},{"en":"Problems during odontogenesis can lead to missing teeth or enamel defects.","zh":"牙齿发生过程中的异常可能导致缺牙或釉质缺陷。"}]}],"synonyms":["tooth development","tooth formation"],"phonetic":"/ˌoʊ.dɑn.təˈdʒɛn.ə.sɪs/","extraExplanation":["你输入的 **odontexesis** 不是常见的标准英文医学词（很可能是拼写或听写误差）。在牙科/发育生物学里，最接近、最常用的术语是 **odontogenesis**（牙齿发生）。","词源小提示：**odonto-** 来自希腊语，表示“牙”；**-genesis** 表示“生成、起源”。所以 odontogenesis 字面意思就是“牙的生成”。","相关词可对照记忆：**amelogenesis**（釉质形成）、**dentinogenesis**（牙本质形成）、**tooth eruption**（牙齿萌出，指牙长出来的阶段，不等同于形成过程）。"]}
{"word":"odontia","summary":{"en":"Odontia is a medical/dental term for the condition or development of the teeth (dentition). In older usage, it can mean toothache.","zh":"Odontia 是医学/牙科用语，指牙齿的状态或发育（齿列）。旧用时也可指牙痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine/Dentistry) The condition, development, or arrangement of the teeth; dentition.","zh":"（医学/牙科）牙齿的状态、发育或排列；齿列（相当于 dentition）。"},"examples":[{"en":"The dentist noted that the child’s odontia was developing normally for her age.","zh":"牙医指出，这个孩子的牙齿发育（齿列）符合她的年龄。"},{"en":"Problems in odontia can affect chewing and speech.","zh":"牙齿状态（齿列）出现问题会影响咀嚼和发音。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) Toothache; pain in a tooth.","zh":"（罕见/旧用）牙痛；牙齿疼痛。"},"examples":[{"en":"In older medical writing, “odontia” sometimes referred to severe tooth pain.","zh":"在较早的医学文献中，“odontia”有时指严重的牙痛。"}]}],"synonyms":["dentition","toothache (rare sense)"],"phonetic":"/oʊˈdɑnʃə/","extraExplanation":["“odontia”来自希腊语词根 odont-（意为“牙”）。它在现代英语里更常作为构词成分出现，而不是单独使用，例如：anodontia（先天缺牙/无牙）、hyperdontia（多生牙）、hypodontia（少牙）。因此你在牙科或医学语境中更容易见到这些派生词。"]}
{"word":"odontiasis","summary":{"en":"Odontiasis is a medical term for tooth-related pain, especially teething pain or a toothache from dental disease.","zh":"Odontiasis 是医学用语，指与牙齿有关的疼痛或不适，尤指长牙痛或牙病导致的牙痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Pain, irritation, or other symptoms connected with a tooth—especially pain from a tooth erupting (teething) or from a diseased tooth; tooth-related pain.","zh":"（医学）与牙齿有关的疼痛、刺激或不适症状，尤其指牙齿萌出（长牙）或牙病引起的疼痛；牙痛/长牙不适。"},"examples":[{"en":"The pediatrician said the baby’s crying was likely due to odontiasis from teething.","zh":"儿科医生说，宝宝哭闹很可能是因为长牙引起的牙齿不适（odontiasis）。"},{"en":"He visited the dentist because odontiasis kept him awake at night.","zh":"他因为牙痛（odontiasis）晚上睡不着，去看了牙医。"}]}],"synonyms":["toothache","teething pain","dental pain"],"phonetic":"ˌoʊdənˈtaɪəsɪs","extraExplanation":["这是较少见、较偏医学书面语的词。在日常英语里更常说 toothache（牙痛）或 teething pain（长牙痛/长牙不适）。","词源上由希腊语词根 odonto-（牙）+ -iasis（表示“病症/状态”）构成，因此字面意思是“牙的病症/状态”。"]}
{"word":"odontic","summary":{"en":"Odontic means “related to teeth,” often used in medical or academic contexts.","zh":"Odontic 指“与牙齿有关的”，多用于医学或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to teeth; dental.","zh":"与牙齿有关的；牙科的。"},"examples":[{"en":"The report focuses on odontic health in school-age children.","zh":"这份报告关注学龄儿童的牙齿（牙科）健康。"},{"en":"Researchers compared odontic structures across different species.","zh":"研究人员比较了不同物种的牙齿结构。"}]}],"synonyms":["dental","tooth-related","dentary (technical)"],"phonetic":"/oʊˈdɑːntɪk/","extraExplanation":["“odontic”较偏学术/医学写法，日常英语更常用“dental”（牙科的）或“tooth/tooth-related”（与牙齿有关的）。","词根“odonto- / odont-”来自希腊语“odous/odontos”（牙齿）。常见相关词：odontology（牙科学）、orthodontics（正畸学）、periodontics（牙周病学）。"]}
{"word":"odontist","summary":{"en":"An odontist is a dentist—a doctor who takes care of teeth and gums.","zh":"odontist 指牙医（牙科医生），负责牙齿和牙龈的护理与治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a doctor trained to care for teeth and gums (a dentist)","zh":"牙医；牙科医生"},"examples":[{"en":"I have an appointment with the dentist (odontist) tomorrow morning.","zh":"我明天早上预约了看牙医。"},{"en":"The odontist examined my gums and suggested a deep cleaning.","zh":"牙医检查了我的牙龈，并建议做一次深度清洁。"}]}],"synonyms":["dentist"],"phonetic":"/oʊˈdɑːntɪst/","extraExplanation":["“Odontist”在现代英语里比较少见，更常用的是“dentist”。两者意思基本相同。","词根“odont-”来自希腊语 *odous/odontos*（牙齿），所以你会在一些医学/学术词里看到它，例如：**orthodontist**（正畸医生，矫正牙齿）、**periodontist**（牙周病专科医生）、**endodontist**（牙髓/根管专科医生）。","在日常对话中，用“dentist”更自然；“odontist”更偏正式或学术语境。"]}
{"word":"odontitis","summary":{"en":"Odontitis means inflammation/infection around a tooth, often related to plaque and bacteria.","zh":"Odontitis 指牙齿周围组织的炎症/感染，常与牙菌斑和细菌有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the tissues around a tooth (especially the tooth’s supporting structures), often caused by bacterial infection and plaque buildup; it may lead to pain, swelling, and gum problems.","zh":"牙周（牙齿周围组织）的炎症，常由细菌感染与牙菌斑堆积引起；可能导致疼痛、肿胀和牙龈问题。"},"examples":[{"en":"The dentist said the bleeding gums might be a sign of odontitis and advised a deep cleaning.","zh":"牙医说牙龈出血可能是牙周炎的迹象，并建议做深度清洁。"},{"en":"Good brushing and flossing habits can help prevent infections like odontitis.","zh":"良好的刷牙和使用牙线习惯有助于预防牙周感染，如牙周炎。"}]}],"synonyms":["periodontitis","gingival inflammation","dental infection"],"phonetic":"/ˌoʊdənˈtaɪtɪs/","extraExplanation":["“odont-”来自希腊语 odous/odontos（意为“牙齿”），“-itis”是医学中表示“炎症”的常见后缀（如 tonsillitis 扁桃体炎、dermatitis 皮炎）。","在现代临床中，更常见的说法是 gingivitis（牙龈炎）和 periodontitis（牙周炎）。有时“odontitis”会被用来泛指与牙齿相关的炎症，但具体诊断通常用更精确的术语。"]}
{"word":"odonto","summary":{"en":"“odonto-” means “tooth” and appears in medical/scientific terms like orthodontics and odontogenesis.","zh":"“odonto-”表示“牙齿”，常见于如 orthodontics（正畸学）、odontogenesis（牙发生）等医学/科学术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “tooth,” used in medical and scientific words.","zh":"表示“牙、牙齿”的构词成分（词根/前缀），常用于医学与科学词汇中。"},"examples":[{"en":"Orthodontics is the branch of dentistry that corrects tooth alignment. (ortho- + odonto-)","zh":"Orthodontics（正畸学）是矫正牙齿排列的牙科分支。（ortho- + odonto-）"},{"en":"The dentist studied odontogenesis, the process of tooth development.","zh":"牙医研究了 odontogenesis（牙发生），也就是牙齿发育的过程。"},{"en":"An odontogram records a patient’s teeth and dental work.","zh":"Odontogram（牙位图/牙齿记录图）用于记录病人的牙齿状况和治疗情况。"}]}],"synonyms":["dento-","dental (related adjective)"],"phonetic":"/oʊˈdɑn.toʊ/","extraExplanation":["“odonto-”来自希腊语词根 *odous/odont-*（意为“牙”）。在英语里它通常不单独使用，而是和其他词根/前缀组合成专业术语。","常见相关形式：dento-（同样表示“牙”，更偏拉丁来源，如 dental, dentist）。两者在专业词汇里都很常见。"]}
{"word":"odontoblast","summary":{"en":"An odontoblast is a tooth cell that makes dentin.","zh":"odontoblast 指“成牙本质细胞”，是生成牙本质的牙齿细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialized cell in the tooth that forms dentin (the hard tissue under the enamel).","zh":"成牙本质细胞（牙髓边缘的一种特化细胞，负责形成牙本质，即位于牙釉质下方的硬组织）。"},"examples":[{"en":"Odontoblasts line the outer edge of the dental pulp and produce dentin throughout life.","zh":"成牙本质细胞排列在牙髓的外缘，并在一生中持续生成牙本质。"},{"en":"When a tooth is injured, odontoblasts may help form a protective layer of new dentin.","zh":"当牙齿受伤时，成牙本质细胞可能会帮助形成一层新的保护性牙本质。"}]}],"synonyms":["dentin-forming cell","dentin-producing cell"],"phonetic":"/oʊˈdɑn.təˌblæst/","extraExplanation":["牙齿从外到内常见结构是：牙釉质（enamel）→牙本质（dentin）→牙髓（pulp）。成牙本质细胞位于牙髓与牙本质交界处，负责分泌并维持牙本质，因此在龋齿、磨耗或外伤后的“继发/修复性牙本质”形成中常被提到。","词形上，odonto- 来自希腊语“牙”，-blast 常用于表示“生成/形成某种组织的细胞”（如 osteoblast 成骨细胞）。"]}
{"word":"odontoblastic","summary":{"en":"Odontoblastic means “related to odontoblasts,” the cells that form dentin in teeth.","zh":"odontoblastic 指“与成牙本质细胞有关的”，即牙齿中形成牙本质的细胞相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to odontoblasts (cells in teeth that form dentin).","zh":"与成牙本质细胞（odontoblast，牙齿中形成牙本质的细胞）有关的；成牙本质细胞的。"},"examples":[{"en":"The researcher studied odontoblastic activity during tooth development.","zh":"研究人员研究了牙齿发育过程中成牙本质细胞的活动。"},{"en":"Odontoblastic cells are important for repairing dentin after injury.","zh":"成牙本质细胞对牙本质受损后的修复很重要。"}]}],"synonyms":["odontoblast-related","dentin-forming (context-dependent)"],"phonetic":"/ˌoʊ.dɑn.toʊˈblæs.tɪk/","extraExplanation":["这个词属于牙科/口腔组织学常用术语，来自 odontoblast（成牙本质细胞）+ -ic（“……的”形容词后缀）。","odontoblast 位于牙髓外侧边缘，向外分泌形成 dentin（牙本质）；因此在学术文章中常见搭配如 odontoblastic differentiation（成牙本质细胞分化）、odontoblastic layer（成牙本质细胞层）。"]}
{"word":"odontocele","summary":{"en":"Odontocele is a rare term for a tooth-related cyst or swelling, often involving a developing or unerupted tooth.","zh":"Odontocele 是罕见用语，指与牙齿相关的囊肿或肿胀，常涉及发育中或未萌出的牙齿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare medical term for a cyst-like swelling or tumor related to a tooth (often involving a developing or unerupted tooth).","zh":"（罕见医学用语）与牙齿有关的囊样肿胀或肿块，常与正在发育或未萌出的牙齿相关。"},"examples":[{"en":"The dentist referred the patient to a specialist to evaluate a possible odontocele on the X-ray.","zh":"牙医根据X光片怀疑可能有 odontocele，于是将病人转诊给专科评估。"},{"en":"An odontocele may cause swelling in the jaw or delay the eruption of a tooth.","zh":"odontocele 可能导致颌骨肿胀或使牙齿萌出延迟。"}]}],"synonyms":["dentigerous cyst","odontogenic cyst","dental cyst"],"phonetic":"/oʊˈdɑːn.təˌsiːl/","extraExplanation":["词源上可拆为 odonto-（牙、牙齿）+ -cele（肿胀、疝样突起/囊肿），字面含义接近“牙相关的肿胀/囊肿”。","该词在现代临床写作中相对少见；更常见的相关表达包括 dentigerous cyst（含牙囊肿）或 odontogenic cyst（牙源性囊肿）。具体诊断通常依赖影像学与病理检查。"]}
{"word":"odontocete","summary":{"en":"An odontocete is a toothed whale, such as a dolphin or porpoise.","zh":"odontocete 指“齿鲸”，如海豚、鼠海豚等有牙齿的鲸类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toothed whale (a kind of cetacean) that has teeth instead of baleen, such as dolphins, porpoises, or sperm whales","zh":"齿鲸（有牙齿、没有须板的一类鲸类），如海豚、鼠海豚或抹香鲸等"},"examples":[{"en":"Dolphins are odontocetes, meaning they hunt using teeth rather than baleen.","zh":"海豚属于齿鲸，意思是它们用牙齿捕猎，而不是用须板过滤取食。"},{"en":"Scientists study odontocete echolocation to understand how these animals navigate underwater.","zh":"科学家研究齿鲸的回声定位，以了解它们如何在水下导航。"}]}],"synonyms":["toothed whale","odontocete whale"],"phonetic":"/oʊˈdɑn.təˌsiːt/","extraExplanation":["词源提示：来自希腊语 odonto-（牙）+ ketos（鲸/海怪）。因此 odontocete 字面意思就是“有牙的鲸”。","背景对比：齿鲸（odontocetes）常与“须鲸”（mysticetes，baleen whales）对比学习；前者多用回声定位并捕食鱼类、乌贼等，后者主要用须板滤食磷虾等。"]}
{"word":"odontoceti","summary":{"en":"Odontoceti = toothed whales (dolphins, porpoises, sperm whales, orcas), often using echolocation.","zh":"Odontoceti 指“齿鲸类”（如海豚、鼠海豚、抹香鲸、虎鲸等），常使用回声定位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"toothed whales; a major group (suborder) of whales and dolphins that have teeth and use echolocation (including dolphins, porpoises, sperm whales, and orcas).","zh":"齿鲸类；鲸目中的一大类（亚目），具有牙齿并常用回声定位（包括海豚、鼠海豚、抹香鲸、虎鲸等）。"},"examples":[{"en":"Dolphins and porpoises are Odontoceti, meaning they are toothed whales.","zh":"海豚和鼠海豚属于齿鲸类（Odontoceti），也就是有牙齿的鲸类。"},{"en":"Researchers compared the hearing of Mysticeti and Odontoceti to understand how echolocation evolved.","zh":"研究人员比较须鲸类（Mysticeti）与齿鲸类（Odontoceti）的听觉，以了解回声定位如何演化。"},{"en":"Some Odontoceti species live in rivers, such as the Amazon river dolphin.","zh":"有些齿鲸类生活在河流中，例如亚马孙河豚。"}]}],"synonyms":["toothed whales"],"phonetic":"/ˌoʊdɑn.təˈsiː.taɪ/","extraExplanation":["词源：odonto- 表示“牙齿”（来自希腊语），-ceti 与“鲸”有关（源自希腊语 ketos，意为“海怪/巨鲸”）。","分类对比：齿鲸类（Odontoceti）与须鲸类（Mysticeti）常被并列提及；前者多以回声定位捕食，后者通常以鲸须滤食浮游生物。"]}
{"word":"odontocetous","summary":{"en":"Odontocetous means “related to toothed whales and dolphins,” especially in scientific writing.","zh":"odontocetous 指“与齿鲸类（有牙、常用回声定位的鲸类/海豚）有关”，多用于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to toothed whales and dolphins (the group Odontoceti), which have teeth and use echolocation.","zh":"与齿鲸类（Odontoceti，含海豚等）有关的；指有牙齿并常用回声定位的鲸类。"},"examples":[{"en":"Dolphins are odontocetous mammals known for echolocation.","zh":"海豚属于齿鲸类哺乳动物，以回声定位而闻名。"},{"en":"Scientists compared odontocetous species to baleen whales to study feeding behavior.","zh":"科学家把齿鲸类与须鲸进行比较，以研究它们的取食行为。"}]}],"synonyms":["toothed-whale (related)","odontocete (adj., scientific)"],"phonetic":"/ˌoʊ.dɑn.toʊˈsiː.təs/","extraExplanation":["“odontocetous”常见于生物学、海洋学论文中，日常英语里更常说“toothed whale(s)”或直接说“dolphins/porpoises”。","词源：odonto- 表示“牙齿”（源自希腊语），-cetous 与“鲸类”有关（与 cetacean 同源）。因此字面意思接近“有牙的鲸类的”。","分类对比：齿鲸类（Odontoceti）通常有牙、会回声定位；须鲸类（Mysticeti）通常没有牙而有鲸须，用来滤食。"]}
{"word":"odontochirurgic","summary":{"en":"Odontochirurgic means “related to dental surgery.”","zh":"odontochirurgic 的意思是“与牙科外科（牙科手术）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to dental surgery; involving surgical treatment of the teeth and surrounding tissues.","zh":"与牙科外科/口腔外科有关的；涉及对牙齿及其周围组织进行外科治疗的。"},"examples":[{"en":"The clinic offers odontochirurgic procedures such as tooth extractions and minor gum surgery.","zh":"这家诊所提供牙科外科治疗，例如拔牙和小型牙龈手术。"},{"en":"He was referred to a specialist for an odontochirurgic evaluation after the infection spread.","zh":"感染扩散后，他被转诊给专科医生进行牙科外科评估。"}]}],"synonyms":["dental-surgical","oral-surgical","dentistry-related (context-dependent)"],"phonetic":"/ˌoʊˌdɑn.t̬oʊ.kɪˈrɝː.dʒɪk/","extraExplanation":["这个词很少见，多出现在医学/学术语境里。日常英语更常用 dental surgery（牙科手术）或 oral surgery（口腔外科）。","构词上可拆为：odonto-（牙）+ chiro-（手，表示“手术/外科”）+ -urgic（与手术操作有关）。理解这些词根有助于猜测其他医学词汇的含义。"]}
{"word":"odontoclasis","summary":{"en":"Odontoclasis is a rare term for destructive breaking or resorption of teeth, often leading to early loss of baby teeth.","zh":"Odontoclasis 指牙齿的破坏性断裂或吸收性丧失（较罕见用语），常可导致乳牙过早脱落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare medical term meaning the breaking or destructive loss of tooth structure, especially the resorption and early loss of (often baby) teeth due to disease, trauma, or metabolic conditions","zh":"（罕见医学用语）指牙齿结构的破坏或断裂性丧失；常指因疾病、外伤或代谢异常导致的牙根吸收与（常见于乳牙的）过早脱落"},"examples":[{"en":"The dentist noted signs of odontoclasis after the child’s tooth was injured in a fall.","zh":"牙医在孩子摔倒伤到牙齿后，发现了牙齿破坏（odontoclasis）的迹象。"},{"en":"In some metabolic disorders, odontoclasis can cause unusually early loss of primary teeth.","zh":"在某些代谢性疾病中，牙齿破坏（odontoclasis）可能导致乳牙异常早脱落。"}]}],"synonyms":["tooth resorption","premature loss of primary teeth","dental destruction"],"phonetic":"/oʊˌdɑːntoʊˈkleɪsɪs/","extraExplanation":["词源来自希腊语：odonto-（牙）+ -clasis（打碎、断裂）。因此它强调“破坏/断裂”，不等同于更常见的“龋齿（dental caries）”。","在现代临床写作中该词较少见，医生更常直接写“tooth resorption（牙根吸收）”“premature loss of primary teeth（乳牙早失）”等更具体的表述。"]}
{"word":"odontoclast","summary":{"en":"An odontoclast is a cell that resorbs (breaks down) tooth tissue.","zh":"odontoclast 指“破牙细胞”，会吸收并分解牙体组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized cell that breaks down (resorbs) tooth tissue, especially dentin or the root surface","zh":"一种专门分解（吸收）牙体组织的细胞，尤其常见于牙本质或牙根表面"},"examples":[{"en":"In some dental conditions, odontoclasts can resorb the root of a tooth.","zh":"在某些牙科疾病中，破牙细胞可能会吸收牙根组织。"},{"en":"The dentist explained that odontoclast activity was causing internal tooth resorption.","zh":"牙医解释说，破牙细胞的活动正在导致牙齿的内部吸收。"}]}],"synonyms":["resorptive cell (tooth)"],"phonetic":"/oʊˈdɑn.təˌklæst/","extraExplanation":["词源：odonto- 表示“牙”，-clast 来自希腊语，表示“打碎、破坏者”（同类构词如 osteoclast“破骨细胞”）。因此 odontoclast 字面意思是“破牙（组织）的细胞”。","常见语境：多用于牙科与口腔病理学，尤其在谈“牙吸收（tooth resorption）”时出现。与 osteoclast（破骨细胞）作用对象不同，odontoclast 主要针对牙体组织。"]}
{"word":"odontodynia","summary":{"en":"Odontodynia is the medical term for tooth pain (a toothache).","zh":"Odontodynia 是“牙痛/牙齿疼痛”的医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Pain in a tooth or teeth; a toothache.","zh":"（医学）牙痛；牙齿疼痛。"},"examples":[{"en":"The patient reported severe odontodynia when drinking cold water.","zh":"病人表示喝冷水时出现严重的牙痛。"},{"en":"Odontodynia can be caused by cavities, gum disease, or a cracked tooth.","zh":"牙痛可能由蛀牙、牙龈疾病或牙齿裂纹引起。"},{"en":"If you have persistent odontodynia, see a dentist for an exam.","zh":"如果牙痛持续不缓解，请去看牙医检查。"}]}],"synonyms":["toothache","tooth pain","dental pain"],"phonetic":"/ˌoʊ.dən.toʊˈdɪn.i.ə/","extraExplanation":["这个词主要用于医学或牙科书面语，日常英语更常说 toothache（牙痛）或 tooth pain（牙齿疼痛）。","词源可拆分理解：odonto- 表示“牙”（源自希腊语 odous/odont-），-dynia 表示“疼痛”。因此 odontodynia 字面意思就是“牙的疼痛”。","在临床表述中常与其他术语一起出现，例如：dentin hypersensitivity（牙本质敏感）、pulpitis（牙髓炎）等，用于帮助描述疼痛原因与类型。"]}
{"word":"odontogen","summary":{"en":"Odontogen is a technical word meaning “tooth-forming” or “related to the origin/development of teeth,” often expressed as odontogenic in modern usage.","zh":"Odontogen 是偏专业的词，意思是“生齿的/与牙齿起源或发育有关的（牙源性）”，现代更常用 odontogenic 来表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Producing or forming teeth; related to the origin/development of teeth.","zh":"（专业）生齿的；形成牙齿的；与牙齿的起源/发育有关的。"},"examples":[{"en":"Odontogen tissues are involved in the early formation of teeth.","zh":"牙源性（odontogen）组织参与牙齿的早期形成。"},{"en":"The dentist suspected an odontogen source for the infection.","zh":"牙医怀疑感染来源与牙齿（牙源性）有关。"}]},{"partOfSpeech":"n.","definition":{"en":"A tooth-forming tissue or structure (rare; often replaced by “odontogenic tissue”).","zh":"生齿组织或结构（较少用；常用“odontogenic tissue/牙源性组织”来表达）。"},"examples":[{"en":"Some texts refer to the odontogen as the tissue that gives rise to a tooth.","zh":"一些资料把“odontogen”指代为产生牙齿的组织。"}]}],"synonyms":["odontogenic","tooth-forming"],"phonetic":"/oʊˈdɑn.tə.dʒən/","extraExplanation":["这个词多见于医学/牙科学语境，更常见的标准用词是 **odontogenic**（牙源性的）。","词根帮助记忆：**odonto-** = 牙（tooth），**-gen** = 产生/生成（produce）。因此整体含义接近“生齿的/牙源性的”。","如果你是在论文或病理报告里看到的，通常是在说“来源于牙胚或与牙齿形成相关的组织/病变”。"]}
{"word":"odontogenesis","summary":{"en":"Odontogenesis is the process by which teeth form and develop.","zh":"Odontogenesis 指牙齿形成与发育的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the biological process of forming and developing teeth (from the earliest tooth bud to a mature tooth)","zh":"牙齿发生；牙齿形成（从最早的牙胚到成熟牙齿的生物学发育过程）"},"examples":[{"en":"In embryology, odontogenesis begins before a baby is born.","zh":"在胚胎学中，牙齿发生在婴儿出生前就开始了。"},{"en":"Researchers study odontogenesis to understand why some people develop missing teeth.","zh":"研究人员研究牙齿发生，以了解为什么有些人会出现先天缺牙。"}]}],"synonyms":["tooth development","tooth formation"],"phonetic":"/ˌoʊˌdɑn.t̬oʊˈdʒɛn.ə.sɪs/","extraExplanation":["词源：odonto- 表示“牙”，-genesis 表示“产生、形成”。合起来就是“牙的形成”。","语境：这是牙科与发育生物学中的专业术语，日常英语更常说 tooth development（牙齿发育）。","相关词：odontogenic（成牙源性的/与牙齿形成有关的），odontoblast（成牙本质细胞，形成牙本质的细胞）。"]}
{"word":"odontogenic","summary":{"en":"Odontogenic means “related to tooth formation” or “arising from tooth-forming tissues,” often used for jaw cysts, tumors, or infections.","zh":"odontogenic 指“与牙齿发生发育有关”或“起源于成牙组织的”，常用于描述颌骨的囊肿、肿瘤或感染。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the development and formation of teeth (tooth-producing).","zh":"与牙齿的发生、发育和形成有关的；成牙源性的。"},"examples":[{"en":"Odontogenic cells help form the tissues that become teeth.","zh":"成牙源性细胞帮助形成将来变成牙齿的组织。"},{"en":"The dentist explained that the cyst was odontogenic, meaning it started from tooth-forming tissue.","zh":"牙医解释说这个囊肿是成牙源性的，也就是说它起源于成牙组织。"}]},{"partOfSpeech":"adj.","definition":{"en":"Originating from tooth-forming tissues, especially used for certain cysts or tumors in the jaw.","zh":"（尤指颌骨中的囊肿或肿瘤）起源于成牙组织的；牙源性的。"},"examples":[{"en":"They diagnosed an odontogenic tumor after reviewing the biopsy.","zh":"他们在查看活检结果后诊断为牙源性肿瘤。"},{"en":"Odontogenic infections can spread from a tooth into the jaw or face if not treated.","zh":"牙源性感染如果不治疗，可能从牙齿扩散到颌骨或面部。"}]}],"synonyms":["tooth-forming","of dental origin","dental-origin"],"phonetic":"/ˌoʊ.dɑn.təˈdʒɛn.ɪk/","extraExplanation":["这个词主要出现在牙科、口腔颌面外科和病理报告里，例如“odontogenic cyst（牙源性囊肿）”“odontogenic tumor（牙源性肿瘤）”。日常英语中很少用。","词源可拆为 odonto-（牙）+ -genic（产生、起源于），所以核心含义是“由牙（成牙组织）产生/起源”。"]}
{"word":"odontogeny","summary":{"en":"Odontogeny means the development and formation of teeth.","zh":"Odontogeny 指牙齿的发生与发育过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the development and formation of teeth (from early growth to mature structure)","zh":"牙齿的发生与发育（从早期形成到成熟结构的过程）"},"examples":[{"en":"Researchers studied odontogeny to understand why some children are born without certain teeth.","zh":"研究人员通过研究牙齿发生与发育来了解为什么有些孩子天生缺少某些牙齿。"},{"en":"In dentistry, knowledge of odontogeny helps explain how cavities can affect developing teeth.","zh":"在牙科学中，了解牙齿发生与发育有助于解释龋齿如何影响正在发育的牙齿。"}]}],"synonyms":["tooth development","odontogenesis"],"phonetic":"/ˌoʊdɑnˈtɑdʒəni/","extraExplanation":["词源提示：odont- 来自希腊语 *odous/odontos*（“牙齿”），-geny 来自 *genesis*（“起源、生成”）。因此 odontogeny 字面意思是“牙齿的生成”。","使用场景：该词更常见于牙科、胚胎学、发育生物学与口腔病理学等学术语境；日常英语里更常说 *tooth development*（牙齿发育）。","相关词：*odontogenesis* 常与 *odontogeny* 近义，强调“形成过程”；*odontogenic*（牙源性的）用于描述“来源于牙齿或与牙齿形成有关”的组织或肿瘤（如 *odontogenic tumor* 牙源性肿瘤）。"]}
{"word":"odontoglossae","summary":{"en":"Odontoglossae is a scientific name for a group of orchids, mainly used in older or specific classification systems.","zh":"Odontoglossae 是兰科中某一类群的学名，多见于较早或特定的分类体系中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group of orchids (a tribe/subtribe name used in some classifications), historically centered on the genus *Odontoglossum* and its relatives","zh":"（兰科植物的）一个分类群名称（某些分类体系中的族/亚族名），历史上以 *Odontoglossum*（齿舌兰属）及其近缘类群为核心"},"examples":[{"en":"Some older orchid books place *Odontoglossum* and related genera in the Odontoglossae.","zh":"一些较早的兰花书会把齿舌兰属及其近缘属归入 Odontoglossae。"},{"en":"In modern databases, Odontoglossae may appear as a historical label rather than a current rank.","zh":"在一些现代数据库中，Odontoglossae 可能更多作为历史标签出现，而不是现行的分类等级。"}]}],"synonyms":["Odontoglossum (related genus name)","Oncidiinae (roughly related/overlapping group in some systems)"],"phonetic":"/oʊˌdɑn.təˈɡlɔː.siː/","extraExplanation":["这是一个拉丁化的植物分类名称，常见于兰科（Orchidaceae）的传统分类文献中；不同体系对它的等级（族/亚族）与范围可能不一致，因此阅读资料时要留意所采用的分类标准（例如是否把某些类群并入 Oncidium 等更大的属中）。","词源上可拆解为 odonto-（“牙”）+ gloss-（“舌”），与 *Odontoglossum*（齿舌兰属）的名称相关，指其花部结构在形态上给人的“齿/舌”联想。"]}
{"word":"odontoglossal","summary":{"en":"Odontoglossal means ‘related to the teeth and the tongue,’ mainly used in medical or dental contexts.","zh":"odontoglossal 指“与牙齿和舌头有关的”，主要用于医学或牙科语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the teeth (odonto-) and the tongue (glossal), especially in anatomy, dentistry, or speech-related medical contexts.","zh":"与牙齿（odonto-）和舌头（glossal）有关的；常用于解剖学、牙科或与发音相关的医学语境。"},"examples":[{"en":"The dentist noted an odontoglossal issue affecting the patient’s speech.","zh":"牙医指出患者存在一种与牙齿和舌头相关的问题，影响了发音。"},{"en":"Some orthodontic treatments consider odontoglossal contact during pronunciation.","zh":"一些正畸治疗会考虑发音时牙齿与舌头的接触关系。"}]}],"synonyms":["dental-lingual","dento-lingual"],"phonetic":"/oʊˌdɑːntoʊˈɡlɑːsəl/","extraExplanation":["词源提示：odonto- 来自希腊语“牙齿”，glossal 来自希腊语 glōssa“舌头/语言”。这种复合词多见于医学或学术写作，日常英语中非常少用。","学习建议：遇到类似的医学复合词，可以拆分来猜意思：odonto-（牙）+ gloss-（舌）+ -al（……的）。"]}
{"word":"odontoglossate","summary":{"en":"Odontoglossate means “having a toothed tongue (radula),” mainly used in zoology for many mollusks.","zh":"odontoglossate 意为“具有齿舌（radula，带细齿的舌状器官）的”，主要用于动物学描述许多软体动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Having a toothed tongue; relating to animals (especially many mollusks) that have a radula— a tongue-like organ with many tiny teeth used for scraping food.","zh":"（动物学）具“齿舌”的；指（尤指许多软体动物）具有齿舌（radula）——一种像舌头的器官，上面有许多微小的“齿”，用来刮取食物。"},"examples":[{"en":"Many snails are odontoglossate, using a radula to scrape algae from rocks.","zh":"许多蜗牛属于“具齿舌”的类型，它们用齿舌从岩石上刮取藻类。"},{"en":"The researcher examined odontoglossate mouthparts under a microscope.","zh":"研究人员在显微镜下观察了具齿舌动物的口器结构。"}]}],"synonyms":["radulate","toothed-tongued"],"phonetic":"/oʊˌdɑn.təˈɡlɔː.seɪt/","extraExplanation":["词源：odonto- 表示“牙、齿”，gloss- / glossa 表示“舌”。因此 odontoglossate 字面意思就是“有牙齿的舌头”。","使用场景：这个词非常偏学术，常见于动物学、软体动物学（如蜗牛、海螺、蛞蝓等的齿舌结构描述），日常英语几乎不用。"]}
{"word":"odontoglossum","summary":{"en":"Odontoglossum is a type of orchid (a genus name), known for decorative flowers and common in orchid growing.","zh":"Odontoglossum 指一种兰花属名（兜兰属/传统称齿舌兰属），以观赏性强的花朵著称，常见于兰花栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of orchids (orchid family) known for showy, often speckled flowers; many species were popular in horticulture.","zh":"兜兰属（或传统称“齿舌兰属”）的一类兰花；花朵华丽、常带斑点，许多种曾在园艺栽培中很受欢迎。"},"examples":[{"en":"She grows an odontoglossum orchid in a cool, bright room.","zh":"她在凉爽、明亮的房间里栽培一株兜兰属（odontoglossum）的兰花。"},{"en":"The nursery used to sell odontoglossums with spotted petals.","zh":"那家苗圃过去常卖花瓣带斑点的兜兰属（odontoglossum）兰花。"}]}],"synonyms":["orchid (general)","genus Odontoglossum"],"phonetic":"/ˌoʊ.dɑn.toʊˈɡlɑs.əm/","extraExplanation":["“Odontoglossum”一词来自希腊语词根：odonto-（牙）+ glossa（舌），指一些物种唇瓣（花的“唇”）上像“牙齿/突起”的结构。","在现代植物分类中，许多传统上归入Odontoglossum的物种已被并入或转移到近缘属（如Oncidium等）；因此在园艺界你可能还会看到“旧称/园艺名”与“新学名”并存。"]}
{"word":"odontognathae","summary":{"en":"Odontognathae = an older scientific term for extinct “toothed birds.”","zh":"Odontognathae：旧式科学分类名，指已灭绝的“有齿鸟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old (now mostly obsolete) scientific name for a group of extinct “toothed birds,” especially Cretaceous seabirds such as Ichthyornis and Hesperornis.","zh":"一个较旧、如今多已不用的科学分类名，指一类已灭绝的“有齿鸟”（主要是白垩纪的海鸟），如鱼鸟属（Ichthyornis）和潜鸟样的赫斯佩罗鸟属（Hesperornis）。"},"examples":[{"en":"Some 19th‑century books grouped Ichthyornis under Odontognathae because it had true teeth.","zh":"一些19世纪的书把鱼鸟属（Ichthyornis）归入 Odontognathae，因为它有真正的牙齿。"},{"en":"Odontognathae is rarely used in modern classification, but you may still see it in older paleontology texts.","zh":"Odontognathae 在现代分类中很少使用，但你仍可能在较旧的古生物学文献中见到它。"}]}],"synonyms":["toothed birds","Odontognathous birds (older term)"],"phonetic":"/oʊˌdɑn.toʊˈnæθ.i/","extraExplanation":["这是一个带有历史色彩的分类名：19世纪的学者曾用 “Odontognathae”（字面意思接近“有齿的颌”）来概括一些发现于白垩纪、带牙齿特征的鸟类化石。随着系统发育与分类方法更新，这个大类群名称逐渐被更细化、可检验的分支（例如具体属种及其演化关系）所取代，因此在现代学术写作中多被视为旧称或非正式用法。"]}
{"word":"odontognathic","summary":{"en":"“Odontognathic” means “related to the teeth and jaws,” mainly in medical/dental contexts.","zh":"“odontognathic” 指“与牙齿和颌骨有关的”，主要用于医学/牙科语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the teeth and the jaws (used especially in dentistry, orthodontics, and surgery).","zh":"与牙齿和颌骨（上下颌）有关的（尤用于牙科、正畸和外科）。"},"examples":[{"en":"The surgeon evaluated the patient’s odontognathic structure before the operation.","zh":"外科医生在手术前评估了患者的牙颌结构。"},{"en":"Odontognathic abnormalities can affect both chewing and facial appearance.","zh":"牙颌异常会同时影响咀嚼功能和面部外观。"}]}],"synonyms":["dentofacial","dental and jaw (related)"],"phonetic":"/oʊˌdɑːntoʊˈnæθɪk/","extraExplanation":["词源上可拆为 odonto-（牙）+ gnath-（颌/下颌）+ -ic（……的）。因此它通常出现在较正式的医学/牙科语境里，常见搭配如 odontognathic surgery（牙颌外科手术）或 odontognathic system（牙颌系统）。","在日常英语里很少用到；更常见、更易懂的说法是 dental and jaw（牙齿和颌骨的）或 dentofacial（牙—面部的，强调与面部结构的关系）。"]}
{"word":"odontognathous","summary":{"en":"A scientific adjective meaning “having tooth-like jaws; built for chewing.”","zh":"一个科学用语形容词，指“具有牙状颚/口器，适于咀嚼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having jaws or mouthparts with tooth-like structures; adapted for biting and chewing.","zh":"（动物学）具“牙状”结构的颚或口器的；适于咬、嚼的。"},"examples":[{"en":"Beetles are often described as odontognathous because they have strong chewing mouthparts.","zh":"甲虫常被描述为 odontognathous，因为它们有强壮的咀嚼式口器。"},{"en":"The paper compares odontognathous insects with species that feed by sucking liquids.","zh":"这篇论文比较了 odontognathous（咀嚼式）昆虫与以吸食液体为生的物种。"}]}],"synonyms":["mandibulate","chewing","toothed-jawed"],"phonetic":"/ˌoʊ.dən.toʊˈnæθ.əs/","extraExplanation":["词源拆解：odonto- 表示“牙”（tooth），-gnathous 来自希腊语 gnathos，表示“颚/下颌”（jaw）。合在一起就是“有牙的颚/具咀嚼性口器”。","这是非常学术、偏动物学/昆虫学的形容词，日常英语几乎不用；更常见的写法是 chewing (mouthparts) 或 mandibulate。"]}
{"word":"odontograph","summary":{"en":"An odontograph is a dental tool for tracing or recording the shape of teeth.","zh":"odontograph 指用于描绘或记录牙齿形状的牙科器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dental instrument used to trace, measure, or record the shape/outline of a tooth (or teeth), especially for making models or dental prosthetics","zh":"（牙科）牙形记录器；用于描绘、测量或记录牙齿形状/轮廓的器械（常用于制作模型或义齿）"},"examples":[{"en":"The technician used an odontograph to record the tooth’s contour before making the crown.","zh":"技师在制作牙冠前，用牙形记录器记录了牙齿的外形轮廓。"},{"en":"Accurate odontograph readings help the lab create a better-fitting denture.","zh":"准确的牙形记录有助于技工室制作更贴合的假牙。"}]}],"synonyms":["dental tracer","tooth tracer","tooth-measuring device"],"phonetic":"/oʊˈdɑːn.təˌɡræf/","extraExplanation":["这是一个较少见、偏专业的词，多出现在牙科器械或较旧的技术文献中。词根 odonto- 表示“牙齿”，-graph 表示“记录/描绘”。不同教材里可能也会用更常见的说法，如 dental tracer、tooth tracer 或 tooth-measuring device。"]}
{"word":"odontographic","summary":{"en":"Odontographic means “about describing or recording teeth,” used mainly in academic or dental contexts.","zh":"odontographic 指“与牙齿的描述或记录有关”，主要用于学术或牙科语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the description, study, or recording of teeth (especially in dentistry or anatomy).","zh":"（尤用于牙科或解剖学）与牙齿的描述、研究或记录有关的。"},"examples":[{"en":"The researcher used an odontographic method to record the shape of each tooth.","zh":"研究人员用一种牙齿记录（odontographic）方法来记录每颗牙的形状。"},{"en":"Odontographic notes can help compare dental features in different populations.","zh":"牙齿描述（odontographic）记录有助于比较不同人群的牙齿特征。"}]}],"synonyms":["dental","tooth-related","odontological"],"phonetic":"/oʊˌdɑːntəˈɡræfɪk/","extraExplanation":["这是一个非常少见、偏学术的词。它来自前缀 odonto-（牙、牙齿）+ -graphic（记录、描绘）。相关名词是 odontography（牙齿的描写/记录）。在日常英语里更常见的说法通常是 dental description / dental record / tooth morphology record 等。"]}
{"word":"odontography","summary":{"en":"Odontography means the scientific description or recording of teeth.","zh":"odontography 指对牙齿进行科学性的描述或记录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the description, study, or recording of teeth (their form, arrangement, and features), especially for scientific or medical purposes","zh":"牙齿描述学；对牙齿（形态、排列与特征）的描述、研究或记录，常用于医学或科学领域"},"examples":[{"en":"The dentist used odontography to document the patient’s tooth wear over time.","zh":"牙医用牙齿描述记录法来记录患者牙齿随时间的磨耗情况。"},{"en":"In anthropology, odontography can help compare dentition across populations.","zh":"在人类学中，牙齿描述学可用于比较不同人群的齿列特征。"}]}],"synonyms":["dental documentation","dental description","dentition recording"],"phonetic":"/ˌoʊdɑnˈtɑɡrəfi/","extraExplanation":["词源：odonto- 表示“牙齿”（源自希腊语 odous/odont-），-graphy 表示“书写、记录、描绘”。合起来就是“对牙齿进行记录/描写”。","使用场景：多见于牙科（病历记录、牙位与形态描述）、法医学（牙科记录用于身份识别）、以及体质人类学（用牙齿特征做群体比较）。"]}
{"word":"odontohyperesthesia","summary":{"en":"A medical term meaning extreme tooth sensitivity.","zh":"医学/牙科用语，指牙齿（牙本质）极度敏感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"abnormal or extreme sensitivity of a tooth or teeth, especially to cold, heat, touch, or sweet foods (tooth hypersensitivity).","zh":"牙齿异常或极度敏感（牙本质敏感），尤其对冷、热、触碰或甜食反应强烈。"},"examples":[{"en":"Cold water triggers my odontohyperesthesia, so I drink room‑temperature water.","zh":"冷水会引发我的牙齿过敏，所以我喝常温水。"},{"en":"The dentist said the sharp pain is consistent with odontohyperesthesia rather than a cavity.","zh":"牙医说这种刺痛更符合牙齿过敏，而不是蛀牙。"}]}],"synonyms":["tooth hypersensitivity","dentin hypersensitivity","tooth sensitivity"],"phonetic":"/oʊˌdɑn.toʊˌhaɪ.pɚ.əsˈθi.ʒə/","extraExplanation":["这是较偏医学/牙科的术语，临床上更常见的说法是 “dentin hypersensitivity（牙本质敏感）” 或直接说 “tooth sensitivity（牙齿敏感）”。","词源可拆解理解：odonto-（牙）+ hyper-（过度）+ -esthesia（感觉）。因此字面意思就是“牙的过度感觉”。","常见诱因包括牙龈退缩导致牙根暴露、刷牙太用力、酸性饮食造成牙釉质磨损、牙齿美白后短暂敏感等；如果疼痛持续或自发出现，通常需要排除龋齿、牙髓炎或牙裂等问题。"]}
{"word":"odontoid","summary":{"en":"Odontoid means “tooth-like,” especially referring to the dens (odontoid process) on the C2 vertebra in the neck.","zh":"odontoid 意为“牙状的”，常指颈椎第二节（C2）的齿突（dens/odontoid process）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the tooth-like bony projection on the second cervical vertebra (C2), called the dens (odontoid process).","zh":"与第二颈椎（C2）上“牙突/齿突”（dens，odontoid process）这一牙状骨突相关的；齿突的。"},"examples":[{"en":"The MRI report mentioned an odontoid fracture.","zh":"核磁共振报告提到“齿突骨折”。"},{"en":"Doctors checked the odontoid process to make sure the neck was stable.","zh":"医生检查齿突，以确认颈部是否稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"The odontoid process (dens), a tooth-like bony projection of the second cervical vertebra (C2).","zh":"齿突（dens，odontoid process）：第二颈椎（C2）上的牙状骨突。"},"examples":[{"en":"In anatomy class, we learned that the odontoid helps the head rotate.","zh":"在解剖课上，我们学到齿突有助于头部旋转。"}]}],"synonyms":["dens","odontoid process"],"phonetic":"/oʊˈdɑn.tɔɪd/","extraExplanation":["词源：odonto- 来自希腊语 odous/odont-（“牙”），-oid 表示“像……的”。因此 odontoid 字面意思是“像牙一样的”。","常见搭配：odontoid process（齿突/牙突）、odontoid fracture（齿突骨折）。在医学英语里它多出现在影像学报告、骨科/神经外科的病历中。"]}
{"word":"odontoids","summary":{"en":"Odontoids = toothlike anatomical structures, usually the odontoid processes (dens) of the C2 vertebra.","zh":"odontoids 指“牙状”的解剖结构，通常特指第二颈椎（C2）的齿突（dens）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"toothlike parts in anatomy; most commonly, the odontoid processes (the “dens”) on the second cervical vertebra (C2).","zh":"（解剖）“牙状”的结构；最常指第二颈椎（C2）上的齿突（dens，牙突）。"},"examples":[{"en":"The scan showed a small fracture near the odontoids.","zh":"扫描显示齿突附近有一处小骨折。"},{"en":"In this diagram, the odontoids help stabilize the head and neck.","zh":"在这张示意图中，齿突有助于稳定头颈部。"}]}],"synonyms":["dens","odontoid processes"],"phonetic":"/oʊˈdɑn.tɔɪdz/","extraExplanation":["“Odontoid”来自希腊语词根 odonto-（牙）+ -oid（……形状的），字面意思是“像牙的”。医学语境里最常见的是“odontoid process / dens”（齿突/牙突），位于第二颈椎（C2，axis，枢椎），与第一颈椎（C1）一起帮助头部转动与稳定。","在临床写作中，复数“odontoids”常用于影像学或骨科描述（如骨折、畸形、发育异常等）；日常英语里很少用到。"]}
{"word":"odontolcae","summary":{"en":"“odontolcae” doesn’t match a recognized English word; it’s likely a misspelling (often of a term related to teeth).","zh":"“odontolcae”不是可识别的英语单词，可能是拼写错误（常见于与“牙齿”相关的术语）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a specialized term written incorrectly.","zh":"这不是标准英语单词，很可能是拼写错误或某个专业术语写错了。"},"examples":[{"en":"I couldn’t find “odontolcae” in a dictionary—could you check the spelling or share the sentence where you saw it?","zh":"我在词典里找不到“odontolcae”，你能检查一下拼写，或把它出现的句子发我吗？"}]}],"extraExplanation":["“odonto-”是常见的词根，来自希腊语，意思是“牙齿”。如果你是在牙科/生物学语境里看到这个词，可能想写的是：\n- odontoclast（破牙细胞/吸收牙质的细胞）\n- odontocete（齿鲸，如海豚、抹香鲸）\n- odontoclasia（牙质破坏/牙裂等旧式术语，较少见）\n把原句贴出来，我可以帮你锁定最可能的正确词。"]}
{"word":"odontolcate","summary":{"en":"“odontolcate” is not recognized as a standard English word; it likely contains a spelling error. Common tooth-related words start with “odonto-”.","zh":"“odontolcate”不是标准英语单词，可能有拼写错误；许多与牙齿相关的词以“odonto-”开头。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a rare technical term. Please double-check the spelling.","zh":"不是标准英语单词；很可能是拼写错误或非常少见的专业术语。请再确认拼写。"},"examples":[{"en":"I couldn’t find “odontolcate” in major English dictionaries—could it be “odontology” or “odontalgia”?","zh":"我在主要英语词典里找不到“odontolcate”——你想写的是“odontology（牙科学）”还是“odontalgia（牙痛）”吗？"}]}],"extraExplanation":["“odonto-”是常见的医学/生物学词根，来自希腊语，意思是“牙齿”。很多与牙齿有关的词都以它开头。","你可能想表达的常见相关词：\n- odontology：牙科学（研究牙齿的学科）\n- odontalgia：牙痛\n- odontogenic：牙源性的（由牙齿或其组织引起）\n- odontoblast：成牙本质细胞\n如果你告诉我你看到这个词的句子或领域（医学、牙科、游戏ID等），我可以更准确判断。"]}
{"word":"odontolcous","summary":{"en":"“odontolcous” isn’t a standard word; it’s likely a misspelling of “odontoclastic,” meaning related to tooth-structure breakdown/resorption.","zh":"“odontolcous”不是标准词；很可能是“odontoclastic”的拼写错误，意思是与牙体组织的破坏/吸收有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “odontoclastic” (related to the breakdown or resorption of tooth tissue).","zh":"不是标准英语单词。很可能是把“odontoclastic”（与牙体组织的破坏/吸收有关）拼错了。"},"examples":[{"en":"I couldn’t find “odontolcous” in a dictionary; did you mean “odontoclastic”?","zh":"我在词典里找不到“odontolcous”；你是不是想写“odontoclastic”？"}]},{"partOfSpeech":"adj.","definition":{"en":"odontoclastic (adj.): relating to the breakdown/resorption of tooth structure, often used in dentistry or veterinary medicine.","zh":"odontoclastic（形容词）：与牙体组织被破坏或被吸收有关的，常用于牙科或兽医学语境。"},"examples":[{"en":"The dentist discussed odontoclastic changes seen on the X-ray.","zh":"牙医讨论了X光片上看到的牙体吸收（odontoclastic）改变。"},{"en":"Cats can develop odontoclastic resorptive lesions.","zh":"猫可能会出现牙体吸收性病变（odontoclastic resorptive lesions）。"}]}],"synonyms":["resorptive","tooth-resorbing","(context) degenerative"],"phonetic":"/ˌoʊˌdɑːn.toʊˈklæs.tɪk/","extraExplanation":["“odonto-”源自希腊语，表示“牙、牙齿”；“-clastic”来自表示“打碎、破坏”的词根（如“clastic / osteoclast”）。因此“odontoclastic”字面意思就是“与牙齿组织被破坏/吸收有关”。","如果你能提供这个词出现的句子或专业领域（牙科/生物/医学等），我可以更准确判断你原本想写的词。"]}
{"word":"odontolite","summary":{"en":"Odontolite is a rare noun meaning a tooth-like fossil/concretion, and it can also refer to “bone turquoise,” a blue-green fossil bone/ivory material used in jewelry.","zh":"Odontolite 是个较少见的名词，可指像牙齿的化石/结核；也可指“骨松石”，即呈蓝绿色的化石骨或象牙材料，常用于首饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tooth-shaped fossil or mineral concretion (a hard mass) that resembles a tooth; sometimes used in older writings for tooth-like stones found in the ground.","zh":"一种像牙齿形状的化石或矿物结核（硬块）；在较旧的文献中也指在地下发现的“像牙的石头”。"},"examples":[{"en":"The museum displayed an odontolite alongside other fossil fragments.","zh":"博物馆把一块 odontolite 和其他化石碎片一起展出。"},{"en":"Early collectors sometimes mistook an odontolite for a real animal tooth.","zh":"早期的收藏者有时会把 odontolite 误认为真正的动物牙齿。"}]},{"partOfSpeech":"n.","definition":{"en":"A trade/mineral name for “bone turquoise,” a blue-green material made from fossil bone or ivory colored by minerals (often used as a gemstone substitute).","zh":"一种商品/矿物名称，指“骨松石”（bone turquoise）：由化石骨或象牙在矿物作用下呈蓝绿色的材料，常被当作宝石替代品。"},"examples":[{"en":"The pendant was described as odontolite rather than true turquoise.","zh":"这条吊坠被描述为 odontolite，而不是真正的松石。"},{"en":"Some vintage jewelry uses odontolite because it can resemble turquoise in color.","zh":"一些复古首饰会使用 odontolite，因为它的颜色可能很像松石。"}]}],"synonyms":["bone turquoise","fossil tooth (informal)","tooth-like concretion"],"phonetic":"/oʊˈdɑːn.təˌlaɪt/","extraExplanation":["词源上来自希腊语：odonto-（牙）+ -lite（石）。","在珠宝语境里，odontolite 常被称为“bone turquoise（骨松石）”，并不等同于真正的 turquoise（松石，主要矿物为含水磷酸铜铝）。购买时可留意商家是否标注为仿品/替代材料。"]}
{"word":"odontolith","summary":{"en":"Odontolith means a stone-like calcified deposit associated with a tooth, often referring to dental calculus (tartar).","zh":"Odontolith 指与牙齿相关的“石头样”钙化沉积物，常用来指牙结石（牙垢）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hard, stone-like deposit that forms on or near a tooth (a kind of dental “stone,” similar to dental calculus/tartar).","zh":"牙石；在牙齿上或牙齿附近形成的坚硬、类似石头的沉积物（类似牙结石/牙垢）。"},"examples":[{"en":"The dentist removed an odontolith during the cleaning.","zh":"牙医在洁牙时清除了牙石。"},{"en":"Good brushing and flossing help prevent odontolith formation.","zh":"认真刷牙和使用牙线有助于预防牙石形成。"}]},{"partOfSpeech":"n.","definition":{"en":"In broader medical writing, a tooth-like or tooth-related calcified mass (a “stone”) found in oral tissues.","zh":"（较广义的医学用法）口腔组织中出现的与牙齿相关的钙化块（“结石”样团块）。"},"examples":[{"en":"The report described an odontolith in the gum tissue.","zh":"报告描述了牙龈组织中的一处牙相关钙化结石样团块。"}]}],"synonyms":["dental calculus","tartar","calculus (dental)"],"phonetic":"/oʊˈdɑːn.tə.lɪθ/","extraExplanation":["词源：odonto- 表示“牙齿”，-lith 表示“石头/结石”。因此 odontolith 字面意思就是“牙齿的石头”。","在日常英语里更常见的说法是 dental calculus 或 tartar；odontolith 属于较少见、偏医学/牙科文献的用词。"]}
{"word":"odontological","summary":{"en":"Odontological means “related to the scientific study of teeth and dentistry.”","zh":"odontological 意为“与牙科学/牙科研究有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to dentistry—the scientific study of teeth and the structures of the mouth.","zh":"与牙科学有关的；关于牙齿及口腔结构研究的。"},"examples":[{"en":"The museum displayed odontological tools used in the 1800s.","zh":"博物馆展出了19世纪使用过的牙科（odontological）器具。"},{"en":"She is writing an odontological report about tooth decay patterns.","zh":"她正在写一份关于龋齿分布规律的牙科学报告。"}]}],"synonyms":["dental","dentistry-related"],"phonetic":"/ˌoʊ.dɔn.təˈlɑ.dʒɪ.kəl/","extraExplanation":["词源提示：来自希腊语 odonto-（“牙齿”）+ -logy（“学科/研究”），因此 odontological 常见于较正式或学术语境。日常英语中更常用 dental（牙科的）。","相关词：odontology（牙科学，名词）；odontologist（牙科学家/牙科研究者）。在法医学里也常见 forensic odontology（法医牙科学），用牙齿来协助身份鉴定。"]}
{"word":"odontologist","summary":{"en":"An odontologist is a (formal) word for a dentist or a specialist who studies and treats teeth and mouth diseases.","zh":"odontologist 是“牙科医生/牙医”的较正式说法，指研究并治疗牙齿与口腔疾病的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dentist; a person who studies, diagnoses, and treats diseases of the teeth and mouth","zh":"牙科医生；口腔/牙齿疾病的研究、诊断与治疗者"},"examples":[{"en":"The odontologist examined her gums and recommended a deep cleaning.","zh":"牙科医生检查了她的牙龈，并建议做一次深度清洁。"},{"en":"If you have persistent tooth pain, see an odontologist as soon as possible.","zh":"如果你持续牙痛，应尽快去看牙科医生。"}]}],"synonyms":["dentist","dental specialist"],"phonetic":"/ˌoʊ.dɑnˈtɑl.ə.dʒɪst/","extraExplanation":["“odontologist”较偏正式或学术用语；日常英语里更常说“dentist（牙医）”。","词根提示：odo/odont- 来自希腊语，意为“牙齿”；-logist 表示“研究某领域的人”。","相关词：odontology（牙科学），orthodontist（正畸医生，矫正牙齿），periodontist（牙周专科医生）。"]}
{"word":"odontology","summary":{"en":"Odontology is the scientific study of teeth (often used in academic or forensic contexts).","zh":"Odontology 指牙科学：研究牙齿的科学（常用于学术或法医学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of teeth, including their structure, development, diseases, and treatment; dentistry","zh":"牙科学；牙齿学：研究牙齿的结构、发育、疾病与治疗的科学；即牙科（dentistry）"},"examples":[{"en":"She decided to study odontology because she was fascinated by how teeth develop and decay.","zh":"她决定学习牙科学，因为她对牙齿如何发育和蛀坏很着迷。"},{"en":"In the museum, the exhibit compared ancient and modern odontology tools.","zh":"在博物馆里，展览比较了古代与现代牙科学工具。"},{"en":"Odontology can also help identify people by comparing dental records.","zh":"牙科学也能通过比对牙科记录来帮助确认身份。"}]}],"synonyms":["dentistry","dental science"],"phonetic":"/ˌoʊdənˈtɑlədʒi/","extraExplanation":["“Odontology”多用于学术或法医学语境，日常生活中更常说“dentistry（牙科）”或“dental science（牙科科学）”。","词源：来自希腊语根 odonto-（牙）+ -logy（学科/研究）。","在法医学里常见相关表达：forensic odontology（法医牙科学），利用牙齿特征、牙科治疗记录来协助身份识别。"]}
{"word":"odontoloxia","summary":{"en":"“Odontoloxia” is not standard English; it likely refers to “odontology,” the study of teeth (dental science).","zh":"“odontoloxia”不是标准英语拼写；多半指“odontology”，即研究牙齿的牙科学/齿学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Likely meant “odontology”: the scientific study of teeth, including their structure, development, and diseases; dental science.","zh":"（非标准拼写）很可能是想写“odontology（牙科学/齿学）”：研究牙齿的结构、发育与疾病等的科学；牙科科学。"},"examples":[{"en":"Odontology helps scientists identify people by comparing dental records.","zh":"牙科学帮助科学家通过比对牙科记录来确认身份。"},{"en":"She studied odontology before choosing a career in dentistry.","zh":"她先学习牙科学，之后选择从事牙科工作。"}]}],"synonyms":["dentistry","dental science","forensic odontology"],"phonetic":"/ˌoʊdɑnˈtɑlədʒi/","extraExplanation":["“odontoloxia”不是常见或标准的英语单词，日常英语中几乎不会这样拼。最接近、最常用的词是“odontology”。","词源：odont- 来自希腊语，意思是“牙齿”，-logy 表示“……的学科/研究”。","用法提示：现代日常语境更常说“dentistry（牙科/牙医行业）”。“odontology”更偏学术或法医学语境（如法医牙科学）。"]}
{"word":"odontoma","summary":{"en":"Odontoma is a benign mass of tooth-forming tissue, usually in the jaw, that can sometimes block normal tooth eruption.","zh":"Odontoma（牙瘤）是由牙齿形成组织构成的良性肿块，多见于颌骨内，有时会阻碍牙齿正常萌出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a benign (non-cancerous) growth made of tooth-forming tissues (such as enamel and dentin), often found in the jaw and sometimes blocking a tooth from coming in normally","zh":"牙瘤（由牙齿形成组织如釉质、牙本质等组成的良性增生/肿块），常见于颌骨内，有时会阻碍牙齿正常萌出"},"examples":[{"en":"The dentist found an odontoma on the X-ray that was preventing the permanent tooth from erupting.","zh":"牙医在X光片上发现了一个牙瘤，正在阻碍恒牙萌出。"},{"en":"Most odontomas are harmless, but they may need to be removed if they cause pain or crowding.","zh":"大多数牙瘤是无害的，但如果引起疼痛或拥挤，可能需要切除。"}]}],"synonyms":["odontogenic hamartoma","benign odontogenic tumor"],"phonetic":"/ˌoʊdənˈtoʊmə/","extraExplanation":["“odontoma”常被认为是牙源性组织的“错构瘤（hamartoma）”，意思是组织成分多为正常牙胚相关结构，但排列/生长方式异常，因此通常生长缓慢、恶性风险极低。","临床上常见两型：compound odontoma（复合性牙瘤，常呈多个“小牙样”结构）与complex odontoma（复杂性牙瘤，呈不规则致密团块）。多在口腔影像检查中偶然发现，处理通常由口腔颌面外科或牙科医生评估后决定是否手术。"]}
{"word":"odontomous","summary":{"en":"Odontomous means “having teeth” or “toothlike,” mainly in technical/scientific contexts.","zh":"odontomous 指“有牙的/似牙的/与牙齿有关的”，主要见于科技或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having teeth; toothlike or related to teeth (used mostly in scientific or technical writing).","zh":"有牙的；似牙的；与牙齿有关的（多用于科学或技术语境）。"},"examples":[{"en":"Some fish have odonto­mous jaws adapted for crushing shells.","zh":"一些鱼类有适合压碎贝壳的有牙颌。"},{"en":"The report describes an odonto­mous edge on the fossil’s mouthparts.","zh":"报告描述了该化石口器上有一个似牙的边缘。"}]}],"synonyms":["toothed","dentate","dental","odontal","odontic"],"phonetic":"/oʊˈdɑːn.tə.məs/","extraExplanation":["这个词非常少见，写作中更常用的是 dental（牙科的）、toothed（有齿的）、dentate（具齿状的）或 odontic/odontal（与牙有关的，较学术）。","构词上常见的词根 odonto- 来自希腊语，表示“牙、牙齿”（如 orthodontics 牙齿矫正）。看到 odonto- 往往就能猜到与牙齿相关。"]}
{"word":"odontonecrosis","summary":{"en":"Odontonecrosis is the death of tooth tissue, usually due to infection, trauma, or poor blood supply.","zh":"odontonecrosis 指牙体组织坏死，常由感染、外伤或供血不足等引起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"death (necrosis) of tooth tissue, usually caused by loss of blood supply, severe infection, trauma, or radiation/medication-related damage.","zh":"牙体组织坏死（坏死性变化），通常由供血不足、严重感染、外伤，或放疗/药物相关损伤引起。"},"examples":[{"en":"The dentist suspected odontonecrosis after the tooth turned dark and stopped responding to cold tests.","zh":"牙医在发现牙齿变暗、对冷刺激测试无反应后，怀疑出现了牙体坏死。"},{"en":"Untreated infection can lead to odontonecrosis and severe pain.","zh":"未治疗的感染可能导致牙体坏死并引发剧烈疼痛。"}]}],"synonyms":["tooth necrosis","dental necrosis","pulp necrosis (related)"],"phonetic":"/oʊˌdɑn.toʊ.nəˈkroʊ.sɪs/","extraExplanation":["词源拆解：odonto-（牙）+ necrosis（坏死）。常见于医学/牙科文献，日常英语中不常用。","临床上更常见的相关说法包括“pulp necrosis（牙髓坏死）”和“osteonecrosis of the jaw/ONJ（颌骨坏死）”。“odontonecrosis”偏向泛指牙体（牙相关组织）的坏死。"]}
{"word":"odontoneuralgia","summary":{"en":"A medical term for tooth pain that comes from nerve pain (neuralgia).","zh":"医学用语：由神经痛引起的牙痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"tooth pain caused by nerve pain (neuralgia), often felt as sharp, shooting, or electric pain in or around a tooth","zh":"由神经痛（神经痛性疼痛）引起的牙痛；常表现为牙齿或其周围突发、刺痛或电击样疼痛"},"examples":[{"en":"The dentist suspected odontoneuralgia because the pain was sudden and shock-like, but the tooth looked healthy.","zh":"牙医怀疑是牙神经痛（odontoneuralgia），因为疼痛突然且像电击一样，但牙齿外观看起来很健康。"},{"en":"If your toothache comes and goes in short bursts, your doctor may consider odontoneuralgia rather than a cavity.","zh":"如果你的牙痛呈短暂发作、时有时无，医生可能会考虑牙神经痛（odontoneuralgia），而不只是蛀牙。"}]}],"synonyms":["neuralgic toothache","tooth nerve pain","dental neuralgia"],"phonetic":"/oʊˌdɑːn.toʊ.nʊˈræl.dʒə/","extraExplanation":["词源可拆解为：odonto-（牙）+ neuralgia（神经痛）。它强调“疼痛来源于神经”，而不一定是牙齿本身的结构问题（如蛀牙）。","这是较少见、偏医学/牙科文献用语；日常英语里更常说 toothache（牙痛）或 nerve pain（神经痛）。若疼痛剧烈或反复发作，应就医排查牙髓炎、三叉神经痛等可能原因。"]}
{"word":"odontonosology","summary":{"en":"A rare technical term meaning the study and classification of diseases of the teeth.","zh":"一个较少见的专业术语，指研究并分类牙齿疾病的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study and classification of diseases of the teeth (dental pathology and diagnosis).","zh":"牙科疾病学；研究并分类牙齿疾病（与牙科病理与诊断相关）。"},"examples":[{"en":"Odontonosology focuses on identifying and classifying diseases that affect teeth, such as caries and pulp inflammation.","zh":"牙科疾病学侧重于识别并分类影响牙齿的疾病，例如龋齿和牙髓炎。"},{"en":"In older dental texts, odontonosology was sometimes used as a label for chapters on dental diseases.","zh":"在较早的牙科教材中，odontonosology 有时被用作“牙齿疾病”章节的标题。"}]}],"synonyms":["dental pathology","oral pathology","odontology (broader)"],"phonetic":"/ˌoʊˌdɑn.toʊ.noʊˈsɑl.ə.dʒi/","extraExplanation":["这是一个非常少见、偏学术/旧式的词，多见于早期医学或牙科文献标题中；现代英语更常用 dental pathology（牙科病理学）或 oral pathology（口腔病理学）。","词源可拆分理解：odonto-（牙）+ noso-（疾病）+ -logy（学科/研究）。因此可直译为“牙齿疾病之学”。"]}
{"word":"odontopathy","summary":{"en":"A medical term meaning a disease or disorder of the teeth.","zh":"医学用语，指牙齿的疾病或病变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A disease or disorder of the teeth; a dental problem.","zh":"牙齿疾病；牙齿的病变（口腔问题的一种）。"},"examples":[{"en":"The dentist diagnosed the pain as an odontopathy caused by severe decay.","zh":"牙医诊断这次疼痛是由严重蛀牙引起的牙齿病变。"},{"en":"Untreated odontopathy can lead to infection and swelling in the gums.","zh":"未治疗的牙齿病变可能导致感染和牙龈肿胀。"}]}],"synonyms":["dental disease","tooth disorder","tooth disease","tooth problem"],"phonetic":"/ˌoʊdɑnˈtɑpəθi/","extraExplanation":["词源：odonto- 表示“牙”，-pathy 表示“疾病/病变”。这是偏医学、学术的用词；日常英语更常说 tooth problem、dental disease、tooth decay（蛀牙）等。"]}
{"word":"odontophobia","summary":{"en":"Odontophobia is an intense fear of dentists or dental treatment.","zh":"Odontophobia 指对牙医或牙科治疗的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong fear of dentists, dental treatment, or dental procedures.","zh":"对牙医、牙科治疗或牙科操作的强烈恐惧（牙科恐惧症）。"},"examples":[{"en":"Because of odontophobia, she avoids going to the dentist even when she has tooth pain.","zh":"因为有牙科恐惧症，她即使牙痛也会避免去看牙医。"},{"en":"He told the dentist about his odontophobia, and they agreed to take breaks during the visit.","zh":"他告诉牙医自己有牙科恐惧症，于是他们同意在治疗过程中适当休息。"}]}],"synonyms":["dental phobia","fear of the dentist","dental anxiety"],"phonetic":"/ˌoʊˌdɑːn.təˈfoʊ.bi.ə/","extraExplanation":["词源拆解：odonto- 来自希腊语，意为“牙齿”；-phobia 意为“恐惧”。合起来就是“对牙齿/牙科相关事物的恐惧”。","使用场景：多见于医学或心理学语境；日常口语里更常说 “fear of the dentist / dental anxiety”。"]}
{"word":"odontophoral","summary":{"en":"Odontophoral means “related to the odontophore,” the structure that supports and moves a mollusk’s radula for feeding.","zh":"Odontophoral 指“与齿舌支架（odontophore）有关的”，即支撑并带动软体动物齿舌以便取食的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an odontophore—a supporting, often cartilaginous structure in many mollusks that holds and moves the radula (the toothed, scraping organ used for feeding).","zh":"与“齿舌支架（odontophore）”有关的；指许多软体动物体内用于支撑并带动齿舌（radula，带齿的刮食器官）的结构（常为软骨样组织）。"},"examples":[{"en":"In many snails, odontophoral muscles help move the radula during feeding.","zh":"在许多蜗牛中，齿舌支架相关的肌肉会在进食时帮助带动齿舌运动。"},{"en":"The paper describes odontophoral anatomy to explain how the mollusk scrapes algae from rocks.","zh":"论文描述了齿舌支架相关的解剖结构，用以解释这种软体动物如何把岩石上的藻类刮下来。"}]}],"synonyms":["odontophore-related","radula-supporting"],"phonetic":"/oʊˌdɑn.təˈfɔr.əl/","extraExplanation":["该词多见于动物学/软体动物学的学术语境，日常英语几乎不用。","词源可拆解理解：odonto- 表示“牙/齿”，-phor- 表示“携带/承载”，整体可理解为“承载牙齿状结构（齿舌）的（部位/结构）”。"]}
{"word":"odontophoran","summary":{"en":"Odontophoran describes (or refers to) animals, especially mollusks, that have a radula (“toothed tongue”) supported by an odontophore.","zh":"odontophoran 指（或描述）具有齿舌（像“带齿的舌头”）并由齿舌支撑器支撑的动物，尤指软体动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) An animal—especially a mollusk—that has a radula (a ribbon-like “toothed tongue”) supported by an odontophore.","zh":"（动物学）有齿舌（radula，像“带齿的舌头”）且由齿舌支撑器（odontophore）支撑的动物，尤指软体动物。"},"examples":[{"en":"Many snails are odontophorans that scrape algae from rocks with a radula.","zh":"许多蜗牛属于有齿舌动物，它们用齿舌从岩石上刮取藻类。"},{"en":"The researcher compared the feeding structures of different odontophorans.","zh":"研究人员比较了不同有齿舌动物的取食结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to, or having, a radula and odontophore.","zh":"（形容）与齿舌及其支撑结构有关的；具有齿舌及齿舌支撑器的。"},"examples":[{"en":"Odontophoran mouthparts are well adapted for scraping or drilling.","zh":"有齿舌类的口器很适合刮食或钻孔取食。"}]}],"synonyms":["radulate","radula-bearing"],"phonetic":"/oʊˌdɑn.təˈfɔr.ən/","extraExplanation":["词源可拆为 odonto-（“牙、齿”）+ -phoran（“携带、承载”）。在一些较早或较专门的分类/形态学语境中，用来强调“具有齿舌（radula）”这一特征，常见于软体动物（如蜗牛、海螺等）的取食结构描述。"]}
{"word":"odontophore","summary":{"en":"An odontophore is a mollusk structure that supports and moves the radula for feeding.","zh":"odontophore 指软体动物中支撑并推动齿舌、用于取食的结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A supporting structure in many mollusks (such as snails) that holds and helps move the radula (the toothed, tongue-like scraping organ) used for feeding.","zh":"（软体动物的）齿舌支架／齿舌骨：一种支撑结构，用来承托并帮助移动齿舌（带“牙齿”的舌状刮食器官），用于取食。"},"examples":[{"en":"In many snails, the odontophore supports the radula as it scrapes algae off rocks.","zh":"在许多蜗牛中，齿舌支架支撑齿舌，使其能刮取岩石上的藻类。"},{"en":"The lab report asked us to label the radula and odontophore in the mollusk’s feeding system.","zh":"实验报告要求我们标注软体动物取食系统中的齿舌和齿舌支架。"}]}],"synonyms":["radular support","radula-supporting structure"],"phonetic":"/oʊˈdɑn.təˌfɔr/","extraExplanation":["词源提示：odonto- 表示“牙”，-phore 表示“携带/承载”。因此 odontophore 字面意思是“承载牙齿的结构”，与齿舌（radula）的“带齿”功能相呼应。","学习小贴士：在生物学文本里，你常会看到搭配用法：radula（齿舌）+ odontophore（齿舌支架）。两者是相关但不同的结构。"]}
{"word":"odontophoridae","summary":{"en":"Odontophoridae is the bird family known as the New World quails, mainly found in the Americas.","zh":"Odontophoridae 指新世界鹑科，主要分布在美洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of birds commonly called the New World quails, found mainly in the Americas (e.g., bobwhites and wood quail).","zh":"鸟类的一个科，常称“新世界鹑科”，主要分布于美洲（如北美鹑、林鹑等）。"},"examples":[{"en":"Bobwhites belong to the family Odontophoridae.","zh":"北美鹑属于新世界鹑科（Odontophoridae）。"},{"en":"Researchers compared Odontophoridae with Old World quails to study their evolution.","zh":"研究人员把新世界鹑科与旧世界的鹌鹑作比较，以研究它们的演化。"}]}],"synonyms":["New World quails (common name)"],"phonetic":"/oʊˌdɑːnˈtɑːfərɪˌdiː/","extraExplanation":["这是一个生物分类学（taxonomy）术语，拉丁学名写作 Odontophoridae，常用于学术文章、野外图鉴和博物馆标签中；日常英语里更常说 “New World quails（新世界鹑类）”。","词源可拆看：odonto- 表“牙/齿”，-phor- 表“携带”，-idae 是动物“科”的常见后缀；名称与其某些形态特征有关，但学习时把它记作“新世界鹑科”最实用。"]}
{"word":"odontophorinae","summary":{"en":"Odontophorinae is the taxonomic subfamily name for the New World quails.","zh":"Odontophorinae 指“新大陆鹑”的分类学亚科名称（齿鹑亚科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of birds in the family Odontophoridae, commonly called the New World quails (for example, bobwhites and quail-like species found in the Americas).","zh":"（鸟类分类）齿鹑亚科：齿鹑科（Odontophoridae）中的一个亚科，通常称为“新大陆鹑”（分布于美洲，如北美鹑等）。"},"examples":[{"en":"The bobwhite is often discussed within the New World quails (Odontophorinae).","zh":"北美鹑常被作为新大陆鹑（齿鹑亚科，Odontophorinae）的代表来讨论。"},{"en":"Some field guides separate Odontophorinae from Old World quails to show they are not closely related.","zh":"一些野外图鉴会把齿鹑亚科（Odontophorinae）与旧大陆鹑分开写，以强调它们亲缘关系并不近。"}]}],"synonyms":["New World quails"],"phonetic":"/oʊˌdɑːn.təˈfɔːr.ɪ.niː/","extraExplanation":["这是一个生物分类学名称（拉丁化学名），常见于论文、物种名录、博物馆标签等语境，日常英语里更常说 New World quails（新大陆鹑）。","词源可拆解为 odonto-（“牙”）+ -phor-（“携带/承载”）+ -inae（动物“亚科”后缀）。这里的“牙”通常指喙或口部结构的特征命名传统，并不表示真的长出类似哺乳动物的牙。"]}
{"word":"odontophorine","summary":{"en":"Odontophorine means “related to” or “a member of” the New World quails (Odontophoridae).","zh":"odontophorine 指“与新大陆鹑科有关的”，或“新大陆鹑科的成员”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the New World quails (the bird family Odontophoridae, such as bobwhites and wood quails).","zh":"（形）与新大陆鹑科（Odontophoridae，如北美鹌鹑、林鹑等）有关的。"},"examples":[{"en":"The researcher compared odontophorine calls across different habitats.","zh":"研究人员比较了不同栖息地中新大陆鹑科鸟类的叫声。"},{"en":"Odontophorine species are common topics in studies of North American game birds.","zh":"新大陆鹑科物种常见于北美猎禽研究中。"}]},{"partOfSpeech":"n.","definition":{"en":"a bird belonging to the New World quails (Odontophoridae).","zh":"（名）新大陆鹑科的鸟；新大陆鹑科成员。"},"examples":[{"en":"Several odontophorines were spotted near the brushy edge of the field.","zh":"在田地灌木边缘有人看见了几只新大陆鹑科鸟类。"}]}],"synonyms":["odontophorid","New World quail (general term)"],"phonetic":"/ˌoʊdɑnˈtɑfərɪn/","extraExplanation":["这是一个较少见的动物学用词，多用于学术写作。词根来自希腊语：odont- 表示“牙”，-phor 表示“携带/负载”，原意与“带齿/齿状结构”有关；相关鸟类因喙或口腔结构特征而得名。","相关词：Odontophoridae（新大陆鹑科，名词/分类名）、odontophorid（更常见的形容词/名词写法）。"]}
{"word":"odontophorous","summary":{"en":"Odontophorous means “bearing teeth” or “having tooth-like structures,” mainly used in biological descriptions.","zh":"Odontophorous 指“带牙的/有齿状结构的”，主要用于生物学等学术描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in biology) bearing or carrying teeth; having tooth-like structures.","zh":"（尤用于生物学）长有牙齿的；带有齿状结构的。"},"examples":[{"en":"Many mollusks have an odontophorous radula used to scrape food from surfaces.","zh":"许多软体动物有带齿的齿舌，用来从表面刮取食物。"},{"en":"The scientist described the fossil as odontophorous, noting rows of tiny tooth-like projections.","zh":"科学家将这块化石描述为“长有齿状结构的”，并指出其上有一排排微小的齿状突起。"}]}],"synonyms":["toothed","dentate","tooth-bearing"],"phonetic":"/ˌoʊˌdɑn.təˈfɔr.əs/","extraExplanation":["词源：odonto- 来自希腊语 odous/odont-（“牙”），-phorous 来自 -phoros（“携带、承载”）。因此字面意思是“带牙的”。","使用场景：这是较少见的学术/技术词，常出现在动物学、古生物学或解剖学语境中，尤其与软体动物的“齿舌（radula）”等结构相关。"]}
{"word":"odontophorus","summary":{"en":"Odontophorus is a genus name for wood quails native to Central and South America.","zh":"Odontophorus 是齿鹑属的学名，指中南美洲的林鹑/木鹑类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of New World quails (often called wood quails) found in Central and South America.","zh":"（动物学）齿鹑属：一种生活在中南美洲的新大陆鹌鹑类群，常被称为“林鹑/木鹑”。"},"examples":[{"en":"Researchers recorded the calls of several Odontophorus species in a cloud forest in Ecuador.","zh":"研究人员在厄瓜多尔的云雾林中记录了几种齿鹑属鸟类的鸣声。"},{"en":"Odontophorus quails are shy birds that usually stay hidden in dense undergrowth.","zh":"齿鹑属的鹌鹑通常很害羞，常躲在茂密的灌木丛下。"}]}],"synonyms":["wood quail (common name, not exact synonym)"],"phonetic":"/ˌoʊdɑnˈtɑfərəs/","extraExplanation":["词源提示：Odontophorus 来自希腊语词根 odonto-（“牙”）+ -phorus（“携带/承载”）。在生物分类命名中，这类组合常用来描述某些外形特征，但具体指代的特征可能需要参考该属的原始分类描述。","用法提示：这是一个拉丁化的学名（属名），写作时通常首字母大写并用斜体（Odontophorus）；口语或科普语境更常说 wood quail（林鹑/木鹑）。"]}
{"word":"odontoplast","summary":{"en":"A rare, old term for a dental worker who makes or reshapes teeth, especially artificial teeth.","zh":"一个罕见的旧词，指制作或塑形修复牙齿（尤其是假牙）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes or shapes artificial teeth, or restores teeth by reshaping them (an old, rare term related to dental work).","zh":"牙齿修复者；制作或塑形假牙的人，或通过塑形来修复牙齿的人（较旧且少见的用语，和牙科工作有关）。"},"examples":[{"en":"In older medical writing, an odontoplast was someone who specialized in shaping teeth or making false teeth.","zh":"在较早的医学文献中，odontoplast 指专门塑形牙齿或制作假牙的人。"},{"en":"Today we would usually say “dentist,” “prosthodontist,” or “dental technician” instead of odontoplast.","zh":"如今我们通常会说“dentist（牙医）”、“prosthodontist（修复科牙医）”或“dental technician（义齿技师）”，而不是 odontoplast。"}]}],"synonyms":["dentist","dental surgeon","prosthodontist","dental technician"],"phonetic":"/oʊˈdɑːn.toʊ.plæst/","extraExplanation":["词源上可拆为 odonto-（牙）+ -plast（塑形、成形的人/物）。因此它强调“把牙齿做出来或塑形修复”的含义。","这个词在现代英语中非常罕见，多见于较早的医学/牙科文献；日常交流几乎不用。"]}
{"word":"odontoplerosis","summary":{"en":"Odontoplerosis is a rare dental term for hard-tissue buildup in a tooth that narrows or fills the pulp space.","zh":"Odontoplerosis 指牙内硬组织沉积增生，使牙髓腔/根管变窄或闭锁的罕见牙科术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dentistry/medicine) A condition where hard tissue (usually dentin) is deposited inside a tooth, often narrowing or filling the pulp chamber/canal (tooth “sclerosis” or pulp obliteration).","zh":"（牙科/医学）牙内硬组织（多为牙本质）在牙髓腔或根管内增生沉积，导致牙髓腔变窄甚至被“填满/闭锁”的情况（类似牙本质硬化、牙髓腔闭锁）。"},"examples":[{"en":"The radiograph showed odontoplerosis, with the pulp space almost completely obliterated.","zh":"X 光片显示牙内硬组织增生（odontoplerosis），牙髓腔几乎完全闭锁。"},{"en":"Odontoplerosis can make root canal treatment more difficult because the canal is hard to locate.","zh":"由于根管不易找到，odontoplerosis 可能会让根管治疗更困难。"}]}],"synonyms":["dentin sclerosis","pulp canal obliteration","pulp obliteration"],"phonetic":"ˌoʊˌdɑn.toʊ.pləˈroʊ.sɪs","extraExplanation":["这是一个非常少见、偏专业的术语，多用于牙科影像或病理描述。一般可与“dentin sclerosis（牙本质硬化）”“pulp canal obliteration（根管/牙髓腔闭锁）”等概念相近理解，但具体用法会因文献而异。","词源上常被解释为 odonto-（牙）+ plerosis（充满/填塞，来自希腊语相关词根），直观含义就是“牙内被填满”。"]}
{"word":"odontopteris","summary":{"en":"Odontopteris is an extinct fossil plant genus known for fern-like leaves, often discussed in the context of Carboniferous–Permian seed-fern fossils.","zh":"Odontopteris 是一种已灭绝的化石植物属，以类蕨的叶片化石著称，常见于石炭纪—二叠纪并与“种子蕨”化石研究相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct, fern-like fossil plants (often classified as seed ferns) known mainly from leaf fossils from the late Paleozoic era.","zh":"一种已灭绝的、类蕨形态的化石植物属（常被归为“种子蕨”类群），主要通过晚古生代的叶片化石为人所知。"},"examples":[{"en":"Odontopteris leaves are common fossils in some Carboniferous coal deposits.","zh":"在一些石炭纪煤层沉积中，Odontopteris 的叶片化石很常见。"},{"en":"The museum displayed a slab with Odontopteris impressions beside other seed-fern fossils.","zh":"博物馆展出了一块带有 Odontopteris 印痕的岩板，旁边还有其他种子蕨化石。"}]}],"synonyms":["seed fern (related group)","pteridosperm (related term)"],"phonetic":"/oʊˌdɑnˈtɑptərɪs/","extraExplanation":["词源提示：Odontopteris 来自希腊语词根 odonto-（“牙”）与 pteris（“蕨”），名字通常与叶缘或叶片裂片呈“齿状”的外观有关。","古生物学语境：它多见于石炭纪—二叠纪的地层记录，常与“煤沼森林”环境联系在一起；虽然外形像蕨类，但在许多分类体系中更接近“种子蕨（pteridosperms）”这一已灭绝的种子植物类群。"]}
{"word":"odontopteryx","summary":{"en":"Odontopteryx is an extinct genus of seabirds with tooth-like bony projections on the beak.","zh":"Odontopteryx（齿颌翼鸟属）是已灭绝的海鸟属，喙缘具有类似牙齿的骨质突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large seabirds known for having tooth-like projections along the edges of the beak (a “bony-toothed” bird), found in the fossil record.","zh":"（古生物）齿颌翼鸟属：一种已灭绝的大型海鸟属，以喙缘有类似牙齿的骨质突起（“骨齿鸟”）而闻名，常见于化石记录中。"},"examples":[{"en":"Odontopteryx is often mentioned in discussions of bony-toothed birds and their unusual beaks.","zh":"在讨论“骨齿鸟”及其不寻常的喙部时，常会提到齿颌翼鸟属（Odontopteryx）。"},{"en":"A museum label described the fossil as Odontopteryx, an ancient seabird adapted for catching slippery prey.","zh":"博物馆说明牌将这件化石标注为齿颌翼鸟属（Odontopteryx），一种适合捕捉滑溜猎物的古代海鸟。"}]}],"synonyms":["bony-toothed bird","pelagornithid (informal/related term)"],"phonetic":"/ˌoʊ.dən.toʊˈptɛr.ɪks/","extraExplanation":["“Odontopteryx”来自希腊语词根：odonto-（牙）+ pteryx（翼/翅），字面意思接近“有牙的翅/翼”。这里的“牙”并不是真正的牙齿，而是喙缘的骨质锯齿状突起。","它常被归入“鹈形类近缘的骨齿鸟”（Pelagornithidae）相关研究语境中；该类群生活在古近纪到新近纪早期的海洋环境，体型可很大，可能以鱼类、乌贼等为食。","这是一个学术/科普语境中更常见的专有名词，通常不会出现在日常英语里；在阅读博物馆展板、古生物纪录片或学术文章时更容易遇到。"]}
{"word":"odontorhynchous","summary":{"en":"Odontorhynchous describes an animal with a beak or snout that has teeth.","zh":"Odontorhynchous 指动物的喙或口鼻部带有牙齿（或齿状突起）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a beak or snout that bears teeth (or tooth-like projections); toothed-beaked or toothed-snouted.","zh":"（动物学）有长喙或口鼻部带牙齿（或类似牙齿的突起）的；有“齿喙/齿鼻”的。"},"examples":[{"en":"Some fossils were described as odontorhynchous because their beak-like jaws carried small teeth.","zh":"一些化石被描述为 odontorhynchous，因为它们的喙状颌部带有小牙齿。"},{"en":"The paper compares odontorhynchous and toothless species to discuss feeding evolution.","zh":"论文比较了“有齿喙”的物种与无齿物种，以讨论取食方式的演化。"}]}],"synonyms":["toothed-beaked","toothed-snouted"],"phonetic":"/oʊˌdɑn.toʊˈrɪŋ.kəs/","extraExplanation":["词源提示：odonto- 来自希腊语，意为“牙”；-rhynchous 来自 rhynchos，意为“喙/口鼻部”。合起来就是“有牙的喙/口鼻”。","使用场景：这个词非常罕见，主要出现在动物学、古生物学或分类学的正式描述里，用来强调口器结构特征，而不是日常英语。"]}
{"word":"odontormae","summary":{"en":"“odontormae” is not a standard English word; it most likely refers to “odontoma,” a benign tooth-tissue growth in the jaw.","zh":"“odontormae”不是标准英语词；它很可能指“odontoma（牙瘤）”，一种发生在颌骨的良性牙源性组织增生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) A benign growth made of tooth-forming tissues (enamel, dentin, etc.), usually found in the jaw; commonly called an “odontoma.”","zh":"（很可能是拼写错误）由牙齿形成组织（如牙釉质、牙本质等）构成的良性增生/肿物，常见于颌骨；通常称为“牙瘤（odontoma）”。"},"examples":[{"en":"The X-ray showed a small odontoma blocking the tooth from coming in.","zh":"X 光片显示有一个小牙瘤挡住了牙齿萌出。"},{"en":"Odontomas are usually benign, but they can prevent normal tooth eruption.","zh":"牙瘤通常是良性的，但可能会影响牙齿正常萌出。"}]}],"synonyms":["odontoma","odontome (variant spelling)"],"phonetic":"/ˌoʊdənˈtoʊmə/","extraExplanation":["“odontormae”在英语里几乎不作为标准词出现，更常见的医学/牙科术语是“odontoma”（牙瘤）。如果你是在报告或论文里看到“odontormae”，很可能是拼写错误或扫描/OCR 识别错误。","如果你能提供句子或出处（例如病理报告原文），我可以帮你确认它到底想写的是“odontoma”、还是别的类似词（如 odontome/odontoma 的不同拼法）。"]}
{"word":"odontornithes","summary":{"en":"Odontornithes refers to extinct prehistoric birds known from fossils that had teeth.","zh":"Odontornithes 指一类已灭绝的史前“有齿鸟类”，以化石所见的牙齿为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct group of prehistoric birds that had teeth (known from fossils, especially from the Late Cretaceous).","zh":"（古生物）有齿鸟类：一种已灭绝的史前鸟类类群，化石显示它们长有牙齿（多见于晚白垩世）。"},"examples":[{"en":"Odontornithes are famous because they show that early birds could have teeth.","zh":"有齿鸟类之所以有名，是因为它们显示早期鸟类可能长有牙齿。"},{"en":"Fossils like Ichthyornis are often discussed when people talk about Odontornithes.","zh":"人们谈到有齿鸟类时，经常会提到像鱼鸟（Ichthyornis）这样的化石。"}]}],"synonyms":["toothed birds"],"phonetic":"/oʊˌdɑn.tɔrˈnaɪ.θiz/","extraExplanation":["“Odontornithes”来自希腊语词根：odonto-（牙齿）+ ornith-（鸟）。这是一个偏历史性的分类名称，常见于较早的古生物学文献。","在现代分类学中，这个词不一定作为正式“纲/目”等级被频繁使用，但在科普或历史讨论里仍可用来泛指“有牙齿的化石鸟类”。","相关代表常包括 Ichthyornis（鱼鸟，能飞、类似海鸟）与 Hesperornis（西方鸟，常被认为更擅长游泳、趋于不会飞）。"]}
{"word":"odontornithic","summary":{"en":"“Odontornithic” means related to extinct toothed birds known from fossils.","zh":"“odontornithic”指与已灭绝的“有牙的鸟”（齿鸟类）化石类群相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to extinct “toothed birds” (Odontornithes), an ancient group of fossil birds with teeth.","zh":"与“齿鸟类”（Odontornithes，已灭绝的“有牙的鸟”化石类群）有关的；齿鸟类的。"},"examples":[{"en":"Scientists compared odontornithic fossils with modern seabirds to study early bird evolution.","zh":"科学家把齿鸟类化石与现代海鸟作比较，以研究鸟类早期的演化。"},{"en":"The museum’s new exhibit includes an odontornithic skull showing small teeth along the jaw.","zh":"博物馆的新展览中有一具齿鸟类头骨，能看到颌骨边缘排列的小牙齿。"}]}],"synonyms":["toothed-bird (related)","Odontornithes (related)"],"phonetic":"/oʊˌdɑːn.toʊrˈnɪθ.ɪk/","extraExplanation":["这个词很少见，通常出现在古生物学或演化生物学的学术语境中。","词源上由希腊语 odonto-（牙）+ ornith-（鸟）+ -ic（……的）构成，字面意思就是“有牙的鸟的/与牙鸟有关的”。"]}
{"word":"odontorrhagia","summary":{"en":"Odontorrhagia means bleeding from the mouth or gums, especially around the teeth.","zh":"Odontorrhagia 指口腔或牙龈出血，尤指牙齿周围的出血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bleeding from the mouth or gums (especially bleeding around the teeth).","zh":"口腔或牙龈出血（尤指牙齿周围的出血）。"},"examples":[{"en":"After the dental cleaning, she noticed slight odontorrhagia when she brushed her teeth.","zh":"洗牙后，她刷牙时发现有轻微的牙龈出血（odontorrhagia）。"},{"en":"If odontorrhagia is persistent or heavy, a dentist should check for gum disease or other causes.","zh":"如果口腔出血持续或出血量大，应让牙医检查是否有牙周病或其他原因。"}]}],"synonyms":["gum bleeding","gingival bleeding","oral bleeding"],"phonetic":"/ˌoʊˌdɑn.təˈreɪ.dʒə/","extraExplanation":["这是一个较少见、偏医学书面语的词，临床与日常交流中更常说 gum bleeding（牙龈出血）或 oral bleeding（口腔出血）。","词源来自希腊语：odonto-（牙）+ -rrhagia（大量出血/出血），同类构词可见于 hemorrhage（出血）。","若出现频繁牙龈出血，常见原因包括牙龈炎/牙周病、刷牙过用力、维生素C缺乏、某些药物（如抗凝药）或凝血功能问题；严重或不明原因出血应就医。"]}
{"word":"odontorthosis","summary":{"en":"Odontorthosis is a rare technical noun meaning orthodontic correction of teeth/jaw irregularities.","zh":"Odontorthosis 是较少见的专业名词，指对牙齿/颌骨不齐进行的正畸矫正治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the correction of irregularities of the teeth or jaw; orthodontic treatment (a rare/technical term).","zh":"矫正牙齿或颌骨不整齐的治疗；正畸治疗（较少见的专业术语）。"},"examples":[{"en":"The patient was referred for odontorthosis to correct crowded front teeth.","zh":"患者被转诊进行 odontorthosis（正畸治疗），以矫正前牙拥挤。"},{"en":"In older medical writing, odontorthosis sometimes appears as another term for orthodontics.","zh":"在较早的医学文献中，odontorthosis 有时用作 orthodontics（正畸学/正畸治疗）的另一种说法。"}]}],"synonyms":["orthodontics","orthodontic treatment","dental correction","dental orthosis"],"phonetic":"/oʊˌdɑnˌtɔrˈθoʊsɪs/","extraExplanation":["词源上可拆为 odonto-（“牙、牙齿”，源自希腊语）+ orthosis（“矫正/矫形”，常见于医学名词，如 orthosis 指“矫形器/矫正装置”）。因此整体含义与“牙齿矫正”密切相关。","现代英语中更常用的是 orthodontics（学科）或 orthodontic treatment（治疗）。odontorthosis 属于较罕见的术语，阅读专业或旧文献时可能遇到。"]}
{"word":"odontoschism","summary":{"en":"Odontoschism means a split or fissure in a tooth.","zh":"Odontoschism 指牙齿的裂开或裂隙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a split, cleft, or fissure in a tooth (often describing a developmental defect or structural crack).","zh":"（牙科）牙齿的裂开、裂隙或裂缝（常指发育缺陷或结构性裂裂）。"},"examples":[{"en":"The dentist noted an odontoschism on the molar that could trap food and lead to decay.","zh":"牙医发现臼齿上有牙裂（odontoschism），容易卡食物并引发蛀牙。"},{"en":"Pain when biting may suggest a crack such as an odontoschism.","zh":"咬合疼痛可能提示存在牙裂之类的问题，例如 odontoschism。"}]}],"synonyms":["tooth fissure","dental fissure","tooth crack","cracked tooth"],"phonetic":"/ˌoʊ.dɑn.toʊˈskɪz.əm/","extraExplanation":["词源：odonto- 表示“牙”，来自希腊语 odous/odont-；-schism 表示“分裂/裂开”，来自希腊语 skhizein（劈开）。合起来就是“牙的裂开”。","这是非常少见、偏学术的术语；在日常牙科语境里更常听到 crack（牙裂/裂纹）、tooth fissure（牙裂隙）或 cracked tooth（裂牙）等表达。"]}
{"word":"odontoscope","summary":{"en":"An odontoscope is a tool used to examine teeth.","zh":"odontoscope 指用于检查牙齿的器械（牙镜/牙科检查器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to examine teeth (especially the inside of the mouth and tooth surfaces).","zh":"牙科检查器；牙镜（用于检查牙齿与口腔内部的器械）。"},"examples":[{"en":"The dentist used an odontoscope to check for cavities.","zh":"牙医用牙镜检查是否有蛀牙。"},{"en":"With an odontoscope, the clinician can see cracks that are hard to notice otherwise.","zh":"借助牙镜，临床医生能看到不容易察觉的细小裂纹。"}]}],"synonyms":["dental mirror","dentist’s mirror","dental instrument"],"phonetic":"/oʊˈdɑːntəˌskoʊp/","extraExplanation":["词源提示：odon(to)- 来自希腊语“odous/odont-”（牙齿），-scope 表示“观察的器具/镜”。因此 odontoscope 字面意思就是“看牙的器具”。在日常英语里，更常见的说法是 dental mirror（牙镜）或 dental instrument（牙科器械）。"]}
{"word":"odontosis","summary":{"en":"Odontosis is a rare medical term meaning a tooth disorder (and in older usage, teething/tooth eruption).","zh":"Odontosis 是较少见的医学用语，指牙齿疾病/异常（旧用法也可指出牙/长牙期）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A disease or abnormal condition of the teeth; tooth disorder.","zh":"（医学）牙齿的疾病或异常状况；牙病/牙齿病变。"},"examples":[{"en":"The dentist ruled out odontosis and said the pain came from gum inflammation instead.","zh":"牙医排除了牙齿病变（odontosis），并表示疼痛其实来自牙龈炎。"},{"en":"In older medical writing, “odontosis” could refer to various tooth disorders rather than one specific diagnosis.","zh":"在较早的医学文献中，“odontosis”可能泛指多种牙齿问题，而不是某一种明确诊断。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/older use) The process of tooth eruption; teething.","zh":"（少见/旧用法）出牙过程；长牙期（出牙/磨牙期）。"},"examples":[{"en":"Some older texts use “odontosis” to describe the discomfort of teething in infants.","zh":"一些旧文献用“odontosis”来描述婴儿出牙期的不适。"}]}],"synonyms":["dental disorder","tooth disease","tooth eruption (older sense)","teething (older sense)"],"phonetic":"/ˌoʊdɑnˈtoʊsɪs/","extraExplanation":["词源提示：odont- 来自希腊语 odous/odont-（“牙”），-osis 常见于医学名词，表示“疾病、异常状态或过程”。因此 odontosis 字面上可理解为“牙齿的异常/病变（或过程）”。","使用提醒：该词在现代日常英语和常规牙科沟通中非常少见；临床和科普中更常见的表达通常是 tooth disease、dental disorder、tooth eruption/teething 等。"]}
{"word":"odontostomatous","summary":{"en":"Odontostomatous means relating to both the teeth and the mouth (a medical term).","zh":"odontostomatous 指与牙齿和口腔都有关（偏医学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Related to the teeth and the mouth; dental-and-oral.","zh":"（医学）与牙齿和口腔有关的；牙口相关的。"},"examples":[{"en":"The patient has an odontostomatous infection affecting the gums and inner cheek.","zh":"病人有牙口相关的感染，影响到牙龈和口腔内侧的脸颊。"},{"en":"Odontostomatous examination includes checking both teeth and oral tissues.","zh":"牙口相关检查包括查看牙齿和口腔组织。"}]}],"synonyms":["dental and oral","oral","dental"],"phonetic":"/oʊˌdɑn.toʊˈstoʊ.mə.təs/","extraExplanation":["这是一个较少见、偏专业的医学形容词，常出现在病例报告或学术写作中。","构词上由 odonto-（表示“牙/牙齿”）+ stomat-（表示“口/口腔”）+ -ous（形容词后缀“……的”）组成，因此含义直观：同时涉及“牙齿”和“口腔”。","日常英语里更常用的说法是 dental and oral（牙科与口腔的）、oral health（口腔健康）等；odontostomatous 更强调专业、合并范围更广。"]}
{"word":"odontostomous","summary":{"en":"Odontostomous describes an animal that has a toothed mouth or tooth-like mouthparts.","zh":"Odontostomous 指动物具有带牙或齿状结构的口部（齿口）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal, especially an insect or fish) having a mouth equipped with teeth or tooth-like structures.","zh":"（指动物，尤指昆虫或鱼类）具齿口的；口部有牙齿或类似牙齿结构的。"},"examples":[{"en":"Some odontostomous insects can bite through tough plant tissue.","zh":"一些具齿口的昆虫能咬穿坚韧的植物组织。"},{"en":"The larvae are odontostomous, using tooth-like parts to grasp food.","zh":"这些幼虫是具齿口的，会用类似牙齿的口器抓取食物。"}]}],"synonyms":["toothed","dentate","having toothed mouthparts"],"phonetic":"/oʊˌdɑn.toʊˈstɑ.məs/","extraExplanation":["词源上可拆为希腊语词根：odonto-（“牙”）+ stoma（“口”）+ -ous（形容词后缀“……的”），字面意思就是“有牙之口”。","这是偏学术的动物学/昆虫学形容词，日常英语中很少用。更常见的表达会用 with toothed mouthparts（有齿状口器的）或 having teeth（有牙的）。"]}
{"word":"odontosyllis","summary":{"en":"Odontosyllis is a scientific name for a group of marine worms famous for bioluminescent mating displays.","zh":"Odontosyllis 是一个海洋多毛类（沙蚕）属的学名，以生物发光的求偶展示而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small marine bristle worms (polychaetes) known for spectacular bioluminescent courtship displays, especially in some tropical waters.","zh":"（海洋）齿吻沙蚕属：一类小型海洋多毛类（沙蚕/刚毛虫），以某些种类在求偶时出现绚丽的生物发光现象而闻名。"},"examples":[{"en":"Tourists in Bermuda sometimes watch Odontosyllis light up the water during its mating display.","zh":"在百慕大，有时游客会观看齿吻沙蚕属（Odontosyllis）在交配展示时点亮海水的景象。"},{"en":"The scientist studied Odontosyllis to understand how bioluminescence is controlled.","zh":"这位科学家研究齿吻沙蚕属（Odontosyllis），以了解生物发光是如何被控制的。"}]}],"synonyms":["fireworm","bioluminescent polychaete","bristle worm"],"phonetic":"/oʊˌdɑːn.toʊˈsɪl.ɪs/","extraExplanation":["这是一个学名（属名），通常不翻译成日常词汇；在科普或旅行语境里，人们更常用“fireworm（发光虫/火虫）”或直接说“bioluminescent worm（会发光的海虫）”。","齿吻沙蚕属的某些种类会在特定月相与时间进行“同步发光”的求偶行为：雌虫释放发光物质形成光圈/光带，吸引雄虫靠近。这一现象在百慕大等地很有名。","发音上可分成几段来读：odonto-（与“tooth/牙”相关的词根）+ syllis（来自该类群的命名）。"]}
{"word":"odontotechny","summary":{"en":"Odontotechny is an uncommon, old term for dental technology, especially the making of artificial teeth (dentures).","zh":"Odontotechny 是较少见的旧词，指牙科技术，尤指制作假牙（义齿）的工艺与实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the art or practice of making and fitting artificial teeth (dental prosthetics); dental technology (an uncommon, old-fashioned term).","zh":"（不常用、较旧的说法）义齿制作与装配的技术；牙科修复技术（牙科技工/牙科技术）。"},"examples":[{"en":"In the 1800s, some writers used “odontotechny” to describe the craft of making dentures.","zh":"在19世纪，一些作者用“odontotechny”来指制作假牙（义齿）的手艺。"},{"en":"She studied dental technology—what older books might call odontotechny.","zh":"她学习的是牙科技术——在一些旧书里可能会称作 odontotechny。"}]}],"synonyms":["dental technology","denture-making","prosthetic dentistry","prosthodontics"],"phonetic":"/ˌoʊdɑnˈtɑtəkni/","extraExplanation":["词源上可拆为 odonto-（“牙、牙齿”，源自希腊语）+ -techny（“技艺、工艺”）。因此它的字面意思就是“牙齿的技艺/工艺”。","现代英语里更常用的说法是 dental technology（牙科技术/牙科技工）或 prosthodontics（偏“修复学/义齿修复”这一学科方向），所以 odontotechny 多见于旧文献或历史语境。"]}
{"word":"odontotherapia","summary":{"en":"A rare medical term meaning dental therapy (treatment of teeth and gums).","zh":"一个罕见的医学词，指牙科治疗（对牙齿与牙龈的治疗）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(rare, medical) Dental therapy; treatment of diseases and problems of the teeth and gums.","zh":"（罕见·医学）牙科治疗；对牙齿与牙龈疾病或问题的治疗。"},"examples":[{"en":"The text mentions odontotherapia as a broad term for treating tooth pain and gum disease.","zh":"这段文字提到“odontotherapia”是一个涵盖牙痛与牙龈疾病治疗的广义术语。"},{"en":"Modern odontotherapia usually includes cleaning, fillings, and preventive care.","zh":"现代的“odontotherapia”通常包括洁牙、补牙与预防性护理。"}]}],"synonyms":["dental therapy","odontotherapy","dental treatment"],"phonetic":"/oʊˌdɑn.toʊˌθɛr.əˈpi.ə/","extraExplanation":["“odontotherapia”更像是拉丁化/希腊词根拼合的医学用语，在现代英语里很少单独使用；更常见的表达是 **dental therapy**（牙科治疗）或 **odontotherapy**。","词根提示：**odonto-**（牙/牙齿）+ **therapia/therapy**（治疗）。在一些旧医学文献或非英语体系的写法中可能会看到这种拼写。"]}
{"word":"odontotherapy","summary":{"en":"Odontotherapy means dental therapy—the treatment of teeth and mouth problems.","zh":"odontotherapy 指牙科治疗，即对牙齿与口腔问题的治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the treatment of diseases and problems of the teeth and mouth; dental therapy","zh":"牙科治疗；对牙齿及口腔问题的治疗"},"examples":[{"en":"The clinic specializes in odontotherapy for tooth pain and gum infection.","zh":"这家诊所专门提供牙科治疗，处理牙痛和牙龈感染。"},{"en":"After the exam, the dentist suggested a course of odontotherapy.","zh":"检查后，牙医建议进行一系列牙科治疗。"}]}],"synonyms":["dental therapy","dental treatment","dentistry"],"phonetic":"/ˌoʊ.dən.toʊˈθɛr.ə.pi/","extraExplanation":["该词较少用于日常英语，更常见的表达是 dentistry（牙科/牙医学）或 dental treatment（牙科治疗）。","词源：odonto- 来自希腊语 odous/odont-（“牙齿”），-therapy 表示“治疗”。理解词根有助于记忆：odonto- = 牙。"]}
{"word":"odontotomy","summary":{"en":"Odontotomy is a dental surgical cut into a tooth, often done to access or divide it for treatment.","zh":"Odontotomy 指牙科手术中对牙齿进行切开，常用于进入病灶或将牙齿分割以便治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dental surgical procedure that cuts into a tooth (or a tooth-like structure), often to gain access for treatment or removal of part of the tooth.","zh":"（牙科）牙切开术：对牙齿（或类似牙齿的组织）进行外科切开，常用于进入病灶进行治疗或去除部分牙体组织。"},"examples":[{"en":"The oral surgeon performed an odontotomy to access the affected area inside the tooth.","zh":"口腔外科医生进行了牙切开术，以进入牙齿内部的病变区域。"},{"en":"In complex extractions, an odontotomy may be used to divide the tooth into smaller sections.","zh":"在复杂拔牙中，可能会使用牙切开术把牙齿分成更小的部分。"}]}],"synonyms":["tooth sectioning","dental sectioning","tooth splitting (informal)"],"phonetic":"/ˌoʊ.dənˈtɑː.tə.mi/","extraExplanation":["词源提示：odonto- 表示“牙”，-tomy 表示“切开术/切开”。因此 odontotomy 字面意思就是“对牙进行切开”。","该词较偏专业，日常交流中更常听到更泛的说法，如 surgical tooth sectioning（牙齿分割）或在具体情境下直接说 tooth surgery（牙科手术）。"]}
{"word":"odontotormae","summary":{"en":"Odontotormae are tooth-like ridges on an insect’s mandibles used for chewing and grinding food.","zh":"Odontotormae 指昆虫大颚上的齿状脊/突起，用于咀嚼与研磨食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Entomology) Tooth-like ridges or projections on an insect’s mandible (jaw), especially in some chewing insects (e.g., grasshoppers), used in grinding or processing food.","zh":"（昆虫学）昆虫大颚（下颚）上的“齿状”脊或突起，常见于咀嚼式口器昆虫（如蝗虫等），用于研磨或处理食物。"},"examples":[{"en":"Under the microscope, the odontotormae look like tiny teeth along the inner edge of the mandible.","zh":"在显微镜下，odontotormae 看起来像沿着大颚内缘排列的小牙齿。"},{"en":"The shape of the odontotormae can help identify closely related insect species.","zh":"odontotormae 的形状可以帮助鉴别亲缘关系很近的昆虫物种。"}]}],"synonyms":["mandibular ridges","tooth-like mandibular projections"],"phonetic":"/oʊˌdɑn.təˈtɔr.mi/","extraExplanation":["这是一个非常专业的术语，多见于昆虫口器解剖与分类描述（如形态学论文、检索表）。常以复数形式 odontotormae 出现；对应的单数形式是 odontotorma。","词源上可拆为 odonto-（“牙、齿”，源自希腊语）+ 与下颚硬化结构相关的词根，整体含义就是“像牙一样的颚部结构”。"]}
{"word":"odontotripsis","summary":{"en":"A rare medical term meaning the crushing or grinding of a tooth/tooth substance.","zh":"一个罕见的医学/牙科术语，指牙齿或牙质的压碎或磨碎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the crushing or grinding of a tooth (or tooth substance), especially as a dental/medical procedure or as severe wear.","zh":"牙齿（或牙质）的压碎、磨碎；尤指牙科/医学中的处理方式，或严重磨耗造成的粉碎。"},"examples":[{"en":"The old report described odontotripsis as a way to break down diseased tooth material.","zh":"这份旧报告把 odontotripsis 描述为一种将病变牙质磨碎/压碎的方式。"},{"en":"In modern dentistry, the idea is closer to controlled grinding rather than literal odontotripsis.","zh":"在现代牙科里，这个概念更接近“可控的打磨/磨削”，而不是真正意义上的 odontotripsis（牙齿粉碎）。"}]}],"synonyms":["tooth grinding","dental grinding","abrasion","attrition"],"phonetic":"/ˌoʊˌdɑn.təˈtrɪp.sɪs/","extraExplanation":["这个词非常罕见，多见于较旧的医学/牙科文献。词源来自希腊语：odonto-（牙）+ -tripsis（摩擦、磨碎、压碎）。在当代临床语境里，人们更常用更具体的词来描述相关操作，比如 grinding（磨削）、abrasion（磨耗/磨损）、attrition（牙齿磨耗）。"]}
{"word":"odontotrypy","summary":{"en":"Odontotrypy is a rare word meaning dental drilling—boring into a tooth.","zh":"Odontotrypy 是一个罕见词，指牙科钻磨，即在牙齿上钻孔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act or process of drilling or boring into a tooth; dental drilling.","zh":"（罕见）在牙齿上钻孔、钻磨的行为或过程；牙科钻磨。"},"examples":[{"en":"In early dental texts, odontotrypy was sometimes mentioned as a method for treating tooth pain.","zh":"在早期的牙科文献中，odontotrypy 有时被提到作为治疗牙痛的方法。"},{"en":"Modern dentistry uses safer techniques than the crude odontotrypy described centuries ago.","zh":"现代牙科使用的技术比几百年前描述的粗糙 odontotrypy 更安全。"}]}],"synonyms":["dental drilling","tooth drilling","tooth-boring (rare)"],"phonetic":"/oʊˌdɑn.toʊˈtraɪ.pi/","extraExplanation":["这个词非常少见，多见于旧式或学术性很强的资料中。词根上可拆为 odonto-（牙）+ -trypy（源自希腊语，和“钻、穿孔”相关），整体意思就是“对牙进行钻孔/钻磨”。日常英语里通常直接说 dental drilling（牙科钻磨）或 drill a tooth（给牙钻孔）。"]}
{"word":"odoom","summary":{"en":"“Odoom” is usually a surname, not a common English vocabulary word.","zh":"“Odoom”通常是姓氏，而不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), found in some English-speaking contexts (often of Ghanaian origin).","zh":"一个姓氏，在英语语境中可见（常见于加纳等地区的姓名中）。"},"examples":[{"en":"Ms. Odoom will lead the meeting today.","zh":"Odoom 女士今天将主持会议。"},{"en":"I met someone named Odoom at the conference.","zh":"我在会议上遇到一位姓 Odoom 的人。"}]}],"phonetic":"/oʊˈduːm/","extraExplanation":["“Odoom”在英语词典里通常不作为普通词条出现，更常见于人名（姓氏）。如果你其实想查的是“doom”（厄运、毁灭），请告诉我，我可以按“doom”给你完整释义与例句。","人名的读音在不同家庭/地区可能略有差异；这里给的是较常见的英语读法，实际以本人/当地习惯为准。"]}
{"word":"odophone","summary":{"en":"An uncommon term for an instrument or system used to measure or classify odors, sometimes by mapping scents to a scale like musical notes.","zh":"一个较少见的词，指用来测量或分类气味的装置或系统；有时会把气味对应到类似音阶的刻度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or system for measuring, identifying, or classifying smells (odors), sometimes by matching scents to a scale (for example, a musical scale).","zh":"一种用来测量、识别或分类气味（臭味/香味）的装置或系统；有时会把气味对应到某种刻度（例如音乐音阶）。"},"examples":[{"en":"The researcher built a simple odophone to compare how strong different perfumes smelled.","zh":"研究人员做了一个简易的 odophone，用来比较不同香水闻起来的浓度。"},{"en":"In that old text, the author describes an odophone that links each scent to a musical note.","zh":"在那本旧书里，作者描述了一种把每种气味对应到某个音符的 odophone。"}]}],"synonyms":["olfactometer","odor meter","smell meter"],"phonetic":"/ˈoʊdəˌfoʊn/","extraExplanation":["这个词比较少见，常出现在早期香水学/嗅觉研究的语境中。19世纪有人提出“odophone（气味音阶/气味对应音符）”的概念，试图像用音阶描述声音那样，用一套固定的对应关系来描述气味。现代更常见的相关词是 olfactometer（嗅觉计/气味测量仪）。"]}
{"word":"odor","summary":{"en":"Odor means a smell, often an unpleasant or strong one, and it can also mean a recognizable scent used to identify something.","zh":"Odor 指“气味”，常带有“难闻或强烈”的语感，也可指可用于辨识某人/某物的特征气味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a smell, especially one that is unpleasant or strong","zh":"气味；（尤指）难闻的气味、强烈的气味"},"examples":[{"en":"There was a strong odor in the kitchen after the fish was cooked.","zh":"鱼煮完后，厨房里有一股很重的气味。"},{"en":"The trash can started to give off a bad odor in the summer heat.","zh":"夏天热的时候，垃圾桶开始散发出难闻的味道。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular scent that can identify a person, animal, or substance","zh":"（可用于辨识的）气味、体味、味道特征"},"examples":[{"en":"Dogs can follow a person’s odor for a long distance.","zh":"狗可以循着人的气味追踪很远。"},{"en":"The odor of gasoline is easy to recognize.","zh":"汽油的气味很容易辨认。"}]}],"synonyms":["smell","scent","stink","stench","aroma"],"phonetic":"/ˈoʊdɚ/","extraExplanation":["“odor”在美式英语中更常见；英式英语更常用拼写“odour”。日常口语里，如果强调“好闻”，更常用“smell”或“scent”（如 a pleasant scent）。","常见搭配：a strong/foul odor（强烈/恶臭）、body odor（体味）、odorless（无味的）、deodorant（除臭剂）、to give off an odor（散发气味）。"]}
{"word":"odorable","summary":{"en":"“Adorable” means very cute and lovable.","zh":"“adorable”表示“非常可爱、讨人喜欢的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very cute and lovable; making people feel affection.","zh":"非常可爱、讨人喜欢的；让人产生喜爱之情的。"},"examples":[{"en":"That puppy is so adorable.","zh":"那只小狗太可爱了。"},{"en":"She gave her little brother an adorable smile.","zh":"她对弟弟露出了一个很讨喜的笑容。"},{"en":"The café has an adorable, cozy style.","zh":"这家咖啡馆的风格很可爱、很温馨。"}]}],"synonyms":["cute","lovely","sweet","charming"],"phonetic":"/əˈdɔrəbəl/","extraExplanation":["“odorable”通常不是标准英文拼写；你很可能想写的是“adorable（可爱的）”。","容易混淆的原因是英文里有“odor（气味）”。但“adorable”来自“adore（崇爱、很喜欢）”，和“odor”没有关系。"]}
{"word":"odorant","summary":{"en":"An odorant is a substance that produces a smell, often used to add scent or in smell testing.","zh":"Odorant 指能产生气味的物质，常用于增香或嗅觉测试等场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that gives off a smell, especially one used to add scent (often in products) or to test the sense of smell","zh":"散发气味的物质；（尤指）用于添加香味的香料/香精，或用于嗅觉测试的气味剂"},"examples":[{"en":"Natural odorants like lavender oil are used in soaps and candles.","zh":"像薰衣草精油这样的天然气味剂常用于香皂和蜡烛中。"},{"en":"In the lab, the odorant helped researchers study how people recognize smells.","zh":"在实验室里，这种气味剂帮助研究人员了解人们如何辨别气味。"}]}],"synonyms":["scent","fragrance","odor","aroma"],"phonetic":"/ˈoʊdər(ə)nt/","extraExplanation":["“odorant”常见于科学或较正式的语境（如化学、食品风味、嗅觉研究）。日常生活里，人们更常说“a scent / a fragrance / a smell”。","不要和“deodorant（除臭剂）”混淆：deodorant是用来减少体味或掩盖异味的产品；odorant只是“气味物质”本身，不一定是除臭用。"]}
{"word":"odorants","summary":{"en":"Odorants are substances that create or add smell, often used in perfumes, products, or safety (like natural gas).","zh":"Odorants 指能产生或添加气味的物质，常用于香水、日用品或安全用途（如天然气加味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (chemicals or natural materials) that produce a smell; they are added or used to create, strengthen, or identify an odor (often in perfumes, cleaning products, or safety uses like natural gas).","zh":"产生气味的物质（化学品或天然材料）；常被添加或使用来制造、增强或辨识气味（常见于香水、清洁用品，或像天然气加味剂这类安全用途）。"},"examples":[{"en":"Perfumes are made from a mix of odorants dissolved in alcohol.","zh":"香水通常由多种香料气味物质（odorants）溶解在酒精中调配而成。"},{"en":"For safety, gas companies add odorants so leaks are easier to detect.","zh":"为了安全，燃气公司会加入气味剂（odorants），让泄漏更容易被发现。"},{"en":"Some people are sensitive to odorants in air fresheners.","zh":"有些人对空气清新剂里的气味成分（odorants）比较敏感。"}]}],"synonyms":["fragrances","scenting agents","aroma chemicals","perfume ingredients","odoriferous substances"],"phonetic":"/ˈoʊdərənts/","extraExplanation":["“odorants”是“odorant”的复数形式。单数更常用于技术或说明书语境（如化工、香精香料、产品成分表）。","在日常英语里，人们更常说“fragrances（香味/香精）”“scents（气味）”“perfume ingredients（香水成分）”，而“odorant”更偏正式、偏专业。","相关对比：deodorant（n. 止汗/除臭产品）是用于减少体味的产品，不等同于odorant（产生或提供气味的物质）。"]}
{"word":"odorate","summary":{"en":"Odorate means “having an odor,” but it’s rare in modern English.","zh":"odorate表示“有气味的”，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having an odor; smelling (often used in older or technical writing).","zh":"（罕见）有气味的；有嗅觉气味的（常见于较旧或技术性文本）。"},"examples":[{"en":"The odorate oils were stored in dark bottles to protect their scent.","zh":"这些有气味的精油被装在深色瓶中以保护香味。"},{"en":"Some plants release odorate compounds that attract insects.","zh":"有些植物会释放有气味的化合物来吸引昆虫。"}]}],"synonyms":["odorous","aromatic","fragrant","scented"],"phonetic":"/ˈoʊdəˌreɪt/","extraExplanation":["“odorate”在现代英语里很少见，更常用的是“odorous”（有气味的）或“aromatic/fragrant”（芬芳的）。","词根与“odor”（气味）相关；在化学或旧式描写中偶尔用来指“带气味的物质/成分”。"]}
{"word":"odorator","summary":{"en":"An odorator is usually a device that adds odor—especially to gas for safety; rarely, it can mean a person who adds fragrance.","zh":"Odorator 通常指“加臭器”（尤指给燃气加臭以保障安全）；较少见时也可指“加香的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or machine that adds a smell (an odorant) to something, especially to fuel gas so it can be detected if it leaks","zh":"加臭器；加味装置（把气味剂加入某物中，尤指给燃气加臭以便泄漏时能被闻到）"},"examples":[{"en":"The gas company installed an odorator to help people notice leaks quickly.","zh":"燃气公司安装了加臭器，帮助人们更快发现泄漏。"},{"en":"If the odorator fails, gas may be harder to detect by smell.","zh":"如果加臭器故障，燃气可能更难通过气味被发现。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who adds fragrance or scent; someone who perfumes something (rare)","zh":"（罕见）加香的人；调香/增香者"},"examples":[{"en":"In older writings, an odorator might be the person who scented a room for a ceremony.","zh":"在较早的文字里，odorator 可能指为仪式给房间加香的人。"}]}],"synonyms":["odorizer","odourizer","odorizing unit","scenting device"],"phonetic":"/ˈoʊdɚˌreɪtɚ/","extraExplanation":["“Odorator”在现代英语里多见于技术/工业语境，尤其与天然气“加臭”有关：天然气本身可能几乎无味，因此会加入带气味的化学物质（常见如含硫的气味剂），让泄漏更容易被人闻到。","日常英语中更常用的是“odorizer”（加臭装置/加臭剂投加设备）或“odorization”（加臭处理）；“odorator”相对少见，常被视为行业用词或变体。"]}
{"word":"odored","summary":{"en":"“Odored” usually means “having a smell,” often in compounds like “sweet-odored.”","zh":"“odored”通常表示“有气味的”，常见于如“sweet-odored（芬芳的）”这类复合词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having a smell (often used in compounds like “sweet-odored”); sometimes implying a noticeable or distinctive odor","zh":"有气味的；带有（常用于复合词，如“sweet-odored”）；有时暗示气味明显或特别"},"examples":[{"en":"The sweet-odored flowers filled the room.","zh":"香气馥郁的花朵让房间里满是花香。"},{"en":"An oddly odored mist drifted through the alley.","zh":"一股气味怪异的薄雾飘过小巷。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “odor” (a rare verb meaning “to give off an odor”)","zh":"“odor”的过去式/过去分词（很少把 odor 当动词用，意为“散发气味”）"},"examples":[{"en":"The room was so still that even the candles seemed to have odored the air.","zh":"房间静得出奇，连蜡烛仿佛都把气味留在空气里。（较少见用法）"}]}],"synonyms":["scented","fragrant","smelly","malodorous","aromatic"],"phonetic":"/ˈoʊdərd/","extraExplanation":["“odored”更常见作形容词，尤其出现在较正式或文学性的表达中（如“sweet-odored / foul-odored”）。日常英语里更自然的说法通常是“smelling … / with a … smell / giving off an odor”。","英式拼写里常见“odour / odoured”，美式拼写是“odor / odored”。"]}
{"word":"odorful","summary":{"en":"Odorful means “having a noticeable smell,” often implying an unpleasant odor.","zh":"odorful 意为“有明显气味的”，常暗示气味不好闻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a noticeable smell; often used to suggest an unpleasant smell.","zh":"有明显气味的；常带有“不好闻”的含义。"},"examples":[{"en":"After the rain, the trash cans behind the restaurant became odorful.","zh":"下雨后，餐馆后面的垃圾桶变得气味很重。"},{"en":"The odorful smoke filled the hallway, so we opened the windows.","zh":"有异味的烟雾充满了走廊，所以我们打开了窗户。"},{"en":"Some chemicals are odorful even in small amounts.","zh":"有些化学品即使量很少也会有明显气味。"}]}],"synonyms":["smelly","odorous","odoriferous","stinky"],"phonetic":"/ˈoʊdərfəl/","extraExplanation":["“odorful”在现代英语里比较少见，日常表达更常用“smelly”（口语、偏负面）、“odorous”（较正式、中性到偏负面）或“fragrant”（好闻的）。","词尾“-ful”表示“充满……的/有……的”，因此“odor + -ful”字面意思是“有气味的”。但因为“odor”在美式英语里常与异味相关，所以“odorful”也常被理解为“有臭味/有异味”。"]}
{"word":"odoriferant","summary":{"en":"“Odoriferant” means emitting or producing a smell, often in scientific writing.","zh":"“odoriferant”指“散发/产生气味的”，多见于科学或技术性表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"giving off a smell; odor-producing (often used in a technical or scientific context).","zh":"散发气味的；产生气味的（常用于技术或科学语境）。"},"examples":[{"en":"Certain flowers are strongly odoriferant at night to attract moths.","zh":"有些花在夜间会强烈散发气味，以吸引飞蛾。"},{"en":"The lab removed odoriferant compounds from the water sample.","zh":"实验室从水样中去除了产生气味的化合物。"}]}],"synonyms":["odoriferous","odorous","smelly","fragrant","aromatic"],"phonetic":"/ˌoʊdəˈrɪfərənt/","extraExplanation":["“odoriferant”较少见，更多时候人们用更常见的“odoriferous”（有气味的、芬芳的/臭的，取决于语境）或“odorous”（有气味的）。","词根提示：来自拉丁语 odor（气味）+ ferre（携带、带来），整体意思就是“带来气味的/产生气味的”。"]}
{"word":"odoriferosity","summary":{"en":"Odoriferosity means “smelliness,” often implying a strong or unpleasant odor.","zh":"odoriferosity 指“气味很重/臭味”，常带有强烈或难闻的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of having a noticeable smell, especially a strong or unpleasant one; smelliness","zh":"有明显气味的性质（尤指强烈或难闻的气味）；臭味；气味浓烈"},"examples":[{"en":"The odoriferosity of the trash can got worse in the summer heat.","zh":"夏天的高温让垃圾桶的臭味更严重了。"},{"en":"They cleaned the refrigerator to reduce its odoriferosity.","zh":"他们清理了冰箱，以减少异味。"},{"en":"The lab note mentioned the sample’s high odoriferosity, so we opened a window.","zh":"实验记录提到样品气味很重，所以我们开了窗。"}]}],"synonyms":["odoriness","smelliness","stench","rankness"],"phonetic":"/ˌoʊdərˌɪfəˈrɑsəti/","extraExplanation":["这是一个非常少见、偏“书面/幽默”的词，日常英语里更常用的是“odor/odoriness/smelliness”。","构词上可拆为 odor（气味）+ -iferous（“带有……的/产生……的”，如 odoriferous=有气味的）+ -ity（名词后缀，表示“性质”）。因此 odoriferosity 大致等于 “odoriferous + -ity”。"]}
{"word":"odoriferous","summary":{"en":"Odoriferous means “having a noticeable smell,” often strong and sometimes unpleasant, though it can also mean pleasantly fragrant in context.","zh":"Odoriferous 指“有明显气味的”，常表示气味很强、甚至偏难闻；在特定语境下也可表示“芬芳的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a noticeable smell, especially a strong or unpleasant one.","zh":"有明显气味的（尤指气味很强或难闻的）。"},"examples":[{"en":"The odoriferous trash needed to be taken out immediately.","zh":"那袋臭烘烘的垃圾得立刻拿出去。"},{"en":"After the storm, the basement became odoriferous and damp.","zh":"暴风雨过后，地下室又潮又有股难闻的味道。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a pleasant fragrance; fragrant.","zh":"有香味的；芬芳的。"},"examples":[{"en":"She lit odoriferous incense to make the room feel calm.","zh":"她点了有香味的熏香，让房间更安宁。"},{"en":"The garden was full of odoriferous flowers in spring.","zh":"春天时花园里开满了芬芳的花。"}]}],"synonyms":["smelly","stinky","malodorous","fragrant","aromatic","sweet-smelling"],"phonetic":"/ˌoʊdɚˈɪfɚəs/","extraExplanation":["“odoriferous”较偏正式/书面语，日常更常用的是“smelly”（多指臭）或“fragrant / sweet-smelling / aromatic”（多指香）。它既可中性表示“有气味”，但语境里常带一点“味道很冲”的感觉，可能是好闻也可能是难闻。","词源可拆成：odor（气味）+ -iferous（“带来/产生……的”，常见于形容词）。所以字面意思就是“带来气味的/有气味的”。"]}
{"word":"odoriferously","summary":{"en":"“Odoriferously” means “in a strongly smelly way.”","zh":"“odoriferously”表示“带着强烈气味地/臭烘烘地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has a strong, noticeable smell (often used humorously or negatively).","zh":"以有强烈、明显气味的方式（常带幽默或略贬义）。"},"examples":[{"en":"The alley was odoriferously filled with garbage after the hot weekend.","zh":"炎热的周末过后，小巷里垃圾的气味浓得令人难受。"},{"en":"The cheese aged in the fridge, becoming odoriferously powerful.","zh":"奶酪在冰箱里放久了，味道变得异常浓烈。"}]}],"synonyms":["smellily","pungently","stinkily","strongly scented"],"phonetic":"/ˌoʊdərˈɪfərəsli/","extraExplanation":["“odoriferous”由 odor（气味）+ -ferous（“带来/产生……的”，来自拉丁语 ferre “携带”）构成；“odoriferously”是其副词形式，常见于较正式或带夸张效果的表达。","语气提示：英语里更日常的说法通常是 “smelly / strongly scented / very stinky”。“odoriferously”听起来更书面、也更有“故意用词讲究”的幽默感。"]}
{"word":"odoriferousness","summary":{"en":"Odoriferousness means the state or quality of having a noticeable (often strong) smell.","zh":"Odoriferousness 指“有明显（常常很强烈）气味的状态/特质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of having a strong or noticeable smell; smelliness (often used humorously or in formal writing)","zh":"有强烈或明显气味的特质；气味很重（常带幽默感或较正式的书面语气）"},"examples":[{"en":"The odoriferousness of the cheese filled the entire kitchen.","zh":"那块奶酪的浓烈气味弥漫了整个厨房。"},{"en":"People complained about the odoriferousness coming from the trash cans in summer.","zh":"人们抱怨夏天垃圾桶散发出的难闻气味。"},{"en":"He mentioned the odoriferousness of the fish market with a laugh.","zh":"他笑着提到鱼市场那股浓重的味道。"}]}],"synonyms":["smelliness","odor","strong smell","pungency"],"phonetic":"/ˌoʊdərˈɪfərəsnəs/","extraExplanation":["“odoriferousness”由形容词“odoriferous（有气味的/散发气味的）”加名词后缀“-ness”构成，表示“……的性质/状态”。在日常口语中更常说“smelliness”或直接说“strong smell/odor”。","该词常见于较正式、描写性写作，或用来带点夸张的幽默效果。"]}
{"word":"odorific","summary":{"en":"Odorific means “having or giving off a noticeable smell,” often in a strong or distinctive way.","zh":"Odorific 意为“有明显气味/会散发气味的”，常指气味浓或很有特点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or producing a noticeable smell (often a strong or distinctive one).","zh":"有气味的；会散发明显气味的（常指气味较强或较特别）。"},"examples":[{"en":"The odorific cheese filled the whole kitchen within minutes.","zh":"这种气味很浓的奶酪几分钟就让整个厨房都充满了味道。"},{"en":"Some flowers are more odorific at night to attract insects.","zh":"有些花在夜里气味更浓，以吸引昆虫。"},{"en":"The cleaner is effective but a bit odorific, so open a window.","zh":"这个清洁剂很有效，但味道有点重，所以把窗户打开。"}]}],"synonyms":["smelly","strong-smelling","scented","fragrant","aromatic","odoriferous"],"phonetic":"/ˌoʊdəˈrɪfɪk/","extraExplanation":["“odorific”由“odor（气味）+ -ific（使……的/产生……的）”构成，语气偏书面、偏少见。日常更常用的说法是“smelly（难闻的）”“fragrant（芳香的）”“strong-smelling（气味浓的）”。","使用时通常不直接表达“好闻/难闻”的判断，只强调“气味明显”；如果要表达态度，可搭配如“pleasantly odorific（香气明显）”或“unpleasantly odorific（刺鼻）”。"]}
{"word":"odorimeter","summary":{"en":"An odorimeter is a device for measuring or estimating odor strength or concentration.","zh":"Odorimeter 指用于测量或估算气味强度或浓度的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to measure or estimate the strength (intensity) or concentration of an odor (smell), often for air-quality testing or industrial monitoring","zh":"测臭仪；臭气计（一种用来测量或估算气味强度或浓度的仪器，常用于空气质量检测或工业监测）"},"examples":[{"en":"The lab used an odorimeter to compare how strong each chemical sample smelled.","zh":"实验室用测臭仪来比较每个化学样品的气味强度。"},{"en":"Residents asked the city to install an odorimeter near the landfill to track odors over time.","zh":"居民要求市政府在垃圾填埋场附近安装测臭仪，以长期追踪异味情况。"}]}],"synonyms":["olfactometer","odor meter","smell meter"],"phonetic":"/ˌoʊdɚˈmɪtɚ/","extraExplanation":["“odorimeter”由 odor（气味）+ -meter（测量仪）组成，属于较专业的词，常见于环境工程、废水处理、垃圾处理等领域。","在实际工作中，气味的测量常与“olfactometry（嗅觉测定法）”相关：既可能用仪器辅助，也可能结合受过训练的嗅辨小组来评估气味强度或阈值。"]}
{"word":"odorimetry","summary":{"en":"Odorimetry means scientifically measuring and evaluating odors (smells).","zh":"Odorimetry 指用科学方法测量并评估气味（嗅觉测定）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement and evaluation of odors (smells), especially by scientific testing to determine odor strength or concentration","zh":"嗅觉测定；气味测量（用科学方法评估气味强度或浓度）"},"examples":[{"en":"The lab uses odorimetry to measure how strong the smell is near the wastewater plant.","zh":"实验室用嗅觉测定来评估污水处理厂附近气味有多强。"},{"en":"Odorimetry data helped the city respond to residents’ complaints about bad smells.","zh":"嗅觉测定的数据帮助城市回应居民对异味的投诉。"},{"en":"Researchers compared two filters using odorimetry to see which reduced odor more effectively.","zh":"研究人员用嗅觉测定比较两种过滤器，看哪一种除味更有效。"}]}],"synonyms":["olfactometry","odor measurement","smell measurement"],"phonetic":"/ˌoʊdəˈrɪmətri/","extraExplanation":["“odorimetry”常见于环境工程、空气质量与工业卫生等领域，常与“olfactometry（嗅量测定）”相关或互换使用。实际测试可能包括让受训嗅辨员评估气味强度，或用仪器分析与气味相关的化学物质。","英式拼写有时写作“odourimetry”（odour=英式“odor”）。"]}
{"word":"odoriphor","summary":{"en":"A rare scientific term meaning a scent-producing organ (often in insects).","zh":"一个较罕见的科学词，指产生/释放气味的器官（常见于昆虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A scent-producing organ or gland, especially in insects.","zh":"（罕见）散发气味的器官或腺体，尤指昆虫的“分泌气味器官”。"},"examples":[{"en":"Some butterflies use an odoriphore to release pheromones during courtship.","zh":"一些蝴蝶会用散发气味的器官在求偶时释放信息素。"},{"en":"The researcher examined the insect’s odoriphore under a microscope.","zh":"研究人员在显微镜下观察了这种昆虫的分泌气味器官。"}]}],"synonyms":["scent gland","pheromone gland"],"phonetic":"/oʊˈdɔrɪˌfɔr/","extraExplanation":["你输入的 **odoriphor** 在现代英语里很少见，更常见的拼写是 **odoriphore**（名词，指产生气味/信息素的器官）。如果你想表达“有气味的/散发气味的”，更常用的词是 **odoriferous**（形容词）。","词源上可拆成：**odor-**（气味）+ **-phore**（携带/承载，常见于 scientific terms，如 *semaphore* 等），整体意思接近“携带/产生气味的结构”。"]}
{"word":"odoriphore","summary":{"en":"An odoriphore is a biological structure that produces and releases a smell (often for communication or pollination).","zh":"odoriphore 指生物体中产生并释放气味的结构，常用于交流（如信息素）或吸引传粉者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) An odor‑bearing organ or structure that produces and releases a smell, especially in insects or flowers.","zh":"（生物）产生并释放气味的器官或结构，尤指昆虫或花朵中的“气味散发器/散香结构”。"},"examples":[{"en":"Some moths have an odoriphore that releases pheromones to attract a mate.","zh":"一些飞蛾有气味散发器，会释放信息素来吸引配偶。"},{"en":"In certain flowers, the odoriphore helps spread scent to guide pollinators.","zh":"在某些花中，散香结构帮助扩散香味来引导传粉者。"}]}],"synonyms":["scent gland","odor gland","osmophore"],"phonetic":"/oʊˈdɔrɪˌfɔr/","extraExplanation":["这个词很少见，常见于专业的昆虫学/植物学语境。构词上由 odor（气味）+ -phore（“携带/承载”的词缀，源自希腊语）组成，字面意思就是“携带气味的东西”。","植物学里更常见的近义术语是 osmophore（散香体/散香组织），而昆虫学语境下也可能用 scent gland（臭腺/香腺）来表达相近概念。"]}
{"word":"odorivector","summary":{"en":"An odor vector is a numeric representation of a smell used for comparing or classifying odors, especially in ML or sensor research.","zh":"Odor vector 指用数字向量表示气味特征，用于比较或分类气味，常见于机器学习或传感器研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vector (a list of numbers) that represents the features of an odor/smell, often used in machine learning or electronic-nose (sensor) research to compare, classify, or recognize smells","zh":"（气味）特征向量：用一组数字表示某种气味/嗅觉特征，常用于机器学习或电子鼻（传感器）研究中，用来比较、分类或识别气味"},"examples":[{"en":"The model converts each sample into an odor vector before classification.","zh":"模型会先把每个样本转换成气味特征向量，再进行分类。"},{"en":"Two perfumes may smell similar if their odor vectors are close in the feature space.","zh":"如果两款香水在特征空间中的气味向量很接近，它们闻起来可能相似。"}]}],"synonyms":["scent profile","smell vector","feature vector (for odor)"],"phonetic":"/ˈoʊdər ˈvɛktər/","extraExplanation":["“odorivector”不是常见的标准英语拼写；更常见的写法是分开的 **odor vector**，或在技术文献里写作 **odor-vector**。","该词多出现在数据科学/化学计量学/电子鼻领域：把传感器读数、化学成分比例或人类评价量表编码成“向量”，便于用距离、聚类、分类器等方法处理。"]}
{"word":"odorization","summary":{"en":"Odorization means adding a detectable smell (often for safety), or the process of causing something to smell.","zh":"Odorization 指为（常为安全目的）加入可察觉的气味，或使某物产生/带有明显气味的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding a smell (especially a strong, noticeable one) to something so it can be detected","zh":"给某物“加味道/加臭味”的过程（尤其是为了让人能闻到、便于发现）"},"examples":[{"en":"Natural gas is odorized so leaks can be detected quickly.","zh":"天然气会被加臭，以便能快速发现泄漏。"},{"en":"The odorization of propane improves safety in homes and workplaces.","zh":"给丙烷加臭能提高家庭和工作场所的安全性。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of producing or giving off an odor; making something smell in a noticeable way","zh":"产生或散发气味；让某物带有明显气味的行为"},"examples":[{"en":"Some chemicals cause odorization in enclosed spaces.","zh":"有些化学物质会在密闭空间里产生明显气味。"}]}],"synonyms":["scenting","odor addition","perfuming (sometimes)"],"phonetic":"/ˌoʊdərɪˈzeɪʃən/","extraExplanation":["“odorization”常见于安全与工业语境，尤其是燃气行业：天然气本身几乎无味，为了安全会加入带强烈气味的物质（如含硫化合物），帮助人们通过气味发现泄漏。","拼写上，英式英语常写作“odorisation”（-ise/-isation），美式英语常写作“odorization”（-ize/-ization）。"]}
{"word":"odorize","summary":{"en":"Odorize means to add a noticeable smell to something, often for safety or identification.","zh":"Odorize 指给某物添加明显气味，常用于安全或识别目的。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add a smell (often a strong, noticeable one) to something, especially to make it easier to detect","zh":"给某物添加气味（通常较明显或刺鼻），尤指为了更容易被察觉"},"examples":[{"en":"Gas companies odorize natural gas so leaks can be noticed quickly.","zh":"燃气公司会给天然气加臭（添加气味），这样泄漏时能更快被发现。"},{"en":"The lab odorized the sample to help workers identify it safely.","zh":"实验室给样本加了气味，帮助工作人员更安全地识别。"}]}],"synonyms":["scent","perfume","add an odor to","deodorize (opposite meaning)"],"phonetic":"/ˈoʊdəˌraɪz/","extraExplanation":["“odorize”在安全领域很常见，尤其用于天然气：天然气本身几乎无味，通常会加入带强烈气味的含硫化合物（如类似“臭鸡蛋味”的气味剂），让人更容易闻到泄漏。","拼写提示：美式英语更常用“odor”（英式多写作“odour”）；因此“odorize”对应的英式拼写常见为“odourise”。"]}
{"word":"odorized","summary":{"en":"“Odorized” means a smell has been intentionally added, especially to gas for safety; it’s also the past form of “odorize.”","zh":"“odorized”表示被刻意加上气味（多用于天然气等以便安全识别）；也可作“odorize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something originally without much smell) having a smell added on purpose, often for safety or identification.","zh":"（原本气味不明显的东西）被人为加上气味的，常用于安全或辨识。"},"examples":[{"en":"Natural gas is odorized so leaks are easier to notice.","zh":"天然气会被加臭，这样更容易发现泄漏。"},{"en":"The fuel was odorized to help workers detect spills quickly.","zh":"燃料被加了气味，方便工人迅速发现泄漏。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “odorize”: to add a smell to something on purpose.","zh":"“odorize”的过去式/过去分词：给某物刻意加上气味（加臭）。"},"examples":[{"en":"The company odorized the gas before sending it through the pipeline.","zh":"公司在把天然气送入管道前先给它加了臭味。"},{"en":"Many household gases are odorized for public safety.","zh":"许多家用气体都会加臭以保障公众安全。"}]}],"synonyms":["scented","perfumed","deodorized (opposite meaning in some contexts)","odor-added"],"phonetic":"/ˈoʊdərˌaɪzd/","extraExplanation":["在英语语境里，odorized 最常见的场景是“天然气加臭”（gas odorization）。因为天然气本身几乎无味，加入少量带强烈气味的化学物质（例如类似硫味的气味）能帮助人们更快察觉泄漏。","拼写差异：美式常见 odorize / odorized；英式常见 odourise / odourised。"]}
{"word":"odorizer","summary":{"en":"An odorizer is something added to give a noticeable smell, often for safety (e.g., in natural gas).","zh":"odorizer指用来添加明显气味的物质或装置，常用于安全目的（如给天然气加臭）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or substance that adds a smell to something (often to make it easier to notice or identify)","zh":"加味剂；增味器；加臭装置（给某物添加气味，常用于让人更容易察觉或辨认）"},"examples":[{"en":"Natural gas is treated with an odorizer so leaks can be detected quickly.","zh":"天然气会加入加臭剂，这样泄漏就能更快被发现。"},{"en":"The technician checked the odorizer in the gas line during maintenance.","zh":"维护时，技术员检查了管道里的加臭装置。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person or thing that makes something smell a certain way","zh":"（较少见）使某物带有某种气味的人或物"},"examples":[{"en":"In the lab, the odorizer was added in tiny amounts to test the product’s scent.","zh":"在实验室里，会以极小剂量加入增味剂来测试产品的气味。"}]}],"synonyms":["odorant","scent additive","fragrance additive","odorizing agent"],"phonetic":"/ˈoʊdərˌaɪzər/","extraExplanation":["“odorizer”常见于工业与安全语境，尤其是天然气：天然气本身通常几乎无味，因此会加入有强烈气味的化学物质（如含硫的mercaptans），帮助人们通过“闻到味道”来发现泄漏。日常英语里也常用“odorant”（加臭剂）来表达类似意思。"]}
{"word":"odorizes","summary":{"en":"“Odorizes” means “adds a smell” (most common) or, less commonly, “gives off a smell.”","zh":"“odorizes”主要表示“给……添加气味（加味/加臭）”，较少见可指“散发气味”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of odorize) To add a smell to something, usually on purpose (often to make it easier to notice).","zh":"（odorize 的第三人称单数）给某物添加气味，通常是有意为之（常用于便于察觉）。"},"examples":[{"en":"For safety, the company odorizes natural gas so leaks are easier to detect.","zh":"为了安全，公司会给天然气加味道，这样更容易发现泄漏。"},{"en":"Some manufacturers odorizes the product to create a “fresh” feeling.","zh":"一些厂家会给产品加香味，营造“清新”的感觉。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) To give off a smell; to make an area smell a certain way.","zh":"（较少见）散发气味；使某个地方带有某种味道。"},"examples":[{"en":"Certain flowers odorizes the room at night.","zh":"某些花会在夜里让房间充满香味。"}]}],"synonyms":["scent","perfume","add fragrance to","add odor to","odorize (base form)"],"phonetic":"/ˈoʊdəˌraɪz/","extraExplanation":["在英式英语中常拼作 odourise（多了一个 u）。","最常见的真实语境是公共安全：天然气本身几乎无味，所以会被“odorize（加臭剂）”，帮助人们闻到泄漏。","别和 deodorize（除臭）混淆：odorize 是“加味/加臭”，deodorize 是“去味/除臭”。"]}
{"word":"odorizing","summary":{"en":"“Odorizing” means intentionally adding a smell (often for safety), or describing something that adds an odor.","zh":"“odorizing”指有意给某物加上气味（常用于安全目的），也可作形容词表示“加味/加臭的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"adding a smell to something; making something give off a noticeable odor (often done intentionally).","zh":"给某物加上气味；让某物散发出明显的气味（常为有意为之）。"},"examples":[{"en":"The company is odorizing the natural gas to make leaks easier to detect.","zh":"公司正在给天然气加臭，以便更容易发现泄漏。"},{"en":"They are odorizing the room with lavender oil.","zh":"他们用薰衣草精油给房间增香。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that adds a smell or causes an odor.","zh":"（作定语）指“增香的 / 加臭的；引起气味的”。"},"examples":[{"en":"An odorizing agent is mixed into the gas.","zh":"一种加臭剂被混入气体中。"},{"en":"We use odorizing chemicals in very small amounts.","zh":"我们只使用极少量的加臭化学品。"}]}],"synonyms":["scenting","perfuming","adding an odor","odorization"],"phonetic":"/ˈoʊdəraɪzɪŋ/","extraExplanation":["“odorize”在公共安全语境中很常见：天然气本身常被认为几乎无味，因此会人为加入强烈气味（如含硫化合物），帮助人们及时察觉泄漏。","注意区分：odorizing（加味/加臭）与 deodorizing（除臭）意思相反。"]}
{"word":"odorless","summary":{"en":"Odorless means having no smell.","zh":"odorless 意为“无气味的；没有明显气味的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no smell; without any noticeable odor.","zh":"无气味的；没有任何明显气味的。"},"examples":[{"en":"This cleaner is odorless, so it won’t leave a strong smell in the room.","zh":"这种清洁剂是无气味的，所以不会在房间里留下强烈的味道。"},{"en":"Carbon monoxide is odorless, which makes it especially dangerous.","zh":"一氧化碳是无气味的，这使它尤其危险。"},{"en":"She prefers odorless skincare products because she is sensitive to fragrances.","zh":"她更喜欢无气味的护肤品，因为她对香精比较敏感。"}]}],"synonyms":["unscented","scentless","inodorous"],"phonetic":"/ˈoʊdər.ləs/","extraExplanation":["在日常生活中，odorless 常用于安全与健康场景（如“无气味但有毒/可燃的气体”），也常见于产品描述（如清洁剂、洗衣液、护肤品）表示“不添加香味”或“没有残留气味”。","相关近义表达：unscented（通常指“未添加香料/无香型”，强调产品配方）；odorless（强调“闻起来没有气味”，结果导向）。在购买日用品时两者常接近，但语气重点不同。"]}
{"word":"odorlessly","summary":{"en":"“Odorlessly” means “without any smell.”","zh":"“odorlessly”表示“无气味地、没有味道地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no smell; without producing an odor.","zh":"无气味地；没有味道地。"},"examples":[{"en":"The gas is dangerous because it can spread odorlessly.","zh":"这种气体很危险，因为它可能在无气味的情况下扩散。"},{"en":"Some cleaning products claim to remove stains odorlessly.","zh":"有些清洁产品声称可以在无气味的情况下去除污渍。"}]}],"synonyms":["without a smell","with no odor","odor-free","unscented"],"phonetic":"/ˈoʊdɚləsli/","extraExplanation":["“odorlessly”= odorless（无气味的）+ -ly（副词后缀），表示“以……的方式”。在日常表达中更常见的是用短语 “without any smell / with no odor”。另外，美式常拼作 odor，英式常拼作 odour。"]}
{"word":"odorlessness","summary":{"en":"Odorlessness means having no smell (the state of being odor-free).","zh":"Odorlessness 指“无气味、无异味”的状态（即 odor-free）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of having no smell; the absence of any noticeable odor.","zh":"无气味；没有任何可察觉气味的状态。"},"examples":[{"en":"The lab required odorlessness in the final product so it wouldn’t affect the test results.","zh":"实验室要求最终产品必须无气味，以免影响测试结果。"},{"en":"Odorlessness is often valued in cleaning products used in hospitals.","zh":"在医院使用的清洁产品中，无气味常常很受重视。"}]}],"synonyms":["odor-free","scent-free","no smell","smell-free"],"phonetic":"/ˈoʊdərˌlɛsnəs/","extraExplanation":["“odorlessness”由“odor（气味）+ -less（没有……的）+ -ness（……的性质/状态）”构成，常用于科学、医疗、化工、环保等语境，用来强调“不会散发气味”这一特性。","日常表达中也常用更口语的说法，如“no smell / odor-free / scent-free”。其中“odor-free”偏中性，“scent-free”常见于护肤品或洗护用品，强调不含香精或无香味。"]}
{"word":"odorometer","summary":{"en":"An odorometer is a device for measuring how strong an odor is, often used in environmental monitoring.","zh":"odorometer 指用于测量气味强度的仪器，常用于环境监测与异味管理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure or estimate the strength (concentration) of an odor, especially in air or gas samples.","zh":"（尤指对空气或气体样本）测量或估算气味强度/浓度的仪器。"},"examples":[{"en":"The lab used an odorometer to quantify odors from the wastewater treatment plant.","zh":"实验室使用气味测定仪来量化污水处理厂的气味。"},{"en":"Regulators may require odorometer readings when residents report strong smells.","zh":"当居民投诉异味明显时，监管部门可能会要求提供气味测定仪的读数。"}]}],"synonyms":["odor meter","olfactometer"],"phonetic":"/ˌoʊdərˈɑːmətər/","extraExplanation":["“odorometer”较偏专业，多见于环境工程、空气质量与异味控制领域；日常英语中更常说“odor meter”或直接说“measure the odor level（测量气味水平）”。","在异味管理里，常见相关术语还有“olfactometry（嗅觉测定法）”“odor concentration（气味浓度）”和“odor unit, OU（气味单位）”。"]}
{"word":"odorosity","summary":{"en":"Odorosity means the quality of having a noticeable smell, or (less commonly) a strong/distinctive odor or fragrance.","zh":"Odorosity 指“有明显气味的性质”，也可较少见地指“浓烈/独特的气味或香气”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of having a noticeable smell; an odor (often used in a formal or scientific style)","zh":"有明显气味的性质；气味（多用于较正式或科学语体）"},"examples":[{"en":"The lab measured the odorosity of the sample after it was heated.","zh":"实验室在加热后测量了样品的气味强度。"},{"en":"Some cleaning products are designed to reduce odorosity in small rooms.","zh":"一些清洁产品被设计用来降低小房间里的气味。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong or distinctive smell, sometimes suggesting fragrance (less common)","zh":"浓烈或独特的气味；有时可指香气（较少见）"},"examples":[{"en":"The odorosity of fresh coffee filled the kitchen.","zh":"新煮咖啡的香气弥漫在厨房里。"}]}],"synonyms":["odor","smell","scent","fragrance","stench"],"phonetic":"/ˌoʊdəˈrɑsəti/","extraExplanation":["“odorosity”在现代英语中比较少见，日常更常用“odor”（气味）或“smell”（气味/闻起来）。在写作或研究语境里，它有时用来强调“气味这一性质/程度”。","词形上可联想到“odorous”（有气味的）与“odoriferous”（有强烈气味的）。如果你想表达“气味强度”，也常见“odor intensity”。"]}
{"word":"odorous","summary":{"en":"Odorous means having a noticeable smell—often unpleasant, though it can also mean strongly scented in formal use.","zh":"Odorous 指“有明显气味的”，多指难闻的气味；在较正式用法中也可指“气味浓烈/有特点”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a noticeable smell, often an unpleasant one.","zh":"有气味的；（常指）有难闻气味的。"},"examples":[{"en":"The odorous trash should be taken out before it attracts insects.","zh":"那袋有臭味的垃圾应该在招来昆虫之前拿出去。"},{"en":"After the rain, the alley became warm and odorous.","zh":"下雨后，小巷变得又闷又有味道。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Formal) Having a strong or distinctive odor (not necessarily unpleasant).","zh":"（较正式）气味浓烈或很有特点的（不一定难闻）。"},"examples":[{"en":"The kitchen was odorous with garlic and spices.","zh":"厨房里蒜香和香料味很浓。"},{"en":"Some cheeses are famously odorous, but many people enjoy them.","zh":"有些奶酪以气味浓烈著称，但很多人喜欢。"}]}],"synonyms":["smelly","stinky","malodorous","scented","odoriferous","fragrant"],"phonetic":"/ˈoʊdərəs/","extraExplanation":["“odorous”来自“odor（气味）+ -ous（充满……的）”，语气偏正式，常用于书面语或较讲究的描述。日常口语里，人们更常说“smelly（臭的）”“stinky（很臭的）”或“fragrant（香的）”。","近义词提示：如果想表达“难闻”，更精准的词有“malodorous（恶臭的）”；如果想表达“好闻”，可用“odoriferous（有香味/有气味的，较正式）”或更常用的“fragrant / aromatic”。"]}
{"word":"odorously","summary":{"en":"“Odorously” means “in a strongly smelly way,” often suggesting an unpleasant smell.","zh":"“odorously”表示“带着强烈气味地”，常暗示气味难闻。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has a strong or noticeable smell (often unpleasant).","zh":"带有强烈或明显气味地（常指不愉快的气味）。"},"examples":[{"en":"The trash can was left open, and the kitchen quickly became odorously bad.","zh":"垃圾桶没盖好，厨房很快就变得臭气熏天地难闻。"},{"en":"The alley was odorously damp after the rain.","zh":"雨后小巷潮湿，并散发着明显的气味。"}]}],"synonyms":["smellily","stinkingly","strongly scented","with a strong odor"],"phonetic":"/ˈoʊdərəsli/","extraExplanation":["“odorously”由形容词“odorous（有气味的）”加副词后缀“-ly”构成，用来说明“以……的方式（有气味地）”。","在现代英语里，更常用更自然的表达通常是“smelly / stinkingly / with a strong smell / strongly scented”。“odorously”偏书面、描写性语体，常用于文学或较正式的叙述。"]}
{"word":"odorousness","summary":{"en":"Odorousness means the degree or quality of having a noticeable smell, often an unpleasant one.","zh":"Odorousness 指“有明显气味的程度/特性”，常带有“气味浓或不太好闻”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of having a noticeable smell; often used to suggest a strong or unpleasant smell","zh":"有明显气味的特性；常用来暗示气味很浓或令人不快"},"examples":[{"en":"The odorousness of the trash told us it was time to take it out.","zh":"垃圾的臭味提醒我们该倒垃圾了。"},{"en":"Chemicals were stored in sealed containers to reduce their odorousness.","zh":"化学品被密封存放，以减少气味外泄。"},{"en":"Some people are sensitive to the odorousness of strong perfumes.","zh":"有些人对浓香水的气味很敏感。"}]}],"synonyms":["smell","odor","stink (informal)","stench","aroma (usually pleasant)"],"phonetic":"/ˈoʊdərəsnəs/","extraExplanation":["“odorousness”来自形容词“odorous”（有气味的）+ 名词后缀“-ness”（……的性质）。它比更常见的“odor/odour”更书面、更强调“这种气味的程度/特性”。","语感上它常出现在较正式或技术性的语境（如卫生、化学、环境检测），日常口语里更常说“smell/odor”或“stink”。"]}
{"word":"odorproof","summary":{"en":"Odorproof means designed to block smells from escaping or getting in.","zh":"Odorproof 指“能阻隔气味、不让味道散出或进入”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to prevent smells from escaping or entering; smell-proof","zh":"防味的；防臭的；（能）阻隔气味的"},"examples":[{"en":"Keep food in an odorproof container so your fridge won’t smell.","zh":"把食物放在防味容器里，这样冰箱就不会有味道。"},{"en":"They sell odorproof bags for storing strong-smelling items.","zh":"他们卖防味袋，用来收纳气味很重的东西。"}]}],"synonyms":["smell-proof","odor-resistant","airtight (often related)"],"phonetic":"/ˈoʊdɚˌpruːf/","extraExplanation":["“odorproof”也常写作“odor-proof”。在正式写作中，两种写法都可见；如果作定语放在名词前，用连字符（odor-proof container）更常见、更清晰。","这个词在日常生活中常用于“container/bag/bin（容器/袋子/垃圾桶）”、以及一些需要控制气味的场景（如食物、垃圾、宠物用品等）。"]}
{"word":"odors","summary":{"en":"“Odors” is the plural of “odor,” meaning noticeable smells (often unpleasant). It can also be a rare verb meaning “to give off a smell.”","zh":"“odors”是“odor”的复数，表示明显的气味（常指不好闻的味道）。它也可作较少见的动词，表示“散发气味/闻起来”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A smell, especially one that is noticeable (often unpleasant, but not always).","zh":"气味；（尤指）明显的味道（常带贬义：臭味，但也可中性或褒义）。"},"examples":[{"en":"There was a strong odor of smoke in the hallway.","zh":"走廊里有一股浓烈的烟味。"},{"en":"Some flowers have a sweet odor that attracts insects.","zh":"有些花有甜香味，会吸引昆虫。"},{"en":"The kitchen odors lingered all night.","zh":"厨房的味道整晚都散不去。"}]},{"partOfSpeech":"vi.","definition":{"en":"To give off a smell; to smell (of something).","zh":"散发气味；闻起来（有某种味道）。"},"examples":[{"en":"The cheese odors strongly.","zh":"这奶酪味道很重。"},{"en":"The room began to odor of paint after we started decorating.","zh":"我们开始装修后，房间里开始有油漆味。"}]}],"synonyms":["smells","scents","aromas","fragrances (pleasant)","stenches (unpleasant)"],"phonetic":"/ˈoʊdɚz/","extraExplanation":["“odor(s)”在美式英语更常见；英式英语常写作“odour(s)”。","日常口语里，如果想表达“臭味”更直接，常用“smell”或“stink”；如果表达“香味”，常用“scent”“fragrance”。“odor”较中性，但在很多语境里会让人联想到不太好闻的味道。"]}
{"word":"odos","summary":{"en":"Odos is an uncommon word in English; it’s a Greek term meaning “road/way,” mainly used in word-origin explanations.","zh":"Odos 在英语里不常单独使用；它源自希腊语，意为“道路/方式”，主要出现在词源解释中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon in modern English) a Greek word meaning “road, way, path,” sometimes mentioned when explaining the origins of words.","zh":"（现代英语中少见）希腊语词，意为“道路、路径、方式”，常在解释词源时出现。"},"examples":[{"en":"In Greek, odos means “road” or “way.”","zh":"在希腊语中，odos 的意思是“道路”或“路径”。"},{"en":"The word method is sometimes explained as coming from meta- (“after”) + hodos/odos (“way”).","zh":"method 有时会被解释为来自 meta-（“在……之后”）+ hodos/odos（“道路/方式”）。"}]}],"synonyms":["way","path","route"],"phonetic":"/ˈoʊdɑs/","extraExplanation":["“odos/ὁδός”更多是词源学（etymology）里会提到的形式；在英语日常写作中通常不会单独使用。","你可能是想输入 odds（“几率；胜算”）或 Odoo（一个软件品牌）。如果你告诉我语境/句子，我可以帮你确认要查的词。"]}
{"word":"odostemon","summary":{"en":"Odostemon is an older botanical genus name, often referring to plants now classified as Mahonia (Oregon grape).","zh":"Odostemon 是较旧的植物属名，多指如今常归入十大功劳属（Mahonia，如俄勒冈葡萄）的一类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name used in botany for certain evergreen shrubs in the barberry family, often treated today as part of the genus Mahonia (Oregon grape).","zh":"（植物）一种小檗科常绿灌木的属名，现多被归入十大功劳属（Mahonia，常见如“俄勒冈葡萄”）。"},"examples":[{"en":"Some older plant guides list Oregon grape under the genus Odostemon.","zh":"一些较早的植物百科会把俄勒冈葡萄列在 Odostemon 这个属下。"},{"en":"The label may show Odostemon, but many modern references use Mahonia instead.","zh":"标签上可能写 Odostemon，但很多现代资料会改用 Mahonia。"}]}],"synonyms":["Mahonia","Oregon grape","barberry family (Berberidaceae)"],"phonetic":"/ˌoʊdoʊˈstiːmən/","extraExplanation":["这是一个偏“学术/旧用法”的拉丁化属名：在园艺书、草药书或老的分类系统里偶尔会看到。不同资料可能因为分类观点更新而改用 Mahonia（十大功劳属）或相关名称。若你是在药材、园艺标签或古旧文献中遇到它，通常可把它理解为“十大功劳/俄勒冈葡萄一类的小檗科灌木”。"]}
{"word":"odour","summary":{"en":"Odour means a smell, often an unpleasant or strong one; it’s the British spelling of “odor.”","zh":"odour 指“气味”，常指难闻或强烈的味道；是“odor”的英式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A smell, especially one that is unpleasant or strong.","zh":"气味；（尤指）难闻或很强烈的味道。"},"examples":[{"en":"There was a strange odour coming from the kitchen.","zh":"厨房里飘出一股奇怪的气味。"},{"en":"The odour of smoke stayed on his clothes.","zh":"烟味一直留在他的衣服上。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular scent that is associated with a person, place, or thing (often used in formal or literary writing).","zh":"（较正式/文学）某种特有的气息、味道（常与人、地点或事物联系在一起）。"},"examples":[{"en":"The room had the faint odour of old books.","zh":"房间里有淡淡的旧书气息。"}]}],"synonyms":["smell","scent","stink","stench","aroma"],"phonetic":"/ˈoʊdər/","extraExplanation":["“odour”是英式拼写；美式英语更常写作“odor”。两者意思相同，只是拼写习惯不同。","在日常口语里，如果想表达“香味”，更常用“smell”或“scent”；“odour/odor”更容易让人联想到“不太好闻的味道”，不过也可用于中性描述。"]}
{"word":"odoured","summary":{"en":"“Odoured” means “having a noticeable smell,” and it’s the British spelling of “odored.”","zh":"“odoured”表示“有明显气味的”，是美式“odored”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a smell; scented or smelling in a noticeable way (often used with an adverb like “sweetly,” “foully,” etc.).","zh":"有气味的；带香味或明显气味的（常与“sweetly / foully”等副词搭配）。"},"examples":[{"en":"The room was odoured with fresh coffee.","zh":"房间里弥漫着新鲜咖啡的香味。"},{"en":"His clothes were strongly odoured after the smoke-filled party.","zh":"参加完烟雾弥漫的聚会后，他的衣服气味很重。"}]}],"synonyms":["scented","fragrant","perfumed","smelly","odorous"],"phonetic":"/ˈoʊdərd/","extraExplanation":["“odoured”是英式拼写（BrE），美式英语更常写作“odored”。两者意思相同，只是拼写习惯不同。","它常见于较正式或描写性（文学/叙述）语境，用来营造氛围；日常口语中更常说“smelled (of) … / smelled like …”。"]}
{"word":"odourful","summary":{"en":"Odourful means having a strong, noticeable smell, often an unpleasant one (rare in modern use).","zh":"Odourful 指“气味很明显/很重”，常带“难闻”的含义（现代用法较少）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a noticeable or strong smell; often suggesting an unpleasant smell.","zh":"有明显（常常是强烈的）气味；通常暗示难闻的气味。"},"examples":[{"en":"The kitchen was odourful after the fish was cooked.","zh":"鱼煮好后，厨房里味道很重。"},{"en":"Some cheeses are delicious but very odourful.","zh":"有些奶酪很好吃，但气味很重。"}]}],"synonyms":["odorous","smelly","pungent","stinky","fragrant"],"phonetic":"/ˈoʊdɚfəl/","extraExplanation":["“odourful”在现代英语中很少见，更常用的是“odorous”（有气味的，常指难闻）或“fragrant”（芳香的，偏正面）以及“smelly”（有臭味的，口语）。","拼写上“odour-”更偏英式英语（BrE），美式英语（AmE）通常写作“odor-”。因此你也可能看到更少见的“odorful”。"]}
{"word":"odourless","summary":{"en":"“Odourless” means having no smell (British spelling of “odorless”).","zh":"“odourless”表示“无气味的”，是美式“odorless”的英式拼法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no smell; without a noticeable odor.","zh":"无气味的；没有明显气味的。"},"examples":[{"en":"This cleaner is odourless, so it won’t leave a strong smell in the room.","zh":"这种清洁剂是无气味的，所以不会在房间里留下很重的味道。"},{"en":"Some gases are odourless, which can make them dangerous if they leak.","zh":"有些气体是无气味的，一旦泄漏就可能很危险。"},{"en":"She prefers odourless lotion because strong scents give her a headache.","zh":"她更喜欢无气味的乳液，因为浓香会让她头疼。"}]}],"synonyms":["odorless","scentless","unscented","inodorous"],"phonetic":"/ˈoʊdɚləs/","extraExplanation":["“odourless”是英式拼法；美式更常写作“odorless”。两者意思完全相同。","构词：odour/odor（气味）+ -less（没有……的）。常见同类：sugarless（无糖的）、wireless（无线的）。","使用场景常见于：化妆品/清洁用品（odourless soap）、化学品与安全提示（odourless gas）、日常偏好（odourless deodorant）。"]}
{"word":"odours","summary":{"en":"“Odours” means “smells” (plural). It can also mean a hint/sign of something, usually in a figurative sense.","zh":"“odours”意为“气味”（复数）；也可引申为某事的“迹象/端倪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Smells (especially noticeable ones); plural of “odour/odor.”","zh":"气味（尤指明显的气味）；“odour/odor”的复数。"},"examples":[{"en":"The kitchen was filled with the rich odours of garlic and herbs.","zh":"厨房里充满了大蒜和香草的浓郁气味。"},{"en":"Some odours can trigger strong memories.","zh":"有些气味会唤起强烈的记忆。"}]},{"partOfSpeech":"n.","definition":{"en":"A sign or hint of something (often used in the phrase “an odour of …”).","zh":"（引申）某事的迹象、端倪（常用于短语“an odour of …”）。"},"examples":[{"en":"There was an odour of trouble in the way they avoided the question.","zh":"他们回避问题的方式让人感觉到麻烦的苗头。"},{"en":"The report has an odour of political bias.","zh":"这份报告有一种政治偏见的味道（迹象）。"}]}],"synonyms":["smells","scents","aromas","fragrances","stenches"],"phonetic":"/ˈoʊdɚz/","extraExplanation":["“odours”是英式拼写的复数；美式更常写作“odors”。两者意思相同，只是拼写差异。","在文学或正式写作中，“odour/odour of …”有时带一点主观评价色彩：既可以是“香气”，也可以是“臭味”，要靠上下文判断。"]}
{"word":"ods","summary":{"en":"ODS is an acronym most commonly meaning an OpenDocument Spreadsheet (.ods file), and in environmental contexts it can mean ozone-depleting substances.","zh":"ODS 是一个缩写，最常见指 OpenDocument 电子表格（.ods 文件）；在环境领域也可指“破坏臭氧层物质”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) OpenDocument Spreadsheet: a spreadsheet file format used by programs like LibreOffice Calc and Apache OpenOffice Calc, usually with the file extension .ods.","zh":"（缩写）OpenDocument Spreadsheet：一种电子表格文件格式，常用于 LibreOffice Calc、OpenOffice Calc 等软件，文件扩展名通常为 .ods。"},"examples":[{"en":"Please export the table as an ODS file so I can open it in LibreOffice.","zh":"请把这张表导出为 ODS 文件，这样我就能用 LibreOffice 打开。"},{"en":"The report is attached in .ods format instead of .xlsx.","zh":"报告以 .ods 格式附件发送，而不是 .xlsx。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) Ozone-depleting substances: chemicals (such as CFCs) that damage the Earth’s ozone layer.","zh":"（缩写）破坏臭氧层物质：指会破坏地球臭氧层的化学物质（如氯氟烃 CFCs）。"},"examples":[{"en":"Many countries agreed to phase out ODS under international agreements.","zh":"许多国家在国际协议下同意逐步淘汰 ODS。"},{"en":"Refrigerants that are not ODS are safer for the ozone layer.","zh":"不属于 ODS 的制冷剂对臭氧层更安全。"}]}],"synonyms":["OpenDocument Spreadsheet (for file format)","ozone-depleting substances (for environmental meaning)"],"phonetic":"/oʊ diː ɛs/","extraExplanation":["“ODS”通常以字母读法出现（O-D-S），在不同领域含义不同：办公软件里多指电子表格文件格式；环境科学与政策语境里常指“破坏臭氧层物质”。阅读或写作时最好根据上下文判断。"]}
{"word":"odso","summary":{"en":"“odso” isn’t a common dictionary word; it’s likely an acronym (ODSO) or a typo, so its meaning depends on context.","zh":"“odso”不是常见词；多半是缩写或拼写错误，需要语境才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as an acronym (ODSO) or a typo/misspelling. Its meaning depends on the context (where you saw it).","zh":"不是常见的英语单词；更可能是缩写（ODSO）或拼写错误。具体含义取决于语境（你在哪里看到它）。"},"examples":[{"en":"I saw “ODSO” in a document, but I can’t find it in a dictionary—what does it stand for?","zh":"我在一份文件里看到“ODSO”，但词典里查不到——它是什么缩写？"},{"en":"Could you share the full sentence with “odso” so I can help identify the meaning?","zh":"你能把包含“odso”的完整句子发出来吗？这样我更好判断它的意思。"}]}],"phonetic":"/ˌoʊ diː ɛs ˈoʊ/","extraExplanation":["“odso/ODSO”很可能是：1）某个机构/部门名的缩写；2）聊天或打字时把别的词打错了（例如把相近键位的字母打乱）；3）特定圈子/游戏/论坛里的自造词。把你看到它的来源（句子、行业、国家/地区）贴出来，我可以更准确判断。"]}
{"word":"odum","summary":{"en":"Odum usually refers to a West African hardwood tree and its timber (often called iroko), and it can also be used as a Ghanaian proper name.","zh":"Odum 通常指一种西非硬木树及其木材（常称 iroko），也可作加纳的人名或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large West African hardwood tree (Milicia excelsa) and the durable timber from it; in Ghana it is commonly called “odum,” and the wood is often traded as iroko (sometimes called “African teak”).","zh":"一种西非大型硬木树（学名 Milicia excelsa）及其耐用木材；在加纳常称为“odum”，木材贸易中常叫“iroko”（有时也被称作“非洲柚木”）。"},"examples":[{"en":"The door was made from odum, a wood chosen for its strength and resistance to decay.","zh":"这扇门用 odum 木做成，因为这种木材结实且耐腐。"},{"en":"In Ghana, odum is a well-known timber used for construction and furniture.","zh":"在加纳，odum 是很有名的木材，常用于建筑和家具。"}]},{"partOfSpeech":"n.","definition":{"en":"a Ghanaian name or place name (used as a proper noun), often connected to the odum tree or to communities where it is common.","zh":"加纳的人名或地名（专有名词用法），常与 odum 树有关，或与该树常见的地区相关。"},"examples":[{"en":"Odum is a name you may hear in Ghana, especially in areas where the odum tree is common.","zh":"Odum 是你在加纳可能会听到的名字，尤其在 odum 树常见的地区。"}]}],"synonyms":["iroko","African teak (trade name)","Milicia excelsa"],"phonetic":"/oʊˈdʌm/","extraExplanation":["“Odum”在英语语境里多见于加纳/西非相关话题（木材、植物、地名或人名）。在国际木材市场上，这种木材更常被称为“iroko”。","有时你会看到“African teak（非洲柚木）”这种叫法，但它并不是与真正的柚木（teak）同一种树；这是基于用途与质地相似而来的商业俗称。"]}
{"word":"odwyer","summary":{"en":"ODwyer (often O’Dwyer) is an Irish family name.","zh":"ODwyer（常写作 O’Dwyer）是一个爱尔兰姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an Irish surname (family name), often written as O’Dwyer; it may refer to a person with that family name.","zh":"一个爱尔兰姓氏（家族姓），常写作 O’Dwyer；可用来指姓这个姓的人。"},"examples":[{"en":"Ms. O’Dwyer will lead today’s meeting.","zh":"奥德怀尔女士将主持今天的会议。"},{"en":"My teacher’s last name is O’Dwyer.","zh":"我老师的姓是奥德怀尔（O’Dwyer）。"}]}],"phonetic":"/oʊˈdwaɪər/","extraExplanation":["“O’”在许多爱尔兰姓氏中表示“……的后代/子孙”（源自爱尔兰语 Ó）。因此 O’Dwyer 大致有“德怀尔（Dwyer）家族后裔”的含义。实际拼写上既可能带撇号（O’Dwyer），也可能省略为 ODwyer/ODWYER（常见于数据库或电子表格中）。"]}
{"word":"odyl","summary":{"en":"A rare historical word for a supposed mystical life energy (also spelled odyle; “odic force”).","zh":"一个罕见的历史词，指被设想的神秘生命能量（也拼作 odyle；称“odic force/奥德力”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) A supposed life force or subtle energy, especially in 19th‑century spiritualist or pseudo-scientific writing; also spelled “odyle” or “odic force.”","zh":"（罕见/历史用语）一种被认为存在的“生命力/微妙能量”，常见于19世纪的灵性主义或伪科学写作中；也拼作 odyle，或称 odic force（奥德力）。"},"examples":[{"en":"Some 19th‑century writers claimed that “odyl” could be sensed around magnets or living bodies.","zh":"一些19世纪作者声称，“odyl”能在磁铁或生物体周围被感知到。"},{"en":"Modern science does not accept odyl as a real physical force.","zh":"现代科学不承认“odyl”是真实的物理力量。"}]}],"synonyms":["odyle","odic force","vital force (roughly)"],"phonetic":"/ˈoʊdiːl/","extraExplanation":["“odyl/odyle（奥德力）”主要与19世纪德国学者 Reichenbach（赖辛巴赫）提出的“odic force”有关，当时有人试图用它解释磁性、催眠、人体感觉等现象。后来随着实验方法与物理学发展，这类说法未被证实，因此现在多出现在历史、神秘学或文学语境中。"]}
{"word":"odyle","summary":{"en":"“Odyle” is a rare, old-fashioned word for a supposed life force or subtle spiritual energy.","zh":"“Odyle”是一个罕见的古旧词，指被设想存在的生命力或精微的精神能量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, archaic) A kind of vital energy or subtle “life force” believed to flow through living beings; sometimes described as a spiritual or psychic substance.","zh":"（罕见/古旧）一种被认为存在于生命体中的“生命能量/精微能量”；有时被描述为精神或心灵层面的物质。"},"examples":[{"en":"In some 19th-century mystical writings, the body was said to be filled with odyle.","zh":"在一些19世纪的神秘主义著作中，人体被说成充满了 odyle（生命能量）。"},{"en":"The author used “odyle” to explain healing effects that science couldn’t yet describe.","zh":"作者用“odyle”来解释当时科学尚无法说明的疗愈现象。"}]}],"synonyms":["odic force","life force","vital energy","vital force"],"phonetic":"/ˈoʊdaɪl/","extraExplanation":["这个词非常少见，主要出现在19世纪欧洲的“神秘学/磁气疗法/超心理学”等语境中，现代英语里几乎不用。","常见拼写也会见到 odic force（奥迪力/奥迪能量），与“动物磁力（animal magnetism）”一类的历史观念有关。","词源与早期学者（如 Reichenbach）提出的理论相关；今天更多被当作历史术语或文学/神秘学用语，而不是科学概念。"]}
{"word":"odyles","summary":{"en":"“Odyles” is the plural of “odyle,” an old, unscientific term for a supposed life-force energy.","zh":"“odyles”是“odyle”的复数，指一种旧式、缺乏科学依据的“生命力/能量”概念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of odyle: a supposed “life force” or subtle energy once proposed in the 1800s (now considered unscientific).","zh":"odyle 的复数：指19世纪有人提出的一种“生命力/微妙能量”的假说（如今被认为不具科学依据）。"},"examples":[{"en":"In old writings, some authors claimed people could sense invisible odyles around magnets.","zh":"在一些旧文献里，有作者声称人们能在磁铁周围感到看不见的 odyles。"},{"en":"Modern science does not accept odyles as a real form of energy.","zh":"现代科学并不承认 odyles 是真实存在的一种能量。"}]}],"synonyms":["odic force","life force","vital force"],"phonetic":"/ˈoʊdaɪl/","extraExplanation":["“odyle/odic force（奥德力）”与19世纪德国学者 Reichenbach（赖歇巴赫）的理论有关，他试图用一种看不见的“力”来解释催眠、磁铁、人体感觉等现象。这类概念在当时的“灵性/伪科学”讨论中较常见，但没有被后来的实验与主流科学证实。","你输入的“odyles”很可能是拼写上的目标词“odyle”的复数；如果你原本想查的是人名“Odile（奥迪尔）”或别的词，请告诉我上下文句子，我可以帮你确认。"]}
{"word":"odylic","summary":{"en":"“Odylic” means related to the supposed “odyle” life force from 19th-century occult/pseudoscientific ideas.","zh":"“odylic”指与19世纪神秘主义/伪科学观念中的“奥德力（odyle）”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to “odyle,” a supposed invisible life force or magnetic fluid (now considered a historical/pseudoscientific concept).","zh":"与“奥德力（odyle）”有关的；指一种被认为存在的无形生命力或磁性流体（如今多被视为历史上的伪科学概念）。"},"examples":[{"en":"In some 19th-century writings, people claimed illness could be influenced by odylic forces.","zh":"在一些19世纪的著作中，有人声称疾病会受到奥德力的影响。"},{"en":"The novel mentions an “odylic aura,” reflecting the era’s fascination with hidden energies.","zh":"小说里提到“奥德力气场”，反映了那个时代对神秘能量的迷恋。"}]}],"synonyms":["odic","occult","mystical","esoteric","pseudoscientific"],"phonetic":"/oʊˈdɪlɪk/","extraExplanation":["“odylic”来自德国语境中的“Od”（英语常写作 odyle），与19世纪学者卡尔·冯·赖兴巴赫（Karl von Reichenbach）提出的“Odic force/奥德力”理论有关，当时常与催眠术、动物磁力（mesmerism）等观念并列出现。","现代科学并不承认“奥德力”作为可验证的自然力；因此在当代英语里，odylic 多见于历史、文学或研究伪科学/神秘主义思潮的语境。","拼写提示：odylic / odylic force / odylic aura 等多为特定历史用语；日常写作中更常用“mystical（神秘的）/ occult（玄秘的）/ pseudoscientific（伪科学的）”来表达相近感觉。"]}
{"word":"odylism","summary":{"en":"Odylism is an old (19th‑century) belief in a supposed invisible “odic force” linked to magnetism and psychic effects.","zh":"Odylism 指19世纪一种关于“奥德力/奥德能量”的学说，认为有看不见的力量与磁力、通灵等现象有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a 19th‑century belief in a supposed natural “odic force” (a kind of invisible energy) thought to influence health, magnetism, and psychic phenomena; the practices or ideas based on that belief","zh":"“奥德力（odic force）”学说：19世纪一种认为存在某种看不见的自然能量、可影响健康、磁力与通灵现象的观念；也指基于该观念的一套说法或做法"},"examples":[{"en":"In some Victorian-era writings, odylism was presented as a scientific explanation for mesmerism.","zh":"在一些维多利亚时代的著作里，odylism 被当作解释催眠磁疗（mesmerism）的一种“科学”理论。"},{"en":"Modern science does not accept odylism, but it is useful for understanding the history of pseudoscience.","zh":"现代科学不认可 odylism，但它有助于我们理解伪科学史的发展。"}]}],"synonyms":["odism","odicism","odic force (theory)"],"phonetic":"/ˈoʊdɪˌlɪzəm/","extraExplanation":["该词源自德语体系中的“Od”（常译作“奥德力/奥德能量”），与19世纪自然哲学、动物磁力（animal magnetism）和灵性主义（spiritualism）的流行有关。提出者之一是德国学者 Karl von Reichenbach，他试图用“odic force”解释磁石、人体与“敏感者”的感觉报告。如今多被归入历史上的伪科学概念。","拼写上也可见变体：odicism、odism；相关形容词：odylic（奥德力的）。"]}
{"word":"odylist","summary":{"en":"“odylist” isn’t a standard English word; it’s likely a misspelling or a proper name.","zh":"“odylist” 不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username. Common possibilities include “odyssey” (a long journey) or “to-do list” (a list of tasks).","zh":"这不是标准英语单词。它可能是拼写错误，或是名字/用户名。常见可能是 “odyssey”（漫长旅程）或 “to-do list”（待办清单）。"},"examples":[{"en":"I tried to look up “odylist,” but I couldn’t find it in an English dictionary.","zh":"我试着查 “odylist”，但在英语词典里找不到。"},{"en":"Did you mean “odyssey” or “to-do list”?","zh":"你是想说 “odyssey” 还是 “to-do list” 吗？"}]}],"phonetic":"/ˈoʊdiˌlɪst/","extraExplanation":["如果你能告诉我你在哪里看到 “odylist”（例如一句完整句子、网页/APP 名称、学术文章等），我可以更准确判断它是拼写错误、专有名词，还是某个领域的术语。","最接近的常见词之一是 odyssey（漫长而充满波折的旅程），另一个可能是 to-do list（待办清单）。你也可能想输入的是 “OdyList/ODyList” 之类的产品名或账号名。"]}
{"word":"odylization","summary":{"en":"A rare historical term for the supposed use or creation of an imaginary “odic” force.","zh":"一个罕见的历史词，指据称运用或产生假想的“奥德力（odic force）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) The supposed process of producing or influencing an imaginary “odic” (odyle) force; the theory or practice of explaining phenomena by this force.","zh":"（罕见，历史用语）指据称产生或影响一种假想的“奥德力/奥德流（odic/odyle）”的过程；或用这种力量来解释现象的理论/做法。"},"examples":[{"en":"In some 19th-century writings, odylization was proposed as an explanation for unusual sensations during “magnetic” treatments.","zh":"在一些19世纪的著作中，“odylization”被用来解释在“磁疗/磁化”过程中出现的异常感觉。"},{"en":"Modern science does not accept odylization, but the term appears in historical discussions of early alternative medicine.","zh":"现代科学并不承认“odylization”，但它会出现在有关早期替代医学的历史讨论中。"}]}],"synonyms":["odic theory","odic force (context term)","Reichenbach’s odic force (context term)"],"phonetic":"/ˌoʊdɪlaɪˈzeɪʃən/","extraExplanation":["“odylization”来自“odyle/odic”，与19世纪奥地利化学家卡尔·冯·赖兴巴赫（Karl von Reichenbach）提出的“odic force（奥德力）”有关。他试图用一种看不见的能量来解释催眠、磁疗、灵感等现象；后来这一理论被视为伪科学/未被证实。","拼写提示：你输入的“odylization”较少见，也可能是“odic/odyle + -ization”的构词形式；相关词有“odic”“odyle”“odic force”。"]}
{"word":"odylize","summary":{"en":"A rare verb meaning “to infuse with the supposed odic life force,” used mainly in 19th‑century contexts.","zh":"一个极少见的动词，指“使带有假想的奥德生命能量”，多见于19世纪语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, historical) To charge or infuse something with “odyle,” a supposed life force or energy imagined in some 19th‑century theories (similar in idea to “animal magnetism”).","zh":"（罕见，历史用语）使某物“充满/带有奥德力（odyle）”，一种19世纪某些理论中假想的生命能量或灵力（概念上类似“动物磁力”）。"},"examples":[{"en":"In some old writings, a healer claimed he could odylize water for his patients.","zh":"在一些旧文献中，有治疗者声称他能把水“odylize（灌注奥德力）”给病人饮用。"},{"en":"The author argued that crystals could be odylized by touch.","zh":"作者认为水晶可以通过触摸被“odylize（注入奥德力）”。"}]}],"synonyms":["magnetize (loosely)","energize (loosely)"],"phonetic":"/ˈoʊdəlˌaɪz/","extraExplanation":["“odylize”来自“odyle/odic force（奥德力/奥德能）”，与19世纪德国自然哲学家冯·赖兴巴赫（Karl von Reichenbach）提出的“Odic force”有关。当时有人把它描述为一种看不见的能量，能影响健康、磁性或感觉；现代科学并不承认它为可验证的物理力量。","这个词在当代英语里几乎不使用，更多出现在历史文本、神秘学/唯灵论相关作品或讨论伪科学史的语境中。"]}
{"word":"odyls","summary":{"en":"“odyls” isn’t a standard English word; it’s probably a misspelling of “odles” (“a lot of”).","zh":"“odyls”不是标准英文词；很可能是“odles”的误拼，表示“很多、大量”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling of “odles,” meaning a very large amount or number.","zh":"（非标准拼写）很可能是“odles”的误拼，意思是“大量、很多”。"},"examples":[{"en":"We have odles of snacks for the trip.","zh":"我们为这次旅行准备了很多零食。"},{"en":"She gets odles of messages every day.","zh":"她每天都会收到大量消息。"}]}],"synonyms":["lots (of)","a ton (of)","loads (of)","plenty (of)"],"phonetic":"/ˈɑdəlz/","extraExplanation":["“odyls”不是常见英文单词；最接近、最常用的可能是“odles”。“odles”比较口语，常用于强调“多得不得了”。","如果你本来想查的是“odyssey”（/ˈɑdɪsi/，意为“漫长而冒险的旅程”，也指《奥德赛》），告诉我你的语境或句子，我可以帮你确认。"]}
{"word":"odynerus","summary":{"en":"Odynerus is a scientific genus name for solitary potter wasps that build mud nests.","zh":"Odynerus 是独居泥壶蜂（陶罐蜂）的一类蜂的科学属名，特点是用泥筑巢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of solitary potter wasps (family Vespidae) that build small mud nests and hunt insects or caterpillars to feed their young","zh":"一种“泥壶蜂/陶罐蜂”（胡蜂科）属名，通常独居，用泥筑小巢，并捕捉昆虫或毛毛虫等作为幼虫食物"},"examples":[{"en":"Scientists recorded several Odynerus species nesting in cracks of sun‑warmed rocks.","zh":"科学家记录到多种 Odynerus 在被太阳晒热的岩石缝里筑巢。"},{"en":"A single Odynerus female can build and stock multiple mud cells for her larvae.","zh":"一只 Odynerus 雌蜂可以建造并储备多个泥室来养育幼虫。"}]}],"synonyms":["potter wasp","mason wasp"],"phonetic":"/oʊˈdɪnərəs/","extraExplanation":["Odynerus 是生物分类学中的拉丁化属名，通常在学术写作里首字母大写并用斜体表示（如 *Odynerus*）。在日常英文里，人们更常说“potter wasp（泥壶蜂/陶罐蜂）”来泛指这一类会用泥做巢的独居胡蜂。","发音在不同地区与不同说话者之间可能略有差异；遇到正式场合（如报告或课堂），可参考你所使用的昆虫学资料或词典的读音标注。"]}
{"word":"odyssean","summary":{"en":"Odyssean means connected to Odysseus or *The Odyssey*, or describing a long, winding, adventurous journey.","zh":"Odyssean 指与奥德修斯或《奥德赛》相关，或形容漫长曲折、充满冒险与磨难的旅程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Odysseus (Ulysses) or Homer’s epic poem *The Odyssey*; Homeric.","zh":"与奥德修斯（罗马名尤利西斯）或荷马史诗《奥德赛》有关的；荷马史诗式的。"},"examples":[{"en":"The novel is full of Odyssean echoes: shipwrecks, temptations, and a long road home.","zh":"这部小说充满了“奥德赛式”的呼应：海难、诱惑，以及漫长的归家之路。"},{"en":"Scholars often describe the hero’s cunning as an Odyssean trait.","zh":"学者常把主人公的机智称为“奥德修斯式”的特质。"}]},{"partOfSpeech":"adj.","definition":{"en":"Like a long, adventurous journey with many twists and hardships; odyssey-like.","zh":"像一段漫长而充满冒险、曲折与艰难的旅程；“奥德赛式”的。"},"examples":[{"en":"Her Odyssean journey through illness ended with a slow return to everyday life.","zh":"她经历疾病的“奥德赛式”旅程，最终以缓慢回归日常而告终。"},{"en":"The team’s Odyssean trek across the mountains took weeks.","zh":"团队穿越群山的“奥德赛式”跋涉持续了数周。"},{"en":"After years abroad, he finally completed an Odyssean homecoming.","zh":"在海外多年后，他终于完成了一次“奥德赛式”的归乡。"}]}],"synonyms":["Homeric","epic","odyssey-like","adventurous","long and winding"],"phonetic":"/oʊdɪˈsiːən/","extraExplanation":["“Odyssean”来自希腊英雄 Odysseus（奥德修斯）之名。《奥德赛》中他在特洛伊战争后漂泊十年，经历怪物、诱惑与考验，最终回到家乡伊萨卡。因此这个词常用来比喻“漫长、波折、充满冒险的旅程”。","在现代写作里，“Odyssean”常带有文学色彩，比 “long” 或 “difficult” 更有史诗感；如果只是普通困难旅程，用 “long”/“arduous” 更日常。"]}
{"word":"Odysseus","summary":{"en":"Odysseus is the hero of Homer’s The Odyssey; figuratively, it can mean someone on a long, adventurous journey.","zh":"Odysseus（奥德修斯）是荷马《奥德赛》的英雄；引申可指踏上漫长而充满冒险旅程的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legendary Greek hero, king of Ithaca, and the main character of Homer’s epic poem The Odyssey, famous for his cleverness and long journey home after the Trojan War.","zh":"奥德修斯：希腊神话与史诗中的传奇英雄，伊萨卡（Ithaca）的国王，《奥德赛》的主角，以机智与特洛伊战争后漫长的返乡旅程著称。"},"examples":[{"en":"Odysseus is best known for his long voyage home in The Odyssey.","zh":"奥德修斯最广为人知的是他在《奥德赛》中漫长的返乡航程。"},{"en":"In Greek myths, Odysseus is admired for his intelligence and strategic thinking.","zh":"在希腊神话中，奥德修斯因聪明与善于谋略而受人敬佩。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) A person who goes on a long, difficult journey full of adventures and challenges.","zh":"（引申义）经历漫长、艰难且充满冒险与考验之旅的人。"},"examples":[{"en":"After years of moving from country to country, she felt like a modern Odysseus.","zh":"在多个国家辗转多年后，她觉得自己像个现代的“奥德修斯”。"},{"en":"The novel follows an Odysseus-like traveler searching for home and identity.","zh":"这部小说讲述了一位“奥德修斯式”的旅人寻找家园与自我的故事。"}]}],"synonyms":["Ulysses","the hero of The Odyssey","wanderer (figurative)"],"phonetic":"/oʊˈdɪsiəs/","extraExplanation":["“Odysseus”是希腊名；在罗马传统中他常被称为“Ulysses（尤利西斯）”。","《奥德赛》（The Odyssey）是古希腊诗人荷马（Homer）的史诗之一，主题常被概括为“漂泊、诱惑、坚持与归家”。","在英语里，形容词“odyssean/odysseus-like”有时用来描述“史诗般的、充满波折的旅程”。"]}
{"word":"Odyssey","summary":{"en":"An odyssey is a long, adventurous journey; it also refers to Homer’s epic poem The Odyssey.","zh":"odyssey 指漫长而充满冒险的旅程；也可特指荷马史诗《奥德赛》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, adventurous journey, often with many different experiences and challenges","zh":"漫长而充满冒险的旅程；（经历丰富、波折多的）探索之旅"},"examples":[{"en":"Moving to a new country turned into an odyssey of learning and adaptation.","zh":"搬到一个新国家成了一段学习与适应的漫长历程。"},{"en":"Her career has been an odyssey from small-town teacher to published author.","zh":"她的职业生涯是一段从小镇教师到出版作家的历程。"}]},{"partOfSpeech":"n.","definition":{"en":"The Odyssey: an ancient Greek epic poem traditionally attributed to Homer, describing Odysseus’s long journey home after the Trojan War","zh":"《奥德赛》：古希腊史诗，传统上认为出自荷马之手，讲述奥德修斯在特洛伊战争后漫长返乡之旅"},"examples":[{"en":"In literature class, we read The Odyssey and discussed its themes of home and identity.","zh":"在文学课上，我们阅读了《奥德赛》，并讨论了“家”与“身份认同”等主题。"},{"en":"Odysseus’s odyssey is filled with monsters, storms, and difficult choices.","zh":"奥德修斯的返乡之旅充满了怪物、风暴和艰难的抉择。"}]}],"synonyms":["journey","adventure","quest","expedition","voyage"],"phonetic":"/ˈɑdəsi/","extraExplanation":["“odyssey”源自《奥德赛》主角 Odysseus（奥德修斯）的故事，因此在现代英语里常用作比喻：不仅指“旅行”，更强调“曲折、考验、成长”。","写作或口语中常见搭配：a personal odyssey（个人成长历程）、an emotional odyssey（情感历程）、an odyssey of discovery（探索之旅）。","注意大小写：the Odyssey（书名要大写）；an odyssey（泛指一段漫长曲折的经历，小写）。"]}
{"word":"odyssey","summary":{"en":"Odyssey means a long, eventful journey; The Odyssey is Homer’s epic about Odysseus’s long trip home.","zh":"odyssey 指漫长而曲折的历程；The Odyssey 指荷马的史诗《奥德赛》，讲奥德修斯回乡之旅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long journey full of adventures, difficulties, and important experiences","zh":"一段漫长而充满冒险、困难与重要经历的旅程"},"examples":[{"en":"Moving to a new country became an odyssey of paperwork, language learning, and new friendships.","zh":"搬到一个新国家成了一段充满文件手续、语言学习和新友谊的漫长历程。"},{"en":"Her recovery from injury was an odyssey that took patience and daily effort.","zh":"她从受伤中康复是一段需要耐心与日复一日努力的艰难历程。"}]},{"partOfSpeech":"n.","definition":{"en":"(Odyssey) the ancient Greek epic poem about Odysseus’s long return home after the Trojan War, traditionally attributed to Homer","zh":"（《奥德赛》）古希腊史诗，讲述奥德修斯在特洛伊战争后历经多年回乡的故事，传统上归于荷马"},"examples":[{"en":"In class we read parts of The Odyssey and talked about temptation and homecoming.","zh":"课上我们读了《奥德赛》的部分篇章，并讨论了诱惑与归家主题。"},{"en":"Many modern stories borrow from The Odyssey: a hero travels, struggles, and finally returns changed.","zh":"许多现代故事借鉴《奥德赛》：英雄出行、受挫，最终带着改变归来。"}]}],"synonyms":["journey","quest","adventure","expedition","saga"],"phonetic":"/ˈɑdəsi/","extraExplanation":["“odyssey”作为普通名词使用时，常带有“历尽艰辛、不断成长”的意味，不一定真的是旅行，也可以指人生阶段（如求学、移民、康复）。","词源来自希腊英雄 Odysseus（奥德修斯）的名字；因此写作大写 “The Odyssey” 特指史诗，小写 “an odyssey” 多指“漫长曲折的经历”。"]}
{"word":"odysseys","summary":{"en":"“Odysseys” is the plural of “odyssey,” meaning long adventurous journeys or long, challenging life experiences.","zh":"“odysseys”是“odyssey”的复数，指漫长的冒险旅程，或比喻漫长而艰难的人生历程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"long journeys (often difficult or adventurous); plural of “odyssey.”","zh":"漫长的旅程（常指艰难或充满冒险）；“odyssey”的复数。"},"examples":[{"en":"After college, they went on odysseys across Asia and Europe.","zh":"大学毕业后，他们踏上了横跨亚洲和欧洲的漫长旅行。"},{"en":"The book tells the odysseys of several immigrants as they build new lives.","zh":"这本书讲述了几位移民在建立新生活过程中的漫长历程。"}]},{"partOfSpeech":"n.","definition":{"en":"long, complicated life experiences or processes (not necessarily travel); plural of “odyssey.”","zh":"漫长而曲折的人生经历或过程（不一定是旅行）；“odyssey”的复数。"},"examples":[{"en":"Recovering from the accident became one of his hardest odysseys.","zh":"从那次事故中康复成了他最艰难的历程之一。"},{"en":"Many startups have odysseys filled with failures, learning, and growth.","zh":"许多创业公司都有充满失败、学习与成长的曲折历程。"}]},{"partOfSpeech":"n.","definition":{"en":"the adventures related to Homer’s epic “The Odyssey” (sometimes used as a plural when talking about different retellings or versions).","zh":"与荷马史诗《奥德赛》相关的冒险故事（有时用复数指不同改写或版本中的“奥德赛故事”）。"},"examples":[{"en":"The course compared modern retellings of Homer’s odysseys.","zh":"这门课比较了荷马《奥德赛》故事在现代的不同改写版本。"}]}],"synonyms":["journeys","travels","voyages","adventures","quests","expeditions"],"phonetic":"/ˈɑdɪsi/","extraExplanation":["“odyssey”来自古希腊史诗《奥德赛》（The Odyssey），讲的是英雄奥德修斯（Odysseus）在特洛伊战争后历经多年才回到家乡的旅程。","英语里常把“odyssey”引申为“漫长、艰难、充满考验的过程”，不一定真的在旅行，也可以指求学、康复、创业等人生阶段。","常见搭配：go on an odyssey（踏上漫长旅程）；a personal odyssey（个人的心路历程）；an epic odyssey（史诗般的历程）。"]}
{"word":"odz","summary":{"en":"ODZ is usually an initialism; the meaning depends on context.","zh":"ODZ 通常是首字母缩写；含义需根据语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"ODZ is not a standard English word; it is usually used as an initialism (letters read one by one). Its exact meaning depends on the field or context (e.g., a company name, a project code, or online shorthand).","zh":"ODZ 不是常见的英语单词；通常作为首字母缩写（逐个字母读）。具体含义取决于领域或语境（例如公司名、项目代号或网络简写）。"},"examples":[{"en":"I saw “ODZ” in the document, but it wasn’t defined—what does ODZ stand for?","zh":"我在文件里看到“ODZ”，但没有解释——ODZ 是什么的缩写？"},{"en":"ODZ appears to be a code name here, not an English vocabulary word.","zh":"这里的 ODZ 看起来像是代号，而不是英语词汇。"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/oʊ diː ziː/","extraExplanation":["在英语里，像 ODZ 这种大写字母组合通常是“initialism”（逐字母念，比如 /oʊ diː ziː/）或“acronym”（当作一个词来念）。要准确释义，最好提供它出现的句子、领域（如游戏/医学/工程/聊天软件）或全称线索。"]}
{"word":"odzookers","summary":{"en":"“odzookers” isn’t a standard English word; it’s probably a misspelling (often of “zookeepers”).","zh":"“odzookers”不是标准英语词；多半是拼写错误（常见目标词是“zookeepers”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a made-up form. In many contexts, people actually mean “zookeepers” (people who take care of animals in a zoo) or “zookers” (very rare/nonstandard).","zh":"不是标准英语单词；更可能是拼写错误或临时造词。很多语境里人们其实想写的是“zookeepers”（动物园饲养员）或“zookers”（非常少见/不规范用法）。"},"examples":[{"en":"I can’t find “odzookers” in a dictionary—did you mean “zookeepers”?","zh":"我在词典里找不到“odzookers”——你是不是想写“zookeepers”？"},{"en":"The zookeepers fed the giraffes at noon.","zh":"动物园饲养员在中午喂长颈鹿。"}]}],"synonyms":["zookeepers (likely intended)","zoo staff","animal keeper"],"phonetic":"/ɑdˈzuːkərz/","extraExplanation":["如果你能提供“odzookers”出现的句子或上下文（聊天、游戏、小说、作业等），我可以更准确判断它到底想表达什么。","有时这类词可能来自打字输入错误（例如多按了 o/d）、自动纠错失败，或是某个社群/作品里的内部梗。把原句贴出来最有效。"]}
{"word":"odzooks","summary":{"en":"“odzooks” is an old-fashioned exclamation showing surprise or annoyance.","zh":"“odzooks”是一个古老的感叹词，用来表达惊讶或恼火。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Archaic) Used to express surprise, annoyance, or strong emotion; similar to “goodness!” or “wow!”","zh":"（古语）表示惊讶、恼火或强烈情绪的感叹词；类似于“天哪！”“哇！”"},"examples":[{"en":"Odzooks! I didn’t expect to see you here.","zh":"Odzooks！我没想到会在这里见到你。"},{"en":"Odzooks, that noise nearly scared me to death!","zh":"Odzooks，那声音差点把我吓死！"}]}],"synonyms":["goodness!","wow!","good grief!","oh my!","for heaven’s sake!"],"phonetic":"/ɑdˈzʊks/","extraExplanation":["“odzooks”是早期英语里的一种委婉誓言（minced oath），用来避免直接提到上帝的名字。它通常被认为源自类似“God’s hooks”（与宗教中对耶稣受难刑具的联想相关）的变体或谐音表达。","在莎士比亚及其同时代戏剧/文学中，常见各种“od-”开头的感叹（如“od’s body / ’sblood”等），用于表现人物情绪、阶层口吻或喜剧效果。现代英语里几乎不用，多见于古典作品、历史题材或仿古幽默。"]}

