{"word":"oe","summary":{"en":"“OE” most commonly means “original equipment,” and it can also mean “Old English.” In casual texting, “oe” may be used like “oh.”","zh":"“OE”最常见意思是“原厂（original equipment）”，也可指“古英语（Old English）”。在随意聊天中，“oe”有时可当作“oh（哦）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) original equipment; made by the same company that produced the parts used in a product when it was first built.","zh":"（缩写）原厂配件／原装设备；指由最初为某产品提供零部件的同一厂家生产的配件或设备。"},"examples":[{"en":"I bought OE brake pads to match the car’s original performance.","zh":"我买了原厂刹车片，以匹配汽车的原始性能。"},{"en":"These OE parts cost more, but they usually fit better.","zh":"这些原厂件更贵，但通常更合适。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Old English; the earliest recorded form of the English language (about AD 450–1150).","zh":"（缩写）古英语；英语最早的文字记载阶段（约公元450—1150年）。"},"examples":[{"en":"In OE, the word for “house” was “hūs.”","zh":"在古英语里，“house（房子）”对应的词是“hūs”。"},{"en":"She studies OE poetry like Beowulf.","zh":"她学习《贝奥武夫》这类古英语诗歌。"}]},{"partOfSpeech":"int.","definition":{"en":"(texting) a quick way to show surprise, similar to “oh.”","zh":"（聊天用语）表示惊讶的简写，类似“oh（哦）”。"},"examples":[{"en":"oe I didn’t know you were here!","zh":"哦（oe）我不知道你在这儿！"},{"en":"oe… that plot twist was crazy.","zh":"哦（oe）……那个剧情反转太离谱了。"}]}],"synonyms":["OEM (related)","original parts (for the first meaning)"],"phonetic":"/ˌoʊˈiː/","extraExplanation":["“OE”最常见于汽车/电子等领域，表示“原厂（original equipment）”。在语言学或文学课上，“OE”常指“古英语（Old English）”。","作为聊天简写“oe”并不如“oh/omg”普遍，更多是个人习惯或小圈子用法；正式写作里建议用“oh”。"]}
{"word":"oecanthus","summary":{"en":"Oecanthus is the scientific genus name for tree crickets.","zh":"Oecanthus 是“树蟋属”的学名（属名），指一类树栖、常会鸣叫的蟋蟀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, usually pale-green or yellowish crickets known as tree crickets, common in North America and other regions; some species are noted for their clear, musical chirping.","zh":"树蟋属（一类体型较小、常呈浅绿色或黄绿色的蟋蟀；多栖息在灌木与树木上，有些物种以清亮的鸣叫声著称）。"},"examples":[{"en":"The biologist identified the insect as Oecanthus, a type of tree cricket.","zh":"生物学家把这只昆虫鉴定为树蟋属（Oecanthus）的一种。"},{"en":"On summer nights, Oecanthus species often chirp from shrubs near gardens.","zh":"夏夜里，树蟋属的物种常在花园附近的灌木丛中鸣叫。"}]}],"synonyms":["tree cricket","Oecanthus spp."],"phonetic":"/oʊˈkænθəs/","extraExplanation":["“Oecanthus”是昆虫学里常见的拉丁学名（属名），写作首字母大写并用斜体（Oecanthus）；单独提到属名时可不加“the”。","日常英语里更常用“tree cricket（树蟋）”来指这类昆虫；在科学写作中则常写成“Oecanthus spp.”表示树蟋属的多个物种。"]}
{"word":"OECD","summary":{"en":"OECD is an international organization that helps countries cooperate on economic and social policies and publishes widely used statistics and reports.","zh":"OECD（经合组织）是促进各国在经济与社会政策上合作的国际组织，并发布广泛使用的统计数据与报告。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The Organisation for Economic Co-operation and Development: an international organization in which mostly high-income countries work together on policies and research about the economy, education, taxation, trade, and social issues.","zh":"经济合作与发展组织：一个以较多高收入国家为主的国际组织，合作进行政策协调与研究，涵盖经济、教育、税收、贸易与社会议题等。"},"examples":[{"en":"The OECD released a report on global education outcomes.","zh":"经合组织发布了一份关于全球教育成果的报告。"},{"en":"Many governments use OECD data to compare tax policies.","zh":"许多政府会用经合组织的数据来比较税收政策。"}]}],"synonyms":["Organisation for Economic Co-operation and Development"],"phonetic":"/ˌoʊ iː siː ˈdiː/","extraExplanation":["“OECD”是缩写，完整名称为 Organisation for Economic Co-operation and Development（英式拼写 Organisation；美式常见 Organization）。","常见搭配：OECD countries（经合组织国家/成员国）、OECD report（经合组织报告）、OECD data/statistics（经合组织数据/统计）。","在新闻和学术写作里，常用“the OECD”指该组织本身；也可作定语，如“OECD guidelines”（经合组织指南）。"]}
{"word":"oeci","summary":{"en":"OECI usually refers to the Organisation of European Cancer Institutes.","zh":"OECI 通常指“欧洲癌症研究所/癌症中心组织联盟”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym most commonly used for the Organisation of European Cancer Institutes (a network that connects and accredits major cancer centers in Europe).","zh":"一个缩写，最常见指 Organisation of European Cancer Institutes（欧洲癌症研究所/癌症中心组织联盟，连接并认证欧洲主要癌症中心的网络）。"},"examples":[{"en":"The hospital joined OECI to improve its cancer-care standards.","zh":"这家医院加入了 OECI，以提升其肿瘤诊疗标准。"},{"en":"OECI accreditation is often mentioned in reports about European cancer centers.","zh":"在关于欧洲癌症中心的报告中，经常会提到 OECI 认证。"}]}],"synonyms":["Organisation of European Cancer Institutes","OECI network"],"phonetic":"/ˌoʊ iː siː aɪ/","extraExplanation":["“OECI”在日常英语里不是常见词，通常出现在医学、科研或欧洲医疗机构相关语境中。","如果你指的是别的含义（比如某个课程、公司名、游戏ID或打字错误），告诉我你看到它的句子或领域（医学/学校/网络等），我可以按那个语境解释。"]}
{"word":"oecist","summary":{"en":"An oecist is the founder or appointed leader of a new colony, especially in ancient Greece.","zh":"oecist 指新殖民地（尤指古希腊殖民城邦）的创建者或被任命的领袖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the founder or leader of a colony (especially in ancient Greece); a colonizer who organizes a new settlement","zh":"殖民地的建立者或领袖（尤指古希腊的“殖民城邦”创建者）；组织建立新定居点的人"},"examples":[{"en":"In ancient Greece, an oecist was chosen to lead settlers to a new colony.","zh":"在古希腊，常会选出一位 oecist 带领移民去建立新的殖民地。"},{"en":"The city honored its oecist with public ceremonies and monuments.","zh":"这座城市会用公共仪式和纪念碑来纪念它的 oecist。"}]}],"synonyms":["oikist","founder","colonizer"],"phonetic":"/ˈiːsɪst/","extraExplanation":["oecist 是较少见的拼写变体，更常见的形式是 oikist（源自希腊语 oikistēs，意为“殖民地创建者/奠基者”）。在古希腊殖民活动中，oecist 往往不仅是“带队的人”，也具有宗教与政治象征意义：新城邦常把他当作创立者来崇敬。"]}
{"word":"oecodomic","summary":{"en":"“Oeconomic” is a rare, old spelling of “economic.” Your “oecodomic” likely meant this.","zh":"“oeconomic”是“economic（经济的）”的旧式拼写；你输入的“oecodomic”很可能是拼写错误。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"An uncommon or archaic spelling of “economic,” meaning related to the economy, money, trade, or the management of resources.","zh":"“economic（经济的）”的罕见或古旧拼写，指与经济、金钱、贸易或资源管理有关。"},"examples":[{"en":"The book discusses the oeconomic conditions of 18th-century Europe.","zh":"这本书讨论了18世纪欧洲的经济状况。"},{"en":"He wrote about oeconomic policy in an old-fashioned style.","zh":"他用较古典的文风写到了经济政策。"}]}],"synonyms":["economic","financial","monetary"],"phonetic":"/ˌiːkəˈnɑːmɪk/","extraExplanation":["你输入的 “oecodomic” 很可能是想写 “oeconomic”。“oeconomic” 是 “economic” 的旧式拼写（常见于较早的英式写法或古文献中），其中 “oe” 后来多简化为 “e”（如 oeconomy → economy）。现代英语里通常不用 “oeconomic”，更常见的是 “economic”。","如果你原本想表达“生态经济/生态的经济学”相关概念，现代更常用的词是 “ecological” 或 “eco-economic / ecoeconomics”（写法视语境而定）。"]}
{"word":"oecodomical","summary":{"en":"Economical means saving money/resources (not wasteful) and can also mean concise in language.","zh":"economical 表示“节约、不浪费/划算”，也可指“用词简练”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using money, time, or resources carefully; not wasteful; good value for the cost.","zh":"节约的；省钱的；不浪费的；性价比高的。"},"examples":[{"en":"Buying in bulk can be more economical for a big family.","zh":"对大家庭来说，批量购买可能更经济。"},{"en":"She chose an economical car that uses little gas.","zh":"她选了一辆省油的经济型汽车。"},{"en":"It’s more economical to repair the phone than to replace it.","zh":"修手机比换新更划算。"}]},{"partOfSpeech":"adj.","definition":{"en":"(About language or writing) Expressing ideas with few words; concise and efficient.","zh":"（语言/写作）简练的；用词精当的。"},"examples":[{"en":"His writing style is economical and easy to understand.","zh":"他的写作风格简练，容易理解。"},{"en":"Try to be economical with words in a resume.","zh":"写简历时尽量用词精炼。"}]}],"synonyms":["thrifty","cost-effective","efficient","frugal","concise"],"phonetic":"/ˌiːkəˈnɑːmɪkəl/","extraExplanation":["你写的 **oecodomical** 很可能是拼写错误，常见目标词是 **economical**。也有一种较古老/较少见的拼法 **oeconomical**（英式旧拼写），其中 **oe-** 是古典拼写习惯，现代英语通常简化为 **e-**。","注意区分：**economical**=“省钱/不浪费”；**economic**=“经济（学）的/与经济有关的”（例如 economic growth 经济增长）。"]}
{"word":"oecoid","summary":{"en":"Oecoid is a rare adjective meaning ecological (related to habitat) or, very rarely, house-like/domestic.","zh":"oecoid 是一个罕见形容词，常指“生态的/与生境有关的”，更罕见时可指“像家的/家庭的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to ecology or an organism’s habitat; ecological.","zh":"（罕见）与生态或生境有关的；生态的。"},"examples":[{"en":"Some older scientific writing uses oecoid to mean ecological.","zh":"一些较早的科学文献会用 oecoid 来表示“生态的”。"},{"en":"They discussed oecoid factors such as food, shelter, and climate.","zh":"他们讨论了食物、庇护所和气候等生态因素。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) House-like; domestic; resembling a home.","zh":"（非常罕见）像房子的；家庭的；带有“居所/家”的特征的。"},"examples":[{"en":"The painting gives the wild landscape an almost oecoid comfort.","zh":"这幅画让荒野景色带上了一种近乎“家的”安定感。"}]}],"synonyms":["ecological","environmental","domestic"],"phonetic":"/ˈiːkɔɪd/","extraExplanation":["oecoid 由希腊语词根 oikos（“家、居所”）发展而来，前缀 oeco- 是早期或学术场合对 eco- 的一种拼写形式；后缀 -oid 表示“像……一样”。因此它字面意思是“像家/与家有关的”，在某些旧文献中也会引申为“与生态环境有关的”。","这个词在现代英语中很少用；写作时更常见、更自然的选择通常是 ecological（生态的）或 domestic（家庭的）。"]}
{"word":"oecological","summary":{"en":"“Oecological” is an older/rare spelling of “ecological,” meaning related to ecology or the natural environment.","zh":"“oecological”是“ecological”的较旧/少见拼写，意思是“生态的、与生态学/自然环境有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to ecology (the relationships between living things and their environment).","zh":"生态的；与生态学有关的（指生物与环境之间的关系）。"},"examples":[{"en":"Protecting wetlands is important for ecological (oecological) balance.","zh":"保护湿地对维持生态（oecological）平衡很重要。"},{"en":"The company promised to reduce its ecological impact.","zh":"这家公司承诺减少其生态影响。"}]}],"synonyms":["ecological","environmental"],"phonetic":"/ˌiːkəˈlɑːdʒɪkəl/","extraExplanation":["“oecological”是“ecological”的较旧/较少见拼写（多见于较早期英式用法或学术文献），其中“oe-”来自希腊语词根的转写传统。现代英语中更常用“ecological”。","学习与写作建议：日常写作、考试和大多数现代出版物请优先使用“ecological”；除非在引用原文或特定文本风格中才保留“oecological”。"]}
{"word":"oecologies","summary":{"en":"“Oecologies” is a rare/older spelling of “ecologies,” meaning ecological systems or the field of ecology (plural).","zh":"“oecologies” 是 “ecologies” 的较旧/少见拼写，表示“生态系统（复数）”或“生态学（复数用法）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oecology: the study of how living things relate to each other and to their environment; also, different ecological systems or relationships.","zh":"oecology 的复数：生态学；也可指不同的生态系统或生态关系。"},"examples":[{"en":"In older British writing, you may see “oecologies” where modern texts use “ecologies.”","zh":"在较早的英式写作中，你可能会看到 oecologies，而现代文本通常写 ecologies。"},{"en":"The book compares the oecologies of deserts and rainforests.","zh":"这本书比较了沙漠与雨林的生态系统。"}]}],"synonyms":["ecologies","ecosystems (often similar in meaning, but not always identical)"],"phonetic":"/iˈkɑlədʒiz/","extraExplanation":["“oecology / oecologies” 是 “ecology / ecologies” 的较旧或较少见拼写（多见于早期英式学术写作）。现代英语里几乎总是用 “ecology”。","拼写里的 “oe-” 受早期借词习惯影响（类似 “oestrogen” 对应美式常见 “estrogen”），但发音通常与 “ecology” 相同。"]}
{"word":"oecology","summary":{"en":"Oecology is an older/less common spelling of ecology: the study of organisms and their environment.","zh":"Oecology 是 ecology 的较旧/较少见拼写，意思是“生态学”，研究生物与环境的关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Older or chiefly British spelling) the study of how living things interact with each other and with their environment; ecology.","zh":"（较旧或主要见于英式拼写）生态学：研究生物彼此之间以及与环境之间相互作用的学科；同 ecology。"},"examples":[{"en":"She studied oecology at university, focusing on wetlands.","zh":"她在大学学习 oecology（生态学），研究重点是湿地。"},{"en":"The book introduces basic ideas in oecology, such as food chains and habitats.","zh":"这本书介绍了 oecology（生态学）的基本概念，例如食物链和栖息地。"}]}],"synonyms":["ecology"],"phonetic":"/iˈkɑlədʒi/","extraExplanation":["“oecology”源自希腊语词根 oikos（家、居所）+ -logy（学科/研究）。现代英语中更常用拼写是“ecology”；“oecology”多出现在较早期文献、部分英式学术写作或书名中。阅读时把它当作“ecology”即可。"]}
{"word":"oeconomic","summary":{"en":"Oeconomic is an archaic spelling of economic; it can also mean household management in older literature.","zh":"oeconomic 是 economic 的古旧拼写；在较早期文学中也可指“持家/家政管理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic spelling) relating to the economy, money, jobs, and the system of producing and using goods and services.","zh":"（古旧拼写）与经济有关的；涉及金钱、就业以及商品与服务的生产和使用体系的。"},"examples":[{"en":"The report discussed the oeconomic effects of the new tax law.","zh":"这份报告讨论了新税法带来的经济影响。"},{"en":"They studied oeconomic change in early industrial cities.","zh":"他们研究了早期工业城市中的经济变迁。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Older, literary) relating to the management of a household; thrifty and well-organized in the use of resources.","zh":"（较早期、文学用法）与家务/家庭管理有关的；在资源使用上节俭而有条理的。"},"examples":[{"en":"She was praised for her oeconomic running of the household.","zh":"她因把家里打理得井井有条、又很节俭而受到称赞。"},{"en":"Good oeconomic habits helped the family save during hard times.","zh":"良好的持家习惯帮助这家人在艰难时期存下钱。"}]}],"synonyms":["economic","financial","fiscal","thrifty","frugal"],"phonetic":"/ˌiːkəˈnɑːmɪk/","extraExplanation":["“oeconomic”是“economic”的旧式拼写，常见于18—19世纪文本；现代英语几乎都写作“economic”。","词源可追溯到希腊语 oikos（家、家庭）+ nomos（管理、规则），因此早期含义常与“持家、家政管理”有关，后来意义扩展为“国民经济/经济体系”。","阅读古文献时，遇到“oeconomic/oeconomy”通常可直接按现代的“economic/economy”理解。"]}
{"word":"oeconomus","summary":{"en":"An archaic word meaning a steward or financial/property manager, often in a religious institution.","zh":"古义词，指管家或财产/财务管理人，常见于宗教机构语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A steward or manager, especially an official who manages property or finances (often in a church, monastery, or other institution).","zh":"（古义）管家；财务/产业管理人，尤指教会、修道院等机构中负责财产或财务的官员。"},"examples":[{"en":"The monastery appointed an oeconomus to oversee its lands and accounts.","zh":"修道院任命了一位 oeconomus 来管理土地和账目。"},{"en":"In older church records, the oeconomus handled practical financial matters.","zh":"在较早的教会档案中，oeconomus 负责处理实际的财务事务。"}]}],"synonyms":["steward","treasurer","bursar","manager","administrator"],"phonetic":"/iˈkɑnəməs/","extraExplanation":["这个词常见于较旧的宗教或历史文献中，现代英语里多用拼写更常见的 **economus**，或直接用 **steward / treasurer / bursar** 等词来表达。","词源可追溯到希腊语 **oikonomos**（管理家务/家产的人），与 **economy**（经济）同源；拼写中的 **oe-** 是一种较古典/拉丁化的写法。"]}
{"word":"oecoparasite","summary":{"en":"An oecoparasite is an organism that uses a host mainly as a place to live rather than for nutrition.","zh":"oecoparasite 指主要把宿主当作栖身处而非营养来源的寄生生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organism that lives on or in another organism mainly to use it as shelter or a place to live, rather than to take nutrients from it (or only minimally).","zh":"一种寄生生物，主要把宿主当作栖身处/居住环境，而不是（或几乎不）从宿主获取营养。"},"examples":[{"en":"Some mites are considered oecoparasites because they use the host’s body mainly as a living space.","zh":"有些螨类被认为是栖居寄生者，因为它们主要把宿主的身体当作生活空间。"},{"en":"An oecoparasite may harm the host by irritating tissue even if it doesn’t feed much on the host.","zh":"即使栖居寄生者不怎么取食宿主，它也可能因刺激组织而伤害宿主。"}]}],"synonyms":["inquiline (related)","commensal (sometimes related, depending on context)"],"phonetic":"/ˌiːkoʊˈpærəsaɪt/","extraExplanation":["词源上可拆为 oeco-（来自希腊语 oikos，意为“家、居所”，也常见于 ecology“生态学”）+ parasite（寄生生物）。因此重点在“把宿主当作住处”。","与常见的 parasite 一词相比，oecoparasite 更强调“栖居/占用空间”的关系；在一些教材或论文里也会用“inquiline（栖居者）”等相关概念来讨论类似现象。"]}
{"word":"oecoparasitism","summary":{"en":"Oecoparasitism is parasitism where an organism lives in a host’s nest or home and benefits from it.","zh":"Oecoparasitism 指寄生者住进宿主的巢穴/居所并从中获益的一种寄生方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ecology) a form of parasitism in which an organism lives in another species’ home (such as a nest, burrow, or colony) and benefits from the shelter or resources there, often at the host’s expense.","zh":"（生态学）一种寄生方式：某种生物住进另一物种的“家”（如巢穴、洞穴或群体/巢群）中，利用其庇护或资源，通常会损害宿主。"},"examples":[{"en":"Some beetle larvae show oecoparasitism by developing inside ant nests and using the colony’s resources.","zh":"一些甲虫幼虫会表现出“居所寄生”，在蚂蚁巢中发育并利用蚁群的资源。"},{"en":"Researchers compared oecoparasitism with other host–parasite relationships like brood parasitism.","zh":"研究人员将居所寄生与育雏寄生等其他宿主—寄生关系进行了比较。"}]}],"synonyms":["nest parasitism","inquilinism","social parasitism"],"phonetic":"/ˌiːkoʊˈpærəˌsɪtɪzəm/","extraExplanation":["词源提示：“oeco-”来自希腊语 oikos（“家、居所”），与 ecology（生态学）同源；因此这个词字面意思就是“住在别人的家里进行寄生”。","在昆虫学与社会性昆虫研究中较常见：寄生者常利用宿主的巢穴环境、食物储存或照料行为；与“直接寄生在宿主体内/体表”不同，它强调的是“占用居所/巢群”的生活方式。"]}
{"word":"oecophobia","summary":{"en":"Oecophobia means a fear of home; more rarely, it can mean dislike of one’s own culture or country.","zh":"oecophobia 指对“家”的恐惧；较少见时也可指对本国/本文化的反感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal fear of one’s home or of being in one’s home environment.","zh":"对“家”或待在家中环境的非理性恐惧。"},"examples":[{"en":"After the break-in, she developed oecophobia and felt unsafe even at home.","zh":"入室盗窃之后，她出现了“恐家症”，甚至在家里也觉得不安全。"},{"en":"Therapy helped him manage his oecophobia so he could stay in his apartment again.","zh":"治疗帮助他控制对家的恐惧，让他能再次住回公寓。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, political/cultural use) A strong dislike of one’s own country, culture, or traditions—often contrasted with admiration for foreign cultures.","zh":"（较少见，政治/文化语境）对本国、本民族文化或传统的强烈反感，常与对外来文化的推崇形成对比。"},"examples":[{"en":"Some commentators use “oecophobia” to describe a tendency to criticize one’s own culture more harshly than others.","zh":"有些评论者用“oecophobia”来形容一种倾向：对自身文化的批评比对他者更苛刻。"},{"en":"The author argued that oecophobia can distort debates about national identity.","zh":"作者认为，“oecophobia”可能会扭曲有关国家认同的讨论。"}]}],"synonyms":["oikophobia","domophobia","xenophilia (in the political/cultural contrast sense)"],"phonetic":"/ˌiːkoʊˈfoʊbiə/","extraExplanation":["词源：来自希腊语 oikos（家、家庭）+ -phobia（恐惧）。拼写上也常见变体 oikophobia（更常用）。","在临床/心理语境里，它通常指“对家或家中环境的恐惧”。在公共讨论中，英国哲学家 Roger Scruton 等人曾用它指“对自身文化/国家的反感”，但这种用法带有立场色彩，使用时需要注意语境与中立性。"]}
{"word":"oecumenian","summary":{"en":"“Oecumenian” is a rare adjective meaning “universal/worldwide” or “ecumenical (church unity),” and is usually replaced by “ecumenical.”","zh":"“oecumenian”是很少见的形容词，意为“世界性的/普遍的”或“（教会）合一的”，现代英语通常用“ecumenical”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the whole inhabited world; universal in scope (a rare form, often replaced by “ecumenical”).","zh":"（罕见用法）与整个有人居住的世界有关的；普遍的、世界性的（常用“ecumenical”代替）。"},"examples":[{"en":"The writer imagined an oecumenian culture that would connect people across continents.","zh":"这位作家设想一种世界性的文化，能把不同大洲的人联系起来。"},{"en":"Her research takes an oecumenian view of human migration over thousands of years.","zh":"她的研究以世界性的视角考察数千年来的人类迁徙。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to ecumenism—efforts to promote unity and cooperation, especially among Christian churches (rare; “ecumenical” is standard).","zh":"（罕见用法）与“大公合一/普世合一运动”有关——促进团结与合作，尤指基督教各教会之间（标准用法是“ecumenical”）。"},"examples":[{"en":"They attended an oecumenian service with leaders from several churches.","zh":"他们参加了一场由多个教会领袖共同参与的普世合一礼拜。"},{"en":"The group’s oecumenian goals focused on dialogue rather than debate.","zh":"该团体的合一目标重在对话，而不是争辩。"}]}],"synonyms":["ecumenical","universal","worldwide","global","catholic (in the sense of ‘universal’)"],"phonetic":"/iˌkjuːˈmiːniən/","extraExplanation":["“oecumenian”非常少见，很多情况下是“ecumenian / ecumenical”的旧拼写或变体拼写。现代英语里更常用的是：ecumenical（形容词）和 ecumenism（名词）。","词根来自希腊语 oikoumenē，原意是“有人居住的世界/天下”，后来在宗教语境里引申为“普世性的、（教会）合一的”。","如果你是在学术文章或古旧文本里看到它，通常可按“ecumenical”的意思理解；写作时建议用更常见的拼写以避免读者困惑。"]}
{"word":"oecumenic","summary":{"en":"Oecumenic is a less common spelling of ecumenic/ecumenical, meaning “promoting unity among Christian denominations,” and more broadly “universal; worldwide.”","zh":"oecumenic 是 ecumenic/ecumenical 的较少见拼写，常指“推动基督教不同教派合一的”，也可泛指“普世的、全球性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of the Christian Church) promoting unity and cooperation among different denominations; relating to the ecumenical movement.","zh":"（指基督教教会）推动不同教派之间的合一与合作；与“普世教会合一运动”有关的。"},"examples":[{"en":"The conference invited Catholic, Protestant, and Orthodox leaders for an oecumenic dialogue.","zh":"这次会议邀请了天主教、新教和东正教的领袖进行普世合一对话。"},{"en":"They planned an oecumenic service to pray for peace together.","zh":"他们计划举行一场普世合一礼拜，一同为和平祈祷。"}]},{"partOfSpeech":"adj.","definition":{"en":"more generally: worldwide in scope; universal.","zh":"更广义：范围遍及全球的；普遍的。"},"examples":[{"en":"The museum aimed for an oecumenic collection representing many cultures.","zh":"这家博物馆希望建立一个具有全球视野、代表多种文化的馆藏。"}]}],"synonyms":["ecumenic","ecumenical","interdenominational","universal","worldwide"],"phonetic":"/ˌɛkjəˈmɛnɪk/","extraExplanation":["“oecumenic”是“ecumenic / ecumenical”的较少见拼写，常见于较旧的用法或偏英式/古典化的拼写习惯；现代日常英语里更常写作“ecumenical”。","词源来自希腊语 oikoumenē，原意是“有人居住的世界”，因此既能发展出“普世的/全球的”含义，也常用于基督教语境中指“教会合一”。","在文学或正式宗教写作里，你可能会看到相关表达如“ecumenical council（大公会议/普世会议）”，指具有广泛代表性的教会会议。"]}
{"word":"oecumenical","summary":{"en":"Oecumenical (also spelled ecumenical) means promoting unity among Christian churches, and more broadly, inclusive or universal.","zh":"oecumenical（也作 ecumenical）指促进基督教各教会合一；广义上也指包容的、普遍的、世界性的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Promoting cooperation or unity among different Christian churches or traditions.","zh":"（基督教）旨在促进不同教会/宗派之间合作与合一的；普世教会合一的。"},"examples":[{"en":"The city hosted an ecumenical service where leaders from several churches prayed together.","zh":"这座城市举办了一场普世合一礼拜，来自多个教会的领袖一起祷告。"},{"en":"She works with an ecumenical group that organizes inter-church charity projects.","zh":"她与一个普世合一团体合作，组织跨教会的慈善项目。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally: broad, inclusive, or intended for people with different views or backgrounds; universal.","zh":"更广义：包容的、面向不同观点/背景的人群的；普遍的、世界性的。"},"examples":[{"en":"The conference aims for an ecumenical approach, welcoming researchers from many disciplines.","zh":"这场会议力求采取包容性的方式，欢迎来自多个学科的研究者。"},{"en":"His reading tastes were ecumenical, ranging from poetry to science writing.","zh":"他的阅读口味很广泛，从诗歌到科普写作都有涉猎。"}]}],"synonyms":["ecumenical","interchurch","nonsectarian","inclusive","universal"],"phonetic":"/ˌiːkjəˈmɛnɪkəl/","extraExplanation":["“oecumenical”是“ecumenical”的较古老/较学术的拼写形式，常见于英式拼写或宗教、历史语境；现代日常英语更常用“ecumenical”。","词源来自希腊语 *oikoumenē*（“有人居住的世界”），因此既可指“普世/世界范围”，也发展出宗教语境中“各教会合一”的含义。","常见搭配：ecumenical movement（普世合一运动）、ecumenical council（大公会议/普世会议，如早期基督教的“大公会议”）。"]}
{"word":"oecumenicalism","summary":{"en":"Oecumenicalism (more commonly spelled ecumenicalism) is the movement for unity and cooperation among Christian churches.","zh":"Oecumenicalism（更常见拼写为 ecumenicalism）指推动基督教不同教会与宗派合一与合作的大公运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the movement or idea of promoting unity and cooperation among different Christian churches and traditions","zh":"（基督教）大公运动；促进不同教会与宗派合一与合作的思想或运动"},"examples":[{"en":"Ecumenicalism encourages different Christian denominations to work together on shared concerns.","zh":"大公运动鼓励不同基督教宗派在共同关心的议题上合作。"},{"en":"The council issued a statement supporting ecumenicalism and inter-church dialogue.","zh":"该会议发表声明支持大公运动与教会间对话。"}]}],"synonyms":["ecumenicalism","church unity movement","interdenominational cooperation"],"phonetic":"/ˌiːkjuˈmɛnɪkəˌlɪzəm/","extraExplanation":["“oecumenicalism”是“ecumenicalism”的较旧或较少见拼写（多见于英式或历史文献）；现代英语里更常用“ecumenicalism”。","词根来自希腊语 *oikoumenē*，原意是“有人居住的世界”，后来在宗教语境中引申为“普世的／大公的”。","在宗教研究中，“ecumenical”常指基督教宗派之间的合一与合作；不要与“interfaith”（跨宗教，如基督教与伊斯兰教、佛教之间的对话）混淆。"]}
{"word":"oecumenicity","summary":{"en":"Oecumenicity means an ecumenical spirit—especially encouraging cooperation and unity among different Christian churches.","zh":"oecumenicity 指“普世合一精神”，尤指促进不同基督教教会之间合作与团结的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or spirit of being ecumenical—promoting understanding and cooperation among different Christian churches (and sometimes, more broadly, being inclusive across faiths or groups).","zh":"普世合一精神；（尤指）促进不同基督教教会之间的理解与合作的态度（有时也可泛指跨宗教或跨群体的包容性）。"},"examples":[{"en":"The council was praised for its oecumenicity, bringing Catholic and Protestant leaders into the same discussion.","zh":"该会议因其普世合一精神而受到称赞，使天主教与新教领袖能够同席讨论。"},{"en":"Her writing shows oecumenicity: it treats different traditions with respect rather than competition.","zh":"她的写作体现出普世合一精神：以尊重而非竞争的方式看待不同传统。"}]}],"synonyms":["ecumenicity","ecumenism","interdenominational cooperation","inclusiveness"],"phonetic":"/iˌkjuːməˈnɪsəti/","extraExplanation":["“oecumenicity”是较少见的拼写形式，更常见的是“ecumenicity”。两者意义相同。","词源可追溯到希腊语 *oikoumenē*（意为“有人居住的世界”），后来在宗教语境中引申为“普世的、全基督教会的”。在现代英语里，它常用于宗教对话、教会合一（church unity）与跨宗派合作等话题。"]}
{"word":"oecus","summary":{"en":"Oecus means a grand reception/dining hall in an ancient Greek or Roman house.","zh":"Oecus 指古希腊或古罗马住宅中用于宴饮与会客的宽敞大厅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large reception or dining room in an ancient Greek or Roman house, especially a grand hall used for entertaining guests.","zh":"（古希腊或古罗马住宅中的）会客厅/宴会厅；用于招待宾客的宽敞大厅。"},"examples":[{"en":"The archaeologists identified the mosaic-floored oecus as the villa’s main reception hall.","zh":"考古学家把那间铺有马赛克地面的 oecus 判定为别墅的主要会客大厅。"},{"en":"In wealthy Roman homes, dinners for important visitors might be held in the oecus.","zh":"在富裕的罗马家庭里，招待重要来客的宴席可能会在 oecus 举行。"}]}],"synonyms":["reception hall","banqueting hall","great hall"],"phonetic":"/ˈiːkəs/","extraExplanation":["该词源自拉丁语 *oecus*，更早可追溯到希腊语 *oikos*（“家、家庭”）。在罗马建筑语境中，*oecus* 常被用来指一类较正式、尺度更大的厅堂空间，常见于豪宅或别墅，用于宴饮与社交。古罗马建筑作家维特鲁威（Vitruvius）在讨论住宅与厅堂类型时也会提及这一术语。由于属于古典建筑/考古领域词汇，现代英语中多出现在博物馆解说、考古报告或古建筑研究文章里。"]}
{"word":"OED","summary":{"en":"OED = Oxford English Dictionary, famous for word history and dated citations.","zh":"OED =《牛津英语词典》，以词语历史与带年代引文著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Oxford English Dictionary; a major historical dictionary that explains English words with meanings, usage over time, and dated quotations.","zh":"《牛津英语词典》（Oxford English Dictionary）；一部重要的历史性英语词典，解释词义、用法演变，并提供带年代的引文。"},"examples":[{"en":"According to the OED, this word first appeared in the 1600s.","zh":"根据 OED 的记载，这个词最早出现在 17 世纪。"},{"en":"If you want the history of a word, the OED is a great place to look.","zh":"如果你想了解一个词的历史，OED 是很好的查询来源。"}]}],"synonyms":["Oxford English Dictionary"],"phonetic":"/oʊ.iː.diː/","extraExplanation":["OED 通常指《牛津英语词典》，以“词源、历时演变、引文证据”著称；它不只是给出现代常用释义，还会展示词义如何随着时间变化。","日常写作里引用 OED，多见于学术或严谨的语言讨论；在一般学习场景中，人们也常用更简明的学习型词典（如 Oxford Learner’s Dictionaries）来查当前常用义和例句。"]}
{"word":"oedema","summary":{"en":"Oedema is swelling caused by fluid buildup in body tissues; in medicine it can also mean fluid in the lungs (pulmonary oedema).","zh":"oedema 指因体液潴留导致的组织肿胀；医学上也可指肺部积液引起的肺水肿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Swelling caused by too much fluid trapped in the body’s tissues (often seen in the feet, ankles, legs, or around the eyes).","zh":"水肿：由于体液在组织间隙潴留过多而引起的肿胀（常见于脚踝、腿部或眼周）。"},"examples":[{"en":"After the long flight, she noticed oedema in her ankles.","zh":"长途飞行后，她发现自己的脚踝出现了水肿。"},{"en":"The doctor checked for oedema by pressing gently on his lower leg.","zh":"医生通过轻按他的小腿来检查是否有水肿。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical) The abnormal buildup of fluid in the lungs (pulmonary oedema), which can make breathing difficult.","zh":"（医学）肺水肿：液体异常积聚在肺部，可能导致呼吸困难。"},"examples":[{"en":"Pulmonary oedema can cause shortness of breath, especially when lying down.","zh":"肺水肿可能引起气短，尤其是在平躺时更明显。"},{"en":"They treated the patient quickly because pulmonary oedema can be life-threatening.","zh":"他们迅速治疗这位患者，因为肺水肿可能危及生命。"}]}],"synonyms":["swelling","fluid retention","edema"],"phonetic":"/ɪˈdiːmə/","extraExplanation":["英式拼写是 oedema；美式拼写更常见的是 edema。两者意思相同，只是拼写不同。","词源来自希腊语 oidēma（“肿胀”）。在医学语境里常与具体部位连用，如 ankle oedema（踝部水肿）、pulmonary oedema（肺水肿）。","日常英语中更常说 swelling；oedema/edema 更偏医学或正式用语。"]}
{"word":"oedemas","summary":{"en":"Oedemas = plural of oedema, meaning medical swelling from fluid buildup in tissues.","zh":"oedemas 是 oedema 的复数，指因组织液体积聚造成的医学意义上的水肿/浮肿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oedema: swelling caused by extra fluid trapped in the body’s tissues (a medical term).","zh":"oedema（组织水肿/浮肿）的复数：由于体液在组织间积聚而引起的肿胀（医学用语）。"},"examples":[{"en":"The nurse checked the patient’s legs for oedemas.","zh":"护士检查了病人腿部是否有水肿。"},{"en":"Heart or kidney problems can cause oedemas in the ankles.","zh":"心脏或肾脏问题可能导致脚踝水肿。"}]}],"synonyms":["edemas","swelling","fluid retention"],"phonetic":"/ɪˈdiːməz/","extraExplanation":["“oedema”是英式拼写；美式更常写作“edema”。在日常英语里，人们也常用更口语的说法“swelling”（肿胀/肿起来）。","这是医学术语，常见搭配有“ankle/leg oedema”（脚踝/腿部水肿）、“pulmonary oedema”（肺水肿）。如果在医疗沟通中看到复数“oedemas”，通常指不同部位或不同类型的水肿。"]}
{"word":"oedemata","summary":{"en":"Oedemata = plural of oedema/edema (medical swelling from fluid in tissues).","zh":"oedemata＝oedema/edema（水肿）的复数，指因组织液体积聚导致的肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) The plural of oedema/edema: swellings caused by too much fluid trapped in body tissues.","zh":"（医学）oedema/edema（水肿）的复数：由于体液在组织间隙过多积聚而造成的肿胀。"},"examples":[{"en":"The doctor noted oedemata in both ankles after the long flight.","zh":"医生发现他长途飞行后两侧脚踝都有水肿。"},{"en":"In severe cases, oedemata may appear in the legs and around the eyes.","zh":"在严重情况下，水肿可能出现在腿部以及眼周。"}]}],"synonyms":["edemas","edema","swelling"],"phonetic":"/əˈdiːmətə/","extraExplanation":["“oedemata”是源自希腊语的复数形式（-ma 的复数常为 -mata），在现代英文里更常见的写法是美式英语“edemas”（或不可数用法的“edema”）。英式拼写通常写作“oedema / oedemas”。","在医学写作中，你也会看到把“edema”当作不可数名词使用（例如：There is edema in the lungs. 肺部有水肿），不一定用复数。"]}
{"word":"oedematous","summary":{"en":"Oedematous means swollen due to fluid buildup in tissues (medical term).","zh":"oedematous 指“由于组织液体积聚而水肿、肿胀的”（医学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Swollen because of a buildup of fluid (edema) in the body’s tissues.","zh":"因组织内液体积聚（水肿）而肿胀的。"},"examples":[{"en":"The doctor noted an oedematous ankle after the injury.","zh":"医生注意到受伤后脚踝出现水肿性肿胀。"},{"en":"Her legs became oedematous during late pregnancy.","zh":"她在孕晚期腿部出现水肿性肿胀。"},{"en":"The skin looked shiny and oedematous around the wound.","zh":"伤口周围的皮肤看起来发亮并呈水肿性肿胀。"}]}],"synonyms":["swollen","edematous","puffy"],"phonetic":"/ɪˈdiːməˌtəs/","extraExplanation":["英式拼写为 oedematous，美式拼写更常见为 edematous。","来自医学术语 edema（水肿），含义是“体液在组织间隙异常堆积”。在日常英语里不太常用，多见于病历、体检报告、医学科普。","相关常见搭配：oedematous tissue（水肿组织）、oedematous swelling（水肿性肿胀）、pitting oedema（凹陷性水肿：按压后会留下凹痕）。"]}
{"word":"oedemerid","summary":{"en":"“Oedemerid” isn’t a recognized English word; it likely refers to “edematous/oedematous” (swollen with fluid) or “edema/oedema” (swelling).","zh":"“oedemerid”不是常见或标准英语词；很可能是指“edematous/oedematous”（水肿的）或“edema/oedema”（水肿）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “oedematous/edematous” (swollen with fluid) or “oedema/edema” (swelling caused by fluid).","zh":"不是标准英语单词。很可能是把 “oedematous/edematous”（水肿的、因体液而肿胀的）或 “oedema/edema”（水肿）拼错了。"},"examples":[{"en":"The patient had oedematous ankles after standing all day.","zh":"病人站了一整天后脚踝出现了水肿（肿胀）。"},{"en":"Edema can cause swelling in the legs, feet, or hands.","zh":"水肿会导致腿部、脚或手部肿胀。"}]}],"synonyms":["swollen","puffy","bloated"],"phonetic":"/iˈdiːmətəs/","extraExplanation":["“oedema / oedematous”是英式拼法；美式更常写作“edema / edematous”。发音基本相同。","如果你能提供看到这个词的句子或图片（例如医学报告/文章片段），我可以更准确判断它原本想写的词。"]}
{"word":"oedemeridae","summary":{"en":"Oedemeridae is a beetle family known as the false blister beetles, often slender flower-visiting beetles.","zh":"Oedemeridae 指假泡甲科（假起泡甲虫），常见为细长、访花的甲虫类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of beetles commonly called false blister beetles; many are slender, soft-bodied, and often found on flowers (some species can irritate skin).","zh":"一种甲虫科，常称“假泡甲科”或“假起泡甲虫”；多为细长、体软的甲虫，常见于花上（部分种类可能刺激皮肤）。"},"examples":[{"en":"Researchers recorded several Oedemeridae species visiting wildflowers in early summer.","zh":"研究人员记录到初夏有多种假泡甲科（Oedemeridae）昆虫访花。"},{"en":"That long, soft beetle on the daisy may be an Oedemeridae.","zh":"雏菊上那只细长、体软的甲虫可能属于假泡甲科（Oedemeridae）。"}]}],"synonyms":["false blister beetles","oedemerids"],"phonetic":"/ˌiːdəˈmɛrɪdiː/","extraExplanation":["“Oedemeridae”是昆虫分类学中的科名，常见英文俗名是“false blister beetles（假起泡甲虫）”，因为外形或某些特征与“blister beetles（芫菁科）”有相似之处，但分类上并不相同。","词源来自希腊语词根，常见解释与“肿胀/浮肿”有关（某些种类雄虫后腿股节膨大是辨识特征之一）；科名复数形式常用于泛指整个类群。","在科普或论文写作中，常见用法是“family Oedemeridae（假泡甲科）”；单数个体通常写作“an oedemerid（假泡甲科甲虫的一种）”。"]}
{"word":"oedicnemine","summary":{"en":"A rare scientific word meaning a stone-curlew (thick-knee) or a member of that bird group.","zh":"一个很少见的科学用语，指石鸻/厚膝鸻（stone-curlew/thick-knee）或该类群的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stone-curlew (a long-legged, ground-dwelling bird) or a member of the stone-curlew group in scientific classification","zh":"（科学分类用语）石鸻/厚膝鸻（stone-curlew，一类长腿、常在地面活动的鸟）或指石鸻类群的成员"},"examples":[{"en":"In some older bird lists, an oedicnemine refers to a stone-curlew.","zh":"在一些较早的鸟类名录里，oedicnemine 用来指石鸻（stone-curlew）。"},{"en":"The researchers compared nesting behavior across oedicnemines in dry grasslands.","zh":"研究人员比较了干旱草原中不同石鸻类群（oedicnemines）的筑巢行为。"}]}],"synonyms":["stone-curlew","thick-knee","Burhinidae (family name)"],"phonetic":"/oʊˌiːdɪkˈniːmaɪn/","extraExplanation":["这是一个非常少见、偏“动物学/鸟类学”的词形，常见于学术或旧式分类写法里。你输入的 **oedicnemine** 可能是指 **Oedicneminae/Oedicnemus**（与 stone-curlew/厚膝鸻相关的分类名）。","词源上与希腊语有关：**oid-**（肿胀）+ **knēmē**（小腿/胫），与“腿部显得粗壮/膝部厚”的外观特征相关。","如果你想查的是更常用的英文名，通常写 **stone-curlew**（英式常用）或 **thick-knee**（描述性名称）。"]}
{"word":"oedicnemus","summary":{"en":"Oedicnemus is an older genus name for stone-curlews (thick-knees), largely replaced by Burhinus in modern classification.","zh":"Oedicnemus 是石鸻（厚膝鸻）的旧属名，现代多改归 Burhinus。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for stone-curlews (also called thick-knees), now generally classified under the genus Burhinus.","zh":"（旧）石鸻（又称“粗膝鸻 / 厚膝鸻”）的一个属名；现多已归入 Burhinus 属。"},"examples":[{"en":"In older bird guides, the Eurasian Stone-curlew may be listed under Oedicnemus.","zh":"在较早的鸟类图鉴里，欧亚石鸻可能会被列在 Oedicnemus 之下。"},{"en":"Modern taxonomy usually places these birds in the genus Burhinus rather than Oedicnemus.","zh":"现代分类学通常把这些鸟归入 Burhinus 属，而不是 Oedicnemus。"}]}],"synonyms":["stone-curlew","thick-knee","Burhinus"],"phonetic":"/ˌiːdɪkˈniːməs/","extraExplanation":["这是一个拉丁化的学名（属名），常见于旧文献或较早的分类系统中；现在更常用的属名是 Burhinus。","词源来自希腊语：oidēma（肿胀）+ knēmē（小腿/胫），指这类鸟看起来“腿部粗壮、膝关节突出”，因此英文俗名之一是 thick-knee（厚膝鸻）。"]}
{"word":"oedipal","summary":{"en":"Oedipal means connected to Oedipus (a tragic father–son–mother story) or, in psychology, connected to the Oedipus complex.","zh":"oedipal 指与“俄狄浦斯”神话相关的（弑父娶母的悲剧），或在心理学中指与“俄狄浦斯情结”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Greek myth of Oedipus, especially the story in which he unknowingly kills his father and marries his mother.","zh":"与希腊神话人物俄狄浦斯有关的，尤指他在不知情下弑父并娶母的故事。"},"examples":[{"en":"The play explores an Oedipal tragedy of fate and identity.","zh":"这部戏剧探讨了一种关于命运与身份的俄狄浦斯式悲剧。"},{"en":"The novel uses an Oedipal plot: a son confronts the truth about his family.","zh":"这部小说使用了俄狄浦斯式情节：儿子直面自己家庭的真相。"}]},{"partOfSpeech":"adj.","definition":{"en":"In psychology (especially Freudian psychoanalysis), relating to the Oedipus complex: a child's unconscious desire for the opposite-sex parent and rivalry with the same-sex parent.","zh":"在心理学（尤指弗洛伊德精神分析）中，指“俄狄浦斯情结”：儿童对异性父母的无意识欲望，以及对同性父母的竞争/敌意。"},"examples":[{"en":"The therapist warned against forcing an Oedipal interpretation onto every family conflict.","zh":"治疗师提醒，不要把每一种家庭冲突都硬套成俄狄浦斯式的解释。"},{"en":"Some critics read the character’s anger at his father as Oedipal.","zh":"一些评论家把这个角色对父亲的愤怒解读为俄狄浦斯式的。"}]}],"synonyms":["Freudian","psychoanalytic","Oedipus-related"],"phonetic":"/ˈɛdɪpəl/","extraExplanation":["“Oedipal”来自希腊神话中的Oedipus（俄狄浦斯）。最经典的文学版本见于古希腊悲剧作家索福克勒斯（Sophocles）的《俄狄浦斯王》（Oedipus Rex）。","在日常英语里，oedipal 常用来形容“像俄狄浦斯故事那样的家庭纠葛/命运悲剧”，或在心理学语境中指与“俄狄浦斯情结”相关的解读。使用时要注意语境：在普通对话中它带有强烈的文学/心理学色彩，容易显得很“学术”或带评判意味。"]}
{"word":"oedipally","summary":{"en":"“Oedipally” means “in a way related to the Oedipus complex.”","zh":"“oedipally”表示“以与俄狄浦斯情结相关的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the Oedipus complex (a psychological idea about a child’s unconscious attraction to their mother and rivalry with their father).","zh":"以与“俄狄浦斯情结”相关的方式（心理学概念：指孩子对母亲的无意识依恋/吸引，以及对父亲的竞争或敌意）。"},"examples":[{"en":"The critic argued that the hero’s anger is driven oedipally by jealousy of his father.","zh":"评论家认为，主人公的愤怒在“俄狄浦斯式”意义上源于对父亲的嫉妒。"},{"en":"He joked that he felt oedipally protective of his mother.","zh":"他开玩笑说自己对母亲有一种“俄狄浦斯式”的保护欲。"}]}],"synonyms":["in an Oedipal way","psychosexually"],"phonetic":"/ˌiːdɪˈpæli/","extraExplanation":["“oedipally”来自希腊神话人物俄狄浦斯（Oedipus）：他在不知情的情况下弑父并娶母。精神分析学家弗洛伊德借用这一故事提出“Oedipus complex/俄狄浦斯情结”。在现代英语中，这个副词多用于心理分析、文学批评或带一点讽刺/幽默的表达。","拼写上也常见变体：Oedipally / Oedipally（英式有时写作 oedipally），但含义相同。"]}
{"word":"oedipean","summary":{"en":"Oedipean means “related to Oedipus” (tragic themes of fate and family) or, in psychology, “related to the Oedipus complex.”","zh":"Oedipean 指“与俄狄浦斯及其悲剧主题相关”，或在心理学中指“与俄狄浦斯情结相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Oedipus (the Greek mythic king) or to his story, especially the themes of fate, family conflict, and tragic self-discovery.","zh":"与俄狄浦斯（希腊神话中的国王）或其故事相关的，尤指命运、家庭冲突与悲剧性的自我认知等主题。"},"examples":[{"en":"The play has an Oedipean structure: the hero searches for the truth and is devastated by what he finds.","zh":"这部戏有一种“俄狄浦斯式”的结构：主角追寻真相，却被发现的结果击垮。"},{"en":"Her novel explores Oedipean themes of guilt and fate within a single family.","zh":"她的小说在一个家庭内部探讨了“俄狄浦斯式”的罪疚与命运主题。"}]},{"partOfSpeech":"adj.","definition":{"en":"In psychology (especially Freudian), relating to the Oedipus complex: a child’s conflicted feelings of desire for one parent and rivalry with the other.","zh":"在心理学（尤其是弗洛伊德理论）中，指与“俄狄浦斯情结”有关：儿童对一方父母产生爱欲/依恋，同时与另一方父母产生竞争与冲突的心理。"},"examples":[{"en":"The therapist avoided labeling the boy’s behavior as Oedipean too quickly.","zh":"治疗师避免过早把男孩的行为贴上“俄狄浦斯式/与俄狄浦斯情结有关”的标签。"},{"en":"Some critics read the film’s father-son conflict as partly Oedipean.","zh":"一些评论者认为这部电影的父子冲突带有一定“俄狄浦斯式”的意味。"}]}],"synonyms":["Oedipian","Freudian (in the psychology sense)"],"phonetic":"/ˌɛdɪˈpiːən/","extraExplanation":["“Oedipean”来自希腊悲剧人物 Oedipus（俄狄浦斯），最著名的版本见于索福克勒斯《俄狄浦斯王》（Oedipus Rex）。在英语文学评论里，Oedipean 常用来形容“追求真相却走向毁灭”的悲剧结构。","心理学用法主要与弗洛伊德提出的“Oedipus complex（俄狄浦斯情结）”相关；现代心理学与文化研究中对这一概念的范围与有效性有不同看法，因此在正式写作中常用更中性的表达或谨慎使用。","拼写上也常见变体“Oedipian”。在实际写作里，这两个形式通常意义相同。"]}
{"word":"Oedipus","summary":{"en":"Oedipus is a famous figure from Greek tragedy and myth; his story also gives its name to the psychological term “Oedipus complex.”","zh":"Oedipus（俄狄浦斯）是希腊神话与悲剧中的著名人物；他的故事也被借用来命名心理学术语“俄狄浦斯情结”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology and literature) A king of Thebes who unknowingly kills his father and marries his mother; the central figure in Sophocles’ tragedy “Oedipus Rex.”","zh":"（希腊神话与文学）底比斯国王俄狄浦斯：在不知情的情况下杀死父亲并与母亲结婚；索福克勒斯悲剧《俄狄浦斯王》的主角。"},"examples":[{"en":"In “Oedipus Rex,” Oedipus searches for the truth and discovers a terrible fate.","zh":"在《俄狄浦斯王》中，俄狄浦斯追寻真相，最终发现了可怕的命运。"},{"en":"Oedipus is often used as a symbol of tragic irony—trying to avoid destiny but fulfilling it.","zh":"“俄狄浦斯”常被用来象征“悲剧性反讽”——越想逃避命运，反而越走向命运。"}]},{"partOfSpeech":"n.","definition":{"en":"(Psychology, from Freud) Used in “Oedipus complex”: a child’s unconscious sexual attraction to the opposite-sex parent and rivalry with the same-sex parent.","zh":"（心理学，源自弗洛伊德）用于“俄狄浦斯情结”：指儿童对异性父母的潜意识性吸引，以及对同性父母的竞争/敌意。"},"examples":[{"en":"Freud named the Oedipus complex after the myth of Oedipus.","zh":"弗洛伊德以“俄狄浦斯”的神话来为“俄狄浦斯情结”命名。"},{"en":"Some modern psychologists use the term more carefully and not as a universal stage for everyone.","zh":"一些现代心理学家对这个术语使用更谨慎，并不把它视为人人都会经历的普遍阶段。"}]}],"synonyms":["Oedipus Rex","King Oedipus"],"phonetic":"/ˈiːdəpəs/","extraExplanation":["“Oedipus”常见读法为 EE-duh-pus（英美口语中也可能听到略有差异），中文常译“俄狄浦斯”。","文学背景：索福克勒斯的《俄狄浦斯王》属于古希腊悲剧，常被用来讨论“命运 vs. 自由意志”“真相与自我认知”等主题；其中的“dramatic irony（戏剧性反讽）”非常经典——观众早知道真相，而人物却不知道。","文化延伸：心理学中的“俄狄浦斯情结”是借用神话来做比喻，并不等同于神话情节本身；在当代语境中使用时要注意它带有理论立场与争议性。"]}
{"word":"oedipuses","summary":{"en":"“Oedipuses” means multiple Oedipus figures—either several characters named Oedipus or, figuratively, people who resemble the Oedipus myth/complex.","zh":"“Oedipuses”指多个“俄狄浦斯”：可以是多个名叫俄狄浦斯的角色，也可比喻指具有俄狄浦斯神话/情结特征的人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Oedipus: more than one person (real or fictional) named Oedipus, especially the tragic king in Greek myth.","zh":"Oedipus（俄狄浦斯）的复数：指不止一位名为俄狄浦斯的人（真实或虚构），尤指希腊神话中的悲剧国王。"},"examples":[{"en":"In a survey of ancient drama, the professor compared different Oedipuses on stage.","zh":"在一门古代戏剧概论课上，教授比较了舞台上不同版本的“俄狄浦斯”。"},{"en":"Modern retellings sometimes invent new Oedipuses to explore the same fate-driven story.","zh":"现代改写作品有时会创造新的“俄狄浦斯”角色，用来探讨同样的命运主题。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, figurative) people who resemble Oedipus in story or psychology—someone linked to the themes of the Oedipus myth (family secrets, fate, or the Oedipus complex).","zh":"（非正式/比喻）指在故事或心理特征上“像俄狄浦斯的人”：与俄狄浦斯神话主题相关的人（家族秘密、命运，或“恋母情结/俄狄浦斯情结”等）。"},"examples":[{"en":"The novel is full of Oedipuses—sons searching for the truth about their families.","zh":"这部小说里到处都是“俄狄浦斯式的人物”——儿子们追寻家族真相。"},{"en":"The critic called the hero “one of the many Oedipuses of modern literature.”","zh":"评论家称这位主人公是“现代文学中众多俄狄浦斯式人物之一”。"}]}],"synonyms":["Oedipi (less common)"],"phonetic":"/ˈɛdɪpəsɪz/","extraExplanation":["“Oedipus”来自希腊神话与索福克勒斯悲剧《俄狄浦斯王》（Oedipus Rex）。英语里专有名词变复数常加 -es（如 atlas→atlases），因此写作 Oedipuses（也常见拼写 Oedipi，用拉丁化复数，但在现代英语里不如 Oedipuses 常见）。","“Oedipus complex（俄狄浦斯情结）”源自弗洛伊德精神分析理论：指儿童对异性父母的依恋与对同性父母的竞争心理；把某些人物称为“an Oedipus / Oedipuses”时，常带有文学或心理学的比喻意味。","大小写提示：在指具体人物名时通常大写 Oedipus；若作为通用比喻用法，有时会见到小写 oedipus / oedipuses，但不算最标准。"]}
{"word":"oedogoniaceae","summary":{"en":"Oedogoniaceae = a family of freshwater green algae.","zh":"Oedogoniaceae＝淡水绿藻的一科（丝藻科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of freshwater green algae (in the order Oedogoniales), which includes the genus Oedogonium and related filamentous algae.","zh":"一种淡水绿藻的生物分类“科”（隶属丝藻目 Oedogoniales），包括丝藻属 Oedogonium 等相关的丝状藻类。"},"examples":[{"en":"Oedogoniaceae are often studied in freshwater ecology because they form long, thread-like filaments.","zh":"由于会形成细长的丝状体，丝藻科（Oedogoniaceae）常被淡水生态学研究。"},{"en":"Under a microscope, students may learn to recognize Oedogoniaceae by their filament structure and reproductive cells.","zh":"在显微镜下，学生可能会通过其丝状结构和生殖细胞来识别丝藻科（Oedogoniaceae）。"}]}],"synonyms":["Oedogonium family"],"phonetic":"/ˌiːdoʊɡoʊniˈeɪsiˌiː/","extraExplanation":["这是一个拉丁化的学名（科名），多用于生物学、分类学与学术写作中；日常英语里很少出现。","词尾 -aceae 表示“某某科”（植物、藻类、真菌等常见的分类层级）；理解这个词尾有助于读懂许多生物分类名称。","词源上与属名 Oedogonium 相关；阅读论文时常见写法为斜体属名（Oedogonium）+非斜体科名（Oedogoniaceae）。"]}
{"word":"oedogoniaceous","summary":{"en":"An academic adjective meaning “of or relating to the algae family Oedogoniaceae.”","zh":"学术用形容词，意为“与栉藻科（Oedogoniaceae）藻类有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the green-algae family Oedogoniaceae (or to organisms with similar features, especially the filamentous genus Oedogonium).","zh":"与“栉藻科（Oedogoniaceae）”有关的；指属于该科（或具类似特征的）绿藻，尤其是丝状绿藻属栉藻属（Oedogonium）。"},"examples":[{"en":"The sample contained several oedogoniaceous filaments attached to the submerged leaves.","zh":"样品中含有几段附着在沉水叶片上的栉藻科丝状藻体。"},{"en":"Under the microscope, the oedogoniaceous algae showed unbranched threads typical of Oedogonium.","zh":"在显微镜下，这些栉藻科绿藻呈现出典型的无分枝丝状结构，符合栉藻属的特征。"}]}],"synonyms":["Oedogoniaceae-related","oedogonian (less common)"],"phonetic":"/ˌiːdəˌɡoʊniˈeɪʃəs/","extraExplanation":["这是一个偏专业的生物学/藻类学形容词，常见于学术论文、鉴定报告或教材中，日常英语几乎不用。","词尾 -aceous 表示“……的、与……有关的”（如 herbaceous“草本的”）。该词来自属名 Oedogonium（栉藻属）与分类学后缀组合而成。"]}
{"word":"oedogoniales","summary":{"en":"Oedogoniales: an order of freshwater green algae (filamentous algae such as *Oedogonium*).","zh":"Oedogoniales：淡水丝状绿藻的一“目”（分类单位），如 *Oedogonium* 等类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific taxonomic order of freshwater green algae (class Chlorophyceae), including filamentous algae such as *Oedogonium*.","zh":"（生物）绿藻门/绿藻纲中的一个“目”（分类单位），多为淡水丝状绿藻，例如水绵属之一的 *Oedogonium*（鼓藻目相关类群）。"},"examples":[{"en":"Oedogoniales are often studied in freshwater ecology because they form filamentous mats.","zh":"在淡水生态学中，人们常研究 Oedogoniales，因为它们常形成丝状的藻类“藻毯”。"},{"en":"The lab identified the specimen as belonging to the order Oedogoniales.","zh":"实验室鉴定该标本属于 Oedogoniales 这一目。"}]}],"synonyms":["(no common everyday synonyms; related terms: *Oedogonium*, Chlorophyceae, green algae)"],"phonetic":"/ˌiːdoʊɡoʊˈnaɪəliːz/","extraExplanation":["这是拉丁化的生物分类名称，通常以复数形式出现（像“animals/primates”那样），指一个分类群而不强调单复数。","词形结构可理解为：Oedogoni-（来自属名 *Oedogonium*）+ -ales（生物分类中“目”的常见后缀，如 Rosales 蔷薇目）。","在英文论文或教材中，它通常首字母大写并斜体与否取决于排版规范（分类阶元名一般不斜体，但属、种名常斜体）。"]}
{"word":"oedogonium","summary":{"en":"Oedogonium is a genus of freshwater filamentous green algae, often studied for its clear reproductive structures.","zh":"Oedogonium（水绵属）是淡水中的丝状绿藻属，常因其明显的生殖结构而被研究与教学使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of filamentous green algae that lives mostly in freshwater and is known for producing large, easily observed reproductive cells (often used in biology classes to study algae reproduction).","zh":"（水绵属）一种丝状绿藻的属，多生活在淡水中；以产生较大、易观察的生殖细胞而著名（常用于生物学教学中观察藻类繁殖）。"},"examples":[{"en":"Under the microscope, the Oedogonium filaments looked like long green threads.","zh":"在显微镜下，水绵属（Oedogonium）的丝状体看起来像长长的绿色细线。"},{"en":"Our biology lab used Oedogonium to observe how some algae reproduce.","zh":"我们的生物实验用水绵属（Oedogonium）来观察一些藻类如何繁殖。"}]}],"synonyms":["green algae (general)","filamentous algae (general)"],"phonetic":"/ˌiːdoʊˈɡoʊniəm/","extraExplanation":["“Oedogonium”是拉丁化的学名（属名），常见于生物学/生态学语境；日常英语里不常用。","它属于绿藻门（Chlorophyta），多见于池塘、溪流等淡水环境，形成附着或漂浮的绿色丝状群体。","词源上可拆理解为：oedo-（与“肿胀/膨大”相关）+ -gonium（与“生殖/生殖器官”相关），反映其某些生殖结构较为显著、便于观察。"]}
{"word":"oeg","summary":{"en":"“OEG” is not a common English word; it’s usually an abbreviation whose meaning depends on context.","zh":"“OEG”不是常见英语单词；通常是缩写，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as an abbreviation (acronym/initialism), and its meaning depends on the specific field or context.","zh":"不是常见的英语单词；多见于缩写（首字母缩略词/首字母简写），具体含义取决于领域与上下文。"},"examples":[{"en":"I saw “OEG” in the report, but it wasn’t explained—what does it stand for?","zh":"我在报告里看到“OEG”，但没有解释——它代表什么？"},{"en":"In this document, OEG refers to a specific team name.","zh":"在这份文件里，OEG指的是一个特定的团队名称。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"oʊ iː dʒiː","extraExplanation":["“oeg / OEG”在英语里没有一个固定、通用的词典释义，最常见情况是某个机构、项目、课程、游戏战队或技术术语的缩写。你如果把它出现的句子或截图发我，我可以根据上下文帮你准确还原它的意思。","如果你本来想查的是别的单词（例如拼写接近的“egg”“OG”等），也告诉我目标词，我可以给你标准发音、词性和例句。"]}
{"word":"oeillade","summary":{"en":"Oeillade means a flirtatious, meaningful glance.","zh":"oeillade 指“带暗示意味的调情眼神／含情一瞥”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flirtatious or meaningful glance (often quick or playful), usually meant to show interest or attraction.","zh":"（常指快速、俏皮的）含情脉脉的一瞥／调情的眼神，通常用来表达兴趣或吸引。"},"examples":[{"en":"Across the room, he gave her an oeillade and then looked away with a smile.","zh":"隔着人群，他向她抛了个含情的一瞥，然后微笑着移开视线。"},{"en":"Her oeillade was subtle, but everyone noticed the chemistry.","zh":"她的眼神很含蓄，但大家都看出了两人之间的火花。"}]}],"synonyms":["flirtatious glance","knowing look","meaningful glance","come-hither look"],"phonetic":"/weɪˈjɑːd/","extraExplanation":["这是从法语借来的词（法语写作 œillade），来自 œil（“眼睛”）。在英语里属于较少见、偏文学或略带俏皮的用词，常用于描写带暗示意味的眼神交流。","在英文写作中，它往往带一点“轻佻/风流”的色彩，比普通的 glance（瞥一眼）更强调“调情或暗示”。如果想更日常，可以用 flirty look / knowing glance / wink（更直接）。"]}
{"word":"oeillades","summary":{"en":"Oeillades means flirtatious, expressive glances (a French plural used in English, often in literary style).","zh":"oeillades 指“含情/带暗示的眼神（法语复数借词，英语中多见于较文雅或文学语境）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural, from French) flirtatious or expressive glances—often quick, sideways looks meant to communicate interest or feeling without words.","zh":"（复数，源自法语）含情脉脉或带有暗示性的眼神/一瞥——常指快速、侧面的“用眼神传情”，不用说话也能表达兴趣或情绪。"},"examples":[{"en":"Across the room, they exchanged oeillades and smiled without speaking.","zh":"隔着房间，他们交换了几次含情的眼神，没说话却都笑了。"},{"en":"The actor’s oeillades made the scene feel playful rather than serious.","zh":"那位演员的眼神暗示让这场戏更俏皮，而不是严肃。"}]}],"synonyms":["flirtatious glances","meaningful looks","side glances","come-hither looks"],"phonetic":"/weɪˈjɑːd/","extraExplanation":["“oeillades”是法语名词“oeillade”的复数，意思与“glance / look”相近，但更强调带情绪或调情意味的“眼波”。在英语里多见于文学、评论或较文雅的语境。","拼写里的“œ”是法语常见的连字（ligature），在英文环境中有时会写作“oeillades”。读写时把它当作借用词即可，不必纠结法语发音细节。"]}
{"word":"oeillet","summary":{"en":"“Oeillet” is a rare French loanword meaning either a carnation or a small decorative eyelet hole in embroidery/lace.","zh":"“oeillet”是较少见的法语外来词，可指“康乃馨”，也可指蕾丝/刺绣中的“小孔眼（扣眼）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, from French) a carnation; a clove pink flower.","zh":"（罕见用法，源自法语）康乃馨；石竹属的一种花。"},"examples":[{"en":"She wore an oeillet (a carnation) on her lapel.","zh":"她在翻领上别了一朵 oeillet（康乃馨）。"},{"en":"The poem mentions an oeillet to suggest love and admiration.","zh":"诗里提到 oeillet，用来暗示爱意与敬佩。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a small embroidered eyelet or the little hole itself, used in lacework or decorative stitching.","zh":"（罕见用法）绣眼／扣眼；指蕾丝或装饰性针法里的小孔或其绣出的孔眼。"},"examples":[{"en":"The collar is finished with tiny oeillets along the edge.","zh":"领口边缘用一圈细小的 oeillets 收边。"},{"en":"Add an oeillet so you can thread a ribbon through the fabric.","zh":"加一个 oeillet，这样就能把丝带穿过布料。"}]}],"synonyms":["carnation","clove pink","eyelet","embroidered eyelet"],"phonetic":"/wəˈjɛ/","extraExplanation":["“oeillet”是法语词：在法语里最常见的意思是“康乃馨/石竹花”，也可指“（刺绣或皮革上的）孔眼/扣眼”。英语中它属于较少见的外来词，日常英语更常用 carnation（康乃馨）或 eyelet（孔眼/扣眼）。","在服装与手工领域，如果你看到复数形式“oeillets”，通常与蕾丝、刺绣或系带孔有关；在花卉语境中则多指康乃馨。"]}
{"word":"oekist","summary":{"en":"An oikist is the recognized founder of an ancient Greek colony.","zh":"oikist 指古希腊殖民地的公认创立者（建城者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) The official founder/leader sent out to establish a new colony; the colony’s recognized founder.","zh":"（古希腊）被派去建立新殖民地的正式“建城者/殖民地创立者”；也指该殖民地公认的奠基者。"},"examples":[{"en":"The oikist chose the site for the new settlement and organized the first laws.","zh":"这位建城者选定了新聚居点的地点，并组织制定了最初的法律。"},{"en":"In some cities, the oikist was honored with a hero cult after his death.","zh":"在一些城邦里，这位建城者去世后会被以英雄崇拜的方式纪念。"}]}],"synonyms":["founder","colonizer","settler-leader"],"phonetic":"/ˈɔɪkɪst/","extraExplanation":["你输入的“oekist”在英语中不太常见，更常见的拼写是 **oikist**（也可见到 **oecist** 这种较古旧/学术的拼写）。它来自希腊语，常用于古希腊殖民史、古典学或历史写作中。"]}
{"word":"oelet","summary":{"en":"“oelet” is not a standard English word; it is most likely a misspelling of “omelet.”","zh":"“oelet”不是标准英语单词；最可能是把“omelet（煎蛋卷）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) an omelet: a dish made from beaten eggs cooked in a pan, often folded around fillings such as cheese or vegetables.","zh":"（可能是拼写错误）omelet（煎蛋卷/蛋饼）：把鸡蛋打散后在平底锅里煎熟，常对折并夹入奶酪、蔬菜等馅料。"},"examples":[{"en":"I’ll have a cheese omelet for breakfast.","zh":"我早餐要一份奶酪煎蛋卷。"},{"en":"She made a vegetable omelet with tomatoes and spinach.","zh":"她做了一个番茄菠菜蔬菜煎蛋卷。"}]}],"synonyms":["omelet","omelette"],"phonetic":"/ˈɑməˌlɛt/","extraExplanation":["“oelet”在英语中不是常见单词；最常见的情况是把“omelet /ˈɑməˌlɛt/”拼错了。","“omelet”也常拼作“omelette”（更常见于英式英语）。两者意思相同。"]}
{"word":"oenanthaldehyde","summary":{"en":"Oenanthaldehyde is a chemical name for heptanal, a seven‑carbon aldehyde used in flavors and fragrances.","zh":"Oenanthaldehyde 是“庚醛（heptanal）”的别名，常用于香精香料与风味领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless liquid aldehyde (C7H14O), also called heptanal, used in flavors and fragrances and having a strong, oily or fatty odor when concentrated.","zh":"一种无色液体醛类化合物（C7H14O），又称“庚醛”，用于香精香料与风味配制；高浓度时常带有强烈的油脂/脂肪样气味。"},"examples":[{"en":"The perfumer used a trace amount of oenanthaldehyde to add a waxy, fatty nuance.","zh":"调香师用极微量的 oenanthaldehyde 来增加蜡质、脂肪感的气息层次。"},{"en":"In the lab, oenanthaldehyde is handled in a fume hood because its odor can be very strong.","zh":"在实验室里通常在通风橱中处理 oenanthaldehyde，因为它的气味可能非常强烈。"}]}],"synonyms":["heptanal","enanthaldehyde","oenanthic aldehyde"],"phonetic":"/oʊˌɛnænˈθældəˌhaɪd/","extraExplanation":["“oenanth- / enanth-”源自希腊语，历史上与“oenanthic acid（庚酸）”等名称有关；oenanthaldehyde（oenanthic aldehyde）对应的常用系统名是 heptanal（庚醛），表示含 7 个碳的直链醛。","在风味与香精行业里，这类“脂肪感/蜡质”气息的原料常用于构建柑橘、花香或皂感配方的底层质感，但通常用量很低，否则会显得刺鼻或油腻。"]}
{"word":"oenanthate","summary":{"en":"Oenanthate is an enanthic (heptanoic) acid ester/salt, often used to make long-acting (slow-release) medicines.","zh":"Oenanthate 指庚酸的酯或盐，常用于制成长效（缓释）药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that is the ester or salt of enanthic (heptanoic) acid, commonly used in medicine to make certain drugs long-acting (slow-release), such as some hormone injections","zh":"庚酸（又称“enanthic/heptanoic acid”）的酯或盐；在医药中常用于制成长效（缓释）制剂，例如一些激素注射剂"},"examples":[{"en":"Testosterone oenanthate is used as a long-acting injectable form of testosterone.","zh":"Testosterone oenanthate（睾酮庚酸酯）是一种长效注射型睾酮。"},{"en":"In some medications, an oenanthate ester helps the drug release slowly over time.","zh":"在一些药物中，oenanthate 酯能帮助药物随时间缓慢释放。"}]}],"synonyms":["enanthate","heptanoate"],"phonetic":"/oʊˈɛnənˌθeɪt/","extraExplanation":["“oenanthate”常见于药品名或成分名中，很多场景里也写作“enanthate”。两者通常指同一类“庚酸酯/庚酸盐”形式。","词根与希腊语有关：oenanth- 与“酒/葡萄酒（oen-）”相关，历史上用来指一种在酒中出现的香味成分（如 ethyl oenanthate）。现代医学里更常用来表示与庚酸（heptanoic acid）形成的酯，以延长药物作用时间。"]}
{"word":"oenanthe","summary":{"en":"Oenanthe is a scientific genus name used for wheatear birds and for water dropwort plants (some of which are poisonous).","zh":"Oenanthe 是一个学名属名，可指䳭（wheatear）属的鸟类，也可指水芹属植物（其中部分有毒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of birds (wheatears), small insect-eating songbirds found in Europe, Asia, and parts of Africa and North America","zh":"（鸟类）䳭（wheatear）属：一类体型较小、以昆虫为食的鸣禽，分布于欧洲、亚洲及非洲、北美部分地区"},"examples":[{"en":"The northern wheatear (Oenanthe oenanthe) is known for its long migrations.","zh":"北䳭（Oenanthe oenanthe）以长距离迁徙而闻名。"},{"en":"In older field guides, some wheatears are listed under the genus Oenanthe.","zh":"在较早的野外图鉴中，一些䳭被归在 Oenanthe 属下。"}]},{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the carrot family (Apiaceae), often called water dropwort; some species are poisonous","zh":"（植物）水芹属：伞形科的一属植物，常被称为“水芹/水毒芹”（water dropwort）；其中一些种类有毒"},"examples":[{"en":"Be careful with wild plants: some Oenanthe species look like edible herbs but are toxic.","zh":"采食野生植物要小心：有些水芹属（Oenanthe）外形像可食用香草，但其实有毒。"},{"en":"Water dropwort (Oenanthe) typically grows in wet ground such as ditches and stream edges.","zh":"水芹属（Oenanthe）常生长在沟渠、溪流边等潮湿地带。"}]}],"synonyms":["wheatear","water dropwort"],"phonetic":"/oʊˈɛnθi/","extraExplanation":["词源：来自希腊语 *oinos*（葡萄酒）+ *anthos*（花），大意是“酒色的花/葡萄酒般的花”。","注意：同一个学名 Oenanthe 同时用于鸟类（䳭属）和植物（水芹属），这是不同命名体系（动物学与植物学）各自独立造成的，并不表示它们有关联。","安全提示：水芹属中有些种类（例如毒性较强的水毒芹类）可能导致严重中毒；不建议在缺乏专业鉴定时采食。"]}
{"word":"oenanthic","summary":{"en":"Oenanthic means “wine-related,” especially “having a wine-like smell or taste,” and is mainly used in scientific or sensory contexts.","zh":"oenanthic 指“与葡萄酒有关的”，尤指“带有葡萄酒般气味或风味的”，多用于科学或感官描述语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to wine, especially describing a wine-like aroma or flavor (often used in chemistry or sensory description).","zh":"与葡萄酒有关的；尤指带有“酒香/酒味”的（常见于化学或感官描述中）。"},"examples":[{"en":"The lab report described the compound as having an oenanthic odor.","zh":"实验报告描述这种化合物带有葡萄酒般的气味。"},{"en":"Some esters can give an oenanthic note to the fragrance.","zh":"某些酯类会让香气呈现出类似酒香的气息。"}]}],"synonyms":["vinous","wine-like"],"phonetic":"/ˌiːnænˈθɪk/","extraExplanation":["词源上常被解释为来自希腊语：oinos（酒）+ anthos（花）。在较专业的语境里，你也可能看到与“oenanthic acid（葡萄酒酸/癸酸）”相关的用法，它与某些“酒香样”的气味描述有关。","该词非常书面且偏专业，日常英语里更常用 wine-like、vinous 来表达“像葡萄酒的/带酒香的”。"]}
{"word":"oenanthol","summary":{"en":"Oenanthol is another name for heptanal, a strong-smelling aldehyde used in fragrances and flavors.","zh":"oenanthol 是庚醛（heptanal）的别称，一种气味较强的醛类，常用于香精香料与食品风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless, oily liquid aldehyde (heptanal) with a strong odor, used in making perfumes, flavors, and other chemicals","zh":"一种无色油状的醛（庚醛），气味较强，常用于香精香料、食品风味及其他化学品的制造"},"examples":[{"en":"Oenanthol is used in perfumery to create green, fatty notes.","zh":"庚醛（oenanthol）常用于香水中，营造青绿、油脂样的香调。"},{"en":"In small amounts, oenanthol can contribute a fruity aroma in flavor formulations.","zh":"在少量添加时，庚醛（oenanthol）可在风味配方中带来一定的果香气息。"}]}],"synonyms":["heptanal","enanthaldehyde"],"phonetic":"/oʊˈɛnənθɔl/","extraExplanation":["“oenanthol”也常见作化学名“enanthaldehyde”，现代系统命名为“heptanal（庚醛）”。在学习资料中遇到这两个词，通常指同一种物质。","词根“oen-”与“wine（葡萄酒）”有关（源自希腊语 oinos），历史上与葡萄酒发酵/香气研究中的命名习惯有关，因此在香精香料语境里更常见。"]}
{"word":"oenanthole","summary":{"en":"Oenanthole is another name for heptanal, an aldehyde used for a fatty, green, wine-like odor in flavor and perfume work.","zh":"Oenanthole 是庚醛（heptanal）的别名，属于醛类化学物质，常用于香精香水以提供油脂感、青绿感、略似酒香的气味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless liquid chemical (an aldehyde) also called heptanal, used in flavors and perfumes for a fatty, green, wine-like smell.","zh":"一种无色液体醛类化学物质，也叫庚醛（heptanal），常用于香精与香水中，带有油脂感、青绿感、略似葡萄酒的气味。"},"examples":[{"en":"The perfumer added a trace of oenanthole to give the scent a green, fatty note.","zh":"调香师加入了一点点 oenanthole，让香气带出青绿、油脂感的气息。"},{"en":"In flavor chemistry, oenanthole (heptanal) can appear in small amounts in foods and aromas.","zh":"在风味化学中，oenanthole（庚醛）可能以微量出现在某些食物与香气中。"}]}],"synonyms":["heptanal","oenanthaldehyde"],"phonetic":"/oʊˈnænθoʊl/","extraExplanation":["词源上常与“oenanth-”相关（来自希腊语，和“葡萄酒/酒香”有关的构词），因此它的命名与气味联想有关，而不是表示它只存在于葡萄酒中。","在实际使用中，你更常见到的名称是 heptanal 或 oenanthaldehyde；oenanthole 属于较少见、偏历史/专业的叫法。"]}
{"word":"oenanthyl","summary":{"en":"Oenanthyl is a chemistry term meaning “related to oenanthic (heptanoic) acid” or “the oenanthyl group derived from it.”","zh":"Oenanthyl 是化学用语，指“与 oenanthic acid（庚酸）有关的”，或指由其衍生的 oenanthyl（基/基团）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to oenanthic acid (heptanoic acid) or the oenanthyl group derived from it.","zh":"（化学）与“庚酸 / oenanthic acid”有关的；或指由庚酸衍生的“庚酰基 / oenanthyl（基）”。"},"examples":[{"en":"In organic chemistry, oenanthyl compounds are derived from heptanoic (oenanthic) acid.","zh":"在有机化学中，oenanthyl 化合物来源于庚酸（oenanthic acid）。"},{"en":"The label mentioned an oenanthyl ester used for its fruity odor in perfumery.","zh":"标签上提到一种 oenanthyl 酯，在香水中因其果香气味而使用。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The oenanthyl group; an acyl/radical associated with oenanthic acid, used in naming certain organic compounds.","zh":"（化学）oenanthyl 基（庚酰基/与庚酸相关的酰基或基团），用于某些有机化合物的命名。"},"examples":[{"en":"The researcher introduced an oenanthyl group to change the molecule’s solubility.","zh":"研究人员引入 oenanthyl 基来改变分子的溶解性。"}]}],"synonyms":["heptanoyl (context-dependent)","heptyl (not always equivalent)"],"phonetic":"/oʊˈnænθɪl/","extraExplanation":["“oenanth-”常见于旧式化学命名，来自与葡萄酒气味相关的词源（与 *wine* 的概念有关）。历史上“oenanthic acid”因最早从葡萄酒蒸馏物中分离、带有酒香/果香而得名，因此 *oenanthyl* 多见于较传统或专业的化学语境。","现代命名里，这类物质更常直接用“heptanoic (acid)”（庚酸）及其衍生物来描述；阅读文献时可把 *oenanthyl* 近似理解为“与庚酸相关的（基团/衍生物）”。"]}
{"word":"oenanthylate","summary":{"en":"Oenanthylate means a heptanoate: a salt or ester derived from heptanoic (oenanthylic) acid.","zh":"oenanthylate 指“庚酸盐/庚酸酯”，即由庚酸（旧称 oenanthylic acid）形成的盐或酯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of oenanthylic acid (heptanoic acid); in other words, a compound containing the heptanoate group.","zh":"庚酸（又称“葡萄酒酸/香叶酸”旧称 oenanthylic acid）的盐或酯；也就是含有“庚酸根（heptanoate）”结构的一类化合物。"},"examples":[{"en":"Ethyl oenanthylate is used in flavor and fragrance work because it can have a fruity, wine-like note.","zh":"庚酸乙酯（ethyl oenanthylate）常用于香精香料中，因为它可能带有水果、类似葡萄酒的气味特征。"},{"en":"In the lab, an oenanthylate ester can be made by reacting heptanoic acid with an alcohol.","zh":"在实验室里，庚酸的酯（oenanthylate ester）可以通过庚酸与醇反应制得。"}]}],"synonyms":["heptanoate","oenanthate"],"phonetic":"/oʊˈnænθəˌleɪt/","extraExplanation":["这个词属于化学命名用语，常见于配方、香精香料、材料或有机合成语境；日常英语中很少用。","词根 oenanth- 来自旧化学名称 oenanthylic acid（现多称 heptanoic acid, 庚酸）。早期命名与希腊语 oinos（葡萄酒）有关，因为某些相关化合物的气味与葡萄酒香气联想有关。","现代更常见、也更清晰的同义说法是 heptanoate（庚酸盐/庚酸酯）。"]}
{"word":"oenanthylic","summary":{"en":"An adjective used mainly in chemistry, meaning “related to oenanthylic (oenanthic) acid/heptanoic acid,” sometimes discussed in older writing about wine aroma.","zh":"主要用于化学领域的形容词，意为“与 oenanthylic（oenanthic）酸/庚酸有关”，在较早的葡萄酒香气讨论中偶尔出现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to oenanthylic (oenanthic) acid, a chemical (heptanoic acid) once identified in wine and associated with certain wine-like aromas.","zh":"与“oenanthylic（又作 oenanthic）酸”有关的；指一种化学物质（庚酸），曾在葡萄酒中被鉴定出来，并与某些类似酒香的气味有关。"},"examples":[{"en":"The lab report mentioned oenanthylic compounds as possible sources of the sample’s odor.","zh":"实验报告提到 oenanthylic 类化合物可能是样品气味的来源。"},{"en":"In older texts, oenanthylic acid is discussed in connection with wine aromas and esters.","zh":"在较早的文献中，oenanthylic 酸常与葡萄酒香气及酯类一起被讨论。"}]}],"synonyms":["oenanthic","heptanoic (acid-related)"],"phonetic":"/ˌiːnænˈθɪlɪk/","extraExplanation":["该词多见于化学/香精香料/葡萄酒风味的语境，属于比较“专业且偏旧”的用法。现代化学命名里更常直接写 heptanoic acid（庚酸），或谈其酯类（esters）对香气的影响。","词源上，oen- 来自希腊语 oinos（葡萄酒）。因此它常带有“与酒/酒香相关”的联想，但在实际使用中更偏向指特定化学物质及其衍生物。"]}
{"word":"oenin","summary":{"en":"Oenin is a technical word for a grape-and-red-wine pigment (an anthocyanin) that affects wine color.","zh":"Oenin 是一个偏专业的词，指葡萄与红葡萄酒中的一种色素（花青素），会影响酒的颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural purple-red pigment found in grape skins and red wine (a type of anthocyanin), contributing to the color of red wine","zh":"葡萄皮和红葡萄酒中的一种天然紫红色色素（属于花青素的一种），会影响红酒的颜色"},"examples":[{"en":"Scientists measured oenin to understand why the wine looked so deeply colored.","zh":"科学家测量了 oenin，以了解这款酒为什么颜色这么深。"},{"en":"Oenin levels can change during fermentation and aging.","zh":"oenin 的含量会在发酵和陈酿过程中发生变化。"}]}],"synonyms":["anthocyanin","wine pigment"],"phonetic":"/oʊˈɛnɪn/","extraExplanation":["oenin 是非常少见、偏专业的词，多用于葡萄酒化学/食品科学语境，日常英语里几乎不会用到。","词根与希腊语 oinos（“酒”）有关，所以常见于与葡萄酒相关的术语中。","如果你本来想查的是 opening（“开头/开幕/打开”），告诉我句子或语境，我可以按 opening 给你解释。"]}
{"word":"oeno","summary":{"en":"“oeno-” is a prefix meaning “wine,” used in formal or academic vocabulary about wine.","zh":"“oeno-”是表示“葡萄酒／酒”的前缀，多用于与葡萄酒相关的正式或学术词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix meaning “wine,” used in words related to wine (especially wine-making and wine study).","zh":"表示“葡萄酒／酒”的前缀，用于与葡萄酒相关的词（尤其是酿酒与葡萄酒研究）。"},"examples":[{"en":"Oenology is the study of wine and winemaking.","zh":"Oenology 指葡萄酒与酿酒学。"},{"en":"An oenophile is someone who loves wine.","zh":"Oenophile 指爱酒的人（葡萄酒爱好者）。"}]}],"synonyms":["wine-"],"phonetic":"/ˈiːnoʊ/","extraExplanation":["“oeno-”来自希腊语 oînos（酒、葡萄酒）。在美式英语里，这个前缀常出现在较正式或学术词汇中；日常英语更常直接用 wine-（如 wine tasting）。","常见相关词：oenology /iːˈnɑːlədʒi/（酿酒学）；oenophile /ˈiːnəˌfaɪl/（葡萄酒爱好者）；oenology 常见拼写变体：enology（省略 o）。"]}
{"word":"oenocarpus","summary":{"en":"Oenocarpus is a genus of tropical South American palms known for edible, useful fruits.","zh":"Oenocarpus 是一种南美热带棕榈属，以可食用、可利用的果实著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical South American palm trees whose fruits are used for food, oil, and drinks (for example, the species Oenocarpus bataua).","zh":"（植物学）一种棕榈科植物属，原产南美热带地区；其果实可用于食用、榨油或制作饮品（如：美洲棕榈 Oenocarpus bataua）。"},"examples":[{"en":"Oenocarpus palms are valued for their nutrient-rich fruits.","zh":"Oenocarpus 属的棕榈因其营养丰富的果实而受到重视。"},{"en":"In some regions, oil is extracted from Oenocarpus fruit for cooking.","zh":"在一些地区，人们会从 Oenocarpus 的果实中提取食用油。"}]}],"synonyms":["(botany) palm genus"],"phonetic":"/ˌiːnoʊˈkɑːrpəs/","extraExplanation":["词源上常被解释为来自希腊语：oinos（葡萄酒）+ karpos（果实），暗示其果实可发酵或可制成饮品的用途。","这是拉丁化的科学名称，通常首字母大写（Oenocarpus），用于生物分类学（属名）；日常英语中并不常见。"]}
{"word":"oenochoae","summary":{"en":"An ancient Greek wine jug used for pouring, often shown in museums and art-history contexts.","zh":"古希腊用于倒酒的酒壶，常见于博物馆与艺术史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of ancient Greek wine jug (a small pitcher), usually with one handle and a spout, used for pouring wine or other liquids.","zh":"（古希腊）酒壶；倒酒用的小壶（通常单把手、带壶嘴，用来倒酒或其他液体）。"},"examples":[{"en":"The museum displayed an oenochoe decorated with red-figure painting.","zh":"博物馆展出了一只饰有红绘图案的古希腊酒壶（oenochoe）。"},{"en":"In the banquet scene, a servant pours wine from an oenochoe into cups.","zh":"在宴饮场景中，仆人用酒壶（oenochoe）把酒倒进杯子里。"}]}],"synonyms":["wine jug","pitcher","ewer"],"phonetic":"/iːˈnɑːkəwi/","extraExplanation":["“oenochoe”源自古希腊语：oînos（酒）+ khéō（倒、倾注），字面意思是“倒酒的器具”。","复数形式常见为“oenochoae”（也可见“oenochoai”），多用于考古、艺术史和博物馆说明文字。","在古希腊的饮宴（symposium）文化中，这类壶常与酒杯、调酒用的大缸等器物一起出现，是研究古代日常生活与陶器绘画的重要线索。"]}
{"word":"oenochoe","summary":{"en":"An ancient Greek wine jug/pitcher, typically one-handled with a trefoil pouring mouth.","zh":"古希腊常见的倒酒用酒壶/酒罐，通常单把手、三叶形壶口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of ancient Greek (and later Roman) wine jug or pitcher, usually with one handle and a trefoil-shaped pouring mouth, often made of pottery or metal.","zh":"一种古希腊（后来也见于古罗马）的酒壶/酒罐，通常有一个把手，壶口常呈三叶形便于倾倒，多为陶制或金属制。"},"examples":[{"en":"The museum displayed an oenochoe decorated with scenes of a banquet.","zh":"博物馆展出了一只绘有宴饮场景的古希腊酒壶（oenochoe）。"},{"en":"Archaeologists found an oenochoe near the remains of a dining room.","zh":"考古学家在一处餐室遗址附近发现了一只酒壶（oenochoe）。"}]}],"synonyms":["wine jug","pitcher","ewer"],"phonetic":"/iˈnɑːkəwi/","extraExplanation":["词源来自希腊语：oinos（葡萄酒）+ cheein（倾倒）。因此它本质上就是“倒酒用的壶”。","oenochoe 常出现在古希腊陶器与艺术史的语境（如拍卖图录、博物馆说明、考古报告）。它不仅是器物名称，也常用于帮助判断遗址的饮食与社交活动（如宴饮 symposion）。"]}
{"word":"oenocyte","summary":{"en":"An oenocyte is a specialized insect cell important for lipid metabolism and making waxy substances for the cuticle.","zh":"oenocyte 指昆虫中的一种特殊细胞，常与脂类代谢及表皮蜡质/表皮烃的生成有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized cell in many insects (and some other arthropods) that helps with metabolism, especially making and processing fats and waxy substances for the insect’s outer covering","zh":"（昆虫及部分节肢动物的）成皮细胞/卵母细胞样细胞：一种特殊细胞，参与代谢，尤其与脂类和蜡质物质的合成与处理有关，帮助形成或维护昆虫体表的保护层"},"examples":[{"en":"In many insects, oenocytes are involved in lipid metabolism.","zh":"在许多昆虫中，成皮细胞参与脂类代谢。"},{"en":"Researchers studied oenocytes to understand how insects produce cuticular hydrocarbons.","zh":"研究人员通过研究成皮细胞来了解昆虫如何产生表皮烃。"}]}],"synonyms":["insect oenocyte","oenocytic cell"],"phonetic":"/ˈiːnəˌsaɪt/","extraExplanation":["词源提示：oenocyte 来自希腊语 oinos（酒）+ kytos（细胞）。早期在显微镜下观察时，这类细胞常呈“酒色/黄褐色”的外观，因此得名。","常见语境：该词多出现在昆虫生理学、发育生物学与分子生物学论文中。功能常与“表皮烃（cuticular hydrocarbons）”“蜕皮/表皮形成（cuticle formation）”“解毒与激素相关代谢”等主题一起讨论。","学习提示：读文献时常见复数 oenocytes（多个成皮细胞）。有时会看到相关形容词 oenocytic（成皮细胞的）。"]}
{"word":"oenocytic","summary":{"en":"“Oenocytic” means “related to oenocytes,” specialized metabolic cells found especially in insects.","zh":"“oenocytic”表示“与嗜酒细胞（oenocytes）有关”，这是一类尤其常见于昆虫的代谢相关特殊细胞。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to oenocytes—specialized cells (especially in insects) involved in metabolism, such as lipid processing and producing waxy substances for the cuticle.","zh":"与“嗜酒细胞/葡萄酒细胞（oenocytes）”有关的；指（尤指昆虫中）参与代谢的特殊细胞，例如脂类处理与产生表皮蜡质等。"},"examples":[{"en":"Researchers measured oenocytic activity to understand how insects regulate their cuticle lipids.","zh":"研究人员测量了嗜酒细胞相关的活性，以了解昆虫如何调控表皮脂类。"},{"en":"An oenocytic enzyme pathway may influence how an insect tolerates dry environments.","zh":"一种嗜酒细胞相关的酶通路可能会影响昆虫对干燥环境的耐受能力。"}]}],"synonyms":["oenocyte-related","oenocytical"],"phonetic":"/ˌiːnəˈsɪtɪk/","extraExplanation":["“oenocytic”来自名词“oenocyte”。“oen-”源自希腊语 oinos（酒/葡萄酒），早期显微观察时，这类细胞常含有在染色后呈“酒红色/葡萄酒色”的颗粒，因此得名。","在昆虫生理学与发育生物学论文中更常见：例如与蜕皮、表皮（cuticle）脂质/蜡层（wax layer）形成、解毒与激素调控等主题相关。"]}
{"word":"oenolic","summary":{"en":"Oenolic means “enolic”: relating to the enol form of a compound (C=C with an –OH) in organic chemistry.","zh":"oenolic 意为“烯醇式的（enolic）”：指与烯醇结构（C=C 并带 –OH）或烯醇/酮互变相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an enol (the form of a compound that has a carbon–carbon double bond and an –OH group), or showing enol/ketone tautomerism in organic chemistry.","zh":"（有机化学）与“烯醇式（enol）”有关的；指含有碳碳双键并连有 –OH 的结构，或表现出烯醇式/酮式互变异构的。"},"examples":[{"en":"In the oenolic form, the molecule has an –OH group attached to a carbon–carbon double bond.","zh":"在烯醇式（oenolic）形态中，分子的 –OH 会连在碳碳双键上。"},{"en":"The reaction proceeds through an oenolic intermediate before it returns to the keto form.","zh":"该反应会先经过一个烯醇式（oenolic）的中间体，然后再回到酮式。"}]}],"synonyms":["enolic"],"phonetic":"/iˈnɑlɪk/","extraExplanation":["“oenolic”基本等同于更常见的拼写“enolic”。其中“oe-”是一种较旧/较学术的拼写方式，来源于早期把“e”写作“oe（或连字 œ）”的传统；现代教材与论文里通常更常见“enol / enolic”。","“enol（烯醇）”这个词本身可理解为“ene（烯）+ ol（醇）”：既有双键（烯），又有羟基（醇）。"]}
{"word":"oenolin","summary":{"en":"Oenolin is a red-purple grape/wine pigment sometimes used as a coloring.","zh":"Oenolin 指红葡萄/红酒中的红紫色素，有时用作着色剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural red-purple pigment found in red grapes and red wine (an anthocyanin), sometimes extracted and used as a food coloring.","zh":"（红葡萄与红酒中的）天然红紫色素（花青素类），有时会被提取用作食用色素。"},"examples":[{"en":"Some producers use oenolin to enhance the red color of beverages.","zh":"有些生产商会用 oenolin 来加强饮料的红色外观。"},{"en":"Oenolin is associated with the deep hue of certain red wines.","zh":"oenolin 常与某些红酒的深色酒体有关。"}]}],"synonyms":["oenocyanin","wine pigment","anthocyanin (general category)"],"phonetic":"/iˈnɑlɪn/","extraExplanation":["“oenolin”里的前缀 oeno- 来自希腊语 oinos（葡萄酒），常见于与葡萄酒/酿酒相关的词（如 oenology“葡萄酒学/酿酒学”）。","在食品标签或添加剂语境中，你也可能看到近义或相关写法如 oenocyanin（葡萄酒红色素）。不同国家/标准对命名与分类可能略有差异。"]}
{"word":"oenological","summary":{"en":"Oenological means “connected with wine and the science of winemaking.”","zh":"oenological 意为“与葡萄酒及酿酒学（葡萄酒科学）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the study of wine and winemaking (grapes, fermentation, tasting, and wine science).","zh":"与葡萄酒及酿酒学有关的（包括葡萄、发酵、品鉴与葡萄酒科学等）。"},"examples":[{"en":"She took an oenological course to understand how different yeasts affect flavor.","zh":"她上了一门酿酒学课程，了解不同酵母如何影响风味。"},{"en":"The museum has an oenological exhibit about traditional fermentation methods.","zh":"这家博物馆有一个与酿酒学相关的展览，介绍传统发酵方法。"}]}],"synonyms":["enological","wine-related","winemaking","vinicultural (related, more formal)"],"phonetic":"/ˌiːnəˈlɑːdʒɪkəl/","extraExplanation":["“oenological”在英式拼写中也常见为“enological”。","词源来自希腊语“oinos”（葡萄酒）+ “-logy”（学科/研究），因此常用于学术或专业语境（如葡萄栽培、酿造工艺、品鉴训练、酒窖管理等）。","在日常交流中，人们更常说“wine-related”（与葡萄酒有关的）或直接用“winemaking / wine science”（酿酒/葡萄酒科学）来表达。"]}
{"word":"oenologies","summary":{"en":"Oenology (plural: oenologies) means the study and science of wine and winemaking; the plural can also refer to different winemaking traditions or systems.","zh":"Oenology（复数 oenologies）指葡萄酒与酿酒的科学研究；其复数也可指不同的酿酒传统或理论体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of wine and winemaking (also spelled “enology”)","zh":"葡萄酒学；酿酒学（也可拼作 enology）"},"examples":[{"en":"She studied oenology to learn how wine is made and evaluated.","zh":"她学习葡萄酒学，以了解葡萄酒如何酿造与评鉴。"},{"en":"The university offers courses in oenology and viticulture.","zh":"这所大学开设葡萄酒学与葡萄栽培学课程。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: oenologies) different approaches, traditions, or bodies of knowledge about winemaking","zh":"（复数：oenologies）不同的酿酒理论、传统或知识体系"},"examples":[{"en":"The book compares French and New World oenologies.","zh":"这本书比较了法国与新世界的不同酿酒体系。"}]}],"synonyms":["enology","wine science"],"phonetic":"/ˌiːˈnɑːlədʒi/","extraExplanation":["“oenology”源自希腊语 oinos（酒）+ -logy（学科）。拼写上，oe- 是较传统/英式的写法；在美式英语中常见简化拼写 “enology”。","相关词：viticulture（葡萄栽培学，偏“种葡萄”）；oenology/enology（偏“酿酒与品评/分析”）。"]}
{"word":"oenologist","summary":{"en":"An oenologist is a wine scientist or winemaking specialist.","zh":"oenologist 指研究葡萄酒与酿造科学的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies wine and the science of winemaking (including tasting, evaluating, and understanding how wine is made)","zh":"葡萄酒学家；酿酒学专家（研究葡萄酒与酿造科学，也常负责品鉴与评估）"},"examples":[{"en":"The restaurant hired an oenologist to design its wine program.","zh":"这家餐厅聘请了一位酿酒学专家来设计它的葡萄酒项目。"},{"en":"As an oenologist, she analyzes how climate affects the taste of different wines.","zh":"作为葡萄酒学家，她会分析气候如何影响不同葡萄酒的风味。"}]}],"synonyms":["enologist","wine scientist","wine expert"],"phonetic":"/ˌiːˈnɑːlədʒɪst/","extraExplanation":["词源提示：oenologist 来自希腊语 oinos（葡萄酒）+ -logy（学科/研究）。英式拼写常见为 oenologist，美式也常写作 enologist（省略 o）。","易混词：sommelier（侍酒师）更偏向餐厅服务、选酒与搭配；oenologist（酿酒学专家）更偏向葡萄酒的科学研究与酿造过程。不过在现实中两者的工作内容可能会有重叠。"]}
{"word":"oenology","summary":{"en":"Oenology is the science and study of wine and winemaking.","zh":"Oenology 指“葡萄酒学/酿酒学”，研究葡萄酒与酿造过程的学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study and science of wine and winemaking (including grape growing, fermentation, tasting, and production)","zh":"葡萄酒学；酿酒学（研究葡萄酒与酿造过程的学科，包括葡萄栽培、发酵、品鉴与生产）"},"examples":[{"en":"She studied oenology in France and now works as a winemaker.","zh":"她在法国学习酿酒学，现在是一名酿酒师。"},{"en":"The course covers oenology basics like fermentation and wine tasting.","zh":"这门课涵盖酿酒学基础，比如发酵和品酒。"}]}],"synonyms":["enology","wine science","viniculture (related)"],"phonetic":"/ˌiːˈnɑːlədʒi/","extraExplanation":["“oenology”在美式英语里也常写作“enology”。词根来自希腊语 oinos（葡萄酒）+ -logy（学科/研究）。","相关职业与词汇：oenologist/enologist（酿酒学家、酿酒技术专家）；winemaker（酿酒师，偏实际生产）；sommelier（侍酒师，偏餐饮与搭配）。这几个角色在英语语境中常被区分。"]}
{"word":"oenomancy","summary":{"en":"Oenomancy is fortune-telling by interpreting wine.","zh":"oenomancy 指通过解读酒来进行占卜/算命（酒占）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"divination (fortune-telling) by interpreting wine—such as its color, taste, aroma, or the patterns it makes when poured.","zh":"酒占（通过解读酒的颜色、味道、香气或倒酒时形成的痕迹来进行占卜/算命）。"},"examples":[{"en":"In the story, the priest practiced oenomancy to predict the outcome of the harvest.","zh":"在故事里，那位祭司用酒占来预测收成的结果。"},{"en":"She joked that her “oenomancy” was just guessing based on how the wine smelled.","zh":"她开玩笑说她的“酒占”其实只是根据酒闻起来的味道瞎猜。"}]}],"synonyms":["wine divination","divination"],"phonetic":"/ˈiːnoʊˌmænsi/","extraExplanation":["词源：来自希腊语 oinos（酒）+ manteia（占卜）。在英语里比较少见，多出现在神秘学、古代宗教仪式或文学描写中。","相关词：oenomancer（酒占者）、-mancy（表示“占卜”的后缀，如 chiromancy 手相、necromancy 招魂/死灵术）。","文化提示：它属于“占卜”类词汇，通常带有仪式性或神秘色彩；在现代语境中常被当作历史趣闻、文学意象，或以幽默方式使用。"]}
{"word":"oenomania","summary":{"en":"Oenomania means an obsessive or compulsive desire for wine.","zh":"Oenomania 指对葡萄酒的痴迷或强迫性渴求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense craving for, obsession with, or compulsive desire to drink wine (sometimes used as a medical-sounding term for wine addiction).","zh":"对葡萄酒的强烈渴求、痴迷或强迫性饮用（有时作为“酒瘾/嗜酒”的一种偏正式说法）。"},"examples":[{"en":"He joked about his oenomania, but he was starting to worry about how often he drank wine.","zh":"他开玩笑说自己“葡萄酒痴迷”，但他开始担心自己喝葡萄酒的频率。"},{"en":"The article described oenomania as a romanticized word for an unhealthy relationship with wine.","zh":"文章说“oenomania”是一个带浪漫色彩的词，用来指对葡萄酒不健康的依赖。"}]}],"synonyms":["wine obsession","wine addiction (informal)","compulsion","alcoholism (broader)"],"phonetic":"/ˌiːnoʊˈmeɪniə/","extraExplanation":["词源来自希腊语：oeno- 表示“酒/葡萄酒”（同根词如 oenology「酿酒学」），-mania 表示“狂热/躁狂”。因此字面意思就是“对葡萄酒的狂热”。","现代英语里这个词比较少见，常见于写作、评论或带一点戏谑/文学感的语境；严肃医学语境更常用 alcoholism 或 alcohol use disorder。"]}
{"word":"oenomaus","summary":{"en":"Oenomaus is a proper name: a mythic Greek king defeated by Pelops, and also the name of a gladiator linked to Spartacus in later history/retellings.","zh":"Oenomaus 是专有名词：既指被珀洛普斯击败的希腊神话国王，也可指后世史料/改编中与斯巴达克斯相关的角斗士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A king of Pisa in Elis, famous for challenging his daughter Hippodamia’s suitors to a chariot race; he was ultimately defeated by Pelops.","zh":"（希腊神话）皮萨（Pisa，位于埃利斯）的国王，以要求女儿希波达弥亚（Hippodamia）的求婚者参加战车竞赛而闻名；最终被珀洛普斯（Pelops）击败。"},"examples":[{"en":"In Greek myth, Oenomaus tried to prevent Hippodamia from marrying by forcing suitors to race him in a chariot.","zh":"在希腊神话中，俄诺马俄斯为了阻止希波达弥亚出嫁，逼迫求婚者与他进行战车竞赛。"},{"en":"Pelops defeats Oenomaus, and the story is often linked to the origins of the Olympic Games.","zh":"珀洛普斯击败俄诺马俄斯；这个故事常被用来联系到奥林匹克运动会的起源传说。"}]},{"partOfSpeech":"n.","definition":{"en":"(Roman history / modern retellings) A notable gladiator associated with Spartacus’s uprising, often portrayed as a skilled fighter or trainer.","zh":"（罗马史／现代改编作品）与斯巴达克斯起义有关的一位知名角斗士，常被描绘为技艺高超的战士或教练。"},"examples":[{"en":"Some accounts mention Oenomaus as one of the experienced gladiators in Spartacus’s rebel group.","zh":"有些记载提到俄诺马俄斯是斯巴达克斯反叛队伍中的资深角斗士之一。"},{"en":"In TV adaptations, Oenomaus is sometimes shown as a mentor figure among the gladiators.","zh":"在电视剧改编中，俄诺马俄斯有时被塑造成角斗士群体中的导师型人物。"}]}],"synonyms":["(no direct synonyms; related names) Pelops","Hippodamia","Spartacus"],"phonetic":"/ˌiːnəˈmeɪəs/","extraExplanation":["这是一个专有名词（人名），常见于古希腊神话与古罗马角斗士相关叙述中；在英语里通常保留古典拼写 Oenomaus。","词首 oeno- 来自希腊语，常与“酒/葡萄酒”相关（如 oenology = 酿酒学）；但在这个人名里更重要的是作为传统译名整体记忆。","阅读古典作品时可留意不同拼写/转写（如 Oinomaos 等），属于同一名字的不同拉丁化形式。"]}
{"word":"oenomel","summary":{"en":"Oenomel is honey-sweetened wine, sometimes diluted with water, known mainly from ancient texts.","zh":"Oenomel 指蜂蜜调和的葡萄酒（有时会加水稀释），主要见于古代文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drink made by mixing wine with honey (sometimes also diluted with water); a honey-sweetened wine, often mentioned in ancient Greek/Roman contexts.","zh":"（有时会加水稀释的）蜂蜜调和葡萄酒；蜂蜜甜酒，常见于古希腊/古罗马语境。"},"examples":[{"en":"In the ancient recipe, they sweetened the wine with honey to make oenomel.","zh":"在那份古代配方里，他们用蜂蜜给葡萄酒增甜，制成 oenomel。"},{"en":"The historian notes that oenomel was served as a warming drink at banquets.","zh":"那位历史学者提到，宴会上会供应 oenomel 作为暖身饮品。"}]}],"synonyms":["honeyed wine","mead (related, but usually fermented honey)"],"phonetic":"/ˈiːnəˌmɛl/","extraExplanation":["词源来自希腊语：oinos（葡萄酒）+ meli（蜂蜜）。","在古典时代的饮食与医药书写中，这类蜂蜜酒/蜂蜜调酒常被当作滋补或“更温和、更易入口”的酒类饮品来描述；现代并不算常用词，更多出现在古代饮食史、古典文献或复古配方里。"]}
{"word":"oenomels","summary":{"en":"Oenomel is wine mixed with honey (sometimes with herbs), historically used as a medicinal drink.","zh":"Oenomel 指将葡萄酒与蜂蜜混合（有时加香草）的饮品，历史上常被当作药用饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drink (often considered medicinal) made from wine mixed with honey; sometimes also flavored with herbs or spices.","zh":"（常被视为药用的）蜂蜜酒：将葡萄酒与蜂蜜混合而成的饮品；有时会加入香草或香料调味。"},"examples":[{"en":"In some old medical texts, oenomel was recommended to soothe a sore throat.","zh":"在一些古老的医书中，蜂蜜酒（oenomel）被用来缓解喉咙痛。"},{"en":"The recipe calls for warm wine, honey, and a few herbs to make a simple oenomel.","zh":"这个配方需要温热的葡萄酒、蜂蜜和少量香草来制作简单的蜂蜜酒。"}]}],"synonyms":["honeyed wine","spiced wine (sometimes, if herbs/spices are added)","medicinal cordial (in historical contexts)"],"phonetic":"/ˈiːnəˌmɛl/","extraExplanation":["词源来自希腊语：oinos（酒/葡萄酒）+ mel（蜂蜜），字面意思就是“酒与蜂蜜”。","oenomel 与 mead（蜂蜜发酵酒）不同：mead 的酒精主要来自蜂蜜发酵；而 oenomel 通常是把蜂蜜直接加入已经成酒的葡萄酒中混合。","你输入的 oenomels 是复数形式；单数是 oenomel。"]}
{"word":"oenometer","summary":{"en":"An oenometer is an instrument for measuring alcohol (or related sugar/fermentation indicators) in wine.","zh":"oenometer 指测量葡萄酒酒精度（或相关糖度/发酵指标）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to measure the amount of alcohol (or the sugar level related to it) in wine or fermenting grape juice","zh":"用于测量葡萄酒（或发酵中的葡萄汁）酒精含量（或与酒精生成相关的糖度）的仪器"},"examples":[{"en":"The winemaker used an oenometer to check the wine’s alcohol level.","zh":"酿酒师用酒精计来检测葡萄酒的酒精度。"},{"en":"During fermentation, readings from the oenometer helped them decide when to stop the process.","zh":"在发酵过程中，酒精计的读数帮助他们决定何时停止发酵。"}]}],"synonyms":["alcoholmeter","vinometer"],"phonetic":"/ˌiːˈnɑːmɪtɚ/","extraExplanation":["“Oenometer”也常见拼写为“enometer”。词根 oeno- 来自希腊语 oinos（葡萄酒），-meter 表示“测量仪”。在葡萄酒语境中，它指用来估算酒精度的测量工具；实际使用时也可能搭配比重计（hydrometer）等仪器一起判断发酵进度。"]}
{"word":"oenone","summary":{"en":"Oenone is a figure from Greek mythology—Paris’s first wife/lover and a healer—and she also appears as a literary character, notably in Tennyson’s poem.","zh":"Oenone（俄诺涅）是希腊神话人物：帕里斯的最初妻子/恋人，擅长疗愈；同时也常作为文学人物出现，尤见于丁尼生的诗《俄诺涅》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a mountain nymph (an Oread) who was the first wife (or lover) of Paris of Troy and was known for healing skills.","zh":"（希腊神话）俄诺涅：一位山林仙女（山泽宁芙），是特洛伊王子帕里斯的第一任妻子（或恋人），以医术与疗愈能力闻名。"},"examples":[{"en":"In the myth, Oenone warns Paris that choosing Helen will bring disaster.","zh":"在神话中，俄诺涅警告帕里斯选择海伦将带来灾难。"},{"en":"After Paris is wounded, he returns to Oenone seeking a cure.","zh":"帕里斯受伤后返回俄诺涅身边寻求治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"A character and title in literary works, especially Alfred, Lord Tennyson’s poem “Oenone.”","zh":"（文学）文学作品中的人物与题名，尤指丁尼生（Alfred, Lord Tennyson）的诗作《俄诺涅》（“Oenone”）。"},"examples":[{"en":"Tennyson’s “Oenone” retells the story through her sorrowful voice.","zh":"丁尼生的《俄诺涅》用她悲伤的口吻重述了这个故事。"},{"en":"The name Oenone often appears in discussions of classical themes in Victorian poetry.","zh":"在讨论维多利亚时代诗歌中的古典主题时，Oenone 这个名字常被提及。"}]}],"synonyms":["(related) nymph","(related) Oread"],"phonetic":"/iˈnoʊni/","extraExplanation":["“Oenone”来自希腊语传统写法（常见拼写：Oinone/Oenone）。她与帕里斯的故事常被用来表现“被背弃的爱”“预言与宿命”“爱与复仇/怜悯之间的挣扎”等主题。","在一些版本里，俄诺涅起初拒绝医治帕里斯，后来后悔，但已来不及；这一情节常被文学改写，用来强化悲剧感与人物心理冲突。"]}
{"word":"oenophile","summary":{"en":"An oenophile is someone who loves wine and enjoys learning about it.","zh":"oenophile 指喜欢葡萄酒并乐于品鉴、了解葡萄酒的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves wine and enjoys learning about it (tasting, collecting, pairing, etc.)","zh":"葡萄酒爱好者；嗜酒（尤指葡萄酒）的人；喜欢研究与品鉴葡萄酒的人"},"examples":[{"en":"She’s an oenophile who keeps a notebook of every wine she tastes.","zh":"她是个葡萄酒爱好者，会把每次品过的酒都记在笔记本里。"},{"en":"The restaurant’s oenophile staff can recommend a wine for any dish.","zh":"这家餐厅的员工很懂酒，能为任何菜品推荐合适的葡萄酒。"},{"en":"Even as a casual oenophile, he enjoys visiting vineyards on weekends.","zh":"即使只是个休闲的葡萄酒爱好者，他也喜欢周末去酒庄游玩。"}]}],"synonyms":["wine lover","wine enthusiast","connoisseur (of wine)"],"phonetic":"ˈiːnəˌfaɪl","extraExplanation":["词源来自希腊语：oinos（酒/葡萄酒）+ -phile（爱好者）。在现代英语里多用于较正式或书面语境，常见于美食、餐饮、品鉴活动的介绍中。","拼写与相关词：oenology / enology（葡萄酒学；酿酒学）是“研究葡萄酒的学科/领域”；oenologist / enologist（葡萄酒学家/酿酒师）是“从事专业研究或酿造的人”。","文化语境上，oenophile通常强调“欣赏与品鉴”的兴趣，不一定表示喝得很多；若想表达“喝酒很多/酒瘾”，英语更常用heavy drinker或alcoholic（语气更强且带负面含义）。"]}
{"word":"oenophiles","summary":{"en":"Oenophiles are people who are especially interested in and knowledgeable about wine.","zh":"oenophiles 指对葡萄酒特别感兴趣、也常常很懂酒的爱好者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who loves, knows about, or is very interested in wine; a wine enthusiast.","zh":"爱酒的人；懂葡萄酒、对葡萄酒很有兴趣的人；葡萄酒爱好者。"},"examples":[{"en":"The tasting event was designed for oenophiles and beginners alike.","zh":"这场品酒活动既为葡萄酒爱好者准备，也欢迎初学者参加。"},{"en":"As an oenophile, she enjoys learning how different grapes affect flavor.","zh":"作为一名葡萄酒爱好者，她喜欢了解不同葡萄品种如何影响风味。"}]}],"synonyms":["wine enthusiast","wine lover","wine connoisseur"],"phonetic":"/iːˈnɑːfaɪl/","extraExplanation":["“oenophile”来自希腊语：oeno-（酒）+ -phile（爱好者）。美式英语里常见拼写是“oenophile”，英式也常见“oenophile/œnophile”。","语境上它通常比“wine lover”更正式，带一点“懂行、讲究”的感觉。","相关词：“oenology”指“葡萄酒学/酿酒学”；“sommelier”指餐厅里的“侍酒师”（专业岗位，不一定是爱好者）。"]}
{"word":"oenophilist","summary":{"en":"An oenophilist is a wine lover, especially someone interested in tasting and learning about wine.","zh":"oenophilist 指“葡萄酒爱好者”，尤其指喜欢品鉴并了解葡萄酒的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves wine and is interested in tasting, collecting, or learning about it","zh":"葡萄酒爱好者；热爱并研究/品鉴葡萄酒的人"},"examples":[{"en":"She’s an oenophilist who keeps a small notebook of wines she’s tasted.","zh":"她是个葡萄酒爱好者，会用小本子记录自己品过的酒。"},{"en":"As an oenophilist, he enjoys visiting vineyards and talking with winemakers.","zh":"作为葡萄酒爱好者，他喜欢参观葡萄园并和酿酒师交流。"}]}],"synonyms":["oenophile","wine lover","wine enthusiast"],"phonetic":"/ˈiːnəfɪlɪst/","extraExplanation":["词源来自希腊语：oeno-（酒、葡萄酒）+ -philist（爱好者）。常见近义词是 oenophile（葡萄酒爱好者），日常英语里更常用 wine lover。","在正式或文学语境中，这个词带一点“讲究、懂行”的感觉，但在日常对话中用 wine lover 会更自然。"]}
{"word":"oenophobist","summary":{"en":"An oenophobist is someone who fears or strongly dislikes wine.","zh":"oenophobist 指害怕或强烈厌恶葡萄酒的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has a strong fear of, dislike of, or aversion to wine","zh":"害怕、厌恶或强烈排斥葡萄酒的人"},"examples":[{"en":"He’s an oenophobist, so he avoids wine tastings and vineyard tours.","zh":"他很排斥葡萄酒，所以会避开品酒会和酒庄参观。"},{"en":"As an oenophobist, she asked the host to serve juice instead of wine.","zh":"作为一个厌恶葡萄酒的人，她请主人用果汁代替葡萄酒。"}]}],"synonyms":["wine-hater","person with oenophobia","wine-averse person"],"phonetic":"/ˌiːnəˈfoʊbɪst/","extraExplanation":["这个词比较少见，常见表达通常用 “someone who hates/avoids wine（讨厌/避开葡萄酒的人）” 或 “has a fear of wine（害怕葡萄酒）”。","词源可拆解理解：oeno-（来自希腊语，意为“葡萄酒”）+ -phobia（恐惧/厌恶）+ -ist（……的人）。","相关词：oenophobia（对葡萄酒的恐惧/厌恶）；与之相对的常见词是 oenophile（爱酒者）。"]}
{"word":"oenopoetic","summary":{"en":"Oenopoetic means wine-related and poetic, or poetically inspired by wine.","zh":"oenopoetic 指“与葡萄酒相关且富有诗意的”，或“受酒意/酒文化启发的诗意表达”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to wine and poetry, or describing something poetically inspired by wine.","zh":"与葡萄酒和诗歌有关的；（或）受酒意/酒文化启发而带有诗意的。"},"examples":[{"en":"The festival featured oenopoetic readings paired with local wines.","zh":"节日安排了“酒诗”朗诵，并搭配本地葡萄酒。"},{"en":"His oenopoetic toasts turned a simple dinner into a celebration.","zh":"他那带着诗意的祝酒词把一顿普通晚餐变成了庆祝。"}]}],"synonyms":["wine-inspired","bacchic","lyrical","wine-themed"],"phonetic":"/ˌiːnoʊpoʊˈɛtɪk/","extraExplanation":["这个词非常少见，常见于文学评论、品酒文化或活动宣传语中，带一点“文艺/抒情”的风格。","词源上可拆为 oeno-（与葡萄酒有关，源自希腊语 oinos“酒”）+ poetic（诗的）。如果想用更自然的表达，英语里常用 wine-themed poetry（以酒为主题的诗）、wine-inspired（受酒启发的）、lyrical toasts（抒情的祝酒词）等。"]}
{"word":"oenothera","summary":{"en":"Oenothera is the scientific genus name for evening primroses.","zh":"Oenothera 是“月见草（evening primrose）”的学名属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants called evening primroses, known for flowers that often open in the evening or at night","zh":"月见草属（植物属名）；常见名为“月见草”，许多品种的花常在傍晚或夜间开放"},"examples":[{"en":"Oenothera biennis (common evening primrose) is often grown in gardens.","zh":"Oenothera biennis（普通月见草）常被种在花园里。"},{"en":"The yellow Oenothera flowers opened as the sun went down.","zh":"太阳下山时，黄色的月见草花开了。"}]}],"synonyms":["evening primrose"],"phonetic":"/ˌiːnəˈθɪrə/","extraExplanation":["“Oenothera”是拉丁化的学名，来源可追溯到古希腊文献中的植物名称，但历史上指代并不完全确定；现代植物学中固定用作“月见草属”的属名。","在日常英语里，人们更常说“evening primrose（月见草）”，而“Oenothera”多用于科学写作、园艺标签或自然观察记录。","有些月见草相关产品会提到“evening primrose oil（月见草油）”，通常来自特定种（如Oenothera biennis）的种子。"]}
{"word":"oenotheraceae","summary":{"en":"Oenotheraceae is the botanical family name for the evening primrose family.","zh":"Oenotheraceae 是“柳叶菜科/（月见草科）”的植物学科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the evening primrose family) that includes evening primroses and related flowering plants, many with four-petaled flowers.","zh":"柳叶菜科（又称“月见草科”）：一个被子植物科，包括月见草属等相关开花植物，常见特征是四瓣花等。"},"examples":[{"en":"Evening primrose belongs to the family Oenotheraceae.","zh":"月见草属于柳叶菜科（Oenotheraceae）。"},{"en":"Some species in Oenotheraceae are grown in gardens for their bright flowers.","zh":"柳叶菜科的一些物种因花色鲜艳而被种植在花园里。"}]}],"synonyms":["evening primrose family"],"phonetic":"/ˌiːnəˈθɛrəsiˌiː/","extraExplanation":["这是一个植物学分类名，通常出现在学术文章、植物志、园艺书和拉丁学名系统中。英语里它多用于正式语境，日常更常说“evening primrose family（月见草科/柳叶菜科）”。","词形上常见结尾 -aceae 表示“某某科”（植物科名的标准拉丁化后缀），发音里常带有重音落在中间音节。","Oenothera（月见草属）这个属名来自古典语言传统的拉丁化形式，因此整词看起来偏“学术拉丁语”，拼写不规则、读音也不太直观。"]}
{"word":"oenotheraceous","summary":{"en":"A botanical adjective meaning “related to evening primroses (Onagraceae/Oenothera).”","zh":"植物学形容词：表示“与月见草（柳叶菜科/月见草属）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the evening-primrose family (Onagraceae) or the genus Oenothera (evening primroses).","zh":"（植物）属于或与柳叶菜科（Onagraceae，亦称月见草科）或月见草属（Oenothera）有关的。"},"examples":[{"en":"Evening primrose is an oenotheraceous plant often studied for its seed oil.","zh":"月见草是一种柳叶菜科（oenotheraceous）的植物，常因其种子油而被研究。"},{"en":"The botanist compared oenotheraceous species growing near the riverbank.","zh":"植物学家比较了生长在河岸附近的柳叶菜科物种。"}]}],"synonyms":["onagraceous"],"phonetic":"/ˌiːnəˌθəˈreɪʃəs/","extraExplanation":["这是一个较学术/植物学用词，在日常英语里不常见；更常见的说法是 “of the evening-primrose family” 或直接说 “Onagraceae”。","相关名词：Oenothera（月见草属），Onagraceae（柳叶菜科）。在植物分类语境中，-aceous 常表示“……科的/与……有关的”。"]}
{"word":"oenotrian","summary":{"en":"Oenotrian means “connected with Oenotria,” an ancient name for parts of southern Italy, or the people from there.","zh":"Oenotrian 指“与奥诺特里亚（古代对意大利南部部分地区的称呼）或其居民有关的”，也可指奥诺特里亚人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Oenotria (an ancient Greek name for parts of southern Italy) or to its early inhabitants.","zh":"（形容词）与“奥诺特里亚”（古希腊对意大利南部部分地区的称呼）或其早期居民有关的。"},"examples":[{"en":"Some ancient writers describe Oenotrian settlements in southern Italy.","zh":"一些古代作者描述了意大利南部的奥诺特里亚人聚落。"},{"en":"The museum label mentions an Oenotrian cultural layer before later Greek colonies.","zh":"博物馆标签提到在后来的希腊殖民地之前，曾有奥诺特里亚文化层。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Oenotria; one of the ancient people associated with southern Italy in Greek tradition.","zh":"（名词）奥诺特里亚人；在希腊传统中与意大利南部相关的古代族群成员。"},"examples":[{"en":"The legend says the Oenotrians lived in the region before many other groups arrived.","zh":"传说称奥诺特里亚人在许多其他族群到来之前就住在那一带。"}]}],"synonyms":["Oenotrian (no close everyday synonym)","ancient Italian (context-dependent)","Italic (sometimes used broadly, not exact)"],"phonetic":"/ˌiːnəˈtriən/","extraExplanation":["“Oenotrian”来自“Oenotria”（奥诺特里亚）。该地名通常被解释为源于希腊语与“葡萄酒”有关的词根，因此奥诺特里亚有时被诗意地理解为“葡萄酒之地”。在古典文献中它并非现代行政区名称，而是一种古代地理/民族称呼，常见于历史、考古、古典研究语境。"]}
{"word":"oer","summary":{"en":"OER most commonly means Open Educational Resources—free teaching/learning materials that can often be shared and adapted under an open license.","zh":"OER 最常见指开放教育资源——可免费使用的教学/学习材料，通常在开放许可下可分享与改编。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Open Educational Resources: teaching and learning materials (like textbooks, videos, or lesson plans) that are free to use and are often openly licensed so people can copy, share, and adapt them.","zh":"开放教育资源：可免费使用的教学与学习材料（如教材、视频、教案等），通常带有开放许可，允许人们复制、分享并改编。"},"examples":[{"en":"Our school uses OER textbooks to reduce costs for students.","zh":"我们学校使用开放教育资源（OER）教材来降低学生的费用。"},{"en":"The teacher adapted an OER worksheet to fit the class level.","zh":"老师改编了一份 OER 练习单，使其更符合班级程度。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) In other fields, “OER” can be an abbreviation for different things; its meaning depends on the context.","zh":"（较少见）在其他领域，“OER”也可能代表不同含义；具体意思取决于语境。"},"examples":[{"en":"In this article, OER refers to Open Educational Resources, not a medical term.","zh":"在这篇文章里，OER 指的是开放教育资源，而不是医学术语。"}]}],"synonyms":["open educational resources","open resources","openly licensed learning materials"],"phonetic":"/oʊ iː ɑr/","extraExplanation":["OER 常与“开放许可”一起出现，最常见的是 Creative Commons（知识共享）许可。不同许可对“是否可商用、是否必须署名、是否必须以相同方式共享改编作品”等要求不同。","联合国教科文组织（UNESCO）推动 OER 的全球倡议，使其在教育公平、降低教材成本、支持教师备课与本地化改编方面很重要。"]}
{"word":"oerlikon","summary":{"en":"Oerlikon most commonly refers to a district of Zürich, and by extension to Swiss companies/products named after that place; it can also refer to the well-known 20th-century Oerlikon anti-aircraft cannon.","zh":"Oerlikon 最常指瑞士蘇黎世的厄利孔區；也可延伸指以該地命名的瑞士公司／品牌；在軍事史中還可指著名的厄利孔防空機關炮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A district in the city of Zürich, Switzerland (often written as Zürich-Oerlikon).","zh":"瑞士苏黎世（Zürich）的一個區域（常寫作 Zürich-Oerlikon／蘇黎世-厄利孔）。"},"examples":[{"en":"I’m changing trains at Zürich-Oerlikon station.","zh":"我要在蘇黎世-厄利孔車站換乘。"},{"en":"She lives in Oerlikon, near central Zürich.","zh":"她住在厄利孔，靠近蘇黎世市中心。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for Swiss industrial companies and products historically connected with Oerlikon (for example, the Oerlikon Group).","zh":"與「厄利孔」地名相關的瑞士工業公司與品牌名稱（例如 Oerlikon 集團）。"},"examples":[{"en":"Oerlikon is known for high-tech manufacturing and surface solutions.","zh":"Oerlikon 以高科技製造與表面處理解決方案聞名。"},{"en":"The company opened a new facility under the Oerlikon name.","zh":"該公司以 Oerlikon 之名開設了一座新廠。"}]},{"partOfSpeech":"n.","definition":{"en":"In military history, a type of anti-aircraft autocannon commonly called the Oerlikon (especially the 20 mm Oerlikon) used widely in the 20th century.","zh":"在軍事史中，常指一種防空機關炮／自動炮，通常稱為 Oerlikon（尤指 20 毫米厄利孔機關炮），20 世紀被廣泛使用。"},"examples":[{"en":"The ship was equipped with 20 mm Oerlikon guns for air defense.","zh":"這艘軍艦配備了 20 毫米厄利孔機關炮用於防空。"},{"en":"The museum displays an Oerlikon cannon from World War II.","zh":"博物館展出一門二戰時期的厄利孔機關炮。"}]}],"synonyms":["Zürich-Oerlikon (place name variant)"],"phonetic":"/ˈɝlɪkɑn/","extraExplanation":["「Oerlikon」原本是地名，後來因工業發展而成為公司與產品的名稱來源。學術或新聞語境中，若看到「Oerlikon」單獨出現，需要依上下文判斷是指蘇黎世的地區、公司品牌，或軍事裝備。","拼寫上的「oe」常用來代替德語的變音字母「ö」（Ö/ö）。因此 Oerlikon 有時可理解為帶德語語感的外來專有名詞；英語中一般直接按常見讀法念即可。"]}
{"word":"oersted","summary":{"en":"Oersted (Oe) is a cgs unit of magnetic field strength, named after Danish scientist Hans Christian Ørsted.","zh":"厄斯特（Oe）是cgs制中磁场强度的单位，得名于丹麦科学家汉斯·克里斯蒂安·厄斯特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of magnetic field strength (magnetizing field, H) in the cgs system, equal to 1 dyne per unit magnetic pole; symbol: Oe","zh":"厄斯特（磁场强度/磁化场 H 的单位，cgs 制），符号：Oe"},"examples":[{"en":"The magnetizing field was increased from 50 to 200 oersted.","zh":"磁化场强度从 50 厄斯特提高到 200 厄斯特。"},{"en":"This material’s coercivity is about 800 Oe.","zh":"这种材料的矫顽力大约是 800 厄斯特（Oe）。"}]},{"partOfSpeech":"n.","definition":{"en":"Hans Christian Ørsted (1777–1851), a Danish scientist after whom the unit is named","zh":"汉斯·克里斯蒂安·厄斯特（1777–1851，丹麦科学家；该单位以其命名）"},"examples":[{"en":"Ørsted showed that an electric current can create a magnetic field.","zh":"厄斯特证明了电流可以产生磁场。"}]}],"synonyms":["Oe"],"phonetic":"/ˈɝːstɛd/","extraExplanation":["“oersted / Oe”常见于物理、材料与磁学文献里，属于cgs（厘米-克-秒）单位制；在SI单位制中更常用A/m（安培/米）来表示磁场强度H。","人名Ørsted在英文中常写作“Oersted”（用“oe”代替丹麦语字母“Ø”），科学写作里两种拼写都可能出现。"]}
{"word":"oersteds","summary":{"en":"“Oersteds” means multiple oersted units, used to measure magnetic field strength (H) in the CGS system.","zh":"“Oersteds”是“oersted（奥斯特）”的复数，指 CGS 制中用于表示磁场强度（H）的单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oersted: a unit (in the CGS system) used to measure magnetic field strength (magnetizing field, H).","zh":"oersted 的复数：一种（CGS 制）用来衡量磁场强度/磁化场（H）的单位。"},"examples":[{"en":"The magnetizing field was increased from 10 to 50 oersteds.","zh":"磁化场从 10 增加到 50 奥斯特。"},{"en":"Engineers reported the coil produced several hundred oersteds near the core.","zh":"工程师报告说，线圈在铁芯附近产生了数百奥斯特的磁场强度。"}]}],"synonyms":["(SI unit) amperes per meter (A/m)","(related CGS unit) gauss (G, for magnetic flux density B)"],"phonetic":"/ˈɝstɛd/","extraExplanation":["“Oersted（奥斯特）”以丹麦科学家汉斯·克里斯蒂安·奥斯特（Hans Christian Ørsted）命名，他发现了电流会产生磁场。","它属于厘米-克-秒（CGS）单位制，在一些老的物理/工程资料里常见；在 SI 制中更常用 A/m（安培/米）表示磁场强度。换算上常见近似：1 Oe ≈ 79.6 A/m（在真空/空气中常用这个关系）。"]}
{"word":"oes","summary":{"en":"“oes” usually means more than one letter “O” (a rare spelling; “O’s/os” is more common). It can also be the abbreviation “OES” in specific contexts.","zh":"“oes” 通常指多个字母 “O”（较少见的写法；更常见是 “O’s/os”）。它也可能是特定语境中的缩写 “OES”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of the letter “O” (used when talking about more than one “O” in spelling or shapes).","zh":"字母 “O” 的复数（用于讨论拼写或形状中多个“O”时）。"},"examples":[{"en":"There are two O’s (oes) in the word “zoo.”","zh":"“zoo” 这个词里有两个字母 O（oes）。"},{"en":"Draw three big O’s (oes) on the paper.","zh":"在纸上画三个大的 O（oes）。"}]},{"partOfSpeech":"other","definition":{"en":"a written form of the sound /oʊz/ used rarely; more often you will see “O’s” or “os.”","zh":"一种较少见的写法，表示 /oʊz/ 的读音；更常见的写法是 “O’s” 或 “os”。"},"examples":[{"en":"Some style guides prefer “O’s,” while others allow “oes.”","zh":"有些写作规范更推荐写 “O’s”，也有的允许写 “oes”。"}]},{"partOfSpeech":"other","definition":{"en":"(OES) an abbreviation used in some contexts, such as “Order of the Eastern Star” (a fraternal organization).","zh":"（OES）在某些语境中的缩写，例如 “Order of the Eastern Star”（一个共济/兄弟会性质的组织）。"},"examples":[{"en":"She joined OES through her local chapter.","zh":"她通过当地分会加入了 OES。"}]}],"synonyms":["O's","Os"],"phonetic":"/oʊz/","extraExplanation":["“字母复数”的写法在英文里有不同风格：常见的是用撇号（O’s, A’s），目的是避免和普通单词混淆；也有人直接用复数（Os, As）。写 “oes” 比较少见，但在某些教材或旧用法中会出现。","如果你是想问某个特定领域里的 “OES”（例如医学、教育、公司名等缩写），告诉我上下文句子，我可以帮你确定最准确的意思。"]}
{"word":"oesogi","summary":{"en":"Oesogi is a Taekwondo term meaning an outside stance used for stable turning or blocking.","zh":"Oesogi 是跆拳道术语，指用于稳定转身或格挡的“外侧站姿/外立姿”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Korean martial-arts term (used in Taekwondo) for an “outside stance,” where the feet are positioned to the outside line to support turning, blocking, or changing direction","zh":"韩国武术（跆拳道）用语，指“外侧站姿/外立姿”（脚步站在身体外侧线，以便转身、格挡或变向）"},"examples":[{"en":"In Taekwondo class, we practiced oesogi before learning the next block.","zh":"在跆拳道课上，我们先练了 oesogi（外侧站姿），再学习下一个格挡动作。"},{"en":"Switch into oesogi to make your turn faster and more stable.","zh":"换成 oesogi（外侧站姿）能让你转身更快、更稳。"}]}],"synonyms":["outside stance","outer stance"],"phonetic":"/oʊˈsɔːɡi/","extraExplanation":["“oesogi”通常是韩语术语的拉丁字母转写（拼法也常见 oeseogi / oe sogi）。不同道馆或教材的拼写、罗马化规则可能略有差异，但都指某类“外侧/外向”的站姿概念。","因为它是外来术语而非普通英语词汇，所以在英文语境中多出现在跆拳道教材、课堂口令或比赛讲解里。"]}
{"word":"oesophagal","summary":{"en":"Oesophagal means “related to the esophagus,” and is the British spelling of esophageal.","zh":"oesophagal意为“食管的”，是美式esophageal的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) relating to the esophagus (the tube that carries food from the throat to the stomach).","zh":"（医学）与食管有关的；食管的。"},"examples":[{"en":"The doctor ordered an oesophagal examination to check for inflammation.","zh":"医生安排了食管检查，以确认是否有炎症。"},{"en":"Acid reflux can irritate the oesophagal lining.","zh":"胃酸反流可能会刺激食管内壁。"}]}],"synonyms":["esophageal","esophagus-related"],"phonetic":"/ɪˌsɑfəˈdʒiəl/","extraExplanation":["“oesophagal”是英式拼写，对应美式更常见的“esophageal”。在医学文章、检查项目名称（如内镜检查）、疾病描述（如反流、狭窄、炎症）中常见。","常见搭配：oesophagal/esophageal cancer（食管癌）, oesophagal reflux（食管反流/胃食管反流相关）, oesophagal lining（食管黏膜/内壁）。"]}
{"word":"oesophageal","summary":{"en":"“Oesophageal” means “of or relating to the esophagus.” (British spelling)","zh":"“oesophageal”意为“与食管有关的”。（英式拼写）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the esophagus (the tube that carries food from the throat to the stomach).","zh":"与食管有关的（食管是把食物从喉咙送到胃的管道）。"},"examples":[{"en":"She was diagnosed with oesophageal cancer.","zh":"她被诊断为食管癌。"},{"en":"The doctor ordered an oesophageal scan to check for narrowing.","zh":"医生安排了食管扫描来检查是否有狭窄。"}]}],"synonyms":["esophageal"],"phonetic":"/iˌsɑf.əˈdʒi.əl/","extraExplanation":["这是英式拼写：oesophageal；美式更常写作 esophageal。发音基本相同，医学语境中两种拼写都常见。","词源来自希腊语相关词根，现代英语中多用于医学与解剖学（如 oesophageal reflux/GERD：胃食管反流）。"]}
{"word":"oesophagean","summary":{"en":"Oesophagean means “related to the esophagus.” (More common US form: esophageal.)","zh":"oesophagean 意为“食管的；与食管有关的”。（美式更常用：esophageal。）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the esophagus (the tube that carries food from the throat to the stomach).","zh":"食管的；与食管有关的（食管是把食物从喉咙送到胃的管道）。"},"examples":[{"en":"Oesophagean cancer can make swallowing painful.","zh":"食管癌可能会让吞咽变得疼痛。"},{"en":"The doctor checked for oesophagean irritation after the patient reported heartburn.","zh":"病人报告胃灼热后，医生检查是否有食管刺激。"}]}],"synonyms":["esophageal","oesophageal"],"phonetic":"/ɪˌsɑːfəˈdʒiːən/","extraExplanation":["“oesophagean”多见于英式拼写体系；美式更常写作“esophageal”。两者意义相同。","词源来自希腊语“oisophagos”（食管），常用于医学语境。日常英语中一般用“esophagus/oesophagus（食管）”更常见。"]}
{"word":"oesophagi","summary":{"en":"“Oesophagi” means “esophaguses”: the plural of oesophagus (the food pipe).","zh":"“Oesophagi”意为“食管们/食管（复数）”，是 oesophagus（食管）的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oesophagus (also spelled esophagus): the tubes that carry food and drink from the throat to the stomach.","zh":"oesophagus（也拼作 esophagus，食管）的复数：把食物和饮料从喉咙送到胃的“管道”。"},"examples":[{"en":"In humans, the oesophagi of different people are similar in basic structure.","zh":"在人类中，不同人的食管在基本结构上很相似。"},{"en":"The doctor examined the patients’ oesophagi for signs of irritation.","zh":"医生检查了这些病人的食管是否有刺激或发炎的迹象。"}]}],"synonyms":["esophagi","esophaguses"],"phonetic":"/ɪˈsɑfəˌɡaɪ/","extraExplanation":["“oesophagi”是较学术/医学场景中常见的复数形式（源自拉丁语复数）。在日常英语里，尤其是美式英语，人们更常写作“esophaguses”或用单数“esophagus”搭配数量表达（如“two esophagus problems”在口语中也会出现）。","拼写差异：英式常用“oesophagus/oesophagi”，美式更常用“esophagus/esophagi”。"]}
{"word":"oesophagism","summary":{"en":"Oesophagism is a rare medical word meaning spasm or painful irritation of the esophagus, often causing trouble swallowing.","zh":"Oesophagism 是一个少见的医学词，指食管痉挛或疼痛性刺激，常引起吞咽困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical term for spasm or painful irritation of the esophagus (the food pipe), often causing difficulty swallowing or chest discomfort","zh":"（医学）食管痉挛或食管的疼痛性刺激，常导致吞咽困难或胸部不适"},"examples":[{"en":"The doctor suspected oesophagism because she had sudden trouble swallowing during meals.","zh":"医生怀疑是食管痉挛（oesophagism），因为她在吃饭时突然出现吞咽困难。"},{"en":"In some cases of oesophagism, the pain can feel similar to heartburn or chest tightness.","zh":"在某些食管痉挛（oesophagism）的情况下，疼痛可能像烧心或胸口发紧。"}]}],"synonyms":["esophageal spasm","esophagism","esophageal cramp"],"phonetic":"/iˈsɑfəˌdʒɪzəm/","extraExplanation":["这是一个比较少见、偏旧式的医学词汇，现代医学写作中更常见的说法是 esophageal spasm（食管痉挛）或用更具体的诊断名称来描述。","英式拼写常见 oesophagus / oesophagism；美式拼写通常是 esophagus / esophagism（虽然这个名词本身就不常用）。"]}
{"word":"oesophagismus","summary":{"en":"Oesophagismus means a painful spasm of the esophagus that can make swallowing difficult.","zh":"oesophagismus 指食管的疼痛性痉挛，可能导致吞咽困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a painful spasm (sudden tightening) of the esophagus that can cause trouble swallowing or chest discomfort","zh":"食管痉挛；食管肌肉突然收缩引起的疼痛性痉挛，可导致吞咽困难或胸部不适"},"examples":[{"en":"The doctor considered oesophagismus after the patient reported sudden pain when swallowing.","zh":"病人说吞咽时突然疼痛后，医生考虑可能是食管痉挛。"},{"en":"In some cases, oesophagismus can feel like chest pain and may be mistaken for heart problems.","zh":"在某些情况下，食管痉挛会像胸痛一样，可能被误认为是心脏问题。"}]}],"synonyms":["esophageal spasm","esophagospasm"],"phonetic":"/iˌsɑfəˈdʒɪzməs/","extraExplanation":["这是较少见、偏医学文献用词的术语；现代临床中更常见的说法是“esophageal spasm（食管痉挛）”。","英式拼写常写作“oesophagismus”（含 oe-），美式相关词常见“esoph-”开头。"]}
{"word":"oesophagitis","summary":{"en":"Oesophagitis is inflammation of the esophagus, often linked to acid reflux.","zh":"Oesophagitis（食管炎）是食管发炎，常与胃酸逆流有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation (swelling and irritation) of the esophagus, the tube that carries food from the mouth to the stomach.","zh":"食管炎：食管（把食物从口腔送到胃的管道）发生炎症、肿胀与刺激。"},"examples":[{"en":"The doctor said my chest burning was caused by oesophagitis from acid reflux.","zh":"医生说我胸口灼热是胃酸逆流引起的食管炎。"},{"en":"If you have trouble swallowing, it could be a sign of oesophagitis.","zh":"如果你吞咽困难，可能是食管炎的迹象。"}]}],"synonyms":["esophagitis","inflammation of the esophagus"],"phonetic":"/ˌiːˌsɑːfəˈdʒaɪtɪs/","extraExplanation":["英式拼写 oesophagitis=美式拼写 esophagitis；发音中通常读作“ee-”，但拼写里会保留 oe/eso 的差异。","常见诱因包括胃食管反流（GERD）、药物刺激（如某些止痛药或抗生素）、感染（免疫力较低时更常见）、过敏相关的嗜酸性食管炎（eosinophilic esophagitis）。","常见症状有胸口灼热、吞咽疼痛或困难、喉咙不适；严重或持续症状应就医，以免出现狭窄、出血等并发症。"]}
{"word":"oesophago","summary":{"en":"Oesophago- is a medical prefix meaning “esophagus” (British spelling).","zh":"Oesophago- 是表示“食管/食道”的医学构词前缀（英式拼写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form (prefix) meaning “esophagus”; used in medical words about the tube that carries food from the throat to the stomach","zh":"构词前缀，表示“食管/食道”；用于与把食物从咽喉送到胃的管道相关的医学词汇中"},"examples":[{"en":"Oesophagitis is inflammation of the esophagus.","zh":"Oesophagitis（食管炎）是食管的炎症。"},{"en":"The report mentions an oesophagogastroduodenoscopy (OGD).","zh":"报告中提到 oesophagogastroduodenoscopy（上消化道内镜检查，简称 OGD）。"},{"en":"Oesophagography is an X-ray test of the esophagus.","zh":"Oesophagography（食管造影）是对食管进行的 X 光检查。"}]}],"synonyms":["esophago-","oesophageal","esophageal"],"phonetic":"/ɪˈsɑfəˌɡoʊ/","extraExplanation":["“oesophago-”是英式拼写；美式常写作“esophago-”。例如：oesophagus（英）= esophagus（美）。","词源来自希腊语 oisophagos（食管）。在医学术语里它常与其他词根组合：-itis（炎症）、-scopy（内镜检查）、-graphy（造影/记录）等。"]}
{"word":"oesophagostomiasis","summary":{"en":"Oesophagostomiasis is an intestinal roundworm infection caused by Oesophagostomum, often associated with painful nodules and digestive symptoms.","zh":"Oesophagostomiasis（结节虫病）是由结节虫属线虫引起的肠道寄生虫感染，常与肠壁结节及腹痛、腹泻等症状有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A parasitic worm infection of the intestines caused by Oesophagostomum (a type of roundworm), leading to painful intestinal nodules and digestive symptoms.","zh":"由结节虫属（Oesophagostomum，一种线虫/蛔虫类寄生虫）引起的肠道寄生虫感染，可形成肠壁结节并导致消化道症状。"},"examples":[{"en":"Oesophagostomiasis can cause abdominal pain and diarrhea, especially in areas with poor sanitation.","zh":"在卫生条件较差的地区，结节虫病可能引起腹痛和腹泻。"},{"en":"The doctor considered oesophagostomiasis after imaging showed intestinal nodules.","zh":"影像检查发现肠道结节后，医生考虑可能是结节虫病。"}]}],"synonyms":["oesophagostomosis","nodular worm infection"],"phonetic":"/iˌsɑfəɡoʊˌstɑːmaɪˈæsɪs/","extraExplanation":["这个词属于医学/寄生虫学用语，常见于热带医学（tropical medicine）语境；日常英语中很少使用。","构词上可拆为：Oesophagostomum（寄生虫属名）+ -iasis（表示“疾病/病症”的后缀，如 amoebiasis 阿米巴病）。","拼写上英式常见 oesoph-（如 oesophagus），美式常见 esoph-；但该病名在专业文献中两种拼写都可能出现。"]}
{"word":"oesophagostomum","summary":{"en":"Oesophagostomum is a genus of parasitic nematodes (“nodular worms”) that infect the intestines of animals and sometimes humans.","zh":"Oesophagostomum 是一种寄生性线虫属（“结节虫”），主要感染动物肠道，有时也感染人类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic roundworms (nematodes), often called “nodular worms,” that live in the intestines of animals (and sometimes humans) and can cause nodules and inflammation in the gut.","zh":"（生物）一种寄生性线虫属，常被称为“结节虫/结节线虫”，主要寄生在动物（有时也包括人类）的肠道，可引起肠壁结节与炎症。"},"examples":[{"en":"The veterinarian found Oesophagostomum larvae in the stool sample.","zh":"兽医在粪便样本中发现了结节虫属（Oesophagostomum）的幼虫。"},{"en":"Infected pigs may lose weight because Oesophagostomum can irritate the intestines.","zh":"受感染的猪可能会消瘦，因为结节虫属会刺激肠道。"}]}],"synonyms":["nodular worm(s)"],"phonetic":"/iˌsɑːfəɡoʊˈstɑːməm/","extraExplanation":["该词属于学名（拉丁化的生物分类名称），通常在医学/兽医学、寄生虫学文章中出现；日常英语里更常说 nodular worms（结节虫）或直接说某个物种名（如 Oesophagostomum dentatum）。","词源可拆解理解：oesophago-（食道）+ stoma（口/开口），与“口部结构”相关的命名习惯有关；但具体致病部位主要在肠道。","相关病名为 oesophagostomiasis（结节虫病/食道口线虫病），指感染该属线虫所引起的疾病。"]}
{"word":"oesophagus","summary":{"en":"Oesophagus: the tube that carries food from the mouth to the stomach (British spelling of “esophagus”).","zh":"Oesophagus：食道，把食物从口腔输送到胃里（英式拼写；美式为 esophagus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The tube in your throat and chest that carries food and drink from your mouth to your stomach.","zh":"食道；连接口腔与胃、把食物和饮料送到胃里的管道。"},"examples":[{"en":"Food travels down the oesophagus to the stomach.","zh":"食物会沿着食道进入胃里。"},{"en":"Acid reflux can irritate the lining of the oesophagus.","zh":"胃酸逆流会刺激食道内壁。"}]}],"synonyms":["esophagus","gullet"],"phonetic":"/iˈsɑfəɡəs/","extraExplanation":["“oesophagus”是英式拼写；美式英语更常写作“esophagus”。两者意思完全相同，发音也很接近。","在医学语境中很常见的搭配有：oesophageal/esophageal cancer（食道癌）、oesophagitis/esophagitis（食道炎）、upper endoscopy（上消化道内镜检查，用于观察食道等）。"]}
{"word":"oestradiol","summary":{"en":"Oestradiol (estradiol) is the main estrogen hormone that affects the menstrual cycle and many body tissues.","zh":"雌二醇（estradiol）是一种主要的雌激素，影响月经周期及多种身体组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A main form of estrogen (a female sex hormone) made mostly in the ovaries; it helps regulate the menstrual cycle, supports pregnancy-related functions, and affects bones, skin, and other tissues.","zh":"雌二醇：一种主要的雌激素（女性性激素），主要由卵巢分泌；有助于调节月经周期、支持与妊娠相关的功能，并影响骨骼、皮肤等多种组织。"},"examples":[{"en":"Estradiol levels change throughout the menstrual cycle.","zh":"雌二醇水平会随着月经周期而变化。"},{"en":"After menopause, estradiol levels usually drop.","zh":"绝经后，雌二醇水平通常会下降。"},{"en":"The doctor discussed estradiol as part of hormone therapy.","zh":"医生讨论了把雌二醇作为激素治疗的一部分。"}]}],"synonyms":["estradiol","E2","estrogen (broader term)"],"phonetic":"/ˌiːstrəˈdaɪ.ɔːl/","extraExplanation":["“Oestradiol”是英式拼写；美式拼写更常见的是“estradiol”。两者指同一种激素。","在医学检验里，雌二醇常被简称为“E2”。它与另外两种常见雌激素（estrone/E1、estriol/E3）一起被比较；其中雌二醇在育龄期通常最重要、活性也更强。","该词常见于内分泌、妇科、生殖医学与激素治疗相关语境；属于医学术语，日常英语里更常用“estrogen（雌激素）”这一大类词。"]}
{"word":"oestrelata","summary":{"en":"“oestrelata” isn’t recognized as a common English word; it’s likely a misspelling or a non-English/proper name form.","zh":"“oestrelata”不是常见英语词；更可能是拼写错误或非英语/专有名词形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/title, or a word from another language (often looks Portuguese/Spanish-inspired).","zh":"不是标准英语单词。可能是拼写错误、用户名/标题，或来自其他语言（外形有点像葡语/西语风格的词）。"},"examples":[{"en":"I couldn’t find “oestrelata” in major English dictionaries—can you share the sentence you saw it in?","zh":"我在主流英语词典里查不到“oestrelata”——你能把它出现的句子发我吗？"},{"en":"If you meant a different spelling, I can explain that word instead.","zh":"如果你本来想输入的是另一个拼法，我也可以改为解释那个词。"}]}],"phonetic":"/ˌoʊɛstrəˈlɑːtə/","extraExplanation":["这个词在英语语料/词典里不常见，因此我不想“硬猜”词义，避免误导。最有效的做法是：\n1）提供上下文句子或来源（书名、歌曲、网站、游戏、学名等）；\n2）确认是否拼错：比如把开头的 oe- 改成 ae-/e-，或拆开成两个词。\n有了上下文我就能判断它是外来词、专有名词、还是某个英语词的误拼。"]}
{"word":"oestrian","summary":{"en":"Oestrian means “related to estrus,” the fertile “in heat” period in female animals.","zh":"oestrian 指“与发情期（动情期）有关的”，常见于兽医/生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to estrus (the period when a female animal is “in heat” and able to become pregnant).","zh":"与（雌性动物的）发情期有关的；与“发情/动情”（能受孕的时期）有关的。"},"examples":[{"en":"The veterinarian confirmed the dog was showing oestrian behavior.","zh":"兽医确认这只狗表现出发情期（oestrian）的行为。"},{"en":"Oestrian cycles vary widely among different mammals.","zh":"不同哺乳动物的发情周期差异很大。"}]}],"synonyms":["estrian","in heat (informal)"],"phonetic":"/ˈiːstriən/","extraExplanation":["“oestrian”是英式拼写（带 oe-），美式更常写作“estrian”，都来自拉丁语/希腊语词根，和“estrus/oestrus（发情期）”同源。通常用于兽医学、生物学等语境，在日常英语里不常见。"]}
{"word":"oestriasis","summary":{"en":"Oestriasis is a rare medical term for frenzied agitation, originally linked to irritation from botfly (Oestrus) larvae; it can also mean an abnormal condition resembling oestrus.","zh":"Oestriasis 是一个罕见医学词，指强烈烦躁/狂乱（原与牛虻属幼虫刺激有关）；也可指类似发情期（oestrus）的病态状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) A state of intense agitation or “madness” thought to be caused by the presence or irritation of botfly (Oestrus) larvae; by extension, any frenzied restlessness.","zh":"（医学用语，罕见）据说由牛虻/丽蝇（Oestrus，牛虻属）幼虫寄生或刺激引起的强烈烦躁、狂乱；引申为任何近似“狂躁”的不安与躁动。"},"examples":[{"en":"In older medical writing, oestriasis was described as a kind of frenzy brought on by parasitic larvae.","zh":"在较早的医学著作中，oestriasis 被描述为一种由寄生幼虫引发的狂乱状态。"},{"en":"She paced the room in a fit of oestriasis, unable to sit still.","zh":"她在房间里来回踱步，仿佛陷入 oestriasis 般坐立不安。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) A pathological condition resembling oestrus (the period when an animal is sexually receptive).","zh":"（极罕见）类似于发情期（oestrus）的病态状态。"},"examples":[{"en":"The term has also been used for abnormal behaviors compared to oestrus in animals.","zh":"该词也曾用于描述与动物发情期（oestrus）相比较的异常行为。"}]}],"synonyms":["frenzy","agitation","restlessness","delirium (context-dependent)"],"phonetic":"/ˌiːstrəˈzaɪəsɪs/","extraExplanation":["词源上与希腊语 *oistros* 有关，原义可指“牛虻/虻”以及“被虻刺到般的狂躁冲动”。因此它既有寄生虫学/医学的字面用法，也常被借来做文学化的比喻（形容坐立不安、近乎发狂的躁动）。","拼写上 **oestr-**（英式）与 **estr-**（美式/简化）常见于同一词根家族，如 *oestrus/estrus*（发情期）。"]}
{"word":"oestrid","summary":{"en":"Oestrid means a botfly or something related to botflies (family Oestridae).","zh":"oestrid 指虻蝇（虻蝇科昆虫）或与虻蝇有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) A botfly; an insect in the family Oestridae, whose larvae can live as parasites in animals.","zh":"（名词）牛虻蝇/胃蝇（虻蝇科昆虫）；其幼虫常寄生在动物体内。"},"examples":[{"en":"Some oestrids lay eggs on animals, and the larvae develop under the skin.","zh":"有些虻蝇会把卵产在动物身上，幼虫会在皮下发育。"},{"en":"Veterinarians treat livestock infections caused by oestrids.","zh":"兽医会治疗由虻蝇引起的家畜感染。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Relating to botflies (the family Oestridae) or their larvae.","zh":"（形容词）与虻蝇科（Oestridae）或其幼虫有关的。"},"examples":[{"en":"Researchers studied oestrid larvae in wild deer.","zh":"研究人员研究了野鹿体内的虻蝇幼虫。"},{"en":"The report describes oestrid infestation in sheep.","zh":"报告描述了绵羊的虻蝇寄生情况。"}]}],"synonyms":["botfly","warble fly"],"phonetic":"/ˈiːstrɪd/","extraExplanation":["“oestrid”多见于生物学/兽医学语境；日常英语更常说 botfly。","词源与希腊语 oistros 有关，原意与“骚扰、刺痛般的冲动”相关，后来用于指这类令人困扰的寄生昆虫。"]}
{"word":"oestridae","summary":{"en":"Oestridae: the botfly family; flies whose larvae parasitize mammals.","zh":"Oestridae：虻科（botflies），其幼虫多寄生于哺乳动物体内。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies known as botflies, whose larvae live as parasites in mammals (and sometimes humans).","zh":"虻科（也称牛虻蝇/牛虻类中的一支，常译作“胃虻科”）：一类被称为“虻蝇/牛虻蝇（botflies）”的苍蝇，其幼虫常寄生在哺乳动物体内（偶尔也会感染人）。"},"examples":[{"en":"Some species in the Oestridae lay eggs near mammals so the larvae can enter the host.","zh":"虻科（Oestridae）的一些物种会在哺乳动物附近产卵，以便幼虫进入宿主。"},{"en":"Veterinarians often warn livestock owners about botflies (family Oestridae).","zh":"兽医常提醒畜牧养殖者注意虻蝇（虻科 Oestridae）带来的风险。"}]}],"synonyms":["botflies","warble flies"],"phonetic":"/iˈstrɪdi/","extraExplanation":["Oestridae 是昆虫分类学中的“科”（family）名称，常见英文俗名是 botflies（虻蝇/牛虻蝇）。学习时可把它理解为“某一大类虻蝇”。","词源上与希腊语 oistros（gadfly，意为“牛虻/虻”，也有“刺激、狂热”的引申义）有关，因此在英语文学里 gadfly 有时也被用来比喻“不断挑刺、催促变革的人”。"]}
{"word":"oestrin","summary":{"en":"Oestrin is an older term for estrogen, an ovarian hormone related to female reproductive development and menstrual cycles.","zh":"Oestrin 是雌激素（estrogen）的旧称，指与女性生殖发育和月经周期相关的卵巢激素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hormone (or mixture of hormones) once extracted from ovaries; an older term for forms of estrogen, which affect female reproductive development and menstrual cycles","zh":"一种曾从卵巢中提取的激素（或激素混合物）；较旧的用语，通常指雌激素的某些形式，影响女性生殖发育与月经周期"},"examples":[{"en":"In older medical texts, oestrin was described as an ovarian hormone that regulates the menstrual cycle.","zh":"在较早的医学文献中，oestrin 被描述为一种调节月经周期的卵巢激素。"},{"en":"Modern sources usually use the term estrogen instead of oestrin.","zh":"现代资料通常用 estrogen（雌激素）而不是 oestrin。"}]}],"synonyms":["estrogen","oestrogen","estrin (older)"],"phonetic":"/ˈɛstrɪn/","extraExplanation":["“oestrin”是较旧、较少使用的术语；现在更常见、更标准的说法是“estrogen”（美式拼写）或“oestrogen”（英式拼写）。","词首的“oe-”多见于英式/传统拼写（如 oestrogen）；在美式英语中常简化为“e-”（estrogen）。","该词常出现在早期内分泌学与妇科相关文献中；在现代医学沟通中一般建议使用“estrogen/estradiol”等更具体的术语。"]}
{"word":"oestrins","summary":{"en":"Oestrins are estrogens—female sex hormones important for the menstrual cycle and reproduction.","zh":"Oestrins 指雌激素——与月经周期与生殖功能密切相关的女性性激素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oestrin: a group of female sex hormones (estrogens) produced mainly in the ovaries; they help regulate the menstrual cycle and support pregnancy and other reproductive functions.","zh":"oestrin 的复数：一类女性性激素（即雌激素/estrogens），主要由卵巢分泌；用于调节月经周期，并支持妊娠及其他生殖相关功能。"},"examples":[{"en":"Doctors can measure oestrins in blood tests to understand hormone levels.","zh":"医生可以通过血液检查测量 oestrins，以了解激素水平。"},{"en":"Changes in oestrins can affect mood and the menstrual cycle.","zh":"oestrins 的变化可能影响情绪和月经周期。"}]}],"synonyms":["estrogens","oestrogens"],"phonetic":"/ˈiːstrɪnz/","extraExplanation":["“oestrin”是较旧、较少见的用法，常见于英式拼写体系中（oe-）。现代医学写作更常用“estrogen(s)”（美式）或“oestrogen(s)”（英式）。","词头“oestr-”与希腊语“oistros”（意为“狂热/刺激”）有关，历史上用来指与发情期、繁殖相关的状态，因此也出现在“oestrus/oestrous”（发情期/发情的）等词中。"]}
{"word":"oestriol","summary":{"en":"Estriol is a natural estrogen hormone, especially high during pregnancy, often used in prenatal testing.","zh":"雌三醇是一种天然雌激素，孕期水平较高，常用于产前检测与评估。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural form of estrogen (a female sex hormone) produced in large amounts during pregnancy; it is often measured in tests that check pregnancy and fetal health.","zh":"雌激素的一种天然形式（女性性激素）；在怀孕期间会大量产生，常用于与妊娠及胎儿健康相关的检查指标。"},"examples":[{"en":"Doctors may measure estriol levels during pregnancy screening.","zh":"医生可能会在孕期筛查中测量雌三醇水平。"},{"en":"Estriol is one of the main estrogens made by the body, especially in pregnancy.","zh":"雌三醇是人体产生的主要雌激素之一，尤其在怀孕期间更为明显。"}]}],"synonyms":["E3","estrogen (general term)"],"phonetic":"/ˈɛstriˌɔl/","extraExplanation":["雌三醇（estriol）常缩写为E3，是三种主要天然雌激素之一（另外两种常见的是estradiol与estrone）。在孕期，E3与胎盘、胎儿的代谢有关，因此在某些产前筛查中会被纳入指标（例如与其他激素/蛋白一起评估风险）。","词根提示：estr-与“雌激素/发情（estrus）”相关，-iol常见于化学命名中，表示含有醇基（alcohol group）的化合物名称。"]}
{"word":"oestriols","summary":{"en":"Estriol (also spelled oestriol) is a natural estrogen hormone, especially associated with pregnancy.","zh":"雌三醇（英式拼写 oestriol）是一种天然雌激素，尤其与妊娠期相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural estrogen (female sex hormone), especially produced in larger amounts during pregnancy; it is one of the three main human estrogens.","zh":"一种天然雌激素（女性性激素），在怀孕期间产量会明显增加；它是人体三种主要雌激素之一。"},"examples":[{"en":"During pregnancy, estriol levels usually rise.","zh":"怀孕期间，雌三醇的水平通常会上升。"},{"en":"The lab measured estriol as part of a hormone panel.","zh":"实验室把雌三醇作为激素检测组合的一部分进行了测量。"}]}],"synonyms":["estriol","estrogen"],"phonetic":"/ˈɛstriˌɔl/","extraExplanation":["“oestriol”是英式拼写（常见于英联邦），美式更常写作“estriol”。你输入的“oestriols”是复数形式，表示“多种/多个雌三醇（测量值或样本）”。","在医学语境中，雌三醇常出现在与妊娠相关的检查或激素检测讨论里；一般写作不可数名词（estriol），但在研究或化验结果中也会出现复数（estriols）来指多次测量或不同样本的数值。"]}
{"word":"oestrogen","summary":{"en":"Oestrogen is a hormone (or hormone medicine) important for reproduction and many body functions; it’s the British spelling of estrogen.","zh":"oestrogen 指雌激素（或雌激素制剂），与生殖及多种身体功能相关；是 estrogen 的英式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of hormones that help regulate the menstrual cycle and support pregnancy, and that also influence sexual development and many body systems (like bones and the brain).","zh":"雌激素（也称“雌性激素”）：一类帮助调节月经周期、支持妊娠，并影响性发育及多种身体系统（如骨骼与大脑）的激素。"},"examples":[{"en":"Oestrogen levels change during the menstrual cycle.","zh":"雌激素水平会在月经周期中发生变化。"},{"en":"After menopause, oestrogen decreases, which can affect bone health.","zh":"绝经后雌激素下降，可能会影响骨骼健康。"},{"en":"Some birth control pills contain oestrogen.","zh":"一些避孕药含有雌激素。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or treatment that contains this hormone, used for example in hormone therapy.","zh":"（药物/治疗中的）雌激素制剂：含有雌激素的药物或治疗方式，例如用于激素治疗。"},"examples":[{"en":"The doctor prescribed oestrogen to help with severe hot flashes.","zh":"医生开了雌激素治疗来缓解严重的潮热。"},{"en":"She asked about the risks and benefits of taking oestrogen.","zh":"她询问了服用雌激素的风险与益处。"}]}],"synonyms":["estrogen","female sex hormone"],"phonetic":"/ˈiːstrədʒən/","extraExplanation":["“oestrogen”是英式拼写；美式拼写更常见为“estrogen”。两者意思相同。","在日常科普或医学语境中，你也会看到复数“oestrogens/estrogens”，表示“多种雌激素”。","这是医学相关词汇，常出现在更年期（menopause）、避孕（birth control）、激素替代疗法（hormone therapy/HRT）等话题中。"]}
{"word":"oestroid","summary":{"en":"Oestroid (estroid) means a botfly (Oestridae) or something related to botflies.","zh":"oestroid（美式常拼作 estroid）指皮蝇科的蝇（如胃蝇、牛虻等）或与皮蝇科有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) A botfly; a fly in the family Oestridae whose larvae live as parasites in mammals.","zh":"（名词）牛虻/胃蝇等“皮蝇科”（Oestridae）的昆虫；其幼虫常寄生在哺乳动物体内。"},"examples":[{"en":"Some estroids lay eggs on animals, and the larvae later burrow into the host.","zh":"有些皮蝇科昆虫会把卵产在动物身上，幼虫随后会钻入宿主体内。"},{"en":"Cattle can be harmed by estroids if infestations are not treated.","zh":"如果不加治疗，皮蝇科昆虫的寄生会危害牛等家畜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Relating to or characteristic of botflies (family Oestridae).","zh":"（形容词）与皮蝇科（牛虻/胃蝇等）有关的；具有皮蝇科特征的。"},"examples":[{"en":"The veterinarian recognized an estroid larva in the sample.","zh":"兽医在样本中认出了皮蝇科幼虫。"},{"en":"The paper describes estroid parasites in wild deer.","zh":"这篇论文描述了野生鹿的皮蝇科寄生虫。"}]}],"synonyms":["botfly","oestrid","estid (rare)"],"phonetic":"/ˈiːstrɔɪd/","extraExplanation":["“oestroid”是英式拼写，常见于动物学/兽医学语境；美式更常写作“estroid”。","词根“oestr-/estr-”与“oestrus/estrus（发情期）”同源，但“oestroid/estroid”在这里主要指“皮蝇科（Oestridae）”，不要与“steroid（类固醇）”混淆。"]}
{"word":"oestrone","summary":{"en":"Oestrone is a natural estrogen hormone (estrone) in the body, often discussed in menopause and medical hormone therapy.","zh":"Oestrone（雌酮）是一种人体内的天然雌激素，常见于绝经相关讨论及激素治疗的医学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naturally occurring estrogen hormone, produced especially in the ovaries and (after menopause) in body fat, and used medically in hormone therapy.","zh":"雌激素的一种（雌酮），人体内天然存在的激素，主要由卵巢产生；绝经后也可在脂肪组织中生成，并可用于医学上的激素治疗。"},"examples":[{"en":"Oestrone is one of the main estrogens found in the human body.","zh":"雌酮是人体内主要雌激素之一。"},{"en":"After menopause, oestrone often becomes the dominant estrogen.","zh":"绝经后，雌酮常常成为体内占主导的雌激素。"},{"en":"The doctor discussed how oestrone levels can change with age and health conditions.","zh":"医生说明了雌酮水平会如何随年龄和健康状况而变化。"}]}],"synonyms":["estrone","E1"],"phonetic":"/ˈɛstroʊn/","extraExplanation":["拼写提示：\"oestrone\"多见于英式拼写；美式医学文献中更常写作 \"estrone\"。两者指同一种激素。","背景补充：雌激素家族里常见的有三种——雌二醇（estradiol, E2）、雌酮（estrone, E1）、雌三醇（estriol, E3）。日常与临床语境中，它们常用于讨论月经周期、绝经、更年期症状、骨密度以及某些与激素相关的疾病。"]}
{"word":"oestrones","summary":{"en":"Oestrones = plural of oestrone, an estrogen hormone (British spelling).","zh":"Oestrones 是 oestrone（雌酮，英式拼写）的复数，属于雌激素类激素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Oestrones (plural of oestrone) are forms of a naturally occurring hormone in the estrogen group, found in the body—especially in women—and involved in regulating reproductive and other body functions.","zh":"oestrones（oestrone 的复数）指雌激素家族中的一种天然激素形式，存在于人体内（女性更常见），参与调节生殖及其他身体功能。"},"examples":[{"en":"After menopause, oestrone can become the main estrogen in the body.","zh":"绝经后，雌酮（oestrone）可能成为体内主要的雌激素。"},{"en":"The lab report measured levels of oestrones and other estrogens.","zh":"实验报告测量了雌酮（oestrones）和其他雌激素的水平。"}]}],"synonyms":["estrones","estrogens"],"phonetic":"/ˈiːstroʊn/","extraExplanation":["“oestrone”是英式拼写；美式更常写作“estrone”。两者指同一种激素。","雌激素家族常见成员包括：estrone/oestrone（雌酮）、estradiol（雌二醇）、estriol（雌三醇）。在医学或化验语境里常会用复数“oestrones”来泛指测得的雌酮类/雌激素相关指标。"]}
{"word":"oestrous","summary":{"en":"Oestrous means ‘relating to estrus,’ the fertile ‘in heat’ period in female mammals.","zh":"Oestrous 指“与动情/发情期有关的”，即雌性哺乳动物处于可受孕的“发情”时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of female mammals) relating to estrus—the recurring period when an animal is fertile and may be ready to mate; in heat.","zh":"（雌性哺乳动物）与“发情期/动情期”有关的；指动物处于可受孕、可能愿意交配的时期（发情）。"},"examples":[{"en":"The vet explained that the cat was in an oestrous cycle, which can cause restlessness and loud vocalizing.","zh":"兽医解释说这只猫正处在发情周期中，这可能会导致坐立不安和频繁大声叫唤。"},{"en":"Researchers compared hormone levels during the oestrous phase and the non-oestrous phase.","zh":"研究人员比较了发情期与非发情期的激素水平。"},{"en":"Many mammals show clear behavioral changes when they are oestrous.","zh":"许多哺乳动物在发情时会表现出明显的行为变化。"}]}],"synonyms":["estrous","in heat (informal)","oestral (less common)"],"phonetic":"/ˈɛstrəs/","extraExplanation":["“oestrous”是英式拼写；美式更常写作“estrous”。两者含义相同。","该词主要用于兽医学、生物学与动物繁殖相关的正式语境；日常英语里更常说“in heat”。","词根来自希腊语“oistros”，原意与“狂热/刺激”相关，后来用于描述动物在发情期的生理与行为状态。"]}
{"word":"oestrual","summary":{"en":"Oestrual means “related to estrus,” a female mammal’s fertile period; it’s the British spelling of AmE estrous.","zh":"oestrual 意为“与发情期有关的”，是英式拼写；美式更常写作 estrous。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to estrus (the period when a female mammal is fertile and may be receptive to mating).","zh":"与发情期有关的；指雌性哺乳动物处于可受孕、可能愿意交配的时期。"},"examples":[{"en":"The veterinarian explained the dog's oestrual cycle.","zh":"兽医解释了这只狗的发情周期。"},{"en":"Researchers measured oestrual hormones in the lab.","zh":"研究人员在实验室测量了发情相关激素水平。"}]}],"synonyms":["estrous","in estrus"],"phonetic":"/ˈɛstr(u)əl/","extraExplanation":["“oestrual”是英式拼写；美式英语里更常用“estrous”。两者意义相同，主要见于兽医学、生物学和动物繁殖相关语境。","词源与古希腊语有关，原意接近“强烈欲望/热情”，后来在生理学中专指动物的“发情期”。日常口语中很少用于人类。"]}
{"word":"oestruate","summary":{"en":"Oestruate means (especially in British spelling) to be in heat (estrus) or to cause an animal to enter heat.","zh":"oestruate（英式拼写）指动物进入发情期，或使动物进入发情期。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a female mammal) to be in estrus (heat), the period when she can become pregnant.","zh":"（雌性哺乳动物）进入发情期（发情/“热期”），即最容易受孕的阶段。"},"examples":[{"en":"The veterinarian explained that the cat was oestruating and might try to escape to find a mate.","zh":"兽医解释说这只猫正在发情，可能会想逃出去找配偶。"},{"en":"Farmers often watch for signs that cows are oestruating so they can plan breeding.","zh":"农民常常观察母牛是否发情，以便安排配种。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause an animal to enter estrus (heat), especially by using hormones or medical treatment.","zh":"（尤指通过激素或医疗手段）使动物进入发情期。"},"examples":[{"en":"In some breeding programs, hormones may be used to oestruate a group of animals at the same time.","zh":"在一些繁育项目中，可能会用激素让一群动物同步发情。"}]}],"synonyms":["estruate","be in heat","come into heat","go into heat"],"phonetic":"ˈiːstruˌeɪt","extraExplanation":["“oestruate”是英式拼写；美式更常写作“estruate”。两者都来自“oestrus/estrus（发情期）”。","这是偏兽医学/畜牧学的正式用词；日常英语更常说“be in heat（在发情）”。"]}
{"word":"oestruation","summary":{"en":"Oestruation is a (rare) term for the estrus (“heat”) period in female animals.","zh":"Oestruation（较少见）指雌性动物的发情期（动情期）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology, mainly about non-human mammals) the period when a female is in estrus (“heat”) and is most likely to become pregnant.","zh":"（生物学，多指非人类哺乳动物）雌性处于发情期（“发情/发热”）的阶段，此时最容易受孕。"},"examples":[{"en":"The vet explained that oestruation can cause behavioral changes such as restlessness and calling.","zh":"兽医解释说，发情期可能引起行为变化，比如坐立不安和频繁叫唤。"},{"en":"In many species, mating usually happens during oestruation.","zh":"在许多物种中，交配通常发生在发情期。"}]}],"synonyms":["estrus","oestrus","heat (in animals)","estrous cycle"],"phonetic":"/ˌɛstrəˈweɪʃən/","extraExplanation":["“oestruation”是比较少见的拼写/用法，更常见的是“estrus/oestrus”（发情期）或“estrous/oestrous cycle”（动情周期）。","注意不要和“menstruation（月经）”混淆：月经是人类和部分灵长类常见的生理周期；“estrus/oestrus”主要用于描述多数哺乳动物的发情与可受孕时期。","拼写提示：英式拼写常见“oestrus/oestrous”，美式更常见“estrus/estrous”。"]}
{"word":"oestrum","summary":{"en":"Oestrum means a female animal’s fertile “heat” period; more rarely, it can mean intense excitement or frenzy.","zh":"oestrum 指雌性动物的发情期（“发情”）；较少见的用法可指强烈的兴奋或狂热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the period when a female mammal is fertile and ready to mate; heat (also spelled “estrum/estrus”)","zh":"（雌性哺乳动物）发情期；发情（也作 estrum/estrus）"},"examples":[{"en":"The vet explained that the dog was in oestrum, which is why her behavior changed.","zh":"兽医解释说这只狗正处于发情期，所以行为才会有变化。"},{"en":"Farmers often watch for signs of oestrum to plan breeding.","zh":"农民常观察发情迹象来安排配种。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, less common) a state of intense excitement, passion, or frenzy","zh":"（比喻，用法较少）强烈的兴奋、激情或狂热状态"},"examples":[{"en":"In the oestrum of the crowd, it was hard to hear the speaker clearly.","zh":"在人群的狂热中，很难听清演讲者的话。"}]}],"synonyms":["estrus","heat","rut (male animals)","frenzy","ardor"],"phonetic":"/ˈiːstrəm/","extraExplanation":["“oestrum”是较偏英式拼写（oe-），在美式英语中更常见的是“estrus/estrum”。词根与“estrogen（雌激素）”同源，常用于兽医、畜牧与生物学语境。","日常口语里，人们更常说“in heat（发情）”。比喻义（表示狂热/激情）在现代英语中较少见，偏文学或修辞用法。"]}
{"word":"oestrums","summary":{"en":"“Oestrums” is the plural of “oestrum,” meaning periods when female mammals are in heat (estrus); rarely, it can mean a frenzy or burst of excitement.","zh":"“oestrums”是“oestrum”的复数，常指雌性哺乳动物的发情期（动情期）；较少见时可指一阵狂热或强烈兴奋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) periods when a female mammal is in heat and able to become pregnant; the reproductive cycle phase called estrus.","zh":"（复数）雌性哺乳动物的“发情期/动情期”，即能受孕的生殖周期阶段（estrus）。"},"examples":[{"en":"Farmers watch for signs of oestrums in their cows to plan breeding.","zh":"农场主会观察奶牛是否进入发情期，以便安排配种。"},{"en":"The vet explained that irregular oestrums can happen when an animal is under stress.","zh":"兽医解释说，动物在压力下可能会出现不规律的发情期。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, literary) a sudden strong excitement or frenzy.","zh":"（较少见，文学用法）突然的强烈兴奋；狂热；激动。"},"examples":[{"en":"The crowd fell into an oestrum of cheering when the team scored.","zh":"球队进球时，人群陷入一阵狂热的欢呼。"}]}],"synonyms":["estrus","heat","rut (more common for males)","frenzy (figurative)","excitement (figurative)"],"phonetic":"/ˈiːstrəmz/","extraExplanation":["“oestrum(s)”是英式拼写；美式更常写作“estrus”。两者意思相同，指动物的发情/动情期。","词源与希腊语有关，最初与“刺激、狂乱”之意相关，因此在较旧或文学语境中偶尔引申为“狂热、激动”。"]}
{"word":"oestrus","summary":{"en":"Oestrus means the fertile “heat” period in female mammals; it can also (less commonly) mean intense sexual desire.","zh":"oestrus 指雌性哺乳动物的发情期（heat）；也可（较少见）指强烈的性欲/性兴奋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a recurring period in many female mammals when they are fertile and ready to mate; also called “heat.”","zh":"（雌性哺乳动物的）发情期；即“发情/发情热（heat）”，此时可受孕并愿意交配。"},"examples":[{"en":"The vet explained that the dog was in oestrus (in heat).","zh":"兽医解释说这只母狗正在发情（发情期）。"},{"en":"Farmers watch for signs of oestrus to plan breeding.","zh":"农场主会观察发情迹象来安排配种。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a state of strong sexual excitement or desire.","zh":"（较少见）强烈的性兴奋或性欲状态。"},"examples":[{"en":"The novel describes the character’s oestrus as overwhelming and confusing.","zh":"小说描写人物的性冲动强烈而令人困惑。"}]}],"synonyms":["estrus","heat","rut (male animals)"],"phonetic":"/ˈiːstrəs/","extraExplanation":["英式拼写常见为 oestrus，美式更常写作 estrus；两者意思相同。","这个词主要用于生物学、兽医学和畜牧业语境；日常英语更常用 in heat 来表达“发情”。","词源来自希腊语 oistros，原意与“刺激、狂热”相关，后来用于描述动物的发情周期。"]}
{"word":"oestruses","summary":{"en":"“Oestruses” means multiple periods of fertility (“heat”) in female mammals.","zh":"“oestruses”指雌性哺乳动物多次“发情期/发情”的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of oestrus: the period in the reproductive cycle of many female mammals when they are fertile and may accept a male (also called “heat”).","zh":"oestrus 的复数：许多雌性哺乳动物生殖周期中可受孕、并可能接受交配的阶段（也称“发情期/发情”）。"},"examples":[{"en":"In many mammals, females show clear behavioral changes during oestruses.","zh":"在许多哺乳动物中，雌性在多次发情期会表现出明显的行为变化。"},{"en":"The veterinarian tracked the dog’s oestruses to plan breeding safely.","zh":"兽医记录这只狗的发情期，以便安全地安排繁殖。"}]}],"synonyms":["estruses","heats"],"phonetic":"/ˈɛstrəsɪz/","extraExplanation":["“oestrus”是英式拼写；美式更常写作“estrus”。两者意思相同。","日常英语里，人们常用更口语的说法“in heat / on heat（发情）”。","该词多用于兽医学、动物学与繁殖相关语境；用于人类时通常不常见，也可能显得不自然或不礼貌。"]}
{"word":"oeuvre","summary":{"en":"Oeuvre means an artist’s complete body of work, and sometimes a single important work.","zh":"Oeuvre 指某位创作者的全部作品；有时也指一部重要的（代表性）作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"All the works (books, paintings, films, etc.) created by a particular artist, writer, or composer; their complete body of work.","zh":"（某位艺术家、作家、作曲家等的）全部作品；作品总集"},"examples":[{"en":"Researchers studied Shakespeare’s oeuvre to trace changes in his style.","zh":"研究人员研究了莎士比亚的全部作品，以追踪他文风的变化。"},{"en":"Her oeuvre includes novels, essays, and screenplays.","zh":"她的作品总集包括小说、随笔和电影剧本。"}]},{"partOfSpeech":"n.","definition":{"en":"A single work of art, especially one considered important or typical of an artist.","zh":"（尤指重要的或有代表性的）一部作品；一件艺术作品"},"examples":[{"en":"This film is often seen as his finest oeuvre.","zh":"这部电影常被视为他最出色的一部作品。"}]}],"synonyms":["body of work","complete works","collected works","canon"],"phonetic":"/ˈɝːv/","extraExplanation":["“Oeuvre”是法语外来词，在英语写作中常用于艺术、文学、音乐评论等较正式的语境。日常口语里更常说“body of work”或“complete works”。","英语里常把它当作不可数或集合名词来用（the artist’s oeuvre），但在某些评论语境中也会用来指“某一件代表作”（a major oeuvre）。"]}
{"word":"oeuvres","summary":{"en":"“Oeuvres” means the complete works or body of work of an artist, writer, or other creator.","zh":"“oeuvres”指某位创作者的全部作品、作品全集或整体创作成果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The complete works (all the creations) of an artist, writer, or composer; often used to mean someone’s whole body of work.","zh":"（艺术家、作家或作曲家等的）全部作品；常指某人的“整体创作成果/作品全集”。"},"examples":[{"en":"The museum displayed Picasso’s oeuvres from his early sketches to his later paintings.","zh":"博物馆展出了毕加索从早期素描到晚期绘画的全部作品。"},{"en":"Her oeuvres show a clear change in style over the years.","zh":"她的全部作品显示出这些年风格的明显变化。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of works by one person in a particular area (for example, novels, films, or academic writing).","zh":"（某一领域内）同一作者的一系列作品（如小说、电影或学术著作）。"},"examples":[{"en":"In his scientific oeuvres, he often returned to the question of climate change.","zh":"在他的科学著作中，他经常回到“气候变化”这个问题上。"}]}],"synonyms":["works","collected works","body of work","output"],"phonetic":"/ˈʌvərz/","extraExplanation":["“oeuvres”是法语借词“oeuvre”的复数形式，在英文里多用于比较正式或学术的语境，意思相当于“works / collected works”。","拼写里常见的连字“œ”（如 œ）在英文排版中有时会写成“oe”。","发音在英语里通常更接近“OO-vər(z)”，而不是按法语发音。"]}

