{"word":"og","summary":{"en":"OG means “original/authentic” or a respected veteran (“original gangster”) in slang.","zh":"OG 常指“最初/正宗”，也可指某领域受尊敬的“元老”（源自 original gangster）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"original; authentic; from the beginning (often used to show respect or admiration).","zh":"最初的；正宗的；元老级的（常用来表达尊敬或认可）。"},"examples":[{"en":"That restaurant is the OG spot for dumplings in this neighborhood.","zh":"那家店是这个社区最正宗、最早就有的饺子店。"},{"en":"She’s an OG fan—she’s followed the band since their first album.","zh":"她是元老粉——从乐队第一张专辑就开始追了。"}]},{"partOfSpeech":"n.","definition":{"en":"an “original gangster”; a highly respected veteran or pioneer in a group or field (slang).","zh":"“OG”（original gangster 的缩写）；在某个圈子/领域很有资历、很受尊敬的前辈或开创者（俚语）。"},"examples":[{"en":"He’s an OG in the skateboarding scene.","zh":"他是滑板圈的元老级人物。"},{"en":"Ask Maya—she’s the OG here and knows how everything works.","zh":"问问玛雅——她是这里的老前辈，什么流程都懂。"}]}],"synonyms":["original","authentic","classic","veteran","pioneer"],"phonetic":"/ˌoʊˈdʒiː/","extraExplanation":["“OG”最早来自嘻哈文化中的“original gangster”，后来用法扩展为“元老/鼻祖/最正宗的”。在日常口语、社交媒体里常用来夸人或夸事物“很经典、很有资历”。","写法常见为 OG（大写）；口语里读作字母“oh-jee”。使用时注意语境：对不熟的人直接称“OG”可能显得过于随意。"]}
{"word":"ogaire","summary":{"en":"“Ogaire” is not a standard English word; it may be a name or a misspelling (often of “ogre”).","zh":"“ogaire”不是标准英语单词；可能是人名或拼写错误（常见是把“ogre/食人魔”拼错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often a misspelling or a name from another language (e.g., a surname).","zh":"不是标准英语单词；常见于拼写错误或来自其他语言的名字（如姓氏）。"},"examples":[{"en":"I can’t find “ogaire” in an English dictionary—can you share the sentence where you saw it?","zh":"我在英语词典里找不到“ogaire”——你能把它出现的句子发我吗？"},{"en":"“Ogaire” might be a person’s name rather than an English vocabulary word.","zh":"“Ogaire”可能是人名，而不是英语词汇。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) ogre: a large, frightening monster in stories and fairy tales.","zh":"（可能想写的词）ogre：童话或故事里巨大、可怕的怪物（食人魔）。"},"examples":[{"en":"In the fairy tale, the ogre guards the bridge.","zh":"在童话里，食人魔守着那座桥。"},{"en":"Don’t worry—he’s not an ogre; he’s actually very kind.","zh":"别担心——他不是“食人魔”，其实人很友善。"}]}],"synonyms":["(for ogre) monster","(for ogre) brute"],"phonetic":"/oʊˈɡɛr/","extraExplanation":["“ogaire”本身不常见于英语。如果你是在游戏、小说、歌词或社交媒体里看到的，它可能是：\n1）人名/姓氏（拼写因地区或家族而异）；\n2）其他语言的词（例如爱尔兰语、法语等的转写）；\n3）把常见英文单词拼错了（最接近的是 ogre）。\n把原句贴出来，我可以根据上下文帮你准确判断。"]}
{"word":"ogallala","summary":{"en":"Ogallala is a place name in Nebraska and, more commonly, the name of a major U.S. aquifer important for agriculture.","zh":"Ogallala既指内布拉斯加州的地名，也更常指对美国农业至关重要的奥加拉拉含水层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in western Nebraska, USA (Keith County), often mentioned because the Ogallala Aquifer is named after it.","zh":"美国内布拉斯加州西部的小镇（基思县）。著名原因之一是“奥加拉拉含水层（Ogallala Aquifer）”以此地命名。"},"examples":[{"en":"We stopped in Ogallala on our road trip across Nebraska.","zh":"我们横穿内布拉斯加州自驾时在奥加拉拉停了一下。"},{"en":"The museum in Ogallala shares a lot about local ranching history.","zh":"奥加拉拉的博物馆介绍了很多当地牧场文化的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Ogallala Aquifer (also called the High Plains Aquifer), a huge underground water supply beneath parts of the central United States, crucial for farming and irrigation.","zh":"奥加拉拉含水层（也常称“高平原含水层”）：美国中部多州地下巨大的淡水储存层，对农业与灌溉极其重要。"},"examples":[{"en":"Many farms depend on the Ogallala Aquifer for irrigation.","zh":"许多农场依赖奥加拉拉含水层进行灌溉。"},{"en":"Water conservation matters because the Ogallala Aquifer refills very slowly.","zh":"节水很重要，因为奥加拉拉含水层补给速度非常慢。"},{"en":"Researchers study how pumping affects the Ogallala Aquifer over time.","zh":"研究人员研究长期抽水会如何影响奥加拉拉含水层。"}]}],"synonyms":["High Plains Aquifer"],"phonetic":"/ˌoʊɡəˈlælə/","extraExplanation":["“Ogallala”常见于新闻与地理/环境话题，尤其与农业灌溉、地下水、干旱和水资源管理有关。","“Ogallala Aquifer”在中文里常译为“奥加拉拉含水层/蓄水层”。在美国科普文章里也经常直接说“High Plains Aquifer（高平原含水层）”。","名称来源与美国原住民部族名称有关：一般认为与“Oglala（奥格拉拉）拉科塔族”相关；含水层的名字则来自内布拉斯加州的Ogallala小镇。"]}
{"word":"ogam","summary":{"en":"Ogam (more commonly spelled “ogham”) is an ancient Irish script made of strokes carved along an edge, seen on early medieval inscriptions.","zh":"ogam（更常见拼作 ogham）指古爱尔兰的刻划文字，常以沿边刻线的方式出现于中世纪早期的铭文中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also spelled “ogham”) an ancient Irish writing system that uses short lines (strokes) cut along the edge of a stone or piece of wood, used mainly in early medieval Ireland and parts of Britain.","zh":"（也拼作“ogham”）古爱尔兰文字系统，常用刻在石碑或木条边缘的短线（刻痕）来书写，主要见于中世纪早期的爱尔兰及不列颠部分地区。"},"examples":[{"en":"The archaeologist identified the marks as ogam on an early Irish stone.","zh":"考古学家辨认出那块早期爱尔兰石碑上的刻痕是奥甘文字（ogam）。"},{"en":"Many museums in Ireland display stones with ogam inscriptions.","zh":"爱尔兰的许多博物馆都展出带有奥甘铭文（ogam inscriptions）的石碑。"}]}],"synonyms":["ogham","Ogham script","Ogam script"],"phonetic":"ˈoʊəm","extraExplanation":["“ogam/ogham”常被认为与古爱尔兰语中的词有关，具体词源仍有争议。它最常见于墓碑或界标石上，多用来刻人名与家族信息。","学习时注意拼写：现代学术与大众写法里“ogham”更常见；“ogam”属于变体拼写。"]}
{"word":"ogamic","summary":{"en":"“Ogamic” means “related to the Ogham writing system or its inscriptions.”","zh":"“ogamic”意为“与欧甘（Ogham）文字或其铭文有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ogham (also spelled Ogam), an early medieval Irish writing system made of straight strokes cut along the edge of a stone or wood.","zh":"与欧甘文字（Ogham/Ogam）有关的；指一种早期中世纪爱尔兰文字系统，常以直线刻痕刻在石碑或木条边缘。"},"examples":[{"en":"The museum has an ogamic inscription on a standing stone from Ireland.","zh":"博物馆里有一块来自爱尔兰的立石，上面刻着欧甘文字铭文。"},{"en":"Researchers compared ogamic carvings with later Latin-letter records.","zh":"研究人员将欧甘文字刻痕与后来的拉丁字母记录进行比较。"}]}],"synonyms":["Ogham","Ogam","Oghamic"],"phonetic":"/oʊˈɡæmɪk/","extraExplanation":["“Ogamic/ogamic”来自“Ogham/Ogam”，指约公元4—9世纪在爱尔兰及不列颠群岛部分地区使用的刻划文字。它常见于边缘刻字的石碑（多为人名、家族名或领地标记），字形像一组组短线，沿着一条“主干线”排列。","学习时可把它理解为“与欧甘文字/欧甘铭文有关的”形容词；在考古、语言学、凯尔特文化研究的语境中更常见。"]}
{"word":"ogams","summary":{"en":"“Ogams” means inscriptions written in the ancient Irish ogam/ogham script.","zh":"“Ogams”指用古爱尔兰欧甘文字（ogam/ogham）写成的铭文（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ogam/ogham”: an early medieval Irish alphabet/script made of straight lines cut along the edge of stone or wood, often seen on ancient standing stones in Ireland and parts of Britain.","zh":"“ogam/ogham”的复数：一种中世纪早期的爱尔兰字母/文字系统，常以沿石碑或木条边缘刻出的直线刻痕呈现，常见于爱尔兰及不列颠部分地区的古代立石铭文。"},"examples":[{"en":"Archaeologists recorded several ogams on the standing stones near the coast.","zh":"考古学家记录了海岸附近立石上的多处 ogams（欧甘文字铭文）。"},{"en":"The museum exhibit explains how ogams were carved as groups of lines along an edge.","zh":"博物馆展览讲解了 ogams 如何以一组组线条沿边缘刻出。"}]}],"synonyms":["ogham inscriptions","ogam inscriptions","Celtic inscriptions"],"phonetic":"/ˈoʊ.ɡəmz/","extraExplanation":["“Ogam/Ogham（欧甘文字）”也常写作 ogham；在学术和博物馆语境里很常见。多数铭文用于纪念或标记人名、家族名与领地信息，时间多在公元4—9世纪左右。","在日常英语里，这个词比较偏历史/考古/凯尔特文化领域；如果你是在游戏、奇幻文学或纹身图案里看到它，通常也是借用这种古老文字的文化意象。"]}
{"word":"ogan","summary":{"en":"“Ogan” is mainly used as a person’s name in English, not a common dictionary word.","zh":"“Ogan”主要在英语中作为人名使用，并非常见词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name or surname). It’s not a common everyday English vocabulary word, but you may see it as a person’s name (e.g., in news, sports, or social media).","zh":"人名（名字或姓氏）。它不是常见的英语词汇，但你可能在新闻、体育或社交媒体上看到它作为人名出现。"},"examples":[{"en":"Ogan spoke at the conference about climate policy.","zh":"Ogan 在会议上就气候政策发表了讲话。"},{"en":"I got an email from Dr. Ogan.","zh":"我收到了 Ogan 博士的一封邮件。"}]}],"phonetic":"/oʊˈɡɑn/","extraExplanation":["“Ogan”在英语里最常见的用法是专有名词（人名/姓氏），因此没有固定的“词义”可背诵，更多是识别它作为名字出现。","如果你本来想查的是“organ”（器官；风琴；组织机构），那么你可能少打了字母 r：organ /ˈɔrɡən/。你可以确认一下要查哪个词。","“Ogan”也可能在某些语境里是缩写/用户名/地名的一部分；如果你能提供一句原文，我可以按语境解释。"]}
{"word":"oganesson","summary":{"en":"Oganesson is a synthetic, extremely radioactive chemical element (Og), atomic number 118, in the noble gas group.","zh":"奥加内松（Og）是原子序数 118 的人工合成超重放射性元素，归在稀有气体（惰性气体）一族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical element with the symbol Og and atomic number 118; a man-made, extremely radioactive element in the noble gas group.","zh":"化学元素“奥加内松”，元素符号 Og，原子序数 118；人工合成、放射性极强，属于稀有气体（惰性气体）一族。"},"examples":[{"en":"Oganesson (Og) is element 118 on the periodic table.","zh":"奥加内松（Og）是元素周期表中的第 118 号元素。"},{"en":"Because oganesson is highly unstable, scientists can only create a few atoms at a time.","zh":"由于奥加内松非常不稳定，科学家一次只能合成少量原子。"},{"en":"Oganesson is placed with the noble gases, although its behavior may differ from lighter noble gases.","zh":"奥加内松被归入稀有气体，但它的性质可能与更轻的稀有气体不同。"}]}],"synonyms":["Og","element 118"],"phonetic":"/ˌoʊɡəˈnɛsən/","extraExplanation":["“Oganesson（奥加内松）”以核物理学家尤里·奥加涅相（Yuri Oganessian）命名，这是少数以在世科学家命名的元素之一。","它是超重元素，只能在实验室通过核反应人工合成；因为半衰期极短、产量极低，所以没有日常用途，主要用于科学研究。","按元素周期表它属于第 18 族（稀有气体）。不过由于原子序数很大，受相对论效应影响更强，科学家推测它的化学/物理性质可能不像典型稀有气体那样“完全惰性”。"]}
{"word":"ogboni","summary":{"en":"Ogboni is a Yoruba traditional fraternal order in southwestern Nigeria, often associated with councils of elders and cultural authority.","zh":"Ogboni 是约鲁巴人的传统兄弟会/社团，主要见于尼日利亚西南部，常与长老议事与文化权威相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Yoruba fraternal order (often described as a secret society) in southwestern Nigeria, historically linked with elders, political influence, and religious/cultural authority.","zh":"奥格博尼（Ogboni）：尼日利亚西南部约鲁巴人的传统兄弟会/社团（常被称为秘密社团），历史上与长老阶层、政治影响力以及宗教与文化权威有关。"},"examples":[{"en":"In some Yoruba history texts, the Ogboni are described as an influential council of elders.","zh":"在一些约鲁巴历史资料中，Ogboni 被描述为具有影响力的长老议事团。"},{"en":"The novel mentions the Ogboni to show how traditional institutions shaped local politics.","zh":"小说提到 Ogboni，用来展现传统制度如何影响地方政治。"}]}],"synonyms":["Yoruba fraternal order","(traditional) Yoruba society","council of elders (contextual)"],"phonetic":"/oʊɡˈboʊni/","extraExplanation":["“Ogboni”是约鲁巴语文化语境中的专有名词，通常不翻译，只音译或保留原词。不同地区与不同时期对其角色的描述差异很大：既可能被写作传统的长老社团与司法/调解力量，也可能在流行文化里被简化为“神秘组织”。阅读或使用该词时，最好说明你指的是历史制度、宗教文化团体，还是文学/媒体中的形象。","在英文写作中常见拼写为 Ogboni（首字母大写），表示具体组织；也可能见到同根词与相关称呼（如“Ogboni society / Ogboni cult”），其中“cult”在英语里容易带负面色彩，学术语境更常用 “society” 或 “fraternal order”。"]}
{"word":"ogcocephalidae","summary":{"en":"Ogcocephalidae = the batfish family (bottom-dwelling fishes that can “walk” on fins).","zh":"Ogcocephalidae＝蝙蝠鱼科（能用鳍在海底“行走”的底栖鱼类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of unusual deep-sea fishes known as batfishes, which move along the seafloor using modified fins and often have a “lure” to attract prey.","zh":"蝙蝠鱼科：一类外形奇特的深海（或较深海域）底栖鱼类，常用特化的鳍在海底“行走”，并常具有用来引诱猎物的“诱饵”结构。"},"examples":[{"en":"Scientists recorded an Ogcocephalidae species “walking” across the seafloor on its fins.","zh":"科学家记录到一只蝙蝠鱼科的鱼用鳍在海底“行走”。"},{"en":"Members of the Ogcocephalidae are often found on sandy or muddy bottoms.","zh":"蝙蝠鱼科的成员常见于沙质或泥质海底。"}]}],"synonyms":["batfish family"],"phonetic":"/ˌɑɡkoʊˌsɛfəˈlɪdi/","extraExplanation":["“Ogcocephalidae”是生物分类学里的“科”（family）名，常见英文俗名是“batfishes（蝙蝠鱼）”。这里的“蝙蝠”指外形或胸鳍展开像蝙蝠的轮廓，并不是与哺乳动物蝙蝠有关。","这类鱼通常属于鮟鱇鱼目相关类群，很多种类具有类似“钓竿/诱饵”（illicium/esca）的结构，用于引诱猎物靠近。"]}
{"word":"ogcocephalus","summary":{"en":"Ogcocephalus is a scientific genus name for batfishes, bottom-dwelling marine fishes that can “walk” on the seafloor.","zh":"Ogcocephalus 是蝙蝠鱼属的学名，指一类栖息海底、能用鳍在海床上“行走”的海洋鱼类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of marine ray-finned fishes commonly called batfishes (family Ogcocephalidae), found on the seafloor in warm seas; they have a flattened body and “walk” using modified fins.","zh":"一种海洋硬骨鱼属，俗称“蝙蝠鱼”（蝙蝠鱼科 Ogcocephalidae），多生活在温暖海域的海底；身体扁平，可用特化的鳍在海底“行走”。"},"examples":[{"en":"Researchers recorded Ogcocephalus batfishes moving along the seabed with their fin-like “legs.”","zh":"研究人员记录到 Ogcocephalus（蝙蝠鱼属）的蝙蝠鱼用像“腿”一样的鳍沿海底移动。"},{"en":"Some Ogcocephalus species use a small lure to attract prey near the ocean floor.","zh":"某些 Ogcocephalus 属物种会用小型“诱饵”在海底附近引诱猎物。"}]}],"synonyms":["batfish (genus)","batfishes (Ogcocephalus)"],"phonetic":"/ˌoʊɡkoʊsəˈfiːləs/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语里更常说 batfish（蝙蝠鱼）或更具体的物种名。学术写作中通常斜体书写：*Ogcocephalus*；属名首字母大写。","词源上常被解释为来自希腊语成分：*ogkos*（肿块、隆起）+ *kephalē*（头），大意与其“头部/身体形态隆起、扁平”的外形特征相关。"]}
{"word":"ogdoad","summary":{"en":"Ogdoad most commonly means the Egyptian group of eight primeval gods; more rarely, it can mean any group of eight.","zh":"Ogdoad最常指古埃及“八元神/八神组”；较少见时也可泛指“八个一组”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in ancient Egypt) a group of eight gods or beings, often paired as male and female, representing the original forces of the universe.","zh":"（尤指古埃及）“八元神/八神组”：由八位神祇或存在组成的群体，常以男女成对出现，象征宇宙最初的原始力量。"},"examples":[{"en":"In Egyptian mythology, the Ogdoad symbolizes the chaotic waters and darkness before creation.","zh":"在埃及神话中，八元神象征创世之前的混沌之水与黑暗。"},{"en":"The temple inscriptions describe the Ogdoad as the earliest gods worshiped at Hermopolis.","zh":"神庙铭文将八元神描述为赫尔摩波利斯最早被崇拜的神祇。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, any set or group of eight (rare in modern English).","zh":"（更一般）任何“八个一组/八人（物）组合”（现代英语中较少见）。"},"examples":[{"en":"The author arranged the characters into an ogdoad to mirror the story’s eight-part structure.","zh":"作者把人物安排成“八人组”，以呼应故事的八段式结构。"}]}],"synonyms":["group of eight","octad","octonary (rare)"],"phonetic":"/ˈɑɡdoʊæd/","extraExplanation":["“ogdoad”来自希腊语 *ogdoas*（意为“八个一组”）。在埃及语境里常特指赫尔摩波利斯（Hermopolis）的创世神话：四对男女神代表原初状态（如黑暗、无形、无限、深水/混沌等）。","在英语写作中它多见于宗教学、古代史、考古与神话研究；日常语境里很少用来泛指“八个一组”。"]}
{"word":"ogdoads","summary":{"en":"“Ogdoads” means groups of eight, and can also refer to sets of eight deities or beings in specific religious traditions.","zh":"“ogdoads”指“八个一组”的集合；在特定宗教传统中也可指“八位一组的神祇/灵性存在”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Groups or sets of eight things; the plural of “ogdoad.”","zh":"八个一组的事物；“ogdoad（八元组/八位一组）”的复数。"},"examples":[{"en":"In some mathematical texts, numbers are grouped into ogdoads for counting or comparison.","zh":"在一些数学文本中，数字可能被分成“ogdoads（八个一组）”来计数或比较。"},{"en":"The archivist organized the manuscripts into ogdoads to keep the catalog consistent.","zh":"档案管理员把手稿按八份一组（ogdoads）整理，以保持目录一致。"}]},{"partOfSpeech":"n.","definition":{"en":"In certain religious or mythological contexts (especially ancient Egyptian religion and later Gnostic writings), sets of eight deities or spiritual beings.","zh":"在某些宗教/神话语境中（尤指古埃及宗教及后来的诺斯替文献），指八位一组的神祇或灵性存在。"},"examples":[{"en":"Some sources describe primordial powers as organized into ogdoads.","zh":"一些资料会把原初力量描述为以“ogdoads（八神组）”的形式组织。"},{"en":"The article compares the Egyptian Ogdoad tradition with later Gnostic ogdoads.","zh":"这篇文章把埃及的“八神组（Ogdoad）”传统与后来的诺斯替“ogdoads”作比较。"}]}],"synonyms":["groups of eight","sets of eight","octets (often used in music/other contexts)"],"phonetic":"/ˈɑɡ.doʊ.ædz/","extraExplanation":["“ogdoad”来自希腊语 ogdoas，意为“八个组成的集合”。英语里较少见，常出现在宗教史、古代神话研究（如埃及赫尔摩波利斯的“八神组”）或较正式的学术写作中。","日常英语里更常说 “a group of eight / a set of eight / eightfold group”。"]}
{"word":"ogdoas","summary":{"en":"Likely a misspelling of “Ogdoad”: the eight-god group in ancient Egyptian religion.","zh":"很可能是“Ogdoad”的拼写错误：古埃及宗教中的“八神组”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“ogdoas” is not a standard English word; it is most likely a misspelling of “Ogdoad,” a term from ancient Egyptian religion meaning a group of eight gods.","zh":"“ogdoas”不是标准英语单词；它很可能是“Ogdoad”的拼写错误，指古埃及宗教中的“八神组”（八位神组成的一组）。"},"examples":[{"en":"I couldn’t find “ogdoas” in a dictionary, but “Ogdoad” refers to eight Egyptian deities.","zh":"我在词典里找不到“ogdoas”，但“Ogdoad”指的是八位埃及神祇。"},{"en":"In some texts, the Ogdoad represents the original forces before creation.","zh":"在一些文献中，Ogdoad象征创世之前的原初力量。"}]}],"synonyms":["Hermopolitan Ogdoad","the Eight (in Egyptian mythology)"],"phonetic":"/ˈɑɡdoʊˌæd/","extraExplanation":["“Ogdoad”来自希腊语“ogdoas”（意为“八个一组/八分组”），常用于讨论埃及赫尔莫波利斯（Hermopolis）神学体系：八位神通常以四对（男女成对）出现，象征混沌之水、黑暗、无限、隐秘等原初概念。","如果你本来想查的是别的词（比如人名、游戏ID、缩写），告诉我你看到它的上下文句子，我可以更准确地解释。"]}
{"word":"ogee","summary":{"en":"“Ogee” means an S-shaped double curve, especially in architectural moldings and decorative edges.","zh":"“Ogee”指一种S形的双曲线轮廓，常见于建筑线脚、装饰边缘与拱形设计中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A curved, S-shaped molding or profile made from two opposite curves; often used in architecture, furniture, and design.","zh":"（建筑/家具/设计中的）S形曲线；由一凸一凹两段相反曲线组成的线脚/轮廓（常称“波形线脚”或“鹅颈线”）。"},"examples":[{"en":"The cabinet doors have an ogee edge that gives them a classic look.","zh":"橱柜门边做了“ogee”波形线脚，看起来很经典。"},{"en":"You can see an ogee curve in the crown molding near the ceiling.","zh":"天花板附近的顶角线条里可以看到一种S形的ogee曲线。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an ogee; S-shaped with a double curve.","zh":"呈S形双曲线的；具有ogee曲线轮廓的。"},"examples":[{"en":"The designer chose an ogee arch for the entryway.","zh":"设计师为入口选择了一个ogee形拱门。"},{"en":"Ogee brackets are common in traditional interior styles.","zh":"传统室内风格里常见ogee形托架。"}]}],"synonyms":["S-curve","cyma"],"phonetic":"/oʊˈdʒiː/","extraExplanation":["“Ogee”常见于建筑与装饰术语：例如 ogee molding（波形线脚/装饰线条）、ogee edge（S形刀口/边缘）、ogee arch（尖拱的一种变体，顶部呈双曲线交会，常见于哥特与伊斯兰风格影响的建筑）。","词源上来自法语（早期也与中世纪建筑术语有关），在英语里多用于专业或描述性场景；日常口语不太常说。"]}
{"word":"ogeed","summary":{"en":"Ogee means an S-shaped curve, especially a decorative molding/profile in architecture; it can also describe something with that shape.","zh":"Ogee 指一种 S 形（反曲线）曲线，常用于建筑装饰线脚；也可作形容词表示“呈这种形状的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an S-shaped curve, especially a molding/profile used in architecture and design (also called a “cyma”).","zh":"（尤指建筑与设计中的）S形曲线；反曲线（也指一种线脚/装饰线条，亦称 cyma）。"},"examples":[{"en":"The window frame has an ogee molding along the edge.","zh":"窗框边缘有一条 ogee 线脚。"},{"en":"In the drawing, the arch uses an ogee curve instead of a simple circle.","zh":"在这张图里，拱形用了 ogee 曲线，而不是简单的圆弧。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the shape of an ogee curve (S-shaped).","zh":"呈 ogee（S形/反曲线）形状的。"},"examples":[{"en":"They chose an ogee arch for a more decorative look.","zh":"他们选用了 ogee 形拱门，让外观更具装饰性。"}]}],"synonyms":["S-curve","cyma","molding"],"phonetic":"/oʊˈdʒiː/","extraExplanation":["你输入的“ogeed”不是常见英文单词，最接近、最常见的相关词是 **ogee**（上面给出释义）。如果你本来想写的是 **ogled**（盯着看/色眯眯地看）或别的词，也告诉我你的上下文句子，我可以帮你准确匹配。","**ogee** 一词源自法语/拉丁语传统的建筑术语，常见于建筑、木工、室内装饰、图案设计等语境。"]}
{"word":"ogees","summary":{"en":"“Ogees” means multiple S-shaped curves used in design and architecture.","zh":"“ogees”指多个用于建筑与设计中的 S 形曲线（凹凸相接的弧线）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ogee: an S-shaped curve made of one concave and one convex arc, often used in architecture and design (for moldings, arches, and profiles).","zh":"ogee 的复数：一种 S 形曲线，由一段凹弧与一段凸弧连接而成，常见于建筑与设计（如线脚、拱形与轮廓造型）。"},"examples":[{"en":"The cabinet doors have ogees along the edges for a more classic look.","zh":"这些橱柜门的边缘做了 ogee（S 形线脚），看起来更古典。"},{"en":"In the old church, the window frames feature small ogees in the stonework.","zh":"在那座老教堂里，窗框的石雕上有一些小的 ogee（S 形）造型。"}]}],"synonyms":["S-curve","molding (in context)","profile (in context)"],"phonetic":"/oʊˈdʒiː/","extraExplanation":["“ogee”常用于建筑与木工/家具领域：例如“ogee molding（S形线脚）”“ogee arch（尖拱的S形轮廓）”。在图纸或产品说明里，你可能会看到“ogees”表示多个S形轮廓/线脚。","词源上与法语/中世纪建筑术语有关，常与哥特式或传统装饰风格联系在一起。"]}
{"word":"ogenesis","summary":{"en":"“-ogenesis” means “the process of origin/formation/development.”","zh":"“-ogenesis”表示“……的起源/形成/发育过程”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(scientific combining form, usually written “-ogenesis”) the origin, formation, or development of something; the process by which something is produced or comes into being.","zh":"（科学构词成分，通常写作“-ogenesis”）……的起源、形成或发育；……生成/产生的过程。"},"examples":[{"en":"Carcinogenesis is the process by which normal cells become cancer cells.","zh":"Carcinogenesis（致癌发生）指正常细胞变成癌细胞的过程。"},{"en":"Embryogenesis describes how an embryo forms and develops.","zh":"Embryogenesis（胚胎发生）描述胚胎如何形成并发育。"},{"en":"Researchers study pathogenesis to understand how diseases develop.","zh":"研究人员研究 pathogenesis（发病机制）来了解疾病如何发生发展。"}]}],"synonyms":["formation","development","origin","production","generation"],"phonetic":"/ˌoʊdʒəˈnɛsɪs/","extraExplanation":["“ogenesis”本身很少单独使用；更常见的形式是后缀/构词成分“-ogenesis”。它来自希腊语词根 genesis（意为“出生、起源、生成”）。中间的 “-o-”常是英语（尤其医学/生物学术语）里的连接元音，用来让词更好读，比如 carcin-o-genesis。"]}
{"word":"ogenetic","summary":{"en":"“Ogenetic” means related to egg-cell formation and development (oogenesis).","zh":"“ogenetic”指与卵细胞的形成与发育有关（卵子发生）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the formation and development of egg cells (ova); connected with oogenesis.","zh":"与卵细胞（卵子）的形成与发育有关的；与卵子发生（oogenesis）相关的。"},"examples":[{"en":"Researchers studied ogenetic stages to understand how eggs mature.","zh":"研究人员研究卵子发生的各个阶段，以了解卵子如何成熟。"},{"en":"Some genes are active only during ogenetic development.","zh":"有些基因只在卵子发生的发育过程中活跃。"}]}],"synonyms":["oogenetic","oogonetic","oogenic"],"phonetic":"/ˌoʊdʒəˈnɛtɪk/","extraExplanation":["“ogenetic”在学术写作中常见为“oogenetic”（也写作“oogonetic”），都源自“oo-（卵）+ genetic（生成/发育）”。在生物学语境里，它通常与“oogenesis（卵子发生）”“oocyte（卵母细胞）”等术语一起出现。"]}
{"word":"ogganition","summary":{"en":"Organization means either a group formed for a purpose or the act/skill of arranging things in an orderly way.","zh":"Organization 既可指“机构/组织”，也可指“组织安排的能力或过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group (such as a company, school, or charity) formed for a particular purpose.","zh":"为特定目的而成立的团体或机构（如公司、学校、慈善组织）。"},"examples":[{"en":"She works for an international organization that helps refugees.","zh":"她在一个帮助难民的国际组织工作。"},{"en":"The organization raised money for local hospitals.","zh":"该组织为当地医院筹集了资金。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or skill of arranging things in an orderly, efficient way; being well-planned.","zh":"把事物有条理、高效地安排好的行为或能力；规划与条理性。"},"examples":[{"en":"Good organization makes studying much easier.","zh":"良好的组织安排会让学习轻松很多。"},{"en":"The event succeeded because of careful organization.","zh":"活动成功是因为周密的组织安排。"}]}],"synonyms":["institution","group","association","company","arrangement","planning","coordination"],"phonetic":"/ˌɔrɡənəˈzeɪʃən/","extraExplanation":["你输入的“ogganition”很可能是拼写错误，正确拼写是 organization（美式）/ organisation（英式）。","organization 也常指“结构/体系”，例如：the organization of the brain（大脑的结构/组织方式）。","常见搭配：nonprofit organization（非营利组织）、international organization（国际组织）、get organized（变得有条理）、organizational skills（组织能力）。"]}
{"word":"ogham","summary":{"en":"Ogham is an ancient Irish writing system, often carved on stones, used in early medieval times.","zh":"Ogham（欧甘文字）是一种古爱尔兰文字体系，常刻在石碑上，主要用于中世纪早期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Irish alphabet/script, usually carved as lines and notches on stone or wood, used mainly in early medieval Ireland and parts of Britain","zh":"欧甘文字（古爱尔兰字母/文字体系），常以线条与刻痕刻在石头或木头上，主要用于中世纪早期的爱尔兰及不列颠部分地区"},"examples":[{"en":"The museum has a stone with an Ogham inscription from about the 5th century.","zh":"博物馆里有一块刻有欧甘文字铭文的石碑，大约来自5世纪。"},{"en":"Researchers use Ogham to study early Irish names and family lines.","zh":"研究者利用欧甘文字来研究早期爱尔兰的人名与家族谱系。"}]}],"synonyms":["Ogham alphabet","Ogham script","ogam"],"phonetic":"ˈɑɡəm","extraExplanation":["“Ogham”有时也写作“ogam”。它的文字特征是把一组短线刻在一条“主干线”（常是石碑边缘）两侧或穿过主干线，用线的数量与位置来表示不同的字母。","欧甘文字常见于纪念碑与墓碑，多用于记录人名、家族名和领地信息；因此在历史语言学与考古学中很重要。","在现代文化中，欧甘文字也会出现在凯尔特文化相关的艺术、纹身与奇幻作品中，但学习时要区分学术考古用法与现代“装饰/象征”用法。"]}
{"word":"oghamic","summary":{"en":"Oghamic means “related to Ogham,” an early Irish script used for inscriptions.","zh":"oghamic 表示“与欧甘文有关”，欧甘文是一种早期爱尔兰刻写文字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ogham, an early medieval Irish writing system used mainly for inscriptions (often carved on stone or wood).","zh":"与欧甘文（Ogham）有关的；指一种早期中世纪爱尔兰的文字系统，主要用于刻写铭文（常刻在石头或木头上）。"},"examples":[{"en":"The museum displays oghamic inscriptions on standing stones.","zh":"博物馆展出了立石上的欧甘文刻铭。"},{"en":"Researchers are studying an oghamic stone found near the old burial ground.","zh":"研究人员正在研究一块在旧墓地附近发现的欧甘文刻石。"},{"en":"Her thesis compares oghamic writing with later Irish manuscripts.","zh":"她的论文比较了欧甘文字与后来的爱尔兰手稿。"}]}],"synonyms":["Ogham","Ogham-related"],"phonetic":"/oʊˈɡæmɪk/","extraExplanation":["“Ogham（欧甘文）”大约在公元4—7世纪间使用，常见于爱尔兰及不列颠群岛部分地区。文字通常沿着石头棱边刻出一条“主干线”，再用短线刻痕表示字母，因此看起来像一排排刻痕。","在现代英语里，oghamic 主要用于考古、语言学与历史语境中；日常生活中很少用。"]}
{"word":"oghamist","summary":{"en":"An oghamist is a specialist who studies or reads Ogham inscriptions.","zh":"oghamist 指研究或解读欧甘文字（欧甘铭文）的专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, deciphers, or specializes in Ogham (an early medieval Irish writing system), especially as used on stone inscriptions.","zh":"研究、解读或专门从事欧甘文字（中世纪早期爱尔兰的一种书写系统）的人，尤指研究石刻铭文的人。"},"examples":[{"en":"The archaeologist consulted an oghamist to read the weathered letters on the standing stone.","zh":"考古学家请来一位欧甘文字专家，解读立石上风化的字迹。"},{"en":"As an oghamist, she compares different Ogham inscriptions to date a site more accurately.","zh":"作为欧甘文字研究者，她对比不同的欧甘铭文，以更准确地为遗址断代。"}]}],"synonyms":["Ogham scholar","Ogham specialist"],"phonetic":"/ˈɑɡəmɪst/","extraExplanation":["“Ogham”常译作“欧甘文字/欧甘字母”，主要见于爱尔兰及不列颠群岛部分地区的石碑刻字，常用来刻人名、家族名或领地信息。","“-ist”是英语里常见的后缀，表示“从事某领域的人/研究者”（如 linguist 语言学家、scientist 科学家），因此 oghamist 就是“研究 Ogham 的人”。"]}
{"word":"oghamists","summary":{"en":"Oghamists are people who study or use the ancient Irish Ogham writing system.","zh":"Oghamists 指研究或使用古爱尔兰欧甘文字系统的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, reads, deciphers, or uses Ogham (an early medieval Irish alphabet often carved on stone or wood).","zh":"研究、阅读、破译或使用欧甘文（Ogham；一种中世纪早期爱尔兰字母表，常刻在石头或木头上）的人。"},"examples":[{"en":"The museum invited oghamists to help interpret the inscriptions on the stone pillar.","zh":"博物馆邀请欧甘文研究者来协助解读石柱上的铭文。"},{"en":"As an amateur oghamist, she practiced identifying letters carved along the edge of stones.","zh":"作为一名业余欧甘文研究者，她练习辨认沿着石头边缘刻出的字母。"}]}],"synonyms":["Ogham scholar","Ogham specialist","epigrapher (in context)","runologist (roughly similar field)"],"phonetic":"/ˈɑːɡəmɪsts/","extraExplanation":["“Ogham（欧甘文）”主要见于爱尔兰与苏格兰部分地区的早期铭刻（约公元4–9世纪）。字母常以一条“主干线”为基准，在其两侧刻出短划来表示不同字母，因此很多铭文出现在石碑的棱边。","“oghamists”是复数形式；单数是“oghamist”。在学术语境中也可能见到“Ogham scholar / Ogham specialist”等更常见说法。"]}
{"word":"oghams","summary":{"en":"Oghams = inscriptions written in the ogham script, an early Irish alphabet often carved on stone.","zh":"Oghams = 用奥甘文字书写的铭文/刻文；奥甘文字是早期爱尔兰字母体系，常刻在石碑上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Oghams are examples of the ogham script—an early medieval alphabet used mainly to write Old Irish, often carved as straight-line marks on stone or wood.","zh":"Oghams 指奥甘文字（ogham script）的实例——一种中世纪早期的字母体系，主要用于书写古爱尔兰语，常以直线刻痕刻在石头或木头上。"},"examples":[{"en":"Archaeologists found oghams carved on a standing stone in Ireland.","zh":"考古学家在爱尔兰的一块立石上发现了刻着的奥甘文字。"},{"en":"The museum label explains how to read the oghams along the edge of the stone.","zh":"博物馆的说明牌解释了如何沿着石头边缘阅读这些奥甘文字。"},{"en":"Some fantasy novels mention oghams to create an ancient Celtic atmosphere.","zh":"一些奇幻小说会提到奥甘文字，用来营造古老凯尔特的氛围。"}]}],"synonyms":["ogham inscriptions","ogham script","ogam"],"phonetic":"/ˈɑːɡəm/","extraExplanation":["Ogham（也常拼作 ogam）大约在公元4—6世纪使用最广，常见于爱尔兰与不列颠群岛的碑刻。字形特点是以一条“基线”（多为石碑棱边）为参照，在其两侧或横穿刻出短线组合来表示字母。","在学术与博物馆语境里，单数常用 an ogham / the ogham script；复数用 oghams 指“多处碑刻/多条奥甘铭文”。"]}
{"word":"oghuz","summary":{"en":"Oghuz refers to a major historical Turkic tribal group and, by extension, to the related Oghuz branch of Turkic languages.","zh":"Oghuz 指中亚历史上重要的突厥部落集团“乌古斯”，也可引申指突厥语族中的“乌古斯语支”及相关文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major historical group (confederation) of Turkic tribes from Central Asia, whose descendants include several modern peoples such as Turks, Azerbaijanis, and Turkmens","zh":"乌古斯人/乌古斯部落联盟：中亚历史上重要的突厥语族部落集团，其后裔与现代的土耳其人、阿塞拜疆人、土库曼人等民族有密切渊源"},"examples":[{"en":"The Seljuk Empire was founded by rulers from the Oghuz tribes.","zh":"塞尔柱帝国由乌古斯部落出身的统治者建立。"},{"en":"Many modern Turkic languages trace part of their history to the Oghuz branch.","zh":"许多现代突厥语族语言的历史可追溯到乌古斯语支。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Oghuz people or to the Oghuz branch of Turkic languages (often used in phrases like “Oghuz Turks” or “Oghuz languages”)","zh":"乌古斯的：与乌古斯人有关，或指突厥语族中的乌古斯语支（常见于“Oghuz Turks/乌古斯突厥人”“Oghuz languages/乌古斯语支语言”等搭配）"},"examples":[{"en":"Turkish is often classified as an Oghuz language.","zh":"土耳其语常被归类为乌古斯语支语言。"},{"en":"The museum has an exhibit on Oghuz culture and migration.","zh":"博物馆有一个关于乌古斯文化与迁徙的展览。"}]}],"synonyms":["Oghuz Turks","Oghuz Turkic"],"phonetic":"/ˈoʊɡʊz/","extraExplanation":["“Oghuz”在历史与语言学语境里很常见：一方面指中世纪时期的突厥部落联盟（常说“Oghuz Turks”），另一方面也用于语言分类（“Oghuz branch”），大致涵盖土耳其语、阿塞拜疆语、土库曼语等相关语言。","英文写法有时会见到拼写变体（如 Ghuzz），多出现在较早的史学或翻译文献中。"]}
{"word":"ogival","summary":{"en":"Ogival means “pointed-arch shaped” (common in Gothic architecture) or “relating to an ogive curve/graph.”","zh":"ogival 指“尖拱形的”（常见于哥特式建筑），也可指“与 ogive 曲线/累积曲线有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a pointed arch (an ogive), especially common in Gothic architecture.","zh":"（尤指哥特式建筑中）呈尖拱形的；具有尖拱（ogive）形状的。"},"examples":[{"en":"The cathedral’s windows are ogival, ending in a sharp point at the top.","zh":"这座大教堂的窗户是尖拱形的，顶部收成一个尖点。"},{"en":"Gothic builders often preferred ogival arches because they could rise higher and look lighter.","zh":"哥特式建造者常偏好尖拱，因为它们能建得更高、视觉上更轻盈。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to an ogive, such as a pointed-arch curve in geometry or a cumulative frequency graph in statistics.","zh":"与 ogive（尖拱曲线/累积曲线）相关的（如几何中的尖拱曲线或统计中的累积频数曲线）。"},"examples":[{"en":"The report included an ogival curve to show cumulative test scores.","zh":"报告中包含了一条累积曲线（ogive）来展示测试分数的累计情况。"},{"en":"In geometry class, we sketched an ogival form based on two intersecting arcs.","zh":"在几何课上，我们根据两段相交的圆弧画出了一个尖拱形。"}]}],"synonyms":["pointed-arch","ogive-shaped","Gothic (in architectural context)"],"phonetic":"/oʊˈdʒaɪvəl/","extraExplanation":["“ogival”来自法语 ogive，常与哥特式建筑联系最紧密：尖拱（pointed arch）是哥特风格的标志之一。它不仅是审美选择，也有结构优势：更容易把重量向下传递到柱子和扶壁上，从而做出更高的拱顶和更大的窗。","统计学里的“ogive（累积曲线）”和建筑里的“ogive（尖拱）”是同一个词在不同领域的用法。学习时可以记成：都和“逐渐上升/拱起的曲线形状”有关。","相关词：ogive（n. 尖拱；累积曲线），pointed arch（尖拱），Gothic（哥特式的）。文学/艺术评论中也会用 ogival 来描述具有“尖拱般轮廓”的窗、门或装饰图案。"]}
{"word":"ogive","summary":{"en":"An ogive is most commonly a cumulative frequency (or percentage) curve in statistics; it can also mean a pointed arch shape in architecture.","zh":"ogive 最常指统计中的累积频数（或累积百分比）曲线；在建筑中也可指尖拱（尖形拱）轮廓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(statistics) A curve (or graph) that shows cumulative frequencies or cumulative percentages.","zh":"（统计）累积频数（或累积百分比）曲线图；累积曲线。"},"examples":[{"en":"The ogive shows that about 70% of students scored below 80.","zh":"从这条 ogive（累积曲线）可看出，大约 70% 的学生成绩低于 80 分。"},{"en":"We used an ogive to estimate the median from grouped data.","zh":"我们用 ogive（累积曲线）从分组数据中估计中位数。"}]},{"partOfSpeech":"n.","definition":{"en":"(architecture) A pointed arch or a pointed, arch-like shape.","zh":"（建筑）尖拱；尖形拱状结构（或轮廓）。"},"examples":[{"en":"The cathedral doorway is framed by an ogive arch.","zh":"大教堂的门洞由尖拱（ogive）构成边框。"},{"en":"In Gothic design, the ogive shape appears repeatedly in windows and vaults.","zh":"在哥特式设计中，尖拱形（ogive）反复出现在窗与穹顶结构里。"}]}],"synonyms":["cumulative frequency curve","cumulative distribution curve","pointed arch"],"phonetic":"/oʊˈdʒaɪv/","extraExplanation":["词源上来自法语/中世纪拉丁语，原意与“尖端、尖形”有关，因此在建筑里指“尖拱”，在统计里则借用“向上累积形成的曲线轮廓”这一形象来命名。","在统计语境里，ogive 常与“histogram（直方图）”“frequency polygon（频率多边形）”一起出现；ogive 强调“累计到某一界限为止”的总量或比例。"]}
{"word":"ogived","summary":{"en":"“Ogived” means shaped like an ogive—a pointed arch or pointed curve.","zh":"“Ogived”表示“呈ogive（尖拱/尖形曲线）形状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an ogive (a pointed arch or a pointed, curved form).","zh":"呈尖拱形的；呈“ogive（尖拱/尖形曲线）”形状的。"},"examples":[{"en":"The cathedral’s windows are ogived, ending in a sharp point at the top.","zh":"这座大教堂的窗户是尖拱形的，顶部收成一个尖点。"},{"en":"In the diagram, the ogived curve rises quickly and then levels off.","zh":"在图表中，这条尖形曲线先快速上升，然后趋于平缓。"}]}],"synonyms":["pointed-arched","ogival","pointed"],"phonetic":"/oʊˈdʒaɪvd/","extraExplanation":["“Ogived”来自名词“ogive”，常见于建筑（哥特式尖拱、窗、门洞等）和统计/制图（ogive curve，累计频数曲线）语境。","不要和“ogee（S形曲线）”混淆：ogive强调“尖拱/尖顶”的轮廓，而ogee更像上下相反的两段弧线拼成的S形。"]}
{"word":"ogives","summary":{"en":"“Ogives” is the plural of “ogive”: either a pointed Gothic arch shape or a cumulative frequency graph in statistics.","zh":"“ogives”是“ogive”的复数：可指建筑中的尖拱形，也可指统计学中的累计频数（百分比）曲线图。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pointed arch shape, especially one formed by two curved lines meeting at a point (common in Gothic architecture).","zh":"（尤指哥特式建筑中的）尖拱形；由两条弧线在顶端相交形成的尖形拱。"},"examples":[{"en":"The cathedral’s windows are framed by tall ogives.","zh":"大教堂的窗户由高耸的尖拱形拱框围住。"},{"en":"Gothic builders often used ogives to create a sense of height.","zh":"哥特式建造者常用尖拱来营造高度感。"}]},{"partOfSpeech":"n.","definition":{"en":"In statistics, a graph of cumulative frequency (or cumulative percentage), often used to find medians and percentiles.","zh":"（统计学）累计频数曲线图（或累计百分比曲线图），常用于求中位数与百分位数。"},"examples":[{"en":"We drew ogives to compare the test score distributions of two classes.","zh":"我们画了累计曲线图来比较两个班的成绩分布。"},{"en":"From the ogive, you can estimate the 75th percentile quickly.","zh":"从累计曲线图上你可以很快估计第75百分位数。"}]}],"synonyms":["pointed arch","cumulative frequency curve","cumulative distribution curve"],"phonetic":"/ˈoʊdʒaɪv/","extraExplanation":["“ogives”是“ogive”的复数形式；单数读作 /ˈoʊdʒaɪv/。","该词来自法语 ogive；在建筑语境中常与“Gothic（哥特式）”“pointed arch（尖拱）”一起出现；在统计语境中常与“cumulative frequency（累计频数）”一起出现。"]}
{"word":"oglala","summary":{"en":"Oglala most commonly refers to the Oglala Lakota people (a Lakota band) or, by extension, their reservation area in South Dakota.","zh":"Oglala 通常指奥格拉拉拉科塔人（拉科塔族的一个分支），也可引申指他们在南达科他州的保留地区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a band (subgroup) of the Lakota people (part of the Sioux), known as the Oglala Lakota, originally from the Great Plains of North America","zh":"拉科塔族（苏族的一支）中的一个部族（分支），称为奥格拉拉拉科塔人，历史上主要生活在北美大平原地区"},"examples":[{"en":"Crazy Horse was a famous leader of the Oglala Lakota.","zh":"“疯马”（Crazy Horse）是奥格拉拉拉科塔人的著名领袖。"},{"en":"She is researching Oglala history and oral traditions.","zh":"她正在研究奥格拉拉的历史与口述传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Oglala Lakota reservation in South Dakota, USA (often referring to the Pine Ridge Reservation area)","zh":"美国南达科他州的奥格拉拉拉科塔保留地（常指松岭保留地 Pine Ridge Reservation 一带）"},"examples":[{"en":"He works at a school on the Oglala reservation.","zh":"他在奥格拉拉保留地的一所学校工作。"},{"en":"Many families in Oglala maintain strong community ties.","zh":"奥格拉拉的许多家庭保持着紧密的社区联系。"}]}],"synonyms":["Oglala Lakota","Oglala Sioux (common but broader/less precise)","Oglála (diacritic spelling sometimes seen)"],"phonetic":"/oʊˈɡlɑːlə/","extraExplanation":["“Oglala”通常作为专有名词使用，常见搭配是“Oglala Lakota”（奥格拉拉拉科塔人）或“Oglala Sioux Tribe”（奥格拉拉苏族部落组织名称）。在写作与交流中，使用群体自称（如“Oglala Lakota”）往往更尊重、更准确。","与之相关的历史地点包括Pine Ridge Reservation（松岭保留地）以及19世纪美洲原住民历史中的重要人物与事件。阅读资料时，注意区分“Sioux（苏族）”这一较大的统称与具体分支（Dakota / Lakota / Nakota）。"]}
{"word":"ogle","summary":{"en":"Ogle means to stare at someone or something in an obvious, often rude or sexually suggestive way; it can also mean such a look.","zh":"Ogle 指明显地盯着人或物看，常带无礼或性暗示；也可指这种“盯看”的眼神。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to look at someone or something in a very noticeable way, often with sexual interest or in an impolite, intrusive way","zh":"（尤指带有性意味地）盯着看；色眯眯地看（常含无礼、冒犯的感觉）"},"examples":[{"en":"He kept ogling her on the subway, which made her uncomfortable.","zh":"他在地铁上一直盯着她看，让她很不舒服。"},{"en":"Tourists were ogling the celebrity outside the hotel.","zh":"游客们在酒店外盯着那位名人看。"}]},{"partOfSpeech":"n.","definition":{"en":"a long, obvious look, often showing strong interest (sometimes sexual)","zh":"长时间、很明显的注视（有时带性意味）"},"examples":[{"en":"She gave the new phone an ogle before putting it back.","zh":"她把新手机仔细打量了一番，然后放回去。"},{"en":"He tried to hide his ogles, but it was obvious.","zh":"他想掩饰自己盯看的眼神，但还是很明显。"}]}],"synonyms":["stare","gawk","leer","eye"],"phonetic":"/ˈoʊɡəl/","extraExplanation":["“ogle”通常带负面语气：不仅是“看”，而是“盯着看”，让人觉得被冒犯或被物化。更中性的说法可以用“look at / stare at（盯着看）”，更礼貌可说“glance at（瞥一眼）”。","词源上与“眼睛”相关的古词形有关，因此常用来描述“眼神黏着不放”的感觉。"]}
{"word":"ogled","summary":{"en":"“Ogled” means “looked at for a long time with obvious interest,” often in a rude or uncomfortable way.","zh":"“Ogled”表示“长时间明显地盯着看”，常带有无礼或让人不舒服的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “ogle”: to look at someone or something for a long time with obvious interest, often in a way that feels rude or uncomfortable.","zh":"“ogle”的过去式和过去分词：盯着某人或某物看很久、带着明显兴趣（常让人觉得无礼或不舒服）。"},"examples":[{"en":"He ogled the actress as she walked by.","zh":"女演员走过时，他一直盯着她看。"},{"en":"Some customers ogled the new sports car in the showroom.","zh":"一些顾客在展厅里盯着那辆新跑车看个不停。"},{"en":"She felt uncomfortable because she was being ogled.","zh":"她觉得不舒服，因为有人在盯着她看。"}]}],"synonyms":["stared at","gawked at","leered at"],"phonetic":"/ˈoʊɡəld/","extraExplanation":["“ogle”通常带有负面语气，尤其是指以带性意味或不尊重的方式盯着人看。若只是“欣赏/注视”，可以用更中性的词：look at, watch, stare（也可能偏负面）, admire。"]}
{"word":"ogler","summary":{"en":"An ogler is someone who stares at people in an intrusive, often creepy way.","zh":"ogler 指以冒犯、令人不适（常带性暗示）的方式盯着别人看的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who stares at someone in a persistent, often rude or sexually suggestive way","zh":"（常带无礼或性暗示地）盯着别人看的人；色眯眯盯视者"},"examples":[{"en":"She moved to another seat to get away from the ogler.","zh":"她换了个座位，躲开那个一直盯着她看的人。"},{"en":"The staff asked the ogler to stop staring at customers.","zh":"工作人员要求那名盯着顾客看的人停止这种行为。"},{"en":"Online, people may report an ogler for making others feel unsafe.","zh":"在网上，人们可能会举报那种让别人感到不安全的“盯视者”。"}]}],"synonyms":["stare-er","lecher","voyeur","creep (informal)"],"phonetic":"/ˈoʊɡlər/","extraExplanation":["“ogler”来自动词“ogle”（盯着看、色眯眯地看），语气明显偏负面，常用于指出让人不舒服、被冒犯的凝视。","在更正式或更中性的表达里，可以根据情境改用：a person who keeps staring（一直盯着看的人）、someone who’s making others uncomfortable（让人不舒服的人）。"]}
{"word":"oglers","summary":{"en":"“Oglers” means people who stare in an intrusive or sexual way.","zh":"“oglers”指那些以冒犯或带性意味盯着别人看的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who stares at someone (especially their body) in an overly interested or sexual way","zh":"（尤指以性意味）盯着别人看的人；色眯眯打量的人"},"examples":[{"en":"She felt uncomfortable because of the oglers on the train.","zh":"火车上的那些色眯眯打量的人让她很不舒服。"},{"en":"The club asked oglers to leave after several complaints.","zh":"接到多次投诉后，俱乐部要求那些盯着别人看的家伙离开。"}]}],"synonyms":["stare(r)","lecher","gawker","peeper"],"phonetic":"/ˈoʊɡlɚ/","extraExplanation":["“ogler”来自动词“ogle”（盯着看、色眯眯地看）。“oglers”是复数形式。","这个词通常带明显负面评价，暗示不礼貌、让人不适，甚至可能涉及骚扰语境；正式场合可用更中性的说法如“people who stare”。"]}
{"word":"ogles","summary":{"en":"“Ogles” is from “ogle,” meaning to stare in a very obvious way, often with sexual interest; it can also mean such a look.","zh":"“ogles”来自“ogle”，意思是明显地盯着看（常带性意味）；也可指这种盯视。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to look at someone or something in a way that is very obvious, often with sexual interest or strong curiosity","zh":"（常指带有性意味或强烈好奇地）目不转睛地盯着看"},"examples":[{"en":"He kept ogling her at the party, which made her uncomfortable.","zh":"他在派对上一直盯着她看，让她很不舒服。"},{"en":"Tourists ogled the luxury cars outside the hotel.","zh":"游客们盯着酒店外的豪车看个不停。"}]},{"partOfSpeech":"n.","definition":{"en":"a long, obvious look, often showing desire or interest","zh":"（常带欲望或强烈兴趣的）盯视，色眯眯的看"},"examples":[{"en":"She ignored his ogles and continued walking.","zh":"她无视他那种盯视，继续往前走。"}]}],"synonyms":["stare","gawk","leer","eye","gaze"],"phonetic":"ˈoʊɡəl","extraExplanation":["“ogle”通常带有负面含义：强调“看得太明显、让人不舒服”，尤其用于男性对女性的“色眯眯”凝视。正式场合更常用“stare at”或“look at,” 但它们不一定带这种冒犯意味。","拼写提示：你输入的“ogles”多半是第三人称单数（He ogles…）或名词复数（his ogles）。动词变化：ogle–ogled–ogling。"]}
{"word":"ogling","summary":{"en":"“Ogling” means staring at someone in a rude, obvious, often sexually suggestive way.","zh":"“ogling”指不礼貌、很明显地盯着别人看，常带暧昧或冒犯意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"looking at someone (often their body) in a way that is rude, obvious, or shows strong interest/attraction","zh":"（常指盯着某人的身体）目不转睛地看；色眯眯地打量；露骨地注视"},"examples":[{"en":"He was ogling her the whole time, which made her uncomfortable.","zh":"他从头到尾都在盯着她看，让她很不舒服。"},{"en":"Stop ogling people and focus on your work.","zh":"别再盯着别人看了，专心工作。"},{"en":"They caught him ogling the models in the magazine.","zh":"他们发现他在盯着杂志里的模特看。"}]}],"synonyms":["stare at","gawk at","leer at"],"phonetic":"/ˈoʊɡlɪŋ/","extraExplanation":["“ogle”通常带明显负面语气，强调“盯着看”让人不舒服，常与性意味或不礼貌的凝视相关；比中性的“look at / watch”更冒犯。","“ogling”是“ogle”的现在分词/动名词形式，可用在进行时（be ogling）或作名词用法（His ogling was obvious. 他的盯视很明显）。"]}
{"word":"ogmic","summary":{"en":"“Ogmic” is almost always a misspelling of “ohmic,” meaning ‘obeying Ohm’s law’ (linear voltage–current behavior).","zh":"“ogmic”几乎总是“ohmic”的误拼，意思是“符合欧姆定律”（电压—电流关系线性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “ohmic”) relating to electrical resistance that follows Ohm’s law, meaning voltage is proportional to current (V = IR).","zh":"（通常拼作“ohmic”）指符合欧姆定律的电阻特性，即电压与电流成正比（V = IR）。"},"examples":[{"en":"Copper wire shows nearly ohmic behavior at room temperature.","zh":"铜导线在室温下通常表现出接近欧姆特性的行为。"},{"en":"The graph is a straight line, so the contact is ohmic.","zh":"图像是直线，所以这个接触是欧姆接触（符合欧姆定律）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In electronics) describing a contact or device that has a linear current–voltage relationship (an “ohmic contact”), unlike a diode-like junction.","zh":"（电子学）形容某种接触/器件的电流—电压关系是线性的（“欧姆接触”），不同于像二极管那样的结。"},"examples":[{"en":"Engineers try to make an ohmic contact so the signal passes without rectification.","zh":"工程师会尽量做成欧姆接触，让信号通过时不会被整流。"},{"en":"If the contact is not ohmic, the circuit may behave unpredictably.","zh":"如果不是欧姆接触，电路可能会出现不可预测的行为。"}]}],"synonyms":["resistive","linear (I–V)"],"phonetic":"/ˈoʊmɪk/","extraExplanation":["“ogmic”在英文里非常少见，绝大多数情况下是把“ohmic”拼错了（h 和 g 在键盘上相邻也容易误按）。","“ohmic”来自物理学家 Georg Simon Ohm（欧姆）。在材料或元件“符合欧姆定律”时，I–V 曲线呈直线；不符合时常见于二极管、晶体管结等，曲线是非线性的。"]}
{"word":"ognize","summary":{"en":"“Recognize” means to identify someone/something you know, or to officially acknowledge/credit something.","zh":"“Recognize”常指“认出/识别”，也可指“正式承认/认可/表彰”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely what you meant) to know or identify someone or something because you have seen, heard, or learned about them before.","zh":"（你可能想写的是）认出；辨认出；识别（因为以前见过、听过或了解过）。"},"examples":[{"en":"I recognized her voice right away.","zh":"我立刻就认出了她的声音。"},{"en":"Do you recognize this song?","zh":"你认得出这首歌吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially accept or acknowledge something as true, important, or valid.","zh":"正式承认；认可；确认（某事为真实、重要或有效）。"},"examples":[{"en":"The company recognized his hard work with an award.","zh":"公司用一个奖项来表彰（认可）他的努力。"},{"en":"Many countries recognize the new government.","zh":"许多国家承认这个新政府。"}]},{"partOfSpeech":"vt.","definition":{"en":"to show appreciation for someone’s efforts or achievements; to give credit.","zh":"赞赏；表彰；给（某人）应有的肯定。"},"examples":[{"en":"She felt recognized for her contributions.","zh":"她觉得自己的贡献得到了肯定。"},{"en":"We should recognize the volunteers who helped.","zh":"我们应该表彰那些帮忙的志愿者。"}]}],"synonyms":["identify","spot","acknowledge","admit","credit","notice"],"phonetic":"/ˈrɛkəɡnaɪz/","extraExplanation":["“ognize”本身不是常见的独立英文单词，更像是你想输入“recognize”的一部分。","美式拼写是 recognize；英式常见拼写是 recognise（-ize / -ise 的差异）。","词源来自拉丁语 cognoscere（“了解、认识”）。同一词根还出现在 cognition（认知）、cognitive（认知的）等词里。"]}
{"word":"ogonium","summary":{"en":"An oogonium is a female reproductive structure in certain algae and fungi that produces egg cells.","zh":"ogonium（卵器）是某些藻类与真菌中的雌性生殖结构，用来产生卵细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female reproductive structure (gametangium) in some algae and fungi that produces egg cells (oospheres).","zh":"（某些藻类与真菌中的）卵器：产生卵细胞（卵球）的雌性生殖结构（配子囊）。"},"examples":[{"en":"In some algae, the oogonium contains one or more egg cells.","zh":"在一些藻类中，卵器内含有一个或多个卵细胞。"},{"en":"The microscope image shows an oogonium next to the male organ.","zh":"显微镜图像显示卵器在雄性器官旁边。"}]}],"synonyms":["oögonium","female gametangium"],"phonetic":"/oʊˈɡoʊniəm/","extraExplanation":["拼写上也常见作 oögonium（用分音符 ö 表示 o-o 分开读），现代英文里多直接写 oogonium。","词源来自希腊语 oo-（“卵”）+ -gonium（“生殖/产生的器官”）。常出现在生物学、植物学与真菌学教材或论文中。"]}
{"word":"ogor","summary":{"en":"“ogor” is not a standard English word; you probably mean “ogre” (a fairy-tale monster, or informally a very unpleasant person).","zh":"“ogor”不是标准英语单词；你很可能想写“ogre”（童话里的食人魔；口语里也可指很难相处的人）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely) a misspelling of “ogre,” a large, ugly monster in European fairy tales and fantasy stories.","zh":"（很可能）是“ogre”的拼写错误；“ogre”指欧洲童话与奇幻故事中的食人魔/怪物（通常高大、丑陋、可怕）。"},"examples":[{"en":"I think you mean “ogre,” not “ogor.”","zh":"我觉得你想写的是“ogre”，不是“ogor”。"},{"en":"In many fairy tales, an ogre lives in a dark forest.","zh":"在许多童话里，食人魔住在黑暗的森林中。"}]},{"partOfSpeech":"n.","definition":{"en":"(ogre) an unkind, frightening, or very unpleasant person (informal).","zh":"（ogre）指一个不友善、让人害怕或很难相处的人（非正式用法）。"},"examples":[{"en":"Don’t be such an ogre—help your sister with her homework.","zh":"别这么凶/难相处了——帮你妹妹做作业吧。"},{"en":"My boss seems like an ogre when he’s stressed.","zh":"我老板压力大时看起来像个“魔王”一样很吓人。"}]}],"synonyms":["monster","brute","bully"],"phonetic":"/ˈoʊɡɚ/","extraExplanation":["“ogor”不是常见英语单词；最常见的情况是把“ogre”（食人魔）拼错了。正确拼写是 o-g-r-e。","“ogre”常见于童话与奇幻作品；现代口语里也可用来形容“很凶、很难相处的人”，语气带夸张或玩笑成分，注意场合。"]}
{"word":"ogpu","summary":{"en":"OGPU: the Soviet secret police agency (1923–1934).","zh":"OGPU：苏联秘密警察机构（1923—1934年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The Soviet secret police organization that operated from 1923 to 1934, known in English by its Russian initials “OGPU.”","zh":"苏联的秘密警察机构，1923—1934年间存在，英文常用其俄语缩写“OGPU”称呼。"},"examples":[{"en":"In the 1920s, the OGPU monitored political dissent across the Soviet Union.","zh":"在20世纪20年代，OGPU在整个苏联监控政治异见。"},{"en":"Many writers mentioned the OGPU to show the atmosphere of fear in that period.","zh":"许多作家会提到OGPU，以展现那个时期的恐惧氛围。"}]}],"synonyms":["Soviet secret police","Cheka (predecessor)","NKVD (successor)"],"phonetic":"ˌoʊ dʒiː piː ˈjuː","extraExplanation":["OGPU是俄语“Объединённое государственное политическое управление”的缩写，常译为“国家政治保卫总局/统一国家政治保卫局”。","它在斯大林时代早期扮演重要角色，负责情报、镇压与劳改营体系的管理等；1934年并入NKVD（内务人民委员部）。","在英文阅读中，OGPU常与Cheka（契卡，前身）和NKVD（后继机构）一起出现，用来指涉苏联早期的秘密警察体系与政治迫害背景。"]}
{"word":"ography","summary":{"en":"-ography is a suffix meaning “study/description of a subject” or “writing/recording (often images).”","zh":"-ography 是后缀，表示“对某主题的研究/描述”或“书写/记录（常指影像）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a suffix meaning “the study or description of a subject,” often used for academic fields.","zh":"后缀，表示“对某主题的研究/描述”，常用于学科名称。"},"examples":[{"en":"Geography is the study and description of the Earth and its places.","zh":"Geography（地理学）是对地球及其地方的研究与描述。"},{"en":"Oceanography focuses on studying the oceans.","zh":"Oceanography（海洋学）侧重研究海洋。"}]},{"partOfSpeech":"other","definition":{"en":"a suffix meaning “writing, recording, or a way of producing images,” often connected to drawing, printing, or photography.","zh":"后缀，表示“书写、记录或成像的方法”，常与绘制、印刷或摄影相关。"},"examples":[{"en":"Photography is the process of recording images with a camera.","zh":"Photography（摄影）是用相机记录影像的过程。"},{"en":"Calligraphy is the art of beautiful writing.","zh":"Calligraphy（书法/美术字）是优美书写的艺术。"},{"en":"Lithography is a printing method using a flat surface.","zh":"Lithography（平版印刷）是一种使用平面版的印刷方法。"}]}],"synonyms":["-graphy","-logy (related: “the study of”)"],"phonetic":"/ˈɑɡrəfi/","extraExplanation":["“-ography”来自希腊语“graphia”，与“写、画、记录”有关；因此它既能表示“记录/书写的方式”（如 photography），也能引申为“对某事的系统描述或研究”（如 geography）。","注意：它通常不单独作为一个词使用，而是作为构词后缀出现在更长的单词里。学习时可以把它拆开理解：geo-（地球）+ -graphy（记录/描述）→ geography。"]}
{"word":"ogre","summary":{"en":"An ogre is a scary, man-like monster in fairy tales; it can also mean a person who seems cruel or unpleasant.","zh":"ogre 指童话里的食人魔；也可比喻看起来很凶、刻薄的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, ugly, and frightening man-like monster in stories and fairy tales, often said to eat people.","zh":"（童话/传说中的）食人魔；通常形象高大、丑陋、可怕，常被描写为吃人。"},"examples":[{"en":"In the fairy tale, an ogre guards the castle and scares the villagers.","zh":"在童话里，一个食人魔守着城堡，吓得村民不敢靠近。"},{"en":"The children hid quietly so the ogre wouldn’t find them.","zh":"孩子们安静地躲起来，免得食人魔发现他们。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who seems very cruel, rude, or unpleasant (often used humorously or as an exaggeration).","zh":"（比喻）粗暴的人；看起来很凶、很刻薄的人（常带夸张或开玩笑语气）。"},"examples":[{"en":"My boss isn’t an ogre—he’s just strict when deadlines are close.","zh":"我老板不是“魔王”——只是临近截止日期时比较严格。"},{"en":"Don’t be such an ogre; say it more kindly.","zh":"别那么凶嘛；说话温和一点。"}]}],"synonyms":["monster","brute","bully","giant"],"phonetic":"/ˈoʊɡɚ/","extraExplanation":["“ogre”主要出现在欧洲民间故事与童话传统中，常作为“可怕的反派怪物”出现。现代流行文化里（如电影《Shrek》），也会把食人魔塑造成外表吓人但内心善良的角色，因此语感有时不一定完全负面。","相关词汇：giant（巨人，通常不一定吃人）、troll（巨魔，北欧传说常见）、monster（怪物，更泛）。","常见搭配：an ogre in a fairy tale（童话里的食人魔）；He’s no ogre.（他没那么可怕/凶。）"]}
{"word":"ogreish","summary":{"en":"“Ogreish” means ogre-like—ugly, cruel, or frightening in a monster-like way.","zh":"“ogreish”指“像食人魔一样的”，形容丑陋、凶残或令人害怕的怪物般感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like an ogre; very ugly, brutal, or frightening in a way that suggests a fairy-tale monster.","zh":"像食人魔一样的；（外貌或举止）丑陋、凶残或令人害怕，带有童话怪物的感觉。"},"examples":[{"en":"He loomed in the doorway with an ogreish grin that scared the children.","zh":"他站在门口，露出食人魔般的狞笑，把孩子们吓坏了。"},{"en":"The headline painted the villain in ogreish colors, as if he were less human than everyone else.","zh":"标题把反派描绘得像食人魔一样，仿佛他比别人更不像人。"},{"en":"After a sleepless night, she said she looked ogreish in the mirror.","zh":"一夜没睡后，她说自己在镜子里看起来“像食人魔一样难看”。"}]}],"synonyms":["ogre-like","monstrous","brutish","hideous","fearsome"],"phonetic":"/oʊˈɡrɪʃ/","extraExplanation":["“ogreish”来自“ogre（食人魔）+ -ish（带有……特征的）”。在英语里常用来形容外貌、表情或行为“像怪物”，语气通常带夸张或贬义；用于形容人时要注意礼貌和语境。","“ogre”是欧洲民间故事里常见的怪物形象（高大、可怕、吃人），在现代流行文化中也会被改写得更幽默或更有人性（如某些电影角色），但“ogreish”在日常用法里多半仍偏负面。"]}
{"word":"ogreishly","summary":{"en":"“Ogreishly” means behaving in a harsh, cruel, or bullying way—like an ogre.","zh":"“ogreishly”指像食人魔一样粗暴、残忍或霸凌地行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rude, cruel, or bullying way; like an ogre (a frightening monster in fairy tales).","zh":"以粗鲁、残忍或霸凌的方式；像食人魔那样（童话里可怕的怪物）。"},"examples":[{"en":"He spoke ogreishly to the waiter, as if the man didn’t deserve basic respect.","zh":"他对服务员说话很粗暴，仿佛对方不配得到基本尊重。"},{"en":"The coach barked orders ogreishly, which made the team nervous instead of focused.","zh":"教练以霸道凶狠的口吻吼着下命令，让队员紧张而不是专注。"}]}],"synonyms":["brutally","cruelly","rudely","savagely","tyrannically"],"phonetic":"/oʊˈɡrɑɪʃli/","extraExplanation":["“ogreishly”来自“ogre（食人魔）+ -ish（有点像…）+ -ly（副词）”。因此它强调的是“像食人魔一样可怕/粗暴”的行为方式。","在现代流行文化里（例如《Shrek/史瑞克》）“ogre”有时被重新塑造成可爱形象，但“ogreishly”在英语里通常仍带贬义，表示粗暴、刻薄、吓人。"]}
{"word":"ogreism","summary":{"en":"“Ogreism” means ogre-like cruelty or bullying behavior.","zh":"“ogreism”指像食人魔般的残暴或霸凌作风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ogre-like behavior or qualities; cruelty, brutality, or a harsh, bullying way of treating others.","zh":"像食人魔一样的行为或特质；残暴、粗暴，或以强势霸凌他人的作风。"},"examples":[{"en":"The novel criticizes the ogreism of the ruler, who punishes people without mercy.","zh":"这部小说批判统治者的“ogreism”，他惩罚人民毫不留情。"},{"en":"She spoke out against the ogreism in the workplace—shouting, intimidation, and public humiliation.","zh":"她公开反对职场中的“ogreism”——大吼大叫、威胁恐吓、当众羞辱。"}]}],"synonyms":["brutality","cruelty","bullying","tyranny","savagery"],"phonetic":"/ˈoʊɡərˌɪzəm/","extraExplanation":["“ogreism”是由“ogre（食人魔）+ -ism”构成的抽象名词，表示一种“像食人魔一样”的作风或倾向，常用于比喻语境，强调残忍、压迫、霸凌等特质。","该词较少见，更常见的表达有“brutality（暴行）”“bullying（霸凌）”“tyranny（暴政）”“cruelty（残酷）”。在写作中使用它，会带有更强的文学/讽刺色彩。"]}
{"word":"ogreisms","summary":{"en":"Ogreisms are cruel or bullying behaviors that make someone seem like an ogre.","zh":"ogreisms 指让人显得像“食人魔”一样的残忍或霸凌式言行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) behavior, qualities, or expressions that resemble an ogre—cruelty, brutality, or rude, bullying manners.","zh":"（多用复数）“食人魔式”的言行或特征——指残忍、粗暴，或蛮横无礼、欺压他人的举止。"},"examples":[{"en":"The report condemned the guard’s ogreisms toward the prisoners.","zh":"报告谴责了那名看守对囚犯的残暴行径（食人魔式作风）。"},{"en":"In the novel, his public smiles hide private ogreisms at home.","zh":"在小说里，他在公众面前笑容可掬，却在家里显露出私下的粗暴与欺凌。"},{"en":"She refused to excuse his ogreisms as “just being strict.”","zh":"她拒绝把他的蛮横行径解释成“只是严格而已”。"}]}],"synonyms":["bullying","brutality","cruelty","boorishness","thuggery","rudeness"],"phonetic":"/ˈoʊɡərɪzəm/","extraExplanation":["“ogreism”源自“ogre（食人魔）+ -ism（……主义/作风）”。在英语里常用复数“ogreisms”，强调一连串令人反感的粗暴言行。","“ogre”在欧洲民间故事中常被描绘为吃人的巨怪；现代英语里也常用来比喻“脾气坏、爱欺负人的人”。因此“ogreisms”多见于较文学或讽刺的语境，用来加强批判语气。"]}
{"word":"ogres","summary":{"en":"Ogres are monsters in fairy tales; informally, an “ogre” can also mean a very mean or intimidating person.","zh":"ogres 指童话里的食人魔；口语中也可比喻很凶或让人害怕、不好相处的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, frightening (often man-eating) creature from fairy tales and folklore; a monster","zh":"（童话与民间传说中的）食人魔；怪物"},"examples":[{"en":"In the story, the hero must outsmart an ogre to save the village.","zh":"在故事里，英雄必须智胜食人魔来拯救村庄。"},{"en":"Many fairy tales describe ogres as huge and cruel.","zh":"很多童话把食人魔描写得巨大而残忍。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is very mean, frightening, or hard to deal with (informal, figurative)","zh":"（非正式，喻义）很凶的人；不好相处的人"},"examples":[{"en":"Don’t worry—he seems like an ogre, but he’s actually helpful once you talk to him.","zh":"别担心——他看起来很凶，但你跟他聊过后会发现他其实很乐于助人。"},{"en":"She joked that her strict coach was an ogre during practice.","zh":"她开玩笑说她那位严格的教练在训练时像个“魔王”。"}]}],"synonyms":["monster","brute","giant","bully"],"phonetic":"/ˈoʊɡɚ/","extraExplanation":["“ogre”常见于欧洲童话传统（如法语故事与后来的英文童话改写）。现代流行文化中也很常见，比如《怪物史瑞克》（Shrek）把“ogre”塑造成外表吓人但内心善良的形象，影响了很多人对该词的联想。","拼写提示：单数 ogre；复数 ogres（你输入的 ogres 就是复数形式）。"]}
{"word":"ogress","summary":{"en":"An ogress is a female ogre—a big, scary monster in folktales and fantasy.","zh":"ogress 指“女食人魔/女巨魔”，常见于民间故事和奇幻作品中的可怕怪物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female ogre: a large, ugly, often man-eating monster in folktales and fantasy stories.","zh":"（故事/奇幻作品中的）女食人魔；女巨魔：一种体型巨大、外貌丑陋，常被描写为吃人的怪物。"},"examples":[{"en":"In the fairy tale, an ogress lives alone in a dark forest and traps travelers.","zh":"在童话里，一位女食人魔独自住在黑森林中，并设陷阱抓住旅人。"},{"en":"The hero tricks the ogress and escapes from her cave.","zh":"英雄骗过女食人魔，从她的洞穴里逃了出来。"}]}],"synonyms":["female ogre","monster (in stories)"],"phonetic":"/ˈoʊɡrəs/","extraExplanation":["“ogress”是“ogre”（食人魔）的阴性形式，来自法语词尾 -ess（如 actress）。现代英语里有时也直接用“ogre”指任何性别的食人魔。","在文学与民间故事中，ogress常被用来象征“威胁、贪婪或残酷的力量”，并不一定与现实中的女性形象相关；阅读时可把它理解为一种叙事角色类型。","常见搭配：an ogress in a fairy tale（童话里的女食人魔）、a fearsome/terrifying ogress（可怕的女食人魔）。相关词：ogre（食人魔）、giant/giantess（巨人/女巨人）、witch（女巫）。"]}
{"word":"ogresses","summary":{"en":"“Ogresses” means female ogres (plural), usually seen in fairy tales and fantasy as frightening giant creatures.","zh":"“ogresses”是“女食人魔”的复数，常见于童话与奇幻作品，指可怕的巨型怪物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ogress”: a female ogre, a large, frightening, man-eating creature in fairy tales and fantasy stories.","zh":"“ogress”的复数：女食人魔（童话与奇幻故事中体型巨大、可怕、常被描写为吃人的怪物）。"},"examples":[{"en":"In the story, the ogresses guard the bridge and demand a toll.","zh":"在故事里，女食人魔守着桥并索要过路费。"},{"en":"The hero escapes when the ogresses fall asleep.","zh":"当女食人魔睡着后，英雄趁机逃走。"}]}],"synonyms":["female ogres","monsters","giantesses (context-dependent)"],"phonetic":"/oʊˈɡrɛs/","extraExplanation":["“ogre/ogress”常见于欧洲民间故事与童话传统，形象类似“巨人怪物”，常被用来象征残暴或贪婪。现代作品里也可能被重新塑造成更幽默或有人性的角色（例如一些动画与奇幻小说）。","英语里很多职业/身份名词曾用 -ess 标示女性（如 actress, waitress）。当代英语更倾向用性别中性词（actor, server），但 ogress 在文学/童话语境中仍常见。"]}
{"word":"ogrish","summary":{"en":"“Ogrish” means extremely gruesome or gory, often used online; it can also refer to the old gore-site name.","zh":"“Ogrish”指非常血腥、残忍、令人不适（多见于网络语境）；也可指早期血腥网站名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely unpleasant, brutal, or gruesome (often describing violent or gory content online).","zh":"极其令人不适、残忍或血腥的（常用来形容网上的暴力/重口内容）。"},"examples":[{"en":"That video is too ogrish—I couldn’t finish watching it.","zh":"那个视频太ogrish（太血腥重口）了，我看不下去。"},{"en":"Some forums ban ogrish images to protect users.","zh":"一些论坛会禁发ogrish图片来保护用户。"}]},{"partOfSpeech":"n.","definition":{"en":"A reference to the old shock/gore website name “Ogrish,” sometimes used to mean that kind of content.","zh":"指早期冲击/血腥网站名“Ogrish”，也可引申指那类内容。"},"examples":[{"en":"He said it was ‘Ogrish-level’ gore.","zh":"他说那是“达到Ogrish级别”的血腥内容。"}]}],"synonyms":["gruesome","gory","graphic","brutal","macabre"],"phonetic":"/ˈoʊɡrɪʃ/","extraExplanation":["“Ogrish”最初广为人知是一个早期发布重口味、血腥冲击内容的网站名称；后来在部分网民语境中被当作形容词使用，意思接近“gruesome / gory / graphic”。","从构词感觉上，它看起来像“ogre（食人魔）+ -ish（有点像……的）”，带有“像怪物一样可怕”的语气，但在实际使用中多与网络血腥内容的语境绑定。","该词带有明显的网络亚文化色彩，且可能触及暴力/血腥敏感内容；在正式写作中更常用“gruesome”“gory”“graphic”。"]}
{"word":"ogrishly","summary":{"en":"“Ogrishly” means “like an ogre”: ugly, frightening, or mean in an exaggerated, story-like way.","zh":"“ogrishly”表示“像食人魔一样”：丑陋吓人或粗暴刻薄，带有夸张、故事化的描写色彩。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an ugly, brutish, or frightening way—like an ogre (a large, scary creature in traditional stories).","zh":"以丑陋、粗暴或吓人的方式——像食人魔（传统故事里高大可怕的怪物）一样。"},"examples":[{"en":"He laughed ogrishly, showing a mouthful of crooked teeth.","zh":"他发出食人魔般的狞笑，露出一口歪斜的牙齿。"},{"en":"The villain loomed ogrishly in the doorway, blocking the light.","zh":"反派像食人魔一样可怕地站在门口，把光都挡住了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a rude, mean, or bullying manner (often used humorously or in fiction).","zh":"以粗鲁、刻薄或霸凌的方式（常带幽默感或用于小说描写）。"},"examples":[{"en":"She spoke ogrishly to the waiter, then quickly apologized.","zh":"她对服务员说话很凶，随后又立刻道歉了。"},{"en":"The coach barked ogrishly during practice, but he cared about the team.","zh":"训练时教练凶巴巴地吼人，但他其实很在乎球队。"}]}],"synonyms":["brutishly","grotesquely","menacingly","savagely","rudely"],"phonetic":"/ˈoʊɡrɪʃli/","extraExplanation":["“ogrishly”来自名词“ogre”（食人魔）+ 副词后缀“-ishly”，表示“以……的方式”。常见于文学、童话风格或夸张描写，日常口语里不算常用。更常见的近义表达有“brutally / grotesquely / menacingly”。"]}
{"word":"ogrism","summary":{"en":"Ogrism means ogre-like cruelty or brutish behavior.","zh":"ogrism 指“食人魔般的残暴/粗野行为”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The qualities or behavior of an ogre; brutal, cruel, or frightening manners.","zh":"食人魔般的特质或行为；指残暴、凶狠、令人畏惧的举止。"},"examples":[{"en":"The dictator’s violence and contempt for ordinary people felt like pure ogrism.","zh":"那位独裁者的暴力与对普通人的蔑视，简直像极了食人魔般的残暴。"},{"en":"In the novel, the villain’s ogrism is shown through how he humiliates weaker characters.","zh":"在小说里，反派的“食人魔式残暴”通过他羞辱弱者的行为表现出来。"}]}],"synonyms":["brutality","savagery","cruelty","barbarism"],"phonetic":"/ˈoʊɡrɪzəm/","extraExplanation":["“ogrism”来自“ogre（食人魔）+ -ism（……主义/特性）”。“ogre”常见于欧洲民间故事与童话中，指体型巨大、凶残、常以人类为食的怪物，因此“ogrism”多用于文学或较正式的写作中，形容人或制度的残酷与野蛮。"]}
{"word":"ogrisms","summary":{"en":"“Ogrisms” is a rare word meaning ogre-like cruelty or brutal behavior.","zh":"“ogrisms”是个罕见词，意思是像“食人魔”一样的残忍或粗暴行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Ogre-like behavior or qualities; cruel, brutal, or intimidating actions, as if done by an ogre.","zh":"（罕见）“食人魔式”的行为或特质；指残忍、粗暴、令人畏惧的举动，仿佛出自食人魔。"},"examples":[{"en":"The critic said the ruler’s ogreisms made ordinary people live in fear.","zh":"评论家说，那位统治者的“食人魔式暴行”让百姓生活在恐惧中。"},{"en":"In the novel, the villain’s ogreisms are shown through his bullying and threats.","zh":"在小说里，反派的“食人魔式行径”通过他的霸凌和威胁表现出来。"}]}],"synonyms":["cruelty","brutality","bullying","tyranny","savagery"],"phonetic":"/ˈoʊɡrɪzəmz/","extraExplanation":["“ogrisms”通常可理解为“ogrism”的复数，但这个词在现代英语中非常少见。更常见的表达是：cruelty（残忍）、brutality（暴行）、bullying（霸凌）、ogre-like behavior（像食人魔一样的行为）。","词根来自 ogre（食人魔，源于民间故事/童话），常用于文学或批评语境，用“童话怪物”的形象来强调某人的残酷与压迫。"]}
{"word":"ogtiern","summary":{"en":"“ogtiern” isn’t recognized as an English word; please provide context or the intended spelling.","zh":"“ogtiern”不是可识别的英语单词；请提供上下文或正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, or a proper name.","zh":"不是标准英语单词，可能是拼写错误、用户名或专有名词。"},"examples":[{"en":"I can’t find “ogtiern” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里查不到“ogtiern”——你能给我一句看到它的原句吗？"}]}],"phonetic":"—","extraExplanation":["“ogtiern”看起来不像常见英语词形（也不像常见前后缀组合）。如果你告诉我来源（网页/游戏/作业/聊天）或给出上下文句子，我可以更准确判断你想查的词。","如果这是输入法/键盘误触，也可能是把某个常见词打乱了字母。你可以告诉我你原本想表达的中文意思（例如“获得/组织/东方/工程”等），我可以反推最可能的英文词。"]}
{"word":"ogum","summary":{"en":"Ogum (Ogun) is an orisha/deity linked to iron, tools, war, and protection, especially in West African and Afro-Brazilian traditions.","zh":"Ogum（Ogun）是与铁、工具、战争与守护相关的奥里沙/神祇，常见于西非与非裔巴西宗教传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ogum (also spelled Ogun) is a West African deity (òrìṣà) associated with iron, metalworking, tools, war, and the protection of travelers; the name is also used in Afro-Brazilian religions such as Candomblé and Umbanda.","zh":"Ogum（也拼作 Ogun）是西非的神祇（奥里沙/òrìṣà），与铁、金属加工、工具、战争以及保护旅人相关；在巴西的坎东布雷（Candomblé）和乌班达（Umbanda）等非裔巴西宗教中也常见。"},"examples":[{"en":"In Candomblé, many people honor Ogum as a powerful protector.","zh":"在坎东布雷中，许多人敬奉 Ogum，视其为强大的守护者。"},{"en":"The story describes Ogum as a master of iron and tools.","zh":"故事把 Ogum 描写成掌管铁与工具的大师。"}]}],"synonyms":["Ogun"],"phonetic":"/oʊˈɡuːn/","extraExplanation":["“Ogum”多见于葡语语境（尤其是巴西），而在约鲁巴语及英语资料里更常写作“Ogun”。两者通常指同一位神祇，但不同传统与地区对其形象、节日、供奉方式会有差异。","这是专有名词，用作人名/神名时通常首字母大写（Ogum）。在学习或翻译时，建议尊重具体宗教与文化语境，避免把它简单等同为某个单一文化中的“战神”。"]}
{"word":"ogygia","summary":{"en":"Ogygia is Calypso’s remote island in Homer’s *Odyssey*, and it can also mean a faraway, secluded, dreamlike place in literary writing.","zh":"Ogygia 指荷马《奥德赛》中卡吕普索居住的偏远岛屿；在文学中也可比喻遥远、隐秘、如梦似幻的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The remote island where the nymph Calypso kept Odysseus for years in Homer’s *Odyssey*.","zh":"（希腊神话）卡吕普索（Calypso）居住的偏远岛屿；在荷马史诗《奥德赛》中，她曾把奥德修斯留在此地多年。"},"examples":[{"en":"In Homer’s *Odyssey*, Odysseus is stranded on Ogygia with Calypso.","zh":"在荷马的《奥德赛》中，奥德修斯被困在奥吉吉亚岛上，与卡吕普索一起。"},{"en":"The novel reimagines Ogygia as a lonely but beautiful paradise.","zh":"这部小说把奥吉吉亚描写成一个孤独却美丽的乐园。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary use) A metaphor for a faraway, secluded, or dreamlike place—sometimes a beautiful “paradise,” sometimes an isolating one.","zh":"（文学用法）比喻遥远、隐秘或如梦似幻的地方；有时指美丽的“桃源”，有时也强调与世隔绝的孤立感。"},"examples":[{"en":"After the scandal, he retreated to an Ogygia of silence and distance.","zh":"丑闻之后，他退隐到一个沉默而遥远的“奥吉吉亚”。"},{"en":"The poem calls the island an Ogygia—sweet, but impossible to leave.","zh":"诗中把那座岛称作“奥吉吉亚”——甜美，却难以离开。"}]}],"synonyms":["Calypso’s island"],"phonetic":"/oʊˈdʒɪdʒiə/","extraExplanation":["“Ogygia”常被当作专有名词使用，来自古希腊语的地名；在英语里多见于文学、神话研究、或用来制造“遥远神秘之地”的意象。","在《奥德赛》中，奥德修斯在此被留住多年：岛屿既是丰饶宁静的庇护所，也是阻碍他回家的“停滞之地”。因此它在现代隐喻里常带有“美丽但令人滞留/隔绝”的双重含义。"]}
{"word":"ogygian","summary":{"en":"Ogygian means extremely ancient or mythically old; it can also mean connected to Ogyges or Ogygia in Greek myth.","zh":"Ogygian 意为“极其古老、近乎神话般久远的”；也可指与希腊神话中的奥吉革斯或奥吉吉亚有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely ancient; belonging to a time so old it is almost mythical.","zh":"极其古老的；古老到近乎神话时代的。"},"examples":[{"en":"The ruins seemed Ogygian, as if they had stood there since the beginning of time.","zh":"这些废墟显得极其古老，仿佛自时间伊始便矗立于此。"},{"en":"He wrote in an Ogygian style, using archaic words to create a sense of deep history.","zh":"他以一种极古的风格写作，用古语营造出深远历史感。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Ogyges or Ogygia in Greek myth and classical literature.","zh":"与希腊神话与古典文学中的奥吉革斯（Ogyges）或奥吉吉亚（Ogygia）有关的。"},"examples":[{"en":"Some poets describe Ogygian islands as remote places outside ordinary time.","zh":"一些诗人把“奥吉吉亚诸岛”描写成脱离日常时间的遥远之地。"}]}],"synonyms":["primeval","immemorial","ancient","archaic","antediluvian"],"phonetic":"/oʊˈdʒɪdʒiən/","extraExplanation":["“Ogygian”来自古典典故：Ogyges（奥吉革斯）常被描述为极其久远的古代人物，因此这个词在英语里常借用来表示“远古、上古”。","在荷马史诗传统中，Ogygia（奥吉吉亚）是女神卡吕普索（Calypso）的岛，常被文学作品用来营造“遥远、与世隔绝、时间停滞”的氛围。这个词在现代英语中很少用于日常口语，更常见于文学、历史或修辞性写作。"]}

