{"word":"oic","summary":{"en":"“OIC” means “Oh, I see,” an informal way to show you understand.","zh":"“OIC”表示“Oh, I see（哦，我明白了）”，是一种非正式的“我懂了/我理解了”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An informal abbreviation (especially in texting) meaning “Oh, I see,” used to show you understand what someone just said.","zh":"非正式缩写（常见于短信/聊天），意思是“哦，我明白了/我懂了”，用来表示你理解了对方刚说的话。"},"examples":[{"en":"A: The meeting is moved to Friday. B: OIC, thanks for letting me know.","zh":"A：会议改到周五了。B：OIC，谢啦，告诉我一声。"},{"en":"OIC—so that’s why you were late.","zh":"OIC——所以这就是你迟到的原因。"}]}],"synonyms":["I see","Got it","Understood","OK"],"phonetic":"/oʊ aɪ siː/","extraExplanation":["常见写法也有 “IC”（I see）。在比较正式的邮件或工作沟通中，建议写完整的 “I see.” / “Got it.” / “Understood.”，显得更专业。","语气通常中性，有时也可能带一点“原来如此”的轻微反应；若担心显得冷淡，可以加一句感谢或回应，比如 “OIC, thanks!”。"]}
{"word":"oice","summary":{"en":"Voice can mean a person’s speaking/singing sound, a distinctive style of expression, or (as a verb) to express an opinion; in grammar it also means active vs. passive voice.","zh":"Voice 可以指人的说话/歌唱声音、表达的语气/风格；作动词表示“表达（观点）”；在语法中还指主动语态与被动语态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The sounds a person makes when speaking or singing.","zh":"（人说话或唱歌的）嗓音；声音"},"examples":[{"en":"I recognized her voice immediately.","zh":"我立刻就听出了她的声音。"},{"en":"He spoke in a calm voice.","zh":"他用平静的声音说话。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular style or quality of speaking or writing that shows personality or attitude.","zh":"（说话/写作的）语气；风格；表达方式"},"examples":[{"en":"The writer has a clear, friendly voice.","zh":"这位作者的文风清晰、亲切。"},{"en":"Try to keep the same voice throughout your essay.","zh":"尽量让你的文章前后语气一致。"}]},{"partOfSpeech":"vt.","definition":{"en":"To express an opinion, feeling, or concern aloud or publicly.","zh":"表达（观点、感受、担忧）；公开说出"},"examples":[{"en":"She voiced her concerns at the meeting.","zh":"她在会上表达了她的担忧。"},{"en":"Many people voiced support for the new plan.","zh":"许多人公开表示支持新计划。"}]},{"partOfSpeech":"n.","definition":{"en":"A verb form that shows whether the subject does an action (active) or receives it (passive).","zh":"（语法）语态：表示主语是动作的执行者（主动）还是承受者（被动）"},"examples":[{"en":"“The cat chased the mouse” is in the active voice.","zh":"“The cat chased the mouse”（猫追老鼠）是主动语态。"},{"en":"“The mouse was chased by the cat” is in the passive voice.","zh":"“The mouse was chased by the cat”（老鼠被猫追）是被动语态。"}]}],"synonyms":["tone","sound","statement","express","say"],"phonetic":"/vɔɪs/","extraExplanation":["你输入的“oice”很可能是拼写少了开头的 v；常见单词是“voice”。如果你其实想查的是别的词，请告诉我完整拼写或给个例句。"]}
{"word":"oicks","summary":{"en":"“Oicks” is a variant plural of “oik”: a rude or uncultured person; “Oiks!” can also be an annoyed, contemptuous exclamation (mainly British).","zh":"“oicks”是“oik”的一种复数拼法：指粗鲁/没教养的人；“Oiks!”也可作带轻蔑的感叹（主要为英式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: oiks; sometimes spelled “oicks”) a rude, unpleasant, or socially insensitive person (often used in British English, and can sound class‑judgmental).","zh":"（复数：oiks；也常拼作 oicks）粗鲁、讨厌或缺乏教养的人（多见于英式英语，带有阶层偏见的贬义）。"},"examples":[{"en":"He called the teenagers “a bunch of oiks,” which sounded rude and unfair.","zh":"他把那些青少年称作“一群 oiks”，听起来既粗鲁又不公平。"},{"en":"Try not to label people as oiks—describe the behavior instead.","zh":"尽量别用 oiks 给人贴标签——不如直接描述他们的行为。"}]},{"partOfSpeech":"int.","definition":{"en":"(often said as “Oiks!”) an exclamation showing annoyance or contempt, meaning “What vulgar/uncultured people!”","zh":"（常说作 “Oiks!”）表示厌烦或轻蔑的感叹，意思类似“真没教养/真粗俗！”"},"examples":[{"en":"“Oiks!” she muttered when someone shouted in the library.","zh":"有人在图书馆大喊时，她嘟囔了一句：“Oiks!”"},{"en":"He rolled his eyes and said, “Oiks,” under his breath.","zh":"他翻了个白眼，低声说了句：“Oiks。”"}]}],"synonyms":["lout","boor","jerk","chav (BrE)","yob (BrE)"],"phonetic":"/ɔɪk/","extraExplanation":["“oik”是英式俚语，语气带贬义，有时隐含“瞧不起某个社会阶层/口音/生活方式”的意味；在正式或礼貌场合不建议使用。更中性的说法可以用：rude（粗鲁的）、obnoxious（令人讨厌的）、ill-mannered（没礼貌的）。"]}
{"word":"oid","summary":{"en":"“-oid” is a suffix meaning “like,” “resembling,” or “-shaped.”","zh":"“-oid” 是后缀，表示“像……的 / ……状的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A suffix meaning “resembling,” “like,” or “having the shape/form of.”","zh":"后缀，表示“像……的 / ……状的 / 具有……形态的”。"},"examples":[{"en":"A humanoid robot looks like a human in shape or behavior.","zh":"humanoid（类人）机器人在外形或行为上看起来像人。"},{"en":"An asteroid is a small, star-like object in space (though it isn’t actually a star).","zh":"asteroid（小行星）是在太空中的小天体，名字里带“像星”的意思（但它并不是恒星）。"},{"en":"In medicine, “spheroid” describes something roughly sphere-shaped.","zh":"在医学里，spheroid 可用来形容“大致呈球形”的东西。"}]}],"synonyms":["-like","-shaped","resembling"],"phonetic":"/ɔɪd/","extraExplanation":["“-oid”来自希腊语 -oeidēs，意思是“具有……的样子/形状”。它常出现在科学、医学、正式词汇中（如 humanoid, spheroid, android）。","学习提示：把 “-oid” 理解成英语里的 “-like / -shaped”。例如 oval（椭圆）→ ovoid（卵形的/椭圆形的）。","注意：单独的 “oid” 很少作为一个独立单词使用；它更多是词缀（suffix/combining form）。"]}
{"word":"oidal","summary":{"en":"“Oidal” is a technical adjective element meaning “having the form of; -like,” usually seen inside longer words (e.g., spheroidal).","zh":"“oidal”多用于科技词汇中，表示“具有……形状的/像……的”，通常出现在更长的单词里（如 spheroidal）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(mostly in scientific/technical words) having the shape or form of; resembling.","zh":"（多见于科技/学术词汇）具有……形状的；类似……的。"},"examples":[{"en":"In math, “paraboloidal” describes something shaped like a paraboloid.","zh":"在数学里，“paraboloidal”用来描述“抛物面状的”东西。"},{"en":"A “spheroidal” planet is roughly ball-shaped, not perfectly round.","zh":"“spheroidal”的行星大致呈球形，但不是完全的圆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as a word-building ending meaning “-like” (often written as part of longer adjectives).","zh":"作构词后缀使用，表示“像……的/……状的”（常出现在更长的形容词中）。"},"examples":[{"en":"“Ovoidal” means egg-shaped.","zh":"“ovoidal”意思是“卵形的/蛋形的”。"},{"en":"Scientists often choose “-oidal” words to describe shapes precisely.","zh":"科学家常用带“-oidal”的词来更精确地描述形状。"}]}],"synonyms":["-like","-shaped","-oid"],"phonetic":"/ˈɔɪdəl/","extraExplanation":["“oidal”本身在日常英语中几乎不单独使用，更常见的是作为更长单词的一部分（如 spheroidal, ovoidal, paraboloidal）。它来自“-oid（……状的/类似……的）+ -al（形容词后缀）”，整体强调“在形态上类似”。","如果你是在文章或试题里看到单独的“oidal”，通常是在讨论词缀或把它当作“……状的”这一类意义来概括。"]}
{"word":"oide","summary":{"en":"“oide” isn’t a common English word; it’s usually a typo for another word or a context-specific name/acronym.","zh":"“oide” 不是常见英语单词；多半是拼写错误或特定语境中的名称/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most often a misspelling or typo (commonly for “oxide” or “ode”), or it may be an acronym/name in a specific context.","zh":"不是常见英语词典里的标准词；通常是拼写错误（常见是把 “oxide” 或 “ode” 拼错），也可能是在特定语境中的缩写或专有名词。"},"examples":[{"en":"Did you mean “oxide” (as in iron oxide) or “ode” (a poem)?","zh":"你想写的是 “oxide”（如 iron oxide 氧化铁）还是 “ode”（颂诗）？"},{"en":"I couldn’t find “oide” in the dictionary—can you share the full sentence?","zh":"我在词典里找不到 “oide”——你能提供完整句子吗？"}]}],"phonetic":"/ɔɪd/","extraExplanation":["“oide” 很可能是把 “oxide”（化学里的“氧化物”）少写了 x，或把 “ode”（一种抒情/赞美性质的诗）多写了 i。","如果你是在游戏、用户名、地名、公司名或缩写（acronym）里看到的 “OIDE/oide”，它可能是专有名词，不一定有固定词义。把原句发来我可以更准确判断。"]}
{"word":"oidea","summary":{"en":"-oidea is a zoological taxonomy suffix meaning “superfamily of.”","zh":"-oidea 是动物分类学中的后缀，表示“……总科”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a suffix used in zoological taxonomy to form the name of a superfamily (a rank above family), meaning “the group/superfamily of.”","zh":"（动物分类学）用于构成“总科（superfamily）”名称的后缀，表示“……总科/……类群”之意。"},"examples":[{"en":"In zoology, many superfamily names end in -oidea.","zh":"在动物学中，许多总科名称以 -oidea 结尾。"},{"en":"A name like “Apoidea” shows it is a superfamily (the bee superfamily).","zh":"像 “Apoidea（蜂总科）” 这样的名称表明它是一个总科。"},{"en":"Students often confuse -oidea (superfamily) with -idae (family).","zh":"学生常把 -oidea（总科）和 -idae（科）混淆。"}]}],"synonyms":["superfamily suffix","taxonomic suffix"],"phonetic":"/oʊˈaɪdiə/","extraExplanation":["-oidea 常见于生物分类的拉丁化命名体系中：比如 Apoidea（蜂总科）、Papilionoidea（凤蝶总科）。它本身通常不单独作为普通词使用，而是作为构词后缀出现在学名里。","记忆小提示：常见层级后缀包括 -oidea（总科 superfamily）、-idae（科 family）、-inae（亚科 subfamily）。"]}
{"word":"oidia","summary":{"en":"Odia: a language mainly spoken in Odisha, India.","zh":"Odia：印度奥迪沙邦主要使用的语言（奥迪亚语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Indo-Aryan language spoken mainly in the Indian state of Odisha (also written as “Odia,” formerly often spelled “Oriya”).","zh":"奥里亚语／奥迪亚语：主要在印度奥迪沙邦（Odisha）使用的一种印度-雅利安语（英语中常写作“Odia”，过去也常拼作“Oriya”）。"},"examples":[{"en":"She is learning Odia to communicate with her grandparents in Odisha.","zh":"她正在学习奥迪亚语，以便和住在奥迪沙邦的祖父母交流。"},{"en":"The book was translated from English into Odia.","zh":"这本书从英语被翻译成了奥迪亚语。"}]}],"synonyms":["Oriya (older spelling)"],"phonetic":"/ˈoʊdiə/","extraExplanation":["你输入的“oidia”在英语里不常见，最可能是拼写顺序写错了，通常写作 **Odia**（奥迪亚语）。","在英语中，过去常见拼写 **Oriya**，但近年来更倾向采用与当地自称更接近的 **Odia** 与 **Odisha**（对应旧拼写 Orissa）。在正式写作、新闻和学术语境中，“Odia”更常用。"]}
{"word":"oidioid","summary":{"en":"“Oidioid” is not a standard English word; it likely means “opioid,” a powerful pain-relief drug that can also be addictive.","zh":"“oidioid”不是标准英文词，很可能是“opioid（阿片类药物）”的误拼：强效止痛药，但也可能成瘾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"It is likely a misspelling of “opioid”: a strong pain-relieving drug related to opium that can also cause dependence (addiction).","zh":"这很可能是“opioid”的拼写错误：一种与鸦片相关的强效止痛药，也可能导致依赖（成瘾）。"},"examples":[{"en":"The doctor prescribed an opioid for severe pain after surgery.","zh":"医生在手术后为严重疼痛开了阿片类止痛药。"},{"en":"Opioids can be helpful, but they must be used carefully.","zh":"阿片类药物可能有帮助，但必须谨慎使用。"}]}],"synonyms":["narcotic (informal/medical context-dependent)","painkiller","opiate (related term)"],"phonetic":"/ˈoʊpiɔɪd/","extraExplanation":["“Opioid（阿片类药物）”在美国公共健康语境中很常见，常出现在“opioid crisis（阿片危机）/ opioid epidemic（阿片流行）”等表达里，指处方止痛药与非法药物（如海洛因、芬太尼）相关的成瘾与过量问题。","如果你原本想查的不是“opioid”，请告诉我你看到这个词的句子或正确拼写，我可以按语境解释。"]}
{"word":"oidiomycosis","summary":{"en":"Oidiomycosis is an older medical term for a fungal (often Candida/yeast) infection.","zh":"Oidiomycosis 是旧的医学用语，指真菌感染，常多用于指念珠菌/酵母样真菌感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fungal infection (mycosis), especially an older term for infections caused by yeast-like fungi once classified as Oidium (often referring to Candida infections).","zh":"真菌感染（霉菌病）；尤指旧称，过去把某些酵母样真菌归为 Oidium 时，用来指这类感染（常常相当于念珠菌感染）。"},"examples":[{"en":"The doctor noted that “oidiomycosis” is an older name and now usually calls it candidiasis.","zh":"医生指出“oidiomycosis”是较旧的名称，现在通常称为“candidiasis（念珠菌病）”。"},{"en":"In older medical texts, oidiomycosis may describe infections of the mouth or skin caused by yeast.","zh":"在较早的医学文献中，oidiomycosis 可能用来描述由酵母样真菌引起的口腔或皮肤感染。"}]}],"synonyms":["candidiasis","Candida infection","yeast infection","mycosis"],"phonetic":"/ˌɔɪdi.oʊmaɪˈkoʊsɪs/","extraExplanation":["这个词在现代临床英语中很少使用，更常见的是 candidiasis（念珠菌病）或 Candida infection（念珠菌感染）。","词源上可拆分为 oidio-（与旧分类名 Oidium 有关）+ mycosis（真菌病）。由于真菌分类与命名更新，旧称逐渐被更精确的名称取代。","如果你是在论文或旧书里看到它，理解为“念珠菌一类的酵母样真菌感染”通常最安全；具体仍需看上下文（部位、病原、症状）。"]}
{"word":"oidiomycotic","summary":{"en":"A rare/older adjective meaning “related to a fungal (often Candida) infection.”","zh":"一个少见且偏旧的形容词，指“与真菌（常指念珠菌）感染有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, caused by, or resembling a fungal infection formerly attributed to organisms called Oidium (especially an older name for Candida).","zh":"与过去称为 Oidium 的真菌（尤其是念珠菌的旧称）所致或类似的真菌感染有关的；念珠菌性（旧称）的。"},"examples":[{"en":"The doctor described the rash as oidiomycotic in origin, meaning it was linked to a yeast-like fungus.","zh":"医生说这种皮疹起因是 oidiomycotic，意思是与类似酵母的真菌有关。"},{"en":"In older medical writing, “oidio­mycotic” was sometimes used for infections we now call candidiasis.","zh":"在较早的医学文献中，“oidio­mycotic”有时用来指现在称为“念珠菌病”的感染。"}]}],"synonyms":["candidal","fungal","mycotic","Candida-related"],"phonetic":"/ˌɔɪdi.oʊmaɪˈkɑtɪk/","extraExplanation":["这个词非常少见，多出现在旧的医学/真菌学文献里。历史上“Oidium albicans”曾被用来指今天的 Candida albicans（白色念珠菌），所以 oidiomycotic 往往等同于“念珠菌相关/念珠菌性”的旧式说法。现代写作更常用 candidal / Candida-related / candidiasis。"]}
{"word":"oidium","summary":{"en":"Oïdium is a fungus (or fungal stage) linked to powdery mildew, especially the disease that affects grapes.","zh":"Oïdium 指与白粉病相关的真菌（或其形态阶段），也常指（尤其是葡萄上的）白粉病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fungus (or fungal stage) that forms a powdery coating on plants; commonly associated with powdery mildew","zh":"一种真菌（或真菌的某一阶段），会在植物表面形成粉末状覆盖层；常与“白粉病”有关"},"examples":[{"en":"The grape leaves were covered with a white powder caused by oidium.","zh":"葡萄叶片被白色粉末覆盖，这是由 oidium（白粉菌/白粉病相关真菌）引起的。"},{"en":"Farmers monitor humidity because oidium spreads easily in certain conditions.","zh":"农民会监测湿度，因为 oidium 在某些条件下很容易扩散。"}]},{"partOfSpeech":"n.","definition":{"en":"powdery mildew as a plant disease, especially in grapes (common in wine-growing contexts)","zh":"（尤指葡萄上的）白粉病；在葡萄种植与葡萄酒行业语境中常这样用"},"examples":[{"en":"The vineyard treated the vines early to prevent oidium.","zh":"葡萄园早期处理葡萄藤，以预防 oidium（白粉病）。"}]}],"synonyms":["powdery mildew","mildew (general)"],"phonetic":"/oʊˈɪdiəm/","extraExplanation":["“Oidium”在农业与葡萄栽培里很常见，常特指葡萄白粉病（powdery mildew），在一些语境中会把病原真菌与疾病本身都简称为 oidium。","词源来自希腊语，含义与“蛋（egg）/小形体”有关，早期用于描述真菌的某些形态；现代生物分类中，它常被当作特定形态阶段或旧称来使用，因此不同资料里可能出现分类命名差异。"]}
{"word":"oidwlfe","summary":{"en":"“oidwlfe” is not a recognized English word; it’s likely a typo. Share the intended meaning or a sentence for the correct word.","zh":"“oidwlfe”不是英文单词，可能是拼写错误。请提供想表达的意思或例句，我来帮你找正确的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not an English word. It may be a typo or random letters.","zh":"这不是一个英文单词，可能是拼写错误或随机字母。"},"examples":[{"en":"“oidwlfe” isn’t in standard English dictionaries.","zh":"“oidwlfe”不在常见的英语词典中。"},{"en":"Did you mean “dwindle” or “wildlife”?","zh":"你是不是想写“dwindle（逐渐减少）”或“wildlife（野生动物）”？"}]}],"extraExplanation":["如果你是想查一个真正的单词：可以把你想表达的中文意思告诉我，或提供一句包含这个词的英文句子，我可以帮你判断最可能的正确拼写。","从字母组合来看，比较接近的常见词有：wildlife（野生动物）和 dwindle（逐渐减少）。但仅凭“oidwlfe”无法确定你原本要写哪一个。"]}
{"word":"oie","summary":{"en":"“Oie” is a playful, informal way to say “hi,” mostly seen online and influenced by Portuguese.","zh":"“Oie”是受葡语影响的俏皮网络用语，用来非正式地说“嗨”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An informal online greeting meaning “hi/hey,” often used playfully; borrowed from Portuguese (especially Brazilian Portuguese).","zh":"一种非正式的网络问候语，意思是“嗨/嘿”，常带俏皮感；多源自葡萄牙语（尤其巴西葡萄牙语）。"},"examples":[{"en":"Oie! How are you doing today?","zh":"Oie！你今天怎么样？"},{"en":"She texted me “oie” to start the conversation.","zh":"她发“oie”来开启对话。"}]}],"synonyms":["hi","hey","hello","oi"],"phonetic":"/ɔɪ/","extraExplanation":["“Oie”在英语语境里通常不是标准英语单词，更常见于社交媒体/聊天中，作为跨语言借用的打招呼方式。英语里更常用的对应表达是“Hi / Hey / Hello”。","在葡语里“oi”就是“嗨”，而“oie”常被当作更可爱、更撒娇/更热情的写法（类似把“hi”写成“hiii”）。"]}
{"word":"oii","summary":{"en":"“oii” is a playful texting form of “oi,” meaning “hey/yo” to get attention.","zh":"“oii”是“oi”的俏皮聊天写法，用来打招呼或引起注意（类似“嘿/喂”）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A casual text spelling of “oi,” used to get someone’s attention or to say “hey,” often sounding playful or a bit insistent.","zh":"“oi”的聊天拼写变体，用来引起别人注意或打招呼（类似“嘿”），语气常更俏皮或更“催促”一点。"},"examples":[{"en":"Oii, are you there?","zh":"Oii，你在吗？"},{"en":"Oii! Don’t ignore me.","zh":"Oii！别不理我。"},{"en":"Oii, long time no see!","zh":"Oii，好久不见！"}]}],"synonyms":["oi","hey","yo","hiya"],"phonetic":"/ɔɪ/","extraExplanation":["“oii”通常出现在聊天/社交媒体里，用多一个“i”来拉长语气（像“heyy”）。在英语环境里它多被理解为“oi”的可爱/撒娇式写法。","注意：在英式英语里，“oi!”有时带一点不耐烦或责备（像“喂！”），对陌生人用可能显得没礼貌；对朋友用更自然。","在巴西葡萄牙语里，“oi/oii”也很常见，意思是“嗨”。如果你是在葡语圈看到的，“oii”大概率就是更热情的“嗨”。"]}
{"word":"oik","summary":{"en":"“Oik” is a British insult for someone seen as rude or uncultured.","zh":"“oik”是英式侮辱用语，指被认为粗鲁、没教养或“很土”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British informal, usually insulting) A rude, uncultured, or socially “common” person; someone seen as having bad manners.","zh":"（英式非正式，常带侮辱）粗鲁、没教养或被认为“没品/很土”的人；举止不雅的人。"},"examples":[{"en":"He called the waiter an oik, which was really offensive.","zh":"他把服务员叫作“oik”，这非常冒犯人。"},{"en":"She didn’t want to sound like an oik at the formal dinner.","zh":"她不想在正式晚宴上显得很“土/没礼貌”。"}]}],"synonyms":["lout","boor","yob"],"phonetic":"/ɔɪk/","extraExplanation":["“oik”主要是英国英语里的阶层色彩词，带有轻蔑意味，常用来贬低别人“没教养、没品味”。在现代语境中它可能显得很刻薄或带偏见，用时要非常谨慎。","词源常被认为与“hoick”（粗鲁地拉拽、举止粗野）或苏格兰俚语有关，但并非完全确定。"]}
{"word":"oikology","summary":{"en":"Oikology is a rare noun meaning the study/management of the household, and very rarely it has been used to mean ecology.","zh":"Oikology是一个罕见名词，主要指家政/家庭生活与管理的研究；极少数情况下也曾被用来指生态学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The study or management of a household; domestic economy; home life and housekeeping as a field of knowledge.","zh":"（罕见）家政学；对家庭生活与家务管理的研究；家庭经济（学）。"},"examples":[{"en":"In the early 1900s, some writers used “oikology” to discuss household management and family economics.","zh":"在20世纪初，一些作者用“oikology”来讨论家务管理与家庭经济。"},{"en":"Her research connected oikology with nutrition, budgeting, and daily routines in the home.","zh":"她的研究把家政学与营养、预算和家庭日常作息联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) Another term sometimes used for ecology—the study of living things in relation to their environment.","zh":"（极罕见）有时被用作“ecology（生态学）”的别称：研究生物与环境关系的学科。"},"examples":[{"en":"A few texts treated oikology as a synonym of ecology, though this is not standard today.","zh":"少数文本把oikology当作ecology的同义词，但如今并不规范。"},{"en":"Modern science almost always uses “ecology,” not “oikology.”","zh":"现代科学几乎总是用“ecology（生态学）”，而不是“oikology”。"}]}],"synonyms":["home economics","domestic science","household management","(rare) ecology"],"phonetic":"/ɔɪˈkɑlədʒi/","extraExplanation":["词源：来自希腊语 oikos（“家、居所”）+ -logy（“学问、研究”）。因此它既可能指“家”的研究（家政/家庭经济），也容易与同源的 ecology（生态学，早期也写作 oecology）混淆。","使用建议：如果你想表达“生态学”，标准用词是 ecology；如果想表达“家政/家庭管理”，更常见的现代用词是 home economics 或 domestic science。"]}
{"word":"oikomania","summary":{"en":"Oikomania means an excessive, sometimes criticized, love of home or homeland.","zh":"Oikomania 指对家或家园/祖国的过度迷恋（有时带批评意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive or obsessive love of one’s home, homeland, or familiar culture; sometimes used to criticize extreme patriotism or nostalgia","zh":"对“家/故乡/本土文化”的过度迷恋或执着；有时用于批评极端的爱国主义或怀旧情绪"},"examples":[{"en":"After years abroad, he developed a kind of oikomania and talked about moving back every day.","zh":"在国外多年后，他产生了一种“恋家式”的执念，几乎每天都在说要搬回去。"},{"en":"Some writers use oikomania to describe an idealized, unrealistic love of the nation’s past.","zh":"一些作者用 oikomania 来形容对国家过去的理想化、并不现实的迷恋。"}]}],"synonyms":["chauvinism","jingoism","hyper-patriotism","nostalgia","home-loving"],"phonetic":"/ˌɔɪkoʊˈmeɪniə/","extraExplanation":["这个词由希腊语词根 oikos（家、家庭、家园）+ mania（狂热、躁狂）组成，字面意思是“对家园的狂热”。","它不是日常高频词，更常见于文化评论或政治讨论中，用来和 oikophobia（“厌家/厌本土文化”的倾向）形成对比；不同作者使用时褒贬可能不同，阅读时要留意语境。"]}
{"word":"oikonomia","summary":{"en":"Oikonomia is a Greek-derived noun meaning “household management,” later extended to “economy,” and in theology, “God’s saving plan” (divine economy).","zh":"oikonomia 是源自希腊语的名词，原指“家政/家庭管理”，后引申为“经济”；在神学中也指“上帝的救恩计划”（divine economy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) Household management; the administration of a home or estate (the original sense of “economy”).","zh":"（历史用法）家政管理；对家庭或庄园的经营与管理（“economy/经济”的原始含义）。"},"examples":[{"en":"In ancient Greek thought, oikonomia referred to the practical management of a household, including resources and labor.","zh":"在古希腊思想中，oikonomia 指对家庭的实际管理，包括资源与劳力的安排。"},{"en":"The philosopher described good oikonomia as balancing needs, savings, and responsibilities at home.","zh":"这位哲学家把良好的 oikonomia 描述为在家庭中平衡需求、储蓄与责任。"}]},{"partOfSpeech":"n.","definition":{"en":"Economy; the organization and management of resources in a community or society (a later, broadened sense).","zh":"经济；对社会或共同体资源的组织与管理（后来扩展出的含义）。"},"examples":[{"en":"Some writers use the Greek term oikonomia to emphasize that an economy is about managing shared resources.","zh":"一些作者用希腊词 oikonomia 来强调：经济的核心是对共同资源的管理。"},{"en":"The book traces how oikonomia shifted from household rules to ideas about the state and the economy.","zh":"这本书追溯了 oikonomia 如何从“家规家政”转向关于国家与经济的观念。"}]},{"partOfSpeech":"n.","definition":{"en":"(Theology) God’s plan or “divine management” of salvation history; often translated as “divine economy.”","zh":"（神学）上帝对救赎历史的安排与治理；常译为“神圣经济/救恩计划（divine economy）”。"},"examples":[{"en":"In Christian theology, the oikonomia of salvation refers to how God works through history to redeem humanity.","zh":"在基督教神学中，“救恩的 oikonomia”指上帝如何在历史中施行救赎。"},{"en":"The text contrasts doctrine (what is believed) with oikonomia (how God’s plan unfolds).","zh":"文本对比了 doctrine（信仰内容）与 oikonomia（上帝计划如何展开）。"}]}],"synonyms":["economy","household management","stewardship","administration"],"phonetic":"/ˌɔɪkəˈnɑːmiə/","extraExplanation":["词源：来自古希腊语 οἰκονομία（oikonomía），由 oikos（家、家庭）+ nomos（规则、管理）组成，字面意思是“管理家庭的规则”。这也是英语 economy 的远祖概念。","用法提醒：oikonomia 在现代英语中较少作为日常词汇出现，多见于古典研究、政治哲学写作或神学语境；一般谈“经济”仍用 economy。"]}
{"word":"oikonomikos","summary":{"en":"“Oikonomikos” is a Greek-derived word meaning “household management,” and it is historically linked to the origins of “economics.”","zh":"“oikonomikos”源自希腊语，意为“家政/家庭经营管理”，在词源上与“economics（经济学）”的起源有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Ancient Greek) relating to household management; domestic economy—often used when talking about the historical roots of the word “economics.”","zh":"（源自古希腊语）与“家务/家政管理、家庭财务与经营”有关的；常用于讨论“economics（经济学）”一词的历史词源。"},"examples":[{"en":"The term “oikonomikos” originally described the skill of managing a household’s resources.","zh":"“oikonomikos”最初指的是管理家庭资源的技能。"},{"en":"In classical writing, “oikonomikos” can connect home management with broader ideas of economy.","zh":"在古典著作中，“oikonomikos”常把家庭经营与更广泛的“经济”观念联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"a title/label used for works or discussions about household management, especially in classical Greek philosophy and literature.","zh":"（书名/标签）指与“家政管理、家庭经营”相关的作品或讨论，尤见于古希腊哲学与文学语境。"},"examples":[{"en":"Xenophon’s work is often referred to by the Greek title “Oikonomikos.”","zh":"色诺芬（Xenophon）的作品常被称为希腊文书名《Oikonomikos》。"},{"en":"A seminar on Aristotle may mention “oikonomikos” when explaining early economic thought.","zh":"讲解亚里士多德思想的研讨课可能会提到“oikonomikos”，用来说明早期经济思想。"}]}],"synonyms":["household management","domestic economy","economic (historical/etymological context)","economy (in origin sense)"],"phonetic":"/ˌɔɪkəˈnɑmɪkəs/","extraExplanation":["“oikonomikos（οἰκονομικός）”来自“oikos（家、家宅）+ nomos（规则、管理/分配）”。这也是英语“economy / economics”的词源背景之一：最早的“经济”更接近“把家管好、把资源分配好”。","古希腊作家色诺芬（Xenophon）有一部对话体作品《Oikonomikos》（常译作《家政学/家政管理》），讨论如何管理家产、农庄与家庭秩序；在文学与思想史里常被引用。","现代英语里这个词非常少见，更多出现在古典学、哲学史、词源学或学术讨论中。日常表达通常用“economic / economical / household management”等更常见词。"]}
{"word":"oikophobia","summary":{"en":"Oikophobia means dislike or fear of one’s own home or, more commonly today, one’s own country/culture.","zh":"oikophobia 指对自己的家或（更常见）对本国/本土文化的强烈厌恶或恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong dislike or fear of one’s own home, familiar surroundings, or (more commonly) one’s own country or culture","zh":"对自己的家、熟悉环境，或（更常见）对本国/本族文化的强烈厌恶或恐惧（“厌家/厌本土”）"},"examples":[{"en":"After moving abroad, he wrote essays that some readers described as oikophobia—harsh criticism of his own country’s traditions.","zh":"他移居海外后写了一些文章，有读者把那种对本国传统的严厉批评称为“oikophobia”（厌本土）。"},{"en":"The debate wasn’t about policy details anymore; it became a fight over whether the speaker was showing oikophobia or simply asking for reform.","zh":"争论不再是政策细节，而变成了：发言者是在“厌本土”，还是只是在呼吁改革。"}]}],"synonyms":["self-loathing (in cultural/political contexts)","contempt for one’s own culture","anti-national sentiment (approx.)"],"phonetic":"/ˌɔɪkəˈfoʊbiə/","extraExplanation":["词源：来自希腊语 *oikos*（家）+ *phobia*（恐惧）。字面义是“恐家症”，但在当代公共讨论中更常被用来指对本国文化/传统的厌弃或自我否定。","语域与语气：这是偏学术/政论的词，常带评价色彩，有时用来指责对方“自我厌恶/崇外”。使用时注意区分：合理批评（criticism）不一定等于 oikophobia。","相关对比：常与 *xenophobia*（恐外、排外）相对；有些作者会把两者当作社会态度的两端来讨论。"]}
{"word":"oikoplast","summary":{"en":"An oikoplast is a house-forming cell in larvaceans that secretes the mucus filter structure around the animal.","zh":"oikoplast 指尾海鞘类体内用于分泌并构建黏液过滤“房子”的造房细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A specialized cell in larvaceans (appendicularians) that secretes and helps build the mucus “house” (a filter-feeding structure) around the animal.","zh":"（生物）尾海鞘类（如尾海鞘、幼体海鞘/尾索动物中的被囊类之一）的一种特化细胞，用来分泌并构建动物周围的黏液“房子”（用于过滤取食的结构）。"},"examples":[{"en":"The larvacean uses oikoplasts to produce a delicate mucus house for filter feeding.","zh":"尾海鞘利用 oikoplasts 产生精细的黏液“房子”来进行过滤取食。"},{"en":"Researchers stained the oikoplast region to observe how the house-forming material is secreted.","zh":"研究人员对 oikoplast 区域进行染色，以观察构成“房子”的物质如何被分泌出来。"}]}],"synonyms":["house-forming cell","house-producing cell"],"phonetic":"/ˈɔɪkoʊplæst/","extraExplanation":["词源上常被解释为来自希腊语：oiko-（“家、居所”）+ -plast（“塑造、形成”）。因此它的含义可理解为“造房/成形的细胞”。","在尾海鞘类中，“house（房子）”不是巢穴意义上的家，而是一种可更换的黏液过滤装置；被污染或堵塞后会被丢弃并重新分泌。"]}
{"word":"oikos","summary":{"en":"Oikos is an Ancient Greek word meaning “household/home,” and it’s also the root behind eco- words like ecology and economics.","zh":"oikos 是古希腊语，意为“家庭／家宅（含家业）”，也是 ecology、economics 等 eco- 词的词源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek) a household or home, including the family, property, and people living under one management.","zh":"（古希腊语）家宅／家庭（不仅指房子，也包括家人、财产与整个“家”的经营单位）。"},"examples":[{"en":"In ancient Athens, the oikos was the basic unit of social and economic life.","zh":"在古雅典，oikos 是社会与经济生活的基本单位。"},{"en":"The head of the oikos was responsible for property, work, and family duties.","zh":"oikos 的家长负责财产、劳动安排与家庭义务。"}]},{"partOfSpeech":"n.","definition":{"en":"(In modern academic use) the root meaning “house(hold)” in words like ecology and economics.","zh":"（现代学术用法）词根，表示“家／居所／家庭经营单位”，见于 ecology、economics 等词。"},"examples":[{"en":"Ecology comes from oikos (“house”) + -logy (“study”).","zh":"ecology 来自 oikos（家）+ -logy（学科／研究）。"},{"en":"Economics comes from oikos (“household”) + nomos (“management/law”).","zh":"economics 来自 oikos（家庭）+ nomos（管理／规则）。"}]}],"synonyms":["household","home","family (unit)","domestic sphere"],"phonetic":"/ˈɔɪkɑs/","extraExplanation":["“oikos（οἶκος）”在古希腊文化里不只是“房子”，更接近“家业／家庭共同体”，包含亲属、奴仆、土地与生产活动，因此常出现在历史、政治学、经济史与古典学的讨论中。","英语中很多“eco-”开头的词都与 oikos 同源：ecology（生态学，研究“自然这个家”如何运作）、economy/economics（经济／经济学，研究“家庭/社会如何管理资源”）。理解这个词根有助于记忆相关词汇。"]}
{"word":"oiks","summary":{"en":"“Oiks” is a British slang insult meaning rude or uncultured people (plural of “oik”).","zh":"“oiks”是英式俚语侮辱语，指被认为粗鲁或没教养的人（“oik”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rude, uncultured, or lower-class person (a British slang insult; plural of “oik”)","zh":"粗鲁、没教养或被认为“低阶层”的人（英式俚语侮辱语；为 oik 的复数）"},"examples":[{"en":"He called them “oiks,” which sounded very snobbish and insulting.","zh":"他称他们为“oiks”，听起来很势利、很侮辱人。"},{"en":"Don’t use words like that—it’s a class-based insult.","zh":"别用那种词——那是带阶级歧视的侮辱。"}]}],"synonyms":["lout","boor","yob (BrE)","thug (context-dependent)"],"phonetic":"/ɔɪks/","extraExplanation":["“oik”是英国口语里带贬义的称呼，常从“上层/中产”视角去贬低别人“粗俗、没品味”。因此在现实交流中容易显得刻薄或带阶级偏见。","英式英语里更常见的近义贬称还有“chav”（语气与指向不完全相同，也可能带刻板印象），使用时同样需要谨慎。"]}
{"word":"oil","summary":{"en":"Oil is a slippery liquid used for cooking, machines, art, or petroleum energy; as a verb, it means to lubricate something.","zh":"oil 指用于烹饪、机器、绘画或能源的“油”；作动词表示“给……上油/润滑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, slippery liquid that comes from plants (like olives) or from the ground (petroleum), used in cooking, machines, or making products.","zh":"油；一种黏稠、滑的液体，可来自植物（如橄榄）或地下（石油），用于烹饪、机器润滑或制造产品。"},"examples":[{"en":"Heat the pan and add a little oil before cooking the vegetables.","zh":"把锅加热，放一点油再炒蔬菜。"},{"en":"The car needs oil to keep the engine running smoothly.","zh":"汽车需要机油来让发动机运转顺畅。"},{"en":"Oil prices rose after the news about the Middle East.","zh":"有关中东的消息传出后，油价上涨了。"}]},{"partOfSpeech":"n.","definition":{"en":"Petroleum as an energy source or industry (often called “the oil industry”).","zh":"（指石油能源或产业）石油；常说“石油行业”。"},"examples":[{"en":"Many countries depend on oil exports.","zh":"许多国家依赖石油出口。"},{"en":"She works in oil and gas.","zh":"她在油气行业工作。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put oil on something to make it move smoothly or to prevent it from drying out or rusting.","zh":"给……上油；涂油以使其运转顺滑或防止干燥、生锈。"},"examples":[{"en":"Oil the door hinges so they don’t squeak.","zh":"给门铰链上点油，这样就不会吱吱响。"},{"en":"He oiled the chain before the long bike ride.","zh":"长途骑行前他给车链条上了油。"}]},{"partOfSpeech":"n.","definition":{"en":"Oil paint, a type of paint that uses oil as a base (common in traditional art).","zh":"油画颜料；以油为基底的颜料（传统绘画中常见）。"},"examples":[{"en":"The portrait was done in oil.","zh":"这幅肖像是用油画颜料画的。"}]}],"synonyms":["petroleum","lubricant","cooking oil","engine oil"],"phonetic":"/ɔɪl/","extraExplanation":["“oil”在日常英语里常同时指“食用油/机油/石油”。语境很关键：kitchen/cook 常指食用油；car/engine 常指机油；prices/export/industry 多指石油。","常见搭配：olive oil（橄榄油）、vegetable oil（植物油）、cooking oil（食用油）、motor oil/engine oil（机油）、crude oil（原油）、oil spill（漏油/油污泄漏）。","文学/文化提示：英语里“oil and water don’t mix（油和水不相容）”常被用来比喻两种人或事物很难融合。"]}
{"word":"oilberries","summary":{"en":"Oilberries are oil-rich berries (or the shrubs that grow them), sometimes referring to sea buckthorn or autumn olive.","zh":"Oilberries 指含油/油脂较多的浆果（或其灌木），有时用来指沙棘或秋橄榄等植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a berry (or the berry-producing shrub) known for having oily, oil-rich fruit; the term is used in some regions for plants such as sea buckthorn or autumn olive","zh":"（某些地区的叫法）油莓；指果实含油/油脂较多的浆果，或结这种果实的灌木（常被用来指沙棘或胡颓子属的某些植物）"},"examples":[{"en":"The tea is made from dried oilberries and has a tart flavor.","zh":"这种茶用晒干的油莓泡成，味道偏酸。"},{"en":"In late summer, the oilberries turn bright orange or red.","zh":"到夏末时，油莓会变成鲜橙色或红色。"}]}],"synonyms":["sea buckthorn","autumn olive"],"phonetic":"/ˈɔɪlˌbɛri/","extraExplanation":["“oilberry”在日常英语里不算常见，更常见于植物学、野外采集或地方性用法。不同地区/资料里，它可能指不同植物（例如沙棘 sea buckthorn，或“秋橄榄”/胡颓子 autumn olive）。如果你是在某本书或某个地区看到 oilberries，最好结合上下文或学名来确认具体是哪一种。"]}
{"word":"oilberry","summary":{"en":"Oilberry is a non-standard common name for an oil-producing berry or plant (often referring to sea buckthorn in some contexts).","zh":"Oilberry（油莓）是一个不太标准的俗名，泛指能产油的浆果或植物；在一些语境中常指沙棘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant (or its berry-like fruit) known for producing oil from its fruit or seeds; the exact species can vary by region and context.","zh":"油莓；指一种以果实或种子可榨取油而得名的植物（或其浆果状果实）。具体指哪一种植物会因地区与语境而不同。"},"examples":[{"en":"Some communities use oilberry fruit to make a traditional skin oil.","zh":"有些社区会用油莓的果实制作传统护肤油。"},{"en":"The label says the oil comes from an oilberry plant, but it doesn’t name the species.","zh":"标签上写着这种油来自“油莓”植物，但没有标明具体物种。"}]},{"partOfSpeech":"n.","definition":{"en":"In some contexts, a common name for sea buckthorn, whose orange berries are used to produce oils.","zh":"在某些语境中指沙棘；其橙色浆果常被用来提取果油。"},"examples":[{"en":"Sea buckthorn is sometimes called oilberry because its berries are rich in oil.","zh":"沙棘有时也被叫作“油莓”，因为它的浆果富含油脂。"}]}],"synonyms":["sea buckthorn","oil-producing berry","oilseed plant"],"phonetic":"/ˈɔɪlˌbɛri/","extraExplanation":["“oilberry”不是一个非常固定、标准的植物学名称，更像是“俗名/商品名”，不同地区可能指不同的“可产油的浆果类植物”。阅读配方或产品说明时，最好同时查找拉丁学名（如 Hippophae rhamnoides 等）来确认具体来源。"]}
{"word":"oilbird","summary":{"en":"An oilbird is a cave-dwelling, night-flying tropical bird that uses echolocation and eats oily fruit.","zh":"oilbird 指一种栖息洞穴、夜间活动的热带鸟类，会回声定位，主要吃含油果实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nocturnal tropical bird (the oilbird) that lives in caves, navigates by echolocation, and feeds mainly on oily fruit","zh":"（油鸱）一种生活在热带地区的夜行性鸟类，常栖息在洞穴中，会用回声定位，主要以含油量高的果实为食"},"examples":[{"en":"Oilbirds sleep in dark caves during the day and fly out at night to find fruit.","zh":"油鸱白天在黑暗的洞穴里睡觉，晚上飞出去寻找果实。"},{"en":"Scientists study the oilbird because it uses echolocation like bats.","zh":"科学家研究油鸱，因为它像蝙蝠一样会用回声定位。"}]}],"synonyms":["Oilbird","Steatornis caripensis"],"phonetic":"/ˈɔɪlˌbɝd/","extraExplanation":["“oilbird”这个名字来自早期人们发现它体内脂肪含量较高，幼鸟曾被取脂炼油（历史记录中较常见于南美一些地区）。现代更多是作为独特的洞穴鸟类和生态研究对象来介绍与保护。","油鸱主要分布在南美北部（如委内瑞拉、哥伦比亚等）的热带地区；英文里常特指单一种——Oilbird（学名 *Steatornis caripensis*）。"]}
{"word":"oilbirds","summary":{"en":"Oilbirds are nocturnal, fruit-eating cave birds from northern South America that can use echolocation.","zh":"oilbirds 指“油鸱”的复数：南美洲北部的夜行洞穴鸟，以果实为食，并能用回声定位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nocturnal, cave-dwelling birds (the species *Steatornis caripensis*) found in northern South America; they eat fruit and can use echolocation to navigate in darkness.","zh":"油鸱（学名 *Steatornis caripensis*）的复数：一种生活在洞穴中的夜行鸟类，分布于南美洲北部；以果实为食，并能用“回声定位”在黑暗中导航。"},"examples":[{"en":"Oilbirds live in deep caves and fly out at night to feed on fruit.","zh":"油鸱生活在很深的洞穴里，夜晚飞出去吃果实。"},{"en":"Researchers recorded the clicking sounds oilbirds make to navigate in the dark.","zh":"研究人员记录了油鸱在黑暗中导航时发出的“咔哒”声。"}]}],"synonyms":["guácharos","cave oilbirds","Steatornis caripensis"],"phonetic":"/ˈɔɪlˌbɝdz/","extraExplanation":["“oilbird”这个名字来自早期人们发现幼鸟体内脂肪很厚，曾被用来提炼油脂（类似“油”）；如今更多是作为一种独特鸟类的名称来使用。","油鸱也常被称为“guácharo”（源自当地语言/西语用法），在一些地区的洞穴旅游或自然纪录片中会出现。"]}
{"word":"oilcake","summary":{"en":"Oilcake usually means the pressed leftover from oil extraction (feed/fertilizer), and sometimes a cake made with oil.","zh":"Oilcake 通常指榨油后的压榨残渣（作饲料/肥料），也可指用油制作的油蛋糕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The solid, compressed leftover material after oil is pressed out of oil-rich seeds or nuts; it is often used as animal feed or fertilizer.","zh":"（油籽或坚果）榨油后剩下的固体压榨残渣；常用作动物饲料或肥料。"},"examples":[{"en":"After the oil was extracted, the oilcake was sold as cattle feed.","zh":"油被榨出后，油饼被卖作牛饲料。"},{"en":"Some farmers use neem oilcake as an organic fertilizer.","zh":"一些农民用印度楝（neem）油饼作为有机肥料。"}]},{"partOfSpeech":"n.","definition":{"en":"A cake made with a significant amount of oil (instead of butter), often giving it a moist texture.","zh":"（含较多食用油、常不用黄油的）油蛋糕；通常口感更湿润。"},"examples":[{"en":"This lemon oilcake stays moist for days.","zh":"这款柠檬油蛋糕能保持湿润好几天。"},{"en":"In some recipes, olive oil is used to make a light oilcake.","zh":"在一些食谱中，会用橄榄油做成清爽的油蛋糕。"}]}],"synonyms":["press cake","oilseed cake","oilseed meal"],"phonetic":"/ˈɔɪlˌkeɪk/","extraExplanation":["“oilcake”在农业语境里非常常见，指榨油后的“饼/粕”（如豆粕、菜籽饼、花生饼等）。在英式或较专业的写法里也可能出现更具体的词：oilseed meal（油籽粕/饼粕）或 press cake（压榨饼）。","在烘焙语境中，“oilcake”更偏描述性（用油做的蛋糕），实际菜谱标题里也常直接写成 “olive oil cake / orange olive oil cake”等。注意不要把农业用的 oilcake 误解成食用蛋糕。"]}
{"word":"oilcamp","summary":{"en":"An oil camp is a temporary housing camp near an oil site for workers, and it can also refer to the community life around it.","zh":"oil camp 指油田附近为工人设立的临时住宿营地，也可泛指围绕该营地形成的工人社群与生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a temporary living area (often with dorms, trailers, or modular buildings) built to house workers at or near an oil drilling/production site","zh":"（油田附近为工人搭建的）临时营地／生活区（常见宿舍、拖车房或模块化房）"},"examples":[{"en":"He took a job in an oil camp in North Dakota for the winter.","zh":"他冬天去北达科他州的油田营地工作。"},{"en":"The company built an oil camp so crews could stay close to the rigs.","zh":"公司建了油田营地，好让工人住在钻井平台附近。"}]},{"partOfSpeech":"n.","definition":{"en":"the workers’ community and daily life connected to such a camp (used more generally)","zh":"（引申）油田营地相关的工人社群与日常生活"},"examples":[{"en":"Stories from the oil camp often focus on long shifts and rough weather.","zh":"油田营地的故事常常围绕超长工时和恶劣天气。"},{"en":"She wrote about friendships formed in the oil camp.","zh":"她写到了在油田营地里结下的友谊。"}]}],"synonyms":["work camp","labor camp","field camp","man camp"],"phonetic":"ˈɔɪl kæmp","extraExplanation":["“oil camp”在北美语境里常与偏远油田、轮班制（如“two weeks on, one week off”）以及公司提供的集中住宿有关；也常出现在关于石油繁荣期（oil boom）与资源城镇（boomtown）的报道与纪实写作中。","近义说法有时会用“man camp”（更口语，但在一些语境中可能带有争议或负面联想，使用时注意场合）。"]}
{"word":"oilcamps","summary":{"en":"Oilcamps are places where oilfield workers live and work near drilling sites.","zh":"oilcamps 指油田工人靠近钻井点居住和工作的营地/营区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a temporary or semi-permanent place where oilfield workers live and work, usually near drilling sites (often with dorms, cafeterias, and basic services).","zh":"油田营地；油井工人营区（通常靠近钻井现场的临时或半永久居住与工作区，常有宿舍、食堂等基本设施）。"},"examples":[{"en":"Many workers stay in oil camps for weeks at a time during busy drilling seasons.","zh":"在钻井旺季，许多工人会在油田营地一住就是好几周。"},{"en":"The company built new oil camps to house crews in a remote area.","zh":"公司在偏远地区新建了油田营地，用来安置施工队。"}]}],"synonyms":["oil camps","oilfield camps","work camps","man camps"],"phonetic":"/ˈɔɪl kæmps/","extraExplanation":["“oil camp(s)”多用于北美语境，指偏远油气田附近的工人生活区，有点像“工地宿舍区/营房”。在加拿大也常听到“work camp”。","在新闻或纪实写作中，oil camps 常与“boomtown（资源繁荣小镇）”“pipeline（管道工程）”等话题一起出现，反映资源开发带来的迁徙、就业与社区变化。"]}
{"word":"oilcan","summary":{"en":"An oilcan is a container used to pour oil for lubrication; informally, it can also mean to lubricate something with oil.","zh":"oilcan 指用于倒油润滑的油壶；口语中也可作动词，表示给某物上油/润滑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a container (often with a spout) used for holding and pouring oil, especially for lubricating machines","zh":"油壶；加油壶（常带壶嘴，用来装油并给机器上润滑油）"},"examples":[{"en":"He grabbed an oilcan and lubricated the squeaky hinge.","zh":"他拿起油壶，给吱呀作响的门铰链上了润滑油。"},{"en":"Keep the oilcan in the toolbox so it’s easy to find.","zh":"把油壶放在工具箱里，方便拿取。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) to lubricate something with oil","zh":"（非正式）给……上油；用油润滑"},"examples":[{"en":"Oilcan the chain before you ride the bike in the rain.","zh":"下雨天骑车前，先给链条上点油。"},{"en":"The mechanic oilcanned the joints to stop the noise.","zh":"修理工给接头上了油，让噪音消失。"}]}],"synonyms":["oil can","oiler","lubricator"],"phonetic":"/ˈɔɪlˌkæn/","extraExplanation":["“oilcan”更常见的写法是两词：oil can；作动词用时更口语，正式写作中常用 lubricate（润滑）或 oil（给……上油）。","在北美日常语境里，oil can 让人联想到老式带细长壶嘴的加油壶；“oilcan”连写多见于产品名、工具标签或较旧的用法。"]}
{"word":"oilcans","summary":{"en":"Oilcans are small containers with a spout used to store and pour oil, often for lubricating machines.","zh":"Oilcans 指带喷嘴的小型装油容器，常用于给机器上润滑油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small metal or plastic container with a spout, used for storing and pouring oil (especially for machines)","zh":"（尤指给机器用的）注油壶；装油并带喷嘴可倾倒的容器"},"examples":[{"en":"He filled the oilcan and oiled the squeaky hinge.","zh":"他把注油壶装满，给吱呀作响的铰链上了油。"},{"en":"Keep the oilcans in the garage, away from heat.","zh":"把这些注油壶放在车库里，远离热源。"}]}],"synonyms":["oil can","oiler","lubricator"],"phonetic":"/ˈɔɪlˌkæn/","extraExplanation":["“oilcan”是复合名词（oil + can），常见复数为“oilcans”。在工具/维修语境里很常用。"]}
{"word":"oilcase","summary":{"en":"Oilcase is a rare word meaning a container for oil or, in mechanical contexts, a housing that holds lubricating oil.","zh":"Oilcase是个少见词，可指装油容器；在机械语境中也可指盛放润滑油的机壳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a case or container used to hold oil (for storage or carrying).","zh":"（少见）装油用的盒子/容器，用于储存或携带油。"},"examples":[{"en":"He packed a small oilcase for the camping stove.","zh":"他为露营炉子装了一个小的装油盒/装油容器。"},{"en":"The artist kept brushes and a tiny oilcase in the same bag.","zh":"那位画家把画笔和一个小装油容器放在同一个包里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mechanical, uncommon) a casing/housing that holds lubricating oil around moving parts.","zh":"（机械用语，较少见）包住运转部件、盛放润滑油的外壳/机壳。"},"examples":[{"en":"Check the oilcase for leaks before starting the engine.","zh":"发动机启动前检查机油壳是否漏油。"},{"en":"Dirt around the oilcase can hide small cracks.","zh":"机油壳周围的污垢可能会遮住细小裂缝。"}]}],"synonyms":["oil container","oil can","oil tank","crankcase","oil pan"],"phonetic":"/ˈɔɪlˌkeɪs/","extraExplanation":["“oilcase”在现代英语里非常不常用；更多时候会写成两个词“oil case”，或改用更常见、更具体的词：如“oil container / oil can / oil tank / crankcase（曲轴箱）/ oil pan（油底壳）”。","如果你是在汽车或发动机语境里看到它，很可能指“crankcase / oil pan”等部件；建议根据具体部位用标准术语。"]}
{"word":"oilcloth","summary":{"en":"Oilcloth is cloth made waterproof with oil or a coating, used as a protective covering.","zh":"oilcloth 指经过上油或涂层处理的防水布，用来做保护性覆盖物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cloth that has been treated with oil or a waterproof coating, used to protect against water (for example, as a covering, tablecloth, or rain gear).","zh":"油布；防水布（用油或防水涂层处理过的布，用来防水、防潮，比如做罩布、桌布或雨具）。"},"examples":[{"en":"They covered the firewood with oilcloth to keep it dry.","zh":"他们用油布把柴火盖起来，防止受潮。"},{"en":"The picnic table was protected by an oilcloth table cover.","zh":"野餐桌上铺了油布桌布来防水防污。"}]}],"synonyms":["waterproof cloth","tarpaulin","tarp","vinyl tablecloth"],"phonetic":"/ˈɔɪlˌklɔθ/","extraExplanation":["“oilcloth”在19世纪到20世纪早期较常见，尤其用于旅行、户外与家用防水覆盖物。现代日常英语里，人们也常用“waterproof fabric / vinyl tablecloth / tarp”等更具体的说法。","在文学或历史场景中，oilcloth常带有朴素、实用、偏复古的生活气息（例如旧式厨房桌布、船上或露营用的防水盖布）。"]}
{"word":"oilcloths","summary":{"en":"Oilcloths are waterproof treated cloth coverings used to protect surfaces or wrap items.","zh":"Oilcloths 指经防水处理的布料覆盖物，用于保护表面或包裹物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cloth treated with oil or a waterproof coating, used as a protective covering (for tables, floors, bags, etc.). “Oilcloths” is the plural form.","zh":"（经油或防水涂层处理的）防水布；油布（多用于桌面、地面、包等的防护覆盖物）。“oilcloths”为复数。"},"examples":[{"en":"They spread oilcloths over the picnic tables to keep them dry.","zh":"他们在野餐桌上铺上油布，防止桌面被弄湿。"},{"en":"The shop sold oilcloths in bright patterns for easy-to-clean table coverings.","zh":"那家店卖有鲜艳图案的油布，用来做易清洁的桌布。"},{"en":"She wrapped the tools in oilcloths to protect them from rain.","zh":"她用油布把工具包起来，防雨防潮。"}]}],"synonyms":["waterproof cloth","coated cloth","oilcloth (singular)"],"phonetic":"/ˈɔɪlˌklɔθs/","extraExplanation":["“oilcloth”传统上指把亚麻布或棉布涂上亚麻籽油（linseed oil）等，使其防水耐用；后来也常泛指带防水涂层的布料。现代家庭更常见的是乙烯基（vinyl）桌布，但在英美文化里“oilcloth”仍带有一种复古、耐用、好打理的生活用品印象。","相关词：tablecloth（桌布，通常不防水）、tarpaulin/tarp（防水帆布，更厚更偏户外/工地用途）、waxed cloth（蜡布，常用于防水外套或包）。"]}
{"word":"oilcoat","summary":{"en":"An old-fashioned word for a waterproof coat treated with oil or wax.","zh":"旧式说法：用油/蜡处理过、具有防水功能的外套（常指雨衣）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coat (often a raincoat) made waterproof by treating the fabric with oil, wax, or a similar substance.","zh":"（常指雨衣）用油、蜡等处理过以防水的外套/大衣。"},"examples":[{"en":"He grabbed his oilcoat before heading out into the storm.","zh":"出门迎着暴风雨前，他先抓起了那件防水油布外套。"},{"en":"The fisherman wore an oilcoat to stay dry on the wet deck.","zh":"渔夫穿着防水油布外套，在湿滑的甲板上保持干燥。"}]}],"synonyms":["raincoat","waterproof coat","oilskin (coat)","slicker"],"phonetic":"/ˈɔɪlˌkoʊt/","extraExplanation":["“oilcoat”较偏旧式/文学或地方用法；现代英语里更常见的说法是“raincoat”“waterproof coat”，或更具体的“oilskin (coat)”（油布雨衣，常见于航海/渔业语境）。","这种衣物与英国沿海、航海与渔业文化联系很深：传统上会用亚麻布涂亚麻籽油（linseed oil）来防水。经典文学里描写风雨、海上或乡村生活时，偶尔会用到这一词来营造年代感与氛围。"]}
{"word":"oilcup","summary":{"en":"An oilcup is a small machine-mounted cup that holds and supplies lubricating oil to moving parts.","zh":"oilcup 指安装在机器上的油杯，用来储存并向运动部件供应润滑油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small container or reservoir on a machine used to hold and deliver lubricating oil to moving parts.","zh":"（机器上的）油杯；用于储存并向运动部件输送润滑油的小容器/小油壶。"},"examples":[{"en":"Before starting the motor, fill the oilcup with lubricating oil.","zh":"启动电机前，把油杯加满润滑油。"},{"en":"The technician checked the oilcup to make sure the bearings were getting enough oil.","zh":"技术员检查油杯，确保轴承得到足够的润滑。"}]}],"synonyms":["oil cup","oiler","lubricator","drip oiler"],"phonetic":"/ˈɔɪlˌkʌp/","extraExplanation":["“oilcup”常见于机械、工厂设备或老式工具的说明书中，也常写作两词“oil cup”。它与“oil can（注油壶）”不同：oil cup通常是安装在机器上的储油/滴油装置，而oil can是手持工具，用来给油杯或其他部位加油。","在一些老式机床或电机上，oil cup 可能配有小盖子或滴油结构（有时称 drip oiler），用来让油慢慢进入需要润滑的部件。"]}
{"word":"oilcups","summary":{"en":"“Oilcups” are containers on machinery that hold and deliver lubricating oil.","zh":"“oilcups”指机器上的油杯/加油口，用来存放并供给润滑油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small containers on machines used to hold and feed lubricating oil to moving parts (plural of “oil cup”).","zh":"（oil cup 的复数）机器上的“油杯/油壶口”，用于储存并向运动部件滴加或供给润滑油。"},"examples":[{"en":"Check the oilcups before starting the lathe.","zh":"启动车床前先检查油杯。"},{"en":"The technician filled the oilcups and wiped away the excess oil.","zh":"技术员把油杯加满，并擦掉多余的油。"},{"en":"Dust can clog the oilcups, so clean them regularly.","zh":"灰尘会堵住油杯，所以要定期清洁。"}]}],"synonyms":["oil cups","oilers","lubricators","oil reservoirs"],"phonetic":"/ˈɔɪl ˌkʌp/","extraExplanation":["“Oil cup（油杯）”常见于较老式或需要人工润滑的设备（如车床、风扇轴承、织机等）。它通常配合滴油结构或小盖子使用，让油慢慢进入轴承/齿轮等部位。现代设备有时改用“sealed bearings（密封轴承）”或集中润滑系统，因此你在维修手册或旧设备上更容易见到这个词。"]}
{"word":"oildom","summary":{"en":"“Oildom” is internet slang for an adult kink theme combining oil with domination/power play.","zh":"“Oildom”是网络俚语，指把“油”与“支配/权力扮演”结合的成人向性趣主题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Slang, mainly online) A kink/fetish theme involving the use of oil (e.g., body oil) in erotic “domination” or power‑play scenarios; also the community or content related to this theme.","zh":"（俚语，多见于网络）一种性癖/性趣主题，指在情色“支配/臣服”或权力扮演情境中使用油（如身体按摩油等）；也可指与此主题相关的圈子或内容。"},"examples":[{"en":"That tag is used for content related to oildom, so browse carefully if you’re not into adult material.","zh":"那个标签常用于与 oildom 相关的内容；如果你不想看成人内容，浏览时要注意。"},{"en":"Some people discuss oildom as part of broader BDSM interests.","zh":"有些人把 oildom 作为更广泛的 BDSM 兴趣的一部分来讨论。"}]}],"synonyms":["oil domination","BDSM (broader category)","domination (general)"],"phonetic":"/ˈɔɪlˌdɑm/","extraExplanation":["该词多用于成人视频平台、社交媒体标签（tag）或同人/成人视频讨论中，属于成人向词汇。实际含义与呈现方式因社群而异。","“dom”常见于“dominance（支配）/domination（支配行为）”，与“sub（顺从/被支配）”相对；oildom 通常是“oil + dom”的合成。"]}
{"word":"oiled","summary":{"en":"“Oiled” means covered with oil (slippery/greasy) or describes something that has had oil put on it to work smoothly.","zh":"“oiled”表示“涂了油/带油（滑腻）”，也可作“oil”的过去式/过去分词，指“给……上油以更顺畅或保护”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with oil, or made slippery/greasy by oil","zh":"涂了油的；带油的；因油而变得滑腻的"},"examples":[{"en":"His hands were oiled from fixing the engine.","zh":"他修发动机后手上沾满了油。"},{"en":"Be careful—the floor is wet and oiled.","zh":"小心点——地板又湿又油，很滑。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “oil”: to put oil on something to make it move smoothly or to protect it","zh":"“oil”的过去式/过去分词：给……上油，使其更顺畅运转或起保护作用"},"examples":[{"en":"She oiled the hinges so the door wouldn’t squeak.","zh":"她给门铰链上了油，这样门就不会吱吱响了。"},{"en":"The chain has been oiled regularly.","zh":"这条链子一直有定期上油保养。"}]}],"synonyms":["greased","lubricated","slick","oily"],"phonetic":"/ɔɪld/","extraExplanation":["“well-oiled”常用作比喻，表示“运转顺畅、组织有序”。例如：a well-oiled machine（像上了油的机器一样顺畅的团队/系统）。"]}
{"word":"oiler","summary":{"en":"An “oiler” is usually a worker who lubricates machinery, or a tool/container used to apply oil.","zh":"“oiler”通常指给机器上油润滑的工人，也可指用于上油的工具/容器（油壶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who oils, lubricates, or maintains machinery (especially in a factory or on a ship)","zh":"（工厂或船上）给机器上油、润滑并维护设备的工人"},"examples":[{"en":"The oiler checked the engine room and added lubricant to the moving parts.","zh":"上油工检查了机舱，并给运转部件添加了润滑油。"},{"en":"On older ships, an oiler worked closely with the engineers to keep machines running smoothly.","zh":"在较老的船上，上油工会与工程师密切合作，确保机器平稳运转。"}]},{"partOfSpeech":"n.","definition":{"en":"a container or tool used for applying oil (often an oilcan)","zh":"加油器具；油壶（常指油壶/油罐）"},"examples":[{"en":"He filled the oiler and put a few drops on the squeaky hinge.","zh":"他把油壶装满，在吱吱作响的铰链上滴了几滴油。"},{"en":"Keep an oiler in the toolbox for routine maintenance.","zh":"在工具箱里放一个油壶，方便日常保养。"}]}],"synonyms":["lubricator","oil can","oilcan","greaser"],"phonetic":"/ˈɔɪlɚ/","extraExplanation":["“oiler”在海事语境里常指机舱部门的职位（engine department），属于辅助机械运维的工种。现代船舶自动化程度提高，但这个词在历史与职业描述中仍常见。","在体育语境中，“Oilers”也可能是队名（如NHL的Edmonton Oilers），但这属于专有名词，用法与普通名词不同。"]}
{"word":"oilers","summary":{"en":"Oilers is the plural of oiler: a worker who oils machinery, a fuel-carrying/refueling vehicle or ship, or the NHL team Edmonton Oilers.","zh":"Oilers 是 oiler 的复数：可指给机器上油的工人、运油/加油补给的船车等，也可指 NHL 球队“埃德蒙顿油人队”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or worker who oils machines or moving parts to keep them running smoothly","zh":"给机器或活动部件上油以保持顺畅运转的人；加油工；润滑工"},"examples":[{"en":"The oiler checks the factory machines every morning.","zh":"润滑工每天早上检查工厂机器。"},{"en":"Without the oiler, the engine parts would wear out faster.","zh":"没有润滑工，发动机零件会磨损得更快。"}]},{"partOfSpeech":"n.","definition":{"en":"a ship, truck, or aircraft that carries fuel or oil (often for refueling others)","zh":"运油船；油罐车；（常指用于给他者补给的）加油补给舰/补给机"},"examples":[{"en":"The navy oiler supplied fuel to several ships at sea.","zh":"海军补给油船在海上为多艘舰船提供燃料。"},{"en":"An oiler truck delivered heating oil to our neighborhood in winter.","zh":"冬天一辆运油车给我们社区送取暖用油。"}]},{"partOfSpeech":"n.","definition":{"en":"the Edmonton Oilers, a professional ice hockey team in the NHL (plural form used as a team name)","zh":"埃德蒙顿油人队（Edmonton Oilers，加拿大职业冰球队名；复数形式作队名）"},"examples":[{"en":"The Oilers play their home games in Edmonton.","zh":"油人队在埃德蒙顿打主场比赛。"},{"en":"She’s been an Oilers fan for years.","zh":"她当油人队球迷很多年了。"}]}],"synonyms":["lubricator","greaser","fuel tanker","tanker"],"phonetic":"/ˈɔɪlər/","extraExplanation":["“oilers”通常是“oiler”的复数，但在体育新闻里也常直接指 NHL 的球队 Edmonton Oilers（队名本身就是复数）。","在海事与军事语境中，oiler 常指“加油补给舰/运油船”，与 tanker（油轮/油罐车）意思接近，但 oiler 更强调“为他者补给、加油”的功能。"]}
{"word":"oilery","summary":{"en":"Oilery means oily or greasy, and it can also describe someone’s overly smooth, insincere manner.","zh":"oilery 指“油腻的/沾油的”，也可比喻人“油滑、过分圆滑且不真诚”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with oil; greasy and slippery to the touch.","zh":"沾满油的；油腻的，摸起来滑滑的。"},"examples":[{"en":"The mechanic’s hands were oilery after working on the engine.","zh":"修理工修完发动机后，手上油腻腻的。"},{"en":"Be careful—the floor is oilery near the kitchen.","zh":"小心——厨房附近的地面很油滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Unpleasantly smooth, flattering, or insincerely polite.","zh":"（比喻）油滑的；过分圆滑、奉承的，不真诚的。"},"examples":[{"en":"His oilery compliments made her uncomfortable.","zh":"他那些油腻的恭维让她不自在。"},{"en":"The salesman gave an oilery smile and promised a “special deal.”","zh":"推销员露出油滑的笑容，说给你“特别优惠”。"}]}],"synonyms":["oily","greasy","slick","unctuous"],"phonetic":"/ˈɔɪləri/","extraExplanation":["“oilery”不算最常见的拼写，英语里更常见的是 **oily**（油腻的/油滑的）。两者意思很接近；在日常写作中用 **oily** 更自然。","比喻义里，形容一个人“oily/oilery”通常带负面评价：让人感觉虚伪、过度讨好。注意它和 **polite**（礼貌）不同，礼貌不一定不真诚。"]}
{"word":"oilfield","summary":{"en":"An oilfield is a place where oil is produced from the ground or seabed, with wells and supporting facilities.","zh":"Oilfield 指“油田”，即从陆地或海底开采石油的区域，包含油井和配套设施。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an area of land or seabed where oil is found and extracted, usually with multiple wells and related facilities","zh":"油田；发现并开采石油的区域（通常有多口油井及相关设施）"},"examples":[{"en":"He got a job as an engineer in an oilfield in West Texas.","zh":"他在德克萨斯州西部的一处油田找到了一份工程师的工作。"},{"en":"The company plans to develop a new offshore oilfield.","zh":"该公司计划开发一处新的海上油田。"}]}],"synonyms":["petroleum field","oil-producing field"],"phonetic":"/ˈɔɪlˌfiːld/","extraExplanation":["“Oilfield”是复合名词（oil + field）。这里的field不是“运动场/田地”的字面意思，而是指“资源开采区域/矿区”的引申用法。","常见搭配：oilfield worker（油田工人）、oilfield services（油田服务/油田技术服务）、oilfield equipment（油田设备）、oilfield development（油田开发）。","在新闻或学术语境中也会看到更技术性的近义词，如 oil deposit（石油矿藏，偏“储量/矿藏”）和 oil reservoir（油藏，偏地质结构）。"]}
{"word":"oilfields","summary":{"en":"Oilfields are places where oil is found and drilled, on land or offshore.","zh":"Oilfields 指发现并开采石油的地区，可在陆地或海上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"areas of land or sea where oil is found and extracted (including the wells and related facilities)","zh":"油田；石油开采区（包括油井及相关设施）"},"examples":[{"en":"Many workers in the oilfields live in temporary camps near the drilling sites.","zh":"许多油田工人住在靠近钻井地点的临时营地里。"},{"en":"New technology has made some old oilfields profitable again.","zh":"新技术让一些老油田再次变得有利可图。"},{"en":"The government tightened safety rules for offshore oilfields.","zh":"政府收紧了对海上油田的安全规定。"}]}],"synonyms":["oil-producing fields","petroleum fields","oil patch"],"phonetic":"/ˈɔɪlˌfildz/","extraExplanation":["“oilfields”是“oilfield”的复数形式。单数 oilfield 常指一大片可开采石油的区域；复数 oilfields 常用于谈论多个油田，或泛指“油田行业/油田地区”（如：life in the oilfields）。在新闻与经济语境中，它常与drilling（钻探）、rig（钻机/钻井平台）、pipeline（管道）、refinery（炼油厂）等词一起出现。"]}
{"word":"oilfired","summary":{"en":"“Oil-fired” describes equipment that runs on heat produced by burning oil.","zh":"“oil-fired”指通过燃烧燃油来产生热量并运行的设备。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Powered by burning oil (fuel oil or diesel), especially in a heater, boiler, furnace, or power plant.","zh":"以燃油（如燃料油或柴油）燃烧提供动力或热量的；常用于锅炉、暖炉、熔炉或发电设备。"},"examples":[{"en":"The building has an oil-fired boiler for winter heating.","zh":"这栋楼冬天取暖用的是燃油锅炉。"},{"en":"They replaced the oil-fired furnace with a heat pump to cut emissions.","zh":"他们把燃油炉换成了热泵，以减少排放。"}]}],"synonyms":["oil-burning","oil-fueled","diesel-fired","fuel-oil-fired"],"phonetic":"/ˈɔɪl ˌfaɪrd/","extraExplanation":["“oil-fired”通常作定语并用连字符（oil-fired boiler）。在作表语时也可写作“oil fired”（The boiler is oil fired）。在正式写作中，作定语更常见连字符写法。","语境上常与能源、成本、排放相关；在环保讨论中可能与“gas-fired（燃气的）”“coal-fired（燃煤的）”对比出现。"]}
{"word":"oilfish","summary":{"en":"Oilfish is a very oily deep-sea fish (often referring to escolar), known for a rich texture but possible digestive effects if eaten too much.","zh":"oilfish 指高油脂的深海鱼（常指 escolar），口感浓厚，但过量食用可能引起消化不适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of very oily deep-sea fish; the name is often used for species such as escolar, which can cause stomach upset if eaten in large amounts","zh":"一种含油脂很高的深海鱼；这个名称常指“油鱼/圆鳕（escolar）”等品种，吃多了可能引起肠胃不适"},"examples":[{"en":"Some restaurants label escolar as oilfish on the menu.","zh":"有些餐厅会在菜单上把 escolar 标成 oilfish。"},{"en":"Oilfish has a rich, buttery texture, so a small portion is usually recommended.","zh":"oilfish 口感浓郁像黄油，一般建议少量食用。"}]}],"synonyms":["escolar"],"phonetic":"/ˈɔɪlˌfɪʃ/","extraExplanation":["oilfish 在英文里常是“通用俗名”，不同地区可能指不同鱼种，但最常见的关联是 escolar（中文常译“油鱼/圆鳕”等）。","有些油鱼类含较多“蜡酯（wax esters）”，人体不易消化；因此部分国家/地区对销售或标示有规定。点餐或购买时可留意是否标注 escolar、white tuna（常见误标名）等。"]}
{"word":"oilfishes","summary":{"en":"“Oilfishes” means more than one oilfish—large deep-sea fish with very oily flesh.","zh":"“oilfishes”指多条 oilfish（油鱼）：肉质油脂含量很高的深海鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oilfish: a large deep-sea fish (especially Ruvettus pretiosus) with very oily flesh; sometimes sold for food but known for causing digestive upset in some people.","zh":"oilfish 的复数：一种大型深海鱼（尤指油鱼 Ruvettus pretiosus），肉质含油量很高；有时作为食用鱼出售，但部分人食用后可能出现肠胃不适。"},"examples":[{"en":"Some menus list oilfishes, but the label can be confusing.","zh":"有些菜单会写 oilfishes，但这个标注可能会让人困惑。"},{"en":"Because oilfishes are extremely oily, some people avoid eating them.","zh":"由于 oilfishes 的脂（油）含量非常高，有些人会避免食用。"}]}],"synonyms":["oilfish","deep-sea fish"],"phonetic":"/ˈɔɪlˌfɪʃ/","extraExplanation":["“oilfish / oilfishes”在日常语境里可能被泛指为“很油的鱼”，但在较严格的语境中常指特定物种“油鱼（Ruvettus pretiosus）”。有些地区曾把与其相近、同样高蜡酯含量的“escolar（常译：油甘鱼/白金枪鱼等误称）”一起混称或混卖，因此购买或点餐时看清学名/标签更稳妥。"]}
{"word":"oilheating","summary":{"en":"Oil heating is heating a building by burning heating oil in a furnace or boiler.","zh":"Oil heating 指通过燃烧取暖油在炉子或锅炉中为建筑供暖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system or method of heating a building by burning heating oil (fuel oil) in a furnace or boiler.","zh":"用取暖油（燃料油）在炉子或锅炉中燃烧来给建筑供暖的系统或方式。"},"examples":[{"en":"Many older homes in the Northeast still use oil heating in winter.","zh":"美国东北部许多较老的房子冬天仍然使用燃油供暖。"},{"en":"We switched from oil heating to a heat pump to cut energy costs.","zh":"我们把燃油供暖换成了热泵，以降低能源费用。"},{"en":"If you have oil heating, you may need to schedule regular tank inspections.","zh":"如果你使用燃油供暖，可能需要定期安排油罐检查。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of warming something using oil as the heat-transfer medium or fuel (less common).","zh":"用油作为传热介质或燃料来加热的过程（较不常见）。"},"examples":[{"en":"The factory uses oil heating to keep the machinery at a stable temperature.","zh":"工厂用油加热来让机器保持稳定温度。"}]}],"synonyms":["heating with oil","fuel-oil heating","oil-fired heating"],"phonetic":"/ˈɔɪl ˌhiːtɪŋ/","extraExplanation":["在日常英语里更常见的写法是分开：oil heating；也会看到作定语的形式：an oil-heating system / an oil-heated home。","英美语境中它通常指“家用取暖油（heating oil）+ 油罐（oil tank）+ 锅炉/炉子（boiler/furnace）”的供暖方式，常见于冬季寒冷地区。"]}
{"word":"oilhole","summary":{"en":"An oil hole is a small opening in a machine used for lubricating it with oil.","zh":"oilhole（oil hole）指机器上的注油孔，用来加油润滑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small opening in a machine or engine used for adding oil or letting oil reach moving parts for lubrication","zh":"（机器或发动机上的）加油孔／注油孔；用于添加机油或让机油进入运动部件以润滑的小孔"},"examples":[{"en":"Add a few drops of oil through the oil hole every month.","zh":"每个月通过注油孔滴几滴油。"},{"en":"Dust can block the oil hole and cause the motor to wear out faster.","zh":"灰尘可能堵住注油孔，导致电机磨损更快。"}]}],"synonyms":["oiling hole","oil port","lubrication hole"],"phonetic":"/ˈɔɪl ˌhoʊl/","extraExplanation":["“oil hole”常见于机械、缝纫机、风扇、电机等说明书或维修语境中，也会写作 **oilhole**（较少见）或 **oil port / oiling hole**。日常英语里更常说 *oil hole*（两词）或用更具体的部件名。"]}
{"word":"oilholes","summary":{"en":"Oilholes can mean oil wells drilled for petroleum, or small machine openings used to add lubricating oil.","zh":"Oilholes 可以指为开采石油钻出的油井，也可以指机械上用于加注润滑油的小孔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Holes drilled into the ground to reach and extract petroleum (oil); oil wells (plural).","zh":"为开采石油而在地下钻出的孔；油井（复数）。"},"examples":[{"en":"Several oilholes were drilled offshore to test for new reserves.","zh":"为了测试新的储量，人们在近海钻了好几口油井。"},{"en":"The company closed old oilholes to reduce environmental risk.","zh":"公司封闭了旧油井，以降低环境风险。"}]},{"partOfSpeech":"n.","definition":{"en":"Small openings in a machine part where oil is added for lubrication (plural).","zh":"机械零件上用于加注润滑油的小孔（复数）。"},"examples":[{"en":"Add a few drops of oil into the oilholes every week.","zh":"每周在这些加油孔里滴几滴油。"},{"en":"Dust can clog the oilholes and make the gears noisy.","zh":"灰尘会堵塞加油孔，让齿轮变得很吵。"}]}],"synonyms":["oil wells","oil bores","wells","lubrication holes","oil ports"],"phonetic":"/ˈɔɪl ˌhoʊl/","extraExplanation":["“oilhole”常见写法也有 oil hole（分开写）或 oilhole（合写）；在石油行业里更常说 oil well（油井）。","在机械语境中，“oil hole”指加注润滑油的小孔，常见于缝纫机、钟表、旧式电机等说明书。"]}
{"word":"oilier","summary":{"en":"“Oilier” means “more oily” (more grease or shine) and can also mean “more slick/unctuous” in behavior or speech.","zh":"“Oilier”意为“更油的”（更油脂或更油亮），也可比喻“更油滑/更谄媚”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more oily; having more oil, grease, or an oily shine (comparative form of “oily”)","zh":"更油的；更含油脂的；更油亮的（“oily”的比较级）"},"examples":[{"en":"In summer my skin gets oilier, so I use a lighter moisturizer.","zh":"夏天我的皮肤会更油，所以我会用更清爽的保湿霜。"},{"en":"This fish is oilier than the one we ate yesterday.","zh":"这条鱼比我们昨天吃的那条更油。"},{"en":"The soup became oilier after we added more pork fat.","zh":"加了更多猪油后，这汤变得更油了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) more slick, flattering, or untrustworthy in manner or speech","zh":"（比喻）更油滑的；更谄媚的；更不可信的（言行举止）"},"examples":[{"en":"His answers sounded oilier when the reporter asked tougher questions.","zh":"记者问到更尖锐的问题时，他的回答听起来更油滑了。"},{"en":"The salesman got oilier the moment he realized I might buy.","zh":"推销员一发现我可能会买，态度就更谄媚了。"}]}],"synonyms":["greasier","more oily","slicker","more unctuous"],"phonetic":"ˈɔɪliər","extraExplanation":["“oilier”是形容词“oily”的比较级：以辅音字母 + y 结尾时，通常把 y 变成 i，再加 -er（oily → oilier；happy → happier）。","在口语里形容一个人“oily”，常带贬义，指说话做事“油腔滑调/假客气”，和“greasy”（油腻/令人不舒服）在语气上有相近之处。"]}
{"word":"oiliest","summary":{"en":"“Oiliest” means “the most oily,” either literally (most greasy) or figuratively (most slick/insincere).","zh":"“oiliest”表示“最油的/最油腻的”，也可比喻“最油滑、最不真诚的（谄媚的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “oily”: having the most oil; the most greasy or slippery.","zh":"“oily”的最高级：含油最多的；最油腻的；最滑的。"},"examples":[{"en":"Of all the fast-food meals, this one is the oiliest.","zh":"在所有快餐里，这一份是最油腻的。"},{"en":"The oiliest part of the fish is near the skin.","zh":"鱼最油的部分通常靠近鱼皮。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) The most overly flattering, insincere, or “slick” in a way that feels unpleasant.","zh":"（比喻）最油滑的；最谄媚且不真诚、让人不舒服的。"},"examples":[{"en":"He gave the oiliest smile and tried to sell me something I didn’t need.","zh":"他露出最油滑的笑容，想推销我根本不需要的东西。"},{"en":"Her oiliest compliments didn’t convince anyone.","zh":"她那些最谄媚的恭维并没有说服任何人。"}]}],"synonyms":["greasiest","slickest","slipperiest","smarmiest"],"phonetic":"/ˈɔɪ.li.əst/","extraExplanation":["“oiliest”是形容词“oily”的最高级形式：oily → oilier → oiliest。拼写上把y变成i再加-er/-est（如：happy → happier → happiest）。","口语里也常用“greasiest”表示“最油腻的”，用“slickest / smarmiest”表示“最油滑、最谄媚的”。"]}
{"word":"oiligarchy","summary":{"en":"Oligarchy means rule by a small powerful group, or the group itself.","zh":"oligarchy 指“寡头政治/寡头统治”，也可指掌权的少数寡头集团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A government or power system controlled by a small group of people, often wealthy or influential.","zh":"由少数人（常为富有或有影响力的人）控制的政府或权力体系。"},"examples":[{"en":"After the revolution, many people felt the country turned into an oligarchy run by a few powerful families.","zh":"革命后，许多人觉得这个国家变成了由少数强大家族掌控的寡头政治。"},{"en":"Critics argue that when money dominates elections, democracy can slide toward oligarchy.","zh":"批评者认为，当金钱主导选举时，民主可能滑向寡头统治。"}]},{"partOfSpeech":"n.","definition":{"en":"The small group of people who hold the most power in a country, organization, or industry.","zh":"在国家、组织或行业中掌握最大权力的少数人集团（寡头集团）。"},"examples":[{"en":"An oligarchy of executives made the final decision behind closed doors.","zh":"一小撮高管寡头在密室里做出了最终决定。"},{"en":"The tech oligarchy has enormous influence over public conversation.","zh":"科技寡头集团对公共讨论有巨大的影响力。"}]}],"synonyms":["rule by a few","elite rule","plutocracy (related)"],"phonetic":"/ˈɑlɪˌɡɑrki/","extraExplanation":["你输入的“oiligarchy”通常是“oligarchy”的拼写错误。","词源：来自希腊语 oligos（“少数的”）+ -archy（“统治/政体”）。常用于政治新闻与社会评论，带有批判色彩时较多。","相关词：oligarch（寡头，指个人）；oligarchic（寡头的/寡头统治的）。","近义表达（语气接近但不完全等同）：rule by a few（少数人统治）、elite rule（精英统治）；对立概念：democracy（民主）、pluralism（多元）。"]}
{"word":"oilily","summary":{"en":"Oilily is a Dutch fashion brand famous for colorful, patterned children’s clothing and accessories.","zh":"Oilily 是一个荷兰时尚品牌，以色彩鲜艳、图案丰富的童装与配饰闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dutch fashion brand known for colorful, patterned clothing and accessories, especially for children (also makes some women’s items).","zh":"（Oilily）荷兰时尚品牌，以色彩鲜艳、图案丰富的服装与配饰闻名，尤其以童装著称（也有部分女装）。"},"examples":[{"en":"She bought an Oilily backpack because she loves bright prints.","zh":"她买了一个 Oilily 的背包，因为她喜欢鲜艳的印花。"},{"en":"Oilily is popular for children’s coats with bold colors and patterns.","zh":"Oilily 以颜色大胆、图案丰富的儿童外套而受欢迎。"}]}],"synonyms":["(no true synonym; it’s a brand name)"],"phonetic":"/ˈɔɪlɪli/","extraExplanation":["Oilily 通常作为专有名词（品牌名）使用，日常写作中首字母大写。","该品牌在欧洲较常见，风格特点是“童趣、明亮、多图案拼接”。不同国家的销售渠道与产品线可能略有差异。"]}
{"word":"oiliness","summary":{"en":"Oiliness means the state or feeling of being oily, often about skin, hair, or food.","zh":"Oiliness 指“油腻/出油”的状态或感觉，常用于皮肤、头发或食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being oily; an oily feel or appearance, especially on skin, hair, or food.","zh":"油腻（感）；出油的状态或外观（常指皮肤、头发或食物）。"},"examples":[{"en":"This sunscreen helps control facial oiliness during the day.","zh":"这款防晒可以帮助控制白天脸部出油。"},{"en":"The oiliness of the pizza made it hard to eat more than one slice.","zh":"披萨太油腻，让人很难吃超过一片。"},{"en":"Shampoo for oily hair can reduce oiliness without drying your scalp too much.","zh":"适合油性头发的洗发水能减少出油，同时不会把头皮弄得太干。"}]}],"synonyms":["greasiness","oiliness (skin)","excess oil","slickness"],"phonetic":"/ˈɔɪlinəs/","extraExplanation":["“oiliness”常用于护肤/美妆语境（如“control oiliness 控油”），也可用于形容食物口感（油腻）。在表达皮肤问题时，更自然的搭配有：skin oiliness（皮肤出油）、oily T-zone（T区出油）、excess oil（多余油脂）。","词形上，-ness 是常见名词后缀，用来表示“性质/状态”（例如: dry → dryness 干燥；oily → oiliness 油腻/出油）。"]}
{"word":"oilinesses","summary":{"en":"“Oilinesses” is the plural of “oiliness,” meaning different kinds or degrees of oily/greasy condition, especially in skin, hair, or food; it can also mean an overly smooth, insincere manner (less common).","zh":"“oilinesses”是“oiliness”的复数，表示不同类型或不同程度的油腻/出油状态（常见于皮肤、头发或食物）；也可指油滑、虚伪的圆滑（较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or condition of being oily (having a lot of oil or grease), especially on skin, hair, or food","zh":"油腻；出油（指皮肤、头发或食物油脂较多的状态）"},"examples":[{"en":"Different moisturizers are designed for different skin oilinesses.","zh":"不同的保湿霜是为不同程度的皮肤出油设计的。"},{"en":"The oiliness of the sauce can be reduced by skimming the fat from the top.","zh":"把表面的油脂撇掉可以减少酱汁的油腻感。"}]},{"partOfSpeech":"n.","definition":{"en":"a style or feeling that seems overly smooth, flattering, or insincere (less common)","zh":"（较少用）油滑；虚情假意的圆滑感"},"examples":[{"en":"People disliked the oiliness of his compliments.","zh":"人们不喜欢他那些过分奉承的话里透出的油滑感。"}]}],"synonyms":["greasiness","oiliness","fattiness","slickness (figurative)","unctuousness (figurative)"],"phonetic":"/ˈɔɪlinəs/","extraExplanation":["“oilinesses”是名词“oiliness”的复数形式。英语里表示抽象性质的名词通常不可数，但当你要强调“不同类型/不同程度的油腻或出油情况”（例如不同肤质、不同样品）时，就会用复数。"]}
{"word":"oiling","summary":{"en":"“Oiling” means applying oil to something (or the act of doing so) to reduce friction, prevent noise, or protect it.","zh":"“Oiling”指给物体上油（或上油这件事），以减少摩擦、避免异响或起到保护作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of putting oil on something to make it move smoothly, protect it, or keep it from drying out","zh":"给某物上油（润滑、保护、防止干燥等）的行为"},"examples":[{"en":"Regular oiling keeps the door hinges from squeaking.","zh":"定期上油可以防止门铰链吱吱作响。"},{"en":"The manual recommends oiling the chain every 200 miles.","zh":"说明书建议每行驶200英里给链条上一次油。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “oil”: putting oil on something; or producing/using oil","zh":"“oil”的现在分词：正在给……上油；或与产油/用油有关"},"examples":[{"en":"He is oiling the pan before adding the eggs.","zh":"他正在给平底锅抹油，然后再打鸡蛋。"},{"en":"The worker was oiling the machine when the supervisor arrived.","zh":"主管到时，工人正在给机器上油。"}]}],"synonyms":["lubricating","greasing","anointing"],"phonetic":"/ˈɔɪlɪŋ/","extraExplanation":["“oiling”常出现在比喻表达里，如 **oil the wheels** / **oil the gears**，意思是“让事情更顺利地进行”（有时也含“用钱或好处打点”的暗示，语境不同要注意分辨）。"]}
{"word":"oilish","summary":{"en":"Oilish means “somewhat oily,” but it’s uncommon; most speakers say “oily.”","zh":"oilish 表示“有点油/略带油质”，但不常用；更常见说法是 oily。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat oily; having a slight oil-like look, feel, or smell (not a very common word).","zh":"有点油的；略带油质的（不太常见的用法）。"},"examples":[{"en":"After the long ride, his hair felt oilish and needed a wash.","zh":"长途骑行后，他的头发摸起来有点油，需要洗一洗。"},{"en":"The sauce looked oilish on top, so she skimmed off the extra oil.","zh":"酱汁表面看起来有点油，她就把多余的油撇掉了。"}]}],"synonyms":["oily","greasy","slick (sometimes)"],"phonetic":"ˈɔɪlɪʃ","extraExplanation":["“oilish”主要是把名词“oil（油）”加上后缀“-ish”构成，表示“有点像……/略微……（somewhat）”。英语里更常见的表达通常是“oily（油腻的）”或“a bit oily”。"]}
{"word":"oilless","summary":{"en":"“Oilless” means without oil or not using oil.","zh":"“oilless”表示“无油的；不含油/不用油的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without oil; not containing or using oil (especially in cooking, machinery, or products).","zh":"无油的；不含油的；不用油的（常用于烹饪、机械或产品）"},"examples":[{"en":"She made oilless fries in an air fryer.","zh":"她用空气炸锅做了无油薯条。"},{"en":"The factory tested an oilless compressor to reduce maintenance.","zh":"工厂测试了一种无油压缩机以减少维护。"},{"en":"This oilless moisturizer is good for oily skin.","zh":"这款无油保湿霜适合油性皮肤。"}]}],"synonyms":["oil-free","without oil","non-oily"],"phonetic":"/ˈɔɪlləs/","extraExplanation":["“oilless”常见于三类语境：①烹饪/健康饮食（oilless cooking 无油烹饪）；②工程设备（oilless compressor 无油压缩机，强调不需润滑油、避免污染）；③护肤品/化妆品（oil-free 与 oilless 都可表示“无油配方”，但产品上更常见的是 oil-free）。"]}
{"word":"oillessness","summary":{"en":"“Oillessness” means the condition of having no oil or lacking oil.","zh":"“oillessness”表示“无油/缺油的状态或性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of having no oil; a lack of oil (literal or figurative).","zh":"无油状态；缺油（可指字面上的没有油，也可作比喻用法）。"},"examples":[{"en":"The machine stopped because of oillessness in the engine.","zh":"由于发动机缺油，那台机器停了下来。"},{"en":"The oillessness of her skin made it feel tight in winter.","zh":"她皮肤在冬天缺油，所以感觉紧绷。"},{"en":"In a figurative sense, the essay’s “oillessness” refers to its dry, unflowing style.","zh":"从比喻意义上说，那篇文章的“无油感”指它文风干涩、不流畅。"}]}],"synonyms":["lack of oil","oil shortage","oil starvation","dryness"],"phonetic":"/ˈɔɪlləsnəs/","extraExplanation":["这个词比较少见，多用于技术语境（机器缺润滑油）或描述皮肤/头发“缺油”。构词法很直观：oil（油）+ -less（没有…的）+ -ness（名词后缀，表示“……的状态/性质”）。正式写作里更常用 lack of oil / oil starvation（机械）或 dryness（皮肤、文风）。"]}
{"word":"oillet","summary":{"en":"Oillet is a small opening—either a loophole in a fortification wall or a reinforced hole for laces (a variant of “eyelet”).","zh":"oillet 指小孔：可指要塞墙上的射击孔，也可指用于穿带的加固小孔（“eyelet”的异拼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small narrow opening in a wall (especially in a castle or fort) used for shooting arrows or firearms; a loophole","zh":"（城堡或要塞墙上的）射击孔；枪眼；箭孔"},"examples":[{"en":"The archers aimed through an oillet in the stone wall.","zh":"弓箭手透过石墙上的射击孔瞄准。"},{"en":"From outside, the oillets were almost invisible.","zh":"从外面看，这些枪眼几乎看不见。"}]},{"partOfSpeech":"n.","definition":{"en":"a small hole reinforced with stitching or a metal ring for passing a lace, cord, or string through (a spelling variant of “eyelet”)","zh":"（用于穿带、穿绳的）鸡眼孔；扣眼（“eyelet”的异拼）"},"examples":[{"en":"Thread the lace through the oillets and pull it tight.","zh":"把鞋带穿过鸡眼孔，然后拉紧。"},{"en":"The curtain has metal oillets along the top for the rod.","zh":"窗帘上沿有金属鸡眼孔，方便穿杆。"}]}],"synonyms":["eyelet","loophole","arrow slit"],"phonetic":"/ˈɔɪlɪt/","extraExplanation":["“oillet”在现代英语中比较少见，更常见的拼写是“eyelet”。在军事/城堡语境里，它常指墙上的狭小射击孔；在服装与手工语境里，它常指加固的小孔（鸡眼孔）。","词源上与“eye（眼睛）”有关，来自古法语，原意类似“小眼睛”，形象地描述墙上的小孔像一只小眼在观察外面。"]}
{"word":"oillike","summary":{"en":"“Oillike” means similar to oil in look or feel, often greasy, shiny, or slippery.","zh":"“oillike”表示在外观或触感上像油，常指油腻、发亮或很滑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the texture, appearance, or qualities of oil (for example, smooth, greasy, or slippery).","zh":"像油的；具有油的质地、外观或特性（如光滑、油腻或滑溜）。"},"examples":[{"en":"The sauce has an oil-like sheen on top.","zh":"这酱汁表面有一层像油一样的光泽。"},{"en":"Some lotions feel oil-like but absorb quickly.","zh":"有些乳液摸起来像油一样，但吸收很快。"},{"en":"An oil-like film covered the surface of the water.","zh":"水面上覆盖着一层油状薄膜。"}]}],"synonyms":["oil-like","oily","greasy","slick","slippery"],"phonetic":"/ˈɔɪlˌlaɪk/","extraExplanation":["常见写法是带连字符的 oil-like（尤其放在名词前作定语时：an oil-like sheen）。作表语时也可不带连字符：The liquid is oillike/oil-like。两种拼写都能见到，但 oil-like 更常见、更清晰。"]}
{"word":"oilman","summary":{"en":"An oilman is usually someone who works in the petroleum industry; less commonly, it can mean a worker who oils machines.","zh":"oilman通常指石油行业从业者；较少见时也可指给机器加油润滑的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works in the oil industry, especially one involved in producing, selling, or managing oil (petroleum).","zh":"（尤指石油工业中的）石油从业者；从事石油开采、销售或经营管理的人。"},"examples":[{"en":"Her grandfather was an oilman in Texas and worked on drilling sites.","zh":"她祖父在德州做过石油工人，曾在钻井现场工作。"},{"en":"The town grew quickly after oilmen arrived to develop the fields.","zh":"石油从业者来开发油田后，这座小镇迅速发展起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who oils or lubricates machines as part of their job.","zh":"（负责给机器加油润滑的）润滑工；加油工。"},"examples":[{"en":"The oilman checked the gears and added lubricant before the shift began.","zh":"开工前，润滑工检查了齿轮并加了润滑油。"}]}],"synonyms":["petroleum worker","oil worker","oil industry worker","oil executive","wildcatter (US, informal)"],"phonetic":"/ˈɔɪl.mən/","extraExplanation":["“oilman”在现代英语里更常指“石油行业的人”，尤其在美国语境中常让人联想到石油产区（如德州）以及与石油财富相关的社会形象。","第二个意思（给机器润滑的人）较偏旧式或行业用法；日常更常说“maintenance worker / mechanic”。"]}
{"word":"oilmen","summary":{"en":"Oilmen = men working in the oil industry; sometimes oil traders/dealers.","zh":"oilmen 指石油行业从业男性（复数）；有时也指石油买卖/经销人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Men who work in the oil industry, especially in producing (drilling) or managing oil and gas operations.","zh":"从事石油行业的男性（复数），尤指在石油天然气开采（钻井）或运营管理领域工作的人。"},"examples":[{"en":"Many oilmen moved to Texas during the boom.","zh":"在石油繁荣时期，许多石油从业者搬到了德克萨斯州。"},{"en":"The town’s economy depends on oilmen and drilling crews.","zh":"这个城镇的经济依赖石油从业者和钻井队。"}]},{"partOfSpeech":"n.","definition":{"en":"Men who buy, sell, or distribute oil and petroleum products (less common today).","zh":"买卖或分销石油及其产品的男性（复数；如今较少见）。"},"examples":[{"en":"Local oilmen negotiated supply contracts with factories.","zh":"当地的石油商人与工厂谈判供货合同。"},{"en":"In the early 1900s, oilmen often acted as both traders and investors.","zh":"在20世纪初，石油商人常常既是贸易商也是投资者。"}]}],"synonyms":["oil workers","oil industry workers","petroleum workers","oil executives","oil traders"],"phonetic":"/ˈɔɪl.mən/","extraExplanation":["“oilmen”是“oilman”的复数。现代英语里也常用更中性的说法，如“oil workers”（石油工人）、“people in the oil industry”（石油行业从业者）、“oil executives”（石油公司高管）。","在美国文化语境中，“oilmen”常让人联想到德州、俄克拉荷马等地的石油繁荣（oil boom）以及“wildcatter”（早期冒险钻探者）等历史形象。"]}
{"word":"oilmonger","summary":{"en":"An old-fashioned word meaning an oil seller or oil dealer.","zh":"旧用词，指卖油的人/油商。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who sells oil, especially lamp oil; an oil dealer (now uncommon/old-fashioned).","zh":"卖油的人；油商（尤指卖灯油；现多为旧用/不常见）"},"examples":[{"en":"In the 1800s, an oilmonger might deliver lamp oil to homes in the evening.","zh":"在19世纪，卖油的人可能会在傍晚把灯油送到住户家里。"},{"en":"The novel describes a small town with a baker, a cobbler, and an oilmonger.","zh":"小说描写了一个小镇，有面包师、鞋匠和卖油的人。"}]}],"synonyms":["oil dealer","oil merchant","oil seller"],"phonetic":"/ˈɔɪlˌmʌŋɡɚ/","extraExplanation":["“monger”意为“贩卖者/商贩”，常见于复合词里，如 fishmonger（鱼贩）、ironmonger（五金商）。现代英语中单独用 “monger” 有时带贬义（暗示唯利是图或散布某物，如 warmonger“战争贩子”），但在 “oilmonger” 这种职业名词里通常是中性、偏历史用法。","如今更常用的说法是 oil dealer、oil merchant，或根据具体行业说 fuel supplier、petroleum trader 等。"]}
{"word":"oilmongery","summary":{"en":"“Oilmongery” is a rare word meaning the trade in oil, or (critically) profiteering/pushing oil-related interests.","zh":"“oilmongery”是个罕见词，可指卖油/石油贸易，也可（带批评）指借石油相关利益进行炒作牟利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The business or practice of selling oil; the trade in oil.","zh":"（罕见）卖油的生意；石油/油品买卖行业。"},"examples":[{"en":"In the 1800s, small-town oilmongery could support an entire family.","zh":"在19世纪，小镇上的卖油生意就能养活一家人。"},{"en":"He left oilmongery and began working as a clerk.","zh":"他不再做卖油的生意，转而去当店员。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, often critical) Aggressive promotion or profiteering connected with oil.","zh":"（引申义，常含批评）与石油有关的强势推销或牟利行为。"},"examples":[{"en":"Some critics called the campaign a form of oilmongery.","zh":"一些批评者把这场宣传称为一种“借石油牟利/炒作”的行为。"},{"en":"They accused the company of oilmongery during the price spike.","zh":"他们指责那家公司在价格暴涨时借机炒作牟利。"}]}],"synonyms":["oil trade","oil business","oil dealing","oil-mongering"],"phonetic":"/ˈɔɪlˌmʌŋɡəri/","extraExplanation":["“oilmongery / oil-mongery”非常少见，更常见的表达是“oil trade（石油贸易）”“oil business（石油行业）”。","词根“monger”表示“（尤指为利）贩卖、兜售的人/行为”，常见于带贬义的复合词，如“war-monger（鼓吹战争的人）”“rumor-mongering（散布谣言）”。如果你想表达“炒作/兜售石油”，更自然的说法是“oil-mongering”。","你输入的“oilmongery”可能是拼写变体；更常见的拼写会加连字符：oil-mongery。"]}
{"word":"oilometer","summary":{"en":"An oilometer is a device used to test oil—especially by measuring its density/specific gravity—to help judge quality or purity.","zh":"oilometer 指用于检测油类（尤指测密度/比重以判断纯度与质量）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to measure properties of oil (especially its density/specific gravity), historically to judge the quality or purity of oils.","zh":"油比重计（或油质检测仪）：一种测量油类性质（尤指密度/比重）的仪器，历史上常用于判断油品的质量或纯度。"},"examples":[{"en":"The merchant used an oilometer to check whether the olive oil had been diluted.","zh":"商人用油比重计检查橄榄油是否被掺假稀释了。"},{"en":"In older manuals, the oilometer is listed alongside other simple testing tools.","zh":"在较早的手册里，油比重计常与其他简易检测工具一起被列出。"}]}],"synonyms":["oleometer","hydrometer (for oils)","densitometer (for oils)"],"phonetic":"/ɔɪˈlɑːmɪtər/","extraExplanation":["这个词较少见，在现代英语里更常用的是更具体的说法，如 hydrometer（比重计）、densitometer（密度计）、viscometer（黏度计）等。","oilometer 常被视为 oleometer 的变体拼写；oleo- 来自拉丁语 oleum（油），因此有“测油的仪器”之意。"]}
{"word":"oilpaper","summary":{"en":"Oilpaper is oil-treated paper used to repel water and grease, often for wrapping or waterproofing.","zh":"Oilpaper 指涂油处理过、能防水防油的纸，常用于包裹或防潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"paper that has been treated with oil (or another waterproofing substance) so it resists water and grease; used for wrapping, covering, or waterproofing.","zh":"涂过油（或其他防水材料）的纸，能防水防油；常用于包裹、覆盖或防潮。"},"examples":[{"en":"The shop wrapped the pastries in oilpaper to keep the grease from soaking through.","zh":"店家用油纸包点心，避免油渗出来。"},{"en":"In older kitchens, oilpaper was sometimes used to cover jars and keep moisture out.","zh":"在旧式厨房里，人们有时会用油纸盖住罐子来防潮。"}]}],"synonyms":["oil paper","greaseproof paper","wax paper"],"phonetic":"/ˈɔɪlˌpeɪpɚ/","extraExplanation":["“oilpaper”也常写作“oil paper”。现代英语里更常见的替代说法有“greaseproof paper”（防油纸）或“wax paper”（蜡纸）；但两者不完全等同：wax paper多为涂蜡，耐油但不适合高温烘烤，而烘焙中常用的是“parchment paper”（烘焙纸）。","在东亚文化语境中，“oilpaper”还可能让人联想到“油纸伞”（oil-paper umbrella）：传统工艺会用桐油等涂在纸上以防水，因此在文学或民俗描写里，“oilpaper”有时带有怀旧、传统手工的意象。"]}
{"word":"oilpapers","summary":{"en":"Oilpapers are water-resistant papers treated with oil or wax, used mainly for wrapping or protecting items.","zh":"Oilpapers 指经过油或蜡处理的防水纸，多用于包裹或保护物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Paper treated with oil or wax to make it water-resistant, used for wrapping, covering, or protecting things (plural).","zh":"涂油纸／油纸（复数）：用油或蜡处理过、能防潮防水的纸，常用于包裹、覆盖或保护物品。"},"examples":[{"en":"The cookies were wrapped in oilpapers to keep them fresh.","zh":"饼干用油纸包起来，以保持新鲜。"},{"en":"She covered the table with oilpapers so the paint wouldn’t soak through.","zh":"她用油纸铺在桌上，防止颜料渗透。"},{"en":"In the old shop, spices were sold in small packets made from oilpapers.","zh":"在那家老店里，香料用小油纸包成小包出售。"}]}],"synonyms":["wax paper","greaseproof paper","parchment paper","wrapping paper"],"phonetic":"/ˈɔɪlˌpeɪpɚz/","extraExplanation":["“oilpaper”在现代英语里不算很常用，更常见的说法是“wax paper（蜡纸）”或“parchment paper（烘焙纸）”。但在历史语境中，oilpaper常指用于防潮包装或临时遮挡的防水纸。","有些文化语境里也会联想到“油纸伞”（英文常说“paper umbrella/ oiled-paper umbrella”），不过那通常不是“oilpaper(s)”这个词在日常英语里的主要指代。"]}
{"word":"oilproof","summary":{"en":"Oilproof describes something that resists oil and doesn’t easily get oily or stained.","zh":"oilproof 指“防油/耐油”，不容易被油渍渗透或弄脏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to oil; not easily stained, penetrated, or damaged by oil.","zh":"防油的；耐油的；不易被油渍渗透或弄脏的。"},"examples":[{"en":"These oilproof paper bags keep the fries from soaking through.","zh":"这种防油纸袋能防止薯条的油渗透出来。"},{"en":"Wear oilproof gloves when handling greasy machine parts.","zh":"处理油腻的机器零件时要戴耐油手套。"},{"en":"The jacket has an oilproof finish, so it’s easier to clean.","zh":"这件夹克有防油涂层，所以更容易清洁。"}]}],"synonyms":["greaseproof","oil-resistant","stain-resistant (to oil)"],"phonetic":"/ˈɔɪlpruːf/","extraExplanation":["“oilproof”常见于产品说明和包装材料领域（如oilproof paper＝防油纸）。在日常英语里也常用“greaseproof”（防油/防油脂）或“oil-resistant”（耐油）来表达相近意思；食品包装中“greaseproof”更常见。"]}
{"word":"oilproofing","summary":{"en":"Oilproofing means making something resistant to oil, or the protective coating/treatment that provides that resistance.","zh":"oilproofing 指让物品具有防油能力的处理过程，或指提供防油效果的涂层/整理层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of treating a material or surface so it resists oil (so oil won’t soak in, stain, or damage it).","zh":"使材料或表面具备防油性（防止油渗入、弄脏或造成损坏）的处理过程。"},"examples":[{"en":"The factory added oilproofing to the uniforms to reduce grease stains.","zh":"工厂给制服做了防油处理，以减少油渍。"},{"en":"Oilproofing is important for protective gloves used in auto repair.","zh":"用于汽车维修的防护手套做防油处理很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A coating, finish, or treatment layer that provides oil resistance.","zh":"防油涂层；防油处理层。"},"examples":[{"en":"This jacket has an oilproofing that helps keep spills from soaking in.","zh":"这件夹克有防油涂层，可以减少液体渗透。"},{"en":"Check whether the oilproofing is still effective after repeated washing.","zh":"多次清洗后要检查防油层是否仍然有效。"}]}],"synonyms":["oil resistance","oil-repellent treatment","oil-proofing","grease-resistant coating"],"phonetic":"/ˈɔɪlˌpruːfɪŋ/","extraExplanation":["“oilproofing”常见于纺织、劳保用品、工业涂层等语境，意思接近“防油处理/防油整理”。在实际写作中也常见连字符形式“oil-proofing”。与“waterproofing（防水处理）”结构相同，但重点是防油污、抗油渗透。"]}
{"word":"oils","summary":{"en":"“Oils” most often means different kinds of oil (especially for cooking or care products), or it can be the verb form meaning “puts oil on.”","zh":"“oils”多指不同种类的油（常见于烹饪/护理用品），也可作动词，表示“给……上油/涂油”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) liquid fats used for cooking, skin/hair care, medicine, or industry (for example, olive oil or motor oil).","zh":"（通常用复数）油类；用于烹饪、护肤/护发、医药或工业的液态油脂（如橄榄油、机油）。"},"examples":[{"en":"The recipe calls for two tablespoons of oils, like olive oil or sesame oil.","zh":"这个食谱需要两汤匙油类，比如橄榄油或芝麻油。"},{"en":"Different oils have different smoke points, so choose the right one for frying.","zh":"不同油的冒烟点不同，所以油炸时要选对油。"}]},{"partOfSpeech":"n.","definition":{"en":"The plural form of “oil”: substances (such as petroleum) that can be used as fuel or processed into products.","zh":"“oil”的复数：油类物质（如石油），可作为燃料或加工成产品。"},"examples":[{"en":"Prices rose because global supplies of oils were tight.","zh":"由于全球油类供应紧张，价格上涨了。"},{"en":"The factory produces oils used in plastics and detergents.","zh":"这家工厂生产用于塑料和洗涤剂的油类原料。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “oil”: to put oil on something to make it smoother, protect it, or keep it from sticking.","zh":"“oil”的第三人称单数：给……上油/涂油，使更顺滑、起保护作用或防粘。"},"examples":[{"en":"He oils the pan before adding the eggs.","zh":"他在下鸡蛋前先给锅抹油。"},{"en":"She oils the wooden cutting board to keep it from drying out.","zh":"她给木砧板上油，防止变干开裂。"}]}],"synonyms":["cooking oils","lubricants","greases (thicker, not always liquid)","oil (general substance)"],"phonetic":"/ɔɪlz/","extraExplanation":["“oils”作名词复数时很常见，尤其在烹饪或护肤语境：e.g., cooking oils（食用油）、essential oils（精油）、hair oils（护发油）。","区分：oil（不可数）常指“油”这种物质总体；oils（可数/复数）常指“不同种类的油”或“多瓶/多批油”。例如：Oil is expensive.（油很贵。）vs. These oils are great for salads.（这些油很适合做沙拉。）"]}
{"word":"oilseed","summary":{"en":"Oilseed means a seed (or crop) grown mainly for producing oil, such as soybean or canola.","zh":"oilseed 指主要用于榨油的油料种子或油料作物，如大豆、油菜籽（canola）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seed from a plant grown mainly to produce edible or industrial oil","zh":"油料种子；以榨油为主要用途的种子"},"examples":[{"en":"Soybeans are an important oilseed used for cooking oil.","zh":"大豆是重要的油料种子，可用来生产食用油。"},{"en":"Many farmers rotate oilseed crops with grains to keep the soil healthy.","zh":"许多农民会把油料作物和谷物轮作，以保持土壤健康。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to crops or plants grown for oil-producing seeds","zh":"油料的；以产油种子为目的种植的（作物/植物）"},"examples":[{"en":"Canada produces a lot of oilseed rape, also called canola.","zh":"加拿大生产大量油菜籽（oilseed rape），也称为canola。"},{"en":"The report focuses on oilseed prices and global supply.","zh":"这份报告关注油料价格和全球供应。"}]}],"synonyms":["oil-bearing seed","oil crop"],"phonetic":"/ˈɔɪlˌsid/","extraExplanation":["“oilseed”常见于农业、食品工业与国际贸易语境。常见oilseeds包括：soybean（大豆）、sunflower seed（葵花籽）、rapeseed/canola（油菜籽/菜籽油原料）、flaxseed（亚麻籽）、sesame（芝麻）、peanut（花生，某些语境下也归入油料作物）。","注意用法：作形容词时常放在名词前，如 oilseed crops（油料作物）、oilseed market（油籽市场）。英式英语常见说法 oilseed rape，美式/北美贸易中常用 canola（指低芥酸品种，常用于食用油）。"]}
{"word":"oilseeds","summary":{"en":"Oilseeds are seeds grown mainly for making vegetable oil.","zh":"Oilseeds 指主要用于生产植物油的油料种子/油料作物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Seeds grown mainly to be pressed or processed into vegetable oil (and often oil-rich meal for animal feed).","zh":"主要为了榨油或加工成植物油而种植的种子（常也会产生富含油脂的粕，用作饲料）。"},"examples":[{"en":"Soybeans and rapeseed are important oilseeds in global trade.","zh":"大豆和油菜籽是全球贸易中重要的油料作物。"},{"en":"The report predicts higher oilseed production this year because of good weather.","zh":"报告预测今年由于天气良好，油料作物产量会更高。"},{"en":"Farmers rotate cereals with oilseeds to improve soil health.","zh":"农民会把谷物与油料作物轮作，以改善土壤健康。"}]}],"synonyms":["oil crops","oil-bearing seeds"],"phonetic":"/ˈɔɪlˌsidz/","extraExplanation":["“Oilseeds”通常用作复数名词，常见于农业、贸易与食品工业语境；单数形式为“oilseed”。","常见油料作物包括大豆（soybeans）、油菜籽/菜籽（rapeseed/canola）、葵花籽（sunflower seed）、花生（peanut/groundnut）、芝麻（sesame）等。"]}
{"word":"oilskin","summary":{"en":"Oilskin is a traditional waterproof coat or the waterproof fabric used to make it, often associated with sailors and fishermen.","zh":"Oilskin 指传统的防水外套（雨衣）或其使用的防水布料，常与海员、渔民等海边工作场景相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A waterproof coat or jacket (often made from cloth treated with oil or wax), especially used by sailors, fishermen, or people working outdoors in wet weather.","zh":"（尤指渔民、海员或户外工作者穿的）防水外套/雨衣；多为经过油或蜡处理的布料制成。"},"examples":[{"en":"The fisherman pulled on his oilskin before heading out into the rain.","zh":"渔夫出门冒雨前先穿上了油布雨衣。"},{"en":"Her oilskin kept the sea spray off her clothes.","zh":"她的防水外套挡住了海浪溅起的水珠，衣服没湿。"}]},{"partOfSpeech":"n.","definition":{"en":"Waterproof fabric treated with oil or wax; oilcloth.","zh":"（经油或蜡处理的）防水布；油布。"},"examples":[{"en":"They covered the gear with oilskin to keep it dry.","zh":"他们用防水布把装备盖起来防潮。"},{"en":"Oilskin was once common for making rainwear before modern plastics.","zh":"在现代塑料材料出现之前，油布曾常用于制作雨具。"}]}],"synonyms":["raincoat","waterproof jacket","oilcloth","slicker"],"phonetic":"/ˈɔɪlˌskɪn/","extraExplanation":["“oilskin”在英式与澳新英语里常见于海事与渔业语境，带有一种“传统航海/海边工作”的文化氛围；现代口语中也常用更泛的词如 raincoat 或 waterproof jacket。","词源上指“用油处理的皮/布”，早期常用亚麻布涂油（后来也有上蜡）以增强防水性。"]}
{"word":"oilskinned","summary":{"en":"“oilskinned” usually means “oily-skinned”: having skin that produces a lot of oil.","zh":"“oilskinned”通常指“oily-skinned”：指皮肤出油多、偏油性的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having skin that produces a lot of oil (sebum), often looking shiny and sometimes linked to clogged pores or acne.","zh":"（皮肤）出油多的，油性皮肤的（常显得发亮，也可能与毛孔堵塞或痘痘有关）。"},"examples":[{"en":"I’m oily-skinned, so I use a gentle foaming cleanser.","zh":"我是油性皮肤，所以我会用温和的泡沫洁面。"},{"en":"People with oily skin may prefer lightweight, non-comedogenic moisturizer.","zh":"油性皮肤的人可能更适合清爽、非致痘的保湿霜。"}]}],"synonyms":["oily-skinned","oily","greasy (informal, sometimes negative)"],"phonetic":"/ˈɔɪli skɪnd/","extraExplanation":["更常见的写法是 **oily-skinned**（带连字符）或 **oily skinned**；**oilskinned** 连写较少见，多出现在非正式表达或个别品牌/社媒文案中。","在护肤语境里，常与 **combination skin（混合皮）**、**non-comedogenic（不堵塞毛孔/非致痘）**、**matte finish（哑光妆效）** 等词搭配使用。"]}
{"word":"oilskins","summary":{"en":"Oilskins are waterproof outer clothes, especially for sailors or people working in wet weather.","zh":"Oilskins 指防水外穿衣物，常与航海、渔业等潮湿环境相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"waterproof clothing (especially a coat and pants) worn to stay dry in wet weather, often used by sailors and fishermen; plural form is common.","zh":"防水衣物（尤指防水外套和防水裤），用于在雨天或潮湿环境中保持干燥；常用复数形式。"},"examples":[{"en":"The fishermen pulled on their oilskins before heading out into the storm.","zh":"渔民在出海迎风暴前穿上了防水油布衣。"},{"en":"Her oilskins were still dripping after the walk in heavy rain.","zh":"她在大雨中走完后，防水衣还在滴水。"}]}],"synonyms":["rain gear","waterproofs","raincoat (general)","slicker"],"phonetic":"/ˈɔɪlˌskɪnz/","extraExplanation":["“oilskins”源于早期把布料涂上油（如亚麻籽油）来防水的做法，常见于海事与渔业语境。现代“oilskins”多指防水材料（如涂层布或合成材料）制成的雨具，但词语仍保留了传统海上生活的味道。","在英美文学或航海叙述中，“oilskins”常用来营造风雨、海上劳动、艰苦环境的画面感。"]}
{"word":"oilstock","summary":{"en":"Oilstock means a stored supply of oil, or (in industry) oil used as raw material for processing.","zh":"oilstock 指“储备/库存的油”，也可指（工业中）用于加工的“原料油/进料油”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supply or stored amount of oil (especially kept for future use or sale), such as inventory in tanks or reserves","zh":"储备的油；油的存量（尤指为将来使用或销售而存放的库存，如油罐库存或储备油）"},"examples":[{"en":"The company increased its oilstock before winter in case prices rose.","zh":"公司在冬季前增加了油的库存，以防价格上涨。"},{"en":"Emergency oilstock is kept to support hospitals and public transportation during crises.","zh":"应急储备油用于在危机期间保障医院和公共交通。"}]},{"partOfSpeech":"n.","definition":{"en":"(industry) oil used as a raw material for processing, especially in refining; oil feedstock","zh":"（工业）用于加工的原料油，尤指炼油中的进料油；油类原料（feedstock）"},"examples":[{"en":"The refinery switched to a heavier oilstock to reduce costs.","zh":"炼油厂改用更重的原料油以降低成本。"},{"en":"Different oilstock types produce different amounts of gasoline and diesel.","zh":"不同类型的原料油会产出不同数量的汽油和柴油。"}]}],"synonyms":["oil reserves","oil inventory","stockpile","feedstock (industrial)"],"phonetic":"/ˈɔɪlˌstɑk/","extraExplanation":["“oilstock”在日常新闻里更常写成两个词“oil stock(s)”表示“库存/储备”。在炼油、化工语境中，它也可能接近“feedstock（原料、进料）”的意思，具体看上下文（例如是否谈到refinery、processing、cracking等）。"]}
{"word":"oilstone","summary":{"en":"An oilstone is a sharpening stone used with oil to sharpen blades and tools.","zh":"oilstone指用油润滑来磨利刀刃或工具的磨石（油石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stone used with oil to sharpen tools such as knives or chisels; a whetstone","zh":"油石；（用油润滑来磨利刀具等的）磨刀石"},"examples":[{"en":"He sharpened the kitchen knife on an oilstone before cooking.","zh":"他做饭前用油石把厨房刀磨利。"},{"en":"An oilstone and a little honing oil can keep your tools in good condition.","zh":"一块油石加一点研磨油就能让工具保持良好状态。"}]}],"synonyms":["whetstone","sharpening stone","hone stone"],"phonetic":"/ˈɔɪlˌstoʊn/","extraExplanation":["“Oilstone”常见于木工、金工和刀具保养语境。它和“whetstone（磨刀石）”意思很接近，但oilstone强调使用油（honing oil）作润滑与带走金属屑；而有些whetstone也可能用水（water stone / 水磨石）。","词源上，whet-表示“磨快、磨利”，与“wet（湿的）”无关；所以“to whet a knife”不是“把刀弄湿”，而是“把刀磨利”。"]}
{"word":"oilstoned","summary":{"en":"Oilstoned usually means ‘stained/soaked with oil,’ and less commonly ‘sharpened with an oilstone.’","zh":"oilstoned通常指“沾了油/被油浸透的”，较少见也可指“用油石磨过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with, stained by, or soaked in oil.","zh":"被油覆盖的；沾了油的；被油浸透的。"},"examples":[{"en":"After the repair, his hands were oilstoned and hard to clean.","zh":"修完之后，他的手满是油污，很难洗干净。"},{"en":"Don’t put the oilstoned rag near the stove.","zh":"别把沾满油的抹布放在炉子旁边。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sharpened or finished using an oilstone (a sharpening stone used with oil).","zh":"用油石（加油使用的磨刀石）磨过的；用油石修整过的。"},"examples":[{"en":"The blade felt smoother after an oilstoned edge was finished on leather.","zh":"刀刃用油石磨过、再用皮革抛光后，摸起来更顺滑了。"},{"en":"He prefers an oilstoned chisel for fine woodworking.","zh":"做精细木工时，他更喜欢用油石磨过的凿子。"}]}],"synonyms":["oil-stained","oil-soaked","greasy","oil-smeared"],"phonetic":"/ˈɔɪlˌstoʊnd/","extraExplanation":["“oilstoned”不是非常常见的标准词，更常见的表达是“oil-stained（沾油的）”“oil-soaked（浸油的）”。在工具/刀具语境中，它可理解为“用油石磨过的”，与名词“oilstone（油石）”相关。写作时若想更自然，可根据语境改用更常见的搭配。"]}
{"word":"oilstones","summary":{"en":"Oilstones are sharpening stones used with oil to hone blades and tools.","zh":"oilstones 指配合油使用的磨刀石/油磨石，用来磨锋利刀具与工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stone used for sharpening blades (like knives or chisels), usually used with a little oil to help the blade slide smoothly and to carry away tiny metal particles.","zh":"（常配合少量油使用的）磨刀石、油磨石，用于磨锋利刀具（如刀、凿子等），油能帮助润滑并带走细小金属屑。"},"examples":[{"en":"He sharpened the kitchen knife on an oilstone before cooking.","zh":"他做饭前先用油磨石把厨房刀磨锋利。"},{"en":"Carpenters often keep oilstones for sharpening chisels and planes.","zh":"木工常备油磨石，用来磨凿子和刨刀。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of oilstone.","zh":"oilstone 的复数形式。"},"examples":[{"en":"The workshop has several oilstones for different tools.","zh":"这间工坊有好几块油磨石，分别用于不同工具。"}]}],"synonyms":["oilstone","whetstone","sharpening stone","hone"],"phonetic":"/ˈɔɪlstoʊn/","extraExplanation":["在实际使用中，oilstone 通常指“油石（磨刀石的一种）”，与 waterstone（用水的水磨石）相对。油的作用主要是润滑并带走金属屑，减少堵塞，让磨削更稳定。英语里也常用 whetstone 作更泛指的“磨刀石”，而 oilstone 更强调“用油的那种”。"]}
{"word":"oilstoning","summary":{"en":"Oilstoning means sharpening or smoothing with an oilstone (often using oil as a lubricant).","zh":"Oilstoning 指用油石（常配合油润滑）来磨利或磨光。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of sharpening or polishing a surface using an oilstone (a fine sharpening stone used with oil as lubricant).","zh":"用油石（配合油作润滑的细磨石）进行磨削、抛光或开刃的过程。"},"examples":[{"en":"After grinding the blade, he finished it with oilstoning to remove tiny burrs.","zh":"刀刃粗磨后，他用油石精磨（oilstoning）来去掉细小的毛刺。"},{"en":"Oilstoning gives the cutting edge a smoother finish than coarse sanding.","zh":"用油石精磨能让刃口比粗砂纸打磨更光滑。"}]},{"partOfSpeech":"v.","definition":{"en":"to sharpen or smooth something by rubbing it on an oilstone, usually with oil.","zh":"用油石（通常加油润滑）来磨利或磨光（某物）。"},"examples":[{"en":"The machinist oilstoned the metal surface until it felt perfectly smooth.","zh":"机修工把金属表面用油石精磨到摸起来非常平滑。"},{"en":"She oilstoned the chisel lightly before carving the wood.","zh":"她在刻木之前轻轻用油石磨了磨凿子。"}]}],"synonyms":["honing","sharpening with an oilstone","polishing (by honing)"],"phonetic":"ˈɔɪlˌstoʊnɪŋ","extraExplanation":["“Oilstoning”在木工、刀具保养、机械加工里更常见，属于相对专业的用词；日常英语里更常说“sharpen with an oilstone / hone”。","Oilstone（油石）通常用油而不是水作润滑，这能减少摩擦、带走金属屑，让刃口更细致；对应的常见概念还有“whetstone（磨刀石，常配水）”。"]}
{"word":"oilstove","summary":{"en":"An oil stove is a stove that uses oil (often kerosene) for cooking or heating.","zh":"oilstove 指用油类燃料（常见为煤油）做饭或取暖的炉具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stove (cooking or heating device) that runs on oil fuel, such as kerosene or diesel.","zh":"一种以油类燃料（如煤油或柴油）为动力的炉具，用于做饭或取暖。"},"examples":[{"en":"They cooked rice on an oil stove during the power outage.","zh":"停电时，他们用油炉煮饭。"},{"en":"An oil stove can be useful in places without reliable electricity or gas.","zh":"在电力或燃气不稳定的地方，油炉可能很实用。"}]}],"synonyms":["kerosene stove","oil-burning stove"],"phonetic":"/ˈɔɪlˌstoʊv/","extraExplanation":["“oil stove”是复合名词（oil + stove）。在现代城市生活中更常见的是“gas stove（燃气灶）”和“electric stove（电炉）”。在一些地区或露营、应急场景下，油炉仍会使用，燃料常见为kerosene（煤油）。","相关词：kerosene stove（煤油炉/煤油灶）、camp stove（露营炉）、portable stove（便携炉）。注意不要和“stove oil（炉油）”混淆：后者指燃料或油类本身。"]}
{"word":"oiltight","summary":{"en":"Oiltight means sealed so oil cannot leak.","zh":"Oiltight 指“对油完全密封、不漏油”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Completely sealed so that oil cannot leak in or out; leakproof against oil (often also implying resistance to oil).","zh":"（对油）完全密封、不渗漏的；防油漏的（也常暗示耐油）。"},"examples":[{"en":"Make sure the cap is oiltight before you store the engine parts.","zh":"存放发动机零件前，确保盖子是防油漏（密封）的。"},{"en":"These seals keep the gearbox oiltight under high pressure.","zh":"这些密封件能在高压下保持变速箱不漏油。"}]}],"synonyms":["leakproof","oilproof","sealed"],"phonetic":"/ˈɔɪlˌtaɪt/","extraExplanation":["“oiltight”常见于工程、制造、航运和机械说明书中，语气偏技术/规范。也可写作“oil-tight”。","与“watertight（防水密封）”结构类似：tight 在这里表示“严密、不漏”。实际使用中也常搭配“seal/gasket/closure/joint（密封件/垫圈/封口/接缝）”。"]}
{"word":"oiltightness","summary":{"en":"Oiltightness means being sealed so oil cannot leak.","zh":"oiltightness 指“防油密封性”，即油不会泄漏的性能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being sealed so that oil cannot leak in or out; oil leakproofness.","zh":"防油密封性；不漏油的性能（指油不会渗入或渗出）。"},"examples":[{"en":"The mechanic checked the gasket’s oiltightness before starting the engine.","zh":"技师在启动发动机前检查了垫片的防油密封性。"},{"en":"Oiltightness is critical for hydraulic systems that operate under high pressure.","zh":"在高压运行的液压系统中，防油密封性至关重要。"},{"en":"They improved oiltightness by replacing the worn seal.","zh":"他们通过更换磨损的密封圈来提高防油密封性。"}]}],"synonyms":["leakproofness","oil-tightness","oil resistance (context-dependent)","sealing performance"],"phonetic":"/ˈɔɪlˌtaɪtnəs/","extraExplanation":["“oiltightness”由“oil（油）+ tight（严密的）+ -ness（名词后缀）”构成，常见于工程、机械、船舶与液压等语境，用来强调“对油的密封/不渗漏”这一特定要求。","更常见的写法有“oil-tightness”（带连字符）或用形容词“oil-tight”描述零件（如oil-tight seal：防油密封）。"]}
{"word":"oilway","summary":{"en":"Oilway means a channel inside a machine that lets lubricating oil flow to parts that need it.","zh":"Oilway 指机器内部用于输送润滑油的油道/油路通道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A passage or channel in a machine that carries lubricating oil to moving parts.","zh":"（机械中的）油道；润滑油通道（把润滑油输送到运动部件的孔道/沟槽）。"},"examples":[{"en":"The mechanic cleaned the oilway to improve lubrication.","zh":"技师清理了油道，以改善润滑效果。"},{"en":"If an oilway is blocked, the engine can overheat and wear quickly.","zh":"如果油道堵塞，发动机可能会过热并迅速磨损。"}]}],"synonyms":["oil passage","oil channel","lubrication passage"],"phonetic":"/ˈɔɪlˌweɪ/","extraExplanation":["“oilway”多见于机械、汽车与工程语境，常出现在维修手册或零件说明里。日常英语里更常用的说法是“oil passage”或“oil channel”。"]}
{"word":"oilways","summary":{"en":"Oilways are the internal passages in machinery that carry lubricating oil to moving parts.","zh":"Oilways 指机器内部输送润滑油到运动部件的油道/油路。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Engineering) A channel, passage, or duct in a machine that carries lubricating oil to moving parts; plural: oilways.","zh":"（工程）机器内部用来输送润滑油的油道、油路；复数：oilways。"},"examples":[{"en":"Check the oilways to make sure oil can reach the bearings.","zh":"检查油道，确保机油能到达轴承。"},{"en":"Dirty oil can block the oilways and cause the engine to wear faster.","zh":"脏机油会堵塞油路，导致发动机磨损加快。"},{"en":"During maintenance, the technician cleaned the oilways in the crankshaft.","zh":"保养时，技师清理了曲轴里的油道。"}]}],"synonyms":["oil passage","oil channel","lubrication passage"],"phonetic":"/ˈɔɪlˌweɪ/","extraExplanation":["“oilway / oilways”主要出现在机械、发动机、泵等语境里，指机件内部的润滑油通道，不是日常生活中常用词。","注意别和拼写相近的“always（总是）”混淆：oilways 指“油路/油道”，always 指“总是”。"]}
{"word":"oilwell","summary":{"en":"An oil well is a drilled hole used to extract petroleum from underground.","zh":"oil well 指为从地下开采原油而钻成的油井。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hole drilled into the ground to reach and produce petroleum (crude oil), often with equipment to pump it to the surface","zh":"油井；为开采石油而钻入地下的井（通常配有抽油设备将原油抽到地面）"},"examples":[{"en":"The company drilled a new oil well offshore.","zh":"这家公司在近海钻了一口新油井。"},{"en":"Production from the oil well declined after a few years.","zh":"几年后，这口油井的产量下降了。"},{"en":"Workers installed a pump to bring oil up from the well.","zh":"工人们安装了抽油泵，把原油从井里抽上来。"}]}],"synonyms":["petroleum well","well (in oil/gas context)"],"phonetic":"/ˈɔɪlˌwɛl/","extraExplanation":["“oil well”通常写作两个词；作复合定语时常用连字符：oil-well equipment（油井设备）。","石油行业里也常说“well”指井本身，而“rig”指钻井平台/钻机；“oilfield”指油田（有许多油井的区域）。"]}
{"word":"oily","summary":{"en":"Oily usually means ‘having oil or feeling greasy’ (food, surfaces, skin/hair). It can also describe an overly smooth, insincere manner.","zh":"Oily通常指“有油/油腻”（食物、表面、皮肤/头发），也可形容“油滑、虚伪讨好”的态度或语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with, containing, or producing oil; having an oily surface or feeling.","zh":"油的；含油的；油腻的（表面有油或摸起来很油）。"},"examples":[{"en":"My hands feel oily after cooking bacon.","zh":"煎完培根后，我的手感觉很油腻。"},{"en":"This fish is naturally oily, so it stays moist when grilled.","zh":"这种鱼天生含油量高，所以烧烤后依然很嫩润。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of skin or hair) producing too much oil, often causing shine or acne.","zh":"（皮肤/头发）出油多的（常导致油光、痘痘）。"},"examples":[{"en":"I have oily skin, so I use a gentle cleanser twice a day.","zh":"我属于油性皮肤，所以每天用温和的洁面两次。"},{"en":"An oily scalp can make your hair look greasy by the afternoon.","zh":"头皮出油会让头发到下午就看起来很油。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person’s manner or voice) overly smooth in a way that seems insincere or flattering.","zh":"（态度/语气）油滑的；过分圆滑讨好的（让人觉得不真诚）。"},"examples":[{"en":"He greeted everyone with an oily smile that didn’t feel honest.","zh":"他带着一种油滑的笑容跟每个人打招呼，让人觉得不真诚。"},{"en":"Her oily compliments made me uncomfortable.","zh":"她那种过分讨好的夸奖让我不舒服。"}]}],"synonyms":["greasy","oil-rich","slick","slippery","unctuous"],"phonetic":"/ˈɔɪli/","extraExplanation":["“oily”既可以是中性描述（比如“oily fish”表示“富含油脂的鱼”，常用于营养或烹饪语境），也可以是带负面评价（比如“oily skin”油性皮肤；“oily smile”油滑、谄媚的笑）。要根据上下文判断褒贬。","与“greasy”相比，“oily”更偏“有油/出油”的客观感觉；“greasy”更常带“油腻、不干净、让人反感”的语气（比如“greasy hair/food”）。"]}
{"word":"oilyish","summary":{"en":"Oilyish means “slightly oily” in casual speech.","zh":"oilyish 指“有点油的/略油腻的”，多用于口语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Somewhat oily; a little greasy or slick, but not strongly so.","zh":"（非正式）有点油的；略显油腻/油滑，但不算很严重。"},"examples":[{"en":"After a few hours, my skin feels oilyish around the T-zone.","zh":"过了几个小时，我的皮肤在T区会感觉有点油。"},{"en":"The sauce was tasty, but it turned oilyish as it cooled.","zh":"这个酱很好吃，但放凉后就有点油了。"},{"en":"His hair looked oilyish, like he skipped shampoo for a day.","zh":"他的头发看起来有点油，像是一天没洗头。"}]}],"synonyms":["slightly oily","a bit greasy","somewhat greasy","slickish"],"phonetic":"/ˈɔɪliˌɪʃ/","extraExplanation":["“oilyish”更常见的写法是“oily-ish”，由形容词“oily（油的）”加后缀“-ish”组成，表示“有点……/略微……”，语气比较随意、口语化。正式写作里通常用“slightly oily / a bit greasy”。"]}
{"word":"oime","summary":{"en":"“Oime” is an exclamation like “alas” or “oh dear,” often linked to Irish usage (commonly “oimé”).","zh":"“oime” 是类似“唉/哎呀”的感叹，用来表达难过或懊恼，常与爱尔兰语用法相关（更常见写作 “oimé”）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"an exclamation meaning “alas!” or “oh dear!”, used to express sadness, regret, or dismay (often an Irish-language form, sometimes written without the accent as “oime”).","zh":"感叹词，表示“唉！”“哎呀！”用于表达悲伤、懊悔或沮丧（常见于爱尔兰语形式，有时不写重音符号写成 oime）。"},"examples":[{"en":"Oime, I forgot my wallet at home.","zh":"唉，我把钱包忘在家里了。"},{"en":"Oime! That’s such sad news.","zh":"哎呀！这消息太难过了。"}]}],"synonyms":["alas","oh dear","woe"],"phonetic":"/ɔɪ meɪ/","extraExplanation":["更常见的拼写是爱尔兰语的 “oimé”（带重音符号 é），意思接近英语的 “alas / oh dear”。在英文语境里有时会把重音省略写成 “oime”。","如果你原本想写的是英语口语 “oh my”，拼写会不同，意思也更偏“天哪/我的天”。"]}
{"word":"oink","summary":{"en":"“Oink” is the sound a pig makes, and it can also mean to make that sound.","zh":"“oink”表示猪的叫声，也可作动词表示“哼哼叫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sound a pig makes","zh":"（猪发出的）哼哼声；猪叫声"},"examples":[{"en":"The pig went “oink, oink” in the barn.","zh":"猪在谷仓里“哼哼，哼哼”地叫。"},{"en":"In the storybook, the little pig says “oink.”","zh":"在故事书里，小猪说“哼哼”。"}]},{"partOfSpeech":"v.","definition":{"en":"to make the sound of a pig","zh":"发出猪叫声；哼哼叫"},"examples":[{"en":"The pig oinked loudly when it heard food.","zh":"猪听到有食物时大声哼哼叫。"},{"en":"The kids laughed when they tried to oink like pigs.","zh":"孩子们学猪叫“哼哼”时笑了。"}]}],"synonyms":["snort","grunt"],"phonetic":"/ɔɪŋk/","extraExplanation":["“oink”是英语里很常见的拟声词（onomatopoeia），用来模仿猪的叫声。不同语言对动物叫声的模仿不一样：中文常写“哼哼”，英语更常写“oink”。在儿童绘本、漫画和动画里尤其常见。"]}
{"word":"oinked","summary":{"en":"“Oinked” means (1) a pig made its typical sound, or (2) someone imitated that sound (often jokingly).","zh":"“Oinked”表示（1）猪发出典型叫声；（2）人模仿猪叫（常带玩笑意味）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “oink”) to make the short, nasal sound that pigs make.","zh":"（“oink”的过去式/过去分词）发出猪的“哼哼/噗噗”叫声。"},"examples":[{"en":"The pig oinked loudly when it saw the food.","zh":"那头猪看到食物时大声哼哼叫。"},{"en":"Something rustled in the dark, and then a pig oinked nearby.","zh":"黑暗中有什么东西沙沙作响，接着附近传来一声猪叫。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) to imitate a pig’s sound, often as a joke or insult.","zh":"（非正式）模仿猪叫，常用于开玩笑或带侮辱意味。"},"examples":[{"en":"He oinked to make his friends laugh.","zh":"他学猪叫来逗朋友笑。"},{"en":"Don’t oink at people—it's rude.","zh":"别对别人学猪叫——很没礼貌。"}]}],"synonyms":["grunted","snorted","squealed (sometimes)","made a pig sound"],"phonetic":"/ɔɪŋkt/","extraExplanation":["“oink”是拟声词（onomatopoeia），用来模仿猪叫的声音。英语里还有类似的动物拟声词：cat—“meow”，dog—“woof/bark”，cow—“moo”。"]}
{"word":"oinking","summary":{"en":"“Oinking” means making the sound of a pig, or the pig-like sound itself.","zh":"“oinking”指发出猪的叫声，或指这种猪叫声本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making the sound a pig makes (“oink”); producing a pig-like grunt","zh":"发出猪的叫声（“oink”）；发出类似猪的哼哼声"},"examples":[{"en":"We heard pigs oinking in the barn.","zh":"我们听到猪圈里有猪在哼哼叫。"},{"en":"The child was laughing and oinking like a little pig.","zh":"那个孩子笑着学小猪哼哼叫。"}]},{"partOfSpeech":"n.","definition":{"en":"the sound of pigs; pig-like grunting","zh":"猪的叫声；像猪一样的哼声"},"examples":[{"en":"The oinking got louder when feeding time came.","zh":"到了喂食时间，猪叫声更大了。"}]}],"synonyms":["grunting","snorting"],"phonetic":"/ˈɔɪŋkɪŋ/","extraExplanation":["“oink / oinking”是拟声词（onomatopoeia），用来模仿动物的声音。英语里不同语言会用不同的拟声方式：中文常说“哼哼”，英文常写作“oink”。","在口语或文学描写中，用“oinking”形容人有时带调侃意味（比如说某人吃东西发出很大声音），使用时注意语境，避免冒犯。"]}
{"word":"oinks","summary":{"en":"“oinks” is either the verb form meaning “a pig makes a sound,” or the plural noun meaning “pig sounds.”","zh":"“oinks”既可以表示“猪在叫”（动词形式），也可以表示“猪叫声”（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “oink”) to make the short, loud sound that a pig makes.","zh":"（“oink”的第三人称单数）发出猪的叫声（哼哼声）。"},"examples":[{"en":"The pig oinks whenever it hears footsteps.","zh":"那头猪一听到脚步声就会哼哼叫。"},{"en":"In the story, the little pig oinks happily and runs to the food.","zh":"在故事里，小猪开心地哼哼叫着跑向食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural noun) pig sounds; repeated “oink” noises.","zh":"（名词复数）猪叫声；一连串的“oink/哼哼”声。"},"examples":[{"en":"We heard oinks coming from the barn.","zh":"我们听到谷仓里传来一阵猪叫声。"},{"en":"The cartoon used loud oinks for comedy.","zh":"那部动画用夸张的猪叫声来制造笑点。"}]}],"synonyms":["grunts","snorts","pig grunts","pig snorts"],"phonetic":"/ɔɪŋk/","extraExplanation":["“oink”是拟声词（onomatopoeia），用来模仿猪的叫声。不同语言对同一种声音的模仿不同：英语常写作“oink”，中文常写作“哼哼”。在儿童读物和漫画里很常见。"]}
{"word":"oino","summary":{"en":"“oino” isn’t a recognized English word; it’s likely a name/typo/acronym and needs context.","zh":"“oino”不是常见英语词，可能是名字/拼写错误/缩写，需要上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, a brand/name, or an acronym used in a specific community.","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌/姓名，或某个圈子里的缩写。"},"examples":[{"en":"I couldn’t find “oino” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“oino”——你能把你看到它的句子发我吗？"},{"en":"Oino is my online username.","zh":"Oino 是我的网名。"}]}],"phonetic":"/ˈɔɪnoʊ/","extraExplanation":["如果你是想输入感叹词“oh no”（糟了/不好了），正确拼写是“oh no”。","也有可能你想输入“wino”（爱喝酒的人/酒鬼，较口语且可能带贬义）或“oink”（猪叫声），需要看上下文判断。把原句贴出来我可以更准确解释。"]}
{"word":"oinochoai","summary":{"en":"Not a recognized English word; likely a misspelling or non-English term.","zh":"不是可识别的英语单词；可能是拼写错误或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This doesn’t appear to be a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"这看起来不是标准英语单词，可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “oinochoai” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“oinochoai”——你能提供你看到它的句子吗？"},{"en":"If you meant a different spelling, I can explain the correct word once you confirm it.","zh":"如果你想写的是另一个拼法，你确认后我就可以解释正确的单词。"}]}],"phonetic":"/ˌoʊɪnoʊˈtʃoʊ.aɪ/","extraExplanation":["我可能需要更多信息才能帮你：\n1）你想查的是英语单词吗？\n2）它出现在哪（聊天、歌曲、游戏、课本等）？\n3）你能提供上下文句子或你想表达的中文意思吗？\n4）有没有可能是拼写接近的词（例如开头是 “in- / on- / one- / oi-” 等）？"]}
{"word":"oinochoe","summary":{"en":"An oinochoe is an ancient Greek-style wine pitcher used for pouring wine.","zh":"oinochoe 指古希腊风格的倒酒壶（酒罐），主要用于倒酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of ancient Greek (and later Roman) wine jug or pitcher, usually with one handle and a spout (often a “trefoil” or three-lobed mouth) for pouring.","zh":"（古希腊、后传至古罗马的）酒壶/酒罐，一种带把手和壶嘴的倒酒器皿；常见为“三叶形”壶口，便于倾倒。"},"examples":[{"en":"The museum displayed a red-figure oinochoe used for pouring wine at a symposium.","zh":"博物馆展出了一只红绘“酒壶”（oinochoe），用于在酒宴（symposium）上倒酒。"},{"en":"Archaeologists found an oinochoe near the dining area, suggesting ritual or banquet use.","zh":"考古学家在用餐区域附近发现了一只 oinochoe，这暗示它可能用于仪式或宴饮。"}]}],"synonyms":["wine jug","wine pitcher","ancient Greek pitcher"],"phonetic":"/ˌɔɪ.nəˈkoʊ.i/","extraExplanation":["词源来自希腊语：oinos（酒）+ chein（倾倒）。因此它常与古希腊宴饮文化（symposium）和陶器艺术（如黑绘、红绘）一起出现。","在考古与艺术史语境里，oinochoe 常指一种“带壶嘴的倒酒壶”，与 amphora（双耳长颈大罐，更多用于储存/运输）和 krater（调酒大缸，用于混合酒与水）用途不同。"]}
{"word":"oinochoes","summary":{"en":"“Oinochoes” means ancient Greek wine jugs (plural of oinochoe).","zh":"“oinochoes”指古希腊斟酒用的酒壶/酒罐（oinochoe 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “oinochoe”: ancient Greek (and sometimes Roman) wine jugs or pitchers, often with a single handle and a pouring spout.","zh":"“oinochoe”的复数：古希腊（有时也指古罗马）的酒壶/酒罐/水罐，多为单柄并带有便于倾倒的壶嘴。"},"examples":[{"en":"The museum displayed several oinochoes used for pouring wine at banquets.","zh":"博物馆展出了几件用于宴会斟酒的古希腊酒壶（oinochoes）。"},{"en":"Archaeologists found oinochoes near the dining area of the house.","zh":"考古学家在房屋的用餐区域附近发现了几只古希腊酒壶（oinochoes）。"}]}],"synonyms":["wine jug","pitcher","jug"],"phonetic":"/ˌɔɪˈnɑːkoʊ.i/","extraExplanation":["词源来自希腊语：oinos（葡萄酒）+ chein（倾倒），字面意思是“倒酒的器皿”。","在艺术史/考古学语境里，oinochoe 指一种“定型器物”，常按壶嘴形状、器身比例、装饰风格来断代和分类。","英语里 oinochoe 的复数常见两种：oinochoes（英语化复数）和 oinochoai（更接近希腊语复数）。"]}
{"word":"oinochoi","summary":{"en":"“oinochoi” doesn’t appear to be an English dictionary word; it’s likely a name or a misspelling.","zh":"“oinochoi”看起来不是英语词典词汇；更可能是人名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a username, or a personal name (e.g., “Choi” is a common Korean family name).","zh":"不是标准英语单词；可能是拼写错误、用户名，或人名（例如“Choi/崔”是常见的韩国家族姓氏）。"},"examples":[{"en":"I couldn’t find “oinochoi” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“oinochoi”——你能把它出现的句子发我吗？"},{"en":"It might be a name, like “Oino Choi,” rather than an English vocabulary word.","zh":"它可能是名字，比如“Oino Choi”，而不是英语词汇。"}]}],"extraExplanation":["我可能需要更多信息才能帮你：\n1) 这是你在哪个语境看到的（文章、歌词、游戏、社交媒体）？\n2) 你想查的是发音、意思，还是正确拼写？\n3) 你是否想输入的是别的单词（例如 *onion* /ˈʌnjən/、*oink* /ɔɪŋk/ 等）？\n把原句或截图发来，我可以更准确判断。"]}
{"word":"oinologies","summary":{"en":"“Oinologies” means the studies/sciences of wine and winemaking (plural of oenology/enology).","zh":"“oinologies”指酿酒学/葡萄酒学（oenology/enology 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the studies or sciences of wine-making and wine (plural of “oenology/œnology,” also spelled “enology” in American English)","zh":"酿酒学；葡萄酒学（“oenology/œnology”的复数；美式英语也常写作“enology”）"},"examples":[{"en":"Different oinologies focus on grape growing, fermentation, and aging.","zh":"不同的酿酒学分支会关注葡萄栽培、发酵和陈酿。"},{"en":"She compared French and American oinologies in her research.","zh":"她在研究中比较了法国和美国的酿酒学体系。"}]}],"synonyms":["oenologies","enologies","wine studies","wine science","winemaking science"],"phonetic":"/ˌiːˈnɑːlədʒiz/","extraExplanation":["“oinologies”更常见的标准拼写是“oenologies/œnologies”，在美国也常写作“enologies”。词源来自希腊语 oinos（酒/葡萄酒）+ -logy（……学）。在日常英语里，人们更常说“wine science / winemaking”或直接用“enology”。"]}
{"word":"oinology","summary":{"en":"Oinology (more commonly spelled oenology/enology) means the study of wine and winemaking.","zh":"oinology（更常见拼写为 oenology/enology）指“葡萄酒学/酿酒学”，即对葡萄酒与酿造过程的研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of wine and winemaking (including grape growing, fermentation, tasting, and production)","zh":"葡萄酒学；酿酒学（研究葡萄栽培、发酵、品鉴与生产等）"},"examples":[{"en":"She studied oenology in California and now works as a winemaker.","zh":"她在加州学习葡萄酒学，现在是一名酿酒师。"},{"en":"The course covers basic oenology, from fermentation to wine tasting.","zh":"这门课涵盖葡萄酒学基础，从发酵到品鉴。"}]}],"synonyms":["oenology","enology","wine science","viticulture and enology"],"phonetic":"/oʊˈnɑːlədʒi/","extraExplanation":["“oinology”更常见的拼写是“oenology”（美式也常写作“enology”）。词根来自希腊语 oinos（葡萄酒）+ -logy（学科/研究）。在英语世界里，这个词常用于学术、行业培训或酒庄相关语境。"]}
{"word":"oinomancy","summary":{"en":"Oinomancy is a rare word meaning fortune-telling by interpreting wine.","zh":"Oinomancy（酒占）指通过解读葡萄酒来进行占卜、预测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"divination (fortune-telling) by interpreting wine—its taste, color, movement, or the patterns it leaves in a cup.","zh":"酒占：通过解读酒的味道、颜色、流动方式或酒杯中留下的痕迹来进行占卜（算命）。"},"examples":[{"en":"In the novel, the old priest practiced oinomancy, reading the swirls of red wine like signs.","zh":"在小说里，那位老祭司用酒占，把红酒的旋涡当作征兆来解读。"},{"en":"Some ancient rituals included oinomancy alongside other forms of divination.","zh":"一些古代仪式中，酒占会与其他占卜方式一起出现。"}]}],"synonyms":["wine divination","divination","fortune-telling"],"phonetic":"/ˈwaɪnoʊˌmænsi/","extraExplanation":["这个词很少见，常用于历史、宗教研究或文学写作中，带有“古老仪式/神秘学”的气氛。","词源来自希腊语：oinos（葡萄酒）+ manteia（占卜），意思直译就是“用酒来占卜”。","与常见的“tea-leaf reading（读茶叶渣）”类似，但酒占更常被描写为古希腊、古罗马或祭祀场景中的做法。"]}
{"word":"oinomania","summary":{"en":"Oinomania means an obsession with or compulsive craving for wine.","zh":"oinomania 指对葡萄酒的痴迷或强迫性渴求（葡萄酒成瘾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense obsession with or craving for wine; compulsive wine-drinking.","zh":"对葡萄酒的强烈痴迷或渴求；强迫性饮酒（尤指嗜酒如命地喝葡萄酒）。"},"examples":[{"en":"His friends joked about his oinomania, but it was starting to affect his health.","zh":"朋友们开玩笑说他得了“葡萄酒狂热”，但这已经开始影响他的健康。"},{"en":"The novel portrays oinomania as a quiet addiction hidden behind refined manners.","zh":"小说把“葡萄酒成瘾”描写成一种藏在优雅举止背后的隐秘成瘾。"}]}],"synonyms":["wine addiction","alcohol addiction","alcoholism","compulsive drinking"],"phonetic":"/ˌɔɪnoʊˈmeɪniə/","extraExplanation":["词源来自希腊语：oinos（酒，尤指葡萄酒）+ mania（狂热/躁狂）。因此字面意思就是“对酒的狂热”。","该词比较少见，多出现在医学、心理学或文学化的表达中；日常英语更常用 wine addiction（葡萄酒成瘾）、alcohol addiction（酒精成瘾）、alcoholism（酒精依赖/酗酒）。","语气上带一点“夸张、戏谑或文雅”的色彩：既可以严肃指成瘾，也可能用来半开玩笑形容特别爱喝、特别懂酒的人（注意语境，避免冒犯）。"]}
{"word":"oinomel","summary":{"en":"Oinomel is wine mixed with honey, used as a sweet drink and sometimes as a traditional remedy.","zh":"Oinomel 指“葡萄酒加蜂蜜”的蜜酒，既是甜饮，也曾被用作传统疗法中的调剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drink made by mixing wine with honey; historically used as a sweet beverage and sometimes as a medicinal preparation.","zh":"蜜酒（葡萄酒加蜂蜜调制的饮料）；历史上既可作甜饮，也常被用作药用调剂。"},"examples":[{"en":"The recipe calls for oinomel—wine gently warmed with honey.","zh":"这份配方需要用到 oinomel——把葡萄酒加热后加入蜂蜜。"},{"en":"In some ancient texts, oinomel is mentioned as a soothing drink for the throat.","zh":"在一些古代文献中，oinomel 被提到可作为舒缓喉咙的饮品。"}]}],"synonyms":["honeyed wine","mulsum"],"phonetic":"/ˈɔɪnəˌmɛl/","extraExplanation":["词源：来自希腊语 oinos（酒）+ meli（蜂蜜），字面意思就是“酒+蜜”。","历史背景：在古希腊与罗马时期，蜂蜜常用来为酒增甜，也常出现在药方或养生饮品中。","相关词对比：oxymel（醋蜜，vintage+蜂蜜不同，它是“醋+蜂蜜”）也常见于古代医药传统；罗马语境里也可类比 mulsum（加蜂蜜的酒）。"]}
{"word":"oinomels","summary":{"en":"Oinomel (plural: oinomels) is a honey-and-wine drink, known from ancient Greek culture.","zh":"Oinomel（复数：oinomels）指“蜂蜜+葡萄酒”的饮品，常见于古希腊文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drink made from a mixture of wine and honey (sometimes also with spices); essentially a type of honeyed wine","zh":"用葡萄酒与蜂蜜（有时加香料）混合制成的饮品；一种“蜜酒化的葡萄酒”"},"examples":[{"en":"In ancient Greece, people sometimes drank oinomel as a sweet, warming beverage.","zh":"在古希腊，人们有时会喝 oinomel，把它当作甜而暖身的饮品。"},{"en":"The recipe calls for warming the wine gently before stirring in honey to make oinomel.","zh":"这个配方要求先把葡萄酒温热，再搅入蜂蜜来做 oinomel。"}]}],"synonyms":["honeyed wine","mulled wine (when spiced and warmed)"],"phonetic":"/ˈɔɪnəˌmɛl/","extraExplanation":["“oinomel”来自希腊语：oinos（酒）+ meli（蜂蜜）。你输入的“oinomels”是其复数形式，表示“多种/多杯蜂蜜葡萄酒”。","不要和“mead（蜂蜜酒）”混淆：mead 主要是发酵蜂蜜水；而 oinomel 的基础通常是“葡萄酒 + 蜂蜜”，更像“加蜂蜜的葡萄酒”。"]}
{"word":"oint","summary":{"en":"“Oint” is a rare, old-fashioned verb meaning to smear or rub with oil/ointment.","zh":"“oint”是一个较罕见、偏古旧的动词，意思是给……涂油或药膏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/old-fashioned) To smear or rub with oil or ointment; to apply ointment to.","zh":"（罕见/较古旧）给……涂油或药膏；用油膏擦抹。"},"examples":[{"en":"In old stories, healers would oint the wound with herbs and oil.","zh":"在一些古老故事里，治疗者会用草药和油给伤口上药。"},{"en":"The nurse gently oint-ed the dry skin to reduce cracking.","zh":"护士轻轻给干燥的皮肤涂抹药膏，以减少开裂。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare) To become oily or coated with ointment.","zh":"（罕见）变得油腻；被油膏覆盖。"},"examples":[{"en":"After the cream sat for a while, the surface began to oint.","zh":"面霜放了一会儿后，表面开始变得油油的。"}]}],"synonyms":["anoint","smear","rub on","apply ointment"],"phonetic":"/ɔɪnt/","extraExplanation":["“oint”多见于较早期或文学化的英语，用法上常被更常见的“anoint”（给……傅油/膏，尤指宗教或正式场合）或“apply ointment / rub on ointment”取代。","词形上，“oint”与“ointment（药膏）”同源，因此语感上偏向“涂抹药膏/油膏”的具体动作，而“anoint”更常带有仪式或象征意味。"]}
{"word":"ointment","summary":{"en":"An ointment is a thick, oily medicine or cream you rub on the skin to soothe, protect, or heal.","zh":"ointment 指软膏/油膏，多为外用药膏，质地较厚偏油，用来舒缓、保护或促进皮肤愈合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A smooth, oily or creamy substance you put on the skin (often as medicine) to protect, soothe, or help heal an area.","zh":"（常指药用）软膏；涂在皮肤上的油性/膏状物，用于保护、舒缓或帮助伤口愈合。"},"examples":[{"en":"Put a thin layer of ointment on the cut twice a day.","zh":"每天在伤口上薄薄地涂两次软膏。"},{"en":"This ointment helps relieve itching from insect bites.","zh":"这种软膏能缓解蚊虫叮咬引起的瘙痒。"},{"en":"The doctor prescribed an antibiotic ointment for the rash.","zh":"医生开了抗生素软膏来治疗皮疹。"}]},{"partOfSpeech":"n.","definition":{"en":"Any thick substance used to coat or protect something (less common; usually used in technical or formal contexts).","zh":"（较少见）用于涂覆或保护的浓稠物质（多见于技术或正式语境）。"},"examples":[{"en":"A special ointment was applied to protect the surface from moisture.","zh":"涂了一种特殊的膏状涂层来防潮。"}]}],"synonyms":["salve","balm","unguent","topical cream"],"phonetic":"/ˈɔɪnt.mənt/","extraExplanation":["“Ointment”通常比“cream（乳霜）”更油、更厚、保湿性更强；比“lotion（乳液）”也更稠。药品里常见的搭配有：antibiotic ointment（抗生素软膏）、hydrocortisone ointment（氢化可的松软膏）。","常见用法：apply ointment（涂软膏）、a thin layer（薄薄一层）、topical ointment（外用软膏）。注意：一般说“an ointment”或“some ointment”，不太说“an ointment”来表示“药方/治疗”，而是指具体的膏体。"]}
{"word":"ointments","summary":{"en":"Ointments are topical (skin-applied) medicines or creams; the plural form of “ointment.”","zh":"ointments 是“ointment（软膏/药膏）”的复数，指外用涂抹在皮肤上的药膏或膏状护理品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"**Ointments** are smooth, oily or creamy medicines (or skincare products) that you rub on the skin to treat dryness, irritation, pain, or infection. (Plural of **ointment**.)","zh":"**ointments** 指“软膏/药膏”（**ointment** 的复数）：一种光滑、油性或乳霜状的外用药物或护肤品，涂抹在皮肤上，用于治疗干燥、刺激、疼痛或感染。"},"examples":[{"en":"The doctor prescribed two ointments: one for the rash and one for the cut.","zh":"医生开了两种药膏：一种治皮疹，一种用于伤口。"},{"en":"Keep all ointments out of children’s reach.","zh":"把所有药膏放在儿童够不着的地方。"},{"en":"Some ointments feel greasy, so apply a thin layer.","zh":"有些药膏会比较油腻，所以薄薄涂一层就好。"}]}],"synonyms":["salves","balms","unguent","topical creams"],"phonetic":"/ˈɔɪntmənt/","extraExplanation":["“ointment” 常用作不可数或可数名词：可以说 “some ointment”（一些药膏），也可以说 “an ointment / two ointments”（一种/两种药膏，强调不同种类或不同用途）。","常见搭配：apply ointment（涂药膏）、a topical ointment（外用软膏）、antibiotic/steroid ointment（抗生素/激素软膏）。与 cream/lotion 的区别：ointment 通常更油、封闭性更强，适合非常干燥或需要保护的皮肤。"]}
{"word":"oir","summary":{"en":"“OIR” is usually an abbreviation whose meaning depends on context; it is not a common everyday word.","zh":"“OIR”通常是需要看上下文的缩写；它不是日常常用的独立单词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(as an abbreviation) A set of initials that can stand for different things depending on the field (e.g., business, medicine, government). It is not a common standalone English word in everyday conversation.","zh":"（作缩写）一组首字母缩写，在不同领域含义可能不同（如商业、医疗、政府等）。它不是日常英语里常见的独立单词。"},"examples":[{"en":"In this report, OIR means “operating income ratio.”","zh":"在这份报告里，OIR 指“营业收入比率（operating income ratio）”。"},{"en":"Please define OIR the first time you use it in your document.","zh":"请在文件中第一次使用 OIR 时先给出它的定义。"}]},{"partOfSpeech":"other","definition":{"en":"(rare; not standard in modern English) A spelling you may see inside other words (e.g., memoir), but “oir” by itself usually isn’t used as a normal word.","zh":"（罕见；非现代标准用法）你可能会在其他单词中看到这一字母组合（如 memoir），但“oir”单独使用通常不算常规单词。"},"examples":[{"en":"The letters “oir” appear in the word “memoir.”","zh":"“memoir” 这个词里包含字母组合“oir”。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/oʊ aɪ ɑr/","extraExplanation":["“OIR”更常见的用法是缩写，但它没有一个“放之四海皆准”的固定含义，必须看上下文（行业、文件、句子）。如果你告诉我它出现的句子或领域（例如财务、医学、学校文件），我可以帮你确定它具体代表什么。","如果你原本想查的是“our /aʊr/（我们的）”“oil /ɔɪl/（油）”或别的单词，也可以把正确拼写发我，我会给你完整词条。"]}
{"word":"oisivity","summary":{"en":"“oisivity” is not a standard English word; it’s likely a misspelling (often of “positivity” or “productivity”).","zh":"“oisivity”不是标准英语单词；很可能是拼写错误（常见可能是“positivity”或“productivity”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “oisivity” is most likely a misspelling or a typo in English text.","zh":"不是标准英语单词。“oisivity”很可能是拼写错误或打字错误。"},"examples":[{"en":"I can’t find “oisivity” in a dictionary—did you mean “positivity”?","zh":"我在词典里找不到“oisivity”——你是不是想说“positivity（积极性）”？ "},{"en":"The report says “oisivity,” but the context suggests it should be “productivity.”","zh":"报告里写的是“oisivity”，但从上下文看应该是“productivity（生产力/效率）”。"}]}],"phonetic":"/ɔɪˈsɪvɪti/","extraExplanation":["“oisivity”在常见英语词典中通常查不到。它很像把某个以“-sivity / -tivity”结尾的词打错了。常见候选包括：\n1) positivity（积极性、正向态度）\n2) productivity（生产力、效率）\n3) passivity（被动性）\n\n你可以把包含该词的整句/截图发来，我可以根据上下文判断最可能的正确词。"]}
{"word":"oitava","summary":{"en":"Oitava is a Portuguese word meaning “octave” in music, and more generally “eighth” or “one eighth.”","zh":"Oitava 是葡语词：在音乐中指“八度”，更一般也可指“第八”或“八分之一”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Portuguese) an octave; the interval between one musical note and another with double its frequency.","zh":"（葡语）八度；两个音之间频率相差一倍的音程。"},"examples":[{"en":"In the chorus, the singer repeats the melody an oitava higher.","zh":"在副歌里，歌手把旋律提高一个八度再唱一遍。"},{"en":"The pianist practiced the scale in oitavas to build strength.","zh":"钢琴家用八度练习音阶来增强力量。"}]},{"partOfSpeech":"n.","definition":{"en":"(Portuguese) “eighth”; the eighth part or the eighth position in a series.","zh":"（葡语）“第八；八分之一”；表示序列中的第八或整体的八分之一。"},"examples":[{"en":"She finished in oitava place in the competition.","zh":"她在比赛中获得第八名。"},{"en":"Cut the cake into eight pieces; each is an oitava.","zh":"把蛋糕切成八块；每一块是八分之一。"}]}],"synonyms":["octave","eighth","one eighth"],"phonetic":"/oʊˈtɑːvə/","extraExplanation":["“oitava”是葡萄牙语/巴西葡语常见词，来自拉丁语“octavus”（第八）。在音乐语境里通常对应英语“octave”。在日常语境里则常指“第八”或“八分之一”。","如果你其实想查英语单词，最接近的英语词是“octave”（八度）。"]}
{"word":"oiticica","summary":{"en":"Oiticica is a drying oil (or the material name) from the oiticica tree, used in paints and varnishes.","zh":"Oiticica 指从 oiticica 树种子获得的干性油，常用于油漆、清漆等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drying oil made from the seeds of the oiticica tree, used in paints, varnishes, inks, and other coatings","zh":"从巴西“oiticica（奥伊蒂西卡）树”种子榨取的一种干性油，用于油漆、清漆、油墨等涂料与涂层材料"},"examples":[{"en":"Oiticica oil is used in some varnishes because it forms a hard film as it dries.","zh":"Oiticica 油用于一些清漆，因为它干燥后能形成坚硬的膜。"},{"en":"The manufacturer tested oiticica as a substitute for other drying oils in paint.","zh":"厂家测试用 oiticica 作为油漆中其他干性油的替代品。"}]}],"synonyms":["oiticica oil","drying oil"],"phonetic":"/ˌɔɪtɪˈsiːkə/","extraExplanation":["“Oiticica”常见于材料、涂料与工业语境，来源于巴西本土树种（常指 Licania rigida）的种子油；在英语里属于较少见的外来词，多见于技术资料。","它被称为“干性油（drying oil）”，意思是暴露在空气中会氧化聚合，逐渐变成坚韧的固体涂膜；这一点使它适合用于清漆、油墨和防护涂层。"]}
{"word":"oiticicas","summary":{"en":"“Oiticica(s)” most often refers to the Brazilian artist Hélio Oiticica; less commonly it can refer to a Brazilian tree or its seed oil.","zh":"“Oiticica(s)”最常指巴西艺术家埃利奥·奥伊蒂西卡；较少情况下也可指巴西的一种树或其种子油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Brazilian surname; most famously referring to Hélio Oiticica (1937–1980), an influential Brazilian artist known for experimental, participatory installation art.","zh":"巴西人的姓氏；最著名的指巴西艺术家埃利奥·奥伊蒂西卡（Hélio Oiticica，1937–1980），以实验性、参与式装置艺术闻名。"},"examples":[{"en":"I’m reading about Hélio Oiticica and his interactive installations.","zh":"我在读关于埃利奥·奥伊蒂西卡及其互动装置作品的资料。"},{"en":"The museum opened a new exhibition dedicated to Oiticica.","zh":"博物馆开设了一个新的展览，专门献给奥伊蒂西卡。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common in English) a Brazilian tree called “oiticica,” or the oil obtained from its seeds, sometimes used in paints and varnishes.","zh":"（英语中较少见）巴西的一种树，称为“oiticica（奥伊蒂西卡树）”；也可指其种子榨取的油，有时用于油漆和清漆。"},"examples":[{"en":"Some older sources mention oiticica oil in paint formulas.","zh":"一些较早的资料会在涂料配方中提到奥伊蒂西卡油。"},{"en":"The term “oiticica” comes from Portuguese usage in Brazil.","zh":"“oiticica”这个词来自巴西葡萄牙语的用法。"}]}],"synonyms":["(artist) Hélio Oiticica","(tree/oil) oiticica tree","(oil) oiticica oil"],"phonetic":"/oʊˌitɪˈsikə/","extraExplanation":["你输入的“oiticicas”更像是“oiticica”的复数形式（多个oiticica/多棵奥伊蒂西卡树），或是指奥伊蒂西卡家族的人。英语里更常见的写法通常是首字母大写的专有名词“Oiticica”（尤其指艺术家）。如果你告诉我你在哪篇文章/语境里看到它，我可以帮你确认具体指哪一种含义与更自然的译法。"]}
