{"word":"oo","summary":{"en":"“oo” is an English spelling pattern, most often pronounced /uː/ (moon) but sometimes /ʊ/ (book); it can also be an informal reaction sound (often written “ooh”).","zh":"“oo”是英语常见的拼写组合，最常读/uː/（moon），有时读/ʊ/（book）；也可作非正式的惊叹拟声（常写作“ooh”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the letter combination “oo” in English spelling, usually representing a long “oo” sound /uː/ (as in moon) or sometimes a shorter sound /ʊ/ (as in book).","zh":"英语拼写中的字母组合“oo”，通常表示长音/uː/（如 moon），有时也表示较短的/ʊ/（如 book）。"},"examples":[{"en":"In “moon,” “oo” sounds like /uː/.","zh":"在“moon”里，“oo”发/uː/。"},{"en":"In “book,” “oo” sounds different: /ʊ/.","zh":"在“book”里，“oo”的发音不同：/ʊ/。"},{"en":"Try comparing “food” and “good” to hear the two common “oo” sounds.","zh":"试着对比“food”和“good”，听听两种常见的“oo”发音。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal) a written sound used to show someone reacting with interest, surprise, or admiration (often spelled “ooh”).","zh":"（非正式）表示感兴趣、惊讶或赞叹的拟声词（更常写作“ooh”）。"},"examples":[{"en":"“Oo, that’s pretty!” she said.","zh":"“Oo，这个真好看！”她说。"},{"en":"The crowd went “oo!” when the lights turned on.","zh":"灯亮起来时，人群发出“oo!”的声音。"}]}],"synonyms":["ooh","oooh","long oo sound","short oo sound"],"phonetic":"/uː/","extraExplanation":["“oo”的读音没有百分百固定：常见规律是，很多与食物/情绪/常用词相关的词会读/ʊ/（如 good, book, look），而表示“长音oo”的词常读/uː/（如 food, moon, school）。但也有例外，需要结合单词记忆。","在漫画、聊天里，表示惊叹的写法更常见的是“ooh / oooh”。“oo”单独使用也能出现，但语气通常需要上下文支持。"]}
{"word":"ooangium","summary":{"en":"Ooangium is a biology term for a female structure that produces egg cells in certain algae and fungi (often a rare/older spelling of oogonium).","zh":"Ooangium 是生物学术语，指某些藻类和真菌中产生卵细胞的雌性结构（常被视为 oogonium 的较少见/较旧拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A female reproductive structure (gametangium) in some algae, fungi, and other organisms that produces egg cells (oospheres).","zh":"（生物）某些藻类、真菌等生物的雌性生殖结构（配子囊），产生卵细胞（卵球）。"},"examples":[{"en":"In water molds, the ooangium contains the developing egg cells.","zh":"在水霉中，ooangium 内含正在发育的卵细胞。"},{"en":"Under the microscope, students could see an ooangium forming beside the male structure.","zh":"在显微镜下，学生们能看到 ooangium 在雄性结构旁形成。"}]}],"synonyms":["oogonium","female gametangium"],"phonetic":"/oʊˈændʒiəm/","extraExplanation":["ooangium 常见于较旧或较少见的拼写形式，有时也写作 oöangium（用分音符号表示两个元音分别发音），现代教材更常用 oogonium。","词源上可理解为 oo-（与“卵/蛋”相关）+ -angium（“容器/囊”之意的构词成分），整体指“产生卵细胞的囊状结构”。"]}
{"word":"oobit","summary":{"en":"“oobit” is not standard English; it’s usually a proper name or a typo depending on context.","zh":"“oobit”不是标准英语词汇；通常是专有名词或根据语境判断的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (e.g., a brand, app, or username) rather than a dictionary vocabulary item.","zh":"不是标准英语词汇；更常见于专有名词（如品牌、应用名或用户名），而不是词典里的常用单词。"},"examples":[{"en":"I saw “Oobit” in the app store, but I’m not sure what it refers to.","zh":"我在应用商店里看到“Oobit”，但不确定它指的是什么。"},{"en":"Oobit is the name of a project, not a common English word.","zh":"Oobit是一个项目的名字，不是常见的英语单词。"}]}],"phonetic":"/ˈuːbɪt/","extraExplanation":["“oobit”很可能是：1）某个品牌/产品/项目名（专有名词）；2）打字拼写错误。常见的可能误拼包括：orbit（轨道）、a bit（一点儿）、out of it（迷糊、不在状态，口语短语）。","如果你告诉我它出现的句子或场景（例如一段聊天、标题、产品页面），我可以更准确判断它应如何理解与翻译。"]}
{"word":"ooblast","summary":{"en":"Ooblast means an early, immature stage of an egg cell in biological development.","zh":"Ooblast 指卵细胞发育早期的未成熟阶段（生物学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An immature egg cell (a developing ovum) in early stages of formation, before it becomes a mature egg (oocyte/ovum).","zh":"卵原细胞／卵母细胞（未成熟的卵细胞），指卵子形成早期阶段的发育中细胞，尚未成为成熟卵（卵母细胞/卵）。"},"examples":[{"en":"In some textbooks, the earliest stage of egg development is described as an ooblast.","zh":"在一些教材中，卵细胞发育的最早阶段被描述为 ooblast。"},{"en":"Researchers studied how an ooblast grows and differentiates into later egg-cell stages.","zh":"研究人员研究了 ooblast 如何生长并分化为后续的卵细胞阶段。"}]}],"synonyms":["oogonium","oocyte (early stage)","immature egg cell"],"phonetic":"/ˈoʊəˌblæst/","extraExplanation":["这是一个较少见、偏旧或偏专门的术语。在现代生物学/医学写作中，更常见的相关词是 **oogonium（卵原细胞）**、**oocyte（卵母细胞）** 和 **ovum（卵/卵子）**。","词源上可拆成 **oo-**（表示“卵/蛋”）+ **-blast**（表示“芽、胚/未成熟细胞”），因此整体含义就是“卵的早期/未成熟细胞”。"]}
{"word":"ooblastic","summary":{"en":"Ooblastic means “related to ooblasts,” i.e., early egg-forming or immature egg cells.","zh":"ooblastic 指“与卵母细胞（早期形成卵的细胞）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an ooblast (an immature egg cell or egg-forming cell) or to the early formation/development of egg cells.","zh":"与卵母细胞（未成熟的卵细胞/形成卵的细胞）有关的；与卵细胞早期形成或发育有关的。"},"examples":[{"en":"Researchers studied ooblastic cells to understand how eggs begin to develop.","zh":"研究人员研究卵母细胞相关的细胞，以了解卵子如何开始发育。"},{"en":"The paper describes an ooblastic stage in the organism’s reproductive cycle.","zh":"论文描述了该生物生殖周期中的一个卵母细胞形成阶段。"}]}],"synonyms":["egg-forming (contextual)","oocyte-related (contextual)"],"phonetic":"/oʊˈblæstɪk/","extraExplanation":["“ooblastic”是相对少见、偏专业的生物学用语，多见于发育生物学、生殖生物学或组织学语境。","词根提示：oo- 来自希腊语，意为“卵/蛋”；-blast 在生物学里常表示“胚芽/未分化的原始细胞”（如 blast cell），因此 ooblastic 通常指“与形成卵的原始细胞/卵母细胞相关”。"]}
{"word":"oocyesis","summary":{"en":"Oocyesis means an egg developing into an embryo without fertilization (a form of parthenogenesis).","zh":"Oocyesis 指卵子不经受精就发育成胚胎的一种生殖方式（孤雌生殖的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of reproduction in which an egg develops into an embryo without being fertilized (a form of parthenogenesis).","zh":"卵子不经受精就发育成胚胎的一种生殖方式（属于孤雌生殖/单性生殖的一种）。"},"examples":[{"en":"In some insects, oocyesis allows females to produce offspring without mating.","zh":"在一些昆虫中，oocyesis 让雌性即使不交配也能产生后代。"},{"en":"The textbook mentioned oocyesis as a rare reproductive strategy in certain species.","zh":"教材提到 oocyesis 是某些物种中较少见的一种繁殖策略。"}]}],"synonyms":["parthenogenesis","asexual reproduction","virgin birth (in animals)"],"phonetic":"/ˌoʊ.oʊ.saɪˈiː.sɪs/","extraExplanation":["这是一个非常少见、偏生物学术语的词，多见于学术写作；日常英语里更常用 parthenogenesis（孤雌生殖）来表达相近概念。","词源可拆为 oo-（源自希腊语“卵”）+ -cyesis（“妊娠/怀孕”），字面含义接近“卵的妊娠”。","它描述的是“卵未受精却开始发育”的现象，通常用于某些昆虫、爬行动物等；在讨论人类时容易与宗教或神话中的“童贞生子”概念混淆，但科学语境下指的是特定的生殖机制。"]}
{"word":"oocyst","summary":{"en":"An oocyst is a tough, egg-like capsule made by some parasites; it helps them survive and spread, often through contaminated food, water, or feces.","zh":"oocyst（卵囊）是某些寄生虫形成的坚韧“卵状囊体”，帮助其在环境中存活并传播，常与受污染的食物、水或粪便有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick-walled, egg-like stage in the life cycle of certain parasites (especially protozoa such as coccidia). It contains the forms that can develop into infective organisms and is often shed into the environment (for example, in feces).","zh":"（某些寄生虫，尤指球虫等原虫的）卵囊：其生命周期中的一种厚壁、类似卵的阶段，内部含有可继续发育并形成感染性个体的结构，常被排出体外进入环境（例如随粪便排出）。"},"examples":[{"en":"The vet found oocysts in the stool sample, suggesting a coccidia infection.","zh":"兽医在粪便样本中发现了卵囊，提示可能感染了球虫。"},{"en":"Good hygiene helps reduce exposure to oocysts in contaminated water or soil.","zh":"良好的卫生习惯有助于减少接触受污染水源或土壤中的卵囊。"}]},{"partOfSpeech":"n.","definition":{"en":"In malaria research, a stage of Plasmodium that develops on the wall of a mosquito’s gut and later releases sporozoites.","zh":"（疟疾研究中）疟原虫在蚊子肠壁上发育形成的阶段，之后会释放子孢子。"},"examples":[{"en":"Scientists counted mosquito oocysts to measure how well the vaccine blocked transmission.","zh":"科学家通过统计蚊体内的卵囊数量来评估疫苗阻断传播的效果。"}]}],"synonyms":["(biology) cyst","(parasitology) sporulated cyst"],"phonetic":"/ˈoʊ.ə.sɪst/","extraExplanation":["词源上由 oo-（表示“卵/蛋”，来自希腊语 ōion）+ cyst（囊）组成，所以可以把它理解为“卵状的囊”。","在日常英语里，这个词多见于医学、寄生虫学、兽医或公共卫生语境；普通对话中不常用。"]}
{"word":"oocystaceae","summary":{"en":"Oocystaceae: a family of freshwater green algae (a taxonomic group).","zh":"Oocystaceae：卵囊藻科，淡水绿藻的一个分类“科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family (taxonomic group) of green algae, especially freshwater algae that often form single cells or small colonies.","zh":"卵囊藻科（一个科学分类单位），属于绿藻类，多见于淡水环境，常为单细胞或小型群体。"},"examples":[{"en":"Oocystaceae includes several freshwater green algae found in ponds and lakes.","zh":"卵囊藻科包含多种淡水绿藻，常见于池塘和湖泊。"},{"en":"In the lab, we identified the sample as belonging to the family Oocystaceae.","zh":"在实验室里，我们鉴定该样品属于卵囊藻科。"}]}],"synonyms":["Oocystis (related genus)","green algae","Chlorophyta (broader group)"],"phonetic":"/ˌoʊoʊsɪˈsteɪsiˌi/","extraExplanation":["“Oocystaceae”是拉丁化的生物分类名称，词尾“-aceae”表示“科”（family）。词根“oo-”与“卵/卵形”有关，“cyst”与“囊/包囊”有关，整体暗示这类藻常见具有囊状或卵形结构的特征。","这种词通常只在生物学、生态学或水质监测等语境中使用；日常英语里很少见。"]}
{"word":"oocystaceous","summary":{"en":"“Oocystaceous” means oocyst-like—having the form or features of an oocyst, usually in scientific writing.","zh":"“oocystaceous”指“卵囊样的”，多用于科学语境，表示形态或特征类似卵囊。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or relating to an oocyst (a thick-walled “egg-like” cyst stage of certain parasites, such as protozoa).","zh":"似卵囊的；与卵囊有关的（卵囊是某些寄生虫如原虫的厚壁“卵状”包囊阶段）。"},"examples":[{"en":"Under the microscope, the sample showed oocystaceous bodies consistent with coccidian parasites.","zh":"在显微镜下，样本显示出与球虫类寄生虫相符的卵囊样结构。"},{"en":"The report describes an oocystaceous wall that helps the organism survive outside a host.","zh":"报告描述了卵囊样的囊壁，能帮助该生物在宿主体外存活。"}]}],"synonyms":["oocyst-like","oocystic"],"phonetic":"/ˌoʊ.ə.sɪˈsteɪ.ʃəs/","extraExplanation":["这是一个相对少见、偏专业的形容词，常见于寄生虫学/微生物学论文中。词形可拆为：oo-（与“卵/蛋”有关）+ cyst（囊、包囊）+ -aceous（“……状的、具有……性质的”）。在更常见的写法里，作者也可能用 oocyst-like 或 oocystic 来表达类似意思。"]}
{"word":"oocystic","summary":{"en":"Oocystic means “related to oocysts,” a tough-walled parasite stage often discussed in medical and veterinary contexts.","zh":"oocystic 意为“与卵囊有关的”，常见于医学/兽医学中，用于描述寄生虫的卵囊期或卵囊结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an oocyst (a thick-walled stage in the life cycle of certain parasites, such as coccidia), or involving the formation or presence of oocysts.","zh":"与卵囊有关的；涉及卵囊（某些寄生虫如球虫的生命周期中具有厚壁的阶段）的形成或存在的。"},"examples":[{"en":"The lab confirmed an oocystic stage in the parasite’s life cycle.","zh":"实验室证实该寄生虫的生命周期中存在卵囊期。"},{"en":"Doctors suspected an oocystic infection after finding oocysts in the stool sample.","zh":"在粪便样本中发现卵囊后，医生怀疑是与卵囊相关的感染。"}]}],"synonyms":["oocyst-related","coccidial (related term)"],"phonetic":"/ˌoʊ.oʊˈsɪs.tɪk/","extraExplanation":["“oocystic”多见于医学、寄生虫学与兽医学文献，常用来描述与球虫（coccidia）或隐孢子虫（Cryptosporidium）等相关的“卵囊期/卵囊结构”。","构词：oo-（与“卵/卵子”有关）+ cyst（囊）+ -ic（形容词后缀，“……的”）。因此它基本等同于“of/related to an oocyst”。","日常英语中很少使用；更常见的是名词“oocyst（卵囊）”，以及形容词“coccidial（球虫的）”“cryptosporidial（隐孢子虫的）”。"]}
{"word":"oocystis","summary":{"en":"Oocystis is a genus of freshwater microscopic green algae, often seen as small colonies within a gelatinous оболочка.","zh":"Oocystis（卵囊藻属）是淡水中常见的一类微型绿藻，常以被胶质包被包围的小群体出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of microscopic green algae (family Oocystaceae) found mainly in freshwater; its cells often live in small colonies inside a clear, gelatinous envelope.","zh":"卵囊藻属（Oocystis）：一种常见于淡水的微型绿藻类群（卵囊藻科），细胞常在透明的胶质包被中形成小群体。"},"examples":[{"en":"Under the microscope, we identified Oocystis colonies in the pond sample.","zh":"在显微镜下，我们在池塘样本中鉴定出了卵囊藻属的群体。"},{"en":"Oocystis is often used in water-quality studies because it can respond to nutrient changes.","zh":"卵囊藻属常用于水质研究，因为它会对营养盐变化产生反应。"}]}],"synonyms":["green algae (genus Oocystis)","Oocystaceae (family context)"],"phonetic":"/oʊˈoʊsɪstɪs/","extraExplanation":["词源上可拆为 oo-（与“卵/卵形”有关）+ cyst（囊、包囊）。属名强调其细胞常见“像卵一样、被囊状结构包裹”的外观特征。","注意：Oocystis 是一个生物分类学的“属名”，通常首字母大写并用斜体书写（如 *Oocystis*）。在非正式文本中也常见不使用斜体的写法。"]}
{"word":"oocysts","summary":{"en":"Oocysts are tough, egg-like parasite capsules that can spread infection after they mature.","zh":"卵囊是耐受性强、类似卵的寄生虫囊体，成熟后可传播感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A resistant egg-like stage (spore-like capsule) of certain protozoan parasites, shed in feces and able to infect a new host after it matures (sporulates).","zh":"某些原虫寄生虫的耐受性“卵样”阶段（类似孢子的囊体），可随粪便排出；在环境中成熟（孢子化）后可感染新的宿主。"},"examples":[{"en":"The water sample tested positive for Cryptosporidium oocysts.","zh":"该水样检测出隐孢子虫卵囊呈阳性。"},{"en":"Oocysts can survive in the environment and spread disease if sanitation is poor.","zh":"在卫生条件差的情况下，卵囊可在环境中存活并传播疾病。"},{"en":"After sporulation, the oocysts become infectious.","zh":"孢子化后，卵囊才具有感染性。"}]}],"synonyms":["(infective) cysts","spore-like stage"],"phonetic":"/ˈoʊ.ə.sɪsts/","extraExplanation":["“oocyst”常见于寄生虫学与公共卫生语境，尤其是球虫类（如Eimeria）与隐孢子虫（Cryptosporidium）。它们往往对环境有较强抵抗力，有时也能耐受常规消毒，因此饮用水安全与动物饲养管理中会特别关注。","词源上，oo-与“egg（卵）”有关，-cyst表示“囊”，合起来就是“卵囊/卵样囊体”的意思。"]}
{"word":"oocyte","summary":{"en":"An oocyte is an immature female egg cell that can mature into an ovum.","zh":"oocyte 指可成熟为卵子的未成熟女性卵细胞（卵母细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female reproductive cell (egg cell), especially an immature one that can develop into an ovum (mature egg).","zh":"卵母细胞（女性生殖细胞），尤指尚未成熟、可发育成卵子（成熟卵细胞）的阶段。"},"examples":[{"en":"Scientists observed how an oocyte changes as it matures in the ovary.","zh":"科学家观察了卵母细胞在卵巢中成熟时的变化。"},{"en":"In IVF, an oocyte is collected and then fertilized in a lab.","zh":"在试管婴儿（IVF）中，会取出卵母细胞并在实验室中使其受精。"}]}],"synonyms":["egg cell","immature egg cell"],"phonetic":"/ˈoʊəˌsaɪt/","extraExplanation":["词源：oocyte 来自希腊语 oo-（“卵”）+ -cyte（“细胞”）。","区分：oocyte 常指“未成熟的卵细胞”；ovum 常指“成熟的卵子”。在医学与生物学文章中，这种区分很常见，但日常英语里 people 也可能直接用 egg 来泛指。","常见搭配：oocyte maturation（卵母细胞成熟）、oocyte retrieval（取卵/卵母细胞取出）、oocyte donor（卵母细胞捐赠者）。"]}
{"word":"oocytes","summary":{"en":"Oocytes are immature egg cells found in the ovaries.","zh":"oocytes 指卵巢中的未成熟卵细胞（卵母细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An immature egg cell in an ovary; it can develop into an ovum (a mature egg) through the process of oogenesis.","zh":"卵母细胞；位于卵巢中的未成熟卵细胞，可在卵子发生（卵生成）过程中发育为成熟卵（卵细胞）。"},"examples":[{"en":"In mammals, oocytes develop inside ovarian follicles.","zh":"在哺乳动物中，卵母细胞在卵巢卵泡内发育。"},{"en":"The doctor checked whether the oocytes were healthy before fertilization.","zh":"在受精前，医生检查卵母细胞是否健康。"},{"en":"Researchers counted the number of oocytes under a microscope.","zh":"研究人员在显微镜下统计卵母细胞的数量。"}]}],"synonyms":["egg cells","immature egg cells"],"phonetic":"/ˈoʊ.ə.saɪts/","extraExplanation":["“oocytes”是“oocyte”的复数形式。日常英语里较常见的是“egg cell(s)”（卵细胞/卵子），而在医学、生物学或生殖领域更常用“oocyte(s)”。","词源上，“oo-”来自希腊语表示“卵/蛋”，“-cyte”表示“细胞”，因此字面含义就是“卵细胞”。","常见相关搭配：immature oocyte（未成熟卵母细胞）、mature oocyte（成熟卵母细胞）、oocyte retrieval（取卵，常用于IVF试管婴儿语境）。"]}
{"word":"oodles","summary":{"en":"“oodles” is usually the plural form “noodles”: a type of long, thin pasta/Asian-style noodles.","zh":"“oodles”通常就是“noodles（面条）”的复数：指长条状的面食/面条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Noodles (plural): long, thin strips of dough (made from flour and water/eggs), cooked by boiling or frying and eaten as food.","zh":"面条（复数）：用面粉和水/鸡蛋做成的长条状食物，可煮或炒来吃。"},"examples":[{"en":"I had chicken noodles for lunch.","zh":"我午饭吃了鸡肉面。"},{"en":"She cooked noodles with vegetables and soy sauce.","zh":"她用蔬菜和酱油炒面。"},{"en":"Instant noodles are quick, but fresh noodles taste better.","zh":"方便面很快，但鲜面条更好吃。"}]}],"synonyms":["pasta (general)","egg noodles","rice noodles"],"phonetic":"/ˈnuːdəlz/","extraExplanation":["“noodle(s)”在英语里既可以指亚洲常见的面条（如拉面、乌冬、米粉），也可以指意大利面中较细长的一类（如spaghetti 在美式口语里有时也会被泛称为 noodles）。","美式英语中常见搭配：noodle soup（面汤）、stir-fried noodles（炒面）、rice noodles（米粉）、egg noodles（鸡蛋面）、instant noodles（方便面）。","注意：单数 noodle 常用于“a noodle”（一根面条）或口语/俚语里表示“脑子”相关（如 use your noodle=动动脑筋），但“oodles”这个拼写通常不是这个意思。"]}
{"word":"oodlins","summary":{"en":"“Oodlins” is a dialect/informal word meaning “a lot; lots of; plenty.”","zh":"“oodlins”是方言/非正式用语，意思是“很多；大量的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"a very large number or amount; lots of","zh":"大量的；很多的"},"examples":[{"en":"There were oodlins of people at the festival.","zh":"节日现场有一大堆人。"},{"en":"She’s got oodlins of homework tonight.","zh":"她今晚有一大堆作业。"}]},{"partOfSpeech":"det.","definition":{"en":"many; plenty of (used before a noun, especially in dialect or informal speech)","zh":"许多的；大量的（多用于方言或非正式表达，置于名词前）"},"examples":[{"en":"We’ve got oodlins time—no need to rush.","zh":"我们时间多得很——不用赶。"},{"en":"He brought oodlins gifts for the kids.","zh":"他给孩子们带了很多礼物。"}]}],"synonyms":["oodles","lots","plenty","a ton","heaps"],"phonetic":"/ˈuːdlɪnz/","extraExplanation":["“oodlins”常见于苏格兰英语（Scots）或英式方言写法，语气很口语、很随意，意思相当于标准英语里的“oodles of / lots of / plenty of”。在正式写作中一般不用，写作时更常见拼法是“oodles”。"]}
{"word":"ooecia","summary":{"en":"Ooecia are the brood chambers of bryozoans (plural of ooecium).","zh":"ooecia 指苔藓虫等动物的育卵室（ooecium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"brood chambers (specialized egg-housing structures) found in many bryozoans, where embryos are protected and develop; plural of “ooecium.”","zh":"（苔藓虫等）育卵室／育房：许多苔藓虫体表用于保护并培育胚胎的特殊“卵室”结构；为 ooecium 的复数。"},"examples":[{"en":"Under the microscope, the colony shows several ooecia along the outer edge.","zh":"在显微镜下，这个群体的外缘可以看到好几个育卵室（ooecia）。"},{"en":"The researcher compared the shapes of ooecia to identify the bryozoan species.","zh":"研究人员通过比较育卵室（ooecia）的形状来鉴定苔藓虫的种类。"}]}],"synonyms":["brood chambers","brood sacs"],"phonetic":"/oʊˈiːʃiə/","extraExplanation":["ooecia 常见于动物学、海洋生物学与古生物学（化石鉴定）语境，因为苔藓虫的育卵室形态在分类上很有参考价值。","词源上与希腊语“卵/蛋”（ōion）和“居所/房屋”（oikia 等相关词根）有关，字面可理解为“卵的房间”。"]}
{"word":"ooecial","summary":{"en":"Special means unusual or important, or made for a particular person or purpose; it can also mean a limited-time deal or menu item.","zh":"Special 表示“特别的/重要的”或“专门的/特制的”；也可作名词表示“特价/特餐”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"different from what is usual; not ordinary; having a particular quality or importance","zh":"特别的；不同于一般的；有特殊性质或重要性的"},"examples":[{"en":"Today is a special day for our family.","zh":"今天对我们家来说是个特别的日子。"},{"en":"She has a special talent for languages.","zh":"她在语言方面有特殊的天赋。"}]},{"partOfSpeech":"adj.","definition":{"en":"made for one particular person, purpose, or situation","zh":"专门的；特制的；为特定人/目的/情况准备的"},"examples":[{"en":"The chef prepared a special meal for the guest.","zh":"厨师为那位客人准备了一份特制餐点。"},{"en":"You need special tools to fix this machine.","zh":"你需要专用工具才能修好这台机器。"}]},{"partOfSpeech":"n.","definition":{"en":"a product or meal offered at a lower price or with extra attention for a limited time (often in restaurants or stores)","zh":"特价品；本日/限时特餐（常见于餐厅或商店）"},"examples":[{"en":"What’s today’s special?","zh":"今天的特餐是什么？"},{"en":"They’re running a weekend special on coffee.","zh":"他们周末对咖啡做特价活动。"}]}],"synonyms":["particular","unusual","unique","distinctive","exclusive"],"phonetic":"/ˈspɛʃəl/","extraExplanation":["你输入的“ooecial”很可能是拼写错误，正确拼写通常是 special。","special 作形容词时很常见：a special day（特别的一天）、special attention（特别关注）、special needs（特殊需求/特殊需要；使用时注意语境，尽量尊重当事人偏好用语）。"]}
{"word":"ooecium","summary":{"en":"Ooecium means a brood chamber in certain bryozoans where embryos develop.","zh":"Ooecium 指某些苔藓虫用于保护与孕育胚胎的育幼室（育卵室）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialized brood chamber in some bryozoans (moss animals) where embryos are protected and develop.","zh":"（部分苔藓虫/外肛动物的）育幼室、育卵室：一种特化的结构，用来保护并孕育胚胎。"},"examples":[{"en":"In many bryozoans, embryos develop inside an ooecium for protection.","zh":"在许多苔藓虫中，胚胎会在育幼室（ooecium）里发育，以获得保护。"},{"en":"Under the microscope, the ooecium looks like a small dome on the colony surface.","zh":"在显微镜下，育幼室看起来像群体表面一个小小的拱顶。"}]}],"synonyms":["brood chamber","ovicell"],"phonetic":"/oʊˈiːʃiəm/","extraExplanation":["词源提示：ooecium 来自希腊语 oo-（“卵、蛋”）+ -oecium（与“居所、室”相关），字面意思接近“卵的房间”。","相关术语：在一些资料里你会看到 ovicell（育卵室）与 ooecium 相关或近似，但不同分类系统中用法可能略有差异；读论文时可留意作者的定义与图示。"]}
{"word":"oof","summary":{"en":"“Oof” is an informal exclamation for pain, surprise, disappointment, or sympathy.","zh":"“oof”是非正式的感叹词，用来表达疼痛、吃惊、失望或同情。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"an exclamation used to show that you feel pain, shock, disappointment, or sympathy","zh":"（感叹词）用于表达疼痛、吃惊、失望，或对他人的同情"},"examples":[{"en":"Oof! I hit my knee on the table.","zh":"哎哟！我膝盖撞到桌子了。"},{"en":"Oof, that exam was harder than I expected.","zh":"唉，那场考试比我想的难。"},{"en":"Oof… I’m sorry you’re going through that.","zh":"唉……听到你经历这些我很难过。"}]}],"synonyms":["ow","ouch","ugh","oh no"],"phonetic":"/uf/","extraExplanation":["“oof”是很口语、偏网络的感叹词，常见于聊天、评论区和漫画/游戏字幕里。","语气会因标点和语境变化：如“Oof!”更像突然疼或受惊；“Oof…”更像无奈、尴尬或同情。","它也常被用来表达“替你尴尬/心疼一下”的感觉（类似中文的“啊这…/唉/心疼”），但正式写作中一般不用。"]}
{"word":"oofbird","summary":{"en":"An informal, invented term—often a username—built from “oof” + “bird.”","zh":"一个非正式的自造词（常作网名），由“oof”+“bird”组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A made-up or informal word (often a username or playful nickname) combining “oof” (an exclamation showing pain/awkwardness) + “bird.” It can mean “a bird that makes you say ‘oof,’” or “a person/character associated with saying ‘oof.’”","zh":"一个自创/非正式用词（常见于网名或玩笑昵称），由“oof”（表示疼痛、尴尬、无语的感叹词）+“bird”（鸟）组成。可指“让人忍不住喊‘oof’的鸟”，或“总爱说‘oof’的人/角色”。"},"examples":[{"en":"My gamer tag is Oofbird.","zh":"我的游戏昵称是 Oofbird。"},{"en":"That crash was so bad—total oofbird moment.","zh":"那次撞车太惨了——简直是个“oofbird”时刻（让人只能‘oof’）。"},{"en":"He drew an ‘oofbird’ character for the comic: a bird that always says “oof.”","zh":"他为漫画画了一个“oofbird”角色：一只总在说“oof”的鸟。"}]}],"synonyms":["made-up word","nickname","handle"],"phonetic":"/ˈuːfˌbɝːd/","extraExplanation":["“oofbird”不是标准英语词典里常见的词，更像网络自造词/昵称。理解时可以拆开看：oof（感叹“哎哟/无语/翻车了”）+ bird（鸟/家伙）。在不同社群里具体含义可能会变化。"]}
{"word":"oofier","summary":{"en":"“Oofier” is slang for “more painful/awkward/embarrassing,” like something that makes you say “oof.”","zh":"“oofier”是俚语，表示“更疼/更尴尬/更让人难受”，让人忍不住想说“oof”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, comparative) More “oofy”: causing a stronger feeling of sudden pain, embarrassment, awkwardness, or sympathy (the kind of reaction you might express with “oof”).","zh":"（俚语，比较级）更“oof”的：更让人感到突然的疼、尴尬、别扭或心疼（让人忍不住说“oof”的那种反应）。"},"examples":[{"en":"That was oofier than I expected—everyone heard my phone ring in the meeting.","zh":"这比我想的更尴尬——开会时大家都听到我手机响了。"},{"en":"The second fall looked oofier; he landed on his knee.","zh":"第二次摔得看起来更疼；他跪着落地了。"}]}],"synonyms":["more awkward","more painful","more embarrassing","cringier","rougher"],"phonetic":"/ˈuːfiər/","extraExplanation":["“oof”是英语里的拟声/感叹词，用来表达突然的疼、受挫、尴尬或替别人感到难受。网络语境里很常见，也和游戏圈（例如曾流行的《Roblox》“oof”音效）相关。","“oofier”是把“oof”当作形容词（“oofy”）来用后的比较级，更多见于口语、聊天和弹幕；正式写作中不常用。"]}
{"word":"oofiest","summary":{"en":"“Oofiest” is internet slang meaning “the most awkward/cringe or painfully embarrassing.”","zh":"“oofiest”是网络俚语，意思是“最尴尬／最社死／最让人看了都替人难受的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, internet slang) The most awkward, cringey, or painful-to-watch/experience; causing the strongest “oof” reaction.","zh":"（非正式／网络俚语）最让人尴尬、最“社死”、或最让人看了都替人疼／替人难受的；让人最想发出“oof”的。"},"examples":[{"en":"That was the oofiest moment of the whole meeting—everyone went silent.","zh":"那是整个会议里最尴尬的时刻——所有人都安静了。"},{"en":"I posted the wrong file to the class group chat. Oofiest mistake ever.","zh":"我把错误的文件发到班级群里了。史上最社死的失误。"},{"en":"The video is funny, but the ending is the oofiest part.","zh":"这个视频很好笑，但结尾是最让人替人尴尬的一段。"}]}],"synonyms":["cringiest","most awkward","most embarrassing","most painful (to watch)"],"phonetic":"ˈuːfiəst","extraExplanation":["“oofiest”是形容词“oofy”的最高级，源自感叹词“oof”（表达受撞击、出糗、尴尬、心疼等的反应）。它常见于社交媒体和口语，语气带点夸张和玩笑，正式写作中一般不用。","相关表达：oof（感叹：哎哟/完了/好尬）、that’s an oof（这就很尴尬/很惨）、big oof（更强烈的“oof”反应）、cringey（尬的）、awkward（尴尬的）、painful to watch（看着都难受）。"]}
{"word":"oofless","summary":{"en":"“Oofless” is a rare, informal made-up adjective meaning “without an ‘oof’ reaction,” i.e., showing no pain/embarrassment response.","zh":"“oofless”是较少见的网络自造形容词，意思是“没有‘oof/哎哟’那种反应”，即看起来不疼/不尴尬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Not reacting with an “oof” (a sound people make to show pain, surprise, or embarrassment); showing little or no visible discomfort.","zh":"（非标准/口语）没有发出 “oof”（表示疼痛、惊讶或尴尬的声音）那样的反应；看起来几乎不觉得难受/不尴尬。"},"examples":[{"en":"He fell off the chair and somehow stayed completely oofless.","zh":"他从椅子上摔下来，居然一点“哎哟”的反应都没有。"},{"en":"Her joke was so blunt that the room went oofless—no one knew how to respond.","zh":"她的玩笑太直白了，现场竟然没人“噢/哎哟”一声，大家都不知道怎么接。"}]}],"synonyms":["unreactive","unfazed","stoic"],"phonetic":"/ˈufləs/","extraExplanation":["“oof”是英语里很常见的拟声词/感叹词，用来表达突然的疼痛、受挫、尴尬或意外（类似中文的“哎哟/噢/啊这”）。","“oofless”并不是常见词典词，更像是网络自造词：oof + -less（表示“没有/缺少”）。在正式写作中不推荐使用。","如果你本来想查的是“roofless”（无屋顶的）或“woofless”（不发出狗叫声的，极少用），告诉我上下文句子，我可以帮你确认正确词。"]}
{"word":"ooftish","summary":{"en":"“Ooftish” is an exclamation meaning “oy/oof,” used to express frustration, fatigue, or that something is too much.","zh":"“Ooftish”是一个感叹词，类似“oy/oof/唉呀”，用来表达沮丧、疲惫或“太过分/太麻烦了”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show annoyance, frustration, tiredness, or “that’s a lot!” (similar to “oy!” or “oof!”).","zh":"（感叹词）用于表达恼火、沮丧、疲惫，或“太夸张/太麻烦了！”（类似于“哎呀/唉/啧”或英语里的“oy!”、“oof!”）。"},"examples":[{"en":"Ooftish, this homework is taking forever.","zh":"哎呀，这作业怎么做不完。"},{"en":"Ooftish! That meeting was exhausting.","zh":"唉！那场会议太累人了。"},{"en":"Ooftish—look at the price of these tickets.","zh":"啧——看看这票价也太贵了。"}]}],"synonyms":["oy","oof","ugh","geez"],"phonetic":"ˈʊf.tɪʃ","extraExplanation":["“Ooftish”常被认为来自意第绪语（Yiddish）的感叹用法，在美国英语里多见于犹太裔（尤其是纽约等地）口语或带有犹太文化色彩的表达中。","语气通常是夸张、吐槽式的抱怨，也可以带一点幽默感；在正式写作中不常用，更多出现在对话、戏剧/影视台词或社交媒体里。"]}
{"word":"oofy","summary":{"en":"“Oofy” is informal slang meaning awkward, clumsy, or uncool—often said jokingly.","zh":"“oofy”是非正式俚语，表示尴尬、笨拙或不酷，常带调侃语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang) Awkward, clumsy, or not cool; causing secondhand embarrassment.","zh":"（俚语）尴尬的、笨拙的、不酷的；让人替别人尴尬的。"},"examples":[{"en":"That joke was kind of oofy, but he meant well.","zh":"那个笑话有点尴尬，但他是好意。"},{"en":"I felt oofy walking in late when everyone was quiet.","zh":"大家都很安静的时候我迟到走进来，感觉特别尴尬。"},{"en":"The dance moves were a little oofy, yet everyone cheered.","zh":"舞步有点笨拙，但大家还是在欢呼。"}]}],"synonyms":["awkward","cringey","dorky","clumsy","uncool"],"phonetic":"/ˈuːfi/","extraExplanation":["“oofy”是非常口语、偏网络的说法，常带轻松调侃的语气，比直接说“cringe（尬）/awkward（尴尬）”更随意。","使用场景多见于朋友聊天、社交媒体评论；正式写作或职场沟通中不建议使用。","它有时也会和“Oof”（表示‘哎哟/糟糕了’的感叹词）在语气上关联：一种‘看着就替你难受/尴尬’的感觉。"]}
{"word":"oogamete","summary":{"en":"An oogamete is an immature egg cell (female gamete) that develops into a mature ovum.","zh":"oogamete 指未成熟的卵细胞（雌性配子），会发育成成熟卵（ovum）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An immature egg cell (female gamete) in animals; it develops into an ovum (a mature egg) through a process called oogenesis.","zh":"（动物）卵母细胞：未成熟的雌性生殖细胞（配子），通过卵子发生（oogenesis）发育成成熟卵（ovum）。"},"examples":[{"en":"In humans, an oogamete must mature before it can be fertilized.","zh":"在人类中，卵母细胞必须成熟后才能受精。"},{"en":"The textbook explains how each oogamete undergoes cell division and growth during oogenesis.","zh":"教材解释了每个卵母细胞在卵子发生过程中如何进行细胞分裂与生长。"}]}],"synonyms":["oocyte","egg cell (general)"],"phonetic":"/oʊˈɡæmiːt/","extraExplanation":["词源提示：oo- 来自希腊语，意为“卵”；-gamete 指“配子（生殖细胞）”。因此 oogamete 直观上就是“卵配子/卵细胞”。","学习提示：在日常英语里更常见的是 oocyte（卵母细胞）或 egg cell（卵细胞）。oogamete 属于较偏学术/生物学的用词。","易混词：ovum（成熟卵，单数；复数 ova）通常指可被受精的成熟卵；oocyte/oogamete 则强调“未成熟/发育中的卵细胞”。"]}
{"word":"oogametes","summary":{"en":"Oogametes are egg cells (female gametes), usually large and non-motile, that fuse with male gametes in sexual reproduction.","zh":"Oogametes 指卵细胞（雌性配子），通常较大且不具运动性，在有性生殖中与雄性配子结合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female gamete (egg cell), typically large and non-motile, that can fuse with a male gamete during sexual reproduction (especially in algae and some other organisms).","zh":"雌性配子（卵细胞），通常较大且不具运动性，可在有性生殖中与雄性配子结合（尤见于藻类等生物）。"},"examples":[{"en":"In many algae, oogametes are fertilized by small, swimming male gametes.","zh":"在许多藻类中，卵配子会被较小、能游动的雄性配子受精。"},{"en":"The microscope image shows a round oogamete surrounded by smaller cells.","zh":"显微镜图像显示一个圆形的卵配子，周围有更小的细胞。"}]}],"synonyms":["egg cell","ovum","female gamete"],"phonetic":"/ˌoʊ.oʊˈɡæm.iːt/","extraExplanation":["“oogametes”是复数形式；单数是“oogamete”。词根oo-来自希腊语，意为“卵/蛋”，-gamete意为“配子”。","在“卵配生殖（oogamy）”中，雌性配子通常大而不动，雄性配子较小并常能游动；这与两性配子形态相似的“同配生殖（isogamy）”形成对比。"]}
{"word":"oogamies","summary":{"en":"“Oogamies” is the plural of “oogamy,” a biology term for reproduction where a large egg is fertilized by a small sperm.","zh":"“Oogamies” 是 “oogamy” 的复数，指生物学中的卵配生殖：大而不动的卵与小的精子结合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of sexual reproduction in which a large, non-moving egg (ovum) is fertilized by a much smaller, usually moving sperm","zh":"一种有性生殖方式：较大且不运动的卵（卵细胞）由更小、通常能运动的精子受精"},"examples":[{"en":"Humans reproduce by oogamy: a large egg is fertilized by a small sperm.","zh":"人类的有性生殖属于卵配生殖：一个大卵细胞与一个小精子结合。"},{"en":"In many animals and some algae, reproduction involves oogamy.","zh":"在许多动物以及一些藻类中，繁殖过程涉及卵配生殖。"},{"en":"The textbook compared isogamy, anisogamy, and oogamy.","zh":"课本比较了同配生殖、异配生殖和卵配生殖。"}]}],"synonyms":["anisogamy (broader category)","sexual reproduction (general)"],"phonetic":"/oʊˈɑːɡəmi/","extraExplanation":["你输入的 **oogamies** 通常是名词 **oogamy** 的复数形式（拼写规则：以 -y 结尾，变复数时常改为 **-ies**）。","词源提示：**oo-** 表示“卵/卵细胞”，**-gamy** 表示“婚配/结合”（常见于生物学术语，如 polygamy）。","相关概念（按配子差异程度）：**isogamy**（同配：两个配子大小形态相似）→ **anisogamy**（异配：大小不同）→ **oogamy**（卵配：卵大且不动，精子小且多可动）。"]}
{"word":"oogamous","summary":{"en":"Oogamous means involving reproduction with a large egg and a smaller sperm.","zh":"oogamous 指“卵配的”，即由大的卵与小的精子结合的生殖方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Relating to sexual reproduction in which a large, non‑motile egg is fertilized by a smaller, usually motile sperm (i.e., the gametes are different in size and form).","zh":"（生物）指卵配生殖：由较大、通常不运动的卵细胞与较小、通常会运动的精子结合完成受精（即两种配子在大小和形态上不同）。"},"examples":[{"en":"Most animals, including humans, have oogamous reproduction.","zh":"大多数动物（包括人类）属于卵配生殖。"},{"en":"In many algae, species can be isogamous or oogamous depending on their life cycle.","zh":"在许多藻类中，物种可能在其生活史的不同阶段表现为同配或卵配。"}]}],"synonyms":["anisogamous (broader term)","egg-and-sperm (informal)"],"phonetic":"/oʊˈɑɡəməs/","extraExplanation":["词源：来自 Greek（希腊语）oo-（“卵”）+ -gamous（“婚配/结合”）。在生物学里常用来与 isogamous（同配：两种配子大小形态相似）和 anisogamous（异配：配子大小不同）对比；oogamous 通常被看作 anisogamous 的一种更“极端”形式（卵更大且不动）。","使用场景：该词多见于生物学、进化与植物/藻类学教材或论文中，日常英语里很少使用。写作时常与 reproduction（生殖）、fertilization（受精）、gamete（配子）、egg/sperm（卵/精子）等词搭配。"]}
{"word":"oogamy","summary":{"en":"Oogamy is sexual reproduction where a small sperm fertilizes a large egg.","zh":"Oogamy 指精子与卵子结合的卵配生殖方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of sexual reproduction in which a large, nonmoving egg (female gamete) is fertilized by a smaller, usually moving sperm (male gamete).","zh":"卵配生殖；一种有性生殖方式：由体积较大、通常不运动的卵细胞（雌配子）与体积较小、通常能运动的精子（雄配子）结合完成受精。"},"examples":[{"en":"In humans and most animals, reproduction is oogamous: a sperm fertilizes an egg.","zh":"在人类和大多数动物中，生殖属于卵配生殖：精子与卵子结合完成受精。"},{"en":"Many plants and algae also show oogamy, with a large egg cell and smaller male gametes.","zh":"许多植物和藻类也具有卵配生殖：卵细胞较大，而雄配子更小。"}]}],"synonyms":["egg-and-sperm fertilization","oogamous reproduction"],"phonetic":"/oʊˈɑɡəmi/","extraExplanation":["词源提示：oo- 来自希腊语 *ōion*（“卵”），-gamy 来自 *gamos*（“婚配、结合”），合起来就是“卵的结合”。","对比记忆：\n- *isogamy*（同配生殖）：两种配子大小形态相似。\n- *anisogamy*（异配生殖）：配子大小不同，但不一定有明显“卵/精”分化。\n- *oogamy*（卵配生殖）：异配生殖的一种更典型形式，卵大且通常不动，精子小且常能运动。"]}
{"word":"oogenesis","summary":{"en":"Oogenesis is the biological process of forming and maturing egg cells (ova).","zh":"Oogenesis 指卵子在卵巢中形成并成熟的生物学过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which egg cells (ova) are formed and mature in the ovaries","zh":"卵子发生（卵生成）：在卵巢中形成并成熟为卵细胞（卵子、卵）的过程"},"examples":[{"en":"In humans, oogenesis begins before birth and pauses until puberty.","zh":"在人类中，卵子发生在出生前就开始，并在青春期前暂停。"},{"en":"Scientists study oogenesis to understand fertility and reproductive health.","zh":"科学家研究卵子发生，以了解生育能力和生殖健康。"}]}],"synonyms":["egg formation","ovum formation","female gamete formation"],"phonetic":"/ˌoʊ.oʊˈdʒɛn.ə.sɪs/","extraExplanation":["“oogenesis”常见于生物学与医学语境，尤其是发育生物学、妇产科与生殖医学。","与“spermatogenesis（精子发生）”对比理解更清楚：卵子发生通常伴随较长的停滞期（如初级卵母细胞的停滞），而精子发生在青春期后更为持续。","词源：oo-（卵）+ -genesis（生成、起源），字面意思就是“卵的生成”。"]}
{"word":"oogenetic","summary":{"en":"Oogenetic means “related to the development and formation of egg cells (oogenesis).”","zh":"oogenetic 指“与卵细胞（卵子）的形成与发育（卵子发生）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the formation and development of egg cells (ova); connected with oogenesis.","zh":"与卵细胞（卵子）的形成与发育有关的；与卵子发生（oogenesis）相关的。"},"examples":[{"en":"Scientists studied oogenetic processes in the ovary to understand fertility.","zh":"科学家研究卵巢中的卵子发生过程，以理解生育能力。"},{"en":"The paper describes several oogenetic stages from early cell growth to maturation.","zh":"这篇论文描述了从早期细胞生长到成熟的多个卵子发生阶段。"}]}],"synonyms":["oogenic","oogenetic (variant scientific usage)","related to oogenesis"],"phonetic":"/ˌoʊ.ə.dʒəˈnɛtɪk/","extraExplanation":["“oogenetic”是生物学/医学写作中较少见的形容词，更常见的相关词是“oogenesis（卵子发生）”“oogenetic/ oogenic（卵源性的、与卵形成有关的）”“oogonia（卵原细胞）”。不同教材或论文可能偏好不同词形。","词根提示：oo- 表示“卵/卵子”，-gen- 表示“产生/生成”，-etic 表示“……的/与……有关的”。理解词根有助于猜测学术词义。"]}
{"word":"oogenies","summary":{"en":"“Oogenies” means early egg-forming germ cells in the ovary (a less common plural; “oogonia” is standard).","zh":"“oogenies” 指卵巢中早期形成卵细胞的生殖细胞（较少见的复数形式；标准用法多为 “oogonia”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of oogony: very early egg-forming germ cells in the ovary (often called oogonia/oogonium in modern biology).","zh":"oogony 的复数：卵巢中非常早期、将来会形成卵细胞的生殖细胞（现代生物学更常用 oogonia/oogonium）。"},"examples":[{"en":"In fetal development, many oogonies divide quickly before becoming primary oocytes.","zh":"在胎儿发育阶段，许多 oogonies 会快速分裂，之后转变为初级卵母细胞。"},{"en":"The textbook uses “oogonia” more often than “oogonies.”","zh":"这本教材用 “oogonia” 比用 “oogonies” 更常见。"}]}],"synonyms":["oogonia","oogonium","germ cells"],"phonetic":"/ˌoʊ.oʊˈɡoʊniəz/","extraExplanation":["“oogenies” 在英语里比较少见，学术写作中更标准、更常见的是 **oogonium**（单数）和 **oogonia**（复数）。","词根来自希腊语：**oo-** 表示“卵/蛋”，**-gen-** 表示“产生”。注意区分：**oogonia/oogonium** 指“细胞本身（早期卵原细胞）”，而 **oogenesis** 指“形成卵细胞的整个过程”。"]}
{"word":"oogeny","summary":{"en":"Oogeny means the process of forming and developing egg cells (ova).","zh":"Oogeny 指卵细胞（卵子）的形成与发育过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation and development of egg cells (ova) in females; female gamete development (a less common term, similar to “oogenesis”).","zh":"卵细胞（卵子）的形成与发育；雌性配子发育（较少用的术语，含义接近 oogenesis「卵子发生」）。"},"examples":[{"en":"In many animals, oogeny begins long before sexual maturity.","zh":"在许多动物中，卵子发生（oogeny）在性成熟之前很早就开始了。"},{"en":"The textbook compares spermatogeny and oogeny to show how male and female gametes develop differently.","zh":"教材比较精子发生（spermatogeny）与卵子发生（oogeny），说明雄、雌配子的发育差异。"}]}],"synonyms":["oogenesis","female gametogenesis"],"phonetic":"/oʊˈɑːdʒəni/","extraExplanation":["“oogeny”在现代英语生物学写作中相对少见，更常见的是“oogenesis（卵子发生）”。如果你在论文或报告中写作，通常用“oogenesis”会更标准、更容易被读者理解。","注意不要和“oogony / oogonium（卵原细胞）”混淆：oogony 指的是早期的细胞类型，而 oogeny / oogenesis 指的是整个形成与发育过程。"]}
{"word":"ooglea","summary":{"en":"“Ogle” means to stare at someone in a rude way, often with sexual interest.","zh":"“ogle”指以无礼、常带性意味的方式盯着别人看。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to stare at someone in a way that shows strong (often sexual) interest, and can feel rude or uncomfortable","zh":"（常带性意味地）盯着看；色眯眯地看（通常显得无礼或令人不舒服）"},"examples":[{"en":"He was ogling her the whole time, which made her uncomfortable.","zh":"他一直盯着她看，让她很不舒服。"},{"en":"Don’t ogle people on the subway—it's rude.","zh":"别在地铁上盯着别人看——很不礼貌。"}]},{"partOfSpeech":"n.","definition":{"en":"a long, rude stare that shows strong interest (often sexual)","zh":"（常带性意味的）盯视；色眯眯的打量"},"examples":[{"en":"She noticed his ogle and moved away.","zh":"她注意到他那种打量的目光，就走开了。"}]}],"synonyms":["stare","gawk","leer"],"phonetic":"/ˈoʊɡəl/","extraExplanation":["你输入的“ooglea”不是常见英文单词，可能是拼写误差。最接近的常用词是“ogle”（盯着看/色眯眯地看）。如果你想查的是“Google”（谷歌）或别的词，请告诉我正确拼写，我可以再解释。"]}
{"word":"oogloea","summary":{"en":"“oogloea” isn’t a recognized English word; it likely needs context or corrected spelling.","zh":"“oogloea”不是常见英语词；需要上下文或确认正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, a made-up word, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、杜撰词，或来自其他语言的词。"},"examples":[{"en":"I can’t find “oogloea” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“oogloea”——你能提供它出现的句子吗？"},{"en":"If you meant “Google,” the spelling is different.","zh":"如果你想写的是“Google”，拼写会不一样。"}]}],"extraExplanation":["“oogloea”在常见英语词典中没有收录。我需要更多信息才能准确解释：1）你在哪里看到它（网页/游戏/书/聊天）？2）它前后句是什么？3）你想表达的意思或可能的正确拼写是什么（例如是否想写Google、ogle、aole等）？"]}
{"word":"oogone","summary":{"en":"“oogone” is not a standard English word; it’s likely a typo or a name/username.","zh":"“oogone”不是标准英语词；更可能是拼写错误或专有名词/网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up word (e.g., a username, brand name, or typing error).","zh":"不是标准英语单词。更可能是拼写错误或自造词（例如用户名、品牌名或打字失误）。"},"examples":[{"en":"I couldn’t find “oogone” in a dictionary—did you mean “gone”?","zh":"我在词典里找不到“oogone”——你是不是想写“gone”？"},{"en":"“Oogone” looks like a username rather than an English vocabulary word.","zh":"“Oogone”看起来更像用户名，而不是英语词汇。"}]}],"phonetic":"/ˈuːɡoʊn/","extraExplanation":["“oogone”在常见英语词典中没有收录，因此我无法像普通单词那样给出标准释义。","它最常见的情况可能是：\n1) 把“gone”（gone /ɡɔn/，表示“走了/离开了/不见了”）打错；\n2) 想输入某个专有名词（人名、网名、品牌等）；\n3) 来自某个小众作品/游戏/社区的自造词。","如果你告诉我它出现的句子或你想表达的意思（例如“我想说他已经走了”），我可以帮你确认你要找的正确单词，并给出标准用法。"]}
{"word":"oogonia","summary":{"en":"Oogonia are female reproductive structures in some algae and fungi that produce egg cells (plural of oogonium).","zh":"Oogonia 指某些藻类和真菌中产生卵细胞的雌性生殖结构，是 oogonium 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of oogonium; female reproductive structures (in some algae and fungi) that produce egg cells.","zh":"oogonium 的复数；（某些藻类与真菌中的）雌性生殖结构，用来产生卵细胞。"},"examples":[{"en":"Under the microscope, the researchers counted the number of oogonia in each sample.","zh":"在显微镜下，研究人员统计了每个样本中 oogonia 的数量。"},{"en":"In some algae, oogonia form during the reproductive season and later release egg cells.","zh":"在某些藻类中，oogonia 会在繁殖季形成，随后释放卵细胞。"}]}],"synonyms":["oogonium (singular form)","female gametangia (broader term)"],"phonetic":"/oʊˈɡoʊniə/","extraExplanation":["这是一个生物学术语，常见于植物学、藻类学与真菌学的教材或论文中。更常用的单数形式是 oogonium（一个雌性配子囊/卵器），复数才写作 oogonia。","词源来自希腊语：oo- 表示“卵”，-gon- 与“生殖/产生”相关，-ia 常用于表示事物或结构的复数形式（拉丁/希腊化学术语中常见）。"]}
{"word":"oogonial","summary":{"en":"Oogonial means “related to an oogonium,” a structure that produces egg cells in certain organisms.","zh":"oogonial 表示“与卵器有关的”，卵器是在某些生物中产生卵细胞的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an oogonium (a female reproductive cell or structure that produces egg cells), especially in algae, fungi, and some lower plants.","zh":"与卵器（产生卵细胞的雌性生殖细胞或结构）有关的；尤用于藻类、真菌及一些低等植物的语境。"},"examples":[{"en":"Scientists compared oogonial development in several species of algae.","zh":"科学家比较了几种藻类的卵器发育过程。"},{"en":"The paper describes oogonial cells forming before fertilization.","zh":"论文描述了受精前卵器细胞的形成。"}]}],"synonyms":["oogonial (related to oogonium)","female-gametangial (context-dependent)"],"phonetic":"/ˌoʊəˈɡoʊniəl/","extraExplanation":["“oogonial”来自“oogonium”（卵器），词根“oo-”与“egg（卵）”有关，“-gon-”与“reproduction/seed（生殖/产生）”有关，“-ial”表示“……的/与……相关的”。","这个词主要出现在生物学与组织学的学术写作中；日常英语里更常见的是名词“oogonium（卵器）”或更通用的“egg cell（卵细胞）”。"]}
{"word":"oogoninia","summary":{"en":"Oogonia are the female reproductive structures/cells in certain organisms that produce egg cells.","zh":"Oogonia 指某些生物中产生卵细胞的雌性生殖结构/细胞（卵器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) female reproductive cells in some algae, fungi, and other organisms that develop into egg cells (oospheres).","zh":"（复数）卵器：某些藻类、真菌等生物中的雌性生殖结构/细胞，能发育形成卵细胞（卵球）。"},"examples":[{"en":"In many water molds, oogonia form during sexual reproduction.","zh":"在许多水霉中，有性生殖时会形成卵器（oogonia）。"},{"en":"Under the microscope, the student identified round oogonia in the culture.","zh":"在显微镜下，学生在培养物中辨认出了圆形的卵器（oogonia）。"}]}],"synonyms":["oogonium (singular form)","female gametangia (broader term)"],"phonetic":"/oʊˈɡoʊniə/","extraExplanation":["“oogoninia”更常见的标准拼写是 **oogonia**（oogonium 的复数）。你输入的形式可能是拼写误差或较少见的变体。","词根提示：**oo-** 表示“卵/蛋”，**-gon-** 与“生殖/产生”有关，**-ium** 常见于生物学结构名称。","相关术语区分：**oogonium（单数）/ oogonia（复数）**指“产生卵细胞的结构”，而 **oosphere** 更强调“形成的卵细胞本身”。"]}
{"word":"oogoniophore","summary":{"en":"An oogoniophore is a structure (often a stalk-like hypha) that bears an oogonium in certain organisms such as oomycetes.","zh":"oogoniophore 指在某些生物（如卵菌）中承载卵器（oogonium）的柄状结构/菌丝分枝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialized stalk or hyphal branch that bears (supports) an oogonium in some algae and fungus-like organisms (especially oomycetes).","zh":"（尤指卵菌等）在某些藻类或类真菌生物中，用来着生/支撑卵器（oogonium）的特化柄状结构或菌丝分枝。"},"examples":[{"en":"Under the microscope, the oogoniophore can be seen supporting a round oogonium.","zh":"在显微镜下，可以看到卵器柄支撑着一个圆形的卵器。"},{"en":"In some oomycetes, the oogoniophore develops before the oogonium forms.","zh":"在一些卵菌中，卵器柄会先发育，随后才形成卵器。"}]}],"synonyms":["oogonium-bearing hypha","oogonium stalk"],"phonetic":"/oʊˌɑːɡəniəˌfɔːr/","extraExplanation":["词源上可拆为 oo-（与“卵/egg”相关）+ -gonio-（与“生殖细胞/性器官”相关）+ -phore（“携带、承载”的意思，常见于 *spore-bearer* 等概念）。因此整体就是“承载卵器的结构”。","这是生物学/真菌学（含卵菌学）里的专业术语，日常英语中几乎不会出现；常见于显微观察描述或分类鉴定文本。"]}
{"word":"oogonium","summary":{"en":"An oogonium is a female reproductive structure in some algae and fungi that produces egg cells.","zh":"oogonium 指某些藻类和真菌产生卵细胞的雌性生殖结构（藏卵器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female reproductive structure in certain algae and fungi that produces egg cells (oospheres).","zh":"（某些藻类和真菌的）雌性生殖器官，用来产生卵细胞（卵球/卵孢）。"},"examples":[{"en":"In some algae, the oogonium develops eggs that are later fertilized by sperm cells.","zh":"在一些藻类中，藏卵器会形成卵细胞，之后再与精细胞受精。"},{"en":"Under the microscope, the student labeled the round structure as an oogonium.","zh":"在显微镜下，学生把那个圆形结构标注为藏卵器。"},{"en":"The fungus forms an oogonium during sexual reproduction.","zh":"这种真菌在有性生殖过程中会形成藏卵器。"}]}],"synonyms":["female gametangium"],"phonetic":"/oʊˈɡoʊniəm/","extraExplanation":["词源上，oogonium 来自希腊语 oo-（“卵”）+ -gonium（“生殖器官/产生的结构”）。常见于生物学与植物学教材，尤其讨论藻类与卵菌类（如水霉）等的有性生殖时。","相关术语：oosphere（卵球/卵细胞）、antheridium（雄器）、oogamy（卵配生殖：大而不动的卵与小而可动的精子结合）。"]}
{"word":"oogoniums","summary":{"en":"Oogoniums are female reproductive structures that produce egg cells in certain algae and fungi-like organisms.","zh":"Oogoniums 指某些藻类及类似真菌生物中的雌性生殖结构，可产生卵细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) The plural of oogonium: a female reproductive structure (a cell or sac) that produces one or more egg cells (oospheres), especially in some algae, fungi, and water molds.","zh":"（生物）oogonium 的复数：雌性生殖结构（细胞或囊状体），可产生一个或多个卵细胞（卵球），常见于某些藻类、真菌和水霉等。"},"examples":[{"en":"In lab, we observed oogoniums forming along the filament under the microscope.","zh":"在实验课上，我们在显微镜下观察到丝状体上形成了多个 oogoniums（卵器）。"},{"en":"Some water molds produce oogoniums that later develop into thick-walled resting spores.","zh":"一些水霉会形成 oogoniums，之后发育成壁厚的休眠孢子。"}]}],"synonyms":["oogonia (less common plural)","female gametangia (broader term)"],"phonetic":"/ˌoʊəˈɡoʊniəmz/","extraExplanation":["词源上，oo- 与“卵/蛋”有关（如 oocyte 卵母细胞），-gonium 与“生殖/产生”相关，因此 oogonium 字面含义接近“产卵的生殖结构”。","在很多教材里，oogonium（卵器）常与 antheridium（雄器）一起出现，用来描述某些藻类、真菌或卵菌（如水霉）进行有性生殖时的雌雄结构。"]}
{"word":"oograph","summary":{"en":"A rare word meaning someone who studies or writes about eggs, especially birds’ eggs.","zh":"一个罕见词，指研究或撰写有关蛋（尤指鸟蛋）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who describes, studies, or writes about eggs (especially birds’ eggs); an oologist (rare).","zh":"（罕用）研究、描写或撰写有关蛋（尤指鸟蛋）的人；鸟卵学者。"},"examples":[{"en":"In the 19th century, some naturalists called themselves oographs because they cataloged birds’ eggs.","zh":"在19世纪，一些博物学家会自称为 oograph，因为他们会编目记录鸟蛋。"},{"en":"The museum label mentions an oograph who documented egg colors and sizes.","zh":"博物馆的标签提到一位 oograph 记录了蛋的颜色与大小。"}]}],"synonyms":["oologist","egg collector","naturalist"],"phonetic":"/ˈoʊ.əˌɡræf/","extraExplanation":["词源提示：oo- 来自希腊语 ōion（“蛋”），-graph 来自 graphō（“写、记录”）。因此 oograph 字面意思是“记录蛋的人/事物”。在现代英语中更常见的相关词是 oology（鸟卵学）和 oologist（鸟卵学者），而 oograph 非常少见，多见于较旧的自然史文献。"]}
{"word":"oogruk","summary":{"en":"Oogruk means a bearded seal, an Arctic seal, especially in Alaska Native contexts.","zh":"oogruk 指髯海豹（北极海豹的一种），多见于阿拉斯加原住民相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bearded seal (an Arctic seal with long whiskers), especially as referred to in Inuit/Yupik contexts in Alaska.","zh":"髯海豹（生活在北极地区、胡须很长的一种海豹），尤其常见于阿拉斯加因纽特/尤皮克语境中的称呼。"},"examples":[{"en":"The hunters brought back an oogruk from the spring ice.","zh":"猎人们在春季海冰上带回了一只髯海豹。"},{"en":"Oogruk skin is traditionally used for strong, water-resistant coverings.","zh":"髯海豹皮在传统上被用来制作结实且防水的覆盖物/用品。"}]}],"synonyms":["bearded seal","ugruk"],"phonetic":"/ˈuːɡrʊk/","extraExplanation":["“oogruk”常见于阿拉斯加英语（Alaska English）与原住民文化相关语境，指髯海豹（bearded seal）。在书面英语里更常用的通用词是“bearded seal”。","这个词也常见拼写变体：ugruk、oogrook 等，来源与因纽特—尤皮克语族相关的借词。不同社区/资料的拼写可能不同。"]}
{"word":"ooh","summary":{"en":"“Ooh” is an interjection used to show strong feelings (surprise, admiration, pleasure, sympathy, or pain), and it can also be playful or teasing.","zh":"“ooh”是感叹词，用来表达强烈情绪（惊讶、赞叹、愉快、同情或疼痛），也可带调侃或起哄的语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show strong emotion such as surprise, admiration, pleasure, sympathy, or pain.","zh":"（感叹词）用来表达强烈情绪，如惊讶、赞叹、愉快、同情或疼痛。"},"examples":[{"en":"Ooh, that cake smells amazing!","zh":"哦，那蛋糕闻起来太香了！"},{"en":"Ooh! I didn’t expect to see you here.","zh":"哦！我没想到会在这里见到你。"},{"en":"Ooh, that must have hurt—are you okay?","zh":"哦，那一定很疼——你还好吗？"}]},{"partOfSpeech":"int.","definition":{"en":"Used to react playfully or teasingly, often to a romantic or “interesting” situation.","zh":"（感叹词）常带调侃或起哄意味，用来对暧昧或“有意思”的情况做反应。"},"examples":[{"en":"Ooh, someone has a crush!","zh":"哦哟，有人暗恋呢！"},{"en":"Ooh, tell me more—what happened next?","zh":"哦哟，多说点——后来呢？"}]}],"synonyms":["oh","wow","ah","ow"],"phonetic":"/uː/","extraExplanation":["“ooh”多用于口语、聊天和网络表达；在写作里常用来表现人物的即时反应（类似拟声/情绪表达）。","拼写有时会拉长来加强情绪：oooh / oooooh（越长通常表示情绪越强）。","和“oh”相比，“ooh”更常带“被吸引/被惊艳/觉得有趣”的感觉；“ow”更专门表示疼痛。"]}
{"word":"oohed","summary":{"en":"“Oohed” means someone said “ooh!” to show strong feeling—usually admiration or surprise.","zh":"“oohed”表示某人发出“ooh！”的感叹声，通常表达赞叹或惊讶等强烈情绪。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “ooh”: to make a long sound (“ooh!”) to show admiration, surprise, pleasure, or sometimes disappointment.","zh":"“ooh”的过去式和过去分词：发出拖长的“哦/呜（ooh）！”的声音，用来表达赞叹、惊讶、愉悦，有时也可表示失望或惋惜。"},"examples":[{"en":"Everyone oohed when the fireworks began.","zh":"烟花一开始，大家都发出“ooh”的惊叹声。"},{"en":"She oohed over the baby’s tiny shoes.","zh":"她看到宝宝的小鞋子时忍不住“ooh”地赞叹。"},{"en":"He oohed in disappointment when the cake fell apart.","zh":"蛋糕散架时，他失望地“ooh”了一声。"}]}],"synonyms":["exclaimed","gasped","marveled"],"phonetic":"/uːd/","extraExplanation":["“ooh”是拟声词（模仿声音的词），常用于口语、对话描写和文学叙述中来表现人物的即时反应。","拼写上常见现在分词“oohing”、名词用法“an ooh (and aah)”；常与“aah”并列，表示人群一起发出赞叹声（如“oohs and aahs”）。"]}
{"word":"oohing","summary":{"en":"“Oohing” means making an “ooh” sound to show surprise or admiration, or the act of doing this (often “oohing and aahing”).","zh":"“oohing”指发出“ooh（哦/呜）”的惊叹声来表达惊讶或赞叹，也可指这种惊叹的行为（常见搭配为“oohing and aahing”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making a long “ooh” sound to show surprise, admiration, pleasure, or sympathy","zh":"发出拖长的“哦/呜（ooh）”声，用来表示惊讶、赞叹、愉快或同情"},"examples":[{"en":"The crowd started oohing when the fireworks lit up the sky.","zh":"烟花点亮天空时，人群开始发出“哦——”的惊叹声。"},{"en":"Everyone was oohing over the baby’s tiny shoes.","zh":"大家都对宝宝的小鞋子发出赞叹的“哦——”声。"},{"en":"She was oohing in pain as the nurse cleaned the cut.","zh":"护士清理伤口时，她疼得“哦——哦——”直叫。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making impressed or excited sounds, often in the phrase “oohing and aahing”","zh":"（常用于短语“oohing and aahing”）指发出惊叹声的行为，表示被震撼或兴奋"},"examples":[{"en":"There was a lot of oohing and aahing during the magic show.","zh":"魔术表演过程中，观众一直“哦——哇——”地惊叹。"},{"en":"The new design got plenty of oohing from the audience.","zh":"这个新设计引来观众不少惊叹声。"}]}],"synonyms":["gasping","exclaiming","marveling","expressing admiration"],"phonetic":"/ˈuːɪŋ/","extraExplanation":["“ooh”是拟声词（模仿声音），口语里很常见；写作中常用来表现现场反应或情绪。","“oohing and aahing”是固定搭配，意思是“连连惊叹/啧啧称奇”，常用于看烟花、魔术、豪车、豪宅、婴儿等场景。"]}
{"word":"oohs","summary":{"en":"“Oohs” usually means repeated “ooh” sounds showing surprise or admiration; it can also mean “he/she oohs” (says ‘ooh’).","zh":"“oohs”通常指一阵阵表示惊讶或赞叹的“哇哦”声；也可作动词，表示“他/她发出 ooh 的声音”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sound people make to show surprise, admiration, or interest (plural of “ooh”)","zh":"表示惊讶、赞叹或兴趣时发出的“哦/哇”声（“ooh”的复数）"},"examples":[{"en":"The fireworks got lots of oohs from the crowd.","zh":"烟花让人群发出一阵阵“哇哦”的赞叹声。"},{"en":"When she walked in, there were oohs and aahs.","zh":"她一走进来，大家就发出“哇哦”和“啊”的惊叹声。"}]},{"partOfSpeech":"v.","definition":{"en":"says “ooh” (third-person singular form of the verb “to ooh”), often to show surprise or admiration","zh":"发出“ooh”的声音（动词 to ooh 的第三人称单数形式），常用来表示惊讶或赞叹"},"examples":[{"en":"He always oohs when he sees a fancy car.","zh":"他一看到豪车就总会“哇哦”一声。"}]}],"synonyms":["exclamations","gasps","expressions of admiration","oohs and aahs"],"phonetic":"/uː/","extraExplanation":["“oohs”在口语和非正式写作里很常见，用来描述观众/人群的反应声；也常和“aahs”搭配成固定说法“oohs and aahs”，表示“连连惊叹/赞叹声不断”。","拼写上结尾加 -s 既可以表示名词复数（many oohs），也可能是动词第三人称单数（he/she oohs）。要根据句子结构判断。"]}
{"word":"ooid","summary":{"en":"An ooid is a tiny, round mineral grain formed in shallow, agitated water, often made of calcium carbonate.","zh":"ooid 指在浅海等搅动环境中形成的微小圆形矿物颗粒，常由碳酸钙组成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, rounded grain (usually of calcium carbonate) formed in shallow, warm, agitated water as mineral layers build up around a tiny ядро (nucleus), such as a sand grain or shell fragment.","zh":"鲕粒（常为碳酸钙）：在浅海温暖、波浪搅动的环境中，矿物质一层层包裹在微小“核”（如砂粒或贝壳碎片）外形成的圆形小颗粒。"},"examples":[{"en":"The limestone sample contains many ooids, suggesting it formed in shallow marine water.","zh":"这块石灰岩样品含有大量鲕粒，说明它可能形成于浅海环境。"},{"en":"Under the microscope, each ooid shows concentric layers around a tiny core.","zh":"在显微镜下，每一颗鲕粒都能看到围绕微小核心的同心层。"}]}],"synonyms":["oolite (related term)","oolitic grain","carbonate grain"],"phonetic":"/ˈoʊɔɪd/","extraExplanation":["“ooid”常见于地质学与沉积学；由大量鲕粒组成的岩石常称为“oolitic limestone（鲕状石灰岩）”。","词源与“egg（卵）”有关（外形像小鱼卵）；在强水流/浪涌环境中不断滚动，有利于外层一圈圈沉积，形成同心结构。"]}
{"word":"ooidal","summary":{"en":"Ooidal means “related to ooids” or “having tiny round grains like ooids,” especially in geology.","zh":"ooidal 指“与鲕粒有关的/呈鲕状的”，常用于地质学描述含有细小圆形鲕粒的沉积物或岩石。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made of ooids (small, rounded grains—often calcium carbonate—formed in shallow, moving water).","zh":"与鲕粒有关的；由鲕粒构成的（鲕粒是常见于浅海、受水流搅动环境中形成的细小圆形颗粒，多为碳酸钙）。"},"examples":[{"en":"The limestone here is ooidal, formed in a warm, shallow sea.","zh":"这里的石灰岩是鲕状的，形成于温暖的浅海环境。"},{"en":"Geologists studied the ooidal sand to learn about past ocean conditions.","zh":"地质学家研究鲕粒砂，以了解古海洋环境。"}]}],"synonyms":["oolitic","ooid-bearing"],"phonetic":"/ˈɔɪdəl/","extraExplanation":["“ooidal”来自“ooid（鲕粒）”。鲕粒通常像小鱼卵一样圆，常在浅海高能环境（波浪或潮流不断滚动颗粒）中，矿物质一层层沉积包裹而成。","常见相关词：ooid（鲕粒）、oolite（鲕粒岩/鲕状石灰岩）、ooidal limestone（鲕状石灰岩）。在地质描述里，“ooidal”常用来说明岩石或沉积物的颗粒结构与成因环境。"]}
{"word":"ookala","summary":{"en":"“ookala” is not a standard English word; it most commonly refers to the place name **Ocala** (Florida) as a misspelling.","zh":"“ookala”不是标准英语词；最常见情况是把佛罗里达地名 **Ocala** 误拼成了“ookala”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a common English vocabulary word). Most often it refers to **Ocala**, a city in north-central Florida, USA (sometimes misspelled as “ookala”).","zh":"专有名词（不是常见英语词汇）。最常见的是指美国佛罗里达州中北部的城市 **Ocala**（有时会被拼写成“ookala”）。"},"examples":[{"en":"We stopped in **Ocala** on our road trip through Florida.","zh":"我们在穿越佛罗里达的公路旅行中在 **Ocala** 停留了一下。"},{"en":"**Ocala** is known for horse farms and nearby natural springs.","zh":"**Ocala** 以马场以及附近的天然泉水而闻名。"}]}],"phonetic":"/oʊˈkælə/","extraExplanation":["“ookala”本身不是标准英语单词，更像是对 **Ocala** 的误拼。Ocala 是佛罗里达州的城市名，常见读音是 /oʊˈkælə/（重音在第二音节）。","如果你指的是别的词或某个品牌/人名/地名，请告诉我更多上下文（在哪看到的、完整句子），我可以帮你确认含义与用法。"]}
{"word":"ookinesis","summary":{"en":"Ookinesis is a scientific term for the formation and/or movement of an ookinete, especially in the malaria parasite life cycle inside a mosquito.","zh":"Ookinesis 是科学术语，指动合子（ookinete）的形成及／或运动，尤其用于描述疟原虫在蚊子体内生命周期中的相关过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology, parasitology) The formation and/or movement of an ookinete (the motile zygote stage of some protozoan parasites, especially malaria parasites) in the insect host.","zh":"（生物学／寄生虫学）指“动合子（ookinete）”的形成及／或运动；动合子是某些原虫寄生虫（尤其疟原虫）在昆虫宿主体内的可运动合子阶段。"},"examples":[{"en":"Scientists studied ookinesis to understand how malaria parasites cross the mosquito gut wall.","zh":"科学家研究动合子运动（ookinesis），以了解疟原虫如何穿过蚊子肠壁。"},{"en":"A drug that blocks ookinesis could reduce malaria transmission.","zh":"如果某种药物能阻断动合子运动（ookinesis），就可能降低疟疾传播。"}]}],"synonyms":["ookinete formation","ookinete motility"],"phonetic":"/ˌoʊ.oʊ.kəˈniː.sɪs/","extraExplanation":["“ookinesis”由“oo-（与卵／卵细胞有关的前缀）+ kinesis（运动）”构成，常见于疟疾研究语境。疟原虫在蚊子体内受精后形成合子，发育成具有运动能力的动合子（ookinete），需要移动并穿过蚊子中肠壁，之后才能继续发育并最终传播给人类。"]}
{"word":"ookinete","summary":{"en":"An ookinete is a moving zygote stage of malaria parasites in a mosquito that later forms an oocyst.","zh":"ookinete 指疟原虫等在蚊子体内的可运动受精阶段（动合子体），之后会形成卵囊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A motile (moving) zygote stage in certain protozoan parasites (especially malaria parasites) that develops in a mosquito’s gut and later forms an oocyst.","zh":"（尤指疟原虫等）某些原生动物寄生虫的“动合子/动合子体”阶段：受精后形成、能运动，在蚊子肠道中发育，随后形成卵囊（oocyst）。"},"examples":[{"en":"After fertilization in the mosquito, the parasite becomes an ookinete and moves through the gut wall.","zh":"在蚊体内完成受精后，寄生虫会变成动合子体（ookinete），并穿过蚊子的肠壁。"},{"en":"Blocking ookinete development can reduce malaria transmission.","zh":"阻断动合子体（ookinete）的发育可以降低疟疾传播。"}]}],"synonyms":["motile zygote","vermiform zygote"],"phonetic":"/uˈkɪnɪt/","extraExplanation":["这是寄生虫学/昆虫媒介生物学里的术语，最常见于“疟疾生活史”：人/动物体内的配子被蚊子吸入后在蚊子中肠受精，形成动合子（zygote），随后变成能运动的 ookinete，穿过肠壁后在外侧形成 oocyst，最终产生 sporozoites（子孢子）并迁移到蚊子唾液腺。","词源可拆解理解：-kine- 与“运动”相关（同源于 kino-/kinesis），ookinete 指“能运动的受精产物阶段”。"]}
{"word":"ookinetic","summary":{"en":"A rare adjective used in vision/medical contexts for “related to eye movement,” often meaning “optokinetic.”","zh":"一个罕见形容词，多用于视觉/医学语境，表示“与眼球运动有关”，常指“视动（optokinetic）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, medical/vision science) relating to eye movement, especially eye movements triggered by viewing moving visual patterns (often used as a shortened form of “optokinetic”).","zh":"（罕见，医学/视觉科学）与眼球运动有关的，尤指观看移动的视觉图案时引发的眼动（常作为“optokinetic”的简写用法）。"},"examples":[{"en":"The clinician observed an okinetic response when the striped drum began to rotate.","zh":"当条纹滚筒开始旋转时，临床医生观察到了与视动相关的眼动反应。"},{"en":"Okinectic testing can help evaluate certain visual and neurological functions.","zh":"视动相关的检测有助于评估某些视觉与神经功能。"}]}],"synonyms":["optokinetic","oculomotor","oculokinetic"],"phonetic":"/ˌɑkəˈnɛtɪk/","extraExplanation":["“okinetic”在一般英语中非常少见，更常见、也更标准的术语是“optokinetic”（视动的/视动反射的），例如：optokinetic nystagmus（视动性眼震）。如果你是在论文、检查报告或神经眼科资料里看到“okinetic”，它很可能是作者的简写、排版省略，或与“oculokinetic（眼动的）”混用。建议根据上下文确认原本想表达的是哪一个标准词。"]}
{"word":"ooks","summary":{"en":"“ooks” is usually a typo or incomplete form; likely intended: “looks,” “books,” or “hooks.”","zh":"“ooks”多半是拼写错误或漏写开头字母；常见想写的是“looks / books / hooks”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in most contexts; it is usually a typo or incomplete form of a more common word such as “looks,” “books,” or “hooks.”","zh":"在大多数语境中并不是标准英语单词；通常是拼写错误或未写完整，常见目标词可能是“looks（看起来）”“books（书）”或“hooks（钩子/挂钩）”。"},"examples":[{"en":"If you meant “looks,” write: “It looks good,” not “It ooks good.”","zh":"如果你想表达“looks”，应写：“It looks good”，而不是“It ooks good”。"},{"en":"If you meant “books,” write: “These books are new,” not “These ooks are new.”","zh":"如果你想表达“books”，应写：“These books are new”，而不是“These ooks are new”。"}]}],"phonetic":"/ʊks/","extraExplanation":["“ooks”本身在常用英语词典里一般查不到独立词条。它很像把单词开头的字母漏掉了（例如把 looks/ books/ hooks 的首字母 l/b/h 漏写）。如果你能提供一句完整句子，我可以更准确判断你想表达的词和用法。"]}
{"word":"oolachan","summary":{"en":"Oolachan is a small, very oily Pacific fish (eulachon/candlefish) important in northwest coastal culture and food.","zh":"Oolachan 指一种高含油的小型太平洋鱼（eulachon／candlefish），在北美西北沿岸饮食与文化中很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Pacific salmon-like fish (also called eulachon or candlefish) found along the northwest coast of North America, especially valued by Indigenous peoples for its rich oil.","zh":"一种生活在北美西北太平洋沿岸的小型鲑科近缘鱼（亦称 eulachon／candlefish，常译“蜡烛鱼”），因含油量高而珍贵。"},"examples":[{"en":"The oolachan returns to coastal rivers in spring to spawn.","zh":"蜡烛鱼会在春季回到沿海河流产卵。"},{"en":"Indigenous communities traditionally rendered oolachan into oil for cooking and trade.","zh":"一些原住民社群传统上会把蜡烛鱼熬成鱼油，用于烹饪和交换。"}]}],"synonyms":["eulachon","candlefish"],"phonetic":"/ˈuːləˌkɑːn/","extraExplanation":["“oolachan”一词常见于加拿大卑诗省与阿拉斯加一带的历史与民族志材料中，指春季洄游的高脂鱼类。其油脂常被称为“oolachan grease”（蜡烛鱼油），在太平洋西北沿岸原住民的饮食、仪式与贸易网络中具有重要地位。","也常拼作“eulachon”（更常见的拼法）或俗称“candlefish”，据说因为鱼体含油量高，过去有人会把晾干的整鱼点燃当作临时照明来源。"]}
{"word":"oolachans","summary":{"en":"Oolachans are small, very oily Pacific smelt (eulachon), valued as food and for their oil.","zh":"oolachans 指太平洋沿岸一种富含油脂的小型胡瓜鱼（eulachon），可食用并常用于炼油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small oily fish of the smelt family (also spelled eulachon), found on the Pacific coast of North America; traditionally harvested for food and for its rich oil.","zh":"（也拼作 eulachon）一种北美太平洋沿岸的小型多脂胡瓜鱼科鱼类；传统上被捕捞作食物，并可炼取富含油脂的鱼油。"},"examples":[{"en":"Oolachans return to rivers in early spring to spawn.","zh":"油胡瓜鱼会在早春回到河流中产卵。"},{"en":"Some communities rendered oolachan oil for cooking and trade.","zh":"一些社群会熬制油胡瓜鱼油，用于烹饪和贸易。"}]}],"synonyms":["eulachon","candlefish","smelt"],"phonetic":"/ˈuːləˌkɑn/","extraExplanation":["“oolachan”常见于加拿大不列颠哥伦比亚省与美国阿拉斯加一带的语境，和当地原住民文化联系很深。它也被称为“candlefish（蜡烛鱼）”，因为鱼体含油量高，干燥后据说可以点燃作为照明。","拼写上常见变体有 oolichan / eulachon；不同地区与资料可能选用不同拼法，但通常指同一种鱼或非常接近的种群。"]}
{"word":"oolak","summary":{"en":"“Oolak” is usually a proper name, not a common English word; its meaning depends on context.","zh":"“Oolak”通常是专有名词而非常见英语词；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (often a surname, place name, or brand name) rather than a standard English vocabulary word.","zh":"一个专有名词（常见于姓氏、地名或品牌名），而不是标准英语词汇。"},"examples":[{"en":"Oolak is not a common English word; it may be a person’s name.","zh":"Oolak 不是常见英语单词；它可能是一个人的名字。"},{"en":"Please tell me the context where you saw “Oolak,” so I can identify it more accurately.","zh":"请告诉我你在哪里看到 “Oolak” 的上下文，这样我可以更准确地判断它的含义。"}]}],"phonetic":"/ˈuːlɑk/","extraExplanation":["“Oolak”不属于常见英语词典里的标准词汇，更可能是专有名词（例如人名、地名、账号名、品牌名），其确切含义需要依赖出现的语境（句子、国家/地区、领域）。","如果你是想查某个相近拼写的英语词（例如 look、outlook、Oolong 等），把原句发来我可以帮你确认。"]}
{"word":"oolakan","summary":{"en":"Oolakan is a variant name for the eulachon, a small, very oily Pacific-coast fish sometimes called the candlefish.","zh":"Oolakan 是 eulachon（油胡瓜鱼/蜡烛鱼）的一种拼写变体，指北美太平洋沿岸一种含油量很高的小鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, very oily fish (eulachon) found on the Pacific coast of North America; also called “candlefish” because it can burn like a candle when dried","zh":"（北美太平洋沿岸的）胡瓜鱼/油胡瓜鱼（eulachon），一种含油量很高的小鱼；又称“蜡烛鱼”，因晒干后油脂多到可点燃"},"examples":[{"en":"The river is famous for its spring run of oolakan.","zh":"这条河以春季洄游的油胡瓜鱼而闻名。"},{"en":"Some communities traditionally made oil from oolakan for cooking and trade.","zh":"一些社群传统上会用油胡瓜鱼熬油，用于烹饪和贸易。"}]}],"synonyms":["eulachon","oolichan","ooligan","candlefish"],"phonetic":"/ˈuːləˌkæn/","extraExplanation":["“oolakan”常见为“eulachon / oolichan / ooligan”的一种拼写变体，主要见于加拿大与美国西北部的历史/人类学/原住民相关语境。","它在当地原住民文化与饮食传统中很重要：会被熬成鱼油（常被称作“grease”），过去也与贸易路线（有时被称为“grease trails”）相关。"]}
{"word":"oolemma","summary":{"en":"A dilemma is a difficult choice, especially when each option has drawbacks.","zh":"dilemma 指“两难/进退维谷”的抉择，尤其是每个选项都有不利之处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A difficult situation in which you must choose between two (or more) options, especially when each option has problems or bad results.","zh":"（两难）进退维谷的处境：你必须在两个（或多个）选择之间做决定，尤其是每个选择都有问题或不好的后果。"},"examples":[{"en":"I’m in a dilemma: accept the new job or stay close to my family.","zh":"我陷入两难：接受新工作，还是留在家人身边。"},{"en":"The company faced a dilemma over whether to raise prices or cut staff.","zh":"公司面临两难：是涨价还是裁员。"}]},{"partOfSpeech":"n.","definition":{"en":"A problem or choice that is hard to solve because it involves conflicting needs, values, or duties.","zh":"（冲突型难题）因需求、价值观或责任相互冲突而难以解决的问题或抉择。"},"examples":[{"en":"She had a moral dilemma about telling the truth.","zh":"她在是否说出真相这件事上有道德困境。"},{"en":"He described the dilemma of balancing work and health.","zh":"他描述了平衡工作与健康的两难。"}]}],"synonyms":["predicament","quandary","bind","problem"],"phonetic":"/dɪˈlɛmə/","extraExplanation":["你输入的 **oolemma** 很可能是拼写错误；正确拼写通常是 **dilemma**。","**dilemma** 里有“mm”两个 m（di-LEM-ma）。常见搭配：**be in a dilemma**（陷入两难）、**face a dilemma**（面临两难）、**pose a dilemma**（造成两难）。"]}
{"word":"oolite","summary":{"en":"Oolite is a sedimentary rock made of many small, round grains (ooids), usually formed in warm, shallow marine water.","zh":"Oolite（鲕粒岩）是一种由许多微小圆形鲕粒胶结而成的沉积岩，常在温暖浅海环境形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sedimentary rock (often limestone) made of many tiny, round grains called ooids, cemented together; it commonly forms in warm, shallow seas with moving water.","zh":"鲕粒岩；由许多微小、圆形的鲕粒（ooids）胶结而成的沉积岩（常为石灰岩），多形成于温暖、浅海且水流不断搅动的环境。"},"examples":[{"en":"The cliffs here are made of oolite formed in a shallow tropical sea millions of years ago.","zh":"这里的悬崖由鲕粒岩构成，它是在数百万年前的浅热带海洋中形成的。"},{"en":"Geologists can identify oolite by its tiny, bead-like grains.","zh":"地质学家可以通过它细小、像珠子一样的颗粒来辨认鲕粒岩。"}]}],"synonyms":["oolitic limestone","oolitic rock"],"phonetic":"ˈoʊ.ə.laɪt","extraExplanation":["“oolite”来自希腊语 oo-（意为“蛋”）+ -lite（“石”），因为其中的鲕粒常呈“鱼卵/小蛋”一样的圆形同心层结构。","学习时可顺带区分：ooid（鲕粒，单个颗粒）→ oolitic（鲕粒状的，形容词）→ oolite（由鲕粒组成的岩石）。"]}
{"word":"oolites","summary":{"en":"“Oolites” means small rounded mineral grains, especially calcium carbonate grains, found in some sands and rocks.","zh":"“Oolites”指细小圆粒状矿物颗粒（常为碳酸钙），常见于某些砂和岩石中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, round grains of calcium carbonate (or other minerals) that form in shallow, moving water; the plural of “oolite.”","zh":"鲕粒：在浅海等水体中因水流搅动而形成的细小圆粒状矿物颗粒（常为碳酸钙）；“oolite”的复数。"},"examples":[{"en":"The beach sand here contains many oolites formed in warm, shallow seas.","zh":"这里的海滩沙里含有许多在温暖浅海中形成的鲕粒。"},{"en":"Under the microscope, the rock is packed with tiny oolites.","zh":"在显微镜下，这种岩石充满了微小的鲕粒。"}]}],"synonyms":["ooids","oolitic grains"],"phonetic":"/ˈoʊ.laɪts/","extraExplanation":["“鲕粒（oolite）”来自希腊语词根 *ōon*（“蛋”），因为它们常像鱼卵/小蛋一样呈圆形，并且常带有一层层同心的“外壳”。","在地质学里，含有大量鲕粒的岩石常称为 “oolitic limestone”（鲕状灰岩）。鲕粒通常形成于温暖、浅、能量较高（有波浪或潮流不断翻滚）的环境。"]}
{"word":"oolith","summary":{"en":"An oolith is a tiny, rounded mineral grain—often calcium carbonate—formed by layers building around a core in shallow, moving water.","zh":"oolith 指在浅水、搅动环境中由矿物层层包裹核心形成的微小圆粒（鲕粒），常见于鲕状石灰岩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, round grain (usually of calcium carbonate) formed in shallow, moving water as mineral layers build up around a tiny core; ooliths often make up a rock called oolitic limestone.","zh":"鲕粒（通常由碳酸钙构成的微小圆粒）：在浅海等水流搅动的环境中，矿物质一层层包裹在微小“核”外形成；许多鲕粒可组成“鲕状石灰岩”。"},"examples":[{"en":"The limestone here is packed with ooliths, showing it formed in shallow, agitated water.","zh":"这里的石灰岩充满鲕粒，说明它形成于浅水且水体扰动较强的环境。"},{"en":"Under the microscope, each oolith looks like a tiny pearl with concentric layers.","zh":"在显微镜下，每个鲕粒都像一颗带同心层纹的小珍珠。"}]}],"synonyms":["ooid"],"phonetic":"/ˈoʊ.ə.lɪθ/","extraExplanation":["词源：来自希腊语 *ōion*（“蛋”）+ *lithos*（“石头”），字面意思接近“蛋状的小石头”。","容易混淆的相关词：*ooid* 常指单个“鲕粒”（与 oolith 基本同义，但在地质学里 *ooid* 更常见）；*oolitic* / *oolithic* 是形容词，表示“鲕状的”。"]}
{"word":"ooliths","summary":{"en":"Ooliths are tiny, round mineral grains—often calcium carbonate—formed in shallow warm water.","zh":"Ooliths 指在温暖浅水中形成的微小圆球状矿物颗粒（常为碳酸钙），即鲕粒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, round mineral grains (usually calcium carbonate) formed in shallow, warm water; they often accumulate and later become a rock called oolitic limestone.","zh":"鲕粒；在浅海温暖水域中形成的细小圆球状矿物颗粒（多为碳酸钙），常大量堆积并最终形成“鲕状石灰岩”。"},"examples":[{"en":"The limestone here is made of ooliths formed in an ancient shallow sea.","zh":"这里的石灰岩由古代浅海中形成的鲕粒构成。"},{"en":"Under the microscope, the ooliths look like tiny pearls with layers.","zh":"在显微镜下，鲕粒看起来像带有层状结构的小珍珠。"}]}],"synonyms":["ooids","oolitic grains"],"phonetic":"/ˈoʊ.ə.lɪθ/","extraExplanation":["“ooliths”是“oolith”的复数；在地质学中更常见的同义词是“ooids”（也可译作“鲕粒”）。","词源来自希腊语：oo-（卵、蛋）+ lithos（石头），意思是“像蛋一样的石头”，形象地描述其圆球状外观。"]}
{"word":"oolitic","summary":{"en":"Oolitic means “made of or relating to tiny rounded grains (ooids), especially in limestone.”","zh":"oolitic 指“鲕粒状的；由鲕粒组成的（尤用于石灰岩）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made of small, rounded grains (ooids), often seen in certain limestones formed in shallow, moving seawater.","zh":"（地质）鲕粒状的；与鲕粒（ooids，小而圆的颗粒）有关的；常指由鲕粒组成、在浅海动荡水体中形成的石灰岩。"},"examples":[{"en":"The outcrop contains oolitic limestone with visible round grains.","zh":"这处露头含有鲕粒灰岩，可以看到明显的圆形颗粒。"},{"en":"Geologists use oolitic textures to infer a shallow, high-energy marine environment.","zh":"地质学家用鲕粒结构来推断浅海、能量较高的海洋环境。"}]}],"synonyms":["oolite-bearing","oolitic-limestone (contextual)"],"phonetic":"/oʊˈlɪtɪk/","extraExplanation":["“oolitic”来自“ooid”（鲕粒），词源与希腊语“oon”（蛋）有关，因为鲕粒常呈小“鱼卵/蛋状”的圆粒。","鲕粒通常是在温暖、浅、水流搅动较强的海域中，矿物（常见为碳酸钙）一层层包裹在微小核心上沉积形成。","常见搭配：oolitic limestone（鲕粒灰岩）、oolitic texture/structure（鲕粒结构）、oolitic sand（鲕粒砂）。"]}
{"word":"oollies","summary":{"en":"“Ollies” is the plural of “ollie,” a basic skateboard jump done without using your hands; it can also be a verb meaning to do that jump.","zh":"“Ollies”是“ollie”的复数，指滑板/单板中不用手抓板的基础跳跃动作；也可作动词，表示做这种跳跃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a skateboarding (and later snowboarding) jump where you lift the board into the air without using your hands; the most basic trick used to get over obstacles","zh":"（滑板/单板滑雪）“豚跳/奥利跳”：不用手抓板，通过脚和板的弹力把板带离地面的基础跳跃动作，常用来越过障碍"},"examples":[{"en":"He practiced ollies for weeks before trying to jump the curb.","zh":"他练了好几周的豚跳，才敢尝试跳上路缘。"},{"en":"A clean ollie helps you get over cracks and small obstacles.","zh":"一个干净利落的豚跳能帮你越过裂缝和小障碍。"}]},{"partOfSpeech":"v.","definition":{"en":"to perform an ollie; to jump with the board without grabbing it","zh":"做豚跳；不用手抓板把板带离地面跳起"},"examples":[{"en":"She ollied onto the sidewalk smoothly.","zh":"她很顺地豚跳上了人行道。"},{"en":"Try to ollie higher by snapping the tail and lifting your front foot.","zh":"想跳更高的话，可以更用力“弹尾”，同时抬前脚。"}]}],"synonyms":["jump","pop (the board)","hop"],"phonetic":"/ˈɑli/","extraExplanation":["常见拼写是 **ollie / ollies**；你写的 **oollies** 多半是拼写变体或误拼。","“ollie”来自滑板选手 Alan “Ollie” Gelfand（艾伦·“奥利”·盖尔范德）的绰号，后来成为这项动作的名称。","在街式滑板文化中，ollie 被视为很多进阶动作（如 kickflip、heelflip、grind、slide）的基础。"]}
{"word":"oolly","summary":{"en":"Oolly means woolly—soft like wool, or (figuratively) unclear and vague.","zh":"oolly 意为“像羊毛一样柔软蓬松的”；也可比喻“含糊不清的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with wool or having wool-like hair; soft and fluffy like wool.","zh":"长着羊毛的；像羊毛一样柔软蓬松的。"},"examples":[{"en":"The lamb has an oolly coat that keeps it warm.","zh":"小羊有一身毛茸茸的羊毛外套，能保暖。"},{"en":"She wore an oolly scarf on cold days.","zh":"天冷时她会戴一条毛绒绒的围巾。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) unclear, vague, or not well thought out.","zh":"（比喻）含糊的；不清晰的；考虑不周的。"},"examples":[{"en":"His explanation was a bit oolly, so I asked more questions.","zh":"他的解释有点含糊，所以我又问了几个问题。"},{"en":"We need a clear plan, not oolly thinking.","zh":"我们需要清晰的计划，而不是含糊的想法。"}]}],"synonyms":["woolly","fuzzy","fluffy","vague","unclear"],"phonetic":"/ˈwʊli/","extraExplanation":["“oolly”通常是“woolly”的变体拼写（把开头的 w 省略），常见于口语化、儿童语言、诗歌或强调可爱/柔软感觉的写法；正式写作里更常用“woolly”。","比喻义里，“woolly thinking”（含糊的思维）是常见搭配，用来批评观点不够清楚、论证不够严谨。"]}
{"word":"oologah","summary":{"en":"Oologah is a town in northeastern Oklahoma; it also refers to Oologah Lake nearby.","zh":"Oologah 是美国俄克拉何马州东北部的一个小镇；也可指附近的 Oologah 湖（水库）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town in northeastern Oklahoma, U.S. (in Rogers County).","zh":"美国俄克拉何马州东北部的一个小镇（罗杰斯县）。"},"examples":[{"en":"Oologah is a quiet town not far from Tulsa.","zh":"Oologah 是一个离塔尔萨不远的安静小镇。"},{"en":"She grew up near Oologah, Oklahoma.","zh":"她在俄克拉何马州的 Oologah 附近长大。"}]},{"partOfSpeech":"n.","definition":{"en":"Oologah Lake, a reservoir near the town, used for recreation and water management.","zh":"Oologah 湖（Oologah Lake）：位于该镇附近的一座水库，用于休闲娱乐和水资源管理。"},"examples":[{"en":"They went fishing at Oologah Lake on Saturday.","zh":"他们周六去 Oologah 湖钓鱼了。"},{"en":"The storm raised water levels at Oologah Lake.","zh":"暴风雨使 Oologah 湖的水位上升了。"}]}],"synonyms":["Oologah, Oklahoma","Oologah Lake"],"phonetic":"/ˈuːləˌɡɔː/","extraExplanation":["“Oologah”常被认为源自美洲原住民语言（与切罗基语背景有关），在当地属于专有地名，通常不翻译而直接音译或保留英文拼写。","Oologah 一带与美国著名幽默家、演员 Will Rogers（威尔·罗杰斯）的故乡有文化关联；附近有纪念地，旅行介绍中常会提到这一点。"]}
{"word":"oologic","summary":{"en":"Oologic means “related to the study or collection of birds’ eggs.”","zh":"oologic 表示“与鸟卵学（研究或采集鸟类卵）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to oology (the study and collecting of birds’ eggs).","zh":"与鸟卵学（研究与采集鸟类卵）有关的。"},"examples":[{"en":"The museum has an oologic collection of eggs from many bird species.","zh":"这家博物馆收藏了许多鸟类物种的卵，属于鸟卵学（oologic）收藏。"},{"en":"Her oologic research focuses on how eggshell thickness changes with climate.","zh":"她的鸟卵学研究关注蛋壳厚度如何随气候变化而改变。"}]}],"synonyms":["oological","related to oology"],"phonetic":"/ˌoʊ.əˈlɑː.dʒɪk/","extraExplanation":["“oologic”来自“oology”（鸟卵学）：oo- 源自希腊语，意为“卵/蛋”，-logy 表示“……学/研究”。日常英语里更常见的形容词是 “oological”，但 “oologic” 也可用，语域偏学术。"]}
{"word":"oological","summary":{"en":"Oological means “related to the study of eggs,” especially birds’ eggs.","zh":"oological 指“与卵/蛋的研究有关的”，尤指鸟类卵学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the study of eggs (especially birds’ eggs).","zh":"与卵学有关的；与（尤其是鸟类）卵/蛋的研究有关的。"},"examples":[{"en":"The museum has an oological collection of bird eggs from around the world.","zh":"这家博物馆收藏了一批来自世界各地的鸟蛋卵学藏品。"},{"en":"She wrote an oological report describing the eggs’ size, color, and shell patterns.","zh":"她写了一份卵学报告，描述了蛋的大小、颜色和蛋壳花纹。"}]}],"synonyms":["ovological (rare)","egg-related (informal)"],"phonetic":"/ˌoʊəˈlɑːdʒɪkəl/","extraExplanation":["“oological”来自“oology（卵学）”，其中 oo- 源自希腊语 ōion（意为“蛋/卵”），-logy 表示“学科/研究”。","在日常英语中更常见的是“zoological（动物学的）”。如果你想表达“动物园/动物学相关”，通常应写 zoological；而 oological 专指“卵/蛋的研究”。"]}
{"word":"oologically","summary":{"en":"“Oologically” means “in a way related to the scientific study of birds’ eggs.”","zh":"“oologically”表示“从卵学（鸟蛋研究）的角度/以卵学方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the scientific study of birds’ eggs (oology).","zh":"以研究鸟蛋（卵学，oology）的方式；在卵学/鸟蛋研究方面。"},"examples":[{"en":"The museum organizes its egg collection oologically, by species and region.","zh":"博物馆以卵学的方式整理其鸟蛋收藏，按物种和地区分类。"},{"en":"The report describes the nest oologically, focusing on egg shape and shell markings.","zh":"报告从卵学角度描述鸟巢，重点关注蛋的形状和蛋壳斑纹。"}]}],"synonyms":["from an oological perspective","in terms of oology","with regard to oology"],"phonetic":"/ˌoʊəˈlɑːdʒɪkli/","extraExplanation":["“oologically”来自“oology（卵学/鸟蛋学）”，词源为希腊语 *ōion*（蛋）+ “-logy”（学科/研究）。在现代英语中较少见，多用于学术或博物馆收藏分类的语境。"]}
{"word":"oologies","summary":{"en":"“Oologies” means the studies (or branches) of oology—the study of birds’ eggs and nesting/breeding.","zh":"“oologies”是复数，指鸟卵学的相关研究领域：研究鸟类的卵、巢与繁殖等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The scientific study of birds’ eggs, nests, and breeding (or the hobby of collecting and identifying birds’ eggs).","zh":"鸟卵学：研究鸟类的卵、巢与繁殖的学科（也可指收集、鉴别鸟卵的爱好）。"},"examples":[{"en":"In the 1800s, oologies were popular among some naturalists who collected and compared eggs.","zh":"在19世纪，一些博物学家热衷于鸟卵学，会收集并比较鸟蛋。"},{"en":"Today, most oologies focus on research and conservation rather than collecting.","zh":"如今，鸟卵学更多关注研究与保育，而不是收集。"}]}],"synonyms":["study of birds' eggs","ornithology (broader field)"],"phonetic":"/uˈɑlədʒi/","extraExplanation":["“oologies”是“oology”的复数形式。词源来自希腊语 ōion（卵）+ -logy（……学）。","历史上“收集鸟蛋”曾是鸟卵学的一部分，但现代许多国家/地区对采集野生鸟卵有严格法律限制；学习时更常强调观察、记录与保护。"]}
{"word":"oologist","summary":{"en":"An oologist is a scientist or researcher who studies eggs, especially bird eggs.","zh":"oologist 指研究卵类（尤指鸟卵）的学者或研究者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies eggs, especially bird eggs (their shapes, shells, nests, and how they develop).","zh":"卵类学家；研究卵（尤指鸟卵）的人（如卵的形状、蛋壳、巢与发育等）。"},"examples":[{"en":"The oologist examined the eggshell to learn what the bird had been eating.","zh":"这位卵类学家检查了蛋壳，以了解那只鸟吃了什么。"},{"en":"She became an oologist after years of studying nesting behavior in the field.","zh":"她在野外研究筑巢行为多年后，成为了一名卵类学家。"}]}],"synonyms":["egg researcher","ornithologist (if focusing broadly on birds)"],"phonetic":"/oʊˈɑlədʒɪst/","extraExplanation":["“oologist”来自希腊语词根：ōion（卵、蛋）+ -logist（……学者/研究者）。对应的学科名词是“oology”（卵类学）。","19世纪到20世纪早期，欧美曾流行采集鸟蛋作为“科学研究/收藏”，但如今许多地区对采集野鸟蛋有严格法律限制；现代研究更多使用观察、拍摄、测量与非破坏性取样等方式。"]}
{"word":"oologists","summary":{"en":"“Oologists” are people who study birds’ eggs.","zh":"“oologists”指研究鸟卵的研究者（卵学家）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies birds’ eggs (their size, color, shape, and nesting habits); a specialist in oology","zh":"（研究鸟卵的）卵学家；鸟卵研究者"},"examples":[{"en":"In the early 1900s, many oologists collected eggs to document bird species.","zh":"在20世纪初，许多卵学家会收集鸟卵来记录鸟类物种。"},{"en":"Modern oologists often use photos and field notes instead of taking eggs from nests.","zh":"现代卵学家常用照片和野外记录来替代从鸟巢取走鸟卵。"}]}],"synonyms":["egg specialists","ornithologists (more general)"],"phonetic":"/oʊˈɑːlədʒɪsts/","extraExplanation":["“oologists”是复数形式，单数是“oologist”。词根“oo-”来自希腊语“ōion（蛋）”，“-logy/-logist”表示“学科/研究者”。","历史上“oology（卵学）”与采集鸟蛋有关；但在当代自然保护与法律规范下，许多地区禁止或严格限制采集鸟卵，因此研究更强调观察、影像记录与生态保护。"]}
{"word":"oologize","summary":{"en":"“Oologize” means to study or collect birds’ eggs.","zh":"“oologize”指研究或收集鸟蛋。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to study, collect, or write about birds’ eggs (especially for scientific purposes)","zh":"研究、收集或撰写关于鸟蛋的内容（尤指科学研究）"},"examples":[{"en":"As a teenager, he liked to oologize and carefully label each egg in his collection.","zh":"青少年时期，他喜欢研究并收集鸟蛋，还会仔细给每枚蛋贴上标签。"},{"en":"In the 1800s, many naturalists would oologize during the spring nesting season.","zh":"在19世纪，许多博物学家会在春季筑巢期研究鸟蛋。"}]}],"synonyms":["study birds’ eggs","research eggs","collect eggs (historic use)","do oology"],"phonetic":"/oʊˈɑːlədʒaɪz/","extraExplanation":["“oologize”来自“oology”（卵学/鸟蛋学），词根“oo-”源自希腊语“ōion”（蛋），“-logy”表示“学科/研究”。","这个词在现代英语里比较少见；当代更常见的表达是“study birds’ eggs”或“do research on eggs”。另外，出于野生动物保护与法律规定，如今不鼓励私人采集野鸟蛋。"]}
{"word":"oology","summary":{"en":"Oology is the study of bird eggs (and historically, sometimes egg-collecting).","zh":"Oology 指对鸟蛋的研究（历史上也有“收集鸟蛋”的含义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The scientific study of bird eggs (including their structure, development, and identification); sometimes also the hobby of collecting bird eggs.","zh":"鸟卵学；研究鸟蛋的科学（包括结构、发育与鉴别）；有时也指收集鸟蛋的爱好。"},"examples":[{"en":"Oology helps scientists compare the size, color, and shape of eggs among different bird species.","zh":"鸟卵学帮助科学家比较不同鸟类物种的鸟蛋在大小、颜色和形状上的差异。"},{"en":"She became interested in oology after volunteering at a wildlife rehabilitation center.","zh":"她在野生动物救护中心做志愿者后，对鸟卵学产生了兴趣。"}]}],"synonyms":["study of bird eggs","avian egg research"],"phonetic":"/oʊˈɑːlədʒi/","extraExplanation":["词源：oo- 来自希腊语 ōion（“蛋”），-logy 表示“……学/研究”。","在现代语境中，“收集鸟蛋”常涉及法律与伦理问题；许多地区禁止采集野生鸟卵。如今更常见的是用摄影、测量与数据库记录来进行鸟卵研究。"]}
{"word":"oolong","summary":{"en":"Oolong is a partially oxidized Chinese tea, with flavors between green and black tea.","zh":"Oolong 指乌龙茶，一种部分氧化（半发酵）的中国茶，风味介于绿茶与红茶之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of traditional Chinese tea that is partially oxidized, with flavors between green tea (light) and black tea (strong).","zh":"乌龙茶；一种中国传统茶类，属于“半发酵/部分氧化”的茶，风味介于绿茶（清爽）与红茶（浓厚）之间。"},"examples":[{"en":"I usually drink oolong in the afternoon because it feels smooth and fragrant.","zh":"我通常下午喝乌龙茶，因为口感顺滑、香气很足。"},{"en":"The tea shop recommended an oolong with a roasted, nutty aroma.","zh":"茶店推荐了一款带有烘焙、坚果香气的乌龙茶。"}]}],"synonyms":["wulong tea","Chinese oolong tea"],"phonetic":"/ˈuːlɔːŋ/","extraExplanation":["“oolong”来自中文“乌龙（wūlóng）”，字面意思是“黑龙”。英语里多写作 oolong（也可见到 wulong 的拼写）。","乌龙茶的口味差异很大：有的偏清香花香（如铁观音一类），有的偏焙火和熟果香（如武夷岩茶一类）。英语点单时可说 “a cup of oolong (tea)”。"]}
{"word":"oolongs","summary":{"en":"“Oolongs” means more than one kind or serving of oolong tea, a partially oxidized tea between green and black tea.","zh":"“Oolongs”指多种或多份乌龙茶；乌龙茶是一种部分氧化的茶，介于绿茶与红茶之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of partially oxidized tea (between green and black tea), often with a floral, fruity, or roasted flavor; “oolongs” is the plural form.","zh":"乌龙茶（一种半发酵/部分氧化的茶，介于绿茶与红茶之间，常带花香、果香或焙火香）；“oolongs”为其复数形式。"},"examples":[{"en":"The café offers several oolongs, including a lightly floral one.","zh":"这家咖啡馆提供好几种乌龙茶，其中有一种带淡淡花香。"},{"en":"I bought two oolongs: one roasted and one more green-style.","zh":"我买了两种乌龙茶：一种是焙火的，另一种更接近清香型。"}]}],"synonyms":["oolong tea","partially oxidized tea","wulong (tea)"],"phonetic":"/ˈuːlɔŋ/","extraExplanation":["“Oolong”来自中文“乌龙”（wūlóng）。在英语里既可作可数名词（an oolong / two oolongs），也常作不可数名词（some oolong）。","茶类常用“oxidized（氧化）/ fermented（发酵）”来描述工艺：乌龙通常被称为“partially oxidized（部分氧化）”。","常见搭配：oolong tea（乌龙茶）、roasted oolong（焙火乌龙）、tieguanyin / Tieguanyin（铁观音）、Da Hong Pao / dahongpao（大红袍）。"]}
{"word":"ooltewah","summary":{"en":"Ooltewah is a place name in Tennessee (near Chattanooga).","zh":"Ooltewah 是田纳西州（靠近查塔努加）的一个地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ooltewah: a community (place name) in Hamilton County, Tennessee, near Chattanooga, USA.","zh":"Ooltewah：美国田纳西州汉密尔顿县的一个社区（地名），靠近查塔努加（Chattanooga）。"},"examples":[{"en":"She moved to Ooltewah for a quieter life outside Chattanooga.","zh":"她搬到 Ooltewah，是为了在查塔努加郊外过更安静的生活。"},{"en":"The address says Ooltewah, TN, so it’s in the Chattanooga area.","zh":"地址写着 Ooltewah, TN，所以它在查塔努加一带。"}]}],"synonyms":["(no direct synonyms; it’s a proper place name)"],"phonetic":"/ˈoʊl.tə.wɑː/","extraExplanation":["Ooltewah 常被视为查塔努加都会区的一部分（邮寄地址常写 Ooltewah, TN）。","这个地名通常被认为与切罗基（Cherokee）语有关，但不同资料对其具体含义说法不一；在正式写作中可把它当作专有地名使用，不必强行翻译其“字面意思”。"]}
{"word":"oomancy","summary":{"en":"Oomancy is divination done by interpreting eggs or egg patterns.","zh":"Oomancy 指用鸡蛋（或蛋清形成的图案等）来进行占卜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A form of divination (fortune-telling) that uses eggs—such as interpreting the shapes or patterns of egg whites dropped into water.","zh":"一种用“蛋”来占卜/算命的方法（例如把蛋清滴入水中，通过其形成的形状或纹路来解读吉凶）。"},"examples":[{"en":"In the story, the villagers practiced oomancy to predict the weather for the harvest.","zh":"在故事里，村民用蛋占卜（oomancy）来预测收获季的天气。"},{"en":"She joked that she didn’t trust tarot cards, but oomancy felt even stranger.","zh":"她开玩笑说自己不信塔罗牌，但蛋占卜（oomancy）更离奇。"}]}],"synonyms":["egg divination","ovomancy"],"phonetic":"/oʊˈmænsi/","extraExplanation":["“-mancy”这个后缀来自希腊语，意思是“占卜、预言”（如 necromancy“招魂/亡灵占卜”、chiromancy“手相”）。因此 oomancy 直译就是“用蛋来占卜”。","这个词非常少见，多见于民俗学、奇幻文学或讨论占卜方式的文章里；日常英语中通常会直接说 “egg divination”（用蛋占卜）。"]}
{"word":"oomantia","summary":{"en":"Oomantia is a rare word for fortune-telling by interpreting eggs.","zh":"Oomantia 指一种少见的“以鸡蛋进行占卜”的方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare term meaning divination (fortune-telling) by eggs—interpreting the shape, patterns, or behavior of an egg (often after cracking it into water).","zh":"一个较少见的词，指“以鸡蛋占卜”（通过观察鸡蛋的形状、纹路或在水中的变化来进行占卜/预测）。"},"examples":[{"en":"In some folk traditions, oomantia was used to predict whether a marriage would be happy.","zh":"在一些民俗传统中，人们会用 oomantia（鸡蛋占卜）来预测婚姻是否幸福。"},{"en":"The novelist mentions a village healer practicing oomantia with an egg and a bowl of water.","zh":"小说里提到一位乡村疗愈者用鸡蛋和一碗水进行 oomantia（占卜）。"}]}],"synonyms":["ovomancy","oomancy","egg divination"],"phonetic":"/ˌoʊ.oʊˈmæn.ti.ə/","extraExplanation":["这个词非常罕见，更多时候你会看到更常用的同义词：ovomancy 或 oomancy。","词源可追溯到希腊语：ōion（“蛋”）+ manteia（“占卜/预言”）。在英语文本中常出现在民俗学、神秘学或文学描写里，而不是日常对话。","与之相关的更广义词是 divination（占卜）和 fortune-telling（算命/看运势）。"]}
{"word":"oometer","summary":{"en":"“-ometer” means a measuring instrument and appears in words like thermometer and speedometer.","zh":"“-ometer”表示“测量仪器/装置”，常见于 thermometer、speedometer 等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word ending (suffix) meaning “a device or instrument that measures something,” often used in the names of measuring tools.","zh":"一个词尾（后缀），表示“用来测量某事物的仪器/装置”，常用于各种测量工具的名称中。"},"examples":[{"en":"A speedometer measures how fast a car is going.","zh":"speedometer（车速表）用来测量汽车行驶的速度。"},{"en":"A thermometer measures temperature.","zh":"thermometer（温度计）用来测量温度。"},{"en":"An odometer measures how far a vehicle has traveled.","zh":"odometer（里程表）用来测量车辆行驶的距离。"}]}],"synonyms":["-meter"],"phonetic":"/ˈoʊmɪtɚ/","extraExplanation":["你输入的“oometer”本身不太常见；更常见的是写作 “-ometer” 或 “ometer”，作为构词成分出现在单词末尾。","“-ometer”来自希腊语 -metron（“测量”）。前半部分通常说明“测什么”：thermo-（热/温度）、speed-（速度）、od-（路程）等。","在英语里有时也写作 “-meter”（如 speedometer / speedometer 两种拼法里以 -meter 更常见于英式拼写；美式也常见 -meter）。"]}
{"word":"oometric","summary":{"en":"Geometric means related to geometry or (in growth) increasing by a constant ratio.","zh":"Geometric 表示“与几何有关的”，也可指“按固定比率增长的（几何式增长）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to geometry (shapes, angles, lines, and space), or using geometry in math or design.","zh":"与几何（形状、角度、线条与空间）有关的；或在数学/设计中使用几何方法的。"},"examples":[{"en":"We learned geometric shapes like triangles and circles in class.","zh":"我们在课上学习了三角形和圆形等几何图形。"},{"en":"The building has a geometric pattern on its walls.","zh":"这栋建筑的墙上有几何图案。"}]},{"partOfSpeech":"adj.","definition":{"en":"Increasing or changing according to a constant ratio (often used in the phrase “geometric growth”).","zh":"按固定比率增长或变化的（常用于短语“geometric growth/几何增长”）。"},"examples":[{"en":"The number of users showed geometric growth after the app went viral.","zh":"这款应用爆红后，用户数量出现了几何式增长。"},{"en":"Small daily improvements can lead to geometric results over time.","zh":"每天一点点进步，长期下来可能带来几何级的成果。"}]}],"synonyms":["mathematical","angular","polygonal","proportional (in growth contexts)"],"phonetic":"/ˌdʒiːəˈmɛtrɪk/","extraExplanation":["“oometric” 不是常见英语单词，很可能是拼写错误，最常见的目标词是 “geometric”。如果你想查的是 “trigonometric（三角函数的）” 或 “biometric（生物识别的）”，也可以告诉我上下文句子，我可以帮你确认。","词源提示：geometric 来自 Greek “geo-（地/土地）” + “-metric（测量）”，字面含义接近“测量土地”，后来泛指几何学。"]}
{"word":"oometry","summary":{"en":"“-ometry” is a suffix meaning measurement or the science/process of measuring.","zh":"“‑ometry”是表示“测量”或“测量学/测量过程”的后缀。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common ending (suffix) meaning “the measurement of” or “the process/science of measuring.”","zh":"常见后缀，表示“……的测量”或“测量的过程/学科”。"},"examples":[{"en":"In words like geometry, “-ometry” relates to measuring.","zh":"在 geometry（几何学）这样的词里，“-ometry”与“测量”有关。"},{"en":"Thermometry is the measurement of temperature.","zh":"thermometry 指“温度测量”。"},{"en":"If you see “-ometry,” the word is usually about a type of measurement.","zh":"如果你看到“-ometry”，这个词通常和某种“测量”有关。"}]}],"synonyms":["measurement (meaning)","-metry (related suffix)"],"phonetic":"/ˈɑːmətri/","extraExplanation":["你输入的“oometry”在英语里不算常见单词，更像是拼写误差或把“‑ometry（测量）”这个后缀单独拿出来用了。","词源上，“‑ometry”来自希腊语 metron（“度量、测量”）。常见例子：geometry（几何学）、optometry（验光/视光学）、spirometry（肺活量测定）。","如果你本来想查的是 optometry（验光/视光学）或 geometry（几何学），告诉我你想要哪一个，我可以给出更准确的词条解释。"]}
{"word":"oomiac","summary":{"en":"An Arctic Inuit-style open skin boat used for transport.","zh":"北极地区因纽特等民族使用的敞口皮船，用于运输与出行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large open boat traditionally used by Inuit and other Arctic peoples, usually with a wooden/driftwood frame covered with animal skins; often used for carrying people and goods.","zh":"（因纽特等北极地区民族传统使用的）乌米亚克皮船；一种大型敞口船，通常以木架（或漂木）为骨架、外覆兽皮，用于载人和运输物资。"},"examples":[{"en":"The group crossed the bay in an oomiac to reach the hunting grounds.","zh":"这群人乘乌米亚克皮船穿过海湾，前往狩猎地。"},{"en":"In the museum, a restored oomiac shows how Arctic families traveled and moved supplies.","zh":"在博物馆里，一艘修复的乌米亚克皮船展示了北极地区家庭如何出行并运送物资。"}]}],"synonyms":["umiak","skin boat"],"phonetic":"/ˈuːmiˌæk/","extraExplanation":["“oomiac”更常见的拼写是“umiak”。两者都指同一种传统船只；不同拼写多来自早期转写方式差异。","在文化语境中，umiak/oomiac常被称为“women’s boat（女人的船）”，因为传统上常由女性划桨、并用于家庭迁移与运载；而“kayak（皮划艇）”多为个人使用、常与狩猎相关。"]}
{"word":"oomiack","summary":{"en":"An Inuit open skin boat used for travel and hunting in Arctic waters.","zh":"因纽特人用于北极水域出行与狩猎的敞口皮船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional open boat used by Inuit peoples, usually made from a wooden or driftwood frame covered with sealskin, used for traveling and hunting in Arctic waters.","zh":"一种因纽特人传统的敞口小船，通常用木架（或漂流木）做骨架、外覆海豹皮，用于在北极水域出行与狩猎。"},"examples":[{"en":"The family loaded supplies into the oomiack before crossing the bay.","zh":"一家人把补给装进 oomiack，然后渡过海湾。"},{"en":"In the museum, we saw a restored oomiack covered in stitched sealskin.","zh":"在博物馆里，我们看到一艘修复过的 oomiack，外面覆着缝制的海豹皮。"}]}],"synonyms":["umiak","skin boat"],"phonetic":"/ˈuːmiˌæk/","extraExplanation":["更常见的拼写是 umiak（也写作 oomiaq）。英语里 “oomiack” 属于较少见的旧式或变体拼写，但指的通常是同一种因纽特皮艇（敞口、可载多人和货物），与单人用的 kayak（皮划艇/独木舟）在用途与结构上不同。","该词来自因纽特语族（如因纽特语 Inuktitut）相关词形，进入英语后多用于人类学、极地探险记述和博物馆说明等语境。"]}
{"word":"oomiacks","summary":{"en":"“Oomiacks” means the plural of “oomiak/umiak,” a large traditional Inuit skin boat used for transport.","zh":"“oomiacks”是“oomiak/umiak”的复数，指因纽特人用于载人与运货的大型传统皮船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of oomiak (also spelled “umiak”): a traditional Inuit skin boat used for carrying people and goods, usually larger than a kayak.","zh":"“oomiak”（也拼作 umiak）的复数：一种因纽特人传统的皮船，用来载人和运输物资，通常比皮划艇（kayak）更大。"},"examples":[{"en":"In summer, families traveled between coastal camps in oomiacks.","zh":"夏天，家家户户会乘坐 oomiacks 在沿海营地之间往来。"},{"en":"The museum displayed an oomiack made with a wooden frame and animal skins.","zh":"博物馆展出了一艘用木架和兽皮制作的 oomiack。"}]}],"synonyms":["umiaks","oomiaks","skin boats"],"phonetic":"/ˈuːmiæk/","extraExplanation":["“oomiak/umiak”来自因纽特语系（常见来源为伊努皮亚克语），指一种适合载重、常由多人划桨的“皮船”。它在北极沿岸的迁徙、狩猎与运输中很重要。","拼写上既可见 oomiak 也可见 umiak；复数在英语里常加 -s 变成 oomiacks/umiaks。","对比：kayak 通常更小、更窄，多为单人或少人数使用；oomiak 更偏“群体运输/载货”。"]}
{"word":"oomiacs","summary":{"en":"Oomiacs is an older/less common spelling of “umiaks,” traditional large open skin boats used in the Arctic.","zh":"Oomiacs 是 “umiaks” 的较旧或不常见拼写，指北极地区传统的大型敞口皮船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spelling variant of “umiaks”: large open skin boats traditionally used by Inuit and other Arctic peoples, often for transporting people and goods","zh":"“umiaks”的一种拼写变体：因纽特人等北极地区民族传统使用的大型敞口皮船，常用于载人和运输物资"},"examples":[{"en":"The explorers hired local guides and traveled in umiaks along the coast.","zh":"探险队雇了当地向导，沿海岸乘坐 umiaks（皮船）前行。"},{"en":"In the museum, we saw a traditional umiak made with a wooden frame and animal skins.","zh":"在博物馆里，我们看到一艘传统 umiak，由木质骨架和兽皮制成。"}]}],"synonyms":["umiaks","skin boat"],"phonetic":"/ˈuːmiˌæk/","extraExplanation":["“umiak”常被称为“女人的船”（women’s boat），在传统生活中常由女性负责操控或管理，用于搬家、运输、捕猎相关活动等；与更小更快、常用于狩猎的“kayak（皮划艇/皮舟）”相对。","“oomiacs/oomiaks”多见于早期英语旅行记、探险文献或旧式拼写；现代更常写作“umiaks”。"]}
{"word":"oomiak","summary":{"en":"An oomiak is a traditional Inuit large open skin-covered boat used for travel and carrying people or goods.","zh":"oomiak 指因纽特人传统的大型敞口兽皮船，用于出行与载人载物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large open boat traditionally used by Inuit peoples, made with a wooden (or bone) frame covered in animal skins, and usually paddled or rowed, sometimes with a sail","zh":"（因纽特人传统的）乌米亚克皮船；一种大型敞口船，通常用木（或骨）架加兽皮覆盖制成，以划桨/划橹推进，有时也可挂帆"},"examples":[{"en":"In the museum, we saw an oomiak with a seal-skin covering.","zh":"在博物馆里，我们看到一艘外覆海豹皮的乌米亚克皮船。"},{"en":"The community traveled between coastal camps by oomiak in summer.","zh":"夏季时，社区人们乘乌米亚克皮船在沿海营地之间往返。"}]}],"synonyms":["Inuit skin boat"],"phonetic":"/ˈuːmiæk/","extraExplanation":["“oomiak”一词来自因纽特语系（常见说法源自伊努皮亚克语等），指北极地区传统交通工具之一。它与“kayak/皮划艇（qajaq）”常被对比：kayak通常更小、更封闭，偏个人使用；oomiak更大、更敞口，适合载人载物、家庭或群体出行。"]}
{"word":"oomiaks","summary":{"en":"Oomiaks are large traditional Arctic skin boats used to carry people and goods.","zh":"Oomiaks 指北极地区传统的大型兽皮船，用于运人运物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, open skin boat traditionally used by Inuit and other Arctic peoples for transporting people and goods, often paddled by several people (plural: oomiaks)","zh":"（因纽特等北极民族传统使用的）大型敞口兽皮船，用于运送人员和物资，通常由多人划桨（复数：oomiaks）"},"examples":[{"en":"The expedition hired local guides who traveled in oomiaks along the coast.","zh":"探险队雇了当地向导，沿海乘坐oomiaks航行。"},{"en":"Compared with a kayak, an oomiak is bigger and can carry more cargo.","zh":"与皮划艇（kayak）相比，oomiak更大，能载更多货物。"}]}],"synonyms":["umiaks","umiak"],"phonetic":"/ˈuːmiæk/","extraExplanation":["“oomiak”也常拼作“umiak”，来源于因纽特相关语言的词汇；在传统文化中，它常用于搬运、迁徙与捕猎活动。","学习时注意区分：kayak 通常是单人、封闭式的小船；oomiak/umiak 多为多人、敞口的大船。"]}
{"word":"oompah","summary":{"en":"Oompah is a lively “oom-pah” bass-and-chord rhythm typical of polka and brass band music.","zh":"Oompah指波尔卡与铜管乐常见的“低音—和弦”交替节奏，也可指这种热闹的音乐风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rhythmic pattern in music (especially polka or marching band music) that alternates a low bass note (“oom”) with a chord (“pah”); also the lively style of music that uses this pattern","zh":"一种音乐节奏型（常见于波尔卡或行进乐队），低音“oom”和和弦“pah”交替出现；也可指采用这种节奏的热闹音乐风格"},"examples":[{"en":"The band played an oompah beat that made everyone want to dance.","zh":"乐队演奏了“oompah”的节奏，让大家都想跳舞。"},{"en":"You often hear oompah music at Oktoberfest celebrations.","zh":"在啤酒节（Oktoberfest）的庆祝活动中经常能听到oompah风格的音乐。"},{"en":"The tuba and accordion gave the song an oompah feel.","zh":"大号和手风琴让这首歌有了典型的oompah感觉。"}]}],"synonyms":["oom-pah beat","polka beat","brass-band rhythm"],"phonetic":"/ˈuːm.pɑː/","extraExplanation":["“oompah”是拟声词，模仿低音铜管（如大号）发出“oom”的低音、再由乐队齐奏和弦形成“pah”的效果；常见写法还有“oom-pah”。","在英语文化中，它常让人联想到德国/中欧民俗音乐、铜管乐队与啤酒节氛围，因此也带一点“热闹、欢乐、乡村民谣感”的联想。"]}
{"word":"oompahed","summary":{"en":"“Oompahed” means “played in an oom-pah (polka/brass-band) rhythm” in the past.","zh":"“oompahed”表示“过去以oom-pah（波尔卡/铜管乐）节奏演奏”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(informal) Past tense of “oompah”: to play or perform music in an “oom-pah” rhythm (often like brass-band or polka music with a strong bass beat).","zh":"（非正式）“oompah”的过去式：以“oom-pah（通砰）”的节奏演奏或表演音乐（常见于铜管乐队、波尔卡等，低音强拍很明显）。"},"examples":[{"en":"The band oompah-ed through a fast polka, and everyone started clapping.","zh":"乐队用“oom-pah”的节奏演奏了一段快波尔卡，大家都开始鼓掌。"},{"en":"We oompah-ed along on tubas and accordions for the festival parade.","zh":"在节日游行里，我们用大号和手风琴一路“oom-pah”伴奏。"}]}],"synonyms":["played a polka rhythm","played an oom-pah beat","brayed (humorous, not exact)"],"phonetic":"/ˈʊm.pɑd/","extraExplanation":["“oom-pah”是拟声词，模仿低音（oom）与和弦/重拍（pah）交替的感觉，常和德国/中欧的啤酒馆音乐、波尔卡、铜管乐队联系在一起。","拼写上也常见作“oompah”或“oom-pah”；动词过去式可写作“oompahed”或“oompah-ed”，属于比较口语、写作里不算非常固定的用法。"]}
{"word":"oompahs","summary":{"en":"“Oompahs” are repeated “oom-pah” bass-and-chord beats, often from tuba/brass in lively dance music.","zh":"“Oompahs”指反复的“低音+和弦”舞曲伴奏节奏，常见于大号等铜管乐器的热闹音乐中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) A repeated, bouncy accompaniment pattern in dance music—often a low bass note (\"oom\") followed by a chord (\"pah\")—commonly played by brass instruments like the tuba.","zh":"（复数）一种常见于舞曲的反复、跳跃感伴奏型：通常是低音（“oom”）后接和弦（“pah”），常由大号等铜管乐器演奏。"},"examples":[{"en":"The band played bright oompahs that made everyone want to dance.","zh":"乐队演奏了轻快的 oompahs，让大家都想跳舞。"},{"en":"You could hear the tuba’s oompahs under the melody.","zh":"你能在旋律下面听到大号的 oompahs。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Sounds or beats that resemble this “oom-pah” rhythm, even outside traditional polka or brass-band music.","zh":"（非正式）类似“oom-pah”节奏的声音或拍子，即使不在传统波尔卡或铜管乐队音乐中也可这样说。"},"examples":[{"en":"The keyboard tried to imitate old-fashioned oompahs.","zh":"键盘试着模仿那种老派的 oompahs。"},{"en":"The song starts with comic oompahs before the singer comes in.","zh":"歌曲在歌手进入前先用滑稽的 oompahs 开场。"}]}],"synonyms":["oom-pah rhythms","polka beats","tuba accompaniment","bass-and-chord pattern"],"phonetic":"/ˈʊm.pɑːz/","extraExplanation":["“oompah / oom-pah”是拟声词，模仿舞曲伴奏里“低音一下 + 和弦一下”的交替：低音像“oom”，和弦像“pah”。","这个节奏常与德国/奥地利民间舞曲、波尔卡（polka）以及啤酒节（如 Oktoberfest）等文化场景联系在一起，所以在英语里也带有“热闹、民俗、铜管乐队”的感觉。"]}
{"word":"oomph","summary":{"en":"Oomph means extra energy, force, or impact that makes something stronger or more exciting (informal).","zh":"Oomph 指（非正式）让事物更有力量、更有效或更带感的“劲儿/冲击力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"energy, strength, or force that makes something more effective or exciting (often informal).","zh":"（非正式）使某事更有力、更有效或更刺激的劲儿／力量／推动力。"},"examples":[{"en":"This spicy sauce really adds some oomph to the noodles.","zh":"这款辣酱真的给面条增添了不少“劲儿”和味道。"},{"en":"The new speaker gave the campaign more oomph.","zh":"新来的演讲者让这场竞选更有声势和推动力。"}]},{"partOfSpeech":"n.","definition":{"en":"extra impact or enthusiasm in the way someone speaks or performs.","zh":"（说话或表演中的）感染力、热情劲儿、冲击力。"},"examples":[{"en":"Try to say it with a little more oomph.","zh":"试着说得更有点儿劲儿、更有感染力。"},{"en":"Her performance had oomph, even in a small room.","zh":"即使在小房间里，她的表演也很有冲击力。"}]}],"synonyms":["energy","punch","power","zip","spark","impact","kick"],"phonetic":"/umf/","extraExplanation":["“oomph”常用于口语，带一点幽默或轻松的语气，强调“需要更有劲/更带感”。","词形像拟声词，常被认为来自表示用力发声或使劲的声音（20世纪初在英语中流行）。在写作里它偏随意，不太适合非常正式的场合。"]}
{"word":"oomphs","summary":{"en":"“Oomphs” means multiple instances of extra energy, strength, or punch that makes something better or more exciting.","zh":"“oomphs”指“多处/多种额外的劲儿、力度或冲击力”，让事物更有力量或更吸引人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “oomph”: extra energy, strength, or force that makes something more powerful or exciting.","zh":"“oomph”的复数：指让事物更有力量、更有劲、更有吸引力的额外能量/冲劲/力度。"},"examples":[{"en":"This soup needs more oomphs—maybe add garlic or chili.","zh":"这汤还需要更有劲的味道——也许加点蒜或辣椒。"},{"en":"The team had a few good moments, but not enough oomphs to win.","zh":"球队有几次不错的表现，但冲劲不够，赢不了。"}]}],"synonyms":["punch","power","energy","drive","kick","zip","spark"],"phonetic":"/umf/","extraExplanation":["“oomph”是比较口语化的词，常用来形容“需要更带劲/更有冲击力”的感觉：可以指味道（flavor）、表现（performance）、设计（design）、语气（delivery）等。复数“oomphs”不如单数常见，但在强调“多处需要加劲儿/多种增效点”时会出现。"]}
{"word":"oon","summary":{"en":"“oon” is a dialect spelling of “one.”","zh":"“oon”是“one”的方言写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(dialect, mainly Scots/Irish English) a nonstandard spelling/pronunciation of “one.”","zh":"（方言，主要见于苏格兰英语/爱尔兰英语）“one”的非标准拼写或读音。"},"examples":[{"en":"In some Scots writing, you may see “oon” meaning “one.”","zh":"在一些苏格兰英语的文字里，你可能会看到“oon”表示“one（一个/一）”。"},{"en":"He said, “Just the oon cup of tea, please,” meaning one cup.","zh":"他说：“就来一杯茶（oon cup of tea）就好。”意思是“一杯”。"}]}],"synonyms":["one"],"phonetic":"/un/","extraExplanation":["“oon”多见于方言写法（尤其是苏格兰语境的拼写/口语转写），在标准英语写作中一般不用。正式场合请用“one”。","如果你是在手机、游戏或社交媒体里看到“OON”大写，它也可能是缩写（例如某些行业里指 out of network 等），需要结合上下文判断。"]}
{"word":"oona","summary":{"en":"Oona is mainly used as a female first name, and it is also recognized through famous people like Oona O’Neill.","zh":"Oona 主要用作女性名字，也因 Oona O’Neill 等知名人物而被更多人认识。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a girl’s first name).","zh":"女性名字（女孩的名字）。"},"examples":[{"en":"Oona is a popular name in some Irish and English-speaking families.","zh":"Oona 在一些爱尔兰及英语国家的家庭中很常见。"},{"en":"Her name is Oona, spelled O-O-N-A.","zh":"她叫 Oona，拼作 O-O-N-A。"}]},{"partOfSpeech":"n.","definition":{"en":"a name associated with notable people, such as Oona O’Neill (an Irish-American writer and the wife of filmmaker Charlie Chaplin).","zh":"与一些知名人物相关的名字，例如 Oona O’Neill（爱尔兰裔美国作家，也是电影人查理·卓别林的妻子）。"},"examples":[{"en":"Oona O’Neill is often mentioned in biographies of Charlie Chaplin.","zh":"在查理·卓别林的传记中常会提到 Oona O’Neill。"},{"en":"Some parents choose the name Oona because of its literary and cultural associations.","zh":"有些父母因为它的文学与文化联想而选择 Oona 这个名字。"}]}],"phonetic":"/ˈuːnə/","extraExplanation":["“Oona”常被认为源自爱尔兰/盖尔语传统（在英语世界里多写作 Oona 或 Úna），读音通常是“乌-娜”。","在文化层面上，这个名字在20世纪因 Oona O’Neill 等人物而更广为人知；在传记、电影史相关文本中也常出现。"]}
{"word":"oonagh","summary":{"en":"Oonagh is an Irish female name (a variant of Úna/Una) and can also refer to a fairy-queen figure in Irish folklore.","zh":"Oonagh 是一个源自爱尔兰的女性名字（Úna/Una 的变体），也可指爱尔兰民间传说中的精灵女王形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name of Irish origin; a spelling of Úna/Una, often interpreted as “one” or “unique.”","zh":"一个源自爱尔兰的女性名字；Úna/Una 的一种拼写，常被解释为“唯一的、独一无二的”。"},"examples":[{"en":"Oonagh is an Irish name, and some people spell it as Úna or Una.","zh":"Oonagh 是一个爱尔兰名字，有些人也会拼作 Úna 或 Una。"},{"en":"Her name is Oonagh, pronounced like “OO-nuh.”","zh":"她叫 Oonagh，读音类似“乌-娜（OO-nuh）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Irish folklore) a fairy queen; the name of a supernatural female figure sometimes called Oonagh/Úna.","zh":"（爱尔兰民间传说）仙灵/精灵女王；一个超自然女性角色的名字，有时被称作 Oonagh/Úna。"},"examples":[{"en":"In some retellings of Irish folklore, Oonagh is a queen of the fairies.","zh":"在一些爱尔兰民间故事的改写版本中，Oonagh 是精灵女王。"},{"en":"The story mentioned Oonagh and other figures from Irish legend.","zh":"故事提到了 Oonagh 和其他爱尔兰传说人物。"}]}],"synonyms":["Úna","Una","Oona"],"phonetic":"/ˈuːnə/","extraExplanation":["Oonagh 常见于英语世界对爱尔兰名 Úna 的音译/拼写变体：Úna（带重音符号）更贴近爱尔兰语拼写；Una 是更常见的英文简化拼写。","不同地区读音可能略有差异；在英语语境中通常接近“OO-nuh”。","作为人名时，它更像“专有名词”，不太用于普通词汇搭配；写作时通常首字母大写：Oonagh。"]}
{"word":"oons","summary":{"en":"“oons” is mainly a dialect spelling of “ones,” often meaning “the little ones/children.” In standard writing, use “ones.”","zh":"“oons”主要是方言中对“ones”的拼写，常指“小家伙们/孩子们”。标准书面语一般写“ones”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, especially Scots/Irish English) “ones,” often referring to people or children (e.g., “the wee oons” = the little ones).","zh":"（方言，尤指苏格兰英语/爱尔兰英语）“ones（一些人/一些东西）”，常用来指人或孩子（如“the wee oons”= 小家伙们/小朋友们）。"},"examples":[{"en":"The wee oons are already asleep.","zh":"小家伙们已经睡着了。"},{"en":"Pick the best oons and leave the rest.","zh":"挑最好的那些，剩下的就放着。"}]},{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling that may appear in casual writing, often intended as part of another word (e.g., “balloons,” “spoons”) or as a typo for “ones.”","zh":"一种不规范拼写，常见于随意写作中；可能是某个单词的一部分（如 balloons、spoons），或把“ones”拼错了。"},"examples":[{"en":"Did you mean “ones” (as in “the small ones”) instead of “oons”?","zh":"你是不是想写“ones”（比如“the small ones”）而不是“oons”？"}]}],"synonyms":["ones","the little ones","kids"],"phonetic":"/unz/","extraExplanation":["“oons”作“ones”用法多见于苏格兰/北爱尔兰等地区的口语与文学对白里，常带亲昵或朴实的语气（如“wee oons”很常见）。在标准书面英语中一般写作“ones”。"]}
{"word":"oont","summary":{"en":"“oont” isn’t standard English; you probably mean “won’t” (= will not).","zh":"“oont” 不是标准英语；你可能想写 “won’t”（= will not）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “won’t” (the contraction of “will not”).","zh":"不是标准英语单词。很可能是把 “won’t”（“will not”的缩写）拼错了。"},"examples":[{"en":"I think you meant: “I won’t be late.”","zh":"你可能想写的是：“I won’t be late.”（我不会迟到。）"},{"en":"If you type “oont,” most spell-checkers will suggest “won’t.”","zh":"如果你输入“oont”，大多数拼写检查会建议改成“won’t”。"}]},{"partOfSpeech":"aux.","definition":{"en":"“won’t” = “will not”: used to say you refuse to do something, or something is not going to happen.","zh":"“won’t” = “will not”：用于表示拒绝做某事，或某事不会发生。"},"examples":[{"en":"I won’t answer that question.","zh":"我不会回答那个问题。"},{"en":"It won’t rain today.","zh":"今天不会下雨。"},{"en":"The door won’t open.","zh":"门打不开。（常指“怎么都打不开/不肯开”）"}]}],"synonyms":["will not","refuse to (contextual)"],"phonetic":"/woʊnt/","extraExplanation":["“won’t” 的写法不规则：它来自 “will not”，而不是按规则缩写成 “willn’t”。日常口语和书面英语里都非常常见。","“The door won’t open” 这种用法常带一点“怎么弄都不行/不配合”的感觉（用于物品或机器的“不给力”）。"]}
{"word":"oooo","summary":{"en":"“oooo” is an informal sound meaning “oooh!” to show surprise/admiration or discomfort; spelling varies.","zh":"“oooo”是非正式的拟声写法，相当于“oooh!”，可表示惊讶/赞叹，也可表示不适；拼写不固定。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"used to show surprise, admiration, interest, or teasing (often written as “ooo” or “oooo”)","zh":"（多写作“ooo/oooo”）表示惊讶、赞叹、好奇，或带点调侃的起哄声"},"examples":[{"en":"Oooo, that cake looks amazing!","zh":"哇哦，那块蛋糕看起来太棒了！"},{"en":"Oooo, are you going on a date?","zh":"哦哟，你这是要去约会吗？"},{"en":"The crowd went, “Oooo!” when the magician made the coin disappear.","zh":"魔术师让硬币消失时，人群发出“哦——！”的惊叹声。"}]},{"partOfSpeech":"int.","definition":{"en":"used to show that you feel cold, hurt, or uncomfortable (a drawn-out sound)","zh":"（拖长音）表示觉得冷、疼或不舒服"},"examples":[{"en":"Oooo… that water is freezing.","zh":"呜……这水也太冰了。"},{"en":"Oooo, I bumped my knee.","zh":"嘶……我撞到膝盖了。"}]}],"synonyms":["oooh","ooh","wow","oh"],"phonetic":"/uː/","extraExplanation":["“oooo”没有固定拼写，常见还有“ooo/oooh/ooh”。字母越多通常表示声音更长、情绪更强。","在网络聊天里，“oooo”也常用来表示“有戏/有瓜/有点意思”的起哄语气，接近中文的“哦豁/哟/哇哦”。","更正式的书面表达一般会用“oh”或“wow”，而“oooo/oooh”更口语、更拟声。"]}
{"word":"oop","summary":{"en":"“oop” is an informal interjection used when you make a small mistake or have a minor mishap, similar to “oops.”","zh":"“oop”是非正式感叹词，用于表示小失误或小意外，意思类似“oops”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An informal sound you say when you make a small mistake, bump into something, or nearly drop something (similar to “oops!”).","zh":"非正式感叹词：用来表示自己小失误、碰到东西或差点掉东西时的声音（类似“oops!”）。"},"examples":[{"en":"Oop—sorry! I didn’t see you there.","zh":"Oop——对不起！我没看到你在那儿。"},{"en":"Oop! I almost dropped my phone.","zh":"Oop！我差点把手机掉了。"},{"en":"Oop, wrong button.","zh":"Oop，按错按钮了。"}]}],"synonyms":["oops","whoops","uh-oh"],"phonetic":"/uːp/","extraExplanation":["“oop”多见于口语、聊天和字幕里，是一种比较轻的“失误/惊讶”反应声，语气通常比“oops”更短、更随意。","有时也会写作“oop!”或“oop—”，用于表现动作瞬间的停顿或尴尬。"]}
{"word":"oopack","summary":{"en":"“Oopack” isn’t a standard English word; it’s probably a name or a misspelling (often read as “OOP pack”).","zh":"“oopack” 不是标准英语词；多半是专有名词或拼写/连写形式（常被理解为 “OOP pack”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username/product name, or a blend of “OOP” + “pack.”","zh":"不是标准英语单词。更可能是拼写错误、用户名/产品名，或由 “OOP” + “pack” 组合而成。"},"examples":[{"en":"I couldn’t find “oopack” in a dictionary—did you mean “OOP pack” (a package for object-oriented programming)?","zh":"我在词典里查不到 “oopack”——你是不是想说 “OOP pack”（面向对象编程的一个软件包）？"},{"en":"If “oopack” is a brand name, please share the sentence where you saw it.","zh":"如果 “oopack” 是品牌名，请把你看到它的句子发我。"}]}],"phonetic":"/ˈuːpæk/","extraExplanation":["“oopack” 常见可能性：\n1）把两个词连写：OOP + pack（软件开发里“面向对象编程的包/套件”）。\n2）拼写接近的词：open pack（打开包装）、OOP+ack（不常见）。\n3）专有名词：用户名、公司名、产品名。\n如果你告诉我它出现的上下文（一句话/截图/领域：编程、物流、游戏等），我可以更准确判断。","常见缩写补充：OOP 可能指 object-oriented programming（面向对象编程）、out of print（绝版）、out of pocket（自掏腰包/不在岗位）。"]}
{"word":"oopak","summary":{"en":"“oopak” isn’t standard English; it most likely refers to “opaque,” meaning “not transparent” or “hard to understand.”","zh":"“oopak”不是标准英文；很可能是想写“opaque”，意思是“不透明的”或“难懂的/不清晰的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “opaque.”","zh":"不是标准英文单词，很可能是把 “opaque” 拼错了。"},"examples":[{"en":"Did you mean “opaque”? The glass is opaque, so you can’t see through it.","zh":"你是不是想写 “opaque”？这块玻璃是不透明的，所以看不穿。"},{"en":"If you search for “oopak” online, you may get results for “opaque.”","zh":"如果你在网上搜 “oopak”，可能会出现与 “opaque” 相关的结果。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “opaque”) Not able to be seen through; not transparent.","zh":"（如果你想写 “opaque”）不透明的；看不穿的。"},"examples":[{"en":"The bathroom window is opaque for privacy.","zh":"浴室窗户用不透明玻璃来保护隐私。"},{"en":"Dark curtains can make the room feel more opaque and closed in.","zh":"深色窗帘会让房间感觉更不透光、更封闭。"},{"en":"The liquid turned opaque when it cooled.","zh":"液体冷却后变得浑浊不透明。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “opaque”) Hard to understand; not clear or straightforward.","zh":"（如果你想写 “opaque”）难懂的；不清晰的；晦涩的。"},"examples":[{"en":"The instructions are so opaque that I’m not sure what to do.","zh":"说明太晦涩了，我不确定该怎么做。"},{"en":"His explanation sounded opaque to beginners.","zh":"他的解释对初学者来说听起来很难懂。"}]}],"synonyms":["opaque: cloudy","opaque: frosted","opaque (figurative): unclear","opaque (figurative): obscure"],"phonetic":"/oʊˈpeɪk/","extraExplanation":["“opaque”在英语里既可以描述“物理上不透明”（看不穿），也可以比喻“表达/规则不透明、难理解”。写作中常见搭配：opaque glass（磨砂/不透明玻璃）、opaque explanation（晦涩的解释）、opaque system（不透明的制度/流程）。","如果你原本想表达“OP（面向对象编程）”相关内容，“OOP”是缩写，通常不会写成“oopak”。你也可以告诉我你想表达的句子，我帮你确认正确拼写。"]}
{"word":"oophoralgia","summary":{"en":"Oophoralgia means pain in an ovary (ovarian pain).","zh":"oophoralgia 指卵巢疼痛（卵巢痛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pain in an ovary; ovarian pain.","zh":"卵巢痛；卵巢部位的疼痛。"},"examples":[{"en":"She reported oophoralgia on the right side during her period.","zh":"她说月经期间右侧出现卵巢痛。"},{"en":"The doctor evaluated her oophoralgia to rule out an ovarian cyst.","zh":"医生评估她的卵巢痛，以排除卵巢囊肿的可能。"}]}],"synonyms":["ovarian pain","ovary pain"],"phonetic":"/ˌoʊəfɔːrˈældʒə/","extraExplanation":["这是一个较少见、偏医学的词。词根可拆解为：oophor-（卵巢，来自希腊语，意为“携带卵子/卵”）+ -algia（疼痛）。在日常英语中更常说 ovarian pain（卵巢疼痛）。","若你在英文医疗语境看到类似词尾 -algia，通常表示“疼痛”（如 neuralgia 神经痛）。"]}
{"word":"oophorauxe","summary":{"en":"“Oophorauxe” is a rare botanical term for abnormal enlargement or increased growth of a plant ovary.","zh":"“Oophorauxe” 是一个罕见的植物学术语，指植物子房的异常增大或生长增强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, rare) An abnormal enlargement or increased growth of a plant’s ovary (the part that later becomes fruit), often discussed in older botanical texts.","zh":"（植物学，罕见）植物子房（后来会发育成果实的部分）的异常增大或生长增强，常见于较早期的植物学文献中。"},"examples":[{"en":"The researcher described oophorauxe in the flower after treatment with a growth hormone.","zh":"研究者描述了该花在施用生长激素后出现的子房增大（oophorauxe）。"},{"en":"In some older books, oophorauxe is mentioned as a sign of unusual ovary development.","zh":"在一些较旧的书里，oophorauxe 被提到是子房发育异常的迹象。"}]}],"synonyms":["ovary enlargement","ovarian growth (botany)","increased ovary growth"],"phonetic":"/oʊˌɑːfəˈrɔːksi/","extraExplanation":["这个词非常冷僻，更多出现在旧式植物学/形态学分类里。现代写作中通常会直接说 “ovary enlargement（子房增大）/ ovary growth（子房生长）”，或改用更具体的机制描述（如与激素、授粉/受精、病虫害刺激相关）。","词源上可拆为 oo-（卵/子房相关，源自希腊语）+ -phor-（携带/承载）+ -auxe（增长、增大）。理解词根有助于猜测含义：与“子房/卵”有关的“增大”。"]}
{"word":"oophore","summary":{"en":"An oophore is a botanical stalk that supports or carries the ovary in some flowers.","zh":"oophore 指某些花中承托或支撑子房的结构（植物学术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A stalk or support that bears the ovary in certain flowers.","zh":"（植物学）某些花中承托子房的柄或支架。"},"examples":[{"en":"In some plants, the ovary is raised on an oophore above the other floral parts.","zh":"在某些植物中，子房由卵托柄（oophore）托起，高于其他花部结构。"},{"en":"The diagram labels the oophore as the thin stalk connecting the ovary to the base of the flower.","zh":"图示把 oophore 标注为连接子房与花基部的细柄。"}]}],"synonyms":["gynophore","ovary stalk"],"phonetic":"/oʊˈɑːfɔːr/","extraExplanation":["词源：来自希腊语 oo-（“卵、卵形结构”）+ -phore（“携带、承载”）。","学习提示：oophore 是偏专业、较少见的植物学术语；在更常见的教材里，你可能更常遇到 gynophore（雌蕊柄/子房柄）这一类近义术语，具体用法取决于植物结构的细分。"]}
{"word":"oophorectomies","summary":{"en":"Oophorectomies are surgeries to remove one or both ovaries.","zh":"Oophorectomies 指切除一侧或双侧卵巢的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the surgical removal of one or both ovaries (plural of oophorectomy)","zh":"卵巢切除术；切除一侧或双侧卵巢的手术（oophorectomy 的复数）"},"examples":[{"en":"After genetic testing, she chose prophylactic oophorectomies to reduce her cancer risk.","zh":"做完基因检测后，她选择了预防性卵巢切除术来降低患癌风险。"},{"en":"The study compared outcomes for women who had oophorectomies during hysterectomy versus those who did not.","zh":"这项研究比较了在子宫切除术同时进行卵巢切除术与未进行卵巢切除术的女性结局差异。"},{"en":"Doctors discussed possible side effects of oophorectomies, including early menopause.","zh":"医生讨论了卵巢切除术可能带来的副作用，包括提前绝经。"}]}],"synonyms":["ovary removal surgeries","oophorectomy (singular)","bilateral oophorectomy","unilateral oophorectomy"],"phonetic":"/ˌoʊ.ə.fəˈrɛk.tə.miz/","extraExplanation":["词源提示：oo-（卵）+ phor-（携带）+ -ectomy（切除术）。医学语境中也会区分 unilateral（单侧）与 bilateral（双侧）oophorectomy。","文化/沟通建议：这个词涉及生殖健康与手术选择，日常交流中更常用更温和的说法，如 “ovary removal surgery（卵巢切除手术）”。在讨论他人经历时，注意尊重隐私与情绪。"]}
{"word":"oophorectomize","summary":{"en":"A medical verb meaning to surgically remove one or both ovaries.","zh":"医学动词，指通过手术切除一侧或双侧卵巢。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to surgically remove one or both ovaries (perform an oophorectomy)","zh":"（通过手术）切除一侧或双侧卵巢；施行卵巢切除术"},"examples":[{"en":"The surgeon decided to oophorectomize the left ovary because of a large tumor.","zh":"由于肿瘤较大，外科医生决定切除左侧卵巢。"},{"en":"In some cases, doctors may oophorectomize both ovaries to reduce the risk of certain cancers.","zh":"在某些情况下，医生可能会切除双侧卵巢，以降低某些癌症的风险。"}]}],"synonyms":["perform an oophorectomy (on)","remove the ovary/ovaries (surgically)","excise the ovary/ovaries"],"phonetic":"/ˌuːfəˈrɛk.təˌmaɪz/","extraExplanation":["这个词非常少见，临床与学术写作中更常用的是名词 oophorectomy（卵巢切除术）或表达为 “perform an oophorectomy on…”。","词源：oo- 表示“卵/卵巢”（与 ovary 同源概念），-ectomy 表示“切除”，动词形式 -ize 表示“使……化/进行……操作”。因此它字面意思就是“进行卵巢切除”。","语境提醒：这是严肃的医学用语，通常出现在病历、研究论文或手术记录中；日常英语里很少直接用这个动词。"]}
{"word":"oophorectomized","summary":{"en":"A medical adjective meaning someone has had one or both ovaries removed by surgery.","zh":"医学形容词，指某人通过手术切除了一个或两个卵巢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Having had one or both ovaries surgically removed.","zh":"（医学）已通过手术切除一个或两个卵巢的；做过卵巢切除术的。"},"examples":[{"en":"The study compared hormone levels in oophorectomized patients and patients who kept their ovaries.","zh":"这项研究比较了已做卵巢切除术患者与保留卵巢患者的激素水平。"},{"en":"After she became oophorectomized, her doctor discussed options for managing menopause symptoms.","zh":"在她做了卵巢切除术后，医生与她讨论了如何管理更年期症状的选择。"}]}],"synonyms":["post-oophorectomy","ovaries removed","surgically menopausal"],"phonetic":"/ˌuːfəˈrɛktəˌmaɪzd/","extraExplanation":["这是一个非常正式的医学用词，日常英语里更常见的表达是：“had her ovaries removed / had an oophorectomy（做了卵巢切除术）”。","词根拆解有助记忆：oophor-（卵巢）+ -ectomy（切除术）→ oophorectomy（卵巢切除术）→ oophorectomized（做过该手术的）。","涉及生殖健康与手术经历的话题可能较敏感；在沟通时可优先使用尊重、以患者为中心的表达，例如询问对方偏好的称呼与信息披露程度。"]}
{"word":"oophorectomizing","summary":{"en":"“Oophorectomizing” means surgically removing the ovaries (performing an oophorectomy).","zh":"“oophorectomizing”指通过手术切除卵巢（进行卵巢切除术）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(medical) Removing a person’s ovaries by surgery; performing an oophorectomy (often said in general terms rather than used in everyday conversation).","zh":"（医学）通过手术切除卵巢；实施卵巢切除术（多见于专业语境，日常较少使用）。"},"examples":[{"en":"The surgeon discussed the risks and benefits before oophorectomizing the patient.","zh":"在为患者进行卵巢切除前，外科医生讨论了风险与收益。"},{"en":"Some older medical texts describe oophorectomizing as a treatment for certain conditions, though practices have changed.","zh":"一些较早的医学文献把卵巢切除作为某些疾病的治疗方式，但如今做法已发生变化。"}]}],"synonyms":["perform an oophorectomy","remove the ovaries","ovariectomize (less common)"],"phonetic":"/oʊˌɑfəˈrɛktəˌmaɪzɪŋ/","extraExplanation":["“oophorectomizing”是动词“oophorectomize”的现在分词/动名词形式；更常见的名词是“oophorectomy（卵巢切除术）”。","词源上由“oophor-（卵巢）”+“-ectomy（切除术）”构成，属于典型医学构词法。","在真实沟通中，医生更常说“perform an oophorectomy（实施卵巢切除术）”或“remove the ovaries（切除卵巢）”。该手术可能出于肿瘤、严重囊肿、遗传高风险等原因，也可能带来激素变化等影响，因此通常需要充分知情同意与评估。"]}
{"word":"oophorectomy","summary":{"en":"Oophorectomy is surgery to remove one or both ovaries.","zh":"oophorectomy 指切除一个或两个卵巢的外科手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove one or both ovaries","zh":"卵巢切除术；切除一个或两个卵巢的外科手术"},"examples":[{"en":"After the oophorectomy, her doctor discussed hormone levels and follow-up care.","zh":"卵巢切除术后，她的医生与她讨论了激素水平和后续护理。"},{"en":"An oophorectomy may be recommended to treat ovarian cancer or reduce cancer risk.","zh":"卵巢切除术可能用于治疗卵巢癌或降低癌症风险。"}]}],"synonyms":["ovary removal","ovariectomy"],"phonetic":"/ˌoʊəfəˈrɛktəmi/","extraExplanation":["词源：oo- 表示“卵/卵巢”，phor- 来自希腊语词根，和“携带/产生”有关，-ectomy 表示“切除术”。因此 oophorectomy 字面含义是“切除卵巢的手术”。","在医学语境中常见相关说法：unilateral oophorectomy（单侧卵巢切除）指切除一侧卵巢；bilateral oophorectomy（双侧卵巢切除）指切除两侧卵巢。也常与 salpingectomy（输卵管切除）一起出现，合称 salpingo-oophorectomy（输卵管-卵巢切除术）。"]}
{"word":"oophoreocele","summary":{"en":"A medical term for a hernia/prolapse of the ovary.","zh":"指卵巢发生疝出或脱出的一种医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hernia or abnormal protrusion (prolapse) of an ovary into or through a nearby structure, such as the pelvic floor or vaginal wall","zh":"（医学）卵巢疝；卵巢异常突出/脱出（卵巢向邻近结构如盆底或阴道壁内/外突出）"},"examples":[{"en":"The pelvic exam suggested an oophoreocele, so imaging was ordered to confirm the diagnosis.","zh":"盆腔检查提示可能有卵巢疝，因此安排了影像检查以确认诊断。"},{"en":"Surgery may be considered if an oophoreocele causes pain or affects surrounding organs.","zh":"如果卵巢疝引起疼痛或影响周围器官，可能会考虑手术治疗。"}]}],"synonyms":["oophorocele","ovarian hernia","ovarian prolapse"],"phonetic":"/ˌoʊəˈfɔrəˌsiːl/","extraExplanation":["这是较少见、偏专业的妇科术语；临床写作中更常见的表达是 oophorocele（卵巢疝/卵巢脱出）或更具体的术语（例如合并输卵管时可见 salpingo-oophorocele）。","词源拆解有助记忆：oo- / oophor-（卵、卵巢）+ -cele（疝、囊状突出）。在非医学语境中很少使用。"]}
{"word":"oophorhysterectomy","summary":{"en":"Oophorhysterectomy means surgery to remove the uterus and one or both ovaries.","zh":"oophorhysterectomy 指切除子宫并切除一侧或双侧卵巢的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to remove the uterus and one or both ovaries (sometimes also including the fallopian tubes, depending on the procedure).","zh":"一种外科手术，用于切除子宫以及一侧或双侧卵巢（有时也可能同时切除输卵管，视具体术式而定）。"},"examples":[{"en":"After discussing all options, the doctor recommended an oophorhysterectomy because of severe disease.","zh":"在讨论了所有选择后，医生因病情严重而建议进行卵巢子宫切除术。"},{"en":"She asked about recovery time and hormone changes after an oophorhysterectomy.","zh":"她询问了卵巢子宫切除术后的恢复时间和激素变化。"}]}],"synonyms":["hysterectomy with oophorectomy","hystero-oophorectomy","(bilateral) salpingo-oophorectomy (related, sometimes more specific)"],"phonetic":"/ˌoʊəfɔrˌhɪstərˈɛktəmi/","extraExplanation":["词源拆解有助记忆：oo-（卵）+ phor（携带/产生）→ oophor- 指“卵巢”；hyster- 指“子宫”；-ectomy 指“切除术”。合起来就是“切除卵巢与子宫的手术”。","临床上更常见、更常写的是 hysterectomy（子宫切除术）与 oophorectomy（卵巢切除术），或用“hysterectomy with (bilateral) oophorectomy / bilateral salpingo-oophorectomy（双侧输卵管卵巢切除术）”来表述更具体的范围。","这是较专业的医学用词，日常沟通中通常会改用更通俗的说法，如“removal of the uterus and ovaries（切除子宫和卵巢）”。"]}
{"word":"oophoric","summary":{"en":"“Oophoric” means related to the ovary or egg-producing structures; it’s mostly used in medical/biological contexts.","zh":"“oophoric”指与卵巢或产卵结构有关，主要用于医学/生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ovary or to producing/containing eggs (ova).","zh":"与卵巢有关的；与产生或含有卵（卵子）有关的。"},"examples":[{"en":"The doctor noted an oophoric cyst on the ultrasound.","zh":"医生在超声检查中发现了一个卵巢（oophoric）的囊肿。"},{"en":"In some insects, oophoric tissues develop as the eggs mature.","zh":"在一些昆虫中，随着卵成熟，会发育出与产卵相关（oophoric）的组织。"}]}],"synonyms":["ovarian","egg-bearing","ovigerous"],"phonetic":"/ˌoʊ.əˈfɔːr.ɪk/","extraExplanation":["这是一个较少见、偏医学/生物学用语的形容词，日常英语中不常用。更常见的表达通常是 ovarian（卵巢的）。","词根提示：oo- 来自希腊语，意为“卵”；-phor- 意为“携带/承载”（同根词如 phosphorus、metaphor 的词源结构中也可见 phor 的“携带”概念）；-ic 表示“……的”。"]}
{"word":"oophoridia","summary":{"en":"Oophoridia are egg-bearing/egg-developing structures described in some animals, mainly invertebrates.","zh":"Oophoridia 指某些动物（多为无脊椎动物）体内用于携卵或育卵的结构（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) specialized egg-bearing or egg-developing structures in some animals (especially invertebrates), used in biological descriptions.","zh":"（复数）某些动物（尤指无脊椎动物）体内的特殊“携卵/育卵”结构或器官，用于生物学描述。"},"examples":[{"en":"In some invertebrates, the oophoridia help protect and develop the eggs.","zh":"在一些无脊椎动物中，oophoridia 有助于保护并发育卵。"},{"en":"The paper describes the shape of the oophoridia under a microscope.","zh":"论文描述了在显微镜下观察到的 oophoridia 的形态。"}]}],"synonyms":["egg-bearing structures","brood chambers","reproductive structures"],"phonetic":"/ˌoʊəfəˈrɪdiə/","extraExplanation":["这是一个较少见的生物学术语，多见于动物学/无脊椎动物解剖学的学术写作中。","词源上常被解释为由希腊语成分构成：oo-（“卵”）+ -phor-（“携带/承载”）+ -idia（复数/小结构的形式）。不同类群中具体指代的结构可能略有差异，需结合上下文（研究对象与器官系统）理解。"]}
{"word":"oophoridium","summary":{"en":"A rare biological term for a small ovary or an ovary-like egg-producing structure.","zh":"一个少见的生物学术语，指小型卵巢或类似卵巢的产卵结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, rare/technical) A small ovary or an ovary-like egg-producing structure; sometimes used for an egg-forming sac (similar to an oogonium) in certain organisms.","zh":"（生物学，少见/专业用语）小型卵巢或类似卵巢的产卵结构；有时也指某些生物中形成卵的囊状结构（类似“卵囊 oogonium”）。"},"examples":[{"en":"In some older biology texts, the term oophoridium is used for an egg-producing sac.","zh":"在一些较旧的生物学教材中，oophoridium 用来指产卵的囊状结构。"},{"en":"Researchers compared the oophoridium to a typical ovary to explain how eggs develop.","zh":"研究者把 oophoridium 与典型卵巢作比较，以说明卵如何发育。"}]}],"synonyms":["ovary","oogonium"],"phonetic":"/ˌoʊəˈfɔrɪdiəm/","extraExplanation":["这个词非常少见，更多时候现代教材会用 ovary（卵巢）或 oogonium（卵囊）等更常见、更明确的术语。","词源上由 oophor-（“携带/产生卵”，与 Greek 词根相关）+ -idium（表示“小”的后缀）构成，所以字面含义接近“一个小的产卵器官”。在不同学科/旧文献中指代可能略有差异，阅读论文时最好结合上下文或作者的定义。"]}
{"word":"oophoridiums","summary":{"en":"“Oophoridiums” is the plural form of a rare term meaning egg-producing reproductive structures in some organisms, often overlapping with “oogonia.”","zh":"“oophoridiums” 是一个罕见术语的复数，指某些生物中产生卵细胞的生殖结构，常与 “oogonia（卵器）” 的概念重叠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of oophoridium: a rare biology term for a small egg-bearing/reproductive structure in certain organisms (especially some algae and other lower plants), essentially referring to an egg-producing organ.","zh":"oophoridium 的复数：一种很少见的生物学术语，指某些生物（尤指部分藻类等低等植物）中携带/产生卵细胞的微小生殖结构，基本相当于“产卵（卵细胞）器官”。"},"examples":[{"en":"In some older botany texts, oophoridiums are described as the structures that contain developing egg cells.","zh":"在一些较早的植物学书籍中，oophoridiums 被描述为容纳正在发育的卵细胞的结构。"},{"en":"The paper mostly uses the term oogonia, but an older source calls them oophoridiums.","zh":"这篇论文主要使用 oogonia（卵器）这个词，但某些旧资料把它们称为 oophoridiums。"}]}],"synonyms":["oogonia","oogoniums","egg-bearing structures"],"phonetic":"/ˌoʊəˈfɔrɪdiəmz/","extraExplanation":["这个词在现代英文文献中非常少见，很多情况下更常用的是 **oogonium / oogonia（卵器/卵器复数）**。如果你是在论文、标本标签或老教材里见到它，往往属于历史用语或不同学派的术语选择。","拼写也容易出错：如果你的原文来自手写或扫描文本，建议核对是否其实是 **oophoridium(s)** 或直接是 **oogonium/oogonia**。"]}
{"word":"oophoritis","summary":{"en":"A medical term meaning inflammation of an ovary.","zh":"医学术语：指卵巢发炎（卵巢炎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of an ovary (one of the female reproductive glands).","zh":"卵巢炎；卵巢的炎症（女性生殖腺之一发生炎症）。"},"examples":[{"en":"The doctor suspected oophoritis after the patient reported pelvic pain and fever.","zh":"病人出现骨盆疼痛和发烧后，医生怀疑是卵巢炎。"},{"en":"Infection can sometimes spread to the ovaries and cause oophoritis.","zh":"感染有时会扩散到卵巢，引发卵巢炎。"}]}],"synonyms":["ovaritis","ovarian inflammation","salpingo-oophoritis (related)"],"phonetic":"/ˌoʊəfəˈraɪtɪs/","extraExplanation":["这是医学术语，日常英语中很少用；临床上更常见的说法是“ovarian inflammation（卵巢炎症）”或在描述盆腔感染时用“pelvic inflammatory disease, PID（盆腔炎）”。","词源拆解：oophor- 来自希腊语，意为“携带卵（卵巢）”；-itis 表示“炎症”（如 bronchitis 支气管炎、appendicitis 阑尾炎）。","相关词：oophoritis 有时也可见同义词“ovaritis（卵巢炎）”；若与输卵管同时发炎，常称“salpingo-oophoritis（输卵管卵巢炎）”。"]}
{"word":"oophorocele","summary":{"en":"Oophorocele is a medical term meaning a hernia (protrusion) of an ovary.","zh":"oophorocele 是医学术语，指卵巢疝，即卵巢发生疝出（异常突出）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hernia (abnormal protrusion) of an ovary, usually through the abdominal wall or into the inguinal (groin) canal","zh":"卵巢疝；卵巢通过腹壁或腹股沟管等部位异常突出的疝"},"examples":[{"en":"The scan suggested an oophorocele, with the ovary displaced into the inguinal canal.","zh":"影像检查提示卵巢疝，卵巢移位进入腹股沟管。"},{"en":"In rare cases, an oophorocele can cause pain if the ovary becomes trapped.","zh":"在少数情况下，若卵巢被卡住，卵巢疝可能引起疼痛。"}]}],"synonyms":["ovarian hernia"],"phonetic":"/ˌoʊəˈfɔr.əˌsiːl/","extraExplanation":["这是一个医学术语，多用于临床记录与影像学报告，日常英语中很少见。","词根有助记忆：oophor- 表示“卵巢”，-cele 表示“疝、突出”。因此字面意思就是“卵巢的疝出”。","相关常见表达：ovarian hernia（卵巢疝）、inguinal hernia involving the ovary（累及卵巢的腹股沟疝）。"]}
{"word":"oophorocystectomy","summary":{"en":"Oophorocystectomy is a surgery to remove an ovarian cyst.","zh":"oophorocystectomy 指“卵巢囊肿切除术”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove an ovarian cyst (while usually preserving the ovary, if possible)","zh":"卵巢囊肿切除术（通常尽量保留卵巢，只切除囊肿）"},"examples":[{"en":"The doctor recommended an oophorocystectomy to remove the cyst and reduce pain.","zh":"医生建议做卵巢囊肿切除术来切除囊肿并减轻疼痛。"},{"en":"After the oophorocystectomy, she needed follow-up visits to monitor healing.","zh":"卵巢囊肿切除术后，她需要复诊以观察恢复情况。"}]}],"synonyms":["ovarian cystectomy","cystectomy (of the ovary)"],"phonetic":"/ˌoʊ.ə.fɔːr.oʊ.sɪˈstɛk.tə.mi/","extraExplanation":["这是一个比较少见、偏医学专业的术语。临床上更常见的说法是 ovarian cystectomy（卵巢囊肿切除术）或 cystectomy of the ovary。","词源拆解有助记忆：oophoro- 表示“卵巢”（源自希腊语 roots），cyst- 表示“囊/囊肿”，-ectomy 表示“切除术”。","与 oophorectomy（卵巢切除术）不同：oophorectomy 通常指切除整个卵巢，而 oophorocystectomy 更强调只切除卵巢上的囊肿。"]}
{"word":"oophoroepilepsy","summary":{"en":"A rare, historical medical term for “ovarian epilepsy,” seizures once believed to be caused by the ovaries.","zh":"一个罕见的历史医学术语，指过去认为由卵巢引起的“卵巢性癫痫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, historical) A type of epilepsy once thought to be caused by problems in the ovaries or female reproductive system; ovarian epilepsy.","zh":"（医学、历史用语）过去曾被认为由卵巢或女性生殖系统问题引起的一种癫痫；又称“卵巢性癫痫”。"},"examples":[{"en":"In older medical writing, some doctors used the term oophoroepilepsy to link seizures to ovarian disorders.","zh":"在较早的医学文献中，有些医生用 oophoroepilepsy 这个词把癫痫发作与卵巢疾病联系起来。"},{"en":"Today, oophoroepilepsy is mostly a historical label rather than a modern diagnosis.","zh":"如今，oophoroepilepsy 多被视为历史标签，而不是现代诊断。"}]}],"synonyms":["ovarian epilepsy (historical)","oophoric epilepsy (rare)"],"phonetic":"/ˌuːfəroʊˈɛpɪləpsi/","extraExplanation":["词源拆解：oophoro- 表示“卵巢”（来自希腊语根），-epilepsy 表示“癫痫”。整体意思就是“与卵巢相关的癫痫”。","该词带有明显的历史背景：在19世纪到20世纪早期，医学界曾将某些女性的癫痫发作与“卵巢/子宫”等因素过度关联，这与当时对女性健康的观念有关。现代医学更倾向用更精确的概念讨论与月经周期相关的发作（如 catamenial epilepsy，月经相关性癫痫），而不会把病因简单归结为卵巢本身。","使用建议：这是非常少见、偏学术史/旧文献的词；在现代医疗交流中通常不使用。"]}
{"word":"oophoroma","summary":{"en":"A medical term meaning a tumor of the ovary (ovarian tumor).","zh":"医学术语，指卵巢肿瘤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tumor of the ovary; an ovarian tumor (a medical term).","zh":"卵巢肿瘤；指发生在卵巢的肿瘤（医学用语）。"},"examples":[{"en":"The scan revealed an oophoroma on the left ovary.","zh":"影像检查显示左侧卵巢有一个卵巢肿瘤。"},{"en":"The doctor explained that an oophoroma can be benign or malignant, so more tests were needed.","zh":"医生解释说卵巢肿瘤可能是良性或恶性，因此需要进一步检查。"}]}],"synonyms":["ovarian tumor","ovarian neoplasm"],"phonetic":"/ˌoʊ.ə.fəˈroʊ.mə/","extraExplanation":["词源：oophor- 表示“卵巢”（来自希腊语 roots，意为“携带卵”），-oma 表示“肿瘤”。合起来就是“卵巢的肿瘤”。","使用提示：在现代临床英语中，更常见、更通用的说法是 ovarian tumor（卵巢肿瘤）或 ovarian neoplasm（卵巢肿瘤/新生物）；oophoroma 较少见，偏学术或旧式术语。"]}
{"word":"oophoromalacia","summary":{"en":"Oophoromalacia means abnormal softening of an ovary (a rare medical term).","zh":"Oophoromalacia 指“卵巢软化”，是一种较少见的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition meaning abnormal softening of an ovary (usually due to disease, degeneration, or injury).","zh":"（医学）卵巢软化：指卵巢组织因疾病、退变或损伤等原因出现的异常软化。"},"examples":[{"en":"The report mentioned oophoromalacia, suggesting degenerative changes in the ovary.","zh":"报告提到卵巢软化，提示卵巢可能存在退行性改变。"},{"en":"In rare cases, oophoromalacia may be discussed in pathology findings.","zh":"在少数情况下，病理结果中可能会讨论到卵巢软化。"}]}],"synonyms":["softening of the ovary","ovarian malacia"],"phonetic":"/ˌoʊəˌfɔːrəˈmeɪləʃə/","extraExplanation":["这是一个较少见的专业医学术语，常见于病理学/解剖学语境，而不是日常英语。","词源可拆解理解：oophoro- 表示“卵巢”（来自希腊语词根），-malacia 表示“软化”（如 osteomalacia 骨软化）。学术阅读中遇到此类词，可通过词根快速推断大意。"]}
{"word":"oophoromania","summary":{"en":"A rare, outdated term for a supposed “ovarian” form of mania; not used in modern medicine.","zh":"一个罕见且过时的词，指过去被认为与卵巢有关的“躁狂”；现代医学基本不用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, medical) A supposed form of mental illness or extreme agitation once believed to be caused by disorders of the ovaries; “ovarian mania.”","zh":"（过时的医学用语）过去曾被认为由卵巢疾病引起的一种精神异常或极度躁动；“卵巢性躁狂”。"},"examples":[{"en":"In some 19th-century medical texts, oophoromania was described as a disorder unique to women.","zh":"在一些19世纪的医学文献中，oophoromania 被描述为女性特有的疾病。"},{"en":"Modern medicine does not use “oophoromania,” because the idea reflects outdated theories about women’s health.","zh":"现代医学不使用“oophoromania”，因为这一概念反映了对女性健康的过时理论。"}]}],"synonyms":["(dated) ovarian mania","(dated) nymphomania","(modern, broader) hypersexuality"],"phonetic":"/ˌoʊfəroʊˈmeɪniə/","extraExplanation":["词源：oophoro-（卵巢）+ mania（躁狂/狂热）。","这是历史性、带偏见色彩的旧术语：19世纪一些西方医学把女性的情绪或行为问题归因于生殖器官（类似“hysteria/歇斯底里”的思路）。如今这些解释被认为缺乏科学依据，也容易强化性别刻板印象。","在现代语境中，更中性的表达通常会根据具体症状使用，如“bipolar disorder（双相情感障碍）”“psychosis（精神病性症状）”“hypersexuality（性冲动亢进）”等，而不是把原因简单归结为卵巢。"]}
{"word":"oophoron","summary":{"en":"Oophoron is a rare biological term meaning the ovary—an egg-bearing organ.","zh":"Oophoron 是一个较少见的生物学术语，意思是“卵巢/产卵器官”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, rare) The ovary; an egg-bearing organ, especially in animals.","zh":"（生物学，较少用）卵巢；产卵/含卵的器官，尤指动物体内产生卵的器官。"},"examples":[{"en":"In some older biology texts, the term oophoron is used for the ovary.","zh":"在一些较早的生物学教材中，会用 oophoron 来指代卵巢。"},{"en":"The female reproductive system includes the uterus and the oophoron (ovary).","zh":"女性生殖系统包括子宫以及 oophoron（卵巢）。"}]}],"synonyms":["ovary"],"phonetic":"/oʊˈɑːfərən/","extraExplanation":["这个词在现代英语里非常少见，日常与医学/生物学写作通常直接用 ovary（卵巢）。","词源来自希腊语：oo- 表示“卵”，-phoron 表示“携带/承载”（可联想到 -phore / -phor 这类词根，如 metaphor 的 -phor）。因此字面意思就是“承载卵的器官”。"]}
{"word":"oophoropexy","summary":{"en":"Oophoropexy is surgery to attach and hold an ovary in a chosen position.","zh":"oophoropexy 指“卵巢固定术”，即通过手术把卵巢固定在特定位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure to fix (attach) an ovary in a particular position, usually by stitching it to nearby tissue.","zh":"卵巢固定术：一种外科手术，通过缝合等方式把卵巢固定在特定位置（附着到附近组织）。"},"examples":[{"en":"After repeated ovarian torsion, the doctor recommended an oophoropexy.","zh":"由于反复发生卵巢扭转，医生建议进行卵巢固定术。"},{"en":"In some cases, surgeons perform oophoropexy to reduce the risk of torsion.","zh":"在一些情况下，外科医生会做卵巢固定术以降低卵巢扭转的风险。"}]}],"synonyms":["ovarian fixation","oophoropexy procedure"],"phonetic":"/ˌoʊəfəˈroʊpɛksi/","extraExplanation":["词源拆解：oo-（卵/卵巢）+ oophor-（卵巢）+ -pexy（外科“固定、缝合固定”）。因此它直译就是“把卵巢固定起来”的手术名称。","常见语境：多见于妇科/生殖医学文献，尤其与“卵巢扭转（ovarian torsion）”的预防或复发处理相关；也可能出现在某些保留生育力的手术计划中。","这是专业医学术语，一般不会在日常英语中使用；在非医疗场景更常见的表达是“surgery to fix the ovary in place（把卵巢固定在原位的手术）”。"]}
{"word":"oophororrhaphy","summary":{"en":"Oophororrhaphy is surgical suturing to repair an ovary.","zh":"oophororrhaphy 指对卵巢进行缝合修补的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical procedure in which an ovary is repaired by suturing (stitching), often after injury, cyst removal, or to preserve ovarian tissue","zh":"卵巢缝合术；用缝线对卵巢进行修补的手术（常见于外伤、囊肿处理后或为保留卵巢组织）"},"examples":[{"en":"After the cyst was removed, the surgeon performed an oophororrhaphy to repair the ovarian tissue.","zh":"切除囊肿后，外科医生进行了卵巢缝合术来修补卵巢组织。"},{"en":"The operative note mentioned oophororrhaphy to control bleeding and preserve the ovary.","zh":"手术记录提到进行了卵巢缝合术，以止血并保留卵巢。"}]}],"synonyms":["ovarian repair","ovarian suturing"],"phonetic":"/ˌuːfəroʊˈræfi/","extraExplanation":["词源：oophoro- 表示“卵巢”，-rrhaphy 表示“缝合/缝补”。这是较为专业的医学术语，日常英语中很少使用，通常出现在手术记录（operative note）、妇科/生殖医学文献或病理与手术编码语境中。"]}
{"word":"oophorosalpingectomy","summary":{"en":"Oophorosalpingectomy means surgically removing an ovary and its fallopian tube.","zh":"oophorosalpingectomy 指外科切除卵巢及其输卵管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove an ovary and its fallopian tube (often on one side or both sides).","zh":"（外科手术）切除卵巢及其输卵管（可为单侧或双侧）。"},"examples":[{"en":"The patient underwent a bilateral oophorosalpingectomy to reduce the risk of ovarian cancer.","zh":"为降低卵巢癌风险，患者接受了双侧卵巢输卵管切除术。"},{"en":"After the oophorosalpingectomy, her doctor discussed hormone changes and follow-up care.","zh":"卵巢输卵管切除术后，医生与她讨论了激素变化和后续护理。"}]}],"synonyms":["salpingo-oophorectomy","ovary and fallopian tube removal"],"phonetic":"/ˌoʊəfɔːroʊˌsæˌlɪndʒɛkˈtoʊmi/","extraExplanation":["这是一个医学/手术术语，常见于病历、手术同意书或医学论文中。词根拆解有助记忆：oophor-（卵巢）+ salping-（输卵管）+ -ectomy（切除术）。","常见相关说法：\n- salpingo-oophorectomy：更常用的同义术语（顺序相反但意思相同）。\n- unilateral / bilateral：单侧 / 双侧。\n- 与 hysterectomy（子宫切除术）可联合出现，但不是同一个手术。","该手术可能出于治疗（如肿瘤、扭转、严重感染）或预防（高风险人群）目的；是否影响生育与激素水平取决于切除范围（尤其是是否双侧切除）。"]}
{"word":"oophorostomy","summary":{"en":"Oophorostomy is a medical term for surgery that creates an opening in an ovary, usually to drain a cyst.","zh":"oophorostomy 指“卵巢造口术”，即在卵巢上开口，通常用于囊肿引流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation that makes an opening into an ovary, usually to drain a cyst or remove contents","zh":"卵巢造口术；在卵巢上建立开口的手术，常用于引流囊肿或清除内容物"},"examples":[{"en":"The surgeon performed an oophorostomy to drain the ovarian cyst.","zh":"外科医生实施了卵巢造口术来引流卵巢囊肿。"},{"en":"Oophorostomy is discussed as one option when simple drainage is needed.","zh":"当仅需要简单引流时，卵巢造口术被讨论为一种选择。"}]}],"synonyms":["ovariostomy (less common)","ovarian drainage (general)"],"phonetic":"/ˌoʊəˌfɔrəˈstɑmi/","extraExplanation":["这是较少见、偏专业的医学术语，多见于妇产科/外科文献与手术记录中，日常英语里很少使用。","词源可拆解为：oophoro-（卵巢）+ -stomy（造口、建立开口的手术），与 colostomy（结肠造口术）等同一构词方式。","在现代临床语境中，具体手术方式更常用更细分的表述（如 cyst drainage、ovarian cystectomy 等），因此该词可能出现在较旧或较学术的资料里。"]}
{"word":"oophorotomy","summary":{"en":"Oophorotomy is surgery to remove an ovary (or part of one).","zh":"oophorotomy 指通过手术切除一个卵巢（或部分卵巢）的卵巢切除术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove an ovary (or part of an ovary).","zh":"卵巢切除术；通过手术切除一个卵巢（或部分卵巢）的手术。"},"examples":[{"en":"After the diagnosis, the doctor discussed whether an oophorotomy was necessary.","zh":"确诊后，医生和她讨论是否需要进行卵巢切除术。"},{"en":"The report notes that an oophorotomy was performed to remove a damaged ovary.","zh":"报告指出，为了切除受损的卵巢，进行了卵巢切除术。"}]}],"synonyms":["oophorectomy","ovariotomy"],"phonetic":"/ˌuːfəˈrɑːtəmi/","extraExplanation":["词源：oo- 来自希腊语“ovum（卵）”，phor- 与“bearing（携带/承载）”有关，-tomy 表示“切开/手术切除”。整体用于医学语境。","临床写法中更常见的相关词有 oophorectomy（卵巢切除术，较常用），以及较旧或较少见的 ovariotomy（同义或近义）。不同术式可能表示切除范围或手术方式不同，具体以医生说明为准。"]}
{"word":"oophyte","summary":{"en":"An oophyte is the diploid plant stage that develops from a fertilized egg (oospore) in some algae and fungi.","zh":"oophyte 指在某些藻类与真菌中由受精卵（卵孢子）发育而成的二倍体植物阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology, botany) A plant or plant-like stage that grows from a fertilized egg (an oospore), i.e., the diploid generation formed after fertilization in some algae and fungi.","zh":"（生物/植物学）由受精卵（卵孢子 oospore）发育而成的植物或植物样阶段；在某些藻类与真菌中指受精后形成的二倍体世代。"},"examples":[{"en":"In some algae, the oophyte develops after fertilization and later produces spores.","zh":"在一些藻类中，受精后会形成卵体（oophyte），之后再产生孢子。"},{"en":"The textbook describes how the oophyte and gametophyte alternate during the life cycle.","zh":"教材描述了在生命周期中卵体（oophyte）与配子体（gametophyte）如何交替出现。"}]}],"synonyms":["sporophyte (often related, context-dependent)","diploid generation"],"phonetic":"/ˈoʊəˌfaɪt/","extraExplanation":["词源提示：oo- 来自希腊语，表示“卵/蛋”，-phyte 表示“植物”。因此 oophyte 字面意思是“由卵形成的植物（阶段）”。","学习要点：oophyte 常见于讲“世代交替”（alternation of generations）的语境，和 gametophyte（配子体）相对；在不同教材里也可能用更常见的术语 sporophyte（孢子体）来表达相近概念，具体取决于该生物的生活史。"]}
{"word":"oophytes","summary":{"en":"Oophytes are organisms (often water molds/oomycetes in older usage) that reproduce via egg cells and form oospores.","zh":"Oophytes 指通过卵细胞繁殖并形成卵孢子的生物（旧用法常指水霉/卵菌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organism (especially a fungus-like water mold or certain algae) that reproduces by forming an egg cell and an oospore after fertilization; an older/less common term often connected with oomycetes.","zh":"一种（尤其指某些“水霉”等类真菌生物或部分藻类）通过形成卵细胞并在受精后产生卵孢子（oospore）来繁殖的生物；较旧、较少用的术语，常与卵菌（oomycetes）相关。"},"examples":[{"en":"Some plant diseases are caused by oophytes such as water molds.","zh":"一些植物病害是由水霉等卵生类生物（oophytes）引起的。"},{"en":"In older textbooks, oomycetes were sometimes described as oophytes.","zh":"在较早的教材中，卵菌（oomycetes）有时会被称为 oophytes。"}]}],"synonyms":["oomycete","water mold"],"phonetic":"/ˈoʊ.ə.faɪt/","extraExplanation":["词源上，oo- 来自希腊语，表示“卵/蛋”，-phyte 表示“植物/生长体”。因此 oophyte 字面意思接近“卵生植物/卵生生物”。","现代生物学中更常用的相关术语是 oomycete（卵菌）或 water mold（水霉）；oophyte 属于偏旧的分类用法，在新文献里不算常见。"]}
{"word":"oophytic","summary":{"en":"“Oophytic” is a rare scientific adjective meaning “related to an ovum (egg cell) or eggs.”","zh":"“oophytic”是一个较少见的科学形容词，意思是“与卵子（卵细胞）或卵/蛋有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, rare) Relating to an ovum (egg cell) or to eggs; egg-based or egg-associated.","zh":"（生物学，较少用）与卵子（卵细胞）或“卵/蛋”有关的；以卵为基础或与卵相关的。"},"examples":[{"en":"Some older papers use the term “oophytic” to describe tissues associated with the ovum.","zh":"一些较早的论文会用“oophytic”来描述与卵子相关的组织。"},{"en":"The author mentioned an oophytic stage in the organism’s life cycle.","zh":"作者提到该生物生命周期中有一个与“卵”相关的阶段。"}]}],"synonyms":["ovarian","ovum-related","egg-related","ovular"],"phonetic":"/oʊˈɑfɪtɪk/","extraExplanation":["这个词非常少见，更多时候学术写作会用更常见的表达，如：ovarian（卵巢的）、ovular/ovum-related（与卵/卵子相关的）、egg-related（与卵/蛋相关的）。","词源上可拆成 oo-（来自希腊语，意为“卵/蛋”）+ -phytic（与“生长/植物”有关的词根形式，常见于 phytic、phyt- 一类词）。因此它在某些旧文献里可能带有“与卵相关的生长/阶段”的意味，但现代用法并不固定。"]}
{"word":"ooplasm","summary":{"en":"Ooplasm is the cytoplasm inside an egg cell, important for nourishing and organizing early development.","zh":"Ooplasm 指卵细胞内的细胞质，对提供营养并组织早期发育很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the cytoplasm of an egg cell (ovum), containing nutrients and substances that support early development after fertilization","zh":"卵细胞（卵子）的细胞质，含有营养与多种物质，用来支持受精后的早期发育"},"examples":[{"en":"In many animals, the ooplasm stores nutrients for the early embryo.","zh":"在许多动物中，卵细胞质会储存营养以供早期胚胎使用。"},{"en":"Researchers observed how proteins move within the ooplasm during cell division.","zh":"研究人员观察了蛋白质在卵细胞质中如何在细胞分裂期间移动。"}]}],"synonyms":["egg cytoplasm","ovum cytoplasm"],"phonetic":"/ˈoʊˌplæzəm/","extraExplanation":["词源小提示：oo- 来自希腊语，表示“卵/蛋”；-plasm 表示“成形的物质、浆”。因此 ooplasm 字面意思接近“卵内的浆状物质”。","在生物学语境中，ooplasm 常与“卵黄（yolk）”“细胞核（nucleus）”“受精（fertilization）”等概念一起出现，用于描述卵细胞内部结构与早期发育所需的物质分布。"]}
{"word":"ooplasmic","summary":{"en":"Ooplasmic means “related to the cytoplasm of an egg cell (ooplasm).”","zh":"Ooplasmic 指“与卵细胞（卵子）内的细胞质（卵质）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ooplasm (the cytoplasm inside an egg cell/ovum).","zh":"与卵质有关的；卵细胞（卵子）内细胞质的。"},"examples":[{"en":"Scientists studied ooplasmic factors that influence early embryo development.","zh":"科学家研究了影响早期胚胎发育的卵质因素。"},{"en":"The mutation affected an ooplasmic protein important for cell division.","zh":"该突变影响了一种对细胞分裂很重要的卵质蛋白。"}]}],"synonyms":["ooplasm-related","cytoplasmic (in eggs)"],"phonetic":"/ˌoʊəˈplæz.mɪk/","extraExplanation":["“ooplasmic”是生物学/医学中的专业词，常见搭配有：ooplasmic factors（卵质因子）、ooplasmic proteins（卵质蛋白）、ooplasmic inheritance（卵质遗传，常与母系遗传相关）。","词源上，oo- 表示“卵/卵子”（同源词：ovum），-plasm 表示“形成的物质/细胞质”（如 cytoplasm 细胞质）。"]}
{"word":"ooplast","summary":{"en":"Outlast means to last longer than someone or something.","zh":"outlast 表示“比……持续更久/更耐用”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to last longer than someone or something; to continue after others have ended or failed","zh":"比……持续更久；在他人或其他事物结束/失败后仍继续存在"},"examples":[{"en":"These batteries outlast the cheaper ones.","zh":"这些电池比便宜的更耐用。"},{"en":"Her influence outlasted her time in office.","zh":"她的影响力在她离任后依然持续。"},{"en":"The small shop managed to outlast several big competitors.","zh":"这家小店竟然撑过了好几家大型竞争对手。"}]}],"synonyms":["last longer than","outlive","endure"],"phonetic":"/ˌaʊtˈlæst/","extraExplanation":["“ooplast”不是常见的英文单词，最接近、最常见的可能是拼写错误：outlast（比……更持久）。如果你原本想查的是别的词（例如：contrast / blast / outcast 等），把上下文句子发我，我可以帮你准确确认。"]}
{"word":"oopod","summary":{"en":"“oopod” is not a standard English word; it’s likely a typo or a name. Context is needed to identify the intended word (often something with “pod”).","zh":"“oopod” 不是标准英语单词；更可能是拼写错误或名称。需要上下文来判断你真正想表达的词（常见与 “pod” 相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“oopod” is not a standard English word in common dictionaries. It may be a misspelling, a made-up name/brand, or a fragment of another word (often words ending in “-pod,” meaning a kind of animal or “foot”).","zh":"“oopod” 不是常见词典里的标准英语单词。它可能是拼写错误、杜撰的名称/品牌，或是某个词的一部分（常见于以 “-pod” 结尾的词，表示某类动物或“足/脚”之意）。"},"examples":[{"en":"I can’t find “oopod” in a dictionary—did you mean “pod” or “iPod”?","zh":"我在词典里找不到 “oopod”——你是不是想写 “pod” 或 “iPod”？"},{"en":"If you meant “-pod,” words like “octopod” and “cephalopod” use that ending.","zh":"如果你想表达的是 “-pod” 这个词尾，那么像 “octopod（八足类）” 和 “cephalopod（头足类）” 都会用到它。"}]}],"phonetic":"/ˈuːpɑːd/","extraExplanation":["英语里 “-pod” 来自希腊语 pous/pod-（“脚、足”）。因此它常出现在动物分类名中：arthropod（节肢动物，“关节+足”）、cephalopod（头足类，“头+足”）。","也可能你想输入的是 “iPod”（苹果早期的音乐播放器）或单词 “pod”（豆荚；小群体）。如果你告诉我出现的上下文（句子/领域），我可以帮你确定正确词形与意思。"]}
{"word":"oopodal","summary":{"en":"“Oopodal” isn’t standard; it likely means “antipodal/opodal: opposite (side), especially on Earth).”","zh":"“oopodal” 不是标准用词；多半指 “antipodal/opodal：相对的（在对面），尤指地球的对面”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of “antipodal” or “opodal,” meaning “on the opposite side.”","zh":"不是标准英语词；很可能是 “antipodal” 或 “opodal” 的拼写错误，意思是“在对面/相对的一侧”。"},"examples":[{"en":"I couldn’t find “oopodal” in a dictionary—did you mean “antipodal” (on the opposite side of the Earth)?","zh":"我在词典里找不到 “oopodal”——你是不是想写 “antipodal”（在地球的对面）？"},{"en":"Australia is often described as roughly antipodal to parts of Europe.","zh":"澳大利亚常被描述为与欧洲某些地区大致处于对跖位置（在地球的对面）。"}]}],"synonyms":["antipodal","opposite","contrary","diametrically opposed"],"phonetic":"/ˌænˈtɪpədəl/","extraExplanation":["“antipodal” 来自希腊语词根：anti-（相对、相反）+ pod-（脚）。原意带有“脚对脚站在相反位置”的画面感，所以常用于地理（对跖点）或比喻意义（观点完全相反）。","“opodal” 这个形式较少见，多作为 “antipodal” 的相关构词出现。在正式写作里通常直接用 “antipodal”。"]}
{"word":"ooporphyrin","summary":{"en":"Ooporphyrin is a porphyrin pigment associated with reddish-brown coloring in some bird eggshells.","zh":"Ooporphyrin（卵卟啉）是与部分鸟类蛋壳红褐色着色有关的卟啉类色素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a porphyrin-type pigment found in some bird eggshells, often responsible for reddish-brown speckling or coloration","zh":"（生物/化学）卵卟啉：存在于部分鸟类蛋壳中的一种卟啉类色素，常导致蛋壳呈红褐色斑点或着色"},"examples":[{"en":"Some brown-speckled eggs get their color partly from ooporphyrin deposited in the shell.","zh":"一些带褐色斑点的鸟蛋，其颜色部分来自沉积在蛋壳中的卵卟啉。"},{"en":"Researchers measured ooporphyrin levels to compare eggshell patterns across populations.","zh":"研究人员测量卵卟啉含量，以比较不同种群之间的蛋壳花纹。"}]}],"synonyms":["eggshell porphyrin","protoporphyrin (often discussed in related research)"],"phonetic":"/ˌoʊ.oʊˈpɔːr.fɪr.ɪn/","extraExplanation":["该词多见于鸟类学与生物色素研究语境。词首 oo- 与“卵/蛋”相关（如 oocyte 卵母细胞），porphyrin（卟啉）是一类常呈红紫色的环状分子家族。","在不少研究中，蛋壳的主要卟啉色素常与 protoporphyrin（原卟啉，尤其是原卟啉 IX）相关；不同文献可能把具体蛋壳卟啉色素用不同名称描述，阅读时可对照上下文与化学结构。"]}
{"word":"oops","summary":{"en":"“Oops” is an informal interjection used when you make a small mistake or something goes slightly wrong.","zh":"“Oops”是非正式感叹词，用于小失误或小状况发生时的“哎呀”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show you made a small mistake, had a small accident, or suddenly realized something (often in a light, informal way).","zh":"（口语）表示自己犯了小错、出了小状况，或突然意识到某事（语气多为轻松、非正式）。"},"examples":[{"en":"Oops—I spilled a little coffee.","zh":"哎呀——我把咖啡洒了一点。"},{"en":"Oops, I forgot to attach the file.","zh":"哎呀，我忘了添加附件。"},{"en":"Oops! Wrong number.","zh":"哎呀！打错电话了。"}]},{"partOfSpeech":"int.","definition":{"en":"Used jokingly or sarcastically to suggest something went wrong or was handled badly.","zh":"（带玩笑/讽刺）表示事情搞砸了，或某人处理得不妥。"},"examples":[{"en":"They sent the email to everyone by mistake—oops.","zh":"他们把邮件误发给所有人了——哎呀（真是失误）。"},{"en":"He promised to be on time… oops.","zh":"他答应会准时……哎呀（结果并没有）。"}]}],"synonyms":["whoops","uh-oh","sorry (less casual)"],"phonetic":"/uːps/","extraExplanation":["“Oops”非常常见于日常口语、短信和社交媒体，语气通常比“sorry”更轻、更随意；如果是比较正式的场合或错误较严重，用“Sorry”或“I apologize”更合适。","在书面表达中常写作“oops!”（加感叹号更强烈），也可在句中单独出现表示自我纠错或突然意识到问题。"]}
{"word":"oopuhue","summary":{"en":"“oopuhue” is not recognized as a standard English word; it’s probably a typo or a name.","zh":"“oopuhue”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a typo, username, or a proper name from another language.","zh":"不是标准英语单词；可能是拼写错误、用户名，或来自其他语言的专有名词/名字。"},"examples":[{"en":"I can’t find “oopuhue” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“oopuhue”——它会不会是拼错了？"},{"en":"If “oopuhue” is a name, please tell me where you saw it so I can explain it better.","zh":"如果“oopuhue”是名字，请告诉我你在哪里看到的，我才能更准确地解释。"}]}],"phonetic":"N/A","extraExplanation":["目前在常见英语词典与语料中没有“oopuhue”的可靠词条记录。它可能是：\n1）拼写输入错误（例如想写 *ooh*, *oops*, *Opahu/ʻŌpū* 等相似形）；\n2）网络昵称/ID；\n3）某种语言（如波利尼西亚语系等）的音译或专名。\n\n你可以补充：它出现的句子/上下文、来源（书/游戏/歌曲/网站）、以及你想表达的意思。我就能判断是否是某个词或短语的误拼，并给出正确释义。"]}
{"word":"oorali","summary":{"en":"“Oorali” is not a common English vocabulary word; it’s usually a proper name or a transliterated term whose meaning depends on context.","zh":"“Oorali” 不是常见英语词汇；多为专有名词或外来词转写，具体含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (e.g., a place name or a person’s name) or as a word from another language used in English writing.","zh":"不是标准英语单词；最常见于专有名词（如地名、人名），或作为其他语言的词在英文文本中出现。"},"examples":[{"en":"I couldn’t find “Oorali” in an English dictionary—do you mean a place or a person?","zh":"我在英语词典里找不到 “Oorali”——你是指一个地名还是人名？"},{"en":"Oorali appears in some texts as a local name, so its meaning depends on the region and language.","zh":"“Oorali” 在一些文本里作为本地名称出现，因此含义取决于地区和语言。"}]}],"phonetic":"/ˈuːrəli/","extraExplanation":["“Oorali” 更像是音译/转写（transliteration）的拼写，而不是英语词汇本身。不同语言（如南亚地区语言）转写到英文时，拼写可能不统一。","如果你是想查英语单词，可能想输入的是：\n- orally（/ˈɔrəli/）= “口头地；通过口腔地”\n- O’Reilly（姓氏）\n你可以告诉我：它出现在哪一句话里、来自哪个国家/地区，或你想表达的中文意思，我就能更准确地判断。"]}
{"word":"ooralis","summary":{"en":"“Ooralis” isn’t standard English; it most likely points to Latin/medical “oralis” = “oral; of/by the mouth.”","zh":"“ooralis”不是标准英语；通常是指拉丁语/医学用语“oralis”，即“口腔的；经口的/口服的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard English spelling) Likely referring to Latin/medical “oralis,” meaning “of the mouth; oral; by mouth.”","zh":"（非标准英语拼写）多半是指拉丁语/医学用语“oralis”，意思是“口的；口腔的；经口的/口服的”。"},"examples":[{"en":"In medical Latin, “via oralis” means “by the oral route (through the mouth).”","zh":"在医学拉丁语中，“via oralis”表示“经口途径（通过口腔）”。"},{"en":"Streptococcus oralis is a bacterium commonly found in the human mouth.","zh":"Streptococcus oralis（口腔链球菌）是一种常见于人类口腔中的细菌。"}]}],"synonyms":["oral","by mouth","buccal"],"phonetic":"/ɔˈrælɪs/","extraExplanation":["“ooralis”本身不常见，通常是拼写错误或把拉丁语词形写进英文里。英文里更常用的是 **oral**（口腔的；口服的）。","在医学、生物学命名中，**-oralis** 常作为拉丁语词尾出现（例如物种名），大意是“与口/口腔相关”。如果你是在处方、解剖或生物分类里看到它，这种用法就很常见。"]}
{"word":"oord","summary":{"en":"Oord is a rare word in English meaning a place or region, often influenced by Dutch/Afrikaans usage.","zh":"Oord 在英语中很少见，一般表示“地方/地区”，常带有荷兰语或南非荷兰语的影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare in modern English) a place or region; sometimes used as a loanword from Dutch/Afrikaans meaning a place, site, or resort.","zh":"（现代英语中很少见）地方、地区；有时作为荷兰语/南非荷兰语（Afrikaans）的借词，表示地点、场所或度假地。"},"examples":[{"en":"The hotel was built in a quiet oord by the sea.","zh":"这家酒店建在海边一个安静的地方。"},{"en":"In some South African writing, oord can mean a locality or settlement.","zh":"在一些南非英语写作中，oord 可以指一个地方或聚居地。"}]}],"synonyms":["place","region","locality","site","resort"],"phonetic":"/ɔrd/","extraExplanation":["“oord”在标准英语词典里通常不算常用词，更常见于荷兰语/南非荷兰语语境（如南非地名、机构名）或作为外来词出现。","如果你本来想查的是“word”（单词、话），请告诉我，我可以给出“word”的常用释义、搭配和例句。"]}
{"word":"oorial","summary":{"en":"“oorial” is not a standard English word; it’s probably a misspelling of “oral,” “aural,” or “oriel.”","zh":"“oorial” 不是标准英语词；很可能是把 “oral / aural / oriel” 拼错或看错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a misreading of another word (commonly “oral,” “aural,” or “oriel”).","zh":"不是标准英语单词。更可能是拼写/识读错误（常见可能是 “oral（口头的）”、“aural（听觉的）” 或 “oriel（凸窗）”。"},"examples":[{"en":"I couldn’t find “oorial” in a dictionary—did you mean “oral” (spoken) or “aural” (related to hearing)?","zh":"我在词典里找不到 “oorial”——你是不是想写 “oral（口头的）” 或 “aural（听觉的）”？﻿"},{"en":"If you meant “oral,” you can say: “We have an oral exam tomorrow.”","zh":"如果你想表达 “oral”，可以说：“We have an oral exam tomorrow.（我们明天有口试。）”"},{"en":"If you meant “aural,” you can say: “Aural skills are important for learning pronunciation.”","zh":"如果你想表达 “aural”，可以说：“Aural skills are important for learning pronunciation.（听辨能力对学习发音很重要。）"}]}],"extraExplanation":["如果你能告诉我它出现的句子或语境（比如截图/整句），我可以更准确判断你想查的是哪个词。常见混淆：\n- oral：口头的、用口说的（口试 oral exam；口头报告 oral presentation）\n- aural：听觉的、与耳朵/聆听有关（aural training 听辨训练）\n- oriel：建筑用语，指“凸窗/飘窗”一类结构（较少见）"]}
{"word":"oorie","summary":{"en":"Oorie is a Scots word meaning dirty, grubby, or scruffy; it can also refer to a dirty-looking person (often a child).","zh":"Oorie 是苏格兰方言词，表示“脏兮兮、邋遢、不整洁”；也可作名词指“脏兮兮的人（常指小孩）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots) dirty or grubby; not clean.","zh":"（苏格兰方言）肮脏的；脏兮兮的。"},"examples":[{"en":"After playing in the rain, the kids came home all oor ie and wet.","zh":"在雨里玩完后，孩子们回家时又湿又脏兮兮的。"},{"en":"Wipe your hands—they’re oor ie from the soil.","zh":"把手擦一擦——都被泥土弄得脏兮兮的了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scots) messy, scruffy, or unkempt in appearance (often about hair or clothes).","zh":"（苏格兰方言）邋遢的；不修边幅的（常形容头发或衣着）。"},"examples":[{"en":"He turned up with an oor ie jacket and wild hair.","zh":"他来时外套很邋遢，头发也乱蓬蓬的。"},{"en":"My room looks a bit oor ie—I need to tidy up.","zh":"我房间看起来有点乱糟糟的——得收拾一下。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, informal) a dirty or scruffy person (often a child).","zh":"（苏格兰方言，非正式）脏兮兮/邋遢的人（常指小孩）。"},"examples":[{"en":"You wee oor ie—go wash your face before dinner.","zh":"你这个小脏鬼——晚饭前先去把脸洗了。"}]}],"synonyms":["dirty","grubby","filthy","messy","scruffy","unkempt"],"phonetic":"/ˈʊri/","extraExplanation":["“oorie”主要见于苏格兰英语/苏格兰语（Scots）的口语与文学里，在正式美式英语里很少用。读到它时，可以把它理解成带一点亲昵或打趣语气的“脏兮兮、邋遢”。","发音常接近“OO-ree”，不同地区（如格拉斯哥、阿伯丁一带）可能略有差异。"]}
{"word":"oory","summary":{"en":"“Oory” isn’t a standard English vocabulary word; it’s usually a name or a misspelling of a similar word.","zh":"“Oory”不是标准英语词汇；通常是人名/网名，或相近单词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a rare proper name (a nickname or spelling variant of names like “Orry”), or as a typo for a similar-looking word (e.g., “oozy,” “oily,” “ory/oryx,” etc.).","zh":"不是标准英语单词；最常见的用法是作为罕见的人名/昵称（也可能是“Orry”等名字的变体拼写），或是把相近单词打错（如“oozy”“oily”等）。"},"examples":[{"en":"I can’t find “oory” in standard dictionaries—did you mean “oozy” or “Orry”?","zh":"我在常见词典里找不到“oory”——你是不是想写“oozy”或“Orry”？"},{"en":"Oory is sometimes used as a personal name in online usernames.","zh":"“Oory”有时会作为人名出现在网名/用户名中。"}]}],"synonyms":["(if you meant oozy)","(if you meant oily)","Orry (name)"],"phonetic":"/ˈʊri/","extraExplanation":["“oory”更像是拼写输入导致的非标准词。为了更准确：你能告诉我它出现在哪个句子里，或你想表达的中文意思吗？我可以据上下文帮你锁定你真正想要的单词（例如：oozy=黏糊糊的/渗出的；oily=油腻的；Orry=人名）。"]}
{"word":"oos","summary":{"en":"OOS usually means “out of stock” in shopping/retail contexts.","zh":"OOS 通常是“缺货（out of stock）”的缩写，多用于购物/零售语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “out of stock,” meaning a product is not currently available to buy","zh":"“out of stock（缺货）”的缩写，表示商品目前没有库存、暂时买不到"},"examples":[{"en":"Sorry, that size is OOS right now.","zh":"不好意思，那个尺码现在缺货（OOS）。"},{"en":"The item went OOS in an hour after the sale started.","zh":"促销开始后一个小时，这个商品就缺货（OOS）了。"}]}],"synonyms":["out of stock","sold out","unavailable"],"phonetic":"/ˌoʊ oʊ ˈɛs/","extraExplanation":["OOS 常见于电商、零售、客服和库存管理语境（商品页、仓库系统、客服回复等）。在正式写作里通常写全称 “out of stock”。","容易与 “oops”（哎呀/糟了）混淆：OOS 是缺货缩写；oops 是感叹词，发音也不同。"]}
{"word":"ooscope","summary":{"en":"An ooscope is a tool for shining light through an egg to inspect what’s inside.","zh":"ooscope 指用光透照鸡蛋来观察内部情况的工具（常写作 ovoscope）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device used to look inside an egg by shining a bright light through it (for example, to check freshness or embryo development).","zh":"照蛋器；用强光透照鸡蛋等蛋类以观察内部情况的装置（如检查新鲜度或胚胎发育）。"},"examples":[{"en":"The farmer used an ooscope to see whether the eggs were fertilized.","zh":"农场主用照蛋器查看这些蛋是否受精。"},{"en":"After a week, the students checked embryo growth with an ooscope.","zh":"一周后，学生们用照蛋器检查胚胎的生长情况。"}]}],"synonyms":["ovoscope","candling lamp","egg candler"],"phonetic":"/ˈoʊvəˌskoʊp/","extraExplanation":["这个词非常少见；更常见、标准的拼写是 ovoscope（照蛋器）或 candling lamp（照蛋灯）。","词源上，-scope 表示“观察的器具”（如 microscope 显微镜）；oo- 可理解为与“egg（卵/蛋）”相关的构词元素（类似来自希腊语的 oon “蛋”）。","使用场景多在家禽孵化、养殖管理或生物教学实验中：通过“透光照看（candling）”判断蛋内是否有血管、胚胎或异常斑点。"]}
{"word":"ooscopy","summary":{"en":"Ooscopy is a medical term meaning an examination of the ear (especially the eardrum) with an otoscope.","zh":"ooscopy 是医学术语，指用耳镜检查耳朵（尤其是鼓膜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Examination of the ear, especially the eardrum, using an instrument (an otoscope).","zh":"（医学）耳镜检查：用耳镜等器械检查耳朵，尤其是鼓膜（耳膜）。"},"examples":[{"en":"The doctor performed an ooscopy to check for an ear infection.","zh":"医生做了耳镜检查，以确认是否有耳部感染。"},{"en":"Ooscopy showed redness and fluid behind the eardrum.","zh":"耳镜检查显示鼓膜发红，鼓膜后方有积液。"}]}],"synonyms":["otoscopy","ear examination","ear exam"],"phonetic":"/oʊˈɑskəpi/","extraExplanation":["“ooscopy”较少见，更常用的术语是“otoscopy（耳镜检查）”。在临床场景中，你更可能在病历、检查单或医学教材里看到“otoscopy”。","词源上与希腊语有关：oo-/oto-（耳）+ -scopy（观察、检查）。因此它与“endoscopy（内镜检查）”“microscopy（显微镜观察）”同属一类构词方式。"]}
{"word":"oose","summary":{"en":"Oose is a rare spelling of “ooze,” meaning to leak out slowly, or thick wet mud.","zh":"oose 是“ooze”的少见拼写，可表示“缓慢渗出”，也可指“稠湿的泥浆/淤泥”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to flow out slowly in small amounts (a rare spelling/variant of “ooze”)","zh":"缓慢渗出、慢慢流出（较少见的拼写形式，相当于“ooze”）"},"examples":[{"en":"After the cut, blood began to oose from the wound.","zh":"割伤之后，血开始从伤口缓慢渗出。"},{"en":"Mud oosed between the stones after the heavy rain.","zh":"大雨过后，泥浆从石头缝里慢慢渗出。"}]},{"partOfSpeech":"n.","definition":{"en":"soft wet earth; thick mud (rare; variant of “ooze”)","zh":"湿软的泥土；稠泥（较少见；相当于“ooze”）"},"examples":[{"en":"The boots sank into the dark oose along the riverbank.","zh":"靴子陷进了河岸边黑色的泥沼里。"}]}],"synonyms":["ooze","seep","leak","trickle","mud","sludge"],"phonetic":"/uz/","extraExplanation":["“oose”在现代英语里很少见，通常写作“ooze”。在阅读旧文本、方言文本或诗歌时可能遇到这种拼写变化。","“ooze/oose”既可指“渗出”的动作，也可指“淤泥、泥沼”。学习时可用“blood oozes（血渗出）”“mud/ooze（泥浆）”这两类常见搭配来记。"]}
{"word":"oosperm","summary":{"en":"An oosperm is a fertilized egg cell (a zygote).","zh":"oosperm 指受精卵（合子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fertilized egg cell (zygote), especially the cell formed when a sperm fertilizes an ovum in animals.","zh":"受精卵；合子（尤其指动物中精子与卵子结合后形成的细胞）。"},"examples":[{"en":"After fertilization, the oosperm begins dividing into an embryo.","zh":"受精后，受精卵开始分裂并发育成胚胎。"},{"en":"In biology class, we learned that an oosperm is the earliest stage of a new organism.","zh":"在生物课上我们学到，受精卵是新个体最早期的阶段。"}]}],"synonyms":["zygote","fertilized egg"],"phonetic":"/ˈoʊəˌspɝːm/","extraExplanation":["“oosperm”是较偏学术、较少在日常英语中使用的词；更常见的表达是“zygote（合子）”或“fertilized egg（受精卵）”。","词源上，“oo-”来自希腊语表示“卵/蛋”，“-sperm”表示“种子/精子”，合起来强调“卵被受精后形成的细胞”。在阅读生物学教材或论文时更可能遇到。"]}
{"word":"oosperms","summary":{"en":"Oosperms are fertilized egg cells (zygotes), a term used mainly in biology/botany.","zh":"oosperms 指受精卵（合子），主要用于生物学/植物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fertilized egg cell (a zygote), especially in plants, algae, and other organisms that reproduce by oogamy","zh":"受精卵（合子）；尤指在植物、藻类等“卵配生殖”（oogamy）的生物中形成的受精卵"},"examples":[{"en":"After fertilization, the ovum becomes an oosperm and begins to divide.","zh":"受精后，卵细胞变成受精卵（oosperm），并开始分裂。"},{"en":"In some algae, the oosperm develops into a new individual.","zh":"在一些藻类中，受精卵会发育成新的个体。"}]}],"synonyms":["zygote","fertilized egg","embryo (early stage)"],"phonetic":"ˈoʊəˌspɝːm","extraExplanation":["“oosperm”较偏学术、较少见，日常英语更常用“zygote（合子）”或“fertilized egg（受精卵）”。","词源上，“oo-”来自希腊语，意为“卵/蛋”；“-sperm”意为“精子/种子”，合起来指“由卵与精子结合形成的受精卵”。","你输入的“oosperms”是复数形式；单数是“oosperm”。"]}
{"word":"oosphere","summary":{"en":"An oosphere is a spherical egg cell in certain plants, algae, and fungi.","zh":"oosphere 指某些植物、藻类与真菌中的球形卵细胞（卵球）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A round (spherical) egg cell found in some plants, algae, and fungi; it can be fertilized to form a new organism.","zh":"（植物、藻类与某些真菌中的）卵球；一种球形的卵细胞，可受精并发育成新个体。"},"examples":[{"en":"In some algae, a sperm cell swims toward the oosphere to fertilize it.","zh":"在一些藻类中，精子会游向卵球并使其受精。"},{"en":"The fertilized oosphere develops into a zygote.","zh":"受精后的卵球会发育成合子。"}]}],"synonyms":["egg cell","ovum"],"phonetic":"/ˈoʊ.ə.sfɪr/","extraExplanation":["词源上可拆成 oo-（与“卵/卵子”相关）+ sphere（球体），因此字面意思就是“卵的球形结构”。","它常出现在讲“卵配生殖（oogamy）”的内容里：较大的、通常不运动的雌性配子（卵球）与较小、常能运动的雄性配子结合形成合子。"]}
{"word":"oospheres","summary":{"en":"“Oospheres” is the plural of “oosphere,” meaning egg cells in certain plants and algae that can be fertilized.","zh":"oospheres 是 oosphere 的复数，指某些植物或藻类等的卵细胞（可受精的雌性生殖细胞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The egg cell (female sex cell) of certain plants and plant-like organisms (such as algae, mosses, ferns, and some fungi), which can be fertilized to form a new organism.","zh":"（某些植物或类植物生物，如藻类、苔藓、蕨类及部分真菌的）卵细胞／雌性生殖细胞，可受精并发育成新个体。"},"examples":[{"en":"Under the microscope, the student identified several oospheres inside the ovule.","zh":"在显微镜下，学生在胚珠里辨认出了几个卵细胞（oospheres）。"},{"en":"In some algae, oospheres remain in place while sperm swim toward them for fertilization.","zh":"在一些藻类中，卵细胞会留在原位，而精子会游向它们完成受精。"}]}],"synonyms":["egg cells","ova (in some contexts)"],"phonetic":"/ˈoʊəˌsfɪrz/","extraExplanation":["“oosphere”来自希腊语词根：oo- 表示“卵”，-sphere 表示“球体”，因此字面含义接近“卵形的小球”。该词多见于生物学/植物学语境，日常英语很少使用。","注意：oospheres 是复数形式；单数是 oosphere。"]}
{"word":"oosporange","summary":{"en":"An oosporange is a reproductive sac where an oospore forms in certain algae and oomycetes.","zh":"oosporange 指某些藻类与卵菌中形成卵孢子的生殖囊状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sac-like reproductive structure in some algae and oomycetes (water molds) where an oospore is formed (often the same as or very similar to an oogonium).","zh":"某些藻类与卵菌（如水霉）中形成卵孢子（oospore）的囊状生殖结构（常与“卵器 oogonium”同义或非常接近）。"},"examples":[{"en":"Under the microscope, the oosporange looks like a small round sac that later contains an oospore.","zh":"在显微镜下，卵孢子囊看起来像一个小圆囊，之后里面会出现卵孢子。"},{"en":"Some plant diseases are caused by oomycetes that form oosporanges during sexual reproduction.","zh":"有些植物病害由卵菌引起，它们在有性生殖时会形成卵孢子囊。"}]}],"synonyms":["oosporangium","oogonium (often used for a similar structure)"],"phonetic":"/ˌoʊ.oʊˈspɔr.eɪndʒ/","extraExplanation":["“oosporange”在英文里比较少见，更常见的术语是“oosporangium”（复数 oosporangia）。在不同教材或学科里，也可能用“oogonium（卵器）”来指非常相近的结构；具体是否同义，取决于研究对象与作者的用法。"]}
{"word":"oosporangia","summary":{"en":"Oosporangia are the plural form of oosporangium: structures where oospores are produced.","zh":"oosporangia 是 oosporangium 的复数，指形成卵孢子的结构（卵孢子囊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of oosporangium: structures in some algae and fungus-like organisms where an oospore (a thick-walled fertilized spore) is formed.","zh":"oosporangium 的复数：某些藻类与类真菌生物中形成卵孢子（受精后、壁较厚的孢子）的结构。"},"examples":[{"en":"Under the microscope, the researcher counted several oosporangia on the infected plant tissue.","zh":"在显微镜下，研究人员统计了受感染植物组织上的多个卵孢子囊。"},{"en":"Oosporangia may help the organism survive harsh conditions because the oospores inside are tough.","zh":"卵孢子囊可能帮助生物在恶劣环境中存活，因为其中的卵孢子很耐受。"}]}],"synonyms":["oosporangiums (less common)"],"phonetic":"/ˌoʊ.oʊ.spəˈræn.dʒi.ə/","extraExplanation":["这个词主要出现在生物学/植物病理学语境，常与卵菌（Oomycetes，如霜霉病、疫霉 Phytophthora）或某些藻类的有性生殖相关。","词形提示：oosporangia 是拉丁化复数；单数是 oosporangium。学术写作中也常直接用单数/复数来对应“一个结构/多个结构”。"]}
{"word":"oosporangium","summary":{"en":"A female reproductive structure in certain algae/oomycetes that contains eggs and can form an oospore.","zh":"某些藻类/卵菌中的雌性生殖结构，含卵细胞，受精后可形成卵孢子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In some algae and fungus-like organisms (especially oomycetes), the female reproductive structure (a kind of sporangium/gametangium) that contains eggs and can develop into an oospore after fertilization.","zh":"在某些藻类和类真菌生物（尤其是卵菌类）中，雌性生殖结构（类似孢子囊/配子囊），内含卵细胞，受精后可形成卵孢子（oospore）。"},"examples":[{"en":"Under the microscope, the researcher identified an oosporangium filled with developing eggs.","zh":"在显微镜下，研究人员辨认出一个充满发育中卵细胞的卵孢子囊。"},{"en":"The pathogen forms an oosporangium during its sexual stage, which later produces a tough oospore.","zh":"这种病原体在有性阶段会形成卵孢子囊，之后产生耐受性很强的卵孢子。"}]}],"synonyms":["oogonium","female gametangium"],"phonetic":"/ˌoʊoʊspəˈrændʒiəm/","extraExplanation":["词源上可拆成 oo-（与“卵/蛋”有关）+ sporangium（孢子囊，意为“产生孢子的囊状结构”）。因此它常被用来指“与卵孢子形成相关的囊状雌性结构”。","在很多教材与论文中，更常见的术语是 oogonium（卵器）。有些作者会把 oosporangium 当作 oogonium 的近义词或强调其“形成卵孢子”的功能；不同学科/文献用法可能略有差异。"]}
{"word":"oospore","summary":{"en":"An oospore is a thick-walled resting spore formed after fertilization in some algae and fungus-like organisms.","zh":"oospore 指某些藻类与真菌/卵菌在受精后形成的厚壁休眠孢子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick-walled, resting spore formed after fertilization in certain algae, fungi, and oomycetes; it can survive harsh conditions and later grow into a new organism","zh":"（某些藻类、真菌及卵菌中）受精后形成的厚壁休眠孢子；能在恶劣环境中存活，之后再萌发成新个体"},"examples":[{"en":"The pathogen can overwinter in soil as oospores.","zh":"这种病原体可以以卵孢子的形式在土壤中越冬。"},{"en":"Under the microscope, the oospore appears round with a thick wall.","zh":"在显微镜下，卵孢子呈圆形，细胞壁较厚。"},{"en":"Researchers counted oospores to estimate how severe the infection had been.","zh":"研究人员通过计数卵孢子来估计感染的严重程度。"}]}],"synonyms":["resting spore","sexual spore"],"phonetic":"/ˈoʊ.oʊˌspɔr/","extraExplanation":["“oo-”来自表示“卵”的词根（如 ovum 的相关概念），-spore 表示“孢子”。因此 oospore 字面可理解为“卵状/卵相关的孢子”。","卵孢子常与植物病害研究有关，尤其是卵菌（oomycetes，如疫霉 Phytophthora）产生的耐久结构，可在没有宿主时长期存活，给防治带来困难。","不要与“spore（孢子）”泛指的无性繁殖结构混淆：oospore 通常特指有性生殖后形成的厚壁休眠孢子。"]}
{"word":"oosporeae","summary":{"en":"Oosporeae is an older scientific name for organisms characterized by forming oospores.","zh":"Oosporeae 是一个较旧的科学分类名称，指以形成卵孢子为特征的一类生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific Latin plural name formerly used for a group of organisms (especially water molds/related fungi-like organisms) that produce **oospores** (thick-walled sexual spores). Example: “Some species once placed in Oosporeae can cause plant diseases.”","zh":"（拉丁学名复数）旧时用于指一类会产生**卵孢子**（壁厚的有性孢子）的生物群（常指水霉等“类真菌”生物）。例： “一些曾被归入 Oosporeae 的物种会引起植物病害。”"},"examples":[{"en":"In older biology books, Oosporeae may appear as a classification term for water molds.","zh":"在较早的生物学书籍中，Oosporeae 可能作为水霉等生物的分类名称出现。"},{"en":"Researchers now more often use terms like Oomycetes instead of Oosporeae.","zh":"如今研究者更常用 Oomycetes（卵菌类）等术语，而不是 Oosporeae。"}]}],"synonyms":["(historical/related) Oomycetes","water molds"],"phonetic":"/oʊˈspɔriˌi/","extraExplanation":["这是一个偏“历史分类”的拉丁化名称，现代分类系统可能已不常用；不同教材或年代的文献中，它的覆盖范围可能不一致。","词根提示：oo- 与 “egg（卵）”相关；-spore- 与 “spore（孢子）”相关，整体与“卵孢子（oospore）”这一结构密切相关。"]}
{"word":"oospores","summary":{"en":"Oospores are thick-walled sexual resting spores that help certain algae and water molds survive difficult conditions.","zh":"卵孢子是某些藻类和卵菌形成的厚壁有性休眠孢子，用于在恶劣环境中存活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thick-walled resting spores formed after fertilization (sexual reproduction), especially in oomycetes (water molds) and some algae; they help the organism survive harsh conditions.","zh":"（有性生殖后形成的）厚壁休眠孢子，常见于卵菌（如水霉类）和一些藻类；能帮助生物在恶劣环境中存活。"},"examples":[{"en":"Oospores allow the pathogen to survive in soil through winter.","zh":"卵孢子让这种病原体能在土壤中过冬存活。"},{"en":"Under the microscope, the oospores looked round and had thick walls.","zh":"在显微镜下，卵孢子呈圆形且壁很厚。"},{"en":"Some plant diseases spread when oospores germinate in wet conditions.","zh":"一些植物病害会在潮湿条件下因卵孢子萌发而扩散。"}]}],"synonyms":["resting spores","sexual spores"],"phonetic":"/ˈoʊ.oʊˌspɔrz/","extraExplanation":["“oospore”来自希腊语词根：oo-（卵、蛋）+ -spore（孢子），字面意思接近“卵形/卵产生的孢子”。","在植物病理学里，卵菌（如致病疫霉 Phytophthora）产生的卵孢子常被称为“越冬/越夏结构”，因为它们耐旱、耐冷，可在没有宿主时长期存活。","注意：oospore 与 zygospore 都与有性生殖有关，但并不总是同一类结构；“oospore”更常用于卵菌及部分藻类的语境。"]}
{"word":"oosporic","summary":{"en":"Oosporic means “related to an oospore,” a thick-walled sexual spore.","zh":"oosporic 指“与卵孢子有关的；卵孢子形成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an oospore (a thick-walled sexual spore formed after fertilization in some algae, fungi-like organisms, and plants).","zh":"与卵孢子有关的；卵孢子形成的（卵孢子是某些藻类、类真菌生物或植物在受精后形成的、壁厚的有性孢子）。"},"examples":[{"en":"The pathogen survives winter in oosporic form in the soil.","zh":"这种病原体以卵孢子形态在土壤中越冬。"},{"en":"Researchers examined oosporic structures under the microscope to confirm the species.","zh":"研究人员在显微镜下观察卵孢子结构以确认物种。"}]}],"synonyms":["oospore-forming","oospore-related"],"phonetic":"/oʊˈɑːspɔrɪk/","extraExplanation":["“oosporic”主要用于生物学/植物病理学语境，日常英语中很少出现。词根“oo-”来自希腊语，意为“卵/蛋”，“-spore”意为“孢子”，因此可理解为“与卵孢子相关的”。"]}
{"word":"oosporiferous","summary":{"en":"Oosporiferous means “producing or bearing oospores.”","zh":"oosporiferous 表示“产生或携带卵孢子”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, botany) producing or bearing oospores (thick-walled sexual spores formed after fertilization).","zh":"（生物/植物学）产生或携带卵孢子（受精后形成、壁较厚的有性孢子）。"},"examples":[{"en":"Under the microscope, the sample showed oosporiferous structures typical of oomycetes.","zh":"在显微镜下，该样本显示出典型卵菌类的产卵孢子结构。"},{"en":"The researcher compared oosporiferous and non-oosporiferous strains to study sexual reproduction.","zh":"研究人员比较了产卵孢子与不产卵孢子的菌株，以研究有性生殖。"}]}],"synonyms":["oospore-bearing","oospore-producing"],"phonetic":"/ˌoʊoʊˈspɔrɪfərəs/","extraExplanation":["“oosporiferous”由 oo-（与“卵/卵形”相关）+ spore（孢子）+ -ferous（“携带/产生”的意思，如 *coniferous* “结球果的”）构成，整体就是“产生卵孢子的”。","卵孢子（oospore）常见于卵菌（oomycetes，如疫霉 *Phytophthora*）以及部分藻类的生活史中，通常用于在不利环境下长期存活，因此这个词多出现在科研论文、显微观察记录、分类描述里。"]}
{"word":"oosporous","summary":{"en":"Oosporous means “related to or producing oospores,” a technical biology term.","zh":"oosporous 指“与卵孢子有关/能产生卵孢子的”，是生物学中的专业用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, producing, or containing oospores (thick-walled sexual spores formed by some algae and water molds).","zh":"与卵孢子有关的；能产生或含有卵孢子（某些藻类与水霉等形成的厚壁有性孢子）的。"},"examples":[{"en":"Under the microscope, the researcher identified oosporous structures in the infected plant tissue.","zh":"在显微镜下，研究者在受感染的植物组织中辨认出了含卵孢子的结构。"},{"en":"Some oosporous pathogens can survive harsh winters because their oospores are thick-walled.","zh":"一些会形成卵孢子的病原体能熬过严冬，因为卵孢子的孢子壁很厚。"}]}],"synonyms":["oospore-forming","oospore-bearing"],"phonetic":"/oʊˈspɔrəs/","extraExplanation":["“oosporous”属于生物学/植物病理学里的专业形容词，日常英语里很少见。它来自“oospore（卵孢子）”。在许多教材与论文中，更常见的写法是用“oospore/oospores”来描述孢子本身，或用“oospore-forming（形成卵孢子的）”来描述生物。","卵孢子常与卵菌（oomycetes，如引起霜霉病、疫病的一些类群）相关；它们的厚壁结构使其能在环境不利时长期存活。"]}
{"word":"oost","summary":{"en":"“Oost” is Dutch for “east,” commonly used in place names and labels in Dutch contexts.","zh":"“Oost” 是荷兰语的“东/东方”，常用于荷兰语地名与标识中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Mostly Dutch) “east.” Often seen in place names (for example, a city’s eastern district).","zh":"（多为荷兰语）“东、东方”。常见于地名或区域名中（例如城市的东区）。"},"examples":[{"en":"Amsterdam-Oost is a district in the east of Amsterdam.","zh":"Amsterdam-Oost 是阿姆斯特丹的一个东部城区。"},{"en":"The sign says “Oost,” meaning the direction east.","zh":"路牌上写着 “Oost”，意思是“东”的方向。"}]},{"partOfSpeech":"other","definition":{"en":"A name element in Dutch-language contexts, used in street names, neighborhoods, organizations, etc., to indicate “eastern.”","zh":"在荷兰语语境中用作名称成分，用于街道名、社区名、机构名等，表示“东部的/东方的”。"},"examples":[{"en":"Many Dutch neighborhoods use “Oost” to show they are in the east part of the city.","zh":"很多荷兰语的社区名称会用 “Oost” 来表示它位于城市的东部。"}]}],"synonyms":["east (English)"],"phonetic":"/oʊst/","extraExplanation":["“Oost”不是常见英语单词；它主要是荷兰语词。英语里你最常在荷兰相关的地名、地图、旅游信息中看到它（如“Amsterdam-Oost”）。","读音在英语里通常会被近似成 /oʊst/，但荷兰语原本的元音更接近长“oo”的音。"]}
{"word":"oostburg","summary":{"en":"Oostburg is a city in Wisconsin, USA.","zh":"Oostburg 是美国威斯康星州的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small city in Sheboygan County, Wisconsin, U.S.","zh":"美国威斯康星州谢博伊根县（Sheboygan County）的一座小城市。"},"examples":[{"en":"Oostburg is a quiet community in eastern Wisconsin.","zh":"Oostburg 是威斯康星州东部一个安静的社区。"},{"en":"We drove through Oostburg on the way to Lake Michigan.","zh":"我们去密歇根湖的路上开车经过了 Oostburg。"}]}],"synonyms":["(no direct synonyms; related: Sheboygan County, Wisconsin)"],"phonetic":"/ˈoʊstbɝːɡ/","extraExplanation":["“Oostburg”是专有名词（地名），日常英语中通常不翻译；写作时首字母要大写。","词形上常被认为带有荷兰语/德语色彩：oost（荷兰语“东”）+ burg（“城镇/堡”），反映了美国中西部一些地区的移民与地名来源。"]}
{"word":"oostegite","summary":{"en":"“oostegite” is not a recognized common English word; it’s likely a misspelling or a very specialized/name form.","zh":"“oostegite”不是常见的标准英语词；更可能是拼写错误或非常专业/名称用法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a specialized term, or a name.","zh":"不是常见词典中的标准英语词；可能是拼写错误、某个专业术语，或是人名/地名。"},"examples":[{"en":"I can’t find “oostegite” in a dictionary—could you check the spelling?","zh":"我在词典里找不到“oostegite”——你能确认一下拼写吗？"},{"en":"If you tell me the sentence it appears in, I can guess the intended word.","zh":"如果你告诉我它出现的句子，我可以帮你推测原本想写的词。"}]}],"phonetic":"N/A","extraExplanation":["“oostegite”很像拼写误差。你可以检查是否想写的是这些更常见的词：\n1) osteocyte（骨细胞）\n2) osteophyte（骨赘/骨刺）\n3) osteogenesis（骨生成）\n4) oolitic / oolite（鲕状的 / 鲕粒岩，地质）\n如果你把它出现的上下文（整句、学科领域、来源截图）发我，我能更准确地确认是哪一个。","如果这是某篇论文、药品名、品牌名或人名/地名，也可能不会出现在一般词典里；提供来源会很有帮助。"]}
{"word":"oostegitic","summary":{"en":"“oostegitic” doesn’t appear to be a standard English word; it’s likely a misspelling (possibly of an osteo- medical term).","zh":"“oostegitic”看起来不是标准英文单词；很可能是拼写错误（可能与osteo-骨相关医学词有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized standard English word; it may be a misspelling or a specialized term.","zh":"这不是常见或标准的英文单词；可能是拼写错误或非常专业的术语。"},"examples":[{"en":"I couldn’t find “oostegitic” in a dictionary—could you check the spelling?","zh":"我在词典里找不到“oostegitic”，你能确认一下拼写吗？"},{"en":"If you saw it in a medical text, it might be a misspelling of a bone-related term.","zh":"如果你是在医学文章里看到的，它可能是某个与骨骼有关术语的拼写错误。"}]}],"synonyms":["osteogenic","osteolytic","osteogenicity"],"phonetic":"N/A","extraExplanation":["从拼写来看，它很像医学词根 **osteo-**（表示“骨”）。你可能想写的是：\n- **osteogenic**（成骨的，促骨生成的）\n- **osteolytic**（溶骨的，导致骨质破坏的）\n- **osteogenicity**（成骨性）\n如果你把原句（上下文）贴出来，或告诉我你想表达的中文意思/领域（医学、地质、游戏名等），我可以更准确地判断。"]}
{"word":"oosterbeek","summary":{"en":"Oosterbeek is a village in the Netherlands near Arnhem, especially known for WWII (Operation Market Garden / Battle of Arnhem).","zh":"Oosterbeek 是荷兰靠近阿纳姆的村庄，尤其因二战（市场花园行动／阿纳姆战役）而知名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A village in the eastern Netherlands (province of Gelderland), near Arnhem; known internationally for its role in World War II history.","zh":"荷兰东部海尔德兰省的一个村庄，靠近阿纳姆；因二战历史而在国际上较为知名。"},"examples":[{"en":"Oosterbeek is a quiet village near Arnhem.","zh":"奥斯特贝克是一个靠近阿纳姆的宁静村庄。"},{"en":"Many visitors go to Oosterbeek to learn about the Battle of Arnhem.","zh":"许多游客前往奥斯特贝克了解阿纳姆战役。"}]}],"synonyms":["(place name)","Arnhem (nearby city)","Gelderland (province)"],"phonetic":"/ˈoʊstərˌbeɪk/","extraExplanation":["“Oosterbeek”常出现在二战语境中：1944年“市场花园行动”（Operation Market Garden）期间，英军空降部队在该地区作战并防守，因此这里与“阿纳姆战役”（Battle of Arnhem）密切相关。","当地的 Oosterbeek War Cemetery（奥斯特贝克战争公墓）是重要纪念地；每年会举行纪念活动。","拼写提示：这是荷兰地名，常见误拼如 *Oosterback*。阅读英文史料时也可能见到与 Arnhem、Airborne 等词一起出现。"]}
{"word":"oot","summary":{"en":"“Oot” is either a dialect way of writing “out” (especially Scottish) or a texting abbreviation meaning “out of town.”","zh":"“oot”要么是“out”的方言写法（尤其苏格兰），要么是聊天缩写，表示“out of town（外出不在城里）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A dialect spelling/pronunciation of “out,” especially associated with Scottish English (and sometimes stereotypically with parts of Canada).","zh":"“out”的方言拼写/发音，常与苏格兰英语相关（有时也被刻板地联系到加拿大某些地区）。"},"examples":[{"en":"I’m going oot for a walk.","zh":"我要出去散步。"},{"en":"He went oot last night and came back late.","zh":"他昨晚出去了，很晚才回来。"}]},{"partOfSpeech":"other","definition":{"en":"Text abbreviation for “out of town.”","zh":"短信/聊天缩写：out of town（不在城里、外出）。"},"examples":[{"en":"Can’t meet today—I’m OOT until Sunday.","zh":"今天见不了——我外出到周日才回。"},{"en":"She’s OOT on business this week.","zh":"她这周出差不在城里。"}]}],"synonyms":["out (dialect form)","out of town (OOT)"],"phonetic":"/ut/","extraExplanation":["“oot”常见于书写中用来模仿苏格兰口音（把“out”写成“oot”），多用于对话、文学或网络玩笑里；正式写作一般仍写“out”。","如果你是在社交媒体上看到全大写“OOT”，要结合语境：它更可能是缩写（out of town），而不是方言拼写。"]}
{"word":"ootheca","summary":{"en":"An ootheca is an insect egg case that holds and protects multiple eggs.","zh":"ootheca 指昆虫的卵鞘（卵囊），用于容纳并保护多枚卵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protective egg case produced by some insects (such as cockroaches and mantises) that contains a group of eggs.","zh":"（某些昆虫如蟑螂、螳螂等产生的）卵鞘；装有一团卵的保护性卵囊。"},"examples":[{"en":"We found a cockroach ootheca behind the refrigerator.","zh":"我们在冰箱后面发现了一个蟑螂的卵鞘。"},{"en":"A mantis ootheca can contain dozens of eggs.","zh":"螳螂的卵鞘里可能有几十枚卵。"},{"en":"The ootheca protects the eggs from drying out and from many predators.","zh":"卵鞘能保护卵不被风干，也能抵御不少天敌。"}]}],"synonyms":["egg case","egg capsule"],"phonetic":"/ˌoʊ.əˈθiː.kə/","extraExplanation":["词源来自希腊语：oo-（“卵”）+ thēkē（“盒子、容器”），字面意思就是“装卵的盒子”。","不同昆虫的卵鞘外观差异很大：蟑螂卵鞘常呈棕色胶囊状；螳螂卵鞘常像泡沫硬化后的团块，常附着在树枝或墙面。","在日常英语里这是偏生物学/昆虫学的词；更口语的说法有时会说“egg case”（卵囊/卵盒）。"]}
{"word":"oothecae","summary":{"en":"Oothecae are the egg cases of certain insects.","zh":"Oothecae 指某些昆虫的卵鞘（卵囊/卵盒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ootheca: egg cases made by some insects (such as cockroaches and praying mantises) to protect and hold their eggs","zh":"ootheca 的复数：某些昆虫（如蟑螂、螳螂）产下的“卵鞘/卵囊”，用来包裹并保护卵"},"examples":[{"en":"We found several oothecae stuck to the underside of the shelf.","zh":"我们在架子底面发现了好几个黏着的卵鞘。"},{"en":"Praying mantis oothecae often look like small, foamy lumps on branches.","zh":"螳螂的卵鞘常常看起来像树枝上的小块泡沫状团块。"}]}],"synonyms":["egg cases","egg capsules"],"phonetic":"/ˌoʊəˈθiːki/","extraExplanation":["“ootheca”源自希腊语：oo- 表示“卵”，-theca 表示“容器/鞘”。因此 oothecae（复数）直观意思就是“装卵的鞘/壳”。","在日常英语里这个词比较偏生物学/昆虫学语境；一般谈到害虫时也可能会用到，尤其是蟑螂的卵鞘。"]}
{"word":"oothecal","summary":{"en":"Oothecal means “connected with an insect egg case (ootheca).”","zh":"oothecal 意为“与（昆虫的）卵鞘/卵囊有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an ootheca (a protective egg case made by some insects and other animals).","zh":"与卵鞘有关的；卵鞘的（卵鞘是某些昆虫等产生的保护性卵囊/卵盒）。"},"examples":[{"en":"A praying mantis attaches its oothecal case to a branch for protection.","zh":"螳螂会把卵鞘固定在树枝上以获得保护。"},{"en":"Researchers compared the oothecal structure of different cockroach species.","zh":"研究人员比较了不同蟑螂物种的卵鞘结构。"}]}],"synonyms":["ootheca-related","egg-case (related)"],"phonetic":"/ˌoʊ.əˈθiː.kəl/","extraExplanation":["“oothecal”是比较偏生物学/昆虫学的词，来自“ootheca（卵鞘）”。词源可拆为希腊语 ōion（蛋、卵）+ thēkē（容器、盒子）。日常英语中不常用，多见于科普或学术描述。"]}
{"word":"ootid","summary":{"en":"An ootid is a brief stage in egg development right after meiosis II, just before it becomes a mature ovum.","zh":"ootid 指卵子发育中完成减数第二次分裂后、成为成熟卵之前的短暂阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cell formed in the ovary after a secondary oocyte completes meiosis II; it quickly develops into a mature ovum (egg cell).","zh":"（生物学）卵细胞发生过程中，次级卵母细胞完成减数第二次分裂后形成的细胞；通常很快进一步发育为成熟卵（卵细胞）。"},"examples":[{"en":"In human reproduction, the ootid is a short-lived stage that soon becomes an ovum.","zh":"在人类生殖过程中，卵细胞前体（ootid）是一个很短暂的阶段，很快就会变成成熟卵（ovum）。"},{"en":"The diagram labels the ootid after meiosis II.","zh":"这张示意图在减数第二次分裂后标出了卵细胞前体（ootid）。"}]}],"synonyms":["egg cell (general)","oocyte (related)","ovum (next stage)"],"phonetic":"/ˈoʊˌtɪd/","extraExplanation":["“ootid”主要用于生物学/解剖学语境，日常英语里几乎不会出现。它属于卵子发生（oogenesis）的术语：初级卵母细胞（primary oocyte）→次级卵母细胞（secondary oocyte）→完成减数第二次分裂后形成ootid→成熟卵（ovum）。","词根上，oo- 与“egg（卵）”有关（类似 oocyte 卵母细胞），-tid 表示一种形态/阶段。"]}
{"word":"ootids","summary":{"en":"“Ootids” are haploid cells in late oogenesis that mature into ova (egg cells).","zh":"“Ootids” 指卵子发生后期出现的单倍体细胞，随后成熟为卵细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ootid: a haploid cell formed during oogenesis (egg formation) after meiosis, which then matures into an ovum (egg cell).","zh":"ootid 的复数：在卵子发生（形成卵细胞）的过程中，经减数分裂后形成的单倍体细胞，随后会成熟为卵细胞（ovum）。"},"examples":[{"en":"After meiosis II, the secondary oocyte produces an ootid and a polar body.","zh":"在减数第二次分裂后，次级卵母细胞会产生一个 ootid 和一个极体。"},{"en":"In many textbooks, you may see the term “ootids” when describing the late stages of oogenesis.","zh":"在许多教材中，描述卵子发生的后期阶段时会看到“ootids”这个词。"}]}],"synonyms":["immature ovum (context-dependent)","haploid egg cell (general description)"],"phonetic":"/ˈoʊ.tɪdz/","extraExplanation":["词根提示：oo- 来自希腊语“egg（卵）”，-tid 常用于表示某种细胞或发育阶段的单位。理解词根有助于记忆它与“卵/卵细胞发育”有关。","使用场景：ootid 是生物学/胚胎学术语，日常英语中很少用到；更常见的相关词包括 oocyte（卵母细胞）和 ovum（卵细胞）。"]}
{"word":"ootocoid","summary":{"en":"ootocoid is a very rare form, likely a spelling variant of otocoid, meaning “ear-shaped” or “related to the ear.”","zh":"ootocoid 极为罕见，可能是 otocoid 的拼写变体，意思是“耳状的/像耳朵的”或“与耳有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; scientific) Ear-shaped; resembling an ear, or relating to the ear.","zh":"（罕用；科学用语）耳状的；像耳朵的，或与耳朵有关的。"},"examples":[{"en":"The fossil has an otocoid (ear-shaped) structure along one edge.","zh":"这块化石在一侧边缘有一个耳状（otocoid）的结构。"},{"en":"In older descriptions, the writer uses otocoid to describe a curved, ear-like flap.","zh":"在较早的描述中，作者用 otocoid 来形容一个弯曲、像耳朵一样的薄片。"}]}],"synonyms":["otic","auricular","ear-shaped"],"phonetic":"/ˌoʊtəˈkɔɪd/","extraExplanation":["“ootocoid”在现代英语词典中几乎查不到，更多情况下可能是拼写误差或非常罕见的专业词形；常见更可能是“otocoid”（oto- 表示“耳”，-coid 表示“……状/……样的”）。","如果你是在生物/医学语境看到它，也可能你要找的是与内耳有关的词，如“otoconia”（耳石）或“otic”（耳的）。建议你提供原句或领域，我可以帮你确认最准确的词和意思。"]}
{"word":"ootocoidea","summary":{"en":"“ootocoidea” appears to be a scientific taxonomic name rather than a common English word; its exact meaning depends on the biological context.","zh":"“ootocoidea”更像是科学中的生物分类名称而非常见英语词汇；其确切含义取决于具体生物学语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A scientific (Latinized) taxonomic name. It is not a common English vocabulary word, and without a field/context (biology, zoology, paleontology, etc.) its exact reference is unclear.","zh":"一个科学（拉丁化）的生物分类名称。它不是常见英语词汇；若没有学科或上下文（生物学、动物学、古生物学等），很难确定它具体指哪一类生物。"},"examples":[{"en":"I couldn’t find a clear definition of “ootocoidea” in general English dictionaries; it looks like a taxon name used in scientific writing.","zh":"我在一般英语词典里找不到“ootocoidea”的明确释义；它看起来像是科学文献中使用的分类群名称。"},{"en":"If you share the sentence or the organism group, I can explain what Ootocoidea refers to in that context.","zh":"如果你提供原句或它所属的生物类群，我可以在该语境下解释 Ootocoidea 的具体所指。"}]}],"synonyms":["taxon name","scientific name","Latinized classification term"],"phonetic":"/ˌoʊtoʊˈkɔɪdiə/","extraExplanation":["从构词形式看，-oidea 常见于生物分类学中，表示“……类 / ……总科 / ……形”，例如在一些总科（superfamily）名称里会出现。该词也可能是拼写差异或转写（大小写、拉丁词尾）导致检索困难。建议你提供来源（论文/网页链接、上下文句子、或相关物种名称），我就能更准确地给出对应的分类层级与中文译名。"]}
{"word":"ootocoidean","summary":{"en":"A rare scientific adjective meaning “related to the taxonomic group Ootocoidea.”","zh":"一个罕见的科学形容词，意思是“与分类类群 Ootocoidea 有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Ootocoidea, a scientific (zoological) taxonomic group name used in some classifications (especially for certain snails).","zh":"（科学用语）与“Ootocoidea（卵耳螺总科/卵耳螺类群）”有关的；用于某些分类体系中的动物分类名称（多见于某些蜗牛/螺类）。"},"examples":[{"en":"The paper compares shell features in several ootocoidean species.","zh":"这篇论文比较了几种 ootocoidean（卵耳螺类群）物种的壳部特征。"},{"en":"Ootocoidean classifications may differ depending on the author and the database used.","zh":"不同作者和数据库采用的 ootocoidean 分类可能并不一致。"}]}],"synonyms":["ootocoid","Ootocoidea-related"],"phonetic":"/ˌoʊtoʊˈkɔɪdiən/","extraExplanation":["这是一个非常罕见的学术形容词，主要出现在动物分类学/古生物学文献中；一般英语交流几乎不用。","如果你是在文章或数据库里看到它，常见模式是“X is an ootocoidean … / ootocoidean species（某类群物种）”。","不同分类体系可能会调整类群范围或名称；遇到不确定时，可对照具体来源（如学术论文、分类数据库）的上下文与拉丁学名。"]}
{"word":"ootocous","summary":{"en":"“ootocous” is not a recognized English word; it’s probably a misspelling or a specialized name/term.","zh":"“ootocous”不是常见英语单词；更可能是拼写错误或小众专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/term from a specific field.","zh":"不是标准英语单词，可能是拼写错误，或某个领域/专有名词。"},"examples":[{"en":"I can’t find “ootocous” in major English dictionaries—could you share a sentence where you saw it?","zh":"我在主要英语词典里查不到“ootocous”——你能提供它出现的句子吗？"},{"en":"Do you mean “autochthonous” (native to a place) or another similar-looking word?","zh":"你是不是想写“autochthonous”（原生的、本地的）或其他长得很像的词？"}]}],"phonetic":"/ˌuːtoʊˈkoʊəs/","extraExplanation":["“ootocous”很像拼写误差。常见的可能目标之一是 **autochthonous**（/ɔˈtɑkθənəs/，表示“土生土长的、原产于某地的”）。也可能是人名、品牌名，或某个学科的小众术语。","如果你把来源句子贴出来，或告诉我你想表达的中文意思/主题（比如生物、医学、地理、文学），我可以更准确地帮你定位正确单词和用法。"]}
{"word":"oots","summary":{"en":"“Oots” is a Scots dialect form meaning “outs/outside ones,” often used to show Scottish speech or to contrast with “ins.”","zh":"“oots” 多见于苏格兰方言或口音拼写，意思接近“outs/在外的人或物”，常与 “ins” 对比或用来表现苏格兰口音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) plural of “oot” (“out”); used to mean people who are out (not in power) or things that are outside.","zh":"（苏格兰方言）“oot”（相当于 out）的复数；可指“不在位/不掌权的人（在野者）”或“在外面的事物”。"},"examples":[{"en":"After the election, the ins celebrated and the oots complained.","zh":"选举后，当权者庆祝，在野者抱怨。"},{"en":"Keep the muddy boots in the hall with the other oots, not on the carpet.","zh":"把沾泥的靴子和其他放在外面的东西一起放在走廊里，不要放到地毯上。"}]},{"partOfSpeech":"other","definition":{"en":"(Very informal/nonstandard) a spelling that imitates a Scottish pronunciation of “outs” or “out’s,” depending on context.","zh":"（非常口语/非标准）一种模仿苏格兰口音的拼写，语境中可能对应 “outs” 或 “out’s”。"},"examples":[{"en":"In the subtitle, “oots” is used to show the character’s Scottish accent.","zh":"字幕里用 “oots” 来表现角色的苏格兰口音。"}]}],"synonyms":["outs","outsiders","outside ones"],"phonetic":"/uts/","extraExplanation":["“oot” 是苏格兰英语/苏格兰方言中很有代表性的拼写，用来模仿把 out 读得更接近 /ut/ 的发音；在影视作品或文学对白里常用来标记口音（accent spelling）。","“the ins and outs” 在标准英语里意思是“来龙去脉/细节”。在苏格兰语境中你也可能看到变体，如 “the ins and oots”，其中 oots 对应 outs（在外的人/不在位的人）。"]}
{"word":"ootwith","summary":{"en":"“Outwith” means “outside” or “beyond,” used mainly in Scottish/British English.","zh":"“outwith”表示“在……之外/超出……范围”，主要见于苏格兰/英式英语。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(chiefly British, especially Scottish) outside; beyond the limits of.","zh":"（主要英式，尤苏格兰）在……之外；超出……范围。"},"examples":[{"en":"Outwith Scotland, many people don’t use this word.","zh":"在苏格兰之外，很多人不使用这个词。"},{"en":"The meeting is outwith my responsibilities.","zh":"这次会议不在我的职责范围之内。"}]},{"partOfSpeech":"adv.","definition":{"en":"(chiefly British, especially Scottish) outside; not within.","zh":"（主要英式，尤苏格兰）在外面；不在……之内。"},"examples":[{"en":"The office is open, but outwith business hours you need a key card.","zh":"办公室开放，但在办公时间之外你需要门禁卡。"}]}],"synonyms":["outside","beyond","not within"],"phonetic":"/ˌaʊtˈwɪθ/","extraExplanation":["“outwith”在现代英语中带有明显的地区色彩，常见于苏格兰英语及英国正式/法律/行政文本中，用来表达“outside/beyond”。在美式英语里通常用“outside (of) / beyond”。","你输入的“ootwith”很可能是把苏格兰口音里“out”的发音（听起来像“oot”）写成了拼写；标准拼写是“outwith”。"]}
{"word":"ootype","summary":{"en":"Ootype: an egg-forming chamber in certain parasitic flatworms, where eggs are assembled and coated.","zh":"ootype：某些寄生扁形动物体内的“卵形成室”，卵在此被组装并形成卵壳等结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In some parasitic flatworms (especially flukes), the part of the female reproductive system where eggs are formed and coated with materials such as yolk and shell components.","zh":"在某些寄生扁形动物（尤其是吸虫）中，雌性生殖系统里负责“形成卵”的部位；卵在这里与卵黄细胞等物质混合，并形成卵壳等结构。"},"examples":[{"en":"In flukes, fertilization and egg packaging occur around the ootype.","zh":"在吸虫中，受精与卵的“包装”（形成卵壳、混合营养物质等）通常发生在卵形成室（ootype）附近。"},{"en":"The ootype works with nearby glands to help build the egg shell.","zh":"卵形成室（ootype）会与附近的腺体协作，帮助形成卵壳。"}]}],"synonyms":["egg-forming chamber","egg-forming region"],"phonetic":"/ˈoʊ.taɪp/","extraExplanation":["词源提示：oo- 来自希腊语，表示“卵”；-type 在这里与“类型”无关，更接近“部位/结构”的用法。这个词多见于寄生虫学与动物学教材，日常英语中几乎不会用到。","语境补充：ootype 常与 Mehlis' gland（梅利斯腺）一起出现；梅利斯腺分泌的物质参与卵壳形成，因此很多描述会把它们作为一个功能单元来讲。"]}
{"word":"oouassa","summary":{"en":"“oouassa” isn’t recognized as a standard English word; it’s likely a name or a misspelling.","zh":"“oouassa”不是常见标准英语词；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling or a proper name (for example, a place name, brand, username, or a word from another language).","zh":"不是标准英语单词；可能是拼写错误，或是专有名词（如地名、品牌名、用户名），也可能来自其他语言。"},"examples":[{"en":"I couldn’t find “oouassa” in an English dictionary—where did you see it?","zh":"我在英语词典里找不到“oouassa”——你是在哪里看到的？"},{"en":"Is “Oouassa” a place name or someone’s name in your text?","zh":"在你的文本里，“Oouassa”是地名还是人名？"}]}],"phonetic":"/oʊˈwɑsə/","extraExplanation":["“oouassa”看起来像是非英语词或拼写变体。你可以把它出现的完整句子/截图发来，或告诉我来源（歌曲、游戏、地图、聊天等），我就能更准确判断意思与读音。","如果你是想查某个相近拼写的英文词，也可以告诉我你想表达的含义（例如“湖名/城市名/感叹词/人名”），我可以帮你猜测可能的正确拼法并解释。"]}
{"word":"ooze","summary":{"en":"“Ooze” means to flow out slowly and thickly, or to strongly give off a feeling like confidence; it can also be a noun meaning a slow, thick seepage.","zh":"“Ooze”指黏稠液体缓慢渗出/流出；也可比喻强烈地散发某种气质（如自信、魅力）；作名词可指这种缓慢的黏稠渗出物/渗出过程。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to flow out slowly in a thick or sticky way","zh":"（液体）缓慢地、黏稠地渗出/流出"},"examples":[{"en":"Thick mud oozed out of the ground after the storm.","zh":"暴风雨后，黏稠的泥浆从地里慢慢渗了出来。"},{"en":"Honey oozed from the cracked jar.","zh":"蜂蜜从裂开的罐子里慢慢流出来。"}]},{"partOfSpeech":"v.","definition":{"en":"to give off or show a strong feeling or quality (often used with “confidence,” “charm,” etc.)","zh":"（人或事物）散发/流露出强烈的气质或情感（常与“自信、魅力”等搭配）"},"examples":[{"en":"She oozed confidence during the interview.","zh":"她在面试中流露出十足的自信。"},{"en":"The old bookstore oozes charm.","zh":"那家老书店散发着迷人的魅力。"}]},{"partOfSpeech":"n.","definition":{"en":"a slow, thick flow of liquid","zh":"黏稠液体的缓慢渗出/流出"},"examples":[{"en":"An ooze of oil spread across the surface of the water.","zh":"一股油污缓慢地在水面上扩散开来。"},{"en":"The doctor cleaned the ooze from the wound.","zh":"医生清理了伤口渗出的液体。"}]}],"synonyms":["seep","leak","trickle","exude"],"phonetic":"/uz/","extraExplanation":["“ooze”常让人联想到“慢、黏、持续”的感觉，语气上可能带点不舒服或脏黏的画面（如泥浆、脓液、油污）。但用于比喻时（ooze confidence/charm），通常是正面或带夸张效果的表达。","常见搭配：ooze out（渗出/流出）；be oozing with sth（充满/散发出某种特质，如：The place is oozing with history. 这个地方充满历史感）。"]}
{"word":"oozed","summary":{"en":"“Oozed” means “flowed or leaked out slowly,” or (figuratively) “showed a strong quality.”","zh":"“Oozed”表示“缓慢渗出/流出”，也可比喻“强烈地流露某种特质”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of “ooze”) to flow out slowly and steadily, usually from a small opening; to leak.","zh":"（“ooze”的过去式）缓慢而持续地流出，通常从小缝隙渗出；渗漏。"},"examples":[{"en":"Thick mud oozed from the broken pipe.","zh":"浓稠的泥浆从破裂的管道里慢慢渗出来。"},{"en":"Blood oozed from the cut on his finger.","zh":"血从他手指上的伤口慢慢渗出。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense of “ooze”) to show or give off a quality strongly (often used about people, places, or writing).","zh":"（“ooze”的过去式）强烈地流露/散发某种特质（常用于人、地方或文字）。"},"examples":[{"en":"She oozed confidence during the interview.","zh":"她在面试中流露出十足的自信。"},{"en":"The old café oozed charm.","zh":"那家老咖啡馆散发着迷人的气息。"}]}],"synonyms":["leaked","seeped","dripped (slowly)","exuded","emanated"],"phonetic":"/uzd/","extraExplanation":["“ooze”常用于描述“黏稠、缓慢”的流动（如泥浆、树脂、血），所以比普通的“leak/flow”更强调“慢而稠”。","比喻用法里，“ooze + 名词（confidence/charm/sex appeal等）”通常带有“很明显、几乎藏不住地流露”的感觉。"]}
{"word":"oozes","summary":{"en":"“Oozes” means something leaks out slowly, or someone/something strongly shows a quality; it can also be the plural noun “ooze.”","zh":"“oozes”可指（液体/软物）缓慢渗出；也可比喻“明显流露某种特质”；还可作名词“ooze”的复数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a liquid or soft substance) to flow or leak out slowly, often through a small opening","zh":"（液体或软质物）缓慢渗出、慢慢流出（常从小缝隙/小孔）"},"examples":[{"en":"Thick honey oozes from the jar when it’s warm.","zh":"天气暖和时，浓稠的蜂蜜会从罐子里慢慢流出来。"},{"en":"Blood oozed from the cut.","zh":"伤口处有血慢慢渗出来。"},{"en":"Mud oozes between the stones after the rain.","zh":"雨后泥浆会从石头缝里慢慢渗出。"}]},{"partOfSpeech":"v.","definition":{"en":"to show a strong quality in an obvious way (often used for feelings or personality)","zh":"明显流露出某种特质（常指情绪或性格）"},"examples":[{"en":"He oozes confidence in interviews.","zh":"他在面试中自信满满。"},{"en":"Her letter oozes anger.","zh":"她的信字里行间都是愤怒。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “ooze”: soft wet mud or thick slime","zh":"“ooze”的复数：湿软的烂泥；黏稠的淤泥/黏液"},"examples":[{"en":"The boat got stuck in the oozes near the shore.","zh":"小船卡在岸边的淤泥里了。"}]}],"synonyms":["seeps","leaks","drips","trickles","exudes"],"phonetic":"/ˈuːzɪz/","extraExplanation":["“oozes”常见于一般现在时第三人称单数（He/She/It oozes…）。注意发音是 /ˈuːzɪz/，词尾 -es 读成“iz”。","比喻用法很常见：ooze + 抽象名词（confidence, charm, resentment 等），表示“强烈到溢出来、藏不住”。语气通常偏形象、有画面感。"]}
{"word":"oozier","summary":{"en":"“Oozier” means “more oozy”—wetter, muddier, or leaking more thick liquid.","zh":"“oozier”表示“更泥泞／更黏湿／渗出更多黏稠液体”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “oozy”: more wet, muddy, and soft; having more ooze (thick liquid or mud).","zh":"“oozy（泥泞的／渗出黏液的）”的比较级：更潮湿、泥更稠更软；含有更多黏稠液体或烂泥。"},"examples":[{"en":"After the rain, the trail got oozier and harder to walk on.","zh":"下雨后，小路变得更泥泞，更难走了。"},{"en":"This spot is oozier than the rest of the marsh.","zh":"这块地方比沼泽的其他地方更泥、更湿。"},{"en":"The wound looked oozier today, so she called the doctor.","zh":"伤口今天看起来渗出得更厉害，所以她给医生打了电话。"}]}],"synonyms":["muddier","wetter","soggier","slimier"],"phonetic":"/ˈuːziər/","extraExplanation":["“oozier”是由形容词“oozy”加比较级后缀“-er”构成，常用于两者对比（A is oozier than B）。","“ooze”原意是“缓慢渗出”，既可指泥浆/沼泽里的烂泥，也可指伤口渗出的液体；因此“oozy/oozier”在自然环境与医疗描述里都能出现，但描述伤口时语气会比较直白甚至略显不适。"]}
{"word":"ooziest","summary":{"en":"“Ooziest” means “the most oozy”: leaking thick liquid, or (informally) the most sticky/slimy/unpleasant.","zh":"“ooziest”意为“最渗出、最黏稠/最泥泞的”；也可口语比喻“最油腻、最黏糊、最让人不适的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “oozy”) leaking or flowing with a thick liquid; most likely to ooze.","zh":"（“oozy”的最高级）渗出或流出黏稠液体最多的；最会“渗出”的。"},"examples":[{"en":"That was the ooziest piece of cheese on the plate.","zh":"盘子里那块奶酪最“流油/最黏稠”。"},{"en":"After the rain, the ooziest mud collected near the drain.","zh":"下雨后，最稀烂黏滑的泥堆在下水道口附近。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, informal) showing the most sticky, wet, or unpleasantly slimy quality.","zh":"（比喻/非正式）最黏糊、最湿滑、最让人不舒服的那种。"},"examples":[{"en":"This is the ooziest scene in the whole movie—too gross for me.","zh":"这是整部电影里最“黏腻恶心”的一幕，我受不了。"},{"en":"He told the ooziest compliments to get what he wanted.","zh":"他用最油腻的恭维话来达到目的。"}]}],"synonyms":["leakiest","slimiest","gloomiest (figurative mood, not liquid)","soggiest (wet, not thick)","grossest (informal)"],"phonetic":"/ˈuːziɪst/","extraExplanation":["“ooziest”来自形容词“oozy”（渗出的、泥泞黏滑的），加上最高级后缀 -est 构成。常见比较级是“oozier”，最高级是“ooziest”。","字面义常用于奶酪、泥浆、伤口渗液等；比喻义多用于形容让人反感的“油腻/黏糊”的感觉或话语（语气偏口语、带评价色彩）。"]}
{"word":"oozily","summary":{"en":"Oozily means ‘in a slow, thick, seeping way,’ and figuratively ‘in an overly gushy, cloying way.’","zh":"oozily 表示“黏稠缓慢地渗流”，也可比喻为“过分肉麻、甜腻地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow, thick, sticky way, like a liquid that seeps out little by little.","zh":"以缓慢、黏稠、渗出的方式；像液体一点点渗流出来那样。"},"examples":[{"en":"Mud slid oozily down the hillside after the heavy rain.","zh":"大雨过后，泥浆黏黏地、缓慢地从山坡往下滑。"},{"en":"The sauce spread oozily across the plate.","zh":"酱汁黏稠地在盘子上慢慢铺开。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative) In an overly sentimental, “cloying” way; with a soft, unpleasantly gushy tone.","zh":"（比喻）过分甜腻、矫情地；带着让人不舒服的肉麻语气。"},"examples":[{"en":"He spoke oozily about his success, as if he wanted everyone’s approval.","zh":"他谈到自己的成功时语气甜腻得发腻，好像很想得到所有人的认可。"},{"en":"The advertisement thanked customers oozily, trying too hard to sound warm.","zh":"广告用过分肉麻的语气感谢顾客，努力过头反而显得不真诚。"}]}],"synonyms":["slowly","thickly","viscously","clammy","gushily"],"phonetic":"/ˈuːzəli/","extraExplanation":["“oozily”来自动词“ooze”（渗出、慢慢流出）。它既可以描述真实的黏稠流动（泥浆、蜂蜜、融化的奶酪），也常用于描写说话或态度“油腻、肉麻”，带一点负面评价。"]}
{"word":"ooziness","summary":{"en":"Ooziness means a wet, slimy, seeping quality; figuratively, it can mean an overly sentimental, mushy feel.","zh":"Ooziness 指湿黏、渗出的黏湿感；比喻时也可指过度煽情、肉麻的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being wet, soft, and slightly slimy, often with liquid slowly seeping out.","zh":"湿软、略带黏滑（液体缓慢渗出）的状态；黏湿感。"},"examples":[{"en":"After the storm, the path had a swampy ooziness that made walking difficult.","zh":"暴风雨过后，小路变得泥泞黏湿，走路很困难。"},{"en":"The cheese had an unpleasant ooziness around the edges.","zh":"奶酪边缘有一种令人不快的渗液黏湿感。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) An overly soft, sentimental, or “mushy” quality in writing, speech, or behavior.","zh":"（比喻）过于软弱、煽情或“肉麻”的风格或感觉（用于文字、言谈或行为）。"},"examples":[{"en":"Some readers dislike the ooziness of the romance scenes.","zh":"有些读者不喜欢恋爱场景里那种过分肉麻的感觉。"},{"en":"He tried to be kind without any ooziness.","zh":"他努力做到友善，但不显得肉麻。"}]}],"synonyms":["sliminess","muckiness","dampness","seepiness","mushiness"],"phonetic":"/ˈuːzinəs/","extraExplanation":["“ooziness”来自形容词“oozy”（渗出、黏湿的）+ 名词后缀“-ness”（表示“……的状态/性质”）。常用于描写泥地、食物表面渗液、或某种令人不适的黏腻感。","比喻义较口语化，常带轻微贬义，用来批评文字/表演“太煽情、太腻”。"]}
{"word":"oozinesses","summary":{"en":"“Oozinesses” means multiple instances or types of wet, sticky softness that slowly leaks or flows.","zh":"“oozinesses”指多种/多处“湿黏软塌、会慢慢渗出或流动”的状态（ooziness 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being wet, sticky, and soft in a way that slowly leaks or flows (plural of \"ooziness\")","zh":"湿黏、软塌并会缓慢渗出/流动的状态；黏糊糊、湿润渗出的感觉（“ooziness”的复数）"},"examples":[{"en":"The oozinesses of the mud made it hard to walk across the field.","zh":"泥地那种湿黏会渗出的状态让人很难走过去。"},{"en":"Different sauces have different oozinesses when they’re warmed.","zh":"不同的酱料加热后会呈现不同程度的黏稠渗流感。"}]}],"synonyms":["muddiness","sliminess","stickiness","gooeyness","sogginess"],"phonetic":"/ˈuːzinəsɪz/","extraExplanation":["“oozinesses”是名词“ooziness”的复数，来自动词“ooze”（渗出、慢慢流出）。日常英语里更常说“the ooziness of ...”（某物的黏湿渗流感），复数多用于比较“不同种类/不同地方的多种黏湿状态”。","“oozy”（adj.）常形容泥浆、沼泽、融化的奶酪/巧克力等“湿软、黏并会慢慢流”的感觉；“ooze”也可用于比喻：例如“ooze confidence”（流露自信）。"]}
{"word":"oozing","summary":{"en":"“Oozing” describes something leaking out slowly, or someone/something strongly showing a quality (e.g., oozing confidence).","zh":"“oozing”指液体缓慢渗出；也可比喻某人/某物明显流露某种特质（如“自信满满”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “ooze”) flowing or leaking out slowly in small amounts, often through a small opening.","zh":"（“ooze”的现在分词）缓慢地渗出、漏出（少量液体），常从小缝或小孔里出来。"},"examples":[{"en":"Thick mud was oozing from the cracked pipe.","zh":"浓稠的泥浆正从破裂的管子里慢慢渗出来。"},{"en":"Blood was oozing out of the cut.","zh":"伤口里有血在慢慢渗出。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) strongly showing a quality or feeling, as if it were “leaking out” of someone or something.","zh":"（比喻）明显流露出某种特质或情绪，仿佛那种感觉“溢”出来。"},"examples":[{"en":"She walked in, oozing confidence.","zh":"她走进来时自信满满。"},{"en":"The old café was oozing charm.","zh":"那家老咖啡馆充满了迷人的韵味。"}]}],"synonyms":["seeping","leaking","dripping","trickling","exuding"],"phonetic":"/ˈuːzɪŋ/","extraExplanation":["“oozing”常用于搭配“oozing with + 名词（情绪/特质）”，如：oozing with pride（洋洋得意）、oozing with sarcasm（满是讽刺）。这种用法把抽象情绪当作液体来写，语气更生动。"]}
{"word":"oozoa","summary":{"en":"“Oozoa” is a rare, historical biology term for a group of simple organisms (often slime molds) and is not widely used today.","zh":"“Oozoa”是一个罕见的生物学旧称，常指一类简单生物（多与黏菌相关），现代用法不常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical biology) A former group name for certain simple, amoeba-like organisms—especially slime molds—used in older classifications; not common in modern science.","zh":"（生物学旧称）旧式分类中对某些原生生物（尤其是黏菌等变形虫样生物）的类群名称；现代科学中已很少使用。"},"examples":[{"en":"In some older books, slime molds were placed in a group called the Oozoa.","zh":"在一些旧书里，黏菌被归入一个叫 Oozoa 的类群。"},{"en":"The term “Oozoa” is now mostly of historical interest in taxonomy.","zh":"“Oozoa”这个词如今主要只在分类学史中出现。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “oozoon” (a very rare term for an individual organism once discussed in older scientific writing).","zh":"“oozoon”的复数形式（一个非常罕见的词，指旧式科学文献中提到的某个个体生物）。"},"examples":[{"en":"The author described several oozoa found in the sample.","zh":"作者描述了样本中发现的几个 oozoa。"}]}],"synonyms":["(historical) Mycetozoa","slime molds"],"phonetic":"/oʊˈzoʊ.ə/","extraExplanation":["“Oozoa”属于较老的科学用语，不同作者在不同时期可能用它指代不同的“低等生物/原生生物”范围；因此在现代阅读中更像是“历史术语”，常需要结合上下文或原书的分类体系来理解。","如果你是在某本书/文章里看到 oozoa，发我一句原文（或截图），我可以帮你判断它在那篇文本里更接近“黏菌/原生生物”还是其他旧式分类用法。"]}
{"word":"oozoid","summary":{"en":"An oozoid is the solitary asexual form in the life cycle of salps (a kind of tunicate).","zh":"oozoid 指海樽等被囊动物生活史中单独的无性繁殖个体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a solitary, asexually reproducing form in the life cycle of certain tunicates (especially salps), which produces a chain of sexual individuals","zh":"（生物）某些被囊动物（尤指海樽/樽海鞘，salps）生活史中“单独的无性繁殖个体”，会产生一串（链状的）有性个体"},"examples":[{"en":"In salps, the oozoid reproduces asexually and forms a chain of new individuals.","zh":"在海樽的生活史中，oozoid 会进行无性繁殖，并形成一条由新个体组成的链。"},{"en":"Researchers compared the growth of the oozoid with the later sexual stage.","zh":"研究人员比较了 oozoid 与后续有性阶段的生长情况。"}]}],"synonyms":["oozooid (common spelling)","zooid (broader term)"],"phonetic":"/oʊˈzuːɔɪd/","extraExplanation":["更常见的拼写是 **oozooid**（中间多一个 zoo-），来自 **zooid**（“个体/动物体”）这一生物学词根。它常用于描述海樽（salps）“无性世代→产生链状个体→进入有性世代”的交替世代现象。","学习时可以把它理解成：**oozoid = 单独的“母体”个体（无性）**，而它产生的一串链状个体通常会发展为有性个体（在文献中常与 *blastozooid* 等术语一起出现）。"]}
{"word":"oozooid","summary":{"en":"An oozooid is a sexually produced individual (especially in tunicates) that can later reproduce asexually.","zh":"oozooid 指由有性生殖产生的个体（尤指海鞘类），之后常能通过无性方式繁殖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sexually produced individual in the life cycle of some animals (especially tunicates), which then reproduces asexually to form a colony or other stages","zh":"（动物学）某些动物（尤指海鞘类）生活史中由有性生殖产生的个体；它随后通过无性生殖形成群体或进入其他阶段"},"examples":[{"en":"In many tunicates, the oozooid buds asexually to produce a colony of zooids.","zh":"在许多海鞘中，卵形幼体（oozooid）会通过无性出芽产生由多个个体组成的群体。"},{"en":"The textbook contrasts the oozooid stage with later asexually produced zooids.","zh":"教材将卵形幼体（oozooid）阶段与之后由无性生殖产生的个体作对比。"}]}],"synonyms":["sexual zooid","founder zooid"],"phonetic":"/oʊˈzuˌɔɪd/","extraExplanation":["这是一个比较专业的动物学术语，常见于讲“世代交替/复杂生活史”的内容，尤其是海鞘（tunicates/ascidians）等被囊动物的发育与繁殖。","词形来源可拆为 oo-（与“卵/卵细胞”相关的词根）+ zooid（动物体/个体）。oozooid 指“由卵（有性生殖）产生的 zooid”，并强调它往往会再通过出芽等方式无性繁殖。"]}
{"word":"oozy","summary":{"en":"Oozy means wet and muddy like something that oozes; informally, it can also mean a bit drunk.","zh":"Oozy 指“黏湿泥泞、像渗出物一样”的状态；口语中也可指“有点醉/微醺”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Soft, wet, and muddy; like thick liquid slowly seeping or flowing.","zh":"黏湿的；泥泞的；像稠液缓慢渗出/流动的。"},"examples":[{"en":"After the rain, the ground became oozy and hard to walk on.","zh":"下雨后，地面变得又湿又黏，很难走。"},{"en":"We crossed an oozy patch near the riverbank.","zh":"我们穿过了河岸附近一片泥泞黏滑的地方。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Drunk or slightly drunk.","zh":"（非正式）醉的；微醺的。"},"examples":[{"en":"He looked a bit oozy after two strong drinks.","zh":"喝了两杯烈酒后，他看起来有点醉。"},{"en":"I don’t want to get oozy at the party—I have to drive.","zh":"我不想在聚会上喝到微醺——我还得开车。"}]}],"synonyms":["muddy","boggy","slimy","soggy","drunk","tipsy"],"phonetic":"/ˈuːzi/","extraExplanation":["“oozy”来自动词/名词“ooze”（渗出、淤泥），常用来描写湿地、沼泽、河岸等“又湿又黏”的触感与环境。","表示“微醺/醉”的用法较口语化，带一点俏皮或轻微贬义；在正式写作中更常用“drunk”“intoxicated”。"]}

