{"word":"oquassa","summary":{"en":"Oquassa is mainly a proper name, best known as Oquassa Lake in western Maine, and it also appears in local business or camp names.","zh":"Oquassa主要是专有名词，最常指美国缅因州西部的奥夸萨湖，也常作为当地企业或营地等名称的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name, most commonly referring to Oquassa Lake, a lake in western Maine (USA), near the Rangeley Lakes region.","zh":"专有名词，最常指美国缅因州西部的“奥夸萨湖”（Oquassa Lake），位于兰吉利湖区（Rangeley Lakes）附近。"},"examples":[{"en":"We spent the weekend kayaking on Oquassa Lake in Maine.","zh":"我们周末在缅因州的奥夸萨湖划皮艇。"},{"en":"The cabin sits a few minutes from Oquassa.","zh":"那间小木屋离奥夸萨（湖区）只有几分钟路程。"}]},{"partOfSpeech":"other","definition":{"en":"a place name used in businesses, camps, or products connected to the Oquassa Lake / Rangeley area (used as a local name).","zh":"地名延伸用法：用于与奥夸萨湖/兰吉利地区相关的营地、企业或产品名称（带有当地色彩的命名）。"},"examples":[{"en":"They booked a stay at a lodge with “Oquassa” in its name.","zh":"他们订了一家名字里带“Oquassa”的旅馆。"},{"en":"Oquassa Camp runs summer programs for kids.","zh":"Oquassa营地为孩子们开设夏令营项目。"}]}],"synonyms":["Oquassa Lake"],"phonetic":"/oʊˈkwɑːsə/","extraExplanation":["“Oquassa”多见于美国东北部（尤其是缅因州）的地名语境，通常属于专有名词，所以在句子里常不加冠词（如：at Oquassa Lake / near Oquassa）。","这类地名常源自当地原住民语言的音译（新英格兰地区不少地名都带有此特点），但具体词源解释在不同资料中可能不完全一致。"]}
{"word":"oquassas","summary":{"en":"“oquassas” is likely a rare proper name, usually seen as “Oquassa,” especially referring to a place name like Lake Oquassa in Maine.","zh":"“oquassas”很可能是较少见的专有名词，通常写作“Oquassa”，常指缅因州的奥夸萨湖等地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare proper name (often seen as “Oquassa”), used for place names in the U.S., especially Lake Oquassa in Maine; “oquassas” may be a plural or a misspelling.","zh":"一种较少见的专有名称（更常见拼作“Oquassa”），常用于美国地名，尤其是缅因州的奥夸萨湖（Lake Oquassa）；“oquassas”可能是复数形式或拼写错误。"},"examples":[{"en":"We rented a cabin near Lake Oquassa in Maine.","zh":"我们在缅因州的奥夸萨湖附近租了一间小木屋。"},{"en":"I’m not sure whether “oquassas” is a typo for “Oquassa.”","zh":"我不确定“oquassas”是不是把“Oquassa”打错了。"}]}],"synonyms":["(no true synonyms; it’s a proper name)"],"phonetic":"/oʊˈkwɑːsə/","extraExplanation":["从英语使用习惯看，这类词多属于专有名词（地名/俱乐部名等），书写时通常需要首字母大写：Oquassa。","如果你是在文章、地图或品牌名中看到“oquassas”，很可能是特定语境下的写法（例如复数或标题风格），但在常见资料里更常见的是单数拼写 Oquassa。","该地名可能源自北美原住民语言（不同来源说法不一）；如果你能提供看到它的句子或出处，我可以更准确判断含义与用法。"]}
{"word":"oquawka","summary":{"en":"Oquawka is the name of a village in western Illinois, USA, on the Mississippi River.","zh":"Oquawka 是美国伊利诺伊州西部密西西比河畔一个村庄的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village in western Illinois, USA, on the Mississippi River (the county seat of Henderson County).","zh":"美国伊利诺伊州西部密西西比河畔的一个村庄（亨德森县的县治）。"},"examples":[{"en":"Oquawka is a small riverside town on the Mississippi River in Illinois.","zh":"Oquawka 是伊利诺伊州密西西比河畔的一个小镇。"},{"en":"We drove through Oquawka on our way to the riverfront.","zh":"我们去河滨的路上开车经过了 Oquawka。"}]}],"phonetic":"/oʊˈkwɔːkə/","extraExplanation":["Oquawka 属于专有名词（地名），通常不翻译，只按英文拼写使用。","它位于伊利诺伊州西部，与爱荷华州隔密西西比河相望。","地名 Oquawka 常被认为与当地原住民语言有关（用于指代“黄色/金色”的含义的说法较常见），但不同资料对词源细节可能略有差异。"]}
{"word":"oquossoc","summary":{"en":"Oquossoc is a place name: a small village in Rangeley, Maine, USA.","zh":"Oquossoc 是一个地名：美国缅因州 Rangeley 一带的一个小村落/社区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small village/community in Rangeley, Maine, USA, known as a gateway to lakes and outdoor recreation (fishing, boating, hiking).","zh":"美国缅因州兰利（Rangeley）附近的一个小村落/社区，以湖区与户外活动（钓鱼、划船、徒步等）闻名。"},"examples":[{"en":"We stayed in Oquossoc for the weekend to go fishing on Rangeley Lake.","zh":"我们周末住在奥夸索克（Oquossoc），去兰利湖钓鱼。"},{"en":"Oquossoc is a quiet place with beautiful views and easy access to the water.","zh":"奥夸索克很安静，风景优美，而且去水边很方便。"}]}],"synonyms":["(no direct synonyms; it is a proper noun/place name)"],"phonetic":"/oʊˈkwɑsək/","extraExplanation":["“Oquossoc”更常见于地名（专有名词），通常不作为普通英语词汇使用。","该地位于缅因州西部湖区，常与 Rangeley Lake、outdoors（户外）等语境一起出现；在旅行、地图、新闻或当地活动介绍中较常见。","拼写看起来带有原住民语言（如阿尔冈昆语系）地名的风格；具体词源在不同资料中可能有差异，如需更精确的来源可提供你看到它的网页/句子以便核对。"]}

