{"word":"oven","summary":{"en":"An oven is mainly a heated appliance for baking/roasting; it can also mean a very hot place.","zh":"oven主要指用于烘焙/烤制的烤箱；也可比喻“非常炎热的地方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A kitchen appliance (or heated chamber) used for baking, roasting, or heating food.","zh":"烤箱；烤炉（用于烘焙、烤制或加热食物的厨房电器/加热箱体）。"},"examples":[{"en":"Preheat the oven to 350°F before you bake the cake.","zh":"烤蛋糕之前，把烤箱预热到350华氏度。"},{"en":"She roasted vegetables in the oven with olive oil and salt.","zh":"她把蔬菜拌上橄榄油和盐，放进烤箱烤。"}]},{"partOfSpeech":"n.","definition":{"en":"A very hot place or environment (used figuratively).","zh":"（比喻）酷热的地方；“像烤炉一样热”的环境。"},"examples":[{"en":"Without air-conditioning, the apartment felt like an oven.","zh":"没有空调，公寓里热得像个烤炉。"},{"en":"The city streets were an oven in the summer heat.","zh":"夏天的热浪里，城市街道像烤炉一样。"}]}],"synonyms":["baking oven","roaster","furnace (figurative for extreme heat)"],"phonetic":"/ˈʌvən/","extraExplanation":["“Oven”常见搭配：preheat the oven（预热烤箱），bake in the oven（放进烤箱烤），put sth. in/out of the oven（把某物放进/取出烤箱），oven mitt(s)（隔热手套），oven tray/baking sheet（烤盘）。","英式英语里“cooker”常指包含炉灶和烤箱的整套灶具；美式英语更常说“stove”（炉灶）和“oven”（烤箱）分开。","词源上与“炉、加热”相关；在文学或日常表达中，常用“like an oven”强调闷热、灼热与不适感。"]}
{"word":"ovenbird","summary":{"en":"An ovenbird is a North American songbird named for its oven-like domed nest.","zh":"ovenbird 指北美的一种鸣禽，因其像“烤箱”的拱形巢而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small North American woodland songbird (a type of warbler) known for nesting on the ground in a domed, “oven-like” nest and for its loud, ringing song.","zh":"一种北美林地小型鸣禽（林莺类），以在地面筑“像烤箱一样的拱形巢”以及响亮的鸣叫而闻名。"},"examples":[{"en":"We heard an ovenbird singing deep in the forest, even though we couldn’t see it.","zh":"我们在森林深处听到灶莺在唱歌，虽然看不见它。"},{"en":"The ovenbird builds a dome-shaped nest that looks a little like a tiny oven.","zh":"灶莺会筑一个拱顶形的巢，看起来有点像小烤箱。"}]}],"synonyms":["warbler (general)","songbird (general)"],"phonetic":"/ˈʌvənˌbɝd/","extraExplanation":["“ovenbird”这个名字来自它的巢：常见的是在地面用落叶和草搭成拱顶、侧面开口的“炉灶/烤箱”形状，因此得名。","在英语文学里，Robert Frost 有一首诗《The Oven Bird》，借鸟鸣来引发对季节变化与人生感受的思考；读到这个词时，有时会带出一点“带哲思的鸟鸣”这种文化联想。"]}
{"word":"ovenbirds","summary":{"en":"Ovenbirds = plural of ovenbird: usually the North American warbler called the ovenbird; more broadly, birds that build oven-like nests.","zh":"Ovenbirds 是 ovenbird 的复数：通常指北美的拟叽喳莺；也可泛指会筑“炉状”巢的鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ovenbird: a small North American woodland songbird (a warbler, *Seiurus aurocapilla*) known for its loud, ringing song and for nesting on the forest floor.","zh":"ovenbird（拟叽喳莺）的复数：一种北美林地小型鸣禽（莺科，学名 *Seiurus aurocapilla*），以响亮清晰的鸣唱著称，并在林地地面筑巢。"},"examples":[{"en":"We heard ovenbirds singing from deep in the woods.","zh":"我们在树林深处听到拟叽喳莺在鸣唱。"},{"en":"In spring, ovenbirds often return to the same forest territories.","zh":"春天时，拟叽喳莺常常回到同一片森林领地。"}]},{"partOfSpeech":"n.","definition":{"en":"Also plural of ovenbird in a broader sense: any of various birds (especially in the South American ovenbird family, Furnariidae) that build enclosed, “oven-like” nests.","zh":"也可泛指“灶鸟/炉鸟”的复数：一些鸟类（尤指南美的灶鸟科 Furnariidae）会筑造封闭、像“烤炉/灶”的巢，因此得名。"},"examples":[{"en":"Some South American ovenbirds build nests that look like little clay ovens.","zh":"一些南美的灶鸟会筑出看起来像小泥炉一样的巢。"}]}],"synonyms":["ovenbird","(South American) hornero","wood warbler (informal, context-dependent)"],"phonetic":"/ˈʌvənˌbɝd/","extraExplanation":["“ovenbird/ovenbirds”这个名字来自它们的“像烤炉一样封闭的巢”。不过在北美语境里，单独说 ovenbird 通常特指那种林地莺（*Seiurus aurocapilla*），而不是南美灶鸟科的所有成员。","文学中常提到这只鸟：美国诗人 Robert Frost 有一首诗《The Oven Bird》，借它的歌声谈季节变化与人生感受；因此在英语文学/文化语境里它也常带有一点象征意味。"]}
{"word":"ovendry","summary":{"en":"Oven-dry (ovendry) means dried by heating in an oven to remove moisture, often to a standard constant weight.","zh":"Oven-dry（ovendry）指用烘箱加热把水分烘干，常指按标准烘至恒重的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"dried completely (or to a standard constant weight) by heating in an oven, especially in labs or industry to remove moisture.","zh":"（尤指在实验室或工业中）通过烘箱加热把水分烘干的；烘至（标准）恒重的。"},"examples":[{"en":"The soil was weighed, then oven-dry weights were recorded after 24 hours.","zh":"先称量土壤，然后烘箱干燥 24 小时后记录烘干重量。"},{"en":"Report moisture content on an oven-dry basis.","zh":"按烘干基报告含水率。"}]},{"partOfSpeech":"vt.","definition":{"en":"to dry something in an oven until it reaches a dry, stable condition (often “oven-dry to constant weight”).","zh":"用烘箱把某物烘干至干燥稳定状态（常指“烘至恒重”）。"},"examples":[{"en":"Oven-dry the sample at 105°C before calculating its dry mass.","zh":"在计算干质量前，将样品在 105°C 下烘干。"}]}],"synonyms":["kiln-dried","dried to constant weight","bone-dry (informal)"],"phonetic":"/ˈʌvən draɪ/","extraExplanation":["“oven-dry / ovendry”多见于科研与材料/木材/土壤检测等语境，强调一种可重复的干燥标准：通过规定温度与时间把水分尽量去除，常以“烘至恒重（constant weight）”为判定条件。","常见搭配：oven-dry weight（烘干重/绝干重）、oven-dry basis（烘干基/绝干基）、oven-dry at 105°C（在105°C烘干；具体温度取决于标准方法）。拼写上也常见 oven-dry（带连字符）更规范。"]}
{"word":"ovened","summary":{"en":"“Ovened” is a rare word meaning “cooked/baked in an oven,” often replaced by “oven-baked” or “baked.”","zh":"“ovened”较少用，意思是“用烤箱烤/烘的”，更常用“oven-baked”或“baked”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) cooked or baked in an oven; oven-baked.","zh":"（较少用）用烤箱烹调的；烤箱烘烤的。"},"examples":[{"en":"Serve the ovened chicken with roasted vegetables.","zh":"把烤箱烤鸡配上烤蔬菜一起上桌。"},{"en":"I prefer ovened fries because they use less oil.","zh":"我更喜欢烤箱薯条，因为用油更少。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) past tense/past participle of “oven” meaning to cook in an oven.","zh":"（较少用）“oven”的过去式/过去分词：用烤箱烹调。"},"examples":[{"en":"We ovened the fish at 400°F for about 15 minutes.","zh":"我们把鱼用400华氏度（约204℃）烤了大约15分钟。"},{"en":"The bread was ovened until golden brown.","zh":"面包烤到金黄色为止。"}]}],"synonyms":["oven-baked","baked","roasted"],"phonetic":"/ˈʌvənd/","extraExplanation":["“ovened”在现代英语中不常见。日常更自然的说法通常是：形容词用“oven-baked / baked (in the oven)”，动词用“bake / roast”。例如：“oven-baked chicken”“bake the fish”。"]}
{"word":"ovenful","summary":{"en":"“Ovenful” means the amount that fills an oven (one batch).","zh":"“ovenful”指一炉的量：烤箱一次能容纳/烤完的一批。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"as much as an oven can hold in one batch; the amount that fills an oven","zh":"一炉（烤箱一次能烤/装得下的量）；满满一烤箱的量"},"examples":[{"en":"We baked an ovenful of cookies for the school sale.","zh":"我们烤了一炉饼干，用于学校义卖。"},{"en":"An ovenful of bread was ready before dinner.","zh":"晚饭前，一炉面包就烤好了。"},{"en":"She roasted an ovenful of vegetables to meal-prep for the week.","zh":"她烤了一炉蔬菜，用来做一周的备餐。"}]}],"synonyms":["oven load","batch","trayful"],"phonetic":"ˈʌvənfʊl","extraExplanation":["“ovenful”是由“oven（烤箱）+ -ful（……的量）”构成的名词，表示“容器（或空间）一次能装下的量”。类似构词还有“handful（一把）”“cupful（一杯的量）”“spoonful（一勺）”。在日常英语里，“a whole ovenful of … / an ovenful of …”多见于烘焙、做饭语境。"]}
{"word":"ovening","summary":{"en":"“Ovening” is a rare form meaning cooking/heating something in an oven (or putting it into an oven). In most cases, use “bake/roast” or “put it in the oven.”","zh":"“ovening”较少见，表示用烤箱烹饪/加热（或把东西放进烤箱）。更常用的表达是“bake/roast”或“put it in the oven”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) cooking or heating food in an oven; baking/roasting in the oven.","zh":"（少见用法）用烤箱烹饪或加热；烤制/焙烤。"},"examples":[{"en":"After pan-searing the chicken, finish it by ovening it for 10 minutes.","zh":"把鸡肉先煎一下，再放进烤箱烤 10 分钟收尾。"},{"en":"Ovening the vegetables brings out a sweeter flavor.","zh":"把蔬菜放进烤箱烤，会带出更甜的味道。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the act or process of putting something into an oven.","zh":"（少见用法）把某物放入烤箱的行为或过程。"},"examples":[{"en":"The recipe is simple: mixing, resting, then ovening.","zh":"这个食谱很简单：混合、静置，然后放进烤箱烤。"}]}],"synonyms":["baking","roasting","putting in the oven","oven-baking"],"phonetic":"/ˈʌvənɪŋ/","extraExplanation":["“ovening”在标准英语里不常见。更自然的说法通常是：“bake (in the oven) / roast (in the oven) / put it in the oven”。","很多时候输入“ovening”其实是想写“evening（傍晚/晚上）”。如果你告诉我你的句子原文，我可以帮你判断你真正想用哪个词。"]}
{"word":"ovenlike","summary":{"en":"“Ovenlike” describes something that feels like an oven—extremely hot, often dry and enclosed.","zh":"“ovenlike”形容像烤箱一样的感觉：非常闷热，常带有干燥、封闭的热感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an oven—very hot, dry, and enclosed or heat-filled.","zh":"像烤箱一样的；（环境）闷热、干燥、热气逼人的。"},"examples":[{"en":"By noon, the small car felt ovenlike without air conditioning.","zh":"到中午，没有空调的小车里感觉像烤箱一样闷热。"},{"en":"The studio was ovenlike under the stage lights.","zh":"在舞台灯光下，摄影棚热得像烤箱。"},{"en":"They walked into an ovenlike hallway where the air barely moved.","zh":"他们走进一条像烤箱一样的走廊，空气几乎不流动。"}]}],"synonyms":["stifling","sweltering","scorching","oppressive","baking-hot"],"phonetic":"/ˈʌvənˌlaɪk/","extraExplanation":["“ovenlike”= oven + -like，其中 -like 表示“像……一样/具有……特征”。这类形容词常用于写作里强调感受（如热、干、闷、封闭感），带有较强的画面感。","常见搭配：ovenlike heat / ovenlike room / ovenlike air。也可用更口语的表达替换，如 “It feels like an oven in here.”（这里热得像烤箱一样）。"]}
{"word":"ovenly","summary":{"en":"Ovenly describes an oven-like, baking, stifling heat.","zh":"Ovenly 用来形容像烤箱一样的闷热、灼热。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very hot and enclosed, like the heat inside an oven; baking or stifling.","zh":"像烤箱里那样闷热、灼热的；烘烤般的、让人喘不过气的。"},"examples":[{"en":"The kitchen felt ovenly after we roasted the chicken for an hour.","zh":"烤鸡烤了一个小时后，厨房里热得像烤箱一样。"},{"en":"We stepped into the ovenly air outside and looked for shade.","zh":"我们走到外面，迎面是烘烤般的热浪，只好赶紧找阴凉处。"}]}],"synonyms":["sweltering","stifling","baking","oppressive","sultry"],"phonetic":"/ˈʌvənli/","extraExplanation":["“ovenly”比较少见，写作中偶尔用来强调一种“被热包住、像烤箱里一样”的闷热感。日常更常用的表达有“sweltering / stifling / baking hot”。","词形上是“oven（烤箱）+ -ly”，这里的“-ly”不是副词结尾，而是构成形容词，表示“具有……性质的”（类似“friendly, brotherly”）。"]}
{"word":"ovenman","summary":{"en":"An ovenman is a worker who operates or tends an oven or kiln, especially in industrial production.","zh":"ovenman 指操作或看管烤炉/窑炉的工人，常见于工业生产场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who operates or tends an oven, especially in an industrial setting (such as a bakery, pottery/kiln, or metal/brick production).","zh":"负责操作或看管烤炉/窑炉的工人，尤指工业环境中（如面包房、陶瓷窑、金属或砖瓦生产）。"},"examples":[{"en":"The ovenman checked the temperature before loading the next batch of bread.","zh":"烤炉工在放入下一批面包前先检查了温度。"},{"en":"In the pottery workshop, the ovenman monitored the kiln all night.","zh":"在陶艺工坊里，窑炉工整晚都在监控窑炉。"},{"en":"The factory hired an experienced ovenman to improve production quality.","zh":"工厂雇了一位有经验的炉工来提高产品质量。"}]}],"synonyms":["oven operator","kiln operator","baker","furnace operator"],"phonetic":"/ˈʌvənmæn/","extraExplanation":["“ovenman”属于较少见的职业用语，常见于较老的行业描述或特定工种（如烘焙工厂的烤炉操作员、陶瓷窑炉看火工、冶金/砖瓦等高温炉作业人员）。现代更常用的表达包括：oven operator（烤炉操作员）、kiln operator（窑炉操作员）、baker（面包师，偏食品制作）。"]}
{"word":"ovenmen","summary":{"en":"“Ovenmen” is a rare plural noun meaning workers who tend industrial ovens or kilns.","zh":"“ovenmen”是较少见的复数名词，指看管或操作工业烤炉/窑炉的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ovenman”: a worker who operates or tends an industrial oven or kiln (rare; mostly seen in older or specialized writing).","zh":"“ovenman”的复数：指操作或看管工业烤炉/窑炉的工人（较少见，多见于较旧或专业语境）。"},"examples":[{"en":"The ovenmen worked in shifts to keep the kilns running day and night.","zh":"这些看炉工人轮班工作，让窑炉昼夜不停运转。"},{"en":"In the old bakery records, ovenmen were listed separately from mixers and packers.","zh":"在旧的面包房记录里，看炉工人与和面工、包装工是分开登记的。"}]}],"synonyms":["kiln workers","furnace workers","oven operators"],"phonetic":"ˈʌvənmɛn","extraExplanation":["“ovenmen”不是现代英语里常见的日常词汇；如果你是在生活场景（做饭/烘焙）里想表达“隔热手套”，更常用的是 **oven mitt**（复数 **oven mitts**）。","“ovenman/ovenmen”更可能出现在工业生产（如玻璃、陶瓷、金属热处理）或较老的工厂/工会文献里，用来指在高温炉旁工作的岗位。"]}
{"word":"ovenpeel","summary":{"en":"An oven peel is a long-handled flat tool used to put bread or pizza into a hot oven and take it out.","zh":"oven peel 指带长柄的扁平烤铲，用来将面包或披萨送入高温烤箱并取出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat, shovel-like tool (usually with a long handle) used to slide bread or pizza into and out of a hot oven, especially a stone or brick oven.","zh":"（烤炉用的）烤铲：一种扁平、像铲子的工具（通常带长柄），用来把面包或披萨送入或取出高温烤箱，尤其是石炉或砖炉。"},"examples":[{"en":"The baker used an oven peel to place the loaves onto the hot stone.","zh":"面包师用烤铲把面包坯放到滚烫的石板上。"},{"en":"Dust the oven peel with flour so the pizza slides off easily.","zh":"在烤铲上撒点面粉，这样披萨更容易滑下去。"}]}],"synonyms":["peel","baker’s peel","pizza peel","bread peel"],"phonetic":"/ˈʌvən ˌpiːl/","extraExplanation":["“peel”在这里不是“剥皮”，而是指烘焙工具“铲/板”的意思；在披萨语境中更常说“pizza peel（披萨铲）”。","常见材质有木质与金属：木质更不易粘、适合送入面团；金属更薄、更容易伸入披萨底部取出成品。"]}
{"word":"ovens","summary":{"en":"“Ovens” is the plural form of “oven,” meaning one or more appliances used for baking or roasting with heat.","zh":"“ovens”是“oven”的复数，指一个或多个用于烘焙、烤制的加热设备（烤箱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “oven”: a kitchen appliance or enclosed chamber used for baking or roasting food with heat.","zh":"“oven”的复数：烤箱；一种用于烘焙或烤制食物的加热设备/封闭加热空间。"},"examples":[{"en":"The bakery has three large ovens to bake bread all morning.","zh":"那家面包店有三台大型烤箱，可以整个上午烤面包。"},{"en":"Please don’t open the ovens while the cakes are rising.","zh":"蛋糕正在膨胀时，请不要打开烤箱门。"}]}],"synonyms":["baking ovens","cookers (BrE, sometimes)","ranges (when including an oven)"],"phonetic":"/ˈʌvənz/","extraExplanation":["“Oven”的常见搭配：preheat the oven（预热烤箱）、bake in the oven（用烤箱烘烤）、put something in/take something out of the oven（把……放进/从烤箱取出）、convection oven（对流烤箱）、microwave oven（微波炉，注意日常也常简称 microwave）。","英美文化里常见的比喻：as hot as an oven（热得像烤箱一样），也会用 “the oven is on” 表示烤箱正在加热/工作。"]}
{"word":"ovensman","summary":{"en":"Ovensman is a rare word meaning someone who operates/tends ovens; it can also be a surname.","zh":"Ovensman 是个较少见的词，指看炉工/操作烤炉的人；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person whose job is to operate or tend ovens, especially in baking or industrial heating (similar to “oven operator”).","zh":"（罕见）看炉工；操作或照看烤炉/工业炉的人（类似“烤炉操作员”）。"},"examples":[{"en":"In the old bakery, the ovensman started work before dawn to heat the ovens.","zh":"在那家老面包店里，看炉工天没亮就开始生火预热烤炉。"},{"en":"The ovensman checked the temperature and rotated the trays for even baking.","zh":"看炉工检查温度，并转动烤盘以保证受热均匀。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"（用作）姓氏。"},"examples":[{"en":"Ms. Ovensman will lead the meeting today.","zh":"Ovensman 女士今天将主持会议。"}]}],"synonyms":["oven operator","baker","kiln operator"],"phonetic":"/ˈʌvənz.mən/","extraExplanation":["“ovensman”不是现代英语里很常见的词，更常见的说法是 oven operator（烤炉操作员）、baker（面包师，含烤制工作）或 kiln operator（窑炉操作员）。","在英语里，一些职业名称会变成姓氏（如 Baker、Smith）。Ovensman 也可能以姓氏的形式出现。"]}
{"word":"ovenstone","summary":{"en":"An ovenstone is a heat-retaining stone slab used in an oven to bake pizza or bread more evenly and crisply.","zh":"ovenstone 指放在烤箱里用来蓄热、均匀传热的烤石（披萨石/烘焙石），帮助披萨或面包烤得更均匀、更酥脆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat, heat-resistant stone or ceramic slab placed in an oven to store and evenly radiate heat for baking (especially pizza and bread)","zh":"（烤箱中用的）烤石／披萨石；一种耐高温的石板或陶瓷板，用来蓄热并均匀传热，常用于烤披萨、面包"},"examples":[{"en":"Preheat the ovenstone for 30 minutes so the crust turns crisp.","zh":"把烤石预热30分钟，这样饼皮会更酥脆。"},{"en":"She slid the dough onto the ovenstone with a peel.","zh":"她用披萨铲把面团滑到烤石上。"}]}],"synonyms":["pizza stone","baking stone","oven stone","baking slab"],"phonetic":"/ˈʌvənˌstoʊn/","extraExplanation":["“ovenstone”更常见的写法是分开写作“oven stone”，在美式英语里也常叫“pizza stone”或“baking stone”。使用时通常要先预热，让它储存热量；放入面团时注意防烫，并避免骤冷（例如刚出炉就用冷水冲），以免开裂。"]}
{"word":"ovenware","summary":{"en":"Ovenware means dishes or containers that are safe to use in an oven.","zh":"ovenware 指可安全放入烤箱使用的烘烤器皿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dishes or containers made to be safely used in an oven for baking or roasting (often glass, ceramic, or metal).","zh":"可安全放入烤箱使用的烘烤器皿（常见材质有玻璃、陶瓷或金属）。"},"examples":[{"en":"This casserole dish is ovenware, so you can bake the lasagna in it.","zh":"这个砂锅烤盘是烤箱用器皿，所以你可以用它烤千层面。"},{"en":"Please use ovenware, not plastic containers, for the oven.","zh":"请用烤箱用器皿，不要把塑料盒放进烤箱。"},{"en":"We bought new ovenware for Thanksgiving to roast vegetables.","zh":"我们为感恩节买了新的烤箱用器皿来烤蔬菜。"}]}],"synonyms":["bakeware","ovenproof dish","baking dish"],"phonetic":"/ˈʌvənˌwer/","extraExplanation":["“ovenware”通常是不可数名词，泛指一类烤箱用器皿；也可用作集合概念。更具体时常说：an ovenproof dish / a baking dish / a roasting pan。","有时你会看到“oven-safe / ovenproof”来描述“能进烤箱”。注意区分：microwave-safe（可微波）≠ oven-safe（可烤箱）。","购买或使用时要留意材质与耐温上限（尤其是玻璃和陶瓷）；避免把“non-oven-safe”的塑料、薄纸或某些装饰涂层器皿放进烤箱。"]}
{"word":"ovenwares","summary":{"en":"Ovenwares are oven-safe dishes and cookware used for baking or roasting.","zh":"Ovenwares 指可入烤箱、用于烘焙或烤制的器皿与炊具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Objects (such as dishes, trays, and pans) made to be safely used in an oven; oven-safe cookware or bakeware.","zh":"可安全放入烤箱使用的器具（如烤盘、烤碗、烤锅等）；耐烤箱的炊具/烘焙器具。"},"examples":[{"en":"This store sells ovenwares like ceramic baking dishes and roasting pans.","zh":"这家店卖各种烤箱器具，比如陶瓷烤盘和烤肉盘。"},{"en":"Check the label to make sure the ovenwares are heat-resistant and oven-safe.","zh":"查看标签，确认这些烤箱器具耐高温、可入烤箱使用。"},{"en":"Glass ovenwares can crack if you move them from the fridge straight into a hot oven.","zh":"玻璃烤箱器具如果从冰箱直接放进热烤箱，可能会裂开。"}]}],"synonyms":["ovenware","bakeware","cookware","roasting pan","baking dish"],"phonetic":"/ˈʌvənˌwɛrz/","extraExplanation":["“ovenwares”通常是复数用法；更常见的单数是“ovenware”（不可数名词，用来泛指这类器具）。日常也常用“bakeware”（烘焙器具）来表达类似概念。","使用烤箱器具时要注意“oven-safe”（可入烤箱）与“microwave-safe”（可进微波炉）并不等同；另外避免“thermal shock”（温差冲击），例如冷玻璃器皿直接进高温烤箱。"]}
{"word":"ovenwise","summary":{"en":"“Ovenwise” means safe to use in an oven (oven-safe/ovenproof).","zh":"“ovenwise”表示“可入烤箱的、耐烤箱高温的”（类似 oven-safe/ovenproof）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Safe to use in an oven; able to withstand oven heat without being damaged.","zh":"可用于烤箱的；耐烤箱高温、不易损坏的。"},"examples":[{"en":"Make sure the dish is ovenwise before you put it under the broiler.","zh":"在把烤盘放到上火（broiler）下面之前，先确认它是可入烤箱的。"},{"en":"This glass container is ovenwise up to 450°F, but the lid is not.","zh":"这个玻璃容器可耐受至 450°F 的烤箱温度，但盖子不行。"},{"en":"Use an ovenwise skillet so you can start on the stove and finish in the oven.","zh":"用可入烤箱的平底锅，这样就能先在炉灶上煎，再放进烤箱完成。"}]}],"synonyms":["oven-safe","ovenproof","heatproof"],"phonetic":"/ˈʌvənˌwaɪz/","extraExplanation":["“ovenwise”常见于英式英语或产品说明中，意思与更常见的“oven-safe / ovenproof（可入烤箱的）”接近。","不同材质的耐热范围不一样：例如塑料手柄、硅胶盖、某些玻璃或陶瓷都有温度上限；看到“ovenwise”也建议查看具体的最高温度标注。"]}
{"word":"ovenwood","summary":{"en":"Ovenwood means wood used as fuel for heating an oven, especially a wood-fired oven; it’s a rare spelling and is often written as “oven wood.”","zh":"Ovenwood 指用于给烤炉加热的木柴（尤其是柴火烤炉）；这种连写较少见，常写作“oven wood”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wood used as fuel to heat an oven (especially a wood-fired oven).","zh":"用来给烤炉/火炉加热的木柴（尤其指柴火烤炉用的燃料木）。"},"examples":[{"en":"We need more ovenwood before we start baking the pizzas.","zh":"我们开始烤披萨前需要再准备一些烤炉柴火。"},{"en":"Dry ovenwood burns hotter and makes less smoke.","zh":"干燥的烤炉木柴燃烧更旺，烟也更少。"}]},{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard compound word; often written as “oven wood” in everyday English.","zh":"较少见或非标准的合成词；日常英语里常写作“oven wood”（分开写）。"},"examples":[{"en":"The recipe notes mention using oak as oven wood for a stronger aroma.","zh":"食谱备注提到用橡木当作烤炉用柴火，香气更浓。"}]}],"synonyms":["firewood","wood fuel","kindling"],"phonetic":"/ˈʌvənˌwʊd/","extraExplanation":["“ovenwood”不是现代英语里非常固定的常用词，更常见的说法是“firewood for the oven”或直接写成“oven wood”。在餐饮语境（如木柴披萨炉、面包窑）中，选择木柴会影响温度、烟量和香味（例如橡木、果木等）。"]}

