{"word":"overidden","summary":{"en":"“overidden” is not standard; the correct form is “overridden,” meaning changed or rejected by higher authority/priority (past participle of override).","zh":"“overidden”不是标准拼写；正确写法是“overridden”，表示被更高权限/优先级所覆盖、否决或取代（override 的过去分词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “overridden,” the past participle of “override.”","zh":"“overridden”的常见拼写错误；“override”的过去分词。"},"examples":[{"en":"It should be “overridden,” not “overidden.”","zh":"应该写“overridden”，不是“overidden”。"},{"en":"The system setting was overridden by an administrator.","zh":"系统设置被管理员覆盖/强制更改了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(overridden) Changed or replaced by something with higher authority or priority.","zh":"（overridden）被更高权限或更高优先级的内容所更改或取代。"},"examples":[{"en":"The default rules were overridden by new company policies.","zh":"默认规则被公司的新政策取代了。"},{"en":"Her decision was overridden by the manager.","zh":"她的决定被经理否决/推翻了。"}]},{"partOfSpeech":"v.","definition":{"en":"(overridden) Past participle of “override”: to use authority to reject a decision or to take control instead of an existing control.","zh":"（overridden）“override”的过去分词：指用权力否决决定，或用新的控制取代原有控制。"},"examples":[{"en":"The judge’s ruling was overridden by a higher court.","zh":"法官的裁决被上级法院推翻了。"},{"en":"Manual control has overridden the automatic mode.","zh":"手动控制已取代自动模式。"}]}],"synonyms":["replaced","superseded","overruled","rejected"],"phonetic":"/ˌoʊvərˈrɪdən/","extraExplanation":["“override”的拼写要注意：中间是“rr”，结尾是“ridden”（类似 ride → ridden）。很多人会误写成 overidden。","在计算机/系统语境中，override 常译为“覆盖”“强制执行”“优先于”；在权力/决策语境中常译为“否决”“推翻”。"]}
{"word":"overidealism","summary":{"en":"Overidealism means having idealistic beliefs or expectations to an unrealistic degree.","zh":"overidealism 指“过度理想主义”，即理想或期待过于完美而不切实际。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive idealism; the tendency to have unrealistically perfect expectations about people, life, or plans.","zh":"过度理想主义；对人、生活或计划抱有不切实际的完美期待。"},"examples":[{"en":"Her overidealism made every small mistake feel like a disaster.","zh":"她的过度理想主义让每个小错误都像一场灾难。"},{"en":"Overidealism can be inspiring at first, but it may lead to disappointment later.","zh":"过度理想主义起初可能很鼓舞人心，但之后也可能带来失望。"},{"en":"The novel critiques political overidealism by showing how good intentions can fail in reality.","zh":"这部小说通过展现善意如何在现实中受挫，批判了政治上的过度理想主义。"}]}],"synonyms":["excessive idealism","unrealistic idealism","over-optimism (contextual)","naivety (contextual)"],"phonetic":"/ˌoʊvər.aɪˈdiːəˌlɪzəm/","extraExplanation":["构词理解：over- 表示“过度、超过”，idealism 表示“理想主义”。合在一起就是“理想化得过头”。","语用提示：这个词不算非常常见，日常表达中也常用 overly idealistic（过于理想化的）或 unrealistic idealism（不切实际的理想主义）来替代。"]}
{"word":"overidealistic","summary":{"en":"Overly idealistic; not practical enough for real-world conditions.","zh":"过于理想化；缺乏现实可行性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having overly high hopes or beliefs about how good, fair, or successful something will be, without enough attention to real-world limits or practical details.","zh":"过于理想化的；不切实际地乐观的（对现实限制与细节考虑不足）。"},"examples":[{"en":"The plan sounded exciting, but it was overidealistic and ignored the budget.","zh":"这个计划听起来很激动人心，但太过理想化，忽视了预算。"},{"en":"She was overidealistic about changing the company culture in one month.","zh":"她过于理想化地认为能在一个月内改变公司的文化。"}]}],"synonyms":["unrealistic","impractical","utopian","overoptimistic"],"phonetic":"/ˌoʊvərˌaɪdiəˈlɪstɪk/","extraExplanation":["“overidealistic”通常带有批评或提醒的语气，表示“理想很美，但不够务实”。如果想更中性，可以说“idealistic”或“optimistic”；如果想强调“有愿景但也考虑现实”，可以说“idealistic but pragmatic（理想但务实）”。","构词上是 over-（过度）+ idealistic（理想主义的）。在写作中常用来评价计划、政策、期待等，暗示需要更多可行性分析。"]}
{"word":"overidealize","summary":{"en":"“Overidealize” means to idealize too much and ignore real flaws.","zh":"“overidealize”指把人或事过度理想化，忽视真实的缺点与复杂性。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To see someone or something as much better or more perfect than they really are; to idealize too much.","zh":"把某人或某事看得过于完美；过度理想化。"},"examples":[{"en":"It’s easy to overidealize a new relationship at the beginning.","zh":"一段新关系刚开始时很容易被过度理想化。"},{"en":"Don’t overidealize your hero—everyone has flaws.","zh":"别把你的偶像过度理想化——每个人都有缺点。"},{"en":"She overidealized life abroad and felt disappointed when reality was harder.","zh":"她把国外生活过度理想化，现实更艰难时就感到失望。"}]}],"synonyms":["overromanticize","glorify","idealize (too much)","put on a pedestal"],"phonetic":"/ˌoʊvərˈaɪdiəˌlaɪz/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overidealize = idealize（理想化）+ over（过度）。常见类似结构：overestimate（高估）、overreact（反应过度）、overthink（想太多）。","这个词常用于提醒别人把人、关系、工作或某种生活方式想得太美，从而忽略真实的复杂性与缺点。"]}
{"word":"overidealized","summary":{"en":"Overidealized means portrayed or believed to be too perfect and not realistic.","zh":"overidealized 指把事物看得或写得过于完美，以致不真实、脱离现实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Seen or described as too perfect, unrealistically positive, or lacking flaws (more idealized than is reasonable).","zh":"被描写或看待得过于完美、过分正面，到了不现实、忽略缺点的程度。"},"examples":[{"en":"The movie gives an overidealized picture of small-town life.","zh":"这部电影把小镇生活描绘得过于理想化。"},{"en":"Her childhood memories felt overidealized once she heard her siblings’ stories.","zh":"当她听到兄弟姐妹的说法后，她的童年回忆显得过分理想化。"},{"en":"The proposal was criticized for its overidealized assumptions about human behavior.","zh":"这份提案因对人类行为的假设过于理想化而受到批评。"}]}],"synonyms":["overly idealized","romanticized","rose-colored","unrealistic","overoptimistic"],"phonetic":"/ˌoʊvərˈaɪdiəˌlaɪzd/","extraExplanation":["“over-”表示“过度、超过合理程度”；“idealize”表示“把……理想化”。因此 overidealized 常用来提醒：某种描述或期待不够贴近现实。","常见搭配：an overidealized view/image/portrait of…（对……过分理想化的看法/形象/描绘）；overidealized assumptions（过度理想化的假设）。"]}
{"word":"overidealizes","summary":{"en":"“Overidealizes” means “idealizes too much,” seeing someone or something as more perfect than reality.","zh":"“overidealizes”表示“过度理想化”，把人或事看得比现实更完美。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to see someone or something as far more perfect, good, or admirable than they really are; to idealize too much","zh":"把某人或某事看得过于完美、过分美化；过度理想化"},"examples":[{"en":"She overidealizes her first job and forgets how stressful it actually was.","zh":"她把第一份工作过度理想化了，忘了它其实有多压力。"},{"en":"He overidealizes the past, so today always feels disappointing to him.","zh":"他过度美化过去，所以今天在他看来总是不够好。"},{"en":"The movie overidealizes friendship, making every conflict seem easy to solve.","zh":"这部电影把友情过度理想化，让每个冲突看起来都很容易解决。"}]}],"synonyms":["romanticizes","glamorizes","mythologizes","overpraises"],"phonetic":"/ˌoʊvərˈaɪdiəˌlaɪz/","extraExplanation":["“overidealizes”是动词“overidealize”的第三人称单数（he/she/it overidealizes）。常用于谈恋爱、家庭、名人崇拜、政治观点或“怀旧”时，表示因为期待过高而更容易失望。","构词上是 over-（过度）+ idealize（理想化）。语气通常带有批评或提醒：并不是否定优点，而是强调“不够现实”。"]}
{"word":"overidealizing","summary":{"en":"“Overidealizing” means imagining someone or something as unrealistically perfect, often ignoring flaws.","zh":"“Overidealizing”指把某人或某事过度理想化，想得不切实际地完美，常常忽视缺点。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of overidealize; thinking about someone or something in an unrealistically perfect way, ignoring flaws or limits","zh":"overidealize 的现在分词；把某人或某事想得过于完美、不切实际，忽视缺点或限制"},"examples":[{"en":"She caught herself overidealizing the new job before reading the contract carefully.","zh":"她发现自己在仔细看合同之前，就把这份新工作想得过于完美。"},{"en":"We’re overidealizing our relationship if we pretend we never argue.","zh":"如果我们假装从不争吵，那就是把这段关系过度理想化了。"},{"en":"Overidealizing a leader can make it hard to see real problems.","zh":"过度理想化一位领导者会让人难以看清真实问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing or involving an unrealistic, overly perfect view","zh":"（用作形容词）带有不切实际的“过分完美化”视角的"},"examples":[{"en":"His overidealizing comments made the plan sound easier than it was.","zh":"他那些过度理想化的评论让这个计划听起来比实际更容易。"},{"en":"An overidealizing view of success can lead to disappointment.","zh":"对成功的过度理想化看法可能导致失望。"}]}],"synonyms":["overidealizing","putting on a pedestal","romanticizing","glorifying","idealizing too much"],"phonetic":"/ˌoʊvɚˈaɪdiəˌlaɪzɪŋ/","extraExplanation":["“overidealize/overidealizing”常见于谈论亲密关系、偶像崇拜、职业期待或自我形象：当你只看到优点、把期待拉得太高，就容易在现实出现摩擦时感到落差。","和“idealize（理想化）”相比，前面加 over- 强调“过度、超出合理程度”。学习时可以把它理解为“把滤镜开太强”。"]}
{"word":"overidentified","summary":{"en":"“Overidentified” means being too strongly attached to an identity, role, or label, as if it defines the whole self.","zh":"“Overidentified”指过度把自己与某个身份/角色/标签绑定，好像它定义了全部的自我。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often in psychology or identity talk) too strongly identified with a role, group, label, or opinion; treating it as the whole of who someone is.","zh":"（常见于心理学/身份认同语境）过度把自己与某个角色、群体、标签或观点绑定；把它当作“全部的自我”。"},"examples":[{"en":"After the promotion, he became overidentified with his job and couldn’t relax at home.","zh":"升职后，他过度把自己和工作绑定，回到家也放松不下来。"},{"en":"If we get overidentified with one political view, it’s harder to listen openly to others.","zh":"如果我们过度认同某一种政治观点，就更难以开放的态度倾听他人。"},{"en":"The therapist said she was overidentified with being the “responsible one” in the family.","zh":"治疗师说她过度把自己当成家里“负责的人”这个角色。"}]}],"synonyms":["overinvested","too attached","overly identified","overinvolved"],"phonetic":"/ˌoʊvɚaɪˈdɛntəˌfaɪd/","extraExplanation":["这个词常用于自我觉察、心理治疗、职场/家庭角色讨论中，含义接近“把标签当成自我本体”。它通常带有提醒或批评意味：当人过度认同某个身份时，容易变得防御、焦虑，或难以接受不同意见。","常见搭配：overidentified with + 名词/动名词（overidentified with work / being right / a label）。","相关概念（不完全等同）：\"enmeshment\"（过度纠缠/界限不清）、\"ego identification\"（自我认同于某角色）。"]}
{"word":"overidentify","summary":{"en":"Overidentify means to identify or relate to someone/something too strongly, or (less commonly) to misidentify someone/something.","zh":"overidentify 指“过度认同/过度代入”，较少见时也可指“误认”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To identify with someone or something too strongly, or to interpret a situation as more personally relevant than it really is.","zh":"过度认同；把某人/某事看得与自己过于相关；（对情境）过度代入、过度解读为与自己有关。"},"examples":[{"en":"Some fans overidentify with celebrities and feel personally attacked by criticism of them.","zh":"有些粉丝会对明星过度认同，别人一批评就觉得是在攻击自己。"},{"en":"If you overidentify with your job, a small mistake can feel like a failure as a person.","zh":"如果你对工作过度认同，一点小失误都可能让你觉得自己这个人很失败。"},{"en":"Try not to overidentify with one comment online; it may not be about you.","zh":"别对网上一句话过度代入；它可能根本不是在说你。"}]},{"partOfSpeech":"v.","definition":{"en":"To mistakenly recognize someone or something as being the same as someone or something else (less common).","zh":"（较少见）误认；把人或事物认错成另一个。"},"examples":[{"en":"Witnesses sometimes overidentify suspects when they are under stress.","zh":"目击者在压力下有时会把嫌疑人误认成别人。"}]}],"synonyms":["overassociate","overrelate","take (something) personally","overinvest (emotionally)","misidentify"],"phonetic":"/ˌoʊvɚaɪˈdɛn.t̬əˌfaɪ/","extraExplanation":["“overidentify”由 over-（过度）+ identify（认同/辨认）构成，常见于心理学、社交媒体讨论或自我成长语境，强调“界限感不足”：把外界评价、某个角色（如工作、身份、粉丝身份）与自我价值绑得太紧。","近义表达可根据语境选择：overinvest (emotionally)（情感投入过多）、take something personally（太往心里去）、project（投射）、misidentify（误认）。"]}
{"word":"overidentifying","summary":{"en":"Overidentifying means identifying too strongly with someone or something, often losing objectivity or boundaries.","zh":"overidentifying 指对某人或某事过度认同/过度代入，常导致失去客观性或界限感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"identifying with someone or something too strongly, often to the point of losing objectivity or healthy boundaries.","zh":"对某人或某事过度认同（或过度代入），强到可能失去客观判断或健康界限。"},"examples":[{"en":"As a therapist, she avoided overidentifying with clients so she could stay objective.","zh":"作为治疗师，她避免对来访者过度认同，这样才能保持客观。"},{"en":"He was overidentifying with the main character and took every criticism of the book personally.","zh":"他对主角过度代入，把别人对这本书的批评都当成在针对自己。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of identifying with someone or something too strongly; becoming too emotionally involved.","zh":"过度认同（的行为）；在情感上过度卷入。"},"examples":[{"en":"Overidentifying can make it hard to see other people’s perspectives.","zh":"过度认同会让人很难看到别人的立场。"},{"en":"Her overidentifying with her team’s success made every loss feel devastating.","zh":"她对团队胜利的过度认同让每一次失败都显得毁灭性。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “overidentify”: to identify with someone or something too strongly.","zh":"“overidentify”的现在分词：对某人或某事认同得过于强烈。"},"examples":[{"en":"He is overidentifying with the role and forgetting it’s just a job.","zh":"他正在对这个角色过度认同，忘了这只是一份工作。"}]}],"synonyms":["overidentify","overassociate","overattach","get too emotionally involved","lose perspective"],"phonetic":"/ˌoʊvər.aɪˈdɛn.təˌfaɪ.ɪŋ/","extraExplanation":["在心理学或助人行业语境里，overidentifying 常与“界限（boundaries）”相关：当你把对方的问题当成自己的问题，可能会影响判断、带来情绪耗竭。它也常用于粉丝文化、身份政治或团队文化中，表示把自我价值过度绑定在某个身份/群体/作品上。"]}
{"word":"overidle","summary":{"en":"Overidle means “too idle or not busy enough,” often implying boredom or trouble.","zh":"overidle 指“过于闲散、太不忙”，常暗示无聊或容易惹事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person, mind, or time) too idle; not busy enough, often leading to boredom or mischief.","zh":"（人、头脑或时间）过于闲散的；太不忙的，常因此感到无聊或惹事。"},"examples":[{"en":"During the long holiday, he became overidle and started picking fights online.","zh":"长假期间他太闲了（过于闲散），就开始在网上找人吵架。"},{"en":"An overidle mind can turn small worries into big problems.","zh":"过于闲散的头脑容易把小担忧放大成大问题。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make (someone) too idle; to leave with too little to do (rare).","zh":"使（某人）过于闲散；让（某人）无事可做（较少见）。"},"examples":[{"en":"The easy schedule overidled the trainees, so the coach added more practice.","zh":"训练安排太轻松，让学员们过于闲散，于是教练增加了练习。"}]}],"synonyms":["overly idle","too idle","unoccupied","inactive","having too much time on one’s hands"],"phonetic":"/ˌoʊvɚˈaɪdəl/","extraExplanation":["这个词由 over-（“过度”）+ idle（“闲着的”）构成，属于较少见的书面或文学用词；日常英语更常用 too idle / overly idle / have too much time on one’s hands。","在较老的英语文本里，它有时带一点道德评判色彩：认为“太闲”会导致懒散、流言或惹事。"]}
{"word":"overidleness","summary":{"en":"Overidleness means excessive idleness—being inactive or unoccupied for too long.","zh":"overidleness 指“过度懒散/过度无所事事”，强调闲得太久、活动和目标感不足。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of being idle too much; excessive lack of work, activity, or purposeful effort","zh":"过度懒散；过度无所事事（闲得太久、缺乏工作或有意义的活动）"},"examples":[{"en":"Overidleness can make the day feel longer and the mind feel dull.","zh":"过度无所事事会让一天显得更漫长，也会让头脑变得迟钝。"},{"en":"The teacher warned that overidleness during vacation could make it harder to return to study routines.","zh":"老师提醒说，假期里过度懒散可能会让开学后更难恢复学习节奏。"}]}],"synonyms":["excessive idleness","prolonged idleness","inactivity","laziness"],"phonetic":"/ˌoʊvərˈaɪd(ə)lnəs/","extraExplanation":["这个词很少见，更常用的表达是“too much idleness / excessive idleness / prolonged idleness”。它由 over-（过度）+ idleness（懒散、闲置）构成，多用于强调“闲得过头”带来的负面影响（如失去动力、效率下降）。"]}
{"word":"overidly","summary":{"en":"“Overidly” is not standard; it’s usually a misspelling of “overly” (too; excessively) or sometimes confusion with “idly” (without purpose; lazily).","zh":"“overidly” 不是标准用法；通常是把 “overly”（过于）拼错了，或与 “idly”（懒散地/无所事事地）混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling. Most commonly, people mean “overly” (too; excessively).","zh":"不是标准英语单词；通常是拼写错误。最常见是想写 “overly”（过于；太；过度地）。"},"examples":[{"en":"He was overidly critical. (Better: He was overly critical.)","zh":"他 overidly 挑剔。（更好：He was overly critical. 他过于挑剔。）"},{"en":"Don’t worry overidly about small mistakes. (Better: Don’t worry overly about small mistakes.)","zh":"别 overidly 担心小错误。（更好：Don’t worry overly about small mistakes. 别过度担心小错误。）"}]},{"partOfSpeech":"adv.","definition":{"en":"If you meant “idly”: without purpose; lazily; not actively doing something.","zh":"如果你想写的是 “idly”：漫无目的地；懒散地；无所事事地。"},"examples":[{"en":"He sat idly by the window.","zh":"他懒散地坐在窗边。"},{"en":"The workers were not standing idly; they were planning the next step.","zh":"工人们并不是无所事事；他们在计划下一步。"}]}],"synonyms":["overly","excessively","too","unduly","idly"],"phonetic":"/ˈoʊvɚli/","extraExplanation":["“overidly” 这种拼法在词典和常见语料里基本找不到，写作中通常会被当作拼写错误。最可能的目标词是：\n- overly = “太/过于”（程度副词，常见搭配 overly expensive/overly sensitive/overly optimistic）\n- idly = “懒散地/无所事事地”（方式副词，常见搭配 sit idly/stand idly by）\n如果你把原句发我，我可以帮你判断到底该用哪个。"]}
{"word":"overidness","summary":{"en":"“Overidness” is not standard English; it’s usually a mistaken or informal form meaning “the state of being overridden.”","zh":"“overidness”不是标准英语；多半是拼写错误或随口造词，想表达“被覆盖/被否决的状态”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/spelling variant. Usually intended to mean “the state of being overridden” (something has been replaced, canceled, or given lower priority), especially in computing or rules/policies.","zh":"非标准/拼写变体。通常想表达“被覆盖/被否决的状态”（某事被替代、取消，或优先级被压过），常见于计算机或规则/政策语境。"},"examples":[{"en":"In the settings, the admin override caused the previous value to be ignored (sometimes informally called “overidness”).","zh":"在设置里，管理员的强制覆盖让之前的数值被忽略了（有时有人随口写成 overidness）。"},{"en":"If you mean the condition of being overridden, clearer words are “override” or “being overridden,” not “overidness.”","zh":"如果你想表达“被覆盖的状态”，更清楚的说法是“override（覆盖/强制更改）”或“being overridden（被覆盖）”，而不是 overidness。"}]}],"synonyms":["override","overriding","being overridden","supersession"],"phonetic":"/ˈoʊvərɪdnəs/","extraExplanation":["“overidness”一般不是标准英语单词，常见原因是把 override / overridden / overriding 之类的词拼错或临时造词。正式写作里建议用：override（名词/动词）、overriding (adj.)、be overridden（被覆盖/被否决）。如果你告诉我你的句子原文或语境（比如编程、权限、政策），我可以帮你改成最自然的英文。"]}
{"word":"overidolatrous","summary":{"en":"“Overidolatrous” means excessively or unhealthily worshipful/admiring—like treating someone or something as an idol.","zh":"“overidolatrous”指过度、失去理性的崇拜或仰慕，像把某人或某物当成偶像。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively devoted to someone or something in a way that feels like worship; too admiring or reverent.","zh":"对某人或某物过度崇拜（近乎当作神来敬拜）；过分仰慕、过度敬奉。"},"examples":[{"en":"Some fans can become overidolatrous, treating a celebrity’s every word as truth.","zh":"有些粉丝会变得过度崇拜，把名人的每一句话都当成真理。"},{"en":"Her biography warns against an overidolatrous view of the leader and includes his mistakes, too.","zh":"她的传记提醒人们不要对这位领袖抱有过度崇拜的看法，也写进了他的错误。"},{"en":"The essay criticizes an overidolatrous attitude toward technology, as if it can solve every human problem.","zh":"这篇文章批评了对科技的过度崇拜，仿佛它能解决所有人类问题。"}]}],"synonyms":["overly reverent","worshipful","idolizing","adulatory","fawning"],"phonetic":"/ˌoʊvərˈaɪdəˌlɑtrəs/","extraExplanation":["“overidolatrous”较少见，属于由前缀“over-（过度）”+ “idolatrous（偶像崇拜的；盲目崇拜的）”构成的加强语。写作中常用来带有批评意味，强调“崇拜到了不理性/不健康的程度”。","与“admiring（欣赏）”“respectful（尊敬）”不同，“idolatrous/overidolatrous”通常暗示失去客观判断，甚至把人或事物当成绝对权威。"]}
{"word":"overidolatrously","summary":{"en":"“Overidolatrously” means doing or speaking with too much idolization or devotion.","zh":"“Overidolatrously”表示“以过度崇拜、过分仰慕的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively idolizing or worshipful way; with too much admiration or devotion (often implying it is unhealthy or unreasonable).","zh":"以过度崇拜、过分敬奉的方式；带着不健康或不理性的过度仰慕（常含贬义）。"},"examples":[{"en":"Some fans speak overidolatrously about the singer, as if she can do no wrong.","zh":"有些粉丝用过度崇拜的口吻谈论那位歌手，好像她永远不会犯错。"},{"en":"He treated his mentor overidolatrously, ignoring the mentor’s real flaws.","zh":"他对导师过度崇拜，忽视了导师真实的缺点。"}]}],"synonyms":["excessively","blindly","worshipfully","adulatingly","with undue admiration"],"phonetic":"/ˌoʊvər aɪˈdɑlətrəsli/","extraExplanation":["这是一个非常少见、偏书面或批评语气的副词，来自 over-（过度）+ idolatrous（偶像崇拜的、盲目崇拜的）+ -ly（副词后缀）。","常用于评论“粉丝文化”“名人崇拜”“权威崇拜”等情境，语气往往带有提醒或批判：不是普通的 admire（欣赏），而是接近 worship（崇拜）。","更常见的表达包括：excessively / blindly / worshipfully / with undue admiration 等；在日常口语中很少直接用 overidolatrously。"]}
{"word":"overidolatrousness","summary":{"en":"Overidolatrousness means excessive, often unhealthy idol-worship or admiration.","zh":"overidolatrousness 指“过度（且常带不健康倾向的）偶像崇拜/迷恋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being excessively idolatrous; showing extreme or unhealthy worship/admiration toward a person, object, or idea.","zh":"过度偶像崇拜（的状态/性质）；对某个人、事物或观念表现出极端或不健康的崇拜与迷恋。"},"examples":[{"en":"Some critics argued that the celebrity culture encouraged overidolatrousness rather than healthy appreciation of talent.","zh":"一些评论家认为，名人文化助长的是过度偶像崇拜，而不是对才华的健康欣赏。"},{"en":"His overidolatrousness of the company’s founder made him ignore serious problems in management.","zh":"他对公司创始人的过度崇拜，让他忽视了管理上的严重问题。"}]}],"synonyms":["idolatry","hero-worship","excessive adoration","veneration","cult of personality"],"phonetic":"/ˌoʊvər aɪˈdɑlətrəsnəs/","extraExplanation":["这是一个非常少见、偏“造词/学术化”的名词，由 over-（过度）+ idolatrous（偶像崇拜的）+ -ness（名词后缀，表示“性质/状态”）组成。日常写作更常用 excessive adoration / hero-worship / idolatry 来表达类似意思。","语感上它带有批评色彩：强调“崇拜到不理性”的程度，而不仅仅是“很喜欢”。在讨论粉丝文化、政治人物个人崇拜、品牌迷信等话题时更贴切。"]}
{"word":"overijssel","summary":{"en":"Overijssel is a province in the eastern Netherlands.","zh":"Overijssel 指荷兰东部的上艾瑟尔省。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A province in the eastern Netherlands, known for cities such as Zwolle, Deventer, and Enschede.","zh":"荷兰东部的一个省（上艾瑟尔省），以兹沃勒、代芬特尔、恩斯赫德等城市闻名。"},"examples":[{"en":"Zwolle is the capital city of Overijssel.","zh":"兹沃勒是上艾瑟尔省的省会。"},{"en":"She traveled through Overijssel to visit Deventer and its historic center.","zh":"她穿行上艾瑟尔省，去参观代芬特尔及其历史城区。"}]}],"synonyms":["Overijssel Province"],"phonetic":"/ˌoʊvərˈeɪsəl/","extraExplanation":["“Overijssel”是荷兰语地名，字面可理解为“在艾瑟尔河（IJssel）之上/对岸的地区”，与当地河流与地理位置有关。","英文里它通常作为专有名词使用（省名），写作 Overijssel；中文常译作“上艾瑟尔省”。","发音上，重音通常落在后半部分（-ijssel）；其中 “ij” 在荷兰语里类似英语的 /eɪ/ 音（近似）。"]}
{"word":"overillustrate","summary":{"en":"“Overillustrate” means to explain or illustrate something too much, using excessive examples or visuals.","zh":"“overillustrate”指用过多的例子或图示来说明某事，导致显得过度、累赘。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to illustrate or explain with too many pictures, examples, or details, so that it feels excessive or distracting","zh":"用过多的图示、例子或细节来说明（以至于显得多余或分散注意力）"},"examples":[{"en":"The slides overillustrate the point with five nearly identical charts.","zh":"这些幻灯片用五张几乎一样的图表把重点“过度图示”了。"},{"en":"Try not to overillustrate your essay—one strong example is usually enough.","zh":"写作文尽量别过度举例或配图——一个有力的例子通常就够了。"},{"en":"The manual overillustrates each step, which makes it harder to find what you need.","zh":"说明书把每一步都配了太多图，反而更难快速找到需要的信息。"}]}],"synonyms":["overexplain","overelaborate","belabor","explain too much"],"phonetic":"/ˌoʊvərˈɪləstreɪt/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”，放在动词前常带有“做得过头了”的含义：例如 overthink（想太多）、overexplain（解释过度）。因此 overillustrate 往往暗含“本来想帮助理解，但信息量过多导致效果变差”。","这个词不算特别高频，更常见的表达有 overexplain（解释过度）、give too many examples（举太多例子）、use too many illustrations（用太多插图）。在写作、演讲、做PPT、写说明书等语境里会更常用。"]}
{"word":"overillustrated","summary":{"en":"Overillustrated means having too many illustrations, or (figuratively) being explained with too many examples/details.","zh":"overillustrated 指插图过多；也可比喻指举例/细节过多、讲解过度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too many illustrations or decorative pictures, so the page/design looks crowded.","zh":"插图（或装饰图）过多的；过度配图的（导致版面显得拥挤）。"},"examples":[{"en":"The children’s book felt overillustrated, with a picture on nearly every line.","zh":"这本儿童书显得插图太多，几乎每一行旁边都有一张图。"},{"en":"The brochure is overillustrated, so the key information is hard to find.","zh":"这份宣传册配图过多，所以关键信息反而不好找。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figuratively: explained with too many examples or details, making it longer than necessary.","zh":"（比喻）举例或细节过多的；讲解过度的（显得冗长）。"},"examples":[{"en":"Her essay is clear, but it’s a bit overillustrated with repeated examples.","zh":"她的文章很清楚，但重复举例有点过度，显得冗长。"},{"en":"Try not to overillustrate your point—one strong example is enough.","zh":"别把观点解释得太“配图式”冗长——一个有力的例子就够了。"}]}],"synonyms":["overly illustrated","picture-heavy","overdecorated","overexplained","too detailed"],"phonetic":"/ˌoʊvərˈɪləstreɪtɪd/","extraExplanation":["“over-”表示“过度、太多”；“illustrated”既可以指“有插图的”，也可以指“用例子说明的”。因此 overillustrated 既可用于出版/版式（图太多），也可用于写作/表达（例子太多）。","常见近义表达：too many pictures / overly illustrated（图太多）；overexplained / too detailed（解释太多）。"]}
{"word":"overillustrating","summary":{"en":"Overillustrating means explaining or presenting something with too many examples or visuals, making it less clear.","zh":"overillustrating 指用过多例子或图示来说明内容，反而降低清晰度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"explaining something with too many examples, details, or visuals, so it becomes repetitive or less clear.","zh":"用过多的例子、细节或图示来解释，导致内容重复或反而不清楚。"},"examples":[{"en":"The teacher was overillustrating the point, and students got lost in the extra details.","zh":"老师为了说明观点举了太多例子，学生反而被额外细节带偏了。"},{"en":"Try not to keep overillustrating—one strong example is usually enough.","zh":"尽量别一直过度举例——一个有力的例子通常就够了。"}]},{"partOfSpeech":"v.","definition":{"en":"adding too many pictures or diagrams to a book, article, or presentation.","zh":"在书籍、文章或演示中加入过多图片或图表。"},"examples":[{"en":"The editor warned that we were overillustrating the chapter and distracting readers from the text.","zh":"编辑提醒我们这一章插图太多，会分散读者对正文的注意力。"},{"en":"The slides felt crowded because we kept overillustrating every step.","zh":"幻灯片显得很拥挤，因为我们每一步都加了太多图示。"}]}],"synonyms":["overexplain","belabor","overdo","hammer home","go into excessive detail"],"phonetic":"/ˌoʊvərˈɪləˌstreɪtɪŋ/","extraExplanation":["“over-”这个前缀常表示“过度、太多”（如 overwork 过度工作，overthink 想太多）。因此 overillustrate/overillustrating 通常带有“做过头了”的负面语气。","在写作或演讲中，适度的例子能帮助理解；但“overillustrating”会让重点被淹没，读者/听众更难抓住主线。"]}
{"word":"overillustration","summary":{"en":"Overillustration means using too many illustrations or visuals, making content cluttered or distracting.","zh":"Overillustration 指插图或视觉元素使用过多，导致内容显得杂乱或分散注意力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of adding too many pictures, diagrams, or visual details, so the main message becomes cluttered or confusing.","zh":"（对文字或内容）过度配图、过度插图；因图像或视觉细节太多而显得杂乱、难以抓住重点。"},"examples":[{"en":"The manual suffered from overillustration, and it was hard to find the steps you actually needed.","zh":"这本说明书因为过度配图而显得很乱，很难找到真正需要的操作步骤。"},{"en":"To avoid overillustration, use one clear diagram instead of five similar images.","zh":"为了避免过度配图，与其放五张相似图片，不如用一张清晰的示意图。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific set of excessive illustrations or visual decorations in a book, article, slide deck, or design.","zh":"（书籍、文章、幻灯片或设计中）一组过多的插图/装饰性图像；过量的视觉元素配置。"},"examples":[{"en":"The editor asked us to cut the overillustration in the first chapter.","zh":"编辑让我们删减第一章里那些过量的插图。"},{"en":"The presentation’s overillustration distracted the audience from the data.","zh":"这份演示的过度配图让观众注意力偏离了数据本身。"}]}],"synonyms":["over-illustration","excessive illustration","too many visuals","visual clutter"],"phonetic":"/ˌoʊvərˌɪləˈstreɪʃən/","extraExplanation":["“over-”这个前缀常表示“过度、太多”（如 overwork 过度工作，overthink 想太多）。因此 overillustration 直观上就是“插图过多”。","这个词在日常口语里不算常见，更常见的表达是“too many illustrations/images”或“overly illustrated”。在写作、排版、教学课件等语境中更容易见到。"]}
{"word":"overillustrative","summary":{"en":"Overillustrative describes writing or speaking that uses too many examples or details, making the message longer or less clear.","zh":"overillustrative 指写作或表达中举例/细节过多，导致内容冗长或不够清晰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using too many examples, details, or explanations, so that something becomes longer or less clear than necessary.","zh":"过度举例或过度说明的；用太多细节/例子导致表达冗长或不够清晰的。"},"examples":[{"en":"The report is accurate, but it’s overillustrative and hard to skim.","zh":"这份报告很准确，但举例太多、太啰嗦，不容易快速浏览。"},{"en":"Try not to be overillustrative—one strong example is usually enough.","zh":"尽量别过度举例——通常一个有力的例子就够了。"},{"en":"His explanation became overillustrative and the main point got lost.","zh":"他的解释变得过度说明，结果重点反而被淹没了。"}]}],"synonyms":["wordy","overly detailed","long-winded","overexplained","too elaborate"],"phonetic":"/ˌoʊvərˈɪləstreɪtɪv/","extraExplanation":["“over-”表示“过度/太……”（如 overconfident 过度自信、overthink 想太多），“illustrative”表示“用来说明的/举例说明的”。合在一起就是“举例说明得过头”。","这是偏正式、常见于写作批评或编辑建议的词：并不是说例子不好，而是提醒“例子过多会影响重点、节奏与可读性”。写作中常用的替代说法有：too detailed（太细）、overly explained（解释过度）、wordy（冗长）。"]}
{"word":"overillustratively","summary":{"en":"“Overillustratively” means doing something with too many examples or explanatory details, often to the point of being excessive.","zh":"“Overillustratively”指以过多例子或说明细节来表达，常常多到显得冗余或过头。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that explains or shows something with too many illustrations, examples, or details (so it may feel excessive or unnecessary).","zh":"以一种“过度举例/过度说明”的方式（用太多插图、例子或细节来解释，显得冗余或过分）。"},"examples":[{"en":"The report was written overillustratively, with long side stories that distracted from the main point.","zh":"这份报告写得过度说明，夹杂了很多旁支故事，反而分散了重点。"},{"en":"He taught the grammar point overillustratively, giving ten examples when three would have been enough.","zh":"他讲这个语法点讲得过度举例，给了十个例子，其实三个就够了。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Literary/rare) In an overly decorative or picture-like way, especially in writing or design.","zh":"（文学/少见）以过于装饰、过于“图像化”的方式（尤指写作或设计风格）。"},"examples":[{"en":"The description is overillustratively vivid, leaving little room for the reader’s imagination.","zh":"这段描写生动得有些过头，几乎不给读者想象空间。"}]}],"synonyms":["overly","excessively","in an overly detailed way","with too many examples","over-explainingly"],"phonetic":"ˌoʊvɚˈɪləˌstreɪtɪvli","extraExplanation":["“overillustratively”由 over-（过度）+ illustrative（说明性的/示意性的）+ -ly（副词后缀）构成，意思通常带有轻微批评：信息多到影响清晰度或重点。","这个词在日常英语里比较少见；更常见的表达有：“with too many examples / in an overly detailed way / over-explain(ing)”。写作中使用它会显得较正式或偏学术评论语气。"]}
{"word":"overimaginative","summary":{"en":"Overimaginative means having too much imagination in a way that becomes unrealistic or exaggerated.","zh":"overimaginative 指想象过度，以至于显得不切实际或夸张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much imagination; creating ideas that are unrealistic, exaggerated, or unlikely to be true.","zh":"想象过度的；过于天马行空的（常指不切实际、夸张或不太可能为真）。"},"examples":[{"en":"His overimaginative story sounded exciting, but it probably didn’t happen that way.","zh":"他那段过于天马行空的故事听起来很刺激，但大概不是那样发生的。"},{"en":"The report was criticized for being overimaginative and not based on solid evidence.","zh":"这份报告因过于想象化、缺乏扎实证据而受到批评。"},{"en":"Try not to be overimaginative when you read the email—ask for clarification instead.","zh":"读那封邮件时别过度脑补，最好直接去问清楚。"}]}],"synonyms":["far-fetched","unrealistic","fanciful","exaggerated","overactive (imagination)"],"phonetic":"/ˌoʊvər ɪˈmædʒɪnətɪv/","extraExplanation":["“over-”表示“过度、太……”，所以 overimaginative 往往带有轻微的负面评价：不是单纯“有创意”，而是“想太多/不够现实”。如果想表达正面“富有想象力”，更常用 imaginative 或 creative。"]}
{"word":"overimaginatively","summary":{"en":"“Overimaginatively” means doing or thinking in an overly imaginative, unrealistic way.","zh":"“overimaginatively”指以过度想象、偏离现实的方式去描述、思考或解读。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too imaginative; by imagining things more than is reasonable or realistic.","zh":"过度地（或不切实际地）富于想象；想得太多、太夸张。"},"examples":[{"en":"She described the event overimaginatively, adding details that never happened.","zh":"她把那件事讲得过于天马行空，还加了很多并未发生的细节。"},{"en":"Don’t read his message overimaginatively—it’s probably just a simple update.","zh":"别把他的消息过度脑补——很可能只是个简单的更新。"},{"en":"The story is written overimaginatively, which can confuse younger readers.","zh":"这篇故事写得过度夸张，可能会让年幼的读者感到困惑。"}]}],"synonyms":["too imaginatively","in an overly imaginative way","unrealistically","overactively (imagining)"],"phonetic":"/ˌoʊvərɪˈmædʒənətɪvli/","extraExplanation":["“over-”表示“过度/太……”，加在“imaginative（富有想象力的）”前形成“overimaginative（过度想象的）”，再加“-ly”变成副词“overimaginatively”。","这个词在日常英语中不算常见；更自然的表达常用“too imaginatively / in an overly imaginative way / overactively imagining”等来替代，语气更口语、也更易懂。"]}
{"word":"overimaginativeness","summary":{"en":"Overimaginativeness means an overly active imagination that can lead to unrealistic or exaggerated ideas.","zh":"overimaginativeness 指“过度想象”，即想象力过于活跃，容易产生不切实际或夸张的想法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or habit of imagining too much, especially in a way that is unrealistic, exaggerated, or not based on evidence.","zh":"过度想象（的习惯或特质）；尤指不切实际、夸张或缺乏根据的想象。"},"examples":[{"en":"Her overimaginativeness sometimes turns small problems into disasters in her mind.","zh":"她的过度想象有时会把小问题在脑海里放大成灾难。"},{"en":"The rumor spread because of people’s overimaginativeness, not because of facts.","zh":"谣言之所以传播，是因为人们过度想象，而不是因为事实。"},{"en":"A little creativity helps, but overimaginativeness can make planning unrealistic.","zh":"一点创造力有帮助，但过度想象会让计划变得不现实。"}]}],"synonyms":["overactive imagination","excessive imagination","fantasy-proneness","overimagination"],"phonetic":"/ˌoʊvərɪˈmædʒɪnətɪvnəs/","extraExplanation":["“overimaginativeness”不是非常常见的标准词，更多时候人们会说：overactive imagination（想象力过于活跃）、excessive imagination（过度的想象）、fantasy-prone（容易沉浸幻想的）。","构词：over-（过度）+ imaginative（富于想象的）+ -ness（名词后缀，表示“性质/状态”）。因此它强调的是一种“倾向/特质”。","语气上通常带轻微负面含义：暗示把事情想得太复杂、太戏剧化或脱离现实；在写作中可用于批评，也可用于自嘲。"]}
{"word":"overimbibe","summary":{"en":"“Overimbibe” means to drink too much, usually alcohol.","zh":"“overimbibe”指饮用过量，通常指喝酒过量。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to drink too much, especially alcohol; to overindulge in drinking","zh":"饮用过量（尤指酒精）；过度饮酒"},"examples":[{"en":"He overimbibed at the party and had to take a taxi home.","zh":"他在派对上喝过量了，只好打车回家。"},{"en":"Try not to overimbibe if you have an early meeting tomorrow.","zh":"如果你明天一早要开会，尽量别喝过量。"}]}],"synonyms":["overdrink","drink too much","drink excessively","overindulge","imbibe too much"],"phonetic":"/ˌoʊvərɪmˈbaɪb/","extraExplanation":["“overimbibe”由前缀 over-（过度）+ imbibe（饮用；吸收）组成，语气较正式、带一点文学/书面色彩。日常更常说 “drink too much / overdrink / drink excessively”。"]}
{"word":"overimbibed","summary":{"en":"Overimbibed means having drunk too much (usually alcohol), and sometimes figuratively having absorbed too much of something.","zh":"overimbibed 指（通常是酒）喝得过多而醉；也可比喻对某事物吸收过量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having drunk too much alcohol; overly intoxicated.","zh":"（酒）喝得过多的；过度饮酒而醉的。"},"examples":[{"en":"He was clearly overimbibed and started speaking louder than usual.","zh":"他显然喝多了，说话声比平时大得多。"},{"en":"The staff refused to serve anyone who seemed overimbibed.","zh":"工作人员拒绝为看起来喝醉的人继续提供酒精饮品。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Having absorbed too much of something (ideas, culture, information), often to an excessive degree.","zh":"（比喻）吸收/接受某事物过多（如观念、文化、信息），到了过头的程度。"},"examples":[{"en":"After a week of nonstop news, she felt overimbibed and mentally exhausted.","zh":"一周不停刷新闻后，她觉得信息摄入过量，精神很疲惫。"},{"en":"He sounded a bit overimbibed in self-help slogans.","zh":"他听起来有点把自助书口号“吸收过量”了。"}]}],"synonyms":["intoxicated","drunk","inebriated","tipsy","overindulged"],"phonetic":"/ˌoʊvərɪmˈbaɪbd/","extraExplanation":["“overimbibed”常带一点幽默或较正式的语气，用来委婉地说“喝醉了/喝多了”，比直接说 drunk 更含蓄。","imbibe 本意是“饮用”，也可指“吸收（思想、文化）”；加上 over- 表示“过度”。因此它既能指酒喝多，也能比喻“摄入过量”。","在文学或较讲究的写作里，作者有时用这类词来制造轻微的讽刺或文雅的距离感（像在用“学术腔”描述醉态）。"]}
{"word":"overimbibes","summary":{"en":"“Overimbibes” means “drinks too much,” usually alcohol (rare word; sometimes used figuratively for taking in too much information).","zh":"“Overimbibes”指“喝得太多（通常指酒）”，是较少见的用词；也可少见地比喻“吸收/接收过多信息”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of **overimbibe**) to drink too much alcohol; to overindulge in drinking.","zh":"（**overimbibe** 的第三人称单数）饮酒过量；酗酒、喝得太多。"},"examples":[{"en":"He sometimes overimbibes at office parties and regrets it the next day.","zh":"他有时在公司聚会上喝得太多，第二天就后悔。"},{"en":"If she overimbibes, she gets a headache quickly.","zh":"如果她饮酒过量，很快就会头痛。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, rare) to take in too much of something, such as information or opinions.","zh":"（比喻用法，较少见）吸收/接收过多（如信息、观点等）。"},"examples":[{"en":"After hours online, he overimbibes news and feels anxious.","zh":"在网上刷了好几个小时后，他“摄入”了过量新闻，变得焦虑。"}]}],"synonyms":["overdrink","drink too much","binge-drink","overindulge","drink heavily"],"phonetic":"/ˌoʊvərɪmˈbaɪbz/","extraExplanation":["这个词很少见，更常见的表达是 **drink too much / overdrink / binge-drink**（狂饮）。","**over-** 表示“过度”，**imbibe** 原意是“喝（尤指酒）”，也可引申为“吸收（思想、信息）”。因此 **overimbibe** 字面就是“喝/吸收得过多”。","在正式写作里，**imbibe** 往往带一点文学或幽默色彩；用 **overimbibes** 会显得更刻意、更书面。"]}
{"word":"overimbibing","summary":{"en":"Overimbibing means drinking excessively; less commonly, it can mean absorbing too much of something (figuratively).","zh":"overimbibing 指饮用过量（尤指饮酒）；较少见时也可比喻为过度吸收某种信息或观念。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"drinking too much alcohol (or too much of any drink); excessive drinking","zh":"饮酒（或喝任何饮料）过量；过度饮用"},"examples":[{"en":"The doctor warned him that overimbibing could damage his liver.","zh":"医生警告他，过度饮酒可能会损害肝脏。"},{"en":"After a stressful week, she promised herself she wouldn’t go out overimbibing again.","zh":"在压力很大的一周之后，她答应自己不再出去喝得过量了。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, less common) taking in too much of something, such as ideas, media, or information","zh":"（比喻，较少见）过度“吸收”某事物，如观点、媒体内容或信息"},"examples":[{"en":"He spent the weekend overimbibing political news and felt anxious afterward.","zh":"他周末过度刷政治新闻，之后感到焦虑。"}]}],"synonyms":["overdrinking","excessive drinking","drinking too much","overindulging (in alcohol)"],"phonetic":"/ˌoʊvərɪmˈbaɪbɪŋ/","extraExplanation":["“overimbibing”来自动词“imbibe”（意为“饮用；吸收”）加前缀“over-”（表示“过度”）。在正式或书面语里更常见；日常口语通常会说“drinking too much / overdrinking”。"]}
{"word":"overimitate","summary":{"en":"Overimitate means to imitate too much, in a way that feels excessive or unnatural.","zh":"overimitate 指“过度模仿”，模仿得太多而显得不自然或缺乏原创性。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to imitate someone or something too much, so that it becomes unnatural, excessive, or loses originality","zh":"过度模仿（某人/某事），以至于显得不自然、过头或缺乏原创性"},"examples":[{"en":"New actors sometimes overimitate famous stars and end up sounding unnatural.","zh":"新演员有时会过度模仿明星，结果说话听起来很不自然。"},{"en":"Don’t overimitate the model answer—use your own words.","zh":"别过度照搬范文——用你自己的表达。"},{"en":"If you overimitate your teacher’s style, your writing may lose its personal voice.","zh":"如果你过度模仿老师的风格，你的写作可能会失去个人特色。"}]}],"synonyms":["imitate too closely","copy too much","mimic excessively","ape (someone)"],"phonetic":"/ˌoʊvərˈɪməˌteɪt/","extraExplanation":["“over-”是常见前缀，表示“过度、太多”。所以 overimitate 强调“模仿得过头”，常带负面含义（不自然、缺乏原创）。","这个词在日常英语里不算常见，更常见的表达有：copy too much（抄/学太多）、imitate too closely（模仿得太像）、be a copycat（像跟风者/模仿者）。"]}
{"word":"overimitated","summary":{"en":"Overimitated means copied so much that it feels unoriginal or clichéd.","zh":"overimitated 指“被过度模仿，以至于显得不新颖或俗套”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Copied too much or too often, so it feels unoriginal, clichéd, or lacking freshness.","zh":"被过度模仿的；模仿得太多（以至于显得缺乏新意、流于俗套）的。"},"examples":[{"en":"The melody is catchy, but the style feels overimitated in pop music today.","zh":"旋律很抓耳，但这种风格在当今流行音乐里被模仿得太多，显得有点俗套。"},{"en":"After years of trends, the once-bold look became overimitated and lost its impact.","zh":"经过多年的潮流跟风，这种曾经大胆的造型被过度模仿，冲击力也就变弱了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person or creator) having had one’s work copied excessively by others.","zh":"（指人或创作者）作品被他人过度仿效的。"},"examples":[{"en":"Some designers feel overimitated when fast-fashion brands copy their signature pieces.","zh":"当快时尚品牌抄袭他们的标志性作品时，一些设计师会觉得自己的作品被过度仿效了。"},{"en":"The photographer complained that her concept was overimitated online without credit.","zh":"这位摄影师抱怨自己的创意在网上被大量模仿，却没人署名。"}]}],"synonyms":["overcopied","overused","clichéd","derivative","hackneyed"],"phonetic":"/ˌoʊvɚˈɪmɪˌteɪtɪd/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、太多”。所以 overimitated 字面意思就是“被模仿得过头”。常用来评价风格、点子、套路、梗等因为太多人照搬而变得不新鲜。","更常见、更自然的替代表达有：overcopied（被抄太多）、overused（被用烂了）、clichéd / cliché（俗套的）、derivative（缺乏原创、模仿痕迹重）。"]}
{"word":"overimitating","summary":{"en":"Overimitating means copying someone too much so it feels unnatural or exaggerated.","zh":"overimitating 指过度模仿，模仿得太多以至于显得不自然或夸张。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) copying someone’s style, words, or actions too much, often so it looks unnatural, forced, or like a parody.","zh":"（现在分词）过度模仿某人的风格、措辞或行为，程度太高以至于显得不自然、做作，甚至像在讽刺/滑稽模仿。"},"examples":[{"en":"He was overimitating his teacher’s accent, and it came across as rude.","zh":"他过度模仿老师的口音，让人感觉很不礼貌。"},{"en":"She realized she was overimitating influencers online instead of developing her own style.","zh":"她意识到自己在过度模仿网络红人，而不是发展自己的风格。"},{"en":"The actor stopped overimitating and started focusing on the character’s emotions.","zh":"那位演员不再过度模仿，开始把重点放在角色的情绪上。"}]}],"synonyms":["overcopying","mimicking too closely","aping","parroting","copying excessively"],"phonetic":"/ˌoʊvɚˈɪməˌteɪtɪŋ/","extraExplanation":["“overimitating”来自“over-（过度）+ imitate（模仿）”。它不是最常见的日常词，更常见的表达有：copying someone too much（模仿太多）、trying too hard to imitate（太用力在模仿）、doing a poor impression（拙劣的模仿）。","语气上常带轻微批评：强调“像得太刻意/太过头”，而不只是“模仿”。在学习口音、写作风格或职场表达时，会用来提醒：要吸收优点，但不要失去自己的自然表达。"]}
{"word":"overimitation","summary":{"en":"Overimitation means copying too closely or copying unnecessary steps, especially in learning contexts.","zh":"overimitation 指“过度模仿”，既可泛指模仿过头，也可特指学习中复制不必要步骤的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or habit of copying someone else too closely or too much, often without thinking for yourself.","zh":"过度模仿；模仿过头（指不加思考地过分照搬他人的做法或风格）。"},"examples":[{"en":"His overimitation of his boss’s speaking style sounded unnatural.","zh":"他过度模仿老板的说话方式，听起来很不自然。"},{"en":"Overimitation can stop students from developing their own voice in writing.","zh":"过度模仿可能会阻碍学生在写作中形成自己的风格。"}]},{"partOfSpeech":"n.","definition":{"en":"(In child development and learning) copying actions that are unnecessary for achieving a goal, especially when learning from an adult.","zh":"（儿童发展与学习领域）过度模仿：为了达成目标而复制一些其实不必要的动作，尤其常见于向成人学习时。"},"examples":[{"en":"In the experiment, children showed overimitation by repeating extra steps that did not help open the box.","zh":"在实验中，孩子们表现出过度模仿：重复了一些对打开盒子并无帮助的额外步骤。"},{"en":"Researchers study overimitation to understand how culture and teaching shape learning.","zh":"研究者研究过度模仿，以理解文化与教学如何影响学习。"}]}],"synonyms":["excessive imitation","copying too closely","blind imitation"],"phonetic":"/ˌoʊvərˌɪməˈteɪʃən/","extraExplanation":["“over-”表示“过度/太……”，加在“imitation（模仿）”前面就变成“overimitation（过度模仿）”。","这个词在日常语境里可指“模仿过头、没有自己的想法”；在心理学与教育学语境里更常用来描述儿童学习时“把不必要的步骤也一并学走”的现象。","相关词：imitation（模仿）、copycat（盲目模仿者/跟风者）、mimicry（模仿行为，常偏生物学/社会行为用语）。"]}
{"word":"overimitative","summary":{"en":"Overimitative means “excessively copying others,” often implying a lack of originality.","zh":"overimitative 指“过度模仿他人”，常暗示缺乏原创性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too eager to copy other people’s behavior, style, or ideas; excessively imitative in a way that can seem unoriginal.","zh":"过度模仿的；一味照搬他人（行为、风格或想法）的，显得缺乏原创性。"},"examples":[{"en":"The critic said the band’s new album was overimitative and didn’t add anything new to the genre.","zh":"评论家说这支乐队的新专辑过度模仿，没有给这种音乐类型带来新东西。"},{"en":"At first her writing felt overimitative of her favorite author, but her own voice slowly emerged.","zh":"起初她的写作很像是在过度模仿她最喜欢的作家，但后来她逐渐形成了自己的风格。"},{"en":"Teachers may worry when a student becomes overimitative instead of experimenting with original ideas.","zh":"当学生一味过度模仿而不去尝试原创想法时，老师可能会担心。"}]}],"synonyms":["derivative","copycat","unoriginal","too imitative"],"phonetic":"/ˌoʊvərˈɪməˌteɪtɪv/","extraExplanation":["“over-”表示“过度、太多”，而“-imitative”来自“imitate（模仿）”。因此 overimitative 强调“模仿过头”，带有批评意味，常用于艺术、写作、设计、行为等语境。","与 imitative（善于/倾向模仿的，中性或正面）相比，overimitative 更强调“缺乏创新、照搬痕迹明显”。"]}
{"word":"overimitatively","summary":{"en":"“Overimitatively” means “in an overly imitative way,” copying too much and lacking originality.","zh":"“overimitatively”表示“过度模仿地”，强调模仿太多、缺乏原创性。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that imitates someone or something too much; excessively imitating rather than being original.","zh":"以过度模仿的方式；模仿得太多而缺乏原创性。"},"examples":[{"en":"The actor played the role overimitatively, copying every gesture of the famous star instead of creating his own character.","zh":"这位演员表演得过于模仿，把那位名星的每个动作都照搬了过来，而没有塑造出自己的角色。"},{"en":"The student wrote overimitatively, sounding exactly like the textbook and not like a real person.","zh":"这位学生写作太过模仿，读起来完全像课本，不像真实的人在表达。"}]}],"synonyms":["overly imitatively","too imitatively","imitatively (too much)","with excessive imitation"],"phonetic":"/ˌoʊvərˈɪmɪtətɪvli/","extraExplanation":["“overimitatively”由 over-（过度）+ imitative（模仿的）+ -ly（副词）构成，常见于批评写作、表演、艺术风格时，强调“模仿过头、失去个人风格”。","这个词非常少见；更常用、更自然的表达包括：“too imitatively / in an overly imitative way / with excessive imitation”。"]}
{"word":"overimitativeness","summary":{"en":"Overimitativeness means an excessive tendency to imitate others instead of developing your own way.","zh":"Overimitativeness 指过度模仿他人的倾向，强调缺乏自己的方式或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency or quality of copying others too much or too closely; excessive imitation","zh":"过度模仿的倾向或特质；模仿过头"},"examples":[{"en":"The artist fought against overimitativeness and tried to develop an original style.","zh":"这位艺术家努力对抗过度模仿，试图发展出原创风格。"},{"en":"Overimitativeness in writing can make your voice sound like someone else’s.","zh":"写作中过度模仿会让你的文字声音听起来像别人的。"},{"en":"Teachers sometimes encourage students to learn by imitation—but not to the point of overimitativeness.","zh":"老师有时会鼓励学生通过模仿来学习——但不要模仿过头。"}]}],"synonyms":["overimitation","excessive imitation","copycat behavior","imitativeness"],"phonetic":"/ˌoʊvərˈɪmɪtətɪvnəs/","extraExplanation":["“overimitativeness”不是很常见的日常词，更常见的表达是“overimitation”（过度模仿）或说某人“overly imitative / too imitative”。写作或批评场景里偶尔会用它来强调“像是在复制别人”，而不是在学习借鉴。","在心理学与发展研究里，“overimitation/过度模仿”常指儿童不仅模仿有效步骤，还会照做一些其实不必要的动作；这通常被解释为社会学习、对规范的敏感或对成人权威的信任。"]}
{"word":"overimmunize","summary":{"en":"Overimmunize means to immunize excessively (more than needed), and it can also be used figuratively for overprotecting someone from risk.","zh":"overimmunize 指“过度免疫（超过需要的免疫/接种）”，也可比喻为“过度保护”，使人缺少应对风险的能力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give more vaccination or immune stimulation than is necessary; to immunize excessively","zh":"过度免疫；接种或刺激免疫反应超过必要程度"},"examples":[{"en":"Some parents worry that giving too many shots too close together might overimmunize a child, but they should ask a doctor for evidence-based guidance.","zh":"一些家长担心在短时间内打太多疫苗会让孩子过度免疫，但应向医生咨询循证的建议。"},{"en":"The clinic reviewed its schedule to avoid accidentally overimmunizing patients with duplicate doses.","zh":"诊所检查了接种安排，以避免因重复剂量而让患者被过度免疫。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to protect someone so much that they become less prepared to handle real-life risk or difficulty","zh":"（比喻）过度保护，使人缺乏面对现实风险或困难的能力"},"examples":[{"en":"If we overimmunize students against failure, they may never learn resilience.","zh":"如果我们让学生对失败“过度免疫”（过度防护），他们可能学不会韧性。"},{"en":"The author warns against overimmunizing children from discomfort, because small challenges help them grow.","zh":"作者警告不要让孩子远离不适到“过度免疫”的程度，因为小挑战有助于成长。"}]}],"synonyms":["overvaccinate","immunize excessively","give unnecessary doses","overprotect (figurative)"],"phonetic":"/ˌoʊvərˈɪmjəˌnaɪz/","extraExplanation":["“overimmunize”由前缀 over-（过度）+ immunize（使免疫）构成，属于较少见的用词；在医学写作中更常见的是“overvaccinate（过度接种）”或直接说“unnecessary/duplicate doses（不必要/重复剂量）”。","在公共健康语境里，这个词可能带有主观判断；讨论疫苗时，表达应尽量基于权威指南与具体情境（年龄、既往接种史、免疫缺陷等）。"]}
{"word":"overimmunized","summary":{"en":"Overimmunized means having more immunizations than recommended/needed, or being excessively protected against a disease.","zh":"overimmunized 指接种的免疫针剂超过建议/需要，或引申为对疾病的免疫保护过强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having received more vaccinations or booster shots than is medically recommended or needed (often used informally or critically).","zh":"（通常为非正式或带批评意味）接种了超过医学建议或实际需要的疫苗/加强针；“过度免疫”的。"},"examples":[{"en":"Some parents worry their child is overimmunized, but doctors usually follow a recommended schedule.","zh":"有些家长担心孩子被“过度免疫”，但医生通常会遵循推荐的接种计划。"},{"en":"The article argues that certain groups may be overimmunized due to repeated booster campaigns.","zh":"这篇文章认为某些群体可能因为反复的加强针行动而出现“过度免疫”。"}]},{"partOfSpeech":"adj.","definition":{"en":"In a broader sense, overly protected against a disease (for example, after vaccination plus strong natural immunity).","zh":"（引申义）对某种疾病过于“有保护力”的；免疫保护过强（例如疫苗接种后又叠加了很强的自然免疫）。"},"examples":[{"en":"After vaccination and a past infection, she felt almost overimmunized against the virus.","zh":"在接种疫苗并感染过一次之后，她觉得自己对这种病毒几乎“免疫过头”了。"}]}],"synonyms":["over-vaccinated","overprotected (against disease)","excessively immunized"],"phonetic":"/ˌoʊvərˈɪmjəˌnaɪzd/","extraExplanation":["“overimmunized”不是非常常见的标准医学术语，更常见的是说“over-vaccinated”（疫苗打得过多）或讨论“unnecessary boosters”（不必要的加强针）。","在医学沟通中是否“过度”取决于年龄、基础疾病、地区免疫规划、疫苗类型与间隔等；如果你在真实健康情境中看到这个词，通常带有观点或争议色彩。"]}
{"word":"overimmunizing","summary":{"en":"“Overimmunizing” means giving vaccines more often or in greater amounts than needed or recommended.","zh":"“overimmunizing”指疫苗接种过多、过频，超过需要或推荐。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving more immunizations (vaccines) than necessary, or vaccinating too often—beyond what is recommended.","zh":"（疫苗接种）过度免疫：接种次数或剂量超过需要，或超出推荐的接种频率。"},"examples":[{"en":"Some parents worry that overimmunizing might cause unnecessary side effects.","zh":"有些家长担心过度免疫可能带来不必要的副作用。"},{"en":"Doctors follow official schedules to avoid overimmunizing children.","zh":"医生会遵循官方接种程序，以避免给儿童过度免疫。"},{"en":"The clinic checked her records to make sure she wasn’t overimmunizing during the outbreak.","zh":"诊所核对了她的接种记录，以确保在疫情期间没有出现过度免疫的情况。"}]}],"synonyms":["overvaccinating","over-immunizing","excessive vaccination"],"phonetic":"/ˌoʊvərˈɪmjəˌnaɪzɪŋ/","extraExplanation":["“overimmunizing”来自动词“overimmunize”（over- 表“过度” + immunize“使免疫/接种疫苗”）。在公共卫生语境中，这个词常用于讨论：是否重复接种、是否在不需要的情况下追加针次，或是否没有按指南间隔接种。","需要注意：在真实医疗场景里，是否“过度”通常以官方指南（例如国家/地区免疫规划、CDC/WHO建议）和个人健康状况为准；有时补种或追加剂量是医学上合理的，并不一定算“overimmunizing”。"]}
{"word":"overimport","summary":{"en":"Overimport means to import too much, often in an economic or business context.","zh":"overimport 指“过度进口、进口过量”，常用于经济或商业语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to import too much (more goods or materials than needed, affordable, or healthy for a market or economy).","zh":"过度进口；进口过量（超过需求、承受能力或对市场/经济有利的程度）。"},"examples":[{"en":"If a country overimports food, local farmers may struggle to compete.","zh":"如果一个国家过度进口食品，本国农民可能难以竞争。"},{"en":"The company overimported parts and ended up with expensive inventory sitting in storage.","zh":"这家公司零件进口过量，结果昂贵库存堆在仓库里。"}]},{"partOfSpeech":"v.","definition":{"en":"to bring in too much of something (less common, sometimes used outside trade contexts).","zh":"过量引入（较少见，用法有时不局限于贸易语境）。"},"examples":[{"en":"The project overimported ideas from other teams instead of building its own approach.","zh":"这个项目过度引入其他团队的想法，而不是建立自己的方法。"}]}],"synonyms":["import too much","excessive imports","overreliance on imports"],"phonetic":"/ˌoʊvərɪmˈpɔrt/","extraExplanation":["“overimport”在现代英语里不算常见，更常见的表达是“import too much / excessive imports / overreliance on imports（过度依赖进口）”。","构词很直观：over-（过度）+ import（进口/输入）。常出现在经济、贸易分析或政策讨论中，用来强调“进口超过合理水平”带来的风险（如贸易逆差扩大、产业受冲击）。"]}
{"word":"overimportance","summary":{"en":"Overimportance means excessive importance given to someone or something.","zh":"overimportance 指对某人或某事赋予过度的重要性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being considered too important; excessive importance given to someone or something","zh":"被看得过于重要；对某人或某事赋予过度的重要性"},"examples":[{"en":"The report warns against the overimportance of test scores in judging students.","zh":"报告警告不要在评估学生时过分看重考试分数。"},{"en":"She disliked the overimportance placed on appearances at work.","zh":"她不喜欢职场上对外表的过分强调。"}]}],"synonyms":["overemphasis","excessive importance","undue importance","overvaluation"],"phonetic":"/ˌoʊvərɪmˈpɔrtəns/","extraExplanation":["“overimportance”常用于较正式的写作或批评性语境，表示“把某件事看得太重”。更常见的表达包括：“too much importance (is placed on...) / excessive importance / overemphasis”。","常见搭配：the overimportance of X；place/attach/give overimportance to X。"]}
{"word":"overimportation","summary":{"en":"Overimportation means importing too much, often causing economic or trade problems.","zh":"overimportation 指“过度进口”，常用于经济与贸易语境，暗示可能带来负面影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or situation of importing too much—especially more than a country or business needs or can afford.","zh":"过度进口；（尤指）进口数量过多，超过一个国家或企业的需要或承受能力。"},"examples":[{"en":"Overimportation can weaken local industries if cheaper foreign goods flood the market.","zh":"过度进口会削弱本地产业，因为更便宜的外国商品会大量涌入市场。"},{"en":"The report warned that overimportation of fuel was increasing the trade deficit.","zh":"报告警告说，燃料的过度进口正在扩大贸易逆差。"}]}],"synonyms":["excessive importing","excess imports","import dependence"],"phonetic":"/ˌoʊvərˌɪm.pɔrˈteɪ.ʃən/","extraExplanation":["这个词在日常英语里不算常见，更常见的表达是“excessive imports / too much importing”。在经济新闻或政策讨论中，它通常与“trade deficit（贸易逆差）”“domestic producers（国内生产者）”“tariffs（关税）”“import dependence（进口依赖）”等话题一起出现。","构词法：over-（过度）+ importation（进口）。其中 importation 比 import 更偏“过程/行为”或更正式的书面语。"]}
{"word":"overimpose","summary":{"en":"Overimpose means to lay one thing over another, especially an image over an image, or to force an interpretation or rule onto something.","zh":"overimpose 指把一物叠加在另一物之上（尤指画面/图像叠加），也可指把某种解读或规则强加到某事物上。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To place one image, pattern, or layer on top of another so they overlap.","zh":"把一幅图像、图案或图层叠加在另一幅上，使其重叠。"},"examples":[{"en":"The editor overimposed the title over the opening scene.","zh":"剪辑师把片名叠加在开场画面上。"},{"en":"Try to overimpose the old map on the new one to see what has changed.","zh":"试着把旧地图叠加到新地图上，看看有哪些变化。"}]},{"partOfSpeech":"vt.","definition":{"en":"To add or apply something (such as an idea, rule, or interpretation) onto something else, sometimes in an unnatural or forced way.","zh":"把某种东西（如观念、规则或解读）强加到另一事物之上（有时显得不自然或牵强）。"},"examples":[{"en":"Don’t overimpose modern values on people from the past.","zh":"不要把现代价值观强加到过去的人身上。"},{"en":"The teacher warned us not to overimpose our own assumptions on the text.","zh":"老师提醒我们不要把自己的主观假设强加到文本上。"}]}],"synonyms":["superimpose","overlay","impose"],"phonetic":"/ˌoʊvərɪmˈpoʊz/","extraExplanation":["常见拼写：overimpose（也可见 over-impose）。重音通常在最后一部分：overimPOSE。","在摄影、影视和设计里，overimpose 常指“叠化/叠加字幕或画面”；在写作与人文讨论中，则常带有“把某种框架硬套上去”的语气。","相关词：superimpose（更中性、也更常用，强调“叠放/叠加”）；impose（强调“强加”）。"]}
{"word":"overimposed","summary":{"en":"“Overimposed” means laid or displayed on top of something else, especially images or text; it’s also the past form of “overimpose.”","zh":"“overimposed”指（图像/文字等）叠加在另一物或画面之上；也可作“overimpose”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Placed or shown on top of something else, especially one image, text, or pattern laid over another so both can be seen.","zh":"（尤指图像、文字等）叠加在另一物体或画面之上，使两者同时可见。"},"examples":[{"en":"The documentary used overimposed captions to translate the dialogue.","zh":"这部纪录片用叠加字幕来翻译对话。"},{"en":"A faint, overimposed map appeared over the city scene.","zh":"城市画面上浮现出一张淡淡的叠加地图。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “overimpose”: to place or display something on top of something else (often in photography, film, or design).","zh":"“overimpose”的过去式/过去分词：把某物（常指照片、影片或设计中的图像/文字）叠加到另一物上或画面上。"},"examples":[{"en":"The editor overimposed the logo on the final shot.","zh":"剪辑师把标志叠加到最后一个镜头上。"},{"en":"Two exposures were overimposed to create a double-image effect.","zh":"两次曝光被叠加在一起，产生了双重影像效果。"}]}],"synonyms":["superimposed","overlayed","layered","projected"],"phonetic":"/ˌoʊvərɪmˈpoʊzd/","extraExplanation":["“overimposed/overimpose”常见于摄影与电影术语：例如 double exposure（双重曝光）、superimposed text（叠加文字/字幕）。在日常表达里也可引申为“把某种观念/情绪强加或套在某事之上”，但这种用法不如视觉语境常见。"]}
{"word":"overimposing","summary":{"en":"Overimposing means layering one image/text over another; it can also mean applying something on top of something else in a broader sense.","zh":"overimposing 指把图像/文字叠加到另一层上；也可泛指把某事物叠加或强加在另一事物之上。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Putting one image, piece of text, or object on top of another so they appear together (often in photography, video, design, or printing).","zh":"把一张图像、文字或物体叠加到另一张上面，让它们同时出现（常见于摄影、视频、设计或印刷）。"},"examples":[{"en":"The editor is overimposing subtitles on the video.","zh":"剪辑师正在把字幕叠加到视频上。"},{"en":"Try overimposing a map over the satellite photo to compare locations.","zh":"试着把地图叠加在卫星照片上来对比位置。"},{"en":"The app lets you overimpose a logo on your pictures.","zh":"这个应用可以让你把标志叠加到照片上。"}]},{"partOfSpeech":"v.","definition":{"en":"Placing or applying something on top of something else in a more general sense (less common).","zh":"更一般地指把某物放在或施加在另一物之上（较不常用）。"},"examples":[{"en":"The new rules were overimposed on an already stressful schedule.","zh":"新规定叠加在本已紧张的日程之上。"},{"en":"He felt his family’s expectations were overimposed on his own goals.","zh":"他觉得家人的期待被强加在自己的目标之上。"}]}],"synonyms":["overlay","superimpose","layer","impose"],"phonetic":"/ˌoʊvərɪmˈpoʊz/","extraExplanation":["“overimposing”是动词“overimpose”的现在分词/动名词形式，常用于描述正在进行的“叠加”操作。","在影视与平面设计里，overimpose常指把文字、字幕、特效或一段画面“叠印/叠加”到另一段画面上；中文常译为“叠加、叠印、覆盖（在……上）”。"]}
{"word":"overimpress","summary":{"en":"“Overimpress” means trying too hard to impress someone, often in an excessive or awkward way.","zh":"“overimpress”指为了给人留下印象而用力过猛，常显得过度或尴尬。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to try too hard to impress someone, often in a way that feels unnatural or excessive","zh":"过度想给人留下好印象；用力过猛地取悦或炫耀（常显得不自然或过头）"},"examples":[{"en":"He overimpressed the interviewer by listing every award he had ever won.","zh":"他为了给面试官留下深刻印象，把自己得过的所有奖项都一股脑儿列了出来。"},{"en":"Don’t overimpress—just speak clearly and be yourself.","zh":"别用力过猛，清楚表达、做自己就好。"}]}],"synonyms":["try too hard","overdo it","show off","grandstand","overplay"],"phonetic":"ˌoʊvərɪmˈprɛs","extraExplanation":["“over-”有“过度、太……”的意思，所以 overimpress 带有负面语气：不是单纯“impress（打动）”，而是“为了显得厉害而显得刻意”。","在正式写作里更常见的是 “try too hard to impress” 或 “overdo it”；overimpress 偏口语/非正式，用于评价某人表现得太刻意。"]}
{"word":"overimpressed","summary":{"en":"Overimpressed means too impressed, often in an exaggerated way.","zh":"overimpressed 指“过于钦佩/过度被打动”，常暗示反应夸张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too impressed; feeling more admiration or excitement than the situation deserves (often suggesting the reaction is exaggerated or not very sincere).","zh":"过于钦佩的；印象好得过头（常带有“反应夸张/不太真诚”的含义）。"},"examples":[{"en":"The interviewer seemed overimpressed by his title but didn’t ask about his real skills.","zh":"面试官似乎对他的头衔过于钦佩，却没有问到他的真实能力。"},{"en":"She was overimpressed with the expensive restaurant, even though the food was just okay.","zh":"她对那家昂贵的餐厅印象好得过头，尽管食物其实只是一般。"},{"en":"Don’t be overimpressed by fancy words—look at the facts.","zh":"别被华丽的辞藻迷住了——看事实。"}]}],"synonyms":["overly impressed","too impressed","awed","starstruck","overawed"],"phonetic":"/ˌoʊvərɪmˈprɛst/","extraExplanation":["“overimpressed”更常写作带连字符的“over-impressed”。在日常英语里也常用更口语的表达，比如“too impressed”或“overly impressed”。","语气上通常带一点批评或提醒：强调“被表面现象迷住了”“赞叹超过应有程度”。"]}
{"word":"overimpresses","summary":{"en":"“Overimpresses” means “impresses too much” (and in printing, “presses too deeply”).","zh":"“overimpresses”表示「使人過度印象深刻／過度被打動」（印刷上也可指「壓印過深」）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to impress someone too much, or to make a stronger effect than is appropriate","zh":"（對某人）留下過於強烈的印象；使人過度被打動（強到不太合適）"},"examples":[{"en":"He overimpresses clients with technical details instead of focusing on their real needs.","zh":"他用一堆技術細節去過度震撼客戶，反而沒有聚焦在對方真正的需求。"},{"en":"The scary story overimpresses younger children and can make them anxious at night.","zh":"那個恐怖故事會讓年紀較小的孩子受到過度影響，晚上容易焦慮。"}]},{"partOfSpeech":"vt.","definition":{"en":"(printing) to press too hard so the design or letters sink too deeply into the paper","zh":"（印刷）壓印過深；壓得太重，讓圖案或字母在紙上陷得太深"},"examples":[{"en":"If the press overimpresses the paper, the text may look uneven or leave marks on the back.","zh":"如果印刷機壓印過深，文字可能看起來不均勻，背面也可能出現壓痕。"}]}],"synonyms":["overwhelm","overawe","make too strong an impression on","overemphasize"],"phonetic":"/ˌoʊvərɪmˈprɛsɪz/","extraExplanation":["“overimpresses”是動詞 overimpress 的第三人稱單數現在式（he/she/it overimpresses）。日常會更常看到 “impresses” 或 “overwhelms”；“overimpress”相對較少用，語感偏正式或書面。","在心理學／教育語境中，overimpress 有時指「某種印象或觀念在心中被強烈烙印」，強到可能造成不必要的影響（例如恐懼、偏見）。"]}
{"word":"overimpressibility","summary":{"en":"Overimpressibility means being too easily impressed or influenced.","zh":"overimpressibility 指“过度易受影响、太容易被打动或被震住”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too easily impressed, influenced, or awed by people, ideas, or appearances","zh":"过度易受影响；太容易被打动/被震住（的人格特质）"},"examples":[{"en":"His overimpressibility made him believe every confident speaker he heard.","zh":"他太容易被有自信的演讲者打动，以至于听谁说得像样就信谁。"},{"en":"Advertisements often target overimpressibility by using celebrity images and dramatic music.","zh":"广告常用名人形象和煽情音乐来利用人们“过度易受影响”的心理。"},{"en":"With experience, she learned to balance curiosity with less overimpressibility.","zh":"随着阅历增长，她学会在保持好奇的同时，不再那么容易被影响。"}]}],"synonyms":["gullibility","credulity","suggestibility","naivete","impressionability"],"phonetic":"/ˌoʊvərɪmˌprɛsəˈbɪləti/","extraExplanation":["这是一个较少见、偏书面/评论性的名词，多用于批评某人“太容易被表象或话术影响”。","构词上可理解为 over-（过度）+ impressible（易受影响的、易被打动的）+ -ity（名词后缀），意思接近“过度轻信/过度易感”。在日常口语里更常用：gullibility（轻信）、credulity（轻信）、being easily impressed（很容易被打动）。"]}
{"word":"overimpressible","summary":{"en":"An uncommon adjective meaning “extremely impressionable; too easily influenced.”","zh":"一个较少见的形容词，意思是“非常易受影响的；过于容易被打动或说服的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too easily influenced, affected, or convinced; extremely impressionable.","zh":"过于容易受影响的；极易被打动或被说服的；非常易受暗示的。"},"examples":[{"en":"As a teenager, she was overimpressible and often copied whatever her friends liked.","zh":"她十几岁时非常易受影响，朋友喜欢什么她常常就跟着喜欢什么。"},{"en":"The coach warned the team not to be overimpressible when they saw the other side’s flashy warm-up.","zh":"教练提醒队员别太容易被对方花哨的热身动作唬住。"}]}],"synonyms":["impressionable","suggestible","easily influenced","gullible"],"phonetic":"/ˌoʊvərɪmˈprɛsəbəl/","extraExplanation":["这个词很少见，更多时候英语会用更常见的 impressionable（易受影响的）或 gullible（轻信的）。over- 表示“过度、太……”，impressible 来自 impress（使产生印象/影响），合起来就是“过分容易被影响”。","语气上常带一点批评或担忧：强调某人（尤其是年轻人）对外界影响缺乏抵抗力。"]}
{"word":"overimpressibly","summary":{"en":"“Overimpressibly” is a rare adverb meaning “too easily influenced or affected.”","zh":"“overimpressibly”是一个罕见副词，意思是“过度容易受影响/被左右”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare) In an overly impressionable way; too easily influenced or affected by what you see, hear, or experience.","zh":"（罕见）以过度容易受影响的方式；太容易被所见所闻或经历打动、左右。"},"examples":[{"en":"He reacted overimpressibly to every dramatic headline and changed his opinion overnight.","zh":"他对每条耸动的标题都过度容易受影响，常常一夜之间就改变看法。"},{"en":"As a new traveler, she listened overimpressibly to strangers’ stories and believed them too quickly.","zh":"作为新手旅行者，她对陌生人的故事过度轻信，很快就相信了。"}]}],"synonyms":["overly impressionably","too impressionably","easily","credulously"],"phonetic":"ˌoʊvərɪmˈprɛsəbli","extraExplanation":["“overimpressibly”不是常见标准词汇，实际写作中更常用的表达是“overly impressionable / too impressionable / easily influenced”。它的构词思路是 over-（过度）+ impressible（易受影响的）+ -ly（副词）。","“impressible”本身也偏书面和少见；日常英语里通常用“impressionable”（更常见）来表示“易受影响的”。因此，如果你的目标是自然地表达，优先选用“overly impressionable”或“too impressionable”。"]}
{"word":"overimpressing","summary":{"en":"Overimpressing means either trying too hard to impress people, or (in printing/graphics) superimposing one element over another.","zh":"Overimpressing 指（1）为了给人好印象而用力过猛、刻意炫耀；或（2）（印刷/图像中）将元素叠印、叠加在另一元素上。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Trying too hard to impress someone, often in a way that feels unnatural or shows off too much.","zh":"（为给人留下好印象而）用力过猛、刻意炫耀，往往显得不自然。"},"examples":[{"en":"He kept name-dropping famous people, and it felt like overimpressing.","zh":"他一直提某些名人来抬高自己，感觉就是在刻意炫耀、用力过猛。"},{"en":"Overimpressing in an interview can make you seem less sincere.","zh":"面试时如果用力过猛地想表现，反而会显得不够真诚。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Printing/graphics) Laying one image, pattern, or text over another; superimposing.","zh":"（印刷/图像）把一个图像、图案或文字叠印在另一个上面；叠加印刷。"},"examples":[{"en":"The designer is overimpressing the logo on a textured background.","zh":"设计师正在把标志叠印到有纹理的背景上。"},{"en":"Overimpressing black text on a dark photo can reduce readability.","zh":"把黑色文字叠印在较暗的照片上会降低可读性。"}]}],"synonyms":["trying too hard","showing off","overdoing it","superimposing","overprinting"],"phonetic":"/ˌoʊvərɪmˈprɛsɪŋ/","extraExplanation":["“overimpressing”常见于口语或写作中描述社交场合的“用力过猛”，语气通常带一点负面评价，接近“trying too hard”“showing off”。","印刷/设计语境里的 overimpress 是较专业的用法，含义更中性，类似“superimpose（叠加）/overprint（套印、叠印）”。"]}
{"word":"overimpressionability","summary":{"en":"Overimpressionability means being too easily influenced or affected.","zh":"overimpressionability 指「過度容易受影響／太易被左右」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The tendency to be too easily influenced by other people, events, or emotions; being overly impressionable.","zh":"過度易受影響的傾向；太容易被他人、事件或情緒左右。"},"examples":[{"en":"Her overimpressionability made it hard for her to ignore negative comments online.","zh":"她的過度易受影響讓她很難忽視網路上的負面評論。"},{"en":"Teachers try to protect younger students from overimpressionability by encouraging critical thinking.","zh":"老師會透過培養批判思考來保護年幼學生，避免他們過度易受影響。"}]}],"synonyms":["excessive impressionability","oversensitivity","gullibility (sometimes, depending on context)","susceptibility"],"phonetic":"ˌoʊvərɪmˌprɛʃənəˈbɪləti","extraExplanation":["這個字非常少見，多數情況下英文更常用「over-sensitivity」「being too impressionable」或「excessive impressionability」。","字形可拆成 over-（過度）+ impression（印象／影響）+ -able（容易…的）+ -ity（名詞化），字面意思就是「過度容易留下印象／被影響的性質」。"]}
{"word":"overimpressionable","summary":{"en":"Overimpressionable means excessively easy to influence.","zh":"overimpressionable 指“过于容易受影响的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too easily influenced, especially by other people’s opinions, emotions, or suggestions; excessively impressionable.","zh":"过于容易受影响的；特别容易被他人的观点、情绪或暗示左右的。"},"examples":[{"en":"Teenagers can be overimpressionable, so role models matter a lot.","zh":"青少年可能过于容易受影响，所以榜样非常重要。"},{"en":"He was overimpressionable in meetings and often changed his mind after hearing confident speakers.","zh":"他在会议中很容易被影响，常常听到自信的发言者就改变想法。"},{"en":"Try not to make big decisions when you feel overimpressionable and emotionally overwhelmed.","zh":"当你觉得自己过于容易受影响、情绪又很崩溃时，尽量不要做重大决定。"}]}],"synonyms":["overly impressionable","too impressionable","easily influenced","suggestible","gullible"],"phonetic":"/ˌoʊvərɪmˈprɛʃənəbəl/","extraExplanation":["“over-”表示“过度、太……”，所以 overimpressionable 的语气通常带有提醒或轻微批评：不是普通的 impressionable（容易受影响），而是“过头了”。","这个词在日常英语里不算常见；更常用的说法是 “too impressionable” 或 “highly impressionable”。在正式写作中也可以用 “overly impressionable”。"]}
{"word":"overimpressionableness","summary":{"en":"“Overimpressionableness” is a rare/nonstandard noun meaning excessive impressionability—being too easily influenced.","zh":"“overimpressionableness”是罕见/非标准名词，意思是“过度易受影响性”，即太容易被他人左右。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) the quality of being too easily influenced by other people’s opinions, emotions, or appearances; excessive impressionability.","zh":"（罕见/非标准用法）过度容易受他人观点、情绪或表象影响的特质；过度易受影响性。"},"examples":[{"en":"Her overimpressionableness made her change her mind every time someone spoke confidently.","zh":"她的“过度易受影响”让她只要听到别人说得很自信就会改变主意。"},{"en":"In a stressful environment, overimpressionableness can lead to impulsive decisions.","zh":"在压力环境中，过度易受影响可能导致冲动的决定。"}]}],"synonyms":["over-impressionability","excessive impressionability","gullibility","suggestibility","credulity"],"phonetic":"ˌoʊvərɪmˈprɛʃənəbəlnəs","extraExplanation":["这个词在现代英语中非常少见，很多词典不会收录；写作和口语里更常用的表达是：over-impressionability（过度易受影响性）、being overly impressionable（太容易受影响）、excessive impressionability（过度的易受影响）。","构词上可以理解为 over-（过度）+ impressionable（易受影响的）+ -ness（名词后缀）。如果你是在正式写作里使用，建议改用更常见的表达以避免读者觉得不自然。"]}
{"word":"overimpressionably","summary":{"en":"“Overimpressionably” means ‘in an overly impressionable, too-easily-influenced way’ (rare/nonstandard).","zh":"“overimpressionably”指“以过度易受影响、太容易被左右的方式”（非常少见/不太标准）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too easily influenced or affected by what one sees, hears, or experiences.","zh":"以（过于）容易受影响、受感染的方式；太容易被所见所闻左右地。"},"examples":[{"en":"He reacted overimpressionably to every comment online and took small criticisms personally.","zh":"他对网上每条评论都过于敏感、容易受影响，把小小的批评也当成针对自己。"},{"en":"As a child, she listened overimpressionably and copied the adults’ opinions without questioning them.","zh":"小时候她听什么都很容易受影响，不加思考就照搬大人的看法。"}]}],"synonyms":["too easily","over-sensitively","gullibly","naively","in an overly impressionable way"],"phonetic":"/ˌoʊvərɪmˈprɛʃənəbli/","extraExplanation":["“overimpressionably”非常少见，很多词典不收录；更常见、更自然的表达是用短语：“in an overly impressionable way / too easily influenced”。","它来自形容词“impressionable（易受影响的）”，加上前缀“over-（过度）”表示“太……”，再变成副词“-ly”。在正式写作中建议优先用更常见的替代说法。"]}
{"word":"overinclinable","summary":{"en":"Overinclinable means “too inclined” or “excessively willing/prone” to do something.","zh":"overinclinable 表示“过于倾向/过于愿意”，指对某事的倾向或习惯有些过头。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too willing or ready to do something; excessively inclined or disposed toward a particular action or attitude.","zh":"过于愿意/倾向于做某事的；（对某种行为或态度）倾向过度的。"},"examples":[{"en":"He’s overinclinable to apologize, even when he hasn’t done anything wrong.","zh":"他太容易道歉了，即使并没有做错什么。"},{"en":"The manager was overinclinable to micromanage, which frustrated the team.","zh":"这位经理过于倾向于事无巨细地管控，让团队很沮丧。"}]}],"synonyms":["overly inclined","too ready","prone to","overdisposed","overeager"],"phonetic":"/ˌoʊvərɪnˈklaɪnəbəl/","extraExplanation":["这是一个较少见的形容词，由 over-（“过度”）+ inclinable（“容易倾向于……”）组成。日常英语里更常用的表达是 overly inclined to… / too ready to… / prone to… 。","常见搭配是 overinclinable to + 动词原形（to do…），用来轻微批评某种“过头的”习惯或倾向。"]}
{"word":"overinclination","summary":{"en":"Overinclination means an excessive or overly strong tendency or preference.","zh":"overinclination 指“过度的倾向/过强的偏好”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive tendency or too-strong preference toward something; being more inclined than is reasonable or balanced","zh":"过度的倾向；过强的偏好（超过合理或平衡的程度）"},"examples":[{"en":"His overinclination to please everyone made it hard for him to say no.","zh":"他过度想讨好所有人的倾向，让他很难拒绝别人。"},{"en":"An overinclination toward speed can create safety risks on the road.","zh":"对速度的过度偏好可能会在路上造成安全风险。"}]}],"synonyms":["excessive tendency","overpreference","bias","predisposition","propensity"],"phonetic":"/ˌoʊvərˌɪnkləˈneɪʃən/","extraExplanation":["“overinclination”由 over-（过度）+ inclination（倾向、偏好）构成，语气通常带有“超过适当程度”的批评或提醒意味。日常英语里更常见的表达是“an excessive tendency to…”、“a strong bias toward…/a predisposition to…”。"]}
{"word":"overincline","summary":{"en":"Overincline means to incline too much (or be too steep), and it can also mean setting an exercise machine to an overly steep incline.","zh":"Overincline 表示“过度倾斜/太陡”，也可指（健身中）把器械坡度调得过陡。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to lean or slope too much; to tilt beyond the desired or safe angle","zh":"过度倾斜；倾斜过头（超过理想或安全角度）"},"examples":[{"en":"If you overincline the ladder, it may slip and fall.","zh":"如果梯子过度倾斜，可能会打滑倒下。"},{"en":"The road overinclines on that curve, so drivers should slow down.","zh":"那段弯道路面倾斜过头，所以司机应该减速。"}]},{"partOfSpeech":"vt.","definition":{"en":"(fitness) to set a treadmill or machine to an excessively steep incline","zh":"（健身）把跑步机或器械坡度调得过陡"},"examples":[{"en":"Don’t overincline the treadmill if you’re new to hill training.","zh":"如果你刚开始练爬坡训练，就别把跑步机坡度调得过陡。"},{"en":"I overinclined it and my calves felt sore the next day.","zh":"我把坡度调过头了，第二天小腿很酸。"}]},{"partOfSpeech":"adj.","definition":{"en":"excessively inclined; too steep or tilted","zh":"过度倾斜的；过陡的"},"examples":[{"en":"An overincline surface can be unsafe for wheelchairs.","zh":"过度倾斜的地面可能对轮椅使用者不安全。"},{"en":"They rebuilt the ramp because the old one was overincline.","zh":"他们重建了坡道，因为旧坡道太陡了。"}]}],"synonyms":["incline too much","tilt too far","lean too much","be too steep","over-tilt"],"phonetic":"/ˌoʊvərɪnˈklaɪn/","extraExplanation":["“overincline”不是非常常见的标准词，更常见的表达是“tilt too much / incline too much / be too steep”。在健身语境中，人们也可能写成“over-incline”（加连字符）来强调“调得过头”。"]}
{"word":"overinclined","summary":{"en":"Overinclined means excessively inclined or too willing/likely to do something.","zh":"overinclined 指“过于倾向于”或“太愿意/太容易做某事”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too willing or too likely to do something; having an excessive tendency or preference.","zh":"过于倾向于（做某事）；过分偏好；太容易（做某事）。"},"examples":[{"en":"He’s overinclined to say yes to every request, even when he’s exhausted.","zh":"他太容易对每个请求都答应了，即使他已经筋疲力尽。"},{"en":"Some people are overinclined to blame themselves for problems they didn’t cause.","zh":"有些人会过于倾向于把并非自己造成的问题归咎于自己。"},{"en":"I’m overinclined to avoid conflict, so I don’t always speak up.","zh":"我太倾向于回避冲突，所以并不总是敢表达意见。"}]}],"synonyms":["too inclined (to)","overly willing","prone (to)","disposed (to)"],"phonetic":"/ˌoʊvərɪnˈklaɪnd/","extraExplanation":["“over-” 是常见前缀，表示“过度、过分”。因此 overinclined 强调“倾向”本身没有错，但程度太强，常带轻微负面含义。日常写作中也常用更简单的表达，如 “too inclined to…” 或 “prone to…”。"]}
{"word":"overinclines","summary":{"en":"Overinclines means “tilts/leans too much” (literal) or “is too strongly inclined toward something” (figurative).","zh":"overinclines表示“倾斜过度”（字面）或“过度偏向某事/某种观点”（比喻）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(often technical) To tilt or slope too much; to make something lean beyond the desired or safe angle.","zh":"（常用于技术语境）使倾斜过度；（或）倾斜得超过理想/安全角度。"},"examples":[{"en":"If the road overinclines on the curve, cars may skid in wet weather.","zh":"如果弯道的路面外倾过度，潮湿天气里车辆可能会打滑。"},{"en":"The chair legs were uneven, so the seat overinclined to one side.","zh":"椅子腿不平，所以座面向一侧过度倾斜。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) To be too strongly disposed toward something; to lean too much toward an opinion or choice.","zh":"（比喻）过于偏向某事；在观点或选择上倾向过度。"},"examples":[{"en":"He overinclines toward pessimism when he’s under stress.","zh":"他一有压力就会过度偏向悲观。"},{"en":"Try not to overincline to one explanation before you check the facts.","zh":"在核实事实之前，尽量不要过度偏向某一种解释。"}]}],"synonyms":["tilt too much","lean too far","overtilt","be overly inclined","be biased toward"],"phonetic":"/ˌoʊvərɪnˈklaɪn/","extraExplanation":["“overinclines”通常是动词“overincline”的第三人称单数形式（he/she/it overinclines）。这个词在日常口语中不算常见，更常见的表达有“tilt too much / lean too far / be too biased toward”。","构词上：over-（过度）+ incline（倾斜/倾向）。理解前缀over-有助于掌握类似词：overreact（反应过度）、overestimate（高估）。"]}
{"word":"overinclining","summary":{"en":"“Overinclining” means leaning too much—either physically (too steep/tilted) or figuratively (too biased toward something).","zh":"“overinclining”指“过度倾斜”，既可指身体/物体角度过大，也可指立场或判断上过分偏向某一方。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"leaning or tilting too much; becoming more slanted than is safe, stable, or intended.","zh":"过度倾斜；比安全、稳定或预期更斜。"},"examples":[{"en":"The ladder was overinclining, so she moved it closer to the wall.","zh":"梯子在过度倾斜，所以她把它往墙边挪近了一点。"},{"en":"If the bike is overinclining on a turn, you may lose traction.","zh":"如果自行车转弯时过度倾斜，可能会失去抓地力。"}]},{"partOfSpeech":"vi.","definition":{"en":"showing an excessive tendency or bias toward something (an opinion, choice, or behavior).","zh":"过分偏向（某种观点、选择或行为）；倾向过度。"},"examples":[{"en":"He worried he was overinclining toward pessimism after the bad news.","zh":"听到坏消息后，他担心自己过分偏向悲观。"},{"en":"The committee was overinclining toward one candidate without reviewing all the evidence.","zh":"委员会在未审查全部证据前就过分偏向某一位候选人。"}]}],"synonyms":["overtilting","leaning too far","tilting too much","being overly inclined","showing bias"],"phonetic":"ˌoʊvərɪnˈklaɪnɪŋ","extraExplanation":["“overinclining”是动词“overincline”的现在分词/动名词形式，整体用法比较少见，更常见的表达是“leaning too far / tilting too much / overly inclined”。","在工程、运动或安全语境中，它多指物体或身体姿态“倾斜过度”；在抽象语境中则可指“在立场或判断上偏得太多”。"]}
{"word":"overinclusive","summary":{"en":"Overinclusive means “too broad”: it includes more cases or people than necessary, often causing unfairness or inaccuracy.","zh":"Overinclusive 意为“范围过大/过于宽泛”：把不该包含的情况或人也算进去，常导致不公平或不准确。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Including more people, things, or cases than is necessary or intended (often in a way that becomes unfair, inaccurate, or inefficient).","zh":"把不需要或不该包含的对象也算进去；范围过大（常导致不公平、不准确或低效率）。"},"examples":[{"en":"The new policy is overinclusive because it punishes students who didn’t break the rule.","zh":"这项新政策范围过大，因为它惩罚了那些并没有违规的学生。"},{"en":"His definition of “spam” was so overinclusive that it included normal newsletters.","zh":"他对“垃圾邮件”的定义太宽泛了，连正常的邮件简报也被算进去了。"},{"en":"An overinclusive search filter can hide useful results.","zh":"过于“广撒网”的搜索筛选条件可能会把有用的结果也隐藏掉。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a rule, law, or argument) Broader than necessary so that it covers cases it shouldn’t, even if it also covers the intended cases.","zh":"（指规则、法律或论证）比需要的更宽，因此在覆盖目标情形的同时，也覆盖了不该覆盖的情形。"},"examples":[{"en":"The court said the ban was overinclusive because it restricted harmless speech.","zh":"法院认为这项禁令“过于宽泛”，因为它限制了无害的言论。"},{"en":"This argument is overinclusive: it explains too much and loses precision.","zh":"这个论证过于宽泛：它解释得太多，反而失去了精确性。"}]}],"synonyms":["too broad","overbroad","all-encompassing","sweeping","blanket"],"phonetic":"/ˌoʊvərɪnˈkluːsɪv/","extraExplanation":["“overinclusive”常见于法律、政策与逻辑讨论，尤其用来批评某项规定“打击面过宽”，把本不该被限制/处罚的人或行为也纳入范围。","它常与“underinclusive（范围过窄，漏掉该包含的对象）”对比使用：overinclusive强调“多抓了”，underinclusive强调“漏抓了”。"]}
{"word":"overincrust","summary":{"en":"Overincrust means to cover something with an excessive crust or hard deposit.","zh":"overincrust 指让某物被过度的硬壳或沉积物覆盖（过度结垢/结壳）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cover (something) with a thick layer or crust; to encrust too much or excessively","zh":"使（某物）覆盖上一层很厚的硬壳/结垢；过度结壳、过度结垢"},"examples":[{"en":"Mineral-rich water can overincrust pipes with scale over time.","zh":"含矿物质丰富的水久而久之会让管道过度结垢。"},{"en":"If you cook it too long, the sauce may overincrust the pan and become hard to clean.","zh":"如果煮太久，酱汁可能会在锅上过度结壳，变得很难清洗。"}]}],"synonyms":["over-encrust","encrust (heavily)","cake over","scale up","build up (with deposits)"],"phonetic":"/ˌoʊvərɪnˈkrʌst/","extraExplanation":["这是一个非常少见、偏书面或技术语境的词：over-（过度）+ incrust（使结壳/结垢）。日常英语里更常说 encrust / build up / form a crust（结壳、堆积、形成硬壳）。","常见使用场景多与“水垢、矿物沉积、锈蚀、油污结硬”等有关，例如：pipes overincrusted with scale（被水垢严重覆盖的管道）。"]}
{"word":"overincurious","summary":{"en":"“Overincurious” means excessively curious (not a common standard word; often better as “overcurious” or “overly inquisitive”).","zh":"“overincurious”指“过度好奇/过分爱打听”，但不算常见标准用词，更常写作 overcurious 或 overly inquisitive。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively curious; asking too many questions or wanting to know more than is appropriate in a situation.","zh":"过度好奇的；爱打听太多、超出场合分寸的。"},"examples":[{"en":"He wasn’t trying to be rude—he was just overincurious about her personal life.","zh":"他并不是故意无礼——只是对她的私生活过度好奇。"},{"en":"The reporter sounded overincurious, pushing for details the family didn’t want to share.","zh":"那位记者听起来过于爱刨根问底，追问家属不想公开的细节。"}]}],"synonyms":["overcurious","overly inquisitive","nosy","prying"],"phonetic":"/ˌoʊvərɪnˈkjʊriəs/","extraExplanation":["“overincurious”并不是常见的标准英语词汇，更常见的表达是 **overcurious**（过度好奇）或 **overly inquisitive**（过分爱打听）。在写作中如果使用“overincurious”，读者可能会觉得是拼写错误或个人造词。","词根提示：**inquisitive** 表示“好奇、爱提问的”，加上 **overly/too** 更自然：*too inquisitive / overly inquisitive*。"]}
{"word":"overindebted","summary":{"en":"Overindebted means owing so much money that repayment is hard or unrealistic.","zh":"overindebted 指负债过多，债务高到难以或不现实地偿还。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having borrowed so much money that it is difficult or impossible to repay; owing more than you can reasonably afford.","zh":"负债过多的；借债太多以至于很难或无法偿还；债务超过自身可承受范围。"},"examples":[{"en":"Many households became overindebted after using credit cards for everyday expenses.","zh":"许多家庭在用信用卡支付日常开销后变得负债过多。"},{"en":"The report warns that overindebted borrowers are more likely to miss payments.","zh":"报告警告说，负债过多的借款人更可能出现逾期还款。"},{"en":"She took a second job to avoid becoming overindebted.","zh":"她做了第二份工作，以避免陷入负债过多的状态。"}]}],"synonyms":["heavily indebted","deep in debt","debt-burdened","debt-laden"],"phonetic":"/ˌoʊvərɪnˈdɛtɪd/","extraExplanation":["常见使用场景：个人理财、消费信贷、房贷/车贷、以及宏观经济讨论中。它强调的是“债务负担过重”而不仅仅是“有债务”。","相关搭配：overindebted consumers/households/borrowers（负债过多的消费者/家庭/借款人）；become/turn overindebted（变得负债过多）；overindebtedness（名词：负债过度）。","语义对比：in debt 只是“有债”，debt-ridden 更强调“被债务困扰”，而 overindebted 更强调“超过可承受或可持续的程度”。"]}
{"word":"overindividualism","summary":{"en":"Overindividualism means excessive individualism that undermines community and cooperation.","zh":"overindividualism 指“过度个人主义”，强调个人至上而削弱共同体与合作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extreme focus on personal independence, self-interest, and personal rights in a way that weakens care for others, community responsibility, or cooperation.","zh":"过度个人主义：把个人独立、个人利益与个人权利看得过重，以至于削弱了对他人、共同体责任或合作的重视。"},"examples":[{"en":"Some critics argue that overindividualism can make it harder to build trust in a community.","zh":"一些批评者认为，过度个人主义会让建立社区信任变得更困难。"},{"en":"Overindividualism may lead people to see every problem as “not my responsibility.”","zh":"过度个人主义可能会让人把每个问题都当作“与我无关”。"},{"en":"In team projects, overindividualism can reduce collaboration and shared problem-solving.","zh":"在团队项目中，过度个人主义会减少合作与共同解决问题的意愿。"}]}],"synonyms":["excessive individualism","hyper-individualism","atomization","self-centeredness"],"phonetic":"/ˌoʊvərˌɪndəˈvɪdʒuəlˌɪzəm/","extraExplanation":["这个词常用于社会学、文化评论或公共议题讨论中，带有批评色彩：不是反对“个人主义”本身，而是强调“过度”之后对公共利益、互助精神、社会凝聚力的伤害。","在英语语境里，它常与“community-mindedness（社区意识）”“collective responsibility（集体/共同责任）”“social cohesion（社会凝聚力）”等概念对比使用。"]}
{"word":"overindividualistic","summary":{"en":"Overindividualistic means excessively individualistic—too focused on the self rather than the group.","zh":"overindividualistic 指“过度个人主义的”，过分以自我为中心而忽视群体与合作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too focused on personal goals, rights, or independence, often at the expense of community, cooperation, or shared responsibility.","zh":"过度个人主义的；过分强调个人目标、权利或独立，常以牺牲群体合作与共同责任为代价。"},"examples":[{"en":"Some critics say the workplace has become overindividualistic, rewarding lone stars more than teamwork.","zh":"一些批评者认为职场变得过度个人主义，更奖励“个人明星”而不是团队合作。"},{"en":"His overindividualistic attitude made it hard for him to accept feedback or compromise.","zh":"他过度个人主义的态度让他很难接受反馈或作出妥协。"}]}],"synonyms":["excessively individualistic","self-centered","egocentric","atomized"],"phonetic":"/ˌoʊvərˌɪndəˌvɪdʒuəˈlɪstɪk/","extraExplanation":["“overindividualistic”常用于社会评论或文化讨论，带有批评或担忧的语气（不只是描述“很独立”）。","它与“independent（独立的）”不同：independent多为中性或褒义；overindividualistic强调“过度”，暗示对关系、公共利益或合作产生负面影响。","常见搭配：an overindividualistic culture/society（过度个人主义的文化/社会），an overindividualistic mindset（过度个人主义的心态）。"]}
{"word":"overindividualistically","summary":{"en":"“Overindividualistically” means “in an excessively individualistic way.”","zh":"“overindividualistically”意为“以过度个人主义的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively individualistic way; emphasizing personal independence, choice, or self-interest too much, often at the expense of community, cooperation, or shared responsibility.","zh":"以过度个人主义的方式；过分强调个人独立、个人选择或个人利益，常常牺牲社群、合作或共同责任。"},"examples":[{"en":"The policy was criticized for being framed overindividualistically, ignoring how families and communities actually function.","zh":"这项政策被批评为以过度个人主义的角度来制定，忽视了家庭与社区的真实运作方式。"},{"en":"If you approach teamwork overindividualistically, you may struggle to share credit and listen to others.","zh":"如果你以过度个人主义的方式看待团队合作，你可能会难以分享功劳并倾听他人。"},{"en":"The essay argues that we have been taught to think overindividualistically about success.","zh":"这篇文章认为，我们被教育以过度个人主义的方式理解“成功”。"}]}],"synonyms":["too individualistically","overly individualistically","in an overly individualistic way","excessively individualistically"],"phonetic":"/ˌoʊvərˌɪndəˌvɪdʒuəˈlɪstɪkli/","extraExplanation":["这个词在日常口语中很少见，更常见的表达是：“too individualistically / overly individualistic(ally) / in an overly individualistic way”。","构词上是 over-（“过度”）+ individualistic（“个人主义的”）+ -ally（副词后缀）。因为很长、很书面，常出现在学术写作或社会评论里（例如讨论文化、政策、教育、社会价值观）。"]}
{"word":"overindividualization","summary":{"en":"Overindividualization is treating a situation as too uniquely personal and ignoring general patterns or evidence.","zh":"overindividualization 指把情况看得过于“独一无二”，从而忽视一般规律或证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The tendency to treat a person, case, or problem as completely unique and separate from general patterns, categories, or evidence—often leading to decisions based more on personal details than on what usually works.","zh":"把某个人、案例或问题看得“过于独特”，忽视一般规律、分类或证据的倾向——常导致决策过分依赖个人细节，而不参考通常有效的方法。"},"examples":[{"en":"In medicine, overindividualization can make a doctor ignore standard guidelines that help most patients.","zh":"在医疗中，过度个体化可能让医生忽视对大多数患者都有帮助的标准指南。"},{"en":"The policy failed because of overindividualization: every case was treated as exceptional, so no consistent rules were applied.","zh":"这项政策失败是因为过度个体化：每个案例都被当成例外，结果无法执行一致的规则。"},{"en":"Good teaching balances personal attention with shared learning goals; too much overindividualization can confuse students.","zh":"好的教学会在个别关注与共同学习目标之间取得平衡；过度个体化可能让学生感到困惑。"}]}],"synonyms":["overpersonalization","exceptionalism (in context)","case-by-case bias","overcustomization (in context)"],"phonetic":"/ˌoʊvərˌɪndɪˌvɪdʒuələˈzeɪʃən/","extraExplanation":["“overindividualization”常见于心理学、教育、管理与政策讨论，带有批评意味：提醒人们不要只看“特殊性”，还要参考统计规律、研究证据或可复制的方法。","它并不等于“尊重个体差异”。尊重差异通常是积极的；而“过度个体化”强调的是偏离常规到影响判断质量（例如忽略风险、忽略对多数人有效的方案）。"]}
{"word":"overindulge","summary":{"en":"Overindulge means to enjoy or consume something too much, especially food or drink.","zh":"overindulge 指过度享受或过量摄入，尤指食物或酒精。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to have or do something (especially food, drink, or pleasure) too much; to indulge excessively","zh":"过度享受；过量（尤指饮食、饮酒或娱乐）"},"examples":[{"en":"I overindulged at the buffet and felt sick afterward.","zh":"我在自助餐吃得太多，之后觉得不舒服。"},{"en":"During the holidays, it’s easy to overindulge in sweets.","zh":"节日期间很容易甜食吃过量。"},{"en":"He tries not to overindulge, even when celebrating.","zh":"即使在庆祝时，他也尽量不过度放纵。"}]}],"synonyms":["overeat","overdrink","go overboard","indulge too much","binge"],"phonetic":"/ˌoʊvərɪnˈdʌldʒ/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常程度”。因此 overindulge 语气通常带有“对身体或生活不太好”的提醒意味。","常见搭配：overindulge in food/alcohol/sweets（在……上过量）。在更广义场景也可指“过度沉迷于享乐或消费”，如 overindulge in shopping（购物过度）。"]}
{"word":"overindulged","summary":{"en":"“Overindulged” means having too much of something pleasurable, or being too lenient/giving—more than is healthy or appropriate.","zh":"“overindulged”指享受或放纵过头（吃喝、消费等过量），也可指对孩子等过度纵容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Allowed yourself or someone else to have too much of something enjoyable (food, drink, shopping, screen time, etc.); indulged to an unhealthy or excessive degree.","zh":"（自己或让别人）过度放纵；享受过头（如吃喝、购物、玩手机等），达到不健康或过量的程度。"},"examples":[{"en":"I overindulged at the buffet and felt sick afterward.","zh":"我在自助餐吃得太多，后来觉得不舒服。"},{"en":"After a stressful week, she overindulged in online shopping.","zh":"压力很大的一周之后，她在网购上放纵过头了。"},{"en":"He overindulged his kids, so they expected gifts all the time.","zh":"他太宠孩子，结果孩子总是期待随时都有礼物。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “overindulge”: to eat, drink, spend, or enjoy something too much.","zh":"“overindulge”的过去式/过去分词：过度沉溺；吃喝过量；过度消费或享乐。"},"examples":[{"en":"We overindulged during the holidays.","zh":"我们在假期里放纵过头了。"},{"en":"He had overindulged in desserts, so he skipped dinner.","zh":"他甜点吃太多了，所以晚饭就没吃。"}]}],"synonyms":["overdid","overate","overdrank","splurged","overindulged oneself","pampered too much"],"phonetic":"ˌoʊvərɪnˈdʌldʒd","extraExplanation":["“overindulge”比“indulge”更强调“过头了/不合适了”，常带轻微批评或后悔的语气。","常见搭配：overindulge in food/alcohol/sweets/shopping；overindulge yourself（让自己放纵过头）；overindulge your children（过度溺爱孩子）。","语域上较常用于健康、消费、育儿等话题；比口语“pig out（大吃特吃）”更正式一些。"]}
{"word":"overindulgence","summary":{"en":"Overindulgence means enjoying or consuming too much of something, often to an unhealthy or unwise degree.","zh":"Overindulgence 指对某事物过度享用或放纵，程度通常不健康或不明智。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of having or doing too much of something (especially food, drink, or pleasure), often in a way that is unhealthy or unwise","zh":"过度放纵；过量享用（尤指饮食、饮酒或享乐，通常不健康或不明智）"},"examples":[{"en":"Overindulgence in sweets can lead to tooth problems.","zh":"过度吃甜食可能会导致牙齿问题。"},{"en":"After the holidays, she tried to recover from weeks of overindulgence.","zh":"假期过后，她试着从几周的过度放纵中恢复过来。"},{"en":"He blamed his tiredness on overindulgence the night before.","zh":"他把疲劳归咎于前一晚的过度纵酒/放纵。"}]}],"synonyms":["excess","overconsumption","self-indulgence","gluttony (food-related)","immoderation"],"phonetic":"/ˌoʊvərɪnˈdʌldʒəns/","extraExplanation":["词源提示：over- 表示“过度”，indulgence 表示“放纵/纵容”。合起来就是“超过适度的享受或放纵”。","语体与语气：overindulgence 常用于较正式或带警示意味的表达（健康、饮食、生活方式建议等），比 too much 更书面，也常带“后果不佳”的暗示。","常见搭配：overindulgence in alcohol/food/sweets；a night of overindulgence；warn against overindulgence。"]}
{"word":"overindulgent","summary":{"en":"Overindulgent means excessively allowing pleasure or comfort, often in a way seen as lacking self-control.","zh":"Overindulgent 指“过度放纵/过度沉溺”，常带批评意味，强调缺乏节制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Allowing yourself (or someone else) to have too much of something enjoyable, especially food, drink, comfort, or pleasure; excessive in treating or satisfying desires.","zh":"过度放纵的；（对食物、饮酒、享受、舒适等）过分沉溺、过度满足欲望的。"},"examples":[{"en":"After a week of celebrations, he felt tired and guilty about being overindulgent with desserts.","zh":"庆祝了一周后，他因为甜点吃得太放纵而感到疲惫和内疚。"},{"en":"The review called the film overindulgent—beautiful to watch, but too long and self-satisfied.","zh":"影评说这部电影“过度铺张自我沉溺”——画面很美，但太长、太自我满足。"},{"en":"Some parents worry that being overindulgent can make children less grateful.","zh":"一些家长担心过度溺爱会让孩子不那么懂得感恩。"}]}],"synonyms":["excessive","self-indulgent","immoderate","overgenerous","spoiling"],"phonetic":"/ˌoʊvərɪnˈdʌldʒənt/","extraExplanation":["词源上可理解为 over-（过度）+ indulgent（放纵的/纵容的）。“overindulgent”常带有评价色彩，暗示“享受过头、缺乏节制”。","在影评/文学评论里，overindulgent 还常用来形容作品“过度炫技或自我陶醉”，例如镜头、铺陈、情节长度等超过了必要程度。"]}
{"word":"overindulgently","summary":{"en":"Overindulgently means “in an excessively indulgent way; too much.”","zh":"overindulgently 意为“以过度放纵的方式；太过头”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively indulgent way; too much, especially in eating, drinking, spending, or pleasure-seeking.","zh":"以过度放纵的方式；太过头（尤指在饮食、饮酒、花钱或追求享乐方面）。"},"examples":[{"en":"He ate overindulgently during the holiday weekend and felt sick afterward.","zh":"假期周末他吃得太放纵，之后感觉不舒服。"},{"en":"The company spent overindulgently on luxury office furniture instead of investing in training.","zh":"公司把钱过度花在豪华办公家具上，而不是投入员工培训。"},{"en":"She laughed overindulgently at every joke, even the unfunny ones.","zh":"她对每个笑话都笑得过于纵容，连不好笑的也一样。"}]}],"synonyms":["excessively","too much","immoderately","self-indulgently"],"phonetic":"/ˌoʊvərɪnˈdʌldʒəntli/","extraExplanation":["“overindulgently”来自动词 overindulge（过度放纵）+ 副词后缀 -ly。常见搭配：eat/drink overindulgently（吃/喝得过度）、spend overindulgently（花钱过度）。","语气通常带轻微批评或提醒：强调“超过适度、对自己（或他人）太纵容”。"]}
{"word":"overindulges","summary":{"en":"“Overindulges” means someone has or does too much of something enjoyable, or spoils someone by giving too much and setting too few limits.","zh":"“Overindulges”表示（某人）在享乐方面“过度”，或指对某人过分纵容、太宠。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do or have too much of something enjoyable (like food, shopping, or entertainment), often so it becomes unhealthy or unwise","zh":"过度享受；过度放纵（如吃太多、买太多、玩得太多），以至于不健康或不明智"},"examples":[{"en":"He overindulges in sweets, so he’s trying to cut back.","zh":"他甜食吃得太多，所以正在努力减少。"},{"en":"On weekends, she sometimes overindulges and stays up too late watching shows.","zh":"周末她有时会放纵一下，追剧熬夜到很晚。"},{"en":"The company worried customers would overindulge if portions were too large.","zh":"公司担心如果分量太大，顾客会吃得过量。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat someone with too much kindness or too few limits (especially a child), which may lead to spoiled behavior","zh":"对（某人）过度纵容；过分迁就（尤指孩子），可能导致被宠坏"},"examples":[{"en":"Some parents overindulge their children with gifts instead of setting rules.","zh":"有些父母用送礼物来过度纵容孩子，而不是立规矩。"},{"en":"His aunt overindulges him, so he expects special treatment.","zh":"他姨妈太宠他了，所以他总觉得自己该被特殊对待。"}]}],"synonyms":["overdo","go overboard","exceed","spoil","pamper"],"phonetic":"/ˌoʊvərɪnˈdʌldʒɪz/","extraExplanation":["“overindulges”是动词“overindulge”的第三人称单数形式（he/she/it overindulges）。常带一点负面含义：不是单纯“享受”，而是“过头了”。"]}
{"word":"overindulging","summary":{"en":"Overindulging means doing or consuming something enjoyable too much—more than is good for you.","zh":"overindulging 指对令人愉快的事物过度享受或过量摄取，超过对自己有益的程度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"enjoying, eating, drinking, or doing something too much (more than is good for you)","zh":"过度享受；过量（饮食/饮酒/娱乐等），超过对自己有益的程度"},"examples":[{"en":"I’ve been overindulging in sweets lately, so I’m trying to cut back.","zh":"我最近甜食吃太多了，所以我在努力减少。"},{"en":"After the holidays, many people feel they’ve been overindulging and want to get back to healthy habits.","zh":"节假日之后，很多人觉得自己放纵过头了，就想回到健康的习惯。"},{"en":"He worries that overindulging in late-night gaming is hurting his sleep.","zh":"他担心自己深夜打游戏过度，影响睡眠。"}]},{"partOfSpeech":"v.","definition":{"en":"spending too much money, time, or attention on something pleasurable","zh":"（在金钱、时间或精力上）过度投入/纵容自己"},"examples":[{"en":"She realized she was overindulging in online shopping and set a monthly budget.","zh":"她意识到自己网购太多，于是设定了每月预算。"},{"en":"It’s okay to treat yourself sometimes—just avoid overindulging.","zh":"偶尔犒劳自己没问题——只是要避免过度放纵。"}]}],"synonyms":["overeat","overdrink","overdo it","go overboard","splurge (sometimes)","self-indulgent (related adj.)"],"phonetic":"/ˌoʊvərɪnˈdʌldʒɪŋ/","extraExplanation":["“overindulging”是动词“overindulge”的现在分词/动名词形式，常用于进行时（be overindulging）或作名词短语（Overindulging can…）。","语气上通常带有“对健康/习惯/财务不利”的提醒或自我反省意味，比单纯的“enjoying”更强调“过量”。常见搭配：overindulge in + 食物/酒/购物/游戏等。"]}
{"word":"overindustrialism","summary":{"en":"Overindustrialism means excessive industrial development, usually criticized for its social or environmental costs.","zh":"overindustrialism 指“过度工业化”的倾向或观念，通常带批评意味，强调其社会或环境代价。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief in or tendency toward too much industrial development, often criticized for harming society, culture, or the environment.","zh":"过度工业化主义；对工业发展过分推崇或推进的倾向，常被批评会伤害社会、文化或环境。"},"examples":[{"en":"Some critics argue that overindustrialism sacrifices clean air and water for short-term profits.","zh":"一些批评者认为，过度工业化为了短期利润牺牲了清洁的空气和水。"},{"en":"The novel portrays a town reshaped by overindustrialism, where factories replace farms.","zh":"这部小说描写一个小镇被过度工业化改变：工厂取代了农场。"}]}],"synonyms":["excessive industrialization","unchecked industrial expansion","overdevelopment"],"phonetic":"/ˌoʊvərɪnˈdʌstriəlɪzəm/","extraExplanation":["这个词通常带有批判色彩，常见于环保、社会学、文化批评语境，用来指出“工业扩张过头”带来的副作用（污染、城市拥挤、劳动剥削、传统社区瓦解等）。","构词上是 over-（过度）+ industrial（工业的）+ -ism（主义/倾向）。在写作中常与“industrialization（工业化）”区分：industrialization更中性，overindustrialism更强调“过度、失衡”。"]}
{"word":"overindustrialization","summary":{"en":"Overindustrialization means excessive industrial development that often leads to social, economic, or environmental harm.","zh":"Overindustrialization 指“过度工业化”，即工业发展过度，常带来社会、经济或环境方面的不良影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or situation in which a place, economy, or society develops too much industry (factories and heavy production), often causing problems such as pollution, resource depletion, unhealthy working conditions, or an unbalanced economy","zh":"过度工业化；指某个地区、经济或社会工业发展过度，常导致污染、资源消耗、劳动环境恶化或经济结构失衡等问题"},"examples":[{"en":"Overindustrialization can damage air quality and increase health risks for nearby communities.","zh":"过度工业化会破坏空气质量，并增加附近社区的健康风险。"},{"en":"Some critics argue that overindustrialization has reduced green space and harmed local wildlife.","zh":"一些批评者认为，过度工业化减少了绿地并伤害了当地野生动物。"},{"en":"The report warns that overindustrialization may create short-term growth but long-term environmental costs.","zh":"报告警告说，过度工业化可能带来短期增长，但会造成长期的环境代价。"}]}],"synonyms":["excessive industrialization","overdevelopment","unchecked industrial growth"],"phonetic":"/ˌoʊvər ɪnˌdʌstriələˈzeɪʃən/","extraExplanation":["“over-”这个前缀常表示“过度、超过合理范围”（如 overwork 过度工作、overuse 过度使用），因此 overindustrialization 通常带有负面评价，强调“工业发展太多/太快”。","在新闻与学术语境中，这个词常和环境污染（pollution）、资源枯竭（resource depletion）、城市扩张（urban sprawl）以及经济失衡（economic imbalance）等话题一起出现。","常见搭配：overindustrialization of a region（某地区的过度工业化）、prevent/curb overindustrialization（防止/遏制过度工业化）。"]}
{"word":"overindustrialize","summary":{"en":"Overindustrialize means to industrialize too much or too fast, often with negative consequences.","zh":"overindustrialize 指“过度/过快工业化”，通常暗含负面后果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to develop industry too much or too quickly in a place, often causing harm to the environment, society, or the economy","zh":"使某地过度或过快工业化（常导致环境、社会或经济问题）"},"examples":[{"en":"Some critics argue that the region was overindustrialized, leading to heavy pollution and health problems.","zh":"一些批评者认为该地区被过度工业化，导致严重污染和健康问题。"},{"en":"If we overindustrialize rural areas, we may destroy farmland and local traditions.","zh":"如果我们让农村地区过度工业化，可能会破坏农田和当地传统。"}]}],"synonyms":["overdevelop","industrialize excessively","overbuild (in some contexts)"],"phonetic":"ˌoʊvərɪnˈdʌstriəˌlaɪz","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过适当程度”。因此 overindustrialize 通常带有批评或担忧的语气，而不是中性描述。","常见搭配：overindustrialize a region/area/country（使某地区/国家过度工业化）。相关词：overindustrialization（名词：过度工业化）。","语境上多用于经济发展、城市规划、环境保护等讨论中。比起 industrialize（工业化）更强调“过头了”的后果。"]}
{"word":"overindustrialized","summary":{"en":"Overindustrialized describes a place or economy that has become too industrial, often with negative effects.","zh":"overindustrialized 指某地或某种经济“过度工业化”，常含负面影响的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much industry, manufacturing, or development, often in a way that harms the environment, quality of life, or a balanced economy.","zh":"过度工业化的；工业发展过头的（常指对环境、生活质量或经济平衡造成负面影响）。"},"examples":[{"en":"Some people say the city feels overindustrialized and lacks green space.","zh":"有些人觉得这座城市过度工业化，缺少绿地。"},{"en":"The river became polluted as the region grew more overindustrialized.","zh":"随着该地区越来越过度工业化，河流受到了污染。"},{"en":"They worry that an overindustrialized economy can decline if factories close.","zh":"他们担心过度依赖工业的经济一旦工厂关闭就可能衰退。"}]}],"synonyms":["overdeveloped","industrial-heavy","heavily industrialized","overbuilt"],"phonetic":"/ˌoʊvərɪnˈdʌstriəˌlaɪzd/","extraExplanation":["“over-”是英语中常见前缀，表示“过度、超过适当程度”。所以 overindustrialized 的核心感觉是“工业化到不健康/不平衡的程度”，带有批评意味。","常见搭配：an overindustrialized city/region/country（过度工业化的城市/地区/国家）；overindustrialized economy（过度依赖工业的经济）。","近义词常带负面评价：overdeveloped（过度开发的，范围更广）、industrial-heavy（工业占比过高的，语气更中性）。"]}
{"word":"overindustrializes","summary":{"en":"“Overindustrializes” means “becomes too industrialized” or “industrializes excessively.”","zh":"“overindustrializes”意为“过度工业化/工业化过头”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular) to industrialize too much or too quickly, especially in a way that harms the environment, local culture, or balanced economic development","zh":"（第三人称单数）使过度工业化；工业发展过快/过度，常导致环境破坏、文化冲击或经济结构失衡"},"examples":[{"en":"The report warns that the region overindustrializes and puts its water supply at risk.","zh":"报告警告该地区正在过度工业化，水资源供应面临风险。"},{"en":"If a city overindustrializes, housing and public health can suffer.","zh":"如果一座城市过度工业化，住房与公共健康都可能受到影响。"}]}],"synonyms":["industrializes excessively","overdevelops (industrially)","overbuilds (industry)"],"phonetic":"/ˌoʊ.vər.ɪnˈdʌs.tri.ə.laɪ.zɪz/","extraExplanation":["“overindustrializes”来自动词“overindustrialize”，由前缀 over-（过度）+ industrialize（工业化）构成，表示“工业化过头”。","这是一般现在时的第三人称单数形式（he/she/it overindustrializes）。常见相关形式：overindustrialize（原形），overindustrialized（过去式/过去分词），overindustrializing（现在分词），overindustrialization（名词：过度工业化）。"]}
{"word":"overindustrializing","summary":{"en":"“Overindustrializing” means industrializing too much or too fast, often causing harm.","zh":"“overindustrializing”指“过度工业化”，即工业化过多或过快，往往带来负面影响。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"industrializing too much or too quickly, especially in a way that causes social, economic, or environmental harm","zh":"过度工业化（工业发展过多或过快，尤指带来社会、经济或环境危害）"},"examples":[{"en":"Some critics warn that overindustrializing the region could damage local rivers and farmland.","zh":"一些批评者警告说，让该地区过度工业化可能会破坏当地河流和农田。"},{"en":"The country is overindustrializing without enough safety rules for factories.","zh":"这个国家在缺乏足够工厂安全法规的情况下正在过度工业化。"},{"en":"Overindustrializing can create jobs, but it may also increase pollution and inequality.","zh":"过度工业化能创造就业，但也可能加剧污染与不平等。"}]}],"synonyms":["overdeveloping","industrializing excessively","overbuilding","overexpanding"],"phonetic":"/ˌoʊvər ɪnˈdʌstriəˌlaɪzɪŋ/","extraExplanation":["“overindustrializing”是动词“overindustrialize”的现在分词/动名词形式，常用于政策、经济、环境讨论中，强调“发展过头”的负面后果。","搭配很常见：overindustrialize a region/area/country（使某地区/国家过度工业化）；without proper regulation（缺乏监管）；at the expense of the environment/public health（以环境/公共健康为代价）。"]}
{"word":"overinflate","summary":{"en":"Overinflate means to inflate something too much, or (figuratively) to exaggerate it.","zh":"overinflate 指把某物充气过多；也可引申为夸大、言过其实。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to inflate (something) too much, so it becomes too full, too tight, or may be damaged","zh":"给（某物）充气过多；使（某物）过度膨胀（可能导致过紧或损坏）"},"examples":[{"en":"Don’t overinflate the tire, or it could burst.","zh":"别把轮胎充气过多，否则可能会爆裂。"},{"en":"I think I overinflated the balloon—it feels ready to pop.","zh":"我好像把气球吹得太大了——感觉快要爆了。"},{"en":"The manual says to avoid overinflating the air mattress.","zh":"说明书说要避免把充气床垫充得过满。"}]},{"partOfSpeech":"vt.","definition":{"en":"to exaggerate or make something seem bigger, more important, or more valuable than it really is","zh":"夸大；把某事说得比实际更大、更重要或更有价值"},"examples":[{"en":"The article overinflated the risks to get more attention.","zh":"那篇文章为了吸引关注而夸大了风险。"},{"en":"He tends to overinflate his achievements in job interviews.","zh":"他在面试时常常会夸大自己的成就。"}]}],"synonyms":["overfill","overpump","exaggerate","overstate"],"phonetic":"/ˌoʊvərɪnˈfleɪt/","extraExplanation":["over- 是常见前缀，表示“过度/过多”（如 overeat 吃太多，overwork 过度工作）。overinflate 字面意思就是“充得过头”，也很自然地引申为“夸大”。","在日常使用中，overinflate 的字面义更常见于轮胎、气球、充气床垫等；比喻义多见于新闻评论、营销或自我介绍语境。"]}
{"word":"overinflated","summary":{"en":"Overinflated means either too full of air (literal) or exaggerated beyond reality (figurative).","zh":"overinflated既可指“充气过度”，也可比喻“被夸大、被吹捧过头”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too full of air or gas, so it becomes hard, tight, or may burst.","zh":"充气过度的；打气太足的（太硬、太紧，甚至可能爆裂）。"},"examples":[{"en":"The tire looked overinflated, so I let out a little air.","zh":"轮胎看起来打气太足了，所以我放掉了一点气。"},{"en":"Don’t overinflate the balloon, or it will pop.","zh":"别把气球充得太满，不然会爆。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Made to seem bigger, better, or more important than it really is.","zh":"（比喻）被夸大的；被吹捧得过头的（显得比实际更好/更重要）。"},"examples":[{"en":"Some of the product’s benefits were overinflated in the advertisement.","zh":"广告把这款产品的一些好处夸大了。"},{"en":"His overinflated sense of importance annoyed his coworkers.","zh":"他那种被夸大的自我重要感让同事们很反感。"}]}],"synonyms":["overfilled","overblown","exaggerated","inflated","puffed-up"],"phonetic":"/ˌoʊvərɪnˈfleɪtɪd/","extraExplanation":["“over-”表示“过度/超过”，inflate表示“充气、使膨胀”。字面义常用于轮胎、气球等；比喻义常用于“overinflated claims/expectations/ego”（夸大的说法/期待/自我）。","常见搭配：overinflated tire（充气过度的轮胎），overinflated prices（虚高的价格），overinflated ego（膨胀的自我）。与之相对的是 underinflated（充气不足的）。"]}
{"word":"overinflates","summary":{"en":"“Overinflates” means inflates too much or exaggerates amounts/claims; it can also describe prices becoming overly inflated.","zh":"“overinflates”指把东西充得过满，或夸大数字/说法；也可指价格等过度膨胀。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put too much air or gas into something so it becomes too full, too tight, or may burst","zh":"给某物充入过多空气/气体，使其过满、过紧，甚至可能爆裂"},"examples":[{"en":"He overinflates the basketball, so it feels too hard to dribble.","zh":"他把篮球打得过满，所以运球时感觉太硬。"},{"en":"Don’t overinflate the balloon, or it might pop.","zh":"别把气球吹得太大，不然可能会爆。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make numbers, prices, or claims seem larger than they really are (often used in business or reporting)","zh":"（常用于商业/报道）夸大数字、价格或说法，使其看起来比实际更大"},"examples":[{"en":"The report overinflates the costs to make the project look impossible.","zh":"这份报告夸大了成本，让项目看起来不可能完成。"},{"en":"Some ads overinflate what the product can do.","zh":"有些广告会夸大产品的效果。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become too inflated or rise too much (especially about prices or markets)","zh":"（尤指价格/市场）过度膨胀、上涨过多"},"examples":[{"en":"Housing prices overinflate when there’s too much speculation.","zh":"当投机过多时，房价会过度上涨。"}]}],"synonyms":["overfill","inflate too much","overstate","exaggerate","pad (numbers)"],"phonetic":"/ˌoʊvərɪnˈfleɪts/","extraExplanation":["“overinflates”是动词“overinflate”的第三人称单数（he/she/it overinflates）。常见搭配：overinflate a tire/balloon/basketball（充得过满）；overinflate costs/figures/claims（夸大成本/数据/说法）。在经济语境里也可指价格“被吹高、过热”。"]}
{"word":"overinflating","summary":{"en":"Overinflating means putting too much air into something, or (figuratively) exaggerating something.","zh":"overinflating 指把某物充气过多；也可比喻夸大某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"inflating something (like a tire, balloon, or air mattress) too much, so it becomes too tight or may burst","zh":"把某物（如轮胎、气球、充气床）充得过多，导致过紧，甚至可能爆裂"},"examples":[{"en":"Overinflating the tire can make it more likely to blow out on a hot day.","zh":"轮胎充气过多会让它在炎热天气里更容易爆胎。"},{"en":"Stop overinflating the balloon—it’s starting to stretch too much.","zh":"别再把气球充过头了——它开始拉得太紧了。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) exaggerating the importance, value, or effect of something","zh":"（比喻）夸大某事的重要性、价值或影响"},"examples":[{"en":"The report is overinflating the risks to get more attention.","zh":"这份报告为了引起更多关注而在夸大风险。"},{"en":"Try not to overinflate your achievements in the interview; be confident but honest.","zh":"面试时别把自己的成就夸得太大；自信但要诚实。"}]}],"synonyms":["overinflate","overfill (with air)","pump up too much","overstate (figurative)","exaggerate (figurative)"],"phonetic":"/ˌoʊvərɪnˈfleɪtɪŋ/","extraExplanation":["“overinflating”是动词“overinflate”的-ing形式，可用作现在分词（描述正在发生的动作）或动名词（当作名词使用）。例如：“Overinflating tires is dangerous.”（给轮胎充太多气是危险的）。"]}
{"word":"overinflation","summary":{"en":"Overinflation means inflation that is excessively high or too rapid.","zh":"Overinflation 指通胀过高或过快，造成物价快速上涨与货币购买力下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a period when inflation becomes extremely high or rises too quickly, causing prices to increase rapidly and money to lose value fast","zh":"（物价）过度通货膨胀；通胀过快或过高的时期，导致物价迅速上涨、货币购买力快速下降"},"examples":[{"en":"Overinflation can make basic goods unaffordable for many families.","zh":"过度通货膨胀会让许多家庭负担不起基本生活用品。"},{"en":"The government raised interest rates to slow overinflation.","zh":"政府提高利率以减缓过度通货膨胀。"},{"en":"During overinflation, people may spend money quickly because it loses value each day.","zh":"在过度通货膨胀时期，人们可能会尽快把钱花掉，因为钱每天都在贬值。"}]}],"synonyms":["high inflation","excessive inflation","runaway inflation","hyperinflation (often stronger/more extreme)"],"phonetic":"/ˌoʊvɚɪnˈfleɪʃən/","extraExplanation":["“overinflation”在日常英语里不如“high inflation（高通胀）”或“hyperinflation（恶性通货膨胀）”常见；它更像是一个描述性用词，强调“超过正常或可控范围”的通胀。","与“hyperinflation（恶性通胀）”相比，“overinflation”不一定达到极端程度（例如每月价格暴涨到难以计量的水平），但重点在“涨得太快/太多，以至于带来严重经济压力”。","常见搭配：combat/curb overinflation（遏制过度通胀）、overinflationary pressures（过度通胀压力）、trigger overinflation（引发过度通胀）。"]}
{"word":"overinflationary","summary":{"en":"Overinflationary describes something that is likely to produce excessively high inflation.","zh":"overinflationary 指可能导致通货膨胀过高（过度通胀）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely to cause inflation to rise too much or too fast; creating excessive inflation.","zh":"可能导致通货膨胀过高或过快上升的；造成过度通胀的。"},"examples":[{"en":"Some economists warned that the policy could be overinflationary if demand rises faster than supply.","zh":"一些经济学家警告说，如果需求上涨快于供给，这项政策可能会引发过度通胀。"},{"en":"An overinflationary budget can push prices up even when wages do not keep pace.","zh":"过度通胀的预算可能会推高物价，即使工资增长跟不上。"}]}],"synonyms":["inflationary","price-boosting","overheating"],"phonetic":"/ˌoʊvərɪnˈfleɪʃəˌnɛri/","extraExplanation":["“overinflationary”多用于经济与政策讨论，常见搭配有：overinflationary pressures（过度通胀压力）、overinflationary policy/fiscal stimulus（引发过度通胀的政策/财政刺激）。","词形结构：over-（过度）+ inflation（通胀）+ -ary（……性质的）。含义通常带有“担忧/批评”的语气，暗示通胀风险偏高。"]}
{"word":"overinflative","summary":{"en":"Overinflative (rare) means causing excessive inflation, or more loosely, overly inflated/exaggerated.","zh":"Overinflative（少见）指导致过度通货膨胀的；也可泛指过度膨胀/夸大的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely meaning “causing or associated with excessive inflation” (prices rising too fast); used mainly in economic or policy discussions.","zh":"（多用于经济/政策语境）指“导致或伴随过度通货膨胀的”，即物价上涨过快。"},"examples":[{"en":"Some economists warned that the stimulus could be overinflative if production cannot keep up with demand.","zh":"一些经济学家警告说，如果产出跟不上需求，这项刺激政策可能会带来过度通胀。"},{"en":"Raising wages without productivity growth can be overinflative in the long run.","zh":"如果工资上涨没有生产率增长支撑，从长期看可能会引发过度通胀。"}]},{"partOfSpeech":"adj.","definition":{"en":"By extension (rare): overly inflated or exaggerated in size, importance, or language.","zh":"引申义（少见）：（大小、重要性或措辞）被过度“充气/夸大”的。"},"examples":[{"en":"The report’s overinflative claims made it hard to trust the conclusions.","zh":"报告里过度夸大的说法让人难以相信结论。"}]}],"synonyms":["inflationary","overly inflationary","inflated","exaggerated"],"phonetic":"/ˌoʊvərɪnˈfleɪtɪv/","extraExplanation":["“overinflative”在现代英语中非常少见，很多写作者会改用更常见、更自然的词：经济语境常用“inflationary”（通胀性的）或“overly inflationary”（过于通胀性的）；表示“夸大”常用“inflated / exaggerated”。","构词上可理解为 over-（过度）+ inflative（促使膨胀/通胀的）。但在实际写作与考试中，优先选择常见表达会更地道、更易被读者理解。"]}
{"word":"overinfluence","summary":{"en":"Overinfluence means to influence too much, or an excessive influence that makes an outcome less independent or fair.","zh":"overinfluence 指“过度影响”，可作动词“影响过度”，也可作名词“影响力过大”，常含负面含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to influence someone or something too strongly, so that the result is unbalanced, unfair, or not based on independent judgment","zh":"过度影响；施加过强的影响（使结果失衡、不公平或缺乏独立判断）"},"examples":[{"en":"The consultant worried that his advice might overinfluence the final decision.","zh":"那位顾问担心自己的建议可能会过度影响最终决定。"},{"en":"Parents can overinfluence a child’s choices if they never allow disagreement.","zh":"如果父母从不允许孩子表达不同意见，就可能会过度影响孩子的选择。"}]},{"partOfSpeech":"n.","definition":{"en":"an excessive or disproportionate influence on a decision, outcome, or opinion","zh":"过度影响；不成比例的影响力（对决定、结果或观点的影响过大）"},"examples":[{"en":"We tried to reduce the overinfluence of money in local politics.","zh":"我们努力减少金钱对地方政治的过度影响。"},{"en":"The judge warned about the overinfluence of media coverage on the jury.","zh":"法官警告媒体报道可能对陪审团造成过度影响。"}]}],"synonyms":["undue influence","excessive influence","overbear","sway too much","dominate"],"phonetic":"/ˌoʊvərˈɪnfluəns/","extraExplanation":["“overinfluence”在日常英语里不算高频，更常见的表达是“undue influence（不当/过度影响）”“excessive influence（过度影响）”，或动词短语“influence too much”。在法律与伦理语境中，“undue influence”尤其常用（例如遗嘱、选举、商业决策中不当施压）。","构词上是 over-（过度）+ influence（影响）。语气通常带负面评价，强调影响超过了合理界限，导致偏颇或失去独立性。"]}
{"word":"overinfluenced","summary":{"en":"“Overinfluenced” means affected too much by an influence, often suggesting a lack of independence or originality.","zh":"“overinfluenced”指过度受到影响，常暗示缺乏独立性或原创性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too strongly affected, shaped, or guided by someone or something (often in a way that reduces independence or original thinking).","zh":"过度受到某人或某事的影响（常指因此缺乏独立性或原创想法）。"},"examples":[{"en":"Some critics say the film feels overinfluenced by old Hollywood musicals.","zh":"一些评论家说这部电影明显过度受老好莱坞歌舞片影响。"},{"en":"He worried his writing was overinfluenced by his favorite author and didn’t sound like himself.","zh":"他担心自己的写作过度受最喜欢的作家影响，听起来不像他自己。"},{"en":"As a teenager, she was overinfluenced by friends and found it hard to say no.","zh":"青少年时期，她过度受朋友影响，很难说“不”。"}]}],"synonyms":["overly influenced","too influenced","unduly influenced","overguided"],"phonetic":"/ˌoʊvərˈɪnfluənst/","extraExplanation":["“over-”是常见前缀，表示“过度、过分”。所以 overinfluenced 通常带一点负面评价：不是单纯“受影响”，而是“被影响得太多”。","这个词在日常口语里不算固定高频，更常见的表达有：too influenced by…, heavily influenced by…（中性/可能偏正面）, under someone’s influence（在某人影响之下）。"]}
{"word":"overinfluences","summary":{"en":"“Overinfluences” means “influences too much.”","zh":"“overinfluences” 意为“过度影响”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to influence someone or something too much; to have an excessive or disproportionate effect on decisions, opinions, or outcomes","zh":"过度影响；对某人/某事产生过强或不成比例的影响（以至于左右决定、观点或结果）"},"examples":[{"en":"The coach overinfluences the team’s strategy, so players rarely make independent decisions.","zh":"教练对球队战术过度影响，导致队员很少能独立做决定。"},{"en":"Advertising sometimes overinfluences what people buy, even when they don’t need the product.","zh":"广告有时会过度影响人们的购买选择，即使他们并不需要那件产品。"}]}],"synonyms":["influence too much","exert excessive influence (over)","dominate","sway excessively","overpersuade"],"phonetic":"/ˌoʊvərˈɪnfluəns/","extraExplanation":["“overinfluences” 是动词 overinfluence 的第三人称单数形式（he/she/it overinfluences）。常见于讨论权力、媒体、家人或群体对个人选择的“影响过头”。","比起更常见的表达，写作里也常用 “has too much influence on” 或 “exerts excessive influence over” 来替换，使语气更自然。"]}
{"word":"overinfluencing","summary":{"en":"“Overinfluencing” means having too much influence on someone or something, often in an unhealthy, unfair, or biased way.","zh":"“overinfluencing”指对某人或某事施加过度影响，常带有不健康、不公平或造成偏差的含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Exerting too much influence on someone or something, so that their choices, opinions, or results are pushed more than is healthy or fair.","zh":"对某人或某事施加过度影响，使其选择、观点或结果被不健康或不公平地推着走。"},"examples":[{"en":"Parents should guide their children without overinfluencing their career choices.","zh":"父母应当引导孩子，但不要过度影响他们的职业选择。"},{"en":"The strong personality in the group was overinfluencing the final decision.","zh":"团队里性格强势的人正在过度影响最终决定。"},{"en":"We changed the survey wording to avoid overinfluencing participants’ answers.","zh":"我们修改了问卷措辞，以避免过度影响受访者的回答。"}]},{"partOfSpeech":"v.","definition":{"en":"(In research, media, or persuasion contexts) Shaping people’s responses or behavior too strongly through leading language, repeated exposure, or pressure.","zh":"（常用于研究、媒体或说服情境）通过诱导性语言、反复曝光或施压，过强地塑造他人的回答或行为。"},"examples":[{"en":"News headlines can end up overinfluencing how people interpret the facts.","zh":"新闻标题可能会过度影响人们对事实的解读。"},{"en":"Try not to overinfluencing users with pop-ups when testing the app design.","zh":"在测试应用设计时，尽量不要用弹窗去过度影响用户。"}]}],"synonyms":["unduly influencing","exerting excessive influence","pressuring","swaying too much","manipulating"],"phonetic":"/ˌoʊvərˈɪnfluənsɪŋ/","extraExplanation":["“overinfluencing”多见于口语或工作场景中的临时用法，来自动词“overinfluence（过度影响）”的现在分词/动名词形式。更常见、更自然的表达是：“having too much influence on… / unduly influencing… / exerting excessive influence on…”。","写作时注意搭配：overinfluence/overinfluencing通常带宾语（人或决定、结果等），例如“overinfluence someone’s decision”。另外，正式文本里用“unduly influence（不当地影响）”更常见。"]}
{"word":"overinfluential","summary":{"en":"“Overinfluential” means having too much influence, often in a way that seems unfair or unhealthy.","zh":"“overinfluential”指“影响力过大”，常带批评意味，暗示不公平或不健康。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much influence or power over decisions, opinions, or outcomes (more than is fair, healthy, or appropriate).","zh":"过度有影响力的；影响力或权力大到不公平、不健康或不合适的程度。"},"examples":[{"en":"Some critics say big donors have become overinfluential in local elections.","zh":"一些批评者说，大额捐款者在地方选举中变得过度有影响力。"},{"en":"If one friend is overinfluential, the group may stop considering other ideas.","zh":"如果某个朋友过度有影响力，这个小组可能就不再考虑其他想法。"}]}],"synonyms":["overly influential","unduly influential","too powerful","dominant","overbearing"],"phonetic":"/ˌoʊvərˌɪnfluˈɛnʃəl/","extraExplanation":["“overinfluential”并不算特别常见，更常见的表达是“overly influential”或“unduly influential”（不当地有影响力）。在正式写作中用“unduly influential”会更自然。","构词：over-（过度）+ influential（有影响力的）。通常带有批评意味，暗示这种影响力不一定正当或对整体有害。"]}
{"word":"overinform","summary":{"en":"“Overinform” means giving more information than necessary, often making communication less clear or unnecessarily detailed.","zh":"“overinform”指提供超过需要的信息，常使沟通变得不清晰或细节冗余。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone more information than they need (often so it becomes confusing, annoying, or unnecessary).","zh":"提供过多信息（超过对方需要，常导致困惑、烦躁或没有必要）。"},"examples":[{"en":"I think I overinformed the client by sending every single detail in one email.","zh":"我觉得我在一封邮件里把所有细节都发给客户，信息给得太多了。"},{"en":"Don’t overinform—just explain the main steps and answer questions if they ask.","zh":"别说得太多——先讲清主要步骤，有问题他们再问。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provide extra details in order to sound more convincing or to protect yourself (sometimes seen as a sign of nervousness).","zh":"为了显得更有说服力或自我保护而补充过多细节（有时被视为紧张的表现）。"},"examples":[{"en":"When people are anxious, they may overinform to prove they’re telling the truth.","zh":"人紧张时可能会说太多细节，想证明自己没撒谎。"},{"en":"He overinformed the manager about where he was, which made it sound suspicious.","zh":"他对经理解释自己去了哪里时细节过多，反而显得可疑。"}]}],"synonyms":["give too much information","overexplain","overshare","flood (someone) with information","overload (someone) with information"],"phonetic":"/ˌoʊvərɪnˈfɔrm/","extraExplanation":["“overinform”由 over-（过度）+ inform（告知）构成，意思直观，但在日常英语里不如 “give too much information / overshare” 常见。写作中使用它会显得更简洁、偏正式一些。","语气通常带轻微负面评价：不是“信息丰富”，而是“信息过量、超出需求”。在职场沟通里常强调“need-to-know”（按需告知）原则：信息足够支持决策即可。","近义辨析：overshare 更常用于分享个人隐私或情感细节；overexplain 强调解释步骤/理由太多；overinform 更泛指“提供的事实/细节太多”，尤其在邮件、报告、汇报场景。"]}
{"word":"overing","summary":{"en":"“Overing” is not standard English; it’s usually a typo or an incorrect form. Use a specific verb like “cover,” or an “over-” verb such as “overdo/overreact/overthink.”","zh":"“Overing”不是标准英语；通常是拼写错误或不正确的构词。可改用更具体的动词如“cover”，或使用带 over- 的动词如“overdo/overreact/overthink”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word. It may be a typo or a learner-made form meaning “putting something over (covering) something.”","zh":"不是现代英语中的标准单词。可能是拼写错误，或学习者自造形式，想表达“把某物盖在……上（覆盖）”。"},"examples":[{"en":"I think you meant “covering,” not “overing.”","zh":"我觉得你想写的是“covering（覆盖）”，不是“overing”。"},{"en":"Are you overdoing it? (Common)","zh":"你是不是做过头了？（常见表达）"}]},{"partOfSpeech":"other","definition":{"en":"(Very rare/technical) In some contexts, people may use it informally to mean “adding an ‘over-’ layer” (e.g., overprinting/overcoating), but standard English usually uses a more specific verb.","zh":"（非常少见/偏技术）在某些语境里可能被口语化地用来表示“加一层 over- 的处理”（如 overprinting 叠印、overcoating 覆涂），但标准英语通常会用更具体的动词。"},"examples":[{"en":"In manufacturing, you’d usually say “apply an overcoat,” not “overing the surface.”","zh":"在制造业里通常说“apply an overcoat（涂覆涂层）”，而不是“overing the surface”。"}]}],"synonyms":["covering","overdoing","overreacting","overthinking"],"phonetic":"ˈoʊvərɪŋ","extraExplanation":["“overing”常见原因是把“over + -ing”当作动词变化来用，但英语里“over”本身通常是介词/副词（over the table / do it over）。如果想表达“覆盖”，最自然的是：cover / covering；想表达“做过头”，常用：overdo / overdoing；想表达“过度反应/过度思考”，常用：overreact / overthink。","如果你能给我一个完整句子（你写了“overing”那句话），我可以帮你判断最合适的标准用词。"]}
{"word":"overinhibit","summary":{"en":"Overinhibit means to inhibit or restrain too much.","zh":"overinhibit 指“过度抑制、抑制过头”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to hold back, restrain, or limit something too much (so that it becomes less effective or less natural)","zh":"过度抑制；抑制过头（以至于影响效果或显得不自然）"},"examples":[{"en":"Parents sometimes overinhibit children’s curiosity by criticizing every question.","zh":"父母有时会因为对每个问题都挑毛病而过度抑制孩子的好奇心。"},{"en":"The strict rules overinhibited creativity in the team.","zh":"严格的规定过度抑制了团队的创造力。"},{"en":"Don’t overinhibit your emotions in every situation—choose when it’s appropriate to be open.","zh":"不要在所有场合都把情绪压得太死——要选择合适的时候坦诚一点。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become overly restrained or inhibited (often used in academic writing)","zh":"变得过度克制／过度受抑制（常见于学术语境）"},"examples":[{"en":"In stressful settings, some students overinhibit and speak less than they actually know.","zh":"在压力环境下，有些学生会过度克制，说得比自己真正会的还少。"},{"en":"If the system overinhibits, it may fail to respond quickly to change.","zh":"如果系统过度抑制，它可能无法快速应对变化。"}]}],"synonyms":["overrestrain","oversuppress","hold back too much","be too inhibited"],"phonetic":"/ˌoʊvərɪnˈhɪbɪt/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”。因此 overinhibit 直观含义就是“抑制过头”。","这个词在心理学、神经科学和组织管理类写作中更常见：例如说一个人“行为过度受抑制”、或一个机制“抑制作用过强”导致反应变慢。日常口语里更常用 hold back too much / be too inhibited / suppress too much。"]}
{"word":"overinhibited","summary":{"en":"Overinhibited means excessively restrained or held back, often in expressing feelings or taking action.","zh":"overinhibited 指“过度克制/过分压抑”，常指在表达情绪或采取行动时太过收敛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too restrained or self-controlled; holding back feelings, actions, or speech more than is normal or helpful.","zh":"过度克制的；过分压抑自己的情绪、行为或表达的。"},"examples":[{"en":"He’s so overinhibited in meetings that he rarely shares his ideas.","zh":"他在会议上过度克制，很少表达自己的想法。"},{"en":"An overinhibited child may seem “quiet,” but may actually be anxious about making mistakes.","zh":"过度克制的孩子可能看起来“很安静”，但实际上可能是因为害怕犯错而焦虑。"},{"en":"Her overinhibited response made the apology sound cold and formal.","zh":"她过度克制的反应让道歉听起来冷淡而公式化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Psychology) Describing a temperament or pattern where a person consistently avoids risk, novelty, or strong emotion, often linked with anxiety or fear of negative evaluation.","zh":"（心理学）指一种气质或行为模式：持续回避风险、新事物或强烈情绪，常与焦虑或害怕被负面评价相关。"},"examples":[{"en":"Researchers described the group as overinhibited, preferring familiar routines over new experiences.","zh":"研究者将该群体描述为过度抑制型，更偏好熟悉的日常而不是新体验。"},{"en":"Therapy helped her shift from an overinhibited style to more flexible communication.","zh":"治疗帮助她从过度抑制的风格转向更灵活的沟通方式。"}]}],"synonyms":["overly restrained","overcontrolled","too inhibited","overcautious"],"phonetic":"/ˌoʊvərɪnˈhɪbɪtɪd/","extraExplanation":["“over-”表示“过度/太……”，inhibit 表示“抑制、阻止”。因此 overinhibited 常带有“过头了”的评价色彩：不是单纯的冷静或内向，而是因为害怕出错、被批评或不安而过分压住自己。","常见搭配：overinhibited behavior/personality/response（过度克制的行为/人格/反应）。在日常语境中，它比 inhibited（拘谨的）更强烈，暗示这种克制可能影响社交、表达或生活质量。"]}
{"word":"overink","summary":{"en":"Overink means to use too much ink in printing or stamping, making the result too dark or smudged.","zh":"Overink 指印刷或盖章时用墨过多，导致成品过黑或蹭脏、发糊。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to apply too much ink when printing or stamping, causing text or images to look too dark, blurry, or smudged","zh":"（印刷/盖章时）上墨过多，导致字或图像过黑、发糊或蹭脏"},"examples":[{"en":"The letters look blurry because the press overinked the page.","zh":"这些字看起来发糊，因为印刷机把页面上墨过多了。"},{"en":"Try reducing the ink flow—your stamp keeps overinking the paper.","zh":"试着把出墨量调小——你的印章总是把纸面上墨过多。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a printer, stamp, or person) to become heavily covered with ink, making messy marks","zh":"（指打印机/印章/人）沾上太多墨，留下脏乱的印迹"},"examples":[{"en":"If the roller overinks, it can leave smears on every sheet.","zh":"如果滚筒沾墨过多，可能每张纸都会被蹭花。"}]}],"synonyms":["overprint (in some contexts)","ink too heavily","apply too much ink"],"phonetic":"/ˌoʊvərˈɪŋk/","extraExplanation":["“over-”表示“过度/过多”，所以 overink 直观意思就是“墨上得太多”。常见于印刷、复印、丝网印刷、印章、油墨滚筒等场景。","在实际沟通中也常用被动：be overinked（被上墨过多了），或用形容词表达结果：overinked lines（上墨过多的线条）。"]}
{"word":"overinsist","summary":{"en":"“Overinsist” means to insist too much or too strongly.","zh":"“overinsist”表示“过度坚持/一再强求”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to insist too strongly or too often; to press a point beyond what is reasonable or helpful","zh":"过度坚持；一再强求（把某个观点或要求逼得太紧，超出合理或有帮助的程度）"},"examples":[{"en":"If you overinsist on every small rule, people may stop listening to you.","zh":"如果你对每条小规定都过度坚持，别人可能就不再愿意听你说了。"},{"en":"She overinsisted that he apologize immediately, which made the situation worse.","zh":"她一再强求他立刻道歉，反而让情况更糟。"}]}],"synonyms":["insist too much","be too insistent","press too hard","push the point","overemphasize"],"phonetic":"/ˌoʊvərɪnˈsɪst/","extraExplanation":["“overinsist”并不常见，更常见的写法是带连字符的“over-insist”，或直接用更自然的表达，如“insist too much / push the point / be too insistent”。在正式写作中，通常建议用这些更常用的说法以避免读者觉得生硬。"]}
{"word":"overinsistence","summary":{"en":"Overinsistence means insisting too much or too strongly, often in an unnecessary or pushy way.","zh":"overinsistence 指过度坚持或过分强调，常带有“没必要、显得强硬或咄咄逼人”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) Too much insistence; insisting repeatedly or too strongly, especially in a way that feels pushy or unnecessary.","zh":"（不常用）过度坚持；反复或过于强硬地要求或强调，常让人觉得咄咄逼人或没有必要。"},"examples":[{"en":"Her overinsistence on getting an apology only made the situation worse.","zh":"她过度坚持要对方道歉，反而让情况更糟。"},{"en":"The manager’s overinsistence on perfect attendance ignored people’s real needs.","zh":"经理对“必须全勤”的过度坚持忽视了员工的真实需求。"}]}],"synonyms":["excessive insistence","overemphasis","pushiness","overpressure"],"phonetic":"/ˌoʊvərɪnˈsɪstəns/","extraExplanation":["“overinsistence”在现代英语中比较少见，更常见、更自然的表达是：“overemphasis”（过度强调）、“excessive insistence”（过度坚持）、“being too insistent”（太过坚持/太强硬）。","构词：over-（过度）+ insistence（坚持/强调）。语气通常带有负面评价，暗示“用力过猛、让人不舒服”。"]}
{"word":"overinsistencies","summary":{"en":"“Inconsistencies” means contradictions or lack of agreement, or irregularity in behavior/quality.","zh":"“inconsistencies”表示“前后矛盾/不一致”，也可指“（行为或质量）不稳定、不规律”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) A lack of agreement or harmony between facts, statements, actions, or ideas; a contradiction.","zh":"（常用复数）不一致；前后矛盾；互相冲突。"},"examples":[{"en":"There are inconsistencies between his story and the evidence.","zh":"他的说法和证据之间有不一致之处。"},{"en":"The report points out several inconsistencies in the data.","zh":"报告指出数据中有几处前后不一致。"}]},{"partOfSpeech":"n.","definition":{"en":"Irregularity in behavior, standards, or quality—being unpredictable or not steady.","zh":"（行为/标准/质量的）不稳定；忽高忽低；不规律。"},"examples":[{"en":"Customers complained about inconsistencies in service quality.","zh":"顾客抱怨服务质量不稳定。"},{"en":"His training schedule is full of inconsistencies.","zh":"他的训练计划很不规律。"}]}],"synonyms":["contradictions","discrepancies","conflicts","irregularities","mismatches"],"phonetic":"/ˌɪnkənˈsɪstənsi/","extraExplanation":["你输入的“overinsistencies”不是常见英文单词，最可能是拼写错误。常见目标词是 **inconsistencies**（inconsistency 的复数，意为“矛盾/不一致”）。","如果你想表达“过多的不一致”，更自然的说法是：**too many inconsistencies** / **an excessive number of inconsistencies**。","拼写提示：in-（不） + consist（一致）+ -ency（名词后缀）→ inconsistency；复数加 -ies：inconsistencies。"]}
{"word":"overinsistency","summary":{"en":"“Overinsistency” is not standard; it’s usually a misspelling of “overinsistence,” meaning insisting too much.","zh":"“overinsistency”不是规范用法；通常是“overinsistence”的拼写错误，意思是“过度坚持/一再坚持”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A misspelling; most commonly intended to mean “overinsistence” (insisting too much) or, less commonly, “over-inconsistency” (being inconsistent too often).","zh":"（非标准用法）拼写错误；最常见想表达的是“overinsistence”（过度坚持/一再坚持），较少情况下可能想写“over-inconsistency”（过度不一致/反复无常）。"},"examples":[{"en":"Your email says “overinsistency,” but I think you mean “overinsistence.”","zh":"你的邮件里写了“overinsistency”，但我觉得你想写的是“overinsistence”。"},{"en":"The issue isn’t inconsistency—it’s overinsistence on one small detail.","zh":"问题不在于不一致，而在于对一个小细节过度坚持。"}]},{"partOfSpeech":"n.","definition":{"en":"overinsistence: excessive or repeated insistence; pressing a point too strongly or too often.","zh":"overinsistence：过度坚持；把某个观点逼得太紧或反复强调太多次。"},"examples":[{"en":"Her overinsistence on perfect grammar made the conversation feel tense.","zh":"她对语法完美的过度坚持让谈话变得紧张。"},{"en":"Overinsistence can sound rude, even if your idea is good.","zh":"即使你的想法很好，过度坚持也可能听起来很无礼。"}]}],"synonyms":["overinsistence","overemphasis","being too insistent","excessive insistence","doggedness"],"phonetic":"/ˌoʊvərɪnˈsɪstəns/","extraExplanation":["“overinsistency”不是常见或规范的英语单词。写作中建议改用更自然的表达：\n- 想说“过度坚持/一味坚持”：用 overinsistence 或者更常见的 overemphasis（过度强调）、being too insistent（太执拗）。\n- 想说“前后不一致”：用 inconsistency（不一致）、contradiction（矛盾）。\n另外，“insistency”本身也不常用，通常用 insistence。"]}
{"word":"overinsistent","summary":{"en":"Overinsistent means excessively persistent in a pushy, often annoying way.","zh":"overinsistent 指“过分坚持、纠缠不休”，语气偏负面，带有逼人或让人反感的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too persistent in asking for something or trying to make something happen, in a way that feels pushy or annoying.","zh":"（要求或推动某事）过分坚持的；纠缠不休的；咄咄逼人的（让人觉得有点烦或有压力）。"},"examples":[{"en":"The salesperson was overinsistent, so we left the store.","zh":"那位销售员纠缠得太厉害了，所以我们离开了那家店。"},{"en":"She was overinsistent about getting an immediate answer.","zh":"她过分坚持要立刻得到答复。"}]}],"synonyms":["pushy","overly persistent","demanding","insistent","importunate"],"phonetic":"/ˌoʊvərɪnˈsɪstənt/","extraExplanation":["“over-”表示“过度、太……”。因此 overinsistent = insist（坚持）到“过头”。它常带有负面评价，暗示不尊重他人的界限（boundaries）。","在语气上，overinsistent 比 persistent（坚持不懈，可能是褒义）更负面；也常接近 pushy / demanding（强势、逼迫）。","常见搭配：overinsistent + about/on（对……过分坚持），例如 overinsistent on payment（对付款过分逼迫）。"]}
{"word":"overinsistently","summary":{"en":"“Overinsistently” means doing something in an overly insistent, pushy way.","zh":"“overinsistently”表示“过分坚持/纠缠地”，常带负面评价。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too insistent or too persistent, especially so that it becomes annoying, pushy, or inappropriate.","zh":"以过分坚持、过分纠缠的方式（常带负面含义，显得烦人、咄咄逼人或不合时宜）。"},"examples":[{"en":"He overinsistently asked for a discount, even after the clerk said no.","zh":"他过分坚持地要求打折，尽管店员已经拒绝了。"},{"en":"She overinsistently repeated the same point until everyone felt uncomfortable.","zh":"她过分坚持地反复强调同一个观点，弄得大家都不自在。"},{"en":"The reporter overinsistently pressed the guest for a private detail.","zh":"记者过分咄咄逼人地追问嘉宾的隐私细节。"}]}],"synonyms":["too insistently","overly insistently","pushily","overly persistently","importunately"],"phonetic":"ˌoʊvərɪnˈsɪstəntli","extraExplanation":["“overinsistently”= over-（过度）+ insist（坚持）+ -ently（副词形式）。语气通常偏负面，强调“超过合理程度”。","日常表达里更常见的替代说法有：“too insistently / too pushily / in an overly persistent way”。在正式写作或批评语境中用“overinsistently”更突出“过犹不及”。"]}
{"word":"overinsolence","summary":{"en":"Overinsolence means excessive rudeness or disrespect—insolence that goes too far.","zh":"overinsolence 指“过度无礼/过分傲慢不尊重”，强调无礼程度过头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive insolence; more rudeness, disrespect, or impudent behavior than is acceptable","zh":"过度无礼；过分的傲慢与不尊重（比一般“insolence”更强烈）"},"examples":[{"en":"The teacher corrected his overinsolence before it spread to the rest of the class.","zh":"老师及时纠正了他过度无礼的行为，以免影响全班。"},{"en":"Her overinsolence toward customers quickly cost her the job.","zh":"她对顾客过分傲慢无礼，很快就丢了工作。"}]}],"synonyms":["extreme insolence","impudence","disrespect","effrontery","rudeness"],"phonetic":"/ˌoʊvərˈɪnsələns/","extraExplanation":["“Overinsolence”是由前缀 over-（过度）+ insolence（无礼、傲慢）构成的词，语义透明，但在现代日常英语中非常少见；更常用的表达是 “insolence / extreme insolence / blatant insolence” 或用形容词如 “overly rude / disrespectful / insolent”。","在语体上，它更像偏文学或修辞性用法，用来强调“无礼到了过头”的程度。"]}
{"word":"overinsolent","summary":{"en":"Overinsolent means excessively insolent—too rude or disrespectful.","zh":"overinsolent 表示“过分无礼/傲慢”，强调无礼程度超出界限。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively rude, disrespectful, or boldly insulting (more insolent than is acceptable).","zh":"过分无礼的；极其傲慢、冒犯的（比一般“无礼/傲慢”更严重）。"},"examples":[{"en":"The customer’s overinsolent remarks shocked the staff.","zh":"那位顾客过分无礼的言论让员工们很震惊。"},{"en":"He wasn’t just confident—his tone became overinsolent and disrespectful.","zh":"他不只是自信——他的语气变得过分傲慢、很不尊重人。"}]}],"synonyms":["too insolent","impertinent","brazen","disrespectful","impudent","rude"],"phonetic":"/ˌoʊvərˈɪnsələnt/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”，所以 overinsolent = “insolent（无礼的、傲慢的）”的加强版，强调“超出界限的无礼”。","这个词在现代英语中不算常用；更自然的表达常见于：too insolent / extremely insolent / downright insolent / arrogantly rude。"]}
{"word":"overinsolently","summary":{"en":"“Overinsolently” means acting or speaking in an excessively rude or disrespectful way.","zh":"“overinsolently”表示以过分无礼、冒犯或不敬的方式行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively rude, disrespectful, or arrogant way (more than is socially acceptable).","zh":"以过分无礼、冒犯或傲慢的方式（超过社交可接受的程度）。"},"examples":[{"en":"He spoke overinsolently to the teacher and was asked to apologize.","zh":"他对老师说话过分无礼，被要求道歉。"},{"en":"The customer complained that the staff member replied overinsolently.","zh":"顾客抱怨那位员工回话太过傲慢无礼。"}]}],"synonyms":["very rudely","extremely disrespectfully","arrogantly","impudently","overbearingly"],"phonetic":"ˌoʊvərˈɪnsələntli","extraExplanation":["“overinsolently”由 over-（过度地）+ insolently（无礼地）构成，属于较少见的书面/强调用法，用来突出“无礼到过头”的程度。日常英语里更常用：“very rudely / extremely disrespectfully / arrogantly”。","语气上它带有强烈批评意味，常见于叙述、评论或文学风格的句子里，用来表达说话/态度“越界”。"]}
{"word":"overinstruct","summary":{"en":"Overinstruct means giving too many instructions or explaining something too much, often causing confusion or reducing independence.","zh":"overinstruct 指“指示/讲解过多”，常会让人困惑、效率下降，或降低独立性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone more instructions than necessary, often making the task confusing, slow, or less independent","zh":"过度指示；指示过多（常导致对方困惑、效率变低或缺乏独立性）"},"examples":[{"en":"If you overinstruct new staff, they may stop thinking for themselves.","zh":"如果你对新员工过度指示，他们可能就不再独立思考了。"},{"en":"The coach tried not to overinstruct during the game and let the players adapt.","zh":"教练尽量不在比赛中过度指示，让球员自己调整。"}]},{"partOfSpeech":"vt.","definition":{"en":"to teach or explain in an overly detailed, step-by-step way, leaving little room for exploration or creativity","zh":"过度讲解；讲得过细过死（几乎不给探索或创造的空间）"},"examples":[{"en":"Some teachers overinstruct and students become afraid to make mistakes.","zh":"有些老师讲得过细，学生反而害怕犯错。"},{"en":"Try to demonstrate once instead of overinstructing every tiny step.","zh":"尽量示范一次就好，不要把每个小步骤都讲得过度详细。"}]}],"synonyms":["overexplain","micromanage","overteach"],"phonetic":"/ˌoʊvərɪnˈstrʌkt/","extraExplanation":["“overinstruct”= over-（过度）+ instruct（指导/教授）。它不是特别高频的日常口语词，但在教育、培训、管理、用户体验（写说明书/产品引导）等语境里很实用。","语气通常略带批评或提醒：问题不在于“指导”，而在于“指导过头”，让对方依赖、失去尝试空间，或信息量太大反而更难做对。"]}
{"word":"overinstruction","summary":{"en":"Overinstruction means giving more directions or guidance than necessary, which can overwhelm people or reduce independent thinking.","zh":"Overinstruction 指“过度指导/过多指令”，会让人不知所措或削弱独立思考。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Too much instruction or guidance; the act of giving more directions than are necessary, often making a task confusing or less effective.","zh":"过度指导；指给出超过必要程度的说明或指令，常常导致任务更混乱或效果更差。"},"examples":[{"en":"The training manual suffers from overinstruction, so new employees feel overwhelmed.","zh":"这本培训手册存在过度指导的问题，所以新员工会感到不知所措。"},{"en":"Try to avoid overinstruction when you’re teaching—give one clear step at a time.","zh":"教学时尽量避免过度指导——一次给一个清晰步骤。"}]},{"partOfSpeech":"n.","definition":{"en":"In education or writing, overly detailed directions that reduce a learner’s independence or creativity.","zh":"（教育或写作中）过于细致的指示，削弱学习者的独立性或创造力。"},"examples":[{"en":"Some students do better with fewer prompts; overinstruction can stop them from thinking for themselves.","zh":"有些学生在提示更少时反而表现更好；过度指导会让他们不再独立思考。"},{"en":"The assignment was meant to be open-ended, but overinstruction made every answer look the same.","zh":"这项作业本来是开放性的，但过度指导让每个人的答案都变得一样。"}]}],"synonyms":["excessive instruction","too much guidance","over-explaining","micromanaging (in management contexts)"],"phonetic":"/ˌoʊvərɪnˈstrʌkʃən/","extraExplanation":["“overinstruction”由前缀 over-（过度）+ instruction（指导/说明）构成，常见于教育、培训、产品说明书、写作与管理语境。","近义表达（更常见）包括：too much guidance / excessive instruction / over-explaining（过度解释）。注意 over-explaining 更口语，强调“解释太多”；overinstruction 更偏正式，强调“指令/步骤太多”。"]}
{"word":"overinstructive","summary":{"en":"Overinstructive means giving too much instruction or guidance.","zh":"overinstructive 指“给出过多指示/指导”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Giving too many instructions or too much guidance, often in a way that feels controlling, unnecessary, or overwhelming.","zh":"过度指导的；指示太多的（常让人觉得被控制、不必要或信息量过大）。"},"examples":[{"en":"The worksheet is helpful, but the directions are a bit overinstructive.","zh":"这份练习单很有帮助，但说明有点过度指导。"},{"en":"Some students prefer freedom to explore, so an overinstructive teacher can frustrate them.","zh":"有些学生更喜欢自由探索，所以过度指导的老师可能会让他们感到挫败。"},{"en":"Try not to be overinstructive—give the goal, then let them try.","zh":"尽量别过度指导——先讲清目标，再让他们自己试试。"}]}],"synonyms":["overly directive","too prescriptive","micromanaging","overly controlling","hand-holding"],"phonetic":"/ˌoʊvərɪnˈstrʌktɪv/","extraExplanation":["这个词多用于教学、写作说明、产品使用指南或管理沟通等场景，带有“好心但过头”的语气。","构词：over-（过度）+ instructive（有指导性的）。instructive通常偏褒义（“有启发/有帮助”），加上over-后常转为负面（“太啰嗦、太控制”）。"]}
{"word":"overinstructively","summary":{"en":"“Overinstructively” means doing or speaking in an overly detailed, overly guiding way—giving more instructions than necessary.","zh":"“overinstructively”表示以过度详细、过度指导的方式做事或说话——给的指示超过需要。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that gives too many instructions or too much guidance, often making things feel controlling, confusing, or unnecessary.","zh":"以“指示过多/指导过度”的方式；常让人觉得被管得太细、变复杂或没必要。"},"examples":[{"en":"The manual is written overinstructively, explaining even the most obvious steps.","zh":"这本说明书写得很“过度指导”，连最显而易见的步骤都要解释。"},{"en":"He spoke overinstructively during the group project, so others stopped sharing ideas.","zh":"小组项目时他说话太“过度指导”，结果别人都不太愿意提想法了。"}]}],"synonyms":["overly","excessively","too detailed","micromanaging","overly controlling"],"phonetic":"/ˌoʊvərɪnˈstrʌktɪvli/","extraExplanation":["“overinstructively”由 over-（过度）+ instruct（指导）+ -ive（形容词后缀）+ -ly（副词后缀）构成，意思就是“以过度指导的方式”。","这个词相对少见，更常见的表达是 too instructive、overly detailed、too controlling、micromanaging（更口语/职场）。如果你想更自然，也可以用这些替代。","语气通常带一点负面评价：强调“给的指导超过了需要”，让人失去自主或增加负担。"]}
{"word":"overinstructiveness","summary":{"en":"Overinstructiveness means giving more instructions than needed, often in an overly detailed or controlling way.","zh":"overinstructiveness 指“指示过多/讲解过细”的倾向，常带有“过度、管得太多”的负面语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of giving too many instructions or too much detailed guidance, often in a way that feels controlling, unnecessary, or tiring.","zh":"（说话或写作）指示过多、讲解过细的特质，常让人觉得管得太多、不必要或让人疲惫。"},"examples":[{"en":"Some learners find the overinstructiveness of the manual confusing because it explains every tiny step.","zh":"有些学习者觉得这本手册指示过多反而让人困惑，因为它把每个小步骤都讲得太细。"},{"en":"The coach’s overinstructiveness made the team nervous instead of confident.","zh":"教练指示过多让队员变得紧张，而不是更有信心。"},{"en":"Try to reduce overinstructiveness in your emails; give the key steps and trust people to handle the rest.","zh":"尽量减少邮件里指示过多的问题；给出关键步骤，并相信大家能处理其余部分。"}]}],"synonyms":["excessive instruction","over-explaining","micromanagement (in tone)","overdirection","too much guidance"],"phonetic":"/ˌoʊvərɪnˈstrʌktɪvnəs/","extraExplanation":["这是一个相对少见、偏“自造/临时造词”的名词：over-（过度）+ instructive（指导性的）+ -ness（名词后缀，表示“性质/状态”）。在日常英语里，更常见的表达包括：being too instructive、too much instruction、micromanaging tone（带有事无巨细管控的语气）。","语感上它通常带轻微批评：不是“有帮助的指导”，而是“过度指导”，可能暗示不信任对方能力或缺乏简洁。"]}
{"word":"overinsurance","summary":{"en":"Overinsurance means having insurance coverage that is more than the item’s real value or more than you actually need.","zh":"overinsurance 指“超额/过度投保”，即保险金额超过实际价值或超过实际需求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Insurance coverage for an amount more than the actual value of what is being insured (for example, insuring property for more than it is worth).","zh":"（保险）超额投保；保险金额超过被保险财产或利益的实际价值。"},"examples":[{"en":"The bank warned that overinsurance could lead to problems if a claim is investigated.","zh":"银行提醒说，超额投保在理赔调查时可能会引发问题。"},{"en":"They reduced the policy amount to avoid overinsurance on the apartment.","zh":"他们下调了保额，以避免对公寓超额投保。"}]},{"partOfSpeech":"n.","definition":{"en":"More insurance protection than is necessary, especially when it causes wasted cost (paying for coverage you don’t really need).","zh":"（引申）过度投保；买了超出实际需要的保险，导致保费浪费。"},"examples":[{"en":"Buying three similar travel policies is a kind of overinsurance.","zh":"买三份相似的旅行险就是一种过度投保。"},{"en":"The advisor reviewed her plans to cut overinsurance and save money.","zh":"顾问帮她复核方案，减少过度投保以省钱。"}]}],"synonyms":["excess insurance","overcoverage","excessive coverage"],"phonetic":"/ˌoʊvərˈɪnʃərəns/","extraExplanation":["在许多法域，超额投保可能触发“道德风险”（moral hazard）的担忧：如果保额远高于实际价值，保险公司可能更严格审查投保动机与损失证明。","实际理赔通常遵循“补偿原则”（principle of indemnity）：财产险一般以弥补实际损失为主，通常不会因为你投得更高就赔得更多（人身险如寿险则不同，通常按约定保额给付）。","学习上可把 over- 理解为“超过、过度”，类似词：overpay（多付）、overwork（过度工作）、overthink（想太多）。"]}
{"word":"overinsure","summary":{"en":"Overinsure means to insure for more than the real value or more coverage than needed.","zh":"overinsure 指投保金额或保险保障超过实际价值或实际需要。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to insure something for more than its real value, or to buy more insurance coverage than is necessary","zh":"（对财产等）投保金额超过实际价值；（个人/企业）购买超出需要的保险保障"},"examples":[{"en":"If you overinsure your home, you may pay higher premiums without getting extra benefit.","zh":"如果你把房子过度投保，可能只是多交保费，却未必得到额外好处。"},{"en":"The bank required coverage, but the borrower didn’t want to overinsure the property.","zh":"银行要求投保，但借款人不想对房产过度投保。"}]}],"synonyms":["overinsure","over-insure","insure for too much","overcover"],"phonetic":"/ˌoʊvərɪnˈʃʊr/","extraExplanation":["“Overinsure”常见于财产保险语境。很多保险遵循“补偿原则”（indemnity）：理赔的目的通常是弥补损失，而不是让投保人获利，所以即使投保额高于实际价值，出险时也不一定能按投保额全额赔付。","在某些情况下，过度投保会被保险公司视为风险信号（例如可能增加道德风险），可能影响承保、费率或理赔审查。"]}
{"word":"overinsured","summary":{"en":"Overinsured means having insurance coverage that is too high—either above the item’s real value or more than you reasonably need.","zh":"overinsured 指“过度投保/保障过多”：保额高于实际价值，或保障超出合理需求。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having insurance coverage that is higher than the true value of the thing being insured (so the payout could be more than the loss).","zh":"（保险）投保金额/保额高于实际价值的；过度投保的（可能导致理赔金额超过真实损失）。"},"examples":[{"en":"The appraiser said the house was overinsured, so they reduced the coverage to match its market value.","zh":"评估师说这套房子过度投保，所以他们把保额下调到与市场价值一致。"},{"en":"If a car is overinsured, the owner may pay higher premiums than necessary.","zh":"如果一辆车过度投保，车主可能会付不必要的更高保费。"}]},{"partOfSpeech":"adj.","definition":{"en":"More broadly, having more insurance protection than you reasonably need, often resulting in unnecessary cost.","zh":"（更广义）保险保障买得过多、超出合理需求的（通常会造成不必要的开支）。"},"examples":[{"en":"After comparing plans, she realized she was overinsured and could switch to a cheaper policy.","zh":"比较不同方案后，她发现自己保障买多了，可以换成更便宜的保单。"},{"en":"Some families feel overinsured when they pay for many overlapping policies.","zh":"有些家庭买了很多重复保障的保单，会觉得自己“过度投保”。"}]}],"synonyms":["overcovered","overprotected","excessively insured"],"phonetic":"/ˌoʊvərɪnˈʃʊrd/","extraExplanation":["“overinsured”常见于财产险（房屋、车辆、设备）语境：保额应尽量接近可保利益/重置成本或实际价值；否则保费更高，而且在很多保险条款下也不一定能“多赔”。","在健康险或人身险语境里，它更偏向日常说法：指保障层层叠加、条款重复，导致花了更多钱但实际边际收益不大。","相关概念：underinsured（保额不足）、overcoverage（保障过度/重复保障）、premium（保费）、coverage（保障/保额）。"]}
{"word":"overinsures","summary":{"en":"“Overinsures” means insures something for more than its real value or than needed.","zh":"“overinsures”表示为某物投保过高，超过实际价值或需要。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to insure something for more than its real value or more than is necessary (third-person singular: overinsures)","zh":"（把……）投保过高；为……投保超过其实际价值或实际需要（第三人称单数：overinsures）"},"examples":[{"en":"If the owner overinsures the house, the premiums may be unnecessarily high.","zh":"如果房主把房子投保过高，保费可能会不必要地很贵。"},{"en":"She overinsures her jewelry because she worries about losing it.","zh":"她因为担心丢失，把珠宝投保过高。"}]}],"synonyms":["insure for too much","over-cover (informal)","overprotect (in a loose sense)"],"phonetic":"/ˌoʊvərɪnˈʃʊr/","extraExplanation":["在保险实务中，即使“投保金额”高于财产的实际价值，理赔通常也受“实际损失”限制（不会因为你投得更高就多赔）。因此过度投保常见的后果是保费变高，但保障收益不一定增加。","“overinsure”常用于财产险语境（房屋、车辆、贵重物品等）。与之相对的是“underinsure”（投保不足），可能导致理赔时按比例减少赔付。"]}
{"word":"overinsuring","summary":{"en":"Overinsuring means having more insurance coverage than you reasonably need (often more than the item’s real value).","zh":"Overinsuring 指保险保障买得过多或保额高于实际需要（常见为高于物品真实价值）的“过度投保”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of buying or keeping more insurance coverage than you need, so you may pay unnecessarily high premiums or create other problems (like coverage limits or complicated claims).","zh":"过度投保；购买或维持超过实际需要的保险保障，可能导致保费不必要地过高，或带来其他问题（如理赔更复杂、保障结构不合理等）。"},"examples":[{"en":"After comparing the value of the car with the policy limits, we realized we were overinsuring.","zh":"把车的实际价值和保额一对比，我们才发现自己在过度投保。"},{"en":"Overinsuring your home can raise your premiums without giving you much extra real protection.","zh":"房屋过度投保可能会抬高保费，却不一定带来多少额外的实际保障。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “overinsure”: to insure something for more than its true value or to buy more coverage than is reasonably needed.","zh":"“overinsure”的现在分词：把某物投保到高于其真实价值的额度，或购买超出合理需要的保险保障。"},"examples":[{"en":"She is overinsuring her jewelry by listing outdated prices.","zh":"她用过时的价格申报珠宝，导致投保金额过高。"},{"en":"They were overinsuring, so their agent suggested lowering the limits to match the replacement cost.","zh":"他们存在过度投保，所以经纪人建议把保额下调到与重置成本相匹配。"}]}],"synonyms":["overcoverage","excess coverage","overinsurance"],"phonetic":"/ˌoʊvɚˈɪnʃʊrɪŋ/","extraExplanation":["在很多保险（如财产险）里，赔付通常以“实际损失”或“重置成本/实际现金价值”等规则为上限，并不会因为你买了更高保额就按更高金额多赔。因此过度投保常见的结果是：保费更高，但理赔未必增加。","“overinsure / overinsuring”常用于个人财产（房屋、车、贵重物品）与商业保险语境。相近概念还有“overcoverage（保障过多）”“being overinsured（处于过度投保状态）”。"]}
{"word":"overintellectual","summary":{"en":"Overintellectual means excessively analytical or idea-focused, often at the expense of practicality or emotion.","zh":"overintellectual 指“过度理智化/过分思辨”，常暗示过度分析而忽略实际或情感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too focused on intellectual ideas or analysis in a way that feels excessive, impractical, or emotionally distant.","zh":"过度理智化的；过分强调思辨与分析的（以至于显得不切实际或缺乏情感温度）。"},"examples":[{"en":"The film is interesting, but it can feel overintellectual and hard to connect with emotionally.","zh":"这部电影很有意思，但有时显得过度理智化，让人难以在情感上产生共鸣。"},{"en":"He tends to give overintellectual explanations for simple problems.","zh":"他常常把简单问题解释得过分思辨、过于复杂。"},{"en":"Her writing is clear, but critics say it becomes overintellectual in the final chapters.","zh":"她的写作很清晰，但评论家认为最后几章变得过度理智化。"}]}],"synonyms":["overly intellectual","too intellectual","overanalytical","cerebral","theoretical"],"phonetic":"/ˌoʊvərˌɪn.təˈlɛk.tʃu.əl/","extraExplanation":["“over-”表示“过度、过分”。“overintellectual”常带一点批评意味：强调“想得太多、分析太多”，可能忽略直觉、情感或实际可行性。","更常见的近义表达包括“too intellectual”“overly intellectual”“overanalyzed / overanalytical”。在正式写作中，“overintellectual”也可能写作“over-intellectual”。"]}
{"word":"overintellectualism","summary":{"en":"Overintellectualism means an overly complex, abstract way of thinking that can get in the way of feeling, communication, or action.","zh":"Overintellectualism 指过度理智化、过分抽象复杂的思考方式，可能妨碍情感体验、沟通或行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or tendency of thinking about things in an overly complex, abstract, or “too cerebral” way, sometimes at the cost of common sense, emotion, or practical action.","zh":"过度理智化；过分卖弄学问（把事情想得过于复杂、抽象，甚至忽视常识、情感或实际行动）。"},"examples":[{"en":"Some critics say the film suffers from overintellectualism and forgets to tell a human story.","zh":"一些评论家认为这部电影过度理智化，反而忘了讲一个有人味的故事。"},{"en":"Her overintellectualism made it hard for her to simply enjoy the moment.","zh":"她的过度理智化让她很难单纯享受当下。"},{"en":"We need clear decisions, not overintellectualism in every meeting.","zh":"我们需要明确的决策，而不是每次开会都过度理智化。"}]}],"synonyms":["overthinking","excessive analysis","cerebralism","academic pedantry"],"phonetic":"/ˌoʊvərˌɪn.təˈlɛk.tʃu.əˌlɪz.əm/","extraExplanation":["这个词通常带批评意味：不是说“聪明/有学问”不好，而是指“想太多、讲太玄、过度分析”，导致沟通变难或事情推进不了。","构词法：over-（过度）+ intellectual（理智/智识的）+ -ism（倾向/主义），因此常用来指一种“倾向”或“风气”。","常见语境：艺术评论（作品过于观念化）、学术/公共讨论（脱离现实）、心理层面（用理性分析回避情绪体验）。","相关表达：overthink（想太多，较口语）、too academic（太学院派）、too cerebral（太烧脑/太理智）、paralysis by analysis（分析瘫痪）。"]}
{"word":"overintellectuality","summary":{"en":"Overintellectuality means being overly intellectual—thinking or explaining things in a way that is too complex or academic.","zh":"overintellectuality 指过度理智化/过分学究化：把事情想或说得过于复杂、太学院派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or tendency of thinking, analyzing, or speaking in an overly complex or “too academic” way, often making things harder to understand than necessary.","zh":"过度理智化；过分卖弄学问（把事情想得/说得过于复杂，反而难以理解）。"},"examples":[{"en":"His overintellectuality made the simple story feel cold and complicated.","zh":"他过度理智化的表达让一个简单的故事变得冷冰冰又复杂。"},{"en":"In team meetings, a little theory helps, but overintellectuality can slow decisions.","zh":"在团队会议里，适度的理论有帮助，但过度理智化会拖慢决策。"},{"en":"She tried to avoid overintellectuality and explain the idea in plain English.","zh":"她尽量避免过度理智化，用通俗英语来解释这个观点。"}]}],"synonyms":["overthinking","overanalysis","intellectualizing","being too academic","overcomplication"],"phonetic":"/ˌoʊvərˌɪn.təˌlɛk.tʃuˈæl.ə.ti/","extraExplanation":["“Overintellectuality”不是特别常见的日常用词，更常见的说法是“overthinking（想太多）”“overanalyzing（过度分析）”或“being too academic/too intellectual（太学院派/太卖弄学问）”。","这个词通常带有轻微的负面评价：不是反对“聪明”，而是批评把简单问题复杂化、忽略情感/现实需要，或用艰深语言制造距离感。","写作中若想更自然，可以根据语境改用：overthinking（偏心理与纠结）、overanalysis（偏分析流程）、intellectualizing（偏把情感问题理性化处理）。"]}
{"word":"overintellectualization","summary":{"en":"Overintellectualization means overthinking in an overly abstract or complicated way that becomes unhelpful or blocks action and emotion.","zh":"overintellectualization 指以过于抽象复杂的方式过度思考，变得不实际，甚至妨碍行动与情绪体验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit of thinking about things too much—especially in an abstract, complicated, or “theoretical” way—so that it becomes unhelpful or gets in the way of action, feelings, or clear decisions.","zh":"过度理智化；过度“用脑”分析——尤其以抽象、复杂、理论化的方式想太多，结果反而无助，甚至妨碍行动、感受或做决定。"},"examples":[{"en":"My overintellectualization of the problem kept me from taking a simple next step.","zh":"我对这个问题的过度理智化，让我迟迟不敢迈出一个简单的下一步。"},{"en":"Sometimes overintellectualization is a way to avoid uncomfortable emotions.","zh":"有时候，过度理智化是一种回避不舒服情绪的方式。"},{"en":"Her overintellectualization turned a friendly chat into a debate about definitions.","zh":"她的过度理智化把一次轻松的聊天变成了关于定义的辩论。"}]}],"synonyms":["overthinking","analysis paralysis","overanalysis","rumination","excessive rationalization"],"phonetic":"/ˌoʊvərɪnˌtɛlɪktʃuələˈzeɪʃən/","extraExplanation":["在日常用语里，overintellectualization 常带一点负面评价：不是“聪明地思考”，而是“想得太多、太绕”，导致拖延、焦虑或沟通变得不自然。","在心理学语境中，它有时接近“理智化（intellectualization）”这种防御机制：用分析与概念来拉开与情绪的距离。注意：这不是正式诊断名，只是一种描述方式。","常见搭配：overintellectualization of feelings / relationships / decisions（对感受/关系/决定的过度理智化）。与之相对的表达：keep it simple（简单点）、go with your gut（相信直觉）、take action（先行动）。"]}
{"word":"overintellectualize","summary":{"en":"Overintellectualize means to think about or explain something in an overly complex, overly theoretical way.","zh":"Overintellectualize 指对某事过度思考或过度理论化解释，把事情弄得太复杂。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To think about something too much, especially in an overly complex or academic way, so that it becomes less clear or less practical.","zh":"（对某事）过度思考；把事情想得过于复杂或学术化，结果反而不清晰或不实用。"},"examples":[{"en":"We don’t need to overintellectualize this—just choose the simplest solution that works.","zh":"我们不需要把这件事过度学术化——选一个最简单可行的方案就好。"},{"en":"He tends to overintellectualize relationships instead of talking about his feelings directly.","zh":"他在感情问题上常常过度理性分析，而不是直接谈感受。"},{"en":"The movie is emotional and straightforward; please don’t overintellectualize it.","zh":"这部电影很直接、很感性；别把它过度解读得太复杂。"}]},{"partOfSpeech":"v.","definition":{"en":"To explain or interpret something in an unnecessarily theoretical way, often using complicated language.","zh":"用不必要的理论框架或复杂措辞去解释/解读某事（显得过于理论化）。"},"examples":[{"en":"Some reviewers overintellectualize the book and miss its simple message.","zh":"有些书评人把这本书过度理论化解读，反而错过了它朴素的主题。"},{"en":"She overintellectualized her apology, and it sounded less sincere.","zh":"她把道歉说得过于“讲道理”，听起来反而没那么真诚。"}]}],"synonyms":["overthink","overanalyze","overcomplicate","read too much into","overinterpret"],"phonetic":"/ˌoʊvərˌɪn(t)əˈlɛktʃuəˌlaɪz/","extraExplanation":["“over-”表示“过度”。“intellectualize”本意是“用理智/理论方式来理解或处理”，加上“over-”后通常带一点批评意味：不是反对思考，而是强调“想太多、想太复杂，失去直观与实用”。","语体：多用于口语或评论性写作（影评、书评、职场讨论）。常与“don’t overintellectualize it”搭配，意思接近“别想太多/别过度解读”。"]}
{"word":"overintellectualized","summary":{"en":"Overly complex or abstract in thinking or explaining, often at the cost of clarity or practicality.","zh":"思考或表达过于复杂抽象，常牺牲清晰度与实用性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thinking about something in a way that is too abstract, complex, or theoretical, so it becomes less clear, less practical, or less emotionally real.","zh":"把事情想得过于抽象、复杂或理论化，导致不清楚、不实用，或忽略真实情感与体验。"},"examples":[{"en":"Her explanation was so overintellectualized that no one knew what action to take next.","zh":"她的解释过于理论化，结果大家都不知道下一步该做什么。"},{"en":"Sometimes we overintellectualize relationships instead of simply listening and caring.","zh":"有时候我们把亲密关系想得太复杂，而不是单纯地倾听与关心。"},{"en":"The movie’s simple message felt overintellectualized in some reviews.","zh":"这部电影原本简单的主题，在一些影评里被解读得过于高深。"}]}],"synonyms":["overly analytical","overthought","too theoretical","overcomplicated","abstract"],"phonetic":"/ˌoʊvərˌɪntəˈlɛktʃuəˌlaɪzd/","extraExplanation":["“overintellectualized”来自动词“overintellectualize”（过度理智化/过度理论化），常用于批评某种分析方式：讲概念多、落地少，或者用头脑分析取代了直觉、情感与常识。","语气通常偏负面，但不一定是在否定“聪明”；更多是在提醒：把事情说得太复杂，反而妨碍理解与行动。常见搭配：overintellectualized analysis/explanation/approach/interpretation（过度理论化的分析/解释/方法/解读）。"]}
{"word":"overintellectualizing","summary":{"en":"Overintellectualizing means analyzing or theorizing too much, making something more complicated than it needs to be.","zh":"overintellectualizing 指把事情过度理论化、过度分析，把本来可以简单处理的事想得太复杂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thinking about something in an overly complex, abstract, or “too analytical” way, especially when a simpler, more practical approach would help.","zh":"对某件事想得过于复杂、过于抽象或“分析过头”，以至于忽略了更简单、更实际的做法。"},"examples":[{"en":"We’re overintellectualizing the problem—let’s just try a simple test and see what happens.","zh":"我们把这个问题想得太复杂了——先做个简单测试看看结果吧。"},{"en":"She realized she was overintellectualizing the conversation instead of listening to how she actually felt.","zh":"她意识到自己在把那段对话过度分析，而不是去倾听自己真实的感受。"}]},{"partOfSpeech":"v.","definition":{"en":"To think about (something) too theoretically or too much, rather than acting or focusing on real-life details.","zh":"把（某事）想得太理论化、太过度分析，而不是去行动或关注现实细节。"},"examples":[{"en":"Don’t overintellectualize it; sometimes an apology is just an apology.","zh":"别把这事想得太复杂；有时候一句道歉就只是道歉。"},{"en":"He kept overintellectualizing every decision, which made it hard to move forward.","zh":"他对每个决定都过度分析，结果很难推进。"}]}],"synonyms":["overanalyzing","overthinking","overcomplicating","making too theoretical"],"phonetic":"/ˌoʊvərˌɪn(t)əˈlɛktʃuəˌlaɪzɪŋ/","extraExplanation":["“over-”表示“过度/超过需要”。“intellectualize”是“用理性、理论去解释”，加上“over-”后常带一点提醒或批评的语气：想太多、想太深，反而不解决问题。","在口语和心理、情感类语境里很常见：强调“别只用头脑分析，也要看现实/行动/感受”。"]}
{"word":"overintellectually","summary":{"en":"“Overintellectually” means doing or thinking about something in an overly intellectual, over-analytical way.","zh":"“overintellectually”指以过于理智、过度分析的方式去做事或理解事情。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too intellectual or overly analytical, often making something feel abstract, complicated, or lacking in emotion.","zh":"以过于理智或过度分析的方式；常使事情显得抽象、复杂，或缺少情感。"},"examples":[{"en":"He explained the movie overintellectually, as if it were a philosophy lecture.","zh":"他把这部电影讲得过于学院化，像在上哲学课一样。"},{"en":"Don’t take her comment overintellectually—it was just a casual joke.","zh":"别把她的话过度解读——那只是随口开的玩笑。"},{"en":"The argument becomes overintellectually complicated and loses its point.","zh":"这个论证被弄得过度复杂，反而失去了重点。"}]}],"synonyms":["overanalytically","too intellectually","overly analytically","academically (often implies overly formal)","cerebrally (sometimes implies emotionally distant)"],"phonetic":"/ˌoʊvərˌɪn(t)əˈlɛktʃuəli/","extraExplanation":["这个词由 over-（“过度”）+ intellectually（“理性地／从智识角度”）构成，语气通常带一点批评：强调“想太多、讲得太学术、把简单问题复杂化”，有时也暗示忽略了直觉、情感或实际需要。","常见搭配：overintellectually analyze（过度分析）、overintellectually explained（解释得过于理论化）、take something overintellectually（把某事过度解读/理性化）。"]}
{"word":"overintellectualness","summary":{"en":"Overintellectualness means an excessive tendency to be overly intellectual or theoretical, often overcomplicating things.","zh":"Overintellectualness 指过度学术化／过度理论化的倾向，常把事情想得太复杂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or habit of thinking about things in an overly intellectual or theoretical way, often making something feel more complicated than it needs to be","zh":"过度理性化／过度理论化的倾向；把事情想得太“学术”、太复杂的习惯（常让问题显得不必要地复杂）"},"examples":[{"en":"Her overintellectualness made simple conversations feel like debates.","zh":"她的过度理性化让简单的聊天也像在辩论。"},{"en":"Sometimes a little overintellectualness can block empathy and real listening.","zh":"有时过度理性化会妨碍共情和真正的倾听。"},{"en":"The book criticizes the overintellectualness of modern art discussions.","zh":"这本书批评现代艺术讨论中的过度学术化倾向。"}]}],"synonyms":["overthinking","overanalysis","excessive intellectualism","over-intellectualization","overcomplication"],"phonetic":"/ˌoʊvərɪnˈtɛlɛktʃuəlnəs/","extraExplanation":["“overintellectualness”并不是非常常见或固定的标准词，更多时候人们会用更自然的表达，比如：overthinking（想太多）、overanalysis（过度分析）、being too intellectual（太学术/太理论）。","构词上它由 over-（过度）+ intellectual（理性的/学术的）+ -ness（名词后缀）组成，语气常带轻微批评，暗示“把事情过度上升到理论层面”。","在写作中，如果你想更地道，可以根据语境替换：强调“想太多”用 overthinking；强调“分析过度”用 overanalyzing/overanalysis；强调“太学术化的风格”可用 excessive intellectualism。"]}
{"word":"overintense","summary":{"en":"Overintense means “too intense” in a way that feels excessive for the situation.","zh":"overintense 指“过于强烈/过度认真或激烈”，让人感觉超出场合所需。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too intense; showing more seriousness, emotion, effort, or focus than a situation seems to require.","zh":"过于强烈的；（对事情）过分认真、情绪过度或用力过猛的。"},"examples":[{"en":"He can be overintense in meetings, treating small issues like a crisis.","zh":"他在会议上有时会过于紧绷，把小问题当成危机。"},{"en":"Her overintense reaction surprised everyone, since it was just a joke.","zh":"她过于激烈的反应让大家很惊讶，因为那只是个玩笑。"},{"en":"Try not to sound overintense when you ask for feedback—keep it friendly.","zh":"你征求反馈时尽量别显得过于严肃紧迫，语气友好一点。"}]}],"synonyms":["overly intense","too intense","excessively intense","high-strung","overzealous"],"phonetic":"ˌoʊvərɪnˈtɛns","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过正常范围”（如 overwork 过劳、overthink 想太多）。因此 overintense 往往带有轻微的负面评价：不是“很投入”本身不好，而是“投入得不合时宜/超出场合需要”。在较正式写作里，也可用 too intense、excessively intense、overly intense 等表达。"]}
{"word":"overintensely","summary":{"en":"Overintensely means “too intensely” or “more intensely than is appropriate.”","zh":"overintensely 表示“过于强烈地/太用力地”，强调强度超出情境所需。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too intense, too strong, or more intense than is appropriate for the situation.","zh":"以过于强烈、过度紧张或超出情境所需的方式；“太用力/太激烈地”。"},"examples":[{"en":"He reacted overintensely to a small mistake and apologized again and again.","zh":"他对一个小错误反应过于激烈，一再道歉。"},{"en":"The scene is filmed overintensely, making the argument feel bigger than it is.","zh":"这一幕拍得过于用力，让争吵显得比实际更严重。"}]}],"synonyms":["too intensely","excessively","overly","too strongly"],"phonetic":"/ˌoʊvərɪnˈtɛnsli/","extraExplanation":["构词提示：over- 常表示“过度/超过需要”（如 overreact 反应过度、overthink 想太多）。overintensely 就是 over + intensely（强烈地）组合而来，语气通常带有批评或提醒“过了头”。","使用场景：多用于描述情绪反应、表达方式、表演/镜头语言等“强度过高”的情况；比 too intensely 更强调“超出合理界限”。"]}
{"word":"overintenseness","summary":{"en":"Overintenseness means being too intense—strong, serious, emotional, or forceful beyond what the situation needs.","zh":"overintenseness 指“过度强烈/过度紧绷”的状态：强度、情绪或语气等超过场合所需。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being too intense (too strong, serious, emotional, or concentrated), often in a way that feels uncomfortable or inappropriate for the situation.","zh":"过度紧张/过度强烈的状态；（情绪、语气、气氛、关注度等）强烈到过头，令人不适或不合时宜。"},"examples":[{"en":"The overintenseness of his tone made a simple discussion feel like an argument.","zh":"他语气里的过度强烈让一场简单的讨论听起来像在吵架。"},{"en":"She worried that the overintenseness of the training plan would lead to burnout.","zh":"她担心训练计划的过度强度会导致倦怠。"}]},{"partOfSpeech":"n.","definition":{"en":"An instance or feature of something being overly intense (often used in casual or critical writing).","zh":"某种“过度强烈”的表现或特点（常见于口语化或评论性写作）。"},"examples":[{"en":"The movie has moments of overintenseness that distract from the story.","zh":"这部电影有些过度用力的时刻，反而分散了对剧情的注意力。"},{"en":"Try to soften the overintenseness in your opening paragraph.","zh":"尽量把开头段落里那种过度紧绷的感觉放柔和一点。"}]}],"synonyms":["excessive intensity","over-intensity","too much intensity","overzealousness","intensity (too high)"],"phonetic":"/ˌoʊvɚɪnˈtɛnsnəs/","extraExplanation":["“overintenseness”不是最常见的标准词，更常见的表达是“over-intensity / excessive intensity / too much intensity”。它由 over-（过度）+ intense（强烈的）+ -ness（名词后缀，表示“……的状态/性质”）构成，因此含义非常直观。写作中若想更自然，可以改用 “excessive intensity” 或直接说 “It feels too intense.”"]}
{"word":"overintensification","summary":{"en":"Overintensification means making something too intense or extreme, often causing problems.","zh":"overintensification 指把某事变得过于强烈或极端，往往会带来负面影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of making something seem or become too intense, strong, serious, or extreme (more than is appropriate or helpful).","zh":"把某事物变得过于强烈、严重或极端的行为或过程（超过合适或有帮助的程度）。"},"examples":[{"en":"The overintensification of a small disagreement turned it into a major conflict.","zh":"对一场小分歧的过度强化把它变成了严重冲突。"},{"en":"Social media can encourage the overintensification of emotions and opinions.","zh":"社交媒体可能会助长情绪和观点的过度强化。"}]},{"partOfSpeech":"n.","definition":{"en":"(In psychology/communication) The tendency to interpret feelings, reactions, or events as much more dramatic or threatening than they really are.","zh":"（心理学/沟通）把感受、反应或事件解读得比实际更戏剧化或更具威胁性的倾向。"},"examples":[{"en":"Therapy helped him notice his overintensification of criticism and respond more calmly.","zh":"治疗帮助他觉察自己对批评的过度强化，并更冷静地回应。"},{"en":"Try to separate facts from your overintensification of the situation.","zh":"试着把事实与自己对局势的过度强化分开。"}]},{"partOfSpeech":"n.","definition":{"en":"(In science, especially chemistry) The introduction or increase of extra intensity in a process (such as adding more than needed), which may cause unwanted effects or reduced efficiency.","zh":"（科学领域，尤指化学）在某个过程中过量引入或增加“强度”（例如添加过多），从而可能导致副作用或降低效率。"},"examples":[{"en":"Overintensification of the reaction conditions produced more byproducts.","zh":"反应条件的过度强化产生了更多副产物。"},{"en":"The team avoided overintensification by lowering the temperature and shortening the heating time.","zh":"团队通过降温并缩短加热时间来避免过度强化。"}]}],"synonyms":["exaggeration","overreaction","intensification (too much)","escalation (too far)","overemphasis"],"phonetic":"/ˌoʊvərɪnˌtɛn.sɪ.fəˈkeɪ.ʃən/","extraExplanation":["这个词由 over-（过度）+ intensification（强化、增强）构成，常见于较正式或学术的语境中。日常表达里，人们更常说 make it too intense / take it too far / exaggerate。","常见搭配：overintensification of emotions（情绪的过度强化）、overintensification of conflict（冲突升级过度）、overintensification of conditions（条件过度加强）。"]}
{"word":"overintensified","summary":{"en":"Overintensified means made too intense or extreme, often in reactions, visuals, or sound.","zh":"overintensified 指被过度增强、过于强烈（常用于反应、画面或声音效果）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made too intense, extreme, or strong; intensified more than is appropriate.","zh":"（强度、程度等）过度增强的；被强化得过头的。"},"examples":[{"en":"The movie’s colors looked overintensified, so the scenes felt unnatural.","zh":"这部电影的色彩看起来被过度增强了，所以画面显得不自然。"},{"en":"Her overintensified reaction made a small problem seem like a crisis.","zh":"她过度激烈的反应把一个小问题弄得像危机一样。"},{"en":"The overintensified sound effects distracted from the dialogue.","zh":"过度强化的音效分散了对白的注意力。"}]}],"synonyms":["overdone","exaggerated","too intense","overemphasized","overprocessed"],"phonetic":"/ˌoʊvərɪnˈtɛnsəˌfaɪd/","extraExplanation":["“overintensified”常见于批评或技术语境，尤其是影像与声音处理：比如照片/视频“饱和度、对比度拉太高”，或音频“压缩、增益、效果器用过度”，导致结果显得不自然、刺耳或失真。","构词法：over-（过度）+ intensified（加强的）。常与 look/feel/seem 等系动词连用：look overintensified / feel overintensified。"]}
{"word":"overintensify","summary":{"en":"Overintensify means to make something too intense or extreme—more than is appropriate.","zh":"Overintensify 指把某事强化得过度、过于强烈或极端。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something stronger, more extreme, or more intense than is appropriate or necessary; to exaggerate the intensity of something","zh":"（把某事）强化过度；使（强度、程度、情绪等）变得过于极端；夸大其强烈程度"},"examples":[{"en":"The director didn’t want to overintensify the violence, so the scene was cut shorter.","zh":"导演不想把暴力场面渲染得过度强烈，所以把那一段剪短了。"},{"en":"Sometimes news headlines overintensify fear to get more clicks.","zh":"有些新闻标题会为了更多点击而过度强化恐惧感。"},{"en":"Try not to overintensify your workouts—your body needs time to adapt.","zh":"锻炼不要过度加量——身体需要时间适应。"}]}],"synonyms":["exaggerate","overdo","overplay","overemphasize","intensify too much"],"phonetic":"/ˌoʊvərɪnˈtɛnsəˌfaɪ/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”，如 overreact（反应过度）、overthink（想太多）。因此 overintensify 通常带有“本来可以加强，但你加强得太过头”的含义。","这个词在日常口语中不算高频，更常见的替换说法有 “exaggerate,” “overdo,” “make it too intense,” “intensify too much”。"]}
{"word":"overintensifying","summary":{"en":"“Overintensifying” means exaggerating or making something too intense, often in a way that feels unnatural or misleading.","zh":"“overintensifying”指把某事过度强化/夸大，让强度过头，常显得不自然或具有误导性。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something seem stronger, more extreme, or more emotionally powerful than it really is; exaggerating intensity (present participle of “overintensify”).","zh":"把某事弄得比实际更强烈、更极端或更有情绪冲击；过度强化（“overintensify”的现在分词）。"},"examples":[{"en":"The ad is overintensifying the problem to make people feel afraid.","zh":"这则广告在过度强化问题，以制造恐惧感。"},{"en":"Try not to be overintensifying every small mistake—everyone slips sometimes.","zh":"别把每个小错误都过度放大——人人都会有失误。"}]},{"partOfSpeech":"v.","definition":{"en":"(in editing, media, or speech) increasing the intensity of sound, color, emotion, or language too much, so it feels unnatural or misleading.","zh":"（用于编辑、媒体或表达）把声音、色彩、情绪或措辞强化过头，导致不自然或有误导性。"},"examples":[{"en":"The filter is overintensifying the colors and making the photo look fake.","zh":"这个滤镜把颜色强化过头了，让照片看起来很假。"},{"en":"He was overintensifying his tone, so the discussion quickly turned into an argument.","zh":"他把语气弄得过于强硬，讨论很快变成了争吵。"}]}],"synonyms":["exaggerating","overstating","overdoing","overemphasizing","hyperbolizing"],"phonetic":"ˌoʊvərɪnˈtɛn.səˌfaɪ.ɪŋ","extraExplanation":["“over-”这个前缀表示“过度、超过需要”（如 overwork 过度工作、overreact 反应过度）。因此 overintensify 通常带有负面含义：不是“更好更强”，而是“用力过猛”。","这个词在日常口语里不算特别常见，更常见的替换说法有：exaggerating（夸大）、overstating（言过其实）、overdoing it（做过头）。在媒体/剪辑语境中，也常用 “too intense / overly intense”。"]}
{"word":"overintensities","summary":{"en":"“Overintensities” means excessively intense (too bright/strong) areas or values, especially in technical or medical images and signals.","zh":"“overintensities”指强度过高（过亮/过强）的区域或数值，常见于技术或医学影像、信号描述中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of overintensity: areas or values that are excessively intense (too bright, too strong, or too powerful), often causing distortion or loss of detail.","zh":"overintensity 的复数：指强度过高（过亮、过强、过猛）的区域或数值，常会导致失真或细节丢失。"},"examples":[{"en":"The MRI report noted several overintensities in the white matter.","zh":"MRI 报告指出白质中有几处高信号（过强信号）区域。"},{"en":"Overintensities in the image made it hard to see fine details.","zh":"图像里的过亮区域让细节很难看清。"},{"en":"We reduced the laser power to avoid overintensities in the sensor readings.","zh":"我们降低了激光功率，以避免传感器读数出现过高强度。"}]}],"synonyms":["excessive intensities","hot spots","bright spots","saturation","overexposure"],"phonetic":"/ˌoʊvərɪnˈtɛnsɪtiz/","extraExplanation":["“overintensity/overintensities”较常见于技术与医学语境（如影像学、光学、信号处理）。在医学影像里，它常对应“高信号/高亮区”（例如 MRI 上某些组织区域比周围更亮）。在摄影/显示/传感中，它可指“过曝、饱和、亮斑”等导致信息丢失的强度异常。"]}
{"word":"overintensity","summary":{"en":"Overintensity means excessive intensity—too much force, effort, emotion, or brightness.","zh":"overintensity 指“过度强烈/强度过高”，强调强到不合适甚至有害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Too much intensity; an excessive degree of force, energy, emotion, effort, or brightness that becomes unhelpful or harmful.","zh":"过度强烈；强度过高（力量、精力、情绪、努力或亮度等）以至于不再有益，甚至有害。"},"examples":[{"en":"The overintensity of the workout left him sore for days.","zh":"训练强度过高，让他酸痛了好几天。"},{"en":"Her overintensity in meetings made coworkers feel pressured.","zh":"她在会议中过于强势的劲头让同事感到压力很大。"},{"en":"Turn the screen down—its overintensity hurts my eyes.","zh":"把屏幕亮度调低——太刺眼了。"}]}],"synonyms":["excessive intensity","too much intensity","overexertion","extremeness"],"phonetic":"/ˌoʊvərɪnˈtɛnsəti/","extraExplanation":["“overintensity”不是非常常见的标准词汇，更常见的表达有“excessive intensity / too much intensity / overexertion（过度用力）”。但在健身训练、心理状态描述或技术参数（如亮度、信号强度）语境中，人们仍可能用它来强调“强到过头”。","构词上是“over-（过度）+ intensity（强度）”，因此语气通常带有负面评价：不是单纯“很强”，而是“强到不合适”。"]}
{"word":"overinterest","summary":{"en":"Overinterest usually means interest charged above a legal or agreed limit; less commonly, it means excessive interest or attention.","zh":"Overinterest 通常指超出法律或约定上限的利息；较少见时也可指对某事过度的兴趣或关注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"interest charged at a rate higher than what is allowed by law or contract; excessive interest (often connected with usury).","zh":"（金融/法律）超过法律或合同允许水平的利息；过高利息（常与高利贷相关）。"},"examples":[{"en":"The court ruled that the lender had collected overinterest and had to refund the extra amount.","zh":"法院裁定放贷方收取了过高利息，必须退还多收的部分。"},{"en":"The contract includes a clause that prohibits overinterest if a payment is late.","zh":"合同中有条款规定，即使逾期付款也不得收取过高利息。"}]},{"partOfSpeech":"n.","definition":{"en":"too much interest or attention toward something; excessive curiosity or concern (less common).","zh":"（较少见）对某事过度的兴趣或关注；过分好奇/在意。"},"examples":[{"en":"His overinterest in other people’s private lives made coworkers uncomfortable.","zh":"他对别人隐私的过度关注让同事感到不舒服。"},{"en":"Try to balance curiosity with respect, and avoid overinterest in sensitive topics.","zh":"尽量在好奇与尊重之间取得平衡，避免对敏感话题过度关注。"}]}],"synonyms":["excess interest","usurious interest","overcharge (interest)"],"phonetic":"/ˌoʊvərˈɪntrəst/","extraExplanation":["“Overinterest”在现代英语里最常见于法律或金融语境，强调“超过上限的利息”。日常生活里表达“过度关注/过分在意”，更常用 overconcern, excessive interest, too much interest 等说法。","相关概念：usury（高利贷/违法高息放贷）通常指“以法律不允许的高利率放贷”的行为或利率；overinterest 更侧重“多收的那部分利息”或“过高利息”本身。"]}
{"word":"overinterested","summary":{"en":"Overinterested means “too interested,” often in a way that feels excessive or suspicious.","zh":"overinterested 指“过于感兴趣”，常暗示兴趣过头、让人起疑或不太得体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too interested in something—often in a way that seems excessive, intense, or not entirely neutral.","zh":"对某事过于感兴趣——常带有“兴趣过头、过于热切、甚至不太客观”的含义。"},"examples":[{"en":"He seemed overinterested in my travel plans, which made me a little uncomfortable.","zh":"他对我的旅行计划显得过于感兴趣，让我有点不舒服。"},{"en":"The interviewer was overinterested in my salary history instead of my skills.","zh":"面试官对我的薪资经历过于感兴趣，而不是我的能力。"},{"en":"Try not to sound overinterested—keep your tone friendly but calm.","zh":"尽量别显得过于热切——语气友好但保持冷静。"}]}],"synonyms":["too curious","overly curious","overly interested","unduly interested","nosy"],"phonetic":"/ˌoʊvərˈɪntrəstɪd/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常程度”（如 overconfident 过于自信、overprotective 过度保护）。因此 overinterested 通常带一点负面或警惕的语气，暗示动机可能不单纯或边界感不足。","拼写上有时也会写作 over-interested（加连字符），含义相同；在正式写作中两者都能见到。"]}
{"word":"overinterestedly","summary":{"en":"“Overinterestedly” means “in an overly interested or overly curious way,” often with an intrusive or suspicious tone.","zh":"“overinterestedly”表示“过分感兴趣/过度好奇地”，常带唐突或令人起疑的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that shows too much interest or curiosity, sometimes so much that it feels intrusive or suspicious","zh":"过分感兴趣地；过度好奇地（有时会让人觉得唐突、可疑）"},"examples":[{"en":"He asked overinterestedly about her salary, which made everyone uncomfortable.","zh":"他过分感兴趣地追问她的薪水，让大家都很不舒服。"},{"en":"The reporter leaned in and listened overinterestedly, as if every detail was a secret.","zh":"记者凑近身子，过分专注地听着，好像每个细节都是秘密。"}]}],"synonyms":["too curiously","overly eagerly","intrusively","with excessive interest"],"phonetic":"ˌoʊvərˈɪntrəstɪdli","extraExplanation":["“over-”表示“过度、太……”。因此 overinterestedly 常带一点负面语气：不只是“很感兴趣”，而是“兴趣大到不合适/不礼貌/让人起疑”。","日常写作里更常用的表达包括：too curiously（太好奇地）, with excessive interest（带着过度的兴趣）, a little too eager（有点过于急切）。"]}
{"word":"overinterestedness","summary":{"en":"Overinterestedness means excessive or overly intense interest, often to an uncomfortable or inappropriate degree.","zh":"overinterestedness 指“过度的兴趣/关注”，常带有让人不适或不合时宜的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive interest or curiosity in something, often so strong that it feels intrusive, biased, or inappropriate.","zh":"过度的兴趣或好奇心；兴趣强到显得唐突、偏颇或不太合适。"},"examples":[{"en":"Her overinterestedness in his personal life made him uncomfortable.","zh":"她对他私生活的过度关注让他感到不舒服。"},{"en":"The interviewer’s overinterestedness in my salary history felt inappropriate.","zh":"面试官对我薪资历史的过度追问让人觉得不妥。"},{"en":"Try to show curiosity, but avoid overinterestedness when asking questions.","zh":"可以表现出好奇，但提问时要避免显得过度热衷。"}]}],"synonyms":["excessive interest","undue interest","overinvolvement","nosiness","intrusiveness"],"phonetic":"/ˌoʊvərˈɪntrəstədnəs/","extraExplanation":["这是由 over-（过度）+ interested（感兴趣的）+ -ness（名词后缀，表示“……的状态”）构成的抽象名词，但在日常英语里比较少见，更常用的表达是 excessive interest（过度兴趣）、undue interest（不当/过分的兴趣）、too much interest、nosiness（爱管闲事/好打听）。","语感上它常带轻微负面含义：不仅是“很感兴趣”，还暗示“热情过头、让人有压力/不舒服”，或在某些场合显得“不合适”（例如面试、隐私话题、金钱等）。"]}
{"word":"overinterference","summary":{"en":"Overinterference means interference that is too strong or too frequent—either technical disruption (signals/measurements) or excessive meddling in people’s affairs.","zh":"overinterference 指“过度的干扰/干预”：可指技术层面的信号、测量被强烈干扰，也可指对他人事务的过度插手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive interference that disrupts a process, signal, or measurement (common in technical contexts such as engineering, optics, or data collection).","zh":"（多用于技术语境）过度的干扰，导致过程、信号或测量受到破坏或失真。"},"examples":[{"en":"The sensor readings were unreliable because of overinterference from nearby radio equipment.","zh":"由于附近无线电设备的过度干扰，传感器读数不可靠。"},{"en":"Overinterference can hide the real pattern in the data.","zh":"过度干扰会掩盖数据中的真实规律。"}]},{"partOfSpeech":"n.","definition":{"en":"Too much involvement in someone else’s affairs; excessive meddling or intervention.","zh":"对他人事务的过多介入；过度插手、干预。"},"examples":[{"en":"Their overinterference in the project slowed the team down.","zh":"他们对项目的过度插手拖慢了团队进度。"},{"en":"He asked for advice, not overinterference in every decision.","zh":"他要的是建议，而不是在每个决定上都被过度干预。"}]}],"synonyms":["excessive interference","undue interference","disruption","meddling","overinvolvement"],"phonetic":"/ˌoʊvərˌɪntərˈfɪrəns/","extraExplanation":["“overinterference”不是最常见的固定词汇，更多时候是由 over-（过度）+ interference（干扰/干预）临时组合出来，用来强调“干扰/介入过头了”。在正式写作中也常改用更常见的表达，如 excessive interference（过度干扰）或 undue interference（不当干预）。"]}
{"word":"overinventoried","summary":{"en":"Overinventoried means a business has too much inventory—more stock than it can sell easily.","zh":"overinventoried 指库存过多、货品积压，超过可轻松售出的数量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having more goods or stock than a business can sell or reasonably needs; stocked in excess (too much inventory).","zh":"（企业/仓储）存货过多、库存超出需求的；积压的。"},"examples":[{"en":"The store became overinventoried after ordering too many winter coats.","zh":"这家店因为冬季外套进货太多而出现库存积压。"},{"en":"Overinventoried products are often discounted to free up space and cash.","zh":"库存过多的商品常会打折处理，以腾出空间并回笼资金。"},{"en":"The company delayed new production because it was already overinventoried.","zh":"公司因为库存已经过多而推迟了新一轮生产。"}]}],"synonyms":["overstocked","overstock","over-supplied","carrying excess inventory","glutted"],"phonetic":"/ˌoʊvərɪnˈvɛntərid/","extraExplanation":["“overinventoried”常用于商业与供应链语境，强调“库存水平高于销售速度/需求预测”。常见搭配：overinventoried retailer（库存过高的零售商）、overinventoried market（供给过剩的市场）、become/get overinventoried（变得库存积压）。","词形上可理解为 over-（过度）+ inventoried（已盘点/已入库的）。在日常口语里，人们也常用更简单的说法：overstocked（存货过多）、excess inventory（多余库存）。"]}
{"word":"overinvest","summary":{"en":"Overinvest means to put more money, time, or effort into something than is sensible, often creating extra risk or waste.","zh":"overinvest 指在某事上投入过多的金钱、时间或精力，超过合理程度，常带来更高风险或浪费。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To put too much money, time, or effort into something (more than is wise or safe), often increasing risk or reducing flexibility.","zh":"在某事上投入过多的金钱、时间或精力（超过明智或安全的程度），常导致风险增加或失去回旋余地。"},"examples":[{"en":"Many people overinvest in one stock and end up taking on more risk than they realize.","zh":"很多人把钱过度投入到一只股票上，结果承担了比自己意识到的更大风险。"},{"en":"Don’t overinvest in perfecting the first draft; you can revise it later.","zh":"别在打磨第一稿上投入过多精力；你之后还可以修改。"}]},{"partOfSpeech":"v.","definition":{"en":"(Business/finance) To invest beyond what a market, project, or company can profitably use or repay.","zh":"（商业/金融）投资过度，超过市场、项目或公司能够有效利用或盈利偿还的水平。"},"examples":[{"en":"The firm overinvested in new stores just before demand slowed.","zh":"这家公司在需求放缓之前过度投资开新店。"},{"en":"Analysts warned that the industry might overinvest during the boom years.","zh":"分析师警告说，这个行业可能在繁荣期出现过度投资。"}]}],"synonyms":["put too much into","overcommit","overspend","overallocate","sink too much into"],"phonetic":"/ˌoʊvərɪnˈvɛst/","extraExplanation":["“over-”表示“过度/过多”，加在动词前常带有“超过合理范围”的含义（如 overwork 过度工作、overspend 超支）。","在金融语境里，overinvest 常暗示“分散不足/配置失衡”（例如把大部分资金押在单一资产上），或“扩张过快”（项目和门店铺得太多）。","日常表达中也可指情感或精力上的“过度投入”（例如对一段关系、一个想法投入太多），语气通常带一点提醒或劝告。"]}
{"word":"overinvested","summary":{"en":"Overinvested means putting too much money, time, or emotion into something, often making it hard to stay objective.","zh":"overinvested 指对某事投入过多（金钱、时间或情感等），往往导致难以保持客观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having put too much money, time, emotion, or effort into something, so it’s hard to stay objective or to change direction.","zh":"对某事投入过多（金钱、时间、情感或精力），以至于难以保持客观或难以转变方向。"},"examples":[{"en":"I realized I was overinvested in the project and couldn’t accept feedback calmly.","zh":"我意识到自己对这个项目投入过多，已经很难冷静地接受反馈。"},{"en":"She’s emotionally overinvested in what her coworkers think of her.","zh":"她在情感上太在意同事对她的看法，投入过多。"},{"en":"They were overinvested in the relationship and ignored clear warning signs.","zh":"他们对这段关系投入过多，忽视了明显的警示信号。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Finance) Having invested too much money in a single asset, sector, or strategy, creating unnecessary risk.","zh":"（金融）在某一资产、行业或策略上投入资金过多，导致风险过度集中。"},"examples":[{"en":"If most of your savings are in one stock, you may be overinvested.","zh":"如果你的大部分储蓄都押在一只股票上，你可能就属于投资过度集中。"},{"en":"The fund became overinvested in tech and suffered when the sector fell.","zh":"该基金在科技股上投入过度集中，板块下跌时损失惨重。"}]}],"synonyms":["too invested","overcommitted","overattached","overexposed","heavily invested"],"phonetic":"/ˌoʊvərɪnˈvɛstɪd/","extraExplanation":["“over-”表示“过度”，而“invested”来自 invest（投资/投入）。日常英语里，overinvested 很常用来形容“情感或精力投入过多”，不一定和金钱有关。","语气通常带一点提醒或反思：投入太多会让人更难退一步、承认错误，或做出理性决定。表达更委婉时，也可以说 “too invested”。"]}
{"word":"overinvesting","summary":{"en":"Overinvesting means putting too much money or resources into an investment or project, more than is wise or safe.","zh":"Overinvesting 指在某项投资或项目上投入过多资金或资源，超过明智或安全的范围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of putting too much money, time, or effort into an investment or project, especially more than is sensible or safe","zh":"过度投资；在某项投资或项目上投入过多资金/时间/精力（通常超过合理或安全范围）"},"examples":[{"en":"Overinvesting in a single stock can be risky if the company performs poorly.","zh":"把资金过度集中投资在一只股票上，如果公司表现不好会很危险。"},{"en":"He realized he was overinvesting in his startup and not saving enough for emergencies.","zh":"他意识到自己在创业项目上投入过多，却没有为紧急情况留出足够储蓄。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “overinvest”) investing too much in something","zh":"（overinvest 的现在分词）对某事物投入过多资金/资源"},"examples":[{"en":"She is overinvesting in home renovations and may not recover the costs when she sells.","zh":"她在房屋翻新上投入过多，出售时可能收不回成本。"},{"en":"They were overinvesting in ads without checking whether the campaign was actually working.","zh":"他们在广告上投入过多，却没有检查营销活动是否真的有效。"}]}],"synonyms":["overinvestment","investing too much","over-allocating","overcommitting"],"phonetic":"/ˌoʊvərɪnˈvɛstɪŋ/","extraExplanation":["“Overinvesting”常见于个人理财、股票/基金、房地产和创业语境。它通常带有负面含义：投入超过自己的风险承受能力，或过度集中在单一资产/项目上。","学习时可以和“diversification（分散投资）”“risk tolerance（风险承受度）”“overexposure（过度暴露/持仓过重）”一起理解：过度投资往往意味着缺少分散、流动性不足，或忽视了其他重要目标（如应急金、退休储蓄）。"]}
{"word":"overinvestment","summary":{"en":"Overinvestment means putting too much money, time, or resources into something, often causing poor returns or waste.","zh":"Overinvestment 指在某事上投入过多金钱、时间或资源，常导致回报不佳或浪费。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of putting too much money, time, or resources into something, so the expected return or benefit is not worth it","zh":"过度投资；在某事上投入过多金钱、时间或资源，导致回报/收益不划算"},"examples":[{"en":"The company’s overinvestment in new factories left it short of cash when sales slowed.","zh":"公司在新工厂上的过度投资导致销售放缓时现金不足。"},{"en":"Many students regret overinvestment in activities that don’t help their main goals.","zh":"很多学生会后悔在与主要目标无关的活动上过度投入。"},{"en":"Overinvestment in real estate can create financial risk if prices fall.","zh":"在房地产上的过度投资如果遇到房价下跌，会带来财务风险。"}]},{"partOfSpeech":"n.","definition":{"en":"in economics, a situation where too much capital is invested in an industry or economy compared with demand, often leading to low profits or wasted capacity","zh":"（经济学）投资过度；相对于需求投入了过多资本，常导致利润下降或产能浪费"},"examples":[{"en":"Analysts warned that overinvestment in the sector could cause a price war.","zh":"分析师警告该行业的投资过度可能引发价格战。"},{"en":"Overinvestment sometimes results in empty buildings and underused infrastructure.","zh":"投资过度有时会造成空置楼宇和闲置基础设施。"}]}],"synonyms":["excess investment","overcapitalization","overcommitment (broader)","overspending (money-focused)"],"phonetic":"/ˌoʊvərɪnˈvɛstmənt/","extraExplanation":["词形拆解：over-（过度）+ investment（投资/投入）。它既可用于金融语境（钱的投资），也常用于更广义的“投入”（时间、精力、资源）。","常见搭配：overinvestment in + 领域（overinvestment in real estate/education/technology）；动词搭配常用 reduce/avoid/lead to（reduce overinvestment, avoid overinvestment, overinvestment leads to ...）。","近义词细微差别：overinvestment 强调“投入过多”；over-spending 强调“花钱过多”；overcommitment 更强调“承诺/承担过多责任或任务”。"]}
{"word":"overinvests","summary":{"en":"“Overinvests” means someone puts too much investment (money, time, or effort) into something, often creating extra risk or poor results.","zh":"“Overinvests”表示对某事投入（投资）过多的金钱、时间或精力，常导致额外风险或不理想的结果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to put too much money, time, or effort into something (often more than is wise or profitable)","zh":"对某事投入过多的金钱、时间或精力（往往超过明智或能获利的程度）"},"examples":[{"en":"She overinvests in trendy stocks and ends up losing money when the market drops.","zh":"她在热门股票上过度投入，市场下跌时反而亏了钱。"},{"en":"The company overinvests in new offices instead of improving its product.","zh":"公司把钱过度投入到新办公室上，而不是提升产品。"}]},{"partOfSpeech":"v.","definition":{"en":"to invest too much in a particular asset, sector, or project, creating unnecessary risk from lack of balance","zh":"在某一资产、行业或项目上投资过度，因不够分散而带来不必要的风险"},"examples":[{"en":"He overinvests in real estate, so his finances depend on one market.","zh":"他在房地产上投资过度，所以财务状况过度依赖单一市场。"},{"en":"If a fund overinvests in one industry, a downturn can hurt returns badly.","zh":"如果基金对某一行业投资过度，遇到行业下行时回报可能会大受影响。"}]}],"synonyms":["invests too much","overcommits","puts too much into","overspends (on investment)","overallocates"],"phonetic":"/ˌoʊvərɪnˈvɛsts/","extraExplanation":["“overinvests”是动词“overinvest”的第三人称单数现在时（he/she/it overinvests）。常用于理财与商业语境，含有“超出合理程度”的警示意味。"]}
{"word":"overinvolve","summary":{"en":"Overinvolve means to involve someone (or yourself) too much in a situation, often causing problems.","zh":"overinvolve 指让自己或他人过度参与某事，常导致不必要的麻烦或负面影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to involve someone too much in a situation, activity, or problem (often in a way that becomes unhelpful or intrusive)","zh":"让某人过度参与某事（常指参与过头，变得不太合适、干扰他人或适得其反）"},"examples":[{"en":"Try not to overinvolve your parents in your relationship problems.","zh":"尽量不要让父母过度介入你的感情问题。"},{"en":"The manager overinvolved herself in every detail, which slowed the team down.","zh":"那位经理把自己过度卷入每个细节，结果拖慢了团队进度。"},{"en":"Don’t overinvolve the kids in adult conflicts.","zh":"不要让孩子过度卷入大人的冲突。"}]}],"synonyms":["overcommit","interfere","meddle","be too involved","micromanage"],"phonetic":"/ˌoʊvərɪnˈvɑlv/","extraExplanation":["“overinvolve”由 over-（过度）+ involve（参与/牵涉）组成，常见写法也有连字符形式“over-involve”。语气通常带一点负面评价：不是单纯“参与”，而是“参与过头”。","常见搭配：overinvolve yourself in…（让自己过度卷入……）；overinvolve someone in…（让某人过度牵涉……）。在职场、家庭关系、亲子教育等语境里很常用。"]}
{"word":"overinvolved","summary":{"en":"“Overinvolved” describes someone who is involved too much, often in a controlling or inappropriate way.","zh":"“overinvolved”指某人介入过多，常带有控制欲或不合时宜的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too involved in something (often other people’s affairs), beyond what is appropriate or helpful.","zh":"过度介入的；插手过多的（常指对他人事务参与得不合适或不利）。"},"examples":[{"en":"Some parents become overinvolved in their children’s homework and social life.","zh":"有些父母对孩子的作业和社交生活介入过多。"},{"en":"Her manager was overinvolved, checking every tiny detail instead of trusting the team.","zh":"她的经理过度插手，事无巨细都要检查，而不是信任团队。"},{"en":"I appreciate your concern, but you’re getting a bit overinvolved in my decision.","zh":"我感谢你的关心，但你对我的决定有点介入过多了。"}]}],"synonyms":["overly involved","too involved","meddlesome","intrusive","interfering","overbearing"],"phonetic":"ˌoʊvərɪnˈvɑlvd","extraExplanation":["“over-”表示“过度/超过适当范围”，因此 overinvolved 通常带有轻微批评意味，强调“界限感不足”或“干预太多”。","常见搭配：overinvolved parent/manager/coach（过度干预的家长/经理/教练）；become/get overinvolved（变得过度介入）。在较正式或教育场景中，也可用 enmeshed（关系过度纠缠）或 overly involved（过于参与）来表达相近意思。"]}
{"word":"overinvolves","summary":{"en":"“Overinvolves” means involves too much or becomes too involved (often emotionally or personally).","zh":"“overinvolves” 指“过度卷入/过度介入”，也可指在情感或私人层面“过度投入”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to involve (someone or something) too much, or to make a situation more complicated by including too many people, details, or steps","zh":"（使）过度卷入；牵扯太多；把事情弄得过于复杂（加入太多人/细节/步骤）"},"examples":[{"en":"The manager overinvolves herself in every small decision, so the team can’t move quickly.","zh":"经理对每个小决定都过度插手，导致团队无法快速推进。"},{"en":"Don’t overinvolve your friends in this conflict—solve it directly if you can.","zh":"别把朋友过度牵扯进这场矛盾里——能的话尽量直接解决。"}]},{"partOfSpeech":"v.","definition":{"en":"to become too involved emotionally or personally (often said as “be overinvolved”)","zh":"（常用于 be overinvolved）过度投入/过度介入（情感上或私人层面）"},"examples":[{"en":"He is overinvolved in his adult children’s lives.","zh":"他对成年子女的生活过度介入。"},{"en":"It’s easy to get overinvolved at work when you care a lot about results.","zh":"当你很在意结果时，很容易在工作中过度投入。"}]}],"synonyms":["involve too much","get too involved","be too involved","overcomplicate"],"phonetic":"/ˌoʊvərɪnˈvɑlvz/","extraExplanation":["“over-” 是常见前缀，表示“过度、太多”（如 overwork 过度工作、overthink 想太多）。因此 overinvolve 的核心语气通常带一点负面：超过了合适的程度。","“overinvolve” 本身在日常口语里不算特别常见，更常见的说法有：get too involved / be too involved / involve too many people。"]}
{"word":"overinvolving","summary":{"en":"“Overinvolving” means involving someone too much, or becoming too involved in something.","zh":"“overinvolving”指介入过多、让人参与过头或牵扯过深。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving someone too much in a situation, relationship, or task; getting more involved than is helpful or appropriate.","zh":"（对某事/某人）介入过多；牵扯过深；参与得过头（以至于不合适或不利）。"},"examples":[{"en":"The manager’s overinvolving style slows decisions because everyone must approve every detail.","zh":"经理这种过度介入的管理方式会拖慢决策，因为每个细节都要所有人点头。"},{"en":"Parents can be supportive without overinvolving themselves in their children’s friendships.","zh":"父母可以支持孩子，但不必过度介入孩子的朋友圈。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of involving someone too much (the -ing form of the verb “overinvolve”).","zh":"过度让某人参与；过度牵扯（动词 overinvolve 的 -ing 形式）。"},"examples":[{"en":"Overinvolving new teammates in every meeting can overwhelm them.","zh":"让新队友过度参加每一次会议可能会让他们吃不消。"}]}],"synonyms":["too involved","overly involved","overengaged","too hands-on","meddlesome (stronger, more negative)"],"phonetic":"/ˌoʊvərɪnˈvɑlvɪŋ/","extraExplanation":["“overinvolving”在日常英语里更常作为形容词（或分词）使用，用来评价一种“参与过头”的做法，语气通常带一点批评或提醒。","相关表达可对比：involved（参与的/有关的，中性）→ overly involved / too involved（过于参与，更常见）→ overinvolving（强调“把别人也牵扯得太多/介入太深”的过程或风格）。"]}
{"word":"overiodize","summary":{"en":"Overiodize means to add too much iodine, making something excessively iodized.","zh":"overiodize 指添加过量的碘，使某物含碘过高/过度加碘。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add too much iodine to something; to make something excessively iodized","zh":"给某物添加过量的碘；使某物碘化过度（含碘过高）"},"examples":[{"en":"If salt is overiodized, it may contain more iodine than the recommended level.","zh":"如果食盐被过度加碘，它可能含有超过建议标准的碘。"},{"en":"The lab technician accidentally overiodized the sample, so the results were unreliable.","zh":"实验技术员不小心把样品过度碘化了，所以结果不可靠。"}]}],"synonyms":["over-iodize","add too much iodine","excessively iodize"],"phonetic":"/ˌoʊvɚˈaɪəˌdaɪz/","extraExplanation":["“overiodize”由 over-（过度）+ iodize（加碘/碘化）构成，常见于食品加工、公共卫生或实验室语境。","日常生活中最常见的相关概念是“iodized salt”（加碘盐）。碘对甲状腺健康很重要，但摄入过量也可能带来风险，因此会强调“recommended level/limits（建议含量/上限）”。","拼写提示：有时也会写作“over-iodize”（加连字符），意思相同。"]}
{"word":"overiodized","summary":{"en":"“Overiodized” means too much iodine has been added, especially to salt; it can also be the past form of “overiodize.”","zh":"“overiodized”表示（尤指食盐等）加碘过量；也可作“overiodize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of food, especially salt) having too much iodine added; excessively iodized.","zh":"（尤指食盐等食物）加碘过量的；过度加碘的。"},"examples":[{"en":"Some people worry that overiodized salt could cause health problems for those sensitive to iodine.","zh":"有些人担心加碘过量的食盐会让对碘敏感的人出现健康问题。"},{"en":"If the salt is overiodized, even small amounts may push your iodine intake too high.","zh":"如果食盐加碘过量，即使用量很少也可能让你的碘摄入偏高。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form/past participle of “overiodize”: to add too much iodine to something.","zh":"“overiodize”的过去式/过去分词：给某物加碘过量。"},"examples":[{"en":"The batch was overiodized by mistake and had to be discarded.","zh":"这批产品误加碘过量，只能作废处理。"}]}],"synonyms":["over-iodized","overly iodized","excess-iodinated","high-iodine"],"phonetic":"ˌoʊvɚˈaɪəˌdaɪzd","extraExplanation":["“overiodized”在实际写作中不算常见，更常见的写法是带连字符的“over-iodized”。常用于食品加工、营养标签或公共卫生讨论中。","相关概念：iodized salt（加碘盐）通常用于预防碘缺乏；但“过量”与个人摄入量、甲状腺状况等有关，语境里往往带有健康风险的担忧。"]}
{"word":"overiodizing","summary":{"en":"“Overiodizing” means adding or supplying too much iodine.","zh":"“overiodizing”指加碘过量或碘补充过度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"adding too much iodine (for example, to salt, food, or a chemical mixture); over-supplementing with iodine","zh":"加碘过量（例如给食盐、食物或化学混合物添加过多碘）；碘补充过度"},"examples":[{"en":"The lab warned that overiodizing the solution could change the reaction results.","zh":"实验室警告说，给溶液加碘过量会改变反应结果。"},{"en":"Overiodizing salt can make its iodine level higher than the recommended range.","zh":"食盐加碘过量会使碘含量高于建议范围。"}]}],"synonyms":["over-supplementing (with iodine)","adding too much iodine","excessive iodization"],"phonetic":"/ˌoʊvərˈaɪəˌdaɪzɪŋ/","extraExplanation":["“overiodizing”通常写作“over-iodizing”，来自动词“iodize”（加碘）加前缀“over-”（过度）。在公共健康语境里常见于“iodized salt（加碘盐）”，讨论碘摄入的不足或过量。","如果你本来想写的是“periodizing / periodization（分期；分期训练）”，那是体育训练/历史写作里更常见的词；可以告诉我上下文，我可以按你的真实意思解释。"]}
{"word":"overirrigate","summary":{"en":"“Overirrigate” means to irrigate with too much water.","zh":"“Overirrigate”指灌溉过多、用水超过需要。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to water land or crops with too much water; to irrigate more than is needed","zh":"过度灌溉；灌水过多（超过作物或土壤所需）"},"examples":[{"en":"If you overirrigate, plant roots may rot and yields can drop.","zh":"如果你过度灌溉，植物根部可能腐烂，产量也会下降。"},{"en":"The farmer reduced watering because the field was being overirrigated.","zh":"农民减少了浇水，因为这块地一直在过度灌溉。"}]}],"synonyms":["overwater","irrigate too much"],"phonetic":"/ˌoʊvərˈɪrəˌɡeɪt/","extraExplanation":["在农业与环境语境中，“overirrigate”常与土壤盐渍化（salinization）、养分流失（nutrient leaching）、地下水位上升与水资源浪费等问题一起出现。因为水分过多会把盐分带到土壤表层，或把肥料冲到更深处甚至进入河流地下水。","词形上是 over-（过度）+ irrigate（灌溉）。常见搭配：overirrigate a field/crops（过度灌溉田地/作物）、overirrigation（名词：过度灌溉）。"]}
{"word":"overirrigated","summary":{"en":"Overirrigated means watered too much by irrigation, often causing harm or waste.","zh":"overirrigated 指通过灌溉浇水过量，常造成作物受损或资源浪费。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Given too much water through irrigation (more than the soil or plants need), often causing problems like waterlogging or nutrient loss.","zh":"（通过灌溉）浇水过多的；灌溉过量的（超过土壤或作物需要，常导致积水、养分流失等问题）。"},"examples":[{"en":"The field was overirrigated, so the roots began to rot.","zh":"这块田灌溉过量，结果根系开始腐烂。"},{"en":"Overirrigated lawns can waste water and attract weeds.","zh":"草坪灌溉过量会浪费水，还容易招来杂草。"},{"en":"If your potted plants look yellow, they may be overirrigated.","zh":"如果盆栽植物发黄，可能是浇水过多。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describes land or a system in which irrigation has been used excessively over time.","zh":"（土地或系统）长期灌溉过度的；灌溉使用过量的。"},"examples":[{"en":"In some regions, overirrigated farmland has become salty and less productive.","zh":"在一些地区，长期灌溉过度的农田出现盐渍化，产量也下降了。"},{"en":"They redesigned the canals to reduce losses in an overirrigated district.","zh":"他们重新设计了渠道，以减少一个长期灌溉过度地区的水损失。"}]}],"synonyms":["overwatered","waterlogged (often a result)","excessively irrigated","overwatered by irrigation"],"phonetic":"/ˌoʊvərˈɪrɪˌɡeɪtɪd/","extraExplanation":["“overirrigated”通常是过去分词作形容词使用（over- + irrigate），常见于农业、园艺与节水相关话题。","过度灌溉常见后果包括：土壤缺氧导致烂根、养分（尤其氮）随水流失、土壤盐分累积（盐渍化）、以及水资源浪费。学习时可与“overwatered（浇水过多）”对比：overirrigated更偏向“灌溉系统/农田层面”，overwatered更口语、适用于家养植物。"]}
{"word":"overirrigating","summary":{"en":"“Overirrigating” means watering land or plants too much, often causing waste and plant/soil problems.","zh":"“overirrigating”指对土地或植物浇水/灌溉过多，常造成浪费并引发植物或土壤问题。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"watering land or plants too much (more than they need), especially in farming or gardening, often causing problems like water waste or damaged roots.","zh":"（对土地或植物）过度灌溉/浇水，超过其需要量，常导致浪费水资源或伤害根系等问题（多用于农业或园艺）。"},"examples":[{"en":"Overirrigating can wash nutrients out of the soil and weaken plants.","zh":"过度灌溉会把土壤里的养分冲走，使植物变弱。"},{"en":"They realized they were overirrigating the field because the ground stayed muddy for days.","zh":"他们发现田里过度灌溉了，因为地面连续几天都很泥泞。"},{"en":"To avoid overirrigating, check the soil moisture before turning on the sprinklers.","zh":"为避免过度浇水，开喷灌前先检查土壤湿度。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or practice of applying too much irrigation water.","zh":"过度灌溉这一行为/做法。"},"examples":[{"en":"Overirrigating is a common mistake for new gardeners.","zh":"过度浇水是新手园丁常犯的错误。"},{"en":"The report links overirrigating to higher costs and lower crop quality.","zh":"报告指出，过度灌溉会导致成本上升、作物品质下降。"}]}],"synonyms":["overwatering","excess irrigation","watering too much","overapplying water"],"phonetic":"/ˌoʊvərˈɪrəˌɡeɪtɪŋ/","extraExplanation":["“over-”表示“过度、超过正常/需要的程度”（如 overwork 过度工作、overeat 吃太多）。因此 overirrigate = irrigate（灌溉）+ over-（过度）。","农业语境里，过度灌溉常见后果包括：根部缺氧、病害增加、土壤养分淋失；在一些地区还可能加剧土壤盐渍化（盐分在地表或根区累积）。","日常写作中也常用更口语的说法：water too much / overwater（多用于盆栽或园艺）。"]}
{"word":"overirrigation","summary":{"en":"Overirrigation means watering land or crops too much.","zh":"overirrigation 指对土地或作物“浇水/灌溉过量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or practice of applying too much water to crops, gardens, or land, more than plants or soil can use or drain properly.","zh":"对农作物、花园或土地灌溉过量；浇水太多，超过植物或土壤能吸收或排出的程度。"},"examples":[{"en":"Overirrigation can wash nutrients out of the soil and weaken plant growth.","zh":"过度灌溉会把土壤里的养分冲走，反而让植物长得更弱。"},{"en":"The farmer reduced overirrigation by using drip lines instead of flooding the field.","zh":"农民用滴灌代替漫灌，从而减少了过度灌溉。"},{"en":"Signs of overirrigation include yellow leaves and constantly soggy soil.","zh":"过度灌溉的迹象包括叶子发黄以及土壤长期湿烂。"}]}],"synonyms":["excess irrigation","overwatering"],"phonetic":"/ˌoʊvərˌɪrɪˈɡeɪʃən/","extraExplanation":["“over-”是常见前缀，表示“过度、超过需要”（如: overeat 暴饮暴食，overwork 过度工作）。因此 overirrigation 很直观地表示“灌溉过量”。","在农业与环境语境中，overirrigation 常与地下水位上升、土壤盐渍化（salinization）、养分流失（nutrient leaching）等问题一起出现。学习时可以把它当作一个“原因词”，后面经常接“导致/引起”的结果。"]}
{"word":"overissue","summary":{"en":"Overissue means issuing too much—especially currency or shares—or the excessive amount issued.","zh":"Overissue 指（尤指货币或股票）超额发行，或指超额发行的数量。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to issue (especially money, shares, or documents) in too great an amount; to put more into circulation than is safe or allowed","zh":"（尤指货币、股票或票据）超额发行；发行过量（超过安全或规定范围）"},"examples":[{"en":"The central bank promised it would not overissue currency during the crisis.","zh":"中央银行承诺在危机期间不会超额发行货币。"},{"en":"If a company overissues shares, existing shareholders may be diluted.","zh":"如果公司超额发行股票，现有股东的持股比例可能会被稀释。"}]},{"partOfSpeech":"n.","definition":{"en":"an excessive issue or amount issued (especially of money or securities)","zh":"（尤指货币或证券的）超额发行；发行过量"},"examples":[{"en":"Critics blamed inflation on the overissue of banknotes.","zh":"批评者把通货膨胀归咎于纸币的超额发行。"}]}],"synonyms":["overprint","overproduce","excess issuance","oversupply"],"phonetic":"/ˌoʊvərˈɪʃuː/","extraExplanation":["“over-”表示“过度/过多”，“issue”在金融语境里常指“发行/发放（货币、证券）”。因此 overissue 多见于经济史、货币政策或公司融资讨论中。","在英语经济写作里，overissue 常带有负面含义：货币 overissue 可能引发通胀或信心下降；股票 overissue 常关联“股权稀释（dilution）”。"]}
{"word":"overissued","summary":{"en":"“Overissued” means issued in excessive quantity (more than needed or allowed).","zh":"“overissued”指（发行/发放）数量过多，超过需要或规定的限度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Issued in too large a quantity; made available more than needed or allowed.","zh":"（发行、发放）过量的；超额发出的。"},"examples":[{"en":"The airline had to offer vouchers because the flight was overissued with tickets.","zh":"由于机票超卖（超额发放），航空公司不得不提供代金券。"},{"en":"Overissued coupons can hurt a brand’s image and profits.","zh":"过量发放优惠券会损害品牌形象并影响利润。"}]},{"partOfSpeech":"vt.","definition":{"en":"To issue too much of something (such as tickets, shares, bonds, or documents).","zh":"过量发行；超额发放（如机票、股票、债券或文件）。"},"examples":[{"en":"The company overissued shares and later had to correct the record.","zh":"公司超额发行了股票，后来不得不更正记录。"},{"en":"They were accused of overissuing permits without proper review.","zh":"他们被指控在未充分审查的情况下超额发放许可证。"}]}],"synonyms":["excessively issued","overdistributed","issued in excess","oversupplied"],"phonetic":"/ˌoʊvərˈɪʃuːd/","extraExplanation":["“overissued”常见于商业与金融语境，尤其指“超额发行/超额配售（overallotment）”或“超卖（oversell）”带来的结果，如机票、门票、股票、债券等发放数量超过实际可兑现的数量。","在更正式或更常用的表达中，人们往往会说“overissued tickets/shares”或直接用更常见的词：tickets 常说“oversold”，股票/债券常说“overissued/overissued securities”或“issued in excess”。"]}
{"word":"overissues","summary":{"en":"“Overissues” means excess issuance—issuing more shares/tickets/etc. than allowed or needed; it can also be the verb form “to overissue.”","zh":"“Overissues”指“超额发行”，即发行股票/票券等超过许可或需求；也可作动词，表示“超量发行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(finance) An amount of stocks, bonds, tickets, etc. issued beyond what is authorized, available, or needed; excess issuance.","zh":"（金融等）超额发行；超出授权、供应或需求的发行量。"},"examples":[{"en":"The regulator investigated the company’s overissues of shares.","zh":"监管机构调查了这家公司超额发行股票的行为。"},{"en":"Overissues can dilute existing shareholders’ value.","zh":"超额发行可能会稀释现有股东的价值。"}]},{"partOfSpeech":"v.","definition":{"en":"To issue too many (shares, bonds, tickets, etc.), more than allowed or required.","zh":"超量发行（股票、债券、票券等）；发行数量超过许可或需要。"},"examples":[{"en":"The firm accidentally overissued shares during the offering.","zh":"该公司在发行过程中不小心超量发行了股票。"},{"en":"Airlines sometimes overissue tickets to account for no-shows.","zh":"航空公司有时会超量出票，以应对旅客爽约未到。"}]}],"synonyms":["excess issuance","overissuance","oversupply (in context)","oversell (tickets, similar idea)"],"phonetic":"ˌoʊvərˈɪʃuː","extraExplanation":["“overissues”常见于金融与合规语境，尤其指公司“超出授权股本（authorized shares）而发行”的情况，可能涉及法律责任与信息披露问题。","在日常生活中更常见的对应说法是“oversell / overbook”（如航班超售、活动超额售票）；“overissue”则更偏正式、书面，常见于证券、债券、票据等“发行（issue）”场景。"]}
{"word":"overissuing","summary":{"en":"Overissuing means issuing too much of something, especially money or securities.","zh":"Overissuing 指超额发行，尤指货币或证券等发行过多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of issuing too much of something (especially money, shares, tickets, or official documents), so that supply becomes excessive and may cause problems","zh":"（尤指货币、股票、票券或官方文件的）超额发行；发行过多，导致供给过剩并可能引发问题"},"examples":[{"en":"Overissuing currency can lead to inflation and loss of public trust.","zh":"货币超额发行可能导致通货膨胀并削弱公众信任。"},{"en":"The company was accused of overissuing shares without proper disclosure.","zh":"该公司被指控在未充分披露的情况下超额发行股票。"},{"en":"To prevent overissuing tickets, the venue uses a digital check-in system.","zh":"为防止门票超额发放，场馆使用数字化检票系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"issuing too much of something; producing an excessive amount through official distribution","zh":"超额发行的；通过官方发放或发行而产生过量的"},"examples":[{"en":"The regulator warned about overissuing practices in the bond market.","zh":"监管机构警告债券市场存在超额发行的做法。"},{"en":"Overissuing permits can overwhelm local services.","zh":"许可证发放过量会使本地公共服务不堪重负。"}]}],"synonyms":["excessive issuance","overissue","overproduction (in context)","overprinting (currency context)"],"phonetic":"/ˌoʊvərˈɪʃuɪŋ/","extraExplanation":["“overissuing”常见于金融与监管语境：例如“overissuing currency（货币超发）”可能带来通胀；“overissuing shares（超额发行股票）”可能稀释原股东权益并引发合规问题。","词形上，它来自动词“overissue”（over- 表“过度” + issue 表“发行/发放”）。在新闻或报告里更常看到名词短语：the overissuing of bonds/shares/currency。"]}
{"word":"overitching","summary":{"en":"“Overitching” means itching excessively, but it’s uncommon; “really/severely itchy” is more natural.","zh":"“overitching”指“过度发痒”，但不常见；更自然的说法是“really/severely itchy（很痒/严重瘙痒）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not very common) itching too much; having an unusually strong or excessive itch.","zh":"（不太常见）过度发痒；痒得异常厉害、超过正常程度。"},"examples":[{"en":"My skin is overitching after I used that new soap.","zh":"我用了那款新肥皂之后，皮肤痒得厉害（过度发痒）。"},{"en":"If the rash is overitching, stop scratching and talk to a doctor.","zh":"如果皮疹痒得很厉害，别再抓挠，和医生咨询一下。"}]},{"partOfSpeech":"n.","definition":{"en":"(Gerund/verb form) the act of itching excessively (often used informally or in personal writing).","zh":"（动名词/动词形式）过度发痒；一直痒得很厉害（多见于非正式表达或个人描述）。"},"examples":[{"en":"The overitching kept me awake last night.","zh":"昨晚那种一直很痒的感觉让我睡不着。"}]}],"synonyms":["really itchy","very itchy","severely itchy","intensely itchy","itching a lot"],"phonetic":"/ˌoʊvərˈɪtʃɪŋ/","extraExplanation":["“overitching”不是非常标准或常见的词。日常英语里更自然的说法通常是：\n- “My skin is really itchy.”（我皮肤很痒。）\n- “I’m itching a lot.”（我一直很痒。）\n- “severe itching” / “intense itching”（严重/强烈瘙痒，偏医疗表达）\n- 也常用“over-scratching”（抓得太多）来强调“挠太狠/挠过头”，而不是“痒过头”。","如果你原本想表达的是“overreaching”（做得太过分/野心太大/伸得太远），请告诉我上下文句子，我可以帮你确认并改成最地道的表达。"]}

