{"word":"overyear","summary":{"en":"“overyear” isn’t standard; use “over a year/over the years” or “year over year (YoY).”","zh":"“overyear”不是标准写法；一般用“over a year/over the years”或“year over year（同比）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling or incorrect joining of the phrase “over a year / over the year(s)” (meaning during a period of time) or the business phrase “year over year” (YoY, meaning compared with the same time last year).","zh":"不是标准英语单词。通常是把短语写连了：常见应为“over a year / over the year(s)”（表示在一段时间内、这些年里），或商业用语“year over year”（同比，和去年同一时期相比）。"},"examples":[{"en":"Incorrect: I have worked here for overyear.","zh":"错误：I have worked here for overyear."},{"en":"Correct: I have worked here for over a year.","zh":"正确：I have worked here for over a year（我在这里工作一年多了）。"},{"en":"Sales increased year over year.","zh":"Sales increased year over year（销售额同比增长）。"}]}],"synonyms":["over a year","over the years","year over year (YoY)"],"phonetic":"/ˈoʊvər jɪr/","extraExplanation":["“overyear”几乎不会在正规写作中出现；更自然的表达通常是：\n- over a year = 超过一年（时间长度）\n- over the year / over the years = 在这一年里 / 这些年里（时间范围）\n- year over year (YoY) = 同比（常用于商业、数据分析）\n\n如果你告诉我你想表达的中文意思（例如“这一年里”还是“同比”），我可以帮你改成最地道的一句英文。"]}
{"word":"overyoung","summary":{"en":"Overyoung means “too young” for something, or “younger-looking than expected.”","zh":"overyoung 指“（对某事而言）太年轻”，也可指“看起来比实际更年轻”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too young for a particular role, activity, or situation; younger than is suitable or expected.","zh":"（就某个角色、活动或情境而言）太年轻；年纪小得不合适或不符合预期。"},"examples":[{"en":"He looks overyoung to be the company’s CEO.","zh":"他看起来太年轻，不像是这家公司的首席执行官。"},{"en":"The actor was overyoung for the part, so the director chose someone older.","zh":"这位演员对这个角色来说太年轻，所以导演选了更年长的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a surprisingly youthful appearance; younger-looking than one’s real age.","zh":"显得格外年轻；看起来比实际年龄更小。"},"examples":[{"en":"She’s 35, but she’s always been overyoung in photos.","zh":"她35岁了，但照片里总显得特别年轻。"},{"en":"His overyoung face made people guess he was still in college.","zh":"他那张过于年轻的脸让人以为他还在上大学。"}]}],"synonyms":["too young","underage","youthful-looking","young-looking"],"phonetic":"/ˌoʊvərˈjʌŋ/","extraExplanation":["“overyoung”在实际写作中更常见的拼写是“over-young”（带连字符），尤其在英式或较正式的文字里。口语中人们也常直接说“too young”。","这个词带有“与常规期待不符”的语气：可能是担心资格不足（如“太年轻不适合”），也可能只是描述外表“显年轻”。注意根据语境判断是否有轻微的评价色彩。"]}
{"word":"overyouthful","summary":{"en":"Overlyouthful means “too youthful,” often suggesting immaturity or an inappropriately young style.","zh":"overyouthful 指“过于年轻/过于稚嫩”，常带有不够成熟或风格不合时宜的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too young-looking or behaving in a way that seems younger than is appropriate (often implying immaturity or trying too hard to seem young).","zh":"过于年轻的；显得太稚嫩的（常含“不够成熟”或“刻意装年轻”的意味）。"},"examples":[{"en":"The ad’s tone felt overlyouthful for a product aimed at middle-aged customers.","zh":"这则广告的语气对面向中年顾客的产品来说显得过于年轻化。"},{"en":"His overlyouthful jokes made the meeting feel less professional.","zh":"他那些过于幼稚的玩笑让会议显得不太专业。"},{"en":"The actor’s styling was overlyouthful, distracting from the serious role.","zh":"那位演员的造型过于年轻化，反而分散了观众对严肃角色的注意力。"}]}],"synonyms":["too youthful","juvenile","immature","childish","young-looking"],"phonetic":"ˌoʊvərˈjuθfəl","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过适当程度”。所以 overlyouthful = over（过度）+ youthful（年轻的/充满青春气息的）。","这个词不算高频，更常见的替代说法有：“too youthful”“a bit juvenile”“trying too hard to look young”。语气多为轻微批评或不太赞同。"]}

