{"word":"overhail","summary":{"en":"Overhail is a rare/old verb meaning “to overtake; to catch up with,” sometimes used in nautical contexts for hailing a ship you are coming up on.","zh":"Overhail是一个较旧且少见的动词，主要指“追上；赶上”，在航海语境中也可指接近前船时向其呼喊/示意。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to catch up with and reach someone or something; to overtake (older/rare usage).","zh":"赶上；追上；超过（较旧/少见用法）。"},"examples":[{"en":"The patrol ship slowly overhailed the smaller boat before dusk.","zh":"巡逻船在黄昏前慢慢追上了那艘较小的船。"},{"en":"If we keep this pace, we’ll overhail the lead runner soon.","zh":"如果保持这个速度，我们很快就会追上领跑者。"}]},{"partOfSpeech":"v.","definition":{"en":"(nautical, rare) to hail or signal a ship that is ahead of you or that you are coming up on.","zh":"（航海用语，少见）向前方船只呼喊/发信号（通常是你正在接近或追赶时）。"},"examples":[{"en":"They overhailed the vessel ahead to ask for directions.","zh":"他们向前方那艘船呼喊，询问方向。"}]}],"synonyms":["overtake","catch up (with)","overhaul (sense: catch up)"],"phonetic":"/ˌoʊvərˈheɪl/","extraExplanation":["“overhail”在现代英语中非常少见，很多学习者会把它和更常用的“overhaul”（检修；彻底检查；赶上）混淆。实际写作/口语里，表示“赶上”通常用catch up (with)、overtake、overhaul（在“赶上”的意思上较书面）。","词源上可理解为over-（越过/赶上）+ hail（呼喊/招呼）。因此在航海语境里也可能带有“赶上后招呼前船”的感觉。"]}
{"word":"overhair","summary":{"en":"“Overhair” is usually a misspelling; the intended word is “overhear,” meaning to hear something accidentally.","zh":"“overhair”通常是拼写错误；你要找的多半是“overhear”，意思是“无意中听到”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“overhair” is not a standard English word in common use; it is most often a misspelling of “overhear.”","zh":"“overhair”不是常见或标准的英语单词；它最常见的情况是把“overhear（无意中听到）”拼错了。"},"examples":[{"en":"I think you mean “overhear,” not “overhair.”","zh":"我觉得你想写的是“overhear”，不是“overhair”。"}]},{"partOfSpeech":"v.","definition":{"en":"to hear something by chance, without the speaker intending you to hear it","zh":"无意中听到（说话者并不打算让你听见）"},"examples":[{"en":"I overheard them talking about the test in the hallway.","zh":"我在走廊里无意中听到他们在谈论考试。"},{"en":"She overheard her name and stopped to listen.","zh":"她无意中听到自己的名字，就停下来听。"},{"en":"You weren’t meant to overhear that conversation.","zh":"那段对话本来不是要让你听见的。"}]}],"synonyms":["catch (part of)","hear by chance","eavesdrop (often intentional)"],"phonetic":"/ˌoʊvərˈhɪr/","extraExplanation":["“overhear”里的 over- 表示“在旁边/意外地”，不是“超过”的意思；所以它强调“偶然听见”，而不是“听得更多”。","常见搭配：overhear + 人/内容（overhear someone, overhear a conversation）。","容易混淆的词：overhear（无意听到） vs. listen (to)（主动听） vs. hear（听见这个结果，不一定是有意）。"]}
{"word":"overhale","summary":{"en":"“overhale” is usually a misspelling of “overhaul,” meaning a thorough repair or major improvement (verb) or the repair/improvement itself (noun).","zh":"“overhale”通常是“overhaul”的拼写错误，意思是“彻底检修/全面改造”（动词）或“（一次）大修/全面改造”（名词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely intended: “overhaul”) to examine, repair, and improve something thoroughly; to make major changes to make it work better.","zh":"（多半是想写：overhaul）彻底检查、修理并改进；进行大幅度改革以让其更好用/更有效。"},"examples":[{"en":"The company plans to overhaul its customer service system this year.","zh":"公司计划今年彻底改造客户服务系统。"},{"en":"We need to overhaul the engine before the long trip.","zh":"长途旅行前我们需要把发动机彻底检修一遍。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “overhaul”) a thorough repair or major improvement; a complete revision.","zh":"（多半是想写：overhaul）大修；全面改造；彻底的修订/更新。"},"examples":[{"en":"The website got a full overhaul, and it’s much easier to use now.","zh":"网站进行了全面改版，现在更好用了。"},{"en":"The hospital’s safety rules need an overhaul.","zh":"医院的安全规定需要全面整顿。"}]}],"synonyms":["revamp","renovate","rebuild","refurbish","repair","reform","rework"],"phonetic":"/ˌoʊvərˈhɔl/","extraExplanation":["“overhale”并不是常见的标准英语拼写，最常见的正确词是“overhaul”。在写作和邮件里，“overhale”通常会被当作拼写错误。","“overhaul”最早与航海有关：有“追上并检查（船只）”的含义，后来引申为“彻底检查/大修/全面改造”。"]}
{"word":"overhalf","summary":{"en":"“Over half” means more than 50% of something.","zh":"“over half”表示某事物的比例或数量超过50%，即“超过一半”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"more than half (over 50%) of a group, amount, or total","zh":"超过一半（多于50%）的（人/数量/总额）"},"examples":[{"en":"Over half of the students voted for the new schedule.","zh":"超过一半的学生投票支持新的时间表。"},{"en":"The project is over half finished.","zh":"这个项目已经完成了一半以上。"},{"en":"She spent over half her salary on rent.","zh":"她把工资的一半以上花在房租上了。"}]}],"synonyms":["more than half","the majority (of)","over 50%"],"phonetic":"/ˌoʊvɚ ˈhæf/","extraExplanation":["“overhalf”通常不写成一个词，标准写法是两个词：over half。","口语和写作中都很常见：over half of + 名词（如 over half of the people），或 over half + 过去分词/形容词（如 over half finished）。","在正式场合，如果强调“刚好一半”，用 half；如果强调“多于一半”，用 over half / more than half。"]}
{"word":"overhand","summary":{"en":"Overhand describes doing something (especially throwing or serving) with the arm moving above the shoulder; it can also mean an overhand throw itself.","zh":"overhand 指“上手的/以上手方式的”（多用于投掷或发球）；也可指一次上手投掷（或上手击球/发球）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a throw, stroke, or serve) done with the hand or arm moving above the shoulder, with the palm facing forward or downward at release.","zh":"（投掷、击球或发球）手或手臂从肩膀上方挥动完成的；（出手时）掌心向前或向下的。"},"examples":[{"en":"He threw the ball overhand to reach the catcher quickly.","zh":"他用上手投球，快速把球传到接球手那里。"},{"en":"In tennis, an overhand serve is common in competitive play.","zh":"在网球里，上手发球在比赛中很常见。"},{"en":"Try an overhand stroke for more power.","zh":"想要更大力量，可以试试上手击球。"}]},{"partOfSpeech":"adv.","definition":{"en":"With an overhand motion (arm moving above the shoulder).","zh":"以上手方式；手臂从肩膀上方挥动地。"},"examples":[{"en":"She tossed the rope overhand.","zh":"她用上手的方式把绳子抛了出去。"},{"en":"He served overhand and won the point.","zh":"他以上手发球得分。"}]},{"partOfSpeech":"n.","definition":{"en":"An overhand throw or stroke (especially in baseball, tennis, or volleyball).","zh":"上手投掷（或上手击球/发球）（尤用于棒球、网球或排球）。"},"examples":[{"en":"His overhand is faster than his underhand.","zh":"他的上手投得比下手更快。"},{"en":"Practice your overhand to improve accuracy.","zh":"练习你的上手投掷来提高准确性。"}]}],"synonyms":["overarm","overhead (in some sports)"],"phonetic":"/ˌoʊvɚˈhænd/","extraExplanation":["“overhand”常与“underhand（下手的）”对比：overhand通常更有力量、速度更快；underhand往往更稳定、更容易控制（例如保龄球、垒球的某些投法）。","在不同运动里细节略有差异：棒球里常说 overhand pitch（上手投球）；排球里更常说 overhand serve（上手发球）或 overhead serve（头上发球，意思接近）。"]}
{"word":"overhanded","summary":{"en":"Overhanded means done with the hand/arm above the shoulder (sports), and figuratively it can mean overly forceful or controlling.","zh":"Overhanded 指上手（过肩）动作；也可比喻为过于强硬、爱控制人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a throw, stroke, or movement) done with the hand or arm coming above the shoulder (an “overhand” motion).","zh":"（投掷、击球或动作）手或手臂从肩膀上方挥动完成的；上手的（过肩动作）。"},"examples":[{"en":"She threw the ball overhanded to reach the catcher quickly.","zh":"她用上手投球，这样能更快把球传到接球手那里。"},{"en":"In tennis, many players use an overhanded serve.","zh":"在网球里，很多选手用上手发球。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Too forceful or controlling; heavy-handed.","zh":"（比喻）过于强硬或爱控制人的；粗暴专断的。"},"examples":[{"en":"The manager’s overhanded style made the team feel tense.","zh":"经理强硬专断的作风让团队很紧张。"},{"en":"Critics said the new rules were overhanded and unnecessary.","zh":"批评者说这些新规定太强硬，而且没必要。"}]}],"synonyms":["overhand","overarm","heavy-handed","overbearing","forceful"],"phonetic":"ˌoʊvərˈhændɪd","extraExplanation":["“overhanded”来自“overhand”（上手、过肩动作），最常见于运动语境（棒球投球、网球发球等）。在日常写作里也可引申为“强势压人”，但更常见的同义表达是“heavy-handed / overbearing”。"]}
{"word":"overhandicap","summary":{"en":"Overhandicap means to give someone too much handicap (too big an advantage), especially in golf or handicap-based competitions.","zh":"overhandicap 指“让分/差点给得过多”，使某人获得过大的优势；常见于高尔夫或有差点制度的比赛。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to give someone too big an advantage (a handicap) in a competition, making the contest unfair or unbalanced","zh":"（比赛中）给某人过大的让分/优势，导致比赛不公平或失衡"},"examples":[{"en":"The tournament was overhandicapped, so some players had an easy win even with average scores.","zh":"这场比赛的让分设得过头了，所以有些选手即使成绩一般也很容易赢。"},{"en":"If you overhandicap beginners, they may not learn good habits because they win too easily.","zh":"如果你给新手让分让得太多，他们可能因为太容易赢而学不到好习惯。"}]},{"partOfSpeech":"v.","definition":{"en":"(in golf or similar systems) to set a handicap higher than a player’s real ability, overstating how much help they need","zh":"（尤用于高尔夫等计分体系）把某人的差点/让分设得高于其真实水平，高估了他需要的补助"},"examples":[{"en":"He was overhandicapped by two strokes, so his net score looked unusually strong.","zh":"他的差点被多给了两杆，所以净杆成绩看起来异常漂亮。"},{"en":"The committee reviewed the records to make sure no one was overhandicapped.","zh":"委员会审查了记录，以确保没有人的差点被设得过高。"}]}],"synonyms":["handicap too much","give too large a handicap","overcompensate (in a handicap)"],"phonetic":"/ˌoʊvərˈhændikæp/","extraExplanation":["这个词比较少见，更多时候人们会说 “give too large a handicap / handicap too much”。在英式或美式体育语境里，handicap 指“为了公平而给弱者的补偿/让分/差点”，over- 表示“过度”。","常见相关词：overcompensate（补偿过度）、unfair advantage（不公平的优势）、handicap system（差点/让分制度）。"]}
{"word":"overhandicapped","summary":{"en":"“Overhandicapped” means excessively disadvantaged or given an overly severe handicap/penalty, especially in competitions.","zh":"“overhandicapped”指被过度置于不利地位，或（尤指比赛中）被设置了过重的让分/负重/处罚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too many disadvantages or limitations; excessively handicapped (physically, socially, legally, etc.).","zh":"（因限制、劣势等）被“过度”不利对待的；负担过重、受限过多的。"},"examples":[{"en":"Without ramps and accessible buses, wheelchair users can feel overhandicapped in daily life.","zh":"如果没有坡道和无障碍公交，轮椅使用者在日常生活中会感觉被过度限制。"},{"en":"He worried the new rules would leave small businesses overhandicapped compared with big companies.","zh":"他担心新规会让小企业相较大公司处于过度不利的地位。"}]},{"partOfSpeech":"adj.","definition":{"en":"Given a handicap that is too severe (especially in sports or competitions); over-penalized.","zh":"（尤指比赛/竞技中）被设置了过重的让分/负重/处罚；被“过度加码” handicap 的。"},"examples":[{"en":"Some fans felt the team was overhandicapped by the new points system.","zh":"一些球迷觉得新积分制度让这支队伍被过度“让分”了。"},{"en":"In that race, the horse looked overhandicapped and couldn’t keep up.","zh":"在那场赛马中，这匹马似乎被分配了过重的负担，跟不上节奏。"}]}],"synonyms":["overly disadvantaged","unduly burdened","over-penalized","too heavily handicapped"],"phonetic":"/ˌoʊvərˈhændikæpt/","extraExplanation":["“overhandicapped”并不是常见词，更常见的表达是 “overly disadvantaged / too heavily burdened / unfairly penalized”。在体育语境里，handicap 指为平衡实力而设置的让分、负重或分级；overhandicapped 就强调“给得太重/太严”。","构词：over-（过度）+ handicapped（受限的/被设置让分的）。书面或评论性语气较强，日常口语中通常会改用更简单的说法。"]}
{"word":"overhandicapping","summary":{"en":"Overhandicapping means giving an excessively large handicap or underestimating someone’s true strength, making the adjustment unfair or inaccurate.","zh":"Overhandicapping 指“让分/让步给过头”或低估对手真实实力，导致调整不公平或不准确。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in sports, games, or betting) the act of giving someone too large a handicap, or judging a competitor as weaker than they really are, so the adjustment becomes unfair or inaccurate.","zh":"（尤指体育比赛、游戏或博彩中）“让分/让球/让步”给得过多，或把对手判断得比实际更弱，导致调整过头、不公平或不准确。"},"examples":[{"en":"The coach worried that overhandicapping the stronger team would make the match feel fake.","zh":"教练担心把强队“让得太多”会让比赛显得不真实。"},{"en":"In betting markets, overhandicapping can create odds that don’t match the teams’ real strength.","zh":"在博彩市场里，让分过多会造成赔率与球队真实实力不匹配。"}]},{"partOfSpeech":"v.","definition":{"en":"the action of overhandicap; making an adjustment (like extra points, a head start, or a rating penalty) that is too large.","zh":"overhandicap 的进行式/动名词：把补偿性调整（如加分、让起步、评级扣分）做得过大。"},"examples":[{"en":"They are overhandicapping the new player by giving her too many bonus points.","zh":"他们给新玩家加了太多奖励分，属于让步过头。"},{"en":"He admitted he was overhandicapping his opponent after watching the replay.","zh":"看了回放后他承认自己把对手想得太弱，判断过头了。"}]}],"synonyms":["giving too big a handicap","setting the handicap too high","overestimating the handicap","overadjusting"],"phonetic":"/ˌoʊvərˈhændɪˌkæpɪŋ/","extraExplanation":["“handicap”在不同语境里意思不太一样：在比赛中常指“让分/让球/让步”（为了让双方更势均力敌）；在高尔夫等项目里也可指“差点/等级评分”。“overhandicapping”就是这种调整做过头。","这个词不算特别常见，更常见的表达有：“give too big a handicap / set the handicap too high / overestimate the handicap”。"]}
{"word":"overhanding","summary":{"en":"Overhanding is the act of doing something in an overhand motion (especially throwing/serving) or sewing with an overhand stitch.","zh":"Overhanding 指用上手动作进行投掷/发球等，或指用包缝针（锁边针法）缝合。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of throwing, hitting, or serving with the hand or arm coming over the top (an overhand motion).","zh":"用手或手臂从上方挥下的动作来投掷、击打或发球（上手动作）。"},"examples":[{"en":"He practiced overhanding the ball to improve his baseball throw.","zh":"他练习用上手动作投球，以提高棒球的投掷能力。"},{"en":"In volleyball class, we worked on overhanding the serve.","zh":"在排球课上，我们练习上手发球的动作。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of sewing with an overhand stitch (stitching over the edge to join or finish fabric).","zh":"用包缝针（锁边/沿布边绕过去的针法）进行缝合的动作。"},"examples":[{"en":"She was overhanding the edge of the fabric to stop it from fraying.","zh":"她用包缝针缝布边，防止布料脱线。"},{"en":"After cutting the patch, he started overhanding it onto the jacket.","zh":"剪好补丁后，他开始用包缝针把它缝到夹克上。"}]}],"synonyms":["throwing overhand","overhand throw","overhand stitching","overcasting"],"phonetic":"/ˌoʊvərˈhændɪŋ/","extraExplanation":["“Overhanding”通常是动词“overhand”的现在分词/动名词形式。体育语境里更常说“an overhand throw/serve”（上手投/发）而不是单独用“overhanding”。","缝纫语境中的“overhand stitch”中文常译为“包缝针/锁边针/绕缝针”（不同地区叫法略有差异），核心概念都是“沿边把两片布连起来或把边缘收住”。"]}
{"word":"overhandle","summary":{"en":"Overhandle means to handle or control something too much, usually causing trouble or worse results.","zh":"Overhandle 指“过度处理/过度操控”，通常会带来麻烦或更糟的结果。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to handle something too much or too forcefully, often causing problems (for example, damaging it, upsetting someone, or making a situation worse)","zh":"过度处理；操之过急（常导致弄坏东西、惹恼别人或把事情搞砸）"},"examples":[{"en":"If you overhandle the dough, the bread can turn out tough.","zh":"如果你把面团揉得太过头，面包可能会变得很硬。"},{"en":"The manager overhandled the complaint and made the customer even angrier.","zh":"经理把投诉处理得过火，反而让顾客更生气。"},{"en":"Try not to overhandle the negotiations—keep it simple and respectful.","zh":"谈判别处理得太用力——尽量简单、尊重。"}]},{"partOfSpeech":"vt.","definition":{"en":"(especially about a vehicle/aircraft) to control in an excessive way, making it unstable or harder to steer","zh":"（尤指车辆/飞机）操纵过度；用力过猛导致不稳或更难控制"},"examples":[{"en":"He overhandled the car on the icy road and it started to skid.","zh":"他在结冰的路面上把车打得太猛，车开始打滑。"},{"en":"New pilots sometimes overhandle the controls during landing.","zh":"新飞行员在降落时有时会对操纵杆用力过度。"}]}],"synonyms":["overmanage","overcontrol","mishandle","fumble","overwork"],"phonetic":"/ˌoʊvərˈhændəl/","extraExplanation":["“over-”是常见前缀，表示“过度、超过必要程度”。所以 overhandle 的核心意思就是“handle（处理/操作）得太多或太用力”。在写作或口语里，它常带有负面评价，暗示本来可以更轻、更稳地处理。"]}
{"word":"overhandled","summary":{"en":"Overhandled means something was dealt with too much or too complicatedly, often making it worse.","zh":"overhandled 指某事被过度处理或过度干预，通常弄得更复杂甚至更糟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Managed, controlled, or dealt with too much or in an unnecessarily complicated way, often causing problems instead of solving them.","zh":"（形容词）被过度处理、过度干预或弄得过于复杂，结果往往适得其反。"},"examples":[{"en":"The project became overhandled, with too many approvals slowing everything down.","zh":"这个项目被过度处理了，太多审批把一切都拖慢了。"},{"en":"Her complaint felt overhandled, so the customer got even more frustrated.","zh":"她的投诉被处理得过度复杂，顾客反而更沮丧了。"}]},{"partOfSpeech":"v.","definition":{"en":"(v., past tense/past participle of overhandle) To handle or manage something too much or too often, usually making it worse.","zh":"（动词，overhandle 的过去式/过去分词）对某事过度处理或反复干预，通常把事情弄得更糟。"},"examples":[{"en":"They overhandled the negotiation and turned a simple deal into an argument.","zh":"他们把谈判过度操作，把一笔简单的交易弄成了争吵。"},{"en":"The situation was overhandled by multiple teams with different plans.","zh":"这个情况被多个团队用不同方案过度处理了。"}]}],"synonyms":["overmanaged","overprocessed","overcomplicated","overcontrolled","overengineered"],"phonetic":"/ˌoʊvərˈhændəld/","extraExplanation":["“overhandled”常见于工作场景（项目管理、客户服务、公关危机等），带有批评意味：不是“处理得很认真”，而是“管得太多、流程太繁琐、越帮越忙”。","词根理解：over-（过度）+ handled（处理/应对）。在商务英语里也可用“overmanaged / overengineered”表达类似感觉。"]}
{"word":"overhandling","summary":{"en":"Overhandling means handling or working something too much, often making it worse or damaging it.","zh":"Overhandling 指对某物过度触碰或操作，常常适得其反或造成损坏；在烘焙中也指面团等揉搅过度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of handling something too much, too roughly, or more than necessary, often causing damage or worse results","zh":"过度操作；过多或过粗地触碰/处理某物，常导致损坏或效果变差"},"examples":[{"en":"The museum warned that overhandling fragile artifacts can cause cracks and fading.","zh":"博物馆警告说，过度触碰脆弱文物会造成开裂和褪色。"},{"en":"Overhandling the fabric made it lose its shape.","zh":"过度摆弄那块布料使它变形了。"}]},{"partOfSpeech":"n.","definition":{"en":"in cooking or baking, mixing or working ingredients too much (especially dough), making the final texture tough or dense","zh":"（烹饪/烘焙）过度揉捏或搅拌（尤其是面团），导致成品口感变硬或变密实"},"examples":[{"en":"Overhandling the dough can make the cookies tough instead of tender.","zh":"面团揉得太过会让饼干变硬，而不是松软。"},{"en":"To avoid overhandling, mix just until the flour disappears.","zh":"为了避免过度搅拌，只要搅到看不见干粉即可。"}]}],"synonyms":["overhandling","overworking","excessive handling","overmanipulation","fiddling"],"phonetic":"/ˌoʊvərˈhændlɪŋ/","extraExplanation":["“Overhandling”常见于说明书、实验/文物保护、质检、护肤品或食品制作等场景，强调“多做反而坏事”。","在口语里，人们有时会用更常见的表达替代它，比如 “handling it too much / overworking it / messing with it too much”。","引申到人际或管理语境时，有时也可指对事情“管得太细/干预过多”（接近 micromanaging），但更常见的说法仍是 “micromanagement”。"]}
{"word":"overhands","summary":{"en":"“Overhands” is the plural of “overhand,” most often meaning over-the-top strokes or throws in sports; it can also relate to an overhand stitch in sewing.","zh":"“overhands”是“overhand”的复数，最常指体育运动中的上手击球/投掷动作；也可指缝纫中的包边针法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stroke or hit made with the hand or arm moving from above the shoulder downward (common in sports like tennis, volleyball, baseball, or swimming).","zh":"（体育运动中）从肩部上方挥臂向下击打/投掷的动作；上手击球（如网球、排球、棒球、游泳等）。"},"examples":[{"en":"She practiced her overhand serve for tennis every day.","zh":"她每天练习网球的上手发球。"},{"en":"In volleyball, an overhand pass is more controlled than an underhand one.","zh":"在排球中，上手传球通常比下手更容易控制。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done from above the shoulder, with the arm coming down over the top.","zh":"从肩部以上完成的；上手的（挥臂从上往下）。"},"examples":[{"en":"He threw an overhand pitch to the catcher.","zh":"他用上手投球把球投给捕手。"},{"en":"Try an overhand throw instead of an underhand toss.","zh":"试试上手投掷，而不是下手轻抛。"}]},{"partOfSpeech":"v.","definition":{"en":"To sew or stitch over the edge of cloth (often to finish or strengthen it).","zh":"（缝纫）用包边针/锁边针沿布料边缘缝合（用于收边或加固）。"},"examples":[{"en":"She overhanded the seam to keep it from fraying.","zh":"她沿着接缝用包边针缝了一圈，防止布边散开。"}]}],"synonyms":["overarm","overhead (in some sports contexts)","overhand stitch (sewing)"],"phonetic":"ˈoʊvərˌhænd","extraExplanation":["“overhands”通常是名词复数，来自“overhand”（上手击球/上手动作）。在体育语境里，常与“underhand（下手）”成对出现：overhand更有力量或控制，underhand更轻柔、更适合近距离。","在缝纫里，“overhand stitch（包边针/锁边针）”是很常见的基础针法，用来处理布边，避免脱线。"]}
{"word":"overhang","summary":{"en":"Overhang means to stick out over something from above; it can also mean the sticking-out part (like a roof edge or rock ledge), and less commonly, something left unfinished or a feeling that “hangs over” a situation.","zh":"Overhang 常指从上方伸出覆盖；也可作名词表示屋檐/岩棚等突出部分；较少见的用法是指事情拖着未完成，或（文学/正式）某种情绪与威胁“笼罩”在某处。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hang or extend outward over something, especially from above (often creating shade or a cover).","zh":"（从上方）悬出；伸出在……之上（常形成遮蔽或覆盖）。"},"examples":[{"en":"Tree branches overhang the river, making the water cooler in summer.","zh":"树枝伸到河面上方，夏天让河水更凉。"},{"en":"The roof overhangs the porch to keep rain off the door.","zh":"屋檐伸出在门廊上方，防止雨水打到门口。"}]},{"partOfSpeech":"n.","definition":{"en":"a part that sticks out over something below, such as a roof edge, rock ledge, or cliff.","zh":"突出部；悬垂处（如屋檐、岩棚、悬崖外伸部分）。"},"examples":[{"en":"We stood under the cliff’s overhang to stay out of the wind.","zh":"我们站在悬崖的岩棚下躲风。"},{"en":"Water dripped from the overhang after the storm.","zh":"暴风雨过后，水从屋檐/突出部滴下来。"}]},{"partOfSpeech":"v.","definition":{"en":"to remain unfinished or not completed on time.","zh":"（工作等）拖延未完成；未按时完成。"},"examples":[{"en":"A few tasks overhang from last week and still need attention.","zh":"上周有几项任务拖着没完成，还需要处理。"}]}],"synonyms":["project","jut out","extend over","ledge","eave"],"phonetic":"/ˈoʊvərˌhæŋ/","extraExplanation":["在建筑里，overhang 常指“屋檐/挑檐”的“伸出部分”，作用是遮雨、遮阳；在户外运动（如攀岩、徒步）语境中，overhang 常指“岩壁向外倾斜形成的岩棚/悬挑”，通常更难攀爬。","比喻用法里，overhang 可表示某种“阴影/压力笼罩在上方”，例如：A sense of danger overhung the town（危险感笼罩着小镇）。这类表达更偏文学或正式。"]}
{"word":"overhanging","summary":{"en":"“Overhanging” describes something that sticks out and hangs above an edge (or the ongoing action of doing so).","zh":"“overhanging”表示某物向外突出并悬在边缘上方（也可指正在“悬出/笼罩”的动作）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hanging over something (like a wall, roof, cliff, or tree branch), often sticking out beyond the edge.","zh":"（如墙、屋檐、悬崖、树枝等）向外伸出并悬在……上方的；上悬的。"},"examples":[{"en":"The house has an overhanging roof that gives shade in summer.","zh":"这栋房子有外挑的屋檐，夏天能遮阴。"},{"en":"Be careful under the overhanging branches after the storm.","zh":"暴风雨过后，在下垂悬在上方的树枝下面要小心。"},{"en":"They built a small balcony with an overhanging ledge.","zh":"他们建了一个小阳台，上方有外伸的檐口。"}]},{"partOfSpeech":"v.","definition":{"en":"The -ing form of “overhang”: to extend outward and be above something; to hang over.","zh":"“overhang”的 -ing 形式：向外伸出并在……上方；悬在……之上。"},"examples":[{"en":"A rock was overhanging the narrow path.","zh":"一块岩石悬在狭窄的小路上方。"},{"en":"Dark clouds were overhanging the city.","zh":"乌云笼罩在城市上空。"}]}],"synonyms":["projecting","jutting","protruding","overhead","looming"],"phonetic":"/ˌoʊvərˈhæŋɪŋ/","extraExplanation":["“overhanging”常用于描述建筑（如屋檐、挑檐、阳台）、自然地形（悬崖、岩石）或植物（树枝）在边缘“伸出去、压在上面”的空间关系。","比起单纯的“hanging”（垂挂），overhanging 更强调“在上方 + 超出边缘/突出”的感觉；也可用于比喻“阴影般笼罩”（如 overhanging clouds）。"]}
{"word":"overhangs","summary":{"en":"Overhangs are parts that stick out beyond an edge, or (as a verb) it means to extend out over something.","zh":"overhangs 可指“外挑/伸出部分”（名词复数），也可作动词表示“伸出并悬在……之上”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of something (like a roof, cliff, or branch) that sticks out beyond the surface below it.","zh":"（屋顶、悬崖、树枝等）向外伸出、超出下方表面的部分；外挑部分。"},"examples":[{"en":"The cabin’s roof has wide overhangs to keep rain off the walls.","zh":"小木屋的屋顶有很宽的挑檐，可以防止雨水淋到墙面。"},{"en":"Be careful near the cliff overhangs—they can be unstable.","zh":"靠近悬崖的外凸处要小心——可能不稳。"}]},{"partOfSpeech":"v.","definition":{"en":"(Of something) to extend out over something else; to hang above and partly cover it.","zh":"（某物）伸出并悬在……之上；上方外挑覆盖一部分。"},"examples":[{"en":"Tree branches overhang the path, making it shady.","zh":"树枝伸到小路上方，让路面很阴凉。"},{"en":"A balcony overhangs the entrance.","zh":"阳台悬在入口上方。"}]}],"synonyms":["projection","eave(s)","ledge","jut out","extend over"],"phonetic":"/ˌoʊvɚˈhæŋ/","extraExplanation":["“overhangs”可以是名词复数（many overhangs），也可以是动词第三人称单数（it overhangs）。在建筑里常见搭配有 roof overhang（屋檐/挑檐）；在户外运动（攀岩）里，overhang 常指“负角度的岩壁外凸处”，难度更高。"]}
{"word":"overhappily","summary":{"en":"“Overhappily” means “too happily” or “excessively cheerfully,” often suggesting it feels inappropriate or forced.","zh":"“overhappily”表示“过于开心/过分欢快地”，常暗示这种开心有点不合时宜或显得勉强。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively happy or cheerful way; more happily than is appropriate for the situation.","zh":"过于开心地；开心得有点不合时宜或过头。"},"examples":[{"en":"He laughed overhappily at the joke, and everyone noticed how nervous he was.","zh":"他对那个笑话笑得过于开心，大家都注意到他其实很紧张。"},{"en":"She spoke overhappily about the win, even though her friend had just lost.","zh":"她谈到获胜时显得过于开心，尽管她的朋友刚刚输了。"}]}],"synonyms":["too happily","overly cheerfully","excessively happily"],"phonetic":"/ˌoʊvɚˈhæpəli/","extraExplanation":["“over-”作为前缀常表示“过度、太……”。因此 overhappily 往往带一点评价意味：不仅是“很开心”，而是“开心得过了头/不太合适”。","这个词在日常口语里不算常见，更常用的表达是 “too happily / a little too happily / overly cheerfully”。"]}
{"word":"overhappiness","summary":{"en":"Overhappiness means excessive happiness—feeling unusually happy in a way that may seem too much.","zh":"Overhappiness 指“过度的快乐”，开心到有点“太过头”的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an unusually high or excessive level of happiness; happiness that feels “too much” for the situation","zh":"过度的快乐；超出一般程度、显得“太开心”的幸福感"},"examples":[{"en":"Her overhappiness after the minor compliment surprised everyone.","zh":"她因为一句小小的夸奖就过度开心，让大家都很惊讶。"},{"en":"He spoke with overhappiness, as if nothing could go wrong.","zh":"他带着一种过度乐观的快乐说话，仿佛什么事都不会出错。"},{"en":"Try to enjoy the good news without tipping into overhappiness that ignores real problems.","zh":"试着享受好消息，但别陷入忽视现实问题的过度开心。"}]}],"synonyms":["excessive happiness","overjoy","euphoria"],"phonetic":"/ˌoʊvərˈhæpinəs/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”（如 overwork 过劳、overthink 想太多）。因此 overhappiness 往往带有“有点不自然/不合时宜”的语气，暗示这种快乐可能影响判断或让人觉得夸张。","在自然英语中，overhappiness 不算非常常用，更常见的表达有: overjoy (n./v.)（狂喜）、overjoyed (adj.)（欣喜若狂）、excessive happiness（过度的快乐）。但 overhappiness 仍能被理解，常用于强调“过头了”。"]}
{"word":"overhappy","summary":{"en":"Overhappy means excessively happy or excited.","zh":"overhappy 指“过分开心/过度兴奋”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively happy or excited; happier than seems normal or appropriate in the situation.","zh":"过分开心的；兴奋得有点过头的（在当时情境下显得不太正常或不太合适）。"},"examples":[{"en":"She sounded overhappy on the phone, which made me wonder what she was hiding.","zh":"她在电话里听起来开心得有点过头，让我怀疑她是不是在隐瞒什么。"},{"en":"Don’t be overhappy too soon—we still have a lot of work to finish.","zh":"别高兴得太早——我们还有很多工作要完成。"},{"en":"He was overhappy about the compliment and wouldn’t stop talking about it.","zh":"他对那句夸奖开心得过头，一直停不下来地说个不停。"}]}],"synonyms":["overly happy","too happy","overjoyed","overexcited"],"phonetic":"/ˌoʊvərˈhæpi/","extraExplanation":["“over-”是常见前缀，表示“过度/超过正常程度”。因此 overhappy 字面意思就是“太开心”。在日常英语里更常见的说法是 overly happy 或 too happy。","带 over- 的类似词：overconfident（过于自信的）、overexcited（过度兴奋的）、overprotective（过度保护的）。"]}
{"word":"overharass","summary":{"en":"Overharass means to harass someone excessively or beyond what is reasonable.","zh":"overharass 指对某人进行过度骚扰或过分施压，超过合理范围。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to harass or pressure someone too much; to go beyond what is reasonable or necessary when bothering, questioning, or pursuing someone","zh":"过度骚扰；过分施压；在打扰、盘问或追逼某人时超过合理或必要的程度"},"examples":[{"en":"The reporter was criticized for overharassing the family after the accident.","zh":"那名记者因在事故后过度骚扰受害者家属而受到批评。"},{"en":"Don’t overharass your customers with calls—one reminder is enough.","zh":"别用电话过度骚扰客户——提醒一次就够了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat someone in a way that feels like excessive harassment (sometimes used informally or in writing to emphasize ‘too much’)","zh":"把某人折腾得像被“骚扰过头”一样（常见于非正式或强调语气的用法）"},"examples":[{"en":"He felt overharassed by constant messages demanding updates.","zh":"他觉得被不断催进度的消息折腾得不行，像被过度骚扰一样。"}]}],"synonyms":["harass relentlessly","badger","hound","pressure","pester"],"phonetic":"/ˌoʊvərhəˈræs/","extraExplanation":["“over-”是常见前缀，表示“过度、超过合理范围”。所以 overharass 直观意思就是“harass（骚扰）得太过头”。在正式英语里更常用的表达通常是 “harass excessively/relentlessly” 或 “subject someone to excessive harassment”。"]}
{"word":"overharassment","summary":{"en":"Overharassment means excessive or repeated harassment, often used in formal complaints or policy/legal contexts.","zh":"overharassment 指“过度或反复的骚扰”，常见于正式投诉或规章/法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or repeated harassment; harassment that goes beyond what is reasonable or legally acceptable (often used in complaints or legal/policy writing).","zh":"过度骚扰；超出合理或法律/规章允许范围的反复骚扰（多见于投诉、法律或规章语境）。"},"examples":[{"en":"The employee reported overharassment by a supervisor, including constant late-night messages.","zh":"这名员工举报主管对其过度骚扰，包括深夜不断发消息。"},{"en":"Our policy prohibits overharassment in any form, online or in person.","zh":"我们的规定禁止任何形式的过度骚扰，无论线上还是线下。"}]}],"synonyms":["excessive harassment","persistent harassment","repeated harassment","continued harassment","targeted harassment"],"phonetic":"ˌoʊvɚˌhəˈræsmənt","extraExplanation":["“overharassment”不是非常常见的标准词，更常见的写法是“excessive harassment”或“harassment”（根据语境用形容词修饰）。它由前缀 over-（表示“过度、过分”）+ harassment（骚扰）构成，用来强调“程度过头”。","如果是在正式文件中，建议根据具体行为改写得更明确，例如：“repeated unwanted contact（反复的非自愿联系）”“persistent harassment（持续骚扰）”“targeted harassment（针对性骚扰）”。"]}
{"word":"overhard","summary":{"en":"Overhard means “too hard,” often in a way that causes problems (uncomfortable, tough to eat, or brittle).","zh":"overhard 表示“过硬”，通常带有不理想、会造成问题的含义（不舒服、难咬、或变脆易裂）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too hard or harder than is desirable (often describing food, materials, or a surface).","zh":"过硬的；硬得不合适的（常形容食物、材料或表面）。"},"examples":[{"en":"The cookies came out overhard because I baked them too long.","zh":"饼干烤得太久，所以变得过硬。"},{"en":"If the mattress feels overhard, add a topper for comfort.","zh":"如果床垫感觉过硬，可以加一个床垫罩来更舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"(technical) hardened too much, which can make something brittle or more likely to crack.","zh":"（技术用语）硬化过度的，可能导致脆、容易开裂。"},"examples":[{"en":"The blade became overhard after heat treatment and chipped easily.","zh":"刀片热处理后硬化过度，结果很容易崩口。"}]}],"synonyms":["too hard","overly hard","excessively hard","rock-hard","brittle (in materials contexts)"],"phonetic":"/ˌoʊvɚˈhɑrd/","extraExplanation":["“overhard”在日常英语里不算常用，更常见的表达是“too hard / overly hard”。在技术语境（如材料、金属热处理）中也可能出现，用来强调“硬化过头”带来的负面影响（例如变脆）。"]}
{"word":"overharden","summary":{"en":"Overharden means to make something too hard—often so hard that it becomes stiff or brittle.","zh":"overharden 指“使……过度变硬”，常暗含变僵或变脆等不良后果。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something too hard, stiff, or rigid (more than is good or necessary)","zh":"把……弄得过硬；使……硬化过度（超过适当程度）"},"examples":[{"en":"If you bake the cookies too long, you can overharden them.","zh":"如果饼干烤太久，可能会把它们烤得过硬。"},{"en":"Overhardened leather can crack more easily.","zh":"过度硬化的皮革更容易开裂。"}]},{"partOfSpeech":"vt.","definition":{"en":"(materials/engineering) to harden a metal or material too much during heat treatment, making it brittle","zh":"（材料/工程）在热处理过程中使金属或材料硬化过度，导致变脆"},"examples":[{"en":"The technician warned that overheating can overharden the steel and reduce its toughness.","zh":"技术员警告说，过热会使钢过度硬化并降低韧性。"},{"en":"The part failed because it was overhardened during processing.","zh":"这个零件失效是因为加工时硬化过度。"}]}],"synonyms":["harden too much","overstiffen","make brittle","overtoughen (less common)"],"phonetic":"/ˌoʊvərˈhɑrdən/","extraExplanation":["这个词由 over-（“过度、太……”）+ harden（“使变硬/硬化”）构成，意思就是“硬过头”。常见于材料工程（如钢的淬火/回火）以及日常语境（烤焦、放久变硬、皮革变僵等）。","在工程语境里，overharden 往往暗示“硬度上去了，但韧性下降、变脆”，属于不良结果，因此常与 brittle（脆的）、toughness（韧性）一起出现。"]}
{"word":"overhardness","summary":{"en":"Overhardness means hardness that is higher than desired, often discussed for water quality or material properties.","zh":"overhardness 指“硬度过高”，常用于水质或材料性能等技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of being too hard (especially when hardness is higher than desirable in a material or in water).","zh":"过硬；硬度过高（尤指材料或水的硬度高于理想/标准水平）。"},"examples":[{"en":"Overhardness in the steel can make it brittle and easier to crack.","zh":"钢材过硬会使其变脆，更容易开裂。"},{"en":"The lab reported overhardness in the well water, so we installed a softener.","zh":"实验室报告井水硬度过高，所以我们安装了软水机。"}]}],"synonyms":["excessive hardness","too much hardness","overhardening (materials context)"],"phonetic":"/ˌoʊvɚˈhɑrdnəs/","extraExplanation":["“overhardness”多见于技术语境（材料科学、水处理、地质/土壤/锅炉系统等），日常英语更常用“too hard”或“excessive hardness”。","在水质领域，hardness通常指水中钙、镁离子含量；过高会导致水垢、降低洗涤效率、影响设备寿命。具体标准因地区与用途（饮用水、锅炉、工业用水）而不同。","在材料领域，过高硬度可能带来耐磨性提升，但也可能增加脆性、降低韧性；因此常需要在硬度与韧性之间平衡（如通过回火、热处理参数调整）。"]}
{"word":"overhardy","summary":{"en":"Overhardy means too bold or brave in a risky, unwise way.","zh":"overhardy 指过分大胆、逞强到不顾风险的鲁莽冒险。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too confident or daring, especially in a way that ignores danger; rashly brave","zh":"过于胆大（以至于不顾危险）的；鲁莽冒险的"},"examples":[{"en":"It was overhardy to hike alone in the storm without a map.","zh":"在暴风雨里不带地图独自徒步是过于鲁莽的。"},{"en":"Her overhardy promise to finish the project in one day caused stress for the whole team.","zh":"她鲁莽地承诺一天完成项目，让整个团队都很有压力。"},{"en":"The plan sounded bold, but in reality it was overhardy and poorly prepared.","zh":"这个计划听起来很大胆，但实际上过于冒险，准备也不足。"}]}],"synonyms":["foolhardy","reckless","rash","overbold","daredevil (adj.)"],"phonetic":"/ˌoʊvɚˈhɑrdi/","extraExplanation":["“overhardy”由 over-（过度）+ hardy（强壮的、勇敢的）组成，语气偏书面或较旧式，常用来委婉批评某种“逞强式的勇敢”，强调“勇敢过头→鲁莽”。在现代英语里更常用的近义词是 “foolhardy / reckless / rash”。"]}
{"word":"overharsh","summary":{"en":"“Overharsh” means too harsh or too strict—more severe than is fair or necessary.","zh":"“overharsh”表示“过于严厉/苛刻”，严厉程度超过了公平或必要的范围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too harsh; more severe, strict, or unpleasant than is reasonable or necessary.","zh":"过于严厉的；（语气、对待或惩罚等）比合理或必要程度更苛刻的。"},"examples":[{"en":"The teacher’s comments felt overharsh for a small mistake.","zh":"老师的评语对一个小错误来说显得过于严厉。"},{"en":"Try not to be overharsh with yourself after a bad day.","zh":"一天过得不顺也别对自己太苛刻。"},{"en":"Some critics said the new rules were overharsh and hurt ordinary workers.","zh":"一些评论者认为新规定过于苛刻，会伤害普通劳动者。"}]}],"synonyms":["overly harsh","too harsh","unduly harsh","excessively harsh","too severe"],"phonetic":"/ˌoʊvɚˈhɑrʃ/","extraExplanation":["“over-”这个前缀常表示“过度、太……”，带有“超过合适程度”的含义，如 overconfident（过度自信）、overreact（反应过度）。因此 overharsh 通常是在说“严厉得过头了”。","overharsh 并不是最常见的日常词；更常见的表达有 “too harsh / overly harsh / unduly harsh / excessively harsh”。在正式写作或评论中更常用 overly/unduly/excessively harsh。"]}
{"word":"overharshly","summary":{"en":"“Overharshly” means “in an excessively harsh way.”","zh":"“overharshly”表示“过于严厉地／严苛过头地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively harsh or severe way; more strictly, critically, or unkindly than is fair or necessary.","zh":"过于严厉地；严苛过头地（比公平或必要的程度更严格、更苛刻或更不客气）。"},"examples":[{"en":"The teacher didn’t mean to, but she spoke overharshly to the student in front of the class.","zh":"老师并非有意，但她在全班面前对那位学生说话过于严厉。"},{"en":"He judged himself overharshly after making a small mistake.","zh":"他犯了一个小错后却对自己过于苛刻地评判。"},{"en":"The article criticized the new policy overharshly without considering its benefits.","zh":"那篇文章在没有考虑政策益处的情况下，对新政策批评得过于严厉。"}]}],"synonyms":["too harshly","overly harshly","unduly harshly","excessively harshly","severely (in context)"],"phonetic":"ˌoʊvɚˈhɑrʃli","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过适当程度”。所以 overharshly = harshly（严厉地）+ over-（过度）。在语气上，它常暗示“这样做不太公平/不太必要”，带有轻微的批评或反思色彩。","实际写作中更常见的替代表达包括：too harshly / overly harshly。overharshly 也能用，但相对更少见，语感更像“严厉过头”。"]}
{"word":"overharshness","summary":{"en":"Overharshness means excessive harshness—being too strict or severe.","zh":"Overharshness 指“过度严厉、过分苛刻”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive harshness; being too strict, severe, or critical (more than is fair or helpful).","zh":"过度严厉；过分苛刻（严厉到不公平或无益的程度）。"},"examples":[{"en":"The teacher’s overharshness made students afraid to ask questions.","zh":"老师的过度严厉让学生不敢提问。"},{"en":"A little discipline helps, but overharshness often hurts trust.","zh":"适度的纪律有帮助，但过度严厉往往会伤害信任。"},{"en":"The report criticized the company’s overharshness toward new employees.","zh":"报告批评公司对新员工过于苛刻。"}]}],"synonyms":["excessive harshness","undue severity","overstrictness","rigor","sternness"],"phonetic":"/ˌoʊvərˈhɑrʃnəs/","extraExplanation":["“overharshness”不是非常常见的固定词，多用于较正式或强调语气的表达。它由 over-（过度）+ harsh（严厉的）+ -ness（名词后缀）构成，意思很直观：把“严厉”推到“过头”的程度。","更常见、自然的替代表达包括：“excessive harshness”“undue harshness”“being too harsh/too strict”。写作时如果想更地道，可以优先用这些短语。"]}
{"word":"overharvest","summary":{"en":"Overharvest means taking too much from nature or farms, so the resource cannot recover.","zh":"Overharvest 指过度采收（采得过多或过快），导致资源无法恢复。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to harvest (take from nature or farms) too much or too quickly, so the supply cannot recover","zh":"过度采收；过度收获（采得太多或太快，导致资源来不及恢复）"},"examples":[{"en":"Many fisheries were overharvested, and fish populations fell sharply.","zh":"许多渔场被过度捕捞，鱼群数量急剧下降。"},{"en":"If we overharvest these trees, the forest will not regenerate.","zh":"如果我们过度砍伐这些树木，森林将无法再生。"}]},{"partOfSpeech":"n.","definition":{"en":"an act or period of harvesting too much, especially of wild resources","zh":"过度采收（行为或时期，尤指对野生资源的过度采集）"},"examples":[{"en":"The report blamed the overharvest of oysters for the collapse of the local beds.","zh":"报告将当地牡蛎栖息地的崩溃归咎于过度采收。"}]}],"synonyms":["overexploit","overfish","overuse","overcut"],"phonetic":"/ˌoʊvɚˈhɑrvɪst/","extraExplanation":["这个词常见于环境与资源管理语境（如渔业“过度捕捞”、森林“过度砍伐”、野生药材“过度采集”）。它强调“超出可持续水平（sustainable level）”，与“合法/非法”不完全等同：即使合法，如果超过生态或再生能力，也可能构成 overharvest。"]}
{"word":"overharvested","summary":{"en":"“Overharvested” describes plants, animals, or resources taken in excessive amounts, leading to depletion.","zh":"“overharvested”指动植物或资源被过度采收/采捕，导致数量减少、枯竭或生态受损。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harvested too much (more than nature or a system can replace), causing depletion or harm.","zh":"过度采收的；采捕过量的（超过自然或系统可再生的速度），导致资源减少或生态受损。"},"examples":[{"en":"Many wild fish stocks are overharvested, so catches have to be limited.","zh":"许多野生鱼类资源被过度捕捞，因此必须限制捕捞量。"},{"en":"Overharvested forests can take decades to recover.","zh":"被过度采伐的森林可能需要几十年才能恢复。"},{"en":"Some medicinal plants are overharvested because demand has increased.","zh":"一些药用植物因需求增加而被过度采挖。"}]}],"synonyms":["overexploited","overfished","overlogged","depleted","unsustainably harvested"],"phonetic":"/ˌoʊvərˈhɑrvəstɪd/","extraExplanation":["“over-”这个前缀表示“过度、超过合理限度”，常见于环境与资源议题：overfishing（过度捕捞）、overlogging（过度伐木）、overgrazing（过度放牧）。","“overharvested”多用于讨论可再生资源的可持续性（sustainability）：当采收速度＞再生速度，就会出现种群下降、生境破坏、供应链不稳定等问题。","常见搭配：overharvested species（被过度采捕的物种）、overharvested stock（被过度捕捞的鱼群/资源量）、overharvested land/forest（被过度采收/采伐的土地/森林）。"]}
{"word":"overharvesting","summary":{"en":"Overharvesting means taking too much from nature too fast, so the resource cannot recover.","zh":"overharvesting 指对自然资源过度采收/捕捞/采伐，速度超过其自然恢复能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of taking too many plants, animals, or natural resources from an area, faster than they can naturally recover.","zh":"过度采收；过度捕捞/采伐（指从某地获取动植物或自然资源的速度超过其自然恢复速度）。"},"examples":[{"en":"Overharvesting of fish can cause the population to collapse.","zh":"过度捕捞会导致鱼群数量崩溃。"},{"en":"The government limited logging to prevent overharvesting of the forest.","zh":"政府限制伐木以防止森林被过度采伐。"},{"en":"Overharvesting wild herbs can damage local ecosystems.","zh":"过度采收野生药草会破坏当地生态系统。"}]},{"partOfSpeech":"v.","definition":{"en":"To take too much of a natural resource (such as fish, timber, or crops), leaving too little for the future.","zh":"过度采收；过度捕捞/采伐（把自然资源取用过量，导致未来不足）。"},"examples":[{"en":"If we overharvest tuna, it will become harder to find each year.","zh":"如果我们过度捕捞金枪鱼，每年都会更难捕到。"},{"en":"Some companies overharvested the land and then moved on.","zh":"一些公司把土地过度开发收割后就转移到别处。"}]}],"synonyms":["overexploitation","overfishing","excessive harvesting"],"phonetic":"/ˌoʊvɚˈhɑrvəstɪŋ/","extraExplanation":["“Over-”表示“过度、超过合理范围”。因此 overharvesting 常用于环保与资源管理语境，强调“不可持续”。","常见搭配：overharvesting of fish/timber/wild plants（对鱼类/木材/野生植物的过度采收）；prevent/stop/limit overharvesting（防止/制止/限制过度采收）。","相关近义表达（语境略有不同）：overfishing（过度捕捞，特指鱼类）、overlogging（过度伐木）、overexploitation（过度开发/利用，范围更广、更正式）。"]}
{"word":"overharvests","summary":{"en":"“Overharvests” means “harvests too much,” often in a way that harms or depletes natural resources.","zh":"“overharvests”表示“过度采收/采伐/捕捞”，通常指以不可持续的方式取用资源，造成枯竭或破坏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) to harvest too much of a plant, animal, or natural resource, causing depletion or long-term damage.","zh":"（第三人称单数）过度采收；采收过量（指植物、动物或自然资源），导致资源减少或长期破坏。"},"examples":[{"en":"This company overharvests wild ginseng, so the plant is becoming rare.","zh":"这家公司过度采收野生人参，所以这种植物变得越来越稀少。"},{"en":"If a country overharvests its fish stocks, the ocean cannot recover quickly.","zh":"如果一个国家过度捕捞（过度采收）鱼类资源，海洋就无法快速恢复。"}]},{"partOfSpeech":"vi.","definition":{"en":"(third-person singular) to harvest more than is sustainable; to take more than nature can replace.","zh":"（第三人称单数）以不可持续的方式采收；取用超过自然能够补充的数量。"},"examples":[{"en":"Without clear rules, the industry overharvests year after year.","zh":"如果没有明确的规则，这个行业就会年复一年地过度采收。"},{"en":"The community worries that the forest overharvests and loses biodiversity.","zh":"社区担心森林被过度采伐，导致生物多样性下降。"}]}],"synonyms":["overexploits","overfishes","overcollects","overgrazes","depletes"],"phonetic":"ˌoʊvərˈhɑrvəsts","extraExplanation":["“overharvest”常用于环境与资源管理语境（如渔业、林业、野生药材采集）。它强调“超过可持续水平”，因此常与sustainable（可持续的）、depletion（枯竭）、regulate（监管/限制）等词一起出现。"]}
{"word":"overhaste","summary":{"en":"Overhaste means excessive hurry that often leads to mistakes or poor decisions.","zh":"overhaste 指“过于匆忙”，常暗示因此容易出错或做出不佳决定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Too much hurry; rushing so much that it causes mistakes or bad results.","zh":"过于匆忙；因太急而导致错误或不良后果。"},"examples":[{"en":"In their overhaste to finish the report, they forgot to check the numbers.","zh":"他们为了赶快完成报告而过于匆忙，结果忘了核对数字。"},{"en":"Don’t act in overhaste—take a moment to think it through.","zh":"别过于匆忙——花点时间想清楚。"}]}],"synonyms":["undue haste","excessive haste","rashness","hurry","recklessness"],"phonetic":"/ˌoʊvərˈheɪst/","extraExplanation":["“overhaste”由前缀 over-（过度）+ haste（匆忙）组成，语气常带批评或提醒：不是“快”本身不好，而是“快过头”导致质量下降或判断失误。","它在现代英语里相对少见，更常见的表达是 “undue haste / excessive haste / rushing / in too much of a hurry”。"]}
{"word":"overhasten","summary":{"en":"Overhasten means to hurry too much or too soon, often leading to mistakes.","zh":"overhasten 指做事过于匆忙或过早，常导致失误。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do something too quickly or too soon, often causing mistakes or poor results","zh":"做事过于匆忙或过早，常常因此导致错误或效果变差"},"examples":[{"en":"Don’t overhasten your decision—sleep on it and talk it through tomorrow.","zh":"别太匆忙做决定——先想一晚，明天再好好讨论。"},{"en":"In her eagerness to help, she overhastened the plan and missed a key detail.","zh":"她急着帮忙，计划推进得太仓促，结果漏掉了一个关键细节。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hurry someone or something excessively; to push the pace too much","zh":"过度催促某人或某事；把进度推得太快"},"examples":[{"en":"The manager overhastened the team, and the report came back with errors.","zh":"经理把团队催得太急，报告交回来时错误不少。"},{"en":"Trying to overhasten recovery can sometimes slow it down.","zh":"想把康复过程催得太快，有时反而会变慢。"}]}],"synonyms":["rush","be too hasty","hurry","act prematurely"],"phonetic":"/ˌoʊvərˈheɪsən/","extraExplanation":["“over-”表示“过度、太……”，所以 overhasten 的核心含义就是“赶得过头”。这个词在现代英语里相对少见，更常用的表达有 rush (into), be too hasty, act too quickly, hurry (something) too much 等。","语感上它常带有提醒或批评：不是反对行动，而是强调“快过头会坏事”，类似中文“欲速则不达”。"]}
{"word":"overhastily","summary":{"en":"“Overhastily” means doing something too quickly and without enough thought.","zh":"“overhastily”表示做事过于匆忙、欠考虑，带有草率之意。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too quickly and without enough careful thought; in a rushed, careless way.","zh":"过于匆忙地；没有充分思考就草率地。"},"examples":[{"en":"She overhastily sent the email and forgot the attachment.","zh":"她太匆忙就把邮件发出去了，结果忘了加附件。"},{"en":"Don’t decide overhastily—you may regret it later.","zh":"别草率决定——你之后可能会后悔。"}]}],"synonyms":["rashly","too quickly","prematurely","impulsively"],"phonetic":"/ˌoʊvərˈheɪstəli/","extraExplanation":["“over-”有“过度、太……”的意思（如 overconfident 过于自信），加在 hastily（匆忙地）前面，就强调“比正常的匆忙更过头”。","语气上，overhastily 常带批评或提醒，暗示事情本可以更谨慎、更周全。"]}
{"word":"overhastiness","summary":{"en":"Overhastiness means being too hasty—acting or deciding too quickly without enough thought.","zh":"Overhastiness 指“过于匆忙”，即做事或决定太快、缺乏充分思考。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of acting or deciding too quickly, without enough thought, planning, or care (often leading to mistakes).","zh":"做事或下决定过于匆忙、欠缺思考与计划的状态（常导致错误）。"},"examples":[{"en":"The project failed because of overhastiness in the planning stage.","zh":"这个项目失败是因为在规划阶段过于匆忙。"},{"en":"Try not to let overhastiness push you into sending an email you’ll regret.","zh":"别让过于匆忙害你发出一封之后会后悔的邮件。"},{"en":"His overhastiness in judging others caused unnecessary conflict.","zh":"他评判别人过于仓促，导致了不必要的冲突。"}]}],"synonyms":["haste","rashness","impulsiveness","precipitancy","recklessness"],"phonetic":"/ˌoʊvərˈheɪstinəs/","extraExplanation":["“overhastiness”由 over-（过度）+ haste（匆忙）+ -ness（名词后缀）组成，强调“比正常更过头的匆忙”。语气通常偏负面，暗示缺乏谨慎或深思。","在现代英语中，“overhastiness”相对少见，更常用的近义表达有“haste”“rashness”“impulsiveness”，或说“being too hasty”。"]}
{"word":"overhasty","summary":{"en":"Overhasty means “too hasty”—done too quickly and without enough thought.","zh":"overhasty 指“过于匆忙/草率”，强调做事太快、欠考虑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Done or decided too quickly, without enough careful thought; rushed and possibly mistaken.","zh":"做得或决定得太快、欠缺慎重考虑的；仓促的，可能会出错的。"},"examples":[{"en":"It would be overhasty to blame her before we hear the full story.","zh":"在听完完整经过之前就怪她，未免太仓促了。"},{"en":"The company’s overhasty expansion caused cash-flow problems.","zh":"公司过于仓促的扩张导致了现金流问题。"}]}],"synonyms":["too hasty","rushed","rash","premature","impulsive"],"phonetic":"/ˌoʊvərˈheɪsti/","extraExplanation":["“over-”在这里表示“过度、太……”，所以 overhasty = too hasty（过于急促/草率）。常用来提醒别人不要太快下结论或做决定。","语体上略显正式，常见于书面语或较严肃的讨论中；口语里更常说 “too hasty / rushed / premature”。"]}
{"word":"overhate","summary":{"en":"“Overhate” means to hate something excessively, often in informal online speech.","zh":"“overhate”指对某事过度憎恨，多用于非正式的网络语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hate someone or something too much; to show an excessive or exaggerated level of hate (often used informally)","zh":"过度憎恨；对某人或某事恨得太过头（多为非正式用法）"},"examples":[{"en":"People online sometimes overhate a movie after seeing just one bad clip.","zh":"网上的人有时只看了一个糟糕片段就会对一部电影过度讨厌。"},{"en":"It’s okay not to like her music, but don’t overhate it—just move on.","zh":"不喜欢她的音乐没关系，但别过度憎恨——不喜欢就跳过吧。"}]}],"synonyms":["hate too much","hate excessively","dislike intensely (not always the same as hate)"],"phonetic":"/ˌoʊvɚˈheɪt/","extraExplanation":["“overhate”不是非常标准、常见的词，更像网络口语/即兴造词：over-（过度）+ hate（憎恨）。在正式写作中，通常用“hate excessively / hate too much / show disproportionate hatred”等更自然。","它常出现在评论文化里，表达“负面情绪不成比例”，类似的构词还有“overreact（反应过度）”“overhype（过度炒作）”。"]}
{"word":"overhated","summary":{"en":"“Overhated” means disliked or criticized more than is fair or deserved.","zh":"“overhated”指某人或某物被讨厌/被批评得过头，不太公平。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"disliked or criticized more than is fair or deserved (often used in online conversation).","zh":"被过度讨厌的；被过分批评的（常见于网络用语，表示“不该这么招黑/不至于这么被骂”）。"},"examples":[{"en":"That movie is overhated—it's not perfect, but it’s fun.","zh":"那部电影被过度讨厌了——不完美，但挺好玩的。"},{"en":"He’s kind of overhated online; people focus on one mistake and ignore everything else.","zh":"他在网上有点被过度讨厌了；大家盯着一个错误不放，忽略了其他一切。"},{"en":"This brand is overhated because of a few bad reviews.","zh":"这个品牌因为几条差评就被过度讨厌了。"}]}],"synonyms":["unfairly criticized","unfairly disliked","unduly criticized","too harshly judged"],"phonetic":"/ˌoʊvɚˈheɪtɪd/","extraExplanation":["“overhated”是比较新的口语/网络表达，由“over-（过度）+ hated（被讨厌）”构成，常用来为某人/某物“平反”，意思是外界的负面评价超过了它实际应得的程度。","它常和“overrated（被高估的）”相对：overrated强调“夸得太过”，overhated强调“骂得太过”。","语气上通常带一点主观立场，适合用于轻松讨论（影视、明星、食物、品牌等），在正式写作中可换成“unfairly criticized / unfairly disliked”。"]}
{"word":"overhates","summary":{"en":"“Overhates” means “hates too much” (an exaggerated, excessive hatred).","zh":"“overhates”表示“过度厌恶/恨得太过分”（夸张、过度的憎恨）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular) to hate someone or something too much; to hate in an exaggerated or excessive way.","zh":"（第三人称单数）过度厌恶；把对某人或某事的恨夸大到不合理的程度。"},"examples":[{"en":"He overhates his rivals and can’t see anything good in them.","zh":"他过度憎恨对手，完全看不到他们身上任何优点。"},{"en":"She overhates that TV show, even though she has only watched one episode.","zh":"她过度讨厌那部剧，尽管她只看过一集。"}]}],"synonyms":["hate too much","despise excessively","loathe","detest"],"phonetic":"ˌoʊvɚˈheɪt","extraExplanation":["“over-” 是常见前缀，表示“过度、太……”，如 overreact（反应过度）、overthink（想太多）。因此 overhate 直观含义就是“恨得过头”。","“overhate/overhates” 在日常英语中不算高频，更常见的表达是 “hate too much / really hate / have an intense dislike for”。写作时可根据语境选择更自然的说法。"]}
{"word":"overhating","summary":{"en":"“Overhating” means hating or criticizing something excessively, often unfairly (informal, common online).","zh":"“overhating”指对某事/某人过度厌恶或过度批评（非正式，多用于网络）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Informal) Hating or strongly disliking someone/something too much or more than the situation reasonably deserves.","zh":"（非正式）对某人/某事“恨过头”、过度厌恶或过度否定，程度超出合理范围。"},"examples":[{"en":"People are overhating this movie just because it’s popular.","zh":"大家因为这部电影很火就过度黑它了。"},{"en":"I get the criticism, but you’re overhating—there are some good parts.","zh":"我理解批评点，但你有点恨过头了——也有一些优点。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) Showing excessive hate in comments or behavior; being overly harsh or hostile.","zh":"（较少见）在言论或行为中表现出过分的仇恨/攻击性；过度刻薄或敌对。"},"examples":[{"en":"The replies are overhating instead of discussing the issue calmly.","zh":"回复里不是在冷静讨论问题，而是在过度攻击。"}]}],"synonyms":["overly critical","too harsh","unfairly negative","hate on (someone/something)","bash (informal)"],"phonetic":"ˌoʊvɚˈheɪtɪŋ","extraExplanation":["“overhating”多见于网络语境（社交媒体、评论区），语气偏口语/俚语，带有“你反应过度、黑得太狠”的意思。更正式的表达可以用：“excessive criticism / unfairly harsh / disproportionately negative”。","构词上是“over-（过度）+ hate（厌恶）”，所以核心含义就是“恨/讨厌得过头”。"]}
{"word":"overhatted","summary":{"en":"Overhatted means dressed with too much/too fancy headwear, or (informally) burdened with too many roles—wearing too many hats.","zh":"overhatted 指帽子戴得过多/过于隆重不合时宜；也可（非正式，比喻）指身兼数职、职责过多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a hat (or hats) in an excessive or inappropriate way—for example, a hat that is too large, too formal, or too much for the situation.","zh":"（穿戴帽子）过度或不合时宜地戴着帽子；例如帽子太大、太正式，或与场合不搭。"},"examples":[{"en":"He looked a little overhatted in a baseball cap and a wide-brimmed sun hat.","zh":"他又戴棒球帽又戴宽檐遮阳帽，看起来有点“帽子戴过头了”。"},{"en":"For a casual picnic, she felt overhatted in her fancy church hat.","zh":"去轻松的野餐，她戴着华丽的礼帽，觉得有点太隆重、显得不合时宜。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, informal) Having too many roles or responsibilities at once; “wearing too many hats.”","zh":"（比喻，非正式）同时承担过多角色或职责；“身兼数职”。"},"examples":[{"en":"As a tiny startup founder, he was overhatted—CEO, marketer, and customer support.","zh":"作为小型创业公司的创始人，他身兼数职——既当CEO又做市场还要客服。"},{"en":"The manager realized the team was overhatted and needed another hire.","zh":"经理意识到团队分工过重、人人身兼数职，需要再招一个人。"}]}],"synonyms":["overdressed (for the situation)","overburdened","stretched thin","wearing too many hats"],"phonetic":"/ˌoʊvɚˈhætɪd/","extraExplanation":["“overhatted”不是很常见的标准词，更像是口语/写作里的创造性用法：over-（过度）+ hatted（戴帽子的）。在职场语境里常借用习语“wear many hats（身兼数职）”，所以“overhatted”常用于强调“多到不合理、压得喘不过气”。"]}
{"word":"overhaughtily","summary":{"en":"“Overhaughtily” means “in an overly proud, contemptuous way,” showing you look down on others.","zh":"“overhaughtily”表示“以过分傲慢、轻蔑他人的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a proud and unfriendly way that shows you think you are better than other people.","zh":"以傲慢自大、目中无人的方式（表现出自己比别人高一等）。"},"examples":[{"en":"He spoke overhaughtily to the waiter, as if basic courtesy didn’t apply to him.","zh":"他用一种傲慢的语气对服务员说话，仿佛基本礼貌对他不适用。"},{"en":"She dismissed the idea overhaughtily and refused to listen to any feedback.","zh":"她傲慢地否定了这个想法，拒绝听取任何反馈。"}]}],"synonyms":["arrogantly","disdainfully","condescendingly","superiorly"],"phonetic":"/ˌoʊvərˈhɔtəli/","extraExplanation":["“overhaughtily”来自形容词“overhaughty”（过于傲慢的）+ 副词后缀“-ly”。“haughty”本身就有“傲慢、看不起人”的语气；加上“over-”强调“过头了、太过分”。","语气提示：它通常带有强烈的负面评价，多用于描写他人态度或语气（例如说话方式、神情、举止），不太用于自我描述。较常见的替换说法有“arrogantly / disdainfully / condescendingly”。"]}
{"word":"overhaughtiness","summary":{"en":"Overhaughtiness means excessive pride and a superior, contemptuous attitude toward others.","zh":"Overhaughtiness 指过度的傲慢自大，对他人抱有优越感和轻视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An attitude of being too proud and feeling superior to others; arrogant disdain.","zh":"傲慢自大、目中无人；带着优越感的轻视。"},"examples":[{"en":"Her overhaughtiness made it hard for coworkers to collaborate with her.","zh":"她的傲慢自大让同事很难和她合作。"},{"en":"He spoke with overhaughtiness, as if everyone else were less intelligent.","zh":"他说话带着傲慢的语气，好像别人都不如他聪明。"}]}],"synonyms":["arrogance","haughtiness","superiority","snobbery","conceit"],"phonetic":"/ˌoʊvərˈhɔtinəs/","extraExplanation":["“overhaughtiness”由“over-（过度）+ haughty（傲慢的）+ -ness（名词后缀）”构成，字面意思就是“过度的傲慢”。实际使用中它比更常见的“haughtiness”少见，写作里用它常带有更强的批评语气。","近义词里，“arrogance”更常用、更通俗；“haughtiness”更强调“高高在上、带着轻视”的姿态；“conceit”则更偏“自负/自恋”。"]}
{"word":"overhaughty","summary":{"en":"Overhaughty means excessively haughty—too proud, arrogant, and looking down on others.","zh":"overhaughty 指“过分傲慢”，带有瞧不起别人的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively proud and disdainful; too arrogant or superior in manner.","zh":"过分傲慢的；目中无人的；自视过高的。"},"examples":[{"en":"His overhaughty tone made it hard for others to work with him.","zh":"他那种过分傲慢的语气让别人很难与他合作。"},{"en":"She apologized for sounding overhaughty during the meeting.","zh":"她为自己在会议上听起来太傲慢而道歉。"}]}],"synonyms":["overly haughty","arrogant","condescending","supercilious","stuck-up"],"phonetic":"/ˌoʊvɚˈhɔti/","extraExplanation":["“over-”常表示“过度、太……”，所以 overhaughty = “太 haughty（傲慢的）”。日常英语里更常说“too haughty / overly haughty / arrogant / condescending”。","“haughty”通常带有“看不起别人”的感觉（不仅是自信），因此 overhaughty 语气更强，强调“傲慢到了让人反感/不合时宜”的程度。"]}
{"word":"overhaul","summary":{"en":"“Overhaul” means to thoroughly examine and make major improvements, or a complete repair/major revision.","zh":"“Overhaul”指对某事进行彻底检查并大幅改进；也可指（机器/系统的）大修或重大修订。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to examine something carefully and improve it by making many changes; to rebuild or repair it thoroughly","zh":"对某事进行彻底检查并大幅改进；全面翻新/大修"},"examples":[{"en":"The company plans to overhaul its hiring process this year.","zh":"公司计划今年彻底改革招聘流程。"},{"en":"We need to overhaul the old website to make it faster and easier to use.","zh":"我们需要彻底改版旧网站，让它更快、更好用。"}]},{"partOfSpeech":"n.","definition":{"en":"a complete repair or rebuilding of a machine or system; a major revision","zh":"（机器/系统的）大修、全面检修；（制度/方案的）大幅修订"},"examples":[{"en":"After the engine overhaul, the car ran much more smoothly.","zh":"发动机大修后，车运行得顺畅多了。"},{"en":"The school is going through an overhaul of its curriculum.","zh":"这所学校正在对课程体系进行大幅改革。"}]}],"synonyms":["revamp","renovate","reform","rebuild","refit","repair","restructure"],"phonetic":"/ˈoʊvərˌhɔl/","extraExplanation":["overhaul 原意与“把帆船上的绳索拉过来、整理好”有关，后来引申为“彻底检查并修整”，所以常带有“从头到尾大改一遍”的感觉。","常见搭配：overhaul a system/process/policy（彻底改革某系统/流程/政策）；overhaul an engine/aircraft（大修发动机/飞机）。在口语里也可说 give something an overhaul（给……来一次大改造）。"]}
{"word":"overhauled","summary":{"en":"“Overhauled” means thoroughly repaired, improved, or updated; it can also be the past form of “overhaul.”","zh":"“overhauled”表示“彻底检修/改进/更新过的”，也可作动词“overhaul”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thoroughly repaired, improved, or updated; changed a lot to work better or look newer.","zh":"彻底检修、改进或更新过的；被大幅改造以更好用或更现代的。"},"examples":[{"en":"The company released an overhauled version of the app with a simpler design.","zh":"公司发布了一个彻底改版的应用版本，设计更简洁。"},{"en":"After the engine was overhauled, the car ran much more smoothly.","zh":"发动机大修后，汽车运行顺畅多了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overhaul”: to examine carefully and repair or improve a machine, system, or plan.","zh":"“overhaul”的过去式/过去分词：对机器、系统或计划进行全面检查并修理或改进。"},"examples":[{"en":"They overhauled the heating system before winter.","zh":"冬天前他们对供暖系统进行了全面检修。"},{"en":"The school has overhauled its curriculum to include more practical skills.","zh":"学校已全面改革课程，把更多实用技能纳入其中。"}]}],"synonyms":["revamped","renovated","refurbished","reworked","modernized","updated"],"phonetic":"/ˌoʊvərˈhɔld/","extraExplanation":["“overhaul”常用于正式或商业语境，搭配很固定：overhaul a system/engine/policy/curriculum（全面检修/改革某个系统、发动机、政策、课程）。","词源上含有“把东西拉出来仔细检查”的意象，所以语感上比“fix（修理）”更强调“彻底、系统地处理”。"]}
{"word":"overhauler","summary":{"en":"An overhauler is someone (or a company) that does major repairs and rebuilding to restore equipment to good working condition.","zh":"overhauler 指进行重大检修与翻修的人或公司，把设备恢复到良好可用状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that overhauls (carefully repairs, rebuilds, and improves) machines, vehicles, or systems","zh":"负责大修、翻修（彻底检修、重建并改进）机器、车辆或系统的人或公司"},"examples":[{"en":"We hired an overhauler to rebuild the airplane engine.","zh":"我们雇了一家大修厂来重建这台飞机发动机。"},{"en":"The overhauler inspected the gearbox and replaced several worn parts.","zh":"大修技师检查了变速箱并更换了几个磨损的零件。"},{"en":"Choose a certified overhauler if the equipment is used for safety-critical work.","zh":"如果设备用于安全关键的工作，最好选择有认证的大修单位。"}]}],"synonyms":["rebuilder","repair shop","maintenance contractor","refurbisher","service provider"],"phonetic":"/ˌoʊvɚˈhɔlər/","extraExplanation":["“overhauler”来自动词“overhaul”。在航空、船舶、重型机械等领域很常见，常指能进行“拆解—检测—更换/修复—重新装配—测试”的专业单位或人员。","在一些行业语境里，overhauler不仅是“修理”，而是“按标准恢复到接近新机/合格状态”的系统性大修（常与例行维护 maintenance 区分）。"]}
{"word":"overhauling","summary":{"en":"Overhauling means making major improvements or doing a thorough repair/inspection of something, especially systems, organizations, or machines.","zh":"overhauling 指对系统/组织进行大幅改革更新，或对机器设备进行全面检修（大修）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making big changes to improve something; reforming or updating it a lot","zh":"对……进行大幅度改造/改革；大规模更新以提升效果"},"examples":[{"en":"The company is overhauling its customer service system.","zh":"这家公司正在大幅改革它的客服系统。"},{"en":"They’re overhauling the rules to make them fairer.","zh":"他们正在大幅修改规则，让它更公平。"}]},{"partOfSpeech":"v.","definition":{"en":"doing a thorough inspection and repair of a machine, engine, or system","zh":"对机器/发动机/系统进行全面检修与修理（大修）"},"examples":[{"en":"The mechanic is overhauling the engine after the breakdown.","zh":"车辆抛锚后，修理工正在对发动机进行大修。"},{"en":"The plane is overhauling its navigation system during maintenance.","zh":"飞机在维护期间正在对导航系统进行全面检修升级。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of making major improvements or repairs (the act of ‘overhaul’)","zh":"大改造/大修的过程（overhaul 的动名词用法）"},"examples":[{"en":"The overhauling of the curriculum will take a full year.","zh":"课程体系的全面改革将花整整一年。"}]}],"synonyms":["revamping","reforming","restructuring","renovating","upgrading","refurbishing","overhauling (machine)","rebuilding"],"phonetic":"/ˌoʊvərˈhɔlɪŋ/","extraExplanation":["“overhauling”常用于两大语境：1）制度/组织/流程的“彻底改革”；2）设备/发动机的“全面检修（大修）”。语气通常比“improving”更强，暗示问题较大或改动范围很广。","在商业与新闻中常见搭配：overhauling a system/policy/department；在工程领域常见：overhauling an engine/gearbox/aircraft。"]}
{"word":"overhauls","summary":{"en":"“Overhauls” means major repairs or big reforms/updates, or the act of making those major improvements (third-person singular).","zh":"“overhauls”表示“大修/全面改革（复数）”，也可作动词第三人称单数，表示“对……进行大修/彻底改造”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Major repairs or redesigns that improve something by fixing problems or updating it.","zh":"（复数名词）大修；彻底检修；全面改造（通过修复问题或更新来改进某物）。"},"examples":[{"en":"The airline scheduled overhauls for several planes during the winter.","zh":"这家航空公司安排在冬季对几架飞机进行大修。"},{"en":"After a few security incidents, the company announced overhauls to its safety rules.","zh":"发生几起安全事件后，公司宣布对安全规定进行全面改革。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) Makes major repairs or big changes to something to improve it.","zh":"（动词第三人称单数）对……进行大修；彻底改革；全面改造（以改进）。"},"examples":[{"en":"The mechanic overhauls the engine every two years.","zh":"修理工每两年对发动机进行一次大修。"},{"en":"The government overhauls the education system to reduce inequality.","zh":"政府对教育体系进行全面改革，以减少不平等。"}]}],"synonyms":["major repairs","refits","renovations","reforms","revamps"],"phonetic":"/ˈoʊvərˌhɔlz/","extraExplanation":["“overhaul”常用于两类语境：①机械/设备（如发动机、飞机）=“大修、彻底检修”；②制度/组织/计划（如政策、系统）=“全面改革/改造”。语气通常比“change”更强，强调“动大手术式的更新”。","词源上可追溯到航海用语，原意与把绳索“拉过来并检查/整理”有关，因此带有“拉出来、彻底检查并修整”的感觉。"]}
{"word":"overhead","summary":{"en":"Overhead means (1) above your head, (2) above/upper as an adjective, or (3) business operating costs not directly tied to a specific product/service.","zh":"Overhead 可指（1）头顶上方，（2）上方的/顶部的（形容词），或（3）企业的间接成本/管理费用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Above your head; in the air or on/near the ceiling.","zh":"在头顶上方；在空中；在（或靠近）天花板处。"},"examples":[{"en":"A plane flew overhead.","zh":"一架飞机从头顶飞过。"},{"en":"The light overhead is too bright.","zh":"头顶的灯太亮了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located above; higher than something else (often used before a noun).","zh":"在上方的；高于……的（常作定语）。"},"examples":[{"en":"There’s an overhead compartment on the plane.","zh":"飞机上有头顶行李舱。"},{"en":"Look at the overhead cables.","zh":"看看上方的电缆。"}]},{"partOfSpeech":"n.","definition":{"en":"Ongoing business costs that are not directly tied to making a specific product or service (e.g., rent, utilities, salaries).","zh":"（企业）间接成本／管理费用：不直接用于某件产品或服务的固定或持续开支（如房租、水电、行政人员工资等）。"},"examples":[{"en":"We need to cut overhead to stay profitable.","zh":"我们需要削减管理费用才能保持盈利。"},{"en":"Rent is our biggest overhead cost.","zh":"房租是我们最大的间接成本。"}]}],"synonyms":["above","aloft","upper","operating costs","fixed costs"],"phonetic":"/ˈoʊvərˌhɛd/","extraExplanation":["在日常英语里，overhead（adv./adj.）通常指“在头顶上方”，很常见于交通与建筑语境：a helicopter overhead（头顶盘旋的直升机）、overhead lights（顶灯）。","在商业语境里，overhead（n.）常与 costs/expenses 连用。它强调“不是某个项目的直接材料或工时”，而是维持运营的固定/间接开支，因此常出现在财务报表、公司管理讨论中。"]}
{"word":"overheadiness","summary":{"en":"Overheadiness (rare) means having or showing high overhead (indirect costs), especially in business.","zh":"overheadiness（罕见）指“间接成本/管理费用偏高”的状态，尤用于商业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The quality or state of having high overhead—large indirect costs such as rent, administration, or utilities, especially in a business or organization.","zh":"（罕见）“间接成本/管理费用很高”的状态或特征，尤指企业或组织中如房租、行政、人事、水电等不直接产生产品或服务的支出占比较大。"},"examples":[{"en":"The startup’s overheadiness came from expensive office space and too many support roles.","zh":"这家初创公司的“间接成本偏高”主要来自昂贵的办公空间和过多的支持岗位。"},{"en":"They reduced overheadiness by moving to a smaller office and outsourcing payroll.","zh":"他们通过搬到更小的办公室、把薪资核算外包来降低间接成本的负担。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) The feeling or fact of something being overhead (above you).","zh":"（极罕见）某物在头顶上方的状态或感觉。"},"examples":[{"en":"Birdwatchers looked up at the overheadiness of the circling hawk.","zh":"观鸟者抬头看着在头顶盘旋的鹰。"}]}],"synonyms":["high overhead","heavy overhead","overhead burden","administrative overhead"],"phonetic":"/ˌoʊvərˈhɛdinəs/","extraExplanation":["“overheadiness”不是常见标准词，日常与商业写作里更常说：high overhead、overhead costs、heavy overhead、a lot of overhead。","构词上是 overhead + -iness（表示“……的性质/状态”），因此读者通常能理解，但正式写作可能显得不地道。"]}
{"word":"overheadman","summary":{"en":"A (rare) term for a worker who operates or manages equipment above a stage or other overhead systems.","zh":"（较少见）指在上方作业的人，常见于剧场/舞台上方设备（灯光、吊挂、布景）的工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Theater/film, technical) A stagehand who works above the stage (on the grid or catwalks), handling overhead equipment such as lighting, rigging, or scenery.","zh":"（剧场/影视技术用语）在舞台上方（网架/走道等）工作的舞台工作人员，负责灯光、吊挂装置或布景等上方设备。"},"examples":[{"en":"The overheadman checked the rigging before the curtain went up.","zh":"开演前，上方工作人员检查了吊挂装置。"},{"en":"If a light fails, the overheadman can swap it from the catwalk.","zh":"如果灯坏了，上方工作人员可以在走道上更换。"}]},{"partOfSpeech":"n.","definition":{"en":"(General, rare) A person who works with or supervises overhead systems, such as overhead cables or electrical lines.","zh":"（一般用法，较少见）从事或负责上方系统（如架空电缆、架空电力线路）的人。"},"examples":[{"en":"The overheadman inspected the overhead wires after the storm.","zh":"暴风雨后，他检查了架空线路。"}]}],"synonyms":["stagehand","rigger","flyman","lighting technician"],"phonetic":"/ˈoʊvərˌhɛdˌmæn/","extraExplanation":["这个词比较少见，更多是在特定行业里用：在剧场里，“overhead”指舞台上方的网架（grid）和走道（catwalk），因此 overheadman 往往相当于负责上方吊挂/灯具的工作人员。","日常英语里更常用的说法是 stagehand（舞台工作人员）、rigger（吊挂/索具工）、flyman（操作吊杆系统的人，英式/剧场用语常见）或 lighting technician（灯光技师），具体看职责。"]}
{"word":"overheads","summary":{"en":"Overheads are the ongoing, indirect costs needed to run a business or project, like rent and utilities.","zh":"Overheads 指企业或项目为维持运作所需的持续性间接费用，如房租、水电等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the regular, ongoing costs of running a business or organization (not directly tied to making a specific product or service), such as rent, utilities, or administrative salaries","zh":"（公司/机构的）管理费用、间接费用、日常运营成本（不直接对应某一件产品或服务的成本），如房租、水电、行政人员工资等"},"examples":[{"en":"Our overheads include rent, electricity, and office staff salaries.","zh":"我们的管理费用包括房租、电费和办公室员工工资。"},{"en":"To stay profitable, the company tried to cut overheads without lowering product quality.","zh":"为了保持盈利，公司试图在不降低产品质量的情况下削减间接费用。"},{"en":"High overheads can be difficult for small businesses to manage.","zh":"高额的运营成本会让小企业难以承受。"}]},{"partOfSpeech":"n.","definition":{"en":"costs or resources that are extra and indirect in a project, such as support staff time or shared equipment (often used in budgeting and accounting)","zh":"（项目的）附加/间接成本或资源消耗，如支持人员工时、共享设备等（常用于预算与会计）"},"examples":[{"en":"The grant covers materials, travel, and a portion of overheads.","zh":"这笔资助涵盖材料费、差旅费以及一部分间接费用。"},{"en":"Please list direct costs separately from overheads in the budget.","zh":"请在预算中把直接成本与间接费用分开列出。"}]}],"synonyms":["overhead costs","operating costs","fixed costs","indirect costs"],"phonetic":"/ˈoʊvərˌhɛdz/","extraExplanation":["“overheads”常用于英式/商用语境，尤指企业的固定或间接支出；美式也常说“overhead costs”或直接用“overhead”。","与“direct costs（直接成本）”相对：direct costs随产量变化更明显（如原材料），overheads通常更固定（如房租）。"]}
{"word":"overheady","summary":{"en":"Overheady means overly strong or intoxicating—so intense it can make you feel dizzy or not think clearly.","zh":"Overheady 指“过于强烈、使人上头”的，强到让人眩晕或难以保持清醒思考。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too strong, intoxicating, or exciting—so much that it makes you feel dizzy, overly emotional, or unable to think clearly.","zh":"（酒气、香味、情绪或气氛等）过于强烈、令人眩晕的；让人兴奋得头脑发热、难以冷静思考的。"},"examples":[{"en":"The overheady wine went straight to his head after just one glass.","zh":"这酒太烈了，他才喝一杯就上头了。"},{"en":"The overheady scent of the flowers filled the room and made her feel lightheaded.","zh":"花香太浓，充满整个房间，让她有点头晕。"},{"en":"The overheady excitement of the crowd made it hard to stay calm.","zh":"人群过度亢奋的气氛让人很难保持冷静。"}]}],"synonyms":["overpowering","intoxicating","overwhelming","too strong","heady"],"phonetic":"/ˌoʊvərˈhɛdi/","extraExplanation":["“overheady”由 over-（过度）+ heady（使人上头的、令人兴奋的）构成，强调“强到影响头脑状态”。它比 heady 更有“过头了”的感觉。","这个词不算常用，更常见的替代说法有：too strong / overpowering / intoxicating / overwhelming。文学或描写性文字里更容易见到。"]}
{"word":"overheap","summary":{"en":"Overheap means to pile up too much, literally or figuratively, and is relatively rare/old-fashioned.","zh":"overheap 指“堆得过多/过度堆积”，可用于字面或比喻意义，较少见且略带古雅色彩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to heap up too much; to pile more than is needed (often in a literary or old-fashioned style)","zh":"堆得过多；过度堆积（常见于文学或较古旧的用法）"},"examples":[{"en":"In his grief, he overheaped the grave with flowers.","zh":"在悲痛中，他在坟上堆了过多的花。"},{"en":"Don’t overheap your plate—take a little first, then get more if you want.","zh":"别把盘子盛得太满——先少拿一点，不够再添。"},{"en":"The essay overheaps the reader with details, making the main point hard to see.","zh":"这篇文章用过多细节“堆满”读者，反而让主旨不清。"}]}],"synonyms":["heap up","pile up","overload","overwhelm","lavish"],"phonetic":"/ˌoʊvɚˈhip/","extraExplanation":["“overheap”比较少见，更多时候英语会用更常见的表达：heap up too much / pile up too much，或在抽象意义上用 overwhelm（使不堪承受）来表达“信息、细节过多”。","在较旧的文学语境里，它也可带有“以过度的方式堆上/加上”的修辞色彩（例如过度的赞美、过度的礼物），类似于 overpraise / lavish。"]}
{"word":"overheaped","summary":{"en":"“Overheaped” means “piled up too much,” usually as the past form of the rare verb “overheap.”","zh":"“Overheaped”表示“堆得过多/过高”，通常是少见动词“overheap”的过去式或过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense / past participle of overheap) to pile something up too much; to load or cover with an excessively large heap.","zh":"（overheap 的过去式/过去分词）把……堆得过多；过量堆积或覆盖成一大堆。"},"examples":[{"en":"The workers overheaped the coal near the doorway, blocking the entrance.","zh":"工人把煤堆在门口堆得太多，把入口堵住了。"},{"en":"Her desk was overheaped with papers after the busy week.","zh":"忙碌的一周过后，她的桌子被文件堆得满满的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective, literary/rare) piled up in an excessive heap; heaped up too high.","zh":"（形容词，文学/少见）堆得过高的；堆得过量的。"},"examples":[{"en":"He stepped around the overheaped snow at the edge of the path.","zh":"他绕开小路边上堆得过高的积雪。"}]}],"synonyms":["piled up","heaped up","overloaded","overfilled"],"phonetic":"/ˌoʊvərˈhiːpt/","extraExplanation":["“overheaped”在现代英语里非常少见，更常用的表达是 “heaped up / piled up (too high)” 或 “overloaded”。","它带有一点书面语/文学色彩，偶尔会出现在较老的文本或较讲究的写作中，用来强调“堆得过头、夸张地堆起”的画面感。"]}
{"word":"overheaping","summary":{"en":"“Overheaping” means piling or filling something too much (rare; more common: “heap up,” “pile up,” “overload”).","zh":"“overheaping” 表示把东西堆得/装得过多（较少见；更常用：heap up、pile up、overload）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “overheap”) putting too much of something into a pile or place; piling up excessively.","zh":"（overheap 的现在分词）把某物堆得过多；过度堆积。"},"examples":[{"en":"He kept overheaping food on my plate, even after I said I was full.","zh":"我说我已经饱了之后，他还是不停地把食物往我盘子里堆。"},{"en":"Overheaping the cart with boxes made it hard to push.","zh":"把箱子过度堆在手推车上，让它很难推。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal/rare) extremely full or overloaded; filled beyond a normal or comfortable amount.","zh":"（非正式/少见）极其满的；超出正常或舒适程度的。"},"examples":[{"en":"The closet was overheaping with clothes, so the door wouldn’t close.","zh":"衣橱里衣服塞得满满当当，门都关不上。"}]}],"synonyms":["piling up","heaping up","overloading","overfilling","stuffing"],"phonetic":"/ˌoʊvɚˈhipɪŋ/","extraExplanation":["“overheap”本身在现代英语里比较少见，更常用的表达是 “pile up too much / heap up / overload / overfill”。在写作或口语中，如果想更自然，通常用这些更常见的动词短语。"]}
{"word":"overheaps","summary":{"en":"“Overheaps” usually means ‘piles up too much’ (a rare form of the verb “overheap”), or refers to over-stacked piles.","zh":"“overheaps”通常指“堆得过多”（动词 overheap 的少见形式），也可指堆得过高过满的大堆。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “overheap”) to pile up too much; to heap excessively or on top of something else.","zh":"（动词 overheap 的第三人称单数）堆得过多；过度堆积；堆在……之上。"},"examples":[{"en":"If she overheaps the cart, the groceries will fall out.","zh":"如果她把购物车堆得太满，杂货就会掉出来。"},{"en":"The storm overheaps the road with snow overnight.","zh":"暴风雪一夜之间把道路堆满了积雪。"}]},{"partOfSpeech":"n.","definition":{"en":"Large piles or mounds that are over-stacked (rare).","zh":"堆得过高、过满的大堆（少见用法）。"},"examples":[{"en":"They cleared the overheaps of debris after the flood.","zh":"洪水过后，他们清理了那些堆得过高的瓦砾堆。"}]}],"synonyms":["overfill","overload","pile up","heap up","stack up"],"phonetic":"/ˌoʊvərˈhiːps/","extraExplanation":["“overheaps”在现代英语里很少单独使用；更常见的是用更自然的表达，比如：overfill（装得太满）、pile up too much（堆太多）、heaps of / piles of（许多……）。","在文学或较旧的文本中，overheap/overheaps有时用来强调“堆得夸张、压得满满当当”的画面感。"]}
{"word":"overhear","summary":{"en":"Overhear means to hear something accidentally, often a private conversation not meant for you.","zh":"Overhear 指“无意中听到”，常用于听到不该或不需要你听到的私下谈话。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to hear something by chance, especially a private conversation, without the speakers knowing you can hear it","zh":"无意中听到（通常是私下谈话），说话的人不知道你听见了"},"examples":[{"en":"I overheard them talking about a surprise party for you.","zh":"我无意中听到他们在谈给你办惊喜派对。"},{"en":"She overheard a manager complaining about the staff.","zh":"她无意中听到一位经理在抱怨员工。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hear and understand a remark or comment that was not directed at you","zh":"听到并明白并非对你说的话/评论"},"examples":[{"en":"He overheard a joke on the bus and started laughing.","zh":"他在公交车上听到一个笑话就笑了起来。"}]}],"synonyms":["happen to hear","catch (a conversation)","hear by chance"],"phonetic":"/ˌoʊvərˈhɪr/","extraExplanation":["overhear 通常强调“偶然听到”，不是刻意偷听（eavesdrop）。如果你想表达“故意偷听”，更常用 eavesdrop（语气更负面）。","常见搭配：overhear someone talking/arguing; overhear a conversation; overhear that + 从句（如：I overheard that the store is closing）。"]}
{"word":"overheard","summary":{"en":"“Overheard” is the past tense/past participle of “overhear”: to hear something by chance, not intended for you.","zh":"“overheard”是“overhear”的过去式/过去分词：指无意间听到别人说的话，并非专门说给你听。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to hear someone’s conversation or remark by chance (often without meaning to), especially when it was not intended for you","zh":"（常指无意间）偷听到、偶然听到别人的谈话或话语，尤其是原本不是对你说的"},"examples":[{"en":"I overheard two coworkers talking about a new manager.","zh":"我无意间听到两位同事在聊一位新经理。"},{"en":"She overheard her name and stopped to listen.","zh":"她无意间听到自己的名字，就停下来听。"},{"en":"I didn’t mean to overhear—you were speaking right next to me.","zh":"我不是故意偷听的——你们就在我旁边说话。"}]},{"partOfSpeech":"adj.","definition":{"en":"heard by chance (not planned or directed at you)","zh":"被偶然听到的；无意间听见的（不是专门说给你听的）"},"examples":[{"en":"An overheard comment can easily be misunderstood.","zh":"一句被人无意听到的话很容易被误解。"},{"en":"He repeated an overheard rumor at lunch.","zh":"他在午饭时重复了一条无意听来的传闻。"}]}],"synonyms":["hear by chance","catch","happen to hear","pick up (informal)"],"phonetic":"/ˌoʊvərˈhɪr/","extraExplanation":["“overhear”由 over-（在旁边、越过）+ hear（听见）组成，常用于说明“不是刻意去听”的情境。要强调“故意偷听”，更常用 eavesdrop。","语气上，“overhear”通常比“eavesdrop”中性：你可以只是刚好听到，并不一定有不礼貌或窥探的意思。","常见搭配：overhear someone doing sth（无意听到某人在做某事时说话）、overhear a conversation/remark（无意听到一段谈话/一句话）。"]}
{"word":"overhearer","summary":{"en":"An overhearer is a person who accidentally hears something not meant for them.","zh":"overhearer 指“无意中听到别人不想让你听到的内容的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who hears something by accident or without being intended as a listener (someone who overhears).","zh":"无意中听到别人谈话的人；旁听者（并非对方本意要让他听到）。"},"examples":[{"en":"An overhearer caught a few words of their private conversation.","zh":"有个无意的听者听到了他们私下谈话的几句话。"},{"en":"Be careful—there may be overhearers in a crowded café.","zh":"在拥挤的咖啡馆要小心——可能会有旁听的人。"}]}],"synonyms":["eavesdropper","listener","bystander"],"phonetic":"/ˌoʊvərˈhɪrər/","extraExplanation":["“overhearer”由动词“overhear（无意中听到）”加上表示“做某事的人”的后缀“-er”构成。实际使用中更常见的表达是“someone who overheard”或直接用动词“overhear”。“overhearer”相对少见，偏书面或为了强调“那个听到的人”而使用。"]}
{"word":"overhearing","summary":{"en":"“Overhearing” means accidentally (or sometimes intentionally) hearing something you weren’t meant to hear; it can also be the -ing form of “overhear.”","zh":"“overhearing”指无意（有时也可能是有意）听到本不该让你听到的话；也可作“overhear”的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of hearing something that you were not meant to hear, usually by chance (or sometimes on purpose)","zh":"（通常是无意、也可能是有意地）听到本不该让你听到的内容；偷听到的行为"},"examples":[{"en":"Overhearing their conversation made me realize the meeting had been canceled.","zh":"无意间听到他们的谈话，我才知道会议取消了。"},{"en":"She felt embarrassed after overhearing a private phone call.","zh":"她偷听到一通私人电话后感到很尴尬。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “overhear”: to hear someone speaking without meaning to, especially when it was not intended for you","zh":"“overhear”的现在分词：无意间听到（尤指别人并不想让你听见的话）"},"examples":[{"en":"I was overhearing bits of their discussion while waiting in line.","zh":"我排队时无意间听到了他们讨论的一些片段。"},{"en":"He apologized for overhearing and walked away.","zh":"他为自己无意听到而道歉，然后走开了。"}]}],"synonyms":["eavesdropping","listening in","catching (a conversation)","overhearing (a remark)"],"phonetic":"/ˌoʊvərˈhɪrɪŋ/","extraExplanation":["“overhear”通常强调“无意听到”，比“eavesdrop”（偷听、窃听）更中性；如果是刻意躲在一旁听，多用“eavesdrop on”。"]}
{"word":"overhears","summary":{"en":"“Overhears” means “he/she/it hears something unintentionally,” and it can also imply secretly hearing a private conversation.","zh":"“overhears”是“overhear”的第三人称单数，表示“无意中听到”，也可指“偷听”私密谈话。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to hear what someone says without intending to listen (often by accident)","zh":"无意中听到；偶然听见（通常不是故意听的）"},"examples":[{"en":"I overhears nothing when I have my headphones on.","zh":"我戴着耳机时什么也听不到（更不可能无意中听见）。"},{"en":"She overhears her coworkers talking about a surprise party.","zh":"她无意中听到同事们在聊一个惊喜派对。"},{"en":"He overhears a conversation on the bus and learns the schedule has changed.","zh":"他在公交车上无意中听到一段对话，才知道时间表变了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hear someone’s private conversation secretly (often implying you should not be listening)","zh":"偷听（带有“不该听却听了”的含义）"},"examples":[{"en":"He overhears their argument from behind the door.","zh":"他躲在门后偷听他们争吵。"},{"en":"It’s rude to overhear people’s private conversations and repeat them.","zh":"偷听别人的私密谈话还到处复述是很不礼貌的。"}]}],"synonyms":["hear by chance","catch","eavesdrop (when secret/rude)"],"phonetic":"/ˌoʊvərˈhɪr/","extraExplanation":["“overhears”是动词“overhear”的第三人称单数现在时（he/she/it overhears）。在口语和写作里，更常见的词典形式是原形“overhear”。","注意不要把“overhear（无意中听到/偷听）”和“hear about（听说）”混淆：hear about 表示通过别人或消息得知某事。"]}
{"word":"overheartily","summary":{"en":"“Overheartily” means doing something too warmly or enthusiastically, often in an excessive or awkward way.","zh":"“overheartily”表示“过于热情/过分热烈地”，常带“过头了、有点尴尬或不合适”的语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too hearty, enthusiastic, or friendly; excessively or more strongly than is appropriate.","zh":"过于热情地；过分热烈地；（热情或友好）超过恰当程度地。"},"examples":[{"en":"He laughed overheartily at the joke, and everyone turned to look.","zh":"他对那个笑话笑得过于夸张，大家都转头看他。"},{"en":"She thanked the host overheartily, which made the moment feel awkward.","zh":"她对主人道谢得过分热烈，反而让气氛有点尴尬。"},{"en":"The reviewer praised the movie overheartily, ignoring its obvious flaws.","zh":"那位影评人把电影夸得过头了，连明显的缺点都忽略了。"}]}],"synonyms":["overly","too enthusiastically","excessively","too warmly"],"phonetic":"/ˌoʊvərˈhɑrtəli/","extraExplanation":["“over-”这个前缀常表示“过度、过分”（如: overreact 反应过度, overconfident 过度自信）。因此 overheartily 往往带一点负面或批评意味：不是单纯“很热情”，而是“热情得不合时宜/让人不舒服”。","该词在现代口语中不算常见；更常见的替换说法有 too enthusiastically（太热情地）、a bit too warmly（有点过分热情地）、overly enthusiastically（过度热情地）。"]}
{"word":"overheartiness","summary":{"en":"Overheartiness means being too friendly or enthusiastic in a way that may feel uncomfortable or insincere.","zh":"Overheartiness 指“过分热情/过度亲热”，让人觉得不自在或不够真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive friendliness, warmth, or enthusiasm that can feel insincere or intrusive","zh":"过分热情（过度友好、亲热或热心，可能让人觉得不真诚或有点冒犯）"},"examples":[{"en":"Her overheartiness with new coworkers made some people uncomfortable.","zh":"她对新同事过分热情，让一些人觉得不太舒服。"},{"en":"The host’s overheartiness felt more like a sales pitch than genuine welcome.","zh":"主人的过分热情更像在推销，而不是真心欢迎。"}]}],"synonyms":["overfriendliness","excessive warmth","effusiveness","overenthusiasm"],"phonetic":"/ˌoʊvərˈhɑrtinəs/","extraExplanation":["“overheartiness”并不是非常常见的词，更常见的表达是“overfriendliness（过分友好）”“excessive enthusiasm（过度热情）”“overly warm（过于热情的）”。它通常带有轻微的负面评价，强调“热情过头”导致别人有压力或不自在。","构词上可理解为 over-（过度）+ hearty（热情的、真诚友好的）+ -ness（名词后缀）。在写作中它偏书面/描写性，常用于刻画人物社交方式。"]}
{"word":"overhearty","summary":{"en":"“Overhearty” means overly warm or enthusiastic in a way that can feel too much.","zh":"“overhearty”指“热情过头”，可能显得唐突、用力过猛或不真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too hearty or enthusiastic in a way that feels excessive, pushy, or insincere; overly friendly or boisterous.","zh":"过分热情的；热情得有点过头，让人觉得唐突、用力过猛或不真诚。"},"examples":[{"en":"His overhearty welcome made the new employee feel a little uncomfortable.","zh":"他过分热情的欢迎让新员工有点不自在。"},{"en":"The sales pitch sounded overhearty, like the compliments were rehearsed.","zh":"那段推销听起来热情过头，夸奖像是背好的台词。"},{"en":"She avoided being overhearty and gave a calm, polite greeting instead.","zh":"她避免显得过分热情，而是给了一个冷静、有礼的问候。"}]}],"synonyms":["overfriendly","too enthusiastic","effusive","overzealous","boisterous"],"phonetic":"/ˌoʊvərˈhɑrti/","extraExplanation":["“overhearty”由“over-（过度）+ hearty（热情的/真诚的）”组成，语气偏负面：不是“很热情”，而是“热情到让人不舒服”。","常见搭配：an overhearty welcome/handshake/greeting（过分热情的欢迎/握手/问候）、overhearty laughter（过于放肆的笑）。正式写作中也可用更常见的表达如 “overly enthusiastic / too effusive / overfriendly”。"]}
{"word":"overheat","summary":{"en":"Overheat means to become too hot (for people/animals) or to make something, especially a machine, too hot; it can also name the state of excessive heat.","zh":"overheat 表示（人/动物）过热，或使（尤指机器）过热；也可指“过热”这一状态。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a person or animal) to become too hot, often because of exercise, weather, or poor ventilation; to get dangerously hot.","zh":"（人或动物）过热、热得受不了；常因运动、天气炎热或通风不良而导致，严重时可能有危险。"},"examples":[{"en":"Make sure you drink water so you don’t overheat during the hike.","zh":"徒步时要记得喝水，免得你过热。"},{"en":"Babies can overheat easily in a warm car.","zh":"婴儿在温暖的车里很容易过热。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something (especially a machine or engine) become too hot; to cause overheating.","zh":"使（尤指机器或引擎）过热；导致温度过高。"},"examples":[{"en":"The old laptop can overheat if you block the fan.","zh":"如果把风扇出风口挡住，这台旧笔记本电脑可能会过热。"},{"en":"Don’t overheat the oil, or it may start to smoke.","zh":"别把油加热过头，不然可能会冒烟。"}]},{"partOfSpeech":"n.","definition":{"en":"A condition in which a machine or engine becomes too hot; overheating.","zh":"（机器或引擎的）过热状态；过热。"},"examples":[{"en":"The car stopped because of engine overheat.","zh":"车因为引擎过热而熄火了。"}]}],"synonyms":["overwarm","get too hot","overheat (v.)","overheat (n.)","overheat (condition)"],"phonetic":"/ˌoʊvɚˈhit/","extraExplanation":["常见搭配：overheat quickly（很快过热）、overheat easily（容易过热）、overheat alarm/light（过热警报/指示灯）、overheat protection（过热保护）。","和 heat up 的区别：heat up 多指“加热/变热”（中性或正常），overheat 强调“热过头、超过安全或舒适范围”，常带负面后果。","写作提示：描述设备问题时常用 “overheat and shut down”（过热并自动关机/停机）。"]}
{"word":"overheated","summary":{"en":"“Overheated” means too hot (for people, machines, or heated food) or describes something that became too hot.","zh":"“overheated”表示“过热的/太烫的”，可用于人、机器或被加热的食物；也可作动词过去式/过去分词表示“（使）过热”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too hot; having become hotter than normal or safe (often because of heat, stress, or heavy use).","zh":"过热的；热得不正常或不安全的（常因高温、压力或过度使用导致）。"},"examples":[{"en":"The engine shut down because it was overheated.","zh":"发动机因为过热而停止运转。"},{"en":"After running in the sun, I felt overheated and dizzy.","zh":"在太阳下跑步后，我觉得过热而头晕。"},{"en":"The computer got overheated, so I turned it off to cool down.","zh":"电脑过热了，所以我把它关掉让它降温。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made too hot by heating for too long or at too high a temperature.","zh":"（加热过度而）烧得太热的；加热时间过长或温度过高的。"},"examples":[{"en":"The soup tastes a bit overheated and salty.","zh":"这汤有点煮过头了，还偏咸。"},{"en":"Be careful—this milk is overheated for a baby.","zh":"小心——这牛奶对宝宝来说太烫了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overheat”: to become too hot or to make something too hot.","zh":"“overheat”的过去式/过去分词：过热；使……过热。"},"examples":[{"en":"The machine overheated during the test.","zh":"机器在测试过程中出现了过热。"},{"en":"I overheated the pan and burned the oil.","zh":"我把锅烧得太热，把油烧糊了。"}]}],"synonyms":["too hot","overwarm","heated","burning","hot"],"phonetic":"/ˌoʊvɚˈhiːtɪd/","extraExplanation":["“overheated”常见于两类语境：①机械/电子设备（engine, motor, laptop, battery）②人体状态（feel overheated）。在人身上也可引申为“情绪过于激动/紧张”（an overheated argument 指“火药味很浓的争论”）。","词形提示：over-（过度）+ heat（加热/热）。对应名词常用 overheating（过热现象），动词原形 overheat。"]}
{"word":"overheatedly","summary":{"en":"“Overheatedly” means doing or speaking in an overly intense or emotional way; less commonly, in a too-hot way.","zh":"“overheatedly”指以过于激烈或情绪化的方式行事/说话；较少见时也可指“过热地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too emotional, excited, angry, or intense (as if “overheated”).","zh":"以过于激动、愤怒或紧张的方式（像“过热”一样）。"},"examples":[{"en":"She responded overheatedly to a small criticism.","zh":"她对一点小小的批评就过激地回应。"},{"en":"The two sides argued overheatedly, so the meeting ended early.","zh":"双方争论得过于激烈，所以会议提前结束了。"},{"en":"Try not to speak overheatedly when you’re tired.","zh":"你累的时候尽量不要用过激的语气说话。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that involves being too hot (used less commonly, usually about machines or places).","zh":"以过热的方式（较少见，通常形容机器或环境过热）。"},"examples":[{"en":"The engine ran overheatedly after the cooling fan failed.","zh":"冷却风扇坏了之后，引擎运转得过热。"},{"en":"The room felt overheatedly warm even with the window open.","zh":"即使开着窗，房间也热得过头。"}]}],"synonyms":["heatedly","excitedly","emotionally","intensely","angrily"],"phonetic":"/ˌoʊvərˈhitɪdli/","extraExplanation":["“overheatedly”来自形容词“overheated（过热的；情绪过激的）+ -ly（副词后缀）”。在日常英语里，它更常用在比喻意义：形容说话、争论、反应“火气很大/情绪上头”。字面“温度过热”的用法相对少见，通常会改用更自然的表达，比如“too hot”或“overheating”。"]}
{"word":"overheating","summary":{"en":"Overheating means becoming too hot, often causing danger or malfunction; it’s used for people, machines, and sometimes the economy.","zh":"Overheating 指“过热/温度过高”，常用于人和机器（甚至也可指“经济过热”），强调可能带来危险或故障。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition of becoming too hot; an excessive rise in temperature (of a person, machine, engine, room, etc.).","zh":"过热；温度过高（指人、机器、发动机、房间等温度上升到不正常或危险的程度）。"},"examples":[{"en":"The laptop shut down because of overheating.","zh":"笔记本电脑因为过热而自动关机了。"},{"en":"Symptoms of overheating include dizziness and heavy sweating.","zh":"过热的症状包括头晕和大量出汗。"},{"en":"To prevent overheating, don’t block the air vents.","zh":"为防止过热，不要堵住散热孔。"}]},{"partOfSpeech":"adj.","definition":{"en":"Becoming too hot; getting warmer than is safe or normal.","zh":"正在过热的；热得超过安全或正常范围的。"},"examples":[{"en":"The overheating engine gave off a strange smell.","zh":"过热的发动机散发出一股怪味。"},{"en":"If the phone feels overheating, stop charging it for a while.","zh":"如果手机感觉在过热，先暂停充电一会儿。"}]}],"synonyms":["overheating","overheat (as a verb)","too hot","heat buildup","heatstroke (for people, related but not identical)"],"phonetic":"/ˌoʊvərˈhiːtɪŋ/","extraExplanation":["“over-”表示“过度/超过”，+ “heat”表示“加热/热量”，所以 overheating 字面意思是“过度变热”。常见于科技与健康语境：设备散热问题（overheating computer/engine）以及人体中暑风险（overheating in hot weather）。","在新闻与科普写作里，overheating 也常用于比喻：an overheating economy 指“经济过热”（增长过快、通胀压力大）。"]}
{"word":"overheats","summary":{"en":"“Overheats” means (something) gets too hot, or makes something get too hot.","zh":"“overheats”表示（某物）过热，或使某物过热。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a machine, engine, or device) to become too hot and stop working properly or risk damage.","zh":"（机器、发动机或设备）过热；变得太热而运转异常或可能损坏。"},"examples":[{"en":"The laptop overheats if I use it on a bed.","zh":"如果我把笔记本放在床上用，它就会过热。"},{"en":"The engine overheats when the cooling fan fails.","zh":"冷却风扇坏了时，发动机会过热。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something become too hot (often causing problems or damage).","zh":"使某物过热（常导致故障或损坏）。"},"examples":[{"en":"Don’t overheat the pan before adding oil.","zh":"加油之前不要把锅烧得过热。"},{"en":"Running heavy apps can overheat your phone.","zh":"运行大型应用可能会让你的手机过热。"}]}],"synonyms":["get too hot","run hot","heat up too much","overwarm"],"phonetic":"/ˌoʊvərˈhit/","extraExplanation":["“overheats”通常是动词“overheat”的第三人称单数现在时（He/She/It overheats）。常见搭配：overheat the engine（使发动机过热）、overheat quickly（很快过热）、overheat and shut down（过热并自动关机）。"]}
{"word":"overheave","summary":{"en":"Overheave means to heave excessively—either straining hard (sometimes retching/vomiting) or, in nautical use, surging heavily up and down.","zh":"Overheave 指“过度用力地抬/拉”（有时引申为干呕/呕吐）；在航海语境中指海面或船只“剧烈起伏、汹涌翻腾”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to heave too much or with excessive effort; sometimes used to mean to retch or vomit","zh":"用力过猛地举起/拉动；有时也指干呕或呕吐"},"examples":[{"en":"He overhea ved while trying to lift the heavy box by himself.","zh":"他一个人抬那个重箱子时用力过猛。"},{"en":"The smell made her overheave, and she had to step outside for air.","zh":"那股味道让她一阵干呕，只好出去透口气。"}]},{"partOfSpeech":"vi.","definition":{"en":"(nautical) to rise and fall heavily; to surge or swell","zh":"（航海）剧烈起伏；汹涌翻腾"},"examples":[{"en":"In the storm, the sea seemed to overheave under the ship.","zh":"暴风雨中，海面在船下方剧烈起伏。"},{"en":"The small boat overhea ved in the rough water.","zh":"小船在汹涌的水里上下颠簸。"}]}],"synonyms":["heave","strain","retch","surge","swell"],"phonetic":"/ˌoʊvɚˈhiːv/","extraExplanation":["“overheave”在现代日常英语里比较少见，更常见的表达是“strain” (用力过度)、“heave” (用力抬/拉) 或描述呕吐的“retch / vomit”。在文学或航海语境中，它更容易出现，用来形容海浪或船只的沉重起伏。"]}
{"word":"overheavily","summary":{"en":"Overheavily means “too heavily; excessively,” often describing something loaded, reinforced, or done with too much weight or force.","zh":"overheavily 表示“过于沉重地；过度地”，常用于描述装载、加固或施加重量/力度过头。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too heavily; more than is suitable or necessary (used to emphasize excess).","zh":"过于沉重地；过度地（强调“太……”，超过合适或需要的程度）。"},"examples":[{"en":"The backpack was overheavily loaded, so she could barely lift it.","zh":"背包装得过于沉重，她几乎抬不起来。"},{"en":"The door was overheavily reinforced, making it hard to open.","zh":"这扇门加固得过度，导致很难打开。"},{"en":"Don’t pack overheavily for a short trip—keep it simple.","zh":"短途旅行别打包得过于沉重——简单点就好。"}]}],"synonyms":["too heavily","excessively","overly","unduly"],"phonetic":"/ˌoʊvərˈhɛvəli/","extraExplanation":["“overheavily”并不常见；日常英语更自然的说法通常是“too heavily”或“excessively / overly”。例如：too heavily loaded / overly weighted。","它由 over-（过度）+ heavily（沉重地）构成，语气偏强调“超出正常/合理范围”，常见搭配有 loaded, reinforced, weighted, taxed 等。","注意不要和“overweight（超重的）/ overweightly（很少用）”混淆；“overheavily”更强调“做某事的程度过重”，不一定只指体重。"]}
{"word":"overheaviness","summary":{"en":"Overheaviness means an excessive or overly strong sense of heaviness, in weight or atmosphere.","zh":"overheaviness 指“过度的沉重”，可指重量过重或氛围/情绪过于压抑沉重。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive heaviness in weight, pressure, or feeling; being heavier than is comfortable or suitable (literal or figurative).","zh":"（字面或比喻）过度的沉重感；重量、压力或感受重得不合适/不舒服。"},"examples":[{"en":"The bag’s overheaviness made it hard to carry up the stairs.","zh":"包太沉了，上楼很难提。"},{"en":"After the argument, there was an overheaviness in the room, as if the air had thickened.","zh":"争吵之后，房间里有一种沉重的气氛，仿佛空气变得更凝重了。"}]}],"synonyms":["excessive heaviness","overweight","heaviness","weightiness","oppressiveness"],"phonetic":"/ˌoʊvɚˈhɛvinəs/","extraExplanation":["“overheaviness”并不常见，更自然的说法常用“excessive heaviness / too much weight”或在情绪氛围上用“a heavy feeling / heaviness in the air”。","构词法：over-（过度）+ heaviness（沉重）。因此它强调“超过正常/合适程度的沉重”。"]}
{"word":"overheavy","summary":{"en":"Overheavy means “too heavy,” often more than is comfortable or allowed.","zh":"overheavy 指“过重的、太重的”，常表示超过舒适或规定范围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too heavy; heavier than is comfortable, safe, or suitable for a particular use.","zh":"过重的；重得不舒服、不安全或不适合某种用途的。"},"examples":[{"en":"This suitcase is overheavy, so I’ll take some items out before the flight.","zh":"这个行李箱太重了，所以我会在坐飞机前拿出一些东西。"},{"en":"The backpack felt overheavy after a full day of hiking.","zh":"徒步一整天后，这个背包感觉太沉了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having more body weight than is ideal or allowed (less common; often replaced by “overweight”).","zh":"体重超标的（较少用；常用“overweight”代替）。"},"examples":[{"en":"He was told he was overheavy for that weight class.","zh":"有人告诉他，他的体重对那个级别来说超重了。"}]}],"synonyms":["too heavy","overweight","excessively heavy","heavy"],"phonetic":"/ˌoʊvɚˈhɛvi/","extraExplanation":["“over-”这个前缀常表示“过度、超过正常或允许范围”，例如 overeat（吃太多）、overwork（过度工作）、overloaded（超载）。因此 overheavy 的核心语感就是“重过头了”。","在日常英语中，描述行李或物品“太重”更常说 too heavy / overweight（尤其指行李超重）。形容人则一般用 overweight，而不是 overheavy。"]}
{"word":"overheight","summary":{"en":"Overheight means higher than allowed or standard, especially for vehicles or loads.","zh":"Overheight 指高度超过允许或标准，尤用于车辆或载货的“超高”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"taller than the allowed or standard height (especially for a vehicle, load, or structure).","zh":"（尤指车辆、载货或结构）高度超过允许或标准高度的。"},"examples":[{"en":"The truck was stopped because it was overheight for the tunnel.","zh":"这辆卡车被拦下了，因为它的高度超过了隧道允许的限高。"},{"en":"Overheight vehicles must use an alternate route.","zh":"超高车辆必须改走其他路线。"}]},{"partOfSpeech":"n.","definition":{"en":"the condition of being too tall or exceeding a height limit.","zh":"超高；高度超出限制的状态。"},"examples":[{"en":"Overheight is a common issue for loads carried on flatbed trucks.","zh":"对平板卡车运输的货物来说，“超高”是个常见问题。"}]}],"synonyms":["too tall","oversized (in height)","over-limit (height)"],"phonetic":"/ˌoʊvərˈhaɪt/","extraExplanation":["“overheight”常见于交通与工程语境（道路限高、桥梁/隧道净空、装载规范等）。在路牌或公告中常与“overheight vehicles（超高车辆）”一起出现。","拼写上也可见到带连字符的形式“over-height”。在口语或一般写作里，有时也会用“too tall / oversized (in height)”来表达类似意思。"]}
{"word":"overheighten","summary":{"en":"Overheighten means to exaggerate or make something seem more intense or important than it really is.","zh":"overheighten 指“夸大、渲染”，把某事说得或表现得比实际更强烈/更重要。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something stronger, more intense, or more important than it really is; to exaggerate","zh":"使某事显得更强烈/更重要；夸大，渲染"},"examples":[{"en":"The article overheightened the risks and caused unnecessary fear.","zh":"这篇文章夸大了风险，引起了不必要的恐慌。"},{"en":"Try not to overheighten small mistakes—everyone slips up sometimes.","zh":"别把小错误看得太严重——人人都有失误的时候。"},{"en":"The movie’s music overheightens the tension in the final scene.","zh":"电影的配乐在最后一幕把紧张感渲染得更强烈。"}]}],"synonyms":["exaggerate","overemphasize","overstate","magnify","inflate"],"phonetic":"/ˌoʊvərˈhaɪtən/","extraExplanation":["“overheighten”由 over-（过度）+ heighten（增强、提高）构成，常用于批评某种说法或表现“渲染过头、夸大其词”。在现代英语里，它比更常见的 “exaggerate / overemphasize / overstate” 更书面、更少见。"]}
{"word":"overheinous","summary":{"en":"“Overheinous” means extremely or excessively heinous (very evil or shocking). It’s rare and mainly used for emphasis.","zh":"overheinous 指“极其/过分恶劣、令人发指”，用法少见，主要用于强调语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely or excessively evil, wicked, or shocking; more heinous than usual (rare, often used for emphasis).","zh":"极其恶劣的；过分邪恶/骇人的（较少见，多用于强调）"},"examples":[{"en":"The judge called the crime overheinous and refused to show leniency.","zh":"法官称这起罪行极其恶劣，拒绝从轻处理。"},{"en":"Some readers felt the villain’s actions were so overheinous that the story stopped feeling realistic.","zh":"一些读者觉得反派的行为坏得过头了，故事反而不真实了。"}]}],"synonyms":["extremely heinous","utterly heinous","monstrous","atrocious","egregious","vile"],"phonetic":"/ˌoʊvərˈheɪnəs/","extraExplanation":["“overheinous”不是常见标准词汇，更像是把前缀 over-（“过度、太……”）加在 heinous（“恶劣的、令人发指的”）上形成的强调用法，多见于修辞、评论或创意写作。正式写作里更常用 “truly/utterly/especially heinous” 或 “extremely heinous”。","heinous 常与 crime（罪行）、act（行为）、offense（罪过）等搭配；overheinous 带有“坏到夸张”的语气，可能暗示说话者的强烈情绪或夸饰。"]}
{"word":"overheld","summary":{"en":"“Overheld” means “held too long,” often used for investments or things kept past the best time.","zh":"“Overheld”指“持有/保留过久”，常用于投资（如股票、仓位）或任何错过最佳时机的保留。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “overhold”) to have held something for too long, especially longer than is wise or appropriate.","zh":"（“overhold”的过去式/过去分词）持有（或握住、保留）某物过久，尤其指时间过长而不明智或不合适。"},"examples":[{"en":"He overheld the stock and missed the best time to sell.","zh":"他把那只股票持有过久，错过了最佳卖出时机。"},{"en":"The company overheld outdated inventory instead of clearing it.","zh":"公司把过时库存压得太久，而不是及时清理。"}]},{"partOfSpeech":"adj.","definition":{"en":"Held for too long; kept longer than necessary or advisable.","zh":"被持有/保留过久的；保存（压着）时间过长的。"},"examples":[{"en":"An overheld position can turn a small gain into a loss.","zh":"一个持有过久的仓位可能把小盈利变成亏损。"},{"en":"The sauce tasted bitter because it was overheld on the heat.","zh":"酱汁发苦，因为在火上放得太久了。"}]}],"synonyms":["held too long","kept too long","retained too long","overkept"],"phonetic":"/ˌoʊvərˈhɛld/","extraExplanation":["“overheld”在现代英语里不算常见，更常见的表达是“held too long / kept too long”。在金融语境（如股票、仓位、资产）里偶尔会见到“overhold / overheld”，用来强调“因贪心或犹豫而持有过久”。","构词上是 over-（过度）+ hold（持有/握住），语感类似于 overcook（煮过头）、overstay（逗留过久）。"]}
{"word":"overhelp","summary":{"en":"“Overhelp” means helping too much so it becomes unhelpful—often reducing someone’s independence or making things harder.","zh":"「overhelp」指「過度幫忙」，好意但幫太多反而造成反效果：讓人更依賴或把事情弄更麻煩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to help someone too much, in a way that reduces their independence, confidence, or ability to learn","zh":"過度幫忙；幫太多（反而讓對方更依賴、失去自信或學不到）"},"examples":[{"en":"If you overhelp your child with homework, they may not learn to solve problems on their own.","zh":"如果你在作業上過度幫孩子，他們可能學不會自己解題。"},{"en":"The manager meant well but overhelped, so the team stopped taking initiative.","zh":"主管本意是好的，但幫太多，結果團隊不再主動。"}]},{"partOfSpeech":"v.","definition":{"en":"to assist beyond what is needed, making a task slower, more complicated, or uncomfortable for others","zh":"幫過頭（超出需要，反而讓事情更慢、更複雜或讓人不自在）"},"examples":[{"en":"Thanks, but you’re overhelping—just let me carry the box myself.","zh":"謝了，但你幫過頭了——讓我自己搬就好。"},{"en":"He overhelped during the presentation and kept interrupting with “suggestions.”","zh":"他在簡報時幫過頭，一直插話給「建議」。"}]}],"synonyms":["overassist","enable","smother","coddle","do too much for someone"],"phonetic":"/ˌoʊvɚˈhɛlp/","extraExplanation":["「overhelp」不是最傳統、最固定的字典詞，但在口語與職場/教養語境中很常用，用來委婉地說「你幫得太多」。","常見搭配：overhelp someone / overhelp with something（如 overhelp with homework）。","語感上通常帶有「好意但造成反效果」的含意；更正式的近義說法可用: enable, smother, overassist（較少見）。"]}
{"word":"overhelpful","summary":{"en":"“Overhelpful” describes someone who helps too much, in a way that becomes unwanted or intrusive.","zh":"“Overhelpful” 指一個人幫忙過頭，變得不需要、打擾或反而礙事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trying to help so much that it becomes unnecessary, annoying, or gets in the way.","zh":"過度想幫忙，幫到不必要、讓人煩或反而礙事。"},"examples":[{"en":"He’s overhelpful in meetings—he answers questions that weren’t directed at him.","zh":"他在會議上很過度幫忙——問題不是問他，他也搶著回答。"},{"en":"The staff were kind but overhelpful, so I couldn’t browse in peace.","zh":"店員很親切，但有點過度幫忙，害我沒辦法安靜逛。"}]}],"synonyms":["too helpful","intrusive","meddlesome","interfering"],"phonetic":"/ˌoʊvɚˈhɛlpfəl/","extraExplanation":["“Over-”表示「過度、超過適當程度」。所以 overhelpful 通常帶一點負面語氣：不是說你不友善，而是「幫忙的方式或頻率不合時宜」。","在職場或服務情境裡，overhelpful 有時暗示「越俎代庖」或「搶功」：幫到把別人的工作或決定空間拿走了。","更委婉的說法可以用: a bit too helpful / well-meaning but intrusive（好意但有點打擾）。"]}
{"word":"overhelpfully","summary":{"en":"“Overhelpfully” means helping too much in an unwanted or annoying way.","zh":"“overhelpfully”指过分热心、帮得太多，以至于让人不需要或觉得被打扰。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that tries to help too much, especially when the help is unnecessary, unwanted, or becomes annoying.","zh":"以“帮过头”的方式；过分热心地（尤其指帮助不需要、别人不想要，甚至让人觉得烦）。"},"examples":[{"en":"He overhelpfully corrected my pronunciation in front of everyone.","zh":"他当着大家的面“好心过头”地纠正我的发音。"},{"en":"The app overhelpfully keeps popping up tips, even after I turned them off.","zh":"这个应用过分热心地一直弹出提示，即使我已经把提示关掉了。"},{"en":"She overhelpfully insisted on carrying my bag, even though I said I was fine.","zh":"她过分热心地坚持要帮我拎包，尽管我说我没事。"}]}],"synonyms":["too helpfully","overly helpfully","intrusively","meddlesomely"],"phonetic":"/ˌoʊvɚˈhɛlpfəli/","extraExplanation":["“overhelpfully”常带轻微负面语气：说话者通常觉得对方的帮助越界、打扰或显得居高临下。","在沟通中，如果想避免这种感觉，可以用更礼貌的方式确认：例如 “Do you want help?” “Would you like a suggestion?” 先征求同意再帮忙。"]}
{"word":"overhelpfulness","summary":{"en":"Overhelpfulness means helping too much in a way that can be unneeded or intrusive.","zh":"overhelpfulness 指“过度帮忙”，好心但可能多余、打扰或让人失去自主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The tendency to help too much, especially in a way that becomes unnecessary, intrusive, controlling, or prevents others from doing things themselves.","zh":"过度助人（过度帮忙）的倾向；指帮得太多，以至于变得多余、打扰人、带有控制性，或让对方失去自己完成事情的机会。"},"examples":[{"en":"Her overhelpfulness made her teammates feel like she didn’t trust them to handle their own tasks.","zh":"她的过度帮忙让队友觉得她不相信他们能处理好自己的任务。"},{"en":"In the meeting, his overhelpfulness came across as micromanaging.","zh":"在会议上，他的过度助人给人的感觉像是在事无巨细地管控。"},{"en":"Parents sometimes worry that overhelpfulness can reduce a child’s independence.","zh":"父母有时会担心过度帮忙会降低孩子的独立性。"}]}],"synonyms":["overhelping","being too helpful","intrusiveness","meddling","micromanagement (in work contexts)"],"phonetic":"/ˌoʊvɚˈhɛlpfəlnəs/","extraExplanation":["“overhelpfulness”通常带轻微负面含义：不是否定好心，而是强调“帮忙的方式或程度”不合适，可能让对方有压力、被打断，或失去自主与成长机会。","在职场与人际中，常和“boundary（界限）”“autonomy（自主）”“enable（纵容/让人依赖）”“micromanage（微观管理）”等概念一起出现。更自然的表达也常用“being too helpful / overhelping”。"]}
{"word":"overhie","summary":{"en":"“Overhype” means to promote something too much (verb), or the excessive publicity itself (noun).","zh":"“Overhype”指“过度炒作/过分宣传”（动词），也可指“过度宣传的热度本身”（名词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to publicize, praise, or promote something too much so that people’s expectations become unrealistically high","zh":"过度炒作；过分宣传（使大众期待不切实际地升高）"},"examples":[{"en":"The movie was overhyped, so many viewers felt disappointed.","zh":"这部电影被过度炒作，所以很多观众觉得失望。"},{"en":"Don’t overhype the new product before it’s ready.","zh":"产品还没准备好之前，别过度宣传。"}]},{"partOfSpeech":"n.","definition":{"en":"too much publicity or excitement about something, often more than it deserves","zh":"过度宣传；过度炒作（通常指超过其实际价值的热度）"},"examples":[{"en":"There was a lot of overhype around the singer’s debut.","zh":"那位歌手的出道被炒得很热。"},{"en":"Ignore the overhype and judge it for yourself.","zh":"别被过度宣传影响，自己判断就好。"}]}],"synonyms":["oversell","exaggerate","overpromote","overrate"],"phonetic":"/ˌoʊvərˈhaɪp/","extraExplanation":["你输入的“overhie”在英语里不常见，最可能是拼写成“overhype”。“hype”本身就有“炒作/大肆宣传”的意思，加上 over-（过度）就变成“过度炒作”。","在媒体、社交平台、广告语境里很常用，也常带一点批评意味：热度很高，但实际体验不一定配得上。"]}
{"word":"overhigh","summary":{"en":"“Overhigh” means excessively high—higher than normal or acceptable.","zh":"“overhigh”表示“过高的”，超过正常或可接受的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Higher than is normal, acceptable, or intended; excessively high.","zh":"高得过头的；超过正常、合理或预期的。"},"examples":[{"en":"The overhigh price made many customers walk away.","zh":"过高的价格让许多顾客转身离开。"},{"en":"An overhigh dose of medicine can be dangerous.","zh":"过高的药量可能很危险。"}]}],"synonyms":["too high","overly high","excessively high","unduly high","sky-high"],"phonetic":"/ˌoʊvɚˈhaɪ/","extraExplanation":["“overhigh”不是很常见的拼写；更常见的表达是“too high”或“overly high”。在某些写作中也会看到“over-high”（加连字符）来强调“过度”的意思。","构词上，“over-”常表示“过度/超过”（如 overconfident 过度自信、overpriced 定价过高），所以“overhigh”在理解上比较直观，但实际使用频率较低。"]}
{"word":"overhighly","summary":{"en":"“Overhighly” means “too highly; excessively,” usually about praising or judging something more than it deserves.","zh":"“overhighly”表示“过分地、过高地”，多用于形容对某事物的称赞或评价超过其应得程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too highly; more than is reasonable or deserved (often used before a past participle like “praised,” “rated,” or “valued”).","zh":"过分地；过高地（常用于修饰“praised / rated / valued”等过去分词，表示超过合理或应得的程度）。"},"examples":[{"en":"The movie is overhighly praised—it has some good moments, but it’s not perfect.","zh":"这部电影被过分吹捧了——有一些精彩片段，但并不完美。"},{"en":"She felt the job candidate was overhighly rated based on just one interview.","zh":"她觉得仅凭一次面试就把那位求职者评价得过高了。"},{"en":"Don’t overhighly value fame; it can be temporary.","zh":"别把名声看得过高；它可能是暂时的。"}]}],"synonyms":["too highly","excessively","overly","unduly","immoderately"],"phonetic":"/ˌoʊvərˈhaɪli/","extraExplanation":["“overhighly”较少见，更常见的写法是分开或加连字符：overly highly / over-highly，意思相同，但在现代英语中“overly”更口语、更常用。","语体上，“overhighly”更偏正式或书面表达，常见搭配包括：overhighly praised / overhighly regarded / overhighly valued。"]}
{"word":"overhill","summary":{"en":"Overhill can mean “beyond a hill” (literal) or “past one’s prime” (informal).","zh":"overhill 可指“在山丘那边/越过山丘”（字面），也可指“过了巅峰期、不再年轻”（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literal) Located beyond or on the far side of a hill; going over a hill.","zh":"（字面）在山丘的另一边；越过山丘的。"},"examples":[{"en":"The village lies overhill, so the road disappears behind the ridge.","zh":"村子在山丘那边，所以公路在山脊后面就看不见了。"},{"en":"We followed the trail overhill and into the next valley.","zh":"我们沿着小径翻过山丘，走进了下一个山谷。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, informal) Past one’s best years; no longer young or at one’s peak.","zh":"（比喻，非正式）过了巅峰期；不再年轻或不在最佳状态。"},"examples":[{"en":"He jokes that he’s overhill, but he still runs every morning.","zh":"他开玩笑说自己“过气/不再年轻”了，但他每天早上还是跑步。"},{"en":"In that industry, people are sometimes treated as overhill after forty.","zh":"在那个行业里，人们有时会在四十岁后被当作“过了黄金期”。"}]}],"synonyms":["over the hill","past one’s prime","beyond the hill","on the far side of the hill"],"phonetic":"/ˌoʊvɚˈhɪl/","extraExplanation":["“overhill”有时带一点文学或旧式用法的味道，字面义在描写自然景色时更常见。","比喻义更常见的说法通常是 “over the hill”，意思是“过了巅峰/不再年轻”，常带玩笑或自嘲语气；语气可能有点不礼貌，形容别人时要谨慎。","相关表达：over the hill（过了巅峰期）；over hill and dale（翻山越岭，穿过丘陵与山谷；偏文学/诗意）。"]}
{"word":"overhip","summary":{"en":"“Overhip” is an informal, nonstandard way to say something is excessively trendy or trying too hard to be cool.","zh":"“overhip”是非正式、非标准的说法，表示过于追求潮流、装酷过头。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Too fashionable or “trying too hard” to be trendy or cool; excessively hip.","zh":"（非正式／非标准用法）过于时髦、太“装酷”；过分追求潮流。"},"examples":[{"en":"That café is so overhip that it feels more like a photo studio than a place to relax.","zh":"那家咖啡馆太“过度潮”了，感觉更像摄影棚而不是放松的地方。"},{"en":"He dressed in an overhip style, but it didn’t match the formal event.","zh":"他穿得过于潮，但和正式场合不太搭。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The idea or style of being “too hip”; excessive trendiness.","zh":"（少见）“太潮”的风格或状态；过度时髦。"},"examples":[{"en":"Some people are tired of the overhip in advertising.","zh":"有些人厌倦了广告里的那种“过度潮”风格。"}]}],"synonyms":["overly trendy","too hip","trying too hard","excessively fashionable"],"phonetic":"/ˌoʊvərˈhɪp/","extraExplanation":["“overhip”不是常见的标准英语词，更像是把 over-（过度）+ hip（时髦、酷）临时拼出来的说法。写作中更常见、更自然的表达包括：overly trendy、too hip、trying too hard to be cool、excessively fashionable。","如果你是在社交媒体或口语里看到它，通常带一点调侃或批评意味：不是单纯“很时髦”，而是“时髦得有点用力过猛”。"]}
{"word":"overhit","summary":{"en":"“Overhit” means to hit something too hard or farther than intended, often causing a mistake or damage.","zh":"“overhit”指把某物打得太用力或打过头（超过预期距离），常导致失误或损坏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to hit something too hard, too much, or with too much force (often causing a mistake or damage)","zh":"（把……）打得太用力、打得过头（常导致失误或损坏）"},"examples":[{"en":"I overhit the nail and bent it.","zh":"我钉钉子时敲得太用力，把钉子敲弯了。"},{"en":"She overhit the ball and it went out of bounds.","zh":"她把球打得太猛，结果出界了。"},{"en":"Don’t overhit the keys—this old keyboard is fragile.","zh":"别把按键敲得太重——这个旧键盘很脆弱。"}]},{"partOfSpeech":"vt.","definition":{"en":"(in sports) to strike the ball farther than intended, usually beyond the target area","zh":"（体育）把球击得比预期更远（常打过界或超过目标区域）"},"examples":[{"en":"He overhit his drive and the ball landed in the rough.","zh":"他开球打过头，球落进了长草区。"},{"en":"I overhit the pass, so my teammate couldn’t reach it.","zh":"我传球传得太大力，队友追不上。"}]}],"synonyms":["hit too hard","strike too hard","overstrike","overshoot (in sports contexts)"],"phonetic":"ˌoʊvɚˈhɪt","extraExplanation":["“overhit”在日常英语里不算常见，更常见的表达是“hit too hard / hit it too hard”。在体育语境中也可能写成“over-hit”。","注意不要和“overheat”（过热）混淆：overhit是“打过头/击打过猛”，overheat是“变得太热/使过热”。"]}
{"word":"overhold","summary":{"en":"Overhold (rare) means to hold or delay something/someone for too long, or to keep holding on longer than appropriate.","zh":"Overhold（较少见）指过久地扣留/耽搁某人或某事，或不合适地继续持有、拖延太久。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to keep holding or keep someone/something waiting for too long; to delay by holding on longer than necessary","zh":"（过久地）扣留；拖延；让……等太久"},"examples":[{"en":"Sorry to overhold you—I just need one more signature.","zh":"抱歉让你久等（耽搁你了）——我还需要再签一个字。"},{"en":"Don’t overhold the meeting; people have trains to catch.","zh":"别把会议拖得太久；大家还要赶车。"}]},{"partOfSpeech":"vt.","definition":{"en":"to continue holding on (to something) longer than is appropriate","zh":"（不合适地）继续持有；抓住不放"},"examples":[{"en":"He overheld his anger and finally exploded.","zh":"他一直压着怒气，最后爆发了。"},{"en":"If you overhold this stock, you may miss a better chance to sell.","zh":"如果你这只股票拿太久，可能会错过更好的卖出时机。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) to last longer than expected; to be delayed","zh":"（罕见）拖得比预期更久；延误"},"examples":[{"en":"The interview overheld, so she arrived late to class.","zh":"面试拖得太久，所以她上课迟到了。"}]}],"synonyms":["hold up","delay","detain","keep waiting","prolong","hold over"],"phonetic":"ˌoʊvɚˈhoʊld","extraExplanation":["“overhold”在现代英语里比较少见，很多场合更常用的表达是：hold someone up（耽搁某人）、keep someone waiting（让某人久等）、hold over（延期/把某事推迟到以后）。","如果你想表达“租约到期后仍继续占用（房屋）”，法律/房地产语境更常见的是“hold over”（如：a holdover tenant），而不是“overhold”。"]}
{"word":"overholding","summary":{"en":"“Overholding” means staying in a rental property after the lease ends (a holdover situation).","zh":"“overholding”指租约到期后仍继续占用/居住在房屋里的“续占”情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, property) The act or situation of staying in a rented property after a lease has ended, without a new agreement; “holding over.”","zh":"（法律/房产）租约到期后仍继续占用或居住在房屋里、但未签订新租约的情况；“续占/到期不搬（holding over）”。"},"examples":[{"en":"The landlord filed a complaint because of the tenant’s overholding after the lease expired.","zh":"因为租客租约到期后仍不搬走（overholding），房东提出了投诉/起诉。"},{"en":"Overholding can create extra rent charges or legal risks for both sides.","zh":"到期不搬（overholding）可能导致额外租金费用，也会给双方带来法律风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a tenant or occupant who remains after the end of a lease or rental term; “holdover.”","zh":"形容租约期满后仍继续占住不搬的租客/占用者；“到期续占的/逾期不搬的”。"},"examples":[{"en":"An overholding tenant may be treated as a holdover tenant under local law.","zh":"在当地法律下，逾期不搬的（overholding）租客可能会被视为“holdover tenant（续占租客）”。"},{"en":"The contract explains what happens if an overholding occupant stays past the move-out date.","zh":"合同说明了如果住户到期仍续占（overholding），超过搬出日期会如何处理。"}]}],"synonyms":["holding over","holdover (situation)","remaining in possession","tenancy at sufferance (legal)"],"phonetic":"ˌoʊvərˈhoʊldɪŋ","extraExplanation":["“overholding”最常见于英美房东-房客语境与合同/法律文本中。日常口语里更常说 hold over / stay past the lease / not move out on time。","不同地区对“租约到期仍居住”的处理差异很大：可能形成按月续租（month-to-month tenancy），也可能被视为非法占用并触发驱逐程序（eviction）。具体后果通常取决于租赁合同条款与当地法规。"]}
{"word":"overholds","summary":{"en":"“Overholds” means ‘continues to hold/keep something beyond the normal time,’ and in legal rental contexts it can mean ‘stays in a property after the lease ends.’","zh":"“overholds”表示“超过通常期限仍继续持有/保留”；在租赁法律语境中也可指“租约到期后仍继续占用房屋”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To keep holding something beyond the usual time or limit; to hold over.","zh":"（罕见）把某物持有或控制超过通常的时间或期限；延长持有、继续占有。"},"examples":[{"en":"The library overholds old newspapers for research use instead of discarding them monthly.","zh":"图书馆为了研究用途，会把旧报纸保留更久，而不是每月就丢弃。"},{"en":"The committee overholds the decision until it has enough information.","zh":"委员会在信息足够之前暂缓作出决定。"}]},{"partOfSpeech":"vi.","definition":{"en":"(law, property) To remain in possession of rented property after a lease ends (to ‘hold over’).","zh":"（法律／房屋租赁）租约到期后仍继续占有或居住在租赁房屋内（即“到期不搬／继续占用”，hold over）。"},"examples":[{"en":"If a tenant overholds, the landlord may start a holdover proceeding.","zh":"如果租客到期仍不搬，房东可能会启动“到期占用”（holdover）相关的法律程序。"},{"en":"The lease says rent increases if the tenant overholds after the end date.","zh":"租约规定：若租客到期仍继续占用，租金将上调。"}]}],"synonyms":["hold over","keep","retain","continue to hold","remain in possession","detain"],"phonetic":"ˌoʊvɚˈhoʊld","extraExplanation":["“overholds”是动词“overhold”的第三人称单数现在时（he/she/it overholds）。这个词在日常英语中很少见；更常见的说法是“hold over / hold on to”。","在租赁语境里，更常见的名词说法是“holdover tenant”（到期仍占用的租客）以及“holdover”（到期占用的状态或案件）。不同州/地区法律细节不同，正式场合通常以当地法条用语为准。"]}
{"word":"overholiness","summary":{"en":"Overholiness means excessive or showy holiness, often suggesting self-righteousness.","zh":"overholiness 指过度或炫耀式的“虔圣”，常暗含自以为义、装道德的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or showy holiness; an attitude of being “too holy,” often implying self-righteousness or moral superiority.","zh":"过度（或炫耀式的）虔圣；“太圣洁”的姿态，常带有自以为义、道德优越感的贬义。"},"examples":[{"en":"He spoke with an air of overholiness that made everyone else feel judged.","zh":"他说话时带着一种过度虔圣的架势，让别人都觉得被审判。"},{"en":"The novel criticizes the overholiness of characters who preach kindness but act cruelly.","zh":"这部小说批评了那些口口声声讲仁慈、却行为刻薄的人身上的“过度虔圣”。"}]}],"synonyms":["sanctimoniousness","self-righteousness","holier-than-thou attitude","pietism"],"phonetic":"/ˌoʊvərˈhoʊlinəs/","extraExplanation":["“overholiness”较少见，多用于批评语境，强调“过头的圣洁/虔诚”，往往暗含“装出来的”“假虔诚”“道德姿态”的意思。","常见近义表达有：sanctimoniousness（假虔诚、装道德）、holier-than-thou attitude（自命清高的姿态）、self-righteousness（自以为是/自以为义）。日常英语更常用这些说法。"]}
{"word":"overhollow","summary":{"en":"Overhollow is a rare adjective meaning “too hollow,” literally (too deeply hollowed) or figuratively (empty/insincere in tone).","zh":"overhollow 是个很少见的形容词，表示“过于空/过于凹”，既可指字面上挖得太空，也可比喻语气空洞、不真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Too hollow; excessively hollow or deeply concave.","zh":"（罕见）太空的；过于中空的；凹得太深的。"},"examples":[{"en":"The craftsman rejected the bowl because the bottom was overhollow and too thin.","zh":"工匠拒收了这个碗，因为底部被挖得过空，太薄了。"},{"en":"The old tree had an overhollow trunk, making it unstable in strong wind.","zh":"那棵老树的树干中空得太厉害，大风时不稳。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative, rare) Empty-sounding or lacking sincerity; overly “hollow” in feeling.","zh":"（比喻，罕见）空洞的；缺乏真诚或实感的。"},"examples":[{"en":"His apology felt overhollow, as if he was saying the right words without meaning them.","zh":"他的道歉听起来很空洞，好像只是说对了话，却没有真心。"},{"en":"The speech was polished but overhollow, and the audience stayed unconvinced.","zh":"演讲很华丽却很空泛，听众仍不买账。"}]}],"synonyms":["overly hollow","too hollow","hollowed out","cavernous","empty","insincere"],"phonetic":"ˌoʊvɚˈhɑloʊ","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overhollow 直译就是“太空/太凹”。这个词在现代英语里非常少见，实际写作中更常用 overly hollow / too hollow，或用更自然的替代词（见同义词）。"]}
{"word":"overholy","summary":{"en":"Overholy means overly religious or morally strict in a showy, self-righteous way.","zh":"overholy 指“过分虔诚/道德洁癖”，常带贬义，强调自以为是、爱评判他人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"excessively or showily religious; self-righteous in a way that feels judgmental","zh":"过分虔诚的；（带贬义）过度表现宗教或道德上的“圣洁”，显得自以为是、爱评判他人"},"examples":[{"en":"He sounds overholy when he lectures everyone about what is “proper.”","zh":"他动不动就教训别人什么才“得体”，听起来就很“过分圣洁”、很爱说教。"},{"en":"She left the group because the atmosphere felt overholy and judgmental.","zh":"她离开了那个团体，因为氛围太“过分虔诚”，而且很爱评判人。"}]}],"synonyms":["self-righteous","holier-than-thou","sanctimonious","pious (often negative in context)"],"phonetic":"/ˌoʊvərˈhoʊli/","extraExplanation":["“over-”有“过度、太……”的意思，所以 overholy 通常不是夸奖，而是批评某人把“圣洁/道德正确”表现得过头，带有“装虔诚、装清高”的意味。","这个词更偏文学/较少见的用法；日常口语里更常用的表达是 holier-than-thou（自以为比别人更圣洁/更正确）或 self-righteous（自以为正义/道德感爆棚）。"]}
{"word":"overhomeliness","summary":{"en":"Overhomeliness means being excessively homely—either too plain/unattractive or too home-like and ordinary.","zh":"overhomeliness 指“过于 homely”的状态：要么过于朴素甚至显得不好看，要么过于家常、普通，缺少正式感或亮点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too homely—either too plain/unattractive in appearance or too simple and ordinary in style.","zh":"“过于朴素/不讨喜”的特质——外貌上可能显得太普通甚至不好看；风格上也可能过于简单、平常。"},"examples":[{"en":"The designer worried that the room’s overhomeliness would make the hotel feel cheap.","zh":"设计师担心房间过于“家常/朴素”，会让酒店显得廉价。"},{"en":"In the harsh review, her overhomeliness was contrasted with the lead actor’s glamour.","zh":"在那篇尖刻的影评里，她的“过于朴素（甚至不够好看）”被拿来和男主角的光彩照人作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"A (rare) way to describe something that feels excessively home-like, familiar, or cozy to the point of being unprofessional or lacking excitement.","zh":"（较少见）形容某物“过度像家里/过于熟悉或温馨”，以至于显得不够专业或缺乏新鲜感。"},"examples":[{"en":"The office’s overhomeliness made clients treat meetings too casually.","zh":"办公室过度“像家里”，让客户开会时变得过于随意。"},{"en":"Some readers found the novel’s overhomeliness comforting; others found it dull.","zh":"有些读者觉得小说的“过度家常感”很治愈；也有人觉得它无聊。"}]}],"synonyms":["plainness","dowdiness","over-simplicity","overly homey feeling","domesticity (when excessive)"],"phonetic":"/ˌoʊvərˈhoʊm linəs/","extraExplanation":["“overhomeliness”很少在现代英语中单独出现，更常见的是用“too homely / overly homey / overly domestic / too plain”等表达。","注意“homely”的英美差异：在美式英语里“homely”常指“相貌普通甚至不好看”；在英式英语里更常指“朴实、家常、温馨”。因此“overhomeliness”在不同语境下可能偏向“过于难看/土气”或“过于家常/不够正式”。"]}
{"word":"overhomely","summary":{"en":"Overhomely means excessively plain or overly domestic/familiar in style.","zh":"overhomely 指“过于朴素/土气”或“过于家常、过分居家化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too plain, simple, or ordinary in appearance; excessively “homely.”","zh":"（外表或风格）过于朴素、普通，甚至显得不够好看；过分“家常/朴实”。"},"examples":[{"en":"The hotel lobby felt overhomely, like a living room that never got redecorated.","zh":"酒店大堂显得过于家常朴素，像一个从不重新装修的客厅。"},{"en":"Her outfit was neat but a bit overhomely for a formal dinner.","zh":"她的穿着很整洁，但对正式晚宴来说有点过于朴素。"}]},{"partOfSpeech":"adj.","definition":{"en":"too focused on domestic details in an old-fashioned way; overly domestic or familiar.","zh":"（态度或风格）过于拘泥家务/家庭细节，显得老派或太“居家”。"},"examples":[{"en":"The speech became overhomely, dwelling on kitchens and curtains instead of policy.","zh":"这场演讲变得过于“居家”，一直谈厨房和窗帘，而不是政策。"},{"en":"He disliked the overhomely advice about settling down and buying furniture.","zh":"他不喜欢那些过于家常的建议，比如安定下来、买家具之类。"}]}],"synonyms":["too plain","overly domestic","overly simple","dowdy","unfashionable"],"phonetic":"/ˌoʊvərˈhoʊmli/","extraExplanation":["“over-”是常见前缀，表示“过度/太……”。因此 overhomely = “太 homely”。","注意美式英语里 homely 常指“相貌普通甚至不好看”；英式英语里 homely 更常指“温馨、像家一样舒适”。所以 overhomely 在不同语境下可能是“过于朴素/土气”，也可能是“过于家常/居家”。","这是个比较少见的词，更常见的替代表达有: too plain, overly domestic, overly simple."]}
{"word":"overhonest","summary":{"en":"Overhonest means too honest—so direct that it may be tactless or hurtful.","zh":"overhonest 指“过于诚实”，直白到可能显得不够得体或伤人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too honest in a way that may be blunt, tactless, or hurtful; more direct than the situation requires","zh":"过于诚实的；（说话）过分直白、缺乏圆融，可能让人受伤"},"examples":[{"en":"He’s overhonest—he’ll tell you your haircut looks bad even if you didn’t ask.","zh":"他太直白了——就算你没问，他也会说你的发型不好看。"},{"en":"I appreciate her honesty, but she can be overhonest at work and make meetings uncomfortable.","zh":"我欣赏她的诚实，但她在工作中有时太直白，会让会议气氛尴尬。"},{"en":"Try not to be overhonest when giving feedback; focus on what can be improved.","zh":"给反馈时别太直白；把重点放在如何改进上。"}]}],"synonyms":["too honest","blunt","tactless","brutally honest","overly candid"],"phonetic":"/ˌoʊvɚˈɑnɪst/","extraExplanation":["“over-”表示“过度、太……”，所以 overhonest 常带有轻微负面含义：不是赞美“非常诚实”，而是强调“诚实到不合时宜/不够体贴”。","日常英语里更常见的说法是 “too honest” 或 “brutally honest”。“overhonest”相对少见，写作时用更常用表达会更自然。"]}
{"word":"overhonestly","summary":{"en":"“Overhonestly” means speaking too honestly or too directly, often in a way that makes others uncomfortable.","zh":"“overhonestly”表示“过于诚实/过于直接地说”，常带有让人不舒服或不够体贴的含义。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too honest or too direct, sometimes causing discomfort or unintended harm.","zh":"过于诚实（或过于直接）地；坦白得有点过头，以至于可能让人不舒服或造成不必要的伤害。"},"examples":[{"en":"He answered overhonestly and hurt her feelings without meaning to.","zh":"他回答得过于诚实了，无意中伤害了她的感受。"},{"en":"I was overhonestly critical about the presentation, and the team got discouraged.","zh":"我对那次展示批评得过于直白，结果团队有点泄气。"},{"en":"She spoke overhonestly about his mistakes in front of everyone.","zh":"她当着所有人的面过于直白地谈他的错误。"}]}],"synonyms":["too honestly","overly honestly","with brutal honesty","too bluntly","overly bluntly"],"phonetic":"/ˌoʊvɚˈɑnəstli/","extraExplanation":["“overhonestly”不是特别常见，更自然的表达常用“too honestly / a little too honestly / with brutal honesty”。它带有一种语气：说真话本身没错，但“说的方式或场合”不够体贴。","使用时常暗示说话者缺少“tact（圆融/分寸）”。在职场或人际场景里，如果你想强调既诚实又照顾对方感受，可以用“honestly but tactfully（坦诚但有分寸）”。"]}
{"word":"overhonestness","summary":{"en":"Overhonestness means being too honest or too blunt, in a way that may hurt others or feel inappropriate.","zh":"overhonestness 指“过度诚实/过度直白”，直白到可能伤人或不合时宜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too honest or too direct, so that it may sound blunt, hurtful, or inappropriate in a situation","zh":"过度诚实；过度直白（直言不讳到可能显得冒犯、不合时宜）"},"examples":[{"en":"I appreciate your honesty, but sometimes your overhonestness can come across as rude.","zh":"我很欣赏你的诚实，但有时候你过度直白会让人觉得很没礼貌。"},{"en":"Her overhonestness made the feedback meeting uncomfortable.","zh":"她过度直白让那次反馈会议变得很尴尬。"},{"en":"A little tact can balance overhonestness in sensitive conversations.","zh":"在敏感话题里，一点分寸感可以平衡过度诚实。"}]}],"synonyms":["bluntness","tactlessness","brutal honesty","overfrankness"],"phonetic":"/ˌoʊvərˈɑnəstnəs/","extraExplanation":["“overhonestness”是一个相对少见、偏口语/临时造词（neologism）的表达，由 over-（过度）+ honest（诚实）+ -ness（名词后缀）组成。更常见、更自然的说法通常是“brutal honesty（残酷的诚实）”“being too blunt（太直白）”“lack of tact（缺乏分寸）”。","语气上，“overhonestness”往往带轻微批评：不是反对诚实本身，而是强调“场合、方式、边界”不合适。社交语境中常与 tact（得体/分寸）、diplomacy（圆融）、filter（说话前的‘过滤’）等词一起出现。"]}
{"word":"overhonesty","summary":{"en":"Overhonesty means being so honest that it becomes uncomfortable or unkind.","zh":"overhonesty 指“过度诚实”，诚实到让人不舒服或显得不够体贴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive honesty—being so direct or revealing so much truth that it becomes awkward, hurtful, or unnecessary.","zh":"过度诚实——说话过于直白或透露太多事实，以至于显得尴尬、伤人或没有必要。"},"examples":[{"en":"His overhonesty made the feedback meeting uncomfortable.","zh":"他过度诚实让反馈会议变得很不自在。"},{"en":"I appreciate honesty, but overhonesty can cross into rudeness.","zh":"我欣赏诚实，但过度诚实可能会变得无礼。"},{"en":"Her overhonesty about private details surprised everyone.","zh":"她对私密细节的过度坦白让大家都很惊讶。"}]}],"synonyms":["brutal honesty","overly frankness","excessive candor","too much honesty"],"phonetic":"/ˌoʊvɚˈɑnəsti/","extraExplanation":["“overhonesty”不是非常固定或常见的标准词，更多时候是临时组合出来表达“太诚实了”的感觉；在日常表达里更常见的是说：“too honest / brutally honest / overly honest”。","语气上，“overhonesty”常带一点批评或提醒：诚实本身是优点，但说话也需要考虑场合、分寸和对方感受。"]}
{"word":"overhonor","summary":{"en":"“Overhonor” means to give someone too much honor or praise.","zh":"“overhonor”指对某人给予过多的尊敬或赞美。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to honor or praise someone too much; to give more respect or credit than is appropriate","zh":"过度尊崇；过分赞美（给予不恰当的过高尊敬或功劳）"},"examples":[{"en":"We sometimes overhonor celebrities and forget the work of teachers and nurses.","zh":"我们有时会过度崇拜名人，却忽视老师和护士的付出。"},{"en":"The award was meant to recognize his effort, not to overhonor him.","zh":"这个奖是为了肯定他的努力，并不是要过分抬高他。"}]}],"synonyms":["overpraise","idolize","exaggerate","glorify","give too much credit"],"phonetic":"/ˌoʊvərˈɑnər/","extraExplanation":["“overhonor”不是特别常见的现代日常用词，更常见的表达是“overpraise（过分赞美）”“idolize（偶像化）”“give too much credit（给过多功劳）”。","构词很好理解：over-（过度）+ honor（尊敬/荣耀）。在写作中用它会带一点“提醒别捧得太高”的批评意味。"]}
{"word":"overhope","summary":{"en":"“Overhope” means to hope too much or expect an unrealistically good result.","zh":"「overhope」指「過度期待／把希望寄託得太高」，也就是對結果過分樂觀。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hope too much or too confidently; to expect a better outcome than is realistic","zh":"過度期待；抱太大希望；對結果過分樂觀"},"examples":[{"en":"I think we may be overhoping if we expect an answer by tomorrow.","zh":"如果我們期待明天就有答覆，可能就是過度期待了。"},{"en":"She overhoped that the interview would guarantee a job offer.","zh":"她過度期待這次面試一定會帶來錄用通知。"},{"en":"Try not to overhope—let’s make a plan in case things don’t work out.","zh":"別過度期待——我們也做個備案，以免事情不如預期。"}]}],"synonyms":["hope too much","be overly optimistic","set one’s hopes too high","expect too much"],"phonetic":"/ˌoʊvərˈhoʊp/","extraExplanation":["「overhope」在現代英文中相對少見，更多時候會用「hope too much」「be overly optimistic」「set one’s hopes too high」等更自然的說法。","前綴「over-」常表示「過度、超出適當範圍」（如 overthink 過度思考、overwork 過度工作），因此 overhope 也可直觀理解為「希望過頭」。"]}
{"word":"overhoped","summary":{"en":"“Overhoped” means you hoped too much or expected something unrealistically (rare).","zh":"“overhoped”指“期待过高/过度乐观”（较少见用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"hoped too much; had expectations that were unrealistically high (past tense/past participle of “overhope,” a rare verb).","zh":"过度期待；抱有不切实际的高期望（“overhope”的过去式/过去分词，用法较少见）。"},"examples":[{"en":"We overhoped for a quick recovery, but healing took months.","zh":"我们过度期待能很快康复，但痊愈花了好几个月。"},{"en":"She overhoped the interview would guarantee a job offer.","zh":"她过度期待那次面试一定会带来录用通知。"},{"en":"I overhoped, and I ended up more disappointed than I needed to be.","zh":"我期待过高，结果比必要的更失望。"}]}],"synonyms":["hoped too much","was overly optimistic","had unrealistic expectations","overestimated"],"phonetic":"/ˌoʊvərˈhoʊpt/","extraExplanation":["“overhoped”比较少见，更常见的表达是：“hoped too much / had unrealistic expectations / was overly optimistic”。","构词上是 over-（“过度、过分”）+ hope（希望），意思与“overconfident（过度自信）”“overestimate（高估）”类似。","语气上通常带一点反思：不是“希望”本身错，而是期望设得太高，导致更容易失望。"]}
{"word":"overhopes","summary":{"en":"“Overhopes” means excessive or unrealistic hopes; it can also be the verb form meaning to hope too much (rare).","zh":"「overhopes」指過高或不切實際的期待；也可作動詞，表示過度希望（較少見）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hope too much or to expect something unrealistically (rare).","zh":"過度希望；抱不切實際的期待（較少見用法）。"},"examples":[{"en":"Don’t overhope—there’s no guarantee we’ll get tickets.","zh":"別過度期待——我們不一定買得到票。"},{"en":"She overhopes that the problem will disappear on its own.","zh":"她過度期待問題會自己消失。"}]},{"partOfSpeech":"n.","definition":{"en":"excessive or unrealistic hopes (plural form).","zh":"過高的希望；不切實際的期待（複數）。"},"examples":[{"en":"His overhopes led to disappointment when the results came out.","zh":"結果出來時，他過高的期待讓他很失望。"},{"en":"Try to replace overhopes with clear, small goals.","zh":"試著把不切實際的期待換成明確的小目標。"}]}],"synonyms":["unrealistic expectations","false hopes","overly high hopes","wishful thinking"],"phonetic":"/ˌoʊvərˈhoʊp/","extraExplanation":["「overhopes」多半是名詞複數（excessive hopes），也可能被當作動詞第三人稱單數（he/she overhopes）。在現代英文裡比較少見；更常用的說法是「unrealistic expectations」「false hopes」「overly high hopes」。","語氣上，「overhope」常帶有提醒或勸告意味，暗示期待太高、容易落空。"]}
{"word":"overhoping","summary":{"en":"Overhoping means hoping too much or having unrealistic expectations.","zh":"overhoping 指“过度希望/期望过高”，带有不切实际的期待。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"hoping for something too strongly or unrealistically; expecting a better result than is reasonable.","zh":"过度希望；抱有不切实际的期待（对结果期望过高）。"},"examples":[{"en":"I’m probably overhoping, but I think I can finish the whole project in one day.","zh":"我可能是过度期待了，但我觉得我能一天做完整个项目。"},{"en":"Overhoping can set you up for disappointment, even when things go okay.","zh":"过度希望会让你更容易失望，即使事情其实还算顺利。"}]},{"partOfSpeech":"n.","definition":{"en":"an instance or habit of unrealistic hope; excessive optimism about an outcome.","zh":"（某一次或一种习惯性的）不切实际的希望；过度乐观。"},"examples":[{"en":"Her overhoping made the rejection feel harsher than it needed to be.","zh":"她的过度期待让被拒绝这件事显得更难受。"},{"en":"A little hope helps, but overhoping can be emotionally exhausting.","zh":"一点希望有帮助，但过度期待会让人情绪上很疲惫。"}]}],"synonyms":["hoping too much","unrealistic expectations","overoptimism","wishful thinking","getting your hopes up"],"phonetic":"/ˌoʊvərˈhoʊpɪŋ/","extraExplanation":["“overhoping”并不是非常常见的标准词，更常见的表达是：“hoping too much / unrealistic expectations / getting your hopes up (too much)”。在写作或口语里用“overhoping”会显得更口语化、带一点自我吐槽的感觉。"]}
{"word":"overhorse","summary":{"en":"Overhorse means to work a horse too hard, or (less commonly) to use more horses than needed.","zh":"overhorse 指“过度使役马”，较少见的意思是“配了过多的马/马力”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to work a horse (or other working animal) too hard; to use up its strength by making it do more than it reasonably can","zh":"过度使役（马或其他役畜）；把马用得太狠，导致体力透支"},"examples":[{"en":"The farmer was warned not to overhorse the team during the summer heat.","zh":"有人提醒那位农夫，夏天炎热时别把那队马使唤过度。"},{"en":"If you overhorse an animal, it may become injured or sick.","zh":"如果你过度使役动物，它可能会受伤或生病。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put too many horses (or more horsepower than needed) on a vehicle or load; to over-equip with horses","zh":"给车辆或负载配了过多的马（或马力）；马匹配备过量"},"examples":[{"en":"They overhorsed the wagon for such a light load.","zh":"那点轻货却给马车配了太多马。"}]}],"synonyms":["overwork","overuse","drive (a horse) too hard"],"phonetic":"/ˌoʊvɚˈhɔrs/","extraExplanation":["“overhorse”属于较少见、偏历史/农牧语境的词，多见于谈论马车运输、农场劳作或旧式旅行的描述。现代英语里更常用的是“overwork”或更具体的表达，如“work the horse too hard”。","结构上它由“over-（过度）+ horse（马）”组成，和“overfeed/overheat/overuse”等词一样，表示“做得过头”。"]}
{"word":"overhostile","summary":{"en":"“Overhostile” means excessively hostile or overly aggressive.","zh":"“overhostile”指“过度敌对、过于有攻击性”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively hostile; more aggressive, unfriendly, or antagonistic than is reasonable or necessary.","zh":"过度敌对的；比合理或必要程度更具攻击性、敌意或对抗性的。"},"examples":[{"en":"The email sounded overhostile for such a small mistake.","zh":"就这么一点小错误，那封邮件的语气显得过度敌对。"},{"en":"Try not to be overhostile in the meeting—focus on the problem, not the person.","zh":"开会时尽量别表现得过度敌对——把注意力放在问题上，不要针对人。"},{"en":"His overhostile reaction made the conversation shut down immediately.","zh":"他过度敌对的反应让谈话立刻进行不下去了。"}]}],"synonyms":["overly hostile","unnecessarily hostile","needlessly aggressive","antagonistic","belligerent"],"phonetic":"/ˌoʊvɚˈhɑstəl/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常范围”（如 overconfident 过于自信、overreact 反应过度）。因此 overhostile 通常强调“敌意过头”。","overhostile 不是非常常见的标准词，更常见的表达有 overly hostile / unnecessarily hostile / needlessly aggressive；但在口语或写作中仍可能被用来强调“太敌对了”。"]}
{"word":"overhostilely","summary":{"en":"“Overhostilely” means “in an overly hostile or aggressive way.”","zh":"overhostilely 意为“以过于敌对或过于强硬的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is more hostile, aggressive, or unfriendly than is appropriate or necessary.","zh":"以过于敌对、攻击性太强或不友好的方式（超过必要或合适的程度）。"},"examples":[{"en":"He replied overhostilely, so the conversation ended quickly.","zh":"他回话时过于敌对，所以谈话很快就结束了。"},{"en":"The reviewer criticized the book overhostilely instead of offering constructive feedback.","zh":"评论者用过于敌对的语气批评这本书，而不是提出建设性的意见。"}]}],"synonyms":["too aggressively","too harshly","in an overly hostile way","abrasively","belligerently"],"phonetic":"/ˌoʊvɚˈhɑstəl.li/","extraExplanation":["“over-”表示“过度、超过适当程度”。因此 overhostilely 强调“敌意太重”，常带有说话方式或态度“不必要地强硬”的评价色彩。日常更常见的表达有: “too aggressively / too harshly / in an overly hostile way”。"]}
{"word":"overhostility","summary":{"en":"“Overhostility” means excessive or unnecessary hostility.","zh":"“overhostility”指“过度/不必要的敌意”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive hostility; an overly aggressive or unfriendly attitude or behavior.","zh":"过度的敌意；过分好斗或不友善的态度/行为。"},"examples":[{"en":"The negotiator warned that overhostility would only make compromise harder.","zh":"谈判代表警告说，过度的敌意只会让妥协更难。"},{"en":"Online comments often show overhostility because people feel anonymous.","zh":"网络评论中常出现过度敌意，因为人们觉得自己是匿名的。"},{"en":"Her calm response helped reduce the overhostility in the room.","zh":"她冷静的回应帮助缓和了房间里的过度敌意。"}]}],"synonyms":["excessive hostility","undue hostility","unnecessary aggression","belligerence","antagonism"],"phonetic":"ˌoʊvərhɑˈstɪləti","extraExplanation":["“overhostility”不是特别常见的标准词汇，更常见的表达是“excessive hostility / undue hostility / unnecessary hostility”。但它的构词很直观：前缀 over-（过度）+ hostility（敌意）。在写作中使用时，语气偏正式、批评性，强调“敌意超过了合理程度”。"]}
{"word":"overhot","summary":{"en":"Overhot means “too hot” or “heated too much.”","zh":"overhot 表示“太热/过热的”，也可指“把……加热过度”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too hot; heated beyond a comfortable or safe temperature.","zh":"过热的；热得不舒服或不安全的。"},"examples":[{"en":"The soup is overhot—let it cool for a minute before you eat it.","zh":"汤太烫了——吃之前先放凉一分钟。"},{"en":"My laptop gets overhot when I run games for a long time.","zh":"我长时间玩游戏时笔记本会过热。"}]},{"partOfSpeech":"vt.","definition":{"en":"To heat (something) too much; to cause to become overly hot.","zh":"把（某物）加热过度；使（某物）变得过热。"},"examples":[{"en":"Don’t overhot the oil, or it may start smoking.","zh":"别把油烧得太热，不然可能会冒烟。"},{"en":"The technician warned that overhotting the engine can damage the parts.","zh":"技师警告说把发动机弄过热会损坏零件。"}]}],"synonyms":["too hot","overheated","scalding","burning hot","overheat"],"phonetic":"/ˌoʊvɚˈhɑt/","extraExplanation":["“overhot”在日常英语里不算最常见：描述食物“太烫”更常说 too hot / scalding hot；描述设备“过热”更常见的是 overheated（形容词）或 overheat（动词）。不过在技术语境或口语里，“overhot”仍能被理解为“过热的/加热过度的”。"]}
{"word":"overhotly","summary":{"en":"“Overhotly” means “too hot” (temperature) or, figuratively, “too heated/emotional.”","zh":"“overhotly”表示“过热地”（温度过高），也可比喻“过于激烈/情绪化地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too hot; excessively warmly or at too high a temperature.","zh":"过热地；热得过分地（温度太高）。"},"examples":[{"en":"The soup was served overhotly and burned my tongue.","zh":"汤端上来时过热，烫到了我的舌头。"},{"en":"Don’t dry the fabric overhotly, or it may shrink.","zh":"不要把布料烘得过热，否则可能会缩水。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative) In a way that is too heated, emotional, or zealous; overly passionately.","zh":"（比喻）过于激烈地；过分情绪化地；太热衷/太冲动地。"},"examples":[{"en":"He argued overhotly and didn’t listen to the other side.","zh":"他争辩得太激烈，没听对方的意见。"},{"en":"She responded overhotly to a small mistake.","zh":"她对一个小错误反应过激。"}]}],"synonyms":["too hotly","overly hot","excessively","overheatedly","too heatedly","too passionately"],"phonetic":"/ˌoʊvərˈhɑtli/","extraExplanation":["“overhotly”由 over-（过度）+ hot（热）+ -ly（副词后缀）构成，字面就是“过分热地”。在现代英语中比较少见，更常见的表达是 “too hot(ly) / overly hot” 或在情绪语境用 “too heatedly / too passionately”。"]}
{"word":"overhour","summary":{"en":"“Overhour” is a rare term meaning overtime (extra working hours) or to work overtime.","zh":"“overhour”很少用，通常表示“加班（时间）”或“加班”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, mainly in workplace contexts) Extra time worked beyond one’s regular scheduled hours; overtime.","zh":"（罕见，多见于职场语境）超出正常排班时间的工作时间；加班（时间）。"},"examples":[{"en":"I stayed two overhours to finish the report.","zh":"我多加班了两个小时把报告写完。"},{"en":"Overhours are paid at a higher rate in some companies.","zh":"在一些公司，加班时间会按更高的时薪支付。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) To work beyond regular hours; to do overtime.","zh":"（罕见）超时工作；加班。"},"examples":[{"en":"We had to overhour all week to meet the deadline.","zh":"为了赶截止日期，我们整整一周都得加班。"}]}],"synonyms":["overtime","extra hours","work overtime","do overtime"],"phonetic":"/ˈoʊvərˌaʊər/","extraExplanation":["“overhour”在现代英语里非常不常见，很多情况下人们会直接说“work overtime / do overtime”或用名词“overtime”。如果你在简历、邮件等正式写作中表达“加班”，更自然的选择是：overtime / extra hours / overtime work。","它更像是由“over-（超过）+ hour（小时）”临时拼出来的词，因此在不同地区或公司内部文件里偶尔能看到，但不算标准常用词。"]}
{"word":"overhouse","summary":{"en":"Overhouse is a rare word meaning to cover something with a roof/structure, or the covering structure itself.","zh":"Overhouse 很少用，指给某物加盖屋顶/建筑来遮蔽，或指这种上盖结构本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) to provide a house or roof over; to cover or enclose with a structure.","zh":"（少见）给……加盖房屋或屋顶；用建筑物覆盖、围住。"},"examples":[{"en":"They planned to overhouse the outdoor walkway to protect it from rain.","zh":"他们计划把室外走道加盖顶棚，以防雨。"},{"en":"The equipment was overhoused to keep it out of the weather.","zh":"这些设备被加盖遮蔽，以避免日晒雨淋。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) an enclosing structure or cover built over something; a roofed housing.","zh":"（少见）建在……之上的罩棚/外壳式建筑；上盖结构。"},"examples":[{"en":"A simple overhouse was built above the pump for safety.","zh":"为了安全，水泵上方搭了一个简易的罩棚。"},{"en":"The generator sat under an overhouse near the shed.","zh":"发电机放在棚子旁边的罩棚下。"}]}],"synonyms":["roof over","cover","enclose","shelter","housing","canopy","enclosure"],"phonetic":"/ˈoʊvərˌhaʊs/","extraExplanation":["“overhouse”在现代英语里非常少见，多出现在较旧的工程/建筑语境中。日常表达更常用：cover, roof over, enclose, build a shelter over…，或名词用：shelter, canopy, enclosure, housing。","构词很好理解：over-（在……上方）+ house（房屋/罩住的空间），因此它强调“在上面加一个房子/罩棚”这一空间概念。"]}
{"word":"overhover","summary":{"en":"“Overhover” is a rare, literary verb meaning “to hover over” or “to loom over,” often suggesting something hanging above or an uneasy presence.","zh":"“overhover”是较少见、偏文学的动词，意思是“在……上方盘旋/悬停”或“（比喻）笼罩、隐约逼近”，常带有压迫或不安的气氛。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hover above or around (something); to hang over as if floating in the air","zh":"（在……上方或周围）盘旋；悬停在……之上；（似乎漂浮般）笼罩着"},"examples":[{"en":"A hawk overhovered the field, waiting for movement below.","zh":"一只鹰在田野上空盘旋，等待下面有动静。"},{"en":"Dark clouds seemed to overhover the city all afternoon.","zh":"乌云似乎整个下午都笼罩着这座城市。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to loom over; to feel present in an unsettling way, as if hanging in the air","zh":"（比喻）隐约逼近；挥之不去地笼罩（带有不安、压迫感）"},"examples":[{"en":"A sense of danger overhovered the conversation.","zh":"一种危险感笼罩着这场谈话。"},{"en":"The memory of that mistake still overhovers him.","zh":"那次错误的记忆仍然挥之不去地萦绕着他。"}]}],"synonyms":["hover over","hang over","loom over","brood over"],"phonetic":"/ˌoʊvərˈhʌvər/","extraExplanation":["“overhover”比较少见，带有文学/诗歌色彩，常用来营造“悬在上方、阴影般笼罩”的画面感。日常英语更常说“hover over”“hang over”“loom over”。","词形上可理解为 over-（在上方/覆盖）+ hover（盘旋/悬停），因此语感比单纯“hover”更强调“在……之上、带压迫感地笼罩”。"]}
{"word":"overhuge","summary":{"en":"Overhuge means “too huge,” often suggesting something is so big it feels excessive or impractical.","zh":"overhuge 意为“过于巨大”，常带有“大得过头、不实用或不协调”的评价。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) excessively huge; larger than is reasonable, normal, or useful.","zh":"（少见）过于巨大的；大得不合理、不正常或不实用的。"},"examples":[{"en":"The overhuge suitcase didn’t fit in the overhead bin.","zh":"那个过于巨大的行李箱放不进机舱行李架。"},{"en":"They built an overhuge monument that overwhelmed the small town.","zh":"他们建了一座过于巨大的纪念碑，把小镇都“压”得失去比例感。"},{"en":"An overhuge portion can be wasteful if you can’t finish it.","zh":"如果吃不完，过于巨大的分量会很浪费。"}]}],"synonyms":["oversized","overly huge","too huge","enormous","gigantic","ridiculously large"],"phonetic":"/ˌoʊvɚˈhjudʒ/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overhuge 字面就是“太巨大”。但它在现代英语中不算常用，更自然的说法通常是 overly huge / too huge / enormous / oversized / ridiculously large。","在写作中使用 overhuge 往往带有主观评价：不只是“大”，而是“大到不合适/不协调”。"]}
{"word":"overhugely","summary":{"en":"“Overhugely” means “to an excessive degree; overly,” but it is very rare in modern English.","zh":"“overhugely”意为“过度地、太过地”，但在现代英语中非常少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"To an excessive or too great degree; excessively; overly.","zh":"过度地；太过地；过分地。"},"examples":[{"en":"The project was overhugely ambitious for such a small team.","zh":"对这么小的团队来说，这个项目的野心过分地大。"},{"en":"He reacted overhugely to a small mistake.","zh":"他对一个小错误反应过度。"}]}],"synonyms":["overly","excessively","too","too much","unduly"],"phonetic":"/ˌoʊvɚˈhjudʒli/","extraExplanation":["“overhugely”非常少见，多数情况下英语更常用“overly / excessively / too much / hugely”。它的构词可以理解为“over-（过度）+ hugely（非常、巨大地）”，因此语气上带有“太夸张、太过头”的感觉。","在正式写作或考试中，建议用更常见的替代词（如 excessively, overly）以避免读者觉得用词生僻或不自然。"]}
{"word":"overhugeness","summary":{"en":"“Overhugeness” is a rare, nonstandard noun meaning extreme or excessive hugeness.","zh":"“overhugeness”是罕见且非标准的名词，表示“极端/过度的巨大”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) The quality of being excessively huge; extreme largeness or vastness.","zh":"（罕见/非标准用法）过度巨大；极端的庞大、浩瀚。"},"examples":[{"en":"The overhugeness of the stadium made the concert feel strangely impersonal.","zh":"体育场过于巨大，让演唱会显得有点缺乏亲切感。"},{"en":"He tried to describe the overhugeness of the ocean, but words failed him.","zh":"他想描述大海的浩瀚无边，却发现语言很难表达。"}]}],"synonyms":["immensity","vastness","enormity","overwhelming size","colossal scale"],"phonetic":"ˌoʊvərˈhjudʒnəs","extraExplanation":["“overhugeness”并不是常见的标准英语词汇，多为临时造词（nonce word）或文学/夸张表达。它由前缀 over-（“过度、太……”）+ hugeness（“巨大”）组成，用来强调“比巨大还要巨大”的感觉。更自然的表达通常是：enormity, immensity, vastness, overwhelming size 等。"]}
{"word":"overhuman","summary":{"en":"Overhuman means beyond normal human ability; it can also describe an idealized being that surpasses ordinary humanity.","zh":"Overhuman 指“超越常人能力的；超人的”，也可用于文学/哲学语境，指超越普通人类的理想化存在。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Beyond what is normal or possible for humans; superhuman.","zh":"超越人类常态或能力的；超人的。"},"examples":[{"en":"The runner’s recovery seemed almost overhuman after such a serious injury.","zh":"那位跑者在如此严重的伤后恢复得几乎超乎常人。"},{"en":"Legends often describe heroes with overhuman strength.","zh":"传说常常描写英雄拥有超人的力量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary/Philosophical) Relating to an ideal being who surpasses ordinary humanity in character, power, or spirit.","zh":"（文学/哲学）指一种理想化的存在，在品格、力量或精神上超越普通人类。"},"examples":[{"en":"Some writers imagined an overhuman figure who could rise above fear and hatred.","zh":"有些作家想象一种“超人”形象，能够超越恐惧与仇恨。"},{"en":"The novel contrasts ordinary people with an overhuman ideal.","zh":"这部小说把普通人和“超人”的理想形象作对比。"}]}],"synonyms":["superhuman","inhuman (sometimes, but often negative)","transcendent (context-dependent)"],"phonetic":"/ˌoʊvərˈhjuːmən/","extraExplanation":["“overhuman”在现代英语中不算常用，更常见的是“superhuman”。在哲学/文学语境里，它有时被用来翻译或讨论尼采的“Übermensch”（常译作“超人/超越的人”），但不同译者可能选择“overman”“superman”“overhuman”等词，语气与侧重点会略有差异。"]}
{"word":"overhumane","summary":{"en":"Overhumane means excessively humane or compassionate, often suggesting it goes too far.","zh":"overhumane 指“过度仁慈/过分人道”，常暗示善良到了不合时宜或过头的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"excessively humane or compassionate, sometimes to the point of being impractical or overly soft.","zh":"过度仁慈的；过分人道的（有时指善良到不切实际或显得太软弱）。"},"examples":[{"en":"Some critics say the policy is overhumane because it ignores the need for enforcement.","zh":"一些批评者说这项政策过于仁慈，因为它忽视了执法的需要。"},{"en":"He can be overhumane in negotiations, giving up too much to avoid conflict.","zh":"他在谈判中可能过于心软，为了避免冲突让步太多。"}]}],"synonyms":["overly humane","too lenient","soft-hearted","overcompassionate"],"phonetic":"/ˌoʊvər hjuˈmeɪn/","extraExplanation":["“overhumane”在现代英语里非常少见，很多时候更自然的说法是“overly humane”或“too humane”。","它通常带一点批评意味：不是说“人道/仁慈”不好，而是说“仁慈过头了”，导致缺乏原则、效率或必要的约束。"]}
{"word":"overhumanity","summary":{"en":"Overhumanity is a rare word meaning either excessive humaneness/mercy or, more rarely, a superhuman state beyond ordinary humanity.","zh":"overhumanity 是个罕见词，通常指“过度的人道/怜悯”，更少见时也可指“超越普通人类的超人性状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) Excessive or overly sentimental kindness, mercy, or “humaneness.”","zh":"（罕见、非标准用法）过度的仁慈、人道或怜悯；带有矫情或溺爱的“过分善良”。"},"examples":[{"en":"Some critics argued the policy showed overhumanity and ignored practical risks.","zh":"一些批评者认为这项政策过分人道，忽视了现实风险。"},{"en":"He was accused of overhumanity—helping even when it harmed the group.","zh":"他被指责“过分仁慈”——即使会损害团队也要帮忙。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) A state or ideal of being beyond ordinary human limits; “superhumanity.”","zh":"（极罕见）超越普通人类界限的状态或理想；类似“超人性/超人类”。"},"examples":[{"en":"In the story, the hero’s overhumanity comes from knowledge rather than magic.","zh":"在故事里，英雄的“超人性”来自知识而非魔法。"},{"en":"The poem imagines overhumanity as a future stage of moral growth.","zh":"这首诗把“超人性”想象成道德成长的未来阶段。"}]}],"synonyms":["excessive compassion","overkindness","over-sentimentality","superhumanity (rare sense)"],"phonetic":"/ˌoʊvərhjuˈmænɪti/","extraExplanation":["“overhumanity”不是常见词，在现代英语里很少出现在权威词典中，更多见于个人造词、文学写作或评论性文字。理解时通常拆分为 over-（过度/超过）+ humanity（人性/人道）。","在讨论伦理与政策时，它更常被用来表达“过度的人道/怜悯”，带一点批评意味；在文学或哲学语境中，也可能被作者用来指“超越人类的境界”，需要结合上下文判断。"]}
{"word":"overhumanize","summary":{"en":"Overhumanize means to treat or describe something as *too human*, often leading to misunderstanding (especially with AI or media portrayals).","zh":"Overhumanize 指把某物或某人描写/对待得“过于像人”，以致产生误解（在AI或媒体描写中尤常见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to describe, portray, or treat something (often an animal, object, or AI) as *more human* than it really is, by giving it human feelings, motives, or abilities","zh":"把某物（常见为动物、物品或AI）描写或对待得“过于像人”，赋予它不符合实际的人类情感、动机或能力"},"examples":[{"en":"It’s easy to overhumanize chatbots and assume they understand emotions the way people do.","zh":"人们很容易把聊天机器人过度拟人化，以为它像人一样理解情绪。"},{"en":"The movie overhumanizes the robot, making it seem morally responsible like an adult.","zh":"这部电影把机器人过度人性化，让它看起来像成年人一样需要承担道德责任。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a person or group seem unrealistically perfect, gentle, or “relatable,” by ignoring their flaws or harmful actions","zh":"把某个人或群体描绘得过于完美、温和或“很有共鸣”，从而忽略其缺点或有害行为"},"examples":[{"en":"Some biographies overhumanize famous leaders and leave out the damage they caused.","zh":"有些传记会把著名领袖写得过于“有人味”，却省略他们造成的伤害。"},{"en":"Don’t overhumanize the character—he’s written to be charming and manipulative at the same time.","zh":"别把这个角色过度美化——作者写他既迷人又善于操控他人。"}]}],"synonyms":["anthropomorphize","personify","humanize (too much)","romanticize"],"phonetic":"ˌoʊvərˈhjuːməˌnaɪz","extraExplanation":["“overhumanize”是较新的用法，常见于科技与媒体讨论，尤其与AI相关。它和“anthropomorphize（拟人化）”接近，但更强调“过度”带来的误判：例如高估AI的理解力、同理心或责任能力。","在公共讨论中，这个词也可用于提醒：对人物的同情与理解不等于为其行为开脱；“overhumanize”指的是把复杂或有害之处抹平。"]}
{"word":"overhumanized","summary":{"en":"Overhumanized means described or treated as too human, especially by giving non-humans unrealistic human feelings or status.","zh":"Overhumanized 指把非人事物描写或对待得过于像人，常指过度赋予人类情感、动机或地位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to seem too human, or described with more human qualities, emotions, or motives than is realistic (often about animals, objects, robots, or fictional characters).","zh":"被描写得“过于像人”，赋予了过多的人类特质、情感或动机（常用于动物、物体、机器人或虚构角色）。"},"examples":[{"en":"Some viewers felt the robot was overhumanized, with emotions that didn’t match the story’s logic.","zh":"有些观众觉得这个机器人被过度拟人化了，它的情感表现不符合故事逻辑。"},{"en":"The documentary avoids overhumanized language when talking about wild animals.","zh":"这部纪录片在谈到野生动物时避免使用过度拟人化的语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"Treated as more “human” than appropriate in a social or ethical discussion (for example, giving something non-human the same moral status as people).","zh":"在社会或伦理讨论中被“过度当作人”来对待（例如把非人事物赋予与人类相同的道德地位）。"},"examples":[{"en":"Critics argued that the AI was being overhumanized in the debate about rights and responsibility.","zh":"批评者认为，在关于权利与责任的争论中，这个人工智能被过度当作“人”来讨论了。"}]}],"synonyms":["over-anthropomorphized","too human-like","excessively anthropomorphized"],"phonetic":"/ˌoʊvərˈhjuːməˌnaɪzd/","extraExplanation":["“over-”有“过度、太……”的意思；“humanize”是“使……更像人/赋予人性、使更有人情味”。因此 overhumanized 通常带有批评语气，强调“拟人化过头”。","近义词常用：over-anthropomorphized（过度拟人化，较书面/学术）、too human-like（太像人，较口语）。相对概念：dehumanized（去人性化，强调把人当作不人）。"]}
{"word":"overhumanizing","summary":{"en":"Overhumanizing means attributing too many human traits or emotions to something, beyond what is accurate or useful.","zh":"Overhumanizing 指把某人或某物过度人性化，赋予过多的人类特质或情感，超出真实或合理范围。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"treating someone or something as more human than is accurate or helpful; giving it too many human qualities, feelings, or intentions.","zh":"把某人或某物“过度人性化”；赋予其过多的人类特质、情感或意图，超出真实或合理的程度。"},"examples":[{"en":"We may be overhumanizing the chatbot by assuming it feels lonely when no one replies.","zh":"我们可能在把这个聊天机器人过度人性化，以为没人回复时它会感到孤独。"},{"en":"Overhumanizing animals can lead people to ignore their real needs and behaviors.","zh":"把动物过度人性化会让人忽视它们真实的需求和行为。"}]},{"partOfSpeech":"v.","definition":{"en":"describing or portraying something in an overly human way (especially in writing, media, or marketing).","zh":"（尤指在写作、媒体或营销中）用过于“像人”的方式来描述或塑造某物。"},"examples":[{"en":"The advertisement is overhumanizing the brand, as if it can love you back.","zh":"这则广告在过度人性化这个品牌，好像它能“回爱”你一样。"},{"en":"In the novel, the narrator keeps overhumanizing the storm, calling it angry and jealous.","zh":"在小说里，叙述者不断把暴风雨过度人性化，说它愤怒、嫉妒。"}]}],"synonyms":["over-anthropomorphizing","anthropomorphizing (too much)","personifying (too much)","humanizing excessively"],"phonetic":"/ˌoʊvərˈhjuːməˌnaɪzɪŋ/","extraExplanation":["“overhumanizing”来自 over-（过度）+ humanize（使人性化）。它常与“anthropomorphizing（拟人化）”相关，但语气更强调“过头了”，暗示这种拟人会造成误解或不恰当的期待。","在AI语境中，overhumanizing 常指把模型的输出当作“有感受/有意图/懂你”的证据；在动物/自然语境中，则指用人类情绪解释其行为（例如把猫的回避理解成“生气”）。"]}
{"word":"overhumble","summary":{"en":"“Overhumble” means excessively humble, often by downplaying yourself too much (sometimes sounding insincere).","zh":"“overhumble”指过分谦虚，常因过度贬低自己而显得不合适，甚至让人觉得不真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too humble; showing humility in an excessive or sometimes insincere way (often by downplaying your own abilities or success).","zh":"过分谦虚；谦虚得过头（常指过度贬低自己，甚至让人感觉不够真诚）。"},"examples":[{"en":"She’s talented, but she can be overhumble and never takes credit for her work.","zh":"她很有才华，但有时过分谦虚，从不愿为自己的成果邀功。"},{"en":"Don’t be overhumble in the interview—mention what you achieved and how you did it.","zh":"面试时别太过分谦虚——要说清楚你做成了什么，以及你是怎么做到的。"},{"en":"His overhumble apologies made people wonder if he was hiding something.","zh":"他过分谦卑的道歉让人怀疑他是不是在隐瞒什么。"}]}],"synonyms":["excessively humble","self-effacing","overly modest"],"phonetic":"ˌoʊvərˈhʌmbəl","extraExplanation":["“over-”表示“过度、超过正常程度”。因此 overhumble 通常带有轻微负面色彩：不是单纯的谦虚（humble），而是“谦虚得不合时宜/不自然”，可能影响沟通或让人觉得不够坦率。","在职场或申请场景里，英语文化往往鼓励在保持礼貌的同时清晰表达贡献：可以谦逊（humble），但不必过分贬低自己（overhumble）。"]}
{"word":"overhumbleness","summary":{"en":"Overhumbleness means being too humble—excessive modesty that can limit self-advocacy.","zh":"overhumbleness 指过度谦卑（过分谦虚），可能影响自我表达与争取权益。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too humble; excessive modesty that may hide your abilities or make it hard to speak up when needed","zh":"过度谦卑；过分的谦虚，可能会掩盖能力或让人难以在需要时表达立场"},"examples":[{"en":"Her overhumbleness made it difficult for her manager to see how much she had contributed.","zh":"她的过度谦卑让经理很难看出她其实做了很多贡献。"},{"en":"A little humility is admirable, but overhumbleness can stop you from asking for fair pay.","zh":"适度谦逊值得欣赏，但过度谦卑会让你不敢争取合理的薪酬。"},{"en":"In class discussions, his overhumbleness kept him silent even when he knew the answer.","zh":"在课堂讨论中，他的过度谦卑让他即使知道答案也不敢开口。"}]}],"synonyms":["excessive humility","over-humility","too much modesty","self-effacement"],"phonetic":"/ˌoʊvɚˈhʌmbəlnəs/","extraExplanation":["“overhumbleness”不是非常常见的标准词，更常见的表达有“excessive humility”“over-humility”或“being too humble”。在正式写作中，用这些说法通常更自然。","文化上，很多语境会鼓励谦虚，但在求职、绩效沟通或谈判中，“过度谦卑”可能被误读为缺乏自信或能力，因此常需要学会在谦逊与清晰表达之间取得平衡。"]}
{"word":"overhumbly","summary":{"en":"“Overhumbly” means “too humbly,” often suggesting the humility feels excessive or insincere.","zh":"“overhumbly”意为“过分谦卑地”，常暗示这种谦虚显得过头、甚至有点不真诚。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively humble way; so humble that it may seem forced, self-deprecating, or insincere.","zh":"过分谦卑地；谦卑到可能显得做作、自贬或不真诚的程度。"},"examples":[{"en":"He overhumbly insisted he didn’t deserve any credit, even though he led the whole project.","zh":"他过分谦卑地坚持说自己不配得任何功劳，尽管整个项目都是他带头完成的。"},{"en":"She answered overhumbly, apologizing repeatedly for a small mistake.","zh":"她回答得过分谦卑，为一个小错误反复道歉。"}]}],"synonyms":["too humbly","overly humbly","excessively humbly","self-deprecatingly"],"phonetic":"/ˌoʊvərˈhʌmbli/","extraExplanation":["“over-”表示“过度、过分”。“overhumbly”并不常见，更常见的表达是“too humbly”或“overly humbly”。在写作中用它往往带一点评价意味：说话者觉得这种谦卑“超出了恰当的礼貌范围”。","在跨文化语境里（尤其是英语商务/学术场合），适度谦虚被视为礼貌，但“过分谦虚”有时会被理解为缺乏自信或在“假装客气”。因此用“overhumbly”时，通常是在提醒对方：可以更直接地承认自己的贡献。"]}
{"word":"overhung","summary":{"en":"“Overhung” means “hung or extended over something,” and it can also figuratively mean “loomed/threatened.”","zh":"“Overhung”意为“悬在……上方/伸出覆盖”，也可比喻“笼罩、逼近、带来威胁感”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “overhang”: to stick out or extend above something.","zh":"“overhang”的过去式和过去分词：伸出在……之上；悬在……上方。"},"examples":[{"en":"A balcony overhung the street below.","zh":"一个阳台伸出在下方的街道之上。"},{"en":"Dark clouds overhung the city all afternoon.","zh":"乌云一下午都笼罩在城市上空。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to loom over or threaten; to seem likely to happen soon.","zh":"（比喻）逼近；笼罩；给人以威胁感，仿佛随时会发生。"},"examples":[{"en":"A sense of danger overhung the journey.","zh":"这趟旅程始终笼罩着危险感。"},{"en":"Uncertainty overhung the negotiations.","zh":"不确定性笼罩着谈判。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as an adjective/past participle) covered by or shaded by something that hangs above.","zh":"（作形容词/过去分词）被上方悬垂之物遮蔽的；被覆盖的。"},"examples":[{"en":"They rested in an overhung doorway to avoid the rain.","zh":"他们在有遮檐的门口休息以躲雨。"},{"en":"An overhung cliff shaded the path.","zh":"一处外伸的悬崖为小路投下阴影。"}]}],"synonyms":["loomed","hung over","jutted out","projected","shadowed"],"phonetic":"/ˌoʊvərˈhʌŋ/","extraExplanation":["“overhung”来自动词 overhang（over- 在……之上 + hang 悬挂）。常见三态：overhang–overhung–overhung。","写作中（尤其描写自然景观或氛围）常用 overhung 来营造“压迫/笼罩”的画面感，如：The trees overhung the lane（树枝伸出覆盖小路）。"]}
{"word":"overhunt","summary":{"en":"Overhunt means to hunt too much, especially in a way that reduces an animal population or harms an ecosystem.","zh":"Overhunt 指过度捕猎，尤其是捕得太多而导致动物数量下降或破坏生态。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to hunt an animal species too much, so its population becomes smaller or the species becomes endangered","zh":"过度捕猎（某种动物），导致数量下降甚至濒危"},"examples":[{"en":"Some predators were overhunted, which disturbed the local food chain.","zh":"一些捕食者被过度捕猎，破坏了当地的食物链。"},{"en":"If we overhunt deer, forests can change in unexpected ways.","zh":"如果我们过度捕猎鹿，森林可能会以意想不到的方式发生变化。"},{"en":"The law was created to stop people from overhunting protected animals.","zh":"这项法律的制定是为了阻止人们过度捕猎受保护动物。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hunt too much in a particular area or for too long (making hunting less successful afterward)","zh":"在某个地区或一段时间内打猎过度（使之后更难猎到）"},"examples":[{"en":"We overhunted the area last season, so game is scarce this year.","zh":"我们上个季节在这片区域狩猎过度，所以今年猎物很少。"},{"en":"Hunters try not to overhunt the same land year after year.","zh":"猎人会尽量避免年复一年在同一片土地上过度狩猎。"}]}],"synonyms":["overharvest","deplete","hunt to extinction (contextual)"],"phonetic":"ˌoʊvərˈhʌnt","extraExplanation":["“overhunt”常见于环保与野生动物管理语境，强调“超过可持续水平的捕猎”。与之相关的概念有“可持续捕猎（sustainable hunting）”“配额（quota）”“禁猎期（closed season）”。"]}
{"word":"overhunted","summary":{"en":"Overhunted describes animals or areas that have been hunted too much, causing population decline or ecological harm.","zh":"Overhunted 指动物或地区被过度猎捕，导致数量下降或生态受损。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hunted too much, so that the animal population becomes very low or is harmed.","zh":"被过度猎捕的；因猎捕过多而导致动物数量大幅下降或生态受损的。"},"examples":[{"en":"The region’s deer are overhunted, so strict limits were introduced.","zh":"这个地区的鹿被过度猎捕，因此出台了严格的限猎规定。"},{"en":"Overhunted species often need years of protection to recover.","zh":"被过度猎捕的物种往往需要多年的保护才能恢复。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a place or area) affected by too much hunting.","zh":"（指地区/环境）因狩猎过多而受到影响的。"},"examples":[{"en":"In overhunted forests, you may hear fewer bird calls than before.","zh":"在过度狩猎的森林里，你可能比以前听到更少的鸟鸣。"},{"en":"The park was once overhunted, but wildlife has slowly returned.","zh":"这个公园曾经被过度狩猎，但野生动物已在慢慢回归。"}]}],"synonyms":["overharvested","overexploited","overkilled","depleted (of wildlife)"],"phonetic":"ˌoʊvərˈhʌntɪd","extraExplanation":["“over-”是常见前缀，表示“过度、超过合理范围”（如 overwork 过度工作、overfish 过度捕捞）。因此 overhunted 强调的不是“猎得很努力”，而是“猎得过量”，带有环境与保护语境。","在自然保护讨论中，overhunted 常与配额（quota）、禁猎期（closed season）、狩猎许可（license/permit）、濒危（endangered）等词一起出现。"]}
{"word":"overhunting","summary":{"en":"Overhunting means hunting animals too much, causing populations to fall and possibly leading to local extinction.","zh":"overhunting 指对动物进行过量狩猎，导致种群下降，甚至可能造成局部灭绝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hunting animals so much that their population becomes too small, declines quickly, or may disappear from an area.","zh":"过度狩猎；猎捕过量，导致动物数量过少、快速下降，甚至在某地消失。"},"examples":[{"en":"Overhunting pushed some species close to extinction.","zh":"过度狩猎把一些物种推到了接近灭绝的边缘。"},{"en":"The park limits hunting to prevent overhunting.","zh":"公园限制狩猎以防止过度狩猎。"}]},{"partOfSpeech":"other","definition":{"en":"The act of hunting too much; hunting beyond what is sustainable.","zh":"过度猎捕的行为；超过可持续水平的狩猎。"},"examples":[{"en":"Overhunting is one reason biodiversity is decreasing.","zh":"过度猎捕是生物多样性下降的原因之一。"},{"en":"They discussed overhunting and habitat loss in class.","zh":"他们在课堂上讨论了过度猎捕和栖息地丧失。"}]}],"synonyms":["excessive hunting","overharvesting (of wildlife)","unsustainable hunting"],"phonetic":"/ˌoʊvərˈhʌntɪŋ/","extraExplanation":["“Overhunting”常用于环境保护与生态学语境，强调“超过自然恢复能力的捕猎”。它与“poaching（偷猎）”不同：poaching强调违法；overhunting强调“数量过度”，可能在合法或非法情况下发生。","相关常见搭配：overhunting of whales（过度捕鲸）、overhunting of deer（过度猎鹿）、prevent overhunting（防止过度猎捕）、overhunting and overfishing（过度猎捕与过度捕捞）。"]}
{"word":"overhunts","summary":{"en":"“Overhunts” means hunts too much, especially in a way that harms wildlife populations.","zh":"“Overhunts”指过度狩猎，尤其是会危害野生动物种群数量的那种。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"hunts too much (third-person singular of “overhunt”), causing animal populations in an area to drop or become endangered","zh":"过度狩猎（“overhunt”的第三人称单数），导致某地或某物种数量下降，甚至濒危"},"examples":[{"en":"If a community overhunts deer, the population may not recover quickly.","zh":"如果一个社区过度狩猎鹿群，数量可能无法很快恢复。"},{"en":"The report warns that the region overhunts wild boar every season.","zh":"报告警告说，该地区每个季节都在过度猎捕野猪。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a hunter or group) hunts more than is legal or sustainable","zh":"（指猎人或群体）狩猎超过法律限制或生态可持续范围"},"examples":[{"en":"Some hunters overhunt because they underestimate the impact on wildlife.","zh":"有些猎人会过度狩猎，因为他们低估了对野生动物的影响。"},{"en":"When people overhunt, ecosystems can lose balance.","zh":"人们过度狩猎时，生态系统可能失去平衡。"}]}],"synonyms":["overharvests","hunts excessively"],"phonetic":"/ˌoʊvɚˈhʌnts/","extraExplanation":["“Overhunt”常用于自然保护与环境新闻语境，强调“超过自然补充能力”的猎捕量。与之相关的常见概念包括：狩猎配额（quota）、禁猎期（closed season）、可持续利用（sustainable use）与濒危物种保护（endangered species protection）。"]}
{"word":"overhurl","summary":{"en":"Overhurl is an archaic/literary verb meaning to hurl something over/across, or figuratively to overwhelm.","zh":"overhurl 是古旧/文学用语动词，意为“掷过、抛到……上方”，也可比喻“压倒、袭来”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic or literary) To throw something over or across something; to hurl over.","zh":"（古旧或文学用语）把某物扔到……上方或越过……；掷过。"},"examples":[{"en":"In the storm, the waves seemed to overhurl the rocks on the shore.","zh":"在暴风雨中，海浪仿佛要把岸边的岩石掀翻并越过。"},{"en":"The rider overhurled his cloak across the fence to the other side.","zh":"骑手把斗篷掷过篱笆，扔到了另一边。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, literary) To overwhelm or strike with great force, as if thrown down upon someone.","zh":"（比喻，文学用语）压倒；猛然袭来（仿佛被掷下般）。"},"examples":[{"en":"Grief overhurled him, leaving him silent for days.","zh":"悲伤压倒了他，让他沉默了好几天。"},{"en":"A sudden fear overhurled her thoughts and she forgot what to say.","zh":"突如其来的恐惧袭来，她一时忘了要说什么。"}]}],"synonyms":["hurl over","throw over","fling over","cast over","overwhelm"],"phonetic":"/ˌoʊvərˈhɝl/","extraExplanation":["“over-”在这里有“越过/在……之上/过度”的感觉；“hurl”是“猛掷、投掷”。因此“overhurl”整体带有“掷过/掷在……上方”的画面感。","这是偏古典的用法，现代英语中更常见的是用“throw over / hurl over / fling over”来表达字面意思，用“overwhelm”来表达比喻意思。"]}
{"word":"overhurried","summary":{"en":"Overhurried means ‘too rushed,’ often implying careless or poorly considered action.","zh":"overhurried 表示“过于匆忙”，常暗示因此显得草率或欠考虑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too hurried; done with excessive speed so that care, quality, or thought is reduced.","zh":"过于匆忙的；因为赶得太急而显得不够周到、质量下降或欠考虑的。"},"examples":[{"en":"The report felt overhurried, with several typos and unclear conclusions.","zh":"这份报告显得太匆忙了，有好几处错别字，结论也不够清晰。"},{"en":"She gave an overhurried apology and left before anyone could respond.","zh":"她匆匆道了个歉就离开了，没等任何人回应。"},{"en":"An overhurried decision can create bigger problems later.","zh":"过于匆忙的决定可能会在之后带来更大的问题。"}]}],"synonyms":["overhasty","rushed","hurried","hasty","precipitate"],"phonetic":"/ˌoʊvərˈhɝid/","extraExplanation":["“over-”作前缀常表示“过度、超过适当程度”。因此 overhurried 不只是“很赶”，还带有“赶过头了，以至于不够仔细/不够稳妥”的含义。","该词在现代英语中相对少见，日常更常用 overhasty、rushed、hurried 等表达；但在较正式或文学语境里，overhurried 能强调“过度匆忙导致失当”的语气。"]}
{"word":"overhurriedly","summary":{"en":"“Overhurriedly” means doing something too quickly, in an overly rushed way.","zh":"“overhurriedly”表示做事过于匆忙、太赶而显得仓促。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too hurried or rushed; with more haste than is wise or necessary.","zh":"过于匆忙地；仓促地（快得不合适或没必要）。"},"examples":[{"en":"She answered the question overhurriedly and made a simple mistake.","zh":"她回答得过于匆忙，结果犯了一个简单的错误。"},{"en":"Don’t sign the contract overhurriedly—read every page first.","zh":"别仓促签合同——先把每一页都读一遍。"},{"en":"He packed overhurriedly and forgot his passport.","zh":"他收拾得太匆忙，忘了带护照。"}]}],"synonyms":["too hastily","too quickly","rashly","in too much of a hurry"],"phonetic":"/ˌoʊvɚˈhɝidli/","extraExplanation":["“over-”常见表示“过度、太……”，如 overreact（反应过度）、overconfident（过于自信）。因此 overhurriedly 的语气比 hurriedly 更强，强调“因为太赶而不妥、可能出错”。","这个词相对少见，日常更常用：too quickly / too hastily / in too much of a hurry。"]}
{"word":"overhurry","summary":{"en":"“Overhurry” means to hurry too much, often leading to mistakes; it’s rare in modern everyday English.","zh":"“overhurry”指“过于匆忙”，常暗示因此容易出错；在现代日常英语中较少使用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hurry too much or too fast; to rush in a way that may cause mistakes or trouble","zh":"过于匆忙；赶得太急（可能导致出错或出问题）"},"examples":[{"en":"If you overhurry the job, you’re more likely to miss important details.","zh":"如果你把这项工作做得太急，就更可能漏掉重要细节。"},{"en":"Don’t overhurry—take a moment to check your answers.","zh":"别太赶——花点时间检查一下答案。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to make someone or something hurry too much","zh":"（较少见）催得过急；使某人/某事过于匆忙"},"examples":[{"en":"The tight schedule overhurried the team and reduced the quality of their work.","zh":"紧张的日程把团队催得太急，工作质量也下降了。"}]}],"synonyms":["rush","hurry too much","overhasten","be in too much of a hurry","go too fast"],"phonetic":"/ˌoʊvɚˈhɝi/","extraExplanation":["“overhurry”在现代英语里很少用，听起来偏古旧或文学化。日常更常说：“rush,” “hurry too much,” “be in too much of a hurry,” 或 “overdo it / go too fast.”","构词上是“over-（过度）+ hurry（匆忙）”，表达“超过合适程度的赶忙”，通常带有“容易出错、考虑不周”的含义。"]}
{"word":"overhurrying","summary":{"en":"“Overhurrying” means hurrying too much, often causing mistakes; it can also mean the act of excessive rushing.","zh":"“overhurrying”表示“过度匆忙/太赶”，常暗示因此出错；也可指“过度赶时间的行为”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"hurrying too much or too fast, often causing mistakes, stress, or lower quality.","zh":"过度赶时间；太匆忙（常导致出错、压力增加或质量下降）。"},"examples":[{"en":"Overhurrying made her miss an important detail in the email.","zh":"她太匆忙，结果漏掉了邮件里的一个重要细节。"},{"en":"Try to avoid overhurrying; steady work is usually better than rushed work.","zh":"尽量避免过度赶工；稳定地做通常比匆忙更好。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of hurrying too much; excessive rushing.","zh":"过度匆忙的行为；过分赶时间。"},"examples":[{"en":"The overhurrying of the project led to several small errors.","zh":"项目过度赶进度，导致出现了好几处小错误。"},{"en":"A little planning can prevent overhurrying in the morning.","zh":"稍微规划一下就能避免早上过度匆忙。"}]}],"synonyms":["rushing too much","excessive rushing","overdoing it","haste","overhaste"],"phonetic":"ˌoʊvɚˈhɝiɪŋ","extraExplanation":["“overhurrying”来自“over-（过度）+ hurry（匆忙）”。英语里更常见的表达是“rushing too much / excessive rushing / overdoing it”。因此它在日常口语中相对少见，但在写作中用来强调“因为太急而出问题”的语气很清晰。"]}
{"word":"overhusk","summary":{"en":"A rare word meaning to husk something too much (and possibly damage it).","zh":"一个较罕见的词，表示对某物“过度剥壳/去壳”，可能会造成损伤。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/technical) To remove the husk from (grain, corn, seeds, etc.) too much or too aggressively, so that the kernel is damaged or more than the intended outer layer is stripped away.","zh":"（罕见/技术用语）对（谷物、玉米、种子等）过度去壳/剥皮；剥得太多或太用力，以致伤到籽粒或去掉了不该去掉的外层。"},"examples":[{"en":"If you overhusk the corn, you can tear the kernels or dry them out.","zh":"如果玉米剥壳剥过头，可能会把玉米粒扯破，或让它们变干。"},{"en":"The mill adjusted its settings to avoid overhusking the rice during processing.","zh":"这家碾米厂调整了机器参数，以避免加工时稻米被过度去壳。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Very rare) To cover or surround with an extra husk or husk-like layer.","zh":"（极罕见）用额外的壳包裹；或使被类似外壳的层包住。"},"examples":[{"en":"Some plants seem to overhusk their seeds in harsh climates.","zh":"在严酷气候中，有些植物的种子似乎会被更厚的外壳包裹。"}]}],"synonyms":["husk too much","over-process","overpeel","overshell"],"phonetic":"ˌoʊvərˈhʌsk","extraExplanation":["“overhusk”不是常见的标准词汇，更常见的表达会用“husk (the corn)”表示剥壳；若要强调“过度”，通常会说“husk too much / over-process / damage the kernels”。","构词上它由前缀“over-（过度）”+“husk（壳；剥壳）”组成，因此即使读者没见过，也能从词形推断为“过度剥壳/过度去壳”。"]}
{"word":"overhype","summary":{"en":"Overhype means to promote something too much (or the excessive promotion itself), leading to unrealistic expectations.","zh":"overhype 指“过度炒作/过分吹捧”（或这种过度宣传本身），从而让人产生不切实际的期待。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to promote or praise something too much, creating expectations that are unrealistically high","zh":"过度炒作；过分吹捧（使他人产生不切实际的高期待）"},"examples":[{"en":"The movie was overhyped, so many viewers felt disappointed after watching it.","zh":"这部电影被过度炒作了，所以很多观众看完后觉得失望。"},{"en":"Don’t overhype the new product until we have real customer feedback.","zh":"在得到真实的客户反馈之前，别把新产品吹得太神。"},{"en":"Some influencers overhype skincare results to get more clicks.","zh":"有些网红为了更多点击量，会夸大护肤效果。"}]},{"partOfSpeech":"n.","definition":{"en":"excessive publicity or praise that makes something seem better than it really is","zh":"过度宣传；过分吹捧（导致名不副实的热度）"},"examples":[{"en":"There was a lot of overhype around the app’s “AI” features.","zh":"这款应用的“AI”功能被过度宣传了。"},{"en":"Ignore the overhype and look at the facts and reviews.","zh":"别被过度炒作影响，看看事实和评价。"}]}],"synonyms":["overpromote","oversell","overpraise","exaggerate","build up"],"phonetic":"ˌoʊvərˈhaɪp","extraExplanation":["“hype”常指带有营销意味的“炒作/造势”。加上前缀“over-”表示“过度”，所以“overhype”常用于吐槽广告、社交媒体、明星或新品发布带来的不切实际期待。","写作中也常用被动：be overhyped（被过度炒作）。与“overrated（被高估）”相比，“overhyped”更强调“宣传/造势过头”的过程与氛围。"]}
{"word":"overhysterical","summary":{"en":"“Overhysterical” means excessively hysterical—overly emotional or panicked.","zh":"“overhysterical”指“过度歇斯底里”，即情绪或恐慌反应过分夸张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively emotional, panicked, or dramatic (more than the situation seems to warrant).","zh":"过度歇斯底里（情绪过分激动、恐慌或夸张，超过情境所需）。"},"examples":[{"en":"The headlines were overhysterical, making the event sound like the end of the world.","zh":"这些标题太过歇斯底里，把事件写得像世界末日一样。"},{"en":"Try not to be overhysterical—let’s look at the facts first.","zh":"别太歇斯底里——我们先看看事实。"}]}],"synonyms":["overly hysterical","overdramatic","panicked","frantic","overreacting"],"phonetic":"/ˌoʊvərhɪˈstɛrɪkəl/","extraExplanation":["“overhysterical”并不是非常常见的标准词，更常见的表达有“overly hysterical”“hysterical”“overdramatic”“panicked”。写作时用更常见的搭配会更自然。","“hysterical / hysteria”在历史上曾与对女性的刻板印象和医学误用有关（把女性的情绪反应贴上病理化标签）。现代英语中它多指“极度激动/恐慌/失控”，但在人际沟通中可能显得贬低或不够体贴；需要更中性的语气时，可用“overreacting（反应过度）”“very anxious（很焦虑）”“really upset（很难过）”。"]}
