{"word":"overzeal","summary":{"en":"Overzeal means excessive enthusiasm that becomes pushy or harmful.","zh":"overzeal 指过度热心或热忱，甚至变得强势或产生负面影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive eagerness or enthusiasm, especially in a way that is too aggressive, strict, or pushy","zh":"过度热心；过度热忱（尤指做事太激进、太苛刻或太强势）"},"examples":[{"en":"His overzeal to help ended up annoying the whole team.","zh":"他想帮忙的过度热心反而惹恼了整个团队。"},{"en":"The new rules were enforced with overzeal, and small mistakes were punished.","zh":"新规定被过度严格地执行，连小错误也受到了惩罚。"},{"en":"She apologized for her overzeal and promised to listen more.","zh":"她为自己的过度热忱道歉，并承诺会多倾听。"}]}],"synonyms":["excessive enthusiasm","over-enthusiasm","overeagerness","zealotry","fanaticism"],"phonetic":"/ˌoʊvərˈzil/","extraExplanation":["“overzeal”由 over-（过度）+ zeal（热情、热忱）组成，常带批评意味，强调“好心但用力过猛”。在职场或公共事务语境中很常见，比如形容对规章制度执行得太死板、太严苛。"]}
{"word":"overzealous","summary":{"en":"“Overzealous” means overly enthusiastic in a way that becomes excessive or problematic.","zh":"“overzealous”指热情过头、过度热衷，以至于显得不合适或造成问题。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too eager or enthusiastic, especially in a way that is excessive, pushy, or causes problems.","zh":"过于热心的；过度热衷的（常指热情过头、咄咄逼人或带来麻烦）。"},"examples":[{"en":"An overzealous security guard stopped everyone for unnecessary checks.","zh":"一位过于热心的保安对所有人都进行了没必要的检查。"},{"en":"Her overzealous editing removed the writer’s original voice.","zh":"她过度的编辑把作者原本的风格都删没了。"},{"en":"I appreciate the help, but the overzealous advice started to feel controlling.","zh":"我很感激你的帮助，但那些过度热心的建议开始让人觉得被控制。"}]}],"synonyms":["too eager","overenthusiastic","excessively enthusiastic","pushy","fanatical"],"phonetic":"/ˌoʊvɚˈzɛləs/","extraExplanation":["“zealous”本意是“热衷的、热心的”，通常可偏正面；加上前缀“over-”（过度）后，“overzealous”就多为负面，强调“热情过头导致不合适/不必要的行为”。","常见搭配：overzealous fans（过度狂热的粉丝）、overzealous enforcement（过度执法/执行）、overzealous policing（过度警务）。","语气区别：overzealous 比 enthusiastic 更带批评意味；也常与 pushy（强势/咄咄逼人）或 aggressive（过于强硬）在语感上接近。"]}
{"word":"overzealously","summary":{"en":"“Overzealously” means doing something with too much enthusiasm, to the point that it causes annoyance or problems.","zh":"“overzealously”指做事过于热心/过度积极，以至于引起反感或造成麻烦。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows too much enthusiasm or eagerness, often so strong that it becomes annoying, pushy, or causes problems.","zh":"以过分热心/过度积极的方式；热情过头，常常显得咄咄逼人、惹人烦或导致问题。"},"examples":[{"en":"The new manager enforced the rules overzealously, and the team’s morale dropped.","zh":"新经理过于严苛地执行规定，结果团队士气下降了。"},{"en":"He overzealously corrected everyone’s grammar, even in casual conversations.","zh":"他在日常聊天里也过度热衷于纠正别人的语法。"},{"en":"The security guard checked bags overzealously, slowing down the whole line.","zh":"保安检查包过于认真，导致队伍整体变慢。"}]}],"synonyms":["too eagerly","overenthusiastically","overly aggressively","excessively"],"phonetic":"/ˌoʊvɚˈzɛləsli/","extraExplanation":["构词理解：over- 表示“过度”，zeal 表示“热心/热情”，-ously 构成副词。整体就是“热心过头地”。","语气与使用：overzealously 通常带负面评价，暗示“本意可能是好的，但做得太过了”。常见搭配有 enforce/apply/follow rules overzealously（过度执行/套用/遵守规定）、police something overzealously（过度监管）。"]}
{"word":"overzealousness","summary":{"en":"Overzealousness means excessive enthusiasm or strictness that often creates problems.","zh":"overzealousness 指过度热心或过分严格，往往会引发问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too eager, too enthusiastic, or too strict about a goal, rule, or belief, often in a way that causes problems.","zh":"过度热心；过分积极（对目标、规则或信念过于投入，常因此带来负面影响）。"},"examples":[{"en":"Her overzealousness at work sometimes makes her teammates feel pressured.","zh":"她在工作上的过度积极有时会让队友感到压力。"},{"en":"The coach’s overzealousness led to training that was too intense for beginners.","zh":"教练的过度严格导致训练对初学者来说太强了。"},{"en":"Overzealousness in enforcing rules can damage trust in a community.","zh":"过度执行规则会破坏社区中的信任。"}]}],"synonyms":["excessive enthusiasm","overenthusiasm","overeagerness","zealotry","fanaticism"],"phonetic":"ˌoʊvɚˈzɛləsnəs","extraExplanation":["“overzealousness”来自 over-（过度）+ zealous（热心的、狂热的）+ -ness（名词后缀）。语气通常偏负面：不是单纯“很努力”，而是“努力到不合适/让人不舒服/带来后果”。","近义词里，enthusiasm 多为中性或褒义；fanaticism/zealotry 更强烈，常带“极端、盲目”的贬义色彩。overzealousness 介于两者之间，强调“过度”而非“邪恶”。"]}
{"word":"overzeals","summary":{"en":"Overzeal means excessive enthusiasm that may cause trouble; “overzeals” is its plural but is less common in everyday use.","zh":"overzeal指“过度的热情/积极”，可能带来问题；overzeals是其复数形式，但日常使用较少。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"too much enthusiasm or eagerness, especially when it causes problems or seems inappropriate","zh":"过度的热情；过分的积极（常带来麻烦或显得不合时宜）"},"examples":[{"en":"Her overzeal to help ended up slowing the team down.","zh":"她过度热心想帮忙，结果反而拖慢了团队进度。"},{"en":"The new manager’s overzeal led to unnecessary rule changes.","zh":"新经理的过度积极导致了不必要的制度改动。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: overzeals) repeated or different instances of excessive enthusiasm","zh":"（复数：overzeals）多次/不同表现的过度热情"},"examples":[{"en":"In training, the coach warned rookies about common overzeals, like interrupting seniors or rushing decisions.","zh":"在培训中，教练提醒新人注意常见的“过度积极”，比如打断前辈或仓促做决定。"}]}],"synonyms":["excessive enthusiasm","overenthusiasm","too much eagerness","overzealousness"],"phonetic":"ˌoʊvərˈziːl","extraExplanation":["“overzeals”通常是名词overzeal的复数，但在日常英语里更常用的是单数overzeal，或用形容词overzealous（如：an overzealous volunteer 过于热心的志愿者）。","语气上overzeal/overzealous常带轻微批评：不是说不热情，而是“热情过头、方法不当”。"]}

