{"word":"overqualification","summary":{"en":"Overqualification means having more qualifications than a job needs, which can sometimes hurt your chances in hiring.","zh":"Overqualification 指“资历过高”：你的学历、技能或经验超过岗位需求，有时反而会影响招聘结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the situation of having more education, skills, or experience than a job requires","zh":"（相对于某份工作而言）资历过高；能力或经验超出岗位要求的状态"},"examples":[{"en":"She worried that her overqualification would make employers think she would leave quickly.","zh":"她担心自己资历过高，会让雇主觉得她很快就会离职。"},{"en":"Overqualification can be a problem when the role offers limited growth.","zh":"当岗位发展空间有限时，资历过高可能会成为问题。"}]},{"partOfSpeech":"n.","definition":{"en":"the fact of being seen as too qualified for a specific role, sometimes leading to rejection in hiring","zh":"（在招聘中）被认为“太合适/太强”而不合适该岗位的情况，有时会导致被拒"},"examples":[{"en":"He faced overqualification during interviews, even though he was willing to take a pay cut.","zh":"尽管他愿意降薪，他在面试中仍因“资历过高”而碰壁。"},{"en":"The manager mentioned overqualification as a concern about long-term fit.","zh":"经理提到“资历过高”，担心长期匹配度。"}]}],"synonyms":["being overqualified","excess qualification","too much experience","over-credentialing"],"phonetic":"/ˌoʊvɚˌkwɑləfəˈkeɪʃən/","extraExplanation":["“overqualification”常出现在求职语境里，潜台词往往是：雇主担心你会觉得工作太简单、很快离开、要求更高薪资，或对团队氛围产生不匹配。","应对时可以在求职信/面试中强调：你为什么真正想做这份工作、你看重的稳定性/使命/行业转换、你愿意接受的薪资范围，以及你能带来的具体价值（例如培训新人、流程优化）同时不“抢戏”。","相关词：overqualified（形容词，资历过高的）。常见搭配：concerns about overqualification / perceived overqualification / address overqualification in an interview。"]}
{"word":"overqualified","summary":{"en":"“Overqualified” describes someone whose qualifications exceed what a job (or task) needs.","zh":"“Overqualified”指某人资历超过岗位或任务所需，常用于求职语境，含“资历过高/大材小用”之意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having more education, skills, or experience than a job requires.","zh":"（因教育、技能或经验）超过工作要求的；资历过高的。"},"examples":[{"en":"She’s overqualified for this entry-level position.","zh":"她做这份入门级工作资历过高。"},{"en":"I’m worried they’ll think I’m overqualified and leave soon.","zh":"我担心他们会觉得我资历过高，很快就会离职。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having more abilities than are needed for a particular task or situation.","zh":"对某项任务或情境而言能力过剩的；“用大材做小事”的。"},"examples":[{"en":"That laptop is overqualified for basic email and web browsing.","zh":"那台笔记本电脑用来收邮件和上网有点大材小用。"},{"en":"He felt overqualified to do simple paperwork all day.","zh":"他觉得整天做简单文书工作有点屈才。"}]}],"synonyms":["too qualified","overskilled","overexperienced","too experienced"],"phonetic":"/ˌoʊvərˈkwɑləˌfaɪd/","extraExplanation":["“overqualified”常出现在求职语境里，有时带一点委婉的“拒绝理由”：雇主可能担心你很快会离开、要求更高薪资，或不愿意做基础工作。面试中可以强调你愿意长期发展、喜欢岗位内容、以及你能带来的稳定性。","近义表达：too qualified（较口语）、overexperienced（较少见）。更礼貌的自我表述可用：I may be more experienced than the role requires, but I’m genuinely interested in…（我可能比岗位要求更有经验，但我确实对……感兴趣）。"]}
{"word":"overqualify","summary":{"en":"Overqualify means (1) to judge someone as too qualified for a job, or (2) to add too many limiting details to a statement or rule.","zh":"overqualify 指（1）认为某人对某岗位“资历过高”；（2）给表述/规则加太多限定，导致过于繁琐。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To describe someone or something as having more skills, education, or experience than a job or situation requires.","zh":"（因资历、技能或经验）过高而认定某人/某物不适合某个岗位或情境；认为“高配”。"},"examples":[{"en":"The recruiter worried that we might overqualify her because the role is very routine.","zh":"招聘方担心这个职位太日常，会显得她资历过高。"},{"en":"Don’t overqualify yourself—highlight the experience that matches this job.","zh":"别把自己说得“过于资深”——强调与岗位匹配的经验就好。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make a statement, description, or rule too detailed or restrictive by adding too many conditions or exceptions.","zh":"（给陈述、描述或规则）加上过多限定或条件，使其过于繁琐/过度限定。"},"examples":[{"en":"If you overqualify the instructions, people will get confused.","zh":"如果你把说明写得过度限定，大家反而会更困惑。"},{"en":"He kept overqualifying his apology with excuses.","zh":"他不停用各种借口去“限定/修饰”自己的道歉，反而显得不真诚。"}]}],"synonyms":["consider (someone) overqualified","deem overqualified","overspecify","overcomplicate","add too many qualifiers"],"phonetic":"/ˌoʊvərˈkwɑləˌfaɪ/","extraExplanation":["“overqualify”最常见于求职语境：雇主担心“资历过高”的人会很快离职、对薪资期望更高，或觉得工作无聊。求职时通常会用更委婉的说法（如“may be seen as overqualified”）。","第二个含义更偏写作与表达：意思接近“加太多但书/条件”。在正式写作里也可能见到“overqualified statement/claim（过度限定的表述）”。"]}
{"word":"overqualifying","summary":{"en":"“Overqualifying” means describing someone (or a job requirement) as having more qualifications than needed, especially in hiring.","zh":"“overqualifying”指（在招聘等语境中）认为某人资历超出岗位需要，或把岗位要求定得过高。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of overqualify) to describe someone as having more education, skills, or experience than a job requires, often in hiring contexts.","zh":"（overqualify 的现在分词）形容某人被认为资历/学历/经验“超出岗位要求”，常见于招聘语境。"},"examples":[{"en":"The manager worried that hiring her would mean overqualifying the position.","zh":"经理担心录用她会让这个岗位“资历要求过高”。"},{"en":"Some employers avoid overqualifying candidates because they may leave quickly.","zh":"一些雇主会避免录用“过于优秀/过度胜任”的候选人，因为他们可能很快离职。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of setting requirements so high that many suitable people are excluded.","zh":"把条件设得过高、导致许多合适人选被排除在外的做法。"},"examples":[{"en":"Overqualifying the role can shrink the applicant pool.","zh":"把岗位要求定得过高会缩小应聘者范围。"},{"en":"They revised the job post to avoid overqualifying.","zh":"他们修改了招聘信息，以避免把要求写得过高。"}]}],"synonyms":["overqualify","set the bar too high","overspecify requirements","be too qualified"],"phonetic":"ˌoʊvərˈkwɑləˌfaɪɪŋ","extraExplanation":["在职场英语里，\"overqualified\" 比 \"overqualifying\" 更常见：\"I’m overqualified for this job.\"（我对这个岗位来说资历过高。）","如果你担心被认为 overqualified，可以强调稳定性与动机：例如说明你想转型、看重公司文化、愿意从基层做起，并且薪资期望与岗位匹配。","相关搭配：\"seem/appear overqualified\"（看起来资历过高）、\"be considered overqualified\"（被认为资历过高）、\"overqualified candidate\"（资历过高的候选人）。"]}
{"word":"overquantity","summary":{"en":"Overquantity means an excessive amount—more than needed or permitted.","zh":"overquantity 指“过量”，即超过需要或允许的数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an amount that is greater than needed or allowed; an excessive quantity","zh":"超过需要或规定的数量；过量"},"examples":[{"en":"The recipe failed because of an overquantity of salt.","zh":"这道菜失败是因为盐放得过量。"},{"en":"An overquantity of data can make the report harder to read.","zh":"数据过多反而会让报告更难阅读。"},{"en":"The store reduced prices to get rid of an overquantity of winter coats.","zh":"商店降价以清理冬衣库存过量的问题。"}]}],"synonyms":["excess","surplus","overabundance","glut","too much"],"phonetic":"ˌoʊvərˈkwɑntəti","extraExplanation":["“overquantity”在现代英语里不算常用词，更常见、更自然的表达是“too much / an excess of / surplus (of) / overabundance”。在正式写作里，常用“excess”或“surplus”。"]}
{"word":"overquarter","summary":{"en":"Overquarter most commonly describes a three-quarters throwing/pitching arm angle (between overhand and sidearm). More rarely, it can mean coming from the rear side (the quarter) of something.","zh":"Overquarter最常见指“三分之四”出手/投球角度（介于正上手与侧投之间）；较少见时也可指从某物后侧（quarter）方向而来。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Sports, especially baseball) Describing a throwing or pitching motion with the arm coming over the shoulder but slightly to the side—between overhand and sidearm (often called a “three-quarters” arm angle).","zh":"（体育，尤指棒球）指投掷/投球时手臂从肩上方出手，但略偏向一侧的出手角度——介于正上手（overhand）与侧投（sidearm）之间（常称“三分之四”出手角度）。"},"examples":[{"en":"He’s an overquarter pitcher, so the ball has natural arm-side run.","zh":"他是三分之四出手的投手，所以球会自然向手臂一侧横移。"},{"en":"Try an overquarter release if overhand feels uncomfortable on your shoulder.","zh":"如果正上手让肩膀不舒服，可以试试三分之四出手。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare) Coming from or located over the rear side (the “quarter”) of something; from behind and slightly to one side.","zh":"（少见）从某物后侧（“quarter”指后方侧面）上方而来/位于其后侧上方；从后方略偏一侧。"},"examples":[{"en":"A gust hit the boat overquarter, pushing the stern off line.","zh":"一阵风从船尾侧后方吹来，把船尾推偏了。"},{"en":"The noise seemed to come from overquarter, somewhere behind his right shoulder.","zh":"声音似乎从他右肩后侧传来。"}]}],"synonyms":["three-quarters (arm slot/release)","over-quarter (variant spelling)","three-quarter arm angle"],"phonetic":"/ˌoʊvɚˈkwɔrtɚ/","extraExplanation":["“overquarter”不是非常常见的标准词形，更常见的写法是带连字符的“over-quarter”，或直接说“three-quarters (arm slot/release)”。在棒球语境里，它通常指介于overhand与sidearm之间的出手角度。","“quarter”在航海/方位表达中常指物体后方左右两侧的区域（例如“port/starboard quarter”），因此“overquarter”可理解为“从后侧上方”。"]}
{"word":"overquell","summary":{"en":"Overquell means to quell something completely—to fully suppress or calm it.","zh":"overquell 指“完全平息/彻底镇压”，语气比 quell 更强烈、也更偏书面。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to completely stop, suppress, or calm (something such as fear, rebellion, or emotion); to quell thoroughly","zh":"彻底镇压；完全平息（如叛乱、恐惧或情绪）"},"examples":[{"en":"The troops were sent to overquell the rebellion before it spread.","zh":"军队被派去彻底镇压叛乱，以免蔓延。"},{"en":"She tried to overquell her anger and speak calmly.","zh":"她努力压下怒火，平静地说话。"}]}],"synonyms":["quell","suppress","subdue","put down","stamp out"],"phonetic":"/ˌoʊvɚˈkwɛl/","extraExplanation":["“overquell”较少见，带有文艺或古风色彩；日常英语中更常用“quell / suppress / put down / stamp out”。","前缀“over-”在这里表示“彻底地、完全地”（强调程度），所以比“quell”更强烈，常用于描述“完全平息、彻底镇压”。"]}
{"word":"overquick","summary":{"en":"“Overquick” means too quick or overly hasty, often suggesting rashness.","zh":"“overquick”表示“过于匆忙/太快而草率”，常暗示鲁莽欠考虑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too quick; overly hasty or done with too much speed (often implying poor judgment).","zh":"过于匆忙的；太快的（常含“欠考虑、草率”的意思）。"},"examples":[{"en":"He was overquick to blame her before hearing the whole story.","zh":"他还没听完事情经过就急着怪她，太草率了。"},{"en":"An overquick decision can create problems later.","zh":"过于匆忙的决定以后可能会带来问题。"}]}],"synonyms":["overhasty","too quick","rash","impulsive","precipitate"],"phonetic":"/ˌoʊvɚˈkwɪk/","extraExplanation":["“overquick”在现代英语里比较少见，带有一点文学或古旧（archaic/literary）的感觉。日常表达更常用“too quick / overly hasty / rash”。它常用来强调“快得不合适”，而不仅仅是“速度快”。"]}
{"word":"overquickly","summary":{"en":"“Overquickly” means “too quickly,” often implying a lack of care or good judgment.","zh":"“overquickly”表示“过于匆忙地/太快地”，常暗示不够谨慎或判断不周。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too quickly; in a way that is faster than is wise, careful, or appropriate.","zh":"过于匆忙地；太快地（快到不够谨慎或不合适）。"},"examples":[{"en":"He overquickly agreed to the deal and later regretted it.","zh":"他过于匆忙地同意了这笔交易，后来后悔了。"},{"en":"Don’t judge her overquickly—listen to the whole story first.","zh":"别过于匆忙地下结论——先把事情听完整。"},{"en":"The team moved overquickly and made avoidable mistakes.","zh":"团队推进得过于匆忙，犯了一些本可避免的错误。"}]}],"synonyms":["too quickly","too fast","rashly","hastily","prematurely"],"phonetic":"ˌoʊvɚˈkwɪkli","extraExplanation":["“over-”作前缀时常带有“过度、超过适当程度”的意思，所以“overquickly”强调“快得不合时宜/不够谨慎”，语气比中性的“quickly（很快地）”更偏批评。日常英语里更常说“too quickly”或“too fast”，而“overquickly”较正式、较少见。"]}
{"word":"overquiet","summary":{"en":"“Overquiet” means “too quiet,” often suggesting an unusual or unsettling silence.","zh":"“Overquiet”表示“过于安静”，常带有“异常、让人不安的寂静”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not common) too quiet; quieter than is normal, expected, or comfortable.","zh":"（不常用）过于安静的；比正常、预期或让人舒服的程度更安静。"},"examples":[{"en":"The hallway felt overquiet after the students left.","zh":"学生离开后，走廊显得过于安静。"},{"en":"The overquiet room made her nervous, so she turned on some music.","zh":"房间安静得过分，让她紧张起来，于是她打开了音乐。"}]}],"synonyms":["too quiet","unnaturally quiet","eerily quiet","deathly quiet"],"phonetic":"/ˌoʊvɚˈkwaɪət/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overquiet 直译就是“太安静”。这个词在日常英语里不算常见，更常用的表达是 “too quiet / unnaturally quiet / eerily quiet”。有时作者会用 overquiet 来营造文学性的氛围（比如紧张、空荡、压抑的安静）。"]}
{"word":"overquietly","summary":{"en":"“Overquietly” means “too quietly,” often suggesting the quietness feels unusual or excessive.","zh":"“overquietly”表示“过于安静地”，常带有“安静得反常或过度”的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too quietly; in a way that is quieter than is appropriate, comfortable, or expected.","zh":"过于安静地；安静得不合时宜、让人不舒服或不符合情境地。"},"examples":[{"en":"He answered overquietly, so I had to ask him to repeat himself.","zh":"他回答得过于安静，所以我只好让他再说一遍。"},{"en":"The class was overquietly silent after the announcement.","zh":"公告之后，教室里安静得有些过头。"},{"en":"She closed the door overquietly, trying not to wake the baby.","zh":"她把门关得过于轻，尽量不吵醒宝宝。"}]}],"synonyms":["too quietly","very quietly","so quietly","in an unusually quiet way"],"phonetic":"/ˌoʊvɚˈkwaɪətli/","extraExplanation":["“over-”作前缀常表示“过度、太……”，所以 overquietly 强调“安静得过头”。日常口语里更常见的说法是 “too quietly / very quietly / so quietly”。","这个词相对少见，写作中用它可以突出一种“反常的安静”（比如紧张、压抑、害怕导致的低声）。"]}
{"word":"overquietness","summary":{"en":"“Overquietness” means excessive quiet or unusual silence, often implying the quiet feels uncomfortable or unnatural.","zh":"“overquietness”指“过于安静/过度沉默”，常含有这种安静让人不舒服或不正常的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being too quiet; an excessive or unusual lack of sound or conversation","zh":"过于安静；异常的寂静或过少的交谈"},"examples":[{"en":"The overquietness of the classroom made everyone nervous before the exam.","zh":"考前教室里过于安静的气氛让大家都紧张了。"},{"en":"After the guests left, the overquietness in the house felt heavy.","zh":"客人走后，屋子里过分的安静让人觉得压抑。"},{"en":"In the meeting, her overquietness was mistaken for disagreement.","zh":"在会议上，她过于沉默被误解为不赞同。"}]}],"synonyms":["excessive quiet","unnatural silence","dead silence","hushedness","stillness"],"phonetic":"/ˌoʊvərˈkwaɪətnəs/","extraExplanation":["“overquietness”并不是非常常见的标准词汇，更常见的表达是“too much quiet / excessive quiet / unnatural silence”。但它在语义上很透明：over- 表示“过度”，quietness 表示“安静/沉默”，合起来就是“过于安静”。","使用时常带一点主观感受：这种安静让人不舒服、紧张、或显得“不正常”（例如尴尬的冷场、暴风雨前的寂静）。"]}
