{"word":"overmagnetic","summary":{"en":"Overmagnetic means excessively magnetic or overly magnetized; rarely, it can describe someone as unnaturally “magnetic” socially.","zh":"overmagnetic 指“磁性过强/过度磁化的”；少见情况下也可比喻“（社交上）吸引力过强的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too strongly magnetic or overly affected by magnetism; excessively magnetized.","zh":"磁性过强的；过度受磁力影响的；（被）过度磁化的。"},"examples":[{"en":"The sensor gave unstable readings because the metal housing became overmagnetic after repeated exposure to strong fields.","zh":"这个传感器读数不稳定，因为金属外壳在反复暴露于强磁场后变得磁性过强。"},{"en":"Keep the tool away from the magnetizer—an overmagnetic tip can attract filings and damage delicate parts.","zh":"把工具远离磁化器——过度磁化的尖端会吸附金属屑，损坏精密部件。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, rare) Unnaturally or excessively attractive or “magnetic” in a social sense.","zh":"（比喻义，少见）过分有吸引力的；“磁性”过强、让人难以抗拒的。"},"examples":[{"en":"In the novel, the leader is portrayed as almost overmagnetic, drawing strangers into his orbit within minutes.","zh":"在小说里，这位领袖被写得几乎“磁性过强”，几分钟内就能把陌生人拉进自己的圈子。"},{"en":"Her overmagnetic charm made the conversation feel one-sided.","zh":"她过分有“磁性”的魅力让谈话显得有点不对等。"}]}],"synonyms":["overly magnetic","too strongly magnetized","excessively magnetized","strongly magnetic"],"phonetic":"/ˌoʊvərmæɡˈnɛtɪk/","extraExplanation":["“over-”是常见前缀，表示“过度、太多”（如 overheat 过热、overwork 过劳）。因此 overmagnetic 按构词法很好理解，但在日常英语里非常少见；技术写作中更常用 overly magnetic、too strongly magnetized、excessively magnetized 等表达。","如果你想描述“人很有吸引力”，更自然的说法是 magnetic、charismatic、captivating；overmagnetic 属于刻意/文学化或非常规用法。"]}
{"word":"overmagnetically","summary":{"en":"“Overmagnetically” means “too magnetically / with excessive magnetic attraction,” used rarely in modern English.","zh":"“overmagnetically”意为“过度地带磁性/磁力过强地”，现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively magnetic way; with too much magnetic force or attraction (literal or figurative).","zh":"以“过度磁性/磁力过强”的方式；带有过强的磁力或吸引力（可指字面磁力，也可作比喻）。"},"examples":[{"en":"The sensor readings looked distorted because the metal case was overmagnetically charged.","zh":"传感器读数看起来被扭曲了，因为金属外壳被过度磁化了。"},{"en":"He described the celebrity as overmagnetically charming, pulling everyone’s attention in seconds.","zh":"他形容那位名人魅力“过强”，几秒钟就把所有人的注意力都吸走了。"}]}],"synonyms":["excessively","overly","too magnetically","over-magnetized (technical)"],"phonetic":"/ˌoʊvərmæɡˈnɛtɪkli/","extraExplanation":["“overmagnetically”不是常用词，更常见的表达是：in an overly magnetic way / too magnetically / excessively magnetized（偏技术语境）。","构词：over-（过度）+ magnetically（磁性地/磁力地）。在科学写作中如果要强调“磁化过度”，常用 overly magnetized / over-magnetized，而不是 overmagnetically。"]}
{"word":"overmagnification","summary":{"en":"Overmagnification means making something seem much larger than it really is—literally in optics/images, or figuratively by blowing a small issue out of proportion.","zh":"overmagnification 指“过度放大”：既可指光学/成像中放大过头导致不清晰，也可比喻把小问题夸大成大问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or result of making something look much larger than it really is, especially by using too much magnification in optics or imaging.","zh":"把事物（尤其在光学或成像中）放大得过度、显得比实际大很多的行为或结果。"},"examples":[{"en":"At high power, overmagnification can make the image look bigger but not clearer.","zh":"在高倍率下，过度放大可能让影像看起来更大，但不会更清晰。"},{"en":"The microscope photo suffered from overmagnification, so the details looked blurry.","zh":"这张显微镜照片出现了过度放大，所以细节看起来很模糊。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, treating a problem, detail, or fear as much bigger or more important than it really is.","zh":"（比喻）把问题、细节或恐惧看得过大、过于重要，夸大其影响。"},"examples":[{"en":"Her overmagnification of a small mistake made her unnecessarily anxious.","zh":"她把一个小失误过度放大，导致不必要的焦虑。"},{"en":"Social media can encourage overmagnification of minor conflicts.","zh":"社交媒体可能会助长对小矛盾的过度放大。"}]}],"synonyms":["excessive magnification","over-enlargement","exaggeration","blow out of proportion"],"phonetic":"/ˌoʊvərˌmæɡnəfəˈkeɪʃən/","extraExplanation":["在光学里，overmagnification 常指“倍率上去了，但分辨率没跟上”，于是画面变大却更糊；中文常说“空放大”或“放大过度”。","比喻用法常见于心理与写作语境：把小事“放大成大事”。与 exaggeration（夸张）接近，但 overmagnification 更强调“像用放大镜一样把局部放得太大”。"]}
{"word":"overmagnified","summary":{"en":"Overmagnified means enlarged too much or made to seem too important.","zh":"overmagnified 指“被过度放大（尺寸或重要性）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to look larger than it really is; enlarged too much (literally in size or figuratively in importance).","zh":"被放得过大；被过度放大（字面指尺寸，或引申指重要性/问题被夸大）。"},"examples":[{"en":"The photo was so overmagnified that it became blurry and lost detail.","zh":"照片被过度放大，结果变得模糊、细节也没了。"},{"en":"In the meeting, one small mistake was overmagnified and treated like a major failure.","zh":"在会议上，一个小失误被过度放大，被当成严重失败。"}]}],"synonyms":["overenlarged","overblown","exaggerated","overemphasized","overstated"],"phonetic":"/ˌoʊvərˈmæɡnəˌfaɪd/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度/超过正常程度”（如 overwork 过度工作、overthink 想太多）。因此 overmagnified = magnified（放大）得过头了。","这个词常见于光学/显微镜/图片处理等语境；在写作或口语中也可用来形容“把小事夸大”。日常表达里也常用 overly magnified / exaggerated 来替换。"]}
{"word":"overmagnifies","summary":{"en":"Overmagnifies means exaggerates something or magnifies it too much.","zh":"overmagnifies 指“夸大、过度放大”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make something seem bigger, more important, or more serious than it really is; to exaggerate.","zh":"把某事说得或看得比实际更大/更重要/更严重；夸大。"},"examples":[{"en":"The headline overmagnifies a small mistake into a major scandal.","zh":"这条标题把一个小错误夸大成重大丑闻。"},{"en":"He tends to overmagnify other people’s criticism and forget the praise.","zh":"他常常会把别人的批评放大，却忽略表扬。"},{"en":"Social media sometimes overmagnifies tiny differences between groups.","zh":"社交媒体有时会放大群体之间很小的差异。"}]},{"partOfSpeech":"vt.","definition":{"en":"To magnify too much so that something looks unnaturally large or distorted (often about images, lenses, or close-ups).","zh":"（常指图像、镜头、特写）放大过度，导致看起来过大或变形。"},"examples":[{"en":"This camera setting overmagnifies the texture and makes the skin look rough.","zh":"这个相机设置放大过度，让皮肤纹理看起来很粗糙。"},{"en":"The microscope overmagnifies the sample, so the picture becomes blurry.","zh":"显微镜放大过度，所以图像变得模糊。"}]}],"synonyms":["exaggerates","overstates","blows out of proportion","magnifies too much","inflates"],"phonetic":"/ˌoʊvərˈmæɡnəˌfaɪz/","extraExplanation":["“over-”是英语里常见前缀，表示“过度、太……”。所以 overmagnify 字面意思就是“放大过头”。","“overmagnifies”是第三人称单数现在时（he/she/it overmagnifies）。原形是 overmagnify；过去式 overmagnified；现在分词 overmagnifying。"]}
{"word":"overmagnify","summary":{"en":"Overmagnify means to exaggerate by making something seem bigger or more serious than it is.","zh":"overmagnify 指通过“过度放大”来夸大其重要性或严重性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something seem bigger, more important, or more serious than it really is; to exaggerate","zh":"把某事显得比实际更大、更重要或更严重；夸大"},"examples":[{"en":"The media sometimes overmagnify small mistakes into major scandals.","zh":"媒体有时会把小错误过度放大成重大丑闻。"},{"en":"Try not to overmagnify one bad comment—most people liked your presentation.","zh":"别把一句负面评价过度放大——大多数人喜欢你的演讲。"},{"en":"He tends to overmagnify minor symptoms and worry himself sick.","zh":"他常把轻微症状过度放大，结果把自己担心得不行。"}]}],"synonyms":["exaggerate","overstate","blow out of proportion","make too much of"],"phonetic":"ˌoʊvərˈmæɡnɪfaɪ","extraExplanation":["“overmagnify”由前缀 over-（过度）+ magnify（放大）组成，常用于批评某人把小事“无限上纲/小题大做”。","语气上通常带有负面评价，暗示夸大导致误解、恐慌或不必要的冲突。"]}
{"word":"overmagnifying","summary":{"en":"“Overmagnifying” means exaggerating by magnifying something too much—making it seem bigger or more important than it is.","zh":"“overmagnifying”指把某事过度放大、过度强调，让它看起来比实际更大或更重要。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making something seem bigger, more serious, or more important than it really is; magnifying too much","zh":"把某事看得过大、过严重或过重要；过度放大"},"examples":[{"en":"You’re overmagnifying the mistake—it's minor and easy to fix.","zh":"你把这个错误看得太严重了——其实很小，很容易修正。"},{"en":"Social media can encourage overmagnifying small conflicts into big drama.","zh":"社交媒体可能会让人把小冲突过度放大成大风波。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “overmagnify”: to magnify or emphasize something too much","zh":"“overmagnify”的现在分词：对某事过度放大或过度强调"},"examples":[{"en":"The report is overmagnifying one statistic and ignoring the overall trend.","zh":"这份报告过度强调某一个数据，却忽视了整体趋势。"},{"en":"By overmagnifying her flaws, he forgot her strengths.","zh":"他把她的缺点过度放大，反而忘了她的优点。"}]}],"synonyms":["exaggerating","overemphasizing","blowing out of proportion","overstating","making too much of"],"phonetic":"/ˌoʊvərˈmæɡnəˌfaɪɪŋ/","extraExplanation":["“overmagnifying”在日常英语里不算最常用，更常见的表达是“exaggerating（夸大）”或“blowing it out of proportion（小题大做）”。但“overmagnify”更强调像用放大镜一样把细节放大，常用于谈论问题、风险、差错、数据解读等。","搭配建议：overmagnify a problem/an issue/a risk/a mistake/a detail（把问题/风险/错误/细节过度放大）。语气通常带有劝人冷静、别把事情看得太夸张的意味。"]}
{"word":"overmagnitude","summary":{"en":"“Overmagnitude” is an uncommon word meaning excessively large in magnitude (too big/too strong), used mostly in technical or formal contexts.","zh":"“Overmagnitude”是不常用词，表示“幅度/规模/强度过大（过强、过高）”，多见于技术或较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) too great in size, amount, or intensity; excessively large in magnitude.","zh":"（不常用）规模、数量或强度过大；幅度过高的。"},"examples":[{"en":"The estimate turned out to be overmagnitude, so the project budget had to be revised.","zh":"这个估算结果幅度过高，所以项目预算不得不重新调整。"},{"en":"The response was overmagnitude for such a small mistake.","zh":"对这么小的错误，这种反应显得过于强烈。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncommon, technical) an excessive or unusually large magnitude (degree/size) of something.","zh":"（不常用，偏技术）某事物过大的量级/幅度/程度。"},"examples":[{"en":"Engineers flagged an overmagnitude in the vibration readings.","zh":"工程师在振动读数中发现了异常偏大的幅度。"},{"en":"The paper discusses how measurement error can create apparent overmagnitude.","zh":"论文讨论了测量误差如何造成表面上的“幅度过大”。"}]}],"synonyms":["excessive","too large","oversized","out of proportion","overestimated"],"phonetic":"/ˌoʊvərˈmæɡnəˌtud/","extraExplanation":["“overmagnitude”不是日常英语里的常用词，更常见的表达是：too large、excessive、overly strong、out of proportion，或在技术语境中用oversized / overestimated / above the expected range。","构词上可理解为 over-（过度）+ magnitude（大小、量级、震级、强度等）。在不同领域 magnitude 的含义会变：如地震“震级”、物理“量级/幅度”、统计“效应大小”等，因此 overmagnitude 的具体含义通常要看上下文。"]}
{"word":"overmajority","summary":{"en":"An overmajority is a larger-than-half majority (a supermajority), often required for major decisions.","zh":"overmajority 指超过简单多数的“超多数/超级多数”，常用于重大决策所需票数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A majority that is larger than a simple majority (more than half), often required for important decisions such as constitutional changes or overriding a veto; a supermajority.","zh":"超过简单多数（超过一半）的更大多数，常用于重大决策（如修改宪法、推翻否决等）所要求的票数；即“超级多数”。"},"examples":[{"en":"The proposal failed because it needed an overmajority of two-thirds to pass.","zh":"该提案未通过，因为它需要三分之二的超多数票才能通过。"},{"en":"The rules require an overmajority for changing the organization’s charter.","zh":"规章要求修改组织章程必须获得超多数票。"}]}],"synonyms":["supermajority","qualified majority"],"phonetic":"/ˌoʊvərməˈdʒɔrəti/","extraExplanation":["“overmajority”在实际英语中不如“supermajority”常见；在新闻、法律或政治文本里，通常用“a supermajority (of two-thirds/three-fifths)”来表达更自然。","不同制度对“overmajority/ supermajority”的门槛不一样：常见有2/3（two-thirds）、3/5（three-fifths）等；学习时注意它通常会跟具体比例一起出现。"]}
{"word":"overmalapert","summary":{"en":"Overmalapert means excessively impudent or disrespectfully bold (archaic).","zh":"overmalapert 指“过分无礼、放肆到过头”（古/罕用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively bold or impudent; overly rude in a way that feels disrespectful (archaic/rare).","zh":"过分无礼的；太放肆的；过度胆大而不尊重人的（古/罕用）。"},"examples":[{"en":"The young man’s overmalapert remarks offended the guests.","zh":"那位年轻人过分无礼的言论冒犯了宾客。"},{"en":"She found his overmalapert tone more insulting than his actual words.","zh":"她觉得他那种过度放肆的语气比他说的话本身更侮辱人。"}]}],"synonyms":["impudent","insolent","impertinent","cheeky","brazen"],"phonetic":"ˌoʊvərˈmæləpɚt","extraExplanation":["“over-”表示“过度、太……”，用来加强后面词的程度；“malapert”本身就有“冒失、无礼、胆大妄为”的意思，所以“overmalapert”就是“无礼到过头”。","“malapert”源自中古法语，带有文学/古风色彩；现代英语里更常用的替代词是“impudent / insolent / cheeky / impertinent”。在写作中用“overmalapert”会显得刻意古雅或讽刺。"]}
{"word":"overman","summary":{"en":"Overman can mean a workplace supervisor (old-fashioned) or, in Nietzsche’s philosophy, an ideal person who overcomes themselves and creates new values (Übermensch).","zh":"overman 可指（较旧用法的）工头/监督员，也可指尼采哲学中的“超人”（Übermensch），强调自我超越与创造新价值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A supervisor or foreman; a person who manages workers, especially in a mine or industrial setting. (Less common today.)","zh":"工头；监督员（尤指矿井或工业场所中管理工人的人，现较少见）。"},"examples":[{"en":"The overman checked the crew’s safety gear before the shift began.","zh":"工头在开工前检查了工人的安全装备。"},{"en":"If there’s a problem with the schedule, talk to the overman.","zh":"如果排班有问题，就去找工头。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy (especially Nietzsche), an ideal “higher” human being who creates new values and overcomes conventional morality; often translated as “Übermensch.”","zh":"（哲学用语，尤指尼采）“超人”：指一种理想的、更高层次的人，能自我超越并创造新的价值；常译自德语“Übermensch”。"},"examples":[{"en":"In Nietzsche’s writing, the overman represents self-overcoming and the creation of new values.","zh":"在尼采的著作中，“超人”象征自我超越与创造新价值。"},{"en":"Some readers confuse the overman with a superhero, but the idea is philosophical rather than comic-book fantasy.","zh":"有人把“超人”误解为超级英雄，但它是哲学概念，并非漫画式幻想。"}]}],"synonyms":["foreman","supervisor","manager","Übermensch"],"phonetic":"/ˈoʊvərmæn/","extraExplanation":["“overman”作为尼采术语时，常见翻译是“超人”，也有人译作“超人类/超越之人”。它强调的是“自我超越、价值重估”，而不是体力更强或统治他人的“强者”。","历史上该词有时被错误地与种族主义或政治宣传挂钩；学习时建议回到原始哲学语境，避免把它理解为“优等人/统治者”。","相关阅读线索：尼采《查拉图斯特拉如是说》(Thus Spoke Zarathustra) 中对“Übermensch/overman”的讨论最为集中。"]}
{"word":"overmanage","summary":{"en":"Overmanage means to manage too much or too closely, often controlling unnecessary details (micromanage).","zh":"overmanage 指过度管理、管得太细，常带贬义（类似 micromanage）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to manage or supervise someone or something too closely or too much, often by controlling small details; to micromanage","zh":"对某人或某事管理过度、管得太细（常指控制细节过多）；过度干预（相当于 micromanage）"},"examples":[{"en":"Our boss tends to overmanage, so people feel they can’t make decisions on their own.","zh":"我们老板有点过度管理，所以大家觉得自己没法独立做决定。"},{"en":"Try not to overmanage the project—set clear goals and let the team work.","zh":"这个项目别管得太细——把目标说清楚，让团队自己推进。"},{"en":"When parents overmanage their children’s schedules, kids may become more anxious.","zh":"当父母过度安排和管理孩子的日程时，孩子可能会更焦虑。"}]}],"synonyms":["micromanage","oversee too closely","control excessively"],"phonetic":"/ˌoʊvərˈmænɪdʒ/","extraExplanation":["“over-”表示“过度/超过适当程度”（如 overwork 过度工作，overprotect 过度保护）。因此 overmanage 通常带有负面评价，常见于职场语境，强调“管得太细、事无巨细都要插手”。","在更常用的表达里，人们也会直接说 micromanage（微观管理/事无巨细地管）。"]}
{"word":"overmanaged","summary":{"en":"“Overmanaged” describes a situation or group that is controlled too much, often making work slower and less creative.","zh":"“overmanaged”指被过度控制或管得太多的情况或团队，常导致工作变慢、创造力和主动性下降。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Managed too much or too tightly, with excessive control, rules, or supervision, often reducing efficiency, creativity, or morale.","zh":"被过度管理的；管得太多、太严的（通常会降低效率、创造力或士气）。"},"examples":[{"en":"The project felt overmanaged, with three different approvals for every small change.","zh":"这个项目感觉被过度管理了，每一个小改动都要经过三道不同的审批。"},{"en":"An overmanaged team may stop taking initiative because every decision is made for them.","zh":"被过度管理的团队可能会停止主动性，因为每个决定都有人替他们做了。"},{"en":"She left the company because the culture was overmanaged and bureaucratic.","zh":"她离开了那家公司，因为企业文化过度管理、官僚主义严重。"}]},{"partOfSpeech":"adj.","definition":{"en":"Past participle of “overmanage”: to manage something excessively.","zh":"“overmanage”的过去分词：对某事进行过度管理。"},"examples":[{"en":"The event was overmanaged, so planning meetings took longer than the actual work.","zh":"这场活动被过度管理了，结果开会的时间比真正干活的时间还长。"},{"en":"If a process is overmanaged, it can become slow and frustrating.","zh":"如果一个流程被过度管理，就会变得缓慢而令人沮丧。"}]}],"synonyms":["micromanaged","overcontrolled","bureaucratic","overregulated","managed to death"],"phonetic":"/ˌoʊvərˈmænɪdʒd/","extraExplanation":["“overmanaged”常用来批评管理方式过于“微观管理”（micromanagement），例如层层审批、频繁汇报、规则过多等。它的语气通常偏负面，强调‘控制过度’带来的副作用（效率下降、员工缺乏自主性）。","在职场语境里，它也常与“bureaucratic（官僚的）”“red tape（繁文缛节）”“too many cooks（人多手杂）”这类表达一起出现，用来描述组织运行不够灵活。"]}
{"word":"overmanaging","summary":{"en":"Overmanaging means managing too much or too closely (micromanaging), often in a controlling way.","zh":"overmanaging 指过度管理、管得太细太多（类似微观管理），常带“控制欲强”的负面含义。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Managing something too closely or too much, often by controlling small details and not trusting others to work independently (similar to “micromanaging”).","zh":"过度管理；把事情管得太细、太多，常常表现为不放心别人独立完成工作（类似“事无巨细地管/微观管理”）。"},"examples":[{"en":"Overmanaging your team can reduce motivation and creativity.","zh":"过度管理团队会降低士气和创造力。"},{"en":"She realized she was overmanaging and started delegating more.","zh":"她意识到自己管得太多，于是开始更多地授权。"},{"en":"The project slowed down because of overmanaging and constant approvals.","zh":"由于过度管理和频繁审批，项目进度变慢了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a style of management that is overly controlling or involved in minor details.","zh":"（形容）管理方式过于控制、过度介入细节的。"},"examples":[{"en":"His overmanaging approach made people afraid to make decisions.","zh":"他那种过度管理的方式让大家不敢自己做决定。"},{"en":"An overmanaging boss may check your work many times a day.","zh":"一个过度管理的老板可能一天要检查你好几次工作。"}]}],"synonyms":["micromanaging","overcontrolling","nitpicking","interfering"],"phonetic":"/ˌoʊvɚˈmænɪdʒɪŋ/","extraExplanation":["“overmanaging”在职场语境里常带负面评价，暗示管理者不信任下属、频繁插手细节，可能导致效率下降、员工压力变大。","常见近义表达是“micromanaging / micromanage”，语气更口语、更常用；“overmanage”相对更正式一些。","更中性的替代表达可以是“be very hands-on（非常亲力亲为）”，但“hands-on”不一定负面，取决于语境。"]}
{"word":"overmanned","summary":{"en":"Overmanned means having more people than needed (overstaffed).","zh":"overmanned 指人员多于所需，即“人手超编/过多”（类似 overstaffed）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having more people (especially workers or soldiers) than are needed for a job, task, or organization; overstaffed.","zh":"人员过多的；人手超编的（尤指工作人员或军队人数超过实际需要）。"},"examples":[{"en":"The store was overmanned on weekdays but short-staffed on weekends.","zh":"这家店工作日人员过多，但周末却人手不足。"},{"en":"The unit was judged to be overmanned, so some troops were reassigned.","zh":"该部队被认为人员超编，因此一些士兵被重新调派。"}]}],"synonyms":["overstaffed","overfilled","staff-heavy","oversupplied"],"phonetic":"ˌoʊvərˈmænd","extraExplanation":["“overmanned”常见于军事、政府机构或大型组织的人力配置讨论中，语气偏正式，强调“编制/配置超过需求”。日常职场里更常用“overstaffed”。","常与“undermanned（人手不足的）”对比使用：overmanned强调“太多”，undermanned强调“太少”。"]}
{"word":"overmanning","summary":{"en":"Overmanning means having more workers than needed (overstaffing).","zh":"Overmanning 指人员配备超过需要（超编/人员过多）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the situation of having more workers (or crew members) than are needed for a job, shift, or operation; overstaffing","zh":"人员过多；超编；（某项工作/班次/运营）配备的人手超过需要"},"examples":[{"en":"The factory reduced costs by addressing overmanning on the night shift.","zh":"工厂通过解决夜班人员过多的问题来降低成本。"},{"en":"Overmanning can slow decisions because too many people are doing the same task.","zh":"人员过多可能会让决策变慢，因为太多人在做同一件事。"},{"en":"The report warned that overmanning in the office was hurting productivity.","zh":"报告警告说，办公室人员过多正在损害生产力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of staffing something with more people than necessary","zh":"（行为/过程）给某处配备过多人员；过度用工"},"examples":[{"en":"The union criticized the overmanning of temporary positions.","zh":"工会批评了临时岗位的过度用工。"},{"en":"Management began overmanning the project to meet a tight deadline, but costs rose quickly.","zh":"管理层为了赶工期开始给项目配备过多人手，但成本很快上涨。"}]}],"synonyms":["overstaffing","excess staffing","overemployment","bloated staffing"],"phonetic":"/ˌoʊvərˈmænɪŋ/","extraExplanation":["“overmanning”常见于商业、管理、工会与劳资谈判语境，尤其在制造业、航运（crew）、公共部门等讨论“人员配置是否合理”时出现。","词源上来自 over-（过度）+ man（给……配人手）+ -ing（名词化），含义通常偏负面，强调效率下降或成本上升。"]}
{"word":"overmans","summary":{"en":"“Overmans” is usually the plural of “overman,” meaning either workplace supervisors (especially in mines) or, in philosophy, people who surpass ordinary human limits (Nietzsche-related).","zh":"“Overmans”通常是“overman”的复数：可指（尤在矿业中）监督员/工头；也可在哲学语境中指超越常人的“超人”（与尼采相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of overman: a supervisor, especially in a mine or industrial workplace (similar to a foreman).","zh":"overman 的复数：监督员/工头，尤指矿井或工业现场的管理者（类似 foreman）。"},"examples":[{"en":"Two overmans inspected the mine before the night shift began.","zh":"夜班开始前，两位矿井监督员检查了矿井。"},{"en":"The overmans reported the safety issue to the manager immediately.","zh":"工头们立刻把安全问题汇报给经理。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of overman (philosophy/literature): a person imagined as surpassing ordinary human limits; often linked to Nietzsche’s idea of the “Übermensch.”","zh":"overman 的复数（哲学/文学）：指被想象为超越普通人极限的人；常与尼采的“Übermensch（超人）”概念相关。"},"examples":[{"en":"In some translations, the text speaks of “overmans” who create new values.","zh":"在一些译本中，文本提到“overmans（超人）”会创造新的价值。"},{"en":"The novel treats its heroes like overmans, above everyday rules.","zh":"这部小说把主角写得像“超人”，凌驾于日常规则之上。"}]}],"synonyms":["foremen","supervisors","bosses","superiors"],"phonetic":"/ˈoʊvərmæn/","extraExplanation":["“Overman”在英语里有两条常见来源：一条是工业/矿业用语，指负责监督作业与安全的现场管理者；另一条来自德语“Übermensch”的译法之一（也常译为“superman”或“overman”）。在阅读哲学或文学时，要根据上下文判断是哪一种意思。","如果你看到的是大写的“Overmans”，它也可能是姓氏（如荷兰姓），此时通常不按词义翻译。"]}
{"word":"overmantel","summary":{"en":"An overmantel is a decorative feature placed above a fireplace mantel, often a mirror or painting.","zh":"overmantel 指壁炉台上方的装饰构件或装饰物，常见为镜子或画作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative shelf, mirror, painting, or architectural panel placed above a fireplace mantel.","zh":"壁炉台上方的装饰物（如装饰搁板、镜子、画作或装饰面板）。"},"examples":[{"en":"They hung an old landscape painting as an overmantel above the fireplace.","zh":"他们把一幅旧的风景画挂在壁炉上方，作为壁炉上方装饰。"},{"en":"The mirror overmantel makes the living room look brighter and larger.","zh":"壁炉上方的镜面装饰让客厅看起来更明亮、更宽敞。"}]}],"synonyms":["mantel mirror","overmantel mirror","chimneypiece (broader)"],"phonetic":"/ˌoʊvərˈmæntəl/","extraExplanation":["overmantel 是英式与建筑/室内装饰语境里常见的词，由 over（在……上方）+ mantel（壁炉架/壁炉台）构成。它既可以指“壁炉上方的那块装饰区域/构件”，也常指放在那里的具体物件（尤其是镜子或画）。","在较传统的西方住宅里，壁炉是客厅视觉中心，overmantel 往往用于强调“中轴对称”的布置：壁炉台（mantel）+ 上方镜子/画（overmantel）+ 两侧壁灯或摆件。"]}
{"word":"overmantle","summary":{"en":"Overmantle means either an outer cloak worn over other clothes, or (in geology) the upper part of Earth’s mantle.","zh":"Overmantle 可指穿在外面的披风/斗篷；也可指（地质）上地幔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A loose outer cloak or mantle worn over other clothing; an outer covering garment.","zh":"外披风；外斗篷（穿在其他衣物外面的宽松外衣）"},"examples":[{"en":"In the portrait, the noblewoman wears an overmantle fastened with a jeweled clasp.","zh":"在那幅肖像里，这位贵妇披着一件用宝石扣固定的外披风。"},{"en":"He threw on an overmantle to keep warm during the evening walk.","zh":"他出门晚间散步时披上一件外斗篷保暖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Geology) The part of Earth’s mantle above the lower mantle; the upper mantle.","zh":"（地质）上地幔；地幔上部（相对于下地幔）"},"examples":[{"en":"Some textbooks use “overmantle” to refer to the upper mantle.","zh":"一些教材用 overmantle 指上地幔。"},{"en":"Changes in temperature and pressure affect rocks in the overmantle.","zh":"温度与压力的变化会影响上地幔中的岩石。"}]}],"synonyms":["cloak","mantle","outer garment","upper mantle"],"phonetic":"/ˈoʊvərˌmæntəl/","extraExplanation":["“over-”有“在……之上/外面”的意思，mantle 常指“披风”或“覆盖层”。因此 overmantle 既可按字面理解为“外层披风”，也可在地质语境中理解为“上部的地幔”。","作为服饰词时较偏文学/历史语境；地质义在现代学术写作中更常见的说法通常是 upper mantle（上地幔）。"]}
{"word":"overmany","summary":{"en":"“Overmany” means “too many,” but it’s rare and old-fashioned in modern English.","zh":"“overmany”表示“太多/过多”，但在现代英语中较少见、偏旧式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too many; more than is needed or appropriate (rare/old-fashioned).","zh":"过多的；太多的（较少见/较旧式的用法）。"},"examples":[{"en":"We bought overmany supplies, and a lot of them went to waste.","zh":"我们买了过多的物资，结果很多都浪费了。"},{"en":"Overmany meetings can slow a team down.","zh":"会议太多会拖慢团队效率。"}]}],"synonyms":["too many","excessive","overabundant","superfluous"],"phonetic":"/ˌoʊvɚˈmɛni/","extraExplanation":["“overmany”在现代英语里很少用，通常会用更自然的表达：too many（太多的）、far too many（多得离谱）、an excessive number of（过量的）。","它由 over-（过度、超过）+ many（许多）构成，语感偏书面或古风；在日常交流中用“too many”更地道。"]}
{"word":"overmarch","summary":{"en":"Overmarch means to march too far or too long, often beyond what was planned, leading to exhaustion.","zh":"overmarch 指（行军）走得过远或过久，超过计划，常导致疲劳。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to march too far, too long, or beyond the planned distance (often causing exhaustion or trouble)","zh":"（尤指行军）走得过远、过久或超过原定距离（常导致疲劳或麻烦）"},"examples":[{"en":"The troops overmarched and arrived exhausted before dawn.","zh":"部队行军过度，在黎明前就疲惫不堪地抵达。"},{"en":"If we overmarch today, we won’t have energy for tomorrow’s hike.","zh":"如果我们今天走太多路，明天徒步就没力气了。"}]},{"partOfSpeech":"v.","definition":{"en":"to go past or exceed a limit (used more rarely and often in formal or military writing)","zh":"超越界限；超过限度（较少用，多见于较正式或军事语境）"},"examples":[{"en":"In their haste, the units overmarched the intended stopping point.","zh":"在匆忙中，这些部队越过了原定的停驻点。"}]}],"synonyms":["overextend","go too far","march too far","exceed"],"phonetic":"ˌoʊvərˈmɑrtʃ","extraExplanation":["“over-”这个前缀常表示“过度、超过”（如 overwork 过度工作、overeat 吃太多）。因此 overmarch 的核心含义就是“行军过度”。","这个词在现代日常英语里不算常见，更常在军事史、战争叙述或较正式的报道中出现；日常表达里也可以用 “march too far/too long” 来替代。"]}
{"word":"overmark","summary":{"en":"Overmark means to mark something too much, or (in finance) to record a value that is too high.","zh":"overmark 指“过度标记”，也可指（金融中）“高估入账/把价值记得过高”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to mark something too much or beyond what is needed (for example, making too many marks, labels, or corrections)","zh":"过度标记；标得过多（例如加了太多记号、标签或修改）"},"examples":[{"en":"Don’t overmark the worksheet—just circle the key mistakes.","zh":"别把练习册批得太满——把主要错误圈出来就好。"},{"en":"The editor warned that if you overmark the draft, the writer may feel overwhelmed.","zh":"编辑提醒说，如果你把稿子改得太满，作者可能会感到压力很大。"}]},{"partOfSpeech":"vt.","definition":{"en":"(finance/accounting) to value an asset or position at too high a price when recording or reporting it","zh":"（金融/会计）高估；把资产或头寸记账记得过高"},"examples":[{"en":"The fund was accused of overmarking its illiquid holdings to make returns look better.","zh":"该基金被指控高估其流动性差的持仓，以让收益看起来更好。"},{"en":"Auditors reviewed the pricing model to ensure the portfolio wasn’t overmarked.","zh":"审计人员审查了定价模型，以确保投资组合没有被高估入账。"}]}],"synonyms":["mark up","overestimate","overvalue","overstate"],"phonetic":"ˌoʊvɚˈmɑrk","extraExplanation":["“overmark”在日常英语里不算常见，但在金融语境里更常见，尤其与“mark-to-market（按市价计价）”相关：如果用不可靠的价格或过于乐观的模型给资产估值，就可能被说成overmark。相对的词有“undermark（低估）”。"]}
{"word":"overmarking","summary":{"en":"Overmarking means marking or correcting too much, or (in finance) valuing/pricing something too high.","zh":"overmarking 指过度批改/过度标注；在金融语境也可指把价格或估值标得过高。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of marking or correcting too much (for example, writing too many comments, underlining too many errors, or correcting every small mistake), often making the work hard to read or discouraging for the writer.","zh":"（尤其在批改作业/文章时）过度批注、过度纠错；把太多地方都标出来，常会让作品难以阅读或让写作者受挫。"},"examples":[{"en":"The teacher worried that overmarking would overwhelm beginners, so she focused on just three key grammar points.","zh":"老师担心过度批改会让初学者压力太大，所以她只集中指出三个关键语法点。"},{"en":"Overmarking can make students fix surface errors without improving their ideas.","zh":"过度批注可能会让学生只修小错误，却没有提升内容与观点。"}]},{"partOfSpeech":"n.","definition":{"en":"In business or finance, the act of marking a price or value too high (for example, pricing goods too high or valuing an asset above what it is really worth).","zh":"（商业/金融）把价格或估值标得过高；高估商品或资产的价值。"},"examples":[{"en":"The report accused the firm of overmarking certain assets on its books.","zh":"报告指责该公司在账面上对某些资产进行了高估。"},{"en":"Overmarking the product hurt sales because customers found cheaper options elsewhere.","zh":"把产品定价过高影响了销量，因为顾客在别处找到了更便宜的选择。"}]}],"synonyms":["excessive marking","overcorrection","overediting","overvaluation","overpricing"],"phonetic":"/ˌoʊvərˈmɑrkɪŋ/","extraExplanation":["在写作教学里，很多老师会强调避免 overmarking：与其把每个小错误都改掉，不如优先标出“最影响理解/最常见”的问题（比如时态一致、主谓一致、文章结构），这样学生更容易吸收并改进。","金融语境里常见的动词是 overmark（把估值标高），名词 overmarking 多见于批评或审计/合规讨论。"]}
{"word":"overmarl","summary":{"en":"A rare farming term meaning to apply too much marl to soil.","zh":"一个较罕见的农业用词，指在土壤上施用过量的泥灰。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to apply too much marl (a lime-rich clay) to soil; to “over-lime” land using marl","zh":"在土壤上施用过量的泥灰（土壤改良材料，富含石灰的黏土）；用泥灰“施过头”"},"examples":[{"en":"The farmer overmarled the field, and the plants began to struggle.","zh":"农民在田里施了过量的泥灰，结果作物开始长得吃力。"},{"en":"Be careful not to overmarl light, sandy soil.","zh":"对轻质沙土要小心，别施泥灰过量。"}]}],"synonyms":["over-lime","apply too much lime","use too much marl"],"phonetic":"/ˌoʊvərˈmɑrl/","extraExplanation":["“Overmarl”非常少见，多见于农业/土壤改良的语境，可理解为 over-（过度）+ marl（泥灰）。日常英语里更常说 over-lime（施石灰过量）或 simply use too much lime/marl（用太多石灰/泥灰）。","marl（泥灰）是一种含碳酸钙较多的黏土或土，用来降低土壤酸度、改善结构；但过量可能导致养分失衡、影响植物吸收。"]}
{"word":"overmask","summary":{"en":"Overmask means to mask something too much, or (in technical use) to add an extra masking layer on top of another.","zh":"Overmask 指“过度遮盖”，也可作技术用语表示“在原遮罩上再加一层遮罩/遮罩层”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cover or hide something too much with a mask, covering, or layer so that important details are blocked.","zh":"（把某物）过度遮盖；遮得太严，以致重要细节被挡住。"},"examples":[{"en":"The heavy makeup can overmask your natural skin texture.","zh":"妆太厚可能会过度遮住你皮肤的自然质感。"},{"en":"Strong fragrance may overmask the subtle notes of the tea.","zh":"味道太浓的香气可能会盖过茶的细微香气。"}]},{"partOfSpeech":"vt.","definition":{"en":"(technical) to apply an additional masking layer over an existing mask, especially in manufacturing or imaging processes.","zh":"（技术用语）在已有遮罩之上再加一层遮罩（常见于制造或成像流程）。"},"examples":[{"en":"In some processes, engineers overmask the area to protect nearby parts during etching.","zh":"在某些工艺中，工程师会对该区域进行加遮罩，以在蚀刻时保护附近部件。"},{"en":"The technician overmasked the edges to prevent overspray.","zh":"技术员在边缘加遮盖，以防喷涂飞散。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) an extra masking layer applied on top of another mask.","zh":"（技术用语）加遮罩；覆盖在原遮罩之上的额外遮罩层。"},"examples":[{"en":"Add an overmask if the first mask isn’t strong enough for the next step.","zh":"如果第一层遮罩不足以应付下一步，就加一层 overmask。"}]}],"synonyms":["overcover","obscure","conceal too much","add an extra mask","double-mask"],"phonetic":"/ˌoʊvɚˈmæsk/","extraExplanation":["“over-”常表示“过度（too much）”或“在……之上（on top of）”。因此 overmask 在日常语境里多指“遮得过头”，在技术语境里更常指“叠加一层遮罩/保护层”。","这是一个相对少见的词，很多场合会用更常见的表达替代：overly cover（遮太多）、mask too much（遮得太多）、add an extra mask/layer（再加一层遮罩/涂层）。"]}
{"word":"overmast","summary":{"en":"Overmast means to put masts on a boat that are too large, or describe a boat with overly large masts.","zh":"overmast 指（航海）给船配上过高/过重的桅杆，或形容船桅杆配置过度。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to equip a ship or boat with masts that are too tall/heavy for it (so it may handle poorly or be unsafe).","zh":"（航海）给船装上过高或过重的桅杆；使船“桅杆配置过度”，从而可能影响操控或安全。"},"examples":[{"en":"The designer warned that the boat would be overmasted in strong winds.","zh":"设计师警告说，这条船在大风中会因为桅杆配置过度而不安全。"},{"en":"If you overmast a small yacht, it can become hard to control when the weather changes.","zh":"如果给小型游艇装上过高的桅杆，天气一变就可能变得很难操控。"}]},{"partOfSpeech":"adj.","definition":{"en":"having masts that are too tall/heavy for the vessel.","zh":"（航海）桅杆过高或过重的；桅杆配置过度的。"},"examples":[{"en":"The boat looked sleek, but it was slightly overmast for offshore sailing.","zh":"这条船看起来很漂亮，但用于远海航行时桅杆略显过高（配置过度）。"}]}],"synonyms":["overmasted","overrig","oversparred"],"phonetic":"/ˌoʊvərˈmæst/","extraExplanation":["这个词比较少见，多用于帆船/传统航海语境。核心意思不是“超过桅杆”，而是“桅杆配得太大”。结果可能是：风一大就需要更早缩帆（reef），船体受力更大，稳定性与操控性变差。","常见相关词：overmasted（更常用的形容词形式）、undermasted（桅杆偏小/帆装不足）。"]}
{"word":"overmaster","summary":{"en":"Overmaster means to overpower or dominate, often used for strong emotions or forces that overwhelm someone.","zh":"overmaster 指“压倒、制服、控制”，常用于强调强烈情绪或力量使人无法自控，语气较正式、偏文学。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to defeat or gain control over someone or something; to overpower or dominate","zh":"战胜；制服；压倒；控制"},"examples":[{"en":"The team’s confidence overmastered their fear in the final minutes.","zh":"在最后几分钟里，球队的自信压倒了恐惧。"},{"en":"He tried to stay calm, but anger overmastered him.","zh":"他努力保持冷静，但愤怒还是控制了他。"},{"en":"The stronger army quickly overmastered the defenders.","zh":"更强的军队很快制服了守军。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a feeling, desire, or force) to become stronger than someone’s self-control; to overwhelm","zh":"（情绪、欲望或力量）压倒（理智）；使无法自控"},"examples":[{"en":"Grief overmastered her, and she couldn’t speak.","zh":"悲痛压倒了她，她一句话也说不出来。"},{"en":"The urge to reply immediately overmastered him.","zh":"立刻回复的冲动让他无法克制。"}]}],"synonyms":["overpower","overwhelm","dominate","subdue","master","conquer"],"phonetic":"/ˌoʊvərˈmæstər/","extraExplanation":["“overmaster”由 over（在……之上、压过）+ master（控制、支配）构成，语气比常见的 “overcome / overpower / dominate” 更正式、偏文学，用来强调“力量或情绪完全压制住人”。在日常口语里较少见。"]}
{"word":"overmastered","summary":{"en":"“Overmastered” means completely controlled or overpowered (often by emotions or by an opponent).","zh":"“overmastered”表示被完全控制或压倒（常指情绪或对手使你无法自控）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Completely controlled, defeated, or overwhelmed (often by a feeling, a person, or a force).","zh":"（形容词）被完全控制、制服或压倒（常指被情绪、他人或某种力量压倒）。"},"examples":[{"en":"She was overmastered by fear and couldn’t speak.","zh":"她被恐惧压倒，连话都说不出来。"},{"en":"The smaller team was quickly overmastered by their opponents.","zh":"实力较弱的队伍很快就被对手制服了。"}]},{"partOfSpeech":"v.","definition":{"en":"(V.) Past tense/past participle of “overmaster”: to gain complete control over; to overpower.","zh":"（动词）“overmaster”的过去式/过去分词：完全控制；压倒；制服。"},"examples":[{"en":"The emotion overmastered him, and he began to cry.","zh":"情绪控制了他，他开始哭了起来。"},{"en":"They overmastered the guard and escaped.","zh":"他们制服了警卫并逃走了。"}]}],"synonyms":["overwhelmed","overpowered","subdued","dominated","controlled","conquered"],"phonetic":"/ˌoʊvərˈmæstərd/","extraExplanation":["“overmaster”比“overwhelm”更强调“制服/支配”的感觉，语气更文学、更正式；日常英语里更常用“overwhelmed”。常见搭配：overmastered by fear/grief/passion（被恐惧/悲伤/激情压倒）。"]}
{"word":"overmasterful","summary":{"en":"Overmasterful means too controlling or overpoweringly strong.","zh":"overmasterful 指“过于专横/控制欲太强”，也可指“强大到压倒一切”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too dominating or controlling; acting like you must be in charge.","zh":"过于专横的；过度控制他人的；总想当主人的。"},"examples":[{"en":"His overmasterful style made teammates feel ignored.","zh":"他过于专横的作风让队友觉得被忽视。"},{"en":"She complained that her manager was overmasterful and rarely listened to feedback.","zh":"她抱怨经理太专横，很少听取反馈。"}]},{"partOfSpeech":"adj.","definition":{"en":"So strong that it overpowers others (often used about a feeling, influence, or force).","zh":"强大到压倒他人的（常形容情绪、影响力或力量）。"},"examples":[{"en":"An overmasterful fear kept him from speaking up.","zh":"一种压倒性的恐惧让他不敢开口。"},{"en":"The overmasterful scent of perfume filled the room.","zh":"浓烈到压倒一切的香水味充满了房间。"}]}],"synonyms":["domineering","controlling","bossy","overbearing","overpowering"],"phonetic":"/ˌoʊvɚˈmæstɚfəl/","extraExplanation":["这个词由 over-（“过度、太……”）+ masterful（“善于掌控的；像主人一样的”）组成，因此常带有负面语气：不是“很有领导力”，而是“控制欲过强”。","在日常英语里它相对少见，更常见的近义表达有 controlling、bossy、domineering；用于“情绪/力量压倒一切”时，也可以用 overpowering。"]}
{"word":"overmasterfully","summary":{"en":"“Overmasterfully” means “too forcefully/controllingly” or “overwhelmingly.”","zh":"“overmasterfully”表示“过于强势/控制欲太强”，也可指“压倒性地、令人难以招架地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too forceful or controlling; so powerfully that it overwhelms other people’s wishes or feelings.","zh":"以过于强势或控制的方式；强大到压倒他人意愿或感受。"},"examples":[{"en":"He spoke overmasterfully, leaving no room for questions.","zh":"他说话过于强势，根本不给人提问的空间。"},{"en":"The manager acted overmasterfully, and the team stopped sharing ideas.","zh":"经理表现得过于专断，团队就不再分享想法了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that completely defeats or overcomes something (such as fear, pain, or resistance).","zh":"以彻底战胜或克服某事（如恐惧、痛苦或抵抗）的方式。"},"examples":[{"en":"A wave of relief came overmasterfully, pushing her anxiety aside.","zh":"一阵强烈的轻松感席卷而来，把她的焦虑压了下去。"},{"en":"The smell struck him overmasterfully, and he had to step outside.","zh":"气味强烈得让他难以招架，他只好走到外面去。"}]}],"synonyms":["domineeringly","overwhelmingly","forcefully","imperiously","high-handedly"],"phonetic":"/ˌoʊvərˈmæstərfəli/","extraExplanation":["“overmasterfully”比较少见，语气偏文学或正式写作。日常表达里更常用：“too forcefully / too controlling / in a domineering way / overwhelmingly”。","词形拆解：over-（过度）+ master（支配、掌控）+ -ful（充满…的）+ -ly（副词）。因此它常带有“过度掌控、压制他人”的负面评价。"]}
{"word":"overmasterfulness","summary":{"en":"Overmasterfulness means excessive control or dominance—being too forcefully “in charge.”","zh":"overmasterfulness 指「過度支配／過度掌控」的特質，也可指壓倒性的主導力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too controlling, domineering, or forcefully in charge of other people; excessive masterfulness.","zh":"過度支配、專橫或強勢掌控他人的特質；過分的「當家作主」態度。"},"examples":[{"en":"His overmasterfulness in meetings made others hesitate to share ideas.","zh":"他在會議中過度強勢的作風，讓其他人不太敢分享想法。"},{"en":"She apologized for the overmasterfulness that came out when she was stressed.","zh":"她為自己壓力大時表現出的過度控制欲而道歉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) An overpowering force or influence that dominates a situation or a person.","zh":"（較少見）壓倒性的力量或影響，主導某個情勢或某個人。"},"examples":[{"en":"The overmasterfulness of fear kept him from speaking up.","zh":"恐懼那種壓倒性的力量讓他不敢發聲。"}]}],"synonyms":["domineeringness","overbearingness","controllingness","bossiness","authoritarianism"],"phonetic":"/ˌoʊvərˈmæstərfəlnəs/","extraExplanation":["「overmasterfulness」不是非常常見的字，通常可拆成 over-（過度）+ masterful（有主宰力、善於掌控）+ -ness（名詞化）。在實際寫作中，更常看到 overbearing（專橫的）、domineering（跋扈的）、controlling（控制欲強的）等較自然的替代詞。"]}
{"word":"overmastering","summary":{"en":"“Overmastering” means overwhelmingly powerful or irresistible; it can also mean actively overpowering or controlling something.","zh":"“overmastering”表示压倒性的、难以抗拒的；也可指正在制服或控制某人/某物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very strong, powerful, or intense—so much that it controls your feelings or actions; overwhelming or irresistible.","zh":"（力量或情感）强大到几乎无法抗拒的；压倒性的；令人难以自控的。"},"examples":[{"en":"She felt an overmastering urge to call her family right away.","zh":"她有一种压倒性的冲动，想立刻给家人打电话。"},{"en":"An overmastering sense of fear kept him from speaking up.","zh":"强烈到无法抗拒的恐惧感让他不敢开口。"},{"en":"The overmastering heat made it hard to concentrate.","zh":"难以承受的酷热让人很难集中注意力。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “overmaster”: controlling, defeating, or gaining power over someone or something.","zh":"“overmaster”的现在分词：制服、压制或控制（某人/某物）。"},"examples":[{"en":"The police had trouble overmastering the suspect without causing injury.","zh":"警方在不造成伤害的情况下很难制服嫌疑人。"},{"en":"She focused on overmastering her anxiety through breathing exercises.","zh":"她通过呼吸练习来努力控制自己的焦虑。"}]}],"synonyms":["overwhelming","irresistible","dominant","all-consuming","powerful","compelling"],"phonetic":"/ˌoʊvərˈmæstərɪŋ/","extraExplanation":["“overmaster”由 over-（过度、超过）+ master（控制、支配）构成，强调“强到足以支配/压倒”。“overmastering”常用于较正式或文学化的语境，搭配情绪或冲动（urge, desire, fear, passion）很常见。"]}
{"word":"overmasteringly","summary":{"en":"“Overmasteringly” means “in an overpowering, dominating way.”","zh":"“overmasteringly”表示“以压倒性、支配性的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is overpowering or irresistible; with such strong force or influence that it dominates someone or something.","zh":"以压倒性的方式；强大到让人无法抗拒、无法控制地占主导的样子。"},"examples":[{"en":"A wave of fear rose overmasteringly, and he couldn’t speak for a moment.","zh":"一阵恐惧以压倒性的方式涌上心头，他一时说不出话。"},{"en":"Her personality filled the room overmasteringly, leaving little space for anyone else to lead.","zh":"她的个性压倒性地充满整个房间，几乎不给别人带头的空间。"}]}],"synonyms":["overwhelmingly","irresistibly","powerfully","dominantly","with overpowering force"],"phonetic":"/ˌoʊvərˈmæstərɪŋli/","extraExplanation":["“overmasteringly”比较少见，偏文学/书面语，通常用来形容情绪（fear, love, desire）、力量（force）、或气场/影响力（presence, personality）强到“压过一切”。日常英语更常用：overwhelmingly, irresistibly, powerfully。","词根上来自 overmaster（压制、控制）→ overmastering（压倒性的）→ overmasteringly（以压倒性的方式）。在小说描写人物心理或氛围时更常见。"]}
{"word":"overmasters","summary":{"en":"“Overmasters” usually means “overpowers” or “takes control,” often used in a literary way for emotions or strong forces.","zh":"“overmasters”通常表示“压倒/制服/掌控”，常带文学或书面语色彩，尤其用于情绪或强大力量压倒某人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to overpower someone or something; to gain control by being stronger (physically or emotionally).","zh":"制服；压倒；以力量（身体或情绪等）取得控制。"},"examples":[{"en":"Fear overmasters him whenever he speaks in public.","zh":"每当他在公众面前讲话时，恐惧就会压倒他。"},{"en":"The stronger team overmasters their opponents in the second half.","zh":"更强的队在下半场压制了对手。"},{"en":"She tries to stay calm, but anger overmasters her.","zh":"她努力保持冷静，但愤怒还是占了上风。"}]},{"partOfSpeech":"n.","definition":{"en":"people who dominate or control others (rare).","zh":"支配者；掌控他人的人（较少见）。"},"examples":[{"en":"They resisted their overmasters and demanded fair treatment.","zh":"他们反抗那些支配者，并要求公平对待。"}]}],"synonyms":["overpower","overwhelm","dominate","subdue","master"],"phonetic":"/ˌoʊvərˈmæstərz/","extraExplanation":["“overmasters”最常见是动词 overmaster 的第三人称单数形式（he/she/it overmasters）。它比常见的“overpower”更偏书面、文学色彩，常用来写“情绪、欲望、恐惧”等无形力量“压倒某人”。","文学用法中常见搭配：be overmastered by + emotion（被某种情绪压倒）。"]}
{"word":"overmatch","summary":{"en":"Overmatch means to be clearly stronger or more capable than an opponent; in engineering it can mean using a stronger-than-needed match (e.g., weld strength).","zh":"overmatch 指在实力或能力上明显胜过对手；在工程语境中也可指采用强度“过匹配”（如焊接强度高于需求）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be stronger, better, or more skilled than someone or something; to defeat or dominate because of that advantage","zh":"（因实力、能力更强而）胜过；压倒；（轻易）击败"},"examples":[{"en":"Their team overmatched ours in both speed and experience.","zh":"他们的球队在速度和经验上都胜过我们。"},{"en":"She felt overmatched in her first job interview, but she learned quickly.","zh":"她第一次面试时觉得自己实力不够，但她学得很快。"}]},{"partOfSpeech":"vt.","definition":{"en":"to match with something that is stronger than needed (often used in engineering/materials contexts)","zh":"（工程/材料语境）采用强度超出需求的匹配；“过匹配”"},"examples":[{"en":"In some designs, engineers choose to overmatch the weld metal to increase safety margin.","zh":"在一些设计中，工程师会选用强度更高的焊材进行“过匹配”，以提高安全裕度。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation where one side has a clear advantage in strength, skill, or resources","zh":"（实力/技能/资源的）明显不对等；强弱悬殊的对局"},"examples":[{"en":"The final looked like an overmatch from the start.","zh":"决赛从一开始就像是一场强弱悬殊的比赛。"}]}],"synonyms":["outmatch","overpower","dominate","defeat","surpass"],"phonetic":"/ˌoʊvɚˈmætʃ/","extraExplanation":["“overmatch”在日常语境里多指“实力压倒性更强”。在工程领域（如焊接、材料选型）里，“overmatching”常指让填充材料/连接部位的强度高于母材或设计需求，以增加安全余量，但也可能带来脆性、成本或应力集中的副作用，需要权衡。"]}
{"word":"overmatched","summary":{"en":"Overmatched means clearly outclassed by an opponent, or overwhelmed by a task that’s too demanding.","zh":"overmatched 指明显不如对手，或因任务过难而应付不过来。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Outclassed or not as strong, skilled, or well-prepared as an opponent or rival; unable to compete effectively.","zh":"（在比赛、竞争中）实力或水平不如对手；被对手碾压，难以抗衡。"},"examples":[{"en":"Our team was overmatched against the league champions.","zh":"我们队面对联赛冠军明显实力不足。"},{"en":"The young player looked overmatched in his first professional match.","zh":"这名年轻球员在第一场职业比赛中显得难以招架。"}]},{"partOfSpeech":"adj.","definition":{"en":"Given a task or situation that is too difficult or demanding for your current ability or resources; overwhelmed.","zh":"（在工作/任务上）超出能力或资源范围；应付不过来，感到不堪重负。"},"examples":[{"en":"She felt overmatched by the workload during her first week on the job.","zh":"她上班第一周就被工作量压得有些应付不过来。"},{"en":"Without enough support, the small clinic was overmatched by the sudden rise in patients.","zh":"由于缺乏足够支援，这家小诊所面对突然增加的病人显得力不从心。"}]}],"synonyms":["outmatched","outclassed","overpowered","overwhelmed","in over your head"],"phonetic":"/ˌoʊvərˈmætʃt/","extraExplanation":["“overmatched”常见于体育报道、商业竞争或职场语境，语气比单纯的“not as good”更强，暗示差距明显。","它来自动词“overmatch”（在实力上压倒、胜过；使难以应付）。日常口语中也可用“outmatched / outclassed / in over your head”表达相近意思。"]}
{"word":"overmatches","summary":{"en":"“Overmatches” means (1) is far stronger or more skilled than (so it defeats easily), or (2) unequal contests where one side is clearly stronger.","zh":"“overmatches”可指（1）远胜于、轻松击败；也可指（2）强弱悬殊的对决（不对等比赛）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(verb, 3rd person singular) To be too strong, skilled, or powerful for someone or something; to defeat easily because of a big difference in ability.","zh":"（动词第三人称单数）实力、技能或力量远胜于某人/某物；因差距过大而轻松取胜。"},"examples":[{"en":"Her experience overmatches most new employees in the department.","zh":"她的经验远胜于部门里的大多数新员工。"},{"en":"The champion overmatches every opponent in this tournament.","zh":"这位冠军在这项赛事中实力碾压所有对手。"},{"en":"Better tools can overmatch a team that lacks training.","zh":"更好的工具可能会让缺乏训练的团队完全处于劣势。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Situations or contests where one side is clearly stronger than the other; mismatches.","zh":"（名词复数）强弱悬殊的对决；不对等的比赛（mismatch）。"},"examples":[{"en":"Early in the season, there are often a few overmatches on the schedule.","zh":"赛季初的赛程里常常会出现几场强弱悬殊的比赛。"},{"en":"The coach tries to avoid overmatches that could hurt the players’ confidence.","zh":"教练尽量避免强弱差距太大的对决，以免影响队员信心。"}]}],"synonyms":["outclass","overpower","dominate","be no match for","mismatch"],"phonetic":"ˌoʊvərˈmætʃ","extraExplanation":["“overmatch”常见于体育、竞争、辩论等语境，强调“差距大到几乎没有悬念”。口语中更常用“be no match for / totally outclass / mismatch”。","词形提示：overmatches = overmatch 的第三人称单数（he/she/it overmatches），也可能是名词复数（two overmatches）。"]}
{"word":"overmatching","summary":{"en":"Overmatching means matching too much—either in research (too strict/too many variables) or in text/regex (capturing more than intended).","zh":"Overmatching 指“匹配过度”：在研究中是匹配太严格/变量太多；在文本/正则中是匹配到超出预期的内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In data analysis, machine learning, or research) matching items too strictly or with too many variables, so the matched groups look similar but the result becomes less reliable or less generalizable.","zh":"（在数据分析、机器学习或研究中）匹配得过于严格或使用过多变量进行匹配，导致两组看起来很像，但结果反而更不可靠或更难推广。"},"examples":[{"en":"The team worried that overmatching would hide a real difference between the two groups.","zh":"团队担心过度匹配会掩盖两组之间真实的差异。"},{"en":"If you match on variables that are caused by the treatment, you can create overmatching and bias the results.","zh":"如果你把“由处理/干预导致的变量”也拿来匹配，可能会造成过度匹配并让结果产生偏差。"},{"en":"To avoid overmatching, we matched only on age and location, not on every small detail.","zh":"为了避免过度匹配，我们只按年龄和地点匹配，而不是把每个细节都纳入。"}]},{"partOfSpeech":"n.","definition":{"en":"(In search, text processing, or regular expressions) matching more text than intended, so the match includes extra characters or wrong parts.","zh":"（在搜索、文本处理或正则表达式中）匹配范围超过预期，把多余字符或不该匹配的部分也匹配进来。"},"examples":[{"en":"My regular expression is overmatching and capturing the whole paragraph.","zh":"我的正则表达式发生了过度匹配，把整段文字都抓进来了。"},{"en":"Add boundaries or make the pattern more specific to prevent overmatching.","zh":"加上边界条件或让模式更具体，以避免过度匹配。"}]}],"synonyms":["excessive matching","overfitting (related in ML)","overly strict matching","greedy matching (regex, related)"],"phonetic":"/ˌoʊvɚˈmætʃɪŋ/","extraExplanation":["“over-”表示“过度、超过需要”，所以 overmatching 字面意思就是“匹配过头了”。常见于两类语境：①研究/统计中的匹配（matching）——为了控制混杂因素而配对样本；②计算机中的匹配——如字符串搜索、正则表达式。","在研究设计里，过度匹配的一个常见问题是：把不该匹配的变量也匹配了（例如中介变量或由干预引起的变量），可能削弱你观察到的真实效果。","在正则表达式里，过度匹配常与“贪婪匹配（greedy）”有关；可以尝试更具体的模式、使用非贪婪量词（如 *?）、或加上边界（^ $ \\b）来缩小匹配范围。"]}
{"word":"overmatter","summary":{"en":"A rare noun meaning an overlying layer of material, or (in specialized contexts) an excess amount of matter.","zh":"一个罕见名词，指覆盖在上方的物质层；在专门语境中也可指“过量的物质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Material that lies on top of something; an overlying layer or covering material (similar to “overburden”).","zh":"（罕见）覆盖在某物上方的物质；上覆层、覆盖层（类似 overburden）。"},"examples":[{"en":"Miners had to remove the overmatter before reaching the coal seam.","zh":"矿工必须先清除上覆层，才能挖到煤层。"},{"en":"Snow formed an overmatter that hid the path.","zh":"积雪形成一层覆盖物，把小路遮住了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, specialized) An excess amount of matter (sometimes discussed in contrast to antimatter).","zh":"（罕见，专门）物质的“过量”（有时用于与反物质相对的讨论）。"},"examples":[{"en":"The article speculated about why the universe has more overmatter than antimatter.","zh":"那篇文章推测，为什么宇宙中的物质会比反物质更多。"}]}],"synonyms":["overburden","covering","top layer","overlay"],"phonetic":"/ˌoʊvərˈmætər/","extraExplanation":["“overmatter”不是现代英语里的常用词，更多见于较旧的写法或特定领域的临时用语。日常表达中，表示“上覆层/覆盖物”更常用 overburden（矿业/地质）、top layer、covering 等。","词形上可以理解为 over-（在……之上/过度）+ matter（物质/材料）。因此它的核心感觉是“在上面的那层物质”或“多出来的物质”。"]}
{"word":"overmature","summary":{"en":"Overmature means “too mature” (for a person/age) or “too ripe” (for fruit), and it can also mean “past the maturity date” in finance.","zh":"overmature 指“过于成熟”（人/年龄不相称）或“过熟”（果蔬），在金融语境中也可指“已过到期日”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More mature than is normal or expected, especially for someone’s age (showing adult-like behavior or thinking too early).","zh":"（尤指就年龄而言）过于成熟；比一般或预期更成熟（过早表现出成人式的言行或想法）。"},"examples":[{"en":"People often said she seemed overmature for a twelve-year-old.","zh":"人们常说她对一个十二岁的孩子来说显得过于成熟。"},{"en":"He sounded overmature in the interview, using very formal language.","zh":"他在面试中听起来过于老成，用词非常正式。"}]},{"partOfSpeech":"adj.","definition":{"en":"Too ripe; past the best stage for eating or use (especially of fruit or vegetables).","zh":"（尤指水果蔬菜）过熟的；熟过头的；超过最佳食用或使用阶段的。"},"examples":[{"en":"The bananas were overmature and started to turn brown.","zh":"香蕉熟过头了，开始发褐。"},{"en":"Overmature fruit can taste overly sweet and mushy.","zh":"过熟的水果可能会甜得发腻、口感软烂。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Finance) Past its maturity date; already due to be paid back.","zh":"（金融）到期后仍未兑付的；已过到期日的。"},"examples":[{"en":"The report listed several overmature debts that needed immediate action.","zh":"报告列出了几笔已逾期到期的债务，需要立即处理。"}]}],"synonyms":["too mature","precocious","overripe","past its prime","overdue"],"phonetic":"ˌoʊvərməˈtʊr","extraExplanation":["“overmature”常见于书面语或专业语境（如农业、金融）。日常口语里，说人“过于成熟”更常用“too mature for one’s age / very mature”。","拼写上有时会写成“over-mature”（加连字符），含义相同，更多见于较正式或技术性的写法。"]}
{"word":"overmaturely","summary":{"en":"Overmaturely means “in an overly mature way,” either too adult-like for one’s age or past the best stage of growth (e.g., crops).","zh":"overmaturely 指“过于成熟地”：要么是言行老成得超过年龄应有程度，要么是（如作物等）过熟、超过最佳生长阶段。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too mature or adult-like for the person’s age, often suggesting unnatural seriousness or loss of childlike qualities.","zh":"以一种“过于成熟/老成”的方式（超出年龄应有的成熟度），常带有不自然、过分严肃或缺少童真的含义。"},"examples":[{"en":"He spoke overmaturely for a ten-year-old, using words he didn’t fully understand.","zh":"他一个十岁的孩子说话却过于老成，用了一些自己并不完全理解的词。"},{"en":"The movie makes its young characters act overmaturely, which feels unrealistic.","zh":"这部电影让小角色表现得过于成熟，显得不太真实。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is overly mature or past the best stage (especially of fruit, crops, or biological growth).","zh":"以一种“过熟/过度成熟”的方式（尤其指水果、作物或生长发育已超过最佳阶段）。"},"examples":[{"en":"If the tomatoes are picked overmaturely, they may taste bland and soften too fast.","zh":"如果番茄采摘得过熟，味道可能变淡，而且很快变软。"},{"en":"The trees were harvested overmaturely, reducing the wood’s overall quality.","zh":"这些树采伐得过熟，导致木材整体质量下降。"}]}],"synonyms":["too maturely","overly maturely","precociously (for children)","overripely (for fruit)","past its prime (phrase)"],"phonetic":"ˌoʊvərməˈtʃʊrli","extraExplanation":["“over-”有“过度、太……”的意思，所以 overmaturely 往往带一点负面评价：不是单纯的 mature（成熟），而是“超过理想程度”。","在人/性格语境里，它常暗示“早熟、老成得不自然”（有时与压力、环境有关）；在食物/农业语境里，它接近 overripe（过熟）或 past its prime（过了最佳状态）。"]}
{"word":"overmatureness","summary":{"en":"“Overmatureness” means being too mature (or overly ripe, in food/agriculture). It’s understandable but uncommon; “overmaturity” is more natural.","zh":"「overmatureness」指過度成熟（或在食物／農業語境指過熟）。這個字可理解但不常見；更自然的是「overmaturity」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being too mature (often more mature than is normal or appropriate), especially for one’s age; overmaturity.","zh":"過度成熟（常指比正常或合適的程度更成熟），尤其指超齡成熟；過熟。"},"examples":[{"en":"Some people mistook her calm confidence for overmatureness, even though she was just thoughtful.","zh":"有些人把她冷靜的自信誤認為是過度成熟，其實她只是比較善於思考。"},{"en":"In child acting, overmatureness can make a role feel unnatural or forced.","zh":"在童星表演中，過度成熟可能讓角色顯得不自然或刻意。"}]},{"partOfSpeech":"n.","definition":{"en":"In farming or food contexts, the condition of being overly ripe or past the best stage (said of fruit, vegetables, or crops).","zh":"（農業／食品語境）過熟、熟過頭（指水果、蔬菜或作物已超過最佳成熟期）。"},"examples":[{"en":"Overmatureness in bananas can lead to bruising during shipping.","zh":"香蕉過熟會導致運輸途中更容易碰傷。"},{"en":"Pick the tomatoes earlier to avoid overmatureness.","zh":"番茄要早點採收，避免過熟。"}]}],"synonyms":["overmaturity","precociousness (people)","overripeness (food)","being overmature"],"phonetic":"ˌoʊvərməˈtʃʊrnəs","extraExplanation":["「overmatureness」不是很常見、也不太標準的英文用字；更自然的選擇通常是 **overmaturity**（名詞）或 **being overmature**（形容詞片語）。","字形上它由 over-（過度）+ mature（成熟）+ -ness（名詞後綴）組成，意思好理解，但在正式寫作中建議改用較常見的 **overmaturity**。"]}
{"word":"overmaturity","summary":{"en":"Overmaturity means being too mature—past the best stage—often causing a drop in quality; it can also describe a post-term condition in obstetrics.","zh":"overmaturity 指“过度成熟、超过最佳阶段”，常导致品质下降；在产科语境中也可指过期妊娠/过期儿状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being too mature, especially to a degree that causes decline in quality, usefulness, or health","zh":"过度成熟；成熟过头（通常指因此导致质量、用途或健康状况下降）"},"examples":[{"en":"The fruit was soft and brown from overmaturity.","zh":"水果因为过度成熟变得又软又发褐。"},{"en":"Harvesting too late can lead to overmaturity and lower market value.","zh":"采收太晚会导致过度成熟，从而降低市场价值。"}]},{"partOfSpeech":"n.","definition":{"en":"in medicine (especially obstetrics), a condition in which a baby stays in the womb beyond the due date and may show signs of being “post-term”","zh":"（医学，尤指产科）过期妊娠/过熟（指胎儿超过预产期仍未出生，并可能出现过期儿特征）"},"examples":[{"en":"The doctor monitored the pregnancy closely for signs of overmaturity.","zh":"医生密切监测妊娠情况，以观察是否出现过期妊娠的迹象。"},{"en":"Overmaturity can increase certain risks, so follow your clinician’s advice.","zh":"过期妊娠可能增加某些风险，因此应遵医嘱。"}]}],"synonyms":["overripeness","overripe state","excess maturity","postmaturity"],"phonetic":"/ˌoʊvərməˈtʃʊrəti/","extraExplanation":["“overmaturity”更常见于专业语境（农业、食品、医学）。日常英语里，人们更常说“too ripe”（太熟）或“overripe”（熟过头）。","构词法：over-（过度）+ maturity（成熟）。因此它通常带有“超过最佳状态、开始走下坡路”的含义。"]}
{"word":"overmean","summary":{"en":"“Overmean” is a rare/nonstandard verb meaning “to mean too much” or “to overinterpret.”","zh":"“overmean”是罕见/非标准动词，常指“意思过多/过重”或“过度解读”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare / nonstandard) To mean too much; to have an intended meaning that is stronger or broader than what is appropriate.","zh":"（罕见/非标准用法）指“含义过多、意思说得过重或过宽”，超过合适的程度。"},"examples":[{"en":"I think that wording overmeans the point—you can say it more simply.","zh":"我觉得这种措辞把意思说得过重了——你可以说得更简单。"},{"en":"Don’t let one sentence overmean the whole situation.","zh":"别让一句话承载（解读）过多意思，影响你对整件事的判断。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare / nonstandard) To interpret something too strongly or to read too much meaning into it.","zh":"（罕见/非标准用法）过度解读；把某事理解得过深或过重。"},"examples":[{"en":"She overmeant his silence and assumed he was angry.","zh":"她过度解读了他的沉默，以为他在生气。"},{"en":"We might be overmeaning this comment; it could be just a joke.","zh":"我们可能把这句话解读得太多了；也许只是个玩笑。"}]}],"synonyms":["overinterpret","read too much into","overthink","imply too much","make too much of"],"phonetic":"/ˌoʊvərˈmin/","extraExplanation":["“overmean”不是现代英语里的常用词，很多词典不收录。日常写作与口语更自然的表达通常是：overinterpret（过度解读）、read too much into（从……里读出太多意思）、overthink（想太多）、mean too much / imply too much（暗示/表示得太多）。","如果你是在数学或统计语境里看到类似写法，通常会写成“overall mean / grand mean（总体平均值）”或“mean over …（对……取平均）”，而不是“overmean”。"]}
{"word":"overmeanly","summary":{"en":"“Overmeanly” means “too meanly”: excessively unkind or harsh (and, rarely, overly stingy/shabby).","zh":"“overmeanly”表示“过分刻薄地/苛刻地”（少见时也可指“过分寒酸或吝啬地”）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively mean, unkind, or nasty way; more cruelly than is appropriate.","zh":"以过分刻薄、恶意或不友善的方式；刻薄得过头。"},"examples":[{"en":"He spoke overmeanly to his coworker, even though it was a small mistake.","zh":"他对同事说话过分刻薄，尽管那只是个小错误。"},{"en":"Don’t judge her overmeanly—you don’t know what she’s been through.","zh":"别过分苛刻地评判她——你不知道她经历过什么。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an excessively low or stingy way (rare; based on an older meaning of “mean” = “low, shabby, miserly”).","zh":"以过分卑微、寒酸或吝啬的方式（较少见；源自“mean”较旧的含义：卑微/寒酸/吝啬）。"},"examples":[{"en":"They lived overmeanly, denying themselves even basic comforts.","zh":"他们生活过分寒酸，连基本的舒适都不肯给自己。"}]}],"synonyms":["overly","too harshly","cruelly","unkindly","needlessly","excessively"],"phonetic":"/ˌoʊvɚˈminli/","extraExplanation":["“overmeanly”不是很常见、也不算标准高频词。日常写作更自然的说法通常是“overly mean”“unnecessarily mean”“too harshly / too cruelly”。","这里的“over-”表示“过度”，类似：overreact（反应过度）、overthink（想太多）。而“mean”除了“刻薄的”，在较老的英语里还可指“卑微的/寒酸的/吝啬的”，所以第二个义项只在较文艺或旧式表达里偶尔出现。"]}
{"word":"overmeanness","summary":{"en":"Overmeanness means excessive unkindness or stinginess—being too mean.","zh":"overmeanness 指“过度的刻薄或小气”，也就是“太 mean 了”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive meanness; being too unkind, stingy, or spiteful (often used to criticize someone’s behavior).","zh":"过度刻薄；过分小气或恶意（常用来批评一个人的行为）。"},"examples":[{"en":"Everyone makes mistakes, but her overmeanness toward new employees created a toxic workplace.","zh":"人人都会犯错，但她对新员工的过度刻薄造成了有毒的工作环境。"},{"en":"He apologized for his overmeanness and tried to speak more respectfully.","zh":"他为自己过分刻薄道歉，并努力更有礼貌地说话。"}]}],"synonyms":["excessive meanness","unkindness","spitefulness","cruelty","stinginess"],"phonetic":"/ˌoʊvərˈminnəs/","extraExplanation":["“overmeanness”不是非常常见的标准词，更常见的表达是“excessive meanness / extreme meanness / being too mean”。它由前缀 over-（过度）+ meanness（刻薄、小气）构成，用来强调“超过正常程度”的不友善或吝啬。","注意 mean 既可以表示“刻薄的、不友善的”，也可以表示“吝啬的”。具体是哪一种，要看语境（对人说话很坏=刻薄；不愿花钱=吝啬）。"]}
{"word":"overmeasure","summary":{"en":"Overmeasure means to measure too much or go beyond the proper amount, literally or figuratively.","zh":"overmeasure 指“过度测量/量得过多”，也可比喻为“超过适当限度”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to measure something too much or beyond what is needed; to take overly large measurements","zh":"过度测量；测得过多（超出需要或准确范围）"},"examples":[{"en":"If you overmeasure the rice, the pot will boil over.","zh":"如果你把米量得太多，锅里会溢出来。"},{"en":"The tailor warned that it’s easy to overmeasure and waste fabric.","zh":"裁缝提醒说，尺寸量过头很容易浪费布料。"}]},{"partOfSpeech":"v.","definition":{"en":"to exceed the proper limit or standard in measurement, amount, or degree (figurative)","zh":"（比喻）超过适当的限度；做得过头（在数量或程度上）"},"examples":[{"en":"In trying to be polite, he overmeasured his praise and sounded insincere.","zh":"他想表现得礼貌，却把赞美说得太过，反而显得不真诚。"},{"en":"Don’t overmeasure your promises—make only what you can keep.","zh":"别把承诺开得过大——只做你能兑现的。"}]}],"synonyms":["measure too much","overestimate","overdo","go too far","exceed"],"phonetic":"/ˌoʊvərˈmɛʒər/","extraExplanation":["“overmeasure”在现代英语中不算常用，更常见的表达是“measure too much/too far”或“overestimate/overdo”（视语境而定）。","在旧式或文学语境里，它有时也可指“在计量上给得过多（例如多给一点布料或食物）”，但日常交流中通常会改用更常见的动词来表达。"]}
{"word":"overmeddle","summary":{"en":"Overmeddle means to interfere too much in other people’s affairs in an unwanted way.","zh":"overmeddle 指对他人事务过度干涉、插手过头，通常带有批评意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to interfere too much in other people’s affairs, especially in a way that is unwanted or unhelpful","zh":"过度干涉（他人的事务）；多管闲事（往往令人反感或无益）"},"examples":[{"en":"Try not to overmeddle in your friends’ relationships—they may just want to be heard, not advised.","zh":"尽量别过度干涉朋友的感情关系——他们可能只是想被倾听，而不是被指导。"},{"en":"The manager overmeddled with every small decision, which slowed the whole team down.","zh":"经理对每个小决定都过度插手，结果拖慢了整个团队。"}]}],"synonyms":["meddle","interfere","intrude","butt in","intervene (too much)"],"phonetic":"/ˌoʊvərˈmɛdəl/","extraExplanation":["“overmeddle”由 over-（过度）+ meddle（干涉）构成，语气通常带批评，强调“插手过头”。在现代英语中它不算常用，更常见的表达有 “meddle too much / interfere too much / be too controlling”。","相关形态：overmeddling（adj. 过度干涉的；爱管闲事的），如：an overmeddling neighbor（一个爱管闲事的邻居）。"]}
{"word":"overmeddled","summary":{"en":"“Overmeddled” means someone interfered too much in other people’s matters (past form of “overmeddle”).","zh":"“overmeddled”表示“过度干预/多管闲事”，是 overmeddle 的过去式或过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “overmeddle”) interfered in someone else’s affairs too much, often in an annoying or unhelpful way.","zh":"（overmeddle 的过去式/过去分词）过度干预（他人事务）；多管闲事到令人反感或造成负面影响。"},"examples":[{"en":"She overmeddled in her adult son’s relationships, and it pushed him away.","zh":"她过度干预成年儿子的感情关系，结果把他越推越远。"},{"en":"The manager overmeddled with the team’s work and slowed the project down.","zh":"经理对团队工作过度插手，反而拖慢了项目进度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective use) showing that someone interfered too much.","zh":"（形容词用法）表示“插手过多/管得太多”的。"},"examples":[{"en":"His overmeddled advice made the situation worse.","zh":"他那种过度插手的建议让情况更糟。"}]}],"synonyms":["interfered","meddled too much","butted in","intruded","overinvolved"],"phonetic":"/ˌoʊvərˈmɛdəld/","extraExplanation":["“overmeddled”并不算常见，更常见的表达是：interfered too much / meddled too much / was too involved.","词形结构很直观：over-（过度）+ meddle（多管闲事、插手）。语气通常带批评，暗示“本来不该管、管了也没帮上忙”。"]}
{"word":"overmeddling","summary":{"en":"Overmeddling means interfering too much in other people’s affairs, often in an unwanted or intrusive way.","zh":"Overmeddling 指对他人事务过度插手，常带有不受欢迎、越界打扰的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trying too much to interfere in other people’s affairs; overly intrusive or involved when it’s not wanted.","zh":"过度插手（他人事务）的；爱管闲事到让人不舒服的。"},"examples":[{"en":"Her overmeddling advice made her friends feel like they couldn’t make their own choices.","zh":"她过度插手的建议让朋友觉得自己好像不能做决定。"},{"en":"The manager’s overmeddling style slowed the team down because everyone had to ask for permission.","zh":"经理过度插手的管理方式拖慢了团队，因为大家做什么都得先请示。"}]},{"partOfSpeech":"n.","definition":{"en":"Excessive interference in other people’s business (the act or habit of meddling too much).","zh":"过度干预、过分插手（指行为或习惯）。"},"examples":[{"en":"Overmeddling in your adult child’s life can damage trust.","zh":"对成年子女的生活过度插手可能会破坏信任。"},{"en":"The story warns that overmeddling often creates bigger problems than it solves.","zh":"这个故事告诫人们：过度插手往往会制造比解决更多的问题。"}]}],"synonyms":["interfering","intrusive","nosy","pushy","overinvolved","officious"],"phonetic":"/ˌoʊvərˈmɛd(ə)lɪŋ/","extraExplanation":["“over-”表示“过度、太多”，加在“meddling（插手、干预）”前，就强调“超过合适界限的干预”。","语气通常偏负面，暗示对方“好心但越界”或“控制欲强”。如果想更委婉，可以说“over-involved（过度介入）”或“too involved”。"]}
{"word":"overmedicate","summary":{"en":"Overmedicate means to use or give too much medicine—more than needed or safe.","zh":"overmedicate 指用药或服药过量，超过必要或安全范围。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To give someone too much medicine, or to take too much medicine (more than is needed or safe).","zh":"（给某人）用药过量；（自己）服药过量（超过需要或安全剂量）。"},"examples":[{"en":"Some people overmedicate when they take antibiotics for every cold.","zh":"有些人一感冒就吃抗生素，属于过度用药。"},{"en":"He accidentally overmedicated and felt dizzy afterward.","zh":"他不小心服药过量，之后感到头晕。"},{"en":"Doctors warned the family not to overmedicate the child for a mild fever.","zh":"医生提醒家属，不要为轻微发烧给孩子过度用药。"}]}],"synonyms":["overdose (more extreme)","medicate too much","over-treat"],"phonetic":"/ˌoʊvərˈmɛdɪˌkeɪt/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常程度”，如 overwork（过度工作）、overeat（吃太多）。因此 overmedicate 强调“药物使用超过必要或安全范围”。","在医疗语境里，它常与风险相关：副作用增加、耐药性（尤其是抗生素）、药物相互作用等。日常表达中也可指“把药当成解决一切问题的办法”。"]}
{"word":"overmedicated","summary":{"en":"Overmedicated means given or taking too much medication, often causing harmful or overly sedating effects.","zh":"overmedicated 指用药过量，常导致不良反应或过度镇静等影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Given too much medicine or too many drugs (especially prescription drugs), leading to harmful or unwanted effects.","zh":"用药过量；服用了过多药物（尤其是处方药），从而引起不良或有害影响。"},"examples":[{"en":"The patient seemed overmedicated and could barely stay awake.","zh":"这位病人看起来用药过量，几乎无法保持清醒。"},{"en":"Older adults can become overmedicated more easily because their bodies process drugs differently.","zh":"老年人更容易出现用药过量，因为他们对药物的代谢方式不同。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a person whose behavior or thinking is dulled, slowed, or confused because of too much medication.","zh":"（形容人）因药物过多而反应迟钝、动作变慢或思维混乱。"},"examples":[{"en":"He sounded overmedicated during the interview and struggled to answer simple questions.","zh":"他在面试中听起来像是药物用多了，连简单问题都回答得很吃力。"},{"en":"If you feel overmedicated, talk to your doctor before changing the dose on your own.","zh":"如果你觉得自己用药过量，先和医生沟通，不要自行调整剂量。"}]}],"synonyms":["overdosed","drugged","oversedated","overprescribed"],"phonetic":"/ˌoʊvərˈmɛdɪˌkeɪtɪd/","extraExplanation":["“over-”表示“过度/过量”，和“medicated（用药的）”组合成“overmedicated”。在医疗语境中，它常用于强调药物剂量或药物数量不当，可能需要医生评估与调整。","日常表达中也可能带有批评意味（例如认为医生开药太多），但讨论真实健康状况时用词应谨慎、尊重，并以专业建议为准。"]}
{"word":"overmedicates","summary":{"en":"“Overmedicates” means gives or takes too much medicine (more than needed or safe).","zh":"“overmedicates”表示（给别人或自己）用药/服药过量，超过需要或安全范围。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “overmedicate”) to give someone too much medicine, or to take too much medicine, especially more than is needed or safe.","zh":"（overmedicate 的第三人称单数）给某人用药过量，或自己服药过量；尤指超过需要或不安全的剂量。"},"examples":[{"en":"The doctor worries that the child overmedicates when his parents give him cold medicine too often.","zh":"医生担心孩子会被过度用药，因为父母给他吃感冒药太频繁。"},{"en":"She overmedicates for mild headaches instead of resting and drinking water.","zh":"她对轻微头痛就服药过量，而不是休息、喝水。"},{"en":"This app helps track doses so no one overmedicates by mistake.","zh":"这个应用可以帮助记录剂量，避免有人不小心用药过量。"}]}],"synonyms":["overdose (often more severe)","overprescribe (doctor-focused)","overuse medication"],"phonetic":"/ˌoʊvərˈmɛdəˌkeɪts/","extraExplanation":["“overmedicate”常用于医疗与日常健康语境，强调“超过必要/安全范围”的用药；可指医生开药过多、家属给药过多，或患者自行服药过量。","与“overdose（过量服用，常更严重、甚至致命）”相比，“overmedicate”语气更广，既可指一时的剂量偏多，也可指长期把药当成主要解决方式（例如对轻微不适频繁用药）。"]}
{"word":"overmedicating","summary":{"en":"Overmedicating means using more medicine than necessary—either too high a dose or too many medications at once.","zh":"overmedicating 指用药超过必要程度：可能是剂量过大，也可能是同时用药过多或重复用药。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Giving someone too much medicine, or using more medication than is needed (often causing side effects or other harm).","zh":"（对某人）用药过量；或用药超过必要剂量（常导致副作用或其他伤害）。"},"examples":[{"en":"The doctor worried the child was being overmedicated for a mild cough.","zh":"医生担心这个孩子只是轻微咳嗽，却被用药过量。"},{"en":"If you feel dizzy or sleepy, you may be overmedicating—talk to a pharmacist.","zh":"如果你觉得头晕或嗜睡，可能是用药过量——请咨询药师。"}]},{"partOfSpeech":"v.","definition":{"en":"Using too many different medicines at the same time, especially when they overlap or are unnecessary.","zh":"同时使用过多种药物（尤其是重复、重叠或不必要的用药）。"},"examples":[{"en":"Some older adults are overmedicating because multiple doctors prescribe similar drugs.","zh":"一些老年人会出现过度用药，因为不同医生开了相似的药。"},{"en":"Keeping a complete medication list helps prevent overmedicating.","zh":"保留完整的用药清单有助于避免过度用药。"}]}],"synonyms":["overdose (dose too high)","overprescribe","overuse medication","polypharmacy (related)"],"phonetic":"/ˌoʊvərˈmɛdɪˌkeɪtɪŋ/","extraExplanation":["“overmedicating”常出现在医疗沟通中，既可能指“剂量过大”（too much of one medicine），也可能指“药物种类太多/重复用药”（polypharmacy 相关）。在正式场合更常说“overmedication”（名词）或“overprescribing”（过度开药，强调处方行为）。"]}
{"word":"overmeek","summary":{"en":"Overmeek means excessively meek or submissive, often to an unhelpful degree.","zh":"overmeek 指“过分温顺/顺从”，通常暗示到了不利或显得软弱的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too gentle, shy, or submissive; excessively meek (often implying weakness or lack of confidence).","zh":"过于温顺/怯懦/顺从的；过分谦卑（常带有“显得软弱、缺乏自信”的含义）。"},"examples":[{"en":"He apologized again and again, sounding overmeek even when he wasn’t at fault.","zh":"他一再道歉，即使不是他的错，听起来也显得过于卑微。"},{"en":"Don’t be overmeek in negotiations—state what you need clearly.","zh":"谈判时别太温吞，要清楚表达你的需求。"}]}],"synonyms":["overly meek","too meek","submissive","overly submissive","timid"],"phonetic":"/ˌoʊvɚˈmiːk/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overmeek 不是“更温柔”的褒义，而是“温顺过头”的贬义或批评语气。","这个词在现代日常口语中不算常见，更常见的表达包括 “too meek / overly meek / overly submissive”。"]}
{"word":"overmeekly","summary":{"en":"“Overmeekly” means acting or speaking in an overly meek, overly submissive way.","zh":"“overmeekly”表示“以过于温顺、过分顺从的方式（说话或做事）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too meek, too submissive, or not confident enough.","zh":"过于温顺地；过分顺从地；过于缺乏自信地。"},"examples":[{"en":"She spoke overmeekly in the meeting and didn’t share her real opinion.","zh":"她在会议上说话过于温顺，没有表达真实想法。"},{"en":"He apologized overmeekly, even though the mistake wasn’t entirely his fault.","zh":"他道歉得过分卑微，尽管错误并不全是他的责任。"}]}],"synonyms":["overly submissively","too meekly","overly humbly","obsequiously"],"phonetic":"/ˌoʊvɚˈmikli/","extraExplanation":["“over-”在这里表示“过度、太……”，所以overmeekly不是单纯“礼貌/温和”，而是带有“过分退让、过于顺从”的意味。","meek通常指“温和不争、逆来顺受”的性格或态度；在现代英语语境里，它常含轻微负面评价（缺乏主见、容易被欺负），不同于kind（善良）或polite（有礼貌）。"]}
{"word":"overmeekness","summary":{"en":"Overmeekness means being too meek—excessively timid or submissive.","zh":"overmeekness 指“过度温顺”，即过分胆怯或顺从。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive meekness; being too timid, submissive, or unwilling to speak up for yourself.","zh":"过度温顺；过分胆怯、过分顺从，或不敢为自己发声。"},"examples":[{"en":"Her overmeekness made it hard for her to say no, even when she was exhausted.","zh":"她的过度温顺让她很难说“不”，即使她已经筋疲力尽。"},{"en":"In a negotiation, overmeekness can lead to accepting unfair terms.","zh":"在谈判中，过度温顺可能会导致接受不公平的条件。"},{"en":"He learned that kindness is good, but overmeekness can invite people to take advantage of you.","zh":"他明白善良是优点，但过度温顺可能会让人趁机占便宜。"}]}],"synonyms":["excessive submissiveness","overcompliance","timidity","servility"],"phonetic":"/ˌoʊvərˈmiknəs/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、超出适当范围”。因此 overmeekness 通常带有负面评价：不是指温和本身不好，而是指“温和到损害自身利益”。","meek 在一些宗教或文学语境中也可能是褒义（如强调谦卑、温柔），但 overmeekness 更强调“太过头”。"]}
{"word":"overmellow","summary":{"en":"Overmellow means “too mellow”—most often overripe fruit, or (figuratively) overly relaxed and lacking energy.","zh":"overmellow 表示“过于成熟/温和”：多指水果过熟，也可比喻过于松弛、没劲。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too mellow; past the best stage of ripeness, freshness, or firmness (often about fruit), sometimes becoming soft or slightly spoiled.","zh":"过熟的；熟过头的（常指水果等已过最佳成熟/新鲜度，变得过软，甚至略有变质）。"},"examples":[{"en":"The peaches were overmellow, so they bruised easily in the bag.","zh":"这些桃子熟过头了，所以在袋子里很容易被压伤。"},{"en":"If the bananas get overmellow, use them for banana bread instead of eating them raw.","zh":"如果香蕉过熟了，可以用来做香蕉面包，而不是直接生吃。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Too relaxed, gentle, or laid-back, sometimes to the point of seeming slow, lazy, or lacking energy.","zh":"（比喻）过于温和放松的；松弛到显得没劲、慢吞吞或缺乏干劲。"},"examples":[{"en":"After the long holiday, the whole office felt a bit overmellow on Monday morning.","zh":"长假过后，周一早上整个办公室都有点“过于松弛”，提不起精神。"},{"en":"His overmellow attitude made it hard to finish the project on time.","zh":"他过于悠哉的态度让项目很难按时完成。"}]}],"synonyms":["overripe","too ripe","overly mellow","too laid-back","over-soft"],"phonetic":"/ˌoʊvərˈmɛloʊ/","extraExplanation":["“overmellow”不是非常常见的标准词，更常见的说法是“overripe”（过熟的）或“too mellow/overly mellow”（太温和/太放松）。但在描述水果“熟过头”时，“mellow”确实可以表示“成熟到柔软甜润”，加上“over-”就很自然地变成“过度成熟”。","用于比喻时，“mellow”常带正面含义（温和、圆融、放松），而“overmellow”会暗示“过头了”，语气可能略带批评。"]}
{"word":"overmellowly","summary":{"en":"“Overmellowly” means ‘in an overly mellow way’—so calm, gentle, or sweet that it feels too much.","zh":"“overmellowly”表示“过于温和/松弛地”，温吞到显得过头。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly mellow way; so gentle, relaxed, or sweet that it feels excessive, bland, or lacking energy.","zh":"以过于温和/松弛/甜腻的方式；温吞到显得过头、乏味或缺乏力度。"},"examples":[{"en":"The movie begins overmellowly, with long, soft scenes that make the story feel slow.","zh":"这部电影开头过于温吞，长时间的柔和镜头让故事显得拖沓。"},{"en":"He spoke overmellowly, as if trying so hard to be calm that he sounded insincere.","zh":"他说话过于温和，像是太努力保持冷静，反而听起来不真诚。"},{"en":"The jazz set played overmellowly tonight—pretty, but missing the usual bite.","zh":"今晚的爵士演奏过于柔和——好听是好听，但少了平时的那股劲。"}]}],"synonyms":["overly gently","too softly","overly calmly","over-sweetly","languidly"],"phonetic":"/ˌoʊvərˈmɛloʊli/","extraExplanation":["“overmellowly”不是常见标准词，更像是临时造词（creative coinage）。英语里常用“overly mellow / too mellow / a bit too mellow”来表达同样意思；写作时用这些更自然。","构词法：over-（过度）+ mellow（柔和、醇和）+ -ly（副词）。因此它通常修饰动词或整句话的语气，如“play/speak/feel overmellowly”。"]}
{"word":"overmellowness","summary":{"en":"Overmellowness means being too mellow—so gentle, sweet, or softened that it becomes bland or weak.","zh":"Overmellowness 指“过度醇和/温和”，温柔或甜润到显得乏味、软弱或缺少力度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too mellow (too soft, sweet, gentle, or relaxed), sometimes to the point of seeming weak, bland, or lacking energy","zh":"过度的“醇和/柔和”（太软、太甜、太温和或太放松），以至于显得无力、乏味或缺乏冲劲"},"examples":[{"en":"Some critics felt the album suffered from overmellowness and needed sharper contrasts.","zh":"一些评论家觉得这张专辑“过于温吞”，需要更鲜明的对比。"},{"en":"The wine’s overmellowness made it taste flat rather than complex.","zh":"这款酒过度醇和，喝起来反而显得平淡，而不是有层次。"},{"en":"In his speeches, overmellowness sometimes sounded like avoiding hard truths.","zh":"在他的演讲里，过度温和有时听起来像是在回避尖锐的事实。"}]}],"synonyms":["excessive mellowness","overly soft tone","over-sweetness","blandness"],"phonetic":"/ˌoʊvərˈmɛloʊnəs/","extraExplanation":["“overmellowness”由前缀 over-（过度）+ mellowness（醇和、柔和、圆熟）构成，语感上通常带一点负面评价：不是单纯“温和”，而是“温和得过头”。","在谈“酒/水果”时可指“熟过头、甜腻”；在谈“性格/语气/艺术风格”时常指“过分圆滑或过分柔软，缺少力量或棱角”。","该词较少见，更常用的表达包括：too mellow, overly mellow, excessive mellowness。"]}
{"word":"overmelodied","summary":{"en":"“Overmelodied” means “too full of melody,” often suggesting something is overly tuneful or sing-song in a slightly negative way.","zh":"“overmelodied”表示“旋律过多/过分旋律化”，通常带一点贬义，暗示过甜腻、过唱腔或缺少变化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much melody; made excessively tuneful in a way that feels over-sweet, over-sung, or lacking variety.","zh":"旋律过多的；过分悦耳/过分“唱腔化”的，以至于显得甜腻、单调或缺少变化。"},"examples":[{"en":"Some listeners found the soundtrack overmelodied and tiring after a while.","zh":"有些听众觉得这段配乐旋律堆得太满，听久了会累。"},{"en":"The chorus is catchy, but the whole song feels overmelodied for such a simple message.","zh":"副歌很洗脑，但整首歌为了这么简单的意思却写得旋律过头了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of writing or speech) Shaped as if it were a melody—too sing-song, flowing, or lyrical for the context.","zh":"（指文字/说话）像在哼歌一样过于抑扬顿挫、过分抒情，不太符合语境。"},"examples":[{"en":"The ad copy is overmelodied; it sounds more like a poem than a clear instruction.","zh":"这段广告文案太“旋律化”了，听起来更像诗而不是清晰的说明。"}]}],"synonyms":["too melodic","overly tuneful","sing-song","overly lyrical","saccharine"],"phonetic":"/ˌoʊvərˈmɛləˌdid/","extraExplanation":["“overmelodied”不是常见标准词，更像是作者临时造词（creative coinage）。结构上可以理解为 over-（过度）+ melody（旋律）+ -ed（带有……特征的）。常见于乐评、文学评论等需要表达细微语感的场景。","如果想用更常见的表达，可以改说：too melodic（太旋律化）、overly tuneful（过分悦耳/过分“好听”）、sing-song（唱腔的，偏贬义）、saccharine（甜腻的，偏贬义，语气更强）。"]}
{"word":"overmelodious","summary":{"en":"“Overmelodious” means excessively melodious—so sweet-sounding that it may feel unnatural or overly sentimental.","zh":"“overmelodious”表示“过于悦耳/甜美”，好听到让人觉得不自然或过分煽情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too melodious; excessively sweet-sounding or sing-song (often suggesting it feels artificial or tiring).","zh":"过于悦耳的；过分甜美、带点“腻”的（常暗示听起来不自然或让人疲劳）。"},"examples":[{"en":"The singer’s overmelodious style made the sad lyrics feel less believable.","zh":"歌手过于甜美的唱法让悲伤的歌词显得不那么可信。"},{"en":"Some listeners find the soundtrack overmelodious and prefer something simpler.","zh":"有些听众觉得这段配乐过于悦耳，反而更喜欢简单一点的。"},{"en":"His overmelodious voice sounded like a commercial rather than a conversation.","zh":"他过分甜美的嗓音听起来像广告，而不像在聊天。"}]}],"synonyms":["too sweet-sounding","overly melodious","cloying","saccharine","sing-song"],"phonetic":"/ˌoʊvərməˈloʊdiəs/","extraExplanation":["这个词由 over-（“过度、太……”）+ melodious（“悦耳的”）组成，常用来表达一种带批评意味的“好听得过头了”。","在写作或评论里，它往往不是单纯夸奖，而是在说声音/旋律“太甜、太滑、太做作”，缺少真实感或层次。"]}
{"word":"overmelodiously","summary":{"en":"Overly sweetly or melodically, often to an unnatural or exaggerated degree.","zh":"过于甜美或悦耳地（常指夸张到不自然的程度）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too sweet-sounding, smooth, or song-like—so much that it may feel exaggerated, sentimental, or unnatural.","zh":"以过于悦耳、柔美或像唱歌一样的方式（多到让人觉得夸张、矫情或不自然）。"},"examples":[{"en":"The narrator speaks overmelodiously, making the simple story feel overly dramatic.","zh":"叙述者说话过于柔美悦耳，让一个简单的故事听起来变得过分戏剧化。"},{"en":"The choir sang beautifully, but the soloist performed overmelodiously for the solemn occasion.","zh":"合唱很动听，但独唱者唱得过于甜美，不太适合那种庄重的场合。"},{"en":"Her overmelodiously polite tone sounded insincere to some listeners.","zh":"她那种过于柔和客气的语气，让一些听众觉得不够真诚。"}]}],"synonyms":["too melodiously","overly sweetly","syrupily","cloyingly"],"phonetic":"/ˌoʊvərməˈloʊdiəsli/","extraExplanation":["“overmelodiously”由 over-（过度）+ melodiously（悦耳地）构成，属于比较少见、偏书面/修辞的副词。常带轻微的批评意味，暗示“好听过头了”。","在写作中，它常用来评价声音、语调、朗读或音乐风格；更日常的说法可用 “too sweetly / too smoothly / in an overly melodic way”。"]}
{"word":"overmelodiousness","summary":{"en":"Overmelodiousness means being too sweetly melodic, often in a way that feels artificial or cloying.","zh":"overmelodiousness 指“过分悦耳/甜美”，常带有“甜腻、矫饰、不耐听”的批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too melodious or sweet-sounding, sometimes to the point of feeling sentimental, artificial, or tiring","zh":"过分悦耳（或甜美）的性质；（悦耳到）显得矫饰、甜腻或让人听久了疲劳的状态"},"examples":[{"en":"Some critics felt the song’s overmelodiousness made it sound cheesy.","zh":"一些评论家觉得这首歌过分悦耳，听起来有点俗气。"},{"en":"The film score had a gentle beauty, but its overmelodiousness weakened the tension.","zh":"电影配乐温柔动人，但过分悦耳反而削弱了紧张感。"},{"en":"He preferred folk recordings with rough edges to the overmelodiousness of polished pop.","zh":"他更喜欢带点粗粝感的民谣录音，而不是过度精致甜美的流行音乐。"}]}],"synonyms":["cloyingness","saccharineness","syrupiness","over-sweetness"],"phonetic":"/ˌoʊvərməˈloʊdiəsnəs/","extraExplanation":["这是一个很少见、偏书面/评论用语的名词，通常出现在音乐、诗歌朗诵、配乐等的批评语境里，带有轻微的贬义：好听是好听，但“好听过头”导致缺少真实感或力度。","词形结构：over-（过度）+ melodious（悦耳的）+ -ness（名词后缀），意思直观但不算常用；更常见的表达是“too melodious / overly sweet / cloying”。"]}
{"word":"overmelt","summary":{"en":"Overmelt means to melt too much or beyond the desired point.","zh":"overmelt 指“融化过头、融化过度”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to melt something too much, or to melt beyond the intended point (often causing it to become too runny, separated, or damaged).","zh":"把……融化过头；融化超过需要的程度（常导致过稀、分离或受损）。"},"examples":[{"en":"Be careful not to overmelt the chocolate, or it may turn grainy.","zh":"小心别把巧克力融化过头，不然可能会变得粗糙起颗粒。"},{"en":"If you overmelt the butter, the sauce can separate.","zh":"如果黄油融化过头，酱汁可能会油水分离。"}]},{"partOfSpeech":"vi.","definition":{"en":"to melt too much or for too long (used for materials that are melting).","zh":"（某物）融化过度；融化时间过长。"},"examples":[{"en":"The plastic can overmelt if the temperature is too high.","zh":"温度太高的话，塑料可能会融化过度。"},{"en":"On hot days, the snowpack may overmelt and cause flooding.","zh":"炎热的日子里，积雪可能会融化过度并引发洪水。"}]}],"synonyms":["melt too much","overheat","melt down (context-dependent)"],"phonetic":"/ˌoʊvərˈmɛlt/","extraExplanation":["“overmelt”不是非常常见的日常词，更常见的表达有“melt too much / melt too far / overheat and melt”。但在烹饪（巧克力、黄油、奶酪）、材料加工（塑料、金属、玻璃）或气候语境（雪冰融化）中，用“over- + 动词”这种构词法来表示“过度”是很自然的。","前缀 over- 常表示“超过正常/需要的程度”，类似：overcook（煮过头）、overheat（过热）、overmix（搅拌过度）。理解这个前缀有助于你猜测许多新词的含义。"]}
{"word":"overmelted","summary":{"en":"Overmelted means something has been melted too much or too long, causing a loss of proper texture or shape.","zh":"overmelted 指“融化过度”，导致质地或形状变差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Melted too much or for too long, so it becomes overly soft, watery, burnt, or loses its proper shape/texture.","zh":"融化过度（时间太久或程度太大），导致太软、出水、焦糊，或失去原本的形状/口感。"},"examples":[{"en":"The chocolate was overmelted, so it turned grainy and hard to use for dipping.","zh":"巧克力融化过度，变得粗糙起粒，很难用来蘸裹。"},{"en":"I left the cheese on the pan too long, and it got overmelted and oily.","zh":"我把奶酪在锅里放太久，结果融化过度，变得很油。"}]}],"synonyms":["melted too much","overheated","overcooked (for food)","broken down (for texture)"],"phonetic":"/ˌoʊvərˈmɛltɪd/","extraExplanation":["“over-”表示“过度、太……”。因此“overmelted”多用于口语或说明性写作（尤其是烹饪、材料处理），意思是“融化得过头”。更常见的表达还有：melted too much / overheated / melted down."]}
{"word":"overmelting","summary":{"en":"Overmelting means melting something excessively, often causing unwanted damage or loss of quality.","zh":"Overmelting 指“过度熔化/融化”，常暗示带来损坏或质量下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or result of melting something too much or too long, often causing damage or loss of desired shape/structure","zh":"（过度熔化）指把某物融化得过头或时间过长，常导致损坏或失去原本的形状/结构"},"examples":[{"en":"Overmelting can ruin the texture of chocolate and make it grainy.","zh":"巧克力过度融化会破坏口感，变得粗糙起沙。"},{"en":"The technician checked the furnace settings to prevent overmelting of the alloy.","zh":"技术员检查了炉子的设定，以防合金过度熔化。"}]},{"partOfSpeech":"adj.","definition":{"en":"melting too much; excessively melted (often used to describe a material or process)","zh":"（描述材料或过程）融化过头的；过度熔化的"},"examples":[{"en":"The overmelting wax spilled over the edges of the mold.","zh":"过度融化的蜡从模具边缘溢了出来。"},{"en":"An overmelting condition may weaken the final casting.","zh":"过度熔化的状态可能会削弱最终铸件的强度。"}]}],"synonyms":["excessive melting","overheating","melting too much"],"phonetic":"/ˌoʊvɚˈmɛltɪŋ/","extraExplanation":["“overmelting”不是日常高频词，更常见于材料、冶金、铸造、玻璃/塑料加工等语境，用来强调“超过合适范围的熔化”会带来负面后果（例如晶粒变粗、成分挥发、形变、强度下降等）。","在普通生活语境里，人们更常说“melted too much / overheated / melted too long”。在技术写作里用“overmelting”能更简洁地把“过度”这一层意思写出来。"]}
{"word":"overmelts","summary":{"en":"“Overmelts” means melts something (or melts) too much, causing it to lose quality or shape.","zh":"“overmelts”表示（把某物）融化过头，或（某物）化得过度，从而失去质量或形状。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To melt something too much, so it loses its shape, texture, or usefulness.","zh":"（较少用）把（某物）融化得过头，导致失去形状、口感或用途。"},"examples":[{"en":"If you overmelts the chocolate, it can turn grainy and hard to work with.","zh":"如果你把巧克力融化过头，它可能会变得粗糙结粒，不好操作。"},{"en":"High heat overmelts the plastic and it starts to warp.","zh":"高温把塑料融化过头，它就开始变形。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) To melt too much (used for the material itself).","zh":"（较少用）（指材料本身）融化得过头。"},"examples":[{"en":"Under direct sun, the wax overmelts and runs down the candle.","zh":"在直射阳光下，蜡融化过头，顺着蜡烛流下来。"},{"en":"The ice cream overmelts quickly in this heat.","zh":"这么热的天气里，冰淇淋很快就会化得过头。"}]}],"synonyms":["melt too much","overheat","melt down","liquefy"],"phonetic":"ˌoʊvərˈmɛlts","extraExplanation":["“overmelts”通常是动词“overmelt”的第三人称单数（he/she/it overmelts）。这个词在日常英语里不算常见，更常见的说法是“melt too much / overheat”。","在烹饪、手工（如蜡烛、树脂、塑料）或工业语境中，用“overmelt”可以更直观地强调“融化过度，导致质量变差”。"]}
{"word":"overmen","summary":{"en":"“Overmen” is the plural of “overman,” meaning either a mine foreman/supervisor or (in Nietzsche) an ideal higher human who goes beyond ordinary limits.","zh":"“overmen”是“overman”的复数：可指（尤指矿井的）工头/领班，也可指（尼采哲学中的）“超人/超人类”——超越常人局限、创造新价值的理想人格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A supervisor or foreman, especially in a mine (a person who directs workers).","zh":"（尤指矿井的）工头，领班；监督工人的人。"},"examples":[{"en":"The overman checked the safety lamps before the miners went underground.","zh":"工头在矿工下井前检查了安全灯。"},{"en":"If there’s a problem with the equipment, report it to the overman.","zh":"如果设备有问题，就向领班报告。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy (especially Nietzsche), an ideal “higher” human being who goes beyond ordinary human limits and creates new values; often translated as “overman” or “Übermensch.”","zh":"（哲学，尤指尼采）“超人/超人类”的理想人格：超越普通人的局限、能自我超克并创造新价值的人；常译为 overman 或德语 Übermensch。"},"examples":[{"en":"In Nietzsche’s writing, the overman represents self-overcoming and the creation of new values.","zh":"在尼采的著作中，“超人”象征自我超克与创造新价值。"},{"en":"Some readers confuse the overman with a comic-book superhero, but the idea is philosophical, not about superpowers.","zh":"有些读者会把“超人”误当成漫画英雄，但这个概念是哲学性的，并非指超能力。"}]}],"synonyms":["foreman","supervisor","mine foreman","Übermenschen (German plural, in philosophy contexts)"],"phonetic":"ˈoʊvərmɛn","extraExplanation":["“overmen”是“overman”的复数。发音上也常见单数 /ˈoʊvərmæn/，复数 /ˈoʊvərmɛn/。","尼采的Übermensch常被译为“超人/超人类”。它强调精神与价值层面的“自我超越”，并不等同于“优越种族”或“强者统治”。历史上曾有人误用该概念为政治宣传，需要注意语境与原意。","英语里还会看到 related terms：foreman（工头/领班，最常用的日常词）、supervisor（监督/主管）。哲学语境里也常见“higher man（更高的人）”“self-overcoming（自我超克）”。"]}
{"word":"overmerciful","summary":{"en":"Overmerciful means “too merciful or too lenient,” often implying the mercy is excessive for the situation.","zh":"overmerciful 指“过于仁慈或过分宽容”，常暗示这种宽容在该情境下显得过度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing too much mercy; more forgiving or lenient than is wise or fair in a situation","zh":"过于仁慈的；过分宽容的（在某些情况下可能不明智或不公平）"},"examples":[{"en":"The judge was criticized for being overmerciful and giving a very light sentence.","zh":"这位法官因过于仁慈、判得太轻而受到批评。"},{"en":"Being overmerciful to repeated cheating can make the rules feel meaningless.","zh":"对反复作弊过于宽容，会让规则显得毫无意义。"},{"en":"She worried that an overmerciful apology would sound like she was excusing the harm.","zh":"她担心过于宽容的道歉听起来像是在为伤害开脱。"}]}],"synonyms":["too lenient","overly forgiving","unduly merciful","too soft","too permissive"],"phonetic":"/ˌoʊvɚˈmɝsɪfəl/","extraExplanation":["“over-”是一个常见前缀，表示“过度、太……”。因此 overmerciful 通常带有轻微的负面评价：不是单纯“很善良”，而是“宽容得不合时宜”。","这个词相对少见，更常见的表达有 “too lenient / overly forgiving / unduly merciful”。在正式评论（如法律、纪律、教育管理）语境里更容易出现。"]}
{"word":"overmercifully","summary":{"en":"“Overmercifully” means doing something too mercifully or too leniently.","zh":"“overmercifully”指“过于仁慈/过分宽容地做某事”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is too merciful; more forgiving or lenient than is appropriate","zh":"过于仁慈地；过分宽容地（以至于不太恰当）"},"examples":[{"en":"The judge treated the repeat offender overmercifully and gave only a warning.","zh":"法官对这名惯犯过于仁慈，只给予了警告。"},{"en":"If you grade overmercifully, students may not learn from their mistakes.","zh":"如果你评分过于宽容，学生可能不会从错误中学习。"}]}],"synonyms":["too mercifully","too leniently","overleniently","overindulgently"],"phonetic":"ˌoʊvərˈmɝsəfli","extraExplanation":["“over-”表示“过度、超过适当程度”。“overmercifully”带有批评或担忧的语气，暗示这种仁慈可能导致不公平、纵容或产生负面后果。","更常见的表达是“too mercifully / too leniently”。“overmercifully”较少见，偏书面或强调语气。"]}
{"word":"overmercifulness","summary":{"en":"Overmercifulness means being too merciful or lenient, often with negative consequences.","zh":"overmercifulness 指过度仁慈或过分宽容，常暗示会带来负面后果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too merciful; excessive mercy or leniency, especially when it leads to unfairness or harmful outcomes.","zh":"过度仁慈；过分宽容（尤指因此造成不公平或不良后果）。"},"examples":[{"en":"Some critics argued that the judge’s overmercifulness encouraged repeat offenses.","zh":"一些批评者认为法官的过度仁慈助长了再犯。"},{"en":"Her overmercifulness made it hard for her to set clear boundaries with her children.","zh":"她的过分宽容让她很难对孩子设定清晰的界限。"},{"en":"Overmercifulness can feel kind in the moment but may cause bigger problems later.","zh":"过度仁慈当下看似善良，但之后可能带来更大的问题。"}]}],"synonyms":["excessive mercy","undue leniency","overleniency","soft-heartedness (often negative in context)"],"phonetic":"/ˌoʊvərˈmɝsɪfəlnəs/","extraExplanation":["这个词由 over-（过度）+ merciful（仁慈的）+ -ness（名词后缀）组成，意思很直观，但在现代英语里相对少见；更常见的表达是 excessive mercy / undue leniency / being too lenient。","语气上常带批评意味：不是否定“仁慈”本身，而是强调“仁慈过头”会削弱规则、纵容错误或造成对他人的不公平。"]}
{"word":"overmerit","summary":{"en":"“Overmerit” is a rare word meaning to be given (or to seem to deserve) more praise or reward than is appropriate—i.e., to be overrated.","zh":"“overmerit”是个较罕见的词，表示被给予或看起来“过度值得”称赞/奖励，即“过誉、被高估”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) to deserve or seem to deserve more praise, reward, or importance than is appropriate; to be judged as having too much merit.","zh":"（罕见）过度值得（称赞/奖励）；被认为功劳或价值被夸大、超过应有程度。"},"examples":[{"en":"Some critics argue the film overmerits the awards it received.","zh":"一些评论家认为这部电影拿到的奖项有点“过誉”，不太配得上。"},{"en":"In the hype, a small improvement can overmerit a huge celebration.","zh":"在炒作之下，一个小改进也可能被“过度称赞”，引发过大的庆祝。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, noun) excessive or overstated merit; an exaggerated sense that something is highly deserving.","zh":"（罕见，名词）过度的功劳/价值；对“很值得”的夸大评价（过誉）。"},"examples":[{"en":"The article’s overmerit made the product seem life-changing.","zh":"这篇文章的“过誉”把产品说得像能改变人生一样。"}]}],"synonyms":["be overrated","be overpraised","be overvalued","receive undue praise","be given too much credit"],"phonetic":"/ˌoʊvərˈmɛrɪt/","extraExplanation":["“overmerit”在现代英语里非常不常见，很多情况下更自然的表达是：be overrated（被高估/过誉）、receive undue praise（得到不应有的称赞）、deserve more credit than…（比……更配得上功劳）。","构词上可理解为 over-（过度）+ merit（优点/功劳/值得），因此语感接近“过誉、被高估”。在正式写作中若担心读者不熟悉，建议改用更常见的词。"]}
{"word":"overmerrily","summary":{"en":"Overmerrily means ‘in an overly cheerful way,’ often suggesting the cheerfulness feels excessive or out of place.","zh":"overmerrily 指“过于欢快地”，常暗示这种欢快有点过头或不合时宜。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly cheerful, playful, or joking way—so cheerful that it may seem forced, inappropriate, or annoying.","zh":"过于欢快地／过于嬉闹地（快乐到显得不自然、不合时宜或让人觉得烦）。"},"examples":[{"en":"He laughed overmerrily at the meeting, even when the topic was serious.","zh":"在会议上，即使话题很严肃，他也笑得过于欢快。"},{"en":"She spoke overmerrily, trying to hide how nervous she felt.","zh":"她说话过于欢快，想掩饰自己的紧张。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Literary/older use) Very merrily; with great joy.","zh":"（文学／较旧用法）非常欢快地；兴高采烈地。"},"examples":[{"en":"The children sang overmerrily as they ran through the fields.","zh":"孩子们跑过田野时唱得非常欢快。"}]}],"synonyms":["overly cheerfully","too merrily","excessively cheerfully","forcedly cheerful","a bit too cheerfully"],"phonetic":"/ˌoʊvərˈmɛrəli/","extraExplanation":["“over-”作前缀常表示“过度、超出正常程度”（如 overconfident 过度自信、overreact 反应过度）。因此 overmerrily 往往带有“太嗨了、欢快过头”的语气，常用于描写一种不合时宜或刻意的快乐。","这个词在现代英语里比较少见，更常见的表达是 “too merrily / overly cheerfully / a bit too cheerfully”。"]}
{"word":"overmerriment","summary":{"en":"Overmerriment means excessive or out-of-place merriment.","zh":"overmerriment 指“过度或不合时宜的欢乐/嬉闹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or inappropriate merriment; too much joking, laughter, or high spirits (often implying it is out of place).","zh":"过度的欢乐或嬉闹；不合时宜的笑闹与兴奋（常带有“不该这样”的含义）。"},"examples":[{"en":"The teacher stopped the overmerriment and asked everyone to focus on the lesson.","zh":"老师制止了过度的嬉闹，要求大家把注意力放回课堂。"},{"en":"At the memorial, even a little overmerriment felt disrespectful.","zh":"在追悼会上，哪怕一点过度的欢笑也显得不够尊重。"}]}],"synonyms":["excessive merriment","undue merriment","overexcitement","rowdiness"],"phonetic":"/ˌoʊvɚˈmɛrɪmənt/","extraExplanation":["“overmerriment”不是非常常见的标准词汇，更像是由 over-（过度）+ merriment（欢乐、嬉闹）组合出来的用法，用来强调“欢乐太多、太吵、或不合场合”。","在正式写作里，人们更常用“excessive merriment / undue merriment / too much merriment”等表达；“overmerriment”则带一点文学或修辞色彩。"]}
{"word":"overmerriness","summary":{"en":"Overmerriness means too much cheerfulness or joking, often in a way that feels inappropriate or forced.","zh":"Overmerriness 指过度的快乐或玩笑，常带“不合时宜/刻意”的负面语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive cheerfulness or joking that feels inappropriate, forced, or annoying in a particular situation.","zh":"（在某种场合显得）过度的快乐/玩笑；让人觉得不合时宜、刻意或令人烦躁的过分欢闹。"},"examples":[{"en":"In the quiet hospital waiting room, his overmerriness made everyone uncomfortable.","zh":"在安静的医院候诊室里，他的过分欢闹让大家都很不自在。"},{"en":"Her overmerriness during the serious meeting sounded like she wasn’t taking the problem seriously.","zh":"在严肃的会议上她过度嬉笑，听起来像是不把问题当回事。"}]}],"synonyms":["excessive cheerfulness","forced jollity","overexuberance","over-gaiety","inappropriate levity"],"phonetic":"/ˌoʊvərˈmɛrinəs/","extraExplanation":["这是由 over-（“过度”）+ merriness（“快乐、欢闹”）构成的名词，语感上带有“过头了”的批评意味，常用来表达“气氛不对”或“情绪用力过猛”。","这个词在现代英语中比较少见，更常见的表达有 excessive cheerfulness / forced jollity / overexuberance 等。"]}
{"word":"overmerry","summary":{"en":"“Overmerry” means excessively cheerful or boisterous, often from drinking.","zh":"“overmerry”指过分欢乐或喧闹（常因饮酒而兴奋）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too cheerful or noisy in a way that seems uncontrolled or inappropriate (often because of alcohol).","zh":"过分欢乐的；喧闹得有些过头的（常指因喝酒而兴奋）。"},"examples":[{"en":"After a few drinks, he became overmerry and started singing loudly.","zh":"喝了几杯之后，他变得过分兴奋，开始大声唱歌。"},{"en":"The boss didn’t like the overmerry jokes during the meeting.","zh":"老板不喜欢会议上那些过于嬉闹的玩笑。"}]}],"synonyms":["overly merry","too merry","boisterous","rowdy","jovial","tipsy (often implied)"],"phonetic":"/ˌoʊvərˈmɛri/","extraExplanation":["“overmerry”带有较强的文学/旧式英语色彩，在现代日常口语里不算常见；更常用的表达包括“too merry / overly merry / boisterous / rowdy / tipsy and loud”等。","前缀“over-”在英语里常表示“过度、过分”（如 overconfident 过度自信、overreact 反应过度）。因此 overmerry 直观就是“merry 得过头了”。","在文学作品里它常用来暗示一种“欢闹到失态”的气氛，既可能是轻松好笑，也可能带一点批评意味（不够得体、太吵、太放纵）。"]}
{"word":"overmeticulous","summary":{"en":"Overly careful and detail-focused in a way that’s more than necessary.","zh":"過度注重細節、講究到不必要的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too careful about small details; more precise or picky than the situation needs.","zh":"過度注重細節的；太講究、太挑剔（超出情境需要）。"},"examples":[{"en":"He’s overmeticulous about formatting, so finishing the report takes forever.","zh":"他對排版過度講究，所以報告永遠做不完。"},{"en":"Don’t be overmeticulous—this is just a rough draft.","zh":"別太吹毛求疵——這只是一份草稿。"},{"en":"An overmeticulous approach can slow down teamwork.","zh":"過度謹小慎微的做法可能會拖慢團隊合作的進度。"}]}],"synonyms":["picky","overly fussy","nitpicky","overcritical"],"phonetic":"/ˌoʊvərməˈtɪkjələs/","extraExplanation":["字首 over- 常表示「過度、超出需要」；meticulous 表示「一絲不苟、非常細心」。合起來 overmeticulous 就是「細心到過頭」，語氣通常偏負面，暗示效率變差或顯得太挑剔。","近義辨析：careful / thorough 多為中性或正面；meticulous 偏「很講究」；overmeticulous 則強調「不合時宜的過度講究」。"]}
{"word":"overmeticulousness","summary":{"en":"Overmeticulousness means being too careful and detail-focused, often to an unhelpful degree.","zh":"overmeticulousness 指过度谨慎、过分关注细节，常常到了不太有帮助的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too meticulous; excessive attention to small details in a way that can slow work or cause unnecessary worry","zh":"过度一丝不苟；对细节过分在意，以至于可能拖慢进度或带来不必要的担忧"},"examples":[{"en":"His overmeticulousness made simple tasks take twice as long.","zh":"他过度一丝不苟，让简单的任务花了双倍时间。"},{"en":"A little care is good, but overmeticulousness can hurt productivity.","zh":"适度认真是好事，但过度一丝不苟会影响效率。"},{"en":"She tried to avoid overmeticulousness by setting a time limit for editing.","zh":"她通过给修改设定时间上限来避免过度一丝不苟。"}]}],"synonyms":["excessive carefulness","overattention to detail","nitpicking","pedantry","perfectionism"],"phonetic":"/ˌoʊvɚməˈtɪkjələsnəs/","extraExplanation":["这个词由 over-（“过度”）+ meticulous（“一丝不苟的”）+ -ness（名词后缀，表示“……的状态/性质”）构成，意思通常带轻微负面评价：不是“认真”，而是“认真过头”。","在学习或工作场景中，它常接近 perfectionism（完美主义）的一种表现，但更强调“细节抠得太细”这一点，而不一定强调“追求完美的结果”。"]}
{"word":"overmettled","summary":{"en":"Overmettled means too bold or high-spirited—overconfident in a way that can cause trouble.","zh":"overmettled 指“过于逞强/过分勇猛自信”，往往暗示因此不够谨慎、容易惹麻烦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too bold, high-spirited, or overconfident; having more courage or energy than is wise in a situation.","zh":"过于逞强的；过分勇猛或自信的（以至于不够谨慎）。"},"examples":[{"en":"The overmettled young rider tried to jump the fence and fell.","zh":"那个逞强的年轻骑手硬要跳过篱笆，结果摔了下来。"},{"en":"Her overmettled reply turned a small disagreement into an argument.","zh":"她那句过于强硬的回应把小分歧升级成了争吵。"}]}],"synonyms":["overconfident","too bold","rash","reckless","hotheaded"],"phonetic":"/ˌoʊvərˈmɛt(ə)ld/","extraExplanation":["“overmettled”比较少见，带有文学/古风色彩，常用来形容年轻人、士兵、马等“血气方刚、胆子太大”。","词根来自“mettle”（勇气、胆识、气概），与“metal”拼写相近但意义不同；加上“over-”表示“过度”。","现代英语里更常用的替换说法有：overconfident, too bold, rash, reckless（语气从中性到更负面不等）。"]}
{"word":"overmickle","summary":{"en":"Overmickle means “too much; excessive,” often in older or dialect (especially Scots) English.","zh":"overmickle 意为“太多的/过量的；过度地”，多见于较古老或方言（尤其苏格兰语气）英语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too much; excessive (in amount, degree, or number).","zh":"太多的；过量的（数量、程度或次数过多）。"},"examples":[{"en":"Don’t put in overmickle salt, or the soup will be too salty.","zh":"别放太多盐，不然汤会太咸。"},{"en":"Overmickle worry can keep you from sleeping.","zh":"过度担忧会让你睡不着。"}]},{"partOfSpeech":"adv.","definition":{"en":"To an excessive degree; too much.","zh":"过度地；太多地。"},"examples":[{"en":"He spoke overmickle and didn’t leave room for others.","zh":"他说得太多了，没给别人留空间。"},{"en":"If you push yourself overmickle, you may burn out.","zh":"如果你把自己逼得太过头，可能会精疲力竭。"}]}],"synonyms":["overmuch","too much","excessive","immoderate","inordinate"],"phonetic":"/ˌoʊvərˈmɪkəl/","extraExplanation":["“overmickle”是较古老、带苏格兰/方言色彩的词（mickle≈much/很多）。现代英语里更常用overmuch、too much、excessive。","在文学或民间故事、古风写作中可能会见到它，用来营造乡土或古典语气。"]}
{"word":"overmighty","summary":{"en":"Overmighty means “too powerful,” often implying an unfair or dangerous level of influence.","zh":"overmighty 指“过于强大”，常含“强大到不公平或危险、失去制衡”的贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too powerful or influential, especially in a way that feels unfair, threatening, or hard to control.","zh":"过于强大（尤指强大到让人觉得不公平、有威胁或难以控制）。"},"examples":[{"en":"The small town struggled to resist an overmighty corporation buying up local land.","zh":"这个小镇很难抵抗一家过于强大的公司收购当地土地。"},{"en":"Many people feared that an overmighty government could limit personal freedoms.","zh":"很多人担心过于强势的政府会限制个人自由。"},{"en":"In the story, the overmighty lord rules by fear rather than justice.","zh":"在故事中，那位过于强势的领主靠恐惧而不是公正来统治。"}]}],"synonyms":["overpowerful","too powerful","dominant","overbearing","tyrannical"],"phonetic":"/ˌoʊvərˈmaɪti/","extraExplanation":["“overmighty”带有明显的评价色彩：不是单纯“很强大”，而是“强大到压倒别人、失去制衡”。语气通常偏批评。","这个词在历史与文学语境中较常见，尤其用于描述“权势过大的贵族/大臣”（如中世纪或都铎时期的政治语境），现代新闻或学术写作也可能用来批评“过度集权”的机构。","构词上是 over-（过度）+ mighty（强大的），因此比“powerful”更强调“过头了、失衡了”的感觉。"]}
{"word":"overmild","summary":{"en":"“Overmild” means too mild or gentle—lacking strength or effect.","zh":"“overmild”指“过于温和/过轻”，力度或效果不足。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too mild or gentle; not strong, strict, or forceful enough (often suggesting weakness or lack of impact).","zh":"过于温和的；不够强烈/不够严格的（常含“力度不足、效果不大”的意思）。"},"examples":[{"en":"The punishment was overmild, so it didn’t discourage repeat offenses.","zh":"惩罚太过温和，所以没能阻止再次犯错。"},{"en":"Her overmild criticism made it hard for him to understand what needed to change.","zh":"她过于温和的批评让他很难明白哪里需要改。"},{"en":"If the medicine feels overmild, ask the doctor whether a stronger dose is appropriate.","zh":"如果药效感觉太弱，可以问医生是否需要更强的剂量。"}]}],"synonyms":["too mild","overly mild","overly gentle","not strong enough","lenient"],"phonetic":"/ˌoʊvərˈmaɪld/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。所以 overmild = “mild（温和/轻微）+ 过度”。在现代英语中不算高频词，更常见的说法是 “too mild / not strong enough / overly gentle”。"]}
{"word":"overmilitaristic","summary":{"en":"Overmilitaristic describes something seen as excessively military in style or influence, often criticized as too forceful or inappropriate.","zh":"overmilitaristic 指某事物“过度军事化”，带有批评意味，常暗示方式过于强硬或不合时宜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having too much military influence, style, or emphasis, especially in government, society, or behavior.","zh":"过度军事化的；军国主义色彩过强的（尤指政府、社会或行为风格被军队影响过度）。"},"examples":[{"en":"Critics said the new security policy felt overmilitaristic and ignored community needs.","zh":"批评者说新的安保政策过度军事化，忽视了社区的需求。"},{"en":"The parade looked overmilitaristic for a city that wanted to promote peace.","zh":"对于一个想推广和平的城市来说，这场游行显得过于军事化。"}]}],"synonyms":["over-militarized","too militarized","militaristic (often)","martial (in tone)"],"phonetic":"/ˌoʊvɚˌmɪləˈtɛrɪstɪk/","extraExplanation":["这个词由 over-（“过度”）+ militaristic（“军事化的/军国主义的”）构成，语气通常带批评，暗示“军事手段被用得太多、太强势”，而不是中性描述“有军队/与军队有关”。","常见搭配：overmilitaristic approach/policy/response（过度军事化的做法/政策/反应）、overmilitaristic culture（过度军事化的文化）。","近义表达（语气相近）：too militarized（过于军事化）、militaristic（军事化倾向强）。反义思路：civilian-led（以民间/文职为主导）、demilitarized（去军事化的）。"]}
{"word":"overmilitaristically","summary":{"en":"“Overmilitaristically” means doing something in an excessively militaristic, military-style way.","zh":"“overmilitaristically”表示“以过度军事化（过分军国主义/军队式）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves too much military influence, thinking, or force; excessively militaristic.","zh":"以过度军事化的方式；军事影响/军事思维/武力色彩过强地。"},"examples":[{"en":"The government responded overmilitaristically to peaceful protests, which only increased public anger.","zh":"政府对和平抗议作出过度军事化的回应，反而加剧了民众的愤怒。"},{"en":"Some critics say the city’s policing has become overmilitaristically focused on equipment and tactics instead of community trust.","zh":"一些批评者认为，这座城市的警务变得过度军事化，更关注装备和战术，而不是社区信任。"}]}],"synonyms":["excessively militaristically","too militaristically","with excessive military force","in a heavy-handed military-style way"],"phonetic":"/ˌoʊvərˌmɪləˈtɛrɪstɪkli/","extraExplanation":["这个词由 over-（“过度、太……”）+ militaristic（“军事主义的、军事化的”）+ -ally（副词后缀）构成，常用于批评某种做法“把问题当成战争来处理”。在公共讨论中它容易带有价值判断色彩，使用时可根据语境改用更中性的表达（如 “with heavy military involvement/using military-style tactics”）。"]}
{"word":"overmilk","summary":{"en":"Overmilk means to milk an animal too much (or, informally, to add too much milk to a drink/mixture).","zh":"overmilk 指（对动物）过度挤奶；也可非正式指（往饮品/混合物里）加太多牛奶。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to milk (a cow, goat, etc.) too much or for too long, often causing stress, pain, or reduced health/production","zh":"（对奶牛、山羊等）过度挤奶；挤奶时间过长或次数过多，可能导致动物压力、疼痛或健康/产奶量下降"},"examples":[{"en":"If you overmilk a cow, you can irritate the teats and increase the risk of infection.","zh":"如果过度挤奶，可能会刺激乳头并增加感染风险。"},{"en":"The farm adjusted its schedule to avoid overmilking during the hottest part of the day.","zh":"农场调整了时间表，避免在一天最热的时候过度挤奶。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put too much milk into a drink or mixture","zh":"（非正式）往饮料或混合物里加了太多牛奶"},"examples":[{"en":"I overmilked my coffee, so it tasted weak.","zh":"我咖啡里牛奶加太多了，所以味道很淡。"},{"en":"Try not to overmilk the batter, or it may become too runny.","zh":"面糊别加太多牛奶，不然会太稀。"}]}],"synonyms":["milk too much","over-milk","overmilking"],"phonetic":"/ˌoʊvərˈmɪlk/","extraExplanation":["“overmilk”不是日常英语里很常见的词，更常见的表达是“milk too much / over-milk (with a hyphen)”或在畜牧语境中说“overmilking”。在奶牛场语境里，它和动物福利、乳房炎（mastitis）风险、挤奶流程管理等话题相关。"]}
{"word":"overmill","summary":{"en":"Overmill means to process something by milling too much, causing quality or texture to suffer.","zh":"overmill 指“过度碾磨/过度加工”，使成品的质地或品质受影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to mill or process (grain, flour, cloth, etc.) too much, so the result becomes overly fine, damaged, or reduced in quality","zh":"把（谷物、面粉、布料等）过度碾磨/过度加工，导致成品过细、受损或品质下降"},"examples":[{"en":"If you overmill the flour, it can lose some of its texture and character.","zh":"如果把面粉碾磨过度，它可能会失去一部分口感和特色。"},{"en":"The fabric was overmilled, so it became thinner and weaker than intended.","zh":"这块布料被过度缩绒/过度加工，所以变得比预期更薄、更脆弱。"}]}],"synonyms":["overprocess","grind too finely","over-refine"],"phonetic":"/ˌoʊvɚˈmɪl/","extraExplanation":["“mill”本义是“用磨坊磨碎/用机器加工”。加上 over-（过度）后，overmill 常用于讲“加工过头”的结果：比如面粉被磨得太细、布料在缩绒/整理工序中被处理过度等。","在食品语境里也可能看到形容词用法（更常写作 overmilled）：overmilled flour（过度精制/过度研磨的面粉）。"]}
{"word":"overmind","summary":{"en":"Overmind usually means a shared collective intelligence (especially in sci‑fi), and sometimes a higher level of consciousness in spiritual/philosophical writing.","zh":"overmind通常指（尤其在科幻中）共享的集体智能/意识；在某些灵性或哲学写作中也可指更高层次的意识。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A single, powerful intelligence shared by many individuals (often in science fiction), or a collective consciousness that controls or guides a group.","zh":"（常见于科幻作品）由许多个体共享的强大智能；或能控制/引导群体的“集体意识”。"},"examples":[{"en":"In the novel, the alien species communicates through an overmind that links every member.","zh":"在小说里，这个外星种族通过一个把每个成员连接起来的“集体意识”交流。"},{"en":"The robots formed an overmind, so they could think and react as one.","zh":"这些机器人形成了一个“共同心智”，因此能像一个整体那样思考和反应。"}]},{"partOfSpeech":"n.","definition":{"en":"In some spiritual and philosophical writing, a higher level of mind or consciousness beyond ordinary thinking (used in specific traditions).","zh":"在某些灵性或哲学著作中：超越日常思维的更高层次心智/意识（多用于特定思想体系）。"},"examples":[{"en":"The author describes the overmind as a stage between ordinary thought and deeper spiritual awareness.","zh":"作者把“更高心智”描述为介于普通思考与更深灵性觉知之间的阶段。"},{"en":"In that tradition, overmind is not just intelligence, but a wider kind of awareness.","zh":"在那个传统里，“更高心智”不只是聪明，而是一种更广阔的觉知。"}]}],"synonyms":["collective consciousness","group mind","hive mind","higher consciousness"],"phonetic":"ˈoʊvərˌmaɪnd","extraExplanation":["“overmind”在日常英语里不算常用词，最常见的语境是科幻：比如蜂群意识（hive mind）或群体共享的大脑。它常带有“统一指挥、个体被连接或被控制”的含义。","在一些哲学/灵性体系中（例如某些印度哲学与相关英文著作），Overmind可能作为专门术语使用，含义更偏“意识层级”，具体解释会随作者与传统而变。"]}
{"word":"overmine","summary":{"en":"Overmine is a rare verb meaning to mine or lay mines excessively.","zh":"Overmine 是一个较少用的动词，意思是“过度采矿”或“过度布雷”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mine too much in an area, taking more ore/coal/stone than is safe or sustainable (rare).","zh":"（较少用）过度采矿；在某地开采过多（可能不安全或不可持续）。"},"examples":[{"en":"If the company continues to overmine the seam, the roof may become unstable.","zh":"如果公司继续过度开采这条煤层，顶板可能会变得不稳定。"},{"en":"The report warns that overmining could damage local water supplies.","zh":"报告警告说，过度采矿可能会破坏当地的供水。"}]},{"partOfSpeech":"v.","definition":{"en":"to place too many mines (explosive devices) in an area; to mine an area excessively (rare).","zh":"（较少用）过度布雷；在某区域布置过多地雷。"},"examples":[{"en":"They were accused of overmining the border, putting civilians at risk.","zh":"他们被指责在边境过度布雷，使平民面临风险。"}]}],"synonyms":["mine too much","excessive mining","overextract","overexcavate","overwork a mine"],"phonetic":"/ˌoʊvɚˈmaɪn/","extraExplanation":["“Overmine”不是常见词，更多时候英语会用“mine too much / excessive mining（过度采矿）”，或在军事语境用“lay too many mines（布雷过多）”。","不要和“undermine（破坏；暗中削弱；在……下挖掘）”混淆：两者拼写相似，但“undermine”非常常用，“overmine”非常少见。"]}
{"word":"overminute","summary":{"en":"Overminute means being excessively focused on small details.","zh":"overminute 指“过分拘泥细节、过度精确/挑剔小处”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too concerned with small details; excessively precise or fussy about minor points.","zh":"过分拘泥细节的；过度精确、挑剔小处的。"},"examples":[{"en":"The editor’s overminute comments slowed the project down.","zh":"编辑过分拘泥细节的意见让项目进度变慢了。"},{"en":"Don’t be overminute about formatting—focus on the main ideas first.","zh":"别在格式上过度挑剔——先把主要观点做好。"},{"en":"His overminute description of the route confused everyone.","zh":"他对路线过于细致的描述把大家都讲糊涂了。"}]}],"synonyms":["overly detailed","too meticulous","nitpicky","fussy","pedantic"],"phonetic":"/ˌoʊvərmaɪˈnuːt/","extraExplanation":["“overminute”较偏书面、略显古风，现代英语更常用“overly detailed / too meticulous / nitpicky”等表达。","词源上由 over-（过度）+ minute（细微的）构成；这里的 minute 读作 /maɪˈnuːt/（“细微的”），不是表示“分钟”的 /ˈmɪnɪt/。"]}
{"word":"overminutely","summary":{"en":"“Overminutely” means “in excessive detail.”","zh":"“overminutely”表示“过于细致地、细节过多地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In too much detail; more precisely and carefully than is necessary.","zh":"过于细致地；细到不必要的程度。"},"examples":[{"en":"He explained the rules overminutely, and everyone got confused.","zh":"他把规则解释得过于细致，反而把大家弄糊涂了。"},{"en":"Don’t plan overminutely—leave room for changes.","zh":"别把计划订得过于细；要留出调整空间。"}]}],"synonyms":["too minutely","in too much detail","overly precisely","with excessive detail"],"phonetic":"ˌoʊvərmaɪˈnuːtli","extraExplanation":["“over-”表示“过度、超过需要”。“minutely”来自“minute（极小的）”，表示“细微地、详细地”。\n注意发音：minute（“分钟”）常读 /ˈmɪnɪt/；minute（“极小的、细微的”）相关的 minutely 常读成 /maɪˈnuːtli/。","这个词在现代英语中比较少见，更常用的说法是 “in too much detail” 或 “too minutely”。"]}
{"word":"overminuteness","summary":{"en":"Overminuteness means excessive focus on tiny details; being too meticulous or picky.","zh":"overminuteness 指对细枝末节过度关注，太过细致或挑剔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive attention to very small details; being overly precise or picky about minor points.","zh":"过分拘泥细节；对小事过度讲究、吹毛求疵。"},"examples":[{"en":"The report was delayed by his overminuteness about formatting.","zh":"他对格式过分挑剔，导致报告被耽搁了。"},{"en":"Overminuteness can distract you from the main goal.","zh":"过分拘泥细节会让你偏离主要目标。"},{"en":"Her overminuteness in planning made the trip stressful.","zh":"她在计划上过度细致，让旅行变得很有压力。"}]}],"synonyms":["nitpicking","overprecision","excessive meticulousness","pedantry","picky attention to detail"],"phonetic":"ˌoʊvərmaɪˈnuːtnəs","extraExplanation":["这是一个非常少见、偏“书面/造词式”的词：over-（过度）+ minuteness（细微、细致；也可指“微小程度”）。日常英语更常用 overly picky / too meticulous / nitpicking / excessive detail。","minuteness 里的 minute 在这里读作 /maɪˈnuːt/（“细微的”），不是表示“分钟”的 /ˈmɪnɪt/。因此 overminuteness 的重音也落在 -nuːt- 这一部分。","语气上常带轻微批评：强调“细节关注过头”，暗示效率下降或忽略重点。"]}
{"word":"overmitigate","summary":{"en":"Overmitigate means to mitigate a risk or problem too much, making the response excessive or counterproductive.","zh":"overmitigate 指“缓解风险/问题做得过头”，导致措施过度或适得其反。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to try to reduce a problem, risk, or harm too much (so the response becomes excessive, unnecessary, or causes new problems)","zh":"过度缓解；过度降低（问题、风险或危害），以至于处理方式显得过头、不必要，甚至带来新问题"},"examples":[{"en":"The company overmitigated the security risk by adding so many checks that employees couldn’t do their work efficiently.","zh":"公司为“缓解”安全风险做得过头，加了太多检查流程，结果员工反而无法高效工作。"},{"en":"If we overmitigate, we may spend money on controls that don’t match the real level of risk.","zh":"如果我们过度缓解风险，可能会把钱花在与实际风险不匹配的管控措施上。"}]},{"partOfSpeech":"v.","definition":{"en":"to overcorrect after a mistake by trying too hard to soften the effects","zh":"（在犯错后）矫枉过正地补救；为了减轻影响而补救过度"},"examples":[{"en":"After the negative review, the team overmitigated by apologizing repeatedly and changing features users didn’t mind.","zh":"收到负面评价后，团队补救过度：反复道歉，还改动了用户其实并不介意的功能。"}]}],"synonyms":["overcorrect","overcompensate","go too far","take excessive precautions"],"phonetic":"ˌoʊvərˈmɪtəˌɡeɪt","extraExplanation":["“overmitigate”在日常英语中不算常见，更多见于风险管理、合规、工程项目等语境。写作中如果担心不够自然，可以用更常见的表达：“go too far in mitigating… / overcorrect / take excessive precautions / overcompensate”。","词形上是“over-（过度）+ mitigate（缓解、减轻）”。mitigate常搭配risk, harm, impact, damage（缓解风险/伤害/影响/损害）。"]}
{"word":"overmitigated","summary":{"en":"Overmitigated means something has been mitigated too much, making the response excessive or counterproductive.","zh":"overmitigated 指“过度缓解/过度控制”，措施过头而变得不合适或适得其反。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Mitigated too much; reduced or softened so much that the original problem, risk, or effect is no longer treated appropriately (sometimes creating new problems).","zh":"过度缓解的；把问题、风险或影响“减轻/削弱”得太过头，以至于处理方式不再恰当（有时还会引发新问题）。"},"examples":[{"en":"The new policy is overmitigated—it makes the process so slow that people stop using it.","zh":"新政策属于过度缓解——流程被弄得太慢，导致人们干脆不用了。"},{"en":"By adding too many filters, the system became overmitigated and started blocking normal traffic.","zh":"加了太多过滤措施后，系统变得过度缓解，连正常流量都被拦截了。"},{"en":"The safety plan was overmitigated, costing more than the risk it was meant to reduce.","zh":"安全方案过度缓解，花费甚至超过了它本来要降低的风险损失。"}]}],"synonyms":["overcorrected","overcontrolled","excessively reduced","overcompensated"],"phonetic":"/ˌoʊvərˈmɪtəˌɡeɪtɪd/","extraExplanation":["“mitigate”常见于风险管理、工程、安全、环保、网络安全等语境，意思是“减轻/缓和（危害或风险）”。“over-”表示“过度”，所以 overmitigated 强调“措施上得太多、太重或太昂贵”，导致效率下降、成本飙升，或出现误伤（例如拦截正常行为）。","它并不是特别固定、常见的词，更常见的表达是“overly mitigated / over-mitigated”或直接说“we over-mitigated the risk（我们把风险控制过头了）”。"]}
{"word":"overmitigating","summary":{"en":"“Overmitigating” means using more mitigation than necessary—trying to reduce a risk or harm too much.","zh":"“overmitigating” 指「過度緩解／過度降低風險或傷害」，做了超出需要的減緩措施。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"doing more mitigation than is needed; reducing a risk, harm, or problem too much or in an excessive way (often wasting time, money, or effort).","zh":"過度緩解／過度降低（風險、傷害或問題）；做了超出需要的減緩措施（常導致浪費時間、金錢或精力）。"},"examples":[{"en":"We may be overmitigating the risk by adding three separate approval steps.","zh":"我們可能為了降低風險而過度緩解，因為加了三道不同的核准流程。"},{"en":"The team’s overmitigating approach slowed the project without improving safety.","zh":"團隊過度減緩的作法拖慢了專案，但並沒有提升安全性。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of overmitigate in progress; using excessive measures to reduce a risk or negative effect.","zh":"正在進行過度緩解；用過度的措施來降低風險或負面影響。"},"examples":[{"en":"They’re overmitigating by buying expensive insurance for a very unlikely event.","zh":"他們正在過度緩解：為了極不可能發生的事件買了昂貴的保險。"},{"en":"Stop overmitigating and focus on the biggest risk first.","zh":"別再過度緩解了，先把重點放在最大的風險上。"}]}],"synonyms":["overreacting","going overboard","overcompensating","excessive mitigation","overcorrecting"],"phonetic":"/ˌoʊvərˈmɪtɪˌɡeɪtɪŋ/","extraExplanation":["這個字在日常英語中不常見，較常出現在「風險管理、專案管理、資安、合規」等語境。更自然的說法有：“overreacting,” “going overboard,” “overcompensating,” 或 “doing excessive risk mitigation.”","構字很好理解：over-（過度）+ mitigate（緩解、減輕）+ -ing（現在分詞/動名詞）。在句子中可當形容詞（overmitigating approach）或動詞片語的一部分（be overmitigating）。"]}
{"word":"overmix","summary":{"en":"Overmix means mixing too much so the final texture or quality becomes worse.","zh":"overmix 指“搅拌过头”，导致最终质地或品质变差。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to mix something too much, so the result becomes worse (for example, dough becomes tough or a drink becomes overly foamy).","zh":"过度搅拌；搅拌过头（导致成品变差，例如面团变硬、饮品泡沫过多等）。"},"examples":[{"en":"Be careful not to overmix the pancake batter, or the pancakes will turn out tough.","zh":"小心别把煎饼面糊搅拌过头，否则煎饼会变得很硬。"},{"en":"I overmixed the smoothie, and it became too frothy.","zh":"我把奶昔打得太久，结果泡沫太多。"},{"en":"Once you add the flour, stir gently—overmixing can ruin the texture.","zh":"一加入面粉就轻轻搅拌——搅拌过度会破坏口感。"}]}],"synonyms":["mix too much","overbeat","overwork (dough)"],"phonetic":"/ˌoʊvɚˈmɪks/","extraExplanation":["在烘焙里，“overmix”最常见：加入面粉后搅拌太久会让面筋（gluten）形成过多，蛋糕/松饼/饼干会变得更紧实、偏硬、不松软。常见提示是“mix until just combined（拌到刚刚混合即可）”。"]}
{"word":"overmixed","summary":{"en":"Overmixed means mixed too much, usually making the result worse—especially in baking.","zh":"Overmixed 指“混合/搅拌过度”，常见于烘焙语境，通常会让成品变差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"mixed more than necessary, often causing the texture or quality to become worse (especially in cooking or baking).","zh":"搅拌/混合过度的（常见于烹饪或烘焙中），通常会让口感或品质变差。"},"examples":[{"en":"The cake turned out tough because the batter was overmixed.","zh":"这蛋糕口感发硬，是因为面糊搅拌过度了。"},{"en":"Try to stir just until combined so the muffin batter doesn’t get overmixed.","zh":"尽量搅拌到刚刚混合即可，别把松饼面糊搅拌过度。"}]}],"synonyms":["mixed too much","overstirred","overbeaten"],"phonetic":"/ˌoʊvərˈmɪkst/","extraExplanation":["在烘焙里，overmixed 常与面糊/面团有关：搅拌太久会让面粉中的面筋发展过多，成品更“韧/硬”，不够松软（比如蛋糕、玛芬、煎饼）。很多食谱会写 “mix until just combined（拌到刚刚看不见干粉）” 来避免 overmixed。"]}
{"word":"overmixes","summary":{"en":"“Overmixes” means mixes too much, usually making the result worse (especially in baking).","zh":"“Overmixes”表示“搅拌/混合过度”，通常会让成品变差（尤其常见于烘焙）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular present of “overmix”: to mix something too much, so the texture or quality becomes worse (often used in cooking/baking).","zh":"“overmix”的第三人称单数：把某物搅拌/混合过度，导致口感或品质变差（常用于烹饪、烘焙）。"},"examples":[{"en":"If she overmixes the muffin batter, the muffins can turn dense and tough.","zh":"如果她把松饼面糊搅拌过度，松饼可能会变得扎实又偏硬。"},{"en":"He overmixes the cake batter every time, so the crumb isn’t as light.","zh":"他每次都把蛋糕糊搅拌过度，所以组织不够松软。"}]},{"partOfSpeech":"v.","definition":{"en":"to mix too much in general (not only food), causing the result to lose its intended character.","zh":"泛指过度混合，导致结果失去原本应有的效果或特点（不只用于食物）。"},"examples":[{"en":"The DJ overmixes the tracks, and the transitions sound messy.","zh":"DJ把曲目混得太过头，过渡听起来就很乱。"},{"en":"When the program overmixes colors, the image can look unnatural.","zh":"当程序把颜色混合过度时，图像可能看起来不自然。"}]}],"synonyms":["mix too much","overbeat","overwork (dough/batter)"],"phonetic":"/ˌoʊvərˈmɪksɪz/","extraExplanation":["在烘焙语境里，overmix 常见原因是把面糊搅到“完全光滑”才停；但像松饼、司康、煎饼这类“快速面糊（quick batter）”，通常只需要搅到“刚刚混合均匀（just combined）”。过度搅拌会让面粉里的面筋发展过多，口感容易变韧、变紧实。","词形提示：overmix + -es → overmixes（第三人称单数）；过去式/过去分词常见为 overmixed。"]}
{"word":"overmixing","summary":{"en":"Overmixing means mixing something too much, especially in baking, which often harms the final texture.","zh":"Overmixing 指搅拌过度（尤指烘焙），通常会让成品口感变差。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of mixing something too much (especially food batter or dough), often causing a worse texture or result","zh":"（尤指搅拌面糊或面团）搅拌过度的过程或行为，常导致口感或效果变差"},"examples":[{"en":"Overmixing pancake batter can make the pancakes tough instead of fluffy.","zh":"煎饼面糊搅拌过度会让煎饼变硬，不再松软。"},{"en":"To avoid overmixing, stop as soon as the flour disappears.","zh":"为了避免搅拌过度，看到面粉刚刚拌匀不见就可以停。"},{"en":"Overmixing is a common mistake for new bakers.","zh":"搅拌过度是新手烘焙常见的错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"mixing too much; describing an action that goes beyond what is needed","zh":"搅拌过度的；形容搅拌的动作超过需要"},"examples":[{"en":"Try not to do any overmixing when you fold in the egg whites.","zh":"拌入蛋白时尽量不要过度搅拌。"},{"en":"An overmixing habit can ruin delicate cakes.","zh":"习惯性过度搅拌会毁掉细腻的蛋糕口感。"}]}],"synonyms":["mixing too much","overbeating","overworking (dough)"],"phonetic":"/ˌoʊvɚˈmɪksɪŋ/","extraExplanation":["在烘焙里，“overmixing”常与面筋有关：面粉遇水并被搅拌时会形成面筋网络；搅拌越多，面筋越强，成品可能更韧、更硬（例如蛋糕、松饼、玛芬不够松软）。不过面包有时需要更充分的搅拌/揉面来建立结构，所以是否算“过度”取决于食谱目标。","常见搭配：avoid overmixing（避免过度搅拌）、overmixing the batter/dough（面糊/面团搅拌过度）、overmixing leads to…（过度搅拌会导致……）。在日常写作中也可能比喻用于工作流程：overmixing ideas/data（把想法/数据“搅”得过头，反而更混乱）。"]}
{"word":"overmobilize","summary":{"en":"Overmobilize means to mobilize more people or resources than necessary, often leading to inefficiency or backlash.","zh":"overmobilize 指“过度动员”，即动员的人力或资源超过需要，常引发低效或反效果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mobilize too many people/resources, or to mobilize more than is necessary (often causing waste, confusion, or political backlash)","zh":"过度动员；动员过多的人力/资源，超过需要（常导致浪费、混乱或反效果）"},"examples":[{"en":"The campaign overmobilized volunteers, and many ended up with nothing meaningful to do.","zh":"这次活动过度动员了志愿者，结果很多人最后没有真正有意义的工作可做。"},{"en":"If you overmobilize the public, people may get tired and stop paying attention.","zh":"如果你过度动员公众，人们可能会产生疲劳，反而不再关注。"}]},{"partOfSpeech":"v.","definition":{"en":"(military/government) to call up or deploy more forces than required for a mission or situation","zh":"（军事/政府）超额征召或部署兵力；投入超过任务所需的力量"},"examples":[{"en":"Commanders worried they had overmobilized for a minor border incident.","zh":"指挥官担心他们为了一次小规模边境事件而超额动员了。"}]}],"synonyms":["overdeploy","overcommit","overstaff","overextend","overprepare"],"phonetic":"/ˌoʊvərˈmoʊbəˌlaɪz/","extraExplanation":["“over-”是常见前缀，表示“过度、超过需要”。因此 overmobilize 直译就是“动员过头”。它多见于政治、社会运动、组织管理或军事语境，带有“用力过猛/资源配置不当”的评价色彩。","写作中常与后果搭配：overmobilize resources（资源过度投入）、overmobilize voters（选民被过度动员/疲劳）、overmobilize troops（兵力过度动员）。"]}
{"word":"overmobilized","summary":{"en":"Overmobilized means “mobilized too much,” often suggesting unnecessary or excessive deployment of people or resources.","zh":"overmobilized 指“动员过度”，常带有“不必要、过多投入人力或资源”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Mobilized (organized, prepared, or called into action) more than is necessary or appropriate; brought into action to an excessive degree.","zh":"动员过度的；（组织、准备或投入行动）超过必要或合适程度的。"},"examples":[{"en":"Some critics argued the police response was overmobilized for a peaceful protest.","zh":"一些批评者认为，警方对一场和平抗议的反应动员过度。"},{"en":"The company’s crisis team was overmobilized, creating confusion instead of clarity.","zh":"公司的危机小组动员过度，反而造成混乱而不是清晰的指挥。"}]},{"partOfSpeech":"adj.","definition":{"en":"In a military or emergency context, having too many troops, resources, or units called up or deployed compared with what the situation requires.","zh":"（军事或应急语境）征召或部署的兵力/资源过多，超过形势所需。"},"examples":[{"en":"By the second week, the operation looked overmobilized and expensive.","zh":"到第二周，这次行动看起来兵力部署过多而且成本高昂。"},{"en":"An overmobilized force can strain supply lines and slow decision-making.","zh":"过度动员的部队会拉紧补给线，并拖慢决策。"}]}],"synonyms":["overly mobilized","excessively mobilized","overcommitted","overdeployed","overstaffed"],"phonetic":"/ˌoʊvɚˈmoʊbəˌlaɪzd/","extraExplanation":["“over-”这个前缀表示“过度、超过正常/需要的程度”（如 overwork 过度工作，overreact 反应过度）。因此 overmobilized 通常带有批评意味：不是单纯“动员了”，而是“动员得太多”。","这是一个相对少见、偏正式的词，更常见的表达有 “overly mobilized / excessively mobilized” 或用更具体的词，如 “overstaffed（人手过多）”、“overdeployed（部署过多）”。"]}
{"word":"overmobilizing","summary":{"en":"Overmobilizing means mobilizing resources or people excessively, beyond what is needed.","zh":"overmobilizing 指过度动员或过度调动人力与资源，超出实际所需。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund) mobilizing people, money, or resources too much or too quickly, especially in a way that is unnecessary or causes problems","zh":"（现在分词/动名词）过度动员；把人力、资金或资源调动得过多或过快，尤其指不必要或带来负面后果"},"examples":[{"en":"The government was criticized for overmobilizing the military during the protest.","zh":"政府因在抗议期间过度动员军队而受到批评。"},{"en":"Overmobilizing volunteers can lead to burnout and confusion.","zh":"过度动员志愿者可能导致倦怠和混乱。"},{"en":"The company may be overmobilizing resources for a minor product update.","zh":"这家公司可能为一次小型产品更新过度调动资源。"}]}],"synonyms":["over-activating","over-deploying","overcommitting","overextending"],"phonetic":"/ˌoʊvərˈmoʊbəˌlaɪzɪŋ/","extraExplanation":["“over-”表示“过度、过多”。“overmobilizing”是动词“overmobilize”的现在分词形式，常用于描述管理、公共政策或组织行动中“投入超过实际需要”的情况。","常见搭配：overmobilize troops/resources/forces；也可用于抽象对象，如 overmobilize public opinion（过度动员舆论）。"]}
{"word":"overmoccasin","summary":{"en":"An overmoccasin is a soft protective overshoe worn over a moccasin or other shoe to keep feet warm or dry.","zh":"overmoccasin 指套在鹿皮鞋或其他鞋外面的柔软外套鞋，用于保暖或防潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft overshoe or protective outer shoe (often leather or waterproof fabric) worn over a moccasin or other footwear, especially for warmth or to keep feet dry","zh":"（常为皮革或防水布制的）外套鞋／防护外鞋，套在鹿皮鞋（moccasin）或其他鞋外面，用于保暖或防潮"},"examples":[{"en":"He pulled on overmoccasins before stepping into the wet snow.","zh":"他在走进湿雪前先套上外套鞋。"},{"en":"The guide wore moccasins indoors and overmoccasins outside.","zh":"向导在室内穿鹿皮鞋，出门时再套外套鞋。"}]}],"synonyms":["overshoe","overboot","galosh"],"phonetic":"ˌoʊvərˈmɑkəsɪn","extraExplanation":["这个词由 over-（“在……之上/外面”）+ moccasin（鹿皮鞋）构成，强调“套在外面”的功能。","在北美寒冷地区或野外活动语境中更常见，有时也会指类似“套鞋/外穿软靴”的装备，用来防雪、防水、保温。"]}
{"word":"overmodernization","summary":{"en":"Overmodernization means modernizing too much, causing a loss of original character or historical/cultural value.","zh":"overmodernization 指“过度现代化”，即现代化过头，导致原有特色或历史文化价值受损。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of modernizing something too much, or in a way that removes its original character, traditions, or historical value.","zh":"过度现代化；把某事物现代化得太过头，以致损害其原有特色、传统或历史价值。"},"examples":[{"en":"Many residents worry that overmodernization will destroy the old neighborhood’s charm.","zh":"许多居民担心过度现代化会毁掉老街区的魅力。"},{"en":"The museum faced criticism for overmodernization because the new design hid important historical details.","zh":"这家博物馆因过度现代化而受到批评，因为新设计遮蔽了重要的历史细节。"},{"en":"The debate is about how to improve living standards without overmodernization.","zh":"争论的焦点是如何在不造成过度现代化的情况下改善生活水平。"}]}],"synonyms":["excessive modernization","overdevelopment","over-renovation","overcommercialization"],"phonetic":"/ˌoʊvərˌmɑdərnəˈzeɪʃən/","extraExplanation":["这个词由 over-（过度）+ modernization（现代化）构成，常见于城市规划、建筑保护、文化遗产与旅游开发等语境，带有负面评价，强调“更新”超过了合理限度。","在讨论历史街区、古建筑、传统节庆或地方文化时，人们常用 overmodernization 来表达对“千城一面”“失去地方特色”的担忧。","可对比：modernization（中性/积极：现代化） vs. overmodernization（负面：过度现代化）；也常与 preservation（保护）和 gentrification（绅士化/高档化改造）一起出现。"]}
{"word":"overmodernize","summary":{"en":"To modernize something too much, often harming its original character or adding unnecessary changes.","zh":"把某物过度现代化，常导致失去原有特色或出现不必要的改动。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To update something so much that it loses its original style, character, or suitability (often seen as a negative or critical idea).","zh":"把某物“过度现代化”，以至于失去原本的风格、特色或适用性（常带批评意味）。"},"examples":[{"en":"Some residents worry the historic neighborhood will be overmodernized and lose its charm.","zh":"一些居民担心这片历史街区会被过度现代化，失去原有的魅力。"},{"en":"The remake overmodernized the story, and it no longer felt true to the original setting.","zh":"这次翻拍把故事过度现代化，结果不再像原作的时代背景那样真实。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something more modern than necessary, adding new features or designs that are not needed.","zh":"把某物现代化得“超过必要程度”，加入不需要的新设计或功能。"},"examples":[{"en":"We don’t need to overmodernize the app—most users just want it to be stable and simple.","zh":"我们不需要把这个应用过度现代化——大多数用户只希望它稳定、简单。"},{"en":"They overmodernized the office with expensive gadgets that nobody uses.","zh":"他们用一堆没人用的昂贵小设备把办公室过度现代化了。"}]}],"synonyms":["overupdate","modernize excessively","make too modern","overdevelop","overengineer"],"phonetic":"/ˌoʊvərˈmɑdərˌnaɪz/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”（如: overcook 煮过头、overreact 反应过度）。因此 overmodernize 往往隐含“现代化做得太过了”的评价。","这个词常用于讨论历史建筑保护、城市更新、影视改编、产品设计等场景：批评为了“看起来更新”而牺牲传统、氛围或实际需求。"]}
{"word":"overmodernized","summary":{"en":"“Overmodernized” means made too modern, often at the cost of the original character or natural feel.","zh":"“overmodernized”指被改得过于现代化，常以牺牲原本风格、历史感或自然表达为代价。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changed or updated too much to be modern, often harming the original character, style, or quality.","zh":"过度现代化的；把事物改得太“现代”，常常损害原有风格、特色或品质。"},"examples":[{"en":"Many residents feel the old neighborhood has been overmodernized and lost its charm.","zh":"许多居民觉得这个老街区被过度现代化，失去了原本的韵味。"},{"en":"The museum display looks overmodernized—too many screens and not enough real artifacts.","zh":"这个博物馆展陈看起来过度现代化——屏幕太多，实物展品太少。"},{"en":"Some fans worry the remake is overmodernized for today’s audience.","zh":"一些粉丝担心这部重制作品为了迎合当下观众而过度现代化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something presented in an overly “up-to-date” way, sometimes sounding forced, trendy, or unnatural.","zh":"（表达或呈现方式）过分“跟潮流/很当代”，显得刻意、追潮或不自然。"},"examples":[{"en":"The dialogue feels overmodernized for a story set in the 1800s.","zh":"这段对白对一部设定在19世纪的故事来说显得过度现代化。"},{"en":"His translation is accurate, but it can sound overmodernized and casual.","zh":"他的翻译很准确，但有时听起来过度现代化、过于随意。"}]}],"synonyms":["over-modernized","too modernized","over-updated","modernized too much","overhauled"],"phonetic":"/ˌoʊvɚˈmɑdɚˌnaɪzd/","extraExplanation":["“overmodernized”= over-（过度）+ modernize（使现代化）。常用于谈论建筑保护、城市更新、博物馆展陈、影视改编或翻译：强调“更新过头”，导致历史感、地域特色或原作风格被削弱。","语气通常带批评或惋惜：不是反对现代化本身，而是反对“为了现代而现代”。"]}
{"word":"overmodernizing","summary":{"en":"Overmodernizing means updating something too much, so it becomes overly modern and may lose its original character.","zh":"overmodernizing 指把某物更新得太过分、过于现代化，可能因此失去原有特色。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something too modern or updating it in an excessive way, often causing it to lose its original character or usefulness","zh":"把某物“过度现代化”；更新得太过分，常导致失去原有特色或实用性"},"examples":[{"en":"Some residents worry the city is overmodernizing the historic neighborhood.","zh":"一些居民担心这座城市正在把这片历史街区过度现代化。"},{"en":"By overmodernizing the design, the brand lost the classic look that customers loved.","zh":"由于把设计过度现代化，这个品牌失去了顾客喜爱的经典风格。"}]}],"synonyms":["overmodernize","modernize too much","overupdate","over-renovate","gentrify (sometimes, context-dependent)"],"phonetic":"/ˌoʊvɚˈmɑdɚnaɪzɪŋ/","extraExplanation":["“overmodernizing”是动词“overmodernize”的现在分词/动名词形式，常用于批评语境，尤其谈到历史建筑、传统文化、老品牌改版等。","常见搭配：overmodernizing a building / a city / a tradition / a brand image（对建筑/城市/传统/品牌形象过度现代化）。"]}
{"word":"overmodest","summary":{"en":"Overmodest means being too modest—downplaying your abilities or achievements more than is reasonable.","zh":"Overmodest 指“过分谦虚”，把自己的能力或成就贬低得超过合理程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too modest; not willing to accept or show your abilities or achievements as much as is reasonable","zh":"过分谦虚的；对自己的能力或成就不愿承认或表现得过头"},"examples":[{"en":"Don’t be overmodest—you did most of the work on this project.","zh":"别太过分谦虚——这个项目大部分工作都是你做的。"},{"en":"She gave an overmodest answer when people praised her performance.","zh":"别人夸她表现好时，她给出了过分谦虚的回应。"},{"en":"His overmodest attitude sometimes makes it hard for him to ask for a promotion.","zh":"他过分谦虚的态度有时让他很难开口争取升职。"}]}],"synonyms":["too modest","self-effacing","overly humble"],"phonetic":"/ˌoʊvɚˈmɑdɪst/","extraExplanation":["“over-”表示“过度/太……”，因此 overmodest 带有“谦虚到不合适”的评价色彩，常用于善意提醒：你可以更自信、更大方地承认自己的贡献。","在英语语境中，适度谦虚是优点，但“过分谦虚”有时会被理解为不够自信、低估自己，甚至让他人难以正确评价你的能力。"]}
{"word":"overmodestly","summary":{"en":"“Overmodestly” means “too modestly,” especially when someone downplays their achievements more than is appropriate.","zh":"overmodestly 指“过于谦虚地”，尤其是把自己的成绩说得过轻、超过应有程度。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too modest; downplaying your own abilities, achievements, or value more than is appropriate.","zh":"过于谦虚地；把自己的能力、成就或价值贬低得超过应有程度地。"},"examples":[{"en":"She spoke overmodestly about her award, calling it “just luck.”","zh":"她谈到自己的奖项时过于谦虚，说那“只是运气”。"},{"en":"Don’t describe your work overmodestly in the interview—be honest about what you accomplished.","zh":"面试时别把自己的工作说得过于谦虚——诚实地讲清你做成了什么。"}]}],"synonyms":["too modestly","self-effacingly","undervaluingly","over-humbly"],"phonetic":"/ˌoʊvərˈmɑdəstli/","extraExplanation":["“over-”在英语里常表示“过度、过分”。因此 overmodestly 带有一种提醒意味：谦虚本身是优点，但“过度谦虚”可能让别人误解你的能力，或显得不够自信。","在英语职场/学术语境中，适度表达成果（例如用事实和数据支撑）通常被认为是专业，而不是自夸；overmodestly 常用于建议对方不要把成绩说得太轻。"]}
{"word":"overmodesty","summary":{"en":"Overmodesty means being too modest and downplaying yourself more than you should.","zh":"overmodesty 指“过度谦虚”，把自己说得比实际更差或更不重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive modesty; the habit of downplaying your abilities or achievements more than is appropriate.","zh":"过度谦虚；把自己的能力或成就贬低得超出适当程度的习惯。"},"examples":[{"en":"Her overmodesty kept her from applying for the promotion, even though she was clearly qualified.","zh":"她的过度谦虚让她没有申请升职，尽管她显然符合条件。"},{"en":"A little humility is good, but overmodesty can make others underestimate you.","zh":"适度的谦逊是好事，但过度谦虚会让别人低估你。"},{"en":"He spoke about the award with overmodesty, calling it “no big deal.”","zh":"他谈到这个奖项时显得过度谦虚，说“没什么大不了的”。"}]}],"synonyms":["excessive modesty","self-deprecation","underselling oneself","false modesty"],"phonetic":"/ˌoʊvərˈmɑdəsti/","extraExplanation":["“overmodesty”通常带有轻微的负面评价：强调“谦虚过头”可能会影响机会、让人误解你的真实水平。","在跨文化沟通中，有些场合（如面试、绩效评估、申请项目）更需要清楚地陈述贡献；过度谦虚可能被解读为缺乏信心或能力。","近义表达常用“self-deprecation（自我贬低）”“underselling yourself（低估/卖低自己）”。其中self-deprecation更强调用贬低自己的方式说话或开玩笑。"]}
{"word":"overmodification","summary":{"en":"Overmodification means adding too many modifiers, making writing or speech wordy, confusing, or awkward.","zh":"overmodification 指修饰语添加过多，使表达变得啰嗦、混乱或别扭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or habit of modifying something too much (especially writing or speech), so it becomes wordy, unclear, awkward, or harder to understand.","zh":"过度修饰；（尤指写作或表达中）修饰太多，导致啰嗦、不清楚、别扭或更难理解。"},"examples":[{"en":"The sentence suffered from overmodification—too many adjectives made the main idea hard to find.","zh":"这句话有过度修饰——形容词太多，让主旨变得难以抓住。"},{"en":"Try to avoid overmodification by cutting extra clauses that don’t add meaning.","zh":"尽量通过删掉不增加信息的从句来避免过度修饰。"}]},{"partOfSpeech":"n.","definition":{"en":"In grammar, adding too many modifiers (adjectives, adverbs, or long modifying phrases/clauses) to a noun or verb, often creating confusion about what modifies what.","zh":"在语法中，给名词或动词加上过多的修饰语（形容词、副词或很长的修饰短语/从句），常常导致修饰关系不清。"},"examples":[{"en":"Overmodification can cause ambiguity, like when several phrases could describe different nouns in the same sentence.","zh":"过度修饰会造成歧义，比如同一句里多个短语可能分别修饰不同的名词。"},{"en":"Teachers often mark overmodification when students stack multiple prepositional phrases in a row.","zh":"老师常会在学生连续堆叠多个介词短语时指出这是过度修饰。"}]}],"synonyms":["excessive modification","wordiness","overwriting","over-qualification"],"phonetic":"/ˌoʊvɚˌmɑdɪfɪˈkeɪʃən/","extraExplanation":["“Over-”表示“过度、太多”，和“modification（修饰/改动）”组合成“overmodification”。在写作中，它常见于：形容词堆叠、不断加插入语、或用很长的定语从句/介词短语把中心名词“隔得很远”。","常见改法：先确定句子的“核心信息”（主语+动词+关键宾语/补语），再保留真正必要的修饰语；把次要细节改成独立句，或用更精准的一个词替代一串修饰。"]}
{"word":"overmodified","summary":{"en":"Overmodified means ‘modified too much,’ especially with too many descriptive or grammatical modifiers, making something wordy or unclear.","zh":"overmodified 指“过度修饰/过度修改”，尤其是修饰语太多导致表达冗长或不清楚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Modified too much; changed or qualified with too many additions, details, or adjustments, often making something unclear, unnatural, or less effective.","zh":"被过度修饰的；修改/限定得太多，常导致不清楚、不自然或效果变差。"},"examples":[{"en":"The sentence felt overmodified, with too many adjectives before the noun.","zh":"这个句子显得过度修饰，在名词前堆了太多形容词。"},{"en":"After so many revisions, the design became overmodified and harder to use.","zh":"经过太多次改动后，这个设计变得过度修改，反而更难用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Describes a word or phrase that has more modifiers than needed (for example, an overmodified noun phrase), which can reduce readability or sound unnatural.","zh":"（语言学）指一个词或短语带了超出需要的修饰语（如“过度修饰的名词短语”），从而降低可读性或显得不自然。"},"examples":[{"en":"Teachers often suggest simplifying overmodified noun phrases in academic writing.","zh":"老师常建议在学术写作中简化过度修饰的名词短语。"},{"en":"In English, an overmodified phrase can confuse the reader about what the main idea is.","zh":"在英语里，过度修饰的短语会让读者搞不清主旨是什么。"}]}],"synonyms":["overedited","overworked","overcomplicated","overwritten","too wordy"],"phonetic":"/ˌoʊvɚˈmɑdɪˌfaɪd/","extraExplanation":["“over-”表示“过度/太多”，与“overwritten（写得太花、太啰嗦）”“overcomplicated（过于复杂）”类似。","写作中常见的“overmodified”问题：在名词前堆叠过多形容词、插入太多从句或介词短语，导致句子主干被淹没。一个简单的改法是：保留最关键的1–2个修饰语，把其他信息拆分成新句或改成更直接的表达。"]}
{"word":"overmodifies","summary":{"en":"“Overmodifies” means adds too many modifiers or changes something too much, making it less clear or less effective.","zh":"“overmodifies”表示“过度修饰”或“改动过头”，让表达不清晰或效果变差。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(In writing/grammar) to add too many modifiers (adjectives, adverbs, phrases, clauses) so the sentence becomes wordy, unclear, or awkward.","zh":"（写作/语法）过度修饰；加了太多形容词、副词或修饰语，导致句子冗长、不清晰或别扭。"},"examples":[{"en":"This sentence overmodifies the noun with three long phrases, so the main idea gets lost.","zh":"这个句子用三个很长的短语过度修饰名词，导致主旨被淹没了。"},{"en":"If your introduction overmodifies every claim, readers may feel tired before you reach the point.","zh":"如果你的引言把每个观点都过度修饰，读者可能还没到重点就觉得累了。"},{"en":"The editor said the description overmodifies and asked for simpler wording.","zh":"编辑说这段描写过度修饰，建议用更简洁的措辞。"}]},{"partOfSpeech":"v.","definition":{"en":"To change or adjust something too much, beyond what is helpful or necessary.","zh":"过度改动；调整过头，超过有帮助或必要的程度。"},"examples":[{"en":"He overmodifies the design after every meeting, and the project never feels finished.","zh":"他每次开完会都把设计过度改动，项目就一直像做不完。"},{"en":"Try not to overmodify your workout plan—small changes are easier to keep.","zh":"尽量别把训练计划改得太多——小调整更容易坚持。"}]}],"synonyms":["overdescribe","overqualify","overedit","overwrite","overcomplicate"],"phonetic":"/ˌoʊvərˈmɑdəˌfaɪz/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、太多”。因此 overmodifies = modifies too much。","在写作里，常见问题是用很多形容词/副词、或堆叠多个介词短语与从句，让读者难以抓住“主语做了什么”。更好的做法是保留最必要、最有信息量的修饰语。","相关写作建议术语：wordy（啰嗦的）、cluttered（堆砌的）、overwritten（过度写作的）、purple prose（辞藻过艳的华丽文风）。"]}
{"word":"overmodify","summary":{"en":"“Overmodify” means to modify something too much, often making it worse or less suitable.","zh":"“overmodify”指对某事物修改过度，常导致效果变差或不再合适。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change, edit, or adjust something too much, so it becomes worse, less effective, or no longer fits the original purpose","zh":"对某事物修改、调整过度，导致效果变差、失去原本用途或不再合适"},"examples":[{"en":"If you overmodify the essay, your main argument may become unclear.","zh":"如果你把文章改得太过头，中心论点可能会变得不清楚。"},{"en":"We tried to improve the design, but we overmodified it and broke a feature that worked fine.","zh":"我们本想改进这个设计，但改过头了，把原本好用的功能弄坏了。"},{"en":"Don’t overmodify the recipe—small changes are usually enough.","zh":"别把食谱改得太夸张——小改动通常就够了。"}]}],"synonyms":["overedit","over-adjust","overwork","tinker with too much"],"phonetic":"/ˌoʊvərˈmɑːdəˌfaɪ/","extraExplanation":["“overmodify”不是非常常见的单词，更常见的表达是“modify too much / over-edit / over-adjust”。在正式写作中，有时也会写作带连字符的“over-modify”（尤其是强调这是一个临时组合的动词时）。","这个词常用于写作、设计、软件配置、实验步骤等场景，语气通常带有“好心办坏事/过度优化”的提醒。"]}
{"word":"overmodifying","summary":{"en":"Overmodifying means using too many modifiers so the message becomes wordy or unclear.","zh":"Overmodifying 指修饰语用得过多，导致表达啰嗦或不清晰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add too many modifiers (adjectives, adverbs, extra phrases) so the sentence becomes wordy, unclear, or awkward","zh":"（在写作或表达中）加入过多修饰语（形容词、副词或附加短语），导致句子啰嗦、不清楚或别扭"},"examples":[{"en":"The report became hard to follow because we kept overmodifying every sentence with extra details.","zh":"这份报告之所以难读，是因为我们不断用额外细节去过度修饰每一句话。"},{"en":"Try not to overmodify your topic sentence—make the main point clear first.","zh":"主题句尽量别过度修饰——先把核心观点说清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of adding too many modifiers, especially in writing or speech","zh":"（尤指写作或口语中的）过度修饰的行为或习惯"},"examples":[{"en":"Overmodifying can hide your main idea and weaken your argument.","zh":"过度修饰会掩盖你的主旨，削弱论证力度。"},{"en":"Her teacher marked several cases of overmodifying in the essay.","zh":"老师在文章里标出了好几处过度修饰的问题。"}]}],"synonyms":["overwriting","being wordy","excessive modification","over-description","cluttering (a sentence)"],"phonetic":"/ˌoʊvərˈmɑdəˌfaɪɪŋ/","extraExplanation":["“Overmodifying”常见于写作反馈（比如作文批改、编辑意见）。它通常指：修饰语堆得太多，读者需要“穿过”很多形容词、插入语、从句，才能找到句子的主干。","一个实用判断法：先写出主语+谓语+宾语（或补语）的“骨架”，再只保留那些真正改变意思、提供必要信息的修饰语。","相关表达：overwriting（写得太花、太满）、wordy（啰嗦）、cluttered（信息杂乱）、laden with adjectives（形容词堆砌）。"]}
{"word":"overmodulation","summary":{"en":"Overmodulation means using too much modulation, which distorts a signal.","zh":"Overmodulation 指调制过强，导致信号失真。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In radio, audio, or telecommunications) modulation that is too strong, causing the signal to distort and produce unwanted extra frequencies or noise.","zh":"（无线电、音频或通信中）调制度过大，导致信号失真，并产生不需要的杂散频率或噪声。"},"examples":[{"en":"The broadcast sounded fuzzy because of overmodulation.","zh":"这段广播听起来发糊，是因为过度调制造成的。"},{"en":"Engineers reduced the input level to prevent overmodulation in the transmitter.","zh":"工程师降低了输入电平，以避免发射机过度调制。"},{"en":"Overmodulation can make speech hard to understand even if the signal is strong.","zh":"即使信号很强，过度调制也会让语音变得难以听清。"}]}],"synonyms":["excessive modulation","overdriving","signal distortion"],"phonetic":"/ˌoʊvɚˌmɑːdʒəˈleɪʃən/","extraExplanation":["“Modulation（调制）”指把信息（如声音）加载到载波信号上；“over-”表示“过度”。过度调制常见于把麦克风增益/输入电平开得太大，或发射机设定不当。","在不同系统里表现略有差异：AM 广播中过度调制会带来明显失真与“溅射”（对邻近频道的干扰）；在一般音频处理中，也常被听感描述为“糊”“炸”“刺”。"]}
{"word":"overmoist","summary":{"en":"“Overmoist” means “too moist”—having more moisture than is ideal, often causing problems.","zh":"“Overmoist”指“过于潮湿/太湿”，表示水分超标，常暗示会带来不良结果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too moist; having more moisture than is desirable or comfortable","zh":"过于潮湿的；湿度超过理想或舒适程度的"},"examples":[{"en":"The cake turned out overmoist and sank in the middle.","zh":"这个蛋糕太湿了，中间塌下去了。"},{"en":"If the soil is overmoist, the roots may start to rot.","zh":"如果土壤过湿，根部可能会开始腐烂。"}]}],"synonyms":["too moist","overly moist","soggy","damp","waterlogged"],"phonetic":"/ˌoʊvərˈmɔɪst/","extraExplanation":["“Overmoist”在日常英语里不算常见，更常见的写法是“over-moist”，或直接用“too moist / overly moist / soggy / waterlogged（更口语/更形象）”。","使用场景多见于烘焙、园艺、材料/包装说明等语境，用来强调“水分超标”带来的问题（塌陷、发霉、腐烂、手感黏湿等）。"]}
{"word":"overmoisten","summary":{"en":"Overmoisten means to make something too wet by adding too much moisture.","zh":"overmoisten 指“把东西弄得过湿”，即加了过多水分。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something too wet; to add more moisture than is good or necessary","zh":"把……弄得过湿；加水（或湿气）过多，超过合适或需要的程度"},"examples":[{"en":"Don’t overmoisten the soil—roots can rot if it stays soggy.","zh":"别把土壤浇得过湿——如果一直湿烂，根会腐烂。"},{"en":"I overmoistened the cake, so it turned dense instead of fluffy.","zh":"我把蛋糕弄得太湿了，所以变得扎实而不松软。"}]}],"synonyms":["make too wet","overwater","soak too much","dampen too much"],"phonetic":"/ˌoʊvərˈmɔɪsən/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过适当范围”（如 overcook 煮过头、overwork 过度劳累）。因此 overmoisten 通常带有“本来想让它湿润，但做过头了”的含义。","这个词在日常口语中不算特别常见，更常见的说法有 make it too wet / add too much water / soak (something) too much；但在园艺、烘焙、护理等场景里会更贴切。"]}
{"word":"overmoisture","summary":{"en":"Overmoisture means an excessive amount of moisture that often causes problems.","zh":"overmoisture 指“水分/湿气过多”，通常暗示会带来不良影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Too much moisture (water) in something, especially when it causes a problem (for example in soil, crops, buildings, or products).","zh":"水分过多；过度潮湿（常指在土壤、作物、建筑或产品中造成问题的“湿度过高”）。"},"examples":[{"en":"Overmoisture in the soil can rot seeds and young roots.","zh":"土壤水分过多会让种子和幼根腐烂。"},{"en":"The inspector found overmoisture in the walls, which may lead to mold.","zh":"检查员发现墙体过度潮湿，可能会导致发霉。"},{"en":"To prevent spoilage, the grain must be dried to avoid overmoisture during storage.","zh":"为防止变质，谷物储存前必须烘干，避免水分过多。"}]}],"synonyms":["excess moisture","too much moisture","excessive moisture","high moisture content"],"phonetic":"/ˌoʊvɚˈmɔɪstʃɚ/","extraExplanation":["“overmoisture”比较偏技术/行业用语，常见于农业（如土壤含水量、作物烂根）、仓储（粮食含水率过高易霉变）、建筑检测（墙体/地板含水率过高导致霉菌）等语境。日常口语里更常说“too much moisture / excessive moisture / high humidity”。","构词上是 over-（过度）+ moisture（湿气/水分）。写作时常与“damage, mold, rot, spoilage, risk, level, content”等词搭配。"]}
{"word":"overmonopolize","summary":{"en":"Overmonopolize means to monopolize something excessively—taking more control than is fair or healthy.","zh":"overmonopolize 指“过度垄断/过度控制”，强调独占程度超过合理或健康的范围。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to control or dominate something too much, leaving little or no opportunity for others to participate or benefit","zh":"过度垄断；过度控制（使他人几乎没有参与或受益的机会）"},"examples":[{"en":"A few large companies are accused of overmonopolizing the market and squeezing out small businesses.","zh":"一些大型公司被指控过度垄断市场，把小企业挤出局。"},{"en":"Don’t overmonopolize the conversation—let everyone share their ideas.","zh":"别把谈话过度“霸占”了——让每个人都有机会分享想法。"}]}],"synonyms":["overcontrol","dominate","monopolize","corner (the market)","hog (informal)"],"phonetic":"/ˌoʊvərməˈnɑpəˌlaɪz/","extraExplanation":["“overmonopolize”由前缀 over-（过度）+ monopolize（垄断、独占）构成，语气通常带批评，强调“超过合理范围的独占/支配”。","在法律或经济写作中更常见；在日常口语里，有时会用更自然的表达，如 “dominate too much / hog / take over”。"]}
{"word":"overmonopolized","summary":{"en":"Overmonopolized means “too dominated by one company or group,” with not enough competition.","zh":"overmonopolized 指“被单一公司或团体过度垄断”，导致竞争不足。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Controlled too much by a single company or group, leaving little real competition (often with a negative meaning).","zh":"被某一家公司或某一团体过度垄断的；竞争不足的（通常带贬义）。"},"examples":[{"en":"Some critics say the local internet service is overmonopolized, so prices stay high.","zh":"一些批评者说，当地的网络服务被过度垄断，所以价格一直很高。"},{"en":"An overmonopolized market can make it hard for small businesses to survive.","zh":"过度垄断的市场会让小企业很难生存。"}]}],"synonyms":["overly monopolized","too monopolized","dominated","cornered (the market)","controlled"],"phonetic":"/ˌoʊvərməˈnɑpəlaɪzd/","extraExplanation":["“overmonopolized”是由 over-（过度）+ monopolize（垄断）构成的形容词，常用于商业、媒体与政策讨论中，强调“垄断程度过头”。","相关话题常会提到反垄断（antitrust）与监管（regulation）：当市场被少数巨头控制时，可能出现价格上升、创新变慢、消费者选择变少等问题。"]}
{"word":"overmonopolizing","summary":{"en":"“Overmonopolizing” means taking excessive control so others are shut out.","zh":"“overmonopolizing”指过度垄断或独占，导致他人被排挤在外。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"taking too much control of a market, resource, conversation, or opportunity, so that others have little or no chance to participate","zh":"过度垄断（市场/资源/机会等）或过度独占（谈话/注意力等），使他人几乎没有参与空间"},"examples":[{"en":"The new policy aims to stop a few companies from overmonopolizing the local food supply.","zh":"这项新政策旨在阻止少数公司过度垄断当地的食品供应。"},{"en":"In meetings, he sometimes ends up overmonopolizing the discussion without realizing it.","zh":"在会议上，他有时会在不自知的情况下过度独占讨论。"}]}],"synonyms":["dominating","cornering","monopolizing","hogging (informal)"],"phonetic":"/ˌoʊvərməˈnɑpəˌlaɪzɪŋ/","extraExplanation":["构词：over-（“过度、太……”）+ monopolize（“垄断/独占”）。因此 overmonopolize 强调“超过合理程度的垄断或独占”，常带批评语气。","使用场景既可指经济领域（市场被少数公司控制），也可指日常互动（某人“霸占”谈话、注意力或资源）。"]}
{"word":"overmoral","summary":{"en":"“Overmoral” means excessively moralistic or overly focused on moral judgment; it can also mean to overmoralize something (uncommon usage).","zh":"“overmoral”指过度道德化、过分说教或过度强调道德评判；作动词表示“把某事过度道德化”（用法不常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Too focused on judging right and wrong; excessively moralistic or preachy.","zh":"（不常用）过度从道德角度评判；过分说教、道德至上。"},"examples":[{"en":"The article felt overmoral and left little room for real discussion.","zh":"这篇文章显得很“过度道德化”，几乎不给真正讨论留下空间。"},{"en":"Her overmoral comments made others uncomfortable at dinner.","zh":"她在晚餐时那些过分说教的评论让别人很不自在。"}]},{"partOfSpeech":"v.","definition":{"en":"To make something about morality more than necessary; to overemphasize moral lessons.","zh":"把某事过度道德化；过分强调道德教训。"},"examples":[{"en":"We shouldn’t overmoral every mistake—sometimes it’s just a learning moment.","zh":"我们不该把每个错误都过度道德化——有时它只是一次学习的机会。"},{"en":"He tends to overmoral small everyday choices like what people eat.","zh":"他常常把日常小选择（比如吃什么）都过度道德化。"}]}],"synonyms":["moralistic","preachy","judgmental","sanctimonious","overmoralize"],"phonetic":"/ˌoʊvərˈmɔrəl/","extraExplanation":["“overmoral”不是很常见的标准词汇，更常见的表达是：moralistic（道德说教的）、preachy（爱说教的）、judgmental（爱评判的），以及动词 overmoralize（过度道德化）。","在写作中用“overmoral”时，读者可能会觉得你在创造用词或使用非标准表达；如果希望更自然，可以改用上面更常见的词。"]}
{"word":"overmoralistic","summary":{"en":"Overmoralistic means too moral-judging or preachy, treating issues as simple right vs. wrong.","zh":"overmoralistic 指“过分道德化、过度说教/评判”，把问题简化为非黑即白的对错。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an excessively judgmental, preachy, or self-righteous attitude about morality; focusing too much on what is “right” and “wrong,” often in a way that feels unfair or out of touch.","zh":"过分道德化的；过度说教或自以为道德高人一等的；过度强调“对/错”并用道德标准苛刻评判他人的。"},"examples":[{"en":"Some readers felt the article was overmoralistic and didn’t leave room for real-life complexity.","zh":"一些读者觉得那篇文章过分道德化，没有给现实生活的复杂性留下空间。"},{"en":"Her advice sounded overmoralistic, so her friends stopped asking her about relationships.","zh":"她的建议听起来太说教、太道德化了，所以朋友们后来不再问她感情问题。"},{"en":"The film avoids being overmoralistic by showing why each character makes their choices.","zh":"这部电影通过呈现每个角色做选择的原因，避免了过分道德化。"}]}],"synonyms":["preachy","self-righteous","judgmental","sanctimonious","holier-than-thou"],"phonetic":"/ˌoʊvərˌmɔrəlˈɪstɪk/","extraExplanation":["“overmoralistic”常带批评意味，暗示说话者把复杂问题简单归结为道德对错，容易显得居高临下（preachy / self-righteous）。","它与“moralistic”相近，但“over-”强调“过头了”：不只是讲道德，而是讲得过度、让人反感或忽略现实因素（例如制度、心理、环境）。","常见搭配：overmoralistic tone（过分道德化的语气）、overmoralistic message（过于说教的信息/主题）、overmoralistic judgment（过度的道德评判）。"]}
{"word":"overmoralize","summary":{"en":"Overmoralize means to moralize too much or make something overly preachy.","zh":"overmoralize 指“过度说教/过度道德评判”，让内容显得太“讲大道理”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add too much moral judgment or moral lessons to something; to make it sound overly preachy","zh":"对某事过度说教或过度进行道德评判；把内容讲得太“道德化/说教化”"},"examples":[{"en":"The reviewer said the film tries to teach a lesson but ends up overmoralizing.","zh":"影评人说这部电影本想讲道理，但结果变成了过度说教。"},{"en":"Don’t overmoralize every mistake—sometimes people just need practical advice.","zh":"别把每个错误都过度道德化——有时候人们只是需要实用的建议。"},{"en":"In class discussions, she’s thoughtful, but she can overmoralize and shut down other views.","zh":"在课堂讨论里她很认真，但有时会过度道德评判，从而让其他观点难以展开。"}]}],"synonyms":["moralize","preach","be preachy","lecture","overjudge"],"phonetic":"/ˌoʊvɚˈmɔrəˌlaɪz/","extraExplanation":["“over-”表示“过度、太多”。因此 overmoralize 多带批评意味，暗示讲话或写作让人觉得“被教育/被指责”，而不是在讨论事实或解决问题。","在日常英语里更常见的说法是 “be preachy”（很说教）、“moralize too much”（过度说教）或 “overjudge”（过度评判）。overmoralize 偶尔出现在评论、社论、学术讨论中。"]}
{"word":"overmoralized","summary":{"en":"“Overmoralized” means overly moralistic—judging or explaining things mainly as right vs. wrong in a preachy or oversimplified way.","zh":"“overmoralized”指“过度道德化/过度说教”——把事情主要按对错来评判或解读，往往显得简单粗暴。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person, statement, or story) too focused on judging right and wrong, often in a preachy or simplistic way.","zh":"（形容人、言论或故事）过度强调道德评判，常带说教或过于简单化的意味。"},"examples":[{"en":"Some readers felt the article was overmoralized and ignored the real-world causes of the problem.","zh":"一些读者觉得这篇文章过度道德化，忽视了问题的现实成因。"},{"en":"The film’s ending seemed overmoralized, as if it was lecturing the audience.","zh":"这部电影的结尾显得过度说教，好像在给观众上课。"}]},{"partOfSpeech":"adj.","definition":{"en":"Explained or interpreted mainly as a moral lesson rather than as something complex or factual.","zh":"（对事件或作品的解释）主要被当作道德教训来解读，而非看作复杂或客观的事实。"},"examples":[{"en":"Her mistake was overmoralized online, with people calling her a bad person instead of discussing what actually happened.","zh":"她的错误在网上被过度道德化，人们说她人品有问题，而不是讨论事情的真实经过。"},{"en":"History can be overmoralized when every decision is framed as pure good or pure evil.","zh":"当每个决定都被框成纯善或纯恶时，历史就容易被过度道德化。"}]}],"synonyms":["moralistic","preachy","judgmental","sanctimonious","didactic"],"phonetic":"/ˌoʊvərˈmɔrəˌlaɪzd/","extraExplanation":["“overmoralized”由 over-（过度）+ moralize（道德化、说教）构成，常带批评语气，意思不是“很有道德”，而是“过度用道德标准来评判/解释”。","在网络语境中，它常用来批评“把复杂问题简化成道德对错”的倾向，比如把公共政策、社会结构问题全部归结为个人品德。"]}
{"word":"overmoralizing","summary":{"en":"Overmoralizing means being overly preachy or turning something into an excessive moral lesson.","zh":"overmoralizing 指“过度道德化/过度说教”，把事情硬拐成道德评判或道德课。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(describing speech or writing) giving too many moral judgments or lessons, often in a preachy or simplistic way.","zh":"（形容说话或写作）过度道德化；总是强行上价值、讲道德教训，常带说教或把问题简单化的感觉。"},"examples":[{"en":"Some readers felt the essay was overmoralizing and ignored the real-world complexity of the issue.","zh":"一些读者觉得这篇文章太过道德化，忽视了现实问题的复杂性。"},{"en":"Her overmoralizing comments made the conversation tense.","zh":"她那些过度道德化的评论让谈话变得紧张。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of moralizing too much; turning a topic into a moral lesson in an excessive way.","zh":"过度说教；把话题硬拐成道德课（过头地讲道理、评判是非）。"},"examples":[{"en":"The film avoids overmoralizing and lets viewers draw their own conclusions.","zh":"这部电影避免过度说教，让观众自己得出结论。"},{"en":"Overmoralizing can shut down honest discussion.","zh":"过度道德化容易让坦诚讨论进行不下去。"}]}],"synonyms":["preachy","judgmental","sanctimonious","moralistic","self-righteous"],"phonetic":"/ˌoʊvərˈmɔrəˌlaɪzɪŋ/","extraExplanation":["“overmoralizing”来自 over-（过度）+ moralize（道德化、说教）。语气通常偏负面，常用来批评别人把复杂问题简化成“对/错、好/坏”的评判，或把个人价值观强加给他人。","在公共讨论里，它常与“preachy（说教的）”“judgmental（爱评判的）”“virtue signaling（道德表演/标榜正确）”等表达放在一起，但“overmoralizing”更强调“道德评判过头、喧宾夺主”。"]}
{"word":"overmoralizingly","summary":{"en":"“Overmoralizingly” means speaking or writing in an overly moralizing, preachy, judgmental way.","zh":"“overmoralizingly”表示“以过度道德化、爱说教、爱评判的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is excessively moralizing—giving too many moral judgments or lessons, often in a preachy or self-righteous tone.","zh":"以过度说教/过度道德评判的方式；带着太多道德教训或批判的语气，常显得爱说教或自以为是。"},"examples":[{"en":"The reviewer complained that the movie ended overmoralizingly, turning a story into a lecture.","zh":"影评人抱怨这部电影的结尾过于说教，把故事变成了一堂道德课。"},{"en":"He responded overmoralizingly, focusing on what was “right” instead of listening to her feelings.","zh":"他回应时太爱道德评判了，一直强调“对不对”，却没有倾听她的感受。"},{"en":"The article discusses poverty overmoralizingly, blaming individuals rather than looking at social factors.","zh":"这篇文章用过度道德化的方式谈贫困，责怪个人而不看社会因素。"}]}],"synonyms":["too moralizingly","preachily","self-righteously","judgmentally","sanctimoniously"],"phonetic":"/ˌoʊvɚˈmɔrəˌlaɪzɪŋli/","extraExplanation":["这个词非常少见，更多时候人们会用更自然的说法：too moralizing / in a preachy way / self-righteously / judgmentally。","构词：over-（过度）+ moralize（说教、道德化解读）+ -ingly（以……方式）。通常带明显的贬义，暗示“讲道理讲过头、让人反感”。"]}
{"word":"overmorally","summary":{"en":"“Overmorally” means doing or saying something in a too-moralizing, overly judgmental way.","zh":"“overmorally”指“过度道德化、太爱用道德标准评判”的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively moral or moralizing way; too focused on judging right and wrong.","zh":"以过度道德化的方式；太强调用道德标准来评判对错。"},"examples":[{"en":"The article reads overmorally, as if every small mistake is a serious ethical failure.","zh":"这篇文章读起来过于道德化，好像每个小错误都是严重的伦理失败。"},{"en":"She spoke overmorally about his choices, which made the conversation uncomfortable.","zh":"她用过度道德化的语气谈他的选择，让谈话变得不太舒服。"}]}],"synonyms":["overly moralistic","judgmentally","self-righteously","holier-than-thou"],"phonetic":"/ˌoʊvɚˈmɔrəli/","extraExplanation":["“overmorally”并不是常见词，更像是把 over-（过度）+ morally（道德上）临时组合出来的写法，用来强调“太爱上纲上线”。在正式写作中更常见的表达有：too moralistic（太道德说教）、overly judgmental（过度评判）、self-righteous（自以为正义）。"]}
{"word":"overmore","summary":{"en":"“Overmore” is an archaic adverb meaning “moreover; furthermore; in addition.”","zh":"“overmore”是一个古体副词，意思是“而且；此外；再者”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic or poetic) moreover; furthermore; in addition.","zh":"（古体或诗体）而且；此外；再者。"},"examples":[{"en":"The road was long; overmore, the weather turned cold.","zh":"路途漫长；而且天气也转冷了。"},{"en":"He promised to help, and overmore he brought extra supplies.","zh":"他答应帮忙，而且还带来了额外的物资。"}]}],"synonyms":["moreover","furthermore","besides","in addition"],"phonetic":"/ˌoʊvərˈmɔr/","extraExplanation":["“overmore”在现代英语里几乎不用，更多见于中古/早期近代英语或仿古、诗歌、文学风格中。现在更常用的对应词是“moreover / furthermore / besides”。","词形可以理解为“over（在……之上）+ more（更多）”，表达“在已有内容之上再补充一点”的连接语气。"]}
{"word":"overmortgage","summary":{"en":"Overmortgage means to mortgage a property too heavily, taking on more debt than is safe or than the property can support.","zh":"overmortgage 指对房产等进行过度抵押借款，使负债过高、风险变大。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to borrow too much money using property as security, so that the debt is too large for the property’s value or for the borrower’s ability to repay","zh":"（以房产等作抵押）过度借贷；抵押过度，导致债务超过房产价值或超过偿还能力"},"examples":[{"en":"They overmortgaged the house to finance a risky business.","zh":"他们把房子过度抵押来为一项高风险生意融资。"},{"en":"If you overmortgage your home, even a small drop in prices can leave you owing more than it’s worth.","zh":"如果你过度抵押房子，房价稍微下跌就可能出现“欠款比房子还值钱”的情况。"}]}],"synonyms":["overleverage","take on too much mortgage debt","mortgage to the hilt"],"phonetic":"/ˌoʊvərˈmɔrɡɪdʒ/","extraExplanation":["“over-”在英语里常表示“过度、超过合理范围”（如 overwork 过度工作、overeat 暴饮暴食）。因此 overmortgage 通常带有负面含义，暗示财务风险增加。","该词在日常口语中不算常见，更常见的说法包括：take on too much mortgage debt（背负过多房贷）、be overleveraged（杠杆过高）、be mortgaged to the hilt（把能抵押的都抵押了）。"]}
{"word":"overmortgaged","summary":{"en":"Overmortgaged means burdened with too much mortgage debt to handle safely.","zh":"Overmortgaged 指抵押贷款负担过重，债务高到难以稳妥承担。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a property, person, or business) having a mortgage or debts that are too large to manage safely, often because the value or income is not enough to cover payments.","zh":"（指房产、个人或企业）抵押/负债过重，债务高到难以安全承担，常因资产价值或收入不足以支付还款。"},"examples":[{"en":"They were overmortgaged after buying a bigger house than they could afford.","zh":"他们买了超出承受能力的大房子后，抵押负担过重。"},{"en":"An overmortgaged landlord may struggle to keep up with repairs and loan payments.","zh":"抵押过重的房东可能难以同时承担维修费用和贷款还款。"}]}],"synonyms":["overleveraged","heavily mortgaged","debt-laden"],"phonetic":"/ˌoʊvərˈmɔrɡɪdʒd/","extraExplanation":["“over-”有“过度、超出合理范围”的意思；“mortgage”是“抵押贷款”。因此“overmortgaged”通常带有警示意味，强调财务风险（比如房价下跌、利率上升或收入减少时更容易出问题）。","常见搭配：overmortgaged homeowner/property/business（抵押过重的房主/房产/企业）；become/leave someone overmortgaged（使……陷入抵押过重的状态）。"]}
{"word":"overmortgaging","summary":{"en":"Overmortgaging means borrowing too much against a property through an excessively large mortgage.","zh":"overmortgaging 指通过过高的按揭贷款对房产抵押借款过多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of borrowing too much money against a property (using it as security), so that the debt is dangerously high compared with the property’s value or your ability to repay","zh":"以房产作抵押借款过多，导致债务相对房产价值或自身偿还能力而言过高、风险很大"},"examples":[{"en":"Overmortgaging can leave a family with payments they can’t afford if interest rates rise.","zh":"过度抵押借款可能会让家庭在利率上升时背上无力承担的月供。"},{"en":"The report warned that overmortgaging increases the chance of foreclosure.","zh":"报告警告说，过度抵押借款会提高被止赎（收房）的风险。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “overmortgage”: borrowing too much against a property by taking out an excessively large mortgage","zh":"“overmortgage”的现在分词：对房产抵押借款过多，申请过高的按揭贷款"},"examples":[{"en":"They are overmortgaging the house to fund a risky investment.","zh":"他们正把房子过度抵押借款去投资一个高风险项目。"},{"en":"Banks try to prevent customers from overmortgaging by checking income and debt.","zh":"银行会核查收入和负债，尽量避免客户过度抵押借款。"}]}],"synonyms":["overborrowing","taking on too much mortgage debt","overleveraging","overextending (financially)"],"phonetic":"/ˌoʊvərˈmɔrɡɪdʒɪŋ/","extraExplanation":["在房地产语境里，是否“过度”常和两个概念有关：①贷款价值比（LTV，贷款额÷房产价值）过高；②债务收入比（DTI，每月还款÷收入）过高。任何一个过高都可能使借款人更容易在房价下跌、失业或利率上升时陷入财务困境。","这个词在日常对话中不算常见，更常见的表达是“overborrow (against the house) / take on too much mortgage debt / be overleveraged”。"]}
{"word":"overmoss","summary":{"en":"Overmoss means to become covered with moss, or to cover something with moss (a rare, poetic verb).","zh":"overmoss 指（使）长满苔藓、被苔藓覆盖（较少见、偏文学的动词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cover something with moss; to become covered with moss over time","zh":"（使）长满苔藓；（使）被苔藓覆盖"},"examples":[{"en":"The old stone steps were overmossed and slippery after years of rain.","zh":"那些老石阶多年经雨后长满了苔藓，变得很滑。"},{"en":"In the abandoned garden, statues slowly overmossed in the shade.","zh":"在那座废弃的花园里，雕像在阴影中慢慢长满苔藓。"}]}],"synonyms":["moss over","be covered with moss","grow moss"],"phonetic":"/ˌoʊvɚˈmɔs/","extraExplanation":["“overmoss”不是现代日常英语里的常用词，更常见的表达是“be covered in/with moss”“moss over”“grow moss”。它偶尔会出现在描写自然、废墟或时间流逝的文学/诗意语境中，用来营造“陈旧、潮湿、被遗忘”的氛围。"]}
{"word":"overmost","summary":{"en":"“Overmost” means the highest or uppermost position.","zh":"“overmost”表示“最上面的、最高处的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Highest in position; uppermost; on the very top.","zh":"位置最高的；最上面的；在最顶端的。"},"examples":[{"en":"Snow lay on the overmost branches of the pine trees.","zh":"积雪覆盖在松树最上面的枝条上。"},{"en":"He reached toward the overmost shelf to grab the last box.","zh":"他伸手去够最上面的架子拿最后一个盒子。"}]}],"synonyms":["uppermost","topmost","highest"],"phonetic":"/ˈoʊvɚˌmoʊst/","extraExplanation":["“overmost”现在比较少见，更多时候人们会用更常见的“uppermost / topmost”。它常出现在较旧的文学或更具诗意的描写中，用来强调“在最顶端”的视觉画面。"]}
{"word":"overmotor","summary":{"en":"Overmotor means to give a machine or vehicle more motor power than it needs, or to describe something that has excessive motor power.","zh":"Overmotor 指给设备/车辆配了超出需求的马达，或形容动力（马力）过剩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to equip (a machine or vehicle) with a motor that is more powerful than necessary; to give too much motor power to","zh":"给（机器或车辆）装配过于强劲的马达；使其动力过大"},"examples":[{"en":"The pump was overmotored, so it wasted electricity and ran hotter than needed.","zh":"这台水泵马达配得过大，所以更耗电，而且温度比需要的更高。"},{"en":"If you overmotor the conveyor, you may damage the belt during sudden starts.","zh":"如果输送机马达选得过大，突然启动时可能会伤到皮带。"}]},{"partOfSpeech":"adj.","definition":{"en":"having more motor power than is needed for the task","zh":"（设备）动力过大、马力过剩的"},"examples":[{"en":"An overmotored boat can be harder to control for beginners.","zh":"马力过剩的船对新手来说可能更难操控。"},{"en":"This fan is slightly overmotored for the room, but it will last longer under light load.","zh":"这台风扇对这个房间来说动力略大，但在轻负载下可能更耐用。"}]}],"synonyms":["overpower","oversize (the motor)","overengineer"],"phonetic":"/ˌoʊvərˈmoʊtər/","extraExplanation":["“overmotor”多见于工程/设备选型语境，也常写作“over-motor(ed)”或“overmotored”。它通常带有“选型过大”的含义：不一定更好，可能导致耗能增加、噪音/发热、启动冲击更大，甚至加速部件磨损。"]}
{"word":"overmount","summary":{"en":"Overmount means to climb over something or to overcome a difficulty; it is somewhat literary or old-fashioned.","zh":"overmount 指“翻越某物”或“克服困难”，语感偏文学化、较少用于日常口语。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to climb over or get across (something), especially an obstacle","zh":"（尤指越过障碍物）爬过；跨越"},"examples":[{"en":"The hikers overmounted the rocky ridge before sunset.","zh":"徒步者在日落前翻越了那道岩石山脊。"},{"en":"In the story, the hero overmounts the city walls to escape.","zh":"在故事里，英雄翻越城墙逃走。"}]},{"partOfSpeech":"vt.","definition":{"en":"to overcome (a difficulty or challenge); to surmount","zh":"克服（困难或挑战）；战胜"},"examples":[{"en":"With patience, she overmounted her fear of speaking in public.","zh":"凭着耐心，她克服了当众讲话的恐惧。"},{"en":"They overmounted many setbacks to finish the project.","zh":"他们克服了许多挫折，最终完成了项目。"}]}],"synonyms":["surmount","overcome","get over","climb over","scale"],"phonetic":"/ˌoʊvərˈmaʊnt/","extraExplanation":["“overmount”在现代英语中比较少见，常见于较正式或文学化的写法；日常表达里更常用“climb over / get over / overcome / surmount”。","构词上可理解为“over-（越过）+ mount（爬、登高）”，因此既可指“翻越实体障碍”，也可引申为“克服抽象困难”。"]}
{"word":"overmounts","summary":{"en":"“Overmounts” means “overcomes” or “successfully deals with” an obstacle; it’s a formal/literary verb form (3rd person singular).","zh":"“overmounts” 表示“克服、战胜（障碍）”，是较正式/文学化的用法，为动词 overmount 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to overcome or deal successfully with a difficulty, obstacle, or problem","zh":"克服；战胜（困难、障碍或问题）"},"examples":[{"en":"She overmounts every challenge with patience and hard work.","zh":"她用耐心和努力克服每一个挑战。"},{"en":"The team overmounts funding problems by partnering with local businesses.","zh":"团队通过与本地企业合作来克服资金问题。"}]}],"synonyms":["overcome","surmount","get over","conquer"],"phonetic":"ˌoʊvɚˈmaʊnt","extraExplanation":["“overmounts” 是动词 “overmount” 的第三人称单数现在时（he/she/it overmounts）。这个词偏正式、文学或书面语；日常英语更常用 “overcome / get over / surmount”。","常见搭配：overmount difficulties/obstacles/barriers/resistance（克服困难/障碍/阻力）。"]}
{"word":"overmourn","summary":{"en":"Overmourn means to mourn or grieve excessively.","zh":"overmourn 指“过度哀悼/悲伤过度”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to mourn (feel and show sadness) too much or for too long; to grieve excessively","zh":"过度哀悼；悲伤过度（哀伤得太强烈或太久）"},"examples":[{"en":"After the funeral, her friends worried she was overmourning and not eating or sleeping.","zh":"葬礼后，朋友们担心她悲伤过度，吃不下也睡不好。"},{"en":"It’s natural to grieve, but try not to overmourn in a way that harms your health.","zh":"悲伤是正常的，但尽量别让哀悼过度到伤害健康。"}]},{"partOfSpeech":"v.","definition":{"en":"(literary/older use) to lament or express sorrow for something excessively","zh":"（文学/较旧用法）过分哀叹；过度感伤地表达悲痛"},"examples":[{"en":"The poem warns us not to overmourn what cannot be changed.","zh":"这首诗告诫我们，不要对无法改变的事过度哀叹。"}]}],"synonyms":["mourn excessively","grieve too much","lament","bewail","dwell on (a loss)"],"phonetic":"/ˌoʊvɚˈmɔrn/","extraExplanation":["“over-”这个前缀常表示“过度、超过适当范围”（如 overeat 吃太多、overthink 想太多）。因此 overmourn 直观含义就是“哀悼过度”。","overmourn 在现代英语中比较少见，更常用的表达是 grieve too much / mourn excessively / dwell on loss 等。写作中用它会带一点“文学化、强调过度”的语气。"]}
{"word":"overmournful","summary":{"en":"Overmournful means excessively sad or sorrowful—more mournful than is appropriate.","zh":"overmournful 指“过分悲伤/哀伤过度”，悲伤程度超过情境所需。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"excessively sad, grieving, or sorrowful (more mournful than seems appropriate or expected)","zh":"过分悲伤的；哀伤过度的（比情境所需更显得忧伤）"},"examples":[{"en":"His overmournful tone made everyone uncomfortable at what was meant to be a hopeful gathering.","zh":"他那种过分哀伤的语气让本该充满希望的聚会气氛变得尴尬。"},{"en":"The film’s music is beautiful, but sometimes it feels overmournful for the story.","zh":"这部电影的配乐很美，但有时对剧情来说显得过分哀伤。"},{"en":"Try not to write an overmournful apology—keep it sincere and clear.","zh":"道歉不要写得过分悲悲切切，真诚清楚就好。"}]}],"synonyms":["overly mournful","excessively sorrowful","too sad","maudlin","overly sentimental"],"phonetic":"/ˌoʊvɚˈmɔrnfəl/","extraExplanation":["“over-”是常见前缀，表示“过度、超过适当程度”。因此 overmournful 强调的不是“悲伤”本身，而是“悲伤得太多”。","这个词在现代英语里不算常用，更常见的表达有 overly mournful / excessively mournful / too mournful。写作中用 overmournful 会带一点评价意味：暗示说话者觉得这种哀伤“有点过了”。"]}
{"word":"overmournfully","summary":{"en":"“Overmournfully” means “in an excessively sad or grieving way.”","zh":"“overmournfully”表示“过分悲伤/哀伤地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively sad, grieving, or gloomy way; more mournfully than the situation seems to call for.","zh":"过分悲伤地；哀伤得过头地（比情境所需要的更忧郁、哀恸）。"},"examples":[{"en":"He spoke overmournfully about the minor setback, as if it were a tragedy.","zh":"他把这点小挫折说得过分悲伤，仿佛是一场悲剧。"},{"en":"Don’t write overmournfully in your email—keep the tone calm and professional.","zh":"邮件别写得过分哀伤——语气保持冷静、专业。"},{"en":"The music felt overmournfully dramatic for such a simple scene.","zh":"对这么简单的场景来说，那段音乐显得过分哀伤又戏剧化。"}]}],"synonyms":["too mournfully","excessively","overly","melodramatically","morosely"],"phonetic":"/ˌoʊvərˈmɔrnfəli/","extraExplanation":["“overmournfully”由前缀 over-（“过度、过分”）+ mournful（“悲伤的、哀悼的”）+ -ly（副词后缀）构成，意思是“以过度悲伤的方式”。","这个词比较少见，写作中更常用的表达包括：too mournfully, excessively mournful(ly), overly sad, melodramatically sad。"]}
{"word":"overmournfulness","summary":{"en":"Overmournfulness means excessive sadness or grief—being more mournful than feels appropriate.","zh":"overmournfulness 指过度的悲伤或哀痛，即哀伤得“太过头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or overly intense sadness and grief; a mood that feels too mournful for the situation.","zh":"过度的悲伤与哀痛；一种显得“太过哀伤”的情绪状态。"},"examples":[{"en":"Some readers felt the novel’s overmournfulness weakened its message of hope.","zh":"一些读者觉得这部小说的“过度哀伤”削弱了它传达希望的力量。"},{"en":"After the ceremony, she tried to move on, but a sense of overmournfulness kept returning.","zh":"仪式结束后，她想继续生活，但一种过度的哀伤感不断回来。"}]}],"synonyms":["excessive grief","over-sadness","overmelancholy","mournfulness"],"phonetic":"/ˌoʊvɚˈmɔrn.fəl.nəs/","extraExplanation":["这是一个较少见的构词：over-（过度）+ mourn（哀悼）+ -ful（充满…的）+ -ness（名词后缀）。意思不是“哀悼本身不对”，而是强调程度“太强、太多”。","常用于评论写作风格或情绪氛围：比如说一部作品的基调太悲、太沉重，或一个人的情绪长期陷在悲痛里。","和 grief（悲痛）相比，overmournfulness 更强调“过度的哀伤表现/氛围”；和 melancholy（忧郁）相比，它更靠近“哀悼式的悲伤”，不只是淡淡的忧郁。"]}
{"word":"overmuch","summary":{"en":"Overmuch means “too much” or “excessive,” used as an adverb or adjective, often in a formal/literary tone.","zh":"Overmuch 表示“过多/过度”，可作副词或形容词，语气偏正式或文学。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"too much; excessively (often used in a slightly formal or literary style)","zh":"过多地；太……（常见于稍正式或文学语境）"},"examples":[{"en":"Don’t worry overmuch about making mistakes—practice matters most.","zh":"别过分担心犯错——练习最重要。"},{"en":"He talked overmuch during the meeting and didn’t listen to others.","zh":"他在会议上说得太多，却没怎么听别人。"}]},{"partOfSpeech":"adj.","definition":{"en":"more than is reasonable or needed; excessive","zh":"过多的；过度的；不必要地多的"},"examples":[{"en":"Overmuch sugar can harm your health.","zh":"过多的糖会危害健康。"},{"en":"Her overmuch caution sometimes slows her down.","zh":"她过度谨慎有时会拖慢进度。"}]}],"synonyms":["too much","excessively","overly","unduly","excessive"],"phonetic":"/ˈoʊvɚˌmʌtʃ/","extraExplanation":["“Overmuch”在现代口语中不算常见，更常用“too much / too many / excessively”。但在写作、评论或带一点古典/文学腔调的表达里仍会出现（如“grieve not overmuch”表示“不要过度悲伤”）。"]}
{"word":"overmuches","summary":{"en":"“Overmuches” is an archaic/literary plural noun meaning “excesses; things that are too much.” The base word “overmuch” can also be an adjective or adverb meaning “too much/excessively.”","zh":"“overmuches”是较古旧/文学用法的复数名词，意为“种种过度（之事）”。其原形“overmuch”也可作形容词或副词，表示“过多/过度地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun, archaic/literary) Excesses; things done or felt to an unnecessary or unhealthy degree.","zh":"（复数名词，较古旧/文学用法）过度之事；过分、过量的行为或情感。"},"examples":[{"en":"In his youth, he later regretted his overmuches and tried to live more simply.","zh":"年轻时他后来很后悔自己的种种过度之事，于是开始更简朴地生活。"},{"en":"The diary records overmuches of pride and anger that hurt their friendship.","zh":"日记记下了过度的骄傲与愤怒，最终伤害了他们的友谊。"}]},{"partOfSpeech":"adj.","definition":{"en":"(base word: overmuch) Too much; excessive.","zh":"（原形：overmuch）太多的；过度的。"},"examples":[{"en":"He showed overmuch confidence and ignored the warning signs.","zh":"他过于自信，忽视了警示信号。"},{"en":"Overmuch sugar can be bad for your health.","zh":"糖摄入过多会影响健康。"}]},{"partOfSpeech":"adv.","definition":{"en":"(base word: overmuch) Too much; excessively.","zh":"（原形：overmuch）太多地；过度地。"},"examples":[{"en":"Don’t worry overmuch about small mistakes.","zh":"别为小错误过度担心。"},{"en":"She apologized overmuch, even when it wasn’t her fault.","zh":"即使不是她的错，她也一再过度道歉。"}]}],"synonyms":["excesses","too much","overindulgences","immoderation"],"phonetic":"ˈoʊvɚˌmʌtʃ","extraExplanation":["“overmuches”通常被理解为名词 overmuch（意为“过度、过分”）的复数形式，整体带有较强的古旧/文学色彩；现代英语更常用“excesses”“too much”等表达。","在经典文学或正式文风中，overmuch/overmuches常用来带一点道德反思的语气，指“过度的情感、欲望或行为”（如 pride, anger, indulgence）。"]}
{"word":"overmuchness","summary":{"en":"Overmuchness means “too much”—an excess of something.","zh":"overmuchness 指“太多、过度”，也就是某事物的“过量/过剩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being too much; excess","zh":"过多；过度；太多的状态（或性质）"},"examples":[{"en":"The report warns that overmuchness in spending can lead to serious debt.","zh":"报告警告说，支出过度可能会导致严重债务。"},{"en":"Many people struggle with overmuchness of information online.","zh":"很多人都在为网上信息过量而感到困扰。"}]}],"synonyms":["excess","overabundance","surplus","too much","immoderation"],"phonetic":"/ˈoʊvɚˌmʌtʃnəs/","extraExplanation":["“overmuchness”是一个比较少见、略带书面/古风色彩的名词，来自 overmuch（“过多的”）+ -ness（名词后缀，表示“……的状态/性质”）。现代英语里更常用的说法是 “excess” 或 “too much”。","在文学或较正式的写作中，它有时用来强调“过犹不及”的感觉，带一点批评或反思的语气。"]}
{"word":"overmultiplication","summary":{"en":"Overmultiplication means multiplying too much, creating unnecessary increase or complexity.","zh":"overmultiplication 指“乘得过多”，引申为不必要的增加或复杂化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or result of multiplying something too much, so that it becomes unnecessarily large, complicated, or excessive.","zh":"过度相乘；（引申）过度增加，导致数量或复杂度不必要地变大。"},"examples":[{"en":"The teacher warned that overmultiplication of terms can make the equation harder to understand.","zh":"老师提醒说，项的过度相乘会让方程更难理解。"},{"en":"In the report, the overmultiplication of categories confused readers instead of helping them.","zh":"在报告中，类别的过度增加反而让读者更困惑，而不是更清楚。"}]}],"synonyms":["excessive multiplication","unnecessary multiplication","overexpansion","proliferation"],"phonetic":"/ˌoʊvərˌmʌltəplɪˈkeɪʃən/","extraExplanation":["这个词并不算常见日常词汇，更常见的表达是：too much multiplication（乘得太多）、unnecessary multiplication（不必要的相乘）、needless proliferation（不必要的扩张/激增）。在管理或社会语境里，它常带有“为了更精细却反而更复杂”的批评意味，比如规则、部门、表格、选项被拆得太多。"]}
{"word":"overmultiplied","summary":{"en":"Overmultiplied means multiplied too many times, producing an overly large or incorrect result.","zh":"overmultiplied 指“乘得太多次/过度相乘”，从而使结果过大或不正确。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a number, amount, or calculation) multiplied too many times, so the result becomes too large or incorrect.","zh":"（数字、数量或计算）被乘得太多次，导致结果过大或不正确。"},"examples":[{"en":"The spreadsheet formula was overmultiplied, so the final total was way too high.","zh":"电子表格公式把数值乘过头了，所以最后的总数高得离谱。"},{"en":"If the interest is overmultiplied, the company’s costs can look worse than they really are.","zh":"如果利息被过度相乘，公司的成本看起来可能比实际更糟。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “overmultiply”: to multiply something too much or too many times.","zh":"“overmultiply”的过去式/过去分词：把某物乘得过多或乘了太多次。"},"examples":[{"en":"I overmultiplied the rate by the number of days and got an inflated estimate.","zh":"我把费率和天数多乘了一次，结果估算被放大了。"}]}],"synonyms":["multiplied too much","overcalculated","overestimated","inflated"],"phonetic":"/ˌoʊvərˈmʌltəˌplaɪd/","extraExplanation":["“over-”常表示“过度、超过正常程度”（如 overcook 煮过头、overpay 多付钱）。因此 overmultiplied 多用于数学、财务、表格计算等场景，强调“乘法步骤过多/重复”，导致结果失真。日常口语中不算常见，更常见的说法是 “multiplied too much / multiplied again by mistake”。"]}
{"word":"overmultiply","summary":{"en":"“Overmultiply” means to multiply or increase too much, often causing problems.","zh":"“overmultiply”指（数量）过度繁殖或过度增加，常含“造成问题/失衡”的意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to multiply (something) too much; to make the amount or number increase excessively","zh":"使（某物）繁殖/增加过多；过度增加（数量）"},"examples":[{"en":"If you overmultiply the numbers, the final answer will be far too large.","zh":"如果你把数字过度相乘/放大，最后的答案会大得离谱。"},{"en":"The fertilizer made the plants overmultiply their leaves, but the fruit stayed small.","zh":"肥料让植物叶子长得过多，但果实反而很小。"}]},{"partOfSpeech":"vi.","definition":{"en":"to multiply too much; to increase in number more than is healthy or desired","zh":"繁殖/增长过度；数量增加得超过健康或需要的程度"},"examples":[{"en":"Bacteria can overmultiply in warm, moist conditions.","zh":"细菌在温暖潮湿的环境中容易过度繁殖。"},{"en":"Without predators, rabbits may overmultiply and damage the grassland.","zh":"没有天敌时，兔子可能过度繁殖并破坏草地。"}]}],"synonyms":["increase excessively","multiply too much","proliferate","grow out of control","breed out of control"],"phonetic":"/ˌoʊvərˈmʌltəˌplaɪ/","extraExplanation":["“overmultiply”不是非常常见的日常用词，更常见的表达有：multiply too much / grow too fast / increase excessively / proliferate（尤指细胞、细菌等）/ breed out of control（动物繁殖失控）。","在生物、生态或医学语境中，它常用来描述细菌、细胞、昆虫等“数量失衡式增长”，通常带有负面含义（会造成感染、资源耗尽或生态破坏）。"]}
{"word":"overmultiplying","summary":{"en":"“Overmultiplying” means multiplying too much or using unnecessary multiplication steps.","zh":"“overmultiplying”指过度相乘，或做了不必要的乘法步骤。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"multiplying too much or too many times; increasing a number or quantity more than is necessary or correct","zh":"过度相乘；把数量或数值乘得过多（超过需要或正确的程度）"},"examples":[{"en":"I think you’re overmultiplying—try simplifying the expression first.","zh":"我觉得你在过度相乘——先试着把表达式化简。"},{"en":"In spreadsheets, overmultiplying values can quickly inflate the final total.","zh":"在电子表格里，过度相乘数值会很快把最终总数夸大。"}]},{"partOfSpeech":"v.","definition":{"en":"(math/teaching) using unnecessary multiplication steps, making a solution longer or more complicated than it needs to be","zh":"（数学/教学）使用不必要的乘法步骤，使解题过程变得更长或更复杂"},"examples":[{"en":"You’re getting the right answer, but you’re overmultiplying and losing time.","zh":"你答案是对的，但你用了太多乘法步骤，浪费了时间。"},{"en":"The tutor showed a shorter method so the student would stop overmultiplying.","zh":"辅导老师展示了更简短的方法，让学生别再过度相乘。"}]}],"synonyms":["multiply too much","overcalculate","overcomplicate","inflate (a total)"],"phonetic":"/ˌoʊvərˈmʌltəˌplaɪɪŋ/","extraExplanation":["“over-”这个前缀常表示“过度、超过需要的程度”。所以“overmultiplying”直观含义就是“乘太多/乘过头”。在日常英语里它不算常见，更常见的表达是“multiply too much / overcalculate / make it more complicated than necessary”。"]}
{"word":"overmultitude","summary":{"en":"“Overmultitude” means an excessively large number or an overabundance, and it is a rare, formal/old-fashioned word.","zh":"overmultitude 指“过多的数量/过量”，属于较罕见、偏正式或古风的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An excessively large number of people or things; an overabundance.","zh":"过多的人或事物；过量、过度的数量。"},"examples":[{"en":"The tiny clinic couldn’t handle the overmultitude of patients during the outbreak.","zh":"在疫情暴发期间，这家小诊所无法应付过多的病人。"},{"en":"He complained that an overmultitude of emails made it hard to focus on real work.","zh":"他抱怨说邮件数量过多，让人难以专注于真正的工作。"}]}],"synonyms":["overabundance","excess","surplus","profusion","a glut","too many"],"phonetic":"/ˌoʊvərˈmʌltɪˌtud/","extraExplanation":["“overmultitude”是很少见、偏书面/古风的用词，由 over-（过度）+ multitude（众多）构成。现代英语里更常用“an overabundance of… / too many… / an excess of…”来表达同样意思。","在文学或较旧的文本中，这类“over- + 名词”的造词方式常用来强调“多到不正常、造成压力或负担”的感觉。"]}
{"word":"overmuse","summary":{"en":"“Overmuse” means to muse or think too much, often in a way that slows action or becomes unhelpful.","zh":"“overmuse”指过度沉思、想太多，常带有因此变得拖延或无益的含义。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to think, ponder, or daydream too much, especially so that it becomes unproductive or makes you hesitate","zh":"过度沉思；想太多（以至于变得没有效率或让人犹豫不决）"},"examples":[{"en":"If you overmuse about every choice, you may never start.","zh":"如果你对每个选择都想太多，你可能永远都开始不了。"},{"en":"She overmused on the email and delayed replying for days.","zh":"她对那封邮件想得太多，结果拖了好几天才回复。"}]},{"partOfSpeech":"vt.","definition":{"en":"to overthink (something); to spend too much time musing about a particular topic","zh":"对（某事）过度思考；在某个话题上想得过久"},"examples":[{"en":"Don’t overmuse the wording—keep it simple and clear.","zh":"别在措辞上想太久——简单清楚就好。"},{"en":"He overmused his mistakes instead of learning from them.","zh":"他反复纠结自己的错误，而不是从中学习。"}]}],"synonyms":["overthink","dwell on","ruminate","brood","obsess"],"phonetic":"/ˌoʊvɚˈmjuz/","extraExplanation":["“overmuse”不是很常见的标准词汇，更像是由前缀 over-（过度）+ muse（沉思、冥想）临时组合出来的表达。写作中使用它会带一点文学感或个人风格；更常见、自然的替代说法有 overthink、dwell on、ruminate。","muse 本身常带有“悠闲地想、沉浸式地想”的感觉；加上 over- 之后，语气就变成“想太多、想过头”，常暗示拖延、焦虑或难以行动。"]}
{"word":"overmystification","summary":{"en":"Overmystification means making something seem unnecessarily mysterious or complicated.","zh":"overmystification 指把事情讲得过于神秘或复杂，导致不必要的困惑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making something seem more mysterious, complicated, or hard to understand than it really is; too much mystification","zh":"把事情讲得过于神秘、复杂或难以理解；过度神秘化/过度玄学化"},"examples":[{"en":"The article’s overmystification of basic science confused many readers.","zh":"这篇文章把基础科学讲得过于神秘，反而让很多读者更困惑。"},{"en":"We need clarity, not overmystification, when explaining mental health to the public.","zh":"向公众解释心理健康时，我们需要清晰，而不是过度神秘化。"},{"en":"Her teacher warned that overmystification can make a simple idea feel intimidating.","zh":"老师提醒她：过度神秘化会让一个简单的想法显得很吓人。"}]}],"synonyms":["overcomplication","needless obscurity","unnecessary mystique","mystification"],"phonetic":"/ˌoʊvərˌmɪstɪfɪˈkeɪʃən/","extraExplanation":["“over-”表示“过度、太多”。“mystification”来自“mystify”（使人迷惑、使显得神秘）。因此“overmystification”强调：不是适度的引人好奇，而是把事情讲得故弄玄虚、让人更难理解。","这个词不算常见，更常用的表达有：overcomplication（过度复杂化）、unnecessary mystique（不必要的神秘感）、needless obscurity（不必要的晦涩）。"]}
{"word":"overmystified","summary":{"en":"Overmystified means made to seem more mysterious or complicated than it really is.","zh":"overmystified 指把事情不必要地弄得过于神秘或复杂，显得比实际更难懂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to seem more mysterious, complicated, or hard to understand than it really is (often unnecessarily).","zh":"被（常常是不必要地）弄得过于神秘、过于复杂，让人觉得比实际更难理解。"},"examples":[{"en":"The instructions are overmystified—it's actually just three simple steps.","zh":"说明写得太神秘复杂了——其实就三步，很简单。"},{"en":"Some people think investing is overmystified by experts.","zh":"有些人觉得投资被专家讲得过于神秘化了。"},{"en":"Don't let the jargon overmystify the topic.","zh":"别让行话把这个话题弄得太神秘难懂。"}]},{"partOfSpeech":"adj.","definition":{"en":"Feeling confused because something has been presented as mysterious or unclear.","zh":"因为某事被讲得神神秘秘或不清不楚而感到困惑的。"},"examples":[{"en":"I was overmystified at first, but the teacher explained it clearly.","zh":"我一开始被弄得很困惑，但老师讲清楚后就明白了。"}]}],"synonyms":["overcomplicated","needlessly complex","made to seem mysterious","obscured","mystified"],"phonetic":"/ˌoʊvərˈmɪstəˌfaɪd/","extraExplanation":["“over-”常表示“过度、太……”，所以 overmystified = “被过度神秘化/复杂化”。","来自动词 mystify（使困惑、使显得神秘）。日常表达里更常见的是 overcomplicated（过于复杂）或 made to seem mysterious（被弄得很神秘）；overmystified 相对少见，但意思容易理解。","常用于批评某个概念/流程被包装得太高深：本来不难，却被术语、行话或刻意的叙述方式弄得难懂。"]}
{"word":"overmystify","summary":{"en":"To overmystify is to make something seem unnecessarily mysterious or complicated.","zh":"overmystify 指把事情讲得过于神秘或复杂，让人觉得难懂。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something seem more mysterious, complicated, or hard to understand than it really is (often by using vague language or unnecessary jargon)","zh":"把某事讲得比实际更神秘、更复杂或更难懂（常指用含糊其辞或不必要的术语）"},"examples":[{"en":"Don’t overmystify the process—it’s basically just three steps.","zh":"别把这个过程讲得太玄乎——基本上就三步。"},{"en":"Some marketers overmystify simple features to make the product sound special.","zh":"有些营销会把简单功能过度神秘化，让产品听起来更厉害。"},{"en":"The teacher tried not to overmystify grammar and used clear examples instead.","zh":"老师尽量不把语法讲得太神秘，而是用清晰的例子。"}]}],"synonyms":["overcomplicate","oversimplify (not the same, but a related contrast)","obscure","mystify","make a big deal out of"],"phonetic":"/ˌoʊvɚˈmɪstɪˌfaɪ/","extraExplanation":["“over-”表示“过度”，mystify 表示“使困惑/使显得神秘”。overmystify 常用于批评某人把简单问题讲复杂，语气通常偏负面或提醒。","常见搭配：overmystify something / overmystify the issue / overmystify the process。写作或表达建议：如果担心自己在 overmystify，可以用更具体的词、举例、分步骤说明。"]}
{"word":"overmystifying","summary":{"en":"Overmystifying means making something seem more mysterious or complicated than it really is.","zh":"overmystifying 指把事情说得过于神秘或过于复杂，超过其实际程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making something seem more mysterious, complicated, or “deep” than it really is; explaining in a way that adds unnecessary mystery.","zh":"把事情讲得过于神秘、复杂或“高深”；用不必要的方式增加神秘感。"},"examples":[{"en":"The teacher worried that the textbook was overmystifying a simple idea.","zh":"老师担心这本教材把一个简单的概念讲得过于神秘化。"},{"en":"Let’s stop overmystifying the process—it’s just a few clear steps.","zh":"别再把这个过程说得太玄了——其实就是几个清楚的步骤。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of making something seem more mysterious or complicated than it is.","zh":"把事情过度神秘化或过度复杂化的行为。"},"examples":[{"en":"Overmystifying can confuse beginners and slow learning.","zh":"过度神秘化会让初学者更困惑，学习更慢。"},{"en":"There’s a lot of overmystifying around investing; the basics are straightforward.","zh":"关于投资有很多过度神秘化；其实基础并不难。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “overmystify”: to make something seem overly mysterious or complicated.","zh":"“overmystify”的现在分词：把某事说得过于神秘或复杂。"},"examples":[{"en":"He’s overmystifying what happened instead of giving the facts.","zh":"他没有讲事实，反而把发生的事说得太神秘了。"},{"en":"People online are overmystifying this research study.","zh":"网上的人在把这项研究说得过于玄乎。"}]}],"synonyms":["overcomplicating","making it sound mysterious","needlessly mystifying","overthinking","overanalyzing"],"phonetic":"/ˌoʊvɚˈmɪstɪˌfaɪɪŋ/","extraExplanation":["“over-”表示“过度、过分”（如 overthink 想太多、overcomplicate 过度复杂化）。因此 overmystify/overmystifying 常带有批评意味：本来可以讲清楚，却故意或无意讲得更玄、更难。","该词相对少见，更常见的表达是 overcomplicate（过度复杂化）、make it sound mysterious（把它说得很神秘）、mystify people unnecessarily（不必要地让人困惑）。"]}

