{"word":"overgaard","summary":{"en":"Overgaard is most commonly a Danish surname; it can also be a Scandinavian place/farm name.","zh":"Overgaard 最常见是丹麦姓氏；也可作斯堪的纳维亚地区的地名/农庄名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Danish surname (a family name).","zh":"一个丹麦姓氏（家族姓）。"},"examples":[{"en":"Dr. Overgaard will present the research findings today.","zh":"Overgaard 博士今天将展示研究结果。"},{"en":"I met someone named Overgaard at the conference.","zh":"我在会议上遇到一位叫 Overgaard 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (especially in Scandinavia), used for farms or small localities.","zh":"一个地名（尤指斯堪的纳维亚地区），常用于农庄或小聚居地的名称。"},"examples":[{"en":"They drove to Overgaard to visit family.","zh":"他们开车去 Overgaard 探亲。"},{"en":"Overgaard appears on some Danish maps as a small locality or farm name.","zh":"在一些丹麦地图上，Overgaard 会以小聚居地或农庄名称出现。"}]}],"phonetic":"ˈoʊvɚˌɡɑrd","extraExplanation":["“Overgaard”多见于丹麦语/挪威语背景的姓氏或地名。词形常被解释为“上面的/较高的（over/øver）+ 农场/庄园（gaard/ gård）”，大意类似“高处的农庄”。实际含义会因家族与地区而异。","拼写上有时会看到更接近北欧字母的形式（如 Øvergård / Øvergaard / Overgård 等），英语语境中通常用 Overgaard。"]}
{"word":"overgaiter","summary":{"en":"An overgaiter is a protective cover worn over footwear and the lower leg, especially to keep out snow, mud, or water.","zh":"overgaiter 指套在鞋/靴外、覆盖小腿下部的护腿套，常用于防雪、防泥或防水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protective covering worn over the shoe and lower leg (often over a boot) to keep out mud, snow, water, or to protect clothing.","zh":"（套在鞋或靴子外面、覆盖脚踝到小腿的）护腿套/鞋套，用于防泥、防雪、防水或保护裤腿。"},"examples":[{"en":"Hikers often wear overgaiters to keep snow from getting into their boots.","zh":"徒步者常穿护腿套，防止雪进入靴子里。"},{"en":"The soldier buckled his overgaiters before marching through the wet fields.","zh":"士兵在穿过潮湿的田地前把护腿套扣好。"}]}],"synonyms":["gaiter","legging (protective)","boot cover","snow gaiter"],"phonetic":"/ˈoʊvərˌɡeɪtər/","extraExplanation":["“gaiter”本身就是“绑腿/护腿套”，前缀 over- 在这里强调“套在外面、覆盖在上面”，所以 overgaiter 常指更外层的护腿套（尤其在军装或较正式的户外装备语境中）。在现代户外用品里，更常见的说法是 gaiters 或 snow gaiters。"]}
{"word":"overgalled","summary":{"en":"Overgalled means extremely irritated or offended, and more rarely it can mean badly chafed or rubbed raw.","zh":"Overgalled 指“极其恼怒/被冒犯”，较少见也可指“严重磨破/擦伤”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"very annoyed, upset, or offended; excessively irritated.","zh":"非常恼怒的；极其烦躁或被冒犯的。"},"examples":[{"en":"She was overgalled by the rude comment and left the meeting early.","zh":"她被那句粗鲁的评论气坏了，提前离开了会议。"},{"en":"He sounded overgalled when his work was criticized in public.","zh":"当他的工作在公开场合被批评时，他听起来非常恼火。"}]},{"partOfSpeech":"adj.","definition":{"en":"severely rubbed or chafed (especially about skin or a body part).","zh":"（尤指皮肤或身体部位）严重磨破的；擦伤的。"},"examples":[{"en":"After the long hike, his feet were overgalled by his new boots.","zh":"长途徒步后，他的脚被新靴子磨得很严重。"}]}],"synonyms":["irritated","vexed","indignant","offended","chafed"],"phonetic":"/ˌoʊvərˈɡɔld/","extraExplanation":["“overgalled”来自动词“to gall”（使恼怒；或把皮肤磨破）。前缀“over-”在这里表示“过度、非常”，所以语气比“galled”更强，带一点旧式/文学色彩，日常口语更常用“very annoyed / really irritated”。"]}
{"word":"overgamble","summary":{"en":"Overgamble means to gamble too much or take excessive risks.","zh":"overgamble 指过度赌博，或做出过高风险的冒险行为。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to gamble too much, or to risk more money/resources than is sensible (often leading to loss)","zh":"过度赌博；（不明智地）下太大的赌注，冒过高的风险（常导致亏损）"},"examples":[{"en":"He overgambled on one big bet and lost everything.","zh":"他在一笔大赌注上过度赌博，结果输得一干二净。"},{"en":"If you overgamble, you may end up in serious debt.","zh":"如果你过度赌博，可能会陷入严重债务。"},{"en":"The team overgambled by taking too many risks in the final minutes.","zh":"球队在最后几分钟冒了太多风险，有点“赌过头”了。"}]}],"synonyms":["gamble too much","take excessive risks","overbet","push your luck"],"phonetic":"/ˌoʊvɚˈɡæmbəl/","extraExplanation":["“overgamble”不是非常常见的标准词，更常见的写法是带连字符的“over-gamble”，意思与“gamble too much / take excessive risks”相同。","除了字面“赌博”，它也可比喻在投资、比赛策略、决策上“押得太大/太激进”，语气通常带批评或警告。"]}
{"word":"overgambled","summary":{"en":"“Overgambled” means someone gambled too much or beyond what was wise/affordable.","zh":"“overgambled”表示“赌博过度/赌过头”，常指超出明智或承受能力的赌博。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense of “overgamble”: to gamble too much, especially more money or more often than is wise, affordable, or safe.","zh":"“overgamble”的过去式：过度赌博；赌博过多（尤其是赌得超过自己承受能力或不明智地频繁下注）。"},"examples":[{"en":"He overgambled and lost his rent money.","zh":"他赌过头了，把房租钱都输掉了。"},{"en":"They overgambled during the trip and had to cut other expenses.","zh":"他们旅行时赌博过度，只好削减其他开支。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective (informal): having gambled too much; financially or emotionally hurt because of excessive gambling.","zh":"作形容词用（非正式）：赌过头的；因过度赌博而在经济或情绪上受损的。"},"examples":[{"en":"By the end of the night, he looked tired and overgambled.","zh":"到晚上结束时，他看起来又累又像是赌过头了。"}]}],"synonyms":["gambled too much","overdid it","bet too much","went overboard"],"phonetic":"/ˌoʊvɚˈɡæmbəld/","extraExplanation":["这个词由前缀 over-（“过度、超过”）+ gamble（赌博）组成，意思直观：把赌博做得“太多”。在日常英语中更常见的表达是 “gambled too much” 或 “overdid it with gambling”。","如果你在正式写作里使用，建议根据语境改成更常见、明确的说法（例如：“He gambled beyond his means.” 他超出自己能力去赌博）。"]}
{"word":"overgambling","summary":{"en":"Overgambling means gambling too much, in a way that can cause harm.","zh":"overgambling 指过度赌博，可能带来负面后果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive gambling, especially when someone bets too often or too much money and risks harm (debt, stress, addiction).","zh":"过度赌博；指赌博频率或下注金额过高，可能带来负面后果（债务、压力、成瘾等）。"},"examples":[{"en":"Overgambling can quickly turn a fun night into serious debt.","zh":"过度赌博可能很快把一场娱乐之夜变成严重负债。"},{"en":"He realized his overgambling was affecting his family and decided to seek help.","zh":"他意识到自己的过度赌博正在影响家庭，于是决定寻求帮助。"},{"en":"Many casinos post warnings about overgambling and provide support resources.","zh":"许多赌场会张贴关于过度赌博的警示，并提供支持资源。"}]},{"partOfSpeech":"adj.","definition":{"en":"gambling too much or for too long; betting beyond what is safe or sensible.","zh":"赌博过度的；指赌得太多、太久，或下注超出安全/理智范围的。"},"examples":[{"en":"An overgambling habit often starts with small bets that grow over time.","zh":"过度赌博的习惯往往从小额下注开始，逐渐越赌越大。"},{"en":"They set limits to avoid overgambling on weekends.","zh":"他们设定限额，以避免周末过度赌博。"}]}],"synonyms":["excessive gambling","problem gambling","compulsive gambling","gambling addiction"],"phonetic":"/ˌoʊvɚˈɡæmbəlɪŋ/","extraExplanation":["“over-” 是英语里表示“过度、超过正常范围”的前缀（如 overeat 暴饮暴食、overwork 过度工作）。因此 overgambling 通常强调“超过可承受/可控制”的赌博行为。","日常更常见的说法包括 problem gambling（问题赌博）、compulsive gambling（强迫性赌博）和 gambling addiction（赌博成瘾）。在公共健康或咨询语境中，这些词更正式。"]}
{"word":"overgang","summary":{"en":"Overgang is a Dutch/Afrikaans word meaning “transition,” “crossing/passage,” or (in Dutch) “menopause,” and it’s not standard everyday English.","zh":"Overgang 是荷兰语/南非荷兰语词，常指“过渡/转变”“穿越处/通道”，在荷兰语里还可指“更年期”；并非标准英语常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Borrowed from Dutch/Afrikaans; not a standard everyday English word.) A transition or change from one state, place, or period to another.","zh":"（源自荷兰语/南非荷兰语；并非标准英语常用词）过渡；转变；从一种状态/地点/时期到另一种的变化。"},"examples":[{"en":"In the Dutch text, “overgang” describes the overgang from winter to spring.","zh":"在那段荷兰语文本里，“overgang”指从冬天到春天的过渡。"},{"en":"The report focuses on the overgang to renewable energy.","zh":"该报告重点讨论向可再生能源的转型/过渡。"}]},{"partOfSpeech":"other","definition":{"en":"(In Dutch) A crossing or passage, such as a pedestrian crossing or a passageway.","zh":"（荷兰语中）穿越处；通道；（如）人行横道/过街处。"},"examples":[{"en":"Turn left at the railway overgang.","zh":"在铁路道口/穿越处左转。"},{"en":"There is an overgang for pedestrians near the station.","zh":"车站附近有一处行人过街通道。"}]},{"partOfSpeech":"other","definition":{"en":"(In Dutch) Menopause; the transition period when menstrual cycles end.","zh":"（荷兰语中）更年期；绝经期。"},"examples":[{"en":"She read a book about the overgang and its symptoms.","zh":"她读了一本关于更年期及其症状的书。"},{"en":"Hot flashes can happen during the overgang.","zh":"更年期期间可能会出现潮热。"}]}],"synonyms":["transition","changeover","crossing","passage","menopause"],"phonetic":"ˈoʊvərˌɡɑŋ","extraExplanation":["“overgang”在荷兰语里是很常见的词：既可指抽象的“过渡/转变”，也可指具体的“道口/通道”。在医疗或日常语境中，它还常直接指“更年期”。","如果你是在英语材料里看到“overgang”，通常是因为作者引用/翻译荷兰语（或南非荷兰语）来源；在纯英语写作中更常用 transition、crossing、menopause 来表达对应意思。"]}
{"word":"overgarment","summary":{"en":"An item of clothing worn over other clothes (an outer layer).","zh":"穿在其他衣服外面的外层衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of clothing worn over other clothes, especially for warmth, protection, or as an outer layer (e.g., a coat or jacket).","zh":"穿在其他衣服外面的衣物，常用于保暖、防护或作为外层（如外套、夹克）。"},"examples":[{"en":"In winter, an overgarment like a coat is essential.","zh":"冬天里，像大衣这样的外穿衣物是必需的。"},{"en":"She put on an overgarment before going outside in the rain.","zh":"她出门淋雨前先穿上了一件外层衣物。"}]}],"synonyms":["outerwear","coat","jacket","overcoat","cloak"],"phonetic":"/ˈoʊvərˌɡɑrmənt/","extraExplanation":["“overgarment”是一个较偏正式、概括性的词，常用于说明“外层衣物”这一类别；日常口语里更常直接说 coat, jacket, outerwear。","在服装语境中，它强调“穿在外面的一层”，不一定像“coat”那样具体指某一种款式。"]}
{"word":"overgarnish","summary":{"en":"Overgarnish means to add too much garnish or decoration, especially to food.","zh":"overgarnish 指（尤其对食物）加太多点缀或装饰，显得过度。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add too many decorations, toppings, or details to food or something presented (so it looks messy, distracting, or less tasteful)","zh":"（在食物或呈现的事物上）过度装饰／加太多点缀，使之显得杂乱、分散注意力或不够得体"},"examples":[{"en":"The salad was fresh, but they overgarnished it with too many herbs and sauces.","zh":"沙拉很新鲜，但他们加了太多香草和酱汁，点缀过头了。"},{"en":"Try not to overgarnish the dessert—one mint leaf is enough.","zh":"甜点别装饰过头——一片薄荷叶就够了。"},{"en":"The chef warned the trainees not to overgarnish plates because the main ingredients should stand out.","zh":"主厨提醒学员别把盘子装饰过头，因为主食材才应该是重点。"}]}],"synonyms":["overdecorate","overdo","embellish too much","go overboard (with the garnish)"],"phonetic":"/ˌoʊvərˈɡɑrnɪʃ/","extraExplanation":["“over-” 是英语里常见的前缀，表示“过度、超过需要”。所以 overgarnish 直观地就是“garnish（点缀）过头”。","这个词不算非常常见，更常见的表达有：overdecorate（过度装饰）、go overboard with the garnish（配菜/点缀加得太夸张）。在烹饪语境里会更自然。"]}
{"word":"overgarrison","summary":{"en":"Overgarrison means to station too many troops or guards in a place.","zh":"overgarrison 指在某地驻军或部署守卫力量过多。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to station too many soldiers or guards in a place; to provide a fort, town, or building with an excessive military presence","zh":"（在某地）驻军过多；以过量兵力驻守（城堡、城镇或建筑）"},"examples":[{"en":"The general worried that they had overgarrisoned the capital and left the border weak.","zh":"将军担心首都驻军过多，反而使边境变得薄弱。"},{"en":"After the riots, officials overgarrisoned the city center, which increased tension with residents.","zh":"骚乱之后，官员在市中心部署了过多警戒力量，反而加剧了与居民的紧张关系。"}]}],"synonyms":["overstaff (with troops)","overman","overdeploy","oversupply (with troops)"],"phonetic":"/ˌoʊvɚˈɡærɪsən/","extraExplanation":["这个词由 over-（“过度、太多”）+ garrison（“驻军；驻守部队”）构成，多用于军事或历史写作，也可引申到“安保力量/警力布置过多”的语境。"]}
{"word":"overgaze","summary":{"en":"Overgaze is a rare verb meaning either to stare too long/intensely or (poetically) to gaze out over a wide view.","zh":"Overgaze 是个少见的动词，常指“盯着看太久/太专注”，也可（较诗意地）指“眺望、远望”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to look at someone or something for too long or too intensely (often making them uncomfortable); to stare","zh":"过久或过于专注地盯着某人/某物看（常让人不舒服）；凝视、盯视"},"examples":[{"en":"It’s rude to overgaze at strangers on the subway.","zh":"在地铁上一直盯着陌生人看是不礼貌的。"},{"en":"She felt uneasy because he kept overgazing at her during the meeting.","zh":"会议期间他一直盯着她看，让她感到不自在。"}]},{"partOfSpeech":"vi.","definition":{"en":"(poetic/rare) to gaze over a wide area; to look out across something","zh":"（诗意/少见）眺望；向远处或广阔区域望去"},"examples":[{"en":"From the hilltop, they overgazed the valley in silence.","zh":"他们从山顶静静地眺望山谷。"},{"en":"He stepped outside to overgaze the dark sea.","zh":"他走到外面，眺望漆黑的大海。"}]}],"synonyms":["stare","gaze","gawk","ogle","look out over"],"phonetic":"/ˌoʊvɚˈɡeɪz/","extraExplanation":["“overgaze”在现代英语里非常少见，更多带一点文学/诗歌色彩。日常表达更常用：stare（盯着看）、gawk（呆看/傻盯着看，含不礼貌）、ogle（色眯眯地看）、look out over（眺望）。","词形上可理解为 over-（过度/在……之上）+ gaze（凝视/注视），因此常见含义要么是“看得过度”，要么是“向外/向上眺望”。"]}
{"word":"overgeneral","summary":{"en":"Overgeneral means to draw conclusions that are too broad based on limited cases.","zh":"Overgeneral 指根据有限情况得出过于笼统的结论（过度概括）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a general statement that is too broad, so it is not accurate for every case","zh":"过度概括；把结论说得太笼统，以致并不适用于所有情况"},"examples":[{"en":"It’s easy to overgeneral from one bad experience and assume the whole city is unsafe.","zh":"人很容易从一次糟糕的经历过度概括，进而以为整座城市都不安全。"},{"en":"Don’t overgeneral—two late deliveries don’t mean the company is always unreliable.","zh":"别过度概括——两次送货迟到并不代表这家公司一直都不靠谱。"}]},{"partOfSpeech":"vt.","definition":{"en":"to apply a rule or idea too widely, especially when thinking or reasoning","zh":"（在思考/推理中）把规则或观点套用得过广"},"examples":[{"en":"Students sometimes overgeneral a grammar rule and use it in situations where it doesn’t fit.","zh":"学生有时会把语法规则过度泛化，在不适用的场合也照用。"},{"en":"If we overgeneral from a small sample, our conclusions will be misleading.","zh":"如果我们根据很小的样本过度概括，结论就会具有误导性。"}]}],"synonyms":["overgeneralize","generalize too broadly","jump to conclusions","make sweeping statements"],"phonetic":"/ˌoʊvərˈdʒɛnərəl/","extraExplanation":["“overgeneral”在日常英语里不如“overgeneralize”常见，但意思非常接近：都是“把个别情况当成普遍规律”。在心理学语境中，overgeneralization（过度概括）常被提到，例如：一次失败就得出“我什么都做不好”的结论。","常见搭配：overgeneral from…（从……过度概括）；overgeneral about…（对……过度概括）。写作或辩论中，可以用来提醒对方结论范围太大。"]}
{"word":"overgeneralization","summary":{"en":"Overgeneralization means drawing a broad conclusion from limited evidence, often using “always/never” thinking.","zh":"Overgeneralization 指从有限证据得出过于宽泛的结论，常表现为“总是/从不”的绝对化思维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mistake in thinking where you form a broad rule or conclusion from too little evidence (often from one or a few experiences).","zh":"（思维上的）过度概括：根据太少的证据（常来自一两次经历）就得出过于宽泛的结论的错误。"},"examples":[{"en":"After one rude comment, she made an overgeneralization that everyone in the class was unfriendly.","zh":"因为一句粗鲁的话，她就过度概括，认为班里所有人都不友善。"},{"en":"Saying “I always fail at math” is an overgeneralization based on a few bad tests.","zh":"说“我数学总是不行”是根据几次考砸就做出的过度概括。"}]},{"partOfSpeech":"n.","definition":{"en":"In psychology and cognitive therapy, a thinking pattern (a cognitive distortion) where a single negative event is seen as a never-ending pattern.","zh":"（心理学/认知治疗中）一种认知偏差：把一次负面事件看成“总是如此”的长期模式。"},"examples":[{"en":"In therapy, he learned to challenge overgeneralization by replacing “always” and “never” statements with specific facts.","zh":"在治疗中，他学会通过用具体事实替换“总是/从不”的说法来反驳过度概括。"},{"en":"Her overgeneralization turned one rejection into the belief that she would never be accepted anywhere.","zh":"她的过度概括把一次拒绝变成了“我哪里都不会被接纳”的信念。"}]}],"synonyms":["hasty generalization","sweeping generalization","overstatement","jumping to conclusions"],"phonetic":"/ˌoʊvərˌdʒɛnərəlaɪˈzeɪʃən/","extraExplanation":["“overgeneralization”常见于写作与辩论中，用来指出对方以偏概全（类似谬误中的“hasty generalization / 草率概括”）。日常表达里也常说：Don’t generalize / That’s a generalization。","识别线索：句子里常出现绝对化词语，如 “always, never, everyone, no one”。把这些词换成更准确的范围（some, sometimes, a few, in this case）通常能避免过度概括。"]}
{"word":"overgeneralize","summary":{"en":"Overgeneralize means to draw conclusions that are too broad or not well-supported.","zh":"overgeneralize 指“以偏概全/过度概括”，得出过于宽泛或缺乏依据的结论。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To make a statement, rule, or conclusion that is too broad, applying it to more people or situations than is reasonable.","zh":"以偏概全；过度概括（把某个结论或规则不合理地套用到太多人或太多情况上）。"},"examples":[{"en":"It’s easy to overgeneralize from one bad experience.","zh":"人们很容易从一次糟糕的经历就以偏概全。"},{"en":"Don’t overgeneralize—one student’s mistake doesn’t mean the whole class is careless.","zh":"别过度概括——一个学生的错误不代表全班都粗心。"},{"en":"The article overgeneralizes about immigrants based on a few stories.","zh":"那篇文章根据少数案例就对移民做了过度概括。"}]}],"synonyms":["generalize too much","oversimplify","make a sweeping statement","jump to conclusions"],"phonetic":"/ˌoʊvərˈdʒɛnərəˌlaɪz/","extraExplanation":["“Over-”表示“过度/太多”，所以 overgeneralize 比 generalize 语气更负面，强调“概括得不恰当”。","常见搭配：overgeneralize from…（从……就以偏概全）；overgeneralize about…（对……一概而论）。","在写作与讨论中，避免 overgeneralize 的方法之一是加限定词：often / sometimes / in some cases（经常/有时/在某些情况下），或说明样本范围（based on a small sample）。"]}
{"word":"overgeneralized","summary":{"en":"Overgeneralized means too broad and not precise, often ignoring exceptions; in language learning it also means applying a rule too widely (e.g., “goed”).","zh":"overgeneralized 指“过度概括、过于笼统”，常忽略例外；在语言学习中也指把规则套用过头（如把 go 说成 goed）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too broad or too general; describing something in a way that ignores important differences or exceptions.","zh":"过度概括的；把情况说得太笼统，忽略重要差异或例外。"},"examples":[{"en":"The article was criticized for being overgeneralized and not backed by enough data.","zh":"这篇文章被批评过度概括，而且缺乏足够的数据支持。"},{"en":"Saying “all teenagers are lazy” is an overgeneralized statement.","zh":"说“所有青少年都懒”就是一种过度概括的说法。"}]},{"partOfSpeech":"adj.","definition":{"en":"In language learning, applying a rule too widely, creating forms that sound logical but are not correct in standard English.","zh":"（语言学习中）过度类推：把语法规则套用得太广，产生看似合理但不符合标准英语的形式。"},"examples":[{"en":"A child’s “goed” is an overgeneralized past tense of “go.”","zh":"孩子说“goed”是把“go”的过去式规则过度类推了。"},{"en":"Learners sometimes make overgeneralized forms like “informations,” even though “information” is uncountable.","zh":"学习者有时会造出像“informations”这样的过度类推形式，尽管“information”是不可数名词。"}]}],"synonyms":["too broad","oversimplified","sweeping","blanket","generalized","not nuanced"],"phonetic":"ˌoʊvərˈdʒɛnərəˌlaɪzd","extraExplanation":["“overgeneralized”来自动词“overgeneralize（过度概括）”的过去分词/形容词用法。日常写作里常用来评价观点或结论：太笼统、证据不足、没有考虑反例。","在心理学与沟通中，“overgeneralization（过度概括）”也常指把一次或少数经历扩大为“总是/从不”的结论，例如：“我一次失败了，所以我永远都不行。” 这类表达在英语里常被建议改得更具体。"]}
{"word":"overgeneralizes","summary":{"en":"Overgeneralizes means makes an overly broad, often inaccurate conclusion from limited examples.","zh":"overgeneralizes 指根据少量例子就以偏概全，得出过于宽泛、常常不准确的结论。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a statement or rule that is too broad, based on too few examples, so it becomes inaccurate","zh":"根据太少的例子就下结论，把规律或说法说得过于宽泛，从而不准确"},"examples":[{"en":"He overgeneralizes from one bad experience and says the whole city is unsafe.","zh":"他因为一次不好的经历就以偏概全，说整个城市都不安全。"},{"en":"Don’t overgeneralize—some students prefer quiet, but others learn best through discussion.","zh":"别一概而论——有些学生喜欢安静，但也有人通过讨论学得最好。"}]},{"partOfSpeech":"v.","definition":{"en":"(in psychology or everyday thinking) to apply a negative belief too widely, often using words like “always” or “never”","zh":"（心理学或日常思维中）把消极信念过度扩展，常用“总是/从不”等绝对化措辞"},"examples":[{"en":"After one mistake, she overgeneralizes and thinks, “I’m always messing things up.”","zh":"犯了一次错后，她就过度概括，觉得“我总是把事情搞砸”。"},{"en":"The counselor helped him stop overgeneralizing and focus on specific situations.","zh":"咨询师帮助他停止过度概括，把注意力放回到具体情境上。"}]}],"synonyms":["generalize too much","overstate","make sweeping statements","jump to conclusions","paint with a broad brush"],"phonetic":"ˌoʊvɚˈdʒɛnɚəˌlaɪz","extraExplanation":["“Overgeneralize”由 over-（过度）+ generalize（概括）构成。常见写法是 overgeneralize / over-generalize，两者意思相同。","在写作与讨论中，常用提示是避免绝对化词汇（always, never, everyone, no one），并用数据、范围词（often, some, many, in some cases）或具体条件来限定结论，会更准确、更有说服力。"]}
{"word":"overgeneralizing","summary":{"en":"Overgeneralizing means drawing overly broad conclusions from limited evidence, often in a negative, “always/never” way.","zh":"overgeneralizing 指依据有限证据做出过于宽泛的结论，常带“总是/从不”的负面一概而论。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making a statement or conclusion that is too broad, based on too few examples","zh":"以太少的例子做出过于宽泛的结论；过度概括"},"examples":[{"en":"You’re overgeneralizing from one bad experience.","zh":"你在根据一次不好的经历做过度概括。"},{"en":"Overgeneralizing can make a problem feel bigger than it really is.","zh":"过度概括会让问题看起来比实际更严重。"}]},{"partOfSpeech":"v.","definition":{"en":"(in psychology) treating one negative event as proof that the same thing will always happen","zh":"（心理学）把一次负面事件当作“以后永远都会这样”的证据"},"examples":[{"en":"After failing one test, he started overgeneralizing: “I’m terrible at everything.”","zh":"一次考试没考好后，他开始过度概括：“我什么都不行。”"},{"en":"Therapy often helps people notice and challenge overgeneralizing thoughts.","zh":"心理治疗常帮助人们觉察并挑战“过度概括”的想法。"}]}],"synonyms":["jumping to conclusions","making sweeping statements","oversimplifying","exaggerating","overextending"],"phonetic":"/ˌoʊvərˈdʒɛnərəˌlaɪzɪŋ/","extraExplanation":["“Overgeneralize”= generalize（概括）+ over-（过度）。一般的“generalize”是从足够多的事实中提炼规律；“overgeneralize”则带有批评意味，表示证据不足却下结论。","常见信号词：always / never / everyone / no one（总是/从不/所有人/没人）。出现这些词时，很可能是在过度概括。","可替换表达：jump to conclusions（草率下结论）、make a sweeping statement（做出一概而论的说法）。"]}
{"word":"overgenerally","summary":{"en":"“Overgenerally” means describing or speaking in a way that is too general and not specific enough.","zh":"“overgenerally”表示“说/写得过于笼统，不够具体”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too general; without enough specific detail.","zh":"过于笼统地；泛泛地（缺少必要的具体细节）。"},"examples":[{"en":"The report describes the problem overgenerally and doesn’t explain what happened in each case.","zh":"这份报告把问题说得过于笼统，没有解释每个案例具体发生了什么。"},{"en":"If you speak overgenerally, people may misunderstand your point.","zh":"如果你说得过于笼统，别人可能会误解你的意思。"}]}],"synonyms":["too generally","overly generally","in overly broad terms","too broadly"],"phonetic":"ˌoʊvərˈdʒɛnərəli","extraExplanation":["“over-”在英语里常表示“过度、超过适当程度”（如: overconfident 过度自信）。因此 overgenerally 的语气通常带批评：不是“概括”，而是“概括得过头，失去有效信息”。","这个词比较少见，写作中更常用的表达有：too generally, overly general(ly), in overly broad terms 等。"]}
{"word":"overgenerosity","summary":{"en":"Overgenerosity means being too generous in a way that may cause trouble or discomfort.","zh":"overgenerosity 指“过度慷慨”，即大方到不合适、可能引发麻烦或让人不舒服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit or act of being too generous, especially in a way that causes problems (for yourself or others)","zh":"过度慷慨；过分大方（尤其指这种大方会给自己或他人带来麻烦）"},"examples":[{"en":"His overgenerosity left him short of money at the end of the month.","zh":"他过度慷慨，结果月底手头很紧。"},{"en":"Sometimes overgenerosity can make people feel uncomfortable or pressured to repay you.","zh":"有时过度慷慨会让别人不自在，甚至觉得被迫要回报你。"},{"en":"The charity appreciated her support, but her overgenerosity worried her family.","zh":"慈善机构很感激她的支持，但她家人却担心她过分大方。"}]}],"synonyms":["excessive generosity","overgiving","self-sacrificing generosity"],"phonetic":"/ˌoʊvərˌdʒɛnəˈrɑsəti/","extraExplanation":["“over-”是英语里常见的前缀，表示“过度、超出适当范围”。因此 overgenerosity 的重点不是“慷慨本身不好”，而是“慷慨到不合适、带来负面后果”。","在语气上，它常带轻微批评或担忧：例如担心财务负担、被人利用、让受帮助者有压力等。"]}
{"word":"overgenerous","summary":{"en":"“Overgenerous” means giving more than is reasonable or appropriate.","zh":"“overgenerous”指“过于慷慨”，给得超过合理或合适的程度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More generous than is reasonable or appropriate; giving too much (money, help, praise, etc.).","zh":"过于慷慨的；给得太多（钱、帮助、赞美等），以至于不太合适。"},"examples":[{"en":"The tip was overgenerous for such a small order.","zh":"对这么小的订单来说，小费给得过于慷慨。"},{"en":"She was overgenerous with compliments, so it didn’t feel completely sincere.","zh":"她夸奖得有点过头，所以听起来不太真诚。"},{"en":"His overgenerous donation left him short on rent.","zh":"他捐得太多，结果房租不够了。"}]}],"synonyms":["overly generous","too generous","excessively generous"],"phonetic":"/ˌoʊvɚˈdʒɛnɚəs/","extraExplanation":["“over-”这个前缀常表示“过度、过分”（如 overconfident 过于自信、overprotective 过度保护）。因此 overgenerous 往往带一点“好心但不够理性/不合时宜”的语气，可能暗示造成不便、压力或不真实的感觉。","在实际表达中也常用 too generous / overly generous。不同场景里，overgenerous 可能是委婉的批评：既承认“慷慨”，又提醒“过头了”。"]}
{"word":"overgenerously","summary":{"en":"“Overgenerously” means “too generously,” more than is reasonable or needed.","zh":"“overgenerously”表示“过分慷慨地”，给得比合理或必要的更多。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too generous; giving more money, help, praise, or credit than is reasonable or necessary.","zh":"过分慷慨地；给出（金钱、帮助、赞美或功劳）多到不合理或不必要的程度。"},"examples":[{"en":"The review overgenerously praised the film, ignoring its obvious flaws.","zh":"那篇影评过分地称赞了这部电影，忽视了它明显的缺点。"},{"en":"He overgenerously offered to pay for everyone’s dinner, and later regretted it.","zh":"他过分慷慨地提出要请所有人吃饭，后来又后悔了。"},{"en":"The report overgenerously credited one person for work done by the whole team.","zh":"报告过分地把整个团队的成果归功于一个人。"}]}],"synonyms":["too generously","overly generously","excessively","unduly"],"phonetic":"/ˌoʊvɚˈdʒɛnɚəsli/","extraExplanation":["“overgenerously”由 over-（过度）+ generously（慷慨地）构成，带有轻微批评意味：强调“好意过头”，可能导致不公平、浪费或让人有压力。","常见搭配：overgenerously praised/credited/paid/compensated（过分赞美/过分归功于/付得太多/补偿过多）。"]}
{"word":"overgenerousness","summary":{"en":"Overgenerousness means excessive generosity—giving more than is wise or appropriate.","zh":"Overgenerousness 指“过度慷慨”，即给予超过明智或合适的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too generous; giving more money, time, help, or praise than is sensible or appropriate","zh":"过度慷慨；给出金钱、时间、帮助或赞美多到不合理或不恰当的程度"},"examples":[{"en":"His overgenerousness left him short of money at the end of the month.","zh":"他的过度慷慨让他月底手头很紧。"},{"en":"She appreciated his kindness, but his overgenerousness sometimes made her uncomfortable.","zh":"她很感激他的好意，但他的过度慷慨有时让她不自在。"},{"en":"The charity warned donors that overgenerousness can lead to burnout.","zh":"该慈善机构提醒捐助者，过度慷慨可能会导致身心倦怠。"}]}],"synonyms":["excessive generosity","overkindness","too much giving","self-sacrifice (sometimes)"],"phonetic":"/ˌoʊvɚˈdʒɛnərəsnəs/","extraExplanation":["“over-”这个前缀常表示“过度、超过合理范围”，所以 overgenerousness 通常带有轻微负面含义：不是在批评善良本身，而是在提醒“太多”可能造成问题（例如经济压力、被人利用或情感负担）。","在语气上，它比 generosity（慷慨）更强调“不合适的程度”，常用于建议更健康的界限（set boundaries）。"]}
{"word":"overgenial","summary":{"en":"“Overgenial” means excessively friendly or cheerful, often in a way that seems forced or insincere.","zh":"“overgenial”指过分热情或客气，常给人刻意、讨好或不真诚的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too friendly, cheerful, or polite in a way that can feel forced, insincere, or trying to please.","zh":"过分热情/过分客气（让人觉得刻意、讨好或不真诚）。"},"examples":[{"en":"His overgenial smile made the apology feel less believable.","zh":"他那过分热情的笑容让道歉显得不太可信。"},{"en":"The salesperson was so overgenial that I wanted to leave the store.","zh":"推销员热情得有点过头，我都想离开店里了。"},{"en":"She kept an overgenial tone during the meeting, even when everyone else was serious.","zh":"即使其他人都很严肃，她在会议上仍保持着过分亲切的语气。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Very friendly and pleasant; extremely genial.","zh":"（较少见）非常和蔼可亲、非常友善。"},"examples":[{"en":"At family gatherings, he was overgenial and quick to welcome newcomers.","zh":"在家庭聚会上，他非常和蔼，总是很快欢迎新来的人。"}]}],"synonyms":["overly friendly","ingratiating","smarmy","syrupy","too affable"],"phonetic":"ˌoʊvərˈdʒinjəl","extraExplanation":["“overgenial”由 over-（过度）+ genial（和蔼、友好）构成。现代英语里常带一点负面评价，强调“热情过头、让人不自在”，常用于描写服务场景、职场社交或刻意讨好的态度。","语体偏书面/文学化，不算高频口语词；日常更常用的表达有：too friendly, overly friendly, fake-friendly, syrupy, ingratiating。"]}
{"word":"overgeniality","summary":{"en":"Overgeniality means being excessively friendly or cheerful in a way that may seem forced or insincere.","zh":"overgeniality 指过度友善或过分热情，常给人做作或不真诚的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive friendliness, warmth, or cheerfulness that can feel forced, insincere, or inappropriate.","zh":"过度的友善/热情/和气，往往让人觉得做作、不真诚或不合时宜。"},"examples":[{"en":"His overgeniality in the interview came across as rehearsed rather than genuine.","zh":"他在面试中过度的热情让人觉得像排练过的，并不真诚。"},{"en":"The salesperson’s overgeniality made the customer uneasy.","zh":"销售员过分的热络让顾客感到不自在。"}]}],"synonyms":["excessive friendliness","overfriendliness","forced cheer","insincerity","ingratiation"],"phonetic":"/ˌoʊvərˌdʒiːniˈælɪti/","extraExplanation":["“overgeniality”是由前缀 over-（过度）+ genial（和蔼的、友好的）+ 名词后缀 -ity 组成，强调“友好到过头”。在语气上常带有轻微批评，暗示这种友善可能是策略性的（例如推销、社交场合刻意拉近距离）。","它比较少见，更常见的表达包括：excessive friendliness（过度友善）、over-friendliness（过分友好）、forced cheer（强装的愉快）、ingratiating warmth（讨好式的热情）。"]}
{"word":"overgenially","summary":{"en":"“Overgenially” means “too friendly/cheerful,” often in a way that feels unnatural or inappropriate.","zh":"“overgenially”指“过于友善/热情/愉快”，常带有“有点不自然或不合时宜”的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively friendly, warm, or cheerful way—so much that it may feel forced, insincere, or inappropriate for the situation.","zh":"以过于友好、热情或愉快的方式（到了让人觉得做作、不真诚或不合时宜的程度）。"},"examples":[{"en":"The salesman spoke overgenially, as if we were old friends, which made me cautious.","zh":"推销员说话过分热络，好像我们是老朋友一样，这让我更警惕。"},{"en":"Her email sounded overgenially upbeat for such serious news.","zh":"对于这么严肃的消息，她的邮件语气却过于轻快热情。"}]}],"synonyms":["overly warmly","overly friendly","too cheerfully","effusively"],"phonetic":"/ˌoʊvərˈdʒiniəli/","extraExplanation":["“over-”表示“过度、太……”。“genially”来自“genial”（和蔼的、亲切的），所以“overgenially”就是“亲切过头”。","这个词并不常见，很多场合更自然的说法是：“too warmly / overly friendly / in an overly cheerful way / a bit too chummy”。"]}
{"word":"overgenialness","summary":{"en":"Overgenialness means excessive friendliness or warmth, often to an uncomfortable or insincere degree.","zh":"Overgenialness 指“过度的友好或热情”，常暗示让人不自在或显得不真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being excessively friendly, cheerful, or warmly agreeable, sometimes in a way that feels forced or insincere","zh":"过度亲切（或过度和气、过分热情）的状态；有时会让人感觉刻意或不真诚"},"examples":[{"en":"Her overgenialness made new employees feel pressured to smile all the time.","zh":"她的过度亲切让新员工觉得被迫一直保持微笑。"},{"en":"I appreciated his help, but the overgenialness in his tone sounded like a sales pitch.","zh":"我感谢他的帮助，但他语气里的过度热情听起来像在推销。"},{"en":"The interview was polite, though his overgenialness felt a little performative.","zh":"面试很礼貌，但他的过度和气让人觉得有点像在表演。"}]}],"synonyms":["overfriendliness","excessive friendliness","too much warmth","forced cheerfulness","overcordiality"],"phonetic":"ˌoʊvərˈdʒiːniəl.nəs","extraExplanation":["这是一个比较少见的名词，来自 over-（“过度”）+ genial（“亲切友善的”）+ -ness（把形容词变成名词的后缀）。常用来带一点“过头了、让人不自在”的语气，而不只是单纯的“友好”。","genial 通常是褒义（亲切、和蔼），但加上 over- 之后常带轻微贬义或讽刺：强调“过分热络、像刻意讨好”。正式写作中也更常用 overfriendliness / excessive friendliness 来表达。"]}
{"word":"overgentle","summary":{"en":"Overgentle means “too gentle,” often suggesting excessive caution or softness.","zh":"overgentle 指“过于温和”，常暗示太软或太谨慎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too gentle or careful, sometimes to the point of being ineffective or overly cautious.","zh":"过于温和/小心的（有时温柔得不够有力，或过分谨慎）。"},"examples":[{"en":"The feedback was so overgentle that the team didn’t understand what needed to change.","zh":"反馈太过温和了，团队反而没弄清楚需要改什么。"},{"en":"He gave an overgentle apology that sounded polite but not very sincere.","zh":"他的道歉过于温和客气，听起来不太真诚。"}]}],"synonyms":["overly gentle","too gentle","overly cautious","soft","mild"],"phonetic":"/ˌoʊvɚˈdʒɛntəl/","extraExplanation":["“over-”是常见前缀，表示“过度/太……”。因此 overgentle 往往带一点批评意味：不是单纯的 gentle（温和），而是“温和过头”。","overgentle 不是特别常见的标准词，更常见的表达有 overly gentle / too gentle / overly cautious。正式写作里通常用 overly gentle。"]}
{"word":"overgently","summary":{"en":"“Overgently” means doing or saying something too gently or mildly, more than the situation calls for.","zh":"“overgently”表示“过于温和/轻柔地”，程度超过情境所需，常暗示因此不够明确或不够有力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too gentle, careful, soft, or mild—often more than the situation needs.","zh":"过于温和地；过分小心/轻柔地（常指比情况需要的更温和或更小心）。"},"examples":[{"en":"He criticized her overgently, so the message didn’t feel clear.","zh":"他批评她时过于温和，所以意思不够明确。"},{"en":"The doctor explained the risks overgently, and the patient didn’t realize how serious it was.","zh":"医生把风险讲得过于委婉，病人没有意识到有多严重。"},{"en":"She overgently refused, which made it sound like she might still say yes.","zh":"她拒绝得过于温柔，听起来像是还有可能答应。"}]}],"synonyms":["too gently","overly gently","too mildly","with excessive gentleness"],"phonetic":"/ˌoʊvɚˈdʒɛntli/","extraExplanation":["“over-”常表示“过度、过分”（too much），所以 overgently 通常带一点“因为太温和而不够有效/不够明确”的语气。","它不算特别常见，更常见的表达有：too gently / overly gently / with excessive gentleness。"]}
{"word":"overgesticulate","summary":{"en":"To gesture excessively while speaking.","zh":"说话时手势过多、动作过大。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To use too many or too large hand/arm movements while speaking, often in a way that looks exaggerated or distracting.","zh":"（讲话时）手势过多或动作过大，显得夸张甚至分散注意力。"},"examples":[{"en":"He tends to overgesticulate when he’s excited, so the audience watches his hands more than his slides.","zh":"他一激动就会手势特别多，观众看他的手都比看投影片多。"},{"en":"Try not to overgesticulate in the interview—small, natural gestures look more confident.","zh":"面试时尽量别手舞足蹈；小而自然的手势更显自信。"}]}],"synonyms":["gesticulate too much","wave one’s hands around","flail (one’s arms)"],"phonetic":"/ˌoʊvərˈdʒɛstɪˌkjuːleɪt/","extraExplanation":["“over-”表示“过度、超过适当程度”，因此 overgesticulate 带有“做过头”的评价色彩，常用于提醒某人的肢体动作太多、太夸张。","与 gesticulate（用手势表达）不同，overgesticulate 强调“过量”而不是“有手势”本身。常见于描述演讲、面试、课堂发言等正式场合的表现。"]}
{"word":"overgesticulated","summary":{"en":"“Overgesticulated” means someone used too many or overly large gestures while speaking (past tense) or describes a style that is overly gesture-heavy.","zh":"“Overgesticulated”指（过去）说话时手势过多/过夸张，或形容一种“手势过多”的表达风格。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, past tense) Made too many or too-large hand/arm movements while speaking, often so that it looked exaggerated or distracting.","zh":"（动词，过去式）说话时做了过多或过夸张的手势/肢体动作，常给人以夸大、分散注意力的感觉。"},"examples":[{"en":"Nervous during the interview, he overgesticulated and kept waving his hands.","zh":"面试时他很紧张，不由得过度打手势，一直挥舞着双手。"},{"en":"She overgesticulated to emphasize her point, and people started watching her hands instead of listening.","zh":"她为了强调观点而手势过多，大家反而开始看她的手而不是听她说。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Describing speech or behavior that uses too many gestures; overly animated.","zh":"（形容词）形容说话或行为手势太多；过于夸张、过度活跃的。"},"examples":[{"en":"His overgesticulated storytelling felt a bit theatrical.","zh":"他讲故事时手势过多，显得有点像在演戏。"},{"en":"The presentation was clear, but the speaker’s overgesticulated style distracted some listeners.","zh":"演讲内容很清楚，但演讲者过度的手势风格让一些听众分心。"}]}],"synonyms":["gestured too much","used excessive gestures","overacted (in gestures)","too animated"],"phonetic":"ˌoʊvərdʒɛˈstɪkjəˌleɪtɪd","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度/超过正常程度”。因此 overgesticulate 就是“gesticulate（打手势）+ over-（过度）”。在正式写作中也可以用更常见的表达，如 “used excessive gestures / gestured too much”。"]}
{"word":"overgesticulating","summary":{"en":"Overgesticulating means using exaggerated or excessive gestures while speaking.","zh":"Overgesticulating 指说话时手势或肢体动作过多、过夸张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"using too many or too-large hand and body movements while speaking, in a way that seems exaggerated or distracting","zh":"说话时手势或肢体动作过多或过夸张，以至于显得做作或分散注意力"},"examples":[{"en":"He was overgesticulating so much that people watched his hands instead of listening to his words.","zh":"他手舞足蹈得太厉害，大家反而只顾看他的手，没在听他说什么。"},{"en":"The teacher asked her to stop overgesticulating and speak more calmly.","zh":"老师让她别再夸张比划了，说话尽量平静一点。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of overgesticulating; using excessive gestures while talking (present participle of “overgesticulate”)","zh":"过度打手势、过度比划（overgesticulate 的现在分词形式）"},"examples":[{"en":"She kept overgesticulating as she explained the story.","zh":"她讲故事时一直在过度比划。"}]}],"synonyms":["overacting","gesturing wildly","being overly animated","flailing (arms)"],"phonetic":"/ˌoʊvərdʒɛˈstɪkjəˌleɪtɪŋ/","extraExplanation":["“Over-”表示“过度、太……”，所以 overgesticulating 带有负面或调侃意味：不是单纯“有手势”，而是“手势多到影响表达”。","不同文化对手势的接受度不同：有些场合（如演讲、戏剧）夸张动作可能是风格；但在正式会议或严肃讨论中，overgesticulating 往往被认为不够专业或让人分心。"]}
{"word":"overgesticulation","summary":{"en":"Overgesticulation means using too many or too dramatic gestures when speaking.","zh":"overgesticulation 指说话时手势过多或过于夸张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or overly dramatic use of hand and body gestures, especially while speaking.","zh":"（说话时）过度的手势或身体动作；动作夸张。"},"examples":[{"en":"His overgesticulation distracted the audience from what he was saying.","zh":"他过度的手势分散了观众对他说话内容的注意力。"},{"en":"In the presentation, try to avoid overgesticulation and keep your gestures purposeful.","zh":"做演讲时尽量避免手势过多，让动作更有目的性。"}]}],"synonyms":["excessive gesturing","overacting","exaggerated gestures","flailing (informal)"],"phonetic":"/ˌoʊvər dʒɛˌstɪkjəˈleɪʃən/","extraExplanation":["“Overgesticulation”由 over-（过度）+ gesticulation（做手势）构成，常用于评论某人的表达方式：动作太多、太夸张，反而影响沟通。","不同文化对手势的接受度差异很大：有些文化中丰富手势很自然，但在较“克制”的场合（如正式汇报、面试）可能会被看作不够稳重。"]}
{"word":"overgesticulative","summary":{"en":"“Overgesticulative” means someone uses too many gestures while speaking.","zh":"“overgesticulative”指说话时手势过多、动作过于夸张。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using too many hand or body movements while speaking; excessively gesticulative.","zh":"说话时手势或身体动作过多的；过度比手画脚的。"},"examples":[{"en":"His overgesticulative storytelling made the meeting feel more like a stage performance.","zh":"他讲故事时过度的手势让会议更像一场舞台表演。"},{"en":"Try to be less overgesticulative in formal presentations so the audience focuses on your message.","zh":"在正式演讲中尽量不要太过手舞足蹈，这样观众能更专注于你的内容。"}]}],"synonyms":["overly gesticulative","too animated","handsy (informal)","excessively expressive"],"phonetic":"/ˌoʊvɚ.dʒɛˈstɪk.jə.lə.tɪv/","extraExplanation":["这是一个较少见、偏描述性的形容词，通常用于评论某人“手势太多”。","构词上由前缀 over-（过度）+ gesticulate（打手势）+ -ive（形容词后缀）组成。日常更常用的说法是 overly gesticulative 或 simply “very animated / talks with his hands a lot”。"]}
{"word":"overgesticulatively","summary":{"en":"Overgesticulatively means doing or speaking with too many exaggerated gestures.","zh":"overgesticulatively 指“（说话/表达时）手势或肢体动作过多、过于夸张”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively or overly expressive way, especially by using too many hand or body movements while speaking.","zh":"以过度夸张的方式（尤指说话时手势或肢体动作太多、太用力）。"},"examples":[{"en":"He spoke overgesticulatively, waving his arms so much that it distracted everyone.","zh":"他说话时手势过多、过于夸张，挥舞手臂到让大家都分心了。"},{"en":"She presented the idea clearly, but a bit overgesticulatively for a formal meeting.","zh":"她把想法讲得很清楚，但在正式会议上肢体动作有点过于夸张。"}]}],"synonyms":["excessively","overly","too animatedly","with exaggerated gestures"],"phonetic":"/ˌoʊvərdʒɛˈstɪkjələtɪvli/","extraExplanation":["这个词由 over-（“过度”）+ gesticulate（“打手势、做手势表达”）+ -ly（副词后缀）组成。常带有轻微负面评价，暗示“动作太多、影响表达或显得不够专业”。","在写作中它比较少见，更常见的表达包括：too many gestures / excessively gesturing / in an overly animated way。"]}
{"word":"overgesticulativeness","summary":{"en":"Overgesticulativeness means using too many gestures while speaking.","zh":"overgesticulativeness 指说话时手势过多、动作过于夸张的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency or habit of using too many hand or body movements when speaking; excessive gesturing","zh":"说话时手势或身体动作过多的倾向；过度比划"},"examples":[{"en":"His overgesticulativeness made the presentation feel a bit distracting.","zh":"他过度的手势动作让演讲显得有点分散注意力。"},{"en":"In some cultures, what looks like overgesticulativeness is simply a normal speaking style.","zh":"在一些文化中，看起来像“手势太多”的表达方式其实只是正常的说话风格。"},{"en":"The director asked the actor to reduce the overgesticulativeness in the scene.","zh":"导演让演员在那场戏里减少过多的手势动作。"}]}],"synonyms":["excessive gesturing","overemphasis with gestures","flamboyant gesturing"],"phonetic":"/ˌoʊvərdʒɛˈstɪkjələtɪvnəs/","extraExplanation":["这个词比较少见，属于由 over-（“过度”）+ gesticulate（“打手势、做手势”）+ -iveness（名词后缀，表示“……的状态/倾向”）组合而成的抽象名词。日常更常用的说法是 “too much gesturing / excessive gesturing”。","“手势多”在跨文化交流里不一定是负面评价：有些地区（如地中海文化圈）手势丰富是常见的沟通方式；在更强调克制的语境里才更容易被看作 ‘over-’（过度）。"]}
{"word":"overget","summary":{"en":"“Overget” is not standard English. People usually mean “get over” (recover/overcome) or another common “over-” verb like overbuy/overspend.","zh":"“overget”不是标准英语。通常想表达“get over（克服/恢复）”，或用更常见的“over-”动词如overbuy/overspend等。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as a typo or a nonstandard/creative coinage.","zh":"不是标准英语单词；通常是拼写错误，或是非正式/创造性的自造词。"},"examples":[{"en":"I couldn’t find “overget” in a dictionary—did you mean “forget” or “get over” something?","zh":"我在词典里找不到“overget”——你是不是想写“forget（忘记）”或“get over（克服/走出）”？"}]},{"partOfSpeech":"v.","definition":{"en":"(Nonstandard, sometimes intended meaning) To get over something; to recover from a feeling, illness, or difficult experience.","zh":"（非标准用法，有时作者想表达的意思）走出/克服某事；从情绪、疾病或困难经历中恢复。"},"examples":[{"en":"It took her months to get over the breakup.","zh":"她花了好几个月才走出分手的阴影。"},{"en":"He’s still getting over the flu.","zh":"他还在从流感中恢复。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, nonstandard) To get too much of something; to overdo getting/collecting.","zh":"（罕见、非标准）得到得太多；获取/囤积过度。"},"examples":[{"en":"Don’t overbuy—just get what you need.","zh":"别买过量——买你需要的就行。"},{"en":"She tends to overcollect old magazines.","zh":"她常常会过度收集旧杂志。"}]}],"synonyms":["get over","recover","overdo","overbuy","overspend"],"phonetic":"ˌoʊvɚˈɡɛt","extraExplanation":["“over-”是常见前缀，表示“过度、超过（too much/excessively）”。但“overget”并不是常用搭配，所以母语者更可能说：\n- “get over” 表示“克服/走出/恢复”\n- “overbuy / overspend / overeat” 表示“买太多/花太多/吃太多”\n如果你提供原句，我可以帮你判断最自然的表达。"]}
{"word":"overgetting","summary":{"en":"“Overgetting” is a rare/old-fashioned word meaning “recovering” or “getting over something.”","zh":"“overgetting”是少见/较旧的用法，意思是“恢复、熬过去、走出困境”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) the act or process of getting over something; recovering from an illness, shock, or difficulty; overcoming a problem.","zh":"（少见/较旧用法）“熬过去、恢复过来”的过程；从疾病、打击或困难中恢复；克服问题。"},"examples":[{"en":"It took her months of overgetting after the accident.","zh":"事故后她花了好几个月才慢慢恢复过来。"},{"en":"His overgetting from the flu was slower than expected.","zh":"他从流感中恢复得比预期慢。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle/gerund of the rare verb “overget”: to get over (something), overcome, or recover.","zh":"罕见动词 overget 的现在分词/动名词：熬过（某事）、克服或恢复。"},"examples":[{"en":"She is still overgetting the disappointment.","zh":"她还在从那次失望中慢慢走出来。"}]}],"synonyms":["recovery","getting over","overcoming","healing"],"phonetic":"/ˌoʊvərˈɡɛtɪŋ/","extraExplanation":["“overgetting/overget”在现代英语里非常不常见，读者更常用、也更自然的表达是：getting over something（走出/克服）、recovering（恢复）、overcoming（克服）。","如果你是在写作或考试中使用，建议改成更常见的说法，以免被当作拼写错误或非标准用词。它在一些较旧或方言（如苏格兰英语）语境里偶尔可见。"]}
{"word":"overgifted","summary":{"en":"Overgifted can mean either overly showered with gifts/privileges or extremely talented, depending on context.","zh":"Overgifted 可指“被送太多礼物/过度优待”，也可指“天赋极高”，含义取决于语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"given too many gifts, benefits, or special treatment (often more than is necessary or fair)","zh":"被送了太多礼物/好处；受到过度优待（常含“过头了、不太公平”之意）"},"examples":[{"en":"The interns felt overgifted after the company kept sending them expensive freebies.","zh":"公司不断送实习生昂贵的赠品，让他们觉得自己被“送太多了”。"},{"en":"Some critics say celebrities can seem overgifted compared with ordinary workers.","zh":"有些批评者认为，相比普通劳动者，名人看起来受到过度优待。"}]},{"partOfSpeech":"adj.","definition":{"en":"having unusually many talents or very high ability; extremely gifted","zh":"天赋异常多、能力极强；非常有天赋的"},"examples":[{"en":"She was overgifted in music and languages, so she stood out in school.","zh":"她在音乐和语言方面天赋过人，所以在学校很突出。"},{"en":"He’s so overgifted that group projects can feel slow to him.","zh":"他能力强到离谱，做小组项目时会觉得进度很慢。"}]}],"synonyms":["spoiled","overindulged","pampered","showered (with gifts)","highly gifted","exceptionally talented"],"phonetic":"/ˌoʊvɚˈɡɪftɪd/","extraExplanation":["“overgifted”不是非常常见的标准词汇，更常见的表达是：for meaning 1 用 “spoiled / overindulged / showered with gifts”；for meaning 2 用 “highly gifted / exceptionally talented”。","前缀 “over-” 表示“过度、超过正常/需要的程度”。所以这个词往往带有评价色彩：要么暗示“给太多了”，要么强调“天赋多到夸张”。具体褒贬取决于语境。"]}
{"word":"overgild","summary":{"en":"Overgild means to decorate or praise something too much, especially when it’s already good.","zh":"overgild 指过度装饰或过分美化（尤其是本来已经很好的东西）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to gild too much; to cover something with too much gold (literally) or to decorate it so heavily that it becomes excessive (figuratively).","zh":"（字面）镀金过度；（比喻）装饰过头、过分粉饰。"},"examples":[{"en":"The frame was overgilded, so it looked gaudy instead of elegant.","zh":"这个画框镀金过度，所以看起来很俗气而不高雅。"},{"en":"Don’t overgild the story—keep it simple and honest.","zh":"别把故事过分粉饰——保持简单真实就好。"}]},{"partOfSpeech":"vt.","definition":{"en":"to try to improve something that is already good, often unnecessarily or in a way that makes it worse.","zh":"对本来已经很好的东西画蛇添足式“再加工”，常常多此一举，反而弄巧成拙。"},"examples":[{"en":"Her first draft was strong; adding more jokes would only overgild it.","zh":"她的初稿已经很有力了；再加更多笑话只会画蛇添足。"},{"en":"The original design was clean and modern, but extra ornaments overgilded it.","zh":"原本的设计简洁现代，但额外的装饰让它变得过度了。"}]}],"synonyms":["overdecorate","embellish","over-embellish","overpraise","gild the lily"],"phonetic":"/ˌoʊvərˈɡɪld/","extraExplanation":["“overgild”常让人想到莎士比亚《约翰王》(King John) 里的名句：“To gild refined gold, to paint the lily … is wasteful and ridiculous excess.” 意思是“给精炼的黄金再镀金、给百合再上色”，比喻对美好的事物再做多余的装饰，既浪费又可笑。现代用法里多用于比喻，强调‘过度修饰/画蛇添足’。"]}
{"word":"overgilded","summary":{"en":"Overgilded means excessively decorated or “too gilded,” often suggesting showiness or insincerity.","zh":"overgilded 指“装饰过度/镀金过多”，常带有“浮夸、不自然（甚至不真诚）”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with too much gold or decoration; overly ornate in a way that feels excessive or showy.","zh":"镀金过度的；装饰过头的（显得夸张、浮华）。"},"examples":[{"en":"The frame was overgilded, so the simple painting looked strangely flashy.","zh":"画框镀金过度，反而让那幅朴素的画显得莫名浮夸。"},{"en":"Her speech felt overgilded with praise and didn’t sound sincere.","zh":"她的发言被过度赞美“镀了一层金”，听起来不太真诚。"}]}],"synonyms":["overdecorated","ornate","gaudy","overembellished","showy"],"phonetic":"/ˌoʊvɚˈɡɪldɪd/","extraExplanation":["“over-”表示“过度、太多”，gild表示“给……镀金/装饰得华丽”。overgilded既可指实物“金饰过多”，也常用于比喻：把某件事说得太好、包装得太漂亮，反而显得不自然。","它和常见表达“to gild the lily”（多此一举、画蛇添足）语感接近：本来已经很好了，再加华丽修饰反而破坏效果。"]}
{"word":"overgilding","summary":{"en":"Overgilding means adding too much ornament (literally too much gold) or using excessive praise.","zh":"Overgilding 指过度镀金/过度装饰，也可比喻过分吹捧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of adding too much gold decoration (or, more generally, making something overly ornate or showy).","zh":"过度镀金；（更广义）过分装饰、过于华丽。"},"examples":[{"en":"The frame looked cheap because of the overgilding.","zh":"画框因为过度镀金，看起来反而很廉价。"},{"en":"A little decoration is fine, but overgilding distracts from the design.","zh":"适度装饰可以，但过度装饰会分散对设计本身的注意力。"}]},{"partOfSpeech":"n.","definition":{"en":"excessive praise or flattering language that makes something seem better than it is.","zh":"过度吹捧；过分的赞美与奉承。"},"examples":[{"en":"The article’s overgilding made the product sound unreal.","zh":"文章里过度吹捧，让产品听起来不真实。"},{"en":"She appreciated the compliment, but the overgilding felt uncomfortable.","zh":"她感谢夸奖，但过度奉承让她不自在。"}]}],"synonyms":["excessive ornamentation","over-decoration","embellishment","flattery","overpraise"],"phonetic":"ˌoʊvərˈɡɪldɪŋ","extraExplanation":["“overgilding”来自动词“overgild”（over- 表“过度” + gild 表“镀金/饰以金色”）。它常用作比喻：意思是“把已经不错的东西再过度包装”，反而显得俗气或失真。","常被联系到莎士比亚《约翰王》(King John) 的名句：“To gild refined gold, to paint the lily … is wasteful and ridiculous excess.”（给精炼的金子再镀金、给百合花上色……都是多余而可笑的过度之举。）这句常用来表达“画蛇添足/锦上添花到变味”。"]}
{"word":"overgilds","summary":{"en":"“overgilds” means ‘decorates or praises something too much,’ making it overly showy or exaggerated.","zh":"“overgilds”指“过度镀金/过度装饰或夸赞”，使之显得浮夸或失真。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of “overgild”) to cover something with too much gold, or to decorate it so much that it becomes showy or excessive.","zh":"（overgild 的第三人称单数）给某物镀上过多的金，或过度装饰，使之显得俗艳/夸张。"},"examples":[{"en":"The frame overgilds the painting and distracts from the art.","zh":"这个画框镀金过度，反而分散了人们对画作本身的注意力。"},{"en":"He overgilds the story with fancy details to impress the audience.","zh":"他为了打动观众，在故事里添了太多华丽细节，显得过分。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something seem better, richer, or more impressive than it really is (often by exaggeration).","zh":"（常指夸大其词）把某事说得/包装得比实际更好、更富、更体面。"},"examples":[{"en":"The ad overgilds the product’s benefits.","zh":"这则广告把产品的好处吹得过头了。"},{"en":"She doesn’t overgild her achievements; she lets the work speak for itself.","zh":"她不夸大自己的成就，而是让成果自己说明一切。"}]}],"synonyms":["overdecorate","embellish","overembellish","gild (too much)","exaggerate","oversell"],"phonetic":"/ˌoʊvɚˈɡɪldz/","extraExplanation":["“overgild”由 over-（过度）+ gild（镀金、装饰）构成，语感上常带批评：太华丽、太用力，反而失去原本的美或真实。","常见变形：overgild / overgilds / overgilding；过去式可见 overgilded，也偶见较文学化的 overgilt。","在英语修辞传统里，“过度装饰”的观念常与莎士比亚名句“To gild refined gold…”（给精炼的金再镀金）同类，用来讽刺多此一举的华丽加工。"]}
{"word":"overgilt","summary":{"en":"Overgilt means excessively gilded—decorated with too much gold—or to gild something too much.","zh":"overgilt 指“过度镀金/金饰过多”，也可指“把……过度镀金”（常含“华而不实”的意味）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with too much gold (or gold-colored decoration); excessively gilded.","zh":"镀金过多的；金饰过于华丽的（带贬义，常指“华而不实”）。"},"examples":[{"en":"The overgilt frame distracted me from the painting itself.","zh":"那过分镀金的画框让我分心，反而看不进画本身。"},{"en":"Some critics called the palace interior overgilt and tasteless.","zh":"一些评论家说这座宫殿的内部装饰金光闪闪、过于俗气。"}]},{"partOfSpeech":"v.","definition":{"en":"to cover (something) with too much gold or gold-like decoration; to gild excessively.","zh":"给（某物）过度镀金；把……装饰得金光闪闪（多指过度、夸张）。"},"examples":[{"en":"They overgilt the statue until it looked unnatural.","zh":"他们把雕像过度镀金，结果看起来很不自然。"},{"en":"Don’t overgilt your résumé with fancy words—be clear and honest.","zh":"别用花哨词汇把简历“镀金”过头——清晰、诚实更重要。"}]}],"synonyms":["overgilded","too-gilded","gaudy","overdecorated","ornate (often too ornate)"],"phonetic":"/ˌoʊvərˈɡɪlt/","extraExplanation":["“overgilt”较少见，带一点书面/古旧色彩。既可作形容词（最常见），也可理解为动词“overgild”的过去式/过去分词形式。","它常用于比喻：把事实或形象“镀金”得太夸张，强调外表华丽但可能掩盖真实或缺乏内在。"]}
{"word":"overgilted","summary":{"en":"Overgilted means “too much gilded” (literally) or “overly ornate/embellished” (figuratively).","zh":"overgilted 指“镀金过度的”，也可比喻“过分华丽、过度修饰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively covered or decorated with gold; too richly gilded.","zh":"（用金）镀得过多的；金饰过度的。"},"examples":[{"en":"The frame looked overgilted, drawing attention away from the painting.","zh":"画框显得金饰过度，反而把注意力从画作本身引开了。"},{"en":"She preferred simple jewelry to anything overgilted and flashy.","zh":"比起金光闪闪、装饰过度的首饰，她更喜欢简约款。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Overly ornate, showy, or embellished in style; too decorated to feel natural or sincere.","zh":"（比喻）辞藻/风格过分华丽的；过度修饰而显得不自然或不真诚的。"},"examples":[{"en":"His speech sounded overgilted, full of praise that didn’t feel honest.","zh":"他的发言听起来过分浮夸，赞美之词多到让人觉得不真诚。"},{"en":"The novel’s language can feel overgilted in places, but the story is strong.","zh":"这部小说有些地方的语言显得过度华丽，不过故事本身很扎实。"}]}],"synonyms":["over-gilded","too ornate","overly embellished","gaudy","showy"],"phonetic":"/ˌoʊvərˈɡɪldɪd/","extraExplanation":["“overgilted”来自动词 overgild（在 gild“镀金/贴金”前加 over- 表示“过度”）。它不太常见，更常见的表达是“over-gilded”或用短语来替代，如 “too ornate / overly embellished / gaudy”。","与文学表达相关：英语里常用 “to gild the lily”（给百合镀金）来讽刺“多此一举的美化/画蛇添足”。该意象常被归因于莎士比亚《约翰王》（King John）中一段著名台词，表达“本来已很好却还要过度装饰”。"]}
{"word":"overgird","summary":{"en":"Overgird is a rare verb meaning to wrap/bind something on the outside, or (technically) to brace or reinforce it externally.","zh":"overgird 是个少见动词，指在外面绑扎/包裹，或（偏专业）从外部加固、支撑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To put a belt, band, or covering over something; to bind or wrap around on the outside.","zh":"（少见）在某物外面系上带子/绑扎；在外层包裹、环绕。"},"examples":[{"en":"The workers overgirded the package with rope to keep it from opening.","zh":"工人用绳子在包裹外面捆扎，防止它散开。"},{"en":"In some old accounts, travelers overgirded their cloaks with a strap.","zh":"在一些旧记载里，旅人会用带子在外面束住斗篷。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, technical) To support, brace, or strengthen from the outside, as with a band or structural frame.","zh":"（少见/偏专业）用外部的箍、框架等加固；从外部支撑、稳固。"},"examples":[{"en":"Engineers overgirded the old tower with a steel frame during restoration.","zh":"修复期间，工程师用钢架从外部加固了那座老塔。"}]}],"synonyms":["wrap","bind","strap","band","reinforce","brace"],"phonetic":"/ˌoʊvərˈɡɝd/","extraExplanation":["“overgird”由“over-（在……之上/外面）+ gird（束紧、围绕）”构成，但在现代英语中非常少用；日常表达通常用“wrap (around) / bind / strap / reinforce”。","你可能更常见到“undergird”（支撑、奠定基础，常用于比喻：undergird a theory/plan）。而“overgird”更偏字面意义：从外面束住或加固。"]}
{"word":"overgirded","summary":{"en":"“Overgirded” means “supported/underpinned” (usually in a figurative sense).","zh":"“overgirded”常指“支撑/奠定基础”（多为比喻义）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of overgird: to support, strengthen, or form the foundation for (often an idea, system, or argument).","zh":"overgird 的过去式/过去分词：支撑、加强或作为……的基础（多指观点、制度、论证等的根基）。"},"examples":[{"en":"A strong belief in fairness overgirded the new policy.","zh":"对公平的坚定信念支撑着这项新政策。"},{"en":"Trust between the team members overgirded their success.","zh":"队员之间的信任奠定了他们成功的基础。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) To fasten or secure something around the outside; to reinforce by girding.","zh":"（较少见）从外部系紧、固定；用“束紧/加固”的方式加强。"},"examples":[{"en":"The belt overgirded the robe to keep it from slipping.","zh":"腰带系在袍子外面，防止滑落。"}]}],"synonyms":["underpinned","supported","bolstered","buttressed","reinforced"],"phonetic":"ˌoʊvərˈɡɝdɪd","extraExplanation":["“overgird”由 over-（在……之上/外层）+ gird（束紧、环绕；也可引申为“支撑、加固”）组成。现代写作里更常用的是比喻义：指某种原则、价值或结构在深层“托住”一套体系或论点。","用法提示：它常出现在较正式的文体（学术写作、政策文件、评论文章）。口语中更常用 underpin / support / back up 来表达类似意思。"]}
{"word":"overgirding","summary":{"en":"Overgirding means underpinning or providing the foundation that supports something.","zh":"Overgirding 指“作为基础支撑、巩固、托底”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"supporting or strengthening something from beneath or behind; forming a basic foundation for it.","zh":"（在背后或底层）支撑、巩固某事物；作为其基础。"},"examples":[{"en":"Trust is the overgirding principle of a healthy relationship.","zh":"信任是健康关系的基础原则。"},{"en":"The constitution provides rights overgirding modern democratic government.","zh":"宪法提供的权利支撑着现代民主政府。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of supporting, reinforcing, or providing a foundation for something.","zh":"支撑、巩固或为某事物提供基础的行为。"},"examples":[{"en":"The overgirding of the theory comes from decades of careful research.","zh":"该理论的基础来自数十年的严谨研究。"},{"en":"Their argument lacked the overgirding needed to persuade the audience.","zh":"他们的论点缺少足够的支撑，无法说服听众。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of \"overgird\": supporting or reinforcing something; underpinning it.","zh":"“overgird”的现在分词：支撑、巩固某事；为其提供基础。"},"examples":[{"en":"Strong community networks are overgirding the recovery after the storm.","zh":"强大的社区网络正在为风暴后的恢复提供支撑。"},{"en":"Evidence is overgirding the claim that the program works.","zh":"证据正在支撑“该项目有效”的说法。"}]}],"synonyms":["underpinning","supporting","reinforcing","foundational","buttressing"],"phonetic":"/ˌoʊvərˈɡɝdɪŋ/","extraExplanation":["“overgirding/overgird”常见于学术写作、政策文件和正式演讲，语气偏正式，接近“underpin / provide a foundation for（作为……的基础）”。日常口语里更常用“support”或“back up”。","词根来自“gird（束紧、环绕；也可指给……加上支撑）”，加上“over-”有“在其上/在外层加强支撑”的感觉，因此常引申为“从根本上托住”。"]}
{"word":"overgirdle","summary":{"en":"Overgirdle means to gird or encircle something, often as an outer binding (literary/rare).","zh":"overgirdle 指（多为文学/罕见用法）在外层束上带子或环绕束缚某物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tie, fasten, or surround with a belt/band (a “girdle”), especially as an outer layer; to gird (often used in older or literary writing).","zh":"（尤用于较古老或文学语境）在外面用带子/束带系住；环绕束缚；（相当于）束上、缠绕。"},"examples":[{"en":"In the old tale, the knight overgirdled his cloak before riding into the cold.","zh":"在那个古老的故事里，骑士出发前把斗篷在外面束好，以抵御寒冷。"},{"en":"Vines overgirdled the stone pillar, making it look like it was wearing a green belt.","zh":"藤蔓环绕着石柱，像给它系上了一条绿色的腰带。"}]}],"synonyms":["gird","belt","bind","encircle","wrap (around)"],"phonetic":"/ˌoʊvɚˈɡɝdəl/","extraExplanation":["“overgirdle”由 over-（在……之上/外层）+ girdle（束带；用带子束）构成，属于非常少见、偏古风的词。现代英语里更常用的表达是 gird、belt、bind、encircle 或 wrap around。","在诗歌或历史题材中，它常带有“外层束紧、装束整齐”的画面感：把披风、外袍等在外面再扎一道带子，或用植物/绳索把某物环绕起来。"]}
{"word":"overgirds","summary":{"en":"Overgirds means “supports or underpins as a fundamental basis,” and it can also mean “fastens or secures over something” (rare).","zh":"overgirds 表示“从根本上支撑/奠基”，也可表示“从外部系紧或加固”（较少见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to support, strengthen, or form the underlying basis of something (often used in formal or academic writing)","zh":"支撑、强化或构成某事的基础（常见于正式/学术语境）"},"examples":[{"en":"Trust overgirds a healthy relationship.","zh":"信任支撑着健康的关系。"},{"en":"The constitution overgirds the country’s legal system.","zh":"宪法构成该国法律体系的基础。"},{"en":"Good data overgirds smart decisions in business.","zh":"好的数据支撑企业做出明智决策。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fasten or secure something with a belt, band, or similar wrapping placed over it (rare; more literal sense)","zh":"用腰带、带子或类似的束带从外部加固/系紧某物（较少见；偏字面义）"},"examples":[{"en":"He overgirds the package with an extra strap for safety.","zh":"为安全起见，他用额外的带子把包裹再加固一圈。"}]}],"synonyms":["underpin","support","buttress","bolster","sustain","fortify"],"phonetic":"/ˌoʊvərˈɡɝd/","extraExplanation":["“overgirds”是动词“overgird”的第三人称单数形式（he/she/it overgirds）。这个词在现代英语里比较少见，但在政策、法律、学术写作中会用来表达“从根本上支撑/奠基”的意思，语气比“supports”更正式。","词根提示：gird 本义与“束紧、系带”有关，因此 overgird 的比喻用法很形象——像把东西从外面加固一样，强调“基础性的支撑”。"]}
{"word":"overgirt","summary":{"en":"Overgirt is an archaic adjective meaning dressed/equipped, especially belted or girded over one’s clothing.","zh":"overgirt 是古语形容词，指穿戴或装备齐整，尤指衣外束带/系束。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) dressed or equipped; often used especially for being belted or girded over clothing.","zh":"（古语）穿戴好的；装备好的；常指在衣服外系上腰带/束带。"},"examples":[{"en":"The knight rode into the hall, overgirt with a bright belt.","zh":"骑士骑入大厅，衣外束着一条明亮的腰带。"},{"en":"In old tales, heroes are often described as overgirt before a journey.","zh":"在古老故事里，英雄出发前常被描写为“穿戴整齐、束带在身”。"}]}],"synonyms":["dressed","attired","belted","girded","equipped"],"phonetic":"/ˌoʊvɚˈɡɝt/","extraExplanation":["“overgirt”是非常少见的古语，多见于中古或仿古风格的文学描写。它来自“girt”（gird 的过去分词），核心意象是“系上束带/把某物束在身上”。现代英语里通常不用这个词，写作时更常用 dressed, belted, girded 等。"]}
{"word":"overgive","summary":{"en":"Overgive means to give more than is reasonable or needed.","zh":"overgive 指“给得太多、过度给予”，超过合理或需要的程度。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give too much (money, time, help, credit, etc.), more than is reasonable or needed","zh":"给得太多；过度给予（钱、时间、帮助、功劳等），超过合理或需要的程度"},"examples":[{"en":"He tends to overgive at work, taking on extra tasks until he burns out.","zh":"他在工作中常常过度付出，接太多额外任务，最后把自己累垮。"},{"en":"Don’t overgive your personal information online.","zh":"不要在网上过度提供你的个人信息。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) to yield or give way too much; to be overly flexible or indulgent","zh":"（罕用）让步过多；过于松软/过于纵容（指态度、规则或结构等“太容易被让步或弯曲”）"},"examples":[{"en":"If the rules overgive, the team loses focus.","zh":"如果规则一再过度让步，团队就会失去方向。"},{"en":"The fabric may overgive after many washes.","zh":"这块布洗很多次后可能会变得过于松垮。"}]}],"synonyms":["give too much","be too generous","overdo","overshare","overpay"],"phonetic":"/ˌoʊvərˈɡɪv/","extraExplanation":["“overgive”在现代英语里不算常见，更常见的表达是“give too much / overpay / overdo / be too generous / overshare”。写作中如果用“overgive”，语气会显得更口语化或带一点自创词（neologism）的感觉。","构词：over-（过度）+ give（给）。含义通常带有“好心但不合适、会造成负担或风险”的暗示，常用于自我界限（boundaries）、情感付出、金钱或信息分享等话题。"]}
{"word":"overglad","summary":{"en":"Overglad means excessively glad (very, almost too, happy), and it sounds literary or old-fashioned.","zh":"overglad 指“过分高兴、喜出望外”，带有文学感或较古老的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often literary/old-fashioned) Excessively glad; very happy in a way that may feel too strong or hard to contain.","zh":"（常见于文学/较古老用法）过分高兴的；喜出望外到有点“太开心”的。"},"examples":[{"en":"She was overglad to see her brother safe after the storm.","zh":"暴风雨过后看到哥哥平安无事，她高兴得不得了。"},{"en":"I was overglad at the good news and could hardly speak.","zh":"听到这个好消息我欣喜若狂，几乎说不出话来。"}]}],"synonyms":["overjoyed","ecstatic","delighted","thrilled","very glad"],"phonetic":"/ˌoʊvɚˈɡlæd/","extraExplanation":["“over-”是常见前缀，表示“过度、超过正常程度”，所以 overglad 字面意思就是“太高兴”。","这个词在现代日常英语里不算常用，更常见的表达有 very glad / extremely happy / overjoyed。你在诗歌、旧文学或模仿古风的写作中更可能见到它。"]}
{"word":"overgladly","summary":{"en":"Overgladly means “too gladly” or “overly willingly,” often suggesting eagerness that’s excessive.","zh":"overgladly 表示“过于乐意/过分爽快地”，常暗示热情或答应得有点过头。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too gladly; with more willingness or enthusiasm than is appropriate (often implying eagerness that may be excessive or regrettable).","zh":"过于乐意地；过分热情地（常带有“太急着答应/太积极，以至于不太合适或可能后悔”的含义）。"},"examples":[{"en":"I would overgladly accept, but I promised to help my family tonight.","zh":"我其实会很乐意（甚至有点过于乐意）接受，但我今晚答应要帮家里。"},{"en":"He overgladly agreed to take on extra work and then felt exhausted.","zh":"他过于爽快地答应接更多工作，后来就累坏了。"}]}],"synonyms":["too gladly","all too gladly","only too gladly","too readily","too eagerly"],"phonetic":"ˌoʊvɚˈɡlædli","extraExplanation":["“overgladly”较少见，带一点文艺或略显旧式/正式的语气。现代英语里更常用的表达是：“only too gladly / all too gladly”（非常乐意，常带轻微强调）或“too eagerly / too readily”（太急切/太轻易地）。","构词法：over-（过度）+ gladly（乐意地）。因此它通常暗示“过头了”的意味，而不只是单纯的“很乐意”。"]}
{"word":"overglamorize","summary":{"en":"Overglamorize means to present something as unrealistically attractive or exciting, often in a misleading way.","zh":"overglamorize 指把事物过度美化、渲染得不真实地吸引人或光鲜，常带误导意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make something seem more exciting, attractive, or important than it really is (often in a misleading way).","zh":"把某事物过度美化、过分渲染得比实际更吸引人或更重要（常带有误导性）。"},"examples":[{"en":"Some ads overglamorize skincare results, so read the fine print.","zh":"有些广告会过度美化护肤效果，所以要仔细看小字说明。"},{"en":"The movie doesn’t overglamorize war; it shows the fear and loss.","zh":"这部电影没有把战争过度浪漫化；它展现了恐惧与失去。"},{"en":"Don’t overglamorize your first job—it can be stressful at times.","zh":"别把你的第一份工作想得太完美——有时也会很有压力。"}]}],"synonyms":["glamorize (too much)","romanticize","idealize","overstate"],"phonetic":"/ˌoʊvərˈɡlæməˌraɪz/","extraExplanation":["“over-”表示“过度、超过必要程度”，常带负面评价；“glamorize”表示“把……描绘得很迷人/很光鲜”。合在一起强调“把真实情况包装得更梦幻、更光亮”。","常见搭配：overglamorize a lifestyle/celebrity life（过度美化某种生活方式/明星生活）、overglamorize success（过度美化成功）、overglamorize the past（过度美化过去）。","近义表达对比：romanticize（把……浪漫化，未必与“光鲜”有关）、idealize（把……理想化，强调不切实际的完美）、gloss over（轻描淡写、掩盖问题，侧重“忽略缺点”）。"]}
{"word":"overglamorized","summary":{"en":"Overglamorized means presented as more attractive or impressive than it really is, often unrealistically.","zh":"overglamorized 指把事物描绘得比现实更光鲜、更吸引人，常带不真实或夸大的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to seem more exciting, beautiful, or impressive than it really is (often in an unrealistic or misleading way).","zh":"被过度美化的；被夸大得比实际更精彩、更漂亮或更令人向往（常带不真实或误导的意味）。"},"examples":[{"en":"Social media can make ordinary lives look overglamorized.","zh":"社交媒体可能会把普通生活呈现得过度光鲜。"},{"en":"The movie shows an overglamorized version of life in the city.","zh":"这部电影呈现了一个被过度美化的城市生活版本。"},{"en":"Her job isn’t overglamorized—it’s stressful and time-consuming.","zh":"她的工作并没有被过度美化——它压力大而且很耗时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"Praised or publicized too positively, so the audience overlooks the downsides or reality.","zh":"被过度吹捧的；宣传得过于正面，以至于让人忽略缺点或现实。"},"examples":[{"en":"Some people think the “hustle culture” lifestyle is overglamorized.","zh":"有些人认为“拼命工作文化”的生活方式被过度吹捧了。"},{"en":"The product is overglamorized in ads, but it doesn’t work that well.","zh":"广告把这款产品吹得太神，但其实效果没那么好。"}]}],"synonyms":["overhyped","romanticized","idealized","glamorized","overpraised"],"phonetic":"/ˌoʊvərˈɡlæməraɪzd/","extraExplanation":["“over-”是常见前缀，表示“过度、太多”。因此 overglamorized 通常带批评语气，暗示被包装得不真实或不健康（常见于谈媒体、名人生活、消费主义等语境）。","相关词：glamorous（迷人的、光鲜的）；glamorize（v. 美化/把……说得很吸引人）；overhyped（被炒作过头的）；romanticized（被浪漫化的，常指忽略现实困难）。"]}
{"word":"overglamorizes","summary":{"en":"“Overglamorizes” means “makes something seem more glamorous or appealing than it really is.”","zh":"“overglamorizes”指“把某事物过度美化，使其显得比现实更迷人、更吸引人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to present something as more glamorous, exciting, or attractive than it really is; to idealize in an unrealistic way","zh":"把某事物描述得比现实更光鲜、更迷人；对其进行不切实际的美化（理想化）"},"examples":[{"en":"The movie overglamorizes life in the big city and ignores the everyday struggles.","zh":"这部电影过度美化大城市生活，忽略了日常的艰辛。"},{"en":"Some ads overglamorize unhealthy products by linking them to luxury and success.","zh":"一些广告把不健康的产品与奢华和成功联系起来，从而过度美化它们。"},{"en":"He says the book overglamorizes war, making it seem adventurous instead of tragic.","zh":"他说这本书过度美化战争，把它写得像冒险而不是悲剧。"}]}],"synonyms":["idealizes","romanticizes","glorifies","beautifies","sugarcoats"],"phonetic":"/ˌoʊvərˈɡlæməˌraɪzɪz/","extraExplanation":["“over-”表示“过度、过分”。“glamorize”意为“使……显得迷人/光鲜”。因此“overglamorize”常用于批评媒体、广告或叙事把现实包装得太美好，弱化了风险、成本或痛苦。"]}
{"word":"overglamorizing","summary":{"en":"“Overglamorizing” means portraying something as more glamorous or appealing than it truly is, often in a misleading way.","zh":"“overglamorizing”指把某事过度美化、过分渲染得很光鲜，往往带有误导性。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Making something seem more attractive, exciting, or impressive than it really is (often by highlighting the glamorous parts and hiding the negative sides).","zh":"把某事物描绘得比实际更迷人、更光鲜（常强调“光鲜面”，弱化或隐藏负面）。"},"examples":[{"en":"The movie is overglamorizing life in the fashion industry and ignoring how stressful it can be.","zh":"这部电影把时尚行业的生活过度美化了，忽略了它可能有多么高压。"},{"en":"Stop overglamorizing hustle culture—rest matters, too.","zh":"别再过度美化“拼命文化”了——休息也同样重要。"}]},{"partOfSpeech":"n.","definition":{"en":"Present participle/gerund form of “overglamorize”: the act of overglamorizing, or describing something in an overly glamorous way.","zh":"“overglamorize”的现在分词/动名词形式：指“过度美化”的行为或表达方式。"},"examples":[{"en":"Overglamorizing celebrity life can mislead teenagers.","zh":"过度美化明星生活可能会误导青少年。"},{"en":"She apologized for overglamorizing the job during the interview.","zh":"她为自己在面试时把那份工作说得过于光鲜而道歉。"}]}],"synonyms":["overidealizing","romanticizing","sugarcoating","overhyping","glossing over"],"phonetic":"/ˌoʊvɚˈɡlæməˌraɪzɪŋ/","extraExplanation":["“over-”是常见前缀，表示“过度、太过”（如 overwork 过度工作，overthink 想太多）。因此 overglamorize/overglamorizing 通常带有批评意味：不只是“让它看起来更好”，而是“美化到失真”。","美式拼写常用 glamour（英式常见 glamour 也可见；动词形式多写作 glamorize/glamorizing 在美式更常见）。你输入的 overglamorizing 属于美式常见写法。","常见搭配：overglamorize/overglamorizing + life/work/industry/relationship/war/crime（例如 overglamorizing crime 指把犯罪描绘得很酷、很刺激，从而淡化其危害）。"]}
{"word":"overglance","summary":{"en":"Overglance means a quick look (noun) or to look over something quickly (verb), similar to “glance” or “skim.”","zh":"Overglance 指“匆匆一瞥/快速浏览”（名词）或“快速看一下/略读”（动词），类似 glance 或 skim。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quick look at something; a brief, not detailed viewing (like a glance or a skim).","zh":"匆匆一瞥；快速浏览（不细看）。"},"examples":[{"en":"I only had time for an overglance at the report before the meeting.","zh":"开会前我只来得及快速浏览一下那份报告。"},{"en":"With one overglance, she understood the main idea of the email.","zh":"她匆匆看了一眼，就明白了邮件的大意。"}]},{"partOfSpeech":"v.","definition":{"en":"to look over something quickly; to skim.","zh":"快速看一下；略读；浏览。"},"examples":[{"en":"He overglanced the notes on the train and then closed the notebook.","zh":"他在火车上快速翻看了笔记，然后合上了本子。"},{"en":"Please overglance this page to check for obvious errors.","zh":"请快速看一下这一页，检查有没有明显错误。"}]}],"synonyms":["glance","quick look","skim","scan"],"phonetic":"/ˌoʊvərˈɡlæns/","extraExplanation":["“overglance”在现代英语中比较少见，很多情况下人们更常用“glance (at) / take a quick look / skim”。你在阅读较老的文本或较文学化的写法时更可能见到它。","构词上可理解为“over-（在……上方/越过）+ glance（一瞥）”，强调“扫过式地看”，通常带有“看得不细”的含义。"]}
{"word":"overglanced","summary":{"en":"“Overglanced” means “looked over quickly; skimmed,” and can also imply “overlooked by only glancing.”","zh":"“overglanced”表示“粗略扫过/快速浏览”，也可引申为“因匆匆一瞥而忽略”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense and past participle of **overglance**: to look over something quickly; to skim with a brief, not detailed look.","zh":"**overglance** 的过去式/过去分词：快速扫视；粗略浏览（不细看）。"},"examples":[{"en":"She **overglanced** the email and missed the attachment.","zh":"她**粗略看了一眼**那封邮件，结果漏掉了附件。"},{"en":"He **overglanced** the report before the meeting.","zh":"开会前他把报告**快速浏览**了一下。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) To look past or fail to notice because you only glanced briefly; to overlook.","zh":"（较少用）因为只匆匆一瞥而没注意到；忽略。"},"examples":[{"en":"I **overglanced** the warning label and used the wrong setting.","zh":"我**一眼带过**警示标签，结果用了错误的档位。"}]}],"synonyms":["skimmed","glanced over","looked over","scanned","overlooked"],"phonetic":"/ˌoʊvərˈɡlænst/","extraExplanation":["“overglance”在现代英语里相对少见，更常见、更自然的说法是 **glance over**（随便看一下）或 **skim**（略读）。","词形上是 **over-**（表示“从上面/整体地、粗略地”）+ **glance**（瞥一眼）。因此它强调“看过但不细看”，有时也会引申出“因此而忽略”。"]}
{"word":"overglancing","summary":{"en":"Overglancing means looking quickly over something or giving brief, repeated glances (a rare form; often replaced by “glance over” or “skim”).","zh":"Overglancing 指快速扫视/匆匆看一遍，或频频瞟一眼（较少见的用法，常用 glance over 或 skim 代替）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to look quickly or briefly over something; to skim with a fast glance (present participle of “overglance”)","zh":"快速地把……看一遍；匆匆扫视（overglance 的现在分词）"},"examples":[{"en":"She was overglancing the report before the meeting started.","zh":"会议开始前，她匆匆扫了一遍报告。"},{"en":"He kept overglancing at his phone during dinner.","zh":"吃饭时他不停地瞟手机。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to look at something from above or across; to cast a glance over a wider area (often literary)","zh":"（较少见/偏文学）从上方或更广的范围扫视；放眼望去"},"examples":[{"en":"From the hilltop, they stood overglancing the valley in silence.","zh":"他们站在山顶，默默地俯瞰山谷。"}]}],"synonyms":["glancing over","skimming","scanning","flicking through","taking a quick look"],"phonetic":"ˌoʊvərˈɡlænsɪŋ","extraExplanation":["“overglance”本身在现代英语里比较少见；日常更常用的是 “glance over (something)” 或 “skim (something)” 表达“匆匆看一遍”。","如果你想表达“忍不住一直看/频频看”，更自然的说法常是 “keep glancing at …” 或 “keep checking …”。"]}
{"word":"overglass","summary":{"en":"Overglass usually means a protective sheet of glass over something; in art, it can also mean reverse glass painting.","zh":"Overglass 通常指覆盖在物体上的保护玻璃；在艺术语境中也可指“玻璃反画”（在玻璃背面作画、正面观看）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sheet or pane of glass placed over something to protect or cover it (for example, a picture, a display, or a dial).","zh":"覆盖在物体表面起保护或遮挡作用的一片玻璃（如画框、展示品或表盘上的玻璃）。"},"examples":[{"en":"The museum replaced the overglass to better protect the drawing from dust.","zh":"博物馆更换了覆盖玻璃，以更好地防止灰尘损坏这幅素描。"},{"en":"Wipe the overglass gently so you don’t scratch it.","zh":"轻轻擦拭覆盖玻璃，避免刮花。"}]},{"partOfSpeech":"n.","definition":{"en":"(art) painting or decoration made on the back of a glass sheet, meant to be viewed from the front; also called reverse glass painting.","zh":"（艺术）在玻璃背面作画/装饰、从正面观看的作品；也叫“玻璃反画/反绘”。"},"examples":[{"en":"She collects overglass works from the 19th century.","zh":"她收藏19世纪的玻璃反画作品。"},{"en":"In an overglass painting, details are often painted in reverse order.","zh":"在玻璃反画中，细节常常需要按相反的顺序来绘制。"}]}],"synonyms":["protective glass","glass cover","cover glass","front glass","reverse glass painting"],"phonetic":"/ˈoʊvərˌɡlæs/","extraExplanation":["“overglass”不是日常高频词，更常见的说法是“protective glass / glass cover / cover glass”。在一些较老的资料、工艺或博物馆语境中可能会看到“overglass”。","艺术含义上，它常和“reverse glass painting（玻璃反画）”关联：画家在玻璃背面作画，最终从正面透过玻璃观看，因此上色顺序与普通绘画不同。"]}
{"word":"overglaze","summary":{"en":"Overglaze means adding a second glaze (or decoration) on top of an already glazed surface, especially in ceramics.","zh":"Overglaze 指在已上釉的表面上再加一层釉或进行釉上装饰，尤用于陶瓷。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to apply a glaze on top of an existing glaze or surface (especially in ceramics or pottery), often to add shine, color, or a decorative effect","zh":"（尤指陶瓷）在已有釉层或表面上再施一层釉，以增加光泽、颜色或装饰效果"},"examples":[{"en":"The artist overglazed the vase to give it a deeper, glossy finish.","zh":"艺术家在花瓶上加施了一层釉，使表面更深沉、更有光泽。"},{"en":"Some plates are overglazed with gold details after the first firing.","zh":"有些盘子在第一次烧制后会再加施金色细节的釉上彩。"}]},{"partOfSpeech":"n.","definition":{"en":"a glaze applied over another glaze, or decoration done on top of a glazed surface (common in ceramics)","zh":"（陶瓷）加在底釉之上的釉层；或指在釉面上进行的装饰（釉上彩）"},"examples":[{"en":"The overglaze adds a subtle shimmer under the light.","zh":"这层上釉在灯光下呈现出细微的闪光。"},{"en":"Overglaze decoration can be very detailed but may wear with heavy use.","zh":"釉上彩装饰可以非常精细，但频繁使用可能会磨损。"}]}],"synonyms":["glaze over","apply a topcoat","overcoat"],"phonetic":"/ˌoʊvɚˈɡleɪz/","extraExplanation":["“overglaze”最常见于陶瓷语境：通常先上底釉并高温烧成，再在釉面上进行彩绘或加一层釉（釉上彩/上釉），随后进行第二次（往往较低温的）烧制以固定颜色与装饰。日常英语里较少用到，更多见于工艺、艺术、博物馆或产品说明。"]}
{"word":"overglazed","summary":{"en":"Overglazed means covered with too much glaze, making it overly shiny, thick, or sweet.","zh":"Overglazed 指“上釉/上糖霜过多”，导致过于光亮、过厚或过甜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with too much glaze, often making the surface overly shiny, thick, or sweet (for food) or overly glossy (for ceramics).","zh":"上了过多的釉/糖霜；因此表面过于光亮、过厚或（食物）过甜。"},"examples":[{"en":"The donuts were overglazed, so the sugar coating felt thick and sticky.","zh":"这些甜甜圈糖霜上得太多，糖衣又厚又黏。"},{"en":"The pot looked overglazed, with a glassy shine that hid the texture of the clay.","zh":"这只陶罐釉上得过多，玻璃般的光泽把泥料的纹理都遮住了。"}]}],"synonyms":["overcoated","too glossy","over-iced","overfrosted"],"phonetic":"/ˌoʊvərˈɡleɪzd/","extraExplanation":["“Over-”表示“过度/过量”。“Glaze”在食物里常指糖霜或光亮的涂层；在陶艺里指上釉。说某物“overglazed”通常带一点负面评价：太厚、太亮、细节被盖住，或甜得发腻。"]}
{"word":"overglazes","summary":{"en":"Overglazes are decorative colors or glaze/enamel added on top of an already-glazed ceramic and fired again; the word can also be a verb meaning to add that decoration.","zh":"overglazes 指陶瓷的釉上彩／釉上釉装饰（在已上釉的表面再装饰并二次烧制）；也可作动词，表示进行这种釉上装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative colors or a glaze layer painted on top of an already-glazed ceramic surface and fired again (usually at a lower temperature).","zh":"（陶瓷）釉上彩／釉上釉：在已经上过釉并烧成的器物表面，再绘彩或再加一层釉并进行二次（通常较低温）烧制的装饰层。"},"examples":[{"en":"The vase’s bright flowers were done with overglazes, then fired a second time.","zh":"花瓶上鲜艳的花纹是用釉上彩完成的，然后又进行了一次烧制。"},{"en":"Overglazes can add fine details that would blur under a high-temperature glaze firing.","zh":"釉上彩可以添加精细细节，而这些细节在高温釉烧时可能会糊掉。"}]},{"partOfSpeech":"vt.","definition":{"en":"To paint or apply decorative enamel/glaze onto a ceramic piece after it has been glazed, and then fire it again.","zh":"（在陶瓷已上釉后）再施釉或绘釉上彩，并进行二次烧制。"},"examples":[{"en":"They overglazed the plate with gold lines to make the border shine.","zh":"他们在盘子上用金色线条做釉上装饰，让边框更闪亮。"},{"en":"If you overglaze carelessly, the colors may look uneven after firing.","zh":"如果釉上绘彩不细致，烧成后颜色可能会不均匀。"}]}],"synonyms":["overglaze decoration","enamel (ceramics)","overglaze enamel"],"phonetic":"ˌoʊvərˈɡleɪz","extraExplanation":["“overglazes”通常是“overglaze”的复数，用在陶瓷与工艺美术语境中。常见对比：underglaze（釉下彩）是在上透明釉之前绘制；overglaze（釉上彩/釉上釉）是在釉面之上再装饰并二次低温烧。"]}
{"word":"overglazing","summary":{"en":"Overglazing means applying too much glaze (especially in ceramics); less commonly, it can mean using more glass layers than needed.","zh":"overglazing 指（尤用于陶瓷）上釉过多；较少见时也可指窗户等玻璃层加装过度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of applying too much glaze (a glassy coating) to pottery, ceramics, or similar surfaces, often causing problems such as running, cloudiness, loss of detail, or an overly glossy look","zh":"（陶艺/瓷器等）上釉过多的行为，常导致釉流淌、发浑、细节被盖住或表面过度发亮等问题"},"examples":[{"en":"Overglazing can make the pattern blur because the glaze pools in the grooves.","zh":"上釉过多会让图案变模糊，因为釉会在凹槽里堆积。"},{"en":"The teacher warned that overglazing often causes drips during firing.","zh":"老师提醒说，上釉过多在烧制时很容易产生釉滴。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) adding more layers of glass than needed in a window or display, sometimes reducing clarity or creating reflections","zh":"（较少见）给窗户或展示面板加装过多玻璃层，可能降低清晰度或增加反光"},"examples":[{"en":"Overglazing the storefront created distracting reflections at night.","zh":"店面玻璃层装得太多，晚上反光很刺眼。"}]}],"synonyms":["excessive glazing","overglaze","too much glaze"],"phonetic":"ˌoʊvɚˈɡleɪzɪŋ","extraExplanation":["在陶瓷语境里，glaze 指“釉”（烧后形成玻璃质表层）。overglazing 往往不是“越亮越好”，而是会影响颜色呈现与纹理细节：釉层过厚可能遮盖刻纹、让釉色变得发闷，甚至在高温下流釉粘到窑板。","在建筑语境里更常见的说法通常是 double glazing（双层玻璃）或 triple glazing（三层玻璃）；overglazing 带有“过度、不必要”的评价，强调副作用（反光、视觉变形、成本增加等）。"]}
{"word":"overglide","summary":{"en":"Overglide means to glide over something smoothly, or (in aviation) to glide too far and overshoot the landing point.","zh":"Overglide 指平稳地掠过/滑过；在航空语境中指滑得过远、越过预定着陆点。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to glide smoothly over or above something; to pass over without stopping or touching much","zh":"（平稳地）掠过、滑过；从……上方滑行而过（不怎么停留或接触）"},"examples":[{"en":"Swallows overglide the river at dusk.","zh":"黄昏时，燕子从河面上方掠过。"},{"en":"Her eyes overglided the page, searching for his name.","zh":"她的目光掠过页面，寻找他的名字。"}]},{"partOfSpeech":"v.","definition":{"en":"(aviation) to glide too far and overshoot the intended landing point","zh":"（航空/滑翔）滑得过远、着陆点越过（冲过预定位置）"},"examples":[{"en":"With a strong tailwind, the glider can overglide the landing zone.","zh":"在强顺风下，滑翔机可能会滑过着陆区。"},{"en":"The instructor warned me not to come in too fast and overglide.","zh":"教练提醒我别进近太快，不然会越过着陆点。"}]}],"synonyms":["glide over","skim over","overshoot","sail past"],"phonetic":"/ˌoʊvərˈɡlaɪd/","extraExplanation":["“overglide”在现代英语中不算常用词，更常见的说法是“glide over / skim over / overshoot (the landing)”。在飞行/滑翔语境里，它强调“因为速度或风等原因滑得太远”。在比喻用法中，它常表示“快速略过细节”，语气比“read carefully”更偏“粗略浏览”。"]}
{"word":"overglint","summary":{"en":"“Overglint” is a rare, poetic word meaning a brief sparkle that flashes over something.","zh":"“overglint”是罕见、偏诗意的词，指在某物之上掠过的一瞬闪光。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Rare, poetic) To shine or flash briefly over something; to cast a quick, small sparkle across a surface.","zh":"（罕见、偏诗意）在某物之上短暂闪光；在表面掠过一瞬微光。"},"examples":[{"en":"Moonlight overglinted on the river, then disappeared behind clouds.","zh":"月光在河面上短暂闪烁，随后被云层遮住。"},{"en":"A drop of water overglinted on the leaf like a tiny mirror.","zh":"一滴水在叶片上闪了一下，像一面小镜子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A brief sparkle or flash seen over or across a surface.","zh":"（罕见）掠过表面的一瞬闪光；短暂的亮光。"},"examples":[{"en":"She noticed an overglint on the horizon—perhaps a distant car.","zh":"她注意到地平线上一闪光——也许是远处的车。"}]}],"synonyms":["glint","gleam","shimmer","flash","sparkle"],"phonetic":"/ˌoʊvɚˈɡlɪnt/","extraExplanation":["“overglint”不是现代英语里的常用词，更像是由 over-（在……之上/越过）+ glint（闪光）临时组合出来的写作词，常见于描写自然光影的诗意语境。","如果你是在某本书/诗里看到它，可能是作者为了节奏或画面感而造词；在日常表达中更常用 glint, gleam, shimmer，或用短语 glint over / glint across 来表达。"]}
{"word":"overgloom","summary":{"en":"Overgloom is a rare, poetic word meaning “to cover with gloom” (verb) or “a covering gloom” (noun).","zh":"Overgloom 是个罕见、偏文学的词，可作动词“使笼罩在阴郁中”，也可作名词“笼罩的阴霾/阴影”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/poetic) To cover or fill with gloom; to darken or overshadow (often used for places, skies, or moods).","zh":"（罕见/诗意用法）使笼罩在阴暗或忧郁中；使变得阴沉；使蒙上阴影（常指天空、景象或情绪）。"},"examples":[{"en":"Storm clouds overgloomed the valley by late afternoon.","zh":"到下午晚些时候，暴风云笼罩着山谷，使其显得阴沉。"},{"en":"Grief can overgloom even a happy home.","zh":"悲伤甚至会让原本幸福的家蒙上阴影。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A gloom or shadow that hangs over something; a darkening influence.","zh":"（罕见）笼罩某物的阴郁/阴影；令人压抑的影响。"},"examples":[{"en":"An overgloom seemed to settle over the town after the bad news.","zh":"坏消息传来后，小镇仿佛被一层阴霾笼罩。"}]}],"synonyms":["overshadow","darken","overcast","cast a gloom over","shroud"],"phonetic":"ˌoʊvɚˈɡluːm","extraExplanation":["“overgloom”在现代英语里非常少见，更常见的表达是“gloom over… / cast a gloom over… / overshadow / darken”。它带有明显的文学、诗歌色彩：前缀“over-”有“覆盖、压过”的感觉，强调“阴郁像一层东西盖在上面”。如果你在小说或诗里看到“overgloomed”，通常是在营造压抑、阴沉的氛围。"]}
{"word":"overgloomily","summary":{"en":"“Overgloomily” means “in an overly gloomy or pessimistic way.”","zh":"“overgloomily”意为“以过度忧郁或悲观的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively gloomy or pessimistic way; more sadly or negatively than is reasonable.","zh":"以过度忧郁或悲观的方式；比合理情况更消极、沮丧地。"},"examples":[{"en":"He spoke overgloomily about the project, even though the results were improving.","zh":"尽管项目的结果在改善，他还是把它说得过于悲观。"},{"en":"Don’t judge the future overgloomily—there are still many options.","zh":"别把未来看得过于灰暗——你仍然有很多选择。"}]}],"synonyms":["overly pessimistically","too gloomily","in an overly gloomy way","bleakly (often stronger/colder)","despondently (more hopeless)"],"phonetic":"/ˌoʊvɚˈɡluːməli/","extraExplanation":["“overgloomily”是由前缀 over-（过度）+ gloomy（忧郁的）+ -ly（副词后缀）构成，强调“过头了的悲观/阴郁”。它在日常英语中比较少见，写作时更常用的替代表达包括：“too pessimistically / overly pessimistically / in an overly gloomy way”。"]}
{"word":"overgloominess","summary":{"en":"Overgloominess means being excessively gloomy or pessimistic.","zh":"overgloominess 指“过度的阴郁或悲观”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive sadness, pessimism, or a dark mood; being more gloomy than the situation reasonably calls for.","zh":"过度的忧郁/悲观；比情况本身更夸张的阴郁情绪。"},"examples":[{"en":"Her overgloominess made small problems feel like disasters.","zh":"她的过度悲观让小问题看起来像灾难。"},{"en":"The team’s overgloominess after one loss hurt their confidence.","zh":"球队在一次失利后的过度沮丧伤害了他们的信心。"},{"en":"Try not to confuse realism with overgloominess.","zh":"别把现实主义和过度悲观混为一谈。"}]}],"synonyms":["excessive gloominess","over-pessimism","unwarranted pessimism","despondency","melancholy"],"phonetic":"/ˌoʊvərˈɡluːminəs/","extraExplanation":["这个词由前缀 over-（“过度、太……”）+ gloominess（“阴郁、忧郁”）构成，语感上强调“过头了的悲观/阴沉”。在日常英语里它比较少见，更常用的表达有 excessive gloominess、unnecessary pessimism，或直接说 “too gloomy / overly pessimistic”。"]}
{"word":"overgloomy","summary":{"en":"Overgloomy means excessively gloomy or pessimistic.","zh":"overgloomy 指“过于阴郁/过分悲观”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too gloomy, sad, or pessimistic; darker in mood than is reasonable for the situation","zh":"过于阴郁、悲观或消沉的；情绪比情况所需要的更灰暗"},"examples":[{"en":"Don’t be overgloomy—there are still options we can try.","zh":"别太悲观——我们还有办法可以试。"},{"en":"His overgloomy prediction made the team feel defeated before they even started.","zh":"他过于消极的预测让团队还没开始就觉得要输了。"},{"en":"The movie’s first act is a bit overgloomy, but it becomes hopeful later.","zh":"电影的第一幕有点过分阴郁，但后来会变得更有希望。"}]}],"synonyms":["overly gloomy","too gloomy","overly pessimistic","unduly negative","doom-and-gloom"],"phonetic":"/ˌoʊvɚˈɡluːmi/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过适当程度”（例如: overconfident 过分自信，overreact 反应过度）。因此 overgloomy 的感觉通常是：并非只是 gloomy（阴郁），而是“阴郁得过头、过分悲观”。","这个词在日常口语里不算常见；更常用的说法是 overly gloomy / too gloomy / overly pessimistic。"]}
{"word":"overglorious","summary":{"en":"Overglorious means excessively proud or showy about glory; in older/literary use, it can mean too splendid.","zh":"overglorious 指过分自夸、过度追求荣耀；在较老/文学用法中也可指“辉煌得过头”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively proud of one’s own glory or achievements; overly self-important or showy.","zh":"过分自夸的；过度追求荣耀、显得自命不凡或浮夸的。"},"examples":[{"en":"He sounded overglorious when he kept reminding everyone that he led the project.","zh":"他不断提醒大家是他带头做的项目，听起来就有点过分自夸。"},{"en":"The speech felt overglorious, celebrating success without acknowledging the team’s effort.","zh":"这篇演讲有些过度颂扬，只强调成功却没提团队的付出。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) Too glorious or splendid; magnificent to an excessive degree.","zh":"（古体/文学用法）过于辉煌灿烂的；华丽到有些过头的。"},"examples":[{"en":"In the poem, the sunrise is described as overglorious, almost painful to look at.","zh":"在那首诗里，日出被描写得过于辉煌，几乎让人不敢直视。"},{"en":"They painted an overglorious picture of the past, ignoring its hardships.","zh":"他们把过去描绘得过于辉煌，却忽略了其中的艰辛。"}]}],"synonyms":["boastful","pompous","self-important","self-congratulatory","overconfident"],"phonetic":"/ˌoʊvɚˈɡlɔɹiəs/","extraExplanation":["“overglorious”并不常见，更常见的写法是带连字符的“over-glorious”，多见于较老的文学语境。现代英语里表达类似意思，常用“overconfident / boastful / pompous / self-congratulatory”。","构词上是“over-（过度）+ glorious（荣耀的）”。很多以“over-”开头的形容词都有“过度、太……”的语气，比如“overconfident（过度自信）”“overprotective（过度保护）”。"]}
{"word":"overgloss","summary":{"en":"Overgloss means to add too much explanation or a too-positive spin, or to make something overly shiny.","zh":"overgloss 指“过度注释/粉饰性解读”，也可指“抛光过度、过于发亮”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to explain or interpret something with too much commentary or in a way that hides problems (often by making it sound better than it is)","zh":"对某事过度注释或过度解读，常常带有“粉饰/淡化问题”的意味"},"examples":[{"en":"The report overglossed the risks, so readers didn’t realize how serious the situation was.","zh":"这份报告过度粉饰了风险，导致读者没意识到情况有多严重。"},{"en":"Don’t overgloss his words—he might simply mean what he said.","zh":"别过度解读他的话——他可能就是字面意思。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something too shiny or glossy by adding excessive gloss or polish","zh":"给某物上过多光泽/抛光过度，使其过于发亮"},"examples":[{"en":"The printer overglossed the photo, making it look unnatural.","zh":"打印时把照片做得过于光亮，结果看起来不自然。"}]}],"synonyms":["gloss over","whitewash","sugarcoat","overinterpret","oversimplify"],"phonetic":"/ˌoʊvɚˈɡlɔs/","extraExplanation":["over- 表示“过度”。gloss 原本有“光泽、润色、注释/释义”的意思，所以 overgloss 常带两层含义：一是“过度解释/粉饰”，二是“抛光过度”。在写作与媒体语境里，更常用第一种（暗含批评：把问题说得太轻、太好听）。"]}
{"word":"overglut","summary":{"en":"Overglut means to overload with too much of something, especially to oversupply a market or flood a space with excess.","zh":"Overglut 指使某处/市场“过度充斥、供给过剩”，多到造成负面影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to supply or fill with too much of something; to make a market or situation excessively overloaded (often with goods, information, or people).","zh":"使（某处/市场/情况）供给过多、充斥过度；使严重过饱和（常指商品、信息或人）。"},"examples":[{"en":"Cheap imports can overglut the market and push local producers out.","zh":"廉价进口商品可能使市场供给过剩，从而挤压本地生产者。"},{"en":"During the campaign, social media was overglutted with ads and rumors.","zh":"竞选期间，社交媒体被广告和谣言过度充斥。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become excessively full or overloaded.","zh":"（变得）过度充满；过度拥挤或过饱和。"},"examples":[{"en":"After the initial boom, the market began to overglut and prices fell.","zh":"最初的繁荣过后，市场开始供给过剩，价格随之下跌。"}]}],"synonyms":["oversupply","flood","saturate","overload","glut"],"phonetic":"/ˌoʊvərˈɡlʌt/","extraExplanation":["“overglut”由 over-（过度）+ glut（使充斥、使过量）构成，语气比常见的 “oversupply / saturate” 更强调“多到有害、令人厌烦”的感觉。","使用场景多见于经济、媒体与写作语境中：如 overglut the market（使市场供给过剩）、overglut the news cycle（让新闻周期信息过载）。"]}
{"word":"overgo","summary":{"en":"Overgo is a rare, literary verb meaning to exceed or go beyond; it can also mean to outrun or overtake.","zh":"Overgo 是较少见、偏文学的动词，主要指“超出/超过”，也可指“赶上并超过”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(often literary) to go beyond a limit; to exceed.","zh":"（常见于文学语境）超出界限；超过。"},"examples":[{"en":"His ambition began to overgo what his skills could support.","zh":"他的野心开始超过他能力所能支撑的范围。"},{"en":"Don’t let fear overgo reason.","zh":"不要让恐惧压过理性。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to outrun or overtake; to pass someone by moving faster.","zh":"（较少用）跑得比……快；赶上并超过。"},"examples":[{"en":"The younger runner overwent and overgoes the older ones on the hill.","zh":"年轻的跑者在上坡时追上并超过了年长的跑者。"},{"en":"A fast ship may overgo a slower one before nightfall.","zh":"一艘快船可能在天黑前超过一艘慢船。"}]}],"synonyms":["exceed","go beyond","surpass","outstrip","overtake"],"phonetic":"/ˌoʊvərˈɡoʊ/","extraExplanation":["“overgo”在现代英语里很少见，更常用的替代词有 exceed（超过）、go beyond（超出）、overtake（赶超）。因此它更像是文学/古风用词。","在早期现代英语（如莎士比亚等时期）中，这类“over- + go”的组合较自然，用来表达“走得过头/越界”的感觉；现代英语里这种表达通常改用更固定的搭配。"]}
{"word":"overgoad","summary":{"en":"Overgoad means to urge or pressure someone too much, often causing harm or making things worse.","zh":"overgoad 指过度催逼或驱使某人（或过度刺激局势），常导致伤害或使情况变糟。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to push or urge someone too much (to overpressure or overstimulate them), often until they make mistakes or feel exhausted","zh":"过度驱使；过分催逼（某人），常导致出错或身心疲惫"},"examples":[{"en":"The coach overgoaded the team, and several players got injured.","zh":"教练过度逼迫球队，结果好几名队员受伤了。"},{"en":"If you overgoad her, she may quit instead of improving.","zh":"如果你过分催逼她，她可能会选择辞职而不是进步。"}]},{"partOfSpeech":"vt.","definition":{"en":"to provoke or spur (a person or situation) too strongly, making things worse rather than better","zh":"过度刺激；过分激起（情绪/局势），反而使情况恶化"},"examples":[{"en":"His harsh comments only overgoaded the argument.","zh":"他刻薄的评论只会把争吵越拱越大。"},{"en":"Trying to rush the negotiations might overgoad tensions.","zh":"试图催促谈判可能会过度激化紧张局势。"}]}],"synonyms":["push too hard","overpressure","drive too hard","overwork","badger","harass","overstimulate","provoke"],"phonetic":"ˌoʊvɚˈɡoʊd","extraExplanation":["“goad”本义是“赶牲口用的刺棒”，引申为“刺激、驱使”。加上前缀“over-”表示“过度”，因此 overgoad 常带有负面含义：不是单纯鼓励，而是逼得太狠、推得过头。","该词较不常见，写作中更常用的近义表达有“push too hard / overpressure / drive too hard / overwork”。“overgoad”语气更强调被“刺激/驱赶”到过度的状态。"]}
{"word":"overgoaded","summary":{"en":"“Overgoaded” means pushed or provoked too far; it’s also the past form of “overgoad.”","zh":"“overgoaded”表示“被逼得太紧/被刺激过度”；也可作“overgoad”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) pushed or provoked too much—by pressure, criticism, or repeated urging—so they react strongly or make poor decisions.","zh":"（指人）被逼得太紧／被刺激过度（因压力、批评或反复催促），以致反应激烈或做出不理智的决定。"},"examples":[{"en":"Overgoaded by constant criticism, he finally snapped at his coworkers.","zh":"在不断的批评逼迫下，他终于对同事发火了。"},{"en":"She felt overgoaded at work and started making careless mistakes.","zh":"她在工作中觉得被逼得太紧，于是开始犯一些粗心的错误。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “overgoad”: to urge, drive, or provoke someone too much.","zh":"“overgoad”的过去式／过去分词：过度催促、驱使或刺激（某人）。"},"examples":[{"en":"They overgoaded the team with nonstop demands, and morale collapsed.","zh":"他们用不停的要求把团队逼得太紧，士气就垮了。"},{"en":"The horse was overgoaded and refused to move forward.","zh":"那匹马被过度驱赶，拒绝再往前走。"}]}],"synonyms":["pushed too far","pressured","driven","provoked","overstimulated"],"phonetic":"/ˌoʊvɚˈɡoʊdɪd/","extraExplanation":["“goad”原意是“（赶牲畜用的）刺棒、赶牛棒”，引申为“刺激、逼迫”。加上前缀“over-”（过度地）就变成“逼得太过火”。因此它常带有“适得其反”的语气：压力过大反而导致崩溃、反抗或失误。","使用场景多见于较正式或文学化的表达。日常口语里更常用：pushed too hard, pressured too much, provoked too far（逼得太紧/逼得太过）。"]}
{"word":"overgoading","summary":{"en":"Overgoading means pushing or pressuring someone (or yourself) too hard.","zh":"overgoading 指对他人或自己施加过度压力或驱使得太狠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pushing or urging someone too hard; pressuring beyond what is reasonable or helpful.","zh":"过度驱使；逼得太紧（超过合理或有帮助的程度）。"},"examples":[{"en":"The coach realized that his overgoading was hurting the team’s confidence.","zh":"教练意识到自己过度逼迫反而伤害了球队的自信。"},{"en":"Overgoading employees with constant deadlines can lead to burnout.","zh":"用无休止的截止日期过度催逼员工，会导致职业倦怠。"}]},{"partOfSpeech":"v.","definition":{"en":"(as a verb form) urging or driving (someone/yourself) too much; overworking or overpressuring.","zh":"（作动词形式）过度催促/驱使（他人或自己）；把人逼得过度劳累或紧张。"},"examples":[{"en":"She is overgoading herself to be perfect in every class.","zh":"她在每门课上都要求完美，把自己逼得太紧。"},{"en":"Don’t keep overgoading him—he’ll make more mistakes under pressure.","zh":"别再逼他了——压力太大他会犯更多错。"}]}],"synonyms":["pushing too hard","overpressure","drive too hard","overwork","overpush"],"phonetic":"/ˌoʊvɚˈɡoʊdɪŋ/","extraExplanation":["“goad”原意是“赶牛棒/刺棒”，引申为“刺激、驱使、怂恿”。“over-”表示“过度”，所以“overgoad”就是“刺激过头、驱使过度”。这个词在现代英语里比较少见，更常用的近义表达有：push too hard, pressure, overwork, drive (someone) too hard。"]}
{"word":"overgoads","summary":{"en":"“Overgoads” means “pushes or drives too hard.”","zh":"“overgoads”表示“过度催逼/过度驱使，把人逼得太紧”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular) urges, pressures, or drives someone (or something) too hard; pushes beyond what is reasonable or healthy.","zh":"（第三人称单数）过度催逼、过度驱使（某人或某事）；逼得太紧，超过合理或健康的程度。"},"examples":[{"en":"The strict schedule overgoads the team and leads to burnout.","zh":"过于严格的日程把团队逼得太紧，导致倦怠。"},{"en":"If fear overgoads him, he makes careless decisions.","zh":"如果恐惧感过度驱使他，他就会做出草率的决定。"},{"en":"She worries that constant criticism overgoads her child instead of helping.","zh":"她担心不断的批评是在过度逼迫孩子，而不是在帮助他。"}]}],"synonyms":["push too hard","drive too hard","pressure","urge excessively","overpress","overwork"],"phonetic":"/ˌoʊvɚˈɡoʊdz/","extraExplanation":["“overgoads”是动词“overgoad”的第三人称单数形式（he/she/it overgoads）。词由 over-（过度）+ goad（刺激、驱策；原指用赶牲口的刺棒/尖杆去驱赶）组成，所以语感上常带有“被逼得太狠、被强行驱动”的负面含义。","在较文学或正式的语境中更常见；日常口语里常用 push too hard / drive too hard / pressure too much 来表达。"]}
{"word":"overgod","summary":{"en":"An overgod is a supreme deity above other gods, or figuratively an ultimate authority.","zh":"overgod 指“凌驾众神之上的至高神”，也可比喻“终极权威/最高主宰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A supreme god above other gods; a highest deity who rules over a pantheon (common in discussions of religion, mythology, or fantasy worlds).","zh":"至高神；凌驾于其他诸神之上的最高神（常见于宗教、神话或奇幻世界观的讨论）。"},"examples":[{"en":"In some mythologies, people imagine an overgod who stands above the whole pantheon.","zh":"在一些神话想象中，人们会设想有一位凌驾整个神系之上的至高神。"},{"en":"The novel’s world-building includes an overgod who created the lesser gods.","zh":"这部小说的世界观设定中，有一位创造了下位诸神的至高神。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Someone or something treated as the ultimate power or authority.","zh":"（比喻）被当作终极权威或最高主宰的人或事物。"},"examples":[{"en":"In that company, profit can feel like an overgod that decides everything.","zh":"在那家公司里，利润有时像“至高主宰”一样决定一切。"},{"en":"He spoke as if tradition were an overgod that could never be questioned.","zh":"他说话的样子仿佛传统是不可质疑的最高权威。"}]}],"synonyms":["supreme deity","high god","creator god","ultimate authority"],"phonetic":"/ˈoʊvɚˌɡɑd/","extraExplanation":["“over-”表示“在……之上/超过”，因此 overgod 字面意思就是“在众神之上的神”。","该词在日常口语中不算常用，更常见于宗教学/神话学写作，以及奇幻、桌游或游戏设定（world-building）。"]}
{"word":"overgodliness","summary":{"en":"“Overgodliness” means excessive (often criticized) godliness or piety.","zh":"“overgodliness”指过度（常带批评意味）的虔诚或敬神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or showy religious devotion; being “too pious” in a way that can feel self-righteous or unrealistic.","zh":"过度的虔诚；（带贬义的）过分或做作的宗教热心，给人自以为义或不切实际的感觉。"},"examples":[{"en":"Some readers felt the character’s overgodliness made him seem judgmental rather than kind.","zh":"一些读者觉得这个角色的过度虔诚让他显得爱评判人，而不是善良。"},{"en":"The novel criticizes overgodliness that focuses on rules instead of compassion.","zh":"这部小说批评那种只盯着规矩、不重怜悯的过度虔诚。"}]}],"synonyms":["overpiety","excessive piety","self-righteousness","holier-than-thou attitude"],"phonetic":"/ˌoʊvɚˈɡɑdlɪnəs/","extraExplanation":["“overgodliness”不是常见标准词，更像是临时造词（nonce word），由前缀 over-（过度）+ godliness（虔诚、敬神）组成。写作中用它通常是在表达批评：不是单纯“很虔诚”，而是“虔诚到过头/流于表演”。","更自然、常见的替代说法包括：overpiety（过度虔诚）、self-righteousness（自以为义）、holier-than-thou attitude（自命清高的姿态）。如果你想表达中性或褒义的“非常虔诚”，更常用 deep faith（深厚信仰）或 devoutness（虔诚）。"]}
{"word":"overgodly","summary":{"en":"Overgodly means excessively godly or pious, often implying a negative, judgmental, or performative kind of holiness.","zh":"overgodly 指“过分虔诚/过度神圣”，常含贬义，带有做作、评判他人的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Excessively “godly” or pious; showing religion or holiness in a way that feels too extreme, performative, or self-righteous.","zh":"（罕见）过于“神圣/虔诚”的；宗教感或圣洁感表现得过头，常带有做作、假虔诚或自以为义的负面含义。"},"examples":[{"en":"His overgodly speeches made some people feel judged rather than inspired.","zh":"他那些过分虔诚的演讲让一些人觉得被评判，而不是被鼓舞。"},{"en":"The novel criticizes an overgodly hero who uses faith to control others.","zh":"这部小说批评了一位“过度神圣”的主角，他用信仰来控制他人。"}]}],"synonyms":["overly pious","holier-than-thou","sanctimonious","self-righteous","pietistic"],"phonetic":"/ˌoʊvərˈɡɑdli/","extraExplanation":["“overgodly”不是常见标准词，更多见于写作中的临时造词（nonce word）或修辞用法。","构词：over-（过度、太……）+ godly（虔诚的、像神一样的）。语气常带批评，接近“过分虔诚/装虔诚”。使用时多用于人物描写、讽刺或评论。"]}
{"word":"overgoing","summary":{"en":"“Overgoing” means going beyond a proper limit; it’s also the -ing form of the rare verb “overgo” (to exceed).","zh":"overgoing 表示“超出适当界限、过度的”；也可作罕见动词 overgo（超过）的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Going beyond a limit; excessive; surpassing what is usual or acceptable.","zh":"超出界限的；过度的；超过通常或可接受范围的。"},"examples":[{"en":"His overgoing ambition eventually harmed his relationships.","zh":"他过度的野心最终伤害了人际关系。"},{"en":"The plan’s costs became overgoing, far beyond the original budget.","zh":"这个计划的成本变得过高，远远超过最初预算。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “overgo”: to go beyond, exceed, or surpass.","zh":"“overgo”的现在分词：超越；超过；胜过。"},"examples":[{"en":"In old writings, you may see “overgoing the bounds of reason.”","zh":"在旧文献里，你可能会看到“overgoing the bounds of reason（超出理性的界限）”。"},{"en":"The river was overgoing its banks after days of heavy rain. (literary/old-fashioned)","zh":"连日大雨后，河水漫过了河岸。（文学/较旧用法）"}]}],"synonyms":["excessive","extreme","immoderate","exceeding","unrestrained"],"phonetic":"/ˌoʊvɚˈɡoʊɪŋ/","extraExplanation":["“overgoing”在现代英语里很少单独使用，更常见的是用“excessive / extreme / going beyond”来表达同样意思。你更可能在较旧的文学作品、宗教或哲学写作中看到它。","相关词源上它来自“over-（过度）+ go（走、进行）”，语感上强调“越过某种界限/尺度”。日常写作中用它会显得古风或刻意。"]}
{"word":"overgone","summary":{"en":"“Overgone” is a rare, old-fashioned word meaning “past/bygone,” and it can also be the past participle of “overgo” (“to surpass/exceed”).","zh":"“overgone”是很少见的古语，多指“已过去/已成往事”；也可作“overgo（超过/超越）”的过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) Past; gone by; finished or no longer present.","zh":"（古语/文学用法）过去的；已逝的；结束的、不再存在的。"},"examples":[{"en":"Those overgone days still live in her memory.","zh":"那些已逝的日子仍留在她的记忆里。"},{"en":"We should learn from past mistakes, not be trapped by what is overgone.","zh":"我们应从过去的错误中学习，而不是被已成往事的东西困住。"}]},{"partOfSpeech":"other","definition":{"en":"Past participle of the verb “overgo” (rare): to go beyond; to surpass or exceed.","zh":"动词“overgo”的过去分词（少见）：超过；超越；胜过。"},"examples":[{"en":"His ambition had overgone his judgment.","zh":"他的野心已经超越了判断力。"},{"en":"The costs have overgone what we originally planned.","zh":"成本已经超过了我们最初的计划。"}]}],"synonyms":["bygone","past","gone","over","finished","exceeded","surpassed","gone beyond"],"phonetic":"ˌoʊvərˈɡɔn","extraExplanation":["“overgone”在现代英语中非常少见，多见于旧文学或仿古文体里，用来表达“已过去的、已成往事的”。日常写作里更常用：bygone, past, gone, over, finished。","作为“overgo”的过去分词时也很少见；现代更常用 exceed, surpass, go beyond。"]}
{"word":"overgood","summary":{"en":"Overgood means “too good,” often implying an unnatural or annoying level of virtue.","zh":"overgood 指“好得过头”，常带有“过于做作或令人反感的道德感/善良”的暗示。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too good in a way that seems unnatural, overly moral, or annoyingly virtuous; excessively “good.”","zh":"过分善良（好到不自然）、过度道德化；好得让人觉得做作或招人烦。"},"examples":[{"en":"He’s so overgood in meetings that it feels like he’s trying to impress the boss.","zh":"他在会议上善良得过头，让人感觉是在刻意讨好老板。"},{"en":"The story’s hero is almost overgood, with hardly any flaws.","zh":"这个故事的主角几乎好得过头，几乎没有缺点。"}]}],"synonyms":["overly virtuous","too good","holier-than-thou","goody-goody"],"phonetic":"/ˌoʊvɚˈɡʊd/","extraExplanation":["“overgood”不是常见的日常用词，更常见的写法是“over-good”（带连字符），语气通常带一点批评或讽刺，强调“好得过头”让人不舒服或不真实。","在文学或较旧的英语里，它有时用来形容“过于虔诚/过于正派”的人，暗示缺乏人性化的缺点与冲突。更口语的表达可用“too good to be true（好得不真实）”“overly virtuous（过于品行端正）”“holier-than-thou（自以为比别人更圣洁）”。"]}
{"word":"overgorge","summary":{"en":"Overgorge means to eat or fill something excessively—more than is healthy or appropriate.","zh":"overgorge 指吃得过量（暴食），或把某物塞得/装得过满。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to eat far too much; to stuff oneself (or someone) excessively","zh":"吃得过多；暴食（或把……喂得过饱）"},"examples":[{"en":"After the buffet, he overgorged and felt sick.","zh":"自助餐后他吃得太多，觉得不舒服。"},{"en":"Try not to overgorge on sweets before dinner.","zh":"晚饭前尽量别甜食吃得过量。"}]},{"partOfSpeech":"vt.","definition":{"en":"to fill something too full; to overload","zh":"使……塞得过满；使超载"},"examples":[{"en":"Don’t overgorge the bag with books—it will tear.","zh":"别把书把包塞得太满——会扯坏的。"}]}],"synonyms":["overeat","gorge","stuff oneself","binge (on)","glut"],"phonetic":"/ˌoʊvɚˈɡɔrdʒ/","extraExplanation":["“overgorge”由前缀 over-（过度）+ gorge（狼吞虎咽/塞满）构成，语气比 “eat a lot” 更强，常带有“过量到不舒服或不合适”的暗示。","这个词在现代日常英语里不算常用；更常见的表达有 “overeat”“stuff oneself”“binge (on)”（后者更强调‘放纵式暴食’）。"]}
{"word":"overgorged","summary":{"en":"Overgorged means excessively full from eating, or (figuratively) overfilled/oversupplied with something.","zh":"overgorged 指吃得过多而撑得难受，也可比喻被某物塞满或过度充斥。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having eaten too much; stuffed or uncomfortably full.","zh":"吃得过多的；（撑得）很饱、很难受的。"},"examples":[{"en":"After the buffet, I felt overgorged and could barely move.","zh":"自助餐之后我觉得撑得难受，几乎动不了。"},{"en":"Don’t drink soda when you’re already overgorged.","zh":"你已经很撑了，就别再喝汽水了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Overfilled or overly satisfied with something (information, luxury, praise, etc.).","zh":"（比喻）被某物“塞满”或过度满足的（如信息、奢侈、赞美等）。"},"examples":[{"en":"By the end of the day, I was overgorged with news and wanted silence.","zh":"到一天结束时，我被新闻信息塞得满满的，只想安静一下。"},{"en":"The market is overgorged with cheap copies.","zh":"市场上充斥着廉价仿品。"}]}],"synonyms":["stuffed","overfull","sated","overfed","glutted"],"phonetic":"ˌoʊvɚˈɡɔrdʒd","extraExplanation":["“overgorged”来自 over-（过度）+ gorge（狼吞虎咽；把……塞满）。在现代日常口语里更常说 “stuffed / too full / overfed”。“overgorged”带一点文学或夸张色彩，用来强调“过度、腻了、撑了”的感觉。"]}
{"word":"overgot","summary":{"en":"“Overgot” is an archaic form meaning “overcame” or “surpassed.”","zh":"“overgot”是古用形式，意思相当于“克服/战胜”或“胜过/超过”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) past tense/past participle of “overget,” meaning to overcome, get the better of, or surpass.","zh":"（古用）“overget”的过去式/过去分词，意为战胜、克服，或胜过、超过。"},"examples":[{"en":"In old writing, the hero says he has overgot his fear.","zh":"在古老的文字中，英雄说他已经克服了恐惧。"},{"en":"Their skill overgot their rivals’ by a wide margin. (archaic style)","zh":"他们的技艺大大胜过对手。（古风表达）"}]}],"synonyms":["overcame","conquered","surpassed","outdid","got the better of"],"phonetic":"/ˌoʊvərˈɡɑt/","extraExplanation":["“overgot”在现代英语里几乎不用，更多见于较早的文学/古英语风格中。现代英语通常用“overcame”（战胜/克服）或“surpassed / outdid”（超过/胜过）来表达。","它容易被误读为“overgotten”的变体，但“overgotten”本身也不常见；现代更自然的说法依语境改用“got over”“overcame”“beat”“surpassed”等。"]}
{"word":"overgotten","summary":{"en":"Overgotten is a rare, archaic word meaning “forgotten” or “gotten over.” In modern English, people usually say “forgotten” or “gotten over.”","zh":"overgotten 是一个很少见的古体/文学用词，意思是“被遗忘的”或“已经淡忘/释怀的”。现代英语一般用 forgotten 或 gotten over。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) past participle of “overget,” meaning “forgotten” or “gotten over (a feeling, event, or memory).”","zh":"（古体/文学用语）动词 overget 的过去分词，意思是“被遗忘的”或“已经淡忘/释怀的（情绪、事件或记忆）”。"},"examples":[{"en":"The insult was not yet overgotten; it still stung him.","zh":"那次侮辱还没有被淡忘；它仍然刺痛着他。"},{"en":"In time, many griefs are overgotten, though not erased.","zh":"随着时间推移，许多悲伤会被慢慢释怀，但并不会被抹去。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, nonstandard) “Gotten too much” or “over-acquired”; this use is uncommon and often sounds incorrect in modern English.","zh":"（罕见/非标准）“得到得太多/过度获得”；这种用法很少见，在现代英语里常被认为不自然或不正确。"},"examples":[{"en":"This reading is overgotten from the evidence and needs revision.","zh":"这个解读是从证据中“推得过头了”，需要修订。"}]}],"synonyms":["forgotten","gotten over","outgrown","put behind (someone)","moved past"],"phonetic":"/ˌoʊvərˈɡɑtən/","extraExplanation":["“overgotten”在现代英语中非常少见，最常见的场景是模仿较旧的文学语气（类似于“forgotten / gotten over”）。日常写作与口语里通常直接用“forgotten”或“gotten over”。","“over-”在这里表示“越过、超越”，而“get”有“获得/变成/理解/摆脱”等含义；合起来的古义更接近“越过去了 → 不再被其困扰 → 淡忘/释怀”。"]}
{"word":"overgovern","summary":{"en":"“Overgovern” means to govern or regulate too much, with excessive control or rules.","zh":"“overgovern”指“过度治理/管得太多”，用过多控制或规定来管理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to govern or regulate too much; to control people or activities with excessive rules or interference","zh":"过度治理；管得太多（用过多规定或干预来控制人或事务）"},"examples":[{"en":"Some critics say the city is trying to overgovern street vendors with too many permits and inspections.","zh":"一些批评者说，这座城市用太多许可和检查来过度管理街头小贩。"},{"en":"When leaders overgovern, people may feel less freedom and less trust in the system.","zh":"当领导者过度治理时，人们可能会感到自由更少、对制度的信任也更低。"}]}],"synonyms":["overregulate","overcontrol","micromanage","overmanage"],"phonetic":"/ˌoʊvərˈɡʌvərn/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过正常程度”。所以 overgovern 直译就是“治理过头”。它常见于政治、公共政策、商业监管等语境，带有批评意味。","在更日常的表达里，人们也常用 overregulate（过度监管）、micromanage（事无巨细地管/微管理）来表达类似意思，语气通常更常见、更自然。"]}
{"word":"overgovernment","summary":{"en":"“Overgovernment” means excessive government control or regulation.","zh":"“Overgovernment”指政府管制或干预过多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Too much government control, regulation, or interference in people’s lives or in the economy.","zh":"政府管制、规章或干预过多（对个人生活或经济的影响过强）。"},"examples":[{"en":"Some small business owners complain about overgovernment when new rules make it harder to hire workers.","zh":"一些小企业主在新规定让雇人更困难时，会抱怨这是“政府管得太多”（overgovernment）。"},{"en":"The debate is often framed as a choice between necessary public protection and overgovernment.","zh":"这场争论常被描述为在“必要的公共保护”和“过度政府干预”之间做选择。"}]}],"synonyms":["overregulation","excessive regulation","government overreach","red tape"],"phonetic":"/ˌoʊvərˈɡʌvərnmənt/","extraExplanation":["“overgovernment”常见于政治评论、社论与公共政策讨论中，带有明显的价值判断，通常由主张“小政府/减少监管”的人使用。反对者可能会用“公共安全”“消费者保护”“环境监管”等角度来回应。","在英美语境中，它常与“overregulation（过度监管）”“red tape（繁文缛节）”一起出现，用来强调规则太多、程序太复杂、办事成本太高。"]}
{"word":"overgown","summary":{"en":"An overgown is a loose outer gown worn over other clothes, especially in historical or formal contexts.","zh":"overgown 指穿在其他衣服外面的宽松外罩袍，常用于历史或正式场景的描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loose outer gown or robe worn over other clothing; an outer garment (often historical or formal).","zh":"外罩袍；罩衣（穿在其他衣服外面的宽松外衣，常见于历史或正式场合）。"},"examples":[{"en":"In the portrait, she wears a velvet overgown over a pale silk dress.","zh":"在那幅肖像里，她在浅色丝绸裙外穿着一件天鹅绒外罩袍。"},{"en":"The costume designer chose an overgown to make the character look noble and traditional.","zh":"服装设计师选用外罩袍，让角色显得高贵而传统。"}]}],"synonyms":["robe","cloak","outer gown","mantle"],"phonetic":"/ˈoʊvərˌɡaʊn/","extraExplanation":["“overgown”多见于历史服饰、戏剧/影视服装、博物馆说明或文学描写中，现代日常英语里更常说“robe”“cloak”“outer gown”。","词形很直观：over-（在……外面）+ gown（长袍/礼服），字面意思就是“穿在外面的长袍”。"]}
{"word":"overgrace","summary":{"en":"“Overgrace” is a rare, literary verb meaning to add too much grace—either by over-decorating something or by honoring someone excessively.","zh":"“overgrace”是较少见、偏文学的动词，表示“过度增添优雅/恩惠”：要么指过分装饰美化事物，要么指过分恩宠、抬举某人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to grace or decorate too much; to make something seem overly refined, showy, or flattering by adding excessive “grace.”","zh":"过度装饰；过分美化（使事物显得太精致、太花哨或过于奉承）。"},"examples":[{"en":"The editor warned that too many poetic metaphors could overgrace the simple message.","zh":"编辑提醒说，太多诗意的隐喻会把原本简单的信息过度美化。"},{"en":"She wanted the speech to feel sincere, not overgraced with compliments.","zh":"她希望演讲真诚，而不是用一堆恭维话过分修饰。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat someone with excessive favor or honor; to “grace” a person too much.","zh":"过分恩宠或抬举某人；对某人过度施以荣宠。"},"examples":[{"en":"In the story, the king overgraced one courtier, which made others resentful.","zh":"在故事里，国王过分恩宠一位侍臣，引起其他人不满。"}]}],"synonyms":["overdecorate","overembellish","overadorn","overpraise"],"phonetic":"ˌoʊvərˈɡreɪs","extraExplanation":["“overgrace”在现代英语中非常少见，更多出现在较早期或带文学色彩的文本里。学习时可把它理解为“over-（过度）+ grace（优雅/恩惠/装饰）”。","日常表达中，更常用的替代说法有：overdecorate（过度装饰）、overembellish（过分渲染/润色）、lay it on thick（奉承得太过头，口语）。"]}
{"word":"overgracious","summary":{"en":"“Overgracious” means excessively polite or thankful, often to the point of seeming unnatural or insincere.","zh":"“overgracious”指过分客气或过度道谢/夸赞，常给人不自然甚至不真诚的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively polite, thankful, or praising—so much that it can feel unnatural, insincere, or uncomfortable.","zh":"过分客气（或过度道谢/夸赞）的；客气到让人觉得不自然、像是在奉承或不真诚。"},"examples":[{"en":"He was so overgracious in his email that it sounded like flattery rather than thanks.","zh":"他在邮件里客气得过头，听起来更像奉承而不是真心道谢。"},{"en":"You don’t need to be overgracious—just a simple “thank you” is fine.","zh":"你不用这么过分客气，一句“谢谢”就够了。"},{"en":"Her overgracious compliments made the conversation awkward.","zh":"她过分客气的夸奖让谈话变得尴尬。"}]}],"synonyms":["overly polite","too polite","effusive","fawning","obsequious"],"phonetic":"/ˌoʊvɚˈɡreɪʃəs/","extraExplanation":["“over-”表示“过度、太……”。因此 overgracious 常带一点负面语气，暗示“客气过头”可能显得不真诚或让人不自在。","在日常英语中，这个词相对少见；更常用的近义表达有 overly polite / too polite / fawning / effusive（语气从中性到更负面不等）。使用时可根据语境选择更自然的说法。"]}
{"word":"overgraciously","summary":{"en":"“Overgraciously” means being polite or kind to an excessive degree, often seeming unnatural or insincere.","zh":"“overgraciously”指过分殷勤/过度客气，常带有不自然或不真诚的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Too politely or kindly in a way that feels excessive, unnatural, or insincere.","zh":"过分殷勤地；过度客气地（以至于显得不自然或不真诚）。"},"examples":[{"en":"He thanked the audience overgraciously, as if he were trying too hard to be liked.","zh":"他对观众道谢时过分客气，像是在刻意讨好。"},{"en":"The manager replied overgraciously, which made her apology sound less honest.","zh":"经理回得过于殷勤，反而让她的道歉听起来没那么真诚。"}]}],"synonyms":["excessively politely","overly politely","too graciously","obsequiously","effusively"],"phonetic":"/ˌoʊvɚˈɡreɪʃəsli/","extraExplanation":["“over-”常表示“过度、太……”；“gracious”意为“亲切的、客气的”。把它们合在一起，“overgraciously”通常带一点负面或讽刺意味：不是单纯的“很有礼貌”，而是“礼貌过头”。","这种词在书面语或评论性语境里更常见，用来暗示对方在社交场合“用力过猛”、可能在讨好、掩饰或做作。"]}
{"word":"overgraciousness","summary":{"en":"Overgraciousness means too much politeness or courtesy, sometimes seeming unnatural or insincere.","zh":"Overgraciousness 指“过度客套/过度礼貌”，有时会显得不自然或不真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive politeness, kindness, or courtesy—often so strong that it can feel unnatural, overly formal, or even insincere.","zh":"过度的礼貌、和善或殷勤——强烈到可能让人觉得不自然、过分客套，甚至显得不真诚。"},"examples":[{"en":"Her overgraciousness made the conversation feel stiff, as if everyone had to watch their words.","zh":"她的过度客套让对话显得很拘谨，好像每个人都得小心措辞。"},{"en":"He apologized three times for a small mistake; the overgraciousness was unnecessary.","zh":"他为一个小失误道歉了三次；这种过度谦恭其实没必要。"},{"en":"Some customers mistake a server’s overgraciousness for friendliness, while others find it fake.","zh":"有些顾客会把服务员的过度殷勤当作友好，但也有人觉得很假。"}]}],"synonyms":["overpoliteness","excessive courtesy","overcourteousness","obsequiousness","ingratiation"],"phonetic":"/ˌoʊvɚˈɡreɪʃəsnəs/","extraExplanation":["构词上是 over-（过度）+ gracious（亲切有礼的）+ -ness（名词后缀）。这个词常带一点负面含义：不是单纯“很有礼貌”，而是“礼貌过头”，可能让人感觉在讨好、奉承或不够真诚。","在跨文化语境中需要注意：某些文化更强调“客套/礼节”，在这些场景里看似“overgracious”的表达未必是虚伪，而可能是对关系与场面的尊重。"]}
{"word":"overgrade","summary":{"en":"Overgrade means to grade or evaluate someone/something too highly.","zh":"overgrade 指给某人或某事打分/评价过高。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone or something a higher grade, score, or evaluation than is deserved","zh":"把（某人或某事）评得过高；给出高于实际水平的分数/评价"},"examples":[{"en":"Some teachers worry that they may overgrade students who participate a lot in class.","zh":"有些老师担心自己会因为学生课堂参与度高而把分数评得过高。"},{"en":"If you overgrade this essay, the student may not realize what needs improvement.","zh":"如果你把这篇作文评得过高，学生可能意识不到需要改进的地方。"},{"en":"The app’s algorithm can overgrade short, fluent answers and miss deeper problems.","zh":"这个应用的算法可能会把简短流畅的回答评得过高，而忽略更深层的问题。"}]}],"synonyms":["overrate","inflate (a grade)","grade too leniently","give too high a grade"],"phonetic":"/ˌoʊvərˈɡreɪd/","extraExplanation":["“overgrade”在日常英语中不算常见，更常用的表达包括：overrate（高估/评价过高）、give too high a grade（给分太高）、grade too leniently（评分太宽松）。","在教育语境里，overgrade 常带有“评分偏松/通融”的暗示；若想强调“系统性偏高”，也可说 grade inflation（成绩膨胀）。"]}
{"word":"overgraded","summary":{"en":"“Overgraded” usually means something was given too high a grade (too generous). Less commonly, it can mean graded too strictly or in too much detail.","zh":"“overgraded”通常指“给分过高、评得过于宽松”；较少情况下也可指“评分过严或批改过度”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"given a higher grade than deserved; evaluated too generously (often leading to grade inflation).","zh":"被打得过高分；评得过于宽松（常导致“成绩膨胀”）。"},"examples":[{"en":"Some students felt the essay was overgraded because it ignored major mistakes.","zh":"有些学生觉得这篇作文被打得过高分，因为明显错误被忽略了。"},{"en":"The school worried that too many overgraded assignments would make grades meaningless.","zh":"学校担心如果作业普遍被打得过高分，成绩就会失去意义。"}]},{"partOfSpeech":"adj.","definition":{"en":"graded or marked too much or too strictly; assessed in an overly detailed or harsh way (less common).","zh":"被过度批改/评分；评得过细或过严（较不常见）。"},"examples":[{"en":"I liked the class, but the homework felt overgraded with too many tiny point deductions.","zh":"我喜欢这门课，但作业感觉被过度评分了，很多小地方都扣分。"},{"en":"Try not to overgrade every quiz; focus on the main learning goals.","zh":"别把每次小测都评分得太苛刻；把重点放在主要学习目标上。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “overgrade”: to grade too generously or too strictly; to overestimate the grade of something.","zh":"“overgrade”的过去式/过去分词：给分过高或过严；对等级/评分作出过高估计。"},"examples":[{"en":"The teacher overgraded the first batch of papers and had to adjust later.","zh":"老师第一批试卷给分过高，后来不得不调整。"}]}],"synonyms":["overmarked","overrated (in some contexts)","graded too leniently","graded too harshly"],"phonetic":"/ˌoʊvɚˈɡreɪdɪd/","extraExplanation":["在学校语境里，“overgraded”最常被理解为“给分偏高”（和 grade inflation/成绩膨胀有关）。但在少数语境中也可能指“批改得过细、扣分过多”。判断含义时，可以看上下文是在抱怨“分太高不公平”还是“扣分太多太严”。","在地质/地形学中，grade 也可指“坡度/梯度”。因此 overgraded 偶尔会出现在技术语境，表示“坡度被调整得过头/不合理”，但日常英语里不常见。"]}
{"word":"overgrading","summary":{"en":"Overgrading means giving grades that are higher than deserved (grading too leniently).","zh":"Overgrading 指把成绩打得过高、评分过于宽松。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of giving students higher scores or grades than their work actually deserves; grading too generously.","zh":"给出高于实际水平的分数或等级；评分过于宽松（常指教师或学校把成绩打得偏高）。"},"examples":[{"en":"Some parents complained about overgrading because top marks became too common.","zh":"一些家长抱怨存在 overgrading，因为高分变得太普遍了。"},{"en":"Overgrading can make it harder to tell who truly mastered the material.","zh":"过度给分会让人更难判断谁真正掌握了知识。"},{"en":"The school reviewed its policies after accusations of overgrading.","zh":"学校在被指责过度给分后审查了相关政策。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of grading (marking) in an overly positive or lenient way.","zh":"过于正面或宽松地进行评分的行为或过程。"},"examples":[{"en":"The principal asked teachers to avoid overgrading and use the rubric carefully.","zh":"校长要求老师避免过度给分，并严格按照评分标准执行。"},{"en":"Overgrading often happens when deadlines are tight and feedback is rushed.","zh":"当截止日期很紧、反馈很仓促时，过度给分更容易发生。"}]}],"synonyms":["grade inflation","lenient grading","easy grading","generous marking","inflated grades"],"phonetic":"/ˌoʊvərˈɡreɪdɪŋ/","extraExplanation":["“overgrading”在教育语境里常与“grade inflation（成绩通胀）”相关：当整体分数普遍偏高时，成绩的区分度下降，可能影响奖学金、升学或用人判断。","它通常带有批评意味（暗示不公平或标准变松）；若想更中性，可说“lenient grading（宽松评分）”。"]}
{"word":"overgraduated","summary":{"en":"“Overgraduated” is a rare word meaning “too finely graded/too many gradations,” often about color or tone transitions.","zh":"“overgraduated”很少用，意思是“分级/渐变过度、层次过细”，常用于描述颜色或明暗过渡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) having been graduated too much or too finely; showing an excessive number of small steps or changes (especially in shading, color, tone, or intensity).","zh":"（罕见）被“分级/渐变”得过度的；变化步阶过多、过细的（尤指阴影、颜色、色调或强度的渐变/层次）。"},"examples":[{"en":"The sky looks overgraduated in this print—the gradient has too many tiny bands.","zh":"这张印刷品里的天空看起来渐变过度——出现了太多细小的色带。"},{"en":"To avoid an overgraduated background, use a simpler two- or three-step fade.","zh":"为了避免背景渐变过度，可以用更简单的两到三段式淡出。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, past participle of “overgraduate”) to make something progress in too many stages; to increase, reduce, or organize in more steps than necessary.","zh":"（罕见，“overgraduate”的过去分词）把某事分成过多阶段；用不必要的太多层级来增加、减少或安排。"},"examples":[{"en":"The new policy overgraduated the penalties, making the system hard to follow.","zh":"新政策把惩罚分级分得过细，导致制度很难理解。"},{"en":"They overgraduated the training plan, so beginners felt overwhelmed.","zh":"他们把训练计划拆得过多阶段，初学者因此感到吃不消。"}]}],"synonyms":["overly graduated","too finely graded","overgraded","with too many gradations","over-stratified"],"phonetic":"ˌoʊvɚˈɡrædʒuˌeɪtɪd","extraExplanation":["“overgraduated”在现代英语里非常少见，多出现在较专业或描述性语境（如印刷、摄影、设计）中，用来表达“渐变/分级过头”。日常表达更常用：overly graduated、too gradual、too finely graded、with too many gradations。","与图像相关时，它常暗示视觉问题：渐变不够平滑，反而出现“条带/色带”（banding）。"]}
{"word":"overgrain","summary":{"en":"Overgrain means to make a surface (especially leather) too strongly textured, or describes something with an exaggerated grain.","zh":"Overgrain 指（尤指皮革）把表面纹理做得过重，也可形容“纹理过于明显/不自然”的成品。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(especially of leather or a surface) to give too strong a grain/texture to; to make the natural pattern look exaggerated.","zh":"（尤指皮革或表面）使纹理过重；把天然纹路压得过于明显。"},"examples":[{"en":"The press can overgrain the leather if the rollers are too hot.","zh":"如果滚轮温度太高，压纹机可能会把皮革压得纹理过重。"},{"en":"They chose a gentler finish so the cover wouldn’t be overgrained.","zh":"他们选择了更柔和的表面处理，避免封面纹理过重。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become too strongly grained or textured.","zh":"（表面）变得纹理过重。"},"examples":[{"en":"Some imitation leather can overgrain after repeated heat and pressure.","zh":"有些人造革在反复受热和受压后会出现纹理过重的情况。"}]},{"partOfSpeech":"adj.","definition":{"en":"having an excessively strong grain/texture (often describing leather, paper, or a finished surface).","zh":"（常形容皮革、纸张或成品表面）纹理过重的；纹路过于明显的。"},"examples":[{"en":"The overgrain pattern made the wallet look less natural.","zh":"纹理过重的图案让钱包看起来不那么自然。"},{"en":"Avoid overgrain finishes if you want a smooth, minimal look.","zh":"如果你想要光滑、极简的效果，就要避免纹理过重的表面处理。"}]}],"synonyms":["over-texture","make the grain too strong","too heavily grained","overly textured"],"phonetic":"/ˌoʊvɚˈɡreɪn/","extraExplanation":["“overgrain”多见于皮革、装帧、材料表面处理等语境，属于相对专业、低频词。日常英语里更常用的表达是“too heavily grained / overly textured / the grain is too strong”。","在皮革工艺中，grain 指皮面天然或压印出来的“纹理”。overgrain 通常带有负面评价，暗示质感不自然、过于粗糙或“压纹过度”。"]}
{"word":"overgrainer","summary":{"en":"Overgrainer is a rare trade term for a person who adds an extra wood-grain effect layer over an existing finish.","zh":"Overgrainer 是较少见的行业词，指在已有涂装上再叠加一层仿木纹效果的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, trade use) A decorator or painter who applies an extra layer of “graining” (a wood-grain effect) over an earlier finish; someone who over-grains a surface.","zh":"（罕见；行业用语）在已有涂装上再加一层“木纹仿饰/画木纹”的装饰工（或做这一步的人）；把木纹效果做得“更上一层”的人。"},"examples":[{"en":"The overgrainer added a darker pass to make the faux oak grain look deeper.","zh":"那位 overgrainer 又加了一道更深的颜色，让仿橡木的纹理看起来更有层次。"},{"en":"After the base coat dried, an overgrainer came in to refine the lines.","zh":"底漆干了之后，overgrainer 进场把纹路细节再修一修。"}]}],"synonyms":["grainer","faux finisher","decorative painter"],"phonetic":"ˌoʊvərˈɡreɪnər","extraExplanation":["“grainer”可指做仿木纹（wood graining / faux graining）的工匠；“over-”在这里带有“再加一层/在原有基础上叠加”的意思，所以“overgrainer”更像是工序或角色称呼，并不是常见日常词汇。","在现代英语里，更常见的说法通常是 grainer、faux finisher（仿饰工）、decorative painter（装饰性涂装工）。"]}
{"word":"overgrasping","summary":{"en":"Overgrasping means trying to take or gain too much, showing excessive greed or ambition.","zh":"Overgrasping 指过分贪求、想得到太多，表现出过度的贪婪或野心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trying to get or take too much; overly greedy or overly ambitious in what one seeks to gain.","zh":"想得到或占有过多的；过分贪心的、过分野心勃勃的。"},"examples":[{"en":"His overgrasping demands damaged the trust between the partners.","zh":"他过分的索取破坏了合伙人之间的信任。"},{"en":"The story warns that overgrasping rulers often lose what they already have.","zh":"这个故事警示：过分贪求的统治者往往会失去已拥有的一切。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or habit of reaching for too much; excessive grasping (often about power, money, or advantage).","zh":"过度攫取、过度追求（常指权力、金钱或利益）。"},"examples":[{"en":"Overgrasping can turn healthy ambition into reckless risk-taking.","zh":"过度攫取会把健康的上进心变成鲁莽的冒险。"}]}],"synonyms":["greedy","grasping","avaricious","overreaching","rapacious"],"phonetic":"/ˌoʊvərˈɡræspɪŋ/","extraExplanation":["“overgrasping”不算常见的日常词，更常见的表达是 greedy（贪婪的）、grasping（贪婪的）、overreaching（野心过大/伸手太长）或 trying to take more than one’s share（想拿超过自己应得的份额）。","它带有较明显的文学/修辞色彩：用“grasp（抓住）”的形象来强调“伸手太多、想一把抓”的贪求，常用于道德劝诫、政治或历史评论的语境。"]}
{"word":"overgrateful","summary":{"en":"“Overgrateful” means excessively thankful, sometimes to the point of seeming awkward or insincere.","zh":"“overgrateful”表示过度感激，有时会显得尴尬或不够自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively or too openly thankful; showing more gratitude than the situation seems to require (sometimes sounding insincere or awkward).","zh":"过度感激的；感激之情表达得太多或太夸张（有时会显得不真诚或尴尬）。"},"examples":[{"en":"He sounded overgrateful for a small favor, which made the conversation uncomfortable.","zh":"他对一个小忙表现得过度感激，让对话有点尴尬。"},{"en":"I didn’t want to seem overgrateful, so I just said, “Thank you, I appreciate it.”","zh":"我不想显得过度感激，所以只说：“谢谢，我很感激。”"}]}],"synonyms":["overly grateful","too grateful","excessively grateful","effusively grateful"],"phonetic":"/ˌoʊvɚˈɡreɪtfəl/","extraExplanation":["“overgrateful”不是最常见、最固定的标准搭配；日常英语里更常说“overly grateful”“too grateful”“excessively grateful”或“effusively grateful（感激之情溢于言表的）”。","语气上，“overgrateful”常带一点评价意味：说话者觉得对方的感谢程度“超过了应有的分寸”，可能让人觉得不自在，甚至像是在刻意讨好。"]}
{"word":"overgratefully","summary":{"en":"“Overgratefully” means “too gratefully,” in an excessive way.","zh":"“overgratefully”意为“过分地感激/感谢过头”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in an excessively grateful way; showing more thanks than the situation seems to call for","zh":"过分地感激；感谢得有点超过情境所需"},"examples":[{"en":"He spoke overgratefully, thanking everyone again and again for a small favor.","zh":"他感谢得有点过头，为了一个小忙反复向大家道谢。"},{"en":"She smiled overgratefully, as if the compliment were a huge gift.","zh":"她笑得过分感激，好像那句夸奖是一份大礼。"}]}],"synonyms":["too gratefully","overly gratefully","excessively gratefully","with excessive gratitude"],"phonetic":"/ˌoʊvɚˈɡreɪtfəli/","extraExplanation":["“overgratefully”在现代英语中很少见，很多写作里会被认为不够自然或不标准。更常用的表达有：“too gratefully / overly gratefully / excessively gratefully”。","前缀“over-”常用来表示“过度、超过适当程度”（如 overconfident 过度自信，overreact 反应过度）。因此它传达的语气通常带一点“有点过头”的评价。"]}
{"word":"overgratefulness","summary":{"en":"Overgratefulness means showing too much gratitude, to the point that it seems exaggerated or uncomfortable.","zh":"overgratefulness 指“过度的感激”，夸张到让人不自在或显得不真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive gratitude or appreciation, especially when it feels exaggerated, uncomfortable, or insincere to others.","zh":"过度的感激；（尤指）感激之情表达得太夸张、让人不自在，甚至显得不真诚。"},"examples":[{"en":"Her overgratefulness made the simple favor feel like a huge sacrifice.","zh":"她过度的感激让这个小忙看起来像是很大的牺牲。"},{"en":"He responded with such overgratefulness that I didn’t know how to continue the conversation.","zh":"他回以过度的感激，我都不知道该怎么把话题继续下去。"}]}],"synonyms":["excessive gratitude","over-the-top gratitude","effusiveness","gushing gratitude"],"phonetic":"/ˌoʊvɚˈɡreɪtfəlnəs/","extraExplanation":["“Overgratefulness”不是特别常见的标准词，更常见的表达是“excessive gratitude / over-the-top gratitude / being overly grateful”。但在写作或口语中，人们仍可能用它来强调“感激过了头”。","前缀“over-”表示“过度、过头”，所以该词通常带一点负面或尴尬的语气：不是否定感激本身，而是指表达的分量与实际情况不匹配。"]}
{"word":"overgratification","summary":{"en":"Overgratification means getting too much pleasure or satisfaction—excessive indulgence.","zh":"overgratification 指“过度满足/过度享乐”，即获得太多快感或满足，带有不良后果的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive pleasure or satisfaction from having desires or needs met; too much indulgence.","zh":"过度满足；过度享乐（指欲望或需求被满足得太多，以至于不健康或不合适）。"},"examples":[{"en":"The constant snacking was a form of overgratification that left him feeling worse, not better.","zh":"不停吃零食是一种过度满足，结果让他感觉更糟而不是更好。"},{"en":"Some parents worry that overgratification can reduce a child’s patience and resilience.","zh":"一些家长担心过度满足会降低孩子的耐心和抗挫力。"},{"en":"After weeks of parties, she realized the overgratification wasn’t bringing real happiness.","zh":"连续几周参加派对后，她意识到这种过度享乐并没有带来真正的幸福。"}]}],"synonyms":["overindulgence","excess","self-indulgence","too much gratification","overindulgence of desires"],"phonetic":"/ˌoʊvɚˌɡrætəfəˈkeɪʃən/","extraExplanation":["“overgratification”在日常英语中不算常见，更常用的表达有“overindulgence（过度放纵/溺爱）”“excessive indulgence（过度纵欲/纵乐）”或“too much gratification（过多的满足）”。","构词上是 over-（过度）+ gratification（满足、快感）。语境常见于心理学、育儿、成瘾或自我管理话题，用来强调“满足过量”带来的负面后果。"]}
{"word":"overgratified","summary":{"en":"Overgratified means excessively satisfied or indulged—pleased “too much.”","zh":"overgratified 指“过度满足/被过分取悦或纵容”，开心或满足到有点过头。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively pleased or satisfied; pleased to the point of having “too much” enjoyment or fulfillment.","zh":"过度满足的；过分开心/满意的（满足到有点“太过头”）。"},"examples":[{"en":"After weeks of praise, he felt overgratified and stopped trying to improve.","zh":"在连续几周的夸奖之后，他感到过度满足，反而不再努力进步。"},{"en":"The audience left the show happy, but not overgratified—still wanting a little more.","zh":"观众离开展出时很开心，但并没有过度满足——仍然意犹未尽。"}]},{"partOfSpeech":"adj.","definition":{"en":"Given too much pleasure or reward; overindulged (often describing a person who is spoiled by constant gratification).","zh":"被过度取悦/过度奖赏的；被过分纵容的（常指因不断满足而被宠坏）。"},"examples":[{"en":"An overgratified child may struggle with patience and gratitude.","zh":"被过度满足的孩子可能更难学会耐心和感恩。"},{"en":"The company worried that overgratified customers would expect discounts forever.","zh":"公司担心被“喂得太饱”的顾客会永远期待折扣。"}]}],"synonyms":["overindulged","oversatisfied","pampered","spoiled","sated"],"phonetic":"/ˌoʊvərˈɡrætəˌfaɪd/","extraExplanation":["“overgratified”是由前缀 over-（过度）+ gratify（使满足/使高兴）构成的形容词，属于较少见、偏书面或评论性用法。","语气上常带一点提醒或批评：强调“满足过头”可能带来懈怠、挑剔或被宠坏的后果。"]}
{"word":"overgratify","summary":{"en":"Overgratify means to satisfy or indulge someone too much, often in a way that can spoil them.","zh":"overgratify 指“过度满足或纵容某人”，往往带有“可能宠坏人”的含义。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to gratify or satisfy someone too much; to indulge or spoil by giving too much praise, attention, or pleasure","zh":"过度满足（某人）；过分纵容或宠坏（因给予过多称赞、关注或享受）"},"examples":[{"en":"If you overgratify a child with gifts, they may start to expect a reward for everything.","zh":"如果你用礼物过度满足孩子，他们可能会开始觉得做什么都该有回报。"},{"en":"The manager worried that constant compliments might overgratify the team and reduce their motivation.","zh":"经理担心不断夸奖会让团队过度满足，从而降低动力。"}]}],"synonyms":["indulge","spoil","overindulge","pamper"],"phonetic":"/ˌoʊvɚˈɡrætəˌfaɪ/","extraExplanation":["这个词比较少见，但构词很透明：over-（过度）+ gratify（使满足/使愉快）。常见替代表达有 indulge（纵容）、spoil（宠坏）、overindulge（过度纵容）。","语感上它常带轻微的负面评价：不是单纯“让人开心”，而是“给得太多、容易带来坏处”。"]}
{"word":"overgratifying","summary":{"en":"Overgratifying means excessively pleasing or rewarding—more gratification than is healthy or appropriate.","zh":"overgratifying 指“过度带来满足/奖赏”，好得过头，可能不健康或不恰当。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(describing something) giving more pleasure, satisfaction, or reward than is good, healthy, or appropriate; excessively pleasing.","zh":"（形容某事）带来过度的愉悦、满足或奖赏；好得“过头”、过度取悦的。"},"examples":[{"en":"The movie’s constant fan service felt overgratifying and a bit empty.","zh":"这部电影不断迎合粉丝，显得过度取悦人，反而有点空洞。"},{"en":"Overgratifying foods can make it hard to keep a balanced diet.","zh":"过度“让人满足”的食物会让人更难保持均衡饮食。"}]},{"partOfSpeech":"vt.","definition":{"en":"the present participle of overgratify: to satisfy or reward someone too much, often in a way that causes harm or weakens self-control.","zh":"overgratify 的现在分词：过度满足或过度奖赏某人，常导致负面影响或削弱自控力。"},"examples":[{"en":"By overgratifying him with gifts, they unintentionally encouraged entitlement.","zh":"他们用礼物过度满足他，无意中助长了他的理所当然心态。"},{"en":"She worried she was overgratifying her cravings instead of managing them.","zh":"她担心自己是在过度满足口腹之欲，而不是在管理它。"}]}],"synonyms":["overly gratifying","too satisfying","indulgent","overindulgent","self-indulgent"],"phonetic":"/ˌoʊvɚˈɡrætəˌfaɪɪŋ/","extraExplanation":["“overgratifying”在现代英语里相对少见，更常见的表达有：“too gratifying / overly gratifying / indulgent / overindulgent”。在正式或文学语境中，用“over- + 动词/形容词”能强调“过度”的意味。","词形提示：overgratify（动词）→ overgratifying（形容词/现在分词）。当它作形容词时，通常修饰体验、内容、食物、奖励方式等。"]}
{"word":"overgratitude","summary":{"en":"Overgratitude means excessive gratitude—thanks that feels too strong or too much for the situation.","zh":"overgratitude 指“过度的感激”，即感谢得太强烈或太多，超出情境所需。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive or overly strong gratitude; thanking or appreciation that feels more than the situation calls for.","zh":"过度的感激；超出情境所需、显得太强烈的感谢或感恩。"},"examples":[{"en":"Her message was kind, but the overgratitude made him feel a little uncomfortable.","zh":"她的信息很友善，但那种过度的感激让他有点不自在。"},{"en":"You don’t need overgratitude—just a simple “thank you” is enough.","zh":"不需要过度的感激——一句简单的“谢谢”就够了。"}]}],"synonyms":["excessive gratitude","over-the-top thanks","effusive thanks","profuse gratitude"],"phonetic":"/ˌoʊvərˈɡrætəˌtud/","extraExplanation":["“overgratitude”不是非常常见、也不算固定的词，更多时候你会看到更自然的表达，如“excessive gratitude”“overly effusive thanks”“over-the-top gratitude”。它通常带一点评价色彩：觉得感谢太多、太夸张，或可能让人有压力。"]}
{"word":"overgraze","summary":{"en":"Overgraze means to graze too much, damaging vegetation and land.","zh":"overgraze 指过度啃食/过度放牧，破坏植被并损害土地。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of animals) to eat too much grass or plants in one area, damaging the land.","zh":"（动物）在同一片区域过度啃食草或植物，导致土地受损。"},"examples":[{"en":"If goats overgraze the hillside, the soil can wash away during heavy rain.","zh":"如果山坡上的山羊过度啃食，遇到大雨土壤就可能被冲走。"},{"en":"Farmers rotate cattle so they don’t overgraze a single pasture.","zh":"农民会轮换放牧牛群，这样就不会让同一片牧场被过度啃食。"}]},{"partOfSpeech":"vt.","definition":{"en":"To let animals graze too much on land, so the vegetation cannot recover.","zh":"使（某块土地）被过度放牧；让牲畜吃得太多，导致植被无法恢复。"},"examples":[{"en":"They overgrazed the field for years, and now it’s mostly bare dirt.","zh":"他们多年在这块地上过度放牧，现在几乎只剩下裸露的泥土。"},{"en":"The rancher was warned not to overgraze the public land.","zh":"牧场主被警告不要在公共土地上过度放牧。"}]}],"synonyms":["overfeed (on pasture)","graze too heavily","overpasture"],"phonetic":"/ˌoʊvərˈɡreɪz/","extraExplanation":["“over-”是英语里很常见的前缀，表示“过度、超过适当程度”（如 overwork 过度工作、overeat 暴饮暴食）。因此 overgraze 的核心意思就是“吃/放牧过头”。","在环境与地理语境中，overgrazing（过度放牧）常与“soil erosion（土壤侵蚀）”“desertification（荒漠化）”“loss of biodiversity（生物多样性下降）”等一起出现。"]}
{"word":"overgrazed","summary":{"en":"Overgrazed means land or vegetation has been harmed because animals have eaten too much there.","zh":"Overgrazed 指某地因动物吃草过多而导致植被受损、过度放牧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of land or plants) damaged because animals have eaten too much of the grass or vegetation in that area.","zh":"（指土地或植被）因动物过度啃食草或植物而受损的、过度放牧的。"},"examples":[{"en":"The hillsides became overgrazed after too many cattle were kept there for years.","zh":"多年饲养过多牛只后，山坡变得过度放牧、植被受损。"},{"en":"Overgrazed fields often turn dry and dusty in the summer.","zh":"过度放牧的田地在夏天常会变得干燥、多尘。"}]},{"partOfSpeech":"v.","definition":{"en":"Simple past and past participle of “overgraze” (to let animals eat too much grass in an area).","zh":"“overgraze”的过去式和过去分词（指让牲畜在某地吃掉过多草，造成过度放牧）。"},"examples":[{"en":"The shepherd overgrazed the pasture, so new grass couldn’t grow well.","zh":"牧羊人把牧场过度放牧了，所以新草长得不好。"}]}],"synonyms":["overpastured","depleted","worn-out"],"phonetic":"/ˌoʊvərˈɡreɪzd/","extraExplanation":["“overgrazed”常出现在环境与农业语境中，常与soil erosion（土壤侵蚀）、desertification（荒漠化）、pasture management（牧场管理）等话题相关。","构词很好记：over-（过度）+ graze（吃草/放牧）→ overgraze（过度放牧）→ overgrazed（被过度放牧的/已过度放牧）。"]}
{"word":"overgrazes","summary":{"en":"Overgrazes = overgraze (he/she/it): to graze an area too heavily, damaging the land.","zh":"overgrazes = overgraze（他/她/它）：指过度放牧/过度啃食，导致土地退化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Third-person singular present form of “overgraze”: to let animals eat too much grass or plants from an area, so the land becomes damaged and cannot recover easily.","zh":"“overgraze”的第三人称单数现在时：指让牲畜在某地过度啃食草或植物，导致土地退化、植被难以恢复。"},"examples":[{"en":"If the herd overgrazes this hillside, the soil may wash away in heavy rain.","zh":"如果牛群把这片山坡过度啃食，大雨时土壤可能会被冲走。"},{"en":"When a ranch overgrazes its pastures, weeds often spread faster than grass.","zh":"当牧场过度放牧草地时，杂草往往比牧草扩散得更快。"}]},{"partOfSpeech":"vi.","definition":{"en":"To eat too much of the available grass or plants (said of animals), leaving too little behind.","zh":"（多指动物）把可供啃食的草或植物吃得过多，几乎不剩。"},"examples":[{"en":"In dry seasons, goats can overgrazes quickly if they stay in one area too long.","zh":"在旱季，如果山羊在同一片区域待太久，很快就会出现过度啃食的情况。"}]}],"synonyms":["overpasture","overstock (a pasture)"],"phonetic":"/ˌoʊvərˈɡreɪzɪz/","extraExplanation":["“overgrazes”常见于环境与农业语境（如牧场管理、生态保护）。它通常暗示负面后果：植被减少、土壤侵蚀、生物多样性下降等。","注意语法：应说 “A herd overgrazes the land.”（单数主语）或 “Herds overgraze the land.”（复数主语）。"]}
{"word":"overgrazing","summary":{"en":"Overgrazing is when animals graze an area too heavily, damaging the vegetation and land.","zh":"Overgrazing 指动物过度啃食某片区域的植被，造成草地与土地退化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the situation where animals eat too much grass or other plants in an area, so the land cannot recover and becomes damaged","zh":"（畜群等）过度放牧；指动物在同一片土地上吃掉过多植被，导致土地无法恢复并受损"},"examples":[{"en":"Overgrazing can turn healthy grassland into bare soil.","zh":"过度放牧会把健康的草地变成裸露的土壤。"},{"en":"The village limited the number of goats to prevent overgrazing.","zh":"村子限制山羊数量以防止过度放牧。"}]}],"synonyms":["overuse of pasture","excessive grazing"],"phonetic":"/ˌoʊvɚˈɡreɪzɪŋ/","extraExplanation":["“Over-”表示“过度”，与“grazing（吃草、放牧）”组合成名词“overgrazing”。常见于环境与农业语境，常与 desertification（荒漠化）、soil erosion（土壤侵蚀）、biodiversity loss（生物多样性下降）等一起出现。","在许多地区，过度放牧不仅是生态问题，也常与生计方式、土地管理制度、气候干旱等社会因素有关，因此讨论时常会提到“可持续放牧（sustainable grazing）”或“轮牧（rotational grazing）”。"]}
{"word":"overgreasiness","summary":{"en":"Overgreasiness means excessive greasiness or oiliness.","zh":"Overgreasiness 指“过度油腻/出油过多”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of being too greasy or oily; excessive oiliness (of food, skin, hair, etc.)","zh":"过度油腻；油脂过多（指食物、皮肤、头发等过于油）"},"examples":[{"en":"The fries were hard to finish because of their overgreasiness.","zh":"这份薯条太油腻了，所以很难吃完。"},{"en":"A gentle cleanser can help reduce facial overgreasiness.","zh":"温和的洁面产品可以帮助减少面部出油过多。"},{"en":"She switched shampoos to deal with scalp overgreasiness.","zh":"她换了洗发水来应对头皮过度出油。"}]}],"synonyms":["excess oiliness","too much grease","oiliness","greasiness","heaviness (of food)"],"phonetic":"/ˌoʊvɚˈɡrizinəs/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。因此 overgreasiness = over（过度）+ greasiness（油腻/出油）。在日常英语里，人们更常说“too greasy / too oily”或“excess oiliness”，而“overgreasiness”更像是描述性、偏书面或产品/评论语境中的用法。"]}
{"word":"overgreasy","summary":{"en":"Overgreasy means “too greasy,” usually unpleasantly oily.","zh":"overgreasy 指“过于油腻/太油”，通常带有不好吃或不舒服的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too greasy; having more oil or fat than is pleasant or appropriate (often about food, skin, or hair).","zh":"过于油腻的；太油的（常形容食物、皮肤或头发油脂过多，让人不舒服或不合适）。"},"examples":[{"en":"The fries were overgreasy and tasted heavy.","zh":"薯条太油腻了，吃起来很腻。"},{"en":"My hair gets overgreasy if I skip washing for two days.","zh":"如果我两天不洗头，头发就会变得特别油。"},{"en":"Use less butter, or the sauce will turn overgreasy.","zh":"黄油少放一点，不然酱汁会变得很油。"}]}],"synonyms":["too greasy","oily","greasy","fatty (food)"],"phonetic":"/ˌoʊvɚˈɡrisi/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”。所以 overgreasy = greasy（油腻的）+ over-（过度）。类似的还有 overcooked（煮过头/烤过头的）、overripe（过熟的）。"]}
{"word":"overgreat","summary":{"en":"“Overgreat” means excessively great—too large, powerful, or important (rare/old-fashioned).","zh":"“overgreat”表示“过于巨大/强大/重要”（较罕用、偏旧式/文学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, often old-fashioned) Too great in size, amount, power, or importance; excessively great.","zh":"（罕用，常见于旧式用法）过于伟大/强大/重要；大得过分。"},"examples":[{"en":"He feared the king’s overgreat power would crush the nobles.","zh":"他担心国王过于强大的权力会压垮贵族。"},{"en":"Don’t let an overgreat sense of duty make you ignore your own needs.","zh":"别让过强的责任感让你忽视自己的需求。"}]}],"synonyms":["too great","excessive","overwhelming","inordinate","disproportionate"],"phonetic":"/ˌoʊvərˈɡreɪt/","extraExplanation":["“overgreat”在现代英语里很少使用，带有古风或文学色彩；日常表达更常用“too great / excessive / overwhelming / disproportionately large”。","结构上是“over-（过度）+ great（伟大的/巨大的）”。在较老的文本中，它常用来强调权力、野心、影响力等“过大而带来危险”的感觉。"]}
{"word":"overgreatly","summary":{"en":"“Overgreatly” means “excessively” or “too much,” but it is rare and old-fashioned in modern English.","zh":"“overgreatly”表示“过度地/太多地”，但在现代英语中较少见且偏古体。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Excessively; too much; more than is appropriate (rare or old-fashioned).","zh":"过度地；太多地；超过适当程度地（较少见或偏古体）"},"examples":[{"en":"He was overgreatly concerned about what others thought of him.","zh":"他过度在意别人怎么看他。"},{"en":"Do not overgreatly praise yourself; let your work speak.","zh":"不要过分自夸，让成果说话。"}]}],"synonyms":["excessively","too much","overly","unduly","far too"],"phonetic":"/ˌoʊvɚˈɡreɪtli/","extraExplanation":["“overgreatly”在现代英语里非常少用，常见于较旧的书面语（古体/文言风格）中，相当于“too much / excessively / overly / greatly”。","写作或口语中更自然的替换：overly（过于）、excessively（过度地）、too much（太…/太多）、far too（远远太…）。例如：He was overly concerned… / He was far too concerned…"]}
{"word":"overgreatness","summary":{"en":"Overgreatness (rare) means an excessive or inflated sense of greatness.","zh":"overgreatness（少见）指“过度的伟大/自我夸大式的伟大感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard/rare noun meaning an excessive or inflated sense of greatness (either real greatness taken “too far,” or someone overestimating their own greatness).","zh":"（非标准/少见用法）名词，指“过度的伟大”或“把伟大夸大到过头”；也可指某人对自己伟大程度的夸大认知（自我膨胀）。"},"examples":[{"en":"His speeches were full of overgreatness, as if no one else had ever achieved anything important.","zh":"他的演讲充满了“过度的伟大感”，好像除了他没人做成过重要的事。"},{"en":"The book warns that a leader’s overgreatness can turn confidence into arrogance.","zh":"这本书警告说，领导者的“过度伟大”可能让自信变成傲慢。"}]}],"synonyms":["grandiosity","arrogance","self-importance","inflated ego","pomposity"],"phonetic":"ˌoʊvərˈɡreɪtnəs","extraExplanation":["“overgreatness”不是常见的标准词汇，更像是临时造词（nonce word），由 over-（过度）+ greatness（伟大）组合而来。写作中如果想更自然，通常用更常见的表达，比如：arrogance（傲慢）、grandiosity（浮夸的自大）、self-importance（自命不凡）、inflated sense of importance（被夸大的重要感）。","语气上，“over-”常带批评意味，暗示“超过了合理范围”。因此该词通常用于讽刺或批判某人的自我吹捧，或批评一种被神化的“伟大叙事”。"]}
{"word":"overgreed","summary":{"en":"Overgreed means excessive greed, but it’s rare and sounds nonstandard; “excessive greed” or “greediness” is more natural.","zh":"overgreed 指“过度贪婪”，但很少见且不太规范；更自然的说法是 excessive greed 或 greediness。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) excessive greed; too much desire for money, power, or possessions.","zh":"（罕见、非标准用法）过度的贪婪；对金钱、权力或占有物的欲望过强。"},"examples":[{"en":"His overgreed pushed him to cheat his own partners.","zh":"他的过度贪婪让他去欺骗自己的合伙人。"},{"en":"The story warns that overgreed can destroy families and friendships.","zh":"这个故事警告说，过度贪婪会毁掉家庭和友谊。"}]}],"synonyms":["excessive greed","greediness","avarice","rapacity"],"phonetic":"/ˌoʊvɚˈɡrid/","extraExplanation":["“overgreed”在现代英语里很少见，很多情况下会被认为是不太自然或不规范的造词。更常见、更地道的表达是：excessive greed（过度贪婪）、greediness（贪婪）、avarice（贪财/贪婪，偏书面）、rapacity（掠夺式贪婪，较正式）。","前缀 over- 常表示“过度、太……”，但通常会接在更常见的结构上，例如：overconfidence（过度自信）、overconsumption（过度消费）。如果你想表达“贪得无厌”，也可以用 greedy（形容词）或 the pursuit of more and more（对更多的追逐）。"]}
{"word":"overgreedily","summary":{"en":"“Overgreedily” means “in an excessively greedy way.”","zh":"“overgreedily”表示“过度贪婪地、贪得无厌地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively greedy way; wanting more than is reasonable or fair.","zh":"过度贪婪地；贪得无厌地（想要超过合理或公平的程度）。"},"examples":[{"en":"He overgreedily grabbed more food than he could finish.","zh":"他贪得无厌地拿了太多食物，最后根本吃不完。"},{"en":"The company acted overgreedily, raising prices during the emergency.","zh":"那家公司在紧急时期过度逐利，抬高了价格。"},{"en":"Don’t overgreedily take all the credit—this was a team effort.","zh":"别贪心地把功劳都揽走——这是团队的成果。"}]}],"synonyms":["excessively","too greedily","avariciously","graspingly"],"phonetic":"ˌoʊvɚˈɡriːdɪli","extraExplanation":["“overgreedily”由 over-（过度）+ greedily（贪婪地）构成，强调“超过正常/可接受界限”的贪心，语气通常带批评。","在日常英语里，这个词相对少见；更常用的表达包括 “too greedily / excessively / out of greed / in a greedy way”。使用它会让语气更强、更像书面或评论性的措辞。"]}
{"word":"overgreediness","summary":{"en":"Overgreediness means excessive greed—wanting far more than is fair or necessary.","zh":"Overgreediness 指“过度贪婪”，即想要远超公平或必要的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being excessively greedy; wanting far more money, power, or possessions than is fair or necessary","zh":"过度贪婪；贪得无厌（对金钱、权力或财物的欲望超过合理或必要的程度）"},"examples":[{"en":"The company collapsed because of overgreediness at the top.","zh":"这家公司倒闭是因为高层的过度贪婪。"},{"en":"His overgreediness ruined friendships that had lasted for years.","zh":"他的贪得无厌毁掉了维持多年的友谊。"},{"en":"Some people see price gouging during emergencies as a form of overgreediness.","zh":"有些人把紧急时期的哄抬价格视为一种过度贪婪。"}]}],"synonyms":["excessive greed","extreme greed","greed","avarice","rapacity"],"phonetic":"/ˌoʊvɚˈɡriːdinəs/","extraExplanation":["“overgreediness”由 over-（过度）+ greediness（贪婪）构成，但在真实语境中更常见、更自然的说法是“excessive greed”“extreme greed”或直接用“greed”。写作时通常用这些更常见的搭配，会更地道、更易懂。","语气与使用场景：该词（及其更常见替代表达）多用于批评，常见于商业伦理、社会评论、政治或道德讨论中。"]}
{"word":"overgreedy","summary":{"en":"Overgreedy means excessively greedy—wanting more than is fair or needed.","zh":"overgreedy 表示“过度贪婪、贪得无厌”，想要超过合理或必要的范围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too greedy; wanting more than is fair, reasonable, or needed.","zh":"过度贪婪的；贪得无厌的；想要超过合理或必要范围的。"},"examples":[{"en":"The overgreedy investor took huge risks and lost everything.","zh":"那个过度贪婪的投资者冒了巨大风险，结果失去了一切。"},{"en":"Don’t be overgreedy—leave some cake for others.","zh":"别太贪心——给别人也留点蛋糕。"}]}],"synonyms":["too greedy","grasping","avaricious","rapacious"],"phonetic":"/ˌoʊvərˈɡriːdi/","extraExplanation":["“overgreedy”由前缀 over-（“过度、太……”）+ greedy（“贪心的”）构成，意思就是“比 greedy 更过分”。日常英语里更常用的说法是 “too greedy” 或 “greedy”。","这个词不算常见，更多出现在强调语气或写作中（例如评论、故事、寓言式表达），用来突出“因为贪婪而做过头”的感觉。"]}
{"word":"overgrew","summary":{"en":"Overgrew means “grew too much and covered something” (past tense of overgrow); less commonly, “outgrew.”","zh":"Overgrew 是 overgrow 的过去式，常指“长得过多而覆盖住某物”；较少见时可指“超出/不再适合（类似 outgrow）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense of overgrow) to grow too much or too thick, often covering something and making it hard to see or use.","zh":"（overgrow 的过去式）长得过多、过密，常常把某物覆盖住，使其难以看见或使用。"},"examples":[{"en":"The garden overgrew the path, so we couldn’t walk through easily.","zh":"花园里的植物长得太茂盛，把小路都盖住了，所以我们不容易走过去。"},{"en":"We stopped maintaining the yard, and weeds overgrew the fence.","zh":"我们不再打理院子，杂草就长满了篱笆。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) to grow beyond something in size, ability, or importance; to outgrow.","zh":"（较少用）在体型、能力或重要性上超过；不再适合原来的事物（类似 outgrow）。"},"examples":[{"en":"He overgrew the junior role and needed more challenging work.","zh":"他已经不再适合初级岗位，需要更有挑战性的工作。"},{"en":"The small town overgrew its old infrastructure.","zh":"这个小镇的发展已经超过了原有基础设施的承载能力。"}]}],"synonyms":["became overgrown","grew over","spread over","outgrew"],"phonetic":"/ˌoʊvərˈɡroʊ/","extraExplanation":["“overgrew”是动词“overgrow”的过去式。常见搭配：overgrow a path / a garden / a fence（长满、蔓延到把……覆盖住）。","和“overgrown”不同：overgrown多作形容词，表示“长得过密的/杂草丛生的”（an overgrown yard）。"]}
{"word":"overgrieve","summary":{"en":"“Overgrieve” means to grieve too much or for too long; it’s a rare, literary-sounding verb.","zh":"“overgrieve” 指过度悲伤或哀痛太久；属于较少见、偏文学风格的动词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to grieve too much; to mourn in an excessive or prolonged way","zh":"过度悲伤；哀痛过度（时间过长或程度过深）"},"examples":[{"en":"She tried not to overgrieve, but the loss still felt heavy.","zh":"她尽量不让自己哀痛过度，但失去的伤痛依然很沉重。"},{"en":"It’s natural to cry, yet he worried he might overgrieve and stop living his life.","zh":"哭泣很正常，但他担心自己会悲伤过度，从而无法继续好好生活。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone to grieve too much","zh":"使（某人）过度悲伤；让（某人）哀痛过度"},"examples":[{"en":"She didn’t want her words to overgrieve her parents.","zh":"她不希望自己的话让父母过度伤心。"}]}],"synonyms":["grieve excessively","mourn excessively","lament","be overwhelmed with grief"],"phonetic":"/ˌoʊvɚˈɡriːv/","extraExplanation":["“over-” 是常见前缀，表示“过度、超过适当程度”（如 overeat 暴饮暴食、overthink 想太多）。overgrieve 就是 “grieve（悲痛）+ 过度”。","这个词在现代英语中比较少见，偏文学/古典风格；日常表达更常用 grieve too much、mourn excessively、be overwhelmed with grief 等。"]}
{"word":"overgrieved","summary":{"en":"Overgrieved means extremely or excessively sad, often in a literary or old-fashioned tone.","zh":"overgrieved 指極度（甚至過度）悲傷，語氣常偏文學或古雅。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"very sad or distressed; grieving more than seems reasonable for the situation (often used in a literary or old-fashioned style).","zh":"過度悲傷的；悲痛不已的（常見於文學或較古雅的語氣中）。"},"examples":[{"en":"She was overgrieved by the loss, and could not speak for days.","zh":"她因失去而悲痛過度，幾天都說不出話。"},{"en":"He begged his friends not to be overgrieved, but to remember the good times.","zh":"他懇求朋友們不要過度悲傷，而要記得那些美好的時光。"}]}],"synonyms":["deeply grieved","heartbroken","inconsolable","devastated"],"phonetic":"/ˌoʊvərˈɡrivd/","extraExplanation":["「overgrieved」在現代日常英語中很少見，帶有文學/古典色彩；更常用的說法是「deeply grieved / extremely upset / heartbroken」。","字首「over-」常表示「過度、超出」，如 overreact（反應過度）、overworry（過度擔心）。因此 overgrieved 可理解為「悲傷得太過」。"]}
{"word":"overgrieving","summary":{"en":"“Overgrieving” means grieving excessively—more than seems healthy or necessary; it can also be the -ing form of the rare verb “overgrieve.”","zh":"“overgrieving”指过度悲伤、哀伤过深/过久；也可作罕见动词 overgrieve 的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Grieving too much or for too long; showing excessive sorrow (often suggesting it may be unhealthy or unhelpful).","zh":"过度悲伤的；哀伤过深或过久的（常暗示可能不利于身心或不够适当）。"},"examples":[{"en":"Friends worried she was overgrieving and encouraged her to eat and rest.","zh":"朋友担心她过度悲伤，劝她好好吃饭休息。"},{"en":"He wasn’t overgrieving—he was simply taking time to process the loss.","zh":"他并不是过度悲伤，只是需要时间消化失去的事实。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of grieving excessively (present participle of the rare verb “overgrieve”).","zh":"过度哀痛（罕见动词 overgrieve 的现在分词形式）。"},"examples":[{"en":"She feared she was overgrieving and tried to talk to a counselor.","zh":"她担心自己是在过度哀痛，于是尝试去和咨询师谈谈。"}]}],"synonyms":["grieving too much","inconsolable","overly mournful","taking it very hard"],"phonetic":"/ˌoʊvɚˈɡrivɪŋ/","extraExplanation":["“overgrieving”由前缀 over-（过度、太……）+ grieve（悲伤、哀悼）构成，语气上常带一点“劝人别太沉溺”的意味；在表达关心时要注意分寸，避免让人感觉被否定情绪。","这个词在现代日常口语中不算常见，更常见的说法是 “grieving too much / grieving for too long / taking it very hard”。"]}
{"word":"overgrievous","summary":{"en":"“Overgrievous” means excessively painful or excessively severe, often in literary/old-fashioned style.","zh":"“overgrievous”表示“过于悲痛/过分严重（或过于严厉）”，常带文学或较古旧的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively painful, serious, or hard to bear; more grievous than normal (often literary or old-fashioned).","zh":"过于悲痛的；过分严重的；难以承受的（常见于文学或较古旧用法）。"},"examples":[{"en":"The family described the loss as overgrievous and impossible to put into words.","zh":"家人形容这次失去“过于悲痛”，难以用语言表达。"},{"en":"He feared the punishment would be overgrievous for a first mistake.","zh":"他担心对第一次过失的惩罚会过于严厉。"}]}],"synonyms":["excessively grievous","unbearable","heartbreaking","devastating","unduly severe","overly harsh"],"phonetic":"/ˌoʊvɚˈɡriːvəs/","extraExplanation":["“over-”在这里表示“过度、太……”，加在“grievous（令人悲痛的；严重的）”前，形成“overgrievous”。这个词在现代英语中比较少见，更常见的替代说法有“too grievous / unbearably painful / excessively severe”。","在文学语境里，“grievous”常与“loss（失去）”“wound（创伤）”“wrong（伤害）”“punishment（惩罚）”等搭配；“overgrievous”会让语气更强、更带古典/戏剧色彩。"]}
{"word":"overgrievously","summary":{"en":"“Overgrievously” means “too grievously”—in an overly sorrowful, painful, or serious way.","zh":"“overgrievously”表示“过于悲痛/过于严重地”，强调程度太过（较少见、偏文学）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively sorrowful, painful, or serious way; too grievously.","zh":"过分悲伤地；过于痛苦/严重地（太“grievously”）。"},"examples":[{"en":"She took the criticism overgrievously and couldn’t sleep that night.","zh":"她把批评看得过于严重，以至于那晚睡不着。"},{"en":"Don’t judge yourself overgrievously for one mistake.","zh":"别因为一次错误就过分苛责自己。"}]}],"synonyms":["overly","excessively","too severely","too harshly"],"phonetic":"/ˌoʊvɚˈɡriːvəsli/","extraExplanation":["这个词很少见，带有明显的旧式/文学色彩（arch. / literary）。结构是 over-（“过度地”）+ grievously（“悲痛地；严重地”），用来强调“程度太过”。","在现代日常英语里，人们更常用 overly, too much, excessively, too harshly 等来表达同样意思。"]}
{"word":"overgrievousness","summary":{"en":"Overgrievousness means excessive seriousness, sorrow, or harshness—something being too grievous to bear or justify.","zh":"overgrievousness 指“过分沉痛/严重/严苛”的状态，强调程度过度，令人难以承受或难以成立。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being excessively serious, painful, or hard to bear; excessive grievousness","zh":"过于严重、痛苦或难以承受的状态；过分的“沉痛/严峻”"},"examples":[{"en":"The judge reduced the sentence because of the overgrievousness of the punishment compared with the crime.","zh":"法官减轻了刑罚，因为与罪行相比，这个惩罚显得过于严苛、过分沉重。"},{"en":"Her letter describes the overgrievousness of the loss in simple, honest words.","zh":"她用朴实真诚的文字写出了这次失去带来的过度沉痛。"}]}],"synonyms":["excessive severity","undue harshness","extreme hardship","excessive sorrow"],"phonetic":"/ˌoʊvɚˈɡriːvəsnəs/","extraExplanation":["这个词非常少见，多半出现在较古旧或较正式的写作里。现代英语里更常用的表达是：\"excessive sorrow\"（过度悲伤）、\"undue severity\"（不当的严厉）、\"extreme hardship\"（极端困苦）或直接用 \"too grievous\"（过于沉痛/严重）。","构词上可拆为 over-（过度）+ grievous（沉痛的/严重的/令人悲伤的）+ -ness（名词后缀，表示“……的性质/状态”）。理解这个构词能帮助你猜测类似词义。"]}
{"word":"overgrind","summary":{"en":"Overgrind means to grind something too much or too finely, often making it taste worse or causing extra wear.","zh":"Overgrind 指把东西磨得过度（太久或太细），常导致味道变差或造成磨损。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to grind something for too long or too finely, so the result is worse (often said about coffee or spices).","zh":"把某物磨得过久或过细，导致效果变差（常用于咖啡或香料）。"},"examples":[{"en":"If you overgrind coffee beans, the espresso can taste bitter.","zh":"如果你把咖啡豆磨得太细，浓缩咖啡可能会发苦。"},{"en":"I overground the pepper, so it lost some of its fresh aroma.","zh":"我把胡椒磨得太久了，所以新鲜香气弱了一些。"}]},{"partOfSpeech":"vt.","definition":{"en":"to wear something down by grinding too much, or to process a material too aggressively.","zh":"因过度打磨而把某物磨损；或对材料进行过度研磨/加工。"},"examples":[{"en":"Be careful not to overgrind the blade edge, or it will become too thin.","zh":"小心别把刀刃磨过头，不然会变得太薄。"},{"en":"The technician overground the sample and changed its texture.","zh":"技术员把样品研磨过度，改变了它的质地。"}]}],"synonyms":["grind too finely","overprocess","overwork","wear down"],"phonetic":"/ˌoʊvɚˈɡraɪnd/","extraExplanation":["在咖啡语境里，overgrind 常指“研磨度过细”。研磨越细，萃取越快、越容易过度萃取，味道可能更苦、更涩；但是否“过度”也取决于冲煮方式（如意式需要更细，法压壶需要更粗）。","动词过去式既可见 overground（更传统的拼写），也有人写 overgrinded（较口语/较少见）。"]}
{"word":"overgross","summary":{"en":"“Overgross” means excessively gross—too large/rough or too crude/offensive, depending on context.","zh":"“overgross”表示“过分的、太‘gross’的”——可指过于粗大/粗糙，或过于粗俗/令人反感（视语境而定）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively large, rough, or coarse; too “gross” in size, amount, or manner.","zh":"过于巨大或粗糙的；过分“粗俗/粗陋”的（在体积、数量或行为方式上过头）。"},"examples":[{"en":"The comedy relied on overgross jokes that made some people uncomfortable.","zh":"这部喜剧依赖过于粗俗的笑话，让一些人感到不舒服。"},{"en":"He used an overgross estimate of the costs, so the budget looked worse than it really was.","zh":"他用了过于夸大的成本估算，所以预算看起来比实际更糟。"}]}],"synonyms":["overly crude","excessive","exaggerated","too gross","coarse"],"phonetic":"/ˌoʊvɚˈɡroʊs/","extraExplanation":["“overgross”在现代英语中很少见，更常见的表达是“too gross / overly gross / excessively crude / exaggerated”。有时也会写作带连字符的“over-gross”。","词根“gross”既可表示“总的、毛的（未扣除的）”，也可表示“粗俗的、令人反感的”。“over-”表示“过度、超过”。具体含义通常要看上下文：是在说“过分粗俗”，还是在说“数值/规模夸大”。"]}
{"word":"overgrossly","summary":{"en":"“Overgrossly” means “too grossly”—in an excessively coarse, vulgar, or exaggerated way.","zh":"“overgrossly”表示“过于粗俗/过度夸张地”，语气带批评。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively gross (too coarse, vulgar, or overly exaggerated) way.","zh":"以过分粗俗、粗糙或过度夸张的方式。"},"examples":[{"en":"The comedian’s jokes were overgrossly sexual for a family audience.","zh":"这位喜剧演员的笑话对家庭观众来说在性暗示方面过于粗俗。"},{"en":"The report described the scene overgrossly, turning serious details into sensational ones.","zh":"这份报告描述得过于夸张粗俗，把严肃细节写成了耸人听闻的内容。"}]}],"synonyms":["too grossly","excessively","crudely","vulgarly","sensationally"],"phonetic":"/ˌoʊvərˈɡroʊsli/","extraExplanation":["“overgrossly”相当少见，更多时候人们会用“too grossly / in a grossly… way”来表达。","词形构成：over-（过度）+ gross（粗俗的；严重的；明显的）+ -ly（副词后缀）。根据语境，它既可能表示“过于粗俗”，也可能表示“过于夸张/明显到失真”。","使用场景多见于批评语气（写作、评论、社交媒体等），带有主观判断色彩；正式写作中建议用更具体的词，如“crudely, vulgarly, excessively, sensationally”。"]}
{"word":"overgrossness","summary":{"en":"Overgrossness means being excessively “gross,” especially too rude/vulgar (and less commonly, excessively fat or large).","zh":"overgrossness 指“过分 gross”的状态，常指过度粗俗/下流（较少指过度肥胖或过于庞大）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too gross (too rude, vulgar, or offensive); excessive coarseness","zh":"过分粗俗、下流或令人反感的特质；过度粗鄙"},"examples":[{"en":"Some viewers complained about the show’s overgrossness and stopped watching.","zh":"一些观众抱怨这档节目过于粗俗，于是不再观看。"},{"en":"He tried to be funny, but the overgrossness of the jokes made people uncomfortable.","zh":"他想搞笑，但笑话的过分下流让人不舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the state of being excessively large, fat, or heavy; extreme corpulence","zh":"（较少见）过分肥胖、过于臃肿或体型过大的状态"},"examples":[{"en":"In older writing, overgrossness could describe a body that was seen as excessively heavy.","zh":"在较早的写作中，overgrossness 有时用来形容被认为过于沉重肥胖的身体。"}]}],"synonyms":["vulgarity","crudeness","obscenity","coarseness","indelicacy"],"phonetic":"/ˌoʊvɚˈɡroʊsnəs/","extraExplanation":["这个词非常少见，多为临时造词或较旧文本中的用法。它由 over-（过度）+ gross（粗俗的/肥胖的/过大的）+ -ness（名词后缀）构成，字面意思就是“过度的 gross”。","日常英语里更常用的表达是：vulgarity（粗俗）、crudeness（粗鄙）、obscenity（猥亵）、or being too gross（太恶心/太下流）。如果是指体型，常见说法是 obesity（肥胖）或 excessive weight（体重过重）。"]}
{"word":"overground","summary":{"en":"Overground means above the ground (not underground), often used for trains/railways; it can also refer to an above-ground rail service, especially in the UK.","zh":"Overground 指“在地面上、非地下的”，常用于交通（如铁路）；也可指（尤指英国）地上铁路系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Above the surface of the ground; not underground (often used about trains, railways, or movement).","zh":"在地面上；非地下的（常用于火车、铁路或移动方式）。"},"examples":[{"en":"Let’s take the overground train instead of the subway today.","zh":"今天我们坐地面火车吧，不坐地铁。"},{"en":"The cables run overground for this section of the route.","zh":"这段线路的电缆是铺设在地面上的。"}]},{"partOfSpeech":"adv.","definition":{"en":"On or above the ground rather than below it.","zh":"在地面上（而不是在地下）。"},"examples":[{"en":"Parts of the line travel overground through the suburbs.","zh":"这条线路有些路段在郊区是走地面上的。"}]},{"partOfSpeech":"n.","definition":{"en":"A city rail service that runs mainly above ground (especially used in the UK).","zh":"主要在地面运行的城市铁路（尤指英国用法）。"},"examples":[{"en":"We changed from the Underground to the Overground at the next stop.","zh":"我们在下一站从地铁换乘到地上铁路。"}]}],"synonyms":["aboveground","above ground","surface","on the surface"],"phonetic":"/ˈoʊvərˌɡraʊnd/","extraExplanation":["“overground”在英式英语里很常见，尤其和交通有关；在美式英语中，更常见的说法通常是“above ground”或“on the surface”。","在伦敦，“London Overground（伦敦地上铁路）”是一个专有名词，指由TfL运营的一组通勤铁路线路，与“Underground（地铁）”相对。"]}
{"word":"overgrow","summary":{"en":"Overgrow means to grow too much, often spreading and covering something or becoming larger than desired.","zh":"Overgrow 指“过度生长/蔓延”，常表示植物长得太多，覆盖某物或超过理想大小。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To grow too much or in an uncontrolled way, often so that plants cover or block something.","zh":"（植物等）过度生长；蔓延，长得太多（以至于覆盖或阻碍某物）。"},"examples":[{"en":"The garden quickly overgrew the path after a month of rain.","zh":"下了一个月的雨后，花园里的植物很快就蔓延到小路上了。"},{"en":"I let the weeds overgrow the flower beds.","zh":"我放任杂草在花坛里疯长。"}]},{"partOfSpeech":"v.","definition":{"en":"To grow beyond a normal or desired size or limit.","zh":"长得超过正常或理想的尺寸/范围。"},"examples":[{"en":"The hedge will overgrow if you don’t trim it regularly.","zh":"如果不定期修剪，树篱会长得过大。"},{"en":"His hair had overgrown and covered his ears.","zh":"他的头发长得太长，盖住了耳朵。"}]}],"synonyms":["grow over","spread","run wild","become overgrown"],"phonetic":"ˌoʊvɚˈɡroʊ","extraExplanation":["“over-”是常见前缀，表示“过度、超过”。所以 overgrow 直观上就是“长得太过”。在自然描写里很常见，比如说藤蔓、草、灌木“overgrow the wall/ruins”（把墙/废墟都覆盖了），带有一种“被自然吞没”的画面感。","常见搭配：overgrow a path/road（长满小路/道路）、overgrow the garden（花园杂草丛生）、be overgrown with weeds/grass/vines（长满杂草/草/藤蔓）。"]}
{"word":"overgrowing","summary":{"en":"Overgrowing describes plants that are growing too much or spreading to cover something; it’s also the -ing form of “overgrow.”","zh":"overgrowing 指植物过度生长或蔓延覆盖某物；也是 overgrow 的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of plants) growing too much or too large, often in a way that becomes messy or harmful.","zh":"（植物）过度生长的、长得太茂盛的，常带来凌乱或不利影响。"},"examples":[{"en":"The garden looks beautiful, but the vines are overgrowing the fence.","zh":"花园很美，但藤蔓正在把栅栏都长满了。"},{"en":"Overgrowing weeds can block sunlight from younger plants.","zh":"过度生长的杂草会挡住阳光，使幼小的植物见不到光。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “overgrow”: to grow too much, or to cover something by growing over it.","zh":"“overgrow”的现在分词：过度生长；（植物）蔓延覆盖某物。"},"examples":[{"en":"Fast-growing bamboo is overgrowing the walkway.","zh":"生长很快的竹子正在蔓延覆盖人行道。"},{"en":"If you don’t trim it, the ivy will keep overgrowing the windows.","zh":"如果不修剪，常春藤会继续爬满窗户。"}]}],"synonyms":["overgrown","spreading","rampant","untrimmed","encroaching"],"phonetic":"/ˌoʊvɚˈɡroʊɪŋ/","extraExplanation":["“overgrowing”在园艺语境里很常见，带有“需要修剪/控制”的暗示；也可比喻事物失控地扩张，如“an overgrowing problem（越来越严重的问题）”。在比喻用法中，常与problem, influence, resentment等搭配。"]}
{"word":"overgrown","summary":{"en":"Overgrown describes something (especially plants or a place) that has grown too much and become thick, wild, or untidy; it can also describe a person or animal that seems unusually large or like a “grown-up kid.”","zh":"Overgrown 指（尤指植物或某处）长得过度而变得茂密、野乱、缺乏打理；也可形容人或动物长得过大，或幽默地指“长不大的大孩子”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with plants that have grown too much or too thick, so it looks wild or untidy.","zh":"（被植物）长得过高、过密，显得杂乱或荒芜的。"},"examples":[{"en":"The garden is overgrown with weeds after weeks of rain.","zh":"连续下了几周雨后，花园里杂草丛生。"},{"en":"An overgrown path led to the old house.","zh":"一条杂草覆盖的小路通向那座老房子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person or animal) larger than is typical or desirable, often because they have grown too much.","zh":"（人或动物）长得过大、超过常见或理想大小的。"},"examples":[{"en":"That puppy is now an overgrown dog—almost the size of a small wolf.","zh":"那只小狗现在成了“长得过大的”狗——几乎有小狼那么大。"},{"en":"He jokes that he’s just an overgrown kid who still loves comics.","zh":"他开玩笑说自己只是个“长不大的大孩子”，还爱看漫画。"}]}],"synonyms":["overgrown","overrun","unkempt","wild","weedy","grown-up"],"phonetic":"/ˌoʊvərˈɡroʊn/","extraExplanation":["“over-”表示“过度/超过”，加在“grown（长大/生长）”前面，就形成“长得过头”的意思。常见搭配：overgrown with weeds（杂草丛生）、overgrown garden（荒草蔓生的花园）、overgrown child（长得过大的孩子，或比喻“长不大的孩子”）。","语气与风格：形容植物时多为中性到略负面（暗示缺少打理）；形容人时常带轻松或自嘲的幽默（overgrown kid）。"]}
{"word":"overgrows","summary":{"en":"“overgrows” means (1) grows too much/too fast, or (2) spreads over and covers something; less commonly, it can mean “outgrows.”","zh":"“overgrows”表示（1）长得过多/过快，（2）蔓延并覆盖某物；较少见时也可指“长到不再适合/长大超过”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to grow too much or too quickly; to become overgrown","zh":"（植物等）长得过多、过快；变得杂草丛生/过度生长"},"examples":[{"en":"In summer, the grass overgrows if you don’t mow it regularly.","zh":"夏天如果不定期修剪，草就会长得过高。"},{"en":"Without sunlight, the garden still overgrows because of frequent rain.","zh":"即使阳光不多，花园也会因为经常下雨而过度生长。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a plant) to spread over and cover something","zh":"（植物）蔓延并覆盖某物"},"examples":[{"en":"Ivy overgrows the wall and hides the bricks.","zh":"常春藤爬满墙面，把砖块都遮住了。"},{"en":"Vines overgrow the fence every year.","zh":"藤蔓每年都会长满篱笆。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to outgrow; to become too big for something","zh":"（较少见）长到不再适合；长大到超出（某物）的适用范围"},"examples":[{"en":"The puppy overgrows its collar in just a few weeks.","zh":"小狗几周内就长得项圈戴不下了。"}]}],"synonyms":["grow wild","become overgrown","spread","cover","outgrow"],"phonetic":"/ˌoʊvɚˈɡroʊz/","extraExplanation":["“overgrows”是动词“overgrow”的第三人称单数（he/she/it overgrows）。常见搭配有：weeds overgrow a garden（杂草长满花园）、ivy overgrows the wall（常春藤爬满墙）。在日常英语里，“长得太快/太多”常用被动或形容词：be overgrown（变得杂草丛生）。"]}
{"word":"overgrowth","summary":{"en":"Overgrowth means excessive plant growth (or, less commonly, excessive growth of tissue) that makes an area thick, messy, or hard to manage.","zh":"overgrowth 指植物过度生长（较少见也可指组织过度生长），导致环境变得浓密、凌乱或难以管理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An area where plants have grown too much or too thickly, often making a place hard to use, see, or maintain.","zh":"（植物）过度生长、杂草丛生的状态或区域，常导致难以通行、看不清或难以维护。"},"examples":[{"en":"The trail was blocked by overgrowth, so we had to turn back.","zh":"小路被杂草丛生挡住了，我们只好折返。"},{"en":"After years without care, the garden became an overgrowth of weeds and vines.","zh":"多年无人打理后，花园变成了杂草和藤蔓的乱长之地。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of growing too much or beyond what is normal or desired.","zh":"过度生长的过程；生长超过正常或理想范围。"},"examples":[{"en":"Regular pruning helps prevent overgrowth on the trees.","zh":"定期修剪有助于防止树木过度生长。"},{"en":"The doctor warned that the swelling was not just overgrowth of tissue.","zh":"医生提醒这种肿胀不只是组织过度生长。"}]}],"synonyms":["overdevelopment","excess growth","proliferation","weed growth"],"phonetic":"/ˈoʊvɚˌɡroʊθ/","extraExplanation":["“over-”表示“过度、超过”，加在名词或动词前很常见：overwork（过度工作）、overcook（煮过头）、overuse（过度使用）。因此 overgrowth 很直观地表达“长得太多/太密”。","overgrowth 不只用于自然环境，也可用于医学或生物学语境，表示组织或细胞“增生过度”（但日常生活中最常见的是“杂草丛生/植被过密”的意思）。"]}
{"word":"overguilty","summary":{"en":"Overguilty means feeling excessively guilty (a rare, less common word).","zh":"overguilty 指“过度内疚的”（较少见的用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"feeling excessively guilty; burdened by more guilt than the situation reasonably calls for.","zh":"过度内疚的；觉得自己背负了不必要或过分的罪责感。"},"examples":[{"en":"After the argument, she felt overguilty even though both people had made mistakes.","zh":"争吵后，她感到过度内疚，尽管双方都有错。"},{"en":"He gets overguilty about taking a day off, as if rest were irresponsible.","zh":"他一请假就会过度内疚，好像休息是不负责任的事。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) having more guilt than others; overly responsible for wrongdoing.","zh":"（罕见）罪责更重的；在过错中承担过多责任的。"},"examples":[{"en":"In his mind, he was the overguilty one, even when evidence suggested otherwise.","zh":"在他心里，他觉得自己才是罪责更重的那个人，即使证据并不支持这种想法。"}]}],"synonyms":["overly guilty","guilt-ridden","ashamed","remorseful","conscience-stricken"],"phonetic":"/ˌoʊvɚˈɡɪlti/","extraExplanation":["“overguilty”在现代英语里不算常用，更常见的表达是“overly guilty”“guilt-ridden（饱受内疚折磨的）”或“wracked with guilt”。如果写作或正式场合使用，通常建议换成这些更自然的说法。","构词上可理解为 over-（过度）+ guilty（内疚的/有罪的），语感类似“too guilty”。在心理或情绪语境里使用更贴切，而不是法律意义上的“有罪”。"]}
{"word":"overgun","summary":{"en":"Overgun means to equip with excessive firepower, or to overpower someone by having more guns.","zh":"overgun 指“火力配置过强/枪炮装备过多”，也可指“凭借更强火力压倒对手”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to arm or equip with more guns or firepower than is necessary or appropriate","zh":"（使）装备过多的枪炮；火力配置过强（超过需要或合适的程度）"},"examples":[{"en":"Some critics said the patrol vehicle was overgunned for routine policing.","zh":"一些批评者说，这种巡逻车用于日常执法属于火力过强。"},{"en":"They worried the design would be overgunned and too heavy to handle well.","zh":"他们担心这个设计会火力配置过多，导致重量太大、操控变差。"}]},{"partOfSpeech":"vt.","definition":{"en":"to defeat or intimidate someone by having superior firepower","zh":"凭借更强火力击败或震慑（对手）"},"examples":[{"en":"The smaller group was quickly overgunned and forced to retreat.","zh":"较小的一方很快在火力上处于劣势，被迫撤退。"}]}],"synonyms":["overarm","overequip","outgun"],"phonetic":"/ˌoʊvərˈɡʌn/","extraExplanation":["“overgun”本身不算常见，更常见的形式是形容词“overgunned”（火力过强/枪炮过多）或名词化的表达（如“an overgunned ship”）。多用于军事、执法装备评估、或游戏/小说里的战斗描写。","语感上，“over-”表示“过度、超过需要”，类似的构词还有 “overwork（过度工作）”“overcook（煮过头）”。"]}
