{"word":"overkeen","summary":{"en":"Overkeen means “too eager or enthusiastic,” often in a way that seems pushy or excessive.","zh":"overkeen 指“过分热心/过度急切”，常带“太积极、用力过猛”的语感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too eager, enthusiastic, or intense about doing something—often more than is appropriate, so it can feel pushy or unrealistic.","zh":"过分热心的；过度急切的（常带贬义，显得用力过猛、太积极而让人不舒服或不切实际）"},"examples":[{"en":"He was overkeen to impress his new boss and ended up talking too much in meetings.","zh":"他太急着给新老板留下好印象，结果在会议上说得太多。"},{"en":"I appreciate your help, but you’re being a bit overkeen—let’s slow down and make a plan.","zh":"我很感谢你的帮助，但你有点过分热心了——我们放慢点，先做个计划。"},{"en":"The overkeen marketing promises made customers suspicious.","zh":"过于夸张热情的营销承诺让顾客起了疑心。"}]}],"synonyms":["overeager","too eager","overenthusiastic","pushy","overzealous"],"phonetic":"/ˌoʊvərˈkin/","extraExplanation":["“over-”表示“过度、过分”，加在keen（热切的、渴望的）前面就成了“过分热切”。语气通常偏负面，用来委婉地说某人太急、太积极，甚至有点“用力过猛”。","常见搭配：overkeen to do sth（太急着做某事）、an overkeen attitude（过度积极的态度）。"]}
{"word":"overkeenly","summary":{"en":"“Overkeenly” means acting or reacting in a way that is too eager or intense.","zh":"“overkeenly”表示“过于热衷/过分急切地”，常带一点负面意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too eager, too interested, or too intense.","zh":"过于热衷地；过分急切/投入地（带有“太过头”的感觉）。"},"examples":[{"en":"He listened overkeenly to every detail, which made the interview feel uncomfortable.","zh":"他对每个细节都听得过于专注，结果让面试气氛有点不舒服。"},{"en":"She spoke overkeenly about the plan, and her teammates felt pressured.","zh":"她过分热切地谈论这个计划，让队友感到有压力。"}]}],"synonyms":["too eagerly","overly eagerly","too keenly","overenthusiastically","overzealously"],"phonetic":"/ˌoʊvɚˈkinli/","extraExplanation":["“overkeenly”来自形容词“overkeen”（过于热心/过分急切）加副词后缀“-ly”。它通常带轻微的负面评价：不是单纯“很热情”，而是“热情得有点不合时宜或让人不舒服”。","日常英语中更常见的替代表达有：“too eagerly / a bit too keenly / overly enthusiastically”。“overkeenly”相对更书面、也更少见。"]}
{"word":"overkeenness","summary":{"en":"Overkeenness means being too eager or enthusiastic, often in a way that feels pushy or impatient.","zh":"overkeenness 指过度急切或热情，常给人咄咄逼人或急躁的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive eagerness or enthusiasm, sometimes showing impatience or trying too hard.","zh":"过度的热心/急切（有时带有急躁或用力过猛的感觉）。"},"examples":[{"en":"His overkeenness to impress the boss made him interrupt other people in meetings.","zh":"他为了给老板留下好印象而表现得过于急切，结果在会议上总打断别人。"},{"en":"A little enthusiasm is helpful, but overkeenness can annoy your teammates.","zh":"适度的热情很有帮助，但过度热心可能会惹队友反感。"}]}],"synonyms":["overenthusiasm","excessive eagerness","pushiness","overzealousness"],"phonetic":"/ˌoʊvərˈkinəs/","extraExplanation":["“over-”是常见前缀，表示“过度/过分”。“overkeenness”由 over- + keen + -ness 组成：keen（热切的、渴望的）+ -ness（把形容词变成名词，表示“……的状态/性质”）。","语气上常带轻微负面评价：不是单纯“积极”，而是“太积极、太急、太想表现”。更中性的说法可用 “enthusiasm / eagerness”。"]}
{"word":"overkeep","summary":{"en":"Overkeep means to keep something longer than necessary or to hold on too tightly; it’s a rare word in modern English.","zh":"overkeep 指把某物保留得过久或抓得太紧；在现代英语中较少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to keep something longer than is necessary or desirable; to keep too much or too tightly","zh":"把某物保存/保留得过久（超过需要或适当的时间）；过度保留、抓得太紧"},"examples":[{"en":"If you overkeep leftovers, they can spoil and make you sick.","zh":"如果把剩菜放得太久，它们可能变质，让人吃坏肚子。"},{"en":"Some companies overkeep old files instead of deleting them securely.","zh":"有些公司把旧文件留得过久，而不是安全地删除它们。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to keep someone or something back too much; to restrain excessively","zh":"（少见）过度约束（某人/某事）；把……压得太紧、管得太严"},"examples":[{"en":"A parent may overkeep a child, limiting healthy independence.","zh":"父母如果过度管束孩子，可能会限制其健康的独立性。"}]}],"synonyms":["keep too long","hold on to","retain","hoard","stockpile"],"phonetic":"/ˌoʊvɚˈkip/","extraExplanation":["“overkeep”在现代英语里比较少见，更常见的表达是“keep too long / hold on to … too long / retain … longer than necessary”。在食品语境里也常用“keep past its date（过期还留着）”。","构词上是“over-（过度）+ keep（保留/保存）”，语气通常带有“没必要、可能带来问题”的含义（例如变质、占空间、风险增加）。"]}
{"word":"overkick","summary":{"en":"Overkick most often means a bicycle kick in soccer; it can also mean adding too much extra force or spin to a kick.","zh":"Overkick 最常指足球里的“倒钩（倒挂金钩）”；也可指踢球时加了过多力度或旋转。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in soccer/football) A bicycle kick: a dramatic shot made by kicking the ball backward over your head while your body is in the air.","zh":"（足球）倒钩（倒挂金钩）：身体腾空时把球从头顶向身后踢出的高难度射门/解围动作。"},"examples":[{"en":"He scored with an overkick from inside the box.","zh":"他在禁区内用一记倒钩破门得分。"},{"en":"The defender cleared the ball with an overkick under pressure.","zh":"后卫在压力下用倒钩把球解围出去。"}]},{"partOfSpeech":"n.","definition":{"en":"Extra force, lift, or spin added to a kick, making the ball travel higher, farther, or with more curve.","zh":"（踢球时）额外的力度、上旋或弧线，使球踢得更高、更远或更拐。"},"examples":[{"en":"He gave the ball too much overkick and it flew over the crossbar.","zh":"他踢得用力过猛（加了太多“过劲儿”），球飞过了横梁。"},{"en":"Try less overkick if you want a flatter pass.","zh":"如果你想传得更平，就别加那么多额外力道/旋转。"}]}],"synonyms":["bicycle kick","overhead kick","scissor kick (sometimes)"],"phonetic":"/ˈoʊvərˌkɪk/","extraExplanation":["“overkick”在不同英语地区的体育报道中用法不完全一样：在很多足球语境里，它常被当作“bicycle kick（倒钩）”的同义说法；但在更一般的口语里，也可能指“踢得过猛/加了过多旋转”。想表达动作名称时，最常见、最标准的说法仍是“bicycle kick”。"]}
{"word":"overkill","summary":{"en":"Overkill means doing something with more force, effort, or resources than necessary—often “too much for the situation.”","zh":"Overkill 指做事用力过猛、投入或手段超过必要程度，常带“有点小题大做”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"More force, effort, or action than necessary; an excessive amount that goes beyond what is needed.","zh":"（做事）过度；用力过猛；超过需要的程度"},"examples":[{"en":"Buying a new laptop just to write emails is overkill.","zh":"只是用来写邮件就买新笔记本电脑有点过度了。"},{"en":"We don’t need ten people for this job—two is enough. Ten would be overkill.","zh":"这活儿不需要十个人——两个人就够了。十个人就太夸张了。"}]},{"partOfSpeech":"v.","definition":{"en":"To use more force, effort, or resources than necessary; to do something in an excessive way.","zh":"过度处理；用力过猛；投入超过必要的资源"},"examples":[{"en":"Don’t overkill the presentation—keep it simple and clear.","zh":"别把演示做得太复杂——简单清楚就好。"},{"en":"He tends to overkill every small problem with long meetings.","zh":"他常常用很长的会议来处理小问题，有点用力过猛。"}]},{"partOfSpeech":"v.","definition":{"en":"In movies and games: to keep attacking after an enemy is already defeated (or to deal far more damage than needed).","zh":"（电影/游戏）对已“击败”的目标继续攻击；伤害溢出，远超所需"},"examples":[{"en":"The boss was already down, but the team kept hitting—total overkill.","zh":"Boss 都倒了，队伍还在打——完全是伤害溢出。"},{"en":"That combo overkilled the enemy by a huge margin.","zh":"那套连招对敌人造成了远超所需的伤害。"}]}],"synonyms":["excess","too much","overdoing it","exaggeration","redundancy"],"phonetic":"/ˈoʊvərˌkɪl/","extraExplanation":["“Overkill”原意与“kill（杀死）”有关：表示“杀得太多/太过头”，后来在日常英语里更多是比喻用法，指“做得过度”“小题大做”。","语气通常偏口语、带一点幽默或吐槽：说某事是 overkill，往往是在提醒“没必要这么夸张”。","常见搭配：a bit of overkill（有点过头）；seem/feel like overkill（感觉有点过度）；That’s overkill（太夸张了/没必要）。"]}
{"word":"overkilled","summary":{"en":"“Overkilled” is the past form of “overkill,” meaning using more force/effort than necessary, and it can also describe something as excessively done.","zh":"“Overkilled”是“overkill”的过去式/过去分词，指用力过猛、超过必要程度；也可作形容词表示“做得过度、过分复杂”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “overkill”) to kill more than is necessary, or to use far more force than needed.","zh":"（overkill 的过去式/过去分词）过度杀伤；用远超必要的力量去杀（或打击）。"},"examples":[{"en":"The hunters overkilled and left much of the meat unused.","zh":"猎人们过度猎杀，很多肉都没被利用。"},{"en":"The response overkilled the threat and caused unnecessary damage.","zh":"这种应对方式过度打击了威胁，造成了不必要的破坏。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, often said about a plan or solution) done with far more effort, power, or complexity than needed; excessive.","zh":"（非正式，常形容方案/做法）用力过猛的；过度的；大材小用的。"},"examples":[{"en":"A 20-page report for a one-minute update felt overkilled.","zh":"为了一分钟的更新写了二十页报告，感觉有点用力过猛。"},{"en":"Bringing three backups was overkilled for such a small event.","zh":"这么小的活动还带三套备用方案，太夸张了。"}]}],"synonyms":["excessive","overdone","too much","unnecessary","kill excessively"],"phonetic":"/ˌoʊvərˈkɪld/","extraExplanation":["“Overkill”原意多用于军事/狩猎语境，指“超出必要的杀伤/火力”。在日常英语里更常比喻为“做得过头、复杂化”，语气偏口语。","在游戏、科技圈里也常说“That’s overkill.”表示“没必要这么强/这么贵/这么复杂”。“overkilled”作形容词时相对少见，更常用“overkill”本身。"]}
{"word":"overkilling","summary":{"en":"“Overkilling” means using far more effort or resources than necessary—overdoing it.","zh":"“overkilling”指为达成目标投入远超需要的努力/资源，也就是“用力过猛、过度处理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"doing something with much more effort, force, or resources than necessary; overdoing it","zh":"做事用力过猛；投入远超需要的努力、力量或资源；“过度处理”"},"examples":[{"en":"Bringing three laptops to a one-hour meeting is overkilling it.","zh":"开一小时的会带三台笔记本电脑就是“用力过猛”。"},{"en":"I think you’re overkilling the presentation—simple slides are enough.","zh":"我觉得你把这个演示做得太复杂了，简单的幻灯片就够了。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of using excessive measures to solve a problem (the -ing form of “overkill”)","zh":"采取过度手段来解决问题（“overkill”的 -ing 形式，指这种行为）"},"examples":[{"en":"All that double-checking feels like overkilling.","zh":"那样反复核对感觉有点过度了。"},{"en":"Overkilling can waste time and money.","zh":"过度处理会浪费时间和金钱。"}]}],"synonyms":["overdoing it","overkill","going overboard","excessive","too much"],"phonetic":"ˌoʊvərˈkɪlɪŋ","extraExplanation":["“overkilling”多见于口语或非正式写作，更常见的名词形式是“overkill”（This is overkill.）。当你想强调“正在做得太过头”时，人们会用“overkilling it”。","这个词来自“overkill”（原指“杀伤过度”，如军事或狩猎语境中“火力远超需要”），后来引申到日常生活：为小事投入过多资源、把事情做得过于复杂。","语气通常是轻微吐槽或提醒：你做得太多了，但不一定是严重批评。"]}
{"word":"overkills","summary":{"en":"Overkill means doing something with more effort, force, or resources than necessary; “overkills” is either the plural noun or the third-person singular verb form.","zh":"overkill 指“用力过猛/过度手段”；overkills 可作名词复数或动词第三人称单数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"More force, effort, or resources than necessary; excessive action that goes beyond what is needed.","zh":"（为达目的而）用力过猛；过度的手段；超出需要的做法。"},"examples":[{"en":"Hiring ten people to do one small task is overkill.","zh":"为了一个小任务雇十个人就是用力过猛。"},{"en":"For a short email, that level of detail feels like overkill.","zh":"对一封短邮件来说，那样的细节程度显得过度了。"}]},{"partOfSpeech":"v.","definition":{"en":"To defeat or handle something with far more force or intensity than necessary; to do something in an excessive way.","zh":"（以远超必要的力度）解决/击败；把事情做得过头。"},"examples":[{"en":"You don’t need to overkill the presentation—keep it simple.","zh":"你不必把演示做得过头——简单点就好。"},{"en":"The team overkills every minor problem with complicated rules.","zh":"这个团队对每个小问题都用复杂规定“过度处理”。"}]},{"partOfSpeech":"other","definition":{"en":"“Overkills” can mean (1) plural of the noun “overkill,” or (2) the third-person singular form of the verb “overkill” (he/she/it overkills).","zh":"“overkills”可以表示（1）名词“overkill”的复数，或（2）动词“overkill”的第三人称单数形式（他/她/它 overkills）。"},"examples":[{"en":"These add-ons are overkills for most users.","zh":"这些附加功能对大多数用户来说都是“过度配置”。"},{"en":"He overkills every joke by explaining it too much.","zh":"他总把每个笑话都讲过头——解释得太多。"}]}],"synonyms":["excess","too much","overdoing","unnecessary","excessive force"],"phonetic":"ˈoʊvərˌkɪl","extraExplanation":["“overkill”最初常用于军事语境，指使用压倒性火力导致“杀伤过量”。后来扩展到日常生活，表示任何“超过必要”的方法、花费或努力。","口语里常说“that’s overkill / that’s an overkill（不太正式）”，更标准的说法是“that’s overkill”。"]}
{"word":"overkind","summary":{"en":"Overkind means “too kind,” especially in a way that may be excessive or unhelpful.","zh":"overkind 指“过分友善/过度好心”，常暗示好得过头、可能不太合适或帮倒忙。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too kind or generous, sometimes to the point of being unhelpful, unrealistic, or insincere.","zh":"过分友善的；过度慷慨的（有时会显得不切实际、帮倒忙或不真诚）"},"examples":[{"en":"She was overkind to the new employee, praising every small mistake as “cute,” which confused him.","zh":"她对新员工过分友善，把每个小错误都夸成“可爱”，反而让他很困惑。"},{"en":"Don’t be overkind—give honest feedback so I can improve.","zh":"别过分客气——给我真实的反馈，我才能进步。"}]}],"synonyms":["overly kind","too kind","too nice","excessively kind"],"phonetic":"/ˌoʊvərˈkaɪnd/","extraExplanation":["“over-”表示“过度、超过适当程度”。因此 overkind 常带一点批评意味：不是单纯“很善良”，而是“好得过头”。","这个词在日常口语中不算常见；更常用的表达包括 “too kind,” “overly kind,” “too nice,” 或在批评语境下用 “patronizing”（居高临下地好）/ “smothering”（过度照顾）。"]}
{"word":"overkindly","summary":{"en":"“Overkindly” means excessively kind—sometimes kindly in a way that feels unnecessary or patronizing.","zh":"“overkindly”指“过分友善/过于宽厚”，有时带有“多余、让人不自在或显得居高临下”的语感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too kind or too generous; showing more kindness than is necessary or appropriate (sometimes sounding patronizing).","zh":"过分友善的；过于宽厚的（有时会给人一种居高临下、带点施舍感的语气）。"},"examples":[{"en":"She gave me an overkindly smile, as if I couldn’t handle the task myself.","zh":"她给了我一个过分友善的微笑，好像我自己处理不了这个任务一样。"},{"en":"His overkindly advice made her feel small rather than helped.","zh":"他那过分宽厚的建议让她觉得被轻视，而不是受到帮助。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an overly kind way; more kindly than is necessary or suitable.","zh":"以过分友善的方式；友善得有点过头。"},"examples":[{"en":"He spoke overkindly, which made the apology feel less sincere.","zh":"他说话过分温柔，反而让道歉显得不够真诚。"},{"en":"The clerk was overkindly, offering help again and again.","zh":"店员过分热情，一再主动提出帮忙。"}]}],"synonyms":["excessively kind","too kind","overly kind","overly considerate","patronizing (in tone)"],"phonetic":"/ˌoʊvərˈkaɪndli/","extraExplanation":["“over-”表示“过度、超过正常程度”。因此 overkindly 往往不只是“很友善”，还可能暗含“多余、让人不自在、带点施舍或居高临下”的感觉。","在文学或叙述语境里，它常用来描写一种“温柔得不自然”的态度：表面关心，实际让人感到被低估或被怜悯。"]}
{"word":"overkindness","summary":{"en":"“Overkindness” means excessive kindness that can feel unnecessary, patronizing, or harmful.","zh":"“Overkindness”指过度的善意/体贴，好心过头反而让人不舒服、显得居高临下或造成负担。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive kindness—being so kind or helpful that it becomes unnecessary, uncomfortable, or even harmful (often because it feels patronizing or prevents someone from being independent).","zh":"过度的善意/过分的体贴——好心到超出需要，反而让人不舒服、造成负担，甚至产生不良影响（常因显得居高临下或让对方失去独立性）。"},"examples":[{"en":"Her overkindness made him feel like a child who couldn’t do anything alone.","zh":"她的过度体贴让他觉得自己像个什么都做不了的孩子。"},{"en":"Out of overkindness, he kept paying for everything, even when his friends wanted to split the bill.","zh":"出于过度的好心，他总是抢着买单，即使朋友们想AA。"},{"en":"Sometimes overkindness can stop people from learning through their own mistakes.","zh":"有时候过度的善意会让人失去从错误中学习的机会。"}]}],"synonyms":["excessive kindness","overly kind behavior","overindulgence","misguided kindness","smothering kindness"],"phonetic":"/ˌoʊvɚˈkaɪndnəs/","extraExplanation":["“overkindness”不是特别常见的日常词，更常见的表达有：“too kind / overly kind / excessive kindness”。但它很直观，强调“kindness”因为“over-（过度）”而变成问题。","语气上常带一点委婉的批评：不是说对方不善良，而是提醒“好心也要有边界”。在跨文化场景中，英美语境里也常强调尊重对方的独立与选择，过度照顾可能会被理解为不信任对方能力。"]}
{"word":"overking","summary":{"en":"An uncommon historical term meaning a high king who rules over other kings; rarely used as a verb meaning “to rule as a high king.”","zh":"一个较少见的历史用词：指统辖其他国王的至高王；也可作罕用动词，指以至高王身份统治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A high king or supreme ruler who has authority over several lesser kings or kingdoms; an overlord.","zh":"（历史）“至高王 / 共主王”：统辖多个较小国王或王国的最高统治者；诸王之王、霸主。"},"examples":[{"en":"In some early medieval records, the overking could demand tribute from neighboring kings.","zh":"在一些中世纪早期的记载中，至高王可以向邻近的国王索取贡赋。"},{"en":"The story describes a local king who swears loyalty to an overking for protection.","zh":"故事描写了一位地方国王为求庇护而向至高王效忠。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) To rule over other kings; to act as an overking.","zh":"（罕用）统辖其他国王；以“至高王”的身份统治。"},"examples":[{"en":"He tried to overking the region by controlling alliances and trade routes.","zh":"他试图通过控制联盟与贸易路线来“至高王式”统治该地区。"}]}],"synonyms":["high king","overlord","suzerain","paramount king"],"phonetic":"ˈoʊvərkɪŋ","extraExplanation":["“over-”在英语里常表示“在……之上/超过”，所以 overking 字面意思就是“在众王之上的王”。它多见于历史/学术语境，用来翻译或解释某些社会结构中的“共主/霸主”（例如早期中世纪不列颠、爱尔兰或北欧世界里，某位强势君主对其他小王拥有宗主权）。","日常英语中更常用的表达是 high king / overlord / suzerain（学术用语）。在现代语境里直接说 overking 可能会显得很书面或不常见。"]}
{"word":"overknavery","summary":{"en":"“Overknavery” means excessive dishonest or tricking behavior (a rare, literary word).","zh":"“overknavery”指过度的奸诈/欺骗行为（较少见、偏文学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive knavery; too much dishonest or tricking behavior.","zh":"过度的无赖/奸诈行为；太多的欺骗或不诚实。"},"examples":[{"en":"The villagers complained about the merchant’s overknavery in his prices and promises.","zh":"村民抱怨那商人在价格和承诺上的过度奸诈。"},{"en":"She was tired of office overknavery—small lies, blame-shifting, and hidden deals.","zh":"她厌倦了办公室里的过度无赖行径——小谎话、甩锅和暗箱交易。"}]}],"synonyms":["excessive dishonesty","trickery","knavery","rascality","fraud","scheming"],"phonetic":"/ˌoʊvɚˈneɪvəri/","extraExplanation":["“overknavery”非常少见，属于带有文学/古风色彩的构词：over-（过度、太多）+ knavery（无赖、奸诈、恶作剧式的欺骗）。在现代英语中更常用的表达是“too much dishonesty / excessive trickery / outright fraud”等。","“knavery”本身常带有讽刺或道德谴责的语气；加上over-会强调“已经过头、太离谱”。"]}
{"word":"overknee","summary":{"en":"Overknee means “over-the-knee,” usually describing boots, socks, or stockings that go above the knee; it can also refer to such an item.","zh":"overknee 指“过膝的”，多用于描述过膝靴、过膝袜等；也可指这类过膝单品本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Fashion) Extending above the knee; over-the-knee (often used for boots, socks, or stockings).","zh":"（时尚）过膝的；高于膝盖的（常用于靴子、袜子、长筒袜等）。"},"examples":[{"en":"She wore overknee boots with a simple black dress.","zh":"她穿着过膝靴，搭配一条简单的黑色连衣裙。"},{"en":"Overknee socks are popular in some school-uniform styles.","zh":"过膝袜在一些校服风格中很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"An over-the-knee item, especially an over-the-knee boot or stocking (common in fashion writing).","zh":"过膝的单品，尤指过膝靴或过膝长袜（常见于时尚语境）。"},"examples":[{"en":"These overknees are warmer than ankle boots in winter.","zh":"这些过膝靴在冬天比短靴更保暖。"},{"en":"She bought a pair of overknees for a photo shoot.","zh":"她为一次拍摄买了一双过膝靴。"}]}],"synonyms":["over-the-knee","OTK"],"phonetic":"/ˌoʊvərˈniː/","extraExplanation":["“overknee”在英语里多见于时尚/商品描述，也常写作“over-the-knee”或缩写“OTK”。在更正式的写法中，带连字符的“over-the-knee”更常见、更清晰。"]}
{"word":"overknow","summary":{"en":"“Overknow” is a rare, nonstandard verb meaning to know too much or to be overly confident about your knowledge.","zh":"“overknow”是罕见且不太规范的动词，表示“知道得太多”或“过度自信，以为自己全懂”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare / nonstandard) To know too much about something; to be overly familiar with details, often to the point that it reduces surprise, enjoyment, or objectivity.","zh":"（罕见／非标准用法）对某事知道得过多；过度熟悉细节，可能因此降低惊喜、乐趣或客观性。"},"examples":[{"en":"Try not to overknow the plot before you watch the movie.","zh":"看电影前尽量别把剧情了解得太透。"},{"en":"As a researcher, he worried he might overknow the topic and miss new ideas.","zh":"作为研究者，他担心自己对题目太熟，反而忽略新想法。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare / nonstandard) To assume you understand something completely; to be overconfident about what you know.","zh":"（罕见／非标准用法）以为自己完全懂了；对自己的认知过度自信。"},"examples":[{"en":"Don’t overknow—ask questions if you’re not sure.","zh":"别自以为懂了；不确定就问。"},{"en":"She overknew the situation and made a quick, wrong decision.","zh":"她自以为看透了情况，结果草率做了错误决定。"}]}],"synonyms":["know too much","be overly familiar with","be overconfident","think you know it all"],"phonetic":"/ˌoʊvɚˈnoʊ/","extraExplanation":["“overknow”在现代英语中非常不常见，很多情况下会被认为不自然或不规范。更地道的表达通常是：know too much about…, be overly familiar with…, be overconfident about what you know, think you know it all。","构词思路是 over-（过度）+ know（知道），因此语感上容易被理解，但在正式写作里建议改用上面的常见说法。"]}
{"word":"overknowing","summary":{"en":"Overknowing describes someone or a tone that seems to know too much, often in a smug or overly confident way; it can also describe an overly “all-knowing” narrator in stories.","zh":"Overknowing 形容“知道得太多”或“太懂了”的姿态，常带自鸣得意、过度自信的语气；也可用于文学中指过于“全知”的叙述方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Knowing too much, or showing your knowledge in a way that seems smug, overly confident, or “too clever.”","zh":"知道得太多；或以显得自鸣得意、过度自信、过分卖弄聪明的方式表现自己的知识。"},"examples":[{"en":"His overknowing comments made the group discussion uncomfortable.","zh":"他那些过分卖弄聪明的评论让小组讨论变得不舒服。"},{"en":"The film gives the narrator an overknowing tone, as if he’s judging everyone.","zh":"这部电影让叙述者带着一种“太懂了”的口吻，好像在评判所有人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suggesting awareness of things you “shouldn’t” know, especially in a story (e.g., an overknowing narrator).","zh":"（尤用于叙事/文学）暗示知道一些按理不该知道的事，例如“全知过头”的叙述者。"},"examples":[{"en":"Some readers felt the narrator was overknowing and ruined the mystery.","zh":"有些读者觉得叙述者太“全知”了，反而破坏了悬疑感。"}]}],"synonyms":["know-it-all","smug","condescending","too knowing","overconfident"],"phonetic":"/ˌoʊvərˈnoʊɪŋ/","extraExplanation":["“overknowing”在日常英语里不算常见，更常见的表达是“know-it-all（自以为无所不知的人）”、“smug（自鸣得意的）”、“condescending（居高临下的）”、“too knowing（太懂/太世故）”。","在文学评论或影评里，“overknowing narrator（过于全知的叙述者）”常用来批评叙述者知道的信息太多，削弱了悬念或人物的真实感。"]}
