{"word":"overname","summary":{"en":"“Overname” is a rare word meaning to give an extra name (to nickname), or (in Scots/older use) an extra identifying name such as a surname or nickname.","zh":"“overname”很少见，可指“给人取外号/别名”，也可指（苏格兰英语或旧用法中）用于辨识身份的附加名字，如姓氏或绰号。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To give someone an extra name; to nickname or give a byname.","zh":"（罕见）给某人起一个额外的名字；取绰号/别名。"},"examples":[{"en":"At school, his classmates overnamed him “Tiny” even though he was tall.","zh":"在学校里，尽管他个子很高，同学们还是给他起了个外号叫“Tiny（小不点）”。"},{"en":"The villagers overnamed the old bridge “Whisper Bridge” because the wind sounded like voices.","zh":"村民们把那座老桥取了个别名叫“耳语桥”，因为风声听起来像人声。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots/archaic) A surname or a nickname; an additional name used to identify someone.","zh":"（苏格兰英语/古用）姓氏或绰号；用于辨识一个人的附加名字。"},"examples":[{"en":"In old records, he is listed by his overname as well as his given name.","zh":"在旧档案中，除了名字之外，还用他的“姓/别名”来登记。"}]}],"synonyms":["nickname","byname","sobriquet","surname"],"phonetic":"ˌoʊvərˈneɪm","extraExplanation":["“overname”在现代英语里非常少见，更常用的表达是 nickname（绰号）、byname（别名/外号）或 surname（姓氏）。","在苏格兰语境中，overname 常指“附加在名字上的称呼”，可能是姓氏，也可能是外号，用来区分同名的人。阅读历史文献或地方记录时更可能遇到。"]}
{"word":"overnarrow","summary":{"en":"“Overnarrow” means overly/too narrow, especially describing a limited or unfairly restricted view, rule, or definition.","zh":"“overnarrow”意为“过于狭窄/狭隘”，常用于形容观点、规则或定义限制得不合理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too narrow; narrower than is suitable, fair, or helpful (often about ideas, rules, or viewpoints).","zh":"过于狭窄的；狭隘的（常指观点、规则或理解不够全面、不够公平）。"},"examples":[{"en":"The policy is overnarrow and ignores families with unusual living arrangements.","zh":"这项政策过于狭隘，忽视了居住方式较特殊的家庭。"},{"en":"Her interpretation of the poem feels overnarrow, focusing only on the last line.","zh":"她对这首诗的解读显得过于狭窄，只盯着最后一句。"}]}],"synonyms":["overly narrow","too narrow","unduly narrow","restricted","narrow-minded"],"phonetic":"/ˌoʊvɚˈnæroʊ/","extraExplanation":["“overnarrow”并不是非常常见的标准词汇；更常见的表达是“too narrow / overly narrow / unduly narrow / narrow-minded”。但它的构词很直观：前缀 over- 表示“过度、过分”，narrow 表示“狭窄/狭隘”。在正式写作中，更推荐用 “overly narrow” 或 “unduly narrow”。"]}
{"word":"overnarrowly","summary":{"en":"“Overnarrowly” means “too narrowly,” often criticizing an overly strict or limited interpretation.","zh":"“overnarrowly”意为“过于狭隘地/过分严格地”，常用于批评解释或执行范围太窄。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly narrow way; too strictly or with too limited a focus (so that important context or broader meaning may be missed).","zh":"过于狭隘地；过分严格或范围过小地（以至于可能忽略重要背景或更广泛的含义）。"},"examples":[{"en":"The rule was applied overnarrowly, so some people who needed help were excluded.","zh":"这条规定被过于狭隘地执行，结果一些需要帮助的人被排除在外。"},{"en":"If you define success overnarrowly, you may overlook health and relationships.","zh":"如果你把成功定义得过于狭隘，你可能会忽视健康和人际关系。"},{"en":"The court interpreted the law overnarrowly and ignored the policy’s purpose.","zh":"法院对法律作了过于狭隘的解释，忽视了该政策的目的。"}]}],"synonyms":["too narrowly","overly narrowly","restrictively","unduly narrowly","too strictly"],"phonetic":"/ˌoʊvɚˈnæroʊli/","extraExplanation":["“over-”表示“过度、过分”，加在形容词/副词前常带有批评意味，暗示这种做法不够全面或不够公平。","“overnarrowly”在正式写作中更常见，尤其出现在法律、政策、学术评论里；日常口语里人们更常说“too narrowly”。"]}
{"word":"overnarrowness","summary":{"en":"“Overnarrowness” means excessive narrowness, in a physical sense or in terms of limited scope or thinking.","zh":"“overnarrowness”指“过度狭窄”，既可指空间太窄，也可指范围或观点过于局限。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being too narrow in width, size, or range; excessive narrowness (literal or figurative).","zh":"过于狭窄的状态；过度的狭窄（可指实际空间，也可指范围、观点等过于局限）。"},"examples":[{"en":"The overnarrowness of the hallway made it hard for two people to pass.","zh":"走廊过于狭窄，让两个人很难擦身而过。"},{"en":"Some critics argued that the study suffered from overnarrowness in its definition of success.","zh":"一些评论者认为，这项研究对“成功”的定义过于狭隘。"}]}],"synonyms":["excessive narrowness","overly narrowness","restrictiveness","limitedness"],"phonetic":"/ˌoʊvɚˈnæroʊnəs/","extraExplanation":["这个词由 over-（“过度”）+ narrowness（“狭窄；狭隘”）构成，常见于正式写作或批评性语境中，用来指出“限制太多、范围太小”。在日常表达里，人们更常说 too narrow / overly narrow，或用 narrow-mindedness（“心胸狭隘”）来强调态度层面的“狭隘”。"]}
{"word":"overnationalization","summary":{"en":"Overnationalization means excessive nationalization—too much government takeover/ownership of industries or services.","zh":"Overnationalization 指“过度国有化”，即政府对产业或服务的接管/所有权扩张过度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or policy of nationalizing industries or services too much, beyond what is considered effective or appropriate (i.e., excessive government takeover/ownership)","zh":"过度国有化；把产业或服务过度收归国有（被认为超过合理或有效范围的政府接管/所有）"},"examples":[{"en":"Some critics argued that the reform package led to overnationalization and reduced competition.","zh":"一些批评者认为，这套改革方案导致了过度国有化，并削弱了竞争。"},{"en":"They warned that overnationalization could discourage private investment in key sectors.","zh":"他们警告说，过度国有化可能会抑制私人资本对关键行业的投资。"},{"en":"The report distinguishes between strategic nationalization and overnationalization driven by politics.","zh":"该报告区分了“战略性国有化”和由政治因素推动的“过度国有化”。"}]}],"synonyms":["excessive nationalization","overextension of state ownership","state overreach","too much state control"],"phonetic":"/ˌoʊvərˌnæʃənələˈzeɪʃən/","extraExplanation":["“overnationalization”不是特别常见的标准词，更常见的表达是“excessive nationalization”（过度国有化）或“overreach in nationalization”（国有化过度扩张）。","构词上是 over-（过度）+ nationalization（国有化）。它通常出现在政治经济讨论中，带有批评或担忧的语气。"]}
{"word":"overnationalize","summary":{"en":"Overnationalize means to nationalize something excessively, or to push an issue unnecessarily toward the national level.","zh":"Overnationalize 指“过度国有化”，也可指把议题不必要地“过度国家化”（上移到国家层面）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to nationalize something too much or too broadly (to bring too many industries/activities under government ownership or control)","zh":"对……过度国有化；把过多的行业/活动纳入政府所有或控制之下"},"examples":[{"en":"Critics argued that the plan would overnationalize the economy and reduce competition.","zh":"批评者认为该计划会让经济过度国有化，从而削弱竞争。"},{"en":"Some voters worry the policy could overnationalize key services that might work better with mixed public and private management.","zh":"一些选民担心该政策可能会让关键服务过度国有化，而这些服务用公私混合管理也许更有效。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat an issue as more “national” than it needs to be, shifting decisions or identity toward the national level and away from local or regional levels","zh":"把问题“过度国家化”；将决策或认同不必要地上移到国家层面，削弱地方/区域层面"},"examples":[{"en":"The debate became overnationalized, ignoring local needs and solutions.","zh":"这场辩论变得过度国家化，忽视了地方需求与解决方案。"},{"en":"He warned that overnationalizing education policy could limit flexibility for different communities.","zh":"他警告说，过度国家化教育政策可能会限制不同社区的灵活性。"}]}],"synonyms":["over-nationalize","nationalize too broadly","overcentralize","overextend state control"],"phonetic":"/ˌoʊvɚˈnæʃənəˌlaɪz/","extraExplanation":["这个词较少见，常用于政治、经济评论语境。结构是前缀 over-（“过度”）+ nationalize（“国有化/国家化”）。","与 nationalize 相比，overnationalize 带有明显的评价色彩，通常暗示“做过头了、范围太大或后果不佳”。写作中更常见的替代表达包括 over-nationalize（带连字符）或 use nationalize with an adverb（如 “nationalize too much / too broadly”）。"]}
{"word":"overnationalized","summary":{"en":"Overnationalized means “too nationalistic” or “too heavily placed under state control,” depending on context.","zh":"overnationalized 指“过度民族主义化的”，或在政策语境中指“过度国有化/过度国家控制的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made too focused on the nation or nationalism; given an excessive “national” character (often implying bias or exaggeration).","zh":"过度强调国家/民族色彩的；过分民族主义化的（常含批评意味，指带有偏见或夸张的国家立场）。"},"examples":[{"en":"Some critics say the movie gives an overnationalized version of history.","zh":"一些评论家说这部电影把历史讲得过度民族主义化。"},{"en":"The debate became overnationalized and stopped addressing local needs.","zh":"讨论变得过度国家化，反而不再关注地方需求。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Economics/Politics) Put under state ownership or control too much or too broadly; excessively nationalized.","zh":"（经济/政治）被过度国有化的；把太多行业或领域纳入国家控制的。"},"examples":[{"en":"They argued that the overnationalized system reduced competition and innovation.","zh":"他们认为过度国有化的体系削弱了竞争与创新。"},{"en":"In some sectors, an overnationalized approach can create inefficiency.","zh":"在某些领域，过度国有化的做法可能造成低效率。"}]}],"synonyms":["overly nationalistic","excessively nationalized","too state-controlled","hyper-nationalistic"],"phonetic":"/ˌoʊvərˈnæʃənəˌlaɪzd/","extraExplanation":["“overnationalized”不是特别常见的标准词，更常见的表达包括：overly nationalistic（过度民族主义的）、excessively nationalized（过度国有化的）、too state-controlled（过度国家控制的）。","构词：over-（过度）+ nationalize（国有化/使国家化）+ -ed（形容词/过去分词）。具体含义要看语境：谈叙事与立场时多指“民族主义化”；谈政策与产业时多指“国有化过度”。"]}
{"word":"overnationalizing","summary":{"en":"“Overnationalizing” means nationalizing too much or too broadly, often used critically in political and economic contexts.","zh":"“overnationalizing”指“过度国有化”，常用于政治和经济语境，通常带批评意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"nationalizing too much or too broadly; bringing more industries, services, or assets under government ownership/control than is considered necessary or effective","zh":"过度国有化；把过多或过广泛的产业、服务或资产纳入政府所有或控制，被认为超出必要或有效范围"},"examples":[{"en":"Some critics argue that overnationalizing key industries can reduce competition and innovation.","zh":"一些批评者认为，对关键产业过度国有化会降低竞争与创新。"},{"en":"The report warns against overnationalizing the energy sector without a clear plan for efficiency.","zh":"报告警告不要在缺乏明确效率方案的情况下对能源行业过度国有化。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of nationalizing too much or too widely","zh":"过度国有化的行为或过程"},"examples":[{"en":"Overnationalizing may create short-term stability but long-term fiscal pressure.","zh":"过度国有化可能带来短期稳定，但会造成长期财政压力。"}]}],"synonyms":["excessive nationalization","overextending state ownership","state overreach"],"phonetic":"/ˌoʊvərˈnæʃənəˌlaɪzɪŋ/","extraExplanation":["“overnationalizing”来自动词“overnationalize”（over- + nationalize）。它多出现在经济与政治讨论中，语气通常带批评或担忧，强调“国有化做过头了”。","与“nationalize（国有化）”不同，这个词常隐含价值判断：不仅描述政策行为，还暗示其范围/力度被认为不合理或可能带来副作用（如效率下降、财政负担增加）。"]}
{"word":"overnear","summary":{"en":"“Overnear” is an archaic word meaning “very near/very close,” sometimes used like an adverb (“close by”).","zh":"“overnear”是古用词，意为“非常近/极其接近”，有时也可像副词一样表示“就在附近”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Very near; extremely close in distance or time.","zh":"（古用）非常近；极其接近（距离或时间上）。"},"examples":[{"en":"The enemy camp lay overnear the river, so we kept our voices low.","zh":"敌营就在河边近得不能再近，所以我们压低了声音。"},{"en":"Spring felt overnear, even though the nights were still cold.","zh":"尽管夜里仍冷，春天却仿佛近在眼前。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic, adverbial use) Very near; close by.","zh":"（古用，作副词用）很近；就在旁边。"},"examples":[{"en":"Stay overnear, and don’t wander off into the dark.","zh":"待在近处，别摸黑走远。"},{"en":"He stood overnear and listened quietly.","zh":"他站得很近，安静地听着。"}]}],"synonyms":["very near","extremely close","nearby","close by","right next to"],"phonetic":"/ˌoʊvɚˈnɪr/","extraExplanation":["“overnear”多见于早期/文学性英语，带有古风色彩；现代英语更常用“very near / extremely close / nearby / right next to”。","其中“over-”在这里有“过于、非常”的强调意味，类似于把“near”加强为“很近”。","如果在现代写作中使用，通常是为了营造古典叙事口吻或诗意氛围；在正式现代文体中不太常见。"]}
{"word":"overnearness","summary":{"en":"Overnearness means excessive closeness—being too near physically or emotionally.","zh":"overnearness 指“过度的接近/亲近”，既可指空间距离太近，也可指关系上太黏、让人不舒服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being too near; excessive closeness in distance or relationship","zh":"过于接近；（距离或关系上的）过分亲近"},"examples":[{"en":"In a small apartment, overnearness can make it hard to find privacy.","zh":"在小公寓里，过于接近会让人很难有隐私。"},{"en":"Their constant texting created a sense of overnearness, and she started to feel crowded.","zh":"他们不停地发消息造成一种过分亲近的感觉，她开始觉得被“挤压”和束缚。"}]}],"synonyms":["excessive closeness","overfamiliarity","crowdedness","lack of personal space"],"phonetic":"/ˌoʊvərˈnɪrnəs/","extraExplanation":["“overnearness”由前缀 over-（过度）+ nearness（接近）构成，但在现代英语中非常少见，更常见的表达是 “too much closeness / excessive closeness / being too close (for comfort)” 或根据语境说 “lack of privacy（缺乏隐私）”“feeling crowded（感到拥挤/被侵占空间）”。如果你在文学或旧文本里见到它，通常带有“亲近到令人不适”的语气。"]}
{"word":"overneat","summary":{"en":"Overneat means excessively neat or tidy, often with a slightly critical tone.","zh":"Overneat 指“过于整洁/工整”，常带一点批评或不自然的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"too neat, tidy, or orderly; neat in a way that feels excessive, unnatural, or unfriendly","zh":"过于整洁的；整洁到显得刻意、不自然，甚至让人不舒服的"},"examples":[{"en":"The room looked overneat, like nobody actually lived there.","zh":"房间整洁得过头，像是根本没人住过一样。"},{"en":"Her overneat handwriting was beautiful but a little hard to read quickly.","zh":"她的字写得过于工整，虽然好看，但快速阅读时反而有点费劲。"},{"en":"He kept his desk overneat, which made his coworkers nervous about leaving anything out of place.","zh":"他的桌子保持得过分整齐，这让同事们不敢把东西随手放错位置。"}]}],"synonyms":["overly neat","too tidy","overorderly","immaculately tidy"],"phonetic":"/ˌoʊvɚˈnit/","extraExplanation":["“overneat”不是特别常见的日常用词，更常见的表达是“too neat / overly neat”。在写作中它带有轻微的评价色彩：不仅仅是“很整洁”，而是“整洁得过头”，暗示刻板、缺乏生活气或让人有压力。","有时也会写作“over-neat”（加连字符），尤其在较正式或编辑性强的文本里。"]}
{"word":"overneatly","summary":{"en":"“Overneatly” means “too neatly,” often implying an unnatural or overly perfect tidiness.","zh":"“overneatly”表示“过于整洁地”，常暗示整洁得不自然或过分完美。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is too neat, tidy, or orderly—often suggesting unnatural perfection or a lack of warmth/personality.","zh":"过于整洁地；过分规整地（常暗示不自然、过于完美，甚至缺少温度或个性）。"},"examples":[{"en":"The room was arranged overneatly, like a showroom rather than a home.","zh":"房间摆得过于整齐，像展厅而不像家。"},{"en":"Her hair was combed overneatly for a casual picnic.","zh":"去随意的野餐，她却把头发梳得过分一丝不苟。"},{"en":"The report was written overneatly, but it didn’t answer the main question.","zh":"报告写得过于工整漂亮，但没有回答核心问题。"}]}],"synonyms":["too neatly","overly neatly","excessively neatly","immaculately (sometimes)","obsessively (in context)"],"phonetic":"/ˌoʊvɚˈnitli/","extraExplanation":["“overneatly”由前缀 over-（过度、太……）+ neatly（整洁地）构成，表达“整洁得过头”。在语气上常带轻微批评：不仅是干净，而是“刻意得不真实”。","在实际写作中它不算常见，更常见的表达有：“too neatly / overly neatly / almost obsessively neat”。"]}
{"word":"overneatness","summary":{"en":"Overneatness means being excessively neat or tidy, often to an uncomfortable or unnatural degree.","zh":"overneatness 指过度整洁、过分讲究整齐，常给人不自然或不舒服的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being too neat, tidy, or orderly, often in a way that feels unnatural, obsessive, or unfriendly","zh":"过度整洁；过分讲究整齐（常带有不自然、近乎强迫或让人不舒服的意味）"},"examples":[{"en":"The room’s overneatness made it feel more like a showroom than a home.","zh":"房间过度整洁，让它更像样品间而不像家。"},{"en":"Her overneatness sometimes slowed the team down because she kept reorganizing everything.","zh":"她的过分整齐有时会拖慢团队进度，因为她总在重新整理所有东西。"},{"en":"He disliked the overneatness of the office and wanted a space that felt more lived-in.","zh":"他不喜欢办公室那种过度整洁，想要一个更有“生活气”的空间。"}]}],"synonyms":["excessive neatness","over-tidiness","meticulousness (sometimes)","fastidiousness (often negative)"],"phonetic":"/ˌoʊvɚˈnitnəs/","extraExplanation":["“overneatness”是由 over-（过度）+ neat（整洁的）+ -ness（名词后缀）构成的词，表达一种带评价色彩的“太整洁”。在日常英语中更常见的说法是“being too neat/tidy”或“excessive neatness/tidiness”。","语气通常略带负面或调侃，暗示整洁已经影响到舒适感、人际氛围或效率；但在某些场合也可能只是中性描述（比如强调空间像展厅一样）。"]}
{"word":"overneglect","summary":{"en":"“Overneglect” is a very rare, nonstandard word meaning to neglect something excessively (or the state of excessive neglect).","zh":"“overneglect”是非常少见且非标准的词，指“过度忽视”（或“过度忽视的状态”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Very rare / nonstandard) To neglect something too much; to fail to care for, maintain, or pay attention to something excessively.","zh":"（非常少见／非标准用法）过度忽视；对某事缺乏照料、维护或关注到过分的程度。"},"examples":[{"en":"If you overneglect your health, small problems can become serious later.","zh":"如果你过度忽视健康，小问题以后可能变成大问题。"},{"en":"The old house was overneglected for years and finally needed major repairs.","zh":"这栋老房子多年被过度忽视，最终需要大修。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare / nonstandard) The act or state of being neglected too much.","zh":"（非常少见／非标准用法）过度忽视的行为或状态。"},"examples":[{"en":"Overneglect of public parks can harm both the environment and community life.","zh":"对公共公园的过度忽视会伤害环境，也会影响社区生活。"}]}],"synonyms":["severely neglect","grossly neglect","neglect too much","fail to maintain","pay too little attention to"],"phonetic":"ˌoʊvərnəˈɡlɛkt","extraExplanation":["“overneglect”在现代英语里并不是常见或规范的词，更多像是把前缀 over-（过度）加在 neglect（忽视）上形成的临时造词。正式写作中更自然的表达通常是：“neglect too much / severely neglect / grossly neglect / fail to maintain”。","前缀 over- 常用来表示“过度”，如 overwork（过度工作）、overuse（过度使用）。因此即使读者能猜到 overneglect 的意思，但在考试、论文或商务写作里建议换成更常见的说法。"]}
{"word":"overneglectful","summary":{"en":"“Overneglectful” means extremely neglectful—showing too little care or attention.","zh":"“overneglectful”表示“过度忽视的/极其疏忽的”，强调忽视程度很严重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Excessively neglectful; failing to give enough care, attention, or responsibility beyond what is reasonable.","zh":"过度忽视的；极其疏于照顾/关注的；在不合理的程度上不尽责任的。"},"examples":[{"en":"The report says the landlord was overneglectful, ignoring repeated requests to fix the heating.","zh":"报告称房东过度忽视，多次无视修理暖气的请求。"},{"en":"Calling a parent “overneglectful” is a serious claim and should be based on clear evidence.","zh":"称某位家长“过度忽视”是很严重的指控，应以明确证据为依据。"},{"en":"I was overneglectful of my health during finals week, sleeping only a few hours each night.","zh":"期末周我对健康过度忽视，每晚只睡几个小时。"}]}],"synonyms":["severely neglectful","highly inattentive","careless","irresponsible","negligent"],"phonetic":"/ˌoʊvərnəˈɡlɛktfəl/","extraExplanation":["“over-”是常见前缀，表示“过度、太……”，放在形容词或动词前，用来强调程度（如: overconfident 过于自信，overprotective 过度保护）。因此 overneglectful 通常表示“比一般的 neglectful（疏忽的）更严重”。","这个词不是非常常见，更自然的表达常用 very neglectful、severely neglectful、grossly negligent（偏法律/正式）等。"]}
{"word":"overneglectfully","summary":{"en":"“Overneglectfully” means “in an excessively neglectful way,” but it’s very rare and may sound nonstandard.","zh":"“overneglectfully”表示“以过度忽视的方式”，但非常罕见，可能显得不够地道。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively neglectful way; paying too little attention or care.","zh":"以过度忽视的方式；太不在意、太不照顾地。"},"examples":[{"en":"The report argues that the issue has been handled overneglectfully for years.","zh":"报告认为，这个问题多年来一直被过度忽视地处理。"},{"en":"If you treat your health overneglectfully, small problems can become serious.","zh":"如果你过度忽视自己的健康，小问题也可能变成大问题。"}]}],"synonyms":["too neglectfully","with excessive neglect","in an overly neglectful way","carelessly (in some contexts)"],"phonetic":"/ˌoʊvərnəˈɡlɛktfəli/","extraExplanation":["“overneglectfully”非常罕见，很多词典里不会收录；写作中更常用更自然的表达是“too neglectfully / with excessive neglect / in an overly neglectful way”。","构词上可理解为 over-（过度） + neglect（忽视） + -ful（充满……的） + -ly（副词）。有时读者会觉得它“生造”或不够地道，因此正式写作建议改用更常见的说法。"]}
{"word":"overneglectfulness","summary":{"en":"Overneglectfulness means excessive neglectfulness—neglecting things too much.","zh":"overneglectfulness 指“过度的疏忽/忽视”，强调忽略得太多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an excessive tendency or habit of neglecting people, duties, or details; too much neglectfulness","zh":"过度的忽视倾向或习惯；对人、职责或细节忽略得太多"},"examples":[{"en":"His overneglectfulness at work caused small problems to pile up into a big one.","zh":"他在工作中过度忽视细节，导致小问题累积成大问题。"},{"en":"Overneglectfulness in relationships can make the other person feel unimportant.","zh":"在人际关系中过度忽视，会让对方觉得自己不重要。"}]}],"synonyms":["excessive neglect","extreme neglect","negligence","carelessness"],"phonetic":"/ˌoʊvərnəˈɡlɛktfəlnəs/","extraExplanation":["“overneglectfulness”不是常见标准词，更像是把 over-（过度）+ neglectfulness（疏忽、忽视）临时组合出来的表达。在正式写作里，更自然的说法通常是 “excessive neglect / extreme neglect / negligence”。","词形提示：over- 常表示“过度、太……”，例如 overwork（过度工作）、overthink（想太多）。因此这个词的核心意思是“忽视得过头”。"]}
{"word":"overnegligence","summary":{"en":"“Overnegligence” means excessive or extreme negligence, but it is an uncommon word; “gross negligence” is more standard.","zh":"“overnegligence”指“过度/极度疏忽”，但用法不常见；更标准的说法是“gross negligence（重大过失）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) Excessive negligence; a level of carelessness beyond what is normal or acceptable.","zh":"（不常用）过度疏忽；超出一般或可接受范围的粗心大意。"},"examples":[{"en":"The report criticized the clinic for overnegligence in basic hygiene practices.","zh":"报告批评该诊所对基本卫生操作存在过度疏忽。"},{"en":"In court, the lawyer argued that the harm resulted from overnegligence rather than a simple mistake.","zh":"在法庭上，律师主张伤害源于过度疏忽，而不是普通失误。"}]}],"synonyms":["gross negligence","extreme negligence","serious negligence","recklessness"],"phonetic":"/ˌoʊvərˈnɛɡlɪdʒəns/","extraExplanation":["“overnegligence”不是现代英语里常见的标准词，更多像是临时造词（over- + negligence），用来强调“疏忽得太过分”。正式写作或法律语境中更常用的表达是“gross negligence（重大过失）”、“extreme negligence（极度疏忽）”或“serious negligence（严重疏忽）”。","词缀“over-”常表示“过度、超出限度”（如 overwork 过度工作、overreact 反应过度），因此“overnegligence”直观含义就是“疏忽过头”。"]}
{"word":"overnegligent","summary":{"en":"“Overnegligent” means extremely negligent—far too careless or inattentive.","zh":"“overnegligent”表示“极其疏忽的、过度不负责任的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"excessively negligent; showing too little care or attention, to an extreme degree.","zh":"过度疏忽的；极其不负责任的；（对该做的事）非常不用心的。"},"examples":[{"en":"The report said the company was overnegligent about basic safety checks.","zh":"报告称这家公司在基本安全检查方面过度疏忽。"},{"en":"Leaving a child alone near water is overnegligent behavior.","zh":"把孩子单独留在水边是极其疏忽的行为。"}]}],"synonyms":["grossly negligent","extremely negligent","reckless","careless","remiss"],"phonetic":"ˌoʊvərˈnɛlɪdʒənt","extraExplanation":["“overnegligent”不是很常见的标准词，更常见的表达是“grossly negligent（重大过失的）”“extremely negligent（极其疏忽的）”“recklessly careless（鲁莽大意的）”。","构词上由前缀 over-（过度、太……）+ negligent（疏忽的）组成，用来加强语气，强调“疏忽到了不合理/不可接受的程度”。","在法律或正式语境中，如果你想表达“严重到接近违法或需要承担责任”，常用“gross negligence（重大过失）”比“overnegligent”更自然。"]}
{"word":"overnegligently","summary":{"en":"“Overnegligently” means “too negligently; excessively carelessly.”","zh":"“overnegligently”表示“过于疏忽地；过分粗心地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively negligent or careless way; so carelessly that it goes beyond what is normal or acceptable.","zh":"以过度疏忽、过分粗心的方式；粗心到超出正常或可接受的程度。"},"examples":[{"en":"The lab records were kept overnegligently, so nobody could trace the missing samples.","zh":"实验室记录保管得过于疏忽，所以没人能追查丢失的样本。"},{"en":"He handled the customer’s data overnegligently, leaving it visible on a public screen.","zh":"他对客户数据处理得过分疏忽，把信息留在公共屏幕上可见。"}]}],"synonyms":["too negligently","far too carelessly","grossly negligently","with excessive negligence"],"phonetic":"/ˌoʊvərˈnɛdʒɪdʒəntli/","extraExplanation":["“over-”是英语常见前缀，表示“过度、太……”。“overnegligently”= over-（过度）+ negligently（疏忽地）。","这个词非常少见，日常英语中更常用：“too negligently / far too carelessly / with gross negligence（严重过失地）”。在法律或正式写作里，常会用“grossly negligently”来表达“过失程度很严重”。"]}
{"word":"overnegligentness","summary":{"en":"Overnegligentness means extreme or excessive negligence—being too careless.","zh":"overnegligentness 指“过度/极端疏忽”，即过于粗心大意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being excessively negligent; extreme carelessness that goes beyond normal negligence","zh":"过度疏忽的状态；比一般“疏忽”更严重的极端粗心大意"},"examples":[{"en":"The report criticized the team’s overnegligentness in checking safety equipment.","zh":"报告批评团队在检查安全设备时过度疏忽。"},{"en":"Even small mistakes can add up when overnegligentness becomes a habit.","zh":"当过度疏忽变成习惯时，即使小错误也会累积成大问题。"}]}],"synonyms":["extreme negligence","gross negligence","carelessness","recklessness"],"phonetic":"/ˌoʊvərˈnɛlədʒəntnəs/","extraExplanation":["“overnegligentness”非常少见，更多是临时造词（nonce word），在正式写作中不常用。更自然的表达通常是“extreme negligence（极端疏忽）”或法律语境中的“gross negligence（重大过失/严重疏忽）”。","构词法：over-（过度）+ negligent（疏忽的）+ -ness（名词后缀，表示状态/性质）。因为“negligence”本身已是常用名词，所以很多时候直接用“negligence / gross negligence”会更地道。"]}
{"word":"overnervous","summary":{"en":"Overnervous means excessively nervous.","zh":"overnervous 表示“过度紧张的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"excessively nervous; more nervous than the situation seems to require","zh":"过度紧张的；比情况所需要的更紧张"},"examples":[{"en":"She gets overnervous before exams, even when she has studied a lot.","zh":"她考试前会过度紧张，即使已经复习得很充分。"},{"en":"Try not to be overnervous—it's just a short interview.","zh":"别太紧张——这只是个简短的面试。"}]}],"synonyms":["overly nervous","too nervous","anxious","jittery","tense"],"phonetic":"/ˌoʊvərˈnɝvəs/","extraExplanation":["“overnervous”并不是最常见、最标准的拼写；更常见的是写成“overly nervous / too nervous / extremely nervous”，或用连字符“over-nervous”。在正式写作里，建议用“overly nervous”。","“over-”作为前缀常表示“过度、太多”（如 overthink 过度思考、overreact 反应过度）。因此“over-nervous/overnervous”在口语或非正式语境中容易被理解为“过度紧张”。"]}
{"word":"overnervously","summary":{"en":"“overnervously” means “too nervously; with excessive anxiety.”","zh":"“overnervously”意思是“过度紧张地；紧张得过头”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in an excessively nervous way; showing more anxiety or worry than the situation requires","zh":"过度紧张地；表现出超过情境所需的焦虑或担心"},"examples":[{"en":"He laughed overnervously and kept checking his phone.","zh":"他紧张得笑得有点过头，还不停地看手机。"},{"en":"She spoke overnervously during the interview and rushed her answers.","zh":"她面试时说话过于紧张，回答得很急。"}]}],"synonyms":["overly nervously","too nervously","anxiously","uneasily"],"phonetic":"/ˌoʊvərˈnɝvəsli/","extraExplanation":["“overnervously”更常见的写法是“over-nervously”（加连字符更清晰），意思是“紧张得过头”。日常写作里也常用“too nervously / overly nervously / nervously”来表达类似意思，其中“overly nervously”更常见。","这个词通常带有轻微的评价色彩：说话者觉得对方的紧张有点夸张或不必要，但不一定是批评，也可能只是客观描述。"]}
{"word":"overnervousness","summary":{"en":"Overnervousness means excessive nervousness or worry, especially in situations like tests, interviews, or public speaking.","zh":"Overnervousness 指“过度紧张/过度担心”，常见于考试、面试或公开讲话等场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive nervousness; more worry or tension than a situation reasonably requires","zh":"过度紧张；比情境所需要的更多焦虑或不安"},"examples":[{"en":"Her overnervousness before the interview made it hard to answer simple questions.","zh":"面试前她过度紧张，导致连简单问题都很难回答。"},{"en":"Try not to let overnervousness take over—take a slow breath and focus on one step at a time.","zh":"别让过度紧张控制你——慢慢呼吸，一次专注一步。"}]}],"synonyms":["excessive nervousness","anxiety","jitters","overanxiety","worry"],"phonetic":"/ˌoʊvɚˈnɝvəsnəs/","extraExplanation":["“overnervousness”在实际英语中不算常见；更常见的写法是带连字符的“over-nervousness”，或直接用更自然的表达：“excessive nervousness / anxiety / being overly nervous”。","语气上，“anxiety”更偏医学或持续性的焦虑；“over-nervousness/being overly nervous”更像对当下状态的描述，常用于演讲、考试、面试等场景。"]}
{"word":"overneutralization","summary":{"en":"Overneutralization means neutralizing something too much, which can weaken or change the intended effect.","zh":"overneutralization 指“过度中和”，把某物中和过头，导致效果减弱或发生偏差。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(science/medicine) The process of neutralizing something too much, so its intended effect is reduced or reversed.","zh":"（科学/医学）“过度中和”；把某物中和得太多，导致原本需要的作用减弱甚至反向。"},"examples":[{"en":"Overneutralization can make the solution basic instead of neutral.","zh":"过度中和会让溶液变成碱性，而不是中性。"},{"en":"The report warns that overneutralization may reduce the treatment’s effectiveness.","zh":"报告警告说，过度中和可能降低治疗的有效性。"}]},{"partOfSpeech":"n.","definition":{"en":"(immunology) Neutralizing a virus or toxin more than necessary, potentially interfering with a desired immune response or dosing balance.","zh":"（免疫学）对病毒或毒素“中和过量”，可能干扰预期的免疫反应或用量平衡。"},"examples":[{"en":"Researchers checked whether antibody overneutralization changed the results of the assay.","zh":"研究人员检查抗体过度中和是否改变了实验（测定）的结果。"},{"en":"Adjusting the dose helped avoid overneutralization in later trials.","zh":"调整剂量有助于在后续试验中避免过度中和。"}]}],"synonyms":["excess neutralization","overcorrection","overcompensation","neutralized too much"],"phonetic":"/ˌoʊvɚˌnuːtrələˈzeɪʃən/","extraExplanation":["“over-”是常见前缀，表示“过度/超过需要”（如 overwork 过度工作、overreact 反应过度）。“neutralization”来自 neutral（中性的）+ -ize（使成为…）+ -ation（名词后缀），整体直译就是“过度地使其变中性”。","该词多见于技术语境：化学（酸碱滴定、废水处理）、药学/生物（抗体中和实验）、工程（酸洗后中和）等。日常英语中较少使用，常被更通俗的说法替代，如 “neutralized too much”。"]}
{"word":"overneutralize","summary":{"en":"To neutralize something too much, reducing it more than intended.","zh":"把某物过度中和/过度处理成中性，削弱得超过预期。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to neutralize something too much, so that its effect, flavor, meaning, or charge is reduced more than intended","zh":"过度中和（某物），导致其效果、味道、意义或电荷被削弱得超过预期"},"examples":[{"en":"If you add too much base, you can overneutralize the acid and ruin the solution.","zh":"如果加了太多碱，就可能把酸过度中和，破坏溶液。"},{"en":"The editor tried to avoid bias, but overneutralized the article and removed the author’s voice.","zh":"编辑想避免偏见，却把文章过度“中立化”，把作者的表达特色也删掉了。"}]}],"synonyms":["overcorrect","overcompensate","neutralize too much","dilute (figurative)"],"phonetic":"ˌoʊvɚˈnuːtrəˌlaɪz","extraExplanation":["这个词由 over-（“过度”）+ neutralize（“中和/使中立”）构成，常见于科学语境（酸碱中和、电荷中和）以及引申语境（把观点、语气“削平”到过分中性）。","在写作/媒体语境里，overneutralize 往往带批评意味：为了显得客观而把立场与细节处理得太“平”，反而失去清晰度或力量。"]}
{"word":"overneutralized","summary":{"en":"Overneutralized means neutralized too much (often in chemistry), or figuratively made so neutral that it loses strength or character.","zh":"overneutralized 指“中和过度”（常见于化学），也可比喻“被调和得过头而失去力度或特色”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Neutralized too much, especially in chemistry, so that an acid or base has been more than fully balanced and the mixture ends up on the opposite side (too basic or too acidic).","zh":"（尤指化学中）中和过度；本来只需把酸或碱“中和到刚好”，却加得太多，结果反而偏到另一边（过碱或过酸）。"},"examples":[{"en":"The solution was overneutralized, so the pH rose above 7 and became slightly basic.","zh":"溶液被过度中和，pH 升到 7 以上，变得略呈碱性。"},{"en":"If you add too much lime, the soil can become overneutralized and harm some plants.","zh":"如果加太多石灰，土壤可能会过度中和，从而伤害某些植物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Made so balanced or “neutral” that it loses its original strength, character, or clear viewpoint.","zh":"（比喻）被“中和/调和”得过头，以至于失去原本的力度、特色或明确立场。"},"examples":[{"en":"The editor worried the article had been overneutralized and no longer sounded honest or direct.","zh":"编辑担心这篇文章被“过度中和”，听起来不再真诚或直接。"},{"en":"After many compromises, the proposal felt overneutralized—safe, but unexciting.","zh":"经过多次妥协后，这份提案显得“过度中和”——很安全，但不吸引人。"}]}],"synonyms":["excessively neutralized","overcorrected","made too neutral","oversanitized"],"phonetic":"/ˌoʊvərˈnuːtrəlaɪzd/","extraExplanation":["“over-”表示“过度”。“neutralize”是“使中和/使中立”。因此 overneutralized 常见于酸碱反应、土壤处理、水处理等语境。","化学里常用 pH 来判断是否过度中和：酸（pH<7）被加碱中和时，如果碱加过量，就会从“刚好接近 7”变成“偏碱（pH>7）”。反过来亦然。","比喻用法多见于写作、政策、表达立场：为了避免冒犯或追求“中立”，把语言改得太保守，导致信息变弱、缺少锋芒。"]}
{"word":"overneutralizer","summary":{"en":"An overneutralizer neutralizes something too much, creating an unwanted over-correction.","zh":"overneutralizer 指“过度中和者/过度中和剂”，把中和或抵消做过头，造成矫枉过正。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that neutralizes something too much, causing an unwanted opposite effect or imbalance","zh":"过度中和者；把某物中和得过头的人或事物，导致不良的相反效果或失衡"},"examples":[{"en":"In the lab, adding too much base can turn a helpful neutralizer into an overneutralizer.","zh":"在实验室里，加太多碱会让原本有用的中和剂变成“过度中和者”。"},{"en":"The new policy was meant to reduce conflict, but it became an overneutralizer and removed useful debate.","zh":"新政策本想减少冲突，却成了“过度中和者”，把有益的讨论也消除了。"}]},{"partOfSpeech":"n.","definition":{"en":"(chemistry/industry) an additive or agent that over-corrects acidity or reactivity beyond the target level","zh":"（化学/工业）过度校正酸度或反应性的添加剂/药剂，使指标超过目标范围"},"examples":[{"en":"The wastewater treatment failed because the overneutralizer pushed the pH too high.","zh":"废水处理失败是因为过度中和剂把 pH 推得过高。"},{"en":"Engineers reduced the dose to prevent the overneutralizer effect.","zh":"工程师降低了剂量以避免“过度中和”的效应。"}]}],"synonyms":["overcorrector","overcompensator","overadjuster"],"phonetic":"/ˌoʊvɚˈnuːtrəlaɪzɚ/","extraExplanation":["这是一个不太常见、偏“自造/临时用词”的英语词：over-（过度）+ neutralize（中和、抵消）+ -er（执行者/工具）。常见于技术写作（如化学、环保、工程）或比喻语境（如政策、沟通）中，用来强调“矫枉过正”。","更常见的表达有：overcorrect（矫正过度）、neutralize too much（中和过头）、go too far（做得过头）。"]}
{"word":"overneutralizing","summary":{"en":"Overneutralizing means neutralizing too much—either overshooting a target pH in chemistry or making language/ideas so neutral that they lose clarity and character.","zh":"overneutralizing 指“中和过度”：化学上是把酸碱调过头（pH 超出目标），引申为把语言/观点处理得过于中立而失去清晰度与特色。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Adding too much of a neutralizing agent (acid or base) so the mixture goes past the desired neutral point (often around pH 7) or past the target pH.","zh":"（化学）加入过量的中和剂（酸或碱），使溶液超过理想的中和点（常指接近 pH 7）或超过目标 pH。"},"examples":[{"en":"We were aiming for pH 7, but overneutralizing pushed the solution alkaline.","zh":"我们原本要调到 pH 7，但过度中和把溶液推成了碱性。"},{"en":"Overneutralizing the wastewater can create new problems for downstream treatment.","zh":"对废水过度中和会给后续处理带来新的问题。"}]},{"partOfSpeech":"v.","definition":{"en":"Making something overly neutral, mild, or bland by removing too much opinion, emotion, or distinctive character.","zh":"（引申）把内容处理得过于中立、温和或无特色，因为删掉/抹平了太多观点、情绪或个性。"},"examples":[{"en":"In trying to avoid controversy, the editor ended up overneutralizing the article’s voice.","zh":"为了避免争议，编辑反而把文章的语气过度“中立化”，失去了特色。"},{"en":"Overneutralizing your feedback can make it unclear what you actually want changed.","zh":"把反馈说得过于“中性”，可能会让人不清楚你到底希望改什么。"}]}],"synonyms":["overshoot the pH","overcorrect","overcompensate","water down (figurative)","sanitize (figurative)"],"phonetic":"/ˌoʊvərˈnuːtrəlaɪzɪŋ/","extraExplanation":["这个词多见于技术/实验语境，尤其是酸碱滴定、废水处理、化工生产等：本来要“中和到目标点”，但加药过量导致 pH 反向偏离（例如酸被加太多碱而变碱）。","引申用法常出现在写作与沟通中，类似“把棱角磨平”“把立场和情绪抹掉”，通常带有负面含义：过分追求中立反而削弱清晰度和说服力。"]}
{"word":"overnew","summary":{"en":"Overnew means “too new” (a rare, old-fashioned word).","zh":"overnew 意为“过于新”（很少用、偏古旧的词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/archaic) Too new; excessively new or fresh, sometimes in a way that feels unfamiliar or not yet proven.","zh":"（罕见/古旧）过于新；新得过头（有时带有“不够熟悉、尚未被验证”的感觉）。"},"examples":[{"en":"The shoes looked overnew, as if they had never touched the ground.","zh":"这双鞋看起来新得过头，仿佛从没落过地。"},{"en":"He distrusted the overnew system and preferred the older method.","zh":"他不太信任这个过于新的系统，更偏好旧方法。"}]}],"synonyms":["too new","overly new","brand-new","fresh","unfamiliar"],"phonetic":"/ˌoʊvɚˈnuː/","extraExplanation":["“overnew”在现代英语中非常少见，多见于较早时期或仿古/文学风格的写法，也常写作“over-new”（带连字符）。","日常表达里更自然的说法通常是“too new / overly new / brand-new”，如果强调“新得不可靠”，也可用“unproven / untested”。"]}
{"word":"overnice","summary":{"en":"“Overnice” means excessively nice—so polite or friendly that it feels unnatural or insincere.","zh":"“overnice”指“好得过头”——过分客气或友善，以至于显得不自然或不真诚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Too nice in a way that seems excessive, unnatural, or possibly insincere; overly polite or friendly.","zh":"（非正式）好得过头；过分客气或友善，给人不自然、做作，甚至可能不真诚的感觉。"},"examples":[{"en":"He was so overnice in the interview that it felt like he was trying too hard.","zh":"他在面试里客气得过头，感觉像是在用力过猛。"},{"en":"The salesperson was overnice, and I started to wonder what the catch was.","zh":"那个销售热情得有点过头，我开始怀疑是不是有什么套路。"},{"en":"I don’t mind kindness, but being overnice can come across as fake.","zh":"我不介意善良，但太过“好”有时会显得很假。"}]}],"synonyms":["overly nice","too nice","overly polite","overly friendly","excessively nice"],"phonetic":"/ˌoʊvɚˈnaɪs/","extraExplanation":["“overnice”是由 over-（过度）+ nice（友好/讨人喜欢）组成的口语用词，通常带一点负面评价：不是说“善良不好”，而是强调“过度到让人不舒服/不可信”。","语气取决于场景：在服务业或初次见面时，别人可能觉得你“太会来事儿”“刻意讨好”；在亲密关系里也可能指“过度迎合、不敢表达真实想法”。","更常见、更自然的表达还有：too nice / overly nice / a bit too nice。写作或正式场合建议用 overly nice。"]}
{"word":"overnicely","summary":{"en":"Overnicely means “too nicely,” often suggesting something is overly polite, careful, or unnaturally perfect.","zh":"overnicely 表示“过于好/过于客气（或过于讲究）”，常含“过头了、不太自然”的意味。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"too nicely; in an overly polite, careful, or precise way (sometimes implying it feels unnatural or excessive).","zh":"过于好（过于礼貌、过于小心或过于讲究）；有时带有“显得不自然/过头”的含义。"},"examples":[{"en":"He spoke overnicely, as if he were trying to sell me something.","zh":"他说话过于客气，像是在推销什么东西。"},{"en":"Don’t phrase it overnicely—just be direct and clear.","zh":"别把话说得太客套——直接清楚就好。"},{"en":"The report was written overnicely, with extra details that weren’t needed.","zh":"这份报告写得过于讲究，加入了很多不必要的细节。"}]}],"synonyms":["too nicely","overly nicely","overly politely","too politely","overly carefully","too perfectly"],"phonetic":"/ˌoʊvərˈnaɪsli/","extraExplanation":["“overnicely”由前缀 over-（表示“过度、太……”）+ nicely 构成，语气常带轻微批评或调侃：不是“很友好”，而是“友好到过头”。","这个词在日常口语里不算常见；更常见的表达包括：too nicely、overly nice、a bit too polite、almost too perfect 等。"]}
{"word":"overniceness","summary":{"en":"“Overniceness” means being too nice or too polite in a way that can feel forced or insincere.","zh":"“overniceness”指过度客气或过分友好，常让人觉得刻意或不真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive politeness or friendliness, especially in a way that feels forced, insincere, or unnecessary.","zh":"过度客气；过分友好（常带有“显得刻意、不真诚或没必要”的感觉）。"},"examples":[{"en":"The email was full of overniceness, so I wondered what they really wanted.","zh":"这封邮件客气得过头了，所以我在想他们到底想要什么。"},{"en":"Some customers dislike overniceness because it can feel fake.","zh":"有些顾客不喜欢过度客气，因为会让人觉得不真诚。"}]}],"synonyms":["excessive politeness","overpoliteness","being overly nice","forced friendliness","ingratiation"],"phonetic":"/ˌoʊvɚˈnaɪsnəs/","extraExplanation":["“overniceness”不是很常见的标准词，更像口语/网络用语：由 over-（过度）+ nice（友好/客气）+ -ness（名词后缀）组成，用来批评“太客气、太热情”。","语气通常偏负面或讽刺：不是说“礼貌不好”，而是强调“过头了”导致不自然、像在推销或有所图。","更常见的表达还有：overly nice / too nice / excessively polite；如果想更正式，可说：excessive politeness 或 overly ingratiating behavior（更强烈，带“讨好”意味）。"]}
{"word":"overniceties","summary":{"en":"Overniceties means excessive politeness or formalities—being too nice in a way that feels unnecessary.","zh":"overniceties 指“过度客套/过分讲礼貌”，强调不必要、甚至显得生硬或不真诚的礼节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive politeness, formalities, or small polite gestures; being “too nice” in a way that can feel unnecessary or insincere.","zh":"过度的客套/礼貌（过分讲究礼节或小礼数），有时会让人觉得多余或不真诚。"},"examples":[{"en":"We wasted ten minutes on overniceties before getting to the real problem.","zh":"我们在进入真正的问题前，花了十分钟在过度客套上。"},{"en":"In an emergency, overniceties can slow down decision-making.","zh":"在紧急情况下，过度讲礼貌可能会拖慢决策。"},{"en":"I appreciate kindness, but the overniceties made the conversation feel stiff.","zh":"我很欣赏善意，但那些过度客套让对话显得很拘谨。"}]}],"synonyms":["excessive politeness","too many niceties","needless formalities","overpoliteness","empty pleasantries"],"phonetic":"/ˌoʊvərˈnaɪsətiz/","extraExplanation":["“overniceties”并不是非常常见、固定收录在所有词典里的标准词形，更像是写作者临时组合的用法：over-（过度）+ niceties（礼节、小客套）。意思通常是“过分客气/过度讲究礼数”。在正式写作里，也常用更常见的表达：excessive politeness / too many niceties / needless formalities。"]}
{"word":"overnicety","summary":{"en":"Overnicety means being excessively nice or overly picky about small details.","zh":"overnicety 指“好得过头”或“对小细节过度讲究/挑剔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"excessive politeness or kindness; being “too nice” in a way that can feel insincere or unhelpful","zh":"过分的客气/友好；“好得过头”，让人觉得不真诚或反而帮不上忙"},"examples":[{"en":"Her overnicety made the apology sound rehearsed rather than heartfelt.","zh":"她过分客气的语气让道歉听起来像排练过的，而不是真心的。"},{"en":"In a crisis, overnicety can waste time—be clear and direct.","zh":"在危机时刻，过分客气可能会浪费时间——要清楚、直接。"}]},{"partOfSpeech":"n.","definition":{"en":"overly fine attention to small details or rules; excessive fussiness or scrupulousness","zh":"对细枝末节或规矩过度讲究；过分挑剔/过分拘谨"},"examples":[{"en":"The editor urged him to avoid overnicety and focus on the main argument.","zh":"编辑劝他别在小细节上过度讲究，要把重点放在主要论点上。"},{"en":"They dismissed his objections as overnicety about wording.","zh":"他们把他的反对意见当成对措辞的过分挑剔。"}]}],"synonyms":["excessive politeness","overcourtesy","fussiness","over-scrupulousness","overrefinement"],"phonetic":"/ˌoʊvɚˈnaɪsəti/","extraExplanation":["“overnicety”比较少见，带一点书面或旧式语感，多用来批评“过度讲究”或“过分客气”。日常更常用的表达是“too nice”“excessive politeness”“overly fussy”“too much nicety”。","词源上可理解为 over-（过度）+ nicety（讲究、细致、礼貌），因此既可能指“礼貌过头”，也可能指“细节过头”。"]}
{"word":"overnigh","summary":{"en":"Overnight means “during the night/for one night,” or “very quickly (in a short time).”","zh":"Overnight 可表示“过夜/一夜之间”，也可引申为“很快、短时间内（不一定真的一晚）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Lasting for or happening during one night; from one day to the next morning.","zh":"持续一个晚上或发生在夜间的；从今天到明天早晨的。"},"examples":[{"en":"We stayed in a small town overnight.","zh":"我们在一个小镇过夜。"},{"en":"The doctor kept him in the hospital overnight.","zh":"医生让他在医院留院过夜。"}]},{"partOfSpeech":"adv.","definition":{"en":"Done or happening very quickly, sometimes unexpectedly.","zh":"非常迅速地发生或完成的（有时带有“突然”的感觉）。"},"examples":[{"en":"The app became popular overnight.","zh":"这个应用一夜之间就火了。"},{"en":"Don’t expect to learn English overnight.","zh":"别指望一夜之间就学会英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening during the night; available or active at night.","zh":"夜间发生的；夜间可用或夜间运行的。"},"examples":[{"en":"Overnight flights are often cheaper.","zh":"夜间航班通常更便宜。"},{"en":"The city used overnight road repairs to avoid traffic.","zh":"这座城市用夜间道路维修来避免交通拥堵。"}]}],"synonyms":["during the night","in a single night","all night","suddenly","quickly"],"phonetic":"/ˌoʊvɚˈnaɪt/","extraExplanation":["你输入的“overnigh”少了最后的字母“t”，正确拼写是 **overnight**。","“overnight”在口语和新闻里常用来强调“变化很快”，但不一定真的是“一个晚上”，更多是“很短时间内”的夸张说法。"]}
{"word":"overnight","summary":{"en":"Overnight means “during the night,” “for one night,” or “very quickly (as if in one night).”","zh":"Overnight 表示“在夜间/整夜”、“持续一晚/过夜的”，也可引申为“一夜之间（变化很快）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"during the night; from evening until the next morning","zh":"在夜间；从晚上到第二天早上"},"examples":[{"en":"It rained overnight, so the streets are wet this morning.","zh":"昨晚下了一整夜雨，所以今天早上街道很湿。"},{"en":"The baby slept overnight for the first time.","zh":"宝宝第一次整夜睡着。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or done during the night, or lasting for one night","zh":"夜间发生的/完成的；持续一晚的"},"examples":[{"en":"We took an overnight flight to New York.","zh":"我们乘坐了去纽约的过夜航班。"},{"en":"The hotel offers overnight parking.","zh":"这家酒店提供过夜停车。"}]},{"partOfSpeech":"adv.","definition":{"en":"very quickly; unexpectedly fast, as if in a single night","zh":"一夜之间；很快地（好像一夜就发生了）"},"examples":[{"en":"The small app became popular overnight.","zh":"这个小应用一夜之间火了。"},{"en":"She went from unknown to famous overnight.","zh":"她从默默无闻到一夜成名。"}]}],"synonyms":["during the night","all night","over the course of the night","suddenly","rapidly"],"phonetic":"/ˌoʊvɚˈnaɪt/","extraExplanation":["“Overnight”由“over（跨过）+ night（夜晚）”组成。除了字面“过夜/整夜”，在新闻和口语里常用来强调变化非常快（例如“overnight success”一夜成名），但通常也暗示背后其实有长期努力，只是结果突然被看见。"]}
{"word":"overnighter","summary":{"en":"“Overnighter” can mean an overnight guest/worker, an overnight-delivery package, or a one-night trip.","zh":"“overnighter”可指住一晚的人/连夜工作的人、次日达快件，或只住一晚的短行程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who stays somewhere for one night (an overnight guest), or someone who works/travels overnight (often a courier/driver).","zh":"过夜的人；住一晚的客人；（常指）连夜工作/连夜送件的人（如快递员、司机）。"},"examples":[{"en":"We had two overnighters after the wedding.","zh":"婚礼后我们有两位住一晚的客人。"},{"en":"The overnighters dropped off packages before sunrise.","zh":"连夜送件的人在日出前把包裹送到了。"}]},{"partOfSpeech":"n.","definition":{"en":"a package or letter sent by overnight delivery (arrives the next day).","zh":"隔夜/次日达的快件；隔夜邮件。"},"examples":[{"en":"I’ll send the contract as an overnighter.","zh":"我会把合同用次日达快递寄出。"},{"en":"Did the overnighter arrive this morning?","zh":"那份次日达快件今天早上到了吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a very short trip or stay that lasts only one night.","zh":"只住一晚的短途行程/短住。"},"examples":[{"en":"It’s just an overnighter in Seattle—back tomorrow.","zh":"就去西雅图住一晚，明天就回。"},{"en":"We packed light for the overnighter.","zh":"我们为只住一晚的行程轻装出行。"}]}],"synonyms":["overnight guest","one-nighter","overnight package","overnight shipment","next-day delivery"],"phonetic":"/ˈoʊvɚˌnaɪtɚ/","extraExplanation":["“overnighter”在美式口语和职场/物流语境中很常见：既可指“次日达快件”，也可指“连夜送件的人”。在正式写作里，更常见的说法是“overnight package / overnight delivery”。"]}
{"word":"overnighters","summary":{"en":"“Overnighters” (plural of overnighter) usually means people staying for one night, or items shipped by overnight delivery.","zh":"“overnighters”（overnighter 的复数）通常指只住一晚的人，或指隔夜快递寄送的物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who stays somewhere for just one night (for example, a guest, traveler, or student).","zh":"只住一晚的人（例如过夜的客人、旅客或学生）。"},"examples":[{"en":"We had a couple of overnighters after the wedding, so we set up the guest room.","zh":"婚礼后有几位只住一晚的客人，所以我们把客房收拾好了。"},{"en":"The hostel is fine for overnighters, but it’s not very comfortable for a long stay.","zh":"这家青旅住一晚还行，但不太适合久住。"}]},{"partOfSpeech":"n.","definition":{"en":"Packages or items sent by an overnight delivery service (arriving the next day).","zh":"隔夜快递的包裹或物品（通常次日送达）。"},"examples":[{"en":"The lab got the samples as overnighters, so we could start testing in the morning.","zh":"实验室用隔夜快递收到了样本，所以早上就能开始检测。"},{"en":"Please mark these documents as overnighters if they must arrive tomorrow.","zh":"如果这些文件必须明天到，请标注为隔夜快递。"}]}],"synonyms":["overnight guest","one-night visitor","next-day delivery","overnight shipment"],"phonetic":"ˈoʊvɚˌnaɪtɚ","extraExplanation":["“Overnighter”来自“overnight（过夜的/隔夜的）”。在口语里，它既可以指“只住一晚的人”，也常用于物流语境，指“隔夜快递的包裹/件”。","在商务或医院等场景里，有时也会用“an overnighter”指“临时过夜的轮班/值守人员或临时过夜的安排”，具体含义依上下文而定。"]}
{"word":"overnimble","summary":{"en":"Overnimble means “too quick or agile,” often implying rashness.","zh":"overnimble 表示“过于敏捷/反应太快”，常含“鲁莽、欠考虑”之意。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too quick, agile, or ready to act—often suggesting someone is rash or moves faster than is wise.","zh":"过于敏捷、动作太快或反应太急——常带有“鲁莽、欠考虑”的含义。"},"examples":[{"en":"He was overnimble with his conclusions and didn’t check the facts.","zh":"他下结论太过心急灵活，没有核实事实。"},{"en":"An overnimble reply can sound rude, even if you don’t mean it.","zh":"回答得太快太急，哪怕你无意，也可能显得无礼。"},{"en":"Be careful not to be overnimble in making promises you can’t keep.","zh":"要小心别在做出无法兑现的承诺时太过冲动。"}]}],"synonyms":["overhasty","rash","impulsive","too quick"],"phonetic":"/ˌoʊvɚˈnɪmbəl/","extraExplanation":["“overnimble”不算常用现代词，更常见于较文学化或带古风的表达；有时也会写成“over-nimble”或更古的形式“o’er-nimble”（其中 o’er = over 的诗歌/古体缩写）。","构词上是“over-（过度）+ nimble（敏捷的）”。它强调“快得过头”，所以语气往往偏负面：不仅是“很快”，而是“快到不稳妥/不周全”。","近义表达（更常用）：too quick, overly hasty, rash, impulsive；相对的褒义表达可用：quick-witted（机智的）, nimble-minded（思维敏捷的）。"]}
{"word":"overnipping","summary":{"en":"“Overnipping” is a rare word meaning excessive nipping/damage, especially frost damage to plants overnight.","zh":"“overnipping”是个较罕见的词，指过度的掐伤/冻伤，尤其是夜间霜冻对植物造成的严重伤害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of nipping or damaging something too much, especially when cold or frost harms plants overnight.","zh":"（罕用）过度“掐/咬/伤害”的行为；尤指夜间寒冷或霜冻把植物“冻伤/霜打”得很厉害。"},"examples":[{"en":"The gardener worried about overnipping of the young buds after the sudden cold snap.","zh":"天气突然变冷，园丁担心嫩芽会被夜间霜冻严重冻伤。"},{"en":"Overnipping can stunt new growth if the temperature drops below freezing.","zh":"如果气温降到冰点以下，夜间严重霜冻会抑制新芽生长。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) nipping or damaging something excessively, often referring to frost that bites plants during the night.","zh":"（罕用）过度地掐伤/冻伤；常指夜里霜冻“咬”到植物，造成明显伤害。"},"examples":[{"en":"They covered the seedlings to prevent overnipping by frost.","zh":"他们给幼苗盖上防护物，防止夜里霜冻严重冻伤。"},{"en":"The leaves showed signs of overnipping—dark edges and curling.","zh":"叶子出现了严重霜冻伤害的迹象——边缘发黑并卷曲。"}]}],"synonyms":["overnight frost damage","frostbite","frost nip","cold damage"],"phonetic":"/ˌoʊvərˈnɪpɪŋ/","extraExplanation":["“overnipping”不是常见的现代英语词，更常见的表达是“overnight frost damage / frostbite / frost nip”。它多见于较旧的写法或园艺/农业语境里，用来形容“夜里霜冻把植物咬伤（nipped）得很厉害”。如果你是在文章里看到它，也可能原文是带连字符的“over-nipping”。"]}
{"word":"overnoble","summary":{"en":"“Overnoble” is a rare adjective meaning excessively noble or high-minded, often suggesting it feels unrealistic or too formal.","zh":"“overnoble”是一个较罕见的形容词，意思是“过于高贵/过于高尚”，常暗示不切实际或显得太拘谨、太端着。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Too noble or too high-minded; having more “nobility” (in rank or character) than is appropriate or realistic.","zh":"（罕见）过于高贵的；过于“高尚/有贵族气”的（不合时宜或不切实际）。"},"examples":[{"en":"His overnoble manners made the conversation feel distant and formal.","zh":"他那种过于高贵的举止让谈话显得疏远而拘谨。"},{"en":"The novel criticizes an overnoble hero who refuses to compromise, even when people suffer.","zh":"这部小说批评了一位过于高尚的英雄：他拒绝妥协，哪怕人们因此受苦。"}]}],"synonyms":["overly noble","too noble","excessively honorable","high-minded"],"phonetic":"/ˌoʊvɚˈnoʊbəl/","extraExplanation":["“over-”常表示“过度、太……”，如 overconfident（过于自信）、overprotective（过度保护）。所以 overnoble 通常就是“太高贵/太高尚”，带有“不自然、过头了”的评价色彩。","这个词在现代英语里很少见，更常用的表达是 overly noble、too noble、high-minded（褒义/中性）或 self-righteous（偏贬义，指自以为道德高人一等）。"]}
{"word":"overnobleness","summary":{"en":"“Overnobleness” means being excessively or affectedly noble or aristocratic in a way that feels unnatural.","zh":"“overnobleness”指过度或做作的高贵/贵族气，给人不自然、装出来的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Excessive or affected nobility—behavior, manners, or attitudes that seem overly aristocratic, high-minded, or “too noble,” often in an unnatural or showy way.","zh":"过度的“高贵/贵族气”（矫饰的高尚或贵族式的言行与态度），常带有不自然或做作的意味。"},"examples":[{"en":"His overnobleness made simple conversations feel formal and uncomfortable.","zh":"他的过度“高贵气”让本来简单的聊天变得拘谨又不自在。"},{"en":"The novel gently mocks the hero’s overnobleness, showing how pride can hide insecurity.","zh":"小说温和地讽刺主人公的“过度高尚”，揭示骄傲有时是在掩饰不安。"}]}],"synonyms":["pretentiousness","snobbery","affectedness","airs","high-handedness"],"phonetic":"/ˌoʊvərˈnoʊb(ə)lnəs/","extraExplanation":["“overnobleness”并不是常见的标准词，更像是把 over-（过度）+ nobleness（高贵/高尚）临时组合出来的“造词”，用于表达一种讽刺或强调语气。更自然的表达常用：pretentiousness（做作/装腔作势）、snobbery（势利/摆架子）、affected nobility（矫饰的高贵）、too noble（过于高尚）。","在文学或评论语境中，这类“临时造词”常用来制造幽默或讽刺效果：用一个看似庄重的词去指出某人“端着”“装得太高贵”。"]}
{"word":"overnobly","summary":{"en":"“Overnobly” means “in an overly noble or aristocratic way,” often suggesting affectation or impractical idealism.","zh":"“overnobly”指“过于高贵/贵族化地”，常含“做作或不切实际的理想化”之意。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an overly noble, aristocratic, or high-minded way—often so much that it seems affected, pretentious, or unrealistic.","zh":"以过于高贵、贵族化或过于“高尚”的方式（常带有矫饰、做作或不切实际的意味）。"},"examples":[{"en":"He spoke overnobly about honor, but avoided doing the hard work.","zh":"他把“荣誉”讲得过于高尚，但却回避了真正的苦活。"},{"en":"The speech sounded overnobly moral, and people felt it lacked real solutions.","zh":"那篇演讲道德腔调过于高尚，大家觉得缺少实际解决方案。"}]}],"synonyms":["too nobly","overly nobly","pretentiously","grandly","high-mindedly (often too much)"],"phonetic":"/ˌoʊvɚˈnoʊbli/","extraExplanation":["“overnobly”很少见，多用于批评语气，意思接近“说得太高尚/太贵族气”。在现代英语里，人们更常用短语表达同样意思，比如：in an overly noble way / too nobly / pretentiously noble。"]}
{"word":"overnoise","summary":{"en":"“Overnoise” means to drown out or overwhelm with noise; it is uncommon in modern English.","zh":"“overnoise”指（噪音）盖过/淹没别的声音，或用噪音使人不堪其扰；现代英语中较少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to be louder than something else and make it hard or impossible to hear (drown out).","zh":"（声音）盖过、压过，使别的声音听不清（=淹没）"},"examples":[{"en":"The crowd’s cheers overnoised the announcer’s voice.","zh":"观众的欢呼声盖过了播音员的声音。"},{"en":"Traffic can overnoise birdsong in the early morning.","zh":"清晨的车流声可能会压过鸟鸣。"}]},{"partOfSpeech":"vt.","definition":{"en":"to overwhelm or disturb someone with too much noise.","zh":"用过大的噪音使人受不了；吵得人心烦意乱"},"examples":[{"en":"The construction work overnoised everyone in the office.","zh":"施工的噪音把办公室里的人都吵得受不了。"},{"en":"After hours of music from next door, she felt completely overnoised.","zh":"隔壁放音乐放了好几个小时后，她感觉被吵得不行。"}]}],"synonyms":["drown out","overpower","swamp","deafen"],"phonetic":"/ˌoʊvɚˈnɔɪz/","extraExplanation":["“overnoise”不是常见现代英语词，更常用的表达是“drown out / overpower (with noise) / be too loud for”。它可以理解为由“over-（过度/压过）+ noise（噪音）”构成的动词，带有较强的书面或较旧式用法色彩。"]}
{"word":"overnormal","summary":{"en":"“Overnormal” is an uncommon term meaning “too normal” or “over-normalized,” often with a critical tone.","zh":"“overnormal”较不常见，常指“过于正常/过于普通”，或“过度归一化/标准化”，多带批评语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon, informal) More than normal; excessively or overly normal, typical, or conventional.","zh":"（不常见，非正式）比正常更“正常”；过于普通、典型或循规蹈矩的。"},"examples":[{"en":"The movie felt overnormal—everything was predictable and safe.","zh":"这部电影感觉太“正常”了——一切都可预测、很安全。"},{"en":"In an overnormal office culture, people avoid new ideas to keep things comfortable.","zh":"在一种过于“正常”的办公室文化里，人们会为了维持舒适而回避新点子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical-ish) Over-normalized; adjusted to the point that important differences or features are reduced.","zh":"（少见，偏技术）过度归一化/过度标准化；调整过头，以至于重要差异或特征被削弱。"},"examples":[{"en":"The data may look clean, but it’s overnormal and loses meaningful variation.","zh":"数据看起来很“干净”，但可能过度归一化，丢失了有意义的变化。"},{"en":"If the algorithm makes all images overnormal, the results can seem flat.","zh":"如果算法把所有图片都处理得过度一致，结果可能会显得很平。"}]}],"synonyms":["too normal","overly conventional","excessively typical","over-normalized","over-standardized"],"phonetic":"/ˌoʊvɚˈnɔrməl/","extraExplanation":["“overnormal”不是常见标准词，更多是由前缀 over-（过度）+ normal（正常）临时组合出来的用法，因此在正式写作里可能显得不自然。更常见的替代说法包括：too normal / overly conventional / excessively typical，技术语境里常用 over-normalized 或 over-standardized。","语感上它常带一点批评意味：并不是在夸“很正常”，而是说“正常到无聊/缺乏个性/被过度规范”。"]}
{"word":"overnormality","summary":{"en":"Overnormality is when abnormal conditions become accepted as normal, so people stop questioning or resisting them.","zh":"“Overnormality（过度常态化）”指不正常的状况被当成正常而被接受，人们逐渐不再质疑或反抗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation or feeling where unusual, unstable, or unhealthy conditions become accepted as “normal,” so people stop reacting to them as problems.","zh":"一种情况或感受：不寻常、不稳定或不健康的状态被人们当作“正常”接受，以至于逐渐不再把它们当作问题来反应。"},"examples":[{"en":"After years of constant crises, overnormality set in and people stopped expecting leaders to fix anything.","zh":"在多年不断的危机之后，“过度常态化”出现了，人们不再指望领导人能解决任何问题。"},{"en":"The company’s overtime culture became a kind of overnormality—everyone acted like exhaustion was normal.","zh":"公司的加班文化变成了一种“过度常态化”——大家都把疲惫当成理所当然。"},{"en":"Living with daily misinformation can create overnormality, making extreme claims feel ordinary.","zh":"每天接触错误信息可能会造成“过度常态化”，让极端说法听起来也很普通。"}]}],"synonyms":["hypernormalization","normalization (in a negative sense)","desensitization","complacency","resignation"],"phonetic":"/ˌoʊvɚnɔrˈmælɪti/","extraExplanation":["“overnormality”常被认为因英国纪录片导演 Adam Curtis 的作品《HyperNormalisation》（2016）而流行起来，用来描述一种社会心理：当现实越来越荒诞或复杂，人们为了继续生活与工作，会用“这就是常态”来麻痹自己。","相关概念可对比：normalization（常态化，偏中性）与 overnormality/“hypernormalisation”（对不正常的事也过度当作正常，带批判意味）。"]}
{"word":"overnormalization","summary":{"en":"Overnormalization means using too much normalization/standardization, which can remove important differences and make results worse or less meaningful.","zh":"Overnormalization 指“过度归一化/过度标准化”，会削弱或抹掉重要差异，使结果变差或更不具意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In machine learning and statistics) the use of too much normalization, so important differences or “signal” in the data get reduced or removed, which can hurt model performance or interpretation.","zh":"（机器学习与统计中）过度使用归一化/标准化，导致数据中重要差异或“信号”被削弱甚至被抹平，从而影响模型效果或解释。"},"examples":[{"en":"If you apply normalization repeatedly, you may get overnormalization and lose meaningful variation in the features.","zh":"如果你反复做归一化，可能会产生过度归一化，导致特征中有意义的变化被丢失。"},{"en":"Overnormalization can make rare but important patterns look like noise.","zh":"过度归一化会让罕见但重要的模式看起来像噪声。"},{"en":"We saw accuracy drop after aggressive scaling—likely an overnormalization issue.","zh":"在激进缩放之后准确率下降——很可能是过度归一化的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(More general) making something too uniform or “standard,” removing natural differences in style, language, or behavior.","zh":"（更一般的用法）把事物“规范化/统一化”过头，抹去自然的风格差异、语言差异或行为差异。"},"examples":[{"en":"Some editors worry that overnormalization can erase an author’s unique voice.","zh":"一些编辑担心过度规范化会抹掉作者独特的声音。"},{"en":"Overnormalization in customer service scripts can make conversations feel robotic.","zh":"客服话术的过度统一会让对话显得很机械。"}]}],"synonyms":["excessive normalization","over-standardization","over-smoothing"],"phonetic":"/ˌoʊvɚˌnɔɹməlaɪˈzeɪʃən/","extraExplanation":["这个词通常出现在数据处理与机器学习语境里，对应的“normalization”可能指：把数值缩放到0-1区间、做z-score标准化、或按样本/特征做归一化等。“over-”表示“过度”。关键问题不是“不能归一化”，而是“归一化的方式、范围、次数不当”，比如把本应保留的幅度信息抹平，或把训练/测试混在一起做缩放导致分布信息泄露与失真。"]}
{"word":"overnormalize","summary":{"en":"“Overnormalize” means to normalize something excessively, hiding important differences or problems.","zh":"“Overnormalize”指把某事过度正常化/过度归一化，导致重要差异或问题被掩盖。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To normalize too much—either by adjusting data or behavior excessively so that important differences, problems, or “real” variation get hidden.","zh":"过度归一化/过度常态化——把数据或行为“调得太正常”，以至于重要差异、问题或真实波动被掩盖。"},"examples":[{"en":"If you overnormalize the dataset, the model may miss meaningful signals.","zh":"如果你对数据集过度归一化，模型可能会错过有意义的信号。"},{"en":"We shouldn’t overnormalize harmful behavior just because it happens often.","zh":"我们不应该因为某些有害行为很常见就把它过度常态化。"}]}],"synonyms":["normalize too much","over-standardize","over-smooth","flatten (differences)","overcorrect"],"phonetic":"/ˌoʊvɚˈnɔrməˌlaɪz/","extraExplanation":["“overnormalize”由前缀 over-（过度）+ normalize（使正常化/标准化/归一化）构成，意思就是“做过头了”。在数据科学语境里常指过度处理（如缩放/标准化）导致信息被抹平；在社会语境里常指把不健康或不公正的现象说成“很正常”，从而淡化其严重性。","这个词在日常口语中不算常见，更常见的替代说法有：over-standardize, over-smooth, normalize too much, treat as normal."]}
{"word":"overnormalized","summary":{"en":"Overnormalized means made too uniform by normalization, causing meaningful differences to be lost.","zh":"Overnormalized 指因归一化/标准化过度而变得过于一致，导致有意义的差异被抹去。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made too uniform or standard by normalization, so that important differences, context, or natural variation are reduced or lost","zh":"（因「归一化/标准化」做得过头而）过度同质化、过度标准化，导致重要差异、语境或自然变化被削弱或消失"},"examples":[{"en":"The photos looked overnormalized—skin tones became unnaturally similar across different people.","zh":"这些照片看起来过度标准化——不同人的肤色被处理得不自然地相似。"},{"en":"If your data are overnormalized, the model may miss meaningful signals.","zh":"如果数据被过度归一化，模型可能会错过有意义的信号。"},{"en":"Some critics say the curriculum is overnormalized and leaves little room for local culture.","zh":"一些批评者说这套课程过度标准化，几乎不给本地文化留下空间。"}]}],"synonyms":["overstandardized","overprocessed","overregularized","homogenized"],"phonetic":"/ˌoʊvərˈnɔrməˌlaɪzd/","extraExplanation":["这个词常见于数据科学/统计/机器学习语境：归一化（normalization）本来是为了让不同量纲或范围的数据更可比，但“过度归一化”可能把本来有信息量的差异也一起抹平。","也可用于更广义的社会与文化讨论：当规则、审美或流程被统一到过头，就会出现“过度同质化”，例如城市街区变得千篇一律。","构词上是 over-（过度）+ normalized（被归一化/标准化的）；多用于批评某种处理或政策“矫枉过正”。"]}
{"word":"overnormalizing","summary":{"en":"Overnormalizing means normalizing something too much, often flattening real differences or making results less natural or less accurate.","zh":"overnormalizing 指“过度规范化/过度归一化”，常会抹平真实差异，使结果不自然或不准确。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of normalizing something too much, so it becomes less accurate, less useful, or less natural (often by forcing it to fit a “standard” unnecessarily).","zh":"过度规范化；把事物“标准化/正常化”得过头，导致不准确、不实用或不自然（常指不必要地强行符合某种“标准”）。"},"examples":[{"en":"Overnormalizing the data can remove meaningful differences between groups.","zh":"对数据过度规范化可能会抹掉群体之间有意义的差异。"},{"en":"In writing, overnormalizing dialogue can make characters sound unnatural.","zh":"在写作中，过度规范化对话会让角色说话听起来不自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"Normalizing too much; applying normalization excessively, often causing distortion or loss of important detail.","zh":"过度地进行规范化/归一化；过分应用“标准化”，常导致失真或丢失重要细节。"},"examples":[{"en":"The model performed worse after overnormalizing the input features.","zh":"对输入特征过度归一化后，模型表现反而变差了。"},{"en":"We may be overnormalizing cultural differences by treating one style as the default.","zh":"把一种风格当作默认标准，可能是在过度“正常化”文化差异。"}]}],"synonyms":["overstandardizing","overcorrecting","flattening (differences)","overprocessing"],"phonetic":"/ˌoʊvɚˈnɔɹməˌlaɪzɪŋ/","extraExplanation":["“overnormalizing”常见于数据分析/机器学习语境：normalization（归一化、标准化）本来用于让不同量纲的数值更可比，但“过度”处理可能把本来有信息量的幅度、差异或异常值一并压平，从而影响解释性或预测效果。","在人文与社会语境里，它也可指把某种行为、语言或文化当成“唯一正常”的标准，进而忽视多样性；这种用法带有批评意味。"]}
{"word":"overnormally","summary":{"en":"“Overnormally” is a rare, nonstandard adverb meaning “more than normal; excessively.”","zh":"“overnormally”是很少见且不太规范的副词，意思是“超过正常程度；过度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard/rare) More than normal; excessively; beyond what is typical.","zh":"（非标准/少见）比正常程度更高；过度地；超出常规地。"},"examples":[{"en":"The room was overnormally quiet after the argument.","zh":"争吵之后，房间里安静得有些反常（过度地安静）。"},{"en":"If you feel overnormally tired for days, talk to a doctor.","zh":"如果你连续几天都感到异常疲惫，建议咨询医生。"}]}],"synonyms":["abnormally","unusually","excessively","more than normal"],"phonetic":"/ˌoʊvərˈnɔrməli/","extraExplanation":["“overnormally”在现代英语中非常少见，很多母语者会觉得不自然或不规范。写作或正式场合更建议用更常见的表达，如：“abnormally”（异常地）、“unusually”（异常地/不同寻常地）、“more than normal”（比平时更……）、“excessively”（过度地）。","构词上它像是“over-（过度）+ normally（正常地）”，因此意思容易猜到，但实际使用频率很低。"]}
{"word":"overnotable","summary":{"en":"“Overnotable” means too noticeable or unduly prominent (a rare/nonstandard word).","zh":"“overnotable”意为“过于显眼/过分突出”（较少见、偏非标准用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too notable, remarkable, or conspicuous; more noticeable or important than is appropriate in the context.","zh":"过于显眼的；过分引人注目的；（在语境中）显得太重要、太突出的。"},"examples":[{"en":"The director cut a few lines because the joke felt overnotable and distracted from the main story.","zh":"导演删掉了几句台词，因为那个笑点太过显眼，反而分散了主线剧情。"},{"en":"Her bright red coat was overnotable at the quiet memorial service.","zh":"在安静的追悼会上，她那件鲜红的外套显得过于显眼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Overly worth noticing or commenting on; seeming to invite more attention than something deserves.","zh":"过分值得被注意或被评论的；显得“太需要被关注”。"},"examples":[{"en":"He tried to sound clever, but the reference was overnotable and came off as forced.","zh":"他想显得聪明，但那个典故太刻意、太抢眼，听起来反而生硬。"},{"en":"The headline is overnotable for such a minor update.","zh":"对这么小的更新来说，这个标题显得太夸张、太引人注意了。"}]}],"synonyms":["overly noticeable","too conspicuous","unduly prominent","too remarkable","showy"],"phonetic":"/ˌoʊvɚˈnoʊtəbəl/","extraExplanation":["“overnotable”不是常见标准词，更像是由 over-（过度）+ notable（显著的、值得注意的）临时组合出来的形容词，带有“过头了”的评价色彩。正式写作中更常用 overly noticeable / too conspicuous / unduly prominent 等表达。"]}
{"word":"overnourish","summary":{"en":"Overnourish means to give too much food or nutrition, more than is needed or healthy.","zh":"overnourish 指提供过多食物或营养，超过需要或不利于健康。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to feed someone or something too much; to provide more food or nutrients than is healthy or needed","zh":"过度喂养；过量供给营养（多到不健康或不需要）"},"examples":[{"en":"Some parents may overnourish their children by giving large portions and too many snacks.","zh":"有些父母可能会因为分量过大、零食太多而过度喂养孩子。"},{"en":"If you overnourish a plant with fertilizer, its leaves can burn and growth may weaken.","zh":"如果给植物施肥过量（过度供养），叶子可能会被“烧伤”，生长反而变弱。"}]}],"synonyms":["overfeed","overindulge","overfertilize (for plants)","provide excessive nutrition"],"phonetic":"/ˌoʊvɚˈnɝɪʃ/","extraExplanation":["“overnourish”不是非常常见的日常用词，更常见的说法是：overfeed（过度喂食）、over-nourish（加连字符）、provide too much nutrition（提供过多营养）。在健康、育儿、畜牧或园艺语境中更容易见到。"]}
{"word":"overnourishingly","summary":{"en":"“Overnourishingly” means “in an overly nourishing or excessively filling way.”","zh":"“overnourishingly”表示“以过度滋养/过于让人饱腻的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an excessively nourishing or overly feeding way; so much that it is more than needed.","zh":"以过度滋养或过量喂养的方式；多到超过需要的程度。"},"examples":[{"en":"The meal was rich and heavy—almost overnourishingly so for a hot day.","zh":"这顿饭油腻又厚重——在炎热的天气里几乎可以说是“过度滋养”了。"},{"en":"Some wellness products are marketed as overnourishingly powerful, but more isn’t always better.","zh":"有些保健产品被宣传得“滋补得过头”，但并不是越多越好。"}]}],"synonyms":["excessively","overly","too richly","too heavily","overfedly"],"phonetic":"/ˌoʊvɚˈnɝɪʃɪŋli/","extraExplanation":["“overnourishingly”非常少见，更多时候英语会用更自然的表达来替代，比如：“too rich,” “overly nourishing,” “excessively filling,” “too heavy.”","构词：over-（过度）+ nourish（滋养/喂养）+ -ing（形容词化）+ -ly（副词化）。常见的是“overly nourishing”或“over-nourishing”，而不是把它们合成一个长词。"]}
{"word":"overnourishment","summary":{"en":"Overnourishment means getting more food or nutrition than the body needs.","zh":"Overnourishment 指营养或食物摄入超过身体需要的“营养过剩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of having too much food or nutrition; excessive intake of calories or nutrients","zh":"营养过剩；摄入的食物或营养素过多的状态"},"examples":[{"en":"Overnourishment can lead to weight gain and other health problems over time.","zh":"营养过剩久而久之可能导致体重增加以及其他健康问题。"},{"en":"The doctor warned that overnourishment is just as risky as undernourishment.","zh":"医生提醒说，营养过剩和营养不足一样有风险。"}]}],"synonyms":["overnutrition","overfeeding","excess nutrition"],"phonetic":"/ˌoʊvərˈnɝɪʃmənt/","extraExplanation":["“Overnourishment”在日常英语中不算特别常见，更常见的表达是“overnutrition”（营养过剩）或根据情境用“overfeeding”（过度喂养）、“excess calorie intake”（热量摄入过多）来说明具体问题。","它常用于医学、营养学或公共健康语境，强调“营养/能量摄入超过身体需要”，不一定等同于“吃得很丰盛”，而是指长期的“过量”。","相关对比词：undernourishment（营养不良/营养不足）。英语里也常用“malnutrition”泛指营养不良（既可能是不足，也可能是过剩或不均衡），需看上下文。"]}
{"word":"overnoveled","summary":{"en":"“Overnoveled” is a rare/nonstandard word meaning “overly novel-like” or “adapted into a novel,” often implying too much dramatization.","zh":"“overnoveled”是罕见／非标准用法，常指“过度小说化（太像小说、太戏剧化）”，也可指“被改编成小说”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Written or presented as a novel to an excessive degree—too “novel-like,” with added drama, detail, or fictionalized storytelling.","zh":"（罕见／非标准用法）被过度“小说化”的——呈现得太像小说，加入过多戏剧性、细节或虚构叙述。"},"examples":[{"en":"The documentary felt overnoveled, as if every scene had been rewritten for maximum drama.","zh":"这部纪录片给人一种过度小说化的感觉，好像每个场景都被改写成最戏剧化的版本。"},{"en":"Some readers said the memoir was overnoveled and hard to trust as a factual account.","zh":"有些读者说这本回忆录太小说化了，让人很难把它当作可靠的事实记录。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Turned into a novel; adapted in novel form.","zh":"（罕见）被改写成小说；以小说形式改编的。"},"examples":[{"en":"The story was later overnoveled into a longer narrative with extra characters.","zh":"这个故事后来被改写成更长的叙事，还加了额外角色。"},{"en":"Fans argued the film didn’t need to be overnoveled because the original plot was already strong.","zh":"粉丝认为这部电影没必要再被小说化改写，因为原本的剧情已经很扎实。"}]}],"synonyms":["over-novelized","overdramatized","fictionalized","novelized","overly novelistic"],"phonetic":"ˌoʊvɚˈnɑvəld","extraExplanation":["“overnoveled”不是常见标准词，写作和出版领域更常用：**over-novelized / overnovelized**（过度小说化）或 **novelized**（改编成小说）。","构词上可以理解为 **over-**（过度）+ **novel**（小说）+ **-ed**（形容词化，表示“被……的”）。如果你想表达“把真实内容写得像小说一样夸张”，用 **over-novelized / overly novelistic** 会更自然。"]}
{"word":"overnumber","summary":{"en":"Overnumber means to be greater in number than someone or something (same idea as outnumber).","zh":"overnumber 表示“在数量上超过”，意思与 outnumber 基本相同，但较少见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To be greater in number than; to outnumber.","zh":"在数量上超过；多于（= outnumber）。"},"examples":[{"en":"In the final vote, supporters overnumbered opponents by a wide margin.","zh":"在最后投票中，支持者人数远远超过反对者。"},{"en":"In some cities, renters overnumber homeowners.","zh":"在一些城市里，租房者人数多于房主。"}]}],"synonyms":["outnumber","exceed in number","be more numerous than"],"phonetic":"/ˌoʊvɚˈnʌmbɚ/","extraExplanation":["“overnumber”是比较少见的用法；现代英语里更常用、更自然的是“outnumber”。在写作或正式表达中，优先选择“outnumber”，除非你在读到历史文本或想用更古风/文学的措辞。"]}
{"word":"overnumerous","summary":{"en":"“Overnumerous” means too many in number—more than needed or manageable.","zh":"“overnumerous”表示“数量过多”，超过所需或可承受的范围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too many in number; more than is needed or allowed.","zh":"数量过多的；超出需要或规定的。"},"examples":[{"en":"The club limited membership because the applicants became overnumerous.","zh":"俱乐部限制会员人数，因为申请者变得过于众多。"},{"en":"In peak season, the tourists were overnumerous for the small town’s roads and hotels.","zh":"旺季时，游客数量对这个小镇的道路和旅馆来说过多了。"}]}],"synonyms":["too many","excessive","overabundant","supernumerary","numerous (in context of excess)"],"phonetic":"/ˌoʊvərˈnuːmərəs/","extraExplanation":["这是一个较正式、较少见的词，由 over-（“过度、超过”）+ numerous（“众多的”）构成，语气比 too many 更书面，常用于描述“人数/数量过多”带来的压力或不便。"]}
{"word":"overnumerously","summary":{"en":"“Overnumerously” means “in too great a number; excessively.” It is rare in modern English.","zh":"“overnumerously”意为“数量过多地；过量地”，但在现代英语中很少用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In excessively large numbers; in a way that includes too many people or things.","zh":"数量过多地；以人数/数量超出需要或限度的方式。"},"examples":[{"en":"The crowd was overnumerously large for the small venue.","zh":"对这个小场地来说，人群多得过分。"},{"en":"The committee was overnumerously staffed, which slowed decision‑making.","zh":"委员会人员配得太多，反而让决策变慢。"}]}],"synonyms":["excessively","in excessive numbers","overly","too many"],"phonetic":"/ˌoʊvərˈnuːmərəsli/","extraExplanation":["“overnumerously”在现代英语里非常少见，读者更常看到形容词“overnumerous”（人数/数量过多）或更自然的表达如“in excessive numbers / in too great a number / overly numerous”。","构词上来自“over-（过度）+ numerous（众多的）+ -ly（副词后缀）”。在正式或学术写作中，通常建议改用更常见的说法以避免显得生硬或晦涩。"]}
{"word":"overnumerousness","summary":{"en":"Overnumerousness means having too many of something—an excessive number.","zh":"overnumerousness 指“数量过多、过于众多”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being too numerous; an excessive number of people or things","zh":"数量过多；过于众多的状态"},"examples":[{"en":"The overnumerousness of emails in my inbox made it hard to find urgent messages.","zh":"收件箱里邮件数量过多，让我很难找到紧急信息。"},{"en":"Some residents complained about the overnumerousness of tourists during the holiday season.","zh":"一些居民抱怨假日期间游客过于众多。"}]}],"synonyms":["excess","overabundance","surplus","plethora","overcrowding"],"phonetic":"/ˌoʊvərˈnuːmərəsnəs/","extraExplanation":["这个词非常少见、偏正式，日常英语里更常用：too many（太多）、an excess of...（过量的……）、overcrowding（过度拥挤，多用于人群/空间）、a glut（供给过剩，多用于市场/商品）。","构词法：over-（过度）+ numerous（众多的）+ -ness（名词后缀，表示“……的状态/性质”）。因为结构长、读写不便，所以实际使用频率不高。"]}
{"word":"overnurse","summary":{"en":"“Overnurse” means to care for someone too much—overprotecting or overhelping in a way that can hold them back.","zh":"“Overnurse”指过度照顾/过分呵护，照顾得太多以至于可能反而拖累对方。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take care of (someone or something) too much, especially by giving too much attention, protection, or help; to “baby” someone in a way that may slow their independence or recovery","zh":"过度照顾；过分呵护（尤指给太多关注、保护或帮助，可能反而妨碍独立或康复）"},"examples":[{"en":"She meant well, but she tended to overnurse her younger brother and do everything for him.","zh":"她是好意，但总是过度照顾弟弟，什么都替他做。"},{"en":"Doctors warned that overnursing the injury could make him afraid to move and slow down his return to training.","zh":"医生提醒，若对伤处过度照顾，可能会让他不敢活动，反而拖慢回到训练的进度。"}]}],"synonyms":["overprotect","coddle","pamper","mollycoddle"],"phonetic":"/ˌoʊvɚˈnɝs/","extraExplanation":["“overnurse”不是很常见的日常用词，更常见的表达包括：overprotect（过度保护）、coddle（溺爱/娇惯）、pamper（娇宠/过分照料）。在写作里用“overnurse”常带一点批评意味：照顾得太多，反而不利。"]}
{"word":"overnursed","summary":{"en":"“Overnursed” describes someone who has been cared for or protected too much, often becoming less independent.","zh":"“overnursed”指被照顾或保护得过度的人，常暗示因此不够独立。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"given too much care, attention, or protection (especially by being nursed or looked after too much); overprotected and not encouraged to be independent","zh":"被过度照顾/过度呵护的（尤其指被照料得太多）；因此缺乏独立性"},"examples":[{"en":"Some people think he grew up overnursed and never learned to solve problems on his own.","zh":"有人认为他从小被过度呵护，所以从没学会自己解决问题。"},{"en":"Overnursed children may feel anxious when they have to do things independently.","zh":"被过度照顾的孩子在必须独立做事时可能会感到焦虑。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “overnurse”: to nurse or care for someone too much","zh":"“overnurse”的过去式/过去分词：对某人照料得过多、呵护过度"},"examples":[{"en":"He felt his mother had overnursed him after the injury.","zh":"他觉得自己受伤后，母亲把他照顾得过头了。"}]}],"synonyms":["overprotected","coddled","pampered","babied"],"phonetic":"/ˌoʊvɚˈnɝst/","extraExplanation":["“overnursed”由 over-（过度）+ nurse（照料/护理）构成，常带一点批评意味：关心本身是好的，但“过度”可能让人失去练习独立与承受挫折的机会。","这个词在日常对话里不算最常见，更常见的近似表达有 overprotected（被过度保护的）、coddled（被溺爱/娇惯的）。"]}
{"word":"overnursing","summary":{"en":"Overnursing means giving more nursing care or attention than necessary.","zh":"overnursing 指“过度护理/过度照护”，即给予超过需要的护理或关注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or practice of giving more nursing care or attention than is needed; excessive nursing","zh":"过度护理；护理过多（给予超过需要的照护与关注）"},"examples":[{"en":"The supervisor warned that overnursing can reduce a patient’s independence during recovery.","zh":"主管提醒：过度护理可能会降低病人在康复期间的自理能力。"},{"en":"They discussed whether the resident was receiving overnursing instead of learning to do things alone.","zh":"他们讨论这位住院者是否被过度护理了，而不是学习自己完成一些事情。"}]},{"partOfSpeech":"v.","definition":{"en":"to nurse too much; to provide more care or attention than is appropriate","zh":"过度照护；照护过多（给予不恰当的过量护理/关注）"},"examples":[{"en":"Try not to overnurse the wound; follow the doctor’s cleaning schedule.","zh":"别把伤口护理过度；按照医生的清洁频率来做。"},{"en":"New parents may overnurse because they are anxious, not because the baby truly needs it.","zh":"新手父母可能因为焦虑而过度照护，并非宝宝真的需要那么多。"}]}],"synonyms":["excessive care","overcare","overattention","overprotect"],"phonetic":"/ˌoʊvərˈnɝsɪŋ/","extraExplanation":["“overnursing”常见于护理与照护语境，强调“超过需要”的照料，可能导致依赖、恢复变慢或资源浪费。日常英语里更常用的表达还有“overcare”或“overprotect”，但在医疗/护理讨论中“overnursing”更贴切。","它通常来自动词“overnurse”（不太常见，但可理解），也可以作为动名词使用（如：Overnursing can be harmful.）。"]}

